<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Club-Infos</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="apc0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="apc.html" ALT="zur&uuml;ck">
	</MAP> 

	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000080">
	<TR>
	    <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">C l u b - I n f o s</FONT></B></H1>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#FF00FF" WIDTH="90%">
	    <TR>
		<TD>
		<BR>
		<P>Hallo Leute!</P>

		<P>Tja, es hat sich in letzter Zeit einiges getan.<BR>
		Ich mu&szlig; Euch leider erst einmal mitteilen das unser
		DiskMag, AmigaFire gestorben ist. Aber keine Panik, als Ersatz
		f&uuml;r die AF bieten wir Euch unser neues ClubMag die NoCover
		an. Sie wird auch als Ersatz f&uuml;r alle AF-Abos &amp; NL-Abos
		herausgeschickt.<BR>
		<BR>
		Ich (Andreas) habe mich vom Michael und Nils getrennt. Warum
		m&ouml;chte ich hier nicht mehr lange erkl&auml;ren. Sollte ja
		inzwischen bekannt sein.<BR>
		<BR>
		Momentan bieten wir noch nicht so viele Leistungen, wie wir es
		gerne selber h&auml;tten. Allerdings mu&szlig; ich sagen, das
		inzwischen doch schon einiges zusammengekommen ist!
		Nat&uuml;rlich wollen wir noch mehrere Leistungen
		einf&uuml;hren. Dazu baruchen wir aber nat&uuml;rlich auch Eure
		Unterst&uuml;tzung. Welche Leistungen sollen wir noch
		einf&uuml;hren? Wer will freiwillig mitarbeiten ?<BR>
		<BR>
		ACHTUNG ! AB dem 1.1.95 m&uuml;ssen User die in den Club
		eintreten wollen ein Abo der NoCover bestellen.<BR>
		Wir wollen uns damit vor sogenannten "Toten Mitgliedern"
		sch&uuml;tzen. Ausserdem stellen wir immer wieder fest, das
		gerade neue Mitglieder ein Medium brauchen wo sie
		regelm&auml;ssig Clubinformationen bekommen. Wie sich jeder
		ausrechnen kann verdienen wir so gut wie nichts an der NoCover.
		Es ist also keine Geldabschneiderei!<BR>
		<BR>
		<BR>
		Aber jetzt erst mal die ganzen Leistungen f&uuml;r Clubmitglieder :</P>
		<BR>
		<UL>
		    <LI>PD-Pool f&uuml;r DM 1,50 zzgl.Versandkosten &uuml;ber
			unseren APC&amp;TCP-Vertrieb.
		    <LI>Superbillige PD-Abos f&uuml;r diverse Serien,
			Virenkiller, NoCover usw.
		    <LI>PD-Tausch (Wir suchen besonders Demos, Pics, Sounds.)
		    <LI>Sammelbestellungen &uuml;ber das Diskmagazin NoCover,
			InfoDisk &amp; Mailbox!
		    <LI>Kostenlose Hilfen aller Art
		    <LI>Verbraucherschutz
		    <LI>Unterst&uuml;tzung von Programmierer/Innen
		    <LI>Unterst&uuml;tzung von Anf&auml;ngern/Profis
		    <LI>Softwareentwicklung
		    <LI>Softwarevertrieb, ohne das der Autor seine Rechte verliert.
		    <LI>Vermarktung Eurer Programme.
		    <LI>Eigene PD-Serie
		    <LI>Usertreffen (Nicht nur eigene.)
		    <LI>Partys (Nicht nur eigene.)
		    <LI>Regionale Clubtreffen (Nicht nur eigene.)
		    <LI>Veranstaltungshinweise
		    <LI>Evtl. auch Kartenvorverkauf zu Sonderpreisen f&uuml;r Messen
		    <LI>Aktuelle Infos &uuml;ber unsere Hotlines
		    <LI>Aktuelle Infos &uuml;ber unser ClubMag NoCover
		    <LI>Aktuelle Infos &uuml;ber unsere Mailboxen.
		    <LI>Nat&uuml;rlich NoCover. Unser Diskmagazin. Sollte jeder
			haben um aktuell informiert zu sein! Erscheint alle 4 Wochen
			auf 2 Disks.
		</UL>
		<BR>
		<UL>
		    <LI>Nat&uuml;rlich auch kostenlose Kleinanzeigen in der
			NoCover &amp; InfoDisk.
		    <LI>Neue KontakteDatenbank. Besser als je zuvor.
		    <LI>Mitglieder helfen Mitglieder. Hier seid ihr gefordert.
		    <LI>Fragen und Antworten.
		    <LI>Mailboxen. Und nat&uuml;rlich das eigene Netz ALCATRAZ !
		    <LI>In den Hausmailboxen von uns ein h&ouml;heres Up/DOWN-Ratio.
		    <LI>DFUE-Service. Wir verschicken Eure Mails per DFUE gegen
			Unkosten. (Normale Netzmails sind nat&uuml;rlich kostenlos!)
			Hier ist gemeint, wenn wir extra f&uuml;r Euch in einer
			bestimmten Box anrufen sollen !
		    <LI>Picture Druck-Service durch ein Clubmitglied
		    <LI>T-Shirt Bedruck Serive durch ein Clubmitglied
		    <LI>Senden Eurer Prg. an PD-Serien wie z.B. Fish oder auch
			an Zeitschriften.
		    <LI>Kontakte zu diversen Fachzeitschriften.
		    <LI>Per Hotline: Abfrage unserer Games Tips &amp; Tricks Datenbank.
		    <LI>Digiservice f&uuml;r Pic &uuml;ber 2 unserer Mitglieder.
		    <LI>Digiservice f&uuml;r Sounds &uuml;ber eines unserer Mitglieder !
		    <LI>Tausch von Original-Software (Kein Kauf)
		    <LI>Mitglieder erhalten auf fast alle Angebote vom
			APC&amp;TCP-Vertrieb Rabatt 5% Rabatt vom Nettoverkaufspreis
			(au&szlig;er Artikel mit #).
		</UL>
		<BR>
		<P>
		Ich rate jedem sich ein Abo der NoCover zu besorgen. Nur auf
		diese Art und Weise bekommt man regelm&auml;&szlig;ig eine
		aktuelle Sonderangebotsliste und Sammelbestellungsliste. Man
		kann aber nat&uuml;rlich auch jederzeit anrufen und nachfragen.
		Ab und zu sollte man sich auch die aktuelle InfoDisk bestellen
		(LeerDisk&amp;R&uuml;ckporto). Falls man nach einer &auml;lteren
		bestellt, sollte man vorher nachfragen, ob die Preise noch
		stimmen! Die InfoDisk wird w&ouml;chentlich ge&auml;ndert und
		neu erstellt !<BR>
		<BR>
		Der APC&amp;TCP-Vertrieb ist KEINE Firma, die einen Computerclub
		gegr&uuml;ndet hat! Nein, sie ist eine Firma, die von einem
		Computerclub gegr&uuml;ndet wurde, um den Clubmitgliedern neue
		und bessere Leistungen zu bieten. Hauptaufgabe war es, die
		selbstgeschriebenen Programme/Games komerziell zu vermarkten,
		ohne das der Programmierer dabei seine Rechte verliert. Dies ist
		ja normalerweise so &uuml;blich! Hierbei hatten wir auch sehr
		viel Erfolg und das ganze hat ziemlichen Anklang bei den
		Programmierern gefunden. Deshalb wollen wir das jetzt ausbauen.
		Wir versuchen momentan Hardware zu g&uuml;nstigen Preisen zu
		besorgen und zu verkaufen. Ich glaube, das wir zur Zeit
		einigerma&szlig;en gute Preise bieten k&ouml;nnen. Klar
		BBM-Preise schaffen wir nicht, daf&uuml;r haben wir aber auch
		nicht diesen Wunderbaren negativen Ruf. Aber umso mehrere
		Mitglieder diesen Service in Gebrauch nehmen umso
		preisg&uuml;nstiger werden wir mit der Zeit werden.<BR>
		<BR>
		Nat&uuml;rlich suchen wir auch noch H&auml;ndler, die unsere
		eigenen Produkte anbieten und verkaufen. Auch Clubleitungen
		anderer Clubs sind hier gefordert. Ruft doch mal an! Wenn jemand
		Kontakte zu g&uuml;nstigen Gro&szlig;h&auml;ndlern hat,
		w&auml;re es nett, wenn man uns an diese vermitteln k&ouml;nnte.
		Clubmitglieder erhalten &uuml;brigends auf fast alle Produkte
		einen Rabatt.<BR>
		<BR>
		Wir haben nat&uuml;rlich immer eine aktuelle InfoDisk wo unsere
		Angebote alle gespeichert sind. Alle FD-Listen sind auch auf
		dieser Disk. Und nat&uuml;rlich sind alle unseren eigenen
		Produkte hier genau erkl&auml;rt. Sammelbestellungen &amp;
		Sonderangebote sind hier auch verewigt.<BR>
		Auf dieser Disk findet Ihr &uuml;brigens auch immer alle
		aktuellen Infos &uuml;ber den NEUEN Club (Kontaktedatenbank,
		Kontaktadressen, Mitglieder helfen Mitgliedern, Usertreffen,
		Sonderangebote usw.)! Es lohnt sich diese Disk im Abo zu haben
		oder sie ab und zu, zu bestellen.<BR>
		<BR>
		Au&szlig;erdem befindet sich auf unserer InfoDisk auch noch eine
		Ansammlung diverser Kleinanzeigen. Wer hier verewigt werden
		will, sollte uns seine Anzeige AUF DISKETTE IM ASCII-Format
		&amp; R&uuml;ckporto an uns schicken. Die Anzeige bleibt ca. 1
		Monat auf dieser Disk.<BR>
		<BR>
		Ihr wollt bei Euch ein Usertreffen veranstalten ?<BR>
		Ihr trefft Euch &ouml;fters?<BR>
		Ihr macht eine Party?<BR>
		Ihr habt einen eigenen Clubraum?<BR>
		Ihr plant etwas besonders?<BR>
		Dann gebt uns Bescheid! Wir k&ouml;nnen diese Informationen
		verbreiten und ...<BR>
		<BR>
		Dadurch kommen vielleicht mehrer Freaks!<BR>
		Die Party wird gr&ouml;&szlig;er als Ihr glaubt!<BR>
		In Eurem Clubraum wird es verdammt Eng!<BR>
		Wir schauen vielleicht selber vorbei!<BR>
		Neue Freunde!<BR>
		usw.<BR>
		<BR>
		Also ruft beim Andreas an und teilt ihm mit, was Ihr vorhabt !<BR>
		<BR>
		<BR>
		Wir suchen noch Computerclubs die sich uns anschlie&szlig;en
		wollen, oder einfach nur mit uns zusammenarbeiten wollen.<BR>
		Oder wollt Ihr bei euch im Heimatort einen Computerclub gr&uuml;nden ?<BR>
		dann ruft an !!!<BR>
		<BR>
		<BR>
		HILFE GESUCHT !<BR>
		<BR>
		Wir suchen immer Mitglieder die uns in der Clubarbeit
		unterst&uuml;tzen wollen.<BR>
		Dabei sind nat&uuml;rlich Eure Ideen gefragt.<BR>
		Was k&ouml;nnt Ihr, was wollt Ihr machen ?<BR>
		Schreibt uns, nur so kann der Club was werden!<BR>
		Und ehrlich gesagt, Ihr seid ja auch froh wenn Ihr Hilfe
		bekommt, falls Ihr selbst mal ein Problem habt. Oder ???<BR>

		Habt Ihr Ideen, welche Leistungen wir noch einf&uuml;hren
		k&ouml;nnen ? Wenn ja, dann sagt es uns!!!!!<BR>
		<BR>
		<BR>
		<BR>
		An alle H&auml;ndler oder diejenigen, die H&auml;ndler kennen:<BR>
		Wir suchen st&auml;ndig H&auml;ndler, die unseren eigenen
		Produkte verkaufen!<BR>
		Wir bieten superg&uuml;nstige Einkaufspreise mit hoher Gewinnspanne.<BR>
		Aber nicht nur eigene komerzielle Programme/Games wollen wir auf
		diese Art und Weise verkaufen.<BR>
		Wir suchen auch noch PD-H&auml;ndler, die unsere PD-Soft zu
		fairen Preisen verkaufen!<BR>
		Meldet Euch bitte bei uns. Euer Schaden solls nicht sein!<BR>
		<BR>
		<BR>
		Hallo Leute !<BR>
		<BR>
		<BR>
		Wir suchen sehr aktive Freaks, die einen Computerclub in Ihrem
		Ort gr&uuml;nden wollen oder bereits einen haben.<BR>
		<BR>
		Wir suchen Freaks, die unseren Club in Ihren Ort vertreten wollen,
		bzw. Usertreffen veranstalten usw.<BR>
		<BR>
		Jeder Club kann nur erfolgreich sein, wenn man einen &ouml;rtlichen
		Ansprechpartner hat.<BR>
		<BR>
		Und genau das suchen wir !!!!<BR>
		<BR>
		<BR>
		Was muss man nun tun, wenn man uns oertlich vertreten will, bzw.
		was darf man nicht tun?? Ganz einfach.</P>
		<BR>
		<OL>
		    <LI> Der Club MUSS >CLUBNAME&gt; CO. APC&amp;TCP-COMPUTERCLUB
			 hei&szlig;en !!
		    <LI> Der Club MUSS kostenlos und unverbindlich sein !!
		    <LI> Es MUESSEN unsere Mitgliedsantrag-Formulare verwendet werden !!
		    <LI> Alle Mitgliedsantr&auml;ge m&uuml;ssen an uns
			 weitergeleitet werden !! (Besser noch, die Mitglieder
			 schicken sie direkt an uns) Wir schicken dann die
			 Beitrittsbest&auml;tigung raus und vergeben die
			 Mitgliedsnummern !!!
		    <LI> Man hat einen bestimmten regionalen Bereich, um dem man
			 sich k&uuml;mmert!
		    <LI> ONLY PD-SOFT, KEINE RAUBKOPIEN ODER AEHNLICHES !!!!!!!!
		    <LI> Wenn moeglich regelmaessig oder unregelmaessig
			 Usertreffen veranstalten !! (Auch fuer Nichtmitglieder)
		    <LI> Regelmaessiger Kontakt mit uns per Brief bzw. Telefon.
		    <LI> Wenn Du keine Lust mehr hast den Job richtig zu
			 machen, uns rechtzeitig Bescheid zu geben.
		    <LI> Dir vorher die ganze Sache sehr genau ueberlegen !!!!
			 Einen Computerclub zu leiten, macht sehr viel Arbeit und
			 kostet sehr viel Zeit, wofuer man keinen Pfennig bekommt!
			 Also ueberleg es Dir gut, ob Du wirklich sowas machen
			 willst. Eintagsfliegen kann unser Club naemlich nicht
			 brauchen.
		</OL>
		<P>
		Ok, schaut zwar nach sehr viel aus, ist aber im Grunde genommen
		gar nicht so schlimm.<BR>
		<BR>
		<BR>
		Naja, ein paar Vorteile habt Ihr nat&uuml;rlich auch davon:<BR>
		(Zwar nicht viele, aber um einen Club zu leiten, mu&szlig; man
		ja sowieso ein Idealist sein) </P>
		<BR>
		<OL>
		    <LI> Anbieten aller Leistungen des APC&amp;TCP-Computerclubs
		    <LI> Werbehefte kannst Du gegen Selbstkostenpreis bei uns haben.
		    <LI> Bekanntgabe der Clubtreffen usw. durch uns
		    <LI> Kontakt mit vielen anderen Usern.
		    <LI> Natuerlich wird Deine Adresse in unseren NEUEN
			 Werbeheftchen und InfoDisks erwaehnt ! (Ist ja wohl
			 selbstverstaendlich)!
		</OL>
		<P>
		Also, wenn jemand Interesse hat, dann schreibt uns!<BR>
		<BR>
		<BR>
		PD-Soft<BR>
		<BR>
		<BR>
		Direkt beim APC&amp;TCP-Computerclub gibts PD-Soft f&uuml;r DM
		1,50 zzgl.<BR>
		Versandkosten. Wenn man nur eine einzelne Disk braucht, gibts
		diese gegen DM 4,00 inklusive Versandkosten.<BR>
		Normalerweise liefern wir die gew&uuml;nschten Disks innerhalb
		24 Stunden, wenn wir diese besitzen.<BR>
		<BR>
		<BR>
		Au&szlig;erdem bietet Willi Hillenbrand allen Clubmitgliedern
		des APC&amp;TCP-Computerclubs Rabatt.<BR>
		Unsere Mitglieder m&uuml;ssen statt DM 3.00 nur DM 2.00 je Disk
		+ Versandkosten zahlen. Bitte immer unseren Clubnamen und
		Mitgliedsnummer angeben.<BR>
		Er hat &uuml;brigends die gr&ouml;&szlig;te private PD-Sammlung
		in Deutschland.<BR>
		Au&szlig;erdem ist er 100% zuverl&auml;ssig! Daf&uuml;r
		garantieren wir sogar!<BR>
		<BR>
		<BR>
		Die APC&amp;TCP-FD-Serie<BR>
		<BR>
		Auf dieser FD-Serie befinden sich ausgew&auml;hlte Games sowie
		n&uuml;tzlichste Utilities.Und nat&uuml;rlich stammt ein
		gro&szlig;er Teil dieser Serie von unseren Mitgliedern. Also
		wenn jemand etwas f&uuml;r uns hat nur her damit!<BR>
		Au&szlig;erdem findet ihr auf dieser Serie die Demoversionen von
		unseren eigenen Programmen sowie die Demoversionen von der
		APC&amp;TCP-Shareware- Serie!<BR>
		Wir sind zwar bestimmt keine Konkurrenz f&uuml;r Fish oder
		SaarAG, aber wir glauben, das wir hier einige interessante und
		vor allem wichtige Programme auf wenig Disks untergebracht
		haben.<BR>
		Eine aktuelle Inhaltsliste befindet sich auf unserer
		InfoDisk.<BR>
		<BR>
		<BR>
		Die APC&amp;TCP-Shareware<BR>
		<BR>
		Auf der APC&amp;TCP-Shareware-Serie befinden sich Programme &amp;
		Games die einen Sharewarebeitrag kosten. Es handelt sich hierbei
		um Vollversionen und nicht um eingeschr&auml;nkte Demoversionen.
		Jede Disk kostet den entsprechenden Sharewarebetrag, der an die
		Autoren der Programme weitergeleitet wird. Auf diese Software
		ist ein (c) der Autoren und darf nur von uns kopiert werden. Ihr
		d&uuml;rft also diese Disks nicht kopieren. Sie sind KEINE
		PD!<BR>
		Eine Inhaltsliste ist auf unserer aktuellen InfoDisk vorhanden.<BR>
		<BR>
		Warum jetzt schon wieder eine Shareware-Serie werdet ihr mit
		Recht fragen.<BR>
		Naja, wir k&ouml;nnten die Programme unserer Mitglieder auch
		einzeln anbieten um ihnen etwas unter die Arme zu greifen. Im
		Grunde machen wir das ja auch, nur das wir halt der ganzen Sache
		einen Namen geben! Damit l&auml;&szlig;t sich halt die ganze
		Sache um einiges leichter verwalten!<BR>
		Nat&uuml;rlich haben wir von allen hier angebotenen Programmen
		auch eine Demoversion, die auf unserer eigenen Serie
		APC&amp;TCP-FD-Soft vorhanden sind.<BR>
		Bitte kopiert die Programme von der APC&amp;TCP-Shareware-Serie
		NICHT weiter!<BR>
		<BR>
		<BR>
		NoCover ! NoCover ! NoCover ! NoCover ! NoCover ! NoCover ! NoCover !<BR>
		<BR>
		<BR>
		Das NoCover Team sucht noch flei&szlig;ige Schreiberlinge, die
		was auf dem Kasten haben. Schickt uns Eure Texte (bitte keine
		abgetippten!!)<BR>
		auf Disk als ASCII-File oder gleich als MP-File. Legt bitte noch
		R&uuml;ckporto bei und Ihr bekommt die Ausgabe dann GRATIS
		zugeschickt.<BR>
		Oder legt den Text in das PM des SysOps unserer Mailbox !<BR>
		Schaut mal, was Ihr so alles zusammenbringt! Aber bitte keine 2
		Zeilen Artikel! L&ouml;sungswege zu Games sind nat&uuml;rlich
		auch gefragt, solange nicht gerade rein zuf&auml;llig der
		gleiche in einer anderen Zeitschrift schon abgedruckt war!!!<BR>
		<BR>
		Wenn Ihr wollt, k&ouml;nnt Ihr ja auch was &uuml;ber Euch selbst
		schreiben, &uuml;ber eine Firma mit guten/schlechten
		Erfahrungen, &uuml;ber einen Besuch aus Indien, &uuml;ber den
		T&Uuml;F, &uuml;ber seine Freundin oder was Euch sonst noch
		alles einf&auml;llt.<BR>
		<BR>
		<BR>
		<BR>
		Her damit! Gebt es mir! Macht mich fertig! La&szlig;t mich in
		Disks ertrinken !!<BR>
		<BR>
		<BR>
		Infos f&uuml;r alle Mailboxbesitzer.<BR>
		<BR>
		<BR>
		Was mu&szlig; der SysOp unternehmen, um eine Clubmailbox von
		APC&amp;TCP zu werden ?<BR>
		<BR>
		Eigentlich nicht viel, sondern nur ein paar Kleinigkeiten:<BR>
		</P>
		<OL>
		    <LI> Clubmitglieder erhalten ein h&ouml;heres Ratio. (Muss
			 aber nicht sein)
		    <LI> Anschlu&szlig; an das ALCATRAZ-Netz t&auml;glich !
		    <LI> Die Nutzung der Box mu&szlig; kostenlos sein.
		</OL>
		<P>
		Also nicht viel !<BR>
		<BR>
		Ruft aber bitte per Voice bei uns an oder schreibt uns!<BR>
		<BR>
		Schaut doch einfach mal in unserer Hausbox (High Voltage vorbei !)<BR>
		<BR>
		APC &amp; TCP - Computerclub, Dorfstra&szlig;e 17, D-83236
		&Uuml;bersee, 08642/899953</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="apc.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#apc0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

