<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>DF&Uuml; f&uuml;r Einsteiger</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="dfu0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dfu.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#803000">
	<TR>
	    <TD><IMG SRC="dfu.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dfu0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#90C0C0" WIDTH="80%">
	    <TR>
		<TD>
		<BR>
		<H2 ALIGN="CENTER"><B>DF&Uuml; f&uuml;r Einsteiger</B></H2>
		<BR>
		<P ALIGN="CENTER"><B>~~~~~~(Teil 2)~~~~~~<BR></B></P>
		<BR>
		<P>2.1.3 HAYES-Befehlssatz<BR>
		<BR>
		Die amerikanische Firma HAYES Microsystems Inc. f&uuml;hrte
		Anfang der achtziger Jahre intelligente Modems ein, die
		&uuml;ber einen Befehlssatz verf&uuml;gten, der sich im Laufe
		weniger Jahre praktisch als Standart durchgesetzt hat. Die
		Gr&uuml;nde f&uuml;r die Akzeptanz des HAYES-Befehlssatzes
		liegen in seiner m&auml;chtigen Befehlssyntax und der relativ
		einfachen Handhabung.<BR>
		<BR>
		Im Grunde genommen braucht der Anwender - vorausgesetzt, das
		Modem ist richtig konfiguriert worden - nur einige wenige
		HAYES-Befehle zu kennen, um eine Verbindung herzustellen.<BR>
		<BR>
		F&uuml;r das Verst&auml;ndniss der HAYES-Befehle ist es
		unbedingt erforderlich, den Unterschied zwischen Datentransfer-
		und dem Befehlsmodus des Modems zu kennen. Nach dem Einschalten
		der Versorgungsspannung befindet sich das Modem im Befehlsmodus.
		Dies bedeutet, da&szlig; die von der seriellen Schnittstelle des
		Computers zum Modem &uuml;bertragenen Zeichen als Kommandos
		interpretiert werden. Sendet der Computer beispielsweise die
		zeichenfolge AT an das Modem, so antwortet es normalerweise mit
		OK. Wird ein Befehl zur Herstellung einer Datenverbindung
		gegeben, begintt das Modem zu w&auml;hen, meldet nach
		Herstellung der Datenverbindung mit der Gegenstelle "CONNECT"
		und geht danach selbst&auml;ndig in den Datentransfermodus. Ab
		jetzt werden alle vom Computer zum Modem gesendeten Zeichen als
		Daten &uuml;ber die telefonleitung zur Gegenstelle gesendet.<BR>
		<BR>
		Der &Uuml;bergang vom Datentransfer- zum Kommandomodus erfolgt
		entweder durch Unterbrechung der Telefonverbindung, eine
		Status&auml;nderung der DTR- und DSRSignale der Schnittstelle
		oder durch Senden des Escape-Codes an das Modem. Der einfachere
		Fall ist die unterbrechung der Verbindung durch Auflegen der
		Gegenstelle. Das eigene Modem wechselt kurz nach dem
		Zusammenbruch der Datenverbindung automatisch in den
		Kommandomodus und meldet NO CARRIER. Soll das eigene Modem bei
		bestehender Dantenverbindung in den Kommandomodus wechseln, so
		mu&szlig; der sogenannte Escape-Code &uuml;ber die serielle
		Schnittstelle an das Modem gesendet werden. Der Escape Code
		besteht normalerweise aus der Zeichenfolge "+++", die innerhalb
		einer Sekunde an das Modem gesendet werden mu&szlig;. Vor und
		nach der eingabe d&uuml;rfen jeweils eine Sekunde lang keine
		anderen Zeichen gesendet werden. Hierdurch wird ausgeschlossen,
		da&szlig; beispielsweise die &Uuml;bertragung eines Textes der
		drei +-Zeichen enth&auml;lt, das Modem vom Datentransfer- in den
		Kommandomodus wechseln l&auml;&szlig;t. Im
		Kommandomodusk&ouml;nnen bei bestehender Datenverbindung
		AT-Befehle eingegeben werden. Diese werden vom Moedem nicht an
		die Gegenstelle &uuml;bermittelt, sondern als Kommandos
		interpretiert. Soll beispielsweise aufgelegt werden, so ist der
		Befehl ATH einzugeben. Die R&uuml;ckkehr in den
		Datentransfermodus erfolgt hingegen durch den Befehl ATO.<BR>
		<BR></P>

		<H3>Befehlssyntax</H3><BR>

		<P>
		Von zwei Ausnahmen abgesehen beginnen alle HAYES-Befehle mit den
		Zeichen AT. Anschlie&szlig;end folgen die f&uuml;r das
		gew&uuml;nschte Kommando erforderlichen Buchstaben- und
		Zahlenfolgen, die von einem &gt;RETURN&lt; abgeschlossen wird.
		Eine Kommandozeile besteht aus maximal 40 Zeichen, die
		vorzugsweise als Gro&szlig;buchstaben eingegeben werden sollten.
		Es k&ouml;nnen auch mehrere Befehle in einer Zeile stehen.
		Folgende Befehle sind gleichwertig:<BR>
		<BR>
		</P>

		<PRE>
+----------------+----------------+----------------+----------------+
|   Variante 1   |   Variante 2   |   Variante 3   |   Variante 4   |
+----------------+----------------+----------------+----------------+
|     ATB0       |  ATB0DP19304   | AT B0 DP 19304 |  ATB0 DP19302  |
|                |                |                |                |
|  ATDP19304     |                |                |                |
+----------------+----------------+----------------+----------------+
		</PRE>

		<P>
		Bei allen vier Varianten wird das Modem auf die CCITT-Norm
		eingestellt und w&auml;hlt anschlie&szlig;end im
		Impulswahlverfahren die Telefonnummer 19304. Die meisten Modems
		akzeptieren auch Kleinbuchstaben, eine Mischung ist jedoch bei
		einigen Modems (zumindest POSTZUGELASSENE)
		unverst&auml;ndlicherweise nicht zul&auml;ssig.<BR>
		<BR>
		</P>

		<PRE>
		     +---------------+---------------+
		     |    Zul&auml;ssig   |  Unzul&auml;ssig   |
		     +---------------+---------------+
		     |   AT oder at  |  At oder aT   |
		     +---------------+---------------+
		</PRE>

		<P>
		Fast alle AT-Befehle bestehen aus Buchstaben, denen eine Zahl
		nachfolgen kann. Der Befehl ATH1 bewirkt beispielsweise bei
		nicht zugelassenen Ger&auml;ten, da&szlig; das Modem eine
		Verbindung zum Telefonnetz herstellt. Die Auswirkung ist
		vergleichbar mit dem Abheben des H&ouml;rers beim
		Telefonapparat. Durch den Befehl ATH0 wird die Verbindung zum
		Telefonnetz wieder getrennt, es wird sozusagen aufgelegt.
		Alternativ zum Befehl ATH0 kann auch ATH eingegeben werden. Der
		Verzicht auf die 0 ist bei fast allen Befehlen m&ouml;glich,
		ausgenommen ist hiervon selbstverst&auml;ndlich der
		Wahlbefehl.<BR>
		</P>

		<H3>Erl&auml;uterung der HAYES-Befehle</H3><BR>

		<P>
		Die nachstehende Zusammenfassung ist eine Zusammenstellung von
		Befehlen weit verbreiteter in- und ausl&auml;ndischer Modems.
		Ein Teil dieser Befehle ist nur in amnerikanischen Netzen
		sinnvoll und wird von Europ&auml;ischen Zulassungsstellen nicht
		genehmigt.<BR>
		<BR>
		Diese Befehle ist kein Ersatz f&uuml;r das zu jedem Modem
		geh&ouml;rende Handbuch. Hierbei ist kein ersatz f&uuml;r das zu
		jedem Modem geh&ouml;rende Handbuch. Hierbei ist zu beachten,
		da&szlig; insbesondere in Europa zugelassene Modems eine Reihe
		von Befehlen nicht ausf&uuml;hren d&uuml;rfen, da dies von den
		Zulassungsstellen nicht genehmigt wurde. Zur Sicherstellung der
		Kompatibilit&auml;t mit den Kommunikationsprogrammen, die meist
		amerikanischen Ursprungs sind, best&auml;tigen die Modems auch
		Befehle, die sie nicht ausf&uuml;hren d&uuml;rfen. Ein typischen
		Beispiel hierf&uuml;r sind die Befehle AT&amp;P0 und AT&amp;P1,
		die eine Umschaltung des Impulswahlverh&auml;ltnisses
		erm&ouml;gliche.<BR>
		<BR>
		</P>

		<PRE>
	   Befehlspr&auml;fix, Befehlswiederholung und Escape
 +----------+----------------------------------------------------+
 | Kommando | Beschreibung                                       |
 +----------+----------------------------------------------------+
 |   AT     | ATention, geht mit Ausnahme des Wiederholungs- und |
 |          | Escape-Befehls jedem Befhel voraus.                |
 +----------+----------------------------------------------------+
 |   A/     | Wiederholt den letzen Befehl. Dieses Kommando mu&szlig;  |
 |          | nicht mit &gt;RETURN&lt; best&auml;tigt werden!               |
 +----------+----------------------------------------------------+
 |   +++    | Escape-Code zum Wechsel vom Online in den Komman-  |
 |          | domodus. Vor und nach der Eingabe darf eine Sekun- |
 |          | de kein Datentransfer stattfinden. Die drei Plus-  |
 |          | Zeichen m&uuml;ssen innerhalb einer Sekunde eingegeben  |
 |          | werden.                                            |
 +----------+----------------------------------------------------+


	       W&auml;hl- und Antwortkommandos nach Hayes
 +----------+----------------------------------------------------+
 | Kommando | Beschreibung                                       |
 +----------+----------------------------------------------------+
 |    A     | Modem geht online, d.h. es "hebt ab" (auch wenn S0 |
 |          | auf 0 gesetzt ist) und sendet einen Antwortton aus |
 |          | (nicht bei einigen postzugelassenen Modems)        |
 +----------+----------------------------------------------------+
 |    D     | Wahlbefehl                                         |
 +----------+----------------------------------------------------+
 |    P     | Impulswahlverfahren                                |
 +----------+----------------------------------------------------+
 |    T     | Tonfrequenzwahlverfahren (bei digitaler Leitung)   |
 +----------+----------------------------------------------------+
 |    ,     | Wartezeit w&auml;hrend der Wahl, bei einigen Ger&auml;ten    |
 |          | auch =.                                            |
 +----------+----------------------------------------------------+
 |    !     | F&uuml;r eine halbe Sekunde auflegen ("Flash")          |
 +----------+----------------------------------------------------+
 |    @     | Warten auf Stille                                  |
 +----------+----------------------------------------------------+
 |    ;     | R&uuml;ckkehr in den Komandomodus NACH dem W&auml;hlen       |
 +----------+----------------------------------------------------+
 |    &gt;     | Erdtaste dr&uuml;cken (Wahl aus Nebebenstellenanlagen)  |
 |          | Meistens ist es eine 0 vor der eigentlichen Nummer |
 +----------+----------------------------------------------------+
 |    R     | Reverse-Modus, um mit Originate-Only-Modem Verbin- |
 |          | dung aufzunehmen.                                  |
 +----------+----------------------------------------------------+
 |    S     | Anwahl gespeicherter Nummern (ATDS w&auml;hlt die auf   |
 |          | S=0 gespeicherte Nummer, ATDS=1 die unter S=1 gesp.|
 +----------+----------------------------------------------------+
 |    W     | Auf das Freizeichen warten.                        |
 +----------+----------------------------------------------------+
		</PRE>

		<P>
		Bei der Wahl aus Nebenstellenanlagen in das &ouml;ffentliche
		Telefonnetz ist zu beachten, da&szlig; ein Freizeichen
		(Dialtone) erst nach bet&auml;tigen der Erd-Taste oder dem
		W&auml;hlen einer 0 erhalten wird. Also so zum Beispiel: ATDP
		019300 w&uuml;rde bei einer Nebenstellenanlage die Nummer 19300
		w&auml;hlen.<BR>
		<BR>

		<PRE>
 Lautsprecherkommandos nach Hayes
 +----------+----------------------------------------------------+
 | Kommando | Beschreibung                                       |
 +----------+----------------------------------------------------+
 |    M0    | Lautsprecher ist immer ausgeschaltet<SUP>1</SUP>              |
 +----------+----------------------------------------------------+
 |    M1    | Lautsprecher ist bis zum Erkennen des Carriers ein<SUP>2</SUP>|
 +----------+----------------------------------------------------+
 |    M2    | Lautsprecher ist immer angeschaltet<SUP>1</SUP>               |
 +----------+----------------------------------------------------+
 |    L1    | Lautsprecher leise<SUP>2</SUP>                                |
 +----------+----------------------------------------------------+
 |    L2    | Lautsprecher normal<SUP>2</SUP>                               |
 +----------+----------------------------------------------------+
 |    L3    | Lautsprecher laut<SUP>2</SUP>                                 |
 +----------+----------------------------------------------------+
		</PRE>

		<P>
		<SUP>1</SUP> Bei einigen postzugelassenen Modems:
		Ver&auml;nderung der Lautst&auml;rke<BR>
		<SUP>2</SUP> Bei einigen postzugelassenen Modems: Keine Reaktion
		oder ERROR<BR>
		<BR>
		<BR>
		Im n&auml;chsten Teil folgen weitere Befehle, die S-Register und
		&Uuml;bertragungsgeschwindigkeiten....<BR>
		Ihr d&uuml;rft Euch freuen ...<BR>
		</P>

		<P ALIGN="RIGHT"><B>Costel Mincea.&nbsp;&nbsp;&nbsp;&nbsp;</B></P>
		<BR>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="dfu.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dfu0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

