<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>R&uuml;ckst&auml;ndigkeit pur...</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="dis0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="dis.html" ALT="zur&uuml;ck">
	</MAP>

	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#007050">
	<TR>
	    <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>

<!Innere Tabelle>

	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#60F0A0" WIDTH="85%">
	    <TR>
		<TD>
		<BR>
		<H3 ALIGN="CENTER">R&uuml;ckst&auml;ndigkeit pur...<BR>
		~~~~~~~~~~~~~~~~~~</H3>
		<BR>
		<P>
		Nachdem nun ja schon viele begeisterte Amiga-User ihre mehr
		oder weniger gehaltvolle Meinung zu dem inzwischen
		wohlbekannten Axel-Melzener-Text (NC 05) kundgetan haben, will
		auch ich hiermit meinen bescheidenen Kommentar beisteuern. Es
		dreht sich dabei um ein paar Anmerkungen zu der ja schon
		mehrfach zitierten Aussage der "puren
		R&uuml;ckst&auml;ndigkeit" des einen oder anderen Systems. Ich
		werde, so hoffe ich, sogar f&uuml;r unseren Herrn Melzener klar
		darlegen, warum eindeutig der PC das r&uuml;ckst&auml;ndige
		System &uuml;berhaupt ist. ~~~ Doch genug der Vorrede. Hier
		sind meine Argumente:<BR>
		<BR>
		1.) Der PC - In Unehren ergraut !<BR>
		~~~~~~~~~~~~~~~~~~~~~~~~~~<BR>
		Es gibt zun&auml;chst einen eindeutigen Grund daf&uuml;r, warum
		der PC nicht mehr ganz taufrisch ist: Er ist n&auml;mlich
		wirklich uralt. Die ersten Prototypen waren 1979 fertig, der
		richtige Verkauf begann 1981. Was kann man denn von einem 15
		Jahre alten System schon erwarten ? Ein Beispiel : Der PC ist
		&uuml;berhaupt noch das einzige auf dem Markt erh&auml;ltliche
		System, das einen Textmodus hat ! Weder Amiga, noch Mac, noch
		Archimedes besitzen etwas &auml;hnliches. Wozu auch ? Das
		letzte System vor dem PC, das noch mit Textmodus verkauft
		wurde, war der C64 (kein Witz) !<BR>
		<BR>
		2.) Das Betriebssystem - ebenso<BR>
		~~~~~~~~~~~~~~~~~~~~~~~~~~<BR>
		Um zun&auml;chst eines klarzustellen : Noch heute benutzen 95%
		der PC-User KEIN LINUX oder &auml;hnliches, sondern die
		Kombination MS-DOS/WINDOWS. Und: WINDOWS ist kein
		Betriebssystem (da es ja nicht per Bootblock geladen wird,
		sondern bestenfalls in der AUTOEXEC.BAT), sondern ein
		Betriebssystem-Aufsatz. Was ist jetzt also zu diesem MS-DOS zu
		sagen ? Um es kurz zu machen : MS-DOS besteht zu 50% aus
		portierten CPM-Routinen (ich sauge mir das &uuml;brigens nicht
		aus den Fingern: nachzulesen im PC Intern). Dieses CPM ist ein
		Betriebssystem, das um 1975 f&uuml;r die ersten ernsthaften
		Mikrocomputer entwickelt wurde (PET,CBM 4032 o.&auml;.). Es
		gibt zwar auch einen Satz UNIX-&auml;hnlicher Routinen, aber
		mit UNIX hat das rein gar nichts zu tun ! Wie
		r&uuml;ckst&auml;ndig MS-DOS und damit der PC ist, kann man
		daran erkennen, da&szlig; JEDER PC-User nach dem Kauf seines
		Ger&auml;tes beim ersten Einschalten (und nur das z&auml;hlt !)
		zun&auml;chst einmal den uralt-Prompt "C:\>" sieht. Wer einem
		geschockten Einsteiger in diesem Moment etwas von der
		Benutzerfreundlichkeit des PC erz&auml;hlen w&uuml;rde,
		w&uuml;rde wohl nur Unverst&auml;ndnis ernten.<BR>
		<BR>
		Auch ist MS-DOS und seine Clones, wie Novell-DOS, bis heute ein
		reines 8-Bit Betriebssystem. Es ist nur dazu in der Lage, jeden
		PC im Real-Mode, dem EmulationsModus f&uuml;r PC-XTs, zu
		betreiben. Eine Unterst&uuml;tzung f&uuml;r Speicher oberhalb
		der "magischen" 640KByte-Grenze ist nicht von Haus aus im
		Betriebssystem vorgesehen. Auch gibt es z.B. keine
		Mausunterst&uuml;tzung. All dies wird nur durch hinzugeladene
		Treiber erreicht, die viel Speicher brauchen, das System
		bremsen und h&auml;ufig zueinander nicht kompatibel sind. Dies
		f&uuml;hrt zu eigentlich unzumutbaren, abenteuerlichen Aktionen
		f&uuml;r den geschundenen Benutzer (mehrmaliges &Auml;ndern der
		AUTOEXEC.BAT, CONFIG.SYS und WIN.INI Dateien). Verwundert es
		da, da&szlig; es f&uuml;r dem PC viele dicke B&uuml;cher
		&aacute; la "MSDOS und WINDOWS richtig konfigurieren" gibt ?
		Das hat allerdings nichts damit zu tun, da&szlig; der PC so
		toll supported ist, sondern damit, da&szlig; die User sonst
		nicht mit ihrem System klarkommen w&uuml;rden.<BR>
		<BR>
		Eine weitere Folge : Inzwischen ist es auf dem PC &uuml;blich,
		f&uuml;r jedes Spiel eine eigene Boot-Disk zu haben, auch wenn
		es komplett auf der Festplatte liegt. Der Grund : Da jedes
		Spiel seine eigene Treiberkonfiguration ben&ouml;tigt,ist dies
		der einzig m&ouml;gliche Weg. Ist das nicht seltsam - auf dem
		Amiga werden selbstbootende Spiele immer seltener, auf dem ja
		so fortschrittlichen PC mu&szlig; der User sich wieder an den
		Gebrauch von BootDisketten gew&ouml;hnen... Und Axel, um
		ehrlich zu sein: Wie jeder PC-User benutzt auch Du
		wahrscheinlich 80% der Zeit nur das nakkte MS-DOS. Denk` doch
		an meine Worte, wenn Du das n&auml;chste Mal Folgendes wieder
		liest : "Falscher Befehl oder Dateiname"...<BR>
		<BR>
		3.) Letzter Halt IBM - Die L&uuml;ge mit dem Bus<BR>
		~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<BR>
		Und noch eine kleine "Eigenheit" des PC. Auf jedem ernsthaften
		Computersystem, sei es Amiga, Mac oder z.B. Archimedes, ist es
		&uuml;blich, den internen Bus an die Leistung der einzelnen
		Bauteile, etwa Prozessor, Speicherchips etc. anzupassen. Wenn
		ich mir z.B. einen 1200er mit 68020-32Bit Prozessor kaufe, so
		hat dieser nat&uuml;rlich auch einen hochgetakteten 32-Bit Bus,
		entsprechende Speicherbausteine etc. Nur auf dem PC ist dies
		anscheinend mit Schwierigkeiten verbunden. Zun&auml;chst einmal
		hat jeder PC von Haus aus nur ein BusSystem mit niedriger
		Taktfrequenz, etwa um 16Mhz. Das macht nat&uuml;rlich bei einem
		30Mhz-Prozessor nicht viel Sinn. Au&szlig;erdem ist der Bus
		dann nur 16 Bit breit. Die Folge : Das ganze System wird fast
		bis zum Stillstand gebremst. Will man, da&szlig; sein PC ein
		modernes, passendes Bussystem hat,so mu&szlig; man auf
		"Vesa-Local-Bus" oder "PCI-Bus" bestehen. Hinter diesen
		hochtrabenden Namen steckt nichts anderes als die Tatsache,
		da&szlig; man etwas bekommt, was sonst &uuml;berall
		selbstverst&auml;ndlich ist. Und das kostet dann so um die
		200,- DM. Aber die PC-Experten halten dies wie immer f&uuml;r
		einen ganz besonderen Fortschritt. Wenn ein System keinen
		PCI-Bus hat, ist es r&uuml;ckst&auml;ndig. So wie etwa das
		"Spielesystem" Amiga.<BR>
		<BR>
		4.) "Custom Chips? Wozu? Ich hab` doch einen INTEL !"<BR>
		~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<BR>
		Nachdem ich schon auf die meisten Bestandteile eines
		Computersystems eingegangen bin, will ich auch noch &uuml;ber
		den wichtigsten, den Prozessor, reden ( Was nicht hei&szlig;en
		soll, da&szlig; zum Thema PC und R&uuml;ckst&auml;ndigkeit
		schon alles gesagt ist !). Was macht die Leistung eines
		Prozessors aus ? Nun, ein Amigaoder Mac-User w&uuml;rde sagen :
		Die Anzahl der Instruktionen, die ein Prozessor in einer
		Sekunde ausf&uuml;hren kann (MIPS), oder am besten Praxistests.
		Aber der PC-Experte von heute wei&szlig; das nat&uuml;rlich
		besser ! Denn es geht hier ja schlie&szlig;lich um die
		Taktfrequenz. Wie soll der 4000er auch ein Profi-Computer sein,
		wenn er nur 25 Mhz hat ? Jeder piefige 486er hat ja schon 30 !
		(Da&szlig; der 4000er dabei viermal so schnell ist,
		interessiert ihn ja nicht).<BR>
		<BR>
		In der Tat sind die Prozessoren der Firma Intel die langsamsten
		(in Relation zur Taktfrequenz), die es gibt. Woran das liegt ?
		Nun, zum einen scheinen die Leute, die bei Intel f&uuml;r den
		Microcode zust&auml;ndig sind, nicht allzu viel auf den Kasten
		zu haben. Zum anderen mu&szlig; Intel immer darauf achten,
		da&szlig; alle Prozessoren noch abw&auml;rtskompatibel zum
		1979-Standard des 8088 8Bit Prozessors mit 4 Registern und 4,77
		Mhz sind. Die Folgen sind &uuml;berdeutlich : So ist ein
		Pentium der neuesten Generation mit leicht h&ouml;herer
		Taktfrequenz ein St&uuml;ck langsamer, doppelt so gro&szlig;,
		weit mehr als doppelt so teuer und verbraucht zweimal so viel
		Strom wie ein entsprechender PowerPC-Prozessor. Zufall ?
		Vorsehung ? Nein ! Denn : Die PC-User wollten es so.
		IntelProzessoren, die nicht PC/XT-kompatibel waren, wurden
		wahre Flops (Beispiel: der i860 - normale PC-User haben nie
		davon geh&ouml;rt).<BR>
		<BR>
		Das gleiche bei Hilfsprozessoren. Bis heute gibt es keine
		standardisierten Custom-Chips auf dem PC. Zwar haben ein paar
		Grafikkarten Grafik-Prozessoren, aber die k&ouml;nnen nur durch
		eigene Treiber aktiviert werden, die oft nur einen Bruchteil
		ihrer Leistung ausreizen. Ist es da ein Wunder, da&szlig; ein
		486 unter Windows mehr als 50% seiner Leistung auf grafische
		Operationen verwenden mu&szlig;? Aber den PC-Usern geschieht
		das nur recht. Wer Zust&auml;nde wie 1979 mit Nachdruck und
		Sturheit erreichen will, bekommt sie auch...<BR>
		<BR>
		Und die Moral von der Geschicht` ?<BR>
		~~~~~~~~~~~~~~~~~~~~~~~~~~~~<BR>
		Es ist also klar, da&szlig; der PC nicht nur
		r&uuml;ckst&auml;ndiger als der Amiga, sondern auch das
		r&uuml;ckst&auml;ndigste System &uuml;berhaupt ist. Der Witz
		ist aber, da&szlig; die Benutzer selbst daran schuld sind.
		Beispiel Betriebssystem : Die PC-User hatten schon mehrmals die
		Gelegenheit, ein v&ouml;llig neues einzuf&uuml;hren. Man denke
		nur an OS/2 oder WINDOWS NT. Aber nein ! Der PC-User von Welt
		braucht so etwas nicht - wozu auch, es gibt ja MS-DOS. Hier
		gilt die Devise : Wer nicht will, der hat schon (oder ist
		PC-Besitzer).<BR>
		<BR>
		&Auml;hnliches bei der Prozessor-Technologie (s.o.). In dieser
		Sparte tritt das Ganze allerdings versch&auml;rft auf. Hier
		zeigt sich n&auml;mlich die bemerkenswerte Neigung der
		PC-Userschaft, betrogen werden zu wollen. Der Grund, warum auf
		dem PC so h&auml;ufig neue ComputerGenerationen eingef&uuml;hrt
		werden, ist nicht der, da&szlig; die technische Entwicklung
		hier so schnell voranschreitet. Nein, denn dem PC-User kann
		anscheinend sehr leicht die kleinste Verbesserung als
		Fortschritt erster Klasse verkauft werden. Beispiel : Der
		Pentium. Dieses System ist 70% schneller als der i486. So etwas
		w&auml;re auf dem Amiga nicht m&ouml;glich. Wenn hier eine neue
		Produktreihe eingef&uuml;hrt wird, mu&szlig; sie um ein
		Vielfaches besser sein als die vorhergehende. Der A1200 ist
		vierbis f&uuml;nfmal so schnell wie der A500. Die Steigerung
		betr&auml;gt also 400-500%, nicht nur 70% wie auf dem PC. Aber
		der PC-User wei&szlig; das nat&uuml;rlich alles besser ! Er
		kauft sich erst PC/XT, dann 80286-AT, dann NEAT-286, dann
		386-SX, dann 386-DX, dann 486-SX, dann 486-DX, dann 486-DX/2,
		dann 486-DX/4, dann Pentium, dann Alpha-Chip, dann...<BR>
		<BR>
		Aber man will ja nicht r&uuml;ckst&auml;ndig sein, wie auf dem
		"Spielesystem" Amiga ! CD-ROM Laufwerke ? Single-Speed,
		Double-Speed, TripleSpeed, Quadra-Speed... Aber wozu auf einen
		echten Fortschritt warten, wenn man doch jedes Jahr 10000,- DM
		f&uuml;r neues Zubeh&ouml;r ausgeben kann ? Grafik-Karten ?
		MDA, CGA, Hercules, EGA, MCGA, VGA, Super-VGA, TIGA, XGA,
		24-Bit Karte... Denn auf dem PC ist man ja PROFESSIONELL !
		Sound-Hardware ? Roland, AdLib, Soundblaster, Soundblaster
		V2.0, Soundblaster V3.0, V4.0, V5.0 ... Doch der moderne PCler
		ist nat&uuml;rlich auch noch stolz darauf, an der Nase
		herumgef&uuml;hrt zu werden. Aber wen verwundert das, wenn der
		einzige Computer-bezogene Satz, den wirklich jeder PC-User
		kennt, lautet : Ist das auch KOMPATIBEL ?<BR>
		<BR>
		Und als Abschlu&szlig; zur allgemeinen Unterhaltung noch ein
		paar "PCler-Zitate",die zum Teil sogar von InformatikLehrern
		stammen (kein Scherz !) :<BR>
		<BR>
		"Ich hab` mir jetzt einen 468-R gekauft. Was das ist ? Keine
		Ahnung ! Aber daf&uuml;r hab` ich WINDS-WOS, und ich hab`
		geh&ouml;rt, das soll echt toll sein !"<BR>
		<BR>
		PC-User tauscht mit Freunden ca. 35 Disketten mit Raubkopien.
		Amiganer versucht, sich in das Gespr&auml;ch irgendwie
		einzuschalten. Antwort : "La&szlig; uns in Ruhe, Du mit Deinem
		illegalen Cracker-System !"<BR>
		<BR>
		"Ich habe mir letztlich wieder einen neuen PC gekauft.<BR>
		Er beinhaltet sogar eine lokale Festplatte !"<BR>
		"Was soll das denn bitte sein ?"<BR>
		"Ach, das ist sogar zu 100% kompatibel !"<BR>
		<BR>
		Eine kleine Runde von PClern. Unterhaltung &uuml;ber DOOM,
		X-Wing, Day of the Tentacle, Flight Simulator VI etc. Armer
		Amiganer gesellt sich dazu, redet so gut es geht mit. Nach
		wenigen Minuten f&auml;llt der Kommentar : "Na, Du kommst Dir
		wohl ziemlich bl&ouml;d vor mit Deinem Spielesystem !"<BR>
		<BR>
		Von diesen Zitaten ist &uuml;brigens keines erfunden. Doch
		nachdem ich nun wohl etwas von Thema abgeschweift bin, folgen
		noch ein paar abschlie&szlig;ende Worte. Ich habe, so denke
		ich, genug zum Thema R&uuml;ckst&auml;ndigkeit gesagt. Wenn
		Euch das n&auml;chste Mal wieder ein Besitzer eines
		IBM-Kompatiblen etwas von Fortschrittlichkeit erz&auml;hlt,
		zeigt ihm diesen Text. Vielleicht sieht er dann ein, was er da
		redet.<BR>
		<BR>
		Bis zum n&auml;chsten Mal, und&nbsp;&nbsp;&nbsp;&nbsp;<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;"Nehmt`s nicht so schwer !"</P>

		<P ALIGN="RIGHT">Jan Fischer (25.9.1994)&nbsp;&nbsp;&nbsp;&nbsp;</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>

<!Innere Tabelle>

	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="dis.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#dis0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
