<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE></TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="inh0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="inh.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#FFFFF0">
	<TR>
	    <TD><IMG SRC="inh.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#inh0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <CENTER>
		<IMG SRC="edi.gif" WIDTH="279" HEIGHT="147" ALT="Titelbild">
	    </CENTER>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
	    <TR>
		<TD>
		<BR>
		<P>
		Hallo, da bin ich wieder. Frisch aus den Urlaub von Balkonien
		zur&uuml;ck. Hehe, war wieder mal ein reiner
		Arbeitsurlaub:-))<BR>
		<BR>
		Man, diese Ausgabe der NoCover war ja mal wieder der absolute
		Horror f&uuml;r mich. Diesmal hab ich verdammt wenig Texte
		bekommen und die ich dann bekommen habe kamen in allerletzte r
		Minute.<BR>
		<BR>
		Naja, auf jedem fall ist die NC 8 jetzt endlich fertig und der
		eigentliche Stre&szlig; kann endlich losgehen.<BR>
		<BR>
		In 5 Wochen ist n&auml;mlich die WOC und wie ihr ja bestimmt
		schon alle wi&szlig;t haben wir dort einen Stand.<BR>
		<BR>
		Also bitte, schreibt Texte f&uuml;r die NC 9. Immerhin wird die
		NoCover 9 auf der Messe unser Aush&auml;ngeschild f&uuml;r den
		Club sein. Bitte schreibt m&ouml;glichst gute und interessante
		Texte und vor allem schickt sie mir so bald wie
		m&ouml;glich.<BR>
		<BR>
		Ich mu&szlig; n&auml;mlich bis zur Messe noch ca. 5.000 Disks
		kopieren und so ganz nebenbei geh ich auch noch in die
		Arbeit.<BR>
		Naja und eure Post will ja auch beantwortet werden :-)<BR>
		<BR>
		Gleich nochmal zum Thema Messe:<BR>
		Bitte, der Stand ist eh schon eng genug. Wir k&ouml;nnen auf gar
		keinen Fall euer Gep&auml;ck oder eure Eink&auml;ufe da
		zwischenlagern!! Aber ich das jeder mal kurz vorbeischaut. Die
		NoCover wird &uuml;brigends ein paar Tage vor der Messe
		erscheinen.<BR>
		<BR>
		Alle wichtigen Infos &uuml;ber die Messe findet ihr in dieser
		Ausgabe der NoCover. Wenn noch Fragen offen sein sollten, dann
		meldet euch!!<BR>
		Was mich etwas gewundert hat, das so wenige Eintrittskarten
		f&uuml;r die WOC bei uns bis hjetzt bestellt wurden. Komm mir ja
		richtig bloed vor, bei der Messeleitung als gr&ouml;&szlig;ter
		nichtkommerzieller Amiga-Club nur l&auml;ppische 20 Karten zu
		bestellen. Dabei gibts die sogar noch f&uuml;r Clubmitglieder
		bei uns billiger:-)<BR>
		<BR>
		Ab 1.1.1994 unterst&uuml;tzt die NoCover nicht mehr Kick 1.3.<BR>
		D.h. Das Amiga-Systeme die immernoch mit dem veralteten
		Kickstart 1.3 fahren die NoCover nicht mehr lesen
		k&ouml;nnen!<BR>
		Also legt Euch doch bitte endlich alle mal ein Kick ab 2.x zu.
		Mensch das Kick 1.3 ist doch der letzte Schrott.<BR>
		Der Grund daf&uuml;r ist, das dadurch wieder mehr Platz auf der
		Disk ist was wiederum mehr Texte zur Folge hat.<BR>
		<BR>
		Dupdidu jetzt geht mir schon mal wieder der Schreibstoff aus.<BR>
		Naja, nen nettes kleines Pic hab ich noch auf Lager.<BR>
		Schauts euch an...<BR>
		<BR>
		Viel Spa&szlig; mit der NC 8<BR>
		<BR>
		<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Andreas.</P>
		<BR>
		<BR>
		</TD>
	    </TR>
	    <TR>
		<TD ALIGN="CENTER" BGCOLOR="#000000"><IMG SRC="edi.png" ALT="Editorial Bild!"></TD>
	    </TR>
	    </TABLE>
	    <BR>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="inh.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#inh0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
</BODY>
</HTML>
