<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Out of Memory</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="lsb0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="lsb.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000080">
	<TR>
	    <TD><IMG SRC="lsb.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#lsb0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Hallo Andreas !</FONT></B></H1>
	    <BR>
	    <BR>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#FF00FF" WIDTH="90%">
	    <TR>
		<TD>
		<P>
		Ich habe heute (1.9.1994) die neue NoCover bekommen.
		Auff&auml;llig war, da&szlig; das Escheinungs (1.9) nicht
		stimmen kann, oder die Post alles einen Tag fr&uuml;her
		liefert, als abgeschickt. Als ich den Brief bekam sah die
		seltsam angeordneten Briefmarken. War das 'n versteckter Kot
		oder was?? Nun ja, ich sah, da&szlig; da "nur" 1.30 Dm
		draufklebten! Wenn ich einen Brief mit zwei Disketten
		abschicke, muss ich immer 2 Marken zu je 1 DM lecken und
		draufmatschen! Kann auch sein, da&szlig; du so ein guter Kunde
		bei den Gelbm&auml;nnern bist und schon Rabatte bekommst... <BR>
		<BR>
		(ANDREAS: Keine Rabatte, WARENSENDUNG :-)) )<BR>
		<BR>
		Naja, ist ja auch alles egal! Hauptsache ich hab die NoCover
		gekriegt. So, jetzt erst mal den Computer an, und Disk 7a in
		Df0: und Disk 7b in das externe Zweitfloppy gelegt.
		Boot....boot...........boooooooooooot! Pl&ouml;tztlich kommt da
		'ne Meldung auf den Bildschirm : Out of Memory Error! Ja
		sch&ouml;ne Sch+++! Ein Memory Error! Den hatte ich noch nie.
		Also wei&szlig; ich auch nich, wie man den wieder wegbekommt...<BR>
		<BR>
		Also ran ans Telefon und Andreas gecallt:08642/899953. Boh so
		'ne lange Telefonnummer. Und was das bestimmt wieder mal
		kostet. Von hier ausm so sch&ouml;nen Westfalen nach da unten nach
		Baziland, genannt Bayern!<BR>
		<BR>
		Tuut...tuut...tuut.....<BR>
		<BR>
		Andreas am Apperat:&Auml;h hallo...APC und TCP Computerclub.<BR>
		<BR>
		Ich:Hey Andreas hier ist Sebastian Alfers...<BR>
		<BR>
		Andreas:Ach du bists...&Auml;h ja hallo..h&ouml;h&ouml;...<BR>
		<BR>
		Ich:Emm, ich hab' die neue NoCover bekommen und da kommt immer
		so'n sch+++ Out of memory error...<BR>
		<BR>
		Andi:&Auml;h, ja...mmm...also...du mu&szlig;t das Titelbild aus
		dem<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Verzeichnis TexteA l&ouml;schen,
		und das Titelbild vonna NC 6<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;da drauf kopieren...dat
		hei&szlig;t Titelbild.mp.pp oder so...<BR>
		<BR>
		Ich:Ja ok... mach ich...Wat f&uuml;rn Proggi brauch ich denn
		    daf&uuml;r???<BR>
		<BR>
		Andi:Ach, irgend ein Kopierprogramm...<BR>
		<BR>
		Ich:Ja, ok...tsch&uuml;ss und danke f&uuml;r die Hilfe...<BR>
		<BR>
		Andi:Ja, tschau...<BR>
		<BR>
		Ja geschissen auf deine Hilfe! Ich also mei ein Kopierprogramm
		geschnappt und versucht in das verzeichnis zu kommen! Ich hab
		wohl so 15 Kopierprogramme, aber keines von denen konnte
		Abhilfe von meinem Problem schaffen...<BR>
		<BR>
		(ANDREAS: Sorry, aber mit nen Proggi wie DirOpus gehts)<BR>
		(halt am schnellsten, einfachsten und bequemsten)<BR>
		<BR>
		So ungef&auml;hr 5 Minuten sp&auml;ter rief mich mein Cousin
		Andreas P&ouml;pper an und fragte mich, ob ich schon die
		NoCover 7 bekommen habe. Ich bejate und wir kamen auf den Error
		zu sprechen. Er beschrieb mir den Fehler und ich teilte ihm
		mit, wie man diesen beiseitigt. 5 Minuten sp&auml;ter ereilte
		mich ein Anruf von Andreas P&ouml;pper, und er sagte mir,
		da&szlig; er das Problem gel&ouml;st habe. Ich fragte ihn, wie
		er es geschaft habe. Er sprach davon, da&szlig; er alles mit
		seiner Workbench (2.0) geschafft hat. Also so frage ich dich:
		Wieso sagst du mir nicht gleich, da&szlig; es mit der Workbench
		gemacht werden kann??? Auf jeden Fall wollte ich dich am 1.9
		nochmals anrufen, aber es ging keiner ran. Und wie ich
		zuf&auml;llig von Andreas P&ouml;pper erfahre, da&szlig; du
		Donnerstags, also auch am 1.9 den ganzen Tag zuhause bist,
		frage ich mich, warum ich dann immer den Sack von
		Anrufbeantworter am anderen Ende der Strippe habe!!!!!<BR>
		<BR>
		(ANDREAS: Goenn mir halt auch noch etwas Freizeit:-(()<BR>
		(Ab und zu geh ich auch mal aus meiner Bude raus)<BR>
		<BR>
		Nun, es ist ja auch egal! Hauptsache ich hab' die neue NoCover
		und damit basta. Du erw&auml;hntest in der neuen NC, da&szlig;
		sogar ein Text nicht mehr auf die NoCover passte!&#161; Das war
		bestimmt meiner, so glaube ich, weil ich ihn nirgendswo
		gefunden habe! Aber als ich die vielen Texte von mir in der
		NoCover gefunden habe, war alles vergeben und vergessen!!<BR>
		<BR>
		Also tschau Andi, und noch noch viel Spa&szlig; mit den Texten
		auf dieser Diskette! Was ist aber eigentlich mit meinen
		Graphiken, die ich dir geschickt habe???</P>

		<P ALIGN="RIGHT">
		Noch viel Spa&szlig; w&uuml;nschend,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<BR>
		Dein&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<BR>
		<BR>
		Sebastian Alfers&nbsp;</P>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    <BR>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="lsb.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#lsb0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
