<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Amiga Szene Disketten von 1a bis 59</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="pdl0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="pdl.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" SUMMARY="" BGCOLOR="#006000">
	<TR>
	    <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="1" WIDTH="90%" SUMMARY="" CELLPADDING="10" BGCOLOR="#FFFFFF">
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 1a</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Power Packer V2.3b</TD>

		<TD>Die Anwendungsm&ouml;glichkeiten dieses Packers sind endlos.
		Mit dem Power Packer erh&auml;lt der User ein leistungsstarkes
		und zuverl&auml;ssiges Hilfsprogramm, das Platz f&uuml;r so
		manchen anderen Zweck schaffen kann. Der Packer ist
		&uuml;bersichtlich aufgebaut, leicht zu bedienen und bietet eine
		bisher ungekannte Vielfalt in den
		Einstellungsm&ouml;glichkeiten.
		<BR>
		Autor: Nico Francois</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">C.A.S.H. Prev.</TD>

		<TD>In diesem Ordner befinden sich einige Screenshots, die die
		Oberfl&auml;che des Programms "C.A.S.H." in einer neuen Version
		( die wird es auf der n&auml;chsten Purity geben ) zeigen.
		(KickPascal)
		<BR>
		Autor: Rainer Behrens</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AK Lotto V2.09</TD>

		<TD>Ein Programm zur Verwaltung von Lottozahlen, zu deren
		statistischer Auswertung bei speziellen Ziehungsverfahren und
		zur Ziehung von Lottozahlen auf konventioneller, rein
		zuf&auml;lliger Basis, zur Erleichterung der Entscheidung,
		welche Lottozahlen auf dem Lottoschein angekreuzt werden
		k&ouml;nnten. F&uuml;r die ermittelten Zahlen gilt: "Alle
		Angaben ohne Gew&auml;hr!"
		<BR>
		Autor: Andreas Ralph Kleinert</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Downhill Challenge</TD>

		<TD>Downhill Challenge ist eine sagenhafte Skisimulation, die
		auch auf dem kommerziellen Markt ihresgleichen sucht. Rasen Sie
		den Hang hinunter ohne gegen Fichten Baumst&auml;mme ect. zu
		fahren.
		<BR>
		Autor: David Alves</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Faxen</TD>

		<TD>Sicherlich kennen Sie das klassische Verschiebepuzzle bei
		dem Zahlen von 1 bis 15 in die richtige Reihenfolge gebracht
		werden m&uuml;ssen. Aber haben Sie das schon einmal mit Bildern
		versucht? Faxen ist so ein Verschiebepuzzle bei dem Sie
		au&szlig;er dem "Klassischen Spiel" weitere 11 Bilder "faxen"
		k&ouml;nnen.
		<BR>
		Autor: Bernd Kr&auml;uter</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">PPrefs</TD>

		<TD>PPrefs wurde entworfen um das Standard Commodore Preferences
		Programm zu ersetzen. PPrefs ist k&uuml;rzer, effizienter und
		einfacher zu benutzen.
		<BR>
		Autor: Jonathan Potter</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">GhostMan</TD>

		<TD>GhostMan ist eine naturgetreue Umsetzung des alten
		Spielhallenklassikers "PAC-MAN". Das Spiel kann Wahlweise von 1
		oder 2 Spielern gespielt werden. Inclusive Modula-2 Source.
		<BR>
		Autor: Christian Stiens</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">FMC V1.2</TD>

		<TD>FastMemController bietet dem User mit einer
		Speichererweiterung eine Softwarel&ouml;sung zum Ausschalten des
		FastMems an. Inclusive Source in Assembler.
		<BR>
		Autor: j Roger Fischlin</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">WBD</TD>

		<TD>Workbench Depth ist ein kleines Hilfsprogramm f&uuml;r alle,
		die die Farbanzahl der Workbench ver&auml;ndern m&ouml;chten. Es
		ist damit sehr leicht m&ouml;glich, die Workbench z.B. nur noch
		2-farbig, oder aber 8, 16-farbig zu gestalten. Inclusive
		C-Source.
		<BR>
		Autor: Oliver Wagner</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 2a</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Bally V</TD>

		<TD>Bei diesem Programm handelt es sich um ein kleines Spiel.
		Ihre Aufgabe ist es, mit einem kleinen Ball auf einem Spielfeld
		m&ouml;glichst gro&szlig;e Fl&auml;chen zu umfahren. Diese
		werden dann mit einer Farbe gef&uuml;llt. Haben Sie 75 % des
		Spielfeldes gef&uuml;llt, kommen Sie in den n&auml;chsten Level.
		Ihre Aufgabe wird nat&uuml;rlich noch durch "gegnerische"
		B&auml;lle erschwert, die nicht ber&uuml;hrt werden d&uuml;rfen.
		<BR>
		Autor: Oliver Wagner</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">BICS V1.10</TD>

		<TD>Mit dem "Boot Intro Construction Set" k&ouml;nnen Sie ein
		Intro erzeugen, das sofort beim Booten nach dem einlegen der
		Diskette erscheint. Wahlweise k&ouml;nnen Intros mit ein bis
		vier Kopfzeilen und einer Laufschrift erzeugt werden.
		<BR>
		Autor: Roger Fischlin</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Galactic Worm</TD>

		<TD>Ihre Aufgabe bei diesem Spiel ist es mit einem kleinen Wurm
		Erdbeeren zu fressen. Dabei wird der Wurm immer l&auml;nger und
		Sie m&uuml;ssen aufpassen, da&szlig; Sie sich nicht selber
		bei&szlig;en. Zus&auml;tzlich m&uuml;ssen Sie noch kleinen
		Steinen ausweichen. Mit Soundeffekten und speicherbare
		Highscoreliste.
		<BR>
		Autor: Pete Kerckhoff</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Fast Disk II</TD>

		<TD>Fast Disk ist ein Programm zur Optimierung der zum Teil
		chaotischen Diskstruktur von Amiga-Disketten. Jeder kennt die
		manchmal bis zu mehreren Minuten dauerde Wartezeit auf das
		Einlesen eines l&auml;ngeren Directorys. Fast Disk beschleunigt
		diesen Vorgang in der Regel um das drei- bis f&uuml;nffache.
		<BR>
		Autor: Oliver Wagner</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Label V2.0</TD>

		<TD>Mit Label k&ouml;nnen Sie Diskettenlabel der Luxusklasse
		erstellen. Das Programm biete viele Funktionen, so k&ouml;nnen
		au&szlig;er Text auch kleine Grafiken mit eingebunden werden.
		Diverse Grafiken sind bereits vorhanden und mit einem Malmodus
		k&ouml;nnen eigene Grafiken gestaltet werden.
		<BR>
		Autor: Dieter Prezewowsky</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">KME</TD>

		<TD>Ein KeyMap-Editor mit dem Sie Ihre eigene Tastaturbelegung
		erstellen, oder auch Funktionstasten belegen k&ouml;nnen. Diese
		Keymaps k&ouml;nnen dann mit dem Befehl "Setmap" eingestellt
		werden. Inklusive Oberon-Source
		<BR>
		Autor:  Christian Stiens</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">RevComp V2.0</TD>

		<TD>Dieses ist eine neue, sehr gute "Reversi" Version. Bei
		diesem Denk- und Knobelspiel m&uuml;&szlig;en Sie besser sein
		als der Computer und das ist sehr schwer. Es geht darum, durch
		geschicktes belegen von Feldern, mehr Punkte zu bekommen als Ihr
		guter alter Amiga. Inclusive Assembler-Source.
		<BR>
		Autor: Marc Fischlin</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AmigaFox V1.10</TD>

		<TD>Eine deutsche Textverarbeitung mit DTP F&auml;higkeiten. Mit
		dem Programm k&ouml;nnen Sie Ihre Texte individuell gestalten
		und ausdrucken, da es in der Lage ist Texte mit
		unterschiedlichen Zeichens&auml;tzen darzustellen. So
		k&ouml;nnen Sie z.B. Ihre eigenen Formulare oder Briefb&ouml;gen
		entwerfen, ohne erst m&uuml;hselig eine Script-Sprache erlernen
		zu m&uuml;ssen.
		<BR>
		Autor:  Michael W&uuml;st</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 3</TH>

	    </TR>
	    <TR>
		<TD VALIGN="TOP">Broker V1.0</TD>

		<TD>W&uuml;rden Sie gerne das Handeln mit Aktien trainieren,
		aber Ihnen fehlt das n&ouml;tige Kleingeld dazu? Mit dem
		Simulationsprogramm Broker ist es m&ouml;glich, ohne Kapital das
		richtige Spekulieren mit Aktien zu &uuml;ben. Broker bietet bis
		zu vier Mitspielern die M&ouml;glichkeit, Aktien zu erstehen und
		abzusto&szlig;en. Dabei m&uuml;ssen Sie Steuern, Optionen,
		Dividenden und Kontozinsen ber&uuml;cksichtigen. Weiterhin kann
		jeder Spieler einen Kredit aufnehmen, den er plus Zinsen im
		Verlauf des Spieles abzahlen mu&szlig;. Das Spiel reizt durch
		die interessante Thematik und die spannenden Finanzschlachten,
		die sich zwischen mehreren Mitspielern ergeben k&ouml;nnen. Das
		Programm ben&ouml;tigt 1 MB Speicher.
		<BR>
		Autor: Andreas Page</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Lucky Loser V1.3</TD>

		<TD>Bei diesem Programm handelt es sich um eine wirklich sehr
		gut gelungene Geldspielautomat Simulation. Es ist so echt
		programmiert, da&szlig; das Spielen unwahrscheinlich viel
		Spa&szlig; macht. Der Vorteil bei diesem Spiel ist jedoch,
		da&szlig; Sie kein Geld verlieren k&ouml;nnen.
		<BR>
		Autor:  Lothar Maier</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Crayon Paint</TD>

		<TD>Buntstiftemalen ist ein sehr einfaches Malprogramm speziell
		f&uuml;r den einfachen Gebrauch durch Kinder. Die Bedienung ist
		sehr leicht. Das Kind kann mit einem Mausklick einen von 8
		Buntstiften ausw&auml;hlen.
		<BR>
		Autoren: Michael K. McCarty und Greg Johnson</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">3D Tic Tac Toe V1.2</TD>

		<TD>TTT - ist eine dreidimensionale Spielumsetzung von Tic Tac
		Toe - Sie gegen den Amiga. Das Spiel wird auf einem Brett, das
		sich aus vier Ebenen zusammensetzt gespielt. Sie ziehen
		abwechselnd mit dem Computer bis jemand gewinnt.
		<BR>
		Autor: Ron Charlton</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">CAD-Print V1.0</TD>

		<TD>Das Programm wurde f&uuml;r AEGIS-Draw entwickelt. Es
		erm&ouml;glicht &uuml;bergro&szlig;e Zeichnungen auszudrucken.
		Der Ausdruck kann in 8 Farben mit einer Druckeraufl&ouml;sung
		von bis zu 360 * 360 dpi erfolgen.
		<BR>
		Autor: Thomas Geib</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 4d</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Skr&auml;bel V1.6</TD>

		<TD>Dies ist die Computerumsetzung des bekannten Scrabble
		Spieles f&uuml;r 1 bis 4 Spieler. Aus einer bestimmten Menge von
		Buchstaben mu&szlig; man W&ouml;rter bilden. Das Programm bietet
		viele Funktionen, so k&ouml;nnen eine beliebige Anzahl von
		Spielern durch den Computer ersetzt werden, Steine k&ouml;nnen
		ausgetauscht werden, man kann sich einen Wortvorschlag vom
		Computer geben lassen und vieles mehr.
		<BR>
		Autor: Georg Br&uuml;nsing</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Chess V2.0</TD>

		<TD>Ein Schachspiel mit einer dem AMIGA angeme&szlig;enen
		Oberfl&auml;che. Das Orginal von John Stanback wurde von A.H.W.
		Kaufmann mit einer mausorientierten Benutzeroberfl&auml;che
		versehen. Es bietet viele Optionen wie Zeitlimit,
		Zugr&uuml;cknahme, Seitenwechsel, Zugvorschlag und vieles
		mehr.</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Frequenz V1.0</TD>

		<TD>Das Programm dient der Berechnung von 2-Weg-Frequenzweichen
		verschiedener Ordnung. Es werden die Induktivit&auml;ten, die
		Kapazit&auml;ten und der Schaltplan berechnet.
		<BR>
		Autor: Stephan Kanoniczak</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">MCAD V1.2.5</TD>

		<TD>mCAD ist ein objektorientiertes Zeichenprogramm. Es
		enth&auml;lt viele n&uuml;tzliche Zeichenfunktionen wie z.B.
		Line, Box und Text und eine Auswahl an Editierfunktionen wie
		z.B. Move, Size und Rotate.
		<BR>
		Autor: Tim Mooney</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">STPlayer V1.26 - (Update 2/94)</TD>

		<TD>Das Programm spielt ST-Modules im Hintergrund ab, ohne
		Ein-/Ausgabe, es spielt solange weiter, bis ein neuer STPlayer
		gestartet oder eine andere Option gew&auml;hlt wird. Es ist
		somit hervoragend f&uuml;r Pr&auml;sentationen oder
		Disk-Magazine geeignet.
		<BR>
		Autor: Andreas Ralph Kleinert</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">KILBM V1.32</TD>

		<TD>KILBM bietet Ihnen viele M&ouml;glichkeiten mit IFF-Grafiken
		zu arbeiten. So k&ouml;nnen gepackte oder ungepackte IFF - ILBM
		und IFF - ACBM Grafiken angezeigt werden. Screens k&ouml;nnen
		als gepackte oder ungepackte IFF Grafiken abgespeichert werden.
		IFF-ILBM und IFF-ACBM Grafiken k&ouml;nnen konvertiert werden.
		<BR>
		Autor:  Andreas Ralph Kleinert</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 5a</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Streets</TD>

		<TD>Bei diesem Spiel sollen Sie die Stra&szlig;en der ehemaligen
		DDR wieder in Ordnung bringen. Schnellstm&ouml;glich m&uuml;ssen
		Sie dazu verschiedene Stra&szlig;enteile verschieben bevor die
		Ampel auf gr&uuml;n schaltet und der gro&szlig;e Run der Trabis
		beginnt.
		<BR>
		Autor: Sven Hasselmeyer</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Risk V3.0</TD>

		<TD>Eines der besten und spannendsten Strategiespiele ist
		Risiko. Zwei bis f&uuml;nf Spieler m&uuml;ssen versuchen, die
		Herrschaft &uuml;ber die Welt zu erlangen. Dabei entscheidet
		nicht nur das Gl&uuml;ck, sondern es kommt auch auf geschicktes
		Handeln an. Besonders, bei vielen Mitspielern ist es schnell um
		einen geschehen, bzw. man wird nie sein Ziel erreichen. Das
		Spiel hat eine sch&ouml;ne Grafik, ist sehr einfach mit der Maus
		zu bedienen und hat eine Vielzahl von Operationen, die den
		Spielablauf erleichtern oder erschweren k&ouml;nnen.
		<BR>
		Autoren: Michael Berling und Hartmut Stein</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Bucher V1.1c</TD>

		<TD>Bucher ist eine Haushaltsgeld-Verwaltung mit einer
		komfortablen Benutzeroberfl&auml;che, die &uuml;ber Gadgets
		bedient wird. Das Programm kann beliebig viele Dateien
		bearbeiten und ist in der Lage auf 140 Datens&auml;tze pro Datei
		zur&uuml;ckzugreifen. Weiterhin kann jeder Datensatz
		ge&auml;ndert, gel&ouml;scht oder ausgedruckt werden.
		<BR>
		Autor: Dirk Buschek</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Label Print V3.5</TD>

		<TD>Das Programm LabelPrint dient dazu Etiketten f&uuml;r
		Disketten zu drucken. Dazu stehen Ihnen eine Vielzahl von
		Optionen zur Verf&uuml;gung, wie Sie Ihre Etiketten gestalten
		m&ouml;chten.
		<BR>
		Autor:  Andreas Krebs</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 6d</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Transfer-Form V1.1</TD>

		<TD>Das Programm dient zum Drucken von
		&Uuml;berweisungsauftr&auml;gen. Es druckt in die
		Standardvordrucke der Banken bzw. Sparkassen. Da das Programm in
		Amiga-BASIC geschrieben wurde, wird der AmigaBASIC-Interpreter
		ben&ouml;tigt.
		<BR>
		Autor: Reik Winkelmann</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Disklabel V4.0</TD>

		<TD>Das Programm dient zum Erstellen von Disketten-Aufklebern
		mit den Ma&szlig;en 68 x 36, wobei zwischen den Druckschriften
		Breit, Normal und Schmal gew&auml;hlt werden kann.
		<BR>
		Autor: Heinz Hess</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AFonts V1.2 - (Update 3/94)</TD>

		<TD>AFonts ist ein in Assembler geschriebenes Anzeigeprogramm
		f&uuml;r Amiga-Fonts. Es zeigt die Fonts auf Wunsch in
		verschiedenen Schriftstilen (normal, fett, kursiv,
		unterstrichen), mit verschiedenen Vorder- und Hintergrundfarben
		und in verschiedenen Anzeigemodi. Rechnerisch ergeben sich mehr
		als hundert M&ouml;glichkeiten, einen einzelnen Font
		darzustellen. Wenn man will, kann man mit einem
		ausgew&auml;hlten Font auch kurze Texte schreiben und sie
		ausdrucken lassen. Weiterhin gibt AFonts alle m&ouml;glichen
		Informationen &uuml;ber die Eigenschaften jedes Fonts, z.B.
		Gr&ouml;&szlig;e, Zeichenbreite, ob proportional, Colorfont
		u.&auml;.
		<BR>
		Autor: J&uuml;rgen Klawitter</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Pushem</TD>

		<TD>Pushem ist ein Spiel, da&szlig; von den Spielern viel
		Kreativit&auml;t und vorrausschauendes Denken erfordert. Der
		Spieler mu&szlig;, will er einen Level l&ouml;sen, rote
		B&auml;lle auf Zielfelder schieben. Ein Level gilt als
		gel&ouml;st, wenn jedes Zielfeld mit einem Ball besetzt ist. 21
		Level sind bereits vorhanden, weitere Level k&ouml;nnen selbst
		kreiert werden. In dieser Version sind einige kleine Fehler
		beseitigt worden und der Vorspann l&auml;&szlig;t sich jetzt auf
		Knopfdruck abbrechen.
		<BR>
		Autoren: Peter Groth und Markus Uhlendahl</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Flush</TD>

		<TD>Flush entfernt nicht mehr gebrauchte Libraries, Devices und
		Fonts aus dem Speicher. Das Programm kann von der Workbench aus
		gestartet werden. Inclusive Assembler Source.
		<BR>
		Autor: J&uuml;rgen Klawitter</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Klock V2.0 - (Update 3/94)</TD>

		<TD>Klock ist eine Uhr mit Wochentags-, Datum- und
		Speicheranzeige. Die wichtigsten Eigenschaften sind: Rahmenloses
		Fenster mit verdeckten Systemgadgets. Position, Art der
		Speicheranzeige, Vorder- und Hintergrundfarbe sind
		konfigurierbar. Kurzer Programmcode, da in Assembler
		geschrieben. Koppelt sich vom CLI ab. Sehr geringe Beanspruchung
		der CPU.
		<BR>
		Autor: J&uuml;rgen Klawitter</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Missile Command</TD>

		<TD>Missile Command ist eine sehr gute Amiga-Umsetzung von Max
		Bithead des gleichnamigen Spielhallen-Klassikers. F&uuml;nf
		St&auml;dte m&uuml;ssen gegen die Angriffe aus dem Weltraum
		verteidigt werden.
		</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AztecErr V1.25</TD>

		<TD>Bei diesem Programm handelt es sich um ein Programmier-Tool
		f&uuml;r den Manx Aztec C-Compiler V5.xx. Es liest die
		AztecC.Err-Datei und zeigt die darin enthaltenen Fehler an. Das
		Programm ben&ouml;tigt >= OS 2.04.
		<BR>
		Autor: Hans Peter G&uuml;nther</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">CloseWD V2.11</TD>

		<TD>Wer kennt es nicht? Da gibt es Programme, die
		h&auml;&szlig;liche Fenster auf der Workbench hinterlassen,
		obwohl sie l&auml;ngst beendet sind. Um diese l&auml;stigen
		Fenster loszuwerden, kann man CloseWD benutzen. Ben&ouml;tigt >=
		OS 2.04.
		<BR>
		Autor: Hans Peter G&uuml;nther</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Super Print V3.4 - (Update 5/94)</TD>

		<TD>SuperPrint ist ein Hilfsprogramm, um einem die Arbeit beim
		Ausdrucken von ASCII - Dokumenten oder Quellcodes zu
		erleichtern. Dabei k&ouml;nnen die Seiten durchnummeriert
		werden, die R&auml;nder k&ouml;nnen frei eingestellt werden,
		&uuml;berlange Zeilen werden angepa&szlig;t und ein eigener Text
		kann auf jeder Seite ausgegeben werden. Das Programm
		ben&ouml;tigt >= OS 2.04.
		<BR>
		Autor: J&uuml;rgen Schmitz</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AskVersion V0.4 - (Update 5/94)</TD>

		<TD>Ein kleines Programm, da&szlig; als erstes Kommando in der
		Startup-Sequence gestartet werden kann, um herauszufinden mit
		welcher Kickstart - Version gebootet wird, um z.B. zu einem WB
		1.3 Startup-Script zu verzweigen.
		<BR>
		Autoren: Hans Peter G&uuml;nther und Constantin Rack</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 7b</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">DecAB</TD>

		<TD> Das Programm kann gesch&uuml;tzte AmigaBASIC Programme, die
		mit der Option "P" abgespeichert wurden, wieder
		entsch&uuml;tzen. Inclusive Source in GFA-Basic.
		<BR>
		Autor: Andre Voget</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">DataMaster V1.2c</TD>

		<TD>Mit DataMaster lassen sich sehr einfach Adressen,
		Schallplatten, Compact Disk, Disketten, Videos, Kochrezepte oder
		was auch immer Sie m&ouml;chten, verwalten. Mit dem integrierten
		Langtexteditor haben Sie die M&ouml;glichkeit zu jedem Datensatz
		einen beliebig langen Text hinzuzuf&uuml;gen.
		<BR>
		Autor: Georg Strauch</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Amoeba Invaders</TD>

		<TD> Eine sehr gute Amiga-Umsetzung des Spielhallen - Klassikers
		"Space Invaders".
		<BR>
		Autoren: Chris Halsall und Ewan Edwards</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Konto</TD>

		<TD>Dieses Programm ist f&uuml;r diejenigen gedacht, die ihr
		Konto, Haushaltskasse oder &auml;hnliches, mit einem einfachen,
		leicht bedienbaren und doch sicheren Programm verwalten wollen.
		<BR>
		Autor: Manfred Schubert</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Sprite Ed</TD>

		<TD>Ein sehr guter Sprite Editor, mit dem Sie doppelt breite
		Sprites der Gr&ouml;&szlig;e 32 x 21 entwerfen k&ouml;nnen.
		<BR>
		Autor: Scott Lamb</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">XFire</TD>

		<TD>Ein schnelles und unterhaltsames Ballerspiel, das nicht so
		einfach zu spielen ist, denn ein flotter Joystick und Ausdauer
		sind gefragt.
		<BR>
		Autor: Andreas Ehrentraut</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AskReq V1.00</TD>

		<TD> AskReq ist ein Batch Requester Tool. Es kann den Benutzer
		nicht nur zwischen OKAY oder ABBRUCH entscheiden lassen, sondern
		auch Text und Zahleneingaben t&auml;tigen lassen. Die Resultate
		k&ouml;nnen in jeder Art von Batch-Dateien verwendet werden.
		Ben&ouml;tigt >= OS 2.04.
		<BR>
		Autor: Hans Peter G&uuml;nther</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">FRequest V1.55</TD>

		<TD>Ein Tool, mit dem man eine Datei per ASL-Requester
		ausw&auml;hlen und eine CLIKommandozeile mit der gew&auml;hlten
		Datei ausf&uuml;hren kann. Der Requester kann vom Benutzer
		modifiziert werden und eignet sich besonders f&uuml;r den
		Einsatz in Batch-Dateien. Ben&ouml;tigt >= OS 2.04.
		<BR>
		Autor: Hans Peter G&uuml;nther</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">PickFile V1.2</TD>

		<TD>PickFile w&auml;hlt aus einer Liste oder aus einem
		Verzeichnis einen Eintrag zuf&auml;llig aus und f&uuml;hrt dann
		die vorher angegebenen Kommandos aus. Auf diese Weise
		k&ouml;nnen Prefs-Dateien, Sampled-Sounds oder Slide-Shows mit
		zuf&auml;lliger Reihenfolge gestartet werden. Ben&ouml;tigt >=
		OS 2.04.
		<BR>
		Autor: Hans Peter G&uuml;nther</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 8b</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Noter V1.3</TD>

		<TD>Das Programm ist f&uuml;r all diejenigen gedacht, die
		Gitarre spielen, aber keine Noten kennen, oder ein St&uuml;ck
		ausgeknobelt haben und es anschlie&szlig;end als Noten der
		Nachwelt hinterlassen m&ouml;chten.
		<BR>
		Autor: Robert Chwalczyk</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">BobEdi V2.0</TD>

		<TD>Ein Editor mit dem Bobs und Sprites, auch animierte,
		gestaltet und als Source f&uuml;r Modula, Oberon, Assembler
		Basic und C abgespeichert werden k&ouml;nnen. Dabei sind bis zu
		99 Bilder mit einer Gr&ouml;&szlig;e von maximal 64 x 64 Pixel
		f&uuml;r animierte Bobs und Sprites m&ouml;glich.
		<BR>
		Autor: Frank L&auml;mker</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Oscar V1.0</TD>

		<TD>Eine Filmdatenbank mit der pro Diskette bis zu 4000 Filme
		verwaltet werden k&ouml;nnen.
		<BR>
		Autor: Torsten Gottschalk</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Amiga B&uuml;cherei V1.5 - (Update 5/94)</TD>

		<TD>Amiga B&uuml;cherei ist ein Programm mit dessen Hilfe man
		seinen privaten Buchbestand auf einfache und komfortable Weise
		verwalten kann. Die Datei kann dabei die Daten von maximal 10
		000 B&uuml;chern enthalten. Die Daten der alten Version
		k&ouml;nnen problemlos weiterverwendet werden. In der
		vorliegenden Demoversion ist die Anzahl der Datens&auml;tze auf
		50 begrenzt.
		<BR>
		Autor: Torsten Gottschalk</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Tischtennis</TD>

		<TD>Ein Sportspiel f&uuml;r 1-2 Spieler. Sie k&ouml;nnen ein
		Match gegen Ihren Freund oder gegen den Computer spielen. Sie
		k&ouml;nnen aber auch in Tunieren starten und versuchen die
		Nummer 1 in der Weltrangliste zu werden. Ben&ouml;tigt 1 MB
		Speicher.
		<BR>
		Autor: Andreas Baum </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">China Challenge II</TD>

		<TD>Ein Denkspiel, das vom Prinzip dem altbekannten Shanghai
		sehr &auml;hnlich ist. Ziel ist es, einen Turm, den sogenannten
		Drachen, St&uuml;ck f&uuml;r St&uuml;ck abzubauen.
		<BR>
		Autor: Dirk Hoffmann</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">ProgSelect V1.0</TD>

		<TD>ProgSelect ist ein Programm, mit welchem Sie von der
		Workbench aus andere Programme starten k&ouml;nnen. Maximal
		k&ouml;nnen bis zu 10 Programme mit ihren jeweiligen Suchpfaden
		in eine Config - Datei, die man mit einem beliebigen Editor
		erstellen kann, eingetragen werden.
		<BR>
		Autor: Torsten Gottschalk</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 9b</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Mariko</TD>

		<TD>Das Spiel Mariko wird auf einem 8 * 12 Felder gro&szlig;em
		Brett gespielt. Das Ziel besteht darin, 72 Steine auf das Brett
		zu legen. Am Anfang liegen bereits 6 Steine in den Ecken und in
		der Mitte, an die, die &uuml;brigen Steine angelegt werden
		m&uuml;ssen. Ein Stein kann aber nur dann angelegt werden, wenn
		entweder das Symbol oder der Rand mit dem benachbartem Stein
		&uuml;bereinstimmen. Ein Spiel bei dem Taktik und Hirn gefragt
		sind!
		<BR>
		Autor: Ulrich Hofmann</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Codeknacker - (Neu 2/94)</TD>

		<TD>Die Aufgabe bei diesem Spiel ist es, mit den Ziffern von 0
		bis 9 den Code zu knacken. Durch logisches Denken und
		Kombinationsgabe mu&szlig; dies mit m&ouml;glichst wenig
		Versuchen erreicht werden. Die zehn Besten k&ouml;nnen sich in
		der Highscore verewigen.
		<BR>
		Autor: Horst Wiegmann</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Harddisk Menu V2.21</TD>

		<TD>Ein Programm f&uuml;r Leute, die mit einer Harddisk arbeiten
		und ihre Programme komfortabel von einem Men&uuml; aus starten
		m&ouml;chten.
		<BR>
		Autor: Thorsten Meier</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Amiga Cash V1.0</TD>

		<TD>AmigaCash ist eine auf den privaten Bereich zugeschnittene
		Finanzbuchf&uuml;hrung und dient zur Erfassung und sp&auml;teren
		statistischen Auswertung der privaten Einnahmen und Ausgaben.
		Dar&uuml;ber hinaus ist in dem Programm ein Modul zur Ermittlung
		der Kraftstoffkosten und Verbrauchswerte f&uuml;r ein KFZ
		implementiert.
		<BR>
		Autor: Georg Strauch</TD>
	    </TR>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 10a</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Amiga Archiv</TD>

		<TD>Amiga Archiv ist ein Programm mit dessen Hilfe Sie auf
		&uuml;bersichtliche Art und Weise Ihren gesamten
		Literaturbestand verwalten k&ouml;nnen. Es ist dabei besonders
		f&uuml;r die Verwaltung von einzelnen Artikeln konzipiert. Mit
		Hilfe von vielf&auml;ltigen Suchroutinen k&ouml;nnen Sie einen
		bestimmten Artikel oder ganze Listen nach bestimmten Kriterien
		suchen und auch drucken lassen.
		<BR>
		Autor: Torsten Gottschalk</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Arcadia</TD>

		<TD>Arcadia ist ein Breakout-Spiel &auml;hnlich dem
		kommerziellen Spiel Arkanoid. Das Spiel hat eine sch&ouml;ne
		Grafik, 25 Level, Bonussteine, die f&uuml;r &Uuml;berraschungen
		sorgen k&ouml;nnen. Zus&auml;tzlich einen Level - Editor mit dem
		die vorhandenen Level nach eigenen Vorstellungen gestaltet
		werden k&ouml;nnen. Source in AMOS-Basic.
		<BR>
		Autor: Ronnie Simpson</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> KeyCode V1.0</TD>

		<TD>KeyCode ist ein Tastenschloss, welches den jeweiligen
		CLI-Task sperrt. Spielt jemand am Schloss herum, l&ouml;st er
		automatisch Alarm aus. Dieser wird selbst nach einem Reset oder
		dem Ausschalten gespeichert und steht dann beim Neustart wieder
		mit dem Datum und der Uhrzeit der Alarmausl&ouml;sung an. Der
		Alarm wird erst wieder gel&ouml;scht, wenn die richtige Zahl
		eingegeben wird.
		<BR>
		Autor: Uwe Armbruster </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> ClickRun V1.0</TD>

		<TD>Ein Utility mit dem man bis zu f&uuml;nfzig Programme bequem
		mit einem Mausklick starten kann. ClickRun hat einen eingebauten
		Editor, so da&szlig; man jederzeit die Konfiguration &auml;ndern
		kann. Au&szlig;erdem gibt es eine Online - Hilfe, die die
		wichtigsten Tastatur- und Mauskommandos anzeigt und eine
		Iconify-Funktion.
		<BR>
		Autor: Andre Voget </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Sunny Konto V1.5</TD>

		<TD>Eine Konto-Verwaltung, mit sehr vielen Funktionen, die mehr
		bietet als manch ein kommerzielles Programm. Die wichtigsten
		Leistungsmerkmale des Programms: beliebig viele Kontendateien;
		Buchungen k&ouml;nnen auch wieder gel&ouml;scht werden; Konten
		k&ouml;nnen nach verschiedenen Kriterien sortiert werden... und
		vieles mehr.
		<BR>
		Autor: Andre Voget </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> CoverMaster V1.0</TD>

		<TD>Wenn Sie oft Kassetten &uuml;berspielen kennen Sie
		sicherlich das Problem. Wie schreibe ich die neuen Titel
		m&ouml;glichst leserlich auf die H&uuml;lle ? Mit diesem
		Programm umgehen Sie dieses Problem. Sie k&ouml;nnen Ihre Audio-
		Kassetten beliebig oft &uuml;berspielen und drucken jederzeit
		mit Hilfe von CoverMaster auf einfachste Weise eine neue
		Kassettenh&uuml;lle.
		<BR>
		Autor: Torsten Gottschalk </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Musik Master II</TD>

		<TD>Musik Master ist ein Programm mit dem Sie auf einfache Art
		und Weise Ihre gesammte Plattensammlung verwalten k&ouml;nnen.
		Bis auf die Dateneingabe erfolgt die Bedienung nur mit der Maus.
		Pro Diskette k&ouml;nnen 2500 Platten verwaltet werden.
		<BR>
		Autor: Torsten Gottschalk </TD>

	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 11e</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Look V3.5 - (Update 7/94)</TD>

		<TD> Wollten Sie schon immer einmal Ihr eigenes Disketten
		-Magazin herausbringen? Dann ist dieses Programm genau das
		Richtige f&uuml;r Sie, denn Look ist ein Anzeigeprogramm
		f&uuml;r Diskettenmagazine mit sehr vielen M&ouml;glichkeiten.
		So k&ouml;nnen z.B. Texte ein-, zwei- oder dreispaltig und mit
		verschiedenen Zeichens&auml;tzen angezeigt werden.
		Au&szlig;erdem k&ouml;nnen IFF - Bilder oder Brushes angezeigt,
		Programme gestartet werden und vieles mehr...
		<BR>
		Autor: Andre Voget </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Mega Mind</TD>

		<TD> Mega Mind ist eine sehr gut gemachte "Superhirn" Umsetzung.
		Das Spiel bietet nicht nur eine tolle Grafik sondern auch
		verschiedene Schwierigkeitsgrade.
		<BR>
		Autor: Bernd Kr&auml;uter </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Billard V1.1</TD>

		<TD> Eine sehr sch&ouml;ne Billard - Simulation, die noch einige
		zus&auml;tzliche Funktionen bietet. Der Autor hat einige kleine
		Fehler des Programms behoben und die Bewegung der Kugeln
		verbessert.
		<BR>
		Autor: Stefan Salewski </TD>

	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Warum</TD>

		<TD> Bei diesem Programm handelt es sich um eine deutsche
		Version des CLI - Befehls "Why" und dient zur Ermittlung von
		Fehlercodes.
		<BR>
		Autor: Matthias Gutt </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Gammon V1.2</TD>

		<TD> Eine Umsetzung des BackGammon-Spiels. Wahlweise k&ouml;nnen
		zwei Spieler gegeneinander, oder ein Spieler gegen den Amiga
		spielen. Aber auch ein Spiel Amiga gegen Amiga ist m&ouml;glich,
		z.B. zu &Uuml;bungszwecken.
		<BR>
		Autor: Marc Fischlin </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT"> Inhalt Amiga Szene Diskette 12c</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Changer V4.02</TD>

		<TD> Gerade im PD-Bereich gibt es eine F&uuml;lle toller Icons,
		die man vielleicht f&uuml;r eigene Programme verwenden
		m&ouml;chte. Doch nicht immer sind sie vom richtigen Typ. Mit
		Changer k&ouml;nnen Sie dieses Problem nun elegant l&ouml;sen,
		indem Sie einfach den Typ eines Icons ver&auml;ndern. Eine Menge
		toller Icons werden gleich mitgeliefert.
		<BR>
		Autor: Thomas G&uuml;nther </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> EasyStart V1.12</TD>

		<TD> EasyStart ist, wie der Name schon sagt, ein Programm, das
		das Starten von anderen Programmen sehr vereinfacht. Allerdings
		werden die Programme nicht einfach nur gestartet, sondern es
		stehen auch eine Vielzahl von Startoptionen sowie
		Startm&ouml;glichkeiten zur Verf&uuml;gung.
		<BR>
		Autor: Andreas Krebs </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Reversi V1.3 </TD>

		<TD> Eine Amiga-Umsetzung des beliebten Brettspiels Reversi. Das
		Programm hat eine komfortable Benutzeroberfl&auml;che und
		beherrscht drei verschiedene Varianten des Spiels.
		Au&szlig;erdem bietet es noch einige zus&auml;tzliche Funktionen
		wie zwei Spielst&auml;rken, Computergegner, Spiele k&ouml;nnen
		auf Disk gespeichert und wieder geladen werden, m&ouml;gliche
		Z&uuml;ge anzeigen, Seitenwechsel, Spielprotokoll und Statistik.
		<BR>
		Autor: Wolfram Schenk </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> MasterMind V2.2</TD>

		<TD>Eine weitere Umsetzung des Spiels "Superhirn", doch bietet
		das Programm zus&auml;tzlich noch die M&ouml;glichkeit die
		Anzahl der Farben und der Felder zu erh&ouml;hen bzw. herunter
		zu setzen. So ergeben sich ganz neue Perspektiven f&uuml;r das
		Spiel. In der vorliegenden Demoversion ist jedoch die Anzahl der
		Felder auf 3 und der Farben auf 5 beschr&auml;nkt. In der
		Vollversion, die beim Autor erh&auml;ltlich ist sind 5 Felder
		und 9 Farben m&ouml;glich.
		<BR>
		Autor: Burkhard Brauer</TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Plattenliste</TD>

		<TD>Verlieren Sie auch allm&auml;hlich die &Uuml;bersicht
		&uuml;ber Ihre Schallplatten-Sammlung ? Dann kommt hier genau
		das richtige Programm f&uuml;r Sie. Sie k&ouml;nnen sich eine
		Liste Ihrer Schallplatten (oder Kassetten) erstellen und diese
		ausdrucken. Dann wissen Sie jederzeit was Sie alles besitzen und
		wo Sie es finden. Au&szlig;erdem eignet sich diese Liste um sich
		mit Freunden und Bekannten auszutauschen. Da das Programm in
		Amiga-BASIC geschrieben wurde, wird der AmigaBASIC-Interpreter
		ben&ouml;tigt.
		<BR>
		Autor: Tobias Nicol</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 13</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">ShowGuru V3.4</TD>

		<TD> Wer kennt sie nicht, diese tollen Meldungen ? Meistens
		kommen sie dann, wenn man sie am wenigsten gebrauchen kann. Aber
		was sollen diese Meldungen ? Das Betriebssystem versucht Ihnen
		zu sagen, welche Ursachen dieser Absturz hatte. Die meisten
		Gurus werden einfach nur weggeklickt, ohne die Guru-Nummer zu
		beachten. Wer sich jedoch auch f&uuml;r die Ursache der
		Abst&uuml;rze interessiert, wird in diesem Programm, da&szlig;
		zur Zeit 328 Gurus kennt, einen guten Helfer finden.
		<BR>
		Autoren: Thomas Carstens und Heinz Pohlmann </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> LastAlert V1.3 </TD>

		<TD> Bei LastAlert handelt es sich um eine CLI bzw. Shell -
		Version des Programms "ShowGuru".
		<BR>
		Autor: Thomas Carstens </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> It`s Logic V1.0 </TD>

		<TD> Ein Denkspiel, da&szlig; die kleinen grauen Zellen
		strapaziert. Ihre Aufgabe ist es mittels 12 Transformations -
		Schaltern neun Spielfelder mit m&ouml;glichst wenig Z&uuml;gen
		blau einzuf&auml;rben. Ein Spiel, da&szlig; Ausdauer und
		logisches Denken erfordert
		<BR>
		Autor: Manfred Kopp </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> ASwarm II V1.3 </TD>

		<TD> Ein Bildschirmschoner mit hoher Sicherheit, brennt nicht
		seine Grafik auf den Schirm, wenn die CPU belastet ist. Lustig
		anzusehen. Ben&ouml;tigt OS 2.04 oder h&ouml;her. Inclusive
		C-Source.
		<BR>
		Autoren: Markus Illenseer und Matthias Scheler </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Giroman V4.10 </TD>

		<TD> Im Zeitalter des bargeldlosen Zahlungsverkehrs nennt heute
		jeder Bundesb&uuml;rger ein Girokonto sein eigen. Doch oft sind
		die Bankausz&uuml;ge so un&uuml;bersichtlich, da&szlig; man sich
		kein klares Bild &uuml;ber seine Ein- und Ausgaben machen kann.
		In diesem Fall ist Giroman der kompetente Partner f&uuml;r Ihre
		Kontof&uuml;hrung und -verwaltung. Es ist ein sehr
		leistungsf&auml;higes Girokontoverwaltungsprogramm das jedoch
		sehr einfach und komfortabel zu bedienen ist.
		<BR>
		Autor: S&ouml;nke Netzband </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 14b</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> PrintStudio V1.25 </TD>

		<TD> Das Programm PrintStudio ist ein universell einsetzbares
		Drucker - Utility mit einer sehr komfortablen grafischen
		Oberfl&auml;che, die ihres Gleichen sucht. Zu den
		F&auml;higkeiten von PrintStudio geh&ouml;rt: ausdrucken von
		IFF-Bildern, ausdrucken von beliebigen Teilen der Bilder,
		ausdrucken von Screens und Fenstern, ausdrucken von Text,
		ausdrucken von Textteilen, abspeichern von Screens und Fenstern
		als IFF-Dateien, ver&auml;ndern der Farben von Screens und
		Bildern und vieles mehr.

		Autor: Andreas Krebs </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> MultiReq V1.20 </TD>

		<TD> MultiReq ist eine FileRequester-Library, aber nicht einfach
		eine weitere FileRequester-Library, sondern es ist der erste
		richtige Multitasking- FileRequester und dar&uuml;ber hinaus
		bietet es noch eine Vielzahl weiterer Besonderheiten, die ihn
		gegen&uuml;ber anderen FileRequestern auszeichnen.

		Autor: Andreas Krebs </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> CCK V1.02 </TD>

		<TD> Das CREW CONSTRUCTIONS KIT ist ein Zusatzprogramm f&uuml;r
		das kommerzielle Spiel THEIR FINEST HOUR - The Battle of
		Britain. Es erm&ouml;glicht die schnelle und einfache Erzeugung
		kompletter Crews, mit allen vom Orginal - Spiel bekannten
		Auszeichnungen und Bef&ouml;rderungen. Alle relevanten Werte,
		die die Schlagkraft einer Crew oder eines Piloten beeinflussen,
		k&ouml;nnen frei editiert werden.

		Autor: Thomas G&uuml;nther </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Fujitsu DL V4.0 (Update 7/94) </TD>

		<TD> Ein Printer-Preferences Programm f&uuml;r Fujitsu DL
		Drucker. Mit dem Programm ist es m&ouml;glich innerhalb von
		Sekunden den Drucker neu zu konfigurieren, ohne Papier zu
		verschwenden und ohne den Zwang die &Auml;nderungen im Drucker
		abspeichern zu m&uuml;ssen. Das Programm ben&ouml;tigt OS 2.04
		und installiertes MUI-System.

		<BR>Autor: Markus Uhlendahl </TD>
	    </TR><TR>
		<TD VALIGN="TOP"> LH-Handler V1.5 </TD>

		<TD> LH-Handler ist eine komfortable Benutzeroberfl&auml;che
		f&uuml;r das Archiv-Programm LHA mit vielen Funktionen. Das
		Programm erfordert OS 2.04 oder h&ouml;her.

		<BR>Autor: Frank Fenn </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 15p</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> VT2.66 (Update 7/94) </TD>

		<TD> Ein sehr guter Viren - Tester, der st&auml;ndig
		aktualisiert wird, um den virengeplagten Anwendern einen
		m&ouml;glichst umfassenden Virenschutz zur Verf&uuml;gung zu
		stellen.

		<BR>Autor: Heiner Schneegold </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 16e</TH>

	    </TR>
	    <TR>
		<TD VALIGN="TOP"> PR V3.02 </TD>

		<TD> Die Romanverwaltung PR ist ein Programm zum
		planm&auml;&szlig;igen Erfassen, Verwalten und Auswerten von
		gr&ouml;&szlig;eren Best&auml;nden an Zeitschriften,
		B&uuml;chern, oder insbesondere sogenannten Groschen-Romanen.
		Dieses Programm ist besonders f&uuml;r Sammler geeignet.
		Ben&ouml;tigt >= OS 2.04.

		<BR>Autor: Andreas Ralph Kleinert </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> ak_gen0.library V38.21 (Update 2/94) </TD>

		<TD> Eine Library mit vielen Funktionen, die die Programmierung
		z.B. von Intuition sehr erleichtert. In dem Paket enthalten sind
		einige Beispielprogramme in C, dessen Source, sowie die
		Header-Files.

		<BR>Autor: Andreas Ralph Kleinert </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> ArcL V1.2 </TD>

		<TD> Das Programm wurde entworfen, um den Inhalt von File -
		Archiven aufzulisten. ArcL entscheidet automatisch um welchen
		Archiv-Typ es sich handelt. Zur Zeit werden die Typen Arc, Zoo,
		LhArc und Zip erkannt.

		<BR>Autor: Oliver Graf </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> AXPR V2.1 </TD>

		<TD> Dieses Programm ist, wie der Name schon sagt, ein
		Filetransferprotokoll, das den XPR 2.0 Standard unterst&uuml;tzt
		und dabei &auml;u&szlig;erst benutzerfreundlich ist.

		<BR>Autor: Thomas Globisch </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> Bildschirmschoner V2.0 </TD>

		<TD> Ein Bildschirmschoner, der viele einstellbare Optionen
		bietet wie Laufschrift, Sternenhimmel, Herbert, Linien, LOGO -
		Verfolgung, Normal Dunkel, einstellbare Zeit und
		Taskpriorit&auml;t.

		<BR>Autor: Siegfried Rings </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP"> TextInfo V1.0 </TD>

		<TD> TextInfo gibt Informationen &uuml;ber Texte, z.B. Zeilen-
		und Seitenzahl, Anzahl der Worte, l&auml;ngste Zeile, enthaltene
		Steuerzeichen und dergleichen mehr.

		<BR>Autor: J&uuml;rgen Klawitter </TD>
	    </TR><TR>
		<TD VALIGN="TOP"> DAssignX V1.01 </TD>

		<TD> DAssignX patcht Intuitions EasyRequest-Funktion so,
		da&szlig; alle Requester bez&uuml;glich nicht-existierender oder
		herausgenommener Disketten, von einer speziellen Routine
		abgefangen werden k&ouml;nnen. Das Programm basiert auf dem
		Source-Code von AssignX von Steve Tibbet. Das besondere an
		dieser Version ist, da&szlig; zus&auml;tzlich zu den englischen
		Texten, auch die deutschen Texte der WB 2.1 und 3.0 erkennt.
		Ben&ouml;tigt >= OS 2.04.

		<BR>Autor: Andreas Ralph Kleinert </TD>

	    </TR><TR>
		<TD VALIGN="TOP"> K8SVX V1.80 </TD><TD> Das Programm gibt Ihnen
		die M&ouml;glichkeit, auf einfache Art und Weise IFF-8SVX
		Sample-Dateien abzuspielen.

		<BR>Autor: Andreas Ralph Kleinert </TD>
	    </TR><TR>
		<TD VALIGN="TOP"> SMaus V1.17 </TD><TD> SMaus aktiviert jeweils
		das Fenster, da&szlig; sich unter dem Mauspfeil befindet, wobei
		das Programm dem Benutzer diverse Einstellungsm&ouml;glichkeiten
		bietet. Ben&ouml;tigt OS>=2.04.

		<BR>Autor: Stefan Sticht </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 17e</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
AKCC V3.03                                                        (Update 2/94)
</TD><TD>
AKCC ist ein Paket von CLI-/Shell-Kommandos f&uuml;r den Amiga, das  die Arbeit mit
dem  Amiga, insbesondere  f&uuml;r erfahrene  Anwender, aber auch  f&uuml;r Anf&auml;nger er-
leichtern soll. In dem Paket ist auch eine kleine komfortable Shell enthalten,
die speziell f&uuml;r die Bed&uuml;rfnisse der Benutzer von OS 1.2/1.3 konstruiert wurde
aber auch unter OS 2.04 einwandfrei arbeitet.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
SR-BASE V1.19
</TD><TD>
SR-BASE ist eine sequentielle einfache Dateiverwaltung. Die Maske aus 8 Krite-
rien ist  festgelegt. Es k&ouml;nnen lediglich  die Namen der  Bezeichnungen ausge-
w&auml;hlt werden. Bei der Programmierung des Programms  wurde Wert auf eine benut-
zerfreundliche Bedienung gelegt.

<BR>Autor:  Siegfried Rings
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
DiskPrint V3.59
</TD><TD>
Eine  inzwischen schon  recht bekannte  Disketikettenverwaltung mit  flexiblen
Etikettendruckfunktionen f&uuml;r jeden Drucker, f&uuml;r den ein Workbench-Druckertrei-
ber existiert, und enth&auml;lt  in der aktuellen  Version auch einen  Spezialmodus
f&uuml;r den HP Deskjet, der ja  nur einzelne Etikettseiten  verarbeiten  kann. Der
Vollversion,  die  beim Autor  erh&auml;ltlich ist,  liegen Dateien  mit  &uuml;ber 3000
druckfertigen Etiketten (u.a. die Serien Fish, Kickstart, Amok, Antares, Franz
u.v.a.m.) bei. Die schnelle  Suchfunktion  erleichtert das Auffinden  von Pro-
grammen und Etiketten.

<BR>Autor:  Jan Gei&szlig;ler
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			  Inhalt Amiga Szene Diskette 18</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
DolmetschE V2.50
</TD><TD>
Das Programm ist eine Mischung aus einem  &Uuml;bersetzungsprogramm, Vokabeltrainer
und einer leistungsf&auml;higen Dateiverwaltung. Es &uuml;bersetzt fremdsprachige Texte,
die als ASCII-Datei vorliegen. Eine  Vokabeldatei von ca. 11000 englischen Vo-
kabeln ist auf der Diskette vorhanden. Das Programm  kann aber auch f&uuml;r andere
Sprachen verwendet werden.

<BR>Autor:  Henry K&ouml;nig
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			  Inhalt Amiga Szene Diskette 19e</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Magic Clouds V1.0
</TD><TD>
Viele Grafiker suchen immer wieder nach Wolken als  Hintergrundgrafik f&uuml;r ihre
Bilder. Auch  bei Spieleprogrammierern  sind Wolken als  Hintergrundgrafik be-
gehrt. Magische  Wolken ist ein  Programm welches  Wolkengebilde  erstellt. Es
bietet viele Einstellungsm&ouml;glichkeiten zum Erstellen von Wolken, die anschlie-
&szlig;end als IFF-Grafik abgespeichert werden k&ouml;nnen.

<BR>Autor:  Siegfried Rings
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Etiketti V3.1
</TD><TD>
Etiketti ist  ein sehr schnelles  und benutzerfreundliches  Programm um eigene
Etiketten zu entwerfen  und zu drucken. Es k&ouml;nnen  nicht nur Disketten - Label
sondern auch Etiketten f&uuml;r manch anderen Zweck erstellt werden.

<BR>Autor:  Siegfried Rings
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
AntiCicloVir V2.1                                                 (Update 3/94)
</TD><TD>
Ein sehr einfach zu  bedienender Linkviruskiller, der  Linkviren nicht nur auf
der Diskette, sondern auch im Speicher  erkennt. In dieser  Version werden 126
Bootblock-Viren, 17 Linkviren, 28 Fileviren, 7 Disk-Validator-Viren, 14 Troja-
nische Pferde und 8 Bomben erkannt.

<BR>Autor:  Matthias Gutt
</TD>

	    </TR><TR>
		<TD VALIGN="TOP">
AdressKartei V1.46
</TD><TD>
Eine sehr einfach zu handhabende Dateiverwaltung, die speziell f&uuml;r die Verwal-
tung von Adressen entwickelt wurde. Die  Anzahl der Adressen die  mit dem Pro-
gramm verwaltet werden k&ouml;nnen, ist  nur durch die Disketten- bzw. Festplatten-
kapazit&auml;t begrenzt.

<BR>Autor:  Michael Petrikowski
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
HeadUp V1.41
</TD><TD>
Ein Tool, das auf der Workbenchoberfl&auml;che l&auml;uft. Es zeigt  neben der aktuellen
Uhrzeit auch das freie  Chip- bzw. Fastram an. Zudem  k&ouml;nnen Textdateien, IFF-
Bilder und mit dem PowerPacker gepackte Dateien angezeigt werden.

<BR>Autor:  Stefan Magin
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
KassettenCover V1.3
</TD><TD>
Wie der Name schon vermuten l&auml;&szlig;t, handelt es sich um ein Programm zum Bedruck-
en von  Kassetten-H&uuml;llen. Wobei KassettenCover  sehr viele Funktionen und Ein-
stellungsm&ouml;glichkeiten bietet.

<BR>Autor:  Dieter Tewes
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 20a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Datei V3.09a
</TD><TD>
Universaldatei f&uuml;r  viele Zwecke.  Verwaltung  von externen  Dateien  wie z.B.
Kochrezepten und &auml;hnlichem. Die externen Dateien k&ouml;nnen  je Datensatz 6 Zeilen
mit jeweils 80 Zeichen je Zeile  enthalten. Diverse  Musterdateien wie Adress-
datei, B&uuml;cherdatei, Aktenverwaltung, Plattendatei, Musikkassetten, mehrere Vi-
deodateien, und Diskettenverwaltung sind  bereits enthalten. L&auml;uft  auch unter
OS 2.0 und OS 3.0 fehlerfrei.

<BR>Autor:  Henry K&ouml;nig
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
		       Inhalt Amiga Szene Diskette 21a/22a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
PD.Datenbank
</TD><TD>
Eine PD - Datenbank f&uuml;r das Programm "Datei V3.09a" mit &uuml;ber 19500 PD-Program-
men aus mehr als 50  Serien. Das sind  ca. 1,3 MB Daten. Disk 21a  enth&auml;lt die
Serien A-F Disk 22a die Serien G-Z.

<BR>Autor:  Henry K&ouml;nig
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 23a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Anubis V0.520
</TD><TD>
Anubis ist ein Mailboxprogramm, das Sie in  Verbindung mit  einem Hayes kompa-
tiblen Modem in die Lage versetzt, eine Mailbox  zu betreiben und so Usern die
Gelegenheit zu geben, Nachrichten  und Programme  auszutauschen. Das Programm-
paket enth&auml;lt alles, was Sie f&uuml;r den Betrieb einer Mailbox ben&ouml;tigen.

<BR>Autoren:  Oliver Graf, Thomas Globisch und Marc Schr&ouml;er
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 24d</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
DoBB V1.05
</TD><TD>
DoBB installiert einen  Bootblock auf Diskette, oder  schreibt einen Bootblock
von einer Diskette in eine Datei. Inklusive Assembler-Source.

<BR>Autor:  Volker Stepprath
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
AddressMaster V1.20                                               (Update 5/94)
</TD><TD>
Eine Adre&szlig;verwaltung f&uuml;r >= OS 2.04, die &uuml;ber Serienbrief-, &Uuml;berweisungsformu-
lar, Umschlag- und Etikettendruckfunktionen sowie eine Modem-W&auml;hlfunktion ver-
f&uuml;gt. Das Programm  ist vollst&auml;ndig  deutschsprachig und  dementsprechend auch
auf  das deutsche  Adre&szlig;system (und auch  f&uuml;nfstelligen Postleitzahlen)  zuge-
schnitten. Es ist font- sensitiv  (auch Proportionalfonts), hat Commodity-Sup-
port,  nutzt 2.0 - Features wie  AppWindows, Public Screens  und ist nach  dem
"User Interface Style Guide"  programmiert. Desweiteren verf&uuml;gt es  &uuml;ber einen
umfangreichen ARexx-Port, der eigene Erweiterungen bzw.  Schnittstellen zu an-
deren Programmen, z.B. Terminplaner, erm&ouml;glicht.

<BR>Autor:  Jan Gei&szlig;ler
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
AzMake V2.3
</TD><TD>
Eine Arbeitsumgebung f&uuml;r Aztec C. Von AzMake aus k&ouml;nnen  Programme kompiliert,
assembliert, gelinkt  und ausgedruckt  werden. Das  Programm liegt in den Ver-
sionen 1.1a f&uuml;r OS1.3 und V2.3 f&uuml;r OS2.0 vor.

<BR>Autor:  Christian Friedel
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 25c</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
NeTTLiga V1.2
</TD><TD>
Das Programm verwaltet Ligen mit bis  zu 30 Vereinen. Au&szlig;er  den Standartligen
kann NeTTLiga auch  Ligen mit "Unterligen"  verwalten, wie  z.B. die WLAF, NFL
oder  NBA. Neben den normalen  Spieltags- und Tabellenfunktionen gibt  es noch
Spieltagsvorhersage,  Meistertip,  Saisonverlauf, grafische  und amerikanische
Tabelle. Beigef&uuml;gt sind die 1.Bundesliga, beide 2.Ligen und die WLAF der alten
Saison.

<BR>Autor:  Jochen Garcke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
DocPrint V2.0
</TD><TD>
DocPrint kann jeden ASCII-Text, auch solche, die mit  dem Power Packer gepackt
wurden, drucken. Seitenvorsch&uuml;be und  ANSI-Steuerzeichen werden  dabei ber&uuml;ck-
sichtigt. Man kann auf  Endlospapier wie auch auf  Einzelbl&auml;ttern doppelseitig
oder aber auch  einseitig drucken. Die  R&auml;nder und die  Blattgr&ouml;&szlig;e k&ouml;nnen frei
gew&auml;hlt werden.

<BR>Autor:  Hartmut J&auml;ger
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
ITBM V1.02
</TD><TD>
Das Programm konvertiert sowohl IFF - ILBM als auch IFF - ACBM  Grafiken in C-
Quellcode, der mit nahezu jedem C-Entwicklungssystem kompilierbar sein sollte.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
IFF-Arranger V1.02
</TD><TD>
Bietet Ihnen die M&ouml;glichkeit IFF-Dateien derart zu bearbeiten, da&szlig; Sie einfach
Chunks hinzuf&uuml;gen  oder entfernen  k&ouml;nnen. Eine Besonderheit  dieses Programms
ist, da&szlig; File-Requester aus diversen verschiedenen  Libraries unterst&uuml;tzt wer-
den. Ben&ouml;tigt >= OS 2.04

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Reversi V1.0
</TD><TD>
Eine Umsetzung des bekannten Brettspiels. Auf einem 8 X 8 Felder gro&szlig;em Spiel-
feld m&uuml;ssen abwechselnd Steine so plaziert werden, da&szlig;  m&ouml;glichst viele Spiel-
steine des Gegners eingeschlossen werden. Mit dieser Umsetzung k&ouml;nnen entweder
2 menschliche Spieler gegeneinander antreten oder ein Spieler gegen den Amiga.

<BR>Autor:  Robert Brandner
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Kwikbackup V2.0
</TD><TD>
Das Erstellen von Sicherheitskopien  einer Harddisk wird  mit diesem Programm
erleichtert, da es die M&ouml;glichkeit bietet nicht jedesmal die gesamte Harddisk
sichern zu m&uuml;ssen, sondern jeweils nur diejenigen  Dateien, die sich ge&auml;ndert
haben. Ben&ouml;tigt >= OS 2.04 Inklusive Oberon-Source.

<BR>Autor:  Achim Siebert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
SIP V2.15
</TD><TD>
SIP erlaubt  Ihnen  die meisten  der elementaren  System - Strukturen wie z.B.
Tasks, Libraries,  Devices, Ports und  Windows anzusehen  und zu manipulieren.
Es gibt  Ihnen  au&szlig;erdem die  M&ouml;glichkeit, die  meisten wichtigen  Vektoren im
System zu &uuml;berpr&uuml;fen und falls n&ouml;tig  zu l&ouml;schen, um  sicherzustellen, da&szlig; Ihr
System frei von Viren und den ganzen anderen  Plagegeistern ist, die Ihnen das
Leben schwer machen. Ben&ouml;tigt >= OS 2.04.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 26</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
KBlanker V1.0
</TD><TD>
KBlanker ist ein kleines Blanker-Tool, das es Ihnen erlaubt durch Dr&uuml;cken ein-
er Tastenkombination, den Screen dunkel oder wieder hell zu schalten, wann im-
mer Sie es wollen. Ben&ouml;tigt >= OS 2.04

<BR>Autor:  Andreas R. Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
KPlayer V1.80
</TD><TD>
Sicherlich kennen Sie das Musik-Programm MED. KPlayer ist ein Programm, das es
Ihnen erm&ouml;glicht, die St&uuml;cke, die Sie mit MED V3.10 erstellt  haben, abzuspie-
len. Wobei KPlayer viel k&uuml;rzer ist als die mei&szlig;ten anderen Programme, die die-
se Art von Sound-Modulen unterst&uuml;tzen. Inklusive C-Source.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
TicTacToe
</TD><TD>
Ein lernf&auml;higes TicTacToe - Spiel. Sie gegen den Computer, wobei  das Programm
von Spiel zu Spiel besser wird.

<BR>Autor:  Axel Meierh&ouml;fer
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
LQ-Print V2.0
</TD><TD>
Das Programm erstellt Ausdrucke von ASCII-Dateien auf den Epson - Druckern der
LQ-Serie, wobei LQ-Print viele Einstellungsm&ouml;glichkeiten  bietet. Das Programm
ben&ouml;tigt >= OS 2.04 inklusive Oberon-Source.

<BR>Autor:  Achim Siebert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Banner V3.10
</TD><TD>
Das ideale Programm zum Ausdruck von Spruchb&auml;ndern f&uuml;r Geburtstagsparties, als
Werbetext in  Schaufenstern ect. Mit  eigenen, extra  gro&szlig;en Fonts  und vielen
Funktionen.

<BR>Autor:  Axel Meierh&ouml;fer
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
PLW V3.2
</TD><TD>
Der Phone Line Watcher ist ein Programm f&uuml;r Besitzer eines Hayes- Kompatiblen-
Modems. Das Programm protokoliert alle  eingehenden Anrufe mit  Datum, Uhrzeit
und Anzahl der Klingelzeichen. Ein Anrufer kann sich  einloggen und eine Nach-
richt hinterlassen.

<BR>Autor:  Christian Fries
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Rechnung DeLuxe V1.12
</TD><TD>
Ein Programm zum Erstellen, Speichern, &Auml;ndern und Drucken von Rechnungen, Mah-
nungen, Angeboten, Auftragsbest&auml;tigungen, Lieferscheinen ect.

<BR>Autor:  Axel Meierh&ouml;fer
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 27</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Archive-Utility V1.61
</TD><TD>
Wer &ouml;fter mit einem Archivierungsprogramm arbeitet, kennt  das Problem. Zuerst
eine Shell/CLI &ouml;ffnen, dann das Archivierungsprogramm mit den unz&auml;hligen Para-
metern und Pfaden starten. Wer  dann noch die  Pfade nicht mehr wei&szlig;, ist sehr
schnell mit seinen Nerven runter. Wer zus&auml;tzlich noch mehrere  Archive erstel-
len mu&szlig;, ist dann dem Selbstmord nahe. In diese  L&uuml;cke schl&auml;gt Archive-Utility.
Es stellt eine Benutzeroberfl&auml;che f&uuml;r Archivierungsprogramme dar, indem bequem
&uuml;ber Requester und Eingabegadgets  Pfade und Parameter eingestellt werden k&ouml;n-
nen. Dabei wird ein Gro&szlig;teil des Programms mit der Maus gesteuert.

<BR>Autor:  Dieter Tewes
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Fenster V3.2
</TD><TD>
Fenster besch&auml;ftigt sich mit der Intuitions-Oberfl&auml;che  des Amigas. Dabei ver-
einigt  das Programm  eine Vielzahl  kleinerer Hilfsmittel  f&uuml;r Anwender (z.B.
Hardcopy eines Screens) und  Programmierer (z.B.  Bildausschnitte aus `DPaint`
direkt als RAW-Daten speichern).

<BR>Autor:  Roger Fischlin
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Die Mission
</TD><TD>
Als Kapit&auml;n haben Sie die Aufgabe  alle Inseln auf einer  Karte miteinander zu
verbinden. Jedoch darf dabei weder der Spielfeldrand noch die eigene Linie be-
r&uuml;hrt werden. Ist Ihre  Aufgabe erledigt  gelangen Sie in  den n&auml;chsten Level,
wobei sich die Anzahl der  Inseln in jedem Level  um eins erh&ouml;ht. Das Programm
bietet Sound und eine Top-Ten Highscore-Liste. Ben&ouml;tigt 1 MB Speicher.

<BR>Autoren:  Aimo und Reik Winkelmann
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			Inhalt Amiga Szene Diskette 28/29</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Artikel-Datenbank
</TD><TD>
Eine Artikeldatenbank  mit ca. 12000  Eintr&auml;gen, die laufend  &uuml;berarbeitet und
erweitert wird. Erfa&szlig;t sind die  Zeitschriften: 68000er,  Amiga Magazin, Amiga
Magazin Sonderhefte, Amiga DOS,  Amiga Plus, Amiga Special, Amiga Special Son-
derhefte, Amiga Welt, Data Welt, Kickstart, Amiga Publik Domain und PD-B&uuml;cher.
Auf Disk #28 befindet sich das Programm "Datei V3.09a", das zur Verwaltung der
Datenbank dient und die Artikel-Daten 89. Auf Disk #29 befinden sich die Arti-
kel-Daten 90-93.

<BR>Autor:  Henry K&ouml;nig
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 30</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Space Archiv Plus V3.00
</TD><TD>
SPAPlus bietet vielf&auml;ltige Informationen aus der Raumfahrt und verwandten The-
menbereichen  wie z.B. Flugzeuge,  Galaxien,  Kometen, Monde,  Organisationen,
Planeten,  Programme, Projekte,  Raketen, Raumschiffe,  Satelliten, Sterne und
Sternenhaufen. Ben&ouml;tigt >= OS2.04.

<BR>Autor:  Andreas R. Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Beat Stomper II V1.1
</TD><TD>
BSII ist ein Musikprogramm das es erlaubt, 4-stimmig Sound - Samples abzuspie-
len. Es simuliert einen Drumcomputer, ist sehr einfach mit der Maus  zu bedie-
nen und bietet viele M&ouml;glichkeiten.

<BR>Autor:  Harald Westphal
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
KVOC V1.00
</TD><TD>
Das Programm gibt Ihnen die  M&ouml;glichkeit, auf  einfache Art  und Weise PC VOC-
Sample-Dateien (V1.10) abzuspielen. Au&szlig;erdem k&ouml;nnen VOC - Files in IFF - 8SVX-
Sample-Dateien konvertiert werden.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			Inhalt Amiga Szene Diskette 31a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
ACK
</TD><TD>
Adventure - Construction - Kit ist in erster Linie  ein Rollenspiel f&uuml;r bis zu
f&uuml;nf Spieler. Im Gegensatz  zu anderen Spielen  dieser Art ist man hier aller-
dings nicht auf ein Abenteuer festgelegt, sondern  kann sich mit dem eingebau-
ten Editor eigene Abenteuer zusammenstellen. Das Programm hat au&szlig;erdem folgen-
de Besonderheiten: man kann eigene Monster entwerfen; man kann eigene Grafiken
benutzen; Gespr&auml;che  mit Monstern sind m&ouml;glich; ein recht ausgefallenes Magie-
system. Zwei  fertige  Abenteuer  namens "Schattenforst" und "Orkangriff" sind
bereits enthalten.

<BR>Autor:  Robert M&uuml;ller
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Askalon - Wettlauf um die K&ouml;nigsw&uuml;rde
</TD><TD>
Man &uuml;bernimmt im Jahre 483 n. Chr. die Rolle eines einfachen  Bauern in Trans-
nirwanien. Dieser  mu&szlig; nun versuchen,  durch  geschicktes  Wirtschaften in der
sozialen Skala  bis zum K&ouml;nig  aufzusteigen. Im Gegensatz zu &auml;hnlichen Spielen
wurde etwas mehr Wert darauf  gelegt, die Zeitr&auml;ume zu  veranschaulichen. Wenn
eine  gewisse Zeit  vergangen ist, stirbt der Spieler und sein  Sohn &uuml;bernimmt
das Ruder. Es dauert mindestens 120 Jahre, bis man  es schaffen kann zum K&ouml;nig
aufzusteigen, in der Regel jedoch wesentlich l&auml;nger. Trotz  aller R&uuml;ckschl&auml;ge,
die einem immer  wieder passieren, man  kann es schaffen. In der  vorliegenden
Demoversion ist die  Mitspieleranzahl auf einen  begrentz. In der Vollversion,
die  beim Autor  erh&auml;ltlich ist, k&ouml;nnen bis zu 5 Leute  mitspielen. Diese Ver-
sion wurde  noch einmal  &uuml;berarbeitet und d&uuml;rfte nun auf allen  Amigas laufen.

<BR>Autor:  Roland Richter
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 32a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Das Fest
</TD><TD>
Du wolltest Deine Ferien auf einem  kleinen Segelboot  verbringen, um mal v&ouml;l-
lig  auszuspannen. Nach einem  Unwetter landest  Du als Gestrandeter  an einem
einsamen langen Sandstrand  und hier beginnt nun Dein Abenteuer.  Das Fest ist
ein sehr gut gemachtes deutsches  Textadventure mit vielen  Grafiken und einer
Action-Sequence. Inklusive C-Source.

<BR>Autor:  Steffen Goebbels
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Monopoli                                                             (Neu 4/94)
</TD><TD>
Eine Amiga - Umsetzung des Spiels Monopoly f&uuml;r 1 bis 4 Spieler. Wobei die feh-
lenden Mitspieler durch den Amiga ersetzt werden. Au&szlig;erdem kann der Spielstand
abgespeichert und wieder geladen werden, so da&szlig; ein begonnenes Spiel abgespei-
chert und zu einem sp&auml;teren Zeitpunkt fortgesetzt werden kann.

<BR>Autor:  Markus Junginger
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Create V1.0
</TD><TD>
Create ist ein CLI-Befehl, der es erm&ouml;glicht eine Datei zu  &ouml;ffnen und mehrere
Bytes als direkte  Zahlenangabe zu jener  zu senden. Man kann auch nur die Da-
tenrichtung  angeben, um  so z.B.  Steuercodes von  der Shell  aus direkt  zum
Drucker zu schicken. Inklusive Assembler-Source.

<BR>Autor:  Michael Gottwald
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
ListPorts V1.0
</TD><TD>
ListPorts ist ein CLI-Befehl, der dazu  dient alle `offiziellen` Message-Ports
aufzulisten.  In dieser Version  werden nur die  Namen der gefundenen Message-
Ports ausgegeben. Inklusive Assembler-Source.

<BR>Autor:  Michael Gottwald
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Statistik V1.0
</TD><TD>
Die statistische Erfassung von  Daten ist heutzutage in der  Industrie infolge
von  Qualit&auml;tssicherung fast  unumg&auml;nglich. Es werden  Kontrolldaten, wie z.B.
Me&szlig;werte, erfa&szlig;t und statistisch  ausgewertet. F&uuml;r die Kennwerte  dieser Daten
ist dieses Programm ausgelegt. Da das Programm in BASIC geschrieben wurde, ist
der AmigaBASIC-Interpreter erforderlich.

<BR>Autor:  Michael Gottwald
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 33a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
MuchMore V4.1                                                     (Update 2/94)
</TD><TD>
MuchMore ist ein Programm, das &auml;hnlich wie MORE, LESS etc. ASCII-Files auf dem
Bildschirm ausgibt. MuchMore &ouml;ffnet im Gegensatz zu  anderen Programmen jedoch
einen eigenen Screen und gibt den Text dort aus. Der Text wird von unten weich
in den  Screen gescrollt. Wer will  kann mit  MuchMore jedoch  auch unheimlich
schnell scrollen. Zus&auml;tzlich gibt es noch eine Such - und eine Print-Funktion.
MuchMore pa&szlig;t  sich an die Grafikaufl&ouml;sung des Amigas an, auf dem es gestartet
wurde. So l&auml;uft MuchMore auf NTSC, PAL, Overscan und wohl auch auf zuk&uuml;nftigen
Amigas. Inclusive Oberon-Source.

<BR>Autoren:  Fridtjof Siebert/Christian Stiens
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Intro Maker V1.6
</TD><TD>
Mit dem Intro Maker k&ouml;nnen Sie eigene Intros erstellen, die  w&auml;hrend des Boot-
vorgangs geladen werden. Das  Programm zeichnet sich  durch seine enorme Leis-
tungsf&auml;higkeit aus. So werden IFF-Bilder, IFF-8SVX Sample und  Colorfonts ver-
arbeitet. Zus&auml;tzlich sind noch  einige Utilities  enthalten, die das Erstellen
von Intros erleichtern.

<BR>Autor:  Eric Hambuch
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
AppIff V1.0
</TD><TD>
AppIff ist ein  neues IFF-Bildanzeigeprogramm. Neu an AppIff ist, da&szlig;  ein Ap-
plication-Icon auf die Workbench gelegt  wird, auf das man ein  Bild-Icon ein-
fach nur ziehen und loslassen  mu&szlig; und das Bild wird geladen. Das Programm be-
n&ouml;tigt OS >= 2.04.

<BR>Autor:  Eric Hambuch
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
FontTool
</TD><TD>
Ein Tool, mit dem es  m&ouml;glich ist, Ungereimtheiten zwischen den Font - Dateien
und den tats&auml;chlich vorhandenen Schriftgr&ouml;&szlig;en im Fonts - Ordner zu beseitigen.
Inklusive GFA-Basic-Source.

<BR>Autor:  Jan Saucke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Magic Square
</TD><TD>
Magic Square ist ein  Verschiebe-Puzzle mit vier  unterschiedlichen Schwierig-
keitsgraden. 4 x 4 = 15 Felder, 5 x 5 = 24 Felder, 6 x 6 = 35 Felder und 7 x 7
= 48 Felder. Inklusive GFA-Basic-Source.

<BR>Autor:  Jan Saucke
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 34</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Databench V2.39b
</TD><TD>
Sie ben&ouml;tigen eine komfortable Datenbank, z.B. eine  Clubverwaltung und wollen
64 Datenfelder mit sieben verschiedenen Typen (u.a. 256 Zeichen, Formeln, IFF-
Bilder etc.);  OS 2.0 Support, trotzdem  unter 1.3 lauff&auml;hig;  ARexx-Interface
mit &uuml;ber 25 Befehlen; hyperschnelle Such- u. Sortieralgorithmen (Sortieren von
1000 Werten: 1 Sekunde, Suchen eines Wertes aus 1000: 1 Sekunde); umfangreiche
Filterm&ouml;glichkeiten;  komfortable Ausgabe- u. Serienbrieffunktionen; verarbei-
tet &uuml;ber 500 Millionen Datens&auml;tze; zahlreiche Utilities, z.B. einen Texteditor
zum Schnellen Erstellen von Serienbriefe, einen Maskeneditor u.v.m. Import/Ex-
port von anderen  Datenbanken, jederzeit  erweiterbar; Etikettendruckfunktion;
f&uuml;nf  Dateien gleichzeitig im  Speicher; Passwortschutz und  vieles mehr, dann
ist Databench genau  das Richtige f&uuml;r Sie. Die vorliegende  Demoversion ist in
einigen Punkte eingeschr&auml;nkt.

<BR>Autor:  Eric Hambuch
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Bilder
</TD><TD>
3 Monochrombilder gezeichnet von  Michael Gottwald.     "Deutschland" (640 x
512) -
die Konturen von Deutschland. "Olympus Mons" (640 x 700) - Ein Gr&ouml;&szlig;envergleich
des Marsvulkans Olympus Mons mit der Fl&auml;che  Deutschlands, sowie ein H&ouml;henver-
gleich mit dem Mount Everest. "Busfahrt nach..." (640 x 512) - Kann als Grafik
f&uuml;r Ausfl&uuml;ge mit dem Bus verwendet werden.
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
HDClick V2.52
</TD><TD>
HDClick ist ein Programmselector/HD-Menue mit dem schnell und einfach Program-
me durch Anklicken  gestartet werden k&ouml;nnen. Je nach Wahl wird ein Screen oder
ein kleines Fenster auf der Workbench ge&ouml;ffnet. HDClick enth&auml;lt auch eine App-
Icon- und AppWindow-Funktion, mit welchen  komfortabel z.B. Bilder angeschaut,
Texte gelesen oder Dateien entpackt werden k&ouml;nnen, indem Icons auf das AppIcon
/AppWindow gezogen werden. Ben&ouml;tigt OS >= 2.04.

<BR>Autor:  Claude M&uuml;ller
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
GRFPlot V1.0
</TD><TD>
GRFPlot ist ein Funktionsplotter f&uuml;r ganzrationale  Funktionen bis zum 9. Grad
GRFPlot f&uuml;hrt eine automatische Kurvendiskussion durch und zeichnet auf Wunsch
den Funktionsgraphen. F&uuml;r Sch&uuml;ler der 11. Klasse  wird dieses Programm sicher-
lich eine gro&szlig;e Hilfe sein.

<BR>Autor:  Eric Hambuch
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Crazy Triangel
</TD><TD>
Ein Puzzlespiel, neun Karten mit verschiedenfarbigen Teilen von Dreiecken m&uuml;s-
sen so  gelegt werden, da&szlig;  sich die Dreiecke  form- und farbrichtig erg&auml;nzen.
Die neun Karten ergeben bei richtiger L&ouml;sung ein Quadrat. Inklusive GFA-Basic-
Source.

<BR>Autor:  Jan Saucke
</TD>

	    </TR><TR>
		<TD VALIGN="TOP">
KugelEd V1.0
</TD><TD>
Ein  Videoscape-Objekt-Editor  zur Erstellung von  kugelf&ouml;rmigen Objekten. Als
Beispiel ist eine  Weltkarte beigef&uuml;gt mit  der eine Weltkugel  erzeugt werden
kann. Inklusive GFA-Basic-Source.

<BR>Autor:  Jan Saucke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
FlatEd V1.0
</TD><TD>
Ein  Videoscape-Objekt-Editor zur  einfachen Erstellung von  Objekten gleicher
Dicke wie z.B. 3D-Schriften. Inklusive GFA-Basic-Source.

<BR>Autor:  Jan Saucke
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 35</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Gravitation V1.0
</TD><TD>
Ein Spiel f&uuml;r zwei Personen, die versuchen  m&uuml;ssen sich gegenseitig abzuschie-
&szlig;en. Damit  es nicht zu einfach wird, werden  die Sch&uuml;sse durch Planeten abge-
lenkt.

<BR>Autor:  Jan Saucke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
CodeMaster
</TD><TD>
Hier gilt es, in maximal 14 Versuchen einen Farbcode zu erraten. Der Code kann
4-, 5- oder 6 farbig aus 6, 8 oder 10 m&ouml;glichen Farben sein. Inklusive GFA-Ba-
sic-Source.

<BR>Autor:  Jan Saucke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Clock V2.0
</TD><TD>
Clock ist ein Uhrenprogramm, das sich  sowohl vom CLI, als auch  von der Work-
bench starten l&auml;&szlig;t. Als besondere Features sind aufzuf&uuml;hren: die Uhr erscheint
immer auf dem vordersten Screen; 4 Alarmzeiten speicherbar, bei denen dann ein
Programm gestartet werden kann und vieles mehr.

<BR>Autor:  Bernd Grunwald
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
ARTM V1.7
</TD><TD>
Amiga Real Time Monitor  gibt Aufschlu&szlig;  &uuml;ber viele  Aktivit&auml;ten im Amiga, ist
voll intuition-gesteuert im WB2.0 Look und sehr leicht zu bedienen.

<BR>Autoren:  Dietmar Jansen/F.J. Mertens
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Cursor V1.7
</TD><TD>
Cursor &uuml;bersetzt BASIC-Programme, die f&uuml;r den AmigaBASIC-Interpreter geschrie-
ben wurden, in allein lauff&auml;hige Programme, die vom CLI oder von der Workbench
aus gestartet werden  k&ouml;nnen und schneller sind, als  wenn sie vom Interpreter
aus ablaufen. Einige Beispielprogramme sind enthalten.

<BR>Autor:  J&uuml;rgen Forster
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 36a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
TestBild
</TD><TD>
Eine Lo-Res Grafik von  Jan Saucke,     die ein Fernseh-Testbild simmuliert.
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Trace
</TD><TD>
Ein Geschicklichkeitsspiel nach dem  Tron-Prinzip f&uuml;r 2 Spieler. Die Spurbrei-
te und die Geschwindigkeit kann frei eingestellt werden.  Au&szlig;erdem ist ein 1 -
Spieler Mode zum &uuml;ben vorhanden. Inklusive GFA-Basic Source.

<BR>Autor:  Jan Saucke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
FrontEddi V2.01
</TD><TD>
FrontEddi ist ein Interface, das  einen ASL-Requester  &ouml;ffnet und das Ergebnis
dieser Aktion als den ersten  Parameter f&uuml;r den Aufruf eines anderen Programms
(z.B. eines TextEditors,  daher "FrontEddi")  verwendet. Somit kann fast jedes
Programm mit einem Requester versehen werden. Ben&ouml;tigt OS>=2.04.

<BR>Autor:  Andreas R. Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Magic Menu V1.29                                                  (Update 5/94)
</TD><TD>
Das Programm  ersetzt alle  Intuition - Men&uuml;s durch Magic Menu, so kommen alle
Programme, die die standard System-Men&uuml;s verwenden, in den Genu&szlig; der Magic Me-
nu Features. Es  werden sowohl Pull-Down  Men&uuml;s wie  auch Pop-Up  Men&uuml;s unter-
st&uuml;tzt. Die  Darstellung der Men&uuml;s erfolgt entweder im konventionellen Standa-
rd-Look oder im modernen  3D-Look. Die Men&uuml;s k&ouml;nnen auch  vollst&auml;ndig &uuml;ber die
Tastatur gesteuert werden. Au&szlig;erdem kann Magic Menu auf vielf&auml;ltige Art konfi-
guriert werden, so k&ouml;nnen Bedienung und das Erscheinungsbild von Pull-Down und
Pop-Up Men&uuml;s getrennt eingestellt werden. Ben&ouml;tigt OS>=2.04.

<BR>Autor:  Martin Kornd&ouml;rfer
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Video Titler V1.1
</TD><TD>
Video Titler ist ein einfaches  Programm, mit dem man  professionelle Videoab-
spanne herstellen kann. Es erm&ouml;glicht auf  einem 736 * 560 Pixel gro&szlig;en Screen
beliebige Schriften (auch Colorfonts) in vier Geschwindigkeiten von unten nach
oben zu scrollen. Die vorliegende Demoversion ist identisch mit der Vollversi-
on, hat aber eine Einschr&auml;nkung, jede zweite Zeile lautet "DEMOVERSION".

<BR>Autor:  Andreas Ackermann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
LeftyMouse V1.06
</TD><TD>
Ein kleines Utility, das die linke und rechte Taste  der Maus vertauscht. Dies
soll Linksh&auml;ndern, die die  Maus mit der linken  Hand bedienen, helfen. Inklu-
sive C-Source. Ben&ouml;tigt OS>=2.04.

<BR>Autor:  Stefan Sticht
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 37c</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
World Address V1.06                                                  (Neu 6/94)
</TD><TD>
Eine komfortable Adress-Datenbank mit variabler Feld-Belegung, so da&szlig; auch die
Eingabe komplizierterer z.B. ausl&auml;ndischer Adressen kein Problem mehr darstel-
len. Aufgrund der Flexibilit&auml;t der  Eingabem&ouml;glichkeiten ist es nicht nur m&ouml;g-
lich, Adressen zu  verwalten, sondern auch  viele &auml;hnlich  strukturierte Daten
einzugeben wie z.B. Videos, B&uuml;cher ect. Weiterhin k&ouml;nnen mit World Address Se-
rienbriefe und Briefumschl&auml;ge beliebiger Gr&ouml;&szlig;e, gedruckt  werden, wobei Bilder
und Kommentare mit eingebunden werden k&ouml;nnen.

<BR>Autor:  Maik Schmidt
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Das Ostereier-Suchen Spiel
</TD><TD>
Ziel des Spiels ist es, in einem Haus versteckte  Eier zu finden. Diese werden
wahlweise vom Computer oder einem Spielleiter in neun R&auml;umen auf zwei Geschos-
sen eines Hauses versteckt. Anschlie&szlig;end k&ouml;nnen bis zu zehn Spieler nacheinan-
der auf die Suche  gehen. Damit die Aufgabe nicht zu  einfach ist, lassen sich
alle T&uuml;ren des Geb&auml;udes verschlie&szlig;en. In ein  Schlo&szlig; pa&szlig;t aber nur ein Schl&uuml;s-
sel, der die gleiche  Farbe wie die  zugeh&ouml;rige T&uuml;r  hat. Die Schl&uuml;ssel k&ouml;nnen
ihrerseits  wieder auf die R&auml;ume des Hauses verteilt sein. Daneben ist es m&ouml;g-
lich, Zimmer besonders zu  sichern. In einem solchen Fall mu&szlig; erst ein kleines
Spielchen  gel&ouml;st werden, bevor der Inhalt eines Raums zug&auml;nglich wird. Inklu-
sive C-Source.

<BR>Autor:  Steffen J. Goebbels
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 38</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
AmigaBase V1.31
</TD><TD>
AmigaBase ist eine hierarchische programmierbare  Datenbank. Dennoch, oder ge-
rade deshalb, eignet sich AmigaBase hervorragend zur  Verwaltung von Musikkas-
setten,  Videob&auml;ndern, Adressen, ect. Aber auch kompliziertere Anwendungen wie
z. B. Buchhaltung mit automatischem &Uuml;berweisungsausdruck und Schreiben von Re-
chnungen bereitet  AmigaBase keine Probleme. Einige  Demo-Dateien sind bereits
im Programmpaket enthalten.

<BR>Autor:  Steffen Gutmann
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 39b</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Next V1.4                                                         (Update 4/94)
</TD><TD>
Next ist ein Textanzeiger &auml;hnlich PPMore, MuchMore oder More  und verf&uuml;gt &uuml;ber
die Standardfunktionen, die man von  diesen  Programmen bereits kennt. Dar&uuml;ber
hinaus hat Next noch einige Eigenschaften, sprich Vorz&uuml;ge, die nicht so selbst
verst&auml;ndlich sind, jedenfalls nicht in dieser Kombination.

<BR>Autor:  J&uuml;rgen Klawitter
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
PAL-Check
</TD><TD>
Durch einen Fehler im  Betriebssystem 1.2 und 1.3  kommt es beim  Booten gele-
gendlich  vor, da&szlig; der NTSC - Modus eingeschaltet  wird. PAL - Check &uuml;berpr&uuml;ft
schon w&auml;hrend des Bootvorgangs die  Gr&ouml;&szlig;e des Workbench - Screens und gibt bei
ermitteltem NTSC-Modus eine entsprechende Meldung per Requester aus.

<BR>Autor:  Thomas G&uuml;nther
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
RESET
</TD><TD>
Dieses kleine Programm macht nichts anderes als ein RESET auszul&ouml;sen. Benutzen
Sie es, wenn Ihnen der "Affengriff" mit  dem Sie den Amiga bisher zur&uuml;cksetzen
schon zum Halse  heraush&auml;ngt, oder wenn  Sie aus einer Batchdatei  heraus ein
kontrolliertes RESET ausf&uuml;hren m&ouml;chten.

<BR>Autor:  Thomas G&uuml;nther
</TD>

	    </TR><TR>
		<TD VALIGN="TOP">
WaitClick
</TD><TD>
Das Programm dient der Abfrage der Maustasten vom CLI bzw. der Shell aus.

<BR>Autor:  Thomas G&uuml;nther
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
ReportButton
</TD><TD>
Dieses kleine Utility  &auml;hnelt dem Programm  "WaitClick". Es  wartet allerdings
nicht auf den Druck einer definierten Maustaste, sondern gibt einen Fehlercode
zur&uuml;ck, wenn  die falsche Maustaste  gedr&uuml;ckt wurde. Das  Programm eignet sich
somit hervorragend f&uuml;r die Abfrage der Maustasten von einer Batchdatei aus.

<BR>Autor:  Thomas G&uuml;nther
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Autoschlange V1.5c
</TD><TD>
Ziel dieses  Spieles ist es,  soviele  Nummernschilder  der BR Deutschland wie
m&ouml;glich zu erraten. Die  Bewertung erfolgt durch  ein einfaches  Punktesystem.
Die Besten k&ouml;nnen sich in die Highscore eintragen.

<BR>Autor:  Meik Woyke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">Imbiss III V1.2
</TD><TD>
In diesem Spiel geht es darum, als Besitzer  einer Imbissbude aus einem Start-
kapital von 10.- DM m&ouml;glichst viel Geld  zu machen. Durch geschickte Lagerhal-
tung und  Preisgestaltung ist das  Startkapital  zu erh&ouml;hen. Die 20 Besten Im-
bissbuden-Besitzer k&ouml;nnen sich in die Highscore eintragen.

<BR>Autor:  Oliver Schwald
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Light Cycle V1.1
</TD><TD>
In diesem Spiel k&ouml;nnen bis  zu 10 Spieler gegeneinander in  einem Tournier an-
treten. Das Ziel des Spiels ist es,  mit seinem Gef&auml;hrt l&auml;nger  als der Gegner
durchzuhalten. Dazu wird jeder Spieler durch einen  farblichen Strich, welcher
sich immer in der Joystickrichtung  bewegt, dargestellt. Der Strich darf dabei
nicht den Bildschirmrand, die  eigene Spur oder die gegnerische Spur ber&uuml;hren.
F&uuml;r 2-10 Spieler, zwei Joysticks erforderlich.

<BR>Autor:  Oliver Schwald
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Oktopus V4.1c
</TD><TD>
Dieses Programm ist ein  Maus- und  Grafikorientiertes  Men&uuml;programm f&uuml;r Fest-
plattenbesitzer (es  l&auml;uft aber auch  auf Disketten). Das Programm  &ouml;ffnet ein
Fenster auf der Workbench mit 9 Schaltern. Jeder dieser Schalter  kann mit bis
zu 20 Programmen belegt  werden,  welche auf  einen Mausklick gestartet werden
k&ouml;nnen.

<BR>Autor:  Dirk Buschek
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 40c</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
DaVinci V9.01c
</TD><TD>
Ein fantastisches Malprogramm mit einer 3D - Benutzeroberfl&auml;che des OS2.0. Das
Programm bietet eine Vielzahl an Funktionen, so  k&ouml;nnen z.B. IFF-Bilder in je-
der Aufl&ouml;sung geladen werden. Bilder  k&ouml;nnen in verschiedenen Aufl&ouml;sungen aus-
gedruckt  werden. F&uuml;r Texteingaben  k&ouml;nnen  verschiedene  Zeichens&auml;tze geladen
werden. Bildausschnitte k&ouml;nnen um 90&#176; gedreht und in der Mitte gespiegelt wer-
den. Nat&uuml;rlich sind auch  alle Standardfunktionen (und einige mehr) vorhanden,
die man von einem Malprogramm erwartet.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
DBInstaller V1.1c
</TD><TD>
Dieses  Programm soll  es erm&ouml;glichen, allen  Programmen  eine einheitliche In
stallationsroutine zu geben. M&ouml;chte zum Beispiel ein Programmierer sein Anwen-
dungsprogramm mit  einem Installationsprogramm  ausliefern, so braucht  er nun
nicht mehr ein eigenes zu schreiben, er kann dieses Programm dazu benutzen.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
DiskArchiv V1.21                                                  (Update 7/94)
</TD><TD>
Ein Programm  zur Verwaltung Ihrer  Diskettensammlung. Durch den  riesigen PD-
Markt f&uuml;r  den Amiga ergibt sich bei fast jedem User mit der Zeit eine ansehn-
liche  Diskettensammlung, die leicht  un&uuml;berschaubar wird. Fr&uuml;her oder  sp&auml;ter
wird ein  bestimmtes Programm gesucht, von dem man  zwar wei&szlig;, da&szlig; es irgendwo
auf  einer der  vielen Disketten  vorhanden ist, aber  wo genau...?  Hier soll
DiskArchiv Abhilfe  schaffen. Sie k&ouml;nnen alle Disketteninhalte bequem einlesen
und mit einem Kommentar  versehen in einer Datenbank verwalten. Ben&ouml;tigt OS >=
2.04, 2 Diskettenlaufwerke und 1 MB RAM.

<BR>Autoren:  Michael K&ouml;pke und Rolf Herrmann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Mania V1.01
</TD><TD>
Mania ist eine weitere  Umsetzung des Spiels  `Superhirn` oder  `Master Mind`.
Ziel des Spiels ist es, eine Farbkombination, die vorher vom Computer zuf&auml;llig
ermittelt  wurde, zu erraten. Zus&auml;tzlich  bietet das Programm  die M&ouml;glichkeit
die Anzahl der  Farben und die  Anzahl der m&ouml;glichen Versuche selbst festzule-
gen.

<BR>Autor:  Christian Mrugalla
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 41</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Top Timer V1.02
</TD><TD>
Vergessen Sie auch schon mal einen wichtigen Termin ? Dann ist dieses Programm
genau das richtige f&uuml;r Sie, denn Top-Timer  ist ein Terminkalender, in den Sie
Ihre  Termine eintragen  k&ouml;nnen.  Das Programm  zeigt Ihnen dann  die t&auml;glichen
Termine an, oder erinnert Sie durch ein Alarmsignal.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Muncher
</TD><TD>
Neuartiges Strategie- und Taktikspiel. Der Muncher bewegt sich  wie der Sprin-
ger beim Schach &uuml;ber ein Spielfeld und mu&szlig; dabei alle auftauchenden Viren ver-
nichten. F&uuml;r unterhaltsame Gr&uuml;belstunden.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Passwort V1.2c
</TD><TD>
Das Programm  dient dazu die Harddisk  vor unberechtigtem  Zugang zu sch&uuml;tzen.
Bei einem unberechtigten Zugriffsversuch speichert das Programm ein File im S-
Verzeichnis und sperrt das System.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Hybris V1.3
</TD><TD>
Hybris ist ein weiterer Tetris - Clone. Allerdings bietet das Spiel eine Viel-
falt an Funktionen, die Sie bei anderen Tetris - Varianten wohl vergeblich su-
chen. So gibt es z.B. einen Zwei-Spieler-Modus, bei dem  beide Spieler gleich-
zeitig im selben Spielfeld spielen. Die  Spielfeldgr&ouml;&szlig;e kann in weiten Grenzen
selbst bestimmt werden und die  Geschwindigkeit der herabfallenden Steine kann
eingestellt werden. Au&szlig;erdem gibt es nicht nur Spielsteine  aus vier Quadraten
sondern auch aus einem, zwei, drei und f&uuml;nf, dabei kann der Spieler selber be-
stimmen welche  Steine vorkommen sollen und auch ungef&auml;hr wie oft. Ben&ouml;tigt OS
>= 2.0, inklusive C-Source.

<BR>Autor:  Arnold Schommer
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Damned
</TD><TD>
Damned ist ein Denkspiel, das das Ged&auml;chnis trainieren und eventuell erweitern
soll. Auf einem Spielbrett mit 100 Feldern m&uuml;ssen Sie sich die fehlenden Spiel
steine merken. Nach sp&auml;testens 30 Sekunden wird das Spielbrett mit den fehlen-
den Steinen aufgef&uuml;llt. Ihre  Aufgabe besteht nun darin, in einer Zeitbegrenz-
ung den &uuml;rspr&uuml;nglichen Zustand wieder herzustellen.

<BR>Autor:  Volker Stepprath
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 42</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Energie Manager
</TD><TD>
Ihre Aufgabe  ist es, eine gro&szlig;e  und florierende  Restaurantkette aufzubauen.
Hierbei m&uuml;ssen Sie alle Aufgaben bew&auml;ltigen, die t&auml;glich auf  den Manager ein-
es Restaurants  zukommen. Nat&uuml;rlich  kann man in der  heutigen Zeit seine Ent-
scheidungen nicht mehr  nur nach wirtschaftlichen Aspekten f&auml;llen, sondern man
mu&szlig; vor allem  auch die Auswirkungen auf die Umwelt beachten. Oft ist es sogar
so, da&szlig; umweltfreundliches  Handeln auch  wirtschaftliche  Vorteile bringt, da
man z.B. geringere  Energie- und Wasserkosten hat. Zus&auml;tzlich k&ouml;nnen Sie hoch-
dotierte Energiesparpreise  gewinnen, die jedes Jahr vergeben werden. Mit die-
sen Preisen wird das am umweltfreundlichsten und vorbildlichsten gef&uuml;hrte Res-
taurant jeder  Stadt pr&auml;miert. Das Ziel des Spieles ist es, insgesamt zwanzig
Energiesparpreise in mindestens 5 St&auml;dten zu gewinnen!

Herausgeber:  Bundesminesterium f&uuml;r Wirtschaft
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 43</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Papier Schere Stein
</TD><TD>
Ein lernf&auml;higes Spiel,  das nach ca. 20 Spielen  schwer zu schlagen ist, da es
versucht den  menschlichen Gegenspieler  zu berechnen. Das  hei&szlig;t, es versucht
ein  Muster  in der  Spielweise  des Spielers zu  entdecken und  daraufhin den
n&auml;chsten Spielzug vorauszusagen.

<BR>Autor:  Dirk Buschek
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
KFracPlus V3.50
</TD><TD>
Ein Programm  zur Berechnung von  Fraktalen. In dieser  Version  haben Sie die
M&ouml;glichkeit folgende Arten von Fraktalen zu berechnen: Feigenbaum, Julia-Menge
und Mandelbrot-Menge. Das Programm liegt in einer 68000er-, 68020er und 68030
er-Version vor und ben&ouml;tigt OS >= 2.04.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Colorix
</TD><TD>
Colorix  ist ein  Strategiespiel. Die Aufgabe  des Spielers liegt  darin, eine
vorgegebene  Anordnung von farbigen  Kugeln auf einem  Spielfeld zu erstellen.
Das Ganze l&auml;uft nat&uuml;rlich nicht ohne den Druck eines Zeitlimits ab.

<BR>Autor:  Volker Stepprath
</TD>

	    </TR><TR>
		<TD VALIGN="TOP">
Terminal Fonts
</TD><TD>
Diese  Fonts von  Gerhard Radatz     sind  f&uuml;r  hochaufl&ouml;sende  Bildschirme
gedacht und haben eine fixe Breite wie der topaz.font.
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 44</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Das Telekommando kehrt zur&uuml;ck!
</TD><TD>
S.T.&Ouml;.R., die skrupellose  Organisation der Kommunikationsgegner, schl&auml;gt wie-
der zu. Sie bedroht  die Kommunikation der Stiftung Umwelt 2000 - und der Aus-
fall h&auml;tte katastrophale Folgen. Keiner au&szlig;er Dir kann helfen. Du bist das Te-
lekommando  und installierst  Satellitenanlagen, stellst  Verbindungen her und
schmugelst  Dich bei S.T.&Ouml;.R. ein. Jetzt  mu&szlig;t Du  zeigen, was  Du drauf hast.
Rette die Stiftung Umwelt 2000! Das Spiel ben&ouml;tigt mindestens 1 MB Speicher.

Herausgeber:  Telekom
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 45d</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
SuperView.library V6.1                                            (Update 6/94)
</TD><TD>
Die superview.library bietet ab OS 2.04 die  M&ouml;glichkeit auf  diverse Bildfor-
mate objektorientiert zuzugreifen und diese, den Bed&uuml;rfnissen von Bildanzeige-
programmen entsprechend, auf einem ad&auml;quaten Screen anzuzeigen. Derzeit stehen
hierf&uuml;r die Formate IFF-ILBM, IFF-ACBM, GIF, PCX, SVO, BMP, FBM, C64, IMG, WPG
TIFF,MAC und JPEG in Form von externen SuperView Objekten (SVObjects) zur Ver-
Verf&uuml;gung. Diese  befinden sich in "libs/svobjects" und werden automatisch er-
kannt und bei  Bedarf ge&ouml;ffnet. Auf diese  Art wird Speicherplatz  gespart und
jeder kann die F&auml;higkeiten  des Viewerprogramms (z.B. SuperView) selbst  durch
Hinzuf&uuml;gen oder Entfernen  von SVObjects  erweitern oder  reduzieren.  Mit den
beigef&uuml;gten Programierunterlagen ist au&szlig;erdem die Programmierung eigener SVOb-
jects oder die Nutzung von eigenen Programmen aus m&ouml;glich.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Mausweg V 1.21
</TD><TD>
Mausweg ist ein Commodity, das den Mauspfeil  verschwinden l&auml;&szlig;t, wenn die Maus
eine bestimmte  Zeit nicht mehr bewegt  wurde oder wenn eine  bestimmte Anzahl
von Tasten der Tastatur gedr&uuml;ckt wurde. Der Pfeil erscheint wieder, sobald Sie
die Maus bewegen. Damit soll  verhindert werden, da&szlig; der Mauspfeil Informatio-
nen verdeckt. Das Programm ben&ouml;tigt OS>=2.04.

<BR>Autor:  Stefan Sticht
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 46</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Backstage
</TD><TD>
Ein internationaler Rock-Superstar ist in der Stadt und Du mu&szlig;t versuchen, als
Erster die  L&ouml;sungen f&uuml;r einen Wettbewerb, den ein  ortsans&auml;ssiger Radiosender
veranstaltet  zu finden. Wenn  Du es schaffen  solltest, darfst Du  mit Deinem
Lieblingsstar essen gehen und erh&auml;ltst sogar Backstagekarten f&uuml;r seinen n&auml;chs-
ten Livegig, damit Du ihn mal so richtig hautnah erleben kannst.

Herausgeber:  LIVECLUB
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 47a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Anim Paint V2.01
</TD><TD>
Ein Malprogramm  mit einigen besonderen Funktionen. So k&ouml;nnen z.B. die einzel-
nen Malschritte aufgezeichnet und anschlie&szlig;end als kleine Animation abgespielt
werden.

<BR>Autor:  Horst Wiegmann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Dart V0.8                                                            (Neu 4/94)
</TD><TD>
Dart ist ein Programm, das Ihnen die Rechnerei  beim Dart spielen abnimmt, da-
mit Sie sich, wie beim Dart-Automaten, voll und ganz auf das eigendliche Spiel
konzentrieren  k&ouml;nnen. Dart ist so  bedienerfreundlich wie  m&ouml;glich gestaltet,
damit die Bedienung einfach und schnell zu erlernen ist. Es werden bis zu acht
Spieler verwaltet. Der Ligamodus erlaubt Langzeitwertung und  erstellt automa-
tisch Tabellen.

<BR>Autor:  Markus Junginger
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
BootPic V2.1
</TD><TD>
BootPic erlaubt es Ihnen, anstelle der Workbench - Hand, die nach  jedem Reset
erscheint, ein beliebiges IFF - ILBM Bild  zu installieren.  Jetzt ist es auch
m&ouml;glich, zus&auml;tzlich ein MED-Modul  zu installieren, das  abgespielt wird, w&auml;h-
rend das Bild angezeigt wird.

<BR>Autor:  Andreas Ackermann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
APP V1.0
</TD><TD>
Der Anim Paint Player ist ein Abspielprogramm, f&uuml;r die mit Anim Paint erstell-
te Animationen, f&uuml;r das C-Verzeichnis.

<BR>Autor:  Horst Wiegmann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
JM Test V1.01                                                        (Neu 4/94)
</TD><TD>
JM Test ist die Abk&uuml;rzung f&uuml;r Joystick- und Mousetest. Wie bereits aus dem Na-
men zu entnehmen, dient das Programm zum Testen der Mouse oder  des Joysticks.
Das Programm ist eine kleine Hilfe f&uuml;r Leute, die  einen Joystick nach dem an-
deren durch wildes Spielen &uuml;ber den Jordan bringen. Man kann  auf einfache Art
und Weise pr&uuml;fen, ob  der Joystick noch was  hergibt, das gleiche gilt f&uuml;r die
Mouse.

<BR>Autor:  Hansj&uuml;rg W&uuml;thrich
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Mega Note V0.7                                                       (Neu 4/94)
</TD><TD>
Mega Note ist ein kleiner Notizblock mit max. 99 Seiten. Auf jede Seite passen
6 Zeilen a 24 Zeichen. Die  Position des  Window, des Cursors  sowie das Datum
und der eingestellte Font werden gespeichert und sind so nach jedem Start wie-
der aktiv. Weiterhin wird der  Export der Daten zum Drucker / Clipboard erm&ouml;g-
licht. Das Programm ben&ouml;tigt OS >= 2.04.

<BR>Autor:  Thomas Omilian
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Show Pic V1.04                                                       (Neu 4/94)
</TD><TD>
Ein Programm  zum Anzeigen von IFF-Bildern, das allerdings auch Ham8- oder Hi-
res-Bilder mit 256 Farben anzeigen kann. Das Programm ben&ouml;tigt OS >= 2.04.

<BR>Autor:  Ralf Baydacz
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 48</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
DiskCatalog V1.04
</TD><TD>
Ein Shell-Utility,  welches Kataloge  von beliebigen Devices  ausgibt und auch
in Dateien schreiben kann. Somit ist eine Druckausgabe selbstverst&auml;ndlich auch
m&ouml;glich.

<BR>Autor:  Constantin Rack
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Ham8
</TD><TD>
Zwei Ham8-Bilder "Garfield" und "tr&auml;umen" von  Horst Wiegmann.
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Code.WB
</TD><TD>
Ein kleines Spiel f&uuml;r die  Workbench, bei dem es gilt den  Geheimcode aus f&uuml;nf
Ziffern zu knacken. Die 10 Besten k&ouml;nnen sich in der "top-ten" verewigen.

<BR>Autor:  Horst Wiegmann
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Flush V1.0
</TD><TD>
Flush entfernt  alle, oder  auch nur einzelne, unben&ouml;tigten  Libraries und De-
vices aus dem Speicher. Im Gegensatz zu anderen Programmen dieser Art kann bei
Flush mit  Parametern angegeben werden welche  Libraries und  Devices entfernt
werden sollen.

<BR>Autor:  Oliver Graf
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Rawkeys V4.0
</TD><TD>
Rawkeys ist ein Tool f&uuml;r Programmierer, die in ihren  Programmen Intuimessages
der Typen RAWKEY und MOUSEBUTTONS auswerten wollen. Rawkeys zeigt, welche Code
und Qualifierwerte  nach Dr&uuml;cken einer Taste oder eines Mausknopfes auftreten.
Au&szlig;erdem wird das Ergebnis der Umwandlung mit RawkeysConvert() angezeigt.

<BR>Autor:  J&uuml;rgen Klawitter
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
RP TaBu Verwaltung V1.0
</TD><TD>
Sie sind ein Sammler von Perry Rhodan Taschenb&uuml;chern? Dann ist  dies das rich-
tige Programm f&uuml;r Sie. Sie k&ouml;nnen nach verschiedenen Kriterien Listen der Per-
ry Rhodan Taschenb&uuml;cher erstellen, nach  <BR>Autor,  Titel, Nummer oder einen Text
in den Bemerkungen suchen. Mit diesem Programm behalten Sie die &Uuml;bersicht &uuml;ber
Ihre Perry Rhodan Taschenbuchsammlung. Sie  finden jedes Buch und  k&ouml;nnen sich
diverse Listen  ausdrucken lassen. Das Programm ist f&uuml;r 500 Taschenb&uuml;cher aus-
gelegt, das reicht f&uuml;r die n&auml;chsten Jahre. In der Datei sind schon alle Tasch-
enb&uuml;cher bis zu Nummer 333 enthalten.

<BR>Autor:  Torsten Gottschalk
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 49a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Adressen V1.75
</TD><TD>
Eine einfache  Adressenverwaltung mit  Filterfunktion, Etiketten- und  Listen-
druck. Das Programm ben&ouml;tigt OS >= 2.04.

<BR>Autor:  R&uuml;diger Dreier
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
PludEd V2.0
</TD><TD>
Ein sehr  komfortabler ANSI - Editor f&uuml;r OS 2.0, 2.1 oder 3.0 mit  vielen ein-
drucksvollen  Funktionen, wie  z.B. eingebaute ANSI - Zeichens&auml;tze, Topaz- und
IBM-Font-Unterst&uuml;tzung, Blockbearbeitungsfunktionen, Cursor - Navigations-Gad-
gets,  Zeichnen von  sich &uuml;berlappenden  Linien und  Rechtecken,  Einf&uuml;ge- und
&Uuml;berschreib-Modus, getrennte Text- und Stil-Kontrolle, Lokalisieren und vieles
mehr.

<BR>Autor:  Stefan Zeiger
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
IntuiCalc V1.05                                                      (Neu 6/94)
</TD><TD>
IntuiCalc ist eine Art Taschenrechner. Im Gegensatz zu  den meisten "normalen"
Taschenrechnern wird bei IntuiCalc aber erst  der vollst&auml;ndige Ausdruck einge-
ben und dieser dann ausgewertet. IntuiCalc beherrscht neben den Grundrechenar-
ten auch trigonometrische und Hyperbelfunktionen. Ben&ouml;tigt OS >= 2.0

<BR>Autor:  R&uuml;diger Dreier
</TD>

	    </TR><TR>
		<TD VALIGN="TOP">
IntuiCalc MUI V1.00                                                  (Neu 6/94)
</TD><TD>
IntuiCalc-MUI ist eine MUI-Applikation und l&auml;uft von daher nur mit installier-
tem MUI-System.

<BR>Autor:  R&uuml;diger Dreier
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Gleichung V1.33                                                      (Neu 6/94)
</TD><TD>
Gleichung ist ein Programm  zum L&ouml;sen linearer Gleichungssysteme. Im Gegensatz
zu &auml;hnlichen Programmen  ist Gleichung nicht  auf Systeme mit drei Gleichungen
und drei Unbekannten  beschr&auml;nkt, auch mu&szlig;  das System nicht  quadratisch oder
eindeutig l&ouml;sbar sein. Gleichung bearbeitet Systeme,  deren Gr&ouml;&szlig;e fast nur vom
Speicher abh&auml;ngt. Das Programm ben&ouml;tigt OS >= 2.0.

<BR>Autor:  R&uuml;diger Dreier
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 50</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
Opernf&uuml;hrer V1.0
</TD><TD>
Opernf&uuml;hrer ist ein Programm f&uuml;r  Opernliebhaber. Es k&ouml;nnen die  Daten von bis
zu 1500 Opern verwaltet werden. Sie k&ouml;nnen nach diversen  Kriterien Listen er-
stellen und Opern  suchen lassen und  diese auch  auf einen  Drucker ausgeben.
Eine Datei mit 180 Opern ist bereits enthalten.

<BR>Autor:  Torsten Gottschalk
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
xPack V1.5
</TD><TD>
xPack ist ein Kommandozeileninterface f&uuml;r die XPK-Kompression-Library. Es soll
dazu dienen, gr&ouml;&szlig;ere  Mengen von Daten schnell und  komfortabel zu packen oder
zu  entpacken, insbesondere  um diese  dann mit dem XFH - Handler zu benutzen.
xPack l&auml;uft nur unter OS2.04 oder neuer.

<BR>Autor:  Matthias Scheler
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">
Most V1.42
</TD><TD>
Most ist ein Textanzeiger  &auml;hnlich Less, More oder  MuchMore. Most bietet: be-
liebig viele Textfenster; verteiltes Proze&szlig;system; Suchfunktion; frei konfigu-
rierbar; Kopierm&ouml;glichkeit ins Clipboard; Einladen von Dateien per Doppelklick
Fontsensitive  Oberfl&auml;che; PubScreen, eigener  Bildschirm oder Workbench; App-
Window,  AppIcon; ARexx Unterst&uuml;tzung; Sprachanpassung per Local.library; XPK-
Unterst&uuml;tzung; Verwendung  mit Pipes und  Hilfe per AmigaGuide. Ben&ouml;tigt Kick-
start 2.0 oder h&ouml;her.

<BR>Autor:  Uwe R&ouml;hm
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 51</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
PR Roman Archiv V1.0
</TD><TD>
Lesen und sammeln Sie die Heft-Romane der Perry Rhodan-Serie ? Fehlt Ihnen die
&Uuml;bersicht &uuml;ber Ihre Hefte? Dann brauchen Sie dieses Programm. Mit dem PR-Roman
Archiv k&ouml;nnen Sie jeden Ihrer Romane finden, diverse Listen erstellen und aus-
drucken. Bewahren Sie  die &Uuml;bersicht &uuml;ber  Ihre Sammlung. Mit  diesem Programm
k&ouml;nnen Sie bis zu 2500 Romane verwalten. Die mitgelieferte Datei enth&auml;lt schon
alle Romane bis zur Nummer 1300.

<BR>Autor:  Torsten Gottschalk
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 52a</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
DFAdress V2.0                                                     (Update 5/94)
</TD><TD>
DFA ist ein komplexes Programm zur Verwaltung von  Adressen. Es erm&ouml;glicht ein
schnelles Nachschlagen von Adressen  und verf&uuml;gt  &uuml;ber eine  Unterst&uuml;tzung von
EMail-Adressen. Es wurde unter besonderer Ber&uuml;cksichtigung  von OS 2.0 und h&ouml;-
her programmiert. Benutzer  des veralteten OS 1.3 k&ouml;nnen  es leider nicht ver-
wenden. Da es OS 2.0 verwendet, kommen die Benutzer auch in den Genu&szlig; der neu-
en Features, die der Amiga  nun zur Verf&uuml;gung stellt. Es hat  ein Application-
Icon, den  typischen 2.0 Look und kann v&ouml;llig &uuml;ber die Tastatur bedient werden
Es wird als Commodity in das  System eingebunden, auf diese  Weise ist es auch
&uuml;ber einen Hotkey erreichbar. Es verf&uuml;gt &uuml;ber einen ARexx-Port mit mehr als 30
Befehlen und kann so auch von  anderen Programmen aus  verwendet werden. Ab OS
2.1 unterst&uuml;tzt DFA die Lokalisierung, d.h. die automatische  Anpassung an die
Landessprache. Die interne Speicherverwaltung wurde komplett umgeschrieben, so
da&szlig; die Adressen nun wesentlich weniger Speicherplatz  brauchen. Au&szlig;erdem wur-
den die Lade- und Speicher-Routinen erheblich beschleunigt.

<BR>Autor:  Dirk Federlein
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 53b</TH>

	    </TR><TR>
		<TD VALIGN="TOP">
SuperView V2.5                                                    (Update 6/94)
</TD><TD>
SuperView ist ein Programm, das dahingehend entworfen wurde, da&szlig; jede Art g&auml;n-
giger IFF-Grafiken so schnell  und komfortabel wie  m&ouml;glich dargestellt werden
kann. Dabei stehen dem Anwender eine Reihe  von Features und Optionen zur Ver-
f&uuml;gung. Das Programm ben&ouml;tigt OS>= 2.04.

<BR>Autor:  Andreas Ralph Kleinert
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">FilePrint V1.0
</TD><TD>
FilePrint ist ein  Utility zum  Ausdrucken von  Textdateien, insbesondere  auf
Druckern, die eine (voll)automatische Einzelblattzuf&uuml;hrung  haben. Wobei File-
Print die M&ouml;glichkeit  bietet, zun&auml;chst  die Vorderseiten zu bedrucken und an-
schlie&szlig;end die R&uuml;ckseiten.

<BR>Autor:  J&ouml;rg Kalisch
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">Directory V0.9
</TD><TD>
Directory ist ein Adressverwaltungsprogramm im WB2.0-Look, das aber auch unter
OS 1.2 oder 1.3 l&auml;uft. Obwohl es sich um  ein Beta-Release  handelt, l&auml;uft das
Programm stabil und au&szlig;er "MIX" sind alle Funktionen enthalten.

<BR>Autor:  Sascha Bohnenkamp


	    </TR><TR>
		<TD VALIGN="TOP">Undelete V2.15
</TD><TD>
Undelete ist ein in Assembler  geschriebenes OS2.04-Tool, mit dessen Hilfe man
gerade eben gel&ouml;schte Verzeichnisse und Dateien auf  Festplatten und Disketten
wiederherstellen kann.

<BR>Autoren:  Dirk Michael Brosig und Mathias Nieting
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">Reset V2.31
</TD><TD>
Reset ist ein kleines Utility, das es einem  erlaubt, ohne den l&auml;stigen Affen-
griff einen Reset auszuf&uuml;hren. Es  l&auml;uft auf allen Amigas unter Kickstart 1.2,
1.3, 2.0 und 3.0 und kann mit verschiedenen Optionen aufgerufen werden.

<BR>Autor:  Martin Schlodder
</TD>

	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 54</TH>

	    </TR><TR>
		<TD VALIGN="TOP">DeliTracker V1.36
</TD><TD>
DeliTracker ist ein flexibler Soundplayer, der  viele verschiedene Soundforma-
te abspielen  kann. Man sollte ihn nicht  mit einem Songeditor, MIDI-Sequenzer
oder  Digitizer verwechseln. Er ist  ausschlie&szlig;lich dazu  gedacht, komfortabel
Musik  abzuspielen. Die Player  f&uuml;r die  Unterst&uuml;tzung von SoundTracker 15 in-
struments, SoundTracker 31 instruments,  StarTrekker ohne AM Sounds, NoiseTra-
cker, ProTracker  und Customplay Modulen sind bereits intern eingebaut. Weite-
re Player k&ouml;nnen  bei Bedarf  nachgeladen  werden. Das  bedeutet, da&szlig; man sehr
schnell, einfach und bequem neue Player hinzuf&uuml;gen kann.

<BR>Autor:  Frank Riffel
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 55</TH>

	    </TR><TR>
		<TD VALIGN="TOP">5 x 5
</TD><TD>
Das Spiel basiert auf der  gleichnamigen SAT1-Spielshow. Im Ganzen erinnert es
an Mastermind. Gesucht wird ein Wort mit f&uuml;nf Buchstaben. Um es zu erraten ha-
ben Sie f&uuml;nf Versuche. Nach jedem Versuch teilt Ihnen der Computer mit, ob die
Buchstaben im gesuchten Wort enthalten sind  und ob sie an der korrekten Posi-
tion sind. Au&szlig;erdem gibt  es noch ein Zeitlimit. Das Spiel  endet, wenn Sie im
f&uuml;nften Versuch das Wort noch nicht erraten haben, oder wenn die Zeit verstri-
chen ist. Das Programm bietet zus&auml;tzlich noch eine Highscore-Liste und im Edit
-Modus k&ouml;nnen eigene W&ouml;rter eingegeben werden. Diese Version wurde noch einmal
&uuml;berarbeitet und enth&auml;lt zus&auml;tzlich eine AGA-Version f&uuml;r A1200 oder A4000.

<BR>Autor:  Michael Taupitz
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">FaBase V1.04
</TD><TD>
Eine Fakturierung mit integrierter Adress- und Lagerdatenbank. Das ideale Pro-
gramm f&uuml;r alle, denen die kommerzielle Software zu  teuer ist und dennoch viel
Leistung erwarten. FaBase ist leicht zu bedienen. Lagerbest&auml;nde werden automa-
tisch von der Lagerdatei abgebucht. Einfache Kontrolle der Bestellmengen, aber
auch Mahnungen  sind m&ouml;glich  (in der vorliegenden  Demoversion gesperrt). Die
Datenverwaltung besitzt  umfangreiche Funktionen  und M&ouml;glichkeiten  zum Druck
von Label. Listen auch in der Datei m&ouml;glich. Import, Export, suchen, sortieren
und filtrieren.

<BR>Autor:  Hugo Kneub&uuml;hler
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">CDBase V1.15
</TD><TD>
CDBase ist eine  leistungsf&auml;hige CD/LP-Verwaltung, mit der sich gro&szlig;e Datenbe-
st&auml;nde verwalten lassen. Das  Programm kann so praktisch  alles, was von einer
Datenbank erwartet  wird. Vielf&auml;ltige  Druckm&ouml;glichkeiten, die  gesamten Daten
k&ouml;nnen  z.B. als Listenbeschreibung ausgegeben werden. Import, Export, sortie-
ren, suchen, filtrieren sind m&ouml;glich.

<BR>Autor:  Hugo Kneub&uuml;hler
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 56</TH>

	    </TR><TR>
		<TD VALIGN="TOP">WComm V3.232
</TD><TD>
WComm ist ein Multifunktionscommodity und erm&ouml;glicht die Belegung von 64 Fens-
termanipulationsfunktionen  mit Hotkey-Kombinationen. Ebenso enth&auml;lt WComm ein
komplettes Terminerinnerungsprogramm  und zus&auml;tzlich besitzt es  ein Paletten-
fenster und eine Bildschirmuhr mit Weckfunktion. Au&szlig;erdem  besitzt es auch die
M&ouml;glichkeit Programme mittels AppIcon, AppMenu oder Dropfenster zu starten.

<BR>Autor:  Hans Peter G&uuml;nther
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">Sparschwein V1.7
</TD><TD>
Sparschwein ist ein funktionelles  Finanzprogramm, das die Verwaltung  von bis
zu zehn Sparvertr&auml;gen erm&ouml;glicht. Desweiteren kontrolliert es, ob die entspre-
chenden Freibetr&auml;ge &uuml;berschritten werden. Ebenso bietet es die Option an, alle
Vertr&auml;ge  ausdrucken zu lassen, so wird  eine gro&szlig;e &Uuml;bersichtlichkeit der vor-
handenen Finanzen mit der dazugeh&ouml;rigen Laufzeit erlangt. Eine  genaue Zinsbe-
rechnung, sowohl f&uuml;r Jahres- als auch f&uuml;r die Gesamtzinsen ist selbstverst&auml;nd-
lich auch implementiert.
<BR>
<BR>Autor:  Meik Woyke
</TD>
	    </TR><TR>
		<TD VALIGN="TOP">Update
</TD><TD>
Update legt Sicherheitskopien von Verzeichnissen  an, dabei erkennt es selbst-
st&auml;ndig ob Dateien und Verzeichnisse schon im  Zielverzeichniss existieren und
kopiert diese dann nicht, wenn  sie das gleiche Datum  haben. Ebenfalls werden
Dateien, die zwar im  Zielverzeichniss, nicht aber im  Quellverzeichniss exis-
tieren, gel&ouml;scht. So spart man Zeit und schont seine Speichermedien.

<BR>
Autor:  Marc Ewert
</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">
			 Inhalt Amiga Szene Diskette 57</TH>

	    </TR><TR>
		<TD VALIGN="TOP">Bildergallerie </TD>

		<TD>Anl&auml;&szlig;lich der Bildergallerie in der Zeitschrift
		Amiga Plus, wollte Roger Hassler mit diesen Bildern einmal
		zeigen, da&szlig; es auch mit weniger Farben geht. Auf
		vielfachen Wunsch hat er hier nun nochmals die Bilder aus dem
		Amiga Plus Heft 4/94 zusammengestellt. Zus&auml;tzlich sind noch
		zwei weitere Bonusbilder von Roger auf der Diskette enthalten.
		</TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 58</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AMaster2 V2.5 </TD>

		<TD>AMaster2 ist eine &auml;u&szlig;erst einfach zu bedienende
		Adressverwaltung, die in der Lage ist eine unbegrenzte Anzahl
		von Listen zur gleichen Zeit zu verwenden. Jede Liste kann dabei
		eine unbegrenzte Anzahl von Adressen beinhalten. Nat&uuml;rlich
		sind auch Sortier-, Druck - und Selektierfunktionen vorhanden.
		Das Programm ben&ouml;tigt OS >= 2.04.

		<BR>Autor: Hans-Peter G&uuml;nther </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Kalender </TD>

		<TD>Kalender erzeugt ein Kalenderblatt wahlweise f&uuml;r ein
		Jahr, einen oder mehrere Monate in verschiedenen Formaten.

		<BR>Autor: J&uuml;rgen Klawitter </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">ShowIFF V7.93 </TD>

		<TD>ShowIFF ist ein IFF-ILBM-Anzeigeprogramm, das unter anderem
		die M&ouml;glichkeit mehrere Bilder nacheinander anzuzeigen und
		im Hintergrund ein Protracker-Modul abzuspielen.
		<BR>
		Autor: Tim Schattkowsky </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Res </TD>

		<TD>Res informiert dar&uuml;ber, welche Programme aktuell
		resident sind. Es ist also kein Ersatz f&uuml;r "Resident".
		Vorteil gegen&uuml;ber dem Resident-Befehl ist, da&szlig; die
		Namen nicht in einer langen Liste untereinander ausgegeben
		werden und damit schnell dem Blick entschwinden, sondern
		formatiert in f&uuml;nf Reihen pr&auml;sentiert werden. Es
		reicht in der Regel ein kleines CLI-Fenster, um alle residenten
		Befehle zu sehen.
		<BR>
		Autor: J&uuml;rgen Klawitter </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">Wildstar </TD>

		<TD> Ab OS 2.x kann man bei Shellbefehlen die Wildcards
		zulassen, statt der Zeichenkombination `#?` auch ein `*` als
		Jocker verwenden, zumindest potenziell. Voraussetzung ist,
		da&szlig; ein bestimmtes Bit in der RootNode-Struktur der
		dos.library gesetzt ist. Aus unbekannten Gr&uuml;nden hat
		Commodore bisher darauf verzichtet, den Benutzern der Shell
		diese neue M&ouml;glichkeit zug&auml;nglich zu machen. Im
		Handbuch fehlt ein entsprechender Hinweis, und einen
		Shell-Befehl, der das Bit nach Bedarf setzt oder l&ouml;scht,
		wird auch nicht mitgeliefert. Das erledigt Wildstar.
		<BR>
		Autor: J&uuml;rgen Klawitter </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">CPort</TD>

		<TD>CPort ist eine Automatische Umschaltung f&uuml;r die
		Parallelschnittstelle (Centronics) der MultiFaceCard II von bsc.
		Es soll allen Anwendern dienen, die zwei unterschiedliche
		Drucker am Amiga betreiben wollen. Hierbei wird der erste
		Drucker an der Parallelschnittstelle des Amiga, der zweite an
		der Parallelschnittstelle der MultiFaceCard II angeschlossen.
		Die betreffende Schnittstelle wird von CPort automatisch
		angew&auml;hlt, sobald in den Printer-Preferences der
		gew&uuml;nschte Druckertreiber angew&auml;hlt wird. Maximal
		k&ouml;nnen drei unterschiedliche Drucker und zwei
		MultiFaceCards von CPort angesprochen werden.
		<BR>
		Autor: Walter Ribbeck </TD>
	    <TR>
		<TH COLSPAN="2" ALIGN="LEFT">Inhalt Amiga Szene Diskette 59</TH>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">GetMem</TD>

		<TD>GetMem reduziert den freien Speicher vor&uuml;bergehend auf einen
		festlegbaren Wert Es eignet sich f&uuml;r Programmierer, die ihre
		Programme unter bestimmten Speichervoraussetzungen testen
		wollen.
		<BR>
		Autor: J&uuml;rgen Klawitter </TD>
	    </TR>
	    <TR>
		<TD VALIGN="TOP">AskOS</TD>
		<TD></TD>
	    </TR>
	    </TABLE>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="pdl.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#pdl0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>

