<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Computermeeting</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="smt0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#4040F0">
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Computermeeting</FONT></B></H1>
	    <BR>

<!Innere Tabelle>

	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#00F0F0" WIDTH="80%">
	    <TR>
		<TD>           
		<P>
		"Party-Review von Axel Melzener" @SH y @CO 2 1<BR>
		InfoX/A&amp;M-Club/AmiCon-Meeting<BR>
		<BR>
		Ein Party-Bericht von Axel Melzener<BR>
		<BR>
		<BR>
		Die Redaktionen des Szene-Papermags "InfoX", des
		"AmiCon"-Magazins (`Amiga und Consolen`) und die gro&szlig;en
		Meister des A&amp;M-Computerclubs veranstalteten am 21. Mai
		diesen Jahres im Multimediaraum der Alten Weberei in
		G&uuml;tersloh ein gro&szlig;es Computer-Treffen. Wochen vorher
		schon war in den Medien die Werbetrommel ger&uuml;hrt worden:
		Vom "Amiga Joker" bis zu den DF&Uuml;-Netzen kaum ein Platz, an
		welchem dem aufmerksamen Computerbesitzer die Propaganda
		f&uuml;r das Meeting entgangen sein d&uuml;rfte... Die
		Erwartungen waren also gro&szlig; -konnte die Veranstaltung dem
		`Hype` der Organisatoren standhalten, oder war es ein Flop? Dies
		will ich hier zu ergr&uuml;nden versuchen!<BR>
		<BR>
		Der Abholdienst vom Bahnhof klappte jedenfalls toll, Bernd
		"Diesel" K&uuml;nnen von der InfoX-RedaX (ein gro&szlig;er Typ
		mit blonden Locken, f&uuml;r alle, die ihn nicht kennen) hat
		mich netterweise von G&uuml;terloh-Hbf. abgeholt, und mitsamt
		Andreas Mau&szlig; und einem &auml;lteren Engl&auml;nder, der
		&uuml;brigens einen herrlichen Akzent sprach -wer war das? - zum
		Ort des Geschehens gefahren. Der erste Eindruck der
		&Ouml;rtlichkeiten war besser als erwartet: Eine gro&szlig;e,
		helle Halle mit guter Optik/Akkustik, in der es schon um 10.00
		Uhr unerwartet hoch her ging. Der Traum eines jeden
		Computerfreaks: Rechner &uuml;ber Rechner, laute Musik aus
		dicken Boxen, bunte Demos, gutgelaunte Leute, gesch&auml;ftiges
		Treiben. Wie man es halt von anderen Meetings dieser Art kennt,
		wenn auch nicht in einer so stilvollen Atmosph&auml;re wie hier!<BR>
		<BR>
		Also, ich habe meinen mitgeschleppten Rechner, den Amiga 1200
		(der einzige ernstzunehmende Computer im Rucksackformat - Lob an
		die Konstrukteure) nebst Monitor in einer Ecke plaziert, den
		Platz als den meinigen gekennzeichnet und habe mich dann erstmal
		umgesehen. Und ich war gleich eingekreist von Prominenz: Rechts
		neben mir rauschte der L&uuml;fter von Georg Windischs
		(A&amp;M-Club) Amiga 4000, hinter mir hatte die versammelte
		Mannschaft der InfoX-RedaX, samt Invi und "Murphy" Gellrich,
		ihre ComputerMaschinerie aufgefahren --- und links von mir
		sa&szlig;en die Herausgeber des AmiCon-Magazines, welche jedoch
		erst etwas sp&auml;ter eintrafen.<BR>
		<BR>
		Das Herz eines jeden Amiga-Freundes mu&szlig; h&ouml;her
		geschlagen haben, als er sah, da&szlig; bis auf einen PC, der
		mehr oder minder verlassen in einer Ecke sein Dasein fristete,
		nur Amigas auf den Tischen standen, und zwar der
		unterschiedlichsten Sorten. So hatte der "Computerclub
		Siebengebirge" gleich zwei CD 32 mitgebracht, und man konnte
		Games wie "Oscar" oder "Microcosm" (&uuml;berw&auml;ltigend!)
		mal in Aktion erleben. Zahlenm&auml;&szlig;ig in der
		&Uuml;berzahl waren erweiterte 2000er, doch auch die Masse der
		4000er, und zwar 030 und 040 in nahezu gleichem Verh&auml;ltnis,
		war erstaunlich. Die Besitzer eines Amiga 1200 bildeten schon
		fast eine Minderheit, noch `kleinere` Amigas waren nur
		vereinzelt zu sehen. In einem leider ung&uuml;nstig gelegenen
		Nebenraum wurde sogar ein A 4000 Tower pr&auml;sentiert, der mit
		Ray Tracing und Animationen protzte. Nebenbei lief auf einem
		TV-Monitor noch Tobias Richters Render-Streifen "Space Wars".<BR>
		<BR>
		Gegen Mittag, als sogar interessierte Nicht-Computerbesitzer aus
		der Stadt vorbeischauten, war der Raum ziemlich voll; wenn er
		auch nie ganz ausgesch&ouml;pft werden konnte - ein paar
		Teilnehmer mehr h&auml;tten sicher nicht geschadet. Es werden
		wohl kaum mehr als 50 oder 60 Leute mit 20-30 Rechnern permanent
		im Raum gewesen sein - von der Gr&ouml;&szlig;e her also ein
		eher bescheidener Erfolg, der dazu beitrug, da&szlig; die rechte
		Party-Stimmung nicht ganz aufkommen wollte. Ein klarer
		Minuspunkt. Doch man kann nat&uuml;rlich nicht erwarten,
		da&szlig; alle Computerbesitzer Deutschlands an Pfingsten in
		G&uuml;tersloh antanzen, oder?<BR>
		<BR>
		Daf&uuml;r ging es qualitativ hoch her. Prominenz war zweifellos
		vorhanden. Das begann bei Alain Declercq und Georg Windisch, die
		heftig die neueste Ausgabe (# 19) ihres stetig wachsenden
		"A&amp;M-Magazins" unters Volk brachten. Die InfoX-RedaX fiel
		vor allem durch provokant-laute Musikeinlagen und seltsame
		"Beavis &amp; Butthead"-Samples (`That`s cool, heheheh`) auf.
		Bernd K&uuml;nnen, Herausgeber der Purity-PD-Serie,
		demonstrierte, Pascal- Programmierung auf seinem
		aufger&uuml;steten Amiga 1000 - ja, es gibt ihn noch -
		w&auml;hrend andere Rechner als Kopierstation mi&szlig;braucht
		wurden.<BR>
		<BR>
		Ebenfalls anwesend war Peter H&auml;ndel, Herausgeber des "Forum
		Amiga", einer der derzeit beliebtesten Insider-Zeitschriften auf
		Diskette, der auch bis zum bitteren Ende ausharrte und durch die
		Gespr&auml;che, die seine Pr&auml;senz anregte, die Party vor
		dem Abdriften ins untere Mittelma&szlig; rettete. &Uuml;brigens:
		Das Forum Amiga wird weitergef&uuml;hrt wie bisher, von einem
		"Einstampfen" des Magazins und einer Zusammenlegung mit der
		`Powerbrei` wu&szlig;te Peter gar nichts und zeigte sich
		einigerma&szlig;en schockiert, als er von mir auf selbige
		(f&uuml;r mich als wahr angenommene) Information angesprochen
		wurde! Die Editoren des "Warrior`s Inn", eines Diskmagazines,
		welches sich ausschlie&szlig;lich mit Science Fiction &amp;
		Fantasy befa&szlig;t, geisterten ebenfalls durch die Lande und
		verteilten heftig Disks mit der neuesten Ausgabe ihres Werkes,
		welches ich &uuml;brigens nur empfehlen kann: Rollenspieltests,
		Kurzgeschichten und Informationen en Masse.<BR>
		<BR>
		Ebenfalls mit dabei war Andre Voget, seines Zeichens
		Programmierer des bekannten Text-Viewers "Look", welches von
		fast allen Diskmag-Redaktionen zur Anzeige ihrer Beitr&auml;ge
		benutzt word. Mit von der Partie war auch der Programmierer
		Hanns-Holger Rutz, den viele sicher (indirekt) durch den
		bekannten schwarz-wei&szlig;en "Anti-Rassismus" Bootblock
		bekannt ist, der vor vielen Diskmags eingeblendet wird. `Holgi`
		hat das Bild gezeichnet und das Installationsprogramm
		geschrieben.<BR>
		<BR>
		Doch noch mehr Ber&uuml;hmtheiten, wenn auch nur in zweitem
		Grade aus der Computerszene, tummelten sich dort. Sehr erfreut
		war ich, als ich Chris H&ouml;ppner kennenlernte, den
		Herausgeber des Fanzines "Waves", einer Zeitschrift f&uuml;r
		elektronische Musik. Chris macht auch selbst Musik und ist durch
		die sehr popul&auml;re WDR-Radiosendung "Schwingungen" (Do.
		22.10 auf WDR1) bekannt geworden. Er war es auch, der eine
		ausf&uuml;hrliche SynthesizerVorstellung auf dem Treffen gab und
		zeigte, was man aus einer `Korg Wavestation` so alles
		herauskitzeln kann, auch wenn das die meisten Anwesenden nicht
		oder nur wenig interessierte - interessant war es auf jeden
		Fall, und ein paar eingefleischte Amiga-Musikanten umringten
		Chris nat&uuml;rlich sofort, was ihn wohl etwas f&uuml;r das
		fehlende Feedback (es gab nicht mal Applaus --- Leute,
		sch&auml;mt Ihr Euch nicht?) entsch&auml;digte. Chris berichtete
		unter anderem, da&szlig; er vor kurzem mit der
		franz&ouml;sischen Synthesizer-Legende Jean-Michel Jarre ein
		Interview gef&uuml;hrt hatte. Dieses erscheint in der
		n&auml;chsten Ausgabe der Zeitschrift "Keyboards". Interesse
		hatte Chris auch an den Soundf&auml;higkeiten des Amiga; und als
		ich ihn dazu &uuml;berredete, sich ein paar Modules, allesamt
		Jarre-Adaptionen im MOD-Format, anzuh&ouml;ren, war er auch
		hellauf begeistert.<BR>
		<BR>
		Und was war meine Aufgabe auf dem Treffen? Ich war als
		Repr&auml;sentant des Programmiererteams "Game Object Design"
		gekommen und machte kr&auml;ftig Propaganda f&uuml;r unsere
		Sache: Viele (spielbare!) Demoversionen des lange
		angek&uuml;ndigten Rollenspieles JAKTAR wurden unter die Leute
		gebracht und auch flei&szlig;ig weiterkopiert. Die 3D-Grafik
		erntete ebenso Zuspruch wie das gelungene Intro! Auch
		GOD-Werbezettel wurden eifrig entgegengenommen. Die Lachnummer
		schlechthin war jedoch das filmm&auml;&szlig;ig aufgezogene
		Intro aus unserem zweiten Projekt, "Quasi Hasi", das durch
		witzige Animationen und Sounds &uuml;berzeugte. Turgut Temucin,
		ebenfalls GOD-Mitglied, war extra aus Berlin angereist und
		demonstrierte auf seinem mitgebrachten 4000er (nebst Freundin),
		was man alles mit AMOS Professional kann: Derzeit arbeitet er an
		einem detailierten 3D-System, welches in einem seiner
		n&auml;chsten Spiele verwendet werden soll. F&uuml;r ihn lohnte
		sich die weite Anreise, ebenso wie f&uuml;r mich, aber nur halb
		- viele Leute, die sich angek&uuml;ndigt hatten (z.B. weitere
		Mitglieder von GOD) kamen aus ungekl&auml;rten Gr&uuml;nden
		nicht. &Uuml;berhaupt fehlte es an einigen Ecken und Enden. Die
		Redakteure der "Powerbrei" -Stefan Kremer, Alexander Carbin,
		Sven Drieling und einige andere die erwartet wurden aber nicht
		kamen - fehlten schlicht- weg, ebenso w&auml;re die "Amiga
		Gadget"-Redaktion sicher ein willkommener Gast gewesen. Auch
		sonst allseits gern gesehene Teilnehmer wie der Grafiker Roger
		Hassler, welcher sich &ouml;fters auf Treffen dieser Art zeigt,
		wurde vermi&szlig;t.<BR>
		<BR>
		Doch immerhin war die Presse da: Organisatior Andreas Mau&szlig;
		wurde sowohl von einer G&uuml;tersloher Lokalzeitung als auch
		von einer Radiostation `pressifiziert` und mu&szlig;te
		Statements dazu abgeben, wie toll es doch sei, da moderne
		Medienzeitalter nach G&uuml;tersloh gebracht zu haben. Alain
		Declercq von A &amp; M war dann auch heftig mit der Videokamera
		zu Gange und zeichnete alle Hauptattraktionen auf. Einige
		anderen taten das gleiche. Man wird sich also in den
		n&auml;chsten Ausgaben einiger Magazine auf tolle Bilder von der
		Party freuen d&uuml;rfen.<BR>
		<BR>
		Nach der Mittagszeit, als die kollektiv bestellten Pizzen (30
		St&uuml;ck?) verspeist waren, ebbte die Stimmung auch langsam
		ab. Man hatte mit allen Leuten gesprochen, alle anderen Sachen
		gesehen -die ersten Freaks verlie&szlig;en gegen Nachmittag eher
		entt&auml;uscht als begeistert den Saal und fuhren heim. Um
		20.00 Uhr wurde dann der Strom abgestellt, die Leute bauten ihre
		Computer-Anlagen (besser: Festungen) ab, und gemeinsam packte
		man mit an und r&auml;umte den Raum geh&ouml;rig auf. Da solle
		mal einer sagen, Computerbesitzer seien faul!<BR>
		<BR>
		Danach war dann noch eine gem&uuml;tliche Erz&auml;hlrunde
		geplant, die auch stattfand. Dort wurde dann, nachdem f&uuml;r
		den Organisator in der M&uuml;tze von Andre Voget Geld gesammelt
		worden war (da er die Unkosten sonst nicht ganz reinbekam), bei
		Freibier (-Cola -Fanta) noch bis in die Nacht diskutiert. So
		kristallisierte sich die s&uuml;dkoreanische Firma Samsung als
		hei&szlig;er Bewerber um die Rechte an "Commodore" heraus!<BR>
		<BR>

		Gegen halb Elf brachen die meisten dann auf, da viele noch einen
		weiten Weg vor sich hatten und am n&auml;chsten Tag auf der
		Pfingst-Familienfeier noch einen ausgeschlafenen Eindruck machen
		wollten. Nachdem wir dem Fotografen der InfoX einmal
		kr&auml;ftig das Bild versaut hatten ("alle mal umdrehen"), war
		das Ende dann nahe, und die Mehrheit der User schlich sich nach
		der &uuml;blichen Abschiedszeremonie gen Auto oder Bahnhof.<BR>
		<BR>
		Zur&uuml;ck blieb ein gl&uuml;cklicher Andreas Mau&szlig;, der
		sicherlich zu Recht das Gef&uuml;hl hatte, f&uuml;r `seine
		Stadt` ein gro&szlig;es Werk vollbracht zu haben; arbeitslose
		Putzfrauen (alles war blitzblank) und ein harter Kern von Usern,
		die mit mehr oder minder zufriedenen Gef&uuml;hlen heimfuhren.<BR>
		</P>

		<DL>
		    <DT>FAZIT:
		    <DD>Es war ein h&uuml;bsches kleines Meeting, in dem sich
			ein (Bruch)teil der PD-Prominzenz aus deutschen Landen
			versammelte. Leider konnte sich der qualitative Anspruch
			nicht auf den quantitativen &uuml;bertragen: Es war einfach
			zu wenig los, und es wurden zu wenige interessante Dinge
			gezeigt. Einzige Lichtblicke: Der A 4000 T und Chris
			H&ouml;ppners Synth-Demonstration. Au&szlig;er vielen,
			zugegebenerma&szlig;en interessanten Gespr&auml;chen, ging
			nicht viel ab - das Treffen stand eher unter dem Motto `Ruhe
			und Geselligkeit` und hatte, sicher zum Bedauern einiger,
			nicht das Format von SzeneParty`s, die von hunderten von
			Menschen besucht werden, was jedoch abzusehen war. Trotzdem
			war es das gr&ouml;&szlig;te Meeting dieser Art seit
			l&auml;ngerer Zeit in NordrheinWestfalen: Weder das "Kalker
			Computermeeting" 91/92, noch das A&amp;M-Treffen 1992, die
			wohl als &auml;hnlich ernstzunehmend gegolten haben
			d&uuml;rften, kommen an die "InfoX/AmiCon/ A&amp;M"-Party
			heran, auch wenn es stellenweise noch M&auml;ngel gab.
		</DL>
		<DL>
		    <DT>VERBESSERUNGEN:
		    <DD>Man sollte dem Organisator raten, vielleicht
			n&auml;chstes Mal einen Raum auszuw&auml;hlen, die der
			Anzahl der anwesenden Leute entspricht. Auf diese Weise war
			zwar alles weit und ger&auml;umig; die freien Fl&auml;chen
			st&ouml;rten das Auge aber ganz gewaltig und machten klar,
			da&szlig; durchaus mehr Leute h&auml;tten kommen
			k&ouml;nnen. Vielleicht war der Termin `Pfingsten` auch
			etwas ungl&uuml;cklich gew&auml;hlt -eine Woche vorher oder
			nachher w&auml;ren sicherlich noch mehr Leute gekommen! Auch
			die Wahl von G&uuml;tersloh als Austragungsort war weniger
			gelungen. Zentren wie K&ouml;ln, D&uuml;sseldorf oder
			St&auml;dte im `Ruhrpott` h&auml;tten mit Sicherheit
			f&uuml;r ein noch gr&ouml;&szlig;eres Publikum gesorgt. Noch
			mehr Werbung h&auml;tte sicher auch nicht geschadet, obwohl
			sie fast schon optimal war und viel Lob verdient.
		</DL>

		Liste der Prominenten:<BR>
		~~~~~~~~~~~~~~~~~~<BR>
		<TABLE SUMMARY="TEXT" BORDER="0" CELLSPACING="3" CELLPADDING="3" BGCOLOR="#6060A0" WIDTH="580">

		<TR>
		    <TD WIDTH="350">Alain Declercq &amp; Georg Windisch</TD>
		    <TD WIDTH="230">(A&amp;M-Computerclub)</TD>
		</TR>
		<TR>
		    <TD>Invi, Diesel, Murphy &amp; Co.</TD>
		    <TD>(InfoX-RedaX)</TD>
		</TR>
		<TR>
		    <TD>Heiko und Lars Franke</TD>
		    <TD>("Amiga &amp; Consolen"-Verlag)</TD>
		</TR>
		<TR>
		    <TD>Peter H&auml;ndel</TD>
		    <TD>(Herausgeber FORUM AMIGA)</TD>
		</TR>
		<TR>
		    <TD>Andre Voget &amp; Kumpel</TD>
		    <TD>("Look"-Programmierer)</TD>
		</TR>
		<TR>
		    <TD>Axel Melzener &amp; Turgut Temucin</TD>
		    <TD>(Game Object Design)</TD>
		</TR>
		<TR>
		    <TD>Chris H&ouml;ppner</TD>
		    <TD>(Herausgeber WAVES)</TD>
		</TR>
		<TR>
		    <TD>Hanns-Holger Rutz</TD>
		    <TD>(Programmierer `Anti Rassismus-Bootblock`)</TD>
		</TR>
		<TR>
		    <TD>Computerclub Siebengebirge</TD>
		    <TD></TD>
		</TR>
		</TABLE>

		<P>
		...und  viele  andere,  die  ich  hier  nicht  auff&uuml;hren kann, weil ich sie
		entweder  nicht  kannte oder ihre Namen vergessen habe!  Sorry daf&uuml;r!
		Hope to see you next time ??!?<BR>
		<BR>
		</P>
		</TD>
	    </TR>
	    </TABLE>

<!Innere Tabelle>

	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
