<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Tips zum St&uuml;tzpunkt</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="smt0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#404040">
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Tips zum St&uuml;tzpunkt</FONT></B></H1>
	    <BR>

<!Innere Tabelle>

	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY=""BGCOLOR="#C0C0C0" WIDTH="80%">
	    <TR>
		<TD>           
		<P>
		Tips f&uuml;r einen<BR>
		==============<BR>
		<BR>
		APC+TCP St&uuml;tzpunkt<BR>
		==================<BR>
		<BR>
		Wie jeder wei&szlig;, versucht der APC+TCP ein Bundesweites
		Netz mit St&uuml;tzpunkten, also &ouml;rtlichen Vertretungen
		des APC+TCPs einzurichten.<BR>
		<BR>
		Die Vorteile einer solchen &ouml;rtlichen Vertretung sind ja
		wohl klar.<BR>
		<BR>
		Viele wollten schon so etwas machen, haben aber dann ihr
		vorhaben dann wieder aufgegeben, weil sie nicht wu&szlig;ten
		wie man das so ungef&auml;hr anstellen soll, oder weil sie nur
		alleine waren und so alles alleine machen mu&szlig;ten.<BR>
		<BR>
		Der APC+TCP hat z. Z. 3 &ouml;rtlichen Vertretungen. 2 davon
		sind Clubs, die sich dem APC+TCP angschlossen haben. Und der
		andere ist der APC+TCP St&uuml;tzpunkt Bamberg, den ich
		gegr&uuml;ndet habe.<BR>
		<BR>
		Nun, ganz ehrlich: Ich habe am Anfang auch noch nicht
		gewu&szlig;t, was ich da so alles machen soll. Aber im laufe
		der Zeit hat sich das so alles ergeben. Die ersten Monate ist
		im St&uuml;tzpunkt bei mir praktisch gar nichts gelaufen.<BR>
		<BR>
		Nun m&ouml;chte ich ein paar Tips und Ratschl&auml;ge geben,
		f&uuml;r diejenigen, die auch einen St&uuml;tzpunkt f&uuml;r
		den APC+TCP machen wollen.<BR>
		<BR>
		Also, dann fange ich jetzt mal an:<BR>
		""""""""""""""""""""""""""""""""""<BR>
		<BR>
		Tja, viele Denken ja, da&szlig; das ganze nicht zu schaffen
		ist. Nun, das ist nicht so. Der Arbeitsaufwand ist eigentlich
		nicht gro&szlig;, wenn man das so macht wie ich.<BR>
		<BR>
		F&uuml;r Clubtreffen w&auml;re allerdings Hilfe von einem
		anderen Clubmitglied sehr von Vorteil.<BR>
		<BR>
		Wenn man also einen St&uuml;tzpunkt hat, dann ist das erste
		Problem, das man l&ouml;sen mu&szlig;, die Bekanntheit. Denn es
		n&uuml;tzt nichts, wenn keiner wei&szlig; das es so was gibt.
		Also, am besten Clubheftchen anfordern, in denen m&ouml;glichst
		schon die St&uuml;tzpunkt-Adresse drinnsteht. Ansonsten einen
		kleinen Zettel reinheften, auf dem die St&uuml;tzpunkt-Adresse
		steht. Diese Heftchen dann in Computershops,
		Computerspieleshops usw. verteilen.<BR>
		<BR>
		Dann auf jeden Fall m&uuml;ssen Anzeigen geschaltet werden.
		Nat&uuml;rlich nur in regionalen Zeitschriften, in denen die
		Kleinanzeigen kostenlos sind. Hier spielt sich ein Vorteil des
		Clubs voll aus: Der APC+TCP ist ein nichtkomerzieller Club,
		also k&ouml;nnen die Anzeigen nicht als Gewerbliche Anzeigen
		berechnet werden. In Bamberg gibt es z. B. 2 Stadtmagazine in
		denen man kostenlos Anzeigen schalten kann. In jeder Ausgabe
		schalte ich dort kostenlose Anzeigen. Auch wenn sich die ersten
		Wochen keiner melden sollte, der Club wird bekannter und das
		ist sehr wichtig.<BR>
		<BR>
		So, dieses Problem w&auml;re jetzt gel&ouml;st. Ohne
		irgenwelche Kosten, wenn man kostenlose Anzeigen schalten kann.
		Der n&auml;chste Schritt w&auml;re dann, zu &uuml;berlegen wo
		man Mitgliedstreffen durchf&uuml;hren kann. In Bamberg kenne
		ich den Besitzer einen Computerspieleshops. Er hat mir
		freundlicherweise einen Raum f&uuml;r regelm&auml;&szlig;ige
		Mitgliedstreffen zur Verf&uuml;gung stelle. Mit ihm arbeite ich
		auch Sonderangebote f&uuml;r APC+TCP Mitglieder aus. Als
		Gegenleistung sage ich den Mitgliedern das sie beim Spielekauf
		zuerst in diesen Shop vorbeischauen sollen.<BR>
		<BR>
		Falls ihr nicht wi&szlig;t, wo ihr einen Raum bekommen
		k&ouml;nnt, dann versucht es einmal im Jugendzentrum,
		vorrausgesetzt euer Ort hat sowas. Wenn ihr nat&uuml;rlich
		einem kleinen Dorf wohnt, dann lohnt sich eigentlich ein Raum
		f&uuml;r Mitgliedstreffen kaum. Man sollte dann auf einen
		gr&ouml;&szlig;eren Ort ausweichen, solange man
		M&ouml;glichkeiten hat, dorthin zu kommen.<BR>
		<BR>
		So nachdem wir jetzt &uuml;ber Werbung und Raumprobleme
		gesprochen haben, geht es jetzt darum, eine eigene "Lokale"
		St&uuml;tzpunkt Infodisk einzurichten.<BR>
		<BR>
		Auf dieser Lokalen Infodisk befinden sich alle Informationen
		&uuml;ber den jeweiligen St&uuml;tzpunkt. Peppt das Ganze dann
		am besten ein wenig auf: Sch&ouml;nes Titelbild,
		Hintergrundmusik, Selbststartend usw. Und falls der Platz nicht
		reicht: Mit lha geht (fast) alles drauf.<BR>
		<BR>
		Auf der Infodisk des APC+TCP St&uuml;tzpunktes Bamberg habe ich
		alles drauf, was mit dem St&uuml;tzpunkt zu tun. Tut am besten
		auch ein paar Texte der "Haupt-" Infodisk drauf, wie z. B.
		Mitgliedsantrag, Clubleistungen etc. Aber vorher den Andreas
		Magerl fragen!<BR>
		<BR>
		Um ein Clubtreffen durchzuf&uuml;hren, sollte man mind. 6-7
		Mitglieder haben, sonst lohnt es sich nicht.<BR>
		<BR>
		Jetzt zum n&auml;chsten Punkt: Infodisk und NoCover. Habt am
		besten immer die aktuelle Infodisk und NoCover da. Dies ist ein
		weiterer Vorteil eines St&uuml;tzpunktes. Die Mitglieder
		brauchen dann, wenn sie die NC oder Infodisk brauchen, nicht
		immer an die Zentrale schreiben, sondern k&ouml;nnen die
		neueste Ausgabe immer bei euch bekommen. Spart Porto und Zeit!<BR>
		<BR>
		Holt euch am besten beim Andreas Magerl die Original-Aufkleber
		f&uuml;r die NoCover und die Infodisk. Und zwar solche, in die
		man nur noch die Nummer bzw. das Datum reinschreiben mu&szlig;.
		Das sieht dann n&auml;mlich viel professioneller aus.<BR>
		<BR>
		Schmei&szlig;t am besten auch auf die St&uuml;tzpunkt Infodisk
		am besten auch eure eigenen PD-Listen drauf.<BR>
		<BR>
		Am besten denkt ihr euch dann noch ein paar Services aus, die
		ihr den Mitglieder noch zus&auml;tlich im St&uuml;tzpunkt
		bieten k&ouml;nnt und dann sieht die Sache schon ganz gut aus.<BR>
		<BR>
		Gut w&auml;re es auch, wenn ihr in einem Computer- oder
		Spieleladen die NoCover anbieten lassen k&ouml;nntet. In
		Bamberg wird z. B. die NoCover im Playground verkauft. Zwar
		wurde sie noch nicht so oft verkauft, aber immerhin.<BR>
		<BR>
		Macht euch am besten auch ein eigenes Verzeichnis mit den
		Mitgiedsnamen und Adressen des St&uuml;tzpunktes. Dann hat man
		den vollen &Uuml;berblick. Wenn ihr neue Mitglieder habt, dann
		fragt sie auch auf jeden Fall ob die Mitgliedsbest&auml;tigung
		schon angekommen ist.<BR>
		<BR>
		So, das w&auml;ren jetzt die wichtigsten Tips um einen APC+TCP
		St&uuml;tzpunkt zu betreiben. Wie gesagt, das ganze bezieht
		sich auf meine Erfahrungen. Es kann nat&uuml;rlich bei euch
		auch ganz anders sein.<BR>
		<BR>
		Der Rest ergibt sich eigentlich von selbst.<BR>
		<BR>
		Solltet ihr noch irgenwelche Fragen haben, dann ruft mich doch
		einfach mal an.<BR>
		<BR>
		Hoffentlich konnte euch dieser Text ein wenig weiterhelfen...<BR>
		<BR>
		Stefan Wunner<BR>
		</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>

<!Innere Tabelle>

	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
