<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Kalifornien</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="smt0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#400000">
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Kalifornien</FONT></B></H1>
	    <BR>

    <!Innere Tabelle>

	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY=""BGCOLOR="#6060F0" WIDTH="80%">
	    <TR>
		<TD>           
		<P>
		Reisebericht Kalifornien<BR>
		<BR>
		Stars and Stripes<BR>
		<BR>
		Immer auf der Suche nach neuem Stoff f&uuml;r die No Cover hab
		ich mich heut mal dazu durchgerungen was &uuml;ber meinen
		diesj&auml;hrigen Urlaub zu schreiben. Ich hab den Bericht
		einfach chronologisch nach Tagen eingeteilt und werde am Ende
		noch ein paar allgemeine Informationen &uuml;ber USA abliefern.
		Ich hoffe ich kann dem einen oder anderen Tips f&uuml;r eine
		Kalifornienreise geben oder auch einfach nur die Lust an diesem
		Kontinent der Superlative wecken.<BR>
		<BR>
		14.08. Eigentlich wollten wir ja am 15.08. fliegen aber die
		Lusthansa hat aus unerfindlichen Gr&uuml;nden unseren Flug
		gestrichen und uns daf&uuml;r in den gleichen Flug am Vortag
		gesetzt. Nachdem wir am Flughafen FJS M&uuml;nchen eingecheckt
		hatten erwartete uns die n&auml;chste &Uuml;berraschung. Statt
		der erwarteten Lufthansa-Maschine stand ein Flugzeug von
		Lauda-Air im Abflugbereich. Nachdem wir sicherheitshalber
		nachgefragt haben ob wir hier richtig sind stellte sich heraus,
		da&szlig; Lufthansa mit Lauda-Air fusioniert ist und wir
		tats&auml;chlich mit dem Ding fliegen mu&szlig;ten. Zuerst
		waren wir ziemlich skeptisch da es &uuml;ber kaum eine andere
		Fluglinie soviele Ger&uuml;chte gibt. (Schlechtes Personal,
		st&uuml;rtzt st&auml;ndig ab, etc.) Doch hier wurden wir
		angenehm &uuml;berrascht. Freundliche, nat&uuml;rlich wirkende
		Stewardessen , gutes Essen (im Flugzeug keine
		Selbstverst&auml;ndlichkeit!), Beinfreiheit (zur Vermeidung von
		Fu&szlig;und R&uuml;ckenschmerzen bei Langstreckenfl&uuml;gen)
		und Bedienungsservice wie sie andere Fluglinien nicht mal im
		First-Class-Bereich bieten. Kurz gesagt einer der
		sch&ouml;nsten Fl&uuml;ge die ich je erlebt habe. Mit
		Sicherheit die beste Fluglinie neben Singapur Airlines (die im
		Moment auf Platz eins bei den Serviceleistungen stehen).
		Nachdem wir also 13 Stunden lang die angenehme Wiener
		Kaffeehausathmosph&auml;re genossen haben, die Lauda Air
		vermitteln will, kommen wir endlich frisch und munter am
		International Airport in Los Angeles an. Wenn man nach Amerika
		einreisen will mu&szlig; man zun&auml;chst mal in Besitz eines
		mindestens noch 6 Monate g&uuml;ltigen Reisepasses sein.
		Daneben mu&szlig; man bereits im Flugzeug ein Formular f&uuml;r
		die Einwanderungsbeh&ouml;rde ausf&uuml;llen (Wird von den
		Stewardessen erkl&auml;rt wie mans machen mu&szlig;). Dieses
		Formular ist immer wieder ein Lachschlager da die Fragen
		teilweise echt haneb&uuml;chen sind. Ein Beispiel: Haben sie
		vor Drogen in die USA einzuf&uuml;hren oder sich an
		terroristischen Ma&szlig;nahmen gegen den Staat zu beteiligen ?
		(Seite 2, Zeile 3 der Deklaration of Immigration) Ich glaub
		kaum, da&szlig; ein Terrorist diese Frage mit Ja beantworten
		w&uuml;rde ! Trotzdem nimmt der Einwanderungsbeamte diese
		Deklaration sehr ernst. Verkneift euch dumme Fragen und lacht
		ihn nicht aus wenn er noch d&uuml;mmere Fragen stellt. Das kann
		b&ouml;se ins Auge gehen ! Daneben sollte ich noch das harte
		Seuchengesetz der USA erw&auml;hnen das die Einfuhr
		s&auml;mtlicher Fleisch- und Wurstwaren verbietet. Also gilt
		generell: Nichts zum Essen mitnehmen. Nachdem wir also die
		Grenze hinter uns hatten mu&szlig;ten wir nun zun&auml;chst mal
		zu unserem ersten Hotel kommen. Daf&uuml;r stehen vor dem
		Flughafen sog. Shuttle-Busse bereit die in
		regelm&auml;&szlig;igen Abst&auml;nden zum Hotel und wieder
		zur&uuml;ck fahren. Jedes gr&ouml;&szlig;ere Hotel hat eine
		solche Shuttle- Buslinie (notfalls im Flughafen nachfragen ob
		es f&uuml;r das gebuchte Hotel diesen Service gibt). Den Bus
		kriegt man ungef&auml;hr so wie ein Taxi, d.h. man stellt sich
		an einem extra gekennzeichneten Platz hin und wartet bis der
		Bus des eigenen Hotels vorbeif&auml;hrt. Kommt nun der richtige
		Bus so winkt man dem Fahrer damit er h&auml;lt. Nachdem wir auf
		der Busfahrt schon einen ersten kleinen Eindruck von L.A.
		bekommen haben erreichen wir endlich das Airport Marina Hotel
		am Lincoln Blvd. Hier zeigt sich zum ersten Mal, da&szlig; wir
		uns im Land der Kreditkarte befinden. Ohne Vorlage dieser wird
		einem n&auml;mlich das Zimmer gar nicht gegeben !!!
		Amerikaerfahren wie wir sind hatten wir nat&uuml;rlich so ein
		Ding und so konnten wir endlich unseren Urlaub beginnen. An
		diesem Tag haben wir eigentlich nur noch den ersten Hamburger
		gegessen und zu Fu&szlig; die Gegend um unser Hotel erkundet.<BR>
		<BR>
		15.08. Zun&auml;chst mal gingen wir heute daran unseren
		Mietwagen bei Alamo zu holen. Hier kamen uns wieder die
		Shuttle-Busse zu Hilfe. Wir fuhren also zun&auml;chst mit dem
		Bus zur&uuml;ck zum Flughafen und schnappten uns dort einen Bus
		von Alamo (die Autoverleihfirmen bieten ebenfalls einen
		ShuttleService). Beim Autoverleih erwartete uns wieder eine
		positive &Uuml;berraschung. Einer von meinen Mitreisenden hatte
		an dem Tag Geburtstag. Der Alamo-Mitarbeiter freute sich so
		dar&uuml;ber, da&szlig; er uns einen wesentlich
		gr&ouml;&szlig;eren Wagen zum selben Preis mitgab. So bekamen
		wir also eine Riesensch&uuml;ssel namens Chevrolet Caprice
		Classic mit allem erdenklichen Luxus (elektrische Fensterheber,
		komplette Stereoanlage, Bordcomputer, Digitalanzeige,
		beleuchtete Aschenbecher, etc.). Auch unser Gep&auml;ck hatte
		in diesem Teil bequem Platz. Gl&uuml;cklich fuhren wir
		zur&uuml;ck zum Hotel und durften zum erstenmal einen der
		ber&uuml;hmt-ber&uuml;chtigten Staus genie&szlig;en f&uuml;r
		die L.A. weltweit bekannt ist. Vielleicht noch was allgemeines
		zu den Stra&szlig;en in Amerika: Im Stadtbereich gibt es drei
		Arten von Stra&szlig;en: Die Streets ziehen sich von Nord nach
		S&uuml;d vertikal durch die Stadt (H&ouml;chstgeschwindigkeit
		normalerweise 35 mp/h), die Avenues von Ost nach West. Diese
		Stra&szlig;en haben f&uuml;r jede Fahrtrichtung zwei Spuren.
		Durch die Streets und Avenues kommt das ber&uuml;hmte
		K&auml;stchensystem zustande, das man in jeder Stadt
		wiederfindet (&Uuml;brigens sehr komfortabel wenn man sich mal
		verfahren hat). Will man die Stadt diagonal durchqueren
		mu&szlig; man die Boulevards nehmen. Diese sind in der Regel
		gr&ouml;&szlig;er (Drei Spuren pro Fahrtrichtung und
		H&ouml;chstgeschwindigkeit 45 mp/h) und haben den Sinn,
		da&szlig; man schneller durch die Stadt kommt. Daneben gibt es
		noch die Highways (3 - 4 Spuren pro Fahrtrichtung und
		H&ouml;chstgeschwindigkeit 55 mp/h) und die Interstates (6 - 10
		Spuren pro Fahrtrichtung, H&ouml;chstgeschwindigkeit 65 mp/h),
		die in etwa unseren Autobahnen entsprechen. Ein guter Tip
		f&uuml;r L.A. ist die Interstate 5, auf der man schnell zu
		allen wichtigen Pl&auml;tzen in L.A. kommt. Kalifornien ist
		bekannt f&uuml;r eine besonders gnadenlose Verkehrspolizei.
		Besonders Raser und Dr&auml;ngler werden gnadenlos bestraft.
		Also am besten sich dem Verkehr anpassen. Das neueste Gesetz
		betrifft das hinauswerfen von M&uuml;ll auf der Stra&szlig;e.
		Ganz egal ob es nun ne Zigarettenkippe oder gr&ouml;&szlig;ere
		Gegenst&auml;nde wie Plastikt&uuml;ten sind. Es kostet ab 1000
		Dollar aufw&auml;rts. Wieder am Hotel checkten wir
		zun&auml;chst wieder aus (das geht in Amerika ganz komfortabel
		per Video-Checkout vom Fernseher im Zimmer aus). Und nun
		begaben wir uns zum ersten gro&szlig;en Ziel unserer Reise. San
		Francisco... Wir fuhren auf dem Highway 1 dorthin, der als eine
		der sch&ouml;nsten K&uuml;stenstra&szlig;en der Welt gilt. Es
		ist schon beeindruckend wenn man am Rande einer Felsklippe
		f&auml;hrt von wo man einen wundersch&ouml;nen Meerblick hat.
		Leider gehts auf diesem Highway verkehrsm&auml;&szlig;ig
		ziemlich zu, so da&szlig; man ziemlich lange nach San Francisco
		braucht. Wir entschlossen uns schon auf der Hinfahrt, da&szlig;
		wir beim Zur&uuml;ckfahren lieber die Interstate 101 nehmen
		w&uuml;rden. Auf der Hinfahrt kamen wir auch an Silicon Valley
		vorbei, an dem man nat&uuml;rlich als Computerfreak nicht so
		einfach vorbeifahren kann. Aber das war eher eine
		Entt&auml;uschung. Au&szlig;er den Firmengeb&auml;uden
		bekannter Computerfirmen wie Microsoft, Intel, Rank Xerox, etc.
		gibts dort echt nichts zu sehen. Die Firmen kann man nicht
		betreten da man bereits am Eingang vom firmeneigenen
		Sicherheitsdienst abgefangen wird (So gings mir jedenfalls bei
		Motorola und Atari). Deshalb fuhren wir schnell wieder weiter.
		In San Francisco angekommen buchten wir im Holiday Inn Civic
		Center in der 8th Street ein und stellten erst mal fest,
		da&szlig; es in SF erheblich k&auml;lter als in L.A. ist. San
		Francisco war der einzige Ort in Kalifornien wo wir Pullover
		und Jacken sowie die Heizung im Auto ben&ouml;tigten ! An
		diesem Abend fuhren wir zun&auml;chst nach Chinatown. Dort
		machten wir erst mals Bekanntschaft mit den ber&uuml;hmten
		Strassen von San Francisco, die oft Steigungen und Gef&auml;lle
		von 80 Grad (!!!) haben. Hier zu fahren ist echt wie in einer
		Achterbahn. Wenn man an so einer Steilstrasse parkt mu&szlig;
		man &uuml;brigens die R&auml;der unbedingt einschlagen. Weder
		Gang noch Handbremse w&uuml;rden den Wagen halten.
		Au&szlig;erdem laufen Politessen rum, die einem nen Strafzettel
		verpassen wenn mans vergi&szlig;t. In Chinatown leben die
		meisten Chinesen au&szlig;erhalb von China. Diese Tatsache
		d&uuml;rfte einiges &uuml;ber die Gr&ouml;&szlig;e von
		Chinatown aussagen. Auch gibt es wenn man tiefer
		hineinf&auml;hrt keine amerikanischen Verkehrszeichen mehr
		sondern nur noch chinesische. Deshalb bitte gut merken wo man
		geparkt hat sonst kanns passieren, da&szlig; man sein Auto
		nicht wiederfindet. In Chinatown zu Essen ist ebenfalls ein
		Abenteuer da die Speisekarten nur komplett in chinesisch sind.
		Ich hab Gottseidank Shrimps mit Reis erwischt, ein Spezl bekam
		undefinierbare Fleischst&uuml;ckchen mit Gem&uuml;se (wars ne
		Katze oder ne Ratte hmmmm). Wenigstens durfte man noch mit
		Dollars zahlen. Preislich wars ziemlich billig (ca. 20 DM). Das
		gleichwertige Men&uuml; h&auml;tte bei uns nen Preis von ca. DM
		60. Auch geschmacklich wars ok. Anschlie&szlig;end schauten wir
		noch ein paar Gesch&auml;fte an und fuhren anschlie&szlig;end
		zur Golden Gate Bridge. Nachts hat das den Vorteil, da&szlig;
		man f&uuml;r die &Uuml;berquerung der Br&uuml;cke nichts zahlen
		mu&szlig;. Am Tag kostets 8 Dollar. Anschlie&szlig;end fuhren
		wir zur&uuml;ck zum Hotel und g&ouml;nnten uns erstmal ne
		M&uuml;tze Schlaf.<BR>
		<BR>
		16.08. Heute erkundeten wir San Francisco am Tag. Zun&auml;chst
		fuhren wir nach Fishermans Wharf am San Francisco Harbour. Nach
		kurzem Fr&uuml;hst&uuml;ck in Pierres Kneipe erkundeten wir die
		zahlreichen Gesch&auml;fte die es hier im Hafenviertel gibt.
		Das aussergew&ouml;hnlichste Gesch&auml;ft war wohl der
		Chrismas Store am Pier 39 wo man das ganze Jahr &uuml;ber
		Weihnachtsartikel kaufen kann. Allein schon die Vorstellung im
		August mitten zwischen Christb&auml;umen und Nikol&auml;usen zu
		stehen... Daneben gab es noch diverse Souvenierl&auml;den sowie
		ein Magierviertel wo man s&auml;mtliche Zauberartikel kaufen
		kann. Neben den Gesch&auml;ften kann ich noch das Wax Museum
		empfehlen. Dieses gliedert sich in 4 Bereiche. Das eigentliche
		Wachsmuseum zeigt Figuren aus der Geschichte, Pr&auml;sidenten,
		Rockmusiker, Filmfiguren und &auml;hnliches. Kann man mit
		Tussauds in London vergleichen. Medieval Dungeon zeigt
		mittelalterliche Foltermethoden (nichts f&uuml;r schwache
		Nerven !), Haunted Mine ist eine Art Geisterbahn in der man von
		animierten Wachsfiguren erschreckt wird (!). Laser Maze
		schlie&szlig;lich ist ein Spiel in dem man durch diverse
		R&auml;ume l&auml;uft und Weltraumwachsfiguren mit einer
		Laserwumme kaltmachen darf. Nach diesen Erlebnissen fuhren wir
		weiter nach Seal Rocks von wo man angeblich gut Robben
		beobachten kann. Leider wurde uns dort mitgeteilt, da&szlig; es
		seit dem letzten Erdbeben (1989) dort keine Robben mehr gibt.
		Zur&uuml;ck in der Innenstadt fuhren wir zun&auml;chst mal mit
		den ber&uuml;hmten Cable Cars, der Stra&szlig;enbahn von San
		Francisco und schauten uns bei der Gelegenheit auch gleich die
		Transamerica Pyramid, das bekannteste Hochhaus in SF an.
		Anschlie&szlig;end fuhren wir mit dem Auto die Lombard Street
		hinunter, das ist eine Serpentinenstrasse mit hunderten von
		Blumenbeeten dazwischen. F&uuml;r diese Stra&szlig;e ist
		allerdings ein etwas kleinerer Wagen zu empfehlen. Die
		Serpentinen sind so eng, da&szlig; wir mit unserer
		Sch&uuml;ssel teilweise auf den Blumenbeeten fahren
		mu&szlig;ten. Anschlie&szlig;end erkundeten wir die Golden Gate
		Bridge am Tage. Vor der Br&uuml;cke gibts &uuml;brigens einen
		wundersch&ouml;nen View Point wo man die Br&uuml;cke gut sehen
		und nat&uuml;rlich fotografieren kann. Wir hatten gerade die
		Zeit erwischt wo die Br&uuml;cke langsam im aufsteigenden Nebel
		versinkt (Tolles Fotomotiv !). Anschlie&szlig;end
		&uuml;berquerten wir die Br&uuml;cke und bezahlten diesmal
		nat&uuml;rlich Maut. Nach unserer R&uuml;ckkehr nach SF fuhren
		wir dann zum Interstate 101 um den R&uuml;ckweg nach L.A.
		anzutreten.<BR>
		<BR>
		17.08. Nach der doch recht anstrengenden Fahrt lie&szlig;en wir
		den heutigen Tag etwas ruhiger angehen. Wir fuhren
		zun&auml;chst nach Santa Monica zum Fr&uuml;hst&uuml;cken um
		anschlie&szlig;end auf dem Sunset Blvd nach Hollywood zu
		d&uuml;sen. Unterwegs machten wir kurze Zwischenstopps in Bel
		Air und Beverly Hills wo die ganzen Prunkpal&auml;ste der High
		Society stehen. In Hollywood betraten wir zun&auml;chst den
		legend&auml;ren Walk of Fame wo die ber&uuml;hmtesten
		K&uuml;nstler Hollywoods in Form von Sternen auf dem
		B&uuml;rgersteig verewigt sind. Als Beispiele sein einfach mal
		Marilyn Monroe, James Dean und Gary Grant genannt. Die neuesten
		Sterne geh&ouml;ren Arnold Schwarzenegger, Sylvester Stallone
		und Michael Jackson. Jacksons Stern war &uuml;brigens eine
		zeitlang verschwunden (wegen dem Kinderskandal), inzwischen
		wurde er aber wieder an seinen alten Platz zur&uuml;ckgebracht.
		Neben den Sternen sind auch die Hand und Fu&szlig;abdr&uuml;cke
		der Stars interessant, die man am Eingang des Mann's Chinese
		Theatre bewundern kann. Hier haben z.B. Bette Davis und die
		ganze Mannschaft der Enterprise ihre Spuren hinterlassen. An
		allen Ecken und Enden Hollywoods werden sog. Star Guides
		verkauft. Das sind Hefte in denen die Privatadressen, Realnamen
		und sonstigen Daten der bekanntesten Hollywoodstars inklusive
		Anfahrtswege aufgelistet sind. So etwas kauften wir uns
		nat&uuml;rlich auch und fuhren die H&auml;user ab die uns
		interessierten. Als Beispiele erw&auml;hn ich hier mal Harrison
		Ford, Steven Spielberg, Walt Disney und Stan Laurel. Nach
		dieser Startour fuhren wir in die Santa Monica Mountains wo das
		bekannte Hollywood-Schriftzeichen steht. Unterwegs dorthin
		machten wir noch bei Madonna Halt die direkt unter dem
		Schriftzug wohnt. Die Fotoausbeute war bei den Stars recht
		gering, nur bei Doris Day war jemand im Garten. Wegen der
		Entfernung konnten wir aber nicht rausfinden ob es wirklich der
		Star oder nur ein Bediensteter war. Unsere "Hallo Doris" Rufe
		verhallten ungeh&ouml;rt... Abschlie&szlig;end mu&szlig; man
		zum Walk of Fame noch sagen, da&szlig; er einen etwas
		heruntergekommenen Eindruck macht. Hier gibts wahrscheinlich
		die meisten Drogens&uuml;chtigen von ganz L.A. Wir beschlossen
		diesen Tag mit einem guten brasilianischen Dinner und nem Glas
		Tequila.<BR>
		<BR>
		18.08. Heute stand der erste Vergn&uuml;gungspark auf dem
		Programm. Six Flags Magic Mountain liegt auf dem Weg nach
		Sacramento und bietet so ziemlich alles was es auf dem
		Achterbahnmarkt gibt. Deshalb ist der Park eigentlich nur
		Freunden von gigantischen Achterbahnen zu empfehlen. Alle
		aufzuz&auml;hlen w&auml;r wahrscheinlich zu langweilig deshalb
		hab ich nur ein paar besondere Beispiele herausgepickt:
		COLOSSUS ist die gr&ouml;&szlig;te Holzachterbahn der Welt. Das
		lustigste daran ist, da&szlig; zwei Z&uuml;ge parallel
		nebeneinander fahren. Gaudi garantiert. Aber vorsicht !
		Aufgrund der Holzbauweise wird man extrem
		durchgesch&uuml;ttelt. Mit VIPER wird die gr&ouml;&szlig;te
		Loopingachterbahn der Welt pr&auml;sentiert. Mit ihren 67
		Metern H&ouml;he ist sie schon von weitem zu sehen. Diese
		Achterbahn bietet neben 10 Loopings (einer davon in 50 Meter
		H&ouml;he !) eine Beschleunigung von 0 auf 100 in 4,8 Sekunden
		(entspricht in etwa einem Ferrari). PSYCLONE ist ein Nachbau
		der ber&uuml;hmten Cyclone-Achterbahn in CooneyIsland (New
		York). Besonders interessant f&uuml;r Achterbahn-Nostalgiker,
		in Holzbauweise, durchr&uuml;tteln garantiert. Wer schon mal
		den Film Achterbahn gesehen hat, dem d&uuml;rfte die REVOLUTION
		bekannt vorkommen. Diese Loopingbahn wurde n&auml;mlich bei den
		Dreharbeiten verwendet. Im Film hie&szlig; sie allerdings Magic
		Mountain. Nachdem den Achterbahnbauern Loopings und
		Geschwindigkeit nicht mehr ausreichten ersannen sie neue Wege
		um den Fahrgast zu schockieren. So entstand THE NINJA. Bei
		dieser Achterbahn f&auml;hrt man nicht wie &uuml;blich auf den
		Schienen sondern h&auml;ngt in einer freibeweglichen Gondel
		darunter. Ninja ist die erste Achterbahn der Welt die einen
		Au&szlig;enlooping bietet. Aber auch das ist den Six Flags
		Besuchern inzwischen zu langweilig. Die neueste
		Achterbahn-Sensation hei&szlig;t BATMAN-THE RIDE. Diese
		Achterbahn funktioniert &auml;hnlich wie der Ninja. Hier sitzt
		man jedoch nicht mehr in einer Gondel sondern in einer Art
		Sesselliftsitz mit freih&auml;ngenden F&uuml;&szlig;en! Wer
		also schon immer mal mit einem Skilift durch 8 Loopings
		rauschen wollte der wird hier f&uuml;ndig. Zwei der 8 Loopings
		sind Au&szlig;enloopings. Das Ding sollten wirklich nur gesunde
		Leute ausprobieren. Selbst uns erfahrenen Achterbahnfans blieb
		teilweise die Spucke weg. H&auml;rter als ein Flugsimulator !!
		So, ich glaub das reicht mit Achterbahnen. Daneben waren noch
		die 2 Wildwasserbahnen interessant. TIDAL WAVE garantiert dem
		Fahrgast, da&szlig; er bis auf die Haut durchn&auml;&szlig;t
		wird. Das Boot erzeugt am letzten Berg eine 25 Meter hohe
		Flutwelle (!!!). Daher auch der Name. CANYON RAPIDS ist ein
		Rafting-Abenteuer in gro&szlig;en runden Reifen bei dem man
		sogar durch einen echten Wasserfall f&auml;hrt. Zu den
		Wildwasserbahnen in Amerika sei generell gesagt, da&szlig; man
		fast bei jeder bis auf die Haut durchn&auml;&szlig;t wird. Das
		macht zwar an und f&uuml;r sich nichts da man in einer
		Viertelstunde wieder trocken ist aber man sollte nie vergessen
		Geldbeutel und Fotoapparat ausreichend zu sch&uuml;tzen. Neben
		den Fahrattraktionen gabs auch noch Theater und Entertainment
		Shows. Hier empfehle ich unbedingt die POLICE-ACADEMY STUNT
		SHOW, sowie die BATMAN-SHOW und das Abschlussfeuerwerk. Nach
		diesem aufregendem Erlebnis und mit etwas angekratztem Magen
		fuhren wir zur&uuml;ck ins Hotel.<BR>
		<BR>
		19.08. Heute fuhren wir nach Las Vegas. Unterwegs machten wir
		Halt in Calico, einer echten Geisterstadt. Calico liegt am
		Highway 66 mitten in der W&uuml;ste von Nevada. So einsam und
		verlassen wie im Film ist Calico leider nicht, da inzwischen
		zahlreiche Souvenirh&auml;ndler den touristischen Reiz von
		Geisterst&auml;dten entdeckt haben und hier ihre Gesch&auml;fte
		&ouml;ffnen. Trotzdem wars mal ganz interessant durch eine
		echte Silbermine zu spuken (gefunden hab ich nat&uuml;rlich
		nichts) oder die Originalbauwerke aus dem 18. Jahrhundert
		anzusehen. Besonders die Schule ist extrem gut erhalten.
		Allerdings ist Calico nichts f&uuml;r Hitzemuffel. Als wir dort
		waren hatte es ca. 50 Grad im Schatten ! Und das soll noch ein
		humaner Tag gewesen sein. Nach diesem Zwischenstopp gings
		weiter durch die W&uuml;ste. Das schlimmste St&uuml;ck liegt
		ca. 50 Meilen vor Las Vegas. Hier mu&szlig; man n&auml;mlich
		die Klimaanlage ausschalten da sie sonst &uuml;berhitzt
		w&uuml;rde. Nach 5 Minuten klebten uns bereits die T-Shirts am
		K&ouml;rper... In Las Vegas begaben wir uns zun&auml;chst zu
		unserem Hotel, dem MGM Grand. MGM Grand ist mit &uuml;ber 5000
		Zimmern das gr&ouml;&szlig;te Hotel der Welt, allein 30000
		Angestellte arbeiten dort (mehr als die Stadt Rosenheim
		Einwohner hat !). Im Hotel ist auch gleichzeitig der
		Vergn&uuml;gungspark MGM Grand Adventures zu finden. Die Hotels
		in Las Vegas leben &uuml;brigens nicht von der Zimmervermietung
		sondern von den gleichzeitig eingebauten Casinos. Aus dem Grund
		versuchen die Hotels den Kunden mit billigen Zimmerpreisen zu
		sich zu ziehen. Da Las Vegas praktisch nur aus Hotels und
		Casinos besteht ist der Konkurrenzdruck extrem hoch und nur die
		gr&ouml;&szlig;ten Hotels mit den besten und verr&uuml;cktesten
		Shows haben hier eine &Uuml;berlebenschance. So w&uuml;rde man
		f&uuml;r ein Zimmer mit dem Luxus den MGM Grand bietet z.B. in
		Deutschland 100 DM und mehr pro Nacht zahlen, in Las Vegas
		kostete uns der Spa&szlig; schlappe 20 DM !!! Einen ersten
		Eindruck von der imposanten Gr&ouml;&szlig;e des Hotels bekamen
		wir bereits in der Empfangshalle. Diese Halle allein ist schon
		gr&ouml;&szlig;er als die Abflughalle des M&uuml;nchner
		Flughafens. Nach dem Einchecken bekommt man erst mal einen
		Hotelplan in die Hand gedr&uuml;ckt ohne den man wohl nicht mal
		sein eigenes Zimmer finden w&uuml;rde (!). Nachdem wir mit
		einem von 24 (!) Aufz&uuml;gen zu unserem Zimmer hochfuhren
		erwartete uns das n&auml;chste Erlebnis. Der Gang auf dem unser
		Zimmer lag war fast einen Kilometer lang und unser Zimmer war
		ganz hinten !! Nachdem wir es endlich gefunden hatten konnten
		wir uns endlich das verr&uuml;ckte Las Vegas anschauen.
		Zun&auml;chst machten wir bei unserem eigenen Hotelcasino Halt.
		Es stand unter dem Motto "Der Zauberer von Oz" und war
		dementsprechend m&auml;rchenhaft eingerichtet. Nat&uuml;rlich
		war auch das Casino der Gr&ouml;&szlig;e des restlichen Hotels
		angepa&szlig;t. Alleine 14000 einarmige Banditen wollen hier
		mit Geld gef&uuml;ttert werden. Dazu kommen noch 500
		Pokertische, 100 Roulettetische und 4 Videospielhallen von
		denen die kleinste schon gr&ouml;&szlig;er ist als alles was
		ich bei uns so kenne. Unser Hotel lag direkt neben dem CLUB
		TROPICANA einem Hotel, das Tropenstimmung erzeugen will.
		Sehenswert hier vor allem das Casino bei dem man glaubt an
		einem Karibikstrand zu sein (mit echtem Sand und echten Palmen,
		sowie Salzwassergeruch). Gegen&uuml;ber liegt das EXCALIBUR,
		eines der ber&uuml;hmtesten Hotels in Las Vegas. Es ist wie ein
		Schlo&szlig; gebaut und bietet neben dem Casino auch noch die
		Excalibur-Show (Ritteressen), sowie den Magier David
		Copperfield. Zu der Zeit als wir dort waren gabs sogar eine
		David Copperfield Special Offer, d.h. wenn man ein Zimmer im
		Excalibur bucht kriegt man eine Gratis-Karte f&uuml;r die
		Magiershow ! Das LUXOR ist das neueste Hotel in Las Vegas. Es
		ist als Pyramide gebaut und bringt den Flair des alten
		&Auml;gypten wieder. Mit 48 DM/Nacht ist es das teuerste Hotel
		in ganz Las Vegas, daf&uuml;r hat es allerdings auch einiges zu
		bieten. Direkt neben der riesigen Sphinx am Eingang findet jede
		halbe Stunde eine Lasershow statt (in True-Color mit 16.8 Mio
		Farben !!), die sich The Mystique of the Old Egypt nennt. Im
		Inneren der Pyramide befindet sich eine Themenfahrt auf der man
		auf dem Nil (echtes Wasser) durch das Hotel f&auml;hrt, sowie
		ein Simulationskino das einen Computerfilm namens "The Search
		for the Obelisk" zeigt. Dieser Film wurde &uuml;brigens von ILM
		gemacht, die auch f&uuml;r Jurassic Park verantwortlich sind.
		Unbedingt sehenswert, die beste Computeranimation die ich je
		gesehen hab ! &Uuml;berhaupt scheint man im Luxor auf modernste
		Technik zu setzen. Neben dem obligatorischen Casino findet man
		hier auch eine Spielhalle mit den neuesten
		Virtual-Reality-Games. Als Beispiel f&uuml;hr ich hier einfach
		mal VirtualQuest an bei dem man durch ein Schlo&szlig;
		marschiert und Monster ala Doom bek&auml;mpft. Das ganze
		nat&uuml;rlich in True-Color und fast schon Echtzeit. Da gerade
		Silicon Graphics Werbung hier ziemlich h&auml;ufig vertreten
		ist kann man annehmen, da&szlig; diese Spielautomaten
		SGI-Motherboards eingebaut haben. TREASURE ISLAND ist ein Hotel
		f&uuml;r Piraten und Abenteurer. Es sieht aus wie eine
		Piratenstadt und bietet auch zu jeder Stunde eine entsprechende
		Show. Wer hier im Casino zockt wird unter Umst&auml;nden
		Mitglied im Treasure Island Club und hat Chancen auf den
		Membership-Jackpot von mehreren Millionen Dollar. Direkt
		daneben liegt das MIRAGE. Hier sind unter anderem die Magier
		Siegfried und Roy zuhause, daneben gibts jede halbe Stunde vor
		dem Hotel einen Vulkanausbruch (!) Die mit Abstand
		sch&ouml;nste Glitzerbeleuchtung bietet wohl das FLAMINGO
		HILTON. So viele Gl&uuml;hbirnen auf einem Haufen findet man
		wohl nirgends mehr auf der Welt. Gutes Fotomotiv ! Auch das
		Hilton wirbt seine G&auml;ste nicht nur mit der Beleuchtung. Es
		bietet daneben auch Shows der besten Elvis-Imitatoren der USA.
		Diese Hotels liegen alle am neuen Las Vegas Boulevard. Biegt
		man jedoch in die Fairmont Street ab kommt man zum
		&auml;lteren, daf&uuml;r ber&uuml;hmteren Teil von Las Vegas.
		Hier liegen unter anderem das STARDUST und das GOLDEN NUGGET
		Hotel. Diese Hotels sind besonders als Fotomotiv interessant,
		da sie eigentlich auf jeder Las Vegas Postkarte zu finden sind.
		(Besonders der Neon-Cowboy des Golden Nugget). Neben den Hotels
		und Casinos mu&szlig; man nat&uuml;rlich auch die
		ber&uuml;hmten Wedding-Chapels erw&auml;hnen, wo man f&uuml;r
		ein paar Dollar ohne gro&szlig;en Amtskram heiraten kann. Diese
		Kapellen stehen in regelm&auml;&szlig;igen Abst&auml;nden
		zwischen den Riesenhotels und versuchen ebenfalls durch bunte
		Beleuchtung Kunden zu gewinnen. Neuester Werbegag dieser
		Kapellen ist Heirat ohne den normal&uuml;blichen Bluttest, d.h.
		auch Verwandtenehen sind m&ouml;glich, sowie
		Schwulenhochzeiten. Las Vegas sollte man am besten mit dem Auto
		erkunden, da es ziemlich gro&szlig;fl&auml;chig gebaut ist. Man
		geht ja schon ein paar Kilometer bis man an unserem Hotel
		vorbei ist. Au&szlig;erdem ist es selbst in der Nacht noch
		ziemlich hei&szlig; und stickig. So hatten wir z.B. um 1 Uhr
		nachts noch immer 31 Grad Celsius ! Nachdem wir uns diese
		Glitzerwelt angesehen hatten fuhren wir zur&uuml;ck ins Hotel
		um endlich die Slotmachines ein wenig zu f&uuml;ttern.
		Anschlie&szlig;end fielen wir todm&uuml;de ins Bett.<BR>
		<BR>
		20.08. Heute stand der hoteleigene Vergn&uuml;gungspark auf dem
		Programm. Er bot z.B. LIGHTNING BOLT, das ist eine sog.
		Indoor-Achterbahn. Diese Achterbahn befindet sich in einem
		dunklen Raum, so da&szlig; man beim Fahren die Hand nicht vor
		Augen sieht. Ab und zu wird man mit Lasern beschossen und dazu
		l&auml;uft st&auml;ndig sph&auml;rische Weltraummusik.
		Sehenswert ist auch DEEP EARTH EXPLORATION, eine Themenfahrt
		die Jules Vernes "Reise zum Mittelpunkt der Erde" behandelt. Es
		ist eine Mischung aus Simulationskino und Zugfahrt und
		f&uuml;hrt einen zum Erdmittelpunkt wo man unter anderem Jules
		Verne findet. Auch Wasserrutschen m&uuml;ssen nat&uuml;rlich
		sein. Davon gibts 2 St&uuml;ck, die einen bis auf die Haut
		durchn&auml;ssen. Bei der Hitze tats richtig gut. Unbedingt
		mitnehmen sollte man die OVER THE EDGE. Diese Wasserrutsche
		bietet wohl den steilsten Berg den ich bisher gesehen habe.
		Hier gehts fast senkrecht runter ! Nett ist auch die HAUNTED
		MINE, eine Mischung aus Geisterbahn und Achterbahn. Nach diesem
		Park machten wir uns auf den R&uuml;ckweg nach L.A. Als kleinen
		Zwischenstopp hatten wir diesmal das HARD ROCK CAFE in Las
		Vegas in dem z.B. Originalinstrumente von Van Halen stehen. Auf
		der R&uuml;ckfahrt kamen wir in einen Stau der sich endlos
		hinzuziehen schien. Aus dem Grund fuhren wir erstmal vom
		Highway raus um was zu essen. Vielleicht hat sich der Stau ja
		dann aufgel&ouml;st. Und so stie&szlig;en wir mitten in der
		Pr&auml;rie auf das OLE TURBO GAS, eine richtige Truckerkneipe
		wie man sie eigentlich nur aus dem Film kennt. Als wir vor der
		T&uuml;r standen konnten wir lautes Stimmengewirr h&ouml;ren.
		Als wir jedoch die Gastst&auml;tte betraten kehrte blitzartig
		Schweigen ein und alle G&auml;ste drehten sich zu uns her.
		Wahrscheinlich waren wir die einzigen Touristen die je dieses
		Lokal betreten haben. Jedenfalls wurden wir wie
		Au&szlig;erirdische bestaunt. Ein paar nette Worte brachten
		Gottseidank alles schnell wieder in Ordnung und nach einer
		Viertelstunde fingen die Leute auch wieder zu reden an.
		Offensichtlich hatte man uns akzeptiert. Wir genossen noch ein
		kerniges Steak und h&ouml;rten uns die neuesten Trucker- und
		Blondinenwitze an bevor wir endg&uuml;ltig nach Los Angeles
		weiterfuhren. Dort angekommen checkten wir im Howard Johnson
		Hotel in Anaheim ein, das echt ein guter Tip ist. Eines der
		sch&ouml;nsten Hotels die wir hatten. Und mit 18 Dollar/Nacht
		auch noch einigerma&szlig;en preiswert.<BR>
		<BR>
		21.08. Heute fuhren wir zum Baden nach Malibu Beach. Malibu war
		in den 70ger Jahren der Strand der Reichen, heute kann man auch
		als Normalsterblicher dorthin. Gefr&uuml;hst&uuml;ckt haben wir
		im Malibu Inn, einer Kneipe in der eine Menge
		Originalautogramme von Stars h&auml;ngen, die in den 70gern
		hier beim Essen waren. Dieses Lokal ist ein echter Geheimtip,
		da es noch immer die exclusive Speisekarte von damals bietet
		allerdings jetzt zu humanen Preisen. Wer also schon immer mal
		wie Marilyn Monroe fr&uuml;hst&uuml;cken wollte nichts wie hin
		! Der Strand selbst ist leider nicht so sehr zum Baden geeignet
		da sich die Wellenreiter gro&szlig;e Teile unter den Nagel
		gerissen haben. Dort wo Surfer und Wellenreiter sind ist Baden
		verboten, da es zu gef&auml;hrlich ist. Wir fanden zwar einen
		kleinen Platz f&uuml;r uns aber dort war es ziemlich steinig,
		so da&szlig; das Plantschen wenig Spa&szlig; machte. Am Abend
		g&ouml;nnten wir uns zun&auml;chst ein mexikanisches Dinner.
		Die Portionen waren hier so gro&szlig;, da&szlig; es nicht mal
		die gefr&auml;&szlig;igsten von uns schafften sie zu vertilgen.
		Dabei ist besonders mexikanisch essen in L.A. extrem bilig.
		Unser Favoriten-Lokal: Das Acapulco in Anaheim.
		Anschlie&szlig;end gingen wir noch Minigolfspielen. Hier darf
		man sich nicht solche Pl&auml;tze wie bei uns vorstellen. Die
		Bahnen sind riesengro&szlig;, man spielt teilweise durch
		komplette Geb&auml;ude durch (hier warens ein
		M&auml;rchenschlo&szlig;, ein Spukhaus und eine
		Windm&uuml;hle). Es ist also grunds&auml;tzlich ein Erlebnis
		mal in Amerika Minigolf zu spielen. Falls jemand nach Florida
		will: Um Orlando gibts die sch&ouml;nsten Pl&auml;tze von ganz
		Amerika. Aber was solls. Schlecht waren die kalifornischen auch
		nicht. Anschlie&szlig;end legten wir uns schlafen.<BR>
		<BR>
		22.08./23.08. Normalerweise wird ja viel &uuml;bertrieben wenn
		in unseren Medien &uuml;ber die Antiraucherkampagne in Amerika
		berichtet wird. Es ist nicht mal halb so schlimm wies immer
		dargestellt wird und die Nichtraucher in Amerika sind uns
		Nikotins&uuml;chtigen gegen&uuml;ber wesentlich toleranter als
		in Deutschland. Trotzdem gibt es hie und da schon mal extremere
		Vertreter der Nichtraucherlobby. Und zu den schlimmsten seiner
		Art geh&ouml;rt mit Sicherheit der Vergn&uuml;gungspark
		DISNEYLAND in Anaheim in dem wir die n&auml;chsten 2 Tage
		verbrachten. Nicht nur, da&szlig; im gesamten Parkgel&auml;nde
		das Rauchen verboten ist, nein der Raucher wird hier auch
		f&uuml;r s&auml;mtliche Umweltkatastrophen wie Ozonloch,
		Waldsterben, etc. verantwortlich gemacht. Ich erw&auml;hne das
		wegen den ganzen Werbeplakaten und Antiraucher-Durchsagen, die
		man im ganzen Park sehen und h&ouml;ren kann. Das extremste
		Plakat das ich sah zeigt einen zerst&ouml;rten Wald vor dem ein
		Raucher steht. Auf den Raucher zeigt ein Pfeil mit der
		Aufschrift "Das warst du !". Es ist zwar nett, da&szlig; Disney
		den Nichtraucher vor Gesundheitssch&auml;den bewahren will doch
		angesichts der Umverpackungen und FCKW-haltigen
		Plastikt&uuml;ten sowie der Umweltzerst&ouml;rung durch den Bau
		des Parks selbst verkommt diese Aktion zur reinen Groteske. Nun
		ja, wir habens uns trotzdem nicht vermiesen lassen und 2 Tage
		ohne Glimmstengel sind ja auch auszuhalten. Obwohl wir diese
		Erfahrung nicht machten wurden wir vor der Reise mehrfach vor
		den barbarisch langen Warteschlangen gewarnt, die sich vor dem
		meistbesuchtesten Park Kaliforniens bilden k&ouml;nnen.
		Disneyland sollte man also keinesfalls am Wochenende einplanen.
		Die besten Tage f&uuml;r einen Besuch d&uuml;rften Montag -
		Donnerstag sein. Aufgrund der Gr&ouml;&szlig;e des Parks sollte
		man in jedem Fall einen 2 Tagespass nehmen, da man erstens viel
		Geld spart und man zweitens unm&ouml;glich alles an einem Tag
		schafft. Ich will auch hier nur grob beschreiben, da mir der
		Text eh schon zu lang wird. Disneyland gliedert sich in 8
		verschiedene Bereiche: In MAIN STREET USA findet man
		haupts&auml;chlich Shops und Restaurants verschiedenster Art.
		Interessant ist aber auch die Show GREAT MOMENTS WITH MR.
		LINCOLN in der man von einem erstklassig animierten Roboter mit
		dem Aussehen von Abraham Lincoln durch die amerikanische
		Geschichte gef&uuml;hrt wird. Dieser Roboter ist einer der
		wenigen echten Androiden (!!) dies auf der Welt gibt. Im
		ADVENTURELAND findet man z.B. das SWISS FAMILY TREEHOUSE in dem
		man rumklettern kann, sowie JUNGLE CRUISE eine Bootsfahrt durch
		den Dschungel wo einen animierte Tiger und &auml;hnliches
		erwarten. Der NEW ORLEANS SQUARE bietet gleich 2 der
		ber&uuml;hmtesten Disney-Attraktionen. Zum einen kann man sich
		in PIRATES OF THE CARIBBEAN auf eine echt piratische Bootsfahrt
		begeben, wers lieber gruselig mag der geht ins HAUNTED MANSION
		das als gr&ouml;&szlig;te Geisterbahn der Welt gilt. In CRITTER
		COUNTRY steht mit SPLASH MOUNTAIN die neueste Attraktion von
		Disneyland. Es ist eine der wenigen Wasserrutschen bei denen
		man trocken bleibt. Vom Fahrgef&uuml;hl aber nicht schlechter.
		Daneben gibt es im COUNTRY BEAR PLAYHOUSE noch eine nett
		gemachte B&auml;renshow zu bewundern. Disneyfreunde kommen hier
		voll auf ihre Kosten. Das im Wild-West-Stil gebaute
		FRONTIERLAND bietet als H&ouml;hepunkt den BIG THUNDER MOUNTAIN
		RAIROAD. Das ist eine Gebirgsachterbahn die durch eine alte
		Silbermine rast. Diese Attraktion geh&ouml;rt zu den
		gefragtesten &uuml;berhaupt im Park. Hier mu&szlig; man selbst
		an Wochentagen l&auml;ngere Wartezeiten einplanen ! Lohnen tut
		sich in jedem Fall auch eine Flo&szlig;fahrt zum TOM SAWYERS
		ISLAND, einer Insel mitten im Disney-See auf der man
		H&ouml;hlen und ein uraltes Fort erkunden kann. Am Abend sollte
		man sich im Frontierland auf jedem Fall FANTASMIC ansehen.
		Fantasmic ist eine Feuerwerk- und Lasershow in der Micky Maus
		gegen das B&ouml;se in Gestalt eines riesigen Drachens
		k&auml;mpft. Parallel dazu wird auch eine
		True-Color-AnimationsLasershow geliefert. FANTASYLAND behandelt
		die g&auml;ngigsten M&auml;rchen und bietet dementsprechende
		Attraktionen. Besonders erw&auml;hnenswert finde ich hier die
		Themenfahrten zu SCHNEEWITTCHEN, PINOCCHIO und PETER PAN.
		MICKEYS TOONTOWN ist der neueste Abschnitt von Disneyland. Hier
		wurde ganz Entenhausen nachgebaut und zwar so perfekt,
		da&szlig; man glaubt in einem Comic gelandet zu sein. Neben den
		ganzen Disneyfiguren trifft man hier auch auf eine der neuesten
		Attraktionen: ROGER RABBITS CAR TOON SPIN. Der letzte Bereich
		schlie&szlig;lich ist TOMORROWLAND. Dieses Land ist
		futuristisch aufgebaut und bietet z.B. das 3-D-Spektakel
		CAPTAIN EO von MICHAEL JACKSON. Sehenswert ist auch STAR TOURS
		bei dem man glaubt mitten im Film KRIEG DER STERNE zu sein. Am
		Rande des Tomorrowland findet man noch das MATTERHORN, die
		gr&ouml;&szlig;te Gebirgsachterbahn der Welt.
		Hauptanziehungspunkt im Tomorrowland ist aber mit Sicherheit
		der SPACE MOUNTAIN. Das ist eine gigantische Indoorachterbahn.
		Nat&uuml;rlich war das nur ein kleiner Auszug dessen was der
		Park zu bieten hat. Disneyland ist in jedem Fall
		Pflichtprogramm f&uuml;r jeden L.A.-Reisenden, denn wer diesen
		Park nicht gesehen hat der kennt auch L.A. nicht.<BR>
		<BR>
		24.08. Nach diesen 2 atemberaubenden Tagen brauchten wir wieder
		etwas ruhigeres. Also fuhren wir zum Baden nach Laguna Beach.
		Der Strand machte einen sauberen Eindruck und war angenehm zum
		Baden da hier keine Steine im Meer rumlagen. Der absolute
		H&ouml;hepunkt waren jedoch die hier vorherrschenden Wellen.
		Diese Dinger waren so stark, da&szlig; man sich auf sie setzen
		konnte und quasi zum Ufer hinausfuhr. Besonders Mutige
		k&ouml;nnen sich auch stehend auf der Welle mitfahren was dan
		ungef&auml;hr so wie wellenreiten ohne Brett ist. Hier ist aber
		Vorsicht geboten da man teilweise bis zu 10 Meter weit
		weggeschleudert wird wenn man den falschen Zeitpunkt erwischt.
		Nur f&uuml;r gute Schwimmer !<BR>
		<BR>
		25.08. Heute standen gleich mehrere Sachen auf dem Programm.
		Zun&auml;chst fuhren wir hoch zum YOSEMITE NATIONALPARK. Dieses
		Gel&auml;nde bietet eigentlich alles was der Naturfreund
		begehrt. Besonders imposant sind nat&uuml;rlich hier die
		Mammutb&auml;ume die teilweise bis zu 30 Meter Durchmesser
		haben. Nach unserer R&uuml;ckkehr nach L.A. gingen wir
		zun&auml;chst in das MOVIELAND WAX MUSEUM wo die ganzen
		ber&uuml;hmten Filmszenen mit Wachsfiguren nachgestellt sind.
		Besonders sehenswert war hier die CHAMBER OF HORRORS in der
		z.B. Szenen aus ELVIRA, KETTENS&Auml;GENMASSAKER oder FREITAG
		DER 13. nachgestellt wurden. Anschlie&szlig;end gings in
		RIPLEYS BELIEVE IT OR NOT MUSEUM weiter das unglaubliche Dinge
		ausstellt. Besonders beeindruckend waren hier ein Mensch mit 2
		Pupillen pro Auge oder der echte Schrumpfkopf aus Neuguinea.
		Anschlie&szlig;end gingen wir zum Ritteressen in die Dining
		Show MEDIEVAL TIMES. Hier sitzt man auf einer Trib&uuml;hne und
		isst w&auml;hrend in der Arena ein Turnier zwischen
		verschiedenen Rittern ausgetragen wird. Die Trib&uuml;hne ist
		in mehrere Abschnitte unterteilt denen jeweils eine bestimmte
		Farbe zugewiesen wird. Diese Farbe entspricht dann wiederum
		einem bestimmten Ritter zu dem man dann w&auml;hrend des
		Turniers h&auml;lt. Das ganze macht echt Spa&szlig;, besonders
		wenn man wieder mal einen Gegner mit Buhrufen aus der Arena
		vertreiben darf. Unbedingt ansehen !<BR>
		<BR>
		26.08. Heute gings in den Vergn&uuml;gungspark KNOTT'S BERRY
		FARM. Von den Parks war das eigentlich der langweiligste von
		allen. Erlebenswert sind hier vor allem MONTEZUMAS RACHE, die
		SCHNELLSTE ACHTERBAHN DER WELT. Dieses Ding bietet eine
		Beschleunigung von 0 auf 100 in 3,2 Sekunden (!!). Das ist in
		jedem Fall schneller als jeder Sportwagen. In dieser Achterbahn
		bekommt man sogar spezielle Kopfst&uuml;tzen da man sich sonst
		das Genick brechen w&uuml;rde. Interessant war auch BOOMERANG,
		eine Loopingachterbahn die einmal vorw&auml;rts und einmal
		r&uuml;ckw&auml;rts durch 6 Loopings rast. Gut gemacht war auch
		KINGDOM OF THE DINOSAURS, eine Themenfahrt in der man per
		Zeitmaschine zur&uuml;ck in die Urzeit geschleudert wird. Die
		Saurier sind echt gut animiert ! Als letztes sollte ich
		vielleicht noch die GRAND CANYON RAPIDS erw&auml;hnen. Das ist
		mal wieder eine Wildwasserbahn bei der man bis auf die Haut
		durchn&auml;&szlig;t wird. Diesen Tag beendeten wir wieder mal
		mit einer Runde Minigolf und einem Zug durch die Spielhallen.<BR>
		<BR>
		27.08. Dieser Tag war als reiner Ruhetag gedacht. Was
		besonderes haben wir eigentlich nur am Abend gemacht als wir in
		die Diningshow WIZARDS gingen. In dieser Show kann man bekannte
		Magier erleben w&auml;hrend man ein 6-G&auml;nge Men&uuml;
		verdr&uuml;ckt. Die Show an sich war beeindruckend, besonders
		ein Magier gefiel uns der sich auf der B&uuml;hne ein echtes
		Schwert in den Bauch rammte. Als er es wieder rauszog war
		nat&uuml;rlich nichts mehr zu sehen. That's Magic. Interessant
		waren auch die vielen kleinen Gesch&auml;fte, die sich um
		Wizards herum so angesiedelt haben. Hier kann man
		s&auml;mtliche magischen und obskuren Gegenst&auml;nde kaufen
		die man sich vorstellen kann. Besonders nett fand ich den Shop
		"Think Big" in dem nur riesengro&szlig;e Gegenst&auml;nde
		verkauft werden. Der Shop ist gut f&uuml;r Gesch&auml;ftsleute
		die originelle Werbeartikel suchen. Wie w&auml;rs z.B. mit
		einem 5 Meter gro&szlig;em Bleistift f&uuml;r das heimische
		Schreibwarengesch&auml;ft ? F&uuml;r Leute mit gro&szlig;em
		Geldbeutel gabs noch einen Shop in dem man
		Originalgegenst&auml;nde gro&szlig;er Magiere wie David
		Copperfield oder Houdini kaufen kann. Auch ein
		Hologrammgesch&auml;ft war da. Hier hab ich gleich kr&auml;ftig
		zugeschlagen weil die Dinger dort echt preiswert waren.<BR>
		<BR>
		28./29.08. Diese 2 Tage waren f&uuml;r die UNIVERSAL
		FILMSTUDIOS verplant. Dieses Studiogel&auml;nde geh&ouml;rt wie
		Disneyland zum absoluten Pflichtprogramm f&uuml;r
		Kalifornienreisende. Da dieser Park riesengro&szlig; ist
		beschreib ich nur das wichtigste. Der Park ist in 2 Bereiche,
		das ENTERTAINMENT CENTER, sowie das STUDIOCENTER aufgeteilt. Im
		Entertainment Center findet man z.B. die MIAMI VICE STUNT SHOW,
		die laut Werbung &uuml;ber 50 Explosionen in nur 15 Minuten
		bietet. Interessant ist auch das Musical BEETLEJUICES GRAVEJARD
		REVUE in dem die bekanntesten Filmmonster singend &uuml;ber die
		B&uuml;hne fegen. Neu im Programm ist die FLINTSTONES SHOW in
		der nat&uuml;rlich kr&auml;ftig Werbung f&uuml;r den neuen
		Kinofilm gemacht wird. Unbedingt sehenswert ist BACK TO THE
		FUTURE - THE RIDE in dem man in Mc Fly's DeLorean durch die
		Zukunft reist. Das Studio Center bietet gleich am Eingang eine
		der gr&ouml;&szlig;ten Attraktionen an. E.T. ADVENTURE ist
		nicht nur f&uuml;r Freunde des entsprechenden Films
		interessant. Das Ding geh&ouml;rt mit zu den perfektesten
		Themenfahrten die ich je gesehen habe. Aber Vorsicht ! An
		ung&uuml;nstigen Tagen kann man sich hier auf Rekordwartezeiten
		bis zu 4 Stunden einstellen ! Eine neuere Attraktion ist
		BACKDRAFT bei dem man einen Gro&szlig;brand in einer Fabrik
		miterlebt. Hei&szlig;er als die H&ouml;lle ! Als wir Backdraft
		verlie&szlig;en fiel mir sofort die Halle STAGE 28 ins Auge auf
		der ein gro&szlig;es SEAQUEST DSV Plakat prangt. Als ich die
		Halle betrat stellte ich fest, da&szlig; ich mich am
		ORIGINALDREHPLATZ dieser Serie befand. Leider waren nur ein
		paar Techniker da, die Ger&auml;te f&uuml;r den n&auml;chsten
		Dreh aufbauten. Der Amiga, der in der Serie verwendet wird
		befindet sich laut Aussage eines Sicherheitsbeamten in Santa
		Monica. Trotzdem wars mal ganz interessant sich ein wenig dort
		umzusehen. &Uuml;brigens wurde in den Universal Studios
		generell viel Seaquestwerbung gemacht. So unpopul&auml;r wie
		manche behaupten scheint diese Serie in den USA doch nicht zu
		sein. Interessant ist auch die STUDIO BACKLOT TOUR bei der man
		durch die Originalkulissen bekannter Filme f&auml;hrt.
		Besonders beeindruckend ist z.B. MOSES, bei dem sich vor den
		Augen des Betrachters ein See teilt, ERDBEBEN in dem man ein
		Erdbeben der St&auml;rke 8.3 erlebt oder KING KONG bei dem man
		von einem 18 Meter hohem Gorilla angegriffen wird. Neue
		Attraktionen sind JURASSIC PARK bei dem man durch einen
		Dinosaurierpark f&auml;hrt und von einem Tyrannosaurus
		attackiert wird, COLLAPSING BRIDGE (Br&uuml;cke st&uuml;rtzt
		unter dem Fahrgast zusammen) und AVALANCHE (Fahrgast ger&auml;t
		in eine Lawine). Generell haben gerade Katastrophenfilme in den
		Universal Studios Vorrang. Am Ende des Tages gibt es noch
		t&auml;glich das Abschlussfeuerwerk SPEKTRABLAST, das man
		ebenfalls erlebt haben sollte. So, das war ein kleiner
		Ausschnitt aus den Universal Studios. Zur Gr&ouml;&szlig;e des
		Parks mu&szlig; man noch sagen, da&szlig; alleine die
		Attraktion E.T. so gro&szlig; ist wie die gesamten Bavaria
		Filmstudios. An Platz und Kosten wurde hier bestimmt nicht
		gespart !<BR>
		<BR>
		30.08. Traurig dieses tolle Land wieder verlassen zu
		m&uuml;ssen treten wir den R&uuml;ckflug an.
		&Uuml;berraschenderweise haben wir diesmal sogar ein Original
		Lufthansaflugzeug erwischt. Diese Fluglinie liegt etwas
		&uuml;ber dem Durchschnitt, konnte jedoch Lauda-Air nicht das
		Wasser reichen. Am 31.08. schlie&szlig;lich erreichen wir
		wohlbehalten den Flughafen M&uuml;nchen...<BR>
		<BR>
		So, das war jetzt mal der chronologische Reisebericht. Ich hoff
		er war nicht allzulang (hab ja eh schon gek&uuml;rzt wo es
		geht) aber f&uuml;r eine Amerikabeschreibung braucht man halt
		ein bisschen mehr Platz. Ich geb jetzt nur noch in Kurzform
		einige Reisetips ab.<BR>
		<BR>
		<BR>
		Reisetips USA:<BR>
		<BR>
		EINREISE: Mindestens 6 Monate g&uuml;ltiger Reisepass, in
		manchen L&auml;ndern Visumpflicht. Ausgef&uuml;lltes Formular
		"Deklaration of Immigration", sowie Zollerkl&auml;rung (wird
		beides im Flugzeug ausgeteilt)<BR>
		<BR>
		GRENZE: Gelbe Linien beachten, den Anweisungen der Zollbeamten
		unbedingt Folge leisten. Amerika ist ein Polizeistaat und man
		sitzt schneller im Knast als man denkt.<BR>
		<BR>
		MIETWAGEN: Von Deutschland aus buchen da es etwas billiger ist.
		Zur Mietwagenfirma kommt man am besten mit dem Shuttle-Bus am
		Flughafen (Auf gr&uuml;ne Markierungen = Haltestellen achten)<BR>
		<BR>
		HOTELS: G&uuml;nstige Hotelketten sind No. 6, Howard Johnson,
		Best Western und Ramada Inn. Die Hotels haben in der Regel sog.
		"Deadlines", d.h. wenn man bis zu einer bestimmten Uhrzeit
		nicht im Hotel eingecheckt hat wird das Zimmer ersatzlos
		gestrichen. Deadline ist in den meisten Hotels um 18 Uhr. Falls
		man es bis dahin nicht zum Hotel schafft unbedingt dort
		anrufen.<BR>
		<BR>
		KREDITKARTEN: Genausowichtig wie der Reisepass. Mietw&auml;gen
		werden ohne Kreditkarten nur gegen horrende
		Sicherheitsgeb&uuml;hren verliehen, Hotelzimmer erh&auml;lt man
		teilweise gar nicht. Oft wird die Kreditkarte auch als
		Sicherheitsnachweis (wie bei uns der Personalausweis) verlangt.
		G&auml;ngigste Karten sind Visa, American Express und Master
		Card.<BR>
		<BR>
		MEDIZIN: Impfungen sind keine erforderlich. Harte Medikamente
		wie Herzund Kreislauftabletten d&uuml;rfen nicht
		eingef&uuml;hrt werden. Arztkosten sind da dr&uuml;ben extrem
		hoch, also bleibt lieber gleich gesund.
		Reisekrankenversicherung abschlie&szlig;en, da unsere
		Krankenkassen wie AOK sich f&uuml;r USAReisende nicht
		zust&auml;ndig f&uuml;hlen (keine Deckung).<BR>
		<BR>
		SEHENSW&Uuml;RDIGKEITEN: Eigentlich alles aber besonders
		Disneyland, Universal Studios, Yosemite Park und Medieval
		Times.<BR>
		<BR>
		KRIMINALIT&Auml;T: In den Vierteln wo der Abfall auf der
		Stra&szlig;e liegt sollte man sich besser nicht blicken lassen.
		Diese Viertel sind aber gottseidank gut von allen anderen zu
		unterscheiden. Ansonsten ist USA nicht gef&auml;hrlicher als
		Deutschland. Auf Taschendiebe mu&szlig; man schlie&szlig;lich
		auch bei uns aufpassen.<BR>
		<BR>
		EINKAUFEN: In Amerika gibts sog. Special Sales, d.h. Artikel
		werden oft bis zu 20 % billiger angeboten. Daher immer auf
		solche Angebote achten. Benzin wird nicht wie bei uns zum
		Einheitspreis verkauft sondern nach Gutd&uuml;nken der
		Tankstelle. Daher am besten dort tanken wo es viele Tankstellen
		gibt (Konkurrenzdruck f&uuml;hrt zu besonders g&uuml;nstigen
		Preisen). Elektronik ist etwas billiger als bei uns, da man
		jedoch einen zus&auml;tzlichen Spannungskonverter brauchen
		w&uuml;rde ist der Preisunterschied praktisch gleich Null.<BR>
		<BR>
		STROM: In Amerika gibts nur 110 V. Deshalb nur umschaltbare
		Ger&auml;te mitnehmen. Die Steckdosen sehen anders aus als bei
		uns, daher ist ein Reiseadapter erforderlich.<BR>
		<BR>
		So jetzt hab ich keinen Bock mehr.<BR>
		<BR>
		<BR>
		<BR>
		Smiegel
		</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>

    <!Innere Tabelle>

	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
