<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Infos WOC</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="smt0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="smt.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#404040">
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <H1 ALIGN="CENTER"><B><FONT COLOR="#FFFF00">Infos WOC</FONT></B></H1>
	    <BR>

<!Innere Tabelle>

	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY=""BGCOLOR="#A0A0A0" WIDTH="80%">
	    <TR>
		<TD>           
		
		<H3>Das Messe-Erlebnis: Die Computer`94</H3><BR>

		<P>
		Beeindruckende Resonanz der Aussteller...<BR>
		<BR>
		Durch die beeindruckend positiven Resultate der Computer`93, wie
		hervorragende Ums&auml;tze der Aussteller und viele zufriedene
		Besucher, steigt die Computer`94 in der Gunst der Aussteller
		betr&auml;chtlich. Die Anmeldungen liegen deutlich &uuml;ber der
		Zahl im gleichen Zeitraum des letzten Jahres.<BR>
		<BR>
		Mit einem Wachstum von etwa 90% bei der Ausstellungsfl&auml;che
		gegen&uuml;ber dem Vorjahr zeigt die Computer`94 deutlich den
		Trend bei Computermessen: Gefragt sind Consumer-Messen heute
		mehr denn je. Sie garantieren direkte Kundenansprache!<BR>
		<BR>
		Von den drei Bereichen PC, Amiga und Entertainment ist der
		PC-Bereich der am st&auml;rksten wachsende Bereich.<BR>
		<BR>
		Dabei spielt auch die Unterst&uuml;tzung der Aussteller eine
		gro&szlig;e Rolle. SO stellte IBM den Veranstaltern ein
		Schreiben zur Verf&uuml;gung, in dem es die Messe als die ideale
		Plattform bezeichnet, den Verbraucher aus den Bereichen
		Entertainment und Home Market zu erreichen. AUf der Computer`94
		werden Produkte und Pr&auml;sentationen rund um das
		Bestriebssystem OS/2 einen gro&szlig;en Raum einnehmen. Eine
		faszinierende Multimedia-Show wird den Besuchern im
		Ged&auml;chtnis bleiben: Zwei Teilnehmer k&ouml;nnen im
		Wettbewerb ein dreidimensionales Labyrinth erkunden und
		spannende Abenteuer bestehen.<BR>
		<BR>
		Der Entertainment-Bereich "World of Games" verzeichnet in diesem
		Jahr Wachstum durch mehr AUssteller und gr&ouml;&szlig;ere
		St&auml;nde. Allen voran Rushware, die Gewinne f&uuml;r etwa
		150.000 DM unter den Besuchern verlosen. Damit hat sich dieser
		Beereich als Deutschlands gr&ouml;&szlig;te Messe f&uuml;r
		Computer- und Konsolenspiele etabliert.<BR>
		<BR>
		Allen Unkenrufen zum Trotz wird auch der Amiga-Bereich einen
		fast ebenso gro&szlig;en Bereich wie im letzten Jahr einnehmen.
		Obwohl der Hersteller selbst aufgrund seiner Finanzprobleme die
		Teilnahme nicht definitiv zusagte, ist Gesch&auml;ftsf&uuml;hrer
		Alwin Stumpf zuversichtlich: "Wir sind zu 99 Prozent dabei." Die
		ANbieter von SOft- und Hardware f&uuml;r die Amiga-Produktlinie
		sehen ihren Umsatz auf der "World of Commodore mit Amiga`94":
		Der Amiga-Bereich wird etwa wieder dieselbe Gr&ouml;&szlig;e wie
		im letzten Jahr umfassen und damit nach wie vor die
		gr&ouml;&szlig;te Amiga-Messe weltweit sein.<BR>
		</P>

		<H4>AKTIONEN</H4>
		<P>
		Die Veranstalter ICP und Pro Concept demonstrieren auch in
		diesem Jahr wieder, was sie unter einer Erlebnismesse verstehen.
		Neben den Aktionen auf den St&auml;nden binden unterschiedliche
		Attraktionen der Veranstalter das Publikum ins Geschehen ein,
		geben ihm die Gelegenheit f&uuml;r viele lukrative Gewinne und
		machen den Messebesuch zu einem unverge&szlig;lichen
		Erlebnis.<BR>
		<BR>
		"Ziel mu&szlig; es sein, da&szlig; sich jeder Besucher bereits
		in diesem Jahr auf die Computer`95 freit."<BR>
		</P>

		<H4>IBM Informationssysteme Deutschland:</H4>
		<P>
		Die gro&szlig;e Multimedia-Show<BR>
		<BR>
		Auf einem 250 qm gro&szlig;en Stand pr&auml;sentiert IBM
		Informationssysteme Deutschland eine tolle Multimedia-Show.
		Gleichzeitig haben zwei Mitspieler aus dem Publikum die Chance,
		ganz im Zeichen von Virtuell Reality durch ein 3D-Labyrinth zu
		wandeln, T&uuml;ren und Fenster zu &ouml;ffnen und Abenteuer zu
		bestehen, um damit eine der begehrten Multimedia-Taschen zu
		gewinnen.<BR>
		<BR>
		Diese Multimdeia-Taschen enthalten OS/2, Soundblaster-Karten,
		Lautsprecher, CD-ROM und weitere interessante Produkte, um
		seinen PC aufzuwerten.<BR>
		</P>

		<H4>Rushware:</H4>
		<P>
		Ein volles Programm.<BR>
		<BR>
		Jeden Tag ab 12.00 Uhr zu jeder vollen Stunde startet eine neue
		SHow. Das Programm ist ebenso bunt gemischt, wie attraktiv:
		Karaoke, Quizveranstaltungen, Wettbewerbe, Verlosungsaktionen,
		Produktpr&auml;sentationen, Button-Aktionen, Aufrtitte von
		Promineten und vieles mehr...<BR>
		<BR>
		Hier ist f&uuml;r jeden etwas dabei - und zu gewinnen. Die
		Preise bei Rushware belaufen sich auf einen Gesamtwert von
		unglaublichen 150.000 DM.<BR>
		</P>

		<H4>Computec:</H4>
		<P>
		Game-Show "Playtime"<BR>
		<BR>
		Der bekannte Verlag f&uuml;r Magazine &uuml;ber Computerspiele
		bringt TV-Aktion auf die Messe. Die Game-Show "Playtime" aus
		RTL2, die erste TV-Computer-Game-Show Deeutschlands, wird
		f&uuml;r jeden Besucher auf der Messe zu erleben sein. Auf einem
		gro&szlig;en Stand wird die Ausstattung er Game-Show
		nachgebildet und das Publikum zum mitspielen
		eingeladenprickelnde Live-ShowAtmosph&auml;re garantiert.<BR>
		</P>

		<H4>Microprose:</H4>
		<P>
		Show, Action und Sid Meier.<BR>
		<BR>
		Microprose ist in diesem Jahr sogar mit zwei St&auml;nden
		vertreten, W&auml;hrend auf dem Show-Stand die Besucher die
		hervorragenden Spiele von Microprose vorgef&uuml;hrt bekommen
		und selbst testen k&ouml;nnen, geht auf dem Action-Stand die
		Post ab. Bei Gewinnspielen treten mehrere Spieler in
		Modemlink-System gegeneinander an.<BR>
		<BR>
		Als Deutschlandpremiere gilt der Auftritt von Microprose
		bekanntestem Spieleprogrammierer und -designer Sid Meier. Meier
		entwarf gleich mehrere Tophits wie beispielsweise Silent
		Service, Civilisation, Pirates Gold.<BR>
		</P>

		<H4>ICP und Pro Concept:</H4>
		<P>
		Gewinnspiel, Aktionen.<BR>
		<BR>
		Auch die Veranstalter f&uuml;hren in diesem Jahr wieder
		Gewinnspiele durch. Als Gewinne warten eine bunte Mischung aus
		mehreren hundet-Spielen f&uuml;r Consolen oder Computer, sowie 3
		Archimedes 3010-Computer und ein RISC-PC von Arcon.<BR>
		<BR>
		Ebenso ist das Publikum wieder sportlich gefordert: beim
		Freeclimbing, das hei&szlig;t beim Klettern an einer
		nachgebauten Felswand, nat&uuml;rlich gut gesichert, aber
		trotzdem nicht ohne Nervenkitzel. Bis auf 7 Meter H&ouml;he
		mu&szlig; man kommen, wer die Glocke anschalgen will, deren
		Schlag den Sieg &uuml;ber die T&uuml;cken der Freeclimber-Wand
		anzeigt.<BR>
		</P>

		<H4>GEWINNE</H4>
		<P>
		Gewinne im Wert von etwa einer Viertelmillion Mark stehen bei
		unterschiedlichen Gewinnspielen f&uuml;r die Besucher bereit.
		Das d&uuml;rfte die h&ouml;chste Gewinnsumme sein, die je auf
		einer Messe in Deutschland ausgespielt wurde.<BR>
		<BR>
		Und mitmachen kann jeder. Die Spiele sind von unterschiedlicher
		Natur: Von Geschicklichkeitsspielen, bei denen erfahrene
		Computerspieler sicherlich Vorteile haben, bis zu Verlosungen,
		die jedem die gleiche Chance zusichern, ist alles dabei.<BR>
		</P>

		<H4>SEMINARE</H4>
		<P>
		Neben den Informationen von den Ausstellern f&uuml;hren die
		Veranstalter wieder kostenlose Seminare durch. In einem eigens
		ausgestatteten und speziell aufgebauten Bereich k&ouml;nnen die
		Besucher an allen drei Messetagen an kostenlosen Seminaren
		teilnehmen. Die Themen sind unter anderem: CD-ROM, DF&Uuml;
		f&uuml;r Anwender, VIDEO und weitere.<BR>
		</P>

		<BR>
		<TABLE ALIGN="CENTER" SUMMARY="Information" BORDER="1" CELLPADDING="5" WIDTH="450">
		<TR>
		    <TD>Ort:</TD>
		    <TD>K&ouml;ln</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Messegel&auml;nde</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Halle 10 und 11</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>(max. 19.000 qm Ausstellungsfl&auml;che)</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Termin:</TD>
		    <TD>4.-6. November 1994</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>(Freitag bis Sonntag)</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>&Ouml;ffnungszeiten:</TD>
		    <TD>9-18 Uhr</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Ziel:</TD>
		    <TD>Information/Beratung</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Verkauf von Produkten</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Vorstellung neuer Produkte</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Unterhaltung/Entertaiment</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Zielgruppe:</TD>
		    <TD>Interessenten, Kaufwillige Besitzer</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>von Computern und Spielekonsolen</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Anbieter:</TD>
		    <TD>Hard- und Software, Peripherie,</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Verlage, Entertainment</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Eintrittspreise:</TD>
		    <TD>Sch&uuml;ler/Studenten DM 15,-</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>Erwachsene DM 20,-</TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD></TD>
		</TR>
		<TR>
		    <TD>Ausstellerzahl:</TD>
		    <TD>ca. 200-250 Anbieter (weltweit)</TD>
		</TR>
		</TABLE>

		<P>
		ICP-Verlag, Hr. Brandl, Postfach 1143, D-85587 Vaterstetten/Mchn.<BR>
		<BR>
		Weitere Informationen k&ouml;nnt ihr nat&uuml;rlich auch bei uns,<BR>
		APC&amp;TCP, Dorfstra&szlig;e 17, D-83236 &Uuml;bersee, 08642/899953,<BR>
		E-Mail: APC&amp;TCP@HIGHVOLT.gun.de, ANDREAS@HIGHVOLT.gun.de<BR>
		erhalten oder in unserer Mailbox HIGH VOLTAGE<BR>
		Zyx: 08642/1336 ISDN: 08642/899952 beziehen.<BR>
		<BR>
		Au&szlig;erdem managen wir auch noch Fahrgemeinschaften zur Messe.<BR>
		<BR>
		Das ganze funktioniert so:<BR>
		<BR>
		Ihr schickt uns eine Nachricht die folgendes beinhaltet:<BR>
		<BR>
		Vorname/Name:<BR>
		Stra&szlig;e/Nr   :<BR>
		Plz/Ort     :<BR>
		Telefonnr.  :<BR>
		E-Mail      :<BR>

		(&nbsp;) Ich fahre selbst rauf uns suche Mitfahrer.<BR>
		(&nbsp;) Ich suche eine Mitfahrgelegenheit.<BR>
		<BR>
		Das ganze dann an uns abschicken!<BR>
		<BR>
		Die Informationen werden alle in einer Datenbank gespeichert.<BR>
		Diese Datenbank kann dann jeder von uns haben. So bekommt man
		Adressen von Usern die mitfahren wollen bzw. von Usern die
		Mitfahrer suchen. Auf diese Art und weise k&ouml;nnt ihr Euch
		die Fahrtkosten teilen. W&auml;re ja auch ideotisch mehrere
		hundert Km alleine im Auto zu fahren!<BR>
		<BR>
		Die Eintrittskarten gibts bei uns nat&uuml;rlich auch.
		(Clubmitglieder erhalten einen Rabatt).<BR>
		<BR>
		Also wenn Fragen offen sein sollten, dann ruft uns einfach
		einmal an!<BR>
		</P>
		<BR>
		</TD>
	    </TR>
	    </TABLE>

<!Innere Tabelle>

	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="smt.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#smt0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
