<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Star Treck Central</TITLE>
    </HEAD>

    <BODY TEXT="#A0A0A0" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="sta0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="sta.html" ALT="zur&uuml;ck">
	</MAP>
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#404040">
	<TR>
	    <TD><IMG SRC="sta.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#sta0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <TABLE ALIGN="CENTER" WIDTH="570" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#000000">
	    <TR>
		<TD BGCOLOR="#404040" ALIGN="CENTER"><IMG SRC="sta01a.png" ALT="Bild1"></TD>
	    </TR>
	    <TR>
		<TD>
		<P>
		Ihr sucht einen Star Trek Fan Club ?<BR>
		Ihr sucht Kost&uuml;me von der Star Trek Crew ?<BR>
		Ihr wollt Informationen mit anderen austauschen ?<BR>
		<BR>
		Ihr bekommt alles !<BR>
		Wo ?<BR>
		<BR>
		Im STAR TREK CENTRAL EUROPE Club !<BR>
		<BR>
		Ich schreibe mal das Werbeheftchen von diesem Club mal ab !<BR>
		Der Club ist einfach fantastisch und jeder Trekkie sollte
		ihn sich mal genauer anschauen !!<BR>
		<BR>
		Hier nun der Texte aus dem Werbeheftchen :<BR>
		<BR>
		Hallo Freunde von Star Trek.<BR>
		<BR>
		WO...  Bekomme ich aktuelle News, Hintergrundberichte, Fotos
		    und weitere Informationen aus der Star Trek Welt ?<BR>
		<BR>
		WIE... Bekomme ich Kontakt zu anderen Star Trek Fans,
		    die mit mir mein Hobby teilen ?<BR>
		<BR>
		Das sind Fragen, die man sich las STAR TREK Fan stellt und
		f&uuml;r die wir eine L&ouml;sung gefunden haben, den<BR>
		</P>

		<CENTER><STRONG>STAR  TREK  CENTRAL  EUROPE</STRONG></CENTER><BR>

		<P>
		Wir der STAR TREK CENTRAL EUROPE, 1978 gegr&uuml;ndet und somit der
		&auml;lteste STAR TREK Fanclub in Deutschland haben es uns zum obersten
		Ziel gesetzt, den Kontakt zwischen den STAR TREK Fans zu f&ouml;rdern
		und sie mit dem aktuellen Geschehen zu versorgen.<BR>
		<BR>
		Jeder kann, wenn er m&ouml;chte, sich aktiv an der Gestaltung des
		Clublebens bteiligen, sei es mit Beitr&auml;gen f&uuml;r unsere Clubzeitung
		TREKWORLD, die 4 mal im Jahr im besten Offset Druck mit gerasterten
		Fotos und Vierfarbcover erscheint, oder bei der Planung und
		Organisation unserer Cons.<BR>
		<BR>
		Wir sind mittlerweile eine Gemeinschaft von &uuml;ber 2500 Mitgliedern
		in der ganzen Welt und haben zahlreiche Ehrenmitglieder wie z.B.:
		James Doohan, Mark Leonard, Walter Koenig, John de Lancie und
		George Takei, um nur einige zu nennen.<BR>
		<BR>
		Unsere Kontakte sind hervorragend. Mitglieder unserer Fangemeinde
		helfen bei der deutschen Synchronisation von "Raumschiff Enterprise
		das n&auml;chste Jahrhundert" oder der neuen Serie "Deep Space Nine"
		mit, wir unterst&uuml;tzen Fernsehen und Printmedien in einer
		glaubhaften Darstellung des Themenbereichs Star Trek
		(insbesondere hier die des Star Trek Fans, die ja mitunter in der
		&Ouml;ffentlich noch etwas bel&auml;chelt wird).<BR>
		<BR>
		Wenn Du m&ouml;chtest, w&uuml;rden wir Dich gerne in unsere STAR TREK
		Familie aufnehmen.</P>

		<P ALIGN="CENTER">
		STAR TREK LEBT UND WIR WOLLEN;<BR>
		DAS ES AUCH WEITERHIN SO BLEIBT !!!<BR>
		<BR>
		LIVE LONG AND PROSPER<BR>
		<BR>
		Star Trek Central Europe<BR>
		Dirk Bartholom&auml;<BR>
		Postfach 22 01 11<BR>
		86181 Augsburg<BR>
		<BR>
		<BR>
		Bankverbindung<BR>
		Stadtsparkasse Augsburg<BR>
		STCE / Dirk Bartholom&auml;<BR>
		Konto: 044 67 08<BR>
		BLZ: 720 500 00</P>

		<H3 ALIGN="CENTER">TREKWORLD</H3>

		<P>
		Die TREKWORLD ist unsere Clubzeitung, die 4-6 mal im Jahr mit
		einem Umfang von ca. 160 Seiten in bestem Offset Druck mit
		gerasterten Fotos erscheint. Jedes Heft hat je nach Aktualit&auml;t
		einen anderen Schwerpunkt - nicht Einfalt, sondern Vielfalt ist
		unsere Devise. Wir berichten &uuml;ber STAR TREK IV (CLASSIC), STAR
		TREK KINOFILME, STAR TREK THE NEXT GENERATION und auch
		regelm&auml;&szlig;ig &uuml;ber eine geplante 4. STAR TREK Serie. Au&szlig;erdem gibt
		es noch Stories, Hintergrundberichte, massenhaft Infos, Interviews,
		Technik,  Zeichnungen,   Conberichte,  Buchbesprechungen,
		Episoden   &Uuml;bersichten,   Leserbriefe,   Fotos,   seltene Bilder,
		Conkalender,  Adressen  von  Stammtischen,   Kleinanzeigen
		(kostenlos), Ratschl&auml;ge und einiges anderes mehr.
		Seit kurzem ist es uns durch die hohen Mitgliedszahlen m&ouml;glich,
		die Titelbilder der Trekworlds in professionellem VIERFARB DRUCK zu
		produzieren. Wir drucken aber in erster Linie Eigenproduktionen
		unserer Clubk&uuml;nstler ab, wie etwa Airbrush Gem&auml;lde oder
		Computeranimationen.</P>

		<H3 ALIGN="CENTER">TREKDINNER</H3>

		<P>
		Mittlerweile, finden in &uuml;ber 35 deutschen St&auml;dten sogenannte
		Trekdinners (Stammtische) statt. Dort treffen sich die
		ortsans&auml;ssigen Trekkies einmal bis zweimal im Monat zu einem
		gem&uuml;tlichem Zusammensein bei Speis und Trank. Die Adressen
		der Trekdinner findet ihr in jedem Trekworld.</P>

		<H3 ALIGN="CENTER">CONVENTIONS</H3>

		<P>
		Ein bis zweimal im Jahr finden unsere Conventions statt. Sie dauern
		meist zwischen 4 und 7 Tagen und bieten ein sehr  vielseitiges
		Programm: Neben STAR TREK Filmen, Spielen, Tauschb&ouml;rse, STAR
		TREK Marsch wird auch die Gem&uuml;tlichkeit gro&szlig; geschrieben, bei
		Room Partys, Kerzenabend, und Nachtwanderund. Au&szlig;erdem gibt
		es noch alle 1-2 Jahre die gro&szlig;en FEDERATION CONS, wo ca. 400
		Fans ein Wochenende lang einen Schauspieler von STAR TREK
		kennenlernen k&ouml;nnen.  Dieser beantwortet Fragen,  gibt
		Autogramme und l&auml;&szlig;t sich zusammen mit den Fans fotographieren.
		Au&szlig;erdem gibt es an diesem gro&szlig;en Cons Videovorf&uuml;hrungen auf
		Gro&szlig;leinwand, H&auml;ndlerr&auml;ume, Disco, Kost&uuml;mpr&auml;mierung u.v.a.m.</P>

		<H3 ALIGN="CENTER">SHOPSERVICE</H3>

		<P>
		Im Shopservice, den unserer Michael Eberhardt leitet, k&ouml;nnt ihr
		alles m&ouml;gliche &uuml;ber STAR TREK erstehen (Videos, Baus&auml;tze, T-Shirts,
		Spielzeug, CD&#180;s, Kost&uuml;mzubeh&ouml;r, Schnittmuster, Figuren, B&uuml;cher,
		Kurioses etc. etc.). Einkompletter Katalog mit zahlreichen
		Abbildungen wird jedem Neumitglied zusammen mit der ersten
		Trekworld zugeschickt!</P>

		<H3 ALIGN="CENTER">MITGLIEDSBEITRAG</H3>

		<P>
		F&uuml;r den Clubbeitrag bekommt ihr in erster Linie die
		Clubzeitschrift TREKWORLD, au&szlig;erdem gibt es noch einen
		Clubausweis. Vom Clubbeitrag werden nat&uuml;rlich auch s&auml;mtliche
		Unkosten, wie z.B.: Druckkosten, Porto- und Versandkosten,
		Rasterungen,Fotos,Briefpaier, B&uuml;robedarf etc. gedeckt.
		F&uuml;r nur 43,-- DM Clubbeitrag, (Ausland 50,00 DM) bekommt ihr
		4 TREKWORLDS (&uuml;ber 650 Seiten Lesestoff)  und  den
		Clubausweis.Um Euch und uns Laufereien und unn&ouml;tigen Stre&szlig;
		zu ersparen, nutzt bitte am besten den vorteilhaften Bankeinzug,
		den ihr jeder Zeit wiederrufen k&ouml;nnt.<BR>
		<BR>
		Mitglieder mit Bankeinzug, und solche die mit Bargeld bezahlen
		(falls sie kein eigenes Konto haben) bekommen SOFORT nach
		Erhalt der Beitrittserkl&auml;rung die neueste TREKWORLD zugeschickt.
		Mitglieder, die auf das Konto &uuml;berweisen, ca. 2-3 Wochen
		sp&auml;ter (wir m&uuml;ssen erst abwarten, bis die &Uuml;berweisung auf
		dem Konto sind und dann kontrollieren!).<BR>
		<BR>
		Mitglieder aus dem Ausland zahlen am besten in bar als
		Einschreiben oder per Euroscheck, da   bei   einer
		Bank&uuml;berweisung sehr hohe Bankpesen anfallen!<BR>
		<BR>
		<BR>
		Ende des Heftchens !<BR>
		<BR>
		WAU ! Endlich! 45 Minuten das eine Heftchen abgeschrieben !<BR>
		Aber es lohnt sich! Nicht f&uuml;r mich, aber f&uuml;r euch !<BR>
		Werdet Mitglied ! Meiner Meinung nach der aktuellste und beste
		(Deutsche) Star Trek Club !<BR>
		Ich m&ouml;chte nochmal VERSICHERN da&szlig; ICH KEIN GELD VON STAR TREK
		CENTRAL EUROPE oder irgendwoanders her GELD f&uuml;r diese "Werbung"
		bekomme !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!<BR>
		<BR>
		<BR>
		Marcel D&ouml;ring<BR>
		Lettigkautweg 33<BR>
		60599 Frankfurt am Main<BR>
		<BR>
		Gr&uuml;&szlig;e gehen an:<BR>
		Andreas Magerl ,Christian Heitzer ,Willi Hillenbrand
		und Martin Dreisbach<BR>
		</P>
		<BR>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    <BR>
	    </TD>
	<TR>
	    <TD><IMG SRC="sta.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#sta0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
