<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Raumschiff Pfannekuchen - Angriff der Spaghetti</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="str0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="str.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
	<TR>
	    <TD><IMG SRC="str.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#str0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
<!Innere Tabelle>
	    <TABLE BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#404040" WIDTH="95%" ALIGN="CENTER">
	    <TR>
		<TD>
		<TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" CELLSPACING="0" SUMMARY="" BGCOLOR="#000000" WIDTH="600">
		<TR>
		    <TD>
		    <H4 ALIGN="CENTER">Raumschiff Pfannekuchen - Angriff der Spaghetti<BR>
		    ***********************************************</H4>
		    <P><FONT COLOR="F0F0F0">
		    "Der Obstkuchen. Unendliche Birnen und &Auml;pfel. Wir
		    essen die Torte im Jahre 2300 mit Rosinen und Schlagsahne.
		    Immer auf der Suche nach neuen Fr&uuml;chten und
		    Tortenb&ouml;den, ist das Raumschiff "Pfannekuchen"
		    unterwegs, um auch andere Nahrungsmittel zu erforschen und
		    nutzbar zu machen!" Viele Negerk&uuml;sse von der Erde
		    entfernt erlebt die Besatzung der "Pfannekuchen" Abenteuer,
		    die nie eine Quarktasche vorher erlebt hat.<BR>
		    <BR>
		    Birnenzeit: 23451.1 Capt.Bulette:<BR>
		    Wir durchfliegen mit der "Pfannekuchen" Kirschensektor
		    Gamma 9. Eine Raumsonde hat uns einen Eindringling gemeldet
		    der den Planeten Erdnussbutter angreifen will. Wir wissen
		    bis jetzt nicht wer die Eindringlinge sind. Aber wir
		    m&uuml;ssen alles versuchen um die Eroberung des Planeten
		    Erdnussbutter zu verhindern, da dieser unsere gesamten
		    Reserven an &Ouml;lsardienen hat. Die Crew ist vorbereitet,
		    ich habe Alarm lila gegeben!<BR>
		    <BR>
		    "Mr.Whopper, schon irgendwelche Zeichen des feindlichen
		    Schiffes gescant?"<BR>
		    <BR>
		    "Nein Captain. Ich justiere noch die Brotkr&uuml;mmel im
		    System...Moment, ich bemerke eine Puddingspur auf Kurs
		    77343,2. Diese Spur ist ist mit keiner uns bekannter
		    Schiffsbauart identisch. Es k&ouml;nnte der Feind sein..."<BR>
		    <BR>
		    "Gut Mr.Whopper. F&auml;hnrich Gr&auml;&szlig;lich setzten
		    Sie Kurs!"<BR>
		    <BR>
		    "Aye, aye, Captain....Kurs gesetzt!"<BR>
		    <BR>
		    "Geschwindigkeit: Waffel 3...Energie!"<BR>
		    <BR>
		    Birnenzeit:23452.3 Capt.Bulette:<BR>
		    Wir sind auf den Weg das feindliche Raumschiff abzufangen.<BR>
		    Was wird uns erwarten?<BR>
		    Inzwischen habe ich Lt.LaK&auml;se den Befehl gegeben die
		    Engergie der "Pfannekuchen" auf alle Schilde und Waffen zu
		    verlegen. Er teilte mir mit, da&szlig; die Systeme zu 85%
		    einsatzbereit sind. Machmal frage ich mich wirklich wie
		    dieser Mann mit soviel Schokolade im Gesicht, es immer
		    wieder schaft, die "Pfannekuchen" so in Schu&szlig; zu halten.<BR>
		    Ich bin froh, da&szlig; er zu meiner Crew geh&ouml;rt.<BR>
		    <BR>
		    "Capt.Bulette, wir sind jetzt in Abfangreichweite des
		    feindlichen Schiffes. M&ouml;chten Sie visuellen Kontakt zu dem
		    Raumschiff?"<BR>
		    <BR>
		    "Ja Mr.Gr&auml;&szlig;lich. Auf den Bildschirm!"<BR>
		    <BR>
		    "Sir, es ist ein Raumschiff der Spaghetti. Nach meinem Scan
		    sind ihre Waffen einsatzbereit, ich schlage vor das Feuer
		    zu er&ouml;ffnen!"<BR>
		    <BR>
		    "Nein, Mr. Whopper. Stellen Sie Kontakt zu den Spaghettis
		    her. Ich m&ouml;chte erst wissen ob sie zu Verhandlungen bereit
		    sind!"<BR>
		    <BR>
		    "Captain! Das Schiff f&uuml;hrt als Bewaffnung Ketchup-Torpedos.<BR>
		    Wir sind kaum in der Lage diese lange standhalten zu
		    k&ouml;nnen. Ich rate zur Vorsicht!"<BR>
		    <BR>
		    "Danke, Mr. Gr&auml;&szlig;lich. Aber nach allen was ich
		    &uuml;ber diese Spaghetti geh&ouml;rt habe greifen sie erst
		    an, wenn sie provziert werden!"<BR>
		    <BR>
		    "Welcher Art von Provokation?"<BR>
		    <BR>
		    "Nun, Cmdr Meika, sie haben etwas gegen Spaghetti mit Speck
		    und Zwiebeln. Wenn Sie das in deren Gegenwart ansprechen,
		    werden sie agressiv und verlieren jede Beherrschung. Daher
		    sollten wir strikt vermeinden &uuml;ber Zwiebeln und Speck zu
		    sprechen!"<BR>
		    <BR>
		    "Ich habe verstanden, Captain!"<BR>
		    <BR>
		    "Sir, Geruchssequenzen offen!"<BR>
		    <BR>
		    "Danke Mr. Whopper!<BR>
		    Hier ist das Milchraumschiff "Pfannekuchen". Ich bin
		    Captain Bulette. Sie befinden sich in unserem Gebiet.<BR>
		    Nennen Sie mir Ihren Grund Ihres Hierseins!"<BR>
		    <BR>
		    "Captain, wir empfangen jetzt ein visuelles Bild der
		    Spaghetti!"<BR>
		    <BR>
		    "Auf den Schirm, Mr.Gr&auml;&szlig;lich!"<BR>
		    <BR>
		    "Sie sehen sehr quirlig im Gesicht aus, Captain. Glauben
		    Sie man kann mit ihnen verhandeln?"<BR>
		    <BR>
		    "Mr.Meika, wenn Sie st&auml;ndig Nudeln im Gesicht
		    h&auml;tten, glauben Sie, da&szlig; Sie nicht irgendwann
		    mal was anderes auf den Teller wollen? Das wird garantiert
		    der Grund sein, warum sie den Planeten Erdnussbutter
		    angreifen wollen. Sie sind scharf auf was Neues...auf
		    &Ouml;lsardienen. Und sie wissen, da&szlig; wir es niemals
		    zulassen werden unsere Reserven freizugeben. Es wird schwer
		    werden sie davon zu &uuml;berzeugen. Ich hoffe, es geht
		    gewaltlos!"<BR>
		    <BR>
		    "Mein Name ist Fischgr&auml;te, ich bin Captain des Schiffes
		    "Macaroni". Ich fordere sie auf uns umgehend den Weg frei
		    zu machen, oder wir ketchupen Sie..."<BR>
		    <BR>
		    "Captain Fischgr&auml;te, sollten wir lieber nicht versuchen
		    erstmal rauszukriegen, warum Sie hier sind? Vielleicht
		    k&ouml;nnen wir das Problem ja gemeinsam l&ouml;sen!<BR>
		    <BR>
		    "Einverstanden, Capatain. Ich schlage vor, da&szlig; wir uns auf
		    Ihrem Schiff treffen und dort alles weitere besprechen, ich
		    bringe meinen ersten Offezier Musbirne mit."<BR>
		    <BR>
		    "Einverstanden, in 10 Mintuten an Bord meines Schiffes! Mr.
		    Whopper Geruchssquenzen wieder schlie&szlig;en!"<BR>
		    <BR>
		    "Aye, Sir!"<BR>
		    <BR>
		    "Counselor Wei&szlig;alles, was k&ouml;nnen Sie mir
		    &uuml;ber das Empfinden dieses Wesen sagen?"<BR>
		    <BR>
		    "Nun, sie ist sehr konsequent. Ich rate zur Vorsicht. Das
		    Wort "Speck" w&uuml;rde ich in jedem Falle vermeiden, darauf
		    reagiert sie am agressivsten. Aber ich glaube sie ist zu
		    Verhandlungen bereit, wenn auch nur unter Vorbehalt.<BR>
		    <BR>
		    "Mr. Whopper, LaK&auml;se und Counselor Wei&szlig;alles,
		    sie begleiten mich in den Gem&uuml;seraum unsere G&auml;ste
		    zu empfangen.<BR>
		    Cmdr.Meika, Sie &uuml;bernehmen die Br&uuml;cke."<BR>
		    <BR>
		    Birnenzeit: 23458.3 Capt.Bulette:<BR>
		    Wir haben unsere G&auml;ste an Bord unsere Schiffes gepudert.<BR>
		    Diese Wesen sehen sehr hm..interessant aus. Sie tragen
		    Tomaten in den Haaren und an ihren H&auml;nden sind
		    gro&szlig;e Nudell&ouml;ffel befestigt. Ihre Kleidung
		    besteht haupts&auml;chlich aus roten Sabberl&auml;tzchen
		    und an ihren G&uuml;rteln tragen sie Ketchup-Phaser. Eine
		    der schlimmsten Handfeuerwaffen im Universum. Ich habe
		    f&uuml;r unsere G&auml;ste im Konferenzraum eine
		    gro&szlig;e Sch&uuml;ssel Spaghetti bereitgestellt,
		    nat&uuml;rlich ohne Zwiebeln und Speck.<BR>
		    <BR>
		    "Captain Fischgr&auml;te, ich freue mich sie an Bord meines
		    Schiffes begr&uuml;&szlig;en zu d&uuml;rfen, f&uuml;hlen
		    Sie sich wie zu Hause!"<BR>
		    <BR>
		    "Danke, Captain Bulette. Und vielen dank f&uuml;r die Spaghetti,
		    ich sehe, Sie sind mit unseren Sitten vertraut."<BR>
		    <BR>
		    "Das ist doch wohl das Mindeste was wir f&uuml;r Sie tun
		    k&ouml;nnen.<BR>
		    Nun, ich denke, wir sollten dar&uuml;ber sprechen, was Sie
		    herf&uuml;hrt!"<BR>
		    <BR>
		    "Captain, wir wollen ihren gesamten Vorrat an &Ouml;lsaerdienen.<BR>
		    Sie und ich wissen, das er auf Planet Erdnussbutter ist.<BR>
		    Machen Sie uns keine Schwierigkeiten. Dann k&ouml;nnte ein Krieg
		    vermieden werden."<BR>
		    <BR>
		    "Wir k&ouml;nnen Ihnen auf gar keinen Fall die &Ouml;lsardienen
		    &uuml;berlassen. Sie sind unsere Energiereserven, das sollten
		    Sie wissen. Wir m&ouml;chten keinen Kampf, aber wir sind bereit
		    alles zu tun um den Planeten Erdnussbutter zu verteidigen.<BR>
		    Aber wir k&ouml;nnen Ihnen unseren Vorrat an Thunfisch
		    anbieten..."<BR>
		    <BR>
		    "Dann ist unsere Verhandlung hiermit beendet, wir werden
		    uns umgehend auf unser Schiff zur&uuml;ckpudern und das Feuer
		    er&ouml;ffnen, kommen Sie Cmdr. Musbirne."<BR>
		    <BR>
		    "Ja, My Lord!"<BR>
		    <BR>
		    Birnenzeit:23455.4 Capt.Bulette<BR>
		    Die Spaghetti kehrten auf ihr Schiff zur&uuml;ck. Ich
		    veranla&szlig;te sofort die Schilde aufzubauen und die
		    Eier-B&auml;nke zu aktivieren. Wir mu&szlig;ten uns nun auf
		    einen schweren Kampf vorbereiten.<BR>
		    <BR>
		    "Captain, die Spaghetti feuern mit Ketchup auf uns."<BR>
		    <BR>
		    "Lt.Whopper, sind die Schilde oben?"<BR>
		    <BR>
		    "Ja, Sir!"<BR>
		    <BR>
		    (Klatsch)<BR>
		    <BR>
		    "Sir, die Schilde sind v&ouml;llig mit Ketchup verklebt, wir
		    haben noch 60% Energie f&uuml;r die Schilde"!<BR>
		    <BR>
		    "Lt.Whopper, er&ouml;ffnen Sie das Feuer. 20 Eier vor den Bug!"<BR>
		    <BR>
		    "Aye, Sir!"<BR>
		    <BR>
		    (Klatsch Klatsch)<BR>
		    <BR>
		    "Sir, mehrere Treffer an ihren Sekund&auml;rschilden, kaum
		    Sch&auml;den!"<BR>
		    <BR>
		    "Mr.Gr&auml;&szlig;lich, berechnen Sie einen neuen Kurs um der
		    n&auml;chsten Angriffswelle auszuweichen!"<BR>
		    <BR>
		    "Aye, Sir!"<BR>
		    <BR>
		    "Mr.Whopper, feuern Sie 60 Salatk&ouml;pfe auf ihren Antrieb, in
		    dem Moment, wenn wir auf den neuen Kurs gehen!"<BR>
		    <BR>
		    "Sir, sie schie&szlig;en mit Tortenb&ouml;den auf uns.....!"<BR>
		    <BR>
		    "Mr.Gr&auml;&szlig;lich, gehen Sie sofort auf den neuen Kurs, Mr.
		    Whopper, Feuer!"<BR>
		    <BR>
		    (Klatsch Klatsch Klatsch)<BR>
		    <BR>
		    "Sir, wir haben neuen Kurs erreicht, wurden aber noch von
		    mehren Tortenb&ouml;den getroffen!"<BR>
		    <BR>
		    "Captain, schwere Sch&auml;den auf den Abteilungen: Rosenkohl,
		    Scampis und Puderzucker..au&szlig;erdem wurde unser Waffelantrieb
		    besch&auml;digt!"<BR>
		    <BR>
		    "Mr.LaK&auml;se, informieren Sie die G&auml;rtner, Fischer
		    und B&auml;cker.....<BR>
		    sie sollen mit den Reperaturarbeiten sofort beginnen!"<BR>
		    <BR>
		    "Sofort Captain!"<BR>
		    <BR>
		    "Captain, ich schlage vor unsere neue Geheimwaffe
		    einzusetzten, damit k&ouml;nnten wir sie au&szlig;er
		    Gefecht setzten!"<BR>
		    <BR>
		    "Nein, Mr.Whopper..niemals. Diese neue Waffe ist so
		    schrecklich, das k&ouml;nnen wir nicht verantworten, diese
		    bedauernswerten Wesen w&auml;ren sofort Kampfunf&auml;hig,
		    vielleicht sogar vernichtet..wir m&uuml;ssen uns etwas
		    anderes ausdenken"!<BR>
		    <BR>
		    "Captain, eine weitere Angriffswelle folgt, laut Computer
		    torpedieren sie uns mit Tomatenmark!"<BR>
		    <BR>
		    "Mr.Whopper feuern Sie sofort mit Oliven zur&uuml;ck,
		    vielleicht k&ouml;nnen wir einen Gegendruck erzeugen, so,
		    da&szlig; uns das Tomatenmarkt nicht mehr erreicht!"<BR>
		    <BR>
		    "Ich feuere...Treffer..100% des Tomatenmarks wurde
		    abgehalten. Aber daf&uuml;r ist unser Vorrat an Oliven zu ende.<BR>
		    Einen n&auml;chsten Beschu&szlig; werden uns unsere Schilde
		    kosten!"<BR>
		    <BR>
		    Birnenzeit: 23343.9 Capt.Bulette:<BR>
		    Die Lage scheint aussichtslos. Lt.Whopper empfahl die neue
		    Geheimwaffe zu benutzen, aber d&uuml;rfen wir das wirklich?<BR>
		    Mein Gewissen plagt mich, ich habe nicht mal mehr Appetit
		    auf meine H&uuml;hnersuppe. Was sollen wir blo&szlig; tun?<BR>
		    <BR>
		    "Lt.Whopper, Geruchssequenzen aktivieren. Schiff an Schiff!"<BR>
		    <BR>
		    "Sie k&ouml;nnen sprechen,Sir!"<BR>
		    <BR>
		    "Captain Fischgr&auml;te. H&ouml;ren Sie sofort mit den
		    Angriffen auf. Oder wir sind gezwungen unsere neue Waffe
		    auf Sie anzuwenden, ich kann Ihnen garantieren, es wird
		    schrecklich..Lassen Sie uns doch vern&uuml;mpftig
		    miteinander reden...!"<BR>
		    <BR>
		    "Captain Fischgr&auml;te an Capt.Bulette: Niemals, entweder
		    ihre &Ouml;lsardienen oder Tot f&uuml;r alle!"<BR>
		    <BR>
		    "Captain, Verbindung wurde abgebrochen!"<BR>
		    <BR>
		    "Sir, wir haben keine Wahl mehr, er&ouml;ffnen Sie endlich mit
		    der neuen Waffe das Feuer, oder wir sind alle tot!"<BR>
		    <BR>
		    "Na gut, Cmdr.Meika...Mr. Whopper, aktivieren Sie die Waffen.<BR>
		    Mr. Gr&auml;&szlig;lich, Ausweichman&ouml;ver vorbereiten
		    um der Druckwelle zu entgehen.<BR>
		    Mein Gott...was tun wir hier? Das ist ja Wahnsinn!!<BR>
		    Mir Whopper..feuern Sie 1000 Kilo Speck und 5000 Kilo
		    Zwiebeln ab..Feuer!!<BR>
		    <BR>
		    (Wusch Wusch Wusch...Wisch Wisch Wisch...Klatsch Klatsch
		    Klatsch)<BR>
		    <BR>
		    "Captain, volle Treffer..alle Schilde der Spaghetti sind
		    verschwunden.<BR>
		    Schwere Treffer auf all ihren Decks..empfange Nachricht!"<BR>
		    <BR>
		    "Mr. Whopper, Geruchssequenzen aktivieren!"<BR>
		    <BR>
		    "Aktiviert!"<BR>
		    <BR>
		    "Cap..Captain..Bul..Bulette..Sie hinterh&auml;ltiger
		    Fleischklopps..Sie haben meine Manschaft auf den Gewissen.<BR>
		    Wir ersticken hier in Zwiebeln und Speck...Sie..Sie
		    M..M&ouml;rder..!"<BR>
		    <BR>
		    "Sie haben uns keine andere Wahl gelassen...verlassen Sie
		    auf der Stelle unseren Kirschsektor, oder wir entkernen
		    Sie...ich gebe Ihnen 1 Minute Zeit...Bulette..Ende!"<BR>
		    <BR>
		    "Captain, das Schiff dreht ab..es verl&auml;&szlig;t
		    unseren Sektor..!"<BR>
		    <BR>
		    "Gut Cmdr.Meika! ...Mr. Gr&auml;&szlig;lich, Kurs setzen auf
		    Sahnetorte 12...Mr.LaK&auml;se was macht der Waffelantrieb?"<BR>
		    <BR>
		    "Sir, wieder OK, Sie haben 90% Energie zu Verf&uuml;gung...!"<BR>
		    <BR>
		    "Hervorragend...Mr.Gr&auml;&szlig;lich..Waffel 9....Energie!"<BR>
		    <BR>
		    Birnenzeit:24434.0 Capt.Bulette:<BR>
		    Wir haben unsere Mission erf&uuml;llt, der Angriff wurde
		    abgewehrt. Und wieder einmal wurde bewiesen, da&szlig; der
		    menschliche Intellekt den der anderen &uuml;ber ist. Doch wir
		    m&uuml;ssen auf der Hut sein. Viele Wesen im All wollen uns in
		    die Suppe spucken..aber solange wir Speck und Zwiebeln
		    haben, werden wir immer unbesiegbar bleiben. Und vielleicht
		    wird das auch eines Tages diese Spaghetti-Rasse
		    begreifen..vielleicht..!!!<BR>
		    <BR>
		    </P>
		    <P ALIGN="RIGHT">Ende...Ende?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</P>
		    <P>
		    (c) By ZOMBIE<BR>
		    <BR>
		    Viele Gr&uuml;&szlig;e<BR>
		    Zombie...<BR></FONT></P>
		    </TD>
		</TR>
		</TABLE>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
<!Innere Tabelle>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="str.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#str0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
