<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
    <TD>
    <MAP NAME="tls0">
    <AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
    </MAP> 
    <TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#A0A0A0">
    <TR>
	<TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
    </TR>
    <TR>
	<TD>
	<BR>
	<TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#D0C0C0" WIDTH="80%">
	<TR>
	<TD>
	<H2 align="center"><B>Testbericht</B></H2>
	<BR>
	<CENTER><P><B>
	Maxon Cinema 4D, Version 1.5                               [Udo Kastilan]<BR>
	-------------------------------------------------------------------------<BR></B>
	</P></CENTER>

	<P>
	Raytracen kann ein wahnsinnig interessantes Hobby sein
	-vorausgesetzt der User verf&uuml;gt &uuml;ber Phantasie und
	massig viel Zeit. Ein hoher Preis f&uuml;r die dazugeh&ouml;rige
	Software geh&ouml;rt aber dank Cinema 4D der Vergangenheit an.
	F&uuml;r rund 220 Dee Emm liegt das Paket samt 335 Seiten
	Handbuch und 4 Disketten auf dem Tisch, bei den Altmeistern
	Imagine und Real3D ist etwa viermal so tief in die B&ouml;rse zu
	greifen. Verd&auml;chtig billig!?<BR> Die Systemanforderungen
	des Programms sind erstaunlich niedrig, es l&auml;uft
	theoretisch auch auf einem A500 mit WB 1.3 und 1.5 Meg Ram. Ob
	es jedoch einen Sinn hat, den armen alten 000er-Prozessor derart
	zu qu&auml;len, steht auf einem ganz anderen Blatt, wer die
	Sache auch nur ansatzweise ernst nimmt, kommt ohne Turbo- und
	FPU-Power, Speicheraufstockung und Festplatte nicht sehr
	weit.<BR>
	<BR>
	Installiert wird systemgetreu per Commo-Installer, wobei drei
	Versionen zur Auswahl stehen: Eine Schnarchversion f&uuml;r
	FPU-freie Systeme, eine Ausgabe passend zum unaufger&uuml;steten
	1200er und ein Turbotracer f&uuml;r 68881 und Konsorten. Wer
	&uuml;ber ein Monitorbildverbesserungssteckmodul verf&uuml;gt,
	darf sich den n&ouml;tigen Treiber gleich dazu installieren.
	Auch an die Merlin hat Maxon gedacht.<BR>
	Der Editor pr&auml;sentiert sich in achtfarbigem OS2/3-Look und
	frei w&auml;hlbarer Aufl&ouml;sung. Fast alle Funktionen lassen
	sich sowohl &uuml;ber die Men&uuml;leiste, als auch &uuml;ber
	nette, kleine Icons abrufen. Ein Klick mit der rechten, statt
	der linken Maustaste &ouml;ffnet vor der Ausf&uuml;hrung ein
	Optionsmen&uuml; f&uuml;r Gr&ouml;&szlig;enangaben und
	&auml;hnliches.<BR>
	Neben den gew&ouml;hnlichen Grundk&ouml;rpern (Dreieck, Kugel,
	W&uuml;rfel, Rechteck, Scheibe, Zylinder, Ring, Pyramide,
	Tetraeder, Ebene, Kegel) stehen auch sogenannte Morph-, Pfad-,
	Verschiebe- (Extrude-), Schraub- (Rotations-) und
	Schichtk&ouml;rper in Zusammenhang mit beliebigen Polygonen zur
	Verf&uuml;gung. Ein besonderer Gag sind die "Fraktalk&ouml;rper"
	f&uuml;r kleine G&ouml;tter: `Es werde eine Berglandschaft!`<BR>
	<BR>
	<IMG SRC="tls02a.png" ALT="Maxon1" BORDER="2">
	<BR>
	<BR>
	3D-Schriftz&uuml;ge zu editieren ist no problem, der Text wird
	am Bildschirm in ein Text-Gadget eingetippt oder &uuml;ber ein
	ASCII-File angemeldet. Zwei Fonts ("Diamant", "Helvetica")
	geh&ouml;ren zum Lieferumfang, Eigenkreationen k&ouml;nnen auch
	verwendet werden - sofern sie in einem bestimmten Format
	vorliegen: Der Dateiname des Buchstaben mu&szlig; seinem
	ASCII-Code entsprechen.<BR>
	Damit die K&ouml;rper nicht pornographisch wirken, k&ouml;nnen
	sie in drei Projektionsarten (flach, zylindrisch oder
	sph&auml;risch) mit vier Texturarten (Farbe, Spiegelung,
	Transparenz und Relief) &uuml;berzogen werden. Jedes beliebige
	IFFBildchen ist als Textur zugelassen, von 1 bis 24 Bitplanes.
	Mit Reliefs lassen sich au&szlig;erordentlich realgetreue
	Effekte erzielen, der Helligkeitsgrad bestimmt dabei die
	Oberfl&auml;chenvertiefung. Eine ganze Sammlung teils
	h&ouml;chst brauchbarer Materialstrukturen liegt bereits bei,
	unter anderem eine "Erde" von Tobias Richter (eine Farb- und
	eine Relieftextur in hoher Qualit&auml;t). Zur &Uuml;berwachung
	der Lage bietet ein spezieller Texturmodus weitere Optionen, wie
	Verschieben, Drehen oder Multibelegung an.<BR>
	<BR>
	Polygone sind die Werkzeuge f&uuml;r komplexe K&ouml;rper
	schlechthin. Mit ihnen lassen sich recht einfach
	Frontfl&auml;chen, Querschnitte oder Konturen von
	Drehk&ouml;rpern definieren. Um einen Punkt zu setzen, mu&szlig;
	die linke Maustaste bei gleichzeitig gedr&uuml;ckter Alt-Taste
	getippt werden. Was etwas umst&auml;ndlich erscheint, hat einen
	entscheidenden Vorteil: Ohne Alt-Taste werden Punkte
	angew&auml;hlt und verschoben. Ein versehentliches Verschieben
	oder Setzen bleibt also aus. Der Editor unterscheidet zwischen
	Linear-, Kubisch-, Akima- und B-Spline-Polygonen. "Echten"
	Kurven steht nichts im Wege. Auch nachtr&auml;gliche Abrundungen
	durch zus&auml;tzliche Unterteilungen mit ausw&auml;hlbarer
	Punktzahl sind in den angesprochenen Formaten m&ouml;glich. Aus
	einem 3-PunkteEck wird somit die elegante Kurve `gebogen`.<BR>
	Die Verwaltung der Objekte ist an das DOS-System mit
	Verzeichnissen (K&ouml;rpergruppen) und Files
	(Einzelk&ouml;rper) angelehnt. Interessant, da&szlig;
	beispielsweise ein Zylinder oder ein frischer Extrude keine
	Einzelk&ouml;rper darstellen, sondern aus Rumpf und Deckeln
	bestehen. Dies hat wesentliche Vorteile: Zum einen ist das
	Objekt schnell ge&ouml;ffnet, indem einfach die Dekkel entfernt
	werden. Zum andern lassen sich so den Deckeln und dem Rumpf
	unterschiedliche Materialien zuweisen. Und wer`s nicht braucht,
	verbindet eben die Einzelteile (dauerhaft!).<BR>
	<BR>
	Realit&auml;tsfanatiker wollen sicherlich nicht auf die "Sonne"
	verzichten: Eine gelbliche Lichtquelle simuliert nach Eingabe
	von Datum, Uhrzeit und Breitengrad den zugeh&ouml;rigen
	Sonnenstand, wobei die positive Z-Achse nach S&uuml;den zeigt.
	Lichtquellen gibt es &uuml;brigens radial, parallel, als Spot,
	unendlich oder mit bestimmter Reichweite.<BR>
	Vier Boolsche Operationen erleichtern die Konstruktion
	durchl&ouml;cherter Gegenst&auml;nde. Zwar werden die Funktionen
	erstaunlich schnell ausgef&uuml;hrt, aber wer vorher nicht
	abspeichert, hat gelegentlich ziemlich verloren. In meiner
	bisherigen Testphase (ca. 2 Monate) geriet das Programm bereits
	zweimal in Absturzlaune, definitiv zweimal zu oft! Aber auch bei
	gl&uuml;cklicher Abbarbeitung der digitalen Fr&auml;s und
	Klebearbeiten sind hin und wieder kleine Fehler zu entdecken,
	&uuml;blicherweise einzelne herausstehende Punkte (was sich
	normalerweise im Punktmodus beheben l&auml;&szlig;t). Solche
	Fehler treten zwar selten auf, schon gar nicht bei einfachen
	Grundk&ouml;rpern, sollten aber irgendwie doch &uuml;berhaupt
	nicht vorkommen!?<BR>
	<BR>
	<IMG SRC="tls02b.png" ALT="Maxon2" BORDER="2">
	<BR>
	<BR>
	Sehr hervorragend pr&auml;sentiert sich dagegen die Option
	"Verformen", mit der m&ouml;glichst stark unterteilte Objekte
	durch f&uuml;nfzehn mathematischen Funktionen (z.B. Cosinus,
	Wurzel(t), S&auml;gezahn,...) in unterschiedlichen Dimensionen
	verzerrt werden k&ouml;nnen. Eine andere Option erm&ouml;glicht
	das Zerknittern von K&ouml;rpern, wodurch beispielsweise der
	Effekt von Kn&uuml;llpapier oder Alufolie h&ouml;chst
	stre&szlig;frei zu erreichen ist.<BR>
	Der Men&uuml;punkt "Zufall" verschiebt und/oder verdreht
	K&ouml;rper, die sich in einer angew&auml;hlten Gruppe befinden,
	nach einem zuf&auml;lligen Muster, dessen Grenzwerte vorgegeben
	werden k&ouml;nnen. Das Handbuch schl&auml;gt als
	Verwendungsbeispiel die Erzeugung eines nat&uuml;rlich verteilt
	wirkenden Waldes vor.<BR>
	Ich pers&ouml;nlich werde diese Funktion wohl nicht so oft
	benutzen...<BR>
	<BR>
	Ist die Szene einmal mehr oder weniger fertiggestellt, geht es
	an die Substanz des Rechners, an die Bildberechnung. Cinema4D
	gibt einen Drahtmodus und einen Fl&auml;chenmodus als
	Vorschauberechnung vor. In kurzer Zeit l&auml;&szlig;t sich das
	ungef&auml;hre Aussehen des zuk&uuml;nftigen Kunstwerks (?) in
	Augenschein nehmen. Etwas zeitintensiver l&auml;&szlig;t der
	sogenannte "Tiefenpuffer" Vorfreude auf zuk&uuml;nftige Textur-,
	Farb-, Relief- und Spiegelbilder zu. Diese Darstellungsart
	verwendet den aufwendigen Trace-Algorithmus nur, wenn unbedingt
	n&ouml;tig. Der Ungeduldige erh&auml;lt schon recht
	detailgetreue Einblicke. Doch erst der Raytrace-Modus liefert
	die volle Pracht, wie z.B. Transparenz. Aufl&ouml;sung und
	Farbanzahl (HAM6, HAM8, 24Bit) sind individuell abstimmbar,
	Antialiasingtiefe (was die Rechenzeit mehr als drastisch
	erh&ouml;ht) ver&auml;nderlich. Eine Szene mu&szlig; f&uuml;r
	das Raytracing allerdings auf Disk oder Festplatte vorliegen.
	Wurde eine auf Festspeicher schon vorhandene Szene
	ver&auml;ndert, &uuml;berschreibt der Raytracer beim Start
	gnadenlos und ohne Meldung die alte Version. Auf diese Weise
	habe ich mir ein paar Szenen schon gr&uuml;ndlich versaut.<BR>
	<BR>
	<IMG SRC="tls02c.png" ALT="Maxon3" BORDER="2">
	<BR>
	<BR>
	Selbstverst&auml;ndlich h&auml;ngt die Rechengeschwindigkeit
	entscheidend von der Komplexit&auml;t der Szene, der
	Bildaufl&ouml;sung, dem Antialiasing und dem vorhandenen
	Prozessor ab. Mit einem 68030/68882 (25/25 MHz) erreicht
	Cinema4D subjektiv eine angenehme Geschwindigkeit. Aufwendige
	Projekte ben&ouml;tigen trotzdem die ber&uuml;chtigten
	&Uuml;bernachtarbeiten, bei denen mehr denn je deutlich wird,
	wie laut der L&uuml;fter eines A2000 eigentlich sein kann. Die
	FPUVersion macht vom kleinen Rechenknecht recht effektiv
	Gebrauch. W&auml;hrend ein A2000 mit A2630 (030/882 - 25 MHz),
	1&nbsp;MB Chip- und 4 MB Fastmem f&uuml;r eine Szene rund 35 Minuten
	beanspruchte, verbrauchte ein A1200 mit Blizzardboard (030 - 40
	MHz), 2 MB Chip- und 4 MB Fastmem &uuml;ber 10 Minuten
	l&auml;nger.<BR>
	Da&szlig; Cinema 4D haupts&auml;chlich als Einzelbildsoftware
	gedacht war, verdeutlicht der Animationsteil: Er
	l&auml;&szlig;t n&auml;mlich nur Kamerabewegungen zu. Laut Maxon
	soll jedoch an einem Objektanimator gearbeitet werden.<BR>
	Im Lieferumfang befindet sich au&szlig;er "BuildAnim" (ein etwas
	zweifelhaftes Programm, das angeblich Einzelbilder zu
	Animationen verbinden kann, bei mir aber bisher nur kr&auml;ftig
	Indienbesuche provozierte), einem vom Hauptprogramm
	unabh&auml;ngigen Raytracer (zum Speichersparen), "VT" und
	"Display" noch "Castillian Light". Letzteres konvertiert
	3D-Daten in etlichen Formaten: Sculpt, Reflections, Imagine,
	Turbosilver, DXF, Fastray, Videoscape, Pagerender und
	nat&uuml;rlich Cinema4D. Die Vollversion dazu (Test siehe AMIGA
	9/94) kann au&szlig;erdem noch Caligari, Lightwave und Real3D,
	enth&auml;lt drei detaillierte Objekte (T-Rex, C-Klasse-Benz,
	USS Ingram) und steht Cinema4D-Besitzern bereits f&uuml;r 99.-
	zur Verf&uuml;gung (den T-Rex gibt es sogar kostenlos).</P>
	<BR>
	<IMG SRC="tls02d.png" ALT="Maxon4" BORDER="2">
	<BR>
	<BR>
	<FONT SIZE="+1">ENDLICH die Schlu&szlig;wertung:</FONT>
	<BR>
	<TABLE SUMMARY="Bewertung" BORDER="0" CELLSPACING="5" CELLPADDING="5" WIDTH="450" BGCOLOR="#A0A0A0">
	<TR>
	    <TD>+</TD><TD>G&uuml;nstiger Preis</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Anpassungsf&auml;higer Editor</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Komfortable Installation</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Komplette Grafikkartenunterst&uuml;tzung</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Leistungsf&auml;higer 3D-Konverter</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Gute Funktionsauswahl</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Spezialversion f&uuml;r A1200</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Mitgelieferte Texturen, Materialien, Szenen</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>Sehr systemkonform</TD>
	</TR>
	<TR>
	    <TD>+</TD><TD>&Uuml;bersichtlich, einfach</TD>
	</TR>
	<TR>
	    <TD BGCOLOR="#C0C0C0"></TD><TD BGCOLOR="#C0C0C0"></TD>
	</TR>
	<TR>
	    <TD>-</TD><TD>Fehler bei Bool</TD>
	</TR>
	<TR>
	    <TD>-</TD><TD>Bis dato nur Kameraanimation</TD>
	</TR>
	<TR>
	    <TD>-</TD><TD>Wegen 8 Farben teilweise etwas z&auml;her Fensteraufbau</TD>
	</TR>
	<TR>
	    <TD>-</TD><TD>Handbuch k&ouml;nnte ausf&uuml;hrlicher sein</TD>
	</TR>
	</TABLE>
	<BR>
	<P>
	Ein Programm mit hervorragendem Preis-Leistungs-Verh&auml;ltnis,
	jedem Hobbytracer zu empfehlen. Gesamtwertung: 80 %
	</P>
	<BR>
	<BR>
	</TD>
	</TR>
	</TABLE>
	<BR>
	</TD>
    </TR>
    <TR>
	<TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
    </TR>
    </TABLE>
    </TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
