<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tls0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#605030">
	<TR>
	    <TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
	    <TR>
		<TD>
		<H2 align="center"><B>Testbericht</B></H2>
		<BR>
		<CENTER><P><B>
		Video-Lable-Master<BR>
		------------------<BR></B>
		</P></CENTER>
		<P>
		Hallo,<BR>
		<BR>
		heute stelle ich mal wieder ein kleines Programm vor, da&szlig;
		besonders f&uuml;r User geeignet ist, die eine gro&szlig;e (oder
		auch kleinere, ganz wie man es sehen will) Videosammlung haben
		und diese verwalten m&ouml;chten. Es handelt sich um das
		Programm "Video-Label-Master" in der Version 3.3 vom 27.6.94 die
		mir hier vorliegt. Autor ist Detlef Scholten und das Programm
		ist Shareware, sprich der Autor verlangt einen kleinen Beitrag
		wen einem das Programm gef&auml;llt. Die 20 DM
		Registriergeb&uuml;hr sind jedoch f&uuml;r dieses Programm voll
		angemessen, wenn nicht (im Gegensatz zu anderen Programmen) zu
		wenig. Wie schon erw&auml;hnt handelt es sich bei dem Programm
		um eine Videokassettenverwaltung. Man kann neber den
		&uuml;blichen Eingaben von Titelnummer, Titel, Genre, Zeit auch
		die Darsteller, die Cassettenmarke, die Cassettenl&auml;nge,
		FSK, Originaltitel, Produzent, Land, Regie, SP/LP,
		Mono/Stereo/Dolby eingeben, man kann dem Film eine Note geben
		und hat Platz f&uuml;r eine Bemerkung von drei Zeilen. Dies ist
		noch nicht weltbewegend, auch nicht die Tatsache, da&szlig; man
		diese Daten per Knopfdruck (wahlweise auf der Maus oder per
		Tastatur) auf dem Drucker ausgeben kann und dies auch in
		verschiedenen Arten. Man hat die Auswahl zwischen 2 Listenarten,
		die unterschiedlich aufgebaut sind und man kann die Daten
		verschieden sortiert ausgeben. Mal nach der Titelnummer und der
		laufenden Nummer, mal nach Titelname und Genre oder wenn man
		will nach FSK und der Note. Einfach angeben was man m&ouml;chte
		und man hat kein weiteres Problem.<BR>
		<BR>
		Dateneingabe und Ausgabe als Liste kann so ziemlich jedes
		Videoverwaltungsprogramm, aber dieses Programm kann noch mehr.
		Man kann f&uuml;r jeden Videofilm ein Etikett ausdrucken lassen
		(es werden bestimmte Gr&ouml;&szlig;en ben&ouml;tigt, die es
		jedoch zu kaufen gibt; Preis ca. 15 DM f&uuml;r 200-400
		Etiketten, je nach Gr&ouml;&szlig;e) und hat somit seine
		Videofilme auch gleich sehr sauber und ordentlich beschriftet.
		Man kann auch den Verleih von Videofilmen "verwalten", dazu gibt
		es in diesem Programm die M&ouml;glichkeit Adressen einzugeben
		(10 Personen) und diesen Adressen dann 10 Filme als verliehen
		zuordnen. Selbstverst&auml;ndlich kann man diese Verleihliste
		ausdrucken lassen und hat somit einen sehr guten &Uuml;berblick,
		welche Filme gerade bei wem sind. Man kann sich
		selbstverst&auml;ndlich auch die Liste mit den Adressen
		ausdrucken lassen und hat sogar eine kleine Adressverwaltung.
		Man kann auch die Adressen auf passenden Etiketten ausdrucken
		lassen und diese wunderbar benutzen. Hat man einmal daf&uuml;r
		nicht die richtigen Etiketten vorr&auml;tig, so benutzt man
		einfach andere und stellt die R&auml;nder im Verzeichnis Drucker
		definieren um. Das Programm zeigt einem auf Knopfdruck an,
		welche Cassetten mit zwei Filmen bespielt sind, auf welchen z.b.
		6 Filme sind, auf welchen noch Restzeit von z.b. 50 min ist und
		welche Titelnummern noch ganz frei sind. Man kann die Urzeit
		verstellen und sich ein Direktory anzeigen lassen (wenn man
		nicht mehr ganau wei&szlig;, wie die Datei hei&szlig;t, die man
		sucht) oder sich einen &Uuml;berblick &uuml;ber den Restspeicher
		verschaffen. Man kann auch die F-Tasten ganz nach Wunsch
		belegen, z.B. mit den GenreAngaben wie Science-Fiction oder
		Abenteuerfilm (was ich nicht mehr missen m&ouml;chte).<BR>
		<BR>
		Dieses Programm verwaltet pro Videonummer 8 Videofilme (wenn man
		mehrere Filme auf einer Cassette aufgenommen hat) und kann auch
		alle 8 auf den Etiketten ausgeben. Es verwaltet pro Datei bis zu
		999 Videonummer, 10 Adressen mit bis zu 10 ausgeliehenen
		Videonummern pro Adresse. Es durchsucht durch neue Suchroutinen
		700 Datens&auml;tze !! pro Sekunde, ben&ouml;tigt ca. 1,5 MB RAM
		und l&auml;uft auf jedem C= Amiga, egal ob A 500 (wenn
		gen&uuml;gend Speicher und meiner Meinung nach Kick 2.0) oder A
		4000. Ist dem Programm der Speicher zu wenig, so teilt es dies
		einfach einem mit. Es ist im neuen OS 2.0 Look und ist einfach
		per Knopfdruck oder per Pulldown-Men&uuml;s steuerbar.<BR>
		<BR>
		Die mir vorliegende Version ist vollst&auml;ndig und nicht
		eingeschr&auml;nkt, man kann alle Funktionen benutzen und somit
		das Programm vollst&auml;ndig testen.<BR>
		<BR>
		Pers&ouml;nlich m&ouml;chte ich sagen, da&szlig; mir das
		Programm sehr gut gef&auml;llt und ich ohne dieses Programm
		&uuml;ber meine 150 Videokassetten keinen &Uuml;berblick mehr
		h&auml;tte. Ich bin reg. User und bereue es nicht.<BR>
		<BR>
		Wer Interesse an diesem Programm hat, kann selbiges bei mir
		gegen Leerdisk und R&uuml;ckporto (2 DM) kostenlos bekommen,
		einfach an folgende Adresse schreiben:<BR>
		<BR>
		Andre Beran<BR>
		Bergstr. 38<BR>
		63073 Offenbach<BR>
		Tel.069/898818<BR>
		<BR>
		Es ist auch bereits in einigen wenigen Mailboxen zu finden,
		jedoch meist im Rhein-Main-Gebiet in Hessen.<BR>
		<BR>
		<BR>
		Genug f&uuml;r heute, Andre.<BR>
		</P>
		<BR>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
