<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>Testbericht</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tls0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tls.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="Navigation" BGCOLOR="#0000F0">
	<TR>
	    <TD><IMG SRC="tls.gif" ALT="Navigation" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="10" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="80%">
	    <TR>
		<TD>
		<H2 align="center"><B>Testbericht</B></H2>
		<BR>
		<CENTER><P><B>
		+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<BR>
		+X-COPY SPECIAL+<BR>
		+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<BR></B>
		</P></CENTER>
		<P>
		Als ich so meine alten Computerzeitschriften durchbl&auml;ttere,
		endecke ich in der Amiga Special 5/94, da&szlig; man sich X-Copy
		von Cachet dort bestellen kann.Man mu&szlig; einfach 5DM als
		Scheck,in M&uuml;nzen oder als Schein und einen mit 3DM
		frankierten und adressierten R&uuml;ckumschlag mit samt dem
		Bestellcoupon an die untenstehende Adresse schicken, und man
		bekommt das f&uuml;hrende Programm in Sachen Kopieren.<BR>
		<BR>
		Ob diese Diskette Public Domain ist, konnte ich bis Dato nicht
		nachpr&uuml;fen, da entweder bei Cachet Software immer besetzt
		war oder man dort auch nach 200maligem Anrufen keine Antwort in
		Form der Erwiederung in Zuhilfenahme des Abnehmens des
		H&ouml;rers des dort angeschlossenen Telefon bekommt.<BR>
		<BR>
		<FONT SIZE="+1"><B>(ANDREAS: SIE IST KEINE PD!!)</B></FONT><BR>
		<BR>
		<BR>
		Man bekommt zu dem Programm nichts weiter mitgeschickt, als die
		Diskette, auf der das Programm sein Dasein fristet, und der
		knappen Anleitung, die auf der Diskette beheimatet ist. Diese
		Anleitung erkl&auml;rt auf circa 2&#189; Seiten, wozu das
		Programm da ist. Es sind nur die wichtigsten
		Programmbestandteile gut verst&auml;ndlich erkl&auml;rt, wobei
		man zum Bleistift immer noch einige Sachen nicht richtig nutzten
		kann,weil diese in der kurzen Anleitung einfach nicht
		erkl&auml;rt werden. Es besteht jedoch die M&ouml;glichkeit, das
		Handbuch nachzubestellen. Leider habe ich nicht herausfinden
		k&ouml;nnen, ob es etwas kostet, weil dort wirklich nie
		abgenommen wird!&#161;<BR>
		<BR>
		So, aber nun zu dem schon soooo ersehnten Test dieses Prog-
		gis. Also los........<BR>
		<BR>
		<BR>
		Als erstes w&auml;re da einmal die Bedienungsoberfl&auml;che.
		Alles ist in einem lieblichen rosa gehalten.Oben ist der
		Schriftzug X-Copy zu sehen ( Falls APN einen Screenshot dazu
		gemacht hat, werdet ihr das Bild auch sehen k&ouml;nnen !&#161;
		:-) )<BR>
		<BR>
		Die Oberfl&auml;che ist wirklich sehr gut gelungen ( optischer
		Weise ).Man hat &uuml;ber alles seinen eigenen Blick, was sich
		positiv bemerkbar macht.<BR>
		<BR>
		Jetzt aber weiter mit dem wirklich gut gelungenen Bildaufbau.
		Nun ist die Zeit gekommen, sich auszusuchen, was man jetzt
		eigentlich mit dem Programm anstellen m&ouml;chte. Also was
		liegt nicht n&auml;her, mal eine oder mehrere Disx gleichzeitig
		zu kopieren? Man kann sich bei dieser Version zwischen eine der
		4 folgenden Varianten des Disketten-Dublizierens aussuchen:<BR>
		<BR>
		Als erstes ist da mal Doscopy. Mit dieser Art ist es
		m&ouml;glich, die Sogenannten Dos Disketten zu kopieren. Hierbei
		handelt es sich um Disketten, die der Amiga problemlos lesen
		kann. normalerweise sind alle PD-Disketten im Dos-Format,so
		da&szlig; man sie problemlos mit Doscopy kopieren
		kann.Kommerzielle Spiele sind meistens nicht im Dos-Format. Man
		will damit vermeiden, da&szlig; sich jeder User eine Raubkopie
		davon machen kann !!! Wenn man sich komerzielle Spiele kopieren
		will,braucht man eine andere Kopier-Art. Das beste Beispiel
		daf&uuml;r ist wohl Nibblecopy.<BR>
		<BR>
		Mit Nibblecopy ist es m&ouml;glich normalerweise alle
		komerziellen Spiele zu kopieren. Auch fast alle gesch&uuml;tzte
		Soft l&auml;sst sich damit problemlos vervielfachen (aber doch
		hoffentlich nur f&uuml;r Sicherheitskopien-nicht wahr Daniel :-)
		). Nicht alle gesch&uuml;tzte Software l&auml;sst sich
		problemlos kopieren. Man erh&auml;lt,wenn man sich das Programm
		als Original k&auml;uft, einen zus&auml;tzlichen Hardwarezusatz
		zum Programm dazu ( Ich habe ihn leider nicht bekommen, da meine
		Version ja f&uuml;r 5 M&auml;rker erh&auml;ltlich war und so
		kein Hardwarezusatz und kein Hanbuch beilagen :-( Aber wenn ihr
		auch diese Version von X-Copy habt, habt ihr die
		M&ouml;glichkeit den Zusatz nachzubestellen!Aber das am Ende des
		Textes! ). Wenn man mit Zuhilfenahme dieser Hardware eine Disk
		kopieren m&ouml;chte,mu&szlig; man diesen dort an den Amiga
		anschlie&szlig;en, wo man sonst das Verbindungskabel zum
		externen Zweitlaufwerk 'reinsteckt. Wie aus dem vorausgegengenen
		Satz klar wurde,mu&szlig; man an die Hardware das Zweitfloppy
		anschlie&szlig;en (es soll auch Versionen f&uuml;r interne
		Laufwerke geben! ). Wenn man das hinter sich gebracht hat, kann
		man in Ruhe dem Kopiervorgang mitverfolgen.<BR>
		<BR>
		Nach Doscopy und Nibblecopy gibt es noch zwei weitere
		Kopierfunktionen. Da ist z.B. Doscopy+. Soweit ich wei&szlig;
		handelt es sich um eine &uuml;berarbeitete Version des normalen
		Doscopys handeln. Als, was Doscopy ist, wurde ja schon weiter
		oben erkl&auml;rt. Also lassen wir das mal an dieser stelle weg
		!<BR>
		<BR>
		Als vierte und letzte Kopierart gibt es Bamcopy. Jetzt fragt
		mich aber nicht, wozu das da ist! Soweit ich wei&szlig;, werden
		mit Bamcopy nur Spuren kopiert, die voll sind. Also werden die
		Spuren,die keine Daten beinhalten &uuml;berhaupt nicht
		ber&uuml;cksichtigt. Das spart auf alle F&auml;lle eine Menge
		der kostbaren Zeit!<BR>
		<BR>
		Bei jeder Kopiervariante steht es einem frei, ob man sein(e)
		Disk(x) mit Verify kopieren m&ouml;chte. Verify ist dazu da,
		da&szlig; nach dem Kopiervorgang nachgepr&uuml;ft wird, das auch
		alle Daten der Quelldiskette auch auf der Zieldiskette
		angekommen sind . Bei Verify dauert der Kopiervorgang etwas
		l&auml;nger, aber daf&uuml;r bekommt man auch eine super
		Qualit&auml;t!!!<BR>
		<BR>
		Es ist nicht so, da&szlig; man eine Diskette nur einmal kopieren
		kann. Das stimmt nicht. Mit X-Copy kann man eine gleichzeitig
		vier mal kopieren.Man sieht auf dem Bildschirm vier
		nebeneinander gereihte Disketten. &Uuml;ber und unter den
		Disketten kann man jeweils f&uuml;r eine Diskette eine Lampe
		ersp&auml;hen. Die obere ist dazu da,festzulegen, welche
		Diskette aus welchem Laufwerk man kopieren m&ouml;chte. Man kann
		nur eine von den vier oberen Lampen "anmachen"(also
		anklicken!!!),was ja auch sehr logisch erscheint, da man nicht
		mehrere veschiedene Disketten gleichzeitig kopieren kann ! Wenn
		man eine der unteren L&auml;mpchen anklickt, erhellt sich diese
		und man bestimmt so das Ziellaufwerk (oder mehrere). Man kann
		insgesamt vier anklicken, wenn sich halt soviele Kopien machen
		m&ouml;chte!!! Durch nochmaliges klicken auf solch ein
		L&auml;mpchen erscheint darin ein rotes V . Dies zeigt
		an,da&szlig; man auf dieses Laufwerk mit Verify kopiert.<BR>
		<BR>
		Man kann aber nicht nur Disketten kopieren sonder auch Daten aus
		dem Speicher (Ram) oder von seiner Festplatte (HD) . Auch hier
		kann man wieder auf vier Laufwerke gleichzeitig kopieren. Aber
		das ist ja weiter oben schon beschrieben.<BR>
		<BR>
		Aber nicht nur das Kopieren ist das einzige,was man mit diesem
		Proggi machen kann. Man kann nat&uuml;rlich auch Disketten
		formatieren. Es gibt verschiedene Arten des Formatierens, die
		unten in einer kleinen Tabelle vorgestellt werden.<BR>
		</P>
		<TABLE ALIGN="CENTER" SUMMARY="" BORDER="0" CELLPADDING="5" CELLSPACING="5" WIDTH="550" BGCOLOR="#A0A0A0">
		<TR>
		    <TH>Name Format-Variante</TH>
		    <TH>Bootblock installieren ja/nein</TH>
		    <TH>Name f&uuml;r Disk eingeben k&ouml;nnen ja/nein</TH>
		</TR>
		<TR>
		    <TD>1. WB-Format</TD>
		    <TD ALIGN="CENTER">nein</TD>
		    <TD ALIGN="CENTER">nein</TD>
		</TR>
		<TR>
		    <TD>2. Format</TD>
		    <TD ALIGN="CENTER">ja</TD>
		    <TD ALIGN="CENTER">ja</TD>
		</TR>
		<TR>
		    <TD>3. Q-Format</TD>
		    <TD ALIGN="CENTER">ja</TD>
		    <TD ALIGN="CENTER">ja</TD>
		</TR>
		</TABLE>
		<P>

		Wie man an den drei Varianten sehen kann, hat man verschiedene
		man bei diesem Programm nicht nur die M&ouml;glichtkeit,einen
		Namen f&uuml;r die zu formatierende Diskette einzugeben, sondern
		diese auch bootf&auml;hig zu machen. Man hat diese
		M&ouml;glichkeit nur beim "normalen" Format (Nr.2) und bei
		Q-Format (Nr.3). Folgende Bootbl&ouml;cke kann man anlegen:
		</P>
		<BR>
		<TABLE ALIGN="CENTER" SUMMARY="" BORDER="0" CELLPADDING="5" CELLSPACING="5" WIDTH="550" BGCOLOR="#A0A0A0">
		<TR>
		    <TH>Name</TH>
		    <TH>Besonderheiten</TH>
		</TR>
		<TR>
		    <TD WIDTH="150">1.Bootable</TD>
		    <TD>Disk ist danach bootf&auml;hig</TD>
		</TR>
		<TR>
		    <TD>2.No Boot</TD>
		    <TD>man installiert keinen Bootblock</TD>
		</TR>
		<TR>
		    <TD>3.FFS Bootable</TD>
		    <TD>Disk wird im Fast-File-System bootf&auml;hig gemacht</TD>
		</TR>
		<TR>
		    <TD>4.FFS No Boot</TD>
		    <TD>Disk wird im Fast-File-System formatiert, ist aber nich bootf&auml;hig</TD>
		</TR>
		<TR>
		    <TD>5.X-Copy</TD>
		    <TD>Da wu&szlig;te ich nicht,was da passiert!</TD>
		</TR>
		</TABLE>
		<P>
		Neben dem kopieren und formatieren von Disketten gib es noch
		eine Anzahl von Zusatzbefehlen. Diese m&ouml;chte nicht auch
		noch alle erkl&auml;ren, weil es jetzt schon sehr sp&auml;t ist
		(02.57) und ich auch keinen Bock habe disen Text morgen
		weiterzuschreiben, da ich jetzt gerade vor einer Ideenflut des
		Ausdr&uuml;ckens dieses Textes bin. Also nehmt mir das jetzt
		nicht &uuml;bel...<BR>
		<BR>
		Disketten k&ouml;nnen nat&uuml;rlich auch auf Fehler untersucht
		werden . So wie ich das gesehen habe, untersucht das Program die
		Disk auch nach Viren, kann diese aber nicht vernichten.Dazu
		braucht wohl ein spezielles Virenschutztprogramm(z.B. Die
		Virenschutzdisk vom APC&amp;TCP f&uuml;r eine Leerdisk und
		R&uuml;ckporto). Ferner k&ouml;nnen Informationen zur Diskette
		aufgerufen werden.Dies sind z.B. der Name der Diskette, der
		Inhalt der Diskette und der freie Platz auf der Disk.<BR>
		<BR>
		Zu guter Schlu&szlig; kann man noch erw&auml;hnen, da&szlig; das
		Programm allen zur verf&uuml;gung stehenden Speicher voll
		ausnutzt. Weiterhin ist dieses Proggi multitaskf&auml;hig.</P>
		<BR>
		<DL>
		    <DT><FONT SIZE="+1">Fazit:</FONT>
		    <DD>X-Copy, der Marktf&uuml;hrer unter den Kopierprogrammen,
		    ist in gro&szlig;em und ganzen wohl das beste Proggi auf
		    diesem Gebiet-und das schon seit Jahren ! Ich kann es nur
		    w&auml;rmstens weiterempfehlen,da es ja das beste Programm
		    ist. Auch an Anf&auml;nger wurde gedacht, deshalb ist auch
		    die Oberfl&auml;che gut gestaltet und jeder kann es bedienen
		    !!!
		    <DD> &nbsp;
		    <DT><FONT SIZE="+1">Besonderheiten:</FONT>
		    <DD>Ich habe ja wie erw&auml;hnt das Programm f&uuml;r 5 DM
		    und Porto in der Amiga Special bestellt und so keine
		    Hardware, Anleitung(doch eine kleine auf der Disk mit drauf)
		    und die Tools nicht bekommen. Wenn man sich aber das
		    Programm k&auml;uft bekommt man die Hardware, Anleitung,
		    Tools und vieles mehr noch dazu !!!! Also zugreifen !!!!
		</DL>
		<BR>
		<FONT SIZE="+1">Meine Bewertung f&auml;llt wie folgt aus:</FONT>
		<TABLE ALIGN="CENTER" SUMMARY="" BORDER="0" CELLPADDING="5" CELLSPACING="5" WIDTH="550" BGCOLOR="#A0A0A0">
		<TR>
		    <TD>PREIS/LEISTUNG:</TD>
		    <TD>(F&uuml;r das f&uuml;r 5DM)</TD>
		    <TD ALIGN="RIGHT">99%</TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>(F&uuml;r das f.ca.90DM)</TD>
		    <TD ALIGN="RIGHT">96%</TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		</TR>
		<TR>
		    <TD>DOKUMENTATION:</TD>
		    <TD>Deutsch</TD>
		    <TD></TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		</TR>
		<TR>
		    <TD>BEDIENUNG:</TD>
		    <TD></TD>
		    <TD ALIGN="RIGHT">95%</TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		</TR>
		<TR>
		    <TD>LEISTUNG:</TD>
		    <TD>(Das f.5DM)</TD>
		    <TD ALIGN="RIGHT">100%</TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		</TR>
		<TR>
		    <TD></TD>
		    <TD>(Das f.ca. 90DM)</TD>
		    <TD ALIGN="RIGHT">98%</TD>
		    <TD BGCOLOR="#C0C0C0"></TD>
		<TR>
		    <TD>GESAMT:</TD>
		    <TD>(Das f. 5DM)</TD>
		    <TD ALIGN="RIGHT">98% </TD>
		    <TD BGCOLOR="#C0C0C0">(1/Weltklasse)</TD>
		<TR>
		    <TD></TD>
		    <TD>(Das f.ca. 90DM)</TD>
		    <TD ALIGN="RIGHT">96,34%</TD>
		    <TD BGCOLOR="#C0C0C0">(1/Weltklasse)</TD>
		</TR>
		</TABLE>
		<BR>
		<FONT SIZE="+1">Bezugsquelle:</FONT>
		<TABLE ALIGN="CENTER" SUMMARY="" BORDER="0" CELLPADDING="5" CELLSPACING="5" WIDTH="450">
		<TR>
		    <TD ALIGN="CENTER" WIDHT="50%"><FONT SIZE="+1">Deutschland:</FONT></TD>
		    <TD ALIGN="CENTER" WIDHT="50%"><FONT SIZE="+1">&Ouml;sterreich:</FONT></TD>
		</TR>
		<TR>
		    <TD ALIGN="CENTER"><FONT SIZE="+1">Cachet Software</FONT><BR>Ostendstra&szlig;e 32<BR>76684
		    &Ouml;stringen<BR><BR>Tel.:07253/22411</TD>
		    <TD ALIGN="CENTER"><FONT SIZE="+1">Intercomp</FONT><BR>A.Mayer GmbH<BR>Heldendamstr.24<BR>A-6900
		    Bregenz<BR><BR>Tel.:05574/47344</TD>
		</TR>
		</TABLE>
		<BR>
		<DL>
		    <DT>P.S.:
		    <DD>Bei der jeweiligen oben angef&uuml;hrten Bezugsadresse
		    k&ouml;nnt ihr die Tools, das deutsche Handbuch und den
		    Hardwarezusatz bestellen. Am besten ruft ihr erst einmal da
		    an, um euch &uuml;ber den Preis des jeweiligen Zubeh&ouml;rs
		    informieren. Der Hardwarezusatz kostet 40 M&auml;rker !!!!!
		    <DD> &nbsp;
		    <DT>P.P.S.:
		    <DD>Das Programm ist voll updatef&auml;hig. Auch das f&uuml;r 5DM!
		</DL>
		<BR>
		<P>
		Tja, das war's dann wohl...<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sebastian Alfers<BR>
		&nbsp;&nbsp;&nbsp;&nbsp;Bis zum n&auml;chsten Kopierproggi-Test!<BR>
		</P>
		<BR>
		<BR>
		</TD>
	    </TR>
	    </TABLE>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tls.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tls0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
