<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>KING`S QUEST 6 - HEIR TODAY, GONE TOMOTTOW</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tut0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tut.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#F0F0F0">
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
<!Innere Tabelle>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="90%">
	    <TR>
		<TD>
		<H4 ALIGN="CENTER">KING`S QUEST 6 - HEIR TODAY, GONE TOMOTTOW</H4>

		<P>                
		Hallo, ich bin Alexander von Davetry. Wo bin ich hier? Dies
		mu&szlig; wohl der Strand der Green Isle sein. Aber wir werden
		ja sehen... Ich nehme aus der Kiste unter der Planke die
		M&uuml;nze und aus den Sand meinen Siegelring. Dann gehe ich
		ins Dorf. Ich spreche mit dem Lampentr&ouml;dler und betrete
		den H&auml;ndlerladen. Dem H&auml;ndler zeige ich den Ring und
		tausche die M&uuml;nze gegen die Nachtigall. Beim Verlassen
		nehme ich mir noch ein Minzbonbon. Ich wei&szlig; nun,
		da&szlig; ich auf der Isle of the Crown, im Land der Green Isle
		bin. was mich ungemein beruhigt. Im Buchladen finde ich beim
		Eingang ein Buch auf einem Tisch und im Regal f&auml;llt aus
		dem Gedichtband ein Liebesvers, den ich aufhebe. Ich spreche
		mit dem Buchh&auml;ndler und gehe dann zum F&auml;hrmann, halte
		einen Smalltalk und nehme die Hasenpfote mit. Jetzt kann ich im
		H&auml;ndlerladen meinen Ring gegen die Karte tauschen.<BR>
		<BR>

		<FONT SIZE="+1">Isle of Wonder:</FONT>
		<BR>
		Am Strand beame ich mich mit der Karte aud die Isle of Wonder.
		Ich lese der Auster aus dem Buch vor und schnappe mir die
		Perle. Dann angle ich noch den unvollst&auml;ndigen Satz aus
		dem Wasser. Nun tausche ich beim H&auml;ndler die Perle gegen
		den Siegelring. Im Buchladen spreche ich mit Jollo-der Mann im
		Stuhl-und zeige ihm den Ring. Im Trog auf der Stra&szlig;e
		finde ich eine Unsichtbarkeitstinte. Nachdem mich die Wachen
		vom Schlo&szlig; nicht hineinlassen, erzwinge ich mir mit
		meinem Ring eine Audience beim Vizir. Bei der Abzweigung sitzt
		auf dem Baum eine Nachtigall mit der ich mich, &uuml;ber die
		mechanische Nachtigall, anfreunde. Gebe ich ihr den Siegelring
		bringt sie mir ein Haarband und wenn ich ihr das Gedicht gebe,
		bekomme ich noch einen Brief von Cassima.<BR>
		<BR>

		<FONT SIZE="+1">Isle of Sacred Mountain:</FONT>
		<BR>
		Auf der Isle of Sacred Mountain nehme ich die Feder und die
		Blume. Will ich auf der Isle of Wonder nun das Landesinnere
		erforschen, tauchen f&uuml;nf Zwerge auf, denen ich mit Hilfe
		der Blume, der Nachtigall, des Minzbonbons, der Hasenpfote und
		der Unsichtbarkeitstinte meine Herkunft verschleiere. Im
		H&auml;ndlerladen tausche ich die Nachtigall gegen die
		Fl&ouml;te und im Buchladen versuche ich das Buch auf der Theke
		zu bekommen, worauf ich erfahre, da&szlig; der H&auml;ndler es
		nur gegen ein wirklich seltenes Buch tauscht. Auf der Isle of
		Wonder gehe ich zum B&uuml;cherberg, um solch ein Buch zu
		finden. Der Wurm fordert jedoch eine Gegenleistung. Betrachte
		ich das Spinnennetz sehe ich einen Faden. Ich ziehe daran und
		nehme mir den Papierschnipsel. Auf dem Weg zum Loch-in-der-Wand
		nehme ich ferner vom Baum im Sumpf eine Milchflasche. Ich nehme
		die verrittete Tomate und spiel den Sonneblumen auf der
		fl&ouml;te vor, woraufhin ich das Loch-in-der-Wand fangen kann.
		Durch das Tor gelange ich ins Schachbrettland. Die Wachen
		lassen mich vorbei, doch die rote K&ouml;nigin<BR>
		<BR>
		l&auml;&szlig;t ihren Schal fallen, den ich aufhebe. Wieder
		durch das Tor und einen Eiskopf-Salat gepfl&uuml;ckt, begebe
		ich mich schnurstracks auf die Insle of the Beast. In die
		kochenden Quellen werfe ich den Eiskopfsalat. Dann gehe ich
		hindurch und nehme die Lampe. Beim Bogensch&uuml;tzen finde ich
		einen Ziegelstein. Am Strand spreche ich mit dem kleinen
		gr&uuml;nen Wesen und gebe ihm den invollendeten Satz, worauf
		dieses mit mir geht.<BR>
		<BR>

		<FONT SIZE="+1">Hallo Wirm:</FONT>
		<BR>
		Auf der Isle of Wonder bringe ich dem Wurm das kleine
		Wesen-sein Kind-und erhalte das seltene Buch. Dieses bringe ich
		sogleich dem Buchh&auml;ndler und erhalte das Zauberbuch. Ich
		sehe mir die drei darin enthaltenen Zauberspr&uuml;che an, um
		mich auf die Suche nach den noch fehlenden Gegenst&auml;nden zu
		machen. Also tausche ich die Fl&ouml;te gegen die Zunderdose
		und gehe zur Isle of the Scared Mountain. Dort sehe ich mir die
		Hieroglyphen in der Felswand genauer an. Die L&ouml;sung des
		R&auml;tsels findet Ihr im Handbuch. Jetzt treten Treppen aus
		der Felswand, welche ich erklimme. Ich mu&szlig; noch vier
		weitere R&auml;tsel l&ouml;sen um endlich auf Plateau zu
		gelangen. Alle L&ouml;sungen oder Hinweise findet Ihr im
		Handbuch.<BR>
		<BR>
		1.R&auml;tsel Ihr markiert in jedem Wort einen Buchstaben, so
		da&szlig; von oben nach unten das Wort RISE zu lesen ist.
		2.R&auml;tsel Ihr gebt die entsprechenden Symbole f&uuml;r das
		Wort SOAR ein. 3.R&auml;tsel Numeriert Ihr die Kreise von links
		nach rechts mit 1 bis 4, m&uuml;&szlig;t Ihr folgende Kreise
		anklicken: 4,1 und 2. 4.R&auml;tsel Ihr gebt die entsprechenden
		Symbole f&uuml;r die Buchstaben D,O,Q und G ein. 5.R&auml;tsel
		Ihr markiert in jedem Wort einen Buchstaben, so da&szlig; von
		oben nach unten ASCEND zu lesen ist.<BR>
		<BR>
		Auf dem Olateau spreche ich mit der alten Frau- in Wahrheit
		wieder einmal Djinn. Sobald sie verschwunden ist, krieche ich
		in die H&ouml;hle neben dem Beerenbusch. In dieser mache ich
		mit der Zunderdose Licht und krieche in die n&auml;chste
		H&ouml;hle. Dort pfl&uuml;cke ich neben dem Felsfenster ein
		Minzblatt und gehe zur&uuml;ck ins Freie. Folge ich dem Weg ins
		Inselinnere, werde ich den Herrschern der Insel vorgef&uuml;hrt
		und erhalte die Aufgabe, ihre Tochter zu befreien. Ich darf die
		Insel jedoch noch einmal verlassen um mich vorzbereiten. Auf
		der Isle of Wonder finde ich auf dem Tisch vor der Wand eine
		Teetasse, die ich im Sumpf mit Schlamm auff&uuml;llen will. Und
		nachdem ich mit den beiden Streith&auml;hnen ausgiebig
		diskutiert habe, gebe ich dem Bump-on-a-log die Tomate. Nach
		der Schlammschlacht komme nun auch ich zu meiner, mit Schlamm
		gef&uuml;llten Tasse.<BR>
		<BR>

		<FONT SIZE="+1">Im Labyrinth:</FONT>
		<BR>
		Wieder auf der Isle of Scared Mountain steige ich die Treppe
		hinauf wo ich ins Labyrinth gesperrt werde. Ich hole, aus den
		entsprechenden R&auml;umen auf der Karte, den Totenkopf, das
		Schild und die zwei Goldm&uuml;nzen. Den Mosaikboden
		&uuml;berquere ich wie auf der Karte ersichtlich.
		Anschlie&szlig;end betrete ich den Fallenraum, wo ich den
		Ziegelstein in den MEchanismus werfe und den Raum verlasse. Im
		unteren Teil des Labyrinths begebe ich min in den Raum M, lege
		schnell das Loch-in-der-Wand auf die, der T&uuml;r
		gegen&uuml;berliegende, Wand und sehe hindurch. Dann gehe ich
		in den Wandteppichraum und hebe den Wandteppich beiseite und
		siehe da eine Geheimt&uuml;r &ouml;ffnet sich, durch die ich
		schleiche. Ich trete in den Raum und kann nun mit dem Schal den
		Minotaur seinem Schicksal &uuml;bergeben. Nachdem ich die
		Prinzessin von ihren Fesseln befreit habe, wartet nun, als
		Dank, ein Besuch beim heiligen Orakel, von welchem ich wichtige
		Informationen und ein geheiligtes Wasserfl&auml;schchen
		erhalte. Ich nehme im Dorf, auf der Isle of Mist, ein
		St&uuml;ck Kohle und die Sichel mit un gehe auf die Isle of
		Wonder, wo ich der wei&szlig;en K&ouml;nigin im Schachbrettland
		die Kohle gebe und daf&uuml;r ein (mit Schwefel gef&uuml;lltes)
		Ei erhalte. Ferner nehme ich noch vom Tisch neben den
		Schnappblumen das Giftfl&auml;schchen mit,<BR>
		<BR>
		gebe den Baby-Tr&auml;nen die Milchflasche und fange ein paar
		Tr&auml;nen mit der J&auml;gerlampe auf. Dann gehe ich zur Isle
		of the Beast, wo mir das Schild an den Bogensch&uuml;tzen
		vorbeihilft. Ich pfl&uuml;cke eine wei&szlig;e Rose von der
		Hecke und bahne mir mit der Sichel einen Weg in das
		n&auml;chste Bild. Die Geschichte des Monsters r&uuml;hrte mich
		so sehr, da&szlig; ich auf der Isle of the Crown im Buchladen
		mit Jollo rede und das M&auml;dchen im Rosengarten anspreche
		und sie mit der wei&szlig;en Rose und dem kostbaren Ring
		&uuml;berrede mit mir zu kommen. Gl&uuml;cklich vereint
		schreiten beide von dannen und ich bin um einen Spiegel und ein
		paar Frauenkleider reicher. Jetzt sch&uuml;tte ich das heilige
		Wasser und anschlie&szlig;end etwas Springbrunnenwasser in die
		J&auml;gerlampe und klicke mit der Lampe auf das Zauberbuch,
		bl&auml;ttere bis zum Regegnzauber und spreche ihn aus (cast).
		Auf dem Weg zur Isle of the Crown, pfl&uuml;cke ich noch eine
		wei&szlig;e Rose, die ich dann der Nachtigall gebe.<BR>
		<BR>

		<FONT SIZE="+1">Die Feuerprobe:</FONT>
		<BR>
		Dann gehe ich erneut auf die Isle of the Mist und bestehe die
		Feuerprobe. Ich f&uuml;lle den Totenkopf mit der hei&szlig;en
		Kohle, untersuche das Haarband und gebe das Haar und das Ei
		hinzu. Auf der Isle of the Crown zausche ich beim
		Lampentr&ouml;dler die Lampe gegen eine neue-die zweite von
		rechts. Endlich kann ich auf die Isle of Scared Mountain
		zur&uuml;ckkehren und auf dem Olateau den Zauberspruch
		Nachgesch&ouml;pfe bezaubern auf das Pegasus anwenden.<BR>
		<BR>

		<FONT SIZE="+1">Im Land der Toten:</FONT>
		<BR>
		Im Land der Toten spreche ich mit dem GEisterp&auml;rchen, ohne
		mich jedoch von anderen Geistern ber&uuml;hren zu lassen. DIe
		Eltern Cassimas raten mir mit dem Lord der Unterwelt zu
		sprechen und geben mir deshalb ein Ticket. Auf dem Weg zum Tor
		der Unterwelt treffe ich einen weiblichen Geist, der sein
		Junges sucht. Ich verspreche ihr ihn zu suchen und erhalte ein
		Taschentuch. VOr dem Tor zur Unterwelt spiele ich auf dem
		Xylophon, woraufhin das Skelett seinen Schl&uuml;ssel
		fallenl&auml;&szlig;t, den ich nat&uuml;rlich aufhebe. Dann
		gebe ich mein Ticket ab und betrete die Katabomben. Den Toten
		rechts entledige ich seines Handschuhs und beim F&auml;hrmann
		f&uuml;lle ich die Teetasse im Flu&szlig; Styx auf. Den
		F&auml;hrmann bezahle ich mit den M&uuml;nzen, um mich ans
		andere Ufer zu bringen. Um die T&uuml;r zu passieren, mu&szlig;
		ich sie ber&uuml;hren, sie ansprechen und das R&auml;tsel
		l&ouml;sen (LOVE). Dann stehe ich den Lord der Unterwelt
		gegen&uuml;ber. Mutig werfe ich ihm den Handschuh, als
		Herausforderung, ins Gesicht und zeige ihm dann den Spiegel.
		Ger&uuml;hrt l&auml;&szlig;t er mich und Cassimas Eltern gehen.
		Auf der Isle of the Crown gehe ich zum H&auml;ndler und trinke
		vor den Augen des Djinns den Gifttrank; dann tausche ich die
		Zunderdose gegen den Pinsel und begebe mich zum Schlo&szlig;.
		Seitlich bei der Schlo&szlig;mauer r&uuml;hre ich mit der Feder
		in der Tasse, male mit den Pisel in die Schlo&szlig;wand an und
		wende den letzten Zauberspruch Malen an (Zauberspruch auf
		gemalte T&uuml;r). Dann kann ich das Schlo&szlig; betreten. Ich
		gehe zuerst zu Jollo, gebe ihn die neue Lampe, worauf<BR>
		<BR>
		dieser sich davonstiehlt sie auszutauschen. Ich gehe zu dem
		kleinen Geist im Verlies und gebe ihm das Taschentuch. Dann
		folge ich dem Rat des Jungen, gehe zur R&uuml;stung,
		bet&auml;tige den Arm uns siehe da: Eine Geheimt&uuml;re.
		Hinter der T&uuml;re schaue ich durch das Loch in der Wand und
		gehe die Treppe hinauf. Auch hier sehe ich durch das Loch und
		gebe Cassima den Dolch. Ich folge dem Gang links und sehe durch
		das Loch. Am Ende des Ganges ist links einen Gheimt&uuml;re,
		die ich betrete. In Vizirs Schlafzimmer &ouml;ffne ich mit den
		Schl&uuml;ssel die Truhe und nehme den Brief, &ouml;ffne die
		Elfenbeinschatulle und begutachte die Papiere. Mit dem
		Pa&szlig;wort gehe ich zur Schatzkammer, spreche die T&uuml;r
		an und nach Eingabe von ALIZEBU &ouml;ffnet sich diese. In der
		Schatzkammer hebe ich die Drapierung vom Tisch, sehe mir alle
		Gegenst&auml;nde an und erkenne die wahre Natur des Vizirs. Als
		ich den Raum verlasse, h&ouml;re ich den Hochzeitsmarsch.
		Folglich eile ich die Treppe hinauf, um die Trauung zu
		verhindern. Selbst den Hundehauptmann kann ich, mittels den
		Dokument des Vizirs &uuml;berzeugen. Wir betreten den
		Hochzeitssaal und ich rufe Cassimas Eltern<BR>
		<BR>
		zu, dieser Farce ein Ende zu machen. Als auch noch Cassimas
		Eltern auf der Bildfl&auml;che erscheinen, entpuppt sich die
		Prinzessin als Djinn. Der Vizir fl&uuml;chtet, ich folge ihm
		und auf den Turmzinnen gibt es den langersehnten Showdown.
		Jollo wirft mir die Lampe zu, ich benutze sie auf den Djinn,
		der VIzir greift mich an, ich scnappe mir das Schwert von der
		Wand, greife ihn damit an und kurz bevor er mich t&ouml;ten
		kann, bekomme ich Hilfe, um doch noch &uuml;ber den Vizir zu
		triumphieren.<BR>
		</P>
		</TD>
	    </TR>
	    </TABLE>
<!Innere Tabelle>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
