<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>KGB</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tut0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tut.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#F0F0F0">
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
<!Innere Tabelle>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="90%">
	    <TR>
		<TD>
		<H2 ALIGN="CENTER">KGB</H2>

		<P>
		<FONT SIZE="+1">Kapitel 1:</FONT>
		<BR>
		Gerade erst begonnen, m&uuml;&szlig;t Ihr zu Wowlow. Dieser
		schickt Euch zum B&uuml;ro eines ermordeten Privatdetektivs.
		Dort zeigt Ihr dem Milizboy euren Ausweis und betretet das
		B&uuml;ro. Werft einen Blick in die Schublade und nehmt deren
		Inhalt. Anschlie&szlig;end krallt Ihr Euch die
		Streichh&ouml;lzer, die auf dem Schreibtisch liegen. Schaut
		Euch in aller Ruhe um, bis Golitzins Schwester auf der
		Bildfl&auml;che erscheint - Ihr k&ouml;nnt sie nun entweder
		brutal ausquetschen oder nett befragen. So oder so, nach
		Beendigung des Verh&ouml;rs r&uuml;ckt die Tante eine
		Mikrokassette heraus. Um diese abzuh&ouml;ren, mu&szlig; man
		die Batterien aus dem Radio nehmen und sie mit dem
		Aufnahmeger&auml;t benutzen. Danach die Kassette ins
		Aufnahmeger&auml;t einlegen. Nachdem Ihr das B&uuml;ro
		verlassen habt, m&uuml;&szlig;t Ihr zu Onkel Wanja. Dort
		ergreift Ihr die Dollars, die in der Schublade in EUrem
		Schlafzimmer liegen. In der Abteilung P angekommen, quatscht
		Ihr mit Wowlow. Verklickert ihm, da&szlig; Ihr die Kassette
		geh&ouml;rt habt und somit &uuml;ber das Codewort "Hollywood"
		Bescheid wi&szlig;t. Nach ein paar Gespr&auml;chen werdet Ihr
		zu einer Bar<BR>
		<BR>
		geschickt. DOrt d&uuml;rft Ihr keinesfalls die Namen Hollywood
		oder 2.K&auml;ufer gegen&uuml;ber Romeo erw&auml;hnen. Der
		Barkeeper Juri sagt Euch, wo sich der Club befindet, und gibt
		Euch den Tip, mal die Hausbewohner auszuhorchen. Geht jetzt
		raus, nach links in die Seitenstra&szlig;e und flugs die
		T&uuml;r rein. Blo&szlig; nicht das Licht anmachen! Im Dunkeln
		die Treppe hoch und hier ein Streichholz anz&uuml;nden. Nun
		k&ouml;nnt Ihr Euch alles anschauen. Schon bald hat Euer
		geschultes Auge ein Clipboard ersp&auml;ht, das Ihr
		nat&uuml;rlich sofort einsackt. Hinterher geht`s wieder
		&uuml;ber die Seitenstra&szlig;e weiter zum Wohnblock. Die
		steilen Treppen f&uuml;hren nach oben zum Apartment 7. Hier
		hausen zwei Frauen, die Euch hereinbitten, wenn Ihr etwas von
		einer Meinungsumfrage faselt. In der WOhnung stellt Ihr Eure
		L&uuml;ge erstmal richtig, erw&auml;hnt aber mit keinen Wort
		den KGB, die Miliz oder gar das schlimme Wort Privatdetektiv.
		Die nette Dame schickt EUch daraufhin weiter zu Belussow, der
		im Apartment 5 wohnt. Fragt Ihn &uuml;ber seine Gefangenschaft
		aus und eilt weiter zum alten Zausel in Apartment 4. Er
		wei&szlig; einiges &uuml;ber die Insel Wrangel zu berichten und
		gibt bereitwillig &uuml;ber den Fleischladen und seinen
		Besitzer Anatoli Auskunft. Was liegt also n&auml;her, als den
		guten Anatoli in seinem Laden zu besuchen? Klettert dazu die
		Treppe hoch und la&szlig;t dort das Clipboard liegen.
		Marschiert sodann durch die erste T&uuml;r rechts in den Club.
		H&auml;ndigt dem Manager die Aufnahmegeb&uuml;hr von 30 Dollar
		aus und wartet, bis der Punker, der gerade die toilette
		betreten hat, von seinem Klogang wieder zur&uuml;ckgekehrt ist.
		Einem dringenden Verdacht folgend, betretet Ihr ebenfalls das
		stille<BR>
		<BR>
		&Ouml;rtchen und entdeckt im Abfalleimer Kokain. Schickt es per
		Klosp&uuml;lung zu den Ratten in die Kanalisation. Falls Ihr
		mit dem Clubmitgliedern redet, erw&auml;hnt nicht Hollywood
		oder 2.K&auml;ufer. Kn&ouml;pft Euch jetzt Video, den Punker,
		vor. Dieser will Euch ein Video andrehen. Geht auf diesen deal
		ein, denn nur dann r&uuml;ckt er mit der Sprache &uuml;ber die
		Zwillinge raus. Plaudert hinterher ein paar Takte mit den
		Schl&auml;gern Petka und Ljonka und folgt ihnen. Etwas
		sp&auml;ter m&uuml;&szlig;t Ihr Ljonka niederschlagen und seine
		Kleidung nach einem Dietrich durchsuchen. Nachdem Ihr den
		praktischen T&uuml;r&ouml;ffner gefunden habt, beseitigt Ihr in
		guter KGB-Tradition die Leiche im M&uuml;lleimer, der sich ein
		Bild weiter rechts befindet. Nun k&ouml;nnt Ihr die
		Nebent&uuml;r des Fleischladens &ouml;ffnen und
		hereinspazieren. Tastet Euch bis zur Kassierertheke vor,
		z&uuml;ndet dort ein Streichholz an und aktiviert die Diode
		hinter der Theke. Ihr k&ouml;nnt den K&uuml;hlraum betreten.
		Dort schaltet Ihr das Licht an und untersucht die Kadaver. Mal
		sehen, was der Besitzer zum Fund in seiner Riesenk&uuml;hltruhe
		zu sagen hat. Bevor Ihr Euch zum Apartment 6 begebt,
		verge&szlig;t nicht, im Fleischladen erneut ein<BR>
		<BR>
		Streichholz zu entz&uuml;nden und die Diode auszuschalten.
		Nachdem Ihr mit Anatoli gesprochen habt, verweist er Euch auf
		das Apartment 8, das Heim einer alten Lady. Wartet am Flur, bis
		Oma ihr Zikmerchen verlassen hat, und verschafft Euch dann mit
		dem Dietrich Zutritt zu ihrem Apartment. Drinnen schleicht Ihr
		schnell ins Studio und nehmt die Videokassetten aus der
		Schublade. Den Videorecorder f&uuml;ttert Ihr mit den Videos
		und wartet, bis Werto uns seine Leute eintreffen. Ihr wacht
		einige Momente sp&auml;ter in einem kleinen Raum auf.
		Untersucht den Tisch und zerdr&uuml;ckt die Wanze. &Uuml;ber
		kurz oder lang taucht ein Girl namens Rita bei Euch auf. Ihr
		d&uuml;rft dem M&auml;del keinerlei Informationen preisgeben.
		Wenn daraufhin der Ami erscheint, bittet Ihr ihn, Rita laufen
		zu lassen. Belauscht nun das Gespr&auml;ch hinter der T&uuml;r
		und zeigt dem Ami die kaputte Wanze. Bei einem Blick auf die
		Klingel kommt Euch eine z&uuml;ndende Idee: Erkl&auml;rt dem
		Ami, da&szlig; eben diese Klingel mit dem K&uuml;hlraum des
		Fleischladens verbunden ist und da&szlig; er doch so gut sein
		und ein wenig mit dem Alarm spielen soll. Wie geplant,
		verl&auml;&szlig;t Werto die Wohnung und Ihr k&ouml;nnt in
		aller Ruhe mit Rita palavern. Versichert Ihr glaubhaft,
		da&szlig; Ihr allein wi&szlig;t, wo das Kokain ist, weil Ihr es
		ja schlie&szlig;lich genommen habt. Sobald Rita die T&uuml;r
		&ouml;ffnet, greift sie an und la&szlig;t den Ami gehen. Nehmt
		alle Objekte in der Schublade und im Studio,
		einschlie&szlig;lich der Polaroidkamera mit. Fotografiert das
		wei&szlig;e Blatt Papier und betrachtet das Foto eingehend.<BR>
		<BR>
		Legt das wei&szlig;e Blatt wieder zur&uuml;ck in die Schublade,
		versteckt Euch hinter der Wohnungst&uuml;r und wartet auf
		Werto. Sobald er die Wohnung betritt, schlagt ihn schnell
		nieder und durchsucht den bewu&szlig;tlosen K&ouml;rper. Das
		blaue Blatt, das dabei zum Vorschein kommt, wird ebenfalls
		fotografiert. Werft einen kurzen Blick auf das gerade
		gefertigte Foto, legt das Papierst&uuml;ck wieder zu Werto und
		begebt Euch zur Abteilung P. Hier kommt Ihr ins Gespr&auml;ch
		mit Galischkin. Ihr antwortet ihm auf seine Fragen der Reihe
		nach mit LENINGRAD, LADOGA PARK, DREI UHR NACHMITTAGS,
		16.AUGUST 1991 und schon werdet Ihr nach Leningrad und damit
		ins zweite Kapitel geschickt.<BR>
		<BR>

		<FONT SIZE="+1">Kapitel 2:</FONT>
		<BR>
		Wartet im Hotelzimmer, bis das Telefon l&auml;utet.
		Ihr hebt ab und antwortet. Trabt dann ins Badezimmer, macht das
		Licht an und inspiziert die Neonr&ouml;hre, worauf Ihr eine
		verschl&uuml;sselte Botschaft findet. Um sie zu entziffern,
		m&uuml;&szlig;t Ihr den KGB Moskau anrufen und Gusenko
		verlangen. DIeser gibt Euch ein Paar Tips. Schaltet also das
		Licht dreimal hintereinander ein und aus, w&auml;hlt die
		Telefonnummer 37452 und macht Euch auf die Socken zur Abteilung
		7. Am Eingang m&uuml;&szlig;t Ihr all Eure Items au&szlig;er
		dem Ausweis liegen lassen. Drinnen zeigt Ihr Euren KGB-Ausweis
		dem T&uuml;rsteher und erkl&auml;rt ihm, da&szlig; Ihr in der
		Abteilung 7 von Kusnetsow erwartet werdet. Er h&auml;ndigt Euch
		einen Passagierschein aus, mit dessen Hilfe Ihr an den Wachen
		vorbei zu Kusnetsow gelangt. Bittet ihn h&ouml;flich um ein
		Gespr&auml;ch mit den anderen Offizieren. Trabt mit seiner
		Erlaubnis<BR>
		<BR>
		zu Agabekow (mittlere T&uuml;r). Nach einem
		Plauderst&uuml;ndchen mit ihm geht`s Richtung Ausgang. Bevor
		Ihr Richtung Ladoga-Park aufbrecht, verge&szlig;t nicht, Eure
		Habesligkeiten am Ausgang abzuholen. Im Park schaltet man die
		Option aufnehmen des Aufnahmeger&auml;ts ein, plaziert ein Bild
		weiter links das Mikrofon auf die Bank und versteckt sich
		hinter dem Baum. Jetzt warten: Um 14.55 kommt Sawtschenko, um
		15.05 Romeo. SObald beide den Park wieder verlassen haben,
		sackt man das Mikro wieder ein und folgt Sawtschenko.
		&Uuml;brigens: Das Aufnahmeger&auml;t NICHT ausschalten. An der
		U-Bahn trifft sich unser Briderchen mit Tschapkin. Folgt Ihm
		weiter zum Lagerhaus, benutzt die Kamera mit Sawtschenko,
		wartet, bis er rein-und rausgeht, gebt den Code 14C9A ein und
		spaziert hinein. Legt das Aufnahmeger&auml;t in den hinteren
		Teil des Lagerhauses auf die Kisten und geht im Anschlu&szlig;
		daran ins B&uuml;ro. Hier benutzt Ihr das Mikrofon mit dem
		Schreibtisch und verschwindet wieder. Nun gehts die Leiter
		hinauf. &Ouml;ffnet das Fenster, und begebt Euch wieder zum
		EIngang des Lagerhauses. Stattet der Bar einen Besuch ab,
		erklimmt die treppen, &ouml;ffnet auch hier das Fenster und
		zw&auml;ngt Euch hindurch. Auf der anderen Seite klettert Ihr
		durch das ge&ouml;ffnete Fenster ins Lager zur&uuml;ck und
		versteckt Euch hinter den Kisten: Um 16.12 betreten Sawtschenko
		und ein anderer Mann das B&uuml;ro. Um 16.30 kommt Obukow.
		Sobald dieser das Lagerhaus verl&auml;&szlig;t, folgt Ihr<BR>
		<BR>
		ihm hinaus, nehmt jedoch den Weg durch die Fenster. Beschattet
		Obikow bis zum Hotel Sjewjernaja Zwjezda - er wird sich an der
		Cocktailbar des Hotels mit Agabekow unterhalten. Heftet Euch
		wieder an seine Fersen, wenn er zur&uuml;ck ins Lagerhaus eilt.
		Verschanzt Euch erneut hinter den Kisten (nehmt den Weg
		&uuml;ber die beiden Fenster) und wartet, bis er es
		verl&auml;&szlig;t. Benutzt nun das Aufnahmeger&auml;t mit den
		Kopfh&ouml;rern. Spult alle Aufnahmen zur&uuml;ck und h&ouml;rt
		sie der Reihe nach ab. W&auml;hlt danach wieder die Option
		aufnehmen und legt den Apparat zur&uuml;ck auf die Kisten.
		&Uuml;ber die Fenster geht`s weiter zum Hotel Gostinitsa. Dort
		rein in die Nebenstra&szlig;e und warten, bis ein Typ
		vorbeikommt und das Pa&szlig;wort Halsabschneider
		fl&uuml;stert. Zeigt ihm Euren Ausweis und beantwortet ihm
		seine Fragen mit den S&auml;tzen, die die W&ouml;rter Zigarre,
		Sawtschenko und m., Viktor Masnew, Crack und Agabekow der Reihe
		nach enthalten.<BR>
		<BR>
		Ist der geheimnisvolle Mann aus dem Nichts eben wieder dorthin
		verschwunden, d&uuml;rft Ihr Euch von Euren gro&szlig;en Taten
		auf dem Hotelzimmer 205 bis 19.30 ausruhen. Denn genau um diese
		Uhrzeit bringt Euch ein gewisser Sawinkow eine Leiche vorbei.
		Untersucht den toten K&ouml;rper und nehmt alle Objekte, die er
		bei sich f&uuml;hrt, an Euch. Streift seinen Mantel &uuml;ber
		und setzt seinen Hut auf, bevor Ihr den Toten in das Badezimmer
		schleppt. W&auml;hlt jetzt die Nummer, die Ihr bei der Leiche
		gefunden habt, und antwortet mit ja, Kommen Sie her. und Kommen
		Sie her. L&ouml;scht das Licht und wartet auf den Komplizen des
		toten. Bittet den Knaben freundlich herein, sobald er an die
		T&uuml;r klopft. Savinkow leistet ganze Arbeit, und mit lautem
		Krachen sinkt der Abk&ouml;mmling zu Boden. Berichtet Savinkow
		&uuml;ber alle Vorf&auml;lle und schlendert, nachdem er Euch
		verlassen hat, ins Badezimmer. Betrachtet Euch im Spiegel und
		entledigt Euch Eures Mantels sowie Huts und kleidet die Leiche
		damit neu ein. Bringt den Kadaver &uuml;ber den Flur durch die
		letzte T&uuml;r links zum Besoffen. Schaltet hier das Licht an
		und nehmt die Flasche Wodka, die auf dem Bett liegt. Benutzt
		den Wodka mit der Leiche, eilt mit dem restlichen Wodka runter
		zur Allee und gebt die Flasche den Pennern. Zur&uuml;ck im
		Zimmer des Betrunkenen, schiebt man die Leiche aus dem Fenster
		und begibt sich abermals zur Rezeption. Damit Ihr den Rollstuhl
		entwenden k&ouml;nnt, m&uuml;&szlig;t Ihr dem Mann an der
		Rezeption weismachen, da&szlig; oben jemand h&ouml;llischen
		L&auml;rm macht. Der Portier will unbedingt sofort nachsehen,
		was sich da wohl abspielen mag- sein Pech, denn so k&ouml;nnt
		Ihr Euch gefahrlos den Rollstuhl hinter der Rezeption
		schnappen. Schiebt ihn<BR>
		<BR>
		nun zur Allee, ladet Eure Leiche ein und rollt mit ihr ein Bild
		nach links, zum Kanal. Wartet hier, bis die Miliz gestochenes
		Schrittes vorbeimarschiert ist, und versenkt schlie&szlig;lich
		den Toten in den Fluten des Kanals. Lauft zur&uuml;ck in Euer
		Hotelzimmer und wartet auf Savinkow. Seinen Anweisungen zufolge
		begebt Ihr Euch zum Hotel Sjewjernaja Zwjezda. Dort plauscht
		Ihr friedlich an der Cocktailbar mit Natascha, bis eine nadere
		Frau sich dazugesellt. Diese stramme Russin, die &uuml;brigends
		auf den h&uuml;bschen Namen Tamara h&ouml;rt, hat sicher auch
		so einiges zu erz&auml;hlen- redet mit ihr, bis der Amerikaner,
		Mr. Greenberg, auftaucht. Sobald Ihr versucht, den Ami in ein
		Gespr&auml;ch zu verwickeln, bittet Euch eine Frau namens
		Wallace, ihr zu folgen. Nachdem auch sie ihre Sorgen bei Euch
		losgeworden ist, kn&ouml;pft Ihr der Lady etwas Geld ab und
		geht wieder an die Bar zu Greenberg. Tauscht mit ihm
		Informationen aus. Berichtet ihm von Eurem
		F&uuml;hrungsoffizier Savinkow, davon, was Ihr am Nachmittag so
		getrieben habt, und vereinbart schlie&szlig;lich ein neues
		Treffen mit ihm. Jetzt ist wieder Tamara an der Reihe. Zeigt
		Ihr das Geld und begleitet sie auf ihr Zimmer. Dr&uuml;ckt ihr
		oben die paar Kr&ouml;ten in die Hand und versichert ihr,
		da&szlig; Ihr nur reden wollt. Die<BR>
		<BR>
		Zimmernummer ihres zweiten Apartments kostet Euch abermals
		etwas Kleingeld, aber daran solls ja nicht scheitern. Fahrt nun
		mit dem Aufzug in den vierten Stock, bestecht die Putzfrau mit
		0 Dollar und schaut Euch in Zimmer 46 um. Werft einen Blick in
		den Spiegel, bevor Ihr den Aschenbecher vom Tisch mit aller
		Kraft dagegen pfeffert. Im Geheimraum dahinter findet Ihr auf
		dem Tisch ein Polaroidfoto. Stopft es in Euer Inventar und eilt
		zum Lagerhaus, um das Aufnahmeger&auml;t abzuh&ouml;ren. Begebt
		Euch daraufhin in Euer Zimmer (im Hotel Gostinitsa), schaltet
		das Aufnahmeger&auml;t auf stimm-aktivierte Wiedergabe und
		entfernt die Kopfh&ouml;rer. Legt die Kopfh&ouml;rer aufs Bett
		und Euch gleich daneben. Um 6.30 werdet Ihr von Tschapkin aus
		dem Schlaf gerissen. Folgt ihm ins Badezimmer uns sagt den Satz
		auf, der das Wort REDEN enth&auml;lt. Das Aufnahmeger&auml;t
		nimmt schlagartig seine Arbeit auf, woraufhin Ihr Tschapkin
		eins &uuml;berbraten k&ouml;nnt. Untersucht den
		bewu&szlig;tlosen Russen und nehmt Euch seiner Habseligkeiten
		an. Spritzt ihm das Wahrheitsserum, und quetscht den
		st&ouml;rrischen Erzkommunisten wie eine Zitrone aus. Um punkt
		7.00 schneit Savinkow zur T&uuml;r herein. Nachdem Ihr einen
		vollst&auml;ndigen m&uuml;ndlichen Bericht abgeliefert habt,
		verschwindet er wieder, und Ihr schlummert sanft ein. Wieder
		wach, gehts sogleich runter zur Allee. Haltet dort einen
		Penner, der gerade vorbeil&auml;uf, auf und fragt ihn nach
		seiner Zeitung. Gebt ihm als Gegenleistung die Kamera. In der
		Zeitung findet Ihr eine Botschaft. Trabt also ab zur
		Telefonzelle und wartet,<BR>
		<BR>
		bis das Telefon klingelt. Hebt ab, fl&uuml;stert
		Halsabschneider und befragt den Anrufer nach Herzenslust.
		H&auml;ngt dieser schlie&szlig;lich ein, schlendert Ihr zum
		Ladoga-Park. Um die Mittagszeit trefft Ihr hier Greenberg.
		Wechselt ein paar Worte mit ihm, und schon gehts automatisch
		ins n&auml;chste Kapitel.<BR>
		<BR>

		<FONT SIZE="+1">Kapitel 3:</FONT>
		<BR>
		St&uuml;rzt Euch sofort ins k&uuml;hle Na&szlig;,
		schwimmt bis zur Viktor Masnew, schleicht an Bord und versteckt
		Euch hinter den Fischkisten. Nachdem der Mechaniker das Deck
		verlassen hat, steigt runter zum Funkraum. Im Aufenthaltsraum
		sollten alle Objekte, die sich unter dem Bett befinden, in Euer
		Inventar wandern. Geht wieder an Deck und schleudert die
		Flasche links vom Boot ins Wasser. Der Mechaniker springt
		entschlossen hinterher- Ihr jedoch sprintet zum Heck und dann
		runter in den Maschinenraum. Verkriecht Euch schnell im Schrank
		und wartet, bis der Mechaniker zur&uuml;ckkehrt und tief und
		fest schl&auml;ft (davor betreten noch mehrere andere Leute den
		Maschinenraum). Benutzt nun den G&uuml;rtel mit dem Motor,
		verschanzt Euch bis 21.30 in Eurem Versteck und begebt Euch im
		Anschlu&szlig; daran zum Bug. Harrt hinter den Fischkisten bis
		24.00 Uhr aus. Ihr seht viele Personen kommen und wieder gehen.
		Folgt den Leuten, die runter zum Funkraum gegangen sind, und
		horcht dort an der T&uuml;r des Aufenthaltsraums. Dann wieder
		rauf, verstecken und warten bis 5.00. Wenn alle gegangen sind,
		ist es Zeit, zum Heck zu laufen und dort den anbrechenden Tag
		willkommen zu hei&szlig;en (6.45). Um 7.30 erreicht Ihr endlich
		den Hafen und springt ins Meer. Ende Kapitel 3.<BR>
		<BR>

		<FONT SIZE="+1">Kapitel 4:</FONT>
		<BR>
		Besucht Abteilung 7. Anstatt jedoch hineinzugehen,
		folgt Ihr Agabekow, der das Geb&auml;ude mit dem AUto um 9.15
		verl&auml;&szlig;t, in einm Taxi (einfach den roten Pfeil
		anklicken). Nach einer kurzen Fahrstrecke findet Ihr Euch vor
		einer Irrenanstalt wieder. Betretet diese und zeigt den
		Wachposten Euren AusweisIhr werdet zum DIrektor der Anstalt
		gef&uuml;hrt. Gebt Euch als Kollege von Agabekow aus und stellt
		ein paar Fragen. Dringt dann &uuml;ber Raum 3 bis ins
		gr&uuml;ne Zimmer vor. Pa&szlig;t hier den Professor ab und
		verzapft auch diesem, da&szlig; Ihr Rukow, Agabekows Kollege
		seid. Nach dieser Auskunft f&uuml;hrt Euch n&auml;mlich der
		alte Nervendoc in sein Labor. Gesteht ihm hier, da&szlig; Ihr
		gelogen habt und doch nicht Agabekows Kollege seid. Daraufhin
		verl&auml;&szlig;t der Professor wutentbrannt das Labor. Jetzt
		hei&szlig;t es schnell handeln: In Windeseile wird der Knopf
		ganz rechts vom Tisch gedr&uuml;ckt, und der Professor ist im
		gr&uuml;nen Zimmer gefangen. La&szlig;t Euren Gefangenen ruhig
		so lange schmachten, bis er freiwillig auspackt. Stellt ihm via
		Mikrofon einige Fragen &uuml;ber die Schwester Sanejewa,
		&uuml;ber Protopopow, &uuml;ber Agabekow und &uuml;ber die
		Patienten in den R&auml;umen 1,2 und 3. Zw&auml;ngt Euch danach
		in den Schrank- Ihr werdet eine Vision haben. Befreit
		anschlie&szlig;end per Knopfdruck den Wissenschaftler und
		wandert durch die G&auml;nge zum Patienten in Raum 3. Sagt ihm
		einfach SPEICHEL und<BR>
		<BR>
		hat gleich wieder ab. In der Anstalt gibt es sonst nichts mehr
		f&uuml;r Euch zu erledigen, also fahrt zum Hotel Gostinitsa
		zur&uuml;ck. Ein Informant steckt Euch hier die Adresse von
		Jakutschew-, na dann mal nix wie hin! Im Haus, das zu der
		angegebenen Adresse geh&ouml;rt, treibt bereits Greenberg sein
		Unwesen. Quetscht ihn zu den Stichw&ouml;rtern "das Vaterland",
		"die Bibel der Erinnerungen" sowie "das Buch des Todes" aus; er
		wird Euch ein Buch aush&auml;ndigen, das bei n&auml;herer
		Betrachtung eine weitere Adresse enth&auml;lt. Dieser neue
		Hinweis f&uuml;hrt Euch zu einer Galerie. Wartet in der
		Bilderausstellung, bis die Managerin den hinteren Teil der
		Galerie betritt, und versteckt Euch flugs im Schrank. Nachdem
		die beiden Damen abgezogen sind, schaltet Ihr das Licht aus
		(der Schalter befindet sich zwischen den beiden Bildern) und
		schleicht in den hinteren Teil der Galerie. Entfernt das
		Schwert von der Statue, nehmt den Brief&ouml;ffner vom
		Schreibtisch und benutzt ihn mit der Statue: Der Zugang zu
		einem Geheimgang wird frei! Hier im Verborgenen entdeckt Ihr
		Gorbis Doppelg&auml;nger. Nehmt ihn genauestens unter die Lupe,
		denn kurz darauf erscheint Sawinkow mit Wowlow. Wowlow
		erschie&szlig;t vor Euren Augen Sawinkow und befielt Euch,
		Protopopow zu t&ouml;ten. Ihr verweigert diesen Befehl
		selbstmurmelnd und wartet ab, bis Onkel Wanja und Jegor
		dazusto&szlig;en. Jegor setzt wowlow mit einem gewaltigen
		Schlag f&uuml;r kurze Zeit au&szlig;er Gefecht- diese kleine
		Zeitspanne der Unaufmerksamkeit macht Ihr Euch zunutze und
		schnappt Savinkows Waffe. In einer reflexartigen Bewegung
		versetzt Ihr dem &Uuml;belt&auml;ter Wowlow den
		Gnadenschu&szlig;, und HAPPY END.<BR>
		</P>
		</TD>
	    </TR>
	    </TABLE>
<!Innere Tabelle>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
