<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>CURSE OF ENCHANTIA</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tut0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tut.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#F0F0F0">
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
<!Innere Tabelle>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="90%">
	    <TR>
		<TD>
		<H2 ALIGN="CENTER">CURSE OF ENCHANTIA</H2>

		<P>
		Nachdem man bemerkt hat, da&szlig; es noch etwas sch&ouml;neres
		im Leben gibt, als gefesselt an einer Wand zu h&auml;ngen,
		entschlie&szlig;t man sich, um Hilfe zu rufen. Sofort eilt der
		tolpatischige Wachposten herbei, um nach dem Rechten zu sehen.
		Beim Hinausgehen stolpert er &uuml;ber eine Stufe und
		l&auml;&szlig;t den Schl&uuml;ssel f&uuml;r die
		Fu&szlig;schellen fallen. Danach die Mauer bearbeiten und die
		erscheinende B&uuml;roklammer einstecken. Mit dieser
		l&auml;&szlig;t sich n&auml;mlich die Kerkert&uuml;r
		&ouml;ffnen. Auf dem weiteren Weg nach links l&auml;&szlig;t
		man in Vorbeigehen das Goldfischglas und die unz&auml;hligen
		Diamanten mitgehen. Auf dem Meeresboden steht man
		schlie&szlig;lich bis zum Scheitel im Wasser und es ist
		angebracht, das runde Aquarium als Taucherhelm zu benutzen. Nun
		befreit man den Fisch aus seinem Gef&auml;ngnis, woraufhin man
		aus Dankbarkeit eine Muschel erh&auml;lt. Etwas weiter findet
		man im Sand einen Regenwurm, den man bei Mr. Fish f&uuml;r
		etwas Luft eintauschen kann. Der orientierungslosen
		Schildkr&ouml;te bietet man die Muschel an. Diese zeigt sich
		sofort begeistert und bringt den Helden gefahrlos an den
		Zitteraalen vorbei. Im seegras liegt eine Harpune, die gegen
		den nun folgenden Hai benutzt werden mu&szlig;. Vor allem
		richtiges Timing ist an<BR>
		<BR>
		dieser Stelle erforderlich. Danach gelangt man zu einer
		Riesenmuschel, die nur im geschlossenen Zustand
		&uuml;bersprungen werden kann. Der st&ouml;psel l&auml;&szlig;t
		sich mit Hilfe der Stange &ouml;ffnen und man findet sich
		schlie&szlig;lich in einer H&ouml;hle wieder. Hier k&ouml;nnen
		die Algen von den Felsen abgekratzt werden und der Schalter an
		der Wand legt den weiteren Weg frei. In den R&auml;umen die man
		im Anschlu&szlig; durchwandern darf, sammelt man alle
		herumliegenden Felsbrocken ein und bringt sie zum meditierenden
		Steinhauer, der diese bereitwillig zertr&uuml;mmert. Nun begibt
		man sich auf die Suche nach Stock, Monitor und M&uuml;nze. Im
		Raum mit dem Magneten legt man zun&auml;chst das Brett auf den
		Felsen, was eine hervorragende Wippe ergibt. Anschlie&szlig;end
		mu&szlig; der Monitor geworfen werden, wodurch man den
		erstrebten Gegenstand schlie&szlig;lich erreichen kann. Als
		n&auml;chstes verbindet man den Stock mit den Algen und den
		Magneten mit der Schnur, die man bis dahin ebenfalls gefunden
		haben sollte. Nun angelt man sich mit den Magneten den Draht
		aus einem Loch in der Wand. Der Draht wird nun durch die
		&Ouml;sen als Stolperdraht gespannt, um den permanent
		auftauchenden Schlamm-Monster seinen Rumpf abzutrennen. Den
		&uuml;briggebliebenen Schlamm kann man mit dem Algenstab
		verbinden. Die M&uuml;nze wird in den Brunnen geworfen. Der nun
		entegengenommene Helm erm&ouml;glicht das gefahrlose<BR>
		<BR>
		Durchschreiten des Steinschlages. Auf dem Grund im jetzt
		angekommenen Brunnen steigt man in den Eimer und schmiert sich
		den Schlamm ins Gesicht. Nachdem man an der Erdoberfl&auml;che
		angekommen ist, macht man sich auf den Weg in die naheliegende
		Stadt. Unterwegs begegnet man einem Pirat, der sich aber mit
		seinem eigenen Schwert vertreiben l&auml;&szlig;t. In der Stadt
		sollte man sich erteinmal etwas &Uuml;bersicht verschaffen und
		alle H&auml;user betreten. Dem Magier gibt man das Geld,
		woraufhin er einen kleinen Beamspruch zum besten gibt. Man
		befindet sich danach auf einem kleinen Felsvorsprung an einer
		steilen Klippe. Benutzt man hier die Schalter in der richtigen
		Reihenfolge, so f&auml;hrt eine Br&uuml;cke aus, auf deren
		anderen Ende ein Kleid liegt. Dieses wird nat&uuml;rlich sofort
		angezogen. Sobald man den Steinschlag &uuml;berwunden hat,
		merkt man, da&szlig; man dort einen kleinen Felsbrocken
		vergessen hat. Nun legt man den kleinen Stein auf den Kopf,
		wodurch man einen etwas gr&ouml;&szlig;eren Stein findet.
		Diesen wirft an an den gro&szlig;en Felbrocken, der uns den
		weiteren Weg freigibt. Das am Boden liegende Seil wirft man
		&uuml;ber den n&auml;chsten Abhang und gelangt so ans andere
		Ende. Hier st&ouml;&szlig;t man auf eine Zauberformel, die
		sogleich von der Wand abgelesen wird. Durch diesen magischen
		Einflu&szlig;<BR>
		<BR>
		&ouml;ffnet sich nun der Felsen und legt eine H&ouml;hle frei.
		Man trifft auf einen kleinen putzigen Zauberlehrling, der
		ebenfalls einen netten Beamspruch auf Lager hat. Vom
		st&auml;dtischen Magier wird man in ein Schwein verwandelt,
		sobald man ihm mehr Geld bietet. Diese Sch&ouml;nheitskorrektur
		erm&ouml;glicht nun in der linken Seitengasse an der Wache
		vorbeizuschleichen. In der anschlie&szlig;enden Landschaft
		sammelt man nun Heu, Brief und Briefmarke, Servierplatte, Socke
		und Kassette ein. Der Brief wird mit der Briefmarke frankiert
		und in den Briefkasten geworfen. Das Heu hilft der triefenden
		Nase, indem man es in die Nasenfl&uuml;gel steckt. Die Kassette
		wird in die Aufnahmestation gesteckt und in einem anderen
		Bildschirm wird eine Fernbedienung erreichbar. Mit dieser zielt
		man nun auf die Aufnahmestation, damit man die Kassette wieder
		herausnehmen kann. Diese musikalische Meisterleistung wird nun
		den DJ in der H&ouml;hle &uuml;bergeben. An diesem Ort nimmt
		man die Spraydose mit und am Schatzberg wird der Socken mit
		Gold gef&uuml;llt. Den Strumpf kann man nun dem Roboter vor dem
		Schiffswrack an den Kopf werfen. Nach etwas T&uuml;ftelarbeit
		erreicht man schlie&szlig;lich das Goldpapier und l&auml;uft
		zur&uuml;ck zur Rockgruppe. Hier steckt man die Scheckkarte in
		die T&uuml;r. Hinter dieser Himmelspforte findet man einen
		wertvollen Geldsack. Nachdem man<BR>
		<BR>
		von der Wolke gesprungen ist, pr&auml;sentiert sich ein
		Geheimgang, an dessen anderen Ende eine Gittert&uuml;r den Weg
		versperrt. Wie ein ge&uuml;bter Kriminalist benutzt man nun die
		Spraydose und danach das Goldpapier, um einen versteckten
		Schalter an der Wand sichtbar zu machen. Sobald das Gitter nach
		oben f&auml;hrt, mu&szlig; man den Socken samt Inhalt
		wegwerfen, damit man mit der Servierplatte an den Ventilator
		gelangt. Durch die Hintert&uuml;r kommt man nun ein drittes Mal
		in die Stadt. Es wird Zeit, sich neue Kleidung zuzulegen. Der
		Kost&uuml;mverleih kann da bestimmt weiterhelfen. Wenn man ein
		passendes Kleid anzieht, wird man in ein eisiges Land verbannt,
		in dem man sich erst einmal eine z&uuml;nftige
		Schneeballschlacht liefern mu&szlig;. Danach wird wieder alles
		eingesammelt, was nicht niet-und nagelfest ist. Das Deo
		spr&uuml;ht man sich unter die Achseln, wodurch auch der Eskimo
		endlich ansprechbar wird. er &uuml;berreicht im Gegenzug
		f&uuml;r den gefundenen Fisch eine Angel, mit der ein kleines
		Feuer gesch&uuml;rt werden kann. Der Eskimo taut langsam auf.
		Die Asche der Angel wird mitgenommen. Am linken oberen Ende der
		Eiswelt gelangt man nach einem ver&auml;ngstigten Hilferuf an
		ein Ruderboot. Nachdem dieses Boot an einer Klippe zerschellt
		ist und man mit Nessies Hilfe den Flu&szlig; doch noch sicher<BR>
		<BR>
		&uuml;berquert hat, gelangt man an eine vereiste
		Eingangst&uuml;r, die sich nur durch musikalische Kl&auml;nge
		&ouml;ffnen l&auml;&szlig;t(4,1,3 und 2). In der Halle nimmt
		man den Besen mit und sieht auf dem Tisch drei W&uuml;rfel
		liegen. Je nachdem, wie die W&uuml;rfel gefallen sind, befindet
		sich die folgenden Gegenst&auml;nde in unterschiedlichen
		R&auml;umen. 1.Pistlole, 2.Lupe, 3.Wagenheber,
		4.Eisw&uuml;rfel, 5.Megaphon, 6.Trillerpfeife. Die
		Trillerpfeife ist nur nach Vernichtung einens Eiszapfens
		auffindbar. Die Pistole wird in den Halfter gesteckt, wodurch
		auf der anderen Seite des Raumes ein Glassplitter und eine
		Flasche hinabgelassen werden. Nun verbindet man die
		Trillerpfeife mit dem Megaphon und h&auml;lt es vor das
		Fenster. Nachdem das Glas zerbrochen ist, springt man hindurch.
		Wenn man sich in festen H&auml;nden befindet, sollte man sich
		mit dem gefundenen Sonnel&ouml;l einschmieren, um sich von der
		l&auml;stigen Hand wieder zu l&ouml;sen. Nachdem man den Laser
		mit Hilfe seiner eigenen Energie zerst&ouml;rt hat, &ouml;ffnet
		man die T&uuml;r mit dem Wagenheber. Im folgenden Labyrinth
		findet man eine Streichholzschachtel, mit der man hinter einer
		S&auml;ule den gr&uuml;nen W&auml;chter erledigen kann. Sobald
		man ihn in die Flucht geschlagen hat, nimmt man den
		Feuerl&ouml;scher mit und begibt sich ein viertes und letztes
		Mal in die Stadt. Man besucht schnell den Magier, welcher einen
		Teleport in einem Sarg parat hat. In diesem findet man einen
		Knochen, mit dem man sich gleich wieder befreien kann. Jetzt
		mu&szlig; man sich im Kampf gegen Dracula pers&ouml;nlich
		beweisen. 1. Schaufel benutzen, 2. Am Grabstein r&uuml;tten, 3.
		Knoblauch essen, 4. Kreuz vorzeigen, 5. Etwas Musik machen.<BR>
		<BR>
		Nun kann man den Friedhof beruhigt verlassen. Sobald man im
		Schlo&szlig; den Ring und in der B&uuml;cherei das richtige
		Buch gefunden hat, mu&szlig; der letzte und schwierigste Kampf
		bestritten werden. Um in der Schlacht mit der Hexe als Sieger
		hervorzugehen, saugt man die Geister mit dem Staubsauger ein,
		r&uuml;ttelt am Feuerl&ouml;scher und schaltet den Ventilator
		ein. Jetzt steckt man der Hexe den Ring an den Finger und
		genie&szlig;t den Schlu&szlig; des Spiels.<BR>
		</P>
		</TD>
	    </TR>
	    </TABLE>
<!Innere Tabelle>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
