<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
    <HEAD>
    <META NAME="GENERATOR" CONTENT="HANDMADE">
    <TITLE>CRUISE FOR A CORPSE</TITLE>
    </HEAD>

    <BODY TEXT="#000000" LINK="#0000FF" ALINK="#FF0000" VLINK="#0000FF" BGCOLOR="#B0B0B0">
    <TABLE WIDTH="100%" BORDER="0" CELLPADDING="0" SUMMARY="" BGCOLOR="#000000">
    <TR>
	<TD>
	<MAP NAME="tut0">
	<AREA SHAPE="RECT" COORDS="460,1,550,22" HREF="tut.html" ALT="zur&uuml;ck">
	</MAP> 
	<TABLE ALIGN="CENTER" WIDTH="640" BORDER="2" CELLPADDING="0" SUMMARY="" BGCOLOR="#F0F0F0">
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	<TR>
	    <TD>
	    <BR>
<!Innere Tabelle>
	    <TABLE ALIGN="CENTER" BORDER="0" CELLPADDING="15" SUMMARY="" BGCOLOR="#C0C0C0" WIDTH="90%">
	    <TR>
		<TD>
		<H2 ALIGN="CENTER">CRUISE FOR A CORPSE</H2>

		<P>
		Komplettl&ouml;sung:<BR>
		<BR>
		Wenn in der L&ouml;sung nicht steht, wor&uuml;ber man sich mit
		den Personen unterhalten soll, dann sollte man &uuml;ber alles
		M&ouml;gliche und besonders die neuen Stichpunkte reden. Die
		Zahlen in Klammern geben die Minuten an, die man bei seinem
		fortschritt gutgeschrieben bekommt.<BR>
		<BR>
		Das Spiel beginnt um 8 Uhr morgens in Karabudjans Study. zuerst
		heben wir das Papierk&uuml;gelchen neben dem Aschenbecher auf,
		gl&auml;tten es und k&ouml;nnen es dann lesen(10). Danach gehen
		wir in die Smoking Lounge und reden mit Tom (10).
		Anschlie&szlig;end geht es auf das Oberdeck zu einem
		Gespr&auml;ch mit Suzanne(10), und dann nochmals zu Tom. Nun
		schauen wir bei Daphnes Kabine vorbei und treffen dort Julio,
		mit dem wir uns unterhalten(20). Wenn wir nun wieder in die
		Smoking Lounge gehen, finden wir eine Juweliersquittung, die
		Tom verloren hat(10). Jetzt ist es wieder Zeit, mit Suzanne zu
		reden(10).<BR>
		<BR>
		Hinterher sitzen Tom und Julio in ihren Kabinen, wo wir sie
		besuchen und uns mit ihnen unterhalten. Danach geht es in die
		Bar, wo wir dem Barkeeper den Zettel, den wir am Anfang
		gefunden haben, zeigen. Der gibt uns daraufhin ein Gebetsbuch
		von Father Fabiani, das wir uns anschauen(10). Wir finden darin
		einen Brief, den wir lesen. Jetzt gehen wir in Fabians Kabine
		und schauen uns dort um. Unter dem Nachttisch finden wir einen
		schwarzen Koffer, den wir hervorziehen und &ouml;ffnen(10).
		Mittlerweile wurde der Dining Room ge&ouml;ffnet, und wir
		treffen auf Fabian, mit dem wir sprechen(10). Danach geht es zu
		einem gespr&auml;ch mit Tom &uuml;ber Fabian(10) und wieder
		zur&uuml;ck zu Fabian zwecks Gespr&auml;ch &uuml;ber Tom(10).
		In der Zwischenzeit ist Julio aus unserer Kabine verschwunden,
		hat aber einen Schl&uuml;ssel verloren, den wir aufheben(10).
		Mit diesem Schl&uuml;ssel l&auml;&szlig;t sich der Schreibtisch
		im Arbeitszimmer &ouml;ffnen, worin wir ein Dankschreiben(10)
		und ein Schmuckkistchen finden. Dieses enth&auml;lt ein
		Kolloer, dessen Verschlu&szlig; wir genauer untersuchen(10).
		Nun gehen wir zur&uuml;ck zum Dining Room, &ouml;ffnen die
		hinterste Schublade des Schrankes und nehmen die
		Verlobungskarten von Julio und Daphne mit(10). Jetzt gehen wir
		auf das rechte Oberdeck und k&ouml;nnen von dort aus eine Szene
		mit Tom und Rebecca verfolgen(10). Danach schauen wir uns den
		Laundry Room genauer an und durchsuchen dort den vordersten
		W&auml;schekorp. Im Bademantel entdecken wir eine Halskette mit
		einem Bild von Daphne(10).<BR>
		<BR>
		Endlich k&ouml;nnen wir auch mit dem Butler sprechen, dessen
		Kabine nun offen ist. In der Smoking Lounge treffen wir wieder
		auf Tom, mit dem wir uns unterhalten(10), in der Rear Hall
		k&ouml;nnen wir Dick Schmock in ein Gespr&auml;ch
		verwickeln(10), anschlie&szlig;end sprechen wir mit Julio(10)
		in unserer Kabine. Danach besuchen wir Fabiani in seiner Kabine
		(vorher unbedingt anklopfen)(10) und reden schlie&szlig;lich
		mit Dick(10), Hector und Tom. In Daphnes kabine &ouml;ffnen wir
		den linken Wandschrank und durchsuchen den Schminkkoffer. Darin
		finden wir ein Arztrezept, das wir mitnehmen(10). Jetzt schauen
		wir wieder in der Bar vorbei und sacken den Whiskey und das
		Glas ein(10). Danach gehen wir zu Suzanne auf das Oberdeck,
		spendieren ihr einen Drink und k&ouml;nnen dann mit ihr reden
		(10,10), insbesondere &uuml;ber das Rezept f&uuml;r Agnes.<BR>
		<BR>
		Nun wieder zu Hector und zu Tom, und mit ihnen Agnes reden,
		danach Dick &uuml;ber Tom und Rebecca ausquetschen(10). Fabian
		erz&auml;hlt uns schlie&szlig;lich die ganze Geschichte
		&uuml;ber Agnes(10). Wenn wir jetzt durch das Bullauge in
		Rebeccas Kabine linsen, k&ouml;nnen wir ein interessantes
		Gespr&auml;ch belauschen(10). Nebenan gehen wir in Suzannes
		Kabine und durchsuchen den Kleiderhaufen im linken Wandschrank.
		Den Zeitungsartikel im Briefumschlag(10) lassen wir mitgehen.
		In Fabianis Kabine finden wir eine Taschenuhr hinter der
		zweiten Schrankt&uuml;r(10). Nach einem Gespr&auml;ch mit
		Rebecca in ihrer Kabine geht es weiter in den Laundry Room, wo
		wir im Topf einen Schl&uuml;ssel finden. Anschlie&szlig;end
		reden wir mit dem Butler im Arbeitszimmer und mit Suzanne in
		der Bar, danach fragen wir Julio &uuml;ber die Taschenuhr(19)
		aus Fabianis Kabine.<BR>
		<BR>
		Auf dem Oberdeck treffen wir auf Rose, mit der wir uns erst
		einmal unterhalten(10). Jetzt gehen wir zu Daphnes kabine und
		plaudern mit Daphne(10). Danach geht es zu Unterredungen mit
		Rebecca, Suzanne und Hector. Und da wir gerade so redselig
		sind, fragen wir Fabiani im Speisezimmer &uuml;ber Rose(10),
		und Hector &uuml;ber Mercedes aus(10)und unterhalten uns danach
		mit Julio &uuml;ber Karabudjans Ableben. Jetzt k&ouml;nnen wir
		auf das Oberdeck und Roses Korb durchsuchen(10) und dann mit
		ihr reden(10). Wieder zu Daphne und sie &uuml;ber Rose
		ausfragen. Anschlie&szlig;end k&ouml;nnen wir uns endlich
		ungest&ouml;rt in Toms Kabine umsehen-wir &ouml;ffnen den
		Schrank und nehmen den Brief(10). Danach reden wir mit Rebecca
		&uuml;ber die Pistolenwerbung.<BR>
		Nun gehen wir auf das Oberdeck und werden Zeuge eines
		Mordanschlages auf Suzanne(10). Sobald sie wieder aus dem
		Wasser gefischt wurde, k&ouml;nnen wir mit ihr reden. Auf
		Wunsch von Suzanne gehen wir in ihre Kabine und entdecken das
		verw&uuml;stete Zimmer(10). Neben dem Standspiegel steht eine
		wei&szlig;e Music Box, die wir untersuchen. In das Loch an der
		Seite der Box stecken wir den Schl&uuml;ssel aus der
		Waschkammer und ziehen die Box auf. Sobald sich die Ballerina
		dreht, blockieren wir sie und drehen den Schl&uuml;ssel.<BR>
		<BR>
		Aus dem Geheimfach entnehmen wir den Brief und lesen ihn(20).
		Da Suzanne nicht mehr da ist, suchen wir sie in der Bar auf.
		Pl&ouml;tzlich taucht der Kapit&auml;n auf, und wir folgen
		ihm(10) und beobachten die Szene auf dem Deck.<BR>
		Sobald sie vorbei ist, nehmen wir die am Boden liegende
		Handtasche von Daphne(10). Wir gehen in die Bar zur&uuml;ck und
		sprechen mit Suzanne &uuml;ber den Zeitungsartikel, den Brief
		aus der Music Box und den Brief aus Toms Kabine. Danach bringen
		wir Daphne ihre Tasche zur&uuml;ck und reden mit ihr &uuml;ber
		Agnes Testament.<BR>
		Jetzt machen wir auf dem Deck einen Rundgang, bis wir
		nacheinander von Rebecca, Daphne, Rose und Fabiani in die
		Kabinen gerufen werden(10), anschlie&szlig;end reden wir wieder
		mit Dick &uuml;ber Tom und Rebecca(10). Mittlerweile hat Hector
		eine Nachricht in unsere Kabine gelegt. Wir nehmen sie(10) und
		gehen sofort zu ihm, doch er stirbt vor unseren Augen(10). Da
		die K&ouml;chin verschwunden ist, k&ouml;nnen wir uns endlich
		in der K&uuml;che umsehen. Wir finden einen
		B&uuml;chsen&ouml;ffner, den wir mitnehmen.<BR>
		<BR>
		Auf dem Boden &ouml;ffnen wir zwei Bodenplatten und fahren mit
		dem Aufzug in die Lagerhalle hinab. Mit der Brechstange
		&ouml;ffnen wir die mittlere der drei Kisten, nehmen eine
		B&uuml;chse und &ouml;ffnen sie-zum Vorschein kommt eine
		Handgranate. Neben dem Aufzug hebeln wir das lose Brett mit der
		Brechstange auf und krallen uns die Filmrolle(10). Danach
		schauen wir im Maschinenraum vorbei und nehmen den
		Schraubenzieher von der Tonne mit(10).<BR>
		Jetzt ab in die Smoking Lounge und den Filmprojektor anschauen.
		Die Filmrolle aufsetzen, die zwei Schrauben mit dem
		Schraubenzieher entfernen und die Klappe abnehmen. Den Operate
		Button testen, die Klappe wieder festschrauben, den Projektor
		anschalten und den Film anschauen(10). Danach geht es in die
		Rear Hall, wo wir die Nachricht von Suzanne entgegennehmen(10).
		In Suzannes Kabine untersuchen wir den toten K&ouml;rper(10).
		Danach gehen wir in die Kaj&uuml;te des Kapit&auml;ns, nehmen
		das Buch mit dem A auf dem Buchr&uuml;cken, schlagen es auf und
		schauen uns die Zeichnung an. Jetzt gehen wir wieder ins
		Arbeitszimmer und schauen uns die B&uuml;cher mit den
		Buchstaben auf dem R&uuml;cken genauer an.<BR>
		<BR>
		Wir m&uuml;ssen die B&uuml;cher so in die Reihenfolge bringen,
		da&szlig; man das Wort INCAL lesen kann. Dazu mu&szlig; auch
		das Buch des Kapit&auml;n verwendet werden. (Achtung: Auf der
		linken Seite mu&szlig; eine L&uuml;cke zwischen den
		B&uuml;chern und dem Buchende bleiben.)<BR>
		Nun &ouml;ffnet sich eine Geheimt&uuml;re, durch die wir gehen.
		Beim folgenden Kampf sollte man die rechte Maustaste
		gedr&uuml;ckt halten, bis der Kampf vorbei ist.
		Anschlie&szlig;end untersuchen wir den Mafioso(10,10) und
		nehmen die Puppe(10). Schlie&szlig;lich gehen wir in die
		Smoking Lounge und zeigen Daphne die Puppe(10).<BR>
		Jetzt mu&szlig; nur noch der M&ouml;rder entlarvt werden .<BR>
		<BR>
		Wer ist nun der M&ouml;rder ?<BR>
		<BR>
		Entziffert mal diesen Code :<BR>
		<BR>
		44&nbsp;49&nbsp;43&nbsp;4B&nbsp;20&nbsp;53&nbsp;43&nbsp;48&nbsp;
		4D&nbsp;4F&nbsp;4B<BR>
		<BR>
		alias<BR>
		<BR>
		44&nbsp;49&nbsp;4D&nbsp;49&nbsp;54&nbsp;52&nbsp;49&nbsp;20&nbsp;
		4F&nbsp;53&nbsp;54&nbsp;52&nbsp;4F&nbsp;56&nbsp;49&nbsp;54&nbsp;
		43&nbsp;48<BR>
		</P>
		</TD>
	    </TR>
	    </TABLE>
<!Innere Tabelle>
	    <BR>
	    </TD>
	</TR>
	<TR>
	    <TD><IMG SRC="tut.gif" ALT="" WIDTH="640" HEIGHT="22" BORDER="0" USEMAP="#tut0"></TD>
	</TR>
	</TABLE>
	</TD>
    </TR>
    </TABLE>
    </BODY>
</HTML>
