<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #96 (5.3.2002)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>
<p>Erstmal etwas f&#252;r alle Diskabonennten: Mit der Ausgabe Nr.95 haben alle Diskabo User eine Verl&#228;ngerung bis Ausgabe 100 angeboten bekommen. Dies hat aber nicht den Grund, dass die NC eingestellt wird oder nur noch &#252;ber das Internet erscheint, sondern einfach nur den Sinn und Zweck, alle noch vorhandenen Diskabo`s auf einen einheitlichen Wert zu legen, damit die Rechnungen nicht immer &#252;ber das ganze Jahr verstreut werden. Also, keine Angst: Die NoCover wird es noch sehr lange geben und auch die diesmonatige Beteiligung best&#228;rkt mich auf diesem Weg. Ein Dank an alle, die sich Monat f&#252;r Monat die M&#252;he machen und Beitr&#228;ge schreiben bzw. im Hintergrund f&#252;r die NoCover arbeiten.</P>

<p>Wer sich ebenfalls f&#252;r die NoCover engagieren m&#246;chte, braucht einfach nur Artikel schreiben und wem das widerum nicht so liegt, der kann ja versuchen, bei anderen Amiga Usern f&#252;r die NoCover zu werben. Kostenlose E-Mail Abo`s sind nat&#252;rlich nach wie vor m&#246;glich. Eine kleine E-Mail an kilian@apc-tcp.de reicht v&#246;llig aus.</P>

<p>Was gibt es sonst noch neues? Ach ja, der Andreas Magerl von der Amiga Future hat mich gebeten, die NoCover nicht mehr in Verbindung mit dem APC&amp;TCP zu bringen. Um also letzte Missverst&#228;ndnisse aus dem Weg zu r&#228;umen, sei an dieser Stelle nochmals darauf hingewiesen, dass die NoCover seit einiger Zeit absolut nichts mehr mit dem APC&amp;TCP zu tun hat, sondern lediglich eine Ansammlung von Usern ist, die nach wie vor an den Amiga glauben und anderen bereit sind, ihr Wissen zu vermitteln. Ein Club wie bisher wird es nicht mehr geben, aber mit Rat und Tat stehen wir trotzdem weiterhin zur Seite.</P>

<p>Also, einen sch&#246;nen M&#228;rz w&#252;nsche ich Euch allen und glaubt mir: Es werden diesen Monat einige interessante Dinge rund um Amiga geschehen.....</P>



</p>

<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der
aktuellen NC. See ya,<br>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</b></p>

</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
