<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - Tschingl Bells</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D9.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00DB.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00DA.html">Tschingl Bells</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Tschingl Bells - Single Sells?</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Bis zum Christkind ist es nicht mehr weit. Wir nehmen
die aktuelle Produktpalette von Amiga Int. unter die Lupe und untersuchen
sie auf ihre Weihnachtstauglichkeit.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Hah? Wous is los?</B></H3>&nbsp;

<BR>Manch einer mag jetzt stutzen, wenn in der Einleitung von
&quot;aktueller Produktpalette&quot; die Rede ist. Erbl&ouml;det sich
AmigaScene, Motherboards mit einem Design aus dem Jahre 1991 mit ein paar
drumherumget&uuml;rkten Erweiterungskarten zu versehen und dies als
&quot;aktuell&quot; zu definieren? War denn schon seit Jahren von Amiga
Int. und Inc. in Hardwarerichtung nichts zu h&ouml;ren?<BR>

<BR>Mitnichten! Wer sich auf der Homepage von Amiga Int. etwas umsieht, der
merkt bald, da&szlig; es hier auch eine Abteilung &quot;Produkte&quot;
gibt. Und genau diese nehmen wir als Grundlage f&uuml;r unseren Artikel.
Alles offiziell, keine Patches und Hardwarebasteleien notwendig,
Schraubenzieher und L&ouml;tkolben d&uuml;rfen im Werkzeugkasten
bleiben.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Boingpad</B></H3>&nbsp;

<BR>Auf den erste Blick k&ouml;nnte man meinen, das Boingpad sei ein
Mauspad wie jedes andere auch. Man legt es auf den Tisch, und rollt dann
mit der Maus darauf herum.<BR>

<BR>Der gro&szlig;e Vorteil dabei ist aber, da&szlig; das Boingpad rund ist
- eben wie ein Boingball. Dem Gelegenheitsanwender mag das wenig
ber&uuml;hren, der Power User ahnt aber schon die M&ouml;glichkeiten, die
in diesem Konzept stecken. Betrachten wir zuerst einen Computertisch von
oben, so wie in sich M&ouml;belverk&auml;ufer normalerweise vorstellen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=303 HEIGHT=96 ALT="[Tisch naiv]" SRC="images_0B/tisch-naiv.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=303>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Auschnitt eines Computertisches von oben in der idealisierten Vorstellung
eines naiven M&ouml;belverk&auml;ufers
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Ganz anders sieht jedoch die Realit&auml;t aus. Denn in Wahrheit sind
Computer nur dann ertr&auml;glich, wenn man die ganze Zeit allerlei
Suchtmittel in sich hineinsch&uuml;ttet. Je nach Person k&ouml;nnen das
Kaffe, Tee, Mineralwasser, Zigaretten, Eukalyptuszuckerl, Heidelbeerjoghurt
und schlimmeres sein. W&auml;hrend das Internet schneckt, der Compiler
ranzt oder der Fortschrittsanzeiger des Bildbearbeitungsfilters einfriert,
will der Anwender etwas zu tun haben.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="images_0B/boingpad.jpeg"><IMG WIDTH=200 HEIGHT=192 ALT="[Boing-Pad]" SRC="images_0B/boingpadtn.jpeg" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=200>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Das Boingpad
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Sinnvollerweise plaziert man Suchtmittel direkt neben dem Rechner,
soda&szlig; sie immer griffbereit sind - also in der N&auml;he der Maus.
Das hat aber den Nachteil, da&szlig; der Tischaufbau unstrukturiert wird.
Wer hat nicht schon einmal beim Griff zur Maus Kaffee oder Tee &uuml;ber
die Tastatur gekippt? Und wieviele Computergeh&auml;use von Rauchern haben
noch keine &quot;Brandwunden&quot;? &Uuml;blicherweise ergibt sich etwa
folgendes Bild:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=304 HEIGHT=96 ALT="[Tisch real]" SRC="images_0B/tisch-real.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=304>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Ein Computertisch, so wie man ihn in zahlreichen real existierenden
Haushalten vorfindet.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Genau dieses Problem hat Amiga Int. erkannt. Der Trick beim Boingpad
ist einfach, aber wirkungsvoll: das Pad wird nicht wie herk&ouml;mmlich
rechteckig angelegt, sondern rund. Der an den Ecken freibleibende Platz
kann nun sinnvoll f&uuml;r das &uuml;bersichtliche Aufbewahren von
Suchtmitteln verwendet werden. Damit ist z.B. folgende Aufteilung
denkbar:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=303 HEIGHT=96 ALT="[Tisch mit Boing-Pad]" SRC="images_0B/tisch-boing.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=303>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Ein Computertisch mit Boingpad und Suchtmitteln
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Das Boingpad kann &uuml;ber den lokalen Amiga H&auml;ndler bezogen
werden. Der Preis<BR>

<BR>sollte um die 100 ATS bzw. DM 15 betragen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Der Amiga Chronograph</B></H3>&nbsp;

<BR>Wozu braucht man schon eine Uhr, wenn man ohnehin das
<TT>timer.device</TT> hat? Grunds&auml;tzlich ist das nat&uuml;rlich
richtig, dennoch hat eine Armbanduhr gewisse Vorteile. Sie ist kleiner, hat
eine schlankere Benutzeroberfl&auml;che, ist einfacher zu programmieren und
bootet schneller. Und seien wir uns ehrlich, abst&uuml;rzen tut sie auch
seltener als der Rechner.<BR>

<BR>Die Installation verl&auml;uft denkbar einfach: mit dem mitgelieferten
Lederarmband wird die Uhr an der Hand befestigt. Dank Autoconfig wird keine
zus&auml;tzliche Software ben&ouml;tigt, und selbstverst&auml;ndlich bleibt
die <TT>startup-sequence</TT> unangetastet.<BR>

<BR>Auch von der Funktion her gibt es kaum etwas zu bem&auml;ngeln. Der
gro&szlig;e Zeiger gibt die Minuten an, der kleine die Stunden. Weiters
wird das Datum mittels PIP (picture in picture) in einem kleinen, den
kreisf&ouml;rmigen Hauptbildschirm &uuml;berlagernden Fenster eingeblendet.
Ein paar zus&auml;tzliche Features wie eine Stoppuhr runden den guten
Gesamteindruck ab.<BR>

<BR>Gut und sch&ouml;n, mag jemand einwenden, aber das kann bald eine Uhr.
Was ist so Amiga-m&auml;&szlig;ig an ihr? Nun ja, zuerst einmal ist an der
Stelle, wo viele andere Uhren eine Mickey Maus oder einen Goofy haben, das
Wort &quot;Amiga&quot; zu sehen. Des weiteren hat sich Amiga-Onkel Petro
Tyschtschenko seinen Namen auf der R&uuml;ckseite eingravieren lassen. Na,
und als ob das nicht schon reichen w&uuml;rde, hei&szlig;t der
Programmierer Edition Langen. Ein Namen, der f&uuml;r Qualit&auml;t
b&uuml;rgen sollte, obwohl wir bei einer schnellen Suche am Aminet keine
Programme von ihm finden konnten. Vermutlich handelt es sich dabei um einen
der neu angeheuerten Programmierer f&uuml;r die Arbeit am AmigaOS jenseits
von 3.1.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="images_0B/amiga-uhr.jpeg"><IMG WIDTH=220 HEIGHT=236 ALT="[Amiga-Uhr]" SRC="images_0B/amiga-uhrtn.jpeg" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=220>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Der Amiga Chronograph, im Volksmund auch Uhr genannt
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Negativ zu bemerken ist, da&szlig; die Uhr einen Kopierschutz hat: sie
ist ihr eigener Hardware-Dongle. Daher ist es nicht m&ouml;glich, die selbe
Uhr an zwei H&auml;nden gleichzeitig zu benutzen. Vor allem im Netzwerk ist
das l&auml;stig, weil der Besitzer der Uhr automatisch zum
&quot;Zeitserver&quot; wird. Denn an wen sonst sollen alle anderen sich
wenden, wenn sie sich nach der Uhrzeit erkundigen?<BR>

<BR>Dies wird noch weiter verschlimmert durch die Tatsache, da&szlig; es
nur eine sehr limitierte Anzahl von Amiga Uhren gibt. Einst waren es 55,
aber zum Zeitpunkt als dieser Artikel geschrieben wurde, waren davon nur
mehr 19 &uuml;brig. Wer also noch eine haben will, mu&szlig; sich schnell
entscheiden.<BR>

<BR>Soviel zu den technischen Daten. Wie verh&auml;lt sich die Uhr in der
Praxis? Wir haben einen kleinen Benchmark-Test durchgef&uuml;hrt, bei dem
wir verschiedene Uhren eine Stunde laufen lie&szlig;en und dann die
vergangene Zeit auf der Anzeige ablasen:<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 BORDERCOLORLIGHT="#DDDDDD" BORDERCOLORDARK="#BBBBBB" ALIGN=CENTER>
<TR>
  <TD>Uhr-Typ</TD>
  <TD>Abgelesene Zeit<BR>(in Minuten)</TD>
</TR>
<TR>
  <TD>timer.device in Amiga 500 mit 68000/7MHz</TD>
  <TD>60:00</TD>
</TR>
<TR>
  <TD>timer.device in Amiga 4000 mit 68060/50Mhz</TD>
  <TD>60:00</TD>
</TR>
<TR>
  <TD>Uhr Accessory unter Windows NT 4.0 auf einem PC mit Pentium II/333MHz</TD>
  <TD>60:00</TD>
</TR>
<TR>
  <TD>Amiga Chronograph</TD>
  <TD>60:00</TD>
</TR>
</TABLE>&nbsp;

<BR>Das Ergebnis mag auf den ersten Blick &uuml;berraschen. Jedoch, die
beiden Amigas sind hier gleich schnell, weil alle relevanten Daten
&uuml;ber die gleiche alten Chips laufen wie auch im ehrw&uuml;rdigen C-64
(die CIA's) und daher durch eine schnellere CPU nicht beschleunigt werden.
Der Pentium verbrennt seine ganze Rechenleistung im Verwalten des
Betriebsystems. Das gute Ergebnis des Chronographen kann man aber ruhigen
Gewissens auf die Genialit&auml;t des Programmierers, Edition Langen,
zur&uuml;ckf&uuml;hren. Obwohl die Hardware eine um ein Vielfaches kleinere
Rechenleistung hat als die anderen drei Teilnehmer, kann die Uhr ohne
Probleme mithalten.<BR>

<BR>Dabei wollten wir es aber nicht belassen. Die halbe Welt
&uuml;bertaktet ihre Rechner. Wir wollten mal sehen, ob das auch mit der
Uhr m&ouml;glich ist. Also nichts wie hin zum n&auml;chsten ehemals
lizensierten Commodore Uhrenh&auml;ndler, und rauf mit der Takfrequenz.
Tats&auml;chlich, bei verdoppelter Taktfrequenz braucht die Uhr nur mehr 30
Minuten, um eine Stunde vergehen zu lassen. Bei dreifacher Frequenz sind es
gar nur mehr 20 Minuten. Wer braucht da noch einen Pentium?<BR>

<BR>Dennoch sind diese Experimente nicht zur Nachahmung zu empfehlen. Ab
etwa zweieinhalbfacher Taktfrequenz beginnt die Uhr am Handgelenk unruhig
zu werden. Und kurz nach der dreifachen flog uns dann der Sekundenzeiger
aus der Kurve. Zum Gl&uuml;ck konnten wir unsere Experimente vertuschen und
haben die 18 Monate geltende Garantie beansprucht.<BR>

<BR>Bestellen kann man die Uhr im Web auf den Seiten von Amiga Int. mittels
Mail an Axel Kraemer. Der Preis betr&auml;gt DM 450, was je nach Tageskurs
etwas &uuml;ber ATS 3000 ausmacht.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die &quot;Theme of Amiga&quot; CD</B></H3>&nbsp;

<BR>Seit einiger Zeit schon haben wir Amiganer unsere eigene Hymne. Die
Gruppe Annex h&uuml;pft diese nicht nur gerne auf diversen Messen vor -
zuletzt auf der C98 -, sondern hat sie auch auf CD aufgenommen. &quot;Back
for the Future - The Theme of Amiga&quot; nennt sich das St&uuml;ck.<BR>

<BR>W&auml;hrend der Titel des Liedls halbwegs nachvollziehbar ist, so
bringt der Name der Band wohl einige ins Gr&uuml;beln. Der allwissende
Langenscheidt meint, da&szlig; &quot;annex&quot; als Verb soviel wie
&quot;sich einverleiben, sich aneignen, sich unter den Nagel
rei&szlig;en&quot; und als Substantiv &quot;Anhang, Nachtrag&quot;
bedeutet. Beides l&auml;&szlig;t in diesem Zusammenhang wenig positive
Assoziationen zu. So kann's also nicht gemeint sein.<BR>

<BR>Ein wenig Nachforschung auf der <A
HREF="http://www.perez.com/annex/">Annex Homepage</A> bringt dann aber ans
Licht, da&szlig; sich die lieben Leute &quot;NX&quot; schreiben. Aha,
hippes Wortspiel: Wenn man N und X englisch ausspricht, dann klingt es wie
&quot;En Ex&quot;, was sich ungef&auml;hr gleich anh&ouml;rt wie
&quot;annex&quot;. Nun sind die Damen und der Herr aber deutsch. N und X
auf Deutsch ist &quot;En Ix&quot;, und das klingt wie &quot;eh nix&quot;.
Da haben wir's ja! Sowas nennt man guten Enth&uuml;llungsjournalismus.<BR>

<BR>Weil die Frage &quot;eh nix von was?&quot; unbeantwortet bleibt, nehmen
wir einmal an &quot;eh nix von allem&quot;. Das l&auml;&szlig;t jetzt
endlich eine positive Assoziation zu, n&auml;mlich die der Ehrlichkeit. Eh
nix originell, eh nix groovy, eh nix fetzig, eh nix subtiler Text. So,
jetzt kann mir wirklich keiner vorwerfen, ich h&auml;tte nicht versucht,
was Nettes zu schreiben.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="images_0B/annex-cd.jpeg"><IMG WIDTH=200 HEIGHT=176 ALT="[Annex-CD]" SRC="images_0B/annex-cdtn.jpeg" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=200>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Die H&uuml;lle der &quot;Theme of Amiga&quot; CD
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Wie dem auch sei, Amiga Int. hat das Ding per Definition zur Amiga
Hymne gemacht. &Uuml;ber Musikgeschmack l&auml;&szlig;t sich bekanntlich
lange streiten, ohne das was dabei rauskommt. Objektiv k&ouml;nnte man von
&quot;Easy Blubbering&quot; sprechen.<BR>

<BR>Trotzdem wollte man meinen, eine Hymne sollte &uuml;ber eine
eing&auml;ngige Melodie verf&uuml;gen, die man auch im schlimmsten
Vollrausch noch mitgr&ouml;len kann. Man betrachte Beispiele wie &quot;We
are the Champions&quot; von Queen, Stammgast auf jedem Fu&szlig;ballplatz.
(Au&szlig;er bei Sturm Graz, weil die zur Zeit elendig schlecht spielen.)
Oder &quot;Tagwache&quot; von Wolgang Ambros. Obwohl ihn das Liedchen
seinerzeit fast die Karriere gekostet h&auml;tte, geh&ouml;rt es nach wie
vor zum Standardrepertoire f&uuml;r jeden &quot;v&ouml;llig fetten
Obr&uuml;sta&quot;. Heute noch jagen sich Drogens&uuml;chtige zu David
Bowie's &quot;Heroes&quot; die Nadel ins unterern&auml;hrte Gebein. Und
wenn sich in zwanzig Jahren noch irgendwer an Falco erinnert, dann sind es
pubertierende Gymnasiasten, die &quot;Nie mehr Schule&quot;
tr&auml;llern.<BR>

<BR>Mit &quot;definierten&quot; Hymnen a'la Nationalhymnen assoziiert man
gemeinhin eher nur schlafende Politiker, kaugummikauende
Fu&szlig;ballspieler, krampfhaft ihre Freude verbergende Olympiasieger oder
peinliche zuvor zu Hause vor dem Spiegel das Weinen ge&uuml;bte
Amerikaner.<BR>

<BR>Irgendwie wird man das Gef&uuml;hl nicht los, da&szlig; bei der ganzen
Sache blo&szlig; jemand schnell ein bi&szlig;chen Kohle machen will, und
zwar auf Kosten der f&uuml;r ihre Tendenz zum leicht d&uuml;mmlichen
Fanatismus bekannten Amiga-Gemeinde. Wobei dieser jemand nicht unbedingt
der Komponist und die T&auml;nzer sein m&uuml;ssen.<BR>

<BR>Der Hauptzweck der CD soll nach eigene Angaben &quot;Werbung f&uuml;r
den Amiga&quot; sein. Das wirft die Frage auf, wof&uuml;r man zur Zeit
gro&szlig; werben will. Zuerst geh&ouml;rt wieder ein Produkt her,
ansonsten wirkt es wie &quot;habt Mitleid mit dem Amiga, auch wenn mit der
Entwicklung nichts weitergeht&quot;.<BR>

<BR>Trotzdem wird Annex in diversen Messeberichten der letzten Zeit
halbwegs positiv erw&auml;hnt. Beim genaueren Lesen derselben f&auml;llt
dann aber rasch auf, da&szlig; eigentlich niemand die Musik guthei&szlig;t.
Alle freuen sich, da&szlig; die &quot;G&ouml;als&quot; so k&ouml;rperbetont
herumh&uuml;pfen. Hui, die eine sogar nabelfrei! Sollte man hier das
Klischee vom seelisch verkr&uuml;ppelten Computerdeppen zu Rate ziehen?
Demnach w&auml;re alles klar, weil mit Annex sehen sie dann wenigstens
einmal &quot;echte&quot; Frauen, und nicht nur irgendwelche weiblich
wirkende Pixelkurven.<BR>

<BR>Wie aber bemerkte die &ouml;sterreichische Schauspielerin Birgit
Stauber einmal so treffend: &quot;Titten und Arsch sind nicht genug. Du
brauchst Titten und Arsch und Grips&quot;. Letzterer scheint bei der ganzen
Aktion irgendwo verloren gegangen zu sein.<BR>

<BR>Die CD ist nicht im normalen Handel erh&auml;ltlich, sondern kann nur
beim lokalen Amiga H&auml;ndler bestellt werden. Der Preis sollte um die
100 ATS bzw. DM 15 betragen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>Das Boingpad ist eine Meisterleistung in Sachen Usability. Die
F&auml;higkeit, gemeinsam mit Aschenbecher und Kaffeeheferl quasi am selben
Platz koexistieren zu k&ouml;nnen ist sicherlich die herausragendste
Eigenschaft, die man schon nach kurzer Zeit nicht mehr missen m&ouml;chte;
geh&ouml;rt unter dem Weihnachtsbaum eines jeden aufrechten Amiganers.<BR>

<BR>Die Amiga-Uhr beeindruckt durch ihren geringen Bedarf an Ressourcen, wo
mit weit weniger Hardware die selbe Geschwindigkeit erzielt wird wie mit
einem High-End PC. Erfreulich auch, da&szlig; mit Edition Langen endlich
wieder ein Entwickler gefunden wurde, der das Zeug zu haben scheint, in die
Fu&szlig;stapfen von Dave Haynie treten zu k&ouml;nnen Leicht st&ouml;rend
auf den Verkauf auswirken d&uuml;rfte sich jedoch die Tatsache, da&szlig;
es nur 55 St&uuml;ck des Chronographen gibt. Schon alleine deshalb wird er
sich eher nicht unter jedem Weihnachtsbaum finden. Dennoch empfehlenswert
f&uuml;r die, die sonst schon alles haben.<BR>

<BR>Vom Kauf der Annex-CD kann man leider nur abraten. Zu durchsichtig ist
das Ganze. Wer dennoch eine &quot;Amiga-CD&quot; haben will, der wende sich
vertrauensvoll an alte Hasen wie TRSi und Acid Kitchen. Die haben das
n&auml;mlich schon lange vor Annex gemacht. Und echte
&quot;unabh&auml;ngige Musik&quot; braucht keine h&uuml;pfenden G&ouml;als
und Mail-Bombings unschuldiger Radiosender.<BR>

<BR>Zusammenfassend kann man sagen, was Hardware angeht ist der Amiga alles
andere als tot. Und wir warten schon gespannt, was als n&auml;chstes kommt.
Vielleicht das Amiga-Haarshampoo, damit wir uns einen neuen Amiga endlich
in die Haare schmieren k&ouml;nnen? Oder das Amiga-Klopapier, damit jeder
wei&szlig;, wo man sich den neuen Amiga hinstecken kann? Die Zukunft wird
es zeigen. F&uuml;r dieses Jahr ist Weihnachten jedenfalls gerettet.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.amiga.de/de/Produkte/BoingPad.html">Boing Pad</A> - So schaut's aus<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.amiga.de/de/Produkte/Uhr.html">Amiga Uhr</A> - So schaut's aus, und hier kann man sie bestellen<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.amiga.de/de/Produkte/ThemeCD.html.html">&quot;Theme of Amiga&quot; CD</A> - So schaut's aus<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.perez.com/annex/">Eh Nix Homepage</A> - Die, die das &quot;Theme of Amiga&quot; h&uuml;pfen<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http:///www.perez.de/annex/playbm4.jpg">Species 3</A> - Eh Nix bei der deutschen Playback-Meisterschaft<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.perez.com/annex/nxfd-1.htm">Eh Nix Interview</A> - F&uuml;r die, die sich fragen &quot;Warum nur?&quot;<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.trsi.de/">TRSi</A> - Unabh&auml;ngige Amiga-Musiker ohne h&uuml;pfende G&ouml;als, die erste<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x0039.html">Acid Kitchen</A> - Unabh&auml;ngige Amiga-Musiker ohne h&uuml;pfende G&ouml;als, die zweite<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D9.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00DB.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
