<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - AmiWin</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D2.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D4.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00D1.html">Wildfire\7 PPC</A> | <A HREF="0x00D2.html">Amiga Writer</A> | <A HREF="0x00D3.html">AmiWin</A> | <A HREF="0x00D4.html">Amiga Classix</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>AmiWin - Das gro&szlig;e X</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">QNX in allen Ehren, aber Fenster umh&auml;ngen
k&ouml;nnen wir jetzt auch schon. Und tut es nicht im Innersten gut, einem
Rechner die B&uuml;rde der leidigen Ausgabe abnehmen zu
k&ouml;nnen?</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Genau dieses machten wir diesmal mit einer braven NeXTstation, deren
X-Server ja nun wirklich nicht der schnellsten Einer ist. Damit w&auml;ren
wir auch schon mitten im Thema, denn was ist nun ein X-Server und
wof&uuml;r brauchen wir das?<BR>

<BR>Die Tische, die zwar noch immer Schreibtische genannt werden, aber
zunehmend Tipptische hei&szlig;en m&uuml;&szlig;ten, ob der
inflation&auml;ren Anzahl an Computern, werden wohl haupts&auml;chlich von
Monitoren verstellt. Bei mehreren Computern und demzufolge dann mehreren
Monitoren ist das sichtlich ein mitunter gr&ouml;&szlig;eres
Platzproblem.<BR>

<BR>Um genau dieses haben sich schon vor Jahren die ber&uuml;chtigten
Unix-M&auml;nner Gedanken gemacht, wohl aber, um auch auf entfernteren
Rechnern nicht nur mittels <TT>telnet</TT> arbeiten zu k&ouml;nnen, und
nicht, um moderne &quot;Arbeitsplatzprobleme&quot; vorzeitig l&ouml;sen zu
wollen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Es unixelt...</B></H3>&nbsp;

<BR>Ein X-Server ist die Grundlage, um auf Unix-Rechnern &uuml;berhaupt zu
graphischen Benutzeroberfl&auml;chen wie eben X-Window (bitte ohne s am
Schlu&szlig;!) gelangen zu k&ouml;nnen. Diese Server k&ouml;nnen aber eben
mehr, als nur einfach lokal am Rechner irgendwelche Sachen irgendwohin zu
malen.<BR>

<BR>Fenster mitsamt Inhalt k&ouml;nnen dadurch auf einen anderen Rechner
umgelenkt werden, und das Programm, da&szlig; trotzdem auf dem ersten
Rechner l&auml;uft, wird dadurch vom anderen Rechner ferngesteuert. Da wir
ja nicht vor einem QNX sitzen, geht das nicht bei laufenden Programmen.
Somit wird zur Startzeit eines Programmes festgelegt, auf welchem Display
es sein Fenster aufmachen soll, und von wo es somit die Eingaben
empf&auml;ngt.<BR>

<BR>So ein Aufruf kann nun wie folgt aussehen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>/usr/X11/bin/xclock -display local:0
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;


<BR>Wir sehen schon, hier befinden wir uns in der UNIX-Welt auf einem
UNIX-Rechner. Obiges &ouml;ffnet einfach eine Uhr, &auml;hnlich der
Workbench-Uhr vom Amiga, auf dem X-Screen. In diesem Falle ist auch die
Angabe des Display-Parameters nicht wirkich n&ouml;tig, da die Ausgabe
lokal erfolgen soll, und das die Voreinstellung ist.<BR>

<BR>L&auml;uft aber zum Beispiel auch auf dem Rechner mit der IP-Adresse
<TT>192.168.1.1</TT> ein solcher X-Server, so wird sich die Zeile
entsprechend &auml;ndern:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>/usr/X11/bin/xclock -display 192.168.1.1:0
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Das <TT>:0</TT> nach der IP-Adresse gibt an, da&szlig; der erste
X-Screen auf diesem Rechner benutzt werden soll. &Auml;hnlich wie es ja vom
Amiga her bekannt ist, kann auch ein X-Server mehrere Screens verwalten.
Diese werden allerdings nicht mit Namen versehen, sondern einfach
durchnumeriert. Namen kann man dagegen nat&uuml;rlich statt der IP-Adresse
verwenden, sofern das Netz ordentlich konfiguriert ist und ein
<TT>ping</TT> mit dem Namen funktioniert.<BR>

<BR>So kann hin und her und kreuz und quer mit den Fenstern geworfen werden
und man sich mit allen m&ouml;glichen Ausgaben den Monitor zum&uuml;llen
lassen, wie auch die ganzen Sachen einfach zu delegieren und vor einem
leeren Bildschirm sitzen. Beides wird wohl nicht viel Spa&szlig;
machen.<BR>

<BR>Um nun die Nerven aufgebrachter NetzAdmins ein wenig wieder beruhigen
zu k&ouml;nnen, ist anzumerken, da&szlig; nat&uuml;rlich keine ganzen
Bitmaps oder auch nur Teile davon verschoben werden. Das Konzept dahinter
ist ein v&ouml;llig anderes: es werden &uuml;ber das Netz nur
Steuermeldungen und Kontrollzeichen verschickt, den Aufbau des
Fensterinhalts &uuml;bernimmt der darstellende Rechner. Drum wird ein NeXT,
den man mit einem X-Server sowieso nur knebelt und geisselt, pl&ouml;tzlich
wieder zur gewohnten Geschwindigkeit zur&uuml;ckkehren, wenn man die
Ausgabe umlenkt. Die Voraussetzung dabei ist nat&uuml;rlich ein
entsprechend schneller X-Server am Ausgabeger&auml;t, und hier kommt unser
lieber Amiga ins Spiel.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ein Amiga gibt Gas</B></H3>&nbsp;

<BR>Mit <TT>AmiWin</TT> gibt es nun am Aminet einen freien X-Server
f&uuml;r den Amiga, der genau die oben beschriebenen F&auml;higkeiten
f&uuml;r unseren Lieblingsrechner umsetzt. Fr&uuml;her gab es auch einmal
<TT>DaggeX</TT>, ein zweites X-Window-Paket f&uuml;r den Amiga, aber von
dem ist schon l&auml;nger nichts mehr zu h&ouml;ren gewesen. Genausowenig,
wie von <TT>GfxBase</TT>, einem kommerziellen X-Server, dessen Demoversion
ebenfalls am Aminet zu finde ist.<BR>

<BR>Zur Installation kann man nur wenig sagen, da das Installer-Skript
funktioniert und einen einfach startbaren X-Server im System
hinterl&auml;&szlig;t.<BR>

<BR>Die Demoversion von AmiWin vom Aminet nun erlaubt maximal drei
ge&ouml;ffnete Fenster, gegen einen Sharewarebeitrag von 50 US$ bekommt man
aber die vollst&auml;ndige Version des Servers und noch einige mehr Clients
dazu.<BR>

<BR>Es ist ja eine prinzipielle Einschr&auml;nkung des ganzen Systems,
da&szlig; nicht auf einmal jedes Programm einfach seine Fenster irgendwohin
umlenken kann, sondern nur solche, die f&uuml;r X geschrieben sind, und
derer sind f&uuml;r den Amiga nicht so viele, aber wir wollen ja auch von
Unix-Maschinen die Ausgaben umlenekn, und dort sind solche Programme weiter
verbreitet.<BR>

<BR>Nach dem Entpacken des Archivs und Doppelklick zum Starten des Servers
wird man von einem MUI-haltigen Konfigurationsfenster begr&uuml;&szlig;t,
das aber sogleich durch einen Screen-Requester &uuml;berlagert wird. Auf
dem ist ersichtlich, da&szlig; AmiWin nicht nur nur mit Grafikkarten
zusammenarbeitet, sondern eine solche auch tunlichst empfehlenswert wird,
wenn man auf brauchbare Arbeitsgeschwindigkeiten kommen will. Meine gute
alte PicassoII im 2000er tut daf&uuml;r sehr wohl ihre Dienste.<BR>

<BR>Vorgesehen ist nur CyberGraphX als (PreRTG-) System, doch die Emulation
von Picasso96 ist davon nicht zu unterscheiden, und deshalb scheinen auch
brav alle Modi in diesem Requester auf. W&auml;hlt man einen aus, so
&ouml;ffnet sich ein Screen, der mit dem bekannten grau-karierten
X-Hintergrund gef&uuml;llt wird und der Mauszeiger wird zum dicken
Kreuz.<BR>

<BR>Auf der Workbench ikonifiziert sich das Konfigurationsfenster und die
Clients warten darauf, gestartet zu werden. Zur DemoVersion werden einige
mitgeliefert, wie zum Beispiel schon oben erw&auml;hntes <TT>xclock</TT>,
oder ein <TT>xeyes</TT> f&uuml;r die, die sonst nicht genug Paranoia
bekommen und auch noch von Augen verfolgt werden wollen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Sicherheit &uuml;ber alles!</B></H3>&nbsp;

<BR>Nun, gleich von einem anderen Rechner aus einen Client gestartet und
das entsprechende Display angegeben, aber so einfach geht das nun auch
wieder nicht:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>% xclock -display 192.168.1.1:0
<BR>xlib:&nbsp;&nbsp;connection to &quot;192.168.1.1:0.0&quot; refused by server
<BR>xlib:&nbsp;&nbsp;Client is not authorized to connect to server
<BR>Error: Can't open display: 192.168.1.1:0
<BR>%
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Die Meldung ist sogar einigermassen aussagekr&auml;ftig. Daf&uuml;r
gibt es dann eine eigene Konfigurationsseite, in der man angeben kann,
welche IP-Adressen ein Fenster bei diesem Server aufmachen d&uuml;rfen.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=427 HEIGHT=264 SRC="images_0B/security.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=427>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Die Sicherheits-Abfrage kann man auch abschalten
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Gibt man diese Adressen dann an und wechselt voller Erwartungen auf den
X-Screen, kann man dort am Mauszeiger ein sch&ouml;nes Rechteck h&auml;ngen
sehen, das frei am Screen plazieren werden kann. Bei entsprechender Angabe
von Optionen beim Aufruf des Programmes wird das Fenster aber
nat&uuml;rlich auch gleich plaziert.<BR>

<BR>In der Dokumentation zu AmiWin steht unter den vielen Optionen auch
eine, mit der der Screenmode voreingestellt werden k&ouml;nnen soll. Dieses
ist aber in der Demoversion nicht m&ouml;glich, es wird immer der nervige
Screen-Requester ge&ouml;ffnet.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Eine gute Unterlage ist viel wert</B></H3>&nbsp;

<BR>Da das Ganze sehr netzwerkabh&auml;ngig ist, steht nat&uuml;rlich die
Frage nach dem passenden TCP-Stack im Raum: Dazu ist in der
<TT>.guide</TT>-f&ouml;rmigen Dokumentation ein eigenes Kapitel
einger&auml;umt. Die M&ouml;glichkeiten, Nachrichten auszutauschen, basiert
hier auf einem <I>Transports</I> genannten System. Eines davon, der
<TT>ppipc.xtp</TT> ist f&uuml;r die lokalen Clients zust&auml;ndig und
immer verf&uuml;gbar, auch wenn kein TCP-Stack l&auml;uft. Ist beim Start
von <TT>AmiWin</TT> entweder AmiTCP oder AS-225 am Laufen, wird
entsprechend der <TT>amitcp.xtp</TT> oder der <TT>as225.xtp</TT>
konfiguriert. Ob das richtig funktioniert hat, ist auch in diesem
Konfigurationsfenster ersichtlich:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=427 HEIGHT=265 SRC="images_0B/transports.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=427>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Auf welchen Wegen wandeln wir heute ?
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zu einem funktionierendem X-System geh&ouml;rt aber auch ein passender
Window-Manager, der das grundlegende Aussehen und Funktionalit&auml;t
extrem beeinflu&szlig;t. Das ist &auml;hnlich einem Workbench-Replacement:
die anderen k&ouml;nnen immer mehr, aber keiner kann alles, was man
braucht.<BR>

<BR>Bei AmiWin dabei ist der <TT>twm</TT>, der nicht gerade viel kann,
f&uuml;r erste Versuche aber durachause geeignet ist. In der Unix-Welt
dorgt da gerade der <TT>kde</TT> f&uuml;r Aufsehen, da er die armen Rechner
wie ein Windows 95 aussehen l&auml;&szlig;t. In <A
HREF="http://it.aminet.net/oub/aminet/gfx/x11/">aminet:gfx/x11/</A> findet
sich dazu so einiges, und in den <TT>GeekGadgets</TT> gibt es zum Beispiel
den <TT>AfterStep</TT>, der die NeXTStep-Oberfl&auml;che nachbildet.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Unixoid</B></H3>&nbsp;

<BR>Das hat jetzt nichts mit Suizid zu tun, auch wenn's einem manchmal so
vorkommen mag; und man kann auch keinen begehen, wenn man sieht, mit was
AmiWin sich zufrieden gibt:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Kick 2.04, WB 2.1<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 4 MB RAM<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 2 MB Plattenplatz<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> OCS<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 68020<BR>
</TD></TR></TABLE>&nbsp;

<BR>Um aber wirklich damit auch arbeiten zu k&ouml;nnen, sind schon die
Empfehlungen angeraten:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Kick, WB 3.1<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 8 MB RAM<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 20 MB auf der Platte (f&uuml;r die Zeichens&auml;tze der registrierten Version)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Grafikkarte<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 68030<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> 3-Tasten Maus<BR>
</TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Darstellung am Screen erfolgt &uuml;ber eigene Display Driver; mit
dem rudiment&auml;rsten davon kann jedes Grafiksystem in zumindest
monochromer Ausf&uuml;hrung verwendet werden, das zumindest die
<TT>graphics.library</TT> emuliert. Zu angemessener Darstellung gibt es
aber auch eine ganze Reihe anderer Treiber:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> rtg-1		  monochrom f&uuml;r RTG (auf graphics.library aufsetzend)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> aga-1		  monochrom f&uuml;r OCS/ECS/AGA<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> aga-8		  256 Farben f&uuml;r OCS/ECS/AGA/A2024<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> picasso-l-8	  256 Farben f&uuml;r Picasso (nicht Picasso96)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> hrg-8		  256 Farben f&uuml;r Merlin, Domino, VisionA<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> cybergraphx-8	  256 Farben f&uuml;r CyberGraphX (somit auch Picasso96)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> retina-8	  256 Farben f&uuml;r Retina<BR>
</TD><TD WIDTH="50%">
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> graffity-8	  256 Farben f&uuml;r Graffity<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> picasso-l-15	  32768/65536 Farben f&uuml;r Picasso (nicht Picasso96)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> hrg-15		  32768/65536 Farben f&uuml;r Merlin, Domino, VisionA<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> cybergraphx-15	  32768/65536 Farben f&uuml;r CyberGraphX (somit auch f&uuml;r Picasso96)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> retina-15	  32768/65536 Farben f&uuml;r Retina<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> graffity-15	  32768/65536 Farben f&uuml;r Graffity<BR>
</TD></TR></TABLE>&nbsp;

<BR>In der Demoversion sind die 15-Bit Treiber nicht enthalten und die
8-Bit Treiber unterst&uuml;tzen nur eine Aufl&ouml;sung von maximal
800x600, nur der <TT>aga-8</TT> unterst&uuml;tzt auch die A2024-Modi von
1024x1024 und 1024x800.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Am 30.Novemebr ist das letzte Update von <TT>AmiWin</TT> 3 Jahre alt
geworden (feiern wir jetzt jedes Monat solche Geburtstage?), von der
Verwendbarkeit hat dieses Paket aber in nichts in der Zeit gelitten.<BR>

<BR>Im Aminet im Verzeichnis <TT>gfx/x11</TT> gibt es eine ganze Menge an
portierten Clients f&uuml;r AmiWin, angefangen von den essentiellen Sachen
wie <TT>xv</TT>, <TT>xfig</TT>, <TT>Mesa Open GL Emulation</TT>,
<TT>xmorph</TT>, <TT>Motif1.2</TT> bis hin zu vollst&auml;ndigen
Webbrowsern (<TT>Chimera</TT>) und Spielen (<TT>Flug-Simulator</TT>) findet
sich so Einiges. Das Meiste davon ist von <A
HREF="mailto:kruse@cs.ucf.edu">Holger Kruse</A> portiert, der auch f&uuml;r
<TT>AmiWin</TT> selber verantwortlich ist.<BR>

<BR>Wie bei Unix-Software so &uuml;blich, beinhalten die entsprechenden
Archive auch oft etliche an MBytes.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://it.aminet.net/pub/aminet/gfx/x11/AmiWin222d.lha">AmiWin</A> v2.22d am Aminet<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://it.aminet.net/pub/aminet/gfx/x11/DaggeX-0.91.lha">DaggeX</A> v0.91 am Aminet<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://it.aminet.net/pub/aminet/gfx/x11/GfxBaseX11Demo.lha">GfxBase</A> am Aminet<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D2.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D4.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
