<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - Diskarchive</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D4.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D6.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00D5.html">Diskarchive</A> | <A HREF="0x00D6.html">REXX</A> | <A HREF="0x00D7.html">TCP/IP: Die Exoten</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Diskarchive - DMS, FMS</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">In diesem Teil des Workshops lernen wir DMS kennen,
einen der ber&uuml;chtigten Amiga-Cracker-Kultur entstammenden
Diskarchiver. Weiters befassen wir uns mit FMS, das es erlaubt, die Floppy
auf die Festplatte &quot;auszulagern&quot;.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ein bisserl Geschichte</B></H3>&nbsp;

<BR>In der grauen Anfangszeit des Amigas war von Festplatte noch keine
Rede. Alles wurde auf Disketten gespeichert. Internet blieb uns damals noch
erspart, weil dank seiner damals noch ehrlichen Unbrauchbarkeit kaum
verwendet. Unglaublich aber wahr, Gopher und WAIS wurden zu der Zeit als
Innovation gefeiert.<BR>

<BR>Eine Art Netzkultur gab es dennoch schon in den Bulletinboard Systems,
kurz BBS Im Gegensatz zum krankhaft liberalen Upperclass-Ges&auml;usel der
amerikanischen Bildungselite im Internet war dort aber erdiger
Westentaschenanarchismus pubertierender Schulkinder angesagt, der sich
unter anderem darin &auml;u&szlig;erte, m&ouml;glichst viele Raubkopien
unter die Leute zu bringen.<BR>

<BR>(Um nicht der unzul&auml;ssigen Verallgemeinerung bezichtigt zu werden:
es gibt auch krankhaft liberale BBS's - auch Intellektuelle k&ouml;nnen in
ein Bierzelt gehen. Und das Internet hat seine &quot;binary
newsgroups&quot; und &quot;warez sites&quot;. Diese stellen aber keinen
aktiven Kulturbeitrag dar, sondern nur eine billige
Download-M&ouml;glichkeit.)<BR>

<BR>Beim Verteilen von Raubkopien ist nat&uuml;rlich der besser, der
schneller ist. Weil die Post bekanntlich nicht besonders schnell ist - vor
allem ins Ausland - war es nat&uuml;rlich indiskutabel, die aktuellen
Raubkopien in einen Brief zu stecken. Mal davon abgesehen, da&szlig;
Disketten mit Raubkopien leicht zu physikalischen Beweisst&uuml;cken werden
k&ouml;nnen. Ein einfacherer Weg mu&szlig;te her, um solche Daten in die
BBS zu kriegen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>DMS - Der Maischapparat</B></H3>&nbsp;

<BR>Und genau diese L&ouml;sung war DMS, der &quot;Disk Masher&quot; bzw.
sp&auml;ter auch &quot;Device Masher&quot;. Wie es dazu wirklich kam, ist
f&uuml;r einen Lamer wie mich nicht mehr rekonstruierbar. Als gesichert
gilt, da&szlig; es keinen krankhaft pseudo-demokratischen &quot;request for
comments&quot; gab, wo nach einiger Zeit der unfruchtbaren Diskussion sich
einer hinsetzt und das implementiert, was er f&uuml;r richtig h&auml;lt.
Stattdessen hat sich eher sofort einer hingesetzt und das implementiert,
was er f&uuml;r richtig hielt.<BR>

<BR>Der Bedarf f&uuml;r DMS war da, und somit war es schnell akzeptiert.
Weil aber nicht alles richtig war, was der Ur-DMS-Autor f&uuml;r richtig
hielt und etliche Features fehlten, wurde DMS nach und nach erweitert. So
kamen diverse Kompressionsschemata (vgl. ADZ), eine (aus heutiger Sicht
primitive) M&ouml;glichkeit f&uuml;r Passw&ouml;rter und etliche
Kleinigkeiten dazu. Das geschah nat&uuml;rliche wieder nicht in einer
krankhaft pseudo-demokratischen Diskussion, sondern jeder verbesserte DMS
auf seine Weise, je nach dem was er brauchte. Der Effekt ist vergleichbar
mit dem TAR der Unix-M&auml;nner: es gibt etliche Programme mit dem selben
Namen, die unterschiedliche Dinge machen, teilweise abh&auml;ngig von der
Mondphase.<BR>

<BR>Nach kurzer Zeit trieben sich etliche zueinander kreuzweise
inkompatible DMS-Tools in den BBS's herum. Dazu kam dann noch, da&szlig;
Virenprogrammieren damals recht popul&auml;r war. Zwar war es ein leichtes,
seinen eigenen Virus in die gerade aktuelle Raubkopie zu packen, nur war es
nicht garantiert, da&szlig; jeder diese wirklich herunterladet. Viel
effektiver hingegen war das Plazieren von Viren in DMS, weil man es ja
andauernd aktualisieren mu&szlig;te, um an die Raubkopien zu kommen.<BR>

<BR>Viele der herumgeisternden DMS-Programme sind wahrscheinlich nach wie
vor verseucht. Eines kann man aber dennoch mit halbwegs guten Gewissen
empfehlen:<BR>

<BR><TABLE BORDER=0 BGCOLOR="#EEEEEE" CELLPADDING=4 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>T&auml;ter :</TD>   <TD> SDS Software</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Aktennummer :</TD>  <TD> 1.11</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Quellen :</TD>      <TD> aminet:util/arc/dms111.run</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Pr&auml;mie :</TD>  <TD> Freeware</TD></TR>
</TABLE>&nbsp;

<BR>Denn wie wir wissen, wird alles, was am Aminet landet, auf Viren
gepr&uuml;ft. Es passiert zwar hin und wieder, da&szlig; ein ganz neuer
Virus durchschl&uuml;pft, die Anzahl der &quot;Aminet Virus Warnings&quot;
der letzten Jahre kann man auf einer Hand abz&auml;hlen. Nicht zuletzt
deshalb, weil inzwischen alle Virenprogrammierer auf PCs arbeiten. Schon
mehr ein Problem kann darstellen, da&szlig; dieses DMS nicht alles
extrahieren kann, was man findet. F&uuml;r den Hausgebrauch und Demo-Gucken
sollte es aber reichen, und die anderen Aktivit&auml;ten wollen wir eh
nicht f&ouml;rdern.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>DMS Extrahieren</B></H3>&nbsp;

<BR>Wie bereits im letzten Teil ist auch diesmal ein Test-Archive enthalten
(siehe am Ende des Artikels). Der Konsistenz halber hei&szlig;t es
<TT>sepp.dms</TT>. Nach <TT>DF0:</TT> extrahieren kann man es mit mit
folgendem Aufruf:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>dms Write sepp.dms TO df0:
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Daraufhin zeigt DMS einen unten genauer erk&auml;rten Text an, bittet
DMS, eine Disk in DF0: einzulegen, <TT>RETURN</TT> zu dr&uuml;cken, und ab
geht die Post. Gepackte Archive erkennt DMS von selbst und werden f&uuml;r
den Anwender vollkommen transparent behandelt.<BR>

<BR>Das funktioniert ansich, leider zeigt sich bei etlichen DMS-Archiven
der Selbstbeweihr&auml;ucherungstrieb des jeweiligen pubertierenden
Schulkinds, das das Archive zusammengestellt hat. Vor dem eigentlichen
Extrahieren zeigt DMS einen sogenannten &quot;banner text&quot;, indem der
Archiveur dann in der Tradition von Musikentenstadls und Wurlitzer Leute
gr&uuml;&szlig;en kann. Dabei bedient man sich gerne einf&auml;ltiger
ASCII-Grafiken (vgl. die ebenso sinnlosen EMail-Signatures im
Internet).<BR>

<BR>Aus Gr&uuml;nden der Veranschaulichung hat auch der kleine
<TT>sepp.dms</TT> ein solchen Text verpa&szlig;t bekommen, wenn auch einen
kulturell wesentlich wertvolleren. (Der Vers wurde dem Lied
&quot;Goa&szlig;&quot; vom ersten Attwenger Album &quot;Most&quot;
entnommen.)<BR>

<BR>Solchem Unfug entgegen wirken kann man mit der CLI-Option
<TT>NoText</TT>:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>dms Write sepp.dms TO df0: NoText
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Und a Rua is in da Hittn.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>DMS Erzeugen</B></H3>&nbsp;

<BR>Wer die Einleitung gelesen hat, der wird verstehen, warum es
unverantwortlich w&auml;re, zu erkl&auml;ren, wie man DMS-Archive erzeugt.
Wer Disketten archivieren will, der lese im <A HREF="0x00C7.html">ersten
Teil des Workshops</A> nach, wie man ein ADZ-Archiv erzeugt.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>DMS f&uuml;r den Rest der Welt</B></H3>&nbsp;

<BR>Ein gro&szlig;er Nachteil von DMS ist, da&szlig; es nur f&uuml;r Amiga
existiert. Hat man ein DMS-Archiv und befindet sich auf einem anderen
Rechner, so kommt man schwer an die enthaltene Daten heran. Selbst wenn es
den originalen Quellcode g&auml;be, er w&uuml;rde wohl im wenig
portierbaren 68k-Assembler vorliegen.<BR>

<BR>Anfangs war das ein gro&szlig;es Problem f&uuml;r die armen Menschen,
die nur &uuml;ber emulierte Amigas verf&uuml;gen. Letztendlich hat sich
aber doch ein aufrechter Masochist hingesetzt, ein bisserl &quot;reverse
engineering&quot; betrieben und ein portables C-Programm geschrieben:<BR>

<BR><TABLE BORDER=0 BGCOLOR="#EEEEEE" CELLPADDING=4 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>T&auml;ter :</TD>   <TD> Andre' R. de la Rocha</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Aktennummer :</TD>  <TD> 1.2</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Quellen :</TD>      <TD> aminet:util/arc/xDMS.lha</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Pr&auml;mie :</TD>  <TD> Freeware</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Anforderungen :</TD><TD> Quellcode enthalten</TD></TR>
</TABLE>&nbsp;

<BR>Dieses gute St&uuml;ck wandelt ein DMS-Archiv in eine ADF-kompatible
880K-Wurscht um. Details entnehme man der Dokumentation. Inzwischen sind
die Emulatoren so schlau, da&szlig; sie <TT>xdms</TT> automatisch aufrufen,
wenn sie ein DMS-Archiv laden sollen.<BR>

<BR>Viel inkompatibler zu DMS als DMS selbst kann es wohl kaum sein.
Weiters ist erw&auml;hnenswert, da&szlig; es PPC-Versionen von
<TT>xdms</TT> gibt. Siehe Aminet, im selben Verzeichnis.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>FMS</B></H3>&nbsp;

<BR>FMS geht einen etwas anderen Weg als TransADF und DMS. Zwar wird auch
hier eine Disk als Datei dargestellt. Im Unterschied zu den anderen beiden
ist FMS aber kein Programm, das diese Datei wieder auf eine Disk schreibt,
sondern ein Ger&auml;tetreiber, der selbige als Laufwerk anmeldet. Damit
ist das Archiv direkt von Workbench und CLI aus zug&auml;nglich, was
nat&uuml;rlich &auml;u&szlig;erst praktisch ist. Wof&uuml;r die
Abk&uuml;rzung FMS eigentlich steht, verschweigt die Dokumentation aber
beharrlich.<BR>

<BR><TABLE BORDER=0 BGCOLOR="#EEEEEE" CELLPADDING=4 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>T&auml;ter :</TD>   <TD> Dave Jones, Thomas Omilian</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Aktennummer :</TD>  <TD> 5.01</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Quellen :</TD>      <TD> aminet:disk/misc/fmsdisk.lha</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Pr&auml;mie :</TD>  <TD> Giftware</TD></TR>
</TABLE>&nbsp;

<BR>Ein Installerscript ist leider nicht enthalten, darum beschreiben wir
die Installation aus der CLI-Perspektive. Man begebe sich in das
Verzeichnis, in das man das Archive extrahiert hat, und gebe unten stehende
Befehle ein.<BR>

<BR>(Achtung beim <TT>type</TT> Befehl, da&szlig; man wirklich zwei
<TT>&gt;</TT> eingibt. Dies bewirkt, da&szlig; die neue Mountlist an die
alte drangeh&auml;ngt wird. W&uuml;rde man nur ein <TT>&gt;</TT>, so
w&uuml;rde die alte Mountlist &uuml;berschrieben werden.)<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>cd FmsDisk
<BR>copy docs/fms.guide&nbsp;&nbsp;&nbsp;help:
<BR>copy devs/fms.device&nbsp;&nbsp;devs:
<BR>type devs/Mountlist &gt;&gt;devs:Mountlist
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Jetzt braucht man noch eine Festplattenpartition mit etwas Platz.
F&uuml;r unsere Experimente hier sollten 4MB genug sein, aber es kann ruhig
auch mehr sein. In unserem Beispiel ist das <TT>Work:</TT>. Dort legt man
dann ein Verzeichnis an, wo die Diskarchive gespeichert werden.
Abschlie&szlig;end mu&szlig; diesem Verzeichnis der Assign <TT>fms:</TT>
zugewiesen werden:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>makedir Work:fms
<BR>assign fms: Work:fms
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Den Assign-Befehl gebe man auch in die <TT>s:user-startup</TT>, damit
FMS auch nach einem Neustart noch funktioniert.<BR>

<BR>Jetzt kann man endlich sein erstes leeres &quot;Archiv&quot;
erzeugen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>mount FF0:
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Danach sollte auf der Workbench ein neues Icon f&uuml;r ein Laufwerk
<TT>FF0:</TT> auftauchen. Huch!? Dabei hat ja niemand eine neue Disk
eingelegt! Tats&auml;chlich werden die Daten der &quot;Disk&quot; auf der
Festplatte gespeichert. Um genau zu sein, in der Datei <TT>fms:Unit0</TT>.
Die haben wir durch unseren Aufruf von <TT>mount</TT> angelegt.<BR>

<BR>Wie jede neue Diskette geh&ouml;rt auch diese erst einmal formatiert,
bevor man Daten darauf speichern kann:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>format Drive FF0: Name FMS-Disk-0 NoIcons
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Und was bringt uns das? Erstens ist dieses Laufwerk viel schneller als
das langsame <TT>DF0:</TT>, womit es ein praktisches Ziellaufwerk zum
Entpacken von ADF und DMS darstellt. Zweitens k&ouml;nnen wir praktisch
beliebig viele &quot;Laufwerke&quot; anlegen. Ein <TT>FF1:</TT> kann analog
wie zuvor erzeugt werden:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>mount FF1:
<BR>format Drive FF1: Name FMS-Disk-1 NoIcons
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Unser <TT>devs:Mountlist</TT> enth&auml;lt auch Eintr&auml;ge f&uuml;r
<TT>FF2:</TT> und <TT>FF3:</TT>. Ein <TT>FF4:</TT> kann sich jeder leicht
erzeugen, der ein bi&szlig;chen Ahnung &uuml;ber Eintr&auml;ge in der
<TT>Mountlist</TT> hat (Tip: &quot;Copy-and-Paste&quot;, <TT>UNIT</TT>
&auml;ndern). Einzige Grenze ist der verf&uuml;gbare Platz auf der
Festplatte.<BR>

<BR>Wollen wir also den guten <TT>sepp.dms</TT> nach <TT>FF0:</TT>
entpacken, so gibt man ein:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>dms Write sepp.dms To ff0: NoText
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Das einzige, das den Aufruf von dem zuvor unterscheidet ist das
<TT>FF0:</TT> statt dem <TT>DF0:</TT>. Und die Geschwindigkeit, mit der er
ausgef&uuml;hrt wird. Aus fast einer Minute werden ein paar Sekunden.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>Im zweiten Teil des Workshops haben wir DMS und seine obskure
Entstehungsgeschichte kennengelernt. Von der Handhabung her ist es
vergleichbar mit TransADF aus dem ersten Teil.<BR>

<BR>FMS hingegen erlaubt uns, Disketten auf der Festplatte abzulegen und
von dort anzumelden. Damit eignet es sich hervorragend als Ziellaufwerk
f&uuml;r DMS und TransADF.<BR>

<BR>Etwas bremsen tut die Freude die unn&ouml;tig aufwendige und kryptische
Installation von FMS. Doch Hilfe naht im dritten Teil: dort werden wir die
umst&auml;ndlichen CLI-Aufrufe in ein ARexx-Script verpacken. Wer bei den
Erl&auml;uterungen zu FMS schon nach der dritten Zeile nicht mehr
wu&szlig;te, wo ihm der Kopf stand, der warte noch ein Weilchen.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://ftp.uni-paderborn.de/pub/aminet/util/arc/dms111.run">aminet:util/arc/dms111.run</A> - Alt, aber schlecht. Amigas erster popul&auml;rer Diskarchiver<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://ftp.uni-paderborn.de/pub/aminet/disk/misc/fmsdisk.lha">aminet:disk/misc/fmsdisk.lha</A> - Stellt Dateien auf der Festplatte als Disketten dar<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://ftp.uni-paderborn.de/pub/aminet/docs/misc/dms-sucks.txt">aminet:docs/misc/dms-sucks.txt</A> - Die 10 wichtigsten Gr&uuml;nde, DMS nicht zu verwenden<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://ftp.uni-paderborn.de/pub/aminet/disk/misc/xfs.lha">aminet:disk/misc/xfs.lha</A> - Die Weiterf&uuml;hrung der FMS-Idee mit chaotischen Mitteln. F&uuml;r Fortgeschrittene.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="images_0B/sepp.adz">sepp.adz</A> (ADZ; 1K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="images_0B/sepp.dms">sepp.dms</A> (DMS; 2K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D4.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D6.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
