<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - Amiga Writer</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D1.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D3.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00D1.html">Wildfire\7 PPC</A> | <A HREF="0x00D2.html">Amiga Writer</A> | <A HREF="0x00D3.html">AmiWin</A> | <A HREF="0x00D4.html">Amiga Classix</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Amiga Writer - Version 1.2</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Amiga und Textverarbeitungen, das war schon immer ein
Problem. Nicht vielleicht, da&szlig; es davon zu wenige gab, nein, meist
haperte es an der gebotenen Funktionalit&auml;t. So war die
Unterst&uuml;tzung von Fu&szlig;noten bei vielen schon nicht mehr gegeben.
Irgendwann wurde dann in Amiga-Kreisen die Leistungsf&auml;higkeit einer
Textverarbeitung an der Tatsache gemessen, Fu&szlig;noten bzw.
Kapitelendnoten zu beherrschen. Das reicht heute f&uuml;r eine
Textverarbeitung aber schon lange nicht mehr aus. Man verlangt auch
zumindest WYSIWYG, Dokumentvorlagen, automatische Kapitelnumerierung,
Querreferenzen, Tabellenunterst&uuml;tzung, Grafikeinbindung
usw.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<A HREF="images_0B/amigawriter.gif"><IMG WIDTH=290 HEIGHT=198 ALT="[AmigaWriter]" SRC="images_0B/amigawritertn.gif" ALIGN=RIGHT HSPACE=15 VSPACE=15 BORDER=0></A>

<BR>Ich haben mir die recht neue Textverarbeitung AmigaWriter (Version 1.1
mit Update auf 1.2) von <A HREF="http://www.haage-partner.com/">Haage &amp;
Partner</A> angeschaut und wollte herausfinden, wie es in diesem Bereich am
Amiga derzeit ausschaut.<BR>

<BR>Man erh&auml;lt das Ganze in einer CD-Box, die jedoch anstelle der CD
zwei Disketten beinhaltet. Gedrucktes Handbuch ist keines dabei, aber
Dokumentation in Online-Form als AmigaGuide und zus&auml;tzlich auch ein
paar Dokumente im AmigaWriter-Format. Auf den Disketten befindet sich die
Version 1.1 des Programms. Aber auf der Internet-Seite von Haage &amp;
Partner kann kostenlos ein <A
HREF="http://www.haage-partner.com/dl_aw.htm">Update</A> auf die Version
1.2 heruntergeladen werden. Diese bringt vor allem zwei Neuerungen:
Formatvorlagen und Rechtschreibkontrolle. Alle Updates bis zur Version 2.0
(die es aber noch nicht gibt) sind f&uuml;r registrierte Kunden schon im
Kaufpreis der jetzigen Version enthalten. Die Installation des Programms
und des Updates k&ouml;nnen problemlos mit dem Installer durchgef&uuml;hrt
werden.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>AmigaWriter arbeitet im Gegensatz zu anderen Textverarbeitungen mit dem
Boxen-Konzept, das man aus der Welt des Desktop Publishing kennt. Das ist
f&uuml;r eine Textverarbeitung ungew&ouml;hnlich, jedoch ein interessanter
Ansatz, der viel gestalterische Freiheiten zul&auml;&szlig;t. Bei den Boxen
wird zwischen Text- und Bildboxen unterschieden. Erstere k&ouml;nnen
untereinander &quot;verbunden&quot; werden um den Textflu&szlig; von einer
in die n&auml;chste Box festzulegen. Die Boxen k&ouml;nnen frei auf der
Seite plaziert werden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Formate und Formatvorlagen</B></H3>&nbsp;

<BR>F&uuml;r eine durchg&auml;ngige, einheitliche Gestaltung eines
Dokumentes ist es von unsch&auml;tzbarem Wert, wenn eine Textverarbeitung
sogenannte Formatvorlagen unterst&uuml;tzt. Damit kann das Aussehen der
verschiedenen Textpassagen wie &Uuml;berschriften, Flie&szlig;text, Kopf-,
Fu&szlig;zeile usw. festgelegt werden.<BR>

<BR>AmigaWriter unterst&uuml;tzt hierbei Formate f&uuml;r folgende
Teile:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Zeichenformate<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Absatzformate<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Seitenformate<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> Kapitelformate<BR>
</TD></TR></TABLE>&nbsp;

<BR>Ein Zeichenformat definiert die Eigenschaften der Schriftzeichen wie
Zeichensatz, Schriftstil, Gr&ouml;&szlig;e und Farbe.<BR>

<BR>Mit einem Absatzformat k&ouml;nnen zus&auml;tzlich zu den schon vom
Zeichenformat bereitgestellten Einstellungen auch noch die Abst&auml;nde
vor und nach dem Absatz, der Zeilenabstand, sowie der linke bzw. rechte
Einzug festgelegt werden. Au&szlig;erdem ist es damit m&ouml;glich, die
Textausrichtung (links, Mitte, rechts, zentriert) sowie die Position und
Art der Tabulatoren anzugeben.<BR>

<BR>Damit eine Seite ein einheitliches Bild erh&auml;lt, ist es
m&ouml;glich, Seitenformate zu definieren. Dabei k&ouml;nnen die Anzahl der
Spalten, die R&auml;nder, Bereiche f&uuml;r Kopf- und Fu&szlig;zeile sowie
die Seitennumerierung festgelegt werden. Innerhalb eines Dokumentes
k&ouml;nnen mehrere Seitenformate verwendet werden.<BR>

<BR>Die Kapitelformate dienen beim AmigaWriter dazu, festzulegen, welches
Seitenformat f&uuml;r einen bestimmten Abschnitt des Dokumentes (Kapitel)
verwendet werden soll. Dabei ist es auch m&ouml;glich, f&uuml;r linke und
rechte Seiten eines Kapitels ein unterschiedliches Format zu w&auml;hlen,
soda&szlig; auch Dokumente f&uuml;r doppelseitigen Ausdruck sinnvoll
erzeugt werden k&ouml;nnen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Was kann das Programm noch?</B></H3>&nbsp;

<BR>Die Tabulatorunterst&uuml;tzung ist recht umfangreich. Es werden
linksb&uuml;ndige, zentrierte, rechtsb&uuml;ndige und am Dezimalpunkt (bzw.
einem anderen Zeichen) ausgerichtete Tabulatoren angeboten. Die Tabulatoren
k&ouml;nnen f&uuml;r jeden Absatz einzeln definiert werden. Und
nat&uuml;rlich gibt es auch eine Verwaltung von Fu&szlig;noten,
Kapitelendnoten und Textendnoten. Auch Suchen und Ersetzen im Text wird
angeboten. Eine praktische Sache ist auch das zeitgesteuerte automatische
Sichern des Dokumentes, sowie die Verwaltung mehrerer Dokumentenversionen.
Es k&ouml;nnen au&szlig;erdem mehrere Projekte (Dokumente) gleichzeitig
ge&ouml;ffnet und bearbeitet werden.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Aber was fehlt?</B></H3>&nbsp;

<BR>Soweit betrachtet sehen die von AmigaWriter gebotenen Funktionen recht
ordentlich aus, aber wenn man sich das Ganze dann etwas genauer ansieht,
kommt man doch schnell drauf, da&szlig; noch einiges fehlt. So ist derzeit
beispielsweise keine Unterst&uuml;tzung f&uuml;r eine automatische
Kapitelnumerierung zu finden; das ist aber bei etwas l&auml;ngeren
strukturierten Dokumenten unbedingt erforderlich, denn wer will schon alle
nachfolgenden Kapitelnummern h&auml;ndisch nachf&uuml;hren, wenn er wo eine
neue Kapitel&uuml;berschrift einf&uuml;gt. Genausowenig ist eine
vern&uuml;nftige Unterst&uuml;tzung f&uuml;r Inhaltsverzeichnisse
vorhanden. Das einzige, was AmigaWriter daf&uuml;r bietet, ist, alle
Abs&auml;tze, die im Absatzformat besonders markiert sind, auf einer Stelle
hinzuschreiben. Jedoch kann keine Formatierung und nichts festgelegt
werden. Die fehlende Kapitelnumerierung l&auml;&szlig;t schon darauf
schlie&szlig;en, da&szlig; auch keine Aufz&auml;hlungslisten
unterst&uuml;tzt werden. Genausowendig kann man nat&uuml;rlich Referenzen
zwischen Kapiteln oder zu Abbildungen in den Text einf&uuml;gen. Die oben
angef&uuml;hrten Funktionen sollten heute eigentlich von jeder
Textverarbeitung angeboten werden. Zus&auml;tzlich geh&ouml;rt auch das
Erstellen von Tabellen heute schon fast zum Standard. Bessere
Textverarbeitungen k&ouml;nnen sogar mit einem Formeleditor aufwarten.
Beides fehlt derzeit beim AmigaWriter. Es wird aber versichert, da&szlig;
sich das Programm eines modular erweiterbaren Konzeptes bedient und solche
Erg&auml;nzungen hinzugef&uuml;gt werden k&ouml;nnen. Wir werden sehen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Positiv &uuml;berrascht</B></H3>&nbsp;

<BR>AmigaWriter bietet zahlreiche Einstellfenster, mit denen der Text
formatiert werden kann. W&auml;hrend bei anderen Textverarbeitungen
(bekanntester Vertreter ist WinWord) diese wieder geschlossen werden
m&uuml;ssen, bevor man im Dokument weiterarbeiten kann, sind diese beim
AmigaWriter durchwegs nichtmodal ausgef&uuml;hrt. Das bedeutet, man kann
diese Einstellfenster st&auml;ndig offen halten, was ein sehr angenehmes
und schnelles Arbeiten erm&ouml;glicht.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Silbentrennung und Rechtschreibpr&uuml;fung</B></H3>&nbsp;

<BR>Die Silbentrennung wird von AmigaWriter komfortabel und automatisch
nach einem sprachabh&auml;ngigen Algorithmus durchgef&uuml;hrt. Dazu ist
kein expliziter Durchlauf des Dokumentes erforderlich. Der Trennalgorithmus
richtet sich dabei an die Sprache, die durch den Landes-Voreinsteller
(<TT>Locale</TT>) im Betriebssystem eingestellt ist. Sollte der Algorithmus
einmal nicht zum gew&uuml;nschten Ergebnis f&uuml;hren, dann kann mittels
Tasten-K&uuml;rzel auch eine explizite Trennstelle eingef&uuml;gt bzw. eine
automatische Trennstelle entfernt werden. Bei der Rechtschreibpr&uuml;fung
verwendet AmigaWriter das von Unix entlehnte ISpell. Daf&uuml;r stehen
W&ouml;rterb&uuml;cher f&uuml;r viele Sprachen im Internet zur
Verf&uuml;gung. Mitgeliefert sind die f&uuml;r Deutsch (alte
Rechtschreibung) und Englisch.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zeichens&auml;tze</B></H3>&nbsp;

<BR>Von AmigaWriter k&ouml;nnen alle Amiga-Zeichens&auml;tze, also sowohl
die Pixelvarianten als auch die skalierbaren im <TT>Intellifonts</TT>
verwendet werden. Mit zus&auml;tzlichen Font-Engines k&ouml;nnen auch
andere skalierbare Schriften eingesetzt werden. So k&ouml;nnen &uuml;ber
die <A
HREF="http://it.aminet.net/pub/aminet/util/libs/ttflib.lha">ttf.library</A>
, welche aus dem Aminet frei bezogen werden kann, auch Zeichens&auml;tze im
TrueType-Format, welches von PCs verwendet wird, benutzt werden.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Grafiken</B></H3>&nbsp;

<BR>Auch das Einbinden von Grafiken ist am Amiga immer ein Problem.
W&auml;hrend Pixelgrafiken wie Bilder noch recht gut unterst&uuml;tzt
werden, sieht es bei Vektorgrafiken meist sehr schlecht aus, was wohl auch
daran liegt, da&szlig; sich hier nie so richtig ein Standardformat
durchgesetzt hat. Zwar wird dr2d als Standard angesehen, es fehlt im
Betriebssystem aber jegliche Unterst&uuml;tzung f&uuml;r dieses Format, ja
f&uuml;r Vektorgrafiken allgemein (was die graphics.library bietet, ist
f&uuml;r heutige Verh&auml;ltnisse l&auml;cherlich). Dies ist
wahrscheinlich auch der Grund, warum AmigaWriter nur mit Pixelgrafiken
umgehen kann. Er kann alles einbinden, wof&uuml;r ein DataType
existiert.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ausdruck</B></H3>&nbsp;

<BR>Die Ausdruckqualit&auml;t ist zwar hochwertig, aber es dauert ungemein
lange bis eine Seite gedruckt ist, weil diese vollst&auml;ndig Pixel
f&uuml;r Pixel als Grafik zum Drucker geschickt wird. Das f&auml;llt bei
Tintenstrahldruckern, die selbst wenig Intelligenz besitzen und auch keine
allzu hohe Druckgeschwindigkeit haben, vielleicht nicht so auf, aber bei
einem Laser mit 600dpi Aufl&ouml;sung wird das Ganze zu einer Geduldprobe.
W&auml;hrend bei anderen Programmen (z.B. PageStream) eine Seite fast
unmittelbar nach dem Erteilen des Druckauftrages aus dem Drucker kommt,
ben&ouml;tigt AmigaWriter daf&uuml;r auf einem mit 060er Prozessor
best&uuml;ckten Amiga geschlagene 95 Sekunden f&uuml;r den Ausdruck auf
einem HP LaseJet 5MP. Die F&auml;higkeiten der Laserdrucker (Postscript,
PCL 5 usw.) werden von der Druckroutine also keineswegs ausgenutzt. Hier
liegt der Mangel aber gro&szlig;teils auch im Amiga Betriebssystem, das
keine ger&auml;teunabh&auml;ngige Ausgabe von Schriften und Vektorgrafiken
bereitstellt, weshalb die Programmierer von Anwendungsprogrammen das immer
wieder selber implementieren m&uuml;ssen.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>AmigaWriter ist eine Textverarbeitung, die sich an Desktop Publishing
Systemen orientiert. Leider besitzt es in der derzeitigen Version auch die
im DTP Bereich oftmals auftretenden Funktionsm&auml;ngel wie fehlende
Kapitelnumerierung, Aufz&auml;hlungs-, Listen- und
Tabellenunterst&uuml;tzung. Abgesehen von den fehlenden
Funktionalit&auml;ten und der relativ langsamen Druckerausgabe kann man das
Programm aber als sehr gelungen betrachten. Vielleicht bringt die Version
2.0, die man als registrierter Benutzer ja kostenlos erh&auml;lt, sobald
sie erscheint, einige dieser Funktionen. Das Arbeiten mit AmigaWriter ist
komfortabel und auf einem Amiga mit MC 68060 Prozessor und Grafikkarte
erfreulich schnell. Die gestalterischen M&ouml;glichkeiten gehen aufgrund
des Boxenkonzeptes weit &uuml;ber die M&ouml;glichkeiten einer
herk&ouml;mmlichen Textverarbeitung hinaus. Die Stabilit&auml;t des
Programmes ist erfreulich hoch (es ist mir beim Test kein einziges Mal
abgest&uuml;rzt). Empfehlenswert ist das Programm f&uuml;r all jene, die
nicht unbedingt strukturierte Dokumente wie Handb&uuml;cher, Diplomarbeiten
usw. anfertigen m&uuml;ssen, sondern eher Briefe, Einladungen, Preislisten,
Speisekarten usw. verfassen wollen.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 BORDERCOLORLIGHT="#DDDDDD" BORDERCOLORDARK="#BBBBBB" ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="images/_box_red.gif" WIDTH=60 HEIGHT=10 ALT="[60]"><IMG SRC="images/_box_black.gif" WIDTH=40 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="images/_box_red.gif" WIDTH=70 HEIGHT=10 ALT="[70]"><IMG SRC="images/_box_black.gif" WIDTH=30 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="images/_box_red.gif" WIDTH=98 HEIGHT=10 ALT="[98]"><IMG SRC="images/_box_black.gif" WIDTH=2 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="images/_box_red.gif" WIDTH=55 HEIGHT=10 ALT="[55]"><IMG SRC="images/_box_black.gif" WIDTH=45 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="images/_box_red.gif" WIDTH=75 HEIGHT=10 ALT="[75]"><IMG SRC="images/_box_black.gif" WIDTH=25 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage &amp; Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://it.aminet.net/pub/aminet/util/libs/ttf.library">ttf.library</A> im Aminet<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D1.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D3.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
