<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - Uropa 2 (2.Versuch)</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D8.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00DA.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00D8.html">Uropa 2 (1.Versuch)</A> | <A HREF="0x00D9.html">Uropa 2 (2.Versuch)</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Uropa 2 (2.Versuch) - Rettet den Jupitermond!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Was f&uuml;r eine Ironie des Schicksals: ich teste ein
Spielchen namens <B>Uropa 2</B> und f&uuml;hle mich gleichzeitig selbst wie
ein Ur-Opa. Nicht wegen rheumatischen Beschwerden, und auch
Herzschrittmacher habe ich noch keinen, aber immerhin einen st&ouml;renden
und unpraktischen Gips an der rechten Hand. Liebe Leser, wenn Ihr einmal
frustriert seid, dann haut bitte blo&szlig; nicht mit der rechten Hand
gegen die Wand, schon gar nicht als Rechtsh&auml;nder: Ihr k&ouml;nntet
Euch dabei den f&uuml;nften Mittelhandknochen brechen...</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der Frust kam allerdings nicht vom Spiel, denn das habe ich so richtig
erst mit Gips getestet, also passierte jene Aktion schon vorher. Jedoch ist
das gleichzeitige Bedienen von Tastatur, Joystick und Maus f&uuml;r einen
Uropa wie mich auch ganz sch&ouml;n frustrierend! Aber sei&acute;s drum:
das Game hat durchaus etwas Besonderes, das sei mal vorweggenommen!<BR>

<BR>Wenn es eine Vorgeschichte gibt, dann sollte man sie auch im
Testbericht erw&auml;hnen. Vor allem, weil sie an Innovation und
Genialit&auml;t mit dem Gro&szlig;teil der Spiele mithalten kann (hehe, das
war jetzt ein bisserl sarkastisch, gell?): irgendwann in der fernen Zukunft
f&uuml;hren die Menschen interstellare Kriege und bekommen dabei ganz
sch&ouml;n eins auf den Deckel. Danach wird <I>InterCorp</I>
gegr&uuml;ndet, eine Organisation, die aus Menschen und Druiden (Tektiten,
Kapones) besteht und sich um die Sicherheit der Menschheit k&uuml;mmert.
Auf dem Jupitermond Europa gab es auch eine Kolonie. Sie wird wegen der
strategisch g&uuml;nstigen Position des Mondes wiederaufgebaut, und der
Mond wird in <B>Uropa 2</B> umgetauft (nein, wie originell!). Dort fangen
irgendwann die Kapones an, mit den Feinden der menschlichen Rasse zu
kooperieren und das Projekt zu sabotieren. Um das Problem in den Griff zu
bekommen, wird die Tektiten-Elitetruppe eingesetzt, und der Spieler ist
einer von ihnen. Die Vorgeschichte ist &uuml;brigens zum Teil in ein
nettes, gerendertes Intro verpackt.<BR>

<BR>In einem prachtvollen und umfangreichen Missionen-Komplex soll nun den
aufr&uuml;hrerischen Verr&auml;tern der Garaus gemacht werden. Jede Mission
mu&szlig; erst einmal absolviert werden, bevor man eine neue starten kann
(es gibt derer zehn). Sie beinhaltet einige einzelne Missionsziele, die man
nach M&ouml;glichkeit erf&uuml;llen sollte; wenn es einmal nicht ganz nach
Plan klappt, kann man zwar weiterspielen, aber es ist nicht gerade
f&ouml;rderlich f&uuml;r <I>Phase III.</I> Selbige wird n&auml;mlich in 12
Stunden gestartet werden, und bis dahin mu&szlig; der Spieler <I>Phase
II</I>, also seine Missionen, irgendwie absolvieren. Klingt irgendwie nach
Zeitstre&szlig;, hm? Ist aber nicht so schlimm, denn Stre&szlig; ist auch
sonst kein Fremdwort nicht. Nat&uuml;rlich kann (und sollte) man jederzeit
abspeichern (und das beliebig oft).<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Soviel zu den Grundvoraussetzungen. Das Spiel selbst gestaltet sich
auch recht interessant, zumal es aus zwei Teilen besteht: in diversen Basen
l&auml;uft (bzw. schwebt) man in Iso-3D-Komplexen herum (&agrave; la
Darkmere &amp; Co.), und auf der echten 3D-Oberfl&auml;che von Uropa hovert
man im Hover-Gef&auml;hrt herum (was an die Luftkissenfahrten aus Armour
Geddon erinnert). Und beide Teile seien in den folgenden Abs&auml;tzen
genauer beschrieben:<BR>

<BR>Der Iso-3D-Teil ist irgendwie eine Mischung aus Impossible Mission (man
kann alles durchsuchen) und Alien Breed (Computerterminals, diverse Waffen,
Tools, Gegner, T&uuml;ren, ...), graphisch eingebettet in lauter einzelne
nicht scrollende R&auml;ume. Dummerweise laufen abgesehen von (per
Teleporter) zu rettenden Menschleins, die teils erst mal befreit werden
m&uuml;ssen (das bedeutet: such den passenden Code!), nur b&ouml;se und
nicht gerade leicht bewaffnete Kapones in verschiedener Ausf&uuml;hrung
herum. Dies macht einem doch das Leben schwer. Ach ja, ein wesentlicher
Bestandteil sind die Credits. Man braucht sie, um Ausr&uuml;stung f&uuml;r
sich selbst und den Hover zu beschaffen oder um Informationen aus Terminals
downzuloaden. Umgekehrt kann man durch uploaden Credits erstehen, solche
irgendwo finden oder durch Abschu&szlig; von feindlichen Hovers
verdienen.<BR>

<BR>Was man nun beispielsweise alles erstehen kann: da w&auml;ren einmal
Waffen. Anfangs f&uuml;hrt man ein mickriges Laserschwert - wer will da
nicht gerne lieber mit furiosen Blastern durch die Gegend ballern? Zweitens
gibt es Zusatztools f&uuml;r die Waffen (Cooler gegen &Uuml;berhitzung,
Autofire, ...) und nat&uuml;rlich Munition. Drittens Verpflegung, denn die
Energie schwindet bei ungesunden Feindkontakten rasant dahin. Viertens
Bomben verschiedenster Art, mit welchen man vorsichtig hantieren sollte.
Und es w&uuml;rde mich nicht wundern, wenn ich viele Dinge noch gar nicht
entdeckt habe! Ach ja, Infos gibts auch zu kaufen, wie schon gesagt. Und
Ausr&uuml;stung f&uuml;r den Hover (Raketen, Treibstoff, ...) sowieso.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Genial ist auch, da&szlig; man schon recht bald in der ersten Mission
durch die geniale Erfindung irgendeines Professors (Dr. Jekyll?) in einen
Kapone transformiert wird, das aber nur 15 Minuten lang, und dann
&quot;maskiert&quot; und in Eile durch die von Feinden nur so gespickten
Ebenen hirschen kann. Man sollte sich aber gut &uuml;berlegen, was man in
dieser Zeit alles macht. Bereits hier kommen Adventure-m&auml;&szlig;ige
und strategische Elemente zum Vorschein. Zuvor mu&szlig; man aber erst eine
T&uuml;r per Zeitbombe sprengen und sollte das rechtzeitige Verdr&uuml;cken
nicht vergessen, sonst wird man von der Bombe ganz ver-, &auml;h
zerdr&uuml;ckt. :-) - Selbst das Durchsuchen von Mistk&uuml;beln und Betten
will zeitlich wohldosiert sein (am besten erst speichern, dann testen
etc.), denn Kapones sind nicht zimperlich, was &Uuml;berraschungsbesuche
anbelangt. Und der direkte Kampf ist auch nicht blo&szlig; ein &quot;ich
geh hin und dr&uuml;ck ein paar Mal Feuer, bis er tot ist&quot;; wer
l&auml;nger leben will, k&auml;mpft mit K&ouml;pfchen.<BR>

<BR>Das &quot;Herumgehovere&quot; auf der Oberfl&auml;che des Mondes ist
graphisch gesehen eher zweckm&auml;&szlig;ig gestaltet, wobei sich
allerdings der Detailgrad einstellen l&auml;&szlig;t; man bewegt sich
herum, sammelt Gegenst&auml;nde auf, ballert auf Gegner per Laser oder
Lenkraketen, wird selbst unter Beschu&szlig; genommen, l&auml;dt seine
Power an Aufladestellen auf und sucht Eing&auml;nge zu neuen Basen. Dies
alles in beliebiger Kombination und Reihenfolge. Da alles so glatt und
fl&uuml;ssig abl&auml;uft (auch eine simple, jedoch sehr praktische Map ist
vorhanden - dies &uuml;brigens auch im Iso-3D-Teil mit Automapping!), macht
es auch einigerma&szlig;en Spa&szlig;. Ein vom Hocker rei&szlig;ender
Actionknaller ist es nicht gerade, aber nichtsdestotrotz recht unterhaltsam
und spannend und gut zum Konzept passend. Und hochinteressant ist auch die
M&ouml;glichkeit der &quot;HoverWars&quot;: per seriellem Kabel k&ouml;nnen
so zwei Amigianer gegeneinander antreten. Da&szlig; so etwas irre
Spa&szlig; machen kann, kennen einige von uns sicherlich von Games wie
&quot;Transplant&quot;...<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da ich schon von der Map sprach, erw&auml;hne ich gleich noch ein paar
allgemeine Features. Alle Texte von Infos, Missionsbeschreibungen und
gesendeten Nachrichten werden zus&auml;tzlich per Sprachausgabe vorgelesen,
was in der Tat recht nett klingt. Man kann diese auch ganz nach Wunsch
einzeln l&ouml;schen, sonst bleiben sie n&auml;mlich allesamt gespeichert,
z.B. f&uuml;r Upload-Zwecke. W&auml;hrend des Spiels lassen sich jederzeit
die Preferences &auml;ndern und Spielst&auml;nde laden oder speichern. Die
Inventar-Handhabung ist auch recht handlich und &uuml;bersichtlich.<BR>

<BR>Die Grafik ist, wie so oft, nicht gerade allererste Sahne, sondern eher
zweckm&auml;&szlig;ig ausgefallen, aber Grund zum Meckern besteht auch
wieder nicht. Sound und FX f&uuml;gen sich recht gut in die Stimmung des
Spiels ein bzw. untermalen diese auf passende Weise. Mit der Steuerung
k&ouml;nnte man anfangs seine kleinen N&ouml;te haben, da sowohl Maus als
auch Tastatur vonn&ouml;ten sind - wer will, kann sich auch noch einen
Joystick antun, aber mit dem kann man sich nicht mal schnell bewegen im
Iso-Modus. Und das kann oft &uuml;berlebenskritisch sein! Ansonsten glaube
ich, da&szlig; man sich recht bald daran gew&ouml;hnen kann. Mit Gips
dauert&acute;s halt etwas l&auml;nger. ;-)<BR>

<BR>Mindestvoraussetzung ist ein 68000er, 1 MB Chip &amp; 1 MB Fast Ram,
ein 4x CD-Rom und eine Festplatte. Aber empfohlen wird ein 68020+ und mehr
Fast Ram. Grunds&auml;tzlich wird alles weitere ausgen&uuml;tzt: AGA und
mehr Ram k&ouml;nnen also genausowenig schaden wie flinkere Harddisks &amp;
CD-Laufwerke. Wie bei allen Games von <A
HREF="http://www.vulcan.co.uk/">Vulcan</A> gibt es die Demoversion an allen
Ecken und Enden zu finden - wer also lieber testspielt, kann sich diesen
Wunsch mit Leichtigkeit erf&uuml;llen. Und ebenfalls kaum noch n&ouml;tig
zu erw&auml;hnen ist die Tatsache, da&szlig; wie immer eine
ausf&uuml;hrliche Anleitung in allen notwendigen Sprachen inkludiert
ist.<BR>

<BR>Abschlie&szlig;endes Urteil: ein zumindest sehr interessantes Spiel,
das f&uuml;r eine Menge Spa&szlig; und Spannung sorgen kann - im Prinzip
fast schon ein Genre-Mix aus den bereits zitierten Spielen... Abwechslung
garantiert! Wenigstens anschauen sollt&acute; sich&acute;s ein jeder...<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 BORDERCOLORLIGHT="#DDDDDD" BORDERCOLORDARK="#BBBBBB" ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="images/_box_red.gif" WIDTH=71 HEIGHT=10 ALT="[71]"><IMG SRC="images/_box_black.gif" WIDTH=29 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="images/_box_red.gif" WIDTH=73 HEIGHT=10 ALT="[73]"><IMG SRC="images/_box_black.gif" WIDTH=27 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="images/_box_black.gif" WIDTH=9 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="images/_box_red.gif" WIDTH=75 HEIGHT=10 ALT="[75]"><IMG SRC="images/_box_black.gif" WIDTH=25 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="images/_box_red.gif" WIDTH=81 HEIGHT=10 ALT="[81]"><IMG SRC="images/_box_black.gif" WIDTH=19 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.vulcan.co.uk/">Vulcan Software</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D8.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00DA.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
