<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - TCP/IP: Die Exoten</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00D6.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D8.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00D5.html">Diskarchive</A> | <A HREF="0x00D6.html">REXX</A> | <A HREF="0x00D7.html">TCP/IP: Die Exoten</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00CC.html"><IMG WIDTH=77  HEIGHT=25 SRC="images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00CD.html"><IMG WIDTH=117 HEIGHT=25 SRC="images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00CE.html"><IMG WIDTH=85  HEIGHT=25 SRC="images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00CF.html"><IMG WIDTH=70  HEIGHT=25 SRC="images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00D0.html"><IMG WIDTH=131 HEIGHT=25 SRC="images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00D1.html"><IMG WIDTH=121 HEIGHT=25 SRC="images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00D5.html"><IMG WIDTH=135 HEIGHT=25 SRC="images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00D8.html"><IMG WIDTH=73  HEIGHT=25 SRC="images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00DA.html"><IMG WIDTH=91  HEIGHT=25 SRC="images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00DB.html"><IMG WIDTH=112 HEIGHT=25 SRC="images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00DC.html"><IMG WIDTH=46  HEIGHT=25 SRC="images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>TCP/IP: Die Exoten - DNS, Envoy, Samba, NFS (Teil 5)</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Nachdem nun so einigermassen gekl&auml;rt sein sollte,
wie man die grundlegenden Netzkonfigurationen vornimmt, soll hier nun auf
die Interessantheiten Bezug genommen werden, die nicht mehr ganz so
offensichtlich sind.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>DNS</B></H3>&nbsp;

<BR>Der <B>DNS</B>, das f&uuml;r <B>Domain Name Service</B> steht, ist
daf&uuml;r zust&auml;ndig, das nicht immer die kryptischen IP-Adressen
eingegeben werden m&uuml;ssen, um auf andere Rechner zu gelangen, sondern
mit mehr oder weniger sinnvollen Namen gearbeitet werden kann. Dabei ist
die Ordnung, nach der ein Name gesucht wird, hierarchisch aufsteigend vom
lokalen File, in dem nachgeschaut wird, zum ersten DNS (hier: Domain Name
Server), weiter zum Dar&uuml;berstehenden usw, bis sich ein Name
findet.<BR>

<BR>Die lokale Instanz bildet dabei das File <TT>AmiTCP:db/hosts</TT>, bzw.
die entsprechende Seite im Genesis, die gleich aufgebaut ist. Auch beim
Miami und beim I-Net 225 ist die Struktur die Gleiche. Dieses File weist
IP-Adressen nun Namen und Aliases zu, nach denen ein Rechner identifiziert
werden kann. Eine Zeile referenziert dabei einen Rechner. Als erstes steht
immer die IP-Adresse, dahinter, durch Leerzeichen getrennt, folgen die
Namen unter der der Rechner erreichbar ist. Die Reihenfolge der Namen ist
dabei irrelevant, unter jedem ist der Rechner erreichbar. M&ouml;gliche
Eintr&auml;ge kann man sich so vorstellen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>127.0.0.1 localhost
<BR>;
<BR>192.168.1.1 a2000.rockus.at a2000
<BR>192.168.1.2 a4000.rockus.at a4000
<BR>;
<BR>192.168.1.11 dn5500.rockus.at dn5500 tiger
<BR>192.168.1.12 dn3500.rockus.at dn3500 puma
<BR>;
<BR>192.168.1.21 next.rockus.at next
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Damit ist der Rechner an der IP-Adresse 192.168.1.11 zum Beispiel unter
drei Namen erreichbar, ohne da&szlig; es einen Unterschied machen
w&uuml;rde, unter welchem Namen ihn man jetzt wirklich anspricht, da im
Endeffekt wieder nur die IP-Adressen zum Einsatz kommen.<BR>

<BR>Wird ein Name im <TT>hosts</TT>-File nicht gefunden, so wird der
prim&auml;re Nameserver gefragt, ob er denn was wei&szlig;. Unter welcher
IP-Adresse der nun erreichbar ist, mu&szlig; im
<TT>AmiTCP:db/resolv.conf</TT>, bzw. wieder den entpsrechenden Files bei
den anderen Stacks, eingetragen werden. Der Eintrag erfolgt dabei wieder
zeilenweise: an erster Stelle das Wort <TT>NAMESERVER</TT>, dahinter, durch
ein oder mehrere Leerzeichen getrennt, die entsprechende IP-Adresse. Das
kann dann zum Beispiel so aussehen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>; Name servers
<BR>NAMESERVER 195.34.133.10
<BR>NAMESERVER 129.27.2.3
<BR>NAMESERVER 195.34.133.11
<BR>NAMESERVER 129.27.3.3
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Da&szlig; hier vier Server angegeben sind, ist nicht wirklich relevant,
da einerseits AmiTCP ohnehin nur die ersten drei verwendet. Der Sinn
dahinter ist aber, stes die Chance zu haben, einen Nameserver finden zu
k&ouml;nnen, sollte der erste, oder gar mal zwei davon ausfallen.<BR>

<BR>Wei&szlig; dieser gefragte Server auch nicht weiter, fragt er einen
weiteren Server, und der wieder und wieder und wieder, aber das braucht den
Ben&uuml;tzer am Ende der Schlange ncht zu k&uuml;mmern, das merkt er nicht
mehr.<BR>

<BR>Will man nachschauen, was ein Nameserver so alles wei&szlig;, gibt es
sch&ouml;ne kleine Tools daf&uuml;er, wie zum Beispiel <TT>askhost</TT>,
das zu Namen die Adressen, aber auch zu Adressen die Namen liefern kann.
Eine m&ouml;gliche Ausgabe kann dann so aussehen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>13.Work:&gt; askhhost puma
<BR>
<BR>host: dn3500.rockus.at	 addrtype: 2&nbsp;&nbsp;&nbsp;length: 4
<BR>aliases:
<BR>&nbsp;&nbsp;&nbsp;&nbsp;dn3500
<BR>&nbsp;&nbsp;&nbsp;&nbsp;puma
<BR>address list:
<BR>&nbsp;&nbsp;&nbsp;&nbsp;192.168.1.12
<BR>
<BR>13.Work:&gt;
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Daraus ist auch ersichtlich, da&szlig; ein Name mehreren Rechnern
zugeordnet sein kann, was aber wieder eigene Verwaltung ben&ouml;tigt, auf
die hier nicht genauer eingegangen werden soll. Als Beispiel soll
<TT>askhost sbox.tu-graz.ac.at</TT> gen&uuml;gen.<BR>

<BR>Eine richtige Funktionalit&auml;t bieten die Namen indes nicht, sie
sind einfach dazu da, um leichter merkbare Zeichenketten zu bieten. Mit den
IP-Adressen kommt man aber genausoweit, selbst WebBrowser k&ouml;nnen mit
diesen Ziffern was anfangen. Somit kommt man auch dann noch weiter, wenn
einmal wirklich kein Nameserver erreichbar sein sollte.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Envoy</B></H3>&nbsp;

<BR>Das Hauptargument, um &uuml;berhaupt Netzwerke zwischen Computern zu
bauen, d&uuml;rfte der Datenaustausch sein. Daf&uuml;r gibt es das kleine
unscheinbare FTP plus zugeh&ouml;riger Daemons, die die Anfragen abwickeln.
Komfortabel ist das aber nicht.<BR>

<BR>Die wohl einfachste M&ouml;glichkeit, unter Amigas Daten auszutauschen,
besteht im kommerziellen <B>Envoy</B> (dessen brandneue Version 3 in der
n&ouml;chsten Ausgabe unter die Lupe genommen werden wird). Damit
k&ouml;nnen Verzeichnisse, somit komplette Festplatten, oder auch nur
Assigns in das Netz exportiert werden und andere Amigas k&ouml;nnen dieses
dann wieder bei sich einbinden.<BR>

<BR>Auf deren Workbench erscheint dann das Laufwerks-Icon so, als ob es ein
lokales Laufwerk w&auml;re. Sogar diverse <TT>.backdrop</TT>-Files werden
ber&uuml;cksichtigt, soda&szlig; ausgelagerte Icons auch auf dem Amiga
ausgelagert werden, auf dem dieses Device importiert wird. In der neuen
Version 3 werden auch Wechselmedien, wie CD-Laufwerke unterst&uuml;tzt.
Nimmt man die CD aus dem Laufwerk, verschwindet das entsprechende Icon auch
von der Workbench aller Amigas, die dieses CD-Laufwerk importiert haben.
Sehr praktisch.<BR>

<BR>Ein rudiment&auml;res Sicherheits-System ist auch enthalten, das aber
abschaltbar ist, soda&szlig; man sich im kleinen Netz zuhause nicht um
diverse Zugriffsrechte k&uuml;mmern mu&szlig;, wenn man nicht will.<BR>

<BR>Das Sch&ouml;ne am Envoy ist, da&szlig; auch Drucker ex- und
importierbar sind. Das ist umso erstaunlicher, als diese M&ouml;glichkeit
im AmigaOS schon viel weniger leicht unterzurbingen ist, als irgendwo
irgendwelche Devices zu mounten. Prim&auml;r durch Ersetzen, bzw. Patchen
des <TT>parallel.device</TT>s und des <TT>printer.device</TT>s ist dies
aber m&ouml;glich, solange nicht irgendein absonderliches Programm in der
Hardware herumpfuscht.<BR>

<BR>Die Konfiguration ist einfach &uuml;ber eine simple, aber funktionale
Oberfl&auml;che m&ouml;glich und der modulare Aufbau scheint auch die
Einbindung weiterer Services zu erm&ouml;glichen. Derzeit gibt es ein
<TT>printspool.service</TT> und ein <TT>filesystem.service</TT>, was will
man da denn eigentlich noch?<BR>

<BR>Mit Envoy wird es auch m&ouml;glich sein, komplexere Netzwerke
&uuml;ber mehrere Segmente und verschiedene Realms (wo nicht jeder alle
sieht, sondern nur die im gleichen Realm zugeordneten Rechner) zu
realisieren, auch wenn in der Doku davon eher abgeraten wird, da der
Support daf&uuml;r nicht gew&auml;hrleistet werden k&ouml;nne.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Samba</B></H3>&nbsp;

<BR>Envoy ist zwar gut und sch&ouml;n, aber damit kann man eben nur Amigas
vernetzen, das daf&uuml;r aber mit ungeahntem Komfort und
Funktionalit&auml;t. Will man sich aber auch nicht zur PC-Welt (und auch
unixoiden Systemen) abgrenzen, so f&auml;llt das Auge auf das (unixoid)
komplexe <B>Samba</B>, f&uuml;r das es auch einen Port f&uuml;r den Amiga
gibt und die M&ouml;glichkeit bietet, vom Amiga aus Devices (Partitionen,
Verzeichnisse, etc.) und Drucker ins Netz zu exportieren, die ein Windows
(sei es nun ein 3.11 oder auch NT - egal) einfach in der
&quot;Netzwerkumgebung&quot; erkennen kann und einfach gemountet werden
k&ouml;nnen.<BR>

<BR>So wird hier schon seit l&auml;ngeren von den PCs im Netz auf einem
Drucker am Amiga gedruckt. Was hier abgeht, ist die Spool-f&auml;higkeit.
Das hei0t, wenn gerade ein Druckjob in Arbeit ist, wird ein zweiter einfach
nicht angenommen, ohne dass der PC-User was davon merkt, da die Daten
einwandfrei zum Amiga geschickt werden konnten. Um diesem Mi&szlig;stand
abzuhelfen, gibt es <TT>SambaPM</TT>, das auf der Amiga-Seite einen einfach
zu bedienenden Druckerspooler nachbildet. Das Paket ist zwar noch in einem
fr&uuml;hen Entwicklungsstadium, dessen Funktionalit&auml;t aber schon
f&uuml;r einen gro&szlig;r&auml;umigen Einsatz ausreicht. Wenn
gen&uuml;gend Leute den lieben <A
HREF="mailto:jschober@pointdesign.com">J&uuml;rgen</A> treten, wird er schon
dran weiterbauen :-))<BR>

<BR>Die Konfiguration von Samba ist bei Weitem nicht so elegant wie bei
Envoy, aber warum auch, ist ja ein Unix-Tool. Im File
<TT>Samba:lib/smb.conf</TT> findet alles statt, was man so verkonfigurieren
kann. Die Grundstruktur besteht aus diversen Teilen, der erste
(<TT>[global]</TT>) bestimmt, was f&uuml;r alle folgenden Teile gilt. Jeder
dieser folgenden Teile exportiert ein Device oder einen Drucker ins Netz,
auf da&szlig; die PCs ihre F&auml;nge danach auswerfen, aber meistens
tappen sie eh im Dunkeln, wenn's ums Netzwerk geht...<BR>

<BR>Die Dokumenation zu Samba ist soweit vollst&auml;ndig, da&szlig; die
einzelnen Punkte ausreichend genau, aber halt auf englisch, darinnen
beschrieben sind. Zur Konfiguration selber ist allerdings wichtig,
da&szlig; der <TT>os-level</TT> angepa&szlig;t wird. Es hilfts nichts, wenn
der ganze Rest pa&szlig;t. Ein Windows-NT wird bei einem OS-Level-Wert
unter 32 einfach nichts finden wollen.<BR>

<BR>Ganz praktisch ist auch, wenn man <TT>preferred-master</TT> auf
<TT>yes</TT> stellt, da dadurch auf PC-Seite durch die freigegebenen Shares
(das Sammelwort f&uuml;r Devices und Drucker) gebl&auml;ttert werden kann.
Weiters l&auml;&szlig;t sicher der <TT>workgroup</TT>-String nicht einfach
so ver&auml;ndern, er mu&szlig; auf allen Rechnern der Gleiche sein, sonst
sind diverse Shares nur schwer zu finden. In den neueren
Windows-Generationen kann man &uuml;ber die sogenannte Netzwerkumgebung ja
auch durch verschiedene Workgroups durchwandern und so eine gewisse
Einteilung und Strukturierung erreichen. Das Konzept ist den Realms von
Envoy nicht un&auml;hnlich.<BR>

<BR>Am Einfachsten um Probleme mit rechten und Benutzern kommt man herum,
wenn man &uuml;berall <TT>valid users = guest</TT> angibt. Daf&uuml;r
mu&szlig; im <TT>[global]</TT> dann auch <TT>guest account = yes</TT>
gesetzt sein. Funktioniert so einmal alles, kann man sich immer noch um
Zugriffsrechte k&uuml;mmern.<BR>

<BR>In Zeiten, in der ein Windows nur 8.3-Filenamen beherrschte, war das
sogenannte Name-Mangling unumg&auml;nglich, wenn es um Filetransfer
zwischen unixoiden Systemen und dem PC geggangen ist. Das Thema ist ja
gl&uuml;cklicherweise mehr oder minder vom Tisch (&uuml;ber diverse
Altlasten mag ich mich jetz nicht aufregen), aber Samba kommt auch damit
klar, indem man im globalen Teil das <TT>mangled names</TT> auf
<TT>yes</TT> setzt. Damit erscheinen zu lange Dateinamen so abgek&uuml;rzt,
da&szlig; auch &auml;hnliche noch als eindeutig erkannt werden k&ouml;nnen.
Der Nachteil davon ist, da&szlig; oft nur mehr der &quot;DateiManager&quot;
vom 3.11er auf die Dateien zugreifen kann, sie aber nicht mehr direkt
geladen werden k&ouml;nnen. Dieses problem tritt aber nur eher selten auf,
allerdings habe ich einen hartn&auml;ckigen Fall, in dem ich dieses
Verhalten nicht wegbekommen kann.<BR>

<BR>Ist ein Share <TT>browseable</TT> (oder auch <TT>browsable</TT>), so
erscheint es im Windows in den Listen zum Anklicken. Der <TT>path</TT> gibt
mitunter noch R&auml;tsel auf, da er in Unix-Konvention angegeben werden
mu&szlig;. Aus einem &quot;Work:&quot; wird als ein &quot;/Work/&quot;, ein
&quot;Spool1:Docs&quot; zu &quot;Spool1/Docs/&quot;, usw.<BR>

<BR>Zum Exportieren von Druckern wird ebenfalls so eine Abteilung
eingef&uuml;gt, die mit einer in eckige Klammern gefa&szlig;ten Bezeichunng
begonnen wird. Hier sind aber die mitgelieferten Dokumentationen nur mehr
sehr d&uuml;nn ges&auml;t, deshalb hier eine Beispielkonfiguration aus
meinem (funktionierendem) Skript:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>; Epson Styus Color printer
<BR>[Stylus]
<BR>&nbsp;&nbsp;comment = Epson Stylus Color
<BR>&nbsp;&nbsp;valid users = guest
<BR>&nbsp;&nbsp;path = /T/spool/
<BR>&nbsp;&nbsp;print command = sh -c &quot;echo %T Printing %s &gt;&gt;/AmiTCP/samba/log/print.log.stylus; /sys/c/copy T:Spool/%f par: &gt;&gt;/AmiTCP/samba/log/print.log.stylus; /sys/c/delete T:Spool/%f &gt;&gt;/AmiTCP/samba/log/print.log.stylus&quot;
<BR>&nbsp;&nbsp;writable = yes
<BR>&nbsp;&nbsp;public = yes
<BR>&nbsp;&nbsp;browsable = yes
<BR>&nbsp;&nbsp;create mode = 0700
<BR>&nbsp;&nbsp;sps device = par:
<BR>&nbsp;&nbsp;sps enable = yes
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Unter dem String in den eckigen Klammern taucht dieser Drucker in den
Windows-Rechnern auf, auf denen mu&szlig; nat&uuml;rlich ein passender
Treiber installiert sein, da die Daten, die &uuml;bers Netz kommen, direkt
zum Drucker geschickt werden. Der <TT>comment</TT> erscheint auch auf der
PC-Seite als Kommentar. <TT>valid users</TT> gibt an, wer diesen Drucker
verwenden darf. In diesem Falle hier alle. Der <TT>path</TT> zeigt, wo die
Daten zwischengespeichert werden sollen. Bei <TT>print command</TT> wird es
interessant, denn das ist zust&auml;&auml;dnig daf&uuml;r, da&szlig;
&uuml;berhaupt was aus dem Drucker kommt. Samba legt nur die Daten im
angegebenen Spool-VErzeichnis ab und ruft die Zeile nach <TT>print
command</TT> auf. Was dann passiert, ist dem Samba egal.<BR>

<BR>Hat man hier die GNU-Utilities, ist man gut dran, denn ohn einer
<TT>sh</TT> geht dahier gar nichts. Ich habe das Kommando hier ein wenig
ausgebaut, um auch diverse LogFiles f&uuml;llen zu k&ouml;nnen, was nicht
unbedingt n&ouml;tig ist. Nach dem Drucken wird das File auch wieder
gel&ouml;scht.<BR>

<BR>Die letzten beiden Zeilen (<TT>sps device</TT> und <TT>sps enable</TT>)
sind f&uuml;r den SambaPM notwendig. Wird dieser eingesetzt, so mu&szlig;
das <TT>print command</TT> durch ein vorangestelltes Komma auskommentiert
werden, da ansonsten der PrintManager nicht auf die Files zugreifen kann
und einfach nichts tut.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die umgekehrte Richtung, der Import von auf PCs freigegebenen
Laufwerken, war lange Zeit nicht m&ouml;glich. Mit dem <B>SMB-Handler</B>,
derzeit v0.12 im Umlauf, ist aber genau das auch m&ouml;glich. Passt man
die Beispiel-MountIcons an die eigenen Bed&uuml;rfnisse an, was sich auf
ein Ausbessern des Rechner- und Freigabe-namens beschr&auml;nkt, so kann
man auf einmal per Doppelklick die PC-Platten am Amiga besichtigen.
Praktische Sache.<BR>

<BR>Noch praktischer wird das, wenn man Samba als netzweites System
einsetzt. PCs unter Windows k&ouml;nnen damit sowieso in beiden Richtungen
umgehen, ein Amiga ja nun auch, und da die ganze Sache aus der Unix-Welt
stammt, k&ouml;nnen &quot;die&quot; auch in einem Samba-Netz mitmischen. So
sind in &auml;u&szlig;erst freiz&uuml;giger Weise quer &uuml;ber
Systemgrenzen hinweg die Datentr&auml;ger einfach austauschbar. Irgendwer
sollte nun daf&uuml;r nur noch eine brauchbare GUI bauen, damit man Samba
auch dem nicht so erfahrendem User beibringen kann.<BR>

<BR>Derzeit aktuell ist die Version 1.9.17p4 von Samba. V2.0.0alpha ist
ebenfalls verf&uuml;gbar, aber f&uuml;r Systeme, die sicher funktionieren
sollen, wohl nicht anzuraten. Der SMB-Handler ist in Version 0.12
verf&uuml;gbar, aber so weit gediegen, da&szlig; er problemlos verwendet
werden kann. Weiters gibt es eine Samba-Mailingliste, die unter <A
HREF="mailto:rask@kampsax.dtu.dk">rask@kampsax.dtu.dk</A> erreichbar
ist.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>NFS</B></H3>&nbsp;

<BR>Ein anderes Konzept verfolgt <B>NFS</B>, das f&uuml;r <B>Network File
System</B> steht. Auch hier wird im Grunde nichts anderes gemacht, als
Devices ins Netz zu exportieren, um sie woanders wieder importieren zu
k&ouml;nnen. F&uuml;r den Amiga gibt es zwar NFS-Clients, mit denen es
m&ouml;glich ist, von UNIX-Rechnern exportierte Devices zu importieren,
aber es gibt keinen NFS-Server, der frei verf&uuml;gbar w&auml;re. Einzig
bei I-Net 225 ist einer dabei, und der kostet was.<BR>

<BR>Das Importieren hat auch wieder zum Ziel, da&szlig; schlu&szlig;endlich
ein Icon mit dem entsprechenden Device dahinter auf der Workbench
auftaucht. Dazu ist es notwendig, das File <TT>AmiTCP:db/ch_nfstab</TT>
anzupassen, damit die Devices auch gemountet werden k&ouml;nnen. Nhemen wir
mal an, auf einem NeXT w&auml;re das Root-Verzeichnis freigegeben, dann
m&uuml;&szlig;te der Eintrag im File ungef&auml;hr so aussehen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>next.rockus.at:/&nbsp;&nbsp;&nbsp;&nbsp;NeXT: USER root
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Zuerst der Rechnername, wie immer. Nach dem Doppelpunkt folgt der Pfad
zum freigegebenem Teil. <TT>NeXT:</TT> steht an der Stelle, die festlegt,
wie das importierte Device auf der Amiga-Seite hei&szlig;en soll, und zu
guter Letzt wird dem armen NeXT auch noch der root als User vorgespiegelt,
damit er bei der Freigabe nicht zum Motschgern anf&auml;ngt.<BR>

<BR>Gemountet wird dieses Device durch <TT>ch_nfsmount NeXT:</TT>. Kurze
Zeit danach sollte das entsprechende Icon am Screen erscheinen und ist im
root-Verzeichnis dieses Devices aus welchen Gr&uuml;nden auch immer ein
<TT>Disk.info</TT> zu finden, so gibt's auch andere Icons und fixierte
Positionen auf der Amiga-Seite. Mit <TT>ch_die NeXT</TT> l&auml;&szlig;t
sich das Device wieder unmounten und im Idealfall verschwindet auch das
Icon nach einiger Zeit wieder.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>netfs</B></H3>&nbsp;

<BR>St&ouml;bert man ein wenig in den Konfigurationsfiles von AmiTCP herum,
so st&ouml;&szlig;t man irgendwann auf den <TT>netfs</TT>-Eintrag in
<TT>AmiTCP:db/services</TT>, wo unter &quot;Amiga specific services&quot;
ein <TT>amiganetfs</TT> auf Port 2500 angepriesen wird.<BR>

<BR>In der <TT>inetd.conf</TT> findet man auch einen dazupassenden Eintrag,
dem man nur das vorangestellte &quot;#&quot; wegnehmen mu&szlig;, damit er
&quot;funktionsf&auml;hig&quot; wird. Selbst ein
<TT>AmiTCP:serv/netfs-server</TT> existiert. Und im
<TT>doc</TT>-Verzeichnis von AmiTCP kann man die dazugeh&ouml;rige
Anleitung finden.<BR>

<BR>Dieses Service ist zwar ausdr&uuml;cklich nicht NFS-kompatibel, aber es
lassen sich damit &uuml;ber Mountfile-Eintr&auml;ge und Shell-Befehle
zwischen Amigas verschiedene Devices mounten und gegenseitig abspenstig
machen.<BR>

<BR>Ob der nicht vorhandenen Oberfl&auml;che ist das sehr rudiement&auml;r,
aber es funktioniert und erf&uuml;llt seinen Zweck. Ein Envoy, da&szlig; ja
nun auch nicht die Welt kostet, allerdings nur f&uuml;r jeweils zwei
Rechner lizenziert ist, bringt da schon erheblich mehr Komfort und
Funktionalit&auml;t mit.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ein File, viele Amigas?</B></H3>&nbsp;

<BR>Mit diesen Konzepten und Programmen ist es nun nicht mehr n&ouml;tg,
auf jedem Rechner immer wieder alle m&ouml;glichen Files doppelt und
dreifach zu halten. Samba stellt sicher die universellste L&ouml;sung unter
den angegebenen dar, da es auch einen &Uuml;bergang zu anderen
Betriebssystemen und Plattformen erm&ouml;glicht. Die komfortabelste
Variante ist sicher Envoy und in der Unix-Welt am weitesten verbreitet
d&uuml;rfte wohl NFS sein. Angesichts dieser Einteilung sollte nun eine
Entscheidung, welches File-Verwurschtungs-Utility am besten geeignet ist,
an das Netz gelassen zu werden, nicht mehr unm&ouml;glich sein.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					<FONT COLOR="#FFFFFF">...........</FONT>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x0050.html">Teil 1: Geschichte/Grundlagen</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x0066.html">Teil 2: Adressen/Klassen</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x007A.html">Teil 3a: AmiTCP</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x007B.html">Teil 3b: I-Net 225</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x00C6.html">Teil 4: LAN</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="0x00D7.html">Teil 5: Die Exoten</A><BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.schatztruhe.de/indexd.html">Ossowski's Schatztruhe</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.schatztruhe.de/softd/envoy.html">Envoy</A> bei Schatztruhe<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.qbar.dtu.dk/~c948374/Amiga/Samba/">Samba</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.pointdesign.com/software/sambapm_d.html">SambaPM</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.gbar.dtu.dk/~c948374/Amiga/Samba/SMB-Handler0_12.lha">SMB-Handler 0.12</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.gbar.dtu.dk/~c948374/Amiga/Samba/samba-1.9.17p4.tar.gz">Samba 1.9.17p4</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00D6.html"><IMG SRC="images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00D8.html"><IMG SRC="images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
