<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>Amiga Scene - Mixer</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER><!--&nbsp;<BR>-->

					<IMG WIDTH=103 HEIGHT=197 SRC="images/_mixer_.gif" ALT="[Mixer]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="welcome.html">Welcome</A> | <A HREF="as-index.html">Index</A> | <A HREF="as-dload.html">Download</A> | <A HREF="as-redax.html">Redaktion</A> | <A HREF="as-mixer.html">Mixer</A> |<BR>
| <A HREF="as-links.html">Links</A> | <A HREF="as-serve.html">Service</A> | <A HREF="as-group.html">Usergruppen</A> | <A HREF="as-markt.html">Flohmarkt</A> | <A HREF="as-power.html">PowerUP</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<IMG WIDTH=137 HEIGHT=32 SRC="images/_austrias.gif" ALT="[Austria's]"><BR>
					<IMG WIDTH=68 HEIGHT=32 SRC="images/_first.gif" ALT="[First]"><BR>
					<IMG WIDTH=92 HEIGHT=32 SRC="images/_amigared.gif" ALT="[Amiga]"><BR>
					<IMG WIDTH=99 HEIGHT=32 SRC="images/_online.gif" ALT="[Online]"><BR>
					<IMG WIDTH=139 HEIGHT=32 SRC="images/_magazine.gif" ALT="[Magazine]"><BR>
					<IMG WIDTH=10 HEIGHT=45 SRC="images/_points.gif" ALT=" "><BR>
					<IMG WIDTH=10 HEIGHT=45 SRC="images/_points.gif" ALT=" "><BR>
					<IMG WIDTH=10 HEIGHT=45 SRC="images/_points.gif" ALT=" "><BR>
					<A HREF="http://www.amigascene.com/"><IMG WIDTH=140 HEIGHT=53 SRC="images/_url.gif" ALT="[http://www.amigascene.com]" BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>AmigaScene - Mixer</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Hier mixt die AmigaScene ein informatives Poutpourrie
bestehend aus interessanten Informationen, diversen Press Releases, News
Artikeln und anderer aktueller Dinge, die den Amiga betreffen, zusammen.
Die Texte sind mit Quellenangaben versehen, es sei denn, sie stammen von
einem unserer Mitarbeiter. Auch News, die die AmigaScene selbst betreffen,
werden hier zu finden sein. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>&quot;Ich m&ouml;chte wirklich von Herzen reden.&quot;</B></H3>&nbsp;

<BR>Jeff Schindler, 18. M&auml;rz 1998 auf der Gateway Amiga 98<BR>

<BR>Ich m&ouml;chte jedem f&uuml;r sein Kommen danken, speziell Bob und
Diana (Sharp) f&uuml;r die Organisation.Es ist ein wunderbares Ereignis und
meine erste Show in den USA. Wie Petro schon erw&auml;hnte, waren wir auf
der K&ouml;lner Messe, welches eine gro&szlig;artige Erfahrung f&uuml;r
mich war. Ich m&ouml;chte nat&uuml;rlich auch Marilyn Flint, Darreck Lisle
und Joe Torre vorstellen, alles Amiga Inc.Mitarbeiter. Und nat&uuml;rlich
Petro, welcher den weiten Weg von Deutschland hierher auf sich genommen und
immer zum Amiga gestanden hat. Eine andere Person m&ouml;chte ich noch
erw&auml;hnen, ich werde deswegen wohl &Auml;rger bekommen, aber ich
w&auml;re nicht der Mann, der ich heute bin, ohne sie, und das ist meine
Frau, Kim.<BR>

<BR>Ich hatte f&uuml;r heute eine Pr&auml;sentation und eine Rede
vorbereitet. Nun aber, nachdem ich das Wochenende mit Euch verbracht habe,
habe ich entschieden, da&szlig; ich auf keine von beiden zur&uuml;ckgreifen
m&ouml;chte. Ich m&ouml;chte heute wirklich von Herzen reden. Ich werde
offen und ehrlich sein. Alles, was ich mit euch teilen kann, werde ich
teilen und ich bin mir sicher, da&szlig; ihr hinterher viele Fragen haben
werdet.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ich m&ouml;chte ein bi&szlig;chen zu meiner Vorgeschichte
erz&auml;hlen. Ich f&uuml;hle mich geehrt, da&szlig; Ted Waitt mich
eingeladen hat, hier zu sein. Bevor ich zu Gateway kam, war ich
verantwortlich f&uuml;r die Laptop-Abteilung eines Mitbewerbers und Ted
fragte mich vor vier Jahren, &quot;wei&szlig;t du, du k&ouml;nntest uns bei
unseren tragbaren Computern helfen&quot;. Ich sagte ihm &quot;Nein, ich
m&ouml;chte mit Laptops nichts mehr zu tun haben.&quot; Darauf sagte er
&quot;Was m&ouml;chtest du denn machen?&quot;. Und ich sagte, da&szlig; ich
lediglich sehen m&ouml;chte, was die Zukunft mir noch bringt. Er sagte:
&quot;Okay,&quot;, er ist ein cooler Typ, &quot;mach, was du willst.&quot;.
Ich verbrachte einige Monate mit Forschung und entwickelte das Konzept
eines (einige von euch m&ouml;gen damit vertraut sein) PC-TVs. Das ist ein
interessantes Produkt. Es war schon mehr als nur der Versuch, diesen Markt
zu schaffen, in dem Bewu&szlig;tsein, da&szlig; die M&auml;rkte
zusammenwachsen werden. Es ist schon erstaunlich zu sehen, da&szlig; alle
unsere Hauptwettbewerber zur Zeit an sehr &auml;hnlichen Produkten
arbeiten. Es bleibt abzuwarten, wohin diese Entwicklung f&uuml;hrt.<BR>

<BR>Ich glaube fest, da&szlig; meine Vision zu diesem fr&uuml;hen
Zeitpunkt, in einer Zeit, als Gateway nicht als innovativ angesehen wurde,
f&uuml;r Ted der gute Grund f&uuml;r seine Beurteilung der Chancen des
Amiga gewesen ist. Tats&auml;chlich, w&auml;hrend meiner Arbeit an dem
Endziel, sah ich dieses Projekt starten und all dieses passieren und ich
wollte bei der n&auml;chsten Stufe dabei sein. Ich marschierte sehr
sp&auml;t abends auf der Arbeit durch die Halle und rannte in Ted Waitt und
er sagte: &quot;Komm mit, Jeff.&quot;. Ich dachte, er wollte nur plaudern.
Wir redeten also und er sagte: &quot;Ich m&ouml;chte, da&szlig; Du nur
&uuml;ber eines nachdenkst.&quot; Ich dachte, er wolle mich aufziehen, da
ich immer an viele Dinge gleichzeitig denke. Rick Snyder, der damalige
Pr&auml;sident, kam auch und grinste mich an und ich dachte, diese Jungs
wollten mich ver&auml;ppeln. So wollte ich gerade gehen, als sie sagten:
&quot;Nein, komm zur&uuml;ck, komm zur&uuml;ck!&quot;. Er schaute mich an
und sagte: &quot;Ich m&ouml;chte, da&szlig; Du &uuml;ber AMIGA
nachdenkst.&quot; Das war kurz, nachdem Gateway Amiga gekauft hatte. Ich
sagte &quot;Ernsthaft?&quot;. Er sagte: &quot;Ja, ich m&ouml;chte,
da&szlig; Du dar&uuml;ber nachdenkst. Schaus Dir an und schreib mir eine
email und sag mir, was du vom Amiga h&auml;ltst.&quot;<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Einige von euch m&ouml;gen meinen Hintergrund kennen. Als ich im
College war, arbeitete ich f&uuml;r eine Firma und &uuml;ber die Jahre kam
ich tats&auml;chlich in deren Zentrale. Das war damals, als es all die
Commodores, Ataris, TI, Activision und all die Gesellschaften gab. Es war
eine gro&szlig;e Handelskette und sie beauftragten mich tats&auml;chlich,
in all deren L&auml;den zu gehen, dort die Mitarbeiter zu trainieren und
denen dort alles &uuml;ber diese Warengruppe beizubringen. Mein Gehalt
wurde damals sozusagen durch Commodore bezahlt. Dieses war so komisch, weil
wir zuhause (ich sch&auml;me mich, das erz&auml;hlen zu m&uuml;ssen) Ataris
und Commodores hatten und, wir hatten sie alle. Meine Meinung war,
da&szlig; die VIC 20 das beste Ding war.<BR>

<BR>Ich brachte meinen VIC 20 nach Hause und verbrachte die ersten 4
Stunden mit dem Programmieren eines Mini-Programms, wobei mir der Speicher
ausging. Ich mu&szlig;te zum Laden zur&uuml;ckgehen, ging nach hinten und
grabschte mir eins von diesen dicken Modulen mit Megaram oder irgendwas mit
K oder was wei&szlig; ich. Es war dieses riesen Ding und nach nur 4 Stunden
Programmierarbeit reichte es schon nicht mehr. Ich wei&szlig; nicht, ob das
bedeutet, da&szlig; ich ein schlechter Programmierer bin, aber ich sagte
immer, als ich zur&uuml;ck ging und das College beendete, da&szlig; die
Commodores die besten dieser Maschinen waren und ich sie immer liebte.
Dieses ist sozusagen meine Vorgeschichte.<BR>

<BR>Seit ich diesen Job &uuml;bernommen habe, wurde mir vor allen Dingen
bewu&szlig;t, da&szlig; Amiga nicht nur eine
ehrfurchteinfl&ouml;&szlig;ende Technologie ist, die wirklich ihrer Zeit
weit voraus war; es ist mehr als eine Technologie, es sind die Leute. Die
Werte, die Hingabe, es sitzt im Herzen. Ich will sagen, da&szlig; wir durch
schwere Zeiten gehen, und es ist sehr schwierig f&uuml;r mich, wenn ich an
Hand von EMails und Telefongespr&auml;chen erfahre, welche Firmen den Amiga
h&auml;ngen lassen. Das tut weh.Es schmerzt so sehr, da&szlig; ich manchmal
zu meiner Frau sage: &quot;Ich wei&szlig; nicht, ob ich das noch
l&auml;nger mitmache.&quot; Ich m&ouml;chte die Leute aber nicht
h&auml;ngen lassen. Fakt ist aber, da&szlig; Gutes seine Zeit braucht. Wir
m&uuml;ssen geduldig sein. Damit habe ich sehr zu k&auml;mpfen. Ich treffe
mich mit dem Management von Gateway und sage &quot;Ich m&ouml;chte dies
machen.&quot; und sie sagen &quot;Glauben Sie, da&szlig; das der beste Plan
ist?&quot;. Vielleicht nicht, also zur&uuml;ck zum Zeichenbrett, lassen Sie
uns eine andere Idee h&ouml;ren. Seit ich angefangen habe, habe ich
mindestens 12 verschiedene Gesch&auml;ftsstrategien f&uuml;r die Zukunft
des Amiga ausgearbeitet. Diese Pl&auml;ne handeln nicht davon, &quot;Was
wir in den n&auml;chsten 6 Monaten machen werden&quot;.<BR>

<BR>Diese Pl&auml;ne handeln von &quot;Was wir 2001 oder 2002 machen
werden.&quot;.Es ist sehr frustrierend, denn ich m&ouml;chte alles in Gang
bringen und, ja, wir arbeiten an einem Update f&uuml;r das Betriebssystem.
Es gibt viele Dinge, die wir als &Uuml;bergangsl&ouml;sung tun k&ouml;nnen,
bis der Zukunftsplan fest steht, dies begeistert mich zur Zeit besonders.
Das ist eines der guten Dinge, die passierten, weil ich so oft zum
Zeichenbrett zur&uuml;ckgegangen bin und nun habe ich einen Plan. Dieser
Plan &uuml;bertraf meine Erwartungen und ich bin ganz aufgeregt deswegen.
In Bezug auf das, was Mitch sagte, ist, da&szlig; der gro&szlig;e
Wettstreiter, den wir kennen Besitzer der heutigen Standards sein kann,
aber er besitzt nicht die Zukunft.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ich bin &uuml;berzeugt, da&szlig; das, was wir als &quot;digital
connected global society&quot; (digital vernetzte globale Gesellschaft)
bezeichnen, das ist, was die Zukunft bringen wird. Dies bedeutet, basierend
auf der Akzeptanz des Internets, die Notwendigkeit der Menschen in Zukunft
vernetzt zu sein; es wird Teil unseren t&auml;glichen Lebens werden. So ist
es bereits f&uuml;r Euch, aber ich rede von den Menschen, die niemals
Computer haben wollten. Es wird Teil werden der Ausbildung.Es wird Teil
ihrer t&auml;glichen Arbeit werden. Daher ist dies eines der gro&szlig;en
Dinge, die uns antreiben werden. Die andere Sache ist die digitale
Revolution. Alles wird digital, digitale Medien.<BR>

<BR>Im Wesentlichen sind es die zwei Dinge, von denen ich &uuml;berzeugt
bin, n&auml;mlich die Notwendigkeit, vernetzt zu sein und die
Notwendigkeit, den digitalen Kram zu verstehen sowie deren
Unterhaltungswert. Den Realismus, den Digitales erzeugen kann, die
F&auml;higkeit (und ihr Jungs hab es bewiesen, mehr als andere), ihr habt
Eure Vorstellungskraft genommen und sie digital projeziert. Ich bin
erstaunt, wenn ich sehe, was NewTek geschaffen hat, wenn man einen Film
sieht und sie dann sagen, &quot;Naja, Ihr wisst, die gesamte Scene hatte
nichts mit dem Video zu tun.Es sind alles digitale Grafiken, die das
erzeugen.&quot; Stellen wir uns vor, was daraus in Zukunft werden kann. Ich
denke, diese beiden Dinge werden einen brandneuen Markt hervorrufen. Und,
was sagt uns das? Den anderen Typen geh&ouml;rt dies noch nicht.<BR>

<BR>Ich bin &uuml;berzeugt, da&szlig; sie versuchen werden, es in Besitz zu
nehmen, aber es gibt drei gundlegende Aspekte, die als &Auml;ngste,
zumindest bezogen auf die USA, die Inbesitznahme ins Stocken bringen. Man
sagt, 40% der Haushalte in den USA haben einen PC, naja und 60%
nicht.Warum? Ich bin &uuml;berzeugt, es sind die drei &Auml;ngste und das
gilt genauso f&uuml;r den Rest der Welt.Die erste Angst ist, wie viel Zeit
werde ich ben&ouml;tigen bis ich verstehe, wie ich das dumme Ding benutzen
kann. Und wenn ich es dann einsetzen kann, bringt es mir wirklich das, was
ich erwartet hatte? Sie haben Angst, ein Produkt zu kaufen, was all diese
Dinge auf dem Bildschirm hat und es ist dann so, &quot;Ich sehe hier
nichts, das mir verr&auml;t, wie ich nun eine Mail abschicken kann&quot;
oder &auml;hnliches. Ich glaube, da&szlig; es hier gro&szlig;e &Auml;ngste
gibt und wenn wir es schaffen, diese Dinge zu vereinfachen, dann werden wir
eine Br&uuml;cke hin zu dem neuen Markt bauen k&ouml;nnen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Eine andere Sache ist die Geldanlage. Wie viel Geld m&ouml;chte ich
&uuml;berhaupt f&uuml;r den Kauf eines PC investieren, wenn ich doch einen
Notzizblock benutzen kann; soll ich dieses neue Ding kaufen, wenn ich
einfach fernsehen kann; soll ich diese neue Box kaufen, wenn ich einfach
mein Telefon benutzen kann? Ich kann ein Magazin lesen, und solche Dinge.
Ich glaube, da&szlig; wenn die Preise weiterhin fallen, werden wir auch den
PC-Markt fallen sehen, aber bedingt durch dieses Betriebssystem, das so
viele Resourcen ben&ouml;tigt. Wann kommen sie endlich an den Punkt, wo sie
eigentlich hin wollten? Es wird ein hartes St&uuml;ck Arbeit f&uuml;r sie.
Ich bin &uuml;berzeugt, da&szlig; das Amiga-Betriebssystem die
Leistungsf&auml;higkeit hat, um solche Produkte darzustellen.<BR>

<BR>Die andere Sorge, die die Menschen haben, ist das Veraltern. Wenn Du
dieses heute kaufst, dann kommt n&auml;chste Woche was Neues raus und Du
wirst nicht in der Lage sein, es zu kaufen. Oder der Wert wird derart
fallen, weil bereits eine CPU angek&uuml;ndigt wurde oder was auch immer.
Ich glaube, da&szlig; wir dies mit meinem neuen Plan vermeiden k&ouml;nnen.
Dies ist eine Sache, &uuml;ber die ich nicht sprechen kann, aber es gibt
einen Weg, es doch zu tun, und dies wird heute nicht auf den typischen
Architekturen basieren, aber es kann getan werden.<BR>

<BR>Wir m&uuml;ssen unbedingt &uuml;ber Standards reden. Denn dieser Markt
wird von all diesen Firmen beobachtet, zun&auml;chst gibt es die PC-Firmen,
die Verbraucher-M&auml;rkte, Telefongesellschaften und
Fernsehgesellschaften ... Sie stecken alle in einem riesigen Aquisitions
und Kooperartions- Durcheinander, da sie nicht wissen, wer der
Anf&uuml;hrer sein wird. Es taucht immer wieder die selbe Frage auf. Wollen
sie einen Standard f&uuml;r diese neue Industrie? Ich denke, sie wollen
Standards, aber sie wollen nicht von irgendeiner Firma kontrolliert werden.
Ich denke, das ist eines der gro&szlig;en Dinge, die wir tun k&ouml;nnen.
Wir k&ouml;nnen uns unsere Konkurrenten ansehen und sagen: &quot;Was machen
die falsch und was k&ouml;nnen wir richtig machen?&quot;. Das ist der
Grund, warum ich nicht aufstehe und vom Thema ablenke, indem ich
Versprechungen mache &uuml;ber &quot;vapoware&quot; (nicht existente
Produkte), die wir in den n&auml;chsten zwei Jahren rausbringen
k&ouml;nnen. Wenn wir schon sagen, was wir tun werden, dann m&ouml;chte ich
wirklich ehrlich sein und sagen, es wird kommen, es ist wahr, das wird
passieren. Die schwierige Sache dabei ist, da&szlig; es Zeit braucht, um
diese Dinge zu entwickeln. Und es braucht Zeit, es auf den Markt zu
bringen. Was ich Euch sage, ist, da&szlig; wir immer wieder an die Talsohle
kommen werden, und wir werden dies so lange tun, bis wir endlich da raus
kommen k&ouml;nnen. So, was ich Euch auch noch sagen m&ouml;chte ist,
da&szlig; wenn Ihr andere Sachen zu tun habt, was immer Ihr tun
m&uuml;&szlig;t, um zu &uuml;berleben, verla&szlig;t niemals den Teil Eures
Herzens, der f&uuml;r Amiga schl&auml;gt.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ihr wollt sicherlich etwas &uuml;ber das Upgrade h&ouml;ren.<BR>

<BR>Wir haben wenig Personal, wir haben einige Leute, die wir unter Vertrag
genommen haben. Und Ihr habt wahrscheinlich sehr viele Ger&uuml;chte
geh&ouml;rt, da&szlig; wir mit anderen Firmen arbeiten, um das Upgrade
rauszubringen. Das ist wahr. Wir arbeiten mit verschiedenen Firmen
zusammmen, und nehmen das, was entwickelt wurde; wir nehmen die besten
St&uuml;cke und versuchen, sie zu integrieren, und wir f&uuml;gen neue
Dinge hinzu und kommen mit einer Release raus. Petro sprach vom dritten
Quartal dieses Jahres. Wir wissen nicht genau, wann wir damit rauskommen
k&ouml;nnen, aber sobald wir der Sache n&auml;her kommen, werden wir das
bekannt geben. Generell kann ich Euch erz&auml;hlen, in welchen Bereichen
wir die Priorit&auml;ten setzen. Am h&auml;rtesten arbeiten wir daran, eine
komplette Internet-L&ouml;sung zu haben. Wir w&uuml;rden gerne
Verbesserungen der Benutzeroberfl&auml;che machen. Wir m&ouml;chten mehr
Industrie-Standards unterst&uuml;tzen, so viele, wie geht in diesem
Release.<BR>

<BR>Die andere Sache, die sehr wichtig ist, ist da&szlig; wir nicht planen,
in naher Zukunft einen neuen Rechner rauszubringen, da wir eine Lizenz- und
Technologie-Firma sind. Wir sind auf der Suche nach OEMs, die die Hardware
und diese Dinge machen. Wir lizensieren diese Technologie. Was wir wirklich
von Euch allen, von den User-Groups, bis hin zu dem ICOA und den
Developer-Groups wissen m&uuml;ssen, ist, was Ihr entwickelt und was Ihr
gerne sehen w&uuml;rdet. Wir wollen diese Dinge im Betriebssystem
unterst&uuml;tzen.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Weiterhin wollen wir bessere Dokumentationen, ganz speziell f&uuml;r
die Entwickler, bieten. Es ist wichtig, da&szlig; wir einen &Uuml;berblick
&uuml;ber die neuen &Auml;nderungen haben, dennoch m&ouml;chten wir,
da&szlig; die Amiga-Gemeinde entwickelt, entwickelt und entwickelt. Wenn
jemand mit einem neuen Ger&auml;t ankommt, einem Roboter, der auf
Amiga-Technologie basiert, so w&uuml;rde ich sagen, &quot;go for it&quot;
(immer los).<BR>

<BR>Grunds&auml;tzlich arbeiten wir an diesen Dingen und da sind noch mehr.
Ich will damit sagen, da&szlig; ich mich nicht nur auf das, was wir als OS
3.5 bezeichnen, konzentriere. Ich will mich auf das konzentrieren, was wir
als &quot;expanding operating system and go to new levels&quot;
(expandierendes Betriebssystem und auf zu neuen Ufern) bezeichnen. Denn 3.5
wird lediglich der Anfang sein.Denn es wird noch mehr geben, ds wir
hinzuf&uuml;gen wollen. Deshalb, glaubt nicht, wenn 3.5 rauskommt:
&quot;Oh, das war alles, woran die Jungs gearbeitet haben.&quot;. Nein, wir
arbeiten noch an einer Menge anderer Sachen. Sie sind bis dahin nur noch
nicht fertig, um sie zu diesem Zeitpunkt zu ver&ouml;ffentlichen.
Verge&szlig;t niemals den gro&szlig;en Plan. Und ich will noch Folgendes
erz&auml;hlen. Ich sagte es diese Woche zu meinen Angestellten. Sie sollten
sich setzen und ich sagte: &quot;Jungs, habe ich Euch zu sehr
ignoriert?&quot; Und sie sagten ja. Ich sagte: &quot;Das war
Absicht.&quot;. Sie fragten warum, und ich sagte: &quot;Weil wir
herausfinden m&uuml;ssen, was die Zukunft sein wird. Das soll aber nicht
hei&szlig;en, da&szlig; wir nicht an dem aktuellen Kram weiterarbeiten,
weil wir das ebenso ben&ouml;tigen. Aber, wenn wir unsere Zukunft festigen
k&ouml;nnen, dann k&ouml;nnen wir st&auml;rker zur&uuml;ckkommen,
st&auml;rker als wir jemals waren. Daran habe ich gearbeitet.&quot; Daher
m&ouml;chte ich Euch das selbe sagen. Es tut mir jetzt leid, da&szlig; ich
Euch ignoriert habe. Das ist wahr. Ich versuche, an der Zukunft zu arbeiten
und m&ouml;chte sie verbessern, um uns damit in die Zukunft zu bringen. Es
wird bis dahin noch etwas dauern, aber wir werden es in schaffen; es wird
ein gro&szlig;es Fest werden.<BR>

<BR>Ende der Rede.<BR>

<BR>Amazing Computin/Amiga Editor`s Anmerkung:<BR>

<BR>Jeff Schindler hielt diese Rede vor mehreren hundert Amiga-Usern, die
sich in die Ausstellungshallen der St. Louis Gateway Amiga 98 Show, am
Samstag, den 14. M&auml;rz 1998 gezw&auml;ngt hatten. Vor Jeff Schindler
hatte Petro Tyschtschenko einige Probleme diskutiert, die den Erfolg von
Amiga International betreffen. (Lesen Sie diese Rede separat) und Mitch
Stone pr&auml;sentierte die Probleme einer Microsoft-Welt. ...<BR>

<BR>&Uuml;bersetzung von Anja und Hendrik, Montag/Dienstag 24.03.98...<BR>

<BR>Quelle: AIDA<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zusammenarbeit von Phase 5 und Haage &amp; Partner</B></H3>&nbsp;

<BR>In einer gemeinsamen Ank&uuml;ndigung nach der k&uuml;rzlich in London
stattgefundenen Amiga Show World of Amiga, und als Reaktion auf die von
Amiga Inc. dort enth&uuml;llten Pl&auml;ne, gaben Haage &amp; Partner und
Phase 5 digital products mit Nachdruck ihre weitere volle
Unterst&uuml;tzung f&uuml;r die Integration des PowerPC bekannt.<BR>

<BR>Mit gemeinsamen Anstrengungen werden beide H&auml;ndler weiterhin
Entwickler und User der PowerPC Technologie unterst&uuml;tzen, und eine
schnell wachsende Anzahl toller und leistungsf&auml;higer Applikationen
sichern. Mit den vielen tausend PowerUp-Boards, die bisher ausgeliefert
wurden, einer Anzahl installierter Systeme die rapide w&auml;chst, liefern
die PowerUp-Boards bereits einen attraktiven Markt f&uuml;r alle
Entwickler. Diese Tatsache wird untermauert von vielen
PowerUp-Erscheinungen gro&szlig;er Amiga Softwarepakete, die sich in der
Entwicklung befinden, und der wachsenden Unterst&uuml;tzung von
Softwareh&auml;ndlern die w&auml;hrend der WoA &uuml;bereinkamen, auch noch
nach den Ank&uuml;ndigungen von Amiga Inc.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Haage &amp; Partner und Phase 5 betonten nachdr&uuml;cklich, da&szlig;
der Wettbewerb ihrer beiden unterschiedlichen Methoden zur PowerPC
Integration, sowie auch der &ouml;ffentliche Streit dar&uuml;ber, der
Vergangenheit angeh&ouml;ren. &quot;Wir werden sicher stellen, da&szlig;
die User von PowerPC-Systemen eine transparente Integration ihrer
PowerPC-Software haben werden, und eine reiche Vielfalt von sehr
leistungsf&auml;higen Applikationen sehen, die bald herausgegeben werden
wird&quot;, sagten Repr&auml;sentanten beider Firmen.<BR>

<BR>Die weitere Entwicklung von PowerPC-System-Software soll unter enger
R&uuml;cksprache zwischen den Firmen geschehen; abgesehen davon wird die
Zusammenarbeit bei der Entwicklung von leistungsf&auml;higen Libraries
f&uuml;r PowerPC basierende Systeme und anderen OS Erweiterungen
diskutiert.<BR>

<BR>Beim Treffen der Managements von Haage &amp; Partner und Phase 5
digital products mit Amiga Inc. noch w&auml;hrend der WoA Show in London,
kam man &uuml;berein da&szlig; Amiga Inc. ein neuer Vorschlag unterbreitet
werden wird, welcher eine alternative Wahl beschreibt zum &quot;Amiga
Bridge&quot;-System, das von Amiga Inc. geplant ist.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Diese Alternative ist ein neues PowerPC basierendes System, das das
geplante Amiga OS Upgrade aufzeigen wird, und bereits Ende des Jahres im
Einzelhandel zum Verkauf angeboten werden kann. &Uuml;ber die Einbindung
von Standard Industrie- Komponenten und Schnittstellen kann ein solchen
System zus&auml;tzliche Optionen bieten, die kreative Entwicklung und
Erweiterung mit dem Zauber des Amiga erlauben, und es k&ouml;nnen sogar das
aktuelle und die n&auml;chsten Ver&ouml;ffentlichungen des Amiga OS darauf
laufen.<BR>

<BR>Basierend auf dem PowerPC wird dieses System auch Kontinuit&auml;t und
Innovation f&uuml;r alle User und Entwickler bieten, und der Amiga-Gemeinde
erlauben, an solch tollen Entwicklungen wie Motorolas neuer AltiVec
Technologie teilzuhaben, einer Erweiterung des G4 PowerPC Prozessors, der
schon zu Beginn n&auml;chsten Jahres eine atemberaubende Leistung zur
Verf&uuml;gung stellen wird. Mit Anerkennung und Unterst&uuml;tzung von
Amiga Inc. kann diese Technologie schon dieses Jahr die lang erwartete
Wiederkehr der Amiga-Plattform vorstellen, und k&ouml;nnte schnell einen
wachsenden Markt von leistungsf&auml;higen Systemen bereitstellen, die die
User kaufen und f&uuml;r die die Entwickler entwickeln und ihre Software
und Add-ons verkaufen k&ouml;nnen.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Haage &amp; Partner und Phase 5 digital products ermutigen auch alle
Amiga- Entwickler, die heute an einer existierenden Innovation teilnehmen
m&ouml;chten, und die Teil eines Amiga-Marktes sein m&ouml;chten, der
Wachstum, Kontinuit&auml;t und Innovation von jetzt und w&auml;hrend der
n&auml;chsten Jahre bietet, dies jetzt zu sagen und sich selbst der
Unterst&uuml;tzung des PowerPC als Herz der n&auml;chsten Generation von
Amiga-Systemen zu verpflichten.<BR>

<BR>F&uuml;r weitere Informationen sehen Sie:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=MIDDLE ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.haage-partner.com/">Haage &amp; Partner</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="images/_ball.gif" ALT="-"> <A HREF="http://www.phase5.de/">Phase 5</A><BR>
</TD></TR></TABLE>&nbsp;

<BR>&Uuml;bersetzer dieses Artikels: Martina Jacobs 07.05.1998<BR>

<BR>Quelle: AIDA<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
<!--E_MAIL-->
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">....</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT> &nbsp;
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
