<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
						<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>S a k u - p i k k u j o u l u t &nbsp; 1 9 9 9</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
						<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teemu Pohjanlehto &lt;<a href="mailto:rebb@amigascne.org">rebb@amigascne.org</a>&gt;</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Amiga-henkiset pikkujoulut j&auml;rjestettiin 11.12. Espoossa taloyhti&ouml;n kerhotiloissa, jotka ovat varmaan monelle Saku-aktiiville tutut. P&auml;&auml;sin saapumaan pelipaikalle tuttuun tapaani pari tuntia my&ouml;h&auml;ss&auml;, kun myin A1200:ni pois ennen tilaisuutta. Saavuimme siis paikalle joskus klo 18 j&auml;lkeen harhailtuamme ensin paremman puoliskoni kanssa ymp&auml;ri Espoota. (Vinkki kaikille ensikertalaisille: karttaa kannattaa pit&auml;&auml; oikein p&auml;in...) Paikalle ei odotusteni mukaisesti ollut saapunut mit&auml;&auml;n tajutonta m&auml;&auml;r&auml; porukkaa, kuten esim. Saku 99 -tapahtumaan. T&auml;m&auml; saikin aikaan Janne Sir&eacute;ni&auml; lainatakseni "rennon tunnelman".<br>
					<br>
					<center><img src="kuvat/pikkujoulut_4.jpg" width="400" height="263" alt="Pikkujoulut"></center><br>
					Paikalle oli saapunut tuttuja naamoja Saku-tapahtumista ja tietenkin Gentle Eyen Boogie. Koko tapahtuma oli mukavan lupsakka, vihdoinkin p&auml;&auml;sin kokeilemaan rauhassa OS 3.5:ta ja vakuuttumaan sen erinomaisuudesta. My&ouml;s Boogiella oli aikaa turista mukavia ja antaa arvokasta tietoa tuoreelle ja ylpe&auml;lle A3000:n omistajalle. Kuten kaikki varmasti tiet&auml;v&auml;t, Boogie tapansa mukaan kertoili ihmisille tarinoita mm. tamperelaisista torikauppiaista.<br>
					<br>
					<center><img src="kuvat/pikkujoulut_5.jpg" width="400" height="263" alt="Pikkujoulut"></center><br>
					Paikalla oli tarjolla virvokkeita, ja videoita py&ouml;ritettiin erillisess&auml; huoneessa. Lahjojen vaihdon missasin (kiitos navigointikykyjeni), mutta tuoreen modeemin omistajan ilmeet olivat n&auml;kemisen arvoisia. Tulipa vihdoinkin my&ouml;s ostettua Saku-CD 2, joka ei hinnallaan p&auml;&auml;t&auml; huimannut (40 mk). Rompun parissa kuluikin kyseinen ilta aamunelj&auml;&auml;n asti. 40 markkaa on pieni hinta hy&ouml;dyllisest&auml; tiedosta ja viihteest&auml; sek&auml; harvinaisista Amiga-mainosvideoista. Kyll&auml; se on pieni raha siit&auml; ett&auml; on onnellinen, vai mit&auml;?<br>
					<br>
					Haluan t&auml;ss&auml; osoittaa l&auml;mpim&auml;t kiitokset tapahtuman j&auml;rjest&auml;jille, Timo Kemppaalalle, Janne Pikkaraiselle, Janne Sir&eacute;nille ja Tomi Jaskarille, sek&auml; muille tapahtumaan tai sen j&auml;rjest&auml;miseen osallistuneille. Juuri t&auml;llaista oma-aloitteisuutta nykyinen Amiga-kanta ja Saku kaipaa. Liian harvat ihmiset ovat valmiita ottamaan vastuuta ja tekem&auml;&auml;n palkatonta ty&ouml;t&auml;. Kuten Janne Sir&eacute;n on sanonut, kiitosta kuulee kovin harvoin. Ihmiset nurisivat heti Saku 99:n j&auml;lkeen valokuvista, jotka mielest&auml;ni saapuivat ihmisten saataville enn&auml;tysajassa. Toivottavasti uusi hallitus jaksaa vastedeskin ty&ouml;skennell&auml; hyv&auml;n asian eteen.<br>
					<br>
					Me kaikki Amiga-k&auml;ytt&auml;j&auml;t voisimme helpottaa Saku-aktiivien ty&ouml;taakkaa tekem&auml;ll&auml; my&ouml;s itse jotain yhdistyksen ja lehden eteen. Tarjoudunkin nyt itse (kylm&auml; hiki otsassa) ottamaan jonkin asian organisaatiossa harteilleni, jos ja kun tarvetta ilmenee. Viel&auml; asuessani p&auml;&auml;kaupunkiseudulla (ainakin ensi kes&auml;kuuhun) voisin olla mukana j&auml;rjest&auml;m&auml;ss&auml; esim. mahdollista Saku 2000 tapahtumaa ja esitell&auml; omaa konettani (niin peruskone kuin onkin) joissain yhdistyksen tilaisuuksissa.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

