<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen&nbsp;Amiga-k&auml;ytt&auml;j&auml;t&nbsp;ry:n&nbsp;pikkujoulut&nbsp;1999</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. j&auml;rjesti pienimuotoisen pikkujoulukerhoillan Espoon keskuksen kupeessa lauantaina 11. joulukuuta. Taloyhti&ouml;n kerhotila valjastettiin palvelemaan tilaisuutta videohuoneella ja pienell&auml; tapahtumasalilla. Ilta kului mukavia jutustellessa, ja paikalla vieraili yhteens&auml; vajaa kolmekymment&auml; henkil&ouml;&auml;.<br>
					<br>
					<center><img src="kuvat/pikkujoulut_3.jpg" width="300" height="322" alt="Pikkujoulut"></center><br>
					Tilaisuuden Amiga-aiheisen ohjelman n&auml;ytt&auml;vin osuus oli Gentle Eye Ky:n myyntip&ouml;yt&auml;, jossa tutut Amiga-tuotepinot houkuttelivat k&auml;vij&ouml;iden joululahjamielt&auml;. Myynniss&auml; olivat mm. AmigaOS 3.5, Amiga Developer CD 2.1 ja Wipeout 2097. Olimme j&auml;rjest&auml;neet paikalle my&ouml;s perus-Amiga-laitteiston, jolla AmigaOS 3.5 -p&auml;ivityst&auml; p&auml;&auml;si kokeilemaan.<br>
					<br>
					<center><img src="kuvat/pikkujoulut_2.jpg" width="300" height="322" alt="Pikkujoulut"></center><br>
					Videohuoneessamme py&ouml;ri koko tilaisuuden ajan Amiga-aiheisia videoita. N&auml;ytill&auml; olivat Manu P&auml;rssisen Saku 98 -videointi, Oliver Kruusin Saku 99 -nauha, Janne Pikkaraisen, Tony Meesin ja Janne Sir&eacute;nin World of Amiga '99 -p&auml;tk&auml; Annexin musiikkiesiintymisineen, Amigan World of Amiga '99:ss&auml; esitt&auml;m&auml; musiikkivideo (se Transmeta-v&auml;l&auml;ys), AmigaOS 3.5 -promovideo, jossa mm. Petro esittelee Walkeria ja pelaa Super Stardustia, sek&auml; Commodoren konkurssista kertova dokumenttifilmi Deathbed Vigil.<br>
					<br>
					<center><img src="kuvat/pikkujoulut_1.jpg" width="400" height="263" alt="Pikkujoulut"></center><br>
					Tapahtumasalissa oli yhdistyksen tarjoamia virvokkeita: kahvia, limsaa, karkkia, keksej&auml;. Viime vuoden pikkujouluista tuttu lahjanvaihto oli my&ouml;s mukana, ja Saku-rompun kakkospainos oli j&auml;lleen kaupan. Valitettavasti suunniteltu web-kamera ja IRC-yhteys j&auml;iv&auml;t toteutumatta kerhotilan nettiletkun toimimattomuuden vuoksi.<br>
					<br>
					Juttelimme my&ouml;s yhdistyksen tulevista projekteista, kuten kiinteiden toimitilojen eduista - t&auml;llainen pikkujoulutapahtumakin olisi ollut paljon helpompi j&auml;rjest&auml;&auml;, jos ei olisi tarvinnut raivata ja siivota taloyhti&ouml;n tiloista sopivia. Harmi vain, ettei omien tilojen hankintaan tai yll&auml;pitoon taida olla mit&auml;&auml;n mahdollisuuksia.<br>
					<br>
					Pikkujouluj&auml;rjestelyist&auml; vastasivat (aakkosj&auml;rjestyksess&auml;) Tomi Jaskari, Timo Kemppaala, Janne Pikkarainen ja Janne Sir&eacute;n. Kiitos my&ouml;s Gentle Eye Ky:lle heid&auml;n osanotostaan.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

