<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga ja vuosi 2000 - "Vaihtoehtoinen tapa viett&auml;&auml; uutta vuotta"</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen</font>
				</td></tr>
			</table>
			</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Oli tullut taasen vuoden viimeinen p&auml;iv&auml;. T&auml;ll&auml; kertaa erikoista oli se, ett&auml; kyseess&auml; oli vuosituhannen viimeinen p&auml;iv&auml;. T&auml;m&auml;n huomasikin jo aamulla, esimerkiksi televisiosta tuli aamup&auml;iv&auml;st&auml; asti uudenvuoden viettoa ymp&auml;ri maailmaa suorana l&auml;hetyksen&auml;. Uusivuosi tulisi selv&auml;sti olemaan erilainen kuin aiemmin. Toisaalta; jos el&auml;m&auml;st&auml;&auml;n oikein etsim&auml;ll&auml; etsii jotain onnea, niin lieneeh&auml;n se tuuria, ett&auml; n&auml;kee vuosituhannen vaihtumisen - se mahdollisuus kun sattuu vain harvoille sukupolville.<br>
					<br>
					N&auml;in j&auml;lkeenp&auml;in ajatellen uusivuosi ei oikeastaan ollut juurikaan kummempi kuin aikaisemmin. Se ero oli, ett&auml; nyt ensi kertaa ostin ja ammuin raketteja, ehk&auml; siksi ett&auml; t&auml;n&auml; vuonna oli varaa t&ouml;rs&auml;t&auml; niihin. Tai no, oikeastaan ei olisi ollut, sill&auml; budjetti heittikin tonnilla, mutta sain tiet&auml;&auml; siit&auml; vasta arjen tultua kun pankista tuli kirje...
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ylimainostettu millennium</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Koko loppuvuoden 1999 ovat asioita ymm&auml;rt&auml;m&auml;tt&ouml;m&auml;t toimittajat suoltaneet joka paikasta tuutin t&auml;ydelt&auml; millennium-kauhukuvia. Kaikki lakkaisi toimimasta: tietokoneet menev&auml;t sekaisin, s&auml;hk&ouml;njakelu lakkaa, lentokoneet putoavat, elektroniset laitteet eiv&auml;t en&auml;&auml; toimisi, auto saattaisi lakata toimimasta. Jossakin lehdess&auml; kehotettiin jopa ostamaan joditabletteja, koska it&auml;rajan takana voi ydinvoimala posahtaa!<br>
					<br>
					T&auml;m&auml; vouhotus alkoi jo vuosia sitten. Entisess&auml; ty&ouml;paikassani muistan jo vuodelta 1997 tilanteen, kun paikallislehden toimittaja soitti ja alkoi kysell&auml; siit&auml;, mit&auml; tapahtuisi tietokoneille vuosituhannen vaihtuessa. H&auml;n oli jostain saanut vihi&auml;, ett&auml; elektroniset laitteet eiv&auml;t en&auml;&auml; toimi vuonna 2000. Jutellessamme siin&auml; tovin havaitsin, ettei toimittajaparka paljon asioita ymm&auml;rt&auml;nyt. H&auml;n kysyi jopa, meneek&ouml; kelloradio sekaisin kun siin&auml; on kello! No, onhan toki kelloradiossa kello, mutta kun sen maailmankaikkeus rajoittuu enint&auml;&auml;n 24 tuntiin... :) Puhelimessa antamani vastaukset olivat sitten seuraavan p&auml;iv&auml;n lehdess&auml; sopivasti filtter&ouml;ityn&auml; ja invertoituna tuttuun lehtimiestyyliin.<br>
					<br>
					Aikaa kului, ja satuin kerran seikkailemaan er&auml;&auml;n suuren laitevalmistajan kotisivuilla. Vasta t&auml;ss&auml; vaiheessa tajusin, millaista Y2K-vouhotus voi huipussaan olla. Ilmeisesti Y2K-vouhotuksella aivopestyt asiakkaat olivat kyselleet paljonkin laitteista, sill&auml; valmistaja ilmoitti kaikista tuotteistaan - ei ainoastaan sellaisista joissa on kello - niiden vuosi 2000 -yhteensopivuuden! Hymyss&auml; suin siin&auml; sitten lueskelin listaa, jossa vakuutettiin mm. h&ouml;yrysilitysrautojen, partakoneen, hiustenkuivaajan, hieromakoneen tai s&auml;hk&ouml;vatkaimen toimivan vuonna 2000. Jokainen malli oli listattuna tyyppinumeron ja valmistusvuoden kera erikseen. Siin&auml; sit&auml; on insin&ouml;&ouml;reill&auml; riemua riitt&auml;nytkin hieromakoneiden ja s&auml;hk&ouml;vatkaimien Y2K-testaamisessa...<br>
					<br>
					Kun uusi vuosituhannen vaihde sitten koitti, oli pettymys suuri. S&auml;hk&ouml;t eiv&auml;t katkenneet (hyv&auml; UPSin testaustilaisuus meni sivu suun), ydinvoimaloita ei posahdellut eik&auml; muitakaan suuronnettomuuksia sattunut. S&auml;hk&ouml;vatkain toimii yh&auml;, sill&auml; vatkattiin t&auml;n&auml;&auml;nkin kermavaahtoa. My&ouml;s kerma toimii, se vatkaantui vaahdoksi ihan normaalisti. Pannukakkukin onnistui, uuni toimii sekin viel&auml;, vaikka se on todella vanha eik&auml; sen periaatteessa en&auml;&auml; pit&auml;isi toimia. Niinh&auml;n televisiossakin sanottiin, ett&auml; vanhat laitteet eiv&auml;t ehk&auml; toimi. Televisio toimii, satelliittikanavat toimivat, videoitakin voi katsella - nauhoituskin onnistuu, kasetit suostuvat ottamaan nauhoituksen vastaan! Eik&auml; s&auml;hk&ouml;t ole viel&auml;k&auml;&auml;n katkenneet. Kaikki el&auml;m&auml;n perustarpeet ovat siis kunnossa! Selv&auml;sti ylimainostettu mediatempaus koko millennium!
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Testej&auml; jo syksyll&auml;</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					P&auml;&auml;tin jo syksyll&auml; valmistautua mahdollisiin ongelmiin tutkimalla hieman asioita. Asetin t&auml;m&auml;n boksikoneenakin toimivan Amiga 3000T:n kellon johonkin vuoden 2000 p&auml;iv&auml;&auml;n, boottasin koneen ja j&auml;rjestelm&auml;t yl&ouml;s ja aloin testailla. Ensimm&auml;isen&auml; heti bootissa ilmeni, ett&auml; tuolloinen scsi.devicen patch, jonka joskus Amigan sivuilta hain, ei en&auml;&auml; toiminut. Se heitti alertia ruutuun, betaversio kuulemma. Kyseess&auml; ei ollut varsinainen Y2K-ongelma, koska patch vanheni jo marraskuussa. Poistin patchin ja jatkoin testej&auml;. Kokeilin my&ouml;s boksin perustoiminnot pikaisesti l&auml;pi. Isompia ongelmia ei l&ouml;ytynyt eik&auml; patchin poiston lis&auml;ksi muita toimenpiteit&auml; tarvittu. Amigan Y2K-yhteensopivuus n&auml;ytti olevan hanskassa.<br>
					<br>
					Sakunet hieman mietitytti, sen testaaminen olisi ollut hankalaa, koska bokseja on ymp&auml;ri Suomea ja niiden kaikkien kello pit&auml;isi s&auml;&auml;t&auml;&auml; yht&auml;aikaisesti johonkin 2000-luvulle, kirjoitella viestej&auml; ja suorittaa testipollauksia. Aivan liian vaivalloista. N&auml;in ollen p&auml;&auml;tin, ett&auml; antaapa menn&auml; silt&auml;n&auml;&auml;n, katsotaan sitten mit&auml; tuleman pit&auml;&auml; ja kuinka Y2K-yhteensopiva boksisofta kell&auml;kin on.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Uusivuosi koittaa</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Vuosituhannen viimeisen&auml; iltap&auml;iv&auml;n&auml; ajattelin huvikseni testailla my&ouml;s toisen, videok&auml;yt&ouml;ss&auml; olevan Amiga 3000:n Y2K-yhteensopivuutta. Asetin kellon t&auml;ll&auml; kertaa vain vuorokautta edelle, arvoon 1.1.2000. K&auml;ynnistin Scalan, ja se toimi moitteetta. P&auml;&auml;tinkin jo saman tien korjailla muutamia juttuja, esimerkiksi videokasettien alkuun tulevassa testikuvassa olevan p&auml;iv&auml;m&auml;&auml;r&auml;n vuosiluvun, koska tiesin ettei en&auml;&auml; tarvitsisi nauhoittaa testikuvaa millek&auml;&auml;n kasetille vuonna 1999.<br>
					<br>
					Sen j&auml;lkeen k&auml;ynnistin videokasettirekisterin, jonka olen itse tehnyt Basicilla joskus 90-luvun alkupuolella. Ohjelma k&auml;ynnistyi normaalisti, mutta p&auml;&auml;n&auml;yt&ouml;ss&auml; seisoi p&auml;iv&auml;m&auml;&auml;r&auml;n kohdalla komeasti "1.1.1910". Ensimm&auml;inen Y2K-ongelma oli l&ouml;ytynyt!
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Videorekisteri ja AC-Basic compiler</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Koska tuo jo vuosia k&auml;yt&ouml;ss&auml;ni ollut videokasettirekisteri oli varsin laaja sovellus (l&auml;hdekoodi l&auml;hes 3000 Basic-rivi&auml;), ei sit&auml; voinut ajaa laisinkaan varsinaisen AmigaBasicin alla (resurssit eiv&auml;t riit&auml;). Lis&auml;ksi tuo Microsoftin k&ouml;t&ouml;stys ei edes toimi esimerkiksi KS 3.0 -koneessa. Siksip&auml; olinkin kehitellyt koko ohjelman sellaiseksi, ett&auml; se voidaan k&auml;&auml;nt&auml;&auml; ajettavaksi tiedostoksi AC-Basic compilerilla. T&auml;m&auml; k&auml;&auml;nt&auml;j&auml; on AmigaBasic-yhteensopiva, mutta tarjoaa reilummat resurssit mm. muistin k&auml;yt&ouml;lle ja ohjelman koolle. Tietokonepohjainen videokasettirekisteri on tottakai v&auml;ltt&auml;m&auml;t&ouml;n, kun kasetteja on t&auml;ll&auml;kin hetkell&auml; noin 350. Ohjelman olisi siis ehdottomasti toimittava my&ouml;s jatkossa, koska korvaavaa ohjelmaa vastaavilla herkuilla ei ole tullut vastaan.<br>
					<br>
					Tutkittuani ongelmaa tarkemmin havaitsin, ett&auml; itse rekisteri on Y2K-yhteensopiva. Elokuvia pystyi sy&ouml;tt&auml;m&auml;&auml;n normaalisti, vaikka nauhoitusp&auml;iv&auml;m&auml;&auml;r&auml;ksi kirjasikin esim. 01.01.00. T&auml;m&auml; tallentui rekisteriin normaalisti. Tietojen katselu onnistui my&ouml;s normaalisti, samoin ryhmittely p&auml;iv&auml;m&auml;&auml;rien mukaan. Ainoastaan p&auml;&auml;n&auml;yt&ouml;n vuosi oli pieless&auml;, sek&auml; tietoja sy&ouml;tett&auml;ess&auml; rekisterin p&auml;iv&auml;m&auml;&auml;r&auml;kentt&auml;&auml;n oletuksena tarjoama menossa oleva p&auml;iv&auml; n&auml;ytti arvoa 01.01.10.<br>
					<br>
					Sin&auml;ns&auml; t&auml;st&auml; ei olisi mit&auml;&auml;n haittaa, koska rekisterin tarjoaman p&auml;iv&auml;m&auml;&auml;r&auml;n voi kuitata sellaisenaan ainoastaan silloin, kun rekister&ouml;i elokuvan nauhoitusp&auml;iv&auml;n&auml;. Ehk&auml;p&auml; t&auml;m&auml; olikin yleist&auml; joskus vuosia sitten, mutta nykyinen tilanne on se, ett&auml; kirjoittelen tiedot paperilapulle ja laitan lapun kasetin koteloon. Kun kasetti on sitten my&ouml;hemmin nauhoitettu t&auml;yteen, se menee nauhoitettujen kasaan. Kun tuo kasa sitten kasvaa niin isoksi, ett&auml; hyllyst&auml; loppuu tila, ker&auml;&auml;n lappuset kasettien v&auml;list&auml; ja rekister&ouml;in elokuvat. Nauhoitusp&auml;iv&auml;m&auml;&auml;r&auml; on siis kaikkea muuta kuin rekisterin tarjoama!<br>
					<br>
					Vaikka homma olisi toiminutkin, kaivoin ajankuluksi l&auml;hdekoodin esille ja havaitsin, ett&auml; vuosiluku tulee sellaisenaan Basicin DATE$-funktiosta. Vika t&auml;ytyi siis olla Basicissa. Sen vuosiluku hypp&auml;si arvoon 19100, mutta koska vuosi voi olla vain 4 merkki&auml; pitk&auml;, tuli funktiosta ulos arvo 1910. T&auml;m&auml; tarkoittaa samalla my&ouml;s sit&auml;, ett&auml; vuosi pysyy seuraavat 10 vuotta arvossa 1910. N&auml;in ollen vuositieto on k&auml;ytt&ouml;kelvoton.<br>
					<br>
					Nopein korjaus ongelmaan olisi muuttaa l&auml;hdekoodi sellaiseksi, ettei se en&auml;&auml; k&auml;yt&auml; Basicin DATE$-funktion vuositietoa. Vuositieto ladattaisiin asetustiedostosta, jonne sen voisi sitten aina kerran vuodessa vaihtaa tekstieditorilla. Onneksi l&auml;hdekoodi oli siin&auml; m&auml;&auml;rin selke&auml;, ettei muutosten tekoon mennyt viitt&auml; minuuttia kauempaa. Ainoastaan asetusten lataus- ja tallennusaliohjelmiin tuli yksi ladattava/tallennettava asia lis&auml;&auml; ja sitten p&auml;iv&auml;m&auml;&auml;ri&auml; k&auml;sittelev&auml;&auml;n aliohjelmaan pikku muutos. T&auml;m&auml;n j&auml;lkeen piti en&auml;&auml; k&auml;&auml;nt&auml;&auml; ohjelma ajettavaksi.<br>
					<br>
					K&auml;&auml;nt&auml;minen olikin sitten helpommin sanottu kuin tehty. AC-Basic compiler ei nimitt&auml;in py&ouml;ri 68030-pohjaisessa Amigassa, vaan jumiutuu kesken k&auml;&auml;nn&ouml;ksen. K&auml;&auml;nt&auml;j&auml;ll&auml; k&auml;&auml;nnetyt ohjelmat kuitenkin toimivat normaalisti. Kumpikin A3000 on 68030-pohjainen. Mutta ei h&auml;t&auml;&auml; - ongelmaan oli olemassa ratkaisu, jota olin jo aiemminkin k&auml;ytt&auml;nyt. Noin puolen tunnin kaivamisella l&ouml;ysin diskettikaapista disketin, jossa oli AC-Basic compiler ja startup-sequence, joka suorittaa "Source"-nimiselle l&auml;hdekoodille k&auml;&auml;nn&ouml;ksen automaattisesti, ilman ett&auml; n&auml;ytt&ouml;&auml; tai n&auml;pp&auml;imist&ouml;&auml; tarvitaan.<br>
					<br>
					Koneeksi k&auml;&auml;nn&ouml;shommaan oli toisessa kaapissa Commodoren CDTV, tavallisen CD-soittimen n&auml;k&ouml;inen vekotin, joka pit&auml;&auml; sis&auml;ll&auml;&auml;n Amiga 500 -yhteensopivan tietokoneen 68000-prosessorilla. Ei muuta kuin ulkoinen korppuasema paikoilleen (CDTV:ss&auml; ei ole lainkaan omaa korppuasemaa), l&auml;hdekoodilla varustettu korppu sis&auml;&auml;n, verkkojohto kiinni ja pian CDTV jo suoritti k&auml;&auml;nn&ouml;st&auml;, ja homman etenemist&auml; saattoi seurata korppuaseman LEDist&auml;. Kun se viimein sammui, oli k&auml;&auml;nn&ouml;s tehty. N&auml;ppist&auml; ja n&auml;ytt&ouml;&auml; ei siis tarvittu!<br>
					<br>
					K&auml;&auml;nnetty ohjelma sitten vain videokoneelle ja testaamaan... Muuten hyv&auml;, mutta ei toiminut. Kaatui heti alussa virheilmoitukseen. Koska minulla ei en&auml;&auml; ollut miss&auml;&auml;n listaa AC-Basic compilerin virheilmoituksista, oli tuo numeerinen virheilmoitus varsinainen mysteeri. T&auml;st&auml; seurasikin muutaman tunnin rupeama, jonka aikana muuttelin l&auml;hdekoodia, k&auml;&auml;nsin ja testasin useita kertoja. My&ouml;s CDTV siirtyi eri paikkaan, niin ett&auml; sen per&auml;&auml;n saattoi kytke&auml; n&auml;yt&ouml;n. Kaivoin my&ouml;s esille avonaisen "hakkerimallin" A500-n&auml;ppiksen, johon oli juoteltu kaapeli kiinni siten ett&auml; sen pystyi liitt&auml;m&auml;&auml;n CDTV:n per&auml;&auml;n, ja n&auml;in CDTV sai my&ouml;s n&auml;ppiksen. K&auml;&auml;nt&auml;j&auml;n asetukset piti ainakin k&auml;yd&auml; l&auml;pi pariin kertaan, mutta ei ollut vikaa niiss&auml;k&auml;&auml;n. T&auml;ss&auml; vaiheessa p&auml;&auml;tin l&auml;hte&auml; ulos ampumaan osan raketeista, niit&auml; pieni&auml;, joita ostamassani paketissa tuli mukana.<br>
					<br>
					Tultuani ulkoa ajattelin jatkaa hommia, koska ulkona sain idean, josta koko ongelma voisi johtua. Muistin, ett&auml; olin jossakin v&auml;liss&auml; yritt&auml;nyt saada videorekisteri&auml; toimimaan paremmassa n&auml;ytt&ouml;tilassa (Picasson 24-bittinen Workbench) kuin mihin se alunperin oli tehty (lomittamaton PAL). Siin&auml; kuitenkaan onnistumatta olin luopunut toivosta ja j&auml;tt&auml;nyt homman sikseen. Etsiskelin aikani my&ouml;s jonkinlaista "promotoria", jolla ohjelman olisi voinut komentaa esim. omalle ruudulleen, mutta en l&ouml;yt&auml;nyt toimivaa.<br>
					<br>
					N&auml;in ollen ratkaisu olikin siirt&auml;&auml; videorekisteri kokonaan toiselle koneelle, eli tuolle videokoneelle. Siin&auml; sen ajaminen ei ole ongelma, koska tuon koneen Workbench on PAL-tilassa. Olin kuitenkin noiden testien aikana tehnyt muutoksia l&auml;hdekoodiin, nimenomaan sellaisia, joissa yritettiin avata uutta ruutua, kuitenkaan onnistumatta siin&auml;. Nuo muutokset olisivat mit&auml; ilmeisimmin yh&auml; mukana l&auml;hdekoodissa, ja t&auml;t&auml; en heti alussa muistanut!
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Monitorin Y2K-yhteensopivuus koetuksella</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Eip&auml; siis muuta kuin pienell&auml; penkomisella esiin paperilla oleva l&auml;hdekoodi vuosikymmenen alkupuolelta - ja vertaamaan. T&auml;m&auml; homma kuitenkin tyss&auml;si kuin sein&auml;&auml;n, sill&auml; k&auml;ynnistetty&auml;ni A3000T:n monitorin kuului sen sis&auml;lt&auml; melkoinen pamaus. Ajattelin, ett&auml; nyt se sitten tuli tiens&auml; p&auml;&auml;h&auml;n. T&auml;m&auml;n monitorin tarinahan on sellainen, ett&auml; sain sen ilmaiseksi vanhalta ty&ouml;maalta ja se oli tuolloin rikki. Korjasin sen sitten ja n&auml;in sain silloisen p&ouml;yt&auml;mallisen A3000:n flickerfixerin per&auml;&auml;n SVGA-n&auml;yt&ouml;n.<br>
					<br>
					Vuosien varrella t&auml;m&auml; on sitten alkanut reistata enemm&auml;n ja v&auml;hemm&auml;n, yleisin vika on l&auml;hinn&auml; ollut l&ouml;ystynyt kuvaputken kanta. Kantaa ja sen varassa olevaa suurta piirilevy&auml; piti alun perin paikoillaan muovipanta, joka oli kuvaputken kaulan ymp&auml;rill&auml;, mutta muistan yh&auml; sen pamauksen, kun tuo panta r&auml;s&auml;hti poikki vanhuuttaan, ja t&auml;st&auml; ongelmat sitten alkoivat. Ja niin my&ouml;s nyt oli kuvassa ollut h&auml;iri&ouml;it&auml; v&auml;reiss&auml; jo monta kuukautta. En kuitenkaan jaksanut korjata vikaa, koska olin korjannut sen jo 5-6 kertaa, aina muutaman kuukauden toimii ja sitten se alkaa taas. Aivotkin olivat jo kuitenkin tottuneet siihen, ett&auml; kuvan koko vapisee ja harmaa Workbench n&auml;ytt&auml;&auml; v&auml;lill&auml; violetilta, v&auml;lill&auml; vihre&auml;lt&auml; ja siin&auml; vilisee vaakaraitoja em. v&auml;ris&auml;vyjen v&auml;lilt&auml;. Kyl&auml;ss&auml; k&auml;yneet vieraat aina jaksoivat kummastella h&auml;iri&ouml;it&auml; monitorissa, johon min&auml; totesin etten edes huomaa niit&auml; en&auml;&auml;...<br>
					<br>
					Ei sitten auttanut muukaan kuin purkaa n&auml;ytt&ouml; ja alkaa tutkia, mist&auml; pamaus oikein kuului. Yll&auml;tyksekseni en l&ouml;yt&auml;nyt mit&auml;&auml;n r&auml;j&auml;ht&auml;nytt&auml; komponenttia, joten p&auml;&auml;tin laittaa vekottimen takaisin kasaan ja testata, her&auml;isik&ouml; se viel&auml; henkiin. Kasattuani ja asennettuani sen paikoilleen painoin virtakytkint&auml; samalla sopivasti maastoutuen - jos vaikka p&auml;&auml;tt&auml;&auml; tulla silmille koko v&auml;rkki. Mit&auml;&auml;n ei kuitenkaan tapahtunut, ei inahdustakaan. Laitoin virran pois ja kokeilin hetken kuluttua uudelleen. Ei viel&auml;k&auml;&auml;n mit&auml;&auml;n.<br>
					<br>
					J&auml;tin virran p&auml;&auml;lle ja tarjosin kulmaan hieman nyrkki&auml;, jolloin virtavalo syttyi ja monitori her&auml;si henkiin kuten aina ennenkin! Jee - se toimii sittenkin! Ja kuvassa ollut v&auml;rih&auml;iri&ouml;kin oli poissa! Eip&auml; ollut turha korjaus t&auml;ll&auml;k&auml;&auml;n kertaa. Ilmeisesti vika on j&auml;lleen kuvaputken kannassa. T&auml;m&auml;nkin korjauksen yhteydess&auml; tulin painaneeksi sen kunnolla paikoilleen vanhasta tottumuksesta. Ilmeisesti pamaus liittyi siihen, ett&auml; kanta irtosi kokonaan ja syntyi l&auml;pily&ouml;nti focusj&auml;nnitteest&auml;. Mit&auml; taas nyrkin antamiseen tulee - sit&auml; se on tarvinnut ennenkin: hyvin monesti esim. kylmin&auml; talviaamuina t&auml;m&auml; ei oikein jaksa k&auml;ynnisty&auml;, mutta nyrkill&auml; se aina l&auml;htee...<br>
					<br>
					Jotain kulumistakin t&auml;ss&auml; on alkanut ilmet&auml;, sill&auml; kuva pyrkii vet&auml;m&auml;&auml;n ajanoloon kohti vasenta laitaa, se ik&auml;&auml;nkuin valuu sinne k&auml;ytt&ouml;tuntien funktiona, poikkeutuspiireiss&auml; taitaa olla joku komponentti v&auml;h&auml;n "v&auml;lj&auml;"... :) Viel&auml; jokin aika sitten kuvan sai s&auml;&auml;detty&auml; takaisin keskelle n&auml;yt&ouml;n takapinnassa olevista rei'ist&auml;, joista p&auml;&auml;see k&auml;siksi trimmereihin. Hiljattain sivusuuntaisesta s&auml;&auml;d&ouml;st&auml; kuitenkin loppui s&auml;&auml;t&ouml;vara, ja kuvaa piti siirt&auml;&auml; Picassosta. Sitten kun Picassostakin loppuu s&auml;&auml;t&ouml;vara, on kai pakko harkita uuden monitorin hankintaa. 19-tuumaista tuossa olen jo haaveillut, mutta saapa sitten n&auml;hd&auml; koska on varaa sellaiseen sijoittaa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Korppuasema, joka ei ollut Y2K-yhteensopiva</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Monitori oli siis taas kunnossa, takaisin k&auml;&auml;nn&ouml;shommien pariin. Verrattuani paperilla ollutta l&auml;hdekoodia kiintolevyll&auml; olleeseen sain viimein selville, miss&auml; vika oli. Tein muutokset ja aloin k&auml;&auml;nt&auml;&auml;, nyt toivon mukaan viimeist&auml; kertaa. CDTV ruksutteli korppuasemaansa ja homma eteni, kunnes tuli KS1.3:n karu requesteri varustettuna "Volume compiler has a read/write error" -tekstill&auml; ja Retry/Cancel painikkeilla. No niin, se siit&auml; korpusta. P&auml;&auml;tin kokeilla korjata korpun DiskSalvilla. Se onnistuikin, ja sen j&auml;lkeen tein siit&auml; kopion. Kopio sitten vain sis&auml;&auml;n ja boottia CDTV:lle, jotta k&auml;&auml;nn&ouml;s alkaisi. Niin se alkoikin, eteni tasan samaan paikkaan kuin aiemminkin - ja taas levyvirhe. Selev&auml;... CDTV:n korppuasema siis tuli tiens&auml; p&auml;&auml;h&auml;n!<br>
					<br>
					Homma oli taas seis. Ei kuitenkaan pitk&auml;&auml;n, sill&auml; romukaapista l&ouml;ytyy jos jotakin. Sielt&auml; l&ouml;ytyi my&ouml;s ostamani p&ouml;yt&auml;mallin A3000:n (eli tuon videokoneen) mukana tullut, omatekoinen CD-asema/korppuasema-yhdistelm&auml;. Kytkin t&auml;st&auml; korppuaseman CDTV:n per&auml;&auml;n ja k&auml;ynnistin k&auml;&auml;nn&ouml;ksen. T&auml;ll&auml; kertaa se eteni viimein loppuun saakka, ja sain korjatun version asennetuksi videokoneelle. Homma l&auml;hti toimimaan ja ensimm&auml;inen Y2K-ongelma oli korjattu. Aikaakin noiden parin Basic-rivin muutokseen oli kulunut jo sen verran, ett&auml; oli aika l&auml;hte&auml; ulos ampumaan raketteja, t&auml;ll&auml; kertaa niit&auml; isoja.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>TechnoBBS 0.93</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					N&auml;in sitten vuosituhat vaihtui. Tinojen valamisen aikana nousi mieleen, ett&auml; mitenk&auml;h&auml;n sit&auml; nyt Sakunetin k&auml;y, n&auml;ink&ouml;h&auml;n mukana olevien boksien softat olisivat Y2K-yhteensopivia, onko koko Sakunetin pohjana oleva Fidonet-standardi Y2K-yhteensopiva, ovatko mailerit yhteensopivia eli voiko viestiliikenne en&auml;&auml; jatkua, kuoleeko Sakunet kenties Y2K-ongelmiin? P&auml;&auml;tin kokeilla ja kirjoittaa AZ.Amiga-alueelle viestin, jossa toivottaisin hyv&auml;&auml; uutta vuosituhatta.<br>
					<br>
					Kirjauduttuani sis&auml;&auml;n meni kaikki hyvin siihen asti, kun aloin kirjoittaa viesti&auml;. TechnoBBS:n online-editorissa seisoi p&auml;iv&auml;m&auml;&auml;r&auml;n kohdalla "01-Jan-100". Hups - Techno oli hyp&auml;nnyt vuoteen sata... haittaakohan tuo.. Kirjoitin viestini loppuun ja tallensin sen. Viimeinen elonmerkki, jonka boksi itsest&auml;&auml;n t&auml;m&auml;n j&auml;lkeen antoi, oli "Viesti tallennettu" -ilmoitus. Sen j&auml;lkeen tuli uskomaton hiljaisuus - mit&auml;&auml;n tekstej&auml; ei tulostunut, mik&auml;&auml;n toiminto ei toiminut, kiintolevyll&auml; oli hiljaista... Jumissa! Toinen Y2K-ongelma l&ouml;ydetty, ja t&auml;m&auml; oli pahemman sorttinen!<br>
					<br>
					H&auml;diss&auml;ni boottasin koneen. Systeemien latauduttua kirjauduin boksiin ja menin lukemaan viestej&auml;. Viestini oli todellakin tallentunut, ja se n&auml;kyi oikein, p&auml;iv&auml;m&auml;&auml;r&auml;ll&auml; 01-Jan-00. Koska boksi jumiutui viestin kirjoituksen j&auml;lkeen, enk&auml; siksi kyennyt kirjautumaan ulos normaalisti, ei t&auml;m&auml; viesti l&auml;htenyt boksistani eteenp&auml;in muille Sakunetin nodeille. Nodeille l&auml;htev&auml; posti kun k&auml;sitell&auml;&auml;n vasta k&auml;ytt&auml;j&auml;n kirjautuessa ulos. Toiveikkaana kokeilin uudelleen, josko koko jumi olisi vain johtunut siit&auml;, ett&auml; kone olisi ollut "jotenkin sekaisin". Mutta Amigassa t&auml;m&auml; ei yleens&auml; auta - Windows voi tehd&auml; asioita eri tavalla eri kerroilla, mutta Amiga tekee yleens&auml; kaiken joka kerta samalla tavalla. Niin nytkin. Sama jumi toistui.<br>
					<br>
					Viestej&auml; ei en&auml;&auml; voinut kirjoittaa boksissa online! Kauhistuneena mietin, toimivatkohan QWK- ja WWF-offline-toiminnotkaan. Niiden toimiminen olisi boksin jatkuvuuden kannalta v&auml;ltt&auml;m&auml;t&ouml;nt&auml;, koska Amiga Zone el&auml;&auml; p&auml;&auml;asiassa viesteist&auml; ja Sakunetist&auml;, joka sekin el&auml;&auml; viesteist&auml;. Bootattuani koneen j&auml;lleen p&auml;&auml;tin heti testata ja pakkasin itselleni WWF-paketin. K&auml;ynnistin WWF-readerin, joka sekin n&auml;ytti toimivan hienosti vuosituhannen vaihteesta riippumatta, purin paketin ja lueskelin viestej&auml;. Toimi ainakin yhteen suuntaan. Sitten kirjoitin viestin, jossa kerroin Technon online-editorin Y2K-ongelmasta, pakkasin viestipaketin ja l&auml;hetin sen boksiin.<br>
					<br>
					Vapisevin k&auml;sin kirjoitin shelliin komennon "ImportWWF", joka k&auml;ynnist&auml;&auml; sellaisen replypaketin importtauksen, joka on kopioitu localissa (eli samalta koneelta kuin miss&auml; boksi on). Techno prosessoi viestipaketin normaalisti ja palasi komentotilaan j&auml;&auml;m&auml;tt&auml; jumiin. T&auml;ss&auml; vaiheessa p&auml;&auml;si &auml;&auml;nek&auml;s "Jessss!" ilmoille - t&auml;m&auml; tiesi sit&auml;, ett&auml; boksilla oli viel&auml; tulevaisuutta. Sakuneti&auml; ja Amiga Zonea k&auml;ytt&auml;v&auml;t aktiiviset messuilijathan k&auml;ytt&auml;v&auml;t ainoastaan offline-tukea, joten nyt l&ouml;ytynyt Y2K-ongelma online-editorissa ei oikeastaan haitannut muita kuin minua itse&auml;ni. Toisaalta oli jotenkin ironista, ett&auml; jouduin hakemaan omasta boksistani viestej&auml; offlinena, lukemaan niit&auml; offline-readerilla ja "uppaamaan" vastauspaketit takaisin - kaikki t&auml;m&auml;n yhdell&auml; ja samalla koneella, jolla boksikin py&ouml;rii... :)<br>
					<br>
					H&auml;t&auml;ratkaisuna poistin kaikista valikoista, joista viestiedikan saattoi k&auml;ynnist&auml;&auml;, ne toiminnot joilla editoriin p&auml;&auml;si, siten ett&auml; kyseiset komennot tulostivat vain ilmoituksen ongelmasta. Hieman mietitytti se, ett&auml; onko t&auml;t&auml; offline-ruljanssia todellakin harrastettava loppuun asti. Lis&auml;ksi toinen huoli oli, ett&auml; viestieditoriin p&auml;&auml;si my&ouml;s viestien lukutilasta painamalla R (Reply), eik&auml; t&auml;t&auml; toimintoa ollut mist&auml;&auml;n mahdollista est&auml;&auml;. Tyydyin poistamaan string-tiedostoista (joissa boksisoftan k&auml;ytt&auml;m&auml;t teksti-ilmoitukset ovat) kohdan R samalla toivoen, ettei joku k&auml;ytt&auml;j&auml; paina R:&auml;&auml; vanhasta tottumuksesta.<br>
					<br>
					Nyt kyseinen toiminto oli ainakin haudattu piiloon. Koska TechnoBBS:st&auml; k&auml;yt&ouml;ss&auml; ollut versioni oli vuodelta 1994, hieman ep&auml;ilytti, saako siihen en&auml;&auml; korjausta. Muistelin, ett&auml; Technon tekij&auml; myi l&auml;hdekoodit jollekin kolmannelle osapuolelle, jota en edes tiennyt. T&auml;m&auml; kolmas osapuoli kehitteli TechnoBBS:&auml;&auml; eteenp&auml;in, mutta uutta versiota ei kai koskaan julkaistukaan, ja homma taisi j&auml;&auml;d&auml; kesken. Oli siis varsin ep&auml;todenn&auml;k&ouml;ist&auml;, ett&auml; vanhaan 0.93-versioon en&auml;&auml; edes l&ouml;ytyisi l&auml;hdekoodeja.<br>
					<br>
					P&auml;&auml;tin kuitenkin kysell&auml;, tiet&auml;isik&ouml; kukaan, kenell&auml; TechnoBBS:n l&auml;hdekoodit ovat. Muutakaan tietoa ei l&ouml;ytynyt kuin Ville-Pertti Keinonen, joka on alkuper&auml;inen tekij&auml;. Laitoin h&auml;nelle mailia ja kerroin 0.93-version Y2K-ongelmasta. Sain varsin pian vastauksen, jossa Ville-Pertti kertoi, ett&auml; h&auml;nell&auml; on viel&auml; kyseisen version l&auml;hdekoodi j&auml;ljell&auml;, mutta uudempia versioita ei ole, koska ne h&auml;n on myynyt. K&auml;vip&auml; tuuri, ett&auml; juuri oikea l&auml;hdekoodi l&ouml;ytyi! Lis&auml;ksi h&auml;n kertoi, ett&auml; h&auml;nell&auml; on viel&auml; toimiva Amiga olemassa, vaikka onkin siirtynyt FreeBSD-ymp&auml;rist&ouml;&ouml;n, ja ett&auml; h&auml;n voisi korjata ongelman!<br>
					<br>
					Piakkoin sainkin sitten uuden mailin, jossa oli korjattu versio liitteen&auml;. Asennettuani sen alkoi online-editori taas toimia, ja poistin aiemmin tekem&auml;ni valikko- ja string-muutokset. Korjattu versio TechnoBBS 0.93:sta on saatavilla Amiga Zonelta, mik&auml;li joku muukin sysop sit&auml; tarvitsee. Tiedosto l&ouml;ytyy filealueelta Amiga/Tietoliikenne/BBS-Ohjelmistot ja sen nimi on TBBS-Y2K.LhA.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Sakunetiss&auml; ei Y2K-ongelmia</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Muita Y2K-ongelmia boksissa ei sitten ilmennytk&auml;&auml;n, ja my&ouml;s Sakunet selvisi vuosituhannen vaihteesta ilman mink&auml;&auml;nlaisia ongelmia. Viestiliikenne sujui normaalisti. Oman vivahteensa toki antoi Gurulandian, yhden vanhimmista Amiga-bokseista, toiminnan loppuminen vuodenvaihteeseen. Siin&auml; meni taas yksi Amiga-boksi, ja my&ouml;s Telemaa lopetti toimintansa joulukuussa.<br>
					<br>
					Internet n&auml;ytt&auml;&auml; tekev&auml;n bokseista kuolevaa kansanperinnett&auml;, mutta silti k&auml;ytt&auml;ji&auml; riitt&auml;&auml;. Sakunetiss&auml; on kuin ihmeen kaupalla riitt&auml;nyt kirjoittajia, ei ruuhkaksi asti, mutta kuitenkin. Ehk&auml; yksi syy on se leppoisa tunnelma, jollainen l&ouml;ytyy vain sopivan kokoisesta (ei liian suuresta) yhteis&ouml;st&auml;. Mukaan kuitenkin mahtuisi viel&auml; uusiakin j&auml;seni&auml;, joten kell&auml; modeemi on k&auml;yt&ouml;ss&auml;&auml;n, niin tutustukaapa my&ouml;s Sakunetiin! Viestien hakemisesta ei synny suuria kustannuksia kaukopuhelunakaan, sill&auml; viestipaketti pakkautuu varsin nopeasti ja viestej&auml; voi lueskella ja kirjoitella offlinena ilman ett&auml; puhelukustannuksia syntyy siit&auml;.<br>
					<br>
					Amiga Zonella viestien hakeminen on kehitelty hyvin pitk&auml;lle ja sellaiseksi, ett&auml; se olisi k&auml;ytt&auml;j&auml;n kannalta mahdollisimman nopea ja joustava. Viestipaketti voidaan esimerkiksi pakata tausta-ajossa, jona aikana boksia voi k&auml;ytt&auml;&auml; normaalisti, esimerkiksi vastauspaketin voi l&auml;hett&auml;&auml; tai imuroida tiedostoja. Jos ehtii k&auml;ynnist&auml;&auml; tiedostojen imuroinnin ja paketti valmistuu t&auml;n&auml; aikana, se l&auml;hetet&auml;&auml;n automaattisesti tiedostojen siirron j&auml;lkeen, ilman ett&auml; sit&auml; tarvitsee erikseen pyyt&auml;&auml;. Viestipaketin pakkaamisen voi my&ouml;s asettaa k&auml;ynnistym&auml;&auml;n automaattisesti heti kun k&auml;ytt&auml;j&auml; on kirjautunut sis&auml;&auml;n. N&auml;ill&auml; automaattitoiminnoilla on ajateltu varsinkin kauempaa kaukopuhelutaksalla soittavia k&auml;ytt&auml;ji&auml;, jotta heille tulisi mahdollisimman v&auml;h&auml;n kustannuksia Sakunetin k&auml;yt&ouml;st&auml;.<br>
					<br>
					Jos boksilla riitt&auml;&auml; aktiivisia k&auml;ytt&auml;ji&auml; vanhaan malliin, voisin viel&auml; yritt&auml;&auml; hankkia koneeseen 060-korttia, varsinkin kun Y2K-ongelmistakin selvittiin s&auml;ik&auml;hdyksell&auml; ja boksin tulevaisuus on ainakin siin&auml; mieless&auml; turvattu. 060-kiihdytettyn&auml; suuremmatkin viestipaketit pakkaantuisivat hetkess&auml; ja kaukoyhteyksien takaa soittaville syntyisi entist&auml;kin v&auml;hemm&auml;n kustannuksia.<br>
					<br>
					My&ouml;s uudet boksit ovat l&auml;mpim&auml;sti tervetulleita Sakunetiin! Mukaan haluava sysop voi katsoa nodelistalta boksia, josta pollata viestej&auml;. Sakuneti&auml; voi pollata niist&auml; bokseista, joiden nodenumero p&auml;&auml;ttyy /1. T&auml;ll&auml; hetkell&auml; n&auml;ist&auml; aktiivisena on kolme. Ottamalla yhteytt&auml; l&auml;himm&auml;n sopivan boksin sysopiin voi pyyt&auml;&auml; nodenumeroa ja sopia pollauksista. Lis&auml;infoa voi my&ouml;s kysell&auml; suoraan minulta e-mailitse tai boksin kautta:<br>
					<br>
					<table width="100%">
						<tr><td align="center">Amiga Zone BBS</td><td align="center">Esa Heikkinen</td></tr>
						<tr><td align="center">015 - 348 968, 24h</td><td align="center"><a href="mailto:oh4kju@sci.fi">oh4kju@sci.fi</a></td></tr>
						<tr><td align="center">Sakunet 65:10/1</td></tr>
					</table>
					<br>
					Tervetuloa tutustumaan Sakunetiin!
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

