<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>Newsletter</title></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#00007F"><font size=+4>Reiseveranstaltung</font></font></b></h1></center>Sehr geehrte Damen und Herren,&nbsp;<br>heute m&ouml;chte ich Sie &uuml;ber behindertengerechte Reisen informieren.Die Verantwortlichen der Firma Sport-Touristik konnte ich dazu gewinnen,die Belange blinder Urlauber konsequent zu ber&uuml;cksichtigen. BlindeUrlauber werden auf Wunsch eine Informationsschrift &uuml;ber den Reiseverlauf,Hotel, Hotelanlage, Wegbeschreibungen, Ausfl&uuml;ge usw. In Blindenschriftkostenfrei erhalten. Im Hotel und auf der Hotelanlage werden viele Kennzeichnungenin Blindenschrift zu finden sein. Bei den Ausfl&uuml;gen oder auch in derHotelanlage sowie am Strand werden&nbsp; immer ausreichend Helfer zur Verf&uuml;gungstehen.&nbsp;<p>Bei den nachstehend ausf&uuml;hrlich beschriebenen Reisen werde ichselbst vor Ort sein, damit jederzeit ein Ansprechpartner zur Verf&uuml;gungsteht. Gemeinsam mit den Verantwortlichen des Reiseveranstalters werdeich pers&ouml;nlich darauf achten, dass die gemachten Zusagen auch strikteingehalten werden.<p>Bitte informieren Sie Ihre Bekannten und Freunde &uuml;ber dieses nichtallt&auml;gliche Angebot f&uuml;r Behinderte.&nbsp;<br>Wenn Sie im Blindenverein t&auml;tig sind, lassen Sie mich doch bittewissen, ob und unter welchen Bedingungen diese Info auch in den Vereinsnachrichtenoder in Mailinglisten ver&ouml;ffentlicht werden kann.&nbsp;<p>Wenn Sie zuk&uuml;nftig keine Informationen per E-Mail von mir erhaltenm&ouml;chten, lassen Sie mich dies bitte kurz wissen, damit Ihrem Wunscheentsprochen werden kann.<p>Auf meiner Internetseite werden Sie &uuml;ber weitre Angebote informiert.&nbsp;<p>Bei weiteren Fragen stehe ich gern zur Verf&uuml;gung.<p>Freundliche Gr&uuml;&szlig;e<br>Helmut Ernst<p>Helmut Ernst, Leuschnerstr. 97, D-34134 Kassel<br>Tel.: 0561/4009560, Mobil: 0170 1400 731,<br>E-Mail: info@h-ernst.de<br>Internet: www.h-ernst.de<br>&nbsp;<p>Verbringen Sie dort Ihren Urlaub, wo man sich auf Ihre speziellen Belangeeinstellt!<p>Da ich selbst blind bin, wei&szlig; ich aus eigener Erfahrung, dassman als Behinderter an den meisten Urlaubsorten allein vollkommen aufgeschmissenist. Der Urlaub wird dann keinesfalls erholsam. Schlie&szlig;lich oderschon fast endlich sind die sch&ouml;nsten Tage des Jahres herum. Man &auml;rgertsich, dass man die Angebote vor Ort nicht nutzen konnte. F&uuml;r einensolchen Urlaub ist das Geld zu schade!<p>Mit dem Reiseveranstalter, Firma Sports Touristik, haben wir Gruppenreisenf&uuml;r Behinderte und Nichtbehinderte ausgearbeitet.<br>Urlaubsort ist die Anlage des Sporthotels Grida City (4 Sterne).<br>Grida City befindet sich an der t&uuml;rkischen Riviera, nur etwa 15km westlich von Antalya. Der herrliche Sandstrand ist in 2 Minuten bequemzu Fu&szlig; zu erreichen.&nbsp;<p>Die Hotelanlage umfa&szlig;t u. a.:<br>- Tennisclub mit Tennispl&auml;tzen, Au&szlig;enplatz bis 4.000 Zuschauer,&nbsp;<br>- Open Air Theaterplatz bis 5.000 Zuschauer,<br>am Strand kann eine B&uuml;hne aufgestellt werden,<br>- Tartanbahn mit Abteilungen wie Kugelsto&szlig;en, Weitsprung,&nbsp;<br>- Bogen-Schie&szlig;-Platz,&nbsp;<br>- Sportpl&auml;tze f&uuml;r Basketball, Volleyball, Judo, Tischtennis,&nbsp;<br>- Olympisches Hallenbad, 50 x 25 m,&nbsp;<br>- 2 kleine Fu&szlig;ballpl&auml;tze,&nbsp;<br>- 1 Fu&szlig;ballplatz nach FIFA-Standard,&nbsp;<br>- Fitnesszentrum,&nbsp;<p>Das Hotel Grida City ist vollkommen behindertengerecht. Dies gilt f&uuml;rnahezu alle Behinderungsarten.&nbsp;<br>In der Sportanlage Grida City kann der Urlauber Sport, Spa&szlig; undErholung hervorragend miteinander verbinden.&nbsp;<br>Wollen Sie pulsierendes Stadtleben genie&szlig;en, ist das nahe gelegeneAntalya in k&uuml;rzester Zeit zu erreichen.&nbsp;<p>Im Internet k&ouml;nnen Sie sich Grida City unter www.gridacity.comgenau ansehen.&nbsp;<br>Blinde Interessenten und Urlauber erhalten alle wichtigen Informationen&uuml;ber das Hotel, Ablauf der Gruppenreise, Flug usw. auf Wunsch kostenfreiin Blindenschrift.&nbsp;<br>In der Hotelanlage werden blinde Urlauber viele Kennzeichnungen inBlindenschrift vorfinden.<p>Im Hotel sind 14 Zimmer absolut Rollstuhlfahrer gerecht. Die T&uuml;render Zimmer sowie zum WC und Balkon sind 85 cm breit.<br>Die sonstigen T&uuml;ren im Hotel sind breiter. Im Hotel sind nur 3Treppen vorhanden. Hier steht jeweils eine bewegliche Rampe von 3 m L&auml;ngezur Verf&uuml;gung. In der Umgebung des Pools sind 3 Wege. 2 davon sindvon Rollstuhlfahrern so passierbar. F&uuml;r den dritten Weg steht ebenfallseine bewegliche Rampe zur Verf&uuml;gung.&nbsp;<p>Der Bus, mit dem der Transfer vom Flughafen zum Hotel und zur&uuml;ckzum Flughafen gefahren wird, ist mit einer Hydraulikrampe ausgestattet.An der beschriebenen Bootsfahrt k&ouml;nnen auch Rollstuhlfahrer teilnehmen.&nbsp;<p>Die nachstehend erl&auml;uterte Gruppenreise k&ouml;nnen wir Ihnen undIhren Freunden, oder Ihren Vereinskameraden anbieten. F&uuml;r einen Verein,f&uuml;r eine Gruppe ist es nur von Vorteil, wenn die Personen, die dasganze Jahr &uuml;ber zusammen arbeiten, gemeinsamen Interessen nachgehen,auch einmal in entspannter Urlaubsatmosph&auml;re sch&ouml;ne und unvergesseneTage miteinander verbringen. Die hier vorgestellten Gruppenreisen sinddaf&uuml;r ideal geeignet.&nbsp;<p>REISEVERLAUF:<br>1. Tag: Charterflug von D&uuml;sseldorf, M&uuml;nchen, Stuttgart oderFrankfurt nach Antalya,<br>Empfang durch die Reiseleitung am Flughafen und Transfer zum Hotel,<br>Zimmerverteilung,<br>W&auml;hrend eines Info-Cocktails werden Sie &uuml;ber alles Wissenswertevor Ort informiert. Die folgenden 3 Ausfl&uuml;ge sind im Preis Ihres 1w&ouml;chigenUrlaubes inbegriffen.<p>Antalya - Pamukkale (ohne Mittagessen)<br>Gegen 08:00 Uhr beginnt die Fahrt mit einem modernen, klimatisiertenBus und erfahrenem Reisefahrer Richtung Pamukkale. W&auml;hrend Sie diereizvolle Landschaft bewundern, wird Ihnen Ihre erfahrene Reiseleitunginteressante Informationen &uuml;ber die T&uuml;rkei, soziale Verh&auml;ltnisse,Land und Leute etc. weitergeben.&nbsp;<br>Gegen Mittag erreichen Sie Pamukkale.&nbsp;<br>Nach der Mittagspause besichtigen Sie die antike Stadt Hierapolis undhaben gen&uuml;gend Zeit die Kalkterassen von Pamukkale zu bewundern. Siebesichtigen auch in der Provinzhauptstadt Denizli eine Moschee&nbsp;<br>Und h&ouml;ren interessante Informationen &uuml;ber den Islam und fahrenanschliessend durch das Taurus-Gebirge zur&uuml;ck nach Belek. Unterwegsbesuchen Sie ein Teppichkn&uuml;pfzentrum und sehen, in&nbsp;<br>welcher Art und Weise die ber&uuml;hmten t&uuml;rkischen Teppiche hergestelltwerden. Sie erreichen Ihr Hotel gegen 18:00 Uhr.<p>Antalya (ohne Mittagessen)<br>Antalya ist die Provinzhauptstadt der t&uuml;rkischen Riviera. Nachdem Fr&uuml;hst&uuml;ck erreichen Sie Antalya in ca. 45 Minuten. Sie besuchenden traditionellen Obst-, Gem&uuml;se- und Gew&uuml;rzmarkt, den Yachthafenund das Stadtzentrum. Sie erreichen Ihr Hotel gegen 17:00 Uhr.<p>BOOTSFAHRT ab Antalya zu den Wasserf&auml;llen (ca 3 stunden). EinenErlebnissausflug, welchen man mit Worten nicht beschreiben kann.&nbsp;<p>Leistungen des Aktivurlaubes:<br>* Flug Hin und Zur&uuml;ck,<br>* Flughafensteuern und Sicherheitsgeb&uuml;hren,<br>* 7 x &Uuml;bernachtungen im 4 Sterne Hotel Grida City,<br>* Flughafen - Hotel - Flughafen Transfers,<br>* Pamukkale-Antalya und Bootsfahrt; Ausfl&uuml;ge sind inklussive,<br>* Qualifizierte Reiseleitung,<br>* Moderner, klimatisierter Bus bei Transfers und anderen Ausfl&uuml;gen,<br>* Willkommensdrink bei dem Info-Cocktail,<br>* Sportgelegenheiten,<p>Bei den Ausfl&uuml;gen sowie am Flughafen stehen immer ausreichend Helferzur Verf&uuml;gung.<p>8 Tage Halbpension mit drei Ausfl&uuml;gen,&nbsp;<br>PREIS: Pro Person im Doppelzimmer, Euro 640,--<br>Einzelzimmer-Zuschlag: Euro 190,--<p>Die Doppelzimmer sind mit getrennten Betten, Dusche/Bad, Handwaschbecken,WC, TV, Radio, Minibar, Klimaanlage ausgestattet.&nbsp;<p>2 Termine stehen f&uuml;r diese qualitativ hohen und doch &auml;u&szlig;erstpreisg&uuml;nstigen Gruppenreisen zur Verf&uuml;gung:<p>14.-21. 08 2004,<br>04.-11. 09. 2004,<p>Wenn es gew&uuml;nscht wird, organisieren wir f&uuml;r Sie auch dieAnreise zum Flughafen. Auf den 4 genannten Flugh&auml;fen gibt es Sozialdienste,die Sie auf dem ganzen Flughafengel&auml;nde bis zur Maschine begleiten.In Antalya werden Sie, wie vorstehend erw&auml;hnt, durch die Reiseleitungund Helfer in Empfang genommen.&nbsp;<p>Wenn Sie allein oder mit 1, 2 Freunden an einem der vorstehend genanntenTermine reisen wollen, ist das selbstverst&auml;ndlich m&ouml;glich.&nbsp;<br>Vielleicht ist es ja Ihr verst&auml;ndlicher Wunsch, einfach dem Alltagentfliehen, und bei Sport, Erholung und Spass mit anderen gemeinsam einensch&ouml;nen Urlaub zu verbringen.<p>Auf Wunsch k&ouml;nnen auch Reisen zu anderen Orten der t&uuml;rkischenRiviera Organisiert werden. Nennen sie uns Ihre individuellen Urlaubsw&uuml;nscheund gemeinsam Entwickeln wir das Passende f&uuml;r Sie.&nbsp;<p>Bei weiteren Fragen oder Buchungen stehen wir Ihnen gern zur Verf&uuml;gung.&nbsp;<p>Helmut Ernst, Leuschnerstr. 97, D-34134 Kassel,<br>Tel.: 0561/400 95 60<br>Fax: 0561/400 95 61<br>Mobil 0170 1400 731&nbsp;<br>E-Mail: info@h-ernst.de<br>Internet: www.h-ernst.de</td></tr></table></body></html>