<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>Richtlinien in der NoCover</title></head><body text="#000000" bgcolor="#B0B0B0" background="int_bg.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitengestaltung" ><tr><td WIDTH="60"></td><td><center><img SRC="int_rtl.gif" ALT="" height=70 width=310></center><h3><b>Wie schreibe ich einen Artikel/Beitrag f&uuml;r die NoCover?</b></h3>Eigentlich ist das ganz einfach. du brauchst dir nur ein Thema auszusuchen,das dich sehr interessiert oder wo du dich gut auskennst. Dann schnappstdu dir irgendeinen Texteditor oder eine Textverarbeitung und tippst einfachdrauf los.<p>Da wir ein gutes Erscheinungsbild haben wollen und vor allem ein gutesMagazin erstellen wollen, sind hier einige Richtlinien, die unbedingt beachtetund eingehalten werden m&uuml;ssen:<ul><li>Erst &uuml;berlegen, dann schreiben!!!</li><li>Texte bitte in Deutsch und wenn m&ouml;glich bitte ohne gro&szlig;e Mundartf&auml;rbungen,damit ein Holsteiner auch lesen kann, was ein Bayer geschrieben hat undumgekehrt. Texte mit Beleidigungen, Schimpfw&ouml;rtern und &auml;hnlichem(damit ist auch die F&auml;kalsprache gemeint) werden nicht ver&ouml;ffentlicht!</li><li>Keine Streitereien unter den Autoren! Wenn jemand den anderen kritisierenwill, dann bitte in einen vern&uuml;ftigen Ton und wenn m&ouml;glich mitBegr&uuml;ndung!</li><li><b>Beitr&auml;ge d&uuml;rfen keine Copyrightsverletzungen, keine Gesetzes&uuml;bertretungenoder Aufforderung zu solchen, keine Pornographie (Text und/oder Bild),keine wohlwollende oder verherrlichende Erw&auml;hnung &uuml;ber indizierteSpiele und keine absichtliche Falschmeldungen aufweisen. Testberichte &uuml;berindizierte Spiele werden generell nicht ver&ouml;ffentlicht.</b></li><li>Am Ende des Artikels steht der Realname des Autors. Bitte keine K&uuml;rzeloder sonst irgendwas. Dies kann meinetwegen zus&auml;tzlich drinnestehen,aber der Realname <b>MUSS</b> am Ende des Artikels stehen. Bitte nichtam Anfang des Artikels. Alleine schon wegen der <b>&Uuml;bersicht</b> unddes <b>Copyrights</b>.</li><li>Der Beitrag sollte als HTML-Datei nach dem HTML-Standard 3.2 layoutet sein.Beim Layouten bitte an die Regeln halten. Nicht layoutete Beitr&auml;gewerden mittels der Dummydatei ohne weitere detaillierte Aufbereitung ver&ouml;ffentlicht.Dies kann leicht zu ungewollten Effekten f&uuml;hren.</li><br>Es ist aber wirklich kein Weltuntergang wenn jemand einen Text einschicktder nicht layoutet ist!<li>Mache dir immer eine Kopie von deinen Beitr&auml;gen, bevor du diese abschickst.Internet und Post geben keine Garantie &uuml;ber Verluste.</li><li>Im Beitrag eingebundene Bilder nur als JPG, PNG oder als GIF verwenden.Dabei ist aber auf eine vern&uuml;nftige Gr&ouml;&szlig;e und Farbzahlzu achten. 8-bit Bilder sehen meist genau so gut aus, wie 24-bit Bilder,ben&ouml;tigen aber viel weniger Speicherraum.</li><li>Texte wie "(c) by" oder "layouted by" sind unn&ouml;tig. Das &copy; stehteindeutig im Impressum. Es ist also nicht n&ouml;tig dies nochmals in denArtikeln zu wiederholen.</li><li>Damit die Artikel einer Rubrik zugeordnet werden k&ouml;nnen, ist das entsprechendeMerkmal dem Namen mit Unterstrich voranzustellen (dient nur der &Uuml;bersichtlichkeit,ist nicht zwingend vorgeschrieben). Zur Zeit gibt es folgende Rubriken:&nbsp;</li><center><table BORDER=0 summary="" ><tr><th ALIGN=LEFT>Rubrik</th><th ALIGN=LEFT>Dateiname</th><th WIDTH="30">|</th><th ALIGN=LEFT>Rubrik</th><th ALIGN=LEFT>Dateiname</th></tr><tr><td COLSPAN="5"><hr size="1"></td></tr><tr><td>Workshops</td><td>ws_name.html</td><td ALIGN=CENTER>|</td><td>Tools</td><td>tl_name.html</td></tr><tr><td>Hardware</td><td>hw_name.html</td><td ALIGN=CENTER>|</td><td>Games</td><td>gt_name.html</td></tr><tr><td>MultiMedia</td><td>mm_name.html</td><td ALIGN=CENTER>|</td><td>MiniMarket</td><td>mi_name.html</td></tr><tr><td>Lesebriefe</td><td>lb_name.html</td><td ALIGN=CENTER>|</td><td>Small Talk</td><td>st_name.html</td></tr><tr><td>Helpline</td><td>hl_name.html</td><td ALIGN=CENTER>|</td><td>Tipps &amp; Tricks</td><td>tt_name.html</td></tr><tr><td COLSPAN="5"><hr size="1"></td></tr></table></center><li>Die Rubrik "NC-Talk" wurde wieder in Diskussionen umbenannt. Und aus derRubrik CD habe ich Leserbriefe gemacht.</li></ul><br>&nbsp;<p>So ich hoffe ich konnte hier einigen bereitwilligen Schreiberlingenhelfen. Wenn jemand noch Vorschl&auml;ge hat, was ich hier erkl&auml;rensollte, dann nur her damit. Dieser Text wird in Zukunft immer erweitertund modifiziert. Also bitte immer mal schnell den Text lesen, bevor dueinen neuen Artikel schreibst.<br>Danke !!!!!&nbsp;<p><hr></td></tr></table></body></html>