<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Interview mit Andreas Magerl</title><!-- Author = Cord Hagen --></head><body text="#000000" bgcolor="#B0B0B0" background="wolf1.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#0000FF"><font size=+3>Interview mit Andreas Magerl</font></font></b><br><b><font color="#0000FF"><font size=+3>- dem Gr&uuml;nder des Online-Magazins"NoCover"&nbsp;</font></font></b></center><p>Mit dieser letzten Ausgabe der NoCover schlie&szlig;t ein gewaltigesKapitel im Bereich der Online-Magazine. Rund zehn Jahre erfreuten sichdie Leser an diesem Online-Magazin. So d&uuml;rfte es eine Selbstverst&auml;ndlichkeitsein, noch ein paar letzte S&auml;tze auch von Demjenigen einzufordern,der auch die ersten S&auml;tze in der NoCover Ausgabe 1 schrieb...<p>10 Fragen an Andreas Magerl<p>1. <i><font color="#007F00">Gr&uuml;&szlig; Dich Andreas, - Du kennstdas Spiel mit den typischen Interviews ja bereits mehr als reichlich. Beginnenwir mit der ersten typischen Aufforderung, Dich unseren Lesern hier nochein mal kurz vorzustellen, da sich der Gro&szlig;teil der NoCover-Leserschaftge&auml;ndert hat und Viele Dich noch nicht kennen werden. Woher kommstDu, wie alt bist Du, was machst Du so beruflich und in Deiner Freizeit?</font></i><p>Puh, ja, denn das Spielchen und ich hasse es :)<p>Also ich komm aus den sch&ouml;nen &Uuml;bersee (was vermutlich keinMensch kennt) und hab es seit 33 Jahren geschafft nicht drauf zu gehen(Zuminderst die letzten Jahre war das eine echte Herausforderung. ;)).<p>Beruflich mach ich eigentlich gar nichts mehr, da ich krank bin. Alleswas ich noch mache ist praktisch ein Hobby f&uuml;r mich. Und das Hobbyschaut so aus, dass ich Software f&uuml;r den Amiga ver&ouml;ffentlicheund nat&uuml;rlich die Amiga Future.<p>Ansonsten gibts eigentlich nichts besonders &uuml;ber mich zu sagen.<br>---<p>2. <i><font color="#007F00">Seit wann gibt es die NoCover eigentlichschon und warum gibt es sie? Hattest Du seinerzeit etwas bestimmtes mitihr im Sinn? Und wie kam es zu dem Namen?</font></i><p>Also die NoCover gibt es Anfang 1994. Wir hatten damals den so ziemlichgr&ouml;&szlig;ten Amiga-Club und wollten ein Clubmagazin gr&uuml;nden.<br>Wir hatten zwar bereits vorher die AmigaFire (Wer hat noch eine Ausgabe???W&uuml;rde ich gerne mal wieder sehen!) aber aus Zeitmangel musste derMichael diese einstellen.<br>Dann hatte sich jemand anderes bereit erkl&auml;rt ein Mag zu machen.Dieses Mag nannte sich NoLimit und erschien leider nur ein einziges mal.Die Jungs waren leider extrem unzuverl&auml;ssig und so haben wir in einerNacht &amp; Nebelaktion die NoCover aus dem Boden gestampft. Innerhalbvon rund einer Woche hatte ich alle Artikel, das Konzept und die Diskszusammen und schon konnte es losgehen :)<p>Der Name hatte eigentlich keinen wirklichen Grund und sollte auch keine&Auml;hnlichkeit (wie uns immer wieder vorgeworfen wurde) mit der NoLimithaben.<br>Ich hatte einfach am Anfang null Ahnung welches Titelbild und welchenNamen wir f&uuml;r die NoCover verwenden sollten.<br>Und "Magazin ohne Namen" h&ouml;rte sich irgendwie doof an :)<p>---<p>3. <i><font color="#007F00">Vor so langer Zeit lag das Internet dochnoch in den Kinderschuhen. Gab es die NoCover denn von Anfang an als Online-Magazinim HTML-Format?</font></i><p>N&ouml;. Es gab, f&uuml;r damalige Verh&auml;ltnisse, ein absolutesgeniales Programm. Mit Magnetic Pages haben wir lange Zeit die NoCovererstellt und per Disks und Mailboxen &uuml;berall verteilt. Aber irgendwannwar es einfach zu umst&auml;ndlich mit dem Programm ein Mag zu erstellenund um im Internet etwas pr&auml;sentieren zu k&ouml;nnen brauchten wirso oder so HTML Seiten. Deswegen entschied ich mich nach langen hin undher f&uuml;r das HTML-Format.<p>---<p>4. <i><font color="#007F00">Was gab es Anfangs so f&uuml;r Themen imMagazin und wer waren seinerzeit die Redakteure? Und was ist aus Denengeworden, - hast Du noch Kontakt zu ihnen?</font></i><p>Es ging um so ziemlich alles. Hauptthema war dabei nat&uuml;rlich Amiga.Mir pers&ouml;nlich haben am besten<br>die Fortsetzungs-Storys gefallen. Ist schon irgendwie verdammt coolwenn nen Dutzend Leute an einer<br>Geschichte schreiben....<p>Wir hatten ja in diesem Sinne keine festen Redakteure. Es gab sehr vieledie fats immer etwas geschrieben hatten und noch mehr die nur ab und zuwas schrieben. Die NoCover war ja ein Mag f&uuml;r und von den Lesern.Jeder konhte mitmachen.<p>Einige der "Viel-Schreiben" sind z.b. jetzt bei der Amiga Future alsRedakteure dabei. Andere sind bei anderen Zeitschriften sogar fest besch&auml;ftigt.<br>Zu einigen hab ich noch Kontakt, aber die meisten hab ich leider ausden Augen verloren...<p>---<p>5. <i><font color="#007F00">Ich vermute mal, dass Einigen hier das anf&auml;nglicheThema, also das Computersystem "Amiga" nicht ganz bekannt sein wird. Washat es damit auf sich? Nutzt Du selbst auch dieses Computersystem und wasist daran besser oder anders, als an den &uuml;blichen Windows-Computern?Gabs auch schon in der Anfangsphase auch v&ouml;llig andere Themen in derNoCover?</font></i><p>Es gab schon immer andere Themen in der NoCover. Das beste Beispielwaren die oben erw&auml;hnten Storys.<p>Die Vorteile des Amiga? Bitte nicht b&ouml;se sein, aber &uuml;ber dasThema wird soviel diskutiert... hab ich null Bock mehr drauf.<p>Ich arbeite hier mit einem 4000er. Vom Alter her zu vergleichen mitnem 486er... Gibts hier einen PC-User der von sich sagen kann, dass ergerne auf nem 486er arbeiten m&ouml;chte? Oder ins Internet gehen ohneAngst zu haben, dass man nen neuen Rekord beim Virenbefall bekommt. Oderein Betriebssystem wo man weiss was der Computer gerade macht.... Und nat&uuml;rlichein Computer wo der Benutzer bestimmt was gemacht wird und nicht der Computer...<p>---<p>6. <i><font color="#007F00">Was hat Dir besonders Spass an der NoCovergemacht und was hat Dich am meisten genervt? Gibt es etwas, was Dir besondersin Erinnerung ist und wo von Du berichten kannst?</font></i><p>Am meisten hat mich, das einerseits geniale, Magnetic Pages genervt.Ewigkeiten bin ich daran gesessen um die Artikel damit in das Mag einzubauen.Und dann nen kleiner Tippfehler und schon konnte man ne halbe Stunde danachsuchen. Das Programm war echt super. Aber die Bendienung war so ziemlichdas &Uuml;belste was ich je gesehen habe.<p>Am meisten Spa&szlig; hat es nat&uuml;rlich gemacht die ganzen Artikelzu lesen. Ich hatte ja den Vorteil, dass ich immer der erste dabei war:)<p>---<p>7. <i><font color="#007F00">Wann hast Du die Verantwortlichkeit f&uuml;rdie NoCover abgegeben und vor allem, warum? Welches war die letzte Ausgabe,die Du noch zusammen gestellt hast?</font></i><p>Ahm Cord, jetzt brinsgte mich zum Verzweiflen. Ich glaub das war dieAusgabe 92 als ich aufh&ouml;rte. K&ouml;nnt es aber nicht beschw&ouml;ren.Am besten mal Wolf fragen, der es wirklich sehr gut weitergef&uuml;hrthat.<p>Ich bin krank und hab dadurch relativ wenig Zeit zur Verf&uuml;gung.Die Amiga Future und der Softwarevertrieb kosten mehr als gen&uuml;gendZeit. Ich musste einfach einiges abgeben oder einstellen.<p>---<p>8. <i><font color="#007F00">H&auml;ttest Du Dir gew&uuml;nscht, dasses die NoCover noch weiterhin gibt? H&auml;ttest Du &uuml;berhaupt gedacht,dass es das Online-Magazin so lange geben w&uuml;rde? Gab es Momente, woDu die NoCover am liebsten seinerzeit selbst sofort eingestampft h&auml;ttest?</font></i><font color="#007F00"></font><p>Es gab einen Moment wo ich echt den Spass verloren habe. Also ich neneue NoCover fertig hatte und kopieren wollte.<br>Nach &uuml;ber 300 Disks stellet ich fest das ich nicht die neue sonderndie alten Disks kopiert hatte. Hast Du ne Ahnung wielange es dauert bisman<br>300 Disks kopiert hat? Und das nach nen 12 Stunden Arbeitstag? :/<p>Ob es mri lieber w&auml;re wenn die NoCover weiterhin erscheinen w&uuml;rde.Klar. Aber das Problem ist einfach das es immer weniger Artikel geben wird.Ist eben die Problematik des Internets.<p>---<p>9. <i><font color="#007F00">Hast Du ein Sch&auml;tzung, wie viele Menschenwohl die NoCover zu ihren Bestzeiten gelesen haben, als Du sie noch zusammengestellt hast? Wo wurde die NoCover den Lesern fr&uuml;her &uuml;berallzur Verf&uuml;gung gestellt, - auf welchen Medien?</font></i><p>Ganz fr&uuml;her gab es die NoCover nur auf Disks. Sehr schnell kamdann noch meine Mailbox, kurz danach dutzende Mailboxen und auch Netzedazu.<br>Diverse PD-H&auml;ndler verbreiteten die NoCover au&szlig;erdem noch.<p>Sp&auml;ter kamen nat&uuml;rlich auch noch CDs usw. dazu.<p>Wieviele die NoCover wirklich gelesen haben kann man nicht mal sch&auml;tzen.Es gab Ausgaben die durch CDs locker 20.000 Auflage hatten. Das bedeutetaber nicht das 20.000 die NoCover dann gelesen hatten.<p>Ich hatte fr&uuml;her mal die Downloads und Disks gez&auml;hlt und sch&auml;tzedamals, dass sich mindestens 1000 regelm&auml;ssig f&uuml;r das Mag interessierten...<br>&nbsp;<p>---<p>10. <i><font color="#007F00">Und nun m&ouml;chte ich Dich noch um dieInterview-typischen letzten Zeilen an unsere Leser bitten..</font></i><p>ahm, &ouml;hm, tja, was soll ich sagen? Meine Kontonummer steht aufmeiner Page. Spenden jeder Art werden gerne angenommen :)<p>Wenn sich jemand f&uuml;r die ersten Ausgaben der NoCover interessiert..einfach mailen. Ich hab ausnahmslos alle Ausgaben hier...<p>---<p><i><font color="#007F00">Ich danke Dir ganz herzlich im Namen allerLeser und Schreiber f&uuml;r Deine Arbeit und dass wir uns so lange &uuml;berdieses sch&ouml;ne altehrw&uuml;rdige Online-Magazin freuen durften. Wirwerden die NoCover in bester Erinnerung behalten und sie auch k&uuml;nftigvon der ersten bis zur heutigen Ausgabe auf ihrer Homepage http://www.nc-mag.deden interessierten Lesern anbieten.</font></i><font color="#007F00"></font><p><i><font color="#007F00">Cord Hagen</font></i></td></tr></table><font color="#007F00"></font></body></html>