<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> </title><!-- Author = Cord Hagen --></head><body text="#000000" bgcolor="#B0B0B0" background="wolf1.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#0000FF"><font size=+3>Interview mit Wolf Zimmer</font></font></b><br><b><font color="#0000FF"><font size=+3>- dem leitenden Redakteur desOnline-Magazins "NoCover"&nbsp;</font></font></b></center><p>Mit dieser letzten Ausgabe der NoCover schlie&szlig;t ein gewaltigesKapitel im Bereich der Online-Magazine. Rund zehn Jahre erfreuten sichdie Leser an diesem Online-Magazin. So d&uuml;rfte es eine Selbstverst&auml;ndlichkeitsein, noch ein paar letzte S&auml;tze auch von Demjenigen einzufordern,der die NoCover bis zur heutigen letzten Ausgabe stets p&uuml;nktlich zusammengestellt hat.<p>10 Fragen an Wolf Zimmer<p>1. <i><font color="#007F00">Gr&uuml;&szlig; Dich Wolf, - beginnen wirauch in Deinem Fall mit der ersten typischen Aufforderung, Dich unserenLesern hier ein mal kurz vorzustellen, da der Gro&szlig;teil der NoCover-LeserschaftDich vielleicht noch nicht kennt. Woher kommst Du, wie alt bist Du, wasmachst Du so beruflich und in Deiner Freizeit?</font></i><p>Gr&uuml;&szlig; dich Cord, - ein Interview mit mir w&auml;re mir niein den Sinn gekommen. Um so mehr bin ich &uuml;berrascht. Manche Fragenwerde ich wohl etwas k&uuml;rzer, andere daf&uuml;r l&auml;nger beantworten.Viele Fragen sind eigentlich ineinandergreifend und so kann es bei direkterBeantwortung zu auseinandergerissenenen Passagen kommen. Daf&uuml;r m&ouml;chteich mich vorab schon einmal entschuldigen. Aber fangen wir an:<p>Ich bin 64 Jahre alt, pensionierter Berufssoldat, verheiratet (sie istsehr lieb und Lehrerin) und als Angabe f&uuml;r Freizeit gab es mein ganzesLeben lang nur die Devise: Familie und Wandern. Wobei in letzter Zeit sichdas Wandern zu einem Spazierengehen gewandelt hat.<br>---<p>2. <i><font color="#007F00">Seit wann stellst Du die NoCover eigentlichschon zusammen und warum hast Du sie seinerzeit &uuml;bernommen? HattestDu etwas bestimmtes mit ihr im Sinn?</font></i><p>Genau war es NoCover-103 zum 03. Oktober 2002. Die Begr&uuml;ndung meinesEngagements hatte ich damals im Editorial ausgiebig erl&auml;utert undm&ouml;chte es mir hier schenken. Nur eines am Rande - h&auml;tte ich dieZusammenstellung nicht an mich gerissen, die NC w&auml;re nicht mehr erschienen.Und das "anmichrei&szlig;en" ist w&ouml;rtlich zu nehmen.<br>---<p>3. <i><font color="#007F00">Was gef&auml;llt Dir an dem Konzept unddem Format der NoCover besonders?</font></i><p>Das Motto: "<b>von Amiga-User f&uuml;r Amiga-User</b>" hatte mir vonAnbeginn gefallen und ich habe es auch mit besten Kr&auml;ften versuchtfortzuf&uuml;hren. Nur gezwungenerma&szlig;en durch das Verschwinden desWortes "<b>Amiga</b>" ist das Moto &uuml;briggeblieben: "<b>von User f&uuml;rUser</b>".&nbsp;<br>---<p>4. <i><font color="#007F00">Kennst Du noch die alten Redakteure, - hastDu noch Kontakt zu ihnen? Seit wann liest Du selbst eigentlich die NoCover,- welches war Deine erste Ausgabe? Gefiel sie Dir sofort von Beginn an?</font></i><p>NoCover war das Club-Magazin in Diskettenform bis zur Ausgabe 92 desAmigaclubs APC&amp;TCP, mit dessen Gr&uuml;nder Andreas Magerl ich heutenoch Kontakt habe. Kennengelernt habe ich alles erst zur Messe 1994 inK&ouml;ln, wo nach meinem ersten Eindruck viele junge Leute Disketten kopierten,tauschten, kauften und die Gespr&auml;che drehten sich eigentlich nur umSpiele. Dem Club beigetreten bin ich erst im Jahre 1996 und meinen erstenBeitrag ver&ouml;ffentlichte ich in der NC-30.<br>---<p>5. <i><font color="#007F00">Wann kam f&uuml;r Dich der Entschluss, dassauch Du k&uuml;nftig die NoCover nicht mehr zusammenstellen m&ouml;chtestund was waren die Gr&uuml;nde?</font></i><p>Der Entschluss kam spontan, aber ganz ehrlich mit einer etwas l&auml;ngerenVorlaufzeit. Amiga-User-typisch ist von jeher gewesen: ich m&ouml;chtedabeisein, aber lasse andere machen. So ist es auch mit Beitr&auml;genf&uuml;r die NoCover geschehen. Seit ca einem Jahr konnte ich nur auf f&uuml;nfoder sechs Autoren hoffen, die eigene Artikel mit und ohne Bilder einreichten.Auch die Anzahl der Empf&auml;nger der monatlichen Mail schrumpfte sehentlich.Dann kam der 02.Juni 2004. Ein gewaltiger Blitz schlug in unserer Stra&szlig;eein. Blitzschutzschalter und sonstige Sicherungen waren dieser &Uuml;berspannungnicht gewachsen. In unserem Haushalt hatte nur die Telefonanlage es nicht&uuml;berstanden. Und da die ISDN-Surfer Karte damit verbunden war, dieseebenfalls nicht. Anfangs dachte ich an einen gr&ouml;&szlig;eren Schaden,denn mein A4000 nahm Strom an, bootete aber nicht mehr. Da konnte ich sehrg&uuml;nstig sofort einen PowerMac G4 plus Scanner bekommen und ich griffsofort zu. Die Versicherung schickte einen Techniker (mit Ahnung) und alsdieser die defekte ISDN Surferkarte aus dem Amiga entfernte, bootete erpl&ouml;tzlich wieder. Aber ich hatte mich entschieden und wechselte vonAmiga zu Apple. Mit gleichem Entschluss gab ich f&uuml;r mich auch dieNoCover als Amiga-Magazin auf.<br>---<p>6. <i><font color="#007F00">Was hat Dir besonders Spa&szlig; an derNoCover gemacht und was hat Dich am meisten genervt? Gibt es etwas, wasDir besonders in Erinnerung ist und wo von Du berichten kannst?</font></i><p>Diese Frage ist wirklich schwer zu beantworten. Schlie&szlig;lich stammtdas Outfit der NoCover seit Ausgabe 64 von mir. Und so kann ich doch mitFug und Recht sagen, dass viel Herzblut von mir drinnen steckt. Jetzt eineAbw&auml;gung machen, was war negativ, was war positiv..... diesen Gedankenm&ouml;chte ich nicht zu Ende spinnen. Wollen wir es dabei belassen?<br>---<p>7. <i><font color="#007F00">Du hast ja nach der NoCover schon wiederein neues Online-Magazin geplant. Wie kam es dazu und k&ouml;nntest Duuns bitte mal Genaueres dazu berichten?</font></i><p>Ganz ehrlich, es ist kein neues Magazin, sondern mehr oder weniger derNachfolger der NoCover. Nach &Uuml;berlegung und Vorschlag w&auml;hle ichden Namen "<b>NewCover</b>" und werde auch dieses Magazin auf der Website"nc-mag.de" neben der NoCover als separates Magazin installieren. Der gr&ouml;&szlig;teUnterschied zur NoCover ist, dass das neue Magazin rein textbasiert ist,also ganz ohne Grafiken und Bilder. Die NoCover gab es in letzter Zeitauch zus&auml;tzlich als Textausgabe. Sie bleibt aber weiterhin in HTMLund demgem&auml;&szlig; mit jedem Browser aller Systeme lesbar.<p>Auch wenn ich mit der NewCover textbasiert arbeite, soll es trotzdemein Bindeglied zwischen Sehenden und Blinden sein und nicht als "Blindenzeitung"abgestempelt werden. Es ist halt so, dass derzeit fast 75% der Empf&auml;ngerder monatlichen Ausgaben blind sind und dem m&ouml;chte ich halt Rechnungtragen.<br>---<p>8. <i><font color="#007F00">H&auml;ttest Du Dir gew&uuml;nscht, dasses die NoCover noch weiterhin gibt? H&auml;ttest Du &uuml;berhaupt gedacht,dass es das Online-Magazin so lange geben w&uuml;rde? Gab es Momente, woDu die NoCover am liebsten schon viel fr&uuml;her sofort eingestampft h&auml;ttest?</font></i><p>Zum dritten Teil der Frage kann ich ganz ehrlich sagen: Nein. Zum erstenTeil m&ouml;chte rein gef&uuml;hlsm&auml;&szlig;ig sagen: Ja. Aber dieVernunft, die Vernunft, die Vernunft.......&nbsp;<br>Die Arbeit f&uuml;r die echten f&uuml;nf Aktiven ist wirklich vielzu intensiv. Und ein Magazin in zwei verschiedenen Ausgabeformen herauszugeben,ist gelinde gesagt auf Dauer fast wie Wahnsinn. Deswegen hat ja auch dieVernunft gesiegt. Und die Frage nach der Langlebigkeit habe ich im Fr&uuml;hjahrnoch mit tiefer Inbrunst bejaht. Aber das war vor dem Blitzschlag.<br>---<p>9. <i><font color="#007F00">Hast Du eine Sch&auml;tzung, wie viele Menschen wohl die NoCover zu ihren Bestzeiten gelesen haben, als Du sie zusammen gestellt hast? Wird man die alten NoCover-Ausgaben noch lesen k&ouml;nnen und wenn, dann wo?</font></i><p>Eine Sch&auml;tzung ist wirklich nicht m&ouml;glich. Andreas hat zuseiner Zeit teilweise bis zu 250 Mitglieder, die die Disketten bekamen.Kurz vor dem Schlie&szlig;en des Clubs mit der Ausgabe 92 waren es etlicheweniger. Kilian Servais, der das Magazin als Online Magazin weiterf&uuml;hrtehatte ca 50 Mailempf&auml;nger und f&uuml;nf Diskettenempf&auml;nger. MitNummer 103 habe ich dann die NoCover &uuml;bernommen und habe heute 26LHA und 15 ZIP-Empf&auml;nger f&uuml;r die Originalausgabe mit Bildern.Zwei User, die nicht Online sind, bekommen von Martin Voepel eine CD perMonat zugesandt. Nun wei&szlig; ich aber wirklich nicht, wieviele Downloaderund Onlineleser bei Andreas auf der Website www.apc-tcp.de und wievielebei dir Cord auf der Website www.nc-mag.de sich pro Monat einloggen. Danngibt es glaube ich noch weitere Spiegelungen auf BLINDzeln.de. Und es gibtja noch zus&auml;tzlich der Upload auf das Aminet.<p>Die Zahl der blinden Empf&auml;nger der textbasierten Version der NoCoverbel&auml;uft sich bald auf 200 Adressen.<br>---<p>10. <font color="#007F00"><i>Und nun m&ouml;chte ich Dich noch um dieInterview-typischen letzten Zeilen an unsere Leser bitten..</i>.</font><p>Muss das denn sein? Also gut. Ich sage nicht, dass es mir unendlichleid tut, weil ich das Magazin NoCover einstelle. Amiga-User sollten nunverst&auml;rkt bei Andreas auf seiner Website www.amigafuture.de reinschauen.Die anderen, die Comic lieben, sind bei Thomas Weber www.fantasysaga.degut aufgehoben. Ja und alle anderen k&ouml;nnen und d&uuml;rfen weiterhinArtikel, Geschichten, Berichte und und und bei mir einreichen, aber haltbar jeglicher Bilder und Grafiken. Vielleicht gibt es noch jemand, derdie NoCover im alten Gewande weiterf&uuml;hren m&ouml;chte, er muss sichhalt nur melden.<p>Allen NoCover-Lesern w&uuml;nsche ich f&uuml;r die Zukunft alles Guteund vielleicht kommt der AmigaOne doch noch und nicht nur in Beta-Beta-Beta-Version.<br>---<p><i><font color="#007F00">Ich danke Dir ganz herzlich im Namen allerLeser und Schreiber f&uuml;r Deine Arbeit und dass wir uns so lange &uuml;berdieses sch&ouml;ne altehrw&uuml;rdige Online-Magazin freuen durften. Wirwerden die NoCover in bester Erinnerung behalten.</font></i><p><i><font color="#007F00">Cord Hagen</font></i></td></tr></table></body></html>