<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Buchbesprechung</font></font></b></h1></center><font size=+1>Buchtitel: <b>Die Zeitmaschine</b></font><br><font size=+1>Autor: <b>Wells, Herbert G.</b></font><br><font size=+1>Vorgestellt von: <b>Gimli</b></font><br><font size=+1>Verlag: <b>H&ouml;rbuchproduktionen</b></font><br><font size=+1>Erscheinungsjahr: <b>2000</b></font><br><font size=+1>ISBN: <b>3896141996</b></font><br><font size=+1>Format: <b>Audio</b></font><p><b><font size=+1>Inhalt:</font></b><br>Im London des ausgehenden 19. Jahrhunderts treffen sich einige Herrenregelm&auml;&szlig;ig zum Dinner. Eines Abends beginnt der Gastgeber, denG&auml;sten seine Vorstellungen von Raum und Zeit zu erkl&auml;ren. Erlegt dar, dass man sich zwar im Raum bewegen kann, aber es bisher nochnicht m&ouml;glich war, sich auch in der Zeit zu bewegen. Schlie&szlig;licher&ouml;ffnet er der Gesellschaft, dass es ihm gelungen ist, eine Maschinezu konstruieren, mit der eine Reise in der Zeit m&ouml;glich ist. Dem ungl&auml;ubigenPublikum stellt er ein Modell einer Maschine vor, die nach Bet&auml;tigungeines Hebels verschwindet. Schlie&szlig;lich zeigt er den G&auml;sten eineMaschine, mit der er selbst reisen m&ouml;chte.&nbsp;<p>Als sich die Herren eine Woche sp&auml;ter wieder treffen, erscheintder Gastgeber versp&auml;tet und beginnt, die Geschichte seiner erstenZeitreise zu erz&auml;hlen. Sie f&uuml;hrt ihn in das Jahr 802701. Dort,wo einst London war, erstreckt sich nun ein h&uuml;geliges Land mit reicherVegetation. Die Menschen leben in gro&szlig;en und pr&auml;chtigen Pal&auml;sten.Sie sind reich gekleidet, kennen keine Technik, verwenden sogar das Feuernicht mehr. Da alles im &Uuml;berfluss vorhanden ist, arbeiten sie nicht.&nbsp;<p>Es scheint das Paradies zu sein, in dem die Menschen nun endlich Gl&uuml;ckund Frieden gefunden haben. Doch als eines Tages die Zeitmaschine verschwindet,entdeckt der Zeitreisende brunnen&auml;hnliche Gebilde, die ihm schlie&szlig;lichden Weg in eine unterirdische Welt &ouml;ffnen. Dort entdeckt er eine andereRasse, die nur noch sehr wenig &Auml;hnlichkeit mit Menschen hat. Er machteine grauenvolle Entdeckung, die seinen Eindruck vom Paradies endg&uuml;ltigzerst&ouml;rt.&nbsp;<br>&nbsp;<br>&nbsp;<p><b><font size=+1>Anmerkungen:</font></b><br>Die Zeitmaschine von H. G. Wells ist ein Klassiker der Science Fiction.Wie in all seinen Werken setzt sich auch hier Wells mit der ViktorianischenGesellschaft des 19. Jahrhunderts auseinander. Er versucht, eine vollkommeneGesellschaftsordnung zu entwickeln. Genau hier wird das Buch auch sehrlangatmig, w&auml;hrend die Schilderung der Reise und die theoretischenAusf&uuml;hrungen zu Raum und Zeit sehr interessant sind. Besonders eindrucksvollist die Schilderung der langsam sterbenden Erde in ferner Zukunft.&nbsp;<p>Insgesamt ist das Buch lesenswert f&uuml;r jeden Fan von Science Fictionund auch f&uuml;r jeden, der sich f&uuml;r die Theorien der Wissenschaftdes ausgehenden 19. Jahrhunderts interessiert.<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander<br>&nbsp;</td></tr></table></body></html>