<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Buchbesprechung</font></font></b></h1></center><font size=+1>Buchtitel: <b>Der Richter</b></font><br><font size=+1>Autor: <b>Grisham, John</b></font><br><font size=+1>Vorgestellt von: <b>Eowyn</b></font><br><font size=+1>Verlag: <b>Heyne</b></font><br><font size=+1>Erscheinungsjahr: <b>2002</b></font><br><font size=+1>ISBN: <b>3453215060</b></font><br><font size=+1>Format: <b>Schwarzdruck</b></font><font size=+1></font><p><b><font size=+1>Inhalt:</font></b><br>Als Richter Atlee fast 80 Jahre alt ist, ruft er seine beiden S&ouml;hnezu sich, um, wie er sagt, sein Testament neu zu regeln. Der &auml;ltere,Ray, ist Juraprofessor, geschieden, f&uuml;hrt aber ein anst&auml;ndigesund solides Leben. Der j&uuml;ngere von beiden, Forrest, beh&auml;lt keinenJob sehr lange, ist drogenabh&auml;ngig, trinkt und hat schon mehrere erfolgloseEntziehungskuren hinter sich.<br>Ray ist an diesem fr&uuml;hen Abend der erste, der eintrifft, und stattein Gespr&auml;ch mit seinem Vater f&uuml;hren zu k&ouml;nnen, den selbster immer nur den Richter nennt, findet er ihn tot auf der Couch vor, friedlicheingeschlafen und wohl an einer &Uuml;berdosis Morphium gestorben, welcheser durch seine Erkrankung schon ein paar Monate hatte nehmen m&uuml;ssen.Als er sich im haus des Richters umsieht, findet er in einem Schrank mehrereKartons voll mit Geldscheinen, die insgesamt mehrere Millionen Dollar enthalten,beschlie&szlig;t aber, es f&uuml;r sich zu behalten und erz&auml;hlt auchForrest nichts, als der eine gute Stunde sp&auml;ter am haus seines Vatersankommt.<br>Das Geld wird im nachlass des Richters nicht erw&auml;hnt, als dessenVerwalter Ray eingesetzt worden ist, und so schafft Ray es aus dem hausund versteckt es. Doch bald stellt sich heraus, dass doch jemand von demGeld wei&szlig;. Ray erh&auml;lt geheimnisvolle Briefchen ohne Absender,zum Schluss sogar auf einem Briefbogen aus seinem eigenen B&uuml;ro inder Universit&auml;t, sowie auch immer wieder Fotos der, wie Ray dachte,geheimen Verstecke, an denen er die Millionen unterbringt. Und es stelltsich noch eine weitere Frage. Richter Atlee war nie sehr verm&ouml;gend.Er pflegte sein Geld zu spenden und zu verschenken, sobald es sich beiihm ansammelte, und lebte selbst in fast geizigem Lebensstil. Woher kannalso so ein Mann eine solche Geldsumme haben, wenn er sie nicht illegalerworben hat?<br>So tastet Ray sich langsam durch das leben des Richters, von dem selbster als Sohn kaum etwas wei&szlig;, und st&ouml;&szlig;t auf mehr und mehrungew&ouml;hnliche, fast unglaubliche Einzelheiten der Vergangenheit seinesVaters.<br>&nbsp;<br>&nbsp;<p><b><font size=+1>Anmerkungen:&nbsp;</font></b><br>Dies ist eines der wenigen B&uuml;cher von Grisham, in denen man einenGerichtssaal kaum von innen "sehen" wird, sondern eher die ganze zeit Rayauf seiner Reise mit dem Geld und durch das Leben seines Vaters erlebenkann. Die Fragen, die Ray - und man selbst unweigerlich auch - sich stellt,woher der Richter das Geld hat, wer nun Anspruch darauf erhebt, wer alsoau&szlig;er Ray noch davon wei&szlig;, werden lange nicht beantwortet.Man tappt den Gro&szlig;teil des Buches im Dunkeln, und die Aufl&ouml;sungfindet sich wirklich erst fast Buchst&auml;blich auf der letzten Seite,und man w&uuml;rde sie wohl kaum erwarten. Und auch wenn die Geschichtewieder zeitweise in Finanz- und Steuerangelegenheiten, den einen oder anderenProzess und Geldtransaktionen abgleitet, wird es auch f&uuml;r den, derkaum oder keine Ahnung von diesen Dingen hat, nicht langweilig. Die Geschichteselbst sorgt f&uuml;r genug Spannung, und Grisham l&auml;sst den inhaltlichvielleicht trockenen Stoff durchschaubar werden und nie &Uuml;berhand nehmen.<p>Auch als H&ouml;rbuch beim Ullstein H&ouml;rverlag, BMG Wort, oder Heyneerh&auml;ltlich, jeweils auf f&uuml;nf CDs oder vier H&ouml;rkassetten.<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander<br>&nbsp;</td></tr></table></body></html>