<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Buchbesprechung</font></font></b></h1></center><font size=+1>Buchtitel: <b>Garp und wie der die Welt sah</b></font><br><font size=+1>Autor: <b>Irving, John</b></font><br><font size=+1>Vorgestellt von: <b>Bit</b></font><br><font size=+1>Verlag: <b>Ullstein H&ouml;rverlag</b></font><br><font size=+1>Erscheinungsjahr: <b>2002</b></font><br><font size=+1>ISBN: <b>355010152X</b></font><br><font size=+1>Format: <b>Audio</b></font><p><b><font size=+1>Inhalt:&nbsp;</font></b><br>Dieser Roman f&uuml;hrt uns durch das Leben haupts&auml;chlich zweierMenschen. Da ist Jenny, Tochter einer besser gestellten Familie aus Bostonund ihr Sohn Garp. Jenny brach ihr Collegestudium ab und wurde, zum Verdrussihrer wohlhabenden Familie, Krankenpflegerin. Die letzten Jahre des zweitenWeltkrieges arbeitete sie als Schwester in einem Bostoner Krankenhaus,in das auch an der Front Verwundete Soldaten eingeliefert wurden. Obwohlsie sich ein Kind w&uuml;nschte, wollte sie sich mit keinem Mann einlassen.<p>Als dann schlie&szlig;lich Garp zur Welt kam, nahm sie einen Job alsSchulschwester an. An dieser Schule sollte ihr Garp sp&auml;ter unterrichtetwerden. Um ihm zur gegebenen Zeit bei der Wahl seiner F&auml;cher helfenzu k&ouml;nnen, besuchte sie, als Angeh&ouml;rige des Schulpersonals, kostenlosalle Kurse und beobachtete. Beim Schulringen lernte Garp seine heimlicheJugendliebe, die gleichaltrige Helen kennen. Wenn ihr allein erziehenderVater die Ringer trainierte, sa&szlig; sie dabei und las. In einem kurzenzaghaften Gespr&auml;ch, konnte Garp ihr entlocken, dass sie einen, wenn&uuml;berhaupt, Schriftsteller heiraten w&uuml;rde. Vielleicht auch einenRinger, der aber an erster Stelle Schriftsteller sein m&uuml;sse. Alsobeschloss er Schriftsteller zu werden.<p>Um dieses Ziel bestm&ouml;glichst zu erreichen, wollte er nach Europa,um sich dort weiter zu entwickeln. Jenny war klar, sie w&uuml;rde mitgehenund suchte Wien als Studienort aus. Auch sie wollte jetzt, zu Graps Verdruss,anfangen ihr Leben in einem Buch nieder zu schreiben. Es dauerte vieleMonate, bis Garp seine erste Geschichte verfasste.<p>Diese Geschichte, "Pension Grillparzer" und weitere werden im Romanerz&auml;hlt.<p>Mutter und Sohn gingen zur&uuml;ck in die Staaten. Jenny wurde mit ihremumfangreichen Buch, ‚Eine sexuell verd&auml;chtige Frau’, sie hatte in&Ouml;sterreich flei&szlig;ig geschrieben, sehr ber&uuml;hmt. Sie wurdeLeitbild einer feministischen Bewegung. Garp heiratete und bekam mit seinerFrau zwei S&ouml;hne. Garps Frau wurde Professorin und er selbst litt diemeiste Zeit an einer Schreibblockade.&nbsp;<p>Seine Geschichten und die ersten Romane fanden keinen gro&szlig;en Anklang.Er war eben der Sohn der ber&uuml;hmten Jenny. Genau wie sie, entwickelteGarp sich zu einem Exzentriker.<p>Es kam zu Freundschaften und fl&uuml;chtigen Bekanntschaften, es kamzu sexuellen Abenteuern und Experimenten, es kam zum allt&auml;glicheneinerlei und es kam zu einem gro&szlig;en Familienungl&uuml;ck.<br>&nbsp;<p><b><font size=+1>Anmerkungen:</font></b><br>Der Roman und die dort enthaltenen Geschichten werden teilweise satirisch,teilweise mit viel Ernst erz&auml;hlt. Es wird nie langweilig, auch wenn&uuml;ber viele Seiten hinweg nichts Au&szlig;ergew&ouml;hnliches passiert.John Irving schildert nach zwei dritteln des Romans die Schicksale allerbis dahin beteiligten Figuren, auch wenn diese Schicksale mit Garp nichtsmehr zu tun haben. Das ist zwar interessant, aber auch ungew&ouml;hnlich.Erst missfiel mir diese Vorabnahme einiger Ereignisse sehr. In den letztenKapiteln des Buches jedoch verstand ich und fand es einfach genial. DasBuch sollte nicht mit dem Tod eines Helden enden, sondern&nbsp;<br>mitten im Leben.<p>Ich wei&szlig; genau, durch diese Lekt&uuml;re hab ich wieder einenSchriftsteller entdeckt, von dem ich auf jeden Fall mehr lesen werde.<p>(Das H&ouml;rbuch umfasst 19 CDs)<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander<br>&nbsp;</td></tr></table></body></html>