<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF">Buchbesprechung</font></b></h1></center><font size=+1>Buchtitel: <b>Das f&uuml;nfte Evangelium</b></font><br><font size=+1>Autor: <b>Vandenberg, Philipp</b></font><br><font size=+1>Vorgestellt von: <b>Eowyn</b></font><br><font size=+1>Verlag: <b>L&uuml;bbe</b></font><br><font size=+1>Erscheinungsjahr: <b>1997</b></font><br><font size=+1>ISBN: <b>3404127064</b></font><br><font size=+1>Format: <b>Schwarzdruck</b></font><p><b><font size=+1>Inhalt:</font></b><br>Der Kunsth&auml;ndler Guido von Seydlitz stirbt bei einem mysteri&ouml;senAutounfall und l&auml;sst seine Frau Anne allein zur&uuml;ck. Als sie nachdem Unfall seine Habseligkeiten aus dem Wagen holt und sich bei der Polizeinach den umst&auml;nden des Unfalles erkundigt, erf&auml;hrt sie, dassihr Mann nicht allein war, sondern in Begleitung einer Frau. Ihre Handtaschelag noch im Auto. Sie selbst war nach drei Tagen aus dem Krankenhaus entlassenworden und Anne macht sich nun mit den Indizien aus der Handtasche aufdie Suche nach der Begleiterin ihres Mannes. Als sie die geheimnisvolleFrau jedoch findet, behauptet diese, die Handtasche geh&ouml;re ihr nichtund sie h&auml;tte auch Annes Mann nicht gekannt.<p>Bei den Besitzt&uuml;mern ihres Mannes findet Anne unter anderem aucheine Kamera mit gut 20 Fotos, die sie entwickeln l&auml;sst, und eine Kartef&uuml;r eine Oper, wo sie doch selbst gut genug wei&szlig;, dass Guidosolche Veranstaltungen nicht mochte. So geht sie selbst zu dieser Vorstellungin der Hoffnung, die Frau zu treffen, mit der sie sich von ihrem Mann betrogenglaubte. Stattdessen taucht nur ein namenloser Mann auf, der ein KundeGuidos zu sein scheint. Es geht um ein nicht n&auml;her benanntes Pergament,das sich wohl in Guidos besitz befinden sollte, und das dieser Mann f&uuml;rletztendlich eine dreiviertel Million erwerben m&ouml;chte. Als Anne dieFotos aus der Kamera entwickeln l&auml;sst, stellen sie sich als Bildervon scheinbar jenem besagten Pergament heraus. Da sie endlich wissen m&ouml;chte,worin ihr Mann wohl verstrickt war und ob dies etwas mit seinem Unfallzu tun h&auml;tte, macht sie sich mit einigen der Kopien zu Experten f&uuml;raltert&uuml;mliche Schriften auf, um mehr &uuml;ber die Schriftzeichen,ihre Bedeutung und vielleicht das Alter des Pergamentes zu erfahren. Dochdie Menschen, die sie aufsucht, kommen entweder auf eigent&uuml;mlicheWeise ums leben oder verschwinden Tage nach ihrem besuch spurlos.<p>Und auch Anne selbst befindet sich in Gefahr, denn nicht nur ein geheimnisvollerOrden, der seinen Sitz in Griechenland gut versteckt am Olymp haben soll,sondern auch die Kirche selbst, sowie Islamische Organisationen scheinenhinter dem Schriftst&uuml;ck her zu sein.<p>Unerwartet erh&auml;lt sie zwar Hilfe von einem Alten Freund ihres Mannes,doch auch er kann nicht wirklich dazu beitragen, das Geheimnis zu l&uuml;ftenund ger&auml;t, genau wie Anne eher selbst in Gefahr.<br>&nbsp;<p><b><font size=+1>Anmerkungen:</font></b><br>Das Buch besch&auml;ftigt sich sehr stark mit der christlichen Religionund ihrer Geschichte. man erf&auml;hrt irgendwann vom so genannten f&uuml;nftenEvangelium, welches das erste sein soll, das eigentliche „urevangelium“,welches Math&auml;us, Lukas, Markus und Johannes vorausging und wohl voneinem Zeitzeugen geschrieben sein soll. Es k&ouml;nnte und w&uuml;rde 2000Jahre Kirchengeschichte auf den Kopf stellen, weshalb die Kirche es unbedingtin die H&auml;nde bekommen will, ebenso wie die Moslems, da es ihren gr&ouml;&szlig;tenFeind entmachten w&uuml;rde. Der geheimnisvolle Orden aus Griechenlandverfolgt seine Ziele, die allein schon aufgrund des Profils und der Geschichteder Organisation selbst gef&auml;hrlich sind.<p>Die Diskussion um ein solches Evangelium ist tats&auml;chlich nichtneu, sondern authentisch, und auch in diesem Buch wird die Kirche wiederals eine Institution dargestellt, die mehr wei&szlig;, als sie preisgibtund beweise f&uuml;r solche und andere Gegenst&auml;nde, Begebenheitenund Schriften zur&uuml;ckh&auml;lt, die den Vatikan bis in die Grundfestenersch&uuml;ttern k&ouml;nnten.<p>Der Erz&auml;hlstil ist in diesem buch nicht das fesselnde. Meist wirktdas ganze eher wie ein bericht, denn wie ein Roman, und was das Buch sointeressant macht, sind die Fakten und historischen Zusammenh&auml;nge,von denen man erf&auml;hrt. Wer bereits andere B&uuml;cher von Vandenberggelesen hat, wird wissen, wie intensiv der Schriftsteller sich stets &uuml;berden Gegenstand seiner Erz&auml;hlungen und Abhandlungen informiert, undauch wenn einen dieses Werk nicht durch seine stilistische Brillanz fesselt,kommt man nicht recht davon weg, nicht weil man wissen m&ouml;chte, wasnun mit den Protagonisten des Romans geschieht, sondern weil man sich fragt,was man noch erfahren wird, denn trotz der Ansammlung von Fakten und Erl&auml;uterungenist dieses Buch ganz und gar nicht trocken und wirklich lesenswert.<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander<br>&nbsp;</td></tr></table></body></html>