<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [LESE-ECKE ] -  Vatikan</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#000080"><font size=+4>Buchbesprechung</font></font></b></center><p><font size=+1>Buchtitel: <b>Vatikan</b></font><br><font size=+1>Autor: <b>Knopp, Guido</b></font><br><font size=+1>Vorgestellt von: <b>Gimli</b></font><br><font size=+1>Verlag: <b>Goldmann</b></font><br><font size=+1>Erscheinungsjahr: <b>1998</b></font><br><font size=+1>ISBN: <b>3442150078</b></font><br><font size=+1>Format: <b>Schwarzdruck</b></font><p><b><font size=+1>Inhalt</font>:&nbsp;</b><br>Als im Fr&uuml;hjahr 1939 Eugenio Pacelli zum Papst gew&auml;hlt wurde,trat er als Pius XII ein schweres Amt an. Europa stand kurz vor dem Ausbruchdes zweiten Weltkrieges. Da er schon einmal 1917 als Friedensstifter gescheitertwar und auch das Konkordat mit dem Dritten Reich ausgehandelt hatte, wahrteer nun strikte Neutralit&auml;t. Aus diesem Grund lie&szlig; er eine Enzyklikagegen den Antisemitismus seines Vorg&auml;ngers Pius XI in den Archivenverschwinden. Fortan &auml;u&szlig;erte er sich nur zaudernd und leisezum Holocaust und V&ouml;lkermord, was ihm den Vorwurf des Schweigens einbrachte.&nbsp;<p>W&auml;hrend Pius XII &uuml;berwiegend Kritik und Unverst&auml;ndniserntete, wurde sein Nachfolger Johannes XXIII allgemein geliebt. Als &Uuml;bergangspapstund Verlegenheitsl&ouml;sung l&ouml;ste der Sohn armer Bauern im Jahr 1960mit seiner Ank&uuml;ndigung des zweiten Vatikanus einen Erdrutsch in derKirche aus. "Ich will Fenster und T&uuml;ren &ouml;ffnen, damit frischeLuft ins Kirchenschiff kommt". Mit dem Konzil sollten weitreichende Reformenin der Kirche durchgesetzt werden. Doch noch vor Abschluss starb Johannes.<p>Da sich eine Kluft zwischen Traditionalisten und Reformern aufgetanhatte, w&auml;hlten die Kardin&auml;le den auf Ausgleich bedachten GiovanniMontini zum neuen Papst, der sich Paul VI nannte. Nachdem er das Konzilerfolgreich zum Abschluss gebracht hatte, unternahm er als erster PapstReisen u. a. nach Indien und betrat als erster Pontifex das Heilige Land.Er suchte auch nach Auss&ouml;hnung mit der Ostkirche. Doch sein Pontifikatwurde &uuml;berschattet durch die "Enzyklika Humanae Vitae", die er 1968erlie&szlig;. In diesem Werk verdammte er jegliche Empf&auml;ngnisverh&uuml;tung.Was ihm massive Kritik einbrachte und auch die Bezeichnung "Pillen-Paule".&nbsp;<p>Als Paul VI zur&uuml;ckgezogen im August 1978 starb, herrschte &uuml;berseine Nachfolge Ratlosigkeit. So wurde als &Uuml;bergangsl&ouml;sung deraus &auml;rmlichen Verh&auml;ltnissen stammende Albino Luciani gew&auml;hlt,der als erster mit Johannes-Paul einen Doppelnamen w&auml;hlte. Er gingals l&auml;chelnder Papst in die Geschichte ein. Mit den Worten "der Herrm&ouml;ge euch vergeben, was Ihr mir angetan habt" kommentierte er seineWahl zum Papst. Doch nach nur 33 Tagen starb er. Es machte sich gro&szlig;eBest&uuml;rzung und Trauer breit. Doch schon am Tag nach seinem Tod kamenerste Zweifel auf. War er wirklich eines nat&uuml;rlichen Todes gestorben?&nbsp;<p><b><font size=+1>Anmerkungen</font>:&nbsp;</b><br>Der Autor ist promovierter Historiker und langj&auml;hriger Leiterdes Ressorts Zeitgeschichte beim ZDF. F&uuml;r seine Dokumentationen wurdeer vielfach ausgezeichnet und bekam schlie&szlig;lich 1990 das Bundesverdienstkreuz.Das Buch umfasst den Zeitraum vom Amtsantritt Pius XII 1939 bis zur zweitenPastoralreise von Johannes-Paul II 1996 nach Deutschland. In gut verst&auml;ndlicherSprache beschreibt und charakterisiert Guido Knopp die Personen und schildertdie Lebensl&auml;ufe der verschiedenen P&auml;pste und die Umst&auml;ndeihrer jeweiligen Berufungen. Anschaulich schildert er den vergeblichenVersuch von Pius XII, diplomatisch zu vermitteln, die Aufbruchstimmungunter Johannes XXIII, das Scheitern von Paul VI, die merkw&uuml;rdigenUmst&auml;nde des Todes von Johannes-Paul I und schlie&szlig;lich auchdie Widerspr&uuml;che des aktuellen Amtsinhabers.&nbsp;<p>F&uuml;r jemanden, der sich mit der Thematik noch nicht so besch&auml;ftigthat, bietet das Buch viel neues, zumal auch bisher unver&ouml;ffentlichteDokumente zitiert werden.&nbsp;<p><b><font size=+1>[NUNTIUS]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander&nbsp;</td></tr></table></body></html>