<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Buchbesprechung</font></font></b></h1></center><font size=+1>Buchtitel: <b>Warum M&auml;nner nicht zuh&ouml;ren und Frauenschlecht einparken k&ouml;nnen</b></font><br><font size=+1>Autor: <b>Pease, Allan und Barbara</b></font><br><font size=+1>Vorgestellt von: <b>Eowyn</b></font><br><font size=+1>Verlag: <b>Ullstein Tb</b></font><br><font size=+1>Erscheinungsjahr: <b>2002</b></font><br><font size=+1>ISBN: <b>3548363547</b></font><br><font size=+1>Format: <b>Schwarzdruck</b></font><p><b><font size=+1>Inhalt:</font></b><br>Dieses Buch ist viel weniger ein Roman, als eine Abhandlung, aber dassollte niemanden abschrecken. Allan und Barbara Pease besch&auml;ftigensich in diesem Buch mit den Unterschieden zwischen M&auml;nnern und Frauen.Nicht, wie man es denken mag, der ist besser als die, oder umgekehrt, siesuchen die Ursache f&uuml;r die besseren oder schlechteren F&auml;higkeitenauf bestimmten Gebieten in der Biologie und Evolution.<p>Warum k&ouml;nnen Frauen meist drei Dinge gleichzeitig tun, w&auml;hrendM&auml;nner oftmals aus der Haut fahren, wenn man sie nur bei einer einzigenAufgabe durch etwas aus dem Konzept bringt? Warum sind Frauen meist schlechtereKartenleser und f&uuml;r M&auml;nner h&auml;ufig nervenaufreibende Mitfahrer,da sie beim Wegweisen oft nicht auf den Unterschied zwischen links oderrechts achten? Warum sind M&auml;nner h&auml;ufig bessere Mathematikeroder Techniker als Frauen, und warum k&ouml;nnen Frauen manchmal mit VorliebeStundenlang telefonieren? F&uuml;r all das suchen die beiden eine Begr&uuml;ndungund greifen dabei nicht nur auf Erfahrungen oder Aussagen einiger Leutezur&uuml;ck, sondern ziehen auch wissenschaftliche Untersuchungen und Ergebnisseaus mehreren Jahrzehnten zu Rate.<p><b><font size=+1>Anmerkungen:</font></b><br>Wer sich an das Buch heranwagen m&ouml;chte, sollte gleich vorgewarntsein. Jeder bekommt etwas ab, ob Mann oder Frau. Ich habe, als ich dasBuch gelesen habe, doch recht oft schmunzeln m&uuml;ssen. die beiden Autorengreifen, um ihre Ansichten und Ergebnisse zu erkl&auml;ren, doch rechtoft auf Alltagssituationen zur&uuml;ck, die jeder in irgendeiner Form schonmal erlebt hat, der eine, ohne dar&uuml;ber weiter nachzudenken, der andere,um sich dabei an den Kopf zu fassen. Was die beiden in ihrem Buch auchsagen ist, sie m&ouml;chten damit zwischen M&auml;nnern und Frauen einbesseres Verst&auml;ndnis erreichen. Hier einmal ein Beispiel:<p>"Er f&auml;hrt, sie sagt ihm, wo er lang fahren muss. Gerade hattensie eine kleine Auseinandersetzung, weil sie ihm gesagt hatte, er sollelinks abbiegen, obwohl sie eigentlich rechts meinte. Nach neun MinutenSchweigen beginnt er den Verdacht zu hegen, dass etwas nicht stimmt.&nbsp;<br>"Liebling... ist alles in Ordnung?" fragt er.<br>"Nat&uuml;rlich, alles bestens." gibt Lyn zur&uuml;ck.<br>Die Betonung des Wortes "bestens" l&auml;sst darauf schlie&szlig;en,da&szlig; das genaue Gegenteil der Fall ist. Er l&auml;sst sich den Abendnoch mal durch den Kopf gehen.<br>"Habe ich heute Abend etwas falsch gemacht?"<br>"Ich will nicht dar&uuml;ber reden!" bellt sie ihn an. Das bedeutet,da&szlig; sie ver&auml;rgert ist und dar&uuml;ber reden will. Er dagegenwei&szlig; beim besten Willen nicht, was er jetzt schon wieder angestellthat, um sie so zu ver&auml;rgern.<br>"Aber - was habe ich denn getan?" fragt er verwirrt. "Ich habe keineAhnung, was ich falsch gemacht habe." Meistens sagt der Mann bei einerUnterhaltung wie der obigen die Wahrheit. Er versteht wirklich nicht, wodas Problem liegt.<br>"Also gut", sagt sie. "Ich werde dir sagen, was los ist, obwohl duruhig aufh&ouml;ren k&ouml;nntest, dich dumm zu stellen!"<br>Doch er stellt sich nicht dumm. Er wei&szlig; tats&auml;chlich nicht,woher der Wind weht. Sie holt tief Luft. "Den ganzen Abend war dieses Flittchenhinter dir her und hat mit dir geflirtet, da&szlig; einem schlecht werdenkonnte, und du hast nicht das kleinste bisschen unternommen, um sie loszuwerden- im Gegenteil:<br>Du hast sie auch noch ermuntert!" Chris f&auml;llt aus allen Wolken.Welches Flittchen denn, um Himmels willen? Er, geflirtet? Wann denn? Davonhat er nichts bemerkt. W&auml;hrend seiner Unterhaltung mit dem "Flittchen"(das ist &uuml;brigens eine Bezeichnung, die haupts&auml;chlich von Frauenverwendet wird, ein Mann w&uuml;rde eine Frau mit derartigem Verhaltenals "sexy" bezeichnen) war ihm nicht aufgefallen, da&szlig; sie ihm ihrBecken entgegengeschoben, mit ihrem Fu&szlig; in seine Richtung gedeutet,ihr Haar zur&uuml;ckgeworfen, sich mit der Hand &uuml;ber ihren Oberschenkelgefahren, sich die Ohrl&auml;ppchen geknetet, ihm lange Blicke zugeworfen,den Stiel ihres Weinglases gestreichelt und wie ein Schulm&auml;dchen geredethat. Der Mann ist ein J&auml;ger. Er kann ein Zebra am Horizont ausmachenund einem sagen, wie schnell es sich fortbewegt. Er hat aber nicht dieAntennen einer Frau, um visuelle Signale und Laut&auml;u&szlig;erungensowie die K&ouml;rpersprache von jemandem zu registrieren, der flirtet.Alle Frauen auf der Party haben gesehen, was das "Flittchen" vorhatte,ohne auch nur den Kopf drehen zu m&uuml;ssen. Eine telepathische "Flittchen-Warnung"ist ausgesendet und von allen anwesenden Frauen empfangen worden. An denmeisten M&auml;nnern ist sie jedoch komplett vorbeigegangen. M&auml;nnerhaben kein Auge f&uuml;r Details. "<p>Das Buch ist voll von solchen Situationen, und der eine oder anderewird sicher Antworten auf seine kleinen und gro&szlig;en Fragen &uuml;berdas andere Geschlecht finden. Man muss kein Neurobiologe oder Verhaltensforschersein, um die Erkl&auml;rungen zu verstehen, und damit haben Allan und BarbaraPease meiner Meinung nach ein Buch geschrieben, dass zu lesen sich f&uuml;rviele lohnen wird.<p>Dieses Buch erschien im September 2003 als H&ouml;rbuch im UllsteinH&ouml;rverlag und umfasst 3 CDs.<br>SBN: 3550090935<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander</td></tr></table></body></html>