<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Buchbesprechung Lese-Ecke</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#000080"><font size=+4>Buchbesprechung</font></font></b></center><p><font size=+1>Buchtitel: <b>Die Augen des Drachen</b></font><br><font size=+1>Autor: <b>King Stephen</b></font><br><font size=+1>Vorgestellt von: <b>Eowyn</b></font><br><font size=+1>Verlag: <b>Heyne</b></font><br><font size=+1>Erscheinungsjahr: <b>1995</b></font><br><font size=+1>ISBN: <b>3453084020</b></font><br><font size=+1>Format: <b>Schwarzdruck</b></font><p><b><font size=+1>Inhalt:&nbsp;</font></b><br>„In einem K&ouml;nigreich namens Delain lebte einst ein K&ouml;nig,der hatte zwei S&ouml;hne. Delain war ein sehr altes K&ouml;nigreich, undes hatten dort Hundert von K&ouml;nigen regiert, vielleicht sogar Tausende;wenn gen&uuml;gend Zeit verstrichen ist, k&ouml;nnen nicht einmal Historikersich an alles erinnern. Roland, der G&uuml;tige, war weder der beste nochder schlechteste K&ouml;nig, der das Land bisher regiert hatte.“<p>Und so beginnt Stephen King, vom diesem K&ouml;nigreich und seinem Herrscherzu erz&auml;hlen. Es ist ein M&auml;rchen, wie wir es kennen, mit allem,was dazu geh&ouml;rt. Roland ist schon fast &uuml;ber seine besten Jahrehinaus, als er auf Dr&auml;ngen seiner Ratgeber eine Junge Frau heiratet,da er noch immer keinen Erben hat. Nun zeugt er mit dieser Frau zwei Kinder,t&ouml;tet in dieser zeit einen Drachen, wie es sich f&uuml;r ein richtigesM&auml;rchen geh&ouml;rt. Es gibt sogar den dazu passenden HofzaubererFlagg, und damit h&ouml;rt das m&auml;rchenhafte auf. Wie alt Flagg ist,wei&szlig; niemand, und man kennt ihn in diesem K&ouml;nigreich auch nurin der Gestalt, die er jetzt hat. Ein bleicher und Hagerer Mann, der Stetsim dunklen Kapuzenmantel anzutreffen ist, seine Gem&auml;cher unterirdischnahe bei den Kerkern hat und in diesen kalten und dunklen R&auml;umen aufB&ouml;ses sinnt. Von einem K&ouml;nigreich zum anderen ist er in seinemlangen Leben schon gezogen, und er hat sie alle in Kriege, Blut und Chaosgest&uuml;rzt, wie er es auch nun mit Rolands K&ouml;nigreich vor hat.Doch inzwischen k&ouml;nnte eine Person ihm diese Pl&auml;ne zunichte machen.Die junge Frau des K&ouml;nigs. Sie ist trotz ihrer Jugend jeden Zoll eineK&ouml;nigin, intelligent, g&uuml;tig und das Volk liebt sie. sie hat gro&szlig;enEinfluss auf Roland und verdr&auml;ngt damit Flagg, der sein Ratgeber istvon seinem Platz. So leitet er schlie&szlig;lich bei der Geburt des zweitenSohnes Thomas die Hebamme an, die junge K&ouml;nigin zu t&ouml;ten. EineWeile beobachtet er das Heranwachsen der beiden S&ouml;hne, Peter, undThomas. Peter soll einst K&ouml;nig werden, und Flagg merkt bald, dasser nicht der richtige daf&uuml;r ist. Der junge ist selbstbewusst und scheinteine Abneigung gegen den Hofzauberer zu hegen, er wird, sollte er die Kronetragen, die Dienste des Alchimisten niemals annehmen und das K&ouml;nigreichselbstbewusst und allein regieren, unterst&uuml;tzt vom Volk, das Peterebenso liebt, wie es fr&uuml;her seine Mutter geliebt hat. Und so fasstFlagg einen furchtbaren Plan, durch den er sich des alten K&ouml;nigs undseines erstgeborenen Sohnes gleichzeitig entledigen und Thomas, den j&uuml;ngerenund immer etwas labileren Prinzen auf den Thron und damit unter seinenEinfluss setzen m&ouml;chte...<p><b><font size=+1>Anmerkungen:</font></b><br>Wer viele B&uuml;cher von King gelesen hat, dem wird Flagg bekanntsein. Eine Gestalt, die der Schriftsteller immer wieder aufgreift, dieaber immer Chaos und oft Tod und den Niedergang eines ganzen Reiches bedeutet,ob es nun altert&uuml;mlich ist, wie Delain, oder modern, wie die USA selbst.<p>Doch wo man in anderen M&auml;rchen oft nur K&ouml;nige und Prinzensieht, die erhaben, mutig, stark und Klug, g&uuml;tig oder b&ouml;se sind,schafft King hier wieder Menschen, die nicht nur Flagg, sondern, und vielleichthaupts&auml;chlich ihren eigenen Schw&auml;chen und Bed&uuml;rfnissen zumOpfer fallen. Sei es Roland, der im Denken immer ein wenig langsamer undvor allem viel zu simpel f&uuml;r das renkeschmiedendes Hofzauberers war,sei es sein Sohn Thomas, der immer im Schatten seines Bruders stand, beimVolk, und selbst bei der Zuneigung seines eigenen Vaters.<p>Und die, die ihn wirklich durchschauen, sind wohl seine einzigen Feinde.Es ist King gelungen, Figuren und Kulissen zu schaffen, die dem Leser nahebleiben, trotz dem das ganze anfangs und auch zwischendurch immer wiedereher wie ein M&auml;rchen anmutet. Wer Flagg kennt, wird sich denken k&ouml;nnen,was auf die Romanhelden zukommt, wer ihn nicht kennt, wird es wohl herausfinden,aber auch seinen Spa&szlig; an diesem Buch haben. Es ist fesselnd, underst buchst&auml;blich auf der letzten Seite l&ouml;st sich das ganze auf.Und wie es Kings Eigenart ist, wird auch diese Geschichte nicht v&ouml;lligbeendet.<p>Auf jeden Fall empfehlenswert, umso mehr, wenn man gern Fantasy liest.<p><b><font size=+1>[LESE-ECKE]-Homepage: http://www.leseecke.sulex24.de</font></b><br>Nadine Alexander<br>&nbsp;</td></tr></table></body></html>