<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> Das Haar</title><!-- Author = Nadine Alexander --></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><font color="#021278"><font size=+4>Das Haar&nbsp; - Teil 2</font></font></h1></center>(Fortsetzung von NC-124)&nbsp;<p>Michael brauchte schon l&auml;ngst keinen Wecker mehr. Er hatte dieUniversit&auml;t vor etwas mehr als einem Jahr verlassen, war eine Weileauf einer hoffnungslos scheinenden Jobsuche durch verschiedene Staatengereist und schlie&szlig;lich hier gelandet. Sicher war das nicht seinTraumjob und er hatte in seiner kurzen Karriere als Anwalt noch keinenGerichtssaal von innen gesehen, aber er hatte sich jetzt schon den Tagesrhythmusder ganz Gro&szlig;en angew&ouml;hnt.<br>Das hie&szlig;, er stand mit der Sonne auf und ging erst dann ins Bett,wenn der Tag schon fast zu Ende war. Lance, sein langj&auml;hriger Freund,den er schon aus dem College kannte hatte ihm gesagt, das sei normal. Under musste es wissen. Sein Vater war Anwalt, sein Bruder war Anwalt, seineMutter...<br>In den ersten zwei Jahren pflegte man sich halb tot zu arbeiten, rechnetean Stunden an, was anzurechnen war und kam spielend &uuml;ber die 70 inder Woche, was wohl auch erst nachlie&szlig;, wenn man die obere Schichtder Teilhaber erreicht hatte.<br>So stieg Mike also p&uuml;nktlich um f&uuml;nf aus dem Bett, sprangunter die Dusche und war schon eine halbe Stunde sp&auml;ter frisch rasiert,gestriegelt und geb&uuml;gelt auf dem Weg in die Kanzlei. Er hatte sichvorgenommen, mindestens zwei Jahre lang immer der Erste zu sein, der auftauchte,und wenn es ging der Letzte, der abends hinter sich die T&uuml;r schloss.Mike lebte allein und hatte daher niemanden zu Hause, vor dem er sich rechtfertigenmusste, der mit dem Abendessen auf ihn wartete, oder die Wochenenden mitihm verbringen wollte.<br>Er hielt vor dem Tor an, holte sich den obligatorischen schon-wieder-der-Verr&uuml;ckte-Blickdes Pf&ouml;rtners ab und stellte seinen Wagen auf den befriedigend leerenParkplatz.<br>Ein einziges Auto stand schon da, aber es war nur der schwarze Lincolnvon Tad, einem hoffnungslosen arbeitss&uuml;chtigen, von dem Mike vermutete,dass er mindestens drei N&auml;chte der Woche in der Kanzlei verbrachte.<br>Er betrat sein B&uuml;ro mit seiner ersten Tasse Kaffee, bedeckte seinenganzen Schreibtisch mit Akten und lie&szlig; sich auf dem veralteten Drehstuhlnieder, der knarrte und knackte, und Mike wartete wieder auf den endg&uuml;ltigenZusammenbruch dieses arg abgenutzten M&ouml;belst&uuml;ckes. Als er seinenBlick nach drau&szlig;en schweifen lie&szlig;, bemerkte er eine Gestalt,die sich zu Fu&szlig; durch das Tor n&auml;herte und gem&auml;chlich aufdas Geb&auml;ude zuschlenderte. Das konnte niemand von seinen Kollegensein, wer w&uuml;rde sich hier schon mehr als zehn Meter zu Fu&szlig; bewegen?<br>Er sch&uuml;ttelte den Kopf und w&uuml;hlte in dem Papierchaos nachder ersten Akte, mit der er sich besch&auml;ftigen wollte. Einer seiner&auml;lteren Kollegen hatte ihm diesen Fall angedeihen lassen, wohl, weiler vermutete, dass sich dort so oder so nichts herausholen lie&szlig;.<br>Mrs. Clanton, die sich von einem Vertreter eine Versicherungspolicehatte verkaufen lassen, und nun, wo Mrs. Clanton ihren ersten Schlaganfallerlitten und Folgeerscheinungen davongetragen hatte, wollte die Krankenversicherungnicht zahlen.<br>Mike hatte w&auml;hrend seines Studiums genug von diesen omin&ouml;senVersicherungen gelesen, dass er wusste, es w&uuml;rde nicht einfach sein,die Gesellschaft auf die zugesicherten Leistungen festzunageln. Meist warendie Policen derart windig aufgesetzt, hatten Schlupfwinkel und zwischenden kleingedruckten Zeilen noch kleiner gedruckte Zeilen, dass es selbstAnw&auml;lten nicht leicht fiel, dort ein wenig Boden zu gewinnen.<br>Eine Stunde sp&auml;ter erhob er sich, da er Kopien brauchte und, wieviele andere seiner Kollegen, mit dem Kopierer nicht umgehen konnte. AusRationalisierungsgr&uuml;nden hatte die Firma vor einigen Monaten neueGer&auml;te gekauft, bei denen man inzwischen zu jeder Kopie eine dazugeh&ouml;rigeAktennummer angeben musste, sodass in der Zentrale per Computer registriertwurde, zu welchem Fall die Kopie geh&ouml;rte und welchem Klienten mansie daher in Rechnung stellen konnte.<br>Seine Sekret&auml;rin war noch nicht da, die erschienen auch seltenvor halb neun, und so entschloss er sich, es mal unten bei der Rechercheabteilungzu probieren.<br>Als er aus dem Aufzug stieg, bef&uuml;rchtete er, dass es auch hierkeinen Fr&uuml;haufsteher gab. Das Licht auf dem Flur war noch nicht eingeschaltet,und auch sonst herrschte Totenstille.<br>Er warf einen Blick durch eine offene T&uuml;r, wo eine einzige Frauan ihrem Arbeitsplatz sa&szlig;, offenbar v&ouml;llig in die Lekt&uuml;reauf ihrem Bildschirm vertieft.<br>Mike r&auml;usperte sich vernehmlich.<p>Helen war wieder fr&uuml;h aus dem Haus gegangen und bemerkte, dasses von Tag zu Tag fr&uuml;her wurde. Sie schaffte es so fast immer, Marcmorgens aus dem Weg zu gehen und er verlor dar&uuml;ber nicht ein einzigesWort.&nbsp;<br>Sie hatte nun schon gut eine Stunde mit der Arbeit angefangen, warsich fast sicher, die Erste im Haus zu sein und daher v&ouml;llig versunkenin ihre Notizen von gestern, an die sie heute w&uuml;rde ankn&uuml;pfenm&uuml;ssen, als sich jemand von der T&uuml;r her laut r&auml;usperte,um ihre Aufmerksamkeit zu erregen. Sie schreckte hoch, blickte zur T&uuml;rund sah dort einen Jungen Mann stehen, in ihrem Alter, vielleicht ein wenigj&uuml;nger. Er sah unverkennbar nach Chefetage aus in seinem guten anthrazitfarbenenAnzug mit der geschmackvollen silbergrauen Krawatte. Und trotzdem wirkteer ein wenig unsicher. "Ja ?"<br>Sie drehte sich leicht auf ihrem Stuhl, um ihn besser sehen zu k&ouml;nnen,wie er da stand, an den T&uuml;rrahmen gelehnt mit einer Akte, die er einwenig linkisch von einer Hand in die andere kippte.<br>"Ich wollte eigentlich nur ein paar Kopien machen, meine Sekret&auml;rinist noch nicht da, und ich komme mit unserem Kopierer noch nicht ganz klar.Ich muss so was ja eigentlich nie selbst machen, wollte das hier aber auchnicht mehr bis halb neun abwarten, weil ich bis dahin die Akte abschlie&szlig;enund mit einem anderen Fall weiter machen wollte und da dachte ich, siek&ouml;nnten mir vielleicht..."<br>Noch ein zwei weitere Teils&auml;tze stolperten ihm so heraus, w&auml;hrendsie nur da sa&szlig;, ihn anstarrte und ihm zuh&ouml;rte, bis ihm wohlbewusst wurde, dass er redete, wie ein Wasserfall, und er den Mund wiederschloss.<br>"Guten Morgen", meinte Helen mit einem am&uuml;sierten L&auml;cheln."Ich bin Helen Worner."&nbsp;<br>Der junge Anwalt schaute ein wenig verlegen drein, kam dann auf siezu und grinste. Es war ein merkw&uuml;rdig jungenhaftes Grinsen, das nichtso recht zu den Nadelstreifen und den teuren Schuhen passen wollte. "Tutmir leid, ich bin Michael. Michael Signer."<br>Helen stand auf und deutete auf die Akte. "Also, dann zeige ich ihnenam besten gleich mal, wie das Ger&auml;t funktioniert, Mr. Signer."&nbsp;<br>Sie wandte sich um, verlie&szlig; den Raum und Signer folgte ihr denGang entlang in Richtung Kopierraum.<br>W&auml;hrend sie aufschloss und das Licht einschaltete, &uuml;berlegtesie, wer Signer wohl war. &Uuml;ber die Jahre hatte sie es nach und nachmit fast allen der Anw&auml;lte zu tun bekommen, oder hatte sie zumindestgesehen, wenn sie hektisch heruntergerannt kamen, um sich &uuml;ber mangelhafteRecherchen zu beschweren oder auf dem Weg nach Hause oder zur Mittagspausenoch daf&uuml;r zu sorgen, dass Helen und die anderen Anwaltsgehilfen sicherlichnicht an Langeweile litten, aber Signer hatte sie hier noch nie gesehen.<br>Sie schaltete den Kopierer ein, und w&auml;hrend der sich langsam erw&auml;rmte,schaute sie r&uuml;ber zu ihm.<br>Signer hatte sie offenbar schon eine ganze Weile betrachtet, und soschluckte sie die Frage herunter, wie lang er schon hier war und wendetesich dem Papiervorrat des Kopierers zu. Sie stockte ihn auf und beganndann kurz, ihm die Funktionsweise zu erkl&auml;ren.<br>"Also, sie m&uuml;ssen hier nur die Aktennummer eingeben. Das best&auml;tigensie und dann geben sie hier noch die Anzahl der gew&uuml;nschten Kopienein. Die Daten werden dann &uuml;ber Computer erfasst und dem entsprechendenKlienten in Rechnung gestellt."<br>"Sch&ouml;n", meinte Signer und rollte in gespielter Verzweiflung dieAugen.<br>"Der Abschluss des Zeitalters der Privatkopien. Man darf hier nichteinmal mehr in Ruhe seine Firma bestehlen."<br>Helen l&auml;chelte nur verhalten und wandte sich wieder dem Kopiererzu.<br>"Also, das war es schon im Gro&szlig;en und Ganzen. Lassen sie dasGer&auml;t einfach an, in einer Stunde stehen wir und die Sekret&auml;rinnenhier so oder so Schlange. Wenn sie noch Fragen haben, ich bin wieder imB&uuml;ro."<br>Signer l&auml;chelte. "Danke, ich schulde ihnen etwas. Wie w&auml;rees mit Lunch?"<br>Helen war schon fast wieder auf den Gang hinausgetreten, als sie realisierte,was er gesagt hatte und sich langsam wieder umdrehte. Er stand immer nochda und blickte sie erwartungsvoll an.<br>Er meinte es ernst, das sah sie.<br>Sie z&ouml;gerte einen Moment, doch dann sch&uuml;ttelte sie den Kopf."Nein tut mir leid, ich werde wohl viel zu tun haben, da sieht es mit einerMittagspause schlecht aus."<br>Innerlich h&auml;tte sie am liebsten losgekichert. Und es w&auml;rekein belustigtes Kichern gewesen. Sie erinnerte sich an einen Tag, an demsie mit einem ihrer Kollegen zum Mittag gegessen hatte, das war jetzt gutezwei Jahre her.<br>Marc hatte sich in einem Restaurant gegen&uuml;ber mit einem wichtigenund vor allem millionenschweren Mandanten getroffen, um genau zu sein,mit dem Vorstand eines recht gro&szlig;en, wenn auch nicht n&auml;her benanntenAutomobilherstellers, und sie war mit Stephen damals in das Caf&egrave;gegen&uuml;ber gegangen.<br>Marc hatte sie gesehen und sie, gelinde gesagt, darauf angesprochen,als er sp&auml;t abends nach Hause gekommen war.<br>Nicht nur, dass seine Frau sich mit einem anderen Mann einfach so inder &Ouml;ffentlichkeit zeigte, nein seine Mandanten, die wohl gewussthatten, dass es sich um seine Frau handelte, hatten sie auch noch gesehen.<br>"Mr. Worner, ist das nicht ihre Frau?" Die Frage musste Marc wohl peinlichgewesen sein, auch wenn ihm klar gewesen war, dass so gro&szlig;e KonzerneErkundigungen &uuml;ber den Anwalt einholten, der sie in so einem wichtigenProzess verteidigte.<br>Und als Helen wieder ohne Schmerztabletten einschlafen konnte, schworsie sich, solch einen Fehler nie wieder zu begehen.<br>Marc war ein recht konservativer Mann, und er hatte nichts dagegen,wenn Helen sich mit anderen Freundinnen traf, aber kein Mann au&szlig;erihm selbst, und schon gar nicht, wenn er ihn nicht einmal kannte, hattemit seiner Frau essen zu gehen, ob es nun drei G&auml;nge oder nur einHamburger war.<p>Mike starrte die Frau vor sich an. Sie war so alt wie er, vielleichtein wenig &auml;lter, aber unverkennbar h&uuml;bsch, auf eine zarte, fastzerbrechliche Weise. Ihr Haar war lang und Kupferrot, die Augen von einemklaren Grau und die Haut hatte dieses Porzellanwei&szlig;, das nur Blondenund rothaarigen Menschen vorbehalten war. Sie war gut einen Kopf kleinerals er, wenn nicht mehr.<br>Er glaubte ihr kein einziges Wort, hatte er doch selbst schon genugsolcher Angebote mit der Ausrede ausgeschlagen, vor Arbeit weder ein nochaus zu wissen, aber er versank f&uuml;r eine ganze Weile in ihren Anblick,bis er sah, dass sie begann, sich unwohl zu f&uuml;hlen.<br>Er r&auml;usperte sich wieder. "Schade, aber vielleicht ein anderesMal?", fragte er, ohne freilich wirklich gro&szlig;e Hoffnung zu haben.Sie l&auml;chelte, und das L&auml;cheln war wie ein zweiter Sonnenaufgang,wie es das bei Menschen meistens ist, die ihr L&auml;cheln selten zeigen.Und vielleicht war es gerade dieses L&auml;cheln, das Mike bewegen w&uuml;rde,sie ein zweites oder drittes Mal nach einem Lunch zu fragen.<p>Er hatte den halben Vormittag damit verbracht, Sekret&auml;rinnen anzubr&uuml;llenund so oder so bereits nerv&ouml;se Gehilfen durch die Archive und f&uuml;rInformationen durch die halbe Stadt zu schicken, und seine Laune bessertesich von Minute zu Minute.<br>Mit dem ersten Brandy des Tages lie&szlig; er sich nun an seinem riesigenSchreibtisch nieder, legte den H&ouml;rer neben das Telefon und starrteauf das Foto seiner Frau, welches er, wie jeder anst&auml;ndige und liebendeEhemann auf seinen Schreibtisch gestellt hatte. Freilich h&auml;tte ereigentlich keinen Bedarf gehabt, schlie&szlig;lich durfte er sich das Gesichtseiner Frau jeden Abend ansehen, nur noch jeden Abend, seit dem sie morgensimmer schon aus dem Haus war, wenn er aufstand, egal wie fr&uuml;h er sichauch aus dem Bett qu&auml;lte. Er w&uuml;rde mit ihr dar&uuml;ber redenm&uuml;ssen, wo sie neuerdings so fr&uuml;h hin verschwand, denn er wusste,dass die Arbeit in ihrer Kanzlei so fr&uuml;h noch nicht losging.<br>Er hatte sich in den letzten Wochen sehr genau umgeh&ouml;rt, und nachden Ger&uuml;chten zu Urteilen, beriet man sich zur Zeit &uuml;ber einenneuen Teilhaber. Marc hatte sehr gute Chancen, der n&auml;chste Teilhaberzu werden, und mit gerade 35 war das eine recht gute Bilanz. Er w&uuml;rdeum einiges mehr verdienen und k&ouml;nnte endlich aufh&ouml;ren, sich mitdem Kleinkram herumzuschlagen. Er w&uuml;rde sich keine umtriebige Frauleisten k&ouml;nnen, die au&szlig;er Haus sonst was unternahm, das eventuellseinem Ruf nicht gut zustatten kommen k&ouml;nnte.<br>Ja, er w&uuml;rde sich mit ihr ausgiebig unterhalten, sie fragen, wassie so fr&uuml;h au&szlig;er Haus tat und gegebenenfalls etwas dagegenunternehmen m&uuml;ssen.&nbsp;<br>Nach gut einer halben Stunde legte er den H&ouml;rer wieder auf dasTelefon, welches nat&uuml;rlich sofort zu schrillen begann. Er verzog dasGesicht und nahm ab.<br>"ja?", blaffte er seine Sekret&auml;rin unh&ouml;flich an, was allerdingsnichts ausmachte, da sie diesen Umgangston schon von ihm gewohnt war undsich wahrscheinlich gewundert h&auml;tte, w&auml;re er etwas h&ouml;flichergewesen. Tats&auml;chlich war sie in diesem Jahr bereits die dritte, diediesen Posten bei ihm angetreten hatte, da es bei ihm selten jemand l&auml;ngerals zwei Monate aushielt. Er hatte einen recht guten Verschlei&szlig;,was ihn allerdings auch nicht k&uuml;mmerte.<br>"Mr. Worner, f&uuml;r sie hat eine Miss Kellington angerufen."<br>Marc runzelte die Stirn. Wie oft hatte er diesem Weib gesagt, sie sollteihn nicht hier anrufen? Sekret&auml;rinnen verdienten offenbar die H&auml;lfteihres Gehaltes mit Tratsch, und Marc wusste genau, dass sie ihre unverdientenPausen gern damit verbrachten, gerade die privaten Anrufe f&uuml;r ihreVorgesetzten genau auszuwerten. Er konnte sich kein Gerede leisten.<br>"Danke Betty", murmelte er ein wenig abwesend, in Gedanken schon beider Standpauke, die er Rebecca w&uuml;rde halten m&uuml;ssen. Er sollteNotizzettelchen an die Frauen verteilen, da sie sich sonst scheinbar nichtsmerken konnten.<br>Er legte auf, griff nach seinem Handy - das Gespr&auml;ch musste nunnicht auch noch auf der Abrechnung seines Dienstanschlusses auftauchen- und w&auml;hlte Rebeccas Nummer.<br>Betty wunderte sich schon nicht mehr &uuml;ber das Gebr&uuml;ll, dasaus dem B&uuml;ro ihres Chefs kam, aber sie wurde von Tag zu Tag froher,wenn sie ihn nur &uuml;ber das Telefon und f&uuml;r ein zwei Diktate amTag ertragen musste. Sie war eine von den wenigen, die &uuml;ber ihrenChef nicht viel zu tratschen hatten, er schien keinerlei Privatleben zuhaben. Nicht einmal seine Frau rief hier in der Kanzlei an und dieser Anrufvorhin war der erste und einzige etwas r&auml;tselhafte.<p>"Marc, ich muss wirklich mit dir reden." Rebeccas Stimme am Telefonklang d&uuml;nn und leicht panisch.<br>Marc verzog das Gesicht. Er hasste hysterische Frauen &uuml;ber allesund h&auml;tte sofort am liebsten aufgelegt.<br>"Was kann denn so wichtig sein?", fragte er, und es war ihm deutlichanzuh&ouml;ren, dass es ihn eigentlich nicht im geringsten interessierte.<br>"Nicht am Telefon, bitte, k&ouml;nnen wir uns nicht treffen? Ich k&ouml;nnteetwas fr&uuml;her aus dem B&uuml;ro verschwinden."&nbsp;<br>Er w&uuml;rde wohl nicht Ruhe bekommen, bis sie ihr Problem nicht losgewordenwar und so beorderte er sie gegen zwei Uhr am Nachmittag zu sich nach Hause,da er wusste, dass Helen erst zwei Stunden sp&auml;ter auftauchen w&uuml;rde,fr&uuml;hestens, da sie neuerdings auch Nachmittags immer ein wenig sp&auml;tervon der Arbeit kam.<br>Kurz vor dem verabredeten Zeitpunkt sa&szlig; er mit dem vierten GlasBrandy an diesem Tag auf der Terrasse, als er h&ouml;rte, wie ihr Wagenvorfuhr. Er machte sich nicht die M&uuml;he, aufzustehen und wartete, bissie selbst nach hinten kam.&nbsp;<br>Rebecca war blass, selbst ihr sorgf&auml;ltiges Make up konnte dar&uuml;bernicht hinwegt&auml;uschen.<br>Sie lie&szlig; sich auf einem Stuhl ihm gegen&uuml;ber nieder und senkteden Blick. "Was ist denn nun los?", fragte Marc ungeduldig und lehrte denBrandy auf einen Zug. Zehn Sekunden sp&auml;ter w&uuml;nschte er sich,er h&auml;tte es nicht getan, als Becca den Kopf ein wenig zwischen dieSchultern zog, aufsah und leise erwiderte: "Ich bin schwanger."&nbsp;<br>Marc kniff die Augen zusammen und wusste f&uuml;r einen Moment nichtgenau, was er sagen sollte. Schlie&szlig;lich holte er Luft, durchbohrtesie mit einem eisigen Blick und sch&uuml;ttelte nur den Kopf.<br>"Und?"<br>Rebecca starrte ihn an, als w&uuml;rde sie ihn jetzt das erste Malsehen. "Was und?"&nbsp;<br>"Was soll ich jetzt damit zu tun haben?"&nbsp;<br>"Vielleicht, dass das Kind von dir ist?", erwiderte Becca trotzig,und der Ton gefiel ihm nicht.<br>"Und woher soll ich das wissen? Selbst wenn es so w&auml;re, ist dasdein Problem, nicht meins, oder?"&nbsp;<br>Er lehnte sich zur&uuml;ck, verschr&auml;nkte die Arme vor dem K&ouml;rperund lie&szlig; seinen Blick &uuml;ber den gro&szlig;en Garten schweifen.<br>"Du kannst mich doch damit nicht einfach im Stich lassen!", rief Rebeccaund auf ihren sonst so blassen Wangen zeigten sich das erste Mal hektischerote Flecken. In ihren Augen schwammen Tr&auml;nen und sie schien der Verzweiflungnahe.<br>Marc beugte sich mit einem kleinen aber un&uuml;bersehbar bedrohlichenL&auml;cheln vor, als wollte er sie gleich anspringen, und doch war seineStimme leise und eiskalt.<br>"Pass auf M&auml;dchen", sagte er und das L&auml;cheln wurde ein St&uuml;ckgeh&auml;ssiger.&nbsp;<br>"Ich habe dich zu nichts gezwungen und bin dir auch nicht verpflichtet.Das ist dein Problem und du solltest damit klarkommen."&nbsp;<br>Rebecca &ouml;ffnete den Mund, um etwas zu sagen, aber sie wusste daraufnichts zu erwidern. Marc sah f&ouml;rmlich,wie es hinter ihrer Stirn zuarbeiten begann und er konnte nur hoffen, dass sie nicht auf dumme Gedankenkam.<br>Sie waren hier in den tiefsten S&uuml;dstaaten, wo Image alles z&auml;hlte,und sie konnte ihm eine Menge verderben, wenn ihr dumme Ideen durch denKopf gingen.<br>"Ich werde Helen von uns erz&auml;hlen.", sagte sie pl&ouml;tzlich,und Marc h&auml;tte beinahe laut aufgelacht.<br>Helen? Mehr nicht? Das w&uuml;rde wohl kein Problem sein. Die guteHelen w&uuml;rde nicken, ein bisschen heulen, und dann h&auml;tte er Ruhe.<br>"Bitte, tu dir keinen Zwang an", erwiderte er daher nur k&uuml;hl undh&auml;tte sich sofort am liebsten selbst geohrfeigt. Er h&auml;tte ihrdie Hoffnung lassen sollen, dass dies ein wertvoller Einfall war. Wenner Pech hatte, w&uuml;rde sie jetzt nach einem besseren suchen. Doch eslohnte sich selten, den Intellekt einer Frau zu &uuml;bersch&auml;tzen,wie ihm gleich darauf aufging, denn Rebecca zuckte nur zusammen und wurdewieder ein geh&ouml;riges St&uuml;ck blasser.<br>Sie sprang stattdessen nur auf und verlie&szlig; mit unsicheren Schrittendie Terrasse, zumindest wollte sie es, doch pl&ouml;tzlich stand Helenvor ihr.&nbsp;<p>Gegen Mittag machten sich bei Helen die ersten Anzeichen b&ouml;sartigerKopfschmerzen bemerkbar, und so schob sie Martin den letzten Rechercheauftragdieses Tages zu und versprach ihm ein reichhaltiges Mittagessen in derKaffeeteria.<br>Sie w&uuml;rde nach Hause gehen, eine Tablette gegen Kopfschmerzennehmen und sich einfach f&uuml;r eine Stunde oder zwei auf die Hollywoodschaukellegen, bis Marc nach Hause kam. Doch es sollte anders laufen.<br>Sie hatte am Morgen ihren Schl&uuml;ssel im Haus vergessen, und wargerade auf dem Weg nach hinten, um den Ersatzschl&uuml;ssel aus dem Blumentopfneben der Hintert&uuml;r zu fischen, als sie pl&ouml;tzlich vor Rebeccastand. Aber was f&uuml;r eine Rebecca?!<br>Sie wirkte abgek&auml;mpft und m&uuml;de. Helen war das heute gar nichtaufgefallen, da sie Becca seit einigen Tagen nach besten Kr&auml;ften ignorierte,und Becca sah aus, als h&auml;tte sie eben noch geweint. Was war hier passiert?<br>Helen starrte Rebecca einen Herzschlag lang an und trat einen Schrittzur&uuml;ck. Ihr fiel bei aller Anstrengung nichts ein, das sie jetzt w&uuml;rdesagen k&ouml;nnen, und so beschr&auml;nkte sie sich darauf, ihre Kolleginfragend anzustarren. Becca machte nicht die geringsten Anstalten, etwaszu erkl&auml;ren, schoss an Helen vorbei und rannte nach vorn zu ihremWagen.<br>Helen folgte ihr nicht. Sie h&auml;tte es vielleicht getan, wenn siegewusst h&auml;tte, was sich dadurch alles h&auml;tte verhindern lassen.Aber so drehte sie sich ganz einfach nur wieder zu Marc um und wartete,ob er etwas erkl&auml;ren w&uuml;rde. Aber wozu? Hatte er ihr je etwasvon allein erkl&auml;rt? Ihr je auch nur ein Wort mehr gesagt, als siewissen musste? Und nach Marcs Auffassung musste sie wahrscheinlich so oderso nicht all zu viel Wissen.<br>Der Vorfall mit Rebecca blieb ungekl&auml;rt, und es war auch sonstkeine &Auml;nderung eingetreten, wenn man einmal davon absah, das Marcin dumpfes Br&uuml;ten verfiel, sobald er zu Hause angekommen war, undHelen wurde es nun noch schwerer, ein Gespr&auml;ch mit ihm zu beginnen,selbst wenn es nur um allt&auml;gliches ging.<p>So lief also alles normal, bis sie zwei Wochen sp&auml;ter die Postabholen ging.&nbsp;<br>Nein, nicht normal, nicht ganz.<br>Helen war gerade mit dem ersten Auftrag des Tages fertig, lehnte sichnun auf ihrem Stuhl zur&uuml;ck und rieb sich die Augen. Sie hatte schlechtgeschlafen und selbst drei Tassen Kaffee hatten sie nicht wach gemacht.Tats&auml;chlich rauschte es nun in ihrem Kopf und dieses Rauschen schiensie einschl&auml;fern zu wollen. Sie schaltete den Monitor ab, verlie&szlig;das B&uuml;ro und ging den Flur hinunter zum Fahrstuhl. Ein wenig frischeLuft w&uuml;rde vermutlich helfen, und so sa&szlig; sie zwei Minuten sp&auml;terauf einer Bank im Schatten einer gro&szlig;en Eiche und rauchte. Jemandkam auf sie zu und blieb direkt vor ihr stehen.<br>"&Auml;hm, Helen Worner?" Die Stimme schien von weit weg zu kommen,und Helen musste zwei mal blinzeln, bis sie den Mann vor sich erkannte.Der unbeholfene Junganwalt mit dem Kopierer, schoss es ihr durch den Kopfund sie nickte.<br>"Ja?"&nbsp;<br>"Nun mir ist heute eingefallen, dass ich ihnen noch ein Lunch schulde",sagte er und setzte sich unaufgefordert neben ihr auf die Bank.&nbsp;<br>Was nun? Sie konnte nicht schon wieder behaupten, sie h&auml;tte zuviel zu tun, er hatte es ihr sichtlich beim ersten Mal schon nicht abgenommen.Helen fand etwas interessantes zwischen ihren Schuhen, das sie nun eingehendbetrachten musste und merkte, dass er sie unverwandt ansah. Sie hob denKopf und &ouml;ffnete den Mund, um etwas zu sagen, aber was? Die Sonne&uuml;ber den B&auml;umen zeichnete flackernde Schatten auf sein Gesichtund ihr fiel auf, wie tief gr&uuml;n seine Augen waren, ein Gr&uuml;n,das man selten sah. Er verzog leicht das Gesicht.<br>"Sagen sie mir nicht, sie h&auml;tten heute schon wieder zu viel zutun. Noch mal k&ouml;nnen sie mir das nicht antun, wissen sie?" Er wirkteein wenig unbeholfen, und Helen musste gegen ihren Willen l&auml;cheln.Sein Grinsen wurde breiter und er hob den Zeigefinger.<br>"Das habe ich genau gesehen, und sagen sie mir jetzt nur noch, dassdas ein Ja gewesen ist."&nbsp;<br>Zu einem anderen h&auml;tte sie vielleicht nein sagen k&ouml;nnen,aber er sa&szlig; da neben ihr, schaute sie erwartungsvoll an, wippte einwenig nerv&ouml;s mit dem Fu&szlig; und wartete. Irgend etwas hielt siedavon ab, und so holte sie nur tief Luft und nickte.<br>"Aber wohin wollen wir denn..." Sie stockte und musste wieder an Stephedenken, Stephe, und was nach ihm und diesem unverf&auml;nglichen kleinenTreffen in der Mittagspause gekommen war.<br>"Ach, ich dachte wir fahren ins Rickys. Das ist zwar ein St&uuml;ckweiter weg, aber wirklich gem&uuml;tlich, und man kann das Essen dort tats&auml;chlichbezahlen."&nbsp;<br>Helen &uuml;berlegte. Sie kannte Rickys genau, es lag mit dem Autoeine gute halbe Stunde von hier entfernt, und vielleicht w&uuml;rden sienicht gesehen werden.<br>"Vielleicht? Ach Helen nun leidest du aber unter Verfolgungswahn, Marckann doch nicht &uuml;berall sein." Manchmal war es ganz angenehm, aufCarol zu h&ouml;ren und so nickte sie.<br>"Aber meine Mittagspause wird daf&uuml;r nie ausreichen, ich habe nureine dreiviertel Stunde."&nbsp;<br>Sie schnippte die halb aufgerauchte Zigarette in den gro&szlig;en Aschenbecher,der neben ihrer Bank stand und lie&szlig; den Blick &uuml;ber den Parkschweifen.<br>"Nun, dann vielleicht, wenn sie Feierabend haben?"&nbsp;<br>Helen drehte sich zu ihm um und sch&uuml;ttelte den Kopf. Sie konntenicht sp&auml;ter nach Hause kommen, Marc w&uuml;rde das sofort auffallen,und seine Fragen w&uuml;rden nicht angenehm aussehen, das wusste sie.<br>"Nein, ich sage einfach oben Bescheid und nehme mir eine Stunde l&auml;ngerZeit, das wird schon irgendwie gehen."&nbsp;<br>Er l&auml;chelte, zog ein wenig gedankenverloren an seinem Krawattenknotenund stand auf. "Sch&ouml;n, dann hole ich sie in einer Stunde ab."&nbsp;<br>Er drehte sich auf dem Absatz um und verschwand mit schnellen Schritten,als h&auml;tte er Angst, sie k&ouml;nnte es sich noch einmal anders &uuml;berlegen,wenn er zu lange in ihrer Reichweite blieb. Sie hob die Hand an die Stirnund sch&uuml;ttelte den Kopf. Nun konnte sie nur noch beten, dass niemand,und vor allem nicht Marc sie sah.<br>Eine Stunde sp&auml;ter erhob sie sich gerade von ihrem Platz, siehatte Martin gesagt, dass sie zur Mittagspause l&auml;nger wegbliebe, alssich die T&uuml;r einen Spalt breit &ouml;ffnete und Mike hereinschaute.&nbsp;<br>F&uuml;nf Minuten sp&auml;ter sa&szlig;en sie in seinem Auto, einerder zahllosen Rocksender lief leise im Hintergrund, und w&auml;hrend Mikesich durch den Mittagsverkehr plagte, qu&auml;lten sie sich innerhalb desAutos durch ein verlegenes Schweigen.<br>Sie unterhielten sich eine Weile &uuml;ber Unwichtiges, und Helen erfuhr,dass Mike erst seit kurzem in der Kanzlei arbeitete.<br>"Ich komme eigentlich aus Washington, aber mich hat es schon immerin den S&uuml;den gezogen und daher bin ich hier."&nbsp;<br>Helen blinzelte. Konnte es eine bessere Stadt f&uuml;r einen Anwaltgeben, als es Washington war? Die Stadt der gro&szlig;en Kanzleien, derJunganw&auml;lte, denen dort ein schneller Aufstieg leichter gemacht wurde,als sonst wo?<br>"Warum sind sie nicht dort geblieben? Sie h&auml;tten es dort dochsicher leichter gehabt als hier?"<br>Mike r&uuml;mpfte die Nase. Aber sicher h&auml;tte ich das. Ich h&auml;ttemich nur an den Onkel oder den Schwager oder sogar an meinen eigenen Vaterwenden und mich sch&ouml;n in ein gemachtes Nest setzen k&ouml;nnen. Wissensie, wenn man aus einer Juristendynastie kommt, wie es bei mir der Fallist, dann arbeitet man h&ouml;chstens noch bis zum Examen, der Rest isteine Frage von Beziehungen. Ich habe das bei vielen meiner Freunde gesehenund es irgendwie immer verabscheut. Vielleicht ist es idealistisch, aberich m&ouml;chte nur hinter einem Schreibtisch sitzen, hinter den ich michselbst gesetzt habe, auf einem Posten, den ich mir selbst erk&auml;mpfthabe, wissen sie, was ich meine?"&nbsp;<br>Helen nickte, sie wusste es nur zu genau. Vielleicht w&auml;re es beiihr nicht anders gewesen, aber sie hatte Marc im dritten Semester ihresStudiums kennengelernt, sie hatten recht schnell geheiratet und der Restwar irgendwie von selbst gekommen. Sie hatte abgebrochen, und mit ihrenmageren Referenzen hatte es bestenfalls zu diesem Job gereicht. Einer Anwaltsgehilfin,die auch den Rest ihres Lebens nichts anderes machen w&uuml;rde. so hatteMarc es gewollt.<br>"Wozu willst du arbeiten? Ich verdiene genug Geld f&uuml;r uns beide."Das hatte er gesagt, selbstzufrieden gel&auml;chelt und die Diskussiondamit abgeschlossen, bevor es &uuml;berhaupt richtig eine hatte werdenk&ouml;nnen.<br>Sie hielten vor Rickys, einem kleinen gem&uuml;tlichen Bistro mit nichtmehr als 10 kleinen runden Tischen. Sie setzten sich an einem Tisch amFenster, das nicht zur Stra&szlig;e, sondern auf einen gro&szlig;en Gartenhinaus ging, der nur abends f&uuml;r die Kunden ge&ouml;ffnet war. Helenbestellte sich ein Mineralwasser, w&auml;hrend Mike sich einen Eiskaffeebringen lie&szlig;.<br>"Nun k&ouml;nnten sie mir auch etwas &uuml;ber sich erz&auml;hlen,sonst wird es ja langsam unfair", setzte Mike mit einem halben L&auml;chelnwieder an.&nbsp;<br>"Tja, was wollen sie wissen? Ich bin eigentlich in Texas geboren. MeinVater und meine kleine Schwester sind bei einem Autounfall ums Leben gekommen,als ich gerade sieben war."&nbsp;<br>"Das tut mir leid", meinte Mike und sah auf die Getr&auml;nkekartehinab.&nbsp;<br>"Muss es nicht, f&uuml;r mich ist das ja nun eigentlich schon fastnicht mehr wahr", erwiderte Helen und lehnte sich in ihrem Stuhl ein St&uuml;ckzur&uuml;ck, um einen Blick durch den Raum zu werfen. Obwohl der Ladenfast bis auf den letzten Platz besetzt war, blieb es angenehm ruhig, nurdas unterschwellige Summen leise gef&uuml;hrter Unterhaltungen war zu h&ouml;ren.An den W&auml;nden zwischen den Fenstern standen riesige Gr&uuml;npflanzen,die Helen noch nie gesehen hatte, die aber auch leicht tropisch anmuteten,als geh&ouml;rten sie eher auf eine Karibische Insel, als hierher. DieTische und St&uuml;hle waren aus Korb und aus den verdeckt angebrachtenLautsprechern ert&ouml;nte leise kubanische Musik.&nbsp;<br>"Aber mein Leben verlief ab dem Moment nicht mehr normal", fuhr siefort und mied noch immer Mikes Blick.<br>"Meine Mutter hat das nie verwunden, bis heute nicht, denke ich, undsie hat angefangen zu trinken und Schlaftabletten zu nehmen, wann immersie welche bekommen konnte. Als ich dann mit der High School fertig war,bin ich sofort ausgezogen und war hier in der Stadt auf dem College. Ichglaube sie hat mir bis heute nie verziehen, dass ich sie allein gelassenhabe. Vielleicht hat sie es aber auch gar nicht richtig mitbekommen."<br>Mike verfluchte sich zum dritten oder vierten Mal an diesem Mittag.Er stellte ja &ouml;fter die falschen Fragen, aber heute war er ein Meisterdarin. Er musterte Helen eine Weile, die sich nicht davon abbringen lie&szlig;,die Gr&uuml;npflanzen an den W&auml;nden zu betrachten und sah erleichtert,dass der Kellner auf sie zukam, ein Tablett mit zwei Gl&auml;sern in dereinen Hand, die Speisekarte in der anderen.<br>F&uuml;nf Minuten besch&auml;ftigten sie sich mit dieser neuen Lekt&uuml;re,bis sie unsicher aufsah.&nbsp;<br>"Also, ich wei&szlig; nicht, mir kommt das hier alles doch recht teuervor..."&nbsp;<br>Ihre Stimme war z&ouml;gerlich. Mike sch&uuml;ttelte bestimmt den Kopf.&nbsp;<br>"Suchen sie sich ruhig etwas heraus, glauben sie mir, das geht in Ordnung.Und wenn sie es nicht tun, suche ich etwas f&uuml;r sie heraus."&nbsp;<br>Helen nickte und l&auml;chelte wieder leicht. Sie legte die Speisekartedemonstrativ auf den Tisch und zuckte mit den Achseln. Ein ganz leichtesund verr&auml;terisches Funkeln war in ihre Augen getreten. Er nahm siebeim Wort und bestellte f&uuml;r sie einen Muscheleintopf, als der Kellnerher&uuml;berkam.<br>"Sie essen doch Muscheln?" Helen hob die Brauen. "Keine Ahnung", antwortetesie wahrheitsgem&auml;&szlig;.<br>Bisher war sie noch nie dazu gekommen, welche zu probieren.<br>Sie musste feststellen, dass ihr die Muscheln schmeckten, und sie mussteweiter feststellen, dass Mike ihr sympathisch war. Er hatte sich etwasjungenhaftes bewahrt, etwas ungetr&uuml;bt fr&ouml;hliches, und ihm fehltediese H&auml;rte, die sonst alle Anw&auml;lte, die Helen kannte mit Inbrunstzur Schau stellten. Er begann, Geschichten aus seiner Studentenzeit zumbesten zu geben, und Helen lie&szlig; sich zu einer oder zwei Anekdotenaus dem B&uuml;ro der Anwaltsgehilfen hinrei&szlig;en, die verdeckt keineGelegenheit auslie&szlig;en, den hochwohlgeborenen Herren aus dem oberenStockwerk das eine oder andere Steinchen in den Weg zu legen.<br>Irgendwann beim Nachtisch ertappte sich Helen dabei, wie sie ausgelassen&uuml;ber einen von Mikes Witzen lachen musste, wobei ihr ein wenig Eismit einer Kirsche bei einer besonders heftigen Bewegung von L&ouml;ffel&uuml;ber den Tisch entwischte. Sie rieb sich mit einer Hand die Lachtr&auml;nenaus den Augen und fand die verr&auml;terische Frucht auf Mikes wei&szlig;emund gest&auml;rkten Hemd wieder.<br>Ein wenig von ihrem Eis klebte ihm am Kinn und sie musste Widerwillenschon wieder loskichern, obwohl ihr das Ganze wirklich peinlich war.<br>"Oh Gott, es tut mir leid, Mike, ihr Hemd", brachte sie hervor undversuchte, das Kichern zu unterdr&uuml;cken.<br>"Macht nichts", erwiderte er, und Helen sah, das er selbst lachte.&nbsp;<br>"Das sieht schlimmer aus, als es ist. Hat mich vor allem so oder sonur 5 Dollar gekostet und ich habe noch neun andere von der Sorte im Schrank."&nbsp;<br>Er wischte sich mit der Servierte das Eis vom Kinn und sch&uuml;ttelteden Kopf. "Sie sind die Erste, die mich mit Essen bewirft. Sonst bekommeich immer die Drinks ins Gesicht gesch&uuml;ttet."&nbsp;<br>Helen holte tief Luft, schwieg aber.<br>Mike bezahlte schlie&szlig;lich, und sie fuhren wieder zur&uuml;ckzur Kanzlei.<br>Als sie ausgestiegen waren und Mike das Auto abgeschlossen hatte, drehteer sich zu ihr herum und sah sie ernst an.<br>"Wissen sie, ich w&uuml;rde das gern einmal wiederholen."&nbsp;<br>Helen stand einen Augenblick nur schweigend da und sah verlegen aufihre H&auml;nde. "Ja, vielleicht", murmelte sie und blickte auf. Mike wirkteein wenig verwirrt und so setzte sie hinzu: "Ich bin verheiratet, wissensie?"<br>Er blinzelte, fing sich aber sofort wieder. "Die Welt ist so ungerecht",seufzte er dann niedergeschlagen, und trat einen Schritt auf sie zu.<br>"Ich w&uuml;rde es trotzdem gern wiederholen. Meinetwegen wieder inder Mittagspause, wenn ihnen das lieber ist, ganz unverf&auml;nglich..."<br>Helen h&auml;tte gelogen, h&auml;tte sie sich in diesem Moment einredenwollen, dass es ihr nicht &auml;hnlich ging. Sie wusste nicht, wann siesich das letzte mal ann&auml;hernd so ausgelassen und entspannt gef&uuml;hlthatte. So nickte sie. "Ich melde mich bei ihnen, in Ordnung? Das n&auml;chsteEssen geht auf mich."&nbsp;<br>Er grinste wieder sein unversch&auml;mtes Grinsen, schloss sein Autonoch einmal auf und beugte sich nach einem Kugelschreiber und einem St&uuml;ckPapier in den Wagen. Als er wieder zum Vorschein kam, reichte er ihr einenZettel, auf dem gut lesbar zwei Nummern standen.<br>"Das zweite ist meine Handynummer. Rufen sie mich einfach an und dannsehen wir weiter." Helen nickte, steckte den Zettel gedankenverloren inihre Hosentasche und schaute wieder zu ihm auf. "Danke, es hat mir wirklichSpa&szlig; gemacht", brachte sie schlie&szlig;lich ein wenig verlegen hervor,wandte sich ab und verlie&szlig; nun ihrerseits fast fluchtartig den Parkplatz.<br>Mike starrte ihr nachdenklich nach und stellte sich eine Frage, dieer in den n&auml;chsten Tagen noch &ouml;fter im Kopf haben sollte. "Wovorhat sie solche Angst?"<br>Drei Stunden sp&auml;ter stand Helen im Flur, mit der Post der letztenzwei Tage in der Hand. Marc k&uuml;mmerte sich nie darum, er verlie&szlig;sich stets darauf, dass sie die Briefe aus dem Kasten holte.<br>Inmitten der wei&szlig;en Briefumschl&auml;ge, die wohl wie immer nurRechnungen oder Werbung enthielten, lag ein einzelner hellblauer Umschlag,der zwar an Marc adressiert war, jedoch keinerlei Absender trug. Wer verwendetehellblaue Umschl&auml;ge? Und der Brief musste per Hand eingeworfen wordensein, denn neben einem Absender, der durch Abwesenheit gl&auml;nzte, befandsich auch keine Briefmarke auf dem Umschlag.<br>Helen h&auml;tte sp&auml;ter nicht sagen k&ouml;nnen, warum sie estat, zumal sie genau wusste, dass es sie viel kosten w&uuml;rde, bek&auml;meMarc mit, dass sie seine Post &ouml;ffnete, aber in diesem Moment dachtesie nicht nach. Sie ging mit dem Brief in die K&uuml;che und setzte einenKessel mit Wasser auf den Herd. Als es zu kochen begann, nahm sie den Umschlagund hielt ihn &uuml;ber den Dampf, der aus dem Kessel str&ouml;mte. Soetwas hatte sie vorher noch nie getan, und sie konnte nur hoffen, dasses klappte, sonst w&uuml;rde sie auf Nummer sicher gehen und einen anderenUmschlag nehmen, in den sie den Brief hinein tat.<br>Der etwas angeweichte Umschlag lie&szlig; sich gut &ouml;ffnen.&nbsp;<br>"Ja sag mal was tust du da eigentlich?" Das war eine kleine panischeStimme in ihrem Kopf, die Helen &ouml;fter h&ouml;rte, vor allem, wennMarc w&uuml;tend war. Eine Stimme, die ihr immer riet, sich klein zu machen,sich in eine Ecke zu verkriechen oder v&ouml;llig unverf&auml;nglich undnett zu Marc zu sein, egal was er sagte oder tat. "Zieh den Kopf ein Helen",pflegte diese Stimme zu sagen, "dann passiert dir auch nichts. Halt einfachstill und uns geht's gut."<br>Und diese Stimme rotierte jetzt wie wahnsinnig. "Wenn er das mitbekommtwenn er das mitbekommt oh wenn er das sieht er wird sauer sein er wirddir weh tun Helen er wird dir weh tun leg den Brief weg oh Gott leg denBrief weg Helen bitte..."<br>Nun war es auch zu sp&auml;t. Sie befand sich in einer eigenartigenStimmung, von der sie nicht ganz wusste, woher sie kam.<br>"Nat&uuml;rlich wei&szlig;t du das, nicht wahr? Du hattest den erstensch&ouml;nen Tag seit Jahren, und das sitzt dir ganz sch&ouml;n tief inden Knochen." Sie &uuml;berh&ouml;rte Carol und zog den Brief aus dem Umschlag.Es war ein einziger wei&szlig;er Zettel, auf dem nur sechs Worte standen.Unterschrieben war er mit "Becca", und Helen starrte v&ouml;llig verwirrtauf den Zettel.<p>Sie fuhr aus dem Schlaf hoch, einem unruhigen Schlaf - wann hatte siezuletzt ruhig und durchweg geschlafen? - und pl&ouml;tzlich wusste siees. Nat&uuml;rlich w&uuml;rde er nicht darauf anspringen, wenn sie drohte,Helen davon zu erz&auml;hlen. Becca kannte Helen nun schon eine Weile undMarc hatte in den unbedachteren Stunden ihrer kleinen und schmutzigen Aff&auml;reeiniges &uuml;ber sie erz&auml;hlt, aber es gab etwas, worauf sie ihn festnagelnkonnte, und gerade jetzt, in diesen unruhigen Minuten, in denen sie zwischenSchlafen und wachen hin und her gestolpert war, kam ihr der richtige Gedanke.<br>Sie stand auf, warf im Vorbeigehen einen Blick auf den Wecker und verzogdas Gesicht. 04:30. Nach einer ausgiebigen Dusche und dem ersten Kaffeezog sie aus dem Schr&auml;nkchen in ihrem Flur einen Hellblauen Umschlaghervor, nahm sich einen Zettel aus ihrem Notizblock und schrieb:<br>"Ich werde es deinem Chef erz&auml;hlen."<br>Sie hatte Marcs Chef nur ein einziges Mal gesehen, und diese Begegnunggab auch den Ausschlag. Sie hatten in einem gem&uuml;tlichen Restaurantgesessen, in das sie ihn geschleift hatte, und da, v&ouml;llig unerwartet,war Marcs Boss, wohl der Teilhaber, dem Marc direkt unterstellt war durchdie T&uuml;r gekommen, begleitet von drei oder vier seiner Kollegen. Erhatte Marc einen schr&auml;gen Blick zugeworfen und dieser hatte unterdr&uuml;cktgeflucht. Sp&auml;ter hatte sie erfahren, dass Marc ihm etwas von einerCousine erz&auml;hlt hatte, die auf einen kurzen Besuch in der Stadt vorbeischaute,und es war ihm wohl leidlich abgenommen worden. Marc hatte ihm einmal erz&auml;hlt,wie wichtig der Kanzlei das Ansehen ihrer Anw&auml;lte war, und das hie&szlig;,verheiratet, wenn m&ouml;glich ein Kind oder zwei, und vor allem ein sauberesNest. Keine Fehltritte, nicht von den Anw&auml;lten, und nicht in ihrerFamilie. Marc selbst hatte einen Kollegen erw&auml;hnt, einen Kollegender nie Teilhaber hatte werden k&ouml;nnen, weil er seiner Ex-Frau zu langedie Alimente verweigert und sich damit ein Verfahren eingehandelt hatte.<br>Was w&uuml;rde Marc selbst dann erst drohen, wenn das hier bekanntwurde?<br>Sie w&uuml;rde die arme, bemitleidenswerte alleinstehende Frau spielen,der Marc das Blaue vom Himmel versprochen hatte.<br>"Was? Er ist verheiratet? Mir hat er gesagt, er w&auml;re geschieden.Was soll ich jetzt nur machen?"<br>Sie sah es f&ouml;rmlich vor sich und l&auml;chelte. Es war kein humorvollesL&auml;cheln, nein, was sich hier bot, war ihre letzte Chance auf ein wenigHilfe. Sie konnte Marc schaden, das wusste sie, und er musste ihr einfachhelfen.<br>Sie konnte froh sein, wenn sie ihren K&uuml;hlschrank bis zum Monatsendef&uuml;llen konnte, und dann sollte sie sich noch um ein Kind k&uuml;mmern?Oder auch nur eine Abtreibung bezahlen?<br>Sie schob den Zettel in den Umschlag, klebte ihn zu, schrieb MarcsNamen darauf und nahm sich vor, ihn auf dem Weg zur Arbeit in seinen Briefkasteneinzuwerfen.<p>Das Telefon klingelte. Helen legte den Brief neben den Umschlag aufden K&uuml;chentisch und ging hin, um den H&ouml;rer abzunehmen.<br>"Worner?"<br>"Helen? "Sarah hier." Helen schmunzelte, wie immer klang ihre Freundin,als litte sie unter einem dauerhaften Koffeinschock.<br>"Ich wollte dich fragen, ob wir zusammen ins Kino gehen wollen. Dal&auml;uft doch dieser neue Film mit Gibson und mein Kollege hat mir seinezwei Karten f&uuml;r die Preview geschenkt, weil er und seine Frau heutekeine Zeit haben."<br>Helen &uuml;berlegte. Obwohl sie und Sarah recht nah beieinander wohnten,sahen sie sich in der letzten Zeit nur noch selten, da Marc immer mehrUnmut zeigte, wenn sie abends allein weg wollte. Sie dachte dar&uuml;bernach, als sie den Schl&uuml;ssel im T&uuml;rschloss h&ouml;rte. Die T&uuml;rwurde aufgerissen, wieder zugeworfen und schnelle Schritte n&auml;hertensich dem Wohnzimmer.<br>Mit ihrem lang trainierten Gesp&uuml;r f&uuml;r seine Stimmungen wussteHelen instinktiv, dass er denkbar schlechte Laune hatte.<br>"Marc ist gerade nach Haus gekommen, kann ich dich sp&auml;ter nochmal kurz anrufen?"&nbsp;<br>Marc war ohne ein Wort oder einen Blick in ihre Richtung an ihr vorbeiin die K&uuml;che gegangen. Am anderen Ende &uuml;berlegte Sarah kurz undmeinte dann: "Klar, aber lass dir nicht zu viel Zeit, damit ich vielleichtnoch jemand anderen finde, falls du nicht kannst."&nbsp;<br>Den Rest von Sarahs Worten h&ouml;rte Helen nicht mehr. Der Telefonh&ouml;rerwurde ihr pl&ouml;tzlich aus der Hand gerissen.<br>"Sie ruft sp&auml;ter wieder an", blaffte Marc in den H&ouml;rer undknallte ihn dann umstandslos auf die Gabel.<br>Helen wollte gerade fragen was los war als...<br>Wumm!<br>Ein unglaublicher Schmerz explodierte in ihrem Magen und sie hattesofort das Gef&uuml;hl, sich &uuml;bergeben zu m&uuml;ssen. Sie sacktezusammen und kr&uuml;mmte sich instinktiv, als er seine Finger in ihr Haarverkrallte, sie hoch riss und ihr die Faust noch einmal und diesmal fastnoch heftiger vor die Brust stie&szlig;.<br>Sie keuchte kurz, zumindest versuchte sie es, aber er hatte sie ungl&uuml;cklichgetroffen. Ein st&auml;hlerner Ring zog sich pl&ouml;tzlich um ihre Brustund eine lange Nadel schien von der Stelle ihres Brustbeins in ihren unterleibhinunterzufahren. Sie konnte nicht atmen. Wohl nicht mit Absicht, abertrotzdem nicht wesentlich weniger verheerend hatte er direkt den Solarplexusgetroffen. Ohne darauf zu achten, zerrte er sie an den Haaren in die K&uuml;cheund dort vor dem Tisch wieder nach unten, sodass sie auf die Knie gehenmusste, um dem Schmerz wenigstens ein bisschen auszuweichen. Sie versuchtekrampfhaft Luft zu holen und schaffte es, einen qu&auml;lenden und nurrecht flachen Atemzug. Wie durch einen Schleier sah sie, wie Marc etwasvom Tisch nahm und es ihr vor das Gesicht hielt. Durch die Tr&auml;nen,die in ihren Augen schwammen, sah sie nur einen verwaschenen hellblauenFleck, aber sie wusste genau, was er da in der Hand hielt.<br>"Kannst du mir sagen was das ist?" Seine Stimme klang leise und kalt,irgendwie v&ouml;llig emotionslos, kein St&uuml;ck w&uuml;tend, als w&uuml;rdees ihn wirklich interessieren, ob sie es erkannte.<br>Helen reagierte zuerst nicht. Er ruckte einmal heftig an ihren Haaren,in denen er immer noch seine Hand vergraben hatte, sodass sie mit der Stirngegen die Tischkante schlug.<br>"Ich habe dich etwas gefragt", mahnte er sie, und noch immer h&ouml;rtesie keine Wut in seiner Stimme. Sie h&ouml;rte noch immer gar kein Gef&uuml;hldarin.<br>"Ich... Ich... Ich habe ihn gesehen und... es tut mir leid... ich..."&nbsp;<br>Ihre Stimme brach und sie musste sich beherrschen, nicht zu weinen.Es wurde nur schlimmer wenn sie weinte.<br>Er zog wieder an ihren Haaren und zwang Helen damit, den Kopf unnat&uuml;rlichweit in den Nacken zu legen.<br>"Fangen wir einmal ganz von vorne an." Nun h&ouml;rte er sich an, alsspr&auml;che er mit einem ungelehrigen Kind, und eine Spur von Ungeduldschwang in seinen Worten mit.<br>"Was ist das hier?" Er lockerte den Griff, sodass sie den Kopf einSt&uuml;ck nach vorn nehmen konnte und hielt ihr wieder den hellblauenFleck vor die Nase.<br>"Ein Briefumschlag", antwortete sie fast fl&uuml;sternd, doch es schienihm zu gen&uuml;gen.<br>"Und was steht auf dem Umschlag?" Fragte er.<br>"Marc Worner." Nun fl&uuml;sterte sie wirklich.<br><hr>Fortsetzung folgt.&nbsp;<p>Nadine Alexander</td></tr></table></body></html>