<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [WASCHWEIB] Die Kreuzfahrtgewinnerin </title><!-- Author = Thea Petersen --></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><table BORDER=0 summary="" ><tr><td><b><font color="#0000EE"><font size=+3>Die Kreuzfahrtgewinnerin</font></font></b><p><font size=+1>Ich hatt' - seit mein Leben als Kind hat begonnen -</font><br><font size=+1>noch nie was geerbt und noch nie was gewonnen.</font><br><font size=+1>Nur einmal - und das war im letzten August -</font><br><font size=+1>da hab' ich' nen Spruch f&uuml;r die Werbung gewusst:</font><br><font size=+1>"Wussten Sie schon", so hab ich gekloppt,</font><br><font size=+1>"dass Knoblauch jeglichen Mundgeruch stoppt?"</font><br><font size=+1>Die Herrn der Reklame, die hatten geschrieben,</font><br><font size=+1>das h&auml;tte die Tr&auml;ne ins Auge getrieben.</font><br><font size=+1>Die Neuzeit der Werbung, jetzt h&auml;tt' sie begonnen</font><br><font size=+1>und ich eine Kreuzfahrt per Traumschiff gewonnen!</font><br><font size=+1>Ich sag zu mei'm Gatten; "Jetzt spiel nicht den Schotten,</font><br><font size=+1>wir m&uuml;ssen zum MASSA, deine Frau braucht Klamotten.</font><br><font size=+1>Auf so einem Traumschiff m&ouml;cht''' ich mich nichtsch&auml;me,</font><br><font size=+1>wir treffen da sicher die Creme de la Creme....,</font><br><font size=+1>die Haute Volaute, die Sch&ouml;nen und Reichen,</font><br><font size=+1>da muss ich doch auch mein' Garderobenschrank Zeichen.(zeigen)</font><br><font size=+1>Da tr&auml;gt man zum Fr&uuml;hst&uuml;ck schon Blusenund R&ouml;cke,</font><br><font size=+1>Bikinis und Tangas zum Sonnen an Decke....</font><br><font size=+1>und mittags zum "Lunchen" - wir nennen das essen -</font><br><font size=+1>da brauchst du dann Kleider mit allen Finessen!</font><br><font size=+1>Zum Five-clock-dance-tea gibt's Cocktailkleidmoden</font><br><font size=+1>und abends zum Dinner, da ist es geboten,</font><br><font size=+1>als Dame in Abendgarderobe zu speisen,</font><br><font size=+1>sonst z&auml;hlen wir nicht zu den besseren Kreisen!</font><br><font size=+1>Auf so einem Dampfer, ich will dir's nur sagen,</font><br><font size=+1>da kann man so'n Fummel nur ein einzig Mal tragen.</font><br><font size=+1>Jetzt kannst du mal zeigen, was ich dir bedeute,</font><br><font size=+1>denn schlie&szlig;lich da sind wir ja vornehme Leute.</font><br><font size=+1>Drum brauch ich noch Pelze, Chinchilla und Nerz,</font><br><font size=+1>denn vornehme Leute haben vornehme Ferz.</font><br><font size=+1>Jetzt fehlt mir nat&uuml;rlich noch was f&uuml;r dieNacht,</font><br><font size=+1>ich hab' an erotische Strapse gedacht.....</font><br><font size=+1>Das Reizklima reizt, das sind keine Fragen,</font><br><font size=+1>da sollt' man entsprechende Reizw&auml;sche tragen.</font><br><font size=+1>Ein durchsichtig' Nachthemd, ganz sexy aus Seiden,</font><br><font size=+1>das wird eine sinnliche Stimmung verbreiten,</font><br><font size=+1>knappe BHs und schwarze Dessous,</font><br><font size=+1>diverse Artikel von Beate Uhse.</font><br><font size=+1>Ihr wisst das doch selber und werdet 's verstehe,</font><br><font size=+1>man brauch halt so Sachen nach vierzig Jahr Ehe!</font><br><font size=+1>Ich sag zu mei'm Otto; "Gib dir einen Ruck,</font><br><font size=+1>mein Hals ist so nackig, jetzt brauch' ich noch Schmuck!</font><br><font size=+1>Sch&ouml;n glitzernde Klunker, denn auffallen will ich,</font><br><font size=+1>mein Woolworth-Geschmeide, das ist da zu billig.</font><br><font size=+1>Da m&ouml;cht ich Brillanten, mitsamt Expertisen,</font><br><font size=+1>die k&ouml;nnten wir einfach bei Neckermann leasen.</font><br><font size=+1>Das ist jetzt die vornehme Art, was zu pumpen,</font><br><font size=+1>schau nicht auf den Pfennig und lass dich nicht lumpen!"</font><br><font size=+1>Mein Alter, der mault und meckert sofort,</font><br><font size=+1>und was w&auml;r' mit ihm? Sollt' er nackig an Bord?!</font><br><font size=+1>Ich sage: Mein Bester, jetzt sei einmal klug,</font><br><font size=+1>hast du nicht dein Frauchen, - ist das nicht genug?</font><br><font size=+1>Du hast noch das Hemd mit dem halbsteifen Kragen,</font><br><font size=+1>du kannst auch den Frack von der Hochzeit noch tragen,</font><br><font size=+1>die Hosen von damals sind zwar etwas kurz, (kurz)</font><br><font size=+1>die schneiden wir ab und du hast ein paar Shorts.</font><br><font size=+1>Man will sich ja auch nicht blamieren mit dem Gatten,</font><br><font size=+1>du kriegst noch'ne M&uuml;tz und zwei neue Krawatten,</font><br><font size=+1>ansonsten, da h&uuml;llst du dich besser in Schweichen,(Schweigen)</font><br><font size=+1>zwei Socken zum wechseln, die d&uuml;rften doch reichen?!</font><br><font size=+1>Und sollten die wirklich 'mal irgendwann stinken,</font><br><font size=+1>dann tauschst du ganz einfach den Rechten mit'm Linken!</font><br><font size=+1>Das mit seinen Socken verstand er sofort,</font><br><font size=+1>wir waren uns einig und konnten an Bord.</font><br><font size=+1>Als erstes wollt' ich vom Kapit&auml;n wissen,</font><br><font size=+1>ob wir uns beim Ablegen anschnallen m&uuml;ssen. -</font><br><font size=+1>Mein Gatte der fragt dann, wo wir denn so wohnen?</font><br><font size=+1>Wahrscheinlich doch wohl in den teureren Zonen.</font><br><font size=+1>"Wo ist unser Deck, das attraktive?</font><br><font size=+1>Wir haben'ne Suite mit Sex inklusive...."</font><br><font size=+1>Da meint unser K&auml;pten mit h&auml;mischer Miene;</font><br><font size=+1>"Ach Sie meinen im Keller die Sechserkabine!"</font><br><font size=+1>Am Abend am ersten, ich sag's euch ihr Kinner, (Kinder)</font><br><font size=+1>da gab's zur Begr&uuml;&szlig;ung ein Kenn-die-Leut-Dinner.</font><br><font size=+1>(Candeleigth-Dinner)</font><br><font size=+1>"Da geh ich nicht hin", meint mein Ehemann schlicht,</font><br><font size=+1>"Was soll ich da dinnern? Ich kenn' die Leut nicht!"</font><br><font size=+1>Ich sag: "Du gehst hin, da gibt's was zu knabbern,</font><br><font size=+1>sei nicht so verfressen und tu nich so schlabbern,</font><br><font size=+1>auch wenn dir das Schnitzel bei Kerzenschein schmeckt,</font><br><font size=+1>und sprich bitte Hochdeutsch und kein' Dialekt,</font><br><font size=+1>sauf nich' so viel, sonst guckst du verschwommen</font><br><font size=+1>und die merken gleich, dass wir aus .....(Ort des Vortrags)</font><br><font size=+1>kommen!"</font><br><font size=+1>Dann uns're Gesellschaft - von Bett und von Tisch.</font><br><font size=+1>so j&uuml;ngere Leute, etwas &auml;lter als ich....</font><br><font size=+1>das eine waren Grafen, das andere Professors,</font><br><font size=+1>man hat's schon gesehen es war etwas Besser's.</font><br><font size=+1>Und mit dem Herrn Graf, ich h&ouml;r's mit Entsetzen,</font><br><font size=+1>versucht mein Gebieter als hochdeutsch zu schw&auml;tzen.</font><br><font size=+1>Ich h&ouml;r' ihn noch sagen: "Oh sehen Sie Hoheit,</font><br><font size=+1>wie glatt und wie sch&ouml;n dieses Mittelmeer doleit!"(daliegt)</font><br><font size=+1>Ich werde die Kreuzfahrt bestimmt nicht vergessen,</font><br><font size=+1>wo wir waren, wei&szlig; ich nicht, aber toll war dasEssen!</font><br><font size=+1>Schon mittags gab's immer vom Feinsten das Feinste,</font><br><font size=+1>so alles was dick macht, das war das gemeinste.</font><br><font size=+1>Nur Delikatessen, es bog sich der Tisch,</font><br><font size=+1>zu "Fr&uuml;chten des Meeres" gab's au&szlig;erdem Fisch,</font><br><font size=+1>mit Aal und mit Lachs und mit Hain, solche Brocken,</font><br><font size=+1>garniert mit getr&uuml;ffelten Seeartischocken.</font><br><font size=+1>Nur eins hat gefehlt, das muss ich gesteh'n,</font><br><font size=+1>nie hab' ich von Kaviar etwas gesehen.</font><br><font size=+1>Doch daf&uuml;r gab's Brombeeren, so leicht veraspikt,</font><br><font size=+1>die wurden als Vorspeis' auf Toastbrot verdr&uuml;ckt.</font><br><font size=+1>Ich sag' zu dem Steward:" Ein Gru&szlig; an die K&uuml;ch',</font><br><font size=+1>die Brombeeren sind toll, aber schmecken nach Fisch!"</font><br><font size=+1>Mein Gatte der hat sich, ihr k&ouml;nnt's ruhig wissen,</font><br><font size=+1>am Schenkel vom Lobster 'nen Zahn ausgebissen,</font><br><font size=+1>und &uuml;ber die Austern, da war er verbittert,</font><br><font size=+1>die sind ihm zweimal im Gaumen zersplittert!</font><br><font size=+1>Seitdem zog er t&auml;glich ab 11 Uhr'nen Flunsch,</font><br><font size=+1>er h&auml;tt' lieber "Handk&auml;s mit Musik" zum Lunch!</font><br><font size=+1>Wir z&auml;hlen jetzt auch zu den besseren Kreisen,</font><br><font size=+1>doch ist es nicht einfach, so vornehm zu speisen,</font><br><font size=+1>bei tausend Bestecken und vielerlei Sitten,</font><br><font size=+1>was hatten wir uns die Gesichter zerschnitten!</font><br><font size=+1>So lie&szlig;en wir uns auf dem Traumschiff halt schulen,</font><br><font size=+1>im Schl&uuml;rfen der Austern, im Krabben entpuhlen,</font><br><font size=+1>im Schnecken enth&auml;usern, die Hummer zu knacken,</font><br><font size=+1>Langusten am richtigen Schw&auml;nzchen zu packen.</font><br><font size=+1>Wir sind sozusagen jetzt echte Gourmets,</font><br><font size=+1>- nur noch Fromage und nie wieder K&auml;s!</font><br><font size=+1>Und eines verspreche ich hier aus der B&uuml;tt:</font><br><font size=+1>Im n&auml;chstbesten Traumschiff da fahren wir mit,</font><br><font size=+1>und ihr d&uuml;rft dabei sein, das ist mein Gebot,</font><br><font size=+1>ein Hoch auf die Kreuzfahrt, denn Seefahrt tut Not!</font><br>&nbsp;<p><font size=+1>Thea Petersen</font><br><font size=+1></font>&nbsp;</td></tr></table></center></td></tr></table></body></html>