<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>USA-Reise</title><!-- Author =  Mathias Klingner --></head><body text="#000000" bgcolor="#B0B0B0" background="bg3.jpg">&nbsp;<table BORDER=0 WIDTH="100%" summary="" ><tr><td><center><table BORDER=0 WIDTH="740" summary="Formatierung" ><tr><td><b><font size=+1><a href="mm_mmx.html">zur&uuml;ck</a></font></b><table BORDER=0 WIDTH="100%" summary="Text und Bild" ><tr><td><img SRC="usa01.jpg" ALT="Reiseroute" height=344 width=360></td><td VALIGN=TOP><center><h2><b>Hier nun der Reisebericht &uuml;ber die USA-Reise</b></h2></center>Reise vom 08.06.-25.06.04 an die Westk&uuml;ste der USA - 5.471 km durchdie Bundesstaaten Kalifornien, Arizona, Utah und Nevada.<h3><b>Kurzer &Uuml;berblick</b></h3>Vom 08.06.-25.06.04 unternahm ich mit dem Reiseunternehmen FTI eine Busrundreisean die Westk&uuml;ste der USA (Titel: Erlebnis Westen). Ich reiste mitdem Mann einer befreundeten Berliner Familie, der schon &ouml;fters inden USA war. F&uuml;r mich war es die erste Reise in diese Gegend. Wirfuhren mit einem sehr gut ausgestatteten, vollklimatisierten, kanadischenReisebus insgesamt 5.471 Kilometer durch die Bundesstaaten Kalifornien,Arizona, Utah und Nevada. Es war eine sehr interessante und abwechslungsreicheBusrundreise, auf der es jede Menge Neues zu entdecken und sch&ouml;neNaturparks zu sehen gab.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge1" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa02a.jpg" ALT="" height=240 width=360><br>&Uuml;berflug der Rocky Mountains</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa02.jpg" ALT="" height=240 width=360><br>Anflug auf Los Angeles- Vorstadth&auml;user</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text1" ><tr><td><h3><b>Reiseverlauf</b></h3>Wir flogen am 08.06.04 gegen 10.30 Uhr vom Flughafen Berlin-Tegel mit einemAirbus A300-600 der Lufthansa und landeten nach einem ruhigen Flug beisch&ouml;nemWetter gegen 11.30 Uhr in Frankfurt.<p>Nachdem wir auf dem Flughafen Frankfurt zu Mittag gegessen hatten, startetenwir um 13.35 mit einer Boeing 747-400 der Lufthansa nach Los Angeles umdort gegen 16.00 Uhr Ortszeit zu landen. Da ich einen Fensterplatz, dreiReihen hinter der rechten Tragfl&auml;che hatte, konnte ich w&auml;hrenddes Fluges die sch&ouml;ne Aussicht genie&szlig;en und mit einer Digitalkameraherrliche Fotos vom Packeis &uuml;ber Gr&ouml;nland, den weiten Landfl&auml;chender USA und von den Rocky Mountains machen.<p>W&auml;hrend des Fluges wurden &uuml;ber reichlich vorhandene Monitorest&auml;ndig die Flugdaten sowie die Flugroute und zwei Spielfilme gezeigt.In der Economyclass waren die Sitzreihen im Flugzeug recht eng zusammen,so dass man mit den Beinen seine M&uuml;he hatte. Es ist daher ratsam,w&auml;hrend des Fluges wenigstens ein- bis zweimal einen kleinen Rundgangdurch den Flieger zu unternehmen, um die Beine ein wenig zu entspannen.W&auml;hrend des Fluges gab es zwei warme Mahlzeiten sowie &ouml;ftersGetr&auml;nke. Etwa zwei Stunden vor der Landung in Los Angeles erhieltenwir vom Bordpersonal die Einreise- und Zollpapiere in deutsch zum Ausf&uuml;llen.<p>Beim Landeanflug auf Los Angeles vom Pazifik aus, konnte man den K&uuml;stenstreifenund danach die ersten kleinen Vorstadth&auml;user sehen. Wir landeten ziemlichp&uuml;nktlich gegen 17.00 Uhr Ortszeit in Los Angeles. Der Flug dauerte11 Stunden und verlief sehr ruhig bei st&auml;ndig sch&ouml;nstem Sonnenschein.<p>Relativ problemlos und ohne gro&szlig;e Kontrolle passierten wir, nachdemman m&uuml;ndlich die Frage nach dem wohin und wie lange man bleiben m&ouml;chtein englisch beantwortet hatte, die Einreisekontrolle. Nachdem wir unserGep&auml;ck vom rotierenden Transportband genommen hatten gingen wir damitohne nochmalige Kontrolle durch den Zoll und waren nun in der gro&szlig;enHalle des Flughafens. Von dort aus liefen wir nach drau&szlig;en, um diein der Reiseinformation mit roter Haltezone und der Aufschrift "Hotel &amp;Courtlesy Shuttle" beschilderte Abfahrtstelle des Hotel-Shuttle zu suchen.Es kam nach kurzer Wartezeit ein Kleinbus mit der Aufschrift "Ramada-Plaza-Hotel-Shuttle",der uns kostenlos zum Hotel brachte. Im Hotel angekommen wurden wir vonder Reiseleiterin empfangen, die uns die ersten wichtigen Informationenzur Reise gab und die Zimmerschl&uuml;ssel aush&auml;ndigte. Wir hattenein komfortables Zimmer mit zwei sehr breiten Betten und gro&szlig;em Fernseher.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge2" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa03.jpg" ALT="" height=240 width=360><br>Shopping via Rodeo in Beverly Hills</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa04.jpg" ALT="" height=240 width=360><br>San Diego, Horton Plaza</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text2" ><tr><td>Am n&auml;chsten Tag unternahmen wir mit unserer Reiseleiterin, einerHoll&auml;nderin, die zwanzigj&auml;hrig in die USA ausgewandert war undsehr gut deutsch sprach, in unserem Reisebus eine Stadtrundfahrt auf derwir Hollywood, Beverly Hills und Downtown sahen. Daran anschlie&szlig;endkonnte man fakultativ einen Besuch der Universal Filmstudios beim Reiseunternehmenf&uuml;r 74,-US Dollar buchen und diese ca. 4,5 Stunden lang besuchen.Der Reisebus brachte anschlie&szlig;end die Teilnehmer zur&uuml;ck zumHotel. Wir machten von dieser M&ouml;glichkeit keinen Gebrauch. Mit demBus fuhren wir, nachdem wir einige Fotos vom Vorplatz der Universal Studiosaufgenommen hatten, zur&uuml;ck zum Hotel und unternahmen von dort ausselbst etwas. Zur Stadt Los Angeles sei vielleicht noch angemerkt, dassie, wie vielfach schon geh&ouml;rt, eine reine Autostadt ist. Es gibtkaum &ouml;ffentlichen Nahverkehr und sie ist sehr weitl&auml;ufig. Mankann zu Fu&szlig; also schlecht etwas selbst unternehmen. In der N&auml;hedes Hotels gab es aber eine Einkaufsstra&szlig;e in der sich eine gro&szlig;erEinkaufspassage befand. Dort wollten wir unter anderem auch Ansichtskartenvon Los Angeles kaufen. In der Einkaufspassage war dies aber leider nichtm&ouml;glich. Es gab nur Gl&uuml;ckwunschkarten. Ich kaufte dann im Hotel(zu leider etwas &uuml;berh&ouml;hten Preisen) 10 Karten und 10 Briefmarken,die ich am Abend auch gleich alle beschrieb und nach Deutschland abschickte.Was mir gleich am ersten Tag, selbst als Nichtraucher auffiel, war, dases keine Zigarettenwerbung, keine Zigarettenautomaten und kam Raucher aufden Stra&szlig;en gab. Auch im Hotel war kein Aschebecher zu sehen. DieButter fand man beim Fr&uuml;hst&uuml;ck &uuml;brigens als kleine, ziemlichhart gefrorene K&uuml;gelchen neben den anderen wohlschmeckenden Fr&uuml;hst&uuml;ckszutatenvor. W&auml;hrend der Reise sollte die Butter uns noch in fl&uuml;ssigemZustand und in f&uuml;r deutsche Verh&auml;ltnisse normalem Zustand begegnen.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge3" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa05.jpg" ALT="" height=240 width=360><br>Phoenix - Scottsdale, in Old Town</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa06.jpg" ALT="" height=240 width=360><br>Grand Canyon National Park</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text3" ><tr><td>Am dritten Tag unserer Reise wurden wir um 6 Uhr mit dem automatischenWeckruf per Telefon geweckt. Um 7 Uhr musste Jeder seinen Koffer gepacktvor die Hotelt&uuml;r stellen, damit dieser vom Hotelpersonal zum Reisebusgebracht werden konnte. Dort wurde er dann vom Busfahrer eingeladen. DieserAblauf war w&auml;hrend der ganzen Reise &auml;hnlich. Nur die Weckzeitwar an wenigen Tagen erst um 7 Uhr. Nach dem Fr&uuml;hst&uuml;ck fuhrenwir um 8 Uhr p&uuml;nktlich mit unserem modernen, ger&auml;umigen Reisebusnach San Diego los. Es waren bis San Diego nur 240 km. Die Fahrt ging ins&uuml;dliche Richtung &uuml;ber Anaheim, Santa Ana, San Clamente und Oceansideauf dem Highway Nr.5 bis San Diego. Unterwegs hielten wir am Pazifik f&uuml;reinen Fotostopp an.<p>Bei der Fahrt zum Hotel mussten wir an einer mitten in der Stadt, inder N&auml;he des Hafens vorbeif&uuml;hrenden Eisenbahnlinie, warten. DieSchranken waren geschlossen und es kam gerade der "Santa Fe Express" inRichtung Hafen angefahren.<p>In San Diego unternahmen wir mit unserem Reisebus eine Stadtrundfahrtauf der wir unter anderem den alten spanischen Stadtkern besichtigten.Fakultativ wurde eine Hafenrundfahrt angeboten. Wir unternahmen jedocheine weitere Stadterkundung zu Fu&szlig;, bei der wir auch vom oberstenStockwerk eines am Pazifik liegenden Hotels aus die Stadt und einen Teildes Hafens fotografierten.<p>Am n&auml;chsten Tag (4.Tag) fuhren wir schon weiter nach Phoenix/Scottsdale.Die Fahrt ging &uuml;ber das K&uuml;stengebirge, durch das Imperial Valleyzum Colorado River und nach Yuma im Bundesstaat Arizona. Wir fuhren immerauf dem Highway Nr.8 bis Gila Bend und dann auf der 85 bis Phoenix/Scottsdale.Dabei f&uuml;hrte die Stra&szlig;e oft ganz nahe an der mexikanischen Grenzeentlang. Wir durchquerten die Yuma W&uuml;ste. In der W&uuml;ste machtenwir an einer gro&szlig;en Sandd&uuml;ne f&uuml;r einen Fotostopp halt.Es waren bei Sonnenschein mehr als 40 Grad Celsius, so dass alle nach kurzerZeit von selbst in die K&uuml;hle des Busses zur&uuml;ckkamen. Wie &uuml;bernachtetenin der sogenannten Nobel-Ferienstadt von Phoenix, Scottsdale, in einemkleineren aber sehr gut eingerichteten Hotel. Im Winter kommen aus demganzen Land die Urlauber in die gro&szlig;en, luxuri&ouml;s eingerichtetenHotelanlagen. Diese Ferienanlagen bieten dem Feriengast einfach alles.Es gibt dort noble Suiten, Shopping-Galerien, Fitnesscenter, beleuchtetePools, Tennispl&auml;tze und fabelhafte Golfanlagen.<p>Unser Zimmer hatte einen Balkon. Wenn man von diesem aus in die Ferneblickte, dann sah man fern die Berge und rings um das Hotel Palmen. Manf&uuml;hlte sich wie in einer Oase in der W&uuml;ste, was ja eigentlichauch stimmte. Am Abend gingen wir zu Fu&szlig; zum nicht weit entferntenScottsdale-Old Town. Dort entdeckten wir noch viele &auml;ltere Geb&auml;udeaus der Westernzeit, eine Westernkneipe sowie auch moderne GastronomischeEinrichtungen und Souvenirgesch&auml;fte. Obwohl es Abend war, wurde estrotzdem kaum k&uuml;hler. Zum Gl&uuml;ck war das Hotel wie &uuml;blichmit einer Klimaanlage ausgestattet.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge4" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa07.jpg" ALT="" height=240 width=360><br>Colorado River im Grand Canyon aus dem Flugzeug</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa08.jpg" ALT="" height=240 width=360><br>Im Monument Vally National Park</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text4" ><tr><td>Am n&auml;chsten Morgen schon (5.Tag) verlie&szlig;en wir die beschaulicheKleinstadt in n&ouml;rdliche Richtung um zun&auml;chst das Montezuma'sCastle, die ehemaligen H&ouml;hlenwohnungen amerikanischen Ureinwohnerzu besichtigen. Danach fuhren wir weiter &uuml;ber das K&uuml;nstlerst&auml;dtchenSedona und den Oak Creek Canyon zum wohl bekanntesten Nationalpark, demGrand Canyon Nationalpark. Dort besichtigten wir insgesamt vier sogenannteViews. Das sind gesicherte Aussichtspunkte von denen man einen herrlichenBlick &uuml;ber das Grand Canyon Gebirgsmassivs und das Grand Canyon Talhat. Es ist wirklich beindruckend, wie sich der Colorado Fluss in Millionenvon Jahren durch das Gebirge seinen Weg in das Gestein geschnitten hat."Am oberen Rand des Canons befindet sich Kalkstein, der vor 225 MillionenJahren am Grund eines Meeres entstand. Weiter unten sieht man braunen Sandstein,den r&ouml;tlichen Kalk der Redwall Formation und graue, bereits 500 MillionenJahre alte Schiefer bis man am Boden der Schlucht dann das &auml;ltesteGestein des S&uuml;dwesten sieht, Granit und kristalline Schiefer aus demPr&auml;kambrium, etwa 1,7 Millionen Jahre alt. Das sich am Boden befindlicheGestein, das das Fundament des ganzen Canyonlandes bildet, sind der Resteines uralten Gebirges, das abgetragen und in den folgenden 1,6 MilliardenJahren von Sedimenten &uuml;berdeckt wurde. Gro&szlig;e, flache Binnenmeerebrandeten &uuml;ber das Land und schichteten immer neue Ablagerungen auf.Vulkane brachten gl&uuml;hende Magma an die Oberfl&auml;che. Rund 4 kmdick waren schlie&szlig;lich die Sedimentschichten. Einschl&uuml;sse vonEisenoxyd und Mangan f&auml;rbten die Gesteinsformationen in feurigen Rot-und Violett&ouml;nen. Dann, vor etwa 65 Millionen Jahren, begann die Formungder Landschaft, wie wir sie heute kennen. Zusammen mit der Auffaltung derRocky Mountains wurde auch das Colorado Plateau angehoben. Ein gewaltigesSchichttafelland von gut 100 000 km” Fl&auml;che, das den gesamten S&uuml;denUtahs und den Norden Arizonas umfasst. Nur wenige Millimeter pro Jahr hobsich das Plateau, doch w&auml;hrend der vergangenen Erdzeitalter wurdenes insgesamt mehr als 4000 m. Durch tektonische Spannungen zerbrach esin mehrere Bl&ouml;cke, die sich gegeneinander verschoben und kippten.An den Kanten und Verwerfungslinien konnte dann die Erosion ihr spektakul&auml;resWerk beginnen. Der Colorado River und seine Nebenfl&uuml;sse haben w&auml;hrendder letzten zehn Millionen Jahre das weichere Schichtgestein ausgewaschenund modelliert, Frost und Wind trugen das ihre dazu bei. Tiefe Schluchtenund Steilh&auml;nge entstanden, Regen und Wetter mei&szlig;elten filigraneFelss&auml;ulen und bizarre Labyrinthe aus dem vielfarbigen Stein - eineinzigartiges Bilderbuch der Erdgeschichte." (Aus ADAC Tour Set Arizona,Utah 1999) Man muss dies selbst gesehen haben und diese grandiose Naturauf sich einwirken lassen um dies alles verarbeiten und verstehen zu k&ouml;nnen.Kein Foto kann diesen Eindruck vollst&auml;ndig wiedergeben, den man beimAnblick dieses Naturwunders empfindet.<p>Am Nachmittag fuhren wir zum Flugplatz der Grand Canyon Airlines. Dortwerden seit 1926 Fl&uuml;ge &uuml;ber den Grand Canyon durchgef&uuml;hrtbei den Touristen die Sch&ouml;nheit des Nationalparks aus der Luft genie&szlig;enk&ouml;nnen. Ich entschied mich f&uuml;r einen einst&uuml;ndigen Flug miteinem zweimotorigen Hochdecker der extreme Langsamflugeigenschaften hatte.Der Flug kostete 79,-US Dollar. Dies war noch recht preiswert, wenn manmal den halbst&uuml;ndigen Helikopterflug f&uuml;r ca. 120,-US Dollar alsVergleich nimmt. Gegen 15 Uhr startete dann die Maschine vollbesetzt mitca. 15 Touristen an Bord. Da ich einen Fensterplatz, gleich hinter demCo-Piloten hatte, konnte ich w&auml;hrend des Fluges wunderbare Fotos vomGrand Canyon und vom Colorado River machen. Der Flug war jedenfalls eintolles Erlebnis, das ich nicht so schnell vergessen werde.<p>Wir &uuml;bernachteten im Grand Canyon Inn. Dies war ein Hotel, welchesaus mehreren, kleineren, zweist&ouml;ckigen H&auml;usern bestand und zweckm&auml;&szlig;igeingerichtet war. Gegessen wurde im Hauptgeb&auml;ude. Unweit des Hotelswar ein Rodeo-Platz auf dem abends auch Vorstellungen stattfanden. EineReihe kleinere Gesch&auml;fte und Andenkensl&auml;den sowie ein Helikopterlandeplatzbefanden sich auch noch in der N&auml;he des Hotels. Alle diese Bauwerkewaren im alten amerikanischen Stil errichtet. Weiter gab es noch einenkleinen See an dem sich ein Campingplatz befand.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge5" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa09.jpg" ALT="" height=240 width=360><br>Lake Powell und Staumauer&nbsp;</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa10.jpg" ALT="" height=240 width=360><br>Bryce Canyon National Park</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text5" ><tr><td>Am kommenden Morgen (6.Tag) fuhren wir zuerst zum Grand Canyon AussichtspunktDessert View. Danach ging es weiter nach Kayenta. Dieser kleine Ort liegtschon im Navajo-Reservat. In einem von den Navjo-Indianern bewirtschaftetenFast-Food-Restaurant haben wir zu Mittag gegessen. Unser eigentliches Reiseziel,den Monument Vally Nationalpark, der vollst&auml;ndig im Navajo-Reservatliegt, erreichten wir gegen 14 Uhr. Wir machten dort mit einem gel&auml;ndeg&auml;ngigenBus ohne Fensterscheiben eine Rundfahrt durch den Park. Eine IndianerinNamens Jane fuhr uns 90 Minuten mit fahrerischem Geschick durch die Gegendund versuchte uns auch die M&ouml;glichkeit zu verschaffen ein Hogan vonInnen zu sehen. Es klappte nach einer l&auml;ngeren Fahrt zu einem zweitenDorf Susi einen Besuch in ihrem Hogan, dem traditionellen, sechseckigen,erdbedeckten Haus, abzustatten. Es passten wirklich ca. 20 Teilnehmer desBusses dort hinein, obwohl es von au&szlig;en erst nicht so aus sah. Wirdurften, gegen die Geb&uuml;hr von einem Dollar, die ca. 90-j&auml;hrige,gerade am Webstuhl mit dem weben eines Teppichs besch&auml;ftigte Navajo-Indianerinfotografieren. Es war ein besonderes Erlebnis, die aus der amerikanischenWerbung und aus vielen Western- und Abenteuerfilmen bekannten Felsformationeneinmal selbst aus n&auml;chster N&auml;he sehen zu k&ouml;nnen. UnsereReise ging danach in unserem Bus weiter nach Page am Lake Powell Stausee.Dieser Stausee, der der zweitgr&ouml;&szlig;te der USA ist und den ColoradoRiver aufstaut, erreichte erst nach 17 Jahren seine heutigen Ausma&szlig;e.Der See hat eine L&auml;nge von 300 km und eine Uferl&auml;nge von knapp3000 km. Mit Hausbooten und Motorjachten kann man tagelang auf diesem k&uuml;nstlichemSee und seinen Seitenarmen umherfahren. Bootsausfl&uuml;ge, zur nur aufdem Wasserwege erreichbaren gr&ouml;&szlig;ten Naturbr&uuml;cke der Welt,der fast perfekt halbkreisf&ouml;rmigen, 88 m hohen Rainbow-Bridge werdenab Wahweap angeboten. Leider konnten wir zu dieser keinen Ausflug machen.Wir &uuml;bernachteten im Best Western-Hotel, in Page, an der Hauptstra&szlig;ezum Lake Powell.<p>Am siebenten Tag ging die Reise morgens weiter in den Staat Utah umdort den Bryce Canyon Nationalpark zu besichtigen. Wir stiegen aus demBus aus um &uuml;ber die Br&uuml;cke des Glen Canyon Dammes zu laufen.Auf der anderen Seite angelangt, konnte man, wenn man zuvor bei den Sicherheitsbeamtenalles an Ausr&uuml;stung, Taschen und sonstigen Gegenst&auml;nden abgegebenhat, das Kraftwerk besuchen. Die Sicherheitsbestimmungen wurden nach dem11.September f&uuml;r solche wichtigen Bauwerke extrem versch&auml;rft.Doch zu einem Besuch unter diesen Bedingungen hatte keiner der ReiseteilnehmerLust. So ging es nach kurzer Pause mit dem Bus weiter in Richtung BryceCanyon Nationalpark. Unterwegs machten wir einen Fotostopp an einer Felsformation,die man dort Salt and Pepper - Streuer nennt. Den Bryce Canyon N.P. erreichtenwir gegen 15.00 Uhr. Anders als die zuvor gesehenen Nationalparks, dieeher durch ihre gigantischen Felsformationen beeindruckten, sah man hierfiligrane Felsformationen die einen an eine Theaterkulisse mit vielen Soldatenauf der B&uuml;hne erinnerten. Man k&ouml;nnte meinen dies sei die amerikanischeAusgabe der chinesischen Terrakotta-Armee. Die Indianer hielten die Gegendauch f&uuml;r heilig und dachten, eine riesige Armee w&uuml;rde dort aufgereihtsein. Mit nur 145 km” Fl&auml;che ist der Bryce Canyon einer der kleinstenNationalparks in den USA. Die ersten wei&szlig;en Siedler waren der MormoneEbenezer Bryce und seine Frau Mary, die sich in der N&auml;he des heutigenSt&auml;dtchens Tropic &ouml;stlich des Parks niederlie&szlig;en. 5 Jahrelang versuchten sie, hier Viehzucht zu betreiben, doch das raue Land konntensie nicht beherrschen und zogen schlie&szlig;lich an einen freundlicherenOrt. Nach ihnen hat der Canyon seinen heutigen Namen. Von Ebenezer Brycestammt der treffende Ausspruch: "Ein h&ouml;llischer Ort, um eine Kuh zuverlieren." 1923 wurde Bryce Canyon zum National Monument erkl&auml;rt,1928 zum National Park.<p>Wir besichtigten den Canyon vom Bryce Point, vom Sunset Point und vomInspiration Point aus. An diesem Tage war es sehr wolkig. Doch ein kr&auml;ftigerWind lies die Sonne immer mal f&uuml;r kurze Zeit durch die Wolken scheinen.So musste man unter den unterschiedlichsten Lichtverh&auml;ltnissen Aufnahmendes Bryce Canyons machen. Abends schliefen wir im Best Western Ruby's Inn,in Bryce, Utah, am Highway 63.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge6" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa11.jpg" ALT="" height=240 width=360><br>Las Vegas - Venetian</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa13.jpg" ALT="" height=241 width=360><br>Das Paradies f&uuml;r Spieler</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text6" ><tr><td>Am 8.Tag fuhren wir morgens zum Zion Nationalpark, einem der sch&ouml;nstenin den USA. "Das wild zerkl&uuml;ftete Tal des Virgin River inspirierteschon Anfang des 19.Jh. mormonische Siedler. So spektakul&auml;r stelltensie sich das Himmelreich vor, und so nannten sie denn auch die Region "Zion"und den Fluss nach der Mutter Gottes "Jungfrauenfluss". Der 595 km” gro&szlig;eNationalpark besteht vorwiegend aus roten Sandsteinformationen, in diesich der Fluss im laufe der letzten Jahrmillionen tief eingegraben hat.Vom Visitor Center nahe der Stadt Springdale am Westeingang des Parks beginnteine 12 km lange Panoramastra&szlig;e, die sich durch den immer enger werdenden,fast 800 m tiefen Zion Canyon windet." (aus ADAC Tour SET Arizona, Utah1999) Diese Stra&szlig;e sind wir mit dem Reisebus gefahren und haben dabeieinen herrlichen Blick auf die Sandsteinformationen gehabt. Der WissenschaftlerClarence Dutton erkl&auml;rte im Jahre 1880: "Nichts kann die wunderbareSch&ouml;nheit von Zion &uuml;bertreffen. Von seinen Proportionen her istder Standort dem Yosemite Tal gleichwertig, aber was den Charakter unddie Sch&ouml;nheit der Skulpturen betrifft, gibt es keinen Vergleich. Esist eine Ausdruckskraft in seinen Formen die Imagination durch eine eigenartigeKraft r&uuml;hrt und eine strahlende Antwort im Geist hervorruft." In derZion Valley Lodge, die 1219 m hoch gelegen ist, machten wir eine Mittagspauseum danach in Richtung Las Vegas weiterzufahren. Am zeitigen Abend erreichtenwir Las Vegas. Nachdem wir im "4 Queens" - Hotel unmittelbar an der FremontStreet, die Koffer in unseren Zimmern, uns etwas erfrischt hatten, unternahmenwir gegen 20 Uhr mit unserer Reiseleiterin in unserem Reisebus einen Abendausflugdurch Las Vegas. Zuerst erlebten wir in der Fremont Street eine Sci-Fiction-Videoshow,die an die &Uuml;berdachung der gesamten Stra&szlig;e projiziert wurde.Diese Show wiederholte sich mit wechselnden Themen halbst&uuml;ndlich ab20 Uhr.<p>Danach fuhren wir mit unserem Reisebus durch Las Vegas und sahen dabeiviele der eindrucksvollen Hotels bei Nacht. Wir besuchten das Luxor, Paris-Paris,den Cesar's Palace und das Bellagio Hotel und waren von der pr&auml;chtigenund glanzvollen Ausstattung beeindruckt. Au&szlig;erdem konnten wir amTrasure-Islands-Hotel die spektakul&auml;re Imitation eines Vulkanausbruchserleben. Es war ein interessanter abendlicher Ausflug durch Las Vegas aufder man viel gesehen und erfahren hat. So sagte die Reiseleiterin z.B.das das gr&ouml;&szlig;te Hotel in Las Vegas, das "MGM Grand Hotel" 5.005Betten und 10.000 Angestellte hat. Man betritt dieses durch das Maul einesgoldenen L&ouml;wen mit gr&uuml;nen Augen und kommt sogleich in das Hotel-Casino.Wenn man unbeschadet an all den Spieltischen und einarmigen Banditen vorbeikommt,gelangt man in einen riesigen Vergn&uuml;gungspark, der es fast mit Disneylandin Kalifornien aufnehmen kann. "Die Energie, mit der sich Las Vegas inSzene setzt, und das Wasser f&uuml;r die vielen Duschen, Pools und Springbrunnenliefert der Colorado River. Mit dem Projekt, ihn im Black Canyon zu stauen,fing auch die Geschichte der Stadt an. 1931 wurde mit dem Bau des HooverDamm begonnen und in demselben Jahr - Amerika steckte in der schlimmstenwirtschaftlichen Depression seiner Geschichte -, &auml;nderte der StaatNevada seine Gesetze. Erlaubte das Gl&uuml;cksspiel. Reduzierte Scheidungs-und Eheschlie&szlig;ungsformalit&auml;ten auf ein Minimum. Sah elegant&uuml;ber Prostitution und das damals landesweit geltende Alkoholverbothinweg. Mit dem Erfolg, dass sich 1935, als der Hoover Damm eingeweihtwurde, die Bev&ouml;lkerung von Las Vegas bereits verdoppelt hatte. EinGas setzte den Hotels, Casinos, Heiratskapellen und Bordellen dann dieGlanzlichter auf: In den vierziger und f&uuml;nfziger Jahren trat Amerikains Neon-Zeitalter. Nun begr&uuml;&szlig;te der ber&uuml;hmte Cowboy VegasVic mit der Zigarette im Mund die G&auml;ste, jeden Abend begann die Stadt,deren Zentrum damals noch die Fremont Street war, ihre bunte Lightshow,die so manch sch&auml;bige Fassade verbarg und die Hochburg der Illusionins rechte Licht setzte. Im Inneren der &uuml;berdimensionierten Hotel-Casino-Komplexespielen Tag und Nacht keine Rolle: Kunstlicht gaukelt Zeitlosigkeit vor,das "Forum" von Cesar's Palace liegt 24 Stunden unter stimmungsvollem Abendhimmel,r&ouml;misch gewandete, kurzberockte Hostessen reichen ohne Unterlass kostenloseGetr&auml;nke, mit stierem Blick werfen die Spieler M&uuml;nzen in dieSlot Machines, starren auf rollende Kugeln, Chips oder Karten. 109 368Slot Machines - einarmige Banditen - sind in Las Vegas registriert, danebenkann man Baccarat, Blackjack, Poker, Craps, Keno und Roulette spielen.Die Regeln findet man &uuml;berall - auch auf Deutsch - erkl&auml;rt. Flamingo,Sahara, Showboat, Cesar's Palace, Treasure Island, Circus Circus, Mirage- wie die Hotel-Casinos auch hei&szlig;en m&ouml;gen, ihre Strategie istdieselbe: Die Besucher hereinzuziehen und sie zu halten, damit sie ihrGeld an den hauseigenen Tischen verspielen und nicht die einarmigen Banditendes Nachbarn f&uuml;ttern. Dazu ist jedes Mittel recht: Hotelzimmer gehobenerAusstattung zu Niedrigpreisen, Buffet's, die fast geschenkt sind." (ausADAC TourSET Kalifornien, Nevada, 1996) Dem kann ich eigentlich nur nochhinzuf&uuml;gen, das es au&szlig;erhalb der Hotel-Casinos immer sehr warmist und man gerne mal in die K&uuml;hle der Hotel-Casinos geht um sichzu erfrischen. Wenn man von drau&szlig;en kommt und in sein Hotelzimmerwill muss man immer zuerst durch die Spielhalle um zum Aufzug zu gelangen.Auch zum Essen geht's immer zuerst durch die Unmengen an Reihen einarmigerBanditen und Spieltische. Wobei es wirklich so ist, das es im Hotel-Casinoselbst bei MC Donald etwas billiger ist als im normalen Fast-Food-Restaurantau&szlig;erhalb der Casinos.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge7" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa12.jpg" ALT="" height=360 width=240><br>Video Show auf der Fremont Street</td><td ALIGN=CENTER VALIGN=TOP WIDTH="50%"><img SRC="usa14.jpg" ALT="" height=240 width=360><br>Windkraftturbinen auf dem Weg nach Visalia</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text7" ><tr><td>Abends sahen wir uns die Videoshow auf der Fremont Street an. "12,5Millionen LED's und 540 Kilowatt Musikleistung aus 208 Lautsprechern verwandelndie Fremont Street nach Einbruch der Dunkelheit zur gr&ouml;&szlig;tenVideoshow der Welt. Die Fremont Street (Downtown) wurde 1995 auf 500 Meternzwischen Main Street und Las Vegas Boulevard zu einer Fu&szlig;g&auml;ngerzoneumgebaut und mit einem 30 Meter hohem Dach (16.000 m”) aus mehr als 2 MillionenLampen ausgestattet. 2004 wurden die Lampen durch LED's ersetzt, so dassdie Bilder heller und in h&ouml;herer Aufl&ouml;sung dargestellt werdenk&ouml;nnen." (Informationen aus dem Internet-Las Vegas Online-Guide).Der n&auml;chste Tag stand uns in Las Vegas zur freien Verf&uuml;gung.Mein Freund und ich sahen uns gemeinsam bei Tag Las Vegas an. Wir liefenvom Hotel "4 Queens" an der Fremont Street den ganzen Strip entlang biszum Hotel "New York New York". F&uuml;r diese Strecke brauchten wir ca.5 Stunden. Im "Paris Paris"- Hotelkomplex fuhren wir mit dem Fahrstuhlf&uuml;r 9 Dollar auf die Aussichtsplattform und hatten von dort aus einesch&ouml;ne Aussicht auf Las Vegas. Wir fotografierten von da oben eine&Uuml;bersicht vom Strip in Las Vegas mit seinen vielen beendruckendenBauwerken.<p>Am Hotel "Bellagio" warteten wir leider eine Stunde vergeblich auf dieWasserspiele. Wegen technischer Probleme vielen sie leider aus. So musstenwir uns mit einer Postkartenansicht der Wasserspiele begn&uuml;gen.<p>In einem "Walgreens"-Drogeriemarkt, am Anfang des Strip, lies ich f&uuml;r4 Dollar meine insgesamt 220 Digitalfotos von der Speicherkarte auf CD-ROMbrennen. So hatte ich nach dem l&ouml;schen der Fotos wieder gen&uuml;gendSpeicherplatz f&uuml;r kommende Aufnahmen. Zur&uuml;ck sind wir dann miteinem Linienbus f&uuml;r 2 Dollar bis zum Hotel gefahren. Seine 1-Dollar-Notenmusste man beim Fahrer in den Schlitz des Kassenautomaten stecken und konntedann, ohne das ein Fahrschein heraus kam, in die Wagenmitte durchr&uuml;ckenum Platz nehmen. Stieg man aus, war die Fahrt abgegolten.<p>Am n&auml;chsten Morgen (10.Tag) war ich beim Blick aus dem Hotelfenstererstaunt. Drau&szlig;en ging ein Sommergewitter &uuml;ber Las Vegas nieder.Die Fassaden der Hochh&auml;user spiegelten sich in Regenpf&uuml;tzen.Welche Seltenheit, in Las Vegas regnete es. Heute ging unsere USA-Tourweiter &uuml;ber Calico Ghost Town, eine Geisterstadt aus der Pionierzeit,die wir besichtigten, nach Visalia im Bundesstaat Kalifornien. Wir fuhrenan diesem Tag &uuml;ber den Highway Nr.15 bis Yermo um dann rechts dieVerbindungsstra&szlig;e nach Calico Ghost-Town zu erreichen. Nach Ghost-Townging es dann noch ein kurzes St&uuml;ck auf dem Highway Nr.15 bis Barstow.Danach ging es weiter, abwechselnd auf dem Highway und der Durchgangsstra&szlig;eNr.58 &uuml;ber Mojave bis Bakersfield und dann in n&ouml;rdliche Richtungauf dem Highway Nr.99 bis zum Tagesziel Visalia. Bei dieser Fahrt fuhrenwir durch die Mojave-W&uuml;ste, vorbei an einem weit entferntem Salzsee.Wir sahen vom Bus aus in der W&uuml;ste &ouml;fters eine Fata-Mogana. Diesfanden wir sehr beendruckend. Einen Flugplatz, auf dem die von den Fluggesellschaftenaus aller Welt ausgemusterten und zum Verkauf angebotenen Passagierflugzeugestehen, sahen wir in weiter Ferne im vorbeifahren. Durch das trockene,warme W&uuml;stenklima k&ouml;nnen die Flugzeuge l&auml;ngere Zeit im Freienstehen ohne Schaden zu nehmen. An diesem Tag legten wir 616 km zur&uuml;ck.Dies war die l&auml;ngste Strecke auf der Busrundreise, die wir an einemTag zur&uuml;cklegten. In einem sch&ouml;nen Holiday Inn-Hotel fielen wirdann abends m&uuml;de in die Betten.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge8" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa15.jpg" ALT="" height=360 width=240><br>durch einen Baum laufen -<br>im Sequoia National Park ist es m&ouml;glich;</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa16.jpg" ALT="" height=360 width=240><br>auf dem Weg zum Yosemite Wasserfall<br>im gleichnamigen National Park</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text8" ><tr><td>Am kommenden Morgen hie&szlig; es dann wieder um 6 Uhr aufstehen umam 11.Tag unserer Reise den Sequoia National Park und danach das TageszielMariposa zu erreichen. Gegen 09.30 Uhr kamen wir am Eingang des Sequoia/KinksCanyon National Parks an. "Die Gener&auml;le Grant und Sherman, die sichim Sessionskrieg gegen&uuml;berstanden, finden sich hier friedlich vereint:Nach Sherman, dem Sieger, ist der h&ouml;chste der vielen hundert Mammutb&auml;ume(Sequoien) benannt. Er ist 84 m hoch. Will man um ihn herum laufen, mussman eine Strecke von 31 m zur&uuml;cklegen. Grants wird mit einem "nur"81 m hohen Baum, der drittgr&ouml;&szlig;ten Sequoia der Welt gedacht.Wer auf Show nicht verzichten m&ouml;chte, der reihe sich ein in die Schlangevor dem Tunnel Log und nehme die Chance wahr, mit dem Auto durch einenBaum hindurch zu fahren. Die sch&ouml;nsten Teile der beiden 1943 vereintenParks k&ouml;nnen jedoch nur erwandert werden. 1300 km ausgeschilderteWege f&uuml;hren durch die Schutzgebiete, in denen 1300 Pflanzen- und 2100Tierarten ihre Refugien haben." (aus ADAC TourSET Kalifornien, Nevada,1996) Durch einen Baum sind wir mit unserem Bus nicht gefahren. Er h&auml;tteeventuell auch nicht durchgepasst. Wir konnten allerdings durch einen umgest&uuml;rzten,ausgeh&ouml;hlten Baumstamm laufen. Das war auch schon recht interessant.In inmittelbarer N&auml;he solch gigantischer B&auml;ume kam man sich dochrecht klein vor. Unsere Fahrt wurde nach dem Besuch dieses Nationalparksin Richtung Yosemite National Park fortgesetzt. Vorbei an herrlichen, urw&uuml;chsigenW&auml;ldern an steilen Felsw&auml;nden und durch malerische Landschaftenging es jedoch erst mal nach Mariposa zum dortigen "Comfort Hotel Mariposa".Mariposa ist ein kleines, verschlafenes Goldgr&auml;berst&auml;dtchen welchesum 1850 herum seine Bl&uuml;tezeit hatte, in dem man sich ausruhen undwohlf&uuml;hlen kann. Wir haben in einem sehr sch&ouml;nen, alten urgem&uuml;tlichenWesternlokal an der Hauptstra&szlig;e zu Abend gegessen.<p>Am n&auml;chsten Tag (12. Tag) fuhren wir dann gegen 8 Uhr zum YosemiteNational Park ab. Wir erreichten ihn gegen 09.45 Uhr und hatten dann ca.drei Stunden Zeit zur freien Verf&uuml;gung um uns das Tal und den YosemiteWasserfall anzuschauen. Der Park erstreckt sich &uuml;ber etwa 3000 km2und enth&auml;lt eines der sch&ouml;nsten Bergt&auml;ler der Welt. DasYosemite Tal ist 13 km lang und knapp 1600 m breit. Steile, 1000 m hoheGranitw&auml;nde steigen beidseitig des Tales hoch. Neun Wasserf&auml;llest&uuml;rzen in das Tal. F&uuml;nf davon sind mehr als 300 m hoch. DasWas ser des Yosemite Falls f&auml;llt in zwei Stufen &uuml;ber 740 Meter,bevor es auf die Felsen prallt. Es gibt dort herrliche Wiesen, klare Seenund Fl&uuml;sse. Das Tal war Mitte Juni gut besucht aber nicht von Touristen&uuml;berv&ouml;lkert. Wir konnten dort herrliche Fotos machen und dabeirecht nahe an den Yosemite Wasserfall herangehen. Nachmittags ging dieReise weiter nach San Francisco. Diese wohl sch&ouml;nste Stadt der USAerreichten wir gegen 16.30 Uhr. Wir fuhren &uuml;ber die Oakland-Br&uuml;ckezum Hotel, welches wir ca. 17 Uhr erreichten. Am Abend unternahmen meinFreund und ich einen kurzen Ausflug in die Stadt. Es war an diesem Abendmit nur ca. 17 Grad und einem st&uuml;rmischen Wind recht k&uuml;hl, sodass wir, von der W&auml;rme und der Sonne verw&ouml;hnt, nicht lange blieben,sondern bald wieder das Hotel aufsuchten.</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge9" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa17.jpg" ALT="" height=240 width=360><br>die Golden Gate Bridge in San Francisco</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa18.jpg" ALT="" height=240 width=360><br>die Golden Gate Bridge bei der Bootsfahrt<br>auf der San Francisco Bay</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text9" ><tr><td>Am n&auml;chsten Morgen (13.Tag) wurden uns auf einer Stadtrundfahrtdie Sehensw&uuml;rdigkeiten gezeigt. Leider war es am Morgen noch rechtnebelig, so dass wir von dem bei dieser Rundfahrt angesteuerten Aussichtspunkt,dem Twin Peaks, keine Sicht auf die Stadt Francisco hatten. Rings herumnur dicker Nebel. Aber aus dem Nebel tauchten pl&ouml;tzlich illegale Einwandererauf, die Jacken verkauften. Unser Busfahrer hatte keine dabei und deshalbfror er sehr. Er kaufte ihnen f&uuml;r wenige Dollar eine ab. Bei klarerSicht h&auml;tten wir von diesem Aussichtspunkt, der aus zwei fast gleichhohen H&uuml;geln (275 und 281 m) besteht, au&szlig;er der Stadt sogargleichzeitig die Bucht und das Meer sehen k&ouml;nnen. Auf der Stadtrundfahrtbekamen wir u.a. den Union Square, das Presidio, die St. Mary's Cathedralan der Gough Street, die aussieht wie eine gro&szlig;e Bischofsm&uuml;tze,das Civic Center mit der City Hall, dem Rathaus der Stadt, den Golden GatePark, die K&ouml;nigin Wilhelmina Windm&uuml;hle und die VictorianischenH&auml;user am Alamo Square zu sehen. Diese typischen viktorianischen Holzh&auml;usernennt man wegen ihres farbenfreudigen Aussehens auch "Painted Ladies".<p>Am Nachmittag unternahmen wir mit der Reisegruppe eine Bootsfahrt vomPier 43 1/2 aus auf der Francisco Bay, um bei ziemlich st&uuml;rmischenWind zuerst unter der Golden Gate Bridge durchzufahren, einen Br&uuml;ckenpfeilerzu umrunden und danach an der Gef&auml;ngnisinsel Alcatraz vorbei, zur&uuml;ckzum Pier, zu fahren. Auf dieser Bootsrundfahrt sahen wir Albatrosse undScharen von M&ouml;wen. Die uns kreuzenden Segler hatten bei dem st&uuml;rmischenWind alle H&auml;nde voll zu tun, um ihre Segelboote richtig im Wind zuhalten und nicht zu kentern. Nach der Bootsfahrt gegen 13:30 sahen wiruns am Pier 39 um. Dort entdeckten wir auch das Hard-Rock-Cafe. Ein Arbeitskollegehatte mich geben f&uuml;r seine schon umfangreiche Sammlung von Hard-Rock-Cafe-Souveniersaus San Francisco einen Teddyb&auml;ren mit hellem T-Shirt, ein T-Shirtund einen Gitarrenpin mitzubringen. Ich bekam auch alles f&uuml;r ihn zumstolzen Preis von 52,-US-Dollar. Danach haben wir in einem Restaurant,mit Blick auf den Yachthafen, ein Fischgericht zu Mittag gegessen. Wirbummelten noch eine ganze Weile an den Piers entlang, machten Fotos undsahen den unterschiedlichen Darbietungen junger K&uuml;nstler zu. EinenAufstieg auf den Telegraph Hill unternahmen wir am sp&auml;ten Nachmittag.Wir sahen uns gegen 16 Uhr, nach einem ziemlich anstrengenden Fu&szlig;marschimmer bergauf vom Coit Tower die Stadt an. Von da oben hatten wir an diesemTag einen wunderbaren Blick bei klarer Sicht auf die Piers und die SkylineSan Francisco.<p>Gegen Abend stellten wir uns in die Reihe der Wartenden, die alle mitdem Cable Car zur&uuml;ck zur Market Street wollten. Die Zeit bis zum Eintreffeneines Cable Cars wurde uns auch hier von einem Musikanten verk&uuml;rzt.Wir fuhren nach Entrichtung des Fahrgeldes von zwei Dollar zur zum Hotel,welches an der Market Street, in der N&auml;he des Civic Centers lag. DasCivic Center ist das Verwaltungszentrum von San Francisco mit dem in derMitte gelegenen United Nations Plaza. Hier wurden 1945 die Vereinten Nationengegr&uuml;ndet. Vom Balkon des Hotel hatten wir einen sch&ouml;nen Blick&uuml;ber das abendliche San Francisco bis zum Hafen und die Oakland Bridge.<p>Der n&auml;chste Tag (14.Tag) stand uns ganz zur freien Verf&uuml;gung.Dies nutzte ich gemeinsam mit meinem Freund um die Sehensw&uuml;rdigkeitenvon San Francisco zu erkunden. Wir besuchten zuerst China Town wo wir einigeAndenken kauften. Auch einen recht preiswerten KODAK-Farbfilm kaufte ichhier, weil meine Filme nun doch langsam alle wurden. Als n&auml;chstesgingen wir an der City Hall vorbei um zum Union Square zu gelangen. Dortmachten wir eine Pause um uns auszuruhen und um zu fotografieren. Hierwachsen sogar Palmen und in der Mitte steht eine 30 m hohe S&auml;ule zuEhren des Admirals George Dewey, der durch die Schlacht in der Manila Bayim Jahre 1898 bekannt wurde. Umgeben ist der Union Square von hohen Hotels,B&uuml;rot&uuml;rmen Gastst&auml;tten und Kaufh&auml;usern, in denen &uuml;berwiegendMarkenartikel verkauft werden. Unser Ziel war es aber, an diesem letztenTag unseres Aufenthaltes in San Francisco, auch die Lombard Street zu besuchen.Dies ist die wohl bekannteste und meist fotografierte Stra&szlig;e in SanFrancisco, die sich zwischen Hyde und Leavenworth St. befindet und in neunHaarnadelkurven abw&auml;rts geht. Die Stra&szlig;e ist zwischen den Biegungenmit Blumenbeeten versehen und die H&auml;user zu beiden Seiten sind ebenfallsmit Blumenranken bewachsen. Insgesamt ist es ein wundersch&ouml;ner Anblickund interessant zu sehen, wie sich die Autos von oben nach unten schl&auml;ngeln.Die Stra&szlig;e ist f&uuml;r Busse und LKW gesperrt. Deshalb ist dieseauch mit Touristenbussen nicht zu befahren und wegen der rings herum dochrecht steilen Zufahrten damit auch kam zu erreichen.<p>Am sp&auml;ten Nachmittag sind wir dann wieder zum Pier 39 gelaufen.Wir wollten sehen, ob an diesem, w&auml;rmeren und windstillen Tag dieSeerobben zu sehen sind. Wir hatten Gl&uuml;ck. Sie waren zahlreich gekommen,um in der Sonne auf den schwimmenden Pontons zu liegen. Zur&uuml;ck zumHotel an der Market Street fuhren wir wieder mit dem Cabel Car. Dies istwirklich die sch&ouml;nste Art des Transports f&uuml;r fu&szlig;m&uuml;deTouristen, die wir nach dem langen Fu&szlig;weg waren.<p>Am 15.Tag unserer Rundreise nahmen wir Abschied von San Francisco undfuhren auf dem Highway Nr.1, der K&uuml;stenstra&szlig;e oder auch Traumstra&szlig;eNr.1 genannt, weiter nach Montery, einst Hauptstadt Kaliforniens und jetztein h&uuml;bscher Yacht- und Fischereihafen. Die von John Steinbeck inseinem Roman "Die Stra&szlig;e der &Ouml;lsardinen" verewigte Canery Row,an der fr&uuml;her die Sardinenfabriken standen und "Doc" sein Labor hatte,ist heute eine Einkaufsstra&szlig;e mit Bars, Shops und Restaurants. AmEnde der Stra&szlig;e liegt auch das Monterey Bay Aquarium in dem sich&uuml;ber 6500 Meeresbewohner in 23 riesigen Becken befinden. W&auml;hrendman gem&uuml;tlich auf der Terrasse an der Fishermans's Warf sitzt, kannman freilebende Seeottern bei ihren Spielen oder beim Sonnenbaden zusehen.Nur wenige Kilometer weiter erreichten wir gegen 12 Uhr Carmel, welchesein kleiner K&uuml;stenort ist und 1904 von K&uuml;nstlern aus San Franciscogegr&uuml;ndet wurde. In der N&auml;he, einer im l&auml;ndlichen Stil gebautenEinkaufspassage hielten wir an und hatten dann ca. 1 Stunde Pause. UnsereReise ging danach auf der K&uuml;stenstra&szlig;e Nr.1 zu unserem ReisezielPismo Beach. Auf zwei Fotostopps unterwegs hatten wir die Gelegenheit dieherrliche Sicht auf die Pazifikk&uuml;ste auf Film oder auch digital mitnach Hause zu nehmen. In Pismo Beach &uuml;bernachteten wir in den OxfordSuites. Hier gab es im Wohnzimmer eine eingebaute K&uuml;che mit K&uuml;hlschrank,Mikrowelle und gro&szlig;em Fernseher und im Schlafzimmer waren zwei Waschbeckenund ein zweiter gro&szlig;er Fernseher vorhanden. Es war eine zweist&ouml;ckige,weitr&auml;umige Hotelanlage die recht interessant gebaut war. Das Fr&uuml;hst&uuml;ckgab es in einem extra gro&szlig;en Raum, in der N&auml;he der Lobby. Etwasungew&ouml;hnlich f&uuml;r uns war dort, dass die Kofferboys keine Boys,sondern Frauen waren. Deshalb zogen wir es auch vor, unsere Koffer selbstin das Zimmer und am morgen wieder zum Bus zu bringen.<p>Auf einem Schild, an der Stra&szlig;e vor dem Hotel, stand, das es bisLos Angeles, unserem Start und Ziel bei dieser Reise, noch 191 Meilen,also ca. 300 km sind. Am 16 Tag machten wir uns also morgens auf, um dieseletzte Station zu erreichen. Wir fuhren zun&auml;chst nach Solvang, welches1911 durch d&auml;nische Einwanderer gegr&uuml;ndet wurde und im SantaYnez Valley, ca. 45 Meilen nordwestlich. von Santa Barbara liegt. Der Stilder Geb&auml;ude, die Atmosph&auml;re und die K&uuml;che sind immer nocheurop&auml;isch bestimmt. Dies spiegeln auch die &uuml;ber 300 L&auml;denund Lokale, B&auml;ckereien und Kunsthandwerke wieder. Dort kaufte unsereReiseleiterin bei einem d&auml;nischen B&auml;cker extra feine Kekse. Auchaus diesem Grunde der Abstecher dort hin, der nicht im Reiseplan ausgedrucktwar. Weiter ging unsere Fahrt immer auf dem Highway Nr.1 mit dem herrlichenBlick auf den Pazifik, seinen Strand und die netten kleinen K&uuml;stenorte.Wir erreichten gegen Mittag den K&uuml;stenort Santa Barbara wo wir einel&auml;ngere Mittagspause machten. Die Stadt liegt zwischen dem sch&uuml;tzenden,n&ouml;rdlich gelegenen Santa Ynez Gebirge und dem s&uuml;dlich gelegenenblauen Pazifischen Ozean. Zwanzig Meilen zur See hinaus sch&uuml;tzt derKanalinsel Nationalpark Santa Barbara vor unbrechbarem Wetter. Das Ergebnisist einfach paradiesisch. Zuerst besuchten wir in Santa Barbara die Missionskircheund danach hatten wir eine Strandpause von ca. 1 Stunde. Diese nutztenwir, um die Stearns Warf, eine Landungsbr&uuml;cke die mit Gesch&auml;ftenund Lokalen bebaut ist, entlangzugehen. Wir a&szlig;en danach in einemCafe etwas zu Mittag und kauften einige Andenken und Postkarten. Nach derPause fanden sich alle Reiseteilnehmer wieder im Bus ein und wir fuhrendie letzten, der insgesamt an diesem Tag zu fahrenden 288 km, bis Los Angeles.In Los Angeles &uuml;bernachteten wir in einem erste Klasse Hotel, mitdem Namen "Westin LAX".</td></tr></table><table BORDER=0 WIDTH="100%" summary="Bilderfolge10" ><tr><td ALIGN=CENTER WIDTH="50%"><img SRC="usa19.jpg" ALT="" height=240 width=360><br>San Francisco mit der Transamerica Pyramid<br>vom Coit Tower aus aufgenommen</td><td ALIGN=CENTER WIDTH="50%"><img SRC="usa20.jpg" ALT="" height=240 width=360><br>bergab und bergauf - San Francisco</td></tr></table><table BORDER=0 WIDTH="100%" summary="Text10" ><tr><td>Am 16 Tag war f&uuml;r 18:55 Uhr der Flug nach Frankfurt gebucht. Esblieb also noch viel Zeit bis dahin. Die Koffer hatten wir am Vormittagbei einem Hotelangestellten in der Lobby abgeben k&ouml;nnen. Wir unternahmengegen Mittag einen Fu&szlig;marsch und gingen dabei immer in Richtung Flugplatz.Auf diesem Weg machten wir noch einige Aufnahmen aus einem Parkhaus heraus,von Passagiermaschinen, die den Flughafen Los Angeles anflogen. Es warauch interessant, Arbeitern beim beschneiden der Palmen zuzusehen und diesedabei zu fotografieren. Sie schnitten von den Palmen die verdorrten undunansehnlich gewordenen Palmenwedel ab. Gegen Abend fuhren wir mit demHotel-Shuttle zum Flugplatz und checkten uns f&uuml;r den R&uuml;ckflugnach Frankfurt ein. Die Koffer wurden bei der Kontrolle alle ge&ouml;ffnetund mit einem hellen Indikationspapier fuhr die Sicherheitsangestellteden Koffergriff und die Innenseiten des Koffers entlang. Danach hielt siees in ein Kontrollger&auml;t, um somit wahrscheinlich rauschgift- odersprengstoffverd&auml;chtige Substanzen entdecken zu k&ouml;nnen. Das Flugzeugstartete ziemlich p&uuml;nktlich und wir traten den R&uuml;ckflug an. Dieserwar in einem Punkt etwas merkw&uuml;rdig. Wir flogen der Sonne entgegen.Aber es wurde bei dem R&uuml;ckflug auch um uns her dunkel. Wir wurdenvon den Flugbegleitern deshalb darum gebeten die Sonnenblenden vor denFenstern ganz nach unten zu ziehen. Es kehrte im Flugzeug also Nachtstimmungein und jeder versuchte so gut es ging etwas zu schlafen. Nach ca. dreiStunden still halten und schlafen wurde ich jedoch munter und neugierigdarauf, was wohl drau&szlig;en los ist. Ich zog einen Spalt die Sonnenblendenach oben und stellte fest, dass rings um uns herum strahlender Sonnenschein,also Tag ist. Ich wurde aber sogleich von der Flugbegleiterin darauf hingewiesen,das ich die Sonnenblende wieder nach unten ziehen sollte. Wir flogen alsobei strahlendem Sonnenschein mit heruntergezogenen Sonneblenden, sozusagenim dunklen umher und konnten von der Gegend um uns und unter uns leidernichts sehen. Nach einer Weile zog aber an der anderen Seite des Flugzeugesjemand die Sonnenblende ein St&uuml;ck nach oben und ich daraufhin dannauch. So hatten wir im Flieger etwas Licht und konnten auch nach drau&szlig;en,durch einen Spalt, die wunderbare Landschaft und die Wolkenfelder sehen.Auf dem Flug nach Los Angeles hatten wir die ganzen 11 Stunden freie Sichtnach drau&szlig;en. Keinem w&auml;re eingefallen einen Nachtflug zu simulieren.Au&szlig;erdem war es ja da, wo wir hinflogen, also Frankfurt, bei derLandung auch keine Nacht sondern sp&auml;ter Nachmittag. Die Zeitumstellungschaffte ich, nachdem ich in Berlin angekommen war, dadurch ganz gut weilich nach Ortzeit 22 Uhr schlafen ging und am n&auml;chsten Morgen aufstand.<p>Wir hatten jedenfalls einen guten Flug bis Frankfurt, der ca. 1 Stundek&uuml;rzer als der Hinflug war und eine sehr gute Landung. Von Frankfurtging es dann nach ca. 2 Stunden weiter, um in Berlin Tegel um 17.05 Uhrp&uuml;nktlich zu landen. Dieser Flug war bei wolkigem, k&uuml;hlen Sommerwetterauch recht ruhig und die Landung war super. Wir fanden auch all unsereGep&auml;ckst&uuml;cke auf dem Rollband wieder. Bei meinem Koffer war eineKoffergriff leider etwas besch&auml;digt. Ich verabschiedete mich am Flughafenvon meinem mich begleitenden Freund, da wir beide unterschiedliche &ouml;ffentlicheVerkehrsmittel nahmen, um nach Hause zu gelangen. Ich fuhr nur drei Stationenmit dem Bus und war schon nach wenigen Minuten zu Hause.<h3><b>Schlussbemerkung</b></h3>Die Reise war jedenfalls sehr gut organisiert. Ich habe dabei sehr vielgesehen, interessantes erfahren und auch etwas von den Lebensgewohnheitender Amerikaner mitbekommen. Sie waren stets freundlich, h&ouml;flich undhilfsbereit. Sie fragten des&ouml;fteren wo wir herkommen und was wir hiermachten. F&uuml;r solch einfache Fragen reichte mein englisch gerade noch.Es gab bei dieser Reise keinerlei Pannen mit dem Bus oder Verluste an Koffern.Es klappte also wirklich alles sehr gut. Die Unterbringung in den Hotelswar gut bis sehr gut. Das Fr&uuml;hst&uuml;ck war typisch amerikanischund man konnte satt werden. Bis auf eine Ausnahme konnte man vom Fr&uuml;hst&uuml;ckauch noch etwas in angemessener Menge als Wegzehrung mitnehmen. Die Reiseleiterinund der Busfahrer, der wirklich viel leisten musste um den Bus auch aufden kurvenreichen Strecken im Gebirge oder auf der K&uuml;stenstra&szlig;esicher zu man&ouml;vrieren, bekamen jeder pro Tag einen Dollar Trinkgelder.<p>Ich habe auf dieser Reise pro Tag ca. einen Film mit 36 Aufnahmen verbraucht,insgesamt 19 Filme. Digital habe ich 564 Aufnahmen mit der kleinen Kodak-Kameraaufgenommen. In den USA habe ich eine CD mit 120 und eine CD mit 220 Aufnahmenan einem KODAK-Fotoautomaten gebrannt, um die Speicherkarten zu entladen.Au&szlig;erdem habe ich noch in Las Vegas, in der Fremont Street, eineMinute Film im MOV-Format von den dort abendlich stattfindenden Videoshowmit der Kodak-Kamera aufgenommen. Diesen Film kann man mittels Quick-Time-Playerabspielen.<p>Noch ein Tipp: Filme aus Deutschland mitnehmen. 36er Filme gibt es nureinzeln und sie kosten so viel wie ein Dreierpack der gleichen Sorte undMarke in Deutschland. Batterien (Mignonzellen) f&uuml;r Digitalkamerassind etwa gleich teuer und in Mehrfachpackungen auch etwas billiger. Speicherkartenf&uuml;r Digitalkameras gab es nur selten und wenn, nur kleinere die teurerwaren als in Deutschland. Also auch hier im Elektronikmarkt kaufen. ZumBrennen der digitalen Bilder von den Speicherchips auf Foto CD noch eineBemerkung: Wenn man die Fotos auf eine Kodak Picture CD brennen l&auml;sst,dann sind die Kameradaten wie z.B. das Aufnahmedatum, die Belichtungszeitund die Blende nicht mit den Bildern auf CD gebrannt. Jedenfalls war esbei meiner Foto CD so, was mich &auml;rgerte, da ich kein Aufnahmedatummehr hatte. Brennt man hingegen im Drogeriemarkt "Walgreens" sind die Datenmit auf der CD. Man kann sich also auch sp&auml;ter noch das Aufnahmedatumund alle anderen Kamera-Aufnahmedaten anzeigen lassen.<p>Ich bin hiermit am Ende meines Reiseberichtes angelangt und danke allen,die diesen bis hier her zu Ende gelesen haben und vielleicht dabei dieeine oder andere Anregung f&uuml;r ihren kommenden Auslandsurlaub erhaltenhaben. Ich danke auch Wolf Zimmer f&uuml;r seine Arbeit, die er bei derUmsetzung dieses doch recht ausf&uuml;hrlichen Berichtes in das HTML-Formathatte.<p>Mathias Klingner<br>E-Mail: <u><font color="#0000FF">tschandru.shing@berlin.de</font></u></td></tr></table><p><b><font size=+1><a href="mm_mmx.html">zur&uuml;ck</a></font></b></td></tr></table></center></td></tr></table></body></html>