<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [WASCHWEIB] Handy in der Sauna... </title><!-- Author = Nadine Alexande --></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Handy in der Sauna...&nbsp;</font></font></b></h1></center>Eine Gruppe von M&auml;nnern sitzt zusammen in der Sauna, als pl&ouml;tzlichund &uuml;berraschend ein Handy klingelt.<p>Einer der M&auml;nner greift zum Handy und antwortet:<br>'Hallo?'<br>Die Frau: 'Schatz bist Du das? Und was sind das denn f&uuml;r Ger&auml;usche?Bist Duin der Sauna?'<br>'Ja.'<br>'Schatz, ich stehe hier gerade vor einem Juwelier-Gesch&auml;ft unddie haben hier das Diamant-Kollier was ich schon immer haben wollte. Kannich mir das bitte, bitte, bitte kaufen? Es ist auch wirklich preiswert.Eskostet kaum mehr als 30.000 Mark!'<br>'Wieviel mehr?'<br>'Na ja, so knapp 45.000 DM'<br>'Na gut. Ausnahmsweise. Aber bezahle auf gar keinen Fall mehr als diese45.000.-DM. Verstanden?'<br>'Das ist aber wirklich lieb von dir. Ach Schatzi, weil wir schon geradedabei sind. Ich bin gerade bei unserem BMW-H&auml;ndler vorbei gekommenund der hat doch gerade mein Traumauto im Angebot. Genau mit der Ausstattungund in der Farbe, die ich immer schon so gerne wollt. Er w&uuml;rde mirdas Auto zum Sonderpreis von nur 120.000 Mark &uuml;berlassen. Bitte, bitteSchatzi, kann ich das kaufen?'<br>'Na gut, mein Schatz. Aber versuch' den Preis noch auf 115.000.- DMrunter zu handeln. Ok?'<br>In diesem Moment erkannte sie, dass heute ihr Gl&uuml;ckstag war undsie hakte sofort nach.<br>'Schatz, Du wei&szlig;t doch das ich es gerne h&auml;tte wenn meineMutter bei uns leben w&uuml;rde. Ich wei&szlig; ja, dass Du das nicht m&ouml;chtest,aber k&ouml;nnten wir nicht mal f&uuml;r 3 Monate einen Versuch starten?Wenn es nicht funktioniert, kannst Du doch immer noch 'Nein' sagen. Wasdenkst Du dar&uuml;ber?'&nbsp;<br>'Na gut mein Schatz. Lass es uns einmal versuchen. Aber wenn es nichtklappt ...'<br>'Ich danke Dir mein Schatz. Ich liebe dich &uuml;ber alles. Freue michsehr darauf, Dich heute Abend zu sehen.'<br>'Ich auch, mein Schatz, bis sp&auml;ter dann.'<br>Der Mann legt auf und blickt fragend in die Runde:<p><b><font size=+1>'Wei&szlig; irgend jemand, wem das Handy geh&ouml;rt?'</font></b><p>[WASCHWEIB]-Nadine Alexander</td></tr></table></body></html>