<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>Bioremediation von Schadstoffen oder wie das Gift zu Luft wurde</title></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><a NAME="top"></a><center><p><b><font color="#0000FF"><font size=+4>&Ouml;kologische Artikel&nbsp;</font></font></b><br><b><font color="#0000FF"><font size=+3>&copy; &Ouml;kologisch-DemokratischePartei -&nbsp;</font></font></b><br><b><font color="#0000FF"><font size=+3>Landesverband Niedersachsen.&nbsp;</font></font></b></center><h3>Inhalt:</h3><ul><li><a href="#a01">Bioremediation von Schadstoffen</a></li><li><a href="#a02">Solare W&auml;rmegewinnung</a></li><li><a href="#a03">Der 200j&auml;hrige Mensch</a></li><li><a href="#a04">Ab und zu abschalten</a></li><li><a href="#a05">Schwung mitnehmen</a></li><li><a href="#a06">Spartip zum Heizen</a></li><li><a href="#a07">Und wie heizen Sie?</a></li><li><a href="#a08">Heiz&ouml;l bis zu 50% teurer!</a></li><li><a href="#a09">Die Wasserstofftechnologie - Eine L&uuml;gengeschichte?</a></li><li><a href="#a10">Das Laster Standby</a></li><li><a href="#a11">Was ist eine Kilowattstunde?</a></li><li><a href="#a12">14 Tipps zur Bahn</a></li></ul><hr><a NAME="a01"></a><h2><b>Bioremediation von Schadstoffen oder wie das Gift zu Luft wurde</b></h2>Wir k&ouml;nnen sie nicht sehen, und erst wenn wir krank werden, sp&uuml;renwir sie: Bakterien. Allerdings verdanken wir ihnen auch unser Leben: dieNatur w&uuml;rde in ihrem eigenen Unrat zugrunde gehen, wenn die kleinenMikroben nicht gr&uuml;ndlich ihrer Arbeit nachgehen w&uuml;rden: abgestorbeneOrganismen in ihre Grundstoffe zu zerlegen und somit den Humus f&uuml;rneues Leben zu bilden. Bakterien sind der Motor im nat&uuml;rlichen Kreislaufder Stoffe.<p>Verh&auml;ltnism&auml;&szlig;ig neu im globalen Stoffkreislauf ist dasmenschliche Wirken: Wir entnehmen Stoffe aus unserer Umwelt, wandeln sief&uuml;r verschiedenste Anwendungen um und geben sie nach Gebrauch ver&auml;ndertin die Umwelt zur&uuml;ck. So wird zum Beispiel normales Kochsalz elektrolytischin Salzs&auml;ure und Natronlauge umgewandelt. Zusammen mit Kohlenwasserstoffen,die u.a. aus &Ouml;l isoliert werden, entstehen Kunststoffe. Diese Kunststoffesind stabil gegen nat&uuml;rliche Zersetzung, so da&szlig; sie auf langeZeit dem globalen Stoffkreislauf entzogen sind und, sofern toxisch, zugesundheitlichen und &ouml;kologischen Problemen f&uuml;hren. Abhilfe kannhier die Bioremediation schaffen: sie ist der Einsatz von Biotechnologiezur Entgiftung und zum Abbau von Schadstoffen. Sie ist eine attraktive,preiswerte Alternative zu physikalisch-chemischen Abbauverfahren oder derLagerung auf Sonderm&uuml;lldeponien. Bioremediation kann die vollst&auml;ndigeZersetzung organischer Schadstoffe in ihre nat&uuml;rlichen Ausgangsprodukteerreichen und sie somit in den Stoffkreislauf zur&uuml;ckf&uuml;hren.<p>Grundlage hierf&uuml;r ist die schier unersch&ouml;pfliche Vielfaltbiologischer Reaktionen. In Jahrmilliarden haben sich Bakterien an dievielf&auml;ltigsten Umwelten anpassen m&uuml;ssen. Die F&auml;higkeit,in einer unwirtlichen Welt zurechtkommen zu k&ouml;nnen, haben sie in denErbanlagen archiviert und, falls die Umwelt sich wieder ver&auml;ndert,abrufbereit vorliegen. Die kleinen Helfer l&ouml;sen lebensnotwendige Mineralienaus Gestein, entgiften toxische Schwermetalle, zersetzen organische Materiezu Wasser und Luft und sie k&ouml;nnen sogar viele Xenobiotika - chemischeVerbindungen, die der Mensch erschaffen hat und die w&auml;hrend der 3,5Milliarden Jahren Evolution in der Natur nicht vorkamen - abbauen. AlleReaktionen werden dabei von Biokatalysatoren, den Enzymen, durchgef&uuml;hrt.Der Abbau erfolgt schrittweise bis auf die Grundbausteine: vor allem Wasserund das Gas Kohlendioxid.<p>Bioremediation kann vielf&auml;ltig eingesetzt werden. Die Haupteinsatzfeldersind dabei:&nbsp;<br>a) der Abbau von N&auml;hrstoffen,&nbsp;<br>b) der Abbau von organischen Giftstoffen,&nbsp;<br>c) der Abbau von biologisch neutralen Kunststoffen und&nbsp;<br>d) die Entgiftung und/oder Entfernung von toxischen Schwermetallen.&nbsp;<h3><b>Bioremediation von N&auml;hrstoffen</b></h3>N&auml;hrstoffe sind die f&uuml;r das Wachstum von Organismen notwendigenStoffe, z.B. Kohlenhydrate, Proteine, Phosphor- und Stickstoffverbindungen.Sie sind f&uuml;r das einzelne Lebewesen essentiell und ungiftig, k&ouml;nnenin gro&szlig;en Mengen jedoch &ouml;kologisch sch&auml;dlich sein. EinBeispiel hierf&uuml;r sind die kommunalen Abw&auml;sser: f&uuml;r uns zwareine stinkende Br&uuml;he, die den Appetit d&auml;mpft statt anregt, jedochf&uuml;r die gefr&auml;&szlig;igen kleinen Helferlein ist es leckerer Eintopf!Sie fressen, atmen und wachsen, fressen, atmen und wachsen, und wenn siebrav ihren Teller aufgefressen haben, ist der meiste Sauerstoff verbraucht.In Fl&uuml;ssen oder Seen w&uuml;rde dies nun zum massenhaften Fischsterbenf&uuml;hren und die ehedem gro&szlig;e Artenf&uuml;lle w&uuml;rde sichdrastisch verringern. Der See oder Flu&szlig; w&auml;re zwar noch vollerLeben, aber vom gleichen Reiz wie eine Monokultur. Um dies zu vermeiden,wird das Abwasser in Kl&auml;ranlagen gesammelt. Dort werden die N&auml;hrstoffevon den Bakterien verwertet und abgebaut, das von den N&auml;hrstoffengekl&auml;rte Abwasser kann nun in die Umwelt entlassen werden. Unter denoptimalen Bedingungen einer kommunalen Kl&auml;ranlage wachsen die Mikrobengro&szlig;artig und werden nach Erf&uuml;llung ihrer Pflicht als Brennstoffoder D&uuml;nger weiterverwertet. Vom Feld auf den Teller, ins Abwasser,in die Kl&auml;ranlage und auf das Feld zur&uuml;ck: der Kreis schlie&szlig;tsich.<h3><b>Bioremediation v. organischen Giftstoffen</b></h3>Die gro&szlig;e Gefahr unseres technischen Zeitalters ist die Produktiongro&szlig;er Mengen hochgiftiger und chemisch stabiler Verbindungen undihre Verbreitung in der Umwelt. Beispiele hierf&uuml;r sind chloriertearomatische Verbindungen wie chlorierte Dioxine (u.a. Seveso-Toxin) undPCBs (polychlorierte Biphenyle), die sich im Fettgewebe von Mensch undTier anreichern k&ouml;nnen. Mineral&ouml;le sind Umweltgifte, die immerwieder zu Umweltkatastrophen f&uuml;hren. &Uuml;ber Tankerungl&uuml;cke,Pipelinebr&uuml;che und kleine Unvorsichtigkeiten beim Tanken wird dasUmweltgift freigesetzt und verunreinigt insbesondere das Grundwasser, wodurches die Trinkwasserversorgung gef&auml;hrdet. Konventionelle chemisch-physikalischeProzesse m&uuml;ssen die Giftstoffe erst aus dem Boden isolieren, um siedann zu verbrennen, wodurch wiederum Giftstoffe freigesetzt werden. Bioremediations-Verfahrenhingegen k&ouml;nnen an Ort und Stelle stattfinden: das Abbau-Potentialder dort heimischen Arten kann durch N&auml;hrstoff-Zugabe stimuliert werden,gegebenenfalls k&ouml;nnen auch speziell angepa&szlig;te Bakterien eingesetztwerden. Die Vorteile sind der geringe technische Aufwand und niedrige Kosten,da keine komplexe Apparatur ben&ouml;tigt wird. Ebenso von Vorteil istdie Umweltfreundlichkeit der Verfahrens, da keine neuen Giftstoffe freigesetztwerden. Demgegen&uuml;ber steht jedoch die l&auml;ngere Proze&szlig;dauer.Ebenso von Nachteil ist es, da&szlig; an den meisten Altlasten-StandortenGemische von vielen verschiedenen Giftstoffen vorkommen, die in ihrer Gesamtheitvon Bakterien nur schwer zu knacken sind. &Uuml;ber die Optimierung derMikroorganismen ist es jedoch m&ouml;glich, dieses Problem zu l&ouml;sen.<p>Doch nicht nur B&ouml;den und Gew&auml;sser k&ouml;nnen biologisch gereinigtwerden, sondern auch organisch belastete - und somit stinkende - Luft,z.B. in Kl&auml;ranlagen, Intensivtierhaltung u.a.. Die Mikroorganismenwerden dazu auf einem Tr&auml;ger mit gro&szlig;er Oberfl&auml;che angesiedelt,z.B. Holzsp&auml;ne. Durch diesen Filter wird die verschmutzte Luft geleitet,die Duftstoffe" werden vornehmlich zu Wasser und CO2 umgewandelt und gereinigtverl&auml;&szlig;t die Luft den Filter. &Auml;hnliche Filter k&ouml;nnenauch zur Reinigung von Autotunnelabluft von Kohlenwasserstoffen und Stickoxideneingesetzt werden.<h3><b>Bioremediation von bioabbaubaren Kunststoffen</b></h3>Kunststoffe, die zur Verpackung dienen, sind in der Regel ungiftig undnicht bioabbaubar. Daher sch&auml;digen sie zwar nicht direkt die Umwelt,vergr&ouml;&szlig;ern aber enorm die M&uuml;llmenge und f&uuml;hren indirektzur Schadstofffreisetzung, falls sie verbrannt werden. Eine Alternativeist der Einsatz von bioabbaubaren Kunststoffen mit anschlie&szlig;enderKompostierung.<p>Die bioabbaubaren Kunststoffe k&ouml;nnen aus nachwachsenden Rohstoffenhergestellt und je nach Anwendung ma&szlig;geschneidert werden, so da&szlig;sie ihre Kompostierbarkeit mit guten mechanischen und thermischen Eigenschaftenkombinieren. Nach Gebrauch k&ouml;nnen sie durch Bakterien oder Pilze wiederzu ihren Grundbausteinen Wasser und CO2 umgewandelt werden.<h3><b>Bioremidiation von toxischen Schwermetallen</b></h3>Schwermetalle wie Blei, Cadmium oder Quecksilber finden in vielen industriellenProzessen Verwendung. &Uuml;ber Industrieabw&auml;sser und die Abluft vonM&uuml;llverbrennungsanlagen gelangen sie in die Umwelt und sch&auml;digenalle Lebewesen. Im Gegensatz zu organischen Schadstoffen, die in ihre ungiftigenBausteine zerlegt werden k&ouml;nnen, sind Schwermetalle Elemente, derenMenge nicht ver&auml;ndert werden kann. Allerdings kann die Giftigkeitund die Bioverf&uuml;gbarkeit der Schwermetalle ver&auml;ndert werden.Dazu haben Bakterien, Pilze und Pflanzen viele verschiedene Selbstschutzmechanismenentwickelt:<br>Manche Arten sondern Polymere ab, die selektiv Schwermetalle binden,damit sie nicht in den Organismus gelangen und Schaden anrichten k&ouml;nnen.Andere Arten bilden aus den gut l&ouml;slichen und daher sehr toxischenSchwermetallen schlecht l&ouml;sliche Verbindungen, die nicht mehr in denOrganismus gelangen und daher unsch&auml;dlich sind. Der Vorteil von Bioremediationin diesem Gebiet ist die hohe Selektivit&auml;t biologischer Reaktionen:die Schwermetalle k&ouml;nnen auch schon in geringsten Mengen gebundenoder entgiftet werden. Von Nachteil ist, da&szlig; selbst angepa&szlig;teOrganismen bei zu hohen Schwermetallkonzentrationen absterben. Zur Zeitist die Bioremeditation von Schwermetallen noch keine echte Konkurrenzzu etablierten physiko-chemischen Verfahren.<p>Bioremediation ist eine Technik mit gro&szlig;em Entwicklungspotential,das auf der enormen Vielfalt biologischer Reaktionen beruht. Im Abbau &uuml;bersch&uuml;ssigerN&auml;hrstoffe (kommunale Kl&auml;ranlagen, Luftfilter u.&auml;.) istBioremediation erfolgreich etabliert. Der biologische Abbau organischerGiftstoffe ist bereits bei Mineral&ouml;lverseuchungen gro&szlig;technischetabliert, der Abbau der hochgiftigen Dioxine, PAKs und PCBs hingegen erfolgterst im Laborma&szlig;stab und mu&szlig; noch weiter verbessert werden.Die Remediation bioabbaubarer Kunststoffe ist machbar, jetzt m&uuml;ssendiese umweltfreundlichen Kunststoffe nur noch die M&auml;rkte erobern.Die Bioremediation von Schwermetallen steckt noch in den Kinderschuhen,hat jedoch ein gro&szlig;es Wachstumspotential. Einzelne Prozesse stehenkurz vor der industriellen Anwendung.<p>Harald von Canstein<br>(Der Autor ist Biologe und entwickelt ein Verfahren zur Bioremeditationvon toxischem Quecksilber aus Industrieabw&auml;ssern)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a02"></a><h2><b>Solareenergieforschung Hameln: Solare W&auml;rmegewinnung</b></h2>Der weltweite Verbrauch fossiler Energietr&auml;ger hat in den letztenJahrzehnten rasend zugenommen - und wird noch weiter und noch schnellerzunehmen. Da die Menge fossiler Energitr&auml;ger jedochbegrenzt ist, werdenin naher Zukunft alle Ressourcen verbraucht sein. Das WANN ist unsicher- je nachdem, ob Erd&ouml;l, Kohle oder Erdgas, k&ouml;nnen es nochewenigebis viele Jahrzen&acute;&acute;hnte sein. DAS es passier, ist jedoch unbestritten.Der Zeitpunkt, wann alle fossilen Ressourcen verbraucht sind, h&auml;ngtdabei von verschiedenen Faktoren ab: In der 3. Welt leben 80% der Weltbev&ouml;lkerung,die aber nur 20% der Weltenergie verbraucht. In der 1. Welt verbrauchenjedoch nur 2% aller Menschen 80% der Energie. Gleicht sich die 3. Weltan die 1. Welt an, werden die Ressourcen schneller verbraucht. Reduziertjedoch die 1. Wlt ihren Energieverbrauch, halten die Ressourcen l&auml;nger.<p>Dazu kommt noch der unbekannte Faktor Treibhauseffekt: proportionalzum Verbrauch fossiler Energie steigt die Konzentration des Verbrennungsproduktesund Treibhausgases CO2 in der Atmosph&auml;re an - und damit auch weltweitdie Temperatur. Durch dieses Klima&auml;nderung kann es vermehrt zu Klimakatastrophenkommen, die dann ein Umdenken im Verbrauch fossiler Energie bewirken.<p>Solarenergie bietet sich als unershc&ouml;pfliche, umweltfreundlicheAlternative an. Man unterscheidet zwischen solarer Stromgewinnung (Photovaoltaik)uns solarer W&auml;rmegewinnung. Der &ouml;kologische Nutzen beider istunbestritten. Doch w&auml;hrend die Photovoltaik noch ein Nischendaseinfristet, hat sich die solare W&auml;rmegewinnung auch als &ouml;konomischvorteilhafte Alternative durchgesetzt.<p>F&uuml;r die Nutzung der Sonnenenergie gilt allgemein: die Energiemenge,die j&auml;hrlich auf die Erdoberfl&auml;che strahlt, ist 8000mal h&ouml;herals der Weltenergiebedarf! Die CO2-Freisetzung von Solaranlagen ist imAufbau gering und im Betriev vernachl&auml;ssigbar. Der Sonneng&uuml;rtelum die Erde deckt sich in etwa mit dem Armutsg&uuml;rtel; eine nachhaltigeF&ouml;rderung er 3. Weltl&auml;nder w&auml;re due lokale Produktion vonSoalranlagen und die dezentrale Energieerzeugung (30% der Tunesier sindohne Stromanschlu&szlig;, da zu wie von den wenigen Gro&szlig;kraftwerkenentfernt). Einer Solarenenergienutzung steht aber auch in den gem&auml;&szlig;igtenBreiten nichts entgegen: Mitteleuropa wird mit ca. 1000 kWh pro m2 undJahr bestrahlt, in der Saghara ist es gut doppelt soviel: 2.400 kWh!<p>Das Herzst&uuml;ck einer Anlage zur Solarw&auml;rmegewinnung ist derKollektor: die Sonnenstrahlung durchdringt dessen &auml;u&szlig;ere, lichtdurchl&auml;ssigeAbdeckung und trifft auf ein schwarzes Blech, das dadurch erw&auml;rmtwird. Die W&auml;rme wird durch eine Fl&uuml;ssigkeit, die unter dem schwarzenBlech ziruliert, abtransportiert - z.B. zur Erw&auml;rmung von Schwimmbadwasser,Badewasser oder zur Heizung.<p>Gerade f&uuml;r Schwimmb&auml;der sind Kollektoren sinnvoll: ist eswolkig und katl, wird das Wasser wenig erw&auml;rmt. Aber bei dieser Witterungkommen sowieso kaum Badeg&auml;ste. Ist es jedch sonnig und warm, so kommtdie Hauotmasse der Badeg&auml;ste und findet warmes Wasser vor. Das Dilemmaf&uuml;r die kommunalen Schwimmbadbetreiber ist es, dass die chronischarmen Kommunem nicht das Geld f&uuml;r die Investitionen in Solartechnikaufbringen k&ouml;nnen. obwohl es sich durch die viel niedrigeren j&auml;hrlichenKosten schon nach wenigen Jahren bezahlt machen w&uuml;rde.<p>1913 wurden erste Solarkollektoren f&uuml;r die Erw&auml;rmung von wasserin Haushalten gebaut. Und schon 1936 wurde in Florida fast jedes neue Hausmit Kollektoren versehen. Heute k&ouml;nnen mit 4 bis 8 m2 Kollektorfl&auml;che,einem 200 bis 400 Liter fassenden Wasserspeicher bei einer Solaren Deckungvon 40 bis 65 % (Durchschnittswert f&uuml;r Einfamilienh&auml;user) 200bis 500 Liter Heiz&ouml;l gespart und so 400 bis 1000 kg CO2 vermiedenwerden.<p>Solaranlagen sind wirtschaftlicher, je gr&ouml;&szlig;er sie sind. Dersolare W&auml;rmepreis betr&auml;gt ca. 0,70 DM pro kWh f&uuml;r 1 bis2 Familienh&auml;user, aber nur 0,20 DM pro kWh f&uuml;r Gro&szlig;anlagen.Denkbar w&auml;re eine Gro&szlig;anlage pro Dorf mit einem fro&szlig;en,unterirdiischen W&auml;rmespeicher, der die im Sommer gesammelte W&auml;rmeim Winter zur Hausbeheizung wieder hergibt. Dementsprechende Musterprojektesind in Skandinavien bereits realisiert.&nbsp;<h3><b>Hanf - nachwachsender Rohstoff der Zukunft</b></h3>Der Hanf (wichtigste Art: Cannabis sativa) ist ein zweih&auml;usige Pflanzeund z&auml;hlt zu den h&ouml;chstentwickelten Pflanzenfamilie der Erde.Er ist in holziges, einj&auml;hriges Kraut, das die Sonne effizienter nutztals jede andere Pflanze und in einer nur kurzen Wachtstumszeit die stattlicheH&ouml;he von 4 bis 7 Meter erreicht. Er w&auml;chst in nahezu jedem Klimaund auf fast jedem Boden, selbst in Grenzertragsgebieten; z&auml;hlt zuden Bodenverbesserern, ist eine Pionierpflanze und hat eine hohe Selbstvertr&auml;glichkeit.Da der Hanf sich selbst gegen Sch&auml;dlinge sch&uuml;tzt und durch dendichten Wuchs auch Unkraut unterdr&uuml;ckt, kann problemlos auf den Einsatzsowohl von Pestiziden als auch von Herbiziden verzichtet werden.<p>Er ist mit Abstand der ertragreichste nachwachsende Rohstoff der Erde!<p>Hanf ist ein der &auml;ltesten Kulturpflanzen der Menschheit. Vor ca.7000 bis 8000 Jahren begann die Hanfverarbeitung als Textil. Hanf ist diekr&auml;ftigste und haltbarste nat&uuml;rliche Weichfaser. In Th&uuml;ringenkonnten Ausgrabungsfunde auf ca. 5500 Jahr vor Chr. Zur&uuml;ckdatiertwerden, im Raum Stuttgart wurden 2400 bis 2800 Jahre alte Textilreste ausHanf gefunden. Mindestsnens3000 Jahre lang z&auml;hlte Hanf zu den wichtigstenund am h&auml;ufigsten verwendeten Arzneimitteln (bis Anfang des 20. Jahrhunderts).<p>Zur Geschichte des Hanfs geh&ouml;rt seine Diskriminierung als Rauschmittel,obwohl dies nur ein sehr kleines Anwendungsgebiet bestimmter Hanfsortenist. Dahinter steckte aber ein einflu&szlig;reiche Interessengruppe ausWirtschaft und Politik, die mit unlauteren Methoden das v&ouml;llige Anbauverbot1937 in den USA erreichten. In Deutschland folgte das Verbot 1981. Seit1996 ist der Anbau aber wieder zugelassen, wenngleich auch nur bestimmteTHC-arme Sorten (&lt;0,3%) und nur mit Genehmigung. THC ist Tetrahydocannabinol,der Stoff, aus dem die Tr&auml;ume sind.<p>Seitdem erlebt Hanf eine Renaissance. J&auml;hrlich steigen die Anbaufl&auml;chenz. Zt. Um ca. 30%. In Deutschland hat man ich auf einige Produktlinienkonzentriert, um erst einmal eine Infrastruktur zur Hanfverarbeitung zuschaffen und auch Absatzm&auml;rkte zur&uuml;ckzugewinnen.<p>Ein gutes Beispiel ist Hanfpapier. Aus einem Hektar Hanf l&auml;&szlig;tsich soviel Cellulose gewinnen, wie aus 4,2 ha Wald! Und da auf jedes Jahrgeerntet wird, Holz f&uuml;r die Papierindustrie jedoch je nach Baumsortenur alle 15 bis 20 Jahre geschlagen werden kann, erzielt man pro Fl&auml;cheneinheitim gleichen Zeitraum die ca. 50fache Fasermenge. Diese Fasern haben zudemeine h&ouml;here Qualit&auml;t, sind fester, ben&ouml;tigen viel wenigerChemikalien zur Aufarbeitung und ersparen zudem viel Wasser und Energie.Hanfpapier ist rei&szlig;fester, &ouml;fter recyclebar als Holzpapier undvergilbt nicht (geringer Ligninanteil).<p>Jede Tonne Hanfpapier rettet somit 12 B&auml;umen das Leben, die nichtmehr daf&uuml;r gef&auml;llt werden m&uuml;ssen. Holz ist ein viel zu wertvollerStoff mit eigenen Einsatzm&ouml;glichkeiten, um ihn zur Papierherstellungzu verschwenden. 1988 wurden weltweit 225 Mio. t B&auml;ume allein f&uuml;rdie Papierindustrie gef&auml;llt, mit allen negativen Folgen f&uuml;r dieUmwelt. Allein auf diesem Gebiet lie&szlig;e sich mittelfristig durch dieUmstellung auf Hanfpapier sehr viel positives f&uuml;r die Umwelt tun.<p>Hier k&ouml;nne aus Platzgr&uuml;nden nicht alle M&ouml;glichkeitender Hanfnutzung aufgef&uuml;hrt werden. Amerikanischen Studien zufolgelassen sich ca. 50.000 Artikel aus/mit Hanf herstellen! Allein in den USAk&ouml;nnte die Hanfindustrie durch Substitution anderer Ressourcen einenj&auml;hrlichen Umsatz von gesch&auml;tzten 500 Mrd. bis 1 Billion Dollarerreichen. I Deutschland gibt es eine Studie des Hanfproduktlinienprojektszur Nutzung des Hanfs.<br>Elf Produktlinien aus den Bereichen der Fasern, Sch&auml;ben, Samen/&Ouml;lund Cannabinoide haben gute Chancen, bis zum Jahr 2000 die Basis eine nachhaltigendeutschen Hanfindustrie zu bilden:<ul>&nbsp;<li>Lebensmittel&nbsp;</li><li>Naturkosmetika&nbsp;</li><li>Gamma-Linolens&auml;ure f&uuml;r die Pharma- und Kosmetikindustrie&nbsp;</li><li>Textilien aus kotonisiertem Hanf&nbsp;</li><li>W&auml;rmed&auml;mmvliese (z.B. zur W&auml;rmed&auml;mmung an D&auml;chernund W&auml;nden)&nbsp;</li><li>Spezialzellstoff, auch hochwertiges Papier f&uuml;r Drucker und Kopierer&nbsp;</li><li>Autoinnenverkleidungen (Formpressteile)&nbsp;</li><li>Geotextilien&nbsp;</li><li>Nadelfilzbel&auml;ge&nbsp;</li><li>Medikamente auf nat&uuml;rlicher THC-Basis&nbsp;</li><li>Tiereinstreu&nbsp;</li></ul>Viele weiter Produktlinien sind in Zukunft m&ouml;glich, &uuml;ber Energiegewinnugaus Biomasse, Biodiesel und Biobenzin hin zu Kunststoffen, Farben und Lackeund viele andere Produkte. Heute gibt es bereits divers Kosmetika, Hanfschokolade,Hanfwaschmittel, Hanftextilien, Hanfpapier und, und, und. ... im Fachhandelzu kaufen<p>Um es abschlie&szlig;end in einem Satz zusammenzufassen:<br>Es gibt viel zu tun, pflanzen wirs an!<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a03"></a><h2><b>Der 200j&auml;hrige Mensch oder&nbsp;</b></h2><h3><b>Wie des Fischers Frau doch noch Gott wird und ein ewiges Leben erh&auml;lt- Nur ein M&auml;rchen?</b></h3>Es war einmal ein armer Fischer. Der angelte den ganzen Tag und fing dochnur wenig. Eines Tages aber war ein Butt am Haken, der sprechen konnte,und so lie&szlig; der Fischer ihn frei. Seine Frau schimpfte mit dem Fischerund dr&auml;ngte ihn, den Butt um die Erf&uuml;llung eines Wunsches zubitten: Ein neues Haus! Und der Butt erf&uuml;llte diesen Wunsch. Des FischersFrau aber ward nur wenige Tage damit zufrieden, dann fand sie es zu kleinund dr&auml;ngte ihren Mann, noch einmal den Butt aufzusuchen und sichein Schloss zu w&uuml;nschen. So geschah es. Und wieder w&auml;hrte dieFreud nur kurz und bald wurde wieder die Gier wach: K&ouml;nig wollte siesein! Und sie wurde es. Kaiser wollte sie sein! Sie wurde es. Papst wolltesie sein! So geschah es. Gott wollte sie sein! Sie wurde es - nicht. DerButt schickte sie wieder in ihre alte Fischerh&uuml;tte zur&uuml;ck.<p>Ob die geschundene Natur sich dadurch wieder erholte - durch die Gierder Fischerin wurde die See immer tr&uuml;ber und fauliger, der Himmelwurde schwarz und St&uuml;rme tobten - erz&auml;hlt das M&auml;rchen nicht.Aber es zeigte dem Menschen seine Grenzen auf.<br><b>Fr&uuml;her.&nbsp;</b><h3><b>Ein kurzer Streifzug durch die Medizin</b></h3>Heute hat der Fischer keine Skrupel mehr. Seine Frau muss ihn nicht mehrbedr&auml;ngen, er fordert nun von alleine alle Segnungen der modernenTechnik und Medizin ein.<p>Er will, wenn krank, wieder sofort gesund werden! Voil&aacute;: Tabletten,z.B. Antibiotika und Ger&auml;temedizin. Aber das reicht bald nicht mehr:er will gar nicht erst krank werden! Voil&aacute;: Functional Food, Vitamine,somatische Gentherapie und eine keimfreie Umwelt. Doch das ist auch nichtgenug: Er will bis zu seinem Lebensende jung bleiben! Voil&aacute;: Anti-Aging-Hormone,Radikalf&auml;nger und falls erforderlich, nachwachsende Ersatzorgane.Doch was kann der Fischer sich jetzt noch w&uuml;nschen? Sein Lebensendeimmer weiter zu verschieben, vielleicht gar nicht erst sterben? Nanu, nochkeine L&ouml;sung? Na, dann wollen wir mal weiter forschen...<h3><b>Lebenserwartung: 200 Jahre</b></h3>Heute werden bereits alterungs-stoppende (Anti-Aging-)Medikamente, somatischeGentherapie und nachwachsende Organe wie Nieren, Leber, Haut, Herz oderBauchspeicheldr&uuml;se entwickelt. Anti-Aging-Medikamente sind vielf&auml;ltig,z.B. Radikalf&auml;nger und Telomerase. Radikale sind aggressive Molek&uuml;le,die die Zellstruktur, Enzyme und Erbgut sch&auml;digen und dadurch dieZellalterung und Zelltod beschleunigen. Radikalf&auml;nger entsch&auml;rfendie Radikale. Die meisten Zellen haben eine eingebaute Lebensuhr: Mit jederZellteilung werden die Enden der Chromosonen verk&uuml;rzt, und nach 50bis 100 Zellteilungen sind die Chromosomen soweit verk&uuml;rzt, dass wichtigeGene fehlen und die Zelle stirbt. Das Enzym Telomerase sch&uuml;tzt jedochdie Chromosonen-Enden und stellt die Lebensuhr auf unendlich.<p>Die somatische Gentherapie heilt Krankheiten oder Mangelerscheinungenam fertigen Menschen, die durch Gendefekte in einzelnen Geweben oder imganzen K&ouml;rper hervorgerufen werden (im Gegensatz zur Keimbahntherapie,die Gendefekte von Eizelle und/oder Spermium heilt). Dazu werden gesundeGene in die betroffenen Zellen eingeschleust, die dadurch wieder funktionsf&auml;higwerden.<p>Die Ersatzorgane sollen aus k&ouml;rpereigenen Zellen nachwachsen, d.h.die nachgewachsenen Organe werden mit den alten Organen identisch seinund keine Absto&szlig;reaktion des Immunsystems hervorrufen. Theoretischlassen sich alle Organe und Gewebe nachz&uuml;chten - bis auf das Gehirn:Das Gehirn entwickelt sich, anders als die reinen Stoffwechselorgane, inst&auml;ndiger Reaktion auf die Sinnesreize und durch die st&auml;ndigeInteraktion mit seiner Umgebung. Selbst die baugleichen Gehirne von eineiigenZwillingen entwickeln sich von der ersten Minute an individuell. Das Gehirnist der Sitz der Pers&ouml;nlichkeit eines Menschen, und nach unserer Weltanschauungist der K&ouml;rper nur die H&uuml;lle. Die H&uuml;lle kann daher beliebigver&auml;ndert werden, der Mensch darin bleibt der gleiche. Daher h&auml;ngtdie Lebensdauer des gesamten Menschen von der Lebensdauer des Gehirns ab,und die k&ouml;nnte durchaus 200 Jahre betragen! Aber ist das wirklichdie Grenze? Im Tierversuch konnten selbst Nervenzellen wieder zum Wachstumangeregt werden. Und mit Radikalf&auml;ngern und somatischer Gentherapiek&ouml;nnte auch unser Gehirn viele hundert Jahre alt werden, vielleichtewig leben!<h3><b>Ewiges Leben?</b></h3>Falls aber der Fischer doch nicht f&uuml;r sich selbst ewiges Leben w&uuml;nscht,so kann er es doch seinen Kindern mit auf den sehr, sehr langen Lebensweggeben: Denkbar ist die Konstruktion eines neuen Menschen &uuml;ber dieVer&auml;nderung des Erbguts, z.B. L&ouml;schen der eingebauten Lebensuhr(genauer: Einbau einer kontrollierten, unendlichen Zellteilung), Ausmerzungaller Erbkrankheiten, Programmierung eines verschlei&szlig;freien Stoffwechselsund eines nie nachlassenden Selbstreparatursystems. All diese Therapienstecken noch in den Kinderschuhen und sind Zukunftsmusik. Doch die Kinder,die heute geboren werden, haben beste Chancen, 150 oder 200 Jahre alt zuwerden. Die Kinder von morgen aber k&ouml;nnten ewig leben. Und da einLeben eines der hervorstechenden Merkmale von G&ouml;ttlichkeit ist, werdendie Kinder vom Fischer und seiner Frau dann doch Gott sein.<br>Und dann liest man nur noch im M&auml;rchen"... und wenn sie nichtgestorben sind ..."<h3><b>Der Wunsch nach ewigem Leben</b></h3>Warum w&uuml;nschen sich so viele Menschen ein langes oder gar ein ewigesLeben?<br>Aus biologischer Sicht ist die Frage leicht zu beantworten: All diejenigenLebewesen, die nicht den Wunsch oder Trieb hatten, lange zu (&uuml;ber-)leben, starben tendenziell eher als ihre lebenshungrigen Artgenossen. Undso wurde der Wunsch nach Leben bevorzugt weitervererbt. Wir leben heute,weil unsere Vorfahren sich an ihr Leben geklammert haben. Der Drang zuLeben steckt in unserem Erbgut. Der Biologe stellt daher den Psychologendie Gegenfrage: Wieso ist es vielen Menschen egal, ob und wann sie sterben?Ich kann nur vermuten, was der Psychologe antworten w&uuml;rde. "KulturellePr&auml;gung/Erziehung, pers&ouml;nliche Erfahrungen, z.B. erf&uuml;lltesLeben oder Leid und Schmerz."<h3><b>Die Evolution des Menschen</b></h3>Die Art Homosapiens ist das Produkt von 3 Milliarden Jahren Evolution."Evolution" ist das Produkt bzw. der Kompromiss zwischen Ver&auml;nderungund Konstanz. Unsere Gene ver&auml;ndern sich st&auml;ndig durch fehlerhafteEnzyme, Strahlung und Mutagene. Unser Erbgut, die Summe aller Gene, wirdzus&auml;tzlich von Generation zu Generation neu durchmischt. Dadurch istjedes Lebewesen, jeder Mensch, der auf die Welt kommt, einzigartig - eindurch und durch neuer Mensch. Die Ver&auml;nderung gegen&uuml;ber seinenEltern ist meist nur minimal, kann aber nachteilig oder vorteilhaft sein.Im Laufe der Jahrtausende setzen sich die vorteilhaften Ver&auml;nderungendurch, die nachteiligen verschwinden meist wieder. Dadurch ist eine allm&auml;hlicheAnpassung an eine sich ebenfalls ver&auml;ndernde Umwelt m&ouml;glich:z.B. ein w&auml;rmeres oder k&auml;lteres Klima. Durch eine st&auml;ndigeMutation und Durchmischung unserer Gene und eine anschlie&szlig;ende Auslesekonnte der Mensch sich an die meisten Klimazonen dieser Welt anpassen.<p>Auf abrupte Ver&auml;nderungen in unserer Umwelt, z.B. neue Krankheitserreger(Antibiotikaresistente, pathogene Bakterien; AIDS-Virus), Ozonloch undGlobal Warming, k&ouml;nnen wir uns jedoch nur langsam einstellen - falls&uuml;berhaupt. Das liegt zum einen an unserer langen Generationszeit (nuralle 20-30 Jahre setzen wir eine neue Generation in die Welt) und zum anderenan Reparaturenzymen, die st&auml;ndig versuchen, die Sch&auml;den durchStrahlung und Mutagene zu beseitigen. Diese Schadensbegrenzung hat denVorteil, dass die meisten Kinder gesund zur Welt kommen (Tierarten, indenen die Schadensbegrenzung schlechter ist, haben sehr viel mehr Totgeburten),auf Kosten unserer Anpassungsf&auml;higkeit.<h3><b>Die Weiterentwicklung des Menschen</b></h3>Wie wird sich die Art Homo sapiens weiterentwickeln, wenn die Individuenewig leben? Das h&auml;ngt davon ab, ob sie weiterhin Kinder kriegen wollen.Vermutlich werden die unsterblichen Menschen seltener oder gar keine Kinderkriegen, um ihre Welt nicht zu &uuml;berv&ouml;lkern. Dann wird sich dieArt Mensch auch nur noch langsam - oder gar nicht mehr - fortentwickeln,zumindest nicht auf nat&uuml;rliche Weise. Es sind zwei Alternativen denkbar:<br>a.) Die Umwelt wird f&uuml;r den bisherigen Menschen zu unfreundlich,so dass er sich selbst ver&auml;ndert. Entweder gentechnisch oder kybernetisch(Einbau technischer Hilfsmittel).<br>b.) Die Umwelt wird f&uuml;r den bisherigen Menschen zu unfreundlich,so dass er die ganze Welt kontrollieren muss: Kontrolle des Wetters, desKlimas, der Krankheitserreger. Zur Relativierung sei jedoch darauf hingewiesen:die nat&uuml;rliche, merkliche Weiterentwicklung des Menschen vollziehtsich in Jahrhunderttausenden, an ein Ozonloch (erh&ouml;hte UV-Belastung)kann sich die Menschheit auf nat&uuml;rliche Weise in absehbarer Zeit nichtanpassen.<h3><b>Die Evolution der menschlichen Gesellschaft</b></h3>Das Urprinzip des Lebens ist es, dass Lebewesen als Art unsterblich sind,solange sie fruchtbare Nachkommen zeugen, und dass nur das Individuum sterblichist. Sie wachsen, pflanzen sich fort und sterben. Dies ist der Kreis desLebens. Die zwei bestimmenden Triebe nach Leben und nach Fortpflanzungsind in etwa gleich stark. Nachkommen sind ein doppeltes Kapital f&uuml;rdie Gesellschaft. Zum einen tragen sie unsere Gene weiter und sorgen somitdaf&uuml;r, dass ein Teil von uns weiterlebt und die Art &uuml;berlebt,zum anderen f&uuml;hrt ihr eigener Lern- und Erfahrungsprozess zur Hinterfragungbestehender Denk- und Lebensweisen, zum Aufbrechen verkrusteter Strukturenund hohler Traditionen, zum unvoreingenommenen Einschlagen neuer Wege.<p>Doch schon immer sehnten sich die Menschen nach ewigem Leben f&uuml;rdie eigene Person. Da jedoch kein Mittel gefunden wurde um die irdischeExistenz zu verl&auml;ngern - obwohl die Geschichten vom Jungbrunnen Legionsind - behalf sich der Mensch bisher mit dem Glauben, dass zumindest seineSeele unsterblich sei und auch nach dem irdischen Ableben im Jenseits weiterlebenw&uuml;rde.<p>Die gesellschaftlichen Auswirkungen der Jenseits-Religionen im Diesseitswaren enorm, zum Beispiel die gr&ouml;&szlig;ere Leidensf&auml;higkeitdes Menschen und ihre Anf&auml;lligkeit f&uuml;r Unterdr&uuml;ckung undAusnutzung, wenn ihnen im Jenseits das Paradies versprochen wurde. DerGlaube an ein Paradies hilft auch uns mit einem kurzen und m&uuml;hseligenLeben zu vers&ouml;hnen. Der Trieb nach Leben wurde durch den Glauben abgeschw&auml;cht,dadurch trat der Fortpflanzungstrieb st&auml;rker hervor. Im Gegensatzzu fr&uuml;hen Naturgesellschaften, in denen bei Nahrungsmangel zuerstdie Kinder sterben mussten, wurde nun die Kindst&ouml;tung ge&auml;chtet.Den Erwachsenen half der Glaube ans Paradies, sich f&uuml;r die Kinderzu opfern.<p>Der Wandel von der Naturgesellschaft zu einer Gesellschaft mit Jenseits-Religionbeg&uuml;nstigte die Bev&ouml;lkerungsexplosion seit der Antike, die Selbstaufopferungund das, was wir heute unter Menschlichkeit verstehen. Es entwickelte sicheine kinderreiche Gesellschaft, in der der irdische Tod von gl&auml;ubigenMenschen nicht mehr gef&uuml;rchtet werden musste.<p>F&uuml;r einige Menschen aber war das ewige Leben f&uuml;r die Seelenur ein Trostpreis und so suchten sie den Jungbrunnen, der ihnen ewigesLeben f&uuml;r Leib und Seele schenken sollte. Doch weder mittelalterlicheAlchimie noch Mystik konnten den Jungbrunnen aufsp&uuml;ren.<p>Die moderne biomedizinische Forschung jedoch scheint den Jungbrunnenaufgesp&uuml;rt zu haben. In den letzten ca. 150 Jahren schufen die Fortschrittein Technik und Medizin einen st&auml;ndig steigenden Lebensstandard - nurdurch Kriege zur&uuml;ckgeworfen - in den Industrienationen, gefolgt voneiner st&auml;ndig steigenden Lebenserwartung. Die Lebenserwartung einerDeutschen oder Japanerin ist mit ca. 80 Jahren mehr als doppelt so hochwie die einer Kenianerin. Dies f&uuml;hrte in den Industriestaaten abernicht zu einer Bev&ouml;lkerungsexplosion, denn die gestiegene Lebenserwartungund der Lebensstandard bedingten einen demographischen Wandel: GeringeLebenserwartung und hohe Geburtenraten wurden von hoher Lebenserwartungund niedriger Geburtenrate abgel&ouml;st. Eine Bev&ouml;lkerungsexplosiongibt es nur in der &Uuml;bergangszeit mit bereits hoher Lebenserwartungaber immer noch hoher Geburtenrate. Der demographische Wandel wurde voneinem immensen Werte- und Systemwandel begleitet. Es wandelte sich z.B.die Bereitschaft, f&uuml;r h&ouml;here Werte ehrenamtlich aktiv zu seinin die Fixierung auf das eigene Wohlergehen. Die Sinnstiftung durch Gemeinschaftund soziales Engagement wurde von der Sinnstiftung des Konsums abgel&ouml;st.Sowie sich Einkaufen zum Shopping wandelte, so wandelte sich der Konsumund der G&uuml;terbesitz vom Mittel zum Zweck in Selbstzweck. Der Wandelvon Selbstvorsorge zur staatlichen Alterssicherung und ein Steuersystem,das Familien benachteiligt, verringerten die Bereitschaft, Kinder in dieWelt zu setzen. Man kann von leider oder von zum Gl&uuml;ck sprechen. Tatsacheist, dass unsere Kinderarmut eine &Uuml;berv&ouml;lkerung verhindert, aberauch die Zukunft unserer Steuer- und Rentensysteme, den Generationenvertrag,in Frage stellt.<p>Der Wertewandel, der die Ansammlung gro&szlig;er materieller G&uuml;terhervorbrachte, f&uuml;hrte in Folge zur Zunahme von Verlust&auml;ngsten.Die gro&szlig;e Angst, seinen Besitz zu verlieren und die Angst, sein Lebenund dadurch seinen Besitz zu verlieren, wurden gr&ouml;&szlig;er. Die Menschen,die nicht mehr an ein besseres Leben im Jenseits glauben, klammern sichan ihr Leben im Diesseits mit all seinen greifbaren Verhei&szlig;ungen.Damit einhergeht der Wunsch, maximal viel Lust aus seinem Leben herauszuholen.In unserer erfolgsorientierten Gesellschaft muss die Kosten-Nutzen-Rechnungstimmen, die Lust muss den Frust &uuml;berwiegen. Und je l&auml;nger dasLeben ist, desto mehr kann aus ihm herausgeholt werden. Dabei besteht dieGefahr, dass wir - auf unser eigenes Vergn&uuml;gen fixiert - unser Augef&uuml;r die N&ouml;te anderer verlieren.<p>In einer Gesellschaft, die das Individuum &uuml;ber die Gemeinschaftsetzt, w&auml;re vieles m&ouml;glich: sich einfrieren lassen um sp&auml;terfolgende Generationen zu begl&uuml;cken; sich klonen zu lassen, um seineigenes Ersatzteillager zu haben; sich unsterblich werden zu lassen. Esstellt sich dabei nicht die Frage, ob dies unmoralisch ist, denn es w&auml;rennur die Ausw&uuml;chse einer Gesellschaft mit anderen Werten. F&uuml;reine Gesellschaft von &uuml;ber 6 Milliarden Individuen ist es unerheblich,ob ein einzelner Mensch fr&uuml;h, sp&auml;t oder nie stirbt. Viel wichtigerist es jedoch, welche Auswirkungen es auf die Gesellschaft hat, wenn alleIndividuen gleichzeitig beschlie&szlig;en &auml;lter zu werden oder garewig zu leben. Folgende Frage muss gestellt werden: Ist eine Gesellschaftvon lang- oder ewig lebenden Menschen zukunftsf&auml;hig?<h3><b>Die Weiterentwicklung der menschlichen Gesellschaft&nbsp;</b></h3>Der Soziologe kann erkl&auml;ren, welche Auswirkungen eine l&auml;ngereLebenserwartung in der Vergangenheit hatte. Was aber sind die gesellschaftlichenAuswirkungen in unserer Zukunft? Eine rein materielle Gesellschaft vonkurzlebigen Menschen - unsere heutige Situation - ist jedenfalls nichtzukunftsf&auml;hig, dort gilt die Parole nach uns die Sintflut. Wer nuran sein eigenes Wohl denkt und keine Verantwortung f&uuml;r die eigeneund folgende Generationen tr&auml;gt, der versucht seinen Profit auf Kostender Umwelt zu maximieren. Die Folge sehen wir t&auml;glich in Form vonUmweltverschmutzung und Artenschwund.<p>In einer materiellen Gesellschaft von langlebigen Menschen - die Zukunftunserer heutigen Gesellschaft, wenn die aktuelle Entwicklung nicht beeinflusstwird - sind verschiedene Szenarien denkbar:&nbsp;<h3><b>Szenario 1:&nbsp;<br></b>Entwicklung von Anti-Aging-Medikamenten und Ersatzorganen mit teilsprivaten, teils &ouml;ffentliche Geldern</h3><b>1. Stadium</b><br>Zur Zeit wird die Forschung zum Teil mit &ouml;ffentlichen und zumTeil mit privatwirtschaftlichen Mitteln finanziert. Die Industrie hat nunein Interesse daran, dass die sehr hohen Entwicklungskosten wieder eingespieltwerden. Daher werden die ersten Ersatzorgane und Anti-Aging-Medikamentesehr teuer sein und vermutlich nur in begrenzter Anzahl zu Verf&uuml;gungstehen. Die ersten Nutzer von Ersatzorganen werden daher nur wenige, sehrreiche und/oder privilegierte Menschen sein. Das bedeutet eine Polarisierunginnerhalb unserer Gesellschaft in reich &amp; langlebig und arm &amp; kurzlebig.Die Schere zwischen reich &amp; langlebigen Industrienationen und arm &amp;kurzlebigen Entwicklungsl&auml;ndern wird weiter aufgehen.&nbsp;<p><b>2. Stadium</b><br>Nach 20, 30 Jahren ist die Transplantation von k&ouml;rpereigenen Ersatzorganenund die Vergabe von Anti-Aging-Medikamenten Routine. Durch die Massenanwendungkonnten die Kosten deutlich gesenkt werden und eine breite &Ouml;ffentlichkeitkommt in ihren Genuss. Alle Europ&auml;er, Nordamerikaner oder Japanerk&ouml;nnen nun 200 Jahre alt werden.&nbsp;<p>Falls es noch eine Krankenkasse gibt, w&uuml;rde diese vermutlich f&uuml;rdie Kosten aufkommen. Es stellt sich die Frage, ob jemand, der die lebensverl&auml;ngerndenTherapien ablehnt, mehr Rente erh&auml;lt (er lebt ja k&uuml;rzer) undob er h&ouml;here Krankenversicherungsbeitr&auml;ge zahlen muss (er wirdja schneller gebrechlich). Es stellt sich ferner die Frage, ob ein Langlebigerwieder arbeiten muss oder weniger Rente erh&auml;lt. Oder ob er seinenRentenanspruch verliert?&nbsp;<p>Doch werden sich diese Fragen vermutlich nicht stellen, denn durch denunaufhaltsamen Fortschritt von Produktivit&auml;t und Rationalisierungwerden von noch weniger Menschen noch mehr Werte geschaffen und sp&auml;testensdann kollabiert die Rentenfinanzierung &uuml;ber Besteuerung der Erwerbsarbeit,denn weniger Erwerbst&auml;tigen stehen mehr Rentner gegen&uuml;ber. DieKluft zwischen Entwicklungsl&auml;ndern und Industriestaaten wird gr&ouml;&szlig;er.Vermutlich werden auch die Diktatoren und die gesamte Elite von Schwellen-und Entwicklungsl&auml;ndern ihre Leben verl&auml;ngern lassen. Dann w&uuml;rdevielleicht die dortige politische Lage sich stabilisieren - aber die Bev&ouml;lkerungh&auml;tte keine Hoffnung mehr, einen Despoten durch sein nat&uuml;rlichesAbleben loszuwerden.&nbsp;<p>Da es unsinnig w&auml;re, sein Leben zu verl&auml;ngern, wenn man esin der Folgezeit als &Ouml;lsardine verbringen m&uuml;sste, wird es inden Industriestaaten noch weniger Kinder geben. Die Alternative w&auml;re&Uuml;berbev&ouml;lkerung. Die Verweigerer von lebensverl&auml;ngerndenTherapien w&auml;ren die Au&szlig;enseitergruppe: Skurril aber gesch&auml;tzt,denn jeder Ablebende schafft Platz f&uuml;r Kinder.&nbsp;<p><b>3. Stadium</b><br>Nach weiteren 20, 30 Jahren verkrustet die Gesellschaft, da die Innovationder Jugend fehlt. Die Kultur stagniert und die Wissenschaft f&auml;ngtan, sich in Details zu verlieren, schafft aber kein neues Weltbild mehr.Die Masse der Menschen aber wird gl&uuml;cklich sein, denn sie haben Ver&auml;nderungennoch nie gemocht. Falls die Kluft zwischen Entwicklungs- und Industriel&auml;ndernnicht geschlossen wurde und sich die Welt nicht vers&ouml;hnt hat, so k&ouml;nntennun die agilen, innovativen Schwellen- und Entwicklungsl&auml;nder denalten Industriel&auml;ndern den Rang ablaufen: wissenschaftlich, kulturellund &ouml;konomisch.&nbsp;<h3><b>Szenario2:&nbsp;<br></b>Anti-Aging-Medikamente und Ersatzorgane sind frei verf&uuml;gbar, aberein zu langes Leben ist unerw&uuml;nscht&nbsp;</h3>Die Gesellschaft sucht einen Kompromiss zwischen den Vor- und Nachteileneines verl&auml;ngerten Lebens. Die lebensverl&auml;ngernden Therapienwerden frei zug&auml;nglich und kostenlos sein, es wird vielleicht einGrundrecht auf ein Leben in Gesundheit geben - allerdings nur zu einerwillk&uuml;rlich festgesetzten Grenze, z.B. 100 oder 120 Jahre. Die negativenFolgen wie Kinderarmut und Verkrustung sollen dadurch abgeschw&auml;chtwerden. Das Leben aber wird durch solch eine Mindestlebenszeit kalkulierbar.Das Leben muss nicht mehr exzessiv genossen werden, als w&auml;re jederTag der Letzte. Warum die Kerze von beiden Seiten abbrennen, wenn man einlanges Leben Zeit hat? Dennoch wird es keinen festgelegten Todestag geben:Nach der garantierten Mindestlebenszeit gibt es zwar keine Ersatzorganemehr, aber durch eine gesunden Lebenswandel und mit viel Gl&uuml;ck k&ouml;nnendie Menschen noch viele Jahre (Jahrzehnte) weiterleben.&nbsp;<p>Dieses Szenario &auml;hnelt unserer heutigen Situation: Unsere Apparatemedizinverl&auml;ngert ebenfalls unser Leben - bei jungen Menschen auf Biegenund Brechen, bei &auml;lteren Menschen immer noch sehr energisch, und nurbei sehr alten Menschen wird auf die k&uuml;nstliche Verl&auml;ngerungzuweilen verzichtet.&nbsp;<p>Es stellt sich allerdings die Frage: Wer wird so vermessen sein (oderden Mut haben), die Lebenszeitgrenze festzulegen?&nbsp;<h3><b>Szenario 3:&nbsp;<br></b>Anti-Aging-Medikamente und Ersatzorgane sind frei verf&uuml;gbar, derMensch wird vern&uuml;nftig und heilt die Wunden der Welt&nbsp;</h3>Die Szenarios 1 und 2 gehen noch davon aus, dass der Mensch sich nur wenigwandelt und weitgehend egoistisch und kurzsichtig bleibt. Es w&auml;reaber durchaus denkbar, dass die Menschen mit ihrer verl&auml;ngerten Lebenszeitauch einsichtiger werden. Mag sein, dass der Mensch egoistisch bleibt -aber allein aus Eigennutz wird er mehr auf seine Umwelt achten, denn ihmwird klar, dass er die Folgen seines Handels pers&ouml;nlich ausbaden muss!&nbsp;<p>Bisher lebt der Mensch in der Gegenwart, da er auf die Zukunft nichtbauen kann. Die Zukunft h&auml;lt alles bereit, nichts ist sicher, vielleichtstirbt er ja morgen, vielleicht erst in 80 Jahren. Also genie&szlig;t err&uuml;cksichtslos jeden Tag, als w&auml;re er der letzte. Dadurch aberverbaut er sich und anderen die Zukunft:&nbsp;<br>Umweltverschmutzung, Artenschwund, Schuldenberg, Ressourcenverschwendung- alles h&ouml;chst unvern&uuml;nftig, eines Homo sapiens unw&uuml;rdig.Doch der kurzlebige Mensch erlebt die Folgen seines Handels ja nicht mehr- wohl aber der langlebige Mensch.&nbsp;<p>Der langlebige Mensch wird aus Eigennutz lernen m&uuml;ssen, Verantwortungzu tragen und umsichtig zu handeln. Er wird dann automatisch zu einem nachhaltigenWirtschaftssystem kommen und die S&uuml;nden der Vergangenheit heilen.&nbsp;<p>Aber es bleiben Fragen: Werden die Menschen tats&auml;chlich einsichtig?Immerhin - die Alten von morgen sind die Jungen von heute, und allzuvielEinsichtsf&auml;higkeit und Vernunft gibt es heutzutage nicht. Was w&auml;re,wenn der Mensch von morgen mehr egoistisch als einsichtig ist? K&ouml;nntees auch zu einem neuen Imperialismus kommen, wenn die alten und weisenIndustriel&auml;nder beschlie&szlig;en, dass die jungen Entwicklungsl&auml;nderzu unvern&uuml;nftig mit ihren Ressourcen umgehen und daher bevormundetwerden m&uuml;ssen?&nbsp;<h3><b>Szenario 4:&nbsp;<br></b>Alle Menschen werden mindestens 200 Jahre alt, kriegen Kinder wie bisher,dennoch gibt es keine &Uuml;berbev&ouml;lkerung&nbsp;</h3>Was w&auml;re, wenn der Mensch so gro&szlig;e Fortschritte in der Raketentechnikmacht, dass er sogar ferne Sonnensysteme erreichen und besiedeln kann?&nbsp;<p>Dann k&ouml;nnten alle Menschen, die des Lebens auf der alten, &uuml;bervollenErde satt sind, auf fremden Planeten weiterleben. Dann g&auml;be es keineObergrenze mehr f&uuml;r die Anzahl der Menschen, sie k&ouml;nnten vielehundert Jahre alt werden und dennoch alle 20 - 30 Jahre eine neue Generationzeugen. Gleich mehrere Menschheitstr&auml;ume w&uuml;rden sich erf&uuml;llen- zu den Sternen fliegen und ewig leben.&nbsp;<p>Allein ist es &uuml;berhaupt w&uuml;nschenswert, dass die Menschheitdas Weltall kolonialisiert?&nbsp;<p>Wenn die Menschheit mit all Ihrer Unvernunft und Habsucht wie eine Seuchedurch das All wandert, &ouml;kologisch zerst&ouml;rte Planeten hinter sichzur&uuml;cklassend?&nbsp;<p>F&uuml;r die Ausbildung von Einsicht und Verantwortungsgef&uuml;hl istes sicherlich besser, wenn wir auf einem Planeten bleiben. Es w&uuml;rdedie Motivation, unsere Umwelt zu sch&uuml;tzen, gef&auml;hrlich sabotieren,wenn noch eine Ersatz-Erde zur Verf&uuml;gung st&auml;nde.&nbsp;<p>Nur einer vernunftgeleiteten und verantwortungsvollen Menschheit darfes gestattet werden, auf fremde Welten zu siedeln.&nbsp;<h3><b>HappyEnd</b></h3>Der Narr l&auml;uft ohne Ziel los und vertraut darauf, dass er irgendwound irgendwann ankommt. Der Weise aber sucht sich erst das Ziel und n&auml;hertsich ihm dann. Wir sollten miteinander alle denkbaren Alternativen im Geistedurchspielen und diskutieren. Wo liegen die Chancen, wo die Risiken? WelcheKonsequenzen wird unser Handeln von heute auf morgen haben?&nbsp;<p>Sie, liebe Leser, haben nun einige Fakten, Argumente und Gedankenspielegelesen. Vermutlich sind Ihnen auch Gedanken zur Fortentwicklung unsererGesellschaft gekommen, die hier noch gar nicht erw&auml;hnt wurden. Wirm&ouml;chten nun, dass Sie uns Ihre Meinung mitteilen. In der n&auml;chstenmiteinander bieten wir ein Forum f&uuml;r die Gegen&uuml;berstellung derverschiedenen Meinungen. Wenn wir alle Pros und Contras gegen&uuml;berstellenund im Hinblick auf unsere Verantwortung f&uuml;r folgende Generationenabw&auml;gen, dann k&ouml;nnen wir alle zusammen die Richtung der k&uuml;nftigenbiomedizinischen Forschung bestimmen und dabei sicher sein, dass wir soleben, dass Zukunft bleibt.<p>(Harald von Canstein;<br>Biologe an der Gesellschaft f&uuml;r Biotechnologische Forschung (GBF).Dort werden neben biologischen Umweltschutzverfahren auch neue Impfstoffeund nachwachsende Organe entwickelt. Als Science-Fiction-Fan macht vonCanstein sich mit Vorliebe Gedanken dar&uuml;ber, welche Auswirkungen unserheutiges Handeln auf die Zukunft hat (und welcher Science-Fiction-AutorRecht behalten wird). Beisitzer im Landesvorstand)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a04"></a><h2><b>Ab und zu abschalten</b></h2><h3><b>Wissen Sie eigentlich, was ein Auto im Standgas verbraucht?&nbsp;</b></h3>Dies ist von verschiedenen Faktoren abh&auml;ngig: Motortechnik und -hubraum,ob der Motor kalt oder warm ist, welche Zusatzger&auml;te bzw. Stromverbraucher(z. B. Klimaanlage) eingeschaltet sind.<p>So ben&ouml;tigt z.B. ein warmer 1,6 Liter 16 Ventilemotor in einemOpel Astra ca. 0,6 Liter Superbenzin pro Stunde, im kalten Zustand ca.4 Liter. Ein Opel Omega mit einer 2-Liter-Maschine und 16 Ventilen liegtkalt bei ca. 6 Litern Superbenzin die Stunde. Im warmen Zustand laufenpro Stunde ca. 1 Liter, wenn eine Klimaanlage eingeschaltet ist sogar ca.1,5 Liter pro Stunde durch den Motor. Dies bedeutet, dass pro Minute auchbei einem warmen Motor zwischen 0,01 und 0,025 Liter Benzin im Wert von2 bis 5 Pfennig ohne jede Vorw&auml;rtsbewegung verbraucht werden. Angesichtsdieser Tatsache ist es sinnvoll, den Motor bei Stopps auszuschalten. Angeschlossenen Bahn&uuml;berg&auml;ngen tut dies wohl die Mehrheit, aberbei weitem nicht alle. Aber auch an Ampeln, die oft 1 Minute und l&auml;ngerRot-zeigen ist dies sinnvoll. Gerade auf Ihrer 'Hausstrecke' wissen Sie,wie lange es dauert, bis Ihnen das Weiterfahren wieder erlaubt wird. Einenguten Hinweis auf bald freie Fahrt stellen hierbei die kreuzenden Fussg&auml;ngerampelndar: Erh&auml;lt der Fussg&auml;nger Rot, dauert es meist nur noch wenigeSekunden, bis der Autofahrer Gr&uuml;n bekommt und kann deshalb den Motorwieder rechtzeitig starten.<p>Dieses Verhalten kann auch in &Ouml;kofahrschulen und Fahrseminarenperfektioniert werden. Ein Schaden f&uuml;r das Auto ist aufgrund langj&auml;hrigerPraxiserfahrungen in den &Ouml;kofahrschulen nicht zu erwarten.<br>Und was bringt Ihnen das? - Eine Benzinersparnis von mehreren Liternje hundert Kilometern Stadtfahrt. Unter anderem durch eine Technik, diedas Abschalten und Wiederanlassen automatisch vornimmt, ist der VW Lupoin einer Version zum 3-Liter-Auto geworden.&nbsp;<p>Sie sehen, abschalten lohnt sich!&nbsp;<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)&nbsp;<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a05"></a><h2><b>Schwung mitnehmen</b></h2>Mit den geregelten Dreiwege-Katalysatoren f&uuml;r Autos ist die Einspritztechnikin fast alle Automotoren eingezogen. Diese Technik hat noch einen weiterenVorteil f&uuml;r die Umwelt mitgebracht: Die Schubabschaltung. Die Schubabschaltungsorgt daf&uuml;r, dass absolut kein Benzin verbrannt wird, wenn Sie vomGaspedal gehen und sich rollen lassen. Erst kurz vorm Standgas nimmt dieBenzinzufuhr ihren Betrieb wieder auf.&nbsp;<p>Was bedeutet dies f&uuml;r die Praxis? Wenn Sie auf eine rote Ampeloder ein Ortsschild zufahren, lassen Sie den Gang eingelegt und tretennicht die Kupplung. Wenn Sie keinen Drehzahlmesser haben, erkennen Siean einem leichten Ruckeln, dass die Benzinzufuhr wieder aufgenommen wurdeund Sie herunterschalten m&uuml;ssen, um wieder mit Nullverbrauch weiterzufahren/-rollen.Bei einem Auto mit Drehzahlmesser liegt die Grenze bei ca. 1000 Umdrehungenpro Minute.&nbsp;<p>Wieviel Sie damit sparen k&ouml;nnen? Wenn Sie auf der Landstra&szlig;eunterwegs sind und alle 5 km ein Ort kommt, k&ouml;nnen Sie jeweils 500m vorm Ort vom Gas gehen. Dann sind Sie i.d.R. noch ca. 60 km/h schnell,wenn Sie am Ortsschild etwas abbremsen m&uuml;ssen. Ergebnis: 10 von 100km fahren Sie ohne jeden Benzinverbrauch. Fahren Sie hingegen mit Tempo100 bis 50 m vor das Ortsschild und bremsen stark ab, sind Sie nur 1 von100 km ohne Benzinverbrauch gefahren und haben je nach Auto bis zu 1 Literpro 100 km mehr verbraucht. Und das um lediglich 90 Sekunden auf 100 kmschneller zu sein!&nbsp;<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a06"></a><h2><b>Spartip zum Heizen</b></h2>Sicher sagt Ihnen der Begriff Heizungsabsenkung bzw. Nachtabsenkung etwas.Damit ist gemeint, dass nachts die Raumheizung auf ein besonderes Programmeingestellt wird. Dieses Programm sorgt daf&uuml;r, dass in der eingestelltenZeit, i.d.R. nachts, die Heizung gar nicht oder nur auf Sparflamme l&auml;uft.Die Raumtemperatur sinkt hierdurch im Laufe der Nacht um einige Grad, wasnicht auff&auml;llt, weil Sie in der Regel in dieser Zeit im kuscheligenBett liegen. Die Gefahr, dass die Heizung einfriert, weil die Au&szlig;entemperaturunter 0 Grad f&auml;llt, existiert nicht, da die Heizungsanlage durch einenAu&szlig;entemperaturf&uuml;hler fr&uuml;hzeitig diese Gefahr erkennt unddann auch nachts heizt.<p>Dieses Heizungsabsenkungsprogramm k&ouml;nnen Sie auch nutzen um tags&uuml;berEnergie zu sparen. Wie? Unsere Heizung bietet zum Beispiel die M&ouml;glichkeit,t&auml;glich vier Heiz-Zeiten f&uuml;r alle sieben Kalendertage einzustellen.So sehen z.B. bei uns die Zeiten aus:<br>&nbsp;<table BORDER=0 summary="" ><tr><th ALIGN=LEFT>Wochentag</th><th ALIGN=LEFT>1. Zeitgruppe</th><th ALIGN=LEFT>2. Zeitgruppe</th><th ALIGN=LEFT>3. Zeitgruppe</th><th ALIGN=LEFT>4. Zeitgruppe</th></tr><tr><td>Montag</td><td>5:40 h - 7:00 h</td><td>8:00 h - 12: 00 h</td><td>13:00 h - 17:00 h</td><td>18:00 h - 20:30 h</td></tr><tr><td>Dienstag</td><td>5:40 h - 7:00 h</td><td>-</td><td>13:00 h - 17:00 h</td><td>18:00 h - 20:30 h</td></tr><tr><td>Mittwoch</td><td>5:40 h - 7:00 h</td><td>-</td><td>13:00 h - 17:00 h</td><td>18:00 h - 20:30 h</td></tr><tr><td>Donnerstag</td><td>5:40 h - 7:00 h</td><td>8:00 h - 12: 00 h</td><td>13:00 h - 17:00 h</td><td>18:00 h - 20:30 h</td></tr><tr><td>Freitag</td><td>5:40 h - 7:00 h</td><td>-</td><td>13:00 h - 17:00 h</td><td>18:00 h - 21:30 h</td></tr><tr><td>Samstag</td><td>7:40 h - 9:00 h</td><td>10:00 h - 12:00 h</td><td>13:00 h - 17:00 h</td><td>18:00 h - 21:30 h</td></tr><tr><td>Sonntag</td><td>7:40 h - 9:00 h</td><td>10:00 h - 12: 00 h</td><td>13:00 h - 17:00 h</td><td>18:00 h - 20:30 h</td></tr></table><p><b>Erl&auml;uterung/Erg&auml;nzung:</b><br>Wir sind vier Personen (2 Sch&uuml;lerinnen 5 x von 7.30 h bis 13.30h au&szlig;er Haus wg. Schule; 1 Mutter, die eine Woche zwei, die andereWoche drei Tage arbeitet; 1 Vater der f&uuml;nf Mal tags&uuml;ber arbeitet)und stehen in der Woche gegen 6.00 h, am Wochenende ab 8.00 h auf und findenabends gegen 23.00 h ins Bett. Bei einer herk&ouml;mmlichen Heizungseinstellungmit normal eingestellter Heizungsabsenkung w&uuml;rde die Heizung ca. 122,5h (t&auml;glich von 5.30 h bis 23.00 h) und ohne Heizungsabsenkung sogar168 h pro Woche laufen. Unsere Heizung l&auml;uft so ca. 54,5 h (44 %)bzw. 99 h (59 %) weniger pro Woche. Die Energieeinsparung liegt zwar beider Heizenergie etwas niedriger, da die R&auml;ume etwas st&auml;rker ausgek&uuml;hltsind, aber selbst die H&auml;lfte bedeutet eine Ersparnis von ca. 3.000kWh Gas pro Jahr, welche ca. 180,00 DM kosten w&uuml;rden. Ferner l&auml;uftdie strombetriebene Heizungspumpe, die 30 Wh ben&ouml;tigt, ca. 2.180 hbzw. 3960 h pro Jahrweniger, was 65 bzw. 119 kWh Stromminderverbrauch oder23,00 bzw. 42,00 DM Ersparnis bedeutet. Deshalb schauen Sie auch in IhrerHeizungsbeschreibung nach oder fragen Ihren Installateur. Sie werden sehen,das Einstellen ist gar nicht schwer.<p>Und wenn Sie eine neue Heizungsanlage kaufen, fragen Sie nach, ob dieSteuerungsanlage einen solchen Funktionsumfang bietet. Teilweise sind sogardie Steuerungsanlagen nicht mehr im Geh&auml;use der Heizung integriertund k&ouml;nnen separat an jeder Stelle des Hauses (z.B. K&uuml;che) installiertwerden. So k&ouml;nnen Sie dann ohne Gang in den Keller die Heizung sosteuern, wie Sie m&ouml;chten.<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a07"></a><h2><b>Und wie heizen Sie?</b></h2>Was f&uuml;r ein Heizungssystem ist das richtige? Finanziell und/oder &ouml;kologisch?Grunds&auml;tzlich gilt, je besser das Haus isoliert ist, desto wenigerHeizenergie wird ben&ouml;tigt. Aber wie erzeugt man die ben&ouml;tigteRestw&auml;rme?<p>Die schlechteste Variante f&uuml;r den Geldbeutel ist die elektrischeNachtspeicherheizung. Im Vergleich zu &Ouml;l und Gas bezahlt man in etwadas Doppelte pro kWh Energie. Das kann in einem normalen Winter mehr alstausend Mark ausmachen. Wenn dann auch noch herk&ouml;mmlicher Strom verwandtwird, wird bis zu drei Mal mehr Prim&auml;renergie verbraucht mit ebensodreifacher Abgasbelastung. Diese Faktoren sprechen mit der Tr&auml;gheitdieses Heizungssystem daf&uuml;r, es, wenn bereits vorhanden, kurzfristigauszutauschen. Auch wenn die Energieversorger bei der Installation vonNachtspeicherheizungen zum Teil &uuml;ppige Zusch&uuml;sse gew&auml;hren,bekommt es dem Verbraucher und der Umwelt schlecht. Nur im Zusammenspielmit &Ouml;kostrom w&auml;re es &ouml;kologisch akzeptabel, aber noch teurer.<p>Die n&auml;chst bessere Stufe w&auml;ren &Ouml;l- und Gasheizung, ambesten mit Brennwerttechnik, die ein Maximum an Energie aus dem Brennstoffholt. Preislich hat das Heiz&ouml;l die Nase vorn. Allerdings hat der Nutzereinen h&ouml;heren pers&ouml;nlichen Aufwand im Vergleich zum Erdgas ausder 'Leitung': Er muss den Heiz&ouml;ltank selbst im Auge behalten undschauen, ob gen&uuml;gend &Ouml;l noch vorhanden und auch alles dicht ist.Von der &Ouml;kobilanz ist Erdgas besser, da bei der Verbrennung im Vergleichzu Heiz&ouml;l nur ca. die H&auml;lfte an CO2 anf&auml;llt. Neu auf denMarkt kommen derzeit Holzheizungen, die mit Holzpallets, das sind gepressteHolzabf&auml;lle, befeuert werden. Da es sich um einen nachwachsenen Rohstoffhandelt, ist der CO2-Aussto&szlig; nicht klimarelevant. Die Heizung versorgtsich aus dem Holzvorrat weitgehend selbst&auml;ndig und hinterl&auml;sstnur minimal Asche. Hierdurch sind Eingriffe des Nutzers nicht t&auml;glicherforderlich.&nbsp;<p>Sinnvoll ist auch die Nutzung einer elektrischen W&auml;rmepumpe. DieseHeiztechnik funktioniert wie ein umgedrehter K&uuml;hlschrank und holtaus einer kWh Strom bis zu 4 kWh W&auml;rme aus der Umwelt. Damit ist beiherk&ouml;mmlichem Strom die Umweltbelastung &auml;hnlich hoch wie bei&Ouml;l und Gas. Finanziell ist die Anschaffung teurer, der laufende. Betriebetwas billiger als &Ouml;l und Gas. Wird &Ouml;kostrom verwandt sinkt,die Umweltbelastung auf Null, w&auml;hrend die finanzielle Belastung steigt.Grunds&auml;tzlich sei hier auch noch angemerkt, dass die W&auml;rmepumpeam effektivsten mit einer Fu&szlig;bodenheizung arbeitet.<p>F&uuml;r mich pers&ouml;nlich k&ouml;nnte die W&auml;rmepumpe mit &Ouml;kostromdie L&ouml;sung der Zukunft f&uuml;r alle Altbauten sein. Bei Neubautenlautet die L&ouml;sung Null-Energie-Haus, welches sehr gut isoliert istund im Sommer solargewonnene W&auml;rme in Speichern f&uuml;r den Winterspart.<p>Es lohnt sich aber auf jeden Fall schon heute, sich Gedanken zu machenund gegebenfalls zu handeln. So wird sich unser pers&ouml;nlicher Umstiegvon der Nachtspeicherheizung zur derzeitigen Gasheizung finanziell und&ouml;kologisch innerhalb von 10 Jahren bezahlt machen. Das ist doch schonwas!<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a08"></a><h2><b>Heiz&ouml;l bis zu 50% teurer!</b></h2>Angesichts dieser Preissteigerung lohnt es sich, noch mehr &uuml;ber einebessere Nutzung der Heizenergie nachzudenken. Aber wie kann man auf Heiz&ouml;lverzichten, wenn man im Winter nicht frieren will? Und gleich ein neuesHaus bauen, w&auml;re doch &uuml;bertrieben!<p>Auch aus einem Altbau kann ein 6-Liter-Haus (d.h. ein Heizbedarf von6 Litern Heiz&ouml;l bzw. 6 Kubikmetern Erdgas pro Quadratmeter Wohnfl&auml;cheund Jahr) werden. Und dies kostet kein Verm&ouml;gen, vieles kann man selbstmachen,um bis zu 80% weniger zu verbrauchen.<br>Mit dem Isolieren des Dachbodens erreicht man meistens gleich mehrereZiele:<ul>&nbsp;<li>Einen oder mehrere R&auml;ume (z.B. Kinderzimmer, Hobbyraum, Rumpelkammer)zus&auml;tzlich&nbsp;</li><li>Wesentlich weniger W&auml;rmeverluste, da W&auml;rme nach oben steigt unddurch die d&uuml;nnen Ziegel und vielen Ritzen sehr schnell nach au&szlig;engelangt&nbsp;</li><li>Im Sommer heizt das Haus sich wesentlich langsamer auf, so dass nachtsder Schlaf leichter zu finden ist.&nbsp;</li><li>Die Kosten sind im Verh&auml;ltnis zur Energieeinsparung in einem gutenVerh&auml;ltnis: Ab 1.000 DM geht es los, wenn alles in Eigenarbeit gemachtwird. Kommen noch Gipswandplatten, Fenster, Vert&auml;felung usw. hinzu,so kann die Rechnung auch die 10.000 DM erreichen, aber dann ist neue Wohnfl&auml;chehinzugekommen. Die besten Jahreszeiten f&uuml;r die Arbeiten sind Fr&uuml;hjahrund Herbst, weil die Temperaturen unter dem Dach dann ertr&auml;glich sind.&nbsp;</li><li>Das Isolieren der Au&szlig;enwand mit Styropor plus Reibeputz ist auchdurch einen Fachbetrieb, der z.T. auf seine Arbeit 10 Jahre Garantie gibt,preiswert m&ouml;glich. Ein ganzes Einfamilienhaus zu verkleiden kostetca. 20.000 DM, erspart aber vielleicht auch den gerade f&auml;lligen Fassadenanstrich.Eine Verklinkerung mit Isolierung kostet bis zu siebenmal mehr, weil oftdas Fundament verst&auml;rkt werden muss, bringt aber von der W&auml;rmeisolierungnicht mehr.&nbsp;</li><li>Der Einsatz von Thermostatventilen sollte obligatorisch sein. Es ist andersnicht m&ouml;glich, dass die Raumtemperatur optimal an die Bed&uuml;rfnisseangepasst wird. Die Kosten liegen bei ca. 100 DM je Heizk&ouml;rper undrechnen sich bald. F&uuml;r R&auml;ume, die immer nur zu bestimmten Zeitengenutzt werden, empfiehlt sich die Montage von zeitgesteuerten Thermostatventilen.Zu den programmierten Zeiten wird auf die gew&uuml;nschte Temperatur geheizt,ansonsten bleibt in dem Raum die Heizung aus. So k&ouml;nnte z.B. die Badheizungnur morgens und abends laufen, w&auml;hrend das Wohnzimmer den ganzen Tagbeheizt wird. Dies spart noch mal extra.&nbsp;</li><li>Ein wichtiger Faktor sind auch die Fenster. Durch moderne Fenster und Rahmengeht wesentlich weniger Heizenergie verloren. Ein Austausch sollte miteinem Fachbetrieb besprochen werden. Am besten nimmt man den Tausch dannvor, wenn ohnehin die Zimmer tapeziert werden sollen, weil so zus&auml;tzlicherDreck und Arbeit vermieden werden.&nbsp;</li><li>Auch sinnvoll ist die Montage von Roll&auml;den (mit Isolierung in denLamellen):</li><ol><li>Sie senken die Energieverluste in der kalten Jahreszeit.</li><li>Sie halten im Sommer die W&auml;rme drau&szlig;en.</li><li>Sie erh&ouml;hen den Einbruchschutz.</li><li>Sie mindern die L&auml;rmbelastung von drau&szlig;en.</li></ol></ul>Aber auch die T&uuml;ren nach drau&szlig;en sollten Sie im Auge behalten.T&uuml;ren, in denen ein Briefkastenschlitz ist, kommen Ihnen im Winterteuer zu stehen, da sehr viel W&auml;rme verloren geht. Aber auch &auml;ltereT&uuml;ren mit oftmals einfach verglasten Fl&auml;chen sind nicht gut.Als preiswerte Soforthilfe reicht ein Vorhang aus dickem Stoff vor derT&uuml;r, wenn dieser von der Decke bis auf den Fu&szlig;boden reicht.Sie werden sich wundern, wie massiv im Winter die T&uuml;r von innen zufriert.Wenn Sie gen&uuml;gend Geld f&uuml;r eine T&uuml;r &uuml;brig haben, erkundigenSie sich am besten auch nach gut isolierten T&uuml;ren.<p>Dass diese Ma&szlig;nahmen schon ausreichen k&ouml;nnen, um die Heizenergiemassiv zu senken, haben wir an unserem Haus gemerkt, denn unser ca. 1950gebautes Haus kommt mit oben genannten 6 Litern aus, was vor einigen Jahrennicht ansatzweise gereicht h&auml;tte.<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a09"></a><h2><b>Die Wasserstofftechnologie - Eine L&uuml;gengeschichte?&nbsp;</b></h2>Die Autoindustrie will in den n&auml;chsten Jahren die ersten Autos mitWasserstofftechnologie auf den Markt bringen. Auch in anderen Bereichensoll Wasserstoff bislang genutzte Energietr&auml;ger ersetzen. Es scheintdie Zeit nach dem Ende von Benzin und den anderen fossilen Energietr&auml;gerngeregelt. Nicht nur die Erde wird sich weiterdrehen - nein, auch das Autoradund alle Maschinen. Ist dem wirklich so? Was ist dran an der Wasserstofftechnologie?&nbsp;<p>Grunds&auml;tzlich ist es richtig, dass Wasserstoff das Zeug dazu hat,Benzin oder andere Energietr&auml;ger (z.B. Kohle oder Erdgas) oder bessergesagt Energiespeicher (Batterien) zu ersetzen. Wasserstoff ist ein Gas,welches in speziellen, relativ preisg&uuml;nstigen Motoren (Brennstoffzellen)unter Energieerzeugung "verbrannt" bzw. mit Sauerstoff verbunden wird (oxidiert).Hierbei entsteht H2O oder schlicht gesagt Wasser(dampf) - ein absolut ungiftiger,geruchsloser Stoff. Ebenso kann der Wasserstoff auch in geringf&uuml;gigver&auml;nderten Otto-Motoren als Benzinersatz verbrannt werden. Aus diesemGrund ist die Verbrennung von Wasserstoff eine sehr interessante Sachef&uuml;r die Autoindustrie, da selbst bei Sommer- oder Wintersmog solcheAutos fahren k&ouml;nnten, da sie die Smogsituation definitiv nicht verschlechtern.Im Vergleich zu Elektrobatterien hat Wasserstoff den Vorteil, dass diegleiche Menge Energie weniger Volumen und Gewicht hat. Aber auch die M&ouml;glichkeitdes sehr schnellen "Nachtankens" zeigt, dass sich Wasserstoff wohl gegen&uuml;berElektrobatterien in sehr vielen Bereichen durchsetzen wird.<p>Aber wo ist der Haken? Die meisten F&uuml;rsprecher vergessen (vors&auml;tzlich)zu erw&auml;hnen, woher der ben&ouml;tigte Wasserstoff kommt. (BMW fragtzum Beispiel, warum sollten sie ein 3-Liter-PKW entwickeln, sie h&auml;ttendoch einen Wasserstoffwagen - mit 200 PS!) Es gibt zwar weltweit fast unbegrenztviel Wasserstoff, allerdings nicht pur, sondern in chemischen, stabilenVerbindungen, die bekannteste und h&auml;ufigste ist wohl H2O (Wasser).Dementsprechend muss erst die H2O-Verbindung unter Einsatz von Energiein Wasserstoff und Sauerstoff aufgel&ouml;st werden, damit Wasserstofff&uuml;r die Erzeugung von Energie zur Verf&uuml;gung steht. Aufgrund vonUmwandlungsverlusten ist hierbei insgesamt festzustellen, dass nur danndie Zwischenumwandlung/-speicherung sinnvoll ist, wenn hierdurch ein h&ouml;hererWirkungsgrad erreicht wird. So w&auml;re der Einsatz von Erd&ouml;l f&uuml;rdie Erzeugung von Wasserstoff f&uuml;r das Auto nur dann sinnvoll, wenndie Verluste bei der Wasserstofferzeugung und dem anschlie&szlig;endenVerbrauch in der Brennstoffzelle bzw. im Otto-Motor geringer w&auml;renals die des Automotors beim Verbrennen von Benzin. Dieser Sachverhalt istnicht auszuschlie&szlig;en, da Automotoren erhebliche Energie in nichtben&ouml;tigte W&auml;rme umwandeln und deshalb einen schlechten Wirkungsgradhaben.<p>Eindeutig sinnvoller eingesetzt ist das Speichermedium Wasserstoff,um regenerativ erzeugte Energie speicherbar und auch transportabler zumachen. Als Beispiel sei hier z.B. der nicht ans &ouml;ffentliche Stromnetzangeschlossene Berghof, der mit Photovoltaik- und/oder Windkraftanlagenseine eigene Energieversorgung betreibt. Mit der Umwandlung &uuml;bersch&uuml;ssigerEnergie in Wasserstoff, hat er die M&ouml;glichkeit auch gr&ouml;&szlig;ereMengen Energie f&uuml;r wind- und sonnenarme Zeiten zu speichern. Selbstin gr&ouml;&szlig;eren Bereichen, wie einige deutsche Nordseeinseln k&ouml;nnteso ganzj&auml;hrig auf saubere, da umweltfreundlich erzeugte Energie zur&uuml;ckgegriffenwerden. Der Einsatz von z.B. Dieselaggregaten k&ouml;nnte entfallen.<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a10"></a><h2><b>Ger&auml;t aus - oder doch an? Das Laster Standby</b></h2>Wer regelm&auml;&szlig;ig seinen Stromz&auml;hler kontrolliert, stelltoft fest, dass selbst wenn er im Urlaub ist, reichlich Strom in seinemHaushalt verbraucht wird. Wie kommt dies?<br>Es gibt im Prinzip drei Arten von Elektroger&auml;ten:<ol>&nbsp;<li>) Fr&uuml;her war das Ger&auml;t &uuml;blich, welches an der Steckdoseangeschlossen und &uuml;ber einen Anschalter eingeschaltet wurde. Wennes aus war, wurde auch wirklich nichts verbraucht. Heutige Beispiele hierf&uuml;rsind z.B. Lampen. Weitere Beispiele zu finden ist heute schon schwer, dennviele Ger&auml;te fallen mittlerweile in die n&auml;chsten Gruppen.&nbsp;</li><li>) Standby-Ger&auml;te sind Ger&auml;te, die offensichtlich, aber oft auchunbemerkt Strom verbrauchen. Jedes Ger&auml;t, welches eine elektrischeUhr eingebaut bekommen hat, ben&ouml;tigt auch st&auml;ndig Strom und dakommt schnell einiges zusammen: Videorecorder, HIFI-Anlage, Radiowecker,Mikrowelle, Kaffeemaschine mit Timer usw.. Hinzu kommen dann noch die Ger&auml;te,die eigentlich komplett ausgeschaltet werden k&ouml;nnten, aber gar keinenAusschalter besitzen: Satellitenreceiver, PC-Drucker, PC-Scanner usw..&nbsp;</li><br>Ferner gibt es noch Ger&auml;te, die scheinbar am Schalter ausgeschaltetsind, sich aber dennoch Strom aus der Steckdose g&ouml;nnen: HIFI-Anlagenoder andere Ger&auml;te mit Soft-Touch-Schaltern (das sind Schalter, dienicht gedr&uuml;ckt sondern nur ber&uuml;hrt werden m&uuml;ssen), PCs,Ger&auml;te mit externen Akkus, bei denen der Schalter erst im Hauptger&auml;tkommt (z.B. Nintendo).<li>) Die letzte Gruppe sind Ger&auml;te, die tats&auml;chlich immer laufenm&uuml;ssen: K&uuml;hlschrank, Tiefk&uuml;hltruhe, Anrufbeantworter, Faxusw..</li></ol>Aufgrund der obigen Beispiele sehen Sie, dass der Stromverbrauch schnellin die H&ouml;he gehen kann, ohne dass Sie einen Nutzen haben. So kanndas h&auml;usliche B&uuml;ro mit PC, Drucker, Scanner, Fax und Anrufbeantworter,selbst ohne einmal eingeschaltet zu werden, im Jahr bis zu 800 kWh (= ca.240,00 DM) verbrauchen. Aber dies k&ouml;nnen Sie selbst beeinflussen,in dem Sie beim Kauf fragen oder noch besser in der Beschreibung nachlesen,ob das Ger&auml;t einen Ausschalter hat und wie hoch der Stromverbrauchim Auszustand, Standby-Betrieb und Betrieb ist. Bei Ihrer Kaufentscheidungsollten Sie dann ber&uuml;cksichtigen, dass 1 Watt Mehrverbrauch bei einemStandby-Ger&auml;t jedes Jahr ca. 2,50 DM kostet. So hat z.B. einer derMarktf&uuml;hrer bei Laserdruckern sich den Ausschalter f&uuml;r ein paarPfennige gespart - zur Belohnung wird der K&auml;ufer in der Lebensdauerdes Druckers 50,00 DM und mehr zus&auml;tzlich an seinen Energieversorgerzahlen d&uuml;rfen. Da kann das billigere Ger&auml;t teurer werden alsdas teuerste Ger&auml;t mit Spartechnik. Bei bereits vorhandenen Ger&auml;ten(z.B. Satellitenreceivern oder oben beschriebenes B&uuml;ro) k&ouml;nnenSie den Standby austricksen, in dem Sie eine Steckerleiste mit Ausschalterdazwischen setzen. Die Kosten von ca. 5,00 DM holen Sie in ein paar Monatenwieder rein.<p>Und was kann die &ouml;dp f&uuml;r Sie tun? - Einerseits die Industriein die Pflicht nehmen, auf ihren Produkten klar in Watt aber auch DM proJahr draufzuschreiben, wie hoch der Verbrauch in welchem Zustand ist. Andererseitsmittels Steueranreizen (geringerer MwSt-Satz f&uuml;r sehr sparsame Ger&auml;te)den Verbrauchern den Kauf teurer Sparger&auml;te n&auml;her bringen. DasInteressante dabei ist, dass eine Kalkulation bei K&uuml;hlschr&auml;nkenergeben hat, dass der Staat hierdurch nicht mehr oder weniger Mehrwertsteuereinnimmt als wenn der B&uuml;rger die Energieverschwender kauft. Momentanverdient der Staat an den Energiesparern sogar mehr!<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a11"></a><h2><b>1 kWh? Was ist eine Kilowattstunde?</b></h2>Mit 1 kWh Energie k&ouml;nnen Sie in einem Drei-Literauto immerhin 3,3Kilometer weit fahren, bei einem Durchnittsauto mit einem Verbrauch von8 Litern ist bereits nach 1,25 km Schlu&szlig;. Ein Formel 1- Renner mitseinem Verbrauch von &uuml;ber 60 Litern hat gar nach knapp 160 Meternseine Kilowattstunde verbraucht. (ca. 0,1 Liter Benzin = 1 kWh = 3,6 MegaJoule)<p>Wenn Sie hingegen die eine Kilowattstunde nutzen wollen, um sich einenTee zu kochen, k&ouml;nnen sich 9,3 Liter Leitungswasser von 10 auf 100Grad Celsius erw&auml;rmen. Zu einem Wannenbad bei 35 Grad reicht es hingegennicht, denn mit nur 33,4 Liter ist Schluss. Aber vielleicht reicht es Ihnenja zum Duschen?&nbsp;<br>(ca. 0,1 Liter Heiz&ouml;l = ca. 0,1 Kubikmeter Erdgas = 1 kWh = 3,6Mega Joule = 3.600 kJ)<br>9,55 kg Wasser * 4,19 kJ/kg [W&auml;rmekapazit&auml;t] * (100 Grad- 10 Grad [W&auml;rmedifferenz]) = 3.600 kJ<br>34,37 kg Wasser * 4,19 kJ/kg [W&auml;rmekapazit&auml;t] * (35 Grad- 10 Grad [W&auml;rmediffernze]) = 3.600 kJ<p>Wollen Sie im Licht sitzen, k&ouml;nnen Sie mit einer 6 Watt-Sparlampefast ein halbes Jahr lang dies t&auml;glich eine Stunde (166 Tage) tun.Setzen Sie auf herk&ouml;mmliche Gl&uuml;hlampen mit gleicher Leuchtkraft(40 Watt), geht bereits am Ende des ersten Monats (25. Tag) das Licht aus.(Selbiges gilt &uuml;brigens auch f&uuml;r Halogenlampen, denn diese sindkeine Sparlampen! Sie werden zwar mit i.d.R. 12 Volt betrieben, verbrauchenaber dennoch gleichviel Strom wie eine herk&ouml;mmliche Gl&uuml;hlampen.)<p>Wenn Sie hingegen Lasten mit einer Kilowattstunde anheben wollen, k&ouml;nnenSie einen 50 kg (=500N) schweren Sack immerhin 7.200 Meter h&ouml;her abstellen..<p>(500 N [Gewicht] * 7200 m [Strecke] = 3.600 kJ)<p>(Die Ergebnisse sind ohne Ber&uuml;cksichtigung von Energieverlustenwie Reibung, W&auml;rmestrahlung usw. angegeben.)<br>(Ralf Blechschmidt, stellvertretender Landesvorsitzender)<br><a href="#top">zum Inhaltsverzeichnis</a><hr><a NAME="a12"></a><h2><b>14 Tipps zur Bahn und 1 x Kurioses</b></h2><h3><b>Tip-Nr 1 zur Bahn:</b></h3>Sollten Sie einmal keine Reservierung f&uuml;r den ICE, mit dem sie fahrenwollen, gekauft haben, probieren Sie ihr Gl&uuml;ck im Wagen-Nr. 7. DieserWagen ist nicht reservierbar. Diesen Wagen gibt es aber nur in den ICEs,die nicht geteilt sind. Aber die Reservierung ist sicherer, denn ist derZug voll, gibt es auch im Wagen-Nr. 7 nur Stehpl&auml;tze!<h3><b>Tip-Nr. 2 zur Bahn:</b></h3>Mittlerweile gibt es bei der Bahn auch die kurzfristige Reservierung. Selbstwenn der Zug noch kurz vor dem Einfahren ist, gibt es noch Pl&auml;tzeder Express-Reservierung, die noch gebucht werden k&ouml;nnen.<h3><b>Tip-Nr. 3 zur Bahn:</b></h3>Die Bahn ist wesentlich p&uuml;nktlicher als ihr Ruf - oder k&ouml;nnenSie als Autofahrer stets sagen, wie lange Sie bis z.B. Ihrer Arbeitsstellebrauchen. Wenn Sie Ihre schnellste Fahrt als Grundlage nehmen, wie oftkommen Sie dann zu sp&auml;t? Stiftung Warentest hat bereits 2 MinutenFahrzeitverl&auml;ngerung bei der Bahn als Versp&auml;tung bezeichnet.<br>Wenn der ICE mehr als 30 Minuten Versp&auml;tung hat, haben Sie Anspruchauf einen ICE-Zuschlag-Gutschein, den Sie bei der n&auml;chsten ICE-Fahrtnutzen k&ouml;nnen. Sie k&ouml;nnen hiermit bis zu 40 DM sparen. Oft bekommenSie diesen Gutschein nicht freiwillig im Zug ausgeh&auml;ndigt, also sprechenSie offensiv den Zugbegleiter an.<h3><b>Tip-Nr. 4 zur Bahn:</b></h3>Im ICE gibt es f&uuml;r Reisende mit Kleinkinder ein spezielles Kleinkinderabteil,da&szlig; in der ICE-2-Serie sogar noch &uuml;ber Krabbelm&ouml;glichkeitenverf&uuml;gt. Dann verfliegt die Fahrzeit noch schneller f&uuml;r die Kleinen...<br>Ohnehin ist Bahnfahren f&uuml;r Kinder zwischen 4 und 18 sowie derenEltern etwas ganz anderes. Im Auto ist die Stimmung sp&auml;testens nachder ersten Frage Wie lange dauert es noch? gereizt. Im Zug rennt hingegendie Zeit zwischen Spielen, dem gemeinsamen Fr&uuml;hst&uuml;ck, dem Zeitunglesen,dem Gespr&auml;ch und dem kleinen Nickerchen zwischendurch. Probieren Siees mal aus.<h3><b>Tip-Nr. 5 zur Bahn:</b></h3>Im 2.-Klasse-Wagen des ICEs direkt neben dem Speisewagen gibt es eine behinderten-und kleinkindergerechte Toilette. Hier k&ouml;nnen Kinder bequem gewickeltwerden - und es ist f&uuml;r alle hygienischer. Aber auch in den neuenNahverkehrsz&uuml;gen sind immer h&auml;ufiger behinderten- und kleinkindergerechteToiletten eingebaut. Fragen Sie, wenn Sie mit Kleinkinder reisen, vorhernach, ob auf der gew&uuml;nschten Strecke auch ein solcher Wagen f&auml;hrtund w&auml;hlen Sie diesen.<h3><b>Tip-Nr. 6 zur Bahn:</b></h3>Auch in Niedersachsen gibt es jetzt endlich das Niedersachsen-Ticket f&uuml;r40 DM. Es funktioniert im Prinzip wie das alte 35-DM-Ticket (mittlerweile40 DM; DB-Name: Sch&ouml;nes Wochenend-Ticket), nur da&szlig; Sie (mitbis zu 4 Mitreisenden) erst ab 9.00 Uhr in allen Nahverkehrsz&uuml;genin Niedersachsen, Bremen und Hamburg fahren d&uuml;rfen. Und diese Nahverkehrsz&uuml;gefahren teilweise ganz sch&ouml;n weit, so da&szlig; auch weit entfernteZiele ohne h&auml;ufiges Umsteigen in einer akzeptablen Zeit erreicht werdenk&ouml;nnen. Im Internet unter www.bahn.de k&ouml;nnen Sie sich einfachihre Verbindung heraussuchen. Machen Sie doch mal den Test aufs Exempelmit Familie, Freunden oder Bekannten. Bahnfahren ist dann spottbillig.<h3><b>Tip-Nr. 7 zur Bahn:</b></h3>Besitzer von Monatskarten haben mehr von der Bahn. Je nachdem welche Monatskarteman gekauft hat, darf man am Samstag oder am Samstag und Sonntag bis zu4 Erwachsene mitnehmen - und zwar in den Z&uuml;gen, f&uuml;r die die Monatskartegilt, das kann auch ein ICE sein.<h3><b>Tip-Nr. 8 zur Bahn:</b></h3>Wer mit der Bahn t&auml;glich in ein Gebiet mit einem Verkehrsverbund pendelt,sollte sich ausrechnen, ob es nicht billiger ist statt mit der DB-Monatskartef&uuml;r die Gesamtstrecke nur mit einer DB-Monatskarte bis zum erstenBahnhof im Verkehrsverbund und ab da mit einer Monatskarte des Verkehrsverbundeszu fahren. (Beispiel: Hildesheim - Braunschweig kostet die DB-Monatskartemehr als die Monatskarte Hildesheim - Woltwiesche (=erster Bahnhof im VerkehrsverbundBraunschweig) plus einer Monatskarte f&uuml;r den Verkehrsverbund - unddie Stra&szlig;enbahn in Braunschweig ist auch mit drin.<h3><b>Tip-Nr. 9 zur Bahn:</b></h3>Wenn Sie sich &uuml;ber die Bahn mal ge&auml;rgert haben, weil ein Mitarbeiterextrem patzig war oder die Reise mehr als schlimm war, schreiben Sie andie Bahn. Erstens kann (und wird) die Bahn darauf reagieren und oft f&uuml;r&Auml;nderungen sorgen. Zweitens haben Sie die Chance, einen Gutscheinzu erhalten, um das Leid etwas zu mildern. (So etwas kriegen Autofahrernicht, wenn jemand zu ihnen unfreundlich war.)<h3><b>Tip-Nr. 10 zur Bahn:</b></h3>Wu&szlig;ten Sie, da&szlig; die Bahnkarte auch in vielen Bussen akzeptiertwird? Fragen Sie gezielt nach, denn von sich aus erz&auml;hlt Ihnen dasfast niemand. Wenn der Bus bei Ihnen auch die Bahnkarte akzeptiert undihre Kinder gelegentlich auch den Bus bezahlen m&uuml;ssen, sollten Sie&uuml;ber den Kauf einer Familienbahnkarte nachdenken. F&uuml;r einmal65 DM haben dann alle Ihre Kinder die Chance 50% bei jeder Busfahrt zusparen - eine lohnende Investition.<h3><b>Tip-Nr. 11 zur Bahn:</b></h3>Kennen Sie schon Familien-Spar-Preise? - F&uuml;r 249 bis 399 DM (je nachErwachsenenanzahl und Bahncard) k&ouml;nnen Sie quer durch die Republikund zur&uuml;ck fahren. W&auml;re doch vielleicht was f&uuml;r den n&auml;chstenUrlaub? - Fragen Sie doch bei der Bahn oder im Reiseb&uuml;ro mal nach!<h3><b>Tip-Nr. 12 zur Bahn:</b></h3>Die zweite Bahnkarte in Lebensgemeinschaften kostet jetzt wie bei Ehepaarenauch nur 130,00 DM. Und schon haben Sie Ihre erste gemeinsame Fahrt schonfast wieder drin....<h3><b>Tip-Nr. 13 zur Bahn</b></h3>In ICEs und IC/ECs gibt es Steckdosen z.B. f&uuml;r Notebooks. Also stehtdem Arbeiten beim Reisen nichts im Wege. Dennoch sollten Sie immer aucheine Mehrfachsteckdose dabei haben, damit Sie nicht zusehen m&uuml;ssen,wie ihr Gegen&uuml;ber, der zuerst da war, die Steckdose allein benutzt.<h3><b>Tip-Nr. 14 zur Bahn:</b></h3>Es gibt mittlerweile sehr attraktive Gruppenpreise. Bis zu 75 % Rabatt(mehr als mit einer Bahncard) sind drin. Also mit Familie und Freundenzur Bahn und sich schlau machen. Die Preise sind wirklich gut.<h3><b>Kurioses:</b></h3>Wu&szlig;ten Sie, da&szlig; die Lufthansa etwas gegen die Versp&auml;tungenauf den innerdeutschen Fl&uuml;gen unternommen hat? Es wurde einfach dieregul&auml;re Flugzeit verl&auml;ngert. Jetzt sind z.B. auf Fl&uuml;genvon Hamburg nach Frankfurt 15 Minuten Kreisen &uuml;ber der Landebahn planm&auml;&szlig;ig.Die Bahn hat derzeit nicht vor, dieses Anti-Versp&auml;tungskonzept zu&uuml;bernehmen!<br>(rb)<a href="#top">zum Inhaltsverzeichnis</a><hr><p>Texte wurden eingesandt durch Alexander (Zaquarta) Drews&nbsp;<br>(Abdruckgenehmigung f&uuml;r die NoCover liegt vor),<br><hr></td></tr></table></body></html>