<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [WASCHWEIB] Rapunzel</title><!-- Author = Thea Petersen --></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#00007F"><font size=+4>Rapunzel</font></font></b></center><p>Ob bei dem Alten total tote Hose war oder warum das erst nicht geklappthat, weiss wahrscheinlich mal wieder keine Sau. Jedenfalls mu&szlig; dasP&auml;rchen schon ziemlich antik gewesen sein, als das endlich mal flupptevon wegen Nachwuchs.&nbsp;<p>Aber so Weiber sind ja komische People. Die Alte war n&auml;mlich keineSpur spitz auf Rollmops oder Schlubbergurken oder so'n Kram, das w&uuml;rdman ja noch wegtun. Die war affenarschgeil auf das Gr&uuml;nzeug, das daim Schrebergarten nebenan 'rumstand. Die waren wahrscheinlich an der M&uuml;sli-Front- die Alten - oder sonst irgendwie solche K&ouml;rnerfresser oder &Ouml;ko-Freaks.Jedenfalls hat 'se st&auml;ndig an ihren Alten 'rangen&ouml;lt, sie m&uuml;&szlig;tsich was von dem gr&uuml;nen Krempel reinschieben, sonst w&uuml;rd 'sewohl die M&uuml;cke machen. Verlangt nat&uuml;rlich von ihrem Alten, da&szlig;er das Zeug ranschleppen soll!&nbsp;<p>Erst immer von Emanzipation oder so'nem Schwachsinn quatschen, aberwenn's zur Sache geht, ziehn die Weiber den Schwanz ein! Kennt man ja reichlich!Naja, schlie&szlig;lich hat se wohl so abgeschlafft und ausgebufft ausgesehen,da&szlig; der Alte die Muffe kriegt und denkt, jetzt schmei&szlig;t sebald den L&ouml;ffel weg. Und da hat er eben nachts mal so ne Tour durchden nachbarlichen Gr&uuml;nstreifen gestartet. Das ging auch erst allespaletti. Aber die Alte konnte den Hals wohl nicht voll genug kriegen undwollte immer mehr von dem Gr&uuml;nfutter.&nbsp;<p>Is ja logo, was kommen mu&szlig;: die Mutter, der die Landschaft geh&ouml;rtund die wohl reichlich ein Blatt raushatte, kommt da eines Nachts angebeamtund rei&szlig;t einen unglaublichen Zoff runter. Aber als 'se dann h&ouml;rt,da&szlig; die Alte nen Brot im Ofen hat und so, da sagt se dann, es w&auml;ralles paletti, aber als Gegenleistung f&uuml;r's geklaute Gr&uuml;nfutterwill sie dann den Balg haben, wenn er abgenabelt ist.&nbsp;<p>Naja, ich hab zwar null Ahnung, warum dieser alte Softi der Mutter nichtden Marsch geblasen hat, vielleicht hat er ja inzwischen selbst die Hosengestrichen voll von wegen Kindergepl&auml;rr und so, jedenfalls geht daswohl klar mit dem Handel. Und weil der Gr&uuml;nkram Rapunzel hie&szlig;,hat das Balg auch gleich seinen Namen weg. "Rapunzel"-totaler Wahnsinn,da lacht sich ja jeder nen Ast. Aber zu lachen gab's wohl nicht so dicke,weil die beknackte Mutter n&auml;mlich den Balg in so'nem Turm im Waldverriegelt.&nbsp;<p>Da war nat&uuml;rlich auch null mit anderen Typen. Daf&uuml;r kam dieMutter immer angeschl&uuml;rft, rief "hey, Rapunzel, schmei&szlig; maldeine Fransen &uuml;ber Bord" oder so, und dann mu&szlig; sich diese meschuggeMutter in einer affenartigen Geschwindigkeit an den Haaren zum Turm hochgehangelthaben. So lief das wohl ne ganze Weile, und die Rapunzel mu&szlig; inzwischen'nen ziemich hei&szlig;er Ofen geworden sein. Jedenfalls kommt dann einesTages son Typ durch den Wald geschlurft, sieht die Braut auf dem Turm,f&auml;hrt voll auf die ab und schnallt auch die Story mit den Haaren.&nbsp;<p>Der - am n&auml;chsten Tag - nix wie hin, l&auml;&szlig;t den Tarzanschreivon wegen Haare runterschmei&szlig;en los, und das floppt auch voll. Alser oben angeturnt kommt, hauts die Braut nat&uuml;rlich erst mal voll ausden Socken, aber dann findet se den Typ wohl bockstark und die beiden knallenunheimlich los. Ne ganze Weile ham se dann wohl jeden Abend so ne hei&szlig;eKiste gelandet, bis die beknackte Mutter das schnallt und voll ausflippt.Erst schleppt sie die Rapunzel ab in die Pampa, wo die sich dann auch promptvermehrt. Dann s&auml;belt sie der die Haare ab, l&auml;&szlig;t die Lockenvom Turm, als der Typ wieder angelatscht kommt; und der hechtet sich auchdaran hoch.&nbsp;<p>Als er oben ankommt, ist er wie vorn Latz geballert, als er die vertrocknetePflaume sieht, macht nen Salto r&uuml;ckw&auml;rts den Turm runter, istziemlich demoliert und mit Gucken is wohl nix mehr. Dann schn&uuml;rt erblind so'n bi&szlig;chen in der Gegend rum, h&ouml;rt aber die Braut inder Pampa singen und weil sie so happy ist, wie'sen sieht, flennt se wohl.Jedenfalls kullern angeblich zwei Tr&auml;nen auf dessen Glotzb&ouml;ppel,und der kann wieder gucken. Aber da hab ich so meine Zweifel. Hat wahrscheinlicheher so'n Wunderheiler seine Finger drin gehabt und unheimlich viel Kohledaf&uuml;r kassiert.&nbsp;<p>[WASCHWEIB]&nbsp; - Thea Petersen</td></tr></table></body></html>