<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [WASCHWEIB]  Rotk&auml;ppchen - im Computerdeutsch </title><!-- Author =  Thea Petersen--></head><body text="#000000" bgcolor="#B0B0B0" background="bgh.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#000080"><font size=+4>Rotk&auml;ppchen - im Computerdeutsch</font></font></b></center><p>Es war einmal ein kleines, s&uuml;&szlig;es M&auml;dchen, das immerein K&auml;ppchen aus rotem Samt trug. Aufgrund dieses Attributes erhieltes ein Assign unter dem symbolischen Alias "Rotk&auml;ppchen".<p>Eines Tages sprach die Mutter: "Rotk&auml;ppchen, die Gesundheit DeinerGro&szlig;mutter hat einen Interrupt bekommen. Wir m&uuml;ssen ein Pflege-Programmentwickeln und bei Gro&szlig;mutter installieren, um das Problem zu l&ouml;sen.Auf Deinem Path dorthin verirre Dich jedoch nicht im Walde der alten Sprachen,sondern gehe nur strukturierte Wege. Nutze dabei immer eine Hochspracheder 4. Generation, dann kann sich Gro&szlig;mutter schnell wieder recovern.Und achte darauf, da&szlig; Dein Pflege-Programm transaktionsorientiertist, damit es die Gro&szlig;mutter nicht noch mehr belastet."<p>Da der Weg zum Haus der Gro&szlig;mutter reentrant war, traf Rotk&auml;ppchenden b&ouml;sen Wolf. Er tat sehr benutzerfreundlich, hatte im Backgroundjedoch schon einen Abort auf dem Stack. W&auml;hrend Rotk&auml;ppchen einenGoto ins nahegelegene Blumen-Array machte, ging der Wolf im Direktzugriffzur Gro&szlig;mutter und erasete sie unverz&uuml;glich durch einen Delete.Ohne lange Waitstates, gab er sich den Anschein kompatibel zu sein undnahm die logische Sicht der Gro&szlig;mutter an. Dann legte er sich inihren Speicherplatz.<p>Kurz danach lokalisierte auch Rotk&auml;ppchen die Adresse der Gro&szlig;mutterund trat in den Speicherraum. Vor Installation des Pflege-Programms machteRotk&auml;ppchen sicherheitshalber einen Verify und fragte: "Ei Gro&szlig;mutter,warum hast Du so gro&szlig;e Augen?" "Weil ich zufriedene Endbenutzer sehe.""Ei Gro&szlig;mutter, warum hast Du so gro&szlig;e Ohren?" "Damit ich dieW&uuml;nsche der User besser verstehen kann." "Ei Gro&szlig;mutter, warumhast Du so ein gro&szlig;es Maul?" "Damit ich Dich besser canceln kann!"Sprachs und nahm das arme Ding als Input. Nach einem Logoff machte derWolf einen Power-down, aktivierte seinen Sleep-mode und begann laut zuschnarchen.<p>Als der J&auml;ger auf seinem Loop durch den Wald am Directory der Gro&szlig;muttervorbeiscrollte, sah er durch ein Window den Wolf in seinem Segment liegen."Finde ich Dich hier, Du alter S&uuml;nder", sprach er, "ich habe Dichschon lange auf meiner Task-list !". Als Kenner der Scene analysierte ersofort, da&szlig; nach den Regeln der Boolschen Algebra die Gro&szlig;mutternur im Kernel des Wolfes sein konnte. Er nahm sein Capture-Tool, teilteden Bauch des Wolfes mit einigen Cuts in mehrere Sektoren und machte, welch'Freude, die Grossmutter und Rotk&auml;ppchen wieder zu selbstst&auml;ndigenModulen. Als Fillpattern f&uuml;r den leeren Bauch nahmen sie viele KilobyteDry-Stones und beendeten die Operation mit einem Close.<p>Als der Wolf erwachte, verursachte ihm sein derma&szlig;en aufgebl&auml;hterHauptspeicher solche Protection Faults, da&szlig; er an einer Storage Violationj&auml;mmerlich zugrunde ging.<p>Da waren alle vergn&uuml;gt. Das Pflege-Programm aktivierte die Gro&szlig;mutter.Rotk&auml;ppchen aber dachte: 'Du willst dein Lebtag nie wieder einen Gotomachen, sondern nur noch strukturierte Wege gehen, wie dir's die Muttergeboten hat.'<p>[WASCHWEIB]&nbsp; - Thea Petersen</td></tr></table></body></html>