<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title> [WASCHWEIB] Sterntale</title><!-- Author =  Thea Petersen--></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><b><font color="#000080"><font size=+4>Sterntaler</font></font></b></center><p>Die Goldi war wohl'n abgewracktes Heimkind oder so, die Alten jedenfallswaren vom Schlitten gerutscht oder hatten sich sonstwie abgemeldet. Naja,der Bunker war auf alle F&auml;lle f&uuml;r die Goldi gelaufen und 'semu&szlig;te sehen, da&szlig; sie ihren Krempel selber managte.<p>Bis auf ihre Klamotten hatte 'se Null und die Knete reichte gerade malnoch f&uuml;r'n doppelten Cheesburger. Und wie se da so langschn&uuml;rtund sich eben den Cheesy reinschmeissen will, macht 'se so'n Alter an,er h&auml;tte unheimlich Kohldampf und will was zu bei&szlig;en. Da gibtdoch die beknackte Kuh dem Typ tats&auml;chlich den ganzen Cheesy r&uuml;ber,statt selber die Mampfe zu machen. Also, wenn 'se eins im Heim h&auml;tteschnallen k&ouml;nnen, dann ja wohl, da&szlig; 'se auf die Tour nie annen Goldzahn kommt.<p>Naja, vielleicht war 'se ja auch auf'm Human-Trip oder so. Jedenfallskam da schon wieder so'n Macker angeschlurft, der jammerte rum, da&szlig;ihm der Arsch abfriert und da&szlig; er unheimlich scharf auf Goldis Parkaw&auml;r. Und die, gehirnamputiert wie nix, sch&auml;lt sich aus dem Kaftan,und der Typ dampft damit ab. Aber der dickste Hammer kommt erst noch.<p>Kommt doch da so'ne Mutter angelatscht und n&ouml;lt rum, sie h&auml;tteso eisige K&auml;sequanten und ob sie nich Goldis Moon-Boots abstaubenk&ouml;nnte. Und das Weib ist doch tats&auml;chlich so beknackt und r&uuml;cktdie auch noch raus. Also St.Martin war da Null dagegen. Und dann gibt diedoch kurz darauf so'ner Braut auch noch ihre Jeans und nem Kumpel im Waldihr T-Shirt. Und wie 'se so mit Null am Body dasteht, kommt auf einmalirre viel Zaster von oben runtergerauscht, und 'nen mordsm&auml;&szlig;igenFummel hatt 'se auch pl&ouml;tzlich an.<p>Also, mich k&ouml;nnen die nich ver*rschen. Entweder die Goldi hatteunheimlich einen geschmissen und war auf'm Wahnsinns-Trip oder das Ganzeist wieder mal ne Story aus der B*ld-Zeitung<p>[WASCHWEIB]&nbsp; - Thea Petersen</td></tr></table></body></html>