<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>Der Toaster </title><!-- Author = Cord Hagen --></head><body text="#000000" bgcolor="#B0B0B0" background="bga.gif">&nbsp;<table BORDER=0 CELLPADDING=8 WIDTH="100%" summary="Seitenlayout mit Rand" ><tr><td><center><h1><b><font color="#0000FF"><font size=+4>Der Toaster</font></font></b></h1></center><b><font size=+2>SAP</font></b><br>Wenn SAP Toaster herstellen w&uuml;rde, w&auml;re das Bedienungshandbuchca. 10000 Seiten dick, der Toaster h&auml;tte 2500 Schalter, die alle nachexaktem Muster eingeschaltet werden m&uuml;ssten. Ein Team von Basis- undFunktionsunternehmern w&uuml;rde ungef&auml;hr ein Jahr brauchen, um denToaster bestm&ouml;glich zu konfigurieren, und dann nochmals sechs Monate,um ihn zu testen. In der Zwischenzeit m&uuml;sste Ihre gesamte Familieausgedehnte Ausbildungskurse besuchen, um zu lernen, wie der Toaster zubedienen ist. Und wenn einmal alles l&auml;uft, so werden sie sagen, dannhaben Sie den besten Toast der Welt bekommen...<p><b><font size=+2>Microsoft</font></b><br>Wenn Microsoft Toaster herstellen w&uuml;rde, m&uuml;ssten Sie jedesmal,wenn sie einen Laib Brot kaufen, einen Toaster erstehen. Sie m&uuml;sstenden Toaster nicht nehmen, aber Sie m&uuml;ssten ihn in jedem Falle bezahlen.ToasterXP w&uuml;rde 15000kg wiegen (dadurch ben&ouml;tigt er einen verst&auml;rktenStahlboden), soviel Elektrizit&auml;t verbrauchen, wie f&uuml;r die Versorgungeiner kleinen Stadt n&ouml;tig ist und 95 Prozent des Platzes in IhrerK&uuml;che einnehmen. Microsoft w&uuml;rde behaupten, dies sei der ersteToaster, der Ihnen die M&ouml;glichkeit gibt, zu kontrollieren, wie helloder dunkel Ihr Toast sein soll, und w&uuml;rde heimlich Ihre anderen K&uuml;chenger&auml;tebefragen um herauszufinden, wer die Hersteller sind.<p><b><font size=+2>Sun</font></b><br>Wenn Sun Toaster herstellen w&uuml;rde, dann w&uuml;rde der Toast oftverbrennen, aber sie w&uuml;rden eine hervorragend gute Tasse Java bekommen.<p><b><font size=+2>Oracle</font></b><br>Wenn Oracle Toaster herstellen w&uuml;rde, dann w&uuml;rden sie behaupten,ihr Toaster w&auml;re mit allen Marken und Arten von Brot kompatibel, aberwenn Sie ihn zu Hause haben, werden Sie feststellen, dass die Back-Maschinenoch in der Entwicklung steckt, die Croissant-Extension in drei Jahrenkommen wird und das gesamte Ger&auml;t nur Rauch erzeugt.<p><b><font size=+2>Xerox</font></b><br>Wenn Xerox Toaster herstellen w&uuml;rde, k&ouml;nnte man entwederein- oder zweiseitig toasten, und alle nachfolgenden Scheiben w&uuml;rdenheller und heller werden. Aber der Toaster w&uuml;rde das Brot f&uuml;rSie auch pressen.<p><b><font size=+2>IBM</font></b><br>Wenn IBM Toaster herstellen w&uuml;rde, dann w&uuml;rden sie riesengro&szlig;eToaster bauen, zu denen die Leute das Brot hinbringen m&uuml;ssten, damites &uuml;ber Nacht getoastet werden k&ouml;nnte. IBM w&uuml;rde den weltweitenMarkt f&uuml;r sich in Anspruch nehmen und f&uuml;nf oder sechs solcherToaster in Einsatz bringen.<p>Eingesandt: Cord Hagen.</td></tr></table></body></html>