<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="generator" content="HTML Tidy, see www.w3.org">   <meta name="author" content="Jürgen Sperling22072004">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>      Ein` hab ich noch...    </title></head><body text="#000000" link="#0000FF" vlink="#FF0000" alink="#FF9900" background="jsbg.jpg">&nbsp;<table BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" summary="" ><tr><td><center><img SRC="st_einnoch.jpg" ALT="Ein` hab ich noch" height=96 width=432></center><hr align="center" width="75%" size="5" color="#C8C6C2"><p>"Ihre Frau sieht einfach toll aus in ihrem neuem Kleid!" - "Das istkein neues Kleid, das ist eine neue Frau!"&nbsp;<br><hr width="100%" size="3"><p>Eine Blondine ruft ihren Mann auf der Arbeit an: "Du Schatz, ich habemir ein neues Puzzle gekauft, aber ich bekomme es einfach nicht zusammen!Die Teile sehen sich alle so &auml;hnlich!" Der Ehemann: "Nun Liebling,gibt es denn f&uuml;r das Puzzle eine Vorlage und was ist denn auf demPuzzle drauf?"<br>"Eine Vorlage habe ich nicht, aber auf der Verpackung ist ein roterHahn! Aber ich bekomme es trozdem nicht zusammen!" - "Nun bleib mal sch&ouml;nruhig Liebling. Wenn ich heute Abend nach Hause komme, werden wir das Puzzleschon zusammen bekommen."<br>Am Abend sieht sich der Mann lange die Verpackung von dem Puzzle an.Nach langem Schweigen sagt er zu seiner Frau: "Liebling pass mal auf: wirr&auml;umen jetzt die Cornflakes in die Schachtel zur&uuml;ck und redennicht mehr dar&uuml;ber..."&nbsp;<br><hr width="100%" size="3"><p>"Angeklagter, wieso haben sie den Mann in einer Affekthandlung niedergeschlagen?"- "Herr Richter, das war ein einem Buchladen!"&nbsp;<br><hr width="100%" size="3"><p>Karl erz&auml;hlt auf der Arbeit: "Ich habe am Wochenende mein ganzesHaus verputzt!" - "Und, hat`s geschmeckt?"&nbsp;<br><hr width="100%" size="3"><p>"Wie du wei&szlig;t, hatte ich doch eine Heiratsanzeige aufgegeben.Geschrieben hatte ich `Wer bringt Licht und W&auml;rme in mein Leben`."- "Und, wieviele Zuschriften hast du bekommen?"<br>"Zwei! Eine vom E-Werk und eine von einer Heizungsfirma!"&nbsp;<br><hr width="100%" size="3"><p>Warum ist die Aussage "F&uuml;r die einen ist es Windows, f&uuml;r dieanderen der gr&ouml;&szlig;te Virus der Welt" falsch?<br>Ein Virus funktioniert zuverl&auml;ssig!&nbsp;<br><hr align="center" width="100%"><p>74 % der Frauen finden ihren Arsch zu dick,<br>17 % finden ihn zu d&uuml;nn und<br>&nbsp;&nbsp; 9% w&uuml;rden ihn wieder heiraten!&nbsp;<br><hr width="100%" size="3"><p>Klein Hannes hatte in der Schule zum ersten Mal Sexualkundeunterricht.Als er nach der Schule nach Hause kommt, sieht er seine Eltern an und sagtver&auml;chtlich: "Jetzt wei&szlig; ich Bescheid, ihr Ferkel!"&nbsp;<br><hr width="100%" size="3"><p>Kommt ein Mann in einen Sex-Shop und m&ouml;chte eine aufblasbare Gummi-Puppe.Der Verk&auml;ufer: "Die k&ouml;nnen Sie haben - aber, waren Sie nichtschon vor drei Tagen hier und haben sich eine gekauft?"<br>Der Mann: "Ja stimmt, aber ich mit der Schlu&szlig; gemacht..."&nbsp;<br><hr width="100%" size="3"><p>"Ja, soweit sieht Ihr Gesundheit-Check sehr gut aus!" sagt der Arztzum &auml;lteren Patienten. "Nur Ihren Zucker mu&szlig; ich noch untersuchen.""Ach nein, das ist nicht n&ouml;tig, der zuckt schon seit 3 Jahren nichtmehr!"&nbsp;<br><hr width="100%" size="3"><p>Zwei Politiker stehen vor einem Klamotten-Schaufenster und begutachtendie Sachen. Sagt der erste: "Mit dem Euro ist doch nicht alles teuer geworden.Der Anzug kostet nur 25 Euro, die Hose nur 11,50 Euro und das passendeHemd auch nur 9 Euro!"<br>Ein Passant h&ouml;rt das zuf&auml;llig und sagt: "Wie mans nimmt.Aber in Wahrheit stehen sie ja vor einer Reinigung!"&nbsp;<br><hr align="center" width="100%"><p>Die aus gutem Hause stammende Tochter hat zum bestandenen Abitur vonihren Eltern eine Reise nach Afrika geschenkt bekommen. Nun ist zu Hauseein Dia-Abend mit der ganzen Familie angesagt. Schw&auml;rmt die Tochtermit H&auml;nden und F&uuml;&szlig;en: "Am besten hat mir das gro&szlig;eObst und die riesigen Bananen gefallen! Die N&uuml;sse sind sooo gro&szlig;!"<br>Sagt der schwerh&ouml;rige Opa:" Und? Hat er auch Geld?"&nbsp;<br><hr width="100%" size="3"><p>US-Pr&auml;sident Bush ruft beim Kanzler Schr&ouml;der an: " Hi Gerd,wir brauchen eure Hilfe! Unsere einzigste Kondomfabrik ist explodiert.Wir brauchen dringend 1,5 Millionen Kondome. Du wei&szlig;t ja, AIDS. K&ouml;nntihr uns helfen?"<br>"Geht in Ordnung, Schorse!" - "Wir ben&ouml;tigen diese Kondome aberin unseren National-Farben rot, wei&szlig; blau gestreift, in einer l&auml;ngevon 28 cm und einem Durchmesser von 6,5 cm. Ist das machbar?" - "F&uuml;runs kein Problem!", sagt Schr&ouml;der.<br>Gleich darauf ruf Schr&ouml;der in der Kondomfabrik an: "Hier KanzlerSchr&ouml;der! Die Amis wollen von uns Kondome haben. 1,5 Millionen! K&ouml;nntihr so viele liefern?" - "Ohne weiters. Haben die irgendwelche Sonderw&uuml;nsche?"- "Ja, rot, wei&szlig; blau gestreift, in einer l&auml;nge von 28 cm, miteinem Durchmesser von 6,5 cm. Ach noch was! Stempelt auf die Kondome `MADEIN GERMANY` und SIZE: SMALL."&nbsp;<br><hr width="100%" size="3"><p>Eine Blondine bestellt sich eine Pizza. Fragt die Bedienung: "Soll ichdie Pizza in sechs oder acht Teile zerschneiden?" - Sagt die Blondine:"Nur in sechs Teile bitte, acht sind mir zuviel!"&nbsp;<br><hr width="100%" size="3"><p>Eng umschlungen liegen sie im Bett: "So ein Partnertausch, das hat dochwas!" - "Stimmt. Lass uns mal nach unseren M&auml;nner sehn... "&nbsp;<br><hr width="100%" size="3"><p>Fragt der Ehemann: "Na, wie schmeckt dir mein Mittagessen?" - Sagt sie:"Suchst du etwa Streit?"&nbsp;<br><hr width="100%" size="3"><p>Der St&uuml;rmer der Deutschen Nationalmanschaft steht im Himmel vorPetrus. Der schaut ihn erstaunt an und sagt: "Du hier? Wie hast denn dasTor gefunden?"<br><hr width="100%" size="3"><p>Kommt der Knecht zum Bauern gelaufen und ruft: "Du, Bauer, auf deinemFeld wird gerade die B&auml;uerin vernascht!"<br>Der Bauer rennt sofort los. Nach ein paar minuten ist er wieder daund sagt: "War gar nicht mein Feld..."&nbsp;<br><hr width="100%"><p>"Heut wird es regnen!", sagt der Meteorologe zu seiner Sekret&auml;rin."Warum sind sie da so sicher? - "Mein Auto ist gewaschen, meinen Schirmhabe ich zu Hause gelassen und eben bin ich zu einer Garten-Party eingeladenworden!"&nbsp;<br><hr width="100%" size="3"><p>Deutschstunde in der Schule. Die Lehrerin korrigiert Johannes: "Johannes!Es hei&szlig;t nicht `das Getreide tut wachsen`, sondern das Getreide w&auml;chst.Es hei&szlig;t auch nicht `die Glocke tut l&auml;uten`, es hei&szlig;tdie Glocke l&auml;utet. Alle verstanden?" Alles nickt.<br>Nach zehn Minuten meldet sich Harald: "Frau Lehrerin! Mein Bauch weht!"&nbsp;<br><hr width="100%" size="3"><p>"Hannes, warum bist du denn auf die Agnes so sauer?" - "Ach, ich habeder Agnes t&auml;glich einen Liebesbrief geschrieben. Und nun bekommt sieein Kind vom Postboten!"&nbsp;<br><hr width="100%" size="3"><p>Verl&auml;uft sich ein junger Mann nachts im Hotel das Zimmer einer&auml;lteren Frau. Stottert der verlegen: "Entschuldigung, ich habe michtgeirrt!" - Grinst die &auml;ltere Dame: "Nicht geirrt, Junger Mann, nurversp&auml;tet!"&nbsp;<br><hr width="100%" size="3"><p>Kommt ein Ehemann f&uuml;her nach Hause und &uuml;berrascht seine Fraubeim Sex mit seinem besten Freund. F&auml;ngt der Ehemann an, lauthalszu lachen und sagt: " Ich mu&szlig; ja, aber du?!"&nbsp;<br><hr width="100%"><p>"Jetzt bist du 45. Deine Braut ist erst 18. Was machst du denn in zwanzigJahren?" - "Ich nehme mir eine J&uuml;ngere!"&nbsp;<br><hr width="100%" size="3"><p>Zwei Freunde unterhalten sich: "F&uuml;hrt deine Frau eigentlich auchSelbstgespr&auml;che?" - "Nat&uuml;rlich, aber sie wei&szlig; es nur nicht.Sie denkt immer noch, ich h&ouml;re ihr zu!"&nbsp;<br><hr width="100%" size="3"><p>Unterhalten sich zwei Bordstein-Schwalben &uuml;ber ihren letzten Arbeitstag:"Und, bist du mit dem verr&uuml;ckten Million&auml;r zurechtgekommen?"- "F&uuml;r 1000 Euro hat er es mit mir in einem Sarg getrieben!"<br>"Na das war wohl ganz sch&ouml;n anstrengend" - N&ouml;, f&uuml;r michnicht. Aber f&uuml;r die vier Sargtr&auml;ger..."&nbsp;<br><hr width="100%" size="3"><p>Erz&auml;hlt Hannelore ihrer Freundin: "Es war wirklich ein sch&ouml;nerAbend gestern. Er hat mich nach dem Tanzen gleich nach Hause gebracht undan der Haust&uuml;r gab er mir einen Kuss auf die Stirn!" - "Da warst dudoch hoffentlich emp&ouml;rt!"<br>"Aber nat&uuml;rlich. Ich habe ihm gefragt, ob er mich f&uuml;r seineTante h&auml;lt!"&nbsp;<br><hr width="100%" size="3"><p>Zwei Nachbarinnen unterhalten sich &uuml;ber die M&uuml;ller`s von nebenan:"Ist dir schon aufgefallen, was deren Kinder f&uuml;r Namen haben?" - "Ja,die wurden alle nach dem Ort benannt, wo sie gezeugt wurden! Die &Auml;lltestehei&szlig;t Kinogunde, weil es im Kino passiert ist, der Mittlere hei&szlig;tWaldemar, weil es im Wald geschah. Und der J&uuml;ngste hei&szlig;t Autokarweil es im Auto war!" - "Dann fehlt ihnen ja nur noch eine Bettina!"&nbsp;<br><hr width="100%" size="3"><p>Der Dekorateur zum neuen Auszubildenden: "Ich finde es ja gut, das duso schnell arbeitest. Aber die letzte Schaufenster-Puppe, die du ausgezogenhast, war die Chefin!"&nbsp;<br><hr width="100%"><p>Blondine im Computerladen: "Ich habe gestern hier diese CD-Rom gekauft."- "Na und?" - "Da ist nichts &uuml;ber Rom drauf!"&nbsp;<br><hr align="center" width="75%" size="5" color="#C8C6C2"><center><img SRC="jojo.jpg" ALT="JoJo" height=50 width=212></center><br>&nbsp;</td></tr></table></body></html>