<!doctype html public "-//w3c//dtd html 4.0 transitional//en"><html><head>   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">   <meta name="generator" content="HTML Tidy, see www.w3.org">   <meta name="author" content="Jürgen Sperling22072004">   <meta name="GENERATOR" content="Mozilla/4.5 [de] (Macintosh; I; PPC) [Netscape]">   <title>      Ein` hab ich noch...    </title></head><body text="#000000" link="#0000FF" vlink="#FF0000" alink="#FF9900" background="jsbg.jpg">&nbsp;<table BORDER=0 CELLSPACING=0 CELLPADDING=10 WIDTH="100%" summary="" ><tr><td><center><img SRC="st_einnoch.jpg" ALT="Ein` hab ich noch" height=96 width=432></center><p><br><p><hr width="75%" size="5" color="#C8C6C2"><center>Aus dem leider gegebenen Anla&szlig; der Einstellung der NoCovergibt es hier und heute die einmalige Gelegenheit, die doppelte Menge anWitzen lesen zu m&uuml;ssen.<br>Die Witze-Sammlung wird aufgel&ouml;st.<br>Alles mu&szlig; raus.&nbsp;</center><br>&nbsp;<p><hr align="center" width="75%" size="5" color="#C8C6C2"><p>"Horst, n&auml;chstes Jahr haben wir Silberne Hochzeit. Wie sollen wirdas nur feiern?" Knurrt der Ehemann: " La&szlig; uns noch f&uuml;nf Jahrewarten, da k&ouml;nnen wir den Drei&szlig;ig J&auml;hrigen Krieg begie&szlig;en!"&nbsp;<br><hr width="100%" size="3"><p>Im Irrenhaus. Zeigt der eine Psychiater dem anderen zwei seiner Patienten:"Der dort ist durchgedreht, weil er eine Frau nicht geheiratet hat." -"Der andere?" - "Der hat sie bekommen!"&nbsp;<br><hr width="100%" size="3"><p>Direktor Schulz kommt am fr&uuml;hen Nachmittag &uuml;berrachend nachHause, um sich f&uuml;r ein Meeting frisch zumachen. Als im Schlafzimmerhastig den Kleiderschrank aufrei&szlig;t, steht ihm der Brieftr&auml;gergegen&uuml;ber. Ruft Schulz seiner Frau zu: "Hanni, die Post ist da!"&nbsp;<br><hr width="100%" size="3"><p>Kommt Moses vom Berg herunter und sagt seinem Volk: "Hey Leute, es gibteine gute und eine schlechte Nachricht. Die gute: Ich konnte den Chef aufzehn Gebote herunter handeln. Die schlechte: Ehebruch ist noch dabei!"&nbsp;<br><hr width="100%" size="3"><p>Wieviele Tiere braucht eine Frau zu gl&uuml;cklich sein?<br>Vier: einen Jaguar in der Garage, einen Nerz um den Hals, einen L&ouml;wenim Bett und einen Esel, der alles zahlt&nbsp;<br><hr width="100%" size="3"><p>An der Theater-Kasse: "Halt! Nicht vordr&auml;ngeln! Stellen sie sichhinten an!" - "Geht nicht! Da steht schon einer!"&nbsp;<br><hr width="100%"><p>Der Arzt zum &uuml;bergewichtigen Patienten: "Da haben sie mich abermi&szlig;verstanden! Der Riegel, den sie sich beim Essen vorschieben sollen,darf nicht aus Schokolade sein!"&nbsp;<br><hr width="100%" size="3"><p>Bei Nachtisch bekleckert sich der Mann von oben bis unten. Sagt er zuseiner Frau: "Guck mal Schatzi, seh ich nicht aus wie ein Schwein?" - "Ja.Und bekleckert hast du dich auch noch!"&nbsp;<br><hr width="100%" size="3"><p>Eine Mutter zur anderen: "Fr&uuml;her war als viel einfacher! Heutehat mein Sohn in seinem Zimmer einen Fernseher, ein Amiga-Computer undeinen DVD-Player. Wenn ich ihn f&uuml;r etwas bestrafen will, muss ichihn in mein N&auml;hzimmer schicken!"&nbsp;<br><hr width="100%" size="3"><p>"Das Kleid gef&auml;llt mir recht gut. Mit einer kleinen &Auml;nderungw&uuml;rde ich das nehmen!" - "Gern gn&auml;` Frau. Was soll denn ge&auml;ndertwerden?" - "Der Preis!"&nbsp;<br><hr width="100%" size="3"><p>Kommt die Sprechstundenhilfe ins volle Wartezimmer: "Wo ist denn dieDame, die einen neuen Verband an ihrm Fu&szlig; brauchte?" - Stimme ausder Ecke: "Die ist schon gegangen, die Wunde war inzwischen verheilt!"&nbsp;<br><hr width="100%" size="3"><p>Mutter und Tochter machen Urlaub am Meer und sind zum ersten mal aneinem FKK-Strand. Die Tochter sieht sich neugierig das Geschlechtsteileines neben ihnen liegenden Mannes an. Nach ein paar Minuten fragt sieihren Mutter: "Mama, warum habe ich nicht so ein Ding zwischen meinen Beinen?"- "Geduld meine Kleine. Nur Geduld."&nbsp;<br><hr width="100%" size="3"><p>Sp&auml;t am Abend kommt der Mann vom Pokern nach Hause. Seine Fraum&ouml;chte gerade mit den Meckern beginnen, da f&auml;llt ihr der Mannins Wort: "Du brauchst dich gar nicht mehr aufregen. Du kannst deine Sachenpacken, ich hab dich an einen Mitspieler verloren!"<br>Mit offenen Mund steht die Frau im Zimmer: "Wie kannst du mir so etwasantun?" Sagt er: "Das war gar nicht so einfach! Ich mu&szlig;te mit vierAssen passen!"&nbsp;<br><hr width="100%" size="3"><p>Der betagte J&auml;gersmann geht nach beendeter Pirsch in seine Stamm-Kneipe.Dort trifft er seinen Hausarzt. Sagt der J&auml;ger: "Sie glauben nicht,was ich heute geschossen habe..." - "Doch, doch!" sagt der Arzt, "der warschon bei mir zur Behandlung!"&nbsp;<br><hr width="100%" size="3"><p>Der &auml;ltere Junggeselle wird gefragt, ob er nicht bald heiratenm&ouml;chte. "Warum denn? Ich hab zwei Schwester, die mich umsorgen!" -"Aber Schwestern k&ouml;nnen doch eine treu sorgende und z&auml;rtlicheEhefrau nicht ersetzen!" - "Ich sagte nicht, das es meine Schwestern sind!"&nbsp;<br><hr width="100%"><p>Unterhalten sich zwei Gesch&auml;ftsfrauen &uuml;ber die Konjunktur:"Ich sitze v&ouml;llig auf dem Trocknen!" - "Du gl&uuml;ckliche! Mir stehtdas Wasser bis zum Hals!"&nbsp;<br><hr width="100%" size="3"><p>Ein junger Pfarrer nimmt zum ersten mal die Beichte ab, ausgerechnetauch noch bei einer jungen Frau. Nach der Beichte fragt er seinen &auml;lterenKollegen: "Na, wie war ich?" - "Ganz gut! Aber du solltest &ouml;fter missbilligend`na, na, na` sagen und nicht dauert `Wow` oder `Echt scharf`!"&nbsp;<br><hr width="100%" size="3"><p>Ein Mann sitzt in einer Kneipe und weint. Fragt der Wirt: "Haben sieKummer?" - "Ja! Meine Frau sagte nach einem Streit, sie w&uuml;rde einenganzen Monat lang kein Wort mit mir sprechen." - "Das ist ja schlimm!"- "Ja," schnieft der Mann, "heute ist der Monat um!"&nbsp;<br><hr width="100%" size="3"><p>Ab heute gibt es bei der Bahn zu jedem Fahrschein ein Snickers - fallses mal wieder l&auml;nger dauert.&nbsp;<br><hr width="100%" size="3"><p>Der Regisseur zur blonden Schauspielerin: "Wenn sie mit mir arbeiten,bekommen sie bald einen Oskar!" - "Und wenn`s ein M&auml;dchen wird?"&nbsp;<br><hr width="100%" size="3"><p>"Ich bekam heute einen Brief von meiner Freundin aus S&uuml;dafrika.Sie schreibt, das sie dort wenig Wasser haben. Die Briefmarke war mit einerNadel befestigt!"<br><hr align="center" width="100%"><p>Der Pastor am Ende der Trauung: "... von nun an seid ihr Mann und Frau!"Darauf hin der Br&auml;utigam: "Und was waren wir vorher?"&nbsp;<br><hr width="100%" size="3"><p>Warum essen Blondinen keine Brezel? - Sie bekommen den Knoten nichtauf!&nbsp;<br><hr width="100%" size="3"><p>Treffen sich zwei &Auml;rzte auf dem Friedhof. Sagt der eine: "Tag HerrKollege. Machen sie auch gerade Inventur?"&nbsp;<br><hr width="100%" size="3"><p>Das Ehepaar besucht eine Opernauff&uuml;hrung. Stupst sie ihren Mannan und sagt: "Du guck mal, der Kerl neben mir schl&auml;ft!" Murrt er:"Na und, das ist doch kein Grund mich zu wecken!"&nbsp;<br><hr width="100%" size="3"><p>"Wei&szlig;t du, was schlimmer ist als eine angebissene Birne mit Wurm?"- "Nein!" - "Eine angebissene Birne mit einem halben Wurm!"&nbsp;<br><hr width="100%" size="3"><p>"F&uuml;hrt deine Frau eigentlich Selbstgespr&auml;che?" - "Ja! Abersie wei&szlig; es nicht. Sie glaubt immer, ich h&ouml;re ihr zu!"&nbsp;<br><hr width="100%" size="3"><p>Unterhalten sich zwei Pfarrer: "Als ich gestern Nacht nach Hause kam,schlief meine Haush&auml;lterin nackt auf dem Sofa!" - "Was hast du gemacht?"- "Was h&auml;tte ich schon machen sollen? Ich habe sie zugedeckt und binselber schlafen gegangen. - Was h&auml;ttes du denn gemacht"<br>"Genau so gelogen wie du!"&nbsp;<br><hr width="100%" size="3"><p>Warum freut sich eine Blondine so, wenn sie ein Puzzle nach sieben Monatenfertig hat?<br>Auf dem Karton steht: von 3 - 6 Jahren.&nbsp;<br><hr width="100%" size="3"><p>Warum haben M&auml;nner immer ein reines Gewissen? - Weil sie es niebenutzt haben!&nbsp;<br><hr width="100%" size="3"><p>Ein Beamter zum anderen: "Na, wieder aus dem Urlaub zur&uuml;ck? Wiewars denn?" - "Wie im B&uuml;ro. Nur rumgesessen, nichts gemacht und aufMittag gewartet!"&nbsp;<br><hr width="100%" size="3"><p>Bei einer Autofahrt nervt die sechszehnj&auml;hrige Tochter den Vater:"Nun la&szlig; mich doch auch mal fahren, ich bin doch schon alt genug!"- "Du vielleicht," erwidert der Vater, "aber das Auto nicht!"&nbsp;<br><hr width="100%" size="3"><p>"Wie, du hast ein neues Auto? Wie hast du das denn finanziert?" - "Mitmeiner Posaune. Die habe ich in Zahlung gegeben"<br>"Und das hat ausgereicht?" - "Dem Autoverk&auml;ufer schon, denn derwohnt unter mir!"&nbsp;<br><hr width="100%" size="3"><p>Unterhalten sich zwei Freunde. Fragt der eine: "Du sag mal ehrlich:Was ist denn zwischen dir und meiner Frau?" - "Eigentlich nur noch du..."&nbsp;<br><hr width="100%" size="3"><p>Steht ein Mann auf dem Parkplatz und pinkelt in den Tank seines Auto`s.Bleibt ein Passant stehen und sagt: "Das ist doch nicht normal!" Erwidertder Autofahrer: "Nee, das ist Super!"&nbsp;<br><hr width="100%" size="3"><p>Kommt eine Frau beim spazierengehen am Holzzaum einer psychiatrischenAnstalt vorbei, und h&ouml;rt die Insassen rufen: "22! 22!"<br>Neugierig schaut sie durch ein Astloch. Pl&ouml;tzlich st&ouml;&szlig;tein Finger durch das Loch mitten ins Auge. Rufen die Insassen: "23! 23!"<br><hr width="100%" size="3"><p>Eine Kuh strahlend zum Polizisten: "Mein Mann ist auch ein Bulle..."&nbsp;<br><hr align="center" width="75%" size="5" color="#C8C6C2"><center><img SRC="jojo.jpg" ALT="JoJo" height=50 width=212></center></td></tr></table></body></html>