<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot; 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>

---------------------------------------------------------------------------

1. Reaktion auf zwei Leserbriefe (von Alexx Riedel)

&raquo;Eigentlich wollte ich aus der ohnehin sinnlos gewordenen Diskussion um den 
zuk&uuml;nftigen Amiga aussteigen. Aber abschlie&szlig;end wollte ich doch noch mal 
ausf&uuml;hrlich eine symptomatische Reaktion auf meinen Leserbrief (von J&ouml;rg 
Handwerg) kommentieren...

&#062; Die Customchips sind ein Vorteil, ob du das als deprimierend empfindest  
&#062; oder nicht.
&#062; Eine Leistung wie die des AMIGAs w&auml;re damals ohne die Customchips        
&#062; &uuml;berhaupt nicht m&ouml;glich gewesen, und der PC hat immerhin diese Leistung  
&#062; nur mit brachialer Power nach 5 Jahren eingeholt! 

Niemand hat je behauptet, dass die Customchips seinerzeit kein enormer 
Vorteil des Amigas gewesen w&auml;ren. Aber die PC-Hardware hat sich seit damals 
ziemlich weiterentwickelt, die Amiga-Hardware kaum (schon AGA hinkte der 
Zeit hinterher). Du sagst es selbst: Der PC hat schon lange weit &uuml;berholt 
(n.b.: wir reden hier von *Hardware*). Also ist es etwas vermessen, wenn du 
die Customchips heutzutage noch als Vorteil betrachtest. Die Realit&auml;t ist, 
dass der PC-Benutzer (und nicht nur der - auch der Apple-, HP-UX-, Sun- 
usw. Benutzer) heute einfach seine alte Grafikkarte ausbaut und ein neues 
Modell aus dem umfangreichen Angebot des freien Marktes reinsteckt, wenn er 
die Leistung neuer Technologien braucht, selbst das Motherboard kann man 
auswechseln (Modularit&auml;t!). Und dann kriegt er, wie du ganz richtig sagst, 
&quot;brachiale Power&quot;:
Grafikkarten mit 3D-Beschleunigung, DVD, flimmerfrei hochaufl&ouml;send im
Breitbildformat... - keine 400.- ; Soundkarten 16 Bit, MIDI, Surround, 
Sampler eingebaut - gibt's in akzeptabler Qualit&auml;t schon f&uuml;r unter 50.- ; 
Ethernet- und Schnittstellenkarten werden einem eh schon fast 
nachgeschmissen. Was hast du gegen derart &quot;brachiale Power&quot;, warum sollte 
man diese preisg&uuml;nstige und, besonders wichtig, sofort verf&uuml;gbare &quot;Power&quot; 
nicht in das technologische Konzept eines k&uuml;nftigen Amigas integrieren? Ich 
wei&szlig;, ich wiederhole mich - keiner (au&szlig;er vielleicht Amiga, Inc. selbst) 
verlangt, dass der neue Amiga unbedingt komplett ein PC ist - nur sollte 
man sich nicht scheuen, interessante Konzepte von dort wohlwollend zu 
pr&uuml;fen. 
 
&#062; Es muss nicht alles in Customchips ausgef&uuml;hrt werden, dennoch hat das    
&#062; eben einige klare Vorteile: Es gibt einen Standard, wie bei den heutigen  
&#062; AMIGAs. Sprich: Durch die Grafikmodi, die auf jedem Rechner laufen, und  
&#062; die Customchips, die gewisse Funktionen auf JEDEM AMIGA erm&ouml;glichen, ist 
&#062; es f&uuml;r die Programmierer einfach, ein Programm zu erstellen, welches     
&#062; garantiert auf jedem AMIGA l&auml;uft. Ganz im Gegensatz dazu der PC, der, von 
&#062; Treibern nur so &uuml;bersch&uuml;ttet, nur Probleme bereitet.

Es sollte Dir klar sein: Der Standard bei einem Computersystem wird 
heutzutage nicht mehr durch seine Hardware definiert! Jedes moderne 
Betriebssystem &quot;verdeckt&quot; die integrierte Hardware m&ouml;glichst transparent
durch ein standardisiertes API. Dank dieser Treiber kann der Software die 
Hardware (Grafik, Sound, Netz...) ziemlich egal sein, die n&ouml;tigen Aufrufe 
sind eh genormt. Deswegen sollte man eigentlich als Amiga-Standard im Jahre 
1998 nicht AGA-Chips, sondern Konzepte wie CyberGFX oder AHI anf&uuml;hren. Wenn 
du als Argument f&uuml;r Customchips Kompatibilit&auml;t anf&uuml;hrst, frage ich mich, 
wie dann je die f&uuml;r einen neuen Amiga notwendigen (und von Dir auch ganz 
richtig geforderten) Innovationen - jetzt und in Zukunft - zustande kommen 
sollen.
IMHO beziehst du die ganze Diskussion ohnehin zu sehr auf die Hardware, was 
der falsche Ansatz ist: Betriebssysteme wie Linux oder BSD laufen heute auf 
der Hardware von Amigas, Ataris, PowerMacs, ... , Alphas und halt auch 
x86&acute;ern - so was nennt man Hardware-Abstraktion, und das ist angesagt! Ein 
portables, modular erweiterbares Betriebssystem mit Unterst&uuml;tzung offener 
Standards im Hard- und Softwarebereich ist heute, meine ich, wichtiger als 
neueste Custom-Hardware. Und da l&auml;ge die St&auml;rke des AmigaOS. Seien wir doch 
ehrlich: Wahrscheinlich braucht eh nur ein Bruchteil der PC-Anwender 
wesentlich mehr Hardware-Power, als ein Aldi-PC zu bieten hat...

&#062; dass die Customchips heutzutage &uuml;berholt sind, steht wohl au&szlig;er Frage,    
&#062; sind aber kein Argument gegen neue. 

Habe ich auch nicht gesagt, meine Argumente waren andere. Und ich bin auch 
nicht prinzipiell gegen Customchips, sondern nur gegen die Reduktion der 
gesamten &quot;Amiga der Zukunft&quot;-Diskussion auf die Notwendigkeit von 
propriet&auml;rer Hardware.

&#062; UMA (Unified Memory Architecture) ist eines der gr&ouml;&szlig;ten Vorteile des     
&#062; AMIGA, welches ihm seine Vielseitigkeit, Problemlosigkeit und            
&#062; Geschwindigkeit garantiert, im Gegensatz dazu die Bus-Architektur, die   
&#062; jede Menge Prozessorkapazit&auml;t frisst, da die einzelnen Karten mit Daten   
&#062; durch die CPU versorgt werden m&uuml;ssen. 

Nun gut, klar k&ouml;nnte man das Chip-RAM mit dem Modewort UMA bezeichnen ;-)
- aber ich denke bei UMA eher an die Leistung von SGI-Workstations im
&quot;oberen&quot; Preissegment. Hast du schon mal gemessen, wie langsam dieser 
&quot;UMA&quot;-Speicher namens &quot;Chip-RAM&quot; ist? Den schl&auml;gt ein &quot;langsamer&quot; PCI-Slot 
(ohne &quot;UMA&quot;) um L&auml;ngen... und dann erst AGP... Ganz abgesehen von den 
Schwierigkeiten, ein funktionsf&auml;higes, bezahlbares echtes UMA-Rechnerdesign 
zu erstellen (was eine tolle Sache w&auml;re, siehe ABox :-( ). &Uuml;brigens hat so 
ziemlich jeder Rechner eine Bus-Architektur, auch der Amiga, ich wei&szlig; nicht 
genau, worauf du hier hinauswillst - und auch der PCI-Bus muss nicht immer 
die CPU bem&uuml;hen, die Karten k&ouml;nnen auch direkt auf den Speicher zugreifen 
(Busmaster - schon geh&ouml;rt? So gro&szlig; ist der prinzipielle Unterschied 
zwischen PCI und Zorro nicht!). Sicher sind PCI, AGP &amp; Co. alles andere als 
der Weisheit letzter Schluss, aber sie sind halt moderne, durchaus 
durchdachte, von der Industrie akzeptierte Konzepte, die nicht einfach 
deswegen, weil sie aus der Wintel-Welt stammen, als der in die Jahre 
gekommenen, hoffnungslos veralteten Amiga-Hardware-Technologie unterlegen 
angesehen werden d&uuml;rfen.

&#062; Welches Argument hat man, einen Quasi-PC mit AOS zu kaufen, auf dem man   
&#062; zwar schon Performance-m&auml;&szlig;ig nicht mehr schafft als auf einem normalen    
&#062; PC, daf&uuml;r aber dann auch nur einen Bruchteil der Software als auf einem   
&#062; Intel-PC zur Verf&uuml;gung hat?

Hast du dich eigentlich schon mal mit anderen Computern als dem Amiga
befasst?
&quot;Nicht mehr schaffen als ein normaler PC&quot; ist schon ganz sch&ouml;n viel, wie
ich oben schon gesagt habe, und mir w&uuml;rde ein AmigaOS auf einer Hardware, 
die der Performance eines 2000.- PCs entspricht, durchaus vorerst 
ausreichen (das w&auml;re ein Vielfaches der Leistung meines 040ers mit 
CV64/3D). Und ich bin wahrscheinlich anspruchsvoller als der 
durchschnittliche Computerk&auml;ufer. Egal, wie leistungsf&auml;hig die Hardware
eines neuen Amiga auch sein wird: Der Wintel-PC bietet genug Performance 
f&uuml;r die meisten Anwender, Windows ist eh &uuml;berall dabei, f&uuml;r Windows gibt es 
die meiste Software, und - ohne gr&ouml;&szlig;ere Anspr&uuml;che - geht vorerst ja eh 
alles irgendwie mit Windows - mit diesem Problem wirst du immer zu k&auml;mpfen 
haben (schau dir nur den Mac an). Viel mehr als Freak-Status wird dem 
AmigaOS vorerst nicht verbleiben, und hoffentlich zumindest das!

&#062; ........ Davon mal abgesehen: Welche Firma von den gr&ouml;sseren PC-         
&#062; Zubeh&ouml;rherstellern w&uuml;rde denn schon f&uuml;r den AMIGA Treiber f&uuml;r ihre
&#062; Karten schreiben? Das kann man vollends vergessen!

Kann ich dir gleich sagen: Keine! Und? So what? Who cares? Schreibt eine
Firma Treiber f&uuml;r ihre Grafikchips unter irgendwelchen frei verf&uuml;gbaren
Unix-Derivaten (FreeBSD, NetBSD, OpenBSD, Linux...)? Auf die Schnelle f&auml;llt 
mir keine ein! Und doch gibt es vom XFree86-Consortium leistungsf&auml;hige X-
Server, geeignet f&uuml;r Hunderte von Grafikkarten, geschrieben als Freeware 
von Hobbyprogrammierern. Traust du das der Amiga-Programmiergemeinde, die 
seit Jahren das Aminet f&uuml;llt, nicht zu?
Ich pers&ouml;nlich traue n&auml;mlich den per Internet vernetzten Free- und
Sharewareprogrammierern mehr Produktivit&auml;t zu als den paar von einer Firma 
angestellten Hanseln...

Wie bereits einleitend gesagt, halte ich allerdings diese ganze Diskussion 
f&uuml;r &uuml;berholt, in der Strategie von Amiga, Inc. schaut eh alles anders aus - 
wie auch immer - und deswegen ist dieser ganze Schrieb eher brotlose Kunst 
(?). Ich wollte damit nur wieder einmal betonen, dass man durchaus &uuml;ber den 
Amiga-Tellerrand blicken sollte, um zu sehen, was &quot;anderswo&quot; hard- und 
softwaretechnisch m&ouml;glich ist, und man z.B. nicht dauernd seine - im Gro&szlig;en 
und Ganzen begr&uuml;ndete ;-) - Aversion gegen in der Wintel-Welt verbreitete 
Konzepte pflegen sollte. Ich pers&ouml;nlich sehe zur Zeit allerdings sowieso 
keinerlei Zukunft mit der Gesch&auml;ftspolitik von Amiga, Inc. ...

Noch zum Brief von Tobias Weihmann: Ich glaube, er sieht das v&ouml;llig richtig 
und realistisch mit der Notwendigkeit von Alternativen zu Windows, 
allerdings gibt's da z.B. schon Linux, das, ich  muss es immer wieder 
betonen, nicht ganz ohne ist. Und wenn ich schrieb, AmigaOS m&uuml;sse sich da 
erst mal &quot;durchsetzen&quot;, dann meine ich damit &quot;etablieren&quot; und nicht &quot;den 
Markt dominieren&quot;, zuviel Realit&auml;tsn&auml;he habe ich doch noch ;-).

Alexx Riedel
E-Mail: <a href="mailto:101.128890@germany.net">101.128890@germany.net</a>&laquo;
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
