<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

Keine AMIGA-aktuell-Ausgabe ohne ein neues Gewinnspiel... Beim letzten Mal 
haben sich 45 Leser beteiligt, von denen &uuml;berraschend Wenige die 
Masterfrage beantworten konnten.


Zur Aufl&ouml;sung:


Standard-Frage: Wie hei&szlig;t der Hersteller des bekannten Raytracers Cinema4D?
                
Antwort: Die richtige L&ouml;sung lautet &quot;Maxon&quot;. Diese Frage konnten            
         erwartungsgem&auml;&szlig; alle Einsender beantworten, wurde in der letzten   
         Ausgabe  von AMIGA aktuell doch &uuml;ber den Abschied Maxons vom AMIGA  
         berichtet. Cinema 4D wird es weiterhin geben - aber nicht f&uuml;r      
         unser Computersystem. Mehrere leistungsstarke Konkurrenten werden  
         jedoch dar&uuml;ber hinwegtr&ouml;sten.


Master-Frage: Welche maximale Taktfrequenz empfiehlt Motorola f&uuml;r die im    
              A1200 enthaltene Version des Prozessors vom Typ 68EC020?

Antwort: Erstaunlich war, dass das nur 9 Leser richtig beantworten konnten.  
         Die im A1200 eingebaute Version des 68EC020 sollte laut Motorola   
         (bzw. der Angabe auf dem Prozessorgeh&auml;use) mit h&ouml;chstens 16 MHz    
         getaktet werden.
             

Meinungsfrage: Erwartest du, dass der von Amiga, Inc. ank&uuml;ndigte Br&uuml;cken-
               Computer f&uuml;r Entwickler p&uuml;nktlich, d.h. Ende dieses Jahres   
               erscheinen wird?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------

1 (Ja, auf jeden Fall.)                                                   2 
2 (Ja, wahrscheinlich.)                                                   9  
3 (Nein, wahrscheinlich nicht.)                                          24
4 (Nein, auf keinen Fall.)                                                9  
             
Zum ersten Mal ist es vorgekommen, dass 1 Teilnehmer die Meinungsfrage 
ignoriert hat.


Fazit:
------

Kurz und knapp gesagt: Eine gro&szlig;e Mehrheit unter den Teilnehmern h&auml;lt den 
geplanten Erscheinungstermin des AMIGA-Entwicklersystems (Ende 1999) f&uuml;r 
unrealistisch. Angesichts der ewigen Verz&ouml;gerungen in der Computerbranche 
und auch (oder vielleicht gerade) beim AMIGA, ist das auch alles andere als 
verwunderlich. 


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:


1 x Vollversion von &quot;Diamond Caves II&quot;: Ralf Junius
1 x Vollversion von &quot;AFiloFaxPro&quot;: Gerd Schniggenberg
1 x Vollversion von &quot;PrintManager&quot;: Wolf Zimmer
1 x Animationssoftware &quot;MainActor Broadcast&quot;: Mark Harbarth


Herzlichen Gl&uuml;ckwunsch!


Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm CDCat f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&raquo;CDCat (MUI) ist DER CD-ROM-Katalogisierer. Es eignet sich auch besonders 
f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-Beschreibungen mitber&uuml;cksichtigt 
werden. Im Browser k&ouml;nnen CDs durchst&ouml;bert werden, ohne eingelegt zu sein. 
Auch ist Entpacken, Texte anzeigen etc. aus CDCat heraus m&ouml;glich. Ab 
Version 1.2 wird auch XPK zum Packen der Scankataloge unterst&uuml;tzt.&laquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar. Aktuell ist 
Version 2.1. Ein Test von CDCat l&auml;sst sich unter 
<a href="http://www.amigaworld.com/support/cdcat/C_test.html">http://www.amigaworld.com/support/cdcat/C_test.html</a> abrufen.

Der Autor ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Peter Elzner hat sein Programm ManiacBall f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;ManiacBall basiert auf dem klassischen Breakout, bei dem mit einem 
Schl&auml;ger und einem Ball Steine getroffen werden m&uuml;ssen und diverse Extras 
das Leben erleichtern. ManiacBall bietet als Erweiterung die M&ouml;glichkeit 
von mehreren Schl&auml;gern und mehreren B&auml;llen auf einem Spielfeld, ein 
lustiger Zwei-Spieler-Modus (gleichzeitig!) und jede Menge Extras, wie z.B. 
Laser, Schutzschild und vieles mehr. Wem die vorhandenen Level zu 
langweilig werden, kann sich mit dem Leveleditor auch eigene Spielstufen 
erschaffen.
Voraussetzungen: Amiga mit Kick2.0, 1MB Speicher.
          Grafikkarten werden unterst&uuml;tzt, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 25 Level, Editor eingeschr&auml;nkt
Registrierte Version: 25 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Stephan Rupprecht hat sein Programm PrintManager f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;PrintManager ist ein Programm, das die Arbeit mit einem Drucker flexibler 
und kontrollierbarer macht. Es kann Daten, die ein Programm an den Drucker 
schickt, zun&auml;chst in einer Datei speichern. So wird ein Anwenderprogramm 
nicht durch den langsameren Drucker aufgehalten. Je nach Wunsch kann der 
PrintManager die gespeicherten Daten anschlie&szlig;end ausdrucken oder sie  
zun&auml;chst auf Diskette belassen, um sie sp&auml;ter in einem Rutsch auszudrucken.  
Des weiteren bietet Ihnen der PrintManager die M&ouml;glichkeit, &uuml;ber das 
Datatypes-System, Dateien beliebigen Formats auszudrucken (dies setzt 
nat&uuml;rlich einen entsprechenden Datatype f&uuml;r das jeweilige Format voraus).

Die Sharewaregeb&uuml;hr betr&auml;gt DM 15,- bzw. DM 20,- bei Postversand, die 
Demoversion ist im Aminet unter text/print/prtman39.lha zu finden.

Adresse des Autors:

Stephan Rupprecht
Apfeldweg 1
44359 Dortmund

E-Mail:

<a href="mailto:stephan.rupprecht@metronet.de">stephan.rupprecht@metronet.de</a>&laquo;


Des weiteren hat Thomas Hasemann GigaMem, eine Software zur Nutzung 
virtuellen Speichers, zur Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!


Aufruf an alle innovativen Programmierer und AMIGA-Firmen:

Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
Online-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere 
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt. 
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser 
bekanntzumachen.
       

Hier die neuen Fragen (nur ZWEI davon m&uuml;ssen beantwortet werden):


Standard-Frage: Phase 5 digital products hat im Juli eine neue Grafikkarte  
                auf den Markt gebracht. Wie hei&szlig;t das Produkt?
                  

Master-Frage: Wof&uuml;r steht im Computerbereich die Abk&uuml;rzung &quot;API&quot;? (Gesucht   
              sind die W&ouml;rter, die sich hinter der Abk&uuml;rzung verbergen,     
              KEINE Begriffserkl&auml;rung.)

             
Meinungsfrage: Welche Bedeutung wird Deiner Meinung nach die PowerPC-       
               Prozessorreihe in den n&auml;chsten Jahren f&uuml;r den AMIGA          
               besitzen?


M&ouml;gliche Antworten: 
           
1: Sehr gro&szlig;e Bedeutung.
2: Eine eher gro&szlig;e Bedeutung.
3: Eine weniger gro&szlig;e Bedeutung.
4: Kaum eine Bedeutung.

Es gen&uuml;gt, die Nummer anzugeben.


Unter allen Teilnehmern, die mindestens ZWEI dieser Fragen bis zum 25. 
August (Einsendeschluss) beantworten (die Wissensfrage[n] nat&uuml;rlich 
richtig), werden die folgenden Gewinne verlost:


1 x Vollversion von &quot;ManiacBall&quot; (Wert: DM 25,-)
1 x Vollversion von &quot;CDCat&quot; (Wert: DM 30,-)
1 x Vollversion von &quot;PrintManager&quot; (Wert: DM 15,-/20,-)
1 x Virtual-Memory-Software &quot;GigaMem&quot; (Wert: nach Ermessen)


Wer alle drei Fragen beantwortet (die Wissensfragen m&uuml;ssen nat&uuml;rlich 
richtig sein), nimmt mit ZWEI Stimmen an der Verlosung teil und hat somit 
die doppelte Chance auf einen Preis.


Schickt Eure Antworten bitte bis zum 25. August an folgende Adresse:

Carsten Schr&ouml;der
Helmoltstra&szlig;e 10
37081 G&ouml;ttingen
Deutschland

oder per E-Mail an:

<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Bitte vergesst nicht, Eure Post-Anschrift anzugeben, und ggf. den 
bevorzugten Preis. Eine Garantie, dass Ihr im Gewinnfall dann auch genau 
diesen Preis erhaltet, kann nat&uuml;rlich nicht gegeben werden.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="intern4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
