<html>
<head>
  <title>Geh&ouml;rt - notiert</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses11.html"><img src="prev.gif" alt="PREV" border=0></a><a href="geruechte.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Geh&ouml;rt - notiert
----------------

AMIGA-Meldungen
---------------

* Laut Holger Kruse wird voraussichtlich in zwei bis drei Wochen eine erste  
  &ouml;ffentliche Beta-Version seiner neuen TCP/IP-Software Miami Deluxe        
  erscheinen.

* Die Version 3.2 der CD-Brenner-Software MakeCD beherrscht als Neuheit das  
  Brennen von Audio-CDs mittels MPEG-Audio-Dateien. N&auml;here Infos gibt es    
  auf der MakeCD-Homepage <a href="http://makecd.core.de">http://makecd.core.de</a> .

* Voraussichtlich Anfang August wird bei Haage &amp; Partner die erste Version   
  der Textverarbeitung EasyWriter erscheinen. Ein ARexx-Port sowie PowerPC-  
  Unterst&uuml;tzung sollen &uuml;brigens in Version 2.0 folgen. Weitere              
  Informationen zu dem Produkt waren in AMIGA aktuell 6/98 enthalten.

* Die AMIGA-Gemeinde hat auf das &quot;Abschiedsgeschenk&quot; von Maxon, das seinen  
  Raytracer Cinema 4D v4 mit der August-Ausgabe der AMIGA Plus unter die    
  Leute gebracht hat, sehr unterschiedlich reagiert. Die einen waren        
  hellauf begeistert, andere wiederum sind sauer, dass sie vor kurzem noch   
  mehrere Hundert Mark f&uuml;r das Produkt ausgegeben haben - offenbar in dem   
  Glauben, dass Cinema 4D f&uuml;r den AMIGA weiterentwickelt w&uuml;rde.

* Der Raytracer Reflections wurde in monzoom 3D umbenannt. Produkte, die    
  noch die alte Bezeichnung tragen, sollen g&uuml;nstiger verkauft werden.

* Micronik hat den Nachfolger des Infinitiv-Towers, den Infinitiv-II, auf   
  den Markt gebracht, der eine v&ouml;llig neue Optik besitzt und aus Metall      
  besteht. Das Vorg&auml;ngermodell, das noch aus Kunststoff bestand, bietet     
  Micronik jetzt f&uuml;r nur noch 189 Mark an.

* Dr. Peter Kittel, ehemals Commodore-Entwickler, und zuletzt Support-      
  Manager bei der Pios Computer AG hat gegen&uuml;ber AMIGA aktuell best&auml;tigt,   
  dass er nicht mehr f&uuml;r das Unternehmen t&auml;tig ist.

* Dave Haynie, ehemals Entwickler f&uuml;r Commodore und Amiga Technologies, hat  
  auf seiner Homepage <a href="http://www.thule.no/haynie">http://www.thule.no/haynie</a> technische Informationen   
  zu verschiedener AMIGA-Hardware (z.B. dem einst geplanten AAA-Chipsatz)    
  bereitgestellt.

* Technische Infos zu AMIGA-Hardware lassen sich auch auf                   
  <a href="http://www.nationalamiga.com/technical.html">http://www.nationalamiga.com/technical.html</a> abrufen.

* Der ICP-Verlag ist nicht mehr Mitveranstalter der j&auml;hrlichen K&ouml;lner       
  AMIGA-Messe. Nach Angaben von ICP war dies eine Entscheidung des          
  Hauptveranstalters Pro Concept. Nun wird gemunkelt, dass der AMIGA-        
  Stellenwert der Messe in Zukunft wohl abnehmen wird. Das k&uuml;ndigt sich
  m&ouml;glicherweise bereits f&uuml;r dieses Jahr an: Namhafte AMIGA-Firmen, wie
  z.B. Haage &amp; Partner oder Phase 5 sind im Ausstellerverzeichnis noch
  nicht aufgef&uuml;hrt, dagegen jedoch viele Unternehmen aus dem Standard-PC-
  Bereich und sogar die Bundeswehr(!) Auf der Computer98-Homepage 
  (<a href="http://www.computer98.de">http://www.computer98.de</a>) soll es ab Anfang August &uuml;brigens ein
  Gewinnspiel geben, bei dem Sachpreise verlost werden.

* Mit <a href="http://jobs.amiga-software.com">http://jobs.amiga-software.com</a> l&auml;sst sich eine Art AMIGA-Job-B&ouml;rse     
  aufrufen, bei der Stellenangebote und -gesuche aufgegeben werden k&ouml;nnen.

* Oberland Computer hat sein WWW-Angebot (<a href="http://www.oberland.com">http://www.oberland.com</a>)          
  umgestaltet. Als &quot;Er&ouml;ffnungsbonbon&quot; sind alle Bestellungen, die &uuml;ber die  
  WWW-Seiten get&auml;tigt werden, portofrei.

* Haage &amp; Partner ist umgezogen: Seit dem 27. Juli gilt die neue Anschrift 
  Schlossborner Weg 7, 61479 Glash&uuml;tten, Tel. 06174/966100, Fax              
  06174/966101. Die neuen B&uuml;ror&auml;ume liegen &uuml;brigens weniger als 50 km vom 
  Firmensitz AMIGA Internationals, Langen, entfernt. Vielleicht ist das ja  
  ein symbolisches Zeichen f&uuml;r eine enge Zusammenarbeit.

* Fischer Hard- und Software hat Ger&uuml;chte, nach denen das Unternehmen den   
  AMIGA-Markt verlassen hat, dementiert.


AMIGA-Spielenews
----------------

* Erst einmal eine Hiobsbotschaft: Der geplante Command&amp;Conquer-Clone       
  Caveman Species soll nun doch nicht f&uuml;r den AMIGA erscheinen.

* Der geplante Command&amp;Conquer-Clone Operation Counterstrike wird bei       
  Sadeness Software erscheinen.

* Eine Demo-Version des geplanten Fu&szlig;ballspiels Eat The Whistle kann auf    
  <a href="http://bessie.mojo.org/~amiganut/ETW-Demo.lzx">http://bessie.mojo.org/~amiganut/ETW-Demo.lzx</a> heruntergeladen werden.

* Auch von Samba World Cup ist eine Demo-Version erschienen. Download ist   
  auf <a href="http://bessie.mojo.org/~amiganut/sambademo.lha">http://bessie.mojo.org/~amiganut/sambademo.lha</a> m&ouml;glich.

* Ein Demo gibt es auch von dem neuen Adventure &raquo;In the shadow of time&laquo;.     
  Zwei Dateien sind downzuloaden:                                            
  <a href="http://www.amigaflame.demon.co.uk/ShadowofTimeDemo_1.lha">http://www.amigaflame.demon.co.uk/ShadowofTimeDemo_1.lha</a> und               
  <a href="http://www.amigaflame.demon.co.uk/ShadowofTimeDemo_2.lha">http://www.amigaflame.demon.co.uk/ShadowofTimeDemo_2.lha</a>

* Eine Demo-Version des soeben erschienenen Shoot'Em'Ups Ultra Violent      
  Worlds kann auf <a href="http://www.vorlonsoftware.com">http://www.vorlonsoftware.com</a> heuntergeladen werden.

* Alive Mediasoft hat eine CD-Version von Blade herausgebracht.

* In England ist die erste Ausgabe eines neuen Spiele-Magazins namens AMIGA  
  Survivor erschienen.


Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)
----------------------------------------------------------

* Die n&auml;chste Generation von HTML hei&szlig;t XML. Das hat das World Wide Web     
  Consortium (W3C) beschlossen. Kompatibilit&auml;t zu bisherigen WWW-           
  Dokumenten wird es nicht bieten.
 
* Apple scheint seine schwere Krise &uuml;berwunden zu haben. Zum dritten Mal in  
  Folge konnte ein Quartalsgewinn erwirtschaftet werden. Der Umsatz ist     
  jedoch nach wie vor r&uuml;ckl&auml;ufig.

* Mittels eines selbstgebastelten 250.000 US-Dollar teuren Computers konnte  
  der von der US-Regierung als sicher eingestufte 56 Bit Data Encryption    
  Standard (DES) innerhalb von 56 Stunden entschl&uuml;sselt werden.

* IBM will noch in diesem Sommer die ersten auf Kupfer basierenden          
  PowerPC604-Prozessoren herstellen. Begonnen werden soll mit einer 400MHz-  
  Version, im n&auml;chsten Jahr soll dann die 1GHz-Grenze &uuml;bersprungen werden.

* Die Metro AG hat ihre Anteile an den Computerfirmen Vobis, Maxdata und    
  Peacock f&uuml;r 1,2 Milliarden Dollar an das US-Unternehmen CHS Electronics   
  verkauft. Damit wird CHS gr&ouml;&szlig;ter Computer-Distributor in Europa.
 
* Die meisten von euch werden die folgende Story zwar schon kennen, aber    
  allen anderen wollen wir sie nicht vorenthalten...

&raquo;Neues von Bill ;-)

Bei einer Computermesse letztens (auf der ComDex) verglich Bill Gates
die Computerindustrie mit der Autoindustrie und machte folgendes
Statement:

&quot;Wenn General Motorg (GM) mit der Technologie so mitgehalten h&auml;tte, wie
die Computerindustrie, dann w&uuml;rden wir heute alle 25-Dollar-Autos
fahren, die mit einer Gallone Sprit 1000 Meilen fahren w&uuml;rden.&quot;

Als Antwort darauf ver&ouml;ffentlichte General Motors (von Mr. Welch selbst)
eine Presseerkl&auml;rung mit folgendem Inhalt:

Wenn General Motors eine Technologie wie Microsoft entwickelt h&auml;tte,
dann w&uuml;rden wir heute alle Autos mit folgenden Eigenschaften fahren:

1. Ihr Auto w&uuml;rde ohne erkennbaren Grund zweimal am Tag einen Unfall
haben.

2. Jedesmal, wenn die Linien auf der Stra&szlig;e neu gezeichnet werden
w&uuml;rden, m&uuml;sste man ein neues Auto kaufen.

3. Gelegentlich w&uuml;rde ein Auto ohne erkennbaren Grund auf der Autobahn
einfach ausgehen, und man w&uuml;rde das einfach akzeptieren, neu starten und
weiterfahren.

4. Wenn man bestimmte Man&ouml;ver durchf&uuml;hrte, wie z. B. eine Linkskurve,
w&uuml;rde das Auto einfach ausgehen und sich weigern, neu zu starten. Man
m&uuml;sste dann den Motor erneut installieren.

5. Man k&ouml;nnte nur allein im Auto sitzen, es sei denn, man kauft &quot;Car95&quot;
oder &quot;CarNT&quot;; aber dann m&uuml;sste man jeden Sitz einzeln bezahlen.

6. Macintosh w&uuml;rde Autos herstellen, die mit Sonnenenergie fahren,
zuverl&auml;ssig laufen, f&uuml;nfmal so schnell und zweimal so leicht zu fahren
sind, aber sie w&uuml;rden nur auf 5% der Stra&szlig;en laufen.

7. Die &Ouml;l-Kontrollleuchte und die Warnlampen f&uuml;r Temperatur und Batterie
w&uuml;rden durch eine &quot;Genereller Auto-Fehler&quot;-Warnlampe ersetzt.

8. Neue Sitze w&uuml;rden erfordern, dass alle die selbe Ges&auml;&szlig;gr&ouml;&szlig;e haben.

9. Das Airbag-System w&uuml;rde fragen &quot;Sind sie sicher?&quot;, bevor es ausl&ouml;st.

10. Gelegentlich w&uuml;rde das Auto Sie ohne jeden erkennbaren Grund
aussperren. Sie k&ouml;nnten nur wieder mit einem Trick aufschlie&szlig;en, und
zwar m&uuml;sste man gleichzeitig den T&uuml;rgriff ziehen, den Schl&uuml;ssel drehen
und mit einer Hand an die Radioantenne fassen.

11. General Motors w&uuml;rde Sie zwingen, mit jedem Auto einen
Deluxe-Kartensatz der Firma Rand McNally (seit neuestem eine GM-Tochter)
mit zu kaufen, auch wenn Sie diesen Kartensatz nicht brauchen oder
m&ouml;chten. Wenn Sie diese Option nicht wahrnehmen, w&uuml;rde das Auto sofort
50% langsamer werden (oder schlimmer). Dar&uuml;berhinaus w&uuml;rde GM deswegen
ein Ziel von Untersuchungen der Justiz.

12. Immer dann, wenn ein neues Auto von GM vorgestellt w&uuml;rde, m&uuml;ssten
alle Autofahrer das Autofahren neu erlenen, weil keiner der Bedienhebel
genau so funktionieren w&uuml;rde, wie in den alten Autos.

13. Man m&uuml;sste den &quot;Start&quot;-Knopf dr&uuml;cken, um den Motor auszuschalten.&laquo;

(Quelle: Haage &amp; Partner)
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses11.html"><img src="prev.gif" alt="PREV" border=0></a><a href="geruechte.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
