<html>
<head>
  <title>PowerUp-to-date</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="powerup2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

PowerUp-to-date
---------------

1. CybervisionPPC erschienen

Phase 5 hat Anfang Juli mit der Auslieferung der CybervisionPPC, einer 3D-
Grafikkartenerg&auml;nzung f&uuml;r die A3000/4000-Prozessorkartenserie
CyberstormPPC, begonnen. Einen Test findet ihr in dieser AMIGA-aktuell-
Ausgabe. &Uuml;ber die Spezifikationen des Produkts informiert die folgende 
Ank&uuml;ndigung:

&raquo;CyberVisionPPC - Eine HighEnd Grafikkarte f&uuml;r die Cyberstorm PPC und das
Blizzard 2604 Power Board

F&uuml;r die beiden PPC604e-basierenden Beschleunigerkarten Cyberstorm PPC und
Blizzard 2604 Power Board, welche in die Desktop- bzw. Tower-Ger&auml;te
A2000/A3000(T) oder A4000(T) eingebaut werden, wird phase 5 digital
products eine leistungsstarke Grafikkarte anbieten, die gleichzeitig mit
der Lieferbarkeit des Blizzard 2604 Power Boards im zweiten Quartal 1998
verf&uuml;gbar wird. Speziell f&uuml;r die Blizzard 2604 Power Board wird der Einsatz
der CyberVisionPPC unbedingt empfohlen, da der langsame Zugriff ins
ECS-Chip-RAM bzw. auf Zorro-II-Grafikkarten die Systemperformance vor allem
bei Anwendungen mit viel graphischer Ausgabe einschr&auml;nken kann. Aber auch
die Leistung der Cyberstorm PPC profitiert durch den extrem hohen
Datendurchsatz in Folge der direkten Anbindung der Grafikarte an den
Prozessorbus in vielen Anwendungen wie z.B. bei schneller 3D-Darstellung
erheblich.

Aber nicht nur der schnelle Zugriff des Prozessors in die Grafikkarte,
sondern auch die interne Leistung der CyberVisionPPC tr&auml;gt zu
atemberaubender Leistung bei: Als Grafikprozessor kommt der leistungsstarke
PERMEDIA2-Chip zum Einsatz, der eine herausragend schnelle 3D-Leistung von
bis zu 80 Millionen texturierten Pixeln erreicht. Dabei unterst&uuml;tzt der
PERMEDIA2 verschiedene 3D-Funktionen wie Z-Buffering, Gouraud-Shading,
Fogging, Blending und Antialiasing. Durch seine optimierte Auslegung f&uuml;r
OpenGL-Beschleunigung kann die 3D-Leistung des PERMEDIA2-Grafikprozessors
auf der CyberVisionPPC von CyberGL genutzt werden, womit die CyberVisionPPC
eine Hardware-3D-Unterst&uuml;tzung f&uuml;r professionelle, CyberGL-gest&uuml;tzte
Anwendungen bieten wird. In Kombination mit der besonders hohen
Floating-Point-Leistung des PowerPC 604e-Prozessors wird diese Kombination
eine atemberaubende Leistung im 3D-Bereich erm&ouml;glichen. Dar&uuml;berhinaus
bietet der PERMEDIA2 zus&auml;tzliche Funktionen wie Farbraumkonvertierung,
Chroma-Keying und XY-Skalierung, welche die auf den PowerUp-Karten als
Bestandteil der CyberGraphX-Software verf&uuml;gbare MPEG- Dekodierung
unterst&uuml;tzen.

Als Speicher kommt auf der CyberVisionPPC 64-bit breites SGRAM mit einem 
Datendurchsatz von bis zu etwa 800 MB/sec zum Einsatz, was in Verbindung
mit dem schnellen RAMDAC Aufl&ouml;sungen von bis zu 1280x1024 Pixeln in True
Color- Darstellung bei 85 Hz Bildwiederholfrequenz erlaubt; bei 1600x1200
Pixeln sind noch True Color-Darstellung (24Bit) mit 60 Hz oder High
Color-Darstellung (16Bit) mit 85 Hz m&ouml;glich. Die Karte wird mit 4 MB oder 8
MB Bildspeicher geliefert.&laquo;

(Quelle: Phase 5 digital products)

[Anm. d. Red.: Zu dem Zeitpunkt, als diese Ank&uuml;ndigung entstand, ging man 
offenbar noch von einem Erscheinen der Blizzard 2604 - vgl. die 
entsprechende PowerUp-Kurzmeldung in dieser Ausgabe - und von der 
Produktion einer 4MB-Version der Grafikkarte aus. Beides ist nicht der 
Fall. 
Die CybervisionPPC ist &uuml;brigens f&uuml;r knapp 500 Mark erh&auml;ltlich.]


Die BVisionPPC, das Pendant f&uuml;r die A1200-Turbokartenserie Blizzard603e(+) 
soll Anfang dieses Monats erscheinen und f&uuml;r knapp 400 Mark &uuml;ber die 
Ladentische gehen.
</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="powerup2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
