<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Flyin` High 1.05</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Flyin` High 1.05</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></CENTER>

<P><B>PURE-Design</B> teilte uns mit, da&szlig; auf ihrer Website ein kostenloser Patch
downloadbar sei, der einige der Kritikpunkte der in der letzten Ausgabe
getesteten Version 1.0 beseitigen w&uuml;rde. Inzwischen wurde er auch im
Aminet ver&ouml;ffentlicht. Dies ist kein kompletter Test, sondern ich
beziehe mich auf den erw&auml;hnten und gehe auf neue oder ver&auml;nderte
Punkte ein.</P>

<P>Der <B>Patch</B> (gepackt etwa 56 KB) ersetzt lediglich das Haupt-, sowie das
Catalog-File. Die spannende Frage lautet: Wird eine Neubewertung n&ouml;tig
sein?</P>

<P>Neben einigen internen Ver&auml;nderungen, wie z.B. die Anpassung auf die
jetzt erscheinenden <B>Datendisks</B> mit neuen `Welten` sind drei wichtige
Probleme angegangen worden.</P>

<P>Im Auswahlmen&uuml; &quot;Neues Spiel&quot; kann man jetzt die <B>Spielst&auml;rke</B> der
Gegner ausw&auml;hlen: &quot;Schwach&quot;, &quot;Durchschnittlich&quot; oder &quot;Stark&quot;.</P>

<P>Bei &quot;Einstellungen&quot; kann man jetzt w&auml;hlen, ob Joystick-Hoch oder
Joystick-Feuer den Buggy beschleunigt oder stattdessen Extras
ausgel&ouml;st werden.</P>

<P>Die dritte gro&szlig;e Ver&auml;nderung betrifft die <B>Steuerbarkeit</B>. Auch sie
soll verbessert worden sein.</P>

<P>Doch starten wir wieder den Cup und testen die Ver&auml;nderungen aktiv.</P>

<P>Tats&auml;chlich sind die Gegner schon im Durchschnitts-Modus wesentlich
`normaler` und auf jeden Fall zu packen. Wenn man wenig Fehler
macht, kann man sie besiegen.</P>

<P>Das steigert nat&uuml;rlich schon den <B>Spielspa&szlig;</B>, ganz besonders aber,
da&szlig; die Steuerbarkeit in der Tat deutlich sp&uuml;rbar gesteigert wurde.</P>

<P>Endlich ist es m&ouml;glich Gegner kontrolliert zu &uuml;berholen oder
Hindernissen auch kurzfristig auszuweichen. Ja erst jetzt ist
eine echte Spielbarkeit erreicht worden.</P>

<P>Ein Durchtesten der Einstellm&ouml;glichkeiten ist immer noch n&ouml;tig und
anzuraten, um die f&uuml;r das jeweilige System optimale L&ouml;sung zu
finden. Durch die verbesserte Steuerbarkeit stehen aber auch etwas
geringer dimensionierten Amigas jetzt ein paar Optionen mehr offen.</P>

<P>Das das <B>Streckendesign</B> teilweise unelegant gel&ouml;st wurde, konnte
durch diesen Patch nat&uuml;rlich nicht ver&auml;ndert werden, wird aber durch
die erscheinenden Datendisks vielleicht abgemildert werden.</P>

<P>Die <B>Anzahl der Runden</B> pro Abschnitt ist leider noch nicht
einstellbar, wodurch die Gleichf&ouml;rmigkeit der beiden angebotenen
Cups, bei denen in einer `Welt` erst 25 Runden absolviert werden
m&uuml;ssen, ehe man zur n&auml;chsten gelangt, voll zum Tragen kommt.</P>

<P>Das w&auml;ren die gro&szlig;en verbliebenen <B>Kritikpunkte</B>, die die
Bewertung in Bezug auf Spielspa&szlig; noch nach unten dr&uuml;cken.</P>

<P><B>Fazit</B>: Erst jetzt ist aus Flyin` High ein ernstzunehmendes Rennspiel
geworden, besser sp&auml;t als gar nicht. Schade, da&szlig; die alte Version 1.0
bei vielen nur einen getr&uuml;bten Eindruck hinterlassen hat. Erfreulich
hingegen, da&szlig; die Weiterentwicklung nicht stehengeblieben ist.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TH>Produkt:</TH>
    <TD><A HREF="http://www.informatik.tu-muenchen.de/~poellman/flyin/flyin.html">Flyin`High</A></TD>
    <TH>Hersteller:</TH>
    <TD>PURE-Design</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Autorennen</TD>
    <TD><B>Version:</B></TD>
    <TD>1.05 (Update)</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>69.95 DM (CD oder Disk)</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TPC</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>2</TH></TR>
<TR><TD COLSPAN=4 ALIGN="CENTER">Vertrieb: APC&amp;TPC, Dorfstra&szlig;e 17, 83236 &Uuml;bersee</TD></TR>
</TABLE></P><BR>


<P><HR>
<TABLE ALIGN=CENTER WIDTH="100%">
<TR>
    <TD ALIGN=LEFT"><A HREF="9712uro.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712pbbd.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
</TABLE></P>
</BODY>
</HTML>
