<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - pOS - &Uuml;berblick</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>p.OS - Ein &Uuml;berblick</U></H1><P ALIGN="CENTER">von<BR><A HREF="T.Heinrich@t-online.de">Thomas Heinrich</A><BR><BR><A HREF="../amz1297/images/pos.jpg">Screenshot (92KB)</A></P>

<B>Was ist pOS ?</B>

<P>pOS ist ein neues Betriebssystem f&uuml;r den Amiga. Und um es noch besser zu
machen: pOS ist auch ein Betriebssystem f&uuml;r andere Rechnertypen, vor allem
f&uuml;r PowerPC basierende Computer.</P>

<P>Entstanden ist pOS aus der Not heraus, wie in letzter Zeit vieles, was mit
dem Amiga zu tun hat. Nach dem Crash von Commodore und ESCOM war der Amiga
pl&ouml;tzlich ein Computerwaise. Keine Mutterfirma war mehr vorhanden, die die
Zukunft unseres Lieblingsrechners in positiver Weise beeinflussen konnte.
Die einzigen treibenden Kr&auml;fte waren die Dritthersteller und die
Amiga-User selbst.</P>

<P>Die Computerbranche ist sehr schnellebig. Der technologische Vorsprung,
den der Amiga vor f&uuml;nf Jahren noch hatte, ist immer weiter
zusammengeschmolzen, bis ihn der PC nun in vielen Bereichen &uuml;berholt hat.</P>

<P>Der Amiga-Markt hat auf zwei Arten reagiert: Manche Firmen haben ihr
Hauptengagement auf den PC-Markt verlagert, oder sich gar ganz auf PCs
spezialisiert, manche Firmenwollten die immer noch vorhandenen Vorteile
des Amiga mit den Vorteilen der modernen Technik verbinden.</P>

<P>Der Ansatz war indes unterschiedlich: W&auml;hrend viele Hardwarefirmen
haupts&auml;chlich die moderne Technik dem Amiga zug&auml;nglich machten
(Grafikkarten, Prozessorboards), gingen andere Firmen wie ProDAD den
umgekehrten Weg: Sie portierten das Amiga-Betriebssystem auf andere
Rechnerplattformen. </P>

<P>Um nun neben den Vorteilen nicht auch noch die Nachteile des AmigaOS
mitzuportieren, wurde es keine 1:1 Umsetzung, sondern etwas Neues, nur
mit Amiga-Feeling. Das pOS (portable OS) war geboren.</P>

<P>Seit einigen Wochen ist eine Vorversion des pOS f&uuml;r Amiga-Rechner
erh&auml;ltlich. Und ich m&ouml;chte betonen: Es gibt zur Zeit auch nur eine
Version, n&auml;mlich die f&uuml;r den Amiga. Wie es scheint, hat ProDAD doch mit
mehr Schwierigkeiten bei der Umsetzung zu k&auml;mpfen, als vorauszusehen war.</P>

<B>Der erste Eindruck</B>

<P>pOS wird, wie es sich auf dem Amiga geh&ouml;rt, mit dem Installer eingerichtet.
Als Bonus kann man pOS auch direkt von CD starten. Die Vorversion
unterst&uuml;tzt &uuml;brigens nur 8bit-Bildschirme, also maximal 256 Farben.</P>

<P>Der erste Eindruck, wenn pOS dann einmal l&auml;uft, ist: Laut und bunt. Ein
tickern ist zu h&ouml;ren, wenn pOS bootet, und eine Fanfare, wenn es dann
geladen ist. Quietschbunte Comic-Icons repr&auml;sentieren Volumes (Disketten
und Partitionen), Verzeichnisse und Dateien. Es wird also, wie beim Amiga,
das Dateisystem als Workbench grafisch abgebildet. Keine Umstellung f&uuml;r
unsereins, aber ein Windows- oder Mac-Anwender wird seine Probleme
bekommen.</P>

<B>Die Details</B>

<P>Wie schon von MUI gewohnt, setzt auch pOS auf BubbleHelp. Diese
Sprechblasen mit Hilfetexten sind wie bei MUI einstell- und abschaltbar.
Auch Docks, wie vom ToolManager bekannt, sind vorhanden. Etwas anders ist
die Einstellung der Icons. Man ver&auml;ndert mit dem modularen Voreinsteller,
der &uuml;brigens vergleichsweise lange braucht, bis er geladen ist, das
gesamte Iconset f&uuml;r das System.</P>

<P>Wie im Prefs-Verzeichnis des Amiga, gibt es auch unter pOS alle n&ouml;tigen
Einsteller, nur eben zentral verwaltet von pOS-Prefs. Bei einigen
Einstellern macht man sich allerdings vergeblich M&uuml;he, etwas zu &auml;ndern,
sie funktionieren einfach (noch) nicht, z.B. der Maus-Einsteller.
Nat&uuml;rlich kann man alles &auml;ndern, was der verspielte User verlangt:
Hintergrund, Sounds, Requester, Zeichens&auml;tze, usw.</P>

<P>Die Fenster von pOS sind denen des AmigaOS verbl&uuml;ffend &auml;hnlich. Sie
enthalten die gleichen Funktionselemente (Schlie&szlig;-, Zoom-, Sizingsymbol),
die auch von der Gestaltung her fast identisch sind. Der Unterschied ist,
da&szlig; die Fenster mit Inhalt vergr&ouml;&szlig;ert und verschoben werden k&ouml;nnen, wie
bei diversen Amiga-Patches auch.</P>

<P>Auch auf Amiga-Laufwerke braucht man nicht zu verzichten, man kann sie
als pOS-Laufwerke einbinden. Allerdings versteht pOS nur das FFS-Format
des Amiga. Leider hat es noch kein eigenes Dateisystem, so da&szlig; FFS das
einzigste Dateisystem &uuml;berhaupt ist, das pOS versteht.</P>

<P>Auch das pOS-Men&uuml;system ist dem des Amiga sehr verwandt, zumindest wenn
man Tools wie MagicMenu gewohnt ist.</P>

<B>Die Programme</B>

<P>Die pOS-CD enth&auml;lt auch einige Demonstrationsprogramme, unter anderem
einen AmigaGuide-Anzeiger, der recht gut funktioniert, einen HTML-Viewer,
der ein paar Probleme mit der Positionierung von Text und Grafik hat und
einen Bildanzeiger, dessen Fenster man nicht mehr schlie&szlig;en kann, wenn die
Bilder zu klein sind. Unangenehmerweise erscheint dann n&auml;mlich kein
Schlie&szlig;symbol, so da&szlig; bis zu einem Neustart eine Fensterleiche im Weg
steht. Dies sind aber durchaus &uuml;bliche Kinderkrankheiten eines neuen
Systems und sollten bis zur endg&uuml;ltigen Version verschwunden sein.</P>

<P>Zusammen mit ein paar eindrucksvollen Grafik-Effektprogrammen, ein paar
Spielen (Schach, Tetris, Arkanoid, Puzzle) und einem einfachen
Dateimanager bringt die Vorversion schon recht gut her&uuml;ber, wie die
endg&uuml;ltige Version einmal aussehen soll und wie leistungsf&auml;hig sie ist.
Da sind wir auch schon am wunden Punkt: Nach meiner Einsch&auml;tzung ist ein
MC68040 mit 8 MB RAM schon n&ouml;tig, um fl&uuml;ssig und mit Spa&szlig; arbeiten zu
k&ouml;nnen. Die genannten Mindestvoraussetzungen von MC68020 und 4 MB RAM
sind ziemlich tief gegriffen.</P>

<B>Die Haken und &Ouml;sen</B>

<P>pOS als Oberfl&auml;che ist f&uuml;r den Amiga-Anwender ein vertrauter Anblick. Man
findet sich relativ problemlos zurecht und kann die Demoprogramme auch
ohne Anleitung in k&uuml;rzester Zeit bedienen.</P>

<P>Besonders bequem ist die automatische Identifikation von Dateien, die auf
Doppelklick den jeweils richtigen Anzeiger f&uuml;r sich laden. Bezahlt wird
die Bequemlichkeit nat&uuml;rlich durch eine etwas l&auml;ngere Wartezeit beim
Einlesen eines Verzeichnisses.</P>

<P>In Bezug auf die Darstellungsgeschwindigkeit macht sich das Chip-RAM
negativ bemerkbar. Aus unerfindlichen Gr&uuml;nden belegt die Grafik des pOS
Chip-RAM, obwohl z.B. CyberGraphX auch v&ouml;llig ohne auskommt. Mit einem
Patch auf der Amiga-Seite kann man pOS allerdings problemlos dazu
&uuml;berreden, fast kein Chip-RAM mehr zu verwenden.</P>

<P>Ein Filesystem fehlt fast v&ouml;llig, ebenso wie eine eigenst&auml;ndige
Grafikansteuerung. In allen diesen Belangen, die f&uuml;r ein OS bestimmend
sind, verl&auml;&szlig;t sich pOS noch ganz auf den Amiga.</P>

<B>Meine Einsch&auml;tzung</B>

<P>pOS will ein eigenst&auml;ndiges OS werden. Die Betonung liegt auf &quot;werden&quot;,
denn soweit ist es noch lange nicht. Zumindest die aktuelle Vorversion
wirkt eher wie ein verspielter Aufsatz auf das Amiga-OS. Den gibt es
jedoch f&uuml;r weniger Geld und weniger Hardwarevoraussetzung mit diversen
Hilfsprogrammen auch f&uuml;r den Amiga. Zu eng ist noch die Verzahnung zum
Amiga-OS, das sich auch in der vorsorglichen Inaktivierung mancher Tools
zeigt, die auf dem Amiga f&uuml;r Komfort sorgen, sich unter dem parallel
laufenden pOS aber gar nicht so gutm&uuml;tig zeigen. Bei meiner
Konfiguration hat sich MagicMenu als ein &Uuml;belt&auml;ter gezeigt. War es
aktiviert, konnte man unter pOS kein Men&uuml; &ouml;ffnen.</P>

<P>Zur Zeit kann pOS nichts, das das Amiga-OS nicht auch k&ouml;nnte. Zwar gibt
es einige Funktionen beim Amiga nicht von Haus aus, aber man kann sie
ohne Probleme nachr&uuml;sten.</P>

<P>Am meisten fehlen mir bei pOS, das ein modernes OS werden soll, die
modernen Funktionen. Kein Speicherschutz, der dringend n&ouml;tig w&auml;re, kein
virtueller Speicher, kein schnelles/nicht-fragmentierendes Dateisystem,
keine native Grafikkartenunterst&uuml;tzung. Wenn alle diese Elemente bei der
Einf&uuml;hrung fehlen, wird man keinen PCler &uuml;berzeugen k&ouml;nnen, auf pOS
umzusteigen. Der Amiga-User hat auch keinen gro&szlig;en Anreiz, jetzt
umzusteigen, da Amiga International einen Kickstart 3.5 und bald
auch Kickstart 4.0 angek&uuml;ndigt hat.</P>

<B>Fazit</B>:

<P>Der einzige Nutzen von pOS ist zur Zeit, Amiga-Feeling auf Rechnern zu
bieten, auf denen das Amiga-OS nicht l&auml;uft. Aber auf diese Rechner ist
pOS noch nicht umgesetzt. Der konkrete Nutzen n&auml;hert sich also f&uuml;r den
User dem Wert null. Immerhin k&ouml;nnen Programmierer schon einmal
Anpassungen vornehmen, um schnell mit portierten Programmen dienen
zu k&ouml;nnen.</P>

<P ALIGN="CENTER"><A HREF="9712test.htm">Testkonfiguration</A></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712uae.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712uro.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
