<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - APC&amp;TCP-CDs 4+5</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>APC&amp;TCP-CD`s 4+5</U></H1><P ALIGN="CENTER">von<BR><A HREF="G.Franz@gmx.de">Gregor Franz</A></P>

<H2 ALIGN="CENTER">Die APC&amp;TCP-Volume 4.</H2>

<P>Diese CD soll eine <B>Fortsetzung</B> zur APC&amp;TCP-CD 3 darstellen, die als
Spielsammlung (vorwiegend aus dem PD-Bereich), ebenso wie die anderen
vorher erschienenen APC&amp;TCP-CD`s, bereits in der letzten Ausgabe
getestet wurde.</P>

<P>Zu den zirka 1.000 Spielen der letzten CD sind nun noch einmal etwa
700 hinzugekommen.</P>

<P><B>Die wichtige Frage</B>, die sich aber stellt, ist die, ob die gravierenden
Kritikpunkte zur letzten Spiel-CD etwas bewirkt und ihre Ursachen
beseitigt worden sind.</P>

<P>Um welche Kritikpunkte geht es? Einem im Verh&auml;ltnis hohen Preis stand
eine lieblose Zusammenstellung gegen&uuml;ber. Lediglich eine Unterteilung
nach dem Alphabet und nicht etwa nach Genres, machte den Spieler
gegen&uuml;ber der Datenmasse hilflos und eher zum `Sucher`.</P>

<P>Warum ich darauf so genau eingehe? Weil sich daran auch bei dieser
CD nichts ge&auml;ndert hat. Leider.</P>

<P>Wieder gibt es ein Verzeichnis mit Demoversionen verschiedener
Shareware- und Vollpreisspiele, in dem sich einige interessante
Vertreter der Spielewelt anfinden. Daneben existiert das eigentliche
Spielehauptverzeichnis, in dem sich lediglich f&uuml;r jeden Buchstaben
des ABC`s ein Unterverzeichnis finden l&auml;&szlig;t.</P>

<P>Dagegen hilft auch das diesmal mitgelieferte <B>Suchtool</B> nichts, da
dies voraussetzen w&uuml;rde, da&szlig; man vorher genau wei&szlig;, wonach man sucht.</P>

<P>Das <B>Grundproblem</B>, da&szlig; viele der Spiele eine unterdurchschnittliche
Qualit&auml;t aufweisen, unsauber programmiert sind, bzw. sich nicht
ordentlich beenden lassen und somit einen Neustart erforderlich
machen, ist zwar nicht den Machern dieser CD anzulasten, die
Aufteilung kann aber doch ein wesentlicher Faktor sein, schneller
ein Erfolgserlebnis zu haben.</P>

<P>Ein paar Assigns, sowie voreingestellter Screenmode oder Palette
auf Knopfdruck, k&ouml;nnen an dem Gesamteindruck leider nichts &auml;ndern.</P>

<P>Auch unter den Spielen, an sich ja schon weniger als bei Volume 3,
(aber bereits dort sah man, da&szlig; Masse nicht Klasse bedeutet), fanden
sich wesentlich weniger Highlights. Das Ganze erscheint mir denn
doch ein eher &uuml;berfl&uuml;ssiger Nachschieber zur Volume 3 zu sein.</P>
<BR>
<TABLE ALIGN="CENTER" BORDER="1">
<TR>
    <TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 4</TD><TH>Hersteller:</TH><TD>APC&amp;TCP</TD>
</TR>
<TR>
    <TH>Art:</HT><TD>Daten-CD</TD><TH>Version:</TH><TD>n/a</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>24.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD>
</TR>
<TR>
    <TH>Gesamt:</TH><TH ALIGN="CENTER">5</TH><TD ALIGN="CENTER" COLSPAN="2"><IMG SRC="../images/note5.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TD ALIGN="CENTER" COLSPAN="4">APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee</TD>
</TR>
</TABLE>
<P><HR WIDTH="30%"></P>
<H2 ALIGN="CENTER">Die APC&amp;TCP-Volume 5.</H2>

<P>Diese CD erinnert in ihrer Machart mit den Mischinhalten stark an
die Volume 1. Spiele, Tools und interessante Texte sollen unter
anderem auf ihr zu finden sein.</P>

<P>An <B>Texten</B> stehen die seit Volume 1 erschienenen AmigaGadgets zur
Verf&uuml;gung, sowie alle Ausgaben der APC&amp;TCP-Clubzeitschrift &quot;NoCover&quot;.</P>

<P>In einem weiteren Verzeichnis kann man noch einige andere
zusammengesammelte AmigaGuides, Texte usw. zu allen m&ouml;glichen
Themen durchschm&ouml;kern.</P>

<P>Die Linie, klar abzugrenzen, inwieweit die Beitr&auml;ge von Mitgliedern
stammen/gesammelt wurden, ist noch strenger, als bei den anderen
Club-CD`s durchgehalten worden. In den meisten F&auml;llen gibt es
spezielle Unterteilungen.</P>

<P>Bei <B>Games</B> ist, wie gewohnt ein Preview- und ein PublicDomain-
Abschnitt zu finden, sowie, das ist neu, einer f&uuml;r Spielst&auml;nde,
was f&uuml;r so manchen eine Hilfe darstellen kann.</P>

<P>Der <B>Tool</B>-Abschnitt bietet nicht so viel Neues, ja das meiste ist
altbekannt und selbst auf der Volume 1 teilweise schon enthalten.</P>

<P>Im <B>Multimedia</B>-Bereich kann man sich dann f&uuml;r Picture`s, Sound`s oder
die Workbench entscheiden.</P>

<P>In letzterem Abschnitt gibt es haupts&auml;chlich diverse Iconpakete.
Qualit&auml;t und Quantit&auml;t haben im Vergleich zu Volume 1 nachgelassen.</P>

<P>Zu den <B>Bildern</B> im `Member`-Bereich sind sicherlich ein paar
hinzugekommen, aber ansonsten ist hier der komplette Bereich von
Volume 1 gespiegelt worden.</P>

<P>Die Bilder im `Other`-Bereich sind zwar gro&szlig;teils von recht guter
Qualit&auml;t, aber leider (!) kann ich diesmal die schlechte Unterteilung
nicht bem&auml;ngeln, da sie mangels Menge gut zu &uuml;berblicken sind.</P>

<P>Auch der <B>Sound</B>-Bereich ist diesmal nicht so umfangreich geraten
und bietet nichts besonderes.</P>

<P><B>Alles zusammengenommen</B> also wenig Gr&uuml;nde, sich f&uuml;r diese CD zu
entscheiden. Vieles wurde von Volume 1 &uuml;bernommen, der man eine
f&uuml;r CD-Einsteiger gute Mischung und auch ein gewisses Abheben zu
Aminet-CD`s bescheinigen konnte. Gerademal f&uuml;r Club-Mitglieder
ist die APC&amp;TCP-Volume 5 interessant.</P>

<P>Der Preis gegen&uuml;ber Volume 1 ist &uuml;brigens um knapp 5 DM gestiegen.
Ab Anfang 98 wird Volume 1 allerdings nur noch knapp 10 DM kosten.</P>
<BR>
<TABLE ALIGN="CENTER" BORDER="1">
<TR>
    <TH>Produkt:</TH><TD>APC&amp;TCP-CD Volume 5</TD><TH>Hersteller:</TH><TD>APC&amp;TCP</TD>
</TR>
<TR>
    <TH>Art:</HT><TD>Daten-CD</TD><TD>Version:</TD><TD>n/a</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>24.95 DM</TD><TH>Bez.Quelle:</TH><TD>APC&amp;TCP</TD>
</TR>
<TR>
    <TH>Gesamt:</TH><TH ALIGN="CENTER">4</TH><TD ALIGN="CENTER" COLSPAN="2"><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TD ALIGN="CENTER" COLSPAN="4">APC&amp;TCP, Andreas Magerl, Dorfstr. 17, 83236 &Uuml;bersee</TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz1297/9712iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712ep2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
