<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Uropa 2</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Uropa 2</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></CENTER>

<P>Zuerst zum Hintergrund, da dieser tats&auml;chlich wichtig f&uuml;r das Spiel ist.</P>

<B>Die Story</B>

<P>Uropa2 ist eine kleine Kolonie, die auf dem Jupitermond Europa angesiedelt
ist. Nachdem der Mond durch einen Krieg mit au&szlig;erirdischen Invasoren
beinahe vollst&auml;ndig zerst&ouml;rt wurde, benannten ihn die Kolonisten nach
dem Wiederaufbau in Uropa2 um.</P>

<P>Nachdem die Menschen die Au&szlig;erirdischen unter gro&szlig;en Verlusten aus dem
Sonnensystem vertrieben hatten, wurde eine neue Truppe namens Intercorp
gegr&uuml;ndet, die Kolonien und Erde sch&uuml;tzen soll. Sie besteht aus drei
Spezialeinheiten. Die Haupteinheit besteht aus Menschen und intelligenten
Droiden, sogenannten Tekiten. Daneben gibt es eine Spezialeinheit aus
anderen intelligenten Droiden, den Kapones, die f&uuml;r die Verteidigung
wichtiger Kolonien zu sorgen haben.</P>
<P>Die dritte Einheit besteht aus den einhundert besten Tekiten und nennt
sich Centurion-Einheit. Sie ist f&uuml;r Kommandounternehmen da.</P>
<P>Die Kapones, die mit Uropas Verteidigung betraut waren, haben nun
rebelliert und die Macht an sich gerissen, um mit den Invasoren
gemeinsame Sache zu machen.</P>
<P>Als auf den Mond transportierter Tekite der Centurion-Einheit hat man nun
verschiedene Missionen zu erf&uuml;llen, mit dem Ziel die Macht der Kapones zu
zerst&ouml;ren und einen eigenen Angriff vorzubereiten.</P>
<B>Voraussetzungen</B>
<P>Das Spiel l&auml;uft auf jedem Amiga mit Festplatte und CD-Laufwerk. Je 1 MB
Chip- und Fastram werden vorausgesetzt. Bessere Ausstattung, wie AGA oder
mehr Speicher wird erkannt und unterst&uuml;tzt.</P>
<B>Lokalisation</B>
<P>Unter zehn verschiedenen Sprachen kann man w&auml;hlen, darunter auch Deutsch.
Die gesamten Bildschirmtexte und die Anleitung sind also eingedeutscht,
lediglich der Sound bleibt gleich, doch dazu sp&auml;ter mehr.</P>
<P>Die Anleitung liegt als Amigaguide vor und deckt die wichtigsten Dinge ab.</P>
<B>Intro</B>
<P>Nach der f&uuml;r Amiga-Verh&auml;ltnisse aufwendigen Raytracing-Intro, die nicht
schlecht ist, aber auch nicht vom Hocker reisst, beginnt nach ein paar
Einstellungen, wie der Sprache, Sound- und Grafikdetails, das Spiel.</P>
<B>Grafik</B>
<P>In den Basen spielt sich alles mit Hilfe isometrischer 3D-Grafik ab.
Au&szlig;erhalb der Basen kann man mit einem Hovar-Gleiter in einer
Lightsource-Vektorgrafik herumkurven und feindliche J&auml;ger abschie&szlig;en.</P>
<P>Die Grafik ist zweckm&auml;&szlig;ig, aber insgesamt eher durchschnittlich, da&szlig;
gilt f&uuml;r beide Modi. Trotzdem macht das Spiel Spa&szlig;, denn es wird eine
gute Atmosph&auml;re aufgebaut. Viele interessante R&auml;ume gibt es zu erkunden,
neben diversen Generatorr&auml;umen, Lagerr&auml;umen und was noch so zu einer
Basis geh&ouml;rt, von denen es im &uuml;brigen 12 verschiedene auf Uropa2
gibt, kann man selbst die Toiletten der Kolonisten begutachten. :)</P>
<P>Hilfreich ist die zur Verf&uuml;gung gestellte Karte, in die man auch
zoomen kann und die ebenfalls deutsch beschriftet ist. Auch &uuml;ber die
Missionsziele kann man sich noch einmal ausf&uuml;hrlich informieren lassen
oder auch in Stichpunkten ganz kurz.</P>
<B>Das Spiel selbst</B>
<P>In zahlreiche Computer-Terminals kann man sich einw&auml;hlen, um sich mit
Informationen, Waffen oder Ausr&uuml;stung einzudecken. Nat&uuml;rlich mu&szlig; man
sich vor feindlichen Droiden vorsehen, denn der eigene ist am Anfang
nicht gerade gut ausgestattet und jeder Kampf ist von dem zaghaften
Blick auf den sich sp&auml;ter nur langsam regenerierenden Lebensenergiebalken
gekennzeichnet.</P>
<P>Wenn man einen feindlichen Droiden bewegungsunf&auml;hig geschossen hat, kann
man von ihm Daten downloaden, die sp&auml;ter an bestimmten Terminals zu Geld
gemacht werden k&ouml;nnen. Danach sollte man ihn ganz zerst&ouml;ren, da er dann
manchmal wichtige Gegenst&auml;nde hinterl&auml;&szlig;t, z.B. Schl&uuml;ssel, die hilfreich
sein k&ouml;nnen.</P>
<P>Auch in den R&auml;umen sind viele hilfreiche Dinge versteckt, die einem das
Leben erleichtern k&ouml;nnen, angefangen bei Waffenerweiterungen bis hin zu
Zeitbomben. Manche sind in Gegenst&auml;nden, wie z.B. Truhen versteckt, die
man generell &uuml;berpr&uuml;fen sollte. Dabei wird einem, wie bei vielen
Funktionen im Spiel, ein Amiga-liker Requester angeboten, der die
Suche dann mit einer F&uuml;llstandsanzeige durchf&uuml;hrt und &uuml;ber das
Ergebnis informiert.</P>

<P>Die Kolonisten, die einem &uuml;ber den Weg laufen, sollen, neben dem
eigentlichen jeweiligen Missionsziel, evakuiert werden. Man kann ihnen
auch Anweisungen geben, z.B. das sie einem ihre Gegenst&auml;nde aush&auml;ndigen,
wenn sie welche besitzen sollten oder ob sie einem folgen oder dableiben
sollen.</P>

<P>Mit Teleportern kann man andere Ebenen erreichen und sich so z.B. zur
Mondoberfl&auml;che versetzen (und somit zum Gleiter) oder die Kolonisten
evakuieren.</P>

<P>Viele originelle Dinge wurden eingebaut, z.B. kann man gefangene
Kolonisten aus den Zellen befreien oder sich, nachdem man von diesem
Experiment Kenntnis erlangt hat, kurzzeitig zu einem Kapone umwandeln.</P>

<P>&Uuml;berhaupt erinnert manches etwas an Tower Assault, das letzte 2D-Spiel
aus der AlienBreed-Reihe, nicht nur weil es hier eine Mission gleichen
Namens gibt und auch nicht vom Action-Aspekt her, sondern von der
Stimmung, dem gelegentlich unvorhergesehen variierenden Handlungsbogen
her.</P>

<B>Sound</B>

<P>Der Sound tr&auml;gt seinen Teil dazu bei. Die w&auml;hlbare Musik ist gut, der
Sound &uuml;berdurchschnittlich und alle Nachrichten, die man erh&auml;lt, die
Missionseinweisungen oder die Bereitschaftsmeldungen der diversen
Computer sind (in englischer Sprache) gesprochen. Klingt also alles
gut.</P>

<B>Insgesamt</B>

<P>Die Missionen sind knackig, die Schwierigkeitsstufe hoch, f&uuml;r
Abwechslung ist gesorgt. Spielst&auml;nde anzulegen ist nat&uuml;rlich kein
Problem, ebensowenig, wie sauber auf die WB zur&uuml;ckzukehren.</P>

<P>Einziger Kritikpunkt ist die Steuerung. Im allgemeinen recht gut gel&ouml;st,
wird man statt zum Joystick aber eher zur Tastatur greifen und sich
trotzdem gelegentlich &uuml;ber die Hakeligkeit &auml;rgern, wenn man mit dem
Droiden wieder an einer unsichtbaren Kante h&auml;ngenbleibt und erst
nachregeln mu&szlig;, bevor man eine T&uuml;r passieren kann.</P>

<P>Ansonsten ein solides gutes Spiel, da&szlig; f&uuml;r langen Spielspa&szlig; sorgt.
Zwei Spieler k&ouml;nnen sich &uuml;ber ein serielles Kabel &uuml;brigens auch hei&szlig;e
Hovar-Flugduelle liefern.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TH>Produkt:</TH>
    <TD>Uropa2</TD>
    <TH>Hersteller:</TH>
    <TD><A HREF="http://www.vulcan.co.uk">Vulcan Software</A></TD>
</TR>
<TR>
    <TD><B>Genre:</B></TD>
    <TD>ISO-3D-Strategiespiel</TD>
    <TD><B>Version:</B></TD>
    <TD> - </TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>89 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.schatztruhe.de">Schatztruhe</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>3</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>2</TH></TR>
</TABLE></P><BR>


<P><HR>
<TABLE ALIGN=CENTER WIDTH="100%">
<TR>
    <TD ALIGN=LEFT"><A HREF="9712pos.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712fh.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
</TABLE></P>
</BODY>
</HTML>
