<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Eagleplayer 2.00</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Eagleplayer 2.0</H1>von<BR><A HREF="A.Schlick@BBrandes.in-brb.de">Andreas Schlick</A><BR><BR><A HREF="../amz1297/images/ep2.gif">Screenshot (38KB)</A></CENTER>

<P>Jeder der sich l&auml;nger mit dem Amiga besch&auml;ftigt, wird fr&uuml;her oder
sp&auml;ter mal auf ein <B>&quot;Modul&quot;</B> treffen. Diese Module sind eine eigene
Art von Musikformaten, bei denen ein Gemisch von digitalisiertem und
computergeneriertem Sound verwendet wird.</P>

<P>Die Anzahl der Programme zum Erstellen dieser Module sind zahlreich und
ebenso zahlreich sind die verschiedenen Unterarten der Module. Daneben
gibt es noch viele andere Soundformate. Um mit dieser Vielzahl fertig
zu werden, reicht ein einfacher Player meist nicht mehr aus, da sich
doch recht schnell eine gute Musik finden l&auml;&szlig;t, die der Player nicht
unterst&uuml;tzt.</P>

<P>Eagleplayer versucht nun dieser Vielzahl Herr zu werden. Damit das
Programm aufgrund der gro&szlig;en Zahl von unterst&uuml;tzten Formaten nicht einen
immensen Speicherverbrauch hat, ist es modular aufgebaut, d.h. es sind
nur wenige Playerroutinen eingebaut, namentlich Sound/Noise/Protracker,
Startrekker(AM) &amp; AudioSculpture(AM) und weitere ProTracker-Packer.</P>

<P>Um nun ein anderes Format abzuspielen, wird dazu ein spezieller
externer Player hinzugeladen. Der passende Player wird &uuml;ber die Engine
&quot;Playerloader&quot; automatisch bestimmt und mu&szlig; nicht mehr, wie in fr&uuml;heren
Versionen &uuml;ber eine Playerbatch-Datei definiert werden. Falls dann
jedoch kein Player gefunden wird, greift Eagleplayer auch auf das
Datatype-System zur&uuml;ck. Dadurch k&ouml;nnen dann z.B. auch WAV-Files
abgespielt werden, unter der Bedingung, da&szlig; der entsprechende Datatype
auch installiert ist. Die Anzahl der externen Player betr&auml;gt weit &uuml;ber
einhundert.</P>

<P>Der Eagleplayer hat jedoch nicht nur eine gute Soundformat-Unterst&uuml;tzung
zu bieten, sondern kommt noch mit diversen sogenannten <B>Engines</B>. Diese
Engines sind externe Zusatzprogramme, die &uuml;ber eine API mit dem
Eagleplayer kommunizieren. Die Verwendungszwecke der Engines sind
vielseitig, angefangen von einfacheren, die Informationen &uuml;ber das
gerade geladenene Modul anzeigen, bis zu einem FFT-Analyser
(FastFourier-Transformation), der das Spektrum des Frequenzganges
von Audiosignalen anzeigt.</P>

<P>Solche Engines sind auch von anderen Programmen her bekannt (Delitracker
z.B.), aber laut Anleitung war der Eagleplayer1.0 der erste, der dieses
Prinzip verwendete.</P>

<P>Neben den meisten Engines, die praktisch nur was f&uuml;r`s Auge sind, wurden
auch einige sehr praktische Funktionen dar&uuml;ber implementiert. Zum Beispiel
ist <B>&quot;Pysion&quot;</B> eine Listenverwaltung, die sogar die Listen anderer Programme
laden kann, jedoch leider nicht v&ouml;llig fertig ist.</P>

<P>Oder <B>&quot;Extractor&quot;</B>, der Archive wie Unterverzeichnisse behandelt. Damit
kann z.B. ein LhA-Archiv angew&auml;hlt werden und der Inhalt wird wie ein
Verzeichnis gescannt und angezeigt.</P>

<P>Eine weitere Engine ist der <B>&quot;Eagleripper&quot;</B>, mit dem man Dateien nach
Musiken durchsuchen kann, um z.B. auch Module aus Spielen oder Demos
abspielen zu k&ouml;nnen. Er wird automatisch gestartet, falls kein passender
Player gefunden wird und arbeitet auch mit dem Extractor zusammen.</P>

<P>Insbesondere f&uuml;r diese gerippten Module bietet Eagleplayer auch eine
Speicherfunktion an, mit der das gerade geladene Modul auch gespeichert
werden kann. Beim Speichern unterst&uuml;tzt Eagleplayer auch wieder diverse
Libraries zum Komprimieren und bietet auch ein eigenes
Komprimierungsverfahren an.</P>

<P>Jedoch speichert Eagleplayer nicht nur ganze Musikst&uuml;cke ab, es lassen
sich auch einzelne Instrumente aus dem Modul heraus abspeichern, wobei
man sich zwichen AIFF, IFF, RAW, WAVE-Format (in verschiedenen
Ausf&uuml;hrungen) entscheiden mu&szlig;. :)</P>

<P>Um das Soundabspielen noch komfortabler zu gestalten, l&auml;&szlig;t sich
Eagleplayer auch in vielen Punkten <B>konfigurieren</B>. Selbst das GUI ist als
Engine implementiert und es sind sicherlich noch ein paar interessante
Variationen erwarten. Der aktuellen Beta-Version für registrierte User liegt
bereits eine weitere GUI-Engine &quot;EMPYGUI&quot; bei.
Die GUI-Einstellungen reichen von der Auswahl des
verwendeten FileRequesters (ASL, Req oder Reqtools) &uuml;ber die Einstellung,
ob beim Ikonifizieren ein AppIcon oder AppMen&uuml; erstellt werden soll, bis
hin zur Auswahl des Men&uuml;fonts, Modulfonts und Rollfonts.</P>

<P>Die weitere Konfiguration erstreckt sich &uuml;ber Einstellungen der
Playerroutinen (z.B. ob das Timing per VBlank, CIA-Timer oder
Timer.device abgewickelt werden soll oder wie auf das Warten auf die
Abspielbereitschaft des Paula-Chips reagiert werden soll) und das
generelle Verhalten des Eagleplayers. Z.B. k&ouml;nnen die Soundfiles der
Reihe nach abgespielt werden oder es wird zuf&auml;llig eins herausgepickt
bzw. kann man die Musik ein-bzw. ausfaden lassen etc.</P>

<P>Bei eingeschalteter Lade-Directory-Funktion wird beim Laden eines Files
automatisch das ganze Verzeichnis gescannt und die File werden dynamisch
als Men&uuml;punkt dem Eagleplayer-Men&uuml; hinzugef&uuml;gt. Befinden sich nicht alle
Files im selben Verzeichnis, kann mit Hilfe von Pysion eine Liste
zusammengestellt werden, so da&szlig; alle &uuml;ber die Festplatte verteilten
Module zusammengefa&szlig;t werden k&ouml;nnen.</P>

<P>Diese Liste wird dann von Eagleplayer wie beim Verzeichnis-Scannen dem
Men&uuml; hinzugef&uuml;gt und je nach Einstellung dann der Reihe nach oder per
Zufall abgespielt (aber es l&auml;&szlig;t sich nat&uuml;rlich auch nur ein File im
Loop abspielen).</P>

<B>RTFM!</B>

<P>Die ber&uuml;hmt-ber&uuml;chtigen Anleitungen sind ein Kapitel f&uuml;r sich. ;-)</P>

<P>Die Anleitung des Eagleplayers ist mit satten 472KB recht umfangreich und
sollte eigentlich keine gro&szlig;e Frage offen lassen. </P>

<P>Neben einer ausf&uuml;hrlichen Erkl&auml;rung &uuml;ber die Bedienung, Installation und
das Starten des Eagleplayers, sind noch Kapitel &uuml;ber seine Eigenschaften,
den umfangreichen ARexx-Port, die einzelnen Engines und Player enthalten.
Ein Abschnitt &uuml;ber m&ouml;gliche Probleme und einer mit Tips&amp;Tricks
vervollst&auml;ndigen das Gesamtbild.</P>

<P>Zum kompletten Lesen wird man als normaler User vermutlich nie kommen.
Wenn jedoch mal etwas nicht so l&auml;uft, wie vorgesehen, sollte man sich
aber auf jeden Fall die Ruhe nehmen und in der Anleitung nachlesen
(insbesondere bevor man andere Quellen zu Rate zieht).</P>

<P>Eagleplayer hat auch eine gute Online-Unterst&uuml;tzung. Sobald mit der
Help-Taste die Hilfe-Funktion aktiviert wurde, bringt ein Klick auf
ein Gadget oder Men&uuml; die ensprechende Seite der Anleitung zu Tage.
Insbesondere wurde dabei auch darauf geachtet, da&szlig; beim Einschalten
der Hilfe-Funktion auch die gerade geghosteten Buttons aktivierbar
werden, um auch f&uuml;r sie die Hilfe aufrufen zu k&ouml;nnen.</P>

<B>Bugs:</B>

<P>Aufgrund der Vielzahl von Playern ist das ausgiebige Testen sowohl durch
Zeitmangel, als auch Mangel an entsprechenden Musikfiles nur eingeschr&auml;nkt
m&ouml;glich gewesen. :)</P>

<P>W&auml;hrend der Benutzung ist der Eagleplayer bei mir eigentlich nicht
abgest&uuml;rzt. Ansonsten ist mir nur ein kleiner Fehler im Catalog-File
aufgefallen, der jedoch nicht gro&szlig;artig ins Gewicht f&auml;llt und auch
leicht zu beheben sein sollte.</P>

<P>Leider kann Eagleplayer bisher auch keine eigenen Screen &ouml;ffnen und ist
dabei auf fremde Public-Screens angewiesen. Mit Hilfe von MUI`s PSI l&auml;&szlig;t
sich aber z.B. ein Screen f&uuml;r EP &ouml;ffnen und beim Start oder durch die
Publicscreenselector-Engine kann dann dieser Screen ausgew&auml;hlt werden.</P>

<B>Fazit:</B>

<P>Die Shareware-Geb&uuml;hr von nur 20,- DM ist bei dem Umfang des Eagleplayers
sicherlich gerechtfertigt. Die Einschr&auml;nkungen der Demo sind ein
Nervrequester, das Fehlen einiger Konfigurationsabspeicherungen und die
Sperrung der Modul-Speicherfunktion, so da&szlig; er in Ruhe angetestet werden
kann. Ich kann den Eagleplayer nur empfehlen, da er umfangreich, aber
trotzdem leicht zu bedienen ist.</P>


<B>Features:</B> (eine kleine &Uuml;bersicht)
<UL>
<LI>Unterst&uuml;tzung von weit mehr als 100 verschiedenen Formaten</LI>
<LI>optional zuladbare Engines</LI>
<LI>hardwareunabh&auml;ngiges Abspielsystem durch die sog. Amplifier</LI>
<LI>konfigurierbares GUI (Font-, FileRequester)</LI>
<LI>Unterst&uuml;tzung vieler Packer (XPK, div. Archiver, PowerPacker, CrunchMania u.v.m.)</LI>
<LI>CyberGraphX-Unterst&uuml;tzung des FFT-Analysers</LI>
<LI>Online-Hilfe</LI>
<LI>umfangreicher ARexx-Port</LI>
</UL>

<B>Voraussetzungen:</B>

<P>Amiga mit 68020, OS2.04, 0.5 MB Chip-RAM, 1MB Fast-RAM, Festplatte,
am Amiga angeschlossene Lautsprecher</P>

<B>empfohlene Konfiguration:</B>

<P>68030+, OS3.0/3.1, 4MB oder mehr Fast-RAM, HiFi Anlage</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Eagleplayer</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="mailto:jan.blumenthal@stud.uni-rostock.de">Jan Blumenthal</A> &amp; <A HREF="mailto:henryk.richter@stud.uni-rostock.de">Henryk Richter</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Multiformat-Sound-Player</TD>
    <TD><B>Version:</B></TD>
    <TD>2.00</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>20 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.informatik.uni-rostock.de/~hendryk/eagleplayer2.html">Homepage</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
</TABLE></P><BR>
<P><HR>
<TABLE ALIGN=CENTER WIDTH="100%">
<TR>
    <TD ALIGN=LEFT"><A HREF="9712cd.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712uae.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
</TABLE></P>
</BODY>
</HTML>
