<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Pinball BrainDamage</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Pinball BrainDamage</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></CENTER>

<P><B>Pinball BrainDamage</B> kommt in einer ansprechenden Packung inklusive
Anleitung, in der sich allerdings mein Exemplar der CD ohne H&uuml;lle verbarg.</P>

<P>Die CD-Version enth&auml;lt neben dem Spiel, welches etwa 15 MByte ben&ouml;tigt
und in mehreren Backup-Verzeichnissen &quot;gepuffert&quot; ist, einen Tisch-Editor,
mit dem man eigene `Tables` erstellen k&ouml;nnen soll.</P>

<P><B>Voraussetzung</B> zum Spielen ist ein AGA-Amiga ohne (!) 060er-Prozessor,
denn damit gibt es Probleme. F&uuml;r die CD-Version nat&uuml;rlich noch ein
CD-Laufwerk ;)</P>

<P>Der Start von der CD funktionierte bei mir nicht, da dem Spiel zuwenig
ChipRam zur Verf&uuml;gung standen. Das Icon <B>Reboot-Start</B>, das eine Rad-Disk
anlegt, lie&szlig; das Spiel ebenfalls nicht ordnungsgem&auml;&szlig; starten und brach
im Bootvorgang mit Fehlermeldungen ab.</P>

<P>M&ouml;glicherweise gibt es ja damit Probleme, da&szlig; das CD-Filesystem nur nach
einem richtigen Workbench-Hochbooten zur Verf&uuml;gung steht. Aber nach dem
Kopieren des Spiels auf Festplatte &auml;nderte sich daran nichts.</P>

<P>Nach dem Booten ohne Startup-Sequence und dem Eintippen von &quot;execute
StartGame&quot; (in der Anleitung steht: ...&quot;tippen Sie GameStart ein.&quot;)
ging es dann endlich los.</P>

<P>Im Vorspann und dem Hauptmen&uuml; fallen schonmal unn&ouml;tig viele flimmernde
Interlaced-Grafiken auf. Bei <B>Optionen</B> kann man die Lautst&auml;rke der Musik
und der Soundeffekte ausw&auml;hlen, au&szlig;erdem, ob bei Multiball-Modi generell
in den SuperHires-Modus geschaltet werden soll, womit im &uuml;brigen auch
speziell geworben wird.</P>

<P><B>Zitat</B>: &quot;Super-Hi-Res (1280x512) im Multiballmodus, die h&ouml;chste jemals
        verwendete Aufl&ouml;sung in einem Amiga-Flipper&quot;</P>

<P>Soweit ich wei&szlig;, ist diese Aufl&ouml;sung bisher noch &uuml;berhaupt nicht in
irgendeinem Amigaspiel eingesetzt worden. Gl&uuml;cklicherweise, denn dieses
sehr exotische Grafikformat ist z.B. f&uuml;r viele ScanDoubler ein rotes Tuch,
da es genau au&szlig;erhalb des Frequenzbereiches angesiedelt ist, den sie auf
das VGA-Signal trimmen. Wenn dann also umgeschaltet werden w&uuml;rde, w&auml;re
bei diesen Usern nichts zu sehen.</P>

<P>Bei <B>TableSlope</B> kann man jetzt noch die Neigung des Tisches (ohne
Auswirkungen auf die Grafik) bzw. den Schwierigkeitsgrad einstellen.
Dabei wird dann die Ballgeschwindigkeit, sowie die Kraft der Flipperarme
ver&auml;ndert.</P>

<P>An Tischen selbst stehen nur zwei zur Auswahl. Zum ersten <B>Hypervolution</B>
und zum zweiten <B>Magnetic Whirlpool</B>.</P>

<P>Also wird in diesem Punkt schonmal eindeutig weniger geboten, als bei
den etablierten Flipperspielen auf dem Amiga, angefangen bei <B>Pinball</B>
<B>Dreams</B> bis zu dem State-Of-The-Art <B>Slamtilt</B>, die drei enthielten.</P>

<P>Wenn man <B>Hypervolution</B> anspielt, f&auml;llt einem sogleich auf, da&szlig; sich
das Ballgef&uuml;hl im Gegensatz zu den anderen Flippern sehr ver&auml;ndert
hat. Es ist anders, aber man kann sich darauf einstellen.</P>

<P>Gestartet wird das Spiel mit der Enter-Taste des Ziffernblocks, der
erste Ball mit der Returntaste und gesteuert schlie&szlig;lich mit den
Shifttasten. Auch den Tisch &quot;anwackeln&quot; kann man wieder bis das
&quot;Tilt&quot; kommt z.B. mit der Space-Taste.</P>

<P>Multiplayer-Modi (also rundenbasiert, bis ein Ball ausgeht) stehen
nicht zur Verf&uuml;gung.</P>

<P>Bei <B>Hypervolution</B> ist das Table-Design maximal durchschnittlich, das
gilt auch f&uuml;r die meisten Effekte im &quot;Leuchtdisplay&quot; oben. Es geht
&uuml;brigens, grob gesagt, um Autos.</P>

<P>Bei der Grafik fragt man sich eigentlich, wo die 256 Farben denn alle
abgeblieben sind. Sie sieht doch eher etwas trist aus und kann im
Vergleich mit Slamtilt, aber auch seinen Vorg&auml;ngern nicht bestehen.</P>

<P>Wirklich nervt&ouml;tend ist die Musik. Man kann sie zwar herunterregeln
oder ganz abschalten, aber eigentlich stellt sie normalerweise doch
einen wichtigen motivierenden Faktor beim Flippern dar.</P>

<P>Also besser den Tisch wechseln und hin&uuml;ber zum &quot;<B>Magnetic Whirlpool</B>&quot;.</P>

<P>Das Design hier ist eine Mischung aus Horror und Science Fiction und
schonmal besser gelungen als bei Hypervolution. Das gilt auch f&uuml;r das
Tischdesign selbst, also die Anordnung der Rampen und Objekte.</P>

<P>Zu dem angeblichen Pseudo-3D-Design kann ich tats&auml;chlich nur best&auml;tigen,
da&szlig; das &quot;Pseudo&quot; berechtigt ist. Lediglich einige Elemente, wie z.B.
Rampen sind etwas dreidimensionaler gestaltet worden, der Tisch selbst
ist aber so platt, wie bei allen anderen Flippern auch.</P>

<P>Gelungen bei <B>Magnetic Whirlpool</B> sind die meisten &quot;Leuchtdisplay&quot;-Effekte,
sowie Musik und Sound.</P>

<P>Hier kann man schonmal eine Partie mit Flippern verbringen.</P>

<B>Fazit:</B>

<P>Als Vollpreisprodukt f&uuml;r ca. 70 DM erscheint mir PinballBD trotz der
Spiele-Ebbe der letzten Zeit auf dem Amigamarkt doch etwas zu mager.
Nur zwei mitgelieferte Flipper, davon einer unterdurchschnittlich, sind
daf&uuml;r einfach zu wenig. Im direkten Vergleich mit den anderen ber&uuml;hmten
Amiga-Flippern macht PinballBD qualitativ auch einen eher blassen Eindruck.</P>

<P>Lichtblick w&auml;re der Editor. Er lie&szlig; sich bei mir allerdings nicht zum
Start bewegen, da ihm von der Workbench aus auch knapp unter 2 MB
ChipRam zuwenig war und von der Shell nach dem Booten ohne Startup
nur eine Fehlermeldung als Antwort kam.</P>

<P>Wie so oft kann ich wieder nur raten: Wer die M&ouml;glichkeit hat, sollte
vor einem Kauf probespielen.</P>


<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TH>Produkt:</TH>
    <TD>Pinball BrainDamage</TD>
    <TH>Hersteller:</TH>
    <TD>Mind`s Eye</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Pinball-Spiel</TD>
    <TD><B>Version:</B></TD>
    <TD> - </TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>69.95 DM (CD oder Disk)</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>APC&amp;TPC</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>3</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>4</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER"><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>3</TH></TR>
<TR><TD COLSPAN=4 ALIGN="CENTER">Vertrieb: APC&amp;TPC, Dorfstra&szlig;e 17, 83236 &Uuml;bersee</TD></TR>
</TABLE></P><BR>

<P><HR>
<TABLE ALIGN=CENTER WIDTH="100%">
<TR>
    <TD ALIGN=LEFT"><A HREF="9712fh.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9712isdn.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
</TABLE></P>
</BODY>
</HTML>
