<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - UAE 0.6.9</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>UAE 0.6.9 f&uuml;r Win32</U></H1><DIV ALIGN=CENTER>von<BR><A HREF="G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Dies ist ein kleiner &Uuml;berblick, wie weit die F&auml;higkeiten des
Amiga-Emulators UAE, speziell dessen DirectX-unterst&uuml;tzende
Version f&uuml;r Windows 95 sowie NT, inzwischen gediehen sind.</P>

<P><B>Was ist, was hei&szlig;t und wie entwickelte sich UAE?</B></P>

<P>Den meisten d&uuml;rfte UAE ein Begriff sein.</P>

<P>Es handelt sich um einen Emulator, der die Hardware des Amigas vollst&auml;ndig
nachzubilden versucht. Begonnen wurde er von Bernd Schmitt 1995 f&uuml;r Unix
(damals bedeutete UAE noch Unusable, also unbenutzbarer Amiga-Emulator,
da die ersten Versionen noch nicht viel mehr als die Kickstart-Hand
darstellen konnten) und inzwischen existieren eine Vielzahl von
Portierungen auf die unterschiedlichsten Unix-Dialekte, sowie auf
andere Systeme wie Apple, DOS, RiscPC, BeBox, den Amiga selbst (vor
einer PPC-Portierung aber ziemlich sinnentleert) und nicht zuletzt
die Windows-Portierung von Mathias Ortmann.</P>

<P>Jetzt steht UAE f&uuml;r <B>Unix Amiga Emulator</B>, einige Autoren anderer
Portierungen propagieren allerdings die Bezeichnung Ubiquitous Amiga
Emulator, was soviel bedeutet, wie der allgegenw&auml;rtige Amiga-Emulator,
aber ziemlich ungelenk klingt.</P>

<B>Was braucht UAE?</B>

<P>Dieser Port ben&ouml;tigt ben&ouml;tigt einen m&ouml;glichst schnellen PC, auf dem
Windows 95 oder NT, sowie eine Version des Grafikausgabenbeschleunigers
DirectX installiert sein mu&szlig;. Durch DirectX wird die Grafik beschleunigt.</P>

<P>Unter einem Pentium 90 (ebenso wie auf 486ern) wird UAE zwar auch laufen,
doch darf man nicht viel von der Geschwindigkeit erwarten.</P>

<P>Eine schnelle Grafikkarte ist ebenfalls ein Faktor der Geschwindigkeit.
Der PC sollte auch gut mit RAM ausgestattet sein, mindestens 16 MB sind
zu empfehlen.</P>

<P>Wichtig f&uuml;r eine vern&uuml;nftige Nutzung ist auch ein Kickstart-File mit dem
Amiga-Betriebssystem. Laut den offiziellen Lizenzbedingungen d&uuml;rfen nur
Amiga-Besitzer ihr KickROM auf ihren PC &uuml;bertragen und dort nutzen.</P>

<P>Wer auf seinem PC UAE mit KickROM benutzt, ohne einen eigenen Amiga zu
besitzen, handelt also faktisch illegal. Ich glaube aber nicht, da&szlig; sich
der Emulator eines solch gro&szlig;en Erfolges erfreuen w&uuml;rde, wenn jeder seiner
User einen Amiga danebenstehen h&auml;tte. Es ist nunmal die Eigenart eines
Emulators aus z.B. nostalgischen Gr&uuml;nden nachzubilden, was man einst
hatte oder die Neugier auf ein unbekanntes System zu befriedigen.</P>

<P>Die einzige legale M&ouml;glichkeit soll in Zukunft CLOANTO`s  kommerzielles
AmigaForever-Paket sein, das UAE, sowie unterschiedlichen Kickstart-ROMs
enth&auml;lt.</P>

<P>Ich habe UAE mit einem Pentium 166 und einer durchschnittlichen
Standard-Grafikkarte unter einem mit 32 MB RAM ausgestatteten
Windows 95 getestet.</P>

<B>Was kann UAE?</B>

<P>Die erste Aufgabenstellung f&uuml;r UAE war nat&uuml;rlich einen Amiga 500
vollst&auml;ndig zu emulieren. Das kann er auch in erstaunlichem Ma&szlig;e.</P>

<P>Fast alle Features der Customchips sind eingebaut und die meisten
Spiele und Demos laufen.</P>

<P>Die Geschwindigkeit ist stark von dem verwendeten PC und den
Einstellungen abh&auml;ngig, aber ich w&uuml;rde sagen, da&szlig; erst ab einem P 166
teilweise A 500-Geschwindigkeit erreicht wird.</P>

<P>UAE hat jetzt auch Soundunterst&uuml;tzung. Die Berechnung der vier echten
8 Bit-Digitalkan&auml;le und ihr Mischen in einen Kanal braucht aber sehr
viel Rechenzeit, was bei einer von mir getesten Demo z.B. zu einer
sehr holpernden, versetzten und qualitativ unterdurchschnittlichen
Musik f&uuml;hrte.</P>

<P>Erst wenn der Bildschirm abblendete wurde die Musik pl&ouml;tzlich besser,
da ihr nun ein Gro&szlig;teil der CPU-Power zur Verf&uuml;gung stand.</P>

<P>Im &uuml;brigen habe ich diese Demo (von Analog), selbst unter Nutzung aller
Degrade-M&ouml;glichkeiten oder Kick 1.3 nie v&ouml;llig zur Zusammenarbeit auf
meinem Amiga 4000-030 &uuml;berreden k&ouml;nnen. Mit UAE lief sie anstandslos
bis zum Ende durch - unter Kick 3.0.</P>

<P>Es sind die OCS-Merkmale komplett nachgebildet und der Enhanced-Chipsatz
teilweise. Nachdem vorher lediglich die 68000er CPU emuliert wurde,
handelt es sich nun um einen Motorolla 68020 inklusive FPU. Das ist
wichtig f&uuml;r modernere Software! Eines der Ziele f&uuml;r die Zukunft ist AGA.</P>

<P>Bis zu 2MB ChipRAM und bis zu 8 MB FastRAM k&ouml;nnen UAE vorgegaukelt werden.</P>

<P>UAE kann im Moment noch nicht alle Schnittstellen korrekt ansprechen.</P>

<P>Da PCs aus prinzipiellen Gr&uuml;nden (Diskcontroller) keine Amiga-Disketten
lesen k&ouml;nnen, wurde ein spezielles Diskettenimageformat (ADF) eingef&uuml;hrt,
&auml;hnlich DMS, nur ungepackt, auf das ich unten n&auml;her eingehen werde.</P>

<P>Diese Images werden mit bis zu vier virtuellen Laufwerken von der
PC-Festplatte aus angesprochen. Der Clou ist aber, da&szlig; UAE
PC-Verzeichnisse als Amiga-Partitionen verwenden kann. Seit Windows 95
ist ja die alte DOS-Dateil&auml;ngenbeschr&auml;nkung aufgehoben und so k&ouml;nnen
die Dateien von Win95 und der Amiga-Seite aus unter derselben
Bezeichnung angesprochen werden.</P>

<P>Ein PC-Joystick, sowie die PC-Maus werden als Amiga-Ger&auml;te unterst&uuml;tzt.</P>

<B>Wie funktioniert die Installation?</B>

<P>Eigentlich ohne gro&szlig;e Probleme. Wichtig ist nat&uuml;rlich das vorherige
Bereitstellen des Kickstarts, sowie der Workbench-Installationsdisketten.</P>

<P>Das wird mit Hilfe zweier Hilfsprogramme aus dem UAE-Paket gemacht und
zwar liest man mit <B>Transrom</B> das Kickstart in ein File aus und mit
<B>Transdisk</B> erzeugt man die besagten Diskimages mit etwa 900 KB Gr&ouml;&szlig;e.</P>

<P>Ich habe mich damit beholfen einen Zehnerpack HD-Disketten zum
Datentransfer Amiga-PC zu verwenden, teilweise mit den Diskimages,
teilweise mit Lha-Archiven, die ich auf der PC-Seite in die
Amiga-Partitionsverzeichnisse packte, um sie dann, mangels Lha f&uuml;r
den PC (dort ja kaum verbreitet) unter dem emulierten Amiga zu entpacken.
(Man mu&szlig; nur darauf achten, da&szlig; man dann dort Lha zur Verf&uuml;gung hat :)</P>

<P>Wichtig aber, um wieder auf die eigentliche Installation zur&uuml;ckzukommen,
ist erst einmal das Entpacken von UAE in ein geeignetes Verzeichnis und
das Festlegen oder gegebenenfalls Anlegen spezieller Verzeichnisse, die
man als &quot;Amiga-Partitionen&quot; vorsieht.</P>

<P>Dann mu&szlig; sich das Kickstart-Rom im UAE-Verzeichnis befinden, sowie die
Datei &quot;uae.rc&quot; erstellt und editiert werden. Diese Datei enth&auml;lt die
Optionen von UAE.</P>

<P>Mit Hilfe des Readme`s sollte sie problemlos zu erstellen sein. Bei
mir werden lediglich die Chip- und Fastram-Gr&ouml;&szlig;e festgelegt, dann die
PC-Verzeichnisse f&uuml;r die Amiga-Partitionen definiert und die Soundqualit&auml;t,
die zu verwendende PC-Aufl&ouml;sung und eine Spezial-Option.</P>

<P>Diese lautet &quot;-C 224&quot; und damnit soll ein Copper-Bug ausgeglichen werden.</P>

<B>Wie l&auml;uft UAE?</B>

<P>Denn obwohl alles recht gut l&auml;uft, ist bei mir unten ein Rand des
WB-Schirms nicht nutzbar. Ein etwa ein Zentimeter hoher Rand war
anfangs grau und der Mauszeiger dort unsichtbar.</P>

<P>Mit der eben genannten Option verschwand der graue Rand und das WB-Pattern
reicht bis zum unteren Bildschirmrand. Ein paar Pixel sind leider immer
noch nicht sichtbar, der Mauszeiger z.B. kann noch etwas &uuml;ber den
Monitorrand hinaus, wo man ihn dann nat&uuml;rlich nicht sehen kann. ;)</P>

<P>Aber wie gesagt, wurde der Bereich kleiner und ansonsten wirkte sich das
im Verh&auml;ltnis nicht weiter auf die Arbeit aus. M&ouml;glicherweise liegt das
auch an der verwendeten Grafikkarte.</P>

<P>Nachdem UAE das allererste Mal gestartet wurde, meldete sich tats&auml;chlich
gleich das animierte Diskettenlaufwerk des OS 3.0.</P>

<P>Beim n&auml;chsten Versuch, bei dem die Diskimages platziert waren, wurde
gebootet und der Installationsproze&szlig; der WB 3.0 lief wie gewohnt ab.</P>

<P>Nat&uuml;rlich mu&szlig;te ich gleich darauf auch MagicWB installieren, denn die
Originalicons ertr&auml;gt man nicht lange ohne b&ouml;se Nebenwirkungen. ;)</P>

<P>Auch das lief problemlos.</P>

<P>Dann erfolgte das Aufpeppeln der Workbench, um sie zu einer guten
Arbeitsoberfl&auml;che zu machen. MultiCX, FKey, ReKeyIt, CycleToMenu und
selbst MagicMenu laufen problemlos.</P>

<P>Das gleiche gilt f&uuml;r DOpus 4, MUI und GoldEd. Mit letzterem verfasse
ich &uuml;brigens gerade unter UAE diesen Text.</P>

<P>An Aufl&ouml;sungen, und das ist ein sehr wichtiger Punkt, stehen nur die
gew&ouml;hnlichen Pal-Modi, also LoRes und HiRes zur Verf&uuml;gung, jeweils mit
den Interlaced-Modi. Jetzt bitte nicht gleich die H&auml;nde vors Gesicht
schlagen, denn Interlaced wird hier automatisch entflimmert, so das mit
Pal-HiRes/Interlaced immerhin 640x512 Pixel zur Verf&uuml;gung stehen.</P>

<P>Grafikkarten-Emulatoren-Software, wie CyberGrafX und Picasso 96 werden
im Moment noch nicht unterst&uuml;tzt. Auch wenn man &uuml;brigens diverse
Monitortreiber von Storage nach Devs verschiebt, stehen immer nur
dieselben angesprochenen Aufl&ouml;sungen zur Verf&uuml;gung.</P>

<P>Ein CD-Laufwerk wird sehr einfach eingebunden, indem man es im
UAE-Konfigfile wie eine Partition definiert.</P>

<B>Allgemeiner Eindruck</B>

<P>Insgesamt l&auml;uft vieles nat&uuml;rlich tr&auml;ge, man ist halt die WB nicht auf
einem A500 gewohnt. Probleme in Kompatibilit&auml;tshinsicht gibt es aber
kaum, zumindest von der Seite der Anwenderprogramme aus. Unter diesem
Gesichtspunkt habe ich mir UAE haupts&auml;chlich angeschaut. Auch Programme
die einen 020er Prozessor voraussetzen funktionieren anstandslos, wie
ja auch nicht zuletzt mein KickROM-File, welches mit fr&uuml;heren
UAE-Versionen aus diesem Grund nicht lief.</P>

<P>Das Filesystem, welches den gro&szlig;en Vorteil der Transparenz von der
PC-Seite aus bietet, ist nat&uuml;rlich auch etwas langsamer als gewohnt
und unterst&uuml;tzt so den Eindruck.</P>

<P>Probleme gibt es ein wenig mit dem Sound. Wie erw&auml;hnt kann man nicht
allzuviel erwarten. Selbst mit dem Fehler-Beep gab es bei mir schon
Schwierigkeiten, da er selbst im Prefs-Einsteller jedesmal beim Testen
anders klang bzw. r&ouml;chelte , obwohl ich die Frequenz gar nicht
ver&auml;ndert hatte.</P>

<P>Erstmalig erhalten die uns&auml;glichen Windows95-Tasten auf neueren
PC-Tastaturen eine sinnvolle Funktion: Sie gelten unter UAE als
Amiga-Tasten.</P>

<P>Wenn man auf den &quot;Windows95-Schirm&quot; schalten will und mit Amiga-M ein
paar Screens durchw&auml;hlt, stutzt man Anfangs des &ouml;fteren und merkt, da&szlig;
das einfach nicht geht. :) Da mu&szlig; dann doch wieder Alt-Tab herhalten.</P>

<P>Beim Booten des Amiga erscheint beim Dr&uuml;cken beider Maustasten auch
tats&auml;chlich das Bootmen&uuml;, wie sollte es auch anders sein.</P>

<B>Fazit:</B>

<P>UAE ist durchaus kein Spielzeug (mehr) und zu mehr f&auml;hig, als nur alte
Spiele oder Demos f&uuml;r Nostalgiker laufen zu lassen. Trotzdem braucht man
noch lange keine Angst um den Amiga haben.</P>

<P>&quot;Native&quot; hat auch auf lange Sicht die Nase vorn, denn bei der t&auml;glichen
Arbeit ist die Geschwindigkeit des Arbeitens auf der Benutzeroberfl&auml;che
entscheidend und UAE fehlen noch wichtige Punkte, wie eine perfekte
Schnittstellenansteuerung, Grafikkarten-SW-Unterst&uuml;tzung oder AGA.
Daran wird aber sicher auch in Zukunft kontinuierlich gearbeitet...</P>

<P>Wer einen schnellen Amiga (ab 68020) neben seinem PC stehen haben
sollte, der wird ihn also wegen UAE nicht stiefm&uuml;tterlich behandeln. </P>

<P>UAE Win32-Homepage: <A HREF="http://www.informatik.tu-muenchen.de/~Ortmann/uae/">http://www.informatik.tu-muenchen.de/~Ortmann/uae/</A></P>

<P><HR>
<TABLE ALIGN=CENTER WIDTH="100%">
<TR>
    <TD ALIGN=LEFT"><A HREF="9712ep2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712pos.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
</TABLE></P>
</BODY>
</HTML>
