<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Tips &amp; Tricks</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">FLASHBACK</H1>

                  <H2 align="center">Code: Back</H2>

                  <H3>Jungle:</H3>

                  <P>Den Holocube aufnehmen, nach rechts durch die
                  T&uuml;r 1 gehen und die 10 Credits, sowie den
                  Stein einsacken. Der Ogre A2 kann auf zwei Arten
                  erledigt werden: entweder auf den Sensor
                  dr&uuml;cken und schnell schie&szlig;en, oder von
                  hinten anschleichen und umnieten. Ist er tot,
                  scnappt Euch die Batterie (pile) und begebt Euch
                  nach unten rechts, &uuml;ber den Fahrstuhl zum
                  Recharge. Hier Schild und Batterie aufladen und
                  anschlie&szlig;end zu Punkt C vorr&uuml;cken. Die
                  Batterie wird dort in die Konsole gesteckt,
                  woraufhin sich der t&ouml;dliche Abgrund vor Euch
                  schlie&szlig;t. Nehmt weiter links den Lift nach
                  oben, legt den Stein am Sensor (SI) ab, greift
                  Euch den zweiten Stein und sackt den Teleporter
                  (X) rechts auf dem Lift ein. Der Aufzug darunter
                  f&uuml;hrt zum ersten Savepunkt (SA). Nun in den
                  Schacht unter dem Lift rechts daneben klettern,
                  die beiden Ogres ganz unten killen und beim
                  Recharger Schild frisch aufladen. Weiter nach
                  rechts, mit dem Schalter das Kraftfeld
                  deaktivieren, den Stein aufheben, die 100
                  Credits, sowie die 500 Credits einheimsen.
                  Zur&uuml;ck an Punkt F angelangt, steckt Ihr den
                  Schl&uuml;ssel ins Schlo&szlig; und &ouml;ffnet
                  die T&uuml;r. Um auch die T&uuml;r bei G zu
                  entriegeln, m&uuml;&szlig;t Ihr zum Verletzten
                  links oben (V), der eine ID-Card gegen den
                  Teleporter tauscht. Diese Card steckt Ihr in den
                  Kartenleser bei G und k&ouml;nnt so passieren.
                  Etwas weiter rechts trefft Ihr auf einen alten
                  Mann, der Euch f&uuml;r 500 Credits einen
                  Antigrav-G&uuml;rtel verkauft. Mit dem
                  G&uuml;rtel k&ouml;nnt Ihr gefahrlos in den
                  Abgrund rechts springen.</P>

                  <H2 align="center">Code: LOUP</H2>

                  <H3>ASIA:</H3>

                  <P>Schild am Recharger aufladen, rechts mit dem
                  Lift nach oben d&uuml;sen, von dort aus weiter
                  hinaufklettern und nach links oben springen.
                  Sprecht mit Ian (J), nachdem Ihr die beiden Cops
                  in die H&ouml;lle geschickt habt. Setzt Euch dann
                  in den Sessel, seht Euch die Animation an und
                  redet erneut ein paar Takte mit Ian. Als
                  n&auml;chstes mu&szlig; die Sicherung (D) besorgt
                  werden, die man in der Konsole dar&uuml;ber (I1)
                  einsteckt. Bet&auml;tigt nun den Schalter, um den
                  Lift zu holen. Arbeitet Euch &uuml;ber den
                  zweiten Fahrstuhl nach links bis zu dem Typ am
                  Checkpoint (M) vor. Er h&auml;ndigt Euch eine
                  Karte aus. &Ouml;ffnet die T&uuml;r und schippert
                  mittels Aufzug zum Bahnhof. Steigt hier in die
                  n&auml;chstbeste Metro nach.</P>

                  <H3>Amerika:</H3>

                  <P>Plaudert in der Bar ganz oben mit dem
                  Barkeeper (B) und stattet Jack (H) einen kleinen
                  BEsuch ab. Mit den Infos der beiden in der Tasche
                  gehts zur&uuml;ck zum Bahnhof und weiter nach</P>

                  <H3>Afrika:</H3>

                  <P>Eilt zum Arbeitsamt (C), la&szlig;t Euch von
                  dem Kerl dort volltexten und begebt Euch
                  &uuml;ber den Aufzug zum Gouverneur. Haltet ihm
                  Eure ID-Card unter die Nase, dann wird er eine
                  Arbeitserlaubnis ausspucken. Die Metro bringt
                  Euch anschlie&szlig;end nach</P>

                  <H3>Europa:</H3>

                  <P>Unterhaltet Euch mit dem Mann bei der Work
                  Agency, ladet weiter links den Schutzschild auf,
                  speichert und bet&auml;tigt Eure erste Mission
                  mit der Arbeitserlaubnis.</P>

                  <H3>Mission 1:</H3>

                  <P>Tuckert nach ASIA, &uuml;bernehmt von der Frau
                  ganz rechts das Paket und schleppt es nach Afrika
                  zu dem komischen Kauz rechts oben (V). Mit den
                  100 Credits f&uuml;r diesen Botengang in der
                  Tasche gehts zur&uuml;ck zum Job Center (EUROPA).
                  Ladet den Schild auf, speichert ab und akzeptiert
                  Euren zweiten Auftrag.</P>

                  <H3>Mission 2:</H3>

                  <P>F&uuml;hrt Euren Professor auf Abwegen nach
                  Afrika zur Restriced Area 2. Veranla&szlig;t den
                  hier wartenden Mann (S) dazu, Euch zu folgen.
                  Achet darauf, da&szlig; Euch der V.I.P. auf
                  Schritt und Tritt bis zur verschlossenen T&uuml;r
                  folgen kann. Klettert dort alleine zum Schalter
                  S1 hinauf, bet&auml;tigt ihn, hangelt Euch
                  &uuml;ber die Mine bis zum Lift hinunter und holt
                  den V.I.P. nach. Mit dem Fahrstuhl erreicht Ihr
                  das Stockwerk darunter, wo es zuerst den
                  Schl&uuml;ssel zu besorgen gilt. Der Key wird
                  weiter links in das passende Schlo&szlig;
                  gesteckt, bevor man im Raum links davon einen
                  zweiten T&uuml;r&ouml;ffner einsacken kann. Um
                  den Lift nach unten einzuschalten,
                  m&uuml;&szlig;t Ihr den gefundenen Schl&uuml;ssel
                  in die konsole rechts daneben stecken. Mit dem
                  V.I.P. am Exit angekommen, werdet Ihr mit 300
                  Credits belohnt. Nun aber wieder zur&uuml;ck zum
                  Job Center, Schild aufladen, saven und
                  n&auml;chste Aufgabe erf&uuml;llen.</P>

                  <H3>Mission 3:</H3>

                  <P>Mittels U-Bahn gehts nach Amerika. Hier
                  interessiert zun&auml;chst der Barmann.
                  Anschlie&szlig;end begeben wir uns zur Restricted
                  Area 01, labern mit dem Cop, eilen zur&uuml;ck
                  zur Bar und weiter ganz nach links. Nach einer
                  kleinen Auseinandersetztung mit einem Ogre
                  treffen wir auf einen Mann, der ebenfalls ein
                  paar Infos f&uuml;r uns hat. H&ouml;chste Zeit,
                  sich jetzt mal etwas intensiver um den Cop in
                  Area 01 zu k&uuml;mmern. Greift Euch nach
                  Spezialbehandlung Marke Mausetot seinen
                  Schl&uuml;ssel und hastet zu Punkz F zur&uuml;ck,
                  wo der Key die Fallt&uuml;r entriegelt. Steigt
                  hinab, speichert und tastet Euch nach rechts vor.
                  Killt die beiden Terminatoren und kassiert die
                  400 Credits Kopfgeld. Bereitet Euch nun mit der
                  schon gewohnten Prozedur auf die vorletzte
                  Mission vor.</P>

                  <H3>Mission 4:</H3>

                  <P>H&uuml;pft in den Teleporter-Ihr werdet Euch
                  ganz links oben im Computer-Level wieder
                  materialisieren. Jetzt hei&szlig;t es, so schnell
                  wie m&ouml;glich zum Terminal zu sprinten. Also
                  nach recchts zur Fallt&uuml;r; unten wieder nach
                  links und &uuml;ber die Fahrst&uuml;hle einen
                  Stock tiefer. Hier mu&szlig; der Lift, der zum
                  Terminal f&uuml;hrt, durch den Schalter S1
                  aktiviert werden, bevor Ihr am Terminal die Karte
                  hineinschieben k&ouml;nnt. Mit 500 Credits Lohn
                  in der Tasche, erwartet Euch der letzte
                  Auftrag.</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

