<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Tips &amp; Tricks</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">HEART OF CHINA</H1>

                  <H3>In Honkong :</H3>

                  <P>Jake Master (ab jetzt ganz cool "JM" genannt)
                  f&auml;hrt in die Stadt. Sein erster Weg
                  f&uuml;hrt in die Bar. Nach einem Gespr&auml;ch
                  mit dem Barkeeper Ho (1 1 1 1) bedr&auml;ngen ihn
                  zwei d&uuml;stere Gestalten (1 2). In einem
                  Gespr&auml;ch vermag er den Chinesen Chi zu
                  &uuml;berzeugen, ihn bei einem Rettungsversuch zu
                  begleiten (1 3 3 oder 3 3 2).</P>

                  <P>Chi hat Angst vor dem Fliegen. JM geht aus der
                  Bar und findet ein Faltblatt. Er bastelt daraus
                  eine Schwalbe, die er Chi vorf&uuml;hrt. Chi
                  schl&auml;gt vor, beim Apotheker Wu noch
                  Heilkr&auml;uter zu besorgen. Wu reagiert nicht,
                  als ihn JM anspricht. Chi kann den Apotheker
                  &uuml;berzeugen. Der Apotheker braucht
                  "M&ouml;ven-Guano". JM und Chi fahren zum Dock.
                  Chi gibt der M&ouml;we eine getrocknete Pflaume,
                  was deren Verdauung anregt. Das "Ergebnis" steckt
                  JM in die Tasche. Wieder beim Apotheker Wu. JM
                  spricht ihn an und f&uuml;llt den Guano in den
                  M&ouml;rser. JM erh&auml;lt daf&uuml;r die
                  Heilkr&auml;uter und als Dreingabe noch einen
                  gef&auml;lschten Pa&szlig; und eine Karte. JM und
                  Chi bedanken sich und statten vor der Reise Lomax
                  noch einen kurzen Besuch ab. Am Flughafen
                  beschlie&szlig;t JM, dem Kontrolleur lieber
                  keinen Pa&szlig; zu zeigen. Im Flugzeug nimmt JM
                  die Brechstange, das Seil und den Anker an
                  sich.</P>

                  <H3>In Cheng Du :</H3>

                  <P>Nach der Landung taucht ein Bauer auf, den Chi
                  anredet (3 2 3). Chi tauscht mit dem Bauern die
                  Kleidung. JM versucht mit dem Seil die Kuh zu
                  fangen. Nach mehreren vergeblichen Versuchen gibt
                  er das Seil an Chi weiter, der weniger Probleme
                  damit hat. Mit der gefangenen Kuh gehen die
                  beiden zur Burg. Dort beobachten die beiden einen
                  Bauern, der mit seiner Kuh in die Burg
                  eingelassen wird. Nat&uuml;rlich versucht Chi den
                  gleichen Trick.</P>

                  <P>JM gibt ihm noch den Maueranker mit, den Chi
                  mit dem Seil verbindet. Innen angekommen, steigt
                  Chi sofort in seine Ninja-Kleidung. Als erstes
                  erkundet er das Pf&ouml;rtnerhaus und steckt den
                  Schl&uuml;ssel ein. Dann schleicht Chi in den
                  Palast und belauscht ein Gespr&auml;ch Li Dengs.
                  In der gro&szlig;en Halle entdeckt er Kate und
                  verspricht ihr schnell Hilfe zu holen.
                  Zur&uuml;ck in der Eingangshalle geht der Ninja
                  noch in den Speiseraum und steckt die Flasche
                  ein. Er geht weiter in die K&uuml;che und
                  bet&auml;ubt den Hund mit dem Wein. Die beiden
                  Brath&auml;hnchen steckt er nat&uuml;rlich auch
                  ein. Dann betritt er das Zimmer des Kochs. Von
                  dort nimmt er das Messer mit. Er &ouml;ffnet die
                  T&uuml;r und entdeckt einen zweiten Zugang zur
                  gro&szlig;en Halle. Nachdem wir mit Chi den
                  Palast erkundet haben, gehen wir zur&uuml;ck an
                  die frische Luft und marschieren zur Burgmauer.
                  Er wirft den Maueranker &uuml;ber die Mauer und
                  zieht JM her&uuml;ber. Um Wachen auszuweichen,
                  schleichen die beiden zur&uuml;ck ins
                  Pf&ouml;rtnerhaus. Nachdem die Luft weich ist,
                  rennen die beiden in den Palast. Sind die Wachen
                  in den Nebenr&auml;umen verschwunden, geht es
                  weiter in den Speiseraum. Dort wirft JM die Lampe
                  um und entfacht dadurch ein Feuer. Durch die
                  K&uuml;che und das Schlafzimmer kommen die beiden
                  in die gro&szlig;e Halle. JM verriegelt die
                  T&uuml;r und erschie&szlig;t die Schlangen.
                  leider kann er nicht verhindern, da&szlig; Kate
                  gebissen wird. JM nimmt Kate auf den Arm und
                  fl&uuml;chtet auf den Balkon. Dort knotet Chi das
                  Seil an die Br&uuml;stung und alle drei
                  fl&uuml;chten zur Panzergarage. Im Panzer benutzt
                  JM den Schl&uuml;ssel und dr&uuml;ckt
                  anschlie&szlig;end auf den Starter. Es folgt die
                  erste Actionsequenz. Im Flugzeug gibt JM die
                  Heilkr&auml;uter Chi.</P>

                  <H3>In Kathmandu :</H3>

                  <P>JM verl&auml;&szlig;t das Flugzeug und
                  diskutiert kurz mit Chi die Situation. JM geht
                  Hilfe holen, Chi zur&uuml;ck ins Flugzeug. Dort
                  nimmt er eine Zeltplane une eine Decke, die er
                  sch&uuml;tzend um Kate dragiert. Mit seiner
                  Ninja- und der Guano-Medizin stabilisiert er den
                  Zustand von Kate, bis Hilfe kommt. JM spricht mit
                  seiner Retterin Ama (2 2 3) und schaut sich
                  anschlie&szlig;end im Dorf um. im Postamt schickt
                  er ein Telegramm an Lomax. Dann besucht er die
                  Dorftaverne und spricht als erstets mit dem Wirt
                  (2 3). Dieser verweist ihn an Sardar (2). Als
                  n&auml;chstes geht JM zum Lama. Nach einem kurzen
                  Gespr&auml;ch mit einem jungen M&ouml;nch wird er
                  eingelassen. Das erste Gespr&auml;ch mit dem
                  weisen Mann f&uuml;hrt leider zu nichts. JM geht
                  deshalb zu Bojon, dem lokalen Diktator. Nach
                  einer unpassenden Bemerkung landet er im
                  Gef&auml;ngnis. Chi l&auml;uft zu Ama, worauf
                  diese JM aus dem Gef&auml;ngnis holt. Jm
                  unterh&auml;lt sich kurz mit Kate und geht dann
                  zum Schrottplatz, wo er einen Jungen trifft. Der
                  Junge bietet nach kurzem Gespr&auml;ch einen
                  Bezinschlauch als tauschobjekt an. Chi baut aus
                  der Zigarrenkiste, seinen E&szlig;st&auml;bchen
                  und vier M&uuml;nzen ein Spielzeug; daf&uuml;r
                  bekommt er den Benzinschlauch. Jetzt hgeht er
                  wieder zur&uuml;ck zum Lama und erf&auml;hrt
                  einige Neuigkeiten. In der Taverne kann er Sardar
                  &uuml;berzeugen (1 3), Hilfe leisten. JM schenkt
                  ihm seine Waffe und die Revolution bricht aus.
                  Weiter gehts in der T&uuml;rkei.</P>

                  <H3>In Istanbul :</H3>

                  <P>Auf dem Rollfeld bekommt JM kein Benzin vom
                  Verk&auml;ufer. Auf dem Weg in die Stadt bemerken
                  Kate und JM einen kleinen Jungen, der Orangen
                  verkauft. JM findet in einer Seitenstra&szlig;e
                  den Offiziersclub und f&uuml;hrt von dort ein
                  kurzes Telefongespr&auml;ch mit Lomax. Danach
                  wird Jake von den Truppen des Sultans verhaftet.
                  Kate tauscht ihre Brosche beim H&auml;ndler und
                  vermehrt ihr Geld beim Gl&uuml;cksspiel. Darauf
                  geht sie zum Orangenverk&auml;ufer und wirft aus
                  Versehen seinen Wagen um. Sie entschuldigt sich
                  und erh&auml;lt von ihrem jungen Verehrer eine
                  Blume. Jetzt kauft sie ein Kamel f&uuml;r 200
                  Shekel. Sie geht zur&uuml;ck zum Laden und kauft
                  dort eine S&auml;ge. Jetzt macht sie sich mitsamt
                  Kamel auf zum Palast. In einer Seitengasse trifft
                  sie eine Frau und schenkt ihr die Blume. JM wird
                  gerettet und die beiden fl&uuml;chten zum
                  Stadttor. Dort schenkt Kate dem Jungen das Kamel
                  und Jake murmelt ein paar Entschuldigungen (2 3).
                  Am Flughafen angelangt sehen die beiden, wie ihr
                  Flugzeug in Flammen aufgeht. Sie fl&uuml;chten
                  zum Bahnhof und kaufen eine Fahrkarte f&uuml;r
                  den Orient-Expre&szlig;.</P>

                  <P>Im Zug :</P>

                  <P>Szene als JM : 1 1 3 3</P>

                  <P>Szene als Kate : 2 1 3</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

