<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Tips &amp; Tricks</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">ERIC, THE UNREADY</H1>

                  <H3>Sonnabend:</H3>

                  <P>Erics erste Aufgabe besteht darin, das Schwein
                  zu k&uuml;ssen, um es wieder in die Bauerstochter
                  zur&uuml;ckzuverwandeln. Dazu geht man
                  zun&auml;chst in die Scheune, &ouml;ffnet den
                  Schrank und nimmt alles mit. Danach geht man aufs
                  Klo, nimmt die Zeitung, befestigt das Seil am
                  Haken und klettert nach unten. Dort gibt man dem
                  Schwein das Aphrodisiakum und geht mit dem
                  Schwein zur&uuml;ck zum Farmer, wo man das
                  Schwein k&uuml;&szlig;t und die Scheune betritt.
                  Auf dem R&uuml;ckweg wird man von der Prinzessin
                  mitgenommen, die schon einmal andeutet, wie gerne
                  sie doch einmal von Eric gerettet werden
                  m&ouml;chte. Dies nehmen wir uns zu Herzen und
                  harren der Dinge, die da kommen m&ouml;gen.</P>

                  <H3>Sonntag:</H3>

                  <P>Nach dem Aufwachen stellt Eric fest, da&szlig;
                  er in seiner verrosteten R&uuml;stung festsitzt.
                  Nach einigen Z&uuml;gen kommt der Knappe und
                  befreit Eric aus seiner mi&szlig;lichen Lage. Man
                  nimmt sich den Helm und die Karte und
                  verl&auml;&szlig;t sein Quartier. Drau&szlig;en
                  nimmt man noch die Zeitung und geht in die Halle.
                  Hier erf&auml;hrt Eric, da&szlig; die Prinzessin
                  entf&uuml;hrt ist und da&szlig; er
                  auserw&auml;hlt ist, sie zu erretten.
                  Zun&auml;chst geht man zu Giovanni, gibt ihm die
                  Karte und erh&auml;lt nach Angabe der richtigen
                  Ma&szlig;e einen Umhang, in dessen Tasche sich
                  eine Bohne befindet. Nun geht man Richtung
                  S&uuml;den und dann nach Westen, worauf man eine
                  Fackel erh&auml;lt. Am Teich f&uuml;llt man noch
                  seinen Helm mit Wasser. Danach gehts in den
                  Schlo&szlig;hof, wo man die Bohne einpflanzt, mit
                  Wasser begie&szlig;t und an der neu gewachsenen
                  Pflanze hochklettert, worauf man eine
                  Goldm&uuml;nze erh&auml;lt. Danach geht man ins
                  Schlo&szlig; und nimmt das Holz. Nun geht man in
                  den Eisladen, legt das Holz in den Kamin und
                  z&uuml;ndet es mit der Fackel an. Die
                  Ohrensch&uuml;tzer, die man daf&uuml;r von Bobbin
                  bekommt, setzt man auf und geht zum Barden, dem
                  man die Goldm&uuml;nze gibt. Daraufhin f&auml;ngt
                  er an, seine Geschichte zu erz&auml;hlen. Nur
                  Eric kann wachbleiben, da die Ohrensch&uuml;tzer
                  alles, was langweilig ist, rausfiltert. Nun ist
                  der Barde bereit, Eric ins Schlo&szlig; zu
                  folgen, wo er sofort mit seiner Geschichte
                  anf&auml;ngt. Wenn alle eingeschlafen sind, kann
                  man nach oben gehen. Kurze Zeit sp&auml;ter
                  erscheint der Zauberer und teleportiert alle zum
                  Teich. Hier mu&szlig; man, um zu zeigen,
                  da&szlig; man der Auserw&auml;hlte ist, die
                  Banane aus dem Fels ziehen. Danach geht man noch
                  einmal in den Eisladen und kauft sich ein
                  Bierflo&szlig;. Nun wirft man die Banane in den
                  Teich.</P>

                  <H3>Montag:</H3>

                  <P>Obwohl man auf einem Friedhof aufwacht,
                  beginnt der Tag wie jeder andere auch,
                  n&auml;mlich mit Zeitungslesen. Danach geht man
                  in den Wald, wo der Baum das Bierflo&szlig;
                  bekommt. In der Lichtung nimmt man die Zweige,
                  &ouml;ffnet die Fallt&uuml;r und findet sich im
                  Anfangsraum von Zork I wieder. Hier &ouml;ffnet
                  man den Briefkasten, nimmt die Post, geht nach
                  Westen und dann nach Nordosten. Leider hat Eric
                  kein Geld f&uuml;r einen Stein, also
                  verl&auml;&szlig;t er den Laden wieder,
                  erh&auml;lt aber trotzdem eine Spitzhacke von
                  Fran. Mit dieser kann man eines der Bretter an
                  der T&uuml;r abl&ouml;sen und das Haus betreten.
                  Unter dem Teppich befindet sich nat&uuml;rlich
                  die Fallt&uuml;r, die man &ouml;ffnet, worauf man
                  von einem genervten Wesen den Schl&uuml;ssel
                  f&uuml;r die Vitrine bekommt. Im Raum &uuml;ber
                  dem Wohnzimmer befindet sich ein Knochenhaufen,
                  in dem ein F&uuml;hrerschein versteckt ist, der
                  auf einen Dwarf ausgestellt ist. Ein Dwarf ist
                  klein und b&auml;rtig, also macht man sich den
                  falschen Bart an und kniet sich hin. So begibt
                  man sich zum Clearing House und holt sich den in
                  der Post versprochenen Gewinn ab: einen Tag auf
                  dem Rummelplatz. Zun&auml;chst geht man nach
                  Westen und spielt Memory gegen Dwarf. Wenn man
                  gewonnen hat, bekommt man eine Steinschleuder.
                  Nun geht man S&uuml;dwesten und bekommt ein
                  Geldst&uuml;ck. Mit dem Geldst&uuml;ck kann man
                  sich im Laden einen kleinen Stein kaufen. Nun
                  legt man den Hebel des Riesenrades um und setzt
                  sich in den Sitz. Nachdem man die Steinschleuder
                  geladen hat, dr&uuml;ckt man auf den gr&uuml;nen
                  Knopf. Oben schie&szlig;t man mit der
                  Steinschleuder auf den Hebel, steht auf und nimmt
                  sich die Mistgabel. Nun befestigt man das
                  Bungeeseil am Ast und springt nach unten. Dort
                  bekommt man von Fran den gro&szlig;en Stein, mit
                  dem man in den Raum mit dem Knochenhaufen geht.
                  Hier stellt man sich auf den Stein, worauf man
                  nach oben klettern kann. Im dunklen Raum geht man
                  wieder nach oben und findet sich auf dem Friedhof
                  wieder.</P>

                  <H3>Dienstag:</H3>

                  <P>Zuerst geht man in die Kneipe und nimmt sich
                  die Zeitung. Danach liest man das Buch und gibt
                  den herausfallenden Coupon dem Kellner, worauf
                  man endlich an die Getr&auml;nkekarte kommt. Man
                  bestellt sich eine Flasche Mead Lite und geht mit
                  dieser zur Burg. Hier versucht man es mit einem
                  Frontalangriff, durch den der Busch abbrennt und
                  einen Weg ums Schlo&szlig; freigibt. Mann nimmt
                  sich die Beeren und versucht es mit diesem Weg.
                  Hinten merkt man, da&szlig; die Burg an dieser
                  Seite keine Wand hat. Den nun angreifenden
                  Killerschildkr&ouml;ten gibt man Tort-Ease,
                  worauf sie selig einschlafen. Im Stall gibt man
                  dem Oaf die Flasche. Die beiden K&ouml;pfe des
                  Oaf streiten sich dann um die Vorz&uuml;ge von
                  Mead Lite und sind deshalb so abgelenkt,
                  da&szlig; man problemlos den Ast nehmen kann.
                  Diesen z&uuml;ndet man mit dem Pech an. Mit dem
                  brennnenden Ast geht man zum Wachssiegel, welches
                  abgeschmolzen werden mu&szlig;. Nun dr&uuml;ckt
                  man den Schl&uuml;ssel in das weiche Wachs. Mit
                  diesem Abdruck kann man sich von Howard einen
                  Nachschl&uuml;ssel machen lassen, der die
                  T&uuml;r &ouml;ffnet. In der Burg spielt man
                  Wheel of Torture. Wenn man gewonnen hat, gibts
                  den magischen Schraubenschl&uuml;ssel.</P>

                  <H3>Mittwoch:</H3>

                  <P>Nachdem man die Zeitung gelesen hat und sich
                  den Herald angeh&ouml;rt hat, betritt man den
                  Jahrmarkt. Zuerst geht man zum Schie&szlig;stand
                  und holt sich alle Preise ab. Mit diesen geht man
                  zu den Narren und zieht ihnen mit dem Gummihuhn
                  eins &uuml;ber, worauf man einen Narrenkappe
                  erh&auml;lt. Nun geht man in den Pavillion. Ziel
                  ist es hier, den Nachttopf zu nehmen, ohne
                  da&szlig; der Troll es merkt. Dazu
                  l&auml;&szlig;t man das Rollo herunter,
                  schlie&szlig;t das Maul der Schlange mit dem
                  Gummiband, bindet das Ferkel mit dem Bungeeseil
                  am Tisch fest und stellt sich auf das lose Brett.
                  Jetzt kann man den Nachttopf nehmen. Man nimmt
                  sich noch die Schnecke, geht nach drau&szlig;en
                  und spuckt aus, worauf man an den Pranger
                  gestellt wird. Wenn der Junge mit dem Apfel vor
                  einem steht, steckt man ihm die Zunge raus.
                  Darauf wirft er Eric den APfel ins Gesicht. Nun
                  wartet man, bis die 10 Minuten um sind und geht
                  dann zum Koch, dem man den Apfel gibt. Dieser
                  l&auml;&szlig;t seine Sch&uuml;rze zur&uuml;ck,
                  die man an sich nimmt. Jetzt wird es Zeit, in die
                  Arena zu gehen. Um 11 Uhr kann man sich die
                  Geschichte des Drachens anh&ouml;hren, um 12
                  zeigt Lily ihre Sangesk&uuml;nste. Wenn sie geht,
                  l&auml;&szlig;t sie eine Einladung zur&uuml;ck.
                  Mit dieser geht man in ihren Umkleideraum und
                  erh&auml;lt die Aufgabe, ihren Schal vom Maibaum
                  zu holen. Nun setzt man sich wieder in die Arena.
                  Um 1 Uhr kommen die Jongleure. Nach der
                  Aufforderung, ihnen einen Gegenstand zuzuwerfen,
                  mit dem sie jonglieren k&ouml;nnen, wirft man
                  ihnen die Schnecke zu. Diese frustriert die
                  Jongleure so sehr, da&szlig; sie ihre Handschuhe
                  zur&uuml;cklassen. Mit diesen kann man auf den
                  Maibaum klettern und den Schal holen, den man
                  Lily bringt. Diese stellt einem eine neue
                  Aufgabe, die aber 1. unwichtig und 2.
                  unl&ouml;sbar ist, da das Unkraut (weed), welches
                  man daf&uuml;r ben&ouml;tigt, sich in eine Pfeife
                  (reed) verwandelt, sobald man den Umkleideraum
                  verl&auml;&szlig;t. Nun geht man zum Elf und
                  wartet, bis der Musiker kommt. Diesem gibt man
                  die Pfeife und erh&auml;lt daf&uuml;r die
                  Sonnenbrille, welche man aufsetzt. Jetzt spielt
                  man eine Runde H&uuml;tchenspiel und gewinnt die
                  Holzschnitte. Mit diesen geht man zum
                  Schie&szlig;stand und gibt sie dem Besitzer, der
                  dadurch so abgelenkt ist, da&szlig; man den Bogen
                  mitnehmen kann. Danach zieht man alles an und
                  betritt die Drachenh&ouml;hle. Man wartet einen
                  Zug und schaut, wo der verletzbare Punkt
                  hinwandert, nimmt den Zug mit UNDO zur&uuml;ck,
                  schie&szlig;t auf diese Stelle und besiegt so den
                  Drachen.</P>

                  <H3>Donnerstag:</H3>

                  <P>Am Anfang des Tages nimmt man sich die Zeitung
                  und zeigt dem Einhorn seinen nackten Hintern
                  (MOON UNICORN), worauf es Eric in den
                  n&auml;chsten Baum bef&ouml;rdert. Dort nimmt man
                  sich das Blatt. Nun geht man nach Westen, nimmt
                  sich die Robe und das Taschentuch, zieht die Robe
                  an und l&auml;utet die 4. Glocke. Drinnen liest
                  man der Jungfrau aus der Zeitung vor, was sie zum
                  Weinen bringt. Galant reicht Eric ihr sein
                  Taschentuch. Danach legt man das Blatt in das
                  tr&auml;nennasse Taschentuch und wartet auf die
                  Pr&uuml;fung, die man jetzt besteht. Nun geht man
                  in den Opferraum, steckt sich den Ring an, stellt
                  sich in den Bottich und wartet auf das
                  Jungfrauenopfer. Eric zeigt sich dem M&auml;dchen
                  und ihr das Buch, welches sie liest und sofort
                  einschl&auml;ft.</P>

                  <P>Wenn das Maul des Gottes aufgeht, geht man
                  nach Norden und kommt kurze Zeit sp&auml;ter bei
                  den G&ouml;ttern an. Zun&auml;chst geht man zum
                  Gott des Nordwindes, der einem einen Brief
                  f&uuml;r Morty mitgibt, mit dem man den Palast
                  betreten kann. Drinnen zeigt man der Empfangsdame
                  den Brief und wartet, bis man von Morty abgeholt
                  wird. In Mortys B&uuml;ro gibt man Morty den
                  Brief. Wenn Clio kommt, geht man raus und nimmt
                  sich drau&szlig;en den Brief und macht das
                  gleiche noch einmal: jetzt kann man sich auch die
                  Farbe nehmen. Nun ruft man 1800 DOMINUS an und
                  geht in die Bibliothek. Hier w&auml;hlt man das
                  Buch Setting up Sodom/Gomorrah aus. Mit diesem
                  geht man in den Copyshop und l&auml;&szlig;t sich
                  eine Kopie anfertigen. Danach geht man ins Labor,
                  dreht die Kurbel und nimmt sich die
                  Nacktschnecke. Jetzt geht man nochmals zum
                  Nordwind, zieht am Drachenschwanz und z&uuml;ndet
                  mit dem Drachen die Kerze auf dem Kuchen an, den
                  man inzwischen bekommen haben sollte. Wenn der
                  Nordwind die Kerzen ausbl&auml;st, gefriert das
                  Wasser weiter unten und man kommt an den goldenen
                  Schl&uuml;ssel am anderen Ende des Ufers. Jetzt
                  geht man zum Gott der Reperatur und gibt ihm das
                  Token, worauf er den Nektarautomaten repariert.
                  Man wirft die M&uuml;nze, die man vom Gott
                  bekommt, in den Schlitz und zieht sich eine
                  Flasche. Mit dieser geht man zum grabenden Gott
                  und gibt ihm solange Nektar, bis er mal f&uuml;r
                  kleine G&ouml;tter mu&szlig;. Jetzt kann man sich
                  das Ei nehmen und das im Buch beschriebene Ritual
                  ausf&uuml;hren. Wenn die Treppe erscheint, geht
                  man nach oben, schlie&szlig;t das goldene
                  Schlo&szlig; mit dem goldenen Schl&uuml;ssel auf
                  und nimmt sich die Brechstange.</P>

                  <H3>Freitag:</H3>

                  <P>Im Sumpf nimmt man die Zeitung und betritt das
                  Flo&szlig;. Nun gibt man Zulu die Beeren, worauf
                  er das Flo&szlig; durch den Strudel nach Phantasy
                  Island bringt. Dort setzt man sich auf den
                  Kapit&auml;nssitz und f&auml;hrt nach Monkey
                  Island, wo man mit YOOHOO die Banane ruft, welche
                  man dem Affen gibt. Jetzt kann man die
                  Kokosnu&szlig; nehmen. Das n&auml;chste Ziel ist
                  Milligan Island, wo man den Sonnenschirm nimmt
                  und auf die Ankunft der Flaschenpost wartet. Nun
                  nimmt man das Streichholzbriefchen, liest es,
                  verbindet die Punkte (zuerst auf Punkt 2
                  klicken), steckt es wieder in die Flasche und
                  wirft die Flasche wieder ins Wasser. Nach kurzer
                  Wartezeit taucht sie mit einem Zertifikat wieder
                  auf. Danach f&auml;hrt man in Richtung Liliput
                  Island, wo man die Kokosnu&szlig; und den
                  Sonnenschirm importiert (verkleinert) und den
                  Drachen exportiert (vergr&ouml;&szlig;ert). Mit
                  den so ver&auml;nderten Sachen gehts auf die
                  Schatzinsel, wo man dank des Zertifikats eine
                  Ausbildung als Pirat bekommt. Wenn man den
                  Abschlu&szlig;test besteht, gibts eine Flasche
                  Rum zur Belohnung. Zu guter Letzt stattet man
                  auch noch der Gnollinsel einen Besuch ab. Auf dem
                  Weg dorthin wird der Eisberg vom Drachen
                  beseitigt. Auf der Insel spaltet man die
                  Kokosnu&szlig; mit der Guillotine, sch&uuml;ttet
                  den Rum dazu und steckt den Sonnenschirm in die
                  Kokosnu&szlig;. Mit diesem Drink f&auml;hrt man
                  zur&uuml;ck nach Phantasy Island, wo man den
                  Bolzenschneider daf&uuml;r bekommt.</P>

                  <H3>Sonnabend:</H3>

                  <P>Vor dem schwarzen Tor enfernt man den Mist mit
                  der Mistgabel, greift die Kr&auml;he mit der
                  Brechstange an, legt das Steak auf das Auge und
                  schneidet den Blitz mit dem Bolzenschneider
                  durch. Jetzt nimmt man die Pralinenschachtel und
                  dreht den Mond mit dem Schraubenschl&uuml;ssel in
                  die richtige Position. Das Tor ist nun offen. Das
                  Tor ist nun offen, die Hexe kommt und sperrt Eric
                  ins Schlo&szlig;. Den Todesfluch der Hexe stoppt
                  man, indem man die Sanduhr auf die Seite legt.
                  Danach schaut man in die Kristallkugel und liest
                  im Zauberbuch. Nun nimmt man sich die Augen und
                  setzt sie in den Sch&auml;del ein. Jetzt gibt man
                  einen Eulenschrei von sich (HOOT; die Eule ist
                  ein Symbol der Weisheit) und l&ouml;st die
                  Aufgabe. XI+XI ist gespiegelt IX+IX, also ist das
                  Ergebnis IIIVX. Nun geht man durch den Durchgang
                  ins Zimmer der Hexe und nimmt sich das Makeup.
                  Jetzt geht man wieder in den Durchgang, wartet,
                  bis es 10:31 Uhr ist und schmiert die Kette mit
                  dem Makeup ein. Danach geht man wieder in das
                  Zimmer der Hexe, &ouml;ffnet das Fenster und
                  setzt sich solange auf den Besen, bis man im
                  Crawlspace ankommt. Hier &ouml;ffnet man die
                  Fallt&uuml;r, geht nach oben und wartet in der
                  Torte, bis der Kronleuchter auf das Beast
                  f&auml;llt. Jetzt gibt man der Hexe die
                  Pralinenschachtel, greift sich die Prinzessin und
                  flieht. Drau&szlig;en bl&auml;st man in Lorealles
                  Pfeife und fliegt mit der Ente zum heimatlichen
                  Schlo&szlig; zur&uuml;ck.</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

