<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Tips &amp; Tricks</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="tut0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "tut.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="10" summary=
            "" bgcolor="#fffff4">
              <TR>
                <TD>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                  <HR>

                  <H1 align="center">HARDNOVA</H1>

                  <P>Am Start befindet man sich in der Bar von
                  Mastassine City auf dem Planeten Mastassini. Die
                  Mannschaft besteht aus Stark (oder Nova) und dem
                  Bremar Navigator Akri Janr. Die Rahmenhandlung
                  ist im Manual festgelegt. Zun&auml;chst sollte
                  man nun versuchen, sein Geld, seine
                  Ausr&uuml;stung und seine Mannschaft
                  aufzubessern. Dazu sollte man jedesmal, wenn man
                  zu einem anderen Planetensystem aufbricht, in der
                  Raumstation des Planeten Mastassini
                  Schmuggelauftr&auml;ge annehmen. Mit dem so
                  erworbenen Geld kann man sich einen besseren
                  Laser f&uuml;r das Schiff und bessere
                  Ausr&uuml;stung f&uuml;r die Mannschaft
                  kaufen.</P>

                  <P>Auf Holebrook findet man eine verlassene Basis
                  (Michray Base), in der man einen JW-2-Blaster und
                  Gems findet. Die Gems kann man in den
                  Waffenl&auml;den verkaufen. In der verlassenen
                  Pinnacle Base auf Holebrook findet man
                  Waffenclips unterschiedlicher Art und eine
                  M23-30AR-Pistole. Bevor man zum Starkiller HQ
                  aufbricht, sollte man mindestens ein
                  zus&auml;tzliches Besatzungsmitglied haben.
                  Dieses findet man in der Bar auf Tikorr City. Sie
                  hei&szlig;t Cerallon und kann im Raumschiff als
                  Software Engineer eingesetzt werden.</P>

                  <P>Man begibt sich nun zum Starkiller HQ auf
                  Holebrook und bekommt von Kommandant Kendall
                  seinen ersten Auftrag. Er besteht darin, einen
                  von Ariel-S&ouml;ldnern besetzten ciberanischen
                  Wassertanker zu entern. Also auf in das
                  Ciberan-System (Schmuggelgut nicht vergessen).
                  Der Tanker fliegt in der N&auml;he des
                  Sternentores. Man mu&szlig; andocken. Die
                  Besatzung besteht aus sieben Mann und dem
                  Kommandant (also vorher abspeichern). Ist die
                  Aufgabe gel&ouml;st, bringt man Kendall den
                  "Beweis" f&uuml;r das Entern des Schiffes und
                  kann dann zun&auml;chst wieder etwas im System
                  herumtuckern. In K&uuml;rze kommt jedoch ein
                  Funkspruch, da&szlig; man sich im Starkiller HQ
                  einzufinden hat. Man bekommt nun von Kendall zwei
                  neue Auftr&auml;ge. Bei den ersten, einfacheren
                  handelt es sich darum, das Oberhaupt der Lanta
                  Disps im Auftrag des Oberhauptes der Lanta Frags
                  zu entf&uuml;hren. Dazu soll mann nach Varon und
                  dort den Disp Tempel aufsuchen. Den zweiten
                  Hauptauftrag soll man f&uuml;r Max Sebastian, den
                  Herrscher von Ciberan, ausf&uuml;hren. Man soll
                  die &Uuml;bergriffe deer Ariel-S&ouml;ldner aud
                  Ciberan unterbinden und sowohl den General Camede
                  Rodgen als auch den Diktator von Ariel, Damien
                  Altron, ermorden. Weitere Instruktionen
                  erh&auml;lt man von Max Sebastian auf Ciberan in
                  Ciberan City.</P>

                  <P>Von Kendall bekommt man noch ein
                  Besatzungsmitglied (Name: Janai - im Raumschiff
                  im Bereich Communication einsetzbar). Sie hat
                  auch die Codekarte, die einem den Zutritt zu den
                  R&auml;umen Max Sebastians erm&ouml;glicht (CIB
                  MAG CARD). Au&szlig;erdem erh&auml;lt man von
                  Kendall den Hinweis, da&szlig; auf einer Station
                  (Amaro Aquariums) ein Mann namens Roger sehr
                  n&uuml;tzlich f&uuml;r die Auftr&auml;ge
                  w&auml;re. Also auf zu dieser Station. Rogers
                  will nur mitmachen, wenn man ihm einen "Male
                  Honky grobbler" (ein Fisch) besorgt. Diesen Fisch
                  gibt`s nur in der Bar von Mastassini. Man nimmt
                  das Aquarium mit und fliegt nach Mastassini. Hier
                  kann man zun&auml;chst noch ein
                  Manschaftsmitglied rekrutieren (Ace Elevator,
                  einsetzbar als Gunner), dann klaut man den Fisch
                  und fliegt wieder nach Holebrook zu der Amaro
                  Aquarien Basis. Rogers macht nun mit. Er besitzt
                  drei MIII-Laser, die man unter der Manschaft
                  aufteilen kann. Man fliegt nun nach Varon im
                  Ciberan-System und sucht den Tempel der Disps
                  auf. Auf einer Wand findet man den Hinweis auf
                  die City von Ulgurch. In der City von Ulgurch
                  findet man den Hinweis auf die Leader`s Hall. In
                  der Leader`s Hall k&auml;mpft man sich durch, bis
                  man auf den F&uuml;hrer der Lanta Disps und den
                  F&uuml;hrer der Lanta Frags st&ouml;&szlig;t. Es
                  stellt sich heraus, da&szlig; die Entf&uuml;hrung
                  nur ein Vorwand sein sollte, um die
                  Lanta-Disp-Anh&auml;nger weiter auf die
                  Lanta-Frag-Anh&auml;nger zu hetzen. Da die beiden
                  F&uuml;hrer Dich nicht bezahlen wollen,
                  erschie&szlig;t man sie und findet Gems.</P>

                  <P>Nun zur L&ouml;sung des Hauptauftrages. Man
                  begibt sich nach Ciberan und sucht Max Sebastian
                  auf. Dieser teilt einem mit, da&szlig; die
                  Ariel-S&ouml;ldner bis zur Research-Station
                  vorgedrungen sind. Also begibt man sich zur
                  Research-Station. Hier erh&auml;lt man von den
                  Ciberan-K&auml;mpfern die Mitteilung, da&szlig;
                  die Ariel-S&ouml;lnder Nachschub von der Main
                  Processing Station Base #2 erhalten. In Base #2
                  erh&auml;lt man die Auskunft, da&szlig; sich ein
                  F&uuml;hrer der S&ouml;ldner in der Quality
                  Control Base #3 aufh&auml;lt. In Base #3
                  mu&szlig; man sich durchk&auml;mpfen. Man findet
                  eine MAG-Card 391A, eine MAG-Card 174J und einen
                  S&ouml;ldner, der nicht schie&szlig;t,
                  verr&auml;t die Koordinaten der Basis, auf der
                  sich general Rodgen aufh&auml;lt. In dieser Basis
                  braucht man zun&auml;chst die MAG-Card 391A, um
                  den Lift zu aktivieren. Dann mu&szlig; man sich
                  bis zum General durchk&auml;mpfen. Es ist sehr
                  schwierig, ihn umzubringen (Spielstand
                  speichern). Hat man es geschafft, findet man eine
                  MAG-Card 942Z. Man fliegt jetzt nach Ariel und
                  aktiviert in Ariel City den Lift mit einer
                  MAG-Card 174J. In der oberen Etage trifft man auf
                  einen Ariel-Rebellen, der die Koordinaten des
                  Rebellenst&uuml;tzpunktes verr&auml;t. Im
                  Rebellenst&uuml;tzpunkt erh&auml;lt man die
                  Koordinaten des St&uuml;tzpunktes, auf dem sich
                  Damien-Altron aufh&auml;lt. K&auml;mpft man sich
                  durch diesen St&uuml;tzpunkt, so steht man vor
                  dem Hologramm von Damien Altron. Es stellt sich
                  heraus, da&szlig; es sich um einen
                  planetenumspannenden Computer handelt. Also zieht
                  man sich wieder zur&uuml;ck. Achtung, in diesem
                  St&uuml;tzpunkt nicht aus dem Spiel gehen, da
                  dann sofort wieder alle K&auml;mpfer vorhanden
                  sind - auch die, die man schon l&auml;ngst
                  eliminiert hat. Man kann nun noch nebenbei einen
                  Darcator im Tilkorr Club auf dem Planeten Tikorr
                  anheuern. Alles, was er will, ist ein
                  Graveblocker-Anzug, dann macht er mit.
                  Unterdessen erh&auml;lt man einen Funkspruch vom
                  Starkiller HQ, da&szlig; im Rouyn-Planetensystem
                  eine Invasion stattfindet, und da&szlig; man sich
                  zur Mining-Station Rouyn begeben soll. In der
                  Mining-Station findet man eine MAG-Card 854B, mit
                  der man den Lift zur Bibliothek aktivieren kann.
                  Der Vormann der Station sagt, da&szlig; die
                  DSRE-Labs auf Tikorr schuld an der Invasion
                  seien. Man kopiert sich also in der Bibliothek
                  die Viewer-Disk &uuml;ber die DSRE-Labs und
                  fliegt nach Tikorr. Hier trifft man in der Bar
                  auf einen betrunkenene Wissenschaftlerin, die die
                  Koordinaten der DSRE-Station bekanntgibt. Man
                  mu&szlig; sich nun durch die ganze Station (Bild
                  2) k&auml;mpfen (abspeichern, da schwierig). Man
                  findet den Droiden Alice, den man reparieren
                  sollte. Sie wird zum wichtigsten
                  Mannschaftsmitglied, da sie eine Plasmakanone
                  besitzt (Clibs dazu im Exotic Weapon Shop Ariel).
                  Von der f&uuml;hrenden Wissenschaftlerin der
                  DSRE-Labs erh&auml;lt man die Auskunft, da&szlig;
                  sie nicht f&uuml;r die Invasion verantwortlich
                  ist, da&szlig; man aber weitere Informationen von
                  einem DSRE Laboratorium auf Mastassini bekommen
                  kann. Au&szlig;erdem trifft man auf einen Infoman
                  (Waldron), der angibt, sein Bruder werde auf
                  einem Darcator-Raumschiff-Reparatur-Dock
                  festgehalten. Also hin zum Spacecraft Repair
                  Dock. Hier mu&szlig; man erst einige Darcator
                  erledigen und kann dann den Bruder Waldrons
                  befreien. Er ist als Engineer einsetzbar.
                  Au&szlig;erdem findet man einen Thermoblaster.
                  Unterdessen spitzt sich die Lage zu. Man
                  erh&auml;lt einen Funkspruch, da&szlig; die
                  Invasion im Rouyn-System weiter fortgeschritten
                  ist und man zu einer Ausweichbasis der
                  Minenarbeiter auf Rouyn fliegen soll. Dort
                  angekommen, erh&auml;lt man den Hinweis,
                  da&szlig; sich eine wichtige Viewer-Disk in der
                  jetzt von feinden besetzten Mining Base befinden
                  soll. Hat man die Basis freigek&auml;mpft, so
                  kann man die Viewer-Disk X kopieren. Sie besagt,
                  da&szlig; man Feindschiffe betreten darf. Also
                  zur&uuml;ck in den Weltraum und an das
                  n&auml;chste Feindschiff angedockt. Man findet
                  hier (Bild 3) Nervengas, bessere R&uuml;stung
                  f&uuml;r Alice und kann die Viewer-Disks R und S
                  kopieren. Beide Disketten sind jedoch
                  verschl&uuml;sselt. Da man momentan nicht
                  weiterkommt, erinnert man sich an das Problem
                  Damien Altron.</P>

                  <P>In der Bar von Ariel trifft man auf einen
                  Lanta, der damit angibt, jeden Computer allein
                  durch Diskussion zerst&ouml;ren zu k&ouml;nnen.
                  Man nimmt ihn in die Crew auf und fliegt zum
                  St&uuml;tzpunkt Damien Altrons. Wieder
                  k&auml;mpft man sich zum Hologramm vor. Nun
                  beginnt der Lanta mit Damien zu sprechen und nach
                  kurzer Zeit brennen die Sicherungen von Damien
                  durch. Man kann nun den Raum hinter Damien Altron
                  betreten und erf&auml;hrt, da&szlig; er mit den
                  Invasoren zusammengearbeitet hat. Man kann hier
                  auch die beiden Viewer-Disks &uuml;bersetzen
                  lassen. Man erf&auml;hrt so, da&szlig; die
                  Invasion nur durchgef&uuml;hrt wird, weil das
                  Sternensystem der Invasoren in kurzer Zeit zur
                  Nova wird. Man fliegt nun nach Mastassini zu dem
                  DSRE-Laboratorium. Hier mu&szlig; man sich wieder
                  zur n&auml;chsten Etage durchk&auml;mpfen. Vom
                  leading scientist erh&auml;lt man die
                  Viewer-Disks U und V, die L&ouml;sungen f&uuml;r
                  die Invasion bereitstellen. Man mu&szlig; sich
                  nun entscheiden, wie man vorgehen will. Entweder
                  die Invasoren total vernichten oder aber ihre
                  Heimatwelt retten. Hier der Weg, wie man die
                  heimatwelt der Invasoren rettet:</P>

                  <P>Man erh&auml;lt eine Datenbank von der
                  Wissenschaftlerin, die man zu dem F&uuml;hrer der
                  Bremar ins Asteroidenschiff bringen soll. Man
                  fliegt also wieder ins Rouyn-System und dockt an
                  den Asteroiden an. Man &uuml;bergibt dem Bremar
                  die datenbank. Dieser weigert sich jedoch, weil
                  er f&uuml;rchtet, da&szlig; das Rouyn-System nun
                  von allen anderen Systemen abgeschnitten wird.
                  Also fliegt man nach Ariel und versucht die
                  Propezeiung der Bremar zu erf&uuml;llen. In der
                  Ariel-Bar trifft man die fr&uuml;here
                  S&auml;mgerin Orai. Diese nimmt man mit und
                  verkauft sie dem F&uuml;hrer der Bremar als Frau,
                  die die Prophezeiung erf&uuml;llt. Der Bremar
                  glaubt die Geschichte und leitet die Rettung des
                  Typhoon-Systems ein. Nun kann man f&uuml;r
                  l&auml;ngere Zeit Urlaub machen.</P>

                  <P>Koordinatenliste, geordnet nach Systemen :</P>

                  <P>MASTASSINI-SYSTEM :</P>

                  <P>Planet Mastassini :<BR>
                  Hauptstadt : 803. 435<BR>
                  Sister Lab DSRE : 1186. 173<BR>
                  Planet Holebrook:<BR>
                  D-Coro Command Post: 386. 637<BR>
                  Starkiller HQ: 1669. 847<BR>
                  Pinnacle Base : 1126. 847<BR>
                  Mitchray Base : 790. 408<BR>
                  Amaro Aquarium: 429. 270</P>

                  <P>ARIEL-SYSTEM</P>

                  <P>Planet Tikorr:<BR>
                  Hauptstadt : 1520.460<BR>
                  Tikorr Club: 1472. 530<BR>
                  DSRE Labs: 667. 367<BR>
                  repair dock: 547<BR>
                  Planet Ariel:<BR>
                  Hauptstadt: 1710.810<BR>
                  Rebel Base: 1571. 546<BR>
                  Damien Altron: 1411. 426</P>

                  <P>CIBERAN-SYSTEM</P>

                  <P>Planet Ciberan:<BR>
                  Ciberan City: 588 .387<BR>
                  Research Center: 610. 608 Qual.Control Base #3:
                  912. 473<BR>
                  Main Pr.Station #2: 747. 348<BR>
                  Base General Rodgen: 907. 605<BR>
                  Planet Varon:<BR>
                  Trade City Ghupon: 1360. 600<BR>
                  DISP Temple: 570. 286<BR>
                  Ulgurch: 1726, 634<BR>
                  Leader`s Hall: 670. 629</P>

                  <P>ROUYN-SYSTEM</P>

                  <P>Planet Rouyn:<BR>
                  Mining Post: 1524, 608<BR>
                  Refugee Base: 947. 306</P>

                  <P>Tips :</P>

                  <P>Wenn man im Mastassini-System ist, fliegt man
                  zum Planeten Hoolbrook. Dort geht man auf "Orbit
                  this world", dann auf den roten Punkt getippt und
                  an der Bodenstation andocken. Dort geht man in
                  die "Store" (mit S gekennzeichnet). Jetzt kauft
                  man wie wild alles, bis man kein Geld mehr hat
                  und verkauft es gleich wieder. Jetzt
                  m&uuml;&szlig;te das eigene Konto schon bei ca.
                  32000 stehen. Dies k&ouml;nnt Ihr beliebig oft
                  wiederholen.</P>
                  <HR>
                  <BR>
                  <IMG src="tut.gif" alt="" width="640" height="22"
                  border="0" usemap="#tut0"> 
                </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

