<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 - Forum</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>AMIGA-aktuell-Forum</H1>
Dies ist eine neue Rubrik, die probeweise in AMIGA aktuell eingef&uuml;hrt
wurde. In ihr sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"
zusammengefa&szlig;t.<BR>
Wenn Ihr also m&ouml;chtet, da&szlig; diese Rubrik erhalten bleibt, dann beteiligt
Euch bitte an ihr!<P><BR>

Schreibt an:<P>
Carsten Schr&ouml;der<BR>
Helmoltstra&szlig;e 10<BR><BR>
37081 G&ouml;ttingen<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A><P><BR>
Die erste Ausgabe des Forums brachte neben einigen neuen Beitr&auml;gen auch
zwei konkrete Ergebnisse: Gernod Schombergs A1000-Anfrage hatte Erfolg, und
auch f&uuml;r Michael Preu&szlig; (bzw. seinem Problem) besteht Hoffnung:<P><BR>
<B>1. Tip: CD-ROM-Laufwerk und Shapeshifter (von Jochen Abitz)</B><P>
&#171;Mein Kumpel hatte ein Overdrive-CD (PCMCIA) und konnte es auch nicht zum
Laufen bewegen.<BR>
Ein Anruf bei Christian Bauer hatte auch keinen Erfolg, da er meinte: Es
geht nicht. Ihm sei nichts bekannt.<BR>
Durch Zufall fand ich heraus, da&szlig; das Device ganz einfach "cd.device"
hei&szlig;t.<BR>
Damit konnte ich das Overdrive mit Shapeshifter benutzen.
(Das einzige, was fehlte, war der Device-Name, der ist auch nicht beim
Overdrive dokumentiert....&#187;<P>
<B>2. Tip: Miami und germany.net (von Rene Franke)</B><P>
&#171;Miami und germany.net<BR>
Inspiriert von einem Artikel aus dem Amiga Magazin 07/97 "Online kostenlos
im germany.net" habe ich mir erstmal ein Modem zugelegt, hatte bis dahin
noch keins.<BR>
Also dann MiamiInit gestartet, lief alles prima. Habe alles abgespeichert
und kann mich immer problemlos einw&auml;hlen. Allerdings habe ich von mehreren
Leuten geh&ouml;rt und gelesen, da&szlig; sie Probleme mit Miami beim Einw&auml;hlen in
germany.net haben.<BR>
Hier folgt nun meine Einstellung f&uuml;r das germany.net von MIAMI2.0g. Einfach
abtippen, speichern, und unter dem Men&uuml;punkt "Einstellungen/Importieren von
Vertrieb" in sein Miami einf&uuml;gen.<BR>
<PRE>
-------------------------------------
$ Miami settings; distribution format
$ V2.0
;
; Date:
; Author: r.franke@gmx.de
; Internet provider: germany.net
; Distribution:
;
; Append your comments here

PROTOCOL=P
SERMODE=8N1
MTU=576
IPTYPE=D
BOOTP=N
INACTIVITY=N
PAPSAME=Y
ACCM=000a0000
VJC=Y
QUICKRECONNECT=N
DNSIPCP=Y
PPPESCAPE=
CALLBACKTYPE=NONE
TERMREQ=N
DIALSCRIPT=%
ABORT "NO DIAL TONE","NO DIALTONE"
DIALNEXT "BUSY","NO CARRIER"
WAIT "CONNECT"
ABORT
DIALNEXT "NO CARRIER"
WAIT "login:"
SEND "Infobahnr"
WAIT "protocol."
%
DIALMAXREPEAT=10
DIALREPEATDELAY=30
DIALREDIALDELAY=0
HOSTDYNAMIC=Y
DOICMP=Y
VERIFYDNS=N
FAKEIP=N
TTCP=N
DBHOSTS=%
127.0.0.1 localhost
%
DBNETWORKS=%
loop 127 loopback
%
DBDOMAINS=%
%
DBDNSSERVERS=%
151.189.0.25
%
-------------------------------------
</PRE><BR>
Ein einfacher Tip noch, wenn Miami nur den DNS-Server nicht findet:<BR>
Einfach fest eintragen, und das H&auml;ckchen bei "DNS Server &uuml;berpr&uuml;fen"
wegklicken. Das reicht auch schon manchmal.<BR>
DNS-Server-Nummer: siehe Config-Skript ganz unten.<P>
Viel Spa&szlig; beim Ausprobieren!<BR>
Rene Franke<P>
(<A HREF="mailto:r.franke@gmx.de">r.franke@gmx.de</A>)&#187;<P><BR>
<B>3. Problem: AMIGA 2000 mit Eigenleben...</B><P>
Marco Miljak hat folgendes Problem mit seinem A2000B:<P>
&#171;Seit dem Kauf einer Grafik- und Turbokarte (PicassoIV 4 MB und Blizzard
2040 ERC) hat mein 2000er ein interessantes Eigenleben entwickelt. Je
nachdem in welcher Reihenfolge die einzelnen Steckkarten (Gfx-Board, Turbo-
Board, RAM-Card, SCSI-Controller+HD) installiert sind, funktioniert mal die
eine, mal die andere Komponente nicht. So kann es passieren, da&szlig; die
Festplatte ihren Dienst versagt, oder die Grafikkarte oder (das kleinste
&Uuml;bel, mit welchem ich momentan auch lebe) 4 der insgesamt 6 MB Expansion-
RAM auf dem SCSI-Controller. Kann jemand helfen?&#187;<P><BR>
<B>4. Problem: Quantum-Festplatte l&auml;uft nicht mit A2091</B><P>
Marco Miljak hat ein weiteres Problem mit seinem A2000B:<P>
&#171;Meine neue Festplatte (Quantum Lightning 730S) vertr&auml;gt sich nicht mit dem
alten Commodore A2091 SCSI-Controller. Die Folge sind st&auml;ndige Abst&uuml;rze und
Speicherfehler, witzigerweise auch dann, wenn die Festplatte &uuml;berhaupt
nicht in Betrieb ist. Ein neuer Controller (Oktagon 2008) half ab, dennoch
w&uuml;rde ich den alten Controller und die alte Festplatte weiter ben&uuml;tzen,
doch selbst auf dem neuen Controller vertr&auml;gt sich die Festplatte nicht mit
dem ebenfalls installierten A2091. Wer wei&szlig; Rat?<P><BR>
<B>5. Problem: Abst&uuml;rze w&auml;hrend des Bootens</B><P>
Marc Jochimsen hat folgendes Problem:<P>
&#171;Seit anderthalb Monaten habe ich mit meinem A500+ (OS3.1, SCSI-Festplatte,
ZIP-Laufwerk) folgendes Problem: Der Rechner bootet von dh0:, w&auml;hrend des
Bootens st&uuml;rzt er jedoch mit GURU 80000 0003/4/B ab, nach einigen Sekunden
f&auml;hrt er wieder hoch. Manchmal st&uuml;rzt er bis zu f&uuml;nfmal
hintereinander ab, ehe ich anfangen kann zu arbeiten. Aber auch w&auml;hrend des
Betriebs gibt es ab und zu Meditationspausen. Dabei liefert das Programm
MCP folgende Hinweise auf die Ursache:
<PRE>
Error by   : Exec Library
(1.) Cause : Corrupt Memory List in
             FreeMem detected
(2.) Cause : Sanity check on memory list
             failed during availmem
             (MEMF_LARGEST)
</PRE>
Wer hat hierf&uuml;r eine Erkl&auml;rung parat und kann mir einen Tip zur Beseitigung
geben?<P>
Marc Jochimsen, Deichstra&szlig;e 10, 25826 St. Peter Ording, Fax 04863/95427,
Tel. 0171/8444345&#187;<P><BR>
<B>6. Kleinanzeige: A1000 zu verkaufen</B><P>
Marc Jochimsen m&ouml;chte einen A1000 mit Sidecar zum Verkauf anbieten:<P>
&#171;A1000 mit 512 KB RAM, 256 KB WOM f&uuml;r KS 1.2, mit Maus, WB 1.3, dt.
Tastatur, PAL-Videosignal, eine Platine (also nicht Huckepack-
Platinenversion), zus&auml;tzlich Sidecar A1060, XT-Emulator f&uuml;r den
Expansionsport des A1000, 512 KB RAM, Schnittstellenkarte, DOS 3.3, DOS-
Handbuch. Preis VHS<P>
Marc Jochimsen, Deichstra&szlig;e 10, 25826 St. Peter Ording, Fax 04863/95427,
Tel. 0171/8444345&#187;<P><BR>
<B>7. Auswertung der Umfrage in Ausgabe 8/97 (Erg&auml;nzung)</B><P>
Aus Zeitgr&uuml;nden habe ich auf eine detaillierte Auswertung der
offengebliebenen Fragen 18 und 19 verzichtet. Es ging dabei um die
Systemausstattung der Umfrage-Teilnehmer.<P>
Eines kann ich schon vorweg nehmen: Die von mancher Seite aufgestellte
Behauptung, die meisten AMIGA-User bes&auml;&szlig;en lediglich einen A500 mit OS 1.3
und 1 MB RAM mu&szlig; man endg&uuml;ltig als "l&auml;ngst &uuml;berholt" betrachten, wie sich
dies auch schon bei anderen Umfragen zeigte.<P>
Und &uuml;berhaupt: Nur noch ein Bruchteil der Software, die heutzutage f&uuml;r den
AMIGA erscheint, begn&uuml;gt sich mit OS 1.3 und 1 MB RAM. Allein dies ist ein
untr&uuml;gliches Zeichen f&uuml;r die Absurdit&auml;t der oben erw&auml;hnten Behauptung.<P>
Laut der AMIGA-aktuell-Umfrage besitzen die allermeisten Anwender einen
AGA-AMIGA (meist A 1200), und zwar nicht mit nur 2 MB Chip-RAM, sondern in
der Regel mit einer mehr oder weniger gro&szlig;en "Portion" Fast-RAM, manchmal
sind sogar 32 MB oder mehr vorhanden. Der 68EC020 des A 1200 bzw 68EC030
des A 4000/030 sind kaum noch im Einsatz, sondern wurden durch
leistungsf&auml;higere Prozessoren (68030-060) auf Turbo- bzw. Prozessorkarten
ersetzt. Mittlerweile ist, wie ich wei&szlig;, bei einigen Lesern auch die PPC-
CPU 604e im Einsatz.<P>
Nach alldem wird auch nicht verwundern, da&szlig; eine Festplatte mittlerweile
praktisch zu einer "Pflicht-Hardware" geworden ist, auch CD-ROM-Laufwerke
erfreuen sich gro&szlig;er Beliebtheit. Beides ist bei Euch in den
unterschiedlichsten Kapazit&auml;ten bzw. Leistungsklassen vorhanden.
Auch ein Modem nennen die meisten AMIGA-aktuell-Leser ihr Eigen. Dies ist
jedoch auch kein Wunder, da der Hauptverbreitungsweg dieses Magazins ja das
Internet (Aminet, WWW-Homepage) ist.>P>
Schade fand ich dagegen, da&szlig; sich Grafikkarten offenbar immer noch nicht
entscheidend durchgesetzt haben. Dies hat unterschiedliche Gr&uuml;nde, von
denen in absehbarer Zeit jedoch mindestens zwei wegfallen werden:<P>
<UL>
<LI>Auch die Spielehersteller statten ihre Produkte zunehmend mit
Grafikkartenunterst&uuml;tzung aus. Endlich! mu&szlig; man sagen.
<LI>Zwei Hersteller (Ateo Concepts und phase 5 digital products) haben
Grafikkarten f&uuml;r den A 1200 angek&uuml;ndigt, die lediglich ein Towergeh&auml;use,
jedoch keine Zorro-Erweiterung ben&ouml;tigen, was f&uuml;r den Anwender niedrigere
Kosten bedeutet.
</UL><P>
Mit der noch geringen Grafikkarten-Verbreitung zusammenh&auml;ngend, besitzen
recht viele Anwender immer noch die Strahlenkanone 1084(S) oder ein
&auml;hnliches Festfrequenzmodell als Monitor.<P>
W&auml;hrend Drucker recht stark verbreitet sein werden (ich habe leider
vers&auml;umt, danach zu fragen...), und auch zus&auml;tzliche Diskettenlaufwerke
(teilweise auch f&uuml;r HD-Disketten) h&auml;ufig anzutreffen sind, ist manche
Hardware kaum bis gar nicht anzutreffen: Dazu geh&ouml;ren Soundkarten (auch das
wird sich allm&auml;hlich &auml;ndern), aber auch spezielle Hardware f&uuml;r Video usw.

<CENTER><BR><A HREF="0008.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0100.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

