<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>4. Spiele-News aus aller Welt</H1>
<UL>
<LI>Sadeness Software: Deal mit Weird Science und GTI<P>
Sadeness Software haben einen Deal mit den Distributoren Weird Science
und GTI geschlossen, der die weltweite Ver&ouml;ffentlichung der Spiele
Foundation und onEscapee erm&ouml;glicht, also spart schon mal, denn da kommen
zwei der besten AMIGA-Spiele der nahen Zukunft auf Euch zu. onEscapee soll
&uuml;brigens im November und Foundation im Dezember erscheinen.<P><BR>
<LI>neue Diversia-Screenshots<P>
Es wurden neue Screenshots des Command &amp; Conquer-Clones Diversia ver-
&ouml;ffentlicht, die fantastisch aussehen. Das Spiel von Ablaze Entertain-
ment, die vorher bereits das Beat Em Up Strangers programmierten, wird
&uuml;ber 256 Farben verf&uuml;gen und in verschiedenen Screenmodi spielbar sein.
Au&szlig;erdem wird es Network-Support haben, also Spielen &uuml;ber das Internet
erm&ouml;glichen. Systemvoraussetzungen f&uuml;r diesen potentiellen Hit sind
ein AMIGA mit 030-Prozessor, 4 MB Fast-RAM, OS 3.0 und ein 4x-CD-ROM-
Laufwerk. Grafikkarten werden unterst&uuml;tzt, auch eine Power PC-Kompatibi-
lit&auml;t ist geplant. Ein kompletter CD-Soundtrack rundet das Spiel ab.
Das Spiel ist zu 50 % fertig, ein Demo wird im Dezember oder Januar er-
h&auml;ltlich sein.
<IMG WIDTH=320 HEIGHT=256 SRC="diversia.jpg" ALT="diversia-screenshot">
<P><BR>
<LI>Hover-Bomber erstes GraKa-only spiel ?<P>
Aurora Works planen ihren bald erh&auml;ltlichen Bomberman-Clone als erstes
Spiel zu ver&ouml;ffentlichen, das den Besitz einer Grafikkarte voraussetzt.
Hauptgrund ist, da&szlig; AGA nicht erm&ouml;glicht, das Spiel in Screenmodes &uuml;ber
320x200 darzustellen. Dies ist auch Grund daf&uuml;r, da&szlig; der urspr&uuml;ngliche Ver-
&ouml;ffentlichungstermin September 1997 verpa&szlig;t wurde. Laut Programmierer wird
die (bedingt lauff&auml;hige) AGA-Version vielleicht sogar als Freeware
ver&ouml;ffentlicht, sobald die Grafikkartenversion erschienen ist. Ein heraus-
ragendes Feature des Spiels ist die M&ouml;glichkeit des Spielens &uuml;ber TCP/IP
und Modem. Das Spiel soll nun kurz vor Weihnachten auf CD-ROM erscheinen.<P><BR>
<LI>weitere Aurora Works-News<P>
Weitere Spiele auf der Release-Liste sind folgende: Als n&auml;chstes sollen
zwei Strategie-Spiele erscheinen, von denen eins ein Multiplayer-Weltraum-
Eroberungs-Spiel werden soll. Beide Spiele sollen Internet-Support haben
und im Gegensatz zu Hover Bomber auch auf AGA laufen. Ein weiterer Titel
von Aurora Works ist Betrayed, das Weihnachten 1998 erscheinen soll, und
ein PPC-only-Spiel wird.<P><BR>
<LI>Worms - Director's Cut-Patch<P>
Andy Davidson, Sch&ouml;pfer und Programmierer der Worms, hat trotz der Pro-
grammierung von Worms 2 f&uuml;r den PC die AMIGA-Fans nicht vergessen. Quasi
als Hobby hat er einen umfangreichen Patch f&uuml;r Worms - Director's Cut
programmiert, der demn&auml;chst im Aminet erscheinen wird. Vorbildliches
Verhalten dieser Art sollte Schule machen.<BR>
Worms - Director's Cut wurde &uuml;brigens nur ca. 5000 mal verkauft. F&uuml;r ein
Spiel dieser G&uuml;teklasse eine traurige Zahl.<P><BR>
<LI>Foundation<P>
Foundation, eins der am sehns&uuml;chtigsten erwarteten Spiele der AMIGA-Szene,
ist mittlerweile zu 86 % fertig. Bei 90 %, die sp&auml;testens im November er-
reicht werden m&uuml;&szlig;ten, gibt es eine Demo-Version des Strategie-Kn&uuml;llers.<P><BR>
<LI>Myst<P>
Myst soll nun endg&uuml;ltig sp&auml;testens bis zur Computer 97 erscheinen.<P><BR>
<LI>onEscapee<P>
Demn&auml;chst erscheint ein neues Demo des Spiels onEscapee. Das Demo wird
wahrscheinlich nur auf Cover CDs (CU AMIGA, AMIGA FORMAT) erscheinen, da
es ca. 50 MB gro&szlig; sein wird.<P><BR>
<LI>Alive MediaSoft<P>
Alive MediaSoft hat anscheinend Probleme mit der Konvertierung von Mac-
Spielen. Die Firma wollte Spiele wie Doom 2 und andere mit einem inte-
grierten Mac-Emulator zum AMIGA bringen. Das Problem ist das Copyright des
Mac-ROMs. Das Problem soll aber in K&uuml;rze gel&ouml;st werden.<P><BR>
<LI>Vulcan Software-News<P>
Vulcan Software gab bekannt, da&szlig; Beta-Versionen ihres Spiels Genetic
Species in illegalen Mailboxen und im Internet ver&ouml;ffentlicht wurden.
Zwei Namen von eventuellen T&auml;tern, von denen es jedoch nur einer war,
wurden au&szlig;erdem ver&ouml;ffentlicht. Ob das die feine Art ist ? Zumindest hat
jetzt eine der beiden Personen sehr wahrscheinlich zu Unrecht Ha&szlig;-E-Mails
aus aller Welt erhalten.<P>
Au&szlig;erdem sind bei Vulcan Software jetzt CD-ROM-Laufwerke erh&auml;ltlich. Es
handelt sich dabei um ein 4x-Laufwerk mit einem Squirrel-Interface, um es
an einen A600 oder A1200 anschlie&szlig;en zu k&ouml;nnen. Das Paket soll sage und
schreibe 150 Pfund (incl. Porto) kosten, also 450 DM. Bedenkt man, da&szlig;
der Squirrel-Controller in Deutschland f&uuml;r weit unter 200 DM erh&auml;ltlich
ist, wird wohl kaum ein vern&uuml;nftiger Mensch ein 4x-CD-ROM-Laufwerk f&uuml;r
&uuml;ber 250 DM kaufen.<P>
Auch Vulcan Software hat eine Allianz mit Weird Science und GTI gebildet.
Weird Science und GTI &uuml;bernehmen die weltweite Distribution aller Vulcan-
Produkte. Vulcan Software werden ihren eigenen Vertrieb durch diesen Deal
einstellen, und konzentrieren ihre ganze Kraft nun auf die Entwicklung der
Spiele. Vulcan hat inzwischen 14 Teams mit 100 Entwicklern unter Vertrag.<P>
Vulcan hat einen Vertrag mit The World Foundry unterschrieben, der die
Ver&ouml;ffentlichung der beiden potentiellen Hits Explorer 2260 und Maim &amp;
Mangle bei Vulcan vorsieht.<P>
The Final Odyssey und Uropa 2 sollen nun am 1. November erscheinen.<P><BR>
<LI>APC &amp; TCP-News<P>
Die aktuelle Release-Liste von APC &amp; TCP sieht folgende Titel vor:<BR>
<UL><LI>Pinball Brain Damage (11/97) (Preview in dieser Ausgabe)
<LI>Pulsator (2/98)
<LI>Adventure-Shop (3/98)
<LI>Phoenix (3/98)
<LI>Daydream (1998)
<LI>Escape from Atlantis (1998)
<LI>Hotelmanager (1998)
<LI>Marblelous 2 (1998)
<LI>Skaut (1998)
<LI>Skimmers (1998) (Preview in dieser Ausgabe)
<LI>Testament 2 (1998)
<LI>Westerados (1998)
<LI>Magic Island (?)
</UL><P>
Von Phoenix sind neue Screenshots erschienen, die hervorragend aussehen.
Bei Phoenix handelt es sich um eine genre&uuml;bergreifende Mischung aus Action
Strategie und Handelssimulation. Dank Grafikkartenunterst&uuml;tzung sollten
auch aufger&uuml;stete AMIGA-Spieler in den Bann des potentiellen Hits gezogen
werden.
<IMG WIDTH=320 HEIGHT=200 SRC="Phoenix.jpg" ALT="phoenix screenshot">
<P><BR>
<LI>Titan Computer<P>
The Shadow of the third Moon ist erschienen. Einen Test der ersten Flug-
simulation mit Voxelengine wird es in der n&auml;chsten Ausgabe von AMIGA AGPJ
geben. Systemvoraussetzungen sind ein 68030-Prozessor, AGA, 4MB RAM, HD und
CD-ROM-Laufwerk. Cybergfx wird unterst&uuml;tzt. Eine neue Demoversion wird
ebenfalls in K&uuml;rze erscheinen.<P>
Weiterhin erscheinen bei Titan demn&auml;chst Evils Doom, Sword (Preview in der
letzten Ausgabe von AMIGA AGPJ) und Brainkiller (Preview in dieser Ausga-
be). In Gro&szlig;britannien werden die Titan Computer-Produkte jetzt von
Blittersoft vertrieben. Titan Computer hat &uuml;brigens auch einen Stand auf
der Computer '97: Halle 11.1 Stand B52.<P><BR>
<LI>The Child of Darkness<P>
The Child of Darkness ist ein neues Rollenspiel vom neu gebildeten Team
Desktop Corruption. Es wird ein Mix eines Spiels im Stile von Zelda und
eines Beat Em Ups sein und &uuml;ber animierte Zwischensequenzen im Manga-Stil
verf&uuml;gen.<P><BR>
<LI>Clickboom-Wishlist-Ergebnisse<P>
F&uuml;r alle, die sie noch nicht kennen, sind hier (etwas sp&auml;t) die Ergebnisse
der Clickboom-Wishlist-Aktion, bei der man seine Wunschspiele f&uuml;r eine
Amiga-Umsetzung w&auml;hlen konnte. Welches Spiel wirklich umgesetzt wird,
steht nat&uuml;rlich in den Sternen, allerdings mehren sich die Ger&uuml;chte, nach
denen Clickboom an einer Umsetzung von Quake arbeitet. Zumindest bekamen
Personen, die eine Version des nicht ganz legalen AmiQuake zum Download
bereithielten, eine E-Mail von Clickboom, mit der Aufforderung dies zu
unterlassen. Auch die amerikanische Zeitschrift "Amazing Computing" be-
richtete von einer feststehenden Konvertierung. Allerdings wurde keine
Firma genannt.
<PRE>
 1. Monkey Island 3                1612
 2. Quake                          1482
 3. Command &amp; Conquer 2: Red Alert 1319
 4. Die Siedler 2                  1006
 5. Diablo                          937
 6. Tomb Raider                     912
 7. Civilization 2                  877
 8. Grand Prix 2                    843
 9. X-wing vs. Tie-Fighter          751
10. Duke Nukem 3D                   682
11. Warcraft 2                      648
12. Command &amp; Conquer               628
13. Simon the Sorcerer 2            462
14. Wing Commander 2-4              398
15. Wipeout                         384
16. Need for Speed                  317
17. Mechwarrior                     283
18. Tekken                          262
19. Resident Evil                   249
20. Theme Hospital                  231
21. MDK                             182
22. Ultima VIII                     180
22. Dark Forces                     180
24. Daytona                         165
25. 3D Lemmings                     158
26. Indy Car Racing 2               157
27. Battle Isle 2                   154
28. Doom                            152
29. NHL 97                          143
30. Descent                         140
31. Screamer 2                      139
32. 7th Guest                       138
33. MK 3                            123
34. Fifa                            116
35. Albion                           92
36. Battle Arena Toshinden           88
37. Heroes of the Might &amp; Magic 2    85
38. Earthworm Jim                    80
39. Virtua Fighter                   79
40. Putty Squad                      52
</PRE><P><BR>
<LI>Hurricane Software<P>
Hurricane Software ist ein neues Team von Entwicklern, das vier AMIGA-
Titel plant. Escape towards the Unknown wird ein Adventure im Stile von
Monkey Island, das im Februar 1998 in sage und schreibe vier Versionen
erscheinen soll: eine f&uuml;r 680x0-Prozessoren, eine f&uuml;r PowerPC-Prozesso-
ren, eine f&uuml;r Rechner mit p.OS und eine f&uuml;r Grafikkarten. Der zweite ange-
k&uuml;ndigte Titel ist ein Fu&szlig;ballspiel namens "Eat the Whistle".<P>
<LI>Skillo Interactive<P>
Ein weiteres neues Entwickler-Team ist Skillo Interactive. Zwei Spiele
sollen demn&auml;chst von Skillo ver&ouml;ffentlicht werden. Radioaction ist ein
Pseudo-3D-Shoot Em Up, bei dem man mit einem Raumschiff in die Tiefe des
Raumes fliegt und diverse B&ouml;sewichte beseitigt. Erste Screenshots sehen
hervorragend aus. Das zweite Spiel hei&szlig;t Martian Tales und wird ein Spiel
wie Warcraft II. Ein weiterer Titel von Skillo wird KRUD TV hei&szlig;en, bei
dem es sich scheinbar um die Simulation eines TV-Senders handelt.
Skillo suchen auch noch Firmen, die ihre Spiele vertreiben wollen.<P><BR>
<LI>EuroFighter 2000<P>
Laut des italienischen Magazins "The Games Machine" plant ein italieni-
sches Entwicklerteam die Umsetzung des TFX-Nachfolgers EuroFighter 2000
f&uuml;r den AMIGA. Das Spiel soll angeblich ein PPC-only-Release werden.<P><BR>
<LI>Oxyron Software<P>
Nachdem Trapped 2 inzwischen erschienen ist, haben die Programmierer des
Spiels, Oyron Software zwar keine Pl&auml;ne f&uuml;r ein drittes Trapped, ein wei-
teres Spiel f&uuml;r den AMIGA ist jedoch geplant.<P><BR>
<LI>Aphasia<P>
Aphasia ist ein neues Shoot Em Up, das allerdings fr&uuml;hestens Anfang 1998
erscheinen wird. Es wird &uuml;ber 6 horizontal oder vertikal scrollende Level
verf&uuml;gen. Au&szlig;erdem gibt es Licht- und Schatteneffekte und Sprachausgabe.<P><BR>
<LI>Delta 4<P>
Delta 4 von Hellbound Software wird ein Adventure, das in der Zukunft
spielt. Als Sicherheitschef einer Raumstation mu&szlig; man alle Polizeiopera-
tionen leiten. Die ersten Screenshots sehen nicht schlecht aus, sollen
aber noch einmal &uuml;berarbeitet werden.<P>
<CENTER><BR><A HREF="0203.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0205.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

