<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">

<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>6. Previews</H1>

<UL>
<LI>Brainkiller (Titan Computer) (erscheint Ende 1997)<P>
Brainkiller ist der neueste Versuch, einen brauchbaren Doom-Clone zu pro-
grammieren. Nat&uuml;rlich kann auch dieses Spiel grafisch nicht mit PC-Varia-
tionen des Genres wie Quake oder Duke Nukem 3D (beide indiziert) mithalten.<BR>
Und doch macht die Demo-Version Lust auf mehr. Die 3D-Engine l&auml;uft auf ei-
nem 68030/50Mhz extrem fl&uuml;ssig.  Als Agent Clint Morgan k&auml;mpft der Spieler
sich durch 15 Level und bef&ouml;rdert dabei diverse Cyborgs ins Jenseits.<BR>
Diverse Special-Effects, wie Wasser- Licht- und Schatteneffekte und eine Un-
terst&uuml;tzung von Grafikkarten wird Brainkiller zu einem Leckerbissen zumin-
dest f&uuml;r alle Freunde eines gepflegten Actionspiels werden lassen.<BR>In den
Genu&szlig; von Brainkiller kommen zwar nur Besitzer eines Rechners mit mind.
68020-Prozessor, 2 MB Chip RAM, 4 MB Fast RAM und einer Hard Disk, aber
diese Systemvoraussetzungen sollten ja mittlerweile Standard sein.<BR>
Ein angek&uuml;ndigter 2-Spieler-Modus mit Nullmodemkabel oder TCP/IP rundet
den guten Eindruck der Demo-Version ab, die auf der Homepage von Titan
Computer erh&auml;ltlich ist.<P><BR>
<LI>Gloom 3 - Zombie Edition (Guildhall Leisure + Epic) (erscheint Weihnachten 1997)<P>
Gloom 3 ist die Fortsetzung von Gloom und Gloom Deluxe. Der Begriff Fort-
setzung trifft es aber nicht genau.<BR>Gloom 3 wurde von neuen Programmierern
entwickelt. Leider sieht das Spiel nicht sehr gelungen aus. Die Grafik ist
etwas zu einfach, zu wenige Farben wurden verwendet. Zwar scrollt das Spiel
halbwegs fl&uuml;ssig, je nach Prozessor und Aufl&ouml;sung, aber die wenigen Farben
lassen das Spiel nicht sehr gut aussehen.<BR>Auch das Leveldesign l&auml;&szlig;t zu
w&uuml;nschen &uuml;brig, so kommen hinter fast jeder Ecke einige Feinde hervor, die
je nach Level verschieden aussehen, es fehlt aber etwas die Abwechslung.
Wenn das Spiel so ver&ouml;ffentlicht wird, d&uuml;rfte es nicht die meisten Fans
finden, andere Spiele, z.B. auch die beiden Vorg&auml;nger oder das Demo von
Brainkiller machen mehr Spa&szlig;.<P><BR>
<LI>Pinball Brain Damage (APC &amp; TCP / Islona) (erscheint im November 1997)<P>
Das Spiel Pinball Brain Damage machte schon im letzten Jahr Furore, nach-
dem ein selbstablaufendes Demo im Aminet auftauchte. Nun, da das erste
spielbare Demo des Spiels vorliegt, werden die hervorragenden Eindr&uuml;cke
best&auml;tigt. Besonders das brilliante Intro, sowie Zwischensequenzen, wie
die Animation im Hintergrund des Options-Screens sehen fantastisch aus.<BR>
Das Spiel selbst sieht ebenfalls sehr gut aus: Scrolling der fl&uuml;ssigsten
Art. Einen Kritikpunkt gibt es aber auch: das Design der Tische. Sie
spielen sich etwas langweiliger als bekannte Vorg&auml;nger des Flipper-Genres
wie Slam Tilt, oder andere. Bekommt man dieses Problem noch in den Griff
und verbessert das Tischdesign etwas mehr in Richtung Spielspa&szlig;, steht
einem weiteren Klassiker des Pinball-Genres auf dem Amiga nichts im Wege.<P><BR>
<LI>Sixth Sense Investigations (Islona) (erscheint im Oktober 1997)<P>
Sixth Sense Investigations ist ein Grafikadventure im Stil von Monkey
Island und &auml;hnlichen Spielen. Auff&auml;llig ist besonders die Cartoon-artige
Grafik, die zwar etwas einfach aussieht, aber ihren Dienst gut erf&uuml;llt.
Man spielt die Rolle eines Privatdetektivs, der gleich zu Beginn einen
Anruf &uuml;ber einen &Uuml;berfall in einem K&auml;se-Gesch&auml;ft erh&auml;lt. Besonders gelun-
gen ist die Spielbarkeit, die Steuerung ist einfach und logisch, und die
Grafik scrollt fl&uuml;ssig, auch die Charaktere sind gut animiert. Die Voll-
version wird &uuml;ber animierte Intros und drei zu entdeckende Welten ver-
f&uuml;gen. Alle Fans von Grafik-Adventures sollten sich dieses Demo unbedingt
ansehen, Sixth Sense Investigations k&ouml;nnte ein Hit werden.</UL><P><BR>

<CENTER><BR><A HREF="0205.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0207.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

