<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 10/97 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>Mo, 29.09.97:</H1><H2 ALIGN=CENTER>Haage&amp;Partner informiert auf seiner WWW-Seite &uuml;ber WarpUp</H2>
&#171;WarpUP<P>
The real speed is warp speed!<BR>
Ein Hochgeschwindigkeits-Kernel f&uuml;r PowerUP<P>
Es ist soweit. Der Amiga hat seinen PowerPC. Wir alle sind der Firma Phase5
zu gro&szlig;em Dank verpflichtet. Denn sie waren es, die die Prozessordiskussion
in die richtige Richtung gelenkt haben. Mit ihren PowerUP¨-Boards sorgen
sie daf&uuml;r, da&szlig; der Amiga den Anschlu&szlig; an die Spitze der Technologie
wiederfindet.<P>
Die PowerPC-Technologie bietet f&uuml;r die Zukunft ein H&ouml;chstma&szlig; an Sicherheit.
Getreu dem Motto  NO RISC NO FUN" hat Motorola bereits den Schritt
vollzogen, der den Intel-Prozessoren noch bevorsteht. Durch diese
Entscheidung sind bereits heute Prozessoren mit bis zu 350MHz Taktfrequenz
verf&uuml;gbar. Ein Ende ist dabei noch nicht abzusehen.<P>
Die Hardware-Entwicklung ist dabei nur eine Seite. Ohne die entsprechende
Software ist eine noch so gute Hardware nur wenig wert. Die gr&ouml;&szlig;te Last
tragen zur Zeit die Softwarehersteller auf der ganzen Welt. Sie plagen sich
mit der Frage, ob eine Umsetzung ihrer Software lohnend ist oder nicht.Denn
der Umstieg auf einen neuen Prozessor bedeutet die Umstellung und Wartung
der Software f&uuml;r zwei verschiedene Prozessortypen. Viele Hersteller warten
daher trotz vielversprechender Ank&uuml;ndigungen ab und beobachten den Markt,
bevor sie mit der Portierung beginnen.<P>
Die Erleichterung f&uuml;r die richtige Entscheidung ist eine
Software-Schnittstelle zur Hardware, die garantiert, da&szlig; auch zuk&uuml;nftige
Hardware-Entwicklungen, seien es neue PowerPC-Boards von Drittanbietern
oder ein PowerPC-Amiga von Amiga International Inc., ohne Umstellung der
Software, genutzt werden k&ouml;nnen. Und genau das bietet das WarpOS, das von
unseren Autoren Sam Jordan, Michael Rock und Jochen Becher auf den
Dualprozessor-Boards von Phase 5 entwickelt wurde.<P>
Durch einen sogenannten Hardware-Abstraction-Layer (HAL) wird mit WarpUP
eine Schicht zwischen Hardware und Anwender-Applikationen gelegt, die es
garantiert, da&szlig; auf unterschiedlichen PowerPC-Konzepten die
Anwender-Applikationen unver&auml;ndert bleiben k&ouml;nnen. F&uuml;r jeden
Softwarehersteller bedeutet das den risikofreien Startschu&szlig; in eine neue
&Auml;ra der Software-Entwicklung auf dem Amiga.<P>
WarpUP bildet die Schnittstelle zwischen 68K-, PowerPC-Hardware, der
68K-Betriebssystemsoftware und den Anwender-Applikationen. Im Vordergrund
steht dabei die optimale Ausnutzung der Geschwindigkeit des
PowerPC-Prozessors trotz besonders einfacher Umsetzbarkeit von
Applikationen. WarpUP erm&ouml;glicht erstmals auf dem Amiga den Einatz reiner
PowerPC-Applikationen sowie auch von Mixed- und Fat-Binaries Applikationen
und Shared-Libraries.<P>
Das C/C++ Entwicklungssystem StormC bietet die M&ouml;glichkeit, mit einem
einfachen Compilerschalter eine AmigaOS-Applikation f&uuml;r den PowerPC nativ
zu kompilieren. Um den n&ouml;tigen Wechsel zwischen 68K-AmigaOS und den
PowerPC-Funktionen k&uuml;mmert sich der WarpOS-Kern in WarpUP.Ein f&uuml;r
Software-Entwickler unsch&auml;tzbarer Vorteil. Denn in den meisten F&auml;llen
bringt bereits eine direkte Umsetzung der Software einen ausreichenden
Geschwindigkeitsvorteil. Eine konzeptionelle &Auml;nderung der Software ist nur
dann notwendig, wenn auch das letzte Qu&auml;ntchen Geschwindigkeit
herausgekitzelt werden soll.<P><BR>
WarpUP bietet Ihnen die folgenden Vorteile:<P>
<UL>
<LI>Hochgeschwindigkeits-Kommunikations-Schnittstelle zwischen 68K- und
PowerPC-Prozessor.
<LI>Komplett natives Multitasking, native Speicherverwaltung, Semaphoren,
Listen/Tagverwaltung, Signalisierung, Messageverwaltung.
<LI>Fakultativer Speicherschutz: Tasks erhalten die M&ouml;glichkeit, gesch&auml;tzten
Speicher zu allozieren.
<LI>Virtuelle Signale, d.h. Signale sind CPU-Shared und werden immer zur
richtigen CPU umgeleitet.
<LI>Inter-CPU Message-System: Es k&ouml;nnen Nachrichten zwischen den CPUs
versendet werden. Optimaler Einsatz der PPC-MMU und des PPC-Cache.
<LI>MMU/Exceptionhandling-Support f&uuml;r Applikationen
<LI>Stromspar-Funktion, wenn keine Applikationen laufen.
<LI>PowerPC-Enforcer (Schutz der ersten Page)
<LI>Ausf&uuml;hrlicher Absturzrequester, welcher den Entwickler optimal bei der
Fehlersuche unterst&uuml;tzt.
<LI>Integriertes Debugging-System zur Vereinfachung der Fehlersuche.
<LI>Spezieller Support f&uuml;r hochoptimierte Software wie Spiele und Demos.
<LI>Unterst&uuml;tzung f&uuml;r amigakonforme Applikationen.
<LI>PowerPC native, Mixed- und Fat-Binaries Applikationen und
Shared-Libraries.
<LI>Direkt nutzbar f&uuml;r alternative Entwicklungssysteme wie Modula- oder
E-Compiler mit PowerPC-Unterst&uuml;tzung, da nicht zwangsl&auml;ufig ELF-Objekte
erzeugt werden m&uuml;ssen, sondern das bew&auml;hrte, Amiga-konforme Hunk-Format
eingesetzt werden kann.
<LI>Einfachste Installation
<LI>Hardwareunabh&auml;ngig
<LI>Zukunftskompatibel
</UL><BR><BR>
Und das Beste zum Schlu&szlig;:<P>
WarpUP ist kostenfrei &uuml;ber HAAGE&amp;PARTNER zu beziehen!
Lediglich die Telefonkosten m&uuml;ssen Sie selbst tragen.<P>
Download!<P>
Das ist unser Beitrag f&uuml;r eine aussichtsreiche Amiga-Zukunft.<P><BR>
Weiter Informationen erhalten Sie bei:<P>
<A HREF="http://www.haage-partner.com">HAAGE&amp;PARTNER Computer GmbH</A><BR>
Postfach 80<BR>
D 61188 Rosbach<P>
Tel.: ++49 6007 930050<BR>
Fax : ++49 6007 7543<P>
E-Mail: <A HREF="warpup@haage-partner.com">warpup@haage-partner.com</A>&#187;
<CENTER><BR><A HREF="0405.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0407.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

