<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 10/97 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>Mo, 6.10.97:</H1><H2 ALIGN=CENTER>Haage&amp;Partner reagiert auf Wolf Dietrichs Statement</H2>
&#171;WarpUP - Die Stellungnahme<P>
<B>Die Philosophie der Amiga-konformen Software-Entwicklung</B><P>
Als Hersteller des StormC-Entwicklungssystems haben wir immer die
Bestrebung, alle wichtigen Amiga-Entwicklungen mit unserem
Entwicklungssystem zu unterst&uuml;tzen.Unsere Philosophie bei unseren
Umsetzungen ist es, den Entwicklern ein Werkzeug an die Hand zu geben, das
es erm&ouml;glicht, mit weitgehend geringem Aufwand die beste L&ouml;sung zu
erzielen. Einen ersten Schritt in diese Richtung demonstrieren wir mit
unserer Entwicklung von StormWIZARD f&uuml;r AmigaOS und p.OS und mit der
p.OS-Unterst&uuml;tzung durch StormC.Entwickler, die StormC und StormWIZARD
nutzen, haben es sehr einfach mit geringem Aufwand f&uuml;r beide Plattformen
ein identisches Erscheinungsbild f&uuml;r ihre Software zu schaffen.
Wirtschaftlich betrachtet ist das ein sehr wichtiger Faktor. Aber
alternative Betriebssysteme sind nur eine Entwicklungsrichtung und ein
neuer Prozessortyp eine ganz andere und wesentlich komplexere
Angelegenheit.<P>
In knapp 2-j&auml;hriger Entwicklungszeit haben wir den n&auml;chsten Schritt
vollzogen und eine Hardware-unabh&auml;ngige
PowerPC-Unterst&uuml;tzungfertiggestellt. Die L&ouml;sung, mit dem Namen WarpUP wurde
am 26.09.97 auf unserer Homepage im Internet und am 28.09. auf dem
Amiga-Treffen in Hof der &Ouml;ffentlichkeit vorgestellt. Die L&ouml;sung wurde kurz
zuvor, am 26.09. auch bei Phase 5 vorgef&uuml;hrt, denn wir waren und sind der
Meinung, hiermit einen wertvollen Beitrag zur Unterst&uuml;tzung der
PowerPC-Plattform zu leisten. Bei Phase 5 ist man jedoch offensichtlich
nicht dieser Meinung und ver&ouml;ffentlichte am 28.09. ein sehr emotionales
Schreiben, in dem die Aufl&ouml;sungen der Zusammenarbeit angek&uuml;ndigt und
L&ouml;sungen wie WarpUP und StormC als unbrauchbar bezeichnet wurden.<P>
Reaktionen wie diese von Phase 5 sind jedoch sehr unproduktiv. Sie bringen
den gerade wieder neu belebten Amiga-Markt durcheinander und helfen weder
den Amiga-Firmen noch den Amiga-Anwendern. Die Angriffe seitens Phase 5
gegen unser WarpUP-Paket sind unserer Meinung nach eine un&uuml;berlegte
&Uuml;berreaktion. Entgegen der Darstellung durch Phase 5 besteht unser Paket
sowohl aus einer zur Phase 5 L&ouml;sung kompatiblen als auch aus einer
alternativen L&ouml;sung. Der Anwender hat hier die Entscheidung, welche L&ouml;sung
er bevorzugt. Die kompatible L&ouml;sung war bei Phase 5 immer bekannt und wurde
auch geduldet, um so unverst&auml;ndlicher ist f&uuml;r uns deren angek&uuml;ndigte Absage
einer weiteren Unterst&uuml;tzung und die Herstellung einer absichtlichen
Inkompatibilit&auml;t zu unserer L&ouml;sung.<P>
Statt dem konsequenten Ausschlu&szlig; einer Softwarel&ouml;sung mu&szlig; dem Anwender die
M&ouml;glichkeit geboten werden, durch Ausprobieren eigene Erfahrungen zu
sammeln und gemeinsam vern&uuml;nftig &uuml;ber Vor- und Nachteile aller
M&ouml;glichkeiten zu diskutieren. Wer diese Freiheit verwehrt, zeigt
diktatorische Z&uuml;ge mit dem Hintergrund, sich vor Konkurrenz zu sch&uuml;tzen.<P>
Wir bieten allen interessierten Anwendern und Entwicklern Einblick in
unsere Entwicklung. Das komplette Archiv mit Demoprogrammen, die auch auf
einem 68K-Amiga (ab 040er) lauff&auml;hig sind und einer bereits vielfach
gelobten Dokumentation, die von allen selbst beurteilt werden kann, stellen
wir auf unserem FTP-Server kostenfrei zur Verf&uuml;gung.Unsere Entwicklung
zeigt eindrucksvoll, da&szlig; keine Notwendigkeit dazu besteht, ein neues
Executable-Format oder Verfahren zur dynamischen Anbindung von Bibliotheken
zu schaffen. Das Amiga-Betriebssystem bietet seit jeher alle Eigenschaften,
die ben&ouml;tigt werden, um neue Prozessortypen zusammen mit oder ohne dem
vorhandenen 68K-Prozessor zu nutzen.<P>
Die Hinweise seitens Phase 5 zur Einf&uuml;hrung solcher neuen Techniken f&uuml;r
neue OS-Versionen m&uuml;ssen Sie als aufmerksamen Leser unverkennbar von deren
Absichten &uuml;berzeugen, in naher Zukunft das AmigaOS durch eine eigene
Entwicklung abzul&ouml;sen. Die Rechte zur Weiterentwicklung des
Amiga-Betriebssystems liegen bei Amiga International, die diese mit
Sicherheit nicht f&uuml;r eine abweichende Entwicklung aus der Hand geben
werden.<P>
Bei allen notwendigen Diskussionen zur Schaffung einer standardisierten
PowerPC-Schnittstelle f&uuml;r das AmigaOS darf nie vergessen werden, da&szlig; es die
Anwender sind, die unseren Amiga am Leben erhalten und keine einzelne Hard-
oder Software-Firma. Am Ende der Diskussion mu&szlig; es also hei&szlig;en:<P>
"Und die Gewinner sind: Die Amiga-Anwender".<P>
Im folgenden Text finden Sie einen tieferen und technischeren Einblick in
den Verlauf unserer Entwicklung von WarpUP und StormC f&uuml;r den PowerPC.<P><BR>
<B>Die Entwicklungsgeschichte von WarpUP</B><P>
Zur Computer 95 in K&ouml;ln vor fast zwei Jahren k&uuml;ndigte damals noch Amiga
Technologies neue Amiga Modelle auf der Basis von PowerPC-Prozessoren an.
Zeitgleich ver&ouml;ffentlichte Phase 5 auch erste Mitteilungen &uuml;ber das
Erscheinen von PowerPC-Turboboards f&uuml;r alle bereits im Markt verf&uuml;gbaren
Amiga-Modelle. F&uuml;r uns war das die Entscheidung, auch unser
Entwicklungssystem PowerPC-tauglich zu machen.<P>
Die Entwicklung an StormC-PowerPC begann im M&auml;rz 1996 direkt nach der
CeBit. Die Konzepte, die wir uns damals erarbeiteten, sahen vor, so nah wie
m&ouml;glich am Betriebssystem AmigaOS festzuhalten, was kein Problem
darstellte. Wir kamen daher nie auf den Gedanken, ein ver&auml;ndertes
Executable-Format zu nutzen, schon gar nicht ohne offizielle Entscheidung
der damaligen Eigner aller Rechte am Betriebssystem. Unsere Konzeption sah
auch vor, schnell auf m&ouml;gliche Ver&auml;nderungen im OS und dessen
Applikationsschnittstelle reagieren zu k&ouml;nnen, um den Software-Entwicklern
komplizierte Umarbeitungsarbeiten zu ersparen.<P>
Leider geriet Amiga Technologies in dieser Zeit ein zweites Mal ins
Straucheln, was sich auch durch die zun&auml;chst solvent pr&auml;sentierte Firma
Viscorp nicht ver&auml;nderte. Ein Beginn der Weiterentwicklung des
Betriebssystems und der Bau der lange erwarteten PowerPC-Amigas blieb
aus.Ebenfalls ausgeblieben ist daher die Definition der Richtlinien der
Schnittstelle f&uuml;r PowerPC-Amiga-Applikationen. Wir lie&szlig;en uns dennoch nicht
beirren und entwickelten Amiga-konform weiter, da unsere L&ouml;sung keine
Ver&auml;nderung des bestehenden Betriebssystems voraussetzte.<P>
Durch die Ank&uuml;ndigung von Phase5, ein Dualprozessorboard mit einem 68K und
einem PowerPC im parallelen Betrieb zu bauen, ergab sich die dringende
Notwendigkeit sogenannte Mixed-Binaries zu unterst&uuml;tzen. Diese Programmform
enth&auml;lt in einem Programm sowohl 68K- wie auch PPC-Code.<P>
Im optimalen Fall ist es f&uuml;r den Entwickler eines Programms v&ouml;llig
irrelevant, welche Teile des Programms in welcher Codeform vorliegen. Der
Zugriff auf Daten (z.B. globale Variablen) ist problemlos durch beide
Prozessoren m&ouml;glich, der Wechsel von einem Prozessor auf den anderen
geschieht vollautomatisch, ohne zus&auml;tzliche Programmierung.<P>
Der Entwickler entscheidet nur, welcher Programmteil sinnvollerweise auf
dem PPC arbeitet (z.B. der Raytracer-Kern oder Konvertierungsfunktionen f&uuml;r
Graphikformate etc.) und welche Teile in 68K bleiben (z.B. die Ansteuerung
der graphischen Benutzeroberfl&auml;che). Dabei sollte es auch wenig st&ouml;ren,
wenn diese Codeteile eng verzahnt sind, d.h. gemeinsame Variablen und
Datenstrukturen benutzen, R&uuml;ckspr&uuml;nge aus dem einen Teil in den anderen
&uuml;ber sogenannte Funktionspointer erfolgen etc.<P>
Zu unserer &Uuml;berraschung w&auml;hlte Phase5 mit der Nutzung des ELF Formats einen
Weg, der diese dringend notwendigen (und von Phase5 sogar empfohlenen)
Mixed-Binaries zu einer Qual f&uuml;r den Programmierer macht:<P>
<UL>
<LI>Der PPC Programmteil mu&szlig; manuell nachgeladen werden;
<LI>Nutzung gemeinsamer globaler Variablen ist nicht m&ouml;glich;
<LI>Datenstrukturen werden von den g&auml;ngigen 68K Compilern anders
interpretiert als vom GNU-C f&uuml;r PPC und k&ouml;nnen deshalb nicht gemeinsam
genutzt werden;
<LI>R&uuml;ckspr&uuml;nge &uuml;ber Funktionspointer oder auch normale Wechsel von einer
CPU auf die andere m&uuml;ssen manuell programmiert werden.
</UL><BR>
Alles in allem ist es ein sehr langer Weg, ein existierendes AmigaOS
Programm auf die Phase5 L&ouml;sung zu portieren. Nicht umsonst konnte - trotz
fast einj&auml;hriger Vorlaufzeit mit Hilfe der speziellen PPC-Developerboards,
die an einige ausgesuchte Entwickler vergeben wurden - bislang keine
gr&ouml;&szlig;ere Applikation portiert werden.<P>
WarpOS und StormC erreichen jedoch nach nun fast 18-monatiger
Entwicklungszeit genau diese optimale Strategie der Erstellung von
Mixed-Binaries. Der Entwickler zerlegt sein Programm in einen 68K- und
einen PowerPC-Teil, im einfachsten Fall durch Einteilung der Programmodule
(C-Quelltexte) in die jeweilige Kategorie, im aufwendigsten Fall durch
Zerlegung einzelner Programmodule in jeweils zwei neue (f&uuml;r 68K- und
PPC-Code). Dann mu&szlig; nur noch neu kompilieren werden und schon hat man das
fertige Programm. StormC und StormLink &uuml;bernehmen den ganzen Rest. Aus den
68K- und PPC-Teilen wird ein einziges Executable erzeugt, d.h. ein
Nachladen der PPC-Programteile entf&auml;llt. Durch den gemeinsamen Zugriff auf
globale Variablen und die kompatible Interpetation der Datenstrukturen
durch den 68K- und PPC-Code mu&szlig; am Quelltext nicht eine Zeile ge&auml;ndert
werden. Kontextwechsel von einer auf die andere CPU werden vollautomatisch
generiert, der Programmierer mu&szlig; nicht einmal wissen, wo genau dieser
Kontextwechsel stattfindet.<P>
Mitte Oktober vergangenen Jahres war es dann soweit. Phase 5 &uuml;berlie&szlig; uns
zwei PowerPC-Entwicklerboards und eine sehr rudiment&auml;re
Software-Schnittstelle zum PowerUP-Board. Trotz der Einfachheit der
Softwareschnittstelle wich sie von unseren und damit von den
Amiga-konformen Konzepten soweit ab, so da&szlig; wir bereits zu Beginn der
praktischen Entwicklung mit Wissen von Phase 5 unseren eigenen Weg gehen
mu&szlig;ten, um die Konzeption des AmigaOS aufrecht zu erhalten. Es war zwar
nicht der von Phase 5 vorgeschlagene, aber ein m&ouml;glicher und flexibler Weg
und man hatte dagegen vorerst nichts einzuwenden.<P>
Bereits auf der Computer 96 zeigten wir erste Entwicklungen mit StormC und
StormPowerASM, die auf dem bew&auml;hrten Amiga Hunkformat basierten und
tadellos funktionierten.<P>
In der Praxis stellte sich sehr schnell heraus, da&szlig; die Geschwindigkeit des
PowerPCs gar nicht so deutlich zu sp&uuml;ren war wie wir erwartet hatten, was
an den kompliziert zu handhabenden AmigaOS-Aufrufen lag, bedingt durch die
Dualprozessortechnologie, die Phase 5 einsetzt. Pro Funktionsaufruf ist es
n&ouml;tig, einen Kontextwechsel zur 68K CPU zu machen, die
68K-Betriebssystemfunktion auszuf&uuml;hren und mit einem weiteren
Kontextwechsel zum PowerPC-Programm zur&uuml;ckzukkehren. Bei jedem Wechsel ist
selbstverst&auml;ndlich ein leeren des Daten-Cache n&ouml;tig, das erneut sehr viel
Zeit verschlingt.Nach unserem Verst&auml;ndnis w&auml;re eine Beschleunigung des
Kontextswitch mit einer Erweiterung der Hardware l&ouml;sbar gewesen. Bei Phase
5 stie&szlig; unser Vorschlag jedoch auf taube Ohren, wor&uuml;ber wir uns nur wundern
konnten. Gleichzeitig baten wir darum, tieferen Einblick in die
Hardware-Eigenschaften zu bekommen, um bei der L&ouml;sung der Problematik
behilflich zu sein.Diese Bitte nach der Offenlegung der
Hardware-Beschreibung wurde, wie auch alle weiteren Bitten, mit dem Hinweis
abgelehnt, da&szlig; durch Phase 5 jederzeit Hardware-&Auml;nderungen gemacht werden
k&ouml;nnten, die dann nicht mehr funktionieren w&uuml;rden. Dann w&uuml;rde Software, die
direkt auf die Hardware abgestimmt w&auml;re, nicht mehr funktionieren.
Lediglich bei ihrer eigens entwickelten Software w&auml;re es garantiert, da&szlig;
eine sofortige Anpassung stattfinden kann. F&uuml;r uns als Software-Hersteller
war das eine unbefriedigende Antwort, macht man damit lediglich klar, da&szlig;
auch die Software-Seite monopolistisch &uuml;berwacht werden soll, um
Konkurrenten fernzuhalten.<P>
Wir hatten bereits damals die Vermutung, da&szlig; Phase 5 dieses Argumentation
nutzen wird, um ungewollte Entwicklungen diskussionslos zu verdr&auml;ngen.Wir
sind daher auch wenig &uuml;berrascht &uuml;ber die diktatorischen Ma&szlig;nahmen von
Phase 5, die jetzt gegen unsere Entwicklung angek&uuml;ndigt wurden.<P>
Noch im Dezember vergangenen Jahres erarbeitete unser Entwicklerteam, allen
voran Sam Jordan und Michael Rock eine L&ouml;sung, die den Kontextwechsel
gegen&uuml;ber der L&ouml;sung von Phase 5 drastisch verbessern sollte.Bereits im
Januar diesen Jahres hatten wir einen sehr stabilen Aufsatz zur Phase 5
Software lauff&auml;hig, der eine Kontextwechselzeit von im Schnitt 0,5
Millisekunden gegen&uuml;ber 60 bis 90 Millisekunden der Phase 5 L&ouml;sung brachte.<P>
Diese verbesserte Technik brachte f&uuml;r alle Applikationen, die wir nun 1:1
umsetzen konnten, eine unserer Meinung nach ausreichende Beschleunigung auf
der PowerPC-Seite. F&uuml;r alle Applikationen, die mehr Geschwindigkeit aus dem
PowerPC herausholen sollen, ist eine spezielle Programmierung sowieso
n&ouml;tig. Die Entwickler m&uuml;ssen sich dann allerdings im klaren sein, f&uuml;r eine
sehr kleine Zielgruppe einen enormen Aufwand treiben zu m&uuml;ssen, der sich
auf dem Software-Markt f&uuml;r Dual-Prozessorboards kaum rechnen wird. Wir
waren damals und sind auch heute noch der &Uuml;berzeugung, da&szlig; zuk&uuml;nftige
Amigas mit nur einem Prozessor ausgestattet sein werden, egal von welchem
Hersteller diese Prozessoren kommen.<P>
Wir verbesserten in der darauffolgenden Zeit unser Entwicklunssystem,
programmierten die n&ouml;tigen PowerPC nativen ANSI- und
Mathematik-Bibliotheken und achteten weiterhin darauf, da&szlig; alles
Amiga-konform und stabil funktionierte. Im April pr&auml;sentierten wir unsere
ersten Demos und das Entwicklungssystem auf der Clubmesse in Heilbronn und
bei den Magischen Tagen in Trier, wo wir auch erste Informationen zur
Problematik in Vortr&auml;gen ver&ouml;ffentlichten. Wir sprachen vor der Messe in
Trier mit Wolf Dietrich und Gerald Carda von Phase 5 und baten die Wahl des
Objektformates und die Konzeption der PowerPC-Schnittstelle &ouml;ffentlich zur
Diskussion zu stellen, was sie, wie Sie erahnen werden, abgelehnt haben.
Ihre Begr&uuml;ndung war lapidar: Wir haben das so entschieden und genau so wird
es gemacht.Es gibt keine Diskussion!<P>
Kurze Zeit nach der Messe kam dann eine neue Version der
Software-Schnittstelle (PPC.Library) von Phase 5 (der Autor hatte bereits
seit 3 Monaten keine neue Version mehr an uns geliefert). Wir testeten
diese L&ouml;sung und wie zu erwarten, war unsere Software nicht mehr lauff&auml;hig.
Die &Auml;nderungen in der PPC.Library war so tiefgreifend, da&szlig; selbst der noch
wenige Monate zuvor erlaubte Weg nicht mehr nutzbar war.<P>
Um weiteren Inkompatibilit&auml;ten zur Phase 5 L&ouml;sung vorzubeugen, stellten wir
einen Anforderungenkatalog f&uuml;r einen Amiga-konformen Seiteneinstieg in die
PPC.Library zusammen, um gemeinsam mit Phase 5 eine standardisierte
Schnittstelle in ihrer PPC.Library zu schaffen. Die Liste wurde von unseren
Autoren mit Herrn Carda bei Phase 5 diskutiert (der Autor der PPC.Library
hatte kurzfristig abgesagt), kurz abgenickt, aber bis heute nichts
umgesetzt! Bei der zeitgleichen Vorf&uuml;hrung unserer L&ouml;sung und der
Demonstration der Eigenschaften wurde sehr erstaunt zur Kenntnis genommen,
da&szlig; sich unser Autor Sam Jordan in der Zwischenzeit ein PowerPC-Wissen
angeeignet hatte, das die F&auml;higkeiten der Phase 5-Entwickler &uuml;bertraf und
wahrscheinlich heute noch &uuml;bertrifft.<P>
Vier Wochen nach diesem Treffen erschien eine neue Version der PPC.Library
mit einigen Features, die wir zuvor in unserer L&ouml;sung pr&auml;sentiert hatten.
Der Verdacht des "Re-Ingeneerings" durch Phase 5 lag nahe. Auch diese
Version der PPC.Library war wieder zu unserer L&ouml;sung inkompatibel, was uns
ebenfalls wenig &uuml;berraschte.<P>
Als Konsequenz auf die Ignoranz von Phase 5 entschlossen wir uns, so
schnell wie m&ouml;glich eine Softwarel&ouml;sung zu schaffen, welche die PPC.Library
v&ouml;llig ersetzt. F&uuml;r unsere Bereitschaft zur Kooperation sollte das
allerdings keinen Abbruch bedeuten. Am 5. Juni 1997 lief die erste Version
unserer PowerPC- und Warp.library, nachdem zuvor die PPC.Library aus dem
LIBS:-Verzeichnis entfernt wurde!<P>
Bis zum heutigen Zeitpunkt haben wir dennoch Sorge daf&uuml;r getragen, unter
extremen Bedingungen eine L&ouml;sung bereitzustellen, die weiterhin mit der
Phase 5 Schnittstelle zusammenarbeitet, wie sie auch durch Phase 5 geduldet
wurde. Die beiden weiteren Versionen der PPC.Library von Phase 5, die bis
zum heutigen Tage bei uns eintrafen, verwehrten ebenfalls unserer
Software-Schnittstelle den Dienst. Immer wieder mu&szlig;ten Anpassungen
vorgenommen und Fehler in der Phase 5-Programmierung umgangen werden.<P>
Als H&ouml;hepunkt ist die Ver&auml;nderung der Bibliothek von Ende Juli zu erw&auml;hnen.
Wie wir alle wissen, hatte Phase 5 bereits zum Juni die Auslieferung der
Boards angek&uuml;ndigt. Das verz&ouml;gerte sich jedoch immer wieder von Woche zu
Woche. Ende Juli wurde nun wieder eine Bibliothek von Phase 5
bereitgestellt, die es zwangsl&auml;ufig notwendig machte, da&szlig; jede Software,
die bereits unter PowerUP im Elf-Format entstanden war, neu kompiliert und
gelinkt werden mu&szlig;te, um wieder mit der aktuellen Softwareschnittstelle
kompatibel zu sein. F&uuml;r uns war das eine unverst&auml;ndliche Vorgehensweise,
hatte man doch bereits Monate zuvor die Auslieferung der Boards geplant.
&Uuml;brigens waren die Entwicklungen, die auf StormC basieren, nicht davon
betroffen, da lediglich ein kleiner allgemeiner Programmteil der
kompatiblen Bibliothek von uns neu kompiliert werden mu&szlig;te, um alles wieder
unter Phase5-PowerUP lauff&auml;hig zu machen.<P>
Die letzte Version der PPC.Library erhielten wir nun zusammen mit dem
PowerUP-Serienboard. Auch die erste, halbwegs vollst&auml;ndige Dokumentation zu
dem angeblich revolution&auml;ren Messagesystem war dabei enthalten.Entwickler,
die vorher planten, PowerUP-Software zu entwickeln, k&ouml;nnen demnach erst
jetzt mit der Entwicklung beginnen. Ein Grund, warum es noch keine
Anwendersoftware f&uuml;r PowerUP gibt. Wenn bereits entwickelt wurde, mu&szlig; jetzt
die Konzeption der Anwendersoftware neu &uuml;berarbeitet und mit viel Aufwand
neu programmiert werden.<P>
Entwickler, die sich momentan dazu entschlie&szlig;en, Software f&uuml;r PowerUP mit
der Phase 5-L&ouml;sung zu programmieren, m&uuml;ssen zwangsl&auml;ufig damit rechnen, da&szlig;
Ihre Software NICHT auf PowerPC-Boards anderer Hersteller und auch auf
einem eventuell geplanten PowerPC-Amiga l&auml;uft.Das Statement von Phase 5 in
dem von WarpUP als einem "Hacker Kernel"gesprochen wird, zeigt deren Angst
vor einer m&ouml;glichen Konkurrenz.<P>
&Auml;hnlich wie es zur Zeit gegen uns geschieht, wurde der Firma ProDAD bereits
vor einem Jahr die Unterst&uuml;tzung durch Phase 5 verweigert.Phase 5 wird nun
nat&uuml;rlich mit dem Hinweis kontern, da&szlig; auch ProDAD ein Entwickler-Board
erhalten habe und durchaus entwickeln konnte.Was dem Anwender jedoch
verschwiegen wird ist, da&szlig; Phase 5 nie die Hardwarebeschreibung offengelegt
hat, was n&ouml;tig ist, um eine Betriebssystem-Entwicklung f&uuml;r PowerUP-Boards
vorzunehmen. Es sei denn es wird zu einer Entwicklung, die von Phase 5
gew&uuml;nscht ist.<P><BR>
<B>L&ouml;sungen und Wege</B><P>
F&uuml;r Sie als Anwender mag die Diskussion, die momentan entbrennt,
&uuml;berfl&uuml;ssig sein. Aber sp&auml;testens dann, wenn Sie ein Softwareprodukt
einsetzen m&ouml;chten, das PowerPC optimiert ist und Sie beim Kauf darauf
achten m&uuml;ssen, ob es f&uuml;r das PowerPC-Board der Firma X oder Y geeignet ist,
fragen Sie sich doch, warum man sich nicht rechtzeitig auf einen
einheitlichen Standard geeinigt hat.<P>
Wir als Software-Firma haben nicht die Zeit und die n&ouml;tigen Ressourcen, um
f&uuml;r jede Amiga-Hardware-Plattform neue Softwarekonzepte erarbeiten zu
k&ouml;nnen. Anderen Firmen geht es genauso, weshalb zun&auml;chst eine
Hardware-unabh&auml;ngige Schnittstelle zwischen 68K-Betriebssystem und
PowerPC-Steuersoftware definiert werden mu&szlig;. Diese Definition mu&szlig; so
ausfallen, da&szlig; weder Hard- noch Softwarehersteller benachteiligt sind und
eine Monopolstellung im Markt vermieden wird. Erfoderlich ist die Bildung
eines unabh&auml;ngigen Gremiums, das diese Aufgabe &uuml;bernimmt.<P>
Mit unserem Vorschlag zeigen wir einen m&ouml;glichen Weg, der flexibel angepa&szlig;t
werden kann. Als unabh&auml;ngiger Software-Entwickler sind wir
selbstverst&auml;ndlich Willens, unsere L&ouml;sung auch f&uuml;r andere
Amiga-PowerPC-Plattformen umzusetzen, um die Lauff&auml;higkeit der
Amiga-PowerPC-Software zu gew&auml;hrleisten. Auch eine Unterst&uuml;tzung des
Elf-Objekt-Formates ist denkbar, wenn man ein unabh&auml;ngiges Gremium von
dessen Vorteil f&uuml;r den zuk&uuml;nftigen Amiga-Markt &uuml;berzeugen kann. Die
Argumente seitens Phase 5 k&ouml;nnen zur Zeit keinen Entwickler &uuml;berzeugen, es
sei denn, er plant den Ausstieg aus der Amiga-Entwicklung in Richtung
A/Box. Von einem Industriestandard und einer Liste mit m&ouml;glichen nutzbaren
Entwicklungssystemen auf anderen und teuren Plattformen zu reden, ist
lediglich Augenwischerei. Phase 5 ist vielleicht in der gl&uuml;cklichen Lage,
sich entsprechende Entwicklungssysteme leisten zu k&ouml;nnen, aber schneller
entwickeln werden sie deshalb nicht. Unserer Meinung nach sollte die
Software-Entwicklung f&uuml;r den Amiga weiterhin auf dem Amiga stattfinden.<P>
Vor geraumer Zeit hat die englische Firma Index, die bereits eine Lizenz
f&uuml;r Amiga-Clones und das AmigaOS erworben hat, ebenfalls RISC-basierte
Turbo-Boards angek&uuml;ndigt. Jeder Software-Entwickler, der diese Ank&uuml;ndigung
gelesen hat, mu&szlig; sich auch mit der Frage besch&auml;ftigen, ob Applikationen
allgemein oder f&uuml;r jedes Board extra angepa&szlig;t werden m&uuml;ssen.Die
Softwarel&ouml;sung von Phase5 enth&auml;lt - aus Sicht eines AmigaOS Entwicklers -
so viele tiefgreifende Neuerungen (ELF-Format statt Hunk-Format, Dynamic
linking statt Shared-Libraries), da&szlig; es f&uuml;r einen weiteren
PowerPC-Hardware-Entwickler nahezu unm&ouml;glich ist, diese Schnittstelle
ebenfalls zur Verf&uuml;gung zu stellen. Und die M&ouml;glichkeit der Lizensierung
bei Phase5 ist bei deren derzeitigem Verhalten fragw&uuml;rdig und bislang auch
nicht angek&uuml;ndigt.<P>
Erst wenn ein allgemeiner Standard erarbeitet ist, k&ouml;nnen Software-H&auml;user
beruhigt Software umsetzen, hat man doch dadurch die Gewi&szlig;heit, da&szlig; sich
Hersteller anderer PowerPC-Boards ebenfalls kompatibel verhalten m&uuml;ssen.Der
Anwender kann sich dann sicher sein, da&szlig; keiner einen Alleingang
realisieren kann.<P>
Mit den PowerPC-Boards von Phase 5 ist ein erster Schritt in eine
wundervolle Amiga-Zukunft getan. Wir meinen allerdings, da&szlig; dies nicht die
einzige L&ouml;sung sein kann und hoffen auf weitere Hersteller, die im wieder
aufbl&uuml;henden Amiga-Markt einen Einstieg riskieren. Denn nur durch die
notwendige Konkurrenz ist eine innovative Entwicklung gew&auml;hrleistet.<P>
Den Vorwurf von Phase 5, mit WarpUP unser Entwicklungssystem StormC f&uuml;r
PowerPC-Applikationen favorisieren zu wollen, m&uuml;ssen wir entschieden
zur&uuml;ckweisen. Jeder Hersteller von Entwicklungssystemen hat die
M&ouml;glichkeit, einen PowerPC-Compiler zu erzeugen. Dieser Compiler kann wie
gewohnt das Amiga-Hunk-Format schreiben. Erst der Programmierer einer
Applikation (oder wie im Falle von StormC: das Laufzeitsystem) k&uuml;mmert sich
um die Spezialit&auml;ten des PowerPCs und benutzt dazu die PowerPC.library von
WarpOS. Da es sich bei dieser Bibliothek um eine 100 % kompatible AmigaOS
Shared-Library handelt, steht die Nutzung dieser Bibliothek jedem offen.So
ist es durchaus denkbar, zwei verschiedene Compiler f&uuml;r den 68K-Teil (z.B.
SAS/C bei einer bestehenden Applikation) und den PPC-Teil (z.B. StormC-PPC
f&uuml;r die portierten Teile) in einem Mixed-Binary einzusetzen. Wir sind gerne
bereit, jeder Firma, die ihren Compiler f&uuml;r den PowerPC umsetzen will, mit
unserer, in den letzen 2 Jahren gewonnen Erfahrung zu helfen.<P>
Wir sind sehr an einer Kooperation mit der Firma Phase 5 und allen anderen
Herstellern, die PowerPC-Entwicklungen umsetzen m&ouml;chten sowie an einer
Zusammenarbeit mit Amiga International interessiert. Ebenso w&uuml;nschen wir
uns eine Koexistenz alternativer L&ouml;sungen, wenn damit sinnvolle
Erweiterungen bereitgestellt werden und eine allgemeing&uuml;ltige
Applikationenschnittstelle davon nicht ausgeschlossen wird.<P><BR>
<B>Sagen Sie uns Ihre Meinung</B><P>
Da Phase5 sofort mit einer Stellungnahme and die &Ouml;ffentlichkeit ging, die
unser L&ouml;sung scharf attakierte, w&uuml;rden wir jetzt - nachdem Sie auch unsere
Darstellung gelesen haben - gerne Ihre Meinung zu diesem Thema erfahren:<P>
<A HREF="mailto:warpup@haage-partner.com">warpup@haage-partner.com</A>&#187;
<CENTER><BR><A HREF="0408.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0410.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

