<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 10/97 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>Do, 9.10.97:</H1><H2 ALIGN=CENTER>...und die Reaktion von phase 5</H2>
&#171;Neue vorl&auml;ufige Stellungnahme zur Warpup-Diskussion<P>
Die unerfreulicherweise ausgebrochene heftige Diskussion &uuml;ber Warpup
&uuml;berschattet zur Zeit die erfreuliche Tatsache, da&szlig; mit Einf&uuml;hrung der
PowerUp-Produktlinie die wohl umfassendste Innovation der letzten Jahre im
Amiga-Markt Realit&auml;t geworden ist, und da&szlig; in Folge der umfangreichen
Bem&uuml;hungen, Investitionen und Kooperationen von phase 5 digital products
und Softwareherstellern weltweit eine neue und leistungsstarke Generation
von Anwendungen vor der Markteinf&uuml;hrung steht.<P>
Wir haben zur Warpup-Diskussion viele unterst&uuml;tzende Zuschriften und Emails
erhalten, aber auch Schreiben von Anwendern, die Besorgnis &uuml;ber die
m&ouml;glichen Folgen des Konflikt zwischen Haage&amp;Partner und phase 5 &auml;u&szlig;erten.
Darunter waren auch solche, die unsere sehr deutlich ge&auml;usserte Ablehnung
als zu massiv oder emotional empfanden, wobei diese Auffassung durch die
Darstellung von Haage&amp;Partner gef&ouml;rdert wird, die uns "aggressive Attacken"
vorwerfen.<P>
Es ist richtig, da&szlig; unser erstes Statement sehr direkt ausgefallen ist, da
es sich dabei um die Kopie eines Postings in eine Internet-Newsgroup
handelte, in der Haage&amp;Partner-nahe Quellen die massiv gestartete
Marketingkampagne von Haage&amp;Partner unterst&uuml;tzten. Es war in dieser Form
allerdings auch eine Reaktion auf die aggressive Marketingkampagne, mit der
uns Haage&amp;Partner im vollen Bewu&szlig;tsein unserer ablehnenden Haltung v&ouml;llig
&uuml;berrascht hat, was wir in Hinblick auf unsere bisherige Unterst&uuml;tzung als
massiven Vertrauensbruch ansehen.<P>
Erfreulicherweise hat unsere deutliche Kritik zu einer umfangreichen
Stellungnahme seitens Haage&amp;Partner gef&uuml;hrt, in der sie verbindliche
Positionen beziehen und die wir als Basis zu einer umfassenden Diskussion
&uuml;ber Realit&auml;t, Fiktion und Suggestion in ihren Aussagen heranziehen werden.<P>
Wir betonen, da&szlig; die umfangreiche Darstellung von Haage&amp;Partner in weiten
Teilen nicht richtig ist, und werden am 14.10.97 auf unserer Website ebenso
umfangreich - und auch auf technische Fragen eingehend - Stellung beziehen
werden. Da uns Haage&amp;Partner unter anderem vorwirft, weg vom Amiga-Standard
zu entwickeln, absichtlich Inkompatibilit&auml;t herbeizuf&uuml;hren, und auf
"diktatorische" Weise Kontrolle aus&uuml;ben zu wollen, werden wir in unserem
Statement fundiert aufzeigen, da&szlig;<P>
<UL>
<LI>Haage&amp;Partner mit ihrer Warpup-Entwicklung selbst eine absichtliche
Inkompatibilit&auml;t herbeigef&uuml;hrt hat, um eine Konkurrenzsituation  zu
schaffen
<LI>die Behauptung, wir wollten absichtlich Inkompatibilit&auml;t herbeif&uuml;hren,
von Haage&amp;Partner aufgestellt wird, w&auml;hrend wir lediglich daf&uuml;r  Sorge
tragen wollen, da&szlig; die PowerUp System Software nicht von fremder
Software deaktiviert wird (welche Inkompatibilit&auml;ten das verursachen
w&uuml;rde, ist n&auml;mlich kaum auszudenken - z.B. k&ouml;nnte der CGX  V3-Treiber
f&uuml;r die neuen Permedia2-Grafikkarten, in den PPC-native  Unterst&uuml;tzung
f&uuml;r CyberGL 3D und MEPG/Videoskalierung integriert  ist, nicht mehr
gestartet werden, und dies ist nur ein Beispiel von vielen)
<LI>unsere L&ouml;sung auf offenen und zukunftsorientierten Standards aufbaut,
die neue Wege erm&ouml;glichen - diese aber nicht zwingend voraussetzen  -
und von allen Entwicklern wie auch von jeder zukunftsorientierten
Erweiterung des Betriebssystems genutzt werden k&ouml;nnen
<LI>die technischen Ausf&uuml;hrungen von Haage&amp;Partner zu ihrer als  auch zu
unserer L&ouml;sung in weiten Teilen unrichtig sind und ein fundamentales
Unverst&auml;ndnis &uuml;ber die Arbeitsweise der Hardware wiederspiegeln
<LI>die Ausf&uuml;hrungen von Haage&amp;Partner &uuml;ber mangelnde Kooperation  eine
einseitige und unrichtige Darstellung der Ereignisse sind und
<LI>Haage&amp;Partner mit einer L&ouml;sung, die entgegen ihrer Darstellung  massive
technische Nachteile hat und die Leistungsf&auml;higkeit der PowerUp-Boards
erheblich einschr&auml;nkt, selbst weitgehende Kontrolle &uuml;ber die
Softwareentwicklung auf Amiga/PPC - und zwar auf allen Ebenen - erringen
m&ouml;chte, wobei eine Vielzahl von Entwicklern die Konstellation &auml;ussert
kritisch sieht, da&szlig; Haage&amp;Partner als Hersteller von Entwicklungs-Tools,
Anwenderprogrammen und Systemerweiterungen (JAVA) nun auch noch einen
&uuml;bergreifenden  Standard f&uuml;r PPC-Amiga-LowLevel-Software setzen will.
</UL><P><BR>
Bis zur Ver&ouml;ffentlichung unseres umfassenden Statements finden Sie an
dieser Stelle eine Kopie eines Interviews zum Thema Warpup, das das
Amiga-Magazin mit Wolf Dietrich von phase 5 gef&uuml;hrt hat.<P>
<H2 ALIGN=CENTER>Interview: Kontra Warp</H2>
Zur heftigen &ouml;ffentlichen Diskussion um Warpup haben wir Wolf Dietrich von
phase 5 befragt.<P>
<B>AMIGA-Magazin:</B> Warum kritisieren Sie Warpup von H&amp;P in sehr direkter und
massiver Form?<P>
<B>W. Dietrich:</B> Warpup ist eine Software-L&ouml;sung, die das Starten der PowerUp
System Software unterbindet. Als Folge davon k&ouml;nnen keine auf der PowerUp
System Software basierenden Programme mehr aufgerufen werden.Dies betrifft
die von phase 5 mitgelieferte Software, Erweiterungen von CyberGraphX (wie
die schnelle PPC-CyberGL-3D-Library oder die PPC-MPEG-Library), und all die
Programme der Hersteller, die PowerUp-konforme Software entwickeln.Wir
k&ouml;nnen daher den Anwendern nur dringend von Warpup bzw. damit arbeitender
Software abraten, und &uuml;bernehmen keine Gew&auml;hr f&uuml;r die Funktionalit&auml;t von
PowerUp-Systemen, auf denen Warpup installiert wurde.<P><BR>
<B>AMIGA-Magazin:</B> H&amp;P wirbt mit technischen Vorteilen und h&ouml;herer
Geschwindigkeit des Warpup-Kernels. Was sagen Sie dazu?<P>
<B>W. Dietrich:</B> H&amp;P vermittelt den Eindruck, da&szlig; Warpup zus&auml;tzliche
Funktionalit&auml;t zur Verf&uuml;gung stellt, was f&uuml;r uns nicht ersichtlich ist. H&amp;P
fehlt grunds&auml;tzliche Einsicht in die Hardware-Funktionalit&auml;t, was sich in
ihrem Produkt wiederspiegelt.Die PowerUp System Software stellt einen
PPC-Kernel mit umfangreichen Features zur Verf&uuml;gung, wie z.B. einem
Messagesystem, das den parallelen Betrieb mehrerer Prozessoren erm&ouml;glicht.
H&amp;P verwendet einen &uuml;berholten Weg des Wechsels zwischen den Prozessoren
innerhalb eines Programms. Hierbei treten Kontextwechsel auf, die viel Zeit
kosten, und die Prozessoren arbeiten sequentiell anstatt parallel. Dieses
Verfahren ist massiv langsamer als unser Prinzip, das den Kontextwechsel
vermeidet und Multiprocessing verwendet.<P>
Durch die konzeptionell falsche Implementation von H&amp;P wird wesentliche
Leistung der PowerUp-Boards verschenkt, was wir nicht gutheissen k&ouml;nnen;
auch die M&ouml;glichkeit des Multiprocessing wird vollkommen
vernachl&auml;ssigt.Desweiteren baut die L&ouml;sung von phase 5 generell auf
zukunftsorientierten offenen Standards auf, die H&amp;P nach unserer Auffassung
nicht bietet.<P><BR>
<B>AMIGA-Magazin:</B> phase 5 wird durch H&amp;P Kontrolle &uuml;ber Softwareentwicklung
vorgeworfen und vom Amiga-OS abr&uuml;cken zu wollen. Wie stehen Sie zu diesem
Vorwurf?<P>
<B>W. Dietrich:</B> Als Systemhersteller der PowerUp-Produkte ist es &uuml;blich und
sinnvoll, da&szlig; wir eine einheitliche L&ouml;sung anbieten den HAL (Hardware
Abstraction Layer) kontrollieren, der von der Hardware abstrahierte
Software erlaubt und Kompatibilit&auml;t gew&auml;hrleistet. Was die AmigaOS-Frage
betrifft: Wir empfehlen den Entwicklern modulare und strukturierte
Programmierung, die die Software objektorientiert und in Hinsicht auf ein
neues OS zukunftstauglich macht. Ein solches neues OS kann ein
AmigaOS-Update sein, oder auch ein alternatives OS - die strukturierte
Programmierung kommt dem Entwickler in jedem Fall zugute. Wenn
Software-Entwickler jetzt f&uuml;r den neuen Prozessor entwickeln, dann sollte
ihre Arbeit auch f&uuml;r kommende Betriebssysteme vorbereitet sein - alles
andere w&auml;re kurzsichtig. Im &uuml;brigen ist dies ein Thema, das wir mit Amiga
Inc. diskutieren, mit denen wir in Kontakt stehen.<P><BR>
<B>AMIGA-Magazin:</B> H&amp;P lassen Probleme bei der Zusammenarbeit anklingen, warum?<P>
<B>W. Dietrich:</B> Die Tatsache, da&szlig; wir H&amp;P lange unterst&uuml;tzt haben, beweist das
Gegenteil. Fakt ist allerdings, da&szlig; H&amp;P vom Beginn der PowerUp-Entwicklung
an versucht hat, an der Entwicklung zu partizipieren, eigene Standards
einzuf&uuml;hren und den Storm C-Compiler zum exklusiven Entwicklungstool zu
machen. Wir haben dies abgelehnt, da wir offene und zukunftsorientierte
Standards verfolgen. Wenn H&amp;P behauptet, wir h&auml;tten nicht &uuml;ber ihre
Alternativen diskutiert, so ist dies falsch; sie konnten lediglich keine
leistungsf&auml;hige und zukunftsorientierte Software-Technologie anbieten.<P><BR>
<B>AMIGA-Magazin:</B> Was ist Ihre Position zur Warpup-Vermarktung?<P>
<B>W. Dietrich:</B>  Die Vorgehensweise von H&amp;P lehnen wir strikt ab. Wir erachten
es als nicht akzeptabel, da&szlig; mit umstrittenen und teilweise technisch
unrichtigen Darstellungen eine Software in den Markt gedr&auml;ngt und als
Standard etabliert werden soll, die beim Anwender zu massiven
Kompatibilit&auml;tsproblemen f&uuml;hrt, und deren offensichtlicher Existenzzweck
darin liegt, ihrem Hersteller Einflu&szlig; auf zuk&uuml;nftige Entwicklungen zu
erm&ouml;glichen. Da&szlig; H&amp;P als Hersteller von Entwicklungs-Tools,
Anwendersoftware und Systemerweiterungen (JAVA) nun Kontrolle &uuml;ber m&ouml;gliche
OS-Entwicklungen der Zukunft erringen will, zeigt eine massiv
monopolistische Strategie auf, die wir - wie auch andere Entwickler - als
besorgniserregend betrachten. Eine von H&amp;P propagierte
"Hardware-Unabh&auml;ngigkeit" setzt &uuml;brigens voraus, da&szlig; alle
Hardware-Entwickler die H&amp;P-L&ouml;sung &uuml;bernehmen - einschlie&szlig;lich Amiga Inc.,
was eher unwahrscheinlich ist.<P><BR>
<B>AMIGA-Magazin:</B> Wie werden Sie auf die Warpup-Vermarktung durch H&amp;P
reagieren?<P>
<B>W. Dietrich:</B> Wir werden alle notwendigen Schritte unternehmen, um unsere
Entwickler und Anwender vor massiven Problemen durch eine von der
H&amp;P-Software erzeugte Inkompatibilit&auml;t zu sch&uuml;tzen. Ein erster Schritt ist
damit getan, da&szlig; wir uns der praktisch uneingeschr&auml;nkten Unterst&uuml;tzung der
PowerUp-Entwickler versichert haben; Resultate in Form von PowerUp-Software
werden auf der K&ouml;lner Messe "Computer 97" zu sehen sein. Wir werden H&amp;P
dar&uuml;ber hinaus keine Entwicklerunterst&uuml;tzung mehr gew&auml;hren. Da Warpup
unseren HAL umgeht, wird es daher h&ouml;chstwahrscheinlich inkompatibel zu
zuk&uuml;nftigen PowerUp-Varianten sein, bei denen aus technischen Gr&uuml;nden das
Hardware-Design unterschiedlich ist.<P><BR>
AMIGA-Magazin: Danke f&uuml;r das Gespr&auml;ch.&#187;
<CENTER><BR><A HREF="0409.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0411.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

