<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 PowerUp-to Date</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipu.gif" ALT="Amiga-Aktuell 10/97 - PowerUp-to-Date" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>WarpUp aus der Sicht eines Anwenders</H1>
Christian Hoklas hat sich Gedanken &uuml;ber WarpUp, die AMIGA-PPC-Zukunft und
den Streit zwischen Haage &amp; Partner und phase 5 digital products gemacht:<P><BR>
&#171;WarpUP oder nicht WarpUP, das ist hier die Frage!<P>
Wie bereits allgemein bekannt, sind nun zwei Softwarel&ouml;sungen f&uuml;r die neuen
PowerUP-Karten von Phase5 verf&uuml;gbar. Es existiert als erstes die
mitgelieferte PPC.library von Phase5 und WarpUP von Haage&amp;Partner.<P>
Bis hierher klingt das auch alles sch&ouml;n und gut, wenn nicht Phase5 kurz
nach Erscheinen von WarpUP eine Stellungnahme gemacht h&auml;tten, die nicht mit
Kritik spart. Und seitdem kritisieren sich Phase5 und Haage&amp;Partner
gegenseitig.<P>
Dieses Verhalten zeigt nicht gerade den Zusammenhalt der Amigagemeinde. Nun
hat Phase5 auch noch Haage&amp;Partner, wohl einem der wichtigsten
Softwareh&auml;user f&uuml;r den Amiga, jegliche Entwicklungsunterst&uuml;tzung untersagt.
Derartig bockiges Verhalten kennt man sonst nur aus dem PC-Bereich, wo
solche Probleme in millionenschweren Gerichtsverfahren gekl&auml;rt werden. Ich
glaube, da&szlig; das wohl das letzte ist, was die Amigagemeinde jetzt braucht.<P>
Tatsache ist, da&szlig; Haage&amp;Partner, als einziger Softwarehersteller, schon 3
Softwareprodukte (ArtEffect, Storm PowerAsm, StormC 3.0) f&uuml;r PowerPC
umgesetzt hat und damit schon mehr auf den PowerUP-Boards programmiert hat
als Phase5. WarpUP zeigt eigentlich nur, da&szlig; irgendwo Mi&szlig;st&auml;nde in der
ppc.library sein m&uuml;ssen, denn sonst h&auml;tte wohl niemand ein derartiges
Projekt mit all seinen Kosten als Freeware ver&ouml;ffentlicht. Auch klar ist,
da&szlig; Phase5 denkt, da&szlig; sie in ein paar Jahren die A/Box rausbringen und
damit nat&uuml;rlich Geld verdienen wollen. Aber selbst der schnellste Rechner
mit dem besten Betriebssystem ist nur so gut wie seine Software. Und wenn
Haage&amp;Partner und ProDAD nicht mehr f&uuml;r Phase5 entwickeln, weil ihnen der
Support untersagt wurde, sieht es doch schon sehr mau f&uuml;r die A/Box aus.<P>
Ich wei&szlig; zwar, da&szlig; dieses Beispiel jetzt niemand h&ouml;ren will, aber im PC-
Sektor gibt es eine gro&szlig;e Softwarefirma und eine gro&szlig;e Hardwarefirma, die
sich gut einigen k&ouml;nnen. Das Produkt hei&szlig;t "Wintel" und alle PC-User
benutzen es. Warum kann nicht WarpUP von Phase5 zur offiziellen PowerUP-
Software gemacht werden und ProDAD erh&auml;lt den Auftrag, f&uuml;r die A/Box eine
Umsetzung von pOS zu schreiben. Oder denkt Phase5 wirklich, da&szlig; jeder
Softwarehersteller seine Software auf jedes popelige Betriebssystem auf
jedem popeligen Rechner umsetzt. Mit pOS ist ein gutes Betriebssystem mit
Amigaphilosophie erstellt worden, um es auf allen Plattformen zu
etablieren, die Amiga-like sein wollen.<P>
Ein Punkt, den die Stellungnahme von H&amp;P anspricht, ist, da&szlig; bis jetzt
nicht sehr viel PowerPC-Software umgesetzt wurde. Das ist leider richtig,
denn es m&uuml;ssen Standards geschaffen werden und jetzt mu&szlig; den
Softwareentwicklern geholfen werden, f&uuml;r die jetzige PowerPC-Karte zu
programmieren, nicht f&uuml;r die Superrechenmaschine in x Jahren.<P>
Bleibt nur zu hoffen, da&szlig; derartige Probleme nicht wieder auftauchen! Ich
pers&ouml;nlich halte Phase5 f&uuml;r einen guten Hardwarehersteller und
Haage&amp;Partner f&uuml;r einen guten Softwarehersteller, deren Zusammenarbeit noch
so einige gute Dinge bewirken kann.&#187;<P>
Gibt es weitere Stellungnahmen zu diesem Thema bzw. Christians Beitrag?
Bitte schickt sie f&uuml;r eine Ver&ouml;ffentlichung in AMIGA aktuell an folgende
Adresse:<P>
Carsten Schr&ouml;der<BR>
Helmoltstra&szlig;e 10<BR><BR>
37081 G&ouml;ttingen<BR>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
<CENTER><BR><A HREF="0411.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0413.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup1.gif" ALT="[PowerUp-to-date]" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

