<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 - Produktvorstellungen</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipr.gif" ALT="Amiga-Aktuell 10/97 - Produktvorstellungen" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>AMIGA Forever - der AMIGA-Emulator mit Lizenz</H1>
Am 7. Oktober &uuml;berraschte AMIGA International mit folgender Bekanntmachung:<P><BR>
&#171;7. Oktober 1997 Cloanto veroeffentlicht offizielle AMIGA Software-Emulation<P>
Cloanto, Hersteller fuehrender AMIGA Grafik- und Anwendungsprogramme wie
z.B. Personal Paint, Kara Collection und Personal Suite, hat die Erlaubnis
von AMIGA International, Inc. eine offizielle AMIGA Software-Emulation des
AMIGA-Computers herzustellen, die das original AMIGA-OS,
AMIGA/PC-Netzwerk-Software sowie verschiedene andere Programme beinhaltet.
Das Softwarepaket, das das "powered by Amiga"-Logo tragen wird, erscheint
voraussichtlich im November.<P>
Fuer weitere Informationen besuchen Sie die Cloanto-Website:
<A HREF="http://www.cloanto.com/amiga/">www.cloanto.com/amiga/</A>&#187;<P><BR>
Drei Tage sp&auml;ter gab Cloanto Einzelheiten zu dem Lizenzabkommen mit AMIGA
International bekannt. Hier die von Heiko Kuschel ins Deutsche &uuml;bersetzte
offizielle Presseerkl&auml;rung:<P><BR>
&#171;Pr&auml;sentation: Cloantos "Amiga Forever"<P>
Letzte Woche erwarb Cloanto von den Eigent&uuml;mern der Amiga-Technologie
(Gateway 2000, Inc., Amiga International, Inc. und Amiga, Inc.) eine
Lizenz, die alle Amiga-Betriebssysteme von Version 1.0 bis Version 3.0
abdeckt. Sie sollen von Cloanto in einem Paket mit dem Namen "Amiga
Forever" ver&ouml;ffentlicht werden. (Einige kleinere Dateien werden fehlen oder
in &uuml;bereinstimmung mit der Lizenz ge&auml;ndert werden, ohne jedoch die Amiga-
Kompatibilit&auml;t der Emulation zu beeinflussen. Gewisse asiatische
Territorien sind von der Lizenz ausgeschlossen.)<P>
Die Lizenz beinhaltet auch Amiga ROMs, Amiga-Patente, den Gebrauch des
Worts "Amiga" in "Amiga Forever" und "Amiga Explorer", das offizielle
"Powered by Amiga" Logo und anderes geistiges Eigentum, sowie jede
Erlaubnis, die n&ouml;tig ist, um legal einen vollst&auml;ndig funktionsf&auml;higen
Amiga-Emulator zu publizieren. (Man mu&szlig; bedenken, da&szlig; eine Emulation ebenso
wie andere Amiga-Kompatibilit&auml;ts-L&ouml;sungen ohne eine Lizenz nicht nur Amiga
Copyrights, sondern auch Patente und Warenzeichen verletzen k&ouml;nnen.)<P>
Amiga Forever beinhaltet "Amiga Explorer", eine neue Amiga-zu-PC-Netzwerk-
Software von Cloanto. Das Amiga Explorer User-Interface ist eine
objektorientierte Erweiterung des Windows Desktop, wobei der Amiga als ein
&uuml;bers Netzwerk angeschlossener Computer erscheint. Amiga und PC k&ouml;nnen &uuml;ber
ein serielles (Nullmodem) oder paralleles (Windows/LapLink/InterLink/Norton
Standard) Kabel verbunden werden. Ein zuk&uuml;nftiges Upgrade, das noch in
diesem Jahr herauskommen soll, wird die Netzwerkf&auml;higkeiten erweitern, so
da&szlig; auch TCP/IP unterst&uuml;tzt wird. Dieses Upgrade wird f&uuml;r Amiga-Forever-
User kostenlos auf der Cloanto Web Site erh&auml;ltlich sein.<P>
Amiga Forever beinhaltet auch eine Vielzahl ber&uuml;hmter alter Amiga-Spiele,
Demos und anderes Material von historischem Interesse (mit einem
exklusiven, nie zuvor ver&ouml;ffentlichten Interview mit dem verstorbenen Jay
Miner, "Vater des Amiga"), plus Personal Paint und weitere aktuelle
Software von Cloanto und anderen Firmen.<P>
Das Amiga Betriebssystem, ROMs und Amiga Emulationssoftware sind
vorinstalliert auf Amiga Forever f&uuml;r einfache Nutzung und Installation. Der
Benutzer mu&szlig; nur die CD-ROM in einen PC einlegen, und mit einem Mausklick
erscheint ein vollst&auml;ndig funktionsf&auml;higer Amiga auf dem Bildschirm. Die
Amiga Emulationssoftware, die haupts&auml;chlich auf dem bekannten UAE (der
weiterhin frei erh&auml;ltlich sein wird) basiert, beinhaltet zum ersten Mal
Treiber f&uuml;r Picasso 96 Bildschirmmodi (bis zu 256 Farben sowie 16/24-bit
"true color" Modi).<P>
Die Erstver&ouml;ffentlichung von Amiga Forever soll eine CD-ROM mit Software
f&uuml;r den Amiga und die anderen Plattformen, sowie eine Disk mit einer Kopie
der Netzwerk-Software f&uuml;r die Amiga-Seite (f&uuml;r Amiga-Systeme ohne CD-ROM-
Laufwerk) beinhalten. Welche Plattformen neben Windows NT, Windows 9x, DOS
und Linux unterst&uuml;tzt werden, soll in K&uuml;rze beschlossen und bekanntgemacht
werden. Die offizielle Amiga Forever Web-Adresse
http://www.cloanto.com/amiga/forever/ erm&ouml;glicht es Benutzern, Information
und Unterst&uuml;tzung zu erhalten und ihre Software direkt &uuml;ber das Internet zu
aktualisieren.<P>
Amiga Forever wird der &Ouml;ffentlichkeit pr&auml;sentiert am 14. November 1997, auf
der Computer '97 Messe in K&ouml;ln.<P>
F&uuml;r zus&auml;tzliche und aktuelle Informationen, einschlie&szlig;lich eines Abschnitts
"Gedanken und Technologie hinter Amiga Forever", plus zus&auml;tzliche Links und
Grafiken, besuchen Sie bitte die Amiga Forever Homepage:
<A HREF="http://www.cloanto.com/amiga/forever/">http://www.cloanto.com/amiga/forever/</A>.&#187;<P><BR>
<A NAME="kommentar"></A>
<H2 ALIGN=CENTER>AMIGA-aktuell-Kommentar: AMIGA Forever</H2>
Jetzt wissen wir also, wie Darreck Lisle von der AMIGA-
Entwicklungsabteilung AMIGA, Inc. es gemeint hat, als er sagte, da&szlig; gegen
das Raubkopieren von Kickstart-ROM-Images vorgegangen werde (siehe AMIGA
aktuell 10/97). Ob es allerdings mit "AMIGA Forever" gelingt, die
massenweise Verletzung von AMIGA-Copyrights einzud&auml;mmen? Zumindest wenn der
auf der WWW-Homepage der Schatztruhe GmbH ver&ouml;ffentlichte Preis von DM
119,- richtig ist, d&uuml;rfte dieses Ziel kaum erreicht werden.
Denn welcher Personenkreis ist denn die Zielgruppe dieser CD (abgesehen von
AMIGA-Besitzern, die sich f&uuml;r die auf ihr enthaltene Betriebssystem- bzw.
Spiele-Software interessieren)? Es sind diejenigen, die sich den AMIGA Ende
der achtziger, Anfang der neunziger Jahre wegen der enormen Spielevielfalt,
die es zu jener Zeit gab, gekauft haben. Und gerade in dieser Gruppe war
das Raubkopieren sehr verbreitet. Dieses Verhalten wird sich in der
Zwischenzeit wohl bei den wenigsten ge&auml;ndert haben, erst recht nicht, wo
AMIGA-Software &uuml;ber (mehr oder weniger verborgene) Quellen im Internet
quasi "einen Mausklick" entfernt ist.<P>
Auch wenn gewisse Personen den AMIGA-Anwendern beharrlich das Gegenteil
glauben machen wollen, ist eines gewi&szlig;: Einen heutigen AMIGA mit
68030/040/060- oder gar PPC-Prozessor kann UAE aufgrund seiner - aus
technischen Gr&uuml;nden - zwangsl&auml;ufig sehr geringen Geschwindigkeit nicht
zufriedenstellend ersetzen, genauso wenig wie ein Pentium-PC-Emulator auf
dem AMIGA einen aktuellen Original-Pentium-Rechner.<P>
<CENTER><BR><A HREF="0600.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0602.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod1.gif" ALT="[Produktvorstellungen]" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

