<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 11/97 - Newsflash</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/aminf.gif" ALT="Amiga-Aktuell 10/97 - Newsflash" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR><BR><BR>
<H1 ALIGN=CENTER>Newsflash</H1>
<H2 ALIGN=CENTER>AMIGA-Meldungen:</H2>

<UL>
<LI>Das neue kanadische AMIGA-only-Unternehmen Power Solutions hat von
Chaocity die Rechte zur weltweiten Distribution des virtuellen
Planetariums Distant Suns erworben.
<LI>Laut Haage&amp;Partner ist der Macintosh-Emulator Fusion jetzt lieferbar, und
zwar bereits in der Version 2.
<LI>Das Workbench-Verbesserungssystem MagicWB ist mit der Version 2.1p zum
ersten Mal als vollst&auml;ndig installierbare Shareware erschienen. Das
Archiv kann &uuml;ber <A HREF="http://www.sasg.com/mwb/download.html">http://www.sasg.com/mwb/download.html</A> bezogen werden.
<LI>Auch das Konkurrenzprodukt NewIcons gibt es in einer neuen Version: v4.0
kann &uuml;ber <A HREF="http://www.amiganet.org/newicons">www.amiganet.org/newicons</A> geladen werden.
<LI>Die Suche nach dem RC5-56-Schl&uuml;ssel (AMIGA aktuell berichtete in der
letzten Ausgabe) ist beendet! Das AMIGA-Team (eines von 4665) belegte in
der Gesamtwertung einen hervorragenden 7. Platz, nachdem es in den
Tageswertungen teilweise sogar den 3. Rang besetzte. Der Wettbewerb
geht &uuml;brigens weiter: Nun beginnt die Suche nach dem 64Bit-Schl&uuml;ssel.
Infos gibt es auf <A HREF="http://homepage.cistron.nl/~ttavoly/rc5/">http://homepage.cistron.nl/~ttavoly/rc5/</A>
Die ben&ouml;tigte Software f&uuml;r 68K-AMIGAs l&auml;&szlig;t sich auf
<A HREF="http://www.distributed.net/rc5/rc5v2-clients.html">http://www.distributed.net/rc5/rc5v2-clients.html</A> downloaden. Eine
PowerPC-Version ist in Vorbereitung.
<LI>Unter <A HREF="http://www.mcmedia.com.au/amigaicq">http://www.mcmedia.com.au/amigaicq</A> kann man seine Stimme f&uuml;r die
Portierung des Tools ICQ auf den AMIGA abgeben. Das Vorhaben wird von
mehreren Organisationen unterst&uuml;tzt.
Mit ICQ k&ouml;nnen Internet-Nutzer feststellen, ob z.B. ein Bekannter gerade
online ist und mit ihm Kontakt aufnehmen, um zu "chatten", Daten
auszutauschen usw.
<LI>Nachdem in den letzten Wochen &uuml;ber einen Aufkauf von Gateway 2000 durch
ein anderes Unternehmen spekuliert wurde, erkl&auml;rten f&uuml;hrende Mitarbeiter
von Gateway, da&szlig; das Unternehmen nicht zum Verkauf stehe. Bereits vor
wenigen Monaten wurde ein Aufkauf durch den Konkurrenten Compaq f&uuml;r
m&ouml;glich gehalten.<P>

<B>Hintergrund:</B>
In Zusammenhang mit dieser Meldung sind zwei (potentielle)
Mi&szlig;verst&auml;ndnisse anzusprechen:<P>
<OL>
<LI>Die Ger&uuml;chte &uuml;ber einen m&ouml;glichen Aufkauf h&auml;ngen nicht mit einer
eventuell schlechten Finanzlage des Unternehmens zusammen, im
Gegenteil: Gateway 2000 geht es gut und ist gerade deshalb f&uuml;r noch
gr&ouml;&szlig;ere Unternehmen, die weiter wachsen wollen, ein bevorzugtes
Kaufobjekt. Vor wenigen Wochen erst hat ein bekannter B&ouml;rsen-Analyst
dazu geraten, Gateway-Aktien zu kaufen, da ein st&auml;rkerer Anstieg des
Kurses zu erwarten sei. Bis dahin lautete der Rat in bezug auf Aktien
dieses Unternehmens "halten".<P>
Zwar hat Gateway 2000 im j&uuml;ngsten Quartalsbericht einen Verlust von
107,1 Mio. US-Dollar eingestehen m&uuml;ssen, jedoch resultiert dies v.a.
aus dem notwendigen Verkauf umfangreicher Lagerbest&auml;nde zu nicht
kostendeckenden Preisen und dem 60 Mio. US-Dollar teuren Aufkauf von
ALR im Juli dieses Jahres, so da&szlig; im n&auml;chsten Quartal wieder von einem
Gewinn ausgegangen werden mu&szlig;.<P>
<LI>Selbst wenn es zu einem Aufkauf kommen sollte, k&ouml;nnte man noch nichts
&uuml;ber die Konsequenzen f&uuml;r den AMIGA-Zweig von Gateway 2000 sagen. Da
aufgekaufte Unternehmen jedoch oft faktisch ihre betriebliche
Unabh&auml;ngigkeit behalten, w&auml;re es gut m&ouml;glich, da&szlig; sich gar nichts
&auml;ndern w&uuml;rde.<P><BR>
</OL><P><BR>
<H2 ALIGN=CENTER>Von DOSen und &Auml;pfeln:</H2>
<UL>
<LI>Das US-Justizministerium will erreichen, da&szlig; Microsoft wegen illegaler
Lizenzpraktiken gerichtlich zur Zahlung eines Zwangsgelds von t&auml;glich 1
Mio. US-Dollar verurteilt wird. F&uuml;hrende Mitarbeiter von Gateway 2000 und
Compaq best&auml;tigten die Vorw&uuml;rfe unterdessen in eidesstattlichen
Erkl&auml;rungen.
<LI>Intel und Digital Equipment (Hersteller des Alpha-Prozessors) haben eine
weitreichende Kooperation bekanntgegeben, die u.a. die gemeinsame
Entwicklung von 64Bit-Systemen auf Grundlage von Intel-Technologie
vorsieht.
<LI>Apple hat im abgelaufenen vierten Gesch&auml;ftsquartal einen Verlust von 161
Mio. US-Dollar gemacht. Interims-CEO Steve Jobs zeigte sich dennoch mit
dem Ergebnis zufrieden.
<LI>Meldungen zufolge will Steve Jobs nun doch f&uuml;r l&auml;ngere Zeit Chief
Executing Officer bei Apple bleiben.
</UL>
<CENTER><BR><A HREF="0704.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0900.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 11/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash1.gif" ALT="[Newsflash]" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

