<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      3DPong
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling14062004">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="images/jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Text ohne Tabelle">
      <TR>
        <TD>
          <H2 align="center">
            <B>3DPong</B>
          </H2>
          <BR>

          <P>
            <FONT size="7">W</FONT> ieder einmal ist es gelungen, ein altes Videospiel (damals noch "Telespiel") zu neuem Leben zu erwecken.<BR>
             Wenn ich mich recht erinnere, war es das erste Videospiel &uuml;berhaupt: Pong. Das waren eigentlich nur zwei dicke vertikale wei&szlig;e Balken und ein kleines Quadrat auf schwarzem
            Hintergrund. Fertig war (Ping)Pong. Ein paar werden sich noch erinnern.<BR>
             Das heutige Pong (ca. drei&szlig;ig Jahre sp&auml;ter) ist kaum anders als sein &auml;lterer Bruder. Es gibt nat&uuml;rlich neben einer ver&auml;nderten Optik ein leicht ver&auml;ndertes
            Spiel-Prinzip zu bewundern, das nur durch ein paar Zus&auml;tze f&uuml;r das 21. Jahrhundert aufgefrischt wurde.<BR>
             Das Spiel wurde f&uuml;r moderne Amiga`s auf Warp3D/MiniGL portiert und erfordert somit eine etwas modernere Amiga-Hardware. Sound gibt es in Form von 16bit Stereo mit (englischer)
            Sprach-Ausgabe. Neu bei 3DPong sind 10 verschiedene Boni (z.B. Hindernisse, mehrfach B&auml;lle, ver&auml;nderte Ball-Geschwindigkeit), 10 unterschiedliche 3D-Hintergr&uuml;nde und sage
            und schreibe 100 Level.<BR>
            <BR>
          </P>
          <DIV align="CENTER">
            <A href="images/3dpong.1.jpg" target="_self"><IMG src="images/3dpong1.jpg" alt="Der Start-Bildschirm" width="160" height="120"></A><BR>
            <BR>
             Zu zweit oder allein...
          </DIV>
          <BR>
           <BR>
           Zum Spiel-Prinzip:<BR>
           Gespielt wird Pong zu zweit oder gegen den Computer. Zwei am linken und rechten Bildrand befindliche vertikal bewegliche Schl&auml;ger spielen mit einem Ball Pong. Verfehlt einer der
          Schl&auml;ger (Spieler) den Ball, verl&auml;&szlig;t dieser das Spielfeld und der Gegner erh&auml;lt einen Punkt.<BR>
           So weit so einfach. Wie im richtigen Leben kann der Ball angeschnitten werden und wird dadurch unberechenbarer. Zus&auml;tzlich k&ouml;nnen die Schl&auml;ger in einem kleinen Bereich auch
          horizontal bewegt werden. So erh&ouml;ht sich der Schwierigkeitsgrad noch etwas.<BR>
           Als Gag bewegt sich das ganze Spielfeld: es wird st&auml;ndig ungleichm&auml;&szlig;ig ran und weg gezoomt.<BR>
           <BR>
           Zur Optik:<BR>
           Die beiden Schl&auml;ger sind Zylindrisch und mit einer Textur belegt, die st&auml;ndig rotiert. Der Hintergrund wird durch einen sich st&auml;ndig &auml;ndernde 3D-Textur erzeugt. Das
          sieht sehr unruhig aus und ist auch gew&ouml;hnungsbed&uuml;rftig. Erfreulicherweise l&auml;&szlig;t sich dieser Hintergrund abstellen, was als Nebeneffekt auch die Geschwindigkeit des
          Spiels erh&ouml;ht.<BR>
           Spiel-St&auml;nde sowie Verlierer oder Gewinner werden optisch und sprachlich "angezeigt". Sehr sch&ouml;n ist, das man das Spiel nach jedem Level beenden kann (automatische
          Spiel-Speicherung) und bei einem Neustart bei dem n&auml;chsten Level weiterspielen kann.<BR>
           <BR>

          <DIV align="CENTER">
            <A href="images/3dpong.2.jpg" target="_self"><IMG src="images/3dpong2.jpg" alt="Mitten im Spiel" width="160" height="120"></A><BR>
            <BR>
             Das Spiel l&auml;uft...
          </DIV>
          <BR>
           <BR>
           <BR>
           Zur Technik:<BR>
           Vorausgesetzt wird folgende Hardware: Warp3D, AHI, 68040/PPC, Lucyplay.library (im Archiv enthalten).<BR>
           Das Spiel liegt in zwei Versionen vor: eine f&uuml;r 68040-Prozessoren und eine f&uuml;r PPC-Prozessoren. Gestartet wird Pong &uuml;ber kleine Skript-Dateien die leicht an die eigenen
          Bed&uuml;rfnisse angepasst werden k&ouml;nnen. Vier Skripte werden mit geliefert: f&uuml;r beide Prozessoren jeweils ein Skript f&uuml;r eine Screen- und eine Window-Version.<BR>
           Gesteuert wird 3DPong mit dem Joystick oder Tastatur (1 Spieler) oder nur mit der Tastatur (2 Spieler).<BR>
           Kleines Bonbon: durch dr&uuml;cken der "G"-Taste werden Screen-Shots erstellt und in der Ram-Disk gespeichert.<BR>

          <P>
            <B>Die Installation:</B> einfach nur die passende (040) Lucyplay.library nach Libs: kopieren.<BR>
             Eine lauff&auml;higes AHI-System sollte vorhanden sein.<BR>
             3DPong unterst&uuml;tzt folgende <B>CPU`s</B>: 68040 und PPC<BR>
             <B>Ben&ouml;tigtes OS:</B> keine Angabe; getestet mit 3.9<BR>
             <B>3DPong V 1.0</B> ist <B>Freeware</B> und zu beziehen: <A href="http://www.nic.fi/~varsa/index.html ">Jukka Varsaluoma</A><BR>
             <B>Das Archiv</B> hat eine Gr&ouml;sse von ca. 3,2 MByte.<BR>
             <B>Autor:</B> <A href="mailto:tusca@nic.fi">Jukka Varsaluoma</A>
          </P>
          <P>
            <B>Mein Fazit:</B> F&uuml;r Nostalgiker: einfach mal testen. F&uuml;r andere: auch mal testen.
          </P>
          <HR>
          <BR>

          <CENTER>
            <BR>

            <CENTER>
              <IMG src="images/jojo.jpg" alt="JoJo" width="212" height="50">
            </CENTER>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

