<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <!-- Author = Christine Kahlert -->

    <TITLE>Traditioneller Blindenberuf - Grund zum
    Sch&auml;men?</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "6"><B>Traditioneller Blindenberuf - Grund zum
          Sch&auml;men?</B></FONT></P>

          <P>Manchmal, wenn ich so im Internet st&ouml;bere oder in
          den Mailinglisten lese oder auch Gespr&auml;che mit
          Bekannten f&uuml;hre, habe ich den Eindruck, dass ich gar
          nicht laut sagen d&uuml;rfte, dass ich bereits 29 Jahre
          lang einen traditionellen, oder wie manche sagen,
          typischen Blindenberuf aus&uuml;be und dar&uuml;ber nicht
          tot ungl&uuml;cklich, abgestumpft oder resigniert
          bin.</P>

          <P>Mein Name ist Christine Kahlert. Ich stamme aus einem
          kleinen Ort in Nieder&ouml;sterreich in der N&auml;he von
          St. P&ouml;lten. Meine Pflichtschulzeit habe ich im
          Bundes-Blindenerziehungsinstitut in Wien hinter mich
          gebracht, wo ich anschlie&szlig;end auch zur Telefonistin
          und Stenotypistin ausgebildet wurde.</P>

          <P>Nachdem ich die Telefonistenpr&uuml;fung mit gutem
          Erfolg, die staatliche Stenotypistenpr&uuml;fung mit
          Auszeichnung abgelegt hatte, ging es an die Jobsuche, die
          anfangs vom BBI (bundes-Blindenerziehungsinstitut)
          gesteuert, beinahe wie ein Ballspiel aussah: Denn der
          Leiter der Stenotypistenklasse war der Meinung, dass mir
          der Telefonistenausbildner bei der Jobsuche helfen
          sollte, weil ich mir eher eine Arbeit am Telefon als an
          der Schreibmaschine vorstellen konnte, der
          Telefonistenausbildner war gegenteiliger Meinung, und so
          passierte zun&auml;chst einmal genau - nichts. Aber als
          ich schon ziemlich ge&uuml;bt im Bewerbungen schreiben
          und im Ablehnungen sammeln war, erfuhr ich von einem
          Bekannten meiner Eltern, dass die Institution, bei der er
          ehrenamtlich mitarbeitete, gerne eine andere als die
          momentane Telefonistin h&auml;tte, aber es im Moment
          keinen Weg g&auml;be, diese an eine andere Stelle zu
          versetzen. Und so bewarb ich mich auf gut Gl&uuml;ck.</P>

          <P>Das Vorstellungsgespr&auml;ch war sehr aufrichtig,
          aber schonungslos. Der Personalchef erkl&auml;rte mir,
          dass sie noch nie eine blinde Person angestellt hatten
          und daher auch nicht wissen, ob ich die Arbeit in der
          Telefonzentrale zur Zufriedenheit aller ausf&uuml;hren
          k&ouml;nnte, ohne auch selber &uuml;berfordert zu sein.
          Aber ich bekam eine faire Chance, und es wurde mir eine
          pensionierte Telefonistin beigestellt, die mich 3 Wochen
          lang einschulen sollte. Und das Gl&uuml;ck blieb
          weiterhin auf meiner Seite, denn ich hatte genau die
          gleiche Anlage - nur doppelt so gro&szlig; - wie wir sie
          im BBI als &Uuml;bungsanlage hatten. Da ich das aber
          vorher nicht wusste und auf keinen Fall Namen,
          Telefonnnummern und Anlage gleichzeitig erarbeiten
          wollte, nahm ich mir nach dem Vorstellungsgespr&auml;ch
          das Telefonverzeichnis der Institution mit nach Hause,
          lie&szlig; es mir von meiner Mutter ansagen und lernte es
          in den mir verbleibenden 4 Wochen bis Arbeitsantritt wie
          verr&uuml;ckt auswendig.</P>

          <P>Aber der Erfolg gab mir recht, denn so konnte ich
          meine Arbeit v&ouml;llig unbelastet antreten, und obwohl
          mir in meiner Ausbildungszeit des&ouml;fteren
          w&auml;rmstens versichert wurde, dass ich f&uuml;r diesen
          Beruf v&ouml;llig ungeeignet w&auml;re, hatte ich einen
          guten Start. Damals war unsere angeschlossene
          Telefonfamilie noch relativ klein 100 Nebenstellen, und
          es dauerte nicht lange, bis wir einander pers&ouml;nlich
          kannten. Und hatte jemand Vorurteile gegen eine blinde
          Telefonistin gehabt, so hat er die wohl nie ausgesprochen
          oder versteckt, da ich mich mit der Mehrheit meiner
          Teilnehmer sehr gut verstand. Das ging sogar so weit,
          dass es bald zur Tradition wurde, dass ich jedes Jahr am
          1. April mir irgend etwas einfallen lie&szlig;, meine
          Teilnehmer in den April zu schicken. Als mir nach 4
          Jahren einmal die Ideen ausgingen, waren alle richtig
          entt&auml;uscht. Aber daf&uuml;r schlug ich im 5. Jahr
          wieder heftig zu. Ich schickte alle ans Fenster, weil ich
          wissen wollte, wie viele Leute bei einer Demo am
          Stephansplatz zu sehen w&auml;ren. Nat&uuml;rlich war von
          einer Demo weit und breit keine Rede, glaubte ich
          jedenfalls, bis ich mit meiner Schickerei auch zu einer
          Sekret&auml;rin kam, die mir ernsthaft versicherte: "Sie
          haben sich geirrt: Die Demonstration ist doch erst
          f&uuml;r 18 Uhr angesagt." :-) Und mit der Zeit kam die
          Zentralisierung in Mode, d. H. es wurden 3
          Telefonvermittlungen zu einer zusammengelegt, und ich
          hatte pl&ouml;tzlich statt 100 Nebenstellen 500, von
          denen ich aber keine schriftlichen Unterlagen hatte.
          Allerdings arbeitete ich da mit einer Kollegin zusammen,
          die sehr kooperativ war, und so lernte ich nach und nach
          auch die andern 400 einordnen, aber leider nicht kennen.
          Einige Jahre danach hielt der PC Einzug in meinen
          Arbeitsbereich. Zun&auml;chst nur so weit, dass ich meine
          Telefondatenbank gewartet und f&uuml;r alle ausgedruckt
          habe. Das entfiel, als die PC-Vermittlung in unseren
          Betrieb einzog, da &uuml;bernahm der EDV-Telefon-Mann die
          Wartung des Telefonbuches.</P>

          <P>Und seit etwas &uuml;ber einem Jahr habe ich auch
          Internet im B&uuml;ro und bin auch ans Hausnetz
          angeschlossen. Meine Abteilungsleiterin, die 1997 uns
          vorgesetzt wurde, war sofort auf meiner Seite und
          verstand v&ouml;llig, dass f&uuml;r mich als blinde
          Telefonistin, das Internet eine enorme
          Arbeitserleichterung und einen gro&szlig;en Schritt in
          Richtung Selbst&auml;ndigkeit darstellte. Aber unsere EDV
          f&uuml;hlte sich dem Problem, mir einen Internetanschluss
          zu verpassen, nicht wirklich gewachsen und lie&szlig;
          sich Zeit, denn manche Probleme l&ouml;sen sich
          bekanntlich von selber, wenn man sie vor sich herschiebt,
          meins nicht. Ich gab n&auml;mlich keine Ruhe, bis der
          zust&auml;ndige EDV-Mann, &uuml;brigens inzwischen
          bereits der 3. dem das Projekt &uuml;bertragen wurde,
          eine Besprechung mit meiner Vorgesetzten anberaumte, weil
          man doch f&uuml;r einen Computer einer blinden
          Mitarbeiterin eine spezielle Netzwerkkarte f&uuml;r
          Braille ben&ouml;tigt, die meine Vorgesetzte bewilligen
          sollte, nur wo eine solche Karte her bekommen? :-) Und
          der Mann l&ouml;ste das Problem ganz einfach, indem er
          das Projekt an einen weiteren Mitarbeiter &uuml;bertrug.
          Und der schritt dann sogar zur Tat und wollte mir eine
          Netzwerkkarte einbauen. Da an meinem PC aber jede Art von
          Tieren, so auch M&auml;usen keinen Zugang hat, tat er
          sich ziemlich schwer. Rettend sprang dann mein guter
          Engel, meine PC-Rettung und -feuerwehr in einem, der
          Systemadministrator vom BBI, Michael Rohlfing ein, der
          gemeinsam mit unserer EDV das Projekt zu einem positiven
          Abschluss f&uuml;hrte. Und ich bin jeden Tag dankbar
          f&uuml;r die Erleichterung und Annehmlichkeiten, die mir
          das Internet f&uuml;r meinen Beruf bringt. Im Hausnetz
          darf ich auch auf s&auml;mtliche Informationen zugreifen,
          die f&uuml;r eine Vermittlungskraft von Wert sind, nur
          leider sind s&auml;mtliche Infodateien im PDF-Format
          abgelegt, das mein Screenreader Window-Eyes zwar gut
          lesen, aber nicht formatieren kann, was bei Telefonlisten
          zu ziemlicher Verwirrung f&uuml;hren kann.</P>

          <P>Vor 12 Jahren habe ich mich entschlossen, meinen
          Fulltimejob in einen Teilzeitjob (25 Stunden die Woche)
          umzugestalten, da ich sehr vielen Interessen in meiner
          Freizeit nachgehen will, und mir Lebensqualit&auml;t
          wichtiger ist, als Geld, bin ich halt ein bisschen
          sparsamer. Ich habe fr&uuml;her sehr viel in Ch&ouml;ren
          gesungen, lese gern, besch&auml;ftige mich auch gern mit
          dem Computer und surfe und chatte gern im Internet.</P>

          <P>Ja, ich mag meinen Beruf - wenn auch nicht immer -
          manchmal k&ouml;nnte ich alle Anrufer (und manchmal auch
          meine Kollegin) erw&uuml;rgen, und manchmal gibt es so
          viel Situationskomik wie, glaube ich, kaum in einem
          anderen Beruf.</P>

          <P>Christine Kahlert<BR>
          &copy; 2003 by Christine Kahlert</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

