<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

    <TITLE>Lese-Ecke - B&uuml;chervorstellungen</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Lese-Ecke</B></FONT><BR>
          <FONT color="#000080" size="5">&lt;http://www.leseecke.sulex24.de&gt;</FONT></P>
          <A name="top"></A> 

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Der Vogelmann</A></LI>

            <LI><A href="#a02">Interview mit einem Vampir</A></LI>

            <LI><A href="#a03">Die Behandlung</A></LI>

            <LI><A href="#a04">Der F&uuml;rst der Finsternis</A></LI>

            <LI><A href="#a05">Die Versuchung</A></LI>

            <LI><A href="#a06">Menschenjagd</A></LI>

            <LI><A href="#a07">Per Anhalter durch die Galaxis</A></LI>

            <LI><A href="#a08">Der Medicus von Saragossa</A></LI>

            <LI><A href="#a09">Tod und Teufel</A></LI>

            <LI><A href="#a10">Carrie</A></LI>

            <LI><A href="#a11">Das Silmarillion</A></LI>

            <LI><A href="#a12">Harry Potter und der Stein der Weisen</A></LI>

            <LI><A href="#a13">Roter Drache</A></LI>

            <LI><A href="#a14">Harry Potter und die Kammer des Schreckens</A></LI>

            <LI><A href="#a15">Der Fluch des Kopernikus</A></LI>

            <LI><A href="#a16">Die Ecstasy-Aff&auml;re</A></LI>

            <LI><A href="#a17">Desiree</A></LI>

            <LI><A href="#a18">Tanamera. Der Roman Singapurs</A></LI>

            <LI><A href="#a19">Seide</A></LI>

            <LI><A href="#a20">Mein Leben in Bhutan</A></LI>

            <LI><A href="#a21">Harry Potter und der Gefangene von Askaban</A></LI>

            <LI><A href="#a22">Das Avalon-Projekt</A></LI>

            <LI><A href="#a23">Harry Potter und der Feuerkelch</A></LI>

            <LI><A href="#a24">Harry Potter und der Orden des Ph&ouml;nix</A></LI>

            <LI><A href="#a25">Nomadentochter</A></LI>
            <!-- <LI><A href="#a26"></A></LI>  -->
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>Buchtitel: Der Vogelmann<BR>
          Autor: Hayder, Mo<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Goldmann<BR>
          Erscheinungsjahr: 2000<BR>
          ISBN: 3442308690<BR>
          Format: H&ouml;rbuch</H3>

          <P><B>Inhalt:</B><BR>
          Jugendliche entdecken auf einem unbenutzten Gel&auml;nde eine Frauenleiche.
          Die Obduktion ist noch nicht abgeschlossen, da werden vier weitere Leichen
          gefunden. Caffery und seine Kollegen haben es also mit einem
          Serienm&ouml;rder zu tun. Ein Beamter ist mit seinem Urteil recht schnell,
          ja zu schnell. Wichtige Hinweise die zum wahren T&auml;ter f&uuml;hren
          k&ouml;nnten, werden von ihm ignoriert. Viel wertvolle Zeit geht dadurch
          verloren.</P>

          <P>Der Romanheld Caffery, lernt bei den Ermittlungen die attraktive Malerin
          Becky kennen. Nicht nur berufliches Interesse an der jungen Frau f&uuml;hrt
          ihn immer wieder zu ihr. Becky ist es auch, die wichtige Hinweise geben
          kann. Im entscheidendem Moment kann sie Caffery telefonisch nicht erreichen
          und begeht, durch Naivit&auml;t einen schweren Fehler.</P>

          <P><B>Anmerkungen:</B><BR> Der Leser wei&szlig;, der eine Verd&auml;chtige
          hat es nicht getan. Es mu&szlig; der andere sein. Abgerechnet wird aber
          immer am Ende, als es zum gro&szlig;en Showdown kommt.</P>

          <P>Die erschienene H&ouml;rbuchfassung ist eine leicht gek&uuml;rzte
          Version des Romans. Das ist sehr schade und sollte eigentlich verboten
          werden. Dem Genuss des Buches schadet es aber nicht.</P>

          <P>Das H&ouml;rbuch erschien im September 2000 auf vier Audio-CDs (CD - BMG
          Wort) und wird gelesen von Tatortkommissar Dietmar B&auml;r.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>Buchtitel: Interview mit einem Vampir<BR>
          Autor: Rice, Anne O'Brien<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Goldmann<BR>
          Erscheinungsjahr: 1989<BR>
          ISBN: 3-442-43053-4<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Ende des 18. Jahrhunderts ist Louis gerade erst Mitte 20, doch sein Leben
          ist f&uuml;r ihn nicht weiter lebenswert. Er spielt mit dem Gedanken an
          Selbstmord, als ihn Lestat aufsucht, um ihn zu seinem Gef&auml;hrten und
          Lehrling zu machen. Lestat ist ein Vampir, selbst schon Jahre auf der Suche
          nach seinesgleichen in der neuen Welt, bis er schlie&szlig;lich auf Louis
          trifft. Louis nimmt das dunkle Geschenk von Lestat an, wie er es selbst in
          den n&auml;chsten Jahren und Jahrhunderten zu nennen pflegt, und wird zu
          einem Vampir.</P>

          <P>Die ersten jahrzehnte sind f&uuml;r Louis mehr eine Qual als der Genuss,
          den ihm Lestat f&uuml;r das Leben des unsterblichen und m&auml;chtigen
          Vampirs vorausgesagt hat. Lang dauert es, bis er sich damit abfinden kann,
          Menschen t&ouml;ten zu m&uuml;ssen, um &uuml;berleben zu k&ouml;nnen.
          Lestat f&uuml;rchtet, er k&ouml;nnte Louis so schnell wieder verlieren, da
          dieser sein neues Leben nicht als Erl&ouml;sung von seinem alten sieht,
          sondern eher als H&ouml;lle. Die beiden treffen in einer von der Pest
          gesch&uuml;ttelten Stadt schlie&szlig;lich auf Claudia, ein M&auml;dchen
          von gerade erst f&uuml;nf Jahren, neben ihr ihre eben erst verstorbene
          Mutter. Und sie wird das erste menschliche Opfer von Louis. Doch Lestat
          rettet das kleine M&auml;dchen, l&auml;sst sie von seinem Blut trinken und
          macht sie damit ebenfalls zum Vampir. Da ein Vampir nie wieder anders
          aussehen wird als zu dem Zeitpunkt, da er sein Leben als Mensch beendet
          hat, ist Claudia verdammt, ihr langes, unsterbliches Leben als kleines
          M&auml;dchen zu f&uuml;hren.</P>

          <P>Damit ist eines der h&ouml;chsten Gesetze der Vampire selbst gebrochen
          worden, welches besagt, dass kein Vampir geschaffen werden d&uuml;rfe, der
          allein schwer &uuml;berlebensf&auml;hig w&auml;re. Und so ist es, denn
          Claudia ist von den beiden M&auml;nnern abh&auml;ngig und in ihr
          w&auml;chst langsam ein Hass gegen Lestat heran, der sie nicht nur zu
          dieser Abh&auml;ngigkeit, sondern auch zu einem Leben verurteilt hat, in
          dem sie niemals zur Frau werden wird, und so nehmen die Ereignisse
          unaufhaltsam ihren lauf.</P>

          <P><B>Aus den Buch:</B> <BR>
          "Ich verstehe ...", sagte der Vampir nachdenklich und ging langsam durch
          das Zimmer zum Fenster hin&uuml;ber. Dort blieb er eine Weile stehen. Seine
          Gestalt zeichnete sich vor dem tr&uuml;ben Licht ab, das von der Divisadero
          Street hereindrang und ab und zu durch die hellen Scheinwerfer der Autos
          verst&auml;rkt wurde. Der Junge konnte jetzt die Zimmereinrichtung
          deutlicher erkennen, den runden Eichentisch, die St&uuml;hle und ein
          Waschbecken, das an der Wand hing, mit einem Spiegel dar&uuml;ber. Er
          setzte seine Aktentasche auf dem Tisch ab und wartete. </P>
                    
          <P>"Wie viel B&auml;nder hast du mitgebracht?" fragte der Vampir und wandte
          den Kopf, so dass der Junge sein Profil sehen konnte. "Genug f&uuml;r die
          Geschichte eines Lebens?"</P>

          <P>"Bestimmt, wenn es ein gutes Leben ist. Manchmal interviewe ich drei bis
          vier Leute an einem Abend, wenn ich Gl&uuml;ck habe. Aber es muss eine gute
          Geschichte sein. Das ist nur recht und billig, nicht wahr?"</P>

          <P>"Bewundernswert recht und billig", antwortete der Vampir. "Dann will ich
          dir gern meine Lebensgeschichte erz&auml;hlen. Ich werde es sehr gern
          tun."</P>

          <P>"Gro&szlig;artig", sagte der Junge. Und er nahm schnell das kleine
          Tonbandger&auml;t aus der Tasche und pr&uuml;fte die Kassette und die
          Batterien. "Ich bin wirklich gespannt zu h&ouml;ren, warum Sie das glauben,
          warum Sie ..."</P>

          <P>"Nein", unterbrach ihn der Vampir. "So k&ouml;nnen wir nicht beginnen.
          Ist dein Apparat in Ordnung?"</P>

          <P>"Ja", sagte der Junge.</P>

          <P>"Dann setz dich. Ich will die Deckenbeleuchtung einschalten."</P>

          <P>"Ich dachte, Vampire m&ouml;gen kein Licht", sagte der Junge. "Wenn man
          bedenkt, dass die Dunkelheit zur Atmosph&auml;re beitr&auml;gt..." Doch
          dann schwieg er. Der Vampir beobachtete ihn, den R&uuml;cken zum Fenster.
          Das Gesicht war jetzt nicht zu erkennen, und etwas an der ruhigen Gestalt
          verwirrte den Jungen. Er wollte sprechen, unterlie&szlig; es jedoch. Und
          dann atmete er erleichtert auf, als der Vampir zum Tisch trat und nach der
          Lichtschnur dar&uuml;ber griff. Unvermittelt war das Zimmer in grelles,
          gelbes Licht getaucht; und als der Junge zum Vampir aufblickte, verschlug
          es ihm den Atem. Er tastete mit den H&auml;nden nach hinten, um sich an der
          Tischkante festzuhalten. "Gro&szlig;er Gott!" fl&uuml;sterte er, und dann
          starrte er den Vampir sprachlos an. Der Vampir war ganz und gar wei&szlig;
          und glatt, als w&auml;re er aus gebleichten Knochen geschnitzt, und sein
          Gesicht war unbewegt wie das einer Statue, die beiden leuchtendgr&uuml;nen
          Augen ausgenommen, die den Jungen ansahen wie Flammen in einem
          Totensch&auml;del. Doch dann l&auml;chelte er fast wehm&uuml;tig, und in
          der glatten, wei&szlig;en Fl&auml;che seines Gesichts zeigten sich feine
          Linien wie in einer Zeichnung. "Siehst du!" sagte er leise.</P>

          <P>Den Jungen schauderte; er hob die Hand, wie um sich gegen ein
          &uuml;berm&auml;chtiges Licht zu sch&uuml;tzen. Seine Augen glitten langsam
          &uuml;ber den tadellos geschneiderten Rock, die langen Falten des Umhangs,
          die schwarze Seidenkrawatte und den gl&auml;nzend wei&szlig;en Kragen, der
          so wei&szlig; war wie das Fleisch des Vampirs. Er starrte auf das volle,
          schwarze Haar, das in Wellen &uuml;ber den Ohren zur&uuml;ckgek&auml;mmt
          war, auf die Locken, die den Rand des wei&szlig;en Kragens kaum
          ber&uuml;hrten. "Nun, m&ouml;chtest du immer noch dein Interview?" fragte
          der Vampir.</P>

          <P>Der Junge &ouml;ffnete den Mund, ohne einen Ton herauszubringen. Er
          nickte. Dann sagte er "Ja".</P>

          <P>Der Vampir setzte sich langsam ihm gegen&uuml;ber, beugte sich vor und
          sagte sanft, fast vertraulich: "F&uuml;rchte dich nicht. Las nur das Band
          laufen." Und dann streckte er den Arm &uuml;ber den ganzen Tisch aus. Der
          Junge schrak zur&uuml;ck; der Schwei&szlig; lief ihm &uuml;bers Gesicht.
          Der Vampir umklammerte die Schulter des Jungen und sagte: "Ich tue dir
          nichts, glaube mir. Ich brauche diese Gelegenheit. Sie ist f&uuml;r mich
          wichtiger, als du dir jetzt vorstellen kannst. Bitte fange nun an." Er zog
          die Hand zur&uuml;ck und blieb gefasst und abwartend sitzen."</P>

          <P><B>Anmerkungen:</B> <BR>
          Anne Rice ist wieder eine von vielen, die sich am Thema Vampir versucht
          haben, aber ich muss ehrlich sagen, sie ist die erste, die versucht, die
          Mythen, welche sich um diese Wesen ranken mit Logik zu durchleuchten.
          Interview mit einem Vampir ist nur der erste von sechs Teilen aus ihrer
          ""Chronik der Vampire" und in den darauffolgenden B&uuml;chern setzt sie
          diese Geschichte herausragend fort. Und vielleicht ist es gerade ihre
          logische Art, Vampire zu betrachten, die sie f&uuml;r den Leser um einiges
          greifbarer und vor allem leichter erfassbar macht. Die Vorstellung dieser
          Wesen wirkt nicht mehr ganz so fern und fantastisch, wie sie es
          sp&auml;testens seit Stokers Dracula geworden ist. Vampire verbrennen in
          der Sonne, sie haben ein Spiegelbild, Knoblauch schadet ihnen nur, sofern
          sie eine Allergie dagegen haben, Kruzifixe schauen sie sich zuweilen sogar
          recht gern an, und selbst Silber ist f&uuml;r sie keine weniger normale
          Angelegenheit, als f&uuml;r uns. Nur eben Sonne t&ouml;tet sie, Sonne und
          Feuer. Sie ern&auml;hren sich vom Blut der Menschen, und zuweilen auch
          voneinander, was eher zum Vergn&uuml;gen oder zur Heilung gelegentlicher
          Verletzungen geschieht, und ihre Kr&auml;fte wie das Lesen der Gedanken
          oder das Fliegen entwickeln sie nur durch das &Auml;lterwerden, oder das
          Blut eines &auml;lteren und damit M&auml;chtigeren Vampirs. </P>
                    
          <P>Rice f&uuml;llt die L&uuml;cken, welche unsere eigene Geschichte
          aufzuweisen hat mit der Geschichte der Vampire, die bis ins alte
          &Auml;gypten zur&uuml;ckreicht. Sie schafft mit den Vampiren Wesen, mit
          denen man nicht weniger mit leidet, als man es bei menschlichen
          Hauptfiguren t&auml;te.</P>

          <P>Dieses Buch ist neben zuweilen recht schwer verdaulich geschilderten
          Erlebnissen der Hauptcharaktere auch voll von inneren Dialogen, denen der
          Leser gut folgen kann und die zumindest mir nie langweilig geworden
          sind.</P>

          <P>Interview mit einem Vampir ist nicht nur sehr gut zu lesen, es ist auch
          etwas neues, und macht Lust auf die f&uuml;nf B&uuml;cher, die diesem band
          folgen.</P>

          <P>Der Regisseur Neil Jordan verfilmte dieses Buch in den 90ern, und auch
          dieses Werk ist sehr gut gelungen. Sei es nun mit der Hauptrollenbesetzung
          durch Tom Cruise und Brad Pitt, als Lestat und Louis, sei es durch die
          Buchgetreue Darstellung der Geschichte.</P>

          <P>Sowohl das Buch, als auch der Film lohnen sich allemal.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>Buchtitel: Die Behandlung<BR>
          Autor: Hayder, Mo<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Random House Audio<BR>
          Erscheinungsjahr: 2002<BR>
          ISBN: 3898303497<BR>
          Format: Audio</H3>

          <P><B>Inhalt:</B><BR>
          Eine kleine Familie lebt haupts&auml;chlich von Sozialunterst&uuml;tzung.
          So kommt es, dass am Freitag h&auml;ufig kein Geld mehr f&uuml;r den
          H&auml;ndler &uuml;brig ist und er schreibt an. Sp&auml;testens Montag
          bekommt er dann sein Geld. Anders an diesem Montag. Am Abend macht er sich
          zu einem Spaziergang mit seinem Sch&auml;ferhund auf und will die Familie
          besuchen, um sein Geld einzufordern. Es scheint niemand da zu sein. Oder?
          Irgend etwas in diesem Haus stimmt nicht.</P>

          <P>Caffery und seine Kollegen von der Mordkommission k&ouml;nnen die
          schwerverletzte Frau und ihren fast toten Mann aus dem Haus bergen. Aber wo
          ist der kleine Junge?</P>

          <P>Die Enttarnung des T&auml;ters ist eine grausame Entdeckung. Caffery
          &uuml;berzeugt seine Chefin, dass der T&auml;ter einen Komplizen gehabt
          haben muss und h&ouml;chstwahrscheinlich gerade in diesem Moment eine
          weitere Familie in gro&szlig;er Gefahr schwebt. Seine Vermutung ist
          richtig.</P>

          <P>Als Parallelfall wird eine Kindesentf&uuml;hrung aus der Vergangenheit
          des Detektivs erz&auml;hlt, deren Aufkl&auml;rung sich bis in die Gegenwart
          hinzieht und ebenfalls f&uuml;r entsetzliche &Uuml;berraschungen gut ist.
          Seine Hartn&auml;ckigkeit an diesem zweiten Fall ist verst&auml;ndlich.
          Damals wurde sein Bruder entf&uuml;hrt. Becky dr&auml;ngt ihn, die alte
          Geschichte auf sich beruhen zu lassen. Sie meint, es bringe ihm seinen
          Bruder nicht zur&uuml;ck.</P>

          <P><B>Anmerkungen:</B><BR>
          In diesem Roman treffen wir Figuren aus "Der Vogelmann" wieder.
          Pers&ouml;nliche Probleme zwischen Rebecker und Caffery, die in diesem
          Krimi ein Paar sind, haben ihren Ursprung in dem vorigen Fall.</P>

          <P>"Der Vogelmann" von Mo Hayder wurde in diesem Forum ebenfalls
          vorgestellt.</P>

          <P>"Die Behandlung" ist aber anders. Hier wird der Leser von einem
          Spannungsmoment zum n&auml;chsten gef&uuml;hrt. Die beiden beschriebenen
          F&auml;lle dieses Romans sind voneinander scheinbar unabh&auml;ngig,
          besch&auml;ftigen die Hauptfigur jedoch gleichzeitig und bieten ein
          Wechselbad der Gef&uuml;hle. Wie man &uuml;ber einige Stellen lachen muss,
          kann man an anderen Stellen schon wieder tief traurig werden, und an wieder
          anderen voller kribbelnder Spannung sein.</P>

          <P>Mo Hayder scheut sich nicht, die Dinge beim Namen zu nennen. Genauso
          detailliert wie sie beschreibt, dass gefesselten Gefangenen nach vielen
          Stunden nichts weiter &uuml;brig bleibt, als sich in die Hosen zu
          entleeren, genauso nennt sie auch die Spuren nach einem Liebesakt auf dem
          K&uuml;chentisch.</P>

          <P>Dieses Buch ist f&uuml;r Krimifans sehr zu empfehlen. Vor dieser
          Lekt&uuml;re sollte man "Der Vogelmann", ebenfalls von Mo Hayder gelesen
          haben und &uuml;ber starke Nerven verf&uuml;gen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>Buchtitel: Der F&uuml;rst der Finsternis<BR>
          Autor: Rice, Anne O'Brien<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Goldmann<BR>
          Erscheinungsjahr: 1990<BR>
          ISBN: 3-442-09842-4<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Wir schreiben 1780. Lestat ist bisher in einer recht armen Familie
          aufgewachsen und kann sich eigentlich nur einer einzigen Tat r&uuml;hmen.
          Er hat sein Dorf vor den Angriffen der W&ouml;lfe gesch&uuml;tzt und
          f&uuml;nf von ihnen get&ouml;tet. Doch das war das einzige, was seinem
          Leben vielleicht ein bisschen Glanz h&auml;tte verleihen k&ouml;nnen. Seine
          Eltern hatten nie genug Geld, um ihm eine rechte Ausbildung zukommen zu
          lassen, und so beginnt Lestat, sich in Tr&auml;umen an Paris zu verlieren.
          Sein Wunsch, nach der Klosterschule M&ouml;nch zu werden, wurde von seinen
          Eltern - haupts&auml;chlich seinem Vater - vereitelt, und auch, als er sich
          mit 17 aufmacht, mit einer Schaustellergruppe durch die Lande zu ziehen,
          holt ihn seine Familie zur&uuml;ck nach Hause. Und so lebt er vor sich hin,
          diese Monotonie allein unterbrochen von den Treffen mit seinem Freund
          Nicki, der selbst sein Studium in Paris abgebrochen hat, um sich seinen
          Lebensunterhalt mit dem Geigespielen zu verdienen, was wiederum zu
          Streitigkeiten in dessen Familie f&uuml;hrt.</P>

          <P>Und langsam bef&auml;llt Lestat die Angst davor, festzustellen, dass
          sein Leben allein das ist, nach dem es im Moment aussieht, dass es eines
          Tages zuende sein k&ouml;nnte und er feststellen m&uuml;sste, nie seinen
          Sinn herausgefunden zu haben.</P>

          <P>Schlie&szlig;lich bekommen beide unerwartete Unterst&uuml;tzung von
          Lestats Mutter, die ihrem Sohn ein wenig Geld geben und ihnen so zumindest
          die Reise nach Paris bezahlen kann. So machen sich die beiden jungen
          M&auml;nner auf, um in Paris ihr neues Leben zu beginnen. Nicki als
          Musikant, Lestat als Schauspieler in einem kleinen pariser Theater. Und so
          leben sie eine Weile, Lestat schickt seiner Mutter regelm&auml;&szlig;ig
          Briefe &uuml;ber ihre Fortschritte und sie schlagen sich mehr schlecht als
          recht durchs Leben, bis Lestat schlie&szlig;lich von Magnus aufgesp&uuml;rt
          und mitgenommen wird. Dieser ist ein Vampir und er m&ouml;chte Lestat zu
          seinesgleichen machen, gewisserma&szlig;en zu seinem Erben, denn er selbst
          m&ouml;chte seinem Leben ein Ende setzen. Und so wird Lestat zum Vampir und
          zeuge, wie Magnus selbst sich ins Feuer st&uuml;rzt um zu sterben.</P>

          <P>So beginnt Lestats Wanderung, und er sucht, wie wohl verst&auml;ndlich
          auch hier nach dem Sinn seines neuen Lebens als unsterblicher und recht
          m&auml;chtiger Vampir. Er sucht nach den Urspr&uuml;ngen, nach
          seinesgleichen, und es soll lange dauern, bis er auf Antworten
          st&ouml;&szlig;t. Louis tritt in sein Leben, ein junger sterblicher, den er
          zu seinem Gef&auml;hrten macht, und schlie&szlig;lich auch Claudia.</P>

          <P>Und nun haben wir das Jahr 1984, als Lestat aus einem sehr langen Schlaf
          aufwacht und beschlie&szlig;t, die Welt aufzur&uuml;tteln. Fasziniert vom
          Leuchten und gl&auml;nzen des sp&auml;ten zwanzigsten Jahrhunderts
          beschlie&szlig;t er, sich in den Brennpunkt der &Ouml;ffentlichkeit zu
          stellen, ein Rockstar zu werden und sein ganzes geheimnisvolles Leben als
          Buch herauszubringen.</P>

          <P>Seine Botschaft erreicht viele Millionen auf der Welt, und sie weckt
          auch das Interesse anderer Vampire. Ihre Existenz vor den Menschen geheim
          zu halten ist ihr oberstes Gebot, und Lestat hat es gebrochen. Jahrhunderte
          lang haben Menschen alle Wesen gejagt, die einen Anschein von
          &Uuml;bernat&uuml;rlichkeit gehabt haben, und man bef&uuml;rchtet, Lestat
          mit seiner Unbedachtheit, seinem Streben nach Aufmerksamkeit und Ruhm
          k&ouml;nnte den Menschen ihre Existenz wieder ins Ged&auml;chtnis
          rufen.</P>

          <P>Dies ist nicht das erste derartige Werk, denn vor Jahren erschien
          bereits "Interview with the Vampire", "angeblich" erz&auml;hlt von einem
          Vampir namens Louis, doch dieses Werk ist von kaum einem Menschen ernst
          genommen worden.</P>

          <P>Und derweil f&uuml;llen ausgaben von "Der F&uuml;rst der Finsternis" die
          Regale in den Buchl&auml;den, und Videos zu dem Rock-Album "Der F&uuml;rst
          der Finsternis" flimmern &uuml;ber den Bildschirm.</P>

          <P>Lestat wird beinahe der Mittelpunkt eines Kultes, und schlittert mit
          seinen Freunden und bekannten auf eine Katastrophe zu.</P>

          <P><B>Anmerkungen:</B><BR>
          Dies ist nun das zweite Buch aus Rices "Chronik der Vampire", und auch hier
          handelt es sich wieder um eine art Autobiographie. Doch der Erz&auml;hler
          macht nat&uuml;rlich die Geschichte aus, zumindest in diesem Punkt, denn wo
          Louis immer ein wenig zur Schwermut neigte, da er sein Leben als Vampir,
          als jemand, der Menschen t&ouml;ten muss um zu &uuml;berleben, nur schwer
          hat akzeptieren k&ouml;nnen, genie&szlig;t Lestat seine neue Existenz. Sie
          wird abgesehen von den &uuml;blichen Fragen nach dem Woher und Wohin nicht
          getr&uuml;bt, und w&auml;hrend er m&auml;chtiger und m&auml;chtiger wird,
          entdeckt er immer wieder weitere Freuden, die ihm sein Dasein als Vampir
          bereiten kann. Rice schildert in diesem Buch auch die Anf&auml;nge, welche
          die Vampire ihrer eigenen Mythologie nach genommen haben, erz&auml;hlt, wie
          sie entstanden sind und wie sie die weiteren Jahrtausende das Schicksal der
          Menschheit beeinflussten und selbst ihre eigene Entwicklung durchliefen.
          Und all dies hier auch wieder gekennzeichnet von ihrer eigenen zwingenden
          Logik, ohne die sie nichts aufbauen zu wollen scheint. Sie n&auml;hert sich
          mit gro&szlig;en Schritten unserer Zeit und beginnt pl&ouml;tzlich, in
          Begriffen zu schreiben, die uns auch etwas sagen, erz&auml;hlt, wie ein
          Star geboren wird und seine Fans um sich schart. sie schildert, wie ein
          Wesen, dass einigen wie ein Wunder erscheinen mag pl&ouml;tzlich zu etwas
          begreifbarem wird, allein dadurch, dass es sich ins Rampenlicht stellt.
          Nat&uuml;rlich halten die meisten seiner menschlichen Fans das ganze nur
          f&uuml;r eine Masche, aber Lestats erstes Konzert wird sie alle eines
          besseren belehren.</P>

          <P>Bei der Schilderung dieses Konzerts st&ouml;&szlig;t Rice den Leser in
          eine v&ouml;llig chaotische Atmosph&auml;re, aus der man bald ebenso wenig
          entrinnen kann, wie auch nur der einzelne in Lestats Publikum. Er fesselt
          seine Fans mit dem Zur-Schau-Stellen seiner au&szlig;ergew&ouml;hnlichen
          k&ouml;rperlichen F&auml;higkeiten, mit seiner Stimme, in der immer etwas
          hypnotisches liegt, wie es bei Vampiren der Fall ist.</P>

          <P>Kurz gesagt, hat man sich erst mal &uuml;ber die ersten 10 oder 20
          Seiten hinweggeplagt, beginnt dieses Buch, den Leser immer mehr zu
          fesseln.</P>

          <P>Wer den ersten Teil der Chronik der Vampire gelesen hat und davon
          angetan war, der wird auch mit dem zweiten Teil seine Freude haben.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>Buchtitel: Die Versuchung<BR>
          Autor: Baldacci, David<BR>
          Vorgestellt von: Bitschreck<BR>
          Verlag: Bastei-Verlag Gustav H. L&uuml;bbe<BR>
          Erscheinungsjahr: 1998<BR>
          ISBN: 3785710364<BR>
          Format: Audio</H3>

          <P><B>Inhalt:</B><BR>
          Die junge Frau LuAnn lebt mit ihrer 8 Monate alten Tochter und dem
          asozialen Vater des Kindes in einem alten Wohnwagen.</P>

          <P>Da erh&auml;lt sie eines Tages einen omin&ouml;sen Anruf. Sie trifft
          sich mit Jackson in einem scheinbarem B&uuml;ro. Ob sie nicht Lust
          h&auml;tte, in der Nationalen Lotterie ein paar Millionen Dollar zu
          gewinnen. LuAnn h&auml;lt das nat&uuml;rlich f&uuml;r einen schlechten
          Scherz und will das B&uuml;ro schon verlassen, als Jackson den Fernseher
          anschaltet, in dem gerade die &Uuml;bertragung der Ziehung der Lottozahlen
          beginnt. Er reicht ihr einen Zettel und wirklich, die dort stehenden Zahlen
          fallen in die K&ouml;rbe. Sie ist aber vorsichtig. Mit kriminellen
          Machenschaften will sie nichts zu tun haben.</P>

          <P>Kurz bevor die gesetzte Bedenkzeit abl&auml;uft, findet sie im Wohnwagen
          ihren erstochenen Lebenspartner vor. Der M&ouml;rder ist auch noch da und
          will keine Zeugen. LuAnn entkommt ihm. Um keinen falschen Anschuldigungen
          der Polizei ausgesetzt zu werden und das Land verlassen zu k&ouml;nnen,
          nimmt sie das Angebot an.</P>

          <P>F&uuml;r den Fall, dass sie den in Aussicht gestellten Lottogewinn
          ausgeschlagen h&auml;tte, hatte ihr Jackson vorsorglich bereits einen
          Killer geschickt, den er gerade noch rechtzeitig zur&uuml;ckpfeifen konnte.
          Der gedungene Killer beobachtet, wie LuAnn den Ort des Mordes verl&auml;sst
          und glaubt, sie h&auml;tte ihren Partner erstochen. Den zweiten Mann, er
          ist zwar verletzt, aber noch nicht tot, erledigt er gleich selbst. Auf dem
          Boden des Wohnwagens liegt ein blutgetr&auml;nkter Fetzen ihrer Bluse.
          Freund Killer steckt sich dieses Beweisst&uuml;ck ein und verfolgt die
          junge Frau bis nach New York, wohin sie aufbricht, um bei der Ziehung der
          Lottozahlen dabei zu sein.</P>

          <P>Eine junge, attraktive Frau mit viel Geld, die blitzschnell das Land
          verlassen muss und nach 10 Jahren zur&uuml;ck kehrt. Das bringt viele
          Unwegsamkeiten mit sich.</P>

          <P><B>Anmerkungen:</B><BR>
          Ein Aktionskrimi mit starken M&auml;nnern, einer sch&ouml;nen Frau, die
          trotz ihrer eigenen F&auml;higkeiten so mancher Unterst&uuml;tzung bedarf,
          einer Autojagd, Schie&szlig;ereien, Nahk&auml;mpfen und allem was so dazu
          geh&ouml;rt. Die Geschichte selber ist nicht gerade anspruchsvoll und
          steckt voller Klischees. Wer dieses Genre mag wird zufrieden sein. Mir
          selber hat diese Lekt&uuml;re nichts gegeben.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>Buchtitel: Menschenjagd<BR>
          Autor: Bachman, Richard<BR>
          Vorgestellt von: Eowyn<BR>
          Verlag: Wilhelm Heyne Verlag GmbH &amp; Co. KG, M&uuml;nchen<BR>
          Erscheinungsjahr: 1986<BR>
          ISBN: 3-453-02291-2<BR>
          Format: Digital</H3>

          <P><B>Inhalt:</B><BR>
          Wir schreiben das Jahr 2025. Nur noch wenige Autos fahren mit Benzin, die
          meisten werden durch Pressluft &uuml;ber dem Boden gehalten. Die Kluft
          zwischen arm und reich hat sich verbreitert, und von hilfreichen
          Sozialleistungen f&uuml;r die Unterschicht keine Spur. Doch es gibt
          f&uuml;r die Menschen eine M&ouml;glichkeit, sich Geld zu verdienen, und
          davon nicht wenig. T&auml;glich werden im TV Spiele ausgestrahlt, f&uuml;r
          die sich jeder bewerben kann, bei denen viele mitmachen und eine Menge
          dabei verdienen k&ouml;nnen, wenn sie es nur lang genug schaffen, im Spiel
          zu bleiben. Doch diese Game-Shows verlangen einen hohen Einsatz. Denn meist
          geht es dabei um das Leben eines Spielers.</P>

          <P>Sei es ein Risikospiel, vorrangig f&uuml;r Menschen mit Herzleiden, bei
          denen sie auf ein Laufband geschickt werden und Fragen beantworten
          m&uuml;ssen, Geld gibt es pro richtige Antwort, f&uuml;r jede falsche wird
          wieder Gewinn abgezogen und die Geschwindigkeit des Laufbandes erh&ouml;ht,
          was oft genug in Herzanf&auml;llen und &auml;hnlichem endet, sei es ein
          Spiel, dass einladend "Schwimm mit den Krokodilen" genannt wird". Viele
          solcher Spiele gibt es, und je gef&auml;hrlicher sie sind, desto h&ouml;her
          ist der Gewinn.</P>

          <P>Ben und seine Frau kommen aus der unteren Bev&ouml;lkerungsschicht,
          leben in einer "Sozialwohnung" und ern&auml;hren sich haupts&auml;chlich
          von Pillen, in denen alle n&ouml;tigen N&auml;hrstoffe enthalten sein
          sollen. Beide sind arbeitslos und Bens Frau verdient ab und an ein wenig
          Geld f&uuml;r sich, ihren Mann und die kleine Tochter, mit Prostitution.
          Das kleine M&auml;dchen leidet seit l&auml;ngerem unter einer schweren
          Lungenentz&uuml;ndung, und beide k&ouml;nnen sich die n&ouml;tige Medizin
          nicht leisten.</P>

          <P>So beschlie&szlig;t Ben eines Tages, die einzige M&ouml;glichkeit
          wahrzunehmen, und genug zu verdienen, um seine Tochter vor dem Tod zu
          retten. Er stellt sich in der langen Schlange vor dem Hauptgeb&auml;ude der
          Spielekommission an und gelangt durch medizinische Untersuchungen,
          Befragungen und Intelligenztests schlie&szlig;lich bis in ein B&uuml;ro, in
          dem man ihm sagt, dass er als Kandidat f&uuml;r die Show "Menschenjagd"
          gew&auml;hlt worden ist. In dieser Show wird der Kandidat tats&auml;chlich
          gejagt, von der Polizei, den J&auml;gern, die f&uuml;r die Kommission
          arbeiten, und zu guter Letzt auch von der Bev&ouml;lkerung selbst. Seine
          Aufgabe ist es, diese Jagd 30 Tage lang zu &uuml;berleben, bis sie
          abgeblasen wird und er einen Geldgewinn erh&auml;lt, der hoch genug ist,
          ihn das ganze Leben lang nicht v&ouml;llig ausgeben zu k&ouml;nnen.</P>

          <P>100 Dollar erh&auml;lt er f&uuml;r jede Stunde, die er &uuml;berlebt,
          100 Dollar f&uuml;r jeden Polizisten, den er auf seiner flucht t&ouml;ten
          kann. Das Ziel der J&auml;ger ist es, ihn im Laufe dieser 30 Tage zu
          erwischen und zu t&ouml;ten. Der Rekord dieser Show lag bisher bei acht
          Tagen und f&uuml;nf Stunden, es gab also noch nie &uuml;berlebende.</P>

          <P>Den J&auml;gern ist es erlaubt, jedem, der dem Kandidaten Unterschlupf
          gew&auml;hrt, so hart zuzusetzen wie n&ouml;tig, um den n&auml;chsten
          Aufenthaltsort des Gejagten herauszufinden. Und so verl&auml;sst Ben mit
          einem Vorsprung von 12 Stunden, in denen ihn niemand jagen wird, das
          Geb&auml;ude der Spielekommission, wo am n&auml;chsten Morgen die
          Verfolgung aufgenommen werden wird.</P>

          <P>Das ganze wird wie immer zu einem Riesen Medienspektakel aufgebaut, und
          schlechte Propaganda &uuml;ber Ben sorgt daf&uuml;r, dass die
          Bev&ouml;lkerung ihn nicht nur so zum Spa&szlig; oder aus m&ouml;glicher
          Geldgier heraus jagt, sondern weil sie fest der &Uuml;berzeugung ist, einen
          Verbrecher zu stellen.</P>

          <P>Ben fl&uuml;chtet als erstes in einen anderen Bundesstaat, doch muss er
          bald feststellen, dass man ihn viel zu schnell gefunden hat...</P>

          <P><B>Anmerkungen:</B><BR>
          Was wohl an diesem Buch am meisten schockt, ist die Sensationsgier der
          Leute. Sie sitzen jeden Tag in ihren mehr oder weniger gem&uuml;tlichen
          Wohnungen und schauen sich Spiele an, bei denen nicht selten Menschen ums
          Leben kommen. Menschen wie Ben werden allein durch ihre Armut immer wieder
          dazu getrieben, an diesen Shows teilzunehmen, da es die beste
          M&ouml;glichkeit ist, schnell an genug Geld heranzukommen. Das ganze artet
          in eine Hexenjagd aus, bei der es fast unm&ouml;glich scheint, irgendwo
          Unterschlupf zu finden, da diejenigen, die den Kandidaten helfen,selbst
          nicht selten ums Leben kommen.</P>

          <P>Zus&auml;tzlich neben dieser krankhaften gesellschaftlichen Erscheinung
          wird auch auf das hingewiesen, was unter der schillernden Fassade der
          Gesellschaft liegt. Das st&auml;ndige Zunehmen der Armut, Luft, die so
          verschmutzt ist, dass die F&auml;lle von Lungenkrebs bis zum Jahre 2025 um
          etwa 700% gestiegen sind und die v&ouml;llig legale Willk&uuml;r, mit der
          sozial schlechter gestellte Menschen von den sogenannten H&uuml;tern des
          Gesetzes behandelt werden.</P>

          <P>Man mag wohl meinen, das ganze w&auml;re unrealistisch, und sicher ist
          es das, aber es ist ein Extrem, das aus der Entwicklung herausgeschlagen
          wird, die wir heute schon sehen k&ouml;nnen. Allein die rapide Zunahme der
          Realityshows, die sich inzwischen auch bei uns eingenistet haben, und wie
          gierig einerseits viele Menschen sind, einen Blick in die intimste
          Privatsph&auml;re anderer Menschen zu werfen, und doch auch die
          Abgestumpftheit, die Distanz, die man zunehmend zwischen sich und das
          Geschehen im TV bringt, die in dem buch daf&uuml;r sorgt, dass dem Publikum
          nie so recht bewusst wird, dass mit jeder guten Show, die sie zu sehen
          bekommen auch Menschen umgebracht werden.</P>

          <P>Bachman ist nicht der erste Autor, der die Menschheit in mehr oder
          weniger ferner Zukunft als v&ouml;llig Hirnlose Einheit darstellt, die
          alles isst, was man ihr vorsetzt und eine angenehm abgestumpfte Blutgier an
          den Tag legt, die zwar Leben fordert, aber auch nicht den rechten Ernst bei
          den Menschen heraufbeschw&ouml;rt.</P>

          <P>Es ist also nicht neu, und doch erschreckend, von dem Spannungsfaktor
          mal v&ouml;llig abgesehen.</P>

          <P>Meiner Meinung nach h&auml;tte man mehr aus diesem Thema herausholen
          k&ouml;nnen, da hier doch der Fokus fast v&ouml;llig darauf gerichtet wird,
          ob und wie lang Ben seinen Verfolgern entkommt. Es ist ein kleiner Roman
          voller Aktion, aber wer King sonst vielleicht als G&uuml;tesiegel f&uuml;r
          Lesequalit&auml;t sieht, wird bei diesem Buch ein wenig entt&auml;uscht
          sein. Nichts desto trotz ist es spannend und der Ausgang bleibt bis zum
          Ende ungewiss. Man sollte hierbei nur nicht auf die sonst fast immer
          auftretende Raffinesse von Stephen King hoffen, die bei den
          bachman-B&uuml;chern im allgemeinen &ouml;fter auf sich warten
          l&auml;sst.</P>

          <P>Ein Buch f&uuml;r zwischendurch, dass sich eventuell jedoch in zwei
          Wochen schon wieder aus dem Ged&auml;chtnis schleichen wird.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A>
          
          <H3>Buchtitel: Per Anhalter durch die Galaxis <BR>
          Autor: Adams, Douglas <BR>             
          Vorgestellt von: Eowyn <BR>
          Verlag: Ullstein GmbH <BR>             
          Erscheinungsjahr: 1985 <BR>
          ISBN: 3-548-31070-2 <BR>               
          Format: Digital </H3>

          <P><B>Inhalt:</B><BR>
          Arthur Dent ist ein ganz normaler Erdling aus einem kleinen und abgelegenen
          &Ouml;rtchen, irgendwo in England. Er bewohnt ein kleines und recht sch&auml;biges
          Haus, das wohl niemandem gef&auml;llt, au&szlig;er ihm selbst. Umso mehr, als durch
          diese kleine Ortschaft nun eine Umgehungsstra&szlig;e gebaut werden soll, in
          deren Weg sich nun Arthurs Haus befindet. </P>

          <P>So verbringt er seinen letzten Tag auf der Erde im matsch liegend, direkt
          vor den Bulldozern, die sein Haus f&uuml;r die neue Stra&szlig;e dem Erdboden gleich
          machen sollen. </P>

          <P>Unterbrochen wird dieser "Liegestreik" schlie&szlig;lich von seinem Freund Ford
          Prefect. Ein Eigenartiger Name, wird man jetzt sagen, aber das hat einen
          Guten Grund. Ford stammt nicht von der Erde. F&uuml;r eine Erkundungsreise f&uuml;r
          das Buch "per Anhalter durch die Galaxis", einem Reisef&uuml;hrer f&uuml;r
          interstellare Reisende, war er vor 15 Jahren auf die Erde gekommen. Bei
          seinen Recherchen &uuml;ber die Erdenbev&ouml;lkerung war er abgesehen von dem
          kleinen Schnitzer recht gr&uuml;ndlich gewesen, der ihn nun dazu gebracht hatte,
          zu meinen, Ford Prefect w&auml;re der perfekte und ausreichend unauff&auml;llige Name
          f&uuml;r ihn. </P>

          <P>Ford holt seinen Freund Arthur nun also vor dem Bulldozer weg und bringt
          ihn in eine Kneipe, wo er ihm, wie er behauptet, etwas wichtiges zu sagen
          hat, worauf man nat&uuml;rlich gleich anf&auml;ngt, Arthurs Haus abzurei&szlig;en. Doch
          Ford beruhigt Arthur. Das w&auml;re doch nicht so schlimm, in knapp 10 Minuten
          w&auml;re so oder so das Ende der Erde gekommen, da w&uuml;rde das abgerissene Heim
          Arthurs auch nichts ausmachen. Und so kommt 10 Minuten und drei Bier sp&auml;ter
          das Ende der Erde. </P>

          <P>Pl&ouml;tzlich taucht eine Flotte von gelben Raumschiffen &uuml;ber der Erde auf und
          eine Stimme verk&uuml;ndet:</P>

          <P>"Hier spricht Prostetnik Vogon Jeltz vom Galaktischen
          Hyperraum-Planungsrat.Wie Ihnen zweifellos bekannt sein wird, sehen die
          Pl&auml;ne zur Entwicklung der Au&szlig;enregionen der Galaxis den Bau einer
          Hyperraum- Expressroute durch Ihr Sternensystem vor, und bedauerlicherweise
          ist Ihr Planet einer von denen, die gesprengt werden m&uuml;ssen. Das Ganze wird
          nur etwas weniger als zwei Ihrer Erdenminuten in Anspruch nehmen. Danke." </P>

          <P>Doch Ford ist nicht umsonst ein Kundschafter f&uuml;r das Buch "Per Anhalter
          durch die Galaxis". &Uuml;bertragen gesprochen hebt er also den Daumen, und
          l&auml;sst sich von den Dienern der neuen Bauherren auf eines der Gelben
          Raumschiffe schleusen, in dem er nun mit Arthur zusammen, den er als seinen
          Freund mitgenommen hat, seine interstellare Reise antritt. </P>


          <P><B>Anmerkungen: </B><BR>
          tats&auml;chlich k&ouml;nnte aus dieser Geschichte nun etwas spannendes werden.
          Raumschiffe, schlachten im Weltall, Arthur als einziger Erdling umgeben von
          Au&szlig;erirdischen, neue und unbekannte Welten. Das Buch k&ouml;nnte wirklich
          spannend werden, wenn man es ernst nehmen k&ouml;nnte. Aber das ist, von Adams
          auch beabsichtigt, v&ouml;llig unm&ouml;glich. Man gelangt in ein Universum von
          Chaoten und T&ouml;lpeln, ein Universum, in dem jeder au&szlig;erirdische f&uuml;r sich ein
          &uuml;berzogenes Klischee darstellt, und es ereilt einen regelrecht die
          Vermutung, Adams hat anhand seiner vielf&auml;ltigen extraterrestrischen
          Lebensformen doch nur die "Menschlinge" auf den Arm genommen. </P>

          <P>Bis hin zu der Tatsache, dass Arthur in eine Gesellschaft ger&auml;t, in der
          Lyrik als Foltervariante genutzt wird. </P>

          <P>"Oh zerfrettelter Grunzwanzling..." begann er. Kr&auml;mpfe gingen zuckend durch
          Fords K&ouml;rper - das war schlimmer, als selbst er es sich vorgestellt hatte. </P>

          <P>"... dein Harngedr&auml;nge ist f&uuml;r mich / Wie Schnatterfleck auf Bienenstich." </P>

          <P>"Aaaaaaaarrrchchchchch!" machte Ford Prefect und warf seinen Kopf zur&uuml;ck,
          den Schmerzwellen durchpochten. Undeutlich konnte er Arthur neben sich
          wahrnehmen, der auf seinen Stuhl gefl&auml;zt dasa&szlig; und sich nachl&auml;ssig r&auml;kelte.
          Er biss die Z&auml;hne zusammen. </P>

          <P>"Grupp, ich beschw&ouml;re dich", fuhr erbarmungslos der Vogone fort, "mein
          punzig Turteldrom." Seine Stimme schraubte sich zu grauenhaft erregter
          Sch&auml;rfe hoch. </P>

          <P>"Und dr&auml;ngel reifig mich mit krinklen Bindelw&ouml;rdeln / Denn sonst werd ich
          dich r&auml;ndern in deine Gobberwarzen / Mit meinem B&ouml;rgelkranze, wart's nur
          ab!" </P>

          <P>"Nnnnnnnnnaaaaaiiiiiiiiinnnrrmrchchchch!" schrie Ford Prefect in einer
          allerletzten Zuckung, als die elektronische Verst&auml;rkung der letzten Zeile
          ihm mit Volldampf durch die Schl&auml;fen fetzte. Ihm wurde schwarz vor Augen." </P>

          <P>&Auml;hnlich absurd setzt sich das Buch fort, aber Adams versteht es, die Grenze
          nie zu &uuml;berschreiten, die den Leser vor Skurrilit&auml;t das buch zuschlagen
          lie&szlig;e. </P>

          <P>Es l&auml;sst sich leicht lesen, und umso leichter, als das Buch sowohl vor
          direktem und einfach nur Schr&auml;gem Humor, aber auch verstecktem Witz zu
          spr&uuml;hen scheint. </P>

          <P>Adams schafft eine Farbenfrohe Gesellschaft, au&szlig;erhalb der Normen und
          Begriffe, die den Menschen normal erscheinen, aber Tatsache ist, dass es in
          diesem Universum keinen wirklich b&ouml;sen Charakter gibt. Wenn man es genau
          betrachtet sind die, die man als gut bezeichnen m&ouml;chte wirklich gut, aber
          auch auf eine liebenswerte Weise tollpatschig, und auch die, welche man als
          b&ouml;se bezeichnen m&uuml;sste, haben etwas ungelenkes, das den Leser wieder zum
          Schmunzeln bringt. </P>

          <P>Kurz gesagt, man kann "Per Anhalter durch die Galaxis" nicht ernst nehmen.
          Ein geordnetes Durcheinander, das einem die Lachtr&auml;nen in die Augen treiben
          kann. </P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR> 

          <A name="a08"></A>
                    
          <H3>Buchtitel: Der Medicus von Saragossa <BR>
          Autor: Gordon, Noah <BR>
          Vorgestellt von: Bit <BR>
          Verlag: Blessing <BR>
          Erscheinungsjahr: 1999 <BR>
          ISBN: 3896670131 <BR>
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR> 
          Am 23. August 1489 wird in einem Olivenhain die Leiche eines offensichtlich
          missbrauchten Jungen gefunden. Der christliche Jude Bernado Espia, ein
          Arzt, soll diesen Fall untersuchen. Der kleine Junge kam ums Leben, als er
          f&uuml;r seinen Vater einen Botengang erledigte. Er sollte eine Reliquie in
          eine Abtei bringen. Dieser Umstand war auch gleichzeitig der Grund f&uuml;r
          den Mord. Ein buckliger M&ouml;nch, der f&uuml;r die Inquisition arbeitet,
          und sein Begleiter wurden am gleichen Abend zur gleichen Zeit in der
          gleichen Gegend gesehen. </P>

          <P>Es ist die Zeit der Judenvertreibung aus Spanien. </P>

          <P>Der Vater des ermordeten Jungen, ein Silberschmied namens Helkias,
          verz&ouml;gert seine erzwungene Abreise, um von seinen Schuldnern das
          f&uuml;r die Reise dringend ben&ouml;tigte Geld einzufordern. </P>

          <P>Sein Freund Bornito Martin, ein Goldschmied und Christ verteilt Skizzen
          der gestohlenen Reliquie. Darauf hin hetzt der bucklige M&ouml;nch eine
          Menschenmeute auf und &uuml;berf&auml;llt des n&auml;chtens den Juden
          Helkias, wobei dieser ums Leben kommt. </P>

          <P>Nun sind aus der Familie nur noch Jona und sein kleinerer Bruder
          &uuml;brig. Sie verlieren sich aus den Augen. Das Angebot, zum Christentum
          zu konvertieren und bei der Familie Martin zu leben, schl&auml;gt Jona aus.
          Um sich und die Familie Martin nicht in weitere Schwierigkeiten zu bringen,
          macht er sich auf und zieht viele Jahre durch Spanien. </P>

          <P>Jona f&auml;ngt eine neue Lehre als Waffenschmied an und lernt dabei
          Fertigkeiten, die mit Metallbearbeitung nichts zu tun haben. </P>

          <P>Auch an diesem Ort kann er nicht f&uuml;r immer bleiben. Wieder muss er
          fliehen. Schlie&szlig;lich kommt er nach Saragossa und schl&uuml;pft bei
          einem Medikus unter. Von diesem wird er in der Kunst der Heilung
          unterwiesen und wird letztendlich selber zum Medikus von Saragossa. </P>

          <P><B>Anmerkungen: </B><BR> 
          Hat man sich in diesen Roman eingelesen, wird man von der interessanten
          Darstellung dieser Zeit gefesselt. </P>

          <P>Die verschiedenen Charaktere sind sehr anschaulich dargestellt und die
          Handlungen spannend beschrieben. </P>

          <P>Hier wird ein Sprichwort bewiesen. Man trifft sich immer zwei mal im
          Leben. </P>

          <P>Wer sich f&uuml;r diese Epoche interessiert, sollte dieses Buch lesen.
          </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
                    
          <A name="a09"></A>
                    
          <H3>Buchtitel: Tod und Teufel <BR>
          Autor: Sch&auml;tzing, Frank <BR>
          Vorgestellt von: Bit <BR>
          Verlag: Emons Verlag <BR>          
          Erscheinungsjahr: 2003 <BR>
          ISBN: 3897052393 <BR>              
          Format: Audio </H3>

          <P><B>Inhalt: </B><BR>
          K&ouml;ln, September 1260. Der Erzbischof und das B&uuml;rgertum versuchen
          sich gegenseitig in die Knie zu zwingen. Dreh- und Angelpunkt ist der
          epochale Dombau zu K&ouml;ln. </P>

          <P>Neben dieser privilegierten Schicht gibt es auch die Schicht der Armen.
          Jacob der Fuchs, ein Herumtreiber dieser Zeit, schl&auml;gt sich mehr
          schlecht als recht durchs Leben. Um seinen Hunger f&uuml;r diesen Tag zu
          stillen, stielt er aus dem bisch&ouml;flichen Garten gern die
          wohlschmeckenden &Auml;pfel. Eines Tages beobachtet er dabei zuf&auml;llig,
          wie ein schwarzer und unheimlicher Schatten den Dombaumeister vom ansonst
          bereits leeren Ger&uuml;st st&uuml;rzt. Weit und breit kein anderer Mensch.
          Jacob der Fuchs als einziger Zeuge. Als einziger Zeuge, den der schwarze
          Schatten jedoch ebenfalls gesehen hat. </P>

          <P>Jacob eilt zu seiner Freundin, die in einem Bordell ihre Dienste
          verkauft. Ein Freund kommt dazu und zwischen Jacob und seiner Freundin
          kommt es zum Streit &uuml;ber diesen Freund. Der Fuchs verl&auml;sst
          w&uuml;tend das Etablissement. Er hat die beiden zum letzten mal lebend
          gesehen. </P>

          <P>Immer deutlicher stellt sich heraus, dass der Mord des Dombaumeisters
          lediglich der Auftakt einer grausamen Intrige war. </P>

          <P>Jacob wei&szlig;, dass er nur &uuml;berleben kann, wenn es ihm gelinkt
          Licht in die finsteren Machenschaften zu bringen und der Sturz des
          Dombaumeisters aufgekl&auml;rt wird. </P>

          <P><B>Anmerkungen: </B><BR>
          Bei diesem Roman handelt es sich um ein &auml;u&szlig;erst spannendes Werk.
          Es fesselt und bildet gleichzeitig. Das Buch ist Krimi, Aktion und
          historische Aufkl&auml;rung in einem.</P>

          <P>Diesen Roman muss ich einfach unbedingt empfehlen. Schon lange hat mich
          kein Buch mehr mit einer derartigen Spannung in seinen Bann geschlagen.
          </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>

          <A name="a10"></A>
                    
          <H3>Buchtitel: Carrie <BR>
          Autor: King, Stephen <BR>   
          Vorgestellt von: Eowyn <BR>
          Verlag: Bastei-Verlag Gustav H. L&uuml;bbe GmbH & Co., <BR>
          Erscheinungsjahr: 1987 <BR> 
          ISBN: 3-404-13121-5 <BR>    
          Format: Digital </H3>

          <P><B>Inhalt: </B><BR>
          Carrie wird als einzige Tochter einer religi&ouml;sen Fanatikerin geboren,
          und dies soll auch ihren Charakter am extremsten zeichnen. Sie lebt in sich
          zur&uuml;ckgezogen, da ihre Mutter ihr den Umgang mit den meisten ihrer
          Schulkameraden verbietet. F&uuml;r Carries Mutter sind sie alle
          S&uuml;nder. Der Rest ergibt sich von allein. Carrie kleidet sich
          &uuml;berm&auml;&szlig;ig z&uuml;chtig, und an ihr gehen auch die kleinen
          Freuden der Pubert&auml;t fast v&ouml;llig vorbei. Sie macht sich ihr Haar
          nie zurecht, Schminke und &auml;hnliches sind undenkbar. </P>

          <P>Ihre Mutter vers&auml;umt es v&ouml;llig, Carrie aufzukl&auml;ren,
          trichtert ihrer Tochter nur ein, dass alle fraulichen Anzeichen, die sie im
          Laufe der Jahre entwickeln w&uuml;rde, Zeichen der S&uuml;nde seien, die
          Eva einst begangen h&auml;tte, und die Carrie in Gedanken beginge und
          begehen w&uuml;rde. Tats&auml;chlich schm&uuml;ckt das Wohnzimmer der
          Beiden ein Altar und ein riesiges blutiges Abbild Jesu Christi's am Kreuz.
          Auch der Fanatismus der Mutter f&uuml;hrt zur v&ouml;lligen Isolierung
          Carries, und dies alles ist oft Ansatzpunkt und Ausl&ouml;ser f&uuml;r
          teils unglaublich verletzenden Spott seitens ihrer Schulkameraden. Als
          Carrie eines Tages mit bereits 16 ihre erste Periode bekommt und denkt, sie
          w&uuml;rde verbluten, weil auch dies ihr nie von ihrer Mutter erkl&auml;rt
          worden ist, nimmt der Hohn der anderen M&auml;dchen ob Carries Panik
          &uuml;berhand. </P>

          <P>Doch niemand wei&szlig;, dass Carrie eine besondere Begabung hat. Die
          Begabung der Telekinese. Sie kann sie bis dahin noch nicht bewusst steuern,
          sie tritt nur auf, wenn Carrie besonders aufgew&uuml;hlt ist. Ein
          M&auml;dchen in Carries Klasse beginnt jedoch, ein schlechtes Gewissen zu
          entwickeln und sch&auml;mt sich f&uuml;r sich selbst f&uuml;r ihr Verhalten
          Carrie gegen&uuml;ber. Sie bittet ihren Freund, der allseits beliebt ist,
          mit Carrie auf einen Ball zu gehen. </P>

          <P>Doch Carrie hat eine ganz besondere Feindin, ein verw&ouml;hntes
          M&auml;dchen, Tochter eines Anwalts, die davon erf&auml;hrt, und Carrie
          diesen ersten, und vielleicht einzigen sch&ouml;nen Abend in ihrem Leben
          gr&uuml;ndlich verderben will. Was sie jedoch nicht wei&szlig; ist, dass
          sie damit eine Katastrophe ausl&ouml;st, wie sie die kleine Stadt noch nie
          erlebt hat. </P>

          <P><B>Anmerkungen: </B><BR>
          Dieses Buch ist das erste von King, welches von einem Verlag angenommen
          worden ist. </P>

          <P>Meiner Meinung nach ist es l&auml;ngst nicht das beste. Die Geschichte
          ist gut, man kann sagen, es steckt eine sch&ouml;ne Grundidee dahinter,
          jedoch der Schreibstil allein nimmt ihr einiges an Schlagkraft. Durchsetzt
          ist die Geschichte Carries mit Zeugenaussagen, ausschnitten aus
          wissenschaftlichen Artikeln und Zeitungsberichten. Jedes Mal, wenn man in
          die Story hineingefunden hat, wird sie von so einem Zwischenspiel
          unterbrochen. Carrie ist kein sehr dickes Buch, und auf die K&uuml;rze der
          Geschichte wirken sich die Unterbrechungen noch st&auml;rker aus. </P>

          <P>King-Fans finden sicher etwas daran, und m&uuml;ssen dieses Buch schon
          aus Prinzip lesen, da es Kings erster Schritt zu Weltruhm war und ihn sehr
          schnell unheimlich bekannt machte, aber wenn ich ehrlich bin, verpasst man
          nicht viel, wenn man dieses Buch nicht liest. </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>

          <A name="a11"></A>
                    
          <H3>Buchtitel: Das Silmarillion <BR>
          Autor: Tolkien, John Ronald Reuel <BR>
          Vorgestellt von: Eowyn <BR>     
          Verlag: Klett-Cotta <BR>
          Erscheinungsjahr: 1999 <BR>     
          ISBN: 360893524X <BR>           
          Format: Digital </H3>

          <P><B>Inhalt: </B><BR>
          Wie entstand das, was wir im Sp&auml;teren als Mittelerde kennenlernten?
          Wer war und ist Sauron, der dunkle Herrscher, dessen Ring Frodo im Herren
          der Ringe zerst&ouml;ren muss? </P>

          <P>Dies und vieles mehr liest man im Silmarillion. </P>

          <P>Ilvatar schuf die Ainur, die bereits vor der Sch&ouml;pfung der Welt
          bei ihm waren, und die Gefilde, in denen sie weilten mit ihrem Gesang,
          Melodien der reinsten Freude erf&uuml;llten. Bald darauf lebten unter ihnen
          die Valar, und ihnen schuf Ilvatar die Welt, damit sie auf ihr Leben und
          sie nach ihren W&uuml;nschen und Tr&auml;umen gestalten konnten. Neun waren
          es, die schlie&szlig;lich dorthin gingen, und begannen, berge, Meere,
          W&auml;lder und Leben zu erschaffen. Doch einer unter ihnen war voller Neid
          und Missgunst. Dies war Melkor, dessen Herz nur dunkel war, der selbst
          nicht schaffen, sondern nur zerst&ouml;ren oder nachahmen konnte. Er
          neidete den anderen ihre F&auml;higkeiten, und begann, die Welt mit Krieg
          zu &uuml;berziehen. So brannte die Erde und alles Wirken der Valar war
          zerst&ouml;rt. Sie begannen von neuem, bauten wieder auf, was Melkor
          zerst&ouml;rt hatte, doch noch immer trachtete dieser danach, das
          Sch&ouml;ne und Reiche zu vernichten. Und so nahm man ihn gefangen, und er
          Sa&szlig; Jahre und Jahrhunderte in einem dunklen Kerker unter den Bergen,
          angekettet durch die M&auml;chte Ilvatars. </P>

          <P>Als man ihn wieder frei lie&szlig;, schwor er heimlich Rache. Er drang
          nach Valinor ein, der Insel, auf der die Valar lebten, und zerst&ouml;rte
          das heiligste und sch&ouml;nste, das dort je erschaffen wurde. Telperion
          und Laurelin, die Leuchtenden B&auml;ume, in denen alle macht der
          Sch&ouml;pfung und des Wachstums ruhten. </P>

          <P>Und so entbrannte endg&uuml;ltig der Krieg zwischen Melkor und seinen
          Streitkr&auml;ften, und den Valar, denen, die bereit waren, sich gegen
          Melkor zu stellen. Und unter ihnen der Unsterbliche Feanor, welcher seine
          eigene Rache gegen Melkor schwor. Denn dieser hatte Feanors
          gr&ouml;&szlig;tes und sch&ouml;nstes Werk gestohlen und f&uuml;r sich
          beanspruchend in eine Krone von Eisen gefasst, die er nun als Symbol seiner
          Herrschaft st&auml;ndig auf dem Kopf trug. </P>

          <P>Die Silmaril, drei Edelsteine, in denen Feanors ganze Macht und Liebe zu
          seiner Sch&ouml;pfung ruhten. Drei leuchtende Steine, die sein
          gr&ouml;&szlig;tes Kunstwerk waren, und sein Leben seit ihrer Erschaffung
          mehr als alles andere beherrschten. Selbst die Valar hatten Feanor um nur
          einen dieser Steine angefleht, um das Licht der beiden B&auml;ume erneut
          erschaffen zu k&ouml;nnen, doch in seiner besessenheit und Angst um diese
          Steine verweigerte er ihnen diese Gabe und brachte so selbst Streit nach
          Valinor. </P>

          <P>Von ihm, seinem Zug gegen Melkor und vielen anderen berichtet der erste
          Teil des Silmarillions. Sie kennzeichnen das erste ZeitalterMittelerdes, in
          dem die Zwerge unter den Bergen erwachten, die Elben begannen, unter den
          Sternen zu wandern, und in dem auch die sterblichen das erste mal gesehen
          wurden, auch wenn dies noch l&auml;ngst nicht ihre Zeit war. </P>

          <P>Gro&szlig;e Kriege wurden gef&uuml;hrt, und bereits hier begann es, dass
          die Elben gen Westen nach Valinor segelten, wo unter anderen Unsterblichen
          ihre Heimat sein sollte. </P>

          <P>Das zweite Zeitalter war das der Nmenorer, und es war auch das
          Zeitalter Saurons. </P>

          <P>Er war ein Maiar, die nach den Valar die m&auml;chtigsten auf Mittelerde
          waren, und schon zu dieser Zeit war sein Machthunger gro&szlig;. Er erwarb
          sich ansehen unter den Nmenorern, und es sollte lang dauern, bis sie
          erkannten, welch b&ouml;ses Wesen dort unter ihnen wandelte. Doch die Zeit
          sollte Sauron gen&uuml;gen. Er schmiedete seinen Ring, die Kunst, die er
          von den gro&szlig;en Elbenschmieden selbst erlernte, bevor sie merkten, was
          er vor hatte. Er brachte fast alle Ringe, die m&auml;chtig und von den
          Elben geschmiedet waren unter seinen Willen, nur nicht die drei, die
          f&uuml;r die Elben selbst waren. Denn sie konnte man retten und er hatte
          sie nie ber&uuml;hrt. </P>

          <P>So schlossen Elben und Menschen ein starkes B&uuml;ndnis gegen Sauron
          und vernichteten ihn, fast. Isildur, ein Sterblicher nahm den Ring an sich,
          und von hier begann er seine Reise, die im Herren der Ringe geschildert
          wird. </P>

          <P><B>Anmerkungen: </B><BR>
          Tolkien hat dieses Buch als sein Lebenswerk betrachtet, und
          tats&auml;chlich war es das erste, was er begonnen hat. Die ersten
          Aufzeichnungen f&uuml;r dieses Buch stammten von 1917. Und doch hat er nie
          geschafft, es zu ver&ouml;ffentlichen. Erst nach seinem Tod ist es seinem
          Sohn Christopher gelungen, das Buch zu publizieren, bestehend aus dem
          ersten Teil, der das eigentliche Silmarillion bildet, und den
          darauffolgenden Seiten, die Christopher Tolkien aus Aufzeichnungen seines
          Vaters zusammengetragen hat. </P>

          <P>Tolkien erschuf allein f&uuml;r dieses Werk mehrere Sprachen, die
          tats&auml;chlich so komplex ausgearbeitet worden sind, dass daf&uuml;r
          W&ouml;rterb&uuml;cher und grammatikalische Regeln existieren. Er baute
          eine eigene Mythologie und Entstehungsgeschichte f&uuml;r Mittelerde auf,
          zeichnete Landkarten, an die er sich bis ins kleinste Detail selbst im
          kleinen Hobbit und dem Herren der Ringe hielt. Hier werden viele kleine und
          gro&szlig;e Fragen beantwortet, die sich dem aufmerksamen Leser im Herren
          der Ringe stellen. Leider hat dieses Werk nie die Popularit&auml;t
          erreicht, die ihm vielleicht geb&uuml;hrt h&auml;tte, aber meiner Meinung
          nach lohnt es sich, dieses Buch zu lesen. </P>

          <P>Es ist nicht einfach, zugegeben, da die Sprache doch recht hochgestochen
          wirkt, und Tolkien manchmal mit seitenlangen geographischen
          Erl&auml;uterungen und geschichtlichen Abrissen verwirrt, aber es ist in
          allem ein Muster und l&auml;sst oft die Liebe zum Detail erkennen. </P>

          <P>Sicher kein Buch, dass man auf einen Schlag durchweg lesen kann, aber
          auf jeden Fall lohnende Lekt&uuml;re und f&uuml;r alle, welche sich vom
          herren der Ringe haben fesseln lassen ein Muss! </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>

          <A name="a12"></A>
          <H3>
          Buchtitel: Harry Potter und der Stein der Weisen <BR>
          Autor: Rowling, Joanne K. <BR>
          Vorgestellt von: Eowyn <BR>                                
          Verlag: Carlsen Verlag GmbH <BR>
          Erscheinungsjahr: 1998 <BR>
          ISBN: 3-551-55167-7 <BR>
          Format: Schwarzschrift </H3>

          <P><B>Inhalt: </B><BR>
          Harry ist augenscheinlich ein ganz normaler Junge kurz vor seinem elften
          Geburtstag. Er lebt bei seinem Onkel Vernon und seiner Tante Petunia, denn
          seine Eltern waren gestorben, als Harry gerade erst ein Jahr alt war. Bei
          einem Autounfall, hat man Harry erz&auml;hlt. So lebt er also nun bei
          Onkel, Tante und seinem Cousin Dudley, und w&auml;hrend Onkel und Tante
          sich M&uuml;he geben Harry nach allen Regeln der Kunst entweder zu
          ignorieren, oder einfach nur schlecht zu behandeln, macht Dudley sich immer
          wieder einen Spa&szlig; daraus, seinen Cousin zu schikanieren, zusammen mit
          seinen Freunden oder allein. Harry ist ein stilles und zur&uuml;ckgezogenes
          Kind, denn auch in seiner Schule hat er keine Freunde, denn Dudley mit
          seiner Gang m&ouml;chte niemand im Wege stehen. Eines Tages wird jedoch bei
          ihnen im Haus ein Brief durch den Postschlitz eingeworfen, in einem
          ungew&ouml;hnlichen gelben Pergamentumschlag, adressiert mit gr&uuml;ner
          Tinte, und direkt an Harry Potter. </P>

          <P>Onkel Vernon bekommt den Brief als erster in die Finger, liest ihn, und
          scheint in Panik zu verfallen, denn neben der Tatsache, dass er Harry den
          Brief nicht zeigen will und ihn fast sofort verbrennt, setzt er alles
          daran, gar keine Post mehr ins Haus zu lassen, nachdem am n&auml;chsten Tag
          drei Briefe der gleichen Art auftauchen. Doch der Strom der Briefe reist
          nicht ab, und als sich schlie&szlig;lich gut 40 oder 50 Briefe durch den
          Schornstein in die K&uuml;che ergie&szlig;en, verl&auml;sst Vernon mit
          seiner gesamten Familie fluchtartig das Haus. </P>

          <P>Sie Finden Unterschlupf in einer zugigen und unscheinbaren H&uuml;tte
          auf einer kleinen Insel, wohin, wie Vernon hofft, diese verhexten Briefe
          nicht kommen w&uuml;rden. </P>

          <P>Um Mitternacht des gleichen Tages, gerade, als Harrys Geburtstag
          anbricht, taucht ein Fremder, ein riesenhafter Mann in der H&uuml;tte auf.
          Sein Name ist Hagrid, und er bezeichnet sich als H&uuml;ter der
          Schl&uuml;ssel und L&auml;ndereien von Hogwarts, einer Schule f&uuml;r
          Hexerei und Zauberei. Harry, so sagt er, ist ein Zauberer, so wie seine
          Eltern schon Zauberer Waren. Und er erz&auml;hlt Harry auch, wie er zu
          seinem Onkel und seiner Tante kam. </P>

          <P>Einst hatte ein m&auml;chtiger Zauberer, der gef&auml;hrliche und den
          dunklen Zauberk&uuml;nsten verfallene Lord Voldemort Lily und James Potter,
          Harrys Eltern get&ouml;tet, und auch versucht, Harry selbst umzubringen.
          Doch der Fluch verfehlte seine Wirkung, prallte auf den schwarzen Zauberer
          selbst zur&uuml;ck und brach seine macht, nachdem er 11 Jahre eine
          Schreckensherrschaft gef&uuml;hrt hatte. </P>

          <P>Allein dadurch wurde Harry ber&uuml;hmt, und ist es in der Zaubererwelt
          noch immer. So verl&auml;sst er seinen Onkel und seine Tante am 01.09. und
          f&auml;hrt mit einem Zug von Gleis 9 3/4 nach Hogwarts. </P>

          <P>Alles scheint f&uuml;r ihn wie ein Traum, bereits, als er in der Menge
          der Sch&uuml;ler sitzt und der Rede des Schulleiters lauscht. Neben den
          &uuml;blichen Verboten, in den Wald hinter dem Schlossgel&auml;nde zu
          gehen, verbietet Dumbledore den Sch&uuml;lern auch das Betreten des dritten
          Stockwerks. </P>

          <P>Und bald schon wird Harry gewahr, dass geheime Dinge in Hogwarts
          vorgehen. Was ist von dem zwielichtigen Lehrer f&uuml;r Zaubertr&auml;nke,
          Severus Snape zu halten? Und warum h&auml;lt die Schule im dritten Stock
          des Hauses ein riesiges Unget&uuml;m von Hund mit drei K&ouml;pfen? </P>

          <P><B>Anmerkungen: </B><BR>
          Dieses Buch ist der Auftakt zu einer faszinierenden Geschichte &uuml;ber
          Harry Potter und seine Freunde. Alles in diesem Buch hat einen gewissen
          Zauber, und auch wenn Harry Potter und der Stein der Weisen anfangs als
          reines Kinder- und Jugendbuch gehandelt wurde, findet man auch als
          Erwachsener seinen Spa&szlig; darin. Oft regt es zum Schmunzeln oder gar
          lachen an, denn man hat nicht selten das Gef&uuml;hl, Rowling n&auml;hme
          ihre britischen Landsleute geh&ouml;rig aufs Korn. </P>

          <P>In der zauberhaften Welt von Hogwarts kann man sich sowohl als Kind, als
          auch als Erwachsener gut verlieren, und bereits das erste Buch macht Lust
          auf mehr. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a13"></A>
          <H3>Buchtitel: Roter Drache <BR>
          Autor: Harris, Thomas <BR>      
          Vorgestellt von: Bit <BR>
          Verlag: Ullstein H&ouml;rverlag <BR>
          Erscheinungsjahr: 2001 <BR>
          ISBN: 3550101244 <BR>           
          Format: Audio </H3>

          <P><B>Inhalt: </B><BR>
          In Florida wurden bereits 10 Menschen zu Opfern eines Serienkillers. Die
          ehrgeizige Clarice, die sich in der Ausbildung zu einer FBI-Agentin
          befindet, wird zu diesem Fall hinzugezogen. Sie soll den in einem
          Hochsicherheitstrakt einer psychiatrischen Klinik sitzenden Dr. Hannibal
          Lecter zur Unterst&uuml;tzung des FBIs &uuml;berreden. Der 
          Psychiater hat Einblick in die Psyche eines Serienkillers. Er war selber
          einer und kennt deren Gedankenkonstrukte auch durch seine fr&uuml;here
          Arbeit. </P>

          <P>Die junge Beamtin wird von ihrem Chef gewarnt, bei diesem Gespr&auml;ch
          nichts privates zu offenbaren, da Lecter derartige Informationen f&uuml;r
          seine teuflischen Spiele auszunutzen versteht. Die junge Beamtin gibt
          trotzdem etwas aus ihrem Leben preis. Ohne dies lehnt Hannibal jede
          Zusammenarbeit ab. </P>

          <P>Der gesuchte T&auml;ter identifiziertist sich mit dem mystischen roten
          Drachen von William Blakes. Seine Opfer sind Familien, die wie nett
          arrangiert als Tote aufgefunden werden. </P>
          
          <P>Anmerkungen: <BR>
          Es handelt sich bei diesem Roman um den ersten Teil einer Trilogie. Nach
          dem ich einiges &uuml;ber den Film geh&ouml;rt hatte, wollte ich erst nicht
          so recht an dieses Buch heran. Aber ich war sehr positiv &uuml;berrascht,
          weil der Autor in den Beschreibungen von grausamen Szenen mit behutsamer
          Feder die n&ouml;tige Spannung aufzubauen versteht. </P>

          <P>Wer spannende Krimis mag, sollte dieses Buch lesen. </P>
          
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a14"></A>
          <H3>Buchtitel: Harry Potter und die Kammer des Schreckens <BR>
          Autor: Rowling, Joanne K. <BR>    
          Vorgestellt von: Eowyn <BR>
          Verlag: Carlsen Verlag GmbH <BR>  
          Erscheinungsjahr: 1999 <BR>
          ISBN: 3-551-55168-5 <BR>          
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Harry ist &uuml;ber die Sommerferien wieder in den Ligusterweg
          zur&uuml;ckgekehrt, und leidet fast so schlimm wie eh und je unter seinem
          Onkel Vernon, Tante Petunia und seinem Cousin Dudley. Dudley &uuml;berlegt
          es sich inzwischen nur zwei Mal, ob er Harry &auml;rgert oder nicht, denn
          wie Harry hat er vor einem Jahr erfahren, dass sein Cousin ein Zauberer
          ist, und h&uuml;tet sich nun vor ihm, aus Angst, Harry k&ouml;nnte ihn
          verzaubern. Doch sonst hat sich kaum etwas ge&auml;ndert. Die drei
          ignorieren ihn nach Kr&auml;ften, vergessen seinen Geburtstag, wie jedes
          Jahr, und alles gipfelt in einem Gesch&auml;ftsessen, das Vernon bei sich
          zu Hause mit einem potentiellen Kunden seiner Firma, die Bohrer herstellt,
          veranstaltet. </P>

          <P>Harry ist aufgetragen worden, den ganzen Abend in seinem Zimmer zu
          bleiben, doch als er nach dem Abendessen dorthin geht, sitzt schon jemand
          auf seinem Bett. Er stellt sich als Dobby vor. Ein Hauself, der gekommen
          ist, um Harry zu warnen und ihm zu raten, in diesem Schuljahr nicht nach
          Hogwarts zur&uuml;ckzukehren. B&ouml;se dinge seien im Gange sagt er, und
          Harry Potter sei in gro&szlig;er Gefahr. </P>

          <P>Als Harry sich jedoch weigert, auf den Hauselfen zu h&ouml;ren,
          veranstaltet dieser in der K&uuml;che von Onkel und Tante ein Chaos,
          welches nat&uuml;rlich Harry zur Last gelegt wird, und nicht nur von seinen
          Verwandten. </P>

          <P>Das Gesch&auml;ftsessen ist verdorben, und nur wenige Minuten
          sp&auml;ter landet eine Eule in der K&uuml;che und liefert einen Brief
          f&uuml;r Harry vom Zaubereiministerium ab in dem steht, man h&auml;tte
          erfahren, dass Magie im Haus ausge&uuml;bt worden sei und Harry h&auml;tte
          damit gegen den Erlass zur Vernunftgem&auml;&szlig;en Beschr&auml;nkung der
          Zauberei Minderj&auml;hriger versto&szlig;en, der Zauberern und hexen unter
          17 untersagt, au&szlig;erhalb der Schule zu zaubern. Nochmaliger
          Versto&szlig; w&uuml;rde daf&uuml;r sorgen, dass er von Hogwarts verwiesen
          w&uuml;rde. Vernon, der nun endlich begreift, dass sein Neffe nicht zaubern
          darf und ihm somit nicht gef&auml;hrlich werden kann, sperrt Harry nun in
          sein Zimmer, wo er wie ein Gefangener gehalten wird. </P>

          <P>Aus dieser Misere befreit ihn sein Freund Ron, mit seinen beiden
          Br&uuml;dern, den Zwillingen Fred und George. </P>

          <P>Als schlie&szlig;lich das Schuljahr in Hogwarts beginnt, ist alles wie
          im Jahr zuvor und Harry hat die Warnung Dobbys schon wieder v&ouml;llig
          vergessen, bis zu dem Vorfall an Halloween. </P>

          <P>Mrs Norris, die Katze des Hausmeisters, wird im Flur der Schule
          aufgefunden, v&ouml;llig starr und leblos, versteinert, wie man sp&auml;ter
          herausfindet. Dort, wo man sie so zur&uuml;ckgelassen hat, steht eine
          Botschaft an der Wand: <UL>

          <LI> "DIE KAMMER DES SCHRECKENS WURDE GE&Ouml;FFNET. </LI>

          <LI> FEINDE DES ERBEN, NEHMT EUCH IN ACHT." </LI></UL></P>

          <P>Nun fallen Harry Dobbys Worte wieder ein, doch das ist nicht das
          einzige. &Uuml;ber die Kammer des Schreckens existiert eine Legende, die
          bis zur Gr&uuml;ndungszeit der Schule zur&uuml;ckgeht und mit Salazar
          Slytherin zu tun hat, dem Gr&uuml;nder des Hauses Slytherin, dem die
          meisten dunklen Magier und Hexen entstammen. </P>

          <P>Die Kammer des Schreckens ist nicht zum ersten Mal ge&ouml;ffnet worden,
          wie die drei Freunde bald herausfinden sollen. </P>

          <P>Der Angriff auf die Katze wird nur der erste sein, und der einzige, bei
          dem es nur ein Tier trifft. </P>

          <P>Immer wieder werden auf die gleiche Art versteinerte Sch&uuml;ler in den
          G&auml;ngen gefunden, und niemand hat eine Ahnung, wer der Angreifer sein
          k&ouml;nnte. </P>

          <P>Was ist die Kammer des Schreckens? <UL>

          <LI> Wer ist der Erbe, der f&uuml;r all dies verantwortlich sein soll?
          </LI>

          <LI> Wer hat die Kammer vor 50 Jahren schon einmal ge&ouml;ffnet? </LI>

          <LI> Was hat der hauself Dobby mit all dem zu tun? </LI>

          <LI> Und warum soll gerade Harry in so gro&szlig;er Gefahr schweben?
          </LI></UL></P>

          <P><B>Anmerkungen: </B><BR>
          Dies ist nun der zweite Band, der von Harry Potter und seinen Freunden
          erz&auml;hlt, und auf seine Weise ist er noch spannender als der erste. Wo
          es sich im ersten Band nur um ein Geheimnis handelte, das in der Schule
          verborgen war, und welches die drei Freunde, Harry, Ron und Hermine
          ergr&uuml;nden wollten, sind hier augenscheinlich nun auch die Sch&uuml;ler
          in Gefahr. Auch Draco Malfoy, Harrys &auml;rgster Feind aus dem hause
          Slytherin gewinnt immer mehr an Bedeutung. Wo er im ersten Band nur als
          intrigierende und verw&ouml;hnte Nervens&auml;ge auftauchte, wird er hier
          langsam aber sicher fester Bestandteil des Geschehens, und Verdacht
          f&auml;llt auch auf ihn. Auch wenn alle drei immer wieder einen Verdacht
          haben, wer der Erbe Slytherins sein k&ouml;nnte, die Kammer des Schreckens
          ge&ouml;ffnet haben sollte, wer f&uuml;r all dies verantwortlich sei,
          bleibt dies doch bis zum gro&szlig;en Showdown ungekl&auml;rt und
          s&auml;mtliche Verdachtsmomente erweisen sich als unbest&auml;tigt. </P>

          <P>Wer auch den zweiten Band lesen m&ouml;chte, wird am Ende ein
          unerwartetes Wiedersehen erleben. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a15"></A>
          <H3>Buchtitel: Der Fluch des Kopernikus <BR>
          Autor: Vandenberg, Philipp <BR>     
          Vorgestellt von: Sonnenblume <BR>
          Verlag: L&uuml;bbe <BR>
          Erscheinungsjahr: 1996 <BR>
          ISBN: 3785708599 <BR>               
          Format: Schwarzschrift </H3>

          <P><B>Inhalt: </B><BR>
          Das Buch spielt im sp&auml;ten 16. Jahrhundert. Der Totengr&auml;ber von
          St. Laurent zu Bamberg stirbt. Seine Frau ist schon viele Jahre tot. Die
          Kinder kommen zu einem Wirtsehepaar. Der Sohn beginnt eine Lehre als
          Steinmetz und baut mit am Bamberger Dom. Als er 17 ist, verliebt er sich in
          seine Pflegemutter und beginnt ein Verh&auml;ltnis mit ihr. Nach der Pest
          fliehen Pflegemutter und Sohn vor dem Zorn des Mannes nach Rom. </P>

          <P>Der junge Steinmetz ist sehr flei&szlig;ig und wissbegierig, und lernt
          in den Kl&ouml;stern n&auml;chtelang in sog. verbotenen B&uuml;chern. Er
          erf&auml;hrt, dass ein Buch von Kopernikus existiert, in welchem das Datum
          des Weltuntergangs vermerkt ist. Um ein Fiasko zu verhindern will er das
          Buch finden und vernichten. </P>

          <P><B><Anmerkungen: </B><BR>
          Es ist die wirklich spannende Geschichte der damaligen Zeit, die
          Hexenverbrennung wird genauso beschrieben wie das ausschweifende Leben des
          Bischoftums. </P>

          <P>Zumindest den ersten Teil des Buches, der in Bamberg spielt, kann ich,
          was von hier beschrieben ist, nur best&auml;tigen. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>

          <A name="a16"></A>
          <H3>Buchtitel: Die Ecstasy-Aff&auml;re <BR>
          Autor: Konsalik, Heinz G&uuml;nter <BR>
          Vorgestellt von: Bit <BR>
          Verlag: L&uuml;bbe <BR>
          Erscheinungsjahr: 2002 <BR>
          ISBN: 3785710267 <BR>                
          Format: Audio </H3>

          <P><B>Inhalt: </B><BR>
          Der 18 j&auml;hrige Abiturient Robert Habicht lernt in einem
          &ouml;ffentlichen Schwimmbad die 33 j&auml;hrige Ulrike Sperling kennen und
          verknallt sich &uuml;ber beide Ohren in sie. Er ist der Sohn eines
          h&ouml;hergestellten Beamten aus Bayern. Sie, eine ehemalige
          Edelprostituierte, arbeitet jetzt als Bahrdame. </P>

          <P>Ihr Chef will, anfangs in M&uuml;nchen, sp&auml;ter in ganz Bayern und
          eventuell ganz Deutschland, einen Verteilerring f&uuml;r Ecstasy aufbauen.
          Er will schneller und besser als die Konkurrenz aus Italien, Vietnam und
          Russland sein. Ulrike hat er sich als rechte Hand f&uuml;r diese
          Gesch&auml;fte ausgesucht. Sie macht Robert anfangs durch Sex und recht
          bald auch durch Ecstasy vollkommen h&ouml;rig und benutzt ihn um die Droge
          an Dealer zu verteilen. Aber dann lernt Robert die 16 j&auml;hrige
          Christiane kennen. Was dann auf einem gemeinsamen Zeltausflug passiert,
          ver&auml;ndert alles. </P>

          <P><B>Anmerkungen: </B><BR>
          Dieser Roman strotzt vor Ungereimtheiten. Ulrikes Chef, Herr von Freim,
          will ein Imperium aufbauen und wei&szlig; um die drohende Konkurrenz. Als
          jedoch ein Vertreter dieser Konkurrenz auftaucht und ihm sagt, dass die
          drei polnischen Herren, die er erwartet einen Unfall hatten und wohl nicht
          mehr kommen w&uuml;rden, fragt er besorgt, ob sie denn verletzt sein. Und
          diese Frage ist nicht ironisch gemeint. Es dauert eine Weile bis er
          versteht. Es gibt in diesem Buch derma&szlig;en viele Plattheiten, dass
          schon dadurch dieses Machwerk aufgebl&auml;ht sein m&uuml;sste. </P>

          <P>Wenn es mal auf der Welt keine B&uuml;cher mehr gibt und alles trostlos
          erscheint, kann man diesen Roman eventuell lesen. Dabei darf man aber nicht
          vergessen, sich einen gro&szlig;en Vorrat an Getr&auml;nken
          bereitzustellen. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a17"></A>
          <H3>Buchtitel: Desiree <BR>
          Autor: Selinko, Annemarie <BR>   
          Vorgestellt von: Sonnenblume <BR>
          Verlag: Kiepenheuer & Witsch <BR>
          Erscheinungsjahr: 2002 <BR>
          ISBN: 3462031023 <BR>            
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Die Seidenh&auml;ndlertochter Desiree Clary aus Masaille ist mit 15 Jahren
          die Verlobte Napoleons. </P>

          <P>Als Napoleon aber nach Paris geht, um seine Laufbahn zu beginnen, und
          Desiree von der Hochzeit mit Josephine h&ouml;rt, t&uuml;rmt sie von zu
          Hause und reist Dem Geliebten nach. Sie findet ihn in den Armen von
          Josephine. Desiree ist dar&uuml;ber so erbost, dass sie Josephine ein Glas
          Sekt ins Gesicht schleudert. Napoleon arrangiert f&uuml;r Desiree die
          Hochzeit mit Bernadotte, der sp&auml;ter K&ouml;nig von Schweden wird.
          Desiree wird als Desidoria 1915 die Stammmutter des schwedischen
          K&ouml;nigshauses. </P>

          <P>Trotz aller Umst&auml;nde und Wirrungen des damaligen Lebens bleibt
          Desiree doch immer die Freundin Napoleons, die ihn Ber&auml;t, ihn versteht
          und alles f&uuml;r ihn tut. </P>

          <P><B>Anmerkungen: </B><BR>
          Das Buch ist von Desiree selbst erz&auml;hlt, es ist spannend und heiter
          zugleich. Die napoleonische Zeit wird dem Leser geschildert, und die
          Volksstimmung, die mal f&uuml;r, mal gegen Napoleon war. </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a18"></A>
          <H3>Buchtitel: Tanamera. Der Roman Singapurs. <BR>
          Autor: Barber, Noel <BR>                    
          Vorgestellt von: Sonnenblume <BR>
          Verlag: Hestia, Bayreuth <BR>               
          Erscheinungsjahr: 1984 <BR>
          ISBN: 3777002690 <BR>                       
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Der Sohn eines Englischen Diplomaten in Malaysia verliebt sich am Tag
          seiner Verlobung mit einer Engl&auml;nderin in eine Malaysierin. Das ist
          weder standesgem&auml;&szlig;, noch erlaubt. Die Geschichte schildert
          hinter dem historischen Hintergrund von B&uuml;rgerkrieg und
          Zerst&ouml;rung des Landes die wundersch&ouml;ne Landschaft, und die
          St&auml;rke der Menschen. </P>

          <P><B>Anmerkungen: </B><BR>
          Eine auf jeden Fall sehr spannende und gleichzeitig romantische
          Lekt&uuml;re. </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a19"></A>
          <H3>Buchtitel: Seide <BR>
          Autor: Baricco, Alessandro <BR> 
          Vorgestellt von: Bit <BR>
          Verlag: Piper <BR>              
          Erscheinungsjahr: 2003 <BR>
          ISBN: 3492045561 <BR>           
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Ein H&auml;ndler Namens Herv Joncour f&uuml;hrt mit seiner Frau ein sehr
          angenehmes Leben. </P>

          <P>Seine s&uuml;dfranz&ouml;sische Heimatstadt Lavilledieu lebt von der
          Produktion von Seide. Um gute Seidenraupen zu bekommen, f&auml;hrt Herv
          Joncour jedes Jahr f&uuml;r ein paar Wochen nach Japan, Die Reise ist
          lang, aber eintr&auml;glich. </P>

          <P>Dort verliebt sich der H&auml;ndler unsterblich in eine verheiratete
          Frau. Sie verliebt sich auch in ihn. Aber beide wechseln nie auch nur ein
          Wort miteinander. Trotzdem ist diese Liebe ein sehr gro&szlig;er
          Bestandteil seines Lebens und das seiner Frau. </P>

          <P>Der Schluss dieses Werkes ist eigentlich unvorhersehbar. Aber wirklich
          sehr sch&ouml;n. </P>

          <P><B>Anmerkungen: </B><BR>
          Diese Anmerkungen beziehen sich auf das H&ouml;rspiel. </P>

          <P>Es wurde 2003 vom SWR produziert und wird auch kommerziell vertrieben.
          </P>

          <P>Die Laufzeit betr&auml;gt 77 Minuten. </P>

          <P>Hierbei handelt es sich eigentlich um eine Erz&auml;hlung, die von
          vielen h&ouml;rspielerischen Einlagen und einer sehr sch&ouml;nen Musik
          unterlagert ist. Die Erz&auml;hlerin ist Jeanette Hain. Weiter spielen mit:
          <BR>

          Martin Feifel, Astrid F&uuml;nderich, Nikolaus Paryla, Dieter Laser, Eva
          Kryll, Hubertus Gertzen, Margarete Salbach, Julian Ando und Hiroshi Akutsu.
          </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a20"></A>
          <H3>Buchtitel: Mein Leben in Bhutan <BR>
          Autor: Zeppa, Jamie <BR>              
          Vorgestellt von: Sonnenblume <BR>
          Verlag: Piper <BR>                    
          Erscheinungsjahr: 2002 <BR>
          ISBN: 3492236634 <BR>                 
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Dieses Buch handelt von einer jungen Kanadischen Lehrerin, die &uuml;ber
          eine Agentur nach Bhutan geht, um dort f&uuml;r zwei Jahre eine Klasse zu
          unterrichten. Zuerst ist sie schockiert, doch nach und nach verliebt sie
          sich in Land und Leute. Sie findet dann auch ihren Lebenspartner dort und
          will ihr Leben in dieser Ruhe, ohne westliche Betriebsamkeit verbringen.
          </P>

          <P><B>Anmerkungen: </B><BR>
          Dieses Buch hat mich viel &uuml;ber Bhutan, seine Menschen und deren Sitten
          und Gebr&auml;uche gelehrt. Anfangs wollte ich des Titels wegen nicht mal
          reinschauen, dann war ich von dem Buch doch angetan. </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a21"></A>
          <H3>Buchtitel: Harry Potter und der Gefangene von Askaban <BR>
          Autor: Rowling, Joanne K. <BR>     
          Vorgestellt von: Eowyn <BR>
          Verlag: Carlsen Verlag GmbH <BR>   
          Erscheinungsjahr: 1999 <BR>
          ISBN: 3-551-55169-3 <BR>           
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Wieder verbringt Harry seine Sommerferien bei den wenig geliebten Dursleys.
          Und dieses Mal gibt es die Kr&ouml;nung im Besuch, von Vernons Onkel
          Vernons Schwester Magda. Sie scheint eine noch schlimmere Ausgabe Onkel
          Vernons zu sein, lebt in einem alten Landhaus, z&uuml;chtet Bulldoggen und
          l&auml;sst keine Gelegenheit aus, Harry zu beleidigen und &uuml;ber seine
          Eltern herzuziehen. Irgendwann verliert Harry die Beherrschung, was sich
          dadurch &auml;u&szlig;ert, dass Tante Magda am Ende zu
          &uuml;berm&auml;&szlig;iger Gr&ouml;&szlig;e aufgebl&auml;ht unter der
          Wohnzimmerdecke h&auml;ngt. Harry, der schon vor einem Jahr eine Verwarnung
          wegen Zauberei vom Zaubereiministerium bekommen und nun Angst hat,
          endg&uuml;ltig von Hogwarts, der Schule f&uuml;r Hexerei und Zauberei
          verwiesen zu werden, packt seinen Koffer und fl&uuml;chtet noch in der
          Nacht. Als er sich gerade in der N&auml;he seines Hauses in einer Gasse
          befindet, sieht er pl&ouml;tzlich einen riesenhaften schwarzen Hund, der
          ihn aus der Dunkelheit anstarrt. Doch noch bevor Harry reagieren kann,
          &uuml;berflutet Licht die Gasse und der "Fahrende Ritter" h&auml;lt direkt
          vor Harry. Der Fahrende Ritter ist eine Art Reisebus f&uuml;r hexen und
          Zauberer, und er bringt Harry sicher und f&uuml;r wenig Geld in die
          Winkelgasse nach London. Vom Schaffner des Busses erf&auml;hrt Harry, dass
          Sirius Black, einer der gef&auml;hrlichsten Gefangenen aus Askaban, dem
          Zauberergef&auml;ngnis ausgebrochen und noch immer auf freiem Fu&szlig;
          ist. Er soll 13 Menschen umgebracht haben, 12 davon Muggel, wie die
          Zauberer nicht-magische Menschen nennen. </P>

          <P>Als Harry in der Winkelgasse ankommt, wird er auch prompt vom
          Zaubereiminister erwartet, doch statt dieser ihn nun seines Zauberstabes
          beraubt, wie Harry erwartet hat, scheint er sich nur zu freuen, dass Harry
          wieder aufgetaucht ist. Das Missgeschick mit Tante Magda wurde behoben, und
          er weist Harry an, den Rest der Ferien in der Winkelgasse zu verbringen.
          </P>

          <P>Dort belauscht Harry am letzten Ferientag ein Gespr&auml;ch zwischen den
          Eltern seines besten Freundes Ron und erf&auml;hrt so, dass Black nicht
          ohne Ziel aus dem Gef&auml;ngnis ausgebrochen ist, sondern sich offenbar
          auf der Jagd nach Harry selbst befindet. </P>

          <P>Als Harry und seine Freunde nach Hogwarts fahren, bemerken sie, dass man
          an der Schule W&auml;chter aufgestellt hat, die man Dementoren nennt. Diese
          kommen direkt aus Askaban und haben den Auftrag, die Schule so lange zu
          bewachen, bis Sirius Black gefasst ist. <UL>

          <LI> Was ist damals vor gut 12 Jahren passiert, als man Black verhaftete? </LI>

          <LI> Was hat Black mit Harrys Eltern zu tun? </LI>

          <LI> Und warum hat er es nun auf Harry selbst abgesehen? </LI></UL></P>

          <P><B>Anmerkungen: </B><BR>
          Dieses nun dritte Buch &uuml;ber Harry Potter kann ich eigentlich nur als
          etwas d&uuml;sterer bezeichnen, als es die ersten beiden waren. Sei es
          allein der Gedanke an Sirius Black, einen Mann, der 12 Jahre im
          Gef&auml;ngnis sa&szlig;, weil er 13 Menschen umgebracht und nun vor hat,
          auch Harry zu t&ouml;ten, sei es das Auftauchen der Dementoren,
          Kapuzenverh&uuml;llten gesichtslosen Wesen, die ihren Opfern alles
          Gl&uuml;ck entziehen und sie v&ouml;llig ungl&uuml;cklich und jeglicher
          Hoffnung beraubt zur&uuml;cklassen. Sei es die Schilderung Askabans selbst,
          einem Gef&auml;ngnis, dass keine Sicherheitsma&szlig;nahmen braucht, da
          allein die Anwesenheit der Dementoren genug ist. Sie entziehen ihren
          Gefangenen jeden zuversichtlichen Gedanken, bis sie die Hoffnung auf Flucht
          aufgeben, und fast alle verlieren in diesem Gef&auml;ngnis &uuml;ber kurz
          oder lang den Verstand. </P>

          <P>Recht oft wird in diesem band von Mord gesprochen, jedenfalls, wenn man
          es im Verh&auml;ltnis zu den ersten beiden B&uuml;chern sieht. Und wieder,
          und vielleicht am st&auml;rksten wird Harry hier mit seiner Vergangenheit
          und seiner Familie konfrontiert. Wir erfahren mehr &uuml;ber Black,
          &uuml;ber Lord Vorldemort, dem Black nahegestanden haben soll, aber nichts
          desto Trotz schlittern wir schlie&szlig;lich auf ein v&ouml;llig
          unerwartetes Ende zu. </P>

          <P>Rowling hat hier f&uuml;r den Leser eigentlich zwei absolute
          Wendepunkte, an denen man als Leser ganz leicht die Orientierung verliert
          und seine Ansichten doch neu zurechtr&uuml;cken muss. </P>

          <P>Und gekr&ouml;nt wird dies alles von Harrys Lehrerin f&uuml;r Wahrsagen,
          die gleich in der ersten Stunde verk&uuml;ndet, sie habe in Harrys
          Teebl&auml;ttern den Grimm gesehen, der legende nach einen gro&szlig;en
          schwarzen Hund, der sonst oft auf Kirchh&ouml;fen herumschleicht. Die
          Legende sagt, jeder, der den Grimm sieht, wird innerhalb der n&auml;chsten
          24 Stunden Sterben. </P>

          <P>Also, alles in allem eine recht d&uuml;stere Geschichte, die aber im
          Endeffekt nur das erste Luftholen vor einer sich anbahnenden Katastrophe
          ist. Es lohnt sich auf jeden Fall, sowie die beiden B&auml;nde zuvor und
          sicher alle, die noch folgen. </P>

          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a22"></A>
          <H3>Buchtitel: Das Avalon-Projekt <BR>
          Autor: Hohlbein, Wolfgang <BR>        
          Vorgestellt von: Gimli <BR>
          Verlag: Weitbrecht Verlag <BR>        
          Erscheinungsjahr: 2000 <BR>
          ISBN: 3522717058 <BR>                 
          Format: Schwarzdruck </H3>

          <P><B>Inhalt: </B><BR>
          Der Versicherungsdetektiv Rudger wird von seiner Gesellschaft zur in der
          Nordsee gelegenen &Ouml;lbohrinsel Avalon II geschickt. Dort angekommen
          wird er mit seltsamen Ereignissen konfrontiert. Es stellt sich heraus, dass
          es in den vergangenen Jahren auf der Bohrinsel zu mehreren
          merkw&uuml;rdigen Zwischenf&auml;llen gekommen war, die von der Firma nicht
          gemeldet worden sind. Schlie&szlig;lich er&ouml;ffnet ihm die Mannschaft,
          dass in einem der St&uuml;tzpfeiler eine junge Frau gefunden wurde. Bei der
          Besichtigung des Fundorts entdeckt Rudger einen Dolch aus reinem Silber mit
          seltsamen Zeichen. Schlie&szlig;lich wird er zu der jungen Frau
          gef&uuml;hrt und stellt fest, dass sie im Sterben liegt. Inzwischen hat
          sich alles grundlegend ver&auml;ndert. Drau&szlig;en zieht ein
          m&auml;chtiger Sturm auf, und Rudger stellt zu seiner &Uuml;berraschung
          fest, dass er nicht mehr auf der Avalon II, sondern auf der vor 25 Jahren
          verschwundenen Avalon I ist. Trotz allem beschlie&szlig;t er, die junge
          Frau zum Festland in ein Krankenhaus zu bringen. Mit drei Mann Besatzung,
          darunter auch dem Sohn des Firmenchefs, tritt er die Fahrt in einem Boot
          an. Doch unterwegs taucht pl&ouml;tzlich ein Segelschiff auf, das Boot wird
          geentert, die Frau von merkw&uuml;rdig gekleideten M&auml;nnern
          entf&uuml;hrt, zwei Besatzungsmitglieder get&ouml;tet, und der Sohn des
          Firmenchefs verschwindet auf dem Schiff. </P>

          <P>Nach Hamburg zur&uuml;ckgekehrt trifft Rudger im B&uuml;ro seines Chefs
          den Eigent&uuml;mer der &Ouml;lfirma Arthur Spangler. Bei einem
          anschlie&szlig;enden Abendessen bietet dieser Rudger 2 Mio. Pfund, damit
          Rudger seinen Sohn wieder findet. </P>

          <P><B>Anmerkungen: </B><BR>
          Es ist eines der ersten B&uuml;cher, die ich von Hohlbein gelesen habe. Es
          hat mich vom ersten Augenblick an gefesselt. In diesem Buch treffen zwei
          total verschiedne Welten aufeinander. Zum einen die moderne mit all ihrer
          Technik und zum anderen die Keltische Kultur und Mythologie. Es ist eine
          spannende und abwechslungsreiche Geschichte mit vielen &Uuml;berraschungen
          und merkw&uuml;rdigen Ereignissen. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a23"></A>
          <H3>Buchtitel: Harry Potter und der Feuerkelch <BR>
          Autor: Rowling, Joanne K <BR>   
          Vorgestellt von: Gimli <BR>
          Verlag: Carlsen <BR>            
          Erscheinungsjahr: 2001 <BR>
          ISBN: 3551552533 <BR>           
          Format: Schwarzdruck </H3>

          <P><B>Inhalt:</B><BR>
          Einmal mehr verbringt Harry die Sommerferien bei seinen ungeliebten
          Verwandten, den Dursleys im Ligusterweg. Eines nachts tr&auml;umt Harry von
          Lord Voldemort, der Harrys Eltern ermordet hatte, als Harry ein Jahr alt
          war. Beim Versuch, Harry selbst umzubringen, f&auml;llt der Todeszauber auf
          Voldemort zur&uuml;ck und beraubt diesen jeglicher Macht. Harry beh&auml;lt
          davon eine blitzf&ouml;rmige Narbe auf der Stirn zur&uuml;ck. In Harrys
          Traum beschlie&szlig;t Lord Voldemort erneut, ihn umzubringen. Als Harry
          erwacht, schmerzt seine Narbe und Harry hat das deutliche Gef&uuml;hl, dass
          Voldemort wieder aktiv ist. </P>

          <P>Doch schon bald wird dieser d&uuml;stere Traum von einem aufregenden
          Ereignis verdr&auml;ngt. Eines Morgens bringt der Postbote einen &uuml;ber
          und &uuml;ber mit Briefmarken beklebten Brief. Er stammt von der Mutter
          seines besten Freundes Ron. Sie bittet die Dursleys um Erlaubnis, Harry zum
          Finale der Quidditschweltmeisterschaft mitnehmen zu d&uuml;rfen. Quidditsch
          ist der beliebteste Sport unter Zauberern.</P>

          <P>Doch nach dem Endspiel zwischen Irland und Bulgarien kommt es zu einem
          Zwischenfall. Pl&ouml;tzlich erscheint ein Totenkopf am Himmel. Es ist das
          Zeichen von Lord Voldemort. Wie sich zeigt, wurde der daf&uuml;r
          erforderliche Zauber mit Harrys Zauberstab ausge&uuml;bt, den er
          w&auml;hrend des Spiels verloren hat. Doch wer hat das Zeichen
          hervorgebracht? </P>

          <P>In Hogwarts gibt es Neuigkeiten. Bei der &uuml;blichen
          Begr&uuml;&szlig;ung er&ouml;ffnet der Schulleiter Professor Dumbledore den
          Sch&uuml;lern, dass nach vielen Jahren wieder das trimagische Turnier
          stattfinden soll, das zwischen den drei f&uuml;hrenden Zaubererschulen
          ausgetragen wird. Dazu erw&auml;hlt jede Schule einen Champion, der im
          Wettstreit mit den beiden anderen drei schwere Aufgaben l&ouml;sen muss. Da
          es in der Vergangenheit zu t&ouml;dlichen Zwischenf&auml;llen gekommen war,
          wird in diesem Jahr bestimmt, dass nur Sch&uuml;ler daran teilnehmen
          d&uuml;rfen, die 17 Jahre und &auml;lter sind. Die Pergamente mit den Namen
          der Bewerber kommen in einen magischen Kelch, der die drei Champions
          bestimmen wird. Doch als Dumbledore die drei Namen verk&uuml;ndet hat,
          taucht pl&ouml;tzlich ein viertes Pergament auf, das Harrys Namen
          enth&auml;lt. </P>

          <P>Wie kommt der Zettel mit Harrys Namen in den Kelch? Hat er es irgendwie
          geschafft, die Altersbegrenzung zu umgehen, oder hat gar jemand anderer den
          Zettel f&uuml;r Harry eingeworfen? </P>

          <P>Wird Harry die Aufgaben l&ouml;sen, oder m&ouml;chte jemand, dass er
          scheitert und dabei umkommt? </P>

          <P><B>Anmerkungen:</B><BR>
          Es ist das bisher umfangreichste und f&uuml;r mich d&uuml;sterste Buch
          dieser Reihe. Die Geschichte wird von Lord Voldemort &uuml;berschattet, der
          endg&uuml;ltig in Erscheinung tritt und wieder an Macht gewinnt. Eine
          wirklich &uuml;berraschende und unerfreuliche Wende nimmt die Geschichte am
          Ende des trimagischen Turniers, das f&uuml;r einen der Teilnehmer
          t&ouml;dlich endet. Vollends unerfreulich wird es, als Voldemort auf einem
          Friedhof wieder seine k&ouml;rperliche Gestalt erhalten soll und so
          endg&uuml;ltig zu alter Macht zur&uuml;ckkehren will. </P>

          <P>Das Buch ist sehr spannend, hat aber nichts mehr von der Leichtigkeit
          der ersten beiden B&auml;nde. Es macht aber Lust auf den f&uuml;nften Band.
          </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a24"></A>
          <H3>Buchtitel: Harry Potter und der Orden des Ph&ouml;nix <BR>
          Autor: Rowling, Joanne K. <BR>    
          Vorgestellt von: Eowyn<BR>
          Verlag: Carlsen Verlag GmbH <BR>  
          Erscheinungsjahr: 2003 <BR>
          ISBN: 3-551-55555-9 <BR>          
          Format: Schwarzdruck </H3>

          <P><B>Inhalt:</B><BR>
          Und wieder ist Harry &uuml;ber den Sommer zu seinen Verwandten in den
          Ligusterweg zur&uuml;ckgekehrt, doch diesen Sommer ist alles anders. Lord
          Voldemort, der Zauberer, der zu Zeiten von Harrys Geburt eine
          Schreckensherrschaft &uuml;ber die Zaubererwelt f&uuml;hrte, hat vor ein
          paar Monaten seinen K&ouml;rper wieder zur&uuml;ckerlangt, seine treuen
          Diener, die Todesser wieder um sich geschart und beginnt nun, seine Macht
          erneut aufzubauen. Harry hat die Wiederauferstehung selbst mit ansehen
          m&uuml;ssen, doch au&szlig;er Dumbledore, seinen Freunden Ron und Hermine
          und einigen wenigen anderen, will ihm diese Geschichte niemand glauben. Man
          propagiert gegen ihn und Professor Dumbledore, den Leiter von Hogwarts, und
          l&auml;sst nichts unversucht, um Harry und ihn vor der gesamten
          Zaubererschaft unglaubw&uuml;rdig zu machen. Im Tagespropheten, der Zeitung
          f&uuml;r hexen und Zauberer, erscheinen fast t&auml;glich Artikel, die
          Harry als instabil und nicht ganz zurechnungsf&auml;hig, als
          verst&ouml;rten Teenager hinstellen, der mit seiner Geschichte von einem
          wieder auferstandenen Lord Voldemort nur nach Aufmerksamkeit und Beachtung
          sucht, und so sinkt das Ansehen der beiden einzigen, die vielleicht Licht
          in diese Angelegenheit bringen k&ouml;nnten immer weiter. </P>

          <P>Doch von all dem merkt Harry nichts. Er ist bei seinem Onkel Vernon und
          seiner Tante Petunia von allem ausgeschlossen, was mit hexen und Zauberern
          zu tun hat, und den Tagespropheten liest er nur zu einem kleinen Teil, da
          er auf Anzeichen von Aktionen Voldemorts wartet. Von seinen Freunden Ron
          und Hermine erh&auml;lt er auch keine Informationen, nur r&auml;tselhafte
          Briefe, in denen sie bedauernd mitteilen, dass sie ihm nicht sagen
          k&ouml;nnten, wo sie w&auml;ren, und auch nicht einmal erw&auml;hnen
          d&uuml;rften, was sie tun. </P>

          <P>Eines Abends, als Harry mit seinem Cousin Dudley unterwegs nach hause
          ist, wird er von zwei Dementoren angegriffen, die er nur mit M&uuml;he und
          nat&uuml;rlich mit Hilfe von Magie zur&uuml;ckschlagen kann, bevor sie ihm
          und Dudley zu nahe r&uuml;cken. Sofort, als er nach hause kommt, flattert
          eine Eule mit einem Brief bei ihm ein, in dem ihm mitgeteilt wird, dass er
          zum wiederholten Male gegen den Erlass zur vernunftgem&auml;&szlig;en
          Beschr&auml;nkung der Zauberei Minderj&auml;hriger versto&szlig;en habe,
          und daher ein Mitarbeiter des Ministeriums umgehend bei ihm auftauchen und
          seinen Zauberstab zerbrechen w&uuml;rde. </P>

          <P>Die n&auml;chste Eule k&uuml;ndigt Harry eine Verhandlung vor dem
          Gericht an, um den Fall neu zu durchleuchten. Zu guter Letzt kommen zwei
          Briefe f&uuml;r ihn an, einer von Athur Weasley, dem Vater seines besten
          Freundes Ron, Mitarbeiter im Zaubereiministerium, und einer von seinem
          Paten Sirius, die ihm klar und deutlich zu verstehen geben, dass er zu
          seiner eigenen Sicherheit im haus von Onkel und Tante bleiben m&uuml;sse.
          Nichts weiter, keine Informationen oder Antworten, und in Harry macht sich
          langsam Wut dar&uuml;ber breit, dass ihm niemand etwas sagen m&ouml;chte.
          </P>

          <P>Doch diese Wut verfliegt vorerst v&ouml;llig, als sich an einem Abend,
          an dem die Dursleys nicht zu Hause sind, pl&ouml;tzlich eine Gruppe von
          hexen und Zauberern im haus zeigt, die Harry mitnehmen und nach London
          bringen. </P>

          <P>Dort kommen sie im haus von Sirius unter, das vor Muggeln und Zauberern
          versteckt ist und gleichzeitig das Hauptquartier des Ph&ouml;nixordens
          bildet. Dieser Orden wurde von Dumbledore sofort nach dem Erscheinen
          Voldemorts wieder ins Leben gerufen und ihre Aufgabe ist es, alles gegen
          den dunklen Magier zu unternehmen, was m&ouml;glich ist. </P>

          <P>Die Verhandlung l&auml;uft gut, und Harry kann mit Ron und Hermine nach
          Hogwarts zur&uuml;ckkehren, doch dort ist fast nichts mehr, wie es noch in
          den Jahren zuvor war. </P>

          <P>Hagrid, der Wildh&uuml;ter von Hogwarts und Lehrer f&uuml;r die Pflege
          magischer Gesch&ouml;pfe ist fort, und niemand kann Harry sagen, wo er sich
          aufh&auml;lt. Doch damit nicht genug. Das schlimmste ist die neue Lehrerin
          f&uuml;r Verteidigung gegen die dunklen K&uuml;nste, Dolores Umbridge.
          Nachdem Dumbledore sich als Schulleiter das Missfallen fast des gesamten
          Zaubereiministeriums, aber auf jeden Fall das des Ministers selbst
          zugezogen hat, hat man beschlossen, diese Frau als neue Lehrerin
          einzustellen, die gleichzeitig f&uuml;r das Ministerium arbeitet. Man
          m&ouml;chte Dumbledore im Auge behalten, und den Dorn, der er in den Augen
          vieler ist, wenn n&ouml;tig sofort ziehen k&ouml;nnen. </P>

          <P>Umbridge ist nicht wirklich umg&auml;nglich, f&uuml;hrt ihren Unterricht
          rein theoretisch, da sie verhindern m&ouml;chte, dass die Sch&uuml;ler zu
          viel &Uuml;bung in der Ausf&uuml;hrung von Magie bekommen und hat Harry
          besonders scharf im Auge. </P>

          <P>Als er sich in ihrem Unterricht offen ausspricht und erz&auml;hlt, dass
          Lord Voldemort zur&uuml;ckgekehrt sei, verh&auml;ngt sie f&uuml;r ihn die
          erste von vielen Strafarbeiten, die in ihrer k&ouml;rperlichen Gewalt
          nichts mehr mit p&auml;dagogischen Ma&szlig;nahmen zu tun haben. </P>

          <P>Und sie ist nicht die einzige, die Harry offen als L&uuml;gner
          bezeichnet. Viele seiner Freunde schlagen nun einen gro&szlig;en Bogen um
          ihn, da sie alle den Tagespropheten gelesen haben und ihm glauben, Harry
          somit ebenfalls nicht f&uuml;r ehrlich halten. </P>

          <P>Und dies alles sind nur die Anf&auml;nge. W&auml;hrend sich die Schule
          gegen das Ministerium wehren und Dumbledore darauf achten muss, dass man
          nicht den Stuhl des Schulleiters unter ihm weg zieht, verfolgen Harry
          eigenartige Tr&auml;ume in der Nacht. Tr&auml;ume von einem langen und
          d&uuml;steren Korridor, an dessen Ende eine T&uuml;r liegt, durch die er
          unbedingt hindurch m&ouml;chte. Im Ph&ouml;nixorden vermutet man, dass dies
          nicht seine Tr&auml;ume sind, sondern seine Verbindung zu Lord Voldemort
          immer st&auml;rker wird, die dieser kn&uuml;pfte, als er damals versuchte,
          Harry durch einen fluch zu t&ouml;ten und dies nicht gelang. Harrys narbe
          schmerzt zusehends, und langsam bekommt er die F&auml;higkeit, &uuml;ber
          viele Meilen die Gef&uuml;hle, ob positiv oder negativ, des dunklen Lords
          zu sp&uuml;ren. bis er eines nachts tr&auml;umt, einen Menschen zu
          t&ouml;ten, einen Menschen, den er sehr sehr gut kennt... </P>

          <P><B>Anmerkungen:</B><BR>
          Man k&ouml;nnte noch viel mehr &uuml;ber dieses Buch schreiben, denn es ist
          das bisher umfangreichste der Romane &uuml;ber Harry Potter. Doch
          unterscheidet es sich in vielerlei Hinsicht von den anderen B&uuml;chern.
          Nichts ist mehr, wie es scheint. Das zauberhafte, welches die ersten
          B&auml;nde ausgezeichnet hat, ist hier fast v&ouml;llig verloren. Unter der
          Anspannung, die einerseits von den Ereignissen selbst ausgel&ouml;st wird,
          andererseits aber auch dadurch, dass unsere Protagonisten nun langsam aber
          sicher in der Hochfase der Pubert&auml;t stecken, geraten sie sich oft in
          die haare, und die Einigkeit, die sonst unter den dreien Geherrscht hat,
          findet man nun nur noch in extremen Situationen. Es gibt kein richtiges
          quidditsch, da Oliver Wood, der Kapit&auml;n der Mannschaft vor zwei Jahren
          abgegangen ist, Hagrid, ein unentbehrliches Element der Idylle, fehlt
          ebenfalls und Harry und seine Freunde machen sich zunehmend Sorgen um ihn.
          </P>

          <P>Ist er f&uuml;r den Orden unterwegs gewesen? Ist ihm etwas passiert?
          Lebt er &uuml;berhaupt noch? Und &uuml;ber allem Dolores Umbridge, die nach
          und nach immer mehr Unruhe an die Schule bringt. Sie bekommt
          schlie&szlig;lich den Posten der "Gro&szlig;inquisitorin" - meiner Meinung
          nach ist dieser Titel an einer Schule f&uuml;r hexen und Zauberer der reine
          Hohn - und hat damit eine Machtposition inne, die sie skrupellos
          auszunutzen beginnt. Sie f&auml;ngt an, den Unterricht aller Lehrer zu
          inspizieren und scheint alle die aus der Schule haben zu wollen, die
          Dumbledore zu nahe stehen k&ouml;nnten, denn noch kann sie auf den
          Schulleiter keinen direkten Angriff wagen. </P>

          <P>Sie zieht sich den hass der Sch&uuml;ler und der Lehrer zu, selbst
          Severus Snape, der Lehrer f&uuml;r Zaubertr&auml;nke, den Harry am meisten
          hasst und von dem er selbst am meisten gehasst wird, scheint da keine
          Ausnahme zu bilden. Allein Draco Malfoy aus dem hause Slytherin scheint
          zufrieden mit der Lage zu sein, wird er doch von Umbridge immer wieder
          beg&uuml;nstigt. Ebenso genie&szlig;t sein Vater hohes Ansehen im
          Ministerium, und zu erw&auml;hnen ist auch noch, dass Harry ihn
          w&auml;hrend der unglaublichen Szene auf dem Friedhof, als Voldemort wieder
          auferstand, unter der Maske eines Todessers erkannt hatte. letztlich
          schildert dieses Buch jedoch nicht so sehr den Kampf zwischen Harry,
          Dumbledore und der anderen gegen Lord Voldemort und seine Anh&auml;nger,
          viel mehr ist es ihr Kampf gegen die B&uuml;rokratie und die Verstocktheit
          der Leute. Es ist ein Kampf innerhalb der Zaubererschaft, der diese spaltet
          und so keine M&ouml;glichkeit bietet, etwas gegen Voldemort zu unternehmen.
          </P>

          <P>Sie k&auml;mpfen gegen das Ministerium in der Gestalt Umbridges und
          gegen den Zaubereiminister selbst, der Umbridge nach und nach jede Befugnis
          einr&auml;umt, die sie zu brauchen glaubt. </P>

          <P>Sch&uuml;ler stehen gegen Sch&uuml;ler, und Lehrer gegen Lehrer und es
          dauert lange, bis die ersten ein Einsehen haben. man kann Umbridge nicht
          einmal vorwerfen, Voldemort bewusst und mit B&ouml;swillen in die
          H&auml;nde zu spielen. In ihr vereinigt Rowling scheinbar nur
          s&auml;mtliche schlechten Eigenschaften der Staatsgewalt, die ihr in den
          Sinn gekommen sein m&ouml;gen, und schlie&szlig;t sie zu einer Person, die
          man selbst als Leser nach und nach regelrecht hassen lernt. Konservativ,
          verstockt, stur und unverr&uuml;ckbar, immer darauf bedacht, die Situation
          und die Gewalt dar&uuml;ber in ihren H&auml;nden und den H&auml;nden des
          Ministeriums zu behalten, l&auml;sst sie nichts unversucht, eine
          regelrechte Diktatur in der Schule aufzurichten, deren Ziel es sein soll,
          Dumbledore als Schulleiter abl&ouml;sen zu lassen, oder selbst
          abzul&ouml;sen... </P>

          <P>Der Fokus wird hierbei auch auf eine nicht gerade seltene Eigenschaft
          des Menschen gezogen. Man &uuml;bersieht alles Unangenehme, wenn man sich
          nur genug anstrengt, da es oft so viel bequemer ist, bis es sich bei allem
          Willen nicht mehr &uuml;bersehen l&auml;sst, es aber auch schon zu
          sp&auml;t sein mag. </P>

          <P>Nichts anderes ist es im Ministerium, und doch kann diese Haltung Harry
          und allen, die ihm nur glauben und beistehen m&ouml;chten, den Hals
          brechen. Nicht selten fasst man sich als Leser an den Kopf,
          st&ouml;&szlig;t man auf die Ignoranz mancher Leute, wenn es darum geht, ob
          Voldemort nun wieder zur&uuml;ckgekehrt ist, oder nicht. Es ist wohl das
          bisher spannendste Buch um Harry Potter und das Ende l&auml;sst darauf
          schlie&szlig;en, dass sich diese Spannung in den beiden noch geplanten
          B&auml;nden nicht &auml;ndern wird. </P>

          <P>Wer Harry Potter bis hierher oder auch nur bis zum vierten Band gelesen
          hat, wird so oder so auf den sechsten und siebten gar nicht mehr verzichten
          <B>k&ouml;nnen</B>. </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <A name="a25"></A>
          <H3>Buchtitel: Nomadentochter <BR>
          Autor: Dirie, Waris<BR>        
          Vorgestellt von: Eowyn <BR>
          Verlag: Blanvalet <BR>         
          Erscheinungsjahr: 2002 <BR>
          ISBN: 3764501383 <BR>          
          Format: Schwarzdruck</H3>

          <P><B>Inhalt:</B><BR>
          "Meine Kinderzeit in Somalia hat meine Pers&ouml;nlichkeit dauerhaft
          gepr&auml;gt und mich immer davon abgehalten, triviale Dinge ernst zu
          nehmen - zum Beispiel Erfolg und Ber&uuml;hmtheit. Davon verstehe ich nicht
          das Geringste. Ich wei&szlig; nur, dass meine Art zu denken afrikanisch
          ist, und das wird sich nie &auml;ndern." (Waris Dirie) </P>

          <P>Waris wuchs in einer Nomadenfamilie in Somalia auf. Mit 13 verlie&szlig;
          sie ihre Familie, als ihr Vater sie gegen ihren Willen verheiraten wollte,
          schlug sich bis nach London durch, wo sie vier Jahre lang als
          Hausm&auml;dchen f&uuml;r ihren Onkel arbeitete, und wurde mit 18
          schlie&szlig;lich als Model entdeckt. Sie startete dort ihre Karriere,
          reiste in viele L&auml;nder der Welt und zog schlie&szlig;lich nach new
          York, wo sie Dana kennenlernte, mit ihm lang zusammenlebte und
          schlie&szlig;lich auch ein Kind bekam. </P>

          <P>Trotz ihres Erfolges, oder vielleicht gerade deswegen wird in ihr nun
          das Heimweh wach. Heimweh nach ihrem Land und ihrer Familie. Doch &uuml;ber
          all dem steht, am aller st&auml;rksten, die Sehnsucht nach ihrer Mutter. An
          ihr, und was sie von ihr gelernt hat, h&auml;lt sich Waris noch immer fest,
          wie sehr sie sich nach au&szlig;en hin auch an das westliche Leben anpassen
          mag, das sich so von dem in ihrer Heimat unterscheidet. Waris selbst ist
          mit f&uuml;nf Jahren beschnitten worden, und erg&auml;nzt ihre
          Modelkarriere nun durch &Ouml;ffentlichkeitsarbeit, Auftritte in Talkshows
          und Interviews, in denen sie &uuml;ber Frauenrechte und die Praktiken der
          Beschneidung spricht. Trotz dem sie wei&szlig;, dass die Beschneidung nicht
          recht und vor allem Symbol f&uuml;r die Unterdr&uuml;ckung der Frauen in
          ihrer Heimat und an vielen anderen Orten ist, f&uuml;hlt sie sich schuldig.
          Sie trinkt, und ihr Schuldgef&uuml;hl verst&auml;rkt ihr Heimweh nur noch
          mehr. </P>

          <P>Schlie&szlig;lich nimmt sie Kontakt zu ihrem Bruder auf, der in Holland
          lebt, und ringt sich durch, nach Somalia zu fliegen und nach ihrer Familie
          zu suchen. Erst ist sie unsicher, da es fast unm&ouml;glich scheint, nach
          Somalia zu kommen, das in diesen Jahren vom Krieg zerrissen und noch immer
          unsicher durch inzwischen &uuml;berall ausgebrochene Stammesfehden ist.
          Ebenso wei&szlig; sie nicht, ob ihre Familie &uuml;berhaupt noch lebt, doch
          l&auml;sst sie sich nicht entmutigen und tritt die schwere Reise nach
          Somalia an. </P>

          <P><B>Anmerkungen:</B><BR>
          Waris Diries Roman ist authentisch und ihr zweites Buch bisher. Es
          berichtet von einer Frau, die zwischen zwei Kulturen steht, und in beiden
          doch nicht richtig zu leben vermag. Vieles am westlichen Lebensstil
          verwirrt sie. Sei es das Aufteilen des Tages in Termine, was in ihrer
          Heimat undenkbar gewesen w&auml;re, sei es die verschwenderische
          Lebensweise der Menschen um sie herum, die Minuten lang kostbares Wasser
          aus den H&auml;hnen laufen lassen, das Konzept von Fastfood, wo es in ihrer
          Kindheit Sitte war, das Essen f&uuml;r etwas heiliges zu Halten, ein
          Geschenk Allahs, und ihm vorher and&auml;chtig daf&uuml;r zu danken, das
          ern&auml;hren von S&auml;uglingen aus der Flasche, ein Luxus, den es in
          ihrer Heimat nat&uuml;rlich nie gab... </P>

          <P>Endlos k&ouml;nnte man das fortf&uuml;hren, und doch sieht man bald,
          dass sie, als sie in Somalia ankommt, nicht den Frieden und die Ruhe
          findet, die sie sich erhofft hat. Sicher f&uuml;hlt sie sich daheim, kennt
          sie doch die Landschaft, die Art der Leute, zu reden und sich zu geben, und
          doch st&ouml;&szlig;t sie auf Hindernisse. </P>

          <P>Sie hat gelernt, selbstbewusst zu sein, und ist zuerst verwirrt, als
          kaum ein Mann mit ihr redet, einige sich sogar nicht davon abbringen
          lassen, g&auml;nzlich an ihr vorbeizusehen und sie zu ignorieren. Sie
          f&uuml;hlt sich unwohl, verschleiert zu gehen, und selbst Kleidung, wie sie
          f&uuml;r uns selbstverst&auml;ndlich ist, Hosen zum Beispiel, sind dort
          undenkbar. Vieles aus ihrer Heimat vermisst sie, doch kann sie sich so, wie
          man es von ihr erwartet dort nicht mehr anpassen. </P>

          <P>Das Buch schildert die Zust&auml;nde in Somalia, die der
          B&uuml;rgerkrieg dort hinterlassen hat, die Armut der Menschen, und ihre
          Mentalit&auml;t, die ihnen hilft, damit umzugehen. Tats&auml;chlich liest
          man nur wenige mitleiderregende Worte, es gibt viele Menschen, die ihre
          Heimat doch gegen nichts eintauschen wollen. Sie nehmen, was sie bekommen
          und danken Allah daf&uuml;r, ohne sich zu beschweren, dass es nicht mehr
          ist. </P>

          <P><B>Aus dem Buch: </B><BR>
          Meine Mutter betrachtete ihren &auml;ltesten Sohn. "Es war einmal ein
          reicher und ber&uuml;hmter Sultan", begann sie. </P>

          <P>"Hiiyea", freuten wir uns einstimmig. Eine Geschichte! Mutters Augen
          gl&auml;nzten im Feuerschein nun doch, und sie unterstrich jeden Satz mit
          viel sagenden Gesten. </P>

          <P>"Er hatte bestickte Hemden und weiche Teppiche. In seinem Palast in
          Mogadischu am Indischen Ozean wehte immer ein k&uuml;hlender Wind.
          Ausgestattet war er mit kostbaren Edelsteinen und Seiden aus Arabien.
          Feinste Duftlampen brannten in jedem Gemach, ob er sich nun darin aufhielt
          oder nicht. Trotz seines unermesslichen Reichtums war er jedoch
          ungl&uuml;cklich - aber er wusste nicht, was ihm fehlte. Er hatte viele
          Frauen, die st&auml;ndig n&ouml;rgelten, S&ouml;hne, die miteinander
          stritten, und T&ouml;chter, die schmollten. Zwar konnte er sich alles
          kaufen, was er nur begehrte, aber empfand indes keinerlei Zufriedenheit.
          Eines Morgens nach einer schlaflosen Nacht rief er seine Diener und sagte
          zu ihnen: 'Macht euch auf die Suche nach einem wahrhaft gl&uuml;cklichen
          Mann. Wenn ihr ihn gefunden habt, bringt ihn zu mir. Ich will mich mit ihm
          unterhalten.' </P>

          <P>Die Diener suchten im ganzen Land und eines Tages stie&szlig;en sie auf
          einen armen Hungerleider, der sang, w&auml;hrend er aus einem kleinen
          Wasserloch Wasser f&uuml;r sein mageres Kamel sch&ouml;pfte. Summend molk
          er das Tier und teilte die wenige Milch mit den Dienern des Sultans. Obwohl
          sein Magen leer war, lachte er und machte Scherze. </P>

          <P>'Bist du ein gl&uuml;cklicher Mann?', erkundigten die Diener sich.
          'Weshalb sollte ich denn ungl&uuml;cklich sein?', erwiderte er. </P>

          <P>'Bitte, dann komm mit zum Palast des Sultans', bat der &auml;lteste
          Diener. 'Mein Herr m&ouml;chte dich gerne kennen lernen.' Der Arme willigte
          ein, und sie reisten vom Haud bis in die gro&szlig;e Stadt Mogadischu. So
          etwas hatte er noch nie gesehen. Es gab so viele Menschen, so viele Farben
          und Dinge, die man riechen und ber&uuml;hren konnte. Der Sultan bewirtete
          ihn reichhaltig mit wundervollen Fr&uuml;chten und Speisen, er gab ein
          &uuml;ppiges Festmahl f&uuml;r ihn und &uuml;berreichte ihm eine bestickte
          Goa. </P>

          <P>'Was ist das Geheimnis des Gl&uuml;cks?', fragte der Sultan
          schlie&szlig;lich und lehnte sich in seine weichen Kissen zur&uuml;ck. Der
          Arme wusste nicht, was er antworten sollte, seine Zunge war wie
          angewachsen, und er konnte nicht sprechen. Er hatte keine Ahnung, was ihn
          am Leben in der W&uuml;ste gl&uuml;cklich machte - es war einfach so.
          Entt&auml;uscht schickte der Sultan ihn wieder weg, und der Mann kehrte zu
          seinem Kamel und zu seiner aus Holz geschnitzten Milchsch&uuml;ssel
          zur&uuml;ck. Aber nie verga&szlig; er die Wunder im Sultanspalast - und er
          wurde nie wieder gl&uuml;cklich." </P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR>
          <!-- <A name="a23"></A>
          <H3></H3>
          <P></P>
          <A href="#top">zum Inhaltsverzeichnis</A>
          <HR> //-->
          
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>


