<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>[B&Uuml;CHERWURM] - Buchvorstellungen</TITLE>
  </HEAD>

  <BODY background="images/bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>[B&Uuml;CHERWURM]</B></FONT></P>
          <A name="top"></A> 

          <H3>Inhalt:</H3>

          <UL>
            <LI><A href="#a01">Der Fluch der schwarzen Lilie</A></LI>

            <LI><A href="#a02">Die Zauberin von Ruwenda</A></LI>

            <LI><A href="#a03">Liebe Tracey, liebe Mandy</A></LI>

            <LI><A href="#a04">Ruhe in Fetzen</A></LI>

            <LI><A href="#a05">Traumf&auml;nger</A></LI>

            <LI><A href="#a06">Virus im Netz</A></LI>

            <LI><A href="#a07">Die Papierverschw&ouml;rung</A></LI>

            <LI><A href="#a08">Floraliebling</A></LI>

            <LI><A href="#a09">Geheimnis im Moor</A></LI>

            <LI><A href="#a10">An den Feuern von Hastur</A></LI>

            <LI><A href="#a11">Sternenflut</A></LI>

            <LI><A href="#a12">Phantastische Tierwesen und ...</A></LI>

            <LI><A href="#a13">Quidditch im Wandel der Zeiten</A></LI>

            <LI><A href="#a14">Vom Winde verweht</A></LI>

            <LI><A href="#a15">Per Anhalter durch die Galaxis</A></LI>

            <LI><A href="#a16">Erinnerung an David</A></LI>

            <LI><A href="#a17">Theos Reise</A></LI>

            <!-- <LI><A href="#a18"></A></LI>  -->
          </UL>
        <HR>
        <A name="a01"></A>

        <H3>Buchtitel: Der Fluch der schwarzen Lilie<BR>
        Autor: Zimmer Bradley, Marion; May, Julian<BR>
        Vorgestellt von: Rothaut<BR>
        Verlag: WILHELM HEYNE VERLAG<BR>
        Erscheinungsjahr: 1997<BR>
        Gesamtseitenzahl: 477<BR>
        ISBN: 3453117042<BR>
        Format: Digital ASCII</H3>

        <P><B>Inhalt:</B><BR>
        Haramis ist die sagenumwobene Erzzauberin von Laboruwenda, die "Wei&szlig;e
        Frau", die H&uuml;terin und Besch&uuml;tzerin des Bergvolkes. Sie ist noch
        neu in ihrem hohen Amt, und jetzt kann sie beweisen, da&szlig; sie der
        Aufgabe w&uuml;rdig ist, denn die Welt bedarf ihrer Hilfe. Im ganzen Land
        gibt es Anzeichen f&uuml;r Unruhe, und es existieren Ger&uuml;chte,
        da&szlig; das B&ouml;se unter den Seltlingen und den Menschen wiedergeboren
        ist &ndash; das Gleichgewicht der Welt ist gef&auml;hrdet. Und f&uuml;r den
        Erhalt dieses Gleichgewichts wacht Haramis zusammen mit ihren Schwestern
        Kadiya und Anigel. Vor zw&ouml;lf Jahren haben die drei Prinzessinnen den
        Zauberer Orogastus besiegt. Und mit ihm ist das B&ouml;se untergegangen.
        Doch nun scheint eine neue Gefahr aufzutreten, oder ist es etwa Orogastus,
        der sich erneut gegen sie erhebt? K&ouml;nnen die drei Schwestern
        endg&uuml;ltig das friedvolle Gleichgewicht wiederherstellen, auch wenn
        untereinander Zwist besteht? Mit Hilfe ihres Talismans, den sie von Geburt
        an tragen, dem Amulett der Drillingslilie, k&auml;mpfen Haramis, Kadiya und
        Anigel f&uuml;r den Frieden der Welt ...</P>

        <P><B>Quelle:</B><BR>
        http://www.buecher-eule.de/showBook212.html</P>

        <P><B>Anmerkungen:</B><BR>
        Ein faszinierendes Buch aus der Welt der Phantasie mit tief menschlich
        warmer Pr&auml;gung Empfehlung: Wer den Ruwenda-Zyklus einmal zu lesen
        begonnen hat, kommt auch in diesem Buch voll auf seine Rechnung</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a02"></A> 

        <H3>Buchtitel: Die Zauberin von Ruwenda<BR>
        Autor: Zimmer Bradley, M.; May, J.; Norton, A.<BR>
        Vorgestellt von: Rothaut<BR>
        Verlag: Heyne<BR>
        Erscheinungsjahr: 1995<BR>
        Gesamtseitenzahl: 541<BR>
        ISBN: 345309221X<BR>
        Format: Digital Ascii</H3>

        <P><B>Inhalt:</B><BR>
        Ruwenda, ein bl&uuml;hendes Land, wird seit Jahrhunderten von der
        Erzzauberin Binah besch&uuml;tzt. Als ihre Kr&auml;fte schwinden,
        &uuml;bergibt sie den drei Prinzessinnen bei ihrer Geburt Amulette mit der
        schwarzen Lilie, einer mythischen Pflanze mit Zauberkraft. Die M&auml;dchen
        reifen zu wundersch&ouml;nen Frauen heran, doch dann werden die schlimmsten
        Bef&uuml;rchtungen von Binah Wirklichkeit. Der K&ouml;nig des benachbarten
        Labornok f&auml;llt in das Land ein und t&ouml;tet die K&ouml;nigsfamilie,
        nur die drei Prinzessinnen k&ouml;nnen fliehen. Binah schickt sie nun auf
        die Suche nach drei Talismanen, die zusammengef&uuml;gt ihre einzige Chance
        sind, das K&ouml;nigreich zur&uuml;ck zu erobern. Jede Prinzessin mu&szlig;
        ihre Aufgabe alleine ausf&uuml;hren. Und um zum Erfolg zu gelangen,
        m&uuml;ssen sie auch ihre eigenen Grenzen erkennen und &uuml;berwinden
        ...</P>

        <P><B>Quelle:</B> http://berg.heim.at/</P>

        <P><B>Anmerkungen:</B><BR>
        Ein faszinierendes Fantasy-Buch mit sehr viel Bezug zur menschlichen
        Realit&auml;t</P>

        <P><B>Empfehlung:</B><BR>
        Wer den Stil und die Ausdrucksweise von Marion Zimmer Bradley liebt, der
        hat in diesem Buch eine wahre Goldgrube gefunden und wird sicher die
        Ruwenda-Serie zu Ende lesen.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a03"></A> 

        <H3>Buchtitel: Liebe Tracey, liebe Mandy<BR>
        Autor: Marsden, John<BR>
        Vorgestellt von: vreni<BR>
        Verlag: Beltz Verlag<BR>
        Erscheinungsjahr: 1995<BR>
        Gesamtseitenzahl: 156<BR>
        ISBN: 3407808305<BR>
        Format: Schwarzschrift</H3>

        <P><B>Inhalt:</B><BR>
        Zuerst ist es nur eine Brieffreundschaft wie viele andere. Mandy und
        Tracey, beide 16, erz&auml;hlen sich von ihrem Alltag: Schule, Jungs,
        Familie. W&auml;hrend Mandy in ganz nnormalen Verh&auml;ltnissen lebt - von
        ihrem gewaltt&auml;tigen Bruder abgesehen - erz&auml;hlt Tracey von ihren
        reichen Eltern, tollen Reisen und zahlreichen Verehrern, so dass Mandy fats
        neidisch wird. Bis sie per Zufall herausfindet, dass Tracey sich das alles
        nur ausgedacht hat. Denn sie sitzt in Garrett, einer der sichersten
        Verwahranstalten Australiens, und in jedem Brief erf&auml;hrt sie mehr
        &uuml;ber ihren Alltag, von dem sie keine Ahnung hatte: Die Schikanen,
        denen Tracey ausgesetzt ist, der Strafdienst, das Essensverbot, das
        Eingesperrtsein. Jetzt zeigt sich, dass die Freundschaft der beiden
        M&auml;dchen tiefer geht, sie ist stark und ehrlich. Als Tracey krank wird
        und auf die Krankenstation kommt, helfen Mandys Briefe ihr aus der Krise
        heraus. Und dann passiert das Unfassbare: Nach &uuml;ber einem Jahr
        intensiven Briefkontakts bekommt Tracey ihre eigenen Briefe eines Tages
        zur&uuml;ck, nachdem sie seit Wochen vergeblich auf Post von Mandy wartet.
        Tracey ahnt nichts Gutes ...</P>

        <P><B>Anmerkungen:</B></P>

        <P><B>Empfehlung:</B></P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a04"></A> 

        <H3>Buchtitel: Ruhe in Fetzen<BR>
        Autor: Brown, Rita Mae &amp; Sneaky Pie<BR>
        Vorgestellt von: Karin<BR>
        Verlag: Rowohlt Taschenbuch Verlag<BR>
        Erscheinungsjahr: 1994<BR>
        Gesamtseitenzahl: 328<BR>
        ISBN: 3499264110<BR>
        Format: digital</H3>

        <P><B>Inhalt:</B><BR>
        Klappentext:<BR> Eine abgehackte Hand im Geb&uuml;sch. Die Tigerkatze Mrs.
        Murphy und ihre Hundefreundin Tee Tucker wittern einen gruseligen Mord. Sie
        mobilisieren s&auml;mtlich Instinkte, viele schnurrige Tricks und eine
        ganze Schar von Freunden, um herauszufinden, was den Menschen in ihrer
        beschr&auml;nkten Wahrnehmungskraft entgeht.</P>

        <P><B>Anmerkungen:</B><BR>
        "Diese Super-Tigerkatze Scneaky Pie Brown ist eine raffinierte Autorin mit
        Vielfach-Talenten: Sie kennt sich einfach aus in der Welt, im Tierischen
        wie im Menschlichen." (ORF)</P>

        <P><B>Empfehlung:</B></P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a05"></A> 

        <H3>Buchtitel: Traumf&auml;nger<BR>
        Autor: Morgan, Marlo<BR>
        Vorgestellt von: Rothaut<BR>
        Verlag: Goldmann<BR>
        Erscheinungsjahr: 1995<BR>
        Gesamtseitenzahl: 251<BR>
        ISBN: 3442306310<BR>
        Format: Digital ASCII</H3>

        <P><B>Inhalt:</B><BR>
        F&uuml;r die Amerikanerin Marlo Morgan beginnt alles ganz harmlos. Eines
        Tages erh&auml;lt sie eine Einladung zu einem Treffen mit einem
        Aboriginee-Stamm. Es ist als eine Auszeichnung f&uuml;r ihre erfolgreiche
        Arbeit in Australien mit jungen Halbblut-Aboriginees gedacht.</P>

        <P>Gespannt macht sie sich f&uuml;r die Einladung zurecht: Ein neues
        Seidenkost&uuml;m, eine dazu passende Seidenbluse und elegante Pumps.</P>

        <P>Wenige Stunden sp&auml;ter, nachdem sie vor ihrem Hotel mit einem Jeep
        abgeholt wird und eine stundenlange Fahrt durch den australischen Busch
        hinter sich hat, wird sie von einer kleinen Gruppe von Menschen eingeladen,
        an einem Walkabout teilzunehmen. Noch nie zuvor wurde einer Wei&szlig;en,
        einer in den Augen der Aboriginees "Ver&auml;nderten" eine solche Ehre
        zuteil.</P>

        <P>Marlo Morgan lernt in den n&auml;chsten Monaten die Unwichtigkeit des
        Zeitbegriffes kennen, ern&auml;hrt sich von Maden, Krokodilen, N&uuml;ssen,
        Kr&auml;utern, Fr&uuml;chten und h&auml;tte niemals geglaubt, da&szlig; sie
        gebratene Ameisen als Delikatesse sch&auml;tzen lernt. Sie wird in das erd-
        und naturverbundene Leben der Aboriginees eingeweiht und erkennt, da&szlig;
        es hier Menschen gibt, die die Erde nicht ausbeuten, die in der Lage sind,
        sich telepathisch zu unterhalten und &uuml;ber medizinische Kenntnisse
        verf&uuml;gen, die uns staunen lassen.</P>

        <P>"Traumf&auml;nger" ist ein faszinierendes und f&uuml;r uns
        "Ver&auml;nderte" oft ein besch&auml;mendes Buch. Zeigen uns die
        Aboriginees doch, wie unwichtig unser Alltag f&uuml;r unser
        pers&ouml;nliches Wachsen und Reifen ist. So feiern sie keinen Geburtstag,
        sondern sie feiern dann ein Fest, wenn einer von ihnen denkt, da&szlig; er
        eine h&ouml;here Stufe in seiner pers&ouml;nlichen Entwicklung erklommen
        hat.</P>

        <P><B>Quelle:</B><BR>
        http://www.leser-service.de/</P>

        <P><B>Anmerkungen:</B><BR>
        Die Inhaltsangabe dieses Buches klingt sehr ansprechend, leider ist das
        Buch selber nicht von der Toleranz und dem tiefen Verst&auml;ndnis f&uuml;r
        die Eingeborenen Australiens gepr&auml;gt, wie es die Inhaltsangabe glauben
        machen m&ouml;chte.</P>

        <P><B>Empfehlung:</B><BR>
        Ich kann dieses Buch deshalb nicht empfehlen, weil es mir irgendwie
        unehrlich und doch von Selbstgerechtigkeit der Autorin &uuml;berschattet
        erscheint, wenn sie das auch noch so toll zu verschleiern versucht.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a06"></A> 

        <H3>Buchtitel: Virus im Netz<BR>
        Autor: Brown, Rita Mae &amp; Sneaky Pie<BR>
        Vorgestellt von: Karin<BR>
        Verlag: Rowohlt Taschenbuch Verlag<BR>
        Erscheinungsjahr: 1997<BR>
        Gesamtseitenzahl: 281<BR>
        ISBN: 3499264099<BR>
        Format: digital</H3>

        <P><B>Inhalt:</B><BR>
        Klappentext:<BR>
        Ein durchreisender Hell's Angel und der Bankdirektor von Crozet kommen
        ziemlich unsanft zu Tode, w&auml;hrend ein Computervirus die Netze der
        Stadt bef&auml;llt. H&ouml;chste Zeit f&uuml;r die Schn&uuml;fflerkatze
        Mrs. Murphy und ihre Helferin, die Corgi-H&uuml;ndin Tee Tucker, wieder
        einmal ihren Spr&uuml;sinn unter Beweis zu stellen. Bis in San Francisco
        verruchtestete Bars f&uuml;hrt sie ihre Jagd ...</P>

        <P><B>Anmerkungen:</B></P>

        <P><B>Empfehlung:</B></P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a07"></A> 

        <H3>Buchtitel: Die Papierverschw&ouml;rung<BR>
        Autor: Liss, David<BR>
        Vorgestellt von: nathalie<BR>
        Verlag: BTB-Verlag M&uuml;nchen<BR>
        Erscheinungsjahr: 2001<BR>
        Gesamtseitenzahl: 340<BR>
        ISBN: 3442730686<BR>
        Format: H&ouml;rbuch DZB BNA 7869</H3>

        <P><B>Inhalt:</B><BR>
        London 1720. Erster B&ouml;rsencrash am Finanzmarkt des englischen
        Handelsimperiums. Aktienhandel, Staatsanleihen und Lotterien waren neu und
        erzeugten Spannungen und Innovationen an der B&ouml;rse. Die
        Finanzm&auml;rkte bescherten &uuml;ber Nacht schwindelerregende Gewinne
        oder hoffnungslose Verluste und materiellen Untergang.</P>

        <P>Der Romanheld, "verlorener Sohn" einer wohlhabenden j&uuml;dischen
        Kaufmannsfamilie, ehemals prominenter Boxer und jetzt Detektiv auf eigene
        Faust, will den unaufgekl&auml;rten Mord an seinem Vater, einem
        raffinierten Spekulanten, r&auml;chen. Dabei verstrickt er sich in Kreise
        kaltbl&uuml;tiger B&ouml;rsenhaie, die in der Hochgesellschaft als galante
        Sauberm&auml;nner auftreten, und durchschaut nur schwer deren Intrigen. Er
        ger&auml;t in den Sumpf der Londoner Unterwelt zwischen Huren und
        Zuh&auml;ltern und kollidiert gef&auml;hrlich mit den Interessen des
        "ersten Verbrecherk&ouml;nigs" Londons.</P>

        <P>Es ist ein buntes, erregendes Sittengem&auml;lde des beginnenden 18.
        Jahrhunderts mit differenziertem historischem Colourit und Details
        atemberaubender Spannung. Dazu der Autor selbst: "Die Zielsetzung des
        Romans bestand darin, sowohl den ungez&uuml;gelten Enthusiasmus als auch
        die &uuml;berall sp&uuml;rbare Angst jener Zeit einzufangen, die
        letztendlich zur South Sea bubble f&uuml;hrten." (gemeint ist der
        B&ouml;rsencrash an der South Sea Company)</P>

        <P><B>Anmerkungen:</B><BR>
        Wer historische Romane mag, Gefallen an der damaligen blumig gespreizten
        Sprache von Adel und Neureichen findet, wer Mode und Lebensstil des
        Sp&auml;tbarock und Rokoko kennen lernen m&ouml;chte, aber auch nicht die
        Augen verschlie&szlig;t vor den Schattenseiten sozialen Elends und
        deklassierten Ganoventums, der kommt durch David Liss' Gesellschaftsroman
        voll auf seine Kosten.</P>

        <P><B>Empfehlung:</B></P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a08"></A> 

        <H3>Buchtitel: Floraliebling<BR>
        Autor: Chidolue, Dagmar<BR>
        Vorgestellt von: nicht online<BR>
        Verlag: Beltz &amp; Gelberg<BR>
        Erscheinungsjahr: 1992<BR>
        Gesamtseitenzahl: 192<BR>
        ISBN: 340779601<BR>
        Format: Schwarzschrift</H3>

        <P><B>Inhalt:</B><BR>
        Dieses Buch handelt von der 13j&auml;hrigen Flora. Einer ihrer Feinde ist
        ihr Englischlehrer. Als dieser zu Beginn der Geschichte wieder einen Witz
        &uuml;ber sie rei&szlig;t, reicht es ihr! Sp&auml;ter kommt sie auf die
        Idee, ihm einen harmlosen Streich zu spielen, was sie dann auch tut. Doch
        dann nimmt die Geschichte eine unvorhergesehene Wendung ...</P>

        <P><B>Anmerkungen:</B><BR>
        F&uuml;r alle, die Blindenschrift lesen: Dieses Buch ist als
        Punktschriftausgabe in der DZB Leipzig erschienen.</P>

        <P><B>Empfehlung:</B></P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a09"></A> 

        <H3>Buchtitel: Geheimnis im Moor<BR>
        Autor: Howatch, Susan<BR>
        Vorgestellt von: Rothaut<BR>
        Verlag: Goldmann<BR>
        Erscheinungsjahr: 1996<BR>
        Gesamtseitenzahl: 412<BR>
        ISBN: 3442131588<BR>
        Format: Digital ANSI</H3>

        <P><B>Inhalt:</B><BR>
        Mit 17 Jahren verliert die junge Engl&auml;nderin pl&ouml;tzlich beide
        Eltern. Da sie einer unehelichen Verbindung eines adeligen und einer
        eingewanderten Franz&ouml;sin entstammt, sind die Zukunftschancen f&uuml;r
        sie und ihren Zwillingsbruder nicht sehr rosig. So nimmt sie das Angebot
        eines etwas &auml;lteren Engl&auml;nders an, seine Frau zu werden, der
        damit die Voraussetzungen schafft, sein v&auml;terliches Erbe antreten zu
        d&uuml;rfen.</P>

        <P>F&uuml;r das M&auml;dchen beginnt nun ein Leben voller Schrecken,
        Abenteuer und Ungewissheiten.</P>

        <P><B>Anmerkungen:</B><BR>
        Ich finde, das Buch ist sehr spannend und anschaulich geschrieben, es gibt
        die Geheimnis umwitterte, d&uuml;stere Atmosph&auml;re der englischen
        Moorlandschaft gut wieder.</P>

        <P><B>Empfehlung:</B><BR>
        Ich w&uuml;rde das Buch sofort nochmal lesen, wie eigentlich alle
        B&uuml;cher dieser Autorin f&uuml;r Spannung und gehobene Unterhaltung
        garantieren.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a10"></A> 

        <H3>Buchtitel: An den Feuern von Hastur<BR>
        Autor: Zimmer Bradley, Marion; Lackey, Mercedes<BR>
        Vorgestellt von: Rothaut<BR>
        Verlag: Hestia, Bayreuth<BR>
        Erscheinungsjahr: 1994<BR>
        Gesamtseitenzahl: 336<BR>
        ISBN: 3894570490<BR>
        Format: Digital ANSI</H3>

        <P><B>Inhalt:</B><BR>
        Zwei Kulturen treffen auf dem Planeten Darkover aufeinander, die
        voneinander Jahrtausende lang nicht wissen, dass sie ein und denselben
        Ursprung haben.</P>

        <P>Auf der einen Seite steht die technische Perfektion der Terraner, auf
        der anderen die telepathischen F&auml;higkeiten der Planetenbewohner und
        ihre Verbundenheit mit der Natur.</P>

        <P><B>Anmerkungen:</B><BR>
        Die Abenteuer, die die beiden so verschieden gearteten Menschen miteinander
        erleben, sind sowohl voller Spannung wie auch menschlich ber&uuml;hrend,
        manchmal sogar ersch&uuml;tternd.</P>

        <P><B>Empfehlung:</B><BR>
        Wer Fantasy-Romane mag, ist bei Marion Zimmer Bradleys Romanen immer gut
        aufgehoben.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a11"></A> 

        <H3>Buchtitel: Sternenflut<BR>
        Autor: Brin, David<BR>
        Vorgestellt von: bianka<BR>
        Verlag: Heyne<BR>
        Erscheinungsjahr: 2000<BR>
        Gesamtseitenzahl: 634<BR>
        ISBN: 3453164164<BR>
        Format: Schwarzschrift</H3>

        <P><B>Inhalt:</B><BR>
        Die Streaker, ein Raumschiff, auf dem alle intelligenten rassen der Erde -
        Menschen, Delphine und Schimpansen -arbeiten, hat eine Entdeckung gemacht,
        die die Bewohner der Galaxien in Aufruhr versetzt. Jetzt ist die Streaker
        auf einem verlassenen Planeten gestrandet und versucht der Verfolgung durch
        die galaktischen Kriegsheere zu entkommen.</P>

        <P>Doch die Bedrohung komt nicht nur von au&szlig;en. Denn die gemischte
        Zusammensetzung der Besatzung aus Menschen - der Patronatsrasse - und ihren
        Klienten (Delphinen und schimpansen, die durch Genmanipulation (Lifting)
        Sprechen und logisches Denken gelernt haben, birgt auch einigen
        Z&uuml;ndstof in sich.</P>

        <P><B>Anmerkungen:</B><BR>
        Ich bin kein SF-Fan, aber dieses Buch hat mich beeindruckt. Nicht nur durch
        die schillernden au&szlig;erirdischen Wesen und die Beschreibung der
        seltsamen Planetenwelt. Besonders beeindruckt hat mich die Phantasie des
        Autors, mit der er ein Bild dessen malt, was passieren k&ouml;nnte, wenn
        die Menschen es schaffen, Tieren menschliche Intelligenz einzuhauchen.</P>

        <P>Die Sprache der Delphine, die sich vorzugsweise der Haiku-Form bedienen,
        ist einfach nur herrlich skurril...</P>

        <P><B>Empfehlung:</B><BR>
        Ich kann dieses Buch jedem empfehlen, der gerne Science-Fictions liest, in
        denen es um mehr als coole Technik und galaktische Kriege geht. Auch
        f&uuml;r Nicht-Science-fiction-Fans ist es ein Einstieg, da man sich nicht
        wirklich mit Technik und Raumfahrt auskennen muss, um an diesem Buch
        gefallen zu finden.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a12"></A> 

        <H3>Buchtitel: Phantastische Tierwesen und ...<BR>
        Autor: Scamander, Newt<BR>
        Vorgestellt von: nathalie<BR>
        Verlag: Carlsen / Obscurus Books<BR>
        Erscheinungsjahr: 2002<BR>
        Gesamtseitenzahl: 92<BR>
        ISBN: 3-551-55306-8<BR>
        Format: Punktschrift</H3>

        <P><B>Inhalt:</B><BR>
        Der Autor gibt erst eine sehr detaillierte und aufschlussreiche
        Einf&uuml;hrung in das Thema der Differenzierung zwischen Tier- und
        Zauberwesen, in die Gegebenheiten des Zaubereiministeriums und vieles
        weitere. Daran schlie&szlig;t sich eine sehr umfangreiche Auflistung
        verschiedenster Tierwesen an, die von der Acromantula &uuml;ber den Niffler
        bis hin zum Zentauren geht.</P>

        <P><B>Anmerkungen:</B><BR>
        Dieses Schulbuch von Harry Potter ist eine weitere hervorragende
        Freizeitlekt&uuml;re.</P>

        <P>Wer nicht wei&szlig;, was ein Niffler ist, der kann hier sehr schnell
        sein Wissen erweitern. Auch bestehende Kenntnisse k&ouml;nnen hier
        erweitert werden! :-)</P>

        <P><B>Empfehlung:</B><BR>
        Ich kann dieses Buch nur jedem empfehlen, der nicht unbedingt etwas
        Tiefergreifendes lesen will, sondern sich komplett auf eine Reise in Harrys
        Welt der Zauberer einlassen m&ouml;chte.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a13"></A> 

        <H3>Buchtitel: Quidditch im Wandel der Zeiten<BR>
        Autor: Whisp, Kennilworthy<BR>
        Vorgestellt von: nathalie<BR>
        Verlag: Carlsen / Whizz Hard Books<BR>
        Erscheinungsjahr: 2002<BR>
        Gesamtseitenzahl: 68<BR>
        ISBN: 3-551-55307-6<BR>
        Format: Punktschrift, DZB Leipzig</H3>

        <P><B>Inhalt:</B><BR>
        Dieses Buch ist eine sehr gute historische Zusammenfassung und
        Erkl&auml;rung des allseits beliebten Zauberer-Spieles Quidditch.</P>

        <P>Kennilworthy Whisp versteht es, die Entwicklung des Spieles vom
        Mittelalter bis in die Gegenwart detailliert wiederzugeben. Dabei spickt er
        seine Erkl&auml;rungen mit Anekdoten und &Uuml;berlieferungen, die dieses
        an sich doch "trockene" Sachbuch &uuml;beraus interessant und unterhaltsam
        machen.</P>

        <P><B>Anmerkungen:</B><BR>
        Die Punktschriftausgabe ist dem Schwarzschrift-Original 1:1 nachempfunden.
        Handschriftliche Anmerkungen aus der Schwarzschriftausgabe sind auch in
        Punktschrift &uuml;bertragen und in den Text eingef&uuml;gt worden.</P>

        <P>Dieses Buch lese ich zwischendurch immer wieder gern!</P>

        <P><B>Empfehlung:</B><BR>
        Wer sich ein bisschen f&uuml;r Harry Potter &uuml;ber die eigentlichen
        B&uuml;cher hinaus interessiert, f&uuml;r den sind seine Schulb&uuml;cher
        eine hervorragende Lekt&uuml;re.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a14"></A> 

        <H3>Buchtitel: Vom Winde verweht<BR>
        Autor: Mitchell, Margaret<BR>
        Vorgestellt von: bianka<BR>
        Verlag: Ullstein Taschenbuch<BR>
        Erscheinungsjahr: 2000<BR>
        Gesamtseitenzahl: 1119<BR>
        ISBN: 354824968X<BR>
        Format: digital bei Project Gutenberg Australia</H3>

        <P><B>Inhalt:</B><BR>
        Scarlett O'Hara sieht gut aus, ist stolz, reich und verw&ouml;hnt.
        Au&szlig;erdem scheint in ihrem Leben das erste Mal nicht alles so zu
        laufen, wie sie es sich w&uuml;nscht, da ihr Traummann ihr nicht gleich zu
        F&uuml;&szlig;en liegt. Um ihn zu &auml;rgern, heiratet sie einen anderen.
        Doch dann macht ihr der amerikanische B&uuml;rgerkrieg einen Strich durch
        viele Rechnungen ihres Lebens. Nichts ist mehr, wie es war, und das
        einzige, was zu z&auml;hlen scheint, ist Geld. Doch ist das wirklich
        so?</P>

        <P><B>Anmerkungen:</B><BR>
        Man erf&auml;hrt sehr viel &uuml;ber den B&uuml;rgerkrieg und die
        Mentalit&auml;t der Menschen in den amerikanischen S&uuml;dstaaten und
        &uuml;ber das Frauenbild der damaligen Zeit. Dieses Buch ist weitaus mehr
        als eine tragische Liebesgeschichte.</P>

        <P><B>Empfehlung:</B><BR>
        Ich empfehle es jedem, der die wei&szlig;en S&uuml;dstaatler im
        B&uuml;rgerkrieg und die damaligen gesellschaftlichen Strukturen verstehen
        will.</P>
        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>
        <A name="a15"></A>
        <H3>Buchtitel: Per Anhalter durch die Galaxis <BR>
        Autor: Adams, Douglas <BR>
        Vorgestellt von: Rothaut <BR>  
        Verlag: Ullstein <BR>
        Erscheinungsjahr: 1982 <BR>    
        Gesamtseitenzahl: 215 <BR>
        ISBN: 3453146972 <BR>          
        Format: Digital Ansi </H3>

        <P><B>Inhalt: </B><BR>
        [Zitat Buchanfang:] <BR>
        Weit drau&szlig;en in den unerforschten Ein&ouml;den eines total aus der Mode
        gekommenen Ausl&auml;ufers des westlichen Spiralarms der Galaxis leuchtet
        unbeachtet eine kleine gelbe Sonne. Um sie kreist in einer Entfernung von
        ungef&auml;hr achtundneunzig Millionen Meilen ein absolut unbedeutender, kleiner
        blaugr&uuml;ner Planet, dessen vom Affen stammende Bioformen so erstaunlich
        primitiv sind, da&szlig; sie Digitaluhren noch immer f&uuml;r eine unwahrscheinlich
        tolle Erfindung halten. </P>

        <P>Dieser Planet hat - oder besser gesagt, hatte - ein Problem: <BR>
        die meisten seiner Bewohner waren fast immer ungl&uuml;cklich.</P>

        <P>Zur L&ouml;sung dieses Problems wurden viele Vorschl&auml;ge gemacht, aber die
        drehten sich meistens um das Hin und Her kleiner bedruckter
        Papierscheinchen, und das ist einfach drollig, weil es im gro&szlig;en und ganzen
        ja nicht die kleinen bedruckten Papierscheinchen waren, die sich
        ungl&uuml;cklich f&uuml;hlten. <BR>

        [Zitat Ende] </P>

        <P><B>Inhalt: </B><BR>
        Nichts ahnend wacht der Engl&auml;nder Arthur Dent eines Donnerstag Morgens auf
        und wird mit der Tatsache konfrontiert, dass sein Haus abgerissen werden
        soll, weil auf seinem Grundst&uuml;ck eine Umgehungsstra&szlig;e gebaut werden soll. </P>

        <P>Einige Stunden sp&auml;ter aber erf&auml;hrt er, dass genau dasselbe mit dem gesamten
        Planeten Erde geplant ist, dass fremde Wesen aus dem Weltall, Vogonen
        genannt, eine Umgehungsstra&szlig;e durch das All bauen, und so wird der Planet
        Erde einfach ausgel&ouml;scht. Mit Hilfe eines Freundes gelingt es Arthur, sich
        in ein Raumschiff einzuschmuggeln - und so beginnt eine h&ouml;chst interessante
        und abenteuerliche Reise durch das All. </P>

        <P><B>Anmerkungen: </B><BR>
        Das ist der erste Band einer f&uuml;nfteiligen Serie. Er zeugt von sehr viel,
        wenn auch manchmal etwas skurrilem, hintergr&uuml;ndigem Humor, aber auch von
        guter Beobachtungsgabe. So sehr ich auch bei diesem Buch gelacht habe, so
        bewegend sind auch die Gedankeng&auml;nge des Autors, vor allem die Parallelen,
        die er immer wieder zu bestehenden Systemen und Denkweisen zu ziehen
        versteht. </P>

        <P><B>Empfehlung: </B><BR>
        Ich werde auf jeden Fall auch die anderen vier B&auml;nde lesen, bin schon
        gespannt, was sich da alles noch an &Uuml;berraschungen verborgen h&auml;lt. </P>

        <A href="#top">zum Inhaltsverzeichnis</A> 
        <HR>  
        <A name="a16"></A>
        <H3>Buchtitel: Erinnerung an David <BR>
        Autor: Ure, Jean <BR>             
        Vorgestellt von: nathalie <BR>
        Verlag: St. Gabriel M&ouml;dling-Wien / Braille: Paderborn <BR>
        Erscheinungsjahr: 1989 <BR>       
        Gesamtseitenzahl: 298 <BR>
        ISBN: 3852643228 <BR>             
        Format: Punktschrift 2 B&auml;nde gebunden </H3>

        <P><B>Inhalt: </B><BR>
        Die Ich-Erz&auml;hlerin Robyn erz&auml;hlt von ihren Jugendfreunden Abbey, Zoot und
        David. Alle vier besuchen dieselbe Gesamtschule und stammen aber aus v&ouml;llig
        unterschiedlichen Gesellschaftsschichten, was jedoch nicht ihre
        Freundschaft belastet. </P>

        <P>Sie erz&auml;hlt insbesondere von Davids und Abbeys Beziehung, die lange sehr
        gl&uuml;cklich ist. Sie berichtet aber insbesondere von David, dem strahlenden
        Teenager, dem erfolgreichen Sportler und von seinem Vorhaben, nach der
        Schule Medizin zu studieren. Doch dann zerbricht alles, als David sich im
        Sport verletzt und seine Verletzung nicht richtig abheilen will. Als er
        deshalb ins Krankenhaus muss, wird die erschreckende Diagnose gestellt:
        David hat Krebs und wird sein Bein verlieren. Aber noch mehr scheint sich
        mit dieser Diagnose zu verbinden ...  </P>

        <P>Ab diesem Moment l&auml;uft nichts mehr, wie es laufen sollte. Und Robyn schaut
        Jahre sp&auml;ter auf die Ereignisse dieser Zeit zur&uuml;ck ...  </P>

        <P><B>Anmerkungen: </B><BR>
        Ich habe dieses Buch schon mehrere Male gelesen und entdecke immer wieder
        Seiten daran, die mir bislang nicht aufgefallen waren. Dieses Buch ist so
        vielschichtig, dass es sich immer wieder zu lesen lohnt! </P>

        <P><B>Empfehlung: </B><BR>
        Dieses Buch ist nichts f&uuml;r jemanden, der "leichte Kost" sucht. Es ist ein
        sch&ouml;nes Teenie-Buch, allerdings nicht leicht zu verdauen. </P>
        <A href="#top">zum Inhaltsverzeichnis</A>
        <HR>
        <A name="a17"></A>
        <H3>Buchtitel: Theos Reise <BR>
        Autor: Clement, Catherine <BR>    
        Vorgestellt von: nathalie <BR>
        Verlag: Hanser <BR>               
        Erscheinungsjahr: 2003 <BR>
        Gesamtseitenzahl: 715 <BR>        
        ISBN: 3446203427 <BR>             
        Format: Schwarzschrift </H3>

        <P><B>Inhalt: </B><BR>
        Theo ist ein f&uuml;r sein Alter ungew&ouml;hnlicher Junge, der sich mit vierzehn
        Jahren nur f&uuml;r Geschichte und Arch&auml;ologie interessiert. Er ist ein st&auml;ndig
        kr&auml;nkelnder Junge. Das einzige, was an ihm nicht ungew&ouml;hnlich ist, ist
        seine Freundin - ein M&auml;dchen afrikanischer Herkunft mitten in Frankreich. </P>

        <P>Eines Morgens krempelt sich das Leben von Theo, seiner Familie und seiner
        Freundin komplett um, als er nach dem Aufstehen einen totalen
        Kreislaufkollaps erleideet und daraufhin etliche Untersuchungen im
        Krankenhaus &uuml;ber sich ergehen lassen muss; mit einer schrecklichen
        Diagnose! </P>

        <P>Seine Tante nimmt ihn daraufhin auf eine Weltreise mit, die die beiden zu
        allen relevanten Religionen und Glaubenssystemen der Welt f&uuml;hrt. F&uuml;r Theo
        wird es auch zu einer Reise zu sich selbst, da er Dinge erf&auml;hrt, die ihm
        bis dahin verborgen waren ... </P>

        <P><B>Anmerkungen: </B><BR>
        Catherine Clement hat mit diesem Buch eine Reise durch die Religionen, ihre
        Grundlagen und vieles Dazugeh&ouml;rige hervorgebracht. Man lernt hier &uuml;ber die
        eigene Religion noch sehr viel, man lernt Toleranz und Verst&auml;ndnis f&uuml;r
        vermeintlich Andersgl&auml;ubige aufzubringen. </P>

        <P><B>Empfehlung: </B><BR>
        Dieses Buch hat mich, als ich es zuerst als H&ouml;rspiel h&ouml;rte, ungemein
        beeindruckt. Und als ich es dann noch als Buch geh&ouml;rt habe, war ich restlos
        begeistert. Die F&uuml;lle der Seiten merkt man gar nicht und wird gefesselt von
        den geschichtlichen und religi&ouml;sen Einblicken. </P>
        <A href="#top">zum Inhaltsverzeichnis</A>
        <HR>
        <!-- <A name="a18"></A>
        <H3></H3>
        <P></P>
        <A href="#top">zum Inhaltsverzeichnis</A>
        <HR> //-->
          
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

