<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <!-- Author = Nadine Alexander -->

    <TITLE>Das Haar - Teil 1</TITLE>
  </HEAD>

  <BODY background="images/bgb.gif" text="#000000" bgcolor=
  "#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Das
          Haar - Teil 1</B></FONT></P>

          <P>Drau&szlig;en war es bereits dunkel, als sie sich
          neben Marc ins Bett legte. Sie hatte eine gute Stunde in
          der hei&szlig;en Wanne verbracht, bis sie sich m&uuml;de
          genug und kurz vor der k&ouml;rperlichen Aufl&ouml;sung
          f&uuml;hlte und rollte sich jetzt in ihre Decke ein. Von
          Marc kam kein Ton, er drehte sich nicht einmal nach ihr
          um, kein "Gute Nacht, Liebling", keine Umarmung oder
          Derartiges, die Zeiten waren schon eine Weile vorbei.</P>

          <P>Es st&ouml;rte sie nicht. Sie hatte vor L&auml;ngerem
          schon angefangen, sich damit abzufinden.</P>

          <P>Wohlig in ihre Decke eingekuschelt drehte sie sich ein
          letztes Mal herum, um auf die Uhr auf dem Nachttischchen
          zu sehen und verharrte. Ihre Augen wurden ein wenig
          gr&ouml;&szlig;er, sonst lie&szlig; sie sich nichts
          anmerken. Und vor wem auch? F&uuml;r den Mann, der da
          neben ihr lag, war sie schon seit L&auml;ngerem Luft,
          zumindest, was die angenehmeren Dinge anging.</P>

          <P>Sie hatte beim Hinlegen ihr Federkissen
          zusammengeknufft, wie sie es immer tat und ihr Kopf ruhte
          nun in einer Mulde. Und da, auf dem Kissen zwischen ihr
          und dem Nachttisch sah sie es.</P>

          <P>Es war nicht viel. Nur ein Haar, ein langes schwarzes
          gl&auml;nzendes Haar. Zu lang, um das von Marc zu sein,
          seine Haare erreichten vielleicht mit M&uuml;h und Not
          f&uuml;nf Millimeter L&auml;nge, und zu schwarz, um ihres
          zu sein.</P>

          <P>Ein langes schwarzes Haar, das weder Marc noch ihr
          geh&ouml;rte. Und wenn sie schon ein Haar auf ihrem
          Kissen fand, sollte es doch von ihr oder Marc sein? Helen
          r&uuml;hrte sich noch immer nicht. Dieses lange
          gl&auml;nzende Haar lag dort, schien sich auf ihrem
          Kissen vergn&uuml;gt im Schein der Nachttischlampe zu
          r&auml;keln, wie eine Katze im Sonnenlicht.</P>

          <P>"Ja, ja", schien es zu sagen. "Hier liege ich, auf
          deinem Kissen, in deinem Schlafzimmer, und das schon seit
          Stunden. Ich hab schon hier gelegen, als du noch arbeiten
          warst. Und wei&szlig;t du was? Es schert mich gar nicht,
          dass ich nicht mal hierher geh&ouml;re, im Gegenteil, das
          macht es doch nur noch witziger, oder?"</P>

          <P>Helen betrachtete das Haar weiter. Es gl&auml;nzte
          kr&auml;ftig und gesund im warmen gelben Schein der
          Lampe.</P>

          <P>"Mit welchem Shampoo bist du gewaschen worden? Das
          muss ich mir unbedingt kaufen", dachte sie und hatte
          M&uuml;he, ein hysterisches Kichern zu
          unterdr&uuml;cken.</P>

          <P>Dann setzte die Hektik in ihren Gedanken ein und sie
          suchte nach Erkl&auml;rungen, wie sie es immer getan und
          auch meistens geschafft hatte. Oh ja, sie war gut darin
          geworden, das Offensichtliche zu &uuml;bersehen, und wenn
          sie es nicht &uuml;bersehen konnte, gelang es ihr doch
          immer noch, es zu verdr&auml;ngen. Der menschliche
          Verstand war etwas Bemerkenswertes. Er war die tiefste
          Grube, in der man alles verscharren konnte, wenn man sich
          nur anstrengte, zumindest f&uuml;r eine gewisse Zeit.</P>

          <P>Becca, das musste es sein. Sie dachte an ihre
          Kollegin, ein notwendiges &Uuml;bel von vielen im
          B&uuml;ro, eine Frau, die so aufgesetzt wirkte, als
          spiele sie 24 Stunden am Tag in einer schlechten
          Seifenoper die Hauptrolle.</P>

          <P>Morgens pflegte sie stets mit widerlich guter Laune
          eine halbe Stunde zu sp&auml;t aufzutauchen,
          eingeh&uuml;llt in den Duft von Kostmetika, sie schien
          sich morgens alles angedeihen zu lassen, was auch nur im
          Entferntesten einen Anflug von Parfumstoffen hatte,, dem
          dezenten Duft von Mentholzigaretten und Kaffee, dann auf
          ihre "Lieblingskollegin" zuzuschweben, die sie vermutlich
          nicht weniger verachtete, als es bei Helen umgekehrt der
          Fall war und sie in eine herzliche Umarmung zu zerren,
          ohne R&uuml;cksicht auf Verluste.</P>

          <P>K&uuml;sschen links und K&uuml;sschen rechts und
          f&uuml;r Rebecca konnte der Tag losgehen, der auch
          weiterhin immer voll mit solchen Umarmungen,
          hochgezogenem Gel&auml;chter und "K&uuml;sschen Links und
          K&uuml;sschen rechts" sein w&uuml;rde.</P>

          <P>Und sie dachte an Beccas wirklich neiderregend langes
          schwarzes und kr&auml;ftiges Haar. Sicher hatte sie sich
          von ihr bei einer dieser Filmumarmungen so ein Haar
          zur&uuml;ckbehalten und es selbst mit ins Bett
          gebracht.</P>

          <P>"Aber du warst baden, oder?", bemerkte eine kleine
          aber un&uuml;berh&ouml;rbar geh&auml;ssige Stimme in
          ihrem Hinterkopf. "Du hast dir sogar die Haare gewaschen,
          da ist nichts an dir h&auml;ngen geblieben."</P>

          <P>Helen brachte die verr&auml;terische Stimme in ihrem
          Kopf zum schweigen, oder versuchte es zumindest.</P>

          <P>Sie hob den Finger und schnippte dieses fremde Haar,
          dieses kleine Indiz f&uuml;r etwas, was sie schon
          l&auml;ngst wusste vom Kissen.</P>

          <P>"Ach ja, und Becca ist heute zwei Stunden fr&uuml;her
          nach Hause gegangen, nicht wahr?"</P>

          <P>Wieder diese kleine b&ouml;se Stimme, die Helen nicht
          h&ouml;ren wollte. Sie war ihr nicht neu und klang ein
          wenig wie die ihrer besten Freundin in der High School,
          die selbstbewusste, rationale und immer etwas laute
          Carol.</P>

          <P>Neben Carol war Helen immer fast untergegangen, die
          kleine, stille und zerbrechlich wirkende rothaarige, die
          nur sprach, wenn es wirklich sein musste und fast nie von
          selbst. Hinter Carol hatte sie sich immer verstecken
          k&ouml;nnen, wenn das komplizierte Leben eines Teenagers
          sie verwirrte, Carol wusste immer, wie die Dinge zu
          regeln waren, und das, weil sie wohl damals schon immer
          alles rationaler, logischer gesehen hatte als Helen. Und
          diese rationale Carol h&auml;tte sie jetzt auch mit der
          Nase auf all das gesto&szlig;en.</P>

          <P>Sie dachte einige Wochen zur&uuml;ck, ja es musste im
          M&auml;rz gewesen sein, als Marc sie einmal von der
          Arbeit abgeholt hatte. Helen war Tage sp&auml;ter noch
          das Gesp&ouml;tt ihrer Kolleginnen gewesen, da sich ihr
          Mann doch so unverhohlen nach fremden R&ouml;cken umsah
          und nicht mal im Entferntesten Interessiert wirkte, ob
          Helen es sah oder nicht.</P>

          <P>Und sie erinnerte sich, eine Stunde zu sp&auml;t von
          der Arbeit losgekommen zu sein, weil Marc damit
          besch&auml;ftigt gewesen war, um das bisschen Stoff herum
          zu luken, mit dem Becca ihre Haut bedeckte, und Becca
          damit, sich in seinem unverhohlenen Interesse zu drehen
          und zu wenden, als w&auml;re es ein Scheinwerfer.</P>

          <P>Es war doch so klar, so eindeutig. Doch sie w&uuml;rde
          ihn nicht darauf ansprechen, nicht wahr? Sie w&uuml;rde
          schweigen, wie sie es seit langem tat.</P>

          <P>Helen dachte an einen Tag vor gut sieben Jahren
          zur&uuml;ck. Sie und Marc waren damals ein Jahr
          verheiratet gewesen, frisch in das kleine H&auml;uschen
          hier eingezogen, hatten sich notd&uuml;rftig eingerichtet
          und in diesen Monaten bis zum Umfallen gearbeitet, da die
          Ausgaben doch h&ouml;her waren, als sie beide sich nur
          h&auml;tten tr&auml;umen lassen.</P>

          <P>Helen war wieder sp&auml;ter nach Haus gekommen,
          m&uuml;de, zerschlagen und einfach nur noch von dem
          Gedanken an einen hei&szlig;en Tee und eine fast eben so
          hei&szlig;e Wanne auf den F&uuml;&szlig;en gehalten. Sie
          war ins Wohnzimmer gegangen, um nach Marc zu sehen, der
          ein wenig zerzaust auf der Couch sa&szlig; und eine
          Nachrichtensendung schaute. Zumindest lief die Sendung,
          aber Marc schien in seinen eigenen inneren Film
          vertieft.</P>

          <P>Sie trat auf ihn zu und wollte ihn an der Schulter
          ber&uuml;hren, als ihr Blick auf etwas gl&auml;nzendes am
          Boden fiel. Ein wenig &auml;rgerlich &uuml;ber sich
          selbst, denn was sollte es sonst sein, wenn nicht ein
          Schmuckst&uuml;ck von ihr, dass sie hier verloren hatte,
          b&uuml;ckte sie sich, um es aufzuheben und runzelte
          verwirrt die Stirn.</P>

          <P>Das war sicher nicht ihr Ohrring. Sie hatte gerade den
          Mund ge&ouml;ffnet, um etwas zu sagen, als Marc
          pl&ouml;tzlich aufsah.</P>

          <P>"Ach hallo, Liebling..."</P>

          <P>Er sprach nicht weiter, als er sah, was in ihrer Hand
          lag und auch Helen schwieg f&uuml;r einen Moment. Dann
          sch&uuml;ttelte sie den Kopf, holte erneut Luft und
          meinte nur: "Wei&szlig;t du, wem der geh&ouml;rt?", und
          hielt ihm den Ohrring hin.</P>

          <P>"Nein, keine Ahnung", antwortete er, aber sie las die
          wirkliche Antwort in seinen Augen. Er wusste es, und dass
          sie den Ohrring nun in der Hand hielt, hatte ihm einen
          geh&ouml;rigen Schrecken eingejagt.</P>

          <P>Sie konnte sp&auml;ter nie sagen, warum sie in dem
          Moment geschwiegen hatte, geschwiegen, den Ohrring
          einfach auf den Couchtisch gelegt und das Wohnzimmer
          verlassen hatte.</P>

          <P>Die n&auml;chsten Tage war eine Eiszeit zwischen ihnen
          angebrochen, die eindeutig von Helen ausging. Nicht, weil
          sie w&uuml;tend gewesen w&auml;re und ihn als Strafe
          ignorierte, sondern weil sie sich gedanklich damit
          besch&auml;ftigte, wie sie ihren Fund erkl&auml;ren und
          vor allem verdr&auml;ngen konnte.</P>

          <P>An dem Tag war sie fr&uuml;her zu Hause gewesen und
          hatte sich entschlossen, ein &Uuml;berraschungsessen
          f&uuml;r Marc zu kochen. &Uuml;ber ein Buch mit
          Kochrezepten gebeugt &uuml;berlegte sie gerade, was es
          werden w&uuml;rde, als das Telefon klingelte. Sie
          lie&szlig; das Telefon klingeln und wartete, bis der
          Anrufbeantworter ansprang. Wenn es Marc oder sonst jemand
          war, der etwas wichtiges wollte, konnte sie sich immer
          noch...</P>

          <P>"Hallo S&uuml;&szlig;er." Die s&auml;uselnde Stimme
          auf dem Anrufbeantworter unterbrach ihren Gedankengang so
          pl&ouml;tzlich, als h&auml;tte jemand einen Schalter in
          ihrem Kopf umgelegt.</P>

          <P>"Ich habe letzte Woche meinen Ohrring bei dir
          verloren. K&ouml;nntest du ihn mir das n&auml;chste Mal
          mitbringen? Der war doch recht teuer und ich h&auml;tte
          ihn gern zur&uuml;ck, wenn du ihn findest. Ich verspreche
          dir daf&uuml;r auch eine Belohnung, Tiger."</P>

          <P>Nachdem sie diese letzten Worte in den H&ouml;rer
          geschnurrt hatte, legte Miss Ohrring wieder auf, der
          Anrufbeantworter piepste und es kehrte wieder Stille ein.
          Eine Stille, wie sie Helen sich nicht lauter h&auml;tte
          vorstellen k&ouml;nnen.</P>

          <P>Sie f&uuml;hlte sich, als h&auml;tte ihr jemand kaltes
          Wasser &uuml;ber den Kopf gegossen und ihr Herz schien
          vergessen zu haben, wie es schlagen sollte, und als es
          sich wieder daran erinnerte, h&auml;mmerte es so laut und
          schwer, dass sie meinte, den Schlag bis in die Zehen und
          Finger zu f&uuml;hlen.</P>

          <P>Alles Verdr&auml;ngen hatte nichts geholfen. Das
          Schicksal war wohl perfide genug, ihr die Dinge noch mal
          deutlichst vor Augen zu f&uuml;hren, die sie so
          sorgf&auml;ltig zur Seite zu schieben gedacht hatte.
          Vielleicht w&auml;re wieder alles anders gekommen,
          h&auml;tte Marc in diesem Moment nicht die T&uuml;r
          aufgeschlossen. Sie schoss von ihrem Stuhl hoch, fuhr
          herum und war mit ein paar schnellen Schritten im Flur.
          Sie starrte ihn an und war einen Moment unf&auml;hig,
          etwas zu sagen, hob schlie&szlig;lich nur die Hand und
          deutete mit einem zitternden Finger ins Wohnzimmer.</P>

          <P>"Was ist?" Seine Stimme klang nicht, als ob es ihn
          interessieren w&uuml;rde, aber das bemerkte sie in diesem
          Moment nicht.</P>

          <P>"Anrufbeantworter", war das Einzige, das sie
          hervorbrachte und erschrak vor ihrer eigenen tonlosen und
          rauen Stimme.</P>

          <P>Er ging ins Wohnzimmer um den Anrufbeantworter
          abzuh&ouml;ren und Helen w&uuml;nschte sich einen Moment,
          sich die Ohren zuhalten zu k&ouml;nnen, um das nicht noch
          einmal h&ouml;ren zu m&uuml;ssen. Marc drehte sich wieder
          zu ihr um.</P>

          <P>"Wo hast du den Ohrring hingelegt?"</P>

          <P>Sie stand einen Moment lang wie vom Donner
          ger&uuml;hrt da und brachte kein Wort heraus. Keine
          Entschuldigung, keine Rechtfertigung, ja es schien ihn
          nicht mal zu k&uuml;mmern, dass sie die Nachricht
          geh&ouml;rt hatte und damit f&uuml;r sie alles
          offensichtlich sein musste!</P>

          <P>"Ich habe dich etwas gefragt", hakte er in einem
          barschen und f&uuml;r ihn v&ouml;llig ungew&ouml;hnlichem
          Ton nach.</P>

          <P>Sie konnte wieder nur die Hand heben und auf den
          Dielenschrank und dessen oberste Schublade deuten. Als er
          darauf zuging, um den Ohrring herauszuholen, begann sie
          zu schluchzen. Es war nicht das stille, tonlose und fast
          unbemerkte Weinen, das sie sich in den n&auml;chsten
          Jahren angew&ouml;hnen sollte, es war ein lautes und
          verzweifeltes Weinen, das ihn zuerst nicht zu r&uuml;hren
          schien.</P>

          <P>Er nahm den Schmuck aus dem Schrank, drehte sich
          herum, um ins Wohnzimmer zu gehen und Helen folgte ihm,
          immer noch schluchzend. Die Situation hatte etwas von
          einem Alptraum, ja sie schien ein Alptraum zu sein,
          selbst dieses unreale Gef&uuml;hl, das manche
          Alptr&auml;ume innehaben war ein Teil davon.</P>

          <P>Er drehte sich an der Couch noch einmal zu ihr um und
          betrachtete sie kalt.</P>

          <P>"Kannst du vielleicht mit dem Geheule aufh&ouml;ren?",
          fragte er genervt und sch&uuml;ttelte den Kopf als
          h&auml;tte er es mit einem st&ouml;rrischen oder
          hysterischen Kind zu tun. Und als sie ansetzte, ihn immer
          noch haltlos unter Tr&auml;nen mit Vorw&uuml;rfen und
          Beschimpfungen zu &uuml;berh&auml;ufen, versetzte er ihr
          eine schallende Ohrfeige, die sie vier, f&uuml;nf
          Schritte zur&uuml;ck und gegen den T&uuml;rrahmen taumeln
          lie&szlig;.</P>

          <P>Ihr Weinen brach ab.</P>

          <P>Helen stand da und sah ihren Mann ungl&auml;ubig an,
          fragte sich, ob er es war oder ein Fremder vor ihr stand.
          Der Fremde starrte sie einen Moment an, seine kleine,
          zierliche, seine zerbrechliche rothaarige Frau mit den
          gro&szlig;en, ungl&auml;ubigen und fast
          ver&auml;ngstigten Augen und verwandelte sich
          pl&ouml;tzlich wieder in Marc, den Mann, den sie kannte,
          den sie lieben gelernt und geheiratet hatte.</P>

          <P>"Oh Gott Schatz, es tut mir leid! was ist denn
          da..."</P>

          <P>Er sprach nicht weiter, trat auf sie zu und nahm sie
          in den Arm.</P>

          <P>In den n&auml;chsten Stunden und Tagen hagelte es
          Entschuldigungen seinerseits, er habe Stress auf der
          Arbeit, Probleme hier, Probleme da, und er habe die
          Beherrschung verloren und als das sich langsam wieder zu
          regeln schien, begann er etwas halbherziger
          Rechtfertigungen f&uuml;r die andere Frau zu finden.</P>

          <P>Er wisse auch nicht, was da &uuml;ber ihn gekommen
          sei, aber sie w&uuml;rde bei ihm in der Kanzlei arbeiten,
          und sie h&auml;tten schon so viel im Job miteinander
          durchgemacht, und irgendwie w&auml;re das alles aus dem
          Ruder gelaufen...</P>

          <P>Er h&auml;tte seine Entschuldigungen aus einem
          drittklassigen Roman ablesen k&ouml;nnen, dachte sie
          damals &ouml;fter, aber sie schwieg dazu. Helen wollte
          nur ihre Ehe wieder, diese heile Welt, in der sie sich
          ein Jahr lang wohlgef&uuml;hlt und von der sie vorher
          schon lang getr&auml;umt hatte und so nahm sie den ganzen
          Mist und verscharrte ihn in der tiefsten Grube, ihrem
          Verstand, wo es blieb, jedenfalls meistens.</P>

          <P>Bis er wieder Stress auf der Arbeit hatte, bis es
          wieder mit einer anderen Frau aus dem Ruder lief.</P>

          <P>Irgendwann blieb es nicht mehr bei Ohrfeigen.</P>

          <P>Ihre Ehe wurde eine Gew&ouml;hnungssache.</P>

          <P>Marc schien sich daran zu gew&ouml;hnen, seine Frau
          auf direkte Art zum Schweigen zu bringen und er schien
          sich an andere Frauen zu gew&ouml;hnen.</P>

          <P>Helen gew&ouml;hnte sich ans Schweigen, ans Dulden und
          sie gew&ouml;hnte sich an den Stress, den Marc auf der
          Arbeit hatte.</P>

          <P>Bis zu einem ihrer hellen Tage, wohl dem letzten, an
          dem sie beschloss, der Farce ein Ende zu bereiten. Als
          Marc nach Hause kam, wieder viel zu sp&auml;t, wie immer
          in den letzten Monaten, er&ouml;ffnete sie ihm,
          inzwischen mit fast v&ouml;llig gepackten Koffern, dass
          sie ihn verlassen w&uuml;rde. Sie w&uuml;rde zu ihrer
          Freundin fahren und eine Weile dort bleiben, bis sie eine
          eigene Wohnung gefunden h&auml;tte.</P>

          <P>"Also sie sind was? Die Kellertreppe
          heruntergefallen?" Die Stimme des Arztes verriet noch
          deutlicher als sein Gesichtsausdruck, was er von dieser
          zugegebenerma&szlig;en mehr als abgedroschenen Ausrede
          hielt.</P>

          <P>Helen nickte nur, obgleich sie genau wusste, wie
          unglaubw&uuml;rdig sie wirkte, mit der aufgeplatzten
          Lippe, dem zugeschwollenen linken Auge, das sich farblich
          perfekt in die schillernden Schattierungen von blau und
          rot auf der ganzen Gesichtsh&auml;lfte einpasste, dem
          verrenkten Ellenbogen und zwei angebrochenen Rippen.</P>

          <P>&Auml;rzte erkannten verpr&uuml;gelte Frauen, wenn sie
          sie sahen und Helen fragte sich unwillk&uuml;rlich, wie
          viele Frauen hier monatlich auftauchten, die ebenfalls
          die Kellertreppe heruntergefallen, gegen eine T&uuml;r
          gelaufen waren oder sonstige Haushaltsunf&auml;lle
          erlitten hatten.</P>

          <P>Der Arzt schloss den Bericht mit einem Achselzucken ab
          und schickte sie nach drau&szlig;en, wo sie sich das
          obligatorische Rezept f&uuml;r Schmerztabletten von der
          Schwester am Empfang abholen durfte und mit dem Rat, noch
          einmal zu ihrem Hausarzt zu gehen wieder fort.</P>

          <P>Helen war froh, aus dem Krankenhaus herauszukommen, wo
          sie das Gef&uuml;hl hatte, der Arzt und s&auml;mtliche
          Schwestern k&ouml;nnten auf ihrem Gesicht lesen, was
          wirklich passiert war, und vermutlich verhielt es sich
          auch so, dachte sie, und ihr Magen zog sich zusammen.</P>

          <P>Sie nahm ein Taxi nach Hause, sodass sie nur die
          Blicke des Taxifahrers ertragen musste und lernte, wie
          viele Frauen vor ihr, Pullover mit Rollkragen zu tragen,
          egal wie kalt oder warm es war, und mit Sonnenbrille und
          dickem Make Up herumzulaufen, auch wenn sie wusste, oder
          zumindest mit einem Teil ihres Denkens, der sich mit den
          Jahren zunehmend verfolgt und beobachtet f&uuml;hlte
          ahnte, dass das nicht viel weniger offensichtlich machte,
          was bei ihr zu Hause ablief, als w&auml;re sie mit ihren
          blauen Flecken offen hausieren gegangen.</P>

          <P>Und das war der letzte Tag, an dem sie daran dachte,
          Marc zu verlassen. Er war nicht immer so zu ihr, nur
          manchmal, wenn seine Arbeit besonders anstrengend wurde,
          die Kanzlei vor gro&szlig;en Abschl&uuml;ssen stand oder
          sich Vergleiche auf der Kippe befanden.</P>

          <P>Es gab Tage, da ignorierte er sie ganz, aber auch
          Tage, an denen er ihr Blumen mitbrachte oder mit ihr
          abends in ein Restaurant oder ins Kino ging.</P>

          <P>Sie sprach mit niemandem dar&uuml;ber, nicht einmal
          mit ihrer Freundin. Und das aus gutem Grund.</P>

          <P>Sie wusste, was Sarah ihr geraten h&auml;tte. Sie
          h&auml;tte sie vermutlich an den Haaren aus der Wohnung
          und von Marc weggeschleift, aber das wollte Helen nicht.
          Sie hatte Marc geheiratet, weil sie ihn liebte und es gab
          Zeiten, in denen sie sich sicher war, dass er sie auch
          liebte.</P>

          <P>Diese Zeiten reichten ihr. Und wenn er ihr weh tat,
          dann war es ja nicht, weil er sie weniger liebte, sondern
          nur, weil er unter Stress stand. Und was die anderen
          Frauen anging, Herrgott, wie viele M&auml;nner betrogen
          ihre Frauen hin und wieder?</P>

          <P>Sie erhob sich nun wieder aus dem Bett und sa&szlig;
          eine Weile regungslos und starrte ins Leere.</P>

          <P>"Kannst du bald mal das Licht ausmachen? Ich
          m&ouml;chte schlafen." Diese wieder &uuml;beraus
          h&ouml;fliche Bitte stammte von Marc, der sie irgendwo
          unter einem halben Meter Decken und Kissen hervorgeblafft
          hatte und Helen beeilte sich, die Nachttischlampe
          auszuschalten. Sie erhob sich und ging noch einmal ins
          Badezimmer um nach ihren Valium zu suchen.</P>

          <P>"Valium, dein Freund und Helfer.", dachte sie
          resigniert und griff nach dem Fl&auml;schchen in ihrem
          Medizinschr&auml;nkchen neben dem Spiegel &uuml;ber dem
          Waschbecken. Sie warf einen Blick hinein und presste die
          Lippen vor ihrem eigenen Spiegelbild zusammen.</P>

          <P>Sie war von Natur aus immer recht blass gewesen, aber
          nun sah sie wie die sprichw&ouml;rtliche Wand aus und die
          grauen Augen wirkten dunkler als sonst und lie&szlig;en
          sie noch wei&szlig;er aussehen. Der Blick darin hatte sie
          einmal erschreckt, der Blick eines gejagten und
          ver&auml;ngstigten Tieres, doch sie hatte sich inzwischen
          auch daran gew&ouml;hnt.</P>

          <P>Doch etwas war heute anders. Sie dachte wieder an das
          lange schwarze Haar auf ihrem Kopfkissen, auf IHREM
          Kissen, in ihrem Schlafzimmer und ihr wurde
          &uuml;bel.</P>

          <P>Sie hatte nie daran gedacht, wo Marc sich mit seinen
          Frauen vergn&uuml;gte, aber dieser offensichtliche
          Beweis, dass es in dem Zimmer war, in dem sie schlief, in
          dem Bett, das sie sich mit ihm teilte, lie&szlig; sie
          fr&ouml;steln.</P>

          <P>"Aber du wirst wieder nichts sagen, oder?", meinte
          Carol in ihrem Kopf. "Du wirst es wieder hinnehmen und
          hoffen, dass du es in ein paar Tagen weit genug
          weggeschoben hast, wie bisher immer."</P>

          <P>Ja vermutlich w&uuml;rde sie das tun. Es war besser
          f&uuml;r sie, oder? Und Marc hatte wieder Stress im
          B&uuml;ro, sie w&uuml;rde ihn nicht wieder reizen.</P>

          <P>Sie schluckte die Valium mit etwas Wasser aus dem
          Hahn, fuhr sich mit den Fingern durch das Haar und kehrte
          leise ins Schlafzimmer zur&uuml;ck.</P>

          <P>Sie ahnte Marc eher neben sich, als sie ihn sah. Sein
          Atem ging inzwischen ruhig und gleichm&auml;&szlig;ig, er
          w&uuml;rde wohl fast eingeschlafen sein. Eine Weile lag
          sie einfach nur im Dunkeln, lauschte auf seine
          Atemz&uuml;ge und wartete darauf, dass die Valium ihre
          Wirkung tat.</P>

          <P>Ja sie w&uuml;rde wieder schweigen, und morgen
          w&uuml;rde alles wieder so sein, wie es heute und gestern
          gewesen war. Ruhig und meistens ohne Streit. Was konnte
          man mehr erwarten?</P>

          <P>Er brachte Geld mit nach Hause und es wurde jedes Jahr
          ein bisschen mehr, so lange, bis er Partner in der
          Kanzlei werden w&uuml;rde. Er m&uuml;sste dann weniger
          arbeiten, h&auml;tte wohl weniger Stress und alles
          w&uuml;rde besser werden.</P>

          <P>War sie nicht auch daf&uuml;r seine Frau? Um die
          schlechten Zeiten mit ihm durchzustehen? Es w&uuml;rde
          besser werden und ihre Aufgabe war es, so lange zu ihm zu
          halten. Dann k&ouml;nnten sie sich endlich das
          sch&ouml;ne Leben machen, das sie sich ertr&auml;umt
          hatten.</P>

          <P>So lange w&uuml;rde sie es schaffen, und es ging ihr
          doch nicht wirklich schlecht oder?</P>

          <P>Ihre Gedanken begannen sich langsam zu verwirren. Die
          Valium kroch gem&auml;chlich und schwer durch ihren
          K&ouml;rper und schlie&szlig;lich fand sie doch in einem
          dunklen und traumlosen Schlaf hinab.</P>

          <P>Der Wecker riss sie unsanft aus dem Schlaf und sie
          drehte sich mit einem &uuml;blen Geschmack auf der Zunge
          zur Seite, um ihn mit der &uuml;blich unkoordinierten
          Bewegung abzuschalten. Hatte sie wieder eine von den
          Tabletten genommen?</P>

          <P>Sie rieb sich mit der Hand &uuml;ber die Augen, die
          nicht so recht aufgehen wollten und versuchte dahinter zu
          kommen, was gestern wieder gewesen war. Und da fiel es
          ihr wieder ein. Das Haar, dieses widerliche, lange und
          schwarze Haar, das nicht ihr oder Marc geh&ouml;rte, das
          nicht im Entferntesten hierher geh&ouml;rte. Warum
          st&ouml;rte sie das so? Es war doch nun nicht das erste
          Mal, dass sie Beweise f&uuml;r Marcs Fremdgehen fand, und
          es war nicht mal der Deutlichste.</P>

          <P>Sie qu&auml;lte sich schwergliedrig aus dem Bett und
          tappte barf&uuml;&szlig;ig zum Bad. Ein Blick in den
          Spiegel zeigte ihr, dass sie ungef&auml;hr dreimal so
          schlecht aussah, wie sie sich f&uuml;hlte. Unter den
          verquollenen Augen lagen dunkle Ringe, und die Haut
          wirkte w&auml;chsern. Sie mochte nicht einmal daran
          denken, was die Kollegen wieder zu ihrem Aussehen zu
          sagen h&auml;tten. Ein paar dumme Scherze &uuml;ber eine
          kurze Nacht und die &uuml;blen Auswirkungen eines Katers
          oder &Auml;hnlichem, mit dem man sich so unter normalen
          Umst&auml;nden die Abende verl&auml;ngern
          k&ouml;nnte.</P>

          <P>Nachdem sie aus sich das Beste gemacht hatte, was wohl
          an diesem Tag herauszuholen war, ging sie leise in die
          K&uuml;che, um Marc nicht zu wecken. Er musste heute erst
          gegen zehn ins B&uuml;ro und reagierte mehr als
          ungehalten, wenn man ihn zu fr&uuml;h aus seinem
          wohlverdienten Schlaf riss.</P>

          <P>Als sie gerade den Kaffee aufgesetzt hatte, klingelte
          das Telefon. Sie hatte sich abgew&ouml;hnt, darauf zu
          h&ouml;ren, da in den letzten Jahren so gesehen nur noch
          Marc hier wohnte und sie bestenfalls ein Schatten war,
          wenn auch ein Schatten, der die Hypothek mit abbezahlte
          und das Essen kochte.</P>

          <P>Aber nun griff sie doch zum H&ouml;rer, bevor das
          Klingeln Marc wecken konnte.</P>

          <P>"Worner?", meldete sie sich leise.</P>

          <P>"Helen?", kam es nach einem merklichen Z&ouml;gern vom
          anderen Ende der Leitung.</P>

          <P>"Ja?"</P>

          <P>Sie hatte noch nicht realisiert, wer sie da um diese
          unheilige Urzeit anrief.</P>

          <P>"Ich bin's, Becca."</P>

          <P>Helen erstarrte. Vor ihrem geistigen Auge kringelte
          und r&auml;kelte sich schon wieder ein langes schwarzes
          Haar auf einem wei&szlig;en Kissenbezug.</P>

          <P>"Becca? Was ist denn los?", fragte sie, als w&auml;re
          es f&uuml;r sie selbstverst&auml;ndlich, dass Becca sie
          sprechen wollte.</P>

          <P>Und das war es doch auch, wieso ging sie eigentlich
          davon aus, dass wirklich Becca mit all dem etwas zu tun
          hatte? Sie war wei&szlig; Gott nicht die einzige Frau mit
          langen schwarzen Haaren auf der Welt, oder?</P>

          <P>Aber warum wirkte sie - f&uuml;r Becca v&ouml;llig
          untypisch - so verunsichert?</P>

          <P>"Ja &auml;hm, also ich wollte..."</P>

          <P>Sie z&ouml;gerte und suchte eine Weile nach
          Worten.</P>

          <P>"Oh Rebecca", dachte Helen. "Du bist l&auml;ngst keine
          so gute Schauspielerin, wie du selbst glaubst."</P>

          <P>"Ja also ich wollte nur Bescheid sagen, dass ich erst
          gegen halb elf im B&uuml;ro sein werde", brachte Rebecca
          schlie&szlig;lich hervor.</P>

          <P>Gro&szlig;artig, den Bogen hatte sie perfekt bekommen,
          dachte Helen und schwieg noch eine Weile.</P>

          <P>"Ja sicher. Hast du noch einen Termin?"</P>

          <P>"Oh Helen!" Das war wieder Carol. "Guten Morgen Helen,
          w&uuml;rdest du bitte aufwachen? Nat&uuml;rlich kommt sie
          sp&auml;ter, genau wie Marc sp&auml;ter ins B&uuml;ro
          muss, nicht wahr?"</P>

          <P>"Ich sage im B&uuml;ro bescheid Becca."</P>

          <P>Das war sie wieder, die gute alte Helen, die sich
          innerlich die Ohren zuhielt und einfach einen Fu&szlig;
          vor den anderen setzte, ohne nach links und rechts zu
          sehen. Sie legte auf, ohne sich zu verabschieden, trank
          ihren Kaffee, verzichtete aber auf den allmorgendlichen
          Toast, um aus dem Haus zu sein, bevor Marc aufstand.</P>

          <P>Unterwegs ging sie dann doch noch zum B&auml;cker, um
          sich ein St&uuml;ck Kuchen zu holen und eine zweite Tasse
          Kaffee zu trinken. Als sie im B&uuml;ro ankam, war sie
          trotzdem die erste, was ihr heute auch ganz recht
          war.</P>

          <P>Sie lie&szlig; sich an ihrem Schreibtisch nieder und
          lie&szlig; den Blick aus dem Fenster &uuml;ber den
          darunter gelegenen Park schweifen. Um diese Jahreszeit
          w&uuml;rde es keine zwei Stunden dauern und dort unten
          w&uuml;rden sich die B&auml;nke mit Menschen f&uuml;llen,
          die aus ihren B&uuml;ros flohen und der Meinung waren,
          einen geh&ouml;rigen Teil ihrer Arbeit auch in der Sonne
          erledigen zu k&ouml;nnen. Da sa&szlig;en sie dann meist,
          tranken Kaffee aus Pappbechern, rauchten, tratschten und
          beteten, dass sich niemand aus der Chefetage w&uuml;rde
          blicken lassen.</P>

          <P>Sie stand wieder auf, ging langsam aus dem B&uuml;ro
          den Flur hinunter zum Kaffeeautomaten, um sich die dritte
          Tasse Kaffee an diesem Tag zu holen. Damit wanderte sie
          dann wieder hinaus in den Park, setzte sich auf eine der
          B&auml;nke und z&uuml;ndete sich eine Zigarette an. Marc
          hasste es, wenn sie rauchte, und sie hatten schon
          mehrmals dar&uuml;ber gesprochen, was bedeutete, Marc
          redete, oder br&uuml;llte vielmehr, und Helen h&ouml;rte
          zu. Meistens reichte ihm das Geschrei, und als es ihm
          nicht mehr gereicht hatte, beschloss Helen, das Rauchen
          zu Hause sein zu lassen und sich damit auf die Arbeit zu
          beschr&auml;nken.</P>

          <P>Einen Kaffee und zwei Zigaretten sp&auml;ter kehrte
          sie ins B&uuml;ro zur&uuml;ck, wo auch schon Martin, der
          j&uuml;ngste ihrer Mitarbeiter mit seiner eigenen Tasse
          auf seiner Schreibtischkante sa&szlig; und
          nachl&auml;ssig mit einem Fu&szlig; wippte.</P>

          <P>"Morgen Helen", grummelte er und sah dabei
          ungef&auml;hr so m&uuml;de aus, wie sie sich f&uuml;hlte.
          "hast du heute hier &uuml;bernachtet?"</P>

          <P>Sie sch&uuml;ttelte den Kopf und l&auml;chelte ein
          wenig. "Ich bin fr&uuml;h aufgewacht und wusste nicht,
          was ich besseres mit meiner Zeit anfangen sollte."</P>

          <P>Sie schaltete ihren Computer ein und zwei Minuten
          sp&auml;ter hatte sie einen Auftrag der Chefetage vor
          sich auf dem Bildschirm.</P>

          <P>Martin linste ihr &uuml;ber die Schulter und gab ein
          St&ouml;hnen von sich.</P>

          <P>"Diese Blutsauger schlafen offenbar genauso wenig wie
          du.", murrte er und scherte sich an seinen eigenen
          Arbeitsplatz.</P>

          <P>Die Chefetage bestand hier aus einem Haufen von
          mittel- bis schwerreichen Anw&auml;lten, und sie hier
          unten waren die Sklaven, die f&uuml;r die
          hochwohlgeborenen Herren die Recherchen erledigen
          durften. Helen hatte zwei Zeilen bekommen, die ihr die
          Informationssuche f&uuml;r ein kleines Unternehmen
          auftrug, das unter anderem Farben, Klebstoffe und Lack
          herstellte.</P>

          <P>Irgendwo hatte es wohl Atembeschwerden und eine Menge
          Kopfschmerzen gegeben und man hatte sich an die Kanzlei
          gewand um zu sehen, was man f&uuml;r solche
          gesundheitlichen Sch&auml;den herausholen konnte.</P>

          <P>Also verbrachte Helen eine Weile im Internet,
          telefonierte und stellte einige Informationen zusammen,
          die allerdings nicht nur elektronisch, sondern auch in
          Papierform oben abgeliefert werden wollten.</P>

          <P>Das B&uuml;ro hatte sich schlie&szlig;lich
          gef&uuml;llt, aber Helen gab sich weiter
          besch&auml;ftigt. Sie h&auml;tte sich heute am liebsten
          mit niemandem unterhalten, Und es wurde noch schlimmer,
          als Rebecca um elf, p&uuml;nktlich eine halbe Stunde zu
          sp&auml;t wie immer hereingerauscht kam und die ganze
          Szene f&uuml;r sich beanspruchte.</P>

          <P>Gn&auml;digerweise lie&szlig; sie das
          Begr&uuml;&szlig;ungsritual bei Helen heute ausfallen,
          schwebte an ihr vorbei und lie&szlig; sich an ihrem
          Schreibtisch nieder, wo sie - ebenfalls wie immer - erst
          einmal den Taschenspiegel herausholte, um ihr Make Up zu
          vervollkommnen.</P>

          <P>Helen versuchte, nicht auf sie zu achten, und jagte
          ihre Farb- und Klebstoff-Recherchen &uuml;ber den Drucker
          und die elektronische Ausf&uuml;hrung nach oben in die
          Chefetage.</P>

          <P>P&uuml;nktlich zum Feierabend verlie&szlig; sie das
          B&uuml;ro, nicht, weil sie es so eilig hatte nach Hause
          zu kommen, aber es war einfach nichts mehr zu erledigen
          gewesen, und so ging sie langsam in Richtung ihres
          Hauses, wobei sie sich denkbar viel Zeit lie&szlig;,
          einen Blick in fast jedes Schaufenster warf, hier und
          dort stehen blieb, Sonderangebote begutachtete und so
          ihren Weg nach Hause so gut verlangsamte, wie sie es nur
          konnte.</P>

          <P>Als sie schlie&szlig;lich die Haust&uuml;r aufschloss,
          erwartete sie niemand. Aber sicher, Marc w&uuml;rde die
          Zeit, die er heute Morgen verschlafen hatte - sie
          weigerte sich, dar&uuml;ber nachzudenken, ob er wirklich
          geschlafen hatte - wieder aufholen m&uuml;ssen.</P>

          <P>Nach der &uuml;blichen Hausarbeit, die sie etwa zwei
          Stunden kostete, lie&szlig; sie sich mit einem Buch auf
          der Terrasse nieder und versank f&uuml;r eine Weile
          darin. Sie &uuml;berh&ouml;rte geflissentlich das
          Klingeln des Telefons, und als sie sp&auml;ter nach
          drinnen ging, da es drau&szlig;en langsam zu k&uuml;hl
          wurde, &uuml;bersah sie ebenso das blinkende Licht am
          Anrufbeantworter.</P>

          <P>Marc kam erst sp&auml;t in der Nacht nach Hause, nicht
          gerade sehr leise und unverkennbar angetrunken. Er
          nuschelte etwas von einer unangek&uuml;ndigten kleinen
          internen Feier, warf seine Sachen irgendwo in eine Ecke
          und verkroch sich ohne ein weiteres Wort unter der Decke.
          F&uuml;nf Minuten sp&auml;ter setzte sein
          ohrenbet&auml;ubendes Schnarchen ein, das sie nur zu
          h&ouml;ren bekam, wenn er besonders ersch&ouml;pft oder,
          wie heute, angetrunken war.</P>

          <P>Sie verdr&auml;ngte die Gedanken daran, wo er wohl
          gewesen war, ob es wirklich eine Betriebsfeier gewesen
          war oder um was es sich sonst gehandelt haben k&ouml;nnte
          und beschloss, die Finger heute von den Valium zu lassen.
          Sie hatte ein paar Mal den Fehler gemacht, sie zwei
          Abende hintereinander zu nehmen und hatte Tage - fast
          eine Woche gebraucht, sich davon zu erholen.</P>

          <P>Und so wurde ihr Schlaf in dieser Nacht auch denkbar
          unruhig, was nicht einmal etwas mit Marcs Schnarchen zu
          tun hatte.</P>
          <HR>

          <P>Fortsetzung folgt.</P>

          <P>Nadine Alexander</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

