<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Thomas Nawroth">
<META NAME="DESCRIPTION" CONTENT="Ein Computer-Magazin von 1984">
<TITLE>Happy Computer</TITLE>
</HEAD>
<BODY bgcolor="#fffff4" background="Images/mm_hc21b.gif">
<TABLE border="0" cellpadding="8">
      <TR>
        <TD>
         <CENTER><IMG SRC="Images/mm_hc21a.gif">
         <BR><I>Folge 21</I><BR><BR>

Basic-Erweiterungen f&uuml;r den Commodore 64 sind stark im Kommen. Ein besonders leistungsf&auml;higes Programm ist &quot;Graphics Basic&quot;, das der Sound- und Grafik- Programmierung neue Perspektiven er&ouml;ffnet.</CENTER>

<H1 ALIGN="CENTER">Konkurrenz f&uuml;r Simon`s Basic</H1><BR>

<P>Wenn Kritiker &uuml;ber den Commodore 64 herziehen, verweisen sie gerne auf das m&auml;&szlig;ige Commodore-Basic. Es stimmt auch wirklich betr&uuml;blich, wenn ein Computer &uuml;ber hervorragenden Sound und eine exzellente Grafik verf&uuml;gt, die aber nur m&uuml;hsam angePOKEt werden k&ouml;nnen. Programme, die das Mager-Basic um sinnvolle Befehle erweitern, sind deshalb stark gefragt. Der Bestseller in dieser Sparte ist wohl &quot;Simon`s Basic&quot;, das mit seiner Palette von Grafik-Befehlserweiterungen eine gro&szlig;e Verbreitung erreichte. Doch jetzt kommt ernsthafte Konkurrenz: &quot;Graphics Basic&quot; nennt sich eine Software-Erweiterung, die dem Basic des Commodore 64 gewaltig auf die Spr&uuml;nge hilft.</P>

<P>Nach Einladen der Befehls-Erweiterung warf ich zur Einstimmung erst einmal einen Blick auf eines der zahlreichen Demo-Programme, die alle mit &quot;Graphics Basic&quot; geschrieben wurden und sich sinnvollerweise auch LISTen lassen. Es ist schon verbl&uuml;ffend, was f&uuml;r sch&ouml;ne grafische Effekte nun bereits mit einem Mini-Listing realisierbar sind. Ein Blick auf die Programmzeilen l&auml;&szlig;t den leidgewohnten Commodore-Programmierer stutzen: Wo sind die POKEs? Nun, die sind ebenso verst&auml;ndlichen wie praktischen Grafik-Befehlen gewichen. Statt &quot;POKE 53281,1&quot; hei&szlig;t es jetzt eben &quot;BACKGROUND WHITE&quot; - und so weiter. &quot;Graphics Basic&quot; bringt dem Commodore 64 sogar den langersehnten Befehl &quot;CIRCLE&quot; bei und einiges mehr.</P>

<CENTER>
<B><H5>Eine Bildschirm-Malerei mit &quot;Graphics Basic&quot;...</H5></B>
<IMG SRC="Images/mm_hc21c.gif" ALT="Bildschirmfoto eines Demos von Graphics Basic" WIDTH="434" HEIGHT="340">

<B><H5>... und das dazugeh&ouml;rige Mini-Listing.</H5></B>
<TABLE bgcolor="#AAAAAA"><TR><TD>
<PRE>10 RESET : HIRES: BORDER BLACK
20 COLOR PURPLE:FOR i=1 to 690 STEP 5:LINE 0,0 TO I,200:NEXTI
30 COLOR WHITE : LINE 100,10 to 155,10
40 COLOR PINK:BOX 170,10 XYSIZE 35,30: FILL 171,21
50 COLOR BLUE:CIRCLE 270,35 XYSIZE 40,35:FILL 260,35
60 GPRINT at 6,1 XYSIZE 2,3 &quot;HAPPY-COMPUTER&quot;
70 GPRINT at 9,5 XYSIZE 1,2&quot;TESTET GRAPHICS BASIC&quot;


</PRE></TD></TR></TABLE></CENTER><BR>

<P>Auch in Sachen Sprite-Erzeugung wird n&uuml;tzliche Hilfe geboten. Zum Beispiel stehen ein ausgezeichneter Sprite-Editor und ungew&ouml;hnliche aber effektvolle Befehle wie &quot;SPRITE ANIMATE&quot; zur Verf&uuml;gung. Und wer seinem Commodore 64 ohrenumschmeichelnde T&ouml;ne entlocken will, wird mit einer Handvoll Sound-Befehlen bedient, mit denen ich angesichts des Namens &quot;Graphics Basic&quot; gar nicht gerechnet hatte.</P>

<P>Die Sprite- und Sound-Programmierung l&auml;uft &uuml;brigens interruptgesteuert. Das bedeutet, da&szlig; man sich zum Beispiel eine gerade programmierte Melodie anh&ouml;ren kann, w&auml;hrend man an seinem Programm weiter arbeitet.</P>

<P>Insbesondre f&uuml;r das Programmieren von Spielen er&ouml;ffnet &quot;Graphics Basic&quot; neue M&ouml;glichkeiten und wird all denjenigen einen Stein vom Herzen fallen lassen, die sich immer &uuml;ber die nichtvorhandenen Grafik-Befehle des Commodore 64 &auml;rgerten. Das etablierte &quot;Simon`s Basic&quot; bleibt im direkten Vergleich auf der Strecke. &quot;Graphics Basic&quot;, das um die 90 Mark kostet, bietet mehr Befehle und erlaubt ein effektiveres Programmieren. Wenig Listing - gro&szlig;e Wirkung.</P>

(H. Lenhardt)

<HR><BR>
In der n&auml;chsten NoCover gibt es einen Testbericht des Diskettenlaufwerks &quot;DD20&quot; f&uuml;r die Laser-Heimcomputer. 
         </TD>
        </TR>
</TABLE>
<BR><BR>
<TABLE ALIGN="CENTER" border="3">
<TR bgcolor="#ffffff">
<TD><A HREF=mailto:"thomasnawroth@web.de">Thomas Nawroth</A></TD>
</TR>
</TABLE>
</BODY>
</HTML>
