<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling14062004">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="images/jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="images/st_einnoch.jpg" alt="Ein` hab ich noch" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <P>
            Das frisch verm&auml;hltes Paar ist auf Hochzeitsreise in Paris und bestaunt den Eifelturm. Sagt sie: "Erst da rauf oder erst ins Bett?" - Sagt er: "Erst ins Bett, der Eifelturm steht
            l&auml;nger!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Warum sind bei einem Polizeiauto die T&uuml;ren, Heckklappe und Motorhaube gr&uuml;n?<BR>
             Damit der Polizist weiss, was zu &ouml;ffnen ist.
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was ist das? Ein Mann mit einem Sechser-Pack Bier auf einer Gr&uuml;nfl&auml;che im Park?<BR>
             Eine Ich-AG auf Betriebsausflug!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Warum kommst du immer mit schmutzigen Ohren nach Hause?" - "Ich habe keine anderen!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Tourist zum Einheimischen: "Wurde in ihrem Ort schon mal ein gro&szlig;er Mann geboren?" - Nein, immer nur kleine Kinder!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Martin, was hatten wir gestern auf?", fragt die Lehrerin. Martin &uuml;berlegt kurz uns antwortet: "Sie gar nichts und ich eine Baseball-Kappe!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Sagt eine Blondine zu fortgeschrittener Zeit auf einer Party: "Wer eine der Personen erkennt, die ich mir auf die Oberschenkel t&auml;towiert habe, darf einmal!"<BR>
             Die Herren sichtlich erfreut, umkreisen das h&uuml;bsche Fr&auml;ulein sofort! Der erste geht mit ihr ins Schlafzimmer. Sie zieht sich aus und er darf raten: "Den da rechts, den kenne
            ich! Das ist Brad Pitt!". Sie : "Stimmt, daf&uuml;r darfst du einmal!".<BR>
             Nach st&uuml;rmischen 20 Minuten kommt der n&auml;chste!<BR>
             "Den da links kenne ich, das ist Sascha Hehn!" Sie: "Richtig, du darfst auch einmal!" Etwas sp&auml;ter kommt der n&auml;chste und r&auml;t: "Hmm, also den rechts kenne ich nicht und den
            links habe ich auch noch nie gesehen, aber der in der Mitte mit den roten Haaren und den dicken Lippen - das ist Boris Becker!"
          </P>
          <BR>

          <HR align="center" width="100%">
          <BR>

          <P>
            Woran erkennt man da&szlig; auf einem Computer Window`s installiert ist ohne Ihn ein zuschalten? - Einfach mal nachsehen ob die Schrift auf dem Reset Knopf noch lesbar ist!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Mami, warum hat Papi so wenig Haare?" - "Weil er so viel denkt!" - "Und warum hast du so viele Haare?" - "Jetzt ist es Zeit in Bett zu gehen!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Wollen zwei Blondienen Schach spielen. Fragt die eine ihre Mitspielerin: "Sag mal, hast Du die Regeln im Kopf?"<BR>
             Fragt die andere verst&ouml;rt: "Wieso, blute ich aus der Nase?"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Warum haben so viele M&auml;nner einen so dicken Bierbauch? - Damit der Arbeitslose Zwerg wenigstens ein Dach &uuml;ber dem Kopf hat!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Er: "W&uuml;rdest du f&uuml;r 100 Euro mit mir ins Bett gehen?"<BR>
             Sie: "NEIN!"<BR>
             Er: "Schade, ich h&auml;tt' das Geld grad gut gebrauchen k&ouml;nnen..."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Sitzen zwei &auml;ltere Frauen auf einer Parkbank und schauen in den Wald. Sagt die eine zu der anderen: "Die armen V&ouml;gel im Wald..."<BR>
             Darauf die andere: "Ja, ja .....und die Reichen im Bett"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Was laufen sie mir eigentlich die ganze Zeit hinterher?", fragt die kesse Lola entr&uuml;stet. Antwortet Hans nachdencklich: "Nun, wo sie sich umdrehen, frage ich mich das auch."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Bei einer Vehrkehrskontrolle wird ein angetrunkender Autofahrer gefragt: " Entschuldigen Sie, haben Sie Restalkohol?" - Darauf der Autofahrer in einem lallenden Ton: "Nun fangen Sie mal
            nicht an zu betteln!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Gerd, was ist dein Lieblings-Instrument?" - "Der Essens-Gong!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Julia im Spielzeugladen: "Ich m&ouml;chte gerne ein Puzzel, ein ganz schwieriges!"<BR>
             Der Verk&auml;ufer bringt ein Puzzel nach dem anderen, aber Julia sind alle Puzzel zu leicht. Langsam verliert der Verk&auml;ufer die Geduld: "Ich sag dir jetzt was: Wenn dir alle Puzzel
            zu leicht sind, dann geh doch zum B&auml;cker und kauf dir eine T&uuml;te Semmelbr&ouml;sel. Daraus kannst du dir ein Br&ouml;tchen basteln!"<BR>
          </P>
          <HR width="100%" size="3">
          <BR>

          <P>
            Eine Blondine hat eine Beule in ihrer Autot&uuml;r. Ein Bekannter empfiehlt ihr, sie solle doch in den Auspuff zu blasen. Gesagt, getan. So liegt sie mit hochrotem Kopf hinter dem Wagen
            und bl&auml;st, was das Rohr aush&auml;lt.<BR>
             Kommt eine andere Blondine vorbei und sagt: "So wird das nix! Du musst erst das Schiebedach zukurbeln!"
          </P>
          <BR>

          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <CENTER>
            <IMG src="images/jojo.jpg" alt="JoJo" width="212" height="50"><BR>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

