<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Neues Executive Update von AMIGA-CEO Bill McEwen

G&uuml;nther Holm (HolmG@gmx.de) hat das j&uuml;ngste Executive Update von AMIGA-
CEO Bill McEwen f&uuml;r unseren Partner amiga-news.de &uuml;bersetzt und uns
freundlicherweise f&uuml;r eine Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt:


»Gr&uuml;&szlig;e an die AMIGA-Gemeinschaft, 

vor einer Woche teilten wir mit Ihnen die Freude, uns auf die Wiedergeburt 
der Amiga-Desktop Plattform zuzubewegen. Der AmigaOne und AmigaOS4 sind 
Projekte, die fast jeden Tag der letzten zwei Jahre unseres Lebens 
beansprucht haben. Das Warten und die Scheinaufbr&uuml;che waren f&uuml;r die 
Gemeinschaft untragbar. 

Entgegen der in manchen Kreisen gestreuten Ger&uuml;chte, haben wir merklich 
Zeit und Ressourcen in die Schaffung einer Strategie gesteckt, die die 
Desktop-Plattform Amiga wieder im Hauptfeld sieht und eine angemessene 
Marktposition einnehmen wird. AmigaOne und AmigaOS4 sind nur die ersten und 
sichtbarsten Zeichen dieser Strategie. Es ist uns sehr wichtig, k&uuml;nftigen 
Kunden ein vollkommenes und ganzes Amiga-Erlebnis zu bieten. 

Erste Ank&uuml;ndigung ist, dass wir uns selbst zur Produktion und Entwicklung 
einer Plattform verpflichten, die beiden, Nutzern und Entwicklern, nicht 
nur ein Qualit&auml;tsprodukt, sondern eben ein Qualit&auml;tserlebnis garantiert. 
Der Weg dahin f&uuml;hrt &uuml;ber eine Kombination aus strengen Qualit&auml;t sichernden 
Zertifikaten, und die ausschlie&szlig;liche Verf&uuml;gbarkeit des AmigaOS f&uuml;r 
lizenzierte Anbieter, f&uuml;r den Verkauf kombinierter Hard- und 
Softwarel&ouml;sungen.
 
Vom Kopf bis zum Fu&szlig; der Firma sind wir &uuml;berzeugt, die Qualit&auml;tssicherung 
f&uuml;r den Kunden inne zu haben, und wir versichern, dass Substandard-Produkte 
das nicht tun im Amigamarkt, sie richten eher irreparablen Schaden am Ruf 
der Plattform an. Die Lizenznehmer haben ein komplettes Endprodukt zu 
entwickeln, mit gesicherter Qualität, Lieferung, und, ganz wichtig Support 
f&uuml;r alle gelieferten Produkte, mit Vertragspartnern f&uuml;r Reparatur, Ersatz 
und &Uuml;berarbeitung, Dinge, die den Amigamarkt in den letzten f&uuml;nf Jahren im 
Keim erstickt haben. 

Zus&auml;tzlich wird die in sich geschlossene Zusammenarbeit zwischen AMIGA Inc. 
und den Lizenznehmern die feste Bindung der Software an die Hardware 
sichern, was gr&ouml;&szlig;te Performance und die Basis f&uuml;r schnelle Entwicklungen 
auf unserem Weg voran bietet. 

Als Resultat werden AmigaOS4 und sp&auml;tere Versionen nur mit den Hardware-
Produkten verkauft, denen Amiga Inc. nach Sichtung der F&auml;higkeiten von 
jeweiliger Firma und Produkt, eine spezielle Lizenz gew&auml;hrt. Einzige 
Ausnahme sind die Kunden, die sehr viel in PPC-Ausr&uuml;stung auf bestehenden 
AMIGA-Systemen investiert haben, in denen ein lizenziertes Kickstart ROM 
enthalten ist (z.B. A1200, 3000, 4000). 

Momentan ist diese Hardware gemeint: 

* Eyetechs AmigaONE Serie von PPC-Mutterplatinen 
* CyberstormPPC Beschleunigerkarten von phase5/DCE 
* BlizzardPPC Beschleunigerkarten von phase5/DCE 

Ann&auml;herungen und Vertragsverhandlungen gibt es weiter zu folgenden Firmen, 
um Hard/Soft-Kombinationen zu lizenzieren: 

* Die Shark Karte von Elbox 
* PPC Beschleunigerkartekarten f&uuml;r Prometheus von Matay 
* Merlancia Industries MMC Toro Serie 

Im Falle von neuer verf&uuml;gbarer Harware, inklusive Eyetech, Elbox und Matay-
Produkten, erzwingt die Lizenz, dass OS4-spezifische Erweiterungen als 
Kopierschutzma&szlig;nahme in das Boot-ROM zu integrieren sind. F&uuml;r nicht WB 3.1 
f&auml;hige Hardware, (wie z.B. AmigaOne) werden wir, als Bestandteil der 
Lizenzvereinbarung, die Auslieferung eines AmigaOS mit jedem daf&uuml;r 
geeigneten Board festschreiben. 

Die oben aufgef&uuml;hrten Ma&szlig;nahmen wurden nach Abstimmung mit Partnern, 
Entwicklern, H&auml;ndlern und Usern getroffen, und repr&auml;sentieren die Einsicht, 
dass, wenn die Amiga-Plattform wieder erfolgreich werden soll, es 
Professionalit&auml;t und Verantwortung braucht, wobei die Bed&uuml;rfnisse der 
Kunden ausschlaggebend sind. Mit diesen Ma&szlig;st&auml;ben bei AmigaOS4 und den 
neuen Hardware-L&ouml;sungen ist die Amiga-Plattform auf dem Weg nach vorn. 

Bill McEwen
CEO
Amiga Inc.
Snoqualmie, WA«

(Quelle des Originals: AMIGA, Inc.,
http://www.amiga.com/corporate/041202-mcewen.shtml)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
