<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Stellungnahme von Eyetech zur AmigaOne/AmigaOS4.0-Ank&uuml;ndigung

Wie einige User in den letzten Wochen s&uuml;ffisant anmerkten, scheint es 
AMIGA, Inc. einfach nicht zu gelingen, eine Pressever&ouml;ffentlichung so klar 
zu verfassen, dass anschlie&szlig;end keine Klarstellung notwendig wird... Kurz 
nach AMIGAs neuestem Executive Update sah sich Alan Redhouse von Eyetech in 
der AmigaOne-Mailingliste gezwungen, diverse Dinge zu verdeutlichen:

»Bei ann.lu und auch an anderen Stellen gab es zahlreiche Spekulationen 
&uuml;ber die Art der ROM-Anpassungen, durch die dem A1-G3 (und allen weiteren 
von AMIGA, Inc. genehmigten Modellen) der Betrieb mit OS4+ erm&ouml;glicht 
werden soll. Wie die meisten Interessierten hier wissen werden, haben wir 
schon immer betont, dass wir das offizielle AmigaOS verwenden wollen und 
f&uuml;r Hyperion und Amiga die gerechtfertigten Eink&uuml;nfte f&uuml;r die Lizenzierung 
des AmigaOne und der OS4-Erzeugnisse erwarten. Wir sind nicht der einzig 
m&ouml;gliche Lizenznehmer, aber ich denke doch, dass wir uns als Erste diesen 
Bedingungen unterworfen haben. Auf Grund dessen haben wir w&auml;hrend des A1-
Entwicklungsprogramms sehr eng sowohl mit AMIGA. Inc. als auch mit Hyperion 
zusammengearbeitet, um sicher zu stellen, dass die Piraterie bei dem OS4 
auf ein Minimum begrenzt wird. Gemeinsam haben wir erarbeitet, dass der 
beste Schutz wie folgt erreicht wird:..."

- Einsatz von ROM-Erweiterungen (d.h. Dongle-Code) in das Boot-ROM,
  zus&auml;tzlich zum normalen Boot-Code.
- Unterbringung dieser Erweiterungen im hart-codierten, gesockelten ROM bei 
  einer bestimmten Adresse im PPC-Speicherbereich und nicht im Flash-ROM,
  welches ja leicht zu knacken und zu ver&auml;ndern w&auml;re.
- Sicherstellung, dass das OS4 diesen Code von mehreren Stellen aus
  abfragt, um die Erstellung von Patches zur Umgehung der Sicherung zu 
  erschweren.
- Sicherstellung, dass eine Kopie des OS4 mit jeder Hardware verkauft wird, 
  auf der es laufen kann (d.h. mit dem Dongle-Code im ROM).
- Die Verwendung von Routinen, wie sie in &auml;hnlicher Form schon im 3.1-
  Kickstart-ROM existieren, als eine Alternative f&uuml;r andere PPC-
  Beschleuniger-Erzeugnisse.

Obwohl ohne Zweifel ein ge&uuml;bter Pirat den Boot-Code kopieren und ROMs damit 
erzeugen k&ouml;nnte, w&auml;ren die Kosten daf&uuml;r, wenn es nicht im Massenbetrieb 
geschieht - welcher leicht zu orten und zu unterbinden w&auml;re - im Vergleich 
mit dem legalen Erwerb der ROMs so hoch, dass kaum jemand das tun w&uuml;rde. 
Die Situation ist vergleichbar mit den OS OS3.1/3.5/3.9 in so weit, dass 
Sie 3.1-ROMs besitzen/kaufen m&uuml;ssen, wenn Sie nicht au&szlig;ergew&ouml;hnliche 
Schwierigkeiten in Kauf nehmen wollen.

Wir fertigen alle Entwickler-/H&auml;ndler-Platinen und wenigstens die erste 
Charge der Endverbraucher-Platinen mit diesem Dongle-Code im ROM - und 
damit besteht die Verpflichtung, das OS4 mit zu kaufen. (Nat&uuml;rlich kann man 
mit ihnen Linux betreiben, aber Sie m&uuml;ssen trotzdem OS4 mit diesen Platinen 
kaufen). Wenn gen&uuml;gend Bedarf in der Linux-Gemeinschaft besteht, werden wir 
wahrscheinlich einige Platinen ohne den AmigaOne-Namen (und ohne den 
Dongle-Code, der f&uuml;r den Betrieb des OS4 n&ouml;tig ist) produzieren. In diesem 
Falle werden wir auch ein Aufr&uuml;stungspaket OS4 + ROM (wie das f&uuml;r OS3.5/3.9 
+ 3.1-ROM, welches von den meisten Amiga-H&auml;ndlern bereit gehalten wird) 
denjenigen zur Verf&uuml;gung stellen, die ihre Nur-Linux-Platinen auf OS4 
aufr&uuml;sten wollen.
 
Was andere lizenzierte eigenst&auml;ndige PPC-Hardware angeht, w&uuml;rde es meiner 
Ansicht nach ein &auml;hnliches Schutzformat erfordern (d.h. gesockeltes 
hartcodiertes ROM, nicht Flash-ROM), um den gleichen Schutzlevel gegen 
Piraterie zu erreichen wie beim A1G3-SE. Es ist mir nicht bekannt, ob 
besonders bei anderen Hardware-Herstellern diese gesockelten ROMs bereits 
eingef&uuml;hrt sind, ob sie eine Option bleiben oder ob sie einen teilweisen 
Neuentwurf der Hardware erforderlich machen. Das muss zwischen AMIGA, Inc. 
und den jeweiligen Lizenznehmern ausgemacht werden.

Diese strikten Anti-Piraterie-Ma&szlig;nahmen haben offenbar einige Personen in 
den Mailinglisten ver&auml;rgert, die glaubten, f&uuml;r das OS4 nichts bezahlen zu 
m&uuml;ssen oder die hofften, sie k&ouml;nnten eine nicht zugelassene bzw. 
unlizenzierte PPC-Linux-Platine kaufen, um ein paar Euros zu sparen. Nicht 
schlecht gedacht, aber wir verzichten unter diesen Umst&auml;nden auf das 
Gesch&auml;ft mit ihnen und wir werden alles tun, was in unser Macht steht, 
dass, wenn eine Platine nur f&uuml;r Linux verkauft wird, eine Verwendung mit 
OS4 unm&ouml;glich ist, wenn man nicht bereit ist, an Hyperion und AMIGA, Inc. 
die zustehenden Lizenzgeb&uuml;hren zu bezahlen.

Und ich bin sicher, dass alle anderen in Frage kommenden ernsthaften 
Lizenznehmer von eingetragener Amiga-Hardware die Sache genau so sehen 
werden.

Alan Redhouse, Eyetech CEO«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
