<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Diverse Amiga-News
------------------

1. Interview mit Thendic France und Petro Tyschtschenko (von Petra Struck)

Vor wenigen Wochen ist bekannt geworden, dass der Hardwarehersteller 
Thendic France mit der bplan GmbH ein Kooperationsabkommen zur Entwicklung 
einer Miniaturversion des PowerPC-Mainboards Pegasos geschlossen hat. Petra 
Struck von unserem Partner amiga-news.de hat daraufhin ein ausf&uuml;hrliches 
Interview mit William Buck, ehemals CEO von VIScorp und nun Chef von 
Thendic France, seiner Mitarbeiterin Raquel Velasco sowie dem ehemaligen 
AMIGA-Manager Petro Tyschtschenko, welcher an dem Projekt ebenfalls nicht 
ganz unbeteiligt ist, gef&uuml;hrt:


»amiga-news.de: Auf ANN haben Sie beide in Kommentaren einige Fakten und 
Details bekannt gegeben. Petro gab an, dass Bill and Raquel sehr hart f&uuml;r 
VisCorp k&auml;mpften (deren seinerzeitiger Arbeitgeber), um AMIGA in Zeiten des 
Escom-Bankrotts zu kaufen. Petro sagte au&szlig;erdem, er glaubt an die F&auml;higkeit 
bPlans, die Zukunft zu managen. Bill gab an, dass Thendic-France einen 
Vertrag mit bPlan hat, um etwas Entwicklungsarbeit zu tun. Speziell, um 
Eclipsis zu entwickeln. Bill, Sie sagten au&szlig;erdem, dass Ihre Firma 1995 und 
1996 sehr eng mit Petro zusammen gearbeitet hat. Was genau meinten Sie 
damit? 

Thendic France: Das stimmt. Raquel und ich haben von Juni bis November 1996 
die Geh&auml;lter, Steuern und Sozialabgaben des Amiga Inc. Personals aus 
eigener Tasche bezahlt, (so we had some "bucks" too ...). [Anmerkung zum 
besseren Verst&auml;ndnis: Es ist ein Anspielung auf ein Wortspiel. Nachdem 
VisCorp Amiga Technologies doch nicht gekauft hatte, machte Petro 
Tyschtschenko in einem Interview folgende Anspielung auf ´Bill Buck´: 
"There were a lot of bills, but no bucks", was soviel hei&szlig;t, wie "Es gab 
einen Haufen Rechnungen, aber kein Geld".] Dieses Arrangement trafen wir 
zugunsten VisCorp mit dem Konkursverwalter Hembach, es war der einzige Weg, 
Amiga am Leben zu halten. Die Gesch&auml;ftsleitung von VisCorp stimmte zun&auml;chst 
zu, zogen ihre Zusage jedoch zur&uuml;ck, als mehr Details des Escom-Bankrotts 
in der &Ouml;ffentlichkeit bekannt wurden.
 
Es wurde sehr kompliziert und letztendlich sorgte sich VisCorp mehr um 
ihren kurzzeitigen Aktienkurs und gab die ganze Settopbox-Strategie v&ouml;llig 
auf. Wir haben diese Gelder nie erstattet bekommen, obwohl wir sp&auml;ter einen 
Vergleich mit Viscorp erstreiten konnten (die rechtlichen Angelegenheiten 
zu dieser Zeit hielten uns von der Ver&ouml;ffentlichung von Details ab). Petro 
arbeitete mit uns zusammen und wir arbeiteten hart daran, den Amiga 
Lagerbestand abzuverkaufen (was dabei half, die &Uuml;bernahmekosten zu dr&uuml;cken, 
aber nicht dazu genutzt werden konnte, Personalkosten zu begleichen). Zu 
guter Letzt beschloss der VisCorp-Vorstand die &Uuml;bernahme doch nicht 
abzuschlie&szlig;en und wir k&uuml;ndigten. Petro ging zu Gateway; VisCorp starb 
letzten Endes. 

Wir sind sicher, dass Petro zugeben wird, dass ohne unser Geld zu der Zeit 
er pers&ouml;nlich und auch Amiga selber als Komplettpaket (das geistige 
Eigentum und der betr&auml;chtliche Lagerbestand an A1200 und Komponenten) es 
sehr schwierig gehabt h&auml;tten, zu &uuml;berleben. Herr Hembach, der 
Konkursverwalter, wollte alles auf jede Art die er konnte verkaufen. Er 
h&auml;tte das geistige Eigentum in kleine St&uuml;cke aufgeteilt und dies h&auml;tte dann 
einen zuk&uuml;nftigen Erfolg f&uuml;r Amiga unm&ouml;glich gemacht. Petro geb&uuml;hrt der 
Dank daf&uuml;r, dass er Herrn Hembach &uuml;berzeugen konnte, das Paket 
zusammengeschn&uuml;rt zu lassen. Auch Helmut Jost geb&uuml;hrt etwas Dank, weil er 
der letzte Gesch&auml;ftsf&uuml;hrer unter Escom war und von Herrn Hembach gehalten 
wurde, um ihm zu assistieren, w&auml;hrend Petro die Verkaufskan&auml;le offen und 
"Amiga" lebendig hielt. Vielleicht ist es schlie&szlig;lich mal an der Zeit, dass 
diese Informationen besser bekannt werden. 

Petro Tyschtschenko: Ja, es waren wilde Zeiten... Raquel und Bill waren f&uuml;r 
uns nat&uuml;rlich eine gro&szlig;e Chance, unseren Amiga am Leben zu erhalten. Das 
schlimmste, was passieren konnte, war wirklich, dass Herr Hembach die 
restlichen Amigainventuren als Konkursmasse verschleudert. Gott sei Dank 
konnte ich ihn davon abhalten... Anfangs arbeiteten wir, das hei&szlig;t Axel 
Kr&auml;mer, Andreas Steep und ich ohne Gehalt und ohne Zukunft. Bill Buck und 
Raquel Valesco waren zusammen mit unserem geliebten Amiga eine gro&szlig;e 
Zukunftshoffnung.... Und als Bill Buck und Raquel unsere Geh&auml;lter 
&uuml;bernahmen, war die Welt wieder fast in Ordnung... Leider zog am Ende 
VisCorp nicht mit. Eines Tages tauchte dann zu guter Letzt und als Retter 
in der Not Gateway auf, der uns dann &uuml;bernahm. H&auml;tte VisCorp damals auf 
Raquel Valesco und Bill Buck geh&ouml;rt, w&auml;ren sie meiner Meinung nach nicht in 
Konkurs gegangen und AMIGA w&auml;re heute ein nicht mehr wegzudenkender Player 
in der Computer-Industrie. 

amiga-news.de: Bill, in Ihrem Kommentar merkten Sie an, dass Almathera 
Systems Ltd. unter merkw&uuml;rdigen Umst&auml;nden geschlossen wurde. Bitte erkl&auml;ren 
Sie das. 

Thendic France: So haben wir das nicht gesagt. Wir sagten, dass, so wie wir 
sie zur der Zeit verstanden haben, deren Entscheidung darin bestand, das 
Gesch&auml;ft aufzugeben, weil der Amiga-Markt zu klein geworden war. Der Markt 
war nicht gro&szlig; genug, um ihre T&auml;tigkeit zu tragen und sie machten eine 
Gesch&auml;ftsentscheidung, die Firma zu schlie&szlig;en. 

amiga-news.de: Bill, Sie haben auf ANN eine E-Mail von Fleecy Moss an Sie 
ver&ouml;ffentlicht. Unserer Meinung nach ist das nicht professionell. Was 
versprechen Sie sich davon? 

Thendic France: Ich habe das nicht gemacht. Fleecy und ich haben uns 
deswegen danach per E-Mail ausgetauscht und die Geschichte unter uns 
gekl&auml;rt. Mit Fleecy´s Worten war es: "Ein bedauerlicher Vorfall". Wir sehen 
es auch so. 

amiga-news.de: Bill Buck (Thendic France), seit wann arbeiten Sie mit Petro 
Tyschtschenko (Power Trading) zusammen? 

Thendic France: Raquel und ich arbeiteten mit Petro zum ersten Mal 1995 
direkt zusammen, als VisCorp Verhandlungen &uuml;ber ein Lizenzabkommen mit 
Escom begann. Als die Lizenz-Vereinbarung unterschrieben war, zahlte 
VisCorp und Escom erhielt Tantiemen im Wert von $650.000 im Voraus. 
Allerdings hatte ich Petro schon zuvor bei dem Konkurs von CBM (Commodore 
Business Machines, Anm. des &Uuml;bersetzers) getroffen. Manfred Schmidt, 
Firmengr&uuml;nder und Gesch&auml;ftsf&uuml;hrer von ESCOM, und ich sa&szlig;en auf der 
Gl&auml;ubigerveranstaltung beinander. ESCOM und VisCorp waren Partner. ESCOM 
w&auml;re mit 7% an VisCorp beteiligt gewesen, und h&auml;tte ED (Settop-Box, Anm. 
des &Uuml;bersetzers) europaweit vertrieben, w&auml;ren sie nicht in Konkurs 
gegangen. Es war ein guter Plan. Man schaue nur, wieviele Firmen und 
Einzelpersonen sich sp&auml;ter daran versuchten, dasselbe umzusetzen! Im Laufe 
der Zeit holte Microsoft ungl&uuml;cklicherweise auf, erwarb WebTV f&uuml;r mehrere 
hundert Millionen Dollar und warf es auf den Markt. Das AmigaOS h&auml;tte in 
Verbindung mit einer Settop-Box WebTV &uuml;berragt. Man erinnere sich, Paul 
Allen war einer der Anteilseigner von VisCorp. Wer wei&szlig;, was eine Internet-
XBOX heutzutage oder besser noch, schon fr&uuml;her, h&auml;tte sein k&ouml;nnen!... :) 
Amiga-Entwickler h&auml;tten Zugang zu einem gigantischen Markt gehabt haben! 

amiga-news.de: Bill, wann kam die Idee auf, mit bPlan zusammenzuarbeiten? 

Thendic France: Wir bewunderten schon immer ihr technisches Verst&auml;ndnis und 
f&uuml;hrten mit ihnen 1996 erste Gespr&auml;che, kontaktierten jedoch etwas sp&auml;ter 
im Jahr 2000 schlie&szlig;lich Gerald direkt im Anschluss an die Amiga-Messe in 
K&ouml;ln. Wir lernten ihn sehr zu sch&auml;tzen. Ralph und Thomas sind ebenso 
exzellente Techniker und Ingenieure. Jeder von ihnen hat einzigartige 
St&auml;rken. Wir sind stolz darauf, mit ihnen zu arbeiten. Wir m&ouml;gen sie. 

amiga-news.de: Wie sieht diese Zusammenarbeit bPlan genau aus? 

Thendic France: 
1. Wir wollen, dass der Pegasos erfolgreich wird. 
2. Wir promoten das Produkt f&uuml;r verschiedenen M&auml;rkte, die Bedarf an PPC-
basierter Hardware haben. 
3. Wir m&ouml;chten, dass bPlan den Pegasos f&uuml;r uns miniaturisiert, um den 
Eclipsis herzustellen. 
4. Wir denken, dass MorphOS ein einzigartiges und ausgereiftes OS ist. 
5. Wir wollen, dass Pegasos die Entwicklungsmaschine f&uuml;r den Eclipsis wird. 

amiga-news.de: Als was f&uuml;r ein Ger&auml;t ist der Eclipsis gedacht (Subnotebook 
oder PDA) und welche CPU werden Sie nutzen? 

Thendic France: Dies ist ver&ouml;ffentlicht worden und steht online auf unserer 
Eclipsis-Seite. (Anm. der Redaktion: Eclipsis soll ein kleines Ger&auml;t 
(Device) f&uuml;r ein Handheld werden, welches den vorhanden Kundenw&uuml;nschen nach 
Mobilit&auml;t zum Durchbruch verhelfen wird.) Sie werden desweiteren bemerken, 
dass sich die neuesten Versionen der Gx-Prozessorfamilie auch am niedrigen 
Stromverbrauch orientieren, der durch den Mobil-Markt verlangt wird. Dies 
ist ein Wachstumsmarkt und dies ist ein neuer Absatzmarkt. Nat&uuml;rlich k&ouml;nnte 
Eclipsis auch f&uuml;r einen Laptop angepasst werden. Wir planen eine Eclipsis-
Basisstation, so dass das Paket zusammen in einem Laptop untergebracht 
werden kann. Laptopverk&auml;ufe sind st&auml;rker als Desktopverk&auml;ufe in der 
heutigen Welt. 

amiga-news.de: Welche Einsatzm&ouml;glichkeiten (Applikationen) soll er bieten? 

Thendic France: Alles! Selbstverst&auml;ndlich wird das auch ein Problem, weil 
Sie dem Verbraucher auf unkomplizierte Weise erkl&auml;ren m&uuml;ssen, was das 
Eclipsis ist. Dieses ist die Herausforderung. Hier die grundlegende 
Meldung: Wir m&ouml;chten den Leuten die Gelegenheit geben, das, was sie heute 
schon tun, auf eine bessere, bequemere Weise zu tun, mit mehr Spa&szlig; und das 
&uuml;berall. Das ist es. 

amiga-news.de: Wie sind die Abmessungen von Eclipsis? 

Thendic France: So klein wie irgend m&ouml;glich!...:) 

amiga-news.de: Was ist Ihr Ziel, wo sehen Sie Ihre gro&szlig;e Erfolgschance? 

Thendic France: Langfristig im mobilen Handheld-Markt. Dies ist ein 
wachsender Markt, und Mobilit&auml;t ist der Schl&uuml;ssel dazu, wobei unser 
Schwerpunkt bei Kommunikation und Unterhaltung liegt. Aber dennoch werden 
wir in der Zwischenzeit alle unsere Produkte verkaufen. Wir sind in einer 
Reihe von wachsender und profitreichen Gesch&auml;ften involviert. 
Das bedeutet, jeder kann einen Pegasos kaufen und dann damit machen, was 
auch immer er will. 

amiga-news.de: Bill, seit wann sind Rakesh ind Sharwin Raghoebardayal, 
besser bekannt als Coyote Flux im Boot? 

Thendic France: Die Zusammenarbeit mit Coyote Flux begann im Dezember 2000. 

amiga-news.de: Ist Coyote Flux nach Paris &uuml;bergesiedelt, um bei den bPlan 
Produkten zu helfen? 

Thendic France: Haupts&auml;chlich ja, aber die beiden haben auch noch andere 
Produkte entwickelt, inklusive der JMiner professional photogrammetry 
software und der i-Cam sowie Tri-Cam viewing software, woran gro&szlig;es 
Interesse besteht. Die i-Cam ind die Tri-Cam (eine Version von der ComCam) 
sind gro&szlig;artige Produkte, die auch auf PowerPC laufen. 

Wir bauen die ComCams f&uuml;r unsere Distributionsbereiche bei Cobra Electronic 
GmbH in Ingolstadt, Deutschland. Sie fertigen auch die xTri-Cam. Sharwin 
und Rakesh waren da eine gro&szlig;e Hilfe, indem sie mit den Cobra-Ingenieuren 
zusammen arbeiteten, um sicherzustellen, dass unsere ComCams perfekt sind. 

Ach ja, der CEO von ComCam ist Don Gilbreath, der ehemalige VisCorp CTO und 
ein fr&uuml;herer CBM CD32 Projekt-Manager. ComCam hat eine gro&szlig;e Zukunft, und 
wir sind froh, wieder mit Don zu arbeiten. Carolyn Scheppner ist ebenfalls 
bei ComCam. Carolyn hat einiges f&uuml;r VisCorp programmiert, aber sie ist eher 
bekannt durch ihre Arbeit am CATS-Projekt bei CBM. Thendic-France ist 
Exklusiv-Distributor der ComCam Produkte in Europa, der ehemaligen 
Sowjetunion und Indien (wo Petro bald ein gro&szlig;es erfolgreiches Projekt 
ank&uuml;ndigen wird!). Ebenso sind wir der weltweite ComCam-Distributor f&uuml;r die 
Flugzeug-Industrie. Da gibt es schon einige ComCams in sehr interessanten 
Lokalit&auml;ten....:) 

amiga-news.de: Was genau sind die Titel und die Aufgaben von Rakesh und 
Sharwin? 

Thendic France: Wir halten nicht viel von Titeln. In einfachen S&auml;tzen: 
Rakesh sieht sich nach den besten Applikation f&uuml;r die Ger&auml;te, 
Fehlerbeseitigung und Pr&uuml;fung um. Rakesh ist die kreative Person und hat 
au&szlig;erdem einen wichtigen Forschungsbeitrag bez&uuml;glich der Urheberrechte bei 
der P2P Kommunikation und dem Datenaustausch &uuml;ber das Internet geleistet. 
Sharwin schreibt Code und bringt diesen auf dem Produkt zum Laufen, damit 
das Produkt das tut, was wir m&ouml;chten. Zusammen machen sie eine Menge 
Sachen, die der Firma helfen, neue Einkommensquellen zu erschlie&szlig;en, und 
erfolgreich eine Menge Sachen zu implementieren, die unsere Kunden 
sch&auml;tzen. Sie leisten beide harte Arbeit und sind talentiert. Wir sch&auml;tzen 
sie au&szlig;erordentlich -- obwohl wir Sharwin sagten, dass er seinen Hut in 
Holland lassen soll (http://www.coyoteflux.tmfweb.nl/ dann auf "Contract" 
klicken ...:) 

amiga-news.de: Warum halten Sie das Pegasos-Board f&uuml;r eine gute L&ouml;sung? 

Thendic France: Es l&auml;uft sehr schnell. Es ist skalierbar. Es ist 
erweiterbar. Der Pegasos gibt uns etwas, auf dem wir eine gro&szlig;e Zukunft 
aufbauen k&ouml;nnen. Wir freuen uns auf die bald kommenden G4e Muster von 
Motorola. 

Aus Ingenieurperspektive gesehen, sind die besten Indikatoren von der 
gesamten Entwicklungsqualit&auml;t des Pegasos am besten durch einen ehemaligen 
Siemens Vizepr&auml;sidenten zusammengefasst, der uns sagte: "Das ist das beste 
Dritthersteller Hardware-, Software- und Dokumentations-Paket, was ich 
jemals in 30 Jahren gesehen habe". 

amiga-news.de: Es gibt immer wieder Ger&uuml;chte zur rechtlichen Lage von 
MorphOS. Einige Leute (z.B. Ben Hermans von Hyperion, Fleecy Moss von Amiga 
Inc. und vielleicht auch Bill McEwen von Amiga Inc.) denken, dass MorphOS 
kein Recht hat, verkauft zu werden, weil geistiges Eigentum von Amiga Inc. 
enthalten sei. Wenn Sie sich entscheiden, dass Sie nicht mit Amiga Inc. 
arbeiten (sei es nun, weil Sie nicht k&ouml;nnen oder wollen, oder sei es, weil 
Amiga Inc. nicht kann oder will), sind Sie dennoch bereit, Pegasos mit 
MorphOS auf der Markt zu bringen? 

Thendic France: Wir werden die Produkte herausbringen und bewerben, ob da 
eine Zusammenarbeit mit Amiga Inc. ist oder nicht. Sie haben ihre 
grunds&auml;tzliche Richtung mit AmigaDE gew&auml;hlt. Gro&szlig;artig. Wir haben versucht, 
mit ihnen zu arbeiten, aber wir wollen das tun, was wir wollen - und nicht 
das, was sie uns zwingen wollen zu tun. Es w&auml;re wundervoll, wenn wir 
zusammenarbeiten k&ouml;nnten, aber das ist keine Vorbedingung f&uuml;r uns, um 
vorw&auml;rts zu kommen. Wir w&uuml;rden gerne mit Amiga zusammenarbeiten. Wir 
(Thendic-Germany) waren die erste Organisation, die eine AmigaDE-Lizenz 
erreichte (unsere Anw&auml;lte entwarfen die Lizenz-&Uuml;bereinkommen), und wir 
w&uuml;rden gl&uuml;cklich sein, unsere gegenw&auml;rtige Lizenz auszuweiten - und 
Tantiemen vorzuschie&szlig;en - aber wir k&ouml;nnen sie ungl&uuml;cklicherweise nicht dazu 
bewegen, die Dinge aus unserer Sicht zu sehen. Amiga geh&ouml;rt ihnen, das ist 
ihr Recht. Wir gehen auf jeden Fall vorw&auml;rts. 

amiga-news.de: Wie sch&auml;tzen Sie pers&ouml;nlich die rechtliche Lage von MorphOS 
ein? 

Thendic France: Nun, wir haben die rechtlichen Fragen seit ein paar Monaten 
untersucht und haben jemand ausdr&uuml;cklich die Akten f&uuml;r Europa vorbereiten 
lassen. Wie wir alle wissen, werden rechtliche "Fragen" letztendlich in 
einer geeigneten Rechtsprechung entschieden - und die ist nicht im 
Internet. Wir denken, es gibt keine rechtlich schwierigen Aufgaben und es 
werden nat&uuml;rlich auch keine rechtlich schwierigen Aufgaben da sein, wenn 
wir einmal ein fertiges Produkt haben. Wenn jedoch jemand gegens&auml;tzlicher 
Meinung sein sollte, werden wir vorbereitet sein, und den n&ouml;tigen 
finanziellen Hintergrund haben, um einen Rechtsstreit durchstehen zu 
k&ouml;nnen. Wir glauben nicht, dass es irgendwelche ernsthaften Schwierigkeiten 
geben wird, sobald die Dinge deutlich werden, werden alle diese "Ger&uuml;chte" 
verstummen. 

Wenn ich Amiga w&auml;re, w&uuml;rde ich niemandem mit einer rechtlichen Verbindung 
zu Amiga Inc. erlauben, diese speziellen Fragen &ouml;ffentlich online zu 
diskutieren. Bill oder Fleecy sollten es tun, wenn sie denken, dass es 
notwendig ist. Jeder andere verdirbt ihnen die Sache. Wir wissen ganz 
genau, was sie jetzt denken und wie falsch informiert sie sind. Das wird 
ihnen nicht helfen, wenn die Lage schlechter wird. Es ist wiklich eine 
Schande. Bill und Fleecy verdienen aufgrund ihrer anf&auml;nglichen Leistungen 
wahrlich mehr Erfolg, als was bislang dabei herausgekommen ist. Diese 
"Ger&uuml;chte" helfen ihnen nicht, sondern trennen sie in Wirklichkeit genau 
von den Leuten, die sie anlocken wollten. 

amiga-news.de: Bill, hat Thendic-France etwas mit Thendic.de zu tun? 

Thendic France: Ja, sie sind im Besitz der selben Aktion&auml;re, wenn auch in 
unterschiedlichen Anteilen (n&auml;heres auf der &Uuml;ber Pretory Seite). Raquel ist 
die Vorstandsvorsitzende von Pretory und die gr&ouml;&szlig;te Einzelaktion&auml;rin. Ich 
sollte erw&auml;hnen, dass Helmut Jost seit 1997 Anteilseigner von Pretory war 
und zurzeit ein wichtiger Manager bei Thendic Deutchland ist. 1996 wurde 
Helmut Jost von den Banken bei Escom eingesetzt, als Manfred Schmidt gehen 
musste. Helmut war auch der Hauptgesch&auml;ftsf&uuml;hrer von Commodore Deutschland, 
als Commodore Deutschland allein f&uuml;r &uuml;ber 500 Millionen $ in den j&auml;hrlichen 
CBM Eink&uuml;nften Anfang der 90er Jahre verantwortlich war. Helmuts Forderung 
war seine Idee, den Amiga &uuml;ber Superm&auml;rkte zu verkaufen. CBM war der 
meistverkaufte Rechner in Deutschland und Helmut hatte viel damit zu tun 
(genau wie Petro!). Er war ebenso f&uuml;r PC-Verk&auml;ufe im europ&auml;ischen Markt, 
bei IBM und sp&auml;ter Fujitsu, t&auml;tig. Wir denken, dass er uns eine grosse 
Hilfe sein wird, den Pegasos erfolgreich zu machen, und er hat bereits eine 
Menge exzellenter Ideen ins Spiel gebracht. Helmut kam 1999 zu Thendic. 

amiga-news.de: was wurde aus dem angek&uuml;ndigten SmartBoy? 

Thendic France: Das wurde in dem Schreiben auf der Thendic-France Webseite, 
das nun auch auf amiga-news.de nachgelesen werden kann, angesprochen. Dazu 
eine Zeile: Wir konnten aufgrund der Kosten des Erwerbs der Marktbasis f&uuml;r 
Komponenten mit den Gro&szlig;en in der ARM- und CE-Umgebung nicht mithalten. F&uuml;r 
den Fall, dass sich jemand findet, der diese Entwicklung kaufen m&ouml;chte, 
halten wir entsprechende Information auf der Thendic-Deutschland Website 
bereit ...:) 

Ein weiteres wichtiges Anliegen... 

Ich m&ouml;chte auch erw&auml;hnen, dass Dr. Allan Havemose in unserem Team ist. 
Allan, der gerade (14. April 2002) zum ersten Mal stolzer Vater geworden 
ist, war bei CBM Direktor der Entwicklungsabteilung f&uuml;r Software, 
verantwortlich f&uuml;r die Betriebssysteme Amiga OS 2.1, OS 3.0 und OS 3.1 auf 
A1200, A3000, A4000, AmigaCD und verschiedene andere Plattformen.
 
Wie sie wissen, war Allan seinerzeit in Gateways Bem&uuml;hungen, den Amiga 
wiederzubeleben, involviert. Allan entwickelt die Java VM-Umgebung f&uuml;r den 
Pegasos/Eclisis und wird auch an der Linux-Seite unserer Projekte arbeiten. 
Er bringt professionelle Produktentwicklung und Produktmanagement in unser 
Team. 

amiga-news.de: Petro, worin liegt der Antrieb, dass Sie sich nach wie vor 
mit dem Amiga besch&auml;ftigen? 

Petro Tyschtschenko: Die Idee und die Vision Amiga h&auml;lt mich bis heute in 
Faszination. Was Jay Miner 1980 hier entwickelt hat, ist f&uuml;r mich immer 
noch die ideale Antwort auf die Herausforderung "Computerentwicklung". Seit 
Oktober 1982 habe ich unentwegt f&uuml;r diese Idee mein gesamtes 
Arbeitspotential eingesetzt. Wie oft musste meine Familie darunter leiden? 
Leider wurden in der Vergangenheit immer wieder vom verantwortlichen 
Management Dinge &uuml;bersehen, die Zukunftchancen zunichte machten. Meine 
Hinweise und Ratschl&auml;ge wurden h&auml;ufig nicht geh&ouml;rt..... Mein Antrieb ist 
immer noch meine &Uuml;berzeugung, dass die AMIGA-Vision verwirklicht wird.... 

amiga-news.de: Petro, Sie haben &ouml;fter von Ihrem Buch "Amiga - Mein Leben" 
gesprochen, ist das in Arbeit? 

Petro Tyschtschenko: Die AMIGA-Story ist eine so interessante Geschichte 
aus der Entwicklung der Computerwelt, in der wir heute leben. Ich m&ouml;chte 
meine Kenntnisse aus dieser Zeit gerne der interessierten Computerwelt 
erhalten und &uuml;bermitteln. "Amiga - meine Leben" ist in Arbeit! Hier ein 
kleiner Auszug: "Im Sommer 1982 abends um 19.30 Uhr habe ich mit Harald 
Speyer, dem damaligen Vice President Europa meinen Arbeitsvertrag 
geschlossen." Das war der Start. 

amiga-news.de: Bill, m&ouml;chten Sie noch etwas anderes anmerken? 

Thendic France: Vielen Dank f&uuml;r die Gelegenheit, mich "der Community" 
mitteilen zu k&ouml;nnen. Wir haben ein tolles Gespann aus Mensch und Produkt 
und wir werden die Kr&auml;fte aller Firmen heranziehen, um dem Pegasos und der 
Eclipsis zum Erfolg zu verhelfen. Wir hoffen, dass jeder die Zusammenh&auml;nge 
jetzt besser verstehen wird. 

amiga-news.de: Wir bedanken uns ganz herzlich f&uuml;r Ihre offene 
Gespr&auml;chsbereitschaft und w&uuml;nschen Ihnen viel Erfolg bei Ihren Gesch&auml;ften. 


Kotaktinformationen:

Thendic France 
182 rue des Pyrénées
F - 75020 Paris 

http://www.thendic-france.com/Information 

Tel : +33 (0)1 43 66 28 00 
Fax : +33 (0)1 43 66 28 55 


Power Trading GmbH
Robert-Bosch-Str. 11b 
D - 63225 Langen 

http://www.power-trading-gmbh.com/Information 

Tel. +49 (0) 6103 58785
Fax +49 (0) 6103 587888


bplan GmbH
Georg-Wolff-Str. 8 
D - 60439 Frankfurt am Main 

http://www.bplan-gmbh.de/Information«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
