<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Neuigkeiten von IOSPIRIT

IOSPIRIT (http://www.iospirit.de) informiert:

  »24.04.2002 VHI-Treiber f&uuml;r USB-Digitalkameras und -Webcams
   ----------------------------------------------------------------------
   Wir freuen uns, Ihnen die baldige Verf&uuml;gbarkeit von VHI-Treibern f&uuml;r
   USB-Digitalkameras und -Webcams ank&uuml;ndigen zu k&ouml;nnen.

   Damit wird es schon bald m&ouml;glich sein, auch neuere Kamera-Modelle mit
   dem ganzen Komfort von VHI Studio zu betreiben, welcher weit &uuml;ber das
   simple Auslesen der Bilder hinausgeht. Im Gegensatz zu handels&uuml;blichen
   USB-Kartenleseger&auml;ten kommuniziert VHI Studio &uuml;ber den VHI-Treiber
   direkt mit den Kameras. Angefangen bei der Erstellung von
   Zeitrafferanimationen &uuml;ber die Nutzung der Digitalkamera als Webcam
   und der &Auml;nderung von internen Kamera-Einstellungen &uuml;ber eine
   komfortable Oberfl&auml;che bis hin zu weitreichenden
   Korrekturm&ouml;glichkeiten und schnellen Bildvorschauen er&ouml;ffnen sich f&uuml;r
   den Anwender ganz neue Nutzungs- und Einsatzm&ouml;glichkeiten.

   Unterst&uuml;tzte USB-Webcams werden wie eine Videokarte in VHI Studio
   behandelt werden.

   Wir haben in den vergangen Wochen den VHI-Standard f&uuml;r USB erweitert
   und die notwendigen Anpassungen in VHI Studio vorgenommen. Da sich die
   Etablierung mindestens zweier von der API her inkompatibler USB-Stacks
   (Poseidon von Chris Hodges (f&uuml;r Highway/Subway, MorphOS, ggf. auch
   Amithlon) und der im AmigaOS 4.0 Enthaltene) am Markt abzeichnet,
   haben wir au&szlig;erdem eine vom USB-Stack unabh&auml;ngige Zwischenschicht (mit
   dem Namen IOUSB) entwickelt, die die Lauff&auml;higkeit auf verschiedenen
   Systemen sicherstellen wird.

   Dank einer engen Kooperation mit E3B (Hardware der Highway/Subway) und
   Chris Hodges (Autor von Poseidon) ist die Unterst&uuml;tzung f&uuml;r Poseidon
   bereits fertiggestellt. Eine Erweiterung von IOUSB um die
   Unterst&uuml;tzung f&uuml;r AmigaOS 4.0 wird zum Zeitpunkt der Fertigstellung
   von AmigaOS 4.0 (und des darin enthaltenen USB-Stacks) vorgenommen.
   Wir stehen bereits mit dem AmigaOS 4.0-Entwicklerteam in Kontakt, so
   dass angepasste Treiber zur Markteinf&uuml;hrung bei uns verf&uuml;gbar sein
   sollten.

   Der erste Treiber f&uuml;r die Kodak&#174;-Digitalkamera-Modelle DC 240, DC 280,
   DC 3400 und DC 5000 befindet sich gegenw&auml;rtig im abschlie&szlig;enden
   Betatest mit Poseidon.

   F&uuml;r welche Ger&auml;te au&szlig;erdem Treiber entwickelt werden, werden wir von
   der allgemeinen Nachfrage abh&auml;ngig machen. Wir haben daher eine kleine
   Umfrage erstellt und w&uuml;rden uns &uuml;ber eine rege Beteiligung sehr
   freuen.

   Zur Umfrage: http://www.iospirit.de/poll/index.php?poll_id=1

-- 
IOSPIRIT Felix Schwarz
Am Gr&uuml;ndla 3
D-91074 Herzogenaurach
Germany

EMail: info@iospirit.de
WWW:   http://www.iospirit.de/
Phone: +(0)049 (0)9132/732844
Fax:   +(0)049 (0)9132/732843«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
