<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Workshop: Anti-Spam mit YAM (von Christian Aichinger)

E-Mail ist toll! Elektronische Briefe an Freunde, Bekannte oder Verwandte 
kosten so gut wie nichts und sind im Allgemeinen innerhalb von Sekunden am 
Ziel. Auch Einladungen, Rundschreiben und Diskussionsbeitr&auml;ge werden 
normalerweise in Nullkommanix verteilt und erreichen den Menschen am 
anderen Ende der Leitung im besten Fall sofort. Doch genauso viel 
Anziehungskraft wie auf normale Internet-Anwender haben all diese Vorteile 
von E-Mails auch auf jene, die versuchen, mit Werbung und omin&ouml;sen 
Angeboten das schnelle Geld zu machen; werden doch die Kosten f&uuml;r eine 
umfangreiche E-Mail-Werbekampagne zum gr&ouml;&szlig;ten Teil von den Empf&auml;ngern 
getragen (n&auml;mlich mittels derer Telefonrechnung). Geringe (bis keine) 
Investitionen und gr&ouml;&szlig;tm&ouml;glicher Gewinn locken so manchen "Gesch&auml;ftsmann", 
der die eigenen Kosten sogar so weit minimiert, als dass er zum Versenden 
seiner Spam-Mails den Internetzugang des Arbeitgebers verwendet und mit 
Hilfe von Robots (kleine Programme, die das Internet systematisch 
durchforsten) seine E-Mail-Datenbest&auml;nde automatisch erweitern l&auml;sst.

In letzter Zeit wurde es mir jedenfalls endg&uuml;ltig zuviel mit Download-
Angeboten f&uuml;r "100%ig kostenlose Sex-Software", d&uuml;mmlichen Kettenbriefen 
und "hei&szlig;en Sonderangeboten" von Firmen, deren Name ich noch nie zuvor 
geh&ouml;rt habe. Einige Absender waren sogar so unversch&auml;mt, mir ihren 
gehaltlosen M&uuml;ll gleich drei- bis viermal hintereinander zu schicken. Zum 
Teil ging es soweit, dass von zehn E-Mails f&uuml;nf ungelesen in den M&uuml;ll 
wanderten, spricht doch allein schon das Betreff-Feld der meisten Spam-
Mails eine eigene Sprache ("Software f&uuml;r Dich!", "LADIES earn money for 
college, vacation, car, new house!", "Top Verdienstm&ouml;glichkeit ! ! ! ...", 
usw.). Doch meinen alten E-Mail-Account aufgeben? Nein, dazu hatte ich nun 
auch keine Lust - ist es au&szlig;erdem nur eine Frage der Zeit, bis wieder das 
alte Spam-Aufkommen auf einem neuen Account erreicht werden w&uuml;rde.


Defensive

Eine goldene Regel zur Bek&auml;mpfung von Spam lautet: Antworte niemals auf 
solche Mails! Mal ganz abgesehen davon, dass die eigene Telefonrechnung 
durch eine Antwort auf Spam ein weiteres Mal sinnlos beansprucht wird, 
erh&auml;lt der Spam-Versender durch eine Antwort auf sein Angebot die 
Verifizierung eines g&uuml;ltigen E-Mail-Accounts. F&uuml;r ihn ist ein g&uuml;ltiger E-
Mail-Account bares Geld wert, kann er doch nun diese E-Mail-Adresse an 
andere Spammer weiterverkaufen (man mag es kaum glauben, aber damit wird 
tats&auml;chlich Geld verdient) und/oder seine Aktivit&auml;ten auf diese Adresse 
versch&auml;rfen. Die Folge f&uuml;r den Anwender: Das Spam-Aufkommen w&auml;chst, anstatt 
zu schrumpfen.
Aber was bleibt dem entnervten Anwender als Antwort auf Spam &uuml;brig? - Nun, 
zum einen kann man "aufgeben", sprich, sich einen neuen E-Mail-Provider
suchen und den alten E-Mail-Account abschalten lassen. Die neue E-Mail-
Adresse an den Bekannten- und Verwandtenkreis weiterzugeben ist in dem Fall 
kein so gro&szlig;es Problem, doch falls der Anwender in mehreren Mailinglisten 
eingetragen ist oder die Dienste eines kommerziellen E-Mail-Providers in 
Anspruch nimmt, artet so eine Adress&auml;nderung meistens schon in "richtige 
Arbeit" aus, die man sich als Benutzer von YAM auch sparen kann. Zum 
anderen kann man sich auch von vornherein einen E-Mail-Provider suchen, der 
es &uuml;ber sein Webinterface erm&ouml;glicht, einen Spam-Filter einzubauen. Als 
Beispiel sei hier GMX (http://www.gmx.de) genannt. Wenn der E-Mail-Provider 
solch ein Feature nicht unterst&uuml;tzt sieht es d&uuml;ster aus, oder? Nicht ganz!


Born to Kill

Die L&ouml;sung lautet "Killfile", oder in der gem&auml;&szlig;igteren YAM-Formulierung 
ausgedr&uuml;ckt: "Remote-Filter". Diese Filter-Form durchsucht vor dem Holen 
der E-Mails alle Mailheader (und nur die Mailheader) nach frei w&auml;hlbaren 
Header-Schl&uuml;sselworten (wie z.B. das "From:"-Schl&uuml;sselwort, das &uuml;ber die
Absender-Adresse Auskunft gibt). Dazu muss allerdings der optionale "TOP"-
Befehl vom verwendeten POP3-Server (POP3: Post Office Protocol V3; das 
heutzutage &uuml;bliche Protokoll zur Verwaltung des "E-Mail-Briefkastens") 
unterst&uuml;tzt werden.
Wie gesagt, dieser Befehl ist optional und muss nicht von jedem POP3-Server 
zur Verf&uuml;gung gestellt werden. Ob der eigene E-Mail-Account nun "Remote-
Filter"-f&auml;hig ist, l&auml;sst sich demnach nur nach dem Motto "Versuch macht 
kluch" in Erfahrung bringen, es sei denn, der E-Mail-Provider weist 
definitiv auf diese Eigenschaft hin (was nat&uuml;rlich auch keine 
hundertprozentige Garantie f&uuml;r eine korrekte Funktion sein muss).


E-Mail-Analyse

Um ein halbwegs effektives Killfile aufzubauen, ben&ouml;tigt man als erstes
nat&uuml;rlich die E-Mail-Adressen derjenigen, die sich in den Augen des 
Anwenders besonders als Spammer hervorzeichnen. Am besten durchsucht man 
dazu das Postfach "Deleted" nach &auml;lteren Spam-Mails. Hat man nun solch eine 
Mail gefunden, muss nur noch die E-Mail-Adresse des Absenders gefunden und 
in einer externen Textdatei eingetragen werden. Es k&ouml;nnen nat&uuml;rlich mehrere 
E-Mail-Adressen in diese Datei aufgenommen werden, oder aber auch nach ganz 
anderen Merkmalen (E-Mail-Provider ["@yahoo.com" und "@msn.com" werden sehr 
gern von Spammern verwendet], Teilketten mit AmigaDOS-Dateimustern, etc.) 
gesucht werden. Jedoch sollte beachtet werden, dass, je mehr Parameter in 
der Dateifilterung Verwendung finden, desto l&auml;nger auch die Analyse aller 
E-Mails vor dem Abholen dauert. Demzufolge sollten nur die wichtigsten 
Merkmale einer solchen E-Mail in das Killfile aufgenommen werden. Gegen 
Spam-Mail hilft im Allgemeinen schon das "From"- oder auch "To"-
Schl&uuml;sselwort (also die Absender- bzw. Empf&auml;ngeradresse). Sinnvollerweise 
sollte diese Textdatei im YAM-Verzeichnis mit einem logisch 
nachvollziehbaren Namen angelegt werden. Mein Killfile nennt sich zum 
Beispiel "Remote-Filter.txt".
Au&szlig;erdem habe ich der Datei ein Project-Icon verpasst, dessen Tooltype zu 
einem Texteditor verweist. Das Hinzuf&uuml;gen von weiteren Spam-Adressen ist so 
relativ schnell erledigt. Auch ein kleines ARexx-Skript, das das Einf&uuml;gen 
von E-Mail-Adressen direkt aus YAM in diese Datei erledigt, sollte kein 
wirklich schwieriges Problem darstellen. Falls ich Zeit finde, wird das 
Skript bis zur n&auml;chsten Ausgabe nachgeliefert.


Filter stricken

Der Remote-Filter wird im Konfigurationsfenster von YAM erstellt. Dazu wird 
im Men&uuml; "Einstellungen" der Punkt "Konfiguration" angew&auml;hlt. In der linken 
Liste des nun erscheinenden Fensters wird das Feld "Filter" (4. Position 
von oben) selektiert. Daraufhin erscheinen im rechten Teil des Fensters die
Filteroptionen. Ein Mausklick auf "Neu" erzeugt einen neuen Filter. Damit 
dieser als Remote-Filter funktioniert, muss auch das H&auml;kchen "Remote-
Filter" gesetzt werden, das auf der rechten Seite unter dem Reiter 
"Optionen" zu finden ist. Die Namenswahl unterliegt der Entscheidung des 
Anwenders - "Killfile" d&uuml;rfte allerdings recht naheliegend sein.

Screenshot:
<IMG SRC="../extra/yamspam1.png" ALT="Screenshot">

Als n&auml;chstes m&uuml;ssen die Werte definiert werden, die eine E-Mail nach 
Meinung des Anwenders als Spam auszeichnet. Unter dem Reiter "Vergleich" 
gibt es nun die M&ouml;glichkeit, zwei Suchkriterien zu definieren, die mit 
einem logischen Operator ("und", "oder", "exklusives oder") verkn&uuml;pft 
werden k&ouml;nnen. F&uuml;r den Anfang begn&uuml;gen wir uns mit nur einem Suchkriterium, 
n&auml;mlich der "From-Zeile". Dazu wird das Cycle-Gadget "Suchen in" auf "From-
Zeile" und das direkt darunter befindliche Cycle-Gadget (also die Art des 
Vergleichs) auf "IN" gestellt. "IN" bedeutet &uuml;brigens, dass die Suchmuster 
aus einer externen Textdatei entnommen werden. Und hier kommt das vorher 
angelegte Killfile mit den Spam-Absenderadressen ins Spiel. Der Name der 
Datei muss in das Texteingabefeld neben "IN" eingetragen werden. Dazu kann 
auch ein Dateirequester verwendet werden, der mit dem Knopf gleich rechts 
neben dem Texteingabefeld aufgerufen werden kann.

Screenshot:
<IMG SRC="../extra/yamspam2.png" ALT="Screenshot">

Nachdem alles eingestellt wurde, muss noch festgelegt werden, was mit den 
Mails, die diesem Suchkriterium entsprechen, geschehen soll. Da es sich 
dabei um Spam handelt, k&ouml;nnen solche Mails ruhig auf dem E-Mail-Server 
bleiben und gleich dort gel&ouml;scht werden. Dazu wird der Reiter "Aktion" 
aufgerufen und die beiden untersten H&auml;kchen "L&ouml;schen" und "Nicht 
runterladen" gesetzt. Mit einem Klick auf "Speichern" w&auml;re ein 
grundlegender Spam-Filter erstellt.

Erfahrenere Anwender k&ouml;nnen die Suchkriterien f&uuml;r Spam-Mails wie erw&auml;hnt 
mit einer logischen Verkn&uuml;pfung zus&auml;tzlich verfeinern. Zum Teil werden E-
Mail-Adressen von Spam-Versendern in regelrechten Spam-Mailinglisten (wie 
z.B. Yahoogroups, was allerdings laut deren AGBs nicht erlaubt ist) 
verwaltet bzw. verschickt. Die eigene E-Mail-Adresse ist dann in so einer 
Mailingliste eingetragen, obwohl man davon &uuml;berhaupt nichts wei&szlig;, 
geschweige denn sein Einverst&auml;ndnis dazu gegeben hat. In so einem Fall kann 
es sinnvoll sein, auch die "To"-Zeile einer E-Mail auf eine entsprechende 
E-Mail-Adresse bzw. die dort eingetragene Mailinglisten-Bezeichnung 
("Freunde", "Kontaktanzeige") &uuml;berpr&uuml;fen zu lassen. Dazu wird das mittlere 
Cycle-Gadget (das jetzt noch auf "nicht verkn&uuml;pfen" stehen sollte) auf 
"oder" und das zum zweiten Suchkriterium geh&ouml;rige "Suchen in"-Cycle-Gadget 
auf "To-Zeile" gestellt. Der Vergleichsoperator wird wie beim ersten 
Suchkriterium auf "IN" gesetzt, um die Suchmuster einer externen Textdatei 
entnehmen zu k&ouml;nnen. Diese externe Textdatei kann entweder wieder die 
gleiche wie beim ersten Suchkriterium sein, in der dann aber zus&auml;tzlich 
auch die zu filternden "To"-Adressen eingetragen werden m&uuml;ssen, oder man 
erstellt eine weitere Textdatei (ein weiteres "Killfile"), in der dann 
ausschlie&szlig;lich "To"-Adressen verzeichnet sind.

Screenshot:
<IMG SRC="../extra/yamspam3.png" ALT="Screenshot">

Der erste Fall ist nur f&uuml;r bequemere Zeitgenossen geeignet, da im zweiten 
Fall eine zus&auml;tzliche Datei verwaltet werden muss, daf&uuml;r aber der 
eigentliche Vergleich der Mail-Header auf dem Server schneller vonstatten 
geht und demzufolge das "Post holen" mit "schmalbandigen" 
Internetverbindungen nicht zur Kaffeepause ausartet.


Kampf gegen Windm&uuml;hlen

Leider hat die Remote-Filter-Methode auch eine entscheidende Schwachstelle, 
die den Kampf gegen Spam zur Sisyphus-Arbeit ausufern lassen kann: Da es
unz&auml;hlige E-Mail-Weiterleitungs-Angebote, Anonymisier-Dienste, kostenlose 
E-Mail-Provider und zu allem &Uuml;berdruss auch noch Programme gibt, die es dem 
Spammer erm&ouml;glichen, seine wahre Identit&auml;t - besser gesagt E-Mail-Adresse - 
zu verbergen, ist es nahezu unm&ouml;glich, vor jeder Spam-Mail gefeit zu sein. 
Der Remote-Filter hilft tats&auml;chlich nur gegen Absender, die wenigstens 
einmal ihren M&uuml;ll ins Postfach des Anwenders geschickt haben und von diesem 
auch in das Killfile aufgenommen wurden. Ein weiteres Problem ist, dass es 
nur wenige Spammer gibt, die in ihren Mails eine E-Mail-Adresse zweimal 
verwenden, was das Killfile in k&uuml;rzester Zeit gewaltig anwachsen und 
demzufolge die Filterung vor dem Abholen der Mails enorm verlangsamen 
lassen kann. Wenn es dann irgendwann l&auml;nger dauert, das gesamte 
Postaufkommen nach Spam durchsuchen zu lassen, als alle Mails inklusive 
Spam herunterzuladen, sollte man logischerweise den Remote-Filter ad acta 
legen. Gegen Postings von unliebsamen Mailinglisten-Teilnehmern, Mail-
Bomben und -W&uuml;rmer hilft der Remote-Filter im Allgemeinen aber immer, so 
dass er zumindest bei diesen unerw&uuml;nschten Mails seiner Rolle voll gerecht 
wird.

Christian Aichinger &lt;christian@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
