<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Update: So senkt ihr eure Telekom-Rechnung!

Leicht angezogen haben die Ferngespr&auml;chspreise im April. Nichtsdestotrotz 
pendeln die Geb&uuml;hren aber schon seit einigen Monaten um einen Wert von ca. 
2 Cent. Mit gr&ouml;&szlig;eren Preissenkungen ist in n&auml;herer Zukunft kaum zu rechnen.

Hier nun die aktuelle Tariftabelle:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |        Wohin:  Festnetz -&gt; Festnetz    Festnetz -&gt; Mobilfunknetz
===========================================================================
t&auml;gl. 7-18 Uhr    Telebillig (0190029), 2,0 ct   Telestunt (0190076), 17 ct
t&auml;gl. 18-7 Uhr    Talkline ID (01050), 1,9 ct    Telestunt (0190076), 17 ct

Ortsgespr&auml;che k&ouml;nnen rund um die Uhr &uuml;ber Telestunt (0190076) f&uuml;r 2,0 
ct/min. gef&uuml;hrt werden, wobei der Anbieter t&auml;glich von 5 bis 21 Uhr 
g&uuml;nstiger ist als die Deutsche Telekom und in der &uuml;brigen Zeit eine 
verbraucherfreundlichere Taktung bietet.

(Alle Angaben ohne Gew&auml;hr)


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es passieren, dass ihr "f&auml;lschlicherweise" mal nicht den g&uuml;nstigsten
  Anbieter benutzt.

* Bei Auslandsgespr&auml;chen l&auml;sst sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: http://www.teltarif.de

* Alle in der Tabelle oben aufgef&uuml;hrten Anbieter rechnen im Minutentakt ab.
  Anbieter, die in einem - wie wir meinen unfairen - Mehr-Minuten-Takt
  abrechnen oder eine pauschale Verbindungsgeb&uuml;hr erheben, werden nicht
  ber&uuml;cksichtigt.

* Auf wenige Tage befristete Sonderaktionen werden nicht ber&uuml;cksichtigt.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
