<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"></center>
						<div align="left">
							<p>Paljon on sattunut ja tapahtunut viime viikkoina - sek&auml; minulle itselleni ett&auml; Amiga-maailmalle. Omilla ongelmillani en aio teit&auml; pitk&auml;stytt&auml;&auml;, Amiga-maailman tapahtumat taas n&auml;ytt&auml;v&auml;t olevan vaihteeksi noususuunnassa. Developer-koneet ja paljon muuta mielenkiintoista asiaa l&ouml;ytyy uutispalstalta, jolle Terho Henriksson on taas luonut uuden ilmeen - levykelehteen sit&auml; valitettavasti ei saa kaikessa loistossaan.</p>
							<p>Uuden layoutin ja parempien ty&ouml;kalujen my&ouml;t&auml; alkaa kelkka k&auml;&auml;nty&auml; html-lehden eduksi. Kun aiemmin levykelehti oli melkeinp&auml; se helpoin kasattava, alkaa nyt vaaka kallistua HTML-version eduksi. Alustavasti onkin jo p&auml;&auml;tetty, ett&auml; levykelehti p&auml;&auml;stet&auml;&auml;n ansaitulle el&auml;kkeelle vuoden lopussa. Rajallinen levykeformaatti - niin kokonsa kuin laatunsakin puolesta - ei ole en&auml;&auml; sen ty&ouml;m&auml;&auml;r&auml;n arvoinen, joka siihen joka kerta uppoaa. Kahden rinnakkaisen formaatin kasaamisessa on valtava ty&ouml;, vaikka sen kuinka yritt&auml;isi automatisoida. Maailma muuttuu, ja Saku muuttuu sen mukana.</p>
							<p>Henkil&ouml;kohtaisesti haluan kiitt&auml;&auml; erityisesti Risto M&auml;ki-Pet&auml;yst&auml;, joka sai koko HTML-uudistuksen alulle toimittamalla ensimm&auml;iset &quot;oikeat&quot; HTML-Sakut. Ensimm&auml;isen askeleen ottaminen on aina se vaikein mutta my&ouml;s t&auml;rkein vaihe uudella matkalla, ja siin&auml; Risto osoitti ennakkoluulotonta pioneerihenke&auml;. Terho Henriksson vei ideaa eteenp&auml;in, ja tuloksen n&auml;ette lopullisesti t&auml;ss&auml; numerossa. Kun Sakun kotisivujen hoitokin on pienten kakistelujen j&auml;lkeen saatu onnellisesti Jarmo Piipon hoitoon, t&auml;st&auml; on hyv&auml; jatkaa. El&auml;m&auml;ss&auml; tulee joskus takapakkiakin, mutta perussuunta on silti aina eteenp&auml;in.</p>
							<p>Kun kaikki on kohdallaan, loppuu liike.</p>
							<p>&quot;We don't always live in harmony<br>
							And often there are times when we are enemies<br>
							I fight with you, you fight with me<br>
							Trying to get the balance right.<br>
							<br>
							Sometimes we cause each other pain<br>
							Sometimes our wills are not the same<br>
							And often we tire of the strain<br>
							Trying to get the balance right.&quot;<br>
							</p>
							<p>Mary Black: Trying to get the balance right</div>
					</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
