<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA stellt das Entwicklersystem und die Zukunftspl&auml;ne vor</H2>
<P>
Auf der Amiga-Messe Amiga 2k, die am 1. und 2. April in St. Louis
stattfand, erl&auml;uterte AMIGA seine Vorhaben und pr&auml;sentierte wie angek&uuml;ndigt
eine Developerbox, die die Grundlage zur Programmierung des neuen Amiga-
Betriebssystems und erster Anwendungssoftware darstellt. Hier sind die
wichtigsten Details:
</P>
<P><B>Das Entwicklersystem:</B></P>
<UL>
<LI> Die Entwicklermaschine enth&auml;lt einen AMD K6-2 (500 MHz), 64 MB RAM und
  die Grafikkarte GeForce 256, auf dem laut AMIGA das Tao-System sehr gut
  lauff&auml;hig sei.
</LI>
<BR><LI> Die Entwicklungsumgebung laufe momentan &quot;gehosted&quot; auf einem
  RedHat-Linux-Kernel.
</LI>
<BR><LI> Entwicklersoftware soll &uuml;ber eine Support-Website bereit gestellt werden.
</LI>
<BR><LI> Die Entwicklersoftware soll auf jedem PC mit den genannten
  Spezifikationen lauff&auml;hig sein, Support werde es jedoch nur f&uuml;r jene
  geben, die das Ger&auml;t von AMIGA kaufen.
</LI>
<BR><LI> Die Entwicklermaschine soll in ca. zwei bis vier Wochen erh&auml;ltlich sein
  und von jedermann erworben werden k&ouml;nnen.
</LI>
</UL>
<P><B>Das Endkundensystem:</B></P>
<UL>
<LI> Vorab: Entwicklerger&auml;t und Endkundensystem sind zwei unterschiedliche
  Dinge (mehr dazu im Schlusswort dieser Ausgabe)
</LI>
<BR><LI> Das neue Amiga-Betriebssystem soll sich sowohl als &quot;Aufsatz&quot; (z.B. unter
  Linux) als auch stand-alone betreiben lassen.
</LI>
<BR><LI> Entscheidend sein werde Taos virtueller Prozessor, der bereits auf x86,
  PowerPC, MIPS, ARM, SH4 und anderen leistungsf&auml;higen Prozessoren, die
  bald angek&uuml;ndigt w&uuml;rden, lauff&auml;hig sein soll.
</LI>
<BR><LI> Folglich wird das neue Amiga-Betriebssystem nicht auf eine bestimmte
  Hardwareplattform beschr&auml;nkt sein.
</LI>
<BR><LI> Die Tao Group stelle lediglich den Kern des neuen OS bereit.
</LI>
<BR><LI> Der Kernel habe einen Umfang von 25 KB, das gesamte OS mit GUI und Java
  sei etwa 3 MB RAM gro&szlig;.
</LI>
<BR><LI> Das Amiga-Betriebssystem soll eine hohe Skalierbarkeit bieten.
</LI>
<BR><LI> Das GUI-System existiere gesondert, es erm&ouml;gliche, mehrere GUI-Modelle
  hinzuzuf&uuml;gen.
</LI>
<BR><LI> Das erste GUI-Modell werde sich stark von der heutigen AmigaOS-GUI
  unterscheiden, aber die Anwender k&ouml;nnten selbst das erschaffen, was sie
  m&ouml;chten.
</LI>
<BR><LI> Die Amiga-Software solle der gemeinsame &quot;Consumer Application Layer&quot; f&uuml;r
  26(!) verschiedene Linux-Versionen und das gemeinsame Interface f&uuml;r
  Corel-Linux-Applikationen werden.
</LI>
<BR><LI> Java spiele eine wichtige Rolle. Es werde viele Java-Applikationen f&uuml;r
  den neuen Amiga geben.
</LI>
<BR><LI> Espial (<A HREF="http://www.espial.com" TARGET="_top">http://www.espial.com</A>) entwickele einen 800KByte-Java-Browser f&uuml;r
  den neuen Amiga.
</LI>
<BR><LI> Es werde eine neue Version von Scala geben.
</LI>
<BR><LI> 117 derzeitige Amiga-Softwaretitel w&uuml;rden auf das neue AmigaOS portiert.
  Diese sollen von Scala, AMIGA, Titan Computer, Haage &amp; Partner, Digital
  Images, Hyperion und Crystal Software kommen.
</LI>
<BR><LI> AMIGA selbst entwickele momentan keine 68k-Emulation, stehe jedoch in
  Kontakt zu mehreren Firmen, die diese Aufgabe &uuml;bernehmen m&ouml;chten (aber
  unterschiedliche Ziele verfolgen).
</LI>
<BR><LI> Zeichentrickfilmer von der Disney Corp. h&auml;tten konzeptionelle Tower-,
  Desktop-, Server- und Spielekonsolen-Geh&auml;usedesigns zur Verf&uuml;gung
  gestellt. (Disney h&auml;tte mehr als 500 Amigas verwendet, um Animationen f&uuml;r
  ihre Filme herzustellen).
</LI>
<BR><LI> Das Endanwendersystem soll noch in diesem Jahr erscheinen.
</LI>
<BR><LI> Zwei Kaufgruppen seien angepeilt: Der &quot;digitale Abenteurer&quot; (eine
  Erweiterung des heutigen Amiga-Marktes) sowie jene, die f&uuml;r Computer im
  Prinzip nichts &uuml;brig haben (Domestic Digital Habitat).
</LI>
<BR><LI> Die Amiga-Technologie soll von jeder Firma mit einer guten Idee und etwas
  Geld lizensiert werden k&ouml;nnen.
</LI>
<BR><LI> Tech Head Stories (<A HREF="http://tech-head.com" TARGET="_top">http://tech-head.com</A>) werde in den kommenden Wochen
  tiefgreifende Analysen der Amiga-Ank&uuml;ndigungen, bez&uuml;glich der Streaming
  Video-, Text- und Grafikformate, vornehmen.
</LI>
</UL>
<P><B>Partnerschaften und anderes:</B></P>
<UL>
<LI> Sun, RedHat und Corel seien strategische Partner AMIGAs.
</LI>
<BR><LI> Interessiert an der neuen Amiga-Technologie seien auch diverse Consumer-
  Elektronikfirmen, inklusive Sony und JVC.
</LI>
<BR><LI> In K&uuml;rze solle es eine Ank&uuml;ndigung, AMIGAs Beteiligung an einer
  weltweiten ISP(Internet-Service-Provider)-Allianz betreffend, geben.
</LI>
<BR><LI> Phoenix (strebte bislang die Schaffung eines eigenen Amiga-Nachfolgers
  an) unterst&uuml;tzt die Pl&auml;ne AMIGAs.
</LI>
<BR><LI> Newtek habe den Sourcecode f&uuml;r Toaster und Flyer freigegeben (siehe
  <A HREF="http://www.toaster.amiga.org" TARGET="_top">http://www.toaster.amiga.org</A>).
</LI>
</UL>
<P><B>Eindr&uuml;cke:</B></P>
<P>
Zwar gibt es noch nicht allzu viele Schilderungen von Messebesuchern, die
das Entwicklersystem in Aktion gesehen haben, ersten Berichten zufolge
scheint es jedoch gut bis sehr gut angekommen zu sein. Insbesondere die
Softwaregeschwindigkeit ist gelobt worden.
</P>
<P>
Eine erste Analyse der Ank&uuml;ndigungen ist &uuml;brigens im Schlusswort dieser
AMIGA-aktuell-Ausgabe enthalten.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
