<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. BlackIRC nun Freeware (und weitere Nachrichten von Innovative)</H2>
<P>Innovative (<A HREF="http://www.innovative-web.de" TARGET="_top">http://www.innovative-web.de</A>) informiert:</P>
<P>
&raquo;10.3.2000 VHI-Treiber f&uuml;r GVP IV 24 verf&uuml;gbar
</P>
<P>
Ein VHI-Treiber f&uuml;r den GVP IV24-Digitizer ist ab sofort zum freien
Download von der VHI-Seite verf&uuml;gbar. Zur Verwendung des Treibers
empfehlen wir VLRec NG 4.0 :)
</P>
<P>10.3.2000 VHI-Homepage aktualisiert</B>
<P>
Die VHI-Homepage wurde nun aktualisiert und auf den aktuellsten
Stand gebracht. Als neue Bereiche sind der Logo-Bereich und eine
Seite mit Bildern und Informationen zu den meisten unterst&uuml;tzten
Karten hinzugekommen.
</P>
<P>
14.3.2000 BlackIRC 1.1 Freeware Edition ver&ouml;ffentlicht
</P>
<P>
Unsere Gesch&auml;ftsaktivit&auml;ten verlagern sich immer st&auml;rker in
den Grafikbereich und das Entwickeln von Online-Anwendungen
f&uuml;r Server und Unternehmen. Daher reichen unsere Kapazit&auml;ten
nicht mehr aus, um BlackIRC angemessen weiterzuentwickeln und
ver&ouml;ffentlichen dieses ab sofort als Freeware. Der integrierte
Newsservice BlackNEWS wird von amiga-news.de weitergef&uuml;hrt.
Gleichzeitig stellen wir aber auch den Support f&uuml;r BlackIRC ein,
da es nun Freeware ist und Support ja bekanntlich Geld kostet.
Sollte eine Firma oder Privatperson an einer Weiterentwicklung
von BlackIRC interessiert sein, so vergeben wir Sourcecode-
Lizenzen ab 5000 DM.
</P>
<P>
BlackIRC ist ein IRC-Client f&uuml;r den AMIGA, dessen F&auml;higkeiten
wohl einzigartig sind. So sind einige Extras, wie XDCC, Bots,
CTCP-Flood-Schutz, etc. bereits standardm&auml;&szlig;ig im Client eingebaut.
Weiterhin ist es mit BlackIRC als einzigen IRC-Client auf dem
AMIGA m&ouml;glich, Videokonferenzen abzuhalten.
</P>
<P>14.3.2000 ANet 1200 ausverkauft</B>
<P>
Die ANet 1200-Karten sind ausverkauft und wir nehmen sie daher
wieder aus unserem Angebot.
</P>
<P>
21.3.2000 VHI Studio 5.0 und neue Digitalkamerasoftware
</P>
<P>
Innovative k&uuml;ndigt neue Software f&uuml;r Digitalkameras und eine
neue Version von VLRec NG an. Diese Kombination wird er Besitzern
von Digitalkameras erm&ouml;glichen, Ihre Digitalkamera nicht nur zum
Aufnehmen von Photos sondern auch f&uuml;r WebCams, Zeitrafferanimationen
und zum Erstellen von Videoclips und vielem mehr zu nutzen. Innovative
ben&ouml;tigt allerdings noch Betatester und fragt nach W&uuml;nschen f&uuml;r Treiber
f&uuml;r Digitalkameras. Mehr dazu auf der Homepage von Innovative.
</P>
<P>
21.3.2000 Neue Bilder in der fxPAINT-Gallerie
</P>
<P>
In der Gallerie ist nun auch Dirk Baeyens mit seinen beeindruckenden
Bildern vertreten. Auch von Jochen Abitz gibt es etwas Neues zu sehen.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
