<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Wie schreibe ich einen Artikel f&uuml;r AMIGA aktuell (von Thorsten Sch&ouml;lzel)</H2>
<P>
&raquo;Leider haben die Beitr&auml;ge der Leser rapide abgenommen, ein Grund daf&uuml;r
k&ouml;nnte die Stagnation des Amiga-Marktes sein. Der Amiga-Markt hat leider
nicht mehr viel zu bieten, schade eigentlich, trotzdem hat der Amiga-Markt
noch etwas sehr wertvolles und zwar ein Online-Magazin namens &quot;Amiga
aktuell&quot;, das es meiner Meinung doch wert ist, am Leben erhalten zu werden,
oder irre ich mich da?
Vielleicht ist es Euch nicht bewusst, doch Ihr k&ouml;nnt auch einen Teil dazu
beitragen, damit dies auch weiter so bleibt. Es gibt so vieles in einem so
kleinen Markt, &uuml;ber das es wert ist, zu berichten. Doch viel wichtiger
w&auml;re, es auch zu tun!
Zwar bin ich nicht der Super-Redakteur, doch macht es mir Spa&szlig;, mich an
etwas zu beteiligen, wie in diesem Fall an der &quot;Amiga aktuell&quot;. Ich w&auml;re
sehr erfreut, wenn man meinem Beispiel folgen w&uuml;rde und Ihr auch mal hin
und wieder mal ein oder zwei Artikel f&uuml;r die &quot;Amiga aktuell&quot; schreibt.
Eure Artikel schickt Ihr an Carsten Schr&ouml;der (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</P>
<P>
Nun zum Eigentlichen, Ihr benutzt ein Programm, mit dem Ihr euch sehr gut
auskennt, schreibt doch einen Artikel dar&uuml;ber. Schnappt Euch ein
Textprogramm und los geht's.
</P>
<P>
Ich benutze die Editoren &quot;EditPad&quot;, das zum AmigaOS3.5 geh&ouml;rt oder den
Editor des Mail-Programms &quot;YAM&quot;, der gegen&uuml;ber EditPad viel besser ist.
Nun beschreibt Ihr erst einmal, um was es sich bei dem Programm &uuml;berhaupt
handelt, in drei bis f&uuml;nf Zeilen.
</P>
<P>
Etwas, das ich z.B. bei zuk&uuml;nftigen Softwaretests einf&uuml;hre, ist, dass ich
zu der &Uuml;berschrift des Programms auch direkt anf&uuml;hre, dass das von mir
getestete Programm in z.B. einer 060'er-Version vorlag. Ein kleines
Beispiel anhand von YAM:
YAM v2.0 (060-Version) - so w&uuml;rde das dann aussehen, was f&uuml;r den User
sicherlich von Vorteil ist. Auch dort hoffe ich, dass man meinem Beispiel
folgen wird bzw. es in die Tat umsetzt.
</P>
<P>
Nun beschreibt man den Installationsprozess, in wieweit alles reibungslos
verlaufen ist oder nicht.
</P>
<P>
Jetzt folgen die eigentlich wichtigen Informationen &uuml;ber das getestete
Programm, und zwar welche Features es hat und wie sie in der Benutzung zum
tragen kommen, denn genau darauf kommt es an. Denn der User m&ouml;chte wissen,
was er an dem Programm hat und nicht, ob es sich gut oder schlecht
installieren l&auml;sst.
</P>
<P>
Dieser Abschnitt sollte ausf&uuml;hrlich beschrieben werden und wenn m&ouml;glich mit
den sogenannten &quot;Screenshots&quot; untermalt werden.
</P>
<P>
Sofern Ihr wissen m&ouml;chtet, welche Programme daf&uuml;r gut sind bzw. welche man
benutzen sollte, so bitte ich um eMail-Kontakt:
Thorsten Sch&ouml;lzel (<A HREF="mailto:amiga-freak@t-online.de">amiga-freak@t-online.de</A>).
</P>
<P>
Anschlie&szlig;end k&ouml;nntet Ihr noch sonstige Dinge auflisten, wie z.B. Homepage
und eMail-Adressen, Zukunftsaussichten des Programms, Dinge die sonst noch
Bezug auf das Programm haben...
</P>
<P>
Somit habt Ihr euren ersten Artikel f&uuml;r die &quot;Amiga aktuell&quot; fertiggestellt,
achtet aber darauf, dass Ihr eure Artikel Anfang bzw. Mitte des Monats
abliefert, zwar k&ouml;nnt Ihr auch Ende des Monats Eure Artikel an Carsten
schicken, doch besteht dann Gefahr darin, dass erstens im schlimmsten Fall
die  &quot;Amigaaktuell&quot; ein paar Tage sp&auml;ter erscheint oder Eure Artikel
nicht mehr in die aktuelle &quot;Amiga aktuell&quot; mit aufgenommen werden, bedenkt
dies bitte.
</P>
<P>
Sehr stark hoffe ich, dass ich viele von Euch motivieren konnte, sich an
den n&auml;chsten &quot;Amiga aktuell&quot;-Ausgaben zu beteiligen!
</P>
<P>
Ein kleiner Tip noch von mir, bei manchen Artikeln kann es
helfen, wenn man im Hintergrund Musik an hat, die man mag. :-)
</P>
<P><B>Thorsten Sch&ouml;lzel &lt;<A HREF="mailto:amiga-freak@t-online.de">amiga-freak@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
