<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Einige Hard- und Softwareprobleme und ihre L&ouml;sung (von Uwe Mann)</H2>
<P><B>&raquo;1) Verbindungsprobleme mit 56k-Modem</B></P>
<P>
Ich hatte zuerst ein Suprafaxxmodem 28.8. Dann hatte ich mir ein US
Robotics 56k Faxmodem zugelegt, mit dem ich eigenlich ganz zufrieden war.
</P>
<P>
Ab Dezember 99 hatte ich auf einmal Verbindungsprobleme, denn ich hatte nur
noch 300 Zeichen in der Sek. !!!!!! Ich hatte zwar einen 40-, 42-, 44.4-
und sogar einmal einen 49k-Login (laut Anzeige von Miami), aber praktisch
keine schnelle Verbindung. &Uuml;blich waren ca. 2000 - 5000 Zeichen in der
Sek.
</P>
<P>
Ich habe alles M&ouml;gliche ausprobiert und herausgefunden, da&szlig; das ganze nur
mit einen 33k-Login ertr&auml;glich war (ca.2000-3000). Alle schnelleren
Verbindungen waren langsamer als der 33k-Login.
</P>
<P>
Ich habe dann das Modem bei Mediamarkt in Reperatur gegeben.
</P>
<P>
Das dauerte 6 Wochen(!!!) (eingeschickt zum Hersteller). In der
Zwischenzeit hatte ich wieder das 28.8 Modem dran, das einwandfrei funzte
und fast genauso schnell war wie das 56k.
</P>
<P>
Das Robotics wurde eingestampft und ich durfte mir ein neues holen bei
Mediamarkt (daf&uuml;r brauchen die 6 Wochen!!!!). Ich glaube ich bin doch bl&ouml;d!
Dasselbe Modell hatten sie nat&uuml;rlich nicht mehr und ich habe jetzt
ein Acer 56 K (das zeigt aber nicht mehr so sch&ouml;n wie das Robotics die
Verbindungsgeschwindigkeit an) - mit demselben Problem!
Dann ist mir eine rettende Idee gekommen. Wir haben uns zu Weihnachten ein
neues (schnurloses) Telefon geleistet, Orginal T Sinus 45 (echt spitze).
Ich habe es von der Telefonsteckdose abgezogen und....siehe da, es funzt
alles, und wie (bis 6000 Zeichen)!!!!
</P>
<P>
Ich habe mein (EX-) Problem an Olaf Krafft gemailt (Olaf ist bei der
Telekom oder so &auml;hnlich), und hier seine Antwort:
</P>
<UL>
<LI> F&uuml;r die 56k-&Uuml;bertragung werden nicht nur unterschiedliche Frequenzen
</LI>
<BR><LI> sondern auch unterschiedliche Spannungen auf der Leitung benutzt.
</LI>
<BR><LI> Die beiden Endstellen messen beim Verbindungsaufbau die Leitung durch
</LI>
<BR><LI> und je nach Leitungsqualit&auml;t k&ouml;nnen dann halt Datenraten zwischen 33,6
</LI>
<BR><LI> und 56 k erreicht werden. Wenn Du ein zweites Ger&auml;t parallel auf die
</LI>
<BR><LI> Leitung schaltest ver&auml;nderst Du den Abschlu&szlig;wiederstand der Leitung
</LI>
<BR><LI> und deshalb geht dann wohl nix mehr.
</LI>
<BR><LI> Als L&ouml;sung bietet sich eine AWADO an.
</LI>
<BR><LI> Das ist ne automatische Wechselschalterdose.
</LI>
<BR><LI> Die wird als erste Dose eingebaut und schaltet dann jeweils nur eins
</LI>
<BR><LI> der angeschlossenen Ger&auml;te an die Leitung.
</LI>
<BR><LI> Eine einfache Telefonanlage kostet auch nicht viel mehr und sollte
</LI>
<BR><LI> genausogut funktionieren.
</LI>
<BR><LI> Die billigste L&ouml;sung w&auml;re nat&uuml;rlich nen Schalter, der das
</LI>
<BR><LI> Sinus abschaltet und die beste L&ouml;sung der Umstieg auf ISDN. :-)
</LI>
<BR><LI> Da gibts inzwischen sehr preiswerte Angebote. z.B. den PowerDragon
</LI>
<BR><LI> von Hagenuk bei Conrad. F&uuml;r ca 50 DM oder so um den Dreh.
</LI>
</UL>
<P>
Ich habe aber noch eine andere L&ouml;sung gefunden. Das Modem hat hinten einen
Anschluss f&uuml;r ein Telefon. Das Kabel mit zwei Westernsteckern hatten sie
nat&uuml;rlich nicht im T-Punkt-Laden. Bei Conrad gibt es aber solch ein Kabel
f&uuml;r 'nen Appel und 'n Ei.
</P>
<P>
Ich habe also das Sinus an das Modem mit angeschlossen. Und siehe da, alles
funktioniert ohne Probleme, und ohne dass ich irgendeinen Stecker abziehen
oder einen Eingriff am Telefonanschlu&szlig; machen muss.
</P>
<P>
<B>2) Probleme mit Restore der Diavolo-Backupfiles</B>
</P>
<P>
Ich habe Backups mit Diavolo gemacht und als File abgespeichert. Wenn ich
von dem Backup mehrere Verzeichnisse wieder zur&uuml;ckschreibe, h&auml;ngt sich
Diavolo auf. Allerdings nicht immer, aber bei 80% meiner Restore-
Versuche...
</P>
<P>
Wenn ich nur einzelne Files zur&uuml;ckschreibe, passiert das nicht. Dasselbe
Problem hatte ich, als ich die HD an den A1200 mit Blitzzard IV
angeschlossen hatte, auch. Es ist mir fr&uuml;her nicht aufgefallen, weil ich
nicht so &quot;gro&szlig;e&quot; Festplatten hatte und meine Backups auf Floppy-Disks
gemacht hatte.
</P>
<P>
Ich habe sehr lange herumger&auml;tselt, &uuml;ber ein Jahr, oder besser gesagt,
solange ich den A4000 habe. Ich habe durch das neue Diavolo-Update von der
Email-Adresse von M. Wenngatz erfahren, und er gab mir folgenden Tip:
</P>
<UL>
<LI> Das hat was mit den Blockgr&ouml;&szlig;en zu tun.
</LI>
<BR><LI> Versuchen Sie mal in der HD Toolbox die Filetransferrate
</LI>
<BR><LI> um ein &lt;f&gt; zu erh&ouml;hen.
</LI>
<BR><LI> Meistens funktioniert es dann.
</LI>
</UL>
<P>
Ich musste allerdings ein wenig herumexperimentieren, weil ich das PFS 4.2-
Filesystem habe und sogar um ein <F> erniedrigen. Bei meiner Konfiguration
ist MaxTransfer: 0x00FFFFFC der richtige Wert. Ich w&auml;re nie im Leben darauf
gekommen, weil alles andere scheinbar auf dem Amiga funktionierte.
</P>
<P><B>2.1)</B></P>
<P>
Ich habe die Backup-Files auf CD gebrannt.
</P>
<P>
Mit einem IDE-CD-ROM am internen IDE-Anschlu&szlig; konnte ich die Backups nicht
direkt von der CD wieder restaurieren, erst wenn ich das Backup-File vorher
auf HD &uuml;bertragen habe.
</P>
<P>
Mit einem Overdrive CD-ROM funktionierte das Ganze auch von CD.
</P>
<P>
Nachdem ich mir einen A4000 mit SCSI-CD-ROM angeschafft hatte,
funktionierre es auch dort direkt von CD. Ich habe dort auch ein
schnelleres IDE-CD-ROM mit angeschlossen.
</P>
<P>
Eigenartigerweise funktioniert nun Diavolo auch mit einem Atapi-CD-
Laufwerk, obwohl das SCSI-CD-Laufwerk nicht mehr angeschlossen ist!
Es gen&uuml;gt v&ouml;llig, wenn man ein SCSI-CD-ROM angemeldet (installiert) hatte.
Allerdings nicht, wenn man nur ein ATAPI-CD-ROM installiert hat.
</P>
<P><B>System:</B></P>
<P>
A4000 040/25 Desktop 2Mb C 16Mb F Kick 3.1 vers.40.68 OS 3.5
Merlin Graka 4Mb P96 Probench
Oktagon SCSI Kontroller + 4Mb F
Quantum Maverik 520 Mb
16xAtapi Cd-Laufwerk
Quantum Fireball 1,2 Gb IDE
</P>
<P><B>Uwe Mann &lt;<A HREF="mailto:Uwe.Mann@t-online.de">Uwe.Mann@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
