<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele9.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele11.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>7.4. Reviews</H1>
<H2>Warcraft II</H2>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
Name des Spiels : Warcraft II
Hersteller      : Blizzard Entertainment
Voraussetzungen : 040       8MB
erh&auml;ltlich bei  : Kaufhaus, Mac-Versender

Grundlage       : ( ) Vollversion      (X) Demo     ( ) Andere:

Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB
</PRE></TD></TR></TABLE>
<P><B>Spielbeschreibung :</B></P>
<P>
Bei Warcraft II handelt es sich um ein, im Fantasy-Genre angesiedeltes
Echtzeitstrategie-Spiel, bei dem Orks und Menschen gegeneinander antreten.
Dabei wird dem Spieler &uuml;berlassen, auf welcher Seite er die Geschicke des
Krieges lenken m&ouml;chte.
</P>
<P>
Der Spielablauf ist bei beiden Kriegsparteien &auml;hnlich: wie bei anderen
Spielen dieser Art ist es zun&auml;chst wichtig, sich ein Lager aufzubauen. Dazu
stehen bei Warcraft Geb&auml;ude wie S&auml;gem&uuml;hlen, Farmen oder Kirchen
zur Verf&uuml;gung, die jeweils eigene Funktionen erf&uuml;llen.
</P>
<P>
Um diese Bauwerke zu errichten, bedarf es allerdings der n&ouml;tigen Rohstoffe:
Gold, Holz und &Ouml;l. Die ersten beiden k&ouml;nnen von einfachen Arbeitern in
Minen oder W&auml;ldern beschafft werden. Ausserdem sind sie f&uuml;r den sp&auml;teren
Bau der Geb&auml;ude zust&auml;ndig, wobei ein Arbeiter immer nur eine Aktion zur
gleichen Zeit verrichten kann. &Ouml;l ist erst in sp&auml;teren Leveln erh&auml;ltlich,
und wird von Bohrt&uuml;rmen gef&ouml;rdert und mit Schiffen ins Hauptquartier
gebracht.
</P>
<P>
Sind erst einmal genug Geb&auml;ude gebaut, kann man gleichzeitig an die
Produktion von diversen verschiedenen Einheiten gehen, die mit einer Reihe
unterschiedlicher Werte und Waffen versehen sind.
</P>
<P>
Mit diesen Einheiten kann man die Gegend erkunden (wobei zuvor Schwarze
Fl&auml;chen gef&uuml;llt werden) und nat&uuml;rlich auch Gegner angreifen. Bei den
daraufhin folgenden K&auml;mpfen wird dann solange mit den Waffen aufeinander
einschlagen, bis einem Kontrahenten die Energie ausgeht.
</P>
<P>
Die Steuerung erfolgt &uuml;ber eine Befehlsleiste am Rand des Bildschirms,
wobei man neben Bewegung und Angriff auch komplexere Befehle wie
&quot;patroullieren&quot; und &quot;Stellung halten&quot; geben kann, was dem ganzen einen
zus&auml;tlichen Strategieaspekt verleiht.
</P>
<P>
Eine Besonderheit von Warcraft gegen&uuml;ber seiner Konkurrenz ist der
sogenannte &quot;Fog of War&quot;, der den Blick auf nicht sichtbare Fl&auml;chen des
Spiels verhindert. Konkret bedeutet dies, dass der Spieler Bewegungen des
Feindes nur dort ausmacht, wo sich diese im Sichtfeld eigener Einheiten
befinden; ansonsten ist bereits zuvor erkundetes Gebiet mit einem grauen
Nebel belegt.
</P>
<P>
Grafik und Musik sind durchaus sehens- und h&ouml;hrenswert. Wer sich ein
genaueres Bild der Optik machen will, sollte sich die optionalen
Screenshots von der AAkt-Homepage herunterladen.
</P>
<P><B>Spielgeschwindigkeit :</B></P>
<P>
Das Spiel l&auml;uft selbst ohne GraKa noch angenehm fl&uuml;ssig, das Scrolling ist
zwar ruckelig, doch immer noch ertr&auml;glicher als bei Napalm. Alles in allem
ist Warcraft II sehr gut spielbar.
</P>
<P><B>Fazit :</B></P>
<P>
Wer auf Echtzeitstrategie steht, wird mit Warcraft II seine Freude haben.
Da das Spiel netzwerkf&auml;hig ist, sollte es sogar m&ouml;glich sein, &uuml;ber Fusion
an einer gr&ouml;&szlig;eren Session teilzuhaben.
</P>
<P>
Ein weiterer Kaufgrund ist der, dass man die Mac-Version auch noch bequem
im Handel erhalten kann, da sie sich auf einer Hybrid-CD befindet. Einfach
mal Ausschau halten!
</P>
<H2>Return to Zork</H2>
<TABLE><TR><TD BGCOLOR="#e0e0e0"><PRE>
Name des Spiels : Return to Zork
Hersteller      : Infocom
Voraussetzungen : 4MB
erh&auml;ltlich bei  : ?

Grundlage       : ( ) Vollversion      ( ) Demo     (X) Andere: MacMagazin
</PRE></TD></TR></TABLE>
<P><B>Einleitung :</B></P>
<P>
Wer sich noch an die Zeiten erinnern kann, in denen ein Spiel allein durch
die Spieltiefe, und nicht durch grafisches TamTam zu beeindrucken wusste,
der kennt vermutlich auch die Textadventure-Schmiede Infocom, die unter
anderem die bekannte Zork-Reihe entwickelte. Mit &quot;Return to Zork&quot; wurde
schlie&szlig;lich der Sprung ins multimediale Zeitalter gewagt, das Spiel
wurde mit einer (damals) pomp&ouml;sen grafischen Aufmachung versehen.
</P>
<P><B>Spielbeschreibung :</B></P>
<P>
Der Spieler startet das Spiel am &quot;Vulture Pass&quot; im &quot;Valley of the
Sparrows&quot;, von wo aus es schnurstracks in die Stadt Shanbar geht. Hier kann
man sich die notwendige Ausr&uuml;stung f&uuml;r die bevorstehende Abenteuerreise in
die unterirdischen Reiche von Zork beschaffen und mit den obskuren Personen
reden, die diese Stadt bewohnen: darunter bedindet sich ein lediger Lehrer,
eine Saufdrossel und der B&uuml;rgermeister. Die Gespr&auml;che lassen sich insoweit
beeinflussen, dass man sich beispielsweise gelangweilt, gleichg&uuml;ltig
oder sogar feindselig zeigen kann. Je nachdem wie man sich gibt, kann man
den Personen verschiedene Informationen entlocken, die man f&uuml;r das weitere
Abenteuer ben&ouml;tigt.
</P>
<P>
Gesteuert wird das Spiel vollst&auml;ndig mit der Maus. Mit ihr kann man sich
vorw&auml;rts bewegen bzw. drehen und mit Hilfe eines Klicks ein Gegenstand
aufheben oder verwenden. Letzteres geschieht mit intelligenten
Kontextmenues, die verschiedene Verwendungsm&ouml;glichkeiten zulassen.
</P>
<P>
Optisch sorgen h&uuml;bsch gestaltete Hintergr&uuml;nde und digitalisierte
Charaktere f&uuml;r einen guten Eindruck. Bei Gespr&auml;chen kommt der Spieler in
den Genu&szlig; (?) von Videosequenzen, was nat&uuml;rlich die Interaktion
einschr&auml;nkt.
</P>
<P>
Weniger zufriedenstellen kann allerdings der Sound der laut Artikel eher an
&quot;Musik in Fahrst&uuml;hlen&quot; erinnert. Ausserdem werden die &quot;eigenwilligen&quot;
R&auml;tsel, sowie das etwas dr&ouml;ge Gameplay kritisiert.
</P>
<P><B>Spielgeschwindigkeit :</B></P>
<P>
Da als Systemvoraussetzung ein LC oder besser angegeben sind, wird
vermutlich schon ein 030er ausreichen, um das Spiel vern&uuml;nftig spielen zu
k&ouml;nnen. Nur um die Videosequenzen fl&uuml;ssig zu betrachten, d&uuml;rfte ein wenig
mehr Power nicht abtr&auml;glich sein.
</P>
<P><B>Fazit :</B></P>
<P>
Begeisterungsst&uuml;rme wird &quot;Return to Zork&quot; vermutlich nicht verursachen,
zumal der gr&ouml;&szlig;te Pluspunkt, die Aufmachung, in der heutigen Zeit auch nicht
mehr als Kaufgrund anzusehen ist. Wenn es aber irgendwo billig zu haben
ist, k&ouml;nnte es durchaus eine Anschaffung wert sein, zumal es von der
Kultschmiede Infocom kommt.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Autor&nbsp;</TD><TD VALIGN="TOP">: Andreas Koch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">E-Mail&nbsp;</TD><TD VALIGN="TOP">: <A HREF="mailto:andreas.koch@wirtschaft.uni-giessen.de">andreas.koch@wirtschaft.uni-giessen.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele11.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
