<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Amiga Format wird eingestellt
</LI>
</UL>
<P>
Die April 2000 Ausgabe des englischen Amiga Magazins Amiga Format, welches
sich auch in Deutschland einer gro&szlig;en Leserschaft erfreute, ist die
allerletzte Ausgabe. Die Amiga Format besteht nun seit fast 10 Jahren und
hat sich immer durch Unabh&auml;ngigkeit und Fachlichkeit ausgezeichnet.
In meinen Augen ist der Verlust dieses hochkar&auml;tigen Magazins sehr
schmerzlich f&uuml;r die Amiga Gemeinde. Einziger Lichtblick: Ben Vost hat in
seiner Pressemitteilung erkl&auml;rt, dass im Falle eines wirklichen R&uuml;ckkehrens
der Amiga Technologie die Amiga Format die erste Zeitschrift sein wird, die
wieder &uuml;ber Amiga berichten wird.
</P>
<UL>
<LI> Simon the Sorcerer II kommt
</LI>
</UL>
<P>
Epic Marketing hat bekanntgegeben, dass sich die Amiga-Version von Simon
the Sorcerer II momentan in der Beta-Test Phase befindet. Die endg&uuml;ltige
Version soll jetzt Ende April endlich erscheinen. Man darf gespannt sein.
</P>
<UL>
<LI> Heretic II fast fertig
</LI>
</UL>
<P>
Hyperion Software hat Heretic II sogut wie abgeschlossen. Wenn alles glatt
l&auml;uft, erscheint das fertige Spiel in den n&auml;chsten Tagen. Damit w&auml;re
Heretic II der aufwendigste 3D Shooter, den der Amiga je gesehen hat.
Au&szlig;erdem lastet Heretic II den PowerPC sowie eventuelle 3D Erweiterungen
voll aus.
</P>
<UL>
<LI> Zool 3
</LI>
</UL>
<P>
Wer diesen Monat aufmerksam die Gremlin Website verfolgte, dem fiel auf,
dass dort pl&ouml;tzlich wieder der Amiga auftauchte. Ein paar Tage sp&auml;ter
erschien dann auch die erste Ank&uuml;ndigung: Bei Gremlin arbeitet man an Zool
3, der Nachfolger des ber&uuml;hmten Jump'n'Runs von 1993. Zool 3 bietet einen
2D Modus (68k) sowie einen 3D Modus exklusiv f&uuml;r PowerPC Amigas. Das Spiel
kommt in einer Diskettenversion sowie auf CD-ROM daher. Au&szlig;erdem wird es
erstmals eine DVD Version geben, allerdings bis jetzt nur f&uuml;r PCs. Laut A.
Foolsday von Gremlin Software wird Zool 3 die Computerspielewelt
revolutionieren, da der Spieler mittels des mitgelieferten cyberPACK(tm)
direkt in das Spielgeschehen einsteigen kann. So kann ein Benutzer mittels
des cyberPACK(tm) und des Internets jederzeit in jedes Zool 3-Spiel in der
Welt einsteigen. Zool 3 soll noch zum 1. April fertig werden. Die Amiga-
Version erscheint voraussichtlich erst 1 Jahr sp&auml;ter, also am 1. April
2001, da die cyberPACK(tm)-Hardware noch f&uuml;r Zorro3 entwickelt werden muss.
</P>
<UL>
<LI> Digital Dreams Entertainment
</LI>
</UL>
<P>
Die Website von Digital Dreams Entertainment erstrahlt seit kurzem in einem
neuen Layout. Au&szlig;erdem wurden verschiedene Rubrik aktualisiert, so gibt es
z.B. von Codename: HellSquad neue Screenshots.
</P>
<UL>
<LI> Hyperion Software portiert Sin
</LI>
</UL>
<P>
Wie schon die letzten Monate spekuliert wurde, hat Hyperion Software eine
weitere Lizenz f&uuml;r einen 3D Shooter erworben. Diesmal wurde Sin von
Activision Inc. f&uuml;r den Amiga lizenziert. Das Spiel basiert wie auch
Heretic II auf der Quake 2 Engine von ID Software; daher ist man bei
Hyperion Software zuversichtlich, das Spiel Ende des 2. Quartals 2000
ver&ouml;ffentlichen zu k&ouml;nnen. Die Amiga-Version ben&ouml;tigt einen PowerPC und
unterst&uuml;tzt Warp3D sowie die OpenGL Implementation von Hyperion Software.
</P>
<UL>
<LI> Dafel: Bloodline
</LI>
</UL>
<P>
Das Action Rollenspiel Dafel: Bloodline wird laut Epic Marketing im Mai
erscheinen. Das Spiel wird in einer AGA- sowie in einer RTG-Version
erscheinen. Schnellere Prozessoren werden mit Grafikeffekten wie Licht,
Transparenz und Nebel belohnt. Au&szlig;erdem verf&uuml;gt Dafel: Bloodline &uuml;ber AHI
Unterst&uuml;tzung.
</P>
<UL>
<LI> Ali Baba
</LI>
</UL>
<P>
Medici Software hat eine neue Demoversion ihres Jump'n'Run Spiels Ali Baba
ver&ouml;ffentlicht. Ein erstes Preview k&ouml;nnt ihr in dieser Ausgabe des
Spieleteils lesen.
</P>
<UL>
<LI> Alive Mediasoft News
</LI>
</UL>
<P>
Auch diesen Monat hat Alive Mediasoft wieder einige Neuver&ouml;ffentlichungen
im Gep&auml;ck: Cedric and the search of the magic scepter wurde laut Alive
Mediasoft schon ver&ouml;ffentlicht und Super Taekwando Master wird im April
folgen. Bei Cedric handelt es sich h&ouml;chstwahrscheinlich um eine neue
Ver&ouml;ffentlichung des Cedric-Klassikers von Neo und Alcatraz (1995). Dann
sollen noch The Giana Sisters Triology und Ultimate X-Treme Racing
erscheinen. Mittlerweile d&uuml;rften beide Spiele bereits erschienen sein.
Ultimate X-Treme Racing bietet neue Tracks, Musik und Autos. Die Engine
hinter dem Spiel ist aber die alte geblieben. Au&szlig;erdem wurden Whale's
Voyage 2 und Goal 2000 verbessert. Beide lassen sich jetzt einfacher
installieren und besitzen neue Intros. F&uuml;r diejenigen, die die Spiele
bereits erworben haben, wird bald ein Patch zur Verf&uuml;gung gestellt werden.
Zuletzt ist Alive Mediasoft auch noch umgezogen: Die neue Website lautet
jetzt <A HREF="http://www.alive-mediasoft.co.uk/" TARGET="_top">http://www.alive-mediasoft.co.uk/</A>.
</P>
<UL>
<LI> Neue GLQuake Version
</LI>
</UL>
<P>
Frank Wille hat eine neue Version von seinem Quake Port f&uuml;r WarpOS/Warp3D
ver&ouml;ffentlicht. Heruntergeladen kann das ganze unter
<A HREF="http://devnull.owl.de/~frank/GLQuakeWOS.gz" TARGET="_top">http://devnull.owl.de/~frank/GLQuakeWOS.gz</A>.
</P>
<UL>
<LI> Neues vom APC&amp;TCP
</LI>
</UL>
<P>
Andreas Magerl vom APC&amp;TCP ist nach seinem l&auml;ngeren Krankenhausaufenthalt
wieder normal erreichbar. Au&szlig;erdem ist die Homepage des Computerclubs auf
<A HREF="http://www.apc-tcp.de/" TARGET="_top">http://www.apc-tcp.de/</A> umgezogen. Dadurch hat sich auch die E-Mail Adresse
von Andreas Magerl ge&auml;ndert. Sie lautet jetzt <A HREF="mailto:Andreas@apc-tcp.de.">Andreas@apc-tcp.de.</A>
</P>
<UL>
<LI> Freie Software
</LI>
</UL>
<P>
Folgende Amiga-Spiele von Digital Illusions k&ouml;nnen jetzt legal aus dem
Internet geladen werden: Amiganoid, Benefactor, Pinball Dreams, Pinball
Fantasies und Pinball Illusions. Auf der Seite <A HREF="http://www.ian.avfc.com/" TARGET="_top">http://www.ian.avfc.com/</A>
gibt es die Links.
</P>
<UL>
<LI> IndyProject
</LI>
</UL>
<P>
Ein Team von Entwicklern hat sich die ehrgeizige Aufgabe gesetzt, einen
Nachfolger von Indiana Jones IV zu erstellen. Das ganze l&auml;uft unter dem
Projektnamen &quot;IndyProject&quot;. Gearbeitet wird an IndyProject schon seit 1998
und man hat mittlerweile schon einiges realisiert. Das fertige Spiel soll
dann als Freeware erscheinen und auf vielen Systemen, wie auch dem Amiga,
lauff&auml;hig sein. Eine erste Demo f&uuml;r MS-DOS l&auml;sst sich von
<A HREF="http://www.indyproject.de/" TARGET="_top">http://www.indyproject.de/</A> schon herunterladen.
</P>
<UL>
<LI> WHDLoad 10.6 erschienen
</LI>
</UL>
<P>
Bert Jahn hat eine neue Version seines ultimativen HD Installer f&uuml;r OS-
Killer ver&ouml;ffentlicht. In WHDLoad 10.6 wurden haupts&auml;chlich Fehler
bereinigt. Das Update l&auml;sst sich von <A HREF="http://www.whdload.org/" TARGET="_top">http://www.whdload.org/</A> herunterladen.
</P>
<UL>
<LI> The World Foundry
</LI>
</UL>
<P>
Auch die Website von The World Foundry wurde neu gestaltet. Au&szlig;erdem hat
man die komplette Explorer2260 Rubrik aktualisiert und neu gestaltet.
</P>
<UL>
<LI> Tales from Heaven endlich auf Grafikkarten
</LI>
</UL>
<P>
Epic Marketing hat eine Demoversion des 3D Jump'n'Runs Tales from Heaven
nun auch f&uuml;r Grafikkarten ver&ouml;ffentlicht. Nun k&ouml;nnen also endlich auch
Grafikkarten Besitzer den &quot;Mario64&quot; Spa&szlig; erleben.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
