<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)</H1>
<P>
+++ AMIGA pr&auml;sentiert das Entwicklersystem und die Zukunftspl&auml;ne +++ AMIGA
stellt Entwickler, Management- und Support-Mitarbeiter ein +++ Weitere
Kooperationen geschlossen +++ Umsetzung des neuen Betriebssystems f&uuml;r
PowerPC-Erweiterungen vorgesehen +++ Berater- und Kommunikationsgremium
Amiga Advisory Council (re)aktiviert +++ Kostenloser Newsletter von AMIGA
in Planung +++ Neue AMIGA-Website online +++ Umzug in neues AMIGA-
Hauptquartier abgeschlossen +++ AMIGA sponsort weltbekannte
Fu&szlig;ballmannschaft... +++ Neue deutsche Amiga-Messe f&uuml;r Mitte Juni geplant
+++
</P>
<P>
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
W&auml;hrend AMIGA-Pr&auml;sident Bill McEwen im M&auml;rz mit einem sehr umfangreichen
Executive Update aufwartete, das ihr in dieser Ausgabe nat&uuml;rlich in einer
deutschen &Uuml;bersetzung findet, waren die Nachrichten der ersten Apriltage
eindeutig von der Amiga-Messe in St. Louis bestimmt. Dort wurde das Amiga-
Entwicklersystem, auf dem die Software des Amiga der n&auml;chsten Generation
programmiert werden soll, pr&auml;sentiert, ebenso wie die Partnerfirmen AMIGAs
(Sun Microsystems, RedHat und Corel) und viele weitere Details zur Zukunft.
All dies findet ihr ebenfalls in dieser Ausgabe von AMIGA aktuell.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (<A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>).
</LI>
<BR><LI> Leider kam auf unsere Anfrage in der letzten Ausgabe, ob eine
  Mailingliste f&uuml;r AMIGA aktuell erw&uuml;nscht ist, nur von zwei Lesern eine
  Antwort. Sofern nicht noch weitere Reaktionen eintreffen, muss wohl davon
  ausgegangen werden, dass eine Mailingliste kaum auf Interesse st&ouml;&szlig;t.
</LI>
<BR><LI> Ist jemandem von euch bekannt, ob die &raquo;AA&laquo;-Diskette von Berlin PD noch
  erscheint?
</LI>
<BR><LI> Existiert die Essener Mailbox Empire noch?
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> wenden.
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
