<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Wie einst Commodore: AMIGA sponsort Fu&szlig;ballteam (von Markus Tillmann)</H2>
<P>
&raquo;Was Commodore konnte, kann AMIGA schon lange!
</P>
<P>
Schon seit l&auml;ngerer Zeit schwirrte mir der Gedanke durch den Kopf, ob es
nicht irgendeine M&ouml;glichkeit gibt, meine beiden wichtigsten Hobbys, Amiga
und Fu&szlig;ball, zu verbinden.
</P>
<P>
Als Trainer einer F-Jugend aus M&ouml;nchengladbach ist man nat&uuml;rlich st&auml;ndig
auf der Suche nach Leuten, die der Mannschaft in irgendeiner Form helfen,
sei es bei der Organisation eines Turniers oder bei der Anschaffung neuer
Trainingsanz&uuml;ge.
</P>
<P>
Und so kam ich auf die Idee: Warum sollte ich Petro Tyschtschenko nicht
einfach mal ansprechen, ob er nicht eventuell bereit w&auml;re, unserer
Mannschaft bei der Anschaffung neuer Anz&uuml;ge finanziell unter die Arme zu
greifen. Schlie&szlig;lich gab es auch einmal eine prominente Mannschaft, die,
damals noch mit dem Commodore-Schriftzug, Werbung f&uuml;r Amiga machte, n&auml;mlich
keine geringere Mannschaft, als die des FC Bayern M&uuml;nchen.
</P>
<P>
Also schickte ich (mit zun&auml;chst geringer) Hoffnung eine e-Mail an Petro
Tyschtschenko und ich mu&szlig; sagen, da&szlig; alles einfach so lief, wie ich es mir
gew&uuml;nscht hatte!
</P>
<P>
Sofort bekam ich eine Antwort und das Zeichen, da&szlig; Interesse bestehe und
nach einigen formellen Kleinigkeiten war es dann auch schon soweit:
Wir bekamen unsere Anz&uuml;ge mit dem Schriftzug powered by AMIGA!!!
</P>
<P>
<A HREF="img/Sponsoring1.jpg"><IMG SRC="thumb/Sponsoring1.jpg" WIDTH="120" HEIGHT="82" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Sponsoring2.jpg"><IMG SRC="thumb/Sponsoring2.jpg" WIDTH="120" HEIGHT="83" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Sponsoring3.jpg"><IMG SRC="thumb/Sponsoring3.jpg" WIDTH="65" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Nicht nur, da&szlig; ich mich pers&ouml;nlich sehr dar&uuml;ber freue und den Anzug so oft
wie m&ouml;glich zur Schau trage, auch die Mannschaft war von den Anz&uuml;gen
begeistert und fuhr mit den Anz&uuml;gen in der aktuellen R&uuml;ckrunde bereits drei
Siege in drei Spielen ein!
</P>
<P>
Aber auch au&szlig;erhalb des Teams sorgten die Anz&uuml;ge schon bei einigen f&uuml;r
Aufsehen und Fragen, wie zum Beispiel: &quot;Amiga? Gibt es die noch? Was machen
die denn heute noch so?&quot;
Also steht wohl auch der Erfolg f&uuml;r Amiga keineswegs in Frage!
</P>
<P>
Ich m&ouml;chte mich im Namen der Mannschaft der DJK/VFL Giesenkirchen, der
Eltern und weiteren Betreuer noch einmal ganz herzlich bei Amiga und
speziell Petro Tyschtschenko bedanken!
Denn heute ist es keineswegs selbstverst&auml;ndlich und einfach, Helfer zu
finden, die Kinder und Jugendliche dabei unterst&uuml;tzen ihre Hobbys und
Visionen zu unterst&uuml;tzen und zu sichern - da&szlig; Amiga dies getan hat, zeigt
f&uuml;r mich die gro&szlig;e Klasse dieser Firma und hoffe, da&szlig; es nun auch bei Amiga
selber wieder bergauf geht - vielleicht wird ja wieder eine Marktposition
erreicht, wie zu dem Zeitpunkt, als man Bayern M&uuml;nchen sponsorte.
</P>
<P><B>Markus Tillmann &lt;<A HREF="mailto:golz@online-club.de">golz@online-club.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
