<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Personenvorstellung: Animationszeichner Eric Schwartz (von Oliver Tacke)</H2>
<P>
&raquo;Oft h&ouml;rt man, da&szlig; die NASA noch Amigas benutzt, da&szlig; in diversen Filmen
Spezialeffekte mit Amigas erstellt wurden, usw. Von eher unbekannten, aber
dennoch talentierten Leuten, die Amigas benutzen, h&ouml;rt man aber selten. Und
zu dieser Gattung geh&ouml;rt zweifelsfrei Eric W. Schwartz.
</P>
<P>
In den sp&auml;ten 80er Jahren las Eric in einem Magazin vom Amiga und dessen
Grafikf&auml;higkeiten, die ihn interessierten, und 1988 kaufte er sich seinen
ersten Amiga 500.
</P>
<P>
Bis zu diesem Zeitpunkt besa&szlig; er einen C64 und war nat&uuml;rlich von den
M&ouml;glichkeiten, die der Amiga bot, beeindruckt. Besonders faszinierten ihn
die Grafik- und Soundeigenschaften.
</P>
<P>
Nachdem Eric das Programm &quot;Moviesetter&quot; von Gold Disk entdeckt hatte,
erstellte er seine ersten Zeichentrickfilme wie z.B. &quot;Stealthy Maneuver&quot;
und &quot;How to run into a wall&quot;. Diese entstanden auf besagtem Amiga 500 mit
einem MB Speicher und einem zweiten Diskettenlaufwerk.
</P>
<P>
Sp&auml;ter, als Eric aufs College ging, bekam er einen Amiga 2000 und r&uuml;stete
ihn mit 3 MB Speicher auf. Auf diesem entstanden dann die etwas bekannteren
Werke wie &quot;The Anti-Lemming Demo&quot; und der erste &quot;Flip the frog&quot; Film. Auf
letzteren war er sehr stolz, weil er trotz der Begrenzung auf 3 MB fast
vier Minuten lang ist.
</P>
<P>
Und wo wir gerade bei Fr&ouml;schen sind: das Comic Intro des Spiels &quot;Superfrog&quot;
stammt von niemand geringerem als Eric.
</P>
<P>
Bekannt d&uuml;rften aber auch diverse Zeichnungen von Eric sein, die den
Werdegang des Amiga kommentieren, wie z.B. das legend&auml;re &quot;The Survivor&quot;.
</P>
<P>
Die bekanntesten von Eric erschaffenen Charaktere d&uuml;rften allerdings Amy
und Sabrina sein, deren Lebensgeschichte in Form von Comicstrips regelm&auml;&szlig;ig
im Internet weitergesponnen wird und nat&uuml;rlich nicht ohne den Amiga
auskommt. Angefangen bei einer Computermesse, wo Sabrina sich einen
Provider f&uuml;r den Internetzugang sucht, &uuml;ber diverse Beziehungsprobleme von
Amy bis hin zu Sabrinas kleinen Schwester und Nervens&auml;ge Tabitha - gut
gezeichnet, lustig, sehenswert!
</P>
<P>
Erics aktuelles System ist ein Amiga 4000T mit einer Cyberstorm PPC,
Cybervision 64, VLab Motion, Multiport-Karte, und noch mehr. Vorbildlich
l&auml;uft darauf OS 3.5. F&uuml;r seine Zeichnungen benutzt er haupts&auml;chlich
Personal Paint und Photogenics.
</P>
<P>
Und was Eric von den neuen Amiga-Eignern Bill McEwen und Fleecy Moss h&auml;lt
und ob er glaubt, da&szlig; sich nun endlich etwas tut, das lasse ich ihn selbst
beantworten...
</P>
<P>
 Es ist sicherlich schwer zu sagen. Ich mu&szlig; zugeben, da&szlig; ich aufgeregter
 war, als Jim Collas und Gateway den Ton angaben und das neue AmigaOS einen
 Linux Kern haben sollte. Ich meinte, da&szlig; dies die gr&ouml;&szlig;te Hoffnung auf ein
 Aufsteigen des Amigas aus der Dunkelheit und auf eine starke
 Alternativplattform zu Windows und dem Macintosh gewesen w&auml;re. Ich bin bei
 Bill McEwens und Fleecy Moss's neuen Amiga Pl&auml;nen nicht so zuversichtlich,
 aber ich bin gewillt mir das anzusehen, was sie anbieten werden. Es ist
 definitiv besser als das bi&szlig;chen, was Gateway plante, nachdem Jim Collas
 gegangen ist.
</P>
<P>
Viele Werke von Eric sind &uuml;brigens im Aminet zu finden unter...
</P>
<UL>
<LI> <A HREF="ftp://ftp.uni-paderborn.de/pub/aminet/pix/eric" TARGET="_top">ftp.uni-paderborn.de/pub/aminet/pix/eric</A>
</LI>
</UL>
<BR>
<P>Auf Erics eigene Seite gelangt man &uuml;ber...</P>
<UL>
<LI> <A HREF="http://www.coax.net/people/erics" TARGET="_top">http://www.coax.net/people/erics</A>
</LI>
</UL>
<BR>
<P>Und besagte Comicstrips schaut man sich an unter...</P>
<UL>
<LI> <A HREF="http://www.sabrinaonline.de" TARGET="_top">http://www.sabrinaonline.de</A>
</LI>
</UL>
<P><B>Oliver Tacke &lt;<A HREF="mailto:O.Tacke@surfway.de">O.Tacke@surfway.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
