<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Der Commodore-Untergang aus meiner Sicht - Teil 6 (von Rainer Benda)</H2>
<H3>&raquo;H&auml;tte ein &quot;CD32&quot; in ausreichender Menge den Untergang verhindern k&ouml;nnen?</H3>
<P>
Dave Haynie und andere Commodore (USA) Kollegen sind bis heute (?) der
Ansicht, da&szlig; ein CD32 in ausreichender St&uuml;ckzahl den Untergang von
Commodore h&auml;tte verhindern k&ouml;nnen.
</P>
<P>
Ich teile diese Ansicht nicht. Das &quot;Projekt&quot; CD32 wurde als Geheimsache
deklariert und &quot;wir von der Technik&quot; durften nicht eine Silbe zu diesem
Produkt erfahren. H. Jost tat alles, damit wir nicht auch noch dieses
Projekt &quot;vereiteln&quot; (als ob es je in unserer Absicht stand, Commodore zu
schaden).
</P>
<P>
Wir erfuhren vom CD32 erst, als wir es im Quelle-Katalog sahen und fragten,
ob das ein Produkt von uns sei, oder ein Druckfehler im Katalog.
</P>
<P>
Bis zu diesem Zeitpunkt gab es nur Ger&uuml;chte, Commodore w&uuml;rde eine 32-Bit
Spielekonsole entwickeln. Es gab in Deutschland einen CD32 &quot;Prototyp&quot;, der
in einem alten gammeligen Lederkoffe im Vertrieb herumgereicht wurde. Ich
hatte die Ehre (eigentlich war es mit harten Strafen belegt, sollten wir
davon Wind bekommen - aber f&uuml;r alles gab es Mittel und Wege :-)) einen
Blick in den Koffer werfen zu d&uuml;rfen. Ich schnappte mir (das Teil musste so
schnell wie m&ouml;glich in den Koffer zur&uuml;ck) das Ger&auml;t, baute es kurz
auseinander, legte die Platine einfach auf einen Kopierer und schraubte das
Teil wieder zusammen und schon war es wieder im Koffer.
</P>
<P>
Anhand der Platinenkopie konnte man wenigstens erahnen, um was es sich bei
dem Teil handelte. Proteste unserer Seite konnten wir offiziell erstmal
nicht rauslassen, da sich sonst jeder gefragt h&auml;tte, woher wir Infos zu dem
Ger&auml;te bekommen haben. Also liessen wir erstmal den Vertrieb und die
Marketing Abteilung daran werkeln. Wie gesagt, die Amiga-Gruppe war v&ouml;llig
au&szlig;en vor.
</P>
<P>
Einige Zeit sp&auml;ter bekamen wir das Teil zu Gesicht und sollten es dem
Vertrieb (Hermann H&auml;hner - wechselte sp&auml;ter zu Acorn) und der Marketing
Chefin (Karola Bode - ging sp&auml;ter zu Gateway und ist nun bei Compaq)
vorf&uuml;hren. Konnten wir anfangs nat&uuml;rlich nicht, weil uns das Teil ja v&ouml;llig
unbekannt war.
</P>
<P>
Nachdem wir uns vorab 2-3 Stunden mit dem CD32 auseinandersetzen konnten,
stand f&uuml;r uns fest, da&szlig; Grauen erreichte seine n&auml;chste Stufe. Der
sogenannte &quot;Prototyp&quot;, war in diesem Stadium eigentlich schon die
Verkaufsversion. Das Geh&auml;use passte nicht 100%ig zusammen, der Ein-
/Ausschalter hakte Das Joypad (im Vergleich zum damaligen SEGA System und
dem SNES von Nintendo) war sehr gew&ouml;hnungsbed&uuml;rftig.
</P>
<P>
Au&szlig;er einer DEMO-CD gab es f&uuml;r das CD32 keine verf&uuml;gbaren Titel. Wie
stellten also das Ger&auml;t den beiden vor und durften uns anh&ouml;ren, da&szlig; man mit
dem Teil doch keinen Blumentopf gewinnen k&ouml;nne und da&szlig; das CD32 doch keine
Konkurrenz zu anderen Konsolen darstelle (von einer Erweiterbarkeit zu
einem Amiga war da noch nicht die Rede). Wir waren nat&uuml;rlich &quot;v&ouml;llig
&uuml;berrascht&quot; von solchen Argumenten. Bis dahin dachten wir eigentlich immer,
wir seien die Schlimmsten bei Commodore......
</P>
<P>
Der Vertrieb arbeitete zeitgleich an einem Gutschein, der jedem CD32
beigepackt werden sollte. Wir legten nat&uuml;rlich Protest ein, denn eine
Konsole ohne Spiele ist der Witz schlechthin. Der Vertrieb hatte nat&uuml;rlich
das Problem, da&szlig; das CD32 auf den Markt musste, aber ohne Titel die
Einf&uuml;hrung auch schnell nach hinten losgehen konnte. Gottseidank erschienen
dann kurz vor Einf&uuml;hrung noch &quot;OSCAR &amp; DIGGERS&quot;, die dem CD32 beigelegt
werden konnten.
</P>
<HR>
<P>
Noch vor dem CD32 habe ich mich vor lauter Frust &uuml;ber die Handlungsweise
von Commodore via Fax bei Irving Gould (Chairman of the Board) um den Job
von Mehdi Ali und/oder dem von Helmut Jost beworben. Ich erhielt keine
Antwort und schickte es 14 Tage sp&auml;ter gerade nochmal ab. Es war mir zu
dieser Zeit v&ouml;llig egal, ob ich rausfliege oder nicht, denn das war sowieso
nur eine Frage der Zeit, wie sich sp&auml;ter f&uuml;r uns zeigte. Mir war der
Ausgang seit 1992 klar, auch wenn ich nie darauf &quot;hingearbeitet&quot; habe.
</P>
<P>
Ich bot Irving an, mich f&uuml;r 50% des Gehalts zu besch&auml;ftigen. Es w&auml;re schon
ausreichend gewesen, nur halb soviel Fehler zu fabrizieren, um Commodore zu
&quot;retten&quot;.
</P>
<P>
Die einzige Reaktion, die auf meine &quot;Bewerbung&quot; indirekt zur&uuml;ckkam war die,
da&szlig; mein Messeeinsatz zur Cebit 1993 nicht &quot;erforderlich&quot; war. Vermutlich
hatte man Angst, da&szlig; ich mit Irving Gould zusammentreffe, der bei meinem
Anblick vielleicht einen Herzinfarkt bekommen h&auml;tte. Ich bin selbst auch
nicht zur Cebit gefahren. F&uuml;r mich war 1993 das Jahr der &quot;Aufgabe&quot;. Es war
nichts mehr zu tun.
</P>
<P>
Zum Zeitpunkt des CD32 war Helmut Jost nicht mehr bei Commodore.
M&ouml;glicherweise auch ein Ergebnis meiner Bewerbung, aber ich denke, da&szlig; es
schon andere (finanzielle) Gr&uuml;nde gab. Alwin Stumpf wurde als neuer
Gesch&auml;ftsf&uuml;hrer eingestellt. Er kam Anfang(?) 1993.....Januar oder Februar
m&uuml;sste es gewesen sein.
</P>
<P>
Als Alwin kam, hatten viele noch die Hoffnung, da&szlig; sich alles zum Positiven
wendet, einige hatten aber auch die Bef&uuml;rchtung, er w&auml;re nur f&uuml;r die
Abwicklung Commodore's eingestellt worden (zu denen geh&ouml;rte auch ich).
</P>
<P>
In einer Betriebsversammlung wollten wir diese Punkte kl&auml;ren, doch wir
erfuhren nichts genaues. Alwin teilte uns mit, da&szlig; wir pro Quartal xx Mio.
DM Umsatz erzielen m&uuml;ssten, damit keine Arbeitspl&auml;tze gef&auml;hrdet w&auml;ren. Auf
die Frage unseres Betriebsrats, ob bei Erreichen der Umsatzvorgabe wirklich
keine Mitarbeiter entlassen werden w&uuml;rden, gab es keine Aussage mehr.
</P>
<P>
Es sei zu erw&auml;hnen, da&szlig; wir den Umsatz tats&auml;chlich erzielten und trotzdem
Stellen abgebaut wurden. Man kann sagen im 10er-Pack. Die Sache w&auml;re noch
ertr&auml;glich gewesen, w&auml;ren die Mitarbeiter rechtzeitig vorher informiert
worden, um sich nach neuer Arbeit umzusehen, so erwischte es viele von uns
kalt.
</P>
<P>
Tja, 1993 war eigentlich schon ein &quot;ruhiges&quot; Jahr. Alwin Stumpf vermied es,
auch nur eine unn&ouml;tige Entscheidung zu treffen. In meiner Wut ging es
soweit, da&szlig; ich ihm Memos im &quot;Multiple Choice&quot;-Verfahren vorgab, so dass er
lediglich die Antwort ankreuzen musste.
</P>
<P>
Auch hier keine Reaktion. Als ich ihn einmal pers&ouml;nlich &quot;zu fassen&quot; bekam,
das war etwa Juli/August 1993, fragte ich zuerst, warum nicht die
&uuml;berteuerten &quot;Vorgesetzten&quot; entlassen wurden (f&uuml;r einen Abteilungsleiter
h&auml;tte man vier von uns einen Monat besch&auml;ftigen k&ouml;nnen).....keine
Antwort.....dann fragte ich ihn, warum Commodore Deutschland nicht alleine
weitermacht, woraufhin er mir nur sagte (w&ouml;rtlich!), er habe keine Lust. Er
wolle mit seinem Schwager im Osten Multimedia-Hardware produzieren und
vertreiben.
</P>
<P>
Kommentar: &quot;keine Lust&quot; ist eine klasse Antwort und zeigt, mit wieviel
sozialer Verantwortung manch einer vorgeht. :-( - Auftr&auml;ge und
&quot;bescheidene&quot; finanzielle Mittel waren zu dem Zeitpunkt noch vorhanden.
</P>
<P>
Nachdem wir unsere K&uuml;ndigungen erhielten und wir noch ca. 3 Wochen &quot;Zeit&quot;
hatten, &quot;irgendwas&quot; zu tun und es mir innerlich einfach keine Ruhe lie&szlig;,
schlug ich Wilfried H&auml;ring vor, ein Treffen mit Mehdi Ali zu organisieren.
</P>
<P>
Ich konnte mir nicht vorstellen, da&szlig; Mehdi Ali wirklich so ein Ar*chloch
sein sollte, als das er immer hingestellt wurde. Sicher, Mehdi Ali kam aus
der Finanzwelt und er hatte mit Computern nicht allzuviel zu tun, aber das
ER derjenige sein sollte, der an allem Schuld war, war mir einfach zu hoch.
Im Video von Dave kommt Mehdi Ali auch nicht besonders gut weg und ich kann
auch nicht f&uuml;r Commodore USA (Westchester) sprechen, ich kann nur meine
Erfahrung wiedergeben.
</P>
<P>
Wir versuchten &quot;wieder&quot; den Weg &uuml;ber Petro Tyschtschenko. Er teilte uns
mit, da&szlig; er es versuchen w&uuml;rde, ein Treffen zu organisieren. In dieser Zeit
haben Wilfried und ich (aus der Sicht der Situation von Commodore
Deutschland) ein Papier zusammengeschrieben, in dem wir die notwendigen
Schritte und Vermarktungsm&ouml;glichkeiten der vorhandenen Produkte
festgehalten haben. Es waren wirklich keine revolution&auml;ren Pl&auml;ne, das ging
einfach nicht mehr. Es ging uns vielmehr um den Abverkauf mancher Leichen,
der uns zumindest Geld f&uuml;r die &quot;Zukunft&quot; in die Kasse gebracht h&auml;tte.
</P>
<P>
Ca. 2 Wochen vor unserem Abgang schaute ich aus dem Fenster und sah, da&szlig;
Petro mit Mehdi eintrafen. Ich sah hier die Chance loszulegen, da es mit
einem richtigen &quot;Termin&quot; f&uuml;r ein Gespr&auml;ch eher schlecht aussah. Wir liefen
die Treppe runter und fingen Mehdi und Petro vor dem Fahrstuhl ab und baten
ihn um ein Gespr&auml;ch unter 6 Augen. Er war daf&uuml;r nicht sehr zug&auml;nglich, gab
uns aber die M&ouml;glichkeit, zwischen Cola-Automat und Fahrstuhl unser
Anliegen vorzutragen.
</P>
<P>
Das haben wir dann auch gemacht, mit der ent&auml;uschenden Aussage von Mehdi,
da&szlig; er unsere Bem&uuml;hungen l&ouml;blich f&auml;nde, diese Aktionen Commodore aber nicht
mehr retten k&ouml;nnten. Es sei daf&uuml;r einfach viel mehr Geld n&ouml;tig. Er sagte
weiter, da&szlig; er unsere Unterlagen an Alwin Stumpf (na Danke) weiterleiten
w&uuml;rde, der sich dann mit uns in Verbindung setzen w&uuml;rde.
</P>
<P>
Das war's dann endg&uuml;ltig f&uuml;r uns. Alwin kam dann auf uns zu (eher auf
Wilfried, da ich an einem Gespr&auml;ch mit Alwin kein Interesse mehr hatte),
war leicht sauer, da&szlig; wir ihn mit der Mehdi-Aktion &quot;&uuml;bergangen&quot; h&auml;tten und
bot Wilfried H&auml;ring dann an, gegen Beteiligung die von uns genannten
&quot;Leichen&quot; zu verkaufen. Wilfried teilte mir das mit, und dass mich Alwin
diesbez&uuml;glich auch sprechen wollte. Ich lehnte ab.
</P>
<P>
Zum 30.09.1993 gingen 13 Kollegen und ich einen anderen Weg. Personen wie
Doc Peter Kittel (unter Ber&uuml;cksichtigung der Berufsjahre etc.) gingen ganz
zum Schlu&szlig;, so Anfang 1994.
</P>
<HR>
<P><B>Sven Drieling schrieb:</B></P>
<UL TYPE="square">
<LI>  Apropro Frage, zu Ali hattes Du erstmal recht ausf&uuml;hrlich geschrieben
</LI>
<BR><LI>  was anderen von ihm halten aber dann sp&auml;ter nur noch den Inhalt Eures
</LI>
<BR><LI>  Gespr&auml;che beschrieben. Wie war denn nun Dein pers&ouml;nlicher Eindruck
</LI>
<BR><LI>  von Ali aufgrund des kurzen Treffens zwischen T&uuml;r und Angel?
</LI>
</UL>
<P>
Ich nehm die Frage mit auf :-)
</P>
<P>
Ich bin mir nicht ganz im Klaren...bei dem Gespr&auml;ch hatte ich einen recht
seri&ouml;sen Eindruck von ihm, weder ausgeflippt noch
desinteressiert....einfach sachlich....ich &quot;glaube&quot;, er hat sich zuviel von
seinen Gesch&auml;ftsf&uuml;hrern der einzelnen Niederlassungen einlullen
lassen...._mein_ Eindruck, obwohl Mehdi in DAVEs Video &uuml;berhaupt nicht gut
wegkommt....ob das alles so berechtigt ist.......ich habe mir das Video und
die Gespr&auml;che mehrmals angesehen, es kam mir vor als ginge es da um eine
andere Person.
</P>
<P>
Aber vielleicht hat er sich gerade mal bei uns zusammengerissen.....
</P>
<P><B>Rainer Benda&laquo;</B></P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
