<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neues Executive Update von AMIGA-CEO Bill McEwen</H2>
<P>
Die folgende &Uuml;bersetzung von Christoph Gutjahr wurde uns freundlicherweise
von unserem Partner amiga-news.de zur Verf&uuml;gung gestellt:
</P>
<P><B>&raquo;Bill McEwen - 2. November 2002</B></P>
<P><B>Seien Sie gegr&uuml;&szlig;t!</B></P>
<P>
Dem Amiga und denen, die die &quot;World of Amiga&quot; besuchen, steht ein
gro&szlig;artiges Wochenende bevor. Und ich bin mir sicher, dass diejenigen, die
nicht auf der Show sind, mit den Fortschritten zufrieden sein werden, die
wir als Firma hinsichtlich der Auslieferung neuer Produkte gemacht haben.
</P>
<P>
Wie Sie vielleicht noch aus dem letzten Update in Erinnerung haben, haben
wir das Unternehmen in zwei separate Bereiche geteilt. Wir haben ein
&quot;Desktop&quot;-Team, das seine Aufmerksamkeit dem AmigaOne und AmigaOS4.0
widmet, und wir haben das &quot;Mobile&quot;-Team, das sich auf Amiga Anywhere und
die Herstellung und den Vertrieb der verschiedenen Produkte und Plattformen
konzentriert, die wir unterst&uuml;tzen.
</P>
<P>
Diese &Auml;nderungen und die unglaublich harte Arbeit sind nun soweit, dass wir
sie Ihnen zeigen und ank&uuml;ndigen k&ouml;nnen. Sie werden nicht nur neue Produkte
zu sehen bekommen, wir waren sogar in der Lage, ein paar sehr schwere
Kaliber f&uuml;r den Vertrieb und die Verf&uuml;gbarkeit dieser neuen Produkt in den
L&auml;den unter Vertrag zu nehmen.
</P>
<P>
Das Desktop-Team konzentriert sich auf neue Produkte und Dienste f&uuml;r die
Amiga Community, and das Mobile-Team besch&auml;ftigt sich mit Produkten und
Diensten f&uuml;r die erweitere Amiga Community, wobei unsere ersten Angebote
auf den PocketPC, die PocketPC Phone Edition und die SmartPhones zielen.
Unser erster Abnehmer f&uuml;r SmartPhones wurde ja bereits angek&uuml;ndigt - Sendo,
unser Partner f&uuml;r Ihr Z100 Telefon. Und im Folgenden werden Sie mehr &uuml;ber
unser n&auml;chstes Angebot f&uuml;r PocketPC und PocketPC Phone Edition erfahren.
</P>
<P>
Jetzt k&ouml;nnen wir mit der Transformation von einer Entwickler-Firma zu einer
Firma, die Produkte ausliefert beginnen. Und Sie k&ouml;nnen losziehen und sich
diese Produkte kaufen.
</P>
<P><B>Soviel zur Einleitung, los geht's:</B></P>
<P>
1. Wir ziehen in neue B&uuml;ror&auml;ume um, und wir werden eine neue Adresse haben,
Kontaktinformationen werden n&auml;chste Woche ver&ouml;ffentlicht. Es gibt also
keinen Grund, sich dar&uuml;ber Sorgen zu machen, was mit dem B&uuml;ro los sei, wir
profitieren von dieser &Auml;nderung. Wir mussten in eine Region umziehen, die
n&auml;her an den Diensten und Firmen liegt, mit denen wir zusammenarbeiten.
</P>
<P>
2. Der AmigaOne steht in den Startl&ouml;chern und ich habe die Ank&uuml;ndigung von
Eyetech hier an dieses Update angeh&auml;ngt. Gl&uuml;ckwunsche an alle und an die
Community f&uuml;r Ihre neue Amiga Hardware.
</P>
<P>
3. OS 4.0 ist beinahe fertig und das Team von Hyperion arbeitet sehr hart
daran, alles fertigzustellen. Sie wurden durch einige Low-Level Arbeiten am
AmigaOne aufgehalten und da diese Arbeiten jetzt beendet sind, sind sie
soweit, dass sie die letzten fehlenden Arbeitschritte angehen k&ouml;nnen, um
ein ein fantastisches Produkt anzubieten.
</P>
<P>
4. In den n&auml;chsten Wochen wird es einige Ank&uuml;ndigungen von Drittherstellern
geben, die jetzt OS4-Versionen ihrer Software erstellen. Ich habe
zugestimmt, dass ich ihnen nicht den Auftritt verderben werde, sondern sie
zuerst ihre eigenen Ank&uuml;ndigungen machen lasse, und wir werden sie dann auf
unserer Seite auflisten, nachdem sie ver&ouml;ffentlicht wurden.
</P>
<P>
5. &quot;Amiga Games Pocket Paks&quot; werden um die Thanksgiving Ferien herum von
verschiedenen H&auml;ndlern in den USA und England erh&auml;ltlich sein, u. a. bei
CompUSA und mmO2 in England. Ja, was Sie da lesen ist korrekt. Die Amiga
Games Pocket Paks eins und zwei werden dieses Jahr f&uuml;r 29.95 [verm. US$,
Anm. d. &Uuml;bers.] ausgeliefert und werden bei verschiedenen autorisierten
H&auml;ndlern in den USA und bei mmO2 in England erh&auml;ltlich sein. Jeder dieser
Pocket Paks enth&auml;lt vier Spiele, und zwei weitere Paks werden folgen. Das
sind gro&szlig;artige Neuigkeiten, da tausende von Kunden hier und in England in
der Lage sein werden, Amiga Inhalte auf ihren PocketPCs und PocketPC Phone
Edition Ger&auml;ten auszuprobieren.
</P>
<P>
6. Des weiteren werden wir noch vor Weihnachten &quot;SmartPhonePacks&quot;
ver&ouml;ffentlichen. Diese werden den Pocket Packs &auml;hneln, allerdings sind sie
f&uuml;r die neuen SmartPhones gedacht, die dieses Jahr erscheinen. Wie Sie
wissen, werden diese auf dem neuen Sendo Z100 laufen, und sie werden auch
f&uuml;r die neuen Telefone von Orange erh&auml;ltlich sein.
</P>
<P>
In den n&auml;chsten Wochen werden noch einige weitere Produkte und
Partnerschaften angek&uuml;ndigt werden, aber wie bereits gesagt, solange es
nicht real und marktreif ist, werden wir abwarten.
</P>
<P>
Mit der Fertigstellung des AmigaOne, der neunzigprozentigen Fertigstellung
von OS4.0 und der M&ouml;glichkeit, Amiga-Inhalte durch nationale H&auml;ndlerketten
in den USA und England verkaufen zu lassen, w&uuml;rde ich wirklich sagen, dass
wir sehr besch&auml;ftigt waren.
</P>
<P>
Also danke ich Ihnen nochmals f&uuml;r Ihre Geduld und Ihre Unterst&uuml;tzung, und
damit beginnen nun die n&auml;chsten Schritte unserer Entwicklung. Die
Transformation von der Produkt-Entwicklung zur Auslieferung von Produkten
hat begonnen. Ich freue mich wirklich auf die n&auml;chste Zusammenstellung von
Ank&uuml;ndigungen und Produkt-Auslieferungen.
</P>
<P><B>In Zuversicht und weiterhin im Vorw&auml;rtsgang,</B></P>
<P><B>Bill McEwen und der Rest des Amiga Teams&laquo;</B></P>
<P><B>(Quelle des englischen Originals: AMIGA, Inc.)</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
