<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Zwischenruf.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Zusammenfassung neuer Informationen zu Amithlon (von J&uuml;rgen Grieger)</H2>
<H3>5. September:</H3>
<P>
Bill McEwen erl&auml;utert in seinem Executive Update, dass der Amithlon-
Nachfolger ein wunderbares Programm sei und dessen Ver&ouml;ffentlichung kurz
bevorstehen w&uuml;rde. Die bisherigen Verz&ouml;gerungen seien nicht durch die
Entwicklung des Programms verursacht worden.
</P>
<P>
Der AMIGA-CEO betonte, dass einige der gew&uuml;nschten Features integriert
worden seien und die Software jedem &quot;die Socken ausziehen&quot; werde. Weitere
Informationen zur Ver&ouml;ffentlichung und zum neuen Namen sollen sehr bald
herausgegeben werden.
</P>
<H3>14. September:</H3>
<P>
In einem Statement von Bernd Meyer &auml;u&szlig;ert sich der Amithlon-Autor zu dem
auf der &ouml;sterreichischen Amiga-Messe O.A.S.E. von Harald Frank (VMC)
vorgestellten &quot;Amithlon XL&quot;. Er sei in keinster Weise in dieses Produkt
involviert und habe keine Ahnung, was sich dahinter verberge.
</P>
<P>
Zur Zeit sei es f&uuml;r ihn unklar, ob es sich um ein AddOn f&uuml;r existierende
Amithlon-User oder um ein Paket inklusive der Emulator-Executables und ROM-
Files handelt. Falls es sich nur um eine Treiber-CD o.&Auml;. handelt, habe er
absolut keine Probleme damit.
</P>
<P>
Ferner betont er, dass nur die Amithlon-Bestandteile, die unter der GPL
(GNU Public License) ver&ouml;ffentlicht wurden, anderen zur Verf&uuml;gung st&uuml;nden.
Die Firmen VMC oder Haage &amp; Partner bes&auml;&szlig;en keine Lizenz f&uuml;r Amithlon XL,
falls dieses Bestandteile enthalte, die von ihm stammen.
</P>
<P>
Ferner h&auml;tten die genannten Firmen keinerlei Lizenz von AMIGA, Inc. zum
Vertrieb der von Amiga-Emulatoren ben&ouml;tigten Kickstart/Workbench-Dateien
erworben.
</P>
<H3>19. September:</H3>
<P>
Haage &amp; Partner &auml;u&szlig;ert sich auf seiner Homepage zu diesem Konflikt (siehe
gesonderte Meldung in dieser AMIGA-aktuell-Ausgabe).
</P>
<H3>12. Oktober:</H3>
<P>
Die Autoren von AmithlonTV suchen nach Programmierern, die sich mit TV-
Karten auskennen, eine besitzen und willens sind Treiber f&uuml;r diese zu
programmieren.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Dringend ben&ouml;tigt werden:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">* Treiber f&uuml;r so viele Chips wie m&ouml;glich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">* TV-Programme mit einer netten Oberfl&auml;che und Skins&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">* Eine Videorecorder-Anwendung.&nbsp;</TD></TR>
</TABLE>
<P>
Amithlon TV sei nicht kommerziell und werde es in Zukunft auch nicht
sein, daher g&auml;be es f&uuml;r dieses Projekt keine Bezahlung.
</P>
<P><B>J&uuml;rgen Grieger &lt;<A HREF="mailto:JGR4475@t-online.de">JGR4475@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Zwischenruf.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
