<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>7. Neuigkeiten von Airsoft Softwair</H2>
<P><B>Airsoft Softwair (<A HREF="http://www.airsoftsoftwair.de" TARGET="_top">http://www.airsoftsoftwair.de</A>) informiert:</B></P>
<P>
&raquo;In den letzten Tagen wurde die Airsoft Softwair Homepage general &uuml;berholt.
Das alte Design war jetzt schon &uuml;ber drei Jahre relativ unver&auml;ndert
pr&auml;sent, weshalb es durch ein zeitgem&auml;&szlig;es ersetzt wurde. Au&szlig;erdem wurde die
Funktionalit&auml;t und die Benutzerfreundlichkeit der Homepage optimiert. Die
Airsoft Softwair Homepage steht weiterhin in zwei Sprachen zur Verf&uuml;gung:
Die deutsche Version finden Sie unter <A HREF="http://www.airsoftsoftwair.de" TARGET="_top">http://www.airsoftsoftwair.de</A> w&auml;hrend
die englische Version unter <A HREF="http://www.airsoftsoftwair.com" TARGET="_top">http://www.airsoftsoftwair.com</A> erreichbar ist.&laquo;
</P>
<P>
&raquo;Es ist soweit! Nach langer Entwicklungszeit ist jetzt endlich das
Multimedia-Autorensystem Hollywood erschienen. Hollywood ist ein m&auml;chtiges
und umfangreiches Programm, welches am Amiga einzigartig ist. Man k&ouml;nnte
Hollywood mit einer zeitgem&auml;&szlig;en Version von Scala vergleichen: Hollywood
arbeitet jedoch vollkommen im 24bit Modus und benutzt ausschlie&szlig;lich
Systemfunktionen, um absolute Kompatibilit&auml;t zu gew&auml;hrleisten. Durch diese
extrem systemfreundliche Programmierung l&auml;uft Hollywood auch auf Amiga-
Emulatoren und gibt dort nochmal richtig Gas. Versionen von Hollywood f&uuml;r
MorphOS und AmigaOS4 sowie evtl. AROS sind geplant. Auf der Produktseite
von Hollywood gibt es einen umfangreichen &Uuml;berblick inklusive Screenshots
&uuml;ber das Programm. In den n&auml;chsten Tagen werden hier einige Programme
vorgestellt, die mit Hollywood entstanden sind. Hollywood wird auf CD-ROM
ausgeliefert und kann ab sofort bestellt werden.
</P>
<P>
Hollywood ist der &quot;Multimedia Application Layer for Amiga(tm) and
compatible operating systems&quot;. Das bedeutet, dass Hollywood aus einer
einfachen Skriptsprache besteht, die m&auml;chtige Funktionen zur Verf&uuml;gung
stellt, um Multimedia-Anwendungen zu erstellen, die von einer einfachen
Pr&auml;sentation bis zu einem komplexen Spiel reichen.
</P>
<P>
Der gro&szlig;e Vorteil von Hollywood ist, dass es alle Nebenarbeiten f&uuml;r Sie
erledigt. Sie m&uuml;ssen sich z.B. nicht darum k&uuml;mmern, ob Ihre Anwendung auf
ECS, OCS, AGA oder einem RTG System l&auml;uft. Sie m&uuml;ssen sich auch nicht darum
k&uuml;mmern, ob der Workbench-Bildschirm auf dem Ihre Anwendung erscheint 16
oder 16,7 Millionen Farben besitzt. Sie k&ouml;nnen sich auf Ihre Anwendung
konzentrieren und nicht auf die Umgebung in der sie sp&auml;ter mal l&auml;uft.
</P>
<P>
Hollywood l&auml;uft komplett im 24-Bit-Modus, d.h. es werden keine Paletten
mehr benutzt und Sachen wie &quot;Remapping&quot; geh&ouml;ren somit der Vergangenheit an.
Die Farben werden immer direkt &uuml;bergeben. Au&szlig;erdem ist Hollywood voll in
das AmigaOS(tm) integriert und ben&ouml;tigt keine spezielle Hardware. Daher
l&auml;uft Hollywood auch unter Emulationen wie Amithlon oder WinUAE mit
atemberaubender Geschwindigkeit.
</P>
<P>
Mit der Hollywood Skriptsprache sind die M&ouml;glichkeiten fast unbegrenzt. Die
Standardversion von Hollywood kommt mit &uuml;ber 150 Funktionen die von
Dateisystemfunktionen bis hin zu Funktionen reichen, die Grafiken und
Animationen fl&uuml;ssig auf dem Bildschirm bewegen. Au&szlig;erdem k&ouml;nnen Bilder,
Objekte und Texte mit &uuml;ber 50 &Uuml;berblendeffekten angezeigt werden oder auch
skaliert werden.
</P>
<P>
Hollywood benutzt das Datatypes System um alle Grafiken, Animationen und
T&ouml;ne zu laden. Dadurch k&ouml;nnen Sie alle Formate benutzen, die von Ihren
Datatypes unterst&uuml;tzt werden. Au&szlig;erdem werden einzigartige Sachen
unterst&uuml;tzt wie transparente Fenster auf der Workbench, welche das look-
and-feel erheblich verbessern. Sie k&ouml;nnen True Type Schriften (mit Anti-
Aliasing), Standard Bitmap Fonts und sogar Amiga Color Fonts benutzen.
</P>
<P>
Das integrierte Soundsystem erlaubt es Musikmodule und Samples abzuspielen.
Sie haben volle Kontrolle &uuml;ber das Soundsystem, weil Sie die Kan&auml;le f&uuml;r die
Tonausgabe selbst festlegen k&ouml;nnen.
</P>
<P>
Hollywood ist ein aufwendiges Programm, welches viel Speicher braucht
um gut zu funktionieren. Es benutzt ein spezielles Preload-System, so dass
alle Daten sofort zugriffsbereit sind und die Wiedergabe z.B. von
Animationen extrem schnell ist. Es wird daher empfohlen, gen&uuml;gend Speicher
zu haben (16 Megabyte und mehr) sowie eine Grafikkarte zu besitzen.
</P>
<P>
Hollywood ist die absolute Nummer 1 in Sachen Amiga(tm) Multimedia und
bringt den Amiga zur&uuml;ck zu seinen Wurzeln...der Multimedia! Hollywood kommt
mit einem Compiler, der Ihre Anwendungen als selbst&auml;ndige Amiga-Programme
speichern kann, die dann frei weitergegeben werden k&ouml;nnen.
</P>
<P>
Hollywood wird auf CD-ROM geliefert mit vielen Beispielen sowie &uuml;ber 250
Kilobyte an deutscher Dokumentation im AmigaGuide Format. Es kann nur
direkt &uuml;ber den Autor bestellt werden. Auch wenn sich vieles kompliziert
anh&ouml;rt, ist es in der Praxis ganz einfach zu realisieren.
</P>
<P>
Programmierkenntnisse sind generell nicht erforderlich. Nur wenn man sehr
anspruchsvolle Anwendungen realisieren m&ouml;chte, sind Programmierkenntnisse
von Vorteil.
</P>
<P><B>Grafik:</B></P>
<UL>
<LI> L&auml;uft komplett im 24-bit Modus!
</LI>
<BR><LI> Transparente Fenster sind m&ouml;glich
</LI>
<BR><LI> &Uuml;ber 50 &Uuml;berblendeffekte f&uuml;r Bilder, Objekte und Text
</LI>
<BR><LI> Grafiken k&ouml;nnen fl&uuml;ssig bewegt (gescrollt) werden
</LI>
<BR><LI> Fl&uuml;ssige und schnelle Animationswiedergabe
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r transparente Grafiken und Animationen
</LI>
<BR><LI> Funktionen f&uuml;r Texturen
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r Datatypes
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r True Type, Bitmap und Color Fonts
</LI>
<BR><LI> Grafikskalierung ist m&ouml;glich
</LI>
<BR><LI> Anwendung kann auf Workbench oder eigenem Bildschirm laufen
</LI>
<BR><LI> Integriertes Undo-System
</LI>
<BR><LI> V&ouml;llig umgebungsunabh&auml;nging; es ist also egal ob Picasso96, CGfx, AGA,
   ECS oder OCS benutzt wird
</LI>
</UL>
<P><B>Sound:</B></P>
<UL>
<LI> Unterst&uuml;tzung f&uuml;r Samples
</LI>
<BR><LI> Volle Kontrolle &uuml;ber die Audiokan&auml;le
</LI>
<BR><LI> Mehrere Musikmoduleformate werden unterst&uuml;tzt
</LI>
<BR><LI> Lautst&auml;rke und Tonh&ouml;he k&ouml;nnen w&auml;hrend der Wiedergabe ver&auml;ndert werden
</LI>
<BR><LI> Samplegr&ouml;&szlig;e ist nicht begrenzt
</LI>
<BR><LI> Volle Stereowiedergabe
</LI>
</UL>
<P><B>Skriptsprache:</B></P>
<UL>
<LI> Variablen, Felder und Datentypen (String, Long, Float)
</LI>
<BR><LI> Bedingungen und Schleifen
</LI>
<BR><LI> Einfache Variablenhandhabung (keine Deklaration n&ouml;tig)
</LI>
<BR><LI> Funktionen f&uuml;r Stringmanipulationen und Rechenoperationen
</LI>
<BR><LI> Compiler und Linker um Anwendungen als Executable zu speichern
</LI>
<BR><LI> Eingebauter Fehlerhandler, der viel Arbeit abnimmt
</LI>
<BR><LI> Debug-Funktionen
</LI>
<BR><LI> Labels, die voll in den Benutzermodus integriert sind
</LI>
<BR><LI> Plugins k&ouml;nnen installiert werden um Funktionalit&auml;t zu erweitern
</LI>
</UL>
<P><B>Benutzereingabe:</B></P>
<UL>
<LI> Schaltfl&auml;chen k&ouml;nnen definiert werden
</LI>
<BR><LI> Unterst&uuml;tzung von Mausklick and Maus&uuml;ber-Ereignissen
</LI>
<BR><LI> Tastatureingaben k&ouml;nnen &uuml;berwacht werden
</LI>
<BR><LI> Systemtasten k&ouml;nnen &uuml;berwacht werden
</LI>
<BR><LI> Systemereignisse (Fenster wird bewegt, geschlossen, Gr&ouml;&szlig;e wird ver&auml;ndert
   usw.) k&ouml;nnen einfach &uuml;berwacht werden
</LI>
</UL>
<P><B>Systemfunktionen:</B></P>
<UL>
<LI> Lesen und Schreiben von Dateien
</LI>
<BR><LI> Einfache Handhabung, z.B. Verzeichnisse k&ouml;nnen einfach in ein Feld
   gelesen werden
</LI>
<BR><LI> Viele Dateioperationen
</LI>
<BR><LI> Viele Dateisystem-Funktionen
</LI>
<BR><LI> Funktionen um Informationen &uuml;ber das System herauszufinden
</LI>
<BR><LI> Funktionen um Informationen &uuml;ber die Systemausstattung herauszufinden
</LI>
<BR><LI> Locale.library kann benutzt werden
</LI>
<BR><LI> Zeit- und Datumsfunktionen&laquo;
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Schluss.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
