<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A></B></P>
<H2>1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren</H2>
<P>
Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<P><B>Die Frage des letzten Monats lautete:</B></P>
<P>
&raquo;Wie beurteilst du, dass das neue Strategiespiel Tales of Tamar gratis
abgegeben wird und daf&uuml;r Kosten pro gespielte Runde anfallen?&laquo;
</P>
<P><B>Cord Hagen meint dazu:</B></P>
<P>
&raquo;Ein mir bislang v&ouml;llig unbekanntes Vertriebskonzept betritt erstmals den
Markt. Ein Spiel wird kostenlos zur Verf&uuml;gung gestellt - m&ouml;chte man es eine
Runde weiterspielen, muss daf&uuml;r bezahlt werden. Wird Tales of Tamar
tats&auml;chlich ein Hit, so k&ouml;nnte auch das neue Vertriebskonzept ein Hit
werden. Raubkopierer werden es wenigstens ein bisschen schwerer haben -
Spieler mit Taschengeldbudget k&ouml;nnen das Spiel quasi in Raten kaufen, und
durch ein nie kommendes Ende kommt solange Geld f&uuml;r die Weiterentwicklung
herein, wie das Game die Spieler am Monitor fesseln kann. Aber eins kann
man jetzt schon behaupten: Durch diese neuen Wege macht Tales of Tamar auf
sich aufmerksam, wie schon lange kein Amiga-Game mehr - auch bei absoluten
Nichtspielern!&laquo;
</P>
<P><B>Kai Stegemann sieht f&uuml;r sich selbst Nachteile:</B></P>
<P>
&raquo;Macht's f&uuml;r den Hersteller sicherlich einfacher, an Kohle zu kommen. Es
wird aber f&uuml;r mich auch wieder unattraktiver. Das Projekt bleibt aber nach
wie vor interessant und unterst&uuml;tzenswert.&laquo;
</P>
<P>
<B>J&uuml;rgen Sperling sieht das Bezahlsystem von &quot;Tales of Tamar&quot; positiv:</B>
</P>
<P>
&raquo;Das Konzept, das Spiel &quot;Tales of Tamar&quot; gratis abzugeben und dann nach
gespielten Spielz&uuml;gen abzurechnen, ist kein schlechtes. So kaufe ich nicht
die Katze im Sack, sondern brauche erst etwas zu leisten, wenn ich mit der
Leistung der Programmierer zufrieden bin. Macht mir das Spiel keinen Spa&szlig;
mehr oder komme ich nicht weiter, bezahle ich auch nichts mehr daf&uuml;r. Damit
habe ich die faire M&ouml;glichkeit, mich f&uuml;r oder gegen dieses Spiel zu
entscheiden. Doch das geht vorerst nur bei einem Spiel, das die M&ouml;glichkeit
des WWW nutzt und einen Internet-Zugang voraussetzt.
</P>
<P>
Leider werde ich mich gegen ToT entscheiden, denn das Spiel schl&auml;gt eine
Richtung ein, die mir nicht so liegt. Nichtsdestotrotz w&uuml;nsche ich diesem
Spiel einen riesigen Erfolg, denn den hat es verdient.
</P>
<P>
Der Bericht von Michael Scholz zu ToT bot einen sehr sch&ouml;nen Einblick in
dieses Spiel. Die Beschreibung von ToT fand ich sehr ausf&uuml;hrlich, und in
Verbindung mit den Screenshots war das ein sehr interessanter Artikel.&laquo;
</P>
<P>
<B>Thorsten Klingler geht davon aus, dass &quot;Tales of Tamar&quot; ein voller Erfolg
wird:</B>
</P>
<P>
&raquo;Also im Prinzip ist dagegen nichts einzuwenden, da die Spielkosten ja
moderat gehalten werden. Wenn also die Qualit&auml;t stimmt, und das tut sie ja
offensichtlich, d&uuml;rfte das Spiel ein Hit werden.&laquo;
</P>
<P><B>Nun zur aktuellen Frage des Monats:</B></P>
<P>
&raquo;Welche Erwartungen stellst du an die neuen Betriebssysteme AmigaOS 4.0 und
MorphOS 1.0?&laquo;
</P>
<P><B>Schickt eure Beitr&auml;ge bitte an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A></B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
