<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Review: Grafikadventure &raquo;Aqua&laquo; - deutsche Version</H2>
<P>
Vor kurzem erschien die deutsche Fassung von Aqua, einem &quot;Myst&quot;-&auml;hnlichen
Grafikadventure, das in der englischen Fassung bereits l&auml;nger erh&auml;ltlich
ist.
</P>
<P>
Die neue Version hat gegen&uuml;ber der englischen nicht nur den Vorteil,
komplett in Deutsch gehalten zu sein, sondern enth&auml;lt auch etliche Bugfixes
und eine Anleitung im HTML-Format. Zus&auml;tzlich zum eigentlichen Spiel findet
man auf der CD noch Demo-Versionen von BubbleBOBs sowie von SoftCinema und
Frogger, beides Video-Abspiel-Programme.
</P>
<P>
Von den Anforderungen her, die an die Hardware gestellt werden, ist Aqua
&auml;u&szlig;erst moderat. Ein 68020-Prozessor, AGA, AmigaOS 3.x und 8 MByte Fast-RAM
sowie ein CD-ROM-Laufwerk reichen aus und stellen heutzutage wohl auch den
Standard dar.
</P>
<P>
 <A HREF="img/aqua1.jpg"><IMG SRC="thumb/aqua1.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Installation des Spiels ist sehr unproblematisch, allerdings wartet
eine kleine Besonderheit auf den spielwilligen User. Entgegen &uuml;blicher
Standards bei Installationen m&uuml;ssen die Bildschirmmodi f&uuml;r Spiel- und
Video-Bildschirm VOR dem Start des Spiels durch Klick auf das Programm
&quot;Screenmode&quot; ausgew&auml;hlt werden. Diese Methode ist im Fall von Aqua aber
auch sinnvoll, da es komplett von CD-ROM l&auml;uft. Eine
Festplatteninstallation ist zwar m&ouml;glich und verbessert die Performance,
ist aber nicht unbedingt notwendig. Auf schnellen Amigas sollte auch beim
Spielen von CD-ROM gen&uuml;gend Performance vorhanden sein.
</P>
<P>
 <A HREF="img/aqua2.jpg"><IMG SRC="thumb/aqua2.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Der Start von Aqua offenbart, dass hier nicht der gleiche technische
Aufwand getrieben werden konnte wie beim gro&szlig;en Vorbild &quot;Myst&quot;. Die Grafik
ist insgesamt deutlich &quot;hausbackener&quot;. Der Videovorspann ist sehr kurz
gehalten  und erkl&auml;rt die Geschichte von Aqua extrem knapp und sparsam. F&uuml;r
das Verst&auml;ndnis von Aqua ist der Vorspann allerdings auch von
untergeordneter Bedeutung, die wirklich interessanten Dinge kommen erst im
Verlauf des Spiels ans Licht. Zu der Grafik ist noch zu sagen, dass sie
trotz verhaltener Qualit&auml;t sehr &uuml;bersichtlich gestaltet wurde und in den
bewegten Teilen sehr schnell reagiert.
</P>
<P>
Kommen wir zur Geschichte von Aqua. Im Atlantik sinkt eine Bohrinsel beim
schlimmsten Sturm, den man in diesen Breiten je gesehen hat. Fachleute sind
sich aber einig, dass der Sturm nicht die alleinige Ursache f&uuml;r das Sinken
der Bohrinsel sein kann. Der Spieler schl&uuml;pft nun in die Rolle eines
Abenteurers, der sich den Lebensunterhalt mit der Bergung diverser Sch&auml;tze
vom Meeresboden verdient, und der von dem Ungl&uuml;ck geh&ouml;rt hat. Er hofft, im
Bereich der gesunkenen Bohrinsel auf Dinge von Wert zu sto&szlig;en. Daher mietet
er sich von einem gl&uuml;cklosen Ozean-Forscher ein U-Boot mit
Bergungsausr&uuml;stung und macht sich auf den Weg in die Tiefe.
</P>
<P>
 <A HREF="img/aqua3.jpg"><IMG SRC="thumb/aqua3.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das Spiel beginnt auf einem Steg, an dem das U-Boot auslaufbereit liegt.
Hier bekommt man auch einen ersten Eindruck von der intuitiven Steuerung,
wie man sie schon von &quot;Myst&quot; kennt. Die Form des Mauszeigers gibt zu
erkennen in welche Richtung man sich bewegen kann. Am Anfang kann man sich
(sinnvollerweise) allerdings nur wenige Schritte vom U-Boot wegbewegen,
also sollte man besser direkt in das U-Boot einsteigen. Nach Druck auf den
Knopf, der mit &quot;Engine&quot; beschriftet ist, wird das Boot zu Wasser gelassen
und nimmt einen vorbestimmten Kurs auf.
</P>
<P>
Hier kommen wir nun zu einer Sache, die dem unge&uuml;bten Spieler die Freude
ein wenig tr&uuml;ben kann. Die meisten Tester sind zwar der Meinung, dass das
erste R&auml;tsel in sich logisch aufgebaut ist, aber ich kann das nicht
best&auml;tigen. F&uuml;r den unvoreingenommenen Spieler dreht sich das Spiel bereits
hier auf der Stelle, weil es an Hinweisen mangelt, was denn nun zu tun ist.
Nur durch Ausprobieren und Kombinieren aller M&ouml;glichkeiten wird man eher
zuf&auml;llig auf den Weg sto&szlig;en, der weiter f&uuml;hrt. Ein paar deutlichere
Hinweise h&auml;tten hier mit Sicherheit gut getan. Um ein wenig zu helfen, ein
kleiner Tipp: Entscheidend f&uuml;r das Weiterkommen sind hier sowohl die Liste
mit den Frequenzen der Walges&auml;nge als auch der Rekorder mit den Aufnahmen
dreier Walges&auml;nge.
</P>
<P>
 <A HREF="img/aqua4.jpg"><IMG SRC="thumb/aqua4.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die R&auml;tsel, die den Spieler im weiteren Verlauf des Spiels erwarten, sind
aber deutlich besser zu l&ouml;sen, und es mangelt auch nicht an Hinweisen, was
als n&auml;chstes zu tun ist. Eine ordentliche Portion Nachdenken ist aber
trotzdem (oder Gott sei dank, sonst w&auml;re es ja langweilig) vonn&ouml;ten.
</P>
<P>
Die anderen Zutaten des Spiels sind sehr solide und entsprechen dem, was
man von einem Spiels dieses Genres erwartet. Der Spieler hat die
M&ouml;glichkeit, Gegenst&auml;nde aufzunehmen und diese in einer Liste zu verwalten,
die Gegenst&auml;nde zu benutzen, abzulegen und so weiter. Es ist zu jeder Zeit
im Spiel m&ouml;glich, den aktuellen Spielstand abzuspeichern. Leider stehen dem
Spieler nur drei Speicherpl&auml;tze zur Verf&uuml;gung, und diese sind auch nur mit
Nummern versehen. Hier w&auml;re es besser gewesen, &auml;hnlich dem Vorbild, die
Spielst&auml;nde mit aussagekr&auml;ftigen Namen zu versehen. Ein paar Speicherpl&auml;tze
mehr w&auml;ren auch sinnvoll gewesen, da die drei Pl&auml;tze schnell belegt sind
und mitunter zur L&ouml;sung eines R&auml;tsels Informationen aus viel fr&uuml;heren
Episoden ben&ouml;tigt werden.
</P>
<P>
 <A HREF="img/aqua5.jpg"><IMG SRC="thumb/aqua5.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das Fazit f&uuml;r Aqua f&auml;llt aber insgesamt positiv aus. Es ist ein
grundsolides Adventure, das sowohl technisch als auch spielerisch
&uuml;berzeugen kann. Es l&auml;uft auf allen bekannten Plattformen, solange eine
Grafikkarte eingebaut ist, sowie auf AGA-Maschinen. Die Bugfixes der
deutschen Version haben offensichtlich auch kleinere Fehler behoben, die in
der englischen Fassung gest&ouml;rt haben, auch wenn diese keine unmittelbare
Auswirkung auf die Stabilit&auml;t des Systems hatten. Die Grafik ist zwar nicht
umwerfend, aber technisch ordentlich gemacht und sorgt auch f&uuml;r gute
Atmosph&auml;re. Das Gameplay wei&szlig;, bis auf den Patzer am Anfang, zu &uuml;berzeugen
und macht Lust auf mehr. Ich bin sicher, dass Aqua bei den Adventure-Fans
gro&szlig;en Gefallen finden wird.
</P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
