<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Der Zwischenruf
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P><B>Schlagseite: Shoot or die! (von Dennis Pauler)</B></P>
<P>
Der Amiganer war ja schon immer ein K&auml;mpfer-Typ, das liegt sehr tief
verwurzelt - schlie&szlig;lich war der Amiga in der Bl&uuml;te seiner Jugend bekannt
f&uuml;r seine Spiele. Na ja, haupts&auml;chlich Action-Spiele - Rollenspiele und
Adventures waren damals schon eher den schwarz-wei&szlig; piepsenden PCs
zugeschrieben (allein schon wegen der dort &uuml;blichen Festplatten). Und wie
hie&szlig; es schon bei Turrican? &quot;Remember: Shoot or Die!&quot;
Geschult durch Spiele-Klassiker wie &quot;Hunde des Krieges&quot;, &quot;W&ouml;ngs&quot; oder
&quot;Stille Bedienung&quot; nahmen die Amiganer auch schon sehr bald den Kampf gegen
den Erzfeind in Gestalt der Atari-Benutzer auf - man erinnere sich nur an
das denkw&uuml;rdige Anti-Atari-Demo der Black Monks. Obwohl: War irgendwie
schon ein ganz sch&ouml;ner Ohrwurm. &quot;Auf dem Tisch steht ein Atari. ST? Oweowe.
R&uuml;lps, kotz, etc.&quot; (Mir ist &uuml;brigens kein zweiter Fall bekannt, in dem sich
ein Konflikt zwischen zwei Unternehmen - wir erinnern uns: Commodore hatte
Atari in letzter Minute die Amiga-Technologie vor der Nase weggekauft -
derart konsequent auf die Kunden &uuml;bertragen hat. W&uuml;rden die Kunden von
Mobilcom und France Telecom einen auch nur ann&auml;hernd &auml;hnlichen Einsatz an
den Tag legen, dann w&auml;ren wir wohl schon l&auml;ngst wieder dabei, in Verdun
einzumarschieren...)
Na ja, die Amiga-Armee wuchs durch Umsteiger vom guten alten C64 jedenfalls
immer mehr an, bis unsere &quot;Freundin&quot; schlie&szlig;lich klar vor dem Atari lag und
weitere Diskussionen nicht mehr n&ouml;tig waren. Doch gleich darauf erschien am
Horizont die drohende Armada der 16-Bit-Konsolen, die mit spielerisch
erstklassigen Jump'n'Runs in die zweite Dom&auml;ne des Amiga eindrangen (so
schrieb einst der Amiga Joker in Ausgabe 9/91: &quot;Konnte der Amiga gegen
MegaDrive und PC-Engine in unserer Erstausgabe noch einen Sieg nach Punkten
verbuchen, so reicht es diesmal [im Vergleich mit dem SNES] nur f&uuml;r ein
Unentschieden.&quot;) Auch hier war also wieder viel Gelegenheit zum
Argumentieren und Missionieren, durch die bessere Erweiterbarkeit und die
neuen Amiga-Modelle 1200 und 4000 konnte die Amiga-Gemeinde aber
schlie&szlig;lich auch hier einen Sieg verbuchen.
</P>
<P>
Ein neuer Gegner musste her, und da boten sich nat&uuml;rlich die schwarz-wei&szlig;en
Piepskisten an, die mittlerweile gar nicht mehr so schwarz-wei&szlig; und lang
nicht mehr so piepsig waren. Mit brutaler Rechenkraft glichen sie die
Vorz&uuml;ge der Amiga-Custom-Chips aus und begangen den Amiga unaufhaltsam zu
&uuml;bertrumpfen. Mit AAA und RISC-Prozessoren war Commodore zwar schon dabei,
zum Gegenschlag auszuholen - durch den Konkurs konnten diese beiden
Wunderwaffen das Schlachtfeld aber nicht mehr erreichen.
</P>
<P>
Es begann still um unseren Lieblingsrechner zu werden. Eine kleine Gruppe
h&ouml;rte zwar nicht auf, dem Eindringling Widerstand zu leisten (&quot;Win95 =
Amiga85!&quot; &quot;Schlankheit!&quot; &quot;Bei so schnellen Spielen bekommt man eh nur
Kopfschmerzen!&quot;), aber irgendwann h&ouml;rten die PCler einfach auf, mit den
Amiganern zu diskutieren und ignorierten sie. (Fragt doch mal heute einen
13j&auml;hrigen, was &quot;Amiga&quot; ist? Der denkt wahrscheinlich eher an eine
Frauenzeitschrift...)
F&uuml;r die durch unz&auml;hlige Diskussionen gest&auml;hlten Amiganer war das nat&uuml;rlich
ungewohnt. Kein Widerspruch mehr? Das konnte, das durfte nicht sein. Doch
schlie&szlig;lich fanden sie wieder ein Thema, &uuml;ber das - und eine Gruppe mit der -
man trefflich streiten und diskutieren konnte: Die Zukunft des Amiga und
die Amiganer selbst.
</P>
<P>
Und so wurde das ganze (schon leicht angestaubte) Waffenarsenal wieder
ausgepackt: PowerPC gut und sch&ouml;n, aber welcher Kernel ist der bessere? RTG
ist ein Muss, aber welches Grafiksystem soll man nehmen? PCI-Karten im
Amiga? Eine Super-Idee! Aber welches ist das beste Board? Und f&uuml;r welches
der (nat&uuml;rlich zueinander inkompatiblen) Erweiterungskarten gibt es die
besseren Treiber?
Mit dem Versiegen des Software- und Hardware-Nachschubs wurde aber auch
diesen Diskussionen bald der Boden entzogen, und so kam es schlie&szlig;lich zu
der noch heute tobenden Schlacht der Ideen und Planungen: AmigaOne mit
AmigaOS 4.0 gegen Pegasos mit MorphOS 1.0...
</P>
<P>
Endlich gibt es wieder zwei unterschiedliche Plattformen (wenn auch noch
nicht im Laden erh&auml;ltlich), die gegeneinander antreten k&ouml;nnen - auch die
&quot;Community&quot; teilt sich bereits in zwei Lager. Wie in alten Zeiten wird hier
und da diskutiert, attackiert, missioniert und diffamiert (wo bleiben die
ersten Anti-[hier beliebiges neues OS einsetzen]-Demos?) Endlich kann die
K&auml;mpferseele in den alten Amiganern sich wieder austoben und beweisen, dass
man einfach besser als &quot;die anderen&quot; ist.
</P>
<P>
Zur Beruhigung der Situation wird es wohl erst kommen, wenn die beiden
Plattformen erh&auml;ltlich sind. Die neue Hardware wird es n&auml;mlich erm&ouml;glichen,
dass zeitgem&auml;&szlig;e Action-Spiele (z.B. 3D-Shooter) wieder g&auml;nzlich auf Amiga-
(kompatiblen)-Rechnern heimisch werden und die eigentlich doch ganz
liebenswerte Gruppe der Amiganer sich wieder auf das konzentrieren kann,
mit dem sie gro&szlig; geworden ist: Spielen...
</P>
<P><B>Dennis Pauler &lt;<A HREF="mailto:dennis.pauler@virtualdimension.de">dennis.pauler@virtualdimension.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
