<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Vorstellung: Photo CD Brasilien</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">CD Vorstellung: Photo CD Brasilien</font></center></h1></P>
<center><p><img src="brasilcd2.jpg"></Center></P>
<p>Diesen Monat lie&#223; mir der Andreas eine h&#246;chst ungew&#246;hnliche CD zum Vorstellen in der NC zukommen, die prim&#228;r mit dem Amiga eigentlich nix zu tun hat, sondern sich ganz dem Thema &quot;Brasilien&quot; gewidmet hat. Weil es sich aber eben um so eine ungew&#246;hnliche CD handelt, soll dies hier kein Test, sonder nur eine Vorstellung der vorliegenden CD werden. Also auf nach Brasilien!</P>

<p><h2><center><font color="yellow">Eine Silberscheibe aus Brasilien? Nicht ganz...</font></h2></center></P>
<p>Bei der &quot;Photo CD Brasilien&quot; handelt es sich um ein Ein-Mann Projekt von Patrick Henze, der sich f&#252;r Inhalt &amp; Vertreibung der CD verantwortlich zeigt. Somit ist es auch nicht weiter verwunderlich, da&#223; es sich nur um eine gebrannte CD handelt und sowohl das Cover als auch der Backprint nur als mittelm&#228;&#223;iger s / w Ausdruck vorliegen. Aber das soll uns auch nicht weiter st&#246;ren, da das ganze ja auch nicht professionell vermarktet werden soll.</P>

<p>Wenden wir uns stattdessen dem Inhalt der CD zu, die mit knapp 60 MB an Daten sowie einem vier min&#252;tigem Audiotrack bespielt ist. Vorweg macht sich schonmal positiv bemerkbar, da&#223; der Herrsteller nicht in der Vergangenheit stehen geblieben ist und uns mit Glow Icons verw&#246;hnt. Ist zwar nix wirklich spektakul&#228;res, aber nicht umsonst erfreut sich der Spruch &quot;Das Auge i&#223;t mit&quot; hoher Beliebtheit. Nach dem &#246;ffnen der CD erwartet uns zun&#228;chst ein HTML Dokument, welches in den Sprachen Deutsch, Englisch und Portugisisch vorliegt und uns relativ knapp in die CD einf&#252;hrt. Ansonsten sind nur noch zwei weitere Ordner mit den Titeln &quot;Fotos&quot; und &quot;Paginas&quot; im Hauptverzeichniss der CD zu finden.</P>

<u>Fotos:</U><br>
<p>Aufgeteilt in acht verschiedene Unterordner mit diversen St&#228;dt- und Pl&#228;tzenamen (u.a. Salvador, Bahia, Pirenopolis, Rio De Janeiro etc.), befinden sich insgesamt 208 Bilder im Bereich Fotos. S&#228;mtliche Bilder liegen dabei in einer sehr hohen Qualit&#228;t im JPG Format vor und auch die Aufl&#246;sungen sind nicht von schlechten Eltern: ab 768 X 512 Pixel geht`s los und es gibt mitunter auch Bilder, die in einer h&#246;heren Aufl&#246;sung vorliegen. Eine Grafikkarte ist also dringend empfohlen sofern man in den vollen Genuss der einzelnen Bilder kommen will. Die Motive der Bilder sind ebenfalls gut gew&#228;hlt und machen Lust auf mehr und sind definitiv keine 08 / 15 Fotos irgend eines Hobbyfotografen. Da ich leider noch nicht in Brasilien war (und dort wohl auch niemals hinkommen werde), kann ich an dieser Stelle aber auch nicht sagen, ob irgendwelche wichtigen Pl&#228;tze oder Sehensw&#252;rdigkeiten fehlen, aber selbst wenn: Die vorliegende Sammlung scheint schon einen breiten Teil der wichtigsten Pl&#228;tze abzudecken - aber wer wei&#223;: Vielleicht gibt`s ja auch Updates? Einziger Kritikpunkt in diesem Zusammenhang ist das Fehlen eines Bildanzeigers f&#252;r die diversen Bilder. Zwar d&#252;rften 90 % aller User einen solchen durchaus installiertt haben, aber eine nette Zugabe w&#228;re es dennoch gewesen, wenn man wenigstens einige der frei vertreibbaren Anzeiger auf die CD gepackt h&#228;tte.  </P>

<u>Paginas:</U><br>
<p>Dieser Bereich enth&#228;lt noch ein HTML Dokument (um genauer zu sein eine Web Site), das sich mit dem Thema Brasilien auseinandersetzt. Neben einigen Links sind hier auch nochmal s&#228;mtliche Bilder in verkleinerten Versionen f&#252;r den schnellen &#220;berblick mit kurzer Beschreibung zu finden. Das Layout der Website an sich war zwar nicht &#252;bel, aber bedingt durch die gew&#246;hnungsbed&#252;rftige Farbkonstellation (gelbe Schrift auf gr&#252;nem Hintergrund) auch nicht unbedingt erste Wahl. Zudem fehlte leider das G&#228;stebuch sowie eine Grafik auf der Startseite der Homepage - alles in allem, trotz eher sp&#228;rlichem Informationsgehalt, eine nette Erg&#228;nzung zu den vielen Photos.</P><p><center><img src="brasilcd1.jpg"></center></P>

<p>Und dann w&#228;re da noch die oben bereits erw&#228;hnte Audio Spur, die man auch in einem normalen CD Player abspielen kann. Das St&#252;ck nennt sich &quot;Samba de Smurfet&quot; und wurde im &#252;belsten Technostil komponiert und gef&#228;llt mir absolut nicht und wird wohl auch f&#252;r Technoj&#252;nger nicht die Offenbaarung schlechthin sein. Anyway, f&#252;r eine Bewertung gibt es sicherlich kompetentere Leute als mich (bei Heavy Metal w&#252;rde die ganze Sache schon anders aussehen :-))).</P>

<h2><center><font color="red">Zusammenfassung</font></center></h2>
<p>Diese selbstproduzierte CD hat sich eine interessante Thematik zum Themenschwerpunkt gesetzt, die zwar sicherlich nicht die breite Masse anspricht, aber Brasilien Fans, wie es offenbar der Autor ist, d&#252;rfte dieser Rohling sicherlich die verlangten 10 DM (zzgl. Portokosten) wert sein. Wenn man bedenkt, da&#223; man als Gegenleistung immerhin auch ein gedrucktes Cover erh&#228;lt und man den Aufwand betrachtet, den so eine CD so mit sich bringt, so sind die 10 DM sicherlich nicht zu viel verlangt. Wer jetzt Interesse bekommen hat, kann den Autor unter folgender Addresse erreichen:</P>
<p><center>
Patrick Henz<br>
Martinstr.15<br>
52062 Aachen<br>
phenz@gmx.net<br>
http://surf.to/fom</P></center>

 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
