<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Darkage CD-Their First</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Darkage - Their First</Font></center></h1></p>
<center><p><img src="da2.jpg"></Center></P><BR>
<p>Die Demoszene auf dem Amiga lebt, wie man nur unschwer an den monatlichen, qualitativ hochwertigen Demos im Aminet erkennen kann. Eine dieser Gruppen sind die italinieschen &quot;Darkage&quot;, die neben Demobeitr&#228;gen auch den Mario Clone &quot;Tales From Heaven&quot; sowie &quot;Genesis&quot; programmier(t)en. Das zeigt, da&#223; in der Gruppe ein gewaltiges Potential steckt und soeben ist derren erste CD mit massig Material erschienen, die ich an dieser Stelle genauer unter die Lupe nehmen m&#246;chte. </P>

<p><center><h2><font color="yellow">Worum geht`s?</Font></Center></h2></P>
<p>Da Darkage ihre Wurzeln im Demosektor haben und dort auch heute noch t&#228;tig sind, d&#252;rfte es niemanden wundern, da&#223; es sich bei einem Gro&#223;teil der mit 444 MB gef&#252;llten CD um Demos, Slideshows, Intro`s und &#228;hnliches Material handelt. Hinzu kommen noch Grafiken, Soundmodule und ein relatic gro&#223;er Developer Bereich - Material zu Spielen von Darkage oder sogar entsprechende Demoversionen sucht man auf dieser CD vergebens. </P>

<p>Nach dem &#246;ffnen der CD, die sich (leider?) im Magic WB Stil pr&#228;sentiert, wird man mit drei Schubladen konfrontiert und wie schon von anderen CD Besprechungen gewohnt, m&#246;chte ich hier genauer auf den Inhalt eingehen:</P>

<p><h3><b>Darkage</h3></B></P>

<u><p>Demos &amp; Intros:</U><BR>
Wie die Namen schon vermuten lassen, findet man hier Demos sowie Intros von Darkage, wobei bei den Demos quantitativ (5 St&#252;ck; &quot;Neo 1 &amp; 2&quot;, &quot;Under Pressure&quot;, &quot;Welcome To Our World&quot; und &quot;Drug Vanilla Syndrome&quot;) etwas weniger los ist als bei den Intros (insgesamt 23; darunter &quot;Galaxy&quot;, &quot;Electra&quot;, &quot;Morph&quot;, &quot;Quiet&quot;). Aber eines haben s&#228;mtliche Publikationen gemeinsam: Das qualitative Niveau ist recht hoch und minderwertige Ware sucht man hier absolut vergebens. Wer sich etwas f&#252;r Demos &amp; Intros begeistern kann, der wird hier auf jeden Fall f&#252;ndig.</P>

<u><p>Showtime:</u><br>
Ebenso wie die diversen Online Mags haben auch die ganzen Scene Mags eine lange Geschichte und existieren seit dem Beginn der Demo Szene. Die von Darkage publizierte &quot;Showtime&quot; (auf der CD befinden sich die ersten 14 Ausgaben) ist zwar nicht von anfang an dabei, aber daf&#252;r ist sowohl das Anzeigetool als auch der Inhalt &#252;ber jede Kritik erhaben - zumindest aus meiner Sicht, denn es wird immer User geben, die sich nicht mit den sehr individuellen Anzeigtools der Demo Szene anfreunden k&#246;nnen. Inhaltlich geht`s auf jeden Fall voll zur Sache und wer sich etwas f&#252;r die Demoszene interessiert und der Englischen Sprache f&#228;hig ist, der wird mit der &quot;Showtime&quot; sicherlich einige interessante Stunden vor dem heimischen Amiga verbringen k&#246;nnen. </P>

<u><p>Misc. Prods:</U><BR>
Dieser Ordner ist relativ sp&#228;rlich besetzt und enth&#228;lt lediglich die geniale Slideshow &quot;Divine&quot;, ein Intro namens &quot;Ph&#246;nix&quot; sowie als programmiertechnisches Highlight das 1KB (!!!) Game &quot;IccuTest&quot;. Sp&#228;testens beim letzteren wird klar, was f&#252;r hervorragende Coder in der Demoszene aktiv sind und was man so alles aus einem (!!) Kilobyte rausholen kann. Da sollte sich ein bekannter Herrsteller des marktf&#252;hrenden Betriebsystems mit geradezu speichervergeudendem Umgang mal eine Scheibe von abschneiden :-)))</P>

<u><p>Spoletium `98 &amp; `99:</U><br>
Insider werden mit dem Namen &quot;Spoletium&quot; wohl gleich etwas anfangen k&#246;nnen - allen anderen sei gesagt, da&#223; es sich hierbei um eine Scene Party handelt, in dessen Mittelpunkt nat&#252;rlich das Erstellen von Demos, Intro`s, Grafiken und Mod`s stand mit dem Ziel, bei der finalen Abstimmung m&#246;glichst weit oben zu stehen. Neben einer Liste der Gewinner, befindet sich in diesen beiden Ordnern auch ein Gro&#223;teil des auf der Party erstellten Materials wieder - jeweils ordentlich sortiert nach Genre, so da&#223; man sich recht schnell zurecht findet und nicht erst stundenlang suchen muss. Wie nicht anders zu erwarten war, ist auch hier die Qualit&#228;t absolut &#252;berzeugend und unter dem Material befinden sich auch zahlreiche Killer, wie etwa der Gewinner der `98er Demo Competition &quot;Randy World&quot;.</P>  

<p><h3><B>Developer</h3></B></P>

<p>Neben einer englischen Guide zu diesem Bereich auf der CD, sind noch zwei Ordner vorhanden:</P>

<u><p>Tools:</U><br>
Hier sind wichtige Tools vorhanden, die man zum Erstellen eines Demos braucht: Neben den beiden recht bekannten Assembler Tools &quot;ASMOne&quot; (Spezielle Version f&#252;r diese CD) und &quot;ASMPro&quot;, ist hier auch der total veraltete Konverter &quot;PicCon&quot; (von 1994 - hier kann ich jedem nur empfehlen, ein aktuelles Tool aus dem Aminet zu benutzen), die Musikabspieler &quot;Player&quot; und &quot;Protracker&quot;, der Modkonverter &quot;Mod2Smp&quot; sowie die Packer &quot;CrunchMania&quot; undd &quot;Stone Cracker&quot; zu finden. Alles in allem ist dieser Ordner recht sp&#228;rlich besetzt und zumindest ich h&#228;tte mir noch das eine oder andere Tool mehr f&#252;r diesen Bereich gew&#252;nscht - wer also wirklich an der Herrstellung von Demos interessoert ist der findet hier zwar eine Grundlage, sollte aber auf jeden Fall nochmal einn Besuch im Aminet machen, da man dort viel erg&#228;nzendes Material findet.</P>

<u><p>Sources:</U><BR>
Wesentlich interessanter f&#252;r viele Demoprogrammierer d&#252;rfte wohl dieser Sektor sein in dem man die Source Codes zu vielen Darkage Produktionen findet, die man als Hilfe bzw. Beispiele f&#252;r eigene Kreationen benutzen kann und die man unter Garantie nicht im Aminet findet. F&#252;r Programmierer d&#252;rfte dies eine wahre Fundgrube an erstklassigem Material sein, aber da ich leider mit programmieren recht wenig am Hut habe, kann ich dazu auch nicht mehr viel sagen... </P> 

<p><h3><b>CD</h3></B></P>

<p>In diesem letzten Bereich der &quot;Darkage CD&quot; sind neben einigen internen Routinen f&#252;r die CD auch noch die offizielle Homepage der Gruppe, die allerdings aus dem Jahre 1998 stammt, sowie einige Logos &amp; Photos vorhanden. Additional befindet sich hier s&#228;mtliches Material nochmals lha gepackt im Bereich &quot;Archives&quot; sowie zahlreiche selbstgepixelte Bilder bzw. selbsterstellte Musikst&#252;cke von Gruppenmitgliedern, die jeweils nach den Namen der jeweiligen Personen sortiert wurden. Wer also immer noch nicht genug hat, der wird am 82 MB gro&#223;en Ordner &quot;Members&quot; seinen Spa&#223; haben.</P>
<center><p><img src="da1.jpg"></Center></P><br>
<p>Als Bonus ist auf der CD noch eine 15 min&#252;tige Audiospur, abzuspielen in jedem g&#228;ngigen CD Player, zu finden, die eine recht interessante Mischung aus verschiedenen Genres bietet, mir aber insgesamt zu unspektakul&#228;r ausgefallen ist. </P>

<p><h2><center><font color="blue">Fazit</Font></h2></Center></P>
<p>Ein Fazit f&#252;r diese CD zu finden ist, &#228;hnlich wie bei der ebenfalls in dieser Ausgabe vorgestellten &quot;Brasil CD&quot; recht schwierig. Global kann man erstmal festahlten, da&#223; diese CD grunds&#228;tzlich nur f&#252;r Demos Freaks sowie Leute, die sich f&#252;r Demos und &#228;hnliche Dinge interessieren, einen Blick wert ist - alle anderen werden mit dem Material auf dieser CD recht wenig anfangen k&#246;nnen. Die Qualit&#228;t der diversen Ordner ist allerdings &#252;ber jede Kritik erhaben und sollte man sich auch noch f&#252;r`s programmieren interessieren, ist die erste &quot;Darkage CD&quot; sicherlich eine &#220;berlegung wert, auch wenn sie nicht mehr ganz taufrisch ist (Erstellungsdatum: 1999). Bezogen werden kann die CD derzeit nur &#252;ber das Internet; bei Interesse bitte die Seite <a href="http://www.idealia.net/darkage">http://www.idealia.net/darkage</A> oder die E-Mail Addy darkage@idealia.net kontaktieren. </P>

<center><p><img src="da3.jpg"></Center></P><br>
 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
