
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Powerball - Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><b>Powerball - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="pb.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">
<p>Der Trend zu wahren High End Spielen mit komplexen Gameplay der Marke Heretic 2, Wipeout 2096, Soldiers Of Fortune oder auch Foundation ist mitlerweile auch endlich auf dem Amiga Markt zu merken. Nichtsdestotrotz gibt`s immer wieder vereinzelte Programmier Teams, die auf die Idee kommen, alte Spielgenres wieder neu aufleben zu lassen und dabei die Technik um ein Jahrzehnt in die Vergangenheit zu transportieren. Beste Beispiele daf&#252;r hatten wir in den letzten Monaten in Form von &quot;Ph&#246;nix Fighters&quot;, &quot;MMT&quot; oder auch &quot;Super Pino&quot; wahrlich genug. So, und was will uns diese Einleitung jetzt sagen? Richtig, &quot;Powerball&quot; f&#228;llt ebenfalls in letztere Kategorie!</P>

<p>Das tolle an solchen Spielen ist, da&#223; man diese auf Anhieb versteht und sich nicht erst gro&#223;artig in`s Spielprinzip einarbeiten muss. Bei Powerball steuert man mittels des Joysticks eine Kugel, die von oben nach unten springt, und muss diverse Steinchen mit dieser Kugel ber&#252;hren, damit diese verschwinden. H&#246;rt sich zwar recht einfach an und zu Beginn ist es das auch, aber diese Aufgabe wird zunehmend dadurch erschwert, da&#223; es verschiedenfarbige Steine gibt, die nur dann zerst&#246;rt werden k&#246;nnen, wenn die Kugel die selbe Farbe hat. Hinzu kommen noch Totenk&#246;pfe, die man tunlichts nicht ber&#252;hren sollte (=> ansonsten verliert man eines der drei Leben) sowie ein Zeitlimit. Aufgelockert wird das ganze Gameplay noch von ein paar Extras, die von Zeit zur Zeit erscheinen und dem Spieler die Sache etwas vereinfachen.</P>

<p>Das war`s auch schon zum Spielprinzip, kommen wir jetzt zur Technik und wer sich den Screenshot am Anfang des Artikels angeguckt hat, der wird schnell merken, was Sache ist: Das Game ist absichtlich ECS kompatibel gehalten und sieht auch dementsprechend veraltet aus. So hat die Ziegelmauer in jedem Level das gleiche Aussehen und auch vom Leveldesign kommt schnell Langeweile auf, weil alles irgendwie &#228;hnlich aussieht und zudem immer auf einen Schirm beschr&#228;nkt ist - Scrolling scheint den Programmierern ein Fremdwort zu sein. Zwar hat man im Men&#252; die M&#246;glichkeit, den Hintergrund mit verschiedenen Patterns / Digitabildern zu hinterlegen, aber so richtig Freude kommt damit auch nicht auf. Auch der Sound pl&#228;tschert so vor sich hin und ausser einigen SoundFX beim ber&#252;hren von Steinen wird akkustisch nicht viel geboten. Insgesamt ist die Technik als total veraltet zu bezeichnen und im Grunde nur ein Witz für ein aktuelles Spiel. Das es trotzdem auf die Amiga User losgelassen wird, dokumentiert wohl trefflich die aktuelle Lage.
</P> 

<p>Als Bonus liegt dem Spiel, welches bei Epic auf einer Diskette erscheint und ca. 30-40 DM kosten wird, ein Editor bei, mit dem seine eigenen Levels kreiern kann, falls einem die providierten 80 Level (aufgeteilt in 8 Welten) nicht ausreichen. Diese k&#246;nnen dann nat&#252;rlich, bei einer Festplatteninstallation (wenigstens das ist m&#246;glich!), direkt abgespeichert und gespielt werden.</P>

<p><h2><center><b>Fazit</h2></center></B></P><font size=+1>
<p>Als Free- oder Sharewarespiel w&#228;re &quot;Powerball&quot; noch so gerade eben durchgegangen, aber zu einem Preis von 30-40 DM sollte man es sich am besten doppelt &#252;berlegen, ob man es sich holt. Sicherlich kann man mit &quot;Powerball&quot; ein wenig Zeit vor dem Amiga verbringen, aber im Jahre 2000 reist mich das typische A500 Flair auch nicht mehr so aus den Socken. F&#252;r ein Spielchen zwischendurch sicherlich geeignet, nur der Preis ist ma&#223;los &#252;berzogen und d&#252;rfte schon alleine reichen, um aus &quot;Powerball&quot; einen Flop zu machen. </P><PRE><center><img src="kit.gif"></Center></P>

<p>Name          : Powerball</P>

<p>Publisher     : Epic Marketing</P>

<p>Release       : 2. oder 3. Quartal 2000</P>

<p>Preis         : 30-40 DM</P>

<p>Anforderungen : ECS Amiga mit 1 MB Chip Ram</P>

<p>Empfohlen     : tja, mehr ist (leider) nicht nötig</P></PRE>


<HR>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
