<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Kurztests: Zombie Massacre</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Kurzvorstellung: Zombie Massacre (Vollversion Aminet CD 37)</font></center></h1></P>

<P>Auf der Amiga Messe in Neuss habe ich dem Wolf Zimmer versprochen, an dieser Stelle etwas n&#228;her auf das der Aminet CD 37 beiliegende Game &quot;Zombie Massacre&quot; einzugehen, da er nicht so genau wusste, was er dazu sagen sollte. </P>

<p><h2><center><font color="yellow">H&#228;h? PD Game als Vollversion?</font></center></h2></P>

<p>Das der gute Wolf sprachlos ist kann ich durchaus nachvollziehen, denn  &quot;Zombie Massacre&quot; ist im Grunde, soviel kann ich vorweg nehmen, nicht mehr als ein schlechter Witz. Ok, ich war schon durch einen &#228;lteren Artikel in der Amiga Future sowie diversen Beitr&#228;gen im Internet so halbwegs drauf vorbereitet gewesen was mich erwartet, aber das Spiel dann mal live auf dem Bildschirm zu erleben ist dann doch ein v&#246;llig tolles Gef&#252;hl - programmieren kann offenbar doch nicht so schwer sein :-))</P>

<p>Aber fangen wir mal vorne an: &quot;Zombie Massacre&quot; ist (oder besser: soll) ein 3D Shooter sein, der sich an diverse antiquierte Vorbilder, die man kostenlos im Aminet bekommt, anlehnt, ohne aber auch nur ansatzweise zu erreichen. Die Geschichte dazu ist simpel und sehr kreativ (Vorsicht: Ironie): Irgendwann in der Zukunft gehen Genexperimente schief, Zombies entstehen und diese m&#252;ssen nat&#252;rlich vom Spieler eliminiert werden. Dazu ist man mit einem Gewehr (ist nicht ganz so einfach zu definieren - sieht aus wie ein Farbklexs) ausger&#252;stet und muss alles abballern, was einem im Wege steht.</P>

<p>So weit, so unspektakul&#228;r. Was aber jetzt kommt ist eine Frechheit ersten Ranges: Grundlage f&#252;r &quot;Zombie Massacre&quot; ist die hundsmiserabele &quot;Gloom 3&quot; Engine, die angeblich etwas verbessert wurde, aber merken tut man davon freilich nix. Die &quot;3D&quot; Welt ist einfach nur grauenerregend, was zum einem am st&#228;ndig gleichen Leveldesign (diverse Kachelfarben wechseln sich ab - mehr ist nicht da) und zum anderen an den total albernen und billig aussehenden Monstern (das sehen selbst die Monster aus Pacman noch besser aus!) liegt. Unn&#246;tig zu erw&#228;hnen, da&#223; diverse &quot;Auflockerrungen&quot; wie Fackeln an den W&#228;nden ebenfalls misslungen sind und zum Teil nur in 2D (!!) gehalten wurden. Schaut euch einfach nur den Screenshot am Ende des Artikels an und Ihr wisst wohl was ich meine...
</P>

<p>Der Vollst&#228;ndigkeit halber sei erw&#228;hnt, da&#223; das Spiel erwartunsgem&#228;&#223; &#252;berhaupt keinen Spa&#223; macht, aber als ob das noch nicht alles genug w&#228;re, wird bei der Aminet Version noch eins drauf gesetzt: Dort fehlen n&#228;mlich Multimedia Dateien, CDDA Tracks, die 16 Bit Versionen (also eine 16 Farb Datei in 16 Bit gespeichert??) der Bilder, versteckte Grafiken &amp; Sounds, sowie diverses weiteres Material. Aber vielleicht hatte man bei der schatztruhe ein Einsehen und wollte nicht noch mehr Platz f&#252;r diesen offensichtlichen Dreck verschwenden. Insofern handelt es sich keineswegs um eine uneingeschr&#228;nkte Vollversion, aber das d&#252;rfte die meisten nach dem Antesten des ersten Levels auch nicht weiter st&#246;ren. </P>

<p>Und bevor ich zum Schlusskommentar komme, m&#246;chte ich euch noch mit einem kleinen Zitat vom Programmierer erheitern, welches der Aminet Version beiliegt (von mir in`s Deutsche &#252;bersetzt): &quot;Nachdem &quot;Zombie Massacre&quot; aufgeh&#246;rt hat sich zu verkaufen, dachte ich mir, da&#223; es eine gute Idee w&#228;re den Leuten, die es nicht gekauft haben zu zeigen, was sie verpasst haben&quot;. Verpast haben diese Leute nur eines: Den gr&#246;&#223;ten Witz (respektive gr&#246;&#223;te Frechheit) in der Geschichte der Amiga Spiele....</P><center><p><img src="zombie.jpg"></P></Center>

<p><center><h1><font color="RED">Fazit</font></center></h1></P>
<p>&quot;Zombie Massacre&quot; d&#252;rfte wohl die schlechteste Vollversion sein, die jemals auf einer Aminet CD zu finden war- streitig gemacht werden d&#252;rfte ihm dieser Titel nur von &quot;Gloom 3&quot;, auf dem &quot;Zombie Massacre&quot; auch basiert. Ist aber im Grunde auch egal, denn wegen dieser Vollversion (da h&#228;tte man besser ein PD Game genommen) darf sich keiner die Aminet CD 37 holen, die ansonsten recht gelungen ist und von mir empfohlen werden kann. Ein Tip an die Schatztruhe: In Zukunft bessere Vollversionen oder Lizenzgeb&#252;hren spaaren. Aber eigentlich h&#228;tte Epic Geld an die Schatztruhe zahlen m&#252;ssen - daf&#252;r, da&#223; die so einen Dreck auf die Aminet CD kopieren!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
