<html>
<head>
<!-- Author = Rolf Nünninghoff -->
<title>R.Nue. aus Wue.</title>
</head>
<body background="l_bg.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>R.Nue&acute;s Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Wolf Zimmer</a></b></li>
<li><a href="#a2"><b>f&uuml;r Sieglinde Peters</a></b></li>
<li><a href="#a3"><b>f&uuml;r denjenigen der den Artikel &uuml;. den Falke-Verlag geschrieben hat</a></b></li>
</ul>
<hr size=4>
<br>
<h3><a name="a1">Ich gr&uuml;&szlig;e Dich Wolf</a></h3>
<p>Es ist wirklich sehr nett von Dir, mich in der NC mit einem Leserbrief zu &uuml;berraschen. Danke ! Freue mich immer wieder von
irgend jemanden Post zu bekommen. Dann kan man wenigstens wieder antworten (oder auch bleiben lassen - aber das kommt ja h&ouml;chsten vor, wenn man wichtigeres zu tun hat oder es total vergisst)! Jedenfalls habe ich mich sehr gefreut.<br>
Schade, da&szlig; ich nicht nach Neuss fahren kann. Wir machen n&auml;mlich im sch&ouml;nen Schwarzwald Urlaub mit den Kindern und Enkelkindern.<br>
Hoffentlich klappt es in Vellmar!<br>
&Uuml;brigens: Das eingescannte Foto von der Messe ist ja wirklich sehr sch&ouml;n, habe es mir gleich ausgedruck.<br>
Gut, da&szlig; Du es dem Kilian gewidmet hattest, so wurde ich auch darauf aufmerksam.<br><br>

Zum Artikel &uuml;ber Disksalv noch folgendes:<br>
Inzwischen ist ja alles &uuml;berholt, der ganze Zirkus hat nichts gen&uuml;tzt. Meine ganzen Daten auf den Festplatten waren futsch,
ich konnte keine einzige wieder reorganisieren, irgendwas habe ich verkehrt gemacht. Nun, der AMIGA gl&auml;nzt in einem neuem "outfit"! Gut das ich alle Original-Programme auf Disketten und CD's noch hatte. So konnte ich wieder alles installieren und meine auf Disketten gespeicherten Daten wieder einlesen. Jedenfalls das mei&szlig;te.<br><br>
Nun, ich arbeite jetzt sowieso mehr am PC als am AMIGA. Da ich
ja keine Spielernatur bin und nicht st&auml;ndig neue Spiele am PC
ausprobiere, l&auml;uft er eigentlich ganz stabil. Verstehe manche
AMIGANER nicht, so &uuml;ber die PC's herzuziehen. Ich jedenfalls
komme damit besser zurecht, dieweil hier das mei&szlig;te doch in's
deutsche &uuml;bersetzt ist.<br><br>
Hoffentlich bist Du mir nicht b&ouml;se, da&szlig; ich Dein "outfit" f&uuml;r
mich benutzt habe. Es spricht mich halt immer wieder besonders an Deine HTML-Kenntnisse umgesetzt zu sehen.<br>
</p>
Bis demn&auml;chst mal wieder, tschau !<br>
R.Nue. aus Wue.<br><br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>

<h3><a name="a2">Ich gr&uuml;&szlig;e Dich Sieglinde</a></h3>
<p> Erst einmal m&ouml;chte ich wissen, wie es Dir geht ? Hast Du Deine Krankheit gut &uuml;berwunden ?<br>
Dann m&ouml;chte ich von Dir wissen, wie Deine Entscheidungen ausgefallen sind, bez&uuml;glich des Systemwechsel's ? Oder sind Deine Ambitionen inzwischen nicht mehr so stark auf dem Computer-Sektor ? Schade, da&szlig; es nicht &ouml;fter M&ouml;glichkeiten gibt
sich zu treffen! Immer nur schreiben ist auch nicht das wahre !<br>
Nun, ich hoffe es ist wieder alles "paletti" wie man so sch&ouml;n sagt (oder hei&szlig;t dies heute anders ?) und Du kannst wieder Deinen "Gesch&auml;ften" nachgehen.<br><br>
Also, bis bald mal, tschau !<br>
R.Nue. aus Wue.<br><br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>

<h3><a name="a3"> Gr&uuml;&szlig; Gott - Schreiber des genannten Artikels</a></h3>
Sag mir, wer bist Du ?<br>
Wie schon des &ouml;fteren erw&auml;hnt, es w&auml;re wirklich nicht zuviel verlang, wenn Du Deinen Namen, wenn schon nicht genannt, dann wenigstens als Pseudonym und mit einem Link versehen auf die
Mitglieder-Liste. Oder bist Du gar kein Mitglied ?<br>
Nun, nichts desto trotz, es ist sch&ouml;n, da&szlig; Du eine Lanze f&uuml;r den Falke-Verlag brichst, aber so schlimm wie Du es geschildert hast,
war es doch gar nicht.<br>
Hast Du den Artikel von mir in der NC74 unter Disku nicht gelesen ?<br>
Jeder macht doch seine eigenen Erfahrungen, ich jedenfalls bin
sehr zufrieden, obwohl ich kein direkter AMIGA-Freak, wie man so
sch&ouml;n sagt, mehr bin.<br>
Bin gespannt, ob ich von Dir noch mal etwas h&ouml;re !!!<br><br>
Bis denne dann und tschau !<br>
R.Nue.aus Wue.<br><br>
<a href="#top">zum Anfang</a>
<hr size=4><br>
<img src="burg.gif" width="40" height="40" border="0" alt="Burg" align=right hspace=10>
von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
093113563-0001@t-online.de</a><p>
</P>
<HR>
</BODY>
</HTML>