<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Annemarie Kohlm&#252;ller</a></b></li>
</ul>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Annemie</h3>
<p>Diesen Leserbrief schreibe ich an dich, obwohl er eigentlich an alle
bestimmt ist. Du hast das Problem, das ich hier andiskutieren m&#246;chte,
in deinem Leserbrief in der letzten NoCover Ausgabe als indirekte Frage
aufgeworfen. Meine nun folgende Auslassung ist meine ganz pers&#246;nliche
und subjektive Meinung und wird hier von mir erstmalig artikuliert. </p>

<p>Annemie, du h&#228;ngst deine Frage mehr oder weniger an der sogenannten
Mitgliederliste auf, obwohl dies eine freiwillige Informationsliste
&#252;ber Mitglieder von Mitglieder ist. Als du dich seinerzeit beim
APC&amp;TCP Amigaclub beworben hattest, wurde dir zugesichert, dass deine
pers&#246;nlichen Daten vertraulich behandelt w&#252;rden und nicht an
dritte weitergegeben w&#252;rden. Wenn Sascha jetzt zu Andreas hinginge und
ihn um Abgleich bitten w&#252;rde, w&#228;re diese Zusage schon Makelatur
und rechtswidrig. Du hattest seinerzeit fest auf die gegebene Zusage
vertraut und pl&#246;tzlich erscheinen deine Daten f&#252;r die Welt lesbar
in der NoCover, obwohl du dieses partout nicht gestatten w&#252;rdest.
Gesetzt den Fall, wir h&#228;tten solche Mitglieder im Club, Andreas
m&#252;sste sich vor dem Kadi verantworten. </p>

<blockquote><i>
Ich bin ganz einfach der Meinung, in der NC sollte doch &#246;fter auch mal
ein Beitrag vom Clubleiter zu finden sein. </i>
</blockquote>
Darauf m&#252;sste dir Andreas antworten, aber da du ihn nicht
pers&#246;nlich angesprochen, sondern deine Meinung f&#252;r die
Allgemeinheit bestimmt an Tom formuliert hast, werde ich dir meine Meinung
&#246;ffentlich dazu sagen. </p>

<p>Die NoCover erschien erstmalig im Februar 1994 und war als Ersatz
f&#252;r ein Diskettenmagazin eines festen Redaktionsteams vorgesehen.
Damals wurde erkannt, dass ein festes Team t&#246;dlich war und so wurde es
ein Magazin von Clubmitglieder f&#252;r Clubmitglieder. Hin und wieder gab
es Artikel mit der Forderung eines verantwortlichen Redakteurs f&#252;r
bestimmte Rubriken. Aber diese Forderungen kamen meines Erachtens immer nur
von denen, die gerne in einem sogenannten festen Redaktionsteam mit
aufgenommen werden wollten. Andreas hat dieses Magazin nach dem
Gesichtspunkt ohne einen festen Mitarbeiterstamm ins Leben gerufen und an
diesem Konzept bis zum heutigen Tage festgehalten. Und dies mit Erfolg. In
jeder NoCover steht von Andreas ein Editorial, fast alle Interviews stammen
von ihm und die Rubrik Tipps und Tricks wird auch zum gr&#246;&#223;ten
Teil von ihm bef&#252;llt. Dein Vorwurf, es w&#228;ren keine Beitr&#228;ge
vom Clubleiter vorhanden, ist einfach nicht richtig. </p>

<p>Diese S&#228;tze h&#228;tte ich selbstverst&#228;ndlich mailen
k&#246;nnen, aber dann w&#252;rden die anderen, die deiner gleichen Meinung
sind, nicht wissen, wie ich &#252;ber diese ganze Diskussion denke. Sei mir
also bitte nicht b&#246;se, dass du f&#252;r mein Statement herhalten
musstest. </p>

<p>Wir sehen uns in Vellmar. Bis dahin alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br>
<font size="2">Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc&amp;tcp.de/members/wolf">
http://www.apc&amp;tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
