<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<p><h1><center><font color="green">Leserbriefe von Kilian &quot;The Bruce&quot; Servais</Font></center></h1></P>
<ul>
<p>
<li><a href="#wolf.html">An Wolf</A><br></LI>
<li><a href="#yonder.html">An Yonder</A><br></LI>
<li><a href="#serratus.html">An Serratus</A><br></LI>
<li><a href="#anne.html">An Annemie</A><br></LI>
<li><a href="#top.html">Top 5</P></A></LI></UL>
<hr>
<a name="wolf.html">
<p><b>An Wolf:</P></B>

<p>Gr&#252;&#223; Dich Wolf! Mit aller gr&#246;&#223;ter Wahrscheinlichkeit haben wir uns schon weiter per E-Mail unterhalten, aber ich wollte mich trotzdem auch nochmal an dieser Stelle f&#252;r Deine Tips &amp; Hilfestellungen bezgl. der Homepage bedanken.</P>

<p>Zu dem Zeitpunkt, an dem ich diese Zeilen tippe, ist die WoA gerade eine knappe Woche Vergangenheit und mit etwas Abstand betrachtet, bleibt es immer noch eine rundherum gelungene Messe - nicht zuletzt auch dadurch, da&#223; wir drei (wir beide und Thomas &quot;Comic&quot; Weber) auf der Messe ja viel Spa&#223; bei unseren gemeinsamen Rundg&#228;ngen hatten. Einen Messebericht habe ich nat&#252;rlich auch verfasst und insbesondere den Mc Ewen Auftritt h&#228;ttet Ihr Euch nicht entgehen lassen d&#252;rfen. </P>

<p>Wie ist eigentlich &quot;Art Effect 4.0&quot;? Schon flei&#223;ig mit gearbeitet oder kaum Zeit daf&#252;r? &#220;ber einen entsprechenden NC Artikel w&#252;rde ich mich sehr freuen.</P>

<p>Bis dann mal!</P>
<hr>
<a name="yonder.html">
<p><b>An Yonder:</P></b>
<p>Na, Du alter Verr&#228;ter :-))) Da hat der gute sich doch glatt einen PeeZeehh geholt - tststst. Nein, mal im Ernst: Ich habe zwar keinen PC, aber das das &quot;Rumgepl&#228;nkel&quot; in Sachen Amiga etwas nervig ist, kann ich durchaus nachvollziehen, auch wenn ich (!) mir deshalb keine Windows Kiste kaufen w&#252;rde; ist sicherlich Ansichtssache, aber ich hoffe, Du bleibst dem Club wenigstens treu und meldest Dich ab und an mal in der NC?</P>

<p>Dem UAE kann ich &#252;berhaupt nix abgewinnen, da ich dieses Teil jede Woche im Einsatz sehe und feststelle, da&#223; dieser Emulator verdammt viele Macken hat - meinen Amiga wird der UAE wohl niemals ersetzen k&#246;nnen, aber als &quot;Notl&#246;sung&quot; ist er evtl. zu gebrauchen. Wie w&#228;re es mal mit einem kleinen Erfahrunsgbericht, oder l&#228;sst die Zeit das nicht zu?</P>

<p>Sieht die &quot;Metal Corner&quot; auf dem PC auch so halbwegs aktzeptabel aus? Aus Mangel an selbigem konnte ich das bisher noch nie so genau testen. Kannst ja evtl mal durchmailen oder kurz per NC bescheid geben. Selbiges gilt nat&#252;rlich auch f&#252;r die Homepage von Powerplant / Metal Corner <a href="http://www.talknet.de/~textman" target="_blank">(www.talknet.de/~textman).</A></P>

<p>Klar sehen wir uns in Vellmar, auch wenn ich mit PC Usern aus Prinzip schon nicht rede. Eigentlich sind ja nur Amiga User zugelassen :-)))</P>

<p>Schade, da&#223; die Multi Ecke jetzt nicht mehr kommt, denn in letzter Zeit habe ich einige wirklich gute Demos gesehen, die es auch wert w&#228;ren, in der NC vorgestellt zu werden. Nur mangelt es mir total an Zeit das zu machen und ich hatte ja immer die Hoffnung, da&#223; Du das noch machen w&#252;rdest. By the way: Auf dem Aminet Set 9 sind einige richtige Perlen drauf. Hast Du das schon?</P>

<p>See ya!</P>
<hr>
<a name="serratus.html">
<p><b>An Serratus:</P></B>
<p>Deine Erfahrungen mit dem PC h&#228;tte ich Dir gerne erspaart und es tut mir leid f&#252;r Dich, da&#223; du jetzt soviel Geld zum Fenster (Windows) rausgeworfen hast. In einem Leserbrief von mir an die Sieglinde hatte ich sie ja auch davor gewarnt und ich hoffe, da&#223; die gute Sieglinde nun endg&#252;ltig wei&#223;, was sie am Amiga hat.</P>

<p>Das Problem der &quot;Raubkopierer&quot; ist etwa so alt wie der Amiga selber und sorgte immer wieder f&#252;r d&#252;stere Zeiten. Inhaltlich kann ich Dir nur voll zustimmen und wenn`s um aktuelle Software geht sollte da auch durchgegriffen werden. Bei &#228;lteren Spielen sieht die Sache schon etwas anders aus: Es gibt viele ehemalige Amiga Firmen, die bereit sind, Ihre alte Software zum kostenlosen Download anzubieten und davon profitiert nicht nur der UAE User sondern auch der normale Amiga Fan, denn mit wenig Aufwand lassen sich diese Spiele auch auf einem originalem Amiga zum laufen zu bewegen. Ausserdem sehe ich die Sache bei alten Spielen ohnehin nicht mehr so kritisch, denn daran kann zum einen sowieso keiner mehr verdienen und zum anderen gibt es einige Firmen schon gar nicht mehr, so da&#223; es sonst keinen legalen Weg mehr gibt, an die Software dranzukommen. Insofern kannst du Dir gerne alte Spiele aus dem Netzt der Netze ziehen. Seiten, die aktuelle, neue Software anbieten, solltest Du Amiga oder Haage & Partner melden, damit diese etwas dagegen tun können.</P>

<p>Read You</p>

<hr>
<a name="anne.html">
<p><b>An Annemie:</P></b>

<p>Ich habe von Deinem Problem mit FX-Paint geh&#246;rt und wollte mich eigentlich schon per E-Mail melden, habe es dann aber doch verschwitzt und hole dies nun per NC nach:</P>

<p>Deine Konfiguration reicht zwar aus, um FX-Paint zu benutzen, auch wenn ich eine GraKa f&#252;r dieses Programm nur w&#228;rmstens empfehlen kann. Na ja, an Deiner Hardware liegt es also schonmal nicht und die L&#246;sung ist eigentlich auch ganz einfach: L&#246;sche einfach die Datei &quot;tipoftheday.plugin&quot; aus dem Ordner &quot;Plugins&quot; im FX-Paint Verzeichniss. Evtl. musst Du vorher noch die Option &quot;Inhalt anzeigen / alle Dateien&quot; einstellen und sobald Du dieses Plugin gel&#246;scht hast, sollte alles einwandfrei funktionieren.</P>

<p>Was die Geschwindigkeit angeht: Solltest Du mit FX-Paint nicht zufrieden sein, kann ich Dir &quot;Art Effect&quot; empfehlen. Die Version 1.5 ist als Vollversion auf diversen CD`s zu finden (u.a. Aminet etc.) und reicht f&#252;r viele Dinge vollkommen aus. Das kann ich in Deinem Fall aber schlecht beurteilen, da ich nicht wei&#223;, wof&#252;r Du FX-Paint so einsetzt. </P>

<p>In der Hoffnung, Dir etwas geholfen zu haben: Mach`s gut!</P><hr>
<a name="top.html">

 
<p><h1><center><font color="yellow">Top 5</Font></Center></h1></P>

<p>1. Amiga Spiele von Thomas Weber (Yup, sehe ich genauso)<br>
2. BeOS 5 von Higgins (interessant; hatte ich beim Kollegen schon kurz im einsatz gesehen)<br>
3. Flachbildschirm von Wolf (gut ausgeleuchtet und interessant geschrieben)<br>
4. Wolf Info von Wolf Zimmer (wie immer: geniale Mischung)<br>
5. Fears von G&#252;nter Kohlm&#252;ller (aktive Mitglieder sind wichtig!)</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
