<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>NoCover Classics</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">NC Classics</font></center></h1></P>

<p>Als ich vor kurzem in einigen &#228;lteren NC`s bl&#228;tterte, hatte ich riesigen Spa&#223; dabei und bin auch des &#246;fteren &#252;ber Aussagen, Kommentare oder Bemerkungen gestolpert, die im Nachhinein recht am&#252;sant zu lesen sind. Deshalb hatte ich mir einfach mal gedacht, einige davon im Nachhinein nochmal zu ver&#246;ffentlichen, so da&#223; alle nochmal etwas schmunzeln k&#246;nnen. Nur um eines vorweg gleich klarzustellen: Es geht mir hier garantiert nicht darum, jemanden zu diskriminieren, zu &#228;rgern oder gar an den &#246;ffentlichen Pranger zu stellen - da keiner von uns Prophet ist, sind einige Aussagen im Nachheinen zwar witzig zu lesen, aber sp&#228;ter ist man ja immer kl&#252;ger. Worum es mir geht: Es soll sich jetzt ja keiner auf den Schlips getreten f&#252;hlen und beleidigt sein, nur weil ich ihn hier mal zitiere und noch einen bissigen Comment drunter setze. Wenn Interesse besteht, kann man hieraus gerne auch eine regelm&#228;&#223;ige Rubrik machen (Feedback !!). </P>
<hr>


 <p><i>&quot;Au&#223;erdem haben wir den Vertrieb von dem Programm
 Adventure-Shop und den Spielen Ph&#246;nix und
 Pulsator &#252;bernommen. Alle drei Amiga-Projekte werden
 Ende des Jahres erscheinen! Au&#223;erdem ist
 unser Spieleprojekt Westerados gestartet worden das
 1998 erscheinen wird.&quot;</I> (Andreas Magerl; NC 41, 1997)</P>
<p>Tja, das war ja schonmal nix vom Big Boss und man kann froh sein, wenn die Projekte noch dieses Jahr erscheinen bzw. &#252;berhaupt nochmal das Licht der Welt erblicken(Westerados). Vielleicht kommt dann ja in NC 78 eine &#228;hnliche Ank&#252;ndigung? Oder der Andi klaut ganz einfach das alte Vorwort? W&#228;re praktisch, denn damit lie&#223;e sich bestimmt viel Zeit spaaren...</P>

<p><i>&quot; pOS wird zun&#228;chst in einer Version f&#252;r 68k-Amigas (einschlie&#223;lich des
 &#187;Draco&#171;) und in einer Version f&#252;r PowerPCs erscheinen. F&#252;r AMIGA-Anwender
 und -Entwickler besonders wichtig: Das System l&#228;&#223;t sich parallel zum
 gewohnten Amiga-OS installieren. Es ist aber nat&#252;rlich auch m&#246;glich, pOS
 v&#246;llig eigenst&#228;ndig zu betreiben. Auch der Einsatz in Settop-Boxen ist
 aufgrund der Kompaktheit problemlos.
 Bereits seit 2 Jahren in der Entwicklung, wird es 1997 erste Anwendungen
 geben, die auf diesem modernen Betriebsystem basieren - ob Settop-Box oder
 PCs zur Videobearbeitung, zur Bildtelefonie, zur einfachen Abwicklung des
 Bestellwesens gro&#223;er Verlage, zur Internet- und T-Online-Anwendung, zum
 Fernsehprogrammabruf - mehrere Hersteller sind bereits interessiert oder
 arbeiten bereits im Dialog mit proDAD, da die Kompaktheit und die moderne
 Konzeption Grundlagen bieten, die einzigartig, preisg&#252;nstig und
 unkompliziert sind.&quot;</I> (Presseinfo aus NC 36, 1996). </P>

<p>Also, pOS wird zun&#228;chst in einer Version f&#252;r 68K Amigas erscheinen? Und auch f&#252;r PPC Amigas? Wow, tolle Sache, die nur einen Haaken hat: Das Teil ist niemals erschienen und aus den Anwendungen, die angeblich 1997 das Licht der Welt erblicken sollten ist ebenfalls nix geworden. Aber eines muss man der Firma lassen: Echt stark formuliert und damit mal wieder vermehrt Unsicherheit in den Markt gebracht - und dies war ja bekanntlich nicht die einzigste Ank&#252;ndigung in diesem Stil...</P>


 <p><i>&quot;Abschlie&#223;end bleibt festzustellen, da&#223; mit der Firma VIScorp 
 endlich einmal ein Unternehmen die Amiga-Rechte in 
 H&#228;nden h&#228;lt, da&#223; sich ausschlie&#223;lich mit der Amiga-
 Technologie besch&#228;ftigt und nicht wie die bisherigen 
 Rechte-Inhaber Commodore und Escom den Amiga nur als 
 zweites Standbein zur eigentlichen PC-Produktion sieht. &quot; </I>
(Thomas Szedlak; NC 27, 1996)</P>

<p>Ach so ist das; Viscorp hat also tats&#228;chlich die Rechte am Amiga gekauft und besch&#228;ftigt sich zudem auch nur ausschlie&#223;lich mit Amiga Technologie. Das es zum einen nie zu dem Verkauf gekommen ist (und von Viscorp heute nix mehr zu h&#246;ren ist) und das es Viscorp ohnehin nicht ernst meinte mit dem Amiga, braucht heute wohl nicht mehr erw&#228;hnt werden. Insofern &#252;berhaupt nicht verst&#228;ndlich, warum beim Gateway Aufkauf damals so viel Opptimismus r&#252;bergekommen ist...</P>


 <p><i>&quot;So, weiter! Schon bald wird es ja den PowerPC-Amiga geben, und das
 ist meiner Meinung nach die beste Entscheidung, die AT jemals getroffen
 hat. Und auch auf die Gefahr hin, da&#223; ein gewisser Herr Biermann jetzt
 bestimmt schon wieder rotiert, sehe ich im RISC-Amiga DEN Rechner der
 Zunkunft. Stellt Euch nur mal folgendes vor: Der Amiga-User der Zukunft
 bearbeitet seine Bilder mit Adobes &quot;Photoshop&quot; unter MacOS, betitelt
 seine Videos mit dem Monument Titler und zaubert mit Adorage ein paar
 Spezialeffekte hinein - das Ganze nat&#252;rlich unter AmigaOS und wenn er
 mal wieder ein paar K&#228;tzchen vom Himmel holen will, spielt er &quot;Wing
 Commander&quot; unter MS-DOS oder meinetwegen auch Windows 95. Der Amiga
 der Zukunft wird in der Lage sein, Software von drei verschiedenen
 Rechnern zu verarbeiten. Nat&#252;rlich kann er alles auch unter einem
 Betriebssystem nutzen. DAS ist f&#252;r mich die Bedeutung des sonst so
 gebeutelten Wortes &quot;Multimedia&quot;. Und DAS ist die Zukunft.&quot;</I> (Igor Vucinic; NC 23, 1995)</P>

<p>Die Worte lesen sich ja recht sch&#246;n und im Grunde sind Visionen ja immer was feines, nur wenn ich dran denke, da&#223; es bis Ende 1997 gedauert hat, bis die ersten PPC Karten f&#252;r den Amiga rauskamen (und dann noch nichtmals von AI) und ein reiner PPC Amiga wohl niemals mehr das Licht der Welt erblicken wird, ist es wohl leider bei der Vision geblieben. Schade eigentlich!!</P>


 
 <p><i>&quot;Sicher ist nur, wenn die Qualit&#228;tsanspr&#252;che bei Spielen weiter eine so nach unten
 zeigende Tendenz aufweisen........bye, bye Amiga.
 Lassen wir uns mal &#252;berraschen wie die Spiele &quot;Tiny Troops&quot; oder &quot;Z&quot;
 (wenn es denn erscheint...) aussehen.&quot; </I>(Rouven Bock; NC 26, 1996)</P>

<p>Ok, gleich zwei lustige Dingen in zwei S&#228;tzen: Na ja, bye, bye Amiga war 1996 wohl stark verfr&#252;ht, wenn man bedenkt, da&#223; der Classic Amiga auch im Jahre 2000 in Sachen Games noch mithalten kann (Heretic II, Wipeout 2096, Napalm, Exodus, Foundation etc.). Wesentlich interessanter war da schon die Ank&#252;ndigung von &quot;Z&quot; - und das im Jahre 1996. Heute, also 4 Jahre sp&#228;ter, haben wir auch so `ne Ank&#252;ndigung, aber erschienen ist deswegen trotzdem noch nix. Wenn es mal wieder l&#228;nger dauert: Schnapp Dir `nen Snickers!</P>


<p><i>&quot; Fazit: Das ewige Gerangel um die Amiga Technologie hat wahrscheinlich nie ein Ende; wenigstens wei&#223; VisCorp, was zu tun ist.
 Der Amiga hat aber wieder einen Knacks bekommen und die Verunsicherung ist gr&#246;&#223;er als jemals zuvor.
 Gerade als sich der Amiga anfing sich zu erholen, der Verkauf, was f&#252;r ein Hammer!
 Laut AT soll unver&#228;ndert weitergearbeitet werden, d.h. Amiga Walker
 und Power Amiga sind in Entwicklung. Good Luck Amiga!&quot;</I> (Mathias Sch&#252;sseler; NC 27; 1996)</P>

<p>Wir haben (bzw. hatten) ja richtige Propheten, die die Zukunft vorraussagen konnte, in unseren Reihen: Erst die richtige Aussage mit dem ewigen Gerangel (wie war das noch mit Gateway??), aber dann der kleinere Fehler mit VISCorp, die Amiga ja leider (??) niemals gekauft haben - und aus den Tr&#228;umen Walker &amp; PowerAmiga ist ja auch nicht alzu viel geworden :-((</P>


<i><p> &quot;Ein neuer Konkurrent f&#252;r ShapeShifter ist im Anmarsch:

 FUSION!
 Am interessantesten d&#252;rfte wohl die Tatsache sein,
 da&#223; man daran arbeitet, da&#223; Fusion mit dem MacOS 8.0
 zurechtkommt! Und eine PPC-Version wird auch folgen!
 Warum sollte sich dann noch jemand einen Mac kaufen?

 Vertrieb: Haage &amp; Partner&quot;</I> (Markus Bohne; NC 44; September 1997)</P>

<p>Heutzutage d&#252;rften es einige mehr sein, die &quot;Fusion&quot; kennen, aber auch fast drei Jahre sp&#228;ter ist immer noch keine PPC Version des Tools, obwohl mehrfach angek&#252;ndigt, erschienen. Wirklic traurig, wie lange man so hingehalten wird und letztendlich immer weiter vertr&#246;stet wird, aber dieses Besipiel ist wohl exemplarisch f&#252;r die schlechte Lage des Amigas seit 1997. Na ja, aber Fusion PPC soll ja noch diesen Sommer erscheinen - hoffen wir nur, da&#223; wir nicht bis Sommer 2003 warten m&#252;ssen :-))</P>

<p>So, da&#223; war es f&#252;r die vorl&#228;ufig erste Ausgabe der NC Classics, die leider nicht so umfangreich ausgefallen ist, wie ich es mir vorgenommen hatte. Tja, ist wohl K&#252;nstlerpech, aber da ich ohnehin nicht wei&#223;, wie die NC Classics so ankommen, kann es auch gut sein, da&#223; die ganze Arbeit nutzlos war. Teilt mir also Eure Meinungen zu den NC Classics mit und vielleicht folgt irgendwann auch mal ein zweiter Teil? </P>


<p>P.S.: Comments unter den Zitaten bitte nicht ganz ernst  nehmen...</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
