<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> Webringe </a></li>
<li> <a href="#a2"> Leserbriefe </a></li>
<li> <a href="#a3"> Flatrate</a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>

<hr>
<a name="a1"><br>
<center><font color="800000" size="5">
<b>Was ist ein Webring? </font></b></center><br><br>

<center>
<table width=98% border=0><tr><td bgcolor="#000000">
<a href="st_wolfinfo1.html"><img src="st_wolfinfo1.jpg" width=270
heigth=148 border=0 alt="webring.com"></a></td><td bgcolor="#000000"
valign=top> <font color="#b4cff5"><p>Bevor ich langatmig beginne und keiner
versteht mich, ist es wohl von Vorteil erst einmal auf der Website
www.webring.com nachzuschauen, was sich dahinter verbirgt. Ein Klick auf
das Logo reicht. </p>

<p>Das Logo habe ich auf 70% verkleinert und die Schaltfl&#228;chen
belassen, obwohl sie nat&#252;rlich nicht besetzt sind, also beim Anklicken
sagen: Tut mir leid, leider nicht vorhanden". <br clear=all> </p>
</td></tr></table>

<table border=0 width=100% cellpadding=8><tr><td>

<p>Hinter diesem Angebot verbergen sich ca 80.000 Webringe weltweit mit
Schwerpunkt USA. Es gibt aber auch ein deutsches Angebot f&#252;r
deutschsprachige Webringe. </p>

<p>Dieses ist l&#228;ngst nicht so gro&#223;, mehr oder weniger sogar noch
im Aufbau und lautet: <br> <center><b><a
href="st_wolfinfo2.html">www.webring.de</a></b></center></p>

<p>Ihr habt gesehen, der Aufbau ist typisch deutsch, klar,
&#252;bersichtlich und ohne Schn&#246;rkel, Klimbim oder sonstige
st&#246;renden Elemente. Die derzeitige Anzahl der Ringe wird schamhaft
verschwiegen. </p>

<p>Unsere &#220;berschrift lautet: Was ist ein Webring? Nachdem wir uns die
Startseiten von <b>www.webring.com</b> und <b>www.webring.de</b> betrachtet
haben, versuchen wir eine Antwort auf die &#220;berschrift zu erhalten. In
der Spalte Informationen hei&#223;t der erste Punkt: "Was ist Webring.de?"

<blockquote>
Der WebRing ist eine v&#246;llig kostenlose Dienstleistung, die allen
Interessenten aus dem Internet angeboten wird. Die schnell wachsende
Sammlung von Homepages aus aller Welt steht auch f&#252;r die Absicht, eine
neue Art von "Web-Community" zu begr&#252;nden. Der WebRing bringt einen
neuen Service in das World Wide Web, der die Organisation aller Webseiten
verbessern soll. Er stellt einen Weg dar, Seiten mit &#228;hnlichem Inhalt
(oder jede Seite, falls es jemand w&#252;nscht) durch Verlinkung in einem
Ring oder Kreis zusammenzufassen. [......] 
</blockquote>

Anschlie&#223;end kommt noch ein sehr langatmiger Artikel &#252;ber die
Fragestellung: "Wie arbeitet WebRing?" Mein ganzes Leben habe ich mich mit
"Beh&#246;rdendeutsch" und der sogenannten Amtssprache herumgequ&#228;lt.
Aber eine verflixt kurze und pr&#228;gnate Aussage w&#228;re in vielen
F&#228;llen ergiebiger und vor allem effizienter. </p>

<p>Die Leit-Idee des Ringes ist demnach, dass Inhaber von Websites mit
gleichem Thema einen Kreis bilden und einen Link zu seinem rechten Nachbarn
herstellen. Kommt nun ein Surfer auf eine Homepage und m&#246;chte mehr
lesen, klickt er sich zum Nachbarn weiter. Das kann er solange machen, bis
er wieder am Ausgangsort angekommen ist. </p>

<p>Das WebRing-CGI-Script erlaubt es, &#252;ber veraltete und nicht zu
erreichende Seiten hinwegzugehen und den Weg im Kreis fortzusetzen. Im
Falle von WebRing.DE wird au&#223;erdem der Webring regelm&#228;&#223;ig
auf Geschlossenheit gepr&#252;ft. </p>

<p>Da sehr viele diese Art der "Schubladengemeinschaft" noch nicht kennen
und sich demnach noch nicht angeschlossen haben, muss der Surfer
zwangsl&#228;ufig wieder auf die Datenautobahn "www" gehen und zusehen,
wann er die richtige Abfahrt findet, die manchmal derart schlecht
ausgeschildert ist, dass er h&#246;chstwahrscheinlich vorbeif&#228;hrt.
</p>

<p>Wer also seinen eigenen Autobahnanschluss haben m&#246;chte,
schlie&#223;t sich einem bestehenden Ring an und befindet sich unter
Gleichgesinnten, also in einer Gemeinschaft mit anderen Usern, die das
gleiche oder ein &#228;hnliches Thema in ihrer Homepage beschreiben. Wenn
er aber keinen bestehenden Ring findet, kann jeder selber als "Ringmaster"
fungieren, einen Ring ins Leben rufen und hoffen, dass sich andere
anschlie&#223;en. Ein Ringmaster sollte viel Zeit mitbringen und &#252;ber
seine stark erh&#246;hten Telefonkosten hinwegschauen. Schlie&#223;lich
muss er seinen Ring st&#228;ndig auf Funktionalit&#228;t und vor allem auf
Qualit&#228;t &#252;berwachen. Gesetzt den Fall, der Ring hie&#223;e
"B-Dorf" und soll die Gemeinde vorstellen. Die eine Homepage hat die
kulturelle Seite als Schwerpunkt, eine andere die verschiedenen Sparten von
Sport, andere wieder als Schwerpunkt Vereine usw usw. Nun kommt jemand
hinzu, der seinen "Freizeitclub" anbietet und beschreibt. Kommerzielle
Reklame und dann noch f&#252;r einen Puff ist nicht der richtige Ort im
Webring. Darauf hat der Ringmaster sein Augenmerk zu lenken. Ebenso hat er
strikt darauf zu achten, dass gewisses Gedankengut au&#223;en vor bleibt.
</p>

<p>Wer nun mehr erfahren m&#246;chte oder f&#252;r den meine
Ausf&#252;hrungen zu oberfl&#228;chlich und nicht ausreichend waren, schaut
selber auf den beiden angef&#252;hrten Websites nach. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
</font>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>Leserbriefe</font></b></a></p>

<p>In der letzten Feedbackcorner "beschwert" sich Kilian, dass keiner mehr
(fast keiner mehr) einen Leserbrief schreibt. Eigentlich ist dies
&#252;berhaupt nicht verwunderlich, denn in der Zeit der "@"-Kommunikation
sind Antworten, auf die man dann bis zu 8 Wochen (die Frage steht ja erst
in der kommenden NoCover-Ausgabe und die Antwort dann fr&#252;hestens in
der folgenden Ausgabe) warten muss, vollkommen illusorisch und sogar
gelinde gesagt Bl&#246;dsinn. Texte, die heutzutage in den Leserbriefen
aufgenommen werden, sind mehr oder weniger Statements an die Allgemeinheit,
obwohl nur einer pers&#246;nlich angesprochen wird. Denn die reinen
pers&#246;nlichen Fragen werden auf schnellstem Wege &#252;ber e-Mail,
Telefon oder einem Anschreiben auf Diskette erledigt. Die reine private
Unterhaltung in der Rubrik Leserbriefe gab es zu der Zeit, als e-Mail
f&#252;r fast alle noch ein Fremdwort war und sich noch keiner mit dem
Gedanken einer Anschaffung eines Modems befasste. </p>

<p>Kilian hat aber vollst&#228;ndig Recht, wenn er das Manko der
vollkommenen Leere ankreidet und mehr Beitragswillen einfordert. Denn im
Sinne der urspr&#252;nglichen Bedeutung dieser Rubrik ist es doch, ein
kurzes Statement zu einer bestimmten Sache abzugeben und sich nicht nach
dem Wohlergehen der Katze Mienchen zu erkundigen. Nat&#252;rlich
geh&#246;ren ausgewalzte Meinungserg&#252;sse weiterhin in die Sparten
Small Talk und Diskussionen und nicht nach Leserbriefe, aber kurze
Aussagen, Aufrufe, Antworten und Mitteilungen immer. Schlagt doch einmal
die Illustrierten oder die Wochenend -Feuilletons der Tageszeitungen auf,
da wird auch nur in kurzen, pr&#228;gnaten S&#228;tzen Dampf abgelassen,
aber auch Lob verteilt. Das w&#228;re doch <b>die</b> M&#246;glichkeit,
diese Rubrik wieder zu beleben, anstatt nachzudenken, wem k&#246;nnte ich
einen Leserbrief schreiben und es f&#228;llt kein Name ein. Wenn es meine
Wolf-INFO nicht geben w&#252;rde, h&#228;tte ich diesen Beitrag in
Leserbriefe postiert. </p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000" size="5">
<b>Flatrate</font></b></a></p>

<p>"Was ist das?" fragen eigentlich heutzutage nur noch sehr wenige.
F&#252;r diese sei eine kurze Antwort gegeben: Internet zum Festpreis. Und
warum schreibe ich dar&#252;ber? Es ist Bewegung in diesen Markt gekommen.
Bewegung ist eigentlich nur sehr harmlos ausgedr&#252;ckt, es ist ein
Erdbeben. Heute haben wir den 14. Juni und meine S&#228;tze k&#246;nnen
morgen schon wieder Makulatur sein. Deshalb lest diesen Abschnitt bitte auf
den heutigen Tag bezogen. Ende 1999 hat noch kein normaler User sich mit
dem Problem von Flatrate befasst, denn die fixen Kosten beliefen sich bei
mehreren Providern bis zu 300,- DM und dar&#252;ber (pro Monat). </p>

<p>Dann fingen verschiedene Anbieter an, auch den Privatuser mit
Preisnachl&#228;ssen zu locken, AOL, Mobilcom, Acor und Surf1, obwohl
letzter nicht ganz mithalten konnte. Die Telekom holte zum Rundumschlag aus
und bot den T-ISDN-XXL Tarif zum 01.06.2000 an: unbegrenzt telefonieren und
surfen im Internet zum Festpreis. Allerdings nur Sonn- und Feiertags sowie
auf Probe bis zum 31. Dezember. Zweiter Nachteil: ohne ISDN l&#228;uft
nichts. Was kostet dies (heute)? Zur normalen Grundgeb&#252;hr sind 14,89
DM Brutto hinzuzuf&#252;gen. Daf&#252;r werden f&#252;r Kunden der Telekom
alle City-, Regional- und Inlandsverbindungen an Sonn- und Feiertagen nicht
berechnet. </p>
<a name="aa3"><br>
<hr width=80%>

<p>Hier ein paar Ausz&#252;ge aus BilligerOnline Newsletter 24/2000 <br>

BilligerOnline das Providermagazin Newsletter -
<b>http://www.billigeronline.de </b><br> (Erkl&#228;rung: <a
href="#aa3">"A"</a> geht zum Artikel, <a href="#aa3">"Z"</a> kehrt hierher
zur&#252;ck) </p>
<p><b>3. Die News der vergangenen Woche </b>
<dl><dt>Die News im &#220;berblick <b>(nur Ausz&#252;ge!)</b>:</dt>

<dt>Montag, der 5.Juni 2000:

   <dd>- TeleBeL: ADSL f&#252;r 99 DM pro Monat <a href="#aa3a">"A"</a></dd>
   <dd>- surfEU: Tarifsenkung auf 2,9 Pf/Min <a href="#aa3b">"A"</a></dd>
   <dd>- EWE TEL: Echte Flatrate f&#252;r 68,43 Mark <a href="#aa3c">"A"</a></dd>
   <dd>- Teacher Flatrate von Surf1 <a href="#aa3d">"A"</a></dd></dt>

<dt>Dienstag, der 6.Juni 2000:

   <dd>- Vollst&#228;ndig kostenloser Internetzugang von Gigabell
   <a href="#aa3e">"A"</a></dd>
   <dd>- NGI mit Start der Flatrate zufrieden <a href="#aa3f">"A"</a></dd>
   <dd>- Dusnet plant Wochenend-Flatrate <a href="#aa3g">"A"</a></dd>
   <dd>- Telekom: XXL-Tarif von AOL gestoppt? <a href="#aa3h">"A"</a></dd></dt>

<dt>Mittwoch, der 7.Juni 2000:

   <dd>- Neue AMD-CPUs "Thunderbird" deutlich schneller als Pentium III
   <a href="#aa3i">"A"</a></dd>
   <dd>- sonnet: Kurzzeitiger Anmeldestopp  <a href="#aa3j">"A"</a></dd></dt>

<dt>Donnerstag, der 8.Juni 2000:

   <dd>- Kein XXL-Tarif ohne Chancengleichheit <a href="#aa3k">"A"</a></dd>

<dt>Freitag, der 9.Juni 2000:

   <dd>- Sonnet: Anbindung an UUNet, Registrierung bald wieder m&#246;glich
   <a href="#aa3l">"A"</a></dd>
   <dd>- Surf1: ADSL ab 1. Juli ? Statement von Gesch&#228;ftsf&#252;hrer Nylis
   G. Renschler II <a href="#aa3m">"A"</a></dd>
   <dd>- T-Online: Ab wann gilt die Flatrate ? <a href="#aa3n">"A"</a></dd>
   <dd>- Telekom darf XXL-Tarif jetzt doch anbieten
   <a href="#aa3o">"A"</a></dd></dt>

<dt>Samstag, der 10.Juni 2000:

   <dd>- Sonnet: Anmeldung wieder m&#246;glich / Jetzt auch Nutzung &#252;ber
   DF&#220;-Netzwerk m&#246;glich <a href="#aa3p">"A"</a></dd></dt>

<dt>Dienstag, der 13.Juni 2000:

   <dd>- Flat4you: Flatrate jetzt f&#252;r 77,27 DM pro Monat / Einrichtungsgeb&#252;hr
   entf&#228;llt Update <a href="#aa3q">"A"</a></dd>
   <dd>- Mehr als 1,5 Millionen Handy-Nutzer zahlen ihre Rechnung nicht
   <a href="#aa3r">"A"</a></dd></dt></dl>

<p>T&#228;glich aktuelle News finden Sie immer unter http://www.billigeronline.de </p>
<hr width=80%>
<a name="aa3a"><h3>TeleBeL: ADSL f&#252;r 99 DM pro Monat </h3>

<p>Seit dem 01. Juni 2000 bietet TeleBeL im Bergischen Land Internetzug&#228;nge
&#252;ber ADSL an. </p>

<p>Die Flatrate f&#252;r Privatkunden Speed:XXL kostet monatlich 99 DM. Mit
768 Kbit/s beim Datenempfang ist der Zugang 12 mal schneller als ISDN.
Allerdings gibt es ein Trafficlimit von 1 GB. </p>

<p>Bis Ende des Jahres m&#246;chte TeleBeL &#252;ber die H&#228;lfte des
Lizenzgebietes mit der neuen ADSL-Technologie versorgen k&#246;nnen. <br>
(Daniel Winter)<br>
URL: http://www.telebel.de  <a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3b"><h3>surfEU: Tarifsenkung auf 2,9 Pf/Min </h3>

<p>Der Internet by Call-Zugang von surfEU kostet ab sofort nur noch 2,9
Pf/Min. Eine Grundgeb&#252;hr oder Mindestabnahme gibt es nicht. </p>

<p>Zur Nutzung des Dienstes ist eine Anmeldung erforderlich. </p>

<p>(Daniel Winter) <br>
   URL: http://www.surfeu.de

<a href="#aa3">"Z"</a><hr width=80%></p>
<a name="aa3c"><h3>EWE TEL: Echte Flatrate f&#252;r 68,43 Mark </h3>

<p>EWE Tel hatte zum 1.Juni Teilzeitflatates f&#252;r
Direkt-Anschluss-Kunden eingef&#252;hrt. Die Preise f&#252;r die
Teilzeitflatrates wurden gesenkt und ab sofort wird eine 24h-Flatrate
eingef&#252;hrt. </p>

<p>Die 24-Stunden-Flatrate, die alle Kunden mit Direkt-Anschluss bei
EWE-Tel nutzen k&#246;nnen, kostet monatlich 68,43 DM. Es gibt keine
Mindestvertragslaufzeit und kein Transferlimit. Die m&#246;gliche
Kanalb&#252;ndlung wird mit 2,5 Pf/Min zus&#228;tzlich berechnet. </p>

<p>Die Teilzeitflatrate flat net easy kann nur von 8 bis 16 Uhr oder von 16
bis 24 Uhr genutzt werden. Daf&#252;r f&#228;llt die Grundgeb&#252;hr mit
48,88 DM hier deutlich niedriger aus. </p>

<p>Von 8 bis 24 Uhr kann der Tarif flat net profi f&#252;r 58,66 Mark pro
Monat genutzt werden. Au&#223;erhalb der Flatratezeiten werden 2,5 Pf/min
im Sekundentakt berechnet. <br>

(Daniel Winter) <br>
URL: http://www.ewetel.de/
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3d"><h3>Teacher Flatrate von Surf1</h3>

<p>Ab dem 5. Juni bietet Silyn-Tek (www.surf1.de) spezielle Online-Tarife
f&#252;r Lehrer in Rheinland Pfalz an. <br>
Alle Tarife enthalten sowohl die Telefon-, als auch die Onlinekosten.
<ul>
<li> Surf1 Power Teacher 10<br>
(10 Stunden Surfen zum monatlichen Festpreis von DM 9,95) </li>

<li> Surf1 Power Teacher 20<br>
(20 Stunden Surfen zum monatlichen Festpreis von DM 19,95) </li>

<li> Surf1 Power Teacher Flatrate <br>
(24-Stunden-Flatrate f&#252;r 69,50 DM pro Monat und einmalig 64,50 DM) </li>
</ul>
F&#252;r die Inanspruchnahme der erm&#228;&#223;igten Power Teacher-Tarife
wird eine schriftliche Best&#228;tigung der Schule ben&#246;tigt. <br>

(Daniel Winter) <br>
URL: http://www.surf1.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3e"><h3>Vollst&#228;ndig kostenloser Internetzugang von Gigabell
</h3>

<p>Ab sofort nimmt Gigabell Voranmeldungen f&#252;r den ersten rein
werbefinanzierten Internet-Zugang entgegen. Keine Grundgeb&#252;hr, keine
Einwahlgeb&#252;hren und keine Telefonkosten. Der Tarif freeOKAY.NET soll
nach den Sommerferien starten. Die ersten 100.000 Registrierten nehmen an
der Pilotphase teil. </p>

<p>Und so funktioniert freeOKAY.NET: eine eigens entwickelte Software
erm&#246;glicht die Einblendung eines Werbefensters, das am Bildschirmrand
erscheint. Das sogenannte Desktop-Portal (d-portal) ist 150 Pixel breit und
nimmt die gesamte H&#246;he des Bildschirms ein. </p>

<p>"Mit dem kostenlosen Dienst freeOKAY.NET l&#228;utet Gigabell eine neue
&#196;ra der Internet-Zug&#228;nge ein. Damit geh&#246;ren horrende
Telefonrechnungen und un&#252;bersichtliche Tarife der Vergangenheit an",
so Daniel David, Vorstandsvorsitzender der Gigabell AG. "Interessierte
Werbepartner gibt es genug. Derzeit f&#252;hren wir intensive Verhandlungen
mit Marktf&#252;hrern. Unter anderem sind wir auch mit Banken im
Gespr&#228;ch, um im Rahmen des neuen Dienstes den freeOKAY.NET-Kunden
Konten f&#252;r Online-Banking zur Verf&#252;gung zu stellen." <br>
(Daniel Winter) <br>
URL: http://www.gigabell.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3f"><h3>NGI mit Start der Flatrate zufrieden </h3>

<p>In einer Pressemitteilung &#228;u&#223;ert sich NGI sehr zufrieden mit
dem Interessane an der eigenen Flatrate. </p>

<p>"Das Interesse der Leute ist &#252;berw&#228;ltigend", kommentierte
Unternehmenssprecher Patrick Grassy die letzten Tage. "Ein f&#252;r alle
bezahlbarer Pauschaltarif ist der wohl wichtigste Schritt in Deutschland
zur Nutzung des Internets hin zum Massenmedium. Das Internet kann nun
f&#252;r jeden so selbstverst&#228;ndlich wie telephonieren oder fernsehen
werden." <br>

(Daniel Winter) <br>
URL: http://www.ngi.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3g"><h3>Dusnet plant Wochenend-Flatrate </h3>

<p>Eine Flatrate, die von Freitag 18:00 bis Montag 8:00 Uhr f&#252;r eine
Pauschalbetrag nutzbar sein wird, ist bei Dusnet in Vorbereitung. </p>

<p>In der &#252;brigen Zeit wird ein einheitlicher Minutenpreis ohne
Mindestumsatz oder Einwahlgeb&#252;r erhoben werden. Das Angebot wird
f&#252;r ganz Deutschland G&#252;ltigkeit haben. </p>

<p>Geplanter Starttermin ist der 16.06.2000. </p>

<p>Genauere Informationen sind noch nicht bekannt. <br>
(Daniel Winter) <br>
URL: http://www.dusnet.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3h"><h3>Telekom: XXL-Tarif von AOL gestoppt? </h3>

<p>Seit 1. Juni erm&#246;glicht der Wunschtarif "T-ISDN xxl" den Kunden der
Deutschen Telekom kostenloses telefonieren an Sonn- und Feiertagen. Doch
America Online, besser bekannt unter dem Markennamen AOL, erwirkte heute
eine Zwischenentscheidung vor dem Verwaltungsgericht, die die Genehmigung
der Regulierungsbeh&#246;rde f&#252;r den xxl-Tarif aussetzt. </p>

<p>Gerade mal 16% der Leser des Onlinemagazins teltarif.de fanden dieses
Vorgehen in Ordnung. Hingegen schlugen sich 49% der Leser auf die Seite der
Telekom. Weitere 35% meinten, dass der "lachende Dritte" im Kampf des
Marktf&#252;hrers T-Online gegen den Marktzweiten AOL die anderen Provider
sind. Innerhalb weniger Stunden hatten &#252;ber 1500 Leser an der
Befragung teilgenommen, die noch einige Tage online auf teltarif.de zu
finden sein wird. </p>

<p>Kai Petzke, Chefredakteur und Gr&#252;nder von teltarif.de, ist
&#252;berrascht &#252;ber das gute Abschneiden der Deutschen Telekom.
Bisher stand teltarif.de n&#228;mlich nicht im Ruf, besonders
Telekom-freundlich zu sein. Offenbar haben sich die Sympathiewerte in den
zwei Jahren seit der Deregulierung stark gewandelt: "Wenn die Deutsche
Telekom gute Angebote macht, dann wird das von den Nutzern auch
angenommen." </p>

<p>Verp&#246;nt sind hingegen anscheinend Firmen wie AOL, die per Gericht
und per PR-Kampagne immer wieder Druck auf die Deutsche Telekom machen,
aber selbst nicht viel zu bieten zu haben. So ist AOL bei kurzen
Onlineverbindungen dank Minutentaktung und Einwahlentgelt bis zu zehnmal
teurer als sekundengenau abrechnende Internet-Provider. </p>

<p>Ein Vielnutzer, der zehnmal t&#228;glich seine E-Mail-Eingangsbox
&#252;berpr&#252;ft, bezahlt folglich bei AOL allein an Grund- und
Einwahlgeb&#252;hren ca. 30 Mark mehr als bei Nutzung von g&#252;nstigen
Internet-by-Call-Angeboten. </p>

<p>W&#228;hrend die Deutsche Telekom oder Arcor schnelles Internet per DSL
mit Hochdruck ausbauen, ist auch hier von AOL kein vergleichbares Produkt
angek&#252;ndigt. Dabei w&#228;re es f&#252;r einen Branchenriesen wie AOL
ein leichtes, eine Kooperation mit DSL-Anbietern wie QSC
abzuschlie&#223;en, die das Privatkundensegment bisher noch nicht selber
versorgen. </p>

<p>Auch das Argument von AOL - &#252;ber T-ISDN xxl k&#246;nnte man sich
nur bei T-Online einw&#228;hlen - d&#252;rfte wenig stichhaltig sein: Bei
T-ISDN xxl sind sonntags alle innerdeutschen Verbindungen au&#223;er
Gespr&#228;chen zu Sonderrufnummern und zum Mobilfunk umsonst. AOL
m&#252;sste wahrscheinlich nur normale Festnetz-Einwahlnummern neben den
zur Zeit benutzten Sondernummern schalten, und k&#246;nnte seine Nutzer
dann ebenfalls von xxl profitieren lassen. <br>

(Daniel Winter) <br>
URL: http://www.telekom.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3i"><h3>Neue AMD-CPUs "Thunderbird" deutlich schneller als
Pentium III </h3>

<p>Bisher hat nur Intel dem Pentium III mit integriertem L2-Cache-Speicher
einen weiteren Leistungsschub verpasst - nun ist AMD auch mit dem Athlon so
weit: "tecChannel.de" hat getestet, um wie viel schneller der als
"Thunderbird" entwickelte Prozessor (CPU) tats&#228;chlich ist. </p>

<p>Die neuen Prozessoren von AMD wurden unter der Codebezeichnung
"Thunderbird" entwickelt, in den Handel werden sie aber unter dem Namen
Athlon kommen. Zum Start soll die neue AMD-CPU mit Taktfrequenzen zwischen
750 MHz und 1000 MHz erh&#228;ltlich sein. "tecChannel.de" hat exklusiv die
langsamste und die schnellste Version des "Thunderbird" unter die Lupe
genommen. Fazit des Tests: &#196;hnlich wie beim Pentium III von Intel
k&#246;nnen die neuen Athlon-Modelle durch den integrierten Cache-Speicher
bis zu neun Prozent mehr Leistung heraus holen. Damit ist der Athlon
wiederum deutlich der schnellste Prozessor f&#252;r PCs, wenn man eine
vergleichbare Testplattform mit PC133-SDRAM verwendet. Bei den wichtigen
Anwendungs-Benchmarks ist der neue Athlon sogar schneller als der Pentium
III mit DRDRAM. <br>

(Daniel Winter)
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3j"><h3>   sonnet: Kurzzeitiger Anmeldestopp </h3>

<p>Wie Sonnet auf seiner Internetseite schreibt, sind durch den
&#252;berw&#228;ltigenden Kundenansturm sind schon fr&#252;her als erwartet
Netzausbauarbeiten notwendig geworden und angelaufen. Die Anmeldung soll in
wenigen Stunden wieder m&#246;glich sein. </p>

<p>Mittlerweile haben sich &#252;ber 5000 Nutzer f&#252;r den Zugang
angemeldet. </p>

<p>Sonnet weist nochmal darauf hin, dass alle User die Einwahlsoftware von
sonnet nutzen sollen. Diese weist den Usern immer die f&#252;r Sie beste
nutzbare Einwahlnummer zu. So werden jetzt auch Nummern die mit 01044
beginnen genutzt. Nur durch die Software ist somit eine kurzfristige
Erweiterung der Kapazit&#228;ten m&#246;glich. </p>

<p>Nach Abschluss der Arbeiten will sonnet &#252;ber soviel Kapazit&#228;t
verf&#252;gen,
da&#223; die Einwahl f&#252;r alle problemlos sein wird. <br>

(Daniel Winter) <br>
URL: http://www.sonnet.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3k"><h3>Kein XXL-Tarif ohne Chancengleichheit </h3>

<p>Stellungnahme von Prof. Dr. Paul J.J. Welfens, Universit&#228;t
   Potsdam:
<blockquote>
<p>"Die Deutsche Telekom AG versucht konsequent, andere Wettbewerber durch
monopolistische B&#252;ndelungsgangebote vom Markt zu dr&#228;ngen. Die
Regulierungsbeh&#246;rde schadet dem deutschen Verbraucherinteresse, wenn
sie dies bei ihren politisch beeinflussten Entscheidungen nicht
ber&#252;cksichtigt. Es kann keinen XXL-Tarif ohne Chancengleichheit geben.
Langfristige Effizienzgewinne sind in bestm&#246;glicher Weise nur dann zu
erwarten, wenn der Wettbewerb auf einem unverzerrten "Spielfeld"
stattfindet. </p>

<p>In der Auseinandersetzung zwischen AOL und der Deutschen Telekom AG wird
&#252;bersehen, dass das marktbeherrschende Unternehmen Telekom selbst eine
allgemeine Internetpreissenkung dadurch verhindert, dass g&#252;nstige
Internetpauschaltarife auf der Gro&#223;handelsstufe bislang nicht
eingef&#252;hrt worden sind. </p>

<p>Zugleich hat es das marktbeherrschende Unternehmen geschafft, durch
vielf&#228;ltige neue Koppelprodukte seine Marktposition ohne ehrlichen und
transparenten Preiswettbewerb auszubauen. Es ist merkw&#252;rdig, wie sich in
Anbetracht des XXL-Verbots auf einmal einige Leute als unkritische
Verfechter von leicht durchschaubaren Interessen der Deutschen Telekom AG
entpuppen." </p>
</blockquote>

(Daniel Winter)
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3l"><h3>Sonnet: Anbindung an UUNet, Registrierung bald wieder
m&#246;glich </h3>

<p>Wie man auf der Website von Sonnet seit kurzer Zeit lesen kann nutzt
Versatel/Sonnet f&#252;r ihre Flatrate jetzt auch den UUNet Backbone und
vervierfacht so, die zur Verf&#252;gung stehenden Kapazit&#228;ten. So will
man dem immensen Kundenansturm gerecht werden. Ausserdem arbeitet die
Technikabteilung derzeit an der Bereitstellung weiterer Einwahlnummern, die
dann durch die Einwahlsoftware dynamisch vergeben werden um eine optimale
Erreichbarkeit zu gew&#228;hrleisten. Ist die Einwahlsoftware bereits
installiert mu&#223; deren Konfiguration nicht ver&#228;ndert werden, da
sie sich die neuen Nummern bei der Einwahl automatisch aus dem Netz
l&#228;dt.

<p>Wenn die Erweiterung abgeschlossen ist wird auch die Registrierung
f&#252;r Neukunden wieder m&#246;glich sein. Somit wird der Anmeldestopp
wahrscheinlich noch heute aufgehoben.

<p>Weitere Informationen finden sie in unserer Flatrate&#252;bersicht

<p>Kommentar: Ein Flatrateanbieter, der wirklich etwas tut anstatt die
Probleme auf Kooperationspartner zu schieben, wie es die T-Net-Reseller nur
all zu gerne tun. Bleibt abzuwarten, ob die Ma&#223;nahmen wirklich den
gew&#252;nschten Erfolg haben. <br>

(Tillmann Haas) <br>
URL: sonnet: http://www.sonnet.de <br>
Flatrate&#252;bersicht: http://www.billigeronline.de/aktuellflatueber.shtml
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3m"><h3>Surf1: ADSL ab 1. Juli ? Statement von
Gesch&#228;ftsf&#252;hrer Nylis G. Renschler II </h3>
  

<p>Nachdem es lange Zeit keine Infos von Surf1 gab, besonders in Bezug auf
die Preisgestaltung, die mittlerweile relativ hoch angesetzt ist, wenn man
Flatrates f&#252;r 80DM und weniger betrachtet, haben wir nun eine teils
exklusive Information von Nylis G. Renschler, dem Gesch&#228;ftsf&#252;hrer
von Surf1 per eMail bekommen. </p>

<p>Er k&#252;ndigt 2 neue Tarife an, die Ende des Monats anl&#228;sslich
einer Pressemitteilung offiziell angeboten werden. Die Angebote sollen
diesmal sehr attraktiv sein, sodass sich das Warten lohnt und er bittet
darum nicht voreilig zu k&#252;ndigen. Das lange Schweigen begr&#252;ndet
er damit, dass er z.Z. sehr besch&#228;ftigt ist und mehrere ISPs in den
USA und der T&#252;rkei er&#246;ffnet hat. </p>

<p>Bei den erw&#228;hnten Angeboten handelt es sich zum einen um eine
DSL-Flatrate, die ab 1. Juli angeboten werden kann, wenn die Telekom die
DSL-Technik f&#252;r Surf1 und die anderen Telekomreseller freigibt.
F&#252;r die DSL-Flatrate sollen keine zus&#228;tzlichen Kosten anfallen.
</p>

<p>Als 2. Angebot k&#246;nnte ich mir z.B. ISDN-Kanalb&#252;ndelung
vorstellen. An einer Preissenkung f&#252;r eine einfache ISDN bzw.
Modemflatrate wird Surf1 jedoch nicht vorbeikommen, wenn sie keine Kunden
verlieren wollen. </p>

<p>Ausserdem ging Herr Renschler in seiner eMail noch auf die Lehrertarife
ein, die schon seit 2 Monaten in Arbeit waren und immer noch ein sehr gutes
Angebot darstellten, dass es Lehrern erm&#246;glicht sich mit dem Internet
auszukennen und zu besch&#228;ftigen, so Renschler. Er w&#228;re nicht
bereit sein Angebot zu stoppen, nur weil "Big-T", also die Telekom
versuchen w&#252;rde Surf1 's Angebote zu &#252;bertrumpfen. <br>

(Tillmann Haas) <br>
URL: http://www.surf1.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3n"><h3>T-Online: Ab wann gilt die Flatrate ? </h3>
   
<p>Der 1. Juni ist der offizielle Starttermin gewesen. Seit dem kann man
sich auf der Website von T-Online f&#252;r den neuen Tarif anmelden bzw.
als bestehendes Mitglied ummelden. Ist man neu ist der Fall klar, da man
seine Einwahldaten via Einschreiben erh&#228;lt. Weniger klar ist es
f&#252;r bestehende Mitglieder: Alle Mitglieder erhalten eine eMail in der
steht ab wann sie freigeschaltet sind. hat man sich bis zum 4.6. angemeldet
ist man in der Regel am 6.6. freigeschaltet, so Walter Genz, Pressesprecher
der Telekom. Je nach der Anzahl der vorliegenden Anmeldungen kann die Zeit
bis zur Freischaltung variieren. </p>

<p>Quelle: http://www.Teltarif.de </p>

<p>Kommentar: Ich empfehle unbedingt zu warten bis man eine entsprechende
Best&#228;tigung als eMail erhalten hat. Alternativ besteht die
M&#246;glichkeit sich unter der kostenfreien Rufnummer 0800 33 0 5000
&#252;ber den Status zu informieren. Hierzu halten sie am besten ihre
Telefonnummern (bzw. Mehrfachrufnummern bei ISDN) sowie ihre T-Online
Zugangsdaten bereit. <Br>

(Tillmann Haas) <br>
URL: http://www.t-online.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3o"><h3>Telekom darf XXL-Tarif jetzt doch anbieten </h3>

<p>Die Pressestelle der Deutschen Telekom teilte soeben mit, dass das
Oberverwaltungsgericht in M&#252;nster den XXL-Tarif nun doch genehmigt
hat. AOL blieb erfolglos beim Versuch die Kombination von kostenlosen
Telfon- und Onlineverbindungen an Sonntagen und bundesweiten Feiertagen zu
vereiteln. </p>

<p>AOL hatte zu diesem Zweck beim Landgericht in K&#246;ln einen so genannten
Zwischenentscheid erwirkt, der der Telekom den Vertrieb des Kombi-Produktes
vorl&#228;ufig untersagt hatte. Dieser Zwischenentscheid ist damit aufgehoben.
</p>

<p>Quelle: http://www.Teltarif.de <br>

(Tillmann Haas) <br>
URL: http://www.t-online.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3p"><h3>Sonnet: Anmeldung wieder m&#246;glich / Jetzt auch
Nutzung &#252;ber DF&#220;-Netzwerk m&#246;glich </h3>

<p>Die Arbeiten zur Erweiterung der Kapazit&#228;t sind jetzt abgeschlossen. Ab
sofort kann man sich auf der bekannten Seite wieder anmelden. </p>

<p>Ausserdem kann man jetzt auch manuell im DF&#220;-Netzwerk eine Verbindung
mit der Rufnummer 0800-6624530 erstellen. Das Routing bzw. die Auswahl der
Einwahlnummern wird nun offenbar nicht mehr durch die Software erledigt.
Das Distributed-Network Prinzip sollte also auch so funktionieren. <br>

(Tillmann Haas) <br>
URL: http://www.sonnet.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3q"><h3>Flat4you: Flatrate jetzt f&#252;r 77,27 DM pro Monat /
Einrichtungsgeb&#252;hr entf&#228;llt Update </h3>

<p>Flat4you hat die Konditionen f&#252;r die Flatrate verbessert. Die
Grundgeb&#252;hr betr&#228;gt jetzt 77,27 DM. Es gibt keine
Einrichtungsgeb&#252;hr mehr und die Mindestvertragslaufzeit betr&#228;gt
nach wie vor 6 Monate. </p>

<p>Eine Nutzung von Kanalb&#252;ndlung ist f&#252;r 2,99 Pf/Min
zus&#228;tzlich m&#246;glich. </p>

<p>Flat4you nutzt den Telekombackbone. Die Kundenzahl ist vorerst auf 5000
begrenzt. </p>

<p>Einen Vergleich aller neuen Flatrates finden Sie unter
http://www.billigeronline.de/aktuellflatueber.shtml <br>

(Daniel Winter) <br>
URL: http://www.flat4you.de
<a href="#aa3">"Z"</a><hr width=80%></p>

<a name="aa3r"><h3>Mehr als 1,5 Millionen Handy-Nutzer zahlen ihre Rechnung nicht </h3>

<p>Mehr als 1,5 Millionen Handynutzer besitzen das vermeintliche
Statussymbol, ohne es sich leisten zu k&#246;nnen. Forderungen in H&#246;he von 750
Millionen DM m&#252;ssen die Mobilfunkunternehmen in diesem Jahr abschreiben,
prognostiziert die Mummert + Partner Unternehmensberatung. Das sind im
Schnitt 3,5 Prozent des Umsatzes. Die Spitzenreiter der Branche verlieren
sogar bis zu acht Prozent ihres Umsatzes durch zahlungsunf&#228;hige
Mobiltelefonierer. <br>

(Daniel Winter)
<a href="#aa3">"Z"</a><hr width=80%></p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir wie
immer nur einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b> Amiga-Spiele</b> von  Thomas Weber</li>
<li> <b> BeOS 5</b> von  Cord Hagen</li>
<li> <b> Falke-Verlag</b> von Ren&eacute; Stelljes </li>
<li> <b> Fears</b> von  G&#252;nter Kohlm&#252;ller</li>
<li> <b> Feedback - Corner</b> von Kilian Servais </li>
</ul>

<p>Kilian ist nach meinem System ganz arm dran. Derweil erscheinen fast nur
noch Artikel von ihm, sogar die Rubrik Story m&#246;chte er wieder beleben, und
er erscheint in meiner Auflistung gerade ein Mal. </p>

<p>Ren&eacute; mich juckt es gewaltig, dass die NoCover teilweise mehrere
Tage Versp&#228;tung hat. Es wurde einmal ein Redaktionsschlusstermin benannt
und den sollte man doch einigerma&#223;en einhalten k&#246;nnen. Oder es wird
festgelegt, dass sich der Erscheinungstermin vom 1. auf den 5. des Monats
ge&#228;ndert hat. Dann schaut man nicht mehr zweist&#252;ndig in seiner Mailbox
nach. </p>

<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
