<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>World Of Alternatives Messebericht</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<p><h1><center><font color="yellow">World Of Alternatives - Messebericht</Font></h1></P>
<p><img src="km1.jpg"></Center></P>
<p>Selten zuvor wurde eine AmigaMesse so herbeigesehnt wie die in Neuss und so war ich wirklich froh, da&#223; ich mir den 11.6.200, einen Samstag, f&#252;r diese Veranstaltung freihalten konnte. Denn eines war klar: Wenn die Messe floppt, war es das wohl endg&#252;ltig mit dem Classic Amiga - vorweg kann ich euch gleich beruhigen: Die Messe war ein Erfolg!</P>

<p>Los ging`s fr&#252;h morgens mit dem Zug (und dem 35 DM teuren Wochenendticket) Richtung D&#252;sseldorf und von da Richtung Neuss zum Bahnhof. Tja , und hier gab`s schon das erste Problem: Da ich noch nie in Neuss war und keine Ahnung hatte wo die Stadthalle zu finden war, mussten mir erst zwei Atari User erkl&#228;ren, wie ich dort hinkomme. Die beiden waren auch recht nett und wir unterhielten uns sowohl &#252;ber den Amiga als auch den Atari und schon hier merkte man, da&#223; die ehemaligen Erzfeinde Atari &amp; Amiga im Grunde das selbe Ziel verfolgen. Aber wie auch immer: Nach einer 10 min&#252;tigen Busfahrt erreichten wir die Stadhalle uns jetzt konnte es endlich los gehen...</P>

<p>Also Ticket gekauft (18 DM) und rein in die Halle bzw. in die Vorhalle, wo man sich sinnvollerweise erstmal mit Info`s (also Hallen- und Eventplan) zudecken konnte und zudem einige Organisationen wie &quot;Amiga-News.de&quot; und &quot;Amiga Club im BTX &amp; Internet&quot; antreffen konnte. Zudem befanden sich im Vorraum auch noch die &quot;Euro Trading GMBH&quot;, die einige alte Amiga &amp; Atari Spiele dabei hatten, die f&#252;r mich aber zugegebenerma&#223;en recht uninteressant waren. Zudem waren hier noch einige Atari Firmen zu finden, die man erstmal auch links liegen lassen konnte. Nachdem man sich hier also etwas umgeblickt hatte ging`s in die Innenhalle und hier war endlich der Amiga geb&#252;hrend vertreten:</P>

<p>Der erste Rundgang brachte mich zun&#228;chst zum <b>Falke Verlag</B>, der einen der gr&#246;&#223;ten Messest&#228;nde inne hatte und dort nat&#252;rlich auch sein ganzes Sortiment anbot: Neben dem Atari Mag &quot;ST Computer&quot; war nat&#252;rlich die Amiga Sektion (die einen Gro&#223;teil des Standes ausmachte) am interessantesten: Neben der aktuellen Amiga Plus Ausgabe gab`s auf der Messe auch die druckfrische neue Ausgabe der Amiga Future, die regul&#228;r erst zwei Wochen sp&#228;ter erscheinen sollte, zum Vorugspreis von 15 DM zu kaufen - eine lohnenswerte Investition (Vollversion: Final Odysee). Auch die Amiga Plus CD`s konnten zum Vorugspreis 
erstanden werden und selbstredent waren auch &#228;ltere Ausgaben der Magazine zum Vorugspreis auf der Messe zu haben.</P>

<p>Ah, da ist ja auch schon der Stand vom <b>APC &amp; TCP </B>und auch unser Club hatte, neben dem normalen Sortiment an CD`s &amp; Games, mal wieder einige Neuerungen zur Messe parat: Die CD &quot;Digital Make Up&quot; soll die Workbench grafisch aufpeppen und enth&#228;lt alle Tools die daf&#252;r n&#246;tig sind und ist f&#252;r OS 3.5 optimiert. Auch recht interessant scheint die CD &quot;Faces Of Mars&quot; zu sein, auf der sich die ehemalieg gleichnamige PD Serie befindet und massig interessantes Material zu enthalten scheint. Ebenfalls neu sind die CD`s &quot;Scene Archives 10&quot; (Demos etc.), &quot;The Amiga Games Guide&quot; (Amigaspiele Datenbank im HTML &amp;
 AG Format) und &quot;Amiga Arena&quot; (FD Collection mit Vollversionen). Wollen wir nur hoffen, da&#223; sich die CD`s auch entsprechend verkaufen...</P>

<p>Direkt daneben ist der Stand der <b>Schatztruhe</B> angesiedelt, die ebenfalls mit ihrem ganzen Sortiment angreist waren und einer der wichtisgten Anlaufstellen auf der Messe im Bezug auf Software f&#252;r den Amiga waren. &#220;berraschungen gab`s hier zwar keine, aber daf&#252;r konnte man die eine oder andere CD zu speziellen Messepreisen erstehen und auch das eine oder andere Schn&#228;ppchen lie&#223; sich hier machen (z.B. &quot;Turbo Calc 4.0&quot; f&#252;r 5 DM). Sogar die aktuelle Aminet CD 37 ist p&#252;nktlich eingetroffen und konnte zumindest mich begeistern (Vollversion: &quot;Zombie Massacre").</P>

<p>Weiter geht`s zum Spielepublisher &amp; Herrsteller <b>Epic Marketing</B>, die ebenfalls s&#228;mtliche Produkte anboten und noch mit attraktiven Messepreisen aufwarten konnten. &quot;Simon The Sorcerer II&quot; war leider noch nicht fertig, aber daf&#252;r konnte man &quot;Foundation Gold&quot; antesten und nat&#252;lich gleich mitnehmen. Ansonsten gab`s hier noch zahlreiche Spiele CD`s zu erstehen. Recht interessant fand ich die Tatsache, daﬂ "Foundation" auch auf den Atari portiert werden soll.
</P>

<p>Etwas d&#252;rftig ausgefallen ist der Stand von <b>Individual Computers</B>, die sich ganz der Hardware verschrieben haben und neben der Netzwerkkarte &quot;X-Surf&quot; auch die Schnittstellenkarte &quot;Silversurfer&quot; sowie &quot;Ide-Fix&quot; zu speziellen Preisen anboten. Aber auch ein Kult Objekt fand sich an diesem Stand: Unter einer Glasvitrine befand sich ein A1000 mit einem Autogramm von Jay Miner - m&#246;chte nicht wissen, was daf&#252;r einige Leute heute zahlen w&#252;rden...</P><center></P><img src="km2.jpg"></Center></P>

<p>Ganz im Zeichen der Software stand der Stand von <b>KDH Datentechnik</B>, die als Highlight auch den brandneuen 3D Shooter &quot;Heretic II&quot; aus dem Hause ID Software / Hyperion dabei hatten und diesen auch bereitwillig verkauften. Im Gegensatz zu anderen aktuellen Amiga Games kommt dieser sogar in einem Pappkarton wie man es von fr&#252;her kennt und d&#252;rfte f&#252;r Highend User mit PPC &amp; entsprechender GraKa genau das richtige sein. Daneben gab`s nat&#252;rlich noch viel weitere Software sowie diverse Hardware &amp; Zubeh&#246;r zu erstehen und auch das eine oder andere Schn&#228;ppchen lie&#223; sich machen.</P>

<p>Und wo wir gerade bei Hyperion waren: Am Stand von <b>Titan Computer</B>, der gleich daneben lag und seinerseits Publisher f&#252;r Hyperion Umsetzungen ist, gab`s eine der wenigen &#220;berraschunge auf der Messe: Hyperion setzen den 3D Shooter &quot;Soldiers Of Frtune&quot; f&#252;r den Amiga und den Mac um. Dieser basiert auf einer ver&#228;nderten Quake II Engine und soll im 4.Quartal erscheinen - weitere Informationen sollen bald folgen. Neben dieser Ank&#252;ndigung konnte man am Stand der Titanen zum einen nat&#252;rlich das komplette Sortiment (Spiele &amp; Anwendungen) erstehen sowie eine neue Demo Version des Napalm Konkurrenten &quot;Exodus - The Great War&quot; testen. Diese neue Demo hat es tas&#228;chlich in sich und ich waage an dieser Stelle einfach mal die Prognose, da&#223; &quot;Exodus - The 
Great War&quot; &quot;Napalm&quot; vom Genre Thron st&#246;&#223;t und sich seinerseits dort etabliert. Seit der ersten Demo Version hat sich dort n&#228;mlich noch einiges getan, aber davon k&#246;nnt Ihr Euch ja selbst &#252;berzeugen, wenn die finale Demo in`s Aminet geladen wird. Anscheinend hat das aber auch ClickBoom (Herrsteller von &quot;Napalm&quot;) gemerkt und hat gleichzeitig, statt der geplanten Mission CD, &quot;Napalm 2&quot; angek&#252;ndigt. Wird bestimmt ein sehr interessanter Zweikampf...</P>

<p>Aber nicht nur Game Freaks, sondern auch &quot;ernsthafte&quot; Anwender kamen in Neuss auf Ihre Kosten: <b>Haage &amp; Partner</B> lie&#223;en es sich n&#228;mlich nicht nehmen, auch mit der ganzen Produktpalette anzureisen und hatten zudem mit &quot;Amiga Writer 2.0&quot; (f&#252;r das es mitlerweile einen Patch auf Version 2.1 in dem u.a. Fehler bereinigt wurden auf der Homepage gibt), &quot;Art Effect 4.0&quot; sowie einigen Zusatz CD`s f&#252;r diverse Programme nebst Programmierwerkzeugen ganz hervorragende neue Versionen im Koffer, die man sich zudem auf der Messe vorf&#252;hren lassen konnte. F&#252;r &quot;Art Effect&quot; habe ich mich zwar nicht besonders interessiert, aber &quot;Amiga Writer 2.0&quot; schaut sehr gut aus und d&#252;rfte sich wohl in naher Zukunft zum Standard auf dem Amiga erheben, da sowohl &quot;Wordworth&quot; als auch &quot;Final Writer&quot; nicht mehr weiterentwickelt werden. In diesem Zusammenhang sei gleich erw&#228;hnt, da&#223; auf der Messe das Ger&#252;cht rumging 
(=&gt; eigentlich war es mehr als ein Ger&#252;cht, aber offiziell war es halt noch nicht), da&#223; die Atari Textverarbeitung &quot;Papyrus&quot; auf den Amiga umgesetzt werden soll, sofern sich Programmierer finden...</P>

<p>Von Haage &amp; Partner geht`s gleich weiter zu <b>Eternity</B>, die zum einen die WB Erweiterung &quot;EASys&quot; im Gep&#228;ck hatten und zum anderen eine neue Version des Internet Games &quot;Tales Of Tamar&quot; in regelm&#228;&#223;igen Abst&#228;nden pr&#228;sentierten. Bei diesen Vorf&#252;hrungen sammelten sich immer gro&#223;e Massen an und insbesondere das lange Intro sorgte f&#252;r globale Begeisterung, denn die grafische Qualit&#228;t sucht auf dem Amiga seinesgleichen. Eine Exclusiv Demo (allerdings ohne 
das atemberaubende Intro, von dem ihr bestimmt noch h&#246;ren werdet) mit Soundtracks im CDDA Format befindet sich &#252;brigens auf der aktuellen Amiga Future CD 25.</P>

<p>Auch der K&#246;lner H&#228;ndler <b>Cool Bits</B> lie&#223; es sich nicht nehmen auf der Messe auszustellen und hatte, wie alle anderen auch, sein komplettes Angebot mit nach Neuss gebracht; u.a. waren auch die PPC GraKa`s in geringen St&#252;ckzahlen wieder lieferbar, so da&#223; der eine oder andere jetzt stolzer Bezitzer eines PPC Amigas mit entsprechender GraKa ist. Ebenfalls am Cool Bit`s Stand pr&#228;sent war <b>Innovative</B>, seines Zeichens Herrsteller von fxPaint, VHI Studio sowie fxScan. P&#252;nktlich zur Messe hatte man von allen Programmen Updates dabei, die man, gegen Vorlage der Original CD, erwerben konnte. Einem Neukauf stand nat&#252;rlich auch nichts im Wege und wer fxPaint nur vom h&#246;rensagen kennt, der konnte sich die aktuelle Version 1.5 auch vom Programmierer h&#246;chst pers&#246;nlich vorf&#252;hren lassen.</P> 

<p><b>Vesalia</B>, wahrscheinlich der momentan gr&#246;&#223;te Amiga H&#228;ndler, lie&#223; sich den Messebesuch auch nicht nehmen. Tja und leider waren die PPC Turbokarten wieder einmal nicht lieferbar und konnten nur vorbestellt werden - der vorraussichtliche Liefertermin, der angegeben wurde, war der 20.6.2000; also gut eine Woche nach der Messe. Daf&#252;r waren aber die PPC GraKa`s lieferbar und auch die Zusatzmodule f&#252;r die Picaso IV, mit Ausnahme des Voodoo Add-on`s, konnten gleich mitgenommen werden. Auch was sonstige Hardware (Brenner, Festplatten, CD Laufwerke etc.) angeht, konnte man am Vesalia Stand fast alles bekommen, was das Herz begehrt. Tja, und eine kleine (?) &#220;berrschung hatten Vesalia auch noch zu bieten: So wurde in einer Vitrine der Prototyp des PCI Boards &quot;Mediator&quot; gezeigt, der PCI auch auf dem Amiga endlich m&#246;glich macht. Hergestellt wird das Board &#252;brigens von der Firma Elbox, ein Erscheinungstermin wurde noch nicht genannt, aber nun h&#228;tte man endlich die M&#246;glichkeit, Grafikkarten, USB Karten etc. vom PC Markt auch 
kosteng&#252;nstig auf dem Amiga einzusetzen. </P>

<p><b>Verkosoft</B>, von denen ich dachte, da&#223; sie sich aus dem Amiga Markt zur&#252;ckgezogen h&#228;tten, waren auch auf der Messe anwesend und hatten lediglich &#228;ltere, originale Amiga Spiele dabei, die gr&#246;&#223;tenteils zu Dumping Preisen unter das Volk gebracht wurden. Zwar frage ich mich, wie man noch an versiegelte Original Versionen von &quot;Lemmings&quot; oder &quot;B.A.T. II&quot; gekommen ist, aber den geneigten Zocker Freund d&#252;rfte das nicht weiter interssieren, immerhin bekam man hier nochmal die M&#246;glichkeit seine Classic Spiele Sammlung f&#252;r wenig Geld zu erweitern. Ansonsten gab`s bei Verkosoft aber nicht viel...</P>

<p>Der Vertrieb <b>A. Kn&#246;tig</B> f&#252;hrte auf der Messe das neue (oder besser: jetzt erst ver&#246;ffentlichte) Ballerspiel &quot;Apano Sin&quot; vor, das zu einem Preis von 50 DM gleich mitgenommen werden konnte. Allerdings machte das Game keinen besonders guten Eindruck auf mich und konnte, so weit ich das einsch&#228;tzen konnte, selbst Klassikern im Bereich der horizontalen Ballergames wie etwa &quot;Xenon 2&quot; nicht das Wasser reichen. Zus&#228;tzlich gab`s hier, &#228;hnlich wie bei Verkosoft, noch einige &#228;ltere Original Games zu Ausverkaufspreisen. </P>

<p>Und last but not least w&#228;ren da noch <b>Drei†Ein Halb</B> zu nennen, die eine breite Auswahl an Zubeh&#246;r (Joysticks, M&#228;use etc.), &#228;ltere Software (Spiele &amp; Anwendungen), B&#252;cher und Hardware dabei hatten. F&#252;r mich war hier zwar nix interessantes bei, aber der eine oder andere wird da sicherlich f&#252;ndig geworden sein.</P> 

<p>So, da&#223; war jetzt ein kleiner Rundgang durch den Reigen der Amiga H&#228;ndler. Die Atari H&#228;ndler habe ich bewusste au&#223;en vor gelassen, da es sich bei vielen lediglich um Gebraucht- und Ramschh&#228;ndler handelte, die keine Neuigkeiten f&#252;r das Atari System dabei hatten. Auch insgesamt hatte ich das (gute) Gef&#252;hl, da&#223; in der Amiga Sektion deutlich mehr los war als in den Atari Gegenden, woraus man den R&#252;ckschluss ziehen kann, da&#223; mehr Amiga User auf der Messe waren und sich dort im allgemeinen mehr getan hat als im Atari Sektor. Hervorhebenswert ist lediglich der Stand von <b>Milan &amp; Axro</B>, die den neuen Rechner vorstellten, der allerdings ausschaut, als ob er vom Chef h&#246;chstpers&#246;nlich auf dem Schrottplatz zusammengebaut wurde (sorry, mein Eindruck). Und auch ansonsten waren mir die Atari`s dort nicht ganz geheuer: Als man sich dort einen Atari genauer anschaute, erkannte man auf einmal die Glow Icon`s (!) und als man dort etwas ausprobierte ist 
der Rechner offenbar abgeschmiert. Wobei hier auch die Frage gestattet sei, wie man im Jahre 2000 auf die Idee kommt, einen Rechner auf 68K Basis zu bauen - die Chips werden nicht mehr hergestellt und sind zudem teurer als PPC oder X86 CPU`s und von der Rechenleistung maximal mit der Leistung eines P90 vergleichbar. </P>

<p>Aber nun wieder zur&#252;ck zum Amiga Markt: Beim zweiten Rundgang traf ich zuf&#228;llig noch Wolf Zimmer sowie Thomas Weber und wir unterhieltemn uns &#252;ber diverse Dinge und verbrachten die restliche Zeit noch zusammen. Wie schon vor zwei Jahren in K&#246;ln gab Wolf mal wieder einen Kaffe in der absolut &#252;berteuerten Cafeteria aus (Thanx Wolf!). Nat&#252;rlich gingen wir noch mehrmals &#252;ber die Messe und schauten auch nochmal am <b>APC &amp; TCP</B> Stand vorbei, wo wir uns noch l&#228;nger mit Andreas &quot;The Boss Himself&quot; Magerl, Sascha &quot;Clubtreffen 2000&quot; van Wahnem und dem Br&#252;derduo Phillip und Georg Breitenspecher, die allesamt am Stand aushalfen, unterhielten. Ansonsten konnten wir aber leider keine Clubmitglieder ausmachen - wo wart Ihr alle??</P>

<p>Auch <b>Petro</B> war auf der Messe vertreten, hatte aber ausser dem Verteilen von Amiga Souvenirs (Mauspads, Sticker etc.) keine wirkliche Aufgabe und zumindest ich habe den Eindruck, da&#223; er mitlerweile den selben Status wie der Amiga Boing Ball hat: Er geh&#246;rt zwar dazu, hat aber nix zu melden. Zum einen traurig, aber zum anderen macht mir McEwen (siehe unten) einen &#228;u&#223;erst kompeteten Eindruck und es ist vielleicht besser, wenn nicht st&#228;ndig zwei m&#246;gliche Wege (NG vs. PPC) diskutiert werden und am Ende gar nix rauskommt. </P><center></P><img src="km3.jpg"></Center></P>

<p>Nachdem mich dann sowohl Wolf als auch Thomas gegen 15 Uhr verlassen hatten, entschloss ich mich noch dazu, mir <b>Bill McEwens</B> Vortrag &#252;ber die Zukunft des Amigas anzugucken, womit wir beim eigentlichen Highlight der Messe w&#228;ren. Allerdings muss ich hier erstmal massive Kritik am Veranstalter &#252;ben: So war der Vortrags &quot;Raum&quot; nix anderes als ein winziger Bereich, der mit Stellw&#228;nden abgetrennt wurde. Ausserdem gab es viel zu wenig St&#252;hle und der Platz reichte bei allen Vortr&#228;gen vorne und hinten nicht aus. Ich hatte nat&#252;rlich auch das Pech, da&#223; ich stehen durfte und hinter mir kamen noch irgendwelche ganz schlaue Gestalten auf die Idee, den Raum einfach dadurch zu vergr&#246;&#223;ern, indem man einfach die Stellw&#228;nde auseinander nimmt. Auf die Idee, da&#223; dadurch die ganze Konstruktion zusammenbrechen k&#246;nnte, kamen diese Intelligenzbolzen wohl nicht. Und last but not least waren auch die Temperaturen viel zu hoch. Aber wie 
dr&#252;ckte es Bill Mc Ewen aus: Welcome to Amiga Sauna....</P>

<p>Nun aber zur eigentlichen Pr&#228;sentation: Vorher hatte ich mir eigentlich nie gro&#223;e Gedanken um Bill McEwen gemacht; er war halt ein weiterer Amiga Pr&#228;sident, der mit vielen Worten um sich wirft. Mir pers&#246;nlich gefiel ja Jim Collas immer noch am besten, aber nachdem, was ich da am Samstag gesehen und geh&#246;rt hatte, steht Bill McEwen ihm in keinster Weise nach. Der Mann ist rhetorisch mindestens genauso begabt, hat es drauf, die Leute in seinen Bann zu ziehen und ist zudem noch ein recht humorvoller Zeitgenosse. Als z.B. das Handy eines Anwensenden klingelt meint Bill nur: &quot;Wenn es Bill Gates ist, sag ihm ich kaufe Microsoft nicht&quot;. Und solche Jokes lockerten die Atmosph&#228;re merklich auf. Aber auch das, was er uns &#252;ber die Zukunft von Amiga erz&#228;hlte, machte mich sehr euphorisch: So wurde auf der Messe zum einen das SDK (Software Development Kit) bei den H&#228;ndlern verkauft, das aus einer CD und einem Handbuch (sogar mit Bildern, wie McEwen scherzhaft 
anmerkte) besteht. Zus&#228;tzlich merkte er an, da&#223; Amiga keine Schulden h&#228;tte, da&#223; es bald einen neuen Vice President Of Engineering geben wird (der offenbar aus dem Hause Microsoft stammt!) und das es auch einen neuen Amiga namens Amiga One geben wird. Aber das war bei weitem noch nicht alles, was er gesagt hatte: Auch eine Demo vom neuen AmigaOS (oder das, was es mal werden wird) wurde pr&#228;sentiert und hat mich zutiefst beeindruckt. Aber ich denke, da&#223; dar&#252;ber auch ein ausf&#252;hrlicher Artikel in der Amiga Aktuell stehen wird, der Euch &#252;ber alles informiert. Tja, jetzt habe ich aber leider noch eine traurige Nachricht: Auf meine Frage hin, ob das bestehende AmigaOS weiterentwickelt w&#252;rde, antwortet McEwen mit einem klaren Nein und begr&#252;ndet dies darin, da&#223; es recht schwierig und langatmig w&#228;re, da&#223; OS auf PPC zu portieren. Offenbar hat er sich da schon mit den urspr&#252;nglichen Entwicklern zusammengesetzt und auch diese meinten, da&#223; es 

18-24 Monate f&#252;r eine halbwegs vern&#252;nftige Portierung in Anspruch nehmen w&#252;rde. Schade...</P>
<p><center><img src="km4.jpg"></Center></P>
<p>So langsam musste ich mir auch Gedanken &#252;ber den Heimweg machen und so ging`s mit dem Bus zur&#252;ck zum Bahnhof in Neuss. Auf der Fahrt traf ich zuf&#228;llig einen weiteren Amiga User und wir stellten fest, da&#223; wir zuf&#228;llig in die selbe Richtung mussten und verbrachten einen Teil der R&#252;ckfahrt noch zusammen. Er hatte allerdings noch einen etwas weiteren Weg als ich vor sich; als ich dann am Bochumer HBF ankam, hatte ich die Messe innerlich schon abgehakt. Auf der Fahrt nach Herne traf ich dann noch einen Amiga User und auch wir unterhielten uns noch nett, aber dann war ich endlich wieder zu Hause und ich musste mich ziemlich beeilen, da eine Stunde sp&#228;ter noch eine Geburtstagsfeier von einem Kollegen auf dem Programm stand.</P>

<p>Insgesamt war ich mit der Messe sehr zufrieden und wie ich aus mehreren Gespr&#228;chen mit diversen Amiga Usern wei&#223;, waren auch diese zufrieden mit dem Verlauf der Messe - auf jeden Fall besser als die K&#246;lner Messe (die ich noch nicht mal sooooo schlimm fand, wie einige behaupteten). Und auch bei den H&#228;ndlern wurde flei&#223;ig eingekauft und ich gehe einfach mal davon aus, da&#223; auch diese mit dem Verlauf der Messe zufrieden waren. F&#252;r ein angeblich totes Computersystem ist der Amiga noch ziemlich lebendig und ich habe den starken Verdacht, da&#223; es mit dem Amiga steil aufw&#228;rts geht. Warten wir mal die n&#228;chsten Monate ab, aber ich schlie&#223;e einfach mal den Bericht mit den Worten, da&#223; ich lange nicht mehr so optimistich war, was die Zukunft des Amigas angeht. </P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
