<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Vakiot</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P o s t i</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kirjeit&auml; toimitukselle</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				On se hyv&auml;, ett&auml; Amiga viel&auml; el&auml;&auml; ja voi suhteellisen hyvin. Itsell&auml;ni se oli ensimm&auml;inen kone ja ehk&auml; my&ouml;s rakkainkin, ja on s&auml;&auml;li luopua siit&auml;. Toivotan toiminnallenne ja hyvin toimitetulle lehdelle hyv&auml;&auml; joulua ja onnellista Uutta Vuosituhatta.<br>
				<br>
				<font size="2">Klasu L</font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Minulla on muuten toimiva Amiga 500, mutta monitori puuttuu. Mist&auml;h&auml;n saisin sellaisen k&auml;ytettyn&auml; edullisesti?<br>
				<br>
				<font size="2">Rolle</font><br>
				<br>
				<hr noshadow>
				Vastaus:<br>
				<br>
				Amigaan sopivia ns. videomonitoreja ei en&auml;&auml; uutena saa mist&auml;&auml;n, joten k&auml;ytetty on tosiaan ainoa vaihtoehto. Yleisimpi&auml; malleja ovat esim. Philips CM 8833, 8833-II, Commodore 1084 ja 1084S, mutta muitakin on vuosien saatossa ollut. N&auml;iss&auml; on yleens&auml; sis&auml;&auml;nrakennetut kaiuttimet.<br>
				<br>
				Vanhoista multisync-monitoreista esim. Nec 3D pystyy n&auml;ytt&auml;m&auml;&auml;n A500:n n&auml;ytt&ouml;tilat. Uudempia malleja ovat MicroVitec 1438 ja Amiga 1438, jotka ovat k&auml;yt&auml;nn&ouml;ss&auml; sama malli. Kaikissa multisynceiss&auml; ei ole kaiuttimia, ja kannattaa my&ouml;s varmistua siit&auml;, ettei kyseess&auml; ole mik&auml;&auml;n PC-maailman "multisync", sill&auml; ne eiv&auml;t yleens&auml; videotiloihin kykene. Multisyncit ovat my&ouml;s kalliimpia kuin tavalliset videomonitorit.<br>
				<br>
				Hyv&auml; paikka monitorien etsiskelyyn on esim. Keltainen P&ouml;rssi, joka ilmestyy sek&auml; sanomalehtimuotoisena ett&auml; <a href="http://www.keltainenporssi.fi">verkkojulkaisuna</a>. Uutisryhmi&auml; sfnet.tori.myydaan.atk ja sfnet.atk.amiga kannattaa my&ouml;s seurata, ja onpa Sakutorillakin niit&auml; joskus ollut myynniss&auml;.<br>
				<br>
				Mik&auml;li monitoria ei tunnu l&ouml;ytyv&auml;n, on olemassa toinenkin vaihtoehto: TV-modulaattori. N&auml;it&auml; on myynniss&auml; silloin t&auml;ll&ouml;in ja usein my&ouml;s halvalla. Modulaattorin avulla A500:n voi kytke&auml; suoraan television antenniliit&auml;nt&auml;&auml;n.<br>
				<br>
				<font size="2">Anu Seilonen</font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				AmigaOS 3.5:n odotus on viimeinkin p&auml;&auml;ttynyt, mutta sen kanssa on ilmennyt muutamia ongelmia:<br>
				<br>
				<ol>
					<li>AWeb II SE -selaimen painikegrafiikat ovat yht&auml; sotkua.</li>
					<li>Boing Bag 1 -korjauspaketin lis&auml;&auml;m&auml;t animoidut ikonit eiv&auml;t toimi.</li>
				</ol>
				<br>
				Mik&auml; avuksi?<br>
				<br>
				<font size="2">"3.5 tabua buranaa?"</font><br>
				<hr noshadow>
				Vastaus:<br>
				<br>
				<ol>
					<li>T&auml;m&auml; ongelma toistuu tiett&auml;v&auml;sti vain AGA-ruuduilla. Pulman voi ratkaista varsin tyydytt&auml;v&auml;sti asettamalla AWebin hakemistosta Storage/Buttons/AWeb-tiedoston ikonin tooltypeist&auml; kohdan TRANSPARENT sulkuihin (p&auml;&auml;set tooltypeihin k&auml;siksi Workbenchin Information-toiminnolla). T&auml;m&auml;n j&auml;lkeen aja AWebin hakemistossa oleva Install_Buttons ja valitse "Storage/Buttons/AWeb" tiedostovalitsimesta.</li>
					<li>Varmista ett&auml; k&auml;yt&auml;t AmigaOS 3.5:n omaa GIF-datatype&auml; ja ettei j&auml;rjestelm&auml;ss&auml;si ole gifanim.datatype&auml;.</li>
				</ol>
				<br>
				<font size="2">Janne Sir&eacute;n</font>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Saku pyrkii asiantuntijoiden avulla selvitt&auml;m&auml;&auml;n ongelmasi ja vastaamaan palautteeseesi Posti-palstan kautta. Voit l&auml;hetell&auml; mielipiteit&auml; ja kysymyksi&auml;si seuraavaan osoitteeseen postitse.<br>
				<br>
				Saku<br>
				c/o Anu Seilonen<br>
				Sammaltie 51<br>
				90650 Oulu<br>
				<br>
				Internet: <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
				Sakunet: 65:10/6.0 (Anu Seilonen)<br>
				BBS: Amiga Zone, (015) 348 968 (24h)
			</td></tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

