<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses6.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

5. Haage &amp; Partner-News

Und hier wieder die neuesten Meldungen des Unternehmens:

&raquo;05-Okt-98: Ank&uuml;ndigung - Warp3D

Warp3D ist ein neues hardware-unabhaengiges 3D-Treiber-System f&uuml;r
3D-Grafikkarten.


07-Okt-98: Ank&uuml;ndigung - AmigaWriter 1.1

Aus Termingr&uuml;nden wird der Patch auf die Version 1.04 nicht erscheinen,
sondern gleich der auf die Version 1.1. Hier wurden schon neue Funktionen
implementiert.

Weitere Details und den Patch gibt es in den n&auml;chsten Tagen an dieser 
Stelle.


09-Okt-98: Zwei neue Amiga Magazine

Es ist unglaublich, aber zur Computer 98 wollen gleich zwei neue
Amiga-Magazine ihre Erstausgabe pr&auml;sentieren. Wir sind sehr gespannt
darauf.


09-Okt-98: Mailinglisten wieder in Betrieb

Leider mu&szlig;te auf unserem Mailserver ein SPAM-Filter aktiviert werden, um
die Nutzung f&uuml;r Unbefugte zu unterbinden. Seit Freitag, dem 1. Oktober sind
dadurch die Mailinglisten nicht mehr aktiv.

Ab heute sind die Mailinglisten wieder in Betrieb. Mails, die in der Zeit
vom 1.-9. Oktober an die Listen geschickt wurden, sind dort nicht
angekommen und sollten nochmals geschickt werden. 

Wir bitten diese Unbequemlichkeit zu entschuldigen.


12-Okt-98: STFax Professional v3.5 Update

Die neue Version bietet FastMemory-Support beim Ansehen von Faxen und zudem
noch einige kleinere Verbesserungen.


12-Okt-98: Aktualisierte Support-Seiten

An diesem Wochenende haben wir fast alle Support-Seiten &uuml;berarbeitet um sie
leichter zug&auml;nglich zu machen. Support. Wir hoffen es gef&auml;llt. F&uuml;r
Vorschl&auml;ge und Kommentare schickt mir bitte eine E-Mail: Webmaster


13-Okt-98: Offizielle AmigaOS 3.5-Homepage

Endlich gibt es die offizielle AmigaOS 3.5-Homepage von Amiga Inc. Hier
findet man die ersten Featurelisten.


16-Okt-98: Deutscher Katalog f&uuml;r STFax

Die deutsche &Uuml;bersetzung der Anleitung und der Programmtexte von STFax 3.5
k&ouml;nnen jetzt im Supportbereich angefordert werden.


16-Okt-98: PPC-News

Die PPC World-Seiten bringen einige Neuigkeiten &uuml;ber laufende Projekte. Ein
komplett neuer PPC-Bereich ist in Arbeit und wird in K&uuml;rze ver&ouml;ffentlicht.


20-Okt-98: Deutsche Version der OS 3.5-Seiten

Der Amiga-Club bietet unter anderem die deutsche &Uuml;bersetzung der
offiziellen Seiten &uuml;ber AmigaOS 3.5 an.


20-Okt-98: DAUG gegr&uuml;ndet

Seit letzten Freitag ist die Homepage der DAUG - Deutsche Amiga User Group
online. Diese Organisation soll alle deutschen User-Gruppen zusammenf&uuml;hren
und damit deren Durchsetzungskraft erh&ouml;hen.


20-Okt-98: NetConnect v2.1 Service-Release

Das erste Service-Paket f&uuml;r NetConnect v2 enth&auml;lt Updates der Module:
Genesis, Microdot-II, X-Arc, AmIRC und Contact Manager. 


20-Okt-98: AmigaWriter 1.1

Die Version 1.1 ist das erste Service-Release von AmigaWriter. Viele
Kundenw&uuml;nsche und Kundenprobleme wurden aufgegriffen und bearbeitet:
verbessertes Drucken; Fontersetzungstabelle; Multi-Assigns f&uuml;r
Fontverzeichnisse; Bubble-Help Kontrolle, vollst&auml;ndige Lokalisierung;
verbesserte Anbindung des StormScreenManagers.


25-Okt-98: X-DVE 3.50 f&uuml;r PPC

Die neue Version unterst&uuml;tzt PowerPC/WarpOS, RTG, V-Lab Motion und DraCO
Videosysteme.


25-Okt-98: Die neue PPC World

Der neue PPC World-Bereich ist nun fertig. Er bietet Neuigkeiten, Hard- und
Software-Infos, Spielenews und Informationen rund um den PowerPC. Vielen
Dank an Benjamin Dauhrer f&uuml;r die Betreuung dieser Seiten.&laquo;

(Quelle: Haage &amp; Partner)

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses6.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
