<html>
<head>
  <title>Vorwort</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Vorwort
-------

Willkommen zur neuen Ausgabe von AMIGA aktuell.

Im Monat Eins vor der Computer '98 hat sich recht viel ereignet, Positives 
wie auch Negatives. Angefangen von der Bekanntmachung der AMIGA-OS-3.5-
Entwicklung bis hin zur offiziellen Einweihung des DAUG. Mehr zu all dem 
findet ihr in der vorliegenden Ausgabe von AMIGA aktuell.

Das Negative bezieht sich vor allem auf AMIGA aktuell bzw. AMIGA AGPJ. 
Leider kann Jens Schr&ouml;der sich aus zeitlichen Gr&uuml;nden nicht mehr um den 
Spieleteil in AMIGA aktuell k&uuml;mmern. An dessen Stelle findet ihr in dieser 
Ausgabe die Abschiedworte unseres scheidenden Redakteurs.

Ich pers&ouml;nlich w&uuml;nsche Jens, sicher auch im Namen aller AMIGA-aktuell-
Mitarbeiter und -Leser, alles Gute f&uuml;r die Zukunft, auch wenn wir weiterhin 
in Kontakt bleiben werden. Du hast eine tolle Arbeit geleistet!

Leider bringt Jens' Ausscheiden ein gro&szlig;es Problem mit sich: Da auch ich 
nicht die Zeit habe, mich zus&auml;tzlich noch um ein so umfangreiches Gebiet 
wie den Spielebereich zu k&uuml;mmern, sehe ich nur den Weg, diesen an einen von 
euch abzutreten. Wer also Zeit und Interesse hat, melde sich bitte bei mir: 
<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>

--

Anderes Thema: Dringend suchen wir einen Tester f&uuml;r das kommerzielle 
Grafikprogramm Wildfire7, das uns leihweise zur Verf&uuml;gung gestellt wird. 
Andreas Kuessner vom Wildfire-Team stellt an den Tester folgende 
Anforderungen:

&raquo;1. Der Tester muss entsprechende Hardware haben, als empfohlene
Anforderungen werden wir offiziell angeben:

68060 oder PPC
16 MB oder mehr RAM.

2. Der Tester muss entsprechende Kenntnisse auf dem Gebiet 2D/3D haben,
WF7 ist zwar nicht mehr schwer zu bedienene, aber die richtig guten
Funktionen gehen sonst unter.

3. Der Tester muss sich mindestens 2 Wochen Zeit f&uuml;r den Test nehmen.&laquo;

Wer Interesse hat, wende sich bitte an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>

--

An der Umfrage in der letzten AMIGA-aktuell-Ausgabe haben sich bislang etwa 
75 Leser beteiligt. Wir werden die interessantesten Fragen auswerten und 
die Ergebnisse nach und nach in AMIGA aktuell ver&ouml;ffentlichen.

--

In der letzten Zeit h&auml;ufen sich AMIGA-aktuell-Anforderungen per Post und 
Anfragen nach Abos per Post. Als neuen Service bieten wir deshalb ab sofort 
auch dies an. Mehr dazu unter 'Distribution' im 'Intern'-Teil.

--

Zu den regelm&auml;&szlig;igen Aufrufen:

* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller            
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <a href="mailto:aakt@gmx.de">aakt@gmx.de</a> .

* Immer wieder erreichen uns Anfragen aus dem Ausland, ob es denn keine     
  englischsprachige Version von AMIGA aktuell gibt. Wie ihr wohl wisst,     
  lautet die Antwort &quot;Nein&quot;. Aber das k&ouml;nnte sich m&ouml;glicherweise bald       
  &auml;ndern, und zwar f&uuml;r den Fall, dass sich jemand findet, der als ein       
  Hauptverantwortlicher f&uuml;r &quot;AMIGA aktuell International&quot; zu unserem        
  Redaktionsteam sto&szlig;en m&ouml;chte.
  Die Hauptaufgabe best&uuml;nde im &Uuml;bersetzen der deutschen Ausgabe ins         
  Englische, das allein reichte aber nicht: Ebenso notwendig w&auml;re es,       
  Beitr&auml;ge, die allein f&uuml;r den deutschsprachigen Raum interessant sind, zu  
  entfernen, und daf&uuml;r Meldungen, die andere L&auml;nder betreffen, zu           
  integrieren.
  Wir suchen also jemanden, der &uuml;ber gute Englisch-Kenntnisse verf&uuml;gt und   
  einen ebenso guten &Uuml;berblick &uuml;ber das Internet (insbesondere bezogen auf  
  Websites in Gro&szlig;britannien, den USA und Australien) hat. Schreibt an:     
  <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Viel Spa&szlig; jetzt bei dieser Ausgabe,

Euer

Carsten Schr&ouml;der

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="main.html"><img src="prev.gif" alt="PREV" border=0></a><a href="intern1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
