<html>
<head>
  <title>Workshops</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum8.html"><img src="prev.gif" alt="PREV" border=0></a><a href="workshops2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Erfahrungsbericht: Anschluss von Flachbett-Scannern (von Axel Teichmann)

&raquo;Flachbett Scanner Anschlu&szlig; am AMIGA - Fremde Welten prallen aufeinander
Ein ereigniswerk von A.Teichmann

Mein alter Scanner (Artec 6000c) hat sich mittlerweile durch eine 
&Uuml;berspannung der Stadtwerke Hannover verabschiedet, also mu&szlig; ein neuer
Scanner her. 

Bevor man sich ein neuen Scanner f&uuml;r den Amiga zulegt, sollte man sich sehr
genau erkundigen was sich am Amiga &uuml;berhaupt anschlie&szlig;en l&auml;sst, und wof&uuml;r 
es Treiber gibt. F&uuml;r Windows Kompatible &amp; Macintosh Systeme liegt meist
Software bei den Scannerpaketen bei, meist sehr umfangreich, was man von
der verf&uuml;gbarkeit von Amiga Treibern nicht behaupten kann. Wer &uuml;ber genug
Speicher verf&uuml;gt, kann notfalls ja noch &uuml;ber den Shapeshifter den Scanner
in Betrieb nehmen, was aber f&uuml;r besitzer von etwas weniger Speicher (16 MB)
nicht in Frage kommt.

Leider war Ich von der ARTEC L&ouml;sung (Scantools) nicht sehr &uuml;berzeugt
gewesen, so das f&uuml;r mich ein Scanner dieser Firma generell nicht zur
Debatte stand. (Abst&uuml;rze, inkompatible Software, kein Support ;Das ist zwar
2 Jahre her, aber Ich bin sehr Nachtragend !).

Als aller erstes wurde das komplette Aminet nach verf&uuml;gbarer Scansoftware
durchforstet, um erst einmal festzustellen ,welche Scanner man am Amiga
&uuml;berhaupt betreiben kann, und was f&uuml;r einschr&auml;nkungen es gibt.
Desweiteren hab Ich das WWW &quot;Welt weite Warten&quot; auch nach Tips &amp; Tricks
gesucht, die andere evtl.schon mit diesem brisanten Thema hatten.  
Gefunden hatte Ich nach einigen Stunden intensiven Surfens folgende
Programme: (Alle im Aminet erh&auml;ltlich)

* SCANTEK 4.2 (Shareware) 40 DM
    &copy; Copyright 1995/96/97/98 Waldemar Z&ouml;hner
    email: <a href="mailto:scantek@gmx.de">scantek@gmx.de</a>, <a href="mailto:wzoehner@gmx.de">wzoehner@gmx.de</a> oder <a href="mailto:wzoehner@odn.de">wzoehner@odn.de</a>
    <a href="http://www.users.odn.de/~odn05111/scantek.html">http://www.users.odn.de/~odn05111/scantek.html</a>

    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        MICROTEK IISP, MICROTEK II, HIGHSCREEN Flatbed Color IIs,
        ScanMaker E3, ScanMaker 35t, ScanMaker E6,
        Highscreen PerfectScan, alter Highscreen HighScan
        Microtek E3PLUS, v300, 330, 630 und neue Highscreen HighScan
        MUSTEK Paragon 6000CX, 8000CX (ungepr&uuml;ft), 12000CX 
        MUSTEK Paragon 6000SP, 8000SP, 12000SP
        MUSTEK Paragon 6000CZ, 8000CZ (ungepr&uuml;ft)
        MUSTEK Paragon 600IISP, 800IISP
        Microtek ScanMaker 636, 336 und x6
    Nachteil: Es gibt noch keine Loader f&uuml;r PPaintAdpro &amp; Co
    Vorteil : Alle Scannertreiber sind mit drin, und brauchen nicht Extra
              dazugekauft werden. Das Programm wird St&auml;ndig                 
              weiterentwickelt. 

* SCANCENTER 1.2 (Shareware) 49 DM
    (c) Copyright &copy; Uwe Konrad 1994-1996
    
    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        Alle HP Scanner bis zum Modell HP IVc


* ARTECSCAN 1.0 (Shareware) 40 DM
    (C) Copyright 01.03.1998 by Stefan Robl

    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        Artec Viewstation A6000C Plus
        Artec Viewstation AT3

* BETASCAN (Freeware)
    (C) &quot;&copy; 1998 Svend Daugaard Pedersen&quot;
     
    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        Microtek ScanMakerE3
        Microtek Phantom 4800

* CYBERSCAN (Email Ware)
    &copy; by Thomas Weinsberg Februar 1997

    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        MUSTEK MFC-06000CZ,MFC-08000CZ,MFC-12000CZ

* MUIsnapSCAN (Giftware)
    (C) Email: <a href="mailto:stephane.tavenard@wanadoo.fr">stephane.tavenard@wanadoo.fr</a>
    WWW:   <a href="http://perso.wanadoo.fr/stephane.tavenard">http://perso.wanadoo.fr/stephane.tavenard</a>
    IRC:   Tatav

    Folgende Scanner werden lt. Guide unterst&uuml;tzt:
        AGFA SNAPSCAN 310

Dann wurde auf dem komerziellen Sektor weitergeforscht, um rauszufinden,
was sich dort f&uuml;r M&ouml;glichkeiten bieten:

Dort wurde Ich auf der RMB Homepage (<a href="http://www.rbm.de">www.rbm.de</a>) f&uuml;ndig: SCANQUIX das im
gro&szlig;en und ganzen die gleichen Features wie Scantek bot, und auch noch 
weiterentwickelt wird.

* SCANQUIX (Kommerziell) 149 DM
&nbsp;   (C) RMB
 
    Folgende Scanner werden unterst&uuml;tzt:
        Epson GT-4000, GT-5000, GT-6000, GT-6500, GT-8000, GT-8500, 
        GT-9000, GT-9500
        Hewlett Packard ScanJet 2c, 2cx, 3c, 4c, 4p, 5p, 6100C
        Mustek Paragon 600, 600 SP, 600 II SP, 800 SP, 800 II SP, 1200,     
        1200 SP
        Artec ViewStation A6000C (3-Pass), A6000C Plus (Single Pass), AT-3, 
        AT-6, AT-12
    Nachteil von Scanquix: f&uuml;r jeden Scannertyp mu&szlig; eine Software Modul f&uuml;r
        je 149.- DM gekauft werden. F&uuml;r Scanquix 3.x ist die entwicklung
        eingestellt worden, daf&uuml;r gibt es jetzt die Version 4.x 
    Vorteil von Scanquix: Es gibt entsprechende Loader f&uuml;r PPaint, ImageFX, 
        Adpro Art Effect, etc

Desweiteren hab ich in verschiedenen Newsgroups eine Umfrage gestartet, um 
zu erfahren welcher Scannertyp haupts&auml;chlich verwendet wird, und womit es 
die  wenigsten Schwierigkeiten gibt.
Herausgekommen ist folgendes:
Am meisten verwendet wird Scanquix, knapp gefolgt von Scantek.
Als Scanner werden am h&auml;ufigstens die g&uuml;nstigen MUSTEK Modelle verwendet,
knapp gefolgt von den Artec Scanner (In Komplettepaket mit Scanquix), 
Epson, HP.

Wer sich einen neuen Scanner zulegen m&ouml;chte, sollte sich alle in Frage 
kommenden Programme sehr genau ansehen, und auch ohne Scanner austesten. 
Denn von Programm zu Programm ist die Bedienbarkeit &amp; die Stabilit&auml;t SEHR 
unterschiedlich. 
Ausserdem kommt es von Software zu Software drauf an, welche Hardware 
voraussetzungen man so hat. Da Ich das Gl&uuml;ck hatte, die Kommerzielle 
Scanquix Software (3.1) f&uuml;r 20 DM gebraucht zu erwerben, stellte sich dann 
f&uuml;r mich diese Frage nach der richtigen Software ein Gl&uuml;ck nicht mehr. 
H&auml;tte Ich dieses Schn&auml;ppchen nicht machen k&ouml;nnen, w&auml;r Ich wahrscheinlich zu 
Scantek tendiert, da dieses so &auml;hnlich wie Scanquix aufgebaut ist.

Nun hatte Ich noch zus&auml;tzlich das Gl&uuml;ck das mein Bruder einen MUSTEK 
Paragon MFS 6000SP am PC sein eigen nennt, und Ich mir den Scanner zum 
Testen ausleihen konnte. Ich schlo&szlig; den Mustek einfach am SCSI BUS an, 
installierte SCANTEK &amp; Scanquix und nach kurzen einstellungen konnte Ich 
schon Scannen.

Somit hatte ich jetzt eine enorme Auswahl an Scannermodellen die sich am
Amiga anschlie&szlig;en lassen, man mu&szlig; aber SEHR genau auf die
Modellbezeichnungen achten, denn eine MUSTEK Scanexpress 1200 ist kein
MUSTEK Paragon 1200 !!! 

Ich endschied mich f&uuml;r einen Scanner der Mustek Modellreihe und ging in den
Kaufh&auml;usern auf die Suche, wo Ich leider nur Paralellport Scanner fand, die
zwar g&uuml;nstig (99-199 DM) ,aber absolut inkompatibel zum Amiga waren.

Nachdem Ich mir dann f&uuml;r 329 DM bei MC in der Lagen Laube (Hannover) einen 
Mustek Paragon 1200SP zugelegt hatte, und Ihn endlich zuhause angeschlossen 
hatte ereilte mich die ern&uuml;chterung, das der Scanner nicht lief.
Also lies Ich mir die FAQ auf der RBM Homepage zu dem Thema Mustek durch
und erfuhr jetzt leider erst das es von dem Scanner verschiedene Versionen
gab (Wei&szlig;e &amp; Braune Kartons), und das man daf&uuml;r den Scannertreiber mit 
einem speziellen Patch bearbeiten musste. Nachdem Ich diese H&uuml;rde auch 
genommen hatte, funktionierte der Scanner anstandslos am Amiga.

Endlich hatte Ich wieder einen Scanner.

Trauriger weise mu&szlig; man sagen ,das dieser Scanner innerhalb von 3 Tagen
seinen Geist aufgab, und Ich jetzt auf benachrichtigung von MC warte, wann
mein &quot;neuer&quot; Scanner wieder heil ist.&laquo;

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="forum8.html"><img src="prev.gif" alt="PREV" border=0></a><a href="workshops2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
