<html>
<head>
  <title>Workshops</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="workshops1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="tests1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Update: So senkt ihr eure Telekom-Rechnung!

Offenbar vergeht kein Monat ohne irgendeine &Auml;nderung.
Zum 15. Oktober hat die Telefongesellschaft Talkline Call-by-Call und einen 
besonders g&uuml;nstigen Tarif zwischen 21.00 und 9.00 Uhr eingef&uuml;hrt. Dies hat 
deutliche &Auml;nderungen in der Festnetz-Tabelle zur Folge.

Bevor wir aber dazu kommen, noch einige andere Meldungen, die f&uuml;r euch 
interessant sein d&uuml;rften:

* Die Deutsche Telekom plant f&uuml;r die Zukunft drastische Preissenkungen im   
  Ferngespr&auml;chsbereich und einen g&uuml;nstigeren Internet-Tarif. Sobald das     
  Unternehmen Konkretes bekannt gibt, werden wir es in AMIGA aktuell        
  ver&ouml;ffentlichen. 

* Die beiden Funkrufdienste Quix und TelMi werden in K&uuml;rze eingestellt.

* Viele von euch werden von dem Rechtsstreit zwischen der Deutschen Telekom  
  und Mobilcom (von Manfred Krug in der Telekom-Werbung mit &quot;Mogelkom&quot;      
  tituliert) geh&ouml;rt haben. Ausl&ouml;ser ist eine von Mobilcom gestartete        
  Werbekampagne f&uuml;r den eigenen Festnetz-Tarif, die unter anderem           
  Fernsehspots in Telekom-Stil und -Design beinhaltet. Die Telekom hat      
  gegen Mobilcom Strafanzeige erstattet.



Nun aber zu den aktualisierten Tabellen (alle Angaben ohne Gew&auml;hr):

G&uuml;nstigster Anbieter f&uuml;r Verbindungen innerhalb des Festnetzes:

Tag, Uhrzeit      | Bis 50 km Entfernung      |         Ab 50 km Entfernung
===========================================================================
    
Mo-Fr, 05.00-09.00  Talkline (01050), 9 Pfg.       Talkline (01050), 9 Pfg.
Mo-Fr, 09.00-18.00  Arcor (01070), 15 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 18.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Mo-Fr, 21.00-02.00  Arcor (01070), 7,5 Pfg.&sup2;       Talkline (01050), 9 Pfg.
Mo-Fr, 02.00-05.00  Deutsche Telekom, 6 Pfg.       Deutsche Telekom, 6 Pfg.

Sa/So, 05.00-09.00  Talkline (01050), 9 Pfg.       Talkline (01050), 9 Pfg.
Sa/So, 09.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Sa/So, 21.00-05.00  Arcor (01070), 7,5 Pfg.&sup2;       Talkline (01050), 9 Pfg.

&sup1;: Bei Verbindungen von bis zu 6 Minuten Dauer ist auf Grund der       
   Arcor-Verbindungsgeb&uuml;hr (s.u.) Viag Interkom (01090), 12 Pfg.,           
   g&uuml;nstiger.
&sup2;: Bei Verbindungen von bis zu etwa 2 Minuten Dauer ist auf Grund der     
   Arcor-Verbindungsgeb&uuml;hr (s.u.) Talkline (01050), 9 Pfg., g&uuml;nstiger.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 55,9 Pfg.!)


G&uuml;nstigster Anbieter f&uuml;r Verbindungen vom Festnetz in ein Mobilfunknetz:

Tag, Uhrzeit        |            gilt f&uuml;r alle Mobilfunknetze (0161x, 017x)
=========================================================================== 

Mo-Fr, 09.00-18.00                                  Viatel (01079), 73 Pfg.
Mo-Fr, 18.00-09.00                                  Viatel (01079), 36 Pfg.

Sa/So, 00.00-24.00                                  Viatel (01079), 36 Pfg.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 137 Pfg.!)


Die Tabellen sollten im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Gespr&auml;chs- / Onlineminute f&auml;llig          
  werdende Betrag.

* An Feiertagen gilt der Samstag/Sonntag-Tarif.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf <a href="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</a> k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: <a href="http://www.teltarif.de/db/index.html">http://www.teltarif.de/db/index.html</a>


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax und Viag Interkom rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die das Gespr&auml;ch / die Online-Sitzung dauert.

* Dasselbe gilt im Prinzip auch f&uuml;r Arcor, blo&szlig; berechnet das Unternehmen   
  pro Gespr&auml;ch zus&auml;tzlich eine Verbindungsgeb&uuml;hr von 6 Pfg.

* Viatel berechnet bei Gespr&auml;chen bis 30 Sekunden Dauer die gesamten 30     
  Sekunden, danach wird exakt abgerechnet.

* Mobilcom rechnet minuten(un)genau ab, d.h. auch wenn das Gespr&auml;ch nur 5   
  Sekunden dauert, zahlt ihr 19 Pfg.

* Talkline verf&auml;hrt zwischen 21 und 9 Uhr ebenso, ansonsten wird in einem   
  10-Sekunden-Takt abgerechnet.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="workshops1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="tests1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
