
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -AT - Spieleteil</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>genetic species</h1></center>



&quot;Seit dem Anfang des 21. Jahrhunderts nahm die Macht Multi- und
Transnationaler Firmen entscheidend zu.
Am Ende des Jahrhunderts befanden sich die weltweite Sicherheit,
Wirtschaft und Wissenschaft in den H&auml;nden einiger hundert Leute.
Industriekomplexe und Forschungsstationen entstanden im All und auf dem
Mond, wo die Forschung nicht durch Umwelt- oder ethische Aspekte behindert
wurde. Durch den harten Wettbewerb und die Sicherheit der Forschung, wurden
die Angestellten der Firmen durch weitreichende Kontrollmechanismen zu
gr&ouml;&szlig;ter Loyalit&auml;t gezwungen. Der freie Konkurrenzkampf f&uuml;hrte zu Konflikten
zwischen den Firmen, die als lokale Kriege &uuml;berall im Sonnensystem,
einschlie&szlig;lich der Erde, ausgetragen wurden. Das Resultat war, da&szlig; die
restliche Menscheit eine Art Geisel darstellte.
Mit Beginn des 22. Jahrhunderts bildete sich eine geheime Allianz
zwischen den L&auml;ndern, welche die Macht der Firmen brechen wollten. Diese
Allianz wurde unter dem Namen Counter Force Alliance (C.F.A.) bekannt. Ihre
St&auml;rke war aber gegen&uuml;ber der Macht der Firmen nat&uuml;rlich unzul&auml;nglich, und
es konnte nichts erreicht werden, solange diese starke Differenz bestand.
Alles dies ereignete sich im Jahre 2208.
<p>
K&uuml;rzlich wurden die Nepentianischen Forschungslabors am Magnus Krater
von einer unbekannten Macht angegriffen. Untersuchungen deuten auf
Bodengefechte in der N&auml;he der Basis hin, einbezogen sind mindestens drei
Firmen. Nach zwei Tagen schienen die Gefechte abzuebben, aber noch ist
nicht erkennbar, welche Firma als Sieger hervorgehen wird, falls &uuml;berhaupt.
Den Tag hindurch haben wir Milt&auml;rschiffe mit Truppen und Ausr&uuml;stung von der
verbliebenen Mondstation verfolgt, der Cantex Versorgungsstation. Von
unseren Quellen wurden wir informiert, da&szlig; ihr Ziel der Atlas
Bergbau-Asteroid auf der Mondumlaufbahn ist.
<p>
Seit einigen Jahren entwickelten die C.F.A. Prototypen des 'K&ouml;rperwechslers'.
Diese mobile Einheit ist in der Lage, Menschen, Cyborgs und Droide durch
elektronische Implementation zu kontrollieren. Einen dieser Prototypen haben
sie in der Versorgungsstation aktiviert, damit dieser die Lage dort kl&auml;ren
kann.
<p>
Das Ziel:
<p>
Du bist der erste K&ouml;rperwechsler, aktiviert in der Cantex
Versorgungsstation. Als deine Kameras das verzerrte Bild kl&auml;ren,
erschlie&szlig;t sich dir die Umgebung als 3D perspektivische Ansicht.
Der Handlungsverlauf in Genetic Species ist Bilinear, das hei&szlig;t, du
mu&szlig;t erst mehrere Missionen erf&uuml;llen, ehe du in h&ouml;here Level gelangst. Der
Weg zur Bew&auml;ltigung dieser Missionen liegt einzig bei dir. Halte dich an
die Anweisungen und sei stets auf der Hut und verlasse dich auf nichts.&quot;<br>
(gs manaul)
<p>
Soviel zur Geschichte. Leider verzichtete man auf Sprachausgabe (somit 
ist es aber mit 16 Katalogen ausgestattet und ist somit nicht nur f&uuml;r
deutsch oder englisch Sprachige User), so wird die Geschichte erst erz&auml;hlt
via Text und danach bekommt man das Intro zusehen. Das 200 MB gro&szlig;e voll
animierte Demo ist der Wahnsinn, sogar besser als bei Nemac4. Gezeigt wird
der Flug eines Transporters, welcher angegriffen wurde und sich dank einiger
kleiner Jagdflieger retten kann. Also eine richtige sch&ouml;ne Weltraumschlacht
a~la Wing Commander, welche mit dem Anflug und der Landung auf der Cantex
Versorgungsstation endet. Ein toller Einklang in dieses 3d Baller Spiel.
<p>
Nach dem Intro kommt man ins Optionsmenu, indem man Screengr&ouml;&szlig;e, Sounkanal,
Steuerung und vieles mehr einstellen kann. Nach den get&auml;tigten Einstellungen
kann es auch gleich losgehen. Der Screen ist ziemlich dunkel gehalten und
man erkennt Gegner nicht so leicht, bessergesagt nicht so schnell. Mit einem
Monitor hat man da leider keine &Auml;nderungsm&ouml;glichkeit, beim TV braucht man nur
die helligkeit ver&auml;ndern. Nicht lange und schon ist der erste Feind da und 
legt sich mit Dir an, ein paar gezielte Sch&uuml;sse und er war einmal. Das ist
aber nicht alles. Vulcan hat sich hier n&auml;mlich ein paar gute Sachen aus-
gedacht, so kann man nur in verschiedenen (speziellen) K&ouml;rpern T&uuml;ren &ouml;ffnen
und muss somit auch ab und zu die Gegner bet&auml;uben, als sie &quot;sinnlos&quot; ins
Jenseits zubef&ouml;rdern. Insgesamt 13 verschiedene &quot;Gegner&quot; gibt es, z.B.:
Soldaten, Strumtruppen, Wissenschaftler, Arbeiter oder aber auch Piloten.
<p>
Man bekommt es aber auch mit Druiden (vergleichbar mit dem Kampfroboter, den
man in Nemac4 &uuml;bernimmt) zu tun, aber es gibt f&uuml;r alles die richtigen Waffen,
das die Power ab und zu nicht ausreicht ist da leider traurig und so geht
man nicht nur einmal kurz vorm neuen Level Tod.
<p>
Die musikalische Untermalungist Vulcan bzw. Marble Eyes sehr gut gelungen,
neben den normalen klappernden Transporter und Schu&szlig;- Ger&auml;uschen gibt es
30 Minuten Audio Sound zu h&ouml;ren, den man sich teilweise auch ohne Genetic
Species (mit einem normalen CD Player) anh&ouml;ren kann. Der Trend zur Audio
Musik bei Computerspielen setzt sich fort und meist mit Erfolg!
<p>
<center>|<a href="gfx07.htm">Screenshot1</a>|<a href="gfx08.htm">Screenshot1</a>|</center>
<p>
Die Grafik ist sehr gut, schnell und dem Genreentsprechend d&uuml;ster. Die
Animationen der Gegner h&auml;tte zwar etwas ausgereifter sein k&ouml;nnen, aber
man soll ja nicht nur immer meckern. Die Steuerung hapert nicht und mit
den Waffen die man so hat, kann man einiges anfangen. Einsch&uuml;sse sind
leider nicht sichtbar, auch keine Explosionsreste. Zwar kann man Fenster
zerschie&szlig;en (belieben danach nur noch Fensterreste im Rahmen), aber wenn
man einen Radioaktiven &quot;Botich&quot; zur Explosion bringt, sieht man an der Wand
nichts, schade, wenn man so auf Details baut (Qualm nach jedem Einschu&szlig;,
Flammenwellen nach Explosionen), kann ich nicht verstehen wieso man auf das
nicht geachtet hat, denn wenn ich auf eine Wand schie&szlig;e, m&uuml;sste ja logischer-
weise danach auch was zu sehen sein! Auch negativ ist, da&szlig; die Gegner nach
dem Todeschu&szlig; weder nach hinten gedr&uuml;ckt werden (wie bei dem indizierten
PC Game *****), oder sonst irgendwie zucken, sondern einfach nur nach unten
fallen, sieht nicht so toll aus.
<p><table>
<tr><td valign="top">Fazit:</td><td> Genetic Species ist seit langen ein sehr gutes 3d Game. Sicherlich
       sind die genannten Mackel nicht von der hand zuweisen, aber wann
       gab es schonmal ein perfektes Spiel? Es ist aufjedenfall empfehlens-
       wert. Da die CD noch mit anderen Demos und Slideshows bepackt ist,
       bekommt man auch noch einen kleien Einblick in kommende Vulcan Spiele
       und die sehen nichtmal schlecht aus.<br>
       <b><i>-Empfehlenswert- </i></b></td></tr></table>
<table>
<tr><td valign="top"> coming soon:</td><td> in einer der n&auml;chsten Ausgaben gibt es alle Passw&ouml;rter,<br>
                sowie die Codes f&uuml;r unendlich Munition und Leben!<br>
                see you later.... - coming soon!</td></tr></table>
<table>
<tr><td><b>Wertung:</b></td><td> </td></tr>

<tr><td>Gameplay: </td><td>  89 %</td></tr>
<tr><td>Grafik:   </td><td>  87 %</td></tr>
<tr><td>Sound:    </td><td>  93 %</td></tr>
<tr><td>Motivation:</td><td> 91 %</td></tr>

<tr><td>Gesamt:   </td><td>  <b><u>90 %</b></u></td></tr></table>

<table>
<tr><td valign="top">Features:</td><td><ul><li> voll texturierte 3d levels
          <li> viele Waffen zur totalen Zerst&ouml;rung
          <li> 200 MB 3d gerendertes Intro
          <li> 30 Minuten Audio Sound</ul></td></tr></table>
<table>
<tr><td>Voraussetzungen:</td><td> min.: aga, hd, 68020, 8 mb ram, 2x speed cd</td></tr>
<tr><td>                </td><td> max.: cybergfx oder picasso gfx boards, schnellerer
                       cpu, mehr Speicher, schnelleres cd laufwerk</td></tr></table>

Preis: 90,- DM


<p align="right"><em>-mn-</em></p>

Quelle:<br> Vulcan Software Ltd.<br>
        Vulcan House<br>
        72 Queens Road, Buckland, Portsmouth<br>
        Hants PO027NA<br>
        England U.K.

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="games02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh06.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="games04.htm">
</MAP><hr></center>
</body>
</html>

