
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -AT - Spieleteil</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>final odyssey</h1></center>

what is to do?????
<p>
Ihr prim&auml;rer Auftrag ist es, den Minotaurus zu t&ouml;ten. Um diesen Auftrag
zu vollenden, m&uuml;&szlig;en Sie viele kleinere Abenteuer und Auftr&auml;ge bestehen.
Sie m&uuml;&szlig;en einen Weg durch das komplexe Labyrinth finden, R&auml;tsel l&ouml;sen und
die W&auml;chter des Minotaurus besiegen. Ihre zweite Aufgabe ist es, die im
Labyrinth gefangenen M&auml;dchen zu befreien. In den ersten Level m&uuml;&szlig;en Sie
zwei M&auml;dchen retten bevor sich der Ausgang &ouml;ffnet.&quot; (fo maunal)
<p>
Auch bei Final Odyssey hat Vulcan wieder eine Menge in das Intro gesteckt,
jedoch sollte man nicht zuviel erwarten. Es gleicht eher einer animierten
Slideshow, als eine voll-animiertes Intro. Mal kommt ein Text, dann wieder
nur ein Bild mit oder ohne einer kleinen Animation. Da haben wir schon
besseres gesehen. Wer sich mal das ECS Intro ansehen will, brauct nur den
AGA Chip ausschalten und Final Odyssey erkennt automatisch, welcher Rechner
genutzt wird. Im ECS Modus sieht das ganze dann nicht nur etwas lahm (wie
auch bei der AGA Version) aus, sondern grafisch auch noch mehr als schlecht.
<p>
Das soll uns aber jetzt nicht aufhalten. Vor dem Intro kann man &uuml;brignes
noch die Sprache einstellen, da&szlig; sollte ja noch gesagt werden. Das Spiel
geht nach dem Intro eigentlich gleich los, einzigste M&ouml;glickeit ist die,
ein alten Spielstand zu laden, ansonsten gibt es keine Optionen.
<p>
Die Ansicht des Spieles ist von oben, wie man es noch aus Alien Breed
kennt oder aber auch All Terain Racing (zwar ein schlechtes Genrebeispiel
aber ich hoffe ihr wi&szlig;t wie ich es meine!). Die Grafik und das Design
k&ouml;nnen auch wie im Demo sehr &uuml;berzeugen, hierzu k&ouml;nnt Ihr Euch mal folgendes Bild 
anschauen <a href="gfx09.htm">Screen 1</a> !
<p>
Die Steuerung, die nur via Joystick m&ouml;glich ist, hapert ab und zu, was sich
negativ auswirken kann, wenn man vor Feilen oder anderen &quot;Sch&uuml;ssen&quot; weg-
rennt, ansonsten ist sie sehr einfach. Am Bond befinden sich Teleporter,
die in Form von Quadraten mit einem inneren Kreis dargestellt sind. Diese
sind eigentlich die wahren Schl&uuml;ssel zum Erfolg, denn sie entscheiden ob
Du stirbst oder weiterlebst, gehst Du n&auml;mlich mal auf einen falschen Tele-
prter, kann es schnell passieren, da&szlig; Du vor einer Falle landest und aus
eile in diese hineinl&auml;ufst oder das Du nach dem Teleportvorgang sofort von
allen Seiten beschossen wirst.
<p>
In den ersten Abschnitten ist dies aber eher selten, so da&szlig; man unbeschadet
den Teleporter nach lust und Laune nutzen kann. Gegner sind am anfang meist
Feilgeschosse aus der Wand, Feuerb&auml;lle bzw. Blob-artige Feinde, welche diese
Feuerb&auml;lle auf die abfeuern. Die, ich nennen sie mal &quot;Blobs&quot;, Blobs tauchen
einfach vor die auf, ohne das Du sie kommen siehst, jedoch sind sie mit 2-3
genauen Sch&uuml;ssen gleich erledigt - bedenke: die Masse machts, bei einem Blob
geht das noch, bei mehreren wirds ein Weilchen l&auml;nger dauern.
<p>
Um den Test nicht zulang werden zu lassen, gibt es jetzt erstmal wieder ein
Bild: <a href="gfx10.htm">Screen 2</a>. Ab und zu findet der forschende Abenteurer auch Schrift-
rollen, die Informationen jeder Art beinhalten und das Spiel somit leichter
und interessanter machen.
<p>
Fazit:<br> Final Odyssey reiht sich gut in die Vulcan Software Riege ein, jedoch
       bietet es kaum neues, das Gameplay ist veraltet und weniger abwechslungsreich. 
Das Spiel kann grafisch aber sehr &uuml;berzeugen und dadurch
       motivieren, der Sound passt zum Geschehen und ich denke mal, da&szlig; zumindest 
das Antesten des Demos es wert ist und sich ein Kauf nach
       dieser Vorschau auch einen Sinn macht... mhmmm... wer diesen Satz
       verstanden hat, wei&szlig; mehr als ich, also nochmal... was ich sagen wollte, 
wer das Demo gespielt hat, der sollte sich das Original ruhig
       zulegen, das es keine Abstriche gibt und durch die deutschen Bildschirmtexte 
auch die Story gut r&uuml;berkommt. Allen anderen w&uuml;rde ich
       aber ein Anspielen der Demoversion empfehlen. <i><b>- Gut - </b></i>   
<table>
<tr><td>Wertung:</td><td> </td></tr>

<tr><td>Gameplay:</td><td>   83 %</td></tr>
<tr><td>Grafik: </td><td>    87 %</td></tr>
<tr><td>Sound:  </td><td>    84 %</td></tr>
<tr><td>Motivation:</td><td> 86 %<tr><td>

<tr><td>Gesamt: </td><td>    <b>85 %</b></td></tr>
</table>
<p align="right"><em>-mn-</em></p>

Quelle:<br> Hard &amp; Software f&uuml;r Amiga Thomas Ferst<br>
        K&ouml;penicker Stra&szlig;e 11 15537 Gosen<br>
        Tel.: 03362/820097<br>
        Fax.: 03362/882988<br>
        <a href="http://www.ferst.com">http://www.ferst.com</a><br>
        <a href="mailto:ferst@t-online.de">ferst@t-online.de</a><br>
        T-Online: ferst#

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="games01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh06.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="games03.htm">
</MAP><hr></center>
</body>
</html>



