
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -AT - Spieleteil</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>public domain</h1></center>



Sehr geehrte Amiga Times Leser,
<p>
nach langem Gr&uuml;beln gibt es jetzt in jeder Ausgabe einen Public Domain
Teil. Hierbei geht man von drei Gesichtspunkten aus. Diese sind :
<p>
Grafik<br>
Spielespa&szlig;<br>
und<br>
Gameplay<p>

sie ergeben das Endergebnis, welches am Ende aufgef&uuml;hrt wird.
Falls ihr Anregungen, Tips und anderes zum Public Domain Teil habt
z. B. PD die ihr zum Testen vorschlagt, schreibt mir dann unter :
<p>
e-Mail : <a href="mailto:bh@raut.de">bh@raut.de</a>
<p>
oder per Post an :
<p>
S. Ben Hassine<br>
Postfach 1111<br>
57319 Bad Berleburg<br>
Euer Ben<p>


the games.......
<p>
Mensch &Auml;rgere dich nicht !
<p>
Das beliebte Spiel fand ich beim st&ouml;bern auf einer Aminet CD.
Beim ersten hinsehen, merkt man, das das Spiel wohl holl&auml;ndisch
ist, jedoch l&auml;st es sich ganz leicht Bedienen. Die Oberfl&auml;che ist
in 128 Farben gestalltet, und ben&ouml;tigt den AGA Chipsatz. Es k&ouml;nnen
1-4 Spieler gegeneinander oder 1 gegen den Computer alleine spielen.
Wer erstmal die Funktion heraus bekommen hat, wird schnell Spa&szlig; an
diesem Spiel finden.
<pre>
Bezugsquelle : Aminet 24
               game/board/MensErger.lha (275K)
Bewertung : 80%
</pre>

Time Campaign
<p>
Time Campaign ist ein AGA Shoot`em`up Spiel in 3D. Auf dem erstem
Blick erinert es an Gloom Deluxe. Das Spiel ist nur f&uuml;r 2 Spieler
gedacht. Es sieht von der Oberfl&auml;che sehr ansprechend aus und ist
grafisch nicht schlecht. Jedoch wird es auf die Dauer langweilig
und tr&auml;ge. Es ist halt nur ein Spa&szlig; f&uuml;r wenige Stunden !
<pre>
Bezugsquelle : Aminet 24
               game/shoot/timecamp. lha (136K)
Bewertung : 65%
</pre>

Shootist
<p>
Shootist ist ein Shoot`em`up Spiel bei dem es gilt, Indianer,
Sherrifs.... aus den Saloon Fenstern abzuschie&szlig;en. Es gibt drei
schwirichkeitsgerade (easy - normal - hard). Das Spiel sieht auf
dem ersten Hinblick nicht gerade grafisch ansprechend aus, jedoch
ist es vom Gameplay her sehr gut und verspricht f&uuml;r mehrere Stunden
Spa&szlig;. Das Spiel wird in 16 Farben dargestelt und ist auch auf
&auml;ltere Amigas lauff&auml;hich !
<pre>
Bezugsquelle : Aminet 24
               game/shoot/shootist.lha (164K)
Bewertung : 70%
</pre>

Mines
<p>
Mines ist ein Minenratespiel. Es basiert auf der Win 3.11 Spiel Minessweeper
von 1992. Das Spiel l&auml;uft von der Workbech aus. Drei verschiedene
Schwierichkeitsgrade lassen sich einstellen. Der Sinn
des Spieles ist es, auf einem Feld voller Minen, die Minen nicht
anzuklicken. Diese sind durch eine Art von grauen Steinen verdeckt.
Je nach eigenen Vorstellungen, kann man auch seine eigenen
Anzahlen an Minen auf dem Feld angeben. Das Spiel wird dich einige
Zeit lang besch&auml;ftigen k&ouml;nnen, doch auf die dauer wird es uninteressant !
<pre>
Bezugsquelle : Aminet 24
               game/think/Mines_mgsw.lha (60K)
Bewertung : 68%
</pre>

Simple Pack
<p>
Das Spiel ist wie es man schon lie&szlig;t ein simpler Pack Man WB Clone.
Der Sinn des Spieles ist, den Gegnern auszuweichen und die verschiedenen
Sachen einzusammeln (halt wie fr&uuml;here Pac Man Versionen).
Doch im gro&szlig;en und ganzen finde ich das Spiel eigentlich sehr langweilich
und kann nur g&auml;nen.
<pre>
Bezugsquelle : Aminet 24
&#009;&#009;game/wb/simplepac.lha (45K)
Bewertung : 40%
</pre>
XWins
<p>
XWins ist ein Spiel in Form von Vier-Gewinnt (WB). Die Spielfeldbreite
l&auml;st sich beliebig Einstellen. Nach dem Programmstart stelltst du das
Spiel ein und kannst dann je nach belieben gegen Computer oder anderem 
Spieler Spielen. Du kannst mit einer vierer sowie mit einer sechser Reihe
gewinnen. Wie du halt Lust hast ! Das Spiel hat keine Grafische Oberfl&auml;che
ist aber vom Spielspa&szlig; her andauernd ! Der Schwierigkeitsgrad ist einstell-
bar (1 - 5)
<pre>
Bezugsquelle : Amine 24
               game/wb/xwins.lha (33K)
</pre>

<p align="right"><em>-sbh-</em></p>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="games03.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh06.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="games05.htm">
</MAP><hr></center>
</body>
</html>


