
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Leserforum</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>audio cd test`s</h1></center>
<p>
Nachdem uns ein Leser ein paar Audio CD Test`s zugesandt hatte, dacht ich
mir so, dies ist keine schlechte, zumahl sich sowas ja sehr schlecht in
ein Mag einf&uuml;gen l&auml;&szlig;t was als Hauptgenre &quot;Computer&quot; hat, doch ich denke
beim Leserforum ist es gut aufgehoben. Auch Ihr k&ouml;nnt uns solche Tests
zusenden, denn jeder User ist auch Musikfan, oder t&auml;usche ich mich da????
<p>
Blind Guardian: Nightfall in Middle-Earth
<p>
Ja , ja... auch die Krefelder begl&uuml;cken uns in diesem Jahr mit 
einem neuen Release! Und um es gleich vorwegzunehmen: Dieses 
Album ist bombastisch! Wer dachte, da&szlig; eine Steigerung nach 
&quot;Imaginations from the other Side&quot; nicht mehr drin sei, der wird 
durch dieses Album eines besseren belehrt! Schon auf allen 
anderen CDs von Blind Guardian stand, von den Themen her, 
Mythik und Sagen im Vordergrund (&quot;By the Gates of  Moria&quot; , 
&quot;The Hobbit&quot; oder &quot;A Past and Future Secret&quot;). So auch bei deren 
neuer Scheibe &quot;Nightfall in Middle-Earth&quot;! Diesmal geht es um 
eine Story von Tolkien, wobei ich hier aber nicht mehr verraten 
m&ouml;chte! Wer dachte , da&szlig; sich aber nur einige Songs auf dieser 
CD befinden, der irrt gewaltig: Sage und schreibe 22 Tracks sind 
auf dem Album zu finden! Genau die H&auml;lfte davon sind 
(gr&ouml;&szlig;tenteils) gesprochene Intros, die die eigentliche Story in den 
Vordergrund r&uuml;cken! Nun aber zum eigentlich interessanten, der 
Musik: Nightfall in Middle-Earth ist eine konsequente 
Weiterentwicklung von &quot;Imaginations from the Other Side&quot;. Im 
Gegensatz zu den fr&uuml;heren, h&auml;rteren Alben (&quot;Tales from the 
twilight World&quot; ) legte Blind Guardian hier, wie schon von 
&quot;Imaginations from the other Side&quot; bekannt, mehr Wert auf 
Melodien und Ch&ouml;re. Aber keine Angst: Aus den Krefeldern sind 
keine &quot;Weicheier&quot; geworden! Immer noch finden sich in den 
Songs Gitarrensoli, die genau so gut klingen, wie zu &quot;Somewhere 
far beyond&quot; Zeiten! Das Album l&auml;&szlig;t sich ganz einfach als eine 
ausgewogene Mischung aus langsameren Nummern und h&auml;rteren, 
powernden Nummern beschreiben! Und an ein Highlight der CD 
(&quot;Time stands till at the Iron Hill) kommen kaum irgendwelche 
Kompositionen von vorrausgegangenen Alben heran. Auf dieser 
CD findet sich praktisch alles, was bisherige Blind Guardian Alben 
ausmachte: Toller Symphonic Metal, Chorpassagen, die man so 
nirgendswo anders findet, proffessionelles Songwriting und 
atemberaubende Soli! 
<p>
Wertung: 9,5 von 10!
<hr>
Helloween: Better than Raw
<p>
Bei Helloween scheint das Songwritingpotential wohl enorm zu 
sein! Anders l&auml;&szlig;t sich das neue Album, Better than Raw, wohl 
nicht erkl&auml;ren. Erst im Sp&auml;tsommer des letzten Jahres 
ver&ouml;ffentlichten sowohl Lead S&auml;nger Andi Deris, als auch Gitarrist 
Roland Grapow jeweils ein Soloalbum und nun steht das neue 
&quot;regul&auml;re&quot; Helloween Album in den L&auml;den! Schon im Vorfeld 
&uuml;berschlugen sich die positiven Kritiken zu dieser neuen CD. 
Praktisch die gesamte Metal Szene war sich schon im Vorfeld der 
CD einig, da&szlig; Better than Raw eine der besten Metal CDs 1998 
werden w&uuml;rde. Und dem kann ich eigentlich nur zustimmen! 
Schon das Vorg&auml;ngeralbum (&quot;The Time of the Oath&quot;) war relativ 
gut gelungen, wobei damals allerdings vielen &quot;&auml;lteren&quot; Helloween 
Fans das &quot;Keeper....&quot; Feeling fehlte! Mit diesem neuen Album 
kehren Helloween, zumindest teilweise, wieder auf ihren alten Weg 
zur&uuml;ck. Fast alle Songs sind durchweg etwas h&auml;rter bzw. 
aggressiver gehalten, als es bei &quot;The Time of the Oath&quot; der Fall 
war. Dies beweist schon das Opening der CD &quot;Push&quot;! Aber es 
finden sich noch weitere Highlights auf dieser CD, von denen ich 
hier lediglich auf zwei weitere n&auml;her eingehen m&ouml;chte: Zum einen 
w&auml;re da sicherlich die Ballade &quot;Time&quot;, die nat&uuml;rlich von Andi 
Deris komponiert wurde. Wer Songs wie &quot;In the Middle of a 
Heartbeat&quot; oder &quot;Forever and one&quot; mochte, der wird auch &quot;Time&quot; 
m&ouml;gen! Und zum anderen w&auml;re da &quot;Laudate Dominum&quot;. Schon 
der Titel l&auml;&szlig;t es vermuten: Dieser Song ist komplett Lateinisch 
gehalten! Aber auch alle anderen Songs von dieser Scheibe 
k&ouml;nnen ausnahmlos durch  tolle Riffs, gute Melodien und 
spitzenm&auml;&szlig;ige Refrains &uuml;berzeugen, was ja in der Helloween 
Vergangenheit nicht immer so ganz der Fall war (&quot;Chamelion&quot; 
bzw. &quot;Pink Bubles Go Ape&quot;...). Ich kann nur sagen: Fans der 
bisherigen Helloween Alben werden &quot;Better Than Raw&quot; schon 
beim ersten H&ouml;ren in ihr Herz schlie&szlig;en. Allen anderen, die so ein 
bi&szlig;chen auf &quot;Weichsp&uuml;l Metal&quot; stehen, kann ich dieses Album 
auch nur w&auml;rmstens empfehlen. Lediglich Fans von Speed Metal 
sollten lieber vorher mal reingeh&ouml;rt haben und ansonsten sich 
(meinen pers&ouml;nlichen Favoriten) &quot;Iron Savior&quot; (Sideprojekt von 
Piet Sielck, Hansi K&uuml;rsch (Blind Guardian) und Kai Hansen (ex-
Helloween; Gamma Ray)) zulegen!
<p>
Wertung: 9 von 10

<p align="right"><em>-ks-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="lforum02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh07.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr08.htm" target="_top">
</MAP><hr></center>


</body>
</html>


