
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Aktuell</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center>
Haage&amp;Partner und phase 5 werden gemeinsam den Support f&uuml;r den PowerPC
fortsetzen</center>
<p>
18. Mai 1998: In einer gemeinsamen Ank&uuml;ndigung nach der &quot;World of Amiga&quot;-
Messe und als eine Reaktion auf die von Amiga Inc. aufgezeigten Pl&auml;ne betonen Haage&amp;Partner und phase 5 digital products, da&szlig; sie den PowerPC auch
in Zukunft verst&auml;rkt unterst&uuml;tzen werden. Gemeinsam werden beide Hersteller
die Entwickler und die Anwender der PowerPC-Technologie unterst&uuml;tzen und 
damit die Verf&uuml;gbarkeit einer zunehmenden Anzahl leistungsf&auml;higer Programme
garantieren. Durch bereits mehrere tausend im Markt befindliche PowerPC-
Karten und ansteigender Tendenz, bietet der PowerPC bereits heute einen
attraktiven Markt f&uuml;r Entwickler. Diese Tatsache wird durch viele, demn&auml;chst
erscheinende PowerPC-Versionen bekannter Softwarepakete und durch die zunehmende 
Unterst&uuml;tzung von Softwareherstellern belegt, die dies w&auml;hrend der
WoA, direkt nach der Ank&uuml;ndigung von Amiga Inc., zugesagt haben. Haage&amp;
Partner und phase 5 digital products betonen zudem, da&szlig; der Wettkampf ihrer
unterschiedlichen Ans&auml;tze zur PowerPC-Integration und auch die &ouml;ffentlichen
Diskussionen dar&uuml;ber der Vergangenheit angeh&ouml;ren. &quot;Wir werden sicherstellen,
da&szlig; die Anwender der PowerUP-Systeme eine transparente Einbindung ihrer
PowerPC-Software erhalten und wir werden bald eine gro&szlig;e Vielfalt sehr 
leistungsf&auml;higer Anwendungen zeigen k&ouml;nnen.&quot; sagen die Vertreter beider
Firmen. Die weitere Entwicklung der PowerPC-Systemsoftware soll in enger
Zusammenarbeit zwischen den Firmen geschehen; daneben wurde die Zusammenarbeit f&uuml;r die Entwicklung leistungsf&auml;higer, PowerPC-basierender System-
bibliotheken und anderer OS-Erweiterungen diskutiert. In Treffen  des Management von Haage&amp;Partner und phase 5 digital products mit Amiga Inc., die
bereits w&auml;hrend der WoA-Messe in London stattfanden, hat man sich einverstanden erkl&auml;rt, einen neuen Vorschlag f&uuml;r eine Alternative zu dem von Amiga
Inc. geplanten &quot;Amiga Bridge&quot;-System vorzustellen. Diese Alternative ist ein
neues PowerPC-basiertes System, welches das geplante AmigaOS-Upgrade enth&auml;lt
und bereits zum Jahresende zum Verkauf angeboten werden kann. Zus&auml;tzlich zum
Einsatz von Industrie-Standard-Komponenten k&ouml;nnte ein solches System auch
weitere Optionen anbieten, die eine kreative Entwicklung und Erweiterung im
Sinne des Amiga anbieten und sowohl das aktuelle als auch die n&auml;chsten Versionen des AmgiaOS unterst&uuml;tzt. Basierend auf dem PowerPC, kann dieses System
Kontinuit&auml;t und Innovationen f&uuml;r alle Anwender und Entwickler bieten und erlaubt es der Amiga-Gemeinde, auch an aufregenden Entwicklungen wie z.B. Mo-
torola's neuer AltiVec-Technologie teilzunehmen, einer Erweiterung des G4
PowerPCs, der eine atemberaubende Leistung bietet und bereits n&auml;chstes Jahr
verf&uuml;gbar sein wird.<br>
Mit dem Einverst&auml;ndnis und der Unterst&uuml;tzung von Amiga Inc. kann diese Technologie das lange erwartete Wiedererwachen der Amgia-Computer schon in die-
sem Jahr in Gang setzen. Damit w&uuml;rde sehr schnell ein wachsender Markt sehr
leistungsf&auml;higer Systeme entstehen, die der Amiga-Anwender erwerben kann und
f&uuml;r den Entwickler Software und Zus&auml;tze herstellen und verkaufen k&ouml;nnen.
<p> 
Haage&amp;Partner und phase 5 digital products ermutigen auch alle Amiga-Entwickler, die bereits heute an den existierenden Innovationen teilnehmen,
und die Teil eines Amiga-Marktes sein wollen, der Wachstum, Kontinuit&auml;t und
Innovationen schon heute und w&auml;hrend der n&auml;chsten Jahren bietet, sich jetzt
f&uuml;r die Unterst&uuml;tzung des PowerPC als das Herzst&uuml;ck der n&auml;chsten Generation
von Amiga Systemen auszusprechen. Um mehr Informationen zu erhalten, besuchen Sie bitte die Seiten von phase 5 und Haage&amp;Partner.<br>
<i>(Quelle:Haage&amp;Partner WebSite)</i>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="news02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="news04.htm">
</MAP><hr></center>


</body>
</html>


