
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Aktuell</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Maxon verabschiedet sich....</h1></center>

<b>Amiga Statement</b><br>
Offizielle Bekanntmachung<br>
der Firma MAXON Computer GmbH<p>

Liebe Amiga-Fangemeinde,
<p>
hei&szlig;e Diskussionen um die Zukunft des AMIGA haben seit Mitte der neunziger
Jahre die Szene bewegt. Oft war leider nur hei&szlig;e Luft dahinter oder gut
gemeinte, aber schlecht kalkulierte Konzepte.
<p>
Hat sich auch in letzter Zeit wieder ein Silberstreif am Horizont abgezeichnet,
eine moderne Hardware-Basis in die AMIGA-Technik zu implementieren, so zeigt
sich doch die Praxis etwas komplexer als geplant. Die wirtschaftlichen
Erfordernisse des Marktes zwingen in solchen F&auml;llen leider zum Handeln.
<p>
Leider haben wir uns daher dazu durchringen m&uuml;ssen, die AMIGA-Produktpalette
ab sofort einzustellen.
<p>
Auf den letzten Messen konnten wir auf die zahlreichen Fragen nach einer
Portierung von CINEMA 4D f&uuml;r die PowerUP-Plattform immer wieder nur antworten:
&quot;Sobald die entsprechenden Entwicklungswerkzeuge verf&uuml;gbar
sind&quot; - diese gibt es bis heute nicht. F&uuml;r eine derart komplexe Applikation wie
CINEMA 4D ist eine solch hochentwickelte Programmierumgebung aber absolut
notwendig. Ohne objektorientierte Hochsprache wie C++ ist eine sinnvolle
Portierung nicht m&ouml;glich - die existierende Hardware ist bereits mit der
derzeit erh&auml;ltlichen Version 4 ausgereizt.
<p>
Als Firma, die u.a. mit dem AMIGA seit 1986 gro&szlig; geworden ist und die nicht
nur als Software-Anbieter (und Marktf&uuml;hrer im Raytracing-Bereich), sondern
auch als Verleger von Zeitschriften wie &quot;Kickstart&quot; und zahlreichen B&uuml;chern
den AMIGA-Markt mitgepr&auml;gt hat, f&auml;llt eine solche Entscheidung alles andere
als leicht.
<p>
Aber auch die j&uuml;ngsten Ereignisse auf den AMIGA-Events im Mai in London und
Toronto zeigten, da&szlig; in den n&auml;chsten Jahren eine konkrete Besserung der
Situation nicht abzusehen ist. Zu lange wurde mit wichtigen Entscheidungen
gewartet, haben falsche Entscheidungen in Sackgassen gef&uuml;hrt, haben zu viele
Seiten unkoordiniert gehandelt.
<p>
Pl&auml;ne sind gut und sch&ouml;n, doch in einem so schnellebigen Markt, wie der
Computerbranche sind 2 Jahre unendlich lange - zu lange.
<p>
Ein Markt, der nur noch minimale St&uuml;ckzahlen abnimmt, so da&szlig; ein
wirtschaftliches Arbeiten nicht mehr m&ouml;glich ist, bietet einem Unternehmen
mit seiner sozialen Verantwortung den Mitarbeitern und Angestellten gegen&uuml;ber
kein sicheres Einkommen mehr. Der Blick mu&szlig; daher nach vorne gerichtet sein,
und CINEMA 4D hat sich in den letzten Jahren im High-End Bereich eine sichere
Position im weltweiten Markt erk&auml;mpft. Heute z&auml;hlen wir viele gro&szlig;e
Fernsehanstalten und TV-Produktionsfirmen zu unseren Kunden, die Fachwelt
&auml;u&szlig;ert sich begeistert &uuml;ber das Produkt (z.B. Siggraph 1997 &quot;Best
Animation-Tool: CINEMA 4D XL&quot;) und verlangt eine kontinuierliche Entwicklung.
Diesem Markt werden wir auch in Zukunft gerecht werden k&ouml;nnen.
<p>
Als Abschiedsgeschenk bieten wir daher allen treuen AMIGA-Usern die
Vollversion von Cinema 4D V4 Pro auf einer der n&auml;chsten AmigaPlus CD-ROMs an.
<p>
Wir sagen Goodbye und w&uuml;nschen euch weiterhin noch viel Erfolg.
<p>
Eure,
<p>
MAXON Computer GmbH<br>
(Friedrichsdorf, 11.06.1998)
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="news07.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="inhfr02.htm" target="_top">
</MAP><hr></center>


</body>
</html>

