
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>network PC</h1></center>
<p>
Seinen Amiga mit dem PC vernetzen zu k&ouml;nnen w&auml;re eine interessante Sache.
Schade nur, da&szlig; Netzwerkkarten f&uuml;r den Amiga so teuer sind; meist scheiterte es au&szlig;erdem am fehlen einer Busplatine. 
<p>
Mit Network PC geht Weird Science einen Weg, den Programme wie Laplink 
oder Interlink schon lange gehen: Die Verbindung &uuml;ber die parallele Schnittstelle. Zwar kann Network PC auch &uuml;ber die serielle Schnittstelle 
arbeiten, aber die Geschwindigkeit ist dann auch bedeutend niedriger,
allerdings wird so der Druckeranschlu&szlig; des Amiga blockiert; hier w&auml;re 
es w&uuml;nschenswert, &uuml;ber einen speziellen Devicetreiber &uuml;ber einen zweiten
Druckerport am PC drucken zu k&ouml;nnen. Ein passendes Kabel ist im Lieferumfang enthalten.
<p>
Im Lieferumgang befinden sich Installationsdisketten f&uuml;r Amiga und PC
und zus&auml;tzlich eine CD, die neben den beiden Programmen noch viel Software f&uuml;r den 
Amiga und Windows enth&auml;lt. Da auf der CD aber lange Datei- und Verzeichnisnamen zu finden sind, sind viele Bereiche der CD von DOS
aus unzug&auml;nglich.
<p>
Die Installation und Konfiguration auf dem Amiga geschieht mittels eines
gew&ouml;hnlichen Installationsscripts. Das Setup-Programm am PC dagegen ben&ouml;tigt Windows, allerdings lassen sich die ben&ouml;tigten Dateien auch einfach von Hand auf die Platte kopieren und das Konfigurationsprogramm kann
einfach von DOS aus gestartet werden.
<p>
Nach dem Start von MountPC am Amiga und NETPCSRV.EXE am PC stehen die PC-
Laufwerke als Schubladen in dem virtuellen Laufwerk NET-PC: zur Verf&uuml;gung.
Wer Windows 95 benutzt, bekommt auch die langen Dateinamen korrekt zu sehen.
Wer auf seinem PC kein Multitaskingbetriebssystem benutzt, sondern lediglich
ein DOS, dem blockiert der Server den PC, das Programm kann lediglich mit
einem Reset beendet werden. Wer Network PC mit Windows 3.xx verwenden 
m&ouml;chte, sollte es &uuml;ber eine PIF-Datei aufrufen mit der aktivierten Option
Hintergrund, denn sonst mu&szlig; jedesmal, wenn auf den PC zugegriffen werden
soll, der Server erst in den Vordergrund geholt werden.
<p>
Die &Uuml;bertragung einer 1 MB gro&szlig;en Datei braucht vom Amiga auf den PC ca.
33 Sekunden, in die andere Richtung sind es ca. 50.
<p>
Beispielsweise l&auml;&szlig;t sich mit Network PC direkt ein Backup auf die Fest
platte des PCs schreiben, interessant ist sicherlich auch der Zugriff auf
die HD-Floppy oder das CD-Laufwerk des PC, allerdings lassen sich die 
Datentr&auml;ger nicht einfach mounten, h&ouml;chstens &uuml;ber den Umweg des Assign-
Befehls.
<p>
Jedenfalls ist Network PC mit eine Preis von 59 DM eine preiswerte und
einfache Methode, die beiden Ger&auml;te zu vernetzen.<br> 
<center>|<a href="gfx11.htm">Bild 1</a>|<a href="gfx12.htm">Bild 2</a>|<a href="gfx13.htm">Bild 3</a>|</center>

<p align="right"><em>-sts-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw03.htm">
</MAP><hr></center>
</body>
</html>

