
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Software</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>artStudio Professional</h1></center>


ArtStudio -bitte nicht mit Draw Studio verwechseln!- ist eine &quot;Picture
Management Software&quot;. Sicherlich wei&szlig; jetzt jeder etwas damit anzufangen,
doch ich werde Euch noch genau sagen, was ArtStudio ist und alles kann.
Zum n&auml;heren Verst&auml;ndnis sollte ich sagen, da&szlig; ArtStudio vom &quot;Genre&quot; her
die gleiche Software ist, wie Picture Manager von IreeseeSoftware. Jedoch
bietet ArtStudio noch einiges mehr, z.B.: kann man mit diesem Programm
eigene HTML Seiten gestalten, die mit einem eigenen <a href="gfx14.htm">WebDesigner</a> wirklich
leicht ist und durch die -auf der CD enthaltenen Grafiken- die Seiten versch&ouml;nern, 
aber eines bleibt... eigene Grafiken kommen immer besser, als
&quot;geklaute&quot;!
<p>
Der Aufbau von ArtStudio ist sehr ordentlich und &uuml;bersichtlich, heir seht
Ihr mal ein <a href="gfx05.htm">Bild</a> dazu. Die Werkzeugbalken lassen sich je nach
Wunsch verschieben und man kann sich somit seinen Arbeitsplatz richtig einrichten.
<p><ul>
<li> Erm&ouml;glicht das Durchsuchen von Verzeichnissen und von
  ganzen Festplatten bzw. CD-Roms.
<li> Dank Fenstertechnik auf jeder Grafikkarte und in jeder
  Aufl&ouml;sung lauff&auml;hig.
<li> Bildschirmmodus durch Screenmode-Requester frei w&auml;hlbar.
<li> Unterst&uuml;zung von PopUpMen&uuml; und Drag &amp; Drop.
<li> Mehrere Bild&uuml;bersichtsfenster m&ouml;glich.
<li> Automatische Kategorie Erstellung, anhand der Verzeichnisstruktur.
<li> Fenster beliebig verstellbar, dadurch individuelle Einstellungen
  f&uuml;r jeden Katalog m&ouml;glich.
<li> Das Programm unterst&uuml;tzt jetzt &uuml;ber 50 Grafikformate, die
  automatisch erkannt werden, darunter IFF, JPEG, GIF, IFFDEEP, Photo-CD usw.
<li> Vectorformate wie Postscript, WMF, WPG, AMF, DSDR usw.
<li> Animationsformate: Anim5,7,8  FLI, FLC, AVI, MPEG, QUICKTIME
  und viele weitere Exotische Formate wie z.B. &quot;TIM&quot; bekannt von der
  Playstation oder auch FAX, ICON, FONT u.s.w
<li> Direkte ScanQuix Unterst&uuml;tzung.
<li> Zusammenf&uuml;gen von mehreren Katalogen.
<li> Importieren von Picture-Manager Katalogen.
<li> Viele zus&auml;tzliche Werkzeuge zum Konvertieren, Bearbeiten und Anzeigen von
  Bilder.
<li> Anzeigeprogramm f&uuml;r Animationen.
<li> Automatische Erstellung kompletter HTML-Seiten zur Presentation im 
  Internet.
<li> Auslesen von LHA, LZH, und LZX -Archive.
<li> Erstellen von LHA und LZX Archiven.
<li> Bilder k&ouml;nnen in andere Grafikformate konvertiert werden, z.B.
  in JPEG, SunRaster, SGI, IFFDEEP, YUV usw.
<li> &Uuml;ber 40 leistungsstarke Bildbearbeitungsfunktionen,
  wie z.B. MotionBlur, Wirbeln, Sharpen oder Spiegeln sind
  nur ein paar der vielen Bearbeitungsfunktionen.
<li> CyberGFX Unterst&uuml;tzung, Miniaturbilder k&ouml;nnen jetzt auch
  in TrueColor(24Bit) dargestellt werden.
<li> Anzeigen aller Bilder in 16Mio. Farben, auch in einem Fenster auf dem
  ArtStudio Bildschirm m&ouml;glich !
<li> Hervorragende Bildqualit&auml;t der Miniaturbilder, dank
  Bi-Interpolation und Floyd-Steinberg-Dithering.
<li> Optimierte Lade- und Konvertierungsroutinen, die ein wesentlich
  schnelleres Einlesen von Bildern in den Katalog erm&ouml;glichen.
<li> Im 24Bit-Mode k&ouml;nnen die Miniaturbilder auch im JPEG-Format
  gespeichert werden, dadurch sehr geringer Speicherbedarf.
<li> Treiber f&uuml;r ECS, AGA, Retina, Graffiti, Picasso und CyberGFX
  sind vorhanden.
<li> Einbinden externer Viewer f&uuml;r jedes Grafikformat getrennt m&ouml;glich.
<li> Zus&auml;tzliche Tools zum Anzeigen, Konvertieren oder
  Bildbearbeiten &uuml;ber CLI, WB oder von anderen
  Programmen aus.
<li> Erweiterte Suchfunktion.
<li> Funktionen zum Konvertieren, Kopieren oder L&ouml;schen
  der Bilder k&ouml;nnen jetzt automatisiert werden.
<li> Direktes Exportieren der Bilder in z.B. AdPro, ArtEffekt, XiPaint, DPaint5
  u.s.w.
<li> Eine Vielzahl von ARexx-Skripten schon im Lieferumfang vorhanden.
<li> Programm und Anleitung jetzt komplett in Deutsch und Englisch vorhanden.
<li> Erleichterte Handhabung.
<li> Komplett auf CD-ROM!!!
<li> voll Draco kompatibel
<li> verbesserte Einstellungsm&ouml;glichkeiten
<li> Ausdruck von Bildkatalogen auf Drucker oder als Datei
<li> neue Lademodule: jetzt insgesammt 55 Lademodule
<table><tr><td>  AMF   </td><td>  =</td><td> AmigaMetaFile</td></tr>
<tr><td>  AVI    </td><td> =</td><td> Animationsformat</td></tr>
<tr><td>  CGM    </td><td> =</td><td> Vectorformat</td></tr>
<tr><td>  FAX    </td><td> =</td><td> Raw Faxdaten</td></tr>
<tr><td>  FAX_IFF</td><td> =</td><td> FAXdaten im IFF-Format (wird z.B. bei GPFax benutzt)</td></tr>
<tr><td>  FIG   </td><td>  =</td><td> Vectorformat</td></tr>
<tr><td>  FLIC   </td><td> =</td><td> FLI und FLC Animationsformat</td></tr>
<tr><td>  MPEG  </td><td>  =</td><td> MPEG Animationsformat</td></tr>
<tr><td>  POSTSCRIPT</td><td> =</td><td> Adobe Postscript</td></tr>
<tr><td>  RAW_RGB</td><td> =</td><td> ein PlayStation Grafikfromat</td></tr>
<tr><td>  RLE    </td><td> =</td><td> UtahRLE</td></tr>
<tr><td>  TIM   </td><td>  =</td><td> ein PlayStation Grafikformat</td></tr>
<tr><td>  WMF   </td><td>  =</td><td> Vectorformat</td></tr></table>
<li> weitere ARexx-Scripts
<li> und viele weitere kleine Verbesserungen und SpeedUps
<li> Einstellung der externen Anzeigeprogramme f&uuml;r jedes einzelne
  Grafikformat oder f&uuml;r alle Grafikformate m&ouml;glich. Dadurch
  entf&auml;llt die umst&auml;ndliche Einstellung.
<li> LHA/LHZ/LZX Unterst&uuml;tzung. Archive werden automatisch erkannt und
  nach Bildern durchsucht. Nat&uuml;rlich ist auch das Packen
  verschiedener Bilder in ein Archive m&ouml;glich und zwar f&uuml;r
  LHA und LZX. Au&szlig;erdem werden auch Bilder erkannt die in
  Unterverzeichnissen im LHA-LZX gepackt sind bzw. mit
  Leerzeichen versehen sind.
<li> Bei LHA/LZX-Archiven kann im Image Informationsfenster zus&auml;tzlich
  der Inhalt der Archive betrachtet werden.
<li> Importmodule f&uuml;r PictureManager Kataloge, die dann automatisch
  in ArtStudio Kataloge gewandelt werden.
<li> AppIcon auf der WB, dadurch kann bei ge&ouml;ffneten Katalog einfach
  ein beliebiges DiskIcon auf dem AppIcon gelegt werden.
  ArtStudio durchsucht das gew&auml;hlte Verzeichnis bzw. Disk nach
  Bildern durch.
<li> SpeedUpScript, f&uuml;r Geschwindigkeitssteigerungen um bis zu 40%.
  Besonders geeignet f&uuml;r PhotoCD!!
  Zuerst wird das Script gestartet und danach ArtStudio.
<li> viele kleinere Verbesserungen zur einfacheren Bedienung.
<li> externer FLI/FLC Player f&uuml;r CyberGFX
<li> externer AVI-Player f&uuml;r AGA und CyberGFX
<li> externer QUICKTIME-Player f&uuml;r AGA und CyberGFX</ul><p>
<table>
<tr><td valign="top">Fazit:</td><td> ArtStudio ist ein sehr gutes Programm, das schnelle Einlesen von
       Grafiken jeder Art ist von Vorteil, zwar wird dabei keine bzw.
       der DBPalHires Flimmerfrei Screenmode nicht richtig unterst&uuml;tzt,
       aber bei den normalen TV-Amiga Ger&auml;ten trifft das ja sowieso nicht
       zu. Zwar ist der Preis etwas hoch, aber ArtStudio besticht durch
       seine Vielzahl von Funktionen, die dies wieder etwas gut machen.
       Wer professionell Grafiken verwalten will, kommt um ArtStudio eigentlich nicht drumrum, der interne Web-Designer bietet au&szlig;erdem noch die
       M&ouml;glichkeit, schnell und unkompliziert Seiten f&uuml;rs Web zu erstellen.<br>
       <i>- Empfehlenswert - </i></td></tr>

<tr><td valign="top">Hardware:</td><td><table><tr><td> min.:</td><td> 4 MB und 1 MB Chip Ram, HD</td></tr>
        <tr><td>  gut.:</td><td> 8 MB und 2 MB Chip Ram, HD, h&ouml;herere CPU</td></tr>
         <tr><td> max.:</td><td> open end</td></tr></table></td></tr>

<tr><td valign="top">Preis:</td><td> 129,- DM (Updatem&ouml;glichkeit besteht/Preise bei H&auml;ndlern k&ouml;nnen sich
                 unterscheiden!)</td></tr>



<tr><td valign="top">Quelle:</td><td> Hard &amp; Software f&uuml;r Amiga Thomas Ferst<br>
        K&ouml;penicker Stra&szlig;e 11 15537 Gosen<br>
        Tel.: 03362/820097<br>
        Fax.: 03362/882988<br>
        <a href="http://www.ferst.com">http://www.ferst.com</a><br>
        <a href="mailto:ferst@t-online.de">ferst@t-online.de</a><br>
        T-Online: ferst#</td></tr></table>
<p align="right"><em>-mn-</em></p>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh02.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="softw02.htm">
</MAP><hr></center>
</body>
</html>


