
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Story</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

bietet achtet auf den namen &quot;utopia&quot;, den sollte man ernst nehmen,
sonstbekommt man von diesem text vielleicht einen falschen eindruck!
<p>
Utopia 1: Die Revolution
<p>
Ich habe einen Traum:<br>
Ich befinde mich in einer gro&szlig;en Stadt und sehe viele gro&szlig;e, moderne 
Wolkenkratzer. Diese bestehen zum gr&ouml;&szlig;ten Teil aus puren Glas und auf ihnen 
spiegeln sich gro&szlig;e, ja man kann sagen rie&szlig;ige Balls, alle in rot-wei&szlig;en Farben. 
Sie kommen von oben, prallen unten auf und schie&szlig;en wieder in die Luft. Dabei 
wenden sich die Balls zu allen Seiten. Zwischen den Balls sieht man &uuml;berall 
Amiga-Flaggen und Aufrufe. Gigantische Menschenmengen ziehen jubelnd und feiernd 
durch die Stra&szlig;en. Sie singen Lieder und tanzen dazu. &quot;Back for good&quot; schallt es 
von dem einem Platz, &quot;Revolution&quot; steigt aus einer Nebensta&szlig;e zu mir empor. 
Vereinzelt gibt es auch Ges&auml;nge wie &quot;B.G. has gotta die&quot; und andere 
Kampfaufrufe. Die &uuml;berwiegende Masse feiert jedoch friedlich. Die Menschen sind 
einfach gl&uuml;cklich, und schreien ihr Gl&uuml;ck zum Himmel herauf. Es sind gro&szlig;e 
B&uuml;hnen aufgebaut. Auf diesen treten nacheinander bekannte Bands und Stars auf. 
Alle wollen sie bei diesn historischen Augenblick dabei sein: Die Revolution.
<p>
Jetzt schaue ich weiter. Ich suche ein wenig und entdecke ein sehr gro&szlig;es 
Anwesen. Es ist stark bewacht - &uuml;berall kann man Security-Einheiten 
registrieren. In der Mitte des gro&szlig;en Grundst&uuml;cks befindet sich ein Haus, besser 
gesagt ein richtiges Schlo&szlig;. Ich erhasche einen Blick in dieses Schlo&szlig;. Dort 
kann ich einen Mann auf einem Stuhl sitzen sehen. Er sitzt vor einem Computer. 
Auf dem gro&szlig;en Monitor kann man ein gro&szlig;es &quot;Error inside&quot; erkennen. Die Augen 
ge&ouml;ffnet, doch kein Lebenszeichen ist zu erkennen. Er sitzt einfach reglos da 
und starrt auf den Bildschirm. Er ist tot. In seiner Hand h&auml;lt er einen 
Revolver, mit dem er sich eben anscheinen in den Kopf geschossen hat. Oh Gott, 
er hat sich selber get&ouml;tet. Gerade kommt ein Wagen zu dem Anwesen. Es steigen 
viele Menschen aus und diese beginnen nun mit dem Abtransport jeglicher 
Wertsachen aus dem ehemals so bl&uuml;henden Haus. Die Leute nehmen mit, was sie 
finden k&ouml;nnen, um den Mann k&uuml;mmert sich niemand...
<p>
<i>-Jack Miller- </i>


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inh09.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh09.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="story02.htm">
</MAP><hr></center>
</body>
</html>


