<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 - Fun &amp; Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>Ein Hauch mehr Sarkasmus f&uuml;r diese Welt!</h1></center>

<p>
In letzter Zeit sitze ich des &ouml;fteren vor meinem Computer   und
&uuml;berlege, welches Games ich doch wiedermal spielen k&ouml;nnte. Doch
ich habe einfach zu nichts mehr lust, woran liegt das? Wenn ich
dann mal in ein Mag schaue und mir eventuell ein Spiel  bestellen will, 
finde ich meist nur alte Spiele vor,   die einerseits
&uuml;berteuert angeboten werden, und andererseits kaum noch   einen
Reiz besitzen. Woran liegt  das?  Kann  es  sein, da&szlig; der AMIGA
nicht nur    einem allgemeinem Softwaremangel erleidet, sondern
auch noch ein ganzer Hauch an Kreativit&auml;t fehlt?  Wer  hat denn
schon Lust auf den X-ten Doom Clone, oder auf irgendein sinnloses Renngame. 
Was uns fehlt ist mal  wieder  ein  erfrischendes
Game, was auch zum Kauf anreizt,  aber  in  letzter Zeit sollte
man froh sein, wenn man &uuml;berhaupt mal ein neues Game in  H&auml;nden
halten kann. Das auch nur weil ein  paar  f&auml;hige  Programmierer
desintressiert sind und wenn, dann nur billige Qualit&auml;t auf den
Markt schmei&szlig;en, um diesen etwas &uuml;ber Wasser zu halten.        
<p>
Ich wei&szlig; auch das wir uns in einer prek&auml;ren Lage befinden, aber
deshalb kann man doch noch etwas Qualit&auml;t verlangen,dazu  kommt
noch das nutzlose Vertrauen in Firmen, die mehr sagen als  tun.
Ich hoffe nur,da&szlig; man sich da kein Beispiel am Bundestag nimmt,
denn wir k&ouml;nnen keine 3-4 Jahre warten, bis irgendwelche  Pl&auml;ne
zur Umsetzung da sind, und dann nochmal circa 1-2 Jahre vergeh-
en, bis man es realisiert hat.                                 
<p>
&Uuml;brigens, mal ein kleiner Tip, wer mal Lachen will, sollte kein
Witzbuch kaufen, sondern die Preisliste von phase5 lesen,  dort
stehen einige der besten Witze der letzten Zeit drin,      also
spart nicht an der falschen Stelle und wenn Ihr Euch totgelacht
habt und Euch nach ein paar Minuten   der  ernst der Lage  klar
wird, so wartet nicht und werft ihnen Geld in den Rachen,  welches 
sie wirklich brauchen, um noch mehr &uuml;berteuerte Ware anzubieten.                                                        
<p>
So appeliere ich an alle Firmen, doch vern&uuml;nftig zu werden  und
mit Optimismus, Vertrauen und Hoffnung (ein Wort was jeder Amiganer 
sicherlich schon im Schlaf aussprechen kann) in den Markt
einsteigen, ihn f&ouml;rdern und mit respektablen  Preisen  erobern,
wie es einst getan wurde.Nur durch Sie ist ein starkes Comeback
m&ouml;glich, welches Sie aber nicht gerade &uuml;nterst&uuml;tzen,  wenn  Sie
immer mehr Support, Updates, neue Versionen oder komplett  neue
Software einstellen und sich klammheimlich vom AMIGA  verabschieden. 
Ich glaube viele von Ihnen haben vergessen,welcher Rech-
ner Sie damals hochgebracht hat und das war in den meisten F&auml;llen 
nicht der PC, sondern unsere Freundin - der AMIGA!         
<p aling="right"><em>-mn-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk03.htm">
</MAP><hr></center>


</body>
</html>



