
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Fun &amp; Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center>
<h1>Hat der Amiga eine Zukunft</h1>
<b>- p a r t -  t w o -</b>
</center>
<p>
Es scheint wohl so zu sein - die Balken f&uuml;r die Zukunft sind endlich in
den Weg gerollt worden. Au&szlig;erdem scheint es so, da&szlig; es immer mehr Firmen
gibt, die f&uuml;r den Amiga wieder interesse zeigen. Doch leider ist dies
nicht genug ! Die Amiga Gemeinde mu&szlig; jetzt in den n&auml;chsten Monaten zusammen 
halten und warten was sich ergibt. Eine positive Sache ist es,
das Amiga Inc. die Entwicklungspl&auml;ne herausgegeben hat. Ob das neue OS
(3.5 oder 4.0) etwas neues bringt ist eine andere Sache. Doch ich bin
jetzt schon davon &uuml;berzeugt, da&szlig; der Amiga wieder Marktanteile gewinnt.
Die neue Planung von Phase 5 mit der prebox ist schon mal ein weiterer
Schritt nach vorn. Viele User haben auf so ein System gewartet, doch
leider sind die Preise teils zu hoch bzw. unvorstellbar. Die Preise 
sollten sich an die PCs richten, was jedoch nicht den Anschein hat. 
Hoffentlich werden die Preise um einige Hunderte Mark gesenkt, sonst
lohnt es sich nicht einen Rechner f&uuml;r knapp 5000-9000 DM DM zu kaufen,
wenn es nicht entsprechend Software geben w&uuml;rde. Dazu ben&ouml;tigen wir 
dringend Hilfe von Softwarfirmen wie z. B. EA oder Blue Byte. Eine 
positive Reaktion w&auml;re es, wenn sich die Amiga User bei den Firmen
melden (durch Emails, Briefe und Telefongespr&auml;che). Amiga International
President Petro Tyschtschenko tut alles daran Firmen zum Amiga zur&uuml;ck
zu holen. Wohl auch mit Erfolg. Seitens der Amiga User r&uuml;hrt sich auch
einiges - z. B. der Shareware-Bereich ist deutig gr&ouml;&szlig;er geworden als
vor wenigen Monaten. Der Softwaremarkt ist auch bisher ziemlich d&uuml;nn
- doch besser als 1996 ! Ich hoffe, da&szlig; man als Amiga User wieder Stolz
sein kann, auf seinen Rechner. Mal sehen was in der n&auml;chsten Zeit geschiet. Bis dahin w&uuml;rde ich sagen nur etwas Gedult. Das ganze braucht
seine Zeit.
<p>
Dieser Bericht wird sp&auml;ter fortgesetzt !

<p align="right"><em>-sbh-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk02.htm">
</MAP><hr></center>


</body>
</html>

