
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Fun &amp; Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>Was soll das ganze noch ?!?</h1></center>

Diese Frage hat sich bestimmt der eine oder andere von euch bez&uuml;glich des
Amigas gestellt. Meine Antwort lautet : Wieder einen Teil des Weltmarktes
zur&uuml;ck zu erobern. Kaum einer hat in den 80`er Jahren daran gedacht,  das
sich der  PC durchsetzen wird  -  und was ist heute ? Der PC  regiert die
Welt k&ouml;nnte man sagen.  Zumindest wird der  Weltmarkt im  Betriebssystembereich 
von Microsoft, unter der f&uuml;hrung von Bill Gates , angef&uuml;hrt. Kaum
ein paar Jahre sp&auml;ter,  sagt man das &uuml;ber unserem Markt : Amiga hat keine
Zukunft !  Woran kann diese Aussage  liegen ? Nun,  weil wir keine Marktanteile 
mehr haben. Unter der f&uuml;hrung von Escom wurden angeblich Weltweit
rund 5 Mio. Amigas  verkauft !?!  Nun, dann Frage ich mich, wo sind diese
rund 5 Mio. Amiga Besitzer.   Nach neuesten Zahlen gibt es  Weltweit rund
500.000 bis 1.000.000 Mio.   Amiga Besitzer. Also waren doch diese Zahlen
damals versch&ouml;nert worden. Zumindest k&ouml;nnte man das annehmen !
Naja, ein Bekannter von mir, der PC User ist, sagte mal zu mir &quot;Amiga hat
keine Zukunft !&quot;. Das selbe sagte man doch schon in den  80`er Jahren  zu
der PC Gemeinde. Auf alle F&auml;lle  wird sich der Amiga denke ich mal wieder
eine gro&szlig;e Rolle im Amiga Markt spielen.
<p>
Ein anderes Beispiel, an dem zu kleinen Amiga Markt : Maxon verabschiedet
sich. Eine baldige R&uuml;ckkehr wird in dem kommenden Jahren wohl nicht  sein
oder vielleicht doch ? Mal sehen! Der ICP Verlag teilte mir auch in einer
e-Mail mit &quot;Erst wenn 300.000 neue  Amiga verkauft w&uuml;rden, doch bis dahin
ist es ein sehr, sehr weiter weg. Also doch ganz niedergestimmt dem Amiga
gegen&uuml;ber. Auf jeden Fall, wird sich alles in diesem und im n&auml;chsten Jahr
bessern.
<p>
Doch was ein ganz, ganz  ernstes Thema ist und das  betrift und alle, ist
der zuwachs der Raubkopien.   Im PC Markt  ist dies nicht so schlimm,  da
die Spiele dort  oftmals &uuml;ber 30.000 mal  verkauft werden.  Alleine   Wet
wurde  so oft in  Deutschland verkaft.  F&uuml;r den Amiga Markt ist  dies wie
eine Pest. Denn die Abnahme von Amiga Software ist sehr, sehr gering. Wir
machen uns dadurch den Markt kaputt und die bisher verbleibenden Firmen
wie Titan Computer oder Epic Marketing.
<p>
Wenn dies aufh&ouml;ren w&uuml;rde, s&auml;he es ganz anders aus.    Mit jeder einzelnen
Raubkopie stirbt ein St&uuml;ck des Amiga Marktes. Es gibt genung Web  Seiten,
auf denen man f&uuml;r PC Emulatoren Amiga Spiele Downloaden kann - aber auch
viele, die f&uuml;r unseren Rechner sind.
<p>
Zum Abschlu&szlig;
<p>
Wir m&uuml;&szlig;en alle zusammen halten, und auf Amiga Int., Inc. hoffen. Denn was
aus uns wird, liegt in deren H&auml;nden. Wir k&ouml;nnen auch Daniel Schulz, dem
Composer der CD Amiga Theme Back for the Future auch dabei unterst&uuml;tzen,
indem wir seine CD kaufen. Den sein Managment Perez Music und Sony stehen
im engem Kontakt und verhandeln darum, die CD in richtigen Fachhandel zu
bringen. F&uuml;r 12,95 DM ist die CD sehr g&uuml;nstig zu bekommen bei Amiga Int.
oder im Amiga Fachhandel.

<p align="right"><em>-sbh-</em></p>
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk07.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk12.htm">
</MAP><hr></center>


</body>
</html>


