<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 - fun-talk  </title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

 <center><h1>  Pollenflug-Information</h1></center>


   F&uuml;r rund sieben Millionen Menschen
   beginnt Jahr f&uuml;r Jahr das gleiche leidige Spiel: Die Nase
   wird dick und l&auml;uft, die Augen schwellen und tr&auml;nen - Heuschnupfen.
   Welche Pollen die Allergie ausl&ouml;sen, mu&szlig; in Tests durch den
   Arzt gekl&auml;rt werden.<br>
   Pollen sind m&auml;nnliche Keimzellen unserer Bl&uuml;tenpflanzen.
   Die mikroskopisch kleinen Pollenk&ouml;rner zeigen je nach Pflanzenart
   unterschiedliche Formen und Oberfl&auml;chen - mit Stacheln, L&ouml;chern
   oder Schlitzen. Pollen werden von den Pflanzen in kaum vorstellbarer
   &quot;St&uuml;ckzahl&quot; produziert. Schon eine einzige Birke bringt es auf sage
   und schreibe 6 Milliarden Pollenk&ouml;rper; kein Wunder, da&szlig; bereits
   einzelne B&auml;ume und Str&auml;ucher einen Pollenallergiker zur Verzweiflung
   bringen k&ouml;nnen.<br>
   Ausl&ouml;ser des sogenannten &quot;Heuschnupfens&quot; sind nicht die Pollen an sich,
   sondern anhaftende Eiwei&szlig;stoffe, die den K&ouml;rper &quot;allergisieren&quot;.
   Besonders kleine und leichte Pollen k&ouml;nnen vom Wind &uuml;ber Kilometer
   hinweg transportiert werden. Daher leidet man nicht nur auf dem Land,
   sondern auch in den St&auml;dten mit wenig Vegetation unter den unangenehmen
   Folgeerscheinungen wie Schnupfen und juckenden Augen.<br>
   In der Hochgebirgsluft &uuml;ber 1500 Meter sind Pollen selten. Ebenfalls
   g&uuml;nstig f&uuml;r Pollengeplagte ist ein Aufenthalt am Meer, vorausgesetzt
   der Wind kommt nicht von der Landseite.
<p>
   Doch nicht alle Pollen reizen gleich stark.
   Der Bl&uuml;tenstaub der der windbest&auml;ubenden Pflanzen enth&auml;lt in
   gro&szlig;er Menge besonders kleine und leichte Pollen, die vom Wind
   sehr weit getragen werden k&ouml;nnen. So fliegen Birkenpollen
   beispielsweise bis zu 500 Kilometer weit!<br>
   Ob und wie stark ein Allergiker von seiner Allergie geplagt wird,
   h&auml;ngt von verschiedenen Faktoren ab:

<ul>
<li>   Anzahl der Pollen pro Kubikmeter Luft
<li>   Aggressivit&auml;t der Pollenart
<li>   das Wetter:<br>
                warme, trockene Tage mit strahlender Sonne und leichtem<br>
                Wind lassen besonders viele Pollen durch die Luft<br>
                schwirren, Regen kann die Anzahl sogar noch erh&ouml;hen.<br>
                Windstille bedeutet dagegen eher eine Linderung.
</ul>

  
<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk07.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk09.htm">
</MAP><hr></center>


</body>
</html>


