
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Fun &amp; Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><h1>PowerPC, doch nicht das Wahre?</h1></center>

Ich wollte schon immer mal Raytracing Animationen machen. Aber 
mein 040 25 Mhz ist mir dazu nicht schnell genug und auch ein 060 
hat nicht die Rechenleistung die ich mir w&uuml;nsche. Daher spielte ich 
mit dem Gedanken mir einen PC als Rechenknecht zuzulegen. Als 
dann die Ank&uuml;ndigung von Phase 5 kam sie w&uuml;rden eine Power PC 
Karte bauen , habe ich den Gedanken an einen PC ganz schnell 
wieder &uuml;ber Bord geworfen und mir die PowerUP Karte vorbestellt.
Nach fast einem 3/4 Jahr warte Zeit da f&uuml;r die PowerUP 040 noch 
ein Chip ge&auml;ndert werden mu&szlig;te und ich mein 040 aus kosten 
gr&uuml;nden behalten wollte war ich endlich Besitzer einen PowerUP 
Karte. Der Einbau war einfacher als ich erst dachte , aber dann kam 
das gro&szlig;e Erwachen. Da ich noch keine PPC Software hatte war 
mir klar das mein Amiga durch den Einbau der Karte nicht schneller 
wird. Aber das fast die ganze Software auf der CD von Phase 5  
eine Grafikkarte verlangt hatte mich entt&auml;uscht. Denn ich habe 
keine Grafikkarte und alle zuk&uuml;nftigen K&auml;ufer ein PowerUP Karte f&uuml;r 
den A1200 d&uuml;rfte es auch nicht anders ergehen. Kurze Zeit sp&auml;ter 
kam CyberGFX AGA raus und ich ging frohen Mutes daran 
CyberGFX AGA zu installieren. Bei der Gelegenheit holte ich mir 
auch gleich die neuste Version von Benoit, einem Mandelbrot 
Programm, und Isis, einen MPG Player. Benoit lief unter Cyber GFX 
AGA aber ohne direkte Bild Ausgabe man mu&szlig; das Bild erst 
abspeichern und es sich mit einen Viewer anschauen. Aber ich 
wu&szlig;te nun endlich genau wie gro&szlig; der Leistungsunterschied der 
Prossesoren ist, der 604e 200 Mhz schaffte es in 0.21 secs. und 
der 040 25 Mhz brauchte f&uuml;r das selbe Mandelbrot 8.21 secs. Nun 
kam Isis an die Reihe da ich vorher viel lob geh&ouml;rt hatte (MPG in 
Echtzeit) war ich gespannt, aber Isis ben&ouml;tigt wirklich eine 
Grafikkarte. Aber dann kam der Schock, PPaint l&auml;uft nicht unter 
CyberGFX, unter Nutzung der PPaint PPC libs , also entweder PPaint 
ohne PPC Unterst&uuml;tzung oder CyberGFX AGA wieder deinstalieren. 
Ich habe mich f&uuml;r das letztere entschieden.<br> 
Nach sovielen schlechten Nachrichten m&ouml;chte ich aber nicht die 
guten verschweigen. WarpUp lief einwandfrei auch ohne CyberGFX  
und zeigte die Leistung die in der PPC Karte steckt. Auch wenn der 
Streit zwischen Phase 5 und Hage &amp; Partner mehr Stillstand als 
Fortschritt gebracht hat.  Das einzige Programm das mich voll 
&uuml;berzeugt hat ist Picture Manager 5.0. Es macht fast richtig Spa&szlig; 
zuzugucken wie er ganze CD`s katalogisiert. 
<p>
Fazit:
Die PowerUp Karte hat eine &uuml;berzeugende Rechenleistung!
Aber man sollte auch in absehbarer Zeit den Kauf einer Grafikkarte
einplanen. Da alle PPC Proramme CyberGFX Unterst&uuml;tzung haben 
oder darauf bestehen und die Rechenleistung der PowerUP Karte 
durch die langsame AGA Grafik Ausgabe sehr stark gebremst wird.


<p align="right"><em>-sk-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk04.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk06.htm">
</MAP><hr></center>


</body>
</html>


