
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Fun &amp; Talk</title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>ANNEX im Interview</h1></center>

Fast jeder Amiga User hat schon von der Amiga Hymne CD geh&ouml;rt
und sie wurde mit Begeisterung aufgenommen. Wir haben dazu ein
Interview mit der Gruppe ANNEX f&uuml;r diese Ausgabe vorbereitet.
Viel Spa&szlig; beim Lesen !
<p>
AT     = Amiga Times / S. Ben-Hassine<br>
Daniel = ANNEX / Daniel
<p>
<table>

<tr><td valign="top"><b>AT:</td><td> Als erstes gratuliere ich Euch zu Eurer super CD!</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Vielen Dank. Und wir bedanken uns bei den Amiganern f&uuml;r deren 
        Unterst&uuml;tzung. Jeden Tag erhalten wir viele dutzend eMails aus
        der ganzen Welt, die uns eine Menge Mut machen.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Seit wann gibt es ANNEX ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Georgette, Sandra und Neal haben bereits vor vier Jahren mit
        einer selbst produzierten Dance Performance auf der B&uuml;hne gestanden. Vor zwei Jahren entstand der Kontakt zu Ricardo P&eacute;rez.
        Als sich die Kooperation zwischen AMIGA und P&Eacute;REZ MUSIC abzeichnete, holte Neal die beiden befreundeten T&auml;nzerinnen Ornella und
        Mimi mit ins Team. ANNEX war damit geboren.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wie seid Ihr auf diese Idee gekommen ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Ich bin schon seit vielen Jahren ein begeisterter AMIGA-Freak,
        der die Idee hatte, f&uuml;r die internationale Fan-Gemeinde einen
        Song zu komponieren. Zum einen wollte ich damit ein internationales
 musikalisches Erkennungszeichen f&uuml;r die Fans schaffen,
        zum anderen wollte ich auch v&ouml;llig Au&szlig;enstehende wieder auf den
        AMIGA aufmerksam machen, und so in der &Ouml;ffentlichkeit das gro&szlig;e
        AMIGA-Comeback ank&uuml;ndigen. Auch der Text des Songs hat sich daran
        orientiert.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wie lange hat die Produktion gedauert ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Ich habe bereits Mitte &acute;97 mit dem Song begonnen. Insgesamt haben
        wir also fast 8 Monate an der Hymne gefeilt.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Welche Systemkonfiguration wurde verwendet ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Ich verwendete einen A1200/060/50 MHz. Man muss keinen hochger&uuml;steten 
        Amiga haben, um damit Musik zu machen. Falls jemand
        meine Konfiguration genauer wissen m&ouml;chte, kann mich ja anmailen.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Welches Programm wurde verwendet ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Ich hab das OctaMED Soundstudio Pro. benutzt. Ist einfach genial.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Warum habt Ihr diese CD mit dem Amiga produziert ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Die Antwort ist einfach: Ich besitze eben keinen PeeCee oder Atari,
        und werde mir auch nie sowas kaufen.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Was haltet Ihr allgemein vom Amiga bzw. wie ist Eure Einstellung ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Man sollte eigentlich meinen, da&szlig; es keinen besseren Computer gibt,
        aber leider machen Softwarefirmen uns immer wieder einen Strich
        durch die Rechnung. Allein die Programme, die in echt guter Performance auf dem Fusion oder dem Shapeshifter laufen, sollten
        eigentlich ein &uuml;berzeugendes Argument f&uuml;r die weitere Softwareentwicklung sein. Au&szlig;erdem macht leider f&uuml;r den Amiga kaum einer
        professionelle &ouml;ffentliche Werbung, und die ganzen Firmen die
        Amiga-Software programmieren, untersch&auml;tzen ihre Software um L&auml;ngen.
        Vielleicht wird ja die Theme-CD und der Song &quot;Back for the future&quot;
        bei den Medien entsprechende Aufmerksamkeit wecken, und damit kostenlose Amiga-Werbung ausl&ouml;sen. F&uuml;r massive Werbung wird es h&ouml;chste Zeit
        ... In jedem Fall ist f&uuml;r mich der Amiga ein unersetzbarer &quot;Freund&quot;,
        den ich f&uuml;r nichts auf der ganzen Welt eintauschen w&uuml;rde.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wie wurde Eure Idee von den Amiga Usern angenommen ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Fantastisch, denn bevor der AI-Pr&auml;sident Petro Tyschtschenko die
        Hymne akzeptierte, hatten diverse internationale Userclubs sich
        mit dem k&uuml;nftig offiziellen Song einverstanden erkl&auml;rt. Entsprechend
        ist auch die heutige &uuml;beraus positive Resonanz der Amiganer, die uns
        jeden Tag anhand von vielen, vielen eMails aus der ganzen Welt demon-
        striert wird. </td></tr>

<tr><td valign="top"><b>AT:</td><td> Werdet Ihr in Zukunft etwas anderes f&uuml;r den Amiga produzieren ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Wir werden sehen, was die Zukunft bringt; wollen aber alles versuchen, um auf den Amiga weiter aufmerksam zu machen und das 
        Computersystem zu pushen. Sollten wir mit &quot;Back for the future&quot; 
        guten Erfolg haben, m&ouml;chten wir auch anderen AMIGA-Musikern gerne
        eine Chance zur Ver&ouml;ffentlichung ihrer Songs bieten. Vielleicht auf
        einer Art AMIGA-Compilation. Die ersten Demo-Tapes haben uns User
        bereits zugeschickt.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wie soll die Vermarktung aussehen - auch im richtigen Fachhandel oder
    nur im Amiga Markt ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Neben dem Vertrieb der Fan-Release-CD &uuml;ber AMIGA International,
        soll &quot;Back for the future&quot; bald auch im normalen Handel erh&auml;ltlich
        sein. Wir befinden uns zur Zeit in Gespr&auml;chen mit verschiedenen
        gro&szlig;en Vertriebsgesellschaften. Dennoch ben&ouml;tigen wir dringend 
        Rundfunkeins&auml;tze, um dem Song (und damit AMIGA) in der &Ouml;ffentlich-
        keit mehr Gewicht zu verleihen. Wir hoffen dabei auf den Support
        der Amiganer.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wird Euer Song auch im Radio oder Fernsehen zu h&ouml;ren/sehen sein ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Ja, danach sieht es zur Zeit aus. Viele Amiganer baten uns darum,
        eine eMail-Aktion an die wichtigsten Radiosender zu koordinieren.
        Sie sind davon &uuml;berzeugt, da&szlig; sie auf diesem Wege (auch ohne den
        Support von AI) ihre Macht als User zum Ausdruck bringen k&ouml;nnen.
        Somit geht es uns auch nicht darum, die CD m&ouml;glichst oft zu verkaufen, sondern sie nur m&ouml;glichst gro&szlig;fl&auml;chig und international
        bekannt zu machen. Zur Umsetzung dieser Idee bot sich das FunTime
        -Magazin an, da&szlig; die eMail-Aktion f&uuml;r Deutschland ehrenamtlich
        organisieren m&ouml;chte. Vielleicht schlie&szlig;en sich ja auch andere
        Magazine an dieses Magazin an und sorgen damit f&uuml;r eine - nur von 
        den Fans bewirkte - AMIGA-Werbeaktion der Superlative.
        News gibt es immer auf unserer ANNEX-Homepage unter:<br>  
        <a href="http://home.t-online.de/home/ripera/nx.htm">http://home.t-online.de/home/ripera/nx.htm</a>
<p>
        Auch ein Video ist bei entsprechenden Erl&ouml;sen aus dem CD-Verkauf
        geplant. Da ein Clip aber locker DM 30.000 kostet, brauchen wir
        ja erstmal entsprechende Einnahmen. Falls aber bereits jemand gute
        Kontakte f&uuml;r Live-Auftritte von ANNEX haben sollte (z.B. Konzerte,
        Fernsehen), schreibe uns bitte. F&uuml;r jeden Support sind wir dankbar.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Was glaubt Ihr m&uuml;&szlig;te mit dem Amiga geschehen ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Viel mehr professionelle Werbung ist in Zukunft das wichtigste,
        um neue User f&uuml;r den Amiga zu begeistern. Desweiteren sollten die
        Usergroups und Freaks weiterhin an guter Software (z.B. der Umsetzungen von Spielen) arbeiten. Sie sind der wahre Motor und die
        eigentliche Machtzentrale unserer &quot;Amiga-Bewegung&quot;.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Was w&uuml;rdet Ihr zu den Amiga Usern sagen wollen ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Helft uns den Song auf der ganzen Welt bekannt zu machen. Er ist ein
        trojanisches Medienpferd, um den AMIGA wieder in aller Munde zu 
        bringen. Zur Zeit fehlen Amiga offensichtlich selbst die Mittel,
        um gro&szlig;e Werbeaktionen zu starten. Es liegt nun an den Fans, dem 
        Amiga - im wahrsten Sinne des Wortes - neues &quot;Geh&ouml;r&quot; in der &Ouml;ffent-
        lichkeit zu verschaffen. Wer Fragen hat, der wende sich bitte direkt
        an uns per eMail: <a href="mailto:perez@gmx.de">perez@gmx.de</a> </td></tr>

<tr><td valign="top"><b>AT:</td><td> Wem geb&uuml;rt der Hauptdank an der ganzen Sache ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Der gro&szlig;e Dank gilt sicherlich den vielen internationalen Usergroups und Amiga-Fans, die damals unseren Song als &quot;AMIGA Hymne&quot;
        offiziell akzeptiert haben und uns ihre Unterst&uuml;tzung zusagten.
        An alle User: Nochmals danke f&uuml;r Euer Vertrauen. Wir werden tun,
        was in unserer Macht steht, um den AMIGA wieder medienwirksam bekannt zu machen!</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wie seid Ihr zu Eurem Erfolg gekommen ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Wir freuen uns, da&szlig; Ihr schon so kurz nach der Weltpremiere in
        London eine solche Frage stellt. Dennoch k&ouml;nnen wohl nur die 
        Amiga User diese Frage objektiv beantworten. 
        Wir geben jedenfalls unsere ganze Kraft f&uuml;r ANNEX und &quot;Back for
        the future&quot; und freuen uns nat&uuml;rlich &uuml;ber die tolle Resonanz.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Was hat Amiga Int. und P. Tyschtschenko damit zu tun?
        Wer hat euch das ganze finanziert bzw. lizensiert ?</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Finanziert hat die Produktion unser Label und Musikverlag PEREZ
        MUSIC. Die Lizensierung des Songs &quot;Back for the future&quot; als 
        offizielle Hymne erfolgte durch Amiga International, nachdem die
        befragten Usergroups entsprechend zugestimmt hatten.</td></tr>

<tr><td valign="top"><b>AT:</td><td> Wir bedanken uns bei euch f&uuml;r dieses Interview und w&uuml;nschen Euch f&uuml;r
    die Zukunft alles Gute !</b></td></tr>

<tr><td valign="top">Daniel:</td><td> Vielen Dank. Auch Eurem Magazin w&uuml;nschen wir das Allerbeste.
        SUPPORT AMIGA!</td></tr> 

</table>
<p align="right"><em>-sbh-</em></p>

<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="talk02.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk04.htm">
</MAP><hr></center>


</body>
</html>




