<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset-iso-8859-1">
<meat name="GENERATOR" content="CygnusED 4.14">
<title>Amiga Times 03/98 -Fun &amp; Talk  </title>
</head>
<body background="../images/bg.gif" bgcolor="#C0C0C0" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
<center><h1>Amiga Revolution</h1>

<h2>I n f o - T e x t</h2></center>

<p align=center>
<b>Inhalt</b><br>
|<a href="#1">1.Einf&uuml;hrung</a>|<a href="#1.1">1.1 Wer sind wir?</a>|<a href="#2">2. History</a>|<a href="#2.1">2.1. Die Geschichte des Amigas</a>|<br>
|<a href="#2.2">2.2. Die Amigianer</a>|<a href="#3">3. Revolution</a>|<a href="#3.1">3.1 Verlauf</a>|<a href="#3.2">3.2. Neue Technologie - Software</a>|<a href="#3.3">3.3. Das Ziel !</a>|<br>
|<a href="#4">4. Amiganer aller Welt vereinigt Euch!</a>|<a href="gfx04.htm ">Amiga Revolution Logo</a></a>|<a href="ar_meldung.htm"> Anmeldung </a>|</p>
<p>
<center><a name="1"><b>1. Einf&uuml;hrung</b></a></center>
<p>
Es liegt noch garnicht solange zur&uuml;ck, da stand in jedem Haushalt ein 
k&ouml;niglicher Amiga 500. Dieses Ger&auml;t bot alles, was das Herz begehrte. Seinem 
engsten Konkurrenten, dem Atari 1040ST, war es weit &uuml;berlegen und die MS-DOS 
Plage war damals noch nicht ernstzunehmen. Die gesamte Spieleindustrie war 
nur auf den Amiga ausgerichtet, er galt als Spielecomputer Nummer Eins, aber 
auch auf dem Anwendungsgebiet war er ausgezeichnet, vor allem auf dem Gebiet 
Grafik und Video. Heute sieht die Lage leider anders aus. Bill Gates hat es 
mit Microsoft geschafft, die Menschen in totale Abh&auml;ngigkeit zusetzten. 
Windows 95 &uuml;bernimmt die Kontrolle &uuml;ber den Computer, der Mensch hat nur 
noch wenig Einflu&szlig; auf sein System und benutzt am Besten gleich die von 
Microsoft diktierte Software. Ein Ausbrechen aus dem Windows-Kreislauf ist 
nicht m&ouml;glich, da es zu weit verbreitet ist. Auch das dem Windows weit 
&uuml;berlegene Mac-OS, l&auml;uft auf durchaus anschaulichen Macintosh-Rechnern, 
konnte sich bisher nicht durchsetzten und die Anteile sind eher r&uuml;ckl&auml;ufig. 
Apple ist seit einiger Zeit in einer tiefen Krise und ein Ende ist nicht in 
Sicht. Im Gegenteil, es sieht so aus, als w&uuml;rde es bald nur noch den MS-Mac
geben. Microsoft hat eingekauft und stellt sich als Helfer in der Not da. 
Das er das nicht ist, wissen wir alle, doch da kann man doch was tun, oder!
<p>
Wir sind mitten in dem Zeitalter, wo der Mensch ohne Computer nicht mehr 
auskommt und die Computer immer wichtiger werden - im t&auml;glichen Leben, im 
Beruf und nat&uuml;rlich im Unterhaltungssektor. An dieser Stelle d&uuml;rfen wir es 
nicht zulassen, da&szlig; der PC, der ganz unter Windows-Kontrolle geraten ist, 
allein den Markt beherrscht und diesen f&uuml;r sich beansprucht.
Die Zeit ist reif, da&szlig; wir etwas unternehmen und der Amiga wieder dahin
kommt, wo er hingeh&ouml;rt.
<p>
<center><a name="1.1"><b>1.1 Wer sind wir?</b></a></center>
<p>
(Stand: Mai`98)
<p>
Jack Miller *** Organisation und Leitung (<a href="mailto:Jack.Miller@t-online.de">Jack.Miller@t-online.de</a>)
<p>
Mrs. Miller *** Pressesprecherin (Betr.: Mrs Miller)
<p>
Prof. BSE *** Leitung Anti-MS-Abteilung, Music and Art (Betr.: Prof. BSE)
<p>
Nils Barka *** Anti-MS-Abteilung, Music and Art (Betr.: Nils Barka)
<p>
Matthias Langhals *** Music and Art (Betr.: M. Langhals)
<p>
Frank Esser *** PR-Manager (Betr.: Frank Esser)
<p>
Markus Blau *** A500-Generation und Linux-Abteilung (<a href="mailto:markusb@hprc.tandem.com">markusb@hprc.tandem.com</a>)
<p>
Oliver Abendsch&ouml;n *** History (Betr.: O. Abendsch&ouml;n)
<p>
Thorsten Seeger *** Macintosh (Betr.: Thorsten Seeger)
<p>
The Executor *** AR-Station Halle/Sachsen-Anhalt und AR-Mag (Betr.: Executor)
<p>
Mario Nitschke *** AR-Station Sachsen und Public Relation (<a href="mailto:niffi@t-online.de">niffi@t-online.de</a>)
<p>
Chrism&auml;n *** AR-Station Freiburg/Baden W&uuml;rttenberg (<a href="mailto:chrisman@t-online.de">chrisman@t-online.de</a>)
<p>
Minotaur *** AR-Station M&uuml;nchen/Bayern (<a href="mailto:marc.maehrlaender@stud.tu-muenchen.de">marc.maehrlaender@stud.tu-muenchen.de</a>)
<p>
Wolfgang Unger *** AR-Station Austria (<a href="mailto:ungi@fsmat.htu.tuwien.ac.at">ungi@fsmat.htu.tuwien.ac.at</a>)
<p>
<center><b><a name="2">2. History</a></b>
<p>
<b>Inhalt</b><br>
|<a href="#1">1.Einf&uuml;hrung</a>|<a href="#1.1">1.1 Wer sind wir?</a>|<a href="#2">2. History</a>|<a href="#2.1">2.1. Die Geschichte des Amigas</a>|<br>
|<a href="#2.2">2.2. Die Amigianer</a>|<a href="#3">3. Revolution</a>|<a href="#3.1">3.1 Verlauf</a>|<a href="#3.2">3.2. Neue Technologie - Software</a>|<a href="#3.3">3.3. Das Ziel !</a>|<br>
|<a href="#4">4. Amiganer aller Welt vereinigt Euch!</a>|<a href="gfx04.htm ">Amiga Revolution Logo</a></a>|<a href="ar_meldung.htm"> Anmeldung </a>|</p>
<p>
<b><a name="2.1">2.1. Die Geschichte des Amigas</a></b></center>
<p>
Richtig angefangen zu existieren hat der Amiga im Jahre 1985. Der erste 
Amiga ging in Serie. Es war der legendere A1000 und die Menschen liebten 
ihn. Dieser Computer war genau das, was die Welt gebracht hatte. Einen 
Computer, der auch mehrere Farben auf den Schirm bringt und vielseitig 
verwendbar ist. Man kann von einer Sensation sprechen. Leider gab es gleich 
nach dem erscheinen zu wenig Ware f&uuml;r die ganzen Interessenten, und dies 
sollte auch in Zukunft eins der gr&ouml;&szlig;ten Probleme bei Commodore bleiben.
<p>
Weiter ging es dann 1987. Es erschienen die Modelle A500 und A2000. Der A500 
als Homecomputer f&uuml;r jedermann, der A2000 als die leistungsstarke Maschine, 
die in der B&uuml;rowelt die IBM-Rechner verdr&auml;ngen sollte. Zumindest auf dem 
Homesektor ging die Rechnung voll auf. Der A500 verkaufte sich schnell, und 
bald stand in jedem Haushalt ein solches Prachtexemplar. Dieser Compi konnte 
mit allen Spielekonsolen mithalten, war der Grafikcomputer Nummer Eins, 
Textverarbeitung kein Problem und f&uuml;r den Video- und Musikbereich erste 
Klasse. Der Musikbereich viel dann sehr bald unter die Kontrolle der Atari 
Sts und in Sachen Textverarbeitung blieben die meisten B&uuml;ros unklugerweise 
den PCs treu.<br> 
Commodore brachte dann sehr bald einige weitere Modelle auf den Markt. Dazu 
geh&ouml;rten der High-End-Rechner A3000, sowie die Tower-Version, das CDTV und 
den A500plus, im Jahre 1992 kam noch der A600 dazu. Das CDTV war ein totaler 
Flop. Das schreiben zu m&uuml;ssen schmerzt, denn das CDTV (Commodore Dynamic 
Total Vision) beherrschte damals (1991) schon alles, was in den letzten 
Jahren CD-ROM-m&auml;&szlig;ig auf dem Markt gefragt war und ist. Das CDTV hatte ein 
CD-ROM-Laufwerk. Man konnte es als CD-Player benutzen und nat&uuml;rlich f&uuml;r die 
CD-ROMs. Wenn wir uns heute umgucken, dann sehen wir nur noch CDs. Es pa&szlig;t 
einfach viel mehr darauf und die Haltbarkeit scheint unbegrenzt. Lauter 
Vorteile gegen&uuml;ber den Disketten, Commodore hat es im Jahre 1991 schon 
erkannt und einige User, die sich dieses Ger&auml;t zugelegt haben. Leider hat 
Commodore bei der Vermarktung glorreich versagt, aber allgemein kann man 
sagen, da&szlig; das CDTV seiner Zeit zu weit voraus war. Die Menschen waren noch 
nicht empf&auml;nglich genug f&uuml;r diese neue Technologie. Der A600 war genauso wie 
der A500plus ein &uuml;berfl&uuml;ssiges Modell. Technisch nichts neues und schon 
bei der ersten Vorstellung veraltet.
<p>
1993 war es dann soweit: Eigentlich schon viel zu sp&auml;t und trotzdem h&auml;tte er 
den Amiga an die weltweite Spitze bringen m&uuml;ssen: Der A1200, begleitet von 
dem gro&szlig;en professionellen Bruder A4000. Der neue AGA-Chipsatz er&ouml;ffnete 
neue Horizonte an dem so begrenzten Computerhimmel. Auch ansonsten waren die 
neuen Modelle einfach perfekt. Nur hat Commodore schon wieder zu viele 
entscheidene Fehler gemacht:<ol>
<li> Man wollte den A600 noch verkaufen, und deshalb wurde die AGA-Generation 
zu lange zur&uuml;ckgehalten.
<li> Die Vermarktung war schlimmer als jemals zuvor in der Commodore-
Geschichte.
<li> Der A1200 wurde niemals von Grund auf erweitert, bzw weiterentwickelt. 
Der Prozessor blieb immer ein 68020, der Speicher kam nicht &uuml;ber 2MB heraus, 
und die Festplatte fehlte zu oft g&auml;nzlich.
<li> Commodore verfolgte einen Ann&auml;hrungskurs an die MS-DOS Rechner. Dieser 
setzte das hohe Niveau herab und ver&auml;rgerte die Fangemeinde.
<li> ...(es gibt wahrscheinlich noch viele Fehler, von der die &Ouml;ffentlichkeit 
noch gar nichts erfahren hat).</ol>
1994 kam dann noch das CD32, bevor sich Commodore schmerzlich verabschiede-
te und einen Tr&uuml;mmerhaufen mit viel Potential hinterlie&szlig;. Das CD32 war eine 
Spielekonsole. Bis auf Atari war niemand in der Lag, ein &auml;hnliches Ger&auml;t 
herauszubringen, das eine Konkurrenz zu dem CD32 h&auml;tte darstellen k&ouml;nnen. 
Doch dem CD32 ging es nicht viel besser als dem Atari Jaguar. Trotz 
hervorragender Technik und der M&ouml;glichkeit, zu einem vollwertigen A1200 
aufger&uuml;stet zu werden, blieben diesem Ger&auml;t die Weiten einer Nintendo oder 
Sega Spielekonsole immer verschlossen. Auch die 2 Jahre sp&auml;ter erschienene
Sony Playstation hat nicht vielmer zu bieten als das CD32. Es gab halt 
gleich zu Beginn mehr Werbung, mehr Spiele und mehr Toleranz.<br>
Mittlerweile, wo die Playstation mit &uuml;ber 250 Spielen wirbt, Nintendo das 
N64 auf den Markt gebracht hat und krampfhaft probiert, die PSX zu 
&uuml;bertrumpfen, ist f&uuml;r das nicht weiterentwickelte CD32 kein Platz mehr. Aber 
es h&auml;tte anders kommen k&ouml;nnen. Das CD32 k&ouml;nnte an Stelle von der Playstation 
die Nummer Eins sein und der Nachfolger, das CD64 h&auml;tte sich um das Nintendo 
64 k&uuml;mmern k&ouml;nnen.
<p>
Das beste System konnte sich in den Jahren unter Commodore, dann unter Escom 
und bis jetzt unter neuer Herrschaft von Amiga Int. (Gateway 2000) nicht zu 
dem entwickeln, zu dem es bestimmt war. Der Amiga sollte f&uuml;r immer ein Traum 
bleiben, wie es R.J. Mical, ein wichtiger Entwickler der Amiga-Technologie, 
schon ausgedr&uuml;ckt hat:<br>
&quot;Der Amiga hat von Anfang an den Tr&auml;umern geh&ouml;rt. Ich war ein einfacher 
Junge aus dem S&uuml;den Chicagos, aber ich wollte etwas Weltbewegenes tun. Als 
ich zu Amiga ging, hatte ich den Traum von einem neuen Computer, einem, den 
ich selbst benutzen wollte - so ungemein schnell und leistungsstark. Wir bei 
Amiga tr&auml;umten alle den selben Traum.&quot;
<p>
<center><a name="2.2"><b>2.2. Die Amigianer - Die einzigartige Fangemeinde des Amigas</b></a></center>
<p>
Der Amiga ist ein au&szlig;ergew&ouml;hnlicher Computer. Genauso au&szlig;ergew&ouml;hnlich sind 
die User dieses Systems. Diese User bezeichnen sich allgemein als 
&quot;Amigianer&quot;. Man mu&szlig; bei den Usern jedoch zwischen zwei Gruppen 
differenzieren:<br>
Zu der ersten Gruppe kann man all diejenigen z&auml;hlen, die den Amiga ganz 
normal benutzen, weil sie seine F&auml;higkeiten sch&auml;tzen und es keine, bzw. Nur 
schlechtere Alternativen gibt. Diese Gruppe existiert jetzt so gut wie gar 
nicht mehr, war aber in den glorreichen Amiga-Zeiten sehr gro&szlig; und &uuml;berall 
vertreten.<br> 
Heute gibt es eigentlich nur noch die andere Gruppe. Zu dieser z&auml;hlt man die 
User, die, aufgrund ihrer Liebe und Zuneigung zu dem Amiga, ihm die Treue 
halten und ihn Loben und Ehren bis zum Tod. Zu dieser Gruppe z&auml;hle ich mich. 
Ich bin ein Amigianer und jeder, der ebenso denkt, ist auch ein 
Amigianer.<br>
Wir sind die User, die trotz schwerer Krisen den Amiga noch nicht verkauft 
haben und andere Systeme, auch wenn sie mittlerweile weiter entwickelt sind 
als unser Amiga, verachten. Commodore hat das vorhandene Potential nicht 
entsprechend gef&ouml;rdert und vermarktet, sie haben vielmehr versucht, auf dem 
nicht sehr lukrativen und ge&auml;chteten PC-Markt Fu&szlig; zu fassen, was allerdings 
gr&uuml;ndlich daneben ging. Der Amiga mu&szlig;te darunter leiden, und mit ihm 
nat&uuml;rlich all die Personen, die an ihn geglaubt haben und es immer noch tun. 
Nach Commodores Niedergang verging ein Jahr der Ungewi&szlig;heit bis endlich
feststand, da&szlig; Escom den Amiga &uuml;bernimmt und &quot;gro&szlig;e&quot; Pl&auml;ne mit ihm vorhat. 
Davon haben wir bis zu Escoms Untergang wenig mitbekommen, so da&szlig; dieses 
Escom-Jahr nicht besser verlief als ohne jeglichen Amiga-Besitzer. Nun sind 
wir immer nochnicht weiter. Der Amiga geh&ouml;rt zu Gateway 2000, die eine 
Tochterfirma mit dem erfolgsversprechenden Namen &quot;Amiga International&quot; 
gegr&uuml;ndet haben. Diese Firma versucht mit Lizensvergaben den Amiga 
wiederzubeleben. Sicherlich eine gute Idee, die h&auml;tte vor vielen Jahren 
einmal umgesetzt werden m&uuml;ssen. Leider sehen wir von Neuentwicklungen direkt 
nichts. Es gibt viele Firmen, die auf Basis des Amigas neue Computer und 
neue Betriebssysteme entwickeln, aber diese zerteilen die Amiga-Fangemeinde 
lediglich in viele kleine, handlugsunf&auml;hige und total abh&auml;ngige Lager. 
Deshalb m&uuml;&szlig;te endlich von Amiga Int. Etwas kommen und wir warten und warten 
und warten. Nur wer dieses Warten &uuml;bersteht und in dieser Zeit weiterhin 
seinen Amiga liebt und gut beh&uuml;tet, nur der kann sich als Amigianer 
bezeichnen.
<p>
Der Amiga hat es solchen Leuten zu verdanken, da&szlig; er noch lebt. Uns allen 
geb&uuml;hrt ein gro&szlig;es Lob und unser Warten wird nicht umsonst sein. Wir werden 
den Amiga ganz nach oben bringen. Dies wird geschehen durch die gro&szlig;e 
Revolution und getragen wird diese durch uns!
<p><b>
<center><a name="3">3. Revolution</a></b><p>
<p>
<b>Inhalt</b><br>
|<a href="#1">1.Einf&uuml;hrung</a>|<a href="#1.1">1.1 Wer sind wir?</a>|<a href="#2">2. History</a>|<a href="#2.1">2.1. Die Geschichte des Amigas</a>|<br>
|<a href="#2.2">2.2. Die Amigianer</a>|<a href="#3">3. Revolution</a>|<a href="#3.1">3.1 Verlauf</a>|<a href="#3.2">3.2. Neue Technologie - Software</a>|<a href="#3.3">3.3. Das Ziel !</a>|<br>
|<a href="#4">4. Amiganer aller Welt vereinigt Euch!</a>|<a href="gfx04.htm ">Amiga Revolution Logo</a></a>|<a href="ar_meldung.htm"> Anmeldung </a>|</p>
<p><b><a name="3.1">3.1. Der Verlauf der Revolution</a></center></b>
<p>
F&uuml;r den Beginn der Revolution ist kein bestimmtes Datum vorgesehen. Welchen 
Tag man sp&auml;ter unter dem Tag der Amiga-Revolution verstehen wird, das kann 
man im Voraus nicht sagen und es wird kein einzelner Tag sein. Auf jeden 
Fall wird es eine Revolution sein. Wir lassen uns nicht mehr auf der Nase
rumtanzen! Die Amiga-Revolution (im folgenden auch AR genannt) wird wie
eine Lawine ins rollen gebracht, und sie wird irgendwann nicht mehr zu
stoppen sein. Dieser Zeitpunkt wird sehr schnell erreicht sein, doch hier
seid Ihr gefragt, ohne Euch geht es nicht! Kritiker werden an dieser Stelle
vermerken, da&szlig; es fast keine Amiganer mehr gibt - also nicht gen&uuml;gend
Leute da sein werden, die die Revolution tragen werden. Das stimmt nicht.
Nat&uuml;rlich ist der Kreis der aktiven Amiganer auf ein Minimum geschrumpft,
er ist aber durchaus noch eine nicht zu verachtende Masse. Und diese Masse
kann und wird aktivier den je werden! Au&szlig;erdem zeichnen sich die Amiganer
durch extreme Standfestigkeit und eine durchdringende Schlagfertigkeit aus.
<p>
Neben den aktiven und reaktivierten Amiganern wird es noch eine ganz neue 
Gruppe geben: Die Oppositionellen. Diese unterst&uuml;tzen die AR in ihrem Denken 
eigentlich nicht, doch werden sie uns aus taktischen Gr&uuml;nden ihre 
Unterst&uuml;tzung nicht verwehren. Unter den Oppositionellen versteht man 
n&auml;mlich Menschen, die mit den bestehenden Verh&auml;ltnissen, ganz wie die 
Amiganer, nicht einverstanden sind. Das k&ouml;nnen zum Beispiel Apple-Fans 
sein, oder PCler, die jedoch alternative Betriebssysteme zu Windows 
bevorzugen und dementsprechend Probleme haben, da die MS Bill Gates-
Monarchie auch sie trifft.
<p>
Zusammen sind wir stark und werden Bill Gates zeigen wo es lang geht.
Vielleicht &uuml;berzeugen wir noch den ein oder anderen und gewinnen somit
neue Amiga User, denn vielen gef&auml;llt das PC aufgequatsche sowieso nicht,
aber wenn andere Systeme nicht zeigen das es sie gibt und das sie noch
aktiv sind, wird auch keiner auf die Idee kommen, mal einen anderen
Computer zu kaufen. Dies wird Zeit brauchen, aber die Bewegung, die
wir mit oder ohne Euch (was jedoch viel schwerer werden d&uuml;rfte!) jetzt
beginnen wird immer weiter laufen und keine sichtbares Ende haben.
<p>
<center><a name="3.2"><b>3.2. Neue Hardware / Neue Software</b></a></center>
<p>
Nat&uuml;rlich mu&szlig; allen klar sein, da&szlig; es keinen Konflikt zwischen Besitzern
alter Amigas und den der neuen Amigas geben darf. AGAler und ECSler m&uuml;ssen
zusammenhalten. Vielleicht legt sich zu diesem Zeitpunkt auch jeder einen
ganz neuen Amiga zu, oder man wartet bis zum neuen Amiga von AI, mit neuem
OS und mehr Power!??! Sobald die Hard-und Softwareentwickler bemerken, da&szlig;
es wieder viel interesse am Amiga gibt, und das gibt es!!!, werden sie
vielleicht endlich vern&uuml;nftig, produzieren wieder f&uuml;r unsere Freundin und
werden wieder ein Teil dieses Marktes, obwohl man gleich eines sagen sollte,
mit hohen Preisen ist nicht viel zu erreichen, wir sind halt keine dummen
DOSen, die jedem Hersteller Geld in den Rachen schmei&szlig;en, nur um den schnellsten 
Rechner zu haben, so ist es nicht und wird es sicherlich nie
sein, wir haben eben keinen Bock auf ein erscheinen von mindestens einem
neuen Prozessor pro Quartal!!!! Wir User unterst&uuml;tzen den Markt, kaufen und
werden benutzen, jedoch nur bei einem guten Preis-/Leistungsverh&auml;ltnis!
Das mu&szlig; jedem bewu&szlig;t sein!!!!
<p>
<center><a name="3.3"><b>3.3. Das Ziel: Die glorreiche Revolution</b></a></center>
<p>
Was wollen wir? Wir wollen das der Amiga wieder zu dem wird, der
er einmal war, der beliebte Computer, der in fast jedem Haushalt
seinen Platz fand. Das dies nicht so ganz aufgehen wird, wissen
auch wir, aber einen Platz hat der Amiga allemal verdient und dies
ist sicher nicht der letzte Platz. Gigant Microsoft zu schlagen ist
unm&ouml;glich, aber uns auszurotten ist ebenfalls nicht m&ouml;glich, dazu
sind wir einfach noch zu stark. Obwohl die Hardware noch einen veralteten 
Stand einnimmt ist der Amiga bei Fernsehen und Video immer
noch gefragt und beliebt. Wir wollen das das so bleibt und noch mehr.
Wir wollen endlich wieder Amigas beim normalen H&auml;ndler kaufen, nicht
mehr als &quot;Spielekonsolen&quot; Besitzer abgestempelt werden, sondern -und
wenn es eben nur ein zweiter Platz ist- von den anderen Systemen akzeptiert 
werden und auch wieder etwas von den neuen Produkten haben,
d.h. das es auch endlich wieder mal Konvertierungen gibt.
Um das zu erreichen, m&uuml;ssen wir eine &quot;Revolte&quot; beginnen, die erst dann
ihr Ende findet, wenn man einen richtigen Schritt nach vorn erkennen
kann! Join the Revolution!  
<p>
<center><a name="4"><b>4. Amiganer aller Welt vereinigt Euch!</b></a></center>
<p>
Das Spiel Amiga vs. PC haben wir verloren, doch es ist Zeit f&uuml;r eine
Revanche! Nur gemeinsam sind wir stark und k&ouml;nnen was erreichen. Wir
von der &quot;Amiga Revolution&quot; m&ouml;chten Euch animieren und mit Euch dem
Amiga zu einem festen stand in der Welt des Computers verschaffen.
Allein und radikal geht das nicht, doch mit st&auml;ndiger Beeinflu&szlig;ung der
Medien, st&auml;ndige Pres&auml;nz auf Messen, bei Club Treffen und Artikel f&uuml;r
Zeitungen k&ouml;nnen wir schon einiges erreichen. Mit Amiga International
haben wir unseren Partner gefunden, der uns sicher auch unterst&uuml;tzt, doch
wir m&uuml;ssen den ersten Schritt machen. Helft uns hier, denn es geht auch
um Euren Rechner. Man kann nicht nur rumsitzen, da&szlig; haben wir lange
genug getan, jetzt wird es Zeit zum Handeln, schlie&szlig;t Euch uns an und
helft uns. Wir verlangen keinen Mitgliedsbeitrag, nur Motivation und
aktive Mithilfe, denn das ist das was wir brauchen. Wenn Ihr vielleicht
sogar lust habt einen AR-St&uuml;tzpunkt in Eurem Bundesland zu leiten, schreibt
uns, damit wir in der gesamten Bundesrepublik aktiv werden k&ouml;nnen und
nicht nur beschr&auml;nkt wirken!!! Users united!

<i>-Jack Miller- </i>
<p align=center>
<b>Inhalt</b><br>
|<a href="#1">1.Einf&uuml;hrung</a>|<a href="#1.1">1.1 Wer sind wir?</a>|<a href="#2">2. History</a>|<a href="#2.1">2.1. Die Geschichte des Amigas</a>|<br>
|<a href="#2.2">2.2. Die Amigianer</a>|<a href="#3">3. Revolution</a>|<a href="#3.1">3.1 Verlauf</a>|<a href="#3.2">3.2. Neue Technologie - Software</a>|<a href="#3.3">3.3. Das Ziel !</a>|<br>
|<a href="#4">4. Amiganer aller Welt vereinigt Euch!</a>|<a href="gfx04.htm ">Amiga Revolution Logo</a></a>|<a href="ar_meldung.htm"> Anmeldung </a>|</p>
<p>
Weitere Informationen:
<p>
Jack Miller (Amiga-Revolution)<br>
C/o Dirk M&auml;hrl&auml;nder<br>
Wiener Str. 41b<br>
61381 Friedrichsdorf<br>
<p>
Tel.: 06175/3642<br>
Email: <a href="mailto:Jack.Miller@t-online.de">Jack.Miller@t-online.de</a>


<p><center>
<IMG SRC="../images/next.gif" border="0" width="362" height="32" USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,32,32" HREF="tal11.htm">
<AREA SHAPE="rect" ALT="index" COORDS="165,0,197,32" HREF="inh04.htm">
<AREA SHAPE="rect" ALT="next" COORDS="330,0,362,32" HREF="talk13.htm">
</MAP><hr></center>


</body>
</html>


