<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Digital Make Up</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Digital Make Up</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Was erwartet man sich von einer CD-ROM mit diesem Namen? Richtig! Eine
Collection der besten und praktischsten Tools zum Versch&ouml;nern und
'Aufmotzen' seiner Workbench. Man erwartet sich unz&auml;hlige von zeitgem&auml;&szlig;en
Iconsets, Hintergrundsmustern und GUI Tools zum Ver&auml;ndern der graphischen
Benutzeroberfl&auml;che, wie z.B. ClassAct, MUI, VisualPrefs. Ein paar
weitere kleine Tools wie Birdie und vielleicht auch noch die sch&ouml;nsten
Uhren, Sounds, Werkzeugleisten, die besten Bildschirmschoner, edle
Fonts, Transfer Animationen f&uuml;r Browser sowie die neuesten Libraries und
noch einige, praktische Tools w&uuml;rden ebenfalls dem Namen dieser CD-ROM
gerecht werden k&ouml;nnen. Jedoch erf&uuml;llt diese Collection leider nur einen
geringen Teil dieser Erwartungen.
<br><br>
Ein Doppelklick auf das CD-ROM Icon bietet dem User ein gewohntes Bild.
Vor allem gewohnt f&uuml;r diejenigen, die schon ein paar Mal die neue
AmigaPlus CD-ROM oder die AmigaFuture Coverdisc erworben haben. F&uuml;r diejenigen,
die jetzt nicht wissen, was ich meine: Einigerma&szlig;en &uuml;bersichtlich, jedoch
nicht sehr platzsparend angeordnete Glowicons Ordner, ein QuickStart Icon zum
Einrichten der CD und ein QuickOut Icon pr&auml;sentieren sich hier dem User.
<br><br>
Die Ordner sind in die Kategorien Workbench Tools, Workbench Add On, Workbench
Games, System Tools, GrafX, Icons, Hardware, Sounds und Fun unterteilt.
Auf der Suche nach GUI-System wird man nach langwierigem Suchen endlich f&uuml;ndig.
'Visual Prefs' und 'ClassAct' befinden sich n&auml;mlich im Tools Verzeichnis. Nun ist
die Beschreibung 'Tools' leider nicht sehr aussagekr&auml;ftig. Ein Ordner, namens GUI
w&auml;re schon &uuml;bersichtlicher. Weiters befinden sich in dem Tools-Ordner auch
Programme, welche sich in dem Ordner 'Online', der sich ebenfalls auf der
CD-ROM befindet, wesentlich wohler f&uuml;hlen w&uuml;rden, wie z.B. der Napster Klient
'aNapster'. Auch befinden sich dort Musiktools, wie 'AHIRecord', obwohl es
auch ein eigenes Verzeichnis namens 'Sounds' gibt. Im Ordner 'Viewer' er&ouml;ffnet
sich dem User ein kunterbunter Mix aus MPEG, AVI, QT und Bilder Anzeigern, im
Ordner 'Time' befinden sich so ziemlich alle Uhr-Varianten, die man sich
vorstellen kann. Die wirklich ansprechenden davon verstecken sich leider unter
unz&auml;hligen von steinalten, h&auml;sslichen Varianten. Erfreuliches gibt es hingegen
f&uuml;r OS3.5 User. Der Ordner 'OS3.5' enth&auml;lt so ziemliche alle OS3.5 Tools, die
es momentan gibt.
</td><tr></table>
<br><br>
<center><img src="../pic/digimakeup.jpg"></center>
<br><br>
<table width="99%"><tr><td>
<font size="3">Der Ordner 'Workbench Add On' beinh&auml;lt neben ein paar kleinen Utilities f&uuml;r
DOpus auch Patches, Datatypes, Blanker, Commodities und Libraries. Als Opus
Magellan 2 User warf ich zun&auml;chst einen Blick in das Opus Verzeichnis, in
welchem leider auf Piktogramme vergessen wurde (dies ist &uuml;brigens auch bei allen
anderen Ordnern in der 'Add On' Schublade der Fall). Doch leider sind dort
weder Themes noch besonders viele Toolbar Bilderchen zu finden. Schade - gerade
Themes eignen sich doch gut zum Versch&ouml;nern der Workbench.
<br><br>
Also auf zum Ordner GraphX. Dort erwarten einen Bootbilder, welche sich besser
im Boot-Ordner machen w&uuml;rden und eine nicht unerhebliche Anzahl an Mustern
und Bildern, die meisten davon nach bestimmten Kategorien, wie Glas, Natur,
Textilien etc. sortiert. Die meisten Patterns, die sich hier befinden, sind
zwar ganz h&uuml;bsch, sind aber fast alle im IFF Format, soda&szlig; sie sich nicht
ohne zus&auml;tzliche Konvertierungsarbeit in Webseiten verwenden lassen. Wenigstens
machen sie aber einen Sinn in der Verwendung mit MUI oder als Hintergrundsmuster
f&uuml;r die WB.
<br><br>
Auf der weiteren Suche nach Kosmetikartikeln st&ouml;&szlig;t man auf den Ordner 'Icons'.
Dort befinden sich nat&uuml;rlich die NewIcons und diverse Iconsammlungen, darunter
auch einige Glowiconsets. Doch auch hier hat man auf die wirklich interessanten
und exotischeren Sammlungen vergessen. So sucht man vergeblich nach den BEIcons,
Archaeologicons, Insecticons oder SadJesterIcons.
<br><br>
Zu einem modernen, multimedialen OS geh&ouml;ren aber auch Kl&auml;nge. Womit wir beim
Verzeichnis 'Sounds' w&auml;ren. In diesem befinden sich lauter gleich aussehende
Schubladen, welche den darin befindlichen Soundcharakter beschreiben. Jedoch
eignen sich die meisten Samples nicht f&uuml;r die Anwendung auf der WB. Oder
m&ouml;chte jemand wirklich jedesmal einen kurzen Ausschnitt aus einem Lied der
nicht mehr besonders aktuellen Band Fugees h&ouml;ren, wenn er/sie ein Fenster
&ouml;ffnet? Dennoch wird man hier nach l&auml;ngerem Suchen f&uuml;ndig. &Uuml;brigens versteckt
sich unter den 22 Ordnern auch ein Ordner, namens 'Player', in dem man die
&uuml;blichen Abspieler f&uuml;r MODs und MP3s vorfindet. Seltsamerweise sind dort auch
die Musikprogramme DigiBoosterPro und der 303Tracker hineingeraten.
<br><br>
Wer auf der verzweifelten Suche nach Tools zum Versch&ouml;nern der Workbench noch
immer nicht f&uuml;ndig wurde, m&ouml;chte sich vielleicht nun mit einem kleinen, spa&szlig;igen
WB Game den Frust 'wegzocken'. Kein Problem: Im Ordner WBGames befinden sich
3 Sammlungen der bekannten Amiga WB Spiele. Die ersten 2 Ordner kann der Besitzer
eines aufger&uuml;steten Amigas gleich einmal links liegen lassen, au&szlig;er er m&ouml;chte
herausfinden, mit welchen interessanten Abst&uuml;rzen sein System auf verstaubte
Spielchen, die auf einem A500 noch problemlos liefen, reagiert. Der dritte
Ordner verbirgt die besseren, farbenpr&auml;chtigeren Spiele. Wer jetzt aber glaubt,
mit Digital Make Up endlich eine Sammlung der besten und sch&ouml;nsten WBGames zu
besitzen, irrt. Auch hier vermisst man Spiele, die man hinsichtlich der Thematik
dieser CD-ROM, zu finden glaubt, wie z.B. SameGame oder MuiMine.
<br><br>
Zum Schlu&szlig; kann man noch im Ordner 'Fun' eine unmotivierte Zusammenstellung
von ein paar alten WB Gags durchst&ouml;bern. Statt dem wirklich gut gemachten
'Sheep' Gag, findet sich dort statt dessen das steinalte 'SheepShoot'. Statt
dem neueren Gag XMasLightsII, welches auch auf Graphikkarten funktioniert,
findet man statt dessen die alte Version, die einen grauen Balken &uuml;ber die
WB Oberfl&auml;che zieht, den man schwer wieder wegbekommt.
<br><br>
<b>Fazit:</b> F&uuml;r diejenigen ohne Internetanschlu&szlig; aber auch f&uuml;r Amiga Einsteiger bietet
diese Collection eine brauchbare Sammlung an so manch essentiellen Tools. Wer aber
glaubt, sich die stundenlange Suche nach den besten Programmen zum Perfektionieren
der Workbench-&Auml;stethik im Aminet oder auf unz&auml;hligen CD-ROM Collections durch 'Digital
Make Up' ersparen zu k&ouml;nnen, liegt leider falsch. Schade darum. Man h&auml;tte sich,
statt die CD-ROM unn&ouml;tig zu f&uuml;llen, auf die wirklich guten und aktuellen Programme
zum Aufpeppen der WB beschr&auml;nken k&ouml;nnen. Weniger ist oft mehr.
 <br><br>
<i><b>Worturteil: Ausreichend</i></b>
<br><br>
Quelle: APC &amp; TCP
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
