<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Faces of Mars 2001</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Faces of Mars 2001</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
'Faces of Mars 2001 ist die CD-ROM Collection der Faces of Mars-PD Serie und enth&auml;lt
das Beste der mehr als 500 Disketten'- so steht es auf der R&uuml;ckseite der CD-ROM gedruckt.
Au&szlig;erdem wird hervorgehoben, da&szlig; alle Programme unter OS3.5 getestet wurden. Ob diese
bei dem Test aber auch einwandfrei liefen, wird leider nicht erw&auml;hnt...
<br><br>
Ein Doppelklick auf die CD-ROM erweckt den Eindruck von einer zeitgem&auml;&szlig;en CD-ROM
Collection f&uuml;r den AMIGA in Zeiten des OS3.5. Denn fast alle Icons sind im Glowicons-Stil
gehalten und setzen ebenfalls das OS3.5 Icons Format voraus. User einer niedrigeren OS
Version werden an dieser Stelle leider nur vierfarbige Piktogramme vorfinden und daher
&uuml;ber das Erscheinungsbild entt&auml;uscht sein. Doch viel wichtiger sind ja die inneren Werte.
<br><br>
Der Inhalt der CD besteht aus folgende Bereichen: 1982, Babylon5, Esoterik, Fantasy, FOM,
Games, History, Internet, Jokes, Mathematics, Misc, Science, ScienceFiction, Space, StarTrek
und StarWars. Klingt ja sehr exotisch.
<br><br>
Meine erstes, instinktives Interesse galt dem Ordner 1982. Dort befinden sich
viele verschiedene Spiele aus dem PD Bereich. Leider sind diese nur Nostalgikern
zu empfehlen, da diese fast alle eines gemeinsam haben: Eine meterdicke
Staubschicht! Als ich mir lange &uuml;berlegt habe, wie ich denn die graphische
Qualit&auml;t der Spiele beschreiben sollte, assozierte ich seltsamerweise st&auml;ndig
die W&ouml;rter blockige Pixel, Brotkasten und die 80er. Dennoch findet man
als nicht zu anspruchsvoller Amiganer ein paar ganze nette Games, wie z.B.
Croak2 ,welche immer noch einen gewissen S&uuml;chtigkeitsfaktor in sich tragen.
<br><br>
Im Ordner 'Babylon5' befinden sich ein paar Bilder und Texte &uuml;ber diese Serie,
sowie Taglines f&uuml;r YAM. Vielleicht ganz brauchbar f&uuml;r Babylon5 Fans. Der
n&auml;chste Ordner nennt sich 'Esoterik'. Auch brauchbar? Ich wei&szlig; nicht recht. Die
meisten Programme haben mir meine Workbench komplett eingefroren und sahen auf den
ersten Blick auch nicht wirklich aufwendig aus - AmigaBasic l&auml;&szlig;t gr&uuml;&szlig;en!
Esoterisch kann man diese au&szlig;erdem kaum nennen. Denn psychologische
Tests und obskure Deutungen der Physiognomie und des Schicksals haben bei mir
eher den Eindruck von Workbench-Gags erzeugt. Au&szlig;erdem lassen sich diese Programme
auch im Aminet finden. Das Verzeichnis 'Fantasy' bietet ein paar veraltete Spieledemos,
ein paar Bilderchen und ein paar Texte. Als einziges 'Highlight' empfand ich hier das
Adventure 'DayOfTheTentacle'.
<br><br>
<center><img src="../pic/faces.jpg"></center>
<br><br>
Seltsamerweise st&ouml;&szlig;t man auf der Faces of Mars CD-ROm auch auf eine Schublade
mit selbiger Bezeichnung. Diese birgt ein paar schlechte Animationen,
f&uuml;rcherliche Musikmodule, Bilder und auch Webseiten. Die intellektuelle Seite
dieser Softwaresammlung wird 'eindeutig' durch das Verzeichnis 'History' gepr&auml;gt.
Denn hier befinden sich z.B Wissenswertes &uuml;ber Atombomben aber nat&uuml;rlich auch
ein Programm, mit dem sich Beleidigungen (Insulter) generieren lassen. Man
fragt sich vielleicht, was das nun mit History zu tun hat. Nun, nicht viel.
<br><br>
Auf der FOM-CD befindet sich sogar ein eigener Ordner, namens 'Internet'! Leider
befindet sich dort nur StrICQ. Wozu man daf&uuml;r extra einen eigenen Ordner
erstellen mu&szlig;te, ist nicht ganz nachvollziehbar. Daf&uuml;r gibt's in der n&auml;chsten
Schublade 'Jokes' ein Programm mehr. Dort befinden sich n&auml;mlich immerhin zwei (!)
Gags, namens 'Ping!' und 'SnowFall', die nicht wirklich lustig sind. Doch
genug gespa&szlig;t! Es wird nun ernst. Wir kommen zum wissenschaftlichen, mathematischen
Teil dieser CD. 'Mathematics' enth&auml;lt alle m&ouml;glichen mathematischen Programme,
wie z.B. Hellseher und Reisbrett, die von mir aus auch in den 'Esoterik' Ordner
h&auml;tten wandern k&ouml;nnen. Neben diesen machen sich dort auch noch zwei Mandelbrot
Generatoren breit. Wirft man einen Blick in die 'Misc' Schublade, findet man dort
wiederum den Gag 'BlueEyes', welcher sich wieder besser im 'Jokes' Ordner gemacht
h&auml;tte. Sonst sind dort noch ein paar Texte &uuml;ber Kinofilme, die sich nicht gerade
am neuesten Stand befinden, gespeichert. Das 'Science' Verzeichnis verspr&uuml;ht, &auml;hnlich
wie schon 'Mathematics' puren, wissenschaftlichen Geist. So befindet sich dort ein
(vielleicht) echtes Foto von Bigfoot und das pseudo-psychologische 'Eliza' und
immerhin ein paar Lifesimulatoren...
<br><br>
Wer Futuristisches liebt, sollte einen Blick in die Schublade 'Science Fiction'
werfen. Hier kann man sich ein paar nette Animationen und Bilder betrachten
und auch ein paar Spiele zocken. Als eines der Highlights k&ouml;nnte man hier das
graphisch aufwendige Demo des WipeOut Klons 'Slipstream' bezeichnen. Wenigstens etwas.
Auch Nemac4 und SlamTilt sind hier ein Probespiel wert.
<br><br>
Weltraumfans k&ouml;nnen sich zum Schlu&szlig; noch durch die Schublade 'Space' w&uuml;hlen und die
Fans von StarTrek und StarWars werden vielleicht in den gleichnamigen Ordnern auf
der Suche nach nostalgischem Material f&uuml;ndig.
<br><br>
Doch das war noch nicht alles! Diese CD-ROM stellt Internetusern auch noch
ein spezielles Service zur Verf&uuml;gung. Und zwar gibt es in dem HTML Dokument
'LiesMich.htm', welches erfreulicherweise in vier Sprachen vorliegt, einen
Link zu einem Free-E-mail-Service. Naja - ganz nett, dachte ich mir - nur
kann man doch so ein Service auch jederzeit ohne die 'Faces Of Mars' CD-ROM
in Anspruch nehmen....
<br><br>
<b>Fazit:</b> Sch&ouml;ne, zeitgem&auml;&szlig;e OS3.5 Piktogramme im GlowIcons Stil verschleiern
steinalte, angestaubte Daten, die gerne Abst&uuml;rze und Programmfehler erzeugen
m&ouml;chten. Empfehlenswert f&uuml;r nostalgische Amiganer. Besitzer eines aufger&uuml;steten
Amigas mit Graphikkarte werden wahrscheinlich auf diese Collection verzichten wollen.
<br><br>
+ nostalgischer Wert<br>
+ Seltene Spieledemos<br>
<br>
- Keine Einf&uuml;hrung in die CD durch ein Readme<br>
- Alte, angestaubte Software<br>
<br><br>
<b><i>Worturteil: Mangelhaft</b></i>
<br><br>
Quelle: APC &amp; TCP
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
