<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Fahrschule99 - 2000Edition</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Fahrschule99 - 2000Edition</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Meist ist das 16 bzw. 18. Lebensalter noch nicht einmal erreicht, schon dr&auml;ngt der
Wunsch nach dem F&uuml;hrerschein f&uuml;r Moped bzw. Auto. Auch wenn die praktische 
Fahrpr&uuml;fung dem gr&ouml;&szlig;ten Teil der Pr&uuml;flinge keine Schwierigkeiten macht, so
untersch&auml;tzen aber viele den theoretischen Test. Und der ist nun einmal wichtig.
Jede Fahrschule bietet ja bekanntlich Pr&uuml;fungsb&ouml;gen und Lehrb&uuml;cher an, doch wer
bei seiner Fahrschultheorie nicht auf den Amiga verzichten m&ouml;chte, der kann sich
jetzt mit &quot;Fahrschule99 - 2000Edition&quot; auf seine Pr&uuml;fung vorbereiten.
<br><br>
Entwickelt hat das Programm Steffen Schiller, der selbst eine Fahrschule betreibt,
es kostet 19,95 DM und ist bei Alfred Kn&ouml;tig im Vertrieb erh&auml;ltlich.
Ausgeliefert wird &quot;Fahrschule99&quot; auf einer Diskette und ben&ouml;tigt lediglich einen
Amiga mit 1 MB Ram. Eine Festplatte ist nicht zwingend n&ouml;tig, kann aber genutzt
werden, eine Grafikkartenunterst&uuml;tzung gibt es nicht! Das Programm hat keine
eigene Boot-Sequence, muss somit von der Workbench aus gestartet werden.
<br><br>
<center><img src="../pic/fahr1.jpg"></center>
<br><br>
Nach dem Doppelklick auf das Starticon erscheint das Hauptmen&uuml;. Hier k&ouml;nnen Sie
sich einen Test aussuchen. Jeder Test enth&auml;lt 30 Fragen, beim Spezi-Test sind
es 45, und viele selbstgepixelte Bilder. Und wie auch beim Test auf dem Papier
m&uuml;ssen Sie sich f&uuml;r PKW oder Motorrad entscheiden, da der Umfang der Motorrad
Pr&uuml;fungsfragen etwas geringer ist! Weiterhin gibt es einen Zahlen- und 
Verkehrszeichentest.
<br><br>
Die Handhabung ist total simpel. Sie bekommen eine Frage gestellt und die jeweiligen
Auswahlantworten vorgelegt. Sind Sie der Meinung, die richtige Antwort zu wissen,
klicken Sie diese an, ist sie korrekt, wird Ihnen die n&auml;chste Frage gestellt. War
Ihre Antwort falsch, wird die Richtige zus&auml;tzlich angezeigt. Beachten sollten Sie,
dass auch mehrere Antworten richtig sein k&ouml;nnen. Viele Fragen wurden mit Grafiken
versehen, der sehr detailiert gepixelt wurden. Haben Sie Ihre 30 Fragen beantworten
erscheint wieder das Hauptmen&uuml; mit einer Auswertung. Hier gilt 0-9 Fehler: Pr&uuml;fung
bestanden, ab 10 Fehlerpunkte haben Sie es nicht geschafft.
<br><br>
<center><img src="../pic/fahr2.jpg"></center>
<br><br>
Die Vergabe der Fehlerpunkte ist leider nicht immer nachvollziehbar. So ist es m&ouml;glich
f&uuml;r eine falsch beantwortete Vorfahrtsfrage satte 5 Fehlerpunkte zu kassieren, wohingegen
Sie bei einer falschen Frage zum Thema Parken (als Beispiel) nur 1 Punkte bekommen.
<br><br>
Insgesamt gibt es fast 400 Fragen, die mit ca. 70 gut-gepixelten Grafiken unterlegt sind,
f&uuml;r die F&uuml;hrerscheinklassen A1, A und B. &quot;Fahrschule99 - 2000Edition&quot; unterst&uuml;tzt schon
die Regelungen zum EURO-F&uuml;hrerschein vom 01.01.1999.
<br><br>
Fazit:
<br><br>
Wer seine Fahrscule vor sich hat und auf seinen Computer nicht verzichten mag, der
sollte sich dieses Programm auf jedenfall besorgen. Erwarten Sie keine grafischen
H&ouml;chstleistungen, das ist auch sicher nicht das Ziel des Autor`s, daf&uuml;r bekommen
Sie aber eine gut-gestaltete Oberfl&auml;che, die einfach zu bedienen ist und umfangreiche
Fragen und Antworten. Eine Garantie f&uuml;r das Bestehen der theoretischen Pr&uuml;fung ist 
&quot;Fahrschule99&quot; sicherlich nicht, das liegt immernoch an Ihnen selbst, aber mit 
diesem Programm erhalten Sie eine sehr n&uuml;tzliche Hilfe f&uuml;r Ihre Vorbereitung!
<br><br>
<b><i>Worturteil: Empfehlenswert</b></i>
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
