<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: The Amiga Games Guide</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">The Amiga Games Guide</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Das Amiga Game Guide d&uuml;rfte dem ein oder anderen durch das Internet schon bekannt
sein. Stefan Instinske und Stefan Martens sammeln Cheats, Tipps, Komplettl&ouml;sungen
und alles was das Spielerherz erfreut und ver&ouml;ffentlichen es auf ihrer WebSite.
Jetzt ist die erste CD des Amiga Game Guides im Vertrieb von APC &amp; TCP erschienen
und k&ouml;nnte als Art Kompedium bezeichnet werden. Zu mehr als 1600 Spielen gibt es
Tipps &amp; Tricks, mehr als 500 Testberichte zu knapp 250 Spielen und &uuml;ber 2000
Screenhots zu alten und neuen Spielen. Neben Demo`s zu aktuellen Spielen und einigen
&auml;lterne Games, gibt es auf der CD auch HD-Installer, Spielst&auml;nde, Updates, Icons
und vieles mehr. Die CD ist auch auf dem PC nutzbar, Browser werden aber nicht 
mitgeliefert.
<br><br>
Das Amiga Game Guide ist in zwei Varianten verf&uuml;gbar. Wer es eher grafisch mag, der
sollte sich f&uuml;r die HTML Version entscheiden, ansonsten steht noch die Amiga Guide
Version zur Nutzung. Gestartet wird &uuml;ber ein allgemeines Starticon, anschlie&szlig;end
gibt es ein kleines Intro mit dem Namen des Vertriebes und der Ersteller zu sehen.
Danach wird man als Nutzer gefragt, in welcher Version (HTML oder Guide) man gern
alle Fakten lesen m&ouml;chte. W&auml;hlt man HTML, so kann man die Browser IBrowse2.2(demo), 
Voyager3.2(demo), AWeb oder HTMLview benutzen.
<br><br>
<center><img src="../pic/games_guide.jpg"></center>
<br><br>
Die Oberfl&auml;che wurde alphabetisch geordenet, wobei jeder Buschstabe extra anklickbar
ist. Nachdem man sich f&uuml;r eine Zahl oder einen Buchstaben entschieden hat, wird der
Index aufgef&uuml;hrt, jetzt kann man sich ein Spiel aussuchen und sich, wenn verf&uuml;gbar,
die Komplettl&ouml;sung, Cheats, Testberichte oder Screenshots ansehen. Die Men&uuml;f&uuml;hrung 
ist hierbei sehr einfach und &uuml;bersichtlich gehalten.
<br><br>
Sehr sch&ouml;n sind die vielen Bilder von wirklichen Amiga Klassikern und die Testberichte,
hier kann man sehr viel nachlesen und an die guten alten Tage zur&uuml;ck denken, in denen
die Amiga Welt noch in Ordnung war. Bemerkenswert ist, das sehr viele Spiel eingef&uuml;gt
wurden und zu vielen sogar Hersteller, Distributer und Anforderungen genannt werden.
<br><br>
Die gesamte CD-Roms ist sehr unterhaltsam und ein wahres Mu&szlig; f&uuml;r Nostalgiker, doch ich
pers&ouml;nlich fand die grafische Umsetzung etwas d&uuml;rftig. Es gibt keine gro&szlig;artigen Font-
ver&auml;nderungen in der HTML Version, nur die (etwas) stupiden Topaz-Schrifts&auml;tze. Ich finde
hier h&auml;tte man mehr machen k&ouml;nnen, aber aufgrund des sehr umfangreichen Inhaltes kann man
&uuml;ber dieses M&auml;ngel hinwegsehen. Man merkt deutlich wieviel Arbeit in dieser CD steckt und
das Sammeln von Tipps und Komplettl&ouml;sungen ist ja keine Sache, die schnll erledigt ist.
Soetwas dauert seine Zeit und ich finde es gut, das man dies alles nun zu einer CD 
zusammengefasst hat und somit ein ganz besonderes Nachschlagewerk erh&auml;lt.
<br><br>
<b><i>Worturteil: Sehr gut</b></i>
<br><br>
Quelle: APC &amp; TCP
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
