<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Testbericht: Heretic 2</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Heretic 2</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Seit Jahren plagen wir uns mit Shootern rum, die meist recht arm aussahen, oder 
auch auf schnellen Rechnern zu langsam waren (Alien Breed 3D II, Quark 68k - Name
v.d. Red. ge&auml;ndert)! Der erste Lichtschein war die erste illegale Version von 
QuarkPPC (damals noch PowerUP), die zwar auch nicht sonderlich schnell war und 
auch nur AGA 
unterst&uuml;tzte, aber immerhin war es ein Schritt in die richtige Richtung. Nachdem Clickboom 
das TNT Projekt gestartet hatte, kamen erst mal gute Ports von Quark auf den Amiga 
(AWinQuark, QuarkWOS). Der Hit war dann als (endlich!) die GLQuark Version 
kam! Sch&ouml;ne Effekte, AntiAliasing, linear Filtering...! Das sah sch&ouml;n aus, aber macht 
Quark Spa&szlig;? Manchen ja, aber eigentlich ist es wirklich nur taktikloses Geballer, 
oder? Dementsprechend habe ich mich sehr gefreut als Hyperion-Software Heretic 
2 angek&uuml;ndigt hatte, das hatte ich nat&uuml;rlich auch gleich vorbestellt. 
Der Release Termin war damals noch auf Oktober &acute;99 festgelegt, aber der 
wurde leider nicht eingehalten! 
Etwa ein halbes Jahr sp&auml;ter, Tatort World of Alternatives in Neuss. 
Titan Computer bot Heretic 2 erstmals zum Kauf an! Die Freude war gro&szlig; und der 
Abend (endlich vor dem eigenen Rechner) wurde lang... immer l&auml;nger, bis zum 
Morgen!
<br><br>
<center><img src="../pic/heretic1.jpg"></center>
<br><br>
<b>Was ist denn drin?</b><br>
Heretic 2 kommt in einer Schicken Packung daher, die sogar extra f&uuml;r den Amiga 
gedruckt wurde, genau wie das Handbuch! Meiner Meinung nach ein guter Schritt! 
In der Packung sind 2 CD&acute;s (!!!) und das Handbuch!
<br><br>
<b>Anforderungen</b><br>
Zum Spielen braucht man einen PPC, AGA oder GFX-Karte (bevorzugt nat&uuml;rlich eine 
3D-Karte), 64MB Ram, mind. Kickstart 3.0, 300 MB Festplattenspeicher und 
zumindest WarpUP vorinstalliert (falls eine 3D-Karte vorhanden ist auch Warp3D)
<br><br>
<b>Erste Schritte</b><br>
Die Installation l&auml;uft &uuml;ber den Comodore-Installer, also sehr einfach! Vergesst nicht 
vorher die neuen IXEMUL- und IXNET.library(s) runterzuladen, sonst bricht die 
Installation bei der Registrierungseingabe ab. Nach ca. 20 Minuten (!!!) ist 
Heretic auf die Platte verbannt. Und der Spa&szlig; kann beginnen.
<br><br>
<b>Das Spiel</b><br>
Heretic 2 ist ein &quot;3rd Person Shooter&quot;, d.h. man sieht den Helden Corvus aus der 
Tomb Raider Perspektive. Heretic 2 spielt im Mittelalter zur Zeit von Elfen, 
Riesenratten und Fabelfiguren. Die Geschichte wird in dem Anfangsdemo erkl&auml;rt 
und baut auf den ersten Teil auf. Corvus kommt nach langer Zeit zur&uuml;ck in seine 
Welt, doch alles hat sich ver&auml;ndert. Fast alle Wesen sind mit einem Virus befallen 
und greifen Corvus prompt an.
<br><br>
<center><img src="../pic/heretic2.jpg"></center>
<br><br>
Corvus l&auml;sst sich sch&ouml;n durch die 3D Welt buchsieren und was wohl am wichtigsten ist, 
da&szlig; Spiel macht Spa&szlig;, da es eine ergreifende Story hat, wenn man einmal 
angefangen hat, h&ouml;rt man so schnell nicht mehr auf. Es fesselt einen viele Stunden 
an den Monitor. Es ist, wie ein Buch, bei dem  der Leser wissen m&ouml;chte wie es 
weitergeht, mit dem Unterschied, da&szlig; man selber die Handlung bestimmt.
<br><br>
<b>Die Grafik</b><br>
Die Grafik ist wohl das Beste, was man bis jetzt auf dem Amiga gesehen hat. 
Erstaunlich was aus dem Amiga rausgeholt wurde. Tolle Effekte, super Atmosph&auml;re. 
Ich bin echt fasziniert, das &uuml;bertrifft WipeOut 2097 bei weitem. Der Preis daf&uuml;r:
es l&auml;uft auch nicht mehr so butterweich, wie Wipeout, aber entgegen jeder Aussage
ist es auf jedem PPC Amiga mit 3D-Karte sehr annehmbar spielbar. Auf 
meinem 4000er l&auml;uft es nat&uuml;rlich in 640x480 mit voller Effektstufe extrem gut. Auf 
einem A1200 mit 603e/200Mhz in 400x300 und leicht runtergestellten Datails kann man
auch sehr gut zocken, also was will man mehr! Es ist eben alles eine Sache der
Optimierung des eigenen Systems. Man sollte AHI auf jeden Fall ausstellen, wenn keine 
Soundkarte vorhanden ist, man sollte genug Ram haben (64MB ist die absolute 
Untergrenze, 96MB sind mindestens empfehlenswert. Bei schwachen Rechnern kann man
auch das beiliegende ARexx Skrikt benutzen, da&szlig; beim Speicher sparen hilft)!
Man sollte sich von der Geschwindigkeit her, sich auf jeden Fall nicht auf das Demo 
verlassen, denn die Vollversion ist doch eine ganze Ecke schneller. Was auch sehr 
wichtig ist, da&szlig; man das RAM im &quot;Phase 5 early bootmenu&quot; (direkt nach einem Reset 
die ESC-Taste gedr&uuml;ckt lassen) auf 60ns stellen sollte, da&szlig; bringt auch noch mal 
einen ordentlichen Schub.
Wenn Euch aufgefallen ist, da&szlig; Heretic 2 zu pixelig ist, dann solltet Ihr in der
Konsole &quot;gl_texturemode gl_linear&quot; einstellen, dann sollte das der Vergangenheit
angeh&ouml;ren.
<br><br>
<center><img src="../pic/heretic3.jpg"></center>
<br><br>
<b>Die Steuerung</b><br>
Die Steuerung ist, wie bei einem Egoshooter am Besten per Maus-
Tastaturkombination zu konfigurieren. Eine 3 Tasten Maus ist durchaus 
empfehlenswert, ansonsten ist die Tastaturbelegung auch nicht umfangreicher als bei 
einem Standard-Egoshooter. 
<br><br>
<b>Zum Brutalit&auml;tswert</b><br>
Heretic 2 ist je nach Einstellung recht Brutal. Wenn die Option auf &quot;Ultraviolant&quot; 
gestellt ist, kann man den Monstern Arme und K&ouml;pfe abtrennen oder komplett 
zerschnippeln. Wem das nicht gef&auml;llt und wer mehr am RPG Teil von Heretic 2
interessiert ist, sollte die Option &quot;no blood&quot; einstellen.
<br><br>
<b>AddOn&acute;s<br></b>
Auf CD &quot;A&quot; liegt noch Heretic Fortress vor, dies ist ein AddOn f&uuml;r Heretic 2 (&auml;hnlich 
Halflife-Team Fortress oder Quark-Team Fortress)! Es ist ausschlie&szlig;lich f&uuml;r Multiplayer 
Games ausgelegt. Mangels Spielern konnte ich das AddOn noch nicht ausprobieren. 
Mittlerweile ist noch ein neues AddOn erschienen, es hei&szlig;t &quot;The Siege&quot;.
<br><br>
<b>Multiplayer Spa&szlig; oder &auml;tzend</b><br>
Zu Ehren Heretic&acute;s habe ich mit ein paar Freunden eine Heretic 2 Session 
einberufen. Das Multiplayer spielen war leider noch etwas eingeschr&auml;nkt, da von 4 
Leuten (inkl. mir) nur 2 Vollversionen vorhanden waren. So mu&szlig;ten die ohne Vollversion
mit dem Demo vorlieb nehmen, was leider viele Funktionen nicht bereitstellt. 
Aber trotzdem hat es sehr viel Spa&szlig; gemacht. Eigentlich hatte ich erwartet, 
da&szlig; Heretic 2 im Multiplayer langweilig ist, aber dem war nicht so. Es war 
total super die ganzen 
Zauberspr&uuml;che gegeneinander anzuwenden. Ich spiele normalerweise auf 
Netzwerksessions nur Halflife-Counterstrike! Heretic 2 hat mich aber eines besseren 
belehrt, da&szlig; es da drau&szlig;en etwas gibt, was auch Spa&szlig; im Netzwerk macht. Also viel 
Spa&szlig; beim Zocken.
<br><br>
<center><img src="../pic/heretic4.jpg"></center>
<br><br>
<b>Fazit</b><br>
Heretic 2 hat mich doch sehr angenehm &uuml;berrascht. Ich h&auml;tte nicht gedacht, da&szlig; 
es so gut wird. Das Marketing seitens Titan Computer, wieder mal eine Verpackung 
und ein Handbuch, da&szlig; gut portierte Spiel, fantastische Grafik, packende Atmosph&auml;re und 
eine sehr gute Multiplayer-Funktion machen das Spiel zu einem absoluten Topspiel.
Also Leute kaufen kaufen kaufen!
Hyperion Software und Titan Computer haben es echt verdient!
Hier noch mal ein Dank an Hyperion Software und Titan Computer, es wurde 
wirklich ganze Arbeit geleistet!!!!!!!
<br><br>
<table width="70%" cellspacing="0" cellpadding="0" border="0" align="center">
 <tr>
  <td colspan="3" bgcolor="#cccccc">
   <table width="100%" border="0">
    <tr>
     <td colspan="3" bgcolor="#ffffff">
      <table width="100%" border="0">
       <tr>
  <td align="left">
   <font size="3">
    <b>Grafik</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/95.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>95 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Gameplay</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>85 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Sound</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/90.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>90 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Motivation</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/90.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>90 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td colspan="3" height="15">
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Gesamt</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/90.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>90 %</b>
   </font>
  </td>
 </tr>
</table>
 </td>
  </tr>
   </table>
    </td>
     </tr>
      </table>
<br><br>
<b><i>Worturteil: Empfehlenswert</b></i>
<br><br>
Quelle: Titan Computer
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
