<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: JAnimator</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">JAnimator</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Das Hauptziel dieses Programmes ist es, den User mit einer noch &auml;stethischeren
Workbench Umgebung beeindrucken zu k&ouml;nnen. Denn JAnimator kann per Shell
Kommando ein Bild oder eine Animation laden und diese auf der WB darstellen.
So kann man zum Beispiel eine wunderbar gerenderte, sich drehende Weltkugel
auf die WB Oberfl&auml;che legen. Jetzt w&auml;re es nat&uuml;rlich noch beeindruckender,
k&ouml;nnte man per Klick auf die Animation auch noch seinen Lieblingsbrowser starten.
Kein Problem - auch das ist m&ouml;glich. Allerdings mu&szlig; man daf&uuml;r die Befehle
wissen, denn JAnimtor hat leider kein anwenderfreundliches GUI f&uuml;r diese
Zwecke. Doch keine Panik! So schwer ist das nicht: Einfach ein Shell Fenster
&ouml;ffnen und JAnimator mit dem Befehl 'JAnimator FILE=xyz.iff EXECUTECLI=abc'
starten (empfehlenswert ist es hier, JAnimator mit einem 'RUN &#062;NIL:' Befehl
aufzurufen)! Das Programm w&uuml;rde nach diesem Beispiel ein Bild oder eine
Animation namens 'xyz.iff' laden, sie am WB Screen darstellen und auf Klick
das Programm 'abc' starten, welches z.B. ein Browser sein k&ouml;nnte.
<br><br>
Doch JAnimator bietet noch wesentlich mehr M&ouml;glichkeiten zum Versch&ouml;nern
der Workbench. So kann man mit dem Befehl 'ALPHA' das Bild auch noch
transparent darstellen lassen, wobei hier die St&auml;rke der Transparenz
mit einem Wert zwischen 0 und 255 festgelegt werden kann. So ein Effekt
kann manche PC User neidisch werden lassen. Nat&uuml;rlich wird einem auch
die M&ouml;glichkeit gegeben, das Bild immer an einer gewissen Stelle erscheinen
zu lassen, indem man die x- und y- Koordinaten bestimmt. Ebenfalls ist es
m&ouml;glich, die Geschwindigkeit der Animation zu w&auml;hlen, und die Genauigkeit
der Darstellung zu definieren. F&uuml;r OS3.5 Benutzer bietet JAnimator zus&auml;tzlich
noch eine EXECUTEWB Funktionen an, mit der man direkt Workbench Programme
starten kann. Der Autor empfiehlt aber f&uuml;r diejenigen, die mit einer &auml;lteren
OS Version arbeiten, das Freewaretool WBLoad, welches eine &auml;hnliche Funktion
innehat.
<br><br>
Eines der Highlights an JAnimator ist aber, dass man sich problemlos eigene
Animationen erstellen lassen kann, indem man eine Serie von Bildern auslesen
l&auml;&szlig;t. Gibt man z.B. pic00 an, sucht JAnimator gleich nach einem pic01, einem
pic02, pic03 uns so weiter. Auf diese Weise sucht sich das Programm selbst
die Bilder f&uuml;r eine Animation zusammen.
</td></tr></table>
<br><br>
<center><img src="../pic/janimator.jpg"></center>
<br><br>
<table width="99%"><tr><td>
<font size="3">
JAnimator ist Freeware und kommt erfreulicherweise mit Installer und optimierten
CPU-Versionen. Ein paar nette Demos zum Ausprobieren sind auch enthalten.
F&uuml;r das Darstellen der Animationen und Bilder wird Cbergraphics 3 ben&ouml;tigt,
allerdings funktionierte JAnimator bei mir auch unter Picasso96.
<br><br>
Wer schon immer mal ein paar Freunde mit seiner Workbench beeindrucken wollte
oder einfach nicht aufh&ouml;ren kann, diese zu 'veredeln', mu&szlig; JAnimator unbedingt
einmal ausprobieren.
<br><br>
Kontakt: mail:<a href="mailto:bjonte@hem.passagen.se">bjonte@hem.passagen.se</a>
<br><br>
+ Versch&ouml;nert die WB<br>
+ Transparenz Effekte<br>
+ viele Funktionen<br>
+ Benutzt Datatypes<br>
+ Unterst&uuml;tzung des OS3.5 GIF Datatypes<br>
<br><br>
- Kein GUI<br>
- Langsam auf schwachen CPUs<br>
<br><br>
<b><i>Worturteil: Empfehlenswert</b></i>
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
