<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Testbericht: Joyride</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Joyride</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
&quot;Gib Gummi...&quot; - das ist das Motto des neuen Titan Computer Rennspieles &quot;Joyride&quot;.
Nach Jahren haben wir wieder einmal die Chance bekommen uns als Rennfahrer zu beweisen
und bei Joyride haben Sie die M&ouml;glichkeit, dies auf 10 verschiedenen Rennstrecken
zu testen. Doch damit Sie &uuml;berhaupt in das Auto steigen k&ouml;nnen, ben&ouml;tigen Sie noch die
richtige Ausstattung. Mit einem Amiga 1200 und 030 Prozessor, Festplatte, CD-Laufwerk
und 16 MB Ram k&ouml;nnen Sie es ja einmal versuchen, doch wir empfehlen f&uuml;r einen 
guten Spielflu&szlig; einen schnelleren Prozessor (040/060), eine Grafikkarte und viel mehr
Hauptspeicher.
<br><br>
<center><img src="../pic/joyride1.jpg"></center>
<br><br>
Leider weigerte sich die GraKa-Version bei jedem Versuch zu starten und wir mussten
notgedrungen auf die AGA Version zur&uuml;ckgreifen. Ein Anruf bei Titan Computer ergab, das
es einen Bug bei der Picasso96 Unterst&uuml;tzung gibt und das ein Patch/Update bereits 
erschienen sei, damit auch Picasso96 Nutzer mit Grafikkarte spielen k&ouml;nnen. Den 
genannten Patch allerdings fanden wir weder im Aminet, noch auf der WebSite von 
Titan Computer. Also... wieder zur&uuml;ck zu den (AGA) Anf&auml;ngen.
Joyride wird durch ein kurzes Intro eingeleitet, das sehr gut gerendert wurde, ob 
allerdings das st&auml;ndige Flackern des Bildschirms ein Feature oder ein Bug war, 
konnten wir nicht feststellen.
<br><br>
<center><img src="../pic/joyride2.jpg"></center>
<br><br>
Wie anfangs erw&auml;hnt gibt es 10 verschiedene Rennstrecken und Landschaften, so k&ouml;nnen Sie
in der W&uuml;ste fahren, bei Nacht oder am Tag oder auch auf einer normalen Landstra&szlig;e.
Insgesamt gibt es 6 Fahrzeuge zur Auswahl, wobei ein Spieler bis zu 3 Wagen nutzen kann.
Von der genannten unterschiedlichen Fahrphysik haben wir allerdings nichts gemerkt. Joyride
enth&auml;lt einen 2 Spielermodus, ein &quot;BestLap&quot; Rennen, bei dem man um die schnellste Runde
f&auml;hrt und ein &quot;All-Time&quot; Rundenrekord. Die Strecken wurden unter anderem mit kleinen
&quot;Fallen&quot; versehen, z.B.: Wasser auf der Stra&szlig;e, und an den Seiten sieht der aufmerksame
Fahrer auch mal eine Werbewand mit dem Amiga Boing Ball.
<br><br>
<center><img src="../pic/joyride3.jpg"></center>
<br><br>
Technisch wei&szlig;t Joyride leider allerhand Fehler auf, was wir sehr bedauern, denn die Idee
ist wirklich gut. Doch da gibt es das Flackern des Bildschirms, oder aber auch Grafikfehler.
Zum Beispiel wurde bei unserem Test weder das Lenkrad, noch das Tachometer oder der Drehzahlmesser
angezeigt. Stattdessen gab es einen schwarzen Balken oder im schlimmsten Fall sogar die Grafik der
Rennstrecke in diesem Bereich zu sehen. Weiterhin reagierten einige Men&uuml;s (u.a. das &quot;Continue&quot;-Men&uuml;) nicht richtig
auf die Mausklicks und ab und zu warten man vergebens auf den Start des Spieles, doch bis auf den
Loading-Screen passierte nichts. Die Steuerung ist zwar nicht schlecht, hakt aber doch des &ouml;fteren
und kann in ernsten Situationen durch ihre Schwerf&auml;lligkeit zu akutem Geschwindigkeitsverlust
f&uuml;hren. Positiv hingegen ist die Musik, doch die allein kann das Spiel nicht retten.
<br><br>
<b>Fazit: </b><br>
Leider hat Joyride technisch gro&szlig;e Probleme und kann mit alten Klassikern kaum mithalten.
Die teils gute Grafik und der Sound k&ouml;nnen zwar gefallen, doch das Gesamtbild ist leider
wenig &uuml;berzeugend. Schade, hier h&auml;tte man mehr machen k&ouml;nnen! Als Sharewareprodukt f&uuml;r ca.
30,- DM k&ouml;nnte man Joyride vielleicht empfehlen, doch zu einem Preis von 70,- DM ist es 
einfach &uuml;berteuert.
<br><br>
<table width="70%" cellspacing="0" cellpadding="0" border="0" align="center">
 <tr>
  <td colspan="3" bgcolor="#cccccc">
   <table width="100%" border="0">
    <tr>
     <td colspan="3" bgcolor="#ffffff">
      <table width="100%" border="0">
       <tr>
  <td align="left">
   <font size="3">
    <b>Grafik</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>85 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Gameplay</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/80.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>80 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Sound</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/75.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>75 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Motivation</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/70.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>70 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td colspan="3" height="15">
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="3">
    <b>Gesamt</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/75.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>75 %</b>
   </font>
  </td>
 </tr>
</table>
 </td>
  </tr>
   </table>
    </td>
     </tr>
      </table>
<br><br>
<b><i>Worturteil: Befriedigend</b></i>
<br><br>
Quelle: Titan Computer
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
