<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Messebericht: World of Alternatives</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<font size="4"><center>Messebericht</center></font>
<br><br>
P&uuml;nktlich um 10:00 Uhr wurden am Samstag morgen die Pforten zur &quot;World of
Alternatives&quot; Messe ge&ouml;ffnet und schon unz&auml;hlige User fanden sich Minuten
vorher ein. Die Messehalle, wenn man sie so bezeichenen kann, war eher ein
gro&szlig;er Saal in dem eine Vielzahl der Aussteller Ihre St&auml;nde hatten. Im
Vorraum gab es auch schon einige Aussteller, von seiten AMIGA war dort
Petra Struck (<a href="http://www.amiga-news.de">www.amiga-news.de</a>), der Amiga Club BTX, Euro Trading und
Rolf Tingler mit seinem &quot;Airbrush&quot; Stand vertreten. Im gro&szlig;en Saal befanden
sich neben Haage &amp; Partner, dem Falke Verlag, Software Seidel, APC &amp; TCP,
Epic Marketing, der Schatztruhe und DreiEinHalb Computer, auch Eternity,
Titan Computer, KDH Datentechnik, CoolBit`s und Individual computers.
<br><br>
AMIGA war mit keinem eigenen Stand vertreten, doch das war schon vorher klar,
was soll man auch gro&szlig;artig ausstellen? So auch Petro Tyschtschenko in einem
kurzen Gespr&auml;ch. Am ganzen Tag gab es diverse Vortr&auml;ge. Bill McEwen stand am
Samstag mehrmals bereit und berichtete von den AMIGA Pl&auml;nen - dazu sp&auml;ter mehr.
Neben einem Vortag von AmigaLand &uuml;ber das Erstellen eigener Homepages, stellte
Haage &amp; Partner die neuen Features von ArtEffeckt 4 vor und Andreas Kussner
zeigte die F&auml;higkeiten von seinem Wildfire 7 auf.
<br><br>
<b>Was passierte so?</b>
<br><br>
Leider hatte ich es nicht mehr geschafft einen Platz beim
ersten Vortrag von Bill McEwen zu ergattern, weshalb ich mich ersteinmal zu
einem l&auml;ngeren Gespr&auml;ch mit Martin Wolf (Eternity) begab. Er berichtete mir
von ihrem Spiel Tales of Tamar. Derzeit seien rund 80% den Spieles realisiert
und f&uuml;r alle Schaulustigen hatte Eternity einen riesigen Bildschirm aufgestellt, auf
dem jede halbe Stunde ein merhmin&uuml;tiges Video(-Animation) zu Tales of Tamar lief.
Martin Wolf verriet mir, das f&uuml;r dieses Video eigens ein neuer Player geschrieben
wurde, der allerdings noch nicht ganz fertig sei. Die Qualit&auml;t des kleinen Filmes
war wirklich fantastisch und man m&ouml;chte kaum glauben, das sowas auf dem Amiga
m&ouml;glich ist. Wer mehr &uuml;ber das Spiel, eventuell einige Screens, sehen wolle, 
der konnte sich von den vielen Mitarbeitern am Eternity-Stand informieren. Neben
der Tales of Tamar Pr&auml;sentation sa&szlig; an einem Computer Tom Neidhardt - Programmierer
von EASys - dem Amiga System Enhancer. Er erkl&auml;rte den Interessierten sein 
Programm und wer davon &uuml;berzeugt war, konnte es auch gleich erwerben. 
<br><br>
Mittlerweile war einige Zeit vergangen und ich versuchte einen erneuten Versuch
an Bill McEwen`s Rede teil zu haben. Und es hatte tats&auml;chlich geklappt. Zum zweiten
Vortrag ergatterte ich in dritter Reihe einen Sitzplatz. Eigentlich war es ja auch
kein Vortragsraum, in dem wir uns befanden. Genau genommen hatte man im Flur mit einer
spanischen Wand einen zus&auml;tzlichen Raum &quot;gebaut&quot; und dort circa 30-40 St&uuml;hle reingestellt.
Der Ansturm war allerdings so gro&szlig;, das viele User draussen bleiben mussten, oder auf
die unm&ouml;glichsten Ideen kamen (Ohr an die Wand halten, auf Blument&ouml;pfe klettern um so &uuml;ber
die Wand zu schauen ect.) um etwas von McEwen`s Rede mitzubekommen.
<br><br>
<b>McEwen`s Rede</b>
<br><br>
Nach mehrmaliger Nachfrage von Bill McEwen, ob denn nun alle da seien und er anfangen
k&ouml;nne, begann er mit seinem Vortrag. McEwen war sichtlich gut gelaunt und sparrte nicht
mit Scherzen. So dementierte er Ger&uuml;chte, das AMIGA in finaziellen N&ouml;ten sei, er ist
schlie&szlig;lich erster Klasse nach Deutschland geflogen und wird die R&uuml;ckreise ebenso 
bestreiten. Nach einer kurzen Einf&uuml;hrung gab er bekannt das zwei neue Mitarbeiter in
K&uuml;rze bei Amiga anfangen werden. Einer davon ist Dean Brown, der sich um die Entwicklung
der Hardware k&uuml;mmern wird. Den Namen des anderen neuen Mitarbeiters wollte McEwen noch nicht
verraten. Er gab nur einen kleinen Hinweis der f&uuml;r einiges Gel&auml;chter im &quot;Vortragsraum&quot; sorgte.
Mit dem Kommentar, dass der neue Mitarbeiter derzeit noch f&uuml;r ein sehr gro&szlig;es Computerunternehmen
arbeite - das allerdings im Moment in Schwierigkeiten steckt, wusste eigentlich jeder, das es sich
hierbei nur um einen Microsoft Mitarbeiter handeln konnte:)
<br><br>
McEwen best&auml;tigte nochmals, das AMIGA zuk&uuml;nftig nur noch eine Softwarefirma darstellen wird und sich
andere Firmen um die Hardware bem&uuml;hen. Es fielen Namen wie Sun, Sony und Motorola. AMIGA wolle nur
das Betriebssystem entwickeln und das in Zusammenarbeit mit diversen Firmen (u.a. Tao-Group), doch
das waren keine direkten neuen Fakten. Voller Stolz und mit einem Funkeln in den Augen, pr&auml;sentierte
McEwen das &quot;SDK&quot;, das Software Development Kit. Es wird mit einem Handbuch ausgeliefert, das McEwen
bei einigen Fans sogar signierte und kostet an die 240,- DM im Handel. Das SDK ist derzeit noch unvollst&auml;ndich,
aber jeder User k&ouml;nne mit diesem Produkt eigene Software, oder Treiber entwickeln und somit dem AMIGA
weiterhelfen. Wer sich jetzt das SDK zulegt, der erh&auml;lt die n&auml;chsten Updates gratis - die Developer Box
wird in ca. 2 Wochen f&uuml;r Firmen und etwas sp&auml;ter f&uuml;r die User erh&auml;ltlich sein. Einen Namen hat man sich bei
AMIGA auch schon ausgedacht - zwar nicht sehr ausgefallen, aber ich glaube wir k&ouml;nnen uns an einen neuen
Rechner mit Namen &quot;AmigaOne&quot; gew&ouml;hnen. Sehr beeindruckend war auch die Demo die McEwen unter Linux dem erstaunten
Publikum vorf&uuml;hrte. Alle gezeigten Programme wurde unter Java programmiert und McEwen demonstrierte zu was das
neue OS f&auml;hig ist. Nur ein kleiner Auszug: McEwen f&uuml;gte eine Boing-Ball Animation ein, der Ball h&uuml;pfte immer h&uuml;bsch auf
dem Screen herum, dann klickte er mit der Maus auf den Ball und schmiss ihn gehn Himmel. Der Ball flog kurz hoch und
verschwand am Screenrand, bis er pl&ouml;tzlich wieder auftauchte und munter weiterh&uuml;pfte. Dann &ouml;ffnete McEwen eine Browser
(Espial) und lie&szlig; einen Boing-Ball vor und einen Ball hinter dem Browserwindow h&uuml;pfen. Den Rest zu erkl&auml;ren, w&uuml;rde 
hier etwas zu lange dauern und wahrscheinlich auch etwas unverst&auml;ndlich r&uuml;berkommen - man muss es halt Live erlebt
haben. Anschlie&szlig;end folgte noch etwas Small-Talk.
<br><br>
<b>Was gab es sonst noch so?</b>
<br><br>
VerkoSoft protzte mit vielen Spielen zu absoluten Tiefspreisen, aber es waren auch etliche Oldies dabei. Alfred Kn&ouml;tig pr&auml;sentierte
an seinem Stand den Shooter Apano Sin und lud zu einigen Testspielen ein. Vesalia bot zwar eine Menge an Hardware, doch die sehnlichst
gew&uuml;nschen PPC Karten gab es nicht. &quot;Leider wurden wir nicht beliefert...&quot;, hie&szlig; es dort und das h&ouml;rte man eigentlich an jedem Hardware
Verkaufsstand. Es ist schon eine wahre Schande, nicht eine PPC Karte ging (bis auf schriftliche Vorbestellungen) &uuml;ber den Ladentisch - gerade
auf solch einer Messe h&auml;tte man Umsatz machen k&ouml;nnen. Zwar bot Vesalia die BVision PPC f&uuml;r knapp 450 DM etwas g&uuml;nstig an, doch die Blizzard 1260/50 als Beispiel
war mit 700,- DM doch recht teuer.
<br><br>
Einen recht gro&szlig;en Stand hatte auch Messe Veranstalter &quot;Falke Verlag&quot;. Hier konnte jeder Sammler alte Ausgaben der AmigaPlus/-Future/OS erwerben, oder
aber auch einige CD-Roms f&uuml;r den Atari. Neben Thomas Raukamp und dessen Frau Nicole, war auch Nico Barbat von der AmigaPlus Redaktion vertreten. Und auch
Verlagschef Ali Guakassian war anzutreffen. Software Seidel bot viele n&uuml;tzliche Sachen f&uuml;r den Druckbereich (Patronen, verschiedene Papierarten ect.)
und bei Individual computers wurde der &quot;EasySurfer&quot; vorgestellt. KDH Datentechnik und DreiEinHalb fungierten ebenfalls nur als H&auml;ndler und hatten keine
neuen Produkte in ihrem K&ouml;fferchen. 
<br><br>
Stefan Ossowski`s Schatztruhe hatte allerhand an Software mitgebracht, so gab es die Aminet37 CD, die GlowIcon Collection, die SuperView Productivitiy Suite 2,
Photogenic, CyberGraphX4 und Digital Allmanac. Wer wollte konnte auch eine Runde WipeOut2097 spielen. APC &amp; TCP - die genau daneben ihren Stand hatten - hielten als Neuheit die Amiga Arena CD, Scene Archives#10, Digital MakeUp,
The Amiga Game Guide und Faces of Mars bereit. Aber auch &auml;ltere Produkte hatten beide H&auml;ndler mitgebracht.
<br><br>
Epic Marketing hatte f&uuml;r die Messe ja Simon the Sorcerer 2 angek&uuml;ndigt - leider war die Endversion noch nicht verf&uuml;gbar, daf&uuml;r stellte Paul Burkey sein Foundation
Gold vor. Und noch eine interessante Ank&uuml;ndigung kam von Epic. Earth 2140, ein Echtzeit-Strategiespiel, wird von Epic f&uuml;r den Amiga umgesetzt, ein Termin wurde noch
nicht genannt. Haage &amp; Partner hatten ArtEffect 4 und Amiga Writer 2 im Gep&auml;ck und wurden an Testrechnern vorgef&uuml;hrt. Weiterhin waren die bekannten Produkte ImageFX, PageStream
und Tornado 3D mit von der Partie. CoolBits war (schlechthin) nur als H&auml;ndler vertreten, doch an deren Stand befand sich auch Felix Schwarz der mir ausf&uuml;hrlich die neuen Features
von fxPaint 1.5 vorf&uuml;hrte. In unserer n&auml;chsten Ausgabe stellen wir Euch fxPaint 1.5 unter anderem vor!
<br><br>
Viel Zeit verbrachte ich auch bei Titan Computer. Dort war Heretic2 zocken angesagt und auch Exodus:The last war durfte doch flei&szlig;ig angetestet werden. Heretic2 war sehr &uuml;berzeugend und
ging bei so manchem H&auml;ndler des &ouml;fteren &uuml;ber den Ladentsich, Exodus war leider noch nicht fertig, machte aber keinen schlechten Eindruck im kurzen Testspiel. Als zweites Produkt, wurde bei
Titan Computers das Rennspiel Joyride vertrieben, das wir in unserer folgenden Ausgabe der Amiga Times testen werden. Das Titan nicht m&uuml;de wird, merkte man schon bei der neusten Ank&uuml;ndigung,
diesmal soll Soldier of Fortune f&uuml;r den Amiga umgesetzt werden. Bei SoF handelt es sich um ein 3d-Ego-Shooter, bei dem man als Elite Soldat sich nach einem missgl&uuml;ckten Einsatz befreien muss.
<br><br>
<b>Fazit:</b>
<br><br>
Etwas mit geteilter Meinung verlie&szlig; ich die World of Alternatives in Neuss. Leider hatten sich die 15 Stunden Autofahrt (An- und Abreise) nicht so gelohnt, wie ich es mir
erhofft hatte. Zuviele angek&uuml;ndigte Produkte gab es nicht, und einzig und allein der Vortrag von BillMcEwen war wirklich etwas Neues. Es war zwar nicht schlecht, doch wenn
man mit speziellen Kaufabsichten und einem prall gef&uuml;llten Geldbeutel nach Neuss f&auml;hrt und mit beiden wieder nach Hause geht, dann stimmt etwas nicht. Die PPC Boards gab es
nicht, ob wohl mit Heretic2 und WipeOut zwei PPC only Games angeboten wurden und verkauft werden wollten. "Papa Petro" steckte den Usern fleißig Werbeartikel von Amiga zu und nahm sich immer
wieder gern Zeit für ein Gespräch und auch Bill McEwen`s (unfreiwillige) Autogrammstunde wird für viele Teilnehmer in Erinnerung bleiben.
Es war (trotzalledem) sch&ouml;n und ich pers&ouml;nlich freue mich auf den neuen AmigaOne - wir werden sehen was die Zukunft bringt.
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
