<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Innovative-web Newsletter</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<font size="4"><center><b>Innovative-web Newsletter</b></center></font>
<br><br>
<b>Innovative bringt Digita(TM)-power auf den AMIGA!</b><br>
Innovative hat einen Treiber f&uuml;r Digitalkameras entwickelt, die mit dem
Digita(TM) Operating Environment laufen. &quot;Digita(TM)-enabled&quot; Digitalkameras
leisten weit mehr als alles andere, was es derzeit auf dem Markt gibt. Nicht
nur, dass Digita(TM) auf den Kameras mehrerer Hersteller zum Einsatz kommt,
sondern auch, dass diese Kameras mit Coldfire- oder PowerPC-Prozessoren laufen
und es erm&ouml;glichen, Skripte, Programme und Spiele (incl. MAME!!) laufen zu lassen,
macht diese Kameras besonders interessant. Der Hersteller von Digita(TM),
Flashpoint(TM) (<a href="http://www.flashpoint.com/">http://www.flashpoint.com/</a>) hat es sich zum Ziel gesetzt,
Digita(TM) zu dem Standard f&uuml;r Digitalkameras zu machen und setzt daher
auch auf ein standardisiertes Kommunkations-Protokoll zwischen Computer und
Kamera. Mit dem nun verf&uuml;gbaren VHI-Treiber bekommen auch AMIGA-User endlich
Zugang zu diesen faszinierenden Kameras und k&ouml;nnen mit VHI Studio geschossene
Bilder komfortabel herunterladen und weiterverarbeiten. Derzeit verf&uuml;gbare
&quot;Digita(TM)-enabled&quot; Digitalkameras sind<br>
<br>
Kodak DC 220, DC 260, DC 265, DC 290<br>
        Minolta Dimage 1500 EX, Dimage 1500 3D<br>
         HP PhotoSmart C500, C619, C912<br>
         Pentax EI-200, EI-2000<br>
<br><br>
P.S.: Digita(TM) hat in diesem Falle nichts mit den Wordworth-Entwicklern zu tun,
      sondern ist eine Produktbezeichnung f&uuml;r ein Produkt von Flashpoint(TM).
<br><br>
<b>Neue Kauf- und Verkaufsb&ouml;rse f&uuml;r VHI-Karten und -Digitalkameras</b>
Auf vielfache Nachfrage haben wir uns nun dazu entschlossen, ein Forum f&uuml;r
den An- und Verkauf von VHI-Karten und Digitalkameras zu schaffen. Dieses
ist auf der VHI Studio-Homepage unter Support zu erreichen. Dort findet sich
nun auch wieder das beliebte VHI-Forum.
<br><br>
<b>Neuer fxPAINT-Workshop online</b>
Und wieder ist ein neuer Workshop online. Diesmal dreht sich alles um die
Bildkomposition und die Benutzung des Zauberstabes. Ein Muss f&uuml;r alle
fxPAINT-Besitzer! Der Workshop findet sich von der fxPAINT-Seite aus im
Bereich &quot;Support&quot;.
<br><br>
<b>VHI-Beispieltreiber-Sourcecode online</b>
Der VHI-Standard wurde erst k&uuml;rzlich um die Unterst&uuml;tzung f&uuml;r Digitalkameras
erweitert und bereits jetzt sind drei Treiber verf&uuml;gbar. Die Erweiterungen
zum VHI-Standard sind bisher noch nicht dokumentiert und deshalb bieten wir
nun den kompletten Sourcecode zum CamEx-Treiber zum Download an, um die Ent-
wicklung weiterer Treiber zu f&ouml;rdern. Der Sourcecode l&auml;&szlig;t sich auch problemlos
als Ausgangspunkt f&uuml;r die Entwicklung von Treibern f&uuml;r Videokarten benutzen.
<br><br>
<b>VHI Studio 5.2 verf&uuml;gbar</b>
Da vor der World of Alternatives leider keine Zeit mehr war, ist das neue
Archiv erst jetzt verf&uuml;gbar. Die neue Version bietet vor allem schnelleres
MPEG-Encoding sowie Unterst&uuml;tzung f&uuml;r MPEG 2.
<br><br>
<b>Franz&ouml;sische &Uuml;bersetzung von fxPAINT</b>
R&eacute;l&eacute;c Hard- &amp; Software haben eine vollst&auml;ndige &Uuml;bersetzung der fxPAINT-
Kataloge und einem Teil unserer Homepage-Seiten ins Franz&ouml;sische vorgenommen.
Wenn Sie also eine franz&ouml;sische GUI vorziehen oder unsere Produktinformationen
auf Franz&ouml;sisch abrufen wollen, schauen Sie auch einmal auf der Website von
R&eacute;l&eacute;c vorbei.
<br><br>
EMail: <a href="mailto:info@innovative-web.de">info@innovative-web.de</a><br>
WWW:   <a href="http://www.innovative-web.de/">http://www.innovative-web.de/</a><br>
Phone: +(0)049 (0)9132/3400<br>
Fax:   +(0)049 (0)69/791247970<br>
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
