<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x03 - TCP/IP Special</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0050.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x004F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0051.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0050.html">TCP/IP Special (Teil 1 von 4)</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x003E.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x003F.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0040.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0041.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0042.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0044.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x004B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x004E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0050.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0051.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0053.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>TCP/IP Special</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Egal, ob man nur zwei Rechner verbinden m&ouml;chte,
oder mit Millionen von Computern im weltweiten Internet kommunizieren will,
&uuml;berall st&ouml;&szlig;t man auf das TCP/IP Protokoll. F&uuml;r uns
ein Grund, dar&uuml;ber eine mehrteilige Serie zu verfassen. Im ersten Teil
erf&auml;hrt der Leser die Grundlagen, in den weiteren Teilen werden wir
auf die Amiga-spezifischen Implementierungen sowie die wichtigsten TCP/IP
Applikationen f&uuml;r den Amiga eingehen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Zuerst etwas Historisches:</B></H3>&nbsp;

<BR>Im Jahr 1969 startete die DARPA (Defense Advanced Research Projects
Agency) ein Projekt zur Entwicklung eines Netzwerks, welches Computer an den
kalifornischen Universit&auml;t von Utah, dem Standford Research Institute,
Santa Barbara und in Los Angeles verbinden sollte. Diese Computer sollten an
vier sogenannte IMPs (Inter Message Processors), kleine Vorrechner, die die
Kommunikation abwickeln, angeschlo&szlig;en werden. Hierbei sollte
besonders auf folgende Punkte wert gelegt werden:<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Datennetz soll auf der aktuelle Telefontechnik basieren (2.400
bit/s), jedoch alle Merkmale eines modernen Datennetzes erf&uuml;llen (hohe
Zuverl&auml;ssigkeit, geringe Kosten u.s.w.)<BR>

<BR>Es mu&szlig;ten Protokolle entwickelt werden, die alle an den IMPs
angeschlossenen Computer trotz verschiedenster Betriebsysteme Zugriff auf
die gemeinsamen Datenressourcen erm&ouml;glichen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Als erste Host zu Host Protokolle in diesem neuen Netzwerk wurde ein
virtuelles Terminal-Protokoll (&auml;hnlich dem Telnet) und ein
File-Transfer-Protokoll (&auml;hnlich dem heutigen FTP) entwickelt.<BR>

<BR>Dieses Netzwerk, genannt ARPANET, wurde 1972 erstmals der
&Ouml;ffentlichkeit vorgestellt und damit die M&ouml;glichkeit der
Realisierung eines paketvermittelnden Weitverkehrnetzes demonstriert. Zu
diesem Zeitpunkt bestand das Netz aus 20 Paketvermittlungsknoten und 50
Hosts.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da das damals verwendete Protokoll (NCP) noch einige Probleme bereitete
(z.B. war keine gesicherte Verbindung &uuml;ber fehlerbehafteten
&Uuml;bertragungsstrecken m&ouml;glich), begannen Bob Kahn und Vincent Cerf
mit der Entwicklung der Kahn-Cerf-Protokolle. Diese sp&auml;ter in TCP/IP
umbenannten Netzwerkprotokolle sollten den Grundstein f&uuml;r das Internet
legen. Als Vermittlungsrechner wurden dabei die PDP-11 Systeme der Firma
Digital eingesetzt.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>1975 wurde die gesamte Verwaltung dieses Netzwerks der DCA (Defense
Communications Agency) &uuml;bergeben, da diese Organisation &uuml;ber
weitaus h&ouml;here Geldmittel f&uuml;r die Errichtung eines USA-weiten
Netzwerkes verf&uuml;gt.<BR>

<BR>Am 1.1.1983 ersetzte das TCP/IP Protokoll entg&uuml;ltig das alte
NCP-Protokoll und das Arpanet wurde in 2 Teile geteilt: Das eigendliche
Arpanet sollte weiteren Forschungen dienen, der andere Teil, MILNET
getauft, sollte alle milit&auml;rischen Aktivit&auml;ten
zusammenfassen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>1990 schlie&szlig;lich wurde das urspr&uuml;ngliche Forschungsprojekt
eingestellt, doch das mittlerweile unter dem Namen Internet bekannt
gewordene Computer-Netzwerk weigerte sich beharrlich, wieder in
irgendwlechen theoretischen Abhandlungen zu verschwinden. Heute ist das
Internet gr&ouml;&szlig;er denn je und umfa&szlig;t weltweit viele einzelne
kleinere Netzwerke.<BR>

<BR>Ein Zeichen des Erfolgs dieses Netzwerks ist die Verwirrung, die den
Begriff Internet umgibt: Urspr&uuml;nglich war er nur der Name des
Netzwerks, das auf dem IP (Internet Protocol) beruhte. Mittlerweile
bezeichnet er aber die Allgemeinheit der Netzwerke &uuml;berhaupt.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die F&auml;higkeiten von TCP/IP:</B></H3>&nbsp;

<BR>Urspr&uuml;nglich war TCP/IP nur dazu vorgesehen, ein Protokoll
f&uuml;r die Daten&uuml;bertragung auf &quot;l&auml;ngeren&quot;
(angefangen bei Verbindungen zwischen verschiedenen Geb&auml;uden) Wegen zu
bieten, mit dem Bekannterwerden seiner F&auml;higkeiten wurde TCP/IP aber
von immer mehr Firmen in der UNIX-Welt auch f&uuml;r LANs (Local Area
Networks), also f&uuml;r Verbindungen innerhalb von Geb&auml;uden,
eingesetzt.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Mitgrund daf&uuml;r sind die ganzen Features, die das TCP/IP Protokoll
zu bieten hat. Ein Hauptgrund f&uuml;r die Popularit&auml;t ist sicher der,
da&szlig; das Netz zur richtigen Zeit das Richtige erm&ouml;glichte:
weltweite Kommunikation. Zus&auml;tzlich bietet das Protokoll aber neben
freier Verf&uuml;gbarkeit auch weite Verbreitung auf verschiedensten
Plattformen, dadurch ist es ideal zur Vernetzung der verschiedensten
Rechner geeignet. Au&szlig;erdem ist TCP/IP ein reines Software-Protokoll,
damit ist es von der darunterliegenden Hardware v&ouml;llig
unabh&auml;ngig. TCP/IP wird zum Beispiel sowohl &uuml;ber Verbindungen
&uuml;ber ein Ethernet-LAN als auch &uuml;ber Modemverbidungen zu einem
Internet-Provider verwendet. Ein weiter gro&szlig;er Pluspunkt ist die hohe
Erweiterungsm&ouml;glichkeit. So wurde z.B. WWW, heute einer der
wichtigsten Dienste im Internet, erst in den 90er Jahren entwickelt. Zur
Zeit der Entstehung von TCP/IP war aufgrund der bescheidenen Datenraten mit
solchen Entwicklungen in keinster Weise zu rechnen.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Innenleben eines Netzwerksprotokolls:</B></H3>&nbsp;

<BR>Das TCP/IP Protokoll kann, so wie andere Netzwerkprotokolle auch, in
verschiedene Schichten zerlegt werden. Jede Schicht darf aus technischer
Sicht (mit kleinen Ausnahmen) nur mit der Schicht &uuml;ber oder unter ihr
kommunizieren. Logisch gesehen kommunizieren nur die gleichen Schichten auf
verschiedenen Rechnern miteinander.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Um diesen etwas komplizierten Sachverhalt leichter zu verstehen, kann
man sich folgenden Situation vorstellen:<BR>

<BR>Ein franz&ouml;sicher Firmenchef will einem spanischen Firmenchef ein
Fax senden. Leider spricht der Franzose kein Spanisch und (erraten) der
Spanier kein Franz&ouml;sisch. Beide haben aber (zum Gl&uuml;ck :-) einen
Dolmetscher, der neben seiner Muttersprache auch Englisch spricht.<BR>

<BR>Der Franzose diktiert also seinem &Uuml;bersetzer das Schreiben in
Franz&ouml;sich, der Dolmetscher &uuml;bersetzt es ins Englische und
schickt den Brief mittels Fax nach Spanien. Der spanische &Uuml;bersetzer
nimmt das Schreiben aus dem Fax, &uuml;bersetzt es ins Spanische und gibt
es an seinem Chef weiter.<BR>

<BR>Auch hier kann jede Schicht technisch nur mit ihrer Nachbarschicht
kommunizieren (Chef &lt;-&gt; Dolmetscher, Dolmetscher &lt;-&gt; Fax ...).
Logisch kommunizieren aber die Chefs miteinander, ebenso wie die
Dolmetscher miteinander die Nachricht austauschen.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Aber nun zur&uuml;ck zu unserem TCP/IP Protokoll.</B></H3>&nbsp;

<BR>Die unterste Schicht (eigendlich gar kein Teil von TCP/IP) bildet die
Hardware auf die ein kleiner hardwareabh&auml;ngiger Teil aufsetzt. Am
Amiga ist das fast immer ein Device in devs:networks (z.B. das A2065.device
f&uuml;r die Ethernetkarte oder das ppp.device bzw. das slip.device
f&uuml;r eine Verbindung &uuml;ber die serielle Schnittstelle).<BR>

<BR>Auf diese Schicht setzt die Netzwerk- oder Vermittlungsschicht auf. Die
Aufgaben dieser Schichten sind im wesentlichen die Wegfindung (Routing),
die Adressierung der einzelnen Ger&auml;te, die Anpassung an verschiedene
physikalische Bedingungen (z.B. die Paketl&auml;nge), sowie die
Fehlererkennung. Mehrere einzelne Subnetze k&ouml;nnen zu einem logischen
Netzwerk zusammengekoppelt werden. Dadurch ist der Aufbau von logisch
strukturierten Netzen m&ouml;glich. Dieser Bereich wird am Amiga vom
eigentlichen TCP/IP Stack abgedeckt, ebenso wie die n&auml;chste Ebene, die
Transportschicht.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Diese Schichte stellt eine transparente Datenverbindung zwischen zwei
Endsystemen zur Verf&uuml;gung. Daher ist sie f&uuml;r den Auf- und Abbau
der Datenverbindung, sowie f&uuml;r den eigentlichen Datentransfer
zust&auml;ndig. Im TCP/IP Protokoll werden zwei Mechanismen zur
Daten&uuml;bertragung unterschieden: Zum einen die &Uuml;bertragung mittels
TCP (verbindungsorientiert) oder mittels UDP (verbindungslos). Bei einer
TCP Verbindung wird sichergestellt, das alle gesendeten Packete auch
wirklich beim Empf&auml;nger einlangen, zus&auml;tzlich wird auch noch
die Reihenfolge der Pakete &uuml;berpr&uuml;ft. Bei der UDP Verbindung
werden die Daten einfach in Richtung Empf&auml;nger losgeschickt, ob und in
welcher Reihenfolge sie dort ankommen, mu&szlig; von der n&auml;chst
h&ouml;heren Schicht &uuml;berpr&uuml;ft werden.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die letzte Schicht, die eigentlich gar kein Teil vom TCP/IP mehr ist,
ist die Applikation Schicht. Hier laufen alle Programme, die im allgemeinen
als TCP/IP Programme bekannt sind, wie zum Beispiel FTP, Telnet, WWW, mail,
news u.v.a. Einige dieser Programme sind normalerweise Bestandteil des
TCP/IP Stacks, andere m&uuml;ssen extra dazugekauft werden.<BR>

<BR>Um im weltweiten Internet, mit seinen Millionen von Computer, einen
Rechner eindeutig adressieren zu k&ouml;nnen, mu&szlig; jeder Rechner mindestens
eine eigene Nummer bekommen. Diese sogenannte IP Adresse besteht derzeit
aus 4x8 Bit. Um diese Zahl etwas &uuml;bersichtlicher zu gestalten, wird sie
normalerweise in dezimaler Schreibweise mit einem Punkt nach jedem Byte
dargestellt, also in der Form aaa.bbb.ccc.ddd<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>In unserer n&auml;chsten Ausgabe werden wir uns intensiv mit den IP
Adressen besch&auml;ftigen. Wir m&ouml;chten uns den genauen Aufbau
und ihre Einteilung genauer ansehen und auch eine M&ouml;glichkeit
kennenlernen, diese schwer merkbaren Zahlenkombinationen durch einen Namen
zu ersetzen.<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#dieter">Dieter Sabathi</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0050.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0050.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x004F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0051.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
