<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x03 - Aladdin 4D</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0046.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0045.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0047.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0044.html">SiSysRTG</A> | <A HREF="0x0045.html">GeoWorld</A> | <A HREF="0x0046.html">Aladdin 4D</A> | <A HREF="0x0047.html">ARexx WebServer</A> | <A HREF="0x0048.html">GIF-Tools</A> | <A HREF="0x0049.html">Miami 3.0</A> | <A HREF="0x004A.html">U.A.E.</A> | <A HREF="0x004B.html">R.T.F.M.</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x003E.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x003F.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0040.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0041.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0042.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0044.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x004B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x004E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0050.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0051.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0053.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Aladdin 4D V5.0 - StarshipTroopers am Amiga???</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Im Kino konnte ich mich ja &uuml;ber so viel Bugs
k&ouml;stlich am&uuml;sieren, bei einer teuren und ernstgemeinten
Anwendersoftware kann ich mich f&uuml;r diese Biester jedoch nicht
begeistern, noch dazu, wo sie geh&auml;uft vorkommen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Wunderlampe unter den Renderern verspricht uns NovaDesign mit
dieser neuen Version. Was es mit dem Inhalt der &quot;Flasche&quot; auf
sich hat, mu&szlig;te sich aber erst beweisen.<BR>

<BR>Dabei gab es allerdings lange nichts, was sich beweisen lie&szlig;e,
denn ich hatte massive Probleme, das Ganze zum Laufen zu bekommen. Einfach
anstarten ging zwar meistens, doch verhielt sich der Renderer sehr
instabil, und zeigte absolut keine Freude daran, auch nur irgendetwas zu
berechnen.<BR>

<BR>Irgendwann habe ich dann die Screens nicht mehr auf meiner PicassoII
mit Picasso96 V1.36 aufgemacht, sondern auf normalen PAL-Screens. Dabei hat
sich das Verhalten merklich gebessert, und ich konnte damit anfangen, die
Beispiel-Szenen rechnen zu lassen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Doch von Anfang an...</B></H3>&nbsp;

<BR>Man bekommt eine Kartonschachtel, in der sich ein echt dickes,
richtiges Handbuch und die 5 Disketten befinden. Die Installation bietet
jedoch schon die ersten Ver&auml;rgerungen und reizt massiv zum Fluchen:
Denn wieso, bittesch&ouml;n, ersetzt der Installer ungefragt zwei Libraries
in meinem System? Noch dazu, ohne zu schauen, ob nicht vielleicht eine neuere
Version davon schon im System enthalten ist. Nein, es wird einfach munter
drauflos kopiert.<BR>

<BR>Das Zweite, nun fast schon Str&auml;fliche, ist, da&szlig; auch einfach
ohne zu fragen, ein Programm in die WBStartup hineinkopiert wird. Bis jetzt
konnte ich aber noch nicht viel mit diesem Programm anfangen, es soll dazu
da sein, eine Art Clipboard f&uuml;r Bitmaps zwischen verschiedenen
Programmen zu bieten, mir ist allerdings au&szlig;er Aladdin noch keines
untergekommen, da&szlig; dieses Feature unterst&uuml;tzte. Umso
erstaunlicher sind diese sonderlichen InstallPraktiken. Macht schon mal
keinen guten Eindruck.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Des Unheils grotesker Lauf...</B></H3>&nbsp;

<BR>Die diversen mitgelieferten Beispiele lassen sich grunds&auml;tzlich
ohne Probleme durchrechnen. Auch auf meinem 2000er, der mit 16MB RAM
f&uuml;r Rendering eigentlich schon mager best&uuml;ckt ist, kommt man bis
zum Ende und erh&auml;lt dann auch das mehroderminder Gew&uuml;nschte.
Dabei kann man auch ausw&auml;hlen, ob man nur eine Vorschau rechnen lassen
will, er einen Frame der Animation rendern oder die ganze Anim rechnen
soll. F&uuml;r jede dieser Einstellungen l&auml;&szlig;t sich ein eigener
Screenmode ausw&auml;hlen.<BR>

<BR>Versucht man dann zum Beispiel im HAM-Modus eine Animation
durchzurechnen (einfacher Springbrunnen zur Demonstration der
Partikeleffekte), so f&auml;llt auf, da&szlig; beim Anzeigen der Bilder
w&auml;hrend dem Rendern, die Farben der Workbench unpassend durchgreifen
und so mitten in Grauverl&auml;ufen auf einmal rote Zerrstreifen drinnen
vorkommen. Problematischerweise sind die nicht nur in den Kontrollbildern,
sondern auch in der fertigen Anim zu sehen. Weiterer Minuspunkt.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Auswahl der Aufl&ouml;sung und Farbtiefe f&uuml;r die Renderings
ist gew&ouml;hnungsbed&uuml;rftig: Man w&auml;hlt den Screen, auf dem die
Testbilder angezeigt werden sollen, und dadurch wird entschieden, welche
Abmessungen die fertige Animation haben wird, die man als IFF-Anim,
einzelnen 24Bit-ILBMs und noch ein paar andere Formaten abspeichern
kann.<BR>

<BR>Das n&auml;chste Problem l&auml;&szlig;t aber nicht lange auf sich
warten, denn schon beim Filerequester wartet die n&auml;chste H&uuml;rde
auf den leidgeplagten User: dieser eigene Code (in einem externen Modul
support/filereq untergebracht) ist n&auml;mlich zuf&auml;lligerweise sehr
gerne an der Seite seines gro&szlig;en Bruders, des Renderers, n&auml;mlich
im Nirvana, sprich er semmelt des &Ouml;fteren.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Es ist m&uuml;hsam. Denkt man, man kann sich endlich zur&uuml;cklehnen,
und dem Amiga beim Arbeiten zusehen, wird man schon wieder aus dem Schlaf
gerissen: kann Aladdin aus welchen Gr&uuml;nden auch immer den RenderScreen
nicht &ouml;ffnen, kommt brav eine Fehlermeldung, doch das Programm
st&uuml;rzt danach mit 90%iger Wahrscheinlichkeit ab.<BR>

<BR>Es ist ja nicht so, da&szlig; auf meinem System kiloweise Hacks und
Patches installiert w&auml;ren, trotzdem ist Aladdin nicht der Stabilsten
einer. Selbst auf einem neuformatierten 2000er mit Blizzard2060 drinnen und
nacktem System (Kick/WB 3.1) kommt es zu diesen v&ouml;llig unmotivierten
Crashes selbst auf PAL- oder NTSC-Screens.<BR>

<BR>Interessanterweise habe ich auch keine M&ouml;glichkeit gefunden, die
Aufl&ouml;sung und Farbtiefe der zu rechnenden Animation manuell
einzustellen. Hat man also keine Grafikkarte in seinem System, kann man
keine hochaufl&ouml;senden, farbenfrohen Anims oder auch nur Einzelbilder
rechnen. Freilich kann man direkt auf die Platte rendern, das hei&szlig;t,
da&szlig; die Dateien, ohne angezeigt zu werden, abgespeichert werden, aber
dennoch mu&szlig; eine vorhandene Aufl&ouml;sung gew&auml;hlt werden, um
das Format festzulegen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Es mu&szlig; doch gehen!</B></H3>&nbsp;

<BR>Ich konnte es nicht glauben, da&szlig; so etwas m&ouml;glich sein
k&ouml;nnte, und versuchte es nochmal, auf der PicassoII Ergebnisse zu
erzielen. Einigerma&szlig;en funktionierte das Ganze, wenn man zum Rendern
keine 8bit tiefen Screens verwendet (auch alles mit weniger als 256 Farben
verwendet auf der PII ja solche Screens, funktioniert also nicht) und
daf&uuml;r das Preview aber NUR auf solchen Screens anzeigen
l&auml;&szlig;t.<BR>

<BR>Aber so einfach ist es doch wieder nicht, denn will man eine
angefangene Berechnung abbrechen, dr&uuml;ckt man einfach auf Escape.
Abgebrochen wird die Berechung, aber auch alle anderen Tasks, denn man
findet sich reproduzierbar wieder mal im Guru-Land.<BR>

<BR>Irgendwo gibt es auch wen, der nicht ganz mitgedacht haben d&uuml;rfte.
Denn wenn man w&auml;hrend dem Rendern abbricht, erscheint, wenn man
Gl&uuml;ck hat, ein Requester, der fragt, ob man wirklich abbrechen will.
Diesen Requester kann man allerdings in den Hintergrund klicken. Das
Bl&ouml;de ist nur, da&szlig; er dann hinter dem Fenster ist, in das
hineingerendert wird, und dieses Fenster hat die Gr&ouml;&szlig;e des
Screens, ist ohne Titelzeile, ohne Gadgets und kann somit weder
verschoben, verkleinert, noch in den Hintergrund geklickt werden. Dieser
Requester ist dann also nur mehr durch Reset zu beantworten.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Mit 320 Pixeln in der Breite kann man sich Previews zwar berechnen
lassen, man wird aber keine Freude damit haben, denn es &auml;hnelt dem
Gew&uuml;nschten nur entfernt, mindestens 640 Pixel in der Breite
m&uuml;ssen wohl sein, damit auch am Bild was erkannt werden kann., doch
zum Rendern mu&szlig; man mal kommen, denn hat man die dctv.library, die
zuerst so unvesch&auml;mt ins LIBS: kopiert wird, wieder aus dem System
entfernt, l&auml;&szlig;t sich Aladdin nicht mehr starten, auch wenn man
noch gar nie ein DCTV gesehen hat. Ich brauche jetzt wohl nicht unbedingt
zu erw&auml;hnen, da&szlig; ich bei dieser Gelegenenheit einen Reset machen
durfte?<BR>

<BR>Lobenswerterweise wird beim Rendern rechts unten im Bild angezeigt, bei
welchem Frame gerade gerechnet wird, wiviel Zeit daf&uuml;r gebarucht wird
und wieviel Zeit bis zum wahrscheinlichen Rechenende noch n&ouml;tig sein
wird. Auch hier wieder diese Kleinigkeiten: ist der aktuelle Frame einer
der ersten 99, rutscht die Anzeige zu weit nach rechts und Teile der Zeiten
sind nicht mehr zu lesen.<BR>

<BR>Ich nahm an, da&szlig; diese Texte wohl nur der Information dienen,
doch nein, es passierte mir, da&szlig; diese Text dann auch in der fertigen
Animation zu sehen waren. Ich vermute, da&szlig; dies dadurch passierte,
da&szlig; ich nebenbei meinen Amiga noch f&uuml;r was anderes verwenden
wollte, wof&uuml;r hat man denn Multitasking, und dabei mich durch die
Screens geklickt habe. Irgendwann d&uuml;rfte ich auch das Renderfenster
aktiviert haben und dabei scheint es passiert zu sein, ich kann dieses
Verhalten so allerdings nicht best&auml;tigen.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Resum&eacute;e:</B></H3>&nbsp;

<BR>Ich tu' mir jetzt schwer, etwas Aussagekr&auml;ftiges dazu zu sagen,
denn ich hatte nicht wirklich viel Zeit, mich mit dem Programm selber zu
besch&auml;ftigen. Ich hoffe aber, den Resistenten doch noch z&auml;hmen zu
k&ouml;nnen, um dann in der n&auml;chsten Ausgabe die angeblich nicht zu
verachtenden F&auml;higkeiten dieses Rendering-Paketes untersuchen zu
k&ouml;nnen.<BR>

<BR>Aus diesem Grunde entf&auml;llt hier auch die Bewertungsbox.<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0046.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.novadesign.com/">NovaDesign</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0045.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0047.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
