<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x03 - Ariadne</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0042.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0041.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0043.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0042.html">Ariadne</A> | <A HREF="0x0043.html">ConneXion</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x003E.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x003F.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0040.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0041.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0042.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0044.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x004B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x004E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0050.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0051.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0053.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Ariadne</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Man k&ouml;nnte sagen, bei der Ariadne handelt es sich
um eine Netzwerkkarte von Format. Diese Aussage ist aber etwas zu
relativieren, da sie leider nicht auf breitgestreute Konkurrenz
zur&uuml;ckgreifen kann. Au&szlig;erdem ist sie derzeit nicht lieferbar.
VillageTronic ist aber dabei, eine v&ouml;llig neue Ariadne zu entwickeln.
</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Es ist erfreulicherweise relativ unergiebig, Berichte &uuml;ber
Steckkarten f&uuml;r den Amiga zu schreiben: Packerl ge&ouml;ffnet, Karte
entnommen, in den Amiga gesteckt, eingeschaltet, geht!<BR>

<BR>So auch bei der Ariadne, die hier bei mir in meinem lokalen Netzwerk
brav ihren Dienst verrichtet. Dennoch ist es gerade bei der Vernetzung von
Computern nicht unbedingt gesagt, da&szlig; alles so reibungslos
abl&auml;uft. Die richtige Verkabelung spielt da eine nicht unwesentliche
Rolle. Bei der Ariadne kann man diesbez&uuml;glich zwischen Koaxkabel und
TwistedPair-Verbindungen w&auml;hlen. F&uuml;r die Standardkonfiguration
vieler, die ein Netz zu Hause aufbauen, reicht ein T-St&uuml;ck und ein
St&uuml;ck BNC-Kabel zur Verbindung mit dem n&auml;chsten Computer im Netz,
und schon kann der Amiga mit den Bits anderer spielen. Eine
TwistedPair-Verbindung zum n&auml;chsten Hub ist aber genauso
m&ouml;glich.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Es wird installiert und konfiguriert...</B></H3>&nbsp;

<BR>Doch mit dem (reibungslos m&ouml;glichen) Einbau der Karte allein ist
es noch nicht getan: damit kann der Amiga noch nicht ins Netz. Es mu&szlig;
noch Software installiert werden. Auf der mitgelieferten Diskette befinden
sich die ganzen Treiber, die mittels Installer schnell in die richtigen
Verzeichnisse kopiert werden.<BR>

<BR>Am Essentiellsten dabei ist sicher das Sana-II Device namens
ariadne.device, ohne da&szlig; der TCP/IP-Stack, wie AmiTCP oder Miami
(siehe dazu auch der Beginn unserer <A HREF="0x0050.html">Netzwerkspecials</A> ab dieser Ausgabe),
keine M&ouml;glichkeit hat, die Karte zu erkennen.<BR>

<BR>Unter AmiTCP m&uuml;ssen dann noch die entsprechenden Files in der
Database angepa&szlig;t werden; je nach Version der Treiberdiskette, von
der es Updates auf der VillageTronic-Homepage gibt, erledigt das der
Installer gleich mit, oder es mu&szlig; von Hand durchgef&uuml;hrt werden.
Das ist aber nicht so aufwendig: Im File AmiTCP:db/Interfaces mu&szlig;
eine Zeile stehen, die folgenderma&szlig;en aussieht:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>ariadne DEV=DEVS:Networks/ariadne.device UNIT=0
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Dieses Device sollte aber auch entsprechend konfiguriert werden. Dazu
gibt es ein File ENV:Sana2/ariadne0.config (0 f&uuml;r die erste Ariadne im
Computer, man kann ja auch mehrere einbauen und dann mit seinem Amiga
Router spielen, geht alles!), in dem zumindest stehen mu&szlig;, welches
Netzwerk verwendet wird. Die Auswahl bel&auml;uft sich auf 10BASE2
(f&uuml;r den Koax-Anschlu&szlig; mit BNC-Steckern) und 10BASET f&uuml;r
den TwistedPair-Anschlu&szlig; mit Western-Steckern.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das File AmiTCP:bin/startnet braucht diesen Eintrag:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR><TT>AmiTCP:bin/ifconfig ariadne 192.168.1.1 192.168.1.255</TT>
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>wobei die erste IP-Adresse die IP-Adresse des Amigas sein mu&szlig;.
Meistens sind diese Zeilen aber bereits in der Standardkonfiguration von
AmiTCP enthalten.<BR>

<BR>Nach einem Neustart des TCP-Stacks (dazu braucht KEIN Reset gemacht
werden, es gen&uuml;gt ein stopnet (falls das Netzwerk schon l&auml;uft)
und ein folgendes startnet, um die &Auml;nderungen wirksam zu machen.) kann
auf das neue Interface zugegriffen werden. H&auml;ngen andere fertig
konfigurierte Rechner am Netz kann mit einem ping &uuml;berpr&uuml;ft
werden, ob soweit auch alles funktioniert.<BR>

<BR>Geht das, funktioniert auch ein ftp, telnet, nfs-client oder die ganzen
anderen sch&ouml;nen Sachen, die mit Netzwerken so m&ouml;glich sind.
Schlie&szlig;lich sind wir Amiga-User mittlerweile auch mit DOOMs
&quot;gesegnet&quot;, und da gibt es ja auch diese Netzwerkfunktion dabei.
Ich denke, die werden wir uns im Laufe des Netzwerkspecials auch noch
einmal genauer ansehen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>En voyage...</B></H3>&nbsp;

<BR>Da es bis heute am Amiga nur einen einzigen NFS-Daemon (kommerzielle
Version) gibt, und der nicht weit verbreitet ist, tut man sich nach wie vor
ziemlich schwer, die Ressourcen des Amigas anderen Rechnern im Netz
freizugeben. Mittels Samba geht das zwar, allerdings auch nur zu PCs auf
denen ein Windows l&auml;uft. Eine UNIX-Maschine kann damit nichts
anfangen.<BR>

<BR>Damit zumindest Amigas untereinander ihre Daten auf die Reise schicken
k&ouml;nnen, wurde Envoy programmiert. Das ist eine Umgebung, in der
Amigas, ganz wie unter NFS auch, ihre Platten anderen Amigas zur
Verf&uuml;gung stellen k&ouml;nnen. Envoy hat eine graphische
Oberfl&auml;che implementiert, mit der das Importieren und das Exportieren
nicht nur leichtf&auml;llt, sondern in der auch alle Parameter eingestellt
werden k&ouml;nnen. Als grundlegende &Uuml;bung ist der Import erst durch
Passworteingabe m&ouml;glich, es kann auch nur ein lesender Zugriff
gestattet werden, oder, wenn man es denn w&uuml;nscht und erlaubt, kann der
andere Rechner volle Gewalt &uuml;ber die Platte in einem anderen Rechner
bekommen, nat&uuml;rlich mit den damit verbundenen Risiken, da&szlig; bei
unsachgem&auml;&szlig;er Benutzung schon mal ein paar Daten den Jordan
hinuntergehen k&ouml;nnen.<BR>

<BR>Es erwies sich auch zum Beispiel als nicht ratsam, seine Daten
&uuml;ber das Netz zu moven: es waren m&uuml;hsam errechnete
Anim-Einzelbilder, die verschoben werden sollten, doch sie kamen nie am
anderen Rechner an und lokal waren sie dann l&auml;ngst gel&ouml;scht. Doch
sowas kann in jedem Netzwerk passieren, das begr&uuml;ndet sich auf dem
Prinzip, wie die Protokolle zur Netzwerkkommunikation aufgebaut sind. In
der Regel ist es jedoch nicht so, da&szlig; laufend irgendetwas nicht
funktioniert, eigentlich funktioniert so ein Netz am Amiga dauernd.<BR>

<BR>Die Verwaltung der entsprechenden User und auch Groups ist mit Envoy
ganz einfach in Fenstern m&ouml;glich, was doch einen hohen Bedienkomfort
erm&ouml;glicht.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Und die Kompatibilit&auml;t???</B></H3>&nbsp;

<BR>Die direkte Konkurrenz-Karte zur Ariadne, die Connexion, kann man in
einem Modus betreiben, in dem sie sich wie die A2065, der
Original-Ethernet-Karte von Commodore, verh&auml;lt. Bei der Ariadne geht
das nicht, aber das ist auch gar nicht n&ouml;tig, denn sowohl AmiTCP, als
auch Miami k&ouml;nnen nat&uuml;rlich auf das KartenDevice konfiguriert
werden und damit l&auml;uft dann alles vorz&uuml;glich.<BR>

<BR>Im System verh&auml;lt sich die Karte absolut unauff&auml;llig, sie ist
einfach da. Vom AutoConfig-Bereich nimmt sie sich auch nur die 64K, und
nicht mehr, die Einbindung verl&auml;uft nat&uuml;rlich ohne Probleme (waer
ja noch sch&ouml;ner, wenn am Amiga auf einmal keine AutoConfig
funktionieren mehr w&uuml;rde) und 4 sch&ouml;ne LEDs auf der Karte geben
dar&uuml;ber Auskunft, was gerade am Netz passiert. Eine LED zeigt dabei
an, ob Daten vom Amiga ins Netz gehen, eine weitere LED l&auml;&szlig;t
ankommende Daten erkennen und die dritte sollte eigentlich nur aufleuchten,
wenn es Kollisionen am Netz gibt. nach l&auml;ngerem Gebrauch der Karte in
verschiedensten Konfigurationen und verschiedensten Netzen sind wir
allerdings zum Schlu&szlig; gekommen, da&szlig; diese LED einfach immer
mitleuchtet, auch wenn es zu gar keinen Kollisionen kommt. Die vierte LED
ist dazu da, um eine korrekte Verbindung zum Hub anzuzeigen, wenn die Karte
per TwistedPair angeschlossen ist.<BR>

<BR>Es gibt allerdings auch fr&uuml;he Ariadnes, die noch keinen
WesternStecker, bzw. eben keine Unterst&uuml;tzung f&uuml;r
TwistedPair-Verkabelungen besitzen.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>War denn sonst gar nichts mehr?</B></H3>&nbsp;

<BR>Doch, doch, das Beste kommt immer zum Schlu&szlig;: denn das eine
Netzwerkkarte die Anbindung an ein Netzwerk schafft, ist ja noch nichts so
Besonderes, aber dabei h&ouml;rt es bei der Ariadne noch nicht auf, denn es
sind au&szlig;erdem noch zwei zus&auml;tzliche Parallelports auf der Karte
mit enthalten. Hier f&auml;ngt es jetzt aber an, gefinkelt zu werden.<BR>

<BR>Mitgeliefert zu diesen Parallelports wird der Treiber ariadnepar.device,
um sie als Ersatz f&uuml;r den internen Parallelport des Amigas verwenden
zu k&ouml;nnen. Wenn ich das allerdings in meinem Amiga (B2000 Rev6.2,
GForce030@40, PicassoII, MultiFaceIII, MaestroPro, VLab SVHS, Kick/WB 3.1)
ausprobiere, steht alles. Es kommt nicht einmal ein GURU oder etwa ein
SoftwareFailure, nein es ist einfach alles blockiert, bis man einen Reset
macht. Sonderbar, denn auf allen m&ouml;glichen anderen Amigas (sogar in
2000ern mit gleicher Revisionsnummer) haben diese Ports funktioniert. Wir
sind allerdings auch noch nicht draufgekommen, woran es liegt.
VillageTronic sagte einmal vor l&auml;ngerer Zeit, da&szlig; dieses Problem
bei manchen 2000ern auftreten k&ouml;nne und man in einem der n&auml;chsten
Treiberupdates Entsprechendes einbaue, doch bis heute hat sich das nicht
ge&auml;ndert und meine Parallelports der Ariadne sind immer noch nur am
Verstauben.<BR>

<BR>Es gibt auch einen ganzen Haufen von Programmen, die nicht auf das
printer.device zugreifen, und damit nicht auf den Parallelport der Ariadne
umgelenkt werden k&ouml;nnen. F&uuml;r diese hartn&auml;ckigen F&auml;lle
ist bei der Ariadne das Programm UseAriadnePar dabei, mit dem auch solche
Aufrufe umgelenkt werden k&ouml;nnen. Greift aber irgendein obskures
Programm direkt auf die Hardware zu, ist dem eh nicht mehr zu helfen, sowas
ist nicht umlenkbar, abgesehen von der eines Amiga-Programmierers
unw&uuml;rdigen Methode...<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Paralleles Netz</B></H3>&nbsp;

<BR>Diese Parallelports k&ouml;nnen mit Liana, einer Netzwerksoftware
f&uuml;r Parallelportverbindungen von VillageTronic, dazu benutzt werden,
schnell und unkompliziert zwei Amigas per Parallelport zu vernetzen.
Daf&uuml;r ist das ariadneliana.device gedacht.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wer liest schon Handb&uuml;cher?</B></H3>&nbsp;

<BR>VillageTronic-typisch kommt das Handbuch zur Karte in Spiralbindung
daher, womit ich bisher gute Erfahrung machen konnte. Jedenfalls
zerf&auml;llt es bei Weitem nicht so schnell wie die uns&auml;glichen
Dokumentationen, die beim Kickstart3.1 dabei waren.<BR>

<BR>F&uuml;r die ganz Ungeduldigen gibt es einen CrashKurs, wie die Karte
zu installieren ist, bei dem aber wirklich nur das N&ouml;tigste
angesprochen wird, aber zwei Seiten sp&auml;ter folgt schon die detailliert
nach Rechnertyp aufgeschl&uuml;sselte Anleitung des Kartensteckens. In
diesem Kapitel kommt aber leider kein einzelnes illustrierendes Bild vor,
daf&uuml;r wird ausf&uuml;hrlich und verst&auml;ndlich erkl&auml;rt, wie
ein Ethernet aufgebaut werden soll, und was dabei zu unterlassen ist.<BR>

<BR>Weiters wird im Handbuch, das in zwei Teile (Ariadne generell und
Envoy) aufgespalten ist, per Envoy und Screenshots gezeigt, wie man den
Host konfiguriert, die IP-Adresse einstellt, Gateways definiert, Shares
freigibt und Berechtigungen erstellt. All das kommt aber auch noch mal im
Envoy-Teil ausf&uuml;hrlicher.<BR>

<BR>Nicht fehlen darf auch ein grundlegender Ethernet-Teil, der wie so
viele Texte &uuml;ber Netze mit der geschichtlichen Entwicklung
anf&auml;ngt. In diesem Kapitel habe ich auch die erste f&uuml;r Laien
verst&auml;ndliche Erkl&auml;rung des Begriffskomplexes CSMA/CD entdeckt,
man kann allerdings auch im RFC-1180 nachschauen, von dort ist es
abgeschrieben.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zur &Uuml;berpr&uuml;fung der grundlegenden Einstellungen f&uuml;r die
Karte ist das Programm SanaIIDevStat mitgeliefert, das in einem weiteren
kurzen Kapitel erl&auml;utert wird. Mit diesem Programm l&auml;&szlig;t
sich nicht nur die Ariadne n&auml;her untersuchen, es kann auf alle
SanaII-Devices eingestellt werden und erlaubt so einen gewissen
&Uuml;berblick &uuml;ber das Netzwerk zu behalten.<BR>

<BR>Des Handbuchs erster Teil ist in einem korrekten Deutsch geschrieben,
leserlich, verst&auml;ndlich und mit sinnvollem Inhalt, also alles in Allem
ziemlich brauchbar. Unter anderem wird etwas zur Fehlersuche gesagt, es
gibt eine Liste, welche Ariadne- und Netzwerk-relevanten Files in welchen
Verzeichnisses zu finden sein sollten und ein Glossar zu Begriffen um
Computervernetzung.<BR>

<BR>Im zweiten Teil f&uuml;r Envoy findet sich so einiges aus dem ersten
Teil wiederholt, aber das verwundert nicht, denn es ist das
OriginalHandbuch, wie es auch zu den Standalone-Versionen von Envoy
mitgeliefert wird.<BR>

<BR>Hier erf&auml;hrt man das Meiste, was man zur Installation und zum
Betrieb dieser NetzwerkVerwaltungssoftware wissen mu&szlig;.<BR>

<BR>Damit ist es m&ouml;glich, die n&ouml;tigen Konfigurationseinstellungen
f&uuml;r den lokalen Host vorzunehmen, damit man Verzeichnisse und Drucker
exportieren und importieren kann, User und Groups erstellen, sowie
Berechtigungen vergeben kann.<BR>

<BR>Abgeschlossen wird das Ganze mit kurzen Erkl&auml;rungen zur
Gateway-Konfiguration, Einrichten eines Realm-Servers f&uuml;r
gr&ouml;&szlig;ere Netze, sowie der Auflistung bekannter Fehler, &quot;die
zwar &auml;rgerlich sind, aber gl&uuml;cklicherweise den normalen Einsatz
der Software nicht behindern&quot;. Es geht eigentlich nur darum, da&szlig;
manche Einstellungen erst nach einem Reset aktualisiert werden, bzw. manche
Logins fehlschlagen k&ouml;nnen.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Resum&eacute;e</B></H3>&nbsp;

<BR>Eine Karte wie die Ariadne ist in der heutigen Zeit, in der ein
Computer schon einsam wird, wenn er nur ein paar Millisekunden nicht mit
fremden Bits umsp&uuml;lt worden ist, absolut essentiell und somit ist
deren korrekte Funktion auch umso wichtiger. Hier kann sie aber voll
punkten und ihren Dienst wie vorgesehen problemlos erf&uuml;llen. Da&szlig;
die Parallelports f&uuml;r den Drucker nicht funktionieren, ist dagegen
schon ein gr&ouml;&szlig;eres &Uuml;bel. Dennoch ist dieser Karte in gutes
Zeugnis auszustellen.<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=98 HEIGHT=10 ALT="[98]"><IMG SRC="../images/_box_black.gif" WIDTH= 2 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=70 HEIGHT=10 ALT="[70]"><IMG SRC="../images/_box_black.gif" WIDTH=30 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=99 HEIGHT=10 ALT="[99]"><IMG SRC="../images/_box_black.gif" WIDTH= 1 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=50 HEIGHT=10 ALT="[50]"><IMG SRC="../images/_box_black.gif" WIDTH=50 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0042.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/">VillageTronic</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0041.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0043.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
