<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x03 - SiSys RTG</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0044.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0043.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0045.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0044.html">SiSysRTG</A> | <A HREF="0x0045.html">GeoWorld</A> | <A HREF="0x0046.html">Aladdin 4D</A> | <A HREF="0x0047.html">ARexx WebServer</A> | <A HREF="0x0048.html">GIF-Tools</A> | <A HREF="0x0049.html">Miami 3.0</A> | <A HREF="0x004A.html">U.A.E.</A> | <A HREF="0x004B.html">R.T.F.M.</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x003E.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x003F.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0040.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0041.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0042.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0044.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x004B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x004E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0050.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0051.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0053.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Sisys RTG 2.5</B></FONT></H1>&nbsp;

<BR><IMG WIDTH=81 HEIGHT=69 SRC="../images_03/sisys_back.gif" ALT="[Backbuttons]" ALIGN=RIGHT HSPACE=10>
<FONT SIZE="+1">Mit dieser Software von der englischen Firma HiQ
Limited soll es m&ouml;glich sein, einen Amiga und einen PC (Windows 95 oder
NT) so zu verschmelzen, da&szlig; sie wie ein Rechner erscheinen. Sie
sollen sich Tastatur, Maus, Laufwerke und den Bildschrm teilen.</FONT><BR CLEAR=ALL>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Auf der R&uuml;ckseite der Verpackung wird &uuml;ber die
M&ouml;glichkeiten des Systems geschw&auml;rmt und auch &uuml;ber die noch
glorreichere Zukunft. Im Inneren findet man dann zwei Disketten, eine
f&uuml;r den Amiga und eine f&uuml;r den PC, einen Hardware-Dongel, der auf
die parallele Schnittstelle des PC gesteckt werden mu&szlig;, eine
Registrierkarte und ein Handbuch, falls man diese zusammengehefteten A4
Seiten schon als solches bezeichnen darf.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>F&uuml;r die Verbindung zwischen Amiga und PC ist nichts im
Lieferumfang enthalten. Diese kann auf zwei Arten hergestellt werden:
Direkt &Uuml;ber die seriellen Schnittstellen der beiden Rechner oder
&uuml;ber TCP/IP. Am besten ist, man verwendet die zweite die Methode
mittels Ethernet-Karten, da sie die schnellere ist. In diesem Fall setzt
das Sisys auf die f&uuml;r den Amiga verf&uuml;gbaren TCP/IP
Protokoll-Stacks wie AmiTCP oder Miami auf, welche aber nicht im
Lieferumfang enthalten sind.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>So jetzt aber zur Praxis. Wir wollen die beiden Rechner mittels
Ethernet verbinden. Als Protokoll-Stack soll I-Net 225 zum Einsatz kommen.
Bevor man sich auf so ein Abenteuer einl&auml;&szlig;t (eine
Rechner-Vernetztung ist immer ein Abentuer), sollte man zuerst einmal
gr&uuml;ndlich das Handbuch lesen. Aber dieses macht alles andere als einen
guten Eindruck. Es ist nicht ausf&uuml;hrlich genug und liest sich eher wie
eine Werbebrosch&uuml;re f&uuml;r das Produkt.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Es steht zumindest soviel drinnen, da&szlig; man zuerst einmal mittels
des Programmes ping, welches Teil jedes TCP/IP-Stack ist,
&uuml;berpr&uuml;fen soll, ob sich die beiden Rechner &uuml;berhaupt
erreichen. Dabei wird versucht, ein Datenpaket an den entfernten Rechner zu
schicken und dieser schickt es dann wieder zur&uuml;ck. Hat man dabei schon
Probleme, dann mu&szlig; man die Dokumentation des TCP/IP-Stack zu Rate
ziehen. Andererseits, was hilft einem das, wenn hier nichts dar&uuml;ber
steht, da&szlig; das Sisys mit I-Net 255 eigentlich nicht zusammenarbeitet,
das mu&szlig; man erst durch Probieren herausbekommen. Grunds&auml;tzlich
werden offensichtlich nur AmiTCP-kompatible Stacks unterst&uuml;tzt. Sogar
Free- und Shareware-Programme wissen von den unterschidlichen TCP/IP-Stacks
auf dem Amiga und sagen einem, in der Doku, mit welchen sie k&ouml;nnen.
Gl&uuml;cklicherweise gibt es von Interworks eine bsdsocket.library
(<A HREF="http://www.iworks.com/">http://www.iworks.com</A>), die dem I-Net
225 zu einer AmiTCP-kompatiblen Socket-Schnittstelle verhilft, mit der das
Sisys offensichtlich zusammenarbeitet.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Da in meinem Fall das Netzwerk schon l&auml;nger seinen Dienst
verrichtet, konnte ich gleich mit der Installation des Sisys beginnen.
F&uuml;r die Amiga-Seite l&auml;uft die Installation zumindest &uuml;ber
den Standard Installer ab, auf der PC-Seite mu&szlig; man jedoch alles
h&auml;ndisch machen. Zumindest dieser Punkt ist einigerma&szlig;en
ausf&uuml;hrlich im Handbuch erkl&auml;rt, aber dennoch &auml;rgerlich.
Au&szlig;erdem mu&szlig; das Sytem am PC unbedingt auf Laufwerk C:
installiert werden.<BR>

<BR><CENTER><IMG WIDTH=384 HEIGHT=26 SRC="../images_03/sisys_bar.gif" ALT="[Taskbar]"></CENTER>&nbsp;

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber auch die Installation am Amiga ist trotz Installer kein Segen. Ein
Blick in das Laufwerk Workbench: nach der Installation zeigte seltsame
Ver&auml;nderungen: Dieses Loch war doch fr&uuml;her nicht da. Ich habe
doch alle Schubladen fein s&auml;uberlich angeordnet gehabt. Pl&ouml;tzlich
ist die WBStartup-Schublade nicht mehr dort wo sie hingeh&ouml;rt. Hat doch
tats&auml;chlich dieses Sisys bei der Installation das Icon f&uuml;r die
WBStartup-Schublade &uuml;berschrieben. Auch ein Blick in die Schublade
bringt Seltsames zu Tage. Es wurde nicht nur das Programm SiSysWB
hineinkopiert, sondern zus&auml;tzlich noch MagicMenu und MagicColors - Hmm.
Was soll diese Zwangsbegl&uuml;ckung, habe ich mir gedacht, und die beiden
wieder entfernt.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>So, nach dem Installieren kommen wir zur Konfiguration des Systems und
hier wird die Dokumentation wirklich d&uuml;nn. Am PC mu&szlig; man
INI-Datei-Eintr&auml;ge editieren, die jedoch nur unter der Serial
Connection beschrieben werden, obwohl man sie bei der TCP/IP-Verbindung
&auml;ndern mu&szlig;. In der Datei sisys.ini sind folgende Eintr&auml;ge
f&uuml;r TCP/IP von Bedeutung:<BR>

<BR><PRE>use_ip=1
ip_address=192.168.0.2
ip_port=5050
</PRE>&nbsp;

<BR>Der Eintrag use_ip mu&szlig; unbedingt auf 1 gesetzt werden, ansonsten
wird die serielle Verbindung verwendet. Mit ip_address wird die IP-Adresse
der anderen Seite - in diesem Fall also des Amiga - &uuml;bergegeben. Und ip_port
gibt die Port-Nummer f&uuml;r die TCP/IP-Verbindung, &uuml;ber die das Sisys
kommuniziert, an. Hier kann &uuml;blicherweise der voreingestellten Wert
5050 beibehalten werden.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Auf der Amiga-Seite kann die Konfiguration &uuml;ber ein eigenes
Prefs-Programm abgewickelt werden. Jedoch zeigt sich dabei eine
Inkompatibilit&auml;t mit der datatypes.library V45.4. Ist diese
installiert, st&uuml;rzt das Prefs-Programm grunds&auml;tzlich nach dem
Verlassen ab und &uuml;bernimmt zu allem &Uuml;berdru&szlig; dabei auch
nicht die eingestellten Werte. Mit der originalen datatypes.library (V40.6)
tritt dieses Problem nicht auf. Auf welcher Seite die Schuld liegt und
warum das Einstellprogramm &uuml;berhaupt von der datatypes.library
abh&auml;ngig ist (es gibt keine offensichliche Funktionalit&auml;t, bei der
diese Library sinnvoll erscheint), ist etwas unklar.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zum Gl&uuml;ck werden all diese Einstellwerte auf Tool-Types
abgebildet, soda&szlig; man das System dann zumindest h&auml;ndisch
konfigurieren kann. Diese sind im Handbuch aber nat&uuml;rlich nirgends
beschrieben. Die relevanten Tool-Types befinden sich in zwei Programmen:
Server und Prefs. Zuerst zu den TCP/IP Tool-Types des Programmes
Server:<BR>

<BR><PRE>MODE=TCP/IP
IP_ADDRESS=192.68.0.1
IP_PORT=5050
MPC_MAXREAD=62
MCP_MAXWRITE=62
</PRE>&nbsp;

<BR>Mit MODE w&auml;hlt man den Betriebsmodus Serial oder TCP/IP. IP_ADDRESS
gibt die IP-Adresse des entfernten Rechners, in dem Fall also des PC, an und
IP_PORT ist wieder die Port-Nummer, welche unbedingt die gleiche sein
mu&szlig; wie die, die am PC angegeben wurde. Die restlichen zwei Parameter
betreffen die Gr&ouml;&szlig;e irgendwelcher maximaler Schreib- und
Leseblockgr&ouml;&szlig;en f&uuml;r MountPC (dem Programm, da&szlig; es
erm&ouml;glicht, vom Amiga &uuml;ber TCP/IP auf PC-Laufwerke zuzugreifen).
Diese Eintr&auml;ge werden im Handbuch nicht erw&auml;hnt, jedoch steht in
der Prefs-Oberfl&auml;che (Advanced/General), da&szlig; beide f&uuml;r
AmiTCP auf 62 und f&uuml;r Miami auf 14 eingestellt werden sollen.<BR>

<BR>Die restlichen hier nicht angef&uuml;hrten Eintr&auml;ge betreffen den
optional erh&auml;ltlichen Video-Switcher (USE_SWITCHER, SWITCHKEY) und die
Parameter f&uuml;r die serielle Kommunikation (DEVICE, UNIT, BAUD).<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Tool-Types des Programmes Prefs geben an, welche der
Dienstprogramme automatisch beim Start des Sisys gestartet werden sollen.
Der Server mu&szlig; immer gestartet werden, die anderen Teile sind
optional. Das Sisys wird mit folgenden Dienstprogrammen geliefert:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Server: Dieser h&auml;lt das gesamte System zusammen und mu&szlig;
immer gestartet sein.<BR>

<BR>ShareCB: Dieses erm&ouml;glich den Austauch von Texten zwischen Amiga
und PC &uuml;ber das Clipboard. Wird im Amiga ein Text ins Clipboard
kopiert, so steht dieser auch auf dem PC in dessen Clipboard zur
Verf&uuml;gung und umgekehrt.<BR>

<BR>UsePcPrinter: Erm&ouml;glich den Betrieb eines am PC angeschlossenen
Druckers vom Amiga.<BR>

<BR>MountPC: Dieses Dienstprogramm stellt die PC-Laufweke f&uuml;r die
Amiga-Seite zur Verf&uuml;gung. Dabei erscheint am Amiga ein Laufwerk
Namens PC, welches in der ersten Ebene alle am PC verf&uuml;gbaren
Laufwerke, also z.B. A,B,C, als Unterverzeichnisse enth&auml;lt. Der
umgekehrte Weg ist nicht m&ouml;glich. Die Amiga-Laufweke k&ouml;nnen also
dem PC nicht verf&uuml;gbar gemacht werden. Deshalb ist das SiSys nicht als
vollwertiger Netzwerkersatz einsetzbar.<BR>

<BR>GetTime: Damit wird die Amiga-Uhr von der PC-Uhr aktualisiert, was
f&uuml;r A1200-Besitzer ohne Echtzeituhr sinnvoll ist.<BR>

<BR>Amiga96: Damit wird auf der Amiga-Seite ein Windows 95 &auml;hnlicher
Taskbar angezeigt, &uuml;ber den man verschiedene Funktionen des Sisys
schnell erreichen kann. Damit ist es auch m&ouml;glich, PC-Programme vom
Amiga aus zu starten.<BR>

<BR>ARexx: Dieses Programm soll es ARexx-f&auml;higen Programmen am Amiga
erm&ouml;glichen, auf den Sisys Server zuzugreifen und damit Funktionen am
PC zu steuern. Jedoch gibt es im Handbuch absolut keine Information, welche
ARexx-Kommandos verstanden werden und wie der ARexx-Port hei&szlig;t. Damit
wird dieses Programm also ziemlich nutzlos.<BR>

<BR>RTG: Der RTG-Teil wird als der am mei&szlig;ten hervorstechendste Teil
des Sisys gehandelt, denn er erm&ouml;glicht es, die Bildschirmausgabe des
Amiga &uuml;ber das Netzwerk auf den PC umzuleiten. Dabei arbeitet es
&auml;hnlich wie die Grafikkartentreiber und stellt Screen-Modi zur
Verf&uuml;gung. Wird ein Programm oder die Workbench auf einem dieser
Screens ge&ouml;ffnet, dann erscheint deren Ausgabe jeweils in einem
eigenen Fenster unter Windows. Alle anderen Screens kann man nach wie vor
auf dem Amiga-Monitor darstellen. Dabei kommen auch die Tastatur und die
Maus des PC zum Einsatz. So kann der Amiga voll vom PC aus bedient werden.
Umgekehrt kann man aber auch Tastatur und Maus des Amiga verwenden und
damit am PC arbeiten und das nicht nur innerhalb der Amiga-bezogenen
Fenster, sondern in allen Windows-Programmen. Einzig die DOS-Box in Windows
kann nicht &uuml;ber die Amiga-Tastatur bedient werden, da diese
offensichtlich direkt die Hardware abfragt.<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Nat&uuml;rlich kommt es auch immer zu kleinen Inkompatibilit&auml;ten,
wenn man die jeweils andere Tastatur verwendet, da sich diese in ihren
Tasten doch erheblich unterscheiden. So mu&szlig;te zum Beispiel
festgestellt werden, da&szlig; die auf der deutschen Amiga-Tastatur
vorkommende Backslash-Taste nicht das gew&uuml;nschte Zeichen (\) bringt.
Dieses mu&szlig; man umst&auml;ndlich &uuml;ber die Tastenkombination
Ctrl-Alt-&szlig;, also &auml;hnlich wie auf einem PC, wobei hier
grunds&auml;tzlich die Kombination Ctrl-Alt f&uuml;r die fehlende
AltGr-Taste herhalten mu&szlig;, eingegeben werden.<BR>

<BR>Auch umgekehrt gibt es Probleme z.B. mit der Abbilung der linken und
rechten Amiga-Taste auf die PC-Tastatur. &Uuml;berhaupt verliert das
Handbuch kein Sterbensw&ouml;rtchen &uuml;ber die Belegung der Tasten. Man
mu&szlig; hier also wieder m&uuml;hsam selbst herumexperimentieren.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Interessant ist jedoch, wenn man die Amiga-Maus am PC verwendet,
pl&ouml;tzlich wird einem bewu&szlig;t, wie unergonomisch die seriellen
PC-M&auml;use dagegen sind. Dabei ist nicht die Form der Maus gemeint,
sondern die Rate, mit der die Daten zum Rechner geschickt werden. Die Amiga
Maus verh&auml;lt sich hier, auch wenn die Daten &uuml;ber das Netzwerk zum
PC geschickt werden m&uuml;ssen, wesentlich glatter und pr&auml;ziser. Auch
der umgekehrte Fall ist bemerkbar. Bedient man den Amiga &uuml;ber die
serielle PC-Maus, dann tritt auch hier dieses ruckelhafte bzw.
unpr&auml;zise Verhalten auf, welches weniger beschrieben werden kann, als
erlebt werden mu&szlig;.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Insgesamt gesehen ist der RTG-Teil bei all seinen Funktionen doch der
schw&auml;chste Teil des Systems, denn man kann ihn bei weitem noch nicht
als fertig bezeichnen. St&auml;ndig st&ouml;&szlig;t man auf Macken, die
einem das Leben erschweren. Deshalb kann mit dem derzeitigen Stand der
Dinge hier auch keine Empfehlung daf&uuml;r abgegeben werden, den
Amiga-Monitor abzust&ouml;pseln und nur &uuml;ber den PC zu fahren. Hier
sollen nur einige der Eigenschaften und Probleme aufgezeigt werden,
soda&szlig; sich der werte Leser von der Brauchbarkeit des RTG ein Bild
machen kann:<BR>

<BR>Die Geschwindigkeit ist mit TCP/IP &uuml;ber Ethernet, solange nicht
gr&ouml;&szlig;ere Bitmaps transferiert werden m&uuml;ssen, recht gut,
jedoch kann sie mit der Leistung einer CyberVision oder Picasso IV
Grafikkarte nicht mithalten, auch wenn einem die Werber&uuml;ckseite der
Verpackung gegenteiliges weismachen will.<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=261 HEIGHT=151 SRC="../images_03/sisys_part.gif" ALT="[Part of Screenshot]"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=261>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Hier ein kleiner Ausschnitt, der zeigt, wie sich ein Workbench Screen in eine Windows Umgebung einfügt...
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Das viel gr&ouml;&szlig;ere Problem ist hingegen, da&szlig; die
Grafikausgabe nicht vollst&auml;ndig unterst&uuml;tzt wird. So werden keine
Pulldown-Men&uuml;s angezeigt. Damit ist auch gekl&auml;rt, warum das Sisys
grunds&auml;tzlich MagicMenu in die WBStartup-Schublade kopiert hat, denn
dieses Programm ist aufgrund seiner technisch anderen Art, Men&uuml;s
darzustellen, die einzige M&ouml;glichkeit mittels des Sisys RTG
&uuml;berhaupt die Men&uuml;punkte der Workbench und Programme zu Gesicht
zu bekommen. Andererseits ist es aber auch kein Geheimnis, da&szlig; sich
MagicMenu nicht mit allen Programmen vertr&auml;gt. Von den Vorlieben des
Benutzer f&uuml;r oder gegen dieses Paket ganz abgesehen.<BR>

<BR><CENTER><A NAME="15" HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#16"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber nicht nur die Men&uuml;s machen Probleme, auch bei
Drag&amp;Drop-Operationen, also z.B beim Verschieben/Kopieren von Dateien
&uuml;ber die Workbench mu&szlig; man im Blindflug arbeiten. Die Icons
werden w&auml;hrend der Verschiebeoperation nicht angezeigt.<BR>

<BR>Weiters werden die Hintergrundmuster und Hintergrundgrafiken in
Fenstern und Screens nicht unterst&uuml;tzt. "Aber auf den
Sisys-Abbildungen sieht man doch immer diese Hintergrundmuster", wird der
eine oder andere jetzt vielleicht sagen. Das schon, aber diese k&ouml;nnen
nicht wie sonst bei der Workbench &uuml;ber die Preferences eingestellt
werden, sondern dieses Muster ist eine am PC liegende Datei. Eventuell wurde
hier dieses Verfahren gew&auml;hlt, um nicht st&auml;ndig die Bitmap
f&uuml;r diese Grafik &uuml;bers Netz oder sogar die Serielle schicken zu
m&uuml;ssen und damit die ganze Sache enorm zu bremsen. Aber auch wenn dies
der Fall ist, dann w&auml;re eine kurze Erkl&auml;rung im Handbuch
angebracht gewesen und es ist nicht duldsam, die Tatsache einfach zu
verschweigen, so wie auch alle anderen Probleme mit keiner Silbe
erw&auml;hnt werden.<BR>

<BR><CENTER><A NAME="16" HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#17"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Neben den M&auml;ngeln, da&szlig; manche Funktionen einfach nicht
unterst&uuml;tzt werden, kommt nocht die Tatsache hinzu, da&szlig; das
System nicht frei von Darstellungsfehlern ist. Das kann ganz einfach bei
der Uhr (Workbench:Utilities/Clock) erkannt werden (siehe
<A HREF="../images_03/sisys_big.png">Abbildung</A>). Auch passiert es,
da&szlig; Fensterrahmen von Icons &uuml;bermalt werden. Irgendwie f&uuml;hlt
man sich mit dem Sisys RTG in die allerersten Anf&auml;nge der
Amiga-Grafikkartenunterst&uuml;tzung zur&uuml;ckversetzt.<BR>

<BR>Ein Problem besteht auch in der Verwendung des RTG-Teiles des Sisys
zusammen mit einer Grafikkarte, da sich offensichtlich der
Grafikkartentreiber (Picasso 96) und das RTG, welche sich ja beide ins
Grafiksystem des Amiga einh&auml;ngen, st&ouml;rend beeinflussen. Dabei kann
es dann passieren, da&szlig; man bei einem Programm, das seinen eigenen
Screen aufmacht, anstelle der Programmoberfl&auml;che nur schwarz sieht.<BR>

<BR><CENTER><A NAME="17" HREF="#16"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#18"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Als Ersatz f&uuml;r eine Grafikkarte, als das das System auch oftmals
angepriesen wird, kann es in der derzeitigen Form aufgrund der gezeigten
M&auml;ngel nicht empfohlen werden. F&uuml;r die Fernsteuerung eines
Rechners ist es jedoch bereits bedingt verwendbar.<BR>

<BR>Leider funktioniert die Tastatur- und Mausumleitung von der Amiga auf
die PC-Seite nur zusammen mit dem RTG-Teil, weil daf&uuml;r ein
Amiga-Screen am PC ge&ouml;ffnet sein mu&szlig;. Umgekehrt kann jedoch
durch Anklicken des Sisys Symbols in der Startleiste von Windos 95 auf den
Amiga umgeschaltet werden. Dabei verschwindet aber die Windows 95
Oberfl&auml;che vom PC-Schirm. Diese Umst&auml;nde erlauben keinen
sinnvollen Zweimonitorbetrieb, wobei zwar jeder Rechner seinen Monitor
besitzt, aber nur eine Tastatur und Maus verwendet werden.<BR>

<BR>Wof&uuml;r das Programm ControlPC das auf der Amigaseite des Sisys
existiert, das nicht automatisch mitgestartet werden kann und auch in der
Dokumentation mit keinem Wort erw&auml;hnt ist, gut sein soll, konnte ich
beim besten Willen nicht herausbekommen. Es zeigt keine Funktion.<BR>

<BR><CENTER><A NAME="18" HREF="#17"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#19"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Getestet wurde grund&auml;tzlich nur die TCP/IP-Variante der Verbindung
zwischen den Rechnern, die Verbindung &uuml;ber die serielle Schnittstelle
kann wohl nur als Notl&ouml;sung oder f&uuml;r den Fall, da&szlig; man
&uuml;ber ein Modem arbeiten mu&szlig;, als sinnvoll angesehen werden. Von
der M&ouml;glichkeit, die Rechner &uuml;ber die SCSI-Schnittstelle zu
verbinden, wurde aufgrund der nicht nur positiven Erfahrungen mit der
TCP/IP-Schnittstelle Abstand genommen, da es mir als zu gef&auml;hrlich
erschien, beide Rechner auf die gleichen Platten zugreifen zu lassen. Auch
das sonst nicht gerade problemaufzeigende Handbuch beschreibt hier einige
Scenarien wie das unerw&uuml;nschte L&ouml;schen des RDB vom PC aus, welche
den Verdacht nahe legen, da&szlig; diese Variante nur f&uuml;r Leute
interessant sein kann, welchen die Datensicherheit nicht viel bedeutet.<BR>

<BR><CENTER><A NAME="19" HREF="#18"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#20"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Grunds&auml;tzlich betrachtet ist das Sisys wohl eine gute Sache,
jedoch leider etwas mangelhaft, schlampig und unvollst&auml;ndig umgesetzt.
Das Handbuch kann man in seiner Ausf&uuml;hrlichkeit getrost als Frechheit
bezeichnen und Online Dokumentation ist &uuml;berhaupt keine vorhanden.
Auch ein Update oder Fehlerkorrekturen waren keine auf der Sisys-Homepage
zu finden. Jedenfall kann nur bef&uuml;rwortet werden, da&szlig; HiQ
Limited das System weiter verbessert und diese Verbesserungen den
registrierten Benutzern kostenlos zukommen l&auml;&szlig;t. Besonders von
Seiten der Dokumentation ist auch noch viel zu tun. Sind die M&auml;ngel
einmal beseitigt, dann k&ouml;nnten die Einsatzgebiete, von denen im
Handbuch und der Werbung so viel geschw&auml;rmt wird, vielleicht doch
einmal wahr werden.<BR>

<BR><CENTER><A NAME="20" HREF="#19"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#FFFFFF" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Ausstattung der Testrechner:
<BR>
<BR>Amiga 4000, Amiga OS 3.0
<BR>Prozessor MC 68040, 25 MHz
<BR>2 MB Chip, 16 MB Fast RAM
<BR>1 GB, 340 MB IDE Festplatten
<BR>CyberVision 64 Grafikkarte, Picasso 96 Treibersoftware
<BR>A2065 Netzwerkkarte
<BR>I-Net 225 TCP/IP-Stack alternativ zu Miami.
<BR>
<BR>
<BR>PC, Windows 95
<BR>Prozessor Intel Pentium, 166 MHz
<BR>32 MB RAM
<BR>2 GB SCSI Festplatte
<BR>S3 Grafikkarte
<BR>Cnyx Netzwerkkarte
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=65 HEIGHT=10 ALT="[65]"><IMG SRC="../images/_box_black.gif" WIDTH=35 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=87 HEIGHT=10 ALT="[87]"><IMG SRC="../images/_box_black.gif" WIDTH=13 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=46 HEIGHT=10 ALT="[46]"><IMG SRC="../images/_box_black.gif" WIDTH=54 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=53 HEIGHT=10 ALT="[53]"><IMG SRC="../images/_box_black.gif" WIDTH=47 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=74 HEIGHT=10 ALT="[74]"><IMG SRC="../images/_box_black.gif" WIDTH=26 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH= 8 HEIGHT=10 ALT="[ 8]"><IMG SRC="../images/_box_black.gif" WIDTH=92 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=64 HEIGHT=10 ALT="[64]"><IMG SRC="../images/_box_black.gif" WIDTH=36 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0044.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.siamese.co.uk/">Siamese Homepage</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.iworks.com/">Interworks</A><BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_03/sisys_big.png">Screenshot: WB-Screen on Windows</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_03/sisys_prog.png">Screenshot: Sisys Programme</A><BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0043.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0045.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
