<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x03 - WGet</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x004C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x004B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x004D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="../images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x004B.html">A-Files: R.T.F.M.</A> | <A HREF="0x004C.html">WGet</A> | <A HREF="0x004D.html">Effizientes Programmieren (Teil2)</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x003E.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x003F.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0040.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0041.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0042.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0044.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x004B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x004E.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0050.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0051.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0053.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>WGet - Surfen einmal anders</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Teil 1</FONT><BR>

<BR>Es funktioniert einfach nicht, das Internet. Warum, soll hier nicht
n&auml;her erl&auml;utert werden, aber die einzelnen Konzepte und
Spezifikationen liegen ja offen, soda&szlig; es bei Bedarf jeder
f&uuml;r sich herausfinden kann.<BR>

<BR>Nun ist es leider doch so, da&szlig; man dort hin und wieder
brauchbare Sachen findet, die man gerne h&auml;tte. Meist hat man die
Wahl zwischen schwerf&auml;lligen, st&auml;ndig abst&uuml;rzenden,
wanzenverseuchten Elefanten (Voyager, Netscape und Schlimmeres) oder
kryptisch-minimalistischen Einzellern (Lynx und diverse
FTP-Clients).<BR>

<BR>Die w&uuml;nschenswerte L&ouml;sung des Problems, ein brauchbarer
Browser und eine vern&uuml;nftige Netzwerktechnologie, existiert der
Ansicht vieler Leute nach nicht. Rein technisch w&auml;re zwar nicht
viel dahinter, aber vorher m&uuml;sste man leider die alteingesessenen
Strukturen loswerden. Und das ist in den letzten 20 Jahren eben nicht
passiert.<BR>

<BR>Dieser Workshop beschreibt daher einen alternativen Weg mit Daten im
Netz umzugehen. Dazu wird ein Tool namens Wget verwendet. Die Idee die
dahintersteckt ist, da&szlig; Daten, die man auf der eigenen Platte hat,
in der Regel weniger &Auml;rger machen als solche in irgendwelchen
Netzwerken. Auch zeigt die Erfahrung, da&szlig; Browser wesentlich
stabiler laufen, wenn sie sich nicht um abstruse Protokolle,
&uuml;berlastete Proxys und vom Anwender falsch dimensionierte Caches
k&uuml;mmern m&uuml;ssen. (Die Probleme einer verantwortungslos
kaputtgem&uuml;llten WBStartup bleiben nat&uuml;rlich.)<BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Voraussetzungen</B></H3>&nbsp;

<BR>Wget ist im Grunde ein WWW-Browser ohne Benutzeroberfl&auml;che. Das
hei&szlig;t, man kann es nur vom CLI aus benutzen. Womit sich nun wohl
die Anzahl der Leser auf ein Drittel reduziert hat.<BR>

<BR>Zum verbliebenen Rest: Das ist durchaus der Sinn der Sache, weil die
Zielgruppe von Wget nicht der dumpf vor sich hinklickende Netscape-Fan
ist, sondern Leute, die wissen, was sie wollen.<BR>

<BR>Man sollte also schon ein paar mal Zeilen in der
<TT>s:user-startup</TT> ge&auml;ndert haben, wenn man diesen Workshop
nachvollziehen will.<BR>

<BR>Es bedarf nat&uuml;rlich einer funktionierende TCP/IP-Verbindung
nach au&szlig;en. Eine bereits existierende Netzwerkinstallation von
Miami oder AmiTCP ist daher notwendig.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Des weiteren wird angenommen, da&szlig; der Anwender in der Lage
ist, mit dem Internet halbwegs ressourcenschonend umzugehen. Mit anderen
Worten: Bevor einer 20MB saugt, sollte er &uuml;berlegen, ob er
eigentlich nicht ohnehin nur an 2MB davon interessiert ist. Auch wenn es
einer CLI-Optionen mehr bedarf, um diese zu filtern. Auch wenn es eine
halbe Minute mehr Zeit ben&ouml;tigt, um daf&uuml;r kurz diesen Workshop
oder die originale Dokumentation zu &uuml;berfliegen.<BR>

<BR>Und nicht zuletzt empfiehlt es sich, irgendein Programm zu besitzen,
das HTML-Seiten anzeigen kann. Da die Daten bereits auf der eigenen
Platte sind, braucht man nicht unbedingt einen der
&quot;gro&szlig;en&quot; kommerziellen Browser. In viele F&auml;llen
kann ein kleiner Offline-Browser wie z.B. MoreHTML vollkommen
ausreichen.<BR>

<BR>Wget ist kein reines Amiga-Tool, sondern kommt aus der Unix-Welt.
(Peng! Wieder ein paar Leser weniger.)<BR>

<BR>Mit anderen Worten: Wget ist von Haus aus so konzipiert, da&szlig;
es vollkommen unbedienbar ist. Daher wird hier an den entsprechenden
Stellen auf die diversen, aus vern&uuml;nftiger Sicht unmotivierten (um
nicht zu sagen: kranken) Besonderheiten in der Benutzung eingegangen.
Unix-Kenntnisse werden daher <EM>nicht</EM> vorausgesetzt.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Besorgung und Rechtliches</B></H3>&nbsp;

<BR>Weil das Programm unter der ber&uuml;hmt-ber&uuml;chtigten GNU
License vertrieben ist, kann man wie bei allen solchen Tools den
Quellcode von <TT>ftp://prep.ai.mit.edu/pub</TT> herunterladen.<BR>

<BR>F&uuml;r Amiga gibt es Gott sei Dank auch eine fertig compilierte
Version, die man sofort benutzen kann. Wie bei den meisten
GNU-Programmen kann man es sich von dem FTP-Server der Geek Gadgets
besorgen:
<TT>ftp://ftp.ninemoons.com/pub/geekgadgets/current/amiga-bin/</TT> Man
suche jeweils nach einem Archiv, dessen Name mit <TT>wget</TT>
beginnt.<BR>

<BR>Dort gibt es auch die ben&ouml;tigte <TT>ixemul.library</TT>.
Sinnloserweise sind f&uuml;r diese Bibliothek derzeit die Versionen
f&uuml;r alle Prozessoren in einem Archiv zusammengefa&szlig;t,
soda&szlig; man sich 2MB herunterladen darf, um dann ein paar Kilobyte
davon zu verwenden.<BR>

<BR>F&uuml;r den Anwender bedeutet die GNU License, da&szlig; ein
Programm frei kopierbar ist, und im Falle von Wget auch, da&szlig; man
es gratis benutzen kann. Details dazu in der Dokumentation des
Programms.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Installation</B></H3>&nbsp;

<BR>Nun ist es l&auml;stig, den ganzen Krempel zusammenzusuchen. Des
weiteren scheint sich momentan niemand um die Geek Gadgets Version von
Wget zu k&uuml;mmern, da dort derzeit nur die veralterte Version 1.4.2
liegt. (Alte Programmiererweisheit: Die Portierung ist meistens
einfacher als die Wartung.)<BR>

<BR>Daher gibt es gemeinsam mit dieser Ausgabe ein LHA-Archiv, in dem
sich die aktuellen Versionen von Wget (1.4.5) und ixemul.library (47.2)
befinden, jeweils f&uuml;r 68000 compiliert.<BR>

<BR>Wer bereits ein existierende Installation der 'Geek Gadgets' hat,
sollte wissen, wohin mit den Dateien in diesem Archiv.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>F&uuml;r die anderen (=meisten) folgt hier ein alternativer
Vorschlag, an dem man sich nicht zu halten braucht, wenn man wei&szlig;,
was man tut. Wer Wget mit diesen Hinweisen nicht zum Laufen kriegt,
sollte es ohnehin besser nicht benutzen, weil er damit einigen Schaden
anrichten kann.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
Quelldatei</TD><TD ALIGN=LEFT>Zielverzeichnis</TD></TR>
<TR><TD><TT>wget/c/wget</TT>               </TD><TD><TT>c:</TT>              </TD></TR>
<TR><TD><TT>wget/help/wget.guide</TT>      </TD><TD><TT>help:</TT>           </TD></TR>
<TR><TD><TT>wget/libs/ixemul.library</TT>  </TD><TD><TT>libs:</TT>           </TD></TR>
<TR><TD><TT>wget/libs/ixnet.library</TT>   </TD><TD><TT>libs:</TT>           </TD></TR>
<TR><TD><TT>wget/env/TZ</TT>               </TD><TD><TT>envarc:</TT> und <TT>env:</TT></TD></TR>
</TABLE>&nbsp;

<BR>Der Wert der Umgebungsvariable TZ stimmt f&uuml;r &Ouml;sterreich,
wer in einer anderen Zeitzone wohnt, mu&szlig; ihn eben entsprechend
&auml;ndern.<BR>

<BR>Die originale Dokumentation zu Wget befindet sich in
<TT>wget.guide</TT>. Dieser Workshop kann und will sie nicht ersetzen,
und man sollte sie sich einmal zu Gem&uuml;te f&uuml;hren.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Datei <TT>wget/usr/etc/.wgetrc</TT> verdient eine kleine
Sonderbehandlung. Dabei handelt es sich um die Konfiguration von Wget.
Beim Start wird n&auml;mlich nach einer Datei namens
<TT>usr:etc/.wgetrc</TT> gesucht. Wird keine gefunden, schadet das nicht
viel, da dann eben Standardwerte verwendet werden.<BR>

<BR>Jedoch wird ein Requester nach einem Assign oder Device namens
<TT>usr:</TT> fragen, was l&auml;stig ist. Daher empfiehlt es sich, z.B.
ein Verzeichnis namens work:usr anzulegen, und in den
<TT>s:user-startup</TT> ein<BR>

<BR><TT>
assign usr: work:usr
</TT><BR>

<BR>zu machen. Zu Guter letzt kann man dann noch <TT>.wgetrc</TT> nach
<TT>work:usr/etc/.wgetrc</TT> kopieren. Was <TT>.wgetrc</TT> genau
macht, wird im n&auml;chsten Teil erl&auml;utert, einstweilen sollten
die dort eingestellten Werte funktionieren.<BR>

<BR>Die restlichen, hier nicht angef&uuml;hrten Textdateien sollte man
sich kurz durchlesen, damit man im Bilde ist.<BR>

<BR>Wer &uuml;ber das alles mehr wissen will, kann sich einmal auf der
Homepage der Geek Gadgets umsehen.<BR>

<BR>Jetzt aber endlich zur Benutzung der Programms.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>CLI-Optionen im Allgemeinen</B></H3>&nbsp;

<BR>Jene, die &uuml;ber die Eigenheiten von CLI-Optionen <EM>unter
Unix</EM> bereits Bescheid wissen, k&ouml;nnen diese Abs&auml;tze
&uuml;berspringen.<BR>

<BR>Im Unterschied zu AmigaOS wird unter Unix bei fast allem bei der
Gro&szlig;/Kleinschreibung unterschieden - &quot;case sensitivity&quot;
hei&szlig;t das im Fachenglisch. Heutzutage wei&szlig; praktisch jeder,
da&szlig; dies ziemlich unsinnig ist, was die Benutzbarkeit eines
Systems angeht. Unixler werden jetzt aufjaulen, aber die haben auch nie
etwas von &quot;Usability&quot; geh&ouml;rt oder gar etwas dar&uuml;ber
gelesen.<BR>

<BR>Im Klartext hei&szlig;t das: Wenn man ein<BR>

<BR><TT>
wget --help
</TT><BR>

<BR>macht kriegt man eine kurze Auflistung der wichtigsten Optionen,
bei einem<BR>

<BR><TT>
wget --HELP
</TT><BR>

<BR>nur eine Fehlermeldung bez&uuml;glich &quot;unrecognized
option&quot;.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wer sich nun fragt, warum man zwei Minus Zeichen (-) vor dem
&quot;help&quot; braucht, dem sei gesagt: Derlei abartige Sachen wie in
AmigaOS, wo es eine Systemfunktion namens <CODE>ReadArgs()</CODE> zum
Lesen von CLI-Argumenten gibt, spielt es unter Unix nicht. Dort werden
solche Sachen entweder immer neu &quot;mit der Hand&quot; gemacht, oder
mittels wenig hilfreicher und konzeptionell verwurschtelten statischen
Bibliotheken wie <CODE>getopts.c</CODE>.<BR>

<BR>F&uuml;r einen Programmierer ist es dann einfacher, wenn er alles,
was mit &quot;-&quot; beginnt, als Option interpretieren kann, und den
Rest als Dateinamen, oder im Falle von Wget als URI. Mit den meisten
Unix-Programmen kann man einen Heidenspa&szlig; haben, wenn dann ein
Dateiname mit &quot;-&quot; beginnt. Zum Gl&uuml;ck tut eine URI das
selten.<BR>

<BR>Die meisten Optionen haben ein Kurz- und ein Langform. Im Falle von
<TT>--help</TT> z.B. lautet die kurze Variante <TT>-h</TT>. Man kriegt
also auch auf folgende Weise die gleiche &Uuml;bersicht wie zuvor:<BR>

<BR><TT>
wget -h
</TT><BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wenn einer so etwas liest, wei&szlig; er nat&uuml;rlich nicht mehr,
was gemeint ist. Darum wird w&auml;hrend des Workshops immer die
Langform verwendet. Tippfaule k&ouml;nnen die entsprechende Kurzform aus
der Dokumentation erfahren.<BR>

<BR>Genauso wie unter AmigaOS gibt es auch bei Wget zwei Arten von
Argumenten: solche, die nur f&uuml;r sich stehen, und solche, die einen
weiteren Parameter erwarten. Nimmt man z.B. den AmigaOS-Befehl
<TT>list</TT>, so w&auml;re <CODE>FILES</CODE> ein Beispiel f&uuml;r
erstere Gattung, und <CODE>LFORMAT</CODE> f&uuml;r zweitere.<BR>

<BR>In letzterem Falle kann (wie unter AmigaOS) der zweite Parameter
durch eine Leerzeichen oder ein &quot;=&quot; getrennt sein. Ein
<TT>--tries 20</TT> ist also gleichbedeutend mit einem
<TT>--tries=20</TT>. (Zur Bedeutung dieser Option siehe unten.)<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>FTP-Saugen</B></H3>&nbsp;

<BR>Zuerst einmal kann Wget das schlechte alte FTP. Es stellt sich die
Frage: Warum sollte man zum FTP-en ein kryptisches CLI-Tool verwenden,
wo es doch sowieso viele komfortable FTP-Programme f&uuml;r Amiga gibt.
Das ist nat&uuml;rlich richtig, und zum herumschn&uuml;ffeln in
FTP-Verzeichnisen ist Wget auch denkbar ungeeignet. Praktisch ist es
aber, wenn man ganz genau wei&szlig;, was man will.<BR>

<BR>Nehmen wir einmal an, man liest irgendwo, da&szlig; es ein
n&uuml;tzliches Haushaltsprogramm gibt, das die Funktionalit&auml;t
einer Gl&uuml;hbirne hat. Und zwar kriegt man es von:<BR>
<TT>ftp://vienna.aminet.or.at/pub/aminet/game/gag/LichtTools.lha</TT>.
<BR>

<BR>Das hei&szlig;t, man wei&szlig; ganz genau, wo es sich befindet. Nun
kann man sich nat&uuml;rlich dort einloggen, durch die Verzeichnisse
klicken und dann die richtige LHA-Datei aus einer langen Liste
ausw&auml;hlen.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Einfacher ist es aber, mit Hilfe des Clipboards im CLI
einzugeben:<BR>

<BR><TT>
wget ftp://vienna.aminet.or.at/pub/aminet/game/gag/LichtTools.lha
</TT><BR>

<BR>In der Shell sollte sich dann etwa folgendes zeigen:<BR>

<PRE>
--19:54:50--
ftp://vienna.aminet.or.at:21/pub/aminet/game/gag/LichtTools.lha
           => `LichtTools.lha'
Connecting to vienna.aminet.or.at:21... connected!
Logging in as anonymous ... Logged in!
==> TYPE I ... done.  ==> CWD pub/aminet/game/gag ... done.
==> PORT ... done.    ==> RETR LichtTools.lha ... done.
Length: 10,699 (unauthoritative)

    0K -> ..........

19:54:53 (44.65 KB/s) - `LichtTools.lha' saved [10699]
</PRE>

<BR>Je nachdem, wie lange der Download dauert, hat man nach einiger Zeit
im aktuellen Verzeichnis eine Datei namens <TT>LichtTools.lha</TT>.<BR>

<BR><CENTER><A NAME="12" HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Auf ein Neues</B></H3>&nbsp;

<BR>Nehmen wir einmal an, wir saugen gerade etwas Gro&szlig;es, z.B. das
Basis Archiv f&uuml;r NetBSD mit beachtlichen 8MB Umfang:<BR>

<BR><TT>
wget ftp://ftp.uni-regensburg.de/pub/NetBSD-Amiga/
bin-dist/bin12D-199704/base.tar.gz
</TT><BR>

<BR>Nun hat man schon 5MB gesaugt, und pl&ouml;tzlich beschlie&szlig;t
das Netzwerk einzugehen. Und die ganze halbe Stunde Warten war
umsonst?<BR>

<BR>Nicht ganz. Zwei Wochen sp&auml;ter funktioniert das Netzwerk
wieder, und die alten 5MB liegen immer noch auf der Platte. Alles, was
man jetzt zu tun braucht, ist einzugeben:<BR>

<BR><TT>
wget --continue-ftp ftp://ftp.uni-regensburg.de/pub/NetBSD-Amiga/
bin-dist/bin12D-199704/base.tar.gz
</TT><BR>

<BR>und Wget setzt dort fort, wo es vorher aufgeh&ouml;rt hat - saugt
also nur die fehlenden 3MB anstatt der vollen acht. Normalerweise
zumindest, denn leider gibt es ein paar alte FTP-Server, die dieses
Feature nicht unterst&uuml;tzen, und da bleibt dann leider nichts
anderes &uuml;brig, als wieder von vorne anzufangen.<BR>

<BR><CENTER><A NAME="13" HREF="#12"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zu beachten ist dabei, da&szlig; das alte, halbfertige Archiv in dem
Verzeichnis liegen mu&szlig;, von dem aus Wget diesesmal gestartet wird.
Soll hei&szlig;en: Wenn man unmittelbar, bevor man Wget loshetzt,
ein<BR>

<BR><TT>
list
</TT><BR>

<BR>macht, sollte man ein <TT>base.tar.gz</TT> sehen.<BR>

<BR>Eines der Features von Wget ist aber, da&szlig; obiger Fall relativ
selten eintrit. Das liegt daran, da&szlig; Wget sich von Haus aus nicht
besonders daran st&ouml;rt, wenn eine Verbindung zusammenbricht.<BR>

<BR>Zwar motzt es kurz ein bisserl herum, bricht aber nicht ab.
Schlauerweise wartet es eine gewisse Zeit, und versucht dann eine neue
Verbindung aufzubauen, die dort fortsetzt, wo zuvor etwas schiefgegangen
ist. Das hei&szlig;t, ein Netzwerkausfall im Minutenbereich tut nicht
weh.<BR>

<BR>Das ist vor allem dann praktisch, wenn man eine gro&szlig;e Datei
&uuml;ber eine instabile Verbindung holen will. Weil 23 mal ein
<TT>--continue-ftp</TT> bringt es dann irgendwie auch nicht
wirklich.<BR>

<BR><CENTER><A NAME="14" HREF="#13"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Schwaffelsperre</B></H3>&nbsp;

<BR>Wie wir bereits bemerkt haben, ist Wget Weltmeister im
M&auml;rchenerz&auml;hlen w&auml;hrend es sein Arbeit verrichtet. Ein
Beispiel f&uuml;r die Ausgabe zum Downloaden einer einzigen Datei gab es
ja bereits oben zu sehen.<BR>

<BR>Der dabei unterhaltsamste Teil sind die vielen kleine Punkterl, die
mehr werden, wenn man gro&szlig;e Archive saugt. Das ist, wie nicht
anders zu erwarten, ein alter Unix-Brauch. Begr&uuml;nden tut er sich
darin, da&szlig; in alten Zeiten die Netzwerke noch unbrauchbarer
langsam waren als heute, und daher alle aufrechten Netzwerk-Utilities
die meiste Zeit nichts besseres zu tun hatten als Punkterl zu malen.<BR>

<BR>Nat&uuml;rlich waren die Punkterl bald sehr beliebt, nicht zuletzt
weil man l&auml;ssig in ihrem Rhythmus mitklatschen konnte. Manche
Programme verwendeten auch &quot;#&quot;, welche oft - gen&uuml;gend
Daten vorausgesetzt - psychedelisch verkastelte Bildschirme lieferten.
Und wenn die Punkterl einmal stehenblieben, tat das meistens auch Herz
der geschundenen Kreatur hinter der Tastatur - also eine Art
Netzwerkpuls, die Punkterl.<BR>

<BR><CENTER><A NAME="15" HREF="#14"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#16"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Tolle Sache, aber wen interessiert das heute? Klar, die
traditionsbewu&szlig;ten Unixler, aber unsereins ist das oft ziemlich
egal. Daher m&ouml;glicherweise lieber:<BR>

<BR><TT>
wget -nv ftp://vienna.aminet.or.at/pub/aminet/game/gag/LichtTools.lha
</TT><BR>

<BR>wobei <TT>-nv</TT> f&uuml;r non-verbose steht. Man beachte das hier nur
ein Minus zu verwenden ist, weil es konsistenterweise f&uuml;r
<TT>-nv</TT> keine (dokumentierte) Langform gibt. Dann sieht man nur
noch:<BR>

<BR><TT>
20:01:52 URL: ftp://vienna.aminet.or.at:21/pub/aminet/game/gag/LichtTools.lha [10699] -> &quot;LichtTools.lha&quot; [1]
</TT><BR>

<BR>was f&uuml;r den Normalverbraucher ausreichend sein sollte. Wer
trotzdem Mitklatschen will, soll im Hintergrund eine Aufzeichnung vom
letzen Musikantenstadl laufen lassen. W&auml;re Karl Moik in den
Siebzigerjahren schon so bekannt gewesen wie heute, er w&auml;re
wahrscheinlich ein integraler Bestandteil des Unix-Systems.<BR>

<BR>F&uuml;r die ganz Hartgesottenen gibt es dann noch <TT>--quiet</TT>,
das &uuml;berhaupt alles unterdr&uuml;ckt. Dieser Option sollte man sich
aber nur bedienen, wenn man ganz genau wei&szlig;, was man kriegen
wird.<BR>

<BR>Im Falle von Fehlern oder anderen herausragenden Ereignissen bleibt
Wget sinnvollerweise eine alte Plaudertasche, <TT>-nv</TT> und
<TT>--quiet</TT> haben also nur eine Auswirkung, wenn alles in Ordnung
ist.<BR>

<BR><CENTER><A NAME="16" HREF="#15"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wie es weitergeht</B></H3>&nbsp;

<BR>Damit sollte klar sein, wie man einzelne Dateien mit Wget auf die
eigene Platte kriegt. Und Dank der zahlreichen Features hat sich damit
das Problem mit der Stabilit&auml;t des Netzwerks gel&ouml;st.<BR>

<BR>Der n&auml;chste Teil besch&auml;ftigt sich mit dem Saugen ganzer
Verzeichnisb&auml;ume. Das Hauptproblem darin besteht, nicht gleich das
halbe WWW auf der Platte zu haben. Dazu gibt es eine Menge
CLI-Optionen, um den Aktionsradius von Wget einzuschr&auml;nken.<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x004C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_03/wget.lha">WGet.lha</A> - das Archiv zum Workshop<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="ftp://prep.ai.mit.edu/pub">FTP-Server der FSF</A> - die Heimat von Wget<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="ftp://ftp.ninemoons.com/pub/geekgadgets/current/amiga-bin/">FTP-Server der Geek Gadgets</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://ftp.uni-paderborn.de/pub/aminet/text/hyper/moreHTML.lha">moreHTML</A> - ein Offline Browser<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x004B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x004D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
