<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst undankbare
Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens sowieso auf einem
Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In Zukunft werden wir Leserbriefe,
die nicht  als ASCII-File vorliegen zwar zur Kenntnis nehmen, aber nicht ver&ouml;ffentlichen.</B><P>
<HR><P>

<A NAME="Dennis Siebert"></A>
<B>Dennis Siebert</B> macht heute mal den ersten Schritt mit seinem umfangreichen Leserbrief.
Dennis hat einiges loszuwerden und wartet auch mit jede Menge Verbesserungsvorschl&auml;gen zu
<B>REFLECTIONS</B> auf:<P>

<B>Hall&ouml;chen & Hallo Dr. Reflectus<P>

Ich k&ouml;nnte euch umarmen. Nachdem ich die Reflector Ausgabe 39 in einen unlesbarem Zustand 
bekommen hatte, habe ich sie gleich mit der Post zur&uuml;ckgeschickt und nur 2 Tage sp&auml;ter 
zur&uuml;ckbekommen. Wahnsinn. Ihr seit ja fast noch schneller als die Post.
Schade das da dieses mal nur 2 Leserbriefe drauf waren, wovon ich einen auch schon kannte. 
Ich darf euch nun sagen das ich die Regula 1 Station komplett erneuert habe, und nat&uuml;rlich 
zu euch geschickt habe. Wie ihr sie nun ver&ouml;ffentlicht ist mir v&ouml;llig egal, am besten ist 
wohl ihr ersetzt die alte Version durch die neue.<P></B>

Dr. Reflectus:<BR>
Jo, wir tun was wir k&ouml;nnen und sind manchmal so richtig schnell, manchmal aber auch
richtig langsam. Uns Uwe hat sich m&auml;chtig mit der Regula auseinandergesetzt und wir
werden das Tei. demn&auml;chst einmal auf <B>REFLECTOR</B> ver&ouml;ffentlichen. Allerdings ist
das Teil recht umfangreich, als k&ouml;nnen wir gleich eine <B>Objekt-Ausgabe</B> zaubern.<P>

<B>Ich bin nun auf Ref 4.2 upgedatet und bin begeistert von den neuen Funktionen.
F&uuml;r CPN ist ja nun auch was dabei: Importfunktionen und eine Exportfunktion ins DXF Format. 
Nur der Speicherhunger ist besonders bei Antialiasing Stufe 7 angestiegen. Ich wollte ein 
Bild in 1600 x 1200 (zum ausdrucken) berechnen was in Stufe 6 und 7 intern ja doppelt so gro&szlig; 
berechnet wird. Nach ca 900 Zeilen brach Ref ab und sagte da&szlig; er das Bild nicht speichern k&ouml;nne.
Genauere Nachforschungen ergaben da&szlig; genau zu diesem Punkt die 96 MB Ram und die 32 MB virtueller 
Speicher verbraucht waren (wegen 30MB gro&szlig;er Hintergrundtextur). Ihr m&uuml;&szlig;t wissen das man unter 
Win95 die ganze Festplatte als virtuellen Speicher verwenden kann, was aber langsamer ist als 
wenn man eine bestimmte Menge vorgibt. Also virtueller Speicher auf 128 MB erh&ouml;ht (etwas weniger 
geht auch) und alles ist in Butter.<P></B>

Dr. Reflectur:<BR>
Sollte hinl&auml;ngst bekannt sein, da&szlig; <B>REF</B> mit RAM nicht gerade knausert. Ein Hintergrundbild
von 30 MB ist aber auch nicht zu verachten. So etwas mu&szlig; man dann nat&uuml;rlich ber&uuml;cksichtigen.
Der Type mit der virtuellen Speicherverwaltung wird sicher Geh&ouml;r finden. Sollte man sowieso
selbst einstellen und zwar nicht dynamisch, was ein wenig langsamer ist.<P>

<B>Mein Problem aus dem letzten Brief hat sich mit Ref 4.2 auch gel&ouml;st. Zur Erinnerung: ich hatte 
damals Probleme mit der Durchnummerierung der Einzelbilder. Die L&ouml;sung fand ich auf der Programm 
CD. Ein unscheinbares Programm mit dem Namen Resequencer. Mit diesem Programm lassen sich die 
Nummerierungen nachtr&auml;glich &auml;ndern. So ist es m&ouml;glich Bildnummern mit bis zu 99 Stellen zu erzeugen.
Die Reflector CD II ist auch gut geworden, nur hat mein CD-Rom Laufwerk etwas Probleme mit dem 
Rohling. Eine Anmerkung: mit TDK Rohlingen habe ich noch nie Schwierigkeiten gehabt. Ich hab 
sie mir bei einem Kumpel auf TDK koperieren lassen. Funktioniert jetzt einwandfrei.<P></B>

Dr. Reflectus:<BR>
Das Programm Resequencer habe ich noch gar nicht gefunden, bzw. ist es noch gar nicht aufgefallen.
Das wird nat&uuml;rlich sofort nachgeholt. Probleme mit der CD hatten wir nicht. Die Problematik an
sich ist aber wohl bekannt. Oftmals ist es so, da&szlig; gebrannte CD's in einigen Laufwerken nicht
erkannt werden, in anderen jedoch ohne Probleme. Die schlechtesten Erfahrungen haben wir
mit goldbeschichteten Rohlingen gemacht, die besten mit blaubeschichteten.<P>

<B>Und jetzt mu&szlig; ich auch mal ein Paar Verbesserungsvorschl&auml;ge zu Reflections machen, da einige 
Funtionen noch fehlen oder verkompliziert wurden.<P>

<UL>
<LI>Sichtbare Lichtkegel, sofort!!!
<LI>Im Animationsjob mu&szlig; man immer die Bildanzahl der Animation selber ausrechnen. Besser w&auml;re es 
    wenn man nur die Framerate einstellen mu&szlig; und Reflections automatisch aus der Animationsl&auml;nge 
    die Bildanzahl berechnet.
<LI>Eine Textur sollte im Editor mit einem Schieber einblendbar sein (wie beim Bumpmapping).
<LI>Bei Texturmaterialien sollte man 2 Bilddateien gleichzeitig verwenden k&ouml;nnen,  und diese 
    prozentual miteinander vermischen k&ouml;nnen. So k&ouml;nnte man z.B. auf einem Raumschiff die 
    Oberfl&auml;che mit abnutzungserscheinungen versehen. Die eine Bilddatei enth&auml;lt die Oberfl&auml;che, 
    die andere die Verschmutzungen. Diese Funktion findet man z.B. in 3D-Studio 4.
<LI>Reflections sollte Dual Prozessorf&auml;hig sein. Solche Motherboards werden immer erschwinglicher, 
    und nur so kann man gr&ouml;&szlig;ere Animationen in Videoaufl&ouml;sung in ertr&auml;glichen Zeiten berechnen. 
<LI>Unterst&uuml;tzung von Intel´s MMX Befehlen. Da k&ouml;nnte man sicher ein wenig Tempo herauskitzeln.
<LI>Bei Animationsberechnungen wird immer nur die Rechenzeit pro Bild angezeigt. Interessant w&auml;re 
    es aber auch zu wissen wie lange die ganze Animation braucht.
<LI>Nach einer Boolschen Funktion sind alle K&ouml;rper des Objektes verschwunden, jetzt mu&szlig; alles 
    m&uuml;hsam neu selektiert werden.
<LI>Die Form der Lensflares sollte einstellbar sein. Rund, f&uuml;nf- oder sechseckig. 
    Ebenso sollte die Menge der Lensflares einstellbar sein, die ja in der Realit&auml;t von der 
    Qualit&auml;t (anzahl der Linsen) abh&auml;ngig ist.
<LI>Bei der Kameraunsch&auml;rfe sollte die st&auml;rke der Unsch&auml;rfe einstellbar sein. Im Moment ist sie  
    n&auml;mlich immer zu hoch. Deswegen benutzt sie auch kein Schwein.
<LI>Bewegungsunsch&auml;rfe (Motion Blur).
<LI>Unterst&uuml;tzung von lzw gepackten .tif Dateien. Weil die am besten gepackt sind.
<LI>Unterst&uuml;tzung von .tif Dateien mit 256 Farben. Ich hab es satt immer zwei Formate f&uuml;r Texturen 
    zu verwenden.
<LI>Vergabe von Lichtquellen an Objekte. Z.B. f&uuml;r Leuchtstoffr&ouml;hren. Wichtig !!!
<LI>Atmosph&auml;reneffeckte. So k&ouml;nnte zum beispiel im Kameraeditor eingestellt werden, ob weit entfernte 
    Objekte langsam im Dunst verschwinden. (Ihr k&ouml;nnt mir erz&auml;hlen was ihr wollt aber ich habe so 
    etwas mit Nebelmaterial noch nie hinbekommen). Um z.B. Mondsicheln in der Atmosph&auml;re erscheinen 
    zu lassen, siehe Bild: Mond
<LI>Besserer Lichteditor. Schaut euch mal Cinema an, dort kann man die Lichteigenschaften nachtr&auml;glich 
    &auml;ndern (Spot, Kegel usw).
<LI>Auch der Textureditor von Cinema ist einige Blicke wert, er hat sooo viele Funktionen.
<LI>Bei Cinema kann man in Rendereditor so viele sch&ouml;ne sachen einstellen wie z.B Schatten hart/weich, 
    Lichtbrechung, Oversampling.
</UL><P>

Ich hab zwar nur eine Demoversion von Cinema, aber trotzdem einiges gef&auml;llt mir dort einfach 
besser. Da sollte sich uns Carsten mal ein bi&szlig;chen umschauen und einige Funktionen klauen.<P></B>

Dr. Reflectus:<BR>
Jo, das sind ja bereits einige Anregungen und Verbesserungsvorschl&auml;ge. Da wird uns Carsten Lotz
nat&uuml;rlich sofort hellh&ouml;rig werden und diese an uns Carsten 'Fox' Fuchs weiterleiten. Wir wollen
da nicht allzu viel sagen und verweisen auf die n&auml;chste Version von <B>REFLECTIONS</B>. In der
Tat bietet <B>Cinema4D</B> einige wirklich gut durchdachte nachahmenswerte Funktionen gerade im
Licht- und Kamera-Bereich. Da liegt es bei <B>REF</B> noch ein wenig im Argen. Doch wir sind da
guter Hoffnung.<P>

<B>Bei Reflections 4.2 sind mir auch ein Paar M&auml;ngel aufgefallen:<P>

<UL>
<LI>Kameraunsch&auml;rfe funktioniert &uuml;berhaupt nicht mehr.
<LI>Speziell bei der Definierung einer Splinekurve erscheint der Requester immer unter dem 
    Mauspfeil, der sich ja &uuml;ber dem zuletzt angeklickten Punkt befindet.
    Der Requester verdeckt in einigen F&auml;llen die Kurve.
</UL><P>

So das solls erstmal gewesen sein<P></B>

Dr. Reflectus:<BR>
Der Fehler mit der Kameraunsch&auml;rfe ist inzwischen bekannt und auch behoben. Die Sache mit den
Requestern ist in der Tat nervig.<P>

Wir danken Dennis f&uuml;r die Zuschrift und geben nachfolgend seine Anschrift bekannt:<P>


<PRE><B>
        Dennis Siebert
        Rieckweg 3b

        21502 Geesthacht
        Tel.: 04152-73415
</PRE></B><P>

<HR><P>

<A NAME="CPN"></A>
<B>Claus Peter Nandelstaedt</B> hat einen Nachtrag zum seinem letzten Beitrag 'Truck' geliefert.
Wie immer sind die Zuschriften schon fast als Workshop zu bezeichnen. Also lassen wir Ihn direkt
ohne Umschweife zu Wort kommen:<P>
                                   
<B>Tach, Uwe.<P></B>

Dr. Reflectus:<BR>
Tach, Nandi.<P>

<B>Wirf die alten  drei Truckszenen weg.Anbei der neue Truck mit Bild. Der Lichtreflex auf dem einen
Auspuff kommt vom Spiegel. Auf dem Bild sind Sachen zu sehen, welche bereits im Reflector erschienen
sind,deshalb sind sie nicht in der Szene,sie w&auml;re sonst 2MB gross. Beim Truck sind noch Teile
dazugekommen.Das Material ist noch ge&auml;ndert worden. Die Hierarchie ist jetzt etwas anders, weil
sich beim drehen des Armes noch etwas mehr mitbewegt hat. Es gibt nur diese eine Szene, da ist
alles drauf. Die beiliegende Szene kann von AMIGA und PC verarbeitet werden. Voraussetzung
ist das Programm Reflection, weil die Daten nur von diesem Programm gelesen werden k&ouml;nnen.<P></B>

Dr. Reflectus:<BR>
Jo, den kompletten Truck werden wir dann auf einer der n&auml;chsten Ausgaben liefern, diese hier ist
leider schon voll.<P>

<B>AMIGAner k&ouml;nnten weiterhin beim rendern Probleme mit den Texturen bekommen. Das liegt an der
Pfadzuweisung, weil das Laufwerk C: beim AMIGA anders benannt ist, oder Reflection in einer
anderen Partition einer Festplatte zu finden ist. Also den  Pfad im Materialmanager &auml;ndern,
oder mit alias arbeiten. Die Texturen sind mit DPaint erstellt und daher im ilbm-Format. F&uuml;r
Reflection auf dem PC ist das aber kein Problem. Der Truck befindet sich in Arbeitsstellung.
Wer einen fahrenden Truck m&ouml;chte muss noch etwas arbeiten.:-))<P></B>

Dr. Reflectus:<BR>
In der Tat sind die Pfadangaben anzupassen, aber das ist auch schon alles.<P>

<B>Keine Angst,die Hirachie ist entsprechend aufgebaut, damit es ganz einfach ist:<P>

<UL>
<LI>Abst&uuml;tzungen einfahren:
   <UL>
      <LI>Ansicht Rechts einstellen,
      <LI>Caution 2+6+8 hochschieben,
      <LI>Ansicht Oben,
      <LI>erst Caution,dann Caution4 nach Innen in den Schrank schieben,
      <LI>T&uuml;ren zudrehen.
   </UL>
<LI>Hub einfahren:
   <UL>
      <LI>Ansicht Rechts,
      <LI>Hub 1 nach Links einfahren,
      <LI>Hub5 gegen den Uhrzeiger drehen und senkrecht stellen,
      <LI>Hubs&auml;ule hochfahren.
   </UL>
<LI>St&uuml;tze hochstellen:
   <UL>
      <LI>Ansicht Rechts.
      <LI>St&uuml;tze gegen den Uhrzeiger drehen auf ca 10 00 Uhr.
   </UL>
<LI>Arm richtig stellen:
   <UL>
      <LI>Ansicht Oben,
      <LI>K-Grund drehen, wohin versteht sich von selbst. 
      <LI>Arm 2 nach Links einfahren. (Seile m&uuml;ssen von Hand im Punkte-Editor, ausnahmsweise gek&uuml;rzt werden).
      <LI>Ansicht Rechts,
      <LI>Arm senken (drehen im Uhrzeigersinn).
      <LI>Zylinder nachdrehen.             
   </UL>
</UL><P>

Was man m&ouml;glichst nicht tun sollte:<P>

<UL>
<LI>Die Hirachie &auml;ndern.
<LI>Teile mit Texturen im Punkte-Editor verschieben, weil die Texturen da nicht mitgehen !!
<LI>Koordinatenschnittpunkte verschieben, weil sonst beim drehen der entsprechenden Teile
    die Achsen aus den Lagern fliegen.
</UL><P>

viel Freude w&uuml;nscht Peter Nandelstaedt alias CPN.<P></B>

Dr. Reflectus:<BR>
Da gibt es nicht mehr viel hinzuzuf&uuml;gen. Nandi hat das alles ja bereits perfekt beschrieben. Wir
bedanken uns bei Claus-Peter f&uuml;r diesen Nachtrag und geben nat&uuml;rlich noch seine Anschrift preis:<P>

<PRE><B>
        Claus Peter Nandelstaedt
        Grunbacherstr. 3

        70736 Fellbach
        Tel.: 0711-512323 
</B></PRE><P> 

Ach ja: Uns Onkel Nandi ist auch in  der <A HREF="CPN.HTM"> ArtGalerie</A> und der
<A HREF="O-CPN.HTM"> Objektbibliothek</A> dieser Ausgabe vertreten.<P>

<HR><P>


<A NAME="MarkusSchmidt"></A>
Die n&auml;chste Zuschrift stammt von Markus Schmidt aus Dortmund und traf vor einiger Zeit
per EMail ein. Naja, besser sp&auml;t beantwortet als gar nicht. Markus hat einige Vorschl&auml;ge
zu <B>REFLECTOR</B> zu machen, was uns nat&uuml;rlich besonders interessiert. Nat&uuml;rlich wollen
wir Euch teilhaben lassen:<P>

<B>Hi Olaf,<P>

habe mir mal ein paar Gedanken zu Reflector gemacht... Was ich noch loswerden wollte:<P>

Reflector ist ja nun mal ein Magazin f&uuml;r Raytracing-Fans und speziell f&uuml;r Reflections User.
OK. Was ich ein bischen schade finde ist, da&szlig; da optisch irgenwie nicht so viel r&uuml;berkommt.
Ich will jetzt nicht meckern und sagen, das Reflector ist totaler Mist. Das ist es ganz
bestimmt nicht! Ich freue mich eigentlich auf jede Ausgabe, obwohl ich in erster Linie Real3D- 
User bin und Reflections (4.1) nur noch auf der Arbeit benutze. (Was bedeutet, da&szlig; ich da
nicht mehr so fit drin bin). Ich w&uuml;rde mir w&uuml;nschen, das sich die Kreativit&auml;t der User auch
in dem Aussehen des Magazins wiederfindet. Das Layout ist zwar funktional, aber ein bischen,
wie soll ich sagen, hausbacken. Wenn ich mir manche privaten Homepages von Hobby Tracern
ansehe, fallen mir teilweise die Augen aus dem Kopf, wie sch&ouml;n die teilweise sind. Und  
das sogar OHNE Frames und Tables. Aber die kann ja mittlerweile sogar jeder Amiga-Browser,
w&auml;ren also kein Hindernis. Als Beispiel, seht Euch doch mal folgende Homepage an:<P>

<A HREF="http://web.ukonline.co.uk/frank.dodd/Real3D">http://web.ukonline.co.uk/frank.dodd/Real3D</A></B><P>

Dr.: Reflectus:<BR>
Ja, nat&uuml;rlich sind wir offen f&uuml;r solcherlei optische Versch&ouml;nerungen. Jedermann kann seine
Vorschl&auml;ge oder Verbesserungen direkt in <B>REFLECTOR</B> einflie&szlig;en lassen. Ein wenig in
die richtige Richtung gebracht sollte das aber werden, den die Gschm&auml;cker unterscheiden sich
doch erheblich. Die angegebene Seite ist &uuml;brigens in der Tat lecker !<P>

<B>Die ist nicht so wahnsinnig aufwendig, hat aber ein sehr sch&ouml;nes Design. Ich finde sie sogar
m. E. spartanisch ausgefallen. Weniger ist eben auch hier mehr. Oder schaut mal hier drauf:<P>

<A HREF="http://www.realsoft.fi/userforum">www.realsoft.fi/userforum</A><P>

Die befindet sich zwar auf der Homepage des Herstellers von Real3D, ist aber von einem engagierten
Privatmann gebastelt. Mir gef&auml;llt sie jedenfalls! Auch diese ist einfach gehalten.<P></B>

Dr. Reflectus:<BR>
Jo, auch lecker die Seite. Prinzipiell braucht man nur ein wenig durch die Gegend zu surfen
und schon wird man mit Anregungen regelrecht zugepflastert.<P>

<B>Klar, wei&szlig; ich, das Olaf nicht so viel Zeit hat, st&auml;ndig an der Reflector zu basteln.
Ich will seine Arbeit auch ganz bestimmt nicht schm&auml;lern (ehrlich nicht, Olaf!). Aber ich
denke (wer lacht da?), da&szlig; das Layout mal einer dringenden &Uuml;berarbeitung bedarf. Ich glaube,
da&szlig; Aussehen einer "Homepage" macht den Betrachter schon neugierig auf mehr. Btw, die  
Oberland Seite f&uuml;r Ref finde ich auch nicht besonders elegant gel&ouml;st. Die braucht viel zu
lange, um geladen zu werden. Optisch spiegelt sie auch nicht die F&auml;higkeiten von Ref wieder, oder?<P></B>

Dr. Reflectus:<BR>
Die Arbeit kannst Du ja auch gar nicht schm&auml;lern, da <B>REFLECTOR</B> mir so echt gef&auml;llt.
Das ist eben Geschmachsache. Zumindest halte ich die Seite f&uuml;r funktionell, auch hinsichtlich
der Erstellung neuer Ausgaben. Lediglich der Inhalt mu&szlig; ge&auml;ndert werden. Der Rahmen bleibt. Bei
umfangreicherer Gestaltung ist das unter Umst&auml;nden nicht mehr so einfach m&ouml;glich. Das versuche
ich halt zu vermeiden. Recht stolz bin ich eigentlich nur darauf, da&szlig; die Seiten mit einem
stinknormalen ASCII-Editor erstellt sind und nicht mit einem HTML-Editor. Die Oberland-Seiten
sind in der Tat zu Grafik-lastig und der Server bekleckert sich auch gerade nicht mit Ruhm.<P>

<B>Und da habe ich gezz folgende Idee:<P>

Sicher gibt es ja noch mehr User als Olaf, die sich mit HTML besch&auml;ftigen (mich z.B.).
Wie w&auml;re es also, wenn sich eine kleine Arbeitsgruppe zusammentun w&uuml;rde, und die Reflector
mal ordentlich renoviert? Ich stelle gerne meine R&auml;umlichkeiten zur Verf&uuml;gung, um z. B.
ein Wochenende die Reflector zu modernisieren. Sozusagen ein Arbeitstreffen zugunsten der  
Reflector. Da m&uuml;ssten dann folgende Themen bearbeitet werden:<P>

<UL>
<LI>Welche Vorarbeiten k&ouml;nnen die User leisten? (Thumbnails usw.)
<LI>Betrachtung der F&auml;higkeiten der Unterschiedlichen Browser vor allem auf   
    dem Amiga (&uuml;ber PC-Browser brauchen wir uns wohl kaum Gedanken machen,    
    die k&ouml;nnen eh fast alles)
<LI>Festsetzung der verwendbaren HTML-Tags
<LI>Erarbeitung eines durchg&auml;ngigen Layouts
   <UL>
      <LI>Inhalte (bisheriges Konzept?)
      <LI>Aufbau einer Struktur (schnell ladbar!)
      <LI>Frames?
      <LI>Tables?
      <LI>Hintergrundbild/Kachel?
      <LI>Vergabe von Schriftattributen
      <LI>Farbwahl
      <LI>Erstellung der graphischen Elemente mir Ref
    </UL>
<LI>Aufbau der HTML-Seiten durch entsprechende Programme inkl. der  
    Erstellung von "Templates" die nur noch mit Inhalt gef&uuml;llt werden m&uuml;ssen.  
    So wird die Arbeit, beim sp&auml;teren zusammenstellen einer neuen Ausgabe,  
    viel leichter.
</UL><P>

Es gibt sicher noch viel mehr zu bedenken, was mir gezz nicht so einf&auml;llt. Aber das ergibt
sich dann ja auch von selbst. Was halten denn die User davon? Wie seht Ihr das optische
Erscheinungsbild der Reflector? Und vor allem: Wer ist bereit, da mitzumachen falls ein  
Interesse besteht? Ich alleine kann das nicht leisten, da brauche ich schon Hilfe! Vor
allem Olaf (Werner?/Uwe?) hat da auch noch ein Wort mitzureden, weil er ja, soweit ich
weiss, gr&ouml;&szlig;tenteils die Ausgaben zusammenstellt.<P>

Also, was denkt Ihr?<P>

Bis bald, Markus<P>

Ich hoffe, Du f&uuml;hlst Dich jetzt nicht auf den Schlips getreten! Ich wei&szlig;, da&szlig; Du Dir viel
M&uuml;he mit der Reflector machst und das es nicht wenig Arbeit ist. Ich habe Dir noch ein
weiteres Bild zugemailt. Du kannst beide Bilder auch gerne auf die Reflector packen,
a h&auml;tte ich nichts dagegen!<P></B>

Dr. Reflectus:<BR>

Ok, Markus hat nun einiges an Vorschl&auml;gen unterbreitet und bietet sogar seine R&auml;umlichkeiten
f&uuml;r ein Faclifting von <B>REFLECTOR</B> an. Nat&uuml;rlich sind wir daran interessiert, denn das
Magazin soll ja Euch gefallen. Also schreibt uns Eure Meinung dazu.<P>

Hey Markus, auf den Schlips getreten f&uuml;hlen wir oder ich mich nicht. Warum auch ? Hier
handelt es sich doch um konstruktive Kritik. Wir sind auf jeden Fall gespannt auf die Resonanz.<P>

Abschlie&szlig;end noch die Anschrift von Markus, der &uuml;brigens in der <A HREF="MSCHMIDT.HTM"> ArtGalerie</A>
mit den erw&auml;hnten Bildern vertreten ist:<P>

<PRE><B>
        Markus Schmidt
        Lessingstr. 34

        44147 Dortmund
        Tel.: 0231-821995
        EMail: <A HREF="Mailto:ms@mark-ami.ruhr.de">ms@mark-ami.ruhr.de</A>
</B></PRE><P> 

<HR><P>

Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
