<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
O B J E K T E</H1></CENTER>
<HR SIZE=5><P>

<B>Steffen H&auml;user</B><P>

hat unseren Aufruf erh&ouml;rt und uns sofort einige Objekte zukommen lassen. Toll, da&szlig; doch Resonanz auf
unseren Aufruf zu versp&uuml;ren ist. Nat&uuml;rlich wollen wir Euch die Werke nicht vorenthalten. Steffen hat
uns gleiche mehrere Objekte sowie Bilder zukommen lassen. Nach und nach werden die Teile auf
<B>REFLECTOR</B> verheizen und Euch hoffentlich damit erfreuen und &uuml;berhaupt und so.<P>

Steffen hat uns auch ein paar Zeilen zukommen lassen:<P>

<B>Hi<P>

Ich habe in der letzten Ausgabe, des R-Clubs gelesen das es euch an Objekten mangelt und sofort
einige meiner Objekte herausgesucht:<P>

1. Das independence day-Raumschiff<BR>
2. Planwagen<BR>
3. Lampe<BR>
4. Sat-sch&uuml;ssel<BR>
5. Strauch<BR>
6. Bus<BR>
7. Gibt es nicht...<P></B>

Jo, den Planwagen haben wir auf der Ausgabe gepackt. Das andere Material wird dann sp&auml;ter folgen.<P>

<B>Leider  sind einige Objekte schon etwas &auml;lter, damit will ich sagen, da&szlig; sie nicht so gut aussehen
aber ich habe Reflections noch nicht so lange (bin noch kein Profi). Momentan arbeite ich an einem
etwas  gr&ouml;&szlig;erem Projekt, ich "baue" "mein" Haus nach. Teile davon sind auf den Bildern, von mir zu
sehen. Wer sich die oben genannten  Objekte ansehen will, sollte die paar Texturen ins Reflections
Texturverzeichnis kopieren und ggf. Name oder Typ  &auml;ndern. Wer Ref 4.2 nicht besitzt k&ouml;nnte mit
einigen Mathe.-texturen Probleme kriegen.<P></B>

Uns Steffen verwendet beim Planwagen Mathetexturen des <B>Texture Magic 3D I</B> - Paketes. Dieses
sollte dann auch installiert sein. Sie stammen aus dem reichhaltigen Angebot von <B>RefTools</B>.
Der Amiga-Frak ist da nat&uuml;rlich der Gelackmeierte und wird wohl nicht umher kommen, dieses Manko
durch Einsatz einer Pixel-Textur zu umgehen.<BR>
Der Planwagen sieht doch gut aus. Profi ist kaum einer von uns und wenn ich einer w&auml;re, dann w&auml;re
ich jetzt in der Karibik und w&uuml;rde am Strand planschen.<P>

<B>Noch ein paar Fragen: Kann man mit Reflections Lichtstrahlen sichtbar machen?<P></B>

Jo, kann man unter Zuhilfenahme von Nebel machen. Ist aber eine Mordsfummelei oder man wartet
auf das n&auml;chste <B>MonZOOM</B>-Update.<P>
                 
<B>Gibt es ein Programm mit dem man Objekten bestimmte T&ouml;ne (.wav Dateien) zuweisen kann, die dann
w&auml;hrend dem Rendern eines Filmes ber&uuml;cksichtigt werden (wenn sich das Objekt entfernt wird der
Ton leiser) ?<P></B>

Jo Mann, so ein Tool ist mir nicht bekannt. So etwas kann man mit dem Programm <B>MainActor</B>
erledigen, allerdings erst nach dem Rendern, wenn der Film bereits fertig gerendert ist. Das
Programm befindet sich als Demo auf der <B>REFLECTIONS</B>-CD. Man braucht aber auch auf jeden
Fall noch ein Soundbearbeitungsprogramm.<P>

<B>Manchmal, wenn ich mit Reflections arbeite bleibt auf einmal alles stehen und ich bin gezwungen den
Computer neu zu  starten, ist der Fehler bekannt ? Was kann ich tun ?<P></B>

Am besten Maxon XL kaufen ;-)) Scherz beiseite, in der Tat gibt es da einige unerkl&auml;rliche Programmfehler.
Da hilft nur, den Fehler m&ouml;glichst genau einzukreisen und m&ouml;glichst nachvollziehbar zu beschreiben
und an Oberland zu senden.<P>

<B>So des war erstmal alles. Viel Spa&szlig; noch mit Reflections. Steffen  H&auml;user (aus Walpersdorf).<P>

Ach so, ich finde es sch..., schade, da&szlig; Reflections bald nicht mehr Reflections hei&szlig;t.<P></B>

Jo Mann, jo Mann. Das finde ich pers&ouml;nlich auch echt Mist. Der Name <B>Monzoom</B> h&ouml;rt sich an wie
ein Schoko-Riegel. Was soll's. Internationalisierung hei&szlig;t der &Uuml;belt&auml;ter und leider gibt es 
irgendwo da drau&szlig;en ein gleichnamiges Programm mit h&ouml;herer Taskpriorit&auml;t.<P>

Wir bedanken uns bei Steffen f&uuml;r das Material und verpetzen jetzt seine Anschrift:<P>


<PRE><B>
        Steffen H&auml;user
        Wittgensteiner-Str. 2

        57250 Netphen
        Tel.: 02737-5445
</B></PRE><P> 

<IMG WIDTH=128 HEIGHT=102 SRC="../OBJEKTE/SHAEUSER/PLANWAGE.GIF" ALT="[BILD]"></A> Planwagen
<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../OBJEKTE.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEIL.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
