<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY  BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
PC - Support</H1></CENTER>
<HR SIZE=5><P>

<FONT SIZE=4><B>Seid gegr&uuml;&szlig;t Reflector-Leser !</B></FONT><P>

Als neuer Mann mit frischem Elan im <B>REFLECTOR-Team</B> m&ouml;chte ich heute endlich
mal die Gelegenheit beim Schopfe packen und mich euch pers&ouml;nlich vorzustellen;
Olaf & Uwe haben dieses ja im Rahmen des PC-Supports schon mehrfach getan; ... trotzdem:<P>
<B>Auf geht`s !</B><P>

Am 19.6.1959 nahm das Chaos seinen Lauf: Ich erblickte das Licht der Welt; tja, damals
wu&szlig;te ich bereits: Schatten entsteht durch Licht, Licht erzeugt Reflektionen, Reflektionen..??
<B>RELECTIONS</B> ?! Aha; das is` mein Ding!<P>

Doch der Weg zu <B>REFLECTIONS</B> war lang, steinig und hart ! Etliche seltsame Sachen
widerfuhren dem armen vom Leben geplagten Werner: Kindergarten ... Schule ... Pubert&auml;t ...
Lehre ... Bundeswehr ... und schlie&szlig;lich Maloche (..w&uuml;rg,&auml;chz..)!<P>

Naja: Ein Vorteil hat die Maloche ja gehabt, vom ersten verdienten Geld erwarb ich mir
meinen ersten Computer: einen <B>VC-20</B> von Commodore mit Datasette ! Damit begann
die Sucht, mit der ich auch heute noch konfrontiert werde ! Es folgten noch andere Compis
wie z. B. der C64, C128, danach der Ur-AMIGA 1000, A2000; auf diesen Rechnern machte ich
schlie&szlig;lich meine ersten Erfahrungen in Sachen Raytracing. Dabei kamen (erstmal nur
oberfl&auml;chlich) <B>TurboSilver, REFLECTIONS-Bookware, Sculpt und Imagine</B> zum Einsatz!
Schlie&szlig;lich erfolgte (vorrangig aus beruflichen Gr&uuml;nden) der Sprung auf die MS-DOS-Schiene.
Das erste Programm in Sachen Raytracing war dort die DOS-Version von <B>IMAGINE
(V2.0 & 3.0)</B>. Nebenbei ergab es sich so, das ich auf der Arbeit ab und zu mal mit
<B>3D-Studio</B> in ber&uuml;hrung kam!<P>

Mein erster Windows-PC war ein 66 MHz lahmer 486er mit 8MB-RAM und einem veraltetem
scheintoten ISA-Bus. Hier kam <B>REFLECTIONS V3.0</B> das erste mal zum Einsatz !
Mit der Zeit wurde mir die ganze Geschichte zu lahm; ein schnellerer PC mu&szlig;te her:
PENTIUM 60 hie&szlig; das gute St&uuml;ck und ich Waldschrat hatte mal wieder das gro&szlig;e Los
gezogen. <B>Ich erwischte einen der ersten Pentium`s mit dem ber&uuml;chtigten Rechenfehler
im CoPro !</B> Gott sei Dank tauchte dieser Fehler bei mir nie auf!<P>

Um &uuml;ber noch mehr Power zu verf&uuml;gen, gesellte sich danach noch ein Pentium 150 dazu.
Diese M&uuml;hle wurde dann vollends mit allen m&ouml;glichen Schikanen vollgestopft: SCSI-Platten,
ZIP, MJPEG, CD-Brenner usw., usw. Eben alles was man so f&uuml;r <B>Videobearbeitung</B>
ben&ouml;tigt; womit wir bei meinem Hauptinteresse angelangt sind : <B> V I D E O </B>!<P>

Eigentlich m&ouml;chte ich mir zu diesem Zweck wieder einen AMIGA-kompatiblen Rechner
zulegen, n&auml;mlich den <B>DRACO</B>. Tja, wie das im Leben so ist: Mann (Frau auch) kann
nicht alles haben !<P>

Im Dezember 95 wurde ich dann Mitglied im glorreichen <B>REFLECTIONS-User-Club</B>
und lernte dann die legend&auml;ren <B>REFLECTOR</B>-Erfinder Olaf und Uwe kennen. Ein
wahrhaft gewaltiges Erlebnis: beide lagen gerade unter`m Tisch und ich dachte erst
die beiden w&auml;ren schon am hellichten Tage abgef&uuml;llt. Doch dann kl&auml;rte sich diese
peinliche Lage sehr schnell auf: Beide versuchten n&auml;mlich verzweifelt eine 060er
Karte in Olaf`s Compi einzubauen: Da erlebte ich zum ersten mal Profis bei der Arbeit !!
Kurz danach baten mich die beiden dem <B>REFLECTOR-Team</B> beizutreten, um hier tatkr&auml;ftig
Unterst&uuml;tzung zu leisten, vorrangig was <B>REFLECTIONS</B> und <B>PC</B> betrifft !<P>

>Tja; .. .und an diesem Punkt m&ouml;chte ich an alle Mitglieder eine gro&szlig;e Bitte los
werden: Ich m&ouml;chte Olaf & Uwe bei ihrer Arbeit, so weit es irgendwie geht, bestm&ouml;glich
dabei unterst&uuml;tzen unser, nein, Euer <B>REFLECTOR-Magazin</B>, zu einem Top-Magazin
f&uuml;r ein Top-RayTracer zu machen; ...jedoch schaffe ich das nur mit eurer Hilfe !
Daher mein Anliegen: <B> Sch&uuml;ttet auch mich mit Grafiken, Briefen, konstruktiven
Vorschl&auml;gen, Tips & Tricks und was ihr sonst noch so drauf habt bis Oberkante Unterlippe
zu; ... und zwar so deftig, das mir der Sch&auml;del brummt!</B> Traut Euch ruhig, ihr werdet
feststellen, das ich ein gaaanz lieber braaaver Kerl bin! (Hoppla,..wo kommt denn
pl&ouml;tzlich dieser Staub her ???..)<P>

An dieser Stelle m&ouml;chte ich mich schon mal bei Euch f&uuml;r die herzliche Aufnahme
in eurem <B>RayTrace-Kreis</B> bedanken, und hoffe auf eine Super-Zusammenarbeit mit Euch !!<P>

Herzlichst..............................Werner<P>

(P.S: Anbei noch ein kleines <IMG WIDTH=69 HEIGHT=49 SRC="../PIX/WERNER.GIF" ALT="[BILD]"> Bild</A>
von mir, damit Ihr wenigstens mal seht, wer dieser Chaot eigentlich ist!
Unschwer zu erkennen: <B>Der Mann ist ein waschechter Trekkie!</B>)<P>

<PRE><B>
        Werner Prass
        Am Feldbusch 40

        45889 Gelsenkirchen
        Tel.: 0209-812029
</B></PRE><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF"></A> HAUPTMENUE
</B>
<HR>
</BODY>
</HTML>

