<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
A R T - G A L E R I E</H1></CENTER>
<HR SIZE=5><P>

<B>Peter Ihme</B><P>

aus Luckenwalde hat uns einige seiner Werke f&uuml;r die <B>ArtGalerie</B> dieser
<B>REFLECTOR</B>-Ausgabe zukommen lassen. Peter arbeitet auch mit <B>PovRay</B>,
dem bekannten Freeware-Renderer und hat gleich einen schicken Brief mitgeschickt.
Diesen wollen wir Euch nicht vorenthalten. Los geht's:<P>

<B>Hallo Leute !<P>

Da w&auml;re ich nun, das neue Mitglied des Refections-Clubs. Bisher bin
ich ganz zufrieden (warum ihr dem Beitrag &uuml;ber die People Collection
CD gleich zwei Eintr&auml;ge im Inhaltsverzeichnis gegeben habt, ist mir
zwar unklar, aber soll mir auch egal sein). Wie man an meinem Logo erahnen
kann, bin ich auch ein leidenschaftlicher Trekkie. Aber ich habe euch noch
mehr mitgebracht, als nur eine &ouml;de Pseudo-Internet-Seite. Da h&auml;tten
wir zum einen ein paar Bilder. Fangen wir an mit den Bildern, die ich mit
Reflections erstellt habe:<P>

Das letzte kommt gerade frisch aus dem Rechner. Es ist noch "warm". Mag
sein, sie sehen nicht sehr toll aus, aber jeder hat ja mal klein angefangen.
Womit wir auch gleich bei meinem Problem w&auml;ren. Ich habe mir zwar
ein paar Objekte selber zusammengebaut, aber an und f&uuml;r sich sind
die Szenen ziemlich leer. Also knallt mir die Disketten ordentlich voll
mit den Objekten der Reflectorausgaben. (einfach bei Nummer eins anfangen;
R&uuml;ckporto liegt bei) Danke !<P>

Zum Schlu&szlig; habe ich noch eines meiner pers&ouml;nlichen Lieblingsbilder
dazugelegt. Es wurde mit POVRAY erstellt (POVRAY ist f&uuml;r bestimmte
Dinge einfach das Beste). Es liegt in der so-gro&szlig;-da&szlig;-der-Speicher-(16
lausige MB)-noch-nicht-&uuml;berschwappt-Aufl&ouml;sung vor. Es wurde alles
in einer Szene berechnet, es wurden keine Bildbearbeitungsprogramme im
nachhinein eingesetzt. Hier kommt es: (und dieser Welleneffekt, der den Bass
darstellen soll, ist wirklich Bestandteil der Szene !):<P>

Bilder allein machen nicht gl&uuml;cklich. Man kann sie nur ansehen. Mit
Objekten kann man allerdings neue Bilder machen. Deshalb habe ich auch
noch ein paar Objekte mitgebracht. Nichts besonderes, eher was f&uuml;r
die Du - brauchst - sie - einmal - in - hundert - Jahren - und - hast - dann -
keine - Lust - sie - zu - erstellen - Kategorie (ich mu&szlig; es ja wissen,
ich hab sie erstellt).

Als letztes hab ich noch ein paar Probleme:<BR>
Nehmen wir zum Beispiel dieses Bild:<P>

<A HREF="../BILDER/FANTAS.JPG"><IMG SRC="../BILDER/FANTAS.JPG" BORDER=0 HEIGHT=100 WIDTH=117> Fantas.JPG</A><P>

Mal davon abgesehen, da&szlig; es noch nicht fertig ist, sieht man dort ein Papierschiffchen,
aber es sieht nicht aus wie Papier. Welche Werte / Eigenschaften hat Papier ?<P></B>

Voll Diffus, kein Spiegeln, kein Leucht!<P>

<B>Desweiteren w&uuml;rde ich gerne wissen, ob es eine M&ouml;glichkeit gibt, POVRAY-Bezierfl&auml;chen
in die von Reflections zu konvertieren, ohne das man alle Koordinaten per Hand eingibt.<P></B>

Soviel wir wissen geht das nicht, Bezierfl&auml;chen nach Ref konvertieren.
Vielleicht hat ja einer der Leser eine Idee.<P></B>

<B>Nun gut, das war's erstmal von mir. Schickt mir die Disketten bitte voll mit Objekten
zur&uuml;ck und &uuml;ber ein paar Zeilen Feedback w&uuml;rde ich mich auch sehr freuen.<P></B>

Ist bereits geschehen.<P>

<P>Bis zum n&auml;chsten Mal !<P></B>

Dank an Peter, wir hoffen, da&szlig; noch weiter Bilder folgen. Hier seine Anschrift:<P>

<PRE><B>
        Peter Ihme
        Grabenstr. 5

        14943 Luckenwalde
        Tel.: 03371-611548
</B></PRE><P> 

<IMG WIDTH=128 HEIGHT=102 SRC="../GALERIE/PIHME/4SHIPG.GIF" ALT="[BILD]"></A> 4 Schiffe
<IMG WIDTH=128 HEIGHT=102 SRC="../GALERIE/PIHME/DONKEY.GIF" ALT="[BILD]"></A> Donkey
<IMG WIDTH=128 HEIGHT=102 SRC="../GALERIE/PIHME/LOVEPA.GIF" ALT="[BILD]"></A> LoveParade
<IMG WIDTH=128 HEIGHT=102 SRC="../GALERIE/PIHME/WINGED.GIF" ALT="[BILD]"></A> Winged Snake<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../GALERIE.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEIL.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
