<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Im Wandel der Zeit ?</H1></CENTER>
<HR SIZE=5><P>

<B>Raider ist jetzt Twix !</B><P>

... und <B>REFLECTIONS</B> hei&szlig;t bald <B>MonZoom</B>. Tja Mitglieder, hier wird ein Schnitt
in unser aller Render-Leben gemacht. <B>REFLECTIONS</B> wird es bald nicht mehr geben, zumindest
von Namen her. Warum das so ist? Da m&uuml;&szlig;t Ihr bei <B>Oberland</B> nachfragen; uns hat es
jedenfalls ganz sch&ouml;n geschockt. Wir werden hier und jetzt auch keinen Kommentar abgeben,
das sollt Ihr erledigen. Bitte schreibt uns Eure Meinung zum Namenswechsel. Unsere Adressen
findet Ihr wie immer im <A HREF="../TEXTE/EDITORIA.HTM"> Editorial.</A> Wird der
<B>REFLECTIONS-Club</B> demn&auml;chst ebenfalls einen neuen Namen f&uuml;r die eventuelle Internationalisierung
ben&ouml;tigen ? <P>

Wir m&ouml;chten <B>REFLECTOR</B> einer Frischzellenkur unterziehen und eine Neuerung einbauen.
Der Blick &uuml;ber den Tellerrand ist angesagt und <B>REFLECTOR</B> soll auch den Anwendern anderer
Raytracern als Anlaufsstelle dienen. Einfach gesagt wird es in Zukunft spezielle Abteilungen
f&uuml;r die enstprechenden Raytracer geben. Au&szlig;erdem werden wir &uuml;ber neue Raytracer berichten. Den
Anfang macht hier <B>Andreas Weyrauch</B> aus Duisburg. Er schreibt &uuml;ber den relativ neuen
Raytracer <B>Tornado 3D</B>, der jetzt f&uuml;r den Amiga erschienen ist. Wer Interesse an diesem
Programm hat meldet sich bitte bei <A HREF="../TEXTE/T3D.HTM"> Andreas.</A><P>

Ihr seht, hier soll sich noch einiges &auml;ndern. Wer Lust hat &uuml;ber ein anderen Tracer zu schreiben
oder vielleicht sogar die ein oder andere Frage beantworten kann, kann <B>REFLECTOR</B> dazu
nutzen. Wir wollen hiermit den Weg zu anderen Tracern frei machen und uns nicht nur auf
<B>REFLECTIONS</B>, oder wie immer das Programm auch hei&szlig;en wird, beschr&auml;nken. Nat&uuml;rlich wollen
wir auch hierzu Eure Meinung vernehmen und ber&uuml;cksichtigen. Also her mit den Statements.<P>

N&auml;chster Punkt: <B>Internet</B><BR>
Da wir jetzt sehr eng mit dem <B>REFTools Team</B> zusammen arbeiten, ergibt sich die M&ouml;glichkeit
&uuml;ber das <B>REFTools Team</B> ins Internet einzusteigen.<P>

<B>Wer allerdings nicht m&ouml;chte, da&szlig; seine Objekte oder Texte oder sonstiges, was f&uuml;r REFLECTOR zur
Verf&uuml;gung gestellt wurde, im Internet ver&ouml;ffentlicht wird, der soll sich bitte bei uns melden.</B><P>

Auf den Seiten des <B>REFTool Team</B> gibt es auch eine Seite die sich nur mit Objekten besch&auml;ftigt.
Diese Objekte sind f&uuml;r jedermann zug&auml;nglich. Hier m&ouml;chte das <B>REFTool Team</B> nat&uuml;rlich noch mehr
Objekte sehen. Wer also Lust hat, seine Objekte f&uuml;r die Nachwelt zur Verf&uuml;gung zu stellen, kann
sich mit "El President" z. B. per E-Mail in Verbindung setzen. Die Adresse findet Ihr auf der
<A HREF="../TEXTE/REFTOOLS.HTM"> REFTools Seite</A> dieser Ausgabe. Die Objekte auf <B>REFLECTOR</B>
bleiben ausschlie&szlig;lich den Mitgliedern zug&auml;nglich. Der Zugriff auf die <B>REFLECTOR</B>-Archive ist
nur mit Passwort m&ouml;glich. Dieses Passwort werden wir Euch nat&uuml;rlich zusenden und ist an dem jeweiligen
Namen gekoppelt.<P>

Wir denken, da&szlig; das Internet eine gute M&ouml;glichkeit ist, sich zu pr&auml;sentieren und zu zeigen was
unsere Raytracer alles so drauf haben (die n&auml;chste Version von <B>REFLECTIONS</B> wird schon
eifrig getestet).<P>

Hier die Internet-Adresse: <A HREF="http://www.reftools.de">www.reftools.de</A><P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
