<HTML>
<HEAD>
<TITLE>REFLECTOR 042</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.GIF">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
T O O L S - P O O L</H1></CENTER>
<HR SIZE=5><P>

<B>xfs Filesystem 2.16</B><P>

Seit ewigen Zeiten erlaubt es <B>CrossDOS</B> auf dem Amiga PC-formatierte Disketten, Wechselmedien
und Festplatten zu lesen und zu beschreiben. Seit OS 2.0 befindet sich <B>CrossDOS</B> sogar im
Lieferumfang des Amiga-Betriebssystems. Der Datenaustausch zwischen beiden Systemen wird dadurch
zum Kinderspiel. Leider ist CrossDOS inzwischen ein wenig in die Jahre gekommen und zwischenzeitlich
ist Windows95 als auch Win98 auf dem Markt. Beide Systeme erlauben Dateinamen mit mehr als die
vom alten MS-DOS bekannten 8 + 3 Zeichen. <B>CrossDOS</B> unterst&uuml;tzt leider nur Dateinamen mit
eben diesen 8 + 3 Zeichen. L&auml;ngere Dateinamen werden einfach abgeschnitten. Nat&uuml;rlich ist dies nicht
hinzunehmen. Inzwischen ist <B>CrossDOS v7</B> erh&auml;ltlich; diese Version unterst&uuml;tzt nun auch lange
Dateinamen. Dumm ist nur, da&szlig; knapp 80 DM daf&uuml;r zu berappen sind.<P>

Aus Gro&szlig;britannien kommt nun ein &auml;hnliches System, was sich ebenfalls die F&auml;higkeit des Amiga-OS
zunutze macht, einfach neue Dateisysteme dem OS hinzuf&uuml;gen zu k&ouml;nnen: <B>xfs Filesystem</B>. Dieses
neue Filesystem liegt bereits in der Version 2.16 vor und unterst&uuml;tzt eine ganze Reihe von verschiedenen
Filesysteme. Einige davon k&ouml;nnen nur lesend verwendetet werden und auch die Formatierung wird nicht
bei allen Filesystemen unterst&uuml;tzt. Dies ist aber nicht unbedingt ein Nachteil, denn <B>CrossDOS</B>
kann ja weiterhin parallel genutzt werden. Nat&uuml;rlich unterst&uuml;tzt das <B>xfs Filesystem</B> auch lange
Dateinamen unter Windows 95 oder h&ouml;her. Das Programmpaket ist PublicDomain. Hier eine Liste mit den
unterst&uuml;tzten Dateisysteme:<P>

<PRE><B>
Current xfsd status:

              readdir  read  write delete rename readpartition format
amiga           +       +      +     +      +          +
msdos / win95   +       +      +     +      +          +
mac             +       +                              +
ql              +       +      +     +      +                    ?
minix           +       +      +     +      +
archimedes      +       +
cpm             +       +
1541 / 1581     +       +
spectrum        +       +

Current fd.device status:

                    read   write  trackformat
Amiga tracks          +      +         +
Diskspare 80/82 trk   +      +         +
mfm (pc etc)          +      +         +

Current file.device status:

                      read   write  format
flat files              +      +
dms files               +
pctask/janus hardfiles  +      +
</B></PRE><P>

Wie zu sehen wird auch der Macintosh unterst&uuml;tzt und auch der Archimedes wurde nicht vergessen,
ganz zu schweigen von den etwas &auml;lteren Formaten (C64 & Spectrum).<P>

Alles in allem eine sinnvolle Erweiterung f&uuml;r den Amiga, die manches vereinfacht. Eine ausf&uuml;hrliche
Anleitung im Guide-Format befindet sich im Lieferumfang, wenngleich auch nur in Englisch.<P>

Viel Spa&szlig; mit <B>xfs Filesystem 2.16</B> !!!<P>


<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../TOOLS.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEIL.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
