<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Forum</TITLE>
</HEAD>
<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">
<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Leserbrief zu AMIGA aktuell (von Thomas Franziskowski)</H2>
&#187;Hallo, Carsten Schr&ouml;der und alle anderen Redakteure von Amiga aktuell,<P>
ich m&ouml;chte hiermit einmal meine Meinung &uuml;ber ein hervorragendes E-Magazin
loswerden. Ich bin wirklich froh, da&szlig; es Amiga aktuell gibt. Selbst wenn
man als Amiga-User jeden Monat s&auml;mtliche deutschen und englischen Amiga-
Magazine am Kiosk aufkaufen und diese von vorne bis hinten durchlesen
w&uuml;rde, k&ouml;nnte man gewisse Dinge allenfalls in bestimmten Newsgroups in
Erfahrung bringen.<BR>Da w&auml;ren zum Beispiel Berichte bzw. Kritiken &uuml;ber die
drei g&auml;ngigen amigabezogenen Printmedien, z.B. da&szlig; das Amiga-Magazin nun
schon wieder um etliche Seiten d&uuml;nner geworden ist oder da&szlig; das
Redakteursteam st&auml;ndig wechselt. Man wird freilich nie dergleichen in
diesen Zeitschriften zu lesen bekommen, das geh&ouml;rt sich eben einfach nicht
und ist wohl auch mit rechtlichen Problemen verbunden. Um so wichtiger ist
da ein Medium, das sozusagen &uuml;ber allem steht und unabh&auml;ngig von
Anzeigenkunden ist wie eben Amiga aktuell und einige andere E-Magazine (ich
kenne bisher nur wenige). Dasselbe mit der einmaligen Rubrik
"Ger&uuml;chtek&uuml;che": Wo sonst k&ouml;nnte man so etwas lesen? In der Amiga Plus?
Oder noch besser: in deren Werbeanzeigen?? Nat&uuml;rlich nicht! Jede Firma
erz&auml;hlt von sich immer nur das Beste, denn es geht ja schlie&szlig;lich um
Wettbewerb und vielleicht auch um's nackte &Uuml;berleben! Da ist eben kein
Platz f&uuml;r allzu gro&szlig;e Kritik.<P>
Weitere Rubriken, die ich lobenswert finde:<BR>
PowerUp-to-date. Es ist eine gute Idee, f&uuml;r eines der wichtigsten Elemente
der Amiga-Zukunft (neben einem zeitgem&auml;&szlig;eren Betriebssystem) eine eigene
Ecke einzurichten. Das witzige Wortspiel tut sein &uuml;briges, um unter den
vielen anderen Rubriken auch ausreichend aufzufallen.<BR>
Der Spieleteil mit seinem ebenso originellen Namen. Hier wird wieder klar,
was Amiga aktuell f&uuml;r eine Bedeutung bekommen hat, indem es gleich mehrere
Spielemagazine zu ersetzen versucht. Positiv finde ich dabei, da&szlig; es von
einem zweiten unabh&auml;ngigen Redakteur produziert wird, anstatt da&szlig; einer
alles allein "dirigiert". Hier w&uuml;rde ich mir &uuml;brigens noch einen
regelm&auml;&szlig;igen Hinweis w&uuml;nschen, ob ein Spiel CyberGFX unterst&uuml;tzt oder
nicht. Die HiRes- und LoRes-Zeiten sollten eigentlich schon l&auml;ngst vor&uuml;ber
sein!<BR>
Die HTML-Version. Sie wurde von mal zu mal besser. Sehr gut finde ich, da&szlig;
der Text nicht &uuml;ber die gesamte Breite des Bildschirms l&auml;uft (ich benutze
einen 1024x768er Screen), wie so oft bei anderen HTML-Texten, sondern so
eingeschr&auml;nkt ist, da&szlig; er auch wirklich gut lesbar ist. Auch die
integrierten Bilder tragen nat&uuml;rlich zur Attraktivit&auml;t des Magazins bei.
Das verbesserte Gewinnspiel. Es ist einfach eine tolle Idee, eine leichte
und eine schwere Frage mit einer Umfrage zu kombinieren! So ist f&uuml;r jeden
etwas geboten. Diese Kreativit&auml;t w&uuml;rde ich mir von so manch anderen Medien
auch w&uuml;nschen!<BR>
Und nat&uuml;rlich die Amiga-News. &Uuml;ber mangelnde Aktualit&auml;t kann sich wohl
keiner beschweren. Besonders nicht als Abonnent, da man dann ja neue
Nachrichten auch zwischen den Erscheinungsterminen des Magazins per E-Mail
zugeschickt bekommt.<BR>
Wieder ein Novum unter den Amiga-Medien, vermute ich.
Was ich mir noch w&uuml;nschen w&uuml;rde w&auml;ren Tests nicht nur von rein
kommerziellen Produkten, sondern vor allem auch von Shareware und Freeware.
Gerade unser Amiga ist regelrecht abh&auml;ngig von dieser Szene. Oder m&ouml;chte
noch jemand beispielsweise auf MUI, MagicWB, ReqTools, SnoopDOS oder auch
YAM verzichten, nachdem er es erst einmal ausprobiert hat? Und gibt es
kommerziellen Ersatz daf&uuml;r?? Bekanntlich nein (und die letzten beiden
Produkte sind auch noch kostenlos! Welche Firma verschenkt schon seine
Software?).<BR>Das Problem ist nur: Im Aminet schlummern tausende Utilities
und Tools, die einem das Computerleben erleichtern, aber leider auch z.B.
durch Inkompatibilit&auml;ten oder unzureichende Anleitungen erschweren k&ouml;nnen.
Die Vorstellungen in den kommerziellen Printmedien halte ich f&uuml;r zu
distanziert. Es wird nur gesagt, was ein Programm kann, und da&szlig; man es sich
am besten auf jeden Fall einmal downloaden sollte (denn der Autor hat
bereits bei diesen Worten schon keine Lust mehr, n&auml;her auf die Software
einzugehen). Was fehlt, sind solche Dinge wie eine Warnung vor Utilities
wie MCP oder Sysihack, die schlecht programmiert sind. Auch interessiert
mich, ob eine Software mit deutscher Anleitung kommt oder nicht, oder ob es
vergleichbare Programme gibt, die besser sind oder die Freeware statt
Shareware sind bei gleichem Funktionsumfang.<BR>
So, das soll's jetzt aber erstmal gewesen sein. Ich freue mich schon auf
die n&auml;chste Ausgabe. Und seid in Zukunft p&uuml;nktlicher!<P>
Thomas Franziskowski<BR>
M&uuml;nchen&#171;<BR>
<CENTER><BR><A HREF="0019.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0100.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

