<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 10/97 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: Das Epic Multimedia-Lexikon (von Christian Hoklas)</H2>
&#187;Das Epic MultiMedia-Lexikon<P>

<H3><B>Einleitung:</B></H3>
Zum ersten Mal hat es eine Firma gewagt, ein "multimediales" Lexikon f&uuml;r
den Amiga zu erstellen und zu vertreiben. Das Ergebnis sieht auf den ersten
Blick vielversprechend aus. Aber wurden gleich N&auml;gel mit K&ouml;pfen gemacht,
wie multimedial ist das Ganze wirklich, gibt es trotz des Drumherums auch
Informationen, geh&ouml;rt die CD in jede gepflegte Programmsammlung? Diese und
andere Fragen soll dieser Artikel beantworten!<P>

<H3><B>Systemvoraussetzung:</B></H3>
Die Anforderungen sind relativ hoch, aber jeder normale Amiga-Besitzer kann
sie erf&uuml;llen!<P>
<UL>
<LI>AGA Amiga (KEINE Grafikkartenunterst&uuml;tzung)
<LI>4 MB RAM (mehr ist immer besser)
<LI>CD-ROM (was wohl sonst bei einer CD)
<LI>Festplatte (f&uuml;r Hotlist und Export von Daten)
</UL><P>

<H3><B>Features:</B></H3>
Erstmal ein paar Zahlen, damit jeder Bescheid wei&szlig;:<P>
<UL>
<LI>etwa 4100 Stichworte (in Deutsch)
<LI>mehr als 1500 Bilder (Farbe &amp; S/W)
<LI>hunderte Samples
<LI>dutzende Filmclips
<LI>Querverweise auf andere Lexikonseiten
<LI>3 Suchfunktionen und Hotlist
<LI>mit CanDo realisiert
<LI>CD mit 253,4MB gef&uuml;llt
</UL><P>
<H3><B>Benutzung:</B></H3>
<OL>
<LI><B>Installation:</B><P>
Die Installation sieht erstmal einfach aus. Wenn man die CD einlegt und sie
&ouml;ffnet, findet man ein 'Setup'-Icon. Durch das Anklicken startet man ein
Shell-Script, das leider ungefragt ein paar Libraries auf die Platte
kopiert und auch vor neueren Versionen nicht haltmacht. Danach l&auml;uft eine
Memory-Anzeige mit gro&szlig;en Lettern von 0 auf x in Byte-Schritten hoch.
Eigentlich unsinnig. Die Installation h&auml;tte man besser mit dem Installer
l&ouml;sen sollen!<P><BR>
<LI><B>Erster Start:</B><P>
Nach kurzer Ladezeit erscheint ein Men&uuml; mit 4 Buttons. Jeder Anwender
sollte erstmal die voll gesprochene Einleitung in das Lexikon mitmachen,
hier nennt man sie "Guided-Tour"! Man wird von einer netten Frauenstimme in
alle Funktionen eingewiesen und kann sich gleich auf das Lexikon st&uuml;rzen.
Zum Gl&uuml;ck ist die Bedienung so einfach, da&szlig; man hier ausnahmsweise auf eine
gedruckte Anleitung verzichten kann.<BR>
Es f&auml;llt gleich auf, da&szlig; man mit Grafik und Sound nicht spart. An allen
Ecken und Enden piept, klappert und klickt es. Die grafische Gestaltung ist
sehr gut, man hat z.B. die Farben so gew&auml;hlt, da&szlig; das Erscheinungsbild
farbig aber nicht bunt ist. Hier waren Profis am Werk.
<CENTER><IMG SRC="EpicMultimedia.png" WIDTH=320 HEIGHT=256 ALT="Screenshot im PNG-Format"></CENTER><P><BR>
<LI><B>Das Lexikon:</B><P>
Um einen ersten Eindruck von der Oberfl&auml;che des Lexikons zu bekommen, kann
man den Screenshot betrachten.
Sie ist &uuml;bersichtlich aufgebaut, und alle Schalter sind leicht zu
erreichen.<P>
Das Wichtigste an einem Lexikon sind aber wohl immer noch die Beitr&auml;ge!
Diese sind in gutem Deutsch geschrieben und relativ umfangreich. Ein
weiterer Vorteil gegen&uuml;ber den Buchausf&uuml;hrungen ist, da&szlig; auf Abk&uuml;rzungen
verzichtet wurde und man daher auch als normaler Mensch den Inhalt schnell
nachvollziehen kann. Auch die Hyperlinks, also die Verkn&uuml;pfungen zwischen
den einzelnen Artikeln, helfen, in ein bestimmtes Thema einzusteigen.<P>
Aber wo Licht ist, ist auch Schatten, und so findet man auch
Schwachstellen. Zum Beispiel findet man keinerlei Informationen zu
ber&uuml;hmten Personen wie Goethe, Schiller, J.F.K., Mozart, u.a.. Personen
enth&auml;lt das Lexikon einfach nicht! Hat man da bei Epic was vergessen?
Au&szlig;erdem ist eine Artikelanzahl von 4100 nat&uuml;rlich nicht sonderlich viel.
Richtig gro&szlig;e Lexika haben die 100fache Artikelanzahl. Aber man kann
ja noch auf neue Versionen hoffen! Schlie&szlig;lich hat die englische
Originalversion 16000 Stichw&ouml;rter.<P>
Im Hauptmen&uuml; des Lexikons gibt es noch eine Exportfunktion zum Speichern
oder Drucken des jeweiligen Artikels, und einen Hotlist-Manager, mit dem
man wichtige Artikel schneller auffindet.<P>
Die Suchfunktion ist ein weiterer Pluspunkt. Es gibt 3 M&ouml;glichkeiten:
Stichwortsuche (es wird genau das angegebene Wort gesucht), &Auml;hnlichkeit (es
werden &auml;hnlich geschriebene W&ouml;rter gesucht), Full-Search (die gesamten
Artikel der CD werden durchsucht). Die ersten beiden Suchfunktionen sind
schnell und laufen praktisch ohne Wartezeit ab, aber die letzte dauert
schon mal 10 Minuten pro Wort (schlie&szlig;lich werden alle 4100 Artikel
durchsucht)!<P>
Ein weiterer Teil des Lexikons ist die Europedia. Hier findet man
verschiedene Informationen zu allen Staaten Europas. Ein Text beschreibt
das jeweilige Land, und ein Kartenausschnitt zeigt dessen Lage.
Bei einem Klick auf die Landflagge, erklingt bei einigen L&auml;ndern deren
Nationalhymne. Als Verbesserung w&auml;re nur noch eine Welt&uuml;bersicht
w&uuml;nschenswert.<P>
Und dann gibt's noch die Explorapedia. Dies ist ein Teil des Lexikons,
welcher f&uuml;r Kinder gemacht ist.
Es gibt 6 verschiedene Bildschirme zu unterschiedlichen Themen (z.B.
Dinosaurier, Musik, Fernsehen, u.a.).
Dort kann man auf verschiedene Objekte klicken, und es ert&ouml;nt das Ger&auml;usch
des jeweiligen "Dings". F&uuml;r jeden normalen Anwender ist sowas wohl ziemlich
unwichtig. Die Zeit, die hier investiert wurde, h&auml;tte man besser ins
Lexikon stecken sollen. Aber f&uuml;r j&uuml;ngere Anwender ist das eine gute Idee.<P><BR>
<LI><B>Fazit:</B><P>
Alles in allem ist das Multimedia-Lexikon recht gut gelungen. Eine gr&ouml;&szlig;ere
Artikelanzahl st&uuml;nde ihm aber trotzden gut zu Gesicht. Aber man kann noch
hoffen. Vielleicht gibt's dann irgendwann mal Epic Multimedia-Lexikon 2.
Wer wei&szlig;? Auf jeden Fall sollte man nicht sofort seine alten Buchlexika
wegwerfen. Man k&ouml;nnte sie noch brauchen!<BR>
Der Preis von rund 80 DM ist angemessen, wenn man mal den Aufwand dahinter
sieht. Sehr sch&ouml;n w&auml;re eine Update-M&ouml;glichkeit &uuml;bers Internet. So k&ouml;nnte
man stets aktuelle und richtige Informationen lesen.<P><BR>
</OL>
<B>Tip:</B><BR>
Wer sich nun mit dem Gedanken tr&auml;gt, das Lexikon zu kaufen, sollte mal
einen Preisvergleich anstellen.<BR>
Das Ergebnis ist sehr unterschiedlich, der eine verkauft es f&uuml;r 79,- und
der andere f&uuml;r nur 55,-! Bei Vesalia Computer (<A HREF="http://www.Vesalia.de">http://www.Vesalia.de</A>) ist
das Multimedia-Lexikon f&uuml;r tolle 55 Mark zu haben. Man spart also
&uuml;ber 20 Kr&ouml;ten.<P>
--<BR>
Christian Hoklas (<A HREF="mailto:CHoklas@T-Online.de">CHoklas@T-Online.de</A>),
<A HREF="http://home.t-online.de/home/CHoklas">http://home.t-online.de/home/CHoklas</A> , f&uuml;r die Amiga aktuell&#171;
<CENTER><BR><A HREF="0100.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0102.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

