<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 10/97 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Softwaretest: p.OS (von Christian Hoklas)</H2>
&#187;pOS - alles positiv oder was?<P>
<H3><B>Einleitung:</B></H3>
Wie wahrscheinlich bereits hinreichend bekannt, entwickelt ProDAD gerade
ein neues AmigaOS. Der Name lautet pOS. Zur Zeit ist das Prerelease im
Handel erh&auml;ltlich, welches schon einmal einen Einblick in die
Funktionsvielfalt und Optik geben soll. Dieser Test soll einen kurzen
&Uuml;berblick geben und ggf. auch Kritik &uuml;ben! Eins noch vorweg: ProDAD hat in
der Anleitung zu pOS darum gebeten, da&szlig; man keinen Flame-War starten soll,
da es sich ja um ein Prerelease handelt. Daher soll jede Kritik in diesem
Artikel auch gleichzeitig ein Hinweis auf Schwachstellen sein, die bis zum
Endrelease noch ausgeb&uuml;gelt werden sollten.<P>

<H3><B>Systemvoraussetzungen:</B></H3>
<UL>
<LI>Kickstart 2.0
<LI>MC 68020
<LI>4 MB Fast-RAM
<LI>Harddisk
<LI>CD-ROM Laufwerk (nur f&uuml;r die CD-Version)
<LI>auf Draco lauff&auml;hig
</UL><P>
<H3><B>Der Start:</B></H3>
Nach dem Einlegen der CD einfach auf das Install-Icon klicken und schon
wird der Installer gestartet.
Es werden ca. 16 MB Platz ben&ouml;tigt. Jeder, der den nicht hat, kann pOS auch
direkt von CD starten.
Zum Gl&uuml;ck handelt es sich um eine reine Softwarel&ouml;sung, ohne ROM-Austausch!
Nach der Installation kommt der spannende Moment: Die pOS-Workbench startet
und man erkennt seinen Amiga kaum wieder. Das Layout von pOS ist zwar
Amiga-like, aber trotzdem h&uuml;bscher. Hier nur mal kurz alle wichtigen
optischen Neuerungen:<P>
<UL>
<LI>animierte Fenster- und Men&uuml;&ouml;ffnung mit Ger&auml;usch
<LI>3 verschiedene Iconsets zum direkten Umschalten ohne Kopieren
<LI>Backgroundpattern auch in Programmfenstern
<LI>Gadgetfunktionen Marke MUI
<LI>Grafik in Requestern (bekannt von Windoof)
<LI>3D-Men&uuml;s mit PopUp-Funktion
<LI>volle Fenster verschieben und vergr&ouml;&szlig;ern
</UL>
<CENTER><A HREF="pOs.png"><IMG SRC="pOs_sm.png" WIDTH=320 HEIGHT=256 ALT="Screenshot im PNG-Format" BORDER=0></A><BR>
<A HREF="pOs.png">Bild in voller Gr&ouml;&szlig;e!</A></CENTER>

<P><BR>
<H3><B>pOS Interna:</B></H3>
pOS ist in Ansi-C geschrieben. Dies ist auch n&ouml;tig, da proDAD ja
Portierungen auf die verschiedensten Plattformen schreiben will. Bisher ist
aber nur eine Amiga-Version verf&uuml;gbar, und die setzt noch das original
AmigaOS voraus. Soll hei&szlig;en: Noch ist das Prerelease von pOS nicht alleine
lauff&auml;hig. Vor allem die Devices und die Grafikausgabe werden noch vom
AmigaOS abgewickelt, so da&szlig; man in diesen Bereichen keine gro&szlig;en Spr&uuml;nge in
Sachen Geschwindigkeit oder Stabilit&auml;t erwarten darf. Sp&auml;ter soll nat&uuml;rlich
eine Umsetzung f&uuml;r den PowerPC erscheinen und vielleicht auch f&uuml;r den PC
auf Intel-Basis.<P>
(Anm. der Redaktion: Laut ProDAD ist eine Intel-Version bereits in Arbeit.)<P>

<H3><B>Workbench:</B></H3>
Die Workbench von pOS ist bereits sehr ausgereift und wohl schon als voller
Ersatz zu bezeichnen. Es sind sowohl die Grundfunktionen wie auch
Sonderfunktionen, wie Toolbar oder Sprechblasen-Hilfe vorhanden!
Ein besonderes Lob verdient auch das Dithering. pOS ist n&auml;mlich in der Lage
automatisch, ohne Zutun des Programmierers oder Anwenders fehlende Farben
durch Dithering zu erzeugen. Man kann also ein 256-Farben-Bild auf einer WB
mit nur 64 Farben ansehen, ohne gr&ouml;&szlig;ere Qualit&auml;tsverluste in Kauf zu
nehmen.<BR>
Auch neu ist das Prefs-Programm. Statt wie beim AmigaOS eine Prefs-
Schublade zu haben, wo alle Prefs-Programme hineinkopiert werden, gibt es
bei pOS ein einheitliches Prefs-Programm, welches mit Modulen erg&auml;nzt wird!
Auch Anwendungsprogramme k&ouml;nnen somit mit diesen Programm konfiguriert
werden.<BR>
Weiterhin verf&uuml;gt pOS &uuml;ber ein Drag&amp;Drop-Verfahren. Da davon sehr intensiv
Gebrauch gemacht wird, ist die Bedienung an den meisten Stellen einfacher
und logischer geworden.<BR>
Wen hat am AmigaOS schon mal die Wartezeit beim L&ouml;schen oder Kopieren
gest&ouml;rt. Dies ist jetzt auch vorbei:<BR>
pOS erzeugt f&uuml;r jede Aktion einen eigenen Task, so da&szlig; man nicht mehr auf
das Ende des Kopiervorgangs warten mu&szlig;. F&uuml;r den Anwender bedeutet das
weniger Wartezeit und damit eine h&ouml;here Produktivit&auml;t.
Auch eine deutliche Verbesserung gegen&uuml;ber dem AmigaOS ist das neue
Datatypes-Konzept. Es ist z.B. m&ouml;glich, in ein Grafikprogramm Text
einzuladen, ohne irgendwelche Konvertierer. Der Text erscheint eben als
Bitmapgrafik auf dem Screen.<P>
<H3><B>pOS-DOS &amp; Shell:</B></H3>
Das DOS von pOS ist, um erstmal alle zu beruhigen, kompatibel zum AmigaDOS.
Man kann also alle Laufwerke weiterbenutzen und mu&szlig; keine doofen Spielchen
wie Neuformatieren von Partitionen treiben. Laut Aussage von ProDAD soll
das pOS-DOS optimiert und deshalb schneller als das des originalen AmigaOS
sein. Leider kann ich dazu keine Aussage machen, da noch die n&ouml;tigen
Testprogramme fehlen.<BR>
Die Shell ist so gut wie die des AmigaOS. Zwar existieren neue Features wie
Scollbar, Filenamenvervollst&auml;ndigung und Drag&amp;Drop. Aber der PIPE-Strich |
funktioniert noch nicht. Ein/Ausgabeumlenkung stellt aber zum Gl&uuml;ck kein
Problem dar.<P>
<H2><B>Weitere Neuerungen:</B></H2>
Eine der besten Dinge in pOS ist die SGOS.library. Diese Library stellt
Funktionen f&uuml;r das Bewegen von grafischen Objekten zur Verf&uuml;gung. Um die zu
erwartenden Ergebnisse zu demonstrieren, liegen pOS verschiedene Spiele bei
(Chess, pBall, Tetris, Puzzle). Der Breakout-Clone pBall ist nur 15 KB
gro&szlig;, da er fast komplett auf OS-Libs zugreifen kann. Nun wird endlich auch
mal an Spieleprogrammierung gedacht!<BR>
Auch gut ist ein Grafiksystem namens MESA. Es handelt sich um eine OpenGL-
Implementation. Man kann also als Programmierer auf eine gro&szlig;e Anzahl an
Renderfunktionen zur&uuml;ckgreifen, ohne selbst Hand anlegen zu m&uuml;ssen.<P>
<H3><B>Verbesserungsw&uuml;nsche:</B></H3>
So, jetzt geht's los! Hier kommen alle Dinge, die ich f&uuml;r wichtig halte,
die aber in pOS nicht oder nur ungen&uuml;gend implementiert sind.
Auf jeden Fall sollten die Leute bei ProDAD an der Grafikausgabe feilen.
Auf einem 256-Farben Screen ruckelt der Text im Shellfenster m&uuml;hselig nach
oben. Wenn man Fenster verschiebt, blitzt es nur so vor sich hin.
Die Icons bauen sich langsam auf. Dies alles kann durch das hinter pOS
laufende AmigaOS zur&uuml;ckgef&uuml;hrt werden, aber dort sind diese Funktionen
nicht so langsam!?<P>
Die Shell mu&szlig; ihren PIPE-Strich kriegen und alle Tools vom AmigaOS
(HDToolBox, IconEdit, Say) sollten auch auf pOS umgesetzt werden. Weiterhin
bin ich f&uuml;r Multiuser-F&auml;higkeit. Es gibt eigentlich keinen besseren
Anwendungsfall f&uuml;r sowas, als einen Homecomputer, welcher der Amiga ja
nachweislich ist. Ich zumindest finde es praktisch, wenn die kleine
Schwester nicht alle meine Dateien l&ouml;schen kann (ob beabsichtigt oder
nicht)!<P>
Auch Speicherschutz w&auml;re gut, selbst wenn dies die Geschwindigkeit etwas
dr&uuml;ckt. Aber kein Programm ist fehlerfrei und l&auml;uft ohne Absturz. Man
k&ouml;nnte z.B. 2 Versionen liefern, so da&szlig; der Anwender sich aussuchen
kann, ob er diesen zus&auml;tzlichen Schutz ben&ouml;tigt oder nicht.
Eine Chance, die ProDAD nutzen sollte, ist die Einf&uuml;hrung von
Sprachausgabe. Dies ist noch aus alten Kickstart1.3-Zeiten bekannt. Es ist
schon n&uuml;tzlich, wenn der Computer mal einen Text vorlesen kann.
Sicherlich hat man bei proDAD auch die Druckerunterst&uuml;tzung und die
Netzwerkf&auml;higkeit nur im Prerelease weggelassen.<P>
<H3><B>Fazit:</B></H3>
Wenn man pOS jetzt so sieht, freut man sich auf den Moment, wenn das erste
Mal Software erscheint, die das neue PowerOS auch ausnutzt. Mit den
mitgelieferten Preview-Versionen von StormED und Adorage kann man schon mal
erste Impressionen sammeln. Auch die anderen Demoprogramme machen Lust auf
mehr. Wenn die letzen Probleme und Ecken beseitigt sind, ist pOS wohl eine
der gr&ouml;&szlig;ten Sensationen, die die Amiga-Gemeinde nach Niedergang von
Commodore erlebt hat. Man kann den Leuten bei ProDAD nur noch viel Gl&uuml;ck
f&uuml;r dieses Projekt w&uuml;nschen. Meiner Meinung nach, wird die Amiga-Gemeinde
pOS gern annehmen und zumindest parallel zum AmigaOS laufen lassen; wenn
nicht sogar als Komplettersatz!<P>
--
Christian Hoklas (<A HREF="mailto:CHoklas@T-Online.de">CHoklas@T-Online.de</A>;<BR>
<A HREF="http://home.t-online.de/home/CHoklas">http://home.t-online.de/home/CHoklas</A>), f&uuml;r AMIGA aktuell&#171;

<CENTER><BR><A HREF="0101.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0103.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

