<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Spiele-News aus aller Welt</H1>
<UL>
<LI><B>Vulcan-News</B><P>
Vulcan Software hat die Ver&ouml;ffentlichung von <B>Uropa2</B> bekanntgegeben. Das
Spiel, das nur auf CD-ROM erscheint, setzt den Spieler in die Position
eines Roboters, der Uropa2 vor der Zerst&ouml;rung durch b&ouml;se Droiden retten
mu&szlig;. Uropa 2 ist ein Action-Adventure mit einer isometrischen 3D-Grafik.
Systemvoraussetzungen sind eine Festplatte, 2MB RAM (mind. 1MB Chip RAM),
und ein 4x CD-ROM-Laufwerk. Uropa 2 ist auch auf deutsch spielbar und
kostet 29.99 englische Pfund (ca. 90 DM).<P>
Demn&auml;chst sollte auch <B>"The Final Odyssey"</B> erh&auml;ltlich sein, das am 09.12.
erscheinen soll. Hierbei handelt es sich um ein Action-Adventure-Puzzle-
Spiel. Ein Preview dieses Spiels k&ouml;nnt ihr weiter unten lesen.
<CENTER><IMG WIDTH=320 HEIGHT=256 SRC="FinalOdyssey.jpg" ALT="Final Odyssey Screenshot"><P></CENTER>
Auch <B>Genetic Species</B>, ein Doom-Clone, macht Fortschritte. &Uuml;ber 40 Level
soll das fertige Spiel enthalten. Es verf&uuml;gt nun &uuml;ber AHI-Support, noch
sch&ouml;nere Grafikeffekte, 30 Minuten Musik direkt von CD, und eine 200 MB
gro&szlig;e Intro-Animation. Die Systemvoraussetzungen sind im Moment bei
einem Amiga mit AGA oder Picasso/CyberGfx-Karte, mind. einem 020-Prozessor,
Festplatte, 4x CD-ROM-Laufwerk, 2 MB Chip RAM und 8 MB Fast RAM.
Auf der Weihnachts-Ausgabe der Amiga Format soll ein Demo der endg&uuml;ltigen
Version des Spiels erscheinen. Ein Preview einer etwas &auml;lteren Demo-
Version findet Ihr im Kapitel Previews. Genetic Species soll im Februar
1998 erscheinen.<CENTER><IMG WIDTH=220 HEIGHT=176 SRC="GeneticSpecies.jpg" ALT="Genetic Species Screenshot"></CENTER><P><BR>
<LI><B>Foundation-Demo im Aminet</B><P>
F&uuml;r alle, die es noch nicht wissen: Ein Demo des potentiellen Megahits
Foundation ist jetzt im Aminet erh&auml;ltlich. Das Echtzeit-Strategie-Spiel,
das im Moment zu 93 % fertig ist, soll nun im Januar 1998 erscheinen.
Ein Preview von Foundation gibt es in der n&auml;chsten Ausgabe von AMIGA
AGPJ.<P><BR>
<LI><B>The Shadow of the third Moon erschienen</B><P>
Die erste kommerzielle Voxel-Engine-Flugsimulation f&uuml;r den Amiga ist auf
der Messe "Computer 97" erschienen. Ein Test des Spiels wird hoffentlich
in der n&auml;chsten Ausgabe von AMIGA AGPJ kommen.<P><BR>
<LI><B>Championship Manager 2</B><P>
CM 2 soll noch vor Weihnachten erscheinen. Mal sehen, ob der Termin diesmal
eingehalten wird.<P><BR>
<LI><B>Myst</B><P>
Myst soll nun endg&uuml;ltig am 1.12. erscheinen. Abwarten!<P><BR>
<LI><B>Diversia-Update</B><P>
Diversia ist nun zu ca. 65 % fertig, und sieht immer besser aus. Eine
Demo-Version wurde leider nur f&uuml;r Spielefirmen ver&ouml;ffentlicht.
Der Command &amp; Conquer-Clone verf&uuml;gt nun &uuml;ber 16 verschiedene Geb&auml;ude und
&uuml;ber Luftflotten (Helikopter,...). Das Spiel wurde au&szlig;erdem erfolgreich
auf CyberGfx-Amigas getestet. Diversia soll Ende 1997 oder Anfang 1998
erscheinen.<P><BR>
<LI><B>Fortress of Fear</B><P>
Fortress of Fear wird ein Rollenspiel mit Actionelementen, &auml;hnlich dem PC-
Superhit Diablo. Wie auch Diablo l&auml;uft das Spiel aus einer isometrischen
Perspektive ab. Statt einer Vielzahl von einzelnen Levels soll Fortress of
Fear aus einer riesigen Welt bestehen. Der Spieler kann darin verschiedene
D&ouml;rfer, Dungeons und vieles andere besuchen, in denen er R&auml;tsel l&ouml;sen mu&szlig;.
Die recht hohen Systemvoraussetzungen sind: mind. 68030/50-Prozessor, 4 MB
RAM, CD-ROM-Laufwerk und Festplatte. Geplant sind eine Version f&uuml;r AGA-
Amigas und eine f&uuml;r Rechner mit CyberGfx. Die Programmierer arbeiten
daneben noch an einer PC-Version des Spiels. Ob eine PowerPC-Version
erscheint, ist noch nicht klar. Fortress of Fear soll 1998 erscheinen, mit
sehr viel Gl&uuml;ck erscheint noch 1997 eine Demo-Version.<P><BR>
<LI><B>The Rin: weiterer Diablo-Clone</B><P>
Mit "The Rin" wurde ein weiterer Diablo-Clone angek&uuml;ndigt. F&uuml;r das Projekt,
das von "The World Foundry" in Angriff genommen wurde, werden noch
jede Menge Entwickler gesucht, da "The World Foundry" genug mit ihren
Projekten "Maim &amp; Mangle" und "Explorer 2260" zu tun haben.<P><BR>
<LI><B>Drive U Crazy von Daztechnique Promotions</B><P>
Drive U Crazy wird ein neues Rennspiel sein, das f&uuml;r einige Plattformen
erscheinen wird, u.a. auch f&uuml;r den Amiga. Es setzt allerdings ein sehr
gutes System voraus: 060-Prozessor und Grafikkarte sollte man schon haben,
um in den Genu&szlig; des Spiels, das &Auml;hnlichkeiten zu Ridge Racer haben wird,
zu kommen. Es  wird au&szlig;erdem (nat&uuml;rlich) nur auf CD-ROM erscheinen, und
einen Techno-Soundtrack haben. Ein Demo soll im Fr&uuml;hjahr 1998 erscheinen.
Man darf gespannt sein.<P><BR>
<LI><B>Construction von The Hidden</B><P>
The Hidden ist ein Programmiererteam, das schon l&auml;ngere Zeit f&uuml;r den AMIGA
aktiv ist. Nun arbeiten sie u.a. an Construction, einem Plattformspiel.
Der Spieler steuert Sharkey und Snork, zwei Bauarbeiter, deren Aufgabe es
ist, eine bestimmte Prozentzahl eines Geb&auml;udes fertigzustellen, bevor sie
ins n&auml;chste Level d&uuml;rfen. Das Spielprinzip erinnert dabei etwas an Tetris.
Das Spiel ist vornehmlich als 2-Spieler-Spiel gedacht, bei dem jeder
Spieler eine Figur steuert, und echtes Teamwork gefragt ist. Nat&uuml;rlich
kann man "Construction" aber auch allein spielen, wobei der Computer den
anderen Bauarbeiter &uuml;bernimmt. Das Spiel wird auf jedem Amiga mit mind.
1 MB Chip RAM laufen.<P><BR>
<LI><B>Eat the Whistle</B><P>
Eat the Whistle ist eines der vier angek&uuml;ndigten Spiele von Hurricane
Software. Es handelt sich dabei um ein Fu&szlig;ball-Spiel, das aus zwei
Spielmodi besteht. Im Arcade-Modus mu&szlig; man mit seinem Team alle anderen ca.
10 Teams besiegen. Jedes Team verf&uuml;gt &uuml;ber spezielle St&auml;rken und Schw&auml;chen.
Der Simulations-Modus versetzt den Spieler in eine Liga.<P>
<LI><B>Nachfolger von Trapped 2</B><P>
Oxyron, die Programmierer von Trapped und Trapped 2 arbeiten entgegen
anderslautender Meldungen nun scheinbar doch an einer Fortsetzung ihrer
erfolgreichen Spiel-Serie. Das Spiel soll aber nicht als Fortsetzung
verkauft werden, sondern als v&ouml;llig neues Spiel. Die 3D-Engine soll
wesentlich besser aussehen als die von Trapped 2 und das Gameplay soll
eher in Richtung 3D-Action gehen. Eine Demo-Version des Spiels soll Anfang
1998 erscheinen.<P><BR>
<LI><B>APC&amp;TCP-News</B><P>
Auf der Computer 97 sind ein Patch und Daten-Disks zu Flyin' High
erschienen. Ob das Spiel dadurch wirklich verbessert wurde, erfahrt Ihr in
der n&auml;chsten AMIGA AGPJ-Ausgabe. Au&szlig;erdem ist die Disketten-Version von
Pinball Brain Damage erschienen. Ein Test der CD-Version, die im November
erscheinen soll, findet sich hoffentlich auch in der n&auml;chsten Ausgabe.
Ein weiterer Titel auf der langen Release-Liste von APC&amp;TCP ist Megablast,
das 1998 erscheinen soll.<P><BR>
<LI><B>Alive Mediasoft sucht Programmierer</B><P>
Alive Mediasoft, die an diversen Amiga-Titeln (z.B. The Haunted) f&uuml;r 1998
arbeiten, suchen Programmierer. Der Programmierer wird f&uuml;r das Projekt
"Arcangel" gebraucht, das einen Amiga mit 16 MB RAM voraussetzen wird und
PowerPC unterst&uuml;tzen soll. Im Moment existiert dieses Spiel allerdings
nur auf Papier, weswegen ein Assembler-Programmier gesucht wird.
Interessenten sollten sich an <A HREF="mailto:andy@alive.demon.co.uk">andy@alive.demon.co.uk</A> wenden.
</UL>
<CENTER><BR><A HREF="0202.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0204.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

