<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>Review: TFX</H2>
Nun ist es also doch noch gelandet. Nach 4 Jahren hat es die CU AMIGA
geschafft, das von vielen herbeigesehnte Spiel TFX auf einer ihrer
Cover-CDs zu ver&ouml;ffentlichen. Doch h&auml;lt das Spiel, was viele von ihm
erwarten ? Dies soll der ausf&uuml;hrliche Testbericht kl&auml;ren, den Ihr jetzt
lesen k&ouml;nnt.<P>
Auf der CD-Rom befinden sich drei unterschiedliche Versionen des Spiels.
Eine f&uuml;r 68000 und bessere Prozessoren, eine f&uuml;r Rechner mit FPU und eine
f&uuml;r 68040 und bessere Prozessoren. Die 68040-Version soll jedoch laut
Berichten einiger Spieler gar nicht laufen. Will man  das Spiel auf seine
Festplatte kopieren, braucht man ca. 10 MB Platz. Nach dem Doppelclick auf
das Icon erwartet den Spieler kein aufwendiges Intro. Dies liegt
wahrscheinlich daran, da&szlig; das Spiel an sich zwar 1993 halbwegs fertig war,
die Entwicklung eines Intros allerdings auf Eis gelegt wurde. Ganz ohne
Intro l&auml;uft das Spiel dennoch nicht an, etwas Musik, ...Ocean presents TFX,
usw.<P>
Als erstes mu&szlig; der Spieler nun seinen Namen eintippen um eine neue
Pilotenkarriere zu starten. Hat er dies getan, gelangt er ins Hauptmen&uuml;, in
dem er die Art des Spiels w&auml;hlen kann. Das Spiel gliedert sich in 5
Unterpunkte:<BR>
Arcade, Training, Simulator, Tour of Duty und Flash Points. Der Arcade-
Modus ist der beste Modus f&uuml;r diejenigen, die vor allem die Action in einer
Flugsimulation m&ouml;gen. Der Modus setzt den Spieler in eine Dogfight-
Situation, in der Action garantiert sein sollte. Training ist die Option,
mit der man seine Pilotenkarriere startet. Die Modi Tour of Duty und Flash
Points setzen eine erfolgreiche Absolvierung des Trainings voraus, bevor
man in ihnen richtige Missionen fliegen kann. Das Training ist zus&auml;tzlich
gut, um sich mit dem Spiel vertraut zu machen. Mehrere Mini-Missionen in
verschiedenen Szenarien gilt es hier gut hinter sich zu bringen. Die
Simulator-Option ist gut, um sich ein Bild von den f&uuml;nf verschiedenen
Szenarien zu machen, n&auml;mlich Europa, Mittlerer Osten, Atlantik, Westafrika
und Zentralamerika. Man kann hier au&szlig;erdem verschiedene Wettersituationen
und Tageszeiten w&auml;hlen. Man kann zum Beispiel im Sturm fliegen, oder bei
Nebel, oder in der Nacht, usw.<P>
Also auf in die Trainings-Missionen. Sehr positiv fallen gleich die
Grafiken auf, so z.B. der sehr gut gemalte Commander, der den Spieler in
die Trainings-Missionen einweist. 10 Missionen gilt es zu erf&uuml;llen, in
denen man in alle m&ouml;glichen Situationen kommt, so ist z.B. das Ziel der
ersten Trainingsmission, eine MiG &uuml;ber Mogadischu zu zerst&ouml;ren, oder das
Ziel der zweiten Mission, ein Bodenziel zu zerst&ouml;ren. Der
Schwierigkeitsgrad dieser Missionen ist sehr gut gew&auml;hlt, um auch Anf&auml;nger
auf die richtigen Missionen der Tour of Duty einzustimmen. Bevor der
Spieler nun endlich ins Geschehen eingreifen kann, mu&szlig; er noch schnell aus
einer fast un&uuml;berschaubaren Sammlung von Waffen die f&uuml;r ihn und die Mission
passenden ausw&auml;hlen, und los geht's.<P>
Auf den ersten Blick sieht die Simulation etwas entt&auml;uschend aus. Es gibt
zwar ein recht gut aussehendes Cockpit, aber die Landschaften sind so
farblos. W&auml;re da nicht das Einstellungsmen&uuml;, in dem man Detailstufen,
Realismus und vieles andere ver&auml;ndern kann. Im Detailmen&uuml; z.B. kann man die
f&uuml;r seinen Rechner perfekte Kombination aus Details und Geschwindigkeit
ausw&auml;hlen. Farben des Horizonts, Texturen an oder aus, usw. k&ouml;nnen hier
ebenso eingestellt werden wie Soundeinstellungen oder die
Joysticksensitivit&auml;t.<P>
Eins steht fest, stellt man die Details und die Farben auf die h&ouml;chste
Stufe, sieht das Spiel brilliant aus. Noch nie habe ich eine so farbenfrohe
Flugsimulation auf dem Amiga gesehen. Auch die Geschwindigkeit ist
auf dieser Detailstufe (zumindest auf einem 68030/50) noch annehmbar. Wer
ein noch schnelleres Spiel haben will, mu&szlig; die Details eben wieder ein
bi&szlig;chen runterschrauben. Gerade bei Nachtmissionen kommt ein unglaubliches
Fluggef&uuml;hl auf, wenn man &uuml;ber eine hellerleuchtete Stadt fliegt.
Ein weiteres Men&uuml; ist das Realismusmen&uuml;. Hier kann man einige Einstellungen
ver&auml;ndern, die einem das Leben erleichtern oder erschweren k&ouml;nnen.
So kann man bestimmen, ob man &uuml;berhaupt abst&uuml;rzen kann, ob Wind und
Temperaturen den Flug beeintr&auml;chtigen usw.<P>
Aber zur&uuml;ck zum Flug. Eine besondere Option von TFX ist das virtuelle
Cockpit. Es erlaubt dem Spieler einen Blick nach links und rechts, als
ob man selbst im Cockpit sitzen w&uuml;rde. Nat&uuml;rlich kann man auch andere
Sichtpositionen w&auml;hlen, einige externe Blickwinkel, eine direkte Sicht auf
den Feind, oder die am&uuml;sante Verfolgung einer Rakete bis zum
(hoffentlichen) Einschlag.<P>
Viele Details in der Landschaft hat man ebenso noch nicht in einer AMIGA-
Flugsimulation gesehen. Berge sehen nicht aus wie Pyramiden, sondern wie
richtige Berge mit Gipfeln, auf denen Schnee liegt usw. Auch Texturen
wurden zuvor noch in keiner AMIGA-Flugsimulation verwendet, wenn sie in
TFX auch nur f&uuml;r das virtuelle Cockpit verwendet wurden, aber dies sieht
zumindest sehr gut aus. Die Wolken in TFX sind ebenso realistischer als in
allen anderen vorigen Flugsimulationen. Ein weiteres unglaubliches Feature
ist die Gr&ouml;&szlig;e der Spielregionen. &Uuml;ber 3 Millionen Quadratmeilen Land bzw.
Luft sollen im Spiel "befliegbar" sein. Dazu geh&ouml;ren Inseln, W&uuml;sten,
St&auml;dte, Fl&uuml;sse, Br&uuml;cken, Stra&szlig;en, usw. Je l&auml;nger man spielt, desto mehr
Details entdeckt man.<P>
Auch die Steuerung von TFX ist recht gut gelungen. Wie in allen
Flugsimulationen laufen die meisten Funktionen &uuml;ber die Tastatur ab. Hat
man aber erstmal die wichtigsten Funktionen im Kopf, stellt dies kein
Problem dar.<P>
Zu empfehlen ist aber eine Lekt&uuml;re der Ausgaben Oktober und November der
CU AMIGA, da man ohne die Anleitung mit Tips am Anfang nicht weit kommt.
Die hier beschriebenen Features sind aber noch lange nicht alles, was TFX
bietet, f&uuml;r jeden, der Flugsimulationen auch nur halbwegs mag, ist TFX ein
absolutes Mu&szlig;, zumal der Preis von 28 DM f&uuml;r die CU AMIGA mit Cover-CD
und TFX ja ein sehr geringer ist. Erh&auml;ltlich ist die Ausgabe Oktober noch
&uuml;ber Nachbestellung aus neueren Ausgaben oder direkt &uuml;ber die Website
der CU AMIGA (http://www.cu-amiga.co.uk/). Hier nun die abschlie&szlig;ende
Wertung:
<PRE>
Grafik:     9/10
Sound:      6/10
Handhabung: 8/10
Spielspa&szlig;: 10/10

GESAMT:     88 %  &lt;------------- AMIGA AGPJ AWARD !!!
</PRE><P>
<B>Fazit:</B> Ein Mu&szlig; f&uuml;r jeden AMIGA-Spieler, der auch nur halbwegs an
Flugsimulationen interessiert ist.<P>
<B>Anmerkung zum Wertungssystem:</B> Der Gesamtwert wird direkt aus den vier
einzelnen Wertungen berechnet. Ab einem Prozentwert von 85 wird ein AMIGA
AGPJ-Award vergeben. Die Wertungen f&uuml;r kommerzielle Spiele lassen sich
nat&uuml;rlich nicht mit den Aminet-Wertungen vergleichen. D.h. Spiele, die
eine Aminet-Wertung von 10/10 bekommen, sind nat&uuml;rlich nicht unbedingt
besser als kommerzielle Spiele, die 80 % bekommen.
<CENTER><BR><A HREF="0205.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0207.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

