<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">
<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Previews</H1>
<UL>
<LI><B>Beambender</B> (Verkosoft - ab sofort erh&auml;ltlich)<P>
Das Spielprinzip von Beambender zu erkl&auml;ren ist nicht sehr einfach. Der
Spieler mu&szlig; den Laserstrahl, der von der "Cannon" abgeschossen wird so
umlenken, da&szlig; er in den "Exit" der gleichen Farbe gelangt. Hierzu stehen
ihm Bauteile zur Verf&uuml;gung, die den Strahl um 90 Grad umlenken, oder
welche, die den Strahl in zwei oder drei Teile aufteilen. Au&szlig;erdem gibt
es sog. Spielfeldteile, die nur einen Strahl der richtigen Farbe
durchlassen, den Strahl verschlucken, usw. Teile, die den Strahl
blockieren, k&ouml;nnen weggesprengt werden. Aus diesem Spielprinzip ergeben
sich Verwicklungen, die ein gutes Denkverm&ouml;gen erfordern. Abgesehen vom
Spielprinzip, das sicherlich Geschmackssache ist, und f&uuml;r das man sich
sicher begeistern kann, leidet Beambender vor allem darunter, da&szlig; es ein
kommerzielles Spiel ist. Ein Shareware-Spiel dieser Kategorie k&ouml;nnte man
uneingeschr&auml;nkt empfehlen, aber 60 DM f&uuml;r das Spiel erscheinen mir ein
bi&szlig;chen sehr hoch gegriffen. Freunde von komplizierten Denkspielen k&ouml;nnen
sich die Demoversion ja einmal anschauen.<P>
<LI><B>Final Odyssey</B> (Vulcan Software - erh&auml;ltlich ab 09. Dezember 1997)<P>
Final Odyssey ist ein Puzzle-Action-Adventure der besten Art. Der Spieler
befindet sich in Form eines kleinen dicken Ritters in einem Labyrinth
mit Schaltern, Kn&ouml;pfen, Teleporten, und vielem mehr. Durch Betreten von
bestimmten Schaltern schlie&szlig;en sich an anderen Stellen L&ouml;cher im Boden,
die das Weiterkommen erm&ouml;glichen. Der Weg durch die Level wird durch
andere Ritter, seltsame wabernde Gestalten und andere Feinde erschwert.
Auch Pfeile, die aus W&auml;nden oder aus dem Boden kommen, wollen den Helden
des Spiels daran hindern, Minotaur zu t&ouml;ten, und einige M&auml;dchen, die er
entf&uuml;hrt hat, zu retten. Der herausragendste Aspekt des Spiels ist die
Grafik. Ein solches farbenfrohe Design der R&auml;ume sieht man selten. Nette
kleine Effekte, wie Spiegel, in denen man sich sehen kann, erh&ouml;hen den
Spielspa&szlig; zunehmend. Hat man sich erstmal etwas in das Spiel "hineinge-
spielt", kommt man lang nicht mehr davon los. Auf die Vollversion darf
man gespannt sein. Ein gro&szlig;er Hit k&uuml;ndigt sich an.<CENTER><IMG WIDTH=320 HEIGHT=256 SRC="FinalOdyssey.jpg" ALT="Final Odyssey Screenshot"></CENTER><P><BR>
<LI><B>Genetic Species</B> (Vulcan Software - erh&auml;ltlich ab Februar 1998)<P>
Genetic Species ist ein weitere Doom-Clone f&uuml;r den Amiga. Aber wenn das
Spiel verspricht, was das diesem Preview zugrunde liegende schon etwas
&auml;ltere Demo 2.0 h&auml;lt, wird es nicht nur ein weiterer Doom-Clone, sondern
der beste Doom-Clone f&uuml;r den Amiga. Ein Demo der endg&uuml;ltigen
Verkaufsversion von Genetic Species soll &uuml;brigens auf der Weihnachts-CD der
Amiga Format erscheinen, die am 25.11. in England rauskommt. Ein weiteres
Preview des neuen Demos oder bereits ein Review der Vollversion k&ouml;nnt Ihr
in einer der n&auml;chsten Amiga AGPJ-Ausgaben lesen. Nun aber zur&uuml;ck zum
Spiel. Das Demo unterscheidet sich nicht so sehr im Spielprinzip von all
den anderen Doom-Clones, wohl aber in der Grafik. Auf der einen Seite sind
die R&auml;ume und G&auml;nge viel h&uuml;bscher als in vergleichbaren Spielen, wozu
Licht- und Schatteneffekte und weitere visuelle Effekte wie Feuer, Glas
und Rauch beitragen. Auf der anderen Seite ist das Spiel schnell. Auf
einem 68030/50-Amiga 1200 ist die Grafik selbst bei einer recht hohen
Aufl&ouml;sung sehr fl&uuml;ssig. Wird die Grafik noch besser (wie versprochen) und
tr&auml;gt dies nicht dazu bei, da&szlig; das Spiel langsamer wird, steht uns ein
gro&szlig;er Hit ins Haus. Ank&uuml;ndigungen wie 40 Levels, 30 Minuten Musik direkt
von CD und ein 200 MB gro&szlig;es Intro tragen noch mehr dazu bei, da&szlig; jedem
Freund von 3D-Ballerspielen jetzt schon das Wasser im Mund zusammenlaufen
d&uuml;rfte.<CENTER><IMG WIDTH=220 HEIGHT=176 SRC="GeneticSpecies.jpg" ALT="Genetic Species Screenshot"></CENTER><P><BR>
<LI><B>Skimmers</B> (APC &amp; TCP - erh&auml;ltlich ab 1998)<P>
Skimmers, das von Team Mango programmiert wird, und bei APC &amp; TCP
erscheinen wird, l&auml;uft nach einem recht neuen Spielprinzip ab. Ein Teil des
Spiels l&auml;uft auf einem quadratischen Spielfeld ab. Vier Gegner k&auml;mpfen
hier darum, das Spielfeld zu erobern, will man ein benachbartes Feld
besetzen, kann man vom Gegner in Form eines Autorennkampfes aus der
Vogelperspektive davon abgehalten werden. Diejenigen, die teilnehmen
wollen, fahren mit ihren Autos auf einer Rennstrecke und versuchen die
anderen Autos zu besch&auml;digen. Derjenige, der am Ende die meiste Energie
&uuml;brig hat, gewinnt. Ist das der Spieler, der das Feld auf dem Spielfeld
besetzen wollte, besetzt er nun das Feld, gewinnt ein anderer Spieler beim
Rennen, passiert nichts. Reihum k&ouml;nnen nun die Gegner versuchen, Felder zu
besetzen. Wenn an den Autorennen noch etwas gefeilt wird
(gew&ouml;hnungsbed&uuml;rftige Steuerung, nicht sehr gute Grafik), k&ouml;nnte Skimmers
ein &Uuml;berraschungserfolg werden. Ein Blick auf die st&auml;ndig verbesserten
Demos, die auf der Homepage von Team Mango heruntergeladen werden k&ouml;nnen,
sollte man sich auf jeden Fall g&ouml;nnen, da das Spiel sicher etwas
gew&ouml;hnungsbed&uuml;rftig ist, und nicht jedermanns Fall sein d&uuml;rfte.<P><BR>
<LI><B>Wheels on Fire</B> (Verkosoft - ab sofort erh&auml;ltlich ) (mind. 68020 + AGA +
OS 3.0 + 2 MB Chip RAM + 4 MB Fast RAM)<P>
Wheels on Fire ist ein Rennspiel mit Voxelgrafik. Leider ist die Grafik
aber nicht sehr gut, die Fahrzeuge sind sehr farblos, und die Voxelgrafik
ist sehr grobpixelig. Die Steuerung dagegen ist sehr gelungen. Der Spieler
steuert ein Auto gegen drei Gegner durch eine h&uuml;gelige Strecke. Kann er
das Rennen als 1. oder 2. abschlie&szlig;en, qualifiziert er sich f&uuml;r die
n&auml;chste Runde und bekommt ein Preisgeld, f&uuml;r da&szlig; er Sch&auml;den an seinem
Rennwagen beheben kann, oder bessere Teile kaufen kann. Kann er auch die
zweite Runde auf derselben Rennstrecke erfolgreich unter den ersten beiden
abschlie&szlig;en, kommt das Finale der besten vier Fahrer. Danach geht es nach
demselben Spielprinzip jeweils auf die n&auml;chsten Strecken. Auch der
Schwierigkeitsgrad von Wheels on Fire wird sehr wohldosiert erh&ouml;ht.
Gewinnt man auf der ersten Strecke mit ein bi&szlig;chen &Uuml;ben noch jedes Rennen,
sind die zweite und vor allem die dritte Strecke schon trainigsintensiver.
Zus&auml;tzliche Motivation verschaffen die speicherbaren Rundenzeiten, selbst
auf Strecken, auf denen man inzwischen weit &uuml;berlegen ist, f&auml;hrt man noch
gern, um seine Rundenzeit um einige Hundertstel zu verbessern. F&uuml;r
Rennspielfans, die nicht so einen gro&szlig;en Wert auf die sch&ouml;nste Grafik
legen, und f&uuml;r die der Spielspa&szlig; wichtiger ist, sollten sich auf jeden Fall
das Demo ansehen.<P>
</UL>
<CENTER><BR><A HREF="0206.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0208.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

