<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Produktvorstellungen</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipr.gif" ALT="Amiga-Aktuell 10/97 - Produktvorstellungen" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Neuer AMIGA: A5000 von DCE</H1>
Ende Oktober &uuml;berraschten AMIGA International und der Hardwarehersteller
DCE mit folgender Verlautbarung:<P><BR>
&#187;Freitag 24.10.1997<BR>
<B>DCE unterzeichnet Lizenzabkommen mit Amiga International.</B><P>
DCE Computer Service GmbH hat eine Lizenz erhalten, Computer auf Basis der
Amiga Technologie herzustellen und zu vertreiben<P>
Gemaess AMIGA Internationals letzte Ankuendigung, eine offene
Unternehmenspolitik in Puncto Lizenzen fuer Amiga durchzufuehren, wurde nun
ein weiterer Lizenzvertrag mit DCE Computer Service GmbH abgeschlossen. Der
Vertrag bezieht sich auf die Herstellung und den Vertrieb von Amiga
Motherboards und Computern, einer selbst entworfenen Produktpalette von DCE
GmbH<P>
Die in Oberhausen ansaessige Firma DCE Computer Service GmbH, hat ein neues
Board entwickelt, das technologisch auf neuestem Stand ist, das auf dem
Amiga A4000 und auf dem Operating System OS 3.1 von Amiga basiert und mit
dem Amiga Chip Set laeuft. Durch den Lizenzvertrag zwischen AMIGA
International, Inc. und DCE Computer Service GmbH ist die Benutzung des
Amiga OS 3.1 sowie eine Liefervereinbarung ueber Amiga eigene Chips
sichergestellt und die Benutzung des Logos "Powered by Amiga" kann an allen
Produkten angebracht werden.<P>
Petro Tyschtschenko, Geschaeftsfuehrer von AMIGA International, Inc. in
Langen, Deutschland, erklaerte: "wie schon versprochen, werden wir mit
unserer offenen Lizenzpolitik weitermachen, um den Amiga Markt zu
erweitern.&#171;<P>
&#187;DCE Computer Service GmbH ist in Europa fuer seine richtungsweisenden
technischen Entwicklungen sehr bekannt. Dieses neu entwickelte Board im
Standard ATX Comfort Tower mit Modularem System, MPEG, Zorro 2/3 Slots, ist
ein weiterer Meilenstein fuer die Zukunft unserer Amiga Technologie".<P>
Herr Thomas Dellert, Geschaeftsfuehrer von DCE Computer Service GmbH
erlaeutert: "Ich glaube, dass dieses neu entwickelte Board, das auf dem
Motorola CPU 68030/50 MHZ und dem 68060/50 MHZ basiert, mit 64/128MB Ram,
einem Standard PC Keyboard, 1,76 MB Floppy Disk, 1,7 Gbyte IDE HDD, 10 -
24  Speed IDE Cd Rom, AGA Chipsatz, Scan Doubler und HF Modulator Optional 
in einem Standard ATX Comfort Tower Case, fuer Amiga ein weiterer Schritt
in die Zukunft ist".<P><BR>
<B>Zu DCE Computer Service GmbH</B><BR>
DCE Computer Service GmbH in Oberhausen, ist ein 1987 gegruendeter
Servicedienstleister und befindet sich zu 100 % im Besitz des
Firmengruenders Thomas Dellert. Das Unternehmen begann als Servicewerkstatt
fuer Grosshaendler und Verbrauchermaerkte und hat sich zu einem der
fuehrenden Anbieter von Reparaturen fuer Amiga Geraete entwickelt. Im Jahr
1993 wurde DCE durch die Firma Commodore zum "European Amiga Repair Service
Center" ernannt und ist seitdem federfuehrend in dem Bereich Amiga Service.
Seit dem Jahr 1995 ist DCE mit der Entwicklung und Fertigung von
Erweiterungen fuer Amiga Rechner beschaeftigt. Eine eigene
Produktionsstrasse auf dem hoechsten  Stand der Produktionstechnik fuer
hoch komplexe Leiterplattenbest&uuml;ckung rundet das Leistungsspektrum ab.
Zahlreiche erfolgreiche Tests in Amiga Fachzeitschriften beweisen die hohe
Leistungsfaehigkeit der von DCE produzierten Produkte. Die konsequente
Weiterentwicklung von Eigenprodukten unterstreicht die Position von DCE als
innovatives Unternehmen, welches die Philosophie vertritt, dass eine
erfolgreiche Zukunft nur durch eine kontinuierliche Optimierung und
Marktanpassung der eigenen Produkt moeglich ist. Zur Zeit beschaeftigt DCE
zwoelf Mitarbeiter, deren staendige technische Schulung eine unabdingbare
Grundlage fuer die gesamte Zielsetzung des Unternehmens darstellt.<P><BR>
<B>Zu AMIGA International, Inc.</B><BR>
AMIGA International, Inc. ist eine 100%ige Tochterfirma von Gateway 2000,
Inc. AMIGA International, Inc ist fuer den Verkauf und den Vertrieb von
Amiga Computern weltweit zustaendig. Das Unternehmen fuehrt seine
Geschaefte von Deutschland, Langen aus. Unter www.amiga.de des World Wide
Web koennen mehr Informationen ueber Amiga abgerufen werden.<P><BR>
<B>Ueber Amiga</B><BR>
Seit der Amiga 1000 im Jahr 1985 auf dem Markt vorgestellt wurde, hat Amiga
eine effiziente Benutzung des Speichers und der Hard Drive Kapazitaet
verkoerpert, waehrend die Pioniere der Industrie Entwicklungen im
Multimedia Bereich, 32 Bit Multitasking und Autoconfiguration machten.
Amiga hat die Industrie dazu gebracht Computer Graphics, Animation und File
Sequences mit Stereo Sound zu verbinden - genau das, was man heute als
Multimedia kennt.<P>
Exclusiver Bericht &uuml;ber unsere neuen Amiga 5000 sowie 6000 nur in der Messe
Ausgabe der Amiga Plus Redaktion 12/97. Besuchen Sie uns auch auf dem Amiga
International Messestand der Computer 97 und bestaunen Sie den dort bereits
vorf&uuml;hrbereiten Amiga 5000.<P><BR>
<B>Presse Information:</B><BR>
Thomas Dellert DCE Computer Service GmbH<BR>
Fax: +49-(0) 208-63 04 96<BR>
Email: <A HREF="mailto:dce@ruhr-net.de">dce@ruhr-net.de</A><BR>
Web  <A HREF="http://www.DCECOM.de">www.DCECOM.de</A><BR>
Petro Tyschtschenko AMIGA International, Inc.<BR>
Fax: +49-(0) 6103- 58 78 88<BR>
Email: <A HREF="mailto:ptysch@amiga.de">ptysch@amiga.de</A><BR>
Web: <A HREF="http://www.amiga.de">www.amiga.de</A>&#171;<P><BR>
Desweiteren hat DCE Schritte zur Vermarktung der A5000/6000 unternommen:<P>
&#187;<B>DCE unterzeichnet Distributionsabkommen mit Power Computing UK.</B><P>
Mittwoch 29.10.1997<BR>
DCE Computer Service GmbH und Power Computing LTD. vereinbaren ein
Distributionsabkommen zur weltweiten Vermarktung der Produkte A 5000 sowie
A 6000. Power Computing wird in den n&auml;chsten Monaten ein weltweites
Vertriebsnetz aufbauen. Weiter Infos erhalten Sie direkt von Power
Computing.<P><BR>
<B>Presse Information:</B><P>
Power Computing LTD<BR>
Unit 82A, Singer Way<BR>
Woburn Road Ind. Estate<BR>
Kempston<BR>
Bedford MK42 7PU<BR>
ENGLAND<P>
Email:<A HREF="mailto:sales@powerc.com">sales@powerc.com</A><P>
<BR>
Telephone number operated from 9:00am to 5:30pm (GMT)+44(0)1234 851500<P>
Facsimile number available 24 hours for all fax orders and enquiries
+44(0)1234 855400&#171;<P><BR>
&#187;<B>Deutsche und italienische Distribution gesichert.</B><P>
Freitag 7.11.1997<P>
Vesalia Computer wird die Distribution der neuen Amiga 5000 und Amiga 6000
&uuml;bernehmen. Kommen Sie zur Computer 97 in K&ouml;ln und besuchen Sie Vesalia
Computer am Stand F32-G33.<P>
In Italien werden die Produkte durch DB-LINE vertrieben.<P>
Presse Information:<P>
Vesalia Computer<BR>
Industriestr.25<BR>
46499 Hamminkeln<BR>
TEL:02852-914015<BR>
TEL:02852-1802<P>
Email: <A HREF="mailto:VCOMPUTER@CWW.DE">VCOMPUTER@CWW.DE</A>&#171;<P><BR>                                                   
Als n&auml;chstes folgt die Ank&uuml;ndigung des A5000 samt Aufz&auml;hlung der Features:<P>
&#187;<B>PRESSEMITTEILUNG</B><P>
09. November 1997<BR>
Produktvorstellung POWER A5000 auf der Computer &#180;97, K&ouml;ln.<P>
Hei&szlig;en Sie mit uns einen wirklich neuen Amiga kompatibelen Computer
willkommen, entwickelt und gefertigt von DCE, Deutschland und weltweit
vertrieben von Power Computing Limited, Gro&szlig;britannien.<P>
Dieser Rechner stellt ,seit dem Bankrott von Commodore, den ersten echten
neuen AMIGA Computer dar, der kompatibel zu den fr&uuml;heren AGA Maschinen und
mit den neusten Technologien aufr&uuml;stbar ist. Dem Power A5000 wird der 
Power A6000 folgen, ein Modell, da&szlig; sich speziell an professionelle
Videoanwender richtet.<P>
Power Computing ist der festen &Uuml;berzeugung, da&szlig; immer noch ein Marktsegment
f&uuml;r Amiga- Systeme vorhanden ist und verhandelt bereits mit  Amiga 
Softwareentwicklern um Updates und Wiedereinf&uuml;hrungen auf den Markt zu
bringen, die die aktuellen, als auch die zuk&uuml;nftigen Modelle (incl.
PowerPCs) unterst&uuml;tzen.<P>
Im Unterschied zu anderen Produkten, liegt dem Power A5000, wie auch dem
A6000, ein hochwertiges, v&ouml;llig neu entwickeltes Motherboard zu Grunde,
welches sich, um Inkompatibilit&auml;ten am Zorro Bus zu vermeiden, am A1200
(A4000 f&uuml;r den A6000) orientiert.<P>
Der  A5000 wird auf der Computer '97  in K&ouml;ln, vom 14. bis zum 16. November
1997 am Stand von Amiga International und auf dem St&auml;nden  F32 und G33
unseres deutschen Distributors, Computer Vesalia zu sehen sein. Die
Markteinf&uuml;hrung des A5000 (mit 68030 50MHz und Zorro II Slots) wird
voraussichtlich Mitte Januar erfolgen.<P>
<B>Features</B>
<UL> 
<LI>Vollkompatibel mit allen AGA Systemen
<LI>VGA Monitore anschlie&szlig;bar
<LI>gro&szlig;e Auswahl an professionellen Anwendungen
<LI>ideal f&uuml;r Videobearbeitung und 3D Animationen
<LI>MPEG Level1 (optional)
<LI>unterst&uuml;tzt Zorro II oder Zorro III Grafikkarten
<LI>komplett offen f&uuml;r zuk&uuml;nftige Erweiterungen
<LI>Anschlu&szlig;m&ouml;glichkeit f&uuml;r eine A4000 Tastatur oder eine PS/2 PC Tastatur
<LI>Video Composite Signal zum Anschlu&szlig; an Videorecorder
<LI>Anschlu&szlig;m&ouml;glichkeit an ein Standard TV-Ger&auml;t &uuml;ber optionalen Modulator
</UL><P> 
<B>Spezifikationen</B>
<UL> 
<LI>25/40 MHz 68040 
<LI>SCSI II Controller optional 
<LI>Kickstart 3.1 ROMs
<LI>AGA Chipsatz
<LI>2 MB Chip Ram on-board
<LI>bis zu 128 MB Fast Ram, 2 * Standard 72-pin SIMMs
<LI>Standard 880KB Diskettenlaufwerk oder optionales 1.76 MB HD
  Diskettenlaufwerk
<LI>vier Zorro II Slots oder Zorro III oder zuk&uuml;nftig PCI.
<LI>Future BUS Connector f&uuml;r PPC Erweiterungen
<LI>zwei IDE Schnittstellen, f&uuml;r bis zu je  2 IDE Einheiten
<LI>1.7 GB Festplattenlaufwerk
<LI>von 10x bis zu 24x fach CD-ROM Laufwerk
<LI>Scandoubler on-board
<LI>optionaler Video Modulator
<LI>batteriegepufferte Uhr
<LI>Flash EPROM f&uuml;r zuk&uuml;nftigen Gebrauch
<LI>ATX Comfort Towergeh&auml;use
<LI>230W Netzteil, 110/230V Auto-Switch
</UL><P>
<B>Externe Schnittstellen</B>
<UL>
<LI>serielle Schnittstelle, 9-pin
<LI>parallele Schnittstelle, 25-pin
<LI>VGA Schnittstelle, 15-pin
<LI>2 <LI>Mouse/Joystick Schnittstelle, 9-pin
<LI>AMIGA-Tastatur Schnittstelle, 5-pin
<LI>6-pin mini-DIN for PS/2 keyboards
<LI>PS/2 Tastatur Schnittstelle, 6-pin Mini DIN
<LI>2 <LI>Audio out
<LI>VideoComposite out
</UL><P>
Preise, Verf&uuml;gbarkeit und weitere technische Details werden nach der
Computer&#180;97 erh&auml;ltlich sein.&#171;<P>
Im Rahmen einer Messenachlese gibt DCE konkrete Informationen zu den
zwischenzeitlich vorgenommenen &Auml;nderungen (u.a. war anfangs ein 68030/50MHz
als Hauptprozessor vorgesehen) bekannt:<P>
&#187;Die wohl wichtigste Neuerung ist die Tatsache das der A5000 nun sofort mit
einem 68040/25 - 40 Prozessor ausgestattet wird. Auch wird eine SCSI-II
Schnittstelle neben den IDE Ports verf&uuml;gbar sein. Um allen Kunden eine
Aufr&uuml;stung zur erm&ouml;glichen wird in enger Zusammenarbeit mit PHASE5 eine PPC
Schnittstelle entwickelt und auf dem Board vorhanden sein. Durch unser
modulares Schnittstellen  System sind wir in der Lage dem Kunden
verschiedenartige Zorro bzw. in Zukunft PCI Schnittstellenerweiterungen
anzubieten. Durch dieses offene System ist eine &Auml;nderung des Slotsystems
jederzeit m&ouml;glich. Die Zukunft des Rechners ist somit gesichert. Wir werden
Sie &uuml;ber die Entwicklung hier auf unsere Homepage auf dem laufenden
halten.&#171;<P>
... und nicht nur auf der Homepage: Thomas Dellert, Gesch&auml;ftsf&uuml;hrer von
DCE, hat in der &Ouml;ffentlichkeit weitere Informationen preisgegeben. Demnach
wird der A5000 auch den aus dem CD&#179;&#178; bekannten Akiko-Chip enthalten, der
u.a. bei gewissen Aufgaben (schneller Grafik usw.) den Hauptprozessor
entlasten soll.<P>
Ob Zorro II- oder Zorro-III-Slots zum Einsatz kommen, h&auml;nge v.a. davon ab,
ob es gelingt, gen&uuml;gend Buster Rev. 11 (wird f&uuml;r die ZorroIII-Ansteuerung
ben&ouml;tigt) zu beschaffen.<P>
Der Preis f&uuml;r einen A5000/040-33MHz soll, inkl. 1,7GB-Festplatte, schnellem
CD-ROM-Laufwerk und 16 MB Fast-RAM, bei etwa DM 1600,- liegen, die 40MHz-
Version wird laut dem DCE-Gesch&auml;ftsf&uuml;hrer etwa DM 120,- teurer sein.<P><BR>
<B>Fazit:</B><P>
Selten &auml;u&szlig;ere ich meine Meinung dazu, wenn ein Produkt scharf kritisiert
oder sehr gelobt wird, da dies meist zurecht geschieht. Da&szlig; jedoch einige
AMIGA-Anwender dieses Ger&auml;t &ouml;ffentlich geradezu in der Luft zerfetzt haben,
hat mich nicht nur sehr gewundert, sondern, ich gebe es offen zu, schlicht
ge&auml;rgert.<BR>
Da plant ein Hersteller einen AMIGA mit einem neuentwickelten Mainboard,
serienm&auml;&szlig;igen Extras (Scandoubler, Akiko-Chip des CD&#179;&#178; usw.), guten
Aufr&uuml;stm&ouml;glichkeiten (ZorroIII-Architektur, PowerPC-BUS usw.) und
ordentlicher Rechenleistung zu einem Preis, der bis dato auf dem AMIGA-
Markt unerreicht ist - und erntet massive Kritik.<P>
Zwar wurde das Ger&auml;t anfangs mit etwas anderen Spezifikationen geplant, so
sollte z.B. ein 68030/50MHz zum Einsatz kommen, jedoch ist der
Leistungsunterschied zwischen dieser CPU und einem 68040/25MHz im Integer-
Bereich minimal, und nur bei Flie&szlig;komma-Operationen gravierend. Diese werden
wiederum v.a. von professionellen (Grafik-) Programmen benutzt, deren
Anwender wohl in der Regel sowieso einen 68060-Rechner vorziehen.
Sicher ist eine Aufwertung der Technik bei beinahe unver&auml;ndertem Preis
positiv, aber die urspr&uuml;nglichen Spezifikationen waren nicht so schlecht,
da&szlig; man das Ger&auml;t derart niedermachen mu&szlig;te.
Es scheint wirklich Anwender zu geben, die meinen, eine Firma wie DCE k&ouml;nne
im Alleingang und innerhalb k&uuml;rzester Zeit eine neue, revolution&auml;re AMIGA-
Technologie (Super-Grafikchips usw.) entwickeln und zu Spottpreisen
(wom&ouml;glich noch unter DM 1000,-) als "den neuen AMIGA" auf den Markt
bringen.<BR>
Es gibt Haufenweise Gr&uuml;nde, warum das v&ouml;llig unm&ouml;glich ist, und es w&uuml;rde
meinen Zeitrahmen sprengen, sie alle niederzuschreiben und zu erl&auml;utern,
weshalb ich mir das schenke.<P>
Ich fordere nur alle AMIGA-Anwender auf, den Sinn f&uuml;r Realit&auml;t nicht zu
verlieren. Ihr braucht ihn vielleicht noch!
<CENTER><BR><A HREF="0600.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0602.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod1.gif" ALT="[Produktvorstellungen]" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

