<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Produktvorstellungen</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amipr.gif" ALT="Amiga-Aktuell 10/97 - Produktvorstellungen" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Schatztruhe GmbH k&uuml;ndigt neue Spiele-CDs an</H1>
&#187;Mehrere faszinierende Amiga-Spiele kommen derzeit neu auf den Markt.
Bestellen Sie fr&uuml;hzeitig, damit Sie mit einer Lieferung noch vor
Weihnachten rechnen k&ouml;nnen. Insbesondere bei Myst sind Lieferengp&auml;sse zu
erwarten.&#171;<P>
<PRE>
&#187;Game        price    - Preis      available - verf&uuml;gbar

<A HREF="#Myst">Myst</A>         US$57.00 - DM 99,00   12/12/97 - 12.12.97
<A HREF="#Shadow">Shadow of</A>    US$51.00 - DM 89,00   NOW      - ab sofort
<A HREF="#Shadow">the 3rd Moon</A>
<A HREF="#Uropa">Uropa 2</A>      US$51.00 - DM 89,00   NOW      - ab sofort&#171;
</PRE><P>
<A NAME="Myst"></A>
&#187;<H3><B>Myst</B></H3><P>
<B>Das bestverkaufte Spiel aller Zeiten</B><P>
Langerwartet und hei&szlig;ersehnt ist Myst, das r&auml;tselhafte Mysteryadventure,
nun auch f&uuml;r den Amiga verf&uuml;gbar. Das Spiel liegt exklusiv in einer
deutschen Version vor.<P>
Die CyberGraphX-Version l&auml;uft im 24-Bit-Modus mit 16 Millionen Farben.<P>
Zu einem sp&auml;teren Zeitpunkt wird zudem eine PowerPC-Version verf&uuml;gbar sein.
Sie k&ouml;nnen dann dieses Upgrade kostenlos vom Aminet beziehen.<P>
Die Myst-CD enth&auml;lt als Bonus einen 14-min&uuml;tigen QuickTime-Film "The Making
of Myst", in dem die Autoren Sie hinter die Kulissen der Entwicklung des
Spiels blicken lassen.<P>
Myst nutzt das AHI-Soundsystem von Martin Blom. Die aktulle Version von AHI
wird auf der CD mitgeliefert. Sie brauchen AHI zudem nicht in Ihrem System
zu installieren. Wenn bei Ihnen kein bereits installiertes System von AHI
vorliegt, so benutzt Myst das AHI-System direkt von der CD.<P>
<B><B>Weitere wichtige Features von Myst:</B></B><BR>
<UL>
<LI>100% systemkonform
<LI>volles Multitasking
<LI>hochaufl&ouml;sende Grafik (640x400 in min. 256 Farben)
</UL><P>
Das Installationsprogramm erlaubt es Ihnen zu w&auml;hlen, wieviel Daten auf
Ihrer Festplatte installiert werden sollen. Je mehr Sie auf Festplatte
installieren, desto schneller kann Myst auf diese Dateien zugreifen und
l&auml;uft dadurch schneller (dies ist besonders wichtig, wenn Sie ein
langsameres CD-ROM-Laufwerk oder eine weniger schnelle CPU haben).
<P>
<B>Installationsm&ouml;glichkeiten:</B><P>
<UL>
<LI>5MB - nur der Programmcode
<LI>40MB - alle Tondateien
<LI>270MB - alle Grafiken
<LI>310MB - Alle Grafiken und Tondateien
</UL><P>
<B>Minimale Systemanforderungen f&uuml;r AGA-Amigas:</B><BR>
68020, CD-ROM-Laufwerk (2x), 8MB RAM, 5MB Platz auf Festplatte.<P>
<B>Minimale Systemanforderungen f&uuml;r Amigas mit Grafikkarte:</B><BR>
68020, CD-ROM-Laufwerk (2x), 8MB RAM, 5MB Platz auf Festplatte.<P>
<B>Optimale Systemausstattung f&uuml;r AGA-Amigas:</B><BR>
68060, CD-ROM-Laufwerk (12x), 16MB RAM, 100MB Platz auf Festplatte.<P>
<B>Optimale Systemausstattung f&uuml;r Amigas mit Grafikkarte:</B><BR>
68040, CD-ROM-Laufwerk (12x), 16MB RAM, 100MB Platz auf Festplatte.<P>
Programm: deutsch<BR>
Dokumentation: deutsch<BR>
Hersteller: ClickBoom, Kanada<BR><BR><BR>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A></CENTER><BR><BR>
<A NAME="Shadow"></A>
<H3><B>Shadow of the 3rd Moon</B></H3>
<B>Der Action-Flugsimulator</B><P>
Steigen Sie in Ihren Flieger und bestreiten Sie bis zu 48 Missionen in
faszinierenden Landschaften. Erleben Sie K&auml;mpfe gegen intelligente
Gegner und einen hohen Grad von Realismus in der Darstellung aller
Aktivit&auml;ten.<P>
<B>Kurz&uuml;bersicht:</B>
<UL>
<LI>3D Routinen basierend auf der neuen 3dTIS Voxelengine
<LI>absolut realistisches Fluggef&uuml;hl mit fantastischem Spielspa&szlig;
<LI>6 verschiedene Kampagnen
<LI>bis zu 48 Missionen
<LI>digitaler Soundtrack direkt von CD
<LI>realistische Nebel-, Feuer-, Rauch- und Wassereffekte
<LI>fantastische Landschaften mit Bergen, Fl&uuml;ssen und T&auml;lern
<LI>Kontrolle &uuml;ber Maus, Tastatur und Joystick
<LI>hochintelligente Gegner
</UL><P>
<B>Systemanforderungen:</B><P>
Amiga mit CD-ROM-Laufwerk, min. 68EC030, min. Kick 3.0, AGA oder
Grafikkarte (CyberGraphX), 13MB Platz auf Festplatte, 1MB Chip-RAM, 4MB
Fast-RAM.<P>
<B>Unterst&uuml;tzt au&szlig;erdem:</B><BR>
optimiert f&uuml;r 68040 und 68060<P>
Programm: deutsch, englisch, italienisch<BR>
Dokumentation: deutsch, englisch, italienisch<BR>
Hersteller: Titan Computer, Deutschland<P><BR><BR>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A></CENTER><BR><BR>
<A NAME="Uropa"></A>
<H3><B>Uropa 2</B></H3>
<H3>Strategie und Action in 3D</H3>
Uropa ist ein auf isometrischer 3D-Grafik und Lightsource Verktorgrafik
basierendes Spiel. Der Handlungsschauplatz ist der Mond von Uropa. Bek&auml;mpfe
die b&ouml;sen Kapones und finde ihren f&uuml;hrenden Kopf, der f&uuml;r ihre Handlungen
verantwortlich ist!<P>
<B>Die Hintergrundgeschichte:</B><BR>
W&auml;hrend des interstellaren Krieges gegen die au&szlig;erirdischen
Invasionsflotten wurden die Einrichtungen und Verteidigungsanlagen der
meisten Erdkolonien stark besch&auml;digt. Der Angriff der Invasionsflotten
konnte nur unter gro&szlig;em Verlust an Menschenleben abgewehrt werden. Die
Erdkolonien erholten sich nur langsam von dieser Katastrophe.<P>
Um in Zukunft einer derartigen Situation begegnen zu k&ouml;nnen, bildeten die
Erdkolonien eine Allianz mit Mutter Erde, zum Zweck der Einrichtung einer
Friedenstruppe. Diese Einrichtung ist bekannt als Intercorp.<P>
Intercorp bildet den milit&auml;rischen Arm der Erdkolonien und wird durch eine
Politik finanziert, bei welcher der Auftraggeber bezahlt. Jeder Einsatz, an
dem Intercorp beteiligt ist, wird von der Kolonie oder von den um Hilfe
ersuchenden Kolonien bezahlt.<P>
Intercorp koordiniert 3 Spezialeinheiten. Die zentrale Spezialeinheit setzt
sich aus Menschen und intelligenten Droiden zusammen, die Tekiten genannt
werden. Die Menschen haben das Oberkommando. Menschen und Tekiten bilden
die Hauptstreitkr&auml;fte Intercorps. Die Schl&uuml;ssel-Spezialeinheit besteht aus
intelligenten Droiden, die Kapones genannt werden. Sie sorgen f&uuml;r die
laufende Verteidigung wichtiger Einrichtungen der Erdkolonien. Die dritte
Einheit ist die Centurion Spezialeinheit und besteht aus 100 Elite-Tekiten.
Du bist die neueste Kraft dieser Spezialeinheit.<P>
Die Centurions bilden eine geheime Eingreiftruppe, die haupts&auml;chlich bei
geheimen Operationen des Nachrichtendienstes oder bei taktischen Eins&auml;tzen
gegen feindliche Einrichtungen eingesetzt werden. Sie leistet die Vorarbeit
f&uuml;r die zentrale Spezialeinheit, die daraufhin eingreifen kann.<P>
Die Kolonie Uropa2 befindet sich auf einem kleinen Mond, der um den Jupiter
kreist. Er hie&szlig; in der Vergangenheit Europa. Der Mond wurde w&auml;hrend der
Kriege fast vollst&auml;ndig zerst&ouml;rt. Aufgrund seiner gro&szlig;en
Bodenschatzvorkommen bauten die Bewohner die Kolonie wieder auf und
benannten ihn um in Uropa2. Der Mond befindet sich in den &auml;u&szlig;eren Zonen der
Einflu&szlig;sph&auml;re der Erde und ist aufgrund seiner strategisch wichtigen Lage
eine ihrer wichtigsten Au&szlig;enposten zum Aufsp&uuml;ren feindlicher Flotten.<P>
Es existieren 12 Stationen auf Uropa2, die durch ein einheitliches Netzwerk
miteinander verbunden sind. Jede Station besitzt Einrichtungen zur Raum-
und Sub-Raum&uuml;berwachung mit unterschiedlichen &Uuml;berwachungssstufen. Nur von
der zentralen Kommunikationsbasis Castilia aus ist direkte Kommunikation
mit Intercorp m&ouml;glich.<P>
Die &Uuml;berwachungsssysteme von Uropa2 wurden in die H&auml;nde menschlicher
Kolonisten gelegt. Diese friedliebenden Kolonisten haben weder ein Waffen-
noch ein Abwehrtraining genossen. Aus diesem Grund wurde Intercorps
Schl&uuml;ssel-Spezialeinheit mit dem Schutz der Kolonie betraut.<P>
Aus verd&auml;chtig erscheinenden Gr&uuml;nden der Gier hat die Schl&uuml;ssel-
Spezialeinheit auf Uropa2 gegen Intercorp rebelliert und das Kommando auf
dem Mond an sich gerissen. Die Kommunikation mit dem Mond ist gest&ouml;rt und
das Schicksal der Kolonisten ungewi&szlig;. Die Kapones agieren als S&ouml;ldner f&uuml;r
einen von Intercorps interstellaren Feinden mit dem Auftrag, Uropa2 zu
zerst&ouml;ren.<P>
<B>Technischer Hintergrund:</B><BR>
<UL>
<LI>10 gigantische strategiebasierte Missionen
<LI>Isometrisches 3D Actionadventure
<LI>Unmengen taktischer Probleme zu l&ouml;sen
<LI>Voll digitale Sprache
<LI>Progressive Waffen
<LI>Gerenderte 3D Introanimation
<LI>F&uuml;r eigenen Bed&uuml;rfnisse konfigurierbar
<LI>Als Bonus "Hovar Wars" f&uuml;r 2 Spieler mit serieller Vernetzung
</UL><P>
<B>Systemanforderungen:</B><BR>
Amiga mit 4xCD-ROM-Laufwerk, Festplatte, 2MB RAM (1MB Chip- &amp; 1MB Fast-
RAM).<P>
<B>Unterst&uuml;tzt au&szlig;erdem:</B><BR>
AGA Chipsatz, mehr Speicher, schnelle CPUs und schnellere CD-ROMs.<P>
Programm: deutsch, englisch, ital., franz.,norwegisch, finnisch, d&auml;nisch,
schwedisch, portugiesisch, tschechisch<BR>
Dokumentation: deutsch, englisch, ital., franz.,norwegisch, finnisch,
d&auml;nisch, schwedisch, portugiesisch, tschechisch<BR>
Hersteller: Vulcan Software Limited, England&#171;<P><BR>
<B>Weitere Informationen gibt es bei:</B><P>
Stefan Ossowskis Schatztruhe Gesellschaft f&uuml;r Software mbH, Veronikastr.
33, 45131 Essen, Tel. 0201/788778, Fax 0201/798447, E-Mail:
<A HREF="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</A>, WWW: <A HREF="http://www.schatztruhe.de/">http://www.schatztruhe.de/</A>

<CENTER><BR><A HREF="0605.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0607.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod1.gif" ALT="[Produktvorstellungen]" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

