<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Diverse News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amidn.gif" ALT="Amiga-Aktuell 10/97 - Diverse News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>REBOL - die neue Computersprache von Carl Sassenrath</H1>
&#187;<B>Was ist REBOL?</B><P>
REBOL bedeutet Relative Expression-Based Object Language (Relative
Ausdruck-basierende Objektsprache). Sie wurde &uuml;ber mehrere Jahre von Carl
Sassenrath erstellt, der als der Software-Architekt des Amiga Multitasking-
OS bekannt ist.<P>
REBOL bietet eine einfache M&ouml;glichkeit, Informationen und Funktionen
zwischen Computern und Applikationen auszutauschen. Es ist dazu bestimmt,
Daten zu organisieren und einfache Aufgaben auszuf&uuml;hren. REBOL ist gedacht
f&uuml;r Anwender, Ausbilder, Netzwerk- und Multimedia-Autoren, Techniker,
Forscher... jeden, der L&ouml;sungen f&uuml;r verschiedenste Probleme sucht, die in
der modernen Welt der vernetzten Computer auftreten.<P>
Wenn Sie schon einmal HTML oder Shell-Skripte geschrieben haben, k&ouml;nnen Sie
auch REBOL schreiben. Es ist eine Nachrichten-Sprache, keine
Programmiersprache.<BR>
Im wesentlichen behandeln REBOL-Skripte das Internet, als w&auml;re es Ihr
eigener Computer. Nachrichten k&ouml;nnen &uuml;bertragen werden via E-Mail, Web oder
FTP, aber auch direkte Kommunikation &uuml;ber einen neuen Typ von Nachrichten-
Port ist m&ouml;glich. Nachrichten k&ouml;nnen nur aus einer einzigen Zeile bestehen
oder aber so komplex wie eine Mini-Applikation sein.<P>
Wie spricht man REBOL aus? Wir sprechen es wie "Rebell", was bedeutet:
"Eine Person, die sich auflehnt gegen Autorit&auml;t, Unterdr&uuml;ckung oder
Herrschaft". (Und viele f&uuml;gen die Worte "von Microsoft" ans Ende dieser
Definition an.)&#171;<P><BR>
&#187;<B>REBOL/Core Alpha vor der Auslieferung</B><P>
Die Alpha-Testversion von REBOL/Core ist in der letzten Stufe der
Entwicklung und interner Tests. Im letzten Monat ist die Software stabil
genug geworden, um sie f&uuml;r wichtige Aufgaben einzusetzen, wie unseren E-
Mail list server (Rebot), oder um unsere Referenz-Dokumentation ins HTML-
Format zu konvertieren.<BR>
In der kommenden Woche werden wir einige wichtige Dokumente fertigstellen
und beginnen, das Hauptprogramm, Dokumentation und Beispiele einiger
Personen von unserer E-Mail-Liste zu ver&ouml;ffentlichen.<P><BR>
<B>Warum nur eine Alpha-Testversion?</B><P>
Diese Ver&ouml;ffentlichung von REBOL/Core enth&auml;lt viele n&uuml;tzliche Datatypes und
Funktionen. Wir sehen sie dennoch als Alpha an, da einige der
Hauptkonzeptionen noch weiterentwickelt werden. Wir brauchen die Freiheit,
REBOL's Kerntechnologie weiter zu verbessern, ohne auf Kompatibilit&auml;t
mit einer Basis an Applikationen R&uuml;cksicht nehmen zu m&uuml;ssen.<P>
Mit anderen Worten: Funktionsnamen und Operationen k&ouml;nnen sich &auml;ndern,
solange die Testphase nicht abgeschlossen ist. (Prototyp-Tester sollten
sich darauf einstellen, da&szlig; die Alpha-Version anders sein wird als die
fr&uuml;heren Versionen.) Au&szlig;erdem gibt es eine Reihe wichtiger Funktionen,
die noch nicht implementiert sind, die wir aber in einer Beta-
Ver&ouml;ffentlichung einschlie&szlig;en wollen.<P><BR>
<B>REBOL auf verschiedenen Plattformen!</B><P>
Im Oktober portierte Carl REBOL/Core auf einige andere Computersysteme,
haupts&auml;chlich als Test f&uuml;r die Berechenbarkeit des Kernel-Codes.
Die Alpha-Version l&auml;uft nun auf dem Amiga, Linux (X86), PC und Macintosh.
Diese werden alle als Alpha-Version erh&auml;ltlich sein, und wir erwarten,
andere Plattformen in den n&auml;chsten Monaten dazuzunehmen.<P><BR>
<B>Wie bekomme ich REBOL?</B><P>
REBOL is noch nicht allgemein erh&auml;ltlich. Wenn Sie allerdings eine private
Kopie der Alpha-Version haben wollen, treten Sie unserer E-Mail-Liste bei,
um weitere Informationen und Anweisungen zu erhalten.<P><BR>
<B>Was kostet es?</B><P>
Wir wollen REBOL als Shareware (US-$50) f&uuml;r private, nicht-kommerzielle
Anwendung ver&ouml;ffentlichen. Dies wird eine voll funktionsf&auml;hige Version ohne
Shareware-Einschr&auml;nkungen und Tricks sein.
Kommerzielle, Paket- und Lizenzversionen werden au&szlig;erdem f&uuml;r Gesch&auml;fte,
Institutionen und Regierungsbeh&ouml;rden erh&auml;ltlich sein.
Wir sind jedoch offen f&uuml;r Ihre Vorschl&auml;ge.
Senden Sie Ihre Kommentare an: <A HREF="mailto:carl@sassenrath.com">carl@sassenrath.com</A><P>
Copyright &#169; Carl Sassenrath 1997<BR>
REBOL is a Trademark of Carl Sassenrath&#171;<P>
(&Uuml;bersetzungen aus dem Englischen von Heiko Kuschel.)
<CENTER><BR><A HREF="0704.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0706.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div1.gif" ALT="[diverse News]" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

