<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Diverse News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amidn.gif" ALT="Amiga-Aktuell 10/97 - Diverse News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1>Newtek setzt nach wie vor auf den AMIGA</H1>
In der letzten Zeit mehrten sich Ger&uuml;chte, nach denen Newtek, Hersteller
von Produkten f&uuml;r den professionellen Video- und Grafikbereich, den AMIGA-
Markt verlassen wolle. Aus diesem Grund hat sich vor kurzem der Pr&auml;sident
von Newtek zu Wort gemeldet:<P>

&#187;<B>EINE ANK&Uuml;NDIGUNG VON NEWTEK &Uuml;BER GEGENW&Auml;RTIGE UND ZUK&Uuml;NFTIGE ENTWICKLUNG
F&Uuml;R DEN AMIGA</B><P>
Nun, es freut mich zu sehen, da&szlig; Newtek und unsere Produkte immer noch
sehr beliebt sind. Dennoch denke ich, da&szlig; eine Reihe von Mi&szlig;verst&auml;ndnissen
m&ouml;glich sind. Ich m&ouml;chte mir die Zeit nehmen, diese Themen aufzugreifen,
so da&szlig; Sie klar sehen, wo NewTek steht.<P>
Auf der NewTek-Messe letzten Monat wurde im H&auml;ndlertreffen eine Aussage
gemacht, die sich darauf bezog, da&szlig; NewTek's Amiga-Entwicklung gestoppt
worden sei.<BR>
NewTek ist heute im Desktop-Video-Gesch&auml;ft t&auml;tig, und f&uuml;r zehn Jahre war
der Amiga der daf&uuml;r am besten geeignete Computer. Jetzt, da der Amiga in
den H&auml;nden von Gateway 2000 ist, bereiten wir unseren n&auml;chsten Schritt vor.
Gateway stellt uns das Potential zur Verf&uuml;gung, eine Reihe von
verschiedenen Entwicklungen gleichzeitig zu verfolgen, manche offenkundig,
andere weniger.<BR>
Ich bin in nahezu t&auml;glichem Kontakt mit den Leuten von Gateway 2000, um
eine Vereinbarung vorzubereiten. Einer der ersten Schritte von Gateway ist
die Lizensierung von QuikPak. Wir haben diese Verbindung vorangetrieben und
sind froh zu sehen, da&szlig; eine zuverl&auml;ssige Versorgung mit Ausstattung,
Ersatzteilen und Garantieservice allen Amiga-Usern zug&auml;nglich sein wird.<P>
Was unser Engagement f&uuml;r Sie, unsere Kunden, anbelangt, so war NewTek's
Ziel immer, unseren Kunden die besten Instrumente zur Verf&uuml;gung zu stellen,
und das zu einem erschwinglichen Preis. Dieser Zugang hat bewirkt, da&szlig; eine
signifikant gro&szlig;e Anzahl von Personen die M&ouml;glichkeit hatte, Karriere zu
machen und ihren Lebensunterhalt zu verdienen, indem sie etwas taten, was
ihnen Spa&szlig; machte, was ansonsten wohl nicht m&ouml;glich gewesen w&auml;re. Seit
unserem Ummzug nach San Antonio haben wir zus&auml;tzliche Kr&auml;fte daf&uuml;r
eingesetzt, unseren Kundenservice zu verbessern. Der Stab f&uuml;r den
technischen Support wurde verdoppelt, und &uuml;ber die H&auml;lfte dieser Leute
spezialisiert sich auf nichts als die Toaster und Flyer-Themen. Au&szlig;erdem
haben wir eine gro&szlig;e Anzahl von Amiga-Programmierern im Team, die an
zuk&uuml;nftigen Entwicklungen arbeiten.<P>
Eine der anderen Gesch&auml;ftskomponenten, an denen NewTek arbeitet, ist die
Entwicklung von Drittanbietern. F&uuml;r viele Kunden war einer der
hervorstechendsten Aspekte von NewTek-Produkten die Unterst&uuml;tzung durch
Drittanbieter, die zus&auml;tzliche M&ouml;glichkeiten und Funktionen er&ouml;ffnen. Wir
begr&uuml;&szlig;en und unterst&uuml;tzen diese Bem&uuml;hungen und erwarten, noch viel mehr
Entwicklungen aus diesem Bereich zu sehen, insbesondere f&uuml;r Toaster, Flyer
und LightWave.<P>
Wir bleiben der Amiga-Technologie verbunden und glauben, da&szlig; die Zukunft
das Potential f&uuml;r gr&ouml;&szlig;ere Dinge birgt. Wir haben nie aufgeh&ouml;rt, an unsere
Unterst&uuml;tzung f&uuml;r den Amiga, unsere Kunden, oder das kreative Talent, das
Wege zur Verbesserung dieser Technologie findet, zu glauben.<P>
Wie immer wissen wir den hohen Wert, den Sie in NewTek und unsere Produkte
legen, zu sch&auml;tzen. Es ist absolut unsere Mission, in der Tat unsere
Leidenschaft, sicherzustellen, da&szlig; Sie die besten, aufregendsten Werkzeuge
haben, die m&ouml;glich sind, und das zu einem Preis, der unsere Wettbewerber in
den Wahnsinn treibt.<P>
Dwight Parscale<BR>
President and CEO<BR>
NewTek Partners, LP&#171;<P>
(&Uuml;bersetzt aus dem Englischen von Heiko Kuschel.)
<CENTER><BR><A HREF="0705.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0707.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv0.gif" ALT="Interviev" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div1.gif" ALT="[diverse News]" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

