<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 12/97 - Interview</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">
<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amiintv.gif" ALT="Amiga-Aktuell 10/97 - Produktvorstellungen" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Interview mit Andreas K&uuml;ssner,<BR>Wildfire-Team</H1><H2 ALIGN=CENTER>(von Andreas Etzrodt)</H2>
Andreas Etzrodt hat k&uuml;rzlich ein Interview mit Andreas K&uuml;ssner vom
Programmierteam der Animationssoftware &#187;Wildfire&#171; gef&uuml;hrt und es
freundlicherweise AMIGA aktuell f&uuml;r eine Ver&ouml;ffentlichung zur Verf&uuml;gung
gestellt:<P>
&#187;<OL><LI><B>Die obligatorische erste Frage: Erz&auml;hlt doch mal etwas von Euch. Wer
seid Ihr? Woher kommt Ihr? Wie habt Ihr Euch zusammengefunden? Wie seid
Ihr zum Amiga gekommen?</B><P>
Wir sind ein Dreier-Gespann. Andreas Maschke (WF-Author), Michael Henke
(YP-Author) und ich, Andreas K&uuml;ssner (Beta-Testing, PR :-) ).
Ich kenne Michael Henke aus der Schule und Andreas Maschke haben wir dann
in der Uni kennengelernt. Wir kommen alle drei aus Halle/Saale
(Dunkeldeutschland :-) ) und hatten seit mehreren Jahren Amiga`s. Wir haben
alle auf 500`ern angefangen. Michael und ich waren in der Demo-Scene aktiv,
zuerst in `Comedy`und kurz danach haben wir `Infect` gejoint. Da sind wir
noch immer dabei. Michael ist Programmierer, ich bin der `World-Leader` und
Andreas Maschke (WK-Artworks) arbeitet als `freier Mitarbeiter`, also nicht
als Mitglied von `Infect`.<P><BR>
<LI><B>Wie seid Ihr auf die Idee gekommen, ein so geniales Programm wie
Wildfire auf die Beine zu stellen, wo es doch schon einige Animations-
editoren auf dem Markt gibt (z.B. Mainactor)?</B><P>
Es hat alles mit dem Animations-Projekt Dataworld angefangen. Zur Party
1995 Fredericia/D&auml;nemark wollten wir ein Wild-Demo (Demo ohne jegliche
Hard&amp;Software-Einschr&auml;nkung) erstellen.
Dazu schuf Michael Henke zusammen mit Andreas Maschke ein eigenes
Animationsformat, das Animationen bildschirmf&uuml;llend und recht flie&szlig;end auf
einem 1200`er mit 30 MHz-Turbokarte und 4 MB Fast-Mem abspielen konnte.
Weiterhin war ein Riesen-Vorteil dieses Formates, da&szlig; es eine beliebige
Anzahl von Animationen aneinander reihen kann, ohne da&szlig; eine sichtbare
L&uuml;cke entsteht.<P>
Nat&uuml;rlich wurde ein Konverter f&uuml;r dieses Format ben&ouml;tigt, und Wildfire war
geboren. Anfangs hat Wildfire nichts anderes gemacht, als Animationen im
YAFA-Format zu erzeugen. Jedoch sollte sich das schnell &auml;ndern...<P>
Andreas Maschke hatte fr&uuml;her das Special-Effect-Programm `Dust`
programmiert, welches im Amiga Magazin `Programm des Monats` wurde.
Es hatte zahlreiche fantastische Funktionen, jedoch keine
Benutzeroberfl&auml;che und konnte somit nicht so einfach von `normalen`
Anwendern verwendet werden.<P>
Da wir f&uuml;r die einzelnen Animationen Umblendungen brauchten, wurde eine
Umblend-Funktion eingebaut. Und schon folgte ein weiterer Effekt, und der
n&auml;chste und ....<P>
Nach &Uuml;ber einem Jahr Entwicklungszeit war Wildfire soweit gereift, da&szlig; wir
es als Shareware-Programm herausbrachten. Nach weiteren 5 Monaten zeigten
diverse kommerzielle Vertriebe Interesse und wir entschieden uns f&uuml;r
Oberland Computer als exklusiven weltweiten Vertrieb.<P><BR>
<LI><B>Warum habt Ihr das Programm auf dem Amiga geschrieben, und nicht auf PC
oder Macintosh, wo da doch von vornherein gen&uuml;gend Power zur Verf&uuml;gung
stand?</B><P>
Wir sind eigentlich nur auf dem Amiga aktiv, dies war der Hauptgrund.
Die Arbeit mit coolen Effekten hat viel Spa&szlig; gemacht und es war abzusehen,
da&szlig; Wildfire ein Programm wird, welches viele Funktionen von diversen
Programmen verbindet und man selbst auf nicht ganz so schnellen Rechnern
damit arbeiten kann. Wir schufen einen Echtzeit-Line-Preview, der die
Effekte selbst auf einem Standard-1200er mit 4 MB Fast in Echtzeit anzeigen
kann. Somit war der Amiga nicht zu langsam. Nat&uuml;rlich ist es von Vorteil,
einen sehr schnellen Rechner zu besitzen, Line Previews sind *NICHTS* im
Vergleich zu Echtzeit Farb-Previews auf einer GFX-Karte und einem PPC-
Rechner.<P>
Weiterhin hatten wir noch nie etwas auf einem PC oder Macintosh entwickelt,
und Andreas Maschke arbeitet in seinem `richtigen` Job an PC`s und diversen
Workstations, da bot der Amiga auch Abwechslung.<P><BR>
<LI><B>Woher habt Ihr das Knowhow, so ein Programm zu entwickeln, das beinahe
alles kann, was mit Animationen zu tun hat?</B><P>
Andreas Maschke hat sich prinzipiell fast alles selbst beigebracht.
Er begann mit der Sprache `Oberon` und schuf z.B. Math-Plot und Dust.
Damit sammelte er sehr viel Erfahrung und stieg dann auf C um.<P><BR>
<LI><B>Welche Programmiersprache benutzt Ihr?</B><P>
Wildfire ist komplett in Ansi-C geschrieben, zum &Uuml;bersetzen wird GCC
benutzt. Einige Routinen des YAFA-Players YP sind mit dem TrashmOne in
Assembler gecoded.<P>
Wir hatten mal das ganze mit Storm C im Herbst letzten Jahres probiert (mit
der damals aktuellen Version) und es hat als einziges Compiler-System den
Wildfire Ansi-C Source nicht compilieren k&ouml;nnen.
Einige Teile gingen, und die waren recht langsam und sehr gro&szlig;.<P>
Wir k&ouml;nnen aber nicht einsch&auml;tzen, ob neuere Versionen von Storm C
einwandfrei mit Wildfire zurechtkommen. Es ist einfach zuviel Arbeit,
die (glaube ich) 200 Module in die Oberfl&auml;che von Storm C einzubinden und
somit werden wir das nicht testen.<P>
GCC hat keine Benutzeroberfl&auml;che wie z.B. der Storm und man hat nicht so
einen Storm-Wizard dabei, aber Andreas Maschke findet es nicht gut, mit so
einer &uuml;bertrieben riesigen Oberfl&auml;che zu arbeiten.<P><BR>
<LI><B>Wie lange habt Ihr bislang an Wildfire gearbeitet?</B><P>
Ca. 2 Jahre, fast durchg&auml;ngig sehr intensiv!<P><BR>
<LI><B>Habt Ihr noch viele Ideen, auf die wir uns in k&uuml;nftigen Versionen freuen
d&uuml;rfen?</B><P>
Ja, es gibt noch ein paar Verbesserungen, die die Handhabung noch leichter
machen sollen und den Speicherverbrauch einschr&auml;nken. Dies ist alles
aber recht kompliziert und wird einige Zeit dauern.
Obwohl wir schon &uuml;ber 80 Spezial-Effekte benutzen, werden auch neue
Effekte entwickelt.<P><BR>
<LI><B>Wie kam es zum Wechsel vom Shareware- zu einem kommerziellen Programm?
Zu wenig Registrierungen? Glaubt Ihr, da&szlig; man an einem kommerziellen
Programm mehr verdient (schlie&szlig;lich wollen die Distributoren und H&auml;ndler
auch noch was verdienen)?</B><P>
Die volle Wildfire-Version mit allen Extras hat als Shareware 190 DM
gekostet (Hauptprogramm 60 DM, spezielle PowerPlugs! 60 DM, Axis3D 60 DM,
neuste Version 10 DM).<BR>
Wildfire ist 100% diese Summe wert, jedoch erwarten die meisten Anwender
f&uuml;r diesen Preis ein Handbuch, und auch eine CD w&auml;re nicht schlecht, da man
dort Beispielanimationen etc. unterbringen kann. Die kommerzielle Wildfire-
CD, die ich gestern abend fertiggestellt habe, umfa&szlig;t 600 MB an Daten!<P>
Kurz nach der Ver&ouml;ffentlichung des ersten sehr beeindruckenden Workshops
im Amiga Magazin erhielten wir Anfragen bez&uuml;glich des kommerziellen
Vertriebs von Wildfire. Wir waren an einem Punkt angekommen, an dem wir
dies f&uuml;r den richtigen Schritt hielten und nahmen das Angebot von Oberland
Computer an.<P>
Dies geschah sehr kurz nach der Produktion der Aminet CD 20, auf der eine
Spezial-Version von Wildfire enthalten ist und auch eine Registrierungs-
Karte zum Sonderpreis. Dies bezog sich nat&uuml;rlich auf die Shareware-Version
und somit konnte man bis Ende Oktober 1997 die letzte Shareware-Version bei
mir erhalten. Die registrierten Anwender der Shareware-Version k&ouml;nnen zu
einem g&uuml;nstigen Preis updaten.<P>
Wir denken nicht, da&szlig; man viel mehr Geld mit der kommerziellen Version
verdienen kann.  Ich selbst bin noch tief in den roten Zahlen, was Wildfire
anbelangt.  (Diverse Kontakte zu den Medien, Arbeitsaufwand, sehr viel
Porto, sehr hohe Telefonkosten um die Wildfire-Entwicklung zu koordinieren
etc.). Jedoch denken wir, da&szlig; wir einen gr&ouml;&szlig;eren Kundenkreis ansprechen
k&ouml;nnen, und dies ist f&uuml;r beide Seiten von Vorteil.<P><BR>
<LI><B>Wie viele Registrierungen habt Ihr denn in der Shareware-Zeit erhalten?</B><P>
Viel zu wenig.<P><BR>
<LI><B>Ist die Geschwindigkeitssteigerung der PPC-Version auf einem PowerPC
gravierend? K&ouml;nnt Ihr uns genaue Zahlen nennen?</B><P>
Es h&auml;ngt stark vom Effekt ab, der umgesetzt ist. Bei rein mathematischen
Effekten (z.B. DLA) kann man einen Faktor von &uuml;ber 20 erreichen.
Bei den meisten anderen Effekten liegt die Steigerung zwischen
200% und 600%. Dies ist dadurch bedingt, da&szlig;, wenn man z.B. einen Effekt
f&uuml;r einen Punkt berechnet, auch meist die Nachbarpunkte in
`Mitleidenschaft` gezogen werden. Die mathematischen Berechnungen
beschr&auml;nken sich oft auf ca. 20% der Rechenzeit, den restlichen Teil machen
Speichervergleiche etc. aus. Dieser 20%-Anteil wird drastisch beschleunigt,
aber viele andere Routinen werden nicht viel schneller.<P>
In Verbindung mit einer Grafikkarte ist eine PowerPC-Karte f&uuml;r Wildfire
aber auf jeden Fall zu empfehlen, die Steigerungen beziehen sich nat&uuml;rlich
auf einen 68060er-Prozessor. (Im Vergleich zu einem 68030er mit 25 MHz hat
man schon bei vielen Effekten eine Steigerung um den Faktor 10 zum
68060er).<P><BR>
<LI><B>Ist wirklich eine pOS-Version von Wildfire geplant? Wer soll die
kaufen?</B><P>
Ist wirklich geplant. Wird aber noch einige Zeit dauern. Wer die kaufen
wird, ist noch nicht festgelegt :-) . Falls pOS auch auf anderen Rechnern
erscheint (wie angek&uuml;ndigt) und es sehr wenig Arbeit macht, die pOS-
Programme zu portieren (wie angek&uuml;ndigt), kann man somit Wildfire auch auf
anderen Systemen (nicht jeder hat einen Amiga, leider :-) ) laufen lassen.<P><BR>
<LI><B>Welche Rechnerausstattung benutzt Ihr?</B><P>
Amiga 1200/060 mit 24 MB Fast, Amiga 4000/030 mit 12 MB Fast,
Amiga 1200/030 mit 16 MB Fast, Amiga 4000/060/PPC 604e mit 44 MB Fast.
Dazu noch ein Zip-Laufwerk, ein CD-Brenner (YAMAHA), diverse CD-Rom-
Laufwerke, eine CyberVision 64/3D im PPC Rechner und ein paar Monitore.<P>
<LI><B>Was haltet Ihr vom WarpUP-Kernel von Haage&amp;Partner und dem Streit
zwischen H&amp;P und Phase 5?</B><P>
Zum WarpUp-Kernel k&ouml;nnen wir nur sehr wenig sagen, da wir ausschlie&szlig;lich
f&uuml;r das Phase5-System programmieren. Es liegt jeder PPC-Karte bei, und
damit ist Wildfire bei jedem K&auml;ufer lauff&auml;hig.
Ich finde es sehr schade, da&szlig; man sich nicht von Anfang an auf einen
Standard geeinigt hat. Diese Diskussion f&uuml;hrt nur zu Verwirrungen und
irritiert Entwickler und Anwender.<BR>
Es mag sein, da&szlig; die Haage&amp;Partner-L&ouml;sung vielleicht schneller ist, oder
leichter zu bedienen, jedoch ist dies nicht sicher.<P>
Ich sage nur, `be standard - be compatible`!<P>
Wir sind mit der Phase5-L&ouml;sung zufrieden. Andreas Maschke hat es geschafft,
innerhalb von k&uuml;rzester Zeit mit dem Phase5-System unter Verwendung von
ELF-Plugins die Wildfire-PPC-Version zu erschaffen.
Dies macht deutlich, da&szlig; versierte Programmierer durchaus schnell mit dem
Phase5-System arbeiten k&ouml;nnen.<P><BR>
<LI><B>Wie seht Ihr die nahe/ferne Zukunft des Amiga?</B><P>
Dies l&auml;&szlig;t sich sehr schwer absch&auml;tzen. Ich erwarte keine allzu gro&szlig;en
Schritte von Amiga Int. (oder wie auch immer sie hei&szlig;en :-) ).<P>
Ich sehe nur, da&szlig; heutzutage ein Rechner (Amiga 4000T), der sich auf
dem Stand von Mitte 1992 befindet, f&uuml;r unglaubliche 2700,00 DM angeboten
wird. F&uuml;r dieses Geld bekommt man heutzutage fast schon zwei halbwegs
schnelle PC`s ohne Monitor mit sehr viel Software. (Somit hat man dann auch
Multitasking :-) ).<P><BR>
<LI><B>Wie sollte, Eurer Meinung nach, die n&auml;chste Amiga-Generation
ausgestattet sein?</B><P>
Ich denke, ein harter Schnitt w&auml;re das richtige. Wir m&uuml;ssen uns unbedingt
schnell von der absolut veralteten Hardware l&ouml;sen.
Die A/Box-Spezifikationen lesen sich sehr gut, nur leider lesen sich die
Termine von Phase5 nicht ann&auml;hernd so gut.<P><BR>
<LI><B>Werden auch noch andere Programme zu anderen Anwendungen (also
nicht nur Grafik) erscheinen?</B><P>
Sicherlich (aber nicht von uns :-) ).<P>
<B>(Anm. von Andreas Etzrodt: Das wollte ich wissen... ;-) )</B>.<P>
Im Ernst. Ich gehe davon aus, da&szlig; au&szlig;er Wildfire in absehbarer Zeit kein
vergleichbar gro&szlig;es Programm von uns erscheinen wird, da wir sicherlich
noch einige Zeit in Wildfire investieren werden und alle drei im `Real-
Life` unseren Besch&auml;ftigungen nachgehen.<P><BR>
<LI><B>Nun die obligatorische letzte Frage: M&ouml;chtet Ihr den Amiga-Usern,
den Mitgliedern des APC&amp;TCP und dem Rest der Welt noch etwas sagen?</B><P>
Keep the (Wild)fire burning!<P>
Wenn`s Fragen und Anregungen (nicht nur zu Wildfire) gibt, dann schnell
eine E-Mail an mich senden :-) , <A HREF="mailto:eksec@eure.de">eksec@eure.de</A> .<P>
</OL>
Ich danke Andreas K&uuml;ssner f&uuml;r dieses sehr interessante Interview und hoffe,
da&szlig; das Wildfire-Team noch viel Erfolg mit dem Programm haben wird. -
Andreas Etzrodt&#171;
<CENTER><BR><A HREF="0212.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0300.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 12/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="1100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/intv1.gif" ALT="[Interview]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0500.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

