<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena
            Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Firma:</TD>

                <TD><B>point.design</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Unternehmer:</TD>

                <TD><B>J&uuml;rgen Schober</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>

                <TD>http://www.pointdesign.at</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>

                <TD>amiga.info@pointdesign.at</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo J&uuml;rgen,kannst Du
          bitte etwas &uuml;ber Dich und Deinem Amiga Werdegang
          erz&auml;hlen?</B></FONT><BR>
           Also, ich bin 32 Jahre alt, komme aus &Ouml;sterreich
          und lebe derzeit mit meiner Frau und meinen beiden
          S&ouml;hnen in Graz. Neben der point.design arbeite ich
          als "Senior Software Engineer" bei der Atronic im Bereich
          Casion Games eigentlich ist das derzeit eher
          umgekehrt-leider). Mit dem Amiga hat alles so 1986 mit
          einem Amiga500 angefangen (kann mich noch errinnern. Wir
          hatten dieses Amiga500 Desktop Video set. mein erstes
          Spiel (oder SW &uuml;berhaupt) war TrollyWolly (so ein
          Jump'n'Run Game).</P>

          <P>Damals hab' ich wohl auch mit C programmieren
          begonnen. Sp&auml;ter kam dann ein A2000 dazu. Und
          mittlerweile hab' ich schon alles mal durch, denke ich.
          Irgendwann in den 90ern hatte ich mal f&uuml;r den Graz
          Ableger der K&ouml;lner "M.A.S.T." (Nexus SCSI) neben dem
          Studium gearbeitet. Dann war mal lange Pause und als der
          letzte Amiga H&auml;ndler dann schloss und ich auf
          Jobsuche war, hab' ich dann die point.design
          gegr&uuml;ndet.</P>

          <P><FONT color="#006000"><B>Im letzten Jahr hast Du Dein
          Ladenlokal "Point Design" wieder er&ouml;ffnet, f&uuml;r
          einen Amiga H&auml;ndler, ein sehr grosses Risiko, kannst
          Du jetzt schon r&uuml;ckblickend sagen ob dies ein
          richtiger Schritt war?</B></FONT><BR>
           Na ja. Bin nach wie vor skeptisch.<BR>
           Derzeit kostet mich das ganze eine Menge Geld (pro
          Monat!), d.h. ich verdien' da nix dran... ich hoffe noch
          immer wir schaffen die H&uuml;rde sobald OS4 da ist.</P>

          <P><FONT color="#006000"><B>Was waren die Gr&uuml;nde
          trotz der schweren Marktlage wieder zu
          er&ouml;ffenen?</B></FONT><BR>
           Hm, schwer zu sagen.<BR>
          Es gibt mir eine gewisse Freiheit.<BR>
          Und vielleicht mal die Perspektive auch mal was damit
          verdienen zu k&ouml;nnen und Spa&szlig; daran zu
          haben.<BR>
          Aktuell braucht man aber eine kr&auml;ftige Portion
          Sturheit und Durchhalteverm&ouml;gen, um nicht
          aufzugeben.</P>

          <P><FONT color="#006000"><B>Wie siehst Du derzeit die
          Marktlage in &Ouml;sterreich bez. im Allgemeinen, kann
          man als H&auml;ndler Deine Unkosten &uuml;berhaupt noch
          decken mit dem Verkauf von Amiga Hard und
          Software?</B></FONT><BR>
           Nein. Siehe oben.<BR>
           Obwohl, der Amiga One hat schon gezeigt, dass man was
          verdienen k&ouml;nnte (!). Also, ich hoffe er kommt bald
          mit OS4.<BR>
           Der &Ouml;sterreichische Markt ist generell schwierig.
          Liegt wohl an unserer Mentalit&auml;t.<BR>
           Mit einem Amiga Gesch&auml;ft ist das noch eine Stufe
          schwerer. Aber wieso einfach, wenn's kompliziert auch
          geht ;) Manchmal braucht Mensch auch eine Gewisse Portion
          Humor im Leben.</P>

          <P><FONT color="#006000"><B>Was m&uuml;ste Deiner Meinung
          nach dringend passieren damit, die Marktlage sich wieder
          stabilisiert?</B></FONT><BR>
           OS4 m&uuml;&szlig;te auf AmigaOne erscheinen. Danach
          muss aber ein billigeres PPC board her, das man in den
          Mainstream bringen kann.</P>

          <P><FONT color="#006000"><B>Wie siehst Du die
          Kaufbereitschaft der vorhandenen Amiga Gemeinde, welche
          Produkte lassen sich heute noch am besten
          Verkaufen</B></FONT><BR>
          ? USB L&ouml;sungen gingen/gehen ganz gut. Poseidon zeigt
          auch, wie einfach und transparent USB sein kann - auch im
          Vergleich mit jedem anderen Betriebssystem. Und
          nat&uuml;rlich ging auch der AmigaOneG4 ganz gut. Mehr
          wird aber wohl erst kommen,wenn OS4 drauf l&auml;uft.</P>

          <P><FONT color="#006000"><B>Lassen sich aufgrund der
          Verka&uuml;fe "Amiga Hochburgen" ermitteln oder kann man
          ein bestimmtes Kaufverhalten feststellen</B></FONT><BR>
          ? Hochburgen Regional ?<BR>
           Na ja, Wien ist nach wie vor da. Sonst ist leider nicht
          mehr viel... der Rest ist so verstreut, dass man da kaum
          eine Aussage treffen kann.</P>

          <P><FONT color="#006000"><B>Mit dem erscheinen vom
          AmigaOne ist zumindest neue Hardware endlich
          erh&auml;ltlich, wie siehst Du die Verkaufs Chancen der
          neuen Amiga Generation bez. glaubst damit wird ein neuer
          Markt entstehen</B></FONT><BR>
          ? s.o. Ich denke schon. Eine kleine Nische k&ouml;nnte
          schon entstehen. F&uuml;r mehr muss aber ein billigeres
          (und auch kleineres board a la A1200) her.</P>

          <P><FONT color="#006000"><B>Wie gef&auml;llt Dir
          pers&ouml;hnlich der AmigaOne, was h&auml;tte man besser
          machen k&ouml;nnen oder was w&uuml;rdest Du an diesem
          System hervorheben?</B></FONT><BR>
           Ich tendiere ja eher zu einer alles in allem L&ouml;sung
          in Super Small size her (so wie GameCube). Das ATX board
          ist schon OK, die Leistung auch. Hervorheben will ich da
          jetzt gar nix im Speziellen. Ich glaube, es kann ein
          Anfang sein. Daf&uuml;r wurde es mal designed.</P>

          <P>Was mir gut gef&auml;llt (was ich aber nur sujektiv
          beurteilen kann), ist das fl&uuml;ssige Arbeiten mit dem
          Rechner (wenn man jetzt das ganze unter z.B. Linux mit
          einem &auml;hnlichen PC vergleicht). Au&szlig;erdem die
          kurzen Bootzeiten (BIOS ist vorher fertig, bevor mein
          R&ouml;hren Monitor ein Bild zeigen kann). IDE ist auch
          sehr schnell (~30MB/sec bei UDMA33). Nat&uuml;rlich
          w&uuml;rde ich gerne ein Nachfolgeboard mit DDR, USB2.0
          und AGP 4/8 (und PPC970;) sehen. Aber wir m&uuml;ssen mal
          (-wieder-) gehen lernen, bevor wir zu laufen
          beginnen.</P>

          <P><FONT color="#006000"><B>Glaubst Du das der AmigaOne
          in wirklich ausreischender St&uuml;ckzahl erh&auml;ltlich
          sein wird,wenn AmigaOS 4.0 erscheint oder muss man sich
          als Kunde auf l&auml;ngere Wartezeiten
          einstellen?</B></FONT><BR>
           Also, ich denke, dass mit OS4 wohl eine
          gr&ouml;&szlig;ere Nachfrage entstehen wird. Alle
          beteiligten Firmen sind relativ klein, d.h. ich
          bef&uuml;rchte (oder eigenlich hoffe ich - vom
          H&auml;ndlerstandpunkt;) dass die Nachfrage
          gr&ouml;&szlig;er sein wird, als wir liefern werden
          k&ouml;nnen. Produktion kostet Geld und man rechne mal:
          eine 10er Tranche kommt auf 5.000,- bis 10.000,- Euro.
          Das muss ein jeder H&auml;ndler fl&uuml;ssig haben. In
          der aktuellen Lage schon schwierig. Bei 100 oder gar 1000
          Stk kommt da ganz schon was zusammen ... (d'r&uuml;ber
          wollen wir mal gar nich denken).</P>

          <P><FONT color="#006000"><B>Was denkst Du wieviele
          Rechner m&uuml;ssen verkauft werden um damit eine neue
          Basis entstehen kann?</B></FONT><BR>
           Dar&uuml;ber will ich gar nich spekulieren.<BR>
           Wenn man einen break even herleiten wollte, w&auml;ren
          da einfach zu viele unbekannte drinnen. Aber wenn alle
          wollen, sollte mal eine kontinuierliche Weiterentwicklung
          und Produktpflege m&ouml;glich sein. Alles andere wird
          sich ergeben.</P>

          <P><FONT color="#006000"><B>Stehst Du in direkten Kontakt
          zu Eyetech und wenn ja wie verl&auml;uft die
          Zusammenarbeit?</B></FONT><BR>
           Ja.<BR>
           Also mit allen unseren Partner (auch KDH, Hyperion und
          Amiga, Inc.) haben wir eine augezeichnete
          Gespr&auml;chsbasis.</P>

          <P><FONT color="#006000"><B>Bist Du mit den bisherigen
          Verk&auml;ufen/Vorbestellungen f&uuml;r den AmigaOne
          zufrieden?</B></FONT><BR>
           Ja /Jein.<BR>
          K&ouml;nnte nat&uuml;rlich immer etwas mehr sein;)</P>

          <P><FONT color="#006000"><B>Wie hoch siehst Du die
          Chancen das der AmigaOne mit AmigaOS 4.0 auch f&uuml;r
          nicht Amiga User von Interesse sein
          k&ouml;nnte</B></FONT><BR>
          ? Schwer zu sagen.<BR>
           Auch da denke ich, dass erst ein Nachfolgeprodukt
          wirklich ziehen k&ouml;nnte. Obwohl, wir haben auch jetzt
          bereits Leute, die zum Amiga zur&uuml;ck kehren.</P>

          <P><FONT color="#006000"><B>Kommen Wir zur "AmigaOS 4.0
          on Tour" Show,die mittlerweile angelaufen ist, wie bist
          Du auf die Idee gekommen diese zu realisieren und was hat
          Dich dazu bewegt</B></FONT><BR>
          ? Das w&auml;re jetzt zu viel. Ich werde da einen Artikel
          im cam auf os.amiga.com dr&uuml;ber schreiben. Derzeit
          bin ich mit den (dauernden) Vorbereitungen und Updates
          der Tour ganz sch&ouml;n besch&auml;ftig. Bin grade aus
          Augsburg zur&uuml;ck.</P>

          <P><FONT color="#006000"><B>Wann hast Du mit den
          Vorbereitungen angefangen und wie kam es zur
          Zusammenarbeit mit "KDH"</B></FONT><BR>
          ? Wir haben schon seit l&auml;ngerer Zeit engere
          gesch&auml;ftliche Kontakt mit KDH. Nach dem die Idee
          geboren wurde, habe ich mal bei einigen Kontakten
          nachgefragt, wie wir das denn organisieren k&ouml;nnten.
          KDH hat sich da nat&uuml;rlich als langj&auml;hriger
          Partner angeboten.</P>

          <P><FONT color="#006000"><B>Sieht man sich als Amiga
          H&auml;ndler untereinander nicht als Konkurenten oder
          herrscht mehr ein freundschaftliches
          Verh&auml;ltniss?</B></FONT><BR>
           Nat&uuml;rlich ist es auch eine Konkurrenz-Situation.
          Aber das hei&szlig;t ja nicht, das man sich deswegen
          nicht auch freundschaftlich begegnen kann.</P>

          <P><FONT color="#006000"><B>Wie verlief die
          Zusammenarbeit mit Hyperion,war es schwer Hyperion oder
          Amiga Inc. von der Tour zu &uuml;berzeugen bez. die
          Genehmigung zu erhalten?</B></FONT><BR>
           Eigentlich nicht.<BR>
           Ich habe schon seit (mittlerweilen) 2 Jahren sehr gute
          Kontakte zu Ben Hermans. Er hatte auch mal die Idee
          ExecSG im Fr&uuml;hjahr in Spanien zu zeigen (daraus
          wurde wohl nichts). Als sich unsere Idee mit der Tour in
          meinem Kopf etwas gefestigt hatte, habe ich einfach
          gefragt.</P>

          <P><FONT color="#006000"><B>L&auml;st sich aufgrund der
          Tour, mit einer baldigen Ver&ouml;ffentlichung von
          AmigaOS 4.0 rechnen?</B></FONT><BR>
           Lt. den Infos von der Tour, ja.</P>

          <P><FONT color="#006000"><B>Wie ist Dein
          pers&ouml;hnliches Fazit nach den ersten Veranstaltungen,
          seit Ihr mit den Besucherzahlen, Feedback ect. zufrieden
          oder liegen die Besuche unter Euren
          Erwartungen?</B></FONT><BR>
           Hm, ich habe etwas gemischte Gef&uuml;hle.<BR>
           Ich denke es war wichtig, dass wir sie machen/gemacht
          haben. Sicher, ich h&auml;tte mir mehr Besucher
          gew&uuml;nscht.<BR>
           Aber andererseits war der Raum z.B. in Augsburg voll.
          Mehr h&auml;tten da nicht wirklich rein gepa&szlig;t.<BR>
           Allerdings verstehe ich manche Kommentare in den Foren
          nicht. Wir zwingen niemanden was auf. Wir zeigen
          lediglich den aktuellen Zustand.<BR>
           Ich denke, das ist eigentlich ein Service von allen
          beteiligten. Wenn man so manches liest,fragt man soch
          schon, wozu man da Zeit und Geld investiert und nicht
          gleich alles hin schmeist. Aber keine Bange, wir machen
          weiter ;)</P>

          <P><FONT color="#006000"><B>Hat sich bis jetzt der ganze
          Aufwand gelohnt, immherhin habt Ihr die Tour auf eigene
          Faust erm&ouml;glicht?</B></FONT><BR>
           Nein, nicht wirklich.<BR>
           Aber das war mir von vorne hinein klar. Vielleicht
          bringt's langfristig was.</P>

          <P><FONT color="#006000"><B>Was ist Dein
          pers&ouml;hnlicher Eindruck vom derzeitigen
          Entwicklungsstand von AmigaOS 4.0</B></FONT><BR>
          ? Also, f&uuml;r den User ist es etwas schwer, weil doch
          sehr vieles unter der Oberfl&auml;che passiert. Aber ich
          habe den Eindruck, dass hier sehr professionell und
          sorgf&auml;lltig (und mit Konzept!) gearbeitet wird.
          Viele Teile sind bereits so vorbereitet, dass sie
          unmittelbar als PPC Version compilierbar sein werden.
          Intuition wird vorraussichtlich schon am letzten Event,
          am 5. Juli, in einer PPC Native version gezeigt werden
          k&ouml;nnen. Dazu kommen noch sehr viele notwendige
          Erweiterungen wie z.B. neues Library Modell (
          LibBase-&gt;Function() Prototyping ), application.library
          (XML Unterst&uuml;tzung), AmigaInput und auch neue GUI
          M&ouml;glichkeiten wie GUI Prefs und Anti-Aliased Fonts
          (inkl. TrueType Unterst&uuml;tzung). Trotzdem wird's eng.
          Eine CyberstormPPC Version sollte noch Ende dieses
          Sommers kommen, AmigaOne Ende 2003.</P>

          <P><FONT color="#006000"><B>Siehst Du eine
          Ernstzunehmende Zukunft f&uuml;r das AmigaOS
          4.0?</B></FONT><BR>
           Dazu m&uuml;&szlig;te man "Ernstzunehmende Zukunft"
          etwas pr&auml;zisieren. Wenn's darum geht, dass (anfangs)
          eine kleine Nische entsteht,dann ja. Erst wenn diese
          gesundet, kann man an mehr denken. Werden wir sehen.</P>

          <P><FONT color="#006000"><B>Es werden immer wieder die
          Screenshots von AmigaOS 4.0 bem&auml;ngelt, (Design)
          handelt es sich hierbei noch um inoffizielle Workbench
          Themes bez. wann kann man mit den ersten "final"
          Screenshots der Verkaufs Version rechnen?</B></FONT><BR>
           Also, es sind halt nur Bilder.<BR>
           Ich kann dazu nur sagen, dass die OS4 GUI sehr flexibel
          ist. Jeder wird sich wohl seinen eigenen Look kreiren
          k&ouml;nnen. Ich rechne auch damit, dass im aminet
          relativ schnell nach der Release des OS4 "Skin"-Packages
          auftauchen werden.</P>

          <P>Viele, die die Screenshots bem&auml;ngeln, w&uuml;rde
          ich empfehlen, nach M&ouml;glichkeit eine "OS4 on Tour"
          Veranstaltung zu besuchen. F&uuml;r Versionen nach 4.0
          (4.1) ist auch schon ein neues Icon System angedacht
          ...soviel sei verraten.</P>

          <P><FONT color="#006000"><B>Was k&ouml;nnen Wir noch in
          Zukunft von der "AmigaOS 4.0 Tour"
          erwarten?</B></FONT><BR>
           Wir hoffen, mehr und mehr Komponenten PPC Native zeigen
          zu k&ouml;nnen. Wie gesagt, als Highlight ein komplett
          ppc natives Intuition am 5. Juli. F&uuml;r Basel gibt's
          schon ein Update von AmiDock und ich hoffe, ich hab noch
          etwas Zeit um AmigaInput etwas besser vorzubereiten.</P>

          <P><FONT color="#006000"><B>Liegen Dir schon
          Informationen vor &uuml;ber eine Amiga Messe am Ende des
          Jahres?</B></FONT><BR>
           Wir planenen selber die O.A.S.E. 2003 Ende September
          (eher Mitte/Ende) Oktober in Graz zu machen. Denkbar
          w&auml;re dort ein Preview des OS4 auf AmigaOne (das wird
          zumindest angestrebt). F&uuml;r Deutschland ist mir
          derzeit nichts bekannt. In Holland wir es Mitte September
          eine Messe geben.</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback
          vom Amiga?</B></FONT><BR>
           Ich hoffe es!</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>
           Ich bedanke mich bei denen, die uns immer wieder die
          Kraft geben doch wieder weiter zu machen. Vielen
          Dank.<BR>
           Ich hoffe, es geht wieder aufw&auml;rts. Macht's
          gut.</P>

          <P><FONT color="#006000"><B>Danke f&uuml;r das
          Interview.</B></FONT></P>

          <P align="center">.... __ ------ &copy; Amiga Arena
          06/2003 ----- __ ....</P>

          <P align="center">* aMIGA aRENA - fOR tHOSE wHO lOVE tHE
          cOMMODORE aMIGA *</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

