<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE></TITLE>
  </HEAD>

  <BODY background="cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>Hallo liebe
          NoCover-Leser</B></FONT></H1>

          <P>die Leserzahlen der NoCover steigen
          gl&uuml;cklicherweise stetig an und monatlich kommen neue
          Adressen in den Abo-Verteiler hinzu. Leider werden die
          Schreiber nicht proportional dazu mehr, aber ich gebe ja
          die Hoffnung nicht auf, dass wir auch die Anzahl
          regelm&auml;&szlig;ig eintrudelnder Artikel wieder in den
          Griff bekommen.</P>

          <P>An dieser Stelle m&ouml;chte ich Euch alle erneut sehr
          herzlich dazu einladen, uns mit Artikeln zu versorgen. Es
          gibt nahezu keine Begrenzung in der Wahl Eurer Themen, -
          schreibt, wozu auch immer Ihr Lust habt. Stellt Eure
          Lieblingsmusik den Lesern vor, informiert &uuml;ber
          Software, die Ihr auf Euren Computern t&auml;glich
          verwendet. Habt Ihr eine tolle Internetseite gefunden?
          Warum daraus ein Geheimnis machen - andere m&ouml;chten
          diese Seite auch mal besuchen! Auch &uuml;ber Autos und
          Motorr&auml;der, Euren Beruf, Klatsch und Tratsch, ein
          tolles Kochrezept, &uuml;ber Euren Urlaub, das
          sch&ouml;ne Wetter, Eure Lieblingswitze oder Gedichte und
          alles andere auch m&ouml;chten wir gern Eure
          Beitr&auml;ge haben. Die NoCover ist frei f&uuml;r alle
          Themen, denn das was Euch begeistert, interessiert auch
          andere NoCover-Leser!</P>

          <P>Aber auch weitere Leser begr&uuml;&szlig;en wir immer
          besonders gern. Die NoCover ist ein freies und
          kostenloses Online-Magazin, das im Internet auf
          http://www.nc-mag.de zuhause ist. Aber auch im Abo
          erh&auml;ltlich, sowohl per herk&ouml;mmlicher Post, als
          auch per EMail p&uuml;nktlich zu jedem Ersten des Monats
          verschickt. Wenn Du noch kein Abo der NoCover hast oder
          aber jemanden kennst, der sich auch f&uuml;r dieses schon
          viele Jahre erscheinende Magazin interessieren
          k&ouml;nnte, dann erz&auml;hle von uns. Die NoCover lebt
          von ihren Lesern und Schreibern und bleibt ihrem Motto
          treu f&uuml;r Leser von Lesern! Viele ehemalige Schreiber
          der NoCover haben &uuml;ber dieses Magazin schon ihren
          Weg in kleine Verlage geschafft und arbeiten heute auch
          beruflich als Redakteur. So ist die NoCover auch noch
          eine ganz hervorragende Plattform, um zu testen und zu
          &uuml;ben, wie man mit den ersten eigenen Artikeln bei
          den Lesern ankommt.</P>

          <P>Jeder aktive Schreiber der NoCover wird zudem auch
          noch belohnt! &Uuml;ber unseren Sponsor
          http://www.connectweb.de werden alle Hobbyredakteure, die
          uns regelm&auml;&szlig;ig mit Artikeln versorgen mit
          eigener EMailadresse, Sub-Domain, gro&szlig;em
          POP3-Postfach mit sagenhaften 256 MByte
          Fassungsverm&ouml;gen und kostenloser unlimitierter
          Nutzung unseres durch Authentifizierung abgesicherte
          SMPT-EMail-Servers belohnt. So bekommt man f&uuml;r seine
          M&uuml;he, die hoffentlich auch Spass macht, sogar noch
          ein kleines Rundum-Onlinepaket, wof&uuml;r man woanders
          bereits viel Geld ausgeben m&uuml;sste. Und das alles
          schon, wenn man sich nur einmal monatlich vor die
          Tastatur setzt und ein paar Artikel f&uuml;r die NoCover
          schreibt.</P>

          <P>Wolf hatte die &Uuml;berlegung, da ein
          betr&auml;chtlicher Anteil unserer Leser ja blind oder
          sehbehindert ist, ob man daf&uuml;r eine Extra-Ausgabe
          der NoCover ohne Bildmaterial machen sollte. Ich hatte
          ihm davon abgeraten, da das f&uuml;r Wolf viel
          zus&auml;tzliche Arbeit bedeuten w&uuml;rde und die
          Bilder im Prinzip ja nicht st&ouml;ren. Sch&ouml;n
          w&auml;re es allerdings, wenn sich Jeder angew&ouml;hnen
          k&ouml;nnte, die Bilder mit alternativen Beschriftungen
          zu versehen, damit auch blinde Leser sich vorstellen
          k&ouml;nnen, was in einem Bild zu sehen ist.</P>

          <P>Was k&ouml;nnen oder sollen wir aber f&uuml;r Euch
          &auml;ndern? Habt Ihr &Auml;nderungs- und
          Verbesserunfgsvorschl&auml;ge? Lasst von Euch h&ouml;ren
          oder vielmehr lesen!</P>

          <P>Ich w&uuml;nsche Euch auch weiterhin viel Freude und
          informative Unterhaltung mit der No Cover und hoffe
          k&uuml;nftig auf viel mehr Beitr&auml;ge von Euch, damit
          dieses Magazin wieder so lebendig wird, wie es
          fr&uuml;her einmal war.</P>

          <P>Herzliche Gr&uuml;&szlig;e<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

