<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Thomas Nawroth">
<META NAME="DESCRIPTION" CONTENT="Ein Computer-Magazin von 1984">
<TITLE>Happy Computer</TITLE>
</HEAD>
<BODY bgcolor="#fffff4" background="mm_hc09b.gif">
<TABLE border="0" cellpadding="8" width=100%>
<TR>
<TD>
<font size=+1><A href="mm_mmx.html"><B>zur&uuml;ck zum Frame</B></A></font>
<CENTER><IMG SRC="mm_hc09a.gif">
<BR><I>Folge 9</I></CENTER><BR>
<H1 ALIGN="CENTER">Floppy-Disk<BR>
Die wichtigsten Begriffe</H1>

<P align=center>In dieser &Uuml;bersicht sind die Stichworte zum Thema Disketten und Laufwerke zusammengefa&szlig;t.</P>
<BR>
<TABLE width=575 border="1" cellpadding="2"align=center>
<TR><TD valign=top>
<B>Aufzeichnungsdichte:</B> Bezeichnet die Anzahl der Bits, die pro Zoll Spurl&auml;nge 
aufgezeichnet werden k&ouml;nnen. Ma&szlig;einheit bpi (bit per inch).<BR>
<B>Aufzeichnungsverfahren:</B> Die Aufzeichnung erfolgt entweder mittels 
Frequenzmodulationsverfahren (FM) f&uuml;r einfache oder beispielsweise dem MFM-Verfahren 
(Modified Frequency Modulation) f&uuml;r doppelte Aufzeichnungsdichte.<BR>
<B>bpi:</B> Ma&szlig;einheit f&uuml;r die Aufzeichnungsdichte; Abk&uuml;rzung steht f&uuml;r bit per inch (Bit 
pro Zoll).<BR>
<B>bps</B> (bit per second): Ma&szlig;einheit f&uuml;r die Daten&uuml;bertragungsrate.<BR>
<B>Daisy Chain</B> -> Verkettung<BR>
<B>Daten&uuml;bertragungsrate:</B> Geschwindigkeit, mit der Daten vom Rechner zum Speicher 
oder umgekehrt &uuml;bertragen werden k&ouml;nnen; wird in Bit/Sekunde (bps) angegeben.<BR>
<B>Disk:</B> Magnetplatte; manchmal auch f&uuml;r Floppy-Disk verwendet.<BR>
<B>Diskette</B> -> Floppy-Disk<BR>
<B>Disk-Drive</B> -> Plattenlaufwerk<BR>
<B>DOS</B> (Disk Operating System): Betriebssystem oder Teil davon, das f&uuml;r das 
Arbeiten mit Floppy- bzw. Plattenlaufwerken erforderlich ist.<BR>
<B>double/single density:</B> Die Aufzeichnung kann entweder mit doppelter (double 
density, DD) oder aber einfacher Dichte (single density, SD) erfolgen.<BR>
<CENTER><IMG SRC="mm_hc09c.gif"></CENTER>
<B>double/single-sided:</B> Die Disketten k&ouml;nnen bei einem Teil der angebotenen Floppy-
Laufwerke einseitig (single sided), bei vielen auch beidseitig (double sided) beschrieben 
werden.<BR>
<B>Dual-Floppy:</B> Doppel-Floppy-Laufwerk; Speichereinheit mit zwei Floppy-Disk-
Laufwerken. Bei der Angabe der Speicherkapazit&auml;t ist es zweckm&auml;&szlig;ig nachzufragen, ob sich 
die angegebene Kapazit&auml;t pro Diskette oder f&uuml;r das Laufwerk insgesamt, also f&uuml;r zwei 
Disketten versteht.<BR>
<B>Error-Rate</B> -> Fehlerrate<BR>
<B>Fehlerrate:</B> In der Regel werden angegeben: korrigierbare Lesefehler, nicht 
korrigierbare Lesefehler und Suchfehler (englisch: recoverable bzw. non recoverable error 
rate bzw. seek error rate). Remex nennt zum Beispiel f&uuml;r seine Laufwerke RFD 2000/4000 
ein Bit in 10 hoch 9 f&uuml;r korrigierbare Lesefehler, ein Bit in 10 hoch 12 f&uuml;r nicht korrigierbare 
Lesefehler und ein Bit in 10 hoch 6 f&uuml;r Suchfehler.<BR>
<B>Floppy-Disk</B> (Diskette): Speichermedium mit 8 Zoll (Normalversion) oder 5 1/4 
Zoll (Minifloppy) Durchmesser. Es gibt noch weitere, bislang aber nicht weitverbreitete 
Durchmesser.<BR>
</TD>

<TD>
<B>formatierte / unformatierte Speicherkapazit&auml;t:</B> Die Daten werden auf der Floppy in 
Bl&ouml;cken von beispielsweise 128 oder 256 Byte aufgezeichnet. Pro Block wird au&szlig;erdem Platz 
f&uuml;r L&uuml;cken definierter L&auml;nge am Anfang und Ende jedes Blockes f&uuml;r Spur- und 
Sektornummern, Pr&uuml;fbytes und &auml;hnliches ben&ouml;tigt. Durch diese &quot;Formatierung&quot; der Daten 
k&ouml;nnen dis zu 40% Brutto-Speicherkapazit&auml;t (unformatiert) verloren gehen. Nur die 
formatierte Speicherkapazit&auml;t steht dem Anwender auch wirklich zur Speicherung seiner 
Programme oder Daten zur Verf&uuml;gung.<BR>
<B>Hard Disk:</B> Magnetplatte; im Gegensatz zur Floppy-Disk nicht flexibel.<BR>
<B>Hardsektorierung:</B> Die einzelnen Sektoren einer Diskette werden jeweils durch 
eingestanzte L&ouml;cher gekennzeichnet. Diese L&ouml;cher werden optisch abgetastet. Die 
Hardsektorierung nutzt den verf&uuml;gbaren Speicherplatz besser als die Softsektorierung.<BR>
<B>IBM-kompatibel:</B> Mit den von IBM verwendeten Aufzeichnungsverfahren und -
formaten arbeitende Laufwerke und Datentr&auml;ger. Die Kompatibilit&auml;t spielt vor allem beim 
Datenaustausch mit Gro&szlig;rechnern und Rechenzentren eine Rolle.<BR>
<B>Laufwerk:</B> Bezeichnet zun&auml;chst nut die Antriebseinheit f&uuml;r Speicher. Wichtig bei 
der Lekt&uuml;re von Prospekten und Zeitschriften: Nicht jedes Laufwerk wird im Geh&auml;use als 
aufstell- und anschlu&szlig;fertige selbst&auml;ndige Speichereinheit angeboten.<BR>
<B>Lebensdauer:</B> Wird bei Laufwerken in der Regel in Betriebsstunden bzw. Jahren 
(z.B. 15000 Betriebsstunden oder 5 Jahre) angegeben. Zum Teil findet sich nur die MTBF 
(mittlere st&ouml;rungsfreie Zeit), meist aber beide Werte. Bei den Speichermedien wird die 
Lebensdauer meist in Zugriffen/Spur (englisch: passes per track) angegeben. Remex nennt 
z.B. bei den Laufwerken RFD 2000/4000 &quot;3,5 mal 1.000.000 Zugriffe je Spur&quot;. Der 
Anwender kann die Zahl der Zugriffe in der Regel nicht z&auml;hlen und auch nur m&uuml;hsam 
sch&auml;tzen. Beachten Sie, da&szlig; Floppy-Disks einer zum Teil erheblichen mechanischen 
Abnutzung unterliegen; es ist zweckm&auml;&szlig;ig, immer eine Sicherheitskopie auf einer zweiten 
Diskette anzulegen. Eine Angabe, wie lange Daten auf einer Diskette zur Archivierung sicher 
gespeichert werden k&ouml;nne, fehlt meistens.<BR>
<B>Microfloppy:</B> Der Durchmesser des Mediums (Diskette) ist - noch - nicht genormt 
und liegt zwischen 3 und 4 Zoll.<BR>
<B>Minifloppy:</B> Der Durchmesser des Datentr&auml;gers (Diskette) betr&auml;gt 5 1/4 Zoll.<BR>
<B>Spurdichte:</B> Gibt an, wie viele Spuren auf einem Zoll Breite nebeneinander 
untergebracht sind. Ma&szlig;einheit: tpi (Tracks per inch).<BR>
<B>tpi:</B> Abk&uuml;rzung, steht f&uuml;r tracks per inch (Spuren pro Zoll).<BR>
<B>unformatiert</B> -> formatierte/unformatierte Speicherkapazit&auml;t<BR>
<B>Winchester-Platte:</B> Eine Platten- (Laufwerks-)konstruktion, bei der Platte und 
Schreib-/Lesekopf in einem hermetisch geschlossenen Geh&auml;use untergebracht sind.<BR>
</TD></TR></TABLE>

<HR><BR><CENTER>
In der n&auml;chsten NoCover gibt es &quot;Doping f&uuml;r den VC20&quot;. <br>
<font size=+1><A href="mm_mmx.html"><B>zur&uuml;ck zum Frame</B></A></font>
</CENTER></TD>
</TR>
</TABLE>
<BR><BR>
<TABLE ALIGN="CENTER" border="3">
<TR bgcolor="#ffffff">
<TD><A HREF=mailto:"thomasnawroth@web.de">Thomas Nawroth</A></TD>
</TR>
</TABLE>
</BODY>
</HTML>
