<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Tiger Tale Adventure Hunter Report</TITLE>
  </HEAD>

  <BODY>
    <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck zum
    Frame</B></FONT></A> 

    <P></P>

    <CENTER>
      <IMG src="mm_menu.gif"> 

      <H1>Tiger Tale Adventure Hunter Report</H1>
    </CENTER>

    <P>Willkommen beim "Tiger Tale Adventure Hunter Report", einem
    neuen Teil der Comic Ecke. So sollte es zumindest sein, aber
    ich habe die Comic Ecke ja umgestellt - ups - und habe gar kein
    Men&uuml; mehr, aber es macht sich bestimmt dennoch gut als
    Kopf in dem Artikel, oder?</P>

    <P>Mir war mal wieder langweilig und so habe ich mich ein wenig
    mit Inga, der Inutilis Grafikadventure-Engine befasst. Die Idee
    war ein kleines Adventure auf die Beine zu stellen und dieses
    nach und nach zu erweitern. Zuerst wollte ich Amigana, der
    kleine Sondercomic den ich mal f&uuml;r die NoCover pixelte als
    Story-Hintergrund nehmen (NC-88/Rubriken/comic.html). Doch dann
    kam mir in den Sinn, dass es mit Amiga eventuell rechtliche
    Probleme geben k&ouml;nnte wenn ich die Amiga Geschichte, wenn
    auch in leicht abge&auml;nderter Form und vor allem den Namen
    Amiga verwende. Erst vor kurzem ist ein guter Freund von mir
    bitterb&ouml;se in dieser Hinsicht auf die Nase gefallen, weil
    er auch geglaubt hat Dinge verwenden zu k&ouml;nnen wo bestimmt
    kein Hahn nach kr&auml;ht. Na ja, das hat hat er dann doch,
    aber das ist eine andere Geschichte. Ich habe also per E-Mail
    nachgefragt und die Antwort war etwas &uuml;berraschend. Zwei
    ganze W&ouml;rter standen unter meiner Mail: "No Sir". Das war
    alles. Das ist mit Sicherheit schade, denn die Story ist
    absolut perfekt gewesen, aber es ist kein Beinbruch denn nun
    wird etwas gemacht, was &uuml;berhaupt keine Probleme bereiten
    kann, da alles von mir ist.</P>

    <P>Die Story ist nun leicht abge&auml;ndert worden. Nun muss
    man nicht mehr den Computer Amiga retten, sondern der Firma von
    Randas Freundin Xan helfen, die Computerspiele entwickelt und
    nun Pleite ist. Besonders interessant ist dabei das Spiel Tiger
    Tale Adventure, welcher neuen Wind in den Spieleralltag bringen
    soll. Wind bekommen hat davon nat&uuml;rlich auch die
    Konkurenz, die zu gerne ein Spiel mit einem &auml;hnlichen
    Konzept vorher auf den Markt bringen wollen. So beginnt ein
    Wettlauf gegen die Zeit, der umso schwieriger wird, da Randa
    &uuml;berhaupt keine Leute hat, die sich in diesem Bereich
    auskennen. Die Firma ihres Vaters, die sie geerbt hat und nun
    weiterf&uuml;hrt, entwickelt n&auml;mlich B&uuml;rosoftware und
    ist zwar auf diesem Gebiet f&uuml;hrend doch von
    Computerspielen hat sie keinerlei Ahnung. Nat&uuml;rlich
    m&ouml;chte sie aber ihrer besten Freundin helfen, doch so
    einfach man sich die Dinge vorstellt, sind sie jedoch in der
    Praxis selten.</P>

    <P>Nun ein wenig zur Technik des Spiels. Es l&auml;uft in der
    Aufl&ouml;sung 640X480, was von Inga vorgegeben ist und sich
    auch nicht &auml;ndern l&auml;sst. Das macht aber nichts, denn
    es ist so wie es ist prima. Die Hauptfigur Randa ist schon
    fertig und hat je acht Einzelbilder, also Frames pro Richtung
    was (mal vier) 32 Einzelbilder entspricht. Das sind aber nur
    die Laufanimationen! Hinzu kommen noch ein paar weitere wie
    Aufheben von Gegenst&auml;nden oder so "unwichtige" Sachen wie
    Sprechen z.B. Auch Xan ist bereits fertig sowie einige
    Hintergr&uuml;nde, wo aber nicht immer der komplette Screen
    verwendet wird. Scolling gibt es ebenso wenig wie zoomen. Wozu
    braucht man das? Nun ja, wenn die Figur vorne am Bildschirm
    gr&ouml;&szlig;er ist wie weiter Hinten z.B. Damit muss man
    aber leben und man kann sich auch danach richten, das ist
    &uuml;berhaupt kein Problem. Der Grafikstil richtet sich nach
    dem neuesten Randa Teil. Also praktisch "Grafik-Version 3". Wie
    sich das macht? Na ausgezeichnet nat&uuml;rlich, was f&uuml;r
    eine andere Antwort erwartet Ihr von mir? Am besten ich zeige
    auch mal eben Randa:</P>

    <P><IMG src="mm_randa.gif" width="53" height="100" alt=
    "Lauf Randa, lauf!" align="left" vspace="10" hspace="20"> Das
    ist meine vorw&auml;rtslaufende Randa. Damit man sie im Spiel
    verwenden kann braucht man nat&uuml;rlich noch eine Animation
    f&uuml;rs laufen nach Hinten, nach links und rechts was nicht
    so schlimm ist vom Arbeitsaufwand her, denn die kann man ja
    spiegeln. Anschlie&szlig;end wenn man damit zufrieden ist, was
    ich war aber das habe ich glaube schon erw&auml;hnt, macht man
    darum einen Rahmen und legt die Einzelbilder hintereinander
    oben links in die Ecke ab und zwar so dass der linke und der
    obere Rand des Kastens verschwindet. Inga legt die Bilder
    n&auml;mlich wieder &uuml;bereinader und wenn man das nicht
    macht, hat man einen ungewollten Strich in der Laufanimation.
    Diese Erfahrung habe ich schon gemacht. Die Bilder darf im
    Prinzip also nur ein Strich trennen. Der untere muss glaube
    noch nicht einmal sein, aber ich finde es ist so einfacher. Das
    Ganze sieht dann so aus:</P>

    <CENTER>
      <IMG src="mm_randalv.gif" width="440" height="101" alt=
      "Viele, viele Randas...">
    </CENTER>
    <BR>
    <BR>
     

    <P>Genauigkeit ist dabei das oberste Gebot, denn nur ein Pixel
    Abweichung hat dabei fatale Folgen in Form von einer
    "hoppelnden" Animation. Auch das habe ich bereits in eigener
    Erfahrung gelernt. Das Ganze ist bei weitem nicht so
    kompliziert wie es aussieht und macht sogar riesigen
    Spa&szlig;, sonst w&uuml;rde ich das wohl kaum machen. Mit dem
    Programm "Inutilis Grafiks" kann man das Bild
    anschlie&szlig;end f&uuml;r Inga konventieren. Ich schneide den
    Bereich den ich brauche immer als Pinsel aus, denn auch diese
    erkennt das Programm, und der ganze Rest drum herum wird ja
    wohl kaum ben&ouml;tigt. Man gibt nun die Frameanzahl an, in
    diesem Fall acht und kann nun noch die Pausen einstellen. Dabei
    ist "Rate mal" angesagt, da man das Ergebnis leider vorher
    nicht sehen kann. So kann es durchaus vorkommen, dass die
    Animation viel schneller abl&auml;uft wie in der DPaint
    Animation vorgesehen. Da gibt es dann leider keinen anderen
    Ausweg, wie alles nochmal neu konvertieren. Hinzu kommt, dass
    jedes Bild einen "Greifpunkt" besitzt, der ben&ouml;tigt wird
    weil das Programm dort die Animation in das Spiel setzt. Stimmt
    dieser nicht, so hoppelt die Animation im Spiel nat&uuml;rlich
    auch. Weil auch noch jede Person im Spiel eine Personen ID
    bekommt, kommen wir langsam zu einer Flut von Daten, die sich
    nat&uuml;rlich kein Mensch merken kann, das ist absolut
    unm&ouml;glich. Es bleibt einem dann nichts anderes &uuml;brig,
    wie sich alles aufzuschreiben. Und zwar ALLES aufzuschreiben!
    Bei mir auf dem Blatt steht dann z.B. vorne eine 1 (Wird
    f&uuml;r den Personen Editor gebraucht), dann XanStehenVorne
    (Name der Animation) und hinten eine 0 damit ich wei&szlig;
    wieviele Pausen ich eingestellt habe. So kann ich sp&auml;ter
    entsprechend reagieren wenn sie zu schnell oder zu langsam
    l&auml;uft. Hat man aber einmal einen Wert gefunden, dann geht
    das eigendlich, weil sich die Lauf oder Redeanimationen sich im
    Prinzip kaum unterscheiden Im Personen Editor wird das Ganze
    dann zu einer Personendatei geb&uuml;ndelt. Dabei gibt es in
    der Liste je vier mal einen Wert, den man nun den Animationen
    zuordnen muss. Manche Zahlen m&uuml;ssen dabei besondere
    Animationen zugeordnet werden, so m&uuml;ssen unter dem Wert 3
    z.B. immer die Rede-Animationen stehen und unter 2 immer die
    Laufanimationen. Es gibt aber Ausnahmen. In eine Animation
    sitzt Selissa z.B. an einem Schreibtisch und soll gar nicht
    herumlaufen. Wenn man im Programm dann nicht erw&auml;hnt dass
    sie laufen soll, so kann man da nat&uuml;rlich auch etwas
    anderes zuweisen. Inga sagt man dann durch Zahlen die im Befehl
    stehen, welche Animation z.B. bei einem gerade gesprochenen
    Satz verwendet werden soll und hat man sich dann nicht
    aufgeschrieben was man wo zugeordnet hat, so gibt es
    nat&uuml;rlich ein Problem.</P>

    <P><IMG src="mm_xanbikini.gif" width="53" height="100" alt=
    "Es ist Sommer!" align="right" vspace="10" hspace="20"> Ich
    will hier einmal unterbrechen und noch etwas zu Tiger Tale
    Adventure Hunter erz&auml;hlen. Es gab ja schon viele Projekte,
    gerade bei Amiga Spielen, die angek&uuml;ndigt wurden und
    sp&auml;ter hat man dann nichts mehr davon geh&ouml;rt. Dass
    man mit sowas kein Geld verdienen kann ist ja klar und
    &uuml;berhaupt nicht das Ziel. Bei mir ist es ein Hobby. Es
    macht mir Spa&szlig; mal ein wenig mit Inga herumzuspielen und
    die Personen aus dem Comic mal ein wenig Leben einzuhauchen. Ob
    es fertig wird das hoffe ich nat&uuml;rlich und ich halte Euch
    &uuml;ber die NoCover auf jeden Fall auf den Laufenden was es
    so Neues gibt. Bis jetzt habe ich zwar ein wenig herumgespielt
    und es existieren auch ein paar Grafiken, wie ihr unten sehen
    k&ouml;nnt, aber es gibt bis jetzt eigendlich noch keinen
    genauen Anfang. Was ich demn&auml;chst in Angriff nehmen werde
    ist Randas Haus, denn dort soll das Spiel beginnen. Alles
    weitere demn&auml;chst, habt einen sch&ouml;nen Urlaub und bis
    bald,</P>

    <P>Thomas Weber</P>
    <BR>
    <BR>

    <CENTER>
      <A href="mm_bad.gif" target="_blank"><IMG src="mm_badk.gif"
      width="160" height="120"></A> <A href="mm_strasse.gif"
      target="_blank"><IMG src="mm_strassek.gif" width="160"
      height="120"></A> <A href="mm_buero.gif" target="_blank"><IMG
      src="mm_buerok.gif" width="160" height="120"></A>
    </CENTER>
    <BR>
    <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck zum
    Frame</B></FONT></A> <BR>
  </BODY>
</HTML>

