<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Pateienverdrossenheit</TITLE>
  </HEAD>

  <BODY background="nc_bg1.jpg" text="#000000" link="#0000ff"
  alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Bundesrat schafft Demokratie ab</B></FONT></P>

          <P align="center">Wie die kleinen Parteien auf elegantem
          Wege entsorgt werden sollen</P>

          <P>Ganz so schlimm ist es zwar nicht, aber die
          Entwicklungen weisen eindeutig darauf hin, dass es
          mittelfristig in Deutschland keine Demokratie, sondern
          nur noch eine Oligarchie geben wird. Seit l&auml;ngerer
          Zeit haben die etablierten Parteien ein Problem, welches
          zuletzt in Sachsen-Anhalt dramatisch zu Tage trat:
          Unabh&auml;ngig vom Ausgang der Wahl sollte es eigentlich
          jedem Politiker, gleich welcher Coleur, eine Mahnung
          sein, wenn 45% der Wahlberechtigten in einem Land es
          vorziehen, gar nicht zur Wahl zu gehen. Wie stark muss
          die Politikverdrossenheit in Sachsen-Anhalt sein ? Kann
          die Bev&ouml;lkerung es noch deutlicher sagen, dass sie
          im Grunde keiner der angetretenen Parteien zutraut,
          Sachsen-Anhalts Probleme zu l&ouml;sen ?</P>

          <P>Aber den etablierten Parteien kann die Wahlbeteiligung
          ja egal sein. 35% der Stimmen sind 35% der Stimmen,
          unabh&auml;ngig davon, wie viele Stimmen &uuml;berhaupt
          abgegeben worden sind, denn die Stimmen der
          Nichtw&auml;hler fallen ja vorab weg. Von daher ist die
          Notwendigkeit zum Handeln auch nicht gegeben, die
          "Verliere ich diese Wahl, gewinne ich eben die
          n&auml;chste wieder"- Mentalit&auml;t breitet sich aus,
          denn Alternativen hat der W&auml;hler ja nicht. Entweder
          die Stimme geht an die "Liberale
          christlich-sozialdemokratische Union der deutschen
          B&uuml;ndnisgr&uuml;nen" oder sie geht verloren.
          Verlorene Stimmen werden nicht gez&auml;hlt. So einfach
          ist das.</P>

          <P>So einfach ist es allerdings nur, solange dem
          W&auml;hler / der W&auml;hlerin nicht bewusst wird, dass
          es durchaus Alternativen gibt. Die Rede ist hier nicht
          von rechts- oder linksextremen Parteien: F&uuml;r
          aufgekl&auml;rte Menschen kommt ein Kreuz bei NPD oder
          KPD-RF sicherlich nicht in Frage. Hingegen k&ouml;nnten
          sich durchaus viele Menschen vorstellen, die &Ouml;DP
          oder andere Parteien der sozialen Mitte zu w&auml;hlen -
          sofern sie von deren Existenz wissen. Die Kommunalwahl in
          Bayern, wo die &Ouml;DP &uuml;ber 40 Mandate hinzugewann,
          ist bestimmt ein gutes Beispiel daf&uuml;r. Das wiederum
          ist dann aber ein Problem f&uuml;r die Etablierten. Der
          Nichtw&auml;hler st&ouml;rt sie kaum. Die
          Alternativw&auml;hlerin aber schon, denn durch sie
          verringert sich ja der eigene Stimmanteil. Was ist die
          L&ouml;sung des Problemes ? Man versucht, die unliebsame
          Konkurrenz auszuschalten. Da man sie aber leider nicht
          verbieten kann, muss man einen anderen Weg gehen:</P>

          <P>F&uuml;r jeden Euro, den man einer Partei spendet,
          erh&auml;lt diese Partei vom Staat einen Zuschu&szlig;
          von 50 Cent. Nimmt eine Partei im Jahr 20.000 EUR Spenden
          ein, erh&auml;lt sie vom Staat also zus&auml;tzlich
          10.000 EUR aus dem Parteienfinanzierungstopf
          (nat&uuml;rlich nur, solange der Topf, der mit 140
          Millionen EUR pro Jahr gef&uuml;llt ist, noch nicht leer
          ist - Angaben f&uuml;r 2001). Zuerst bedienen sich die
          Altparteien, dann bekommen auch die alternativen Parteien
          wie die &Ouml;DP ihr H&auml;ppchen. Und um dieses
          H&auml;ppchen will man die &Ouml;DP (und mit ihr die
          anderen unabh&auml;ngigen Parteien) bringen. Fortan soll
          n&auml;mlich der staatliche Zuschu&szlig; nur noch
          Parteien zur Verf&uuml;gung stehen, die in mindestens 3
          Bundesl&auml;ndern jeweils mindestens 1% der
          W&auml;hlerstimmen bei der Wahl erzielt haben. Damit soll
          - das ist die offizielle Begr&uuml;ndung -sichergestellt
          werden, dass Parteien wie die NPD und die DVU nicht mehr
          vom Staat mitfinanziert werden. Ein (gewollter oder
          ungewollter?) Nebeneffekt ist jedoch die Ausschaltung der
          unliebsamen Konkurrenz. Denn das offizielle Argument ist
          mehr als fadenscheinig: Wozu soll der NPD die staatliche
          F&ouml;rderung entzogen werden, wo doch sowieso bereits
          ein Verbotsverfahren gegen sie l&auml;uft und diese
          Partei sich allem Anschein nach nach der Bundestagswahl
          der Geschichte &uuml;berantworten wird ? Die NPD scheidet
          also eh als Empf&auml;ngerin aus, die DVU wird von der
          Problematik ohnehin nicht sehr betroffen sein. Sie ist
          n&auml;mlich mit dem Verlag des Parteivorsitzenden Frey
          verbunden, in dem sich der Nazi von heute mit rechter
          Literatur, Reichskriegsflaggen und anderem Schwachsinn
          eindecken kann. Dieses Nebengesch&auml;ft w&uuml;rde dazu
          ausreichen, diese Partei gut &uuml;ber Wasser zu halten.
          Aber was sollen die kleinen Parteien machen, die mit
          guten und praktikablen Vorschl&auml;gen und Ideen Politik
          mitgestalten wollen ? Parteien, die &uuml;ber keinen
          eigenen gewinnbringenden Verlag verf&uuml;gen. Parteien,
          die im Interesse ihrer W&auml;hler und Freunde
          unabh&auml;ngig bleiben m&ouml;chten - Parteien wie die
          &Ouml;DP ?</P>

          <P>Auf den Punkt gebracht sieht es so aus: Jede Partei,
          die in mindestens 3 L&auml;ndern je mindestens 1 % der
          Stimmen erh&auml;lt, kommt in den Genu&szlig; der
          staatlichen F&ouml;rderung. Also alle Parteien, die
          sowieso schon</P>

          <UL>
            <LI>regelm&auml;&szlig;ig die Wahlkampfkosten erstattet
            bekommen, also pro W&auml;hlerstimme 250 Eurocent</LI>

            <LI>umfangreichen Immobilienbesitz haben</LI>

            <LI>h&ouml;here Mitgliedsbeitr&auml;ge von sehr vielen
            Mitgliedern einnehmen</LI>

            <LI>sehr hohe Spendenzufl&uuml;sse haben</LI>

            <LI>die noch dazu oftmals Firmenspenden sind, auf die
            die &Ouml;DP ja wegen der Entflechtung von Politk und
            Wirtschaft und um ihre Unabh&auml;ngigkeit zu wahren,
            freiwillig verzichtet</LI>

            <LI>und die &uuml;berdies auch eben oft schlichtweg
            Bestechungsgelder sind.</LI>
          </UL>

          <P>Parteien, die die Kriterien f&uuml;r die Bezuschussung
          nicht erf&uuml;llen, haben also eh keine
          Existenzberechtigung, so eine weitere Begr&uuml;ndung der
          Altparteien, und daher auch kein Anrecht auf staatliche
          F&ouml;rderung. Kann man die Demokratie noch zynischer
          demontieren ? Ja, man kann: Allgemein bekannt ist, dass
          die CSU, die ja nur in Bayern antritt, demzufolge keine
          F&ouml;rdermittel mehr bekommen w&uuml;rde, weil sie ja
          nur in einem Bundesland &uuml;ber 1% der Stimmen
          erh&auml;lt. Damit die CSU nun nicht ihr Aktionsgebiet
          ausdehnen und der CDU Konkurrenz machen muss, findet sich
          eine Klausel, die besagt, dass eine Partei, die in einem
          Landtag vertreten ist, nat&uuml;rlich auch die
          Bezuschussung erh&auml;lt. Deutlicher kann es nicht mehr
          gemacht werden, dass die Neustrukturierung der
          Finanzierungsregelungen nur einem Ziel dient - die
          m&ouml;gliche Konkurrenz von morgen bereits heute elegant
          auszuschalten, dem W&auml;hler keine Alternative zu
          bieten und damit den eigenen Stimmenanteil bequem zu
          halten. Infolgedessen werden bei vielen kleinen Parteien
          wahrscheinlich die Lichter ausgehen. Es ist ja nicht so,
          dass wir das Geld zum Fenster rauswerfen w&uuml;rden. Die
          &Ouml;DP finanziert sich von den F&ouml;rdermitteln,
          Spenden und Mitgliedsbeitr&auml;gen die &ouml;p, die
          Wahlk&auml;mpfe, die Internetseite, Reisekosten,
          Organisationskosten, Ausgleich f&uuml;r sozial Schwache,
          die den Sozialmitgliedsbeitrag zahlen und anderes mehr,
          Dinge, f&uuml;r die die Altparteien jeweils viel
          h&ouml;here Mitgliedsbeitr&auml;ge fordern und hohe
          Politikergeh&auml;lter zahlen. Die Wahlk&auml;mpfe
          finanziert ihnen ja sowieso &uuml;ber die
          Wahlkampfskostenerstattung der Staat - und damit WIR! Wir
          zahlen den Altparteien Geld, damit diese die &Ouml;DP und
          andere Parteien ins Aus kicken. Was ist das Resultat, was
          ist die Konsequenz ? Sicherlich muss die &Ouml;DP zu
          sparen beginnen. Aber sicherlich ist jetzt auch der
          Zeitpunkt gekommen zu sagen, jetzt erst recht! Zeigen wir
          den Geldverschwendern, da&szlig; ihre Taktik nur Lug und
          Trug ist. Nie war es so wichtig, in der &Ouml;DP Mitglied
          zu sein, wie heute! Damit wir auch morgen noch eine
          Alternative haben! (ZQ)</P>

          <P>Die Demontage der Demokratie</P>

          <UL>
            <LI>1949 - Die 5%-H&uuml;rde auf Landesebene wird
            eingef&uuml;hrt. Will eine Partei im Bundestag
            vertreten sein, muss sie in einem Land mehr als 5% der
            Stimmen erhalten. Begr&uuml;ndung: "Weimarer
            Verh&auml;ltnisse" sollen vermieden werden.</LI>

            <LI>1953 - Die 5%-H&uuml;rde wird auf Bundesebene
            eingef&uuml;hrt. Bisher reichte es, um in den Bundestag
            einzuziehen, in einem Land die 5%-H&uuml;rde zu
            &uuml;berspringen. Begr&uuml;ndung: "Weimarer
            Verh&auml;ltnisse sollen vermieden werden.</LI>

            <LI>1956 - Die Zahl der Direktmandate, die notwendig
            sind, um unter Umgehung der 5%-H&uuml;rde in den
            Bundestag einzuziehen, wird von 1 auf 3 erh&ouml;ht.
            Begr&uuml;ndung: Die 5%-H&uuml;rde alleine habe "nicht
            den gew&uuml;nschten Erfolg" gezeigt.</LI>

            <LI>2002 - siehe oben.</LI>
          </UL>

          <P>Quelle: Karl-Rudolf Korte, Wahlen in der
          Bundesrepublik Deutschland, Bonn 2000</P>

          <P>Eingesandt: &lt;zaquarta@nikocity.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

