<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Hilfe f&uuml;r AWeb
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE summary="" width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
      <TR>
        <TD>
        <font size=+1><A href="tt_ttx.html"><B>zur&uuml;ck zum Frame</B></A></font>
          <H1 align="center">
            Hilfe f&uuml;r AWeb
          </H1>
          <BR>
           <BR>

          <P>
            Hier eine kleine Hilfe f&uuml;r AWeb-Nutzter, die sich vielleicht fragen, wie man die Kn&ouml;pfe unter dem gro&szlig;en Status-Feld nach den eigenen W&uuml;nsche &auml;ndern kann. Dazu
            nun eine kleine Anleitung.
          </P>
          <P>
            Die Kn&ouml;pfe, von denen ich hier schreibe, nennen sich "benutzerdefinierte Kn&ouml;pfe".<BR>
             Urspr&uuml;nglich ist die Knopfleiste wie folgt belegt:
          </P>
          <CENTER>
            <IMG src="tt_aweb1.jpg" alt="Knopfleiste vorher" width="342" height="162">
          </CENTER>
          <P>
            Nun m&ouml;chte ich die Funktion der Kn&ouml;pfe &auml;ndern, und das geht folgenderma&szlig;en:<BR>
             Im Men&uuml; <I>Einstellungen/GUI-Einstellungen</I> den Reiter <I><U>3</U>&nbsp; Kn&ouml;pfe</I> anklicken. Nun erscheint das Einstellungsfenster mit den vordefinierten Kn&ouml;pfen.<BR>
             Am einfachsten ist das Erzeugen oder &auml;ndern eines Knopfen mit einer Web-Adresse.<BR>
             Wird z.B. der Knopf <I>AmiTrix</I> nicht ben&ouml;tigt, einfach den entsprechenden Eintrag in <I>GUI-Einstellungen</I> klicken. Unten links im Fenster sind die beiden Eintr&auml;ge
            <I>Name</I> und <I>Befehl.</I> In das Feld <I>Name</I> wird nun der neue Name des Knopfes eingetragen: Als Beispiel <B>Amiga-News</B>. In das Feld <I>Befehl</I> kommt jetzt der das
            Argument<BR>
             <B>OPEN http://amiga-news.de</B> hinein. Mit Return best&auml;tigen sonst wird die neue Eingabe nicht &uuml;bernommen.<BR>
             Speichern und fertig ist der erste Knopf.
          </P>
          <P>
            Damit ich mich nicht immer &uuml;ber den Men&uuml;punkt <I>Projekt/&ouml;ffne lokal...</I> durch die Verzeichnisse hangeln muss, m&ouml;chte ich noch einen Knopf f&uuml;r die monatliche
            NoCover haben, die ich in einem bestimmten Verzeichnis auf meiner Festplatte habe. Das wird auch gleich ge&auml;ndert.<BR>
             Wieder die <I>GUI-Einstellungen</I> &ouml;ffnen.<BR>
             Diesesmal ver&auml;ndere ich den Knopf <I>News</I>. Bei mir soll er nat&uuml;rlich NoCover hei&szlig;en. NoCover kommt in das Feld <I>Name.</I> Der Befehl zum &ouml;ffnen eines
            Verzeichnisses ist dem &ouml;ffnen einer Web-Adresse &auml;hnlich:<BR>
             <B>OPEN "file:///MeinLaufwerk:MeinVerzeichnis/NoCover/index.html"</B><BR>
             Return dr&uuml;cken und das ganze wieder speichern.<BR>
          </P>
          <CENTER>
            <IMG src="tt_aweb2.jpg" alt="GUI-Einsteller" width="628" height="218">
          </CENTER>
          <P>
            Als drittes gibts f&uuml;r AWeb noch eine Uhr. Ich nehme einfachheitshalber Clock vom AmigaOS. Auch hier ist die Eingabe der Befehle &auml;hnlich wie oben beschrieben, nur wird hier
            einfach der Pfad der Uhr eingetragen:<BR>
             <B>SYSTEM SYS:Utilities/Clock pubscreen %n digital format 2 top 0 left 1000</B><BR>
             Kurze Erl&auml;uterung dieses Mammut-Argument`s:<BR>
             SYSTEM f&uuml;hrt einen Shell-Befehl aus, dann kommt der Pfad, in dem Clock zu finden ist. Der Platzhalter (%n) wird im GUI-Einstellungsfenster unten rechts, hinter <I>Befehl</I>
            ausgew&auml;hlt (Pfeil nach unten), und bewirkt, das Clock auf dem AWeb-Screen ge&ouml;ffnet wird. Die Parameter von Clock:<BR>
             <I>digital</I> schaltet auf Digital-Anzeige, <I>format 2</I> mit Sekunden, <I>top</I> Anzeige in der Titelzeile, <I>left 1000</I> Clock 1000 Punkte von links anzeigen.<BR>
             Speichern nicht vergessen.<BR>
             Kleiner Hinweis: Ist Clock auf dem AWeb-Screen aktiv, kann AWeb erst beendet werden, wenn Clock beendet wird.<BR>
          </P>
          <HR>
          <BR>

          <CENTER>
            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC">
                  <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
            <font size=+1><A href="tt_ttx.html"><b>zur&uuml;ck zum Frame</b></A></font>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

