<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Leveldesign 4</TITLE>
<META name="author" content="Rainer Wrieden">
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</HEAD>

<BODY background="comp005.gif" text="Black">
<DIV align="CENTER">
<table width="640" border="0" cellspacing="0" cellpadding="8" background="comp005_trans.gif" summary="">
<TR>
<TD>
<p title=""><font size=+1><A href="ws_wsx.html"><B>zur&uuml;ck zum Frame</B></A></font></P>
<H1 align="center"><FONT face="" color="Green">Leveldesign 4</FONT></H1>
<p title="" align="JUSTIFY"><font face="" size="+2" color="Red">Vorwort:</FONT><BR><BR>
Ich hoffe Ihr seit mit meinen Ausf&uuml;hrungen des 3. Teils klargekommen.
Hier gibt es die Level aus den vorangegangenen Teilen 1-3 f&uuml;r alle die sie noch nicht konstruiert haben aber nun einsteigen wollen [<a href="test1.wad">test1.wad</a>] [<a href="test2.wad">test2.wad</a>] [<a href="test3.wad">test3.wad</a>]. Nun wollen wir aber gleich zum n&auml;chsten Abschnitt dieses Workshops gehen.</P><br>
<FONT face="" size="+2" color="Red">Wir erstellen einen Lift:</FONT><BR><BR>
Wie immer starten wir DEU &uuml;ber die Workbench.<br>
Dann lesen wir mit <font face="" color="Blue">r test3.wad</font> unseren Level ein, den wir im 3. Teil des Workshops konstruiert hatten.<br>
Nun geben wir <font face="" color="Blue">e 1 1</font> ein um diesen Level zu ver&auml;ndern.<br>
Nun sind wir im DEU mit unserem Level aus dem vorangegangen Teil.<br>
Wie wir es auch schon von den vorherigen Teilen kennen, skalieren wir erstmal die Anzeige.<br>
Solange die <font face="" color="Blue">&szlig;-Taste</font> dr&uuml;cken bis Scale 1/1 erscheint.<br>
Danach solange die <font face="" color="Blue">G-Taste</font> dr&uuml;cken bis Grid=16 erscheint.<br>
<p title="" align="JUSTIFY">Nach und nach werde ich bestimmte, immer wiederkehrende Schritte weglassen, da sie in den vorangegangenen Teilen ausf&uuml;hrlich erkl&auml;rt wurden.
Als erstes m&uuml;ssen wir unseren Level ein wenig vergr&ouml;ssern. Dazu bitte beide unten in den Bilder markierten Vertexes bis zu einem Abstand von 12 K&auml;stchen zum Fenster verschieben.</p><br><br>
<DIV align="center">
<IMG src="deub.png" width=206 height=238 border=0 alt="">
<IMG src="deuc.png" width=270 height=238 border=0 alt="">
<IMG src="deud.png" width=270 height=190 border=0 alt="">
</DIV>
<BR><BR>
<p title="" align="JUSTIFY">Wir m&ouml;chten einen Raum mit einem Lift an der oberen rechten Wand hinter dem Fenster erstellen. Diser raum soll 3 Sektoren beinhalten. Einen normalen Flur, einen Lift und einen etwas tiefer liegenden Flur. Wir setzen f&uuml;r den normalen Flur 4 neue Vertex; zwei davon auf der oberen rechten Wand hinter dem Fenster. Die Frage nach dem Teilen dieser Linedef bejahen wir. Danach markieren und LineDef einf&uuml;gen. Diese wiederum markieren und als neuen Sektor deklarieren. Dar&uuml;ber zwei weitere Vertex einf&uuml;gen und auch LineDef einf&uuml;gen und als Sektor deklarieren. Nun noch ein letztes mal oberhalb dieser 2 weitere Vertex setzen, LineDef hinzuf&uuml;gen und als Sektor deklarieren. Bitte die Abst&auml;nde laut den unteren Bildern einhalten.</p><br><br>
<DIV align="center">
<IMG src="deue.png" width=254 height=222 border=0 alt="">
<IMG src="deuf.png" width=158 height=286 border=0 alt="">
<IMG src="deug.png" width=158 height=302 border=0 alt="">
</DIV>
<BR><BR>
Nun haben wir 3 neuen Sektoren mit den Nummer 6, 7 und 8 wie auf dem unteren Bild ersichtlich. 
<BR><BR>
<DIV align="center">
<IMG src="deuh.png" width=158 height=350 border=0 alt="">
</DIV>
<BR><BR>
<p title="" align="JUSTIFY">Nun m&uuml;ssen wir den oberen Sektor modifizieren. Damit unser Lift auch eine Daseinsberechtigung hat setzen wir die H&ouml;he des Flures von diesem Sektor auf -64. Dazu einfach den Sektor anw&auml;hlen und Return dr&uuml;cken, dann Men&uuml;punkt 1 - Change Floor height w&auml;hlen. Dort dann die -64 eintragen. Das Minus war bei mir auf dem Zahlenblock die 4. Nun nehmen wir und den eigentlichen Lift vor, der vom Sektor 7 dargestellt wird. Hier m&uuml;ssen wir 2 ver&auml;nderungen machen. Als erstes den Men&uuml;punt 7 - Change LineDef tag ausw&auml;hlen und den Wert 1 eingeben. Dann noch die Textur des Fussbodens &auml;ndern damit wir auch dort einen Lift erkennen k&ouml;nnen. Bei Change Floor Texture w&auml;hlen wir nun <font face="" color="Blue">Step2</font> aus. Jetzt nehmen wir uns die im unteren linken Bild gezeigte LineDef vor. Zuerst legen wir einen neuen Typ fest. LineDef anw&auml;hlen Return dr&uuml;cken und dann Men&uuml;punkt 1 - Edit the Lined
ef, 2 - Change Type, 6 - Lift and moving things..., dort w&auml;hlen wir den Eintrag <font face="" color="Blue">88 WR Lower Lift (raises after 3 sec.)</font>. Danach w&auml;hlen wir f&uuml;r die 2nd. Sidedef die Textur <font face="" color="Blue">Support2</font>. Das ist die Textur, die man sieht wenn der Lift unten ist. Nun editieren wir die im unteren rechten Bild gezeigte LineDef. Hier legen wir auch wieder einen neuen Typ fest. LineDef anw&auml;hlen Return dr&uuml;cken und dann Men&uuml;punkt 1 - Edit the Linedef, 2 - Change Type, 6 - Lift and moving things..., dort w&auml;hlen wir den Eintrag <font face="" color="Blue">62 SR Lower Lift (raises after 3 sec.)</font>. Danach w&auml;hlen wir f&uuml;r die 1st. Sidedef die Textur <font face="" color="Blue">Plat1</font>. Diese Textur gibt dem Lift das Aussehen einer hydraulischen Hebeb&uuml;hne. Bei beiden LineDefs m&uuml;ssen wir nun noch einen Sektortag deklarieren mit dem men&uuml;punkt 1 - Edit the Linedef, 3 - Change Sector tag und 
geben dort den Wert 1 ein. Bitte darauf achten, dass die Mittellinien der LineDefs vom Sektor weg zeigen.</p>
<BR><BR>
<DIV align="center">
<IMG src="deui.png" width=179 height=338 border=0 alt="">
<IMG src="deuj.png" width=158 height=318 border=0 alt="">
</DIV>
<BR><BR>
<p title="" align="JUSTIFY">Nun geht es an die beiden Seitenw&auml;nde des Lifts. Damit die Textur nicht auch hoch und runter f&auml;hrt, wenn sich der Lift bewegt Editieren wir bei beiden LineDefs die Flags mit Men&uuml;punkt 1 - Edit LineDef, 1 - Change Flags und markieren dort 4 - Upper texture unpegged.</p> 
<br><br>
<DIV align="center">
<IMG src="deuk.png" width=165 height=324 border=0 alt="">
</DIV>
<BR><BR>
<FONT face="" size="+2" color="Red">Wir erstellen einen Lift:</FONT><BR><BR>            
<p title="" align="JUSTIFY">Wie auch schon in den vorangegangenen Teilen des Workshop kommt nun der spannende Teil. Wie sieht mein Lift denn nun aus? Kann ich mit ihm wirklich verschiedene H&ouml;henstufen &uuml;berbr&uuml;cken und schiesst er mich gleich zum Mond? Wir k&ouml;nnen dies nun wieder anhand von DoomAttack testen.</p>
Bitte dazu nun unseren Level test4.wad in den Ordner von DoomAttack kopieren.<BR>
Dann das Icon DoomAttack_Clickme anw&auml;hlen.<BR>
Danach im CLI in den Ordner von DoomAttack.<BR>
Einen Stack von 100000 einrichten.<BR>
Nun wird DoomAttack im CLI wie folgt aufgerufen: <font face="" color="Blue">doomattack -file test4.wad</font><BR>
<p title="" align="JUSTIFY">Dann ein neues Spiel mit Episode 1 starten und wenn alles geklappt hat sollten wir uns in unserem gerade erstellten Raum befinden. Nun k&ouml;nnen wir den Flur entlang gehen und unseren Lift sehen. So wie wir ihn betreten bef&ouml;dert er uns auf die Ebene des tieferliegenden Flures. Bleiben wir drauf stehen fahren wir wieder mit ihm nach oben. Gehen wir runter und drehen uns schnell um, k&ouml;nne wir sehen wie er wieder nach oben f&auml;hrt. Stehen wir nun vor ihm und best&auml;tigen die Space-Taste f&auml;hrt er wieder runter und wir k&ouml;nne draufgehen um mit ihm wieder nach oben zu fahren. Hier ist der fertige Level [<a href="test4.wad">test4.wad</a>].</p><BR><BR>
             
<table cellspacing="5" cellpadding="0" align="CENTER" summary="">
<TR>
<TD><IMG src="doom1.png" width=320 height=200 border=2 alt="" style="border-color: Red;"></TD>
<TD><IMG src="doom2.png" width=320 height=200 border=2 alt="" style="border-color: Red;"></TD>
</TR>
<TR>
<TD><IMG src="doom3.png" width=320 height=200 border=2 alt="" style="border-color: Red;"></TD>
<TD><IMG src="doom4.png" width=320 height=200 border=2 alt="" style="border-color: Red;"></TD>
</TR>
</TABLE>
<BR>
<FONT face="" size="+2" color="Red">Schlusswort:</FONT><BR><BR>
Ich hoffe ich habe mich auch diesmal verst&auml;ndlich ausgedr&uuml;ckt.<BR>
F&uuml;r Anregungen und Fragen bin ich unter meiner E-Mail Adresse <a href="mailto:spezis@terra.es">spezis@terra.es</a> erreichbar.<BR><BR>
DEU sowie auch DoomAttack gibt es im Aminet.<BR><BR>
Euer Spezi<BR><BR>
<TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
<TR>
<TD>Rainer Wrieden</TD>
<TD>E-Mail: <A href="mailto:spezis@terra.es">spezis@terra.es</A></TD>
</TR>
</TABLE>
<font size=+1><A href="ws_wsx.html"><B>zur&uuml;ck zum Frame</B></A></font>
</TD>
</TR>
</TABLE>
</DIV>
<BR>
</BODY>
</HTML>

