<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Packet Radio</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Packet Radio</U></H1><P ALIGN="CENTER">von<BR><A HREF="r.franke@gmx.de">Rene Franke</A></P>

<P>Ich m&ouml;chte hier &uuml;ber ein relativ junges Telekomunikationsmedium
schreiben.</P>

<P>Es handelt sich um eine Funkbetriebsart, die sich &quot;<B>Packet Radio</B>&quot; (PR)
nennt. An sich ist sie nicht so jung, aber sie findet nicht mehr
ausschlie&szlig;lich auf den Frequenzen der Funkamateure statt, sondern ist
jetzt auch sehr auf CB-Funk aktiv. CB-Funk darf ja schlie&szlig;lich jeder
machen.</P>

<P>Es gibt ein in Deutschland gro&szlig;fl&auml;chig ausgebautes <B>Funk-Netz</B>, das fast
genauso funktioniert, wie die Newsgruppen etc.</P>

<P>Es gibt <B>Mailboxen</B>, aus denen man allerhand Nachrichten von Gott und
der Welt auslesen und nat&uuml;rlich auch seinen eigenen Senf dazugeben kann.</P>

<P>Allerdings hat die ganze Sache eine kleinen Schwachpunkt. Auf CB-Funk
darf jeder machen, was er will - fast alles ist erlaubt. Somit schie&szlig;en
einfach mal ein paar Mailboxen aus dem Boden und andere verschwinden
einfach.</P>

<P>Somit laufen meistens <B>private Nachrichten</B> an eine bestimmte Person,
vergleichbar mit E-Mails, ziellos umher und erreichen ihren Empf&auml;nger
nicht. Sie bleiben dann einfach bei einem Sysop liegen, der nicht so
hundertprozentig in der Lage ist, sein System ordentlich zu warten.</P>

<P>Wer den CB-Funk schon vom Sprechfunk her kennt, der wei&szlig;, da&szlig; es da
manchmal drunter und dr&uuml;ber geht, das ist auf PR nicht ganz so schlimm,
aber ein gewisses Chaos herrscht auch dort zu den Hauptverkehrszeiten,
wenn alle auf einmal losfunken wollen. </P>

<P>Da der CB-Funk ja meist nicht &uuml;ber riesige Entfernungen klappt, wird
das Internet per E-Mail, oder auch nur eine Telefonmodemverbindung
zweier Boxen zu Hilfe genommen, um die Nachrichten z.B. von Berlin
nach Hannover zu schicken. Es gibt auch immernoch PR-Freie Zonen.</P>

<P>Allerdings sollte man bei einer momentanen <B>&Uuml;bertragungsrate</B> von
theoretisch 1200 Bit/s keine Wunder erwarten. Es gibt schon Hardware,
die auf dem schmalen CB-Funk-Frequenzband &Uuml;bertragungsraten bis
9600 Bit/s erlauben. In einigen Regionen Deutschlands gibt es schon
sogenannte Highspeednetze.</P>

<P>Die Hardware und auch die Software ist so konzipiert, da&szlig; nicht gesendet
wird, wenn schon Daten auf der Frequenz gesendet werden. Um es einfach
auszudr&uuml;cken: Die Software des Rechners oder die Software des TNC achten
selbst auf Disziplin und senden nur dann, wenn die Frequenz frei ist.
Das geht aber alles sehr schnell von Statten.</P>

<P>Dies funktioniert durch eine <B>Digitale Rauschsperre</B>. Man sollte also
seine eigene Rauschsperre am Funkger&auml;t immer ganz offen lassen.</P>

<P>Die meisten PR-Programme lassen <B>bis zu 10 Verbindungen gleichzeitig</B> zu.
Es ist aber auch m&ouml;glich, je nach Konfiguration, noch mehr Verbindungen
zu schalten.</P>

<P>Was noch interessant ist, ist die Errichtung von <B>Digipeatern und Nodes</B>
(Relaisstellen), die in der Lage sind, meine Daten kurzeitig
zwischenzuspeichern und sie dann an einen Teilnehmer weiterschicken,
den ich direkt gar nicht auf meiner Antenne empfangen kann. Somit sind
Verbindungen von Berlin bis Dresden m&ouml;glich.</P>

<P>Wie funktioniert das? Ganz einfach!</P>

<P>Zwischen zwei Stationen die sich auf Grund der Entfernung nicht direkt
empfangen k&ouml;nnen, liegt einfach eine Station in der Mitte, welche die
Daten des einen aufnimmt und an den anderen weitersendet. Das funktioniert
nat&uuml;rlich in beide Richtungen.</P>

<P>Das Ganze ist auch nicht auf nur eine solche Station in der Mitte
beschr&auml;nkt. Um sehr gro&szlig;e Entfernungen zu &uuml;berbr&uuml;cken ben&ouml;tigt man auch
mehrere solcher Digipeater oder Nodes.</P>

<P>Der Gro&szlig;teil aller PR-User ist allerdings mit PC's bewaffnet, um seinem
Hobby zu fr&ouml;hnen. Es gibt aber auch alles notwenige an Hard- und Software
f&uuml;r den Amiga.</P>

<P>Hier im Raum Berlin, wo ich zu Hause bin, werden es etwa 50 PR'ler sein,
davon nur ca. 8 mit Amiga und sogar ein harter Freak mit einem C64 macht
damit PR. :-)</P>

<P>Bei einem guten Fachh&auml;ndler f&uuml;r Mobil- und Betriebsfunk bekommt man z.B.
ein Funkmodem oder auch einen TNC, der dann als Verbindungsst&uuml;ck zwischen
Computer und Funkger&auml;t dient.</P>

<P>Entsprechende Software, also Packet Radio-Terminalprogramme gibt es im
Aminet. Da w&auml;re erstmal <B>AmiCom2.3</B>, einfach aber gut. L&auml;&szlig;t sich mit Modem
und TNC betreiben.</P>

<P>Dann w&auml;re da noch <B>AHP4.04</B>, komplexes PR-Programm mit gro&szlig;er
Arexxschnittstelle, allerdings ben&ouml;tigt man daf&uuml;r einen TNC oder die
TNC-Emulation <B>AmigaTNC</B> mit Modem.</P>

<P>Neu entwickelt wird gerade ein Programm namens <B>ProfiPacket</B>. Von diesem
Programm gab es schon mehrere Betaversionen im Aminet.</P>

<P>Zum Schlu&szlig; gibt es da noch das Programm <B>AmigaPacket3.17</B>, allerdings
kenne ich da die Bezugsquelle nicht und habe es selbst auch nicht
zur Verf&uuml;gung.</P>

<P>Einige werden jetzt Fragen, was ein <B>TNC</B> ist? Um hier keine
wissenschaftliche Abhandlung zu verfassen, nur soviel: TNC steht f&uuml;r
TerminalNodeController. Das ist ein Modem, das dem Rechner schon
einiges an Arbeit abnimmt, welche er beim Modem selber machen mu&szlig;.</P>

<P>Es ist auch in der Anschaffung wesentlich teurer als ein Modem.
Ein Funkmodem kostet so zwischen 50,- und 100,- und ein TNC meist
nicht unter 180,-.</P>

<P>Auf folgenden <B>CB-Funkkan&auml;le</B>n ist diese Betriebsart vom BMPT
zugelassen: 24, 25, 52, 53, 76, 77</P>

<P>Ich habe mal mit Null Ahnung damit angefangen. Die Bedienungsanleitungen
von AmiCom und AHP sind in deutsch und sehr ausf&uuml;hrlich. </P>

<P>Wer mehr dar&uuml;ber erfahren will, kann mir gern eine E-Mail schreiben:</P>
<P ALIGN=CENTER><A HREF="mailto:r.franke@gmx.de">r.franke@gmx.de</A></P>
<P>Mein PR-Rufzeichen lautet RF8BLF, meine Heimatmailbox ist die
BL1BOX.#BLF.BRB.DEU.EU</P>
<P>Vielleicht liest man ja mal was voneinander auf diesem Medium.</P>
<P>Bis dahin verabschiede ich mich mit den besten Gr&uuml;&szlig;en.</P>
<P>Tschau von Rene Franke.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT"><A HREF="wb_tun3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="packer_1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
