<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD><TITLE>AmZeiger 12/97 - Kurs: Packer 1/2</TITLE></HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Packer-Kurs 1/2</H1>von<BR><A HREF="mailto:A.Schlick@BBrandes.in-brb.de">Andreas Schlick</A></CENTER>

<P>Dieser Kurs widmet sich in zwei Teilen den Packern/Archivern. Im ersten
Teil werde ich die meistverbreitetsten Packer kurz vorstellen und einen
Geschwindigkeitsvergleich machen. Im zweiten Teil geht es um die Bedienung
und die Optionen.</P>

<H3>LhA</H3>
<P>Der Standard-Packer auf dem Amiga ist wohl LhA. Die meistgenutzte
Portierung stammt von Stefan Boberg. Leider entwickelt er den Amiga-Port
nicht mehr weiter, so da&szlig; die letzte Version V1.38 (unreg.) von 1992
ist.</P><P>Der Unix-LhA-Sourcecode ist zwar frei erh&auml;ltlich, so da&szlig; ein einfaches
recompilen kein Problem sein sollte, allerdings hatte Stefan noch starke
Optimierungen f&uuml;r den Amiga gemacht. Desweiteren unterst&uuml;tzt diese
Portierung noch die Amiga-Dateikommentare und Schutzbits.</P><P>
LhA ist Shareware. Leider gab Stefan Boberg trotz eingestellter
Entwicklung den Key nicht frei. Ob &uuml;berhaupt noch Registrierungen
angenommen werden, ist mir nicht bekannt, jedoch halte ich es f&uuml;r sehr
unwahrscheinlich.</P><P>Ein Zusatztool zu LhA bzw. als Feature der registrierten Version gab/gibt
es noch LhASFX, mit dem man SelFeXtracting (dt. selbstentpackende) Archive
erstellen kann/konnte. Jedoch soll die verwendete Routine des Tools
fehlerhaft sein, so da&szlig; ich von der Verwendung stark abraten
w&uuml;rde.</P><P><B>Postfix der Archive:</B> .lha</P>
<H3>LZX</H3>
<P>LZX h&auml;tte der Standard-Packer werden k&ouml;nnen. Leider verkaufte der
Entwickler Jonathan Forbes (zusammen mit Tomi Poutanen) den Algorithmus
und damit verlor leider der Amiga (mal wieder) ein wirklich gutes
Programm. Insbesondere der LZX-2 Algorithmus w&auml;re sehr interessant
geworden. Wer die K&auml;ufer waren, &uuml;berlasse ich der Fantasy des
nicht-informierten Lesers. :-) oder meines Erachtens eher ;-((</P>
<P>Vor ein paar Tagen konnte J. Forbes jedoch zumindest &uuml;berredet werden,
das LZX-Keyfile der Allgemeinheit zur Verf&uuml;gung zu stellen, so da&szlig; auch
die registrierte Version von LZX benutzt werden kann. Die letzte Version
ist V1.21(r).</P>
<P><B>Postfix der Archive:</B> .lzx</P>
<H3>ZIP</H3>
<P>Auf dem PC eigentlich DER Standardarchiver. Seine Packraten sind sehr gut.
Der ZIP-Algorithmus hat verschiedene Anwendung gefunden, einmal als der
hier erw&auml;hnte Archiver, desweiteren noch in GZIP und f&uuml;r den Amiga gibt
es noch die ebenfalls erw&auml;hnenswerte XPKGZIP.library f&uuml;r das bekannte
XPK-Paket.</P>
<P><B>Postfix der Archive:</B> .zip</P>
<H3>GZip/Tar</H3>
<P>Dieses Gespann stammt aus der Unix-Welt. Tar ist ein reiner Filearchiver
ohne Kompression. Mit Hilfe von tar werden die verschiedene Files
zusammengef&uuml;gt (nein, es ist kein Join-Kommando). Das entstehende
Tar-Archive wird dann meist mit GZip gepackt.</P>
<P>Die umgekehrte Reihenfolge (erst GZip, dann Tar) ist weniger sinnvoll,
da dann GZip nur fileweise komprimieren kann, w&auml;hrend sonst ja ein
file&uuml;bergreifendes Komprimieren stattfindet, was teils zu erheblich
besseren Kompressionsraten f&uuml;hren kann.</P>
<P>Aufgrund der Unix-Abstammung sind auch die Amiga-Portierungen etwas
umst&auml;ndlich zu bedienen. Die Bedienung und Optionen werden im zweiten
Kursteil besprochen.</P>
<P>Falls jemand einen einfachen Entpacker f&uuml;r Tar/GZIP Archive ben&ouml;tigt,
sollte er sich UnTGZ von Oliver Wagner anschauen.</P>
<P><B>Postfix der Archive:</B> .tgz<BR>.tar.gzip</P>
<H3>compress</H3>
<P>Eine weitere Unix-Abstammung, die jedoch nur einen einfacheren
Algorithmus zum Komprimieren benutzt. Eine Amiga-Portierung existiert,
jedoch l&auml;&szlig;t sich sich der Unix-Sourcecode auch portieren.</P>
<P><B>Postfix der Archive:</B> .Z</P>
<H3>Arj</H3>
<P>Arj ist ein im PC-Sektor recht verbreiteter Packer. F&uuml;r den Amiga
gibt es jedoch nur einen Entpacker. Arj wurde 1990-93 von Robert Jung
entwickelt, die Amiga-Protierung stammt von Andreas Kleinert.</P>
<P><B>Postfix der Archive:</B> .arj</P>
<H3>RAR</H3>
<P>Und noch ein aktueller PC-Archiver, f&uuml;r den es nur ein Unpack-Programm
f&uuml;r den Amiga gibt. Das UnRAR stammt von Eugene Roshal und die
Amiga-UnRAR-Portierung stammt von Andrea Vallinotto und unterst&uuml;tzt
jedoch keine SFX-Archive.</P>
<P><B>Postfix der Archive:</B> .rar</P>
<H3>XPK</H3>
<P>Eigentlich nicht direkt in diese Gruppe geh&ouml;rt das XPK-Paket, das aber
doch erw&auml;hnenswert ist. :)</P>
<P>Das XPK-Paket bietet mit der XPKMaster.library eine einheitliche
Schnittstelle f&uuml;r Programmierer zu den Sublibraries, die dann die
einzelnen Komprimierungs- und Verschl&uuml;sselungsalgorithemen
implementieren.</P>
<P>Dadurch l&auml;&szlig;t sich ein Programm relativ einfach f&uuml;r viele verschiedene
Komprimierungen anpassen und dann kann der User je nach Ausstattung
und Vorliebe einen Packer aussuchen. Einige bekannte Beispiel f&uuml;r die
XPK-Sublibs sind:</P>
<UL>
<LI>xpknuke.library</LI>
<LI>xpkshrink.library</LI>
<LI>xpkgzip.library</LI>
<LI>u.v.m.</LI>
</UL>
<H3>zoo</H3>
<P>Unter den alten Vertretern der Archiver findet sich zoo. Von der
Verwendung von zoo ist sehr abzuraten, stattdessen sollte LhA oder LZX
verwendet werden. Die PC-Version stammt von Rahul Dhesi (1988), die
Amiga-Portierung machte J. Brian Walters.</P>
<P><B>Postfix der Archive:</B> .zoo</P>
<H3>arc</H3>
<P>Ein *sehr* alter Archiver, der vermutlich aus der Zeit von 1985/86/87
stammt. Wer noch arc-Files bei sich rumliegen hat, wird vermutlich
diesen Artikel nicht brauchen und besser dar&uuml;ber Bescheid wissen, als
ich. :)</P>
<P>Autoren: Raymond S. Brand und/oder System Enhancement Associates</P>
<P><B>Postfix der Archive:</B> .arc</P>
<H3>DMS</H3>
<P>DMS, das Disk-Masher-System, ist kein Filearchiver, sondern, wie der Name
schon sagt, f&uuml;r ganze Disketten da. DMS packt eine Diskette blockweise.
Es gibt verschiedene Versionen von DMS. Die Hauptunterscheidung bestehen
zwischen der &auml;lteren, orginalen Version von SDS Software und der sp&auml;teren,
als DMS-Professional bezeichneten, von ParCon.</P>
<P>Da DMS (Pro) ganze Diskette packt und die Disketten-Struktur beibeh&auml;lt,
wurde er haupts&auml;chliche f&uuml;r Demos und Raubkopien verwendet, da er manche
Kopierschutzmechanismen umging. Ob DMS Pro von ParCon-Software eine
legale Fortf&uuml;hrung von DMS ist, ist dem Autor nicht bekannt.</P>
<P>Da zur heutigen Festplatten-Zeit Programme sowieso auf Festplatte
installierbar sein m&uuml;ssen, ist von der Verwendung von DMS abzuraten, da
f&uuml;r Filearchive LhA/LZX besser geeignet sind. Auch von der Verwendung
der FMS (File-Masher-System) und SFX-Funktion des DMS Pro ist abzuraten. </P>
<P><B>Postfix der Archive:</B> .dms</P>
<P>Zum Abschluss noch ein <B>Geschwindigkeitsvergleich</B>. Der Test wurde auf
einem A2000/040/33MHz gemacht. Die Gr&ouml;&szlig;e der verwendeten Daten stehen bei.
Zum Test habe ich nur die am h&auml;ufigsten verwendeten Archiver genommen, f&uuml;r
die eine Amiga-Portierung existiert.</P>
<BR>
<TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>Geschwindigkeiten</CAPTION>
<TR>
    <TD ROWSPAN=2></TD>
    <TH COLSPAN=4>Packen</TH><TH COLSPAN=4>Entpacken</TH>
</TR>
<TR>
    <TD>LhA</TD>
    <TD>LZX</TD>
    <TD>ZIP</TD>
    <TD>GZip</TD>
    <TD>LhA</TD>
    <TD>LZX</TD>
    <TD>ZIP</TD>
    <TD>GZip</TD>
</TR>
<TR>
    <TD>Text (30KB)</TD>
    <TD>3sec<BR>33%</TD>
    <TD>3sec<BR>33%</TD>
    <TD>3sec<BR>33%</TD>
    <TD>3sec<BR>33%</TD>
    <TD>1sec</TD>
    <TD>1sec</TD>
    <TD>1sec</TD>
    <TD>1sec</TD>
</TR>
<TR>
    <TD>Text (1.2MB)</TD>
    <TD>36sec<BR>50%</TD>
    <TD>70sec<BR>38%</TD>
    <TD>50sec<BR>41%</TD>
    <TD>51sec<BR>41%</TD>
    <TD>17sec</TD>
    <TD>12sec</TD>
    <TD>15sec</TD>
    <TD>15sec</TD>
</TR>
<TR>
    <TD>GIF</TD>
    <TD>2sec<BR>100%</TD>
    <TD>2sec<BR>100%</TD>
    <TD>2sec<BR>100%</TD>
    <TD>2sec<BR>100%</TD>
    <TD>1sec</TD>
    <TD>1sec</TD>
    <TD>2sec</TD>
    <TD>2sec</TD>
</TR>
<TR>
    <TD>jpeg</TD>
    <TD>13sec<BR>100%</TD>
    <TD>10sec<BR>99%</TD>
    <TD>8sec<BR>100%</TD>
    <TD>7sec<BR>100%</TD>
    <TD>6sec</TD>
    <TD>4sec</TD>
    <TD>4sec</TD>
    <TD>4sec</TD>
</TR>
<TR>
    <TD>Binaer (51KB)</TD>
    <TD>3sec<BR>40%</TD>
    <TD>5sec<BR>33%</TD>
    <TD>4sec<BR>38%</TD>
    <TD>3sec<BR>38%</TD>
    <TD>2sec</TD>
    <TD>1sec</TD>
    <TD>2sec</TD>
    <TD>1sec</TD>
</TR>
<TR>
    <TD>binaer (759KB)</TD>
    <TD>24sec<BR>56%</TD>
    <TD>34sec<BR>49%</TD>
    <TD>33sec<BR>54%</TD>
    <TD>29sec<BR>55%</TD>
    <TD>14sec</TD>
    <TD>13sec</TD>
    <TD>11sec</TD>
    <TD>10sec</TD>
</TR>
<TR>
    <TD>alle Dateien (ca. 2.3MB)</TD>
    <TD>67sec<BR>51%</TD>
    <TD>120sec<BR>48%</TD>
    <TD>91sec<BR>51%</TD>
    <TD>n/a</TD>
    <TD>39sec</TD>
    <TD>32sec</TD>
    <TD>39sec</TD>
    <TD>n/a</TD>
</TR>
</TABLE>

<P><B>Anmerkung:</B>Die oben angegebenen Werte wurden mit einem A2000/040
erstellt und k&ouml;nnen bestenfalls als N&auml;herung gelten. Beim Packen
wurde jedesmal der beste Packalgorithmus, der zur Verfügung stand, verwendet.
Bei einer geringeren Packratio ist z.B. LZX schneller und kann mit LhA
konkurrieren. Desweiteren kam es beim Entpacken der Zip-Archive manchmal zu
Checksummenfehlern. Ob dies an einem Fehler im Zip, UnZip oder ein
Bedienungsfehler(??) vorlag, war nicht festzustellen. Der Autor vermutet,
dass vielleicht ein Bug im verwendeten Zip-Programm vorliegt. (Nicht mit GZip
zu verwechseln!)</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712funk.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../mmx/9712mmx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


