<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - WBTuning-Kurs 3</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>WBTuning-Kurs</U></H1><P ALIGN="CENTER">von<BR><A HREF="g.franz@gmx.de">Gregor Franz</A></P>
<P>Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench,
der Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich
gibt es unz&auml;hlige Programme, Patches usw. die dazu beitragen (wollen).
Ich werde nicht auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar
Anregungen und Tips bei sein werden, die noch nicht allen bekannt sind.</P>
<P>Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es
kann sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht
in jedem Fall explizit ein. Eine Demoversion ist so gut wie immer frei
erh&auml;ltlich. Als Quelle fungiert das <A HREF="http://ftp.uni-paderborn.de/aminet/">AMINET</A>.</P>
<P>Verschiedene Funktionen sind auch in Multifunktions-Commodities
integriert, im Teil 6 werde ich auf ein Beispiel hierf&uuml;r eingehen.</P>
<P><TABLE BORDER=0 ALIGN=CENTER>
<TR><TD COLSPAN=2>Der Kurs setzt sich aus folgenden Artikeln zusammen:</TD></TR>
<TR><TD><OL>
<LI> Optische WB-Verbesserung</LI>
<LI> Smarte ZusatzFX</LI>
<LI> Disk-Tuning</LI>
<LI> Hilfreiche C-Vitamine</LI>
<LI> Sonstige Helferlein</LI>
<LI> Beispiel f&uuml;r Multicommodities: MultiCX</LI>
</OL>
</TD><TD>#1<BR>#2<BR>#3<BR>#4<BR>#4 + #5<BR>#5</TD></TR></TABLE></P>
<BR>
<H3 ALIGN=CENTER>3. Disk-Tuning</H3>
<P>Nun also geht es um Erleichterungen im Umgang mit Festplatte und
Floppy-Drive.</P>
<P>Was gleich nach dem Booten st&ouml;rt, ist das st&auml;ndige Klicken des Laufwerks
bzw. der Laufwerke, die nach eingelegten Disketten suchen.</P>
<P>Manche User haben sich damit beholfen spezielle `Schallschluck-Disketten`
einzulegen. Daf&uuml;r gibt es aber eine bessere L&ouml;sung: das Commodity <B>NoClick</B>.
Es sorgt daf&uuml;r, da&szlig; Ruhe herrscht, ohne die Funktionen der Laufwerke
irgendwie zu behindern.</P>
<P>H&auml;ufig erlebt man nach einem Doppelklick auf ein Icon (z.B. zu einem
Readme-File zugeh&ouml;rig), da&szlig; sich ein Fehler-Requester &ouml;ffnet, da das
zugeh&ouml;rige Tool (in den Icon-Informationen vorgegeben) nicht zu finden
ist. Wenn hier z.B. nach dem Textanzeiger `Muchmore` gesucht wird, ohne
das man im Besitz desselben ist, kann man mit <B>ToolAlias</B> ein Ausweichtool
definieren, auf welches dann automatisch umgeleitet wird.</P>
<P>Ebenfalls st&ouml;rend sind Fehlerrequester, wenn bestimmte Assigns nicht
gefunden werden. Ideal auch zum Austesten neuer Software, welche
spezielle Assigns ben&ouml;tigen, ist <B>Assignwedge</B>.</P>
<P>Dieses Tool leitet die Requester auf eigene erweiterte um, mit denen man
jetzt die Meldung abbrechen oder unterbinden kann, sowie ein Verzeichnis
angeben, das dann als Assign tempor&auml;r angemeldet wird.</P>
<P>Es gibt immer noch Programme, die ein spezielles Device (z.B. das
serial.device) f&uuml;r ihr Funktionieren voraussetzen, obwohl es f&uuml;r
manche Anwendungen bessere Alternativen gibt (z.B. 8N1.device oder
baudbandit.device).</P>
<P>Damit man nicht an ein Device f&uuml;r z.B. den seriellen Bus gekettet
ist, bietet hier <B>PatchDevice</B> die L&ouml;sung, indem es auf das gew&uuml;nschte
umleitet.</P>
<P>F&uuml;r Anwender, die mit PC-Disketten arbeiten, gibt es zwei gute Tips:</P>
<P>Erstens sollten sie umbedingt das <B>Multi-OS.device</B> einsetzen, das in einem
&auml;lteren im AMINET erh&auml;ltlichen Update des Emulators Emplant enthalten war.</P>
<P>Im dem, dem jeweiligen Laufwerk zugeh&ouml;rigen DOSDriver, z.B. PC0, mu&szlig; dann
mit einem Editor der Device-Eintrag `mfm.device` zu `multi-os.device`
ver&auml;ndert werden. Die Zugriffe auf PC-Disketten, wie Lesen und Schreiben
werden jetzt um ein Vielfaches beschleunigt!</P>
<P>Zum Zweiten sollten sie mit einem Programm wie <B>TDControl</B>, das aber z.B.
auch in vielen Multicommodities wie <A HREF="http://user.cs.tu-berlin.de/~zerocom/mcp/">MCP</A> und MultiCX eingebaut ist,
eine Einstellung des Trackdisk.device ver&auml;ndern. Setzen sie <B>TDRetry</B>
auf `1` statt `10`. Jetzt wird die PC-formatierte Diskette nicht
erst nach dem zehnten Versuch, sondern nach dem Ersten erkannt!</P><P>
F&uuml;r Leute, die viel mit <B>Diskimages</B> zu tun haben, gibt es auch
M&ouml;glichkeiten sich das Leben zu erleichtern. Denn z.B. die DMS-Archive
m&uuml;ssen nicht unbedingt auf Disketten geschrieben werden, wenn es sich
um das AmigaDOS-Format handelt.</P><P>
Mit <B>HFMounter</B> kann man sich auf der Festplatte bis zu zehn Diskimages
anlegen, die mit einer Gr&ouml;&szlig;e von etwa 900 KB dann einer Diskette
entsprechen. Es kann also auf sie genauso zugegriffen werden, nur
eben wesentlich schneller.</P><P>
Gro&szlig;er Beliebtheit erfreute sich stattdessen zu diesem Zweck die
RAD-Disk im RAM. Nachteil: Knapp 1 MB weniger Arbeitsspeicher
stehen einem zur Verf&uuml;gung.</P><P>
<B>StatRAM</B> ist die intelligentere L&ouml;sung. Denn es handelt sich um eine
dynamische RAM-Disk, was bedeutet: Nur der auf der virtuellen Diskette
tats&auml;chlich eingenommene Platz wird dem Arbeitsspeicher abgezwackt.
Au&szlig;erdem kann das Filesystem dieser `Diskette im Speicher` frei gew&auml;hlt
werden. Z.B. k&ouml;nnte eine PC-Diskette angelegt werden, was eventuell
f&uuml;r diverse Emulatoren von Interesse ist. Wie die RAD-Disk ist StatRAM
resetfest.</P>
<P>Ein gro&szlig;es eigenes Thema stellen die diversen speziellen <B>Filesysteme</B>
dar. Besonders interessant ist sicherlich das bekannte <B>MuFS</B>, welches
ein MultiUserFilesystem &auml;hnlich UNIX auf dem Amiga nachahmt. Jedem
Benutzer des Rechners k&ouml;nnen also eigene Zugriffsbereiche und Rechte
einger&auml;umt oder seine Aktionen in einem Logfile aufgezeichnet werden. </P>
<P>Leider war aus prinzipiellen Gr&uuml;nden keine komplette Sicherheit m&ouml;glich,
denn erfahrene User k&ouml;nnen mit Hilfe der HDToolbox das alte AmigaDOS-
Filesystem wiederherstellen und so Zugriff auf alles bekommen.</P>
<P>Die einzige sichere Abhilfe verschafft hier <B>DiskProtection</B>. Ein Paket,
das mit Hilfe hochwertiger Verschl&uuml;sselungsalgorithmen die Daten bereits
auf Device-Ebene verschl&uuml;sselt, so das ohne Pa&szlig;wort selbst Verzeichnis-
strukturen nicht mehr lesbar sind und nur eine unlesbare Disk (auch bei
Partitionen) erscheint. Ein Vorteil ist, da&szlig; das verwendete Filesystem
weiter frei w&auml;hlbar ist.</P>
<P>Viele Programme, die Unbefugten den Zugriff verweigern sollen, kranken
daran, da&szlig; sie bei einem Booten von Diskette oder ohne Startup-Sequence
umgangen werden k&ouml;nnen. Mit DiskProtection verschl&uuml;sselte Units sind
auch dann nicht nutzbar. Der Nachteil von DiskProtection sind die
etwas verl&auml;ngerten Zeiten bei Dateioperationen.</P>
<P>F&uuml;r User, die h&auml;ufig mit Diskette(n) arbeiten, sind zwei spezielle
Filesysteme zu empfehlen. Auf beide bin ich ausf&uuml;hrlich in dem
Artikel `<B>Filesysteme a la Carte</B>` in Ausgabe 1 eingegangen.</P>
<P>Das <B>PFS</B> (ProfessionalFileSystem) beschleunigt Diskettenoperationen
um das Mehrfache. Die genauen Geschwindigkeitsvergleiche sind in dem
angesprochenen Beitrag zu finden.</P>
<P>Mit <B>MFS</B> (MultiFileSystem) kann man mehrere auf einem Laufwerk verwendete
Filesysteme komfortabel verwalten, so da&szlig; z.B. auch PC-Disketten unter
der Bezeichnung DF0: angesprochen werden k&ouml;nnen und auf der WB pro
Diskette auch nur ein Icon erscheint.</P>
<P>Da wir gerade beim Verwalten sind: Mit <B>DevsMan</B>, dem DeviceManager kann
man problemlos und schneller als &uuml;ber die Workbench bestimmte Ger&auml;te
mounten oder installieren bzw. wieder nach `Storage` verschieben. Das
gilt nicht nur f&uuml;r DOSDriver, sondern z.B. auch f&uuml;r Monitor-Files oder
Datatypes. Ja, sogar das WBStartup-Verzeichnis und das MFS (s.oben)
werden unterst&uuml;tzt.</P><P>
Zum Schlu&szlig; noch etwas Besonderes: <B>DefIcons</B>, seit einiger Zeit
Bestandteil des NewIcon-Paketes kann auch ohne NewIcon-Installation
die Workbench verbessern. Denn hiermit werden auch Dateien ohne ein
eigenes Icon mit frei w&auml;hlbaren Standardicons angezeigt, mehr als
die handvoll der Workbench. Musikmodule oder Texte geben sich also
von nun an auch optisch sofort zu erkennen.</P>
<P>Wir sehen uns im n&auml;chsten Kursteil: gleiche Welle, gleiche Stelle.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT"><A HREF="../cc/9712mui.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712funk.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
