<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Kokeilussa AROS - Avoimen l&auml;hdekoodin AmigaOS</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:janne.siren@helsinki.fi">janne.siren@helsinki.fi</a>&gt;<br>
							Kuvat: Janne Sir&eacute;n ja AROS Development Team (luvalla)</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Muistan kuulleni AROSista ensimm&auml;ist&auml; kertaa joskus kun Commodore viel&auml; py&ouml;ritti bisnest&auml;. Historiankirjoihin tutustuminen paljastaakin AROS-projektin alkaneen vuonna 1993 eli Commodoren konkurssia edelt&auml;neen&auml; vuotena. Yll&auml;tys oli suuri, kun huomasin hiljattain AROSin kehitysty&ouml;n jatkuvan edelleen - l&auml;hes kymmenen vuotta my&ouml;hemmin.<br>
								<br>
								Yll&auml;tys oli viel&auml; suurempi, kun kuulin sen kehitysty&ouml;n osia k&auml;ytetyn jopa kahdessa tunnetummassa kilpakumppanissa: AmigaOS:ss&auml; ja MorphOS:ss&auml;. Kun sitten p&auml;ivitetty bin&auml;&auml;rilevityspaketti paukahti Source Forgeen hein&auml;kuussa, oli t&auml;h&auml;n kummajaiseen viimeinkin pakko tutustua tarkemmin. Mik&auml; oikein on AROS? Tutustu my&ouml;s projektikoordinaattori Aaron Digullan <a href="digulla.html" target="_top">haastatteluun</a> t&auml;ss&auml; Sakussa!</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga Research OS</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AROS muistetaan nimest&auml; Amiga Replacement OS, joka kuvastaa hyvin projektin luonnetta. Yksinkertaistaen AROSin tarkoitus on korvata AmigaOS. Tausta on kuitenkin hieman monimutkaisempi. AROSin suunnittelu aloitettiin aikana, jolloin Commodoren alam&auml;ki kiihtyi, ja se on jatkunut l&auml;pi my&ouml;hempien aikojen omistussotkujen, konkurssien ja takink&auml;&auml;nt&ouml;jen. Kun muut l&auml;hinn&auml; puhuivat, AROSin tekij&auml;t koodasivat.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Projekti AROS aloitettiin vuonna 1993 tavoitteena parantaa Amigan asemia tietokonemarkkinoilla. Ajat olivat toiset, mutta tavoite kokolailla tuttu nyky-amigisteillekin: saada Amigaa levi&auml;m&auml;&auml;n laajemmalle. Ja ellei emoyhti&ouml;st&auml; ole siihen, niin tehd&auml;&auml;n homma sitten itse. AROSin tavoitteena oli korjata AmigaOS:n bugeja ja tuoda k&auml;ytt&ouml;j&auml;rjestelm&auml; 90-luvun tasolle. Tekij&ouml;in&auml; olivat ahkerat amigistit Internetiss&auml;, ja silloin idea kulki nimell&auml; AOS.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuten t&auml;llaisissa projekteissa yleens&auml;, ensimm&auml;iset kuukaudet k&auml;ytettiin kinasteluun siit&auml; mihin suuntaan projektia pit&auml;isi vied&auml;. Toinen halusi muistinsuojausta, toinen jotain muuta. Pari vuotta my&ouml;hemmin rivi&auml;k&auml;&auml;n koodia ei viel&auml; ollut kirjoitettu, ja pelkk&auml; speksauskin oli vaiheessa. Lopulta, vuoden 1995 talvella, kaveri nimelt&auml; Aaron Digulla tuskastui tilanteeseen ja ker&auml;si yhteen pohjalle tasaantuneet ajatukset siit&auml; mit&auml; AOSin v&auml;hint&auml;&auml;n tulisi olla.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ryhm&auml; tuli siihen tulokseen, ett&auml; v&auml;hint&auml;&auml;nkin pit&auml;isi luoda AmigaOS 3.1 -yhteensopiva k&auml;ytt&ouml;j&auml;rjestelm&auml; ja vasta sen j&auml;lkeen olisi syyt&auml; katsella eteenp&auml;in. AOS vaihtoi nimens&auml; AROSiin ja matkan varrella puhe Amiga Replacement OS:st&auml; on vaihtunut trendikk&auml;&auml;mp&auml;&auml;n Amiga Research OS:&auml;&auml;n. AROSin v&auml;lietappi on edelleen sama: AmigaOS 3.1 -yhtensopiva k&auml;ytt&ouml;j&auml;rjestelm&auml;. Kehityst&auml; on silti tapahtunut. 77% AmigaOS-funktioista on valmiina ja vain 15% t&auml;ysin avoimena.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AROS-tiimi on siis toiminto kerrallaan ohjelmoinut AmigaOS:n ohjelmia ja ohjelmointirajapintoja Commodoren ohjelmointidokumenttien pohjalta uudestaan. Tuloksena on kokolailla AmigaOS:n kanssa yhteensopiva k&auml;ytt&ouml;j&auml;rjestelm&auml;, jossa ei ole tippaakaan alkuper&auml;ist&auml; koodia ja jonka siten pit&auml;isi olla laillinen etenkin Euroopassa, jossa jenkkil&auml;n ohjelmistopatentit eiv&auml;t p&auml;de ja ohjelmistojen v&auml;lisen yhteensopivuuden tavoittelulle on lain suoja. Amiga Inc. on antanut ymm&auml;rt&auml;&auml;, ett&auml; niin kauan kuin AROS pysyy ilmaisena, he eiv&auml;t murise asiasta. Mukaan on tullut my&ouml;s joitain toimintoja, joita AmigaOS:ss&auml; ei ole, kuten erikoisen muotoiset ikkunat.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">My&ouml;s AROSin tavoite on hioutunut tarkemmaksi. T&auml;ll&auml; hetkell&auml; tavoite on nelijakoinen:</font></p>
							<ul>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">mahdollisimman yhteensopiva AmigaOS 3.1:n kanssa</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">voidaan portata eri suorittimille, esimerkiksi Intel x86, PowerPC, Alpha, Sparc, HPPA jne.</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">bin&auml;&auml;riyhteensopiva Amigalla ja l&auml;hdekoodiyhteensopiva muilla alustoilla</font>
								<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">toimii yksin&auml;&auml;n suoraan kiintolevylt&auml;, emulaationa toisen k&auml;ytt&ouml;j&auml;rjestelm&auml;n ikkunassa tai kirjastona, jonka avulla voi tehd&auml; natiivisovelluksia AmigaOS:n ohjelmointimenetelmin</font>
							</ul>
							<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kirjoitushetkell&auml; AROSin tekij&ouml;iden lista oli 178 nime&auml; pitk&auml;. Tiimi k&auml;ytt&auml;&auml; kehitysty&ouml;h&ouml;n Interneti&auml;, esimerkiksi <a href="http://www.sourceforge.net" target="_blank">Source Forgea</a>. Kuka tahansa on tervetullut ottamaan projektiin osaa ja AROSin l&auml;hdekoodi on saatavilla Mozillan lisenssi&auml; muistuttavalla avoimen l&auml;hdekoodin APL-lisenssill&auml;. AROSin l&auml;hdekoodia voi k&auml;ytt&auml;&auml; lisenssiehtojen mukaisesti my&ouml;s omissa projekteissaan, ja kuten ylh&auml;&auml;ll&auml; mainitsinkin, muutamat tahot ovat n&auml;in jo tehneet.</font></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Monenlaisia k&auml;ytt&ouml;tapoja</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuten uudempi AmigaOS:n korvaajakandidaatti MorphOS, my&ouml;s AROS tuntuu projektina melko nurinkuriselta. Jos Amiga-yhteis&ouml;, yritykset ja omistajat mukaan lukien, olisi vuosien saatossa ly&ouml;nyt p&auml;&auml;ns&auml; viisaammin yhteen, olisi kaikki n&auml;m&auml; energiat voitu suunnata yhden ja saman Amiga-ymp&auml;rist&ouml;n kehitt&auml;miseen. N&auml;in ei valitettavasti kuitenkaan ole k&auml;ynyt, ja niinp&auml; meill&auml; on t&auml;n&auml; p&auml;iv&auml;n&auml; kokolailla kolme Amiga-yhteensopivaa k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;: AmigaOS, AROS ja MorphOS (joka olisi ihan oman artikkelinsa arvoinen).<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;iden kilpakumppaneiden v&auml;lille on kuitenkin syntynyt mielenkiintoisia linkkej&auml;kin. Avoimen l&auml;hdekoodin periaatteita noudattava AROS on toiminut osana sek&auml; AmigaOS:n ett&auml; MorphOS:n kehitysty&ouml;t&auml;. AROSin tiimin mukaan Haage &amp; Partner k&auml;ytti AmigaOS 3.9:ss&auml; jostain syyst&auml; AROSin color wheel -k&auml;ytt&ouml;liittym&auml;elementti&auml;. MorphOS:n AmigaOS-emulaatio puolestaan viimeisteltiin AROSin l&auml;hdekoodeja hy&ouml;dynt&auml;en.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;in ollen pari odottamatonta k&auml;ytt&ouml;tarkoitusta AROSille on l&ouml;ytynyt jo kauan ennen sen valmistumista. AROSin on suunniteltu my&ouml;s nopeuttavan UAE-emulaattoria. UAE voisi korvata joitakin Amigan omia kirjastokutsuja ja -toimintoja AROSin natiivitoteutuksilla, mik&auml; nopeuttaisi emulaatiota.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">AROS toimii toki my&ouml;s omana k&auml;ytt&ouml;j&auml;rjestelm&auml;n&auml;&auml;n niin PC:ll&auml; kuin Amigallakin. T&auml;ll&auml; hetkell&auml; sit&auml; voi ajaa itsen&auml;isten toteutusten lis&auml;ksi sek&auml; PC:n ett&auml; Amigan Linuxilla ikkunassa ja PC:n FreeBSD:ll&auml;. AROSia on yritetty k&auml;&auml;nt&auml;&auml; my&ouml;s Sparcille ja PowerPC:lle, mutta toistaiseksi n&auml;ist&auml; projekteista ei ole tullut mit&auml;&auml;n - harrastelijapohjaisen ohjelmistokehityksen haittapuolena kun on tekij&ouml;iden mielenkiinnon ja aikataulujen ailahtelut. Vain 68k-pohjaiset toteutukset ovat t&auml;ll&auml; hetkell&auml; bin&auml;&auml;riyhteensopivia, muille ymp&auml;rist&ouml;ille ohjelmat pit&auml;&auml; k&auml;&auml;nt&auml;&auml; l&auml;hdekoodista uudelleen.</font></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">AROS testipenkkiin</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Periaatteellisella tasolla AROSista on lueskeltu jo vuosia, mutta itse olen toistaiseksi v&auml;lttynyt sen kokeilemiselta k&auml;yt&auml;nn&ouml;ss&auml;, vaikka versioita on kyll&auml; ollut saatavilla jo aikaisemminkin. L&auml;hdekoodit p&auml;ivittyv&auml;t jatkuvasti ja satunnaisesti k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; julkaistaan my&ouml;s valmiiksi k&auml;&auml;nnettyj&auml; bin&auml;&auml;riversioita meille laiskemmille yksil&ouml;ille. Hain Source Forgen <a href="http://www.sourceforge.net/projects/aros/" target="_blank">AROS-sivulta</a> Files-kohdasta tiedoston AROS-20020703-i386-pc-floppies.tar.gz, joka on levykejakelu AROSista PC:lle. Tarjolla on my&ouml;s muita versioita.<br>
								<br>
								TGZ-paketin sain purettua <a href="http://www.winzip.com" target="_blank">WinZipill&auml;</a> ja sis&auml;lt&auml; paljastui kolme IMG-tiedostoa, kukin kooltaan t&auml;sm&auml;lleen PC:n HD-levykkeen verran. N&auml;m&auml; siirret&auml;&auml;n levykkeille rawritell&auml; tai vastaavalla ohjelmalla. Itse k&auml;ytin <a href="http://uranus.it.swin.edu.au/~jn/linux/" target="_blank">RawWrite for Windows</a> -ohjelmaa. Prosessin p&auml;&auml;tteeksi minulla oli k&auml;dess&auml;ni yksi AROS-k&auml;ynnistyslevyke ja kaksi kontribuutiolevykett&auml;. Laitoin k&auml;ynnistyskorpun PC:n levykeasemaan, sammutin Windowsin ja k&auml;ynnistin koneen uudelleen.<br>
								<br>
								Testikoneina toimivat Hewlett-Packardin kannettava XE3-mikro 700 megahertsin Pentium III:lla ja 320 megatavulla muistia sek&auml; AMD K6-2 -pohjainen kloonimikro 333 MHz:lla ja 384:ll&auml; megatavulla muistia. Ensimm&auml;inen k&auml;ynnistysyritys AMD:ll&auml; ei ollut kovin lupaava. Heti k&auml;ynnistyksess&auml; kone ilmoitti lukuvirheest&auml;. Ongelmaksi osoittautui kuitenkin vain viallinen levyke, ja uuden yrityksen j&auml;lkeen homma l&auml;hti rullaamaan.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/aros1.jpg" alt="" height="138" width="200" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/aros2.jpg" alt="" height="138" width="200" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; AROS-versio koukkasi ensit&ouml;ikseen GURB-k&auml;ynnistysvalikon kautta, ja sen j&auml;lkeen ruudulle alkoi valua l&auml;hinn&auml; Linuxin k&auml;ynnistymist&auml; muistuttavaa informaatiota k&auml;ynnistysprosessista. L&auml;hinn&auml; Amiga Research OS -teksti ja tutut nimitykset tyyliin ExecBase muistuttavat Amigasta. T&auml;m&auml;n j&auml;lkeen kaikki on kuitenkin kovin tuttua. Tekstien kadottua ruudun vasempaan yl&auml;nurkkaan ilmestyy AmigaOS 3.1:st&auml; tuttu hiiren vakio-osoitin - low-res-karmeudessaan. Pian k&auml;ytt&auml;j&auml;&auml; tervehtii harmaa ruutu, jonka valkoisessa yl&auml;palkissa lukee &quot;Workbench Screen&quot;. Levykeversiossa ilmestyy pakatun tiedon purkamista ilmaiseva palkki ja purkuoperaation valmistuttua CLI.<br>
								<br>
								AROSille ei viel&auml; ole Workbenchin korviketta, joten ensituntumaa j&auml;rjestelm&auml;&auml;n t&auml;ytyy hakea komentorivikehotteen kautta. Onneksi se toimii aivan kuten Amigan vastaava, mit&auml; nyt muutamia eroavaisuuksia ilmenee k&auml;yt&ouml;ss&auml;. Windowsin turruttamalle mielelle ei heti ensimm&auml;isen&auml; juolahtanut ihmetell&auml;, kun CLI-ikkunan pystyi siirt&auml;m&auml;&auml;n osittain ulos ruudulta - t&auml;llaista ominaisuutta ei kuitenkaan AmigaOS:ss&auml; ennen uumoiltua 4.0-p&auml;ivityst&auml; ole ollut. Valikot toimivat MagicMenun tapaan eli aukeavat hiiren kohdalle. Demokansiosta l&ouml;ytyy my&ouml;s esimerkkiohjelma py&ouml;re&auml;st&auml; ikkunasta, mik&auml; kielt&auml;m&auml;tt&auml; n&auml;ytti melkoisen hassulta.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/aros7.jpg" alt="" height="105" width="200" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/aros3.jpg" alt="" height="105" width="200" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pikkueroista viis. T&auml;m&auml; n&auml;ytt&auml;&auml; ja tuntuu v&auml;h&auml;n liiankin paljon Amigalta.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">AROS k&auml;yt&auml;nn&ouml;ss&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ensikokemukset AROSista AMD:ll&auml; olivat vakuuttavia, joskin vakiokonfiguraation muistutus 640x480-tarkkuudesta 16 v&auml;rill&auml; ja 60 hertsill&auml; ei ollut suurinta mahdollista herkkua. Kaikki toimi kuitenkin eritt&auml;in jouhevasti, eik&auml; samaisella koneella Amiga Foreverin ja UAE:n yhdistelm&auml;ll&auml; tuttua tahmomista ilmennyt. Hiiri, teksti ja demo-ohjelmat liikkuivat sulavasti ruudulla, tosin n&auml;in alhaisella tarkkuudella ja v&auml;rim&auml;&auml;r&auml;ll&auml; ei muuta toki sovi odottaakaan. AROS kun ei ole emulaattori.<br>
								<br>
								Kontribuutiolevykkeelt&auml; l&ouml;ytyi joitakin Aminet-ohjelmia, mm. Backgammon vuodelta 1987 on k&auml;&auml;nnetty AROSille. Memspeed puolestaan ilmoitti muistin luku/kirjoitusnopeudeksi HP:lla 2133/2560 megatavua sekunnissa.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/aros6.jpg" alt="" height="150" width="200" border="1"></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">K&auml;yt&auml;nn&ouml;n vauhdissa merkitt&auml;v&auml;&auml; nopeuseroa ei AMD:n ja HP:n v&auml;lill&auml; ei ollut n&auml;ill&auml; ohjelmilla havaittavissa. Suurimman hitauden aiheutti AROSin lataaminen levykkeelt&auml;, mutta latausaikoja lukuun ottamatta kaikki toimi kutakuinkin v&auml;litt&ouml;m&auml;sti. AROSin voi toki asentaa kiintolevyllekin, itse asiassa sen mukana tulee versio HDToolBoxista, mutta t&auml;m&auml;n pikakokeen puitteissa en siihen ryhtynyt. K&auml;ytt&ouml;j&auml;rjestelm&auml; on saatavilla my&ouml;s cd-r-imagena niille jotka eiv&auml;t viitsi korppujen kanssa tapella.</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<img src="kuvat/aros4.jpg" alt="" height="105" width="200" border="1"></div>
									</td>
									<td valign="top"><img src="kuvat/aros5.jpg" alt="" height="105" width="200" border="1"></td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="4" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jos AROS kiinnostaa, l&auml;hett&auml;k&auml;&auml; ihmeess&auml; projektia koordinoivalle Aaron Digullalle terveisi&auml; osoitteeseen <a href="mailto:digulla@aros.org">digulla@aros.org</a>. Mies ei varmasti pist&auml; pahakseen my&ouml;sk&auml;&auml;n uusia kehittelij&ouml;it&auml;. :-) Lue my&ouml;s <a href="digulla.html" target="_self">Aaron Digullan haastattelu</a> toisaalta t&auml;st&auml; Sakusta!</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
								<tr>
									<td rowspan="2" valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/aros8.jpg" alt="" height="300" width="400" border="1"></font></div>
									</td>
									<td rowspan="2" valign="top" width="50%"></td>
								</tr>
								<tr>
									<td valign="top">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/aros9.jpg" alt="" height="286" width="400" border="1"></font></div>
									</td>
								</tr>
								<tr>
									<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
								</tr>
							</table>
						</div>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>