<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>LG Flatron 782LE</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Tuomo M&auml;mmel&auml; &lt;<a href="mailto:spam-it@nic.fi">spam-it@nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Uutta monitoria harkitseville ja putkin&auml;ytt&ouml;ihin kyll&auml;styneille on jo jonkin aikaa ollut tarjolla my&ouml;s ohuempi vaihtoehto. Viimeisen parin vuoden aikana tapahtunut hintakehityskin on ollut osaltaan auttamassa LCD-n&auml;ytt&ouml;jen esiinmarssia my&ouml;s kotik&auml;yt&ouml;ss&auml;. Kes&auml;ll&auml; p&auml;&auml;dyin itsekin moisen v&auml;rkin hankkimaan vajaat 4 vuotta vanhan putkin&auml;yt&ouml;n tilalle.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">LCD-tekniikkaa, lyhyt oppim&auml;&auml;r&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Lyhenne LCD tulee sanoista Liquid Crystal Display, joka on siis </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">suoraan suomennettuna nestekiden&auml;ytt&ouml;. LCD-n&auml;yt&ouml;t jakaantuvat viel&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">tekniikkansa puolesta passiivi- ja aktiivimatriisin&auml;ytt&ouml;ihin. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hitauden takia ei passiivimatriisin&auml;ytt&ouml;j&auml; juurikaan k&auml;ytet&auml; nykyisin tietokoneiden yleisn&auml;ytt&ouml;in&auml;, joissakin </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">erityissovelluksissa niill&auml;kin on viel&auml; oma jalansijansa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aktiivimatriisin&auml;ytt&ouml; tunnetaan my&ouml;s nimell&auml; TFT-n&auml;ytt&ouml; (Thin Film Transistor). Siin&auml; jokaisen n&auml;yt&ouml;n pikselin yhteydess&auml; siis on </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">periaatteessa pieni kondensaattori, jota pikselin virkistyksen yhteydess&auml; varataan halutulla j&auml;nnitteell&auml;. Kondensaattori ohjaa pient&auml; transistoria, joka puolestaan ohjaa itse nestekidett&auml;. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;in saadaan s&auml;&auml;delty&auml; nestekiteen tila, jolloin sen l&auml;pi p&auml;&auml;sev&auml;n </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">valon m&auml;&auml;r&auml; saadaan halutun suuruiseksi. Kondensaattorin varaus ei kuitenkaan riit&auml; ikuisesti, ja sen takia jokaista pikseli&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">(nestekidett&auml;) pit&auml;&auml; k&auml;yd&auml; tietyin v&auml;liajoin virkist&auml;m&auml;ss&auml; (siit&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">nimitys aktiivi). Kondensaattori on kuitenkin sen verran suuri ja nestekide itsess&auml;&auml;n sen verran hidas liikkeiss&auml;&auml;n, ett&auml; kuva pysyy </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">k&auml;yt&auml;nn&ouml;ss&auml; v&auml;lkkym&auml;tt&ouml;m&auml;n&auml;. LCD-paneeleille on yleens&auml; ilmoitettu </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">teknisiss&auml; tiedoissa vasteaika eli aika, joka kuluu </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">ennen kuin nestekide reagoi muuttuneeseen ohjaussignaaliin. 25 ms </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">vasteaika on jo melko nopea, melko yleinen puolestaan on 40 ms, joka </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">mahdollistaa k&auml;yt&auml;nn&ouml;ss&auml; 25 erilaisen kuvan esitt&auml;misen sekunnin aikana.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hyvin toteutettuna yhdell&auml; nestekiteell&auml; voidaan tuottaa 256 erilaista s&auml;vy&auml;. Jotta saataisiin aikaiseksi v&auml;rin&auml;ytt&ouml;, </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">nestekiteit&auml; pit&auml;&auml; kuitenkin olla yht&auml; varsinaista n&auml;yt&ouml;n pikseli&auml; kohden kolme, yksi jokaiselle osav&auml;rille (punainen, vihre&auml;, sininen). Kun n&auml;m&auml; sijoitetaan tarpeeksi l&auml;helle toisiaan, katsoja ei pysty niit&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">erikseen erottamaan, vaan n&auml;kee niiden yhdess&auml; m&auml;&auml;rittelem&auml;n v&auml;rin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Koska LCD-paneeli itsess&auml;&auml;n ei tuota valoa, siin&auml; t&auml;ytyy k&auml;ytt&auml;&auml; erillist&auml; valaistusta. Aika yleisesti valon tuottamiseen k&auml;ytet&auml;&auml;n CCFL-lamppuja (Cold Cathode Fluorescent Lamp). Yht&auml; n&auml;ytt&ouml;&auml; </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">kohden niit&auml; tarvitaan 2-6 kappaletta ja ne on sijoitettu </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">n&auml;yt&ouml;n reunoille ja/tai taakse. Jotta n&auml;ytt&ouml; olisi tasaisen </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">kirkas kauttaaltaan, valo hajautetaan erin&auml;isten suodattimien </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">kautta kattamaan koko n&auml;yt&ouml;n pinta-ala.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Yleist&auml; asiaa LCD-n&auml;yt&ouml;ist&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">L&auml;hinn&auml; kannettavien mikrojen n&auml;ytt&ouml;n&auml; tutuksi tullut LCD-paneelin&auml;ytt&ouml; kelpaa mainiosti my&ouml;s tavallisen kotimikron kaveriksi. Aikaisemmin LCD-n&auml;ytt&ouml;jen kompastuskiven&auml; ollut kapeahko katselukulma on my&ouml;s tuotekehityksen my&ouml;t&auml; laajentunut varsin merkitt&auml;v&auml;sti, eik&auml; normaalissa kotik&auml;yt&ouml;ss&auml; taida en&auml;&auml; juurikaan joutua monitoria k&auml;&auml;ntelem&auml;&auml;n. Tietysti jos tarkka v&auml;ritoisto on tarpeen, kuten kuvank&auml;sittelyss&auml;, monitoria joutuu k&auml;&auml;ntelem&auml;&auml;n muuttuvan istuma-asennon mukaan. Ellei k&auml;ytt&auml;j&auml; sitten omaa rautakankea selk&auml;rangan paikalla ja kivest&auml; tehty&auml; takapuolta, jotka eiv&auml;t pidemm&auml;st&auml;k&auml;&auml;n istumisesta v&auml;sy. ;-)<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Omassa k&auml;yt&ouml;ss&auml;ni en ole joutunut monitorin kulmaa k&auml;&auml;ntelem&auml;&auml;n istuma-asennon muuttuessa suositellusta selk&auml; suorana -asennosta suunnilleen p&ouml;yd&auml;n alle valuvaan, melkein makuuasentoon saakka taipuvaan. Kuvan kirkkaus kyll&auml; hieman muuttuu, mutta se muuttuu aika tasaisesti koko kuva-alan laajuudelta, eik&auml; siit&auml; n&auml;in ole ainakaan minulla h&auml;iri&ouml;ksi asti. Vaakasuunnassa liikuttaessa pysyy kuva viel&auml; melko hyv&auml;n&auml;, vaikka normaalin katselupaikan kummallekin puolelle asettuisi joku sit&auml; kuvaa katselemaan. Siit&auml; kauemmaskin ment&auml;ess&auml; kuva pysyy viel&auml; jonkin aikaa varsin hyv&auml;n&auml;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jokaisellahan on luonnollisesti omat mielipiteens&auml; pelaamiseen soveltuvasta n&auml;yt&ouml;st&auml;, mutta nykyisten aktiivimatriisin&auml;ytt&ouml;jen vasteaika on jo sen verran nopea, ett&auml; pelaaminenkin onnistuu. Toisaalta jos tietokoneen k&auml;ytt&ouml; rajoittuu pelk&auml;st&auml;&auml;n pelaamiseen, lienee syyt&auml; harkita tarkkaan, kannattaako kallista LCD-n&auml;ytt&ouml;&auml; hankkia, sen ter&auml;v&auml; ja v&auml;rin&auml;t&ouml;n kuva kun ei p&auml;&auml;se oikeuksiinsa nopeatempoisissa pelisessioissa. Lis&auml;ksi yhden 17&quot; LCD-n&auml;yt&ouml;n hinnalla taitaa saada jo kaksikin 21&quot; putkin&auml;ytt&ouml;&auml;...<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yleisesti LCD-n&auml;ytt&ouml;jen virrankulutus on vastaavankokoista putkin&auml;ytt&ouml;&auml; huomattavasti pienempi. T&auml;m&auml; n&auml;kyy k&auml;yt&ouml;ss&auml; sitten pienemp&auml;n&auml; l&auml;mm&ouml;ntuottona ja ahkerasti konettaan k&auml;ytt&auml;vill&auml; my&ouml;s pienemp&auml;n&auml; s&auml;hk&ouml;laskuna. :)</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/782le_1.jpg" alt="Kuva 1" height="381" width="400" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">LG 782LE omalta tuolilta katsottuna</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mainittakoon nyt t&auml;ss&auml; vaiheessa, ett&auml; vaikka kyseisest&auml; n&auml;yt&ouml;st&auml; l&ouml;ytyy my&ouml;s digitaalinen input-liit&auml;nt&auml;, en ole kokeillut sit&auml; ollenkaan, koska k&auml;yt&ouml;ss&auml;ni ei ole digitaaliliit&auml;nn&auml;ll&auml; varustettua n&auml;yt&ouml;nohjainta. Kaikki esitt&auml;m&auml;ni havainnot p&auml;tev&auml;t siis vain kun n&auml;yt&ouml;lle tuodaan analogista VGA-signaalia.<br>
							<br>
							Nykyinen n&auml;ytt&ouml;ni siis on LG Flatron 782LE -mallinimen omaava yksil&ouml;. Kokoa kuvalla on t&auml;ydet 17 tuumaa, maksimiresoluutio 1280*1024 pikseli&auml;. Virkistystaajuus kuvalle on maksimiresoluutiolla 75 Hz ja pienemmill&auml; tarkkuuksilla enimmill&auml;&auml;n 85 Hz. LCD-paneelin ominaisuuksista johtuen virkistystaajuudella ei ole k&auml;yt&auml;nn&ouml;ss&auml; liiemmin merkityst&auml;; suositeltava virkistystaajuus onkin kaikille tarkkuuksille 60 Hz. Alaraja menee 56 Hz:n kohdalla, joten esimerkiksi scandoublerin l&auml;pi ajettu Amigan PAL-tila ei n&auml;y (NTSC-tila kyll&auml; n&auml;kyy). Juovataajuus saa vaihdella rajoissa 30-80 kHz. My&ouml;skin kaikki lomitetut (interlaced) n&auml;ytt&ouml;tilat ovat poissa laskuista, niit&auml; t&auml;m&auml; n&auml;ytt&ouml; ei ymm&auml;rr&auml; ollenkaan.<br>
							<br>
							Toinen hankaluus tuli vastaan n&auml;ytt&ouml;tiloja s&auml;&auml;delt&auml;ess&auml;: monitori nimitt&auml;in osaa hakea analogisesta signaalista vain standardikokoiset resoluutiot. Esimerkiksi 1200*900 pikselin kokoista n&auml;ytt&ouml;tilaa en saanut tyydytt&auml;v&auml;ll&auml; tavalla n&auml;kym&auml;&auml;n, monitori kun halusi ymm&auml;rt&auml;&auml; tuon olevan 1152*900 pikselin kokoinen. Kyll&auml; tuo itse tehty tilakin n&auml;kyi, mutta 1200 pikselin informaatio oli puristettu 1152 pikselin kokoon ja kuvassa esiintyi s&auml;&auml;nn&ouml;llisin v&auml;lein h&auml;iri&ouml;raita. Enh&auml;n min&auml; muuten olisi t&auml;t&auml;k&auml;&auml;n huomannut, mutta kun k&auml;yt&ouml;ss&auml;ni olevasta PicassoIV-n&auml;ytt&ouml;kortista ei saa ulos 1280*1024 tarkkuudella 16-bittisill&auml; v&auml;reill&auml; kuin vain noin 46 Hz:n virkistystaajuuden... Yritin siis tehd&auml; sellaisen n&auml;ytt&ouml;tilan, jossa virkistystaajuus viel&auml; olisi monitorin ymm&auml;rt&auml;miss&auml; rajoissa, mutten saanut sit&auml; kelvollisesti n&auml;kym&auml;&auml;n. Siksip&auml; onkin sitten ollut tyytyminen &quot;vain&quot; 1152*864 resoluutioon, jolloin luonnollisesti osa monitorin kyvyist&auml; menee hukkaan.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">PicassoIV:n ohjelmoitavan flickerfixerin l&auml;pi ajettu PAL-tila ei ole laadultaan paras mahdollinen. Itsell&auml;ni ei kyseisen tilan v&auml;h&auml;isen k&auml;yt&ouml;n takia ole intressej&auml; kovin hirve&auml;sti s&auml;&auml;t&auml;miseen panostaa, mutta ehk&auml; sen saisi paremmaksikin tehty&auml;. T&auml;ss&auml;kin siis tulee ongelmaksi se, ettei monitori osaa tulkita kunnolla poikkeavan kokoisia n&auml;ytt&ouml;tiloja.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">S&auml;&auml;d&ouml;t ja asetukset</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Monitorin asetuksista l&ouml;ytyy my&ouml;s toiminto, jolla pienemm&auml;t resoluutiot voidaan venytt&auml;&auml; t&auml;ytt&auml;m&auml;&auml;n koko monitorin kuva-ala. Itse en kyseist&auml; toimintoa normaalik&auml;yt&ouml;ss&auml; k&auml;yt&auml;, se kun jossain m&auml;&auml;rin heikent&auml;&auml; kuvan laatua. Tokihan siit&auml; on hy&ouml;ty&auml; vaikkapa pelatessa, t&auml;ll&ouml;in saa suuren kuvan eik&auml; varsinkaan nopeammissa peleiss&auml; ehdi j&auml;&auml;d&auml; kummastelemaan kuvan lievi&auml; puutteellisuuksia. On my&ouml;s syyt&auml; huomata, ett&auml; t&auml;m&auml; venytystoiminto venytt&auml;&auml; esim. 640*480 resoluution kokoon 1280*1024 eik&auml; 1280*960, joten tietyill&auml; tarkkuuksilla odotettavissa on my&ouml;s liev&auml;&auml; kuvan mittasuhteiden muuttumista.<br>
							<br>
							Muuten monitorin s&auml;&auml;d&ouml;t ovat varsin niukat, perinteisiin putkin&auml;ytt&ouml;ihin verrattuna siis. Geometrias&auml;&auml;d&ouml;t puuttuvat kokonaan; ne eiv&auml;t yksinkertaisesti ole tarpeellisia johtuen LCD-paneelin rakenteesta. Viivat ovat suoria sek&auml; pysty- ett&auml; vaakasuunnassa, eik&auml; kuva kallistele mihink&auml;&auml;n suuntaan. Kaikkein helpoin tapa s&auml;&auml;t&auml;&auml; tietyn n&auml;ytt&ouml;tilan s&auml;&auml;d&ouml;t kohdalleen on k&auml;ytt&auml;&auml; monitorin etureunasta l&ouml;ytyv&auml;&auml; AUTO/SET-nappia s&auml;&auml;dett&auml;v&auml;n n&auml;ytt&ouml;tilan ollessa k&auml;yt&ouml;ss&auml;, jolloin n&auml;ytt&ouml; itse kaivelee signaalista tarvitsemansa tiedot. K&auml;ytt&auml;j&auml;n s&auml;&auml;dett&auml;v&auml;ksi j&auml;&auml; l&auml;hinn&auml; kirkkaus ja kontrasti, v&auml;ril&auml;mp&ouml;tila, kuvan paikka n&auml;yt&ouml;ll&auml; (t&auml;m&auml;kin tosin hoituu automaattis&auml;&auml;d&ouml;ll&auml;kin, mutta jos kuvan paikkaa haluaa jostakin syyst&auml; muuttaa) sek&auml; venytet&auml;&auml;nk&ouml; kuva koko ruudulle vai n&auml;ytet&auml;&auml;nk&ouml; 1:1-mittakaavassa ruudun keskell&auml;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuvaruutuvalikon kielen voi valita viidest&auml; eri kielest&auml;: mukana ovat englanti, saksa, ranska, espanja sek&auml; italia. Itse valikon paikan ruudulla voi valita my&ouml;s viidest&auml; vaihtoehdosta, tarjolla on kaikki nelj&auml; kulmaa sek&auml; paikka ruudun keskelt&auml;. Pienen&auml; yksityiskohtana kuvaruutuvalikosta l&ouml;ytyy my&ouml;s k&auml;ytt&ouml;tuntilaskuri.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/782le_2.jpg" alt="Kuva 2" height="422" width="400" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Liit&auml;nn&auml;t ja lisukkeet</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;yt&ouml;n takaa l&ouml;ytyy aika monipuoliset liit&auml;nn&auml;t. Kuvasignaalia voidaan n&auml;yt&ouml;lle sy&ouml;tt&auml;&auml; joko perinteisen 15-piikkisen VGA-liittimen kautta tai uudemman DVI-I-liit&auml;nn&auml;n kautta. Ensinmainittuun kelpaa siis vain perinteinen analoginen signaali, kun taas j&auml;lkimm&auml;inen nielee sovittimen avulla analogista signaalia sek&auml; my&ouml;skin digitaalista signaalia. (Lue my&ouml;s artikkeli &quot;<a href="../sekalaiset/dvi.html" target="_self">Mik&auml; ihmeen DVI?</a>&quot; toisaalta t&auml;st&auml; lehdest&auml;.) Monitoriin saa siis kiinni kaksi tietokonetta yht&auml;aikaa ja kuvanl&auml;hde valitaan varsin vaivattomasti n&auml;yt&ouml;n etureunassa olevalla SOURCE-napilla.<br>
							<br>
							Kuten kuvasta 2 n&auml;kyy, tulevat virtajohto sek&auml; signaalikaapelit kiinni v&auml;h&auml;n hankalasti itse n&auml;ytt&ouml;&ouml;n eik&auml; esimerkiksi jalustaan. Syy t&auml;h&auml;n on se, ett&auml; jalusta on irrotettavaa mallia, ja sen voi halutessaan korvata erikseen hankittavalla sein&auml;telineell&auml;. Mukana tulevassa jalustassa on lis&auml;n&auml; passiivinen USB-hubi, johon voi liitt&auml;&auml; kaksi v&auml;h&auml;n virtaa tarvitsevaa laitetta. Itse n&auml;yt&ouml;n asetuksia ei p&auml;&auml;se USB:n kautta muokkaamaan.<br>
							<br>
							Kuvasta 2 n&auml;kyy my&ouml;s VGA-DVI-adapteri, sinisen johdonp&auml;&auml;n ja monitorin v&auml;liss&auml;. Adapterissa ei ole sis&auml;ll&auml; mit&auml;&auml;n elektroniikkaa, sen tarkoitus on vain sovittaa kaksi erimallista liitint&auml; toisiinsa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;yt&ouml;n matkassa tuli ainoastaan melko pieni paperille painettu asennusohje. Mukana olleelta rompulta l&ouml;ytyi my&ouml;s laajempi k&auml;ytt&ouml;ohje ajureiden lis&auml;ksi. Pakkauksessa oli my&ouml;s virtajohto, VGA-kaapeli, DVI-D-kaapeli, USB-kaapeli sek&auml; VGA-DVI-adapteri.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">K&auml;ytt&auml;j&auml;n mielipide</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Nyt kun olen pari kuukautta t&auml;t&auml; n&auml;ytt&ouml;&auml; ehtinyt tuijotella, ei paluu takaisin putkin&auml;ytt&ouml;&ouml;n ole edes ajateltavissa. Minulla oli kes&auml;ll&auml; mahdollisuus tarkastella t&auml;t&auml; LCD-n&auml;ytt&ouml;&auml; aikaisemmin k&auml;yt&ouml;ss&auml; olleen putkin&auml;yt&ouml;n rinnalla (molemmissa sama kuva), ja jo pikavilkaisulla niiden n&auml;ki olevan aivan eri planeetalta. Ei siksi ett&auml; putkin&auml;ytt&ouml; olisi huono ollut, p&auml;invastoin - se oli ainakin ostohetkell&auml; luokkansa parhaimmistoa. Ero syntyi enemm&auml;nkin LCD-n&auml;yt&ouml;n rakenteesta johtuvan kuvan ter&auml;vyyden ansiosta. T&auml;ll&auml; hetkell&auml; tietokonemaailmassa LCD-n&auml;ytt&ouml; edustaa kuvanlaadun parhainta k&auml;rke&auml;.<br>
								<br>
								Fyysiselt&auml; puoleltaan LCD-n&auml;ytt&ouml; vaatii huomattavasti v&auml;hemm&auml;n p&ouml;yt&auml;tilaa kuin vastaavan kokoinen putkin&auml;ytt&ouml;. N&auml;inollen LCD-n&auml;ytt&ouml; on helpompi sisustuksen kannalta, ja eik&ouml;h&auml;n useimmilla ole k&auml;ytt&ouml;&auml; sen vapauttamalle p&ouml;yt&auml;tilallekin. Lis&auml;ksi n&auml;yt&ouml;n sijoittelumahdollisuuksia parantaa hieman my&ouml;s muutoin siro ulkoasu, se ei ole ruman m&ouml;hk&auml;leen n&auml;k&ouml;inen takaakaan p&auml;in katsottaessa.<br>
								<br>
								Kaiken kaikkiaan, jos hinta ei hirvit&auml;, niin LG 782LE on hyv&auml;t k&auml;ytt&ouml;ominaisuudet tarjoava LCD-n&auml;ytt&ouml; niin koti- kuin yritysk&auml;ytt&ouml;&ouml;nkin.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Valmistaja:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.lge.com" target="_blank">LG&nbsp;Electronics</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Malli:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><a href="http://www.lge.com/c_product/catalog/product_information.jsp?mdl_pfx=4CMFL%26mdl_cod=LB782F%26mdl_mak=1%26navigation=1,18,3" target="_blank"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">LG Flatron 782LE</font></a></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Myyj&auml;:&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.verkkokauppa.com" target="_blank">Verkkokauppa.com</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hinta:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">953 e (kes&auml;kuu 2002)</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Takuu:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">on-site-vaihtotakuu 3 vuotta</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Koko:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">17 tuumaa</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Paino:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">n. 7,3 kg</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Pikselin koko: </b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">0,264*0,264 mm</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Maksimitarkkuus:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">1280*1024 @ 75Hz</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Suositeltava&nbsp;tarkkuus:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">1280*1024 @ 60Hz</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Juovataajuus:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">30-80 kHz</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Kuvataajuus:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">56-85 Hz</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Liit&auml;nn&auml;t:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">15-pin VGA ja DVI-I</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Virrankulutus&nbsp;(max):</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">33 W</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Koko (l*s*k):</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">40*23,5*44,5 cm (jalustan kanssa)<br>
							40*7*34,5 cm (ilman jalustaa)</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hyv&auml;&auml;:</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuvanlaatu (ter&auml;vyys, geometria)</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pieni koko (fyysisesti)</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">V&auml;h&auml;inen l&auml;mm&ouml;ntuotto</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Huonoa:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Analogisella signaalilla ei suju kunnolla erikoisemman kokoisiin n&auml;ytt&ouml;tiloihin</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hinta</font>
						</ul>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>