<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mirage 4000 Pro - Laajennusvoimaa A4000:lle</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Joni Halme &lt;<a href="mailto:joni.halme@amigaone.cc">joni.halme@amigaone.cc</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Mirage Pro on Amiga 4000:lle jykev&auml; laajennustorni, jonka mukana tulee Elboxin ZorroIII/PCI-v&auml;yl&auml;kortti, Mediator PCI 4000 ja Mediator Multimedia CD. Hintaa paketilla on noin 600 euroa. PCI-kortteja l&ouml;ytyy melkein joka kaupasta ja Zorro-kortteja korvaamaan olin jo hankkinut Edimaxin 10/100-verkkokortin, Voodoo3 3000 -n&auml;yt&ouml;nohjaimen, SoundBlaster 128 -&auml;&auml;nikortin ja WinTV Go -TV-kortin. Zorro-korteista j&auml;i viel&auml; IOBlix k&auml;ytt&ouml;&ouml;n. Otin yhteytt&auml; Gentle Eyen Boogiehen, joka laittoi Miragen tilaukseen. Amiga-markkinoiden kire&auml;n tilanteen vuoksi torni piti maksaa etuk&auml;teen.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Pienet kuoret, suuri syd&auml;n</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/miragepro.jpg" alt="" height="371" width="200" align="left" border="1">Tornia sitten odoteltiin jopa pari kuukautta, mutta vihdoin k&auml;rsiv&auml;llisyys tuotti tulosta ja postiin tupsahti 8 kg:n paketti. Gentle Eyen mukaan Suomeen on tullut vain kaksi Miragea h&auml;nen kauttaan, joten harvinaista herkkua oli luvassa.<br>
									<br>
									Mirage on todella pieni Amigan torniksi: 425 mm syv&auml;, 210 mm leve&auml; ja 405 mm korkea. Kun pienin Amigani torni on ollut maxi-ATX, niin ei tahtonut uskoa Amigan mahtuvan Miragen sis&auml;lle edes kirveell&auml;. Torni on varustettu 300W virtal&auml;hteell&auml;, mink&auml; luulisi riitt&auml;v&auml;n. ZorroIII/PCI-v&auml;yl&auml;kortti korvaa Amigan oman tyt&auml;rlaudan ja sis&auml;lt&auml;&auml; viisi PCI-paikkaa, kuusi ZorroIII-paikkaa sek&auml; videoslotin. Minua yh&auml; huolestutti tilan puute ja olin varma, ett&auml; l&auml;mm&ouml;n kanssa tulee viel&auml; ongelmia. Tornin edess&auml; on paikka 80 mm x 80 mm tuulettimelle, joka ottaa ilmansa kotelon pohjan kautta, mutta se tuskin riitt&auml;&auml;.<br>
									<br>
									Mediator PCI 4000 on siis kortti, jolla PCI-paikat aktivoidaan. Mediatorista l&ouml;ytyy kolme jumpperia, jotka selitet&auml;&auml;n manuaalissa tarkemmin, mutta ne voi j&auml;tt&auml;&auml; oletusarvoihin, ellei ole asentamassa SharkPPC:t&auml;. Kortilla on valmiina uudet Mach-piirit, jotka normaalisti joudut ostamaan Mediator Multimedia CD:n mukana, ja itse CD:ll&auml; oli valmiina toiseksi uusimmat ajurit. Ennen asennusta kannattaa hakea asennusohje Elboxin sivuilta. Ohje on hyvin kuvitettu ja melko yksiselitteinen. Elboxin CD:ll&auml; ei tule Picassoa, joten tarvitset joko OS3.9:n CD:n tai k&auml;y imuroimassa uusin Picasso osoitteesta <a href="http://www.picasso96.home.pages.de" target="_blank">www.picasso96.home.pages.de</a>.<br>
									<br>
									Tornin kyljet avautuivat helposti. Mukana ei tullut kunnollisia asennusohjeita, vaan ainoastaan Mediatorille ohjekirja, jossa neuvottiin hakemaan asennusohjeet Elboxin kotisivuilta. Kotisivuilta l&ouml;ytyikin selke&auml;t ja hyvin kuvitetut ohjeet Miragen k&auml;ytt&ouml;&ouml;nottoon. En selvit&auml; asennusta sen enemp&auml;&auml;, sill&auml; se k&auml;y juuri niin helposti kuin Elboxin ohjeissa neuvotaan. Emolevyn ja v&auml;yl&auml;kortin asennus k&auml;vi helposti ja ne meniv&auml;t tukevasti kiinni.<br>
									<br>
									Tornin mukana tulee yllinkyllin tarvittavia ruuveja ja niit&auml; j&auml;&auml; reippaasti ylikin. Er&auml;s asia mik&auml; kannattaa tarkistaa asennusvaiheessa on kaksi ruuvia suoraan parallel- ja 15 kHz -liittimien alapuolella. Jos sinulla ei ole eristett&auml; emolevyn alla, ruuvit voivat aiheuttaa oikosulun. Pari prikkaa tai popniitit auttavat asiaa. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kovalevyt ja dvd-asema kannattaa asentaa torniin ennen emolevy&auml;. Muuten ruuvien laittaminen on l&auml;hes mahdotonta. Korppuaseman j&auml;tin aivan suosiolla pois, kun sit&auml; ei ole k&auml;ytt&auml;nyt sitten vuoden kaksi. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hiiren ja ilotikun liittimien jatkojohdot menev&auml;t n&auml;tisti emolevyn alta. PCI- ja Zorro-kortit menev&auml;t paikalleen ilman suurempaa voiman k&auml;ytt&ouml;&auml; ja osuvat takana oleviin korttipaikkojen reikiin kuin valettu.</font></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Softaa h&ouml;yl&auml;ten</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ohjelmiston asennus oli taas asia erikseen. Tappelin sen kanssa muutaman p&auml;iv&auml;n, ennen kuin kaikki toimi juuri kuten piti. Silloinkin p&auml;&auml;dyin asentamaan OS3.9:n uudestaan. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jos olet aiemmin k&auml;ytt&auml;nyt CyberGraphX:&auml;&auml;, se kannattaa poistaa ennen Picasson asennusta. Asenna tarvittavat PCI-ajurit Mediator-CD:ll&auml; olevalla installerilla. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml;n j&auml;lkeen asenna Picasso96. Asennuksessa pit&auml;&auml; seuraa tarkasti Elboxin antamia ohjeita (CD:graphics &amp; fast ethernet/voodoo4&amp;5Guide).<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Asennuksessa valitaan n&auml;yt&ouml;nohjaimeksi CVision64/3D. Asennuksen j&auml;lkeen valitaan update installation ja asennetaan vain Monitorsettings. Uudelleennime&auml; Devs:Monitors/ -kansiosta CVision3D ja CVision3D.info tiedostoiksi Voodoo ja Voodoo.info:ksi. Ikonin tooltypeist&auml; pit&auml;&auml; vaihtaa Boardtype=Voodoo. Tuplaklikkaa Voodoon ikonia ja sen j&auml;lkeen avaa Sys:Prefs/ -kansiosta Picasso96mode-ohjelma. Valitse Attach setting to Board0: Voodoo. Tallenna asetukset, ja nyt Voodoon pit&auml;isi toimia. N&auml;yt&ouml;nohjain kannattaa saada ensimm&auml;isen&auml; toimimaan, koska TV-, &auml;&auml;ni- ja 10/100-verkkokortit tarvitsevat osaa n&auml;yt&ouml;nohjaimen muistista.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mediatorin asetukset l&ouml;ytyv&auml;t Env:Mediator/ -kansiosta. Jos ei halua muokata Env-asetuksia k&auml;sin, netist&auml; on imuroitavissa Medication-niminen ohjelma t&auml;t&auml; varten. Asetukset voi minusta j&auml;tt&auml;&auml; oletusarvoihin, mutta jos Voodoon kanssa tulee ongelmia, kannattaa asetukset tarkistaa. Kannattaa heti rekister&ouml;ity&auml; Mediatorin k&auml;ytt&auml;j&auml;ksi, ett&auml; saat uusimmat ajurip&auml;ivitykset. T&auml;m&auml; k&auml;y l&auml;hett&auml;m&auml;ll&auml; s&auml;hk&ouml;postia osoitteeseen <a href="mailto:support@elbox.com">support@elbox.com</a>. Otsikoksi Subscribe MM CD ja viestiin oma nimi, s&auml;hk&ouml;postiosoite, Mediator Multimedia CD:n sarjanumero ja sen firman nimi, josta olet Miragen ostanut.</font></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">PCI-kortit syyniss&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuva n&auml;kyi Voodoon kautta ihan hyvin. N&auml;ytt&ouml;tiloja piti s&auml;&auml;t&auml;&auml; jonkin aikaa Picasso96mode-ohjelmalla. Mm. Interlacet pit&auml;&auml; ottaa pois yli 1024x768-tiloista. PiP l&auml;hti toimimaan, kun tajusin sen vaativan 16-bit PC-tilan. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aluksi Warp3D eiv&auml;t tahtonut toimia, mutta t&auml;m&auml; korjaantui Warp3D:n uudelleen asennuksella. Muista k&auml;ytt&auml;&auml; MM CD:n mukana tullutta versiota Warp3D:st&auml;! Nopeudessa eron huomaa parhaiten isoilla tarkkuuksilla. Siin&auml; miss&auml; CVisionPPC k&auml;ytti 640x480-tilaa, saatoin nyt k&auml;ytt&auml;&auml; jo kokoja 800x600 tai 1024x768. Esim. Heretic II on Voodoolla paljon kauniimpi katsella - johtunee jostain blending-rutiineista, jotka CVisionPPC:st&auml; puuttuivat.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Uudella verkkokortilla l&auml;hiverkko- ja ADSL-yhteys avautui ongelmitta. Sek&auml; Genesis ett&auml; Miami toimivat FastEthernet.devicen kanssa kuin se legendaarinen junan vessa. 100 Mbps -verkkokortissa on miinusta, ettei se toimi jos Voodookaan ei toimi. 10 Mbps kortit toimivat ilman Voodoota.<br>
								<br>
								<img src="kuvat/mixer.jpg" alt="" height="238" width="200" align="left" border="1"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&Auml;&auml;nikortti alustetaan samaan tapaan kuin Delfina. User-startupissa ajetaan Elboxin Mixer-ohjelma. Mixerist&auml; l&ouml;ytyy kaikki tarvittava &auml;&auml;nenvoimakkuuksien ja tasapainon s&auml;&auml;t&auml;miseen, mutta ohjelma on todella ep&auml;mukava k&auml;ytt&auml;&auml;. Korvaajaksi voi harkita esim. TaskiMixer-ohjelmaa. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&Auml;&auml;nikorttia k&auml;ytet&auml;&auml;n AHI:n kautta ja kortilta l&ouml;ytyy tutut 8/16 bit mono, stereo, stereo++ ja Hifi-tilat. Jokainen &auml;&auml;nitila l&ouml;ytyy kahteen kertaan, koska Sound Blasterissa on kaksi itsen&auml;ist&auml; stereo-DAC:ia. Jostain toistaiseksi tuntemattomasta syyst&auml; muut kuin stereo++ tilat toistavat vain vasemman stereokanavan. K&auml;sitt&auml;&auml;kseni olen ainoa, jolla t&auml;llaista esiintyy, mutta en ole viel&auml; ehtinyt perehtym&auml;&auml;n asiaan. Jos joku tiet&auml;&auml; mist&auml; tuo voi johtua, niin laittakaa s&auml;hk&ouml;postia.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Elboxin oma TV-ohjelmisto on v&auml;hint&auml;&auml;nkin ep&auml;mukava k&auml;ytt&auml;&auml;, enk&auml; vaivautunut edes kokeilemaan sit&auml;. Korvaavia ohjelmia on ilmestynyt jo paljon, mutta minusta hyv&auml; ohjelma on SuperTV, jolla voit helposti j&auml;rjestell&auml; TV-kanavat ja s&auml;&auml;t&auml;&auml; kuvan kirkkautta, kontrastia yms. Koska TV-kuva sy&ouml;tet&auml;&auml;n suoraan Voodoolle, ei TV:n katselu rasita prosessoria ollenkaan. Kuvaa voi skaalata miten haluaa tai katsella sit&auml; kokoruututilassa. Elboxin ohjelmalla TV-kuvaa voi katsoa my&ouml;s Workbenchin taustakuvana Colorkeyn avulla. Hieno ominaisuus, jos haluaa hieman esitell&auml; kavereille. ;)<br>
								<br>
								Jos omistat TV-modulaattorin, voit ottaa kuvan modulaattorin video outista TV-kortille, ja saat natiivitilat TV-kortin kautta WB:n n&auml;yt&ouml;lle. Muista vain laittaa Voodoon tooltypeist&auml; DisplayChain=NO. MM CD:ll&auml; on my&ouml;s TV-kortin ajuri VHI-studiolle. Pikaisessa testauksessa videokuvaa sai kaapattua melko helposti, mutta kun k&auml;yt&ouml;ss&auml; oli vain VHI-studion demoversio, en perehtynyt asiaan sen tarkemmin.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Viimeiset silaukset</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuten arvattua, pieni torni l&auml;mpenee helposti, koska ilmanvaihto on hankalampi toteuttaa. Mahdutin koneeseen kaksi IDE-kovalevy&auml;, 10 krpm UWSCSI-kovalevyn ja DVD-aseman. Kun viel&auml; Voodoo ja PPC tuottavat kiitett&auml;v&auml;sti l&auml;mp&ouml;&auml;, niin torni k&auml;y jo l&auml;mp&ouml;patterista. Pieni&auml; viimeistelyj&auml; siis tarvittiin.<br>
								<br>
								Lis&auml;sin tornin edess&auml; olevaan 80x80-paikkaan tuulettimen ja parantelin v&auml;h&auml;n ilmanottoa. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Koneen taakse virtal&auml;hteen alapuolelle lis&auml;sin my&ouml;s 80x80-tuulettimen, mik&auml; vaati jo hieman kuviosahaa. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Voodoon siiliin lis&auml;sin tuulettimen. Yhdess&auml; tuuletin ja siili viev&auml;t sen verran tilaa, ett&auml; jouduin j&auml;rjestelem&auml;&auml;n kortit uudestaan ja j&auml;tt&auml;m&auml;&auml;n yhden PCI-paikan Voodoon vierest&auml; tyhj&auml;ksi. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">PPC:n tuuletin oli jo luonnollisesti p&auml;ivitetty 12V-versioon. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Entisen tilaa viev&auml;n UWSCSI-kaapelin vaihdoin lyhyemp&auml;&auml;n kierrettyyn johtoon, samoin IDE-kaapelin. </font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Sellaisia ohjelmia varten, jotka eiv&auml;t tue AHIa, tinailin johdon, jolla saa audion emolevyn RC-liittimist&auml; Soundblasterin aux in -paikkaan.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Valmistaja:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.elbox.com/" target="_blank">Elbox Computer</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Edustaja:&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hinta:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">618 e (9/2002)</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hyv&auml;&auml;:</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Vaikka hintaa reippaasti, on se minusta kohtuullinen kun miettii mit&auml; sill&auml; saa.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Helppo asentaa. Emolevy ja v&auml;yl&auml;kortti menev&auml;t tukevasti paikalleen</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Itse torni on pieni ja tyylik&auml;s.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pci-laajennusten tuomat edut.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Huomattavasti enemm&auml;n laajennettavuutta vanhaan torniini verrattuna.</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Huonoa:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Torni on pieni ja tuulettimille on huonosti paikkoja.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Virtal&auml;hde ja 3.5&quot; paikat ovat huterat.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ohjelmiston asennus vie oman aikansa.</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jos aiemmin oli CVisionPPC, et en&auml;&auml; saa early startupia n&auml;yt&ouml;nohjaimen kautta.</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Linkkej&auml;:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.elbox.com/products/mirage_4000_pro.html" target="_blank">Tornin esittely</a> (Elbox)</font>
							<li><a href="http://www.elbox.com/manuals/mirage_4000_pro_folder/mirage_4000_pro_installation_guide_1.html" target="_blank"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuvitetut asennusohjeet</font></a>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://groups.yahoo.com/group/Amiga-Mediator/messages" target="_blank">Mediator-postituslista</a> (Yahoo)</font>
							<li><a href="http://www.picasso96.home.pages.de" target="_blank"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Picasso96:n kotisivu</font></a>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://vgr.com/mediator/" target="_blank">Mediator-tukisivusto</a> (VGR)</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.amiga-mediator.co.uk" target="_blank">Mediator-tukisivusto</a> (ep&auml;virallinen)</font>
						</ul>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>