<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Chroma Key: You Go Now</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Chroma Key: You Go Now</Font></center></h1></P>

<p>Nachdem Keyboarder Kevin Moore nach dem Dream Theater Opus &quot;Awake&quot; bei eben
jener Band seine Zelte strich, deb&#252;tierte er 1998 mit seinem Solowerk &quot;Dead
Air For Radios&quot;, welches zwar einen durchaus beachtlichen Erfolg vorweisen
konnte, aber auch alles andere als einfach zug&#228;nglich ist und mit Dream
Theater oder gar Metal nur noch sehr sekund&#228;r zu tun hatte - vielmehr
erinnerte &quot;Dead Air For Radios&quot; an Kevin Moore`s letzte Dream Theater
Komposition &quot;Space Dye Vest&quot;, die gleichzeitig den Abschluss des &quot;Awake&quot;
Albums markierte. Auf seinem neuen Album &quot;You Go Now&quot; geht er den
eingeschlagenen Weg konsequent weiter und bietet dem geneigten H&#246;rer ein
Rock Album mit einigen Pop Einfl&#252;ssen, welches zudem mit vielen Avantgarde
Einfl&#252;ssen aufwarten kann - f&#252;r Headbanger also wahrlich nicht das typische
musikalische Material. So ist es auch nicht weiter erstaunlich, da&#223; man sich
beim ersten Durchlauf der neuen CD auch mit dem Material recht schwer tut
und es sich zun&#228;chst einem nicht so recht er&#246;ffnen will. So sind Songs wie &quot;Get Back In The Car&quot; oder
&quot;Another Permanent Adress&quot; sowie mein pers&#246;nlicher Favorit &quot;When You Drive&quot;
zwar keineswegs schlecht, d&#252;rften aber eher etwas f&#252;r Genesis Fans des alten (!)
Materials interessant sein, wobei hier inbesondere die Peter Gabriel
Kompositionen bzw. dessen Solokarriere gemeint ist. Wer damit nichts am Hut
hat, der sollte &quot;You Go Now&quot; m&#246;glichst schnell vergessen. Auch Dream Theater
Fans w&#252;rde ich pers&#246;nlich &quot;You Go Now&quot; nicht blind empfehlen, da die
musikalische Ausrichtung durchweg eine ganz andere ist als beim
Traumtheater. Insofern kann ich &quot;You Go Now&quot; auch nur beinharten Progressive
Fans sowie Leuten, die schon das Debut Album mochten, an`s Herz legen - mir
ist das ganze etwas zu abgedreht, wobei dies absolut nichts mit der
gebotenen musikalischen Klasse zu tun hat - denn das Kevin Moore, der
&#252;brigens alle Instrumente mit Ausnahme der Gitarre auf diesem Werk selber
einspielte, einiges auf dem Kasten hat, d&#252;rfte durch die Bank hinweg bekannt
sein. Insgesamt also ein recht anspruchsvolles Werk, welches nur f&#252;r eine
kleine Basis der Metal Fans interessant sein d&#252;rfte.</P>

<p>Fazit: 6 von 10 Punkten</P><Center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
