<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Edguy: The Savage Poetry</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Edguy: The Savage Poetry</Font></center></h1></P>

<p>Im Jahre 1995, als die Metal Szene bei weitem nicht so lebendig war wie heute,
erschien das in Eigenregie aufgenommene Debutalbum &quot;The Savage Poetry&quot; der
damals noch v&#246;llig unbekannten Band Edguy. Richtig interessieren sollte es damals
allerdings niemanden, so da&#223; es eigentlich erstaunlich war, da&#223; die Band
sich nicht entmutigen lie&#223; und sich in den darauffolgenden Jahren mit ihren
,stark an fr&#252;he Helloween erinnernden, drei Alben &quot;Kingdom Of Madness&quot;, &quot;Vain Glory Opera&quot; und
&quot;Theater Of Salvation&quot; fest in der deutschen Metal Szene verankernten und
heute zumindets vom Namen her bekannt sind. Bedingt durch den Erfolg fragten
pl&#246;tzlich immer mehr Leute nach dem Debut &quot;The Savage Poetry&quot;, wovon die
Originalpressung mitlerweile nat&#252;rlich vergriffen war. Somit entschlossen
sich die Jungs aus Fuldar das eigentliche Debut nochmal neu einzuspielen und
das Resultat ist nun endlich erh&#228;ltlich, wobei der limitierten Erstauflage
auch das Original auf einer Bonus CD beiliegt. Allerdings &quot;gl&#228;nzt&quot; das
Original mit einem miesen Sound, schwachen Vocals und teilweise
unausgereiften Ideen - dies alles ist bei den neu eingespielten Versionen,
die fett aus den Boxen dr&#246;hnen und teilweise auch umarrangiert / ver&#228;ndert
wurden, nicht mehr der Fall. Zwar h&#246;rt man &quot;The Savage Poetry&quot; (alle
folgenden Comments beziehen sich immer auf die neu eingespielte Version)
deutlich an, da&#223; es nicht aus der selben Zeit wie &quot;Theater Of Salavation&quot;
stammt, aber das ist noch nichtmal negativ gemeint. So f&#228;llt das
eigentliche Debut deutlich h&#228;rter, erdiger und weniger bombastisch aus als
z.B. &quot;Theater Of Salvation&quot;, wobei man sich erwartungsgem&#228;&#223; auch st&#228;rker an
fr&#252;he Helloween anlehnt, was insbesondere bei Songs wie &quot;Power And Majesty&quot;
oder &quot;Key To My Fate&quot; (mein pers&#246;nliches Highlight der CD) deutlich wird.
Hervorhebenswert ist ansonsten noch der straighte Rocker &quot;Misguiding Your
Life&quot;, wohingegen die Ballade &quot;Sands Of Time&quot; sowie das &#252;berlange &quot;Eyes Of
The Tyrant&quot; kaum mit sp&#228;teren St&#252;cken wie &quot;Scarlet Rose&quot; bzw. &quot;Theater Of
Slavation&quot; mithalten kann. Hier merkt man die Entwicklung, die die Band im
Laufe der Jahre durchgemacht hat, ganz deutlich. Insgesamt ist Edguy auf
jeden Fall zu danken, da&#223; sie das Debutalbum nochmal ver&#246;ffentlicht haben,
denn f&#252;r Fans, an die sich dieses Rerelease richtet, ist das eine ganz tolle
Sache, wenn auch nicht jeder Song ein Volltreffer ist. Da zudem der
Erstauflage das Original zum gleichen Preis beiliegt, erh&#228;lt man durchaus
Gegenwert f&#252;r sein Geld. Fans sollten hier zugreifen - allen anderen sei
&quot;Theater Of Salvation&quot; oder &quot;Vain Glory Opera&quot; f&#252;r`s erste h&#246;ren empfohlen.</P>

<p>Fazit: 8 von 10 Punkten</P><center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P></Center>






</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
