<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P>
<ul>
<p><li>Das neue <b>Savatage</B> Werk &quot;Poets &amp; Madmen&quot; wurde mal wieder nach hinten
verschoben - und zwar auf den Januar des kommenden Jahres! Der Grund daf&#252;r ist
mal wieder das <b>Trans-Siberian Orchestra</B>, in das die Savatage Vordenker <b>Paul O`Neil</B> und
<b>Jon Olivia</B> entscheidend involviert sind, welches momentan an einem Soundtrack f&#252;r einen
Kinofilm arbeitet. Als Entsch&#228;digung soll es daf&#252;r die gr&#246;&#223;te Savatage Tour
aller Zeiten im n&#228;chsten Jahr geben...</LI></P>

<p><li> All jene, die am 9.7. kein Ticket f&#252;r das <b>Metal 2000</B> (mit Iron Maiden,
Slayer etc.) mehr bekommen haben, brauchen sich nicht mehr zu &#228;rgern:
Aufgrund einer Verletzung von <b>Iron Maiden</B> Gitarrist <b>Janick Gers</B> wurde dieser
Termin (sowie einige weitere) abgesagt. Warum allerdings die anderen Bands
nicht auftraten, ist nicht so ganz klar - vermutlich wurden zu wenig Tickets
verkauft.</LI></P>

<p><li> Ein wesentlich gr&#246;&#223;eres Desaster war das <b>9. Wave Gotik Treffen</B> in diesem
Jahr: Mitten im Festival haben sich die Veranstalter mit s&#228;mtlichem Geld aus
dem Staub gemach - wen wundert es da, da&#223; das Festival anschlie&#223;end im Chaos
untergegangen ist? Ein Gl&#252;ck, da&#223; es zu keinerlei Ausschreitungen kam...</LI></P>

<p><li> Bei <b>Overkill</B> ist Gitarrist <b>Joe Commeau</B> gefeuert worden, weil er u.a. noch
bei <b>Annihilator</B> und den reformierten <b>Liege Lord</B> mitl&#228;rmt. Den Overkill
Leuten war das einfach zuviel und somit tanzt Joe Commeau k&#252;nftig nur noch
auf zwei Hochzeiten - einen Ersatz hat man im Hause Overkill noch nicht
gefunden, wobei man aber plant, Live auf jeden Fall mit zwei Gitarristen
aufzutreten. Ach ja: Die neue Scheibe soll trotzdem im September erh&#228;ltlich
sein.</LI></P>

<p><li><b> Kiss</B> Fans in Europa hatten es nie so ganz leicht und auch auf der
Abschiedstournee wird Europa wieder einmal stiefm&#252;tterlich behandelt: So
verlautete es vor kurzem zwar aus dem Kiss Camp, da&#223; man eine Reihe weiterer
Gigs gebucht hat, diese allerdings in den Staaten stattfinden werden. Pech
gehabt...</LI></P>

<p><li> Der Ex-Helloween S&#228;nger <b>Michael Kiske</B> arbeitet momentan wieder an neuem
Material, das sich stilistisch vom letzten (meiner Meinung nach recht guten)
Album &quot;Readiness To Sacrifice&quot; abheben soll, wobei er aber gleichzeitig
ausschlie&#223;t, da&#223; das neue Material &quot;Keeper...&quot; tauglich sein wird. Na ja,
da&#223; muss nun auch nicht wirklich sein und sollte das neue Album das Niveau
von &quot;Readiness To Sacrifice&quot; halten, kann sich niemand beschweren. Und noch
eine gute Nachricht: Die beiden Soloalben von <b>Michael Kiske</B> werden in Europa
jetzt rereleast bzw. ver&#246;ffentlicht. Insbesondere auf &quot;Readiness To
Sacrifice&quot; d&#252;rften viele Fans gewartet haben, war es doch bis jetzt
auschlie&#223;lich in Japan erh&#228;ltlich.</LI></p>

<p><li> Der bekannte Label <b>SPV</B> ist momentan dabei, &#228;ltere CD`s bekannter Acts, die
bei Ihnen unter Vertrag stehen, zu rereleasen. Diese Rereleases werden in
einer (limitierten) Pappbox geliefert, in der sich zwei normale CD`s (an denen man
keinerlei Ver&#228;nderrungen im Vergleich zum Original vorgenommen hat) zum Preis
von 19.90 DM befinden; u.a. sind diese Boxen schon von <b>Axel Rudi Pell</B> und
<b>Eloy</B> erh&#228;ltich.</LI></P>

<p><li> Die Metallegende <b>Slayer</B> will, entgegen den bisherigen Pl&#228;nen, schon im
Herbst mit einem neuen Album die Metal Community erfreuen. Daf&#252;r wurde das
geplante Boxset, welches u.a.Homevideos und neueingespielte Versionen alter
St&#252;cke enthalten soll, auf Anfang 2001 verschoben.</LI></P>

<p><li> Ersten Infos zufolge soll die n&#228;chste <b>Paradise Lost</B> Scheibe &quot;Believe In
Nothing&quot; den sehr schwachen Vorg&#228;nger &quot;Host&quot;, der insbesondere unter
fehlender H&#228;rte gelitten hat, vergessen machen und wieder &quot;back to the
roots&quot; gehen. Mal abwarten...</LI></P>

<p><li><b> Angelcorpse</B> haben sich mitlerweile aufgel&#246;st - der letzte Gig wurde mit
<b>Krisun</B> Shouter <b>Alex Camargo</B> &#252;ber die B&#252;hne gebracht.</LI></P>

<p><li> Um <b>Crack Up</B> wurde in den letzten Monaten viel geredet: Erst verlief der
Deal mit Nuclear Blast f&#252;r beide Seiten nicht &#252;berm&#228;&#223;ig gut, dann spielten
die Jungs ein richtig gutes Album ein und nun ist Drummer und
Gr&#252;ndungsmitglied <b>Frank Schlinkert</B> nicht mehr im Line-up, da es offenbar
verschiedene Meinungen &#252;ber die Zukunft von Crack Up gab. Als Ersatz
pr&#228;sentierte die Band das bisher unbeschriebene Blatt <b>Andy Nohlen</B>.</LI></P>

<p><li> Im Hause <b>Eisregen</B>, die insbesondere durch ihre polarisierenden Lyrics
aufgefallen sind (um es mal wertfrei zu formulieren...), steht ein neues
Soloprojekt von Shouter <b>Michi Roth</B> an, welches unter dem Namen <b>Eisblut</B>
ver&#246;ffentlicht werden soll - das ganze soll noch extremer ausfallen als
Eisregen selber. Ob das &#252;berhaupt m&#246;glich bzw. sinnvoll ist?</LI></P></UL>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
