<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal",>
<title>Oldie Review:Heavens Gate`s Livin` In Hysteria</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="gray">Oldie Review: Heavens Gate`s Livin` In Hysteria</Font></center></h1></P>

<p>Heavens Gate geh&#246;ren zu den Bands, die zwar auch schon l&#228;nger dabei sind und
nicht erst seit den Erfolgen von HammerFall auf der Power Metal Welle
reiten, aber mit Ihren durchweg guten Releases (wobei die letzten beiden
Studioalben stilistisch etwas offener ausgefallen sind) niemals die gro&#223;e
Annerkennung gefunden haben, wie etwa Helloween, Gamma Ray oder Blind
Guardian, die eine &#228;hnliche Musik spielen wie auch Heavens Gate.</P>

<p>Mit &quot;Livin` In Hysteria&quot; haben Heavens Gate seinerzeit ihr zweites und
meiner Meinung nach auch bisher bestes Album vorgelegt, das Vergleiche mit
oben genannten Acts auf keinen Fall scheuen muss. So hat die Band mit
&quot;Livin` In Hysteria&quot;, &quot;We Got the Time&quot; und der Bandhymne &quot;Gate Of Heaven&quot;
drei erstklassige Speed Nummern am Start, die schon beim ersten Zuh&#246;ren im
Ohr stecken bleiben und zudem richtig gut rocken, wobei stilistische
&#196;hnlichkeiten zu den fr&#252;hen Helloween hier ganz besonders deutlich werden.
Dazu gibt`s mit &quot;The Neverending Fire&quot; sowie &quot;Can`t Stop Rockin`&quot; noch zwei
richtig gute Midtemponummern, ehe die Band mit &quot;Best Days Of My Life&quot; eine
der besten, aber leider auch recht unbekannten, Balladen im Metalbereich
&#252;berhaupt abliefert. Insbesondere hier kommt Thomas Rettke`s beeindruckende
Stimme voll zum Tragen, obwohl er auch all die anderen Nummern genial
vertont - f&#252;r mich z&#228;hlt er nach wie vor zu den besten deutschen Lead
S&#228;ngern &#252;berhaupt, auch wenn ich mit dieser Meinung wohl ziemlich alleine
darstehen werde. Nat&#252;rlich geht auch der Rest der Band absolut routiniert
zur Sache und h&#228;lt mit Sascha Paeth auch noch eine heute recht bekannte
Pers&#246;nlichkeit bereit, der heutzutage vielmehr durch seine Arbeit als
Producer von Rhapsody &amp; Angra als durch seine Gitarrenarbeit bei Heavens
Gate bekannt ist.</P>

<p>Bleibt unter dem Strich eine wirklich erstklassige CD einer erstklassigen
Band, die vielen heutzutage leider nicht bekannt ist, obwohl Heavens Gate
sicherlich einen besseren Status als unter &quot;ferner liefen&quot; verdient h&#228;tten,
&#252;brig. Ich kann jedem Fan des melodischen Power Metals, der Acts wie die
fr&#252;hen Helloween verg&#246;ttert, nur sagen, da&#223; er bei &quot;Livin` In Hysteria&quot;
blind zugreifen kann oder die CD zumindest mal probeh&#246;ren sollte - bereuen
wird es garantiert keiner!</P>

<p>Fazit: 10 von 10 Punkten</P><Center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
