<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Vorschau: Ali Baba</title>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<center><font size="6"><b>Ali Baba - Preview</b></font></center>
<br><br>
<font size="3">
Ali Baba und die 40 R&auml;ber - ein M&auml;rchen das in fast jedem Kinderzimmer schon
einmal erz&auml;hlt wurde. Jetzt soll diese uralte Geschichte auch f&uuml;r den Computer
erh&auml;ltich sein, genauer gesagt als ein Actiongame f&uuml;r unseren Amiga. Ziel des Spieles
ist es die Sch&auml;tze der R&auml;ber zu stehlen, die in mehreren H&ouml;hlen versteckt sind.
Um Einla&szlig; in die jeweiligen H&ouml;hlen zubekommen, mu&szlig; Ali Baba insegsamt 10 einzelne
goldene Lampen einsammeln die in den einzelnen Level immer wieder zu finden sind. Keine gerade neue
Idee, als Beispiel kann ich hier nennen das Spiel "Kid Chaos", bei dem man eine bestimmte Anzahl Blumen
zerschlagen mu&szlig;te, um ins n&auml;chste Level zu gelangen. Trotz dessen war ich gespannt auf ein
neues Spiel im Stile von dem legend&auml;ren &quot;Prince of Persia&quot;.
<br><br>
Nach dem Start des Demos erscheint lediglich ein Titelbild und nach einem kurzen Klick ist man
schon voll im Geschehen des Spieles. Nicht lange dauert es und die erste Feinde tauchen auf - nicht gerade
intelligent verhalten sie sich, es sieht eher so aus, als wenn sämtliche Feinde immer wieder den selben Ablauf
haben und kaum mal Angriffsunterschiede zu merken sind. Denn geht man nur 2-3 Screens weiter (wobei das Scrolling
relativ fl&uuml;ssig ist!) tauchen neue Feinde auf, die aber - wie gerade erw&auml;hnt - genau die selbe Angriffstaktik
anwenden, wie die Gegner aus den 2 Screen`s zuvor. Und schon sehr zeitig wird klar, das es sich bei Ali Baba nur um
ein Low Bugdet Game handeln wird. Grafik, Animation und auch der Sound mag bis jetzt noch nicht so
ganz gefallen. Die Animation von Ali Baba (der Spielfigur) sieht sehr starr aus und nur wenig Bewegungen sind herauszuholen.
An Wände kl&auml;ttern (wie in vergleichebaren Spielen) kann man in Ali Baba leider nicht und auch die Sprunganimationen
k&ouml;nnen weniger &uuml;berzeugen. Obwohl das Spiel nicht schwer ist und so manche Zeit an den Bildschirm fesseln kann,
so bestechen derzeit immernoch zuviele kleinen Mankos das Gesamtbild. Vielleicht wird noch das eine oder andere Detail
ge&auml;ndert und verbessert, es ist auf jedenfall w&uuml;nschenswert. Am besten Ihr testet Ali Baba selbst einmal an,
unten steht die dazugeh&ouml;hrige Internet Adresse.
<br><br>
<table width="95%" border="0" align="center">
 <tr>
  <td align="center">
   <img src="../pic/alibaba_1.jpg" border="0">
  </td>
  <td align="center">
   <img src="../pic/alibaba_2.jpg" border="0">
  </td>
 </tr>
</table>
<br><br>
Informationen und ein Demo zum Download gibt es bei: <a href="http://www.medici.org.uk">Medici - www.medici.org.uk</a>
<br>
</td>
</tr>
</table>

</BODY>
</HTML>
