<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Rubriken / Amiga Revolution</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=99%><tr><td align="center">
<img src="../pic/revolution.gif">
</td></tr>
<tr><td>
<P>Mitglieder der Abteilung: Prof.BSE und der Alte Lan (<a href="mailto:profBSE@yahoo.com">profBSE@yahoo.com</a>)</P>

<P>Unser hochgestochenes Ziel ist es, mit von uns in Erfahrung gebrachten 
Kuriosit&auml;ten betreffend den Microsoft-Konzern, die Welt aufzukl&auml;ren und jedem zu 
zeigen, was sich unser Freund Billy so alles leistet. Mit dieser Initiative 
haben wir uns vorgenommen, alle die ahnungslosen Windows-User da drau&szlig;en aus 
ihrer durch Unwissenheit hervorgerufenen Selbstgei&szlig;elung und unfreiwilliger 
Unterst&uuml;tzung eines skrupellosen, kundenverachtenden  und monopolistischen 
Konzerns zu befreien. Dazu werden wir einige dieser Kuriosit&auml;ten in einem 
Basis-Artikel ver&ouml;ffentlichen. Dieser Artikel wird Ausz&uuml;ge aus den verschiedenen 
uns zur Verf&uuml;gung stehenden Medien enthalten, nat&uuml;rlich mit Quellenangabe 
versehen. Wir bitten darum, diesen Artikel in der dazu vorgesehenen Einrichtung 
(z.zt EMail) zu erweitern, nat&uuml;rlich mit Quellenangabe, so dass wir eure 
Beitr&auml;ge auf den Wahrheitsgehalt pr&uuml;fen k&ouml;nnen. Wir werden nat&uuml;rlich die bei uns 
eingegangenen notfalls zensieren, falls es sich nur um &uuml;ble Nachrede handelt. 
Mit eurer Kooperation m&ouml;chten wir m&ouml;glichst alle dunklen Machenschaften des 
Microsoft-Konzerns der &Ouml;ffentlichkeit zur Verf&uuml;gung stellen. Wir freuen uns auch 
&uuml;ber E-Mails &uuml;ber das hier angeschnittene Thema.</P>

<P>Viel Spass beim Lesen!!!</P>

</td>
</tr>
</table>

</BODY>
</HTML>
