<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: DigiBooster Pro</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="6">
DIGIBOOSTER PROFESSIONAL - Die neue Generation?   
   </font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Der Amiga hat ja eine sehr weit zur&uuml;ckreichende Tracker Tradition. Das geht
bis in die 80er Jahre zur&uuml;ck, als ich noch einen A500 besa&szlig; und den ersten
Noisetracker zu Gesicht bekam. Allerdings konnte man mit dieser Version noch
nicht wirklich viel anfangen. Doch eines Tages fand ich auf einer CU Disk
eine Freeware Version vom Protracker, der bis heute noch in Verwendung ist
und sich gro&szlig;er Beliebtheit unter den 'Tracker Freaks' erfreut.
<br><br>
Ein gro&szlig;es Manko war damals f&uuml;r viele Tracker-Komponisten unter anderem aber
die Limitation auf nur 4 unabh&auml;ngige Stimmen. Daher gab es schon bald verschiedenste
sogenannte Protracker-Klone, wie den Stonetracker, Newtracker, Face the Music,
Art of Noise, StarTracker um nur ein paar zu nennen. Einige dieser Alternativen
boten sogar 8 'unabh&auml;ngige' Kan&auml;le an. Doch die ersten Schritte in eine
professionelle Richtung tat Octamed Soundstudio, welches mit einem &Uuml;berflu&szlig;
an Funktionen gesegnet war und daher auch gegenw&auml;rtig immer noch zu begeistern
wei&szlig;. Allerdings mu&szlig;te man als OctaMed User eine Menge an
'Protracker-Gewohnheit' ablegen, was manche davor zur&uuml;ckschrecken lie&szlig;.
<br><br>
<b>Erste Eindr&uuml;cke</b><br>
Die Freude war gro&szlig;, als dann vor nicht allzulanger Zeit eine professionelle
Version des schon bekannten DigiBooster Trackers angek&uuml;ndigt wurde. F&uuml;r mich
als Musiker und Protracker-Fan war der Kauf dieser neuen Version, namens
DigiBoosterPRO daher ein Mu&szlig;. Doch als ich das gute St&uuml;ck in den H&auml;nden hielt,
war ich ein wenig entt&auml;uscht. Die mit CD-H&uuml;lle getarnte Software entpuppte sich
als simple Diskette. F&uuml;r den Preis von ca. 100 DM hatte ich mir eigentlich eine
CD-ROM mit vielen Demo-Songs und dutzenden von Samples, unterteilt in Kategorien,
erwartet. Doch man erh&auml;lt leider blo&szlig; eine l&auml;ppische Diskette, die au&szlig;er einer
Anleitung und einer Installation nicht mehr enth&auml;lt. Schade.
<br><br>
<b>Die Installation</b><br>
Doch wenigstens verlief die Installation schnell und fehlerlos. Man w&auml;hlt ganz
einfach das Verzeichnis aus, in dem man DigiBoosterPRO installiert haben m&ouml;chte,
es wird ein Ordner erstellt und es kann sofort losgehen - ganz ohne l&auml;stige
Assigns oder umst&auml;ndliche Vor-Konfiguration.
<br><br>
<center><img src="../pic/digibooster_o1.jpg"><br><font size="2">Option Screen - Teil 1</font></center>
<br><br>
<b>Der zweite Eindruck</b><br>
Kaum hatte ich DigiBoosterPRO gestartet, war ich zuerst einmal sehr positiv
&uuml;berrascht. Die neue graphische Oberfl&auml;che sieht sehr ansprechend aus und
macht einen gereiften Eindruck ohne dabei auf ein Szene-Design zu verzichten.
Sehr angenehm ist auch, da&szlig; Graphikkarten unterst&uuml;tzt werden (wenn auch nur
durch Mode-Promotion Tools, wie NewMode oder ModePro). Sehr erfreulich und
mittlerweile ja auch schon ein Mu&szlig; ist auch die Integrierung von AHI. Somit
werden nicht nur Soundkarten, sondern auch mittels 14Bit Kalibrierung
der integrierte Soundchip (Paula) des Amigas gefordert.
Als n&auml;chstes f&auml;llt angenehm der Voreinsteller auf, in dem man zwischen
verschiedenen graphischen Oberfl&auml;chen w&auml;hlen und auch deren Paletten modifizieren
kann. Zus&auml;tzlich kann man dort MPEG Qualit&auml;t, Lautst&auml;rke, Geschwindigkeit,
Verzeichnis-Zuordnungen und die Anzahl der Stimmen (Channels) angeben. Diese
Anzahl ist auf 128 unabh&auml;ngige Kan&auml;le limitiert, was, meiner Ansicht nach
ausreichen sollte. Man mu&szlig; hier jedoch hinzuf&uuml;gen, da&szlig; man f&uuml;r viele Kan&auml;le
auch viel Rechenpower ben&ouml;tigt. Mit einem 40er Prozessor ohne Soundkarte sind
32 Kan&auml;le schon knapp an der Grenze. Aber ich mu&szlig; auch hinzuf&uuml;gen, da&szlig; ich mich
bis jetzt mit 16 Kan&auml;len selten eingeschr&auml;nkt gef&uuml;hlt habe.
<br><br>
<center><img src="../pic/digibooster_o2.jpg"><br><font size="2">Option Screen - Teil 2</font></center>
<br><br>
<b>Ins Detail gehend...</b><br>
Als n&auml;chstes f&auml;llt auf, da&szlig; die Tastaturk&uuml;rzel, die man schon vom Protracker
gewohnt war, dieselben geblieben sind. Dies erleichtert den Umgang mit dem
DigiBoosterPRO sehr, da gerade die Tastaturkombination bei weitem effektiver
und geschwinder als die Mausbedienung ist und daher den Flu&szlig; des Schaffensproze&szlig;
nicht hemmt. Doch die wirklichen herausragenden Features des DigiBoosterPRO
gegen&uuml;ber anderen Trackern sind, meiner Ansicht nach, die Belegung eines Samples
mit 2 verschiedenen Kommandos in Echtzeit. Wird ein Sample in einem Kanal an eine
bestimmte Stelle platziert, kann man diesen z.B. mit einem Lautst&auml;rken- und
Verzerrungskommando versehen. Die Kombinationsm&ouml;glichkeiten sind hierbei v&ouml;llig
uneingeschr&auml;nkt und werden gleichzeitig ausgef&uuml;hrt. Aber selbstverst&auml;ndlich
stellt DigiBoosterPRO auch einen SampleEditor zu Verf&uuml;gung, um die Samples einer
spezifischen Ver&auml;nderung zu unterziehen. Dort kann man nach Herzenslust
schneiden, st&uuml;ckeln, filtern, verzerren, einf&uuml;gen, die Abspielrichtung
ver&auml;ndern, die Lautst&auml;rke variieren, Loops definieren, Echos hinzuf&uuml;gen und
vieles mehr. In der Version 2.21 steht einem nun auch ein TB303 Emulator zu
Verf&uuml;gung, mit Hilfe dessen man sich die, f&uuml;r ihren eigenwilligen Sound
beliebten, 303 Basslines, die ihre Verbreitung vor allem im Techno Bereich
gefunden haben, selbst erstellen kann, um sie dann z.B. als Sample in das Module
einzubinden.
<br><br>
<b>MP2/3, MED oder doch lieber XM?</b><br>
Eines der erfreulichsten und wichtigsten Features ist die Kompatibilit&auml;t zu
anderen Tracker-Formaten. DigiBoosterPRO l&auml;dt ohne Probleme Oktalyzer, alle
OctaMed Formate (mmd), FastTracker I &amp; II (xm), Screamtracker (s3m) und
selbstverst&auml;ndlich auch das alte DigiBooster-Format. Au&szlig;erdem kann man ein
DigiBoosterPRO-Mod mit den gegeben Limitierung des jeweiligen Formates auch als
XM oder MOD exportieren. Zus&auml;tzlich ist es auch m&ouml;glich, MP2/3 Musikst&uuml;cke
einzulesen, um sie z.B. in ein Modul als Sample zu integrieren. Man darf dabei
jedoch nicht vergessen, die Start- und Endposition anzugeben. Das neue
DBPro-Format (DBM) scheint hier die wenigsten Einschr&auml;nkungen zu besitzen. Ein
Pattern kann so lang sein, wie man es gerne h&auml;tte, die Samplebank kann
unbegrenzt lang sein (je nach Gr&ouml;&szlig;e des Speichers), und die H&ouml;hen und Tiefen
eines Samples sind ebenfalls v&ouml;llig variabel.
<br><br>
<center><img src="../pic/digibooster_1.jpg"></center>
<br><br>
<b>Sonstige Optionen</b><br>
Ansonsten findet man im DigiBoosterPRO alle n&ouml;tigen Werkzeuge zur Bearbeitung
des Musikst&uuml;cks. Vom Transponieren, Umkehren eines Patterns/Tracks, Mixer bis zu Cut,
Copy &amp; Paste eines Tracks/Patterns/Instruments, ist hier alles vorhanden und
noch mehr.
<br><br>
<ul>Feature`s
 <li>Exportieren und Importieren von g&auml;ngigen Tracker-Formaten</li>
 <li>TB303 Emulator und Sample Editor</li>
 <li>DBM Format hat keine &uuml;blichen Einschr&auml;nkungen</li>
 <li>MP2/3 Unterst&uuml;tzung</li>
 <li>viele Echtzeit Effekte</li>
 <li>AHI</li>
 <li>Lauff&auml;hig auf Graphikkarten</li>
 <li>Auslieferung auf Diskette ohne Mods oder Samples</li>
 <li>Kein ansprechendes Mischpult</li>
 <li>Fehlende Midi Unterst&uuml;tzung</li>
</ul>
<br><br>
<table width="100%" border="0">
 <tr>
  <td align="left">
   <font size="4"><b>Fazit</b></font>
  </td>
  <td align="left">
   <font size="3">
   DigiBoosterPRO wird st&auml;ndig von den Autoren weiterentwickelt und noch
w&uuml;nschenswerte Funktionen, wie vordefinierte Effekte f&uuml;r Samples (Roboter-Sound,
diverse Raumkl&auml;nge etc) oder ein verbessertes Mischpult, werden sicher im Laufe
der Zeit noch hinzugef&uuml;gt werden. Da man gegen das Verschicken der
Orginaldiskette das neueste Update GRATIS erh&auml;lt, kann man nur jedem, der sich schon
immer einen Tracker im Sinne des alten Protracker, aber jedoch ohne dessen
l&auml;stigen Einschr&auml;nkungen gew&uuml;nscht hat, DigiBoosterPRO w&auml;rmstens empfehlen. (rk)
   </font>
  </td>
  <td align="center">
   <img src="../pic/award.gif">
  </td>
 </tr>
</table>
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
