<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: NcodeR</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="6">
   NcodeR - im Test
   </font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Ja kennt ihr das auch, ihr habt so viele CD&acute;s, aber habt keine Lust 
st&auml;ndig CD&acute;s zu wechseln oder ihr wollt einfach eure CD&acute;s 
auf der Festplatte haben?? 
Da gibt es die M&ouml;glichkeit die CD&acute;s auszulesen und als wave 
datei abzuspeichern, aber das schl&auml;gt gro&szlig;e l&ouml;cher in 
euere Fesplattenkapazit&auml;t, denn f&uuml;r eine Minute braucht man 
10MB also f&uuml;r eine 70min lange CD braucht man glatte 700MB! Das 
ist harter Tobak und f&uuml;r fast alle user eine un&uuml;berwindbare 
H&uuml;rde.
Aber es gibt abhilfe, das MP3-Format was nur mit ca. 1MB pro Minute zu 
Buche schl&auml;gt, aber wie bekommt man die besagten wave-Dateien in 
dieses Format??
Auf dem Amiga gibt es ein paar freeware tools (z.B. lame oder Ncode), 
die sich aber nicht besonders kopfortabel sind, da man sie &uuml;ber die 
Shell umst&auml;ndlich mit Atributen und Optionen bedienen mu&szlig;. Seit
kurzem gibt es noch einen MP3 encoder der mit einer Oberfl&auml;che gl&auml;nzt. 
Weniger h&uuml;bsch aber funktionell. Dieser  Encoder hei&szlig;t SecondSpin 
und liegt zur Zeit in der Version 2.0 vor, er benutzt die MPEGa library, 
aber leider habe ich ihn bei mir nie zum laufen bekommen. 
<br><br>
<center><img src="../pic/ncoder_1.jpg"></center>
<br><br>
Seit Herbst 99 gibt es aber auch einen komerziellen MP3 encoder, namens 
NcodeR, der auch mit einer sehr h&uuml;bschen Oberfl&auml;che gl&auml;nzt.
Diesen werden wir uns jetzt mal angucken!!
<br><br>
Lieferumfang
NcodeR wird auf einer Cd-Rom ausgeliefert, auf der das Hauptprogramm in 
68k, PowerUP und WarpUP Versionen vorliegt. Au&szlig;erdem befindet 
sich auf der CD noch AHI der Audiostandard auf dem Amiga, eine 
unregistrierte Version des Amplifiers V.152 (ein 68k MP2, MP3, 
wave, maud, raw und aiff Abspieler) und noch Demo-Versionen von 
BurnIT, ArtStudioPro, Evils Doom und Fantastic Dreams.
Um NcodeR erst einaml starten zu k&ouml;nnen braucht man einen 
020er OS3.0 und 4MB Ram. Hier soll gesagt sein, da&szlig; das nur 
die absoluten minimal Konfigurationen sind, denn um mit NcodeR 
ordentlich arbeiten zu k&ouml;nnen sollte es schon ein PPC sein.
Ein 68060 ist noch l&auml;ngst nicht ausreichend, bis auf man hat 
viel Zeit und will praktisch einen ganzen Tag auf Fertigstellung 
von einer CD warten.
<br><br>
<center><img src="../pic/ncoder_2.jpg"></center>
<br><br>
Nachdem man das gekl&auml;rt hat geht es an die Installation, die 
schnell und einfach vonstatten geht. NcodeR ist auch sofor einsatzbereit. 
Nach dem start erscheint das Programm, da&szlig; soweit in der Installation
eingestellt auch sehr ansprechend aussieht, da ein Skin &uuml;ber die 
Oberfl&auml;che gelegt wird, die meiner Meinung nach viel besser als 
die vom AmigaAMP aussehen. Die Oberfl&auml;che ist sehr &uuml;bersichtlich 
und gut bedienbar, also ist es auch nicht weiter schlimm, da&szlig; die 
Anleitung nur im Guide Format vorliegt. 
<br><br>
Auf LOS geht&acute;s LOS??
Erst mal mu&szlig; man mit BurnIT ein paar CD-Tracks auslesen, damit man 
die ins MP3-Format encodieren kann. Danach mu&szlig; man die ausgelesenen 
Sound Dateien in die Songliste bei NcodeR &uuml;bernehmen und nur noch auf 
start dr&uuml;cken und schwubs st&uuml;rzt der Rechner ab. Woran liegt das?? 
Nach ein bi&szlig;chen Rumprobiererei stellt sich heraus, da&szlig; dieses 
an OS 3.5 liegt, denn unter meiner OS 3.1 Partition encodiert NcodeR 
fr&ouml;hlich vor sich hin! Nach R&uuml;cksprache mit Titan stellt sich 
heraus, da&szlig; sie auch nicht genau wissen, wo das Problem her kommt. 
Es gibt zwar eine neue Version, bei der aber ebenfalls dasselbe passiert.
Nach Angaben von Titan soll man die Skins ausschalten und die info Datei 
in den Icon-Edit einladen die Meldungen ignorieren und abspeichern. Siehe 
da, es funktioniert und sogar bei der neuen Version viel viel schneller. 
Also das Problem w&auml;re dann auch vernichtet.
<br><br>
<table width="75%" cellspacing="0" cellpadding="0" border="0" align="center">
 <tr>
  <td align="left" bgcolor="#000080" colspan="4">
   <font size="3" color="#ffffff">
    <b>PPC 604e 200Mhz</b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="left" bgcolor="#ffffff">
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   <b><u>Liedzeit</u></b>
   </font>
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   <b><u>WarpUP</b></u>
   </font>
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   <b><u>PowerUP</u></b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   Version 1.5<br>
   Version 1.55
   </font>
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   3:43<br>
   3:46
   </font>
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   4:17<br>
   3:24
   </font>
  </td>
  <td align="center" bgcolor="#ffffff">
   <font size="3">
   3:20<br>
   ---
   </font>
  </td>
 </tr>
</table>
<br><br>
Die PowerU-Version wollte irgendwie nicht, aber das ist wahrscheinlich 
nur mein Fehler.
Man encodiert schneller als Echzeit und das hei&szlig;t schon was denn 
auf einem PC dauert es doch viel l&auml;nger! Ein AMD K6 350Mhz braucht 
f&uuml;r ein 3:06 min langes Lied immerhin 4:59!!! Also mal wieder &quot;only 
Amiga makes it possible&quot;!!!!!!!!!!!
<br><br>
<table width="100%" border="0">
 <tr>
  <td align="left">
   <font size="4"><b>Fazit</b></font>
  </td>
  <td align="left">
   <font size="3">
NcodeR ist ein sehr sehr guter MP3-Encoder der mittlerweile auch schon 
f&uuml;r 50DM zu haben ist. Damals hat hat es noch mit 69DM zu Buche 
geschlagen!! 50DM ist ein angemessener Preis, f&uuml;r diese Leistung. 
Was mich aber st&ouml;rt ist, das NcodeR die CD&acute;s nicht direkt 
auslesen kann, sondern daf&uuml;r BurnIT herhalten mu&szlig;. Das ist 
wiederum auch nicht so schlimm. 
Also mei Tip-&#062; kauft es euch! &quot;Empfehlenswert&quot; (ab)
   </font>
  </td>
  <td align="center">
   <img src="../pic/award.gif">
  </td>
 </tr>
</table>
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
