<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Scalos 1.2b</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <img src="../pic/scalos1.jpg">
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Scalos - der WB Ersatz ist nun Freeware erh&auml;ltlich. Grund genug ihn nochmals kurz vorzustellen (einen ausf&uuml;hrlichen Test zur damaligen
Shareware Version gab es in Ausgabe 2/98). Was ist Scalos? Nun im Grunde ist es fast mit DOpus Magellan II zu vergleichen, da man mit Scalos (wie auch mit
DOpus Magellan II) seine bisherige Workbench komplett aufarbeiten kann. Noch bis vor dem Erscheinen von AmigaOS 3.5 war Scalos eine n&uuml;tzliche Hilfe um
dem tristen Aussehen der WB 3.1 einen neuen Look zu verpassen. Doch mit OS3.5 wurde nicht nur vieles an den Systemdaten ge&auml;ndert, nein
auch das Design hatte man sich vorgenommen und verbessert. Das soll Scalos nicht &uuml;berfl&uuml;ssig machen, auf keinen Fall, jedoch sind
viele Features von Scalos nun schon im neuen OS Upgrade integriert worden. Um Euch einen besseren &Uuml;berblick zu verschaffen, habe ich nachfolgend
einmal einige Features von Scalos aufgef&uuml;hrt:
<br>
<ul>Scalos Feature`s
 <li>99.9% Workbenchersatz</li>
 <li>komplettes Multitasking, jedes Fenster hat seinen eigenen Task</li>
 <li>Piktogramm-Datatypes System mit NewIcon Unterst&uuml;tzung</li>
 <li>CybergraphX und 24bit Datatypes Unterst&uuml;tzung</li>
 <li>jedes Fenster kann sein eigenes Hintergrund-Pattern haben</li>
 <li>Automatisches Neuladen des Fensterinhalt</li>
 <li>frei einstellbare Men&uuml;s (mit ToolsDaemon und Parm Import)</li>
 <li>neues Palette und Pattern Einstellungsprogramm</li>
 <li>optimierte Patternroutine inclusive Scalierung</li>
 <li>konfigurierbare Popup-Men&uuml;s</li>
 <li>großes API und PlugIn System</li>
 <li>ect.</li>
</ul>
<br>Scalos ben&ouml;tigt einen Amiga mit 68020 Prozessor, Kickstart 3.0 oder h&ouml;her,
MUI 3.6 oder h&ouml;her und 4 MB Ram sollten auch vorhanden sein. Die Installation ist
unkompliziert und l&auml;ft bis auf einige Auswahloptionen selbst&auml;ndig ab. Nach der
Installtion kann man noch entscheiden, ob man Scalos als WB Ersatz starten lassen möchte oder
extra aufrufen will.<br>
Ist auch ein Neustart vollzogen, begr&uuml;&szlig; uns eine recht kahle Workbenchoberfl&auml;che
mit MagicWB Icons. Um das zu &auml;ndern wird auch gleich das Preferences Programm gestartet und
hier kann alles nach Herzenslust eingestellt werden. Ich sollte noch erw&auml;hnen das neben den
direkten Scalos Einstellungen auch noch 4 kleinere Pref-Tools beigef&uuml;gt wurden. Da w&auml;re
das "FileTypes"-Tools, in dem wie der Name schon verr&auml;t die FileTypes festgelegt werden k&ouml;nnen.
Im Tool "Scalos Menu" ist es m&ouml;glich sein eigenes Pull-Down-Men&ouml; zu erstellen, ganz im
Sinne von "MagicWBMen&uuml;". In "Scalos Palette" k&ouml;nnen einzelne Farben definiert werden,
was den gleichen Zweck erf&uulm;llt wie das "Palette" Tool des AmigaOS. Und zuguterletzt kommt
das Tool "Scalos Pattern" an die Reihe. Hier ist es dem User gestattet einzelne Hintergrundbilder
(Pattern) f&uuml;r Workbenchoberfl&auml;che, Fenster ect. festzulegen. Wir witmen uns nun nocheinmal den
allgemeinen Einstellungen von Scalos.
<br><br>
<center><img src="../pic/scalos2.jpg"></center>
<br><br>
Wer schon einmal im Aminet nachgeschaut hat, wird dort sicher auch die Sparte mit den
"wb/pix" finden, wo User ein Screenshot ihrer Workbench machen und diese dann ver&ouml;ffetlichen.
Und oftmals - so ging es mir zumindest - wundert man sich und &uuml;berlegt wie der ein oder andere
das mit seiner Workbench hinbekommen hat und welche Tool`s daf&uuml;r genutzt wurden. Und Scalos
ist mit Sicherheit eines davon, doch bevor die fantastische und vorallem benutzerfreundliche WB fertig
ist, bedarf es einiger Zeit. Und diese verbringt man in den Einstellungsmen&uuml;s:(
<br><br>
Was bietet uns Scalos alles an? Oh da gibt es vieles. Wem schon immer die Piktogrammeinstellungen mi&szlig;fielen,
der kann sich diese jetzt allein den eigenen W&uuml;nschen anpassen. Ob mit Rahmen, ohne Rahmen, ob Schrift mit Rahmen
oder keine Schrift, das bleibt jedem selbst &uuml;berlassen. Die Einstellung der "Bobs" ist eine interessante Sache, doch zum
Verst&auml;ndnis, "Bobs" bedeutet "BlitterOBjectS" und sie entstehen wenn ein Piktogramm bewegt wird. Das hat folgenden Sinn,
wenn ein Piktogramm bewegt wird, so kann der Piktogrammtext darunter trotzdem an der alten Stelle bleiben oder man l&auml;&szlig;t ihn
mitziehen. Weiterhin ist es m&ouml;glich durch eine Einstellung die Icons beim Ziehen nicht mehr flimmern zu lassen was ab und an
noch vorkommt.<br>
Die n&auml;chste Option stellt dem Nutzer frei, einen neuen Titel f&uuml;r den Bildschirm oder f&uuml;r die Fenster festzulegen.
Dabei k&ouml;nnen neben normalen Buchstaben aber auch Kommandocodes beigef&uuml;gt werden, die dann den freien, den benutzen und
den gesamten Speicher anzeigen oder die aktuelle Uhrzeit ect.. Viele Beispiele bzw. Kommandocodes sind bereits vorgegeben und brauchen
nur noch via Mausklick eingef&uuml;gt werden - eine leichte Sache. Nat&uuml;rlich ist es auch m&ouml;glich die Systemschrifts&auml;tze zu &auml;ndern,
wie auch die Festlegung bestimmter Pfade (z.B.: automatisches Diskcopy, Scalos als Heimpfad f&uuml;r alle Module und PlugIn`s).
<br><br>
<center><a href="../pic/scalos3.gif"><img src="../pic/scalos3.gif" width="300" height="200" border="0"></a><br><font size="2">Bitte auf das Bild dr&uuml;cken, f&uuml;r die komplette Gr&ouml;&szlig;e (640x480)</font></center>
<br><br>
<b>Fazit:</b> Scalos l&auml;&szlig;t kaum etwas offen, sehr viel ist machbar und wenn man sich die Zeit nimmt und einwenig t&uuml;fftelt - auch in
Zusammenarbeit mit anderen Tools - wird die eigene Workbench selbst die Windows-Screen in den Schatten stellen. Vor allem da Scalos nun Freeware ist,
sollte sich jeder diese Software downloaden und n&auml;her betrachten. Obwohl das AmigaOS 3.5 schon einige Features von Scalos beinhaltet (z.B.: die seperate
Einstellung der Patterns) ist es nochlange kein Grund solch ein gutes Produkt im Sande verschwinden zu lassen. Hier die Adresse zum Download: <a href="http://scalos.satanicdreams.com">www.scalos.satanicdreams.com</a>
(mn)
<br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
