<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Kl&auml;rende Worte von Fleecy Moss</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<center><font size="6">Kl&auml;rende Worte von Fleecy Moss</font></center><br>
<font size="3">
Auf meinem Streifzug durch die &Auml;u&szlig;erungen der Gemeinde
traf ich auf verschiedene falsche Auffassungen, Ger&uuml;chte und
eine Menge Verwirrung. Obgleich ich nicht darauf hoffen kann, alles
beantworten zu k&ouml;nnen, hier ein paar Dinge zur Klarstellung.
<BR><BR>
0. Amiga wird ein Universum digitalen Inhalts errichten. Digitalen
Inhalts bedeutet alles, was aus 0 und 1 gemacht wird - Applikationen
Video, Audio, Spiele, EMails, was auch immer. Wir werden uns auf zwei
M&auml;rkte konzentrieren, den Markt der Wegbereiter, f&uuml;r digitale
Abenteurer, Power-User, Spieler, Errichter von Inhalten, DTP-ler, K&uuml;nstler
Video-Leute und solche, die sich weigern, einen Computer als digitales Ger&auml;t
zu definieren. Unser zweiter Markt wird sich auf den Domestic Digital Habitat
(DDH - Famili&auml;rer Digitaler Lebensraum) konzentrieren.
<BR><BR>
1. Wenn Sie eine Personal-Computer-Person sind, dann wird es eine zweite Amiga-Welle
von Personal Computern geben.
<BR><BR>
2. Wir werden die Entwicklung des Classic-Amigas insofern unterst&uuml;tzen, dass wir
Usern und Entwicklern beim &Uuml;bergang zu einer neuen Maschine helfen wollen.
Dies wird der ganze Umfang unserer Unterst&uuml;tzung f&uuml;r die Classic-Maschine
sein. Wenn dies weitere Ver&ouml;ffentlichungen des AmigaOS beinhaltet, dann soll
es so sein.
<BR><BR>
3. Wir zielen auf x86 und PPC f&uuml;r die erste Ver&ouml;ffentlichung von
wegbereitenden Produkten f&uuml;r Kunden (wenn Sie eine Personal-Computer-Person
sind, dann sind Sie hier angesprochen).
<BR><BR>
4. Wir werden alles in unserer Macht stehende tun (das uns nicht pleite macht oder
sich nicht mit unseren grundlegenden Zielen &uuml;berschneidet), um sicherzustellen,
dass Classic-Amiga-Software auf den neuen Maschinen l&auml;uft, auf die
eine oder andere Weise. Die neue Produktfamilie Amiga (ehemals AQUA genannt) wird
nativ und auch aufgesetzt laufen. Dies um schnell einen gro&szlig;en Markt zu
schaffen, von dem Amiga-Entwickler pofitieren sollen. F&uuml;r die erste Reihe von
Wegbereitern wird sie aufgesetzt laufen, um diesen Markt schnell wachsen zu sehen.
Eine unserer gundlegenden Pflichten sehen wir im Dienst am Entwickler.
<BR><BR>
6. Wir sprechen mit dem Phoenix Consortium &uuml;ber gemeinsame Interessen.
<BR><BR>
7. QNX hat mit uns Kontakt aufgenommen, aber zur Zeit planen wir nicht mit ihnen
zusammenzuarbeiten.
<BR><BR>
8.Wir werden Amiga-Produkte f&uuml;r einen weiteren Markt entwickeln, den Domestic
Digital Habitat Markt (DDH - Markt des Famili&auml;ren Digigtalen Lebensraumes).
Dieser Markt wird separat gehalten werden, aber die Produkte werden zusammenarbeiten,
wenn der Installierende dies w&uuml;nscht.
<BR><BR>
9. Es wird eine neue Webseite geben, die in K&uuml;rze ver&ouml;ffentlicht wird.
Diese wurde auf allen Browsern getestet, Amiga und nicht-Amiga und bei den gegebenen
Kompatiblit&auml;tsproblemen zwischen den Implementationen offener Standards,
gaben wir uns die gr&ouml;&szlig;te M&uuml;he. Diese Seite wird schnell wachsen
und mehr Informationen werden hinzugef&uuml;gt werden. Wir m&ouml;chten zu einem
Dorf werden, wo alle Amigianer ihre Meinungen zum Ausdruck bringen, Chatten und zu
den verschiedenen Teilen des Amiga-Universums reisen k&ouml;nnen.
<BR><BR>
a. Ein Manager f&uuml;r die Unterst&uuml;tzung der Entwickler wurde ausgew&auml;hlt
und man arbeitet an der Implementierung eines Unterst&uuml;tzungsprogramms f&uuml;r
Entwickler. Dies wird fertig sein, bevor die Entwicklerger&auml;te herauskommen
werden.
<BR><BR>
b. Die Entwicklerboxen sind spezifiziert, wird haben mit verschiedenen Herstellern
von Whiteboxen Kontakt aufgenommen und bauen den Vertrieb auf.
<BR><BR>
c. Amiga wird keine Zeitangaben machen, bis wir ein Produkt haben. Wir werden
Zeitabl&auml;ufe mit Ihnen teilen, jedoch kein Datum hinzuf&uuml;gen. Es hat bereits
gen&uuml;gend Schaden gegeben.
<BR><BR>
d. Wir bekamen die Akzeptanz von 75% unseres Entwicklerteams und deren Namen und
Stellung werden bekannt gegeben, sobald wir von der Schulung zur&uuml;ck sind
(vor Ende des Monats).
<BR><BR> 
Diese Mail darf ohne &Auml;nderung innerhalb der Gemeinde ver&ouml;ffentlicht werden.
Sollten weitere Fragen und Punkte auftauchen, werden wir versuchen,
diese zu beantworten.
<br><br>
&Uuml;bersetzung: <a href="http://www.amiga-news.de">www.amiga-news.de</a>
<br>
</td>
</tr>
</table>

</BODY>
</HTML>
