<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spieleteil / Testbericht: WipeOut 2097</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<table width=99% align="center"><tr><td>
<center><img src="../pic/wipeout_1.jpg" border="0"></center>
<br><br>
<font size="3">
Es ist mal wieder ein langer Wintertag, der Schnee liegt auf den B&auml;umen und mein sch&ouml;ner 604er-200mhz PPC langweilt sich mal wieder zu Tode, bis aufeinmal das gelbe Postauto ein sch&ouml;nes P&auml;ckchen vorbei bringt. Na was ist denn da wohl drin?? Ahhhh, endlich ist es da; Wipeout!
d.h. vielleicht werden die kalten Monate doch nicht so kalt (zumindest f&uuml;r den gelangweilten PPC)!
Wipeout, woher kennen wir den Namen nochmal?? Ach ja von der grauen alten Playstation, sowie von den doch oft (zurecht) so verhassten Winshit PC. 
Nach langer Durststrecke ist es das ERSTE komerzielle PPC-Spiel, das der Harware auch mal was abverlangen soll! Na dann, prost mahlzeit; schauen wir mal ob sich der kauf auch wirklich gelohnt hat!
Die CD kommt in einem Jewel-Case zu euch nach Hause, da&szlig; zwar ganz h&uuml;bsch aussieht aber nicht an das Design von Napalm&acute;s Jewel-Case rankommt. Die Anleitung liegt leider nur im AmigaGuide Format vor. Eine PDF oder HTML Anleitung w&auml;re vielleicht sinniger gewesen. Vom Inhalt her ist sie auch etwas d&uuml;nn, da eigentlich nur die Einstellungen und evtuelle Probleml&ouml;sungen beschrieben werden, obwohl wof&uuml;r braucht man eigentlich bei einem Rennspiel eine Anleitung! Was wirklich fehlt ist eine Erl&auml;uterung der Waffen, da die Waffenabsch&uuml;sse zu Beginn des Spiel eher wahrlos als strategisch geplant abgeschossen werden.
<br><br>
<b>Aber jetzt zur Installation<br></b>
<ul>Man kann:
<li>eine kleine (nur executeables - 1mb)</li>
<li>eine mittlere (alles bis auf MPEG Videos - 42mb)</li>
<li>und eine gro&szlig;e Installation (alles, auch die MPEG&acute;s - 70mb) durchf&uuml;hren.</li>
</ul>
Es ist empfehlenswert die WarpUP, sowie auch die Warp3D Version, die sich auf der CD befinden zu installieren!
<br><br>
WICHTIG:
Bevor man die WarpUP Installation der CD durchf&uuml;hrt, falls vorhanden die alte WarpUP Version KOMPLETT vom System entfernen (PowerPC.library &amp; ENVARC:PowerPC), sonst kommt beim Start von Wipeout eine Fehlermeldung.
<br><br>
<center><img src="../pic/wipeout_2.jpg" border="0"></center>
<br><br>
<b>Der Start ins neue Jahrtausend<br></b>
Nachdem die Installation beendet ist kann man sich endlich an das Spiel heranwagen. Mit einem Doppelklick auf das Icon &ouml;ffnet das Programm erstmal die Einstellungen (siehe Screeshot 1), wo grundlegende Sachen, wie Aufl&ouml;sung, Texture Memory und andere Sachen festgelegt werden k&ouml;nnen.
Noch ein dr&uuml;cker auf den Play Knopf und das Spiel startet!
Nachdem man die Logos von Digital Images und Psygnosis bewundert hat gelangt man in das Hauptmen&uuml;, oder zum Anfangsvideo, soweit man es angestellt hat (mehr dazu siehe Fazit). Im Hauptmenu k&ouml;nnt ihr Raumgleiter, Strecke und den Spielmodi ausw&auml;hlen. In den Optionen kann man Laden/Speichern Waffen an/ausstellen das Keyboard oder auch das Joypad konfigurieren (das CD32 oder auch Honey-Bee Pad wir optimal unterst&uuml;tzt)
<br><br>
<b>Auf in den Kampf <br></b>
Nachdem Ihr alles fesgelegt habt geht es auf die Rennstrecke. Dort k&ouml;nnt Ihr dann zum ersten mal die wirklich tolle Grafik bewundern. Das Rennen beginnt und Ihr k&auml;mpft gegen 11 Mitstreiter um den Sieg. Wenn das bei &quot;easy&quot; noch ganz locker geht wir der Schwierigkeitsgrad bei &quot;tricky&quot; schon etwas heftiger und bei &quot;hard&quot; dann richtig haarig. Wenn man alle Strecken bew&auml;ltigt habt k&ouml;mmt Ihr in verschiedene andere Cups. 
Wie schon oben gesagt sieht die Grafik einfach toll aus und ist meiner Meinung nach noch immer mit jetzigen PC-Spielen konkurierbar. Was mich bei diesem Punkt aber st&ouml;rt ist, da&szlig; der Rauch, sowie auch die Explosionen extrem billig aussehen, da sie nur 2D gehalten sind und so sehr flach aussehen.
Zum Sound ist zu sagen, wie schon bei der PC oder PSX Version nicht&acute;s besonderes; ein mehr oder weniger monotones D&uuml;senger&auml;usch, ein paar Waffenger&auml;usche und noch ein paar andere SFX. Dagegen sind die CD-Tracks recht gut und passen zum Spielablauf.
<br><br>
Das Spiel l&auml;uft auf allen PPC-Rechnern mit einer 3D-Karte (CyberVisionPPC, BlizzardVisionPPC)
in einem sehr angenehmen Tempo (ca. 25 fps, bei einer Aufl&ouml;sung von 640x480).
<br><br>
<center><img src="../pic/wipeout_3.jpg" border="0"></center>
<br><br>
<b>Fazit: <br></b>
Wipeout 2097 ist ein Superspiel und ist auf jeden Fall einen Kauf wert, also sofort bestellen!!!!
Zum ersten mal Zeigt jmd. was auf einem PPC Amiga wirklich m&ouml;glich ist.
Wenn man sich ein bi&szlig;chen mit der Steuerung auseinandergesetzt hat macht das Spiel richtig viel Wipeout macht total viel Spa&szlig;, man kann schon vom SUCHTFAKTOR reden, wenn man die Strecke schon zum 20. mal anf&auml;ngt und immer noch motiviert ist!
Trotzdem habe ich aber noch einige Kritikpunkte, wie z.B. die schlecht in Szene gesetzte Anleitung, also optisch h&auml;tte man diese durchaus auch sch&ouml;ner gestalten k&ouml;nnen, sowie w&auml;ren auch  Waffenerkl&auml;rungen nicht schlecht gewesen. Die etwas langweiligen Sounds h&auml;tten durchaus eine erweiterung oder verbesserung verdient gehabt, aber auch die mpeg Animationen werden nur in einer sehr schlechte Qualit&auml;t abgespielt (zur Not kann man sich die mpeg&acute;s ja auch mit einem mpeg-Player angucken) und den &quot;flachen&quot; Rauch habe ich ja schon angesprochen.
&Uuml;ber diese Mankos w&uuml;rde ich ja hinweggucken, wenn es eine Netzwerkunterst&uuml;tzung g&auml;be, aber ich hoffe Digital Images wird diese noch implementieren wird, denn Wipeout Im Netzwerk mit 11 Freunden, wer h&auml;tte das nicht gerne! (ab)
<br><br>
<table width="100%" border="0">
 <tr>
  <td align="center">
<table width="70%" cellspacing="0" cellpadding="0" border="0" align="center">
 <tr>
  <td colspan="3" bgcolor="#cccccc">
   <table width="100%" border="0">
    <tr>
     <td colspan="3" bgcolor="#ffffff">
      <table width="100%" border="0">
       <tr>
  <td align="left">
   <font size="2">
    <b>Grafik</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/90.gif" border="0">
  </td>
  <td align="center">
   <font size="2">
    <b>90 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="2">
    <b>Gameplay</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="2">
    <b>86 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="2">
    <b>Sound</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="2">
    <b>85 %</b>
   </font>
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="2">
    <b>Motivation</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/95.gif" border="0">
  </td>
  <td align="center">
   <font size="2">
    <b>95 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td colspan="3">
  </td>
 </tr>
 </tr>
  <td align="left">
   <font size="2">
    <b>Gesamt</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="2">
    <b>87 %</b>
   </font>
  </td>
 </tr>
</table>
 </td>
  </tr>
   </table>
    </td>
     </tr>
      </table>
     </td>
     <td align="center">
      <img src="../pic/award.gif">
     </td>
    </tr>
   </table>
<br><br>
Anforderungen:<br>
Amiga mit PPC, 3D-Karte (CVPPC, BVPPC, CV3D und vielleicht irgendwann mal Paraglide), 24 mb fasr-Ram, CD-Rom, WarpUP V4 und Warp3D V2
<br><br>
Empfohlen:<br>
mehr Ram<br>
</td>
</tr>
</table>

</BODY>
</HTML>
