<HTML>
<HEAD>
<TITLE>onEscapee</TITLE>
<!--Sieht am besten mit IBrowse 1.12 aus!!!-->
</HEAD>
<BODY bgcolor=black background="gt_onbackground.jpg" text=white link=red alink=white>
<TABLE BORDER=0 >
<TR align=left><TD width=132 rowspan=100></TD><TD>
<CENTER><IMG SRC="gt_onlogo.gif" BORDER=0 width=400 height=87></CENTER>
Dieses Klasse Spiel ist ja nun vor ein par Monaten erschienen, und nachdem
Ich es beinahe durchgespielt habe m&ouml;chte Ich euch nun meine Eindr&uuml;cke schildern.</TD><TD width=200><IMG SRC="gt_oninvlogo.gif" BORDER=0 ALT="Invictus Team" width=200 height=146>  </TD></TR><TR><TD > <BR><CENTER><IMG SRC="gt_onredline.gif" width=274 height=7 border=0><BR>     
Das Spiel ist bereits f&uuml;r schlappe 70,- DM erh&auml;ltlich, und bereits nach
dem Einschalten wei&szlig; man, da&szlig; es jeden Pfennig wert ist. Das Spiel kommt in
einer CDH&uuml;lle daher und die schmucken Fotos auf dem Cover laden gleich zum Spielen
ein.<BR><IMG SRC="gt_ongunline.gif" ALT="Zielend, gebückt" BORDER=0 width=315 height=47>  </TD><TD align=left width=145><IMG SRC="gt_onraumschiff.gif" ALT="Intro" BORDER=0 width=160 height=128></TD> </TR><TR><TD><BR> Also gleich mal rein 
mit der CD.
Mit einem 4X Laufwerk merkt man dem Spiel die LadePausen zwischen den einzelnen
Screens deutlich an, mit einem <A HREF="hard_24xcd.html" TARGET="_PARENT"><FONT size=+1>24X</FONT></A> oder einer Festplatte merkt man nichts
mehr. Ben&ouml;tigt wird laut Verpackung zwar nur ein <font size=-1>DoubleSpeed-Laufwerk,</font> aber
da&szlig; sollte man sich nun wirklich <U>nicht</U> antun. Im Spiel kann man sich erstmal
das Klasse Intro ansehen, das knappe 5 Minuten dauert. Danach geht`s gleich
ins Spiel, und das erste Level ist schnell gel&ouml;st. Wer den Klassiker Flashback 
und das geniale Another World schon kennt wird sich auch hier schnell zurechtfinden.
Das Spiel ist laut Hersteller ein ActionAdventure, aber eigentlich ist es
eher ein ActionSpiel mit Knobel-Elementen. War Flashback mehr als Plattformer
aufgebaut, so spielt <font color=red size=+1><strong>onEscapee</strong></font> meist auf einer Ebene (au&szlig;er beim Schwimmen).
Ach noch was: Auch wenn auf der Packung steht 7 Levels, so sind es eigentlich
nur<U> 6 verschiedene</U> Level; Der zweite Teil von Level 2 wird als eigenes
Level gewertet.</TD><TD width=136><IMG SRC="gt_ononescapee.gif" ALT="Level 4" BORDER=0 width=145 height=184></TD>  </TR><TR><TD> 
Was die Technik angeht, so mu&szlig; Ich sagen SUPER. Auf meiner
MTec 1230/42.6 MHZ l&auml;uft es absolut fl&uuml;ssig mit 25 Bildern pro Sekunde.
Und die Grafik ist jawohl absolut <strong>genial.</strong> Kein Screen gleicht dem anderen,
jeder ist f&uuml;r sich gezeichnet und nicht etwa aus vorgefergtigten Einzelteilen
aufgebaut. Auch gibt es viele verschiedene Todeszenen, von der blutenden Hand
bis zum Tode durch Stromschocks. Auch die Musik ist schlichtweg super. 
Im Intro sowie in Level 4 sind sogar Songs mit Sprache zu h&ouml;ren. Frag mich nur, warum Aliens
Englisch singen...<BR>
Na egal,sie sind absolut sauber digitalisiert worden, und ein echter Ohrenschmaus; die Pallete reicht
dabei von Western bis zu Rock. Vorbei sind die Zeiten des eint&ouml;nigen Gepiepse
am Amiga.<BR></TD><TD width=160><IMG SRC="gt_onauto.gif" width=97 height=128 alt="Intro" BORDER=0></TD></TR><TR><TD> 
Das Spiel gestaltet sich teilweise recht schwierig, teils aber
auch einfach. Hat man erstmal die H&uuml;rden genommen, geht es eine Zeitlang recht
fl&uuml;&szlig;ig weiter. Au&szlig;erdem sind alle R&auml;tsel logisch aufgebaut, und im Nachhinein
auch gar nicht so schwer wie anfangs angenommen. W&auml;hr man blo&szlig; fr&uuml;her auf
diese bl&ouml;de L&ouml;sung gekommen :)<BR>
Die Anleitung zum Spiel liegt in HTML und Text vor, und ist in insgesamt 19 (HTML: 13)
Sprachen verf&uuml;gbar, 2 davon haben sogar Chinesische Schriftzeichen( Nihongo
und Farsi). Sehr viel mehr ist eigentlich nicht zu sagen, au&szlig;er da&szlig; ihr euch
dieses Spiel unbedingt holen m&uuml;&szlig;t. Schlie&szlig;lich meckert Sadeness schon &uuml;ber
die ach so niedrigen Verkaufszahlen. Fazit: <BIG><font color=red>Kaufen!!!</font></BIG><P>
<CENTER><IMG SRC="gt_onredline.gif" BORDER=0 width=274 height7 ALT="--"></CENTER>
</TD><TD width=160><IMG SRC="gt_on2.jpg" BORDER=0 width=160 height=100 ALT="Level5, Wasser"></TD>     </TR>
</TABLE>
<TABLE BORDER=0 >
<TR align=left><TD width=132 rowspan=100></TD>
<TH colspan=3 align=center bgcolor=white text=red><IMG SRC="gt_onmini.gif" BORDER=0 width=200 height=50> </TH></TR>
<TR><TD><BIG>Hersteller:</BIG></TD><TD><BIG><A HREF="http://dragon.klte.hu/~dakos" TARGET="_NEW">Invictus Team</A></BIG></TD><TD rowspan=3><A HREF="http://www.sadeness.co.uk" TARGET="_NEW"> <IMG SRC="gt_onsad.gif" border=0 height=75 width=150></A></TD></TR> 
<TR><TD><BIG>Publisher:</BIG></TD><TD><BIG><A HREF="http://www.sadeness.co.uk" TARGET="_NEW">Sadeness</A></BIG></TD></TR>
<TR><TD><BIG>Kontakt:</BIG></TD><TD><BIG><A HREF="mailto:onescapee@sadeness.demon.co.uk">Sadeness</A></BIG></TD></TR>
<TR><TD>Preis:</TD><TD>ca. 70 DM</TD></TR>
<TR><TD>Genre:</TD><TD>Action-Adventure</TD></TR>
<TR><TD>System:</TD><TD colspan=2>A1200 020/2+2 MB RAM AGA/Grafikkarte(RTG)</TD></TR>
<TR><TD>Grafik:</TD><TD>85%</TD></TR>
<TR><TD>Musik:</TD><TD>90%</TD</TR>
<TR><TD>Spielspa&szlig;:</TD><TD>85%</TR>
<TR><TD>Langzeit-Motivation:</TD><TD>79%</TD></TR>
<TR><TD>Preis/Leistung:</TD><TD>90%</TD></TR>
<TR><TD>Gesamtnote:</TD><TD><U>92%</U></TD></TR>
</TR>
</TABLE>
<CENTER><IMG SRC="gt_ongunline.gif" width=315 height=47 BORDER=0 ALT="Mann mit Knarre..."><BR></CENTER>
<CENTER><BIG><em>Markus Castro Y Castro -The Saint</em></big></CENTER><P>
<font color=white size=1 align=left>Optimized for 800X600</FONT><BR>
<CENTER><A HREF="nocover.html" TARGET="_NEW"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 width=639 height=99></A></CENTER>
</BODY>
</HTML>
