<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet25</title>
</head>
<body background="cd_aminet25.jpg" text=black link=blue alink=red bgcolor="#FFFFCC">
<p>
<center><b>WILLKOMMEN ZUR AMINET CD 25</b></center>
<center>Copyright 1998 &#160; Urban M&#252;ller</center></p>
<p>
Einmal mehr ist die CD vollst&#228;ndig gef&#252;llt mit Neuheiten, aber wieder
mussten einige Dateien weggelassen werden (gr&#246;sstenteils Mods). Der Inhalt:<br>
&#160;980 MB neue Software erschienen seit Aminet CD 24<br>
&#160;&#160;&#160;&#160;4 MB kommerzielle Spiele (Oldies, aber unterhaltsam).</p>
<hr>
<p>So wird man begr&#252;&#223;t, wenn man &#252;ber ReadMe einsteigt und den Knopf Deutsch
bet&#228;tigt. Es hat sich eingeb&#252;rgert, dass auf allen Aminet CD's ein &quot;Schmankerl&quot;,
zu Neudeutsch ein &quot;Highlight&quot; ist. Angefangen hat es mit<br>
<ul>
<li>Aminet-10  Pagestream 2.2 full version + TypeSmith V2.5 secial edition
<li>Aminet-11  Xi-Paint 3.2 full version
<li>Aminet-12  Octamed V5.04 full version + Symphonie full version
<li>Aminet-13  MainActor V1.55
<li>Aminet-14  TurboCalc V2.1 full version
<li>Aminet-15  Zusendung Aminet-16 kostenlos f&#252;r Abo-Kunden
<li>Aminet-16  6 Spiele
<li>Aminet-17  Personal Write full version
<li>Aminet-18  XTreme Racing
<li>Aminet-19  CanDo 2.5 full version + AmiAtlas Pro 1.3
<li>Aminet-20  Wildfire special version
<li>Aminet-21  PPaint 6.4
<li>Aminet-22  Wordworth 5 special edition
<li>Aminet-23  TurboCalc V3.5 full version
<li>Aminet-24  IBrowse 1.2 special edition
<br>
und auf
<br>
<li>Aminet-25  Classic Games Collection
</ul></p>
<p>
Das schauen wir uns doch genauer an. Bisher konnte man getrost sagen,
alleine die Zugabe ist immer den Preis der CD wert. (Ausgenommen die
Nummern 15 und 16.) Aber heute kann ich dies zu Aminet-25 nicht sagen.
Sogar in ReadMe wird gesagt, dass diese 5 Spiele, einmal in Deutsch und
einmal in Englisch:</p>
<ul>
<li>-  Balls
<li>-  Missile
<li>-  Pipe Master II
<li>-  PowerRoller
<li>-  Taxi
</ul>
<p>
von der CD &quot;Gamer's Delight 2&quot; stammen. Und ich m&#246;chte nicht wissen, auf
wievielen anderen CD's diese Spiele noch enthalten sind.</p>
<p>
Nun k&#246;nnen wir also vollkommen beruhigt sagen, ein Highlight ist dieses Mal
nicht enthalten und wenden uns der eigentlichen Aufgabe der Aminet-Reihe
zu.</p>
<hr>
<p>
Als erstes mache ich mich immer auf den Weg und versuche Neuigkeiten zu
finden. Gleich in biz/dbase wurde ich f&#252;ndig. Kulinarius05. Klingt verlockend.
Was sagt der Autor Andreas Boerner dazu:</p>
<p>
Kulinarius ist ein Aufsatz zur Rezept-Verwaltung f&#252;r das
Fiasco-Datenbankprogramm. In dieser Beta-Version importiert
Kulinarius Mealmaster- und CompuChef-Rezepte. F&#252;r unformatierte
Rezepte gibt es zudem einen Import-Editor, der bei mir erh&#228;ltlich
ist.</p>
<p>
Bei entsprechendem Interesse werde ich in sp&#228;teren Versionen diverse
Features anderer Rezeptverwaltungen, wie Mealmaster oder CompuChef auf
dem PC einbauen.</p>
<p>
Um Kulinarius zu benutzen werden au&#223;er diesem Paket noch folgende
Archive, bzw. lediglich die Libs daraus ben&#246;tigt:</p>
<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr><td>/aminet/biz/dbase/Fiasco_main.lha</td><td>- Fiasco</td></tr>
<tr><td>/aminet/biz/dbase/Fiasco_doc_deu.lha</td><td>- Fiasco-Docs</td></tr>
<tr><td>/aminet/biz/dbase/Fiasco2_11_pch.lha</td><td>- Update V2.1 &gt; V2.11</td></tr>
<tr><td>/aminet/util/libs/ReqToolsUsr.lha</td><td>- ReqTools.library</td></tr>
<tr><td>/aminet/util/rexx/RexxTricks_386.lha</td><td>- RexxTricks.Library (mind. V38.2)</td></tr>
<tr><td>/aminet/util/rexx/RexxReqTools.lha</td><td>- RexxReqTools.Library</td></tr>
<tr><td>/aminet/util/rexx/TritonRexx376.lha</td><td>- Triton.library, TritonRexx.Library</td></tr>
</table>
<p>
Da ich Fiasco eigentlich nicht nutze, habe ich alles besorgt und installiert.
Schlie&#223;lich wollte ich doch sehen, was ich da beschreibe. Aber als ich soweit
war, erschien ein Screen von der Gr&#246;&#223;e 640*200 Pixel. Entweder habe ich
etwas falsch gemacht oder ich bin zu dumm die zugeh&#246;rigen Prefs richtig
einzustellen. Ich habe alles einfach wieder gel&#246;scht und ich kann nun nicht
sagen, ob das Programm etwas taugt oder nicht. Entschuldigt bitte. Aber bei
Mi&#223;erfolgen kann man leicht ungeduldig werden, und das ist bei dieser
etwas umst&#228;ndlichen Installation geschehen. Kulinarius ist kein Aufsatz, sondern
h&#246;chstens ein Ansatz einer Dateiverwaltung.</p>
<hr>
<p>
Also halte ich weiter Ausschau nach Neuigkeiten. In comm/mail finde ich
Eucalyptus V1.0. Bevor ich wieder langatmig etwas Falsches von mir gebe,
hier der Originaltext:</p>
<p>
AUTHOR<br>
Paul Schifferer<br>
<br>
DESCRIPTION<br>
Eucalyptus is a new e-mail program for the Amiga.  Features include:
<ul>
<li> - Unlimited message folders
<li> - Full-featured address book
<li> - Multiple message read windows
<li> - Multiple signature files
<li> - PGP signature/encryption/key-transfer
<li> - Extensive filtering system
<li> - Scheduled message delivery
<li> - Integrated SMTP/POP3 clients, plus the ability to use external
     delivery/retrieval agents.
<li> - Configurable external viewers for different media types
<li> - Full multi-threaded operations
</ul>
SPECIAL REQUIREMENTS<br>
<br>
Amiga OS 2.04 or better<br>
ClassAct gadget classes, version 2.0 or higher (V41)<br>
Internet connection<br>
<br>
AVAILABILITY<br>
<br>
Aminet (comm/mail/Eucalyptus.lha)<br>
http://linux.tc3net.com/gandalf/<br>
Or request the most recent version from &lt;gandalf@amiganet.org&gt;.<br>
<br>
PRICE<br>
Free<br>
<br>
DISTRIBUTABILITY<br>
This product is freeware, copyright &#169; 1997,8 Isengard Developments.</p>
<p>
Wer also einen &quot;Mailer&quot; hat und nicht mehr zufrieden damit ist, hier ist
etwas Neues und dazu kostenlos. Ich werde nun den Teufel tun und mich zum
Programm und deren Oberfl&#228;che &#228;u&#223;ern, ich bin mit YAM 2.0 sehr zufrieden
und werde nicht wechseln.</p>
<hr>
<p>
In docs/hyper ist ja noch etwas Neues. Der Autor Ronald Schmiers schreibt dazu:
<br>
<u>Beschreibung:</u><br>
Die B&#252;cher der Bibel als durchsuchbares Amigaguide<br>

<u>Warum das alles?</u><br>
Vor vielen jahren begann ich aus Neugierde in der Bibel zu lesen. Mit der
Zeit wurden mir die vielen Personen und ihre Verwandschaft zu
un&#252;bersichtlich. Etwa 1993 kam mir das Genealogie-Programm Scion in die H&#228;nde
und ich trug alle mir bekannten Daten aus meiner Familie und unserem
Familienstammbuch dort ein. Nun kam mir der Gedanke das gleiche mit den
Personen aus der Bibel zu versuchen, um leichtere &#220;bersicht zu erhalten.
Dabei mu&#223;te ich viel in der Bibel hin und her bl&#228;ttern. Warum also nicht auch
electronische Hilfe zum Suchen benutzen?<br>
Alles was ich im Aminet dazu finden konnte, waren englische Ausgaben der
Bibel, in Programmen die noch f&#252;r den A500 geschrieben waren. Das nutzte mir
nichts.</p>
<p>
So begann ich die Bibeltexte von einer PC-CDROM ins AmigaGuide-Format zu
wandeln, was mir ein Bl&#228;ttern erleichterte. Die Arbeit daran ist noch lange
nicht fertig. Zuerst konvertierte ich die B&#252;cher der Chronik und der K&#246;nige,
weil diese f&#252;r die Familienrecherche der biblischen Personen am geeignetsten
sind. So entstehen nun die einzelnen Guides der B&#252;cher seit 1997.</p>
<p>
Die Datenbank der biblischen Personen ver&#246;ffentlichte ich Anfang 1997 zum
ersten mal im Aminet. Inzwischen wurde und wird sie aktualisiert. Inzwischen
benutze ich Scion V5.06. Diese Datenbank ist im Scion- oder GedCOM- Format
nun als Shareware (10.-DM) von mir erh&#228;ltlich, da ich viele Monate Arbeit
damit hatte.</p>
<p>
Ein Auszug daraus ist im HTML-Format im Internet unter der Adresse:<br>
&quot;http://www.amigaworld.com/ronald.schmiers/BiblischG/&quot; zu finden. Dort
gibts auch die neuesten Versionen der Datenbanken zum Download.</p>
<br>
<p>
<u>Ben&#246;tigtes Zubeh&#246;r:</u><br>
<p>
Um die Verkn&#252;pfungen der Texte nutzen zu k&#246;nnen, wird ein Assign DieBibel:
ben&#246;tigt, da die internen Verweise auf diesem Pfad angelegt wurden. Das hat
seinen Grund darin, da&#223; erstens niemand etwas nutzen w&#252;rde, wenn die Pfade
denen auf meiner Festplatte entsprechen w&#252;rden und zweitens war mir auch der
tief verschachtelte Pfad dorthin zu lang. Au&#223;erdem gew&#228;rt es auch eine
leichtere &#252;bertragbarkeit auf andere Rechner. Man mu&#223; nur das mitgelieferte
Script &quot;Zuweisen.bat&quot; ausf&#252;hren.</p>
<p>
F&#252;r die Suchfunktion ben&#246;tigt man SearchGuide von Gerard Cornu (Aminet) und
die reqtools.library. SearchGuide erstellt eine tempor&#228;re Datei mit den
gefundenen Queerverweisen durch alle nodes.</p>
<p>
F&#252;r die Hyperguidevariante ben&#246;tigt man das Hypertext-Datatype-System HTDS
von Stefan Ruppert. Zumindes den hypertext.datatype und den
hyperguide.datatype. Diese erm&#246;glichen eine attraktivere Gestaltung und
Formatierung von Guidedateien, sowie Bildeinbindungen. Da die Suchfunktion
von HTDS z.Z. nur im aktuellen node funktioniert, ist Searchguide zum
durchsuchen besser geeignet. F&#252;r HTDS sei jedoch eine Suchfunktion durch die
ganze Datei geplant. Das Programm iX-Guide hat die leistungsf&#228;higste
Suchfunktion durch eine ganze Liste von Dateien. Leider unterscheiden sich
die Formatierbefehle von IXML und Hyperguide zu sehr von einander, doch mit
Standard-Amigaguide kommen beide zurecht.</p>
</p>
<u>Zukunft:</u><br>
Bisher sind erst die f&#252;r meinen Zweck der Stammbaumrecherche wichtigsten
B&#252;cher in AmigaGuides gewandelt. Nach und nach wird das auch mit den
restlichen B&#252;chern geschehen. Wer sich daran beteiligen m&#246;chte, soll sich bei
mir melden:<br>
ronald.schmiers@amigaworld.com oder<br>
r.schmiers@abo.freiepresse.de.</p>
<p>
Weiterhin soll eine Verkn&#252;pfung zu den aus den Scion-Datenbanken
exportierbaren Personen.guides eingebaut werden. Der Idealzustand w&#228;re per
ARexx aus den Guides heraus die Scion-Datenbank abzufragen. Die Kr&#246;nung des
ganzen w&#228;re dann am Ende alles auf CDROM zu brennen.</p>
<p>
Wenn die B&#252;cher komplett in AmigaGuide umgesetzt sind und alle Verkn&#252;pfungen
funktionieren, sollen sie zur besseren Pr&#228;sentation in HyperGuide gewandelt
werden.</p>
<p>
Vorstellbar ist auch eine Umsetzung in IXML f&#252;r iX-Guide, doch das ist eine
Zeitfrage.</p>
<p>
<u>Copyright &amp; Distribution:</u><br>

Die Bibelguide erkl&#228;re ich zu Mail- oder Card-ware. Jeder der sie sich
angesehen hat und eine Meinung dar&#252;ber hat, sollte mir ein paar Zeilen
schreiben. Die Bibelguides d&#252;rfen frei kopiert werden solange sie unver&#228;ndert
bleiben und der Name des Erstellers nicht ver&#228;ndert wird.<br>

Ronald Schmiers M&#228;rz 1998. April 1998</p>
<hr>
<p>
Nun wird meine Betrachtung etwas langatmig und Genaues habe ich nicht von mir
gegeben. Das wollte ich &#252;brigens auch nicht. Soll ich sagen, Abo-Kunden haben
diese CD sowieso und warten schon auf Nr. 26, um endlich wirklich einmal einen
Komet am Amigahimmel zu suchen und auch zu finden? Wer sich zum Beispiel
unter AFL.Guide nichts vorstellen kann, hier schnell die Aufkl&#228;rung.
AFL steht f&#252;r Australian Football Leage scores (Stand: 08.04.1998). Unheimlich
wichtig, sodass manche Neuheiten leider auf dieser CD keinen Platz mehr hatten.</p>
<p>
Dabei l&#228;stere ich ja gar nicht, dass die Fertigstellung mit 10 Tagen
&#252;berschritten wurde. Deshalb ist durch den Zeitdruck wohl auch nicht alles
fertig geworden. Wenn ihr Bilder betrachten wollt, dann steigt nicht &#252;ber
Guide/Deutsch/pix ein, sondern w&#228;hlt gleich Guide/pix. In Deutsch/pix wurden
10 Schaltfl&#228;chen komplett vergessen und in den vorhanden 8 Schaltf&#228;chen sind
in 5 davon jeweils nur ein Bild angesiedelt. F&#252;r die anderen 29 z.B. in pix/art
hat wohl die Zeit nicht mehr gereicht. Wie es in der Abteilung Musik und
Spiele ausschaut, habe ich noch nicht kontrolliert. Ich tue es jetzt auch
nicht, sondern schlie&#223;e hiermit meine &#196;u&#223;erungen.</p>
Wolf Zimmer
<hr noshade>
<center>
<a href="nocover.html"><img border=0 src="l_hauptinhalt.jpg" width=600 height=99></a>
</center>

</BODY>
</HTLM>
