<HTML>
<HEAD>
<TITLE>
Und Tschüss - Amiga??</TITLE>
</HEAD>
<BODY TEXT=white link=blue alink=black background="indypattern.jpg">

<H1> Kickoff the Amiga? </H1>
<BR>
Hiermit m&ouml;chte ich mal kurz auf die Pl&auml;ne von Amiga, Inc/Amiga International eingehen.<BR>
<BR>
Um die Sache mal grob zu Umrei&szlig;en: Ich finde die Pl&auml;ne von Amiga zum <I>schreien schlecht!!</I><BR>
Was denken die sich eigentlich? Einzig und allein die Idee, die den Prozessor betrifft, <BR>
finde ich pers&ouml;nlich gut, denn sie entspricht dem Amiga-Gedanken, immer auf neue,<BR>
alternative Technologien zusetzen. Leid tut es mir aber um Phase5 und alle die, die<BR>
sich eine PPC Turbokarte gekauft haben. Ich hoffe f&uuml;r sie, das Amiga ihnen trotzdem irgendeine<BR>
Unterst&uuml;tzung zukommen l&auml;&szlig;t (Z.B. das Phase5/H&amp;P ein natives OS schreiben d&uuml;rfen...).<BR>
Aber zur&uuml;ck zum Thema. <BR>
Als absolut schwachsinnig, unverst&auml;ndlich, undankbar und verr&uuml;ckt finde ich die Idee kein<BR>
neues OS f&uuml;r die &quot;Classic Amigas&quot; herraus zubringen. <BR>
<BR>
<B>Warum schwachsinnig?</B><BR>
Warum sollte Amiga kein neues OS f&uuml;r unsere Rechner mehr herrausbringen? Ich meine wovon<BR>
wollen die bis 1999 leben? Ich glaube nicht das sich jemand einen &quot;Classic Amiga&quot; kaufen<BR>
wird, wo er doch wei&szlig; das er nicht mehr von Amiga supportet wird... <BR>
Und selbst dann, wer sagt das sich &uuml;berhaupt jemand einen dieser neuen &quot;Dinger&quot; kaufen wird?<BR>
Wenn die neuen Amigas so aussehen wie sie jetzt geplant sind werden sich wohl die meisten<BR>
Amiga User nicht daf&uuml;r erw&auml;rmen k&ouml;nnen. Ich f&uuml;r meinen Teil lehne die Amigas so, wie sie jetzt<BR>
geplant sind, schlichtweg ab (mal abgesehen von der Prozessor-Idee, die ich wirklich sehr gut <BR>
finde!)<BR>
<BR>
<B>
Warum unverst&auml;ndlich?<BR></B>
Ich kann gar nicht verstehen wie man sowas einfach entscheiden kann (und das scheinbar &uuml;ber Nacht).<BR>
Man k&ouml;nnte wenigstens eine repr&auml;sentative Umfrage unter den Usern durchf&uuml;hren, und dann<BR>
&uuml;ber ein solch heikles Thema entscheiden.<BR>
<BR>
<B>
Warum undankbar?<BR></B>
Nun ja, es mag vieleicht etwas &uuml;berheblich und egoistisch klingen aber sind die von Amiga<BR>
uns nicht etwas schuldig? Wer meinen die, hat den Markt solange am Leben erhalten? Ich<BR>
erwarte nicht das sie f&uuml;r immer und ewig die &quot;Classic Amigas&quot; (So ein bl&ouml;der Name!!! :-() <BR>
mit neuer Soft- und Hardware unterst&uuml;tzen, aber w&auml;re gerade hier, beim OS, nicht ein weicher &Uuml;ber-<BR>
gang denkbar, &auml;hnlich wie bei Apple??<BR>
<BR>
<B>
Warum verr&uuml;ckt?<BR></B>
Sie schneiden sich doch eigentlich mit solchen Entscheidungen ins eigene Fleisch, oder?<BR>
Will sagen: wer investiert jetzt noch gro&szlig; in seinen Amiga, wenn er doch wei&szlig;, f&uuml;r ihn <BR>
gibt es kein neues OS. Nach Meinung vieler ist das ja das wichtigste am ganzen Amiga!!<BR>
Und man kann sein lieblings Computer OS nun mal nicht f&uuml;r immer und ewig mit Tools auf dem <BR>
laufenden halten (Auch wenn MCP &amp; NewIcons irgendwann mal in der Verion 200 erschienen sind.),<BR>
letzendlich w&auml;re man dann wieder bei 2MB Ram und der Prozessorleistung eines 68000...<BR>
<BR>
Ich glaube ich habe hier meinen Standpunkt zum neuen OS deutlich gemacht.<BR>
&Uuml;ber solche Ank&uuml;ndigungen wie &quot;angepa&szlig;t an Industrie Standarts&quot; und &auml;hnlichen Bl&ouml;dsinn<BR>
will ich mich mal nicht weiter &auml;u&szlig;ern, da ich glaube das Amiga einige der Ank&uuml;ndigungen<BR>
wieder zur&uuml;ckziehen wird, haben wir ja schon oft genug gehabt, das man auf die Meinung der<BR>
User h&ouml;rt (ich sage nur &quot;Walker&quot; :-))<BR>
Wenn nicht, dann werde ich meinen Dampf bestimmt auch dar&uuml;ber ablassen!!!!!!!!!!!!! :-(((<BR>
<BR>
Ciao,<BR>
<a href=mitglieder/cschmidt.html> Christian Schmidt</a><BR>
<center>
<a href=help_grafikkarte.html> HelpLine Artikel </a><BR>

<a href=leser_christians.html> Meine Leserbriefe </a><P>
</center>
<right>
<h3>
<I> Indy </I>
</H3>
</right>

</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=597 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
