<HTML>
<HEAD>
<TITLE>HTML-Disku</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" BGCOLOR="#000080">
<P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=510>
<TR><TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=105><P></P></TD>
<TD WIDTH="9%" VALIGN="TOP" HEIGHT=105><P></P></TD>
<TD WIDTH="85%" VALIGN="TOP" COLSPAN=2 BGCOLOR="#ffff00" HEIGHT=105><P></P></TD>
</TR>
<TR><TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=10><P></P></TD>
<TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=10><P></P></TD>
<TD WIDTH="85%" VALIGN="TOP" COLSPAN=2 BGCOLOR="#ffff00" HEIGHT=10><P></P></TD>
</TR>
<TR><TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=21><P></P></TD>
<TD WIDTH="9%" VALIGN="TOP" HEIGHT=21><P></P></TD>
<TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=21><P></P></TD>
<TD WIDTH="80%" VALIGN="TOP" HEIGHT=21>
<I><U><FONT COLOR="#ffff00"><H2>IGGINS´ens  Diskussions - Beitrag</H2></I></U></FONT></TD>
</TR>
<TR><TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=54><P></P></TD>
<TD WIDTH="9%" VALIGN="TOP" HEIGHT=54><P></P></TD>
<TD WIDTH="6%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=54><P></P></TD>
<TD WIDTH="80%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=54><P></P></TD>
</TR>
</TABLE>

<B><FONT SIZE=4 COLOR="#ffffff"><P>                      </P>
</B></FONT><U><FONT COLOR="#00ffff"><H1 ALIGN="CENTER">zur NoCover - Evolution</H1>
</U></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#00ffff"><P>.... ganz ehrlich, - als ich die NoCover Ausgabe 50 auf meine    Festplatte bannte, um sie anschlie&szlig;end mit einer nicht mehr ganz    modernen Version des Browsers "AWeb" auf den Monitor zu zaubern, bekam ich einen richtigen Schreck !</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>DAS soll die neue NoCover werden ???</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Was ich da sah, wirkte schlicht und ergreifend nur &auml;u&szlig;erst trist, langweilig und unbequehm in der Bedienung. F&uuml;r mich stand ganz klar fest, da&szlig; ich SO mit dem neuen Format nie zurecht kommen w&uuml;rde. Mir pers&ouml;nlich gefiel der alte MagneticPager, denn er war    leicht zu bedienen und ich war es gewohnt die NoCover Seite f&uuml;r Seite &uuml;ber die Tastatur zu durchbl&auml;ttern. Auch die Funktionen, Texte und Bilder direkt aus dem Anzeiger einzeln abzuspeichern waren mir gewohnte Annehmlichkeiten und mir ging es bei der NoCover sowieso immer mehr um die Texte und die bequehme Bedienung, als um ein h&uuml;bsches Design.    </P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#00ffff"><P>Ich versuchte also weitere Demoversionen der verschiedenen Amiga-Browser, doch kein Einziger vermochte mir die neue NoCover wieder etwas schmackhafter zu machen. Ich bin sicherlich zugegebener Weise eher ein Gewohnheitskind und gew&ouml;hne mich nur ungern und dann sehr langsam an drastische &Auml;nderungen, besonders, wenn ich mit dem gutgedienten immer hervorragend zurecht kam. Mir war vollkommen klar, da&szlig; es mir nichts bringen wird, meine Unbehaglichkeit, der neuen NC gegen&uuml;ber protestierend kundzutun, denn selbstverst&auml;ndlich mu&szlig; man realistisch bleiben und sich den vielen Vorteilen des HTML-Formats beugen. Konnte dadurch doch auch unsere gute NoCover endg&uuml;ltig Einzug ins moderne Medium    namens Internet halten. So k&ouml;nnen wesentlich mehr interessierte Amiga-User dieses Magazin erreichen und entschlie&szlig;en sich vielleicht sogar, aktiv mitzuarbeiten. So &uuml;berlegte ich, ob ich nicht dennoch so ehrlich sein sollte und dem Andreas erkl&auml;ren m&uuml;&szlig;te, da&szlig; ich, wenn auch vielleicht als Einzelg&auml;nger mit der neuen NoCover recht unzufrieden bin. Ich schrieb ihm somit eine EMail deswegen, machte    aber auch deutlich, da&szlig; meine Meinung hier v&ouml;llig belanglos sei, ich aber dennoch klarstellen wollte, da&szlig; eben nicht zu 100 % alle Leser mit der Umstellung gl&uuml;cklich sind. </P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#ffffff"><P>Nach und nach erfuhr ich jedoch, da&szlig; es au&szlig;er mir noch eine ganz Menge weiterer Leser gab, die sich ebenfalls nicht an die neue HTML-Darstellung gew&ouml;hnen konnten. Zwischendurch hatte ich dann endlich einen guten Amiga-Browser gefunden, der mir die NoCover wieder schmackhaft machen konnte. Es handelt sich hierbei um IBrowse, was ich JEDEM, der immer noch nicht mit der NoCover rein optisch zufrieden ist, sehr empfehlen kann. Texte, Hintergrund und Bilder werden sehr schnell und in guter Qualit&auml;t geladen und angezeigt. Auch die Bedienung per Tastatur kann schnell zur automatischen Handbewegung werden, so da&szlig; zumindest ich jetzt wieder gerne die NoCover lesen kann.    </P>
</B></FONT><H1><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></H1>
<FONT COLOR="#ffff00"><H1>HTML langweilig ?</H1>
</FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>Keineswegs ! Nachdem ich wegen der st&auml;ndigen Neuank&uuml;ndigung eines neuen Anzeigers f&uuml;r die NoCover nie besondere Lust hatte, mich mit dem Editor von MagneticPages zu befassen, um meine Artikel selbst zu layouten, konnte ich mich jetzt endlich mal daran machen, mich in HTML ein wenig zu versuchen.    </P>
<P>Innerhalb k&uuml;rzester Zeit hatte ich das Grundkonzept des HTML-Formates erkannt und konnte erstaunliche Layouts hier hinbekommen. Als ich das Grundkonzept begriffen habe, machte ich mir nun noch &Uuml;berlegungen, wie ich von Faulheit gezwungen das layouten noch einfacher gestalten k&ouml;nnte, habe mir einige HTML-Editoren am Amiga angesehen und mu&szlig;te leider feststellen, da&szlig; die Dinger NOCH in den Kinderschuhen stecken. Das Beste, was ich am Amiga finden konnte, war da noch der HTML-Export von FinalWriter97. Das n&auml;chste Problem war, da&szlig; ein von mir layouteter Text bei jedem Browser anders aussehen kann und besonders bei zu alten Browsern jedes Layout wie Perlen vor die S&auml;ue ist.</P>
<P>MoreHTML beispielsweise w&auml;re haargenau das, was wir f&uuml;r die Anzeige der NoCover EINHEITLICH h&auml;tten verwenden k&ouml;nnen, um einen Standart zu gew&auml;hrleisten und sicher zu gehen, da&szlig; eine HTML-Seite der NoCover bei jedem Leser wirklich genau gleich aussieht. Schade ist hierbei nur, da&szlig; MoreHTML noch absolut hierf&uuml;r untauglich ist, da dieser Anzeiger viele Elemente &uuml;berhaupt noch nicht erkennen kann. Hier bei mir mit IBrowse angezeigt sehen die Seiten der NoCover und auch meine ersten HTML-Versuche recht gut aus, - jedenfalls bin ich selbst zufrieden, was ich bislang in den wenigen Tagen jetzt gelernt habe. </P>
<P>Doch sieht die NC auch auf jedem Amiga mit den unterschiedlichen Browsern immer gleich gut aus ? Bei AWeb hatte ich starke Farbverf&auml;lschungen, was sich bei irgendeiner Einstellung ja vielleicht &auml;ndern l&auml;&szlig;t. Von Voyager konnte ich noch kein einziges Web-Dokument sauber angezeigt bekommen, was aber an der veralteten Version bei mir liegt. </P>
<P>Ich bin da mit Andreas vollkommen einer Meinung - wir m&uuml;ssen uns erst einmal ans neue HTML-Format gew&ouml;hnen und bei der Gestaltung immer weiter dazu lernen.    </P>
<P>Zur Zeit nutzen wir die M&ouml;glichkeiten des HTML-Formates ja nicht einmal ann&auml;hernd. </P>
<P>HTML scheint mir sehr leicht und einfach erlernbar und so kann sicherlich bald Jeder von uns seine Texte in der NC selbst gestalten. F&uuml;r Andreas bedeutet das eine ganz erhebliche Zeitersparnis und f&uuml;r mehr Zeit wird er uns sehr dankbar sein, - wollen wir wetten ;-)</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffff00"><H1>Totale Vernetzung !</H1>
</I></FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>Wahnsinn,... was ist mit dem neuen Format der NoCover nicht noch alles m&ouml;glich ?</P>
<P>Gehen wir doch mal davon aus, da&szlig; Jeder von uns die NoCover in das selbe Verzeichnis abspeichert, wo auch bereits alle anderen HTML-NoCovers liegen. Nun hat der eine vielleicht die NoCover in "Work:Magazine/NoCover/NoCoverXX" (das XX w&uuml;rde hier f&uuml;r die Ausgabe Nummer xx stehen), w&auml;hrend der N&auml;chste seine NoCover lieber in "Workbench:Tools/NC/NoCoverXX" beherbergt. V&ouml;llig egal, wir m&uuml;&szlig;ten uns nur darauf einigen, da&szlig; alle NoCover-Ausgaben in EINEM Mutterverzeichnis liegen und dieses Mutterverzeichnis per ASSIGN-Zuweisung in der "User-Startup" &uuml;berall den selben Namen erh&auml;lt - zB. NC: ! Eine Zuweisung k&ouml;nnte auch automatisch vom Installer &uuml;berpr&uuml;ft und gegebenenfalls in die User-Startup eingef&uuml;gt werden. Ein einheitliches Mutterverzeichnis h&auml;tte sicher manche Vorteile ....</P>
<P>Man k&ouml;nnte sich sparen, immer gleiche Daten, wie zB. die Layoutgrafiken der NC und das Verzeichnis "Mitglieder", in dem die vielen Mitgliederseiten von Rainer und Sascha gesammelt werden, immer wieder auf den beiden Disketten mit zu schleppen. Das spart abermals etwas Platz, den wir f&uuml;r die Artikel frei bekommen. Statt dessen befindet sich im station&auml;ren Verzeichnis auf der Festplatte das MITGLIEDER-, vielleicht ein GRAFIKEN- und vor allem ein HELP-Verzeichnis. Und jetzt wird die Sache interessant ....</P>
<P>Ich habe die NC schon einige male verschenkt, um neue Interessenten f&uuml;r unseren Club zu gewinnen, denn wenn ich eine Sache selbst gut finde, empfehle ich es auch weiter. Leider waren sehr Viele zun&auml;chst nicht so begeistert und ich wollte nat&uuml;rlich herausfinden, woran das liegen k&ouml;nnte. Vielen war unsere NC zu "freakig" - mit anderen Worten - unsere NC macht auf Neulinge oft den Eindruck, als wenn unser Magazin ausschlie&szlig;lich f&uuml;r die Insider und Menschen gemacht ist, die 24 Stunden NUR den Amiga im Kopf haben. Dann ist das auch noch oft so, da&szlig; anderen die NC erheblich zu altbatsch wirkte, was wir ja mit HTML nun ge&auml;ndert haben und sicherlich noch bald weiter verbessern k&ouml;nnen. Die n&auml;chste Gruppe fand zuviele Fremdbegriffe, mit denen sie wenig anfangen konnten. Damit meine ich weniger die Standartbegriffe der gel&auml;ufigsten EDV-Komponenten, als typisches Insidergefasel.</P>
<P>Lange Rede - kurzer Sinn, - ein HELP-, oder HILFE-Verzeichnis im NC-Hauptverzeichnis k&ouml;nnte hier Abhilfe schaffen ! Verwendet man als Schreiber der NC-Artikel ein Fachbegriff, so kann man diesen kurz in einer kleinen HTML-Seite erkl&auml;ren und diese HILFS-Dateien in ein HELP-Verzeichnis abspeichern, wenn es zum Andreas auf die Reise geht. Andreas weis dadurch, da&szlig; er das File mit dem Installer der n&auml;chsten NC in das HELP-Verzeichnis auf die Festplatte kopieren lassen soll. St&ouml;&szlig;t nun der Leser dieser NC im Artikel auf das f&uuml;r ihn noch unbekannte Wort, gen&uuml;gt ein Mausklick darauf und schon befindet er sich auf der erkl&auml;renden Hilfe-Seite. Dh. Der Artikelschreiber hat also einen Link zu seiner erkl&auml;renden Seite integriert. Wer den Begriff kennt, &uuml;berliest ihn einfach und wer noch mal nachlesen m&ouml;chte, klickt einfach mit der Maus aufs Wort, um sich schlau zu machen. Ein schon im HELP-Verzeichnis gut erkl&auml;rtes Wort braucht nat&uuml;rlich nicht noch einmal erkl&auml;rt zu werden. Andere Schreiber k&ouml;nnen dann sp&auml;ter auf die alte Hilfe-Seite greifen und brauchen nur noch den entsprechenden Link in ihre Artikel einf&uuml;gen. Praktisch, oder ... ?</P>
<P>Dadurch ergibt sich mit der Zeit ein weiterer Effekt - so wird n&auml;mlich nach und nach ein W&ouml;rterbuch entstehen und wenn jemand Zeit und Lust hat, kann er hierzu dann noch ein separates Inhaltsverzeichnis als HTML-Dokument erstellen, was wiederum mit in jede NoCover integriert werden kann. Sicherlich lie&szlig;en sich dann auch mal alle allgemein interessanten Antworten aus der Helpline einbringen. Dieses Prinzip hat sich mit unserem Mitglieder-Index ja bereits gut bew&auml;hrt, wie ich finde !</P>
<P>Bei den Mitglieder-Seiten funktionierts genauso gut. Und &auml;ndert sich etwas bei den einzelnen Mitgliedern bzw. bei der Konfiguration, so kann der Installer sicherlich die wenigen neuen Mitgliederseiten, wo &Auml;nderungen waren, gegen die vorhandenen alten Seiten ersetzen, statt immer wieder die selben Seiten wieder und wieder in unterschiedliche Verzeichnisse auf die Festplatte zu kopieren und somit unn&ouml;tig Platz auf den beiden NC-Disketten und zuletzt auch noch auf der Festplatte zu verbraten !</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffff00"><H1>Wer hat weitere Ideen ?</H1>
</I></FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>Das sind jetzt nur WENIGE Gedanken, die mir zu den neuen M&ouml;glichkeiten gerade einfallen. Nicht nur, wenn ich noch weiter &uuml;berlege, wachsen weitere Ideen. Euch f&auml;llt bestimmt auch noch jede Menge ein - la&szlig;t doch mal lesen !!!</P>
<P>Also ich denke, wir haben mit dem neuen HTML-Format mehr gewonnen, als verloren, auch wenn die gewohnten, aber wenigen Vorteile der alten NC nat&uuml;rlich schmerzlich sind.</P>
<P>Voraussetzung f&uuml;r eine weiterhin gute NoCover werden sowieso weiterhin viele gute Artikel sein. Ein sch&ouml;nes Design geh&ouml;rt zwar dazu, kann allein aber auch nicht alles wieder herausrei&szlig;en.</P>
<P>Was mir mit am meisten fehlt, sind die vielen tollen Titelbilder unserer Clubk&uuml;nstler. DAS finde ich wirklich schade, da&szlig; unser sch&ouml;nes Magazin sich nicht einmal ein schickes Titelbild leisten kann :-(</P>
<P>Aber das ist nat&uuml;rlich Geschmackssache, - manch Anderer fand die Bilder ja sowieso nur als unn&ouml;tigen KByte-Balast.</P>
<P>Wie dem auch sei - Leute lasst uns gar nicht erst soviel hin und her diskutieren, ob nun HTML, oder Magnetic Page - DIESE Entscheidung ist schon zugunsten modernerer Zeiten gefallen. Jetzt w&auml;re es viel n&uuml;tzlicher, die neuen M&ouml;glichkeiten zusammen zutragen, da&szlig; beste daraus auszuw&auml;hlen und in die Tat umzusetzen.</P>
<P>Mit Hoffnung auf Resonanz ....</P>
<P>Euer</P>
</B></FONT><I><FONT COLOR="#00ffff"><H1 ALIGN="CENTER">Cord Hagen</H1>
</I></FONT><P ALIGN="CENTER"><A HREF="MITGLIEDER/HAGEN.HTML">HIGGINS</A><B><FONT SIZE=4 COLOR="#ffffff"> </P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P></B></FONT></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</HTML>
