<HTML>
<HEAD><TITLE>PHASE 5 VS Amiga Inc.</TITLE></HEAD>
<BODY bgcolor=white text=black background="disku_ppcprozessor.gif">
Nachdem Ich &uuml;ber die <A HREF="aa/main.html" TARGET="_NEW">AmigaAktuell</A> von den neuesten Pl&auml;nen seitens <A HREF="http://www.amiga.com" TARGET="_NEW">Amiga Inc.</A>
erfahren habe w&uuml;rde Ich hier gerne mal meine Meinung dazu loswerden.<BR>
<HR noshade size=1>
Ich finde, da&szlig; es unverantwortlich von <A HREF="http://www.amiga.com" TARGET="_NEW">Amiga Inc.</A> ist, zwei Jahre lang die
Weichen auf PPC zu stellen, und wenn <A HREF="http://www.phase5.com" TARGET="_NEW">PHASE 5</A> dann massig Geld f&uuml;r Entwicklung
und Bau dieser Boards locker gemacht hat, pl&ouml;tzlich abzuspringen, und zu sagen,
in 1 1/2 Jahren h&auml;tten sie eine Maschine die viel besser ist. Da mu&szlig; es doch
bei den Leuten klingeln; das selbe hatten wir doch schon mal vor ein paar
Jahren. Und jetzt haben wir neue Prozessoren, die dem <A HREF="http://www.vollidioten.com/Intel/Schwachköpfe.html">Intel-Lager</A> gewachsen
sind und jetzt hei&szlig;t es das die nicht unterst&uuml;tzt werden, und man nochmal
1 1/2 Jahre auf den n&auml;chsten &quot;Spitzen&quot;- Prozessor warten soll. Was wird den aus
dem Amiga in den n&auml;chsten 18 Monaten? Sollen die Entwickler etwa noch mal
ein par Monate bei der Stange gehalten werden, ohne Daten des Prozessors,
ohne Chance irgendetwas zu entwickeln was gekauft werden w&uuml;rde? Denn wenn
<A HREF="http://www.amiga.com" TARGET="_NEW">Amiga Inc.</A> wirklich auf dem neuen Prozessor Marke XYZ besteht, wer w&uuml;rde dann
noch die PPC-Boards von <A HREF="http://www.phase5.com" TARGET="_NEW">Phase 5</A> kaufen? Schlie&szlig;lich w&auml;hre deren Zukunft dann
mehr als ungewi&szlig;. Und &uuml;berhaupt, was macht diesen Prozessor(den "neuen" von
A. Inc.) &uuml;berhaupt so viel besser? Ist er etwa abw&auml;rts kompatibel zum MC68060?
Mit Sicherheit nicht. Oder ist er etwa wirklich so billig zu haben? Wenn
Gateway 2000 mehr als 1 Jahr daran entwickelt entstehen doch immense Kosten.
Das kann es also auch nicht sein. Oder ist schon in 1 Monat verf&uuml;gbar und
bereits auf TurboKarten installiert? Der PPC bietet doch klare Vorteile gegen&uuml;ber
diesem Phantom-Prozessor:
- Er ist bereits f&uuml;r die meisten AmigaModelle zu haben.
- Er wird von Motorola konsequent weiterentwickelt.
- Er bietet ein geh&ouml;riges St&uuml;ck Leistung, und zwar nicht erst in 100 Jahren.
- Die Entwickler wissen damit etwas anzufangen.
- Er hat sich bereits einen Nahmen gamacht, und ist von Entwicklern und
Usern als neuer Prozessor akzeptiert.
- Er l&auml;&szlig;t sich in die Bestehenden Amigas einbauen, man m&uuml;&szlig;te sich nicht von
seinen zahllosen Erweitungen trennen und alles neu kaufen( Wir sind doch hier nicht bei Intel!).
Und au&szlig;erdem, denkt den Niemand an <A HREF="http://www.phase5.com" TARGET="_NEW">PHASE 5</A>? Die haben schon mehrere tausend
Boards verkauft, und die bestehenden auch schon weiterentwickelt. Ist das
jetzt die neue Taktik von A. Inc., da&szlig; kompetente Entwicklerfirmen in den
Ruin getrieben werden, die User verunsichert, der Markt gespalten, und die
Spielefirmen verschreckt werden? Vieleicht hat A. Inc. jetzt ja schon wieder
auf PPC umgeschwenkt, die scheinen da sehr flexibel zu sein. Aber wenn ich
da dann diese Ank&uuml;ndigungen &uuml;ber die AmigaBr&uuml;ckenkarte h&ouml;re...
Also mit mir nicht, wenn Ich gen&uuml;gend Geld
habe werde Ich mir auf jeden Fall ein PowerUP Board zulegen!<BR> So, Ich habe fertig:<HR width=75%>
<CENTER><BIG><STRONG>Markus Castro Y Castro -The Saint</STRONG></BIG></CENTER>
<BR><CENTER><A HREF="NoCover.html" target="_NEW"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 ALT="Inhalt" width=639 height=99></A>
