<HTML>
<HEAD>
<TITLE>CD-Writer</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#1b10aa">
<FONT COLOR="#ffffff"><H1 ALIGN="CENTER">HIGGINSens</H1>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#ffffff"><H2 ALIGN="CENTER">Marktbeobachtung : CD - Writer</H2>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>&nbsp;</P>
</B></FONT><I><U><FONT COLOR="#ffffff"><H2>C D - W r i t e r = C D - W r i t e r ? ? ?</H2>
</I></U></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>CD-Writer = CD-Writer ? - Gut informiert ist schon halb gebrannt ... </P>
</FONT><FONT COLOR="#00ffff"><P>Auch auf dem Amiga haben sie eingeschlagen, wie der Blitz. Nie zuvor konnte auf g&uuml;nstigeren Datentr&auml;gern BackUps der gro&szlig;en Festplatten erstellt werden. Hat man erst einmal den relativ hohen Anschaffungspreis &uuml;berstanden, kann man sich ungetr&uuml;bt &uuml;ber die neuen M&ouml;glichkeiten freuen. Damit diese Freude wirklich gro&szlig; ist, habe ich mich mit diesem Thema etwas weiter befasst um dem Ein, oder Anderem vielleicht einige n&uuml;tzliche Informationen VOR dem Kauf von CD-Recordern (auch CD-Writer genannt) und CD-Rs (einmal beschreibbare CD-Rohlinge) bzw. CD-RWs (wiederbeschreibbare CD-Rohlinge) zu geben. </P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Unterschiede ?</H2>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Noch vor gar nicht allzu langer Zeit waren einfache CD-Recorder mit Geschwindigkeiten, wie sie auch in Musik-CD-Abspielger&auml;ten &uuml;blich sind (1 x) so teuer, da&szlig; man au&szlig;erhalb des professionellen Einsatzbereiches diese Investition nicht h&auml;tte glaubhaft rechtfertigen k&ouml;nnen. </P>
<P>Mittlerweile sind aber auch hier, wie bei allen anderen neuen Techniken die Preise f&uuml;r den Massenmarkt ordentlich in den Keller gegangen und eine Investition f&auml;llt einem nicht mehr ganz so schwer. Zugegeben, in den Taschengeldbereich liegen die Verkaufspreise selbst bei g&uuml;nstigsten CD-Writern lange noch nicht und so Mancher &uuml;berlegt vor dem Kauf mehrmals, wozu er das neue Medium einsetzen m&ouml;chte. Genaue &Uuml;berlegungen sind auch sehr empfehlenswert, denn sehr viele Ger&auml;te sind leider noch nicht so sehr ausgereift, wie man es eigentlich gerne h&auml;tte. Sie erledigen zwar </P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=438 ALIGN="LEFT" HSPACE=12>
<TR><TD VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=18>
<P ALIGN="CENTER"><B><FONT SIZE=1 COLOR="#ffffff">Info : CD-ROM-Recorder</B></FONT></TD>
</TR>
<TR><TD VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=56>
<FONT SIZE=1><P>- auch CD-Brenner, oder CD-Writer genannt, ist ein Ger&auml;t, mit dem CD-ROMs und MusikCDs produziert ("gebrannt") werden und anschlie&szlig;end mit handels&uuml;blichen CD-ROM-Laufwerken, bzw. Hifi-CD-Playern wieder abgespielt werden k&ouml;nnen.</FONT></TD>
</TR>
</TABLE>
</P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>grunds&auml;tzlich alle ihren vorgesehenen Dienst, doch wenn bis zu 50 % der beschriebenen CD-Rohlinge anschlie&szlig;end im Kunststoffm&uuml;ll landen, weil der CD-Writer &auml;u&szlig;erst unzuverl&auml;ssig arbeitet, kann schnell Frust entstehen, denn auch der g&uuml;nstigste Rohling ist zu teuer, wenn er nicht brauchbar ist. </P>
<P>Am g&uuml;nstigsten sind immer noch die CD-Recorder der ersten Generation, die ihre Medien nur ein einziges mal beschreiben k&ouml;nnen. Dicht verfolgt werden sie aber bereits von ihren Nachfolgern, die weitere spezielle Medien auch mehrmals beschreiben k&ouml;nnen. So f&auml;llt die Wahl schwer, denn gerne wird man einen "kleinen" Aufpreis zahlen, wenn man daf&uuml;r eine CD immer wieder verwenden kann. Gibt es bei den einfachen CD-Recordern eigentlich schon genug Ursachen, die einen l&uuml;ckenlosen Erfolg verhindern, so glaubt man beim Gebrauch wiederbespielbarer Ger&auml;te in Verbindung mit den weit teureren Rohlingen leider oft, da&szlig; da wohl nur der Wunsch, Vater des Gedanken war. </P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=453 ALIGN="RIGHT" HSPACE=12>
<TR><TD VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=18>
<P ALIGN="CENTER"><B><FONT SIZE=1 COLOR="#ffffff">Info : CD-Rohling</B></FONT></TD>
</TR>
<TR><TD VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=84>
<FONT SIZE=1><P>Die beschreibbaren CDs werden als CD-Rohling, Leer-CDs, oder CD-R bezeichnet und k&ouml;nnen im Gegensatz zu den wiederbeschreibbaren CD-RWs und anderen g&auml;ngigen Datentr&auml;ger nur ein einziges mal beschrieben werden. Je nach Fabrikat schimmert die zu beschreibende Seite in gr&uuml;n, goldfarben, silber oder blau. Es gibt jedoch keinen nachvollziehbaren Beweis, da&szlig; eine Farbe f&uuml;r die Qualit&auml;t einer Leer-CD verantwortlich ist</FONT></TD>
</TR>
</TABLE>
</P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>Das Problem bei den mehrmals bespielten CD-RWs liegt gar nicht mal so sehr bei der Aufnahme der Daten, sondern vielmehr beim abspielen solch gebrannter CDs in anderen CD-Laufwerken, als dem CD-Recorder selbst. Ein sehr hoher Anteil der markt&uuml;blichen CD-ROM-Laufwerke kann die wiederbespielbaren Medien entweder gar nicht, oder &auml;u&szlig;erst unzuverl&auml;ssig lesen. Das abspielen von kopierten AudioCDs, also den normalen Musik-CDs f&auml;llt bei zu vielen CD-Playern im Hifibereich nahezu v&ouml;llig flach. Und auch im Bereich der DatenCDs finden Aufdrucke bei den neuen CD-ROM-Abspielern mit dem Logo "CD-RW-Disc playback" und &auml;hnliche Schriftz&uuml;ge </P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=363 ALIGN="LEFT" HSPACE=12>
<TR><TD VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=18>
<P ALIGN="CENTER"><B><FONT SIZE=1 COLOR="#ffffff">Info : CD-RW</B></FONT></TD>
</TR>
<TR><TD VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=56>
<FONT SIZE=1><P>"<B>C</B>ompact<B>D</B>isc-<B>R</B>e<B>W</B>ritable" lassen sich im Gegensatz zu CD-Rs bis zu 1000 mal neu beschreiben. Diese teureren Medien erfordern jedoch einen speziellen CD-Recorder, der f&uuml;r CD-RWs geeignet ist..</FONT></TD>
</TR>
</TABLE>
</P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>werbewirksame Aufmerksamkeit. Es wird also sogar bereits bei den gew&ouml;hnlichen CD-Laufwerken damit geworben, da&szlig; sie weit weniger Probleme mit den CD-RW-Medien haben - Das Problem ist also bekannt !</P>
<P>Ein wiederbeschreibbarer Rohling kostet zwischen 35,- und 60,- DM und da kann es sehr &auml;rgerlich sein, auf solch geballte Ladungen mit Nachteilen zu sto&szlig;en. Die erste wirklich wichtige &Uuml;berlegung vor dem Kauf des CD-Recorders sollte also auf jeden Fall schon mal sein, ob man WIRKLICH wiederbespielbare CD-Rohlinge verwenden MU&szlig; ! </P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2 ALIGN="CENTER">CD-RW-Recorder f&uuml;r mehrmals beschreibbare Medien :</H2></I></FONT>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=528>
<TR><TD WIDTH="50%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=35>
<P><B><FONT SIZE=4 COLOR="#000080">Vorteil :</P>
</B></FONT><P ALIGN="CENTER"><IMG SRC="image12.gif" WIDTH=243 HEIGHT=7></P>
<FONT COLOR="#000080"><P>M&ouml;glichkeit, spezielle Medien <B>MEHRMALS</B> zu beschreiben</P>
<P>H&ouml;here Zukunftssicherheit, die &auml;ltere Technik fr&uuml;her oder- sp&auml;ter sicherlich abl&ouml;sen wird</P>
<P>Handels&uuml;bliche CD-Rohlinge k&ouml;nnen nat&uuml;rlich ebenfalls beschrieben werden</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=35>
<B><FONT SIZE=4 COLOR="#000080"><P>Nachteil :</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=243 HEIGHT=7></P>
<FONT COLOR="#000080"><P>Spezielle CD-RW-Medien sind &uuml;ber10 x teurer, als die einmal beschreibbaren Medien (CD-R)</P>
<P>CD-Recorder teurer, als die Einfachen</P>
<P>Bespielte Medien auf &uuml;blichen CD-Abspielger&auml;ten (CD-ROM-Laufwerke und Hifi-CD-Player) oft unbrauchbar</P>
<P>Insgesamt sehr viel unzuverl&auml;ssiger, dadurch mehr "verschossene" CD-Rohlinge</FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>Haben wir uns nun f&uuml;r die preisg&uuml;nstigere Variante entschieden, da es uns nicht so sehr auf ein mehrmaliges bespielen der Rohlinge ankommt und wir auf Nummer sicher beim Schreib- und sp&auml;teren Lesevorgang gehen wollen, - so stellt sich uns auch schon die n&auml;chste Entscheidung in den Weg ... SCSI-Hostadapter, AT, 2x, 4x, 6x, 8x, Amiga-Tauglichkeit, Software, .... ??? </P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>AT-Controller oder SCSI-Hostadapter ?</H2>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Eiwei, warum k&ouml;nnen denn NEUE CD-Writer so viel billiger auf den Markt gebracht werden, als die &Auml;lteren, die immer noch angepriesen werden ? </P>
<P>Der Unterschied der Schnittstelle, an der sp&auml;ter der CD-Writer mit dem restlichen System kommunizieren soll, spielt erst neuerdings eine gro&szlig;e Rolle. H&auml;tte man eigentlich sowohl einen freien Platz f&uuml;r ein AT (oder auch EIDE) - Ger&auml;t, als auch noch an einer SCSI-Kette, so darf man erneut gr&uuml;beln, denn die wesentlich niedrigeren Preise der neueren AT-CD-Writer machen den Kauf schmackhaft. Doch wo ein erheblich niedrigerer Preis ist, ist doch bestimmt auch ein Haken, oder ??? </P>
<P>Die Antwort kann man wohl nur mit "Ja" UND "Nein" beantworten. </P>
<P>Es gibt zwischen den billigen CD-Recordern mit der AT-Schnittstelle regelrechte schwarze Schafe, aber auch f&uuml;r den AT-Controller gibt es genausogute AT-Brenner (CD-Brenner = ein weiterer gebr&auml;uchlicher Ausdruck f&uuml;r CD-Recorder), wie auf dem SCSI-Bereich. Ich werde nachher darauf noch n&auml;her eingehen, welche Unterschiede es gibt, wie sie gemessen werden und worin diese Unterschiede sich bemerkbar machen. Beispielsweise geh&ouml;ren die sehr preiswerten AT-CD-Recorder der Firma "Mitsumi" zu den sehr unzuverl&auml;ssigen Brennern, w&auml;hrend der AT-Recorder von "BTC" noch so manchen SCSI-Brenner in die Tasche steckt. Zugegeben, ein bischen Gl&uuml;ck geh&ouml;rt zu der Sache dazu und es spielen viele andere Einfl&uuml;sse beim schreiben von CD-Rohlingen eine gro&szlig;e Rolle. </P>
<P>So kann ich f&ouml;rmlich jetzt schon virtuell h&ouml;ren, wie manch Mitsumi-Eigent&uuml;mer stolz sagt, "mein Mitsumi l&auml;uft aber prima !". Tatsache ist aber, da&szlig; man die Zuverl&auml;ssigkeit direkt SEHEN kann ! Nat&uuml;rlich nicht mit dem blo&szlig;en Auge, sondern man vergleicht die gebrannte CD, also die fertige Kopie mit der Quell-, sprich der Original-CD. Hier verh&auml;lt es sich NICHT so, wie bei den bisher bekannten Datentr&auml;gern. </P>
<P>Die Datenspur ist bei kopierten CDs deutlich sichtbar und die Auslastung der Fehlerkorrektur g&auml;ngiger CD-Player ist ebenso messbar. Eine Kopie unterscheidet sich IMMER deutlich vom Original (nur optisch, nicht aber bei der normalen Verwendung - ist eine CD erst einmal erfolgreich erstellt, so l&auml;uft sie mehr oder weniger zuverl&auml;ssig auch beim lesen der Daten). Wie stark sich nun die Kopie vom Original unterscheidet, bestimmt somit auch, wie zuverl&auml;ssig die verschiedensten CD-Laufwerke sp&auml;ter die Daten auf der CD entziffern k&ouml;nnen. </P>
<P>Besonders stark macht sich das auf dem PC-Markt bemerkbar, da hier auf vielen CDs sehr rechenintensive Filme abgespielt werden. Ein solcher Film wird aber nicht in Echtzeit vom Prozessor berechnet und angezeigt, wie es beispielsweise bei Amiga-Animationen oder Szenendemos meist der Fall ist, sondern die Daten gehen DIREKT von der laufenden CD-ROM zum Prozessor, werden dort nur kurz bearbeitet und unmittelbar an die Grafikkarte geleitet, die sich dann mit dem Wullst an Daten abqu&auml;hlen darf. Hier macht sich sowohl die Qualit&auml;t und Geschwindigkeit der Peripherie deutlich bemerkbar, wie ein einwandfreies und sauberes lesen DEUTLICHER Daten. </P>
<P>Ein CD-Laufwerk ist mit einer Fehlerkorrektur versehen, die den Lesekopf des CD-Laufwerkes veranlasst, eine fehlerhaft gelesene Stelle auf der CD so oft einzulesen, bis dieses Datenst&uuml;ck fehlerfrei &uuml;bertragen ist, oder die k&uuml;nstliche Logik des Laufwerkes sagt "es hat keinen Sinn mehr mit dieser CD". Wie schon erw&auml;hnt, weicht die Qualit&auml;t der Datenspur bei gebrannten CDs deutlich vom Original ab. Diese Qualit&auml;t ist aber grunds&auml;tzlich schlechter, als beim Original und kann sogar so schwach sein, da&szlig; die Fehlerkorrektur den Lesekopf mehr auf immer derselben Stelle hin und her bewegt, als das sich das CD-Laufwerk mit der &Uuml;bertragung der Daten besch&auml;ftigen kann. Die Folge bei den rechenintensiven und impulsanten Filmsequenzen ist dann, da&szlig; der Film arg ins stottern ger&auml;t und nicht mehr schnell genug und sauber gezeigt werden kann. Eine Fehlermeldung beendet den Filmspa&szlig; bei zu undeutlicher Datenstruktur dan irgendwann entg&uuml;ltig.</P>
<P>Zur&uuml;ck zu unserer Anschlu&szlig;-Wahl ....</P>
<P>Prinzipiell ist es allgemeine Meinung, da&szlig; die CD-Brenner sehr viel sicherer &uuml;ber die SCSI-Schnittstelle arbeiten. Das w&auml;re auch durchaus erkl&auml;rbar, denn bei SCSI-Ger&auml;ten befindet sich der eigentliche Controller des jeweiligen SCSI-Ger&auml;tes direkt auf seiner eigenen Platine. Dadurch wird der Computer erheblich entlastet und ein Geschwindigkeitsvorteil wird ebenso erreicht. Bei IDE-, oder auch AT(api)-Controllern mu&szlig; ein Laufwerk, gleich ob nun ein CD-Laufwerk, oder eine Festplatte von eben diesem eexternen Controller angesteuert werden. Dh. Unser Amiga mu&szlig; sozusagen manuell &uuml;ber seine IDE-Schnittstelle dem Schreib/Lesekopf einer AT (oder eben IDE) - Festplatte genau befehlen, an welche Position er auf seiner rotierenden Platte zu schweben hat, um den Datentransfer einleiten zu k&ouml;nnen. Hierzu mu&szlig; der Hauptprozessor des Amigas eine ganze Menge Informationen mit der AT-Festplatte austauschen und &uuml;bermitteln. Bei einer SCSI-Schnittstelle ist das Prinzip anders. Hier gibt es einige SCSI-Befehle und nur diese wenigen Befehle mu&szlig; der Amiga an den Controller schicken, der unmittelbar auf der Elektronik der SCSI-Festplatte sitzt.</P>
<P>Stellt Euch diese beiden Vorgehensweisen ruhig so einfach vor, wie es sich liest. Beim AT-Controller sagt der Amiga &uuml;ber seine eigene interne Schnittstelle der dummen AT-Festplatte "Bewege Deine Lesek&ouml;pfe nach Spur xx in Sektor yy und &uuml;bermittel mir von dort die Daten bis Spur xx und Sektor yy". Ist der selbe Amiga aber mit einem SCSI-Hostadapter und einer passenden SCSI-Festplatte versorgt, so befehlt unsere Freundin lediglich "Lade Datei xzy" ! Dieser Befehl geht dann durch den SCSI-Bus direkt zum Controller auf der entsprechenden Festplatte und hier wird dieser Befehl dann in diesem Controller in die Tat umgesetzt, w&auml;hrend unser Amiga sich schon wieder um etwas ganz anderes k&uuml;mmern kann.</P>
<P>Durch eventuelle CPU (Central Processing Unit = zentrale Prozessoreinheit) - Schwankungen bzw. unterschiedliche Auslastungen k&ouml;nnen somit auch durch einen solchen Faktor keine Fehler mehr auftreten, was den SCSI-Betrieb etwas sicherer macht. Um es noch mal zu verdeutlichen .... F&auml;lschlicherweise wird die Anschlu&szlig;schnittstelle, die den Computer und die SCSI-Ger&auml;te verbindet gerne SCSI-Controller genannt ! Dieser Begriff ist schlicht und ergreifend FALSCH !</P>
<P>Der SCSI-CONTROLLER befindet sich in der Elektronik jedes angeschlossenen, einzelnen SCSI-Ger&auml;tes. Jede SCSI-Festplatte, jedes SCSI-CD-ROM-Laufwerk hat einen eigenen internen Controller. Deswegen sind die SCSI-Ger&auml;te ja auch etwas teurer in der Anschaffung gegen&uuml;ber ihrer AT-Konkurrenz !</P>
<P>Die Schnittstelle zum Computer bezeichnet man somit als SCSI-HOSTADAPTER, der keine kontrollierenden Funktionen &uuml;bernimmt ! Er verbindet nur den SCSI-Bus mit dem Rechnersystem.</P>
<P>Beim Atapi, oder auch IDE, oder auch EIDE, oder auch AT-Standart (vom Prinzip her alles das Gleiche) sitzt der Controller am Rechner und kontrolliert von dort aus &uuml;ber seine Leitungen die Festplatten, CD-Laufwerke etc. Die AT-Ger&auml;t sind OHNE eigenen Controller und daher etwas g&uuml;nstiger als vergleichbare SCSI-Ger&auml;te !</P>
<P>Nun sollte man dieses alles in der Praxis nicht &uuml;berbewerten und vor allem die neuen AT-CD-Brenner nicht mehr untersch&auml;tzen. Es gab zB. auch bei einigen CD-Brennern mit SCSI-Schnittstelle Probleme, weil diese sich manchmal nicht an den standartisierten SCSI-Befehlssatz gehalten haben. Solche Standartabweichungen f&uuml;hrten zu einigen Problemen, so da&szlig; ein CD-Brenner beispielsweise mit Audio-Daten, also dem kopieren von Musik-CDs nicht zurecht kam.</P>
<P>Und im Gegenzug wurden die AT-CD-Writer st&auml;ndig verbessert und modernisiert, denn die wenigsten Computer sind mit einem SCSI-Hostadapter ausgestattet, w&auml;hrend nahezu jeder Rechner am Markt einen IDE-Controller hat. Hier liegt also der breite Massenmarkt und somit das Geld. Zudem kann man die AT-Ger&auml;te im Prinzip etwas g&uuml;nstiger produzieren, da sie ja &uuml;ber keinen eigenen Controller verf&uuml;gen m&uuml;ssen.</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Von Jittern und BLERs&nbsp;</H2>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Am Anfang des Artikels erkl&auml;rte ich es bereits - Im Falle der CD-Rs, CD-RWs, CD-Recorder usw. sind alle Zuverl&auml;ssigkeiten und Unzuverl&auml;ssigkeiten me&szlig;- und sichtbar. Das macht es zwar eigentlich einfacher, schwarze Schafe zu erkennen und gegebenenfalls eben nicht zu kaufen, aber nichtsdestotrotz wird alles angeboten und auch verkauft, was sich innerhalb eines tolleranten Grenzwertes bewegt. </P>
<P>Das Studium diverser Testberichte &uuml;ber die aktuellen CD-Recorder und auch der Medien ist somit sehr sinnvoll, auch wenn sich besonders g&uuml;nstige Schn&auml;ppchen vor einem tummeln. Auch CD-Recorder f&uuml;r einen verh&auml;ltnism&auml;&szlig;ig g&uuml;nstigen Anschaffungspreis von um die 500,- DM werden schnell zum teuren Vergn&uuml;gen, wenn man anschlie&szlig;end die H&auml;lfte, der damit gebrannten CDs nur noch zum basteln von Lampen und Uhren verwenden kann.</P>
<P>Es ist ungemein wichtig, da&szlig; die Daten m&ouml;glichst sauber und scharf in die hitzeempfindliche Schicht in dem Kunststoffmantel der CD-R gebrannt werden. Diese Daten auf einer CD-ROM sind in Form mikroskopisch kleiner Vertiefungen gespeichert. Diese sehr unterschiedlichen Vertiefungen werden auch als "Pits" bezeichnet. Diese Pits werden vom CD-Recorder optisch nachgebaut und in die Schicht der CD-R gebrannt.</P>
<P>Arbeitet nun ein CD-Recorder nicht besonders genau, so weicht die L&auml;nge dieser rekonstruierten Pits vom Quellmuster stark ab. Und genau diese Schwankungen der Pits-L&auml;nge werden als "Jitter" bezeichnet. Die Ma&szlig;einheit f&uuml;r Jitter sind stets in Nanosekunden angegeben.</P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=363 ALIGN="LEFT" HSPACE=12>
<TR><TD VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=18>
<P ALIGN="CENTER"><B><FONT SIZE=1 COLOR="#ffffff">Info : Jitter</B></FONT></TD>
</TR>
<TR><TD VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=56>
<P>Sind die Abweichungs-Schwankungen der "pits" einer kopierten CD-ROM gegen&uuml;ber dem Original gemessen in Nanosekunden (ns). 1 ns = 1 Milliardstelsekunde. Laut CD-Norm darf ein maximaler Wert bei 35 ns bemessen sein</TD>
</TR>
</TABLE>
</P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>Gl&uuml;cklicherweise gibt es eine CD-Norm, an der sich alle Hersteller zu orientieren haben und selbstverst&auml;ndlich sind hiermit auch die Grenzwerte der Jitter genormt und schwarz auf wei&szlig; festgelegt. Erlaubt ist nach dieser CD-Norm ein Jitter-Wert von maximale 35 ns. Liegt der tats&auml;chliche Wert h&ouml;her, so kann es beim lesen der CD zu Fehlern kommen, die bis zur Unbrauchbarkeit der CD reichen k&ouml;nnen. </B><I>(Achtung ! - Hersteller werden NICHT kontrolliert, ob ihre Produkte die Grenzwerte einhalten. Das geschieht auf mehr oder weniger freiwilliger Basis.)</P>
</I><B><P>Zudem eignen sich CDs mit zuvielen Jittern auch nicht f&uuml;r eine anschlie&szlig;ende Massenvervielf&auml;ltigung in einem CD-Presswerk, da bei diesem Proze&szlig; noch unweigerlich weitere Jitter hinzu kommen. Dadurch kann es auch vorkommen, da&szlig; selbst neue CD-ROMs aus dem kommerziellen Markt Fehler haben k&ouml;nnen. Gl&uuml;cklicherweise sind diese CDs im Presswerk aber strengen Pr&uuml;fungen unterzogen, um diesen &Auml;rger m&ouml;glichst gering zu halten.</P>
<P>Tatsache ist jedoch, da&szlig; auch im CD-ROM-Bereich der Grundsatz gilt, da&szlig; eine Kopie niemals besser als sein Original sein kann. So kann eine wieder und wieder kopierte CD irgendwann einmal unbrauchbar sein, weil bei jedem Kopiervorgang neue Jitter hinzukamen und die Datenstruktur immer unsch&auml;rfer beim Lesevorgang gemacht wurden. Da hilft auch das unmissverst&auml;ndliche digitale Datenformat nicht mehr.</P>
<P>Wie deutlich sich eine kopierte CD vom Original unterscheidet, k&ouml;nnen wir uns in der folgenden Abbildung ganz genau ansehen ....</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Abbildung</H2>
</I></FONT><FONT COLOR="#00ffff"><H2>Das Original und die gebrannte Kopie einer CD-ROM</H2>
<P>&nbsp;</P>
<B><P>Sehen wir uns als erstes einmal die Original-CD-ROM unter dem Mikroskop an ....</P>
</B></FONT><P><IMG SRC="cd-master.jpg" WIDTH=213 HEIGHT=142><FONT SIZE=2 COLOR="#00ffff">Abbildung 1 : eine Original-Daten-CD-ROM</P>
</FONT><B><FONT COLOR="#00ffff"><P>Und nun folgt gleich noch die davon gebrannte Kopie, um einen unmittelbaren Vergleich zu bekommen ....</P>
</B></FONT><P><IMG SRC="cd-copy.jpg" WIDTH=220 HEIGHT=143><FONT SIZE=2 COLOR="#00ffff">Abbildung 2 : .... und die davon gebrannte Kopie</P>
</FONT><B><FONT COLOR="#00ffff"><P>Eigentlich ist der Unterschied dieser beiden Bilder so offensichtlich, da&szlig; ein Kommentar &uuml;berfl&uuml;ssig w&auml;re. Man erkennt hier sehr deutlich, wie sehr eine CD-Kopie vom Original abweicht. Es grenzt schon fast an ein Wunder, da&szlig; ein CD-Laufwerk diese Qualit&auml;tsminderung noch so gut weg steckt. Dabei handelt es sich sogar noch um eine erfolgreich kopierte CD-ROM in Abbildung zwei. Ich denke, Ihr k&ouml;nnt Euch gut vorstellen, warum eine noch undeutlicher geschriebene CD auf vielen CD-Laufwerken anschlie&szlig;end Schwierigkeiten machen kann. Die Kanten sind bei weitem nicht mehr so scharf und klar in die Beschichtung gebrannt und wenn dieser Schmiereffekt &Uuml;berhand nimmt, wird die kopierte CD zum Kunststoff-Sonderm&uuml;ll.</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<H2>&nbsp;<I><FONT COLOR="#ffffff">Aktuelle CD-Brenner im Vergleich</H2>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Sehen wir uns doch mal ein paar CD-Writer an, die halbwegs aktuell auf dem gro&szlig;en Markt angeboten werden.</P>
<P>Beginnen wir mit den neuen Brennern f&uuml;r die ....</P>
</B></FONT><FONT COLOR="#ffffff"><H2>AT-Schnittstelle</H2>
</FONT><B><I><FONT SIZE=4 COLOR="#ffffff"><P>&nbsp;</P>
<P>Yamaha CRW- 4001 T </I>"... vielseitig und bew&auml;hrt"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Seit jeher baut die Firma Yamaha hervorragende CD-Brenner, die sich im Laufe der Zeit sehr bew&auml;hrt haben. Fragt man einen Yamaha-Besitzer nach seiner Zufriedenheit, so kommt eigentlich stets der Satz ".... ich hatte nie damit Probleme", oder ".... l&auml;uft wie am ersten Tag". Das ein Yamaha-CD-Brenner mal Ausf&auml;lle hat, ist eher un&uuml;blich und l&auml;&szlig;t sich mit der Wahl der richtigen Medien weiter minimieren.</P>
<P>Mit dem 4001 T will Yamaha jetzt auch auf dem AT-Brenner-Markt t&uuml;chtig mitmischen. Leider kann hier der 4001 T noch nicht als bestes Modell bezeichnet werden, was bei den SCSI-Brennern von Yamaha nicht so schnell passieren k&ouml;nnte. Bei verschiedenen Test-Artikeln stellte sich beim Lesevorgang eine kleine Unzuverl&auml;ssigkeit heraus. Alle Schreibvorg&auml;nge hingegen waren aber durchschnittlich sehr zufriedenstellend und vor allem sehr schnell.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Der noch junge Yamaha 4001 T ist sehr gen&uuml;gsam und nicht sonderlich w&auml;hlerisch, was die CD-R- und CD-RW-Medien angeht. Er ist bei keinem Rohling &uuml;ber den maximalen Jitterwert von 35 ns gekommen und konnte alle Medien bis auf eine getestete Marke erfolgreich beschreiben. Es wird besonders im Zusammenhang mit dem 4001 T vor den Rohlingen der Marke "Best Media" gewarnt. Diese Rohlinge waren in den Tests die Einzigen, wo der 4001 T sogar den Schreibvorgang g&auml;nzlich abgebrochen hat. Den geringsten Jitterwert hatte der Yamaha bei den Rohlingen der Marke "Ricoh".</P>
<P>Im gro&szlig;en und Ganzen w&auml;re der Yamaha 4001 T mit einem "gut" treffend benotet. Der Kauf ist empfehlenswert, wenn der Brenner im Preis noch etwas gesenkt w&uuml;rde. Ich habe ihn in guten Angeboten bereits bei 799,- DM gesehen, wo er auch langsam interessant wird. Sehr viel mehr w&uuml;rde ich f&uuml;r den 4001 T jedoch nicht ausgeben, denn es gibt noch Bessere, die g&uuml;nstiger sind ....</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>&nbsp;</P>
<P>BTC BCE 62IE </I>"Neu, preisg&uuml;nstig und sehr oft Testsieger"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Wer kennt die Firma BTC ? - Tja, mir war sie auch bis vor etwa zwei Monaten unbekannt. Dabei lohnt sich ein Blick auf deren BCE62IE sehr. Mir ist kein Testurteil bekannt, wo dieser AT-CD-Brenner mit "nur" einem GUT bestanden h&auml;tte. So f&uuml;hrt er oft genug den Platz 1 an und wird von allen Fachmagazinen sehr empfohlen.</P>
<P>Auch dieser CD-Brenner wird an die AT-Schnittstelle im Rechner angeschlossen. Er verf&uuml;gt &uuml;ber zwei Bedientasten an seiner Frontseite, womit sich am einfachsten auch eingelegte MusikCDs direkt am Ger&auml;t steuern lassen. Gegen&uuml;ber dem Yamaha 4001 T hat der BTC-Brenner nur den merkbaren Nachteil, da&szlig; er seine Medien langsamer beschreibt. So hat er eine 650 MByte-belegte CD-ROM in knapp unter 40 Minuten kopiert, wozu der schnelle Yamaha nur die halbe Zeit ben&ouml;tigt.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Auch der BTC schluckt nahezu alle am Markt verkauften Medien. Alle Schreibvorg&auml;nge verliefen mehr oder weniger erfolgreich. Zwar wurde kein einziger Schreibvorgang abgebrochen und alle CD-Rs liefen hinterher, - jedoch kam es bei zwei Rohlingen zu Jitterwert-&Uuml;berschreitungen. W&auml;hrend der "Kodak"-Rohling mit 36 ns den Grenzwert nur leicht &uuml;berschritten hat, gab es bei den "Best Media" mit 46 ns deutliche Jitterprobleme. Am liebsten futtert der BTC die Rohlinge von "Ricoh" und "Mitsui".</P>
<P>Am interessantesten bei den sehr guten Leistungen d&uuml;rfte beim BTC wohl auch der g&uuml;nstige Preis sein. Er ist mittlerweile um die 600,- DM zu bekommen, was bei diesen Testurteilen mehr als fair sein d&uuml;rfte. </P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Hewlett Packard Surestore 7100i </I>"Der ewige Konkurrent"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Hewlett Packard, kurz HP genannt, versucht schon immer in Spitzenpositionen bei dem lukrativen CD-Brenner-Gesch&auml;ft mitzumischen. Der wirkliche Durchbruch ist zwar noch nicht gelungen, aber immerhin sind die CD-Brenner dieser Firma mit &uuml;berzeugender Qualit&auml;t aufgefallen. Lediglich die Preispolitik sollte bei HP mal n&auml;her durchdacht werden.</P>
<P>Immerhin, mit dem 7100i hat HP es geschafft, im etwas preisg&uuml;nstigeren AT-Bereich einen durchweg guten CD-Brenner anzubieten. Leider fiel der 7100i ebenfalls mit einer etwas unzuverl&auml;ssigen Fehlerkorrektur beim Lesevorgang auf. Ansonsten ist auch der 7100i von HP eine empfehlenswerte Alternative.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Der HP 7100i kommt bei fast allen Rohlingen relativ nahe an den Jitter-Grenzwert heran. Solange dieser Wert nicht &uuml;berschritten wird, ist dieses noch kein Grund f&uuml;r Bedenken, allerdings sollte man beim 7100i vielleicht doch noch etwas mehr auf die Wahl der richtigen Medien achten. Der Schreibvorgang klappte am besten bei den Medien von "Ricoh" und "Mitsui". &Uuml;berschritten wurde der Jitter-Grenzwert bei den "TDK", "Verbatim", "Thats", "Kodak" und (wie sollte es anders sein ?) den "Best Media"-Rohlingen !</P>
<P>Vergleicht man den 7100i mit dem oben erw&auml;hnten BTC-Brenner, so erscheint einem der Preis von ca. 750,- DM noch etwas zu hoch. Findet man den AT-Brenner von Hewlett Packard deutlich unter 700,- DM im Angebot, so bereuht man seinen Kauf aber sicherlich nicht.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Philips CDD 3610 </I>"Die Jitter-Katastrophe"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Philips baut seit eh und je erfolgreich CD-Brenner. Auch am Amiga findet man die alten bekannten "2000" und "2600"-SCSI-Brenner h&auml;ufiger. Noch dazu wurden diese Brenner oft von anderen "Herstellern" gekauft, ein neues Geh&auml;use umzu gebaut und mit anderer Bezeichnung unter eigenem Logo angeboten. Andere Hersteller erwarben Lizensen, um diese Modelle nachzubauen. Philips war schon immer &auml;u&szlig;erst innovativ mit seiner CD-Technologie. </P>
<P>Das mu&szlig; aber nicht bedeuten, da&szlig; die Brenner von Philips immer zur besten Wahl geh&ouml;rten. Im Gegenteil, - eigentlich gab es schon immer kleinere Problemchen. Auch der neue Versuch von Philips, mit dem 3610 im AT-Bereich den Umsatz zu steigern, ist wohl am besten gegeben, wenn man diesen Brenner erheblich g&uuml;nstiger anbieten w&uuml;rde. Im Verh&auml;ltnis zu seinen Leistungen ist er n&auml;mlich noch zu teuer.</P>
<P>Unzuverl&auml;ssig sind die Lesevorg&auml;nge und auch bei fast allen Medien die Schreibvorg&auml;nge. Zu oft ger&auml;t der 3610 mit den getesteten Medien noch &uuml;ber die Jitter-Grenzen der CD-Norm. Es gab zwar keine g&auml;nzlichen Schreibabbr&uuml;che, aber die Pits der Kopien wichen einfach zu sehr von den Original-CDs ab.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Der CDD3610 konnte nur bei einem, der verwendeten Rohlingen innerhalb der Toleranz bleiben. Dieser Rohling kam, man ahnt es schon von "Ricoh". Mit knapp 60 ns stand der "Best Media"-Rohling am Rande der Unbrauchbarkeit ganz zuletzt in der Wahl des richtigen Rohlings. Aber auch Medien, wie "TDK", "Pioneer", "Verbatim", "Thats", "Kodak" und "Mitsui" wollten nicht unterhalb der magischen 35-ns-Grenze bleiben.</P>
<P>Zuletzt sah ich den CDD 3610 noch f&uuml;r 779,- DM, was meiner Meinung nach eindeutig zu teuer f&uuml;r diesen Brenner ist. Wenn er schon nicht mit wirklich guter Leistung begeistern kann, so l&auml;&szlig;t er sich eigentlich nur als "Mitsumi"-Konkurrenz nehmen, aber hierf&uuml;r ist er preislich noch indiskutabel. F&uuml;r ein noch so junges Modell hat der CDD 3610 deutlich zu viele Jitter-Probleme. Wer den 3610 bereits sein eigen nennt, kann der Unzuverl&auml;ssigkeit am besten mit der richtigen Wahl der Rohlinge entgegenwirken. Hier trifft die Wahl zwangsl&auml;ufig auf die hervorragenden "Ricoh"-Rohlinge.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Mitsumi CR-2801 TE </I>"Preiswert, aber nicht billig ?"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Mitsumi ! - Dieser Firma kann man vor allem eines verdanken. Sie hat dem Markt schon immer den Preis diktiert und somit daf&uuml;r gesorgt, da&szlig; CD-Technik auch f&uuml;r Nichtprofis bezahlbar wurden. Auch CD-Brenner von Mitsumi findet man immer im untersten Preissegment. Wof&uuml;r Mitsumi leider weniger gut bekannt wurde, war mit einer Langlebigkeit und guter Qualit&auml;t ihrer Produkte. Auch hier ist der CR 2801 TE der preisg&uuml;nstigste AT-Brenner. Dabei ist er im Verh&auml;ltnis zu seinem Preis nicht einmal die schlechteste Wahl.</P>
<P>Der CR 2801 TE kann die CD-RWs zwar anstandslos lesen, aber nicht beschreiben. (Bis hierhin hatten wir in unserer &Uuml;bersicht alles NUR CD-Writer, die auch mit dem beschreiben von CD-RW, also den wiederbeschreibbaren Medien zurecht kamen.) Alle Schreibvorg&auml;nge auf CD-Rs, also EINMAL beschreibbaren Rohlingen verliefen bis auf eine Ausnahme beim Mitsumi einwandfrei.</P>
<I><P>&nbsp;</P>
<P>Bevorzugte Medien</P>
</I><P>Wie erw&auml;hnt, - bis auf ein einziges mal wurden die Grenzwerte der CD-Norm nicht &uuml;berschritten. Und schaut man sich die anderen Brenner an, so darf man dem Mitsumi-Brenner diesen einen Fehlschlag nicht einmal &uuml;bel nehmen. Lediglich bei unserer h&auml;rtesten Nu&szlig;, der "Best Media" bi&szlig; sich auch der CR 2801 TE die Z&auml;hne - &auml;h Laserstrahlen aus. "Pioneer" und "Verbatim" mag der Mitsumi am liebsten, was man anhand der geringsten Jitterwerte bemerkt.</P>
<P>Der AT-Mitsumi ist mit unter 500,- DM der Preisg&uuml;nstigste und hierbei nicht einmal eine schlechte Wahl. Wer allerdings die Firma "Mitsumi" schon etwas besser kennt, der weis auch, da&szlig; es ab einem bestimmten Alter des Brenners mit relativer Wahrscheinlichkeit zu Verschle&szlig;erscheinungen kommen wird. Auch die weniger gute Verarbeitung verwundert bei diesem g&uuml;nstigen Preis kaum.</P>
<P>&nbsp;</P>
</B></FONT><U><FONT COLOR="#ffffff"><H2>SCSI-Schnittstelle</H2>
</U></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Teac CD-R55S </I>"Schnell, zuverl&auml;ssig und teuer"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Ein Teac-Brenner hat bei den Amiga-Usern scheinbar noch nicht so sehr die Beachtung gefunden, die ihm eigentlich geb&uuml;hrt. In unz&auml;hligen Tests haben die Brenner dieses Herstellers jedoch einen durchweg positiven Eindruck hinterlassen. Der CD-R55S ist in unserem &Uuml;berblick der Erste f&uuml;r unsere SCSI-Schnittstellen am Amiga.</P>
<P>Der Teac arbeitet mit den selben rasanten Geschwindigkeiten, wie unser genannte Yamaha-AT-Brenner und erledigt hierbei alle Vorg&auml;nge mit hoher Zuverl&auml;ssigkeit. Selbst die Fehlerkorrektur beim lesen, die sonst bei CD-Writern oft vernachl&auml;ssigt wird, arbeitet pr&auml;zise und sicher. Ein kleiner Vorteil gegen&uuml;ber dem Yamaha !</P>
<P>Auch bei den gemessenen Jitter-Werten verh&auml;lt er sich &auml;hnlich, wie Yamahas AT-Konkurrent.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Auch der SCSI-Teac sagt zum "Best Media"-Medium schlicht und ergreifen "bahh" und spuckt den Rohling unfertig wieder aus. Der Grenzwert wird danach nur noch beim "Thats / Tayo-Yuden"-Rohling mit 39 ns &uuml;berschritten. Auch ihm gef&auml;llt zun&auml;chst ein "Ricoh"- und danach ein "TDK"-Rohling am besten.</P>
<P>Ein Teac-CD-Recorder ist kaum eine schlechte Wahl. Lediglich der hohe Preis um die 850,- DM w&auml;re noch bedenklich teuer. Aber auch der CD-R55S wurde bereits deutlich g&uuml;nstiger gesehen. Ein Preis unterhalb der 700,- DM-Grenze w&auml;re sicherlich als g&uuml;nstig zu bezeichnen.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Plasmon CDR480i </I>"Unbekannt, teuer und es gibt Besseres"</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Kennt Ihr den Plasmon CDR480i ? Nun, auch Plasmon baute seine CD-Writer immer auf Basis der bekannten Philips-Modelle. Somit werkelt dieser Writer auch mit den entsprechenden Philips-Treibern in den Brennersoftware-Produkten, auf die wir auch noch zu sprechen kommen.</P>
<P>Die schon bei Philips genannten Problemchen finden sich scheinbar ebenfalls beim CDR480i. Dabei ist er auch noch eigentlich unberechtigt zu teuer. Er werkelt zwar beinahe so flott, wie der voran gelistete Teac-SCSI-Brenner beim Schreibvorgang, liest die Daten aber langsamer und unzuverl&auml;ssiger.</P>
<I><P>Bevorzugte Medien</P>
</I><P>Obwohl es bei den Tests nicht zu Schreibabbr&uuml;chen kam, so wurden doch bei vielen Rohlingen die Jitter-Grenzwerte deutlich &uuml;berschritten. Sorgenfrei kann ein CDR480i-Besitzer die Rohlinge "Mitsui" (30ns), "Kodak" (33ns) und "Ricoh" (34ns) nehmen. Die gr&ouml;&szlig;ten Jitterwerte gab es bei "Best Media" (45ns), "Thats" (43ns), "TDK" (41ns) und den anderen schon mal erw&auml;hnten Rohlingen, die alle zwischen 36 und 40 ns liegen.</P>
<P>W&auml;re der Plasmon nicht zu teuer, so k&ouml;nnte er durchaus noch empfehlenswert sein, aber sein Preis von 750 - 800,- DM ist im Bezug zu seinen Leistungen noch viel zu teuer. Da die meisten Plasmon-Writer auf den erfolgreichen Philips-Writern basieren, d&uuml;rfte es zumindest keine Probleme bei einem Defekt geben, da hier eventuelle Ersatrzteile aus der Philipspalette genommen werden k&ouml;nnen und m&uuml;ssen.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Fazit :</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Am &uuml;berzeugensten finde ich die Leistungsdaten des BTC BCE621IE. Ganz besonders, wenn man den &auml;u&szlig;erst fairen Preis ber&uuml;cksichtigt, geh&ouml;rt er sicherlich zur ersten Wahl. Auch in optischer Hinsicht macht dieser Brenner eine gute Figur und zeigt, da&szlig; gute Qualit&auml;t und solide Verarbeitung kein Verm&ouml;gen kosten mu&szlig;.</P>
<P>Um einiges teurer, mit &auml;hnlich guter Leistung &uuml;berzeugen die Modelle von Yamaha und Hewlett Packard im AT-Bereich und der Teac CD-R55S unter den SCSI-Brennern. Hier bekommt man zu den guten Leistungsmerkmalen auch noch das gute Markenzeichen der drei bekannten Hersteller dazu. Aber es wird langsam Zeit, da&szlig; die Preise noch etwas atraktiver werden, denn zur Zeit ist noch nicht einzusehen, warum man nicht zu einem erheblich g&uuml;nstigeren CD-Recorder greifen sollte.</P>
<P>Auch der CD-Brenner von Mitsumi ist gerade im Bezug auf seinen Top-g&uuml;nstigen Preis keine schlechte Wahl. Ich pers&ouml;nlich w&uuml;rde ihn mir im Leben nicht kaufen, da ich bislang nahezu NUR schlechte Erfahrungen mit &auml;lteren CD-Laufwerken von Mitsumi habe. Sie sind laut, von schlechter Verarbeitung und nicht so langlebig. Meine Meinung wurde aber schon sehr, sehr oft best&auml;tigt. Der Preis wird diesen AT-Brenner jedoch garantiert wieder so manchem User den Einstieg in die Brennerei erm&ouml;glichen.</P>
<P>Es gibt noch unz&auml;hlige &auml;ltere CD-Recorder auf dem Markt. Auch &auml;ltere Ger&auml;te versehen zuverl&auml;ssig ihren Dienst und sind wegen geringeren Geschwindigkeiten oft noch erheblich g&uuml;nstiger. Hat man noch eine freie Stelle in seiner SCSI-Kette, so lohnt sich sicherlich auch mancher Blick auf den Gebrauchtmarkt.</P>
<P>Bis Ihr das hier lest, haben wieder etliche neuere Modelle den Markt &uuml;berschw&auml;mmt, oder die Preise sind abermals in den Keller gegangen. So ist es unbedingt erforderlich, sich selbst noch einmal die eine, oder andere Testzeitschrift zu kaufen, um sich neu zu orientieren. Alle CD-Recorder im Test haten einen Mangel gemeinsam, - es gab von jedem Hersteller nur 12 Monate Garantie, was bei diesen Geldwerten nicht gerade viel ist. Also schaut Euch um, denn so kann noch soviel Geld gespart werden, da&szlig; die Software f&uuml;r den Amiga wieder &uuml;brig ist.</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#ffffff"><H2>Medien im &Uuml;berblick</H2>
</FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Ist man eigentlich auf der sicheren Seite, wenn man sich die teuersten Rohlinge kauft ? H&ouml;rt sich darauf kopierte Musik besser an ? Oder werden die Daten besser &uuml;bertragen ?</P>
<P>Eigentlich denke ich, da&szlig; man auch schon im Writer-&Uuml;berblick so manchen Schlu&szlig; &uuml;ber die Medien heraus ziehen konnte.</P>
<P>Es ist vollkommen unsinnig, mehr als 4,oo DM auszugeben. Ich pers&ouml;nlich w&uuml;rde nicht einmal mehr als 3,oo DM ausgeben und das ist auch &uuml;berhaupt nicht notwendig. Doch gibt es nun wirklich einen Unterschied ?</P>
<P>Wie gehabt kann man nicht von &auml;u&szlig;eren Merkmalen ausgehen, auch wenn unz&auml;hlige User das gerne behaupten. Egal, ob die Scheibe nun in wundersch&ouml;nen bunten Farben, oder aber einfach nur gold oder silber im Licht schimmert. Viel entscheidener ist, wie gut der eigene Brenner mit einer Marke zurecht kommt.</P>
<P>Prinzipiell bevorzugt jeder Brenner ein anderes "Men&uuml;" an CD-Rohlingen. Aber Ihr konntet es ja bei den getesteten Brennern schon sehr deutlich erkennen ....</P>
<U><P>Finger weg von "Best Media" !!!</P>
</U><P>Ich w&uuml;nschte, ich h&auml;tte diesen Artikel schon fr&uuml;her geschrieben, bzw. mich mal etwas fr&uuml;her &uuml;ber den Markt informiert, dann h&auml;tte ich viel Geld, Schwei&szlig; und eine Menge &Auml;rger gespart. Meine ersten CD-Rohlinge waren die "Ricoh CD-R74" zu einem Preis von 2,98 DM. Herrlich war das, - nicht eine einzige CD-R ging beim Schreibvorgang daneben. Jeder Schreibvorgang war ein voller Erfolg und ich h&auml;tte nie f&uuml;r m&ouml;glich gehalten, da&szlig; die Unterschiede der CD-R-Marken hier so entscheidend sein w&uuml;rden. Nat&uuml;rlich waren die f&uuml;nf Ricohs schnell aufgebraucht und die Brennerei machte soviel Spa&szlig;, da&szlig; ich mich nach Nachschub umsah. Bei unseren lokalen H&auml;ndlern waren mir die Rohlinge jedoch noch zu teuer. So war ich umso erfreuter, beim Pro-Markt in der Gro&szlig;stadt dann endlich wieder palettenweise Rohlinge f&uuml;r 2,99 DM pro St&uuml;ck zu sehen.</P>
<P>Mir sicher, da&szlig; auch gr&ouml;&szlig;ere Vor&auml;te einmal aufgebraucht werden, schlug ich erbarmungslos zu und kaufte davon gleich zwanzig St&uuml;ck. Schon gleich der erste Brennvorgang auf die neuen Rohlinge ging in die Hose und die CD anschlie&szlig;end zu einem Freund. Immerhin konnte er sich noch dar&uuml;ber freuen, um Lampen daraus zu basteln. &Uuml;bertrieben geschrieben k&ouml;nnte er mittlerweile eine ganze Lampenabteilung aufmachen. Ich glaube, fast die H&auml;lfte der Best-Media-CD-Rs fanden auf diesen Weg ihre traurige Zweckentfremdung. F&uuml;r mich steht klar fest, NIE wieder Rohlinge dieser Marke. Wenn IHR jedoch nicht die Finger davon lassen k&ouml;nnt, dann tut Euch einen Gefallen und nehmt erst mal nur eine einzelne CD-R zum testen an Eurem CD-Recorder.</P>
<P>Ich liste Euch mal in Kurzform die getesteten Rohlinge auf ....</P></B></FONT>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=538>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3>
<P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#008000" HEIGHT=3>
<B><FONT SIZE=5 COLOR="#ffff00"><P>Gut</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#00ff00" HEIGHT=3>
<B><FONT SIZE=5><P>Ricoh CD-R74</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>Mitsui Gold 74</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>Kodak Writeable CD</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>TDK CD-R74</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>Verbatim Datalife plus</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>Pioneer CDM-V74S</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ffff00" HEIGHT=3>
<B><FONT SIZE=5><P>Befriedigend</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=3>
<B><FONT SIZE=5><P>That´s CDR-74/670T</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#800000" HEIGHT=3>
<B><FONT SIZE=5 COLOR="#ff0000"><P>Mangelhaft</B></FONT></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#000000" HEIGHT=3>
<B><FONT SIZE=5 COLOR="#ffffff"><P>Best Media</B></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
<TR><TD WIDTH="9%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="30%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="51%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
<TD WIDTH="11%" VALIGN="TOP" BGCOLOR="#ff0000" HEIGHT=3><P></P></TD>
</TR>
</TABLE>

<B><FONT SIZE=4 COLOR="#00ffff"><P>Wie gesagt, ich kann diesen Testurteilen ausnahmsweise mal vollst&auml;ndig zustimmen. Ich habe bislang ausprobiert, "Ricoh" 5 St&uuml;ck, "TDK" 20 St&uuml;ck, "Best Media" 20 St&uuml;ck, "That´s Write" 10 St&uuml;ck, "TraxData" 10 St&uuml;ck. Die Ricoh machten absolut &uuml;berhaupt keine Probleme, von den Best Media kann ich wohl die H&auml;lfte wegwerfen und bei den anderen Marken gab es nur gelegentlich mal ein/zwei Aussetzer. Also wenn Ihr mal die Ricoh seht, - zugreifen !!!</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#ffffff"><H1>CDs brennen mit dem AMIGA</H1>
</FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>Was braucht man eigentlich alles, wenn man mit dem Amiga eigene CDs erstellen m&ouml;chte ?</P>
<P>Zum kopieren einer fertigen CD (Vorsicht, auch hier herrscht fast immer ein Urheberschutzrecht !) gen&uuml;gt eigentlich ein CD-ROM-Laufwerk, welches nicht zu langsam sein sollte. Ein Laufwerk mit vierfacher Geschwindigkeit gen&uuml;gt aber in den meisten F&auml;llen schon. Dann noch der CD-Recorder, eine freie CD-R und die Software zum kopieren.</P>
<P>Bei der Software gen&uuml;gt bereits eine Demoversion von zB. Burn-it, oder aber MakeCD, um CDs ganz einfach nur komplett zu kopieren. Diese Demoversionen gibt es auf unz&auml;hligen PD-CD-Roms und direkt im Aminet. Bei MusikCDs sind eventuelle Einschr&auml;nkungen eingebaut, so da&szlig; es beispielsweise nur m&ouml;glich ist, bis zu 10 Titel zu kopieren. Hat eine MusikCD nun aber 17 Titel, so k&ouml;nnen logischerweise sieben "Tracks", sprich Musiktitel nicht mit kopiert werden. Hier hilft dann nur noch der Kauf einer Vollversion weiter. DatenCDs hingegen k&ouml;nnen komplett kopiert werden, da sie in der Regel mit nur einem "Track" geschrieben werden.</P>
<P>Die beiden Topfavoriten f&uuml;r den Amiga sind auch ganz klar die beiden Brennmeister "Make CD" von Patrick Ohly ( </B></FONT><A HREF="mailto:Patrick@core.de"><FONT SIZE=5>Patrick@core.de</FONT></A><B><FONT SIZE=4 COLOR="#00ffff"> ) und Angela Schmidt ( </B></FONT><A HREF="mailto:Angela@core.de"><FONT SIZE=5>Angela@core.de</FONT></A><B><FONT SIZE=4 COLOR="#00ffff"> ). Man kann die Beiden auch so anschreiben, da&szlig; gleich Beide eine Email empfangen k&ouml;nnen unter </B></FONT><A HREF="mailto:MakeCD@core.de"><FONT SIZE=5>MakeCD@core.de</FONT></A><B><FONT SIZE=4 COLOR="#00ffff"> . Die kommerzielle Distribution von MakeCD haben au&szlig;erdem noch die Profis von Oberland Computer hier in Deutschland &uuml;bernommen. MakeCD ist erheblich g&uuml;nstiger, als die ebenso erfolgreiche Konkurrenz "Burn it", macht aber optisch nicht einen so professionellen Eindruck.</P>
<P>Burn it hingegen kann bei allen g&auml;ngigen H&auml;ndlern, oder direkt bei Titan Computer in Bremen bestellt werden. So oder so, auf jeden Fall sollte man sich unbedingt vorher die Demoversionen zu den beiden Programmen ansehen, um seine Wahl zu treffen. Mit beiden Brennmeistern l&auml;&szlig;t sich, wenn auch mit leichten Einschr&auml;nkungen schon gut arbeiten.</P>
<P>Nat&uuml;rlich m&ouml;chte man fr&uuml;her oder sp&auml;ter seinen teuer erworbenen CD-Brenner effektiver nutzen, um nur damit komplette CDs zu kopieren. Doch um eine CD-ROM selbst zusammen zustellen, m&uuml;ssen wir ein wenig mehr beachten.</P>
<P>Die Dateisysteme einer CD und einer Festplatte sind unterschiedlich, wie sie unterschiedlicher kaum sein k&ouml;nnten. Somit mu&szlig; erst das zB. FastFileSystem einer Amiga-Festplatte m&uuml;hseelig ins ISO-Format einer CD &uuml;bersetzt werden. Das kostet nat&uuml;rlich Rechenzeit, was beim gleichzeitig laufenden Brennvorgang zu kritischen Situationen f&uuml;hren kann. Das ISO-Format der CD verf&uuml;gt &uuml;ber einzelne Tracks, zu deutsch Spuren. Rei&szlig;t der Datenstrom beim Brennvorgang auf der CD-R auch nur ein einziges mal kurz ab, so kann diese Spur nicht mehr verwendet werden. Nach Murphys Gesetzen rei&szlig;t ein solcher Track aber nat&uuml;rlich immer erst bei etwa 645 &uuml;bertragenen Megabytes ab, so da&szlig; der Rest, also der noch freie Raum auf der CD-R ebenfalls nicht mehr sinnvoll nutzbar ist.</P>
<P>Besch&auml;ftigen wir unseren Amiga nun damit, Daten von der Festplatte im FFS zu lesen, sie ins ISO-Format zu bringen und dann gekonnt wieder auf der CD-R zu schreiben, so sind solche Datenflu&szlig;-Abrisse weit mehr wahrscheinlich, als wenn die Daten bereits im ben&ouml;tigtem Format auf der Festplatte gewartet h&auml;tten.</P>
<P>F&uuml;r diesen Zweck kann man mit der Brennsoftware sogenannte Imagefiles erzeugen. Hier werden die Daten bereits in ihrem Track fertig zum brennen abgespeichert. Beim Brennvorgang kann ein solcher Track dann einfach &uuml;bertragen werden und mu&szlig; nicht erst "&uuml;bersetzt" werden. Dieser Vorgang ist erheblich sicherer und schont durch niedrigsten CD-R-Verschlei&szlig; unseren Geldbeutel.</P>
<P>Der Nachteil ist aber auch klar, wir brauchen t&uuml;chtig viel Platz auf unserer Festplatte. Der Idealfall w&auml;ren noch wenigstens zweimal 650 MB Platz auf der Festplatte. Die ersten 650 MB k&ouml;nnen wir zum zusammenstellen der Daten f&uuml;r unsere sp&auml;tere CD gut gebrauchen und ein zweites mal brauchen wir soviel Platz, um dann von unseren erstellten Daten ein Imagefile zu erzeugen, da&szlig; dann problemlos auf eine leere CD-R geschrieben werden kann.</P>
<P>Bei den heutigen Festplattenpreisen sollte ein solcher Platzbedarf aber nur ein kleineres Problem sein. Locker &uuml;ber drei GigaByte kosten heute nur noch selten weit &uuml;ber 300,- DM.</P>
<P>Hat man nun viel Festplattenplatz, einen guten CD-Recorder, ebenso gute CD-Medien und noch die passende Software, so steht dem neuen Hobby nichts mehr im Wege. Endlich k&ouml;nnt Ihr selbst einmal in die Rolle eines Herstellers schl&uuml;pfen, - eigene Musiksampler mixen, eigene PD-CD-ROMs zusammen stellen, oder einfach auch nur mal eben ein aktuelles Backup Eurer wichtigen Festplattenpartitionen erstellen.</P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=509>
<TR><TD VALIGN="TOP" BGCOLOR="#000080" HEIGHT=18>
<P ALIGN="CENTER"><B><FONT SIZE=5 COLOR="#ffffff">Tip : Partitionierung</B></FONT></TD>
</TR>
<TR><TD VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=84>
<FONT SIZE=1><P>Ein gro&szlig;er Vorteil bei CD-Recordern ist das erstellen eines sehr g&uuml;nstigen Backup seiner wichtigen Daten auf der Festplatte. Ein wenig Fummelei beim Backup erstellen spart man sich, wenn keine Festplatten-Partition gr&ouml;&szlig;er als der maximale Platz einer CD-R ist. Partitioniert man also alle Festplatten-Teile mit maximal 650 MegaByte, so reichen wenige Mausklicks schon, um schnell und einfach von einer solchen Partition ein komplettes Backup zu erstellen.</P>
<P>Weiterhin ist es sinnvoll, die Partition, auf der sp&auml;ter ein Imagefile erstellt werden soll, geringf&uuml;gig gr&ouml;&szlig;er anzulegen, als die Partition, wie die Daten f&uuml;r die neue CD zusammen getragen werden sollen. Es w&auml;re doch &auml;rgerlich, wenn pl&ouml;tzlich am Ende der Imagefile-Erzeugung ein Requester mit zuwenig Speicherplatz meckert.</FONT></TD>
</TR>
</TABLE>
</P>

<B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>Ganz wichtig sind auch die besten Einstellungen im Brennerprogramm. Ich hatte zB. wegen einer falschen Treibereinstellung unn&ouml;tig verschossene CD-Rs, was nat&uuml;rlich besonders &auml;rgerlich war. Oft funktionieren die Treiber f&uuml;r andere CD-Recorder, nur gibt es eben erheblich mehr Schwierigkeiten. Auch die Puffer-Einstellungen sind nicht ganz unwichtig, wohin die Daten zwischen der Festplatte und dem CD-Recorder zwischen gespeichert werden.</P>
<P>So oder so, - man k&ouml;nnte hier jetzt viel zu viel schreiben, was man aber jederzeit in den Bedienungsanleitungen zum jeweiligen Programm nachlesen kann. Also m&ouml;chte ich an dieser Stelle darauf verweisen.</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Weitere Beitr&auml;ge zum Umweltschutz</H2>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>Da studiert man unz&auml;hlige Testzeitschriften, um sich ganz genau den dort f&uuml;r am besten befundenen CD-Recorder zu kaufen, - achtet auf die richtige Wahl der besten Rohlinge und trotzdem kommen die frisch gebrannten CD-Rs in die Kunststoffentsorgung ? Wie kann denn so etwas nun noch passieren.</P>
<P>&nbsp;</P>
<P>Wie schon erw&auml;hnt, - man kann alles richtig gemacht haben und bekommt trotzdem kein Erfolgserlebnis. Zu gro&szlig; sind einfach noch weitere Einwirkungen auf den Schreibvorgang.</P>
<P>Man kann aber auch hier noch vieles dazu beitragen, um den Plastikm&uuml;llhaufen m&ouml;glichst klein zu halten.</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Blizzard-SCSI-Kit</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Stolze Besitzer einer Blizzard-Turbokarte werden bei der Wahl des SCSI-Hostadapters sicherlich als erstes zum passenden SCSI-Kit f&uuml;r ihre Turbokarte greifen. Doch hier sollte man darauf achten, da&szlig; das SCSI-Device nicht bereits veraltet ist. Wer bereits auch ein solches SCSI-Kit besitzt, kann ja mal in der ge&ouml;ffneten SHELL folgendes eingeben .....</P>
</FONT><FONT SIZE=4 COLOR="#c0c0c0"><P>Version devs:1230scsi.device</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Daraufhin erhaltet Ihr dann die Revisionsnummer des Devices. Ist diese Nummer kleiner als 8.1x, so kann es durchaus zu Problemen mit einigen CD-Recordern kommen (zB. JVC, Philips usw.) !</P>
<P>Nat&uuml;rlich braucht man jetzt nicht seinen SCSI-Hostadapter in die Tonne zu werfen. Im Aminet gibt es zum updaten des Blizzard-SCSI-Kit ein Patch namens "SoftSCSI". Wer aber sich noch ein gebrauchtes SCSI-Kit kaufen m&ouml;chte, sollte auf eine aktuelle Revisionsnummer schon im Vorfeld achten, da der Umgang mit "SoftSCSI" zwar einfach, aber dennoch etwas nervig ist.</P>
<P>Neue SCSI-Kits verf&uuml;gen aber mittlerweile immer &uuml;ber die aktuellste Revisionsnummer und d&uuml;rften gar keine Probleme mehr aufweisen.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Nichts f&uuml;r Raucher</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>F&uuml;r starke Raucher mag es der sch&ouml;nste Moment sein, w&auml;hrend des Brennvorgangs sich entspannt zur&uuml;ck zu lehnen und sich eine Zigarette anzuz&uuml;nden. Vom rauchen werde ich Euch wohl leider nicht abbringen k&ouml;nnen, aber w&auml;hrend des brennens einer CD-R solltet Ihr es Euch wirklich verkneifen, oder solange aus dem Zimmer gehen. Es ist tats&auml;chlich erwiesen, da&szlig; der Rauch Ablagerungen auf den Linsen der CD-ROM- und CD-Recorder-Laufwerken verursacht, die den Laserstrahl sehr stark schw&auml;chen. Das l&auml;&szlig;t folglich beim Schreibvorgang die Jitterwerte unn&ouml;tig in die H&ouml;he schnellen und das Ger&auml;t wird immer unzuverl&auml;ssiger.</P>
<P>Bei der Gelegenheit .... wer h&auml;ufige Fehlermeldungen beim Lesevorgang vieler CDs erh&auml;lt, die vorher mal problemlos auf dem gleichen CD-Laufwerk abspielbar waren, sollte dringend mal die Linse des Laserstrahles s&auml;ubern. Gegen geringe Kostenpauschalen kann man das auch bei einigen Clubmitgliedern machen lassen, wenn man sich nicht traut. Ich selbst kann diesen Service Euch auch anbieten. Bei mir wird sowohl die Linse gereinigt, als auch das Laufwerk selbst. Zudem werden einige Verschlei&szlig;teile mit speziellem Teflonfett leicht eingefettet. Danach ist das Laufwerk wieder wie neu. Ich habe so schon &uuml;ber ein gutes Dutzend CD-ROM-Laufwerke wieder bis zur Neuwertigkeit gebracht. Allzu schwer ist dieser Eingriff zwar nicht, aber Unge&uuml;bte k&ouml;nnten mit einigen Modellen doch erhebliche Probleme bekommen,</P>
<P>Wenn es irgendwie m&ouml;glich ist, sollte man seinen CD-Brenner auch gut gegen normale Staubeinwirkung sch&uuml;tzen, denn auch dieses Problem kommt immer wieder vor. Wer diese wenigen Pflegehinweise beachtet, hat nicht nur erheblich l&auml;nger etwas von seinem teuer bezahlten CD-Recorder, sondern mu&szlig; sich auch weit weniger &uuml;ber fehlerhafte CD-Rs &auml;rgern und spart zudem bares Geld beim Rohlingeinkauf.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Keine Tanzpartys</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Voller Vorfreude auf Eure erste CD solltet Ihr nicht gleich eine gro&szlig;e Feier veranstalten. - Im Ernst, .... Ersch&uuml;tterungen sind unbedingt zu vermeiden. Beim Schreibvorgang darf es nach M&ouml;glichkeit zu keinerlei St&ouml;rungen bzw. Unterbrechungen kommen, denn wenn der Datenstrom nur einmal richtig abgerissen ist, so ist der gerade geschriebene Track leider verloren.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Konzentration</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Nein, es hilft nat&uuml;rlich nichts, wenn Ihr vor Eurem Brenner Euch in Trance versetzt und "Ommmmmm" summt ;-)</P>
<P>Viel entscheidener sind die Dinge, die Eure Workbench noch nebenher so erledigen soll. Hier gilt der Grundsatz, je weniger, desto besser.</P>
<P>Habt Ihr nie Probleme beim Brennvorgang, so spricht nichts dagegen, zB. mit einer stabil laufenden Textverarbeitung Eure Post zu erledigen. Auch Eure stark ver&auml;nderte Workbench mit zig im Hintergrund laufenden Patches und Tools kann unver&auml;ndert  eingeschaltet bleiben.</P>
<P>Wer hingegen sowieso schon unzuverl&auml;ssige Schreibvorg&auml;nge zu erwarten hat, der sollte mit "Tasks" sparen, wo er nur kann. M&ouml;glichst alle Workbencherweiterungen, Tools und sonstige Programme sollten vor dem Brennvorgang abgeschaltet sein. Sogar der Bildschirmschoner sollte ruhig deaktiviert sein, denn je weniger st&ouml;rende Prozesse laufen, desto konzentrierter und stabiler kann der CD-Schreibvorgang abgewickelt werden.</P>
<P>&nbsp;</P>
</FONT><I><FONT SIZE=4 COLOR="#ffffff"><P>Weitere Informationsquellen</P>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Es gibt noch eine Reihe weiterer Informationen, die man sich speziell zu seiner ganz pers&ouml;nlichen Konfigurastion heraussuchen kann. In den Anleitungen der Brennsoftware findet man viele n&uuml;tzliche Tips. Auch wenn niemand gerne Anleitungen liest, bei Problemen lohnt sich ein Blick dort hinein fast immer.</P>
<P>Weierhin liefern die Programmierer dieser Software auch manchmal eine weitere Datei mit, wo Fragen diverser User dieser Software bereits beantwortet wurden. Man kann sich relativ sicher sein, mit einem Problem nicht allein auf der Welt zu sein. Und wenn dieses Problem schon mal zur Sprache kam, findet man die passende Antwort in diesen Dateien sicherlich auch.</P>
<P>&nbsp;</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
</B></FONT><I><FONT COLOR="#ffffff"><H1>Ausgebrannt</H1>
</I></FONT><B><FONT SIZE=4 COLOR="#00ffff"><P>&nbsp;</P>
<P>Und wieder einmal sind wir am Ende eines Artikel angelangt .... und wieder einmal ist er erheblich umfangreicher geworden, als ich das vorher geplant hatte.</P>
<P>Von mir pers&ouml;nlich k&ouml;nnt Ihr mit guter Wahrscheinlichkeit noch bald einen ausf&uuml;hrlichen Artikel &uuml;ber das neue Amiga - Linux lesen. Wenn alles klappt, versuche ich auch in der n&auml;chsten Ausgabe den Test zur neuen CD "Amiga Forever V2" fertig zu bekommen. Das Testmuster habe ich hier zwar schon l&auml;ngere Zeit liegen, aber leider kann ich wegen meiner immer noch defekten Anlage das dort Wichtigste, n&auml;mlich den Amiga-Explorer nicht testen. Und auch der vorletzte und n&auml;chste Teil meines Diskletter-Workshop ist in Arbeit und wartet auf die deutschen &Uuml;bersetzungen zu EdWord und TextView.</P>
<P>Ihr seht also, - auch in Zukunft gedenke ich nicht v&ouml;llig, mich aus der NC zur&uuml;ck zu ziehen. Nur werden LEIDER die Abst&auml;nde st&auml;ndig gr&ouml;&szlig;er und meine freie Zeit immer knapper.</P>
<P>Es w&uuml;rde mich freuen, wenn dieser Artikel dem einen oder anderen etwas Klarheit verschafft hat, oder Ihr einfach nur aufmerksam diese Zeilen bis zum bitteren Ende verfolgt habt.</P>
<P>F&uuml;r diese Aufmerksamkeit bedanke ich mich und w&uuml;nsche Euch allen noch viel Freude mit der aktuellen NoCover. Und h&auml;ngt nicht NUR vorm Monitor - wir haben Sommer und ab und zu scheint sogar mal die Sonne ;-)</P>
<P>&nbsp;</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=5 COLOR="#ff0000"><P ALIGN="CENTER">Einen stets kr&auml;ftigen</P>
<P ALIGN="CENTER">Laserstrahl w&uuml;nscht Euch</P>
<P ALIGN="CENTER">Euer</P>
</B></FONT><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">HIGGINS</H1>
<B><P ALIGN="CENTER">Cord Hagen</P></B></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=104>
<TR><TD VALIGN="TOP" BGCOLOR="#c0c0c0" HEIGHT=18>
<P ALIGN="CENTER"><A HREF="MITGLIEDER/HAGEN.HTML">HIGGINS</A></TD>
</TR>
</TABLE>
</P>
<P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</HTML>
