<HTML>
<HEAD>
<TITLE>Fotos aus dem AMIGA</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#000080">
<P ALIGN="CENTER"><IMG SRC="image6.gif" WIDTH=577 HEIGHT=87><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Fotos aus dem AMIGA</H1>
<H3 ALIGN="CENTER">Kurztest : Canon </FONT><FONT COLOR="#ff0000">B</FONT><FONT COLOR="#00ff00">J</FONT><FONT COLOR="#0000ff">C</FONT><FONT COLOR="#ffffff"> 7000</H3>
</FONT><P ALIGN="CENTER"><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#00ffff"><P>"Es ist kaum zu fassen,.... noch vor wenigen Jahren schossen viel zu gro&szlig;e Nadeldrucker mit wenigen kleinen Nadeln einzelne Farbpikmente durch das Farbband und letztendlich dann auf das billig wirkende Endlospapier. Fluchtartig verlie&szlig;en dabei alle ger&auml;uschempfindlichen Menschen den Raum, um dem stechenden Schmerz zu entgehen ....."</P>
<P>Und jetzt k&ouml;nnen wir Fotos in vollen 16,8 Millionen Farben zun&auml;chst einscannen und nach einer eventuellen Bearbeitung anschlie&szlig;end in.ungetr&uuml;bter Qualit&auml;t auch wieder zu Papier bringen. Mittlerweile beherrschen die aktuellen Drucker auf dem Markt selbst die brilliantesten Fotoqualit&auml;ten. So nat&uuml;rlich auch der neue Farbtintenstrahldrucker </FONT><FONT SIZE=4 COLOR="#ffffff">Canon BJC 7000, </FONT><FONT COLOR="#00ffff">der derzeit das Flagschiff unter den Farbtintenstrahlern von Canon darstellt.</P>
</FONT><P ALIGN="CENTER"><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Neue Dimensionen</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Der neue Canon BJC 7000 steckt zun&auml;chst einmal in einem gewaltig gro&szlig;en Karton, in dem sich beinahe eher ein Monitor vermuten lie&szlig;e. &Ouml;ffnet man diesen Karton jedoch, so mu&szlig; man sehr schnell feststellen, da&szlig; die Verpackung keineswegs zu sehr &uuml;berdimensioniert ist.</P>
<P>Vielmehr ist es der BJC 7000 selbst, der v&ouml;llig untypisch zum &uuml;blichen Canon-Konzept reichlich gro&szlig; geraten ist. F&uuml;r Anwender mit Platznot im Computerzimmer, so, wie es bei mir auch leider der Fall ist, stellt sich dadurch ein nicht unerhebliches Problem des Stellplatzes f&uuml;r den neuen Drucker ein. Warum ist der BJC 7000 nur so gro&szlig; geraten ? Er k&ouml;nnte mit seinen &auml;u&szlig;eren Ma&szlig;en schnell f&uuml;r einen waschechten A3-Drucker gehalten werden, was aber leider nicht der Fall ist. Ich habe keine Ahnung, was Canon hiermit pl&ouml;tzlich bezwecken will, hat mir doch gerade immer die hervorragende Kompaktheit der bisherigen Canon-Drucker gut gefallen.</P>
</FONT><P ALIGN="CENTER"><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Kinderleichte Installation</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Nach dem auspacken mu&szlig; zun&auml;chst das mitgelieferte Netzteil installiert werden. Dieses Netzteil wird direkt quer in die R&uuml;ckseite des Druckers eingesteckt, wodurch bezweckt werden soll, da&szlig; jeder neue BJC7000 in </FONT><B><FONT SIZE=4 COLOR="#ffffff">jedem</B></FONT><FONT SIZE=4 COLOR="#00ffff"> Land sofort betreibbar ist. Nur noch die Netzteile, die sp&auml;ter im Geh&auml;use integriert sind, liegen landesspezifisch mit in der Verpackung.</P>
<P>Anschlie&szlig;end k&ouml;nnen auch schon die ebenfalls mitgelieferten Tintentanks eingesetzt werden. Hierbei hat Canon dem Begriff "Tintentank" eine v&ouml;llig neue Bedeutung gegeben, denn genau wie der Drucker, so sind jetzt auch die Tintenvor&auml;te erheblich gewachsen. Leider konnte ich nirgendwo ablesen, wieviel Fassungsverm&ouml;gen einer, der Tanks hat, aber der Tintenvorat d&uuml;rfte in der Tat f&uuml;r eine ganze Weile reichen.</P>
<P>Leider wird es dadurch sicherlich auch fast einen Schreikrampf geben, wenn dann doch mal ein neuer Tank gekauft werden mu&szlig;.</P>
<P>Was mich beim neuen Canon wirklich sehr gest&ouml;rt hat, ist ein weiterer Vorteil, den es bei den beliebten Modellen BJC6x0 gab. Hier sind ja s&auml;mtliche Farben einzeln austauschbar. Das war immer ein riesiger Vorteil gegen&uuml;ber den Modellen der Konkurrenz, wie von Epson, HP usw. Leider wurde der BJC7000 der Konkurrenz hier angepasst und somit befinden sich nun alle Farben "Yellow", "Red" &amp; "Cyan" in einer einzigen riesigen Patrone und nur die schwarze "Black" ist in einem ebenso gro&szlig;en Tintentank separat. Dadurch hat Canon meiner Ansicht nach einen gewaltigen Vorteil verspielt.</P>
<P>Das Ganze wurde nat&uuml;rlich nicht unbegr&uuml;ndet ge&auml;ndert .... Der neue Canondrucker ist erheblich f&uuml;r den Fotodruck verbessert worden. So kann man auch eine spezielle Fotopatrone erwerben und sie kinderleicht gegen die normale Farbpatrone austauschen. F&uuml;r die gerade nicht verwendete Patrone wurde sogar eine spezielle Aufbewahrungsbox dem BJC7000 beigelegt. Der Grund leuchtet somit ein - EIN Farbtank raus - EIN Fototank wieder hinein und schon bekommt man reinrassige Fotos aus dem BJC7000 und das sogar schon auf billigstem Fotokopierpapier. Und trotzdem, das &ouml;konomischere austauschen der einzelnen Farben ist nicht weniger wichtig !</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Druckqualit&auml;t pur</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Das wichtigste an einem Drucker d&uuml;rfte wohl das Endergebnis sein. Der neue Canon BJC7000 schafft volle </FONT><B><FONT SIZE=4 COLOR="#ffffff">1200 dpi</B></FONT><FONT SIZE=4 COLOR="#00ffff"> im Grafikdruck. Hierbei wird im patentierten BubbleJet-Druck die Farbe durch insgesamt </FONT><B><FONT SIZE=4 COLOR="#ffffff">544 D&uuml;sen</B></FONT><FONT SIZE=4 COLOR="#00ffff"> geschossen. Da fragt man sich wirklich, wie man fr&uuml;her mit 9 Nadeln auskam ;-)</P>
<P>Der Druck ist nicht nur in gestochen scharfer Qualit&auml;t nahe der Perfektion, sondern verl&auml;uft auch relativ ger&auml;uscharm von der B&uuml;hne. Hier sollte man jedoch erw&auml;hnen, da&szlig; die BJC6x0-Modelle scheinbar noch eine Spur leiser und auch schneller arbeiten.</P>
<P>Bei der Geschwindigkeit h&auml;tte Canon sicherlich auch gut daran getan, dem BJC7000 einen gr&ouml;&szlig;eren Pufferspeicher zu spendieren. Bei hochaufl&ouml;senden Fotodrucken sind 64Kbyte etwas knapp berechnet und es mu&szlig; zu h&auml;ufig mit dem Druckerprogramm kommuniziert werden.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Technische Daten</H2></I></FONT>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=572>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<P><FONT SIZE=4 COLOR="#00ffff">Ger&auml;t :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Farbtintenstrahldrucker "Photo Realism"</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Hersteller :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Canon Inc.</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Modell :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Farb-Bubble-Jet-Drucker BJC 7000</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Druckbreite :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>215,9 mm max.</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Druckersteuerung :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Erweiteter Canon-Modus</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Maximale Aufl&ouml;sung :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>1200 dpi</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Pufferkapazit&auml;t :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>64 Kb</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Schnittstelle :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>IEEE 1284-kompatible parallele Schnittstelle</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Druckk&ouml;pfe :</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Schwarz mit 304 D&uuml;sen, Kapazit&auml;t etwa 900 Seiten/Patrone</P>
<P>Farbe mit 80 D&uuml;sen pro Einzelfarbe, Kapazit&auml;t etwa 290 Seiten/Tintentank</P>
<P>Basierend auf einer A4-Seite mit 7,5% Farbdeckung pro Farbe</FONT></TD>
</TR>
<TR><TD WIDTH="40%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Ger&auml;uschpegel, Abmessungen und Gewicht:</FONT></TD>
<TD WIDTH="60%" VALIGN="TOP" HEIGHT=35>
<FONT SIZE=4 COLOR="#00ffff"><P>Ca. 49 dB nach ISO 9296</P>
<P>467 x 313 x 218 mm (B x T x H)</P>
<P>ca. 6,4 Kg mit eingebautem AC-Adapter</FONT></TD>
</TR>
</TABLE>
<P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Abbildung </FONT><FONT COLOR="#ff0000">Canon</FONT><FONT COLOR="#ffffff"> BJC 7000 "Photo Realism"</H2>
</I></FONT><H2 ALIGN="CENTER"><IMG SRC="image14.gif" WIDTH=496 HEIGHT=243></H2>
<H2><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></H2>
<I><FONT COLOR="#ffffff"><H2>Amiga-Tauglichkeit</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Canon war schon immer in der Amiga-Szene &auml;u&szlig;erst beliebt, da er der einzige Hersteller von hochqualitativen Druckern ist, der </FONT><B><FONT SIZE=4 COLOR="#ffffff">niemals</B></FONT><FONT SIZE=4 COLOR="#00ffff"> dem Amiga den R&uuml;cken zudrehte. Zu jedem Drucker aus dem Hause Canon gab es schon immer passende Software f&uuml;r den Amiga, um das bestm&ouml;gliche Ergebnis aus den Druckern von Canon heraus zu holen. Der Service und Support wurde bei Canon stets riesengro&szlig; geschrieben. Ein telefonischer Anruf bei Canon-Deutschland gen&uuml;gt und maximal zwei Tage sp&auml;ter liegt </FONT><B><I><FONT SIZE=4 COLOR="#ffffff">GRATIS</B></I></FONT><FONT SIZE=4 COLOR="#00ffff"> die passende Diskette zum neu erworbenen Drucker im Postkasten. Diese Erfahrung hatte nicht nur ich, sondern auch Freunde von mir machen k&ouml;nnen. So erh&auml;lt man f&uuml;r seinen Amiga von Canon das sogenannte "Canon-Studio", was eine abgespeckte Version des bekannten Programms "Studio professional" ist. Einige weniger wichtigen Funktionen sind hier stillgelegt und nat&uuml;rlich ist nur der bei Canon genannte Druckertyp dort eingerichtet.</P>
<P>Ich kann der Firma Canon f&uuml;r diesen Service nur ein gewaltiges Lob aussprechen, denn soviel Service ist auf dem Amigamarkt mittlerweile mehr, als selten. Die Software wird auch im Internet von Canon zum kostenlosen Download bereit gestellt.</P>
<P>Das Programm "Canon Studio" passend f&uuml;r den BJC 7000 befindet sich im Moment noch in der Entwicklung, sollte aber bei Erscheinung dieser NoCover bereits fertig gestellt sein.</P>
<P>Auch wer von Euch einen gebrauchten Canon-Drucker sein Eigen nennt, kann beruhigt bei Canon-Deutschland anrufen. Hier wird sehr unb&uuml;rokratisch verfahren.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Fazit</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Der Canon BJC 7000 besticht durch seine hervorragende Druckqualit&auml;t, gerade und besonders auf einfachstem Papier. Somit ist selbst die perfekte Fotoqualit&auml;t auf billigem Fotokopierpapier m&ouml;glich, wozu lediglich die Farbpatrone im Drucker gegen eine spezielle Foto-Farbpatrione ausgetauscht werden mu&szlig;. Speziell hier liegen auch seine St&auml;rken gegen&uuml;ber seiner Konkurrenz. W&auml;hrend bei den vergleichbaren Modellen anderer Hersteller echte Fotoqualit&auml;t nur auf spezielleem Papier m&ouml;glich wird, so schafft der BJC 7000 auch schon auf billigsten Druckmedien erstaunliche Ergebnisse.</P>
<P>Durch die ungeschlagen hervorragende Unterst&uuml;tzung der Amiga-Anwender bietet der Service-Support von Canon bestm&ouml;gliche Ausnutzung der Canon-Drucker. Das Angebot von spezieller Amiga-Software ist f&uuml;r Canon eine Selbstverst&auml;ndlichkeit und man hat am Telefon wirklich nicht das &uuml;bliche Gef&uuml;hl heimlich bel&auml;chelt zu werden, weil man nicht dem kompatiblen Markt zugetan ist. Hier k&ouml;nnten sich die meisten Firmen leider ein Beispiel nehmen.</P>
<P>Aber auch Nachteile bringt das neue Flagschiff von Canon leider mit. Vergleicht man den BJC7000 mit der sehr erfolgreichen Serie BJC600/600e/610/620 f&auml;llt einem sofort die unn&ouml;tig &uuml;berdimensionale Vergr&ouml;&szlig;erung der Au&szlig;enma&szlig;e auf. Zudem ist der BJC7000 etwas lauter im Druck und leider auch langsamer, was wegen der h&ouml;heren Druckaufl&ouml;sungen aber nur logisch sein sollte. Ein weiterer Nachteil ist, da&szlig; im Gegensatz zu den erw&auml;hnten &auml;lteren Modellen nun beim BJC7000 ebenfalls alle Farben sich in einem einzigen Tintentank befinden. Das hat den von der Konkurrenz bekannten Nachteil, da&szlig; man nur den kompletten Farbtank austauschen kann, selbst wenn nur eine einzige der drei Farben aufgebraucht ist.</P>
<P>Schaut man sich bei dem neuen Canon die Nachteile an, so erscheint einem der Preis leider deutlich zu hoch, allerdings sind Preisanpassungen an die Modelle der Konkurrenz zum Teil schon geschehen, so da&szlig; der BJC7000 ziemlich sicher noch im Preis fallen wird. Es ist durchaus denkbar, da&szlig; solche Preisst&uuml;rze bis zum Erscheinungstermin dieser NoCover l&auml;ngst geschehenes Ereignis geworden ist.</P>
<P>F&uuml;r Besitzer eines BJC 6x0 lohnt sich ein Wechsel eigentlich nur, wenn man auch noch den letzten winzigen Pixel aus seinen Ausdrucken weg bekommen m&ouml;chte. Ich pers&ouml;nlich w&uuml;rde den BJC 620 zur Zeit vom Preis/Leistungsverh&auml;ltnis her dem BJC 7000 vorziehen. Ist der BJC 7000 nur noch unwesentlich teurer, als der ebenfalls hervorragende BJC 620, kann man den Go&szlig;en von Canon durchaus empfehlen.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><FONT COLOR="#ffffff"><H2>Bezugsquelle</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Zu haben ist der Canon BJC 7000 bei diversen Amigah&auml;ndlern, wo im Allgemeinen auch die besagte Amigasoftware mitgeliefert wird. Der durchschnittliche Preis liegt hier zwischen 899,oo und 999,oo DM.</P>
<P>Etwas g&uuml;nstiger ist der Canon bei der Firma </P>
</FONT><FONT COLOR="#ff0000"><H1 ALIGN="CENTER">ALL SYSTEMS</H1>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>(einfach MEINE Telefonnummer w&auml;hlen ;-))) zu haben. Zur Zeit ist der BJC 7000 hier gerade f&uuml;r </FONT><B><FONT SIZE=4 COLOR="#ff0000">789,oo DM</B></FONT><FONT SIZE=4 COLOR="#00ffff"> zu haben.</P>
<P>Alle Preisangaben sind von Ende Mai / Anfang Juni und sollten ruhig aktuell erfragt werden, da Preissenkungen eventuell zu erwarten sind.</P>
<P>Und nat&uuml;rlich kann man sowohl den Drucker, Software und auch Ausk&uuml;nfte diesbez&uuml;glich direkt bei Canon Deutschland bekommen :</P>
<P>&nbsp;</P>
</FONT><FONT COLOR="#ff0000"><H2>Canon</FONT><FONT COLOR="#ffffff"> Deutschland GmbH</H2>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Europark Fichtenhain A10, 47807 Krefeld,</P>
<P>Postfach 528</P>
<P>47705 Krefeld</P>
<P>Telefon : 02151 / 345 - 0</P>
<P>Telefax : 02151 / 345 - 102</P>
<P>&nbsp;</P>
<P>Canon Hotlineservice :</P>
<P>Customer-Support : 02151 / 349 - 555</P>
<P>Info Desk : 02151 / 349 - 566</P>
<P>Mailbox : 02151 / 349 - 577</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<FONT COLOR="#ff0000"><H2 ALIGN="CENTER">Stets einen guten Druck</H2>
</FONT><FONT COLOR="#00ff00"><H2 ALIGN="CENTER">w&uuml;nscht Euch Euer</H2>
</FONT><I><FONT COLOR="#ffff00"><H2 ALIGN="CENTER">Cord Hagen</H2>
</I></FONT><P ALIGN="CENTER"><A HREF="MITGLIEDER/HAGEN.HTML"><FONT COLOR="#ffffff">HIGGINS</FONT></A></P>
<P ALIGN="CENTER"><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<P><IMG SRC="image6.gif" WIDTH=577 HEIGHT=87><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</HTML>
