<HTML>
<HEAD>
<TITLE> Jede Menge Fragen...</TITLE>
<HEAD>
<BODY background="l_bg.gif" text=black>
<P><H1><em>
Hallo,
</H1></em></P>
<font size=3>
Ich bin`s mal wieder. Und schon wieder ein par Fragen auf Lager:
<UL><LI>Wenn ich mit HD-Toolbox einen BadBlock sperren lasse, was mu&szlig; ich dann bei
den Feldern Head und Sector eingeben? 
Immer den ganzen Zylinder sperren zu lassen kann doch nicht das Wahre sein !<P>

<LI>Seit ich auf meinen System Classact 2.0 installiert habe scheinen ClassactProgramme 
nicht mehr korrekt zu laufen. St&auml;ndig bekomme ich von diesen
Programmen die Meldung, da&szlig; sie das &quot;listbrowser.gadget&quot; nicht finden, obwohl
es ordnungsgem&auml;&szlig; installiert wurde. An HintergrundTools kann es nicht liegen,
da ich auch schon ohne Startup nur mit den Mindestassigns gebootet habe.
Wenn ich &auml;ltere Versionen der Gadgets installiere st&uuml;rzt bei AWeb alles ab
(Guru 8000000b,81000005,...). Da&szlig; w&uuml;rde mich ja alles nicht so st&ouml;ren,
die Demos von IBrowse und Voyager tun es ja auch,aber interessieren w&uuml;rde
es mich schon warum es nicht mehr funktioniert.<P>

<LI>Wenn ich die VisualPrefs einschalte, h&auml;ngt sich das System auf, sobald der
WorkbenchScreen ge&ouml;ffnet wird, also auch schon beim Booten. Auch hier habe
ich schon ohne Startup gebootet, ohne Erfolg.<P>

<LI>Nun noch eine Frage zu einem &auml;lteren Spiel, und zwar Operation Stealth.
Ich wei&szlig;, ihr m&uuml;&szlig;t mich f&uuml;r dumm und d&uuml;mmer halten, aber ich komme einfach
nicht &uuml;ber den ersten Screen hinaus. Der W&auml;chter verlangt meinen Pass aber
ich habe keinen. Ich habe ihm schon alles m&ouml;gliche angeboten, von der Brieftasche
bis zur Zeitung aber nichts hat gewirkt.
<LI>So, hier noch etwas an die Programierer unter euch:<BR>W&auml;hre es nicht
m&ouml;glich einen Patch zu schreiben, der den Joystick abfragt, und auf Bet&auml;tigung
eine Taste simuliert? So da&szlig; wenn ich zum Beispiel nach oben dr&uuml;cke, das
System denken w&uuml;rde, eine Cursor-Taste w&auml;hre gedr&uuml;ckt. Der entsprechende
Patch in MultiCX funktioniert ja nur auf einem evtl. Shapeshifter-Mac-Bildschirm. 
Es m&uuml;&szlig;te aber wirklich ein Patch sein, der das System umgeht,
damit auch Spiele mit forbid() es eventuell akzeptieren.
Das w&auml;hre dann endlich eine L&ouml;sung f&uuml;r das TastaturProblem.
Da&szlig; kann doch nicht so schwer sein? Hilfsmittel w&auml;hren hier zum Beispiel
die Patch.library aus dem Aminet, und das Progi Joyride von der AmigaFuture 1
(PD/Spiele/KidStop/JoyRide), das die Joystickbewegungen auf IDCMP Flags abbildet.
<LI>Und gleich noch eins drauf: Kann man nicht irgendwie die Exec.library
so patchen, da&szlig; die forbid() Funktion ausgeschaltet wird? Einige Spiele w&uuml;rden
das zwar sicherlich nicht mitmachen, doch wenn es klappt, k&ouml;nnte man auch ohne
Freezer wieder Spiele cheaten.<BR>So, Ich glaube das wars f&uuml;r heute...
</UL>
<HR noshade size=2 width=75%>
</font><font size=2>
Ich hoffe Ihr k&ouml;nnt mir weiterhelfen,<BR>
</font>
<CENTER><font size=4>Markus Castro Y Castro -The Saint<BR>
D-25764 Wesselburen<BR>
Ostpreu&szlig;enstrasse 26<BR>
Tel: 04833/3728</FONT></CENTER>
<HR width=639>
<CENTER><A HREF="NoCover.html" TARGET="_NEW"><IMG SRC="l_hauptinhalt.jpg" width=639 height=99 BORDER=0></A></CENTER>
</BODY>
</HTML>
