<HTML>
<HEAD>
<TITLE>
Fragen und Antworten von Indy</TITLE>
</HEAD>
<BODY TEXT=white link=blue alink=black background="indypattern.jpg">
<center>
<h1><B>
Hallo Leute!!<BR>
</h1></B>
<BR>
</center>
<H2><B>Fragen</B></H2>
1) Da die NC jetzt nur noch im HTML erscheint, m&ouml;chte ich mich mal etwas n&auml;her mit <BR>
HTML besch&auml;ftigen (kann ja nicht schaden...). Dazu suche ich jetzt ein Buch <BR>
&uuml;ber HTML. Wer kann mir da eins empfehlen oder mir von einem bestimmten abraten?<BR>
Es sollte preislich zwischen 30,- und 40,- DM liegen.<BR>
<BR>
2) Ich hab ein Problem mit meinem CDROM Laufwerk und meiner CyberVision64/3D. (es ist ein<BR>
OverDrive CD-ROM Laufwerk (2xSpeed) (ich wei&szlig;... es war aber billig :-))). <BR>
<BR>
Jedesmal wenn ich nun den CDROM Treiber aktiviere verschwinden die CV64/3D Screenmods <BR>
aus meinem Screenmode Auswahlfenster. So als w&auml;re keine Grafikkarte mehr installiert!<BR>
Wie kann das sein? Ich kann dann n&auml;mlich keine Screens mehr umleiten und auch das CyberView<BR>
Programm funktioniert dann nicht mehr. Erst nach einem erneuten starten des Rechners &quot;ohne&quot;<BR>
Treiber funktioniert alles wieder ganz normal. Wenn der Treiber gleich aktiviert wird (also<BR>
in der &quot;DEVS&quot; Schublade liegt) erscheint meine Workbench nur noch auf HirRes Screens, was <BR>
ziemlich bl&ouml;d ist, weil ich da meinen alten Monitor wi(e)der benutzen mu&szlig;.<BR>
Also mene Frage: Wie kann ich das verhindert? Hat vieleicht jemand einen neueren Treiber f&uuml;r <BR>
mein CDROM Laufwerk? Meine &quot;Archos&quot; Version ist auch schon sehr alt (von &acute;94)...<BR>
<BR>
3) Obwohl ich einen Multiscan Monitor gekauft habe, kann er das Bootmen&uuml; (und HiRes Screens im<BR>
allgemeinen) nicht anzeigen liegt es daran das er jetzt an der CV64/3D h&auml;ngt??<BR>
<BR>
<HR>
<BR>
<H2><B>Antwort</B></H2>
An SAX<BR>
Hallo SAX!<BR>
<BR>
Irgendwie scheinen wir das selbe (traurige) Schicksal mit unseren Grafikkarten zuteilen :-(<BR>
Aber ich glaube ich kann Dir bei einigen Problemen helfen:<BR>
<BR>
1) Ich kann zwar keinen solchen Schalter basteln, habe das Problem aber dennoch mehr oder<BR>
weniger ellegant gel&ouml;&szlig;t. U.z. habe ich ein Monitorkabel genommen und an den alten Monitor <BR>
Anschlu&szlig; meines Towers ranget&uuml;delt und mit meinem ALTEN Monitor (1085S) vergri&szlig;knattelt.<BR>
Ein zweites Kabel hab ich an die CyberVision angeschlossen und mit meinem NEUEN Monitor<BR>
verbunden. So das ich jetzt zwar zwei Monitore in meinem Zimmer rumstehen habe, aber <BR>
wenigstens nicht jedes mal den Tower vorzuziehen brauche, wenn ich Demos gucke oder mal TFX <BR>
spielen will. Und Du hast ja auch einen zweiten Monitor. <BR>
(Der Nachteil ist halt das man ziemlich viel Platz braucht...)<BR>
<BR>
2) Ich benutze NewIcons - der Mauszeiger sieht dennoch so beknackt aus. In der Anleitung<BR>
der CV64/3D steht aber drinnen wie man das verhindert - war bis jetzt aber zufaul es auszu-<BR>
brobieren. :-))<BR>
<BR>
3) Hast Du bei der Installation wirklich 31KHz f&uuml;r den Monitortreiber ausgew&auml;hlt?? Sorry,<BR>
aber hier hab ich echt keine Ahnung...<BR>
<BR>
4) Das Problem mit PPaint ist schnell gel&ouml;&szlig;t: Du mu&szlig;t Deine Workbench einfach nur auf 8bit<BR>
zur&uuml;ck fahren - und schon gehts wieder. Es kann aber vorkommen das ein Bild von PPaint in<BR>
&quot;HiRes&quot; geladen wird, was bedeudet das Du wahrscheinlich wieder hinter Deinen Schreibtisch <BR>
mu&szlig;t... (armer Mensch Du! ;-))<BR>
Allerdings kannst Du auch das umgehen, indem Du ganz einfach im Projektmen&uuml; &quot;Format&quot; ausw&auml;hlst,<BR>
dann den ben&ouml;tigten Screenmode ausw&auml;hlst sowie die Farbanzahl auf 256 erh&ouml;st. Wenn Du dann<BR>
das Bild l&auml;dst mu&szlig;t den Schalter anklicken, mit dem der aktuelle Screenmode beibehalten wird und <BR>
nicht der den das Bild besitzt.<BR>
(Der Nachteil ist hier, das man die gr&ouml;&szlig;e des Bildes wissen mu&szlig;...) <BR>
<BR>
6) Hey das Problem hab&acute; ich auch!! Bin gespannt was da f&uuml;r Antworten kommen. Waren diese roten<BR>
Bildschirme eigentlich schon vor dem Einbau der CV64/3D vorhanden? Vieleicht liegt es ja an der <BR>
Karte. Ich selbst hatte meinen Amiga nur 2 Wochen lang ohne Grafikkarte in Betrieb, und da er-<BR>
schien nie ein roter Bildschirm...<BR>
<BR>
8) Mmmh, Ich hab auch ziemliche Probleme allerdings mit einer PC Tastatur... <BR>
<BR>
Ciao,<BR>

<a href=mitglieder/cschmidt.html> Christian Schmidt</a><BR>
<center>
<a href=disku_kickoffamiga.html> Kick off the Amiga </a> <BR>
<a href=leser_christians.html> Meine Leserbriefe </a><P>
</center>
<right>
<h3>
<I> Indy </I>
</H3>
</right>

<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=597 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
