<HTML>
<HEAD>
<TITLE>Indys Leserbriefeecke 
</TITLE>
</HEAD>
<BODY TEXT=white link=blue alink=black background="indypattern.jpg">

<CENTER>
</CENTER><H2>HiDiHo Ihr da drausen!!</H2>
<H3>
Hier bin ich wieder!! (Tja, man wird mich nicht los :))<BR>
Zulesen gibts hier was f&uuml;r:
</H3>
Christian Wimmer -- DOSO<BR>
Dietmar Kretlow <BR>
The Makers Of The Memberliste -- Rainer &amp; Sascha<BR>
<BR>
Noch eine kleine Anmerkung: die Seiten sehen am besten bei (mindestens) 512 Farben und einer
Auflösung von 640x480 Pixel aus.<br>

<HR>
<BR>
<I>Los gehts mit DOSO...</I><BR>
<BR>
<B>Hallo Doso!</B><BR>
&Ouml;hh, vergiss einfach was ich in der NC51 im ersten Teil geschrieben hatte. Aber Du l&auml;st Dir <BR>
wirklich viel Zeit mit der Beantwortung von Briefen, oder?? Naja, ist auch egal... <BR>
Vielen Dank f&uuml;r die vielen Infos die Du mir geschickt hast - werd&acute; mir die CD auch <BR>
bestellen bzw. hab&acute; sie schon bestellt aber die Leute von Vesalia haben mir statt &quot;The <BR>
Theme of Amiga&quot; &quot;Themen Park&quot; geschickt (?!). <BR>
<BR>
Mal zu was ernsterem: Du hast mir doch geschrieben das Amiga, Inc/Amiga International auf <BR>
der WoA in England etwas &quot;GRO&szlig;ES&quot; verk&uuml;nden werden - hattest Du Dir das so vorgestellt?! <BR>
Ich hoffe nicht... <BR>
Meine Meinung dar&uuml;ber kannst Du (wahrscheinlich) im  <a href=disku_kickoffamiga.html>Diskusionsforum </a> <BR>
nachlesen. W&uuml;rde mich interessieren wie Du dazu stehst!!<BR>
Schade das der KonsolenCorner tod ist! :(<BR>
<BR>
So das wars eigentlich schon, bis denne!!<BR>
<BR>
Asta Lavista DOSO,<BR>
and Ciao,<BR>

<a href=mitglieder/cschmidt.html> Christian Schmidt </a><BR>
<br>

P.S Wie gesagt, das Modem kommt - nur weiß ich noch nicht genau wann, sp&auml;testens aber wenn ich ein<BR>
neues Zimmer bekomm'... (ist ne' lange Geschichte)<br>

<HR> <BR>

<I>...und weiter gehts mit Dietmar...</I><BR>
<BR>
<B>Auch Dir ein herzliches Hallo!!</B><BR>
Irgendwie hab ich das Gef&uuml;hl das Du meinen letzten Brief nicht richtig lesen konntest,<BR>
am besten Du kuckst Dir mal den Source Code an oder noch einacher Du liest es gleich <BR>
hier:<BR>
<BR>
(Nochmal und diesmal komplett :))<BR>
<BR>
So  genau wei&szlig; ich jetzt auch nicht mehr ob ich beim APP mitmachen soll...  Warum?<BR>
Ganz  einfach:  Ich wei&szlig; nicht an wen ich mich wenden mu&szlig;... :( <BR>
Was??  H&ouml;re  (oder lese)  ich  da  so etwas wie Pessimismus oder Skepsis (ich hasse  <BR>
solche  W&ouml;rter!! (Schon  allein  deswegen  weil sie sich so schwer schreiben lassen ;))  <BR>
in  Deinen Worten? Was hei&szlig;t, Du hast noch keinen C++ Compiler? Sch&auml;m dich ;-)).<BR>
Letztens hat sich  das  alles  noch  ganz anders angeh&ouml;rt! Naja, ich kann dich ja <BR>
nicht  zum programmieren auf dem Amiga zwingen... <BR>
Allerdings werden solche wie Du  auf  dem Amiga IMMER gebraucht jeder Einzelne z&auml;hlt<BR>
da!! Vorallem wenn er, wie Du, vom  PC (irgendwie) wieder zum Amiga kommt.<BR>
Ich hoffe aber Du bleibst dem Amiga trotzdem erhalten ( und nat&uuml;rlich dem APC&amp;TCP)!!<BR>
<BR>
So das wars auch schon, schreib mir mal wieder...<BR>
<BR>
Tsch&uuml;ss,<BR>
<BR>

<a href=mitglieder/cschmidt.html> Christian Schmidt </a><BR>

<HR><BR>
<I>...und last but not least, die Leute von der Mitgliederliste</I><BR>
<BR>
<B>Hallo ihr beiden!!</B><BR>
Ich hab&acute; schon wieder Arbeit f&uuml;r Euch (wirklich unversch&auml;mt von mir, oder :-))<BR>
Und zwar hat sich bei meiner Konfig der Epson-LX-400 Drucker in einen <BR>
<B>Epson Stylus Color 400 </B><BR>
gewandelt. (Praktisch &uuml;ber Nacht :))<BR>
<BR>
Sonst kann alles so bleiben. Dankesch&ouml;n - schon mal im vorraus!!<BR>
<BR>
Ciao,<BR>
<a href=mitglieder/cschmidt.html> Christian Schmidt </a> <P>
<Center>
<a href=help_grafikkarte.html> HelpLine Artikel </a><BR>
<a href=disku_kickoffamiga.html> Kick off the Amiga </a><BR>
</center>
<right>
<h3><I>Indy<H3><I>
</right>
</p>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=597 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
