<HTML>
<HEAD>
<TITLE>leser_Cord</TITLE>
</HEAD>
<BODY TEXT="#ffff00" LINK="#008000" VLINK="#800080" BACKGROUND="image6.gif">
<IMG SRC="image7.gif" ALIGN="LEFT" HSPACE=9 WIDTH=100 HEIGHT=92>
<FONT SIZE=4><P>&nbsp;</P>
</FONT><FONT COLOR="#00ffff"><H1>Higgins´ens Letterbox</H1>
</FONT><FONT SIZE=4><P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="image8.gif" WIDTH=600 HEIGHT=11></P>
<FONT SIZE=4><P>Uiuiui, .... wie lange ist es eigentlich jetzt her, seit ich die letzten Leserbriefe in die NC getippt habe ?</P>
<P>Nee nee, - den </FONT><A HREF="MITGLIEDER/HAGEN.HTML"><FONT COLOR="#ffffff">HIGGINS</FONT></A><FONT SIZE=4> gibt´s noch, keine Panik !</P>
<P>Aber nat&uuml;rlich hat fast immer alles einen Grund, - so also auch mein "Verschwinden" von der Bildfl&auml;che hier in der NoCover. Zum einen w&auml;re da mal die ewig zu knappe Zeit, um mich aktiver an der NoCover zu beteiligen und zum anderem meint es das Schicksal so manches mal wirklich nicht gerade gut mit mir. So sollte es auch in diesem Jahr geschehen, da&szlig; p&uuml;nktlich am 1. Mai wir wieder einmal ein deftiges Gewitter hatten und wo sollte der Blitz hier auch anders einschlagen, als in die Versorgungsleitungen unseres Hauses ?</P>
<P>Lange Rede, kurzer Sinn - ein weiterer Amiga hat das Zeitliche gesegnet und sich in Rauch aufgel&ouml;st. Naja, nicht ganz, aber eine Reparatur ist unwirtschaftlich und somit mu&szlig; Ersatz her.</P>
<P>Amiga Int. will f&uuml;r NUR die A1200-Hauptplatine uinversch&auml;mte 650,- DM vom H&auml;ndler haben, w&auml;hrend man ja ganze A1200 inklusive Softwarepaket bereits f&uuml;r unter 400,- DM bekommt.</P>
<P>Als sei diese Tatsache nicht genug, so gibt es auch noch dauernd &uuml;berall Lieferengp&auml;sse.</P>
<P>Ich f&uuml;r meinen Teil habe die Nase voll und kehre nun ebenfalls dem Amiga den R&uuml;cken zu. Somit wird diese Letterbox ebenfalls meine Letzte sein, denn einen neuen Amiga wird es f&uuml;r mich nicht geben.</P>
<P>Haaaalt, ..... Quatsch mit Senfso&szlig;e - das war nat&uuml;rlich nur ein Scherz der &uuml;belsten Sorte ! Wie bitte sch&ouml;n sollte man sich denn auch einen HIGGINS ohne einen AMIGA vorstellen ??? - Das geht doch gar nicht ! </FONT><FONT FACE="Wingdings" SIZE=4>J</FONT><FONT SIZE=4> </P>
<P>Leider ist es aber kein Scherz, da&szlig; ich immer noch auf die Ersatzteile warten mu&szlig;, um meinen Amiga wieder in voller Kapazit&auml;t zu betreiben. Aus diesem Grund konnte ich in all den letzten langen Wochen keine Emails von Euch beantworten.</P>
<P>Leute, ich mu&szlig; Euch auch sagen, da&szlig; im Amigamarkt ganz sch&ouml;n etwas faul ist ! So, wie viel zu viele Amiga-Hersteller und Distributoren arbeiten, wundert es mich langsam wirklich nicht mehr, da&szlig; der Kreis aktiver Amiga-Anwender immer weiter schrumpft. Es ist ja oft nicht einmal m&ouml;glich, etwas aus den vielen, bunten Angeboten der Amiga-Zeitungen zu ordern.</P>
<P>Bei Conny Figge, auf die ich sonst immer gro&szlig;e St&uuml;cke gehalten habe, geht seltenst jemand ans Telefon. Hast man mal Gl&uuml;ck, - so ist die Oma dran, die nur erkl&auml;ren kann, da&szlig; sie keine Ahnung hat .... Faxe werden erst gar nicht mehr beantwortet. Auf meine neue 1260 soll ich ca. 10 Wochen warten und bei Phase5 kann man bei solchen Terminversprechen ruhig noch mal 10 Wochen hinzu rechnen.</P>
<P>Wie soll soetwas weiter gehen ? - Mir ist kein anderer Markt bekannt, der mit derartigen Schwierigkeiten best&uuml;ckt ist. Wenn ich nicht einmal mehr kaufen kann, was mir in den Zeitungen &uuml;berall angepriesen wird, kann ich gut nachvollziehen, das der &Auml;rger und Frust unter den Amigafreunden immer gr&ouml;&szlig;er wird. Eine tollk&uuml;hne Versprechung kommt nach der Anderen und vom Prinzip her bleibt vieles davon nur hei&szlig;e Luft.</P>
<P>Genug gejammert, - Ihr kennt das Elend ja selbst. Ich glaube mittlerweile wirklich, da&szlig; viele H&auml;ndler und Hersteller am Amigamarkt pr&auml;sent sind, weil sie auf dem gro&szlig;en kompatiblen Markt erst gar nicht konkurrenzf&auml;hig w&auml;ren, denn dort geht es erheblich ruppiger zu.</P>
<P>Bestelle ich als H&auml;ndler hier Standart-PC-Komponenten, so sind die Sachen in der Regel innerhalb von zwei bis drei Tagen hier. Schade, da&szlig; das beim Amiga nicht auch eine Selbstverst&auml;ndlichkeit ist .... Hier darf man ganze Wochen und sogar Monate warten.</P>
<P>&nbsp;</P>
<P>Aber nun solls losgehen, mit einigen Zeilen f&uuml;r folgende Clubfreunde .....</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=600 HEIGHT=11></P>
<FONT SIZE=4 COLOR="#00ff00"><P>Ich gehe nur ganz kurz mal auf die Leserbriefe der NoCover#52 ein. Hier haben mir allerdings nicht viele Clubfreunde geschrieben.</P>
<P>Da w&auml;re also Post f&uuml;r</P>
</FONT><B><I><FONT COLOR="#00ffff"><P>Annemarie, Nagash, Yonder, Rolf N&uuml;nninghoff, Snoopy </B></I></FONT><FONT SIZE=4>und</FONT><B><I><FONT COLOR="#00ffff"> Wolf Zimmer</P>
</B></I></FONT><P ALIGN="CENTER"><IMG SRC="image8.gif" WIDTH=600 HEIGHT=11></P>
<FONT COLOR="#ffffff"><ADDRESS>* Annemarie</ADDRESS>
</FONT><FONT SIZE=4 COLOR="#c0c0c0"><P>Huhu, Annemarie .... jaja, - ist schon etwas Besonderes, unser kleiner gem&uuml;tlicher Club. F&uuml;r kurze Zeit war ich auch mal in diversen, sogenannten Newsgroups der verschiedenen Netze. Stell Dir das wie ein gro&szlig;es Verzeichnis auf Deiner Festplatte vor, wo st&auml;ndig Texte neu hinzukommen, auf die wieder weitere Texte folgen. So schreibst Du irgendetwas, machst einen Netcall und hierbei wird Dein Text in eben duieser Newsgroup ver&ouml;ffentlicht. Alle Anderen, die sich ebenfalls hier umsehen, k&ouml;nnen nun Deinen Text lesen und darauf reagieren. Sozusagen also schon fast soetwas, wie die Leserbriefecke in der NoCover.</P>
<P>Es dauerte auch gar nicht lange, bis ich mich dort wieder verabschiedet hatte, denn der Umgangston dort ist einfach nur bl&ouml;d. Jeder will sich dort profilieren und zeigen, was er drauf hat. Das beweist er am besten mit wilden Beschimpfungen und versteckt sich hinter der Anonymit&auml;t seiner Email-Adresse.</P>
<P>Da ist unsere NoCover schon etwas besonderes, denn hier treffen sich wirklich NETTE Menschen und helfen sich gegenseitig, statt lautstark kund zu tun "&Auml;tsch ich weis man alles besser !" und dann auch noch jegliche Hilfestellung zu unterbinden.</P>
<P>Ich glaube, - w&auml;re die NoCover nicht, was sie nunmal ist, so h&auml;tte ich das Abo l&auml;ngst nicht mehr verl&auml;ngert.</P>
<P>Begr&uuml;&szlig;t habe ich Dich nun glaube ich mehrfach und ein Brief, oder Diskletter ist zum Zeitpunkt dieser Tiparbeit hier l&auml;ngst geplant und sollte m&ouml;glichst schon bei Dir sein, wenn Du diese Zeilen liest.</P>
<P>Sollte das nicht der Fall sein, so verzweifle nicht, Eine Antwort naht !</P>
<P>Nicht nur Du hattest Gl&uuml;ck, da&szlig; Du auf den Club gesto&szlig;en bist - Auch anders herum ist das der Fall, denn auch Du bist eine sch&ouml;ne Bereicherung f&uuml;r die Vielfalt der unterschiedlichsten Amigafreunde.in unserem Club.</P>
<P>Hoffentlich lesen wir noch oft und dann viel von Dir ....</P>
<P>Auch Dir sei die Fr&ouml;hlichkeit ein stets treuer Weggef&auml;hrte !</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=600 HEIGHT=11></P>
<FONT SIZE=4 COLOR="#ff0000"><P>* Nagash</P>
<P>.... hoppla - ROT auf blau ist nicht so wahnsinnig toll lesbar, stimmts ?</P>
</FONT><FONT SIZE=4><P>Also wechseln wir lieber wieder die Farbe </FONT><FONT FACE="Wingdings" SIZE=4>J</FONT><FONT SIZE=4> ! Ach, - ich war ja regelrecht ger&uuml;hrt, da&szlig; wenigstens DU meine Artikel in der NoCover mal vermisst. Ich hatte schon gedacht, mich unbemerkt verpieseln zu k&ouml;nnen, aber scheinbar gibt es immer noch EINEN, der mich vermissen w&uuml;rde - schnief, wie sch&ouml;n !</P>
<P>Also die Texte in dieser NoCover sind somit ganz speziell und nur f&uuml;r Dich, denn jemand anderes h&auml;tte sie ja nicht vermi&szlig;t </FONT><FONT FACE="Wingdings" SIZE=4>J</FONT><FONT SIZE=4> </P>
<P>Eiwei,.... Du hast Dir ernsthaft die "Mixed Up" von The Cure gekauft ?</P>
<P>F&uuml;r einen echten Cure-Fan stellt diese CD so ziemlich die schlechteste unter den weit &uuml;ber 50 CDs dar, die die schwarzen Seelen heraus gebracht haben. Wenn Du eine TYPISCHE Cure-CD h&auml;ttest haben wollen, so hast Du den gr&ouml;&szlig;ten Fehltreffer gelandet, der machbar war !!!</P>
<P>Unter Cure-Spezies wird sogar gemunkelt, da&szlig; The Cure diese CD quasi nur als Verarsche gegen&uuml;ber dem &uuml;blichen Radiom&uuml;ll herausgebracht hat, nur um mal eben zu zeigen, da&szlig; es keine Kunst ist, den &uuml;blichen Discom&uuml;ll zu produzieren.</P>
<P>Die Gruppe "The Cure" macht wirklich Musik in die unterschiedlichsten Richtungen. Mit der "Mixed up" sollte nur die Disco/Pop-Richtung vertreten werden. Jedoch genau diese Musikrichtung m&ouml;gen echte Cure-H&ouml;rer ja am allerwenigsten. Die beiden anderen wirklich krassen Gegens&auml;tze sind auf der einen Seite die CD "Kiss me Kiss me Kiss me", die The Cure in ihrer urigsten Form pr&auml;sentiert. Hier fehlte auch noch ein Bandmitglied, der sp&auml;ter dann einige neue Instrumente mit in die Musik brachte. Die zweite wirklich perfekte Scheibe ist dann eindeutig die "Desintegration". Diese beiden CDs sind gnadenlois perfekt - Beide f&uuml;r sich, denn sie unterscheiden sich aufs extremste und doch h&ouml;rt man es sofort heraus, da&szlig; Cure-typische ! Ganz nebenbei sei noch erw&auml;hnt, da&szlig; diese beiden CDs bis zum allerletzten Anschlag ausgef&uuml;llt sind, was die Kapazit&auml;t einer CD betrifft.</P>
<P>Tja, angenommen, Du m&ouml;chtest erst einmal nur EINE CD noch kaufen, wozu sollte ich Dir raten ?</P>
<P>Also magst Du mehr die h&auml;rteren und abwechslungsreicheren Sachen, so findest Du das auf der etwas &auml;lteren "Kiss me kiss me kiss me" - Bl&ouml;der Titel, aber eine geniale CD um The Cure kennen und sch&auml;tzen zu lernen.</P>
<P>Magst Du eher das etwas ruhigere, deprimierendere mit einem schon klassischem Touch, so bist Du ganz klar mit der "Desintegration" besser bedient.</P>
<P>So oder so, diese beiden CDs verk&ouml;rpern The Cure am allerbesten und zeigen deutlichst, was an deren Musik nun so wirklich besonderes ist. Auch die neueren, sprich die CDs nach der Desintegration brauchst Du erst einmal nicht kaufen. Die CDs waren zwar nicht schlecht, aber man mu&szlig; leider eingestehen, da&szlig; man ein klitzekleines bischen "Burn out" bemerkt.</P>
<P>Und BITTE ! - Nimm ja nicht die Mixed up als Beispiel f&uuml;r die Musik von dieser Gruppe. Es ist wirklich die untypischste Scheibe, die von denen je auf den Markt kam. Ich selbst habe sie nur der Vollst&auml;ndigkeit halber und auch die Gruppe selbst hat sich nie wieder mit der Musik auf dieser CD befasst, was sehr untypisch ist. Es gibt n&auml;mlich von jeder neuen CD auch ruckzuck eine LiveCD, nur eben von der Mixed up nicht. Das beweist alles, da&szlig; The Cure diese CD selbst niemals ernst genommen hatte.</P>
<P>Schade, da&szlig; Du Dir ausgerechnet diese CD gegriffen hast, ich hoffe sehr, da&szlig; Du noch einen weiteren Versuch startest, denn The Cure ist wirklich absolut einzigartig !</P>
<P>Ich befasse mich eigentlich fast nur mit Musik, die kaum jemand hier im Club kennen w&uuml;rde, da ist The Cure mit Abstand noch die Bekannteste. Sicherlich kennst Du auch noch Philip Boa, Smashing Pumpkins, Sisters of Mercy, aber bei Pixies, Frank Black usw. wirst Du weniger wissen, wer gemeint ist, stimmts ?</P>
<P>Also verzeih mir bitte, da&szlig; ich Dich nicht wegen der "Mjixed up" gleich vorgewarnt habe. H&auml;tte eigentlich logisch sein m&uuml;ssen, da&szlig; Murphy Dir ausgerechnet diese CD in die Hand gedr&uuml;ckt hat, es gibt ja nur etwa 48 andere Cure-CDs ....</P>
<P>Viel Spa&szlig; beim deprimiert sein .... mit The Cure geht selbst das </FONT><FONT FACE="Wingdings" SIZE=4>J</FONT><FONT SIZE=4> </P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=600 HEIGHT=11></P>
<FONT SIZE=4><P>* </FONT><FONT SIZE=4 COLOR="#00ffff">Yonder</P>
<P>&nbsp;</P>
<P>Guggugg, Yonder ..... sach ma´ .... hast Du mich schon v&ouml;llisch verjessen ?????</P>
<P>&Ouml;&ouml;hm, - bist Du zuf&auml;llig schon mit den &Uuml;bersetzungen der Texte zu EdWord und TextView angefangen ?</P>
<P>Ich bin mit dem vorletzten Workshopteil schon angefangen und m&ouml;chte Deine Texte da noch wirklich sehr gerne mit hinein nehmen ! Kannst Du die Dinger jetzt mal langsam mit fertig machen ? - Jaja, ich wei&szlig;, die Sonne scheint munter und fr&ouml;hlich und drau&szlig;en gibts Gegrilltest und Bier vom Fa&szlig; .... ich kanns ja verstehen, - es gibt bei sch&ouml;nem Wetter tausende Dinge, die mehr Spa&szlig; machen, als etwas f&uuml;r die Nocover zu tippen. Aber WIR wollen doch den Workshop noch h&uuml;bsch ordentlich zu Ende bringen, oder ?</P>
<P>Und zur gnadenlosen Perfektion geh&ouml;ren eben noch Deine Texte, also mach doch mal, - bekommst nat&uuml;rlich auch MEHR, als nur ein floskeliges "Danke sch&ouml;n", - das ist doch wohl Ehrensache ;-)</P>
<P>Und wenn Du schon mal an der Tastatur klebst (bei den Temperaturen kann man das W&Ouml;RTLICH nehmen ;-))), darfst Du mir ruhig auch mal nen Leserbrief tippen ;-)</P>
<P>Lass mal von Dir lesen und es Dir gutgehen !</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=625 HEIGHT=12></P>
<FONT SIZE=4 COLOR="#ffffff"><P>* Rolf N&uuml;nninghoff</P>
<P>&nbsp;</P>
<P>Na, von Dir habe ich ja ewig nichts mehr zu lesen bekommen - SCHADE ! Naja, umdrehen kann man das nat&uuml;rlich auch, denn vielleicht w&auml;re ich auch mal an der Reihe, Dir zu tippen.</P>
<P>So m&ouml;chte ich Dir nur kurz mitteilen, da&szlig; ich Emailtod bin und somit auf Deine wahrscheinlichen Emails zur Zeit nicht reagieren kann. Nat&uuml;rlich melde ich mich aber kurz bei Dir, wenn es weiter gehen kann. Modems habe ich nun ja wahrhaftig genug. Jetzt mu&szlig; nur noch der Amiga wieder fit gemacht werden. Einen neuen Diskletter sollst Du in absehbarer Zukunft auch mal wieder bekommen, - also habe bitte Geduld mit mir.</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=625 HEIGHT=12></P>
<FONT SIZE=4 COLOR="#c0c0c0"><P>* Snoopy</P>
<P>&nbsp;</P>
<P>Noch so Einer, von dem man nichts mehr sieht und h&ouml;rt ;-)</P>
<P>Du bekommst noch nen P&auml;ckchen von mir - wieder ein wenig zum basteln ;-) Leider funktionierte der PCMCIA-Controller immer noch nicht, - naja kann man eben wohl nichts daran &auml;ndern.</P>
<P>Du warst so richtig gut in Urlaub ? - Manno hast Du das aber gut, da bin ich aber h&ouml;chst neidisch ! - Bist Du schon mit "unserem" Projekt weiter gekommen ?</P>
<P>Na, warum soll ich hier soviel tippen ? Du bekommst ja sowieso noch Post .... Lass mal wieder von Dir h&ouml;ren !</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=625 HEIGHT=12></P>
<FONT SIZE=4 COLOR="#00ff00"><P>* Wolf Zimmer</P>
<P>Sicherlich wirst Du es etwas unsinnig finden, da&szlig; ich Dir &uuml;ber diesen Weg herzliche Gr&uuml;&szlig;e zukommen lassen m&ouml;chte. Aber das Problem ist mal wieder das &Uuml;bliche. Viele Leute sollen noch Diskettenbriefe und gew&ouml;hnliche Post bekommen und da weis ich noch nicht, wann ich zur Beantwortung Deines Briefes komme.</P>
<P>Da wollte ich dann doch wenigstens kurz Bescheid geben, da&szlig; es noch etwas dauern kann.</P>
<P>Also die besten Gr&uuml;&szlig;e nach Much und hoffentlich bald mal auf ein Zwischendurch per Email.</P>
</FONT><P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=625 HEIGHT=12></P>
<FONT SIZE=4><P>Nat&uuml;rlich gibt es noch so manche Menschen, die ich hier ausf&uuml;hrlicher gr&uuml;&szlig;en k&ouml;nnte, aber diejenigen haben k&uuml;rzlich erst Post bekommen und da darf mal ausnahmsweise ICH mich &uuml;ber Post hiervon freuen.</P>
<P>Also nur ganz allgemein kurze, aber herzliche Gr&uuml;&szlig;e und bis bald ....</P>
</FONT><FONT SIZE=4 COLOR="#ffffff"><P ALIGN="CENTER">Euer</P>
</FONT><I><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Cord Hagen</H1>
</I></FONT><P ALIGN="CENTER"><A HREF="MITGLIEDER/HAGEN.HTML"><B><FONT COLOR="#ffffff">HIGGINS</B></FONT></A></P>
<P ALIGN="CENTER"><IMG SRC="line5.gif" WIDTH=625 HEIGHT=12></P></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</HTML>
