<HTML>
<HEAD>
<TITLE>An Markus</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" BGCOLOR="#800000">
<I><U><FONT COLOR="#c0c0c0"><H1 ALIGN="CENTER">Moin Markus,....</H1>
</I></U></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<B><FONT SIZE=4 COLOR="#c0c0c0"><P>Peinlich, peinlich ..... da bastelst Du mal endlich wieder ein vom Konzept her v&ouml;llig geniales neues Programm und der olle HIGGINS mosert mal wieder nur herum ;-)</P>
<P>Aber mal im Ernst - Du wei&szlig;t schon, da&szlig; es &Auml;hnliches, wie VAT bereits gibt ? - Es sei denn, ich habe Deine Beschreibung v&ouml;llig falsch verstanden. Das Programm, was ich bislang f&uuml;r den Zweck von Aufzeichnung und Abspielen von Programm- und User-Aktionen kenne, nennt sich schlicht "Recorder". Ich habe es in der Version 1.2 von einer weniger aktuellen AminetCD !</P>
<P>Recorder ist von dem Programmierer Oliver Grimm (</B></FONT><A HREF="mailto:grimm@physnet.uni-hamburg.de">grimm@physnet.uni-hamburg.de</A><B><FONT SIZE=4 COLOR="#c0c0c0">) und die Version in meinem 2. C-Verzeichnis wurde am 27. M&auml;rz 96 vollendet.</P>
<P>M&ouml;chtest Du eventuell die -?-Ausgabe von Recorder sehen ?</P>
</B></FONT><FONT COLOR="#ffffff"><P>'Recorder' can record and play back key and mouse input events.</P>
<P>Usage: Recorder -(r|p[q]|a[q]) FILENAME</P>
<P>The mode indicators have the following meaning:</P>
<P>-r  Record input events to FILENAME</P>
<P>-p  Play input events stored in FILENAME         </P>
<P>-a  Play events in FILENAME </P>
<P>and then add moreThe input events are played back at the same speed as they were recorded,unless you use -pq or -aq. Then there will be a constant delay of1/50 second between all events.Recording and playing back is started and stopped by pressing Control,Left-Amiga and the's'-Key.Refer to the documentation for more details.</P>
</FONT><B><FONT SIZE=4 COLOR="#c0c0c0"><P>&nbsp;</P>
<P>Mich w&uuml;rde Dein VAT aber trotzdem interessieren, da ich mit RECORDER nicht gerade gl&uuml;cklich war. Eigentlich war ich n&auml;mlich auch auf der Suche nach so einem Programm f&uuml;r unser Projekt, &uuml;ber das noch kaum etwas veraten werden soll.</P>
<P>RECORDER w&auml;re vielleicht schon nicht &uuml;bel gewesen, aber erstens arbeitet es ungenau, weil der Mauspfeil zwischendurch verschoben werden kann und Du kannst Dir ja denken, was f&uuml;r ein Chaos entsteht, wenn alle Mausaktionen seitlich um zwei-drei Zentimeter verschoben abgespielt wurden. Selbst auf anderen Screens arbeitet das Programm erbarmungslos weiter, ohne R&uuml;cksicht auf Verluste. Diese Kleinigkeit macht das Ganze leider ungenie&szlig;bar, denn von einem solchen Programm sollen ja in erster Linie auch Anf&auml;nger profitieren und Die k&ouml;nnen alles Andere gebrauchen, als einen virtuellen, amoklaufenden Pseudolehrer ;-) !</P>
<P>Auf unserer Programmplanungsliste steht ein &auml;hnliches Programm, da&szlig; jedoch erheblich sicherer arbeitet, weil hierzu nicht REAL mit dem jeweiligem Programm gearbeitet wird. Wenn Du die Hilfen vom PC kennst, ist Dir ja vielleicht auch aufgefallen, da&szlig; Du nicht wirklich das erkl&auml;rte PROGRAMM siehst. Hier wird vom Prinzip her eher eine Art Video abgespielt. Aufzeichnungs- und Playerprogramme darf man hier sogar bei eigenen Projekten mit weitergeben, sofern man das Firmenlogo des Softwareherstellers mit ablichtet.</P>
<P>Beim PC wird gerne das Programm vom Lotus-Officepaket verwendet. Schade, da&szlig; wir so etwas noch nicht beim Amiga haben. Dein Programm ist im Moment da die beste Alternative, ABER wirklich NUR, wenn es idiotensicher l&auml;uft und nicht Amok l&auml;uft !</P>
<P>Es g&auml;be eine halbwegs akzeptable Alternative, mit der es sich shon leben lie&szlig;e. Hierzu m&uuml;&szlig;ten wir wenigstens mit Screenshots arbeiten, auf denen wir dann mit einem eigenem Zeiger herumwirbeln k&ouml;nnten, um die verschiedenen Dinge zu erkl&auml;ren, aber BITTE nicht mit Text oder &auml;hnlichem. Auch Anwendersoft kommt bald nur noch auf CD, also wird es auch beim Amiga h&ouml;chste Zeit f&uuml;r AUSF&Uuml;HRLICHE, klar verst&auml;ndliche Sprachausgabe !!!</P>
<P>Lieber Markus, - mir ist klar, da&szlig; Du immer noch einen schalen Nachgeschmack wegen meiner schlechten Manieren hast. Solltest Du aber trotzdem Lust haben, uns bei einem WIRKLICH gutem und au&szlig;ergew&ouml;hnlichem Projekt behilflich zu sein, dann w&uuml;rde ich mich tierisch &uuml;ber Brief oder vielleicht noch besser Deinen Anruf freuen. Ich suche h&auml;nderingend noch ein zwei weitere Programmierer. Eben sehr viel f&uuml;r einige Tools, die wir f&uuml;rs gesamte Projekt noch brauchen. Das Projekt ist &uuml;brigens kommerziell und selbstverst&auml;ndlich wird nach dem Verkauf der Reingewinn br&uuml;derlich unter den Mitwirkenden aufgeteilt. Bedingung aller Mitarbeiter war eine STRESSFREIE Arbeit - Du brauchst also keine Angst vor Termindruck haben. Wir sind fertig, wenn WIR fertig sind ! Deshalb m&ouml;chte ich auch &ouml;ffentlich noch nicht zuviel herum posaunen.</P>
<P>Ich w&uuml;rde mich jedenfalls sehr freuen, wenn Du uns noch ein bischen helfen m&ouml;chtest !!! Mit dabei sind zwei Programmierer und drei Leute, die sich um andere Dinge k&uuml;mmern. Geplant war das Ganze etwa kurz nach der n&auml;chsten Jahreswende, aber wenn wir nicht noch einen Programmierer dazu bekommen, wird sich das sicherlich noch weiter verschieben. Also, wenn Du Interesse hast, dann melde Dich doch ruhig mal .....</P>
<P>Und schreib mir doch bitte mal, ruhig als Leserbrief, wenn Dein VAT etwas krisenfester werkelt, denn dann schicke ich Dir nat&uuml;rlich ne Disk mit R&uuml;ckporto. Vielleicht k&ouml;nnten wir das ja schon irgendwie einsetzen ....</P>
<P>&nbsp;</P>
<P>Lass Dir das gut gehen und vielleicht auf bald ....</P>
</B></FONT><P><IMG SRC="image12.gif" WIDTH=573 HEIGHT=6></P>
<I><U><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">CORD</H1></I></U></FONT></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</HTML>
                                 