<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>
<body TEXT=black link=blue alink=red bgcolor="#FFFFDD">
<a name="top"></a><br>
<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr><td valign="top" bgcolor="#FFFFDD">
<center><img src="leser_WolfZ1.jpg" width=100 height=100>
</center></td>
<td><align="center"><font color="#000080" size="7">
<strong>Wolf's Leserbrief</strong><sup><sup><sup></font></td>
</tr></table><br>
<ul>
<li><a href="#a1"><b>f&uuml;r Sieglinde Peters</a></b>
<li><a href="#a2"><b>f&uuml;r Sven Kalus</a></b>
<li><a href="#a3"><b>an HTML-Selbstlayouter</a></b>
</ul><br><br>
<table border="2" width=100%><tr><td bgcolor="#FFFF99">
<p>
<a name="a1"><h3>Gr&uuml;&szlig; Dich Sieglinde!</h3><br>
Vielen Dank f&uuml;r Deine Mitteilung betreffs der HTML-Homepages von Fa.
Schatztruhe auf den Aminet-CD's. Auch an dieser Stelle kann ich nur
wiederholen, bei Bet&auml;tigung der Schaltfl&auml;che wird ein Requester
gezeigt:</p>
<p>
"Aminet22 ist schreibgesch&uuml;tzt" und die zwei obligatorischen Kn&ouml;pfe
"Nochmals versuchen" und "Abbrechen". Nur bei Abbrechen h&auml;ngt sich mein
4000er ganz einfach auf, der Mauszeiger ist eingefroren und nichts geht
mehr.</p>
<p>
Das gleiche Ph&auml;nomen auf Aminet23. Nur meine CD hatte zus&auml;tzlich den
Hardwarefehler, der von allen schnelllaufenden, neueren CD-ROMs nicht
&uuml;berlesen werden konnte. Bei der Nachlieferung fehlte dann schon die
Schaltfl&auml;che und auf Aninet24 war die Homepage auch nicht mehr dabei.</p>
<p>
Trotzdem w&uuml;rde es mich interessieren, ob bei Dir auf Aminet23 und -24 alle
Schaltfl&auml;chen unter Guides/Deutsch erscheinen und ob diese auch
tats&auml;chlich alle funktionieren? Vergleiche mit Einstieg &uuml;ber Index.
Oder besser und einfacher ist das gleichzeitige Anzeigen beider
Einstiegsm&ouml;glichkeiten z.B. mittels zweier Fenster mit DirOpus oder einem
Konkurenzprodukt.</p>
Gehe&#160;<a href="#top">zum Anfang</a>
</td></tr></table>
<table border="2" width=100%><tr><td bgcolor="#FFFF99">
<p>
<a name="a2"><h3>Gr&uuml;&szlig; Dich Sven</h3><br>
<p>
Zu Deinem Artikel &quot;Hass&quot; mu&szlig; ich doch ein paar Worte sagen. Es
gef&auml;llt mir ganz und gar nicht, dass Du Bill Gates und die Bibel in ein
Verh&auml;ltnis bringst. H&auml;ttest Du f&uuml;r Vergleiche mit Weissagungen
und Prophezeihungen den guten alten Nostradamus herangezogen und interpretiert,
h&auml;tte ich diese Zeilen nicht geschrieben. Aber so kann ich Deine Aussage
nicht widerspruchslos im Raum stehen lassen. Antichrist (=Gegenchrist) ist nach
Schrift und Tradtion der &quot;Mensch der Gesetzlosigkeit&quot;, der sich als
Christus ausgibt und gro&szlig;e Erfolge erringt, aber durch Christus
&uuml;berwunden wird. Diese Lehre braucht nicht als Mythologem aufgefa&szlig;t
oder als blo&szlig;e Typologie f&uuml;r die Kampfsituation des Christen und der
Kirche erkl&auml;rt zu werden, da ja die Heils- und Unheilsgeschichte von
geschichtsm&auml;chtigen Personen getragen ist und ihr k&auml;mpferischer
Charakter sich gegen Ende hin noch versch&auml;rft. Andererseits ist durch die
Aussagen der Schrift nicht ausgeschlossen, dass dort im Grunde unter Antichrist
alle von Menschen getragenen widerg&ouml;ttlichen Geschichtsm&auml;chte
personhaft verstanden werden.</p>
<p>
Soweit meine Auffassung zu Bill Gates als Antichrist. Wenn Du in dieser Richtung
Dich mal schlauer machen willst und Dich daf&uuml;r interessierst, dann empfehle
ich Dir:<br>
&quot;Christ sein&quot; von Hans K&uuml;ng erschienen im Deutschen Taschenbuch
Verlag M&uuml;nchen, ein Buch für Christen und Atheisten, Gnostiker und
Agnostiker, Pietisten und Positivisten, laue und eifrige Katholiken,
Protestanten und Orthodoxe (gem. Einband). </p>
Gehe&#160;<a href="#top">zum Anfang</a>
</td></tr></table>
<table border="2" width=100%><tr><td bgcolor="#FFFF99">
<p>
<a name="a3"><h3>Hallo Ihr HTML-Selbstlayouter!</h3><br>
In den Rubriken Diskussionen, Small Talk und in den Leserbriefen wird teilweise
vehement &uuml;ber das F&uuml;r und Wider von HTML zu Magnetic Pages geschimpft,
gelobt, hergezogen, aber auch nur geredet. Eines haben wir aber alle gemeinsam,
wir m&uuml;ssen umdenken und neu lernen. Das Gescheiteste w&auml;re es, wenn wir
einen Katalog h&auml;tten, aus dem hervorgeht, welche HTML-Befehle der jeweilige
Browser erkennt und wie werden sie umgesetzt. Leider bleibt uns nichts anderes
&uuml;brig, als zu testen, wie die einzelnen Programme unseren Layoutversuch
interpretieren.</p>
<p>
Eines hat die NoCover-52 gezeigt, die Verwendung von &lt;VER&gt; und
&lt;/VER&gt; ist sehr gef&auml;hrlich, da man mindestens bei dem einen Versuch
am besten zwei Bildschirme nebeneinder stehen h&auml;tte, damit der
&Uuml;berlauf des Textes nicht immer nur mittels Schiebebalken lesbar gemacht
werden mu&szlig;. Bei Aufzeigen von Statistiken bietet sich die Verwendung der
blinden Tabellen an (ohne Border). Ist zwar mehr Schreibarbeit, aber es bleibt
lesbar. Ich wei&szlig;, auch meine Wolf-INFO ist nur bei IBrowse richtig zu
betrachten. Bevor ich wieder die etwas komlizierten Font-Angaben machen werde,
werde ich mein Produkt vor Versandt mit den drei g&auml;ngigen Browsern
testen.</p>
<p>
Aber auch die Color-Nuancierungen sollte man sich etwas &uuml;berlegen. Dieser
Leserbrief wurde unter einem 8-Bit Screen erstellt und sieht mittels IBrowse
nach meinem Geschmack einigerma&szlig;en aus. Bei Verwendung eines 16-Farben
Bildschirmes, wird alles schon eint&ouml;niger. Und mit AWeb31 sieht alles ganz
anders aus und Voyager2.88 verf&auml;lscht die Farben noch mehr. Aber auch bei
Verwendung der 256 Farben-WB gibt es Differenzierungen mit den angesprochenen
drei Browsern. Deshalb bleibe ich bei IBrowse.</p>
<center>Farbnamen f&uuml;r die 16 Grundfarben

<table cellspacing=5 cellpadding=5 border>
<tr>
<td class="doc" bgcolor=#EEEEEE><b>Farbname</b></td>
<td class="doc" bgcolor=#EEEEEE><b>Hexadezimal</b></td>
<td class="doc" bgcolor=#EEEEEE><b>Beispiel-Farbname</b></td>
<td class="doc" bgcolor=#EEEEEE><b>Beispiel-Hexadezimal</b></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>black</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#000000</tt></td>
<td bgcolor=black></td>
<td bgcolor="#000000"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>maroon</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#800000</tt></td>
<td bgcolor=maroon></td>
<td bgcolor="#800000"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>green</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#008000</tt></td>
<td bgcolor=green></td>
<td bgcolor="#008000"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>olive</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#808000</tt></td>
<td bgcolor=olive></td>
<td bgcolor="#808000"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>navy</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#000080</tt></td>
<td bgcolor=navy></td>
<td bgcolor="#000080"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>purple</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#800080</tt></td>
<td bgcolor=purple></td>
<td bgcolor="#800080"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>teal</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#008080</tt></td>
<td bgcolor=teal></td>
<td bgcolor="#008080"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>gray</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#808080</tt></td>
<td bgcolor=gray></td>
<td bgcolor="#808080"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>silver</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#C0C0C0</tt></td>
<td bgcolor=silver></td>
<td bgcolor="#C0C0C0"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>red</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#FF0000</tt></td>
<td bgcolor=red></td>
<td bgcolor="#FF0000"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>lime</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#00FF00</tt></td>
<td bgcolor=lime></td>
<td bgcolor="#00FF00"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>yellow</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#FFFF00</tt></td>
<td bgcolor=yellow></td>
<td bgcolor="#FFFF00"><br></td>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>blue</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#0000FF</tt></td>
<td bgcolor=blue></td>
<td bgcolor="#0000FF"><br></td>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>fuchsia</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#FF00FF</tt></td>
<td bgcolor=fuchsia></td>
<td bgcolor="#FF00FF"><br></td>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>aqua</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#00FFFF</tt></td>
<td bgcolor=aqua></td>
<td bgcolor="#00FFFF"><br></td>
</tr>
<tr>
<td class="code" bgcolor=#FFFFE0><tt>white</tt></td>
<td class="code" bgcolor=#FFFFE0><tt>#FFFFFF</tt></td>
<td bgcolor=white><br></td>
<td bgcolor="#FFFFFF"><br></td>
</tr>
</table>

Diese Tabelle stammt aus der Dokumentation SelfHTML von Stefan M&uuml;nz.
</center><br>
<p>
Der einzige Browser, der Farbname und Hexadezimalwert identisch interpretiert,
ist AWeb31, aber auch nur auf einem 256-Farbenbildschirm. Bei Ibrowse gibt es
bei zwei st&auml;rkeren Abweichungen nur nuancielle Unterschiede. Voyager
mu&szlig; noch sehr viel lernen.</p><br><br>
<p>
<table cellspacing=5 cellpadding=5 border=0><tr><td>
<img src="leser_WolfZ2.jpg" width=160 height=240 align=left>
</td><td>
Und nun ein Bild, wie die Farben auf einem 16-Farbenschirm (oder h&ouml;her)
aussehen sollten. Auf einem 8-Farben oder 4-Farbenschirm habe ich nat&uuml;rlich
nicht getestet. Das Bild wird von allen drei Browsern einigerma&szlig;en
richtig dargestellt.</p>
<p>
&Uuml;ber die Gr&ouml;&szlig;e der Bilder sollte man sich auch Gedanken
machen. Es hat sich herumgesprochen, dass die meisten User noch eine
Bildschirmaufl&ouml;sung von 640 Pixel in der Breite nutzen. Aber jeder Rahmen
eines Sreens ben&ouml;tigt auch Pixel für die Optik. Aus diesem Grunde schlage
ich vor, die Bilder h&ouml;chstens 600 Pixel breit zu machen und am Besten mit
den &ltCENTER&gt Tags zu versehen. Es entf&auml;llt der horizontale Schiebebalken am
unteren Ende des Schirms.</p>
</td></tr></table>
<p>
Hier schnell noch ein paar Zahlen: In der NC-45 waren 1.165.786 Bytes ASCII
Daten, die Bilddaten habe ich nicht errechnet. In der NC-52 sind 1.348.063 Bytes
ASCII-Daten und 992.527 Bytes Bilddaten (jpg / gif / pat). Das Verh&auml;ltnis
Text- &#160;zu Bilddaten betr&auml;gt dabei 57,6% zu 42,4%. In Amiga Aktuell
liegt der Bildanteil bei 37,5%. Die Diskette 52a ist leider nur zu 60% belegt,
also noch reichlich Platz. Es ist aber zu bedenken, je gr&ouml;&szlig;er die
Bilder werden, je weniger Text pa&szlig;t auf die Disketten. Auch sollte man
weiterhin davon Abstand nehmen, Musikmodule wieder mit aufnehmen zu wollen.</p>
</td></tr></table>
Gehe &#160;<a href="#top">zum Anfang</a> oder auch nicht!
<p>
Autor: &#160;<a href="Mitglieder/zimmer.html">Wolf Zimmer</a><br>
E-Mail:<a href="mailto:022451486-0001@t-online.de">
022451486-0001@t-online.de</a></p>
<center>
<a href="NoCover.html"><img border=0 src="l_hauptinhalt.jpg" width=500 height=75></a>
</center>
</body>
</html>

