<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red bgcolor=white>
<CENTER>
</CENTER>

<P><H1>Damals...oder: was ein PowerPC-Board ausmacht</H1></P>


Tut mir leid, diesen Monat wird es leider keine R&#252;ckblende auf
die vergangenen Jahre geben. Nach langen Tagen und Wochen (!!!)
zwischen Hoffen und Bangen habe ich am 17.06. endlich meine
langersehnte PowerPC-Karte bekommen. Und auf der Karte ist ja
ein SCSI-Hostadapter integriert, und zwar ein UltraWideSCSI.
Sch&#246;n und gut, aber der Anschlu&#223; ist nat&#252;rlich nicht der gleiche
wie bei FastSCSI-2, welches auf der Cyberstorm MKII vorhanden
war. Unter anderem gibt es auch serienm&#228;&#223;ig keinen externen
Anschlu&#223;. Und das ist auch der Grund, weshalb es hier nicht den
erwarteten Text gibt: ich kann zur Zeit meinen Scanner nicht
benutzen. Und da ich auf jeden Fall das Cover mit reinbringen
will, gibt es eben diesmal gar keinen Text. Tja, so ist das
nun mal...<P>

Aber nicht verzweifeln, sobald ich einen PC habe, wird es
weitergehen - ok, sobald ich ein passendes Kabel habe.<P>

Vielleicht sollte ich hier einfach mal &#252;ber meine ersten
Eindr&#252;cke von der CyberstormPPC604e-233MHz f&#252;r A4000 sprechen.
Sonst gibts ja nicht viel zu schreiben...<P>

Einbau - unproblematisch, au&#223;er, da&#223; ich den 68040 von der
MKII abhebeln und auf das PPC-Board stecken mu&#223;te. Das war
schon das Schwierigste. Software von Diskette installiert
- l&#228;uft. Super! Auf der CD sind nur ein paar Demoprogramme
in zumeist veralteten Versionen (z.B. IsisPPC 2.2 anstatt
mindestens 2.9), aber auch Elastic Dreams von Titan. Von
Echtzeit kann zwar keine Rede sein (zumindest, wenn man es
mal mit zum Beispiel &quot;Fastmorpher&quot; von Michiel den Outer
vergleicht), aber die Qualit&#228;t ist einfach &#252;berw&#228;ltigend.<P>

Allzu viele PowerPC-Programme gibt es ja noch nicht (einmal
von vielen kleinen Tools abgesehen). Ich hoffe, es kommen
noch mehr gute Programme. Die besten, die ich getestet habe,
stelle ich hier mal vor:<P>

AD**mPPC 1.3: eine der besten D**m-Konvertierungen f&#252;r den Amiga.
Bei mir l&#228;uft es z.B. bei einer Aufl&#246;sung von 800X600 vollkommen
fl&#252;ssig. Es ist eher schon einen Tick zu schnell!!! Wahnsinn.<P>

WolfPacPPC: eine Pac-Man-Variante in drei Dimensionen aus der
Ich-Perspektive. Hat nicht so eine gute 3D-Engine wie D**m, kann
sich aber auch sehen lassen. Ist f&#252;r meinen Geschmack auf die
Dauer etwas langweilig.<P>

UAE-PPC: Der Un*x-Amiga-Emulator emuliert hervorragend einen
Amiga auf einem Amiga... Leider l&#228;ngst nicht so schnell, wie auf
einem Pentium. Zum Beispiel ist es auf einem Pentium233 mit PCI-
Grafikkarte m&#246;glich, ohne Frame-skip zu &quot;arbeiten&quot;. Bei mir auf
dem PowerPC233 mit ZorroIII-Grafikkarte mu&#223; ich schon auf 3
stellen (also, da&#223; nur jedes 3. Bild angezeigt wird), um vern&#252;nftig
&quot;arbeiten&quot; - sprich spielen - zu k&#246;nnen. Trotzdem ist z.B.
Turrican 2 sehr gut spielbar, alles inklusive Ton.<P>

MAME-PPC: der Arcade-Emulator. Endlich laufen die Spiele, die
vorher nur krochen, in voller Geschwindigkeit. Hier spielt der
PowerPC seine Kraft voll aus. Bei manchen Spielen und Einstellungen
sind Geschwindigkeiten von &#252;ber 400% des Originals m&#246;glich! Nur
mit PPC ist MAME &#252;berhaupt zu empfehlen (allerdings kenne ich
nur MAME040 auf einem 040/40MHz, ich wei&#223; nicht, ob ein 060/50MHz
vielleicht auch schnell genug ist).<P>

Frodo 4.1a-PPC: WarpOS-Port des C64-Emulators. Leider noch ganz
ohne Ton. Daf&#252;r aber genauso kompatibel wie der PC-Port. Und auch
fast so schnell. Hier mu&#223; man die Geschwindigkeit auch drosseln,
weil er auch hier im Leerlauf an die 300% eines &quot;echten&quot; C64 schafft.
Frodo 4.1 auf 68040/40MHz schafft dagegen nicht mal im Leerlauf
die volle Geschwindigkeit. Bei Belastung sinkt der Speed auf etwa
10-20%. Unspielbar ohne PPC.<P>

Soweit erstmal mein kurzer &#220;berblick. Vielleicht hat Euch dies
ja als Ersatz f&#252;r den nicht Vorhandenen &quot;Damals-Bericht&quot; auch
gefallen.<P>

Ach ja, vielleicht interessieren Euch ja noch folgende Werte:<P>

68040/40MHz:     28.97 MIPS und  10.98 MFLOPS<BR>
PPC604e/233MHz: 335.98 MIPS und 217.35 MFLOPS<P>

Beides gemessen mit SysSpeed V2.6.<P>

Bis die Tage,<P>
 <HR><BR>
 <a href="mitglieder/etzrodt.html">Andreas Etzrodt </a> <BR>
 <a href="mailto:shark@nwn.de">  E-Mail: shark@nwn.de</a><P>


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
