<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
 <tr>
  <td align="center" width="100%" bgcolor="#808080"><font
  color="#0000FF" size="3" face="arial"><b>
  meine Statements und andere Nachrichten
  </b></font></td>
 </tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
 <tr>
  <td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
  <p><a href="#a1"><font size="1" face="arial">Urteil gegen Felix Somm
  </font></a></p>
  <p><a href="#a1a"><font size="1" face="arial">Stimmen zum Somm-Urteil
  </font></a></p>
  <p><a href="#a1b"><font size="1" face="Arial">Internet-Online-Anbieter zum Somm-Urteil
  </font></a></p>
  <p><a href="#a2"><font size="1" face="arial">Meldungen aus der Online-Szene
  </font></a></p>
  <p><a href="#a4"><font size="1" face="arial">HTML-FAQ</font></a></p>
  <p><a href="#a3"><font size="1" face="arial">Top 5</font></a></p>
  
  <p><font color="#000080"><b>Wolf-INFO</b></font><br>
  <font size="1">von</font><br>
  <a href="Mitglieder/zimmer.html">Wolf Zimmer</a><br>
  E-Mail: <a href="mailto:022451486-0001@t-online.de"><font
  size="1" face="arial">022451486-0001@t-online.de</font></a></p>
    <p><a href="NoCover.html"><font size="1" face="arial">Zurück zum NoCover-Index
  </font></a></p>
  </td>
  <td valign="top"><a name="a1"><font color="800000" size="7">
  <b>Urteil gegen Felix Somm</font></b></a><br>
  <p>  Aus den CompuServe Nachrichten vom 01.06.1989 habe ich nachfolgende
  Artikel herausgezogen und hier ohne Ver&auml;nderung wiedergegeben.</p>

  <p>Obwohl Verteidigung und sogar der Staatsanwalt auf
  Freispruch pl&auml;diert hatten, hat ein M&uuml;nchner Amtsgericht gestern den
  ehemaligen Gesch&auml;ftsf&uuml;hrer von <a href="http://www.compuserve.de">
  CompuServe </a>&#160; Deutschland, <a href="http://www.somm.com">Felix
  Somm</a>, wegen Beihilfe zur Verbreitung von Kinderpornographie zu
  einer Bew&auml;hrungsstrafe verurteilt. &quot;Es darf im Internet keine
  rechtsfreien R&auml;ume geben&quot;, so die Begr&uuml;ndung von Richter Wilhelm
  Hubbert. Das Urteil hat in der Branche und in den Medien heftige
  Reaktionen ausgel&ouml;st. Der Deutsche Multimedia Verband sprach von einem
  &quot;Schlag gegen die Multimedia-Industrie in Deutschland&quot; und
  der eco-Verband bezeichnete das Urteil als ein &quot;verheerendes
  Signal f&uuml;r ausl&auml;ndische Investoren.&quot; Die Verteidigung will gegen
  das &quot;Skandalurteil&quot; (Verteidiger Wolfgang Dingfelder)
  Rechtsmittel einlegen. Auch von Seiten der Politik gab es teilweise
  harsche Reaktionen. Der Sprecher von B&uuml;ndnis90/Die Gr&uuml;nen sprach von
  einem &quot;schwarzen Tag f&uuml;rs Internet&quot; und der Internet-Experte
  der SPD, J&ouml;rg Tauss, erkl&auml;rte zu dem Urteil: &quot;Damit kommt einem
  bayerischen Amtsgericht das zweifelhafte Verdienst zu, das Internet in
  Deutschland zu ruinieren.&quot; </p>
  </td>
</table>
<p><a name="a1a"><font color="#800000" size="5"><b>Stimmen zum Somm-Urteil
</font></b></a></p>

<p><b>Hannoversche Allgemeine:</b><br>
Medienkenner bef&uuml;rchten nach dem M&uuml;nchener Urteil bleibenden Schaden f&uuml;r
die deutsche Wirtschaft, sollte die Entscheidung Bestand haben.</p>

<p><b>Mainpost:</b><br>
Mit dem Urteil gegen Felix Somm, Ex-Chef von Compuserve Deutschland,
ignoriert das Gericht nicht nur die Pl&auml;doyers von Verteidigung und sogar
Staatsanwaltschaft - beide hatten Freispruch gefordert -, sondern auch
die Realit&auml;t.</p>

<p><b>Rhein Zeitung:</b><br>
Mit seinem Urteil gegen den Internetanbieter Compuserve hat der
bayerische Amtsrichter Wilhelm Hubbert tiefe innere &Uuml;berzeugung
bewiesen. Und noch tiefere Unkenntnis.</p>

<p><b>Wiebadener Kurier:</b><br>
Zehn Monate nach seinem Inkrafttreten ist das neue Multimediagesetz des
Bundes vom bayerischen Amtsrichter Wilhelm Hubbert zun&auml;chst einmal zur
Makulatur erkl&auml;rt worden.</p>

<p><b>Stuttgarter Nachrichten:</b><br>
S&uuml;ndenbock: Ein Richter hat einen Schuldigen gefunden.</p>

<p><b>Bundesforschungsminister J&uuml;rgen R&uuml;ttgers (CDU):</b><br>
Die Entwicklung des Internets in Deutschland darf nicht behindert
werden. Hier geht es um die Arbeitspl&auml;tze der Zukunft.</p>

<p><b>Passauer Neue Presse:</b><br>
Das gab's noch nie in Deutschland: Das Amtsgericht M&uuml;nchen hat gestern
einen Online- Anbieter wegen Kinderpornographie im Internet zu einer
Haftstrafe verurteilt. </p>

<p><b>Neue Westf&auml;lische:</b><br>
Das Urteil ist eine Schande. Es zeugt von einer vollst&auml;ndigen
Verbohrtheit des Richters. Es zeugt aber auch davon, da&szlig; das nach
jahrelangem z&auml;hen Ringen verabschiedete Multimediagesetz des Bundes
offenbar nicht das Papier wert ist, auf dem es geschrieben steht.</p>

<p><b>K&ouml;lner Stadt-Anzeiger:</b><br>
Ist er t&ouml;richt oder gar tollk&uuml;hn? Der Amtsrichter Wilhelm Hubbert aus
M&uuml;nchen, der gestern den Ex-Manager von CompuServe zu zwei Jahren Haft
auf Bew&auml;hrung verdonnert hat, will jedenfalls ein Signal setzen.</p>

<p><b>TAZ:</b><br>
Bayern bleibt sauber. V&ouml;llig &uuml;berraschend hat gestern das Amtsgericht
M&uuml;nchen Felix Somm, den ehemaligen Gesch&auml;ftsf&uuml;hrer der deutschen Tochter
des Onlinedienstes CompuServe, zu zwei Jahren Haft auf Bew&auml;hrung
verurteilt. </p>

<p><b>Berliner Zeitung:</b><br>
Fr&uuml;her war es &uuml;blich, den &Uuml;berbringer schlechter Nachrichten zu
bestrafen. An der Schwelle des 21. Jahrhunderts passierte Felix Somm
etwas &Auml;hnliches. </p>

<p><b>SPIEGEL Online:</b><br>
Die Leichtfertigkeit, mit der Amtsrichter Wilhelm Hubbert erst einen
Antrag der Verteidigung abschmetterte, das Verfahren wegen seiner
grunds&auml;tzlichen Bedeutung ans Landgericht zu &uuml;berweisen, und mit der er
sich jetzt &uuml;ber die Statements der Experten und die Pl&auml;doyers von
Staatsanwaltschaft und Verteidigung hinweggesetzt hat, ist skandal&ouml;s.
</p>

<p><b>Die Welt:</b><br>
Landet jetzt auch Telekom-Chef Ron Sommer hinter Gittern, weil per
Telefon schon so manche Straftat ausgekl&uuml;ngelt wurde? Fassungslos
stellen diese Frage all jene in den Raum, die &uuml;ber das Compuserve-Urteil
aus Bayern entsetzt sind. </p>

<p><b>S&uuml;ddeutsche Zeitung:</b><br>
Was ist in den M&uuml;nchner Amtsrichter gefahren? Wollte er ein Exempel
statuieren, aus Wut dar&uuml;ber, da&szlig; sich das Internet aus technischen
Gr&uuml;nden dem Einflu&szlig; der deutschen Jurisprudenz entzieht? </p>

<p><b>Chaos Computer Club (CCC):</b><br>
Hier handelt es sich um die Privatmeinung eines hinterw&auml;ldlerischen
bayrischen Richters.</p>

<p><b>eco-Vorsitzender Michael Schneider:</b><br>
Deutsches Gericht f&uuml;gt der deutschen Internet-Wirtschaft schweren
Schaden zu. </p>

<p><b>Paulus Neef, Vorsitzende des Deutschen Multimedia Verbandes:</b><br>
Dieses Urteil ist ein Schlag gegen die gesamte Multimedia-Industrie in
Deutschland.</p>

<p><b>Arne Brand, Pressesprecher des VOV (Virtueller Ortsverband der
SPD):</b><br>
Richter Wilhelm Hubbert, der sich zu Beginn des Prozesses zun&auml;chst
erkl&auml;ren lassen mu&szlig;te, wie das Internet &uuml;berhaupt
funktioniert, hat nicht nur dem Technologiestandort Deutschland einen
B&auml;rendienst erwiesen, sondern auch die deutsche Justiz in der
weltweiten Netz&ouml;ffentlichkeit der L&auml;cherlichkeit
preisgegeben.</p>

<p><b>Bayerns Wirtschaftsminister Otto Wiesheu (CSU):</b><br>
Das Urteil wird den technischen Besonderheiten des Internets nicht
gerecht. Seit der Verabschiedung dieses Gesetzes m&uuml;&szlig;te klar sein, da&szlig;
Anbieter f&uuml;r fremde Inhalte, f&uuml;r die sie lediglich den Zugang
vermitteln, nicht verantwortlich sind.</p>
Gehe&#160;<a href="#top">zum Anfang</a>
<hr color="#FF00FF"><br>
<p><a name="a1b"><font color="#800000" size="5"><b>Internet-Online-Anbieter
zum Somm-Urteil</font></b></a></p>
<p>Die f&uuml;hrenden deutschen Internet-Online-Provider sehen in der
Folge des Urteils gegen den ehemaligem Gesch&auml;ftsf&uuml;hrer von
CompuServe Deutschland ihre Gesch&auml;ftsgrundlage in Deutschland
gef&auml;hrdet. <a href="http://www.t-online.de"> T-Online</a>,
<a href="http://www.aol.de">AOL</a>,
<a href="http://www.compuserve.de">CompuServe</a> und
<a href="http://www.germany.net">germany.net</a> haben in einer
gemeinsamen Erkl&auml;rung ihre Bef&uuml;rchtung ge&auml;u&szlig;ert,
da&szlig; nun eine Situation der Rechtsunsicherheit entsteht, wie sie
vor der Verabschiedung des Multimedia-Gesetzes im vergangenen Jahr
herrschte. Dies f&uuml;hre nicht nur zu einer unertr&auml;glichen
Belastung f&uuml;r das verantwortliche Management, sondern stelle die
Entscheidung, in Deutschland einen Online-Dienst zu betreiben oder
Zugang zum Internet zu vermitteln, grunds&auml;tzlich in Frage. Das
M&uuml;nchner Urteil mache Felix Somm - und damit potentiell die
Gesch&auml;ftsf&uuml;hrer anderer Internet-Online-Provider in
Deutschland - zu S&uuml;ndenb&ouml;cken f&uuml;r die Taten anderer und
leiste keinerlei konstruktiven Beitrag zu einer wirkungsvollen
Bek&auml;mpfung krimineller Inhalte im Internet. </p>

Gehe&#160;<a href="#top">zum Anfang</a>
<hr color="#FF00FF"><br>
<p><a name="a2"><font color="800000" size="7"><b>
<center>Meldungen aus der Online-Szene</font></b></a></center></p>
<p><b>KABEL 1 startet Online-Wettbewerb f&uuml;r Schulen:</b><br>
Im Rahmen des Medienforum NRW plant <a href="http://www.kabel1.de">
KABEL 1</a> in Kooperation mit namhaften Kommunikationsunternehmen den
Online-Wettbewerb &quot;Talents 2000 - Die Jobb&ouml;rse der
Zukunft&quot;. Darin werden Sch&uuml;ler aufgefordert, ihre Ideen zu
einem modernen Kommunikationsunternehmen konzeptionell zu entwickeln.
Insbesondere sollen folgende Fragen heraus gearbeitet werden: Wie sieht
das Unternehmen der Zukunft aus, welche Jobs gibt es in der Zukunft,
welche F&auml;higkeiten mu&szlig; man im zuk&uuml;nftigen Arbeitsmarkt
haben. Die Teilnehmer k&ouml;nnen in Gruppen ihre Vorschl&auml;ge
erarbeiten und m&uuml;ssen auf die Umsetzbarkeit ihrer Ideen achten. Die
besten drei Vorschl&auml;ge werden pr&auml;miert, der erste hat die
Chance, online umgesetzt zu werden.</p>

<p><b>S&Uuml;DDEUTSCHE kooperiert mit Loewe:</b><br>
Der <a href="http://www.sueddeutsche.de/">S&uuml;ddeutsche Verlag</a>
und Loewe New Media in Kronach wollen in Sachen Internet kooperieren.
Beide Unternehmen haben dazu eine gemeinsame Tochter SV New Media
gegr&uuml;ndet, an dem das M&uuml;nchner Verlagshaus mit 51 Prozent und
Loewe New Media mit 49 Prozent beteiligt sind. Die neugegr&uuml;ndete
Firma soll insbesondere den Internet-Dienst SZonNet redaktionell
betreiben und dar&uuml;ber hinaus alle Online-Aktivit&auml;ten der
Verlagsgruppe koordinieren.</p>

<p><b>Fireball und Libri kooperieren: </b><br>
Das Suchsystem </font><a href="http://www.fireball.de">Fireball</a> und
die Online-Buchhandlung <a href="http://www.libri.de">Libri</a> haben
eine Kooperation vereinbart. Inhalt der Vereinbarung sind dynamische
Links auf das Buchangebot von Libri, die zu jeder Suchanfrage eines
Teilnehmers bereitgestellt werden. Auf internationaler Ebene gibt es
eine solche Kooperation schon zwischen der Suchmaschine Altavista und
dem US-Online-Buchh&auml;ndler Amazon.</p>

<p><b>US-Senat versch&auml;rft Urheberrecht im Internet:</b><br>
Einstimmig verabschiedet hat der amerikanische Senat den &quot;Digital
Millennium Copyright Act&quot;. Das neue Gesetz sieht eine erhebliche
Versch&auml;rfung des urheberrechtlichen Schutzes f&uuml;r
Computer-Software, Musik, Filmen und schriftstellerischen Werken, die
&uuml;ber das Internet abgerufen werden k&ouml;nnen, vor. W&auml;hrend
Personen, die solche Copyright-Verletzungen begehen, k&uuml;nftig mit
erheblichen Strafen und Schadenersatzforderungen zu rechnen haben,
haften Online-Dienste k&uuml;nftig nicht mehr f&uuml;r
Copyrightverst&ouml;&szlig;e, die von ihren Kunden begangen werden.</p>

<p><b>Internet-Boom in China:</b><br>
&Uuml;ber 820.000 Internet-Nutzer gab es laut eines Berichtes der
Nachrichtenagentur Xinhua Ende M&auml;rz in China. Innerhalb von
f&uuml;nf Monaten seien die Userzahlen um 32 Prozent gestiegen. Nach
einer von Xinhua zitierten Studie sind 78,5 Prozent der chinesischen
Internetsurfer zwischen 21 und 35 Jahre alt. Allein in Peking sitzen 36
Prozent der Internetuser, Platz zwei belegt die s&uuml;dliche Provinz
Guangdong mit 8,3 Prozent, gefolgt von Schanghai mit acht Prozent.</p>

<p><b>Richter geht zu Bertelsmann Fachinformation</b><br>
J&uuml;rgen Richter wird zum 1.7.1998 neuer Chef der <a
href="http://www.bertelsmann.de">Bertelsmann</a> Fachinformation in
M&uuml;nchen. Ab diesem Zeitpunkt wird dieser Bereich dem designierten
Vorstandsvorsitzenden Dr. Thomas Middelhoff direkt zugeordnet. Mit
dieser organisatorischen Ver&auml;nderung sollen die strategischen
Optionen f&uuml;r die Weiterentwicklung der Gesch&auml;fte der
Bertelsmann Fachinformation ausgebaut werden. Dr. J&uuml;rgen Richter
begann seine Karriere in der Medienbranche bei Gruner + Jahr. Neun Jahre
war er Gesch&auml;ftsf&uuml;hrer der Konzernholding Medien Union
Ludwigshafen. Von 1994 bis 1997 f&uuml;hrte er als Vorstandsvorsitzender
die Axel Springer Verlags AG. Bernhard von Minckwitz, der bisherige
Leiter der Bertelsmann Fachinformation, wird einen neuen Job bei der
Buch AG von Bertelsmann &uuml;bernehmen.</p>

<p><b>IDG und CNN Interactive beschlie&szlig;en
Allianz </b><br>
<a href="http://www.idg.net">IDG.net</a> und <a
href="http://www.cnn.com">CNN interactive</a> haben einen
internationalen Kooperationsvertrag f&uuml;r das Internet geschlossen.
IDG.net wird k&uuml;nftig f&uuml;r CNN Interactive prim&auml;rer
Zulieferer von Nachrichten aus dem Bereich Computertechnologie. Die
f&uuml;hrenden Fachzeitschriften von IDG wie etwa Computer World, PC
World und Info World werden CNN mit Nachrichten und Features versorgen.
Im Gegenzug erhalten Nutzer von IDG.net Zugang zu den aktuellsten
Neuigkeiten von CNN interactive. </p>

<p><b>E-Mail-Werbung f&uuml;r unzul&auml;ssig </b><br>
Das Landgericht Berlin hat in zwei Entscheidungen das Zusenden
unverlangter E-Mail-Werbungen f&uuml;r unzul&auml;ssig erkl&auml;rt und
f&uuml;r den Fall der Zuwiderhandlung den Werbenden ein Ordnungsgeld bis
zu 500.000,- DM auferlegt. Bereits im letzten Jahr hatte das Landgericht
Traunstein unverlangte Werbe-E-Mails an Privatpersonen f&uuml;r
rechtswidrig erkl&auml;rt. Das Landgericht Berlin schrieb diese
Rechtsprechung jetzt fort. Neu ist, da&szlig; nun auch Privatpersonen
ihren Unterlassungsanspruch selbst geltend machen k&ouml;nnen und auch
Freiberufler oder Gewerbetreibende vor unverlangter Werbung
gesch&uuml;tzt sind. Die Entscheidungen k&ouml;nnen im Volltext unter <a
href="http://www.online-recht.de"> http://www.online-recht.de</a>
nachgelesen werden.</p>

Gehe&#160;<a href="#top">zum Anfang</a>
<hr color="#FF00FF"><br>
<p><a name="a4"><font color="800000" size="7"><b>
<center>HTML-FAQ</b></font><br></a></center></p>

<p>Es ist wohl an der Zeit, dass sich jemand &#252;berlegt, ob es sinnvoll
w&#228;re, in der NoCover ein HTML-FAQ anzulegen. Vielleicht gibt es schon einen
unter uns, der solch eine Sisyphusarbeit begonnen hat und sie
ver&#246;ffentlichen m&#246;chte, auch mit dem Hintergedanken, weitere
Anregungen und Fragen/Antworten f&#252;r dieses Werk zu erhalten.</p>

<p>Dass eine solche Hilfe sehr sehr notwendig ist, kann man daran erkennen, dass
die derzeigen Browser nur den HTML Standard 3.2 interpretieren und dies auch
noch nicht einmal in vollem Umfang. Um effektiv arbeiten zu k&#246;nnen,
mu&#223; leider in manchen Dingen explizit auf kleine Details geachtet
werden.</p>

<p>Ein Beispiel, welches mir in diesem Zusammenhang adhoc einf&#228;llt: Die
Verwendung des Tags &quot;&lt;font&gt; und &lt;/font&gt;&quot;. Man sollte doch
annehmen, dies sei doch sonnenklar. Vonwegen. Wenn &lt;/font&gt; nicht als
erstes Ende-Tag gesetzt wird, bleibt bei AWeb31 weiterhin die Anweisung
&lt;font&gt; wirksam und &#252;berliest einfach das gesetzte Ende-Tag. Dies gilt
auch f&#252;r die Kurzschreibungen wie z.B. f&#252;r &lt;H2&gt; und &lt;/H2&gt;.
Und Beendigungen auf Raten gibt es bei &lt;font&gt; nicht. Dann ist f&#252;r
jedes Teilargument die Fontanweisung neu zu setzen. Andere Browser stellen sich
hierbei nicht so pingelig an. So gibt es eine ganze Reihe von Beispielen.</p>

<p>Wer hat also solch eine Arbeit schon begonnen und m&#246;chte sie zur
Verf&#252;gung stellen? Outet euch und ihr werdet viel Post bekommen, mindestens
von mir, denn ich habe viele Fragen ohne Antwort.</p>

Gehe&#160;<a href="#top">zum Anfang</a>
<hr color="#FF00FF"><br>
<p><a name="a3"><font color="800000" size="7"><b>
<center>Top 5</b></font><br></a></center></p>
<p>
Diesmal fiel es mir wirklich schwer zu sagen, dies gefiel mir besser als der
Beitrag von .......<br>
Aus diesem Grunde werde ich diesmal nichts in Top 5 besonders
hervorheben. Betrachten wir doch die einzelnen Beitr&auml;ge, Aussagen bzw
die Statements zum Thema HTML gegen MagneticPages. Ich bin l&auml;ngst nicht
mit allem Geschriebenen einverstanden, trotzdem finde ich es
gerechtfertigt, dass diese &Auml;ußerungen gemacht wurden, auch wenn sie
teilweise falsch sind. Oder andere legen zur Zeit mehr Aufwand auf das
&auml;ußere Erscheinungsbild und vergessen dabei den Inhalt. Aber das spielt
sich mit der Zeit bestimmt ein.
</p>
Gehe&#160;<a href="#top">zum Anfang</a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
<hr color="#FF00FF">
</body>
</html>
