<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Lars Philipsen">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [de] (Win95; I) [Netscape]">
   <TITLE>R&auml;tsel um Wurml&ouml;cher Teil 7</TITLE>
</HEAD>
<BODY BACKGROUND="17.jpg">

<CENTER><B><U><FONT COLOR="#3333FF"><FONT SIZE=+2>R&auml;tsel um Wurml&ouml;cher</FONT></FONT></U></B></CENTER>

<CENTER><U><FONT COLOR="#3333FF"><FONT SIZE=+2>Teil 7: Bau der galaktischen
Wurmloch-Metro</FONT></FONT></U></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>
<FONT SIZE=+1>Wo im Kosmos befindet sich ein geeigeneter "Casimir-Steinbruch",
bei dem gen&uuml;gend exotische Materie abgebaut werden kann? Der englische
Astrophysiker Stephen Hawking mutma&szlig;t, da&szlig; die Umgebung eines
Schwarzen Lochs eine m&ouml;gliche Produktionsst&auml;tte f&uuml;r exotische
Materie sein k&ouml;nnte: Dort wird, im Gegensatz zur irdischen Nachbarschaft,
keine ausgeglichene, sondern eine negative Energiebilanz erwartet. Teilchen,
die hier aus Quanteneffekten entstehen, entsprechen der gew&uuml;nschten
exotischen Materie. Jedoch verschwindet sie, wegen der dort herrschenden
Anziehungskraft, sofort nach ihrer Entstehung im Schwarzen Loch. K&ouml;nnten
nun diese Teilchen kurz vor ihrem &Uuml;berschreiten des Ereignishorizontes
von "kosmischen Bergarbeitern" abgefangen werden, dann h&auml;tten sie
exotische Materie abgebaut. Hier w&uuml;rden die Bergleute wohl nicht vom
"Abbau &uuml;ber Tage", sondern vom "Abbau &uuml;ber Ereignishorizont"
sprechen. Nehmen wir an, da&szlig; dies technisch m&ouml;glich ist und
auch die geeigneten Schaufellader und Transportschiffe konstruiert w&auml;ren,
dann bleibt noch offen: Wieviel exotische Materie ist notwendig, um ein
Wurmloch zu bauen?</FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Da dieser kosmische Zauberstoff sehr wertvoll w&auml;re,
m&uuml;&szlig;te er optimal eingesetzt werden. Dies gel&auml;nge dadurch,
da&szlig; die Ingenieure den gr&ouml;&szlig;ten Teil des Wurmlochs aus
normaler Materie zusammensetzen und nur im engen Zentrum der Tunnel-Passage
die exotische Materie anbringen. Wurml&ouml;cher k&ouml;nnten durch exotische
Materie langfristig stabilisiert werden, da ihre Spannkraft durch die Antigravitation
gest&auml;rkt w&auml;re. Endlich sind alle unangenehmen Eigenschaften,
die Kerr-Tunnel und Schwarze L&ouml;cher besitzen, nicht mehr vorhanden.
Sorgen bereitet Kip Thorne nur die Tatsache, da&szlig; Sagan-Wurml&ouml;cher
auch Reisen durch die Zeit gestatten: Vergangenheit, Gegenwart und Zukunft
vermischen sich zu einem Zeitbrei. Paradoxe Situationen w&uuml;rden geschaffen,
die jeglicher Logik widersprechen: Wir k&ouml;nnten zum Beispiel irgendwelche
Vorfahren von uns aus dem Weg r&auml;umen und dadurch unsere eigene Geburt
verhindern. Vielleicht, so meint Stephen Hawking, zeigt uns aber&nbsp;<A NAME="die"></A>die
<I><A HREF="#Quantengravitation:">Quantengravitation</A></I>, da&szlig;
solche Zeitreisen physikalisch verboten sind. Hawking glaubt, da&szlig;
die Gesetze der Quantengravitation Wurml&ouml;cher so beeinflussen, da&szlig;
sie vor einer Zeitreise sich selbst zerst&ouml;ren (<A NAME="Siehe:"></A>Siehe:<I>
<A HREF="#Die Zeit spielt">Die Zeit spielt verr&uuml;ckt</A></I>).</FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Die Physiker haben ihre Hausaufgaben erledigt und stimmen
grunds&auml;tzlich dem Bau der Wurml&ouml;cher zu. So sind Wurmloch-Metros
in unserer Milchstra&szlig;e, aber auch zwischen den Galaxien des gesamten
Universums denkbar. Nur die Ingenieure blicken etwas ratlos drein. Sie
sto&szlig;en auf ein Problem, f&uuml;r das es noch keinen L&ouml;sungsvorschlag
gibt: Wo mit dem Wurmloch-Bau anfangen und wie aufh&ouml;ren? Diesen Knackpunkt
umgeht Sagan elegant: In seinem Buch stammt die glaktische Wurmloch-Metro
von einer intelligenten Zivilisation aus l&auml;ngst vergangenen Zeiten,
die ihr Know-how mit ins kosmische Grab genommen hat.</FONT>
<BR>
<HR WIDTH="100%">
<BR><A NAME="Quantengravitation:"></A><I><U><FONT SIZE=+1>Quantengravitation:</FONT></U></I><I><U><FONT SIZE=+1></FONT></U></I>

<P><FONT SIZE=+1>Die Quantengravitation vereinigt die Allgemeine Relativit&auml;tstheorie
mit der Quantenphysik. Bisher fehlt allerdings eine umfassende Theorie,
und die Astrophysiker wissen bisher zu wenig &uuml;ber das Wesen dieser
"letzten" Theorie der Physik. Auf dem besten Weg dazu, diese zwei gro&szlig;en
Theorien unseres Jahrhunderts unter einen Hut zu bringen, ist derzeit der
englische Astrophysiker Stephen Hawking. So ist zum Beispiel die von ihm
postulierte Hawking-Strahlung der Schwarzen L&ouml;cher ein erstes Ergebnis
der Quantengravitation. Noch stehen die Theoretiker vor vielen mathematischen
Problemen, und es werden wohl viele Jahre und unz&auml;hlige Stunden am
Computer vergehen, bis dieses gro&szlig;e R&auml;tsel der Physik gel&ouml;st
ist.</FONT>

<P><I><FONT SIZE=+1><A HREF="#die">zur&uuml;ck</A></FONT></I>
<BR>
<HR WIDTH="100%">
<BR><A NAME="Die Zeit spielt"></A><I><U><FONT SIZE=+1>Die Zeit spielt verr&uuml;ckt</FONT></U></I><I><U><FONT SIZE=+1></FONT></U></I>

<P><FONT SIZE=+1>Wurml&ouml;cher verbinden nicht nur zwei verschiedene
Regionen des Weltalls, sondern auch zwei verschiedene Zeiten. Sind die
Wurml&ouml;cher statisch, dann l&auml;uft die Zeit an beiden &Ouml;ffnungen
gleich ab, egal ob wir gerade im Wurmloch sind oder das Ganze von au&szlig;en
betrachten. Bewegen sich aber die Wurmloch-&Ouml;ffnungen relativ zueinander,
ergibt sich eine paradoxe Situation: eine Reise durch die Zeit wird m&ouml;glich.
Eine wichtige Rolle spielt dabei Einsteins Spezielle Relativit&auml;tstheorie,
die besagt, da&szlig; die Zeit in zwei zueinander bewegten Systemen ihre
"Gleichzeitigkeit" verliert. Die Astrophysiker Mike Morris und Kip Thorne
berechneten, da&szlig; durch eine Wurmloch-Reise sowohl ein Zeitsprung
in die Vergangenheit als auch in die Zukunft m&ouml;glich ist. Im Film
"Contact" findet ebenfalls ein Zeitsprung statt: Ellie Arroways Reise durch
die drei Wurml&ouml;cher und ihr Aufenthalt bei den Au&szlig;erirdischen
dauert f&uuml;r sie rund 18 Stunden, auf der Erde vergehen aber nur Bruchteile
einer Sekunde.</FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Zeitreisen ergeben Widerspr&uuml;che, an denen sich selbst
Science-fiction-Autoren die Z&auml;hne ausbei&szlig;en, wie zum Beispiel
bei der hypothetischen Geschichte von Fred: Fred reist in die Vergangenheit
und &uuml;berredet seinen Vater just in jener Nacht zu einer Kneipentour,
als er eigentlich von seinen Eltern gezeugt wurde. Nun, die Kneipentour
h&auml;tte fatale Folgen: Fred verhindert, da&szlig; sein Vater rechtzeitig
zu seiner Mutter kommt und somit seine eigene Entstehung. Da aber Fred
nun nie geboren wird, kann er aber auch nicht in die Vergangenheit reisen,
um mit seinem Vater zu zechen. Ein Dilemma, aus dem es keinen physikalischen
Ausweg gibt. Solche Reisen verbietet die Logik, aber was sagt die Physik
dazu?</FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+1>Kip Thorne hat erkannt, da&szlig; zirkulierende Vakuumfluktuationen
die Wurml&ouml;cher angreifen. Allerdings behauptet er, da&szlig; diese
Fluktuationen zu fr&uuml;h einsetzen und somit nicht stark genug werden,
um die Wurmlochverbindung zu kappen. Doch Zeit ist relativ! Und was aus
der Sicht des Wurmlochs zu fr&uuml;h ist, kann aus der Sicht der Fluktuation
gerade rechtzeitig sein. Stephen Hawking berechnete die Zeit, wie sie -
nach Einsteins Spezieller Relativit&auml;tstheorie - f&uuml;r die Fluktuationen
verstreicht. Daraus resultierte ein anderes Ergebnis: die zirkulierenden
Fluktuationen setzen sp&auml;ter ein und erreichen jene Kraft, mit der
sie das Wurmloch vernichten, bevor es zur Zeitmaschine wird. Somit sind
mit Wurml&ouml;chern keine Zeitreisen m&ouml;glich. Kip Thorne, der gerne
bei Meinungsverschiedenheiten Wetten abschlie&szlig;t, meint dazu: "Ich
bin nicht gewillt, dagegen zu wetten, es macht mir zwar Spa&szlig; mit
Hawking zu wetten, jedoch nur dann, wenn ich eine reelle Chance habe zu
gewinnen. In diesem Fall habe ich das Gef&uuml;hl, ich w&uuml;rde verlieren."
Vielleicht zeigt ja die Quantengravitation, da&szlig; Wurml&ouml;cher zwar
Reisen mit &Uuml;berlichtgeschwindigkeit erlauben, sich aber nicht als
Zeitmaschine benutzen lassen.</FONT><FONT SIZE=+1></FONT>

<P><I><FONT SIZE=+1><A HREF="#Siehe:">zur&uuml;ck</A></FONT></I>
<BR>
<HR WIDTH="100%">
<BR><FONT COLOR="#666600"><FONT SIZE=+1>So, in der n&auml;chsten Ausgabe
der NoCover geht es dann weiter mit dem 8. Teil der Wurmloch-Reihe: <I>"Star
Trek" ist unabh&auml;ngig von der Wurmloch-Metro.</I></FONT></FONT><I><FONT COLOR="#666600"><FONT SIZE=+1></FONT></FONT></I>
<CENTER><FONT COLOR="#990000"><FONT SIZE=+1>Bis dann...</FONT></FONT></CENTER>

<CENTER><FONT COLOR="#990000"><FONT SIZE=+1>Euer</FONT></FONT></CENTER>

<CENTER><A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="lph.jpg" HEIGHT=75 WIDTH=135></A></CENTER>

</BODY>
</HTML>
