<HTML>
<HEAD><TITLE>Ein par nutzlose Tips...</TITLE></HEAD>
<BODY bgcolor=white text=black background="l_bg.gif">
<H3>Da ja nun HTML in der NoCover verwendet wird m&oumlchte Ich hier mal ein Tips
f&uumlr besseres Layouten angeben:</H3><UL>
<LI> Nehmt m&oumlglichst immer ein HintergrundBild. Wenn ihr keins habt k&oumlnnt ihr
auch das der NC nehmen. Sein Name lautet &quot;l_bg.gif&quot;. Um das nun in eurem
Artikel zu verwenden, m&uuml&szligt ihr lediglich in die &lt;BODY&gt; Zeile &quot;background=&quot;l_bg.gif&quot;&quot;
einf&uuml;gen. Dadurch sehen die Artikel viel besser aus. Ihr k&ouml;nnt aber auch
z.B. ein Bild aus der MagicWB-Patterns Sammlung nahmen(nichts aus der registrierten Version!).
<LI> Wenn ihr ein Hintergrundbild ben&uuml;tzt, achtet darauf, da&szlig; man die
Schrift noch lesen kann. Zum Beispiel vertragen sich blauer Hintergrund und
schwarze Schrift nicht...
<LI> Wenn ihr generell Bilder verwenden m&ouml;chtet, achtet darauf in welchem
Format ihr sie speichert. In GIF werden kleinere Bilder mit bi&szlig; zu 256
Farben mei&szlig;t am kleinsten gespeichert, wohingegen JPG am besten ist, wenn
ihr 24 BIT Bilder ben&uuml;tzt, die auch wirklich so viele Farben haben.
Ein 32 Farben Pic ist in GIF z.B. besser aufgehoben als in JPG. Auch leiden
die Bilder unter der JPG Komprimierung. Am besten probiert ihr also beides
aus, und nehmt das, das eim kleinsten/besten ist.
<LI> Keine Silbentrennungen bitte. Und auch &lt;BR&gt; nur verwenden wenn es sein
mu&szlig;. Ansonsten sieht euer Text auf gr&ouml;&szlig;eren Bildschirmen(800X600) sehr
seltsam aus.
<LI> Wenn der Text auf eurer Konfig schwer zu lesen ist, weil eure Aufl&ouml;&szlig;ung
nicht zu den Fonts pa&szlig;t, geht ins Prefs-Men&uuml; und &auml;ndert die Fonts f&uuml;r die
einzelnen Gr&ouml;&szlig;en, so da&szlig; ihr sie wieder lesen k&ouml;nnt.
Zur Not k&ouml;nntet ihr f&uuml;r die Standartschrift (H3) auch Topaz 8 einstellen.
Alternativ k&ouml;nnt ihr auch den Source ansehen, und nach der BODY Zeile das
Tag &lt;CODE&gt; einf&uuml;gen. Dadurch wird der Text in <CODE>gut lesbarer aber schlecht
aussehender </CODE>Form dargestellt.
<LI>Viele HTML Befehle lassen sich kobinieren. So kann man z.B. einen Link
mit einem Bild benutzen, statt mit Text. Oder man kann eine Linie mit den
Attributen &quot;width=xyz% noshade size=#? color=X&quot; ausstaten. Das sieht dann z.B. so aus:
<HR size=2 noshade width=50% color=red >
<LI>Wenn ihr eure Artikel selber layouten wollt lest euch die Anleitung im Impressum
durch.
<LI>In diversen AmigaPLUS Zeitschriften sind ebenfalls halbwegs brauchbare
Workshops zu HTML erschienen.
<LI>F&uuml;r diejenigen unter euch, die die Meeting Pearls IV besitzen, d&uuml;rfte das
HTML-Special auf der CD interresant sein. Dort wird sehr genau auf die Befehle
des HTML Standarts 3.0 eingegangen.

</UL>
<CENTER><BIG><STRONG>Markus Castro Y Castro -The Saint</STRONG></BIG></CENTER>
<CENTER><A HREF="NoCover.html" TARGET="_NEW"><IMG SRC="l_hauptinhalt.jpg" width=639 height=99 alt="Inhalt" BORDER=0></A></CENTER>
</BODY>
</HTML>
