<HTML>
<HEAD><TITLE>onEscapee fast gelöst</TITLE></HEAD>
<BODY bgcolor=black background="gt_onbackground.jpg" text=yellow link="#ff0000" alink=blue>
<TABLE BORDER=0>
<TR><TD width=132></TD><TD colspan=1 align=center><IMG SRC="gt_onlogo.gif" width=400 height=87 ALT=onEscapee border=0><BR>
<font color=red>
<BIG>Zun&auml;chst einmal ein par generelle Tips zu diesem Superspiel:</BIG></font><BR>
</TD></TR><TR>
<TD rowspan=100 width=132></TD><TD>
<UL>
<LI> Wenn ihr an irgendeiner Stelle nicht weiterkommt, &uuml;berlegt lieber erstmal
ob euch nicht selbst irgendwas einf&auml;llt. Komplettl&ouml;sungen machen das ganze
Spiel kaputt, wenn man damit nicht umgehen kann. Also lieber gar nicht weiterlesen!
<LI> Wenn ihr mit der Steuerung nicht zurechtkommt, geht auf einen Screen ohne
Feinde, und &uuml;bt sie nochmal gut durch.
<LI> Gegenst&auml;nde erkennt ihr meist daran, da&szlig; sie blinken oder vom Hintergrund
hervorgehoben sind.
<LI> An den W&auml;nden findet ihr 4 verschiedene Dinge:
<UL>
 <LI>Computer in die man etwas eingeben mu&szlig;
 <LI>Computer in die Gegenst&auml;nde gelegt werden m&uuml;&szlig;en
 <LI>Bilder, auf denen steht was man in den Computern eintippen mu&szlig;
 <LI>Karten(nur Level 4)</UL>
<LI> Lest nur soweit, da&szlig; eure unmittelbare Frage beantwortet ist, nicht weiter.
<LI> Richtig schwer wird es erst ab Level 3/4
<LI> Bei einem Schu&szlig;wechsel am besten immer ducken und auf den Schild h&auml;mmern,
dadurch werdet ihr nicht so schnell getroffen
<LI> Die Farben rot und gr&uuml;n haben im Spiel eine Signalwirkung, d.h. wenn ein
Teleporter rot gekennzeichnet ist funktioniert er nicht, ein gelber t&ouml;tet dich,
und ein gr&uuml;ner funktioniert ganz normal
<LI> Terminals immer aktivieren. Die meisten &ouml;ffnen T&uuml;ren oder &auml;hnliches
<LI> Abspeichern nicht vergessen
<LI> Sterben kann auch mal ganz witzig sein =)</UL>
Wenn ihr an irgendeiner Stelle auch mit L&ouml;sung absolut nicht weiterkommt,
k&ouml;nnt ihr mich anrufen oder mir eine Diskette mit 1.30 R&uuml;ckporto schicken,
dann schicke ich euch meine Savegames.<P>
So, nun aber zu der eigentlichen L&ouml;sung:
<CENTER>
<IMG SRC="gt_onredline.gif" border=0 width=274 height=7 alt="-----"></CENTER>
</TD></TR><TD>
<CENTER>
<BIG>
<A HREF="#Level1">Level1</A>
<A HREF="#Level2">Level2</A>
<A HREF="#Level2b">Level2b</A>
<A HREF="#Level3">Level3</A><BR>
<A HREF="#Level4">Level4</A>
<A HREF="#Level5">Level5</A>
<A HREF="#Level6">Level6</A><BR>
<A HREF="-tips_onstat.html">Statistiken</A><BR>
</BIG>
<IMG SRC="gt_onredline.gif" border=0 width=274 height=7 alt="--------">
</TD></TR><TR><TD>
</CENTER>
<A name="Level1"><CENTER><H2>Level 1</H2></CENTER>
Lauft erstmal 2 Bildschirme nach links, und rollt euch unter dem ersten umgest&uuml;rtzten
Baum durch. Wieder 2 Bildschirme weiter m&uuml;&szlig;t ihr vor dem Baum warten, bis die 
Maschine kommt, und euch r&uuml;berblastert. Im folgenden Screen m&uuml;&szlig;t ihr schnell
unter den M&uuml;cken hinwegrollen, und dann wieder einen weiter um das Schiff laufen,
bis die Maschine das Schiff zerschie&szlig;t. Lauft dann einfach in das Loch, und ihr
kommt zum...
</TD></TR><TR><TD>
<A name="Level2"><CENTER><H2>Level 2</H2></CENTER>
Geht 3 Schritte nach links, und sammelt das blinkende Objekt ein. Etwas weiter
links und rechts liegen auch noch zwei unwichtige Teile, die wie zerbrochene
Reagenzgl&auml;ser aussehen. Weiter gehts nach rechts, und im richtigen Moment
unter den Tentakeln hinweggerollt. Wieder einen Screen weiter, und den Schl&uuml;&szlig;el
in den WandComputer schieben. An dem roten Monster <U>vorbeirennen</U>, und im
n&auml;chsten Screen das Bild an der Wand merken. Wieder zur&uuml;ck nach links rennen,
bis zum nun erhellten Gang, wo ihr reingeht. Jetzt nach links vorsichtig an das
Monster herangehen, bis eine andersfarbige Fledermaus aufgescheucht ist. Dann
ducken, und wenn sie gefre&szlig;en wird nach links rollen. Im n&auml;chsten Bildschirm
in den dunklen Gang(hinten) gehen, und schnell am toten Drachen vorbeilaufen.
Keine Angst, die S&auml;ure ist nicht sofort t&ouml;dlich. Nun unter den Toten an der
Decke stellen, und nach der Pistole springen. Schnell noch die Knarre greifen
und wegrollen, sonst werdet ihr Spinnenfra&szlig;... Wieder nach hinten ins dunkle
gehen, ein par Schritte nach rechts gehen und an die linke Wand schie&szlig;en.
Danach sofort einen Schritt nach vorne gehen, um die Pistole einzustecken,
und wieder nach hinten, sonst werdet ihr plattgewalzt :) Wieder bei den Steinen
geht ihr nach rechts, und springt am besten ohne Anlauf &uuml;ber das kleine Loch.
Bei dem R&auml;tsel dr&uuml;ckt ihr die &auml;u&szlig;ersten Kn&ouml;pfe nach unten, wie an der Wand zu 
sehen war. Dabei ist ein Schalter immer mit 2 anderen Kn&ouml;pfen verbunden, die
praktisch gleichzeitig mitgedr&uuml;ckt werden. Mit ein bi&szlig;chen ausprobieren solltet
ihr es schnell schaffen. Wir kommen zum
</TD></TR><TR><TD>
<A name="Level2b"><CENTER><H2>Level 2b</H2></CENTER>
Geht erstmal einen Bildschirm nach rechts, und z&uuml;ckt eure Kanone. Dann solltet
ihr ballernd weitergehen, bis das Monster am Boden mit den Stacheln tot ist.
(Auf die Stacheln schie&szlig;en!) Im n&auml;chsten Bildschirm schreckt ihr durch schie&szlig;en
ein Monster auf, welches kaum sichtbar ist, da es wie eine Pflanze aussieht.
Treibt es durch Schrecksch&uuml;&szlig;e 2 Screens weiter, direkt unter das Monster. 
An den M&uuml;cken wieder vorbeirollen. Wenn das gr&uuml;ne Monster unter dem Orangen
steht, knallt es ab, und ihr k&ouml;nnt passieren. Geht dann in den Wasserfall und lauft
nach links. Wenn ihr ein St&uuml;ck im n&auml;chsten Screen seit solltet ihr springen,
um nicht gefre&szlig;en zu werden. Geht dann weiter, und bleibt in etwas Entfernung
zum Schlangenartigen Monster stehen. Auf Schu&szlig;kontakt gibt es den Weg nach links
frei, und ihr k&ouml;nnt schnell weiter nach links-hinten. Jetzt wieder mit Anlauf
nach links, und kurz vor den Kabeln abspringen. Das Loch im Boden schlie&szlig;t
ihr mit dem Terminal( einfach nach unten und Knopf wenn ihr davorsteht),
und den Aufzug ruft ihr, indem ihr das Wandr&auml;tsel knackt. Wenn ihr auf einen
Knopf dr&uuml;ckt werden die umliegenden Stromkontakte hergestellt. Aussehen mu&szlig;
es dann in etwa so wie auf dem <A HREF="tips_onraetsel.jpg" TARGET="_NEW">Bild </A>. Achtet darauf, da&szlig; ihr
keinen Kurzschlu&szlig; baut. Mit dem Fahrstuhl geht es dann in Richtung
</TD></TR><TR><TD>
<A name="Level3"><CENTER><H2>Level 3</H2></CENTER>
O.K., hier geht es dann schon etwas h&auml;rter zur Sache. Wenn ihr aus dem Aufzug
kommt rennt ihr erstmal 4 Bildschirme weiter nach rechts, an den Robotern einfach vorbei
zum n&auml;chsten Aufzug, den ihr &uuml;ber das Panel aktiviert (nach oben dr&uuml;cken). 
Wenn ihr aus dem Aufzug kommt kniet euch sofort hin und fangt an zu schie&szlig;en,
denn ein explosiver Zeitgenosse n&auml;hert sich euch. In den folgenden 4 Screens
habt ihr es nicht mit Feinden sondern mit BodenMinen zu tun. Am besten ihr
speichert ab, und probiert aus mit welchen Sprungkombinationen ihr am besten
r&uuml;berkommt. Im n&auml;chsten Schirm erwartet euch jedoch schon ein Feind, also
Schild aktivieren und abknallen. Im n&auml;chsten Bildschirm mit dem Aufzug nach
oben fahren und am besten erstmal sichern, denn jetzt wird`s schwer.
An der Wand k&ouml;nnt ihr euch ein kleines Bild ansehen, das die L&ouml;sung d&uuml;r ein
sp&auml;teres R&auml;tsel darstellt. Mit aktiviertem Schild betretet ihr nun den rechten
Screen und knallt erstmal einen Roboter &uuml;ber`n Haufen. Der Teleporter funktioniert nicht,
also weiter nach links und in den hinteren Gang gehen. Der linke Teleporter
killt euch, also 2 Screens weiter nach rechts und gegen die Wand laufen, wo
freundlicherweise die Energie wiederhergestellt wird. Zur&uuml;ck nach links, und raus
aus diesem Weg, und dann nach rechts. Achtet dabei auf das gebrochene Kabel,
welches einiges an Energie kostet. Im n&auml;chsten Bildschirm wieder Schild aktivieren
und Roboter t&ouml;ten, und weiter nach rechts. Da ihr diese Sorte Feind nicht besiegen
k&ouml;nnt lauft ihr wieder in den hinteren Gang, und achtet auf die Energieb&auml;lle,
unter denen ihr im rechten Moment wegrollen solltet. Links gibts nur einen
Feind, also weiter nach rechts, wieder mit Pistole im Anschlag und Schild.
Solltet ihr von den Robotern aus dem Screen geblasen werden, schie&szlig;t einfach weiter,
ihr werdet sie schon treffen. Mit dem Teleporter geht`s ab ins MedLab, und
rechts wird wieder die Energie aufgefrischt. Wieder zur&uuml;ck durch den Teleporter
und nach rechts gerannt, vor den Strahlen noch die Munition aufsammeln und
dann durch die Strahlen rennen. Im n&auml;chsten Schirm wird es ein wenig kniffelig,
also erst mal zulesen: Geht ganz nah an die B&auml;lle ran, und geht dann jeweils
2 Schritte in ihre Richtung, wenn sie oben sind. Nach dem Zweiten Ball greift
euch ein Feind von links an, also Schild aktivieren, und erstmal aus den B&auml;llen raus,
denn sonst seit ihr schnell erledigt. Im rechten Schirm gibts wieder Mengen
an Feinden, also am besten mit Schield und Knarre einrollen, und ballern was
das Zeug h&auml;lt. Am Wandr&auml;tsel m&uuml;&szlig;t ihr solange auf die Kn&ouml;pfe dr&uuml;cken, bis
alle Kn&ouml;pfe einer Elipse das selbe Simbol tragen. Wenn ihr soweit seit dr&uuml;ckt
einfach im Uhrzeigersinn jeden Knopf einmal, bis die Elipse das gew&uuml;nschte
Symbol tr&auml;gt. Die Symbole habt ihr am Anfang dieses Abschnitts gesehen.
Wenn ihr auf einen Knopf dr&uuml;ckt erh&ouml;ht sich sein Symbol, und das der umliegenden
um einen Strich. Wenn ihr fertig seid leuchten rechts alle L&auml;mpchen auf, und ihr
k&ouml;nnt auf das Dreieck dr&uuml;cken, und damit die T&uuml;r &ouml;ffnen. Hinter der T&uuml;r befindet
sich eine Art Kraftfeld, das sich immer in die Richtung bewegt, in die ihr
guckt. Also ganz nah rangehen, ducken, wegsehen, und wenn das Feld weg ist
schnell wegrollen. Es geht erstmal nach links, wo ihr nach 2  Screens auf ein
par w&uuml;tende Hunde st&ouml;&szlig;t, also wieder nach rechts, und die Hunde mit dem Kraftfeld
t&ouml;ten. Seht euch dann das Zeichen an der Wand an, und notiert es als drittes
Zeichen, als erstes nehmt ihr das von ganz links bei den Hunden, und weiter
gehts nach rechts. Hier wird`s nun wirklich saum&auml;&szlig;ig schwer, also empfehle
ich folgende Strategie: Da euch die Roboter an der Decke immer eins reinw&uuml;rgen,
wenn ihr &uuml;ber die Minen springen wollt, l&ouml;&szlig;t am besten erstmal alles Minen
aus (ihr vertragt zwischen 3 und 4) und lauft dann zur&uuml;ck zum Aufladepunkt.
Da&szlig; ist zwar sehr zeitaufwendig und langweilig, aber auch am einfachsten.
In den Aufzugsschacht solltet ihr lieber nicht springen, geht statt dessen
weiter nach rechts bis ihr auf ein par B&auml;lle trefft. Mit dem richtigen Timing
kommt ihr unter allen hinweg, ohne Energie zu verlieren. Im n&auml;chsten Schirm
gibt`s wieder einen Ball, und ein Zeichen an der Wand, welches ihr euch als
zweites notieren solltet. Im n&auml;chsten Schirm wartet ein sehr schwerer Gegner,
den ihr nur wie folgt besiegen k&ouml;nnt: Stellt euch genau vor dem Teleporter
auf, duckt euch dann und rollt nach rechts, bis ihr genau vor ihm sitzt. 
Wenn alles gut geht sollte er von seinen eigenen Feuerb&auml;llen get&ouml;tet werden, und ihr k&ouml;nnt euch dem
Wandr&auml;tsel annehmen, in das ihr die Zeichen in der richtigen Reihenfolge eingeben
solltet, um den Teleporter zu aktivieren. Benutzt den Teleporter, und ihr
gelangt in einen Screen mit 3 Robotern und links eine Aufladestation. Da&szlig;
ist doch jetzt wirklich einfach =). Mit der Waffe im Anschlag geht ihr nun 
nach rechts, und schie&szlig;t die zwei Roboter ab, die von rechts kommen. Das Terminal
k&ouml;nnt ihr auch nochmal bedienen, obwohl ich nicht wei&szlig;, wof&uuml;r es da ist.
Im n&auml;chsten Schirm trefft ihr einen Gegner und eine neue Art von Minen.
Ihr k&ouml;nnt sie beschie&szlig;en, um sie zu zerst&ouml;ren oder auf Gegner zuzutreiben, und
sie sind absolut t&ouml;dlich. Die T&uuml;r l&auml;&szlig;t sich nur von der anderen Seite &ouml;ffnen,
also weiter nach rechts und den Gegner zerlegen. Im n&auml;chsten Screen den Teleporter
benutzen, und schnell das blinkende Objekt nehmen, da ihr sonst erstick. Wieder
zur&uuml;ck mit dem Teleporter, und das Wandr&auml;tsel l&ouml;sen. Durch die T&uuml;r, einen
Schirm nach rechts, und den Generator mit dem Schalter aktivieren. Wieder zur&uuml;ck
zum Teleporter, und siehe da, das Wasser ist weg. Im n&auml;chsten Screen den Gegner erlegen,
Energie auff&uuml;llen nicht vergessen, und ihr lernt eine neue Art Gegner kennen:
Sie Schie&szlig;en nicht, sondern versuchen dich durch Ber&uuml;hrung zu t&ouml;ten. Ein Schu&szlig;
und sie sind weg. Im n&auml;chsten Bildschirm gibt es einen Teleporter und 3-4
dieser Feinde. Der Teleporter f&uuml;hrt uns zur n&auml;chsten Auflade Station. Im
n&auml;chsten Screen gibt es 3 Gegner, wobei ihr euch langsam vortasten solltet,
um ihnen nicht in die Arme zu laufen. Einige warten erstmal eine Zeitlang ab,
oder kommen von hinten. Im n&auml;chsten Screen kommen wieder 4 von rechts, und
einen weiter k&ouml;nnt ihr 4 Roboter erledigen, und durch die T&uuml;r gehen. Geht nach
rechts, und ihr findet wieder Munition, links k&ouml;nnt ihr euch wieder regenerieren
lassen. Zur&uuml;ck durch die T&uuml;r und geduckt nach rechts werdet ihr wieder zwei
dieser Harakiri-Hunde treffen, die ihr besser erledigt. Weiter rechts trefft ihr...
euch selbst! Da ihr euch noch nie austehen konntet killt ihr euch am besten...also ihn...ich meine...
na egal, kaum seid ihr...er tot k&ouml;nnt ihr nach rechts laufen, euch eine kleine
Sequenz ansehen, und dann vor euch selbst weglaufen, bis ihr zum Fahrstuhl
kommt, mit dem ihr nach oben fahren solltet, ins...
</TD></TR><TR><TD>
<A name="Level4"><CENTER><H2>Level 4</H2></CENTER>
<BIG>Generelles:</BIG>
<UL type="circle">
<LI> Der Engel tauch unregelm&auml;&szlig;ig an einigen bestimmten Pl&auml;tzen auf, dort solltet
ihr euch also beeilen um kein Hackfleisch zu werden.
<LI> Die Schalter die ihr findet m&uuml;&szlig;en alle nach oben gedr&uuml;ckt werden, damit
ihr das Endr&auml;tsel l&ouml;sen k&ouml;nnt.
<LI> Diese wiederlichen kleinen Energieb&auml;lle lassen sich mit einem Schu&szlig; zerst&ouml;ren.
<LI> Die Hunde greifen nur an, wenn du dich ihnen n&auml;herst.
<LI> &uuml;ber die meisten L&ouml;cher kannst du r&uuml;ber springen.
<LI> An drei Stellen gibt es Karten, du kannst aber auch versuchen die Stadt
selber zu kartographieren.
<LI> Einige G&auml;nge die nach oben oder unten f&uuml;hren sind oft schwer zu erkennen.
<LI> Wenn ihr vor dem Engel fl&uuml;chtet, k&ouml;nnt ihr auch Weitspr&uuml;nge machen, um schneller
voranzukommen.</UL>
<P>
Rollt euch erstmal raus aus dem Aufzugsschacht und einen Screen nach rechts,
ballert dann in den linken Screen hinein, und wenn ihr es geschafft habt, sollte
der Aufzugsschacht nicht mehr da sein, und ihr k&ouml;nntet tauchen. Es geht erstmal
5 Screens nach unten, und dann nach links und oben, wo ihr euch erstmal wieder
aufladen solltet, denn die Stadt ist verdammt schwer. Wieder oben lauft ihr nach
rechts bis euch ein Auto abknallen will. Lauft davon, bis es anh&auml;lt, stellt
euch dann in die linke Screenecke, so da&szlig; es euch nicht sieht, und erwiedert seinen
freundlichen Gru&szlig;...
Geht dann nach oben, und rennt was das Zeug h&auml;lt, sonst werdet ihr von einem
Engel gebraten. Beim Schalter k&ouml;nnt ihr anhalten und ihn aktivieren. Wieder zur&uuml;ck
geht ihr immer nach rechts, an dem gro&szlig;en Loch knallst du den Ball ab, und
gehst einen Screen zur&uuml;ck und nach oben. Laufe dem Engel davon, bis du ein
Graffiti an der Wand siehst, und merke es dir f&uuml;r ein sp&auml;teres R&auml;tsel.
Laufe nun nach links, und beim Taxi weiter nach unten. Einen Bildschirm weiter
rechts triftst du auf zwei Roboter, die du erstmal aus dem Weg r&auml;umen mu&szlig;t.
Im n&auml;chsten Screen gehst du nach oben, und in das Haus hinein wo du erstmal
aufgetankt wirst. 2 Screens weiter rechts erledigst du eine Kugel, und weiter
rechts kannst du die Symbole ins R&auml;tsel eingeben, wonach du schnellstens &uuml;ber
die Br&uuml;cke rennen solltest. Das R&auml;tsel funktioniert folgenderma&szlig;en:
Zuerst klickst du das Symbol an, das du &auml;ndern m&ouml;chtest, dann benutzt du einen
dieser halbrunden Kn&ouml;pfe um entweder nach oben oder unten in der Liste zu gehen.
Wir bleiben aber erstmal auf dieser Seite, gehen zur&uuml;ck zum Haus und 
nach unten, wo wir wieder einmal vor dem Engel weglaufen m&uuml;&szlig;en. 5 Screens
weiter nach links gehen wir nach unten, und wieder nach links. Nach 2 Schirmen
gehen wir nach oben und rechts, wo wir im 3. Screen wieder auf einen dieser
Selbstmord-Roboter sto&szlig;en, diesmal hinter uns. Wir gehen nach oben, wo wir
im 1. Screen einen Ball, im 2. einen Schalter, und im 3. eine Karte finden.
&uuml;ber die L&ouml;cher sollten wir hinwegspringen. Gehen wir weiter nach rechts treffen
wir bald auf ein Haus mit MedLab, und noch weiter rechts verfolgt uns wieder der
Engel, wir springen &uuml;ber ein par L&ouml;cher, und gehen weiter nach rechts, zum ersten
Energie-Haus. Jetzt gehen wir zum Loch, knacken das R&auml;tsel und laufen schnell
&uuml;ber die Br&uuml;cke. Im n&auml;chsten Schirm killen wir den MinenHeini und legen den Schalter
um. Weiter nach rechts un oben; am Lokal sehen wir uns das Schild an und notieren
die Zeichen f&uuml;r das Endr&auml;tsel. Nun gehen wir ins Lokal und h&ouml;ren uns den S&auml;nger an,
und gehen wieder raus. Nun weiter nach links, und schnell ducken denn hier
machen ein par MotorradRowdies die Stra&szlig;en unsicher. Weiter nach links, und den 
Schalter umlegen. Dann nach unten, wieder nach unten und nach links, die Kugel
abschie&szlig;en und den Schalter umlegen, und wieder zur&uuml;ck nach rechts. Dann
nach links, und in die Kanalisation, wenn ihr drau&szlig;en seid nach links und oben,
dann nach rechts und ducken, nach ein par Screens nach oben und rechts,
einen Gegner abschie&szlig;en, im n&auml;chsten Screen eine Kugel und den Schalter umlegen,
weiter nach rechts, noch einen Roboter killen, dann nach links vorm Engel
weglaufen, und wenn er weg ist den Schalter umlegen. Danach weiter nach rechts,
vor den Motor&auml;dern aufpassen, und gleich wieder nach oben. Dann einfach immer
weiter links und am Ende nach unten, von dort einmal links, vor Motorr&auml;dern ducken,
und dann nach rechts. Immer weiter rechts, Schalter umlegen, vor Engel weglaufen,
nicht vergessen &uuml;ber die L&ouml;cher zu springen, und irgendwann nach oben und rechts 
gehen, soda&szlig; wir wieder zum explodierten Roboter kommen. Diesmal gehen wir
nach unten, und dann links bis wir zum Endr&auml;tsel kommen. Wenn ihr alle Schalter
umgelegt habt sollten auch alle gelben Lichter leuchten. Wenn nicht habt ihr
irgendwo einen Schalter vergessen. Oder Ich... Na egal, dann jedenfalls die 
Zeichen vom Lokal eingeben, und dann immer weiter nach links rennen, und ihr kommt
ins...
</TD></TR><TR><TD>
<A name="Level5"><CENTER><H2>Level 5</H2></CENTER>
<BIG>Generelles:</BIG>
<UL><LI> Oft kann man nicht genau erkennen, ob man noch weiter in eine Richtung kann.
Immer ausprobieren.
</UL>
Dieser Level ist einfach, ihr m&uuml;&szlig;t lediglich eure Kanone finden und ein par F&auml;&szlig;er
in die Luft jagen. Also springt gleich mal ins Wasser, und la&szlig;t euch von
der Str&ouml;mung treiben. Im Wasser geht ihr 5  Screens nach rechts, tauch ganz 
runter, geht 1. Screens nach links, und tauch kurz in das LuftLoch um Luft zu holen.
Von dieser H&ouml;hle aus taucht ihr 2 Screens nach unten, und bewegt euch dann
schnell nach links durch den engen Tunnel. Ganz am Ende taucht ihr dann wieder
nach unten, und sammelt eure Kanone auf (da wo`s blinkt). Schwimmt nun wieder
zur Lufth&ouml;hle und dann an die Oberfl&auml;che. Von dort aus schwimmt ihr weiter nach
rechts, 1. Screen vor dem Levelrand, und dann immer weiter nach unten, durch
die kleine &ouml;ffnung, und am Boden dann nach rechts und oben. Mit der Knarre
schie&szlig;t du dann auf die F&auml;&szlig;er und springst wieder ins Wasser, bis sie explodiert
sind. Durch das Tor kommst du dann in
</TD></TR><TR><TD>
<A name="Level6"><CENTER><H2>Level 6</H2></CENTER>
Lauft 5 Screens nach links, seht euch die Zwischensequenz an, geht dann wieder
einen weiter und benutzt dan gr&uuml;nen Teleporter. Rennt immer weiter nach rechts,
und schie&szlig;t die Maschine zu Schrott. Wieder nach links in den Teleporter,
1 Screen nach links und das Teil aufsammeln.<BR> So, mehr wei&szlig; ich leider nicht.
Irgendwo im Level werdet ihr noch einen Mann finden, der euch sofort t&ouml;tet,
sobald ihr eure Waffe z&uuml;ckt. Au&szlig;erdem ist da noch ein inaktiver Transporter,
aber weiter bin ich auch noch nicht gekommen. Sorry :) Ich hab mal in die Endsequencen
reingesehen, irgendwie jagt man das Treibstofflager hoch, erkommt mit dem Schiff,
und der Kerl mit der Knarre geht bei der Explosion drauf. Wer hier schon
weiter gekommen ist möge sich bitte !! bei mir melden. Adresse steht unten.
<CENTER><IMG SRC="gt_ongunline.gif" width=315 height=47 border=0 "></CENTER>
<P>
</TD></TR></TABLE>
<CENTER><A HREF="-tips_onstat.html">Statistiken</A></CENTER>
<CENTER><BIG>Markus Castro Y Castro -The Saint</BIG><BR>
<font size=4>D-25764, Wesselburen<BR>
Ostpreu&szlig;enstr. 26<BR>
Tel: 04833/3728</FONT></CENTER>
<CENTER><A HREF="NoCover.html"><IMG SRC="l_hauptinhalt.jpg" border=0 width=639 height=99 alt="Inhalt"></A></CENTER>
</BODY>
</HTML>
