<HTML>
<HEAD>
<TITLE>Farben für HTML</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#0000ad">
<FONT COLOR="#ff0000"><H1 ALIGN="CENTER">F</FONT><FONT COLOR="#ffffff">a</FONT><FONT COLOR="#00ff00">r</FONT><FONT COLOR="#c0c0c0">b</FONT><FONT COLOR="#0000ff">e</FONT><FONT COLOR="#00ff00">n</FONT><FONT COLOR="#ffffff"> </FONT><FONT COLOR="#ff0000">f</FONT><FONT COLOR="#ff00ff">&uuml;</FONT><FONT COLOR="#ffff00">r</FONT><FONT COLOR="#ffffff"> </FONT><FONT COLOR="#ff0000">H</FONT><FONT COLOR="#ffff00">T</FONT><FONT COLOR="#0000ff">M</FONT><FONT COLOR="#00ffff">L</H1>
</FONT><P><IMG SRC="image6.gif" WIDTH=561 HEIGHT=106></P>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=562>
<TR><TD WIDTH="15%" VALIGN="TOP" HEIGHT=331>
<P><IMG SRC="image6.gif" WIDTH=77 HEIGHT=1298></TD>
<TD WIDTH="69%" VALIGN="TOP" HEIGHT=331>
<FONT SIZE=4 COLOR="#00ffff"><P>Sicherlich geht es mit dem neuen HTML-Format noch Vielen so wie mir, da&szlig; man alles erst noch n&auml;her kennenlernen mu&szlig;, um die M&ouml;glichkeiten von HTML besser auszusch&ouml;pfen. So wird nat&uuml;rlich auch eine Web-Seite, die einem pers&ouml;nlich gut gef&auml;llt schnell in einen Editor eingeladen, um zu sehen, wie das die "Profis" handhaben ....</P>
<P>Und schnell f&auml;llt auf, da&szlig; auf vielen HTML-Seiten die Farbanpassungen mit einem scheinbar heillosen Durcheinander von Zahlen und Buchstaben dem Browser &uuml;bergeben werden.</P>
<P>Neugierig, wie ich nun mal bin, wollte ich diese Zeichenkolonne gern verstehen und bin dabei auf die Logik des Hexadezimalen Zahlensystems gesto&szlig;en.</P>
<P>Es ist nat&uuml;rlich sehr gut m&ouml;glich, da&szlig; dar&uuml;ber schon einmal in der NoCover berichtet wurde, aber das hindert mich nicht, meine Erfahrungen weiter zu geben.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=361 HEIGHT=9></P>
<I><FONT COLOR="#ffffff"><H2>M&ouml;glichkeiten</H2>
</I></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Es gibt mindestens zwei M&ouml;glichkeiten, die Farbe f&uuml;r den Hintergrund und den Text in einem HTML-Dokument einzustellen.</P>
<P>Die erste Variante ist denkbar einfach, aber leider auch sehr stark eingeschr&auml;nkt. Wenn wir die Farben einfach mit ....</P>
<P>&lt;BODY TEXT=yellow BGCOLOR=black&gt;</P>
<P>.... und schon h&auml;tten wir die Textfarbe gelb und f&uuml;r den Hintergrund dann schwarz. Man braucht also nur die gew&uuml;nschte Farbe in deren englischen Bezeichnung eintragen, damit das HTML-Dokument diese Einstellungen erh&auml;lt.</P>
<P>Es l&auml;&szlig;t sich denken, da&szlig; man mit dieser M&ouml;glichkeit nicht die Farbpalette von 16,8 Millionen Farben der AGA-Chips ausnutzen kann. Aber nat&uuml;rlich ist es auch im HTML-Format m&ouml;glich, an wirklich jeden m&ouml;glichen Farbton zu gelangen. Hierzu k&ouml;nnen wir das altbekannte RGB-Verfahren heran ziehen, da&szlig; wir alle schon kennen. Erinnert Euch einfach an die drei Schieberegler, mit der sich die S&auml;ttigung der drei Farben </FONT><B><FONT SIZE=4 COLOR="#ff0000">Rot, </FONT><FONT SIZE=4 COLOR="#00ff00">Gr&uuml;n </B></FONT><FONT SIZE=4 COLOR="#00ffff">und </FONT><B><FONT SIZE=4 COLOR="#0000ff">Blau </B></FONT><FONT SIZE=4 COLOR="#00ffff">einstellen lassen</FONT><B><FONT SIZE=4 COLOR="#0000ff"> </B></FONT><FONT SIZE=4 COLOR="#00ffff">!</P>
<P>Jede Farbe kann 256 eigene Farbt&ouml;ne anzeigen, die sich wiederum alle miteinander mischen lassen.</P>
<P>Wer jetzt nicht ganz wei&szlig;, wovon ich schreibe, der soll einfach mal das Farbeinstellungsprogramm seiner Workbench starten. Ein Doppelklick auf "Palette" in der Schublade "Prefs" des Systemdatentr&auml;gers gen&uuml;gt hierzu. Gleich unter dem bunten Farbrad k&ouml;nnt Ihr die Schieberegler erkennen.</P>
<P>Wir wissen also jetzt, wie wir die Farbeinstellungen sehen k&ouml;nnen, aber wie &uuml;bergibt man nun ....</P>
<P>Rot=120 Gr&uuml;n=56 Blau=252 </P>
<P>.... dem HTML-Dokument ? In dieser Schreibweise geht es ja nun wirklich nicht.</P>
<P>Tja, wie w&auml;re es denn mit .....</P>
<P>&lt;BODY BGCOLOR="#7838fc"&gt;</P>
<P>Eiwei, das sieht aber verwirrend aus und dennoch sind das genau die Zahlen, die ich oben hinter Rot, Gr&uuml;n und Blau stehen habe !</P>
<P>Eigentlich mu&szlig; man nur das Hexadezimale Zahlensystem kennen gelernt haben, um zu verstehen, was die wirren Zeichen zu bedeuten haben. "Hexadezimal" bedeutet nichts anderes, als "sechzehn", also die Zahl 16 ! Man kann dadurch mit nur zwei zeichen einen Wert bis 256 darstellen, was somit die k&uuml;rzestes Form einer eigentlich ja dreistelligen Zahl ist. Vielleicht wird es in der Tabelle etwas deutlich, wo ich unser &uuml;bliches dezimale System dem hexadezimalem System gegen&uuml;ber darstelle.</P>
</FONT><U><FONT SIZE=5 COLOR="#ffffff"><P>Dezimal = Hexadezimal</P>
</U></FONT><B><FONT COLOR="#ffffff"><P>0 = 0, 1=1, 2=2, 3=3, 4=4, 5=5, 6=6, 7=7, 8=8, 9=9, 10=a, 11=b, 12=c, 13=d, 14=e, 15=f</P>
</B></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Wir haben also 16 darstellbare Werte, da unsere "0" selbstverst&auml;ndlich mitz&auml;hlt.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=367 HEIGHT=7></TD>
<TD WIDTH="16%" VALIGN="TOP" HEIGHT=331>
<P><IMG SRC="image6.gif" WIDTH=77 HEIGHT=1298></TD>
</TR>
</TABLE>
<P><IMG SRC="image6.gif" WIDTH=555 HEIGHT=38></P>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=561>
<TR><TD WIDTH="11%" VALIGN="TOP" HEIGHT=279>
<P><IMG SRC="image6.gif" WIDTH=54 HEIGHT=1133></TD>
<TD WIDTH="78%" VALIGN="TOP" HEIGHT=279>
<FONT SIZE=4 COLOR="#00ffff"><P>Na sch&ouml;n, sehen wir uns noch mal den Befehl an ...</P>
<P>&lt;BODY BGCOLOR="#7838fc"&gt;</P>
<P>Wie alle HTML-Steuerzeichen, f&auml;ngt auch dieser Befehl mit einem "Kleiner als"-Zeichen an. Danach kommt der Befehl BODY, der die farblich-grafische Gestaltung des "K&ouml;rpers", also unserer Webseite &uuml;bernimmt. In unserem kleinen Beispiel geht es dann weiter mit BGCOLOR, wobei das BG f&uuml;r "Background", also "Hintergrund" steht. Wir m&ouml;chten also die Farbe f&uuml;r unseren Hintergrund bestimmen. Nach dem = folgt ein mit # in " gesetzter Farbwert, n&auml;mlich 7838fc und ganz genau diese hexadezimalen Zeichen beherbergen die Werte unserer drei Schieberegler f&uuml;r Rot, Gr&uuml;n und Blau. In unserem Beispiel wollten wir ja die Werte ....</P>
<P>Rot=120 Gr&uuml;n=56 Blau=252</P>
<P>.... nehmen. Aber wie rechnen wir jetzt die dezimale "120" von Rot in einen hexadezimalen Wert um ?</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=423 HEIGHT=7></P>
<FONT COLOR="#ffffff"><H2>Die Umrechnung</H2>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Zun&auml;chst devidieren wir ganz einfach mal 120 / 16 und erhalten dadurch das Ergebnis 7,5. Dann multiplizieren wir wieder ganz einfach 16 x 7. Das machen wir, weil im Hexadezimalen System ja sich alles um die magische "16" dreht. Die "7" nehmen wir von unserer vorherigen "7,5", weil wir im Hexadezimalen System niemals mit Kommas rechnn, also immer nur mit ganzen Zahlen.</P>
<P>16 x 7 = 112</P>
<P>Jetzt nehmen wir unseren urspr&uuml;nglichen Wert, die "120" und subtrahieren unseren errechneten Wert "112"....</P>
<P>120 - 112 = 8</P>
<P>Nun braucht Ihr Euch nur noch die beiden errechneten Ergebnisse hintereinander aufschreiben, also die "7" und die "8" ....</P>
<P>78</P>
<P>Das Gleiche machen wir mit dem Wert des gr&uuml;nen Schiebereglers, der ja auf "56" stand .....</P>
<P>56 / 16 = 3,5 (Hiervon die GANZE Zahle notieren)</P>
<P>16 x 3 = 48</P>
<P>56 - 48 = 8</P>
<P>Also erst die "3", dann die "8" = 38</P>
<P>Und zuguterletzt auch noch einmal mit der blauen Farbe, deren Schieberegler auf 252 stand  ...</P>
<P>252 / 16 = 15,75 (Hiervon die GANZE Zahl "15" !)</P>
<P>16 x 15 = 240</P>
<P>252 - 240 = 12</P>
<P>Hier h&auml;tten wir die Zahlen "15" und "12", die im Hexadezimalsystem aber ja anders bezeichnet werden. Ihr erinnert Euch an die oben gezeigte Umrechnungsliste ? Die Zahlen lauten im hexadezimalen System ....</P>
</FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>15 = f</B></FONT><FONT SIZE=4 COLOR="#00ffff"> und </FONT><B><FONT SIZE=4 COLOR="#ffffff">12 = c</P>
</B></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Somit haben wir den letzten hexadezimalen Wert f&uuml;r Blau von ...</P>
<P>FC</P>
<P>Jetzt setzen wir alle drei errechneten Werte mal direkt hintereinander :</P>
</FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>7838fc</P>
</B></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Wollen wir uns noch mal unsere Befehlszeile ansehen ?</P>
<P>&lt;BODY BGCOLOR="#</FONT><B><FONT SIZE=4 COLOR="#ffffff">7838fc</B></FONT><FONT SIZE=4 COLOR="#00ffff">"&gt;</P>
<P>So kann man also die Werte haargenau dem HTML-Dokument &uuml;bergeben und nat&uuml;rlich geht das auch bei der Textfarbe genau nach dem gleichen Prinzip.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=423 HEIGHT=7></P>
<FONT COLOR="#ffffff"><H2><A NAME="KURZ"></A>Kurzanleitung</H2>
<OL>

</FONT><FONT SIZE=4 COLOR="#00ffff"><LI>Erst irgend einen RGB-Farbeinstellrequester (zB. Palette im Prefs-Verzeichnis des Systemdatentr&auml;gers) starten.</LI>
<LI>Gew&uuml;nschte Farbe mit Hilfe der Schieberegler von Rot, Gr&uuml;n und Blau einstellen.</LI>
<LI>Werte der einzelnen Schieberegler Rot, Gr&uuml;n und Blau notieren.</LI>
<LI>Einzelne Werte in das hexadezimale Zahlensystem umrechnen. Hierzu in folgender Weise vorgehen.....</OL>
</FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" HEIGHT=279>
<P><IMG SRC="image6.gif" WIDTH=54 HEIGHT=1133></TD>
</TR>
<TR><TD WIDTH="11%" VALIGN="TOP" HEIGHT=283>
<P><IMG SRC="image12.gif" WIDTH=49 HEIGHT=458></P>
<P><IMG SRC="image6.gif" WIDTH=56 HEIGHT=911></TD>
<TD WIDTH="78%" VALIGN="TOP" HEIGHT=283>
<FONT SIZE=4 COLOR="#00ffff"><P>Einzelwert durch 16 teilen / NUR die GANZE Zahl des Ergebnisses mit 16 multiplizieren / Wiederum dieses Ergebnis vom eigentlichen Ursprungswert abziehen / Die GANZE Zahl des ersten Ergebnisses zusammen mit der Zahl mit dem Rest, also dem letzten Ergebnis aufschreiben / falls eine der Zahlen ZWEIstellig ist (also gr&ouml;&szlig;er als 9) in hexadezimal umschreiben (10=a, 11=b, 12=c, 13=d, 14=e 15=f) / Den ganzen Vorgang mit den anderen beiden Farbwerten wiederholen / Die sechs errechneten Einzelziffern nebeneinander ergeben den Farbwert f&uuml;r die HTML-Seite</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=423 HEIGHT=7></P>
<FONT COLOR="#ffffff"><H2>Kurzbeispiel</H2>
</FONT><FONT SIZE=4 COLOR="#ffffff"><P>Ein helles Blau .....</P>
</FONT><B><FONT COLOR="#ff0000"><P>Hier unsere Amigatypischen RGB-Schieberegler</B></FONT><FONT COLOR="#ffffff"> </FONT><FONT SIZE=4 COLOR="#ffffff">:</P>
<P>Rot : 0 ........ -I-------------------------------</P>
<P>Gr&uuml;n : 128 .. -----------------I---------------</P>
<P>Blau : 255 ... -------------------------------I-</P>
</FONT><FONT SIZE=4 COLOR="#ff0000"><P>Umrechnung Farbe Rot = 0</P>
<P>0 / 16 = 0 (Dieses ist der ERSTE Wert !)</P>
<P>0 x 16 = 0</P>
<P>0 - 0 = 0 (Dieses ist der ZWEITE Wert !)</P>
<P>Ergebnis = 00</P>
</FONT><FONT SIZE=4 COLOR="#00ff00"><P>Umrechnung Farbe Gr&uuml;n = 128</P>
<P>128 / 16 = 8 (Dieses ist der erste Wert !)</P>
<P>16 x 8 = 128</P>
<P>128 - 128 = 0 (Dieses ist der zweite Wert !)</P>
<P>Ergebnis = 80</P>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Umrechnung Farbe Blau  = 255</P>
<P>255 / 16 = 15,9375 (NUR die GANZE Zahl ist der</P>
<P>16 x 15 = 240          erste Wert !)</P>
<P>255 - 240 = 15 (Dieses ist der zweite Wert !)</P>
<P>Ergebnis = 15 15  Hier m&uuml;ssen die ZWEIstelligen Werte des Dezimalsystems noch ins hexadezimale System umgeschrieben werden. 15 ist hierbei ein f !</P>
<P>Ergebnis = ff</P>
</FONT><B><FONT SIZE=4 COLOR="#ffffff"><P>Rot-Wert = 00 / Gr&uuml;n-Wert = 80 / Blau-Wert = ff</P>
<P>Also ist unser Wert f&uuml;r die Farbe in HTML = 0080ff</P>
</B></FONT><FONT SIZE=4 COLOR="#00ffff"><P>Unsere Zeile im HTML-Dokument m&uuml;&szlig;te also ....</P>
<P>&lt;BODY BGCOLOR="#</FONT><B><FONT SIZE=4 COLOR="#ffffff">0080ff</B></FONT><FONT SIZE=4 COLOR="#00ffff">"&gt; lauten, um den Hinergrund mit unserem hellen Blau anzeigen zu lassen. In der gleichen Zeile k&ouml;nnen wir auch noch zus&auml;tzlich</P>
<P>TEXT="#xxxxxx"</P>
<P>Mit angeben, wobei die "x" nat&uuml;rlich wieder mit dem gew&uuml;nschten Farbcode belegt werden.</P>
</FONT><P><IMG SRC="image12.gif" WIDTH=423 HEIGHT=7></P>
<FONT COLOR="#ffffff"><H2>Das wars</H2>
</FONT><FONT SIZE=4 COLOR="#00ffff"><P>Tja, das wars auch schon wieder. Ich hoffe sehr, da&szlig; dieser Text irgend jemanden weiter helfen konnte, damit er die Seiten der NoCover bald noch bunter gestalten kann. So kommt man wenigstens an s&auml;mtliche darstellbare Farben des AGA-Chipsatzes, um sie in seinen eigenen HTML-Dokumenten nutzen zu k&ouml;nnen.</P>
<P>Also noch viel Spa&szlig; beim Layouten Eurer HTML-Seiten, - das w&uuml;nscht Euch Euer</P>
</FONT><FONT COLOR="#ffffff"><H1 ALIGN="RIGHT">Cord Hagen</H1>
</FONT><P ALIGN="RIGHT"><A HREF="MITGLIEDER/HAGEN.HTML">HIGGINS</A></P>
<FONT COLOR="#ffffff"><P>&nbsp;</FONT></TD>
<TD WIDTH="11%" VALIGN="TOP" HEIGHT=283>
<P><IMG SRC="image12.gif" WIDTH=49 HEIGHT=458></P>
<P><IMG SRC="image6.gif" WIDTH=56 HEIGHT=911></TD>
</TR>
</TABLE>
<P><IMG SRC="image6.gif" WIDTH=567 HEIGHT=105></P>
<P ALIGN="CENTER">&nbsp;</P></BODY>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</HTML>
                                        