
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Pretty Maids: Firts Cuts... And Then Some</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="GREEN">Pretty Maids: First Cuts... And Then
Some</FONT></P></h1></CENTER></P>

Schon seit Jahren geh&#246;ren die Pretty Maids zu den st&#228;rksten Melodic Metal
Bands &#252;berhaupt, haben aber niemals die Anerkennung gefunden, die sie
eigentlich verdient h&#228;tten (was auf viel Pech in den letzten Jahren
zur&#252;ckzuf&#252;hren ist). Nichtsdestotrotz haben sich die Jungs niemals
unterkriegen lassen und schreiben auch heute noch erstklassiges Material.
Wer nun damit rechnet, eine neue Scheibe der D&#228;nen vor den Latz geknallt zu
bekommen, den muss ich leider entt&#228;uschen; &quot;Firts Cuts... Then Some&quot; ist
nichts anderes als eine Compilation von raren Tracks, der sich in erster
Linie an die Fans richtet. Aber nun der Reihe nach: Da w&#228;re zum ersten die
Deb&#252;t EP der Pretty Maids (1983), die nun endlich (17 Jahre sp&#228;ter !!) neu
aufgelegt wurde und ausschlie&#223;lich Klassiker enth&#228;lt. Insbesondere die
Melody Kracher &quot;Children Of Tomorrow&quot; und &quot;Fantasy&quot; muss man mal geh&#246;rt
haben. Weiter geht`s mit 5 Tracks von der 1990 erschienenen Christmas EP &quot;In
Santa Claws&quot;, die ebenfalls heute recht schwer zu kriegen ist. Diese besteht
aus drei Live Nummern (&quot;Red, Hot And Heavy&quot;, &quot;Eye Of The Storm&quot; und &quot;Rock
The House&quot;) sowie den Tracks &quot;In Santa`s Claw&quot; und &quot;A Merry Jingle&quot; (in dem
einige bekannte  Weihnachtssongs in einer Heavy Version aneinandergereit
wurden - &#252;brigens mit Unterst&#252;tzung von Deep Purple Frontsirene Ian Gillian).
Und als Abschluss w&#228;re da noch die gelungene Slade Coverversion &quot;Far, Far Away (das
Original wurde vor allem durch die TV Werbung bekannt), die auf der
japanischen Version von &quot;Stripped&quot; als Bonus Track verbraten wurde. Das
alles mag zwar jetzt den Anschein nach Geldmacherei erwecken, aber dem kann
ich wirklich nicht zustimmen. Das Re-Release der ersten EP war mehr als
&#252;berf&#228;llig (zumal in letzter Zeit wirklich der letzte Dreck wiederver&#246;ffentlicht
wurde) und auch die anderen Tracks sind so gut wie nicht mehr erh&#228;ltlich, was
dieser CD, trotz der etwas wirren Zusammenstellung, auf jeden Fall eine
daseinsberechtigung einbringt. Da musikalisch alles ohnehin in Ordnung ist,
kann ich eine klare Kaufempfehlung f&#252;r das (&#252;brigens limitierte) Teil
abgeben. Besonders Fans der Pretty Maids werden diese Compilation nach dem
ersten Durchlauf nicht mehr hergeben wollen!</P>

Fazit: 9 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="cd2.jpg"></P>
<img src="kit.gif"></P></CENTER>






</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
