
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Konzertbericht</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="YELLOW">Konzertbericht: Grave Digger (Support: Warhead &amp; White Skull)
</FONT></CENTER></h1></P>
Das erste Konzert im neuen Jahr beschehrte mir Grave Digger zusammen mit
Warhead und White Skull an einem kalten Montag Abend (10.1.00). Wie &#252;blich
fuhr ich zusammen mit zwei Kollegen (thanx an Carsten f&#252;r`s mitnehmen) schon
recht fr&#252;h zur Zeche, so da&#223; wir einige Zeit noch in der benachbarten Kneipe
verbringen konnten. Da wir mal wieder gl&#252;cklicher Besitzer eines Tickets
waren, brauchten wir uns wenig sp&#228;ter auch nicht die M&#252;he machen, einen
Umtauschschein einzul&#246;sen, sondern konnten uns ganz gen&#252;sslich an den Anfang
der Reihe vor der Kasse stellen und kamen somit in die erste Reihe.</P>

Diesesmal war es sogar ein ganz besonderes Ereigniss, da hier ein Live
Video und ein Live Album mitgeschnitten wurden (erscheinen beide im Novemeber).
Zus&#228;tzlich wurde der ganze Kram noch in`s Internet gestreamt. Wer zuf&#228;llig
reingeguckt hat: Ich war der Typ in der ersten Reihe etwas weiter links mit
dem Helloween Shirt.... </P>

Zun&#228;chst kamen Warhead auf die B&#252;hne, die mit ihrem klassischen Heavy Metal
zwar H&#246;fligkeitsapplaus ernten konnten, aber das war es dann auch schon. Die
Band war zwar auf der B&#252;hne recht agil (und hatten auch einige gute Scherze
auf Lager), aber das Songmaterial war, meiner Meinung nach, viel zu
durchschnittlich und leider ohne entsprechende Highlights. Eine gewisse
Klasse konnte man dem Trio zwar nicht absprechen, aber das ist unter dem
Strich immer noch zu wenig.</P>

Richtig schlimm war aber erst die folgende Vorband, die auf den klangvollen
Namen White Skull h&#246;rt. Ok, True Metal Bands (und besonders welche aus
Italien) sind zur Zeit angesagt, aber ist das ein Grund, gleich jede Band
aus eben jenem Land auf die B&#252;hne zu lassen? Zun&#228;chst w&#228;ren da erstmal die
absolut peinlichen Requisieten zu nennen, die mit vielen T&#246;tenk&#246;pfen
geschm&#252;ckt waren und auf der B&#252;hne einfach nur l&#228;cherlich aussahen. Das alleine w&#228;re ja
noch zu ertragen, aber auch die Band selber war echt `ne Lachnummer. So
h&#252;pften die Leute &#252;ber die B&#252;hne, guckten m&#246;glichst b&#246;hse und zeigten
nat&#252;rlich alle zwei Sekunden den bekannten &quot;Evil Gru&#223;&quot;, was nicht gerade
besonders einfallsreich ist (und nach `ner Zeit auch absolut langweilig
wurde). Hinzu kommt ein total &#252;berfl&#252;ssiges Songmaterial, welches man total
vergessen kann und am besten unter der Rubrik &quot;M&#252;ll&quot; zu finden sein d&#252;rfte.
Also ehrlich, nichts gegen Newcomer, aber f&#252;r mich sind White Skull eher ein
Witz und sollten die n&#228;chsten 5 Jahre am besten in den Aufnahmebunker
eingespert werden, damit die n&#228;chste Platte vern&#252;nftiger wird und die
Leutchen dann vielleicht auch ohne Spielfehler auftreten k&#246;nne. K&#246;nnt ihr
vergessen; Warhead waren auf jeden Fall der bessere Support!</P>

Nat&#252;rlich freute ich mich jetzt umso mehr auf den Headliner Grave Digger,
aber vorher hatte ich noch ein nettes Gespr&#228;ch mit einem weiteren Fan, der
mir klar machen wollte, da&#223; ich besser f&#252;r ihn Platz machen sollte, da er ja
<img src="konzert.jpg" align=left>schon sooo viele Konzerte in der ersten Reihe ausgehalten hat (wer es nicht
wei&#223;: Es geht recht anstrengend in den ersten 5 Reihen bei einem Metal
Konzert zu - nichts f&#252;r zerbrechliche). Er wollte mich also dort irgendwie
vertreiben und als er mit seiner K&#246;perkraft nicht sonderlich weit kam,
laberte er mir noch ein Kotlett an die Backe (&quot;Pass auf, Junge! Zum letzten
Mal: Verpiss Dich!&quot;). Nat&#252;rlich blieb ich trotzdem dort stehen und der Arme
Irre (von Beruf vielleicht Volltrottel) stand weiterhin in der L&#252;cke
zwischen Reihe 1 und 2 bis das Konzert anfing. Tja und dann konnte ich ganz
einfach die komplette Kraft der nach rechts dr&#252;ckenden Menge einsetzen und
der Arme fiel massiv zur&#252;ck....</P>

Als dann endlich das Licht ausgegangen war und der Reaper (Bandmaskottchen)
die B&#252;hne st&#252;rmte um Excalibur (das letzte Album hatte inhatlich die Arthurssage zum Thema)
zu den Kl&#228;ngen des Intro`s
in den daf&#252;r vorgesehenen Stein zu platzieren, hielt es kaum noch jemanden.
Und als dann endlich die komplette Band, angef&#252;hrt von Strahlemann Chris
Boltendahl, die B&#252;hne st&#252;rmte, war die ausverkaufte Zeche ein einziges
Tollhaus. Aus fast 1000 Kehlen h&#246;rte man zun&#228;chst den mit Pyros unterlegten
Opener &quot;Pendragon&quot; gefolgt von &quot;Excalibur&quot;. Schon hier merkte man der Band
die Spiellaune ganz deutlich an und besonders Chris Boltendahl schien die
euphorischen Rufe begeistert aufzunehmen. Und so spielte sich die Band durch
ein Set, welches zwar keine &#220;berraschung (wie auch, wenn man ein
Live Album mitschneidet), aber daf&#252;r jede Menge Klassiker und somit nur
Highlights enth&#228;lt. St&#252;cke wie &quot;Rebellion&quot;, &quot;The Battle Of Banackborn&quot;,
&quot;Headbanging Man&quot; und &quot;The Reaper&quot; muss man einfach kennen. Zudem hatte man
mit &quot;Emerald Eyes&quot; und &quot;Mary (Queen Of Scots&quot;) auch zwei Balladen im Set,
wobei besonders letztere f&#252;r wahre G&#228;nsehautatmosph&#246;re sorgte und auf der
Live Scheibe bestimmt besonders gut r&#252;berkommen werden. Unterlegt wurde das
ganze von zahlreichen Pyro`s und Explosionen, die das ganze auch visuell
noch unterst&#252;tzen. Zudem war auch das Publikum total begeistert und
unterst&#252;tzte die Band, wo es nur konnte. So gab es auch mehrere Zugaben,
wobei bei &quot;Heavy Metal Breakdown&quot;, dem traditionellen Abschluss eines jeden Grave
Digger Konzertes, die Meute nochmal komplett ausflippte. F&#252;r mich war es ein
hervorragendes Konzert (auch wenn ich tagelang danach krank im Bett lag...)
und ich bin mir sicher, da&#223; das Live Album dies auch deutlich beweisen wird.
Geiler Gig!</P>


<u>Setlist</U> (wie &#252;blich: Falsche Reihenfolge):<BR>

1. The Secrets Of Merlin (Intro)<BR>

2. Pendragon<BR>

3. Excalibur<BR>

4. The Round Table (Forever)<BR>

5. Headbanging Man<BR>

6. Morgane Lefay<BR>

7. The Dark Of The Sun<BR>

8. Emerald Eyes<BR>

9. Knights Of The Cross<BR>

10. Tristan`s Fate<BR>

11. Battle Of Bannockborn<BR>

12. Inquisition<BR>

13. The Brave<BR>

14. Scotland United<BR>

15. The Balld Of Mary<BR>

16. Rebellion (The Clans Are Marching)<BR>

17. The Reaper<BR>

18. Circle Of Witches<BR>

19. Heavy Metal Breakdown</P>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
