

<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>News</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="RED">News</FONT></h1></CENTER></P><UL>

<li> Die All Star True Metal Combo <b>Metalium</B> (die im Sommer letzten Jahres noch ihr
durchweg gutes Debut vorgelegt haben) scheint langsam, aber sicher
auseinanderzubrechen: Nach dem Theater um Mike Terrana haben jetzt auch die
anderen beiden &quot;Zugpferde&quot; Chris Caffery (<b>Savatage</B>) und John Osborn
(<b>Doctor
Butcher</B>) die Band verlassen. Auch wenn die Gr&#252;nde eher im &#252;berf&#252;llten
Terminplan der beiden zu suchen ist, hat <b>Metalium</B>, die urspr&#252;nglich im
Fr&#252;hjahr in`s Studio gehen wollten, damit ein ernstzunehmendes Problem. Die
Zukunft dieser Band wird also gewiss interessant werden....</P><BR>

<li> <b>Iced Earth</B> haben es doch tats&#228;chlich geschafft, mit ihrem 3 CD Live Album
&quot;Alive In Athens&quot; in Griechendland eine Goldene Schallplatte einzufahren. Es
geschehen also noch Zeichen &amp; Wunder. Herzlichen Gl&#252;ckwunsch auch von meiner
Seite aus!</P><BR>

<li> Entgegen &#228;lterer Meldungen, da&#223; sich <b>Kilgore</B> aufgel&#246;st h&#228;tten, was nach
dem Ausstieg von S&#228;nger Jay Berndt beschlossene Sache war, machen sie nun
doch mit Dustin Lowery an den Vocals weiter.</P><BR>

<li> Nach fast 12 monatigem Schweigen hat sich <b>Blaze Bayley</B> (ex-<b>Iron Maiden</B>)
endlich mal wieder an die &#214;ffentlichkeit gewagt. Zum Thema <b>Iron Maiden</B> war
zwar nichts zu h&#246;ren, aber daf&#252;r will Blaze Bayley die erste CD seines neuen
Projektes Blaze schon Ende M&#228;rz auf die &#214;ffentlichkeit loslassen. Betitel
ist selbige mit &quot;Silicon Messiah&quot;, die von Andy Sneap (u.a. <b>Artillery</B>) produziert wurde.
</P><BR>
<li> Auch von den Melodic Metallern <b>Edguy</B> ist mal wieder etwas neues zu h&#246;ren:
Wie schon bekannt war, soll das erste Album &quot;Savage Poetry&quot; nochmal neu
aufgelegt werden. Im Hause <b>Edguy</B> ist man nun zu dem Entschluss gekommen,
daraus gleich eine Doppel CD zu machen: Eine CD soll die Originalaufnahmen
von `95 enthalten, die andere neu eingespielte Versionen. Da man plant, das
Ding zun normalen Preis in die L&#228;den zu stellen, ist sicherlich nichts
dagegen einzuwenden. Betitelt wird das ganze aller Vorraussicht nach mit
&quot;New Savage Poetry&quot;.</P><BR>

<li> Um in diesem Jahr die Festivals Fan freundlicher zu gestalten, hat man die
Hard Union gebildet: So werden die drei Festivals &quot;Wacken Open Air&quot;, &quot;With
Full Force&quot; (mit <b>Iron Maiden</B> als Headliner !) und &quot;Bang Your Head&quot; unter
einem Dach organisiert, was die Abzockerei deutlich absenken soll. Im
letzten Jahr war es n&#228;mlich so, da&#223; die Festival Saison bei den Fans alles
andere als gut ankam. Ob es dieses Jahr besser wird, steht aber trotzdem in
den Sternen...</P><BR>

<li> Bei <b>Sinner</B> gibt`s offenbar Probleme bei der Position des Drummer`s: Auf
der neuesten Scheibe, die Ende M&#228;rz in den CD Regalen zu finden sein soll
und bisher mit &quot;The End Of The Sanctuary&quot; betitelt ist, wird Uli Kusch
(<b>Helloween; ex-Gamma Ray</B>) hinter der Schie&#223;bude sitzen. Genaueres lie&#223; sich
nicht in Erfahrung bringen....</P><BR>

<li> <b>Gamma Ray</B> haben sich etwas ganz besonderes einfallen lassen: Zu 99 %
sicher scheint die Tatsache zu sein, da&#223; die Hamburger in diesem Jahr drei
Shows in Deutschland spielen werden. Wenn man bedenkt, da&#223; au&#223;er einem Best
Of Album in diesem Jahr auch nichts mehr kommen wird, ist an der Zahl der
Shows auch nichts auszusetzen. Das besondere dabei: Man will s&#228;mtliche
ex-Mitglieder f&#252;r diese 3 Shows zur&#252;ckholen, so da&#223; jeder Song Live in der
Originalbesetzung gespielt wird. Ob man dabei aber s&#228;mtliche Gitarristen /
Bassisten bekommt, die mal bei <b>Gamma Ray</B> gespielt haben, darf angezweifelt
werden. Sicher scheint lediglich zu sein, da&#223; ex-S&#228;nger Ralf Scheepers
(<b>Primal Fear</B>) f&#252;r diese Shows, zumindest teilweise, am Mikro stehen wird.
Und eine Frage meinerseits: Und wer singt dann die <b>Helloween</B>
Songs?</P><BR>

<li> Victor Smolski, der aktuelle Gitarrist im <b>Rage</B> Line-up, ist bei seiner
eigentlichen Combo <b>Mind Odysee</B> wohl rausgeflogen. Pech f&#252;r <B>Mind Odysee</B>, die
jetzt einige Probleme auf dem Live Sektor haben werden, aber Gl&#252;ck f&#252;r <b>Rage</B>,
denn dadurch wird Victor Smolski wohl fester Gitarrist im <b>Rage</B> Line-up
werden.</P><BR>

<li> Die geplante <B>Creed</B> Tour wurde, aufgrund gesundheitsbedingter Probleme,
abgesagt. Diejenigen unter Euch, die schon eine Karte besitzen, brauchen
sich aber keine Sorgen zu machen: Die Tour wird demn&#228;chst nachgeholt und die
Karten behalten selbstverst&#228;ndlich ihre G&#252;ltigkeit.</P><BR></UL> 





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
