
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Oldie Review</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="WHITE">Oldie Review</FONT></h1></P>

<h2>Samson - Head On</h2></CENTER></P>

Als die NWOBHM (New Wave Of British Heavy Metal) ihren Anfang nahm, war eine
Band namens Samson ebenfalls am Start, die auch einige Jahren zu den
Zugpferden eben jener Bewegung geh&#246;rte und das nicht grundlos: F&#252;r die
Vocals war niemand geringeres als Bruce Dickinson (Iron Maiden; damals noch
unter seinem Pseudo Bruce Bruce) verantwortlich, was dem Samson Sound im
nachhinein immer wieder Vergleiche mit Iron Maiden einbringt. So auch dieses
Album, welches man quasi als stilistischen Vorl&#228;ufer des sp&#228;ter ber&#252;hmten Iron Maiden
Sounds durchgehen lassen kann.</P>

Warum es mit Samson nicht geklappt hat, ist zumindest mir v&#246;llig
schleierhaft, denn immerhin legte die Band mit diesem Album und dem
Nachfolger &quot;Shock Tactics&quot; zwei wirklich brilliante Scheiben hin. So sind
auf &quot;Head On&quot; nahezu nur klasse Tracks vertreten, die zudem noch h&#246;chst
abwechselungsreich sind. Neben den beiden Ohrw&#252;rmern &quot;Hard Times&quot; und &quot;Take Me
To Your Leader&quot; sind vor allem die experimentellen St&#252;cke &quot;Too Close To
Rock&quot; und &quot;Walking Out On You&quot; interessant; letzteres gl&#228;nzt fast schon mit
progressiven Elementen. Nicht verschweigen m&#246;chte ich nat&#252;rlich das
Highlight der CD, welches den klischeehaften Titel &quot;Hammerhead&quot; tr&#228;gt.
Dieses St&#252;ck ist mit Abstand das h&#228;rteste, das auf diesem Album zu finden
ist und gl&#228;nzt zudem noch mit einem Refrain, der sofort in`s Ohr geht (davon
k&#246;nnten sich einige der unz&#228;hligen Newcomer eine Scheibe abschneiden). Dem
vorangestellt ist &#252;brigens ein Intro mit dem klangvollen Namen
&quot;Thunderburst&quot;, an dem auch Iron Maiden Chef Steve Harris mitgearbeitet hat.
Nicht zuletzt deswegen sind starke Gemeinsamkeiten zu dem sp&#228;ter erschienenen Intro &quot;Ides Of
March&quot; (auf der Iron Maiden Platte &quot;Killers&quot;) sicherlich alles andere als
purer Zufall...</P>

Das 1980 erschienene Album &quot;Head On&quot; ist f&#252;r mich ein Meileinstein im Heavy Metal Bereich und geh&#246;rt
eigentlich in jede gut sortierte Metal Sammlung. Zwar war die CD jahrelang
schwierig zu kriegen (&#252;ber 100 DM und mehr auf Plattenb&#246;rsen), aber Bruce
Dickinson hat versprochen, die CD bald auf seinem eigenen Label zu re-releasen, womit
&quot;Head On&quot; auch f&#252;r den &quot;normalen&quot; Metal Freak erschwinglich wird. Ob dann
das Bruce Dickinson Interview von 1988 auch drauf sein wird, darf bezweifelt
werden, aber sobald das Teil erh&#228;ltlich ist, rate ich Euch sofort
zuzugreifen. Es lohnt sich!</P>

Fazit: 10 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="oldie.jpg"></P>
<img src="kit.gif"></P></CENTER>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
