<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Empire</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="../bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">

<table width="98%" align="center" border="0" cellspacing="0" cellpadding="8">
<tr>

<div align="center"><img src="gt_empire2.gif" width=320 height=200 border=0 alt=""></div>
<p title="" align="JUSTIFY">Da ich jetzt schon mit meinem Freund Gerd das Spiel Empire gespielt habe m&ouml;chte ich Euch einen kurzen &Uuml;berblick dieses Spieles geben. Das Spiel f&auml;llt in die Kategorie Runden-Strategie  und ist von 1988. Es unterst&uuml;tzt bis zu drei Spieler welche auch vom Computer belegt werden k&ouml;nnen. Das klingt ein wenig unlogisch aber es ist wirklich so das man alle Spieler als Computerspieler einstellen kann. Bei der darauffolgenden Schlacht bekommt man dann sozusagen ein Livedemo um sich die Strategie des Computers anzuschauen. Den Computergegner kann man auf Normal oder Experte einstellen, welcher schon einiges vom Spieler abverlangt. Als Einheiten hat Panzer, Flugzeug, U-Boot, Transporter, Zerst&ouml;rer, Kreuzer, Schlachtschiff und Flugzeugtr&auml;ger. Man beginnt das Spiel mit einer Stadt in der man m&ouml;glichst erstmal Panzer bauen sollte, da nur diese andere St&auml;dte erobern k&ouml;nnen. Das Spielefeld ist zu Anfang schwarz und mu&szlig; von den Einheiten entdeckt werden, was einen grossen Teil des Spasses ausmacht. Nun muss man, ausgehend von seiner Anfangsstadt, andere St&auml;dte erobern und feindliche Einheiten vernichten. Da die eigenen Einheiten nur einen ganz kleinen Sichtradius haben, ist das Aufsp&uuml;ren feindlicher Einheiten gar nicht mal so leicht. Im sp&auml;teren Verlauf hat man dann schon ein gewisses Gebiet unter seiner Kontrolle und ist haupts&auml;chlich mit der Logistik besch&auml;ftigt. Da die Spielwelt meisstens aus mehreren Landmassen besteht, muss man seine Panzer auf einen Transporter laden und den dann an die K&uuml;ste einer anderen Landmasse bewegen. Das Spiel hat eine einfache aber zweckm&auml;ssige Grafik und als Sound gibt es nur die Ger&auml;usche der jeweiligen Einheit, die gerade am Zug ist. Es ist auff einer Diskette und kann auch auf die Festplatte installiert werden. Auf einem A500 l&auml;uft es gut. Als besonderes Feature kann man die Spielst&auml;nde passwortgesch&uuml;tzt auch als Play-by-Mail abspeichern und somit das Spiel an einen anderen Spieler weitergeben, der dann seinen Zug macht. Mich hatte das Spiel jedenfalls monatelange besch&auml;ftigt.<br><br>
Euer Spezi<br><br>
<table border="5" cellspacing="1" cellpadding="5" align="CENTER">
<tr>
	<td>Rainer Wrieden</td>
	<td>E-Mail: <a href="mailto:spezis@terra.es">spezis@terra.es</a></td>
</tr>
</table>
</p>

</table>

</body>
</html>
