<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Interview Nr 6</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="Interview">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Stefan Kost</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>SoundFX</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>  
                <TD>http://www.sonicpulse.de</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>     
                <TD>ensonic@sonicpulse.de</TD>
              </TR>
            </TABLE>
            <BR>
            <BR>
          </CENTER>

          <P><B>Bitte stelle Dich den Lesern vor!</B><BR>
          Mein Name ist Stefan Kost, ich bin 28 Jahre alt, arbeite als technischer
          Leiter f&uuml;r Softwareentwicklung in einer Firma und schreibe eine
          Doktorarbeit in der Informatik. Da dies f&uuml;r ein ausgef&uuml;lltes
          Leben nicht reicht ;-) entwickle ich noch diverse Software f&uuml;r
          Amiga-Systeme, komponiere Musik und mache gerne Sport.</P>

          <P><B>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</B><BR>
          Gleich nach der Wende habe ich mir einen A2000 gekauft und mit diesem
          arbeite ich noch immer.</P>

          <P><B>Welches Amiga-Modell besitzt Du?</B><BR>
          Der gerade gennante A2000 ist inzwischen in ein Towergeh&auml;use eingebaut
          worden und alle Steckpl&auml;tze sind belegt.</P>

          <P><B>Welche Version des Betriebssystems l&auml;uft auf Deinem
          Computer?</B><BR>
          OS 3.5</P>

          <P><B>Welche Software entwickelst Du?</B><BR>
          Haupts&auml;chlich SoundFX. Davon abgesehen gibts noch ne ganze Mange
          andere Sachen, die ich mal wieder ins Aminet hochladen sollte ;-)</P>

          <P><B>Kannst Du uns sagen, worum es bei SoundFX geht?</B><BR>
          SoundFX ist sowas wie ein Schweizer Taschenmesser, wenn es um
          Audiobearbeitung geht. Man kann viele Dateiformate laden und speichern und
          hat eine beachtliche Liste an Effekten zum Nachbearbeiten. Weiterhin gibt
          es Analyse Module um Sounds zu untersuchen und Synthese Module um Sounds zu
          generieren.</P>

          <P><B>Was hat Dich auf die Idee gebracht, SoundFX (weiter) zu
          entwickeln?</B><BR>
          Ich bin ein extrem neugieriger Mensch. Oft stellt sich mir die Frage "Was
          w&auml;hre wenn ...?". So hatte ich schon 1983 einige mini-Tools
          geschrieben um mit Sounds rumzuexperimentieren. 1984 gab ein Artikel in der
          Zeitschrift KEYS den Durchbruch - da ging es darum wie digitale
          Signalprozessoren arbeiten. Die Beispiele waren in Basic f&uuml;r den Atari
          geschrieben. Kurz danach gabs SoundFX-1.0. Seit dem hat sich das Programm
          gewaltig entwickelt.</P>

          <P><B>Wie lange hat die Entwicklung bisher gedauert?</B><BR>
          Nun, im Sommer sind es 9 Jahre.</P>

          <P><B>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</B><BR>
          Die Liste der Ideen ist ganz sch&ouml;n lang. Zum Gl&uuml;ck bekomme ich
          viel Unterst&uuml;tzung von Mitgliedern der SoundFX Mailingliste. Wichtig
          ist sicher die Portierung auf OS4.0/MorphOS. Mit einem PPC unter der Haube
          w&auml;hren auch Realtime Effekte m&ouml;glich. Genaues kann man da aber
          noch nicht sagen, ich m&ouml;chte nicht das dann jemand entt&auml;uscht
          ist.</P>

          <P>Derzeit steht die Ver&ouml;ffentlichung der Version 4.2 an. Diese ist
          wesentlich robuster. Besonders ein Malinglisten-Mitstreiter : Dan Jedlicka
          hat mir sehr geholfen.</P>

          <P><B>Worin unterscheidet sich SoundFX von anderen vergleichbaren
          Programmen?</B><BR>
          Ich denke es ist eines der wenige Programme in dieser Richtung, welches
          noch aktiv entwickelt wird. Gerade f&uuml;r experimentierfreudige Menschen
          bietet SoundFX eine F&uuml;lle von M&ouml;glichkeiten, die nicht nur auf
          dem Amiga einzigartig sind.</P>

          <P><B>Welche Musik h&ouml;rst Du Privat?</B><BR>
          Schwarze Musik, besonders Dark-Wave, Electro. Im speziellen Bands wie VNV
          Nation, Project Pitchfork, Velvet Acid Christ, usw.</P>

          <P><B>Welche Software verwendest Du zum Entwickeln?</B><BR>
          Ich verwende immer noch SAS/C. Mittlerweile bin ich jedoch vom ProgEd auf
          den GoldEd umgestiegen, da der ProgEd nicht weiterentwickelt wird. Leider
          trifft den GoldEd nun das gleiche Schicksal. Einen modularen Editor wie
          z.B. der jedit (siehe www.jedit.org) k&ouml;nnte der Amiga seht gut
          gebrauchen.</P>

          <P><B>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
          Du?</B><BR>
          AmigaOS. MorphOS ist interessant, doch leider habe ich kein PPC System.</P>

          <P><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen?</B><BR>
          Ich werde versuchen mir ein PCC-Amiga-System zu kaufen und dann sowohl
          MorphOS als auch AmigaOS zu testen. Mir w&auml;re es schon lieb beide
          Systeme unterst&uuml;zen zu k&ouml;nnen.</P>

          <P><B>Was sind die Gr&uuml;nde um dieses OS zu unterst&uuml;zen?</B><BR>
          Leider habe ich keinerlei Erfahrungen mit beiden Betriebssystemen. Das es
          zwei OS Varianten gibt, ist sowohl f&uuml;r Benutzer als auch f&uuml;r
          Entwickler sehr hinderlich.</P>

          <P><B>Welche M&ouml;glichkeiten vermisst Du am AmigaOS f&uuml;r die
          Entwicklung?</B><BR>
          Ich hoffe das es parallel zum OS4.0 eine neue Entwickler CD mit einem
          vorkonfigurieten Compiler System geben wird (bestimmt gcc). Ansonsten
          klingen die Features des OS4.0 vielversprechend.</P>

          <P><B>Welche M&ouml;glichkeiten w&uuml;nschst Du Dir f&uuml;r die
          Entwicklung am Amiga?</B><BR>
          Mehr Zusammenarbeit mit den Entwicklern (Foren, Teile des OS als OpenSource
          mit einer Entwicklungsplatform wie Sourceforge). Keine
          Rechtsstreitigkeiten. Eine Zusammenarbeit mit dem MorphOS Team w&auml;re
          sicherlich auch gut.</P>

          <P><B>Verlierst Du nicht den Spass und das Interesse am Programmieren wenn
          Du die geringe Resonanz siehst, die aus dem kleinen Amiga-Markt
          erh&auml;ltst?</B><BR>
          gering ist die Resonanz garnicht.</P>

          <P><B>Erh&auml;ltst Du genug R&uuml;ckmeldungen f&uuml;r Deine
          Software?</B><BR>
          &Uuml;ber die Mailingliste kommt viel Feedback. Ausserdem habe ich jetzt
          einen Bug und Feature-Request-Tracker auf meiner Webseite laufen. Wenn die
          User erstmal merken, das gemeldete Bugs so effektiv und schnell behoben
          werden, dann klappt das mit dem Feedback.</P>

          <P><B>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
          gekauft?</B><BR>
          GoldEd :-(</P>

          <P><B>Welche Software verwendest Du noch?</B><BR>
          MakeCD, Voyager, Yam</P>

          <P><B>Welche Hard-/Software hast Du vor zu kaufen?</B><BR>
          PPC basierter Amiga</P>

          <P><B>Glaubst Du an ein Comeback von Amiga?</B><BR>
          Ja. Die Chance besteht noch immer. Ich hoffe nur eindringlichst, das mehr
          zusammengearbeitet wird. Weniger Konkurrenzdenken und mehr offene Karten
          k&ouml;nnen gewaltige Synergien ausl&ouml;sen!</P>

          <P><B>Deine letzten Worte an die Leser?</B><BR>
          Bleibt am Ball, unterst&uuml;tzt die Autoren von Software. Nicht nur die
          Registration ist wichtig, sondern Mitmachen und Helfen. Es gibts tausend
          kleine Jobs die auch ohne Programmierkenntnisse machbar sind, wie Betreuung
          der Mailingliste, Newsletter, Koordination der Lokale-&Uuml;bersetungen,
          Dokumentaion, wo sich jeder Entwickler freut wenn er da Unterst&uuml;tzung
          bekommt.</P>

          <P>-- &copy; Amiga Arena 05/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

