<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Interview Nr 1</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    
    <TABLE width="100%" border="0" cellpadding="8" summary="Interview">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Felix Schwarz (IOSPIRIT)</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>fxPAINT, fxSCAN, VHI Studio</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>http://www.IOSPIRIT.de/</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD valign="top">info@IOSPIRIT.de</TD>
              </TR>
            </TABLE>
            <BR>
            <BR>
          </CENTER>

          <P><B>Hallo Felix,kannst Du bitte einwenig &uuml;ber Dich und Deinem Amiga
          Werdegang erz&auml;hlen?</B><BR>

          Hallo Olaf! Nun, angefangen hat damals alles im Alter von 6 oder 7 Jahren
          mit einem ZX Spectrum, an dem ich meine ersten Zeilen Basic schrieb. Mit
          der Zeit wurde der Leistungshunger und Umfang meiner Programme gr&ouml;sser
          und ein Sinclair QL trat die Nachfolge des ZX Spectrum an. Nachdem Sinclair
          Pleite gegangen war und keine Ersatzteile mehr f&uuml;r den QL zu bekommen
          waren, stieg ich letzten Endes auf einen Amiga 2000 um, dessen
          Multitasking- und Grafikf&auml;higkeiten mich faszinierten. Vor allem
          Deluxe Paint hatte mich zu dem Zeitpunkt fasziniert. Niemals h&auml;tte ich
          damals geglaubt, dass ich sp&auml;ter selbst einmal mit Grafik meine
          Br&ouml;tchen verdienen w&uuml;rde ;). Dem Amiga 2000 folgten ein A1200,
          ein A4000, und vor wenigen Wochen ein A4000T.</P>

          <P><B>Nachdem Du in der Vergangenheit mit Programmen wie Ultraconv oder
          BlackIRC auf Dich Aufmerksam gemacht hast, denke ich kam der Durchbruch mit
          fxPAINT. Wie sieht es heute mit der Weiterentwicklung des Programmes
          aus?</B><BR>

          fxPAINT wurde die ganze Zeit kontinuierlich weiterentwickelt und derzeit
          arbeite ich an der Version 2.0. Dort sind bereits jetzt viele echte Knaller
          enthalten, die es bisher weder auf dem AMIGA noch auf anderen Plattformen
          gibt. Da ich diese aber nicht vorweg nehmen m&ouml;chte und das finale
          Featureset noch nicht feststeht, bitte ich noch um ein wenig Geduld bis ich
          hierzu eine ausf&uuml;hrliche Ank&uuml;ndigung mache.</P>

          <P><B>Siehst Du oder gibt es &Uuml;berhaupt noch eine Nachfrage an
          Mal/Bildbearbeitungs Programmen f&uuml;r den Amiga?</B><BR>

          AMIGA-User sind traditionellerweise sehr stark an Computergrafik, und allem
          was mit deren Erstellung und Bearbeitung zu tun hat, interessiert. Nachdem
          fxPAINT ein sehr leistungsstarkes Produkt ist, dass M&ouml;glichkeiten weit
          &uuml;ber die &uuml;blichen Bildbearbeitungs- und Malfunktionen anderer
          Programme hinaus bietet, die breiteste Unterst&uuml;tzung moderner Hardware
          am Markt anbietet, mit jeder Version seinen Vorsprung ausbaut und eine
          treue Fangemeinde besitzt, sehe ich hier durchaus einen Markt.</P>

          <P><B>Worin hat Deiner Meinung nach der Amiga noch Vorz&uuml;ge um
          Grafiken/Bilder zu erstellen?</B><BR>

          Der AMIGA ist zun&auml;chst als Plattform gut geeignet: er arbeitet
          schnell, effizient und macht in der Regel das, was man von ihm will.
          Ausserdem gibt es keine andere Plattform, die (softwareseitig) f&uuml;r so
          wenig Geld so viel Grafikpower bietet wie der AMIGA. Und zumindest bei
          meinen Produkten ist die Benutzung trotz m&auml;chtigem Funktionsumfang
          auch noch sehr einfach. Wenn ich mir z.B. ansehe, welche Kopfst&auml;nde
          Freunde machen m&uuml;ssen bis sie an ihrem Windows PC aus einem gescannten
          Bild eine PDF-Datei machen .. mit fxSCAN braucht man nach dem Scannen noch
          genau 3 Klicks und die Eingabe eines Dateinamens bis zur fertigen
          PDF-Datei.</P>

          <P><B>Kannst Du uns jetzt schon was &uuml;ber geplante Features,
          Programmversion etc. von fxPAINT erz&auml;hlen?</B><BR>

          Die n&auml;chste Version wird 2.0 sein. Zu den Features nur soviel: Auf der
          Liste meiner &Auml;nderungen sind bereits 53 Eintr&auml;ge und darunter
          einige echte Knaller und umfangreiche &Auml;nderungen und Erweiterungen.
          Eine Ank&uuml;ndigung mit Details zu fxPAINT 2.0 wird kommen, ich bitte
          hier aber noch um ein wenig Geduld.</P>

          <P><B>Nachdem es eigentlich im Jahr 2000/01 etwas ruhig um Dich geworden
          war,&uuml;berraschte es mich umso mehr als Du im April diesen Jahres mit
          der Gr&uuml;ndung von IOSPIRIT wiedergekehrt bist. Was hat Dich dazu
          bewegt<BR>
          A) Weitherin f&uuml;r den Amiga zu entwickeln?<BR>
          B) Dies mit einer Gr&uuml;ndung eines Unternehmens zu
          bekr&auml;ftigen?</B><BR>

          Neben der Tatsache, dass es einfach Spass macht, glaube ich auch, dass im
          AMIGA immer noch genug Leben ist, um Entwicklungen (auch finanziell) zu
          rechtfertigen. Die ewige (und oftmals unn&ouml;tige) Schwarzmalerei auch
          vieler AMIGA Firmen haben dem AMIGA zwar sehr geschadet und sind sicherlich
          zu einem guten Anteil daran Schuld, dass Viele den AMIGA verlassen
          haben.</P>

          <P>Ich bin aber der &Uuml;berzeugung, dass man durch die richtigen Impulse
          dem AMIGA durchaus eine Zukunft geben kann. Hier gilt, wie im ganzen Leben,
          das Prinzip von Ursache und Wirkung (cause and effect): Negative Signale,
          negativer Effekt - positives Denken und gute Produkte, positives Echo.
          Packen wirs an!</P>

          <P><B>Amiga Produkte liegen zur Zeit wie "Blei" in den Regalen, kannst Du
          hier von einer Trendwende sprechen oder siehst Du ein positives Signal am
          Amiga Markt f&uuml;r den Verkauf Deiner Produkte?</B><BR>

          Die Verk&auml;ufe laufen freilich nicht mehr so gut wie fr&uuml;her, aber
          die H&Auml;ndler hatten eigentlich nie Probleme mit dem Verkauf meiner
          Produkte. Daf&uuml;r, dass es so lange absolut still um mich und meine
          Produkte war, liefen die Verk&auml;ufe w&auml;hrend dieser Zeit sogar
          erstaunlich gut (aber auch nur daf&uuml;r).</P>

          <P>Eine echte Trendwende und ein Ende der Kaufzur&uuml;ckhaltung sehe ich
          aber fr&uuml;hestens mit Erscheinen von Pegasos/MorphOS oder
          AmigaONE/AmigaOS 4.0. Viele sind verunsichert, ob die Software denn auch
          auf den neuen Rechnern laufen wird und scheuen daher jeden Kauf. Das
          schadet dem AMIGA-Markt, da nat&uuml;rlich jeder H&Auml;ndler und
          Entwickler weiterhin laufende Kosten hat, die eher mehr als weniger werden.
          Es wird also endlich Zeit, dass den Ank&uuml;ndigungen endlich Taten
          folgen.</P>

          <P>Ich kann aber jedem User versichern, dass ich meinen Sourcecode
          entsprechend anpassen und einen kostenlosen Patch &uuml;bers Internet zur
          Verf&uuml;gung stellen werde, sollten Inkompatiblit&auml;ten mit fxSCAN
          4.0, fxPAINT 2.0 oder VHI Studio auftreten. Es gibt also keinen Grund,
          diese Produkte nicht zu ordern und schon jetzt in den Genuss ihrer vielen
          M&ouml;glichkeiten zu kommen.</P>

          <P><B>Deinen Lebesunterhalt d&uuml;rftest Du aber wohl nicht damit
          bestreiten oder?</B><BR>

          Sagen wir einmal: Ich versuche es. Ob es klappt, wird sich in den
          n&auml;chsten Monaten zeigen. <B>Sollte</B> es nicht klappen, werde ich
          zuk&uuml;nftig wohl auch andere Plattformen unterst&uuml;tzen m&uuml;ssen.
          Den AMIGA w&uuml;rde ich aber selbst dann sicher nicht fallen lassen!</P>

          <P>Umso mehr schmerzt nat&uuml;rlich die Einstellung Vieler, die lieber
          Raubkopien ziehen anstatt meine Arbeit ehrlich zu bezahlen. Den Schaden in
          den vergangenen Jahren durch gecrackte Raubkopien sch&auml;tze ich
          (vorsichtig und realistisch anhand von verschiedenen Downloadzahlen von
          Updates &uuml;ber einen kurzen Zeitraum) auf einen f&uuml;nfstelligen
          EURO-Betrag.</P>

          <P>Gegen die Ersteller der mir bekannten, gecrackten Versionen und deren
          Verteiler (auch im Ausland) wird in K&uuml;rze Anzeige gestellt. Einige
          Realnames sind mir durch Nachforschungen mittlerweile bekannt. Ich werde
          mir dieses sch&auml;dliche, kriminelle Treiben nicht mehr l&auml;nger
          ansehen. Wer vors&auml;tzlich meine Existenz (und die vieler Anderer!)
          bedroht und meinem Unternehmen nachhaltig schadet, darf nicht auf Milde
          hoffen, hier ist Schluss mit lustig!</P>

          <P><B>fxSCAN scheint zur Zeit Dein "Zugpferd" zu sein und diesen Monat gab
          es zahlreiche Neuigkeiten aus dem Haus IOSPIRIT, was mach fxSCAN zur Zeit
          einzigartig f&uuml;r den Amiga?</B><BR>

          Kurzes Brainstorming:

          <DL>
            <DT>- eine sehr leistungsstarke und schnelle Texterkennung</DT>
            <DT>- ein PDF-Export der schneller ist als die Anzeige der erzeugten
                  Datei in APDF</DT>
            <DT>- die Unterst&uuml;tzung von USB-Scannern</DT>
            <DT>- die beste Kopierfunktion auf dem AMIGA</DT>
            <DT>- schnelle und gute Nachbearbeitungsfunktionen</DT>
            <DT>- integrierte L&ouml;sung rund ums Scannen, minimale Wege und Zeiten
                  bis zum Ziel</DT>
            <DT>- umfangreiche PPC-Unterst&uuml;tzung</DT>
          </DL></P>

          <P><B>Besteht &Uuml;berhaupt ein ausreichender Markt an z.b Amiga Usern die
          USB haben um solche Treiber zu erm&ouml;glichen bzw. die Kosten daf&uuml;r
          zu decken?</B><BR>

          Michael B&ouml;hmer und Chris Hodges sind sehr engagierte Menschen und
          haben viel Geld und Zeit investiert, um USB am AMIGA zu erm&ouml;glichen.
          Durch meine erg&auml;nzende Unterst&uuml;tzung mit Scanner- und
          Digitalkameratreibern hoffe ich weitere gute Argumente f&uuml;r den Kauf
          der USB-Karten liefern zu k&ouml;nnen und hier einen Markt zu schaffen. Ich
          verwende HIGHWAY-Karte und Poseidon-Stack jetzt schon eine ganze Weile und
          kann sie eigentlich nur jedem ans Herz legen, hier liefert jemand ein
          durch-und-durch rundes und gutes Produkt ab.</P>

          <P>Ausserdem unterst&uuml;tze ich &uuml;ber meine Zwischenschicht IOUSB
          auch Konkurrenzprodukte wie den AmigaOS 4.0 Stack und hoffe so eine
          Aufsplittung des Marktes von Anfang an vermeiden zu k&ouml;nnen.</P>

          <P><B>Mit fxSCAN d&uuml;rfte somit auch f&uuml;r das kommende AmigaOS 4.0
          die erste professonelle Software zur verf&uuml;gung stehen. Wird sich die
          OS 4.0 Version zur jetzigen unterscheiden? Wenn ja in welchen
          Punkten?</B><BR>

          fxSCAN 4.0 sollte ohne &Auml;nderungen unter OS 4.0 laufen. Sollten dennoch
          Inkompatiblit&auml;ten auftreten und diese durch &Auml;nderungen in meinem
          Sourcecode gel&ouml;st werden k&ouml;nnen, wird es einen kostenlosen Patch
          geben.</P>

          <P><B>Werden weitere Software Programme f&uuml;r AmigaOS 4.0 von Dir
          angepasst?</B><BR>

          Soweit n&ouml;tig nat&uuml;rlich auch fxPAINT und VHI Studio.</P>

          <P><B>Welche Software verwendest Du zum Entwickeln?</B><BR>

          GoldED, SAS/C, gcc und vbcc.</P>

          <P><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen?</B><BR>

          AmigaOS 3.1 und h&ouml;her, AmigaOS 4.0, MorphOS und Amithlon.</P>

          <P><B>Was sind die Gr&uuml;nde um dieses OS zu unterst&uuml;zen?</B><BR>

          Es war schon immer meine Philosophie, so viele Ans&auml;tze wie
          m&ouml;glich zu unterst&uuml;tzen und meine Entwicklungen so einer
          m&ouml;glichst breiten Anwenderschaft zug&auml;nglich zu machen. Anstatt
          laut "ppc.lib rulez! WarpOS sucks!" oder "WarpOS rulez! ppc.lib sucks!" zu
          schreien und meine Zeit mit ewigen und vor allem sinnlosen Diskussionen zu
          verschwenden, habe ich mir einmal ein Konzept &uuml;berlegt wie meine
          Software mit minimalem Aufwand auf m&ouml;glichst vielen Ans&auml;tzen
          optimal l&auml;uft, bin dadurch &uuml;beraus flexibel geworden:

          <DL>
            <DT>ppc.lib oder WarpOS? egal!</DT>  
            <DT>MorphOS oder AmigaOS 4.0? egal!</DT>
            <DT>Picasso96 oder CGX? egal!</DT>
            <DT>68K, Amithlon oder PPC? egal!</DT>
          </DL>

          Herausgekommen ist ein 68K-Kern mit einem PPC-Servertask, der im Prinzip
          alle rechenintensiven Funktionen des 68K-Kerns in PPC-nativer Form
          enth&auml;lt, bei Verwendung eines PPC hinzugeschaltet wird und die
          68K-Funktionen ersetzt. Der Kunde gewinnt ein hohes Mass an
          Flexibilit&auml;t und ich habe mehr Kunden, was will man mehr? </P>
                    

          <P><B>Glaubst Du an ein Comeback von Amiga?</B><BR>

          Das wird ganz von den Usern, dem Erscheinen der angek&uuml;ndigten
          Hardwareprodukte und Betriebssysteme abh&auml;ngen. Gen&uuml;gend
          Expertenwissen und Talent ist vorhanden, es ist nur die Frage, was daraus
          gemacht wird.</P>

          <P><B>Deine letzten Worte an die Leser?</B><BR>

          Unterst&uuml;tzt den AMIGA-Markt auch jetzt mit dem Kauf von Produkten. Nur
          mit Einnahmen k&ouml;nnen Firmen &Uuml;berleben und den AMIGA weiter
          unterst&uuml;tzen und das kommt letzten Endes vor allem euch wieder zu
          Gute! Think positive und stoppt die Flamewars!</P>

          <P>-- &copy; Amiga Arena 05/2002 --</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

