<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Interview Nr 5</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="Interview">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Mauro "M&amp;F" Fontana</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>BlacksEditor</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>noch nicht fertig</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD>the.optimizer@libero.it</TD>
              </TR>
            </TABLE>
            <BR>
            <BR>
          </CENTER>

          <P><B>Bitte stelle Dich den Lesern vor!</B><BR>  
          Ich bin 28 Jahre alt und habe einen Abschluss in Informatik. Ich w&uuml;rde
          mich gern auf Prozessautomatisierung spezialisieren (Ihr wisst, die
          Software, die daf&uuml;r sorgt, dass Eure Mikrowelle Euer Brot toastet ;)
          ). Ich programmiere seit meinem ersten Computer, einem C64, das war als ich
          13 Jahre alt war (wow... war ich jemals so jung?).</P>

          <P>Mein Hobby ist (war, da ich jetzt viel weniger Freizeit &uuml;brig
          habe), all diese seltsamen Programmiersprachen zu lernen. Drum kenne ich
          jetzt, auf verschiedenen Stufen, AMOS, Arexx, E, C, C++, Java, Revol, PHP,
          680x0 Assembler, Fujitsu 16LX Assembler und... mir fallen im Moment keine
          anderen ein. Oh, nicht gerade Programmiersprachen, aber ich kann auch HTML,
          XML und SQL.</P>

          <P><B>Wann hast Du begonne, mit dem Amiga zu arbeiten?</B><BR>
          Um 1992 (ja, ziemlich sp&auml;t,aber ich konnte mir vorher keinen Amiga
          leisten)</P>

          <P><B>Welches Amiga-Modell besitzt Du?</B><BR>
          Ich habe einen ziemlich modifizierten A1200 mit einer Blizzard 1240/40 und
          16MB RAM in einem riesigen schwarzen Desktop-Geh&auml;use untergebracht mit
          "Custom-Technogolie", um eine externe A1000-Tastatur oder eine A1200 in
          einem A3000-Tastaturgeh&auml;use. Ich besitze auch ein CTDV. Der
          A1200-Monitor ist aber vor ein paar Jahren gestorben, und ich ging dazu
          &uuml;ber, mit UAE auf meinem PC zu "arbeiten", wo ich endlich VGA
          Grafikmodi ausnutzen kann (damit ich nicht blind werde... ;= ).</P>

          <P><B>Welche Betriebssystemversion l&auml;uft auf Deinem Computer?</B><BR>
          Auf UAE die selbe wie auf meinem A1200: WB3.0 mit Kickstart 3.0. Konnte
          keinen guten Grund finden, auf neuere Versionen upzugraden.</P>

          <P><B>Was war der Grund nach langer Zeit zu versuchen, Blacks Editor zu
          entwickeln?</B><BR>
          Ich habe BlacksEditors Geburt gesehen. Tats&auml;chlich lebte Marco Negri,
          der urspr&uuml;ngliche Autor, ziemlich in meiner N&auml;he, und wir
          diskutierten viel dar&uuml;ber, was der Editor haben sollte und was nicht.
          Nat&uuml;rlich wurde die ganze Programmierarbeit von Marco geleistet.
          BlacksEditor ist einer der besten Editoren, die es gibt, mit so vielen
          Ausstattungsmerkmalen und so ressourcen- schonend. Schade, all die Arbeit
          wegzuwerfen. Und ich war wirklich neugierig darauf, Marcos
          Programmierk&uuml;nste zu sehen.</P>

          <P><B>War es schwer, an den Sourcecode zu kommen?</B><BR>
          Nein. Als Paul Schifferer, der den urspr&uuml;nglichen Sourcecode gekauft
          hatte, ank&uuml;ndigkte, dass er das Programm nicht mehr supporten
          w&uuml;rde, fragte ich ihn danach und er schickte sie mir schon bald. Das
          Problem war, die &Auml;nderungen zu verstehen, die er der
          urspr&uuml;nglichen Version hinzugef&uuml;gt hatte. Schliesslich ging ich
          dahin zur&uuml;ck, Marcos urspr&uuml;nglichen Code upzugraden (mein
          Fehler).</P>

          <P><B>Kannst Du etwas &Uuml;ber Blacks Editor erz&auml;hlen?</B><BR>
          Kurz gesagt ist es ein wirklich kleiner, schneller und m&auml;chtiger
          Texteditor. Tats&auml;chlich hat es &uuml;ber 150 ARexx-Befehle, die ihm
          gestatten, sogar von einem Batch-Skript zu arbeiten, und unterst&uuml;tzt
          alle Grundfunktionen, die ein Text- Editor haben kann. Es ist
          vollst&auml;ndig lokalisier- und konfigurierbar (einschliesslich Men&uuml;s
          und Tastaturk&uuml;rzel) und unterst&uuml;tzt Kickstart 2.0, kann aber
          3.0+-Funktionen nutzen. Es hat Makros, um SAS/C- und E-Compiler zu
          unterst&uuml;tzen, um HTML-Dokumente einfach zu editieren und arbeitet
          schlieslich mit dem BAH (BlacksEditor ARexx Handler), einem Tool, dass Dir
          erm&ouml;glicht, vollst&auml;ndig konfigurierbare Button-Leisten zu
          erstellen und ARexx-Befehle an BED zu senden.</P>

          <P><B>Was ist Deiner Meinung nach der Unterschied zwischen Blacks Editor
          und anderen Editoren f&uuml;r den Amiga?</B><BR>
          &Uuml;ber die oben genannten Vorteile hinaus ist BED nicht perfekt. Es hat
          immer noch ein paar kleine Bugs und unterst&uuml;tz nicht all die
          fortgeschrittenen Funktionen moderner Texteditoren (zuallererst
          Texteinf&auml;rbung). Es ist jedoch einfach zu benutzen und konfigurieren,
          und Du verlierst Deinen Verstand nicht in Panels von Panels von
          Konfigurationspanels, und es ben&ouml;tigt keinen fetten Amiga zum Laufen:
          512KB sind ok und 1 MB reicht, um selbst die komplexesten Deiner Texte zu
          editieren, und es unterst&uuml;tz OS 2.0+-Systeme.</P>

          <P><B>Wie lange hat die Enwicklung bislang gedauert?</B><BR>
          Es war eingestellt wegen ein paar wahnsinniger Ideen, die ich hatte (wie 
          zu versuchen, das Programm komplett in einer OOP-Sprache wie E neu zu
          schreiben, eine Sache, die mir teilweise gelungen ist). Ein paar Monate
          Arbeit waren aber n&ouml;tig, um den Code zu verstehen, und dann ein paar
          Wochen um anzufangen, ihn zu &auml;ndern. All das nat&uuml;rlich in meiner
          Freizeit.</P>

          <P><B>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</B><BR>
          Das h&auml;ngt alles davon ab, wie viele Leute Interesse an diesem Programm
          haben und auch ob ich eine minimale Chance sehen kann, es auf das neue
          OS4.0 portiert zu bekommen, wenn es rauskommt (und ich mir ein
          AmigaOne-Motherboard leisten kann). Soweit ich weiss gibt es bislang keine
          freie Entwicklungs- Dokumentation f&uuml;r das neue Betriebssystem. Die
          zuk&uuml;nftigen Schritte sollten jedoch sein:

          <UL>
          <LI>Fehlerbehebung (aber ich brauche wirklich eine MMU, die UAE im Moment
          nicht emulieren kann).</LI>

          <LI>Texteinf&auml;rbung</LI>

          <LI>Unterst&uuml;tzung mehrerer Projekte (im Unterschied zum
          Desktop-Gedanken)</LI>

          <LI>Spaltenmodus-Unterst&uuml;tzung</LI>

          <LI>Schnellnotiz-Unterst&uuml;tzung (wie ein Post-It auf dem Bildschirm, um
          einfach tempor&auml;re Notizen vornehmen zu k&ouml;nnen)</LI>

          <LI>Custom-Dateiformat, um andere Daten als nur ASCII-Zeichen zu erhalten.
          Siehe UDF, ein Dateiformat, dessen Spezifikationen im Aminet sind.</LI>

          <LI>Vielleicht eine XML-Export/Import- Funktion.</LI>

          <LI>Eingebaute Terminkalender-Verwaltung</LI>

          <LI>Andere kleinere Zus&auml;tze, wie ein Fenster, um einfach
          ge&ouml;ffnete Dokumente/Projekte zu verwalten</LI>

          <LI>Text falten</LI>
          </UL></P>
                    
          <P><B>W&uuml;rdest Du "HTML" wie GoldED unterst&uuml;tzen?</B><BR>
          Ich weiss nicht wirklich, wie GoldED HTML unterst&uuml;tzt. Ich habe es nur
          5 Minuten benutzt, bevor ich aufgegeben habe, da ich die Option, den Free
          Form Cursor abzuschalten, und w&auml;hrend ich danach suchte (und so mit
          all den Konfigurationspanels spielte) st&uuml;rzte das Programm zweimal ab.
          Vielleicht mein Fehler... aber, weisst Du, der erste Eindruck ist, was
          z&auml;hlt...</P>

          <P>Wenn Du aber einfach nur ein Panel willst, von dem aus Du HTML-Tags um
          Text einf&uuml;gen kannst, einschliesslich Markierungen, schau Dir einmal
          BAH (BlacksEditor ARexx Handler) an, der auch im Aminet steht und umsonst
          ist. Und wenn Du wie ich ein bisschen verr&uuml;ckt bist, versuch mal, HSC
          (HTML sucks completely) zu verwenden und es mit BAH zu
          unterst&uuml;tzen.</P>

          <P><B>Welche Software verwendest Du zum Entwickeln?</B><BR>
          BlacksEditor (ja, das Programm kann sich selbst entwickeln, das ist die
          Zukunft, darum mag ich embedded Software f&uuml;r Automatisierung), BAH,
          SAS/C- Compiler, KingCon Shell, alles unter UAE. Enforcer sollte
          aufgef&uuml;hrt sein, aber den kann ich unter UAE nicht mehr verwenden.</P>

          <P><B>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
          Du?</B><BR>
          F&uuml;r AmigaOS in all seinen Versionen seit 2.0.</P>

          <P><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
          unterst&uuml;tzen?</B><BR>
          Ich hoffe, in der Lage zu sein, OS4.0 und PPC-CPUs voll zu
          unterst&uuml;tzen.</P>

          <P><B>Was ist der Grund, dieses Betriebssystem zu
          unterst&uuml;tzen?</B><BR>
          Falls Du AmigaOS meinst, dann ist es weil es das verbreitetste Amiga-
          Betriebssystem ist ;) Falls Du meinst, warum entwickle ich nicht f&uuml;r
          andere Plattformen (Windows, Linux, MacOS), dann ist es, weil ich wirlich
          meine Zeit verschwenden will um zu lernen, wie man auf diesen Systemen ein
          Fenster &ouml;ffnet (hast Du jemals versucht, auf diesen Systemen ein
          Fenster zu &ouml;ffnen? Ich habe einen dieser Linux-Wizards gesehen, die
          Dir erm&ouml;glichen eine grafische Schnittstelle zu bauen, der 5 Minuten
          brauchte, um den Sourcecode zu erstellen und zu kompilieren, der ein
          einziges Fenster &ouml;ffnete!!!!!! Nein, es war kein 486 mit 4MB RAM! Und
          selbst wenn... mein Amiga ist nicht viel m&auml;chtiger).</P>

          <P><B>Welche Merkmale vermisst Du am AmigaOS f&uuml;r das
          Entwickeln?</B><BR>
          Sicherlich Speicherschutz, da ein Systemabsturz (der nicht so selten ist)
          bedeutet, alle Programme, die Du benutzt hattest, neu zu starten und zu
          rekonfigurieren... Dann die Tatsache, dass die
          Grafikkartenunterst&uuml;tzungen Patches am Betriebssystem sind anstatt
          darin integriert zu sein. Sie funktioneiren, aber sicherlich k&ouml;nnten
          sie besser funktionieren. Schliesslich eine ordentliche
          Druckerunterst&uuml;tzung!</P>

          <P><B>Welche Merkmale w&uuml;nscht Du Dir f&uuml;r das AmigaOS?</B><BR>
          Speicherschutz, um es f&uuml;r professionelle Anwendungen wie
          Netzwerkserver etwas interessant zu machen. Ein integrierter schneller
          TCP/IP- (v6 ?) Stack kann auch ein Vorteil sein, zusammen mit einer guten
          Java VM (damit wir hingehen k&ouml;nnen und all diese Anwendungen zu
          nutzen, die f&uuml;r AmigaOS nicht entwickelt worden sind).</P>

          <P><B>Verliserst Du nicht den Spass und das Interesse am Programmieren wenn
          Du die geringe Resonsnz siehst, die Du aus dem kleinen Amiga-Markt
          bekommst?</B><BR>
          Ja, Absolut. Resonanz ist sehr wichtig f&uuml;r die Weiterentwicklung des
          Programms. Ansonsten k&ouml;nnte ich es es nur als Programmier&uuml;bung
          ansehen und jede Menge Zeit aufwenden, nur solche Features einzubauen, die
          ich brauche oder programmieren will, die nutzlos sein k&ouml;nnten, aber
          interessant aus der Sicht eines Programmierers.</P>

          <P><B>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</B><BR>
          Tja, nein. Jedenfalls bis jetzt. F&uuml;r BAH, das Tool, das ich
          programmiert habe, seit Marco BAH entwicklet hat, das nun 5 Jahre als
          CARDWARE erh&auml;ltlich ist, habe ich nur eine Postkarte bekommen. Also
          habe ich beschlossen, es langsam angehen zu lassen. Und das Update der
          letzten (nicht aktuellsten) Version wurde zusammen mit dem ersten
          BlacksEditor-Upgrade ins Aminet gestellt. Wenn niemand es benutzt, braucht
          niemand neue Features und es hat seinen &uuml;bungszweck endg&uuml;ltig
          erf&uuml;llt.</P>

          <P><B>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
          gekauft?</B><BR>
          Ehrlich gesagt ist es lange her, dass ich Amiga-Software gekauft habe, da
          ich ihn meist nur zum Programmieren verwende und Programme verwende, die
          Freeware sind oder die ich auf irgendeiner Magazin-Coverdisk gefunden habe.
          Die letzte Software waren zwei AmyResource CDs, die ziemlich gut waren.</P>

          <P><B>Welche Software verwendest zu noch?</B><BR>
          Die, die mir gestattet, zu programmieren und Web-Seiten zu erstellen, also
          aussen den vorher aufgef&uuml;hrten verwende ich HSC, ImageStudio, PPaint
          und ein paar Tonnen dieser kleinen Patches, Hacks und Zusatzanwendungen,
          die im Aminet verf&uuml;gbar sind.</P>

          <P><B>Welche Hard-/Software hast Du vor zu kaufen?</B><BR>
          Den A1+OS4.0 wenn es erschwinglich ist und eine stabile und gut (von Amiga
          Inc.) unterst&uuml;tzte Plattform sein wird.</P>

          <P><B>Glaubst Du an ein Comeback von Amiga?</B><BR>
          Nicht wie es in den letzten Jahren war. Globalisierung und Standardisierung
          heutzutage erfordern, mit einem PC zu arbeiten oder irgendwie kompatibel zu
          Windows zu sein (selbst Mac &uuml;berlebt mit seiner eigenen Version von
          Microsoft Office). Ein Grossteil unserer besten Software ist auf den PC
          portiert worden (siehe Lightwave, Cinema4D, Scala, PageStream), aber das
          Wichtigste ist, dass viele der Leute, die auf dem Amiga mit dem
          Programmieren begonnen haben und seine Vorz&uuml;ge kennen, nun auf der
          anderen Seite des Flusses sind, auch Spieleprogrammierer. Und wir haben
          unseren Hardware-Vorteil verloren, indem wir Standardtechnologie von der
          Stange verwenden. Also haben wir wahrscheinlich nicht die Chance, die
          Killeranwendung zu kreieren, die das n&ouml;tige (und wahrscheinlich
          verdiente) Interesse an der neuen Version der Plattform bringt. Ich denke,
          dass, falls Amiga Inc. einen guten Job macht (wie sie es bisher gemacht
          haben), sie nur in einem kleinen Nischenmarkt &Uuml;berleben werden, wie es
          MacOS all die Jahre gemacht hat. PDAs und Embedded Devices scheinen ein
          guter Markt zu sein (zumindest f&uuml;r St&uuml;ckzahlen). Solange Bill
          Gates die Welt nicht &uuml;berzeugt, dass er selbst der Sch&ouml;pfer auch
          dieser Systeme war...</P>

          <P><B>Deine letzten Worte an die Leser?</B><BR>
          Haltet die Augen offen. Denkt daran, dass nicht immer das meistgenutzte
          auch die beste Wahl ist. Probiert weiter Alternativen zum Mainstream aus,
          und verwendet zum Bewerten stets Euer Hirn.</P>

          <P>-- &copy; Amiga Arena 05/2002 --<BR>
          (aus dem Englischen von Christian Busse)</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

