<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Interview Nr 4</TITLE>
  </HEAD>

  <BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <A name="top"></A> 

    <TABLE width="100%" border="0" cellpadding="8" summary="Interview">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>
                <TD><B>Mark Reynolds</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>
                <TD>Roketz!</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>
                <TD>http://www.mreyn.currantbun.com</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>
                <TD>mreyn@currantbun.com</TD>
              </TR>
            </TABLE>
            <BR>
            <BR>
          </CENTER>

        <P><B>Bitte stelle Dich den Lesern vor!</B><BR>

        Hallo, alle zusammen.</P>

        <P><B>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</B><BR>

        Also, ich hatte meinen ersten A500 als ich etwa 7 war, habe aber bis vor
        ungef&auml;hr zwei Jahren nicht mit ernsthafter Programmierung begonnen.
        Das meiste davon war f&uuml;r meinen Abschlu&szlig; uns so weiter.</P>

        <P><B>Welches Amiga-Modell besitzt Du?</B><BR>

        A4000/060, A4000/030 x2, A1200/020, A600. Der 1200 und 600 sind wirklich
        nur f&uuml;r Spiele.</P>

        <P><B>Welche Betriebssystem-Version l&auml;uft auf Deinem Computer?</B><BR>

        Auf dem A4000/060 l&auml;uft OS3.5 - ich habe schon seit Ewigkeiten vor,
        auf 3.9 aufzur&uuml;sten.</P>

        <P><B>"Roketz" ist jetzt frei erh&auml;ltlich und ich denke, es ist eine
        gro&szlig;e &Uuml;berraschung, wie hast Du das m&ouml;glich
        gemacht?</B><BR>

        Tja, ich habe mich schon eine ganze Weile gefragt, ob ich jemanden
        ausfindig machen kann, und sie zu &uuml;berreden eine Vollversion im Aminet
        zu ver&ouml;ffentlichen. Das war vor etwa einem Jahr, und daraus ist nichts
        geworden. Dann, vor etwa einem Monat, sprach ich mit einem meiner Freunde
        (Paul) &uuml;ber unsere Lieblingsspiele. Damals beschlo&szlig; ich, es
        erneut zu versuchen. Nach ein paar Wochen fand ich Nicholas Sallin, der das
        Mitglied der Taskers war, das Roketz entwickeln sollte, bis MorphOS
        dazwischen kam. Zusammen waren wir in der Lage, Ott M. Aaloe zu finden,
        einen der urspr&uuml;nglichen Autoren. Er gab uns netterweise die
        Erlaubnis, die Entwicklung fortzuf&uuml;hren. Ich dachte, dass es lohnend
        w&auml;re, die Blitz-Version zu ver&ouml;ffentlichen, so dass jeder das
        ganze Ding sehen k&ouml;nnte.</P>

        <P><B>Kannst Du uns erz&auml;hlen, was "Roketz" ist?</B><BR>

        Roketz ist ein Spiel wie Gravity Force oder Turboraketti, aber nach meiner
        bescheidenen Meinung ist es das beste. :)</P>

        <P><B>Wei&szlig;t Du, warum es die urspr&uuml;nglichen Entwickler
        einstellten?</B><BR>

        Nicht wirklich. Was ich allerdings wei&szlig;, ist, dass es eine Zeit gab,
        in der The Farm Teil von Bluemoon wurde, und eine PC-Version von Roketz
        schrieben. Das &uuml;bernahmen Taskers die Entwicklung, aber nach einem
        Jahr Forschung, ging der Typ, der es machen sollte (Nicholas) dazu
        &uuml;ber, MorphOS zu machen. Das war, als die Entwicklung wirklich
        stoppte, so etwa in '98-99.</P>

        <P><B>Was hat Dich auf die Idee gebracht, "Roketz" weiter zu
        entwickeln?</B><BR>

        Ich dachte einfach, dass es ein tolles Spiel sei, und dass jeder in seinen
        Genu&szlig; kommen k&ouml;nnen sollte. Darum habe ich es erst mal praktisch
        unver&auml;ndert ver&ouml;ffentlicht. Ich wollte nicht an den Punkt kommen,
        wo die C-Version halbwegs durch ist, und dann aufh&ouml;ren und gar nichts
        ver&ouml;ffentlichen.</P>

        <P><B>Was ist neu in diesem freien Release?</B><BR>

        Sehr wenig - ich wollte im Grunde die ganze Sache so ver&ouml;ffentlichen
        wie sie war als The FARM die Entwicklung einstellten. Ich habe am Text ein
        bi&szlig;chen herumge&auml;ndert um die Rechtschreibfehler zu entfernen und
        an einzelnen Stellen &Auml;nderungen an der Grammatik vorzunehmen. Es gab
        auf meiner Maschine beim Laden eines der Levels auch einen kleinen Bug bei
        der Musik. Diesen konnte ich entfernen, habe dabei aber einen anderen
        eingebaut - manchmal haben die Men&uuml;s keine Musik. :( Das ist aber
        immer noch etwas weniger nervend als wenn die Musik mit doppelter
        Geschwindigkeit l&auml;uft.</P>

        <P><B>Wie lange hat die Entwicklung bislang gebraucht?</B><BR>

        Ungef&auml;hr einen Monat, haupts&auml;chlich weil
        Universit&auml;ts-Studienarbeit dazwischen kamen. Ansonsten w&auml;re 1.39
        etwa 4 Tage, nachdem ich den Sourcecode bekam, upgeloadet gewesen.</P>

        <P><B>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</B><BR>

        M&ouml;glicherweise eine komplett in C umgeschriebene Version, zusammen mit
        einem Versuch in RTG und etwas Netzwerk-Spiel. Es h&auml;ngt davon ab, ob
        wir den BlitzSourcecode auseinandernehmen und vollst&auml;ndig verstehen
        k&ouml;nnen werden. Daf&uuml;r m&uuml;ssen wir auch ein Team zusammen
        bekommen.</P>

        <P><B>Welche Art von Spielen magst Du uns spielst sie auf dem
        Amiga?</B><BR>

        Tja, da ist dieses eine Spiel namens Roketz... ;)<BR>

        Ich mag irgendwie Spiel mit offenem Ende, wie Die Siedler und Frontier. Ich
        spiele auch UFO:Enemy Unknown und Hired Guns. Das sind alles tolle Spiele,
        zu denen man immer und immer wieder zur&uuml;ckkommen kann ohne dass sie
        langweilig werden. Die meisten Spiele f&uuml;r mehr als einen Spieler sind
        gut, weil es da ein menschliches Element gibt, das man nicht vorhersagen
        kann.</P>

        <P><B>Welche Software verwendest Du zum Entwickeln?</B><BR>

        Also, ATM Blitz Basic 2. Ich im Moment dabei, einen guten C-Compiler
        f&uuml;r mich zu finden.</P>

        <P><B>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
        Du?</B><BR>

        Wir haben noch nicht viel entschieden. Es ist noch die Anfangszeit.
        Momentan nur AmigaOS, weil der Blitz-Sourcecode daf&uuml;r ist. :)</P>

        <P><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
        unterst&uuml;tzen?</B><BR>

        Tja, wahrscheinlich AMigaOS. Wir haben Angebote f&uuml;r MorphOS gehabt,
        und ich w&uuml;rde gern AmigaDE machen, aber es ist noch ganz am Anfang -
        es sind keine ernsthaften Entscheidungen gef&auml;llt worden.</P>

        <P><B>Was ist der Grund daf&uuml;r, dieses Betriebssystem zu
        unterst&uuml;tzen?</B><BR>

        Also, ich denke, dass AmigaOS unterst&uuml;tz w&uuml;rde, weil es offiziell
        ist, DE w&auml;re auch wirklich cool, obwohl ich keine Ahnung habe, wie
        sich Roketz ohne Tastatur oder Joystick auf einem PDA spielen w&uuml;rde,
        und MophOS w&auml;re hoffentlich ein Fall davon, den Sourcecode an jemand
        anderen weiter zu geben.</P>

        <P><B>Welche Merkmale vermi&szlig;t Du am AmigaOS f&uuml;r das
        Entwickeln?</B><BR> Es w&auml;re nett gewesen, alle Werkzeuge zum
        Entwickeln f&uuml;r das Betriebssystem auf der Installations-CD zu sehen,
        aber ich verwende normalerweise keine gro&szlig;en Entwicklungsumgebungen -
        auf meinem PC verwende ich den Editor f&uuml;r C- Code.</P>

        <P><B>Welche Merkmale w&uuml;nscht Du Dir f&uuml;r das AmigaOS?</B><BR>

        Nicht ganz sicher. Ich denke, es ist ziemlich gut, wie es jetzt ist. Eine
        wirklich gute, offizielle Java-Implementierung w&auml;re nett, aber die
        kommt sowieso mit DE.</P>

        <P><B>Verlierst DU nicht den Spa&szlig; und das INteresse am Programmieren,
        wenn Du die geringe Resonanz siehst, die Du aus dem kleinen AMiga-Markt
        erh&auml;ltst?</B><BR>

        Also, in den ersten 2 Tagen, nachdem Roketz 1.39 ins AMInet gestellt wurde,
        habe ich 10 E-mails zur&uuml;ckbekommen. H&auml;tte ich eins zur&uuml;ck
        gekriegt, w&auml;re es das wert gewesen. Vielleicht werde ich aber etwas
        anders f&uuml;hlen, nachdem ich Berge von Code geschrieben habe. :)</P>

        <P><B>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</B><BR>

        Ja. Ich beschlo&szlig;, dass wenn ich Roketz kriegte, ich entwickeln
        w&uuml;rde, weil ich etwas mit dem Sourcecode machen wollte, dass mir
        Spa&szlig; macht. Nat&uuml;rlich k&ouml;nnte eine E-mail an mich helfen,
        dass es schneller gemacht wird. :)</P>

        <P><B>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
        gekauft?</B><BR>

        Wahrscheinlich IBrowse. Es ist traurigerweise eine ganze Weile her, dass
        ich irgendwelche Software gekauft habe. Der b&ouml;se PC und die Uni halten
        mich zu sehr auf Trab.</P>

        <P><B>Welche Software verwendest Du noch?</B><BR>

        Die meisten Sachen, die ich gekauft habe, wurden gekauft, weil ich
        wei&szlig;, dass ich eine Menge ernsthaften Nutzen davon haben werde. also
        so ziemlich alle Werkzeuge und die zuvor genannten Spiele, wenn die
        Hausarbeits-Fristen nicht zu nah sind.</P>

        <P><B>Welche Hard-/Software hast Du vor zu kaufen?</B><BR>

        Tja, ich habe gerade 2 40GB Festplatten gekauft. Ich &uuml;berlege auch,
        einen Laptop f&uuml;r die Uni zu besorgen - es ist einfacher, auf Deine
        eigene Festplatte herunter zu laden, als alle 5 Minuten auf CD zu brennen.
        Auf der Software-Seite OS3.9 und einen Amiga C-Compiler.</P>

        <P><B>Glaubst Du an ein Comback von Amiga?</B><BR>

        Ich w&uuml;rde es gern sehen. Ich glaube, dass die Ideen gut sind und die
        Leute dahinter hart arbeiten. Es ist eine g&auml;nzlich andere Sache,
        daf&uuml;r korrekt Reklame zu machen - und das ist, womit Commodore
        wirklich Probleme hatte. Als sie es taten, funktionierte es (wer erinnert
        sich an die CD32-Anzeige vor dem Sega-Hauptsitz - "Um so gut zu sein wird
        Sega Ewigkeiten brauchen?"), aber es war nicht hinreichend bewu&szlig;t
        gemacht worden, was die Maschine wirklich konnte. Commodore verlie&szlig;
        sich zu sehr darauf, dass die User es allen erz&auml;hlten.</P>

        <P><B>Deine letzten Worte an die Leser?</B><BR>

        Ziemlich viele Leute haben angefragt, ob ich Roketz ver&ouml;ffentlichen
        k&ouml;nnte, damit sie alte Maschinen vom Dachboden auskramen und es von
        Floppy spielen k&ouml;nnten.</P>

        <P>http://www.mreyn.currantbun.com hat nun DMS-Images f&uuml;r diesen
        Zweck. Sie werden wahrscehinlich nie ins Aminet hochgeladen werden, weil es
        viel schwerer ist, ein DMS-Archiv auf Viren zu &uuml;berpr&uuml;fen, und
        deshalb nimmt Aminet sie eigentlich nicht an.</P>

        <P>-- &copy; Amiga Arena 05/2002 --<BR>

        (aus dem Englischen von Christian Busse)</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

