<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
  <TITLE>Interview Nr 2</TITLE>
</HEAD>

<BODY background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">

  <TABLE width="100%" border="0" cellpadding="8" summary= "Interview">
    <TR>
      <TD>
        <CENTER>
          <P><FONT color="#000080" size="7"><B>Amiga Arena
          Interview</B></FONT></P>

          <TABLE width="60%" cellpadding="0" cellspacing="0"
          summary="">
            <TR>
              <TD valign="top">Entwickler:</TD>

              <TD><B>jah</B> </TD>
            </TR>

            <TR>
              <TD valign="top">Software:</TD>

              <TD>AmiSAT</TD>
            </TR>

            <TR>
              <TD valign="top">Homepage:</TD>

              <TD>http://jahjah.free.fr</TD>
            </TR>

            <TR>
              <TD valign="top">Email:</TD>

              <TD>jahjah@free.fr</TD>
            </TR>
          </TABLE>
          <BR>
          <BR>
        </CENTER>

        <P><B>Bitte stelle Dich den Lesern vor!</B><BR> 
        Ich bin 24 Jahre alt, ich lebe in Bordeaux (Frankreich), das erste was ich
        mache, wenn ich aufwache, ist, den Miggy anzuschalten. Mein letzter Job
        war, f&uuml;r eine franz&ouml;sische Firma dynamische Teile von Web-Sites
        mit PHP und MySql zu erstellen, jetzt bin ich arbeitslos.</P>

        <P><B>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</B><BR> 
        Ich bekam meinen ersten Miggy (einen A500) 1988, ich bin in sehr jungen
        Jahren Amiga-s&uuml;chtig geworden. Ich w&uuml;rde sagen, dass ich wirklich
        angefangen habe zu programmieren, als ich 1999 C in der Schule lernte.</P>

        <P><B>Welches Amiga-Modell besitzt Du?</B><BR> Einen A4000 Desktop im
        Towergegh&auml;use mit einer CyberStorm 060/50 604/233.</P>

        <P><B>Welche Betriebssystem-Version l&auml;uft auf Deinem Computer?</B><BR>
        3.5</P>

        <P><B>Was war der Grund, OpenAG auf das AmigaOS zu portieren?</B><BR>
        Napster starb, auf der Arbeit entdeckte ich Audiogalaxy und fand es trotz
        der Tatsache, dasses nur auf PCs und PowerMac lief, sehr gut. Ich suchte
        nach einem Mac 68K Audiogalaxy-Satellite als ich OpenAG entdeckte und
        beschloss, es auf den Miggy zu portieren.</P>

        <P><B>Kannst Du uns sagen, worum es bei AmigSAT geht?</B><BR>
        AmiSAT ist die Amiga-Portierung von OpenAG, welches ein Open Source
        Audiogalaxy-Client ist.</P>

        <P><B>Ist es eine offizielle Portierung?</B><BR> 
        Weiss nicht, "offiziell" ist heutzutage ein verwirrendes Wort (siehe
        Morphos). In Bezug auf OpenAG: Ich stand in Kontakt mit Eric Seidel (dem
        Autor), als die ersten Versionen im Web erschienen, er gab mir
        Ratschl&auml;ge f&uuml;r die Portierung. Die Amiga-spezifischen
        &Auml;nderungen wuchsen sehr schnell, und ich beschloss, das Projekt in
        AmiSAT umzubenennen. Also weiss ich nicht, ob alles sehr offiziell ist.</P>

        <P>In Bezug auf den originalen Audiogalaxy-Satellite: Weiss auch nicht...
        Das Protokoll kann &Uuml;berall im Web gefunden werden, und es gibt heute
        Clients f&uuml;r viele Plattformen. Die Leute von der Audiogalaxy-Truppe
        antworten auf keine E-Mails und sie beschweren sich nicht &uuml;ber all die
        Portierungen. Ich nehme an, dass es f&uuml;r sie interessant ist, weil
        dadurch mehr Leute ihren Dienst nutzen und Gold-Accounts anmelden.</P>

        <P><B>Wie lange hat die Entwicklung bislang gedauert?</B><BR>
        Weiss nicht... Ich experimentiere mit so vielen Sachen gleichzeitig mit
        meinem Miggy, dass ich nicht sagen kann, wieviel Zeit ich tats&auml;chlich
        f&uuml;r die Portierung von AmiSAT verwendet habe...</P>

        <P><B>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</B><BR>
        - 100% Amiga-nativ (keine ixemul mehr)<BR>
        - die selbe Evolution wie OpenAG, aber das wird schwer werden, weil die
          Unterschiede zwischen AmiSAT und OpenAG t&auml;glich wachsen<BR>
        - alles interessante, was von Benutzern angefordert wird</P>

        <P><B>Welche Software verwendest Du zum Entwickeln?</B><BR>
        GCC und CED</P>

        <P><B>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?</B><BR>
        AmigaOS,<BR>
        niemals f&uuml;r DE, weil das ein reines PC-Produkt ist :(<BR>
        MophOS sobals ich einen Pegasos und eine Vollversion von MorphOS kriege,
        aber AmiSAT l&auml;uft jetzt schon darauf, weil MorphOS ein PPC AmigaOS
        ist, auf dem auch 68K-Anwendungen laufen.</P>

        <P><B>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?</B><BR>
        MorphOS nat&uuml;rlich!</P>

        <P><B>Was ist der Grund daf&uuml;r, dieses OS zu unterst&uuml;tzen?</B><BR>
        - es existiert ;) !<BR>
        - ich habe es auf meinem Miggy laufen lassen und war sehr beeindruckt<BR>
        - es ist ein sehr seri&ouml;ses Projekt mit jetzt schon einer Menge Entwickler<BR>
        - es entspricht exakt meinen jahrelangen Tr&auml;umen von einem PPC-AmigaOS</P>

        <P><B>Welche Merkmale vermisst Du beim Amiga f&uuml;r das Entwickeln?</B>
        <BR>
        Keine: Es ist nur der Entwickler (ich), der begrenztes Wisses und Zeit
        hat. </P>

        <P><B>Welche Merkmale w&uuml;nscht Du Dir f&uuml;r das AmigaOS?</B><BR>
        Weiss wirklich nicht, ich denke AmigaOS ist das perfekteste OS von allen.
        Wenn ich mir etwas w&uuml;nschen k&ouml;nnte, w&uuml;rde ich mir eine Soft-
        &amp; Hardware zur Verwaltung eines hydroponischen Systems w&uuml;nschen
        ;)</P>

        <P><B>Verlierst Du nicht den Spass und das Interesse am Programmieren,
        wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
        erh&auml;ltst?</B><BR>
        Ich bekomme Resonanz, es wird nie genug sein, aber es ist genug, um mit
        meiner Arbeit gl&uuml;cklich zu sein.<BR>
        Ich programmiere nicht f&uuml;r Geld oder Ruhm, ich tu
        es f&uuml;r den Miggy: Lange Zeit dachte ich, wenn mein
        4K den Geist aufgibt und ich keinen anderen finden
        k&ouml;nnte, w&uuml;rde ich &Uuml;berhaupt aufh&ouml;ren,
        Computer zu verwenden... So lange ich einen vor mir habe,
        ist alles ok :)</P>

        <P><B>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</B><BR>
        Frogger &amp; SoftCinema, MakeCD</P>

        <P><B>Welche Software verwendest Du noch?</B><BR>
        GCC, TVPaint, Inagine, PPaint... alles... ich verbringe soviel Zeit wie ich
        kann vor meinem Miggy, also...</P>

        <P><B>Welche Hard-/Software hast Du vor zu kaufen?</B><BR>
        Pegasos &amp; MorphOS &amp; Dual G4-Modul<BR>
        Imagine ACUP wenn sie eine Version f&uuml;r MophOS machen<BR>
        Ein PS/2-Mouseadapter, wenn meine Wizard-Mouse den Geist aufgibt<BR>
        Vielleicht eine Highway USB-Karte</P>

        <P><B>Glaubst Du an ein Comeback von Amiga?</B><BR>

        F&uuml;r mich ist Amiga immer noch hier und immer noch das beste. Ich
        hoffe, der Amiga-Markt wird wachsen, aber ich f&uuml;rchte, er wird es
        wegen Amiga, Inc. nicht tun.</P>

        <P><B>Deine letzten Worte an die Leser?</B><BR>
        Bitte vergesst nicht, Eric Seidel f&uuml;r OpenAG zu danken<BR>
        AMIGA RULES!</P>

        <P>-- &copy; Amiga Arena 05/2002 --<BR>
        (aus dem Englischen von Christian Busse)</P>
      </TD>
    </TR>
  </TABLE>
 <BR>
</BODY>
</HTML>

