<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Wolf hat wieder etwas zu sagen</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink=
"#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Konjunktur</B></FONT><BR>
<FONT color="#000080" size="5"><B>Wie arm ist Deutschland?</B></FONT> </P>

<P>(Anmerkungen zum ersten Armuts- und Reichtumsbericht der Bundesregierung) </P>

<P>Seit fast zwanzig Jahren haben Gewerkschaften und
Wohlfahrtsverb&auml;nde einen nationalen Armutsbericht gefordert. Diese
Forderung verhallte lange ungeh&ouml;rt und wurde erst von der
rot-gr&uuml;nen Regierung in Angriff genommen. Ende April wurde nun der
erste Armuts- und Reichtumsbericht f&uuml;r Deutschland vorgelegt. Seine
Ergebnisse wurden von denen, die ihn &uuml;ber viele Jahre gefordert hatten
in der &Ouml;ffentlichkeit als Beleg ihrer Vermutung gewertet, dass in
Deutschland die Armut kontinuierlich zunehme. Sogleich wurde die Forderung
nach einer Ausweitung sozialpolitischer Ma&szlig;nahmen erhoben. </P>

<P>Der Bericht kann allerdings seinem Anspruch aus zwei Gr&uuml;nden nicht
gerecht werden. Trotz der Vielzahl an statistischen Daten, die in einem
umfangreichen Materialband dokumentiert sind, reicht das Material nicht
aus, um zu qualifizierten Aussagen &uuml;ber Ursachen und Umfang von Armut
in Deutschland zu gelangen, weil die entscheidenden Daten fehlen, die die
Entwicklung einkommensschwacher Haushalte im Zeitablauf dokumentieren. Fast
unm&ouml;glich ist es gar, verl&auml;ssliche Aussagen &uuml;ber die
nichtmonet&auml;ren Faktoren, wie Zugang zu Bildung und Wohnsituation zu
machen. </P>

<P>Der zweite und eigentliche Grund, warum der Versuch eines Armutsberichts
scheitern muss, ist der Umgang mit der Frage: "Wer ist in Deutschland
eigentlich arm?" Der Brockhaus definiert Armut als eine Lebenslage, in der
es Einzelnen oder ganzen Bev&ouml;lkerungsgruppen nicht m&ouml;glich ist,
sich ihren Lebensbedarf (Existenzminimum) aus eigenen Kr&auml;ften zu
beschaffen. Die Bestimmung des Existenzminimums ist eine normative Aufgabe.
In der Armutsdiskussionen, die in den Industriel&auml;ndern gef&uuml;hrt
werden, wird dieses Problem in der Regel nicht durch die Festlegung eines
festen Schwellenwertes gel&ouml;st, sondern durch ein Ma&szlig; f&uuml;r
relative Armut, d.h. es wird ein Schwellenwert in Relation zum Durchschnitt
der nationalen Einkommensverteilung definiert. Letztlich mussten jedoch die
Gutachter vor den Schwierigkeiten, diese Schwelle zu definieren,
kapitulieren. Im Armutsbericht werden folglich gleich vier Schwellenwerte
definiert, mit dem Ergebnis, dass in Deutschland zwischen 5,7% und 19,6%
der Haushalte als "arm" eingestuft werden k&ouml;nnen. </P>

<P>Der relative Armutsbegriff verhindert zudem, dass sich an diesem Zustand
jemals Wesentliches &auml;ndern k&ouml;nnte. Denn solange Einkommen
ungleich verteilt sind, kann nach dieser Definition Armut selbst dann nicht
beseitigt werden, wenn sich das Einkommensniveau verdoppelt. Die Armut
bleibt erhalten, allerdings sind die Armen dann auf einem h&ouml;heren
Niveau &auml;rmer. Dies verdeutlicht nachdr&uuml;cklich, dass mit Hilfe des
relativen Armutsbegriffs allenfalls Aussagen &uuml;ber den Abstand zwischen
den oberen und unteren Einkommensgruppen getroffen werden k&ouml;nnen, also
&uuml;ber die Einkommensungleichheit in Deutschland. Diese ist aber nicht
mit Armut gleichzusetzen. </P>

<P>Am st&auml;rksten fand in der &Ouml;ffentlichkeit die Aussage des
Armutsberichts Beachtung, dass die Einkommensungleichheit in Deutschland
seit den fr&uuml;hen siebziger Jahren zugenommen habe. Gleichzeitig wurde
jedoch verdr&auml;ngt, dass diese Zunahme &uuml;berwiegend zu Beginn des
Untersuchungszeitraums in den siebziger Jahren stattgefunden hat, einer
Periode, in der es unter der sozial-liberalen Koalition zu einer Ausweitung
der Umverteilungspolitik kam. </P>

<P>Bei der Suche nach den Ursachen f&uuml;r die gewachsene
Einkommensungleichheit kommt der Bericht jedoch zu einer eindeutigen
Aussage. Arbeitslosigkeit ist bei weitem die wichtigste Ursache f&uuml;r
Einkommensarmut. Dies ist unmittelbar einsichtig, stieg doch die
Arbeitslosenquote in Deutschland von 1973 bis 1998 von 1,5% auf 10,5%.
Allerdings ist im gleichen Zeitraum der Anteil der Haushalte mit niedrigem
Einkommen wesentlich geringer, n&auml;mlich nur um 3 bis 4 Prozentpunkte
gestiegen. Dies lag wohl vor allem daran, dass auch die Bezieher niedriger
Einkommen erhebliche Einkommenszuw&auml;chse verbuchen konnten. So sind die
unteren 10% der Nettoeinkommen seit 1973 mit 20% fast gleichstark wie der
Durchschnitt aller Einkommen mit 20,5% gestiegen. Gem&auml;&szlig; der
Definition sind diese Einkommensbezieher jedoch arm geblieben. Ganz
offensichtlich haben Einkommenstransfers und steuerliche Verbesserungen
f&uuml;r Familien in den unteren Einkommensgruppen zu dieser Entwicklung
beigetragen. </P>

<P>Es w&auml;re jedoch voreilig, dies als einen Erfolg der Sozialpolitik in
Deutschland zu erachten. Eine Gesamtbeurteilung der Sozialpolitik bei der
Bek&auml;mpfung der Einkommensungleichheit, setzt n&auml;mlich auch voraus,
dass eine Aussage zu m&ouml;glichen Reibungsverlusten der
Umverteilungspolitik gemacht werden kann. Aber bislang existieren keine
Daten, mit deren Hilfe analysiert werden k&ouml;nnte, wieviel gerade im
mittleren Einkommensbereich lediglich von "der linken Tasche in die rechte
Tasche" umverteilt wird. </P>

<P>Des Weiteren finden sich in dem Bericht keine Angaben dar&uuml;ber, in
welchem Umfang Wachstums- und Besch&auml;ftigungschancen in den vergangenen
Jahrzehnten durch eine zu hohe Steuer- und Abgabenlast vernichtet worden
sind. Wachstumspolitik und nicht Sozialpolitik ist nach wie vor das beste
Mittel zur Bek&auml;mpfung der Armut, zumindest solange, wie
Arbeitslosigkeit als ihre Hauptursache gelten kann. </P>

<P>Allerdings l&auml;sst sich in Deutschland der Eindruck nicht vermeiden,
dass es den meisten Armutsbek&auml;mpfern vor allem darum geht, den Reichen
etwas wegzunehmen, und nicht darum, dass die Armen mehr bekommen. F.A. v.
Hayek hat die Folgen einer so gearteten Politik in einem Interview in der
Neuen Z&uuml;rcher Zeitung 1981 wie folgt skizziert: "Wenn man erst mal
damit anf&auml;ngt, die zehn Prozent der Bev&ouml;lkerung mit dem jeweils
niedrigsten Einkommen 'die Armen' zu nennen, dann wird es immer Arme geben,
weil einige immer diese zehn Prozent sein m&uuml;ssen. Jede Handlungsweise
der Regierung aber, die sich dauerhaft als direktes Ziel die Wohlfahrt der
Armen vornimmt, mu&szlig; letztlich zur Zerst&ouml;rung des Marktes
f&uuml;hren und damit zur Zerst&ouml;rung des Wachstumsdes
Gesamteinkommens, von welchem die Hoffnu ngen der Armen wirklich
abh&auml;ngen." F.A. v. Hayek hat damit auf einen wichtigen Punkt
hingewiesen. N&auml;mlich die Tatsache, dass ungleiche Einkommens- und
Verm&ouml;gensverteilung, insbesondere aber die Chance auf h&ouml;here
Einkommen in der Zukunft eine wichtige Triebfeder der auf Wettbewerb
ausgerichteten Marktwirtschaft ist. Die Spreizung der Einkommen ist demnach
eine wichtige Vorbedingung f&uuml;r das Wirtschaftswachstum in
marktwirtschaftlichen Systemen. </P>

<P>Eine Wirtschaftspolitik die durch niedrige Anspr&uuml;che des Staates an
das Sozialprodukt und die Schaffung flexibler G&uuml;ter- und
Faktorm&auml;rkte (insbesondere eines flexiblen Arbeitsmarktes) Raum
f&uuml;r unternehmerische Bet&auml;tigung und damit Besch&auml;ftigungs-
und Wirtschaftswachstum schafft, ist unter diesen Umst&auml;nden die beste
Form der Sozialpolitik. Sie wird aber nicht verhindern k&ouml;nnen, dass es
immer 10% Haushalte gibt die -relativ gesehen - die &Auml;rmsten sind. </P>

<P>Falsch w&auml;re es auch die Armutsdiskussion in statischer
Betrachtungsweise zu f&uuml;hren. Einkommen ver&auml;ndern sich mit der
Gr&ouml;&szlig;e des Haushaltes und dem Alter der Erwerbst&auml;tigen. Die
relative Einkommensh&ouml;he ist deshalb auch eine demographisches
Ph&auml;nomen. Junge Erwerbst&auml;tige und Rentner finden sich, das weist
der Bericht auch aus, relativ h&auml;ufiger in den unteren
Einkommensgruppen. Entscheidend ist deshalb die Frage der
Einkommensmobilit&auml;t. Der Armutsbericht liefert auch hier einige
Fakten, die die Bedeutung einer erfolgreichen Besch&auml;ftigungs- und
Wachstumspolitik unterstreichen. So ist im Bereich der Niedrigeinkommen,
die Wahrscheinlichkeit durch einen Einkommensanstieg diesen Bereich zu
verlassen, deutlich h&ouml;her, als die Wahrscheinlichkeit einen
Einkommensverlust zu erzielen. Der gr&ouml;&szlig;te Motor zum Verlassen
des Niedrigeinkommensbereichs ist dabei die Aufnahme einer
Erwerbst&auml;tigkeit. </P>

<P>Wie die Einkommen, so sind auch die Privatverm&ouml;gensbest&auml;nde,
die Verm&ouml;genseinkommen und die Verm&ouml;gensbildung
ungleichm&auml;&szlig;ig verteilt. So verf&uuml;gten 1998 in
Westdeutschland die verm&ouml;gendsten 10% der Haushalte &uuml;ber 42% des
Privatverm&ouml;gens, w&auml;hrend den unteren 50% nur 4,5% geh&ouml;rten.
Seit Beginn der sechziger Jahre ist die Verm&ouml;gensverteilung in
Deutschland aber gleichm&auml;&szlig;iger geworden. Dies ist in erster
Linie auf den im Zeitablauf erheblich gewachsenen Immobilienbesitz der
privaten Haushalte zur&uuml;ckzuf&uuml;hren. </P>

<P>Wirtschaftspolitische Ma&szlig;nahmen, die auf eine weitere Verringerung
der Verm&ouml;gensungleichheit zielen, sollten auf die Quellen der
Verm&ouml;gensbildung gerichtet sein, Neben Wertzuw&auml;chsen und
Erbschaften ist dies in erster Linie das Sparen. Die Wirtschaftspolitik
kann sowohl die Sparneigung als auch die Sparf&auml;higkeit beeinflussen.
Letzteres vor allem durch Ma&szlig;nahmen, die die realen Nettoeinkommen
erh&ouml;hen, ersteres durch die St&auml;rkung der Sparanreize. Die
Entscheidung die gesetzliche Altersvorsorge durch eine kapitalgedeckte
private Altersvorsorge zu erg&auml;nzen, wird in diese Richtung wirken und
in Zukunft auch zu einer Verringerung der Verm&ouml;gensungleichheit
beitragen. </P>

<P><FONT size="+1"><B>Entwicklung des Bruttoinlandsprodukts in
Deutschland</B></FONT><BR>

Die gesamtwirtschaftliche Leistung in Deutschland ist im ersten Quartal
2002 gegen&uuml;ber dem Vorquartal saisonbereinigt um 0,2 % gestiegen.
Damit konnte das deutsche Bruttoinlandsprodukt erstmals seit einem halben
Jahr wieder wachsen. Im Vergleich zu den ersten drei Monaten des
vergangenen Jahres ist die gesamtwirtschaftliche Leistung im ersten
Vierteljahr 2002 jedoch um 1,2 % gesunken. Allerdings gab es im ersten
Quartal dieses Jahres wegen des fr&uuml;hen Osterfestes zwei Arbeitstage
weniger als in der selben Vorjahresperiode. Rechnet man diesen
Kalendereffekt heraus, dann reduziert sich der R&uuml;ckgang von 1,2 % auf
ein Minus von 0,2 %. </P>

<P><FONT size="+1"><B>Witschaftswachstum in Deutschland</B></FONT><BR>

Die j&uuml;ngsten Zahlen zur Entwicklung des deutschen
Bruttoinlandsprodukts best&auml;tigen, dass die konjunkturelle Talsohle
Ende des letzten Jahres durchschritten wurde. Die im ersten Quartal 2002
eingesetzte Erholung ist insgesamt allerdings noch recht schwach und beruht
ausschlie&szlig;lich auf einer kr&auml;ftigen Steigerung der Exporte
&ndash; sie stiegen saisonbereinigt um 1,9 % gegen&uuml;ber dem Vorquartal,
w&auml;hrend die Importe sogar um 2,9 % sanken &ndash; sowie einer
unerwarteten Ausweitung der Bauinvestitionen (saisonbereinigt + 0,5 %
gegen&uuml;ber dem Vorquartal). Der private Verbrauch, auf den immerhin
fast 57 % des gesamten Bruttoinlandsprodukts entfallen, ist hingegen zum
dritten Mal in Folge gesunken (saisonbereinigt - 0,3 % gegen&uuml;ber dem
Vorquartal). Entt&auml;uschend war auch die Entwicklung der
Ausr&uuml;stungsinvestitionen. Sie lagen von Januar bis M&auml;rz
saisonbereinigt 2,7 % unter dem Niveau des Schlussquartals 2001. </P>

<P>Im Jahresendquartal 2001 sind zudem die Exporte erstmals seit Ende 1998
wieder zur&uuml;ckgegangen (saisonbereinigt - 1,1 % gegen&uuml;ber dem
Vorquartal). Da die Importe im selben Zeitraum nur leicht abnahmen, hat
sich der Au&szlig;enbeitrag (Exporte minus Importe) verringert. Der
deutsche Au&szlig;enbeitrag liegt allerdings noch immer deutlich im Plus
und hat somit &uuml;ber das gesamte letzte Jahr hinweg positiv zur
Entwicklung des Bruttoinlandsprodukt beigetragen. </P>

<P>Die konjunkturellen Impulse in Deutschland kommen somit
ausschlie&szlig;lich aus dem Ausland. Hierbei d&uuml;rfte vor allem das
au&szlig;erordentlich starke Wirtschaftswachstum in den USA im ersten
Quartal dieses Jahres (saisonbereinigt + 1,4 % gegen&uuml;ber dem
Vorquartal) zu Buche geschlagen haben. Da das amerikanische
Wirtschaftswachstum im zweiten Quartal aber aller Voraussicht nach nicht
mehr so stark ausfallen wird und der US-Dollar gegen&uuml;ber dem Euro in
den letzten sechs Wochen mehr als 5 % an Wert verloren hat, ist zu
bef&uuml;rchten, dass die au &szlig;enwirtschaftlichen Impulse im zweiten
Quartal etwas an Dynamik verlieren werden. </P>

<P>Um so wichtiger ist es, alles daran zu setzen, die Binnennachfrage
wieder zu stabilisieren. Der Schl&uuml;ssel hierf&uuml;r sind aber nicht
kr&auml;ftige Lohnerh&ouml;hungen, sondern umfassende Arbeitsmarktreformen,
die wieder zu mehr Besch&auml;ftigung f&uuml;hren. Durch die Schaffung
neuer Arbeitspl&auml;tze kann die &bdquo;Massenkaufkraft&ldquo; besser
gest&uuml;tzt werden, als durch &uuml;berzogene Tarifabschl&uuml;sse, die
auf der anderen Seite die Kosten der Unternehmen erh&ouml;hen und die
Besch&auml;ftigungsperspektiven eintr&uuml;ben. </P>

<P>Die Tarifvereinbarung in der deutschen Metallindustrie sollte daher kein
Vorbild f&uuml;r andere Branchen sein. Vielmehr m&uuml;ssen Politiker und
Tarifparteien nun ernsthafte und umfassende Konzepte entwickeln, mit denen
die verkrusteten Strukturen am deutschen Arbeitsmarkt endlich aufgebrochen
werden. Die Parteien sollten dabei den Wahlkampf nutzen, um den
B&uuml;rgern ihre L&ouml;sungsans&auml;tze darzulegen. </P>

<P><FONT size="+1"><B>Entwicklung der Verbraucherpreise in
Deutschland</B></FONT><BR>

Die Inflationsrate in Deutschland hat sich nach vorl&auml;ufigen
Berechnungen des Statistischen Bundesamtes (auf der Basis von sechs
Bundesl&auml;ndern) im Mai deutlich abgeschw&auml;cht. Im Vergleich zum
Vorjahresmonat sind die Verbraucherpreise nur noch um 1,2 % gestiegen. Im
M&auml;rz und April betrug die j&auml;hrliche Teuerungsrate noch + 1,8 bzw.
+ 1,6 %. Der in allen EU-Staaten nach einheitlichen Kriterien ermittelte
harmonisierte Verbraucherpreisindex ist f&uuml;r Deutschland gegen&uuml;ber
dem Vorjahresmonat um 1,1 % gestiegen. </P>

<P>Der merkliche R&uuml;ckgang der deutschen Teuerungsrate ist vor allem
auf g&uuml;nstige statistische Basiseffekte zur&uuml;ckzuf&uuml;hren. So
sind die Verbraucherpreise im Mai letzten Jahres besonders kr&auml;ftig
gestiegen (0,5 % gegen&uuml;ber dem Vormonat). Dieser kr&auml;ftige
Preisschub ist nun in der Ver&auml;nderungsrate zum Vorjahresmonat nicht
mehr enthalten. </P>

<P>Dar&uuml;ber hinaus hat sich im Mai aber auch die Entwicklung der
Lebensmittelpreise weiter beruhigt. Nachdem noch im Januar und Februar die
witterungsbedingte Verteuerung von Obst und Gem&uuml;se die Inflationsrate
deutlich nach oben getrieben hat, liegen die Preise f&uuml;r
Frischgem&uuml;se inzwischen sogar unter dem Vorjahresniveau. Merklich
&uuml;bertroffen wird das Vorjahresniveau hingegen von zahlreichen
Dienstleistungspreisen. So sind zum Beispiel die Kosten f&uuml;r
&Uuml;bernachtungen und in der Gastronomie binnen Jahresfrist um 4 %
gestiegen. </P>

<P>Im Juni und Juli d&uuml;rfte die Teuerungsrate in Deutschland in etwa
auf dem gegenw&auml;rtigen Niveau verharren. Mit dem Auslaufen der
g&uuml;nstigen statistischen Basiseffekte wird sich der Preisauftrieb ab
August aber wieder etwas beschleunigen. Gegen Ende des Jahres k&ouml;nnte
die Inflationsrate sogar kurzfristig wieder &uuml;ber die 2 %-Marke
steigen. F&uuml;r den Durchschnitt des laufenden Jahres ist daher weiterhin
mit einer Inflationsrate von 1,8 % zu rechnen, was im Vergleich zu 2001 (+
2,5 %) eine merkliche Beruhigung der Preisentwicklung bedeuten w&uuml;rde.
(Stand: 24. Mai 2002) </P>

<P>Fakten, Daten und Textpassagen aus "www.bankenverband.de". </P>

</TD>
</TR>
</TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="Fu&szlig;note">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR>
</TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

