<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga  Arena News
(03.02.2001)

Amiga Arena - Offline!
In den letzten Tagen konnte ich mich nicht einw&auml;hlen
und somit waren keine Updates m&ouml;glich!
Ich hoffe das jetzt wieder alles wie gehabt l&auml;uft!
 
Amiga Arena - Redesign!
Die Linksammlung in der Amiga Arena wurde neu Strukturiert und in Zukunft
werden dort mehr Bewertungen und Infos zu finden sein!
  
Amiga Arena - UAC Vollversionen!
Das Strategiespiel "Belagerung" f&uuml;r zwei Spieler
steht zum freien Download bereit und eine Toolsammlung!
- WorkbenchPictureSwitcher
Wechselt nach jedem Bootvorgang das Hintergrundbild!
- Transformer
zum umrechnen von Bin&auml;r, Hexadecimal und Decimal.
- SaverSave
Schutz vor Speicher- und L&ouml;schzugriffen auf Dateien.
- Jingle Machine
Verwalten und abspielen von Jingles

Hierbei handelt es sich um Programme die 1995 als
Shareware vertrieben wurden und jetzt Freeware sind!

Amiga Arena - Vorank&uuml;ndigung!
Ich hoffe bald wieder neue Sonderpreis Aktionen anbieten zu k&ouml;nnen!
Derzeit habe ich die Zusage von zwei weiteren
Aktuellen Shareware  Entwicklern!
Ich hoffe Ihr nutzt diese m&ouml;glichkeit weiterhin
Sharewaresoftware  verg&uuml;nstigt zu Registrieren!
Die Sonderpreis Aktionen sind keine Selbstverst&auml;ndlichkeit 
und ich hoffe dieses Angebot auch weiterhin anbieten zu k&ouml;nnen!
Amiga Arena Vollversion
Gespr&auml;che f&uuml;r weitere Vollversionen laufen!


틻miga Arena News
(04.02.2001)

Amiga Arena - Vollversion!
Step into the Line of Fire!
Die Amiga Arena pr&auml;sentiert "Burnout" von Mark Sheeky zum freien Download!
Burnout - The Car Bashing Game
System: AGA, MC68020+,~4MB Fast 7 MB HD
Burnout wurde von Vulcan Software seit 1996 Vertrieben
und ist jetzt FREEWARE!
Der Entwickler Mark Sheeky von Scorpions Software
hat mir die Erlaubnis erteilt Burnout in der Amiga Arena
zum freien Download bereit zustellen!
In Burnout muss man mit seinem Auto versuchen die
gegener in Arenen zu besiegen!
Besonderen dank an: J&uuml;rgen Beck von "Back to the Roots",
der mir die Disk Version von Burnout zukommen liess!
Weitere Informationen unter der Rubrik "Vollversionen" in 
der Amiga Arena!


틻miga Arena News
(06.02.2001)

Amiga Arena - Sonderpreis Aktion!
In zusammenarbeit mit Bernhard Lindner ,erm&ouml;glicht die Amiga Arena
einen Sonderpeis f&uuml;r T.U.M.M.Y!
T.U.M.M.Y ist eine kleine, spezialisierte Datenbank.
Sie verwaltet einen grossen Bestand an Spielkarten
des Sammelkartenspiels Magic The Gathering (&gt;6700 Karten)
Die besondere St&auml;rke des Programms sind die &auml;u&szlig;erst
m&auml;chtigen Suchfunktionen, die es erlauben, nach
praktisch jeder Karten anhand fast aller denkbaren
Kriterien zu suchen.
Viele Verbesserungen sind f&uuml;r die Zukunft geplant, h&auml;ngen
jedoch stark vom Eingang von Registrierungen ab.

Amiga Arena - AmiAtlas Sonderpreis Aktion
AmiAtlas ist noch bis zum 28.02.2001 zum Sonderpreis erh&auml;ltlich.
Andreas Regul hat die Entwicklung f&uuml;r AmiAtlas NICHT eingestellt!
(Er selbst kann AmiAtlas nur nicht mehr weiterentwickeln)
Er sucht aber immernoch f&uuml;r die weiterentwicklung einen Programmierer, auch
Hobby Entwickler sind hiermit angesprochen!
Bei Interresse bitte mail an olaf.koebnik@online-club.de


틻miga Arena News
(18.02.2001)

Amiga Arena - Freie AmiATlas Italien Karte!
Die Italien Karte und Kataloge (Italienisch) von Umberto f&uuml;r AmiAtlas liegt
zum freien Download bereit!
Die Amiga Arena sucht weitere selbst erstellte Zusatzkarten!
Kommerzielle Karten die erweitert wurden sind nat&uuml;rlich NICHT
frei vertreibar!

Amiga Arena Sonderpreis Aktion
Die Sonderpreis Aktion mit AmiAtlas ist nur noch bis zum 28.02.2001 
g&uuml;ltig!


틻miga Arena News
(26.02.2001)

Amiga Arena - Toadies Aktion!
In Zusammenarbeit mit Thilo K&ouml;hler gibt es in der Amiga Arena ein Toadies
Special mit   einem ausf&uuml;hrlichen Interview,das Update und die Toadies
Umfrage!
Bei dem Freeware Spiel Toadies handelt es sich um den wohl besten "Worms"
Clone f&uuml;r den Amiga!
Toadies verf&uuml;gt u.a. &uuml;ber zahlreiche Waffen und Eigenschaften die sogar das
Orginal von Team 17 &uuml;bertrifft!
Amiga Arena - Interview!
Ein ausf&uuml;hrliches Interview mit Thilo K&ouml;hler &uuml;ber Toadies befindet sich in
der Rubrik "Aktion".
Amiga Arena - Toadies Version 7.5!
Das Update auf die aktuelle Version 7.5 liegt in der Rubrik "Aktion" zum
Download bereit!
Amiga Arena - Toadies Computer Gegener Umfrage!
Leider verf&uuml;gt Toadies nur &uuml;ber einen 2 Spieler Modus,aber Thilo
hat sich nach Anfrage der Amiga Arena dazu bereit erkl&auml;rt einen
Computergegener zu entwickeln wenn genug Interesseder User besteht!
Ich brauche jetzt mit Sicherheit nicht auf die allgemeine Situation des
Amiga Marktes eingehen,um zu erkl&auml;ren warum Toadies in der 1 Spieler 
Version nicht mehr als Freeware ver&ouml;ffentlicht werden kann!
Toadies w&uuml;rde mit Computergegner als Shareware ver&ouml;ffentlicht!
Ab 30 Anfragen und einer Sharewaregeb&uuml;hr von 30.- DM w&uuml;rde f&uuml;r Toadies ein
Computergegner entwickelt von Thilo K.
Exklusiv f&uuml;r die Amiga Arena g&auml;be es einen Sonderpreis von 20.- DM!

Wichtiger Hinweis
Diese Aktion wird von der Amiga Arena durchgef&uuml;hrt um f&uuml;r Toadies eine
weiter Entwicklung zu Unterst&uuml;zen!
Die Amiga Arena erh&auml;lt in keinsterweise einen finanziellen Anteil wenn ein
Computergegner entwickelt wird!
Dies betrifft auch die Sonderpreisaktion der Amiga Arena,diese Aktion ist
Non-Profit um gute Amiga Software zu unterst&uuml;zen!
Es liegt an Euch,die Amiga Arena kann nur dazu bewegen!


틻miga Arena News
(28.02.2001)

Amiga Arena - AmigaKonto Vollversion!
Mit der Genehmigung von Andreas Regul liegt zum freien Download,
das Programm AmigaKonto bereit.
AmigaKonto wurde geschrieben, um die Verwaltung
von Konten zu  vereinfachen.
Insbesondere Girokonten mit vielen
Kontenbewegungen lassen schnell die &Uuml;bersicht verlieren, wenn es
darum geht, st&auml;ndig wiederkehrende &Uuml;berweisungen zu pr&uuml;fen.
AmigaKonto dient daher zun&auml;chst als eine spezielle
Art von  Datenbank, in der die einzelnen
&Uuml;berweisungsauftr&auml;ge verwaltet werden.
Durch zahlreiche Selektions- und Statistikfunktionen 
k&ouml;nnen dann aus der Gesamtheit
von Kontenbewegungen gezielt einzelne Posten nach den verschiedensten 
Kriterien aufgesucht  werden.
Der volle Nutzen l&auml;&szlig;t sich dann erzielen, wenn
Kontodaten &uuml;ber mehrere Jahre gesammelt werden und
somit Vergleichswerte zur Verf&uuml;gung stehen, die
&uuml;ber die Selektionsfunktionen einen schnellen
&Uuml;berblick der Daten erm&ouml;glichen.

Amiga Arena - Toadies Umfrage Nachtrag
Die Teilnahme an der Umfrage zwecks Entwicklung eines Computergegners 
f&uuml;r Toadies ist Unverbindlich!
Daf&uuml;r das Toadies zu den "most Downloads" im Aminet geh&ouml;rte
bin ich sehr ent&auml;uscht was das bisherige Ergebniss der Teilnahme ist!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
