<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Neuigkeiten von Airsoft Softwair

Airsoft Softwair (http://www.airsoftsoftwair.de) informiert:

»Auf der Airsoft Softwair Homepage wurden soeben in der "The Best Of 
Airsoft Softwair Gold Edition" Section einige Schnappsch&uuml;sse von Programmen
auf der CD-ROM ver&ouml;ffentlicht, u.a. von Rainboot v3.1 sowie dem CD32 Games
Install Kit 4 und RB2Exe 1.2. Au&szlig;erdem befindet sich dort auch das von
Pixel Art gestaltete Cover in Hochaufl&ouml;sung von 1600x1600x24.«


»Da ich immer &ouml;fter gefragt werde, ob man die Vollversionen auf
der The Best Of Airsoft Softwair Gold Edition CD-ROM auch mit
Updates in der Zukunft benutzen kann, hier eine Erkl&auml;rung: Es gibt
ein Keyfile speziell f&uuml;r die CD-ROM und mit diesem Keyfile, welches
von der CD-ROM erstellt wird, kann man auch k&uuml;nftige Updates
von Airsoft Softwair Sharewareprogrammen vollkommen uneingeschr&auml;nkt
benutzen.

Es lohnt sich also umso mehr, sich die CD-ROM zu bestellen, da
eine Einzelregistration der Shareware Programme &uuml;ber 80 DM
kosten w&uuml;rde, w&auml;hrend die The Best Of Airsoft Softwair Gold Edition
CD-ROM schon f&uuml;r 29.95 DM zu haben ist. Sie kann &uuml;ber die
Airsoft Softwair Website &lt;http://www.airsoftsoftwair.de/&gt; bestellt
werden.«


»In der n&auml;chsten Version von Rainboot wird es einige gr&ouml;&szlig;ere
&Auml;nderungen f&uuml;r Grafikkartenbenutzer geben! Da mir weder ein
CGfx noch ein Picasso96 System zur Verf&uuml;gung steht und
es immer mal wieder Meldungen gab, dass es da noch das
ein oder andere Problem mit Rainboot gibt, obwohl es im
generellen l&auml;uft, bitte ich diejenigen, die noch Probleme mit
Rainboot auf Cgfx/P96 haben, sich bei mir zu melden, damit
die Probleme so schnell wie m&ouml;glich beseitigt werden k&ouml;nnen. Vielen
Dank!«


»Die Airsoft Softwair Homepage ist ab sofort auch unter der URL
http://www.airsoftsoftwair.com/ zu erreichen. Dort gibt es
Informationen &uuml;ber alle Airsoft Softwair Programme sowie der
ersten CD-ROM "The Best Of Airsoft Softwair Gold Edition".
Selbstverst&auml;ndlich bleibt die alte URL http://www.airsoftsoftwair.de/
auch weiterhin g&uuml;ltig.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
