<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Diverse Amiga-News
------------------

1. GTI &uuml;bernimmt operatives Gesch&auml;ft der Schatztruhe GmbH

Schatztruhe (http://www.schatztruhe.de) informiert:

»Waldshut-Tiengen/Essen, den 26.02.2001

GTI Grenville Trading International GmbH, ist seit 1987 als
Gro&szlig;h&auml;ndler f&uuml;r Amiga-Software t&auml;tig und verf&uuml;gt &uuml;ber ein weltweites
H&auml;ndlernetzwerk. Stefan Ossowski's Schatztruhe Gesellschaft f&uuml;r Software
mbH ist seit mehr als 13 Jahren einer der f&uuml;hrenden Software-Verlage f&uuml;r
Amiga-Productivity-Software. Seit 1994 besteht eine enge und erfolgreiche
Kooperation beider Unternehmen, die dazu beigetragen hat, da&szlig; die CD-ROM
sich auch im Amiga-Markt nachhaltig durchsetzen konnte.

Mit Wirkung zum 01.03.2001 haben beide Unternehmen vereinbart, diese
Kooperation zu intensivieren. In diesem Zusammenhang &uuml;bernimmt die GTI GmbH
das operative Gesch&auml;ft der Schatztruhe GmbH. Alle
Schatztruhe-Verlagsaktivit&auml;ten werden nach Waldshut-Tiengen verlegt und
dort in unvermindertem Umfang als ein Gesch&auml;ftsbereich der GTI GmbH
fortgef&uuml;hrt.

F&uuml;r Kunden, Lieferanten und sonstige Vertragspartner der Schatztruhe GmbH
wird der &Uuml;bergang so einfach wie m&ouml;glich gestaltet. Im Prinzip sind ab dem
01.03.2001 lediglich neue Rufnummern, E-Mail-Adressen und eine neue
Anschrift zu beachten:

Schatztruhe
GTI Grenville Trading International GmbH
Weihergasse 5
79761 Waldshut-Tiengen
Germany

Telefon:
Telefon: +49-(0)700 - 70 60 50 40
Telefax: +49-(0)201 - 426 00 00

Internet:
    amiga@schatztruhe.de (Allgemein & Bestellungen)
    support@schatztruhe.de (Technisches Support)

http://www.schatztruhe.de/


Die Schatztruhe wird auch k&uuml;nftig qualitativ hochwertige Amiga-Software zu
attraktiven Preisen ver&ouml;ffentlichen. F&uuml;r das Jahr 2001 sind bereits
zahlreiche neue Produkte in Vorbereitung.


Richard Small                              Stefan Ossowski
Gesch&auml;ftsf&uuml;hrer GTI GmbH                   Gesellschafter Schatztruhe GmbH«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
