<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. »AmigaOS3.9 - wirklich nur eine Mogelpackung?« (von Wolfgang Hosemann)

»Ich habe die (bisher) zwei Artikel &uuml;ber das OS3.9 in AMIGA aktuell gelesen 
und war sehr erstaunt &uuml;ber die ganz offensichtlich vorhandene 
Kurzsichtigkeit 'erfahrener' Amiga-Anwender. In einem Artikel ist st&auml;ndig 
die Rede von OS3.5 + Shareware-Sammlung, und &uuml;berhaupt, andere Programme 
w&auml;ren viel besser gewesen und h&auml;tten stattdessen in OS3.9 &uuml;bernommen werden 
sollen usw.

Merkw&uuml;rdig, irgendwie widerspricht sich der Autor selbst. Die 'Shareware-
Sammlung' wird als Versuch gedeutet 'die Kunden hinters Licht zu f&uuml;hren' 
und im gleichen Atemzug werden andere (Share- oder Freeware-) Programme zur 
Aufnahme in das neue AmigaOS gefordert.

Ich konnte auch die (technischen) Kritikpunkte nicht so richtig 
nachvollziehen. Das OS3.9 ist doch wohl als Betriebssystem 'f&uuml;r alle' 
gedacht, nicht nur f&uuml;r Spezialisten, die die f&uuml;r sie notwendigen Funktionen 
entweder durch andere (Share- oder Freeware-) Programme erhalten oder diese 
Funktionen gar selbst f&uuml;r sich programmieren k&ouml;nnen. Unter diesem 
Gesichtspunkt ist z.B. die Kritik an 'PlayCD' in keiner Weise 
gerechtfertigt. Dabei wurde z.B. geflissentlich &uuml;bersehen, da&szlig; 'PlayCD' 
durchaus neue (aber verborgen arbeitende) Funktionen besitzt. Hat sich denn 
keiner gewundert, da&szlig; man PlayCD einfach so starten kann, und eine im CD-
ROM-Laufwerk befindliche CD sofort abgespielt werden kann? 'PlayCD' 
versucht n&auml;mlich von sich aus, ein CD-ROM-Laufwerk im System zu finden und 
benutzt im Erfolgsfalle dieses automatisch. Ach ja, so etwas ist bei 
anderen CD-Player-Programmen ja Standard, habe ich vergessen ;). 

Ernsthaft: Ich bin der Meinung, da&szlig; viele Kommentare losgelassen werden,
ohne sich gr&uuml;ndlich mit der behandelten Materie (und vor allem dem
Amiga-Markt) zu besch&auml;ftigen. Ich finde das schade, da gerade der
Amiga-Markt extrem empfindlich auf negative Kommentare und Kritiken
jedweder Art reagiert. Dieses Verhalten der 'Amiga-Gemeinde' insgesamt (so
langsam geht mir das mit der 'Gemeinde' auf den Nerv!) hat den Markt leider
dahin gebracht, wo er sich zur Zeit befindet: Ganz nahe am Boden!

Aber um wieder zum Thema zu kommen: OS 3.9 wird ganz eindeutig verkannt! Es
war eine mehr als reife Leistung, innerhalb der sehr kurzen 
Entwicklungszeit so viel auf die Beine zu stellen! Es wird zum Beispiel
immer wieder &uuml;bersehen, da&szlig; die 'eingekauften' Shareware-Programme durchaus
nicht dem entsprechen, was man im Aminet findet! Man darf davon ausgehen,
da&szlig; gerade diese Programme eine teilweise sehr gr&uuml;ndliche &Uuml;berarbeitung
erfahren haben, da sie mit Sicherheit in den Beta-Test des OS3.9 einbezogen
wurden. Das hat J&uuml;rgen Haage auf der WOA 2000 auch mehrfach betont! 

Sicher, die Fehler bei der Erstellung der CD sind sehr peinlich, aber auch
verzeihlich. Man bedenke: Andere Betriebssysteme haben eine wesentlich
gr&ouml;&szlig;ere Entwickler-Crew hinter sich, die sich dazu auch noch voll auf ihr
Projekt konzentrieren kann! H&P hat, als Firma, die sich beinahe
ausschlie&szlig;lich mit dem Amiga besch&auml;ftigt, mit Sicherheit &auml;hnliche Sorgen,
wie jede andere Firma, die sich stark auf Amiga konzentriert. Es fehlen
ganz einfach die Resourcen, sich 100 oder mehr Leute zu besorgen, die sich
ausschliesslich mit der Weiterentwicklung und Qualit&auml;tssicherung des
AmigaOS besch&auml;ftigen. Trotzdem bin ich mir sicher, da&szlig; die Fehler der CD
kosteng&uuml;nstig oder vielleicht kostenlos behoben werden. 

Unter diesem Blickwinkel wird eine andere, unvermutete Eigenschaft des 
OS3.9 sichtbar: Es ist ein Produkt, da&szlig; von Enthusiasten f&uuml;r Entusiasten 
erstellt wurde, mit der Aussicht auf sehr mageren finanziellen Erfolg. 
Frage an die Leser dort drau&szlig;en: W&uuml;rden sie so etwas machen? Arbeit in 
etwas zu investieren, da&szlig; ihnen wenig bis gar kein Geld einbringt? Ich 
wette, 95% der Leser w&uuml;rden m&uuml;de l&auml;chelnd abwinken und sich mit etwas 
lukrativerem besch&auml;ftigen.

Nichtsdestotrotz m&ouml;chte mir jetzt die aktuellen Kritiken vornehmen. Die
negativen Seiten (aus Sicht bestimmter Anwender) sind ja nun reichlich
vertreten. Die Betrachtung der positiven Seiten m&ouml;chte ich zu meiner
Aufgabe machen und das OS3.9 aus der Sicht des 'Otto-Normal-Users'
beleuchten:

Installation: Wer einen Amiga ohne IDE-Spielzeug-Kontroller besitzt, war
schon immer auf der sicheren Seite. IDE-Fix (auch in der Express-Variante)
wird nun automatisch erkannt und bei der Erstellung der Notfall-Diskette in
Rechnung gezogen (Ja, man hat aus Fehlern gelernt! It's not a feature, it's
a bug! W&uuml;rde MS so etwas jemals zugeben?). Bei anderen Kontrollern gibt es
immer noch Probleme. Das ist schade, hat aber technische Gr&uuml;nde, die nicht
so leicht zu umschiffen sind. Man betrachte sich dazu den Amiga-Magazin-
Artikel 'Und es l&auml;uft doch!' von Martin Steigerwald, zu finden auf der HP 
des Amiga-Magazins. 

Davon abgesehen: Einlegen, installieren, l&auml;uft! Ich habe als Versuch meinen
furchtbar aufgemotzten 4000er (nahezu Vollausstattung) ohne Erstellung der
ND auf 3.9 umgestellt, man h&ouml;re und staune: Er bootete sofort, schneller
als vorher und er l&auml;uft um L&auml;ngen stabiler als noch unter 3.1! W&auml;re der
inkompatible WarpGIF-Datatype nicht gewesen, h&auml;tte sogar wirklich ALLES auf
Anhieb funktioniert (AnimatedIcon tat deswegen seinen Dienst nicht. Nach
Installation des Standard-GIF-Datatypes war alles bestens). Das
allersch&ouml;nste: Die Fehler der CD machten sich in keinster Weise bemerkbar.

Die Multimedia-Programme: Warum Amplifier und nicht AmigaAMP in das OS3.9
aufgenommen wurde, d&uuml;rfte klar sein, wenn man Thomas Wenzels Kommentare zum
OS3.9 liest. Er wollte es nicht, findet, OS3.9 sei &uuml;berfl&uuml;ssig, alles
andere w&auml;re besser gewesen und damit basta! Warum er zu dieser Ansicht
kommt, ist mir unklar, da ich ihn dazu noch nicht pers&ouml;nlich befragt habe,
er wird aber seine Gr&uuml;nde haben. Fakt ist aber, der Amiga hat seinen
offiziellen (und durchaus nicht schlechteren!) MP3-Player. Er l&auml;uft auf
meinem Rechner etwas stabiler als AmigaAMP und macht auch sonst eine gute
Figur. Wer auf AmigaAMP besteht, kann dieses jedoch ohne Einschr&auml;nkungen
nutzen, das OS3.9 schreibt nicht vor, welches Programm man zum Abspielen
von MP3 zu benutzen hat. 

Das man MooVId als AVI/QT-Player genommen hat, ist durchaus nicht negativ.
Er spielt sehr zuverl&auml;ssig und vor allen Dingen SCHNELL, auch auf kleineren
Systemen. Das die PPC-Version keinen Einzug ins OS gehalten hat, d&uuml;rfte
tats&auml;chlich am Author liegen, ist aber nachvollziehbar. Der gute Mann mu&szlig;
von irgendetwas die Lizenzgeb&uuml;hren f&uuml;r den Intel Indeo-Codec bezahlen, der
nun mal auch in der Freeware-Fassung von MooVId NICHT enthalten ist. H&auml;tten
mehr Benutzer registriert, s&auml;he das vielleicht anders aus. Schade, aber
verst&auml;ndlich!

Der MPEG-Player: Ernsthaft: Hat jemand Spa&szlig; daran, sich MPEG-Filme auf
68k-Rechnern anzusehen? Ich glaube, die wenigsten haben daran Vergn&uuml;gen.
Man sollte bedenken, da&szlig; die Anzahl derer, die eine PPC-Karte ihr Eigen
nennen d&uuml;rfen, ziemlich klein ist. Daher kommt es wohl auch, das kein
MPEG-Player Einzug gehalten hat. Ich k&ouml;nnte mir auch gut vorstellen, da&szlig; es
einiges an &Uuml;berredungskunst bedarf, den Author eines derartigen Programms
dazu zu bringen, sein Produkt ins AmigaOS zu integrieren. Ich denke da vor
allem an M. Roslund, der den meiner Meinung nach einzig brauchbaren
MPEG-Player auf die Beine gestellt hat. Er wollte vielleicht nicht
(vielleicht hat auch keiner danach gefragt), was zwar schade ist, aber im
Moment halt nicht zu &auml;ndern. Sollte sich jemand bereit erkl&auml;ren, einen
Player zu schreiben, der alle genannten Kritikpunkte aufhebt, so sollte er
sich vielleicht mal mit H&P in Verbindung setzen. Reich wird er dabei aber
wohl eher nicht...

AmiDock: Ja, es ist nur eine Startleiste und hat nicht die M&ouml;glichkeiten 
von TD, aber es ist SEHR konsequent in seinem Funktionsumfang. Es startet
Programme, &ouml;ffnet Verzeichnisse und leitet Dateien an die im Dock
enthaltenen Programme weiter. Mehr SOLLTE es nach meiner Meinung gar nicht
k&ouml;nnen, da es anscheinend f&uuml;r die Leute gedacht ist, die sich nicht mit
sechzehntausend Funktionen rumschlagen wollen, die mit der eigentlichen
Intention des Programms wiederum kaum etwas zu tun haben. Ich kann damit
jedenfalls prima leben und nutze es t&auml;glich. Endlich keine Konfigurations-
Orgie mehr...

VincED: Hier st&ouml;rt mich eigentlich nur, das wiederholt darauf verwiesen
wird, das die Programmierer des OS3.9 auf das Aminet h&auml;tten zur&uuml;ckgreifen
*m&uuml;ssen*. Eins scheint, bei aller berechtigter Kritik an diesem Vorgehen,
nicht ganz klar zu sein: Diese Komponenten, die, in etwas anderer Fassung,
auch mal im Aminet zu finden waren, sind seit OS3.9 BESTANDTEIL des
Betriebssystems. Das bedeutet, da&szlig; sie ab jetzt in den (hoffentlich)
folgenden Versionen des AmigaOS enthalten sein werden. Geht AmigaOS in
Richtung PPC, so gilt das dann auch f&uuml;r diese Bestandteile des AmigaOS
(nat&uuml;rlich wieder abh&auml;ngig von den Konditionen, die mit den Programmierern
vereinbart wurden, ein kleiner Malus, m&ouml;glicherweise. Das gilt aber nur
dann, wenn einer der Beteiligten sein Einverst&auml;ndnis zur Integration seines
Werkes ins AmigaOS wieder zur&uuml;ckziehen kann). Das w&uuml;nschen sich
wahrscheinlich viele PPC-Besitzer (und auch die anderen). Ich denke, das
ist eher positiv zu bewerten.

UnARC: Die Kritik ist hier berechtigt. Aber wer weiss, vielleicht kommt das
noch? M&ouml;glicherweise hat einfach die Zeit nicht gereicht, um PPC-Support
nachzur&uuml;sten? Abgesehen davon, wenn es nur so einfach w&auml;re: Einfach den
Quelltext nehmen und f&uuml;r WarpOS noch einmal kompilieren... das ist sachlich
unzutreffende Kritik, schade. Aber das scheint ein generelles Problem des
Journalismus im Bereich Amiga zu sein: Unzureichende Recherche. Dar&uuml;ber
sollten sich alle einmal Gedanken machen, finde ich...

Contributions: &Auml;h, was hei&szlig;t 'Contributions' denn eigentlich? Nun, laut
Langenscheidt bedeutet es im allgemeinen soviel wie 'Beitrag (zu etwas)'.
Fein, was bedeutet das f&uuml;r OS3.9? Da wollte jemand etwas zum OS beitragen,
n&uuml;tzlich oder weniger n&uuml;tzlich, wertvoll oder weniger wertvoll, das liegt
im Auge des Betrachters. Wenn ich mir die Beigaben so anschaue, sehe ich
wieder etwas, das f&uuml;r die Leute gedacht ist, die NICHT schon alles haben.
In sofern also ein netter Zug, z.B. so manchem Benutzer den Download eines
25MB gro&szlig;en Trailers im AVI-Format zu ersparen.

Sicher, das hat die CD auf 470 MB 'aufgeblasen' ('tschuldigung, ich muss
lachen ;) ). Spielt das irgendeine Rolle bei 650 MB Platz (nach Standard)? 
Da die Contributions 370 MB gro&szlig; sind, darf man die restlichen 100MB wohl 
zum OS z&auml;hlen? Kann sich noch jemand erinnern, wieviel Platz OS3.1 
ben&ouml;tigte? Ja? Prima. Dann f&auml;llt es wohl jedem ins Auge, da&szlig; es prinzipiell 
Unsinn w&auml;re, eine mit gerade Mal 100MB gef&uuml;llte CD ohne Beigaben 
herauszubringen, vor allem wenn man bedenkt, das eventuelle weitere, neue 
Funktionen des AmigaOS wohl h&ouml;chstens 3-4MB mehr gebracht h&auml;tten. Darum 
beneidet man das AmigaOS doch insgeheim: Es ist SEHR gen&uuml;gsam, was den 
Platzbedarf betrifft.


Also ein paar nette Zugaben auf die CD, eben f&uuml;r die Leute, die noch nicht
alles haben, und alles ist prima. Wer es gebrauchen kann, gebraucht es, wer
das alles schon hat, l&auml;&szlig;t es. Wo liegt das Problem? Will etwa ernsthaft
jemand ein Betriebssystem, das in der Vollinstallation &uuml;ber 600 MB Platz
auf der Festplatte beansprucht? Kann er haben, man nehme Windows 2000 und
der Frau (oder dem Mann) ist geholfen. Viel Spa&szlig; damit. 

Leider zeigt dieser Kritikpunkt nur, das viele fortgeschrittene Benutzer
meist nur an sich selbst denken. Bei manchen Programmierern merkt man das
leider auch an deren Programmen. Schade, ein wenig mehr R&uuml;cksicht auf die
nicht so versierten Benutzer st&uuml;nde manchem Programm (und auch Kritiker)
gut zu Gesicht. Ich kann daher nicht verstehen, das 'nette Beigaben' und
voll funktionst&uuml;chtige Programme, die dereinst (und auch heute noch) im
Aminet erh&auml;ltlich waren, nicht fester Bestandteil eines Betriebssystem-
Updates sein sollen. 

Verst&auml;ndnis f&uuml;r diese Kritik fehlt mir erst recht, wenn ich bedenke, da&szlig; 
man manche der neuerdings zum OS geh&ouml;renden Programme nun einmal NICHT f&uuml;r 
lau aus dem Aminet beziehen kann. Ich kann nur wiederholen: F&uuml;r die, die 
schon alles haben, mag das &uuml;berfl&uuml;ssig sein (sind Verbesserungen, die die
Aminet-Version der Programme nicht haben, auch &uuml;berfl&uuml;ssig?), aber was ist
mit denen, die das alles nicht haben? Das nicht mit einzubeziehen ist
wirklich sehr kurz gedacht...

Die Puristen: Manchmal habe ich das Gef&uuml;hl, das einige der 'Puristen' das
Wort 'Pur' in Bezug auf Ihren Amiga etwas ZU ernst nehmen. Sicher ist es
ein berechtigter Kritikpunkt, da&szlig; z.B. die neuen def_icons mehr Platz
einnehmen und bei sehr mager ausgestatteten Systemen zu Speichermangel
f&uuml;hren. Nun, hier zeigt sich ein Dilemma: Was soll mit einer neuen
Betriebssystem-Version unterst&uuml;tzt werden? Moderne, aufger&uuml;stete Systeme,
die ein vern&uuml;nftiges Arbeiten auch mit neueren Entwicklungen wie MP3 etc.
zulassen, oder die, seit 1992 nun einmal hoffnungslos veralteteten,
Nur-AGA-Systeme mit einem 68020/14,28 MHz-Prozessor? Ja, Grafikkarten sind
f&uuml;r den Amiga unversch&auml;mt teuer, aber Speicher nicht (kostet f&uuml;r den PC das
gleiche). 

Manche Patches, die ein Verlegen der Piktogramme ins Fast-Ram erlauben,
kollidieren mit uralten Programmen. Sicher ist das ein Problem, aber das
ist mit einer neuen Betriebssystem-Version nicht zu l&ouml;sen, sondern nur mit
einem neuen Programm (die Rede ist von DeluxePaint, wahrlich ein Oldtimer,
und leider auch in keinster Weise systemkonform geschrieben). 

F&uuml;r diese Anwender habe ich nur einen Rat: Werdet wenigstens ein klein 
wenig moderner. Kauft ein neueres Programm (oder nutzt eins aus dem
Freeware-Bereich), kauft ein wenig Speicher und die Probleme sind Schnee
von gestern. Vielleicht w&auml;re ja doch einmal Zeit f&uuml;r eine Grafikkarte? Dann
kauft eine! Als sch&ouml;ner Nebeneffekt helft Ihr damit den Amiga-Firmen, am
Leben zu bleiben. Damit w&auml;re allen gedient.

Ich hoffe, diese Kritik an der Kritik hat dabei geholfen, die ganze Sache
mal aus der Sicht der Anwender zu sehen, die wirklich froh dar&uuml;ber sind,
endlich einmal alles, was man sonst nur mit dem PC machen konnte, ohne
gro&szlig;en Aufwand mit Ihrem Amiga machen zu k&ouml;nnen.

Ich bleibe jedenfalls beim AmigaOS 3.9 und werde auch dem OS3.9 folgende
Versionen genau betrachten und kaufen. Allein schon, um den arg 
angeschlagenen Amiga-Markt etwas zu st&uuml;tzen...

Wolfgang Hosemann &lt;whose@gmx.de&gt;

P.S.: Hat eigentlich jemand die diversen Artikel gelesen, in denen von 
einem BoingBag f&uuml;r OS 3.9 gesprochen wurde? Die Kritiker wohl nicht, sonst 
w&auml;ren viele Punkte zwar zur Zeit noch berechtigt (mit dem BB vielleicht 
nicht mehr) aber einer w&auml;re ganz gewi&szlig; nie erw&auml;hnt worden: Das manch einer 
den Eindruck gewinnen k&ouml;nnte, OS3.9 w&auml;re nur ein geschickter Marketing-
Trick, um wieder Geld in die Kassen zu bekommen. Bisher haben die BoingBags 
nichts gekostet (au&szlig;er Download-Zeit, in Zeiten von 56K-Modems bei einer
durchschnittlichen Gr&ouml;&szlig;e der Dateien von etwas &uuml;ber 1MB nicht
erw&auml;hnenswert), und ich denke, das wird auch so bleiben. 

Ob die Zeit der Entwickler, die an den Verbesserungen arbeiten, wohl auch
nichts kostet?«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
