<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Beim letzten Gewinnspiel haben 35 Leser mitgemacht.
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr bereits 
mit zwei Antworten gewinnen k&ouml;nnt.


Jetzt zur Aufl&ouml;sung:


Standard-Frage: Auf der in K&uuml;rze stattfindenden gr&ouml;&szlig;ten (nicht nur          
                Computer-) Messe der Welt soll das erste Handheld-Ger&auml;t auf  
                AmigaDE-Basis pr&auml;sentiert werden. Wie hei&szlig;t die Messe?

Antwort: Gefragt war nat&uuml;rlich nach der CeBIT, der gr&ouml;&szlig;ten Messe der Welt.


Master-Frage: Welche Firma will dieses Handheld-Ger&auml;t auf den Markt         
              bringen?

Antwort: Richtig ist »Thendic Electronic Components«.


Meinungsfrage:  Wirst du die angesprochene Messe besuchen?

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
1 (Ja)                                                                    5
2 (Nein)                                                                 30


Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung 
bezogen:

Karl-Heinz Bader gibt auf die Frage, ob er die CeBIT besuchen wird, eine, 
wie soll ich sagen, recht interessante Antwort: »Wahrscheinlich nicht. Aber 
vielleicht doch? :))«

Krister S. Skrtic antwortet mit »Nein« und f&uuml;hrt aus: »Wenn wir in 
Gothenburg, Schweden, nur auch so eine Messe h&auml;tten, w&uuml;rde ich sie ganz 
sicher besuchen.«

Stephan Karnasch kommt ebenfalls nicht, da er in Abiturvorbereitungen 
steckt.

Auch Gernod Schomberg f&auml;hrt nicht zur CeBIT: »Ich h&auml;tte von Berufs wegen 
die Messe in Hannover jedes Jahr besuchen sollen. Ich hatte es vor vielen 
Jahren einmal gemacht, musste auch Gesch&auml;ftspartner besuchen, habe es an 
dem einen Tage zu zweien geschafft und war danach so pflasterm&uuml;de, dass ich 
gl&uuml;cklich war, abends wieder im IC nach Hause fahren zu k&ouml;nnen. In den 
folgenden Jahren ist es mir immer gelungen, bei meinem Chef einen viel 
geeigneteren Kollegen auszudeuten, der dann mit Begeisterung hinfuhr. Ich 
erhielt die Ergebnisse der Messe dann immer aus erster Hand von unseren 
Partnern und Lieferanten sehr sch&ouml;n aufbereitet, viel besser, als ich es 
h&auml;tte machen k&ouml;nnen. Und warum soll ich mir das heute als Rentner antun, wo 
doch in allen Medien ausf&uuml;hrlich dar&uuml;ber berichtet wird?«


Fazit:

Es hat mich schon &uuml;berrascht, wie gering unter den Gewinnspielteilnehmern 
das Interesse an der CeBIT ist. Nicht unbedingt wegen der ersten AmigaDE-
Produkte, die dieses Jahr m&ouml;glicherweise pr&auml;sentiert werden, sondern weil 
ich allgemein davon ausging, dass die gr&ouml;&szlig;te Messe der Welt auch bei Amiga-
Anwendern einen hohen Stellenwert genie&szlig;t. Dem ist offensichtlich nicht so, 
vielleicht weil die CeBIT in den letzten Jahren mehr und mehr das Image 
einer »Fachmesse« bekommen hat.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Vollversion von "AFiloFaxPro": Gerhard Schmid
1 x Vollversion von "Amiga Writer 2.0": Jean Holzammer
1 x Vollversion von "MXM Chart Light": Philip Geldmacher

Herzlichen Gl&uuml;ckwunsch!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
