<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Dirks Bastelstunde (von Dirk Wenk)

Oder: Wie baut man eine Silversurfer und einen Express-Adapter in einen 
Desktop-A1200er ein?

[Achtung: Die Durchf&uuml;hrung der im Folgenden beschriebenen Arbeiten erfolgt 
auf eigene Gefahr!]

Warum auf all die sch&ouml;nen Extras verzichten, nur weil man keinen Tower hat?

Das oder so was &Auml;hnliches (es war wohl eher Geldmangel) habe ich mich 
gefragt, als ich meine A1200 etwas aufpeppen wollte.

Als ich meinen A1200 gebraucht erstanden hatte, war er bereits ausger&uuml;stet 
mit einer Blizzard 1230/50 und dem SCSI-Kit. Es handelt sich &uuml;brigens um 
ein Modell, das zu Escoms Zeiten gefertigt wurde und somit den so genannten 
Escom-Bug besitzt. Das eingebaute Floppy-Laufwerk gibt das "Drive_Ready"-
Signal nicht weiter. Das war meine erste Modifikation an diesem Amiga. Es 
gibt viele Anleitungen dazu im Aminet und manche sind echt haarstr&auml;ubend! 
Sie gehen vom Einbau eines Kondensators bis hin zu einer komplexen Timer-
Schaltung, die das Signal emuliert. Nicht besonders brauchbar, wenn man 
bedenkt, dass das Laufwerk dieses Signal hat, aber nicht weitergibt. Zum 
Gl&uuml;ck gibt es aber auch die "richtige" Anleitung.

Man braucht eigentlich nichts weiter zu tun als das Signal von der Floppy-
Platine abzugreifen und aufs Motherboard zu f&uuml;hren. Seit dem funktionieren 
alle alten Spiele wieder, die dieses Signal unbedingt haben wollten. Nur 
leider ist das Laufwerk jetzt durch dieses eine Kabel mit dem Motherboard 
fest, d.h. dauerhaft, verbunden. Aber Hauptsache, es funktioniert!

Als ich meinen A1200 per PCMCIA-Netzwerkkarte vernetzte, kam nat&uuml;rlich die 
n&auml;chste Modifikation. Und zwar, weil der A1200 ein Problem mit dem Reset-
Signal am PCMCIA-Bus hat. Also wieder ins Aminet und die diversen L&ouml;sungen 
angeschaut. Die Einfachste war, einen 10-µF-Kondensator in die Resetleitung 
einzul&ouml;ten. Und es klappt wunderbar.

Irgend wann wurde mir die Festplatte dann zu klein und ich habe eigentlich 
recht g&uuml;nstig eine 4GB-2,5"-Festplatte der Marke "Toshiba" bekommen. Leider 
war die Geschwindigkeit der Daten&uuml;bertragung nur geringf&uuml;gig h&ouml;her als 
vorher und so dauerte das Formatieren entsprechend lange....

Zu ungef&auml;hr diesem Zeitpunkt wollte ich meinen A1200 als Modem-Server 
nutzen. Aber die eingebaute serielle Schnittstelle ist nicht gerade 
schnell, von der CPU-Last ganz zu schweigen.

Also kaufte ich mir eine Silversurfer. Dann ging es an den Einbau, der sich 
als etwas vertrackt erweisen sollte. Nachdem ich mich gewundert habe, warum 
dieses Modul nun so herum und nicht so, wie es gut passen w&uuml;rde, eingebaut 
wird, war es auch mal wieder Zeit f&uuml;r jede Menge Klebeband, denn das Modul 
eckte hier und da an und h&auml;tte wohl einen Kurzschluss verursachen k&ouml;nnen. 
Nachdem ich noch mit Bohrer und S&auml;ge die passende &Ouml;ffnung f&uuml;r den seriellen 
Anschluss in das Geh&auml;use geschaffen hatte, baute ich auch wieder alles 
sch&ouml;n zusammen.

Vor kurzem wurde mir dann die Festplatte doch zu langsam und so holte ich 
mir das IDE-fix-Ger&auml;t mit dem vielsagenden Namen "EXPRESS Bundle". Bis zum 
Einbau war ich davon &uuml;berzeugt, dass es in den Desktop Rechner passt...nun 
ja...

Rechner auf, Express-Adapter auf den Chip dr&uuml;cken und, &auml;&auml;&auml;h... Mist, der 
Adapter geht nicht ganz auf den Chip drauf, da ich ganz in der N&auml;he den 
Kondensator f&uuml;r den PCMCIA-Fix eingel&ouml;tet habe. Jetzt sitzt der Adapter 
dort auf. Aber kein Problem f&uuml;r mich! Etwas L&ouml;tzinn hier, ein Kabel dort 
und es sitzt! Abschirmblech drauf und ..Oh Oh! Das Blech sitzt leicht auf 
und die Festplattenklammer passt nicht mehr, da die &Ouml;ffnung jetzt durch die 
Platine verdeckt wird!

H&auml;tte man die Expressanschl&uuml;sse anders an die Platine angebracht so h&auml;tte 
es wahrscheinlich gepasst! 

Also was bleibt mir anderes &uuml;brig, als das Blech der Festplattenklammer zu 
verbiegen. Fast ca. 150&#176 verbogen, aber nun passt es. Und durch die 
Tastatur m&uuml;sste es festgehalten werden. Dann noch den 4-fach-Adapter mit 
dem Express-Adapter &uuml;ber das Flachbandkabel verbinden und das Ganze 
irgendwie festmachen. Was leider aufgrund des l&auml;cherlich kurzen Kabels fast 
unm&ouml;glich erscheint. Aber es geht gerade so. Rechner zu, Rechner an und 
...Nix...mmmh.

Also wieder den Rechner auf und siehe da: Der Druck der Tastatur war zu 
hoch! Denn die nun umgebogene Festplattenklammer dr&uuml;ckt zusammen mit der 
Tastatur auf den Anschluss des Express-Adapters und hat ihn so vom Chip 
gehebel! Zudem muss ich feststellen, dass das Geh&auml;use auch noch einen 
Kurzschluss macht, wenn das Blech zu weit nach unten gebogen wird. Also 
wiedermal Klebeband! So, irgendwas muss ich machen, damit der Adapter nicht 
vom Chip gehebelt wird! Und da f&auml;llt mein Blick in meiner Bastelkiste auf 
einen gro&szlig;en Gummiring aus einem "Competition Pro 5000" Joystick. Und genau 
diesen Ring lege ich jetzt seitlich auf die Adapterplatine. Das Geh&auml;use 
dr&uuml;ckt an der linken und der Gummiring auf der anderen Seite die Platine 
nach unten... kann eigentlich nicht schiefgehen.

Ok! Das h&ouml;rt sich jetzt recht abenteuerlich an und verbiegt das Geh&auml;use 
etwas (f&auml;llt aber garnicht auf), aber die Platine wird dadurch nicht 
besch&auml;digt. Geh&auml;use wieder zu. Rechner an und l&auml;uft! Aber leider nicht 
lange, denn nach dem Setpatch gibt's einen fetten Guru. Aber auch das 
Problem ist schnell gefunden, denn mit Setpatch wird der NSD-Patch geladen. 
Und der vertr&auml;gt sich wohl nicht so gut mit IDE-fix. Setpatch mit NONSD 
gestartet und l&auml;uft. IDE-fix einstellen auf "Pio3" Modus und siehe da, 
statt 1.2MB/s macht die 2,5" Platte jetzt 4.9MB/s!

Na, damit kann man doch leben, oder? :)

Jetzt frage ich mich nur, ob diese 4-fach-Uhrenport-Erweiterung auch noch 
irgendwie passen k&ouml;nnte, damit ich noch ein Soundmodul eingebaut bekomme... 
fehlt nur noch eine BPPC mit passender BVision :) Doch das d&uuml;rfte nicht 
zusammen mit dem Silversurfer passen...

So, und jetzt m&ouml;chte ich gerne wissen, was Ihr so f&uuml;r Abenteuer beim 
Aufr&uuml;sten eures Amigas erlebt habt. Schreibt einfach einen Artikel dar&uuml;ber!

Dirk Wenk &lt;wax@topmail.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
