<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. »Shockwave-Player f&uuml;r Amiga - es gibt ihn doch« (von Thorsten Sch&ouml;lzel)

Schon lange gibt es diesen, doch wurde er niemals richtig ins Rampenlicht 
ger&uuml;ckt, bis ich mich diesem misslichen Umstand annahm. Weitere Details 
finden Sie auf meiner privaten Homepage "www.Thorty.online.de", auf welcher 
Sie sich ferner diesen Player downloaden k&ouml;nnen.

Der "SWFPlayer" kann Macromedia's Flash/Shockwave-Dateien abspielen und 
l&auml;sst sich obendrein in alle g&auml;ngigen Amiga-Browser als externes Plugin 
einbauen. Wie das geht, erl&auml;utere ich weiter unten.

Da der SWFPlayer nur wenige KByte gro&szlig; ist, er&uuml;brigt sich eine 
Installation. Gestartet wird dieser durch Doppelklick auf das Icon, wodurch 
ein Request-Fenster erscheint. Leider hat der Programmierer seit dem 22. 
M&auml;rz 1999 das Programm nicht mehr weiterentwickelt, somit besitzt es weder 
eine GUI noch Routinen f&uuml;r beschleunigte AMIGAs. Wir schreiben das Jahr 
2001, und aus der AWeb-Mailingliste war zu erfahren, dass der Programmierer 
anscheinend sein Programm doch weiterentwickeln will, was uns nur recht 
sein kann. Nach eigener Angabe m&ouml;chte dieser sein Programm auch als 
direktes AWeb-Plugin entwickeln.

Momentan ist der Player in der Version 1.1 verf&uuml;gbar. Er wird als Public 
Domain vertrieben und erweist sich als noch recht »buggy«. Es folgt eine 
Liste von Features, die nicht oder nur unzureichend unterst&uuml;tzt werden:

- Rendering: Kein Anti-Aliasing
- Sound wird nicht ganz unterst&uuml;tzt
- Pixelalphawert wird unterst&uuml;tzt (nur 3.0)
- Morphing (nur 3.0)
- keine "dicken" Linien

Im t&auml;glichen Einsatz erweist sich der SWFPlayer als zum Teil n&uuml;tzlich, aber 
auch st&ouml;rend, insbesondere wenn gr&ouml;&szlig;ere oder mehrere Dateien aufgerufen 
werden, denn daf&uuml;r ist das Programm noch zu unoptimiert. Trotz eines 
68060/50MHz-Prozessors ist es nicht m&ouml;glich, einen Film ruckelfrei 
abzuspielen.
Als Mindestanforderung wird vom Programmierer Folgendes zum reibungslosen 
Betrieb des Players vorausgesetzt:

- 68020-Prozessor mit einem Co-Prozessor
- Kickstart 3.0
- AGA (eine Grafikkarte bringt bessere Ergebnisse, wird aber nicht           
  ben&ouml;tigt)

Wenn schon auf meinem System, das obendrein mit Kickstart 3.1 und einer 
Cybervision64/3D ausgestattet ist, solche SWF-Filme mit Ruckeln &uuml;ber meinen 
Bildschirm flimmern, so m&ouml;chte ich mir nicht ausmalen m&uuml;ssen, wie dieses 
dann auf einem vom Programmierer angegebenen System geschieht. 
Aber was meckere ich eigentlich, als Amiga-User kann man schon froh sein, 
&uuml;berhaupt einen solchen Player zu besitzen, da sind einige andere 
Plattformen weitaus schlechter dran, obgleich mir au&szlig;er der Amiga-Plattform 
keine weitere einf&auml;llt. :-(

Kommen wir damit zur Konfiguration unter AWeb:

shine}-&gt;Einstellungen -&gt; Browsereinstellungen -&gt;Anzeiger

<B>Typ:</B> application / x-shockwave-flash
<B>Erweiterungen:</B> swf
<B>Aktion:</B> Ext. Programm (E)
<B>Name:</B> Programmpfad z.B. -
&gt;System3.1:Internet/AWeb3/Plugins/swfplayer
<B>Argumente:</B> %f

Screenshot:
<IMG SRC="../extra/shockwave_config.jpg" ALT="Screenshot">


Und jetzt zur Konfiguration unter IBrowse:

shine}Preferences -&gt; GUI -&gt;Ext. Viewer

<B>MIME Type:</B> application / x-shockwave-flash
<B>Extension:</B> swf
<B>Action:</B> Ext. viewer
<B>Viewer:</B> Pfad:swfplayer (z.B. C:swfplayer) 
<B>Arguments:</B> %f PUBSCREEN IBrowse MAXWIDTH 640 MAXHEIGHT 480

Man kann und darf nat&uuml;rlich auch die Argumente von AWeb &uuml;bernehmen.


Nachdem wir nun den SWFPlayer in unseren jeweiligen Browser eingebunden 
haben, k&ouml;nnen wir entweder sofort loslegen, weiter unten finden Sie eine 
kleine Auflistung von Homepages, auf den Sie solche Flash/Shockwave-Dateien 
finden k&ouml;nnen, oder aber wir w&auml;hlen ein paar Optionen aus:

<B>FILE:</B> Der Name des abzuspielenden .swf-Files
<B>PUBSCREEN:</B> Der Name des zu &ouml;ffnenden Screens, z.B. f&uuml;r AWeb
<B>MONOSOUND:</B> Spielt Sounds in Mono. (Achtung! Experimentelle Option)
<B>MAXWIDTH:</B> Die maximale Breite des Fensters. Aber Vorsicht, denn 
langsame Amigas k&ouml;nnen bei dieser Option ins Schwitzen kommen und spielen 
das .swf-File nur sehr langsam ab, daher empfiehlt sich eine kleinere 
Gr&ouml;&szlig;e.
<B>MAXHEIGHT:</B> Die maximale H&ouml;he des Fensters. Auch hier gilt dasselbe 
wie schon unter "MAXWIDTH" beschrieben.
<B>ACTIVEPLAY:</B> Spielt das .swf-File nur bei aktivem Fenster, ist 
dieses Fenster nicht mehr aktiv, stoppt das .swf-File. Bet&auml;tigt man dieses 
wieder, so l&auml;uft das .swf-File ab der Unterbrechung weiter.


Beenden wir nun das Thema "Shockwave auf dem Amiga" durch eine ganze Reihe 
von Homepages, auf denen sich zum Teil sehr lustige Flash/Shockwave-Filme 
befinden:

http://www.buffy.com/flash/menu.swf
http://www.buffy.com/flash/finalhomeall.swf
http://www.eye4u.com/home/eye4u_1a.swf
http://www.macromedia.com/shockzone/shockhome.swf
http://www.macromedia.com/de
http://www.spe.sony.com/Pictures/SonyMovies/movies/Fifth/ver_us/home.swf
http://www.spe.sony.com/Pictures/SonyMovies/movies/Starship/img/home01.swf
http://www.spe.sony.com/Pictures/SonyMovies/movies/Starship/img/home02.swf
http://www.spe.sony.com/Pictures/SonyMovies/movies/Starship/img/home03.swf
http://www.Glaspalast.de
http://clevermedia.com/arcade/crapinthewoods.swf

Thorsten Sch&ouml;lzel &lt;amiga-freak@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
