<html>
<head>
  <title>AMIGA</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="amiga3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Offener Brief an die Amiga-Anwender von Jeff Schindler, Amiga, Inc.

&raquo;13.01.1999                                 Open Letter von Jeff Schnindler

&quot;Das Amiga OS hatte schon immer dieses gewisse Etwas gehabt, das noch nie 
von einem anderen Betriebssystem erreicht wurde. Es ist kompakt, effizient 
und Multimedia orientiert.

Wie Dr. Allan Havemose oft sagte: &quot;wir haben genau das richtige getan&quot;. Und 
noch heute kann der Amiga besser und schneller arbeiten, als das derzeit 
dominante Betriebssystem.

Es gab in den letzten Wochen viel Aufregung und auch Bedenken &uuml;ber die 
Zukunft des Amiga. Mit der Bekanntgabe in Deutschland &uuml;ber unseren Partner 
QNX und die Pr&auml;sentation dessen, was diese Komplettl&ouml;sung leisten kann, 
haben wir den raschen Weg in die Zukunft eingeschlagen.

Als Amiga Inc. gegr&uuml;ndet wurde, war unser Ziel die Entscheidung der
bestm&ouml;glichen Richtung f&uuml;r Amiga. Wir wollten:

 * die momentane Entwicklungsrichtung fortf&uuml;hren und eine weitere Version   
   des Betriebssystems herausbringen
 * ein komplett neues Team aufbauen, das das Betriebssystem mit den n&ouml;tigen
   Features austattet, um konkurrenzf&auml;hig zu sein.
 * ein Betriebssystem finden, das die gleichen Ideale und den gleichen      
   Geist wie der Amiga hat.

Wir sind eine Partnerschaft mit QNX eingegangen, um die neue Amiga-
Generation zu erschaffen. Dies hei&szlig;t aber nicht, da&szlig; wir vorhaben, die 
treue Amiga-Gemeinde und die Amiga-Classic User zu vergessen.

Wir werden weiter daran arbeiten, das OS3.5 zu ver&ouml;ffentlichen, aber ebenso 
wichtig ist es, mit der Arbeit an dem neuen Betriebssystem beginnen.
Wir sind dem Amiga zu einer langen und aufregenden Zukunft verpflichtet, 
genau so wie der Amiga-Gemeinde, die diese hervorragende Architektur am 
Leben erhalten hat.

Die Arbeit an 3.5 ist in vollem Gange und wurde NICHT eingestellt! In den 
letzten Wochen haben wir erkannt, da&szlig; das, was wir glaubten von unseren 
Partnern f&uuml;r dieses Projekt zu bekommen, nicht immer das war, was diese 
darunter verstanden, uns zu liefern zu m&uuml;ssen. Wir kommen auf jede einzelne 
Partnerfirma zur&uuml;ck, die f&uuml;r das OS 3.5 zust&auml;ndig ist, um sicherzustellen, 
da&szlig; sie genau an dem arbeiten, was unsere Kunden brauchen. Es ist 
entscheidend, das zu liefern was wir versprochen haben, n&auml;mlich eine 
saubere Komplettl&ouml;sung.

Einige von euch waren sehr besorgt &uuml;ber die Zukunft von Amiga und unseren 
Verpflichtungen gegen&uuml;ber den Entwicklern und der Gemeinde. Bitte seid 
versichert, da&szlig; eure eMails nicht ignoriert wurden. Wir arbeiten sehr hart 
an der Vervollst&auml;ndigung der letzten Phase des 3.5, um die Entwickler-
Programme und die letzten Spezifikationen mit unserem Partner QNX 
fertigzustellen. Wir wollen das robusteste und aufregendste Betriebssystem 
pr&auml;sentieren, das es je gab. Wir werden es schaffen.

Danke f&uuml;r eure Geduld und Unterst&uuml;tzung. Der Amiga ist auf dem richtigen 
Weg und wir hoffen, euch bald beides vorstellen zu k&ouml;nnen - das 3.5 und die 
neue Amiga Generation.

Verliert nicht den Mut - wir sind kurz vor dem Durchbruch.&quot;

Jeff Schindler
General Manager
Amiga Inc.&laquo;

(Quelle: Amiga International)

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="amiga3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
