<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses5.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

4. Imagine meldet sich mit vielen Neuigkeiten zur&uuml;ck

&raquo;Von: Martin McKenzie (CAD-Technologies) und Mike Halvorson (Impulse).

Datum: 2. Januar 1999

Betrifft: Ank&uuml;ndigung Imagine f&uuml;r Amiga

----------

Wir freuen uns mitteilen zu k&ouml;nnen, dass wir eine Vereinbarung &uuml;ber
die Einrichtung einer Unterst&uuml;tzungs-WEB-Site durch CAD-Technologies
f&uuml;r Imagine f&uuml;r Amiga getroffen haben und dass CAD-Technologies auch
den weltweiten(*) Vertrieb f&uuml;r Imagine auf der Amiga-Ebene &uuml;bernehmen
wird.

(*) - Au&szlig;er Nord-, S&uuml;damerika und Japan, wo Impulse weiterhin f&uuml;r den
Vertrieb zust&auml;ndig ist.

----------

Imagine-Anwender auf dem Amiga haben den Vorteil, dass nun eine eigene
offizielle Internet-Unterst&uuml;tzungsstelle existiert. Neueste Nachrichten, 
Produktinformationen, Abrufm&ouml;glichkeiten (downloads), Unterweisungen,
Bestellunterlagen usw. sind zu finden auf:

                 <a href="http://www.cadtech.demon.co.uk/">http://www.cadtech.demon.co.uk/</a>


Wir m&ouml;chten bei dieser Gelegenheit auch betonen, dass Imagine f&uuml;r den
Amiga immernoch aktiv weiterentwickelt wird. Das Constant Update
Program (C.U.P. = Programm f&uuml;r st&auml;ndige Erweiterung) ist im Gange,
wir arbeiten auf die Ausgabe der neuen Version 6 hin. (Derzeitige
Version 5.14).

Die Teilnehmer am C.U.P. hatten den Nutzen von bisher erstellten
Zus&auml;tzen, die folgendes (und mehr) enthalten:

PowerPC-Unterst&uuml;tzung,
Verbessertes GUI,
Optimierte Textur-Prozeduren f&uuml;r CPU's 68040 &amp; 68060,
Verbesserungen der Berechnungs- und Editiermethoden (rendering and
    editing) des Hauptprogramms von Imagine,
Standard-Filerequester,
Unterst&uuml;tzung externer Bild- und Animationsbetrachter mit
    Vorschau-Schnellberechnung in bis zu 24 Bit,
...usw.

Weitere Einzelheiten finden Sie bei der Internetadresse.

Viele Anregungen der Anwender &uuml;ber die Imagine MailingList wurden
schon &uuml;bernommen und weitere k&ouml;nnen in den zuk&uuml;nftigen Ausgaben
zur Programmverbesserung erwartet werden.



Die Kosten f&uuml;r die Aufr&uuml;stung von Imagine sind wie folgt:

Aufr&uuml;stung Version 5 auf Version 6     = $100 (ca. DM 170, Euro  86.92)
Jede andere Imagine-Version auf V 6    = $200 (ca. DM 340, Euro 173.84)
&Uuml;bergang von anderer 3D-Software       = $ Bitte fragen

Bezahlung ist m&ouml;glich mit Kreditkarte, Bargeld, Scheck oder 
Postanweisung.

Vollst&auml;ndige Bestell-Unterlagen finden Sie bei der Internetadresse.


Wir sind sehr erfreut, dass diese Vereinbarung zwischen uns zustande
kam. Diese Partnerschaft wird es uns erlauben, Ihnen, den K&uuml;nstlern,
f&uuml;r die das Beste gerade gut genug ist, die geeigneten Hilfsmittel 
bereitzustellen!



Internetadresse (support site) Imagine f&uuml;r Amiga:
<a href="http://www.cadtech.demon.co.uk/">http://www.cadtech.demon.co.uk/</a>

Fragen oder Kommentare senden Sie bitte mit eMail an:
<a href="mailto:sales@cadtech.demon.co.uk">sales@cadtech.demon.co.uk</a>

Impulse (America &amp; Japan distribution)
<a href="http://www.coolfun.com/«">http://www.coolfun.com/«</a>

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses5.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
