<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Haage &amp; Partner-News

Und hier wieder die neuesten Meldungen des Unternehmens:

&raquo;06-Jan-99: STFax 3.7 Update

Ab sofort ist die neue Version von STFax 3.7 verf&uuml;gbar. Support. Dazu gibt
es auch die aktuelle deutsche Locale und eine neue Anleitung.


06-Jan-99: Amiga Univers Awards

NetConnect bekam vor kurzem die Auszeichnung 'Kommerzielles Programm 1998'
von Amiga Universe. Vaporware und Haage&amp;Partner GmbH bekamen zudem die
Auszeichnung 'Amiga Entwickler 1998'.


14-Jan-99: Landessprachliche Versionen von ArtEffect und AmigaWriter

Um die Nutzung unsere Bestseller ArtEffect und AmigaWriter auch im Ausland
zu gew&auml;hrleisten haben wir die Bedienoberfl&auml;che (GUI) in weitere Sprachen
&uuml;bersetzt. ArtEffect steht jetzt in 12 und AmigaWriter in 8 Sprachen zur
Verf&uuml;gung. Weitere &Uuml;bersetzung sind in Arbeit und werden in K&uuml;rze zur
Verf&uuml;gung gestellt werden k&ouml;nnen.


26-Jan-99: Neue Dateien f&uuml;r STFax

Ein neuer PrintManager, Icons und zwei ARexx-Scripte. Zudem gibt es auch
eine neue Demoversion STFax Pro 3.7. 


26-Jan-99: Neue W&ouml;rterb&uuml;cher f&uuml;r AmigaWriter

Die Korrekturw&ouml;rterb&uuml;cher sind jetzt auch f&uuml;r die Sprachen Italienisch,
Franz&ouml;sisch, Schwedisch, Niederl&auml;ndisch, D&auml;nisch und Tschechisch verf&uuml;gbar.


27-Jan-99: Nr. 23 in Counter-Hitliste

Da die Zugriffszahlen in letzter Zeit sehr stark angestiegen sind, befinden
wir uns nun auf Platz 23 der Hitliste von WebHits. Zusammen mit der
Amiga-Newsseite von Petra Struck vertreten wir hier sehr eindrucksvoll den
AMIGA unter den Top100 :)


27-Jan-99: Wer wird der 300.000ste Besucher???

In den n&auml;chsten Tagen d&uuml;rfen wir den 300.000sten Besucher auf unserer
Homepage begr&uuml;&szlig;en. Das mu&szlig; nat&uuml;rlich gefeiert werden. Wenn sich der 300.000
Besucher mit einem Beweis-Screenshot und einem Foto bei uns meldet, dann
erh&auml;lt er ein &Uuml;berraschungsgeschenk...


27-Jan-99: &Uuml;berarbeitete Review-Sektion

Der Bereich der Presseberichte &uuml;ber die von H&amp;P vertriebenen Produkte wurde
aktualisiert und &uuml;berarbeitet. Hier findet man die nationalen und
internationalen Meinungen und Auszeichnungen.&laquo;

(Quelle: Haage &amp; Partner)

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="diverses1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="diverses3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
