<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot; 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: <a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


1. Beantwortung von J&uuml;rgen K&auml;ssmanns Internet-Fragen (von Holger Jeromin)

&raquo;Um mit dem Amiga ins Internet zu kommen, braucht man
1. Internetvertrag
2. Modem
3. TCP/IP Stack
4. Benutzersoftware


1. Internetvertrag

Entweder &uuml;ber ne Uni, T-Online oder sonstigen Provider. Es geht auch
teilweise &uuml;ber die neuen Telefongesellschaften, ohne vorherige Anmeldung. 
Hab ich aber nicht ausprobiert.
(Arcor und ViagInterkom machen das auf jeden Fall)
F&uuml;r ViagInterkom ist es in AmigaAktuell 1/99 beschrieben.

Dabei m&uuml;sst ihr aber bedenken, da&szlig; die Demoversion von IBrowse keine
<a href="https://">https://</a> Verbindungen aufbauen kann. Also auf nen PC ausweichen, oder eben
Voyager benutzen.

2. Modem

Ein 14.4 er ist trotz des langsamen Internets wirklich nur zum kurzen Email
abholen zugebrauchen.

Heutzutage sollte man gleich N&auml;gel mit K&ouml;pfen machen und ein schnelles 56k
Modem kaufen (Wichtig: Es mu&szlig; dem Standart V.90 entsprechen). 

Das Modem wird einfach an die serielle Schnittstelle angeschlo&szlig;en. Die
interne Serielle Schnittstelle ist aber teilweise etwas langsam. Aber f&uuml;r
den Anfang sollte es reichen.

3. TCP/IP Stack

Da gibts mehrere M&ouml;glichkeiten: Miami, Genesis, AmiTCP und noch einige
kleinere, nicht so verbreitete Stacks.
Genesis ist eine Weiterentwicklung auf das &auml;ltere AmiTCP. Miami ist schon
lange in der Entwicklung und ist meiner Meinung nach der beste Stack.
AmiTCP hat leider keine grafische Oberfl&auml;che und ist deshalb nicht zu
empfehlen. Es wird glaub ich auch nicht mehr verkauft.

Wer jedoch bei diesen genannten Stacks bleibt, wird auch mit moderner
Software keine Probleme haben.

4. Benutzersoftware

Da ist als erstes der Browser. 
Es gibt IBrowse, Voyager und AWeb. Die Produkte kosten alle um die 100 DM.
IBrowse zeigt die Seiten eigentlich so an, wie die Konkurrenten auf dem PC.
AWeb hat den Vorteil, da&szlig; es als einziges JavaSkript v1.1 integriert hat.
(Standart ist leider v1.2)
Voyager ist klein und schnell. 
Da es von allen Produkten Demoversionen gibt, solltet ihr einfach mal die
Demos testen und dann erst ein Browser kaufen.

Als Mailer w&uuml;rde ich YAM (YetAnotherMailer) empfehlen, da er Freeware ist
und sehr gut ist. Die aktuelle Preview von der Version 2.0 l&auml;uft auch sehr
stabil.   <a href="http://www.yam.ch">http://www.yam.ch</a>

Als ftp-Programm ist AmFTP sehr gut. Solch ein Programm ist aber nicht 
immer notwendig. (Aber z. B. zum Upload euerer wundersch&ouml;nen Homepage...)

Desweiteren gibt es noch AmIRC f&uuml;r InternetRelayChat.

ICQ schein jeder Surfer installiert zu haben. Dies ist jetzt auch auf dem
Amiga m&ouml;glich. Mit dieser Software ist es m&ouml;glich zu sehen, ob seine 
Freunde
(wenn sie auch ICQ benutzen) gerade auch durch WeltWeiteWeb surfen.
Eine Portierung f&uuml;r den Amiga steht der PC-Version kaum noch nach.

Die Programme Genesis, Voyager, AmIRC, AmFTP, MicroDotII 
(Mailer&amp;Newsgroups)
AmTelnet (f&uuml;r Anf&auml;nger kein Mu&szlig;), AmFinger (f&uuml;r Anf&auml;nger kein Mu&szlig;)
gibt es auch als Netconnect2 CD. Diese CD sich zukaufen, ist insgesamt
billiger, als sich die einzelnen Sharewareprogramme zu registrieren.
Der Preis f&uuml;r die komplette NetConnect-Suite liegt bei 189 DM.

Hier auch noch zwei Links:
<a href="http://www.haage-partner.com/nc_ft_d.htm">http://www.haage-partner.com/nc_ft_d.htm</a>   NetConnect2
<a href="http://www.BuiltWithAmiga.org/">http://www.BuiltWithAmiga.org/</a>             Links und Vergleiche zu 
Programmen.

Wenn ihr weiterhin Fragen habt, dann fragt: <a href="mailto:jeromin@hitnet.rwth-aachen.de">jeromin@hitnet.rwth-aachen.de</a>

Holger Jeromin&laquo;

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel4.html"><img src="prev.gif" alt="PREV" border=0></a><a href="forum2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
