<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Vorstellung der neuen Preise

Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


VMC - Harald Frank - hat die ZorroII(I)-Schnittstellenkarte Hypercom 3+ f&uuml;r 
das Gewinnspiel zur Verf&uuml;gung gestellt:

<a href="hypercom3+.jpg">Screenshot</a> (ab OS 3.0; JFIF/JPEG-Datatype mu&szlig; installiert sein)

&raquo;Wir treffen Ihre Bed&uuml;rfnisse

Unsere superschnelle HyperCOM 3+-Schnittstellenkarte wurde speziell f&uuml;r 
Benutzer entworfen, die mehr als eine serielle oder parallele Schnittstelle 
ben&ouml;tigen. Durch den auf Hochleistung getrimmten Treiber bekommen Sie die 
maximal m&ouml;gliche Geschwindigkeit beim Senden und Empfangen.

Da&szlig; in unseren Treibern Jahre an Erfahrung stecken, werden Sie sehr schnell 
an der geringen CPU-Belastung merken. Ein Umschalten des Bildschirms 
erzeugt nie wieder CRC-Fehler bei Z-Modem.

Wenn Sie diese superschnelle Schnittstelle einmal benutzt haben, werden Sie
diese Geschwindigkeit und geringe CPU-Belastung nicht mehr missen wollen.

Unerreichte Performance

 * Ultra high-speed bis maximal 460.800 Bits pro Sekunde (~44Kb)
 * Zwei mal Term 4.7 auf Workbench, Nullmodemverbindung 460.8KBit, 1Kb Z-   
   Modem ~25.000 CPS
 * Zwei mal Term 4.7 auf Workbench, Nullmodemverbindung 460.8KBit, 8Kb Z-   
   Modem ~43.000 CPS (mit Executive im Hintergrund)
 * Der Bidirektionale Paralellport kann mit bis zu 800 Kb pro Sekunde Daten
   senden

Intelligente Features

 * Z-Modem optimierte Sendefunktionen bringen bis zu 20% mehr               
   Geschwindigkeit
 * PPP und TCP/IP optimierte Sende und Empfangsroutinen beschleunigen Ihre
   Internetverbindungen
 * Ab Version 3.00 integrierter PC-Maus-Treiber f&uuml;r jede device-Unit (noch  
   nicht verf&uuml;gbar)
 * Minimale Interruptbelastung durch den integrierten Hardware FIFO.

Kostensparende Geschwindigkeit, Konnektivit&auml;t und Flexibilit&auml;t

 * Holt das maximale an Geschwindigkeit aus jedem Modem oder ISDN-
   Terminaladapter.
 * Das Ausdrucken von Dokumenten oder Grafiken geht bis zu vier mal         
   schneller als am internen Parallelport !
 * Die ideale und ma&szlig;geschneiderte Schnittstellen-L&ouml;sung f&uuml;r jeden          
   Heimanwender.
 * Durch modulare Treiber skalierbar auf bis zu 5 HyperCOM3+ pro Rechner.

Technische Daten

 * Interface : Zorro II/III
 * Schnittstelle : 2 * RS232 SUBD-9/25 (~30-35cm Flachkabel + Halteblech)
 * Schnittstelle : 1 * LPT Bidirektional PC/AT SUBD-25 (~30-35cm Flachkabel  
   + Halteblech)
 * Flu&szlig;kontrolle : Sofware xON/xOFF und Hardware RTS/CTS
 * Geschwindigkeit: Minimal 50, bis maximal 460.800 Bits pro Sekunde
 * Serieller FIFO : Jede Schnittstelle hat 16 Byte Sende / 16 Byte Empfangs  
   FIFO

Hardware-Kompatibilit&auml;t

 * Turbokarten: Kompatibel zu allen bekannten Modellen
 * Serielle : Amiga interne Serielle kann gleichzeitig und weiterhin        
   genutzt werden
 * Parallel : Amiga interne Parallele kann gleichzeitig und weiterhin       
   genutzt werden
 * Tower : Kompatibel zu RBM, Eagle, Micronik und Draco Tower-L&ouml;sungen

Device-Kompatibilit&auml;t

 * Kompatibel zu allen Programmen, die sich an die RKM-Richtlinien halten.

&Auml;nderungen ohne Vorank&uuml;ndigung vorbehalten. Alle genannten Warenzeichnen 
sind Eigentum der entsprechenden Firmen.&laquo;

VMC - Harald Frank
Ringstr. 26
68789 St. Leon-Rot
Deutschland

Telefon: 06227/88046-0 13-17 Uhr
Telefax: 06227/88046-4 24 Stunden
Mailbox: 06227/88046-4 24 Stunden
E-Mail: <a href="mailto:info@vmc.de">info@vmc.de</a>


Frank Weber hat sein Programm CDCat f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&raquo;CDCat (MUI) ist DER CD-ROM-Katalogisierer f&uuml;r den Amiga. Dar&uuml;ber hinaus 
k&ouml;nnen aber auch s&auml;mtliche Festplatten, Disketten und Verzeichnisse (z.B. 
mit vielen Grafiken) archiviert werden.

Es eignet sich auch besonders f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-
Beschreibungen mitber&uuml;cksichtigt werden. CDCat besitzt einen superschnellen 
Suchmodus (85% Inline-Assembler!), au&szlig;erdem k&ouml;nnen mit dem &quot;Browser&quot; 
archivierte CDs verzeichnisweise durchst&ouml;bert werden, ohne eingelegt zu 
sein.

Direkt aus CDCat heraus k&ouml;nnen Archive entpackt, Bilder angezeigt werden 
etc. Dabei sind alle Programme frei konfigurierbar.

Weitere Features: XPK-Unterst&uuml;tzung, Merkbrett zur Verwaltung gefundener    
                  Dateien, DiskIDs zur schnellen Identifizierung der CDs,   
                  usw...

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar. Aktuell ist 
Version 2.2. Ein Test von CDCat l&auml;sst sich unter 
<a href="http://www.amigaworld.com/support/cdcat/C_test_de.html">http://www.amigaworld.com/support/cdcat/C_test_de.html</a> abrufen.

In K&uuml;rze wird die Version 3.0 ercheinen, u.a. mit PowerPC-Support, Katalog-
Manager zum Reorganisieren der Kataloge, Filterfunktion etc.

Der Autor ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland

E-Mail: <a href="mailto:frank@cc86.de">frank@cc86.de</a>                                                     &laquo;


Peter Elzner hat sein Programm ManiacBall f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;ManiacBall basiert auf dem klassischen Breakout, bei dem mit einem 
Schl&auml;ger und einem Ball Steine getroffen werden m&uuml;ssen und diverse Extras 
das Leben erleichtern. ManiacBall bietet als Erweiterung die M&ouml;glichkeit 
von mehreren Schl&auml;gern und mehreren B&auml;llen auf einem Spielfeld, ein 
lustiger Zwei-Spieler-Modus (gleichzeitig!) und jede Menge Extras, wie z.B. 
Laser, Schutzschild und vieles mehr. Wem die vorhandenen Level zu 
langweilig werden, kann sich mit dem Leveleditor auch eigene Spielstufen 
erschaffen.
Voraussetzungen: Amiga mit Kick2.0, 1MB Speicher.
          Grafikkarten werden unterst&uuml;tzt, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 25 Level, Editor eingeschr&auml;nkt
Registrierte Version: 25 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Andreas Etzrodt hat sein Programm HomeCINEMA f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:

&raquo;HomeCINEMA ist eine Video-Datenbank, die endlich einmal wirklich
EINFACH zu bedienen ist. Sie ist nicht &uuml;berladen mit Funktionen,
bietet daf&uuml;r aber alle wesentlichen Funktionen, die man sich
verspricht. Eine Demoversion ist unter: <a href="http://sharksoft.notrix.de">http://sharksoft.notrix.de</a>
zu finden.&laquo;


Des Weiteren hat Thomas Hasemann die Bildbearbeitung &quot;ImageFX&quot; f&uuml;r das 
Gewinnspiel zur Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
