<html>
<head>
  <title>Spieleteil</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele4.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

3. Vorwort
----------

Hi!

Ich begr&uuml;&szlig;e Euch zu einer neuen Ausgabe des AMIGA aktuell Spieleteils.
Diesen Monat gab es wirklich viele Neuigkeiten, nicht nur durch die
Ver&ouml;ffentlichung der Hexen und Heretic Quelltexte. Viele neue Spiele
wurden angek&uuml;ndigt, aber auch einige gestrichen. Ihr k&ouml;nnt Euch 
bestimmt noch an mein Vorwort vom letzten Monat erinnern...ich hatte
die Raubkopierer angegriffen und am Beispiel von Titan Computer
erl&auml;utert, wie ernst die Lage ist. Tja, anscheinend ist eingetreten,
was viele bef&uuml;rchtet haben: Es grasieren Ger&uuml;chte, nach denen Titan
Computer einige namhafte sich in Entwicklung befindende Spiele
gestrichen habe, z.B. Shadow of the 3rd Moon 2 und Total Combustion.
Dies ist wohl die schlechteste Meldung des Monats :-((

Mir ist auch aufgefallen, dass st&auml;ndig neue Spiele angek&uuml;ndigt
werden, aber sogut wie keine erscheinen!? So waren z.B. f&uuml;r
Ende 1998/Anfang 1999 &uuml;ber 20 neue Spiele angek&uuml;ndigt, aber es
sind sogut wie keine erschienen. Woran mag das liegen? Der Markt
ist noch gro&szlig; genug. Allein die Tatsache, dass &uuml;ber 8.000 PowerPC
Karten verkauft wurden, d&uuml;rfte doch ein Grund sein, Spiele zu
ver&ouml;ffentlichen. Auch Demoversionen wurden au&szlig;er Marblelous 2
keine ver&ouml;ffentlicht. So kann ich Euch diese Ausgabe leider kein
Review bringen, sondern nur ein sp&auml;rliches Preview zu Marblelous 2.

Eine weitere Tatsache, von der dieser Monat gepr&auml;gt ist, scheint
die Suche nach Entwicklern. Seien das Programmierer, Grafiker
oder Musiker. Verschiedene Gruppen suchen nach f&auml;higen Entwicklern
um ihre Projekte zu verwirklichen.

Diesen Monat gibt es erstmals wieder Charts, allerdings keine
Lesercharts, sondern die GTI Verkaufscharts. Au&szlig;erdem habe ich
diesen Monat ein Interview mit Digital Images f&uuml;r Euch. Wenn`s
schon keine Review`s gibt - dann wenigstens ein Interview!

So. Jetzt viel Spa&szlig; mit den News und schreibt mir mal!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele2.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele4.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
