<html>
<head>
  <title>Spieleteil</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

6. Interview: Digital Images
----------------------------

Interview mit Stuart Walker von Digital Images, der Firma die Wipeout 2097
f&uuml;r den Amiga umsetzt und viele weitere Spiele in der Mache hat, obwohl
sie erst kurz seit kurzem im Amiga Markt agiert.

AMIGA aktuell: Deine Firma ist recht neu auf dem Amiga Markt. Warum hast Du  
               Dich entschieden Spiele f&uuml;r den Amiga zu produzieren statt   
               f&uuml;r PC?

Stuart:        Ich habe meinen Amiga schon lange besessen und benutzt. Die  
               letzten Jahre, schien der Markt immer schlechter zu werden.  
               Ich wollte mithelfen diesen Markt wiederzubeleben und ihn    
               zur&uuml;ckzubringen, zu etwas, dass jeder wieder etwas n&uuml;tzt.    
               Wenn man hochqualitative Titel ver&ouml;ffentlicht, k&ouml;nnen die    
               Leute wieder zum Amiga blicken und sagen, &quot;Hey, der Amiga    
               ist jetzt wirklich gut! Ich will einen!&quot; Die Hauptsache,
               die eine Plattform ben&ouml;tigt, um Erfolg zu haben, sind gute   
               Software Titel. Wenn es tolle Spiele am Amiga gibt, werden   
               Leute auf den Amiga umsteigen. Ich habe e-mails von Leuten   
               bekommen, die mir erz&auml;hlten, dass sie auf den Amiga          
               umstiegen, nachdem sie unsere Pl&auml;ne h&ouml;rten.
               Wir m&uuml;ssen in die richtige Richtung gehen!


AMIGA aktuell: In den letzten Monaten wurden viele Ger&uuml;chte &uuml;ber Dich und   
               Deine Firma erz&auml;hlt. Kannst Du hier deshalb mal klarstellen  
               a) wieviele Leute Du besch&auml;ftigst und was sie arbeiten b) ob  
               sie Vollzeit f&uuml;r Digital Images arbeiten?

Stuart:        Als Digital Images gegr&uuml;ndet wurde, war es nur ich, aber     
               &uuml;ber das letzte Jahr sind wir auf 21 Leute gewachsen.        
               Verschiedene Leute arbeiten Vollzeit f&uuml;r mich, aber andere   
               arbeiten auch Anderes zwischendurch. Wir suchen noch mehr    
               Leute, die uns helfen.
 

AMIGA aktuell: Gibt es bekannte Amiga Programmierer, die Deiner Firma       
               helfen, Spiele zu entwickeln?

Stuart:        Sicher gibt es welche! Wir haben Leute wie Peter McGavin,    
               der Sch&ouml;pfer von ADoom und Ruben Alcaniz, der auch Tales of  
               the Heaven schreibt. Wir haben auch eine gro&szlig;e Zahl von      
               Leuten, die bekannt sein werden, nachdem die Amiga           
               Gemeinschaft gesehen hat, welche Art von Arbeit sie machen.
                                                                

AMIGA aktuell: W&uuml;rdest Du eine Fragen &uuml;ber den PowerPC beantworten: a)      
               welches PPC OS ziehst Du vor - WarpOS oder PPC.library? b)   
               was denkst Du &uuml;ber Warp3D/die PicassoIV Voodoo Erweiterung?

Stuart:        Wir werden WarpOS von Haage&amp;Partner unterst&uuml;tzen. Warp3D ist
               exzellent! Warp3D ist sehr schnell und macht verschiedene
               Sachen viel leichter. Die Voodoo Erweiterung ist grossartig!
               Es ist uns sehr angenehm, dass es genug Vorbestellungen gab.
               Jetzt wird der Amiga eine Art und Weise der grafischen Power
               haben, dass PC Besitzer dar&uuml;ber staunen k&ouml;nnen.
   

AMIGA aktuell: Welche Spiele plant Digital Images in naher Zukunft zu
               ver&ouml;ffentlichen und was ben&ouml;tigen sie als                    
               Mindestkonfiguration?

Stuart:        Space Station 3000 wird die n&auml;chsten Monate ver&ouml;ffentlicht
               werden. Es wird mindestens einen Amiga mit entweder AGA oder
               Grafikkarte, 4MB Fast RAM, CD-ROM Laufwerk ben&ouml;tigen. Die
               Festplattenanforderungen werden bald ver&ouml;ffentlicht. Space
               Station 3000 kann vorbestellt werden von Blittersoft`s 
               (unser Publisher) Homepage <a href="http://www.blittersoft.com">http://www.blittersoft.com</a> oder
               per Telefon +44 (0)1908 261466. Wipeout 2097 wird einen      
               Amiga mit AGA oder Grafikkarte, PPC, CD-ROM Laufwerk,        
               ungef&auml;hr 16MB Fast RAM ben&ouml;tigen. Auch hier werden wir die   
               Festplattenanforderungen bald ver&ouml;ffentlichen. Kijitsu       
               Warriors und Digital Soccer sind auch bald auf dem Weg. Ihre  
               System Anforderungen werden zu sp&auml;terem Zeitpunkt            
               bekanntgegeben.


AMIGA aktuell: Wie lang hast Du schon einen Amiga? Was siehst Du die        
               Zukunft unseres Computers?

Stuart:        Ich habe einen Amiga seit 1989, als ich einen A1500 bekam.   
               Ich war wirklich begeistert &uuml;ber die Power des Computers     
               sowie &uuml;ber die Qualit&auml;t der Software. Die Zukunft des Amigas  
               sieht sehr positiv aus und ich bin mir sehr sicher, dass     
               Amiga International den Super Amiga zustandebringt. Er hat   
               die Spezifikationen, die jeden anderen Computer alt aussahen  
               lesen und das noch zu einem g&uuml;nstigen Preis!


AMIGA aktuell: Stuart, danke f&uuml;r das Interview!

Stuart:        Gern geschehen!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele5.html"><img src="prev.gif" alt="PREV" border=0></a><a href="spiele7.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
