<HTML>
<HEAD><TITLE>AmZeiger 06/97 - Interview mit Carsten J.</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>Interview</U></H1>mit<BR><A HREF="mailto:Carsten_J@BBrandes.berlinet.de">Carsten Jahn</A><P></CENTER>

<B>Madhouse</B> ist ein bekanntes und leistungsf&auml;higes Blankerpaket f&uuml;r
den Amiga. Am 27.05.97 f&uuml;hrte ich mit Carsten Jahn, einem der beiden
Madhouse-Autoren das Gespr&auml;ch per Chat.<P>

<B>Danke</B> an den CoSysop der BBrandes bzw. dem AmZ-Redakteur
Andreas Schlick, der den Spezialchat einbaute und freischaltete.
Er war beim Chat anwesend.<P>

<B>AmZ:</B> AmZeiger (Gregor Franz)<BR>
<B>CJ :</B> Carsten Jahn<BR>
<B>COSYS:</B> CoSysop (Andreas Schlick)<BR><br>

<TABLE BORDER=1>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Du bist einer der Autoren des Blankerprogrammes MadHouse. Wer ist noch beteiligt und wie sieht eure Aufgabenverteilung aus ?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Jepp...also bitte Madhouse statt MadHouse :-))<BR>
    Okay, also da ist noch "Aicke Schulz" (m&auml;nnlich, es hat ihn schon jemand
    mit Fr&auml;ulein angeschrieben) beteiligt und das wars dann schon.<P>
    Arbeitsteilung: Also urspr&uuml;nglich war es so geplant, da&szlig; ich die
    Hauptprogramme und Aicke die Blanker schreibt. Das hat sich dann
    etwas verlagert. Im Moment sind die H&auml;lfte der Blanker von Aicke.
    Ich mache noch die Anleitungen Deutsch/Englisch und die
    Registrationen, au&szlig;erdem einen Gro&szlig;teil vom Umgang mit den
    Betatestern.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Und das Hauptprogramm?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Die Programmierung macht immer jeder alleine, pro Executable. Also
     wir schreiben nicht zusammen an den selben Programmen. Das w&auml;re zu
     kompliziert, au&szlig;erdem kann Aicke kein C (Madhouse / meine Blanker
     sind in C geschrieben, wenn ich viele Nerven habe, auch C++). Nur
     die Shared-Library hab ich in E gemacht, aber das ist was anderes.<P>

     Wir sprechen aber die Konzepte miteinander ab, und die Gestaltung
     und so, und geben uns gegenseitig Ratschl&auml;ge...... :-)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was ist das besondere an Madhouse? Hat er anderen Amiga-Blankern
     etwas voraus?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Das Besondere ist, da&szlig; Madhouse nicht nur die mitgelieferten
     "Madhouse-Blanker" ansprechen kann, sondern auch die Blankermodule
     von Blitz-, Garshne- und Swazblanker. Das kam daher, weil ich es
     zu doof fand, alles nachzuprogrammieren (die anderen Leute schauen
     ja immer m&auml;chtig voneinander ab).<P>

     Au&szlig;erdem ist mir nicht bekannt, da&szlig; ein anderer Blanker eine so
     gute Soundunterst&uuml;tzung hat. Madhouse spricht jeden ARexx-f&auml;higen
     Modulplayer an. Den Rest der Features hab ich schon fast
     vergessen... :-) Naja, bei den Blankern geben wir uns immer M&uuml;he,
     da&szlig; sie m&ouml;glichst weit konfigurierbar sind.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was hast Du/habt Ihr evtl. vorher programmiert?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Naja, mein erster Compi war ein A500, und da hab ich in Amiga-Basic
     so ein paar kleinere Sachen gemacht. Als der kaputt ging :-(..., da
     war mein erstes Programm in C auch schon der FlyingToaster-Blanker,
     den ich dann in Madhouse eingebaut habe. Also noch nichts anderes
     vor Madhouse ver&ouml;ffentlicht.<P>

     In GFA-Basic hab ich damals noch `nen Icon-Editor gemacht, aber da
     gibt's heute besseres. Zwischendurch ist noch ein Snake-Spiel
     entstanden, auf MUI-Basis, aber das habe ich noch nicht fertig.
     Ich mu&szlig; auch sagen, viel mehr Zeit bleibt kaum.<P>

     Bei Aicke ist es &auml;hnlich, ich habe ihn eigentlich erst aufs
     Programmieren gemacht und er hat damals noch ein paar Spiele in
     AMOS (w&uuml;rg) angefangen, aber auch nicht fertig gemacht. Danach nur
     noch Madhouse. Er ist auch nicht so ein richtiger Programmier-Fanatiker... :-)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Madhouse ist nur in einer eingeschr&auml;nkten Version frei erh&auml;ltlich.
     Habt Ihr Erfolg in Bezug auf Registrierungen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Also, am Anfang ging das ziemlich schleppend (ein dreiviertel Jahr
     in etwa, seit dem es Shareware war). Jetzt kommt so in etwa eine
     bis zwei pro Woche. Immer, wenn eine neue Release drau&szlig;en ist, h&auml;uft
     sich das, dann ebbt es wieder ab. Also, davon leben kann man
     nat&uuml;rlich nicht. Aber es ist eine zus&auml;tzliche Motivation, au&szlig;erdem
     bekommt man immer nette Post aus dem Ausland (Spitzenreiter waren
     1x Brasilien und 1x Neuseeland... naja und schon eine weibliche
     Userin ist registriert...hihi... naja mit Frauenquote ist nicht...)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wie kamt Ihr eigentlich auf den Namen Madhouse?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Gut, da&szlig; Du das fragst....<P>

     Also, den Namen hat sich Aicke ausgedacht. Es war vorher noch
     "Black Hole" im Gespr&auml;ch (also Parodie auf den damals vorherrschenden
     Superdark). Aicke hat einfach im Dictionary gebl&auml;ttert, und etwas
     Brainstorming gemacht... so kamen wir dann darauf. Es hat auch einen
     Hintergrund, falls man das interpretieren m&ouml;chte. Also Madhouse hei&szlig;t
     ja Irrenhaus, und die Irren sind dann halt die Blanker...<P>

     Ich wei&szlig; nicht, wie der Name von einem Muttersprachler aufgefa&szlig;t
     wird. Da haben wir uns damals keine richtigen Gedanken gemacht.
     (Commodore hat ja auch den VIC 20 nach VCX 20 umbenannt, weil es in
     England was anr&uuml;chiges hei&szlig;t...)<P>

     Aber alles in allem geht das ganz gut damit, nur da&szlig; jeder immer
     MadHouse statt Madhouse schreibt. Hat auch die Amiga Computing
     gemacht (da war mal ein kurzer Artikel zur Heftdiskette.)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Also schon Pressestimmen ;).</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Ja, die eine...</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Auf welchem Amiga programmierst Du? Was ist Deine Meinung zur
     gegenw&auml;rtigen Amiga-Situation und der GW2000-&Uuml;bernahme?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Als der 500er in Schrott ging, hab ich dann dank st&auml;rkstem Sponsoring
     einen A4000 bekommen, den ich jetzt auch um eine 040er-Karte
     erweitert habe (Gru&szlig; an Robert...)<P>

     Situation vom Amiga: Naja, als Commodore pleite ging, hab ich mir
     noch die meisten Sorgen gemacht. Jetzt ist GW2000 schon die dritte
     Firma, wenn ich richtig mitgez&auml;hlt habe, und es macht mich nicht mehr
     so hei&szlig;. Ich hoffe, da&szlig; es auch ohne richtige Herstellerfirma etwas
     weitergeht. Dabei denke ich halt so an Shareware/Hobbyprogrammierer,
     die ja insgesamt auf dem Amiga gut sind und an Projekte, wo andere
     Hersteller es mit eigener Hardware schaffen, was weiterzumachen
     (z.B. Eagle oder so.) Aber da kenne ich mich nicht so genau aus.<P>

     Jedenfalls wird auf die Dauer bestimmt ein richtiger Hersteller
     n&ouml;tig sein. Hoffentlich vergeben die dann Lizenzen, damit nicht
     alles an einem Faden h&auml;ngt. Entwicklungen wie den PowerPC begr&uuml;&szlig;e
     ich nat&uuml;rlich, weil die Motorola-CPU dann doch mal auslaufen wird.
     Aber da&szlig; es immer Ger&uuml;chte gibt, Maxon h&auml;tte sich vom Amiga
     abgewendet und andere, nervt mich schon. Abwarten...</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Hast Du/habt Ihr evtl. neue Projekte oder steht die Weiter-
     entwicklung von Madhouse im Vordergrund?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Naja, es gibt immer kleinere Tools, die ich auch mal selber
     br&auml;uchte (und dann schreiben wollte), aber ich habe noch zuviel mit
     Madhouse vor. Einerseits stapelt sich die ToDo-Liste, auch gibt es
     noch ab und zu Fehler, die ich beseitigen m&ouml;chte (dank der Betatester
     ist Madhouse aber schon aus den Kinderschuhen raus). Ich habe noch
     einiges im Hinterkopf, was ich einbauen m&ouml;chte, erstmal sind aber
     noch weitere Blanker geplant. Zwei neue hab ich auch schon fertig.<P>

     Bei Aicke wird sich wohl erst mal ein Jahr nichts tun (er geht zum
     Bund, ich mache Zivildienst, da komme ich Mittags raus). Naja,
     eigentlich hat Aicke das bis jetzt auch schon etwas sporadischer
     gemacht. Aber es stand in letzer Zeit auch zuviel mit Schule an...
     [&uuml;brigens, ich hab `nen Schnitt von 2,0 geschafft!]</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Und was f&uuml;r Features sollen zuk&uuml;nftig noch kommen? Wann gibt es
     neue Versionen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Also, nachdem es mehr Blanker gibt (weil da ist Madhouse noch etwas
     schwach...) will ich noch folgendes einbauen:<P>

     Monitore mit Powermanagement unterst&uuml;tzen...<BR>
     Executive-Unterst&uuml;tzung f&uuml;r CPU-Messung (ist schon eingebaut)
     Gaaanz wichtig: eine M&ouml;glichkeit, das Blanken einzuschr&auml;nken / zu
     unterbinden, wenn bestimmte Programme laufen (z.B. Term oder ein
     inkompatibles Spiel)    ...ja das war so das Wichtigste...<P>

     (Aber sollte ja eigentlich ne &Uuml;berraschung werden...naja egal)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Die &Uuml;berraschung ist dann das Ver&ouml;ffentlichungsdatum ;)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Ach halt. Ja genau, das hatte ich noch vergessen. Noch zum
     Erscheinungsdatum: ich hoffe, da&szlig; die Version 2.6 (also die n&auml;chste)
     im Juni/Juli im Aminet ist. Allerdings sage ich gleich, da&szlig; eine
     Zeitplanung bisher kaum geklappt hat. Wir &uuml;berziehen da gerne mal
     um drei Monate. :-)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>In der Anleitung zu Madhouse ist mir das Vorwort mit der lustigen
     Geschichte im Slang der neuen Rechtschreibreform aufgefallen.
     Beinahe schon alleine den Schnupperdownload wert ;)<BR>
     Wie stehst Du zu der neuen Rechtschreibreform ?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Ja, die Anleitung hat mich oft genervt, und da brauchte ich
     Abwechslung. Ich stehe der Rechtschreibreform nicht feindlich
     gegen&uuml;ber. Es ist ja teilweise sehr am&uuml;sant und ich liebe witzige/
     avantgardistische Texte irgendwie. Leider hat man einerseits das
     `&szlig;` weggelassen, und nun hei&szlig;t `da&szlig;` jetzt `dass`.  Hmja, also ich
     bin auf jeden Fall f&uuml;r eine Unterscheidung zwischen den `das`, weil
     es das Lesen erleichert. Aber wenn man schon das `Eszett` weghaut,
     h&auml;tte man gleich die restlichen deutschen Umlaute wegstreichen
     sollen, teilweise gibt das ja Probleme auf dem Computer ;-)
     (und den PD-Schrifts&auml;tzen...)<P>

     Aber ansonsten. `Fonotechniker...` ist doch lustig!</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wegen Umlauten und dem Computer m&uuml;&szlig;ten wir eigentlich gleich
     Englisch einf&uuml;hren? ;)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Ja... es gibt schlimmere Sprachen als Deutsch... aber ich finde
     Englisch sowieso praktischer.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Schon an unseren eMail-Adressen kann man sehen, da&szlig; wir dieselbe
     Mailbox nutzen. Hast Du einen Internet-Zugriff? Siehst Du langfristig
     Chancen f&uuml;r Mailboxen, wo doch auch immer mehr `normale` User die
     M&ouml;glichkeit bekommen direkt ins Internet einzusteigen?</TD>
</TR>
<TR>
    <TH>COSYS:</TH>
    <TD>&lt;Internet: Bald auch in der BBrandes!&gt;</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Danke f&uuml;r den Hinweis, Cosys...</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>&lt;Werbung off ;)&gt;</TD>
</TR>
<TR>
    <TH>COSYS:</TH>
    <TD>&lt;SCNR&gt;</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>&Auml;hm, also: ich habe keinen Zugang. Ich hab das auch noch nicht
     benutzt. WWW alleine stelle ich mir eher uninteressant vor (weil man
     da nur passiv ist), andererseits ist es sicher eine gute (vor allem
     aktuelle) Informationsquelle. Dann gibt's ja wohl noch IRC und so...
     und einen Chat mit Leuten aus dem Ausland stelle ich mir dann schon
     reizvoll vor.<P>

     Zu Mailboxen: Kann mir nicht richtig vorstellen, da&szlig; das mal
     ausstirbt. Da h&auml;ngt eine richtige Szene dahinter, und ich mu&szlig; sagen,
     da&szlig; es schon was anderes ist, wenn man mal ein "reales" Usertreffen
     machen kann. Das ist ja in der globalisierten Fassung "Internet"
     schwerer m&ouml;glich. Au&szlig;erdem hat f&uuml;r mich der reine Textmodus auch
     seinen Reiz. Das hat irgendwie Flair. Nun ist es ja leider so, da&szlig;
     die bunte Welt immer mehr ankommt (Was w&auml;re das Internet ohne
     Grafik? Gar nichts!!) und deshalb gibt es vielleicht auf die Dauer
     weniger Neueinsteiger in der traditionellen DF&Uuml;.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Zumindest hat es auch den Flair der flotteren Geschwindigkeit.<P>

     Kannst Du zum Schlu&szlig; unseren Lesern noch etwas zu Deiner Person
     sagen? Wie alt bist Du? Das Du Dein Abi in frischer und guter
     Erinnerung hast, erw&auml;hntest Du schon. Was willst Du jetzt machen?
     Welche Hobbies hast Du noch neben dem Computern?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>Also, ich bin vor kurzen 19 geworden (am 18. Mai). Zu meiner
     Person: also ich bin eher ein ruhiger Typ. Neben dem Compi lese ich
     ganz gerne was (wenn ich noch dazu komme... :-)), z.B.
     Science Fiction wie "Dune". Solche Fantasiewelten haben f&uuml;r mich
     irgendwie eine besondere Bedeutung, weil ich es wichtig finde, den
     Alltag nicht als gegeben hinzunehmen.<P>

     Nach dem Abi mache ich halt erstmal Zivildienst (Altenpflege, ja,
     freiwillig) und dann will ich Technische Informatik studieren (f&uuml;r
     die Berufsakademie hab ich mich schon letztes Jahr mal probehalber
     beworben, aber in den Einstellungstests wird teilweise verlangt,
     da&szlig; man Kopfrechnen kann. Und das kann ich nicht. Also stellen die
     wieder nur Rollenspieler ein. :-) )<P>

     Wenn das nicht klappt, dann an der TU Berlin.<P>

     Was mir noch zu den Hobbys eingefallen ist; Philosophie interessiert
     mich auch sehr.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Gut! Danke - Du hast es &uuml;berstanden! :))</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>CJ:</TH>
    <TD>War mir ein Vergn&uuml;gen.</TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN =LEFT><A HREF="WOA97Rep.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../SW/AWBT0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
