<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Blitzbombers</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Blitzbombers</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P><B>Blitzbombers</B> ist, ebenso wie das in dieser Ausgabe getestete <A HREF="9803mb.htm">MegaBlast</A>,
ein Bomberman-Klone. Das hei&szlig;t kurz zusammengefa&szlig;t, da&szlig; man auf dem, mit
zahlreichen, meist zerst&ouml;rbaren Steinbl&ouml;cken gepflasterten Spielfeld,
versuchen mu&szlig;, seine Mitspieler mittels Zeitbomben zu t&ouml;ten, w&auml;hrend
die genau dasselbe im Sinn haben.
</P><P>
<B>Die Story dahinter</B>
</P><P>
Blitzbombers wurde von <B>Red When Excited</B> programmiert und war
urspr&uuml;nglich zur kommerziellen Ver&ouml;ffentlichung gedacht. Eine nicht
aus dem Amiga-Bereich stammende Firma mit &auml;hnlichem Konzept hatte
seinerzeit das Projekt verhindert. Das jetzt im Aminet erh&auml;ltliche
Archiv stellt den Entwicklungsstand von Januar 1996 dar, den die
Programmierer mit 99 Prozent angeben.
 </P><P>
<B>Voraussetzungen und eventuelle Probleme</B>
 </P><P>
AGA und 1.6 MByte Chip-RAM sind Voraussetzung. Auf manchen Rechnern
gibt es ein Problem, was die Musik betrifft. Sie spielt nicht. Die
Ursache war bei Erstellung des beigef&uuml;gten Readme`s nicht konkret
bekannt, es wurde das Softkicken des OS3.1 vermutet und ein Booten
ohne Startup-Sequenz empfohlen.
  </P><P>
Obwohl dies bei dem Testrechner nicht die Ursache sein konnte und ich auch
ohne Startup-Sequenz bootete, trat dieser Effekt bei mir auf. Das ist aber
gl&uuml;cklicherweise nicht sehr st&ouml;rend, da w&auml;hrend des eigentlichen Spiels
sowieso keine Musik l&auml;uft.
   </P><P>
<B>Das Hauptmen&uuml;</B>
   </P><P>
Nach dem Start fallen sofort die in sehr guter Optik pr&auml;sentierten Men&uuml;s
auf. Im Hauptmen&uuml; kann man sich zwischen &quot;<B>One Player</B>&quot; (selbsterkl&auml;rend),
&quot;<B>Battle Game</B>&quot; (Kampf unendlich, also `Open End`), &quot;<B>Serial Game</B>&quot; (f&uuml;r
Spiele zwischen zwei Rechnern mit Nullmodemkabel) und dem &quot;<B>Grudge Match</B>&quot;
(dem `eigentlichen` Spiel, bei dem eine Anzahl Runden hintereinander
gewonnen werden mu&szlig;) entscheiden.
</P><P>
Au&szlig;erdem gibt es noch eine <B>Highscore</B>-Liste, sogar f&uuml;r jeden Modus (au&szlig;er
dem Serial Game), ein &quot;<B>About</B>&quot; und &quot;<B>Exit</B>&quot;, welches auch tats&auml;chlich
funktioniert.
</P><P>
Der letzte, aber sehr wichtige Men&uuml;punkt ist &quot;<B>Configuration</B>&quot;.
</P><P>
<B>Die Konfiguration</B>
</P><P>
Hier kann man fast alles Einstellen, was das Herz begehrt. In der
&quot;<B>Powerup-Config</B>&quot; kann man jedes einzelne Powerup, das man w&auml;hrend des
Spiels aufsammeln kann, separat ein- oder ausstellen - und das sind
insgesamt 32 verschiedene!
</P><P>
Bei &quot;<B>Map-Config</B>&quot; kann man aus acht verschiedenen Szenarios 54 Karten
ausw&auml;hlen oder deaktivieren. Ob Wald, Mond, Burg oder Spielzeug-Umfeld,
es wird eine ganze Menge geboten.
</P><P>
Die &quot;<B>Player-Config</B>&quot; erm&ouml;glicht es, die F&auml;higkeiten jedes der vier Spieler
zu ver&auml;ndern. Vier Voreinstellungen von `Pro` (geringe Ausstattung) bis
`Bad` (volle Ausstattung) werden geboten und es gibt auch die M&ouml;glichkeit,
die Anzahl der Bomben, Flammen, Schilde und Timer selbst auszuw&auml;hlen.
</P><P>
Hinzu kommen noch die &quot;<B>Global-Config</B>&quot;, sowie die &quot;<B>Subgame-Config</B>&quot;, mit der
man die beim Aufsammeln bestimmter Powerup`s startenden kleinen Extraspiele
deaktivieren kann, die in aller Ausf&uuml;hrlichkeit gar nicht beschreibbar
sind, da dies den Rahmen sprengen w&uuml;rde.
</P><P>
Zum Schlu&szlig; kann man die Konfiguration speichern und zwar sind hier
verschiedene m&ouml;glich, so da&szlig; man z.B. problemlos zwischen Konfig`s
unterschiedlicher User wechseln kann.
</P><P>
<B>Los geht`s!</B>
</P><P>
Beim &quot;<B>One Player</B>&quot;-Spiel gibt es weniger Aktion, da man sich hier alleine
jeweils einen Weg zum Ausgang freibomben und dabei teilweise bestimmte
Dinge, wie z.B. Schl&uuml;ssel finden mu&szlig;, ehe man dieses Level verlassen kann.
</P><P>
Bei &quot;<B>Grudge Match</B>&quot; geht es aber richtig ab. Erst erscheint noch ein
Countdown, bei dem noch die Spieler f&uuml;r die Runde festgelegt werden
k&ouml;nnen - auch, ob Mensch oder Maschine zum Einsatz kommen soll.
</P><P>
Von den vier (wenn soviel mitmachen) Spielern startet jeder in einer
Ecke. Am rechten Bildschirmrand f&uuml;hrt eine lange, langsam abbrennende
Z&uuml;ndschnur direkt zu einer Bombe, bei deren Explosion die Runde
beendet ist.
       </P><P>
<B>Die Grafik</B>
             </P><P>
Das Spielprinzip selbst ist ganz oben beschrieben. Die Spielfiguren
sehen schon niedlich aus, wie sie da mit ihren `Raumanz&uuml;gen` durch die
Gegend trappeln, jeweil ein Gelber, ein Roter, ein Blauer und ein Gr&uuml;ner.
Ja, die ganze Grafik ist sehr sch&ouml;n gestaltet, etwas im Comicstil -
detailliert und h&uuml;bsch. G&auml;nge, die Mitspieler oder auch den eigenen
`Bomberman` vor der allzu offensichtlichen Sicht verbergen, sorgen in
so manchem Level f&uuml;r lustige K&auml;mpfe.
                    </P><P>
<B>Die Powerup`s</B>
                           </P><P>
Den richtigen Pfiff bringen die Powerup`s, die mit ihren sehr breit
gef&auml;cherten Funktionen viel Abwechslung ins Spiel bringen und auch &ouml;fter
f&uuml;r &Uuml;berraschungen sorgen. Wenn man z.B. pl&ouml;tzlich seine Position wechselt
(ohne sein Zutun), oder die Farbe aller Spieler auf einmal die gleiche ist,
oder die gerade gelegte Bombe nicht explodiert, oder sie wird zu einem
St&uuml;ck Mauer (und schlie&szlig;t einen vielleicht ein?), oder sie explodiert
sofort, nachdem man sie gelegt hat, oder man wird pl&ouml;tzlich unertr&auml;glich
langsam und kann sich kaum vor Bomben in Sicherheit bringen, oder der
Bildschirm wird pl&ouml;tzlich ganz hell bzw. dunkel oder, oder, oder...
</P><P>
Da kommt schon eine Menge Hektik auf und gerade bei vielen menschlichen
Gegnern ist f&uuml;r viel Hallo, Lachen und &uuml;berraschte Reaktionen gesorgt.
Und selbstredend f&uuml;r viel <B>Spa&szlig;</B>.
</P><P>
<B>Der Sound</B>
</P><P>
Zu diesem tragen auch die sehr guten Soundeffekte bei, von h&auml;mischem
Gekicher, wenn es einen erwischt hat, bis zu einem herzhaften "Yes!"
bei besonders gelungenen Aktionen.
</P><P>
<B>...und sonst?</B>
</P><P>
Die Computergegner sind sehr knackig und man hat doch gro&szlig;e M&uuml;he drei
von ihnen zu besiegen. Sie machen es einem jedenfalls nicht zu leicht.
</P><P>
Die Steuerung ist sehr gut, die Spielfiguren bewegen sich in der
richtigen Zeit an den richtigen Ort, so wie man es von ihnen will,
au&szlig;er einer der Gegner will vielleicht etwas anderes. ;)
</P><P>
<B>Fazit:</B>
</P><P>
Ein sehr gelungenes Spiel, das problemlos eine sehr gro&szlig;e Chance im
kommerziellen Bereich gehabt h&auml;tte und haben w&uuml;rde. Es hinterl&auml;&szlig;t einen
<B>prima</B> Gesamteindruck. Erfreulich, da&szlig; es doch noch seinen Weg zu uns
gefunden hat!
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TH>Produkt:</TH>
    <TD>Blitzbombers</TD>
    <TH>Hersteller:</TH>
    <TD><A HREF="http://www.lgngedge.demon.co.uk">Red When Excited</A></TD>
</TR>
<TR>
    <TD><B>Genre:</B></TD>
    <TD>Bomberman-Klone</TD>
    <TD><B>Version:</B></TD>
    <TD> - </TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>Kostenlos</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://ftp.uni-paderborn.de/aminet/">Aminet</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>k.A.</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>1</TH></TR>
</TABLE></P><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803mb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803one.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
