<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - OnEscapee</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>onEscapee</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P><B>onEscapee</B>, produziert von Sadeness Software und programmiert vom
ungarischen Invictus Team, ist ein Spiel, welches ausschlie&szlig;lich auf
CD-Rom erh&auml;ltlich ist. Sie fa&szlig;t eine Datenmenge von etwa 170 MB, von
denen das eigentliche Spiel etwa 120 MB beansprucht. Zus&auml;tzlich
sind auf ihr noch mehrere Versionen einer Foundation-Demo enthalten,
dem Spiel, das demn&auml;chst zu einem Hit auf dem schmal gewordenen
Amiga-Markt werden soll.
</P><P>
<B>Voraussetzungen</B>
</P><P>
Voraussetzung f&uuml;r <B>onEscapee</B> ist ein 68020er Prozessor, 4 MB RAM,
OS 3.0 und vorerst AGA (ein Patch f&uuml;r Grafikkarten soll sp&auml;ter
erscheinen und frei erh&auml;ltlich sein).
</P><P>
Bevor man beginnt, kann man bei Bedarf mit dem mitgelieferten Utility
&quot;EscMode&quot; die Bildschirmmodi f&uuml;r das Men&uuml; und das Spiel selbst ausw&auml;hlen,
falls man Standardmodi nicht darstellen kann oder andere bevorzugt.
</P><P>
Nach dem Start erwartet den Spieler, nach einem recht gut gelungenen
mehrmin&uuml;tigen Intro, das Startmen&uuml;. Von hier aus kann man sich unter
anderem eine eindrucksvolle Hilfe aufrufen, in der unser Held in
vielen verschiedenen gleichzeitigen Darstellungen seine Bewegungs-
m&ouml;glichkeiten demonstriert und wie man sie nachvollziehen kann.
</P><P>
<B>Optionen</B>
</P><P>
Im Optionsmen&uuml; kann man die Musik und SoundFX im Spiel, die Wellen-
bewegungen des Wassers, sowie einen Turbo ein- und ausstellen.
Dieser Turbo, der bei einem 020er Prozessor nicht empfohlen wird,
erh&ouml;ht die Anzahl der Bilder pro Sekunde von 18 auf 25.
</P><P>
&Uuml;brigens erscheinen alle Texte automatisch auf deutsch, wenn das die
WB-Voreinstellungen ergeben und auch das Multitasking bleibt aktiv.
</P><P>
<B>Das Spiel selbst</B>
</P><P>
Doch nun zum eigentlichen Spiel: Kurz gesagt geht es darum, da&szlig;
Au&szlig;erirdische mit einer Erde der Zukunft Kontakt aufgenommen haben und
teilweise auf ihr auch diverse Aktivit&auml;ten betreiben. Diese liegen etwas
im Dunkeln, bekannt wird nur, da&szlig; eine Anzahl gesunder M&auml;nner spurlos
verschwunden sind. So wird auch der Held des Abenteuers, den wir zu
steuern haben, am Anfang entf&uuml;hrt, kann sich aber wehren und fliehen.
Seine Flucht f&uuml;hrt ihn durch seltsame und unwegsame Gegenden.
</P><P>
Vielen werden noch die Spiele &quot;Another World&quot; und der Quasi-Nachfolger
&quot;Flashback&quot; ein Begriff sein. &quot;onEscapee&quot; ist in einiger Hinsicht eine
gute Mischung aus beiden.
</P><P>
Auch hier steuert man einen Mann mit sehr detaillierten Bewegungsphasen
&quot;seitenweise&quot; &uuml;ber den Schirm, da&szlig; hei&szlig;t, ohne das dieser scrollt und
man am linken oder rechten Rand dann einen neuen Bereich betritt. Bei
speziellen Aktionen zwischendurch oder sp&auml;testens bei einem der unsanften
&quot;Abg&auml;nge&quot; unseres Helden (er also vom Leben zum Tod bef&ouml;rdert wird) gibt
es eigene "Schnitte", bei denen man gro&szlig;formatige Detailaufnahmen zu
sehen bekommt, z.B. wie er sich eine Waffe schnappt oder wie er von
Schlingpflanzen erdr&uuml;ckt wird und noch einiges mehr.
</P><P>
Mit der Laserwaffe mu&szlig; er sich auch des &ouml;fteren zur Wehr setzen, wobei
ihm dann auch wieder die altbekannte Schildfunktion zugute kommt, die
durch l&auml;ngeres Feuern ausgel&ouml;st wird und ihn in ein buntes Flimmern
h&uuml;llt.
</P><P>
An manchen Stellen kommt man nur weiter, wenn man kleine Logikspielchen
l&ouml;st, so z.B. ein bestimmtes Muster auf Kn&ouml;pfen dr&uuml;ckt und &auml;hnliches.
Auch vorher gesammelte Objekte werden sp&auml;ter von gro&szlig;er Wichtigkeit.
Nicht nur Geschicklichkeit und Ballerfreude bringen einen also dem Ziel
n&auml;her, auch Cleverness wird ben&ouml;tigt.
      </P><P>
<B>Spielstands-Speicherung</B>
             </P><P>
Mit der F1- oder F10-Taste kommt man jederzeit in ein Men&uuml;, von dem aus
Spielst&auml;nde geladen oder gespeichert werden k&ouml;nnen. Bei jedem Spielstand
wird ein kleines Preview-Bild mit abgespeichert, das sp&auml;ter genau zeigt,
an welcher Stelle man sich befand. Allerdings ist Vorsicht geboten, denn
wenn man manchmal auf einer "Bildschirmseite" eine gelungene Aktion
absolviert hat und das gleich sichern m&ouml;chte, erlebt man gelegentlich
eine b&ouml;se &Uuml;berraschung, wenn man diese Stelle wieder l&auml;dt und feststellt,
da&szlig; der Spielstand gespeichert wurde, als ob man die Aktion nie ausgef&uuml;hrt
h&auml;tte. Das hei&szlig;t, da&szlig; man vor dem Speichern also erst eine neue Seite
betreten sollte. Eine Umstand, den man beachten sollte.
                    </P><P>
<B>Steuerung</B>
                           </P><P>
Die Steuerung der Spielfigur &uuml;bernimmt man entweder mit Joystick,
CD32-Joypad oder Tastatur. Sie ist an sich gut gel&ouml;st, nur wirft es nach
Aufnahme der Waffe zumindest bei Benutzung der Tastatur manchmal Probleme
auf, da&szlig; die Shift-Taste zus&auml;tzlich zur Cursortaste notwendig zum
schnellen Laufen (Rennen) ist, aber gleichzeitig unseren Akteur in den
Kampfmodus versetzt und ihn feuern l&auml;&szlig;t. So kollidiert schonmal das
Vorhaben mit der realen Durchf&uuml;hrung einer bestimmten Aktion. Da hilft
nur viel &Uuml;bung und &quot;Fingerspitzengef&uuml;hl&quot;. Beides wird auch durch die
Tr&auml;gheit der Steuerung, dem zweiten Kritikpunkt, unabdingbar.
</P><P>
<B>Grafik</B>
</P><P>
Die Grafik, mit den flie&szlig;enden Bewegungen der Objekte, den detaillierten
Hintergr&uuml;nden und den zahlreichen Animationen ist wirklich sehr gut. Das
Design ist gelungen und es steckt viel erkennbare M&uuml;he im Detail.
</P><P>
<B>Musik & Sound</B>
</P><P>
Die zahlreichen Musiken sind sehr stimmig und ebenfalls sehr gut, so
wie auch die Soundeffekte. Hier f&auml;llt, wie auch bei vielen anderen
Gelegenheiten, auf, wie wichtig eine passende und in die Umgebung
eingebettete Musik sein kann.
</P><P>
<B>Dokumentation</B>
</P><P>
Die Dokumentation befindet sich, verf&uuml;gbar in zahlreichen Sprachen (dank
ATO, der Amiga-&Uuml;bersetzungsorganisation), als Text auf der CD. In ihr
sind auch zahlreiche Hinweise und Tips zum Bestehen der einzelnen Level
enthalten, die man aber wirklich nur lesen sollte, wenn man &uuml;berhaupt
nicht weiterkommt, da man sich sonst um den Spielspa&szlig; bringt.
</P><P>
<B>Fazit:</B>
</P><P>
Das Spiel als Ganzes macht den Eindruck einer Qualit&auml;t, die man auf dem
Amiga im Moment leider nur sehr selten gewohnt ist. Sofort problemlos
starten und ein wirklich sch&ouml;n gemachtes Abenteuer bestehen. <B>onEscapee</B>
macht es m&ouml;glich.</P>
<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>onEscapee</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.sadeness.demon.co.uk">Sadeness Software</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Action/Geschick</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 90 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Handel/Versand</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>1</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>1</TH></TR>
<TR><TD COLSPAN=4>Sadeness Software, 13 Russell Terrace, Mundesley Norfolk, NR11 8LJ, United Kingdom</TD></TR>
</TABLE></P><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803bb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9803tint.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
