<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - GeoWorld</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Geoworld</H1>von<BR><A HREF="mailto:S.Wyrwa@BBrandes.in-brb.de">Steffen Wyrwa</A> und <A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></A></DIV>
<P>
Wer schon l&auml;nger auf der Suche nach einem Programm ist, um seine
Geographiekenntnisse zu erweitern oder sie auch nur aufzufrischen, ist
mit <B>Geoworld</B> sehr gut beraten. Das Programm bietet einen sehr umfassenden
Datenbestand, ist aber dennoch recht einfach und intuitiv zu bedienen, da
es nicht zu komplex gestaltet wurde.
   </P><P>
In den Genu&szlig; dieses Lehrgangs kommen allerdings nur Besitzer eines Amigas
mit mindestens OS2.0, AGA-Chipsatz oder Grafikkarte und mindestens 3 MB
Ram, wovon die H&auml;lfte Chip-Ram sein mu&szlig;. Au&szlig;erdem sollte die
Reqtools.library installiert sein.
      </P><P>
Die <B>Installation</B> ist dank Commodore-Installer absolut unproblematisch und
d&uuml;rfte auch Einsteigern keine Probleme bereiten. Allerdings sollte der
User zu Beginn auf die lange Installationszeit hingewiesen werden, welche
durch die Verteilung der Daten auf etliche kleine Dateien zustande kommt,
die jedoch alle in eine ordentliche und logische Verzeichnisstrukutr
kopiert werden.
     </P><P>
Zwei mitgelieferte Fonts lassen sich &uuml;ber ein separates Installerscript
installieren. Dies wirkt etwas merkw&uuml;rdig, da Geoworld zu Beginn nach
diesen Fonts sucht und mittels Requestern darauf aufmerksam macht, da&szlig;
sie nicht gefunden werden k&ouml;nnen und stattdessen Topaz verwendet wird.
      </P><P>
Beim ersten Start scheitert das &Ouml;ffnen eines Bildschirms und der User
wird gebeten, einen Bildschirmmodus auszuw&auml;hlen. Ist dies geschehen,
startet GeoWorld sauber und pr&auml;sentiert eine politische Weltkarte und
ein Bedienungsfenster.
       </P><P>
Etwas merkw&uuml;rdig erscheint auch hier <B>die Umsetzung</B>. Die Umgebung
pr&auml;sentiert sich als eine Mischung aus eigenem Oberfl&auml;chendesign und
GadTools-Konformit&auml;t. So pr&auml;sentiert GeoWorld dem User alle Daten und
Buttons s&auml;uberlich in Fenstern plaziert, nimmt sich aber die Freiheit,
eben diese Buttons selbst zu gestalten. So sind Slider bzw. Proportional-
Gadgets nicht systemkonform, was man unter anderem daran feststellen kann,
da&szlig; die Pfeilbuttons nur Einzelklicks entgegennehmen und ein Halten des
Mouse-Buttons keine Wirkung zeigt.
       </P><P>
<B>Probleme</B> bereitete denn auch die Zusammenarbeit mit den Intui-Hacks von
MCP. Diverse von MCP gepatchte Layout-Elemente erschienen auf einem der
Testrechner schwarz auf schwarz, auf dem anderen traten &auml;hnliche Probleme
auf. Zur Zusammenarbeit mit CycleToMenu mu&szlig; eine Option im Einstellungs-
Fenster angeschaltet werden.
       </P><P>
In diesem <B>Einstellungsmen&uuml;</B> kann man, neben einigen anderen Funktionen,
auch endg&uuml;ltig seine eigene Aufl&ouml;sung w&auml;hlen und das Programm somit an
die eigene Konfiguration anpassen.
   </P><P>
In der Regel sollte man zwar die positiven Dinge zuerst nennen, aber der
User f&auml;ngt nunmal mit dem Programmstart an und da Geoworld`s Schw&auml;chen
bereits hier zutage treten, waren sie auch zuerst zu nennen. Nun k&ouml;nnen
wir aber endlich zu den wirklich positiven Seiten kommen.
</P><P>
Der <B>Datenbestand</B> des Programmes ist n&auml;mlich wirklich ansehnlich. Zwar
erscheinen immer noch regelm&auml;&szlig;ig Requester, die auf die mangelnde
Verf&uuml;gbarkeit von diesen oder jenen Informationen hinweisen, jedoch
&uuml;berwiegt bei weitem der Anteil der Punkte, zu denen wirklich
Informationen geliefert werden.
</P><P>
Um an diese zu gelangen w&auml;hlt man entweder direkt ein Land auf der
Weltkarte an, oder w&auml;hlt Land bzw. Stadt aus Listen aus. Es er&ouml;ffnet sich
dann ein Informationsfenster, das einige allgemeine Informationen bereit
h&auml;lt. Dar&uuml;ber hinaus werden auch spezifischere Themen wie Wirtschaft,
Politik, Geschichte, Natur u.a. angeboten. Bei den St&auml;dten gibt es dann
auch ein entsprechendes Spektrum von Bereichen. Somit l&auml;&szlig;t sich aus dem
Angebot eine ganze Menge lernen und das Programm erspart so manchem Blick
ins Lexikon.
 </P><P>
Hinzu kommt das gute <B>Update-Konzept</B>. Neue Daten-Pakete sollen regelm&auml;&szlig;ig
im Aminet, auf einer Service-Homepage und auf diversen Magazin-CDs
erscheinen, so da&szlig; der Datenbestand best&auml;ndig erweitert und aktualisiert
wird. Die beiden bereits ver&ouml;ffentlichten Pakete machten einen guten und
aufger&auml;umten Eindruck und auch das beigelegte Installer-Updatescript
machte keine Probleme.
 </P><P>
Will man seinen gewonnenen Wissensschatz &uuml;berpr&uuml;fen, so kann man sich an
Geoworld`s gelungenem <B>Quiz</B> versuchen. Hierbei wird dem User eine frei
w&auml;hlbare Anzahl von Multiple-Choice-Fragen mit jeweils drei Antworten
gestellt. Wenn man eine falsche Antwort gegeben hat wird die richtige
Antwort allerdings nur so kurz angezeigt, da&szlig; man schon ein ge&uuml;btes Auge
haben mu&szlig; und besser wissen sollte, wo in etwa die Worte stehen, auf die
es ankommt. Das Quiz endet mit einer kurzen Statistik und einem Kommentar.
   </P><P>
Die <B>Dokumentation</B> ist sehr umfangreich geschrieben. Und wenn man mal
w&auml;hrend einer Funktion im Programm nicht weiter wei&szlig; - mit einem Druck auf
die Hilfe-Taste &ouml;ffnet sich sofort eine Online Hilfe, die zum aktuellen
Fenster einiges an Informationen zur Verf&uuml;gung stellt.
  </P><P>
Zu guter letzt steht dem User eine <B>Druckfunktion</B> zur Ausgabe der Daten zur
Verf&uuml;gung. Diese k&ouml;nnen entweder in eine ASCII-Datei geschrieben oder eben
auf den Drucker ausgegeben werden. Bei keinem der beiden Testrechner
funktionierte die Ausgabe auf den Drucker. Das Problem mu&szlig; auch bei
Geoworld liegen, da TurboSpool keinen Druckauftrag erhielt. Au&szlig;erdem
mu&szlig;te nach jedem erneuten Test der Rechner gebootet werden, da sich
weder die Druckfunktion, noch das Programm beenden lie&szlig;.
  </P><P>
Eine <B>Demoversion</B> des Programmes befindet sich im Aminet. Bei Registrierung,
die wahlweise via EMail oder Diskette erfolgen kann, wof&uuml;r man 25,-DM bzw.
30,-DM ausgeben mu&szlig;, erh&auml;lt man drei Disketten, auf denen sich das
vollst&auml;ndige Programm mit allen verf&uuml;gbaren Daten und ein Keyfile
befinden.
  </P><P>
<B>Fazit:</B>
  </P><P>
Geoworld bietet einen sehr umfangreichen Datenbestand und besticht dar&uuml;ber
hinaus durch ein durchdachtes Update- und Erweiterungs-Konzept. Laut
Anleitung haben sich die beiden Autoren auch noch jede Menge vorgenommen
und wenn das mal in ein Programm umgesetzt werden w&uuml;rde, w&auml;re der Amiga-
Softwaremarkt um eine sehr leistungsf&auml;hige Datenbank reicher. Zuvor
jedoch scheint es ratsam, das Programm noch einmal gr&uuml;ndlich zu
&uuml;berarbeiten. Somit wird der Preis vor allem durch den Datenbestand
gerechtfertigt.
</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Geoworld</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>BEER Productions</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>geogr. Datenbank</TD>
    <TD><B>Version:</B></TD>
    <TD>1.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>30,- DM mit Anleitung&#185;</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.freiepresse.de/home/jubee/">Homepage</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>3</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4>Andre & Ronny Beer, Siedlung 6, 09548 Deutscheinsiedel</TD></TR>
</TABLE><BR>
&#185; - Preis bei &Uuml;bersendung als DMS-Files per eMail, sowie ohne
    gedruckte Anleitung, betr&auml;gt 25,- DM.
</P><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803tp6.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803mb.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
