<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - TurboPrint 6 Pro</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Turboprint 6 Pro</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyra</A></DIV>
<P>
Das wesentlichste an einem Computer sind bekanntlich die Ein- und
Ausgabeschnittstellen und zu diesen geh&ouml;rt freilich nicht zuletzt ein
<B>Drucker</B>. Selbige gibt es denn auch in H&uuml;lle und F&uuml;lle, womit es eigentlich
unproblematisch sein sollte, f&uuml;r seinen Amiga einen passenden zu finden.
</P><P>
Ist es auch, <B>das Problem</B> ergibt sich erst, wenn man feststellt, da&szlig; die
Hersteller nur Treiber f&uuml;r PC und Mac mitliefern und der Amiga-User somit
einen Drucker hat, der nicht mit dem Amiga reden will. Neben diversen
vereinzelten Treibern, die von Hobby-Programmierern angeboten werden, und
dem vorbildlichen Service von Canon, die ein eingeschr&auml;nktes "Studio"-
Paket mit aktuellen Treibern durchs Aminet schicken, gibt es zwei
kommerzielle Treibersysteme, die Abhilfe schaffen.
</P><P>
Das eine ist &quot;Studio V2.x&quot;, das andere &quot;TurboPrint&quot;, das schon auf
eine l&auml;ngere Tradition zur&uuml;ckblickt und von dem nunmehr die Version 6
erschienen ist. Dieser Test soll das Programm im allgemeinen vorstellen
und die Neuerungen unter die Lupe nehmen.
</P><P>
<B>TurboPrint</B> wird auf einer Diskette und mit gedruckter Dokumentation
ausgeliefert. Letztere besteht aus dem Handbuch zur Version 4 und einem
zus&auml;tzlichen Heft, in dem s&auml;mtliche &Auml;nderungen der Version 6 ebenso
ausf&uuml;hrlich beschrieben sind. Bei einem Update erh&auml;lt man entsprechend
nur das Heft zur Version 6.
 </P><P>
Bei der <B>Installation</B>, welche von einem Installer-Script besorgt wird,
wird im Gegensatz zu fr&uuml;heren Versionen die Eingabe des Namens und der
Registriernummer verlangt, die dann auf der Originaldiskette gesichert
werden. Die Installation erfolgt komfortabel und problemlos und es
besteht bereits die M&ouml;glichkeit, einige Vorkonfigurationen vornehmen zu
lassen.
    </P><P>
Ist dies vollzogen, findet der User in der TurboPrint-Schublade im
Wesentlichen das Hauptprogramm, den GrafikPublisher und das neue
TurboSpool. In der WBStartup-Schublade werden vorbildlich nur Projekt-
Icons angelegt, die auf diese Programme verweisen.
    </P><P>
<B>Das Hauptprogramm</B> ist freilich der Kern des Paketes. Hier werden
s&auml;mtliche Einstellungen vorgenommen. Die Original-WB-Einsteller werden
dabei &uuml;berfl&uuml;ssig, da TurboPrint ihre Funktionen vollst&auml;ndig &uuml;bernimmt.
Im Gegensatz zum Studio-Treiber bietet TurboPrint keine WB-Druckertreiber
an, die in DEVS:Printers installiert werden, sondern f&auml;ngt s&auml;mtliche
Druckauftr&auml;ge, die an PRT: gesendet werden, ab und verwaltet sie selbst.
     </P><P>
Dies mag zun&auml;chst ein wenig suspekt erscheinen, erweist sich in der
Praxis aber als &auml;u&szlig;erst komfortabel, da nun nicht mehr in jedem Programm
der richtige Druckertreiber eingestellt werden mu&szlig;, sondern dies global
von TurboPrint verwaltet wird. Dennoch werden die einzelnen Druckparameter,
wie Druckdichte oder &auml;hnliches von den Anwendungen &uuml;bernommen.
 </P><P>
Zum Management der eigenen <B>Einstellungen</B> bietet TurboPrint die M&ouml;glichkeit,
verschiedene Einstellungsdateien anzulegen, die auch recht komfortabel
verwaltet werden. Dazu pr&auml;sentiert das TP-Fenster, das via Hotkey ge&ouml;ffnet
werden kann, eine Karteikarte, in welcher man neben den Schnittstellen-
Einstellungen auch die Liste eben jener Dateien findet. Dies erm&ouml;glicht
ein relativ schnelles Umschalten der Einstellungen.
 </P><P>
Neben dieser gibt es noch sechs weitere Karteikarten, auf denen s&auml;mtliche
Funktionen zur Konfiguration des Programmes untergebracht sind. Diese
pr&auml;sentieren sich je nach Druckertyp mit variierendem Inhalt. Die
Einstellm&ouml;glichkeiten sind sehr umfangreich und lassen kaum W&uuml;nsche
offen, so da&szlig; ich hier nicht n&auml;her ins Detail gehen m&ouml;chte.
         </P><P>
<B>Besonderheiten</B> sind hierbei allerdings die <B>Poster-Funktion</B>, mit Hilfe
derer sich bis zu 8x8 Seiten gro&szlig;e Poster drucken lassen, die l&ouml;bliche
<B>TrueMatch-Farbkorrektur</B>, mit deren Hilfe sich der Ausdruck an das Monitor-
Bild anpassen l&auml;&szlig;t und zu der f&uuml;r jeden Drucker bereits individuelle
Einstellungsdateien beiliegen, und die <B>Hardcopy</B>-Funktionen, die unter
anderem die Installation eines ScreenSnappers ersparen. Au&szlig;erdem bietet
TurboPrint viele verschiedene Algorithmen zur Musterung des Ausdrucks,
mit Hilfe derer sich 256 Graustufen realisieren lassen - statt 16 ohne
TurboPrint.
    </P><P>
Neu am Hauptprogramm ist gegen&uuml;ber der Version 5 nur, da&szlig; nun eine
<B>PowerPC-Unterst&uuml;tzung</B> aktiviert werden kann, so da&szlig; rechenintensive
Funktionen durch PowerPC-Routinen durchgef&uuml;hrt werden, sofern ein
solcher vorhanden ist.
      </P><P>
Mehr Neuerungen findet man da schon beim <B>GrafikPublisher</B>.
     </P><P>
Dieser dient vornehmlich dazu, Bilder auszudrucken und dabei den Ausdruck
nach Wunsch zu gestalten. So k&ouml;nnen nicht nur Bildposition, -gr&ouml;&szlig;e und
-ausschnitt festgelegt werden, sondern es lassen sich auch die Farb- und
Gamma-Werte, sowie Helligkeit, Kontrast und &auml;hnliches variieren, um den
Ausdruck an das Monitorbild anzupassen oder auch zu verfremden. Der
GrafikPublisher versucht dabei stets die Bildschirmdarstellung an den
Ausdruck anzupassen, so da&szlig; der Anwender sofort sehen kann, wie sich
seine Handlungen auf das Resultat auswirken. Dies klappt nat&uuml;rlich umso
besser, je farbenreicher der Bildschirm ist, der f&uuml;r den Publisher
eingestellt ist. Hier ist der Besitz einer Grafikkarte von gro&szlig;em
Vorteil.
       </P><P>
Neu in Version 6 ist hierzu nun auch die M&ouml;glichkeit einer <B>Texteinbindung</B>
gekommen. Diese verwendet Amiga-Bitmap oder Intellifont-Outline-Fonts,
wobei letzteres freilich zu empfehlen ist, da diese dann frei skalierbar
sind. Au&szlig;erdem l&auml;&szlig;t sich die Farbe der Schrift w&auml;hlen, sie l&auml;&szlig;t sich in
90&#176;-Schritten drehen, und mit Hilfe der Transparenz-Einstellungen kann man
die Schriften wie Schablonen &uuml;ber die Bilder legen. Man sollte sich von
dieser Neuerung nicht zuviel erwarten, sie wird zwar viel gelobt, macht
aber praktisch nur zur Beschriftung der Bilder oder f&uuml;r Banner- und
Titelschriften Sinn. F&uuml;r die Verbindung von Text und Bild empfiehlt
sich nach wie vor die Verwendung einer Textverarbeitung oder eines DTP-
Programmes.
</P><P>
Die zweite Neuerung ist die <B>PhotoOptimize-Funktion</B>, die die Bildwerte
automatisch f&uuml;r die Grafik zu optimieren versucht und somit dem User
ewiges Herumexperimentieren abnehmen soll. In der Praxis klappt dies nur
bedingt. Bei einem der getesteten Bilder ver&auml;nderte die Funktion die Werte
&uuml;berhaupt nicht, obwohl beim Ausdruck ein Blaustich auftrat, bei zwei
anderen funktionierte sie allerdings recht gut, so da&szlig; Kontraste und
Farben letztendlich besser heraustraten.
  </P><P>
Zu guter letzt gesellte sich in der Version 6 nun auch der lange vermi&szlig;te
Druckerspooler dazu.
</P><P>
<B>TurboSpool</B> ist ein Commodity, das die Druckauftr&auml;ge abf&auml;ngt und zun&auml;chst
auf der Festplatte zwischenlagert, bevor sie an den Drucker weitergegeben
werden. Die Vorteile, die daraus resultieren, sind einerseits, da&szlig; die
jeweiligen Anwendungen nicht warten m&uuml;ssen, bis sie wieder in den
Druckerspeicher schreiben k&ouml;nnen und so in der Regel nach k&uuml;rzester
Zeit weitergearbeitet werden kann, andererseits der, da&szlig; eine Vielzahl
von Druckauftr&auml;gen direkt hintereinander abgesendet werden und in einer
Warteliste komfortabel verwaltet werden k&ouml;nnen. So lassen sich
Druckauftr&auml;ge zwischenzeitlich stoppen oder ganz l&ouml;schen und die
Reihenfolge kann ge&auml;ndert werden.
 </P><P>
TurboSpool bietet verschiedene Einstellm&ouml;glichkeiten, mit denen sich unter
anderem festlegen l&auml;&szlig;t, wo die Druckdaten zwischengelagert werden sollen
und wie sich das TurboSpool-Fenster verhalten soll. So l&auml;&szlig;t sich
einstellen, da&szlig; TurboSpool versteckt bleiben soll, bis ein Druckauftrag
ankommt und dann entweder ein AppIcon oder ein Fenster &ouml;ffnet. Leider
jedoch wird dieses Icon bzw. Fenster nach dem Beenden des Druckvorganges
nicht automatisch wieder entfernt, so da&szlig; dies immer der User selbst tun
mu&szlig;.
 </P><P>
Die Druckauftr&auml;ge werden aber schnell entgegengenommen und es traten keine
Probleme bei der Weiterleitung auf. Aufpassen sollte man jedoch bei der
Wahl des Spool-Verzeichnisses. Eine umfangreiche Grafik kann schnell
30MB oder mehr Festplattenplatz belegen.
 </P><P>
<B>Alles in allem</B> l&auml;&szlig;t sich sagen, da&szlig; TurboPrint die lange Reifezeit
genossen hat und immer mehr zu einem Programm avanciert, das wirklich
nur noch sehr minimale M&auml;ngel aufweist. Dennoch k&ouml;nnte der Preis etwas
niedriger angesetzt werden, sowohl bei Neukauf als auch der des Updates,
insbesondere, da neue Druckertreiber immer nur &uuml;ber ein komplettes Update
erscheinen und nicht wie beim Studio-Paket als kleinere Updates durchs
Aminet gepostet werden.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>TurboPrint Pro</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.irseesoft.com">IrseeSoft</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Druckertreiber</TD>
    <TD><B>Version:</B></TD>
    <TD>6</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>150 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>IrseeSoft</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4><ADDRESS>IrseeSoft, Meinrad-Spie&szlig;-Platz 2, 87660 Irsee,
Tel.: 08341/74327</ADDRRSS></TD></TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0398/9803iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803geow.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
