<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, avantasia, Metal Opera, Edguy, ernie, kiske, edguy, Avantasia, samett">
<title>Avantasia: The Metal Opera-Part I</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="#00ff00">Avantasia: The Metal Opera - Part I</font></h1><BR> (AFM Records / 58:57)</center></P>

<p>Lange wurde die Metal Oper aus der Feder von Tobias Sammet, seines Zeichens Mastermind bei den deustchen Melodic Speed Metallern von Edguy, angek&#252;ndigt - nun ist diese endlich erschienen. Und das beste dabei ist: Die Ank&#252;ndigen, die im Vorfeld gemacht wurden, waren garantiert nicht &#252;bertrieben. Insgesamt 10 recht bekannte S&#228;nger veredeln die nett gemachte Fantasy Story (die am Ende mit dem einen oder anderen Gag daherkommt) und sorgen f&#252;r pure Abwechselung zwischen den einzelnen Songs. Darunter befinden sich so illustre Pers&#246;nlichkeiten wie Kai Hansen (Gamma Ray), David DeFeis (Virgin Steele),
Andre Matos (Angra), Rob Rock (u.a. Axel Rudi Pell, Warrior) und der wohl von den Fans am meisten erwartete Gast Michael Kiske (ex-Helloween), der im Booklett als &quot;Ernie&quot; gef&#252;hrt wird. Auch die instrumentale Besetzung ist mit Mitgliedern von Helloween, Gamma Ray, Edguy und Rhapsody mehr als stark besetzt. Diese Auflistung an Prominenten l&#228;sst schon erahnen, da&#223; das &quot;Avantasia Epos&quot; eigentlich gut sein muss - und das ist noch weit untertrieben, denn dieses Album ist ein wahrer Killer, der im Grunde nur Highlights enth&#228;lt und sich musikalisch nat&#252;rlich stark an Edguy orientiert. Seien es nun Ohrw&#252;mer wie der schon von der Single bekannte Opener &quot;Reach Out For The Light&quot;, das nachfolgende &quot;Serpents In Paradise&quot; (mit David DeFeis), der an selige Helloween Zeiten erinnernde Dampfhammer &quot;Breaking Away&quot;, bei dem Michael Kiske eine astreine Performance hinlegt, die er auch zu &quot;Keeper...&quot; Zeiten nicht besser hingekriegt h&#228;tte, oder das abschlie&#223;ende episch ausufernde &quot;The Tower&quot; mit Virgin Steele artigem Outro - alle Kompositionen sind f&#252;r sich gesehen absolute Killer und wissen infolgedessen von der ersten bis zur letzten Sekunde an zu &#252;berzeugen. Die drei instrumentalen Zwischenst&#252;cke runden das ganze noch perfekt ab und passen sich hervorragend dem Gesamtwerk an. Somit ergibt sich ein b&#228;renstarkes Konzeptalbum, da&#223; nicht nur von der Qualit&#228;t der bekannten Musiker lebt, sondern auch musikalisch sehr viel zu bieten hat und eindrucksvoll untermauert, warum Tobias Sammet zu einem der besten Vertreter der jungen Melodic Speed Metal Garde geh&#246;rt. &quot;Avantasia&quot; sollte f&#252;r alle Fans vom melodischem Power Metal ein absoluter Pflichtkauf sein und ist der perfekte Nachfolger von Helloween`s Meisterwerk &quot;Keeper Of The Seven Keys-Part II&quot;. So sollten Helloween heute klingen!</P>

<p>Fazit: 10 von 10 Punkten</P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
