<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Vorwort</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><b><u>Welcome To The Show!</B></U><BR>
Nachdem ich in der letzten Ausgabe der Metal Corner mich noch &#252;ber einen gewissen Schreiber vom Rock Hard &quot;aufgeregt&quot; hatte, konnte ich im Leserforum der letzten Rock Hard erkennen, da&#223; ich nicht der einzigste war, der mit dem Statement von Herrn M&#252;hlmann nicht einverstanden war. Zugegebenerma&#223;en hatte ich mich noch etwas zur&#252;ckhaltender ausgedr&#252;ckt, als diverse Leserbriefschreiber, die kein Blatt vor den Mund nahmen und klar sagten, was Sache ist.<br> 
&quot;Sch&#246;n, da&#223; die Szene noch nicht in akute Lethargie verfallen ist&quot; dachte ich mir da noch. Zu fr&#252;h getr&#228;umt, denn was sich mit beim Newcomer &quot;Emergenza&quot; Festival in der Bochumer Matrix sehen musste, war nicht mehr sch&#246;n: Dort traten viele Bands auf, die noch keinen Plattenvertrag besitzen, um sich in die Gunst des Publikums zu spielen und evtl. eine Runde weiterzukommen und mit viel Gl&#252;ck einen Plattenvertrag zu ergatttern. Dort traten Bands verschiedener Genres auf, die ihr Handwerk auf jeden verstanden, aber der Publikumszuspruch war f&#252;r einen Freitag Abend eher mager - dieses Paradebeispiel zeigt ganz deutlich, da&#223; kleinere Festivals / Gigs f&#252;r ein paar M&#228;rker nicht mehr angenommen werden und stattdessen jeder f&#252;r die gro&#223;en Gigs wie etwa Iron Maiden &amp; Co. spaart, die das vierfache oder noch mehr kosten. Schade eigentlich, denn die an diesem Abend angetretenen Bands trafen vielleicht nicht alle meinen musikalischen Nerv, hatten aber allesamt was zu bieten und insbesonders einer Band (Damaged Justice) w&#252;rde ich den Durchbruch in Form eines Plattenvertrages doch so sehr g&#246;nnen. Was nicht ist, kann ja noch werden - aber trotzdem mein Appell an alle Metal Fans: Support your local Underground!</P>

<p>Viel Spa&#223; jetzt mit der vorliegenden Issue,</P>

<p>Kilian <blink>&quot;The Bruce&quot;</Blink> Servais </P>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
