<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Die Amiga-Historie 2/3</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Die Amiga-Historie 2/3</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P><B>Vorbemerkung</B></P>

<P>Sicher hat jeder Amiga-User oder -Veteran schon einiges &uuml;ber die Amiga-
Geschichte geh&ouml;rt. Die folgende Ausarbeitung, aufgeteilt in drei Teile,
hat keinen Anspruch auf Vollst&auml;ndigkeit. Allerdings habe ich den Versuch
unternommen, nach dem Durchforsten zahlreicher Texte und Quellen
m&ouml;glichst viele begr&uuml;ndete Details einzubringen, die teilweise auch
den gr&ouml;&szlig;eren Rahmen verdeutlichen sollen. Das gelegentliche Abschweifen
ist also beabsichtigt. :)</P>

<P>Auch Widerspr&uuml;che sind mir bei der Arbeit an diesem Text in manchen
Quellen gelegentlich aufgefallen und ich habe mich immer bem&uuml;ht, nur
abgesicherte Informationen einfliessen zu lassen. Trotzdem kann ich
keine Garantie f&uuml;r die Richtigkeit aller Angaben geben.</P>

<P>Dies ist mit Sicherheit eine der <B>komplexesten</B> Ver&ouml;ffentlichungen zu
diesem Thema.</P>

<B>Die drei Teile in der &Uuml;bersicht:</B>

<OL>
<li>Von den Anf&auml;ngen bis zum Kauf durch Commodore
</li>
<li>
<b>Vom ersten Amiga bis zu den ersten AGA-Hinweisen</b>
<ul>
<li>Der erste Amiga
</li><li>Quantensprung - die Custom Chips
</li><li>Doch nicht nur das
</li><li>Probleme
</li><li>Die n&auml;chste Amiga-Generation
</li><li>...und trotzdem wird der Amiga ein Erfolg
</li><li>Ein wirklicher Fortschritt
</li><li>Der ganz andere Markt - Amerika
</li><li>Ganz anders / ganz erfolglos
</li><li>Seltsame Firmenpolitik
</li><li>Die Ger&uuml;chte und ihr wahrer Kern
</li><li>Commodore immer noch ziellos
</ul>
<li>
Vom Amiga 600 bis zur Gateway-&Uuml;bernahme
</li></OL>

<HR>
</P><P>

<H2 align=center>2. Vom ersten Amiga bis zu den ersten AGA-Hinweisen</h2>
         
</P><P>
<B>Der erste Amiga</B>
</P><P>
Zur&uuml;ck aber zum Amiga-Betriebssystem: zur Realisation von CAOS fehlte
also die Zeit. Doch eine englische Firma namens 'MetaComCo' hatte ein
fertiges Betriebssystem mit dem Namen 'Tripos' in der Schublade, das
ebenfalls Multitasking, also die (scheinbare) Ausf&uuml;hrung mehrerer
Programme, erm&ouml;glichte - ein Prinzip, welches im gro&szlig;en Ma&szlig;stab erst
sehr lange Zeit sp&auml;ter von anderen gro&szlig;en Herstellern aufgegriffen
werden sollte. Dieses OS kaufte Commodore also und es wurde in Rekordzeit
mit den bestehenden CAOS-Teilen verbunden und den Amiga-Erfordernissen
angepa&szlig;t. Das Amiga-OS war geboren! Von Anfang an beinhaltete es eine
einfache, mit Maus zu bedienende Benutzeroberfl&auml;che und konnte parallel
auch &uuml;ber ein CLI (Command Line Interface) &uuml;ber Tastatur mit Befehlen
gesteuert werden. Damit war es das erste OS, das beide M&ouml;glichkeiten
gleichzeitig bot.
</P><P>
Der Amiga 1000 vereinigte schon einige Merkmale in sich, die auch sp&auml;ter
den Amiga ausmachen sollten. Sein Herz war der Hauptprozessor 68000 von
Motorolla, dem Experten gegen&uuml;ber den zeitgen&ouml;ssischen Intel-Prozessoren
den Vorzug gaben, da er fortschrittlicher war. Bei dieser CPU handelte es
sich um einen 16-Bit-Prozessor, der intern bereits volle 32 Bit verwendet.
So gab es sp&auml;ter, als die Nachfolger des 68000 erschwinglich und in Amigas
eingesetzt wurden, keine Probleme mit alter Software, zumindest keine, die
aus der Umstellung von 16 auf 32 Bit resultierten, wie etwa bei Windows
3.X zu Windows 95.
</P><P>
Aber nicht der Hauptprozessor war das besondere, denn die 680X0-Prozessoren
wurden auch in den Atari ST's und Apples verwendet. Der Amiga besa&szlig;
zus&auml;tzlich mehrere sogenannte 'Custom Chips', das sind Prozessoren, die
im eigenen Hause entwickelt waren, um besondere Anforderungen zu erf&uuml;llen.
Sie entlasten den Hauptprozessor, &auml;hnlich zum Beispiel den weitverbreiteten
mathematischen Koprozessoren (FPU's) bei speziellen Aufgaben. Im Laufe der
Zeit gab es mehrere Custom Chips, die kleinere Teilaufgaben bei speziellen
Amiga-Typen &uuml;bernahmen und daher wechselten (Buster, Gary, Amber, Akiko).
Grund f&uuml;r die Bekanntheit des Amiga waren aber drei spezielle, die in der
ersten Amiga-Generation ihren Dienst versahen.
</P><P>
<B>Quantensprung - die Custom Chips</B>
</P><P>
Der erste, 'Agnus' (manchmal auch als Agnes bezeichnet), ist haupts&auml;chlich
f&uuml;r DMA zust&auml;ndig. DMA steht f&uuml;r Direct Memory Access, also direkten
Speicherzugriff und bedeutet, da&szlig;, wann immer der Rechner auf den
Arbeitsspeicher zugreifen mu&szlig; (und das passiert nat&uuml;rlich sehr h&auml;ufig),
nicht wie &uuml;blich der Hauptprozessor diese Aufgabe erf&uuml;llen mu&szlig; und damit
f&uuml;r diesen Zeitraum v&ouml;llig ausgelastet ist, sondern Agnus dies &uuml;bernimmt.
Au&szlig;erdem enth&auml;lt Agnus auch den Blitter, eine Einheit, die schnell
Speicherbereiche f&uuml;llen, kopieren und logisch verkn&uuml;pfen kann.
</P><P>
Der zweite Chip hei&szlig;t 'Denise' (w&auml;hrend der Entwicklung wurde er Daphne
genannt). Er ist f&uuml;r Bilderzeugung und Bildaufbau verantwortlich. Mit
einem speziellen Trick, den dieser Chip m&ouml;glich macht, ist es m&ouml;glich
im HAM-Modus (HAM - Hold And Modify) bis zu 4096 Farben darzustellen.
</P><P>
Der dritte nennt sich 'Paula' (lief w&auml;hrend der Entwicklung als Portia)
und ist der einzige, der unver&auml;ndert bis zum Amiga 4000 zum Einsatz kam.
Dieser Custom Chip ist f&uuml;r Ein- und Ausgabe, Interruptverwaltung, sowie
Diskettenzugriffe zust&auml;ndig. Au&szlig;erdem erzeugt Paula auch den Stereosound
&uuml;ber vier unabh&auml;ngige Tonkan&auml;le.
</P><P>
F&uuml;r die damalige Zeit erm&ouml;glichten diese Custom Chips, wie erw&auml;hnt,
unglaubliche Leistungen zu einem guten Preis. Oh nein, guter Preis
bedeutet nicht wenig Geld - der Amiga 1000 war sehr teuer - aber
Maschinen, die &auml;hnliche Leistungen boten, waren um ein vielfaches
teurer. Die heute gewaltig verbesserten PC's, waren damals nur in sehr
wenigen Wohnzimmern zu finden und taugten wirklich nur f&uuml;r gewerbliche
Zwecke. Die Benutzeroberfl&auml;che beim Amiga war bereits intuitiv zu
bedienen, eine Zweitasten-Maus z.B. Standard.
</P><P>
<B>Doch nicht nur das</B>
</P><P>
Au&szlig;erdem unterst&uuml;tzt der Amiga von Hause aus den Fernsehstandard. Es gab
spezielle Custom Chip-Versionen f&uuml;r den amerikanischen und den europ&auml;ischen
Markt, da in Amerika ja 'NTSC' und in den gr&ouml;&szlig;ten Teilen Europas, wie auch hier
in Deutschland, 'PAL' der Fernsehstandard ist. Die Anpassung der Chips an
den europ&auml;ischen Markt verz&ouml;gerte daher die dortige Markteinf&uuml;hrung, so
da&szlig; er jenseits des gro&szlig;en Teiches erst im M&auml;rz 1986 in der Alten Oper in
Frankfurt/Main pr&auml;sentiert wurde.
</P><P>
Seine TV-F&auml;higkeiten er&ouml;ffneten neue M&ouml;glichkeiten Computer in Verbindung
mit Video- und Film-Equipment einzusetzen. Mit einer speziellen
Hardwareerweiterung, dem Sidecar, war er auch in der Lage die
zeitgen&ouml;ssischen PC's zu emulieren, da das Problem der Kompatibilit&auml;t
eines neuen Computers, der nahezu ohne unterst&uuml;tzende Programme auf
den Markt kommt, bereits damals akut war.
</P><P>
<B>Probleme</B>
</P><P>
Doch der Markt f&uuml;r den ersten Multimedia-Computer, der den Namen verdient
hat - in einer Zeit, in der dieser Begriff noch nicht so abgegriffen war -
und der in der Lage war, Sound in Sprachqualit&auml;t zu liefern (er war der
erste Computer der mit Software zur Sprachsynthese ausgeliefert wurde),
gleichzeitig in hoher Qualit&auml;t Filme und Musik abzuspielen, bzw.
hochaufl&ouml;sende Grafiken anzuzeigen, war weniger im Gesch&auml;ftsbereich, als
im Heimsegment angesiedelt, das Commodore ja mit dem C64 erobert hatte.
Daf&uuml;r war der Preis, mit &uuml;ber 6.000 DM bei der Einf&uuml;hrung, aber zu hoch,
seine Herstellung zu teuer und die Verbreitung somit zu gering.
Finanzprobleme (1986 verzeichnet die Firma bedrohlich hohe Verluste) bei
Commodore lie&szlig;en derweil auch die originale Entwicklergruppe von Amiga
schrumpfen, bis die Abteilung in Los Gatos 1987 schlie&szlig;lich ganz
geschlossen wurde.
</P><P>
<B>Die n&auml;chste Amiga-Generation</B>
</P><P>
Eine neue Produktreihe mu&szlig;te her. Das war dann ab 1987 der Amiga 2000 im
Desktop-Geh&auml;use, der die professionellen Anspr&uuml;che befriedigen sollte, und
der legend&auml;re Amiga 500, der dieselbe Technik, bis auf die
Schnittstellenfreudigkeit, in einem Tastaturgeh&auml;use vereinte. Bis auf
Detailverbesserungen basierten A 500 und A 2000 grunds&auml;tzlich auf der
Technik des Amiga 1000.
</P><P>
Mit diesen beiden Modellen begann der Amiga dann, nach einigen
Anlaufschwierigkeiten, die Erfolgsleiter hinaufzuklettern. Denn bisher
hatte es trotz Erfolgen gro&szlig;e Probleme gegeben: die Einf&uuml;hrung der neuen
Modelle hatte zu lange gedauert, zu wenig gute Software war erschienen
und Marketingprobleme, eigentlich &uuml;ber den gesamten Zeitraum, taten das
ihre. Neben dem scharfen Konkurrenten Atari, waren es aber auch Modelle
aus dem eigenen Hause, die dem Amiga das Leben schwer machten.
</P><P>
<B>...und trotzdem wird der Amiga ein Erfolg</B>
</P><P>
Nach dem Flop der neuen Produktlinie C16/C116 und Plus4 (vor der
Einf&uuml;hrung als 264 und 364 bezeichnet), die urspr&uuml;nglich den C64 abl&ouml;sen
sollten, wurde der C 128 herausgebracht. Ihn gab es als Desktop-Modell mit
abgesetzter Tastatur und auch in der Form des 'Tastaturcomputers', in der
er optisch dem Amiga 500 sehr &auml;hnelte. Der C 128 war unumstritten
leistungsf&auml;higer als der C64, hatte es aber schwer aus dem Schatten des
kleinen Bruders zu treten und verdankte die Tatsache, kein totaler
Reinfall zu werden, dem Umstand, da&szlig; er einen C64-Modus besa&szlig;, in dem
er sich beinahe wie ein C64 verhielt und dessen Softwarepool benutzen
konnte.
</P><P>
Das Problem dabei war, da&szlig; Commodore seine Ressourcen nicht zum
&uuml;berwiegenden Teil f&uuml;r die hoffnungsvolle neue Technologie Amiga
einsetzte, sondern 'auf zu vielen Hochzeiten tanzte'. Zwar war Commodore
in seiner Glanzzeit, also in diesem Moment, ein weltweiter Konzern und der
Umsatz und Marktanteil waren sehr gro&szlig;, aber dies wurde zum gr&ouml;&szlig;ten Teil
im heute 'Consumermarkt' genannten Bereich, also bei den privaten Kunden
erreicht - einem Feld, in dem die Preise durch die Konkurrenz st&auml;ndig
sinken und der Gewinn bei gleichbleibenden Produktionskosten im Verh&auml;ltnis
gering ausf&auml;llt. Im schlimmsten Fall ist in Situationen, in denen dann der
Absatz sinkt, nur eine ungen&uuml;gende Finanzdecke vorhanden, um mit neuen
Innovationen das Ruder wieder herumzurei&szlig;en.
</P><P>
Das Commodore seine Anstrengungen nicht b&uuml;ndelte und somit zu geringe
Ressourcen freimachte, bezieht sich hier also nicht nur einfach auf
Finanzmittel, sondern auch auf die Nutzung und &Uuml;berlastung der
Entwicklungskapazit&auml;ten. Lange Zeit kam zu wenig Neues heraus, gerade
bei einem Hersteller, der keine Lizenzen f&uuml;r Nachbauten vergibt (Klone
haben den Siegeszug des IBM-PCs erm&ouml;glicht) sind eigene, best&auml;ndige
Neuerungen eine Notwendigkeit, da Fremdhersteller kaum die M&ouml;glichkeit
haben, entscheidende Weiterentwicklungen herauszubringen. Zwar kamen
von Commodore 1988 Beschleuniger- bzw. PC-Emulatorkarten f&uuml;r den Amiga
2000 heraus, der damit teilweise unter anderen Bezeichnungen (Amiga 2500)
auch als Bundle (Paket), ausgeliefert wurde, aber erst 1990 gab es einen
wirklichen neuen Amiga-Rechner.
</P><P>
<B>Ein wirklicher Fortschritt</B>
</P><P>
Am 24. April 1990 wurde in Amerika der 'Amiga 3000' vorgestellt. Das
gelungene Design hatte zwar die Schattenseite, da&szlig; weniger
Erweiterungskarten als im A 2000 in ihm Platz hatten, daf&uuml;r entsprachen
die Steckpl&auml;tze aber einem neuen Standard: Zorro-III, mit vollen 32-Bit
Bandbreite.  Als Zorro-I galt der A 1000-Steckplatz und mit Zorro-II
bezeichnete man die Steckpl&auml;tze, die im A 2000 verwendet wurden. Der ab
Werk eingebaute neue Hauptprozessor war nun die echte 32-Bit-CPU 68030
von Motorolla, entweder mit 16 oder mit 25 MHz, und neben einem
verbesserten Board-Design und einer SCSI-Schnittstelle, gab es ein
neues ver&auml;ndertes (Custom-)Chipset 'ECS'.
</P><P>
'ECS' steht f&uuml;r Enhanced Chipset (verbessertes Chipset).  Damit wurden
zwar ein paar neue Bildschirmmodi m&ouml;glich, in der Praxis waren sie aber
durch eine designbedingte viel zu geringe Geschwindigkeit, au&szlig;er in ein
paar Spezialf&auml;llen, kaum zu verwenden und wurden auch danach von nur
wenigen Anwendungen unterst&uuml;tzt. Der zus&auml;tzliche Chip Amber sorgte daf&uuml;r,
da&szlig; die bisher interlaceten (flimmernden) Grafikmodi, wie bei einem
sogenannten Flickerfixer entflimmert werden.
</P><P>
Gegen&uuml;ber ECS machte die neue OS-Version schon mehr Furore. Amiga-OS 2.0,
lange Zeit lief es w&auml;hrend der Entwicklung als Version 1.4, bot eine,
gegen&uuml;ber den bisherigen Versionen, stark verbesserte Leistung, moderneres
Outfit und eine solide Grundlage f&uuml;r kommende OS-Versionen.
</P><P>
Nur in Gro&szlig;britannien wurde ab 1990 der Amiga 1500 verkauft. Dabei
handelte es sich aber lediglich um einen handels&uuml;blichen Amiga 2000
mit zweitem Diskettenlaufwerk und 1 MByte RAM.
</P><P>
<B>Der ganz andere Markt - Amerika</B>
</P><P>
Danach folgte wieder eine Zeit der relativ gro&szlig;en Stagnation von Seiten
Commodores. Der Amiga war inzwischen ein echter Erfolg - Atari, mit dessen
Benutzern teilweise verbale Glaubenskriege ausgefochten wurden, nun auf
dem absteigenden Ast. Die meisten Amigas waren allerdings in Europa
verkauft worden, insbesondere mit Deutschland und sp&auml;ter auch
Gro&szlig;britannien als Zentren. In den USA, dem (neben Asien) anderen
bedeutenden Absatzmarkt der Welt, ging es kaum vorw&auml;rts. Ein wichtiger
Mitgrund daf&uuml;r, war die dort traditionell hohe Verbreitung des Apple
Macintosh in einer der Dom&auml;nen des Amigas: im Wohn- bzw. Kinderzimmer.
Der Amiga 500 kam so kaum an.
</P><P>
Aber wie dieses Beispiel schon zeigt: Amerika ist und war ein anders
aufgebauter Markt. Dort gibt es z.B., anders als in den L&auml;ndern Europas,
viele kleine, lokale Fernsehstationen, die &uuml;ber verh&auml;ltnism&auml;&szlig;ig wenig Geld
verf&uuml;gen und daher nach preiswerter Technik Ausschau halten.
Videobearbeitung war eine der entscheidenden F&auml;higkeiten des Amigas, die
ihn dort beliebt machen sollten und mit zur Entwicklung leistungf&auml;higer
L&ouml;sungen im Video- und Grafikbereich beitrugen. Im privaten Bereich, im
Massenmarkt, spielte der Amiga selbst in der Zeit seines Zenits, in den
USA nur eine unbedeutende Rolle und galt als Exot. Eine spezielle
Neuentwicklung machte ihn in Fachkreisen aber bekannt und sie kam
nicht von Commodore selbst.
</P><P>
Es handelte sich um den 'VideoToaster'. Dies ist eine spezielle Hard- und
Software-Erweiterung, die meistens bereits in Amigas eingebaut ausgeliefert
wurde. Die so ausgestatteten Amigas beherrschten dann professionelle
Effekte, die sonst nur mit um einige Faktoren teureren speziellen Effekt-
und Schnittcomputern zu realisieren waren. Diese lagen au&szlig;erhalb des
Budgets der kleinen Fernsehstationen - der Amiga, bzw. VideoToaster,
nicht. Diese Technik war allerdings auf den amerikanischen TV-Standard
NTSC ausgelegt und eine Anpassung an das europ&auml;ische PAL-Format erfolgte,
trotz gegenteiliger Planungen/Statements der Herstellerfirma 'NewTek',
nie.
</P><P>
So blieb dieser Erfolg auf die USA beschr&auml;nkt, war vielleicht in dieser
Form auch nur da m&ouml;glich, und der Amiga hatte sich in einem professionellen
Bereich eine Nische erobert. In mehreren Staffeln der TV-Serien Seaquest
und Babylon 5 sind alle Trickeffekte und die Au&szlig;enumgebung (unter Wasser,
bzw. im Weltraum) mit VideoToastern (sprich Amigas) erstellt worden. Zu
seinem Nachteil konnte Commodore den Erfolg der VideoToaster nie
publicitytr&auml;chtig ausnutzen, da auf den von au&szlig;en handels&uuml;blichen Amigas
jeder Hinweis auf den Hersteller getilgt worden war und stattdessen
Schildchen mit der neuen Bezeichnung 'VideoToaster' und 'NewTek'
angebracht waren.
</P><P>
<B>Ganz anders / ganz erfolglos</B>
</P><P>
Mit einer anderen bahnbrechenden Entwicklung hoffte Commodore inzwischen
Neuland zu betreten: dem 'CDTV'. Diese Abk&uuml;rzung steht unvermuteterweise
f&uuml;r 'Commodore Dynamic Total Vision'. Dabei handelte es sich im Grunde um
einen Amiga 500 mit CD-Laufwerk und Infrarotschnittstelle, im Geh&auml;use
eines HiFi-Ger&auml;tes. Der Look war edel und obwohl man das CDTV auch mit
Tastatur, Floppy und Maus zum Amiga aufr&uuml;sten konnte, wurde dieser Begriff
tunlichst vermieden, denn das CDTV sollte ja insbesondere in den HiFi-Markt
eindringen - Bildung und Spa&szlig; f&uuml;r die ganze Familie liefern.
</P><P>
Das Ger&auml;t, seiner Zeit sicherlich weit voraus, war bereits im Juni 1990
vorgestellt worden, da man aber noch auf Softwareunterst&uuml;tzung warten
wollte, wurde es erst 1991 ausgeliefert. CD's f&uuml;r Computer zu nutzen, galt
damals noch als ziemlich ungew&ouml;hnlich und der Markt wird erst jetzt
langsam bereit, die Verschmelzung der Bereiche Computer, Audio und
TV/Video zu akzeptieren. Zu diesem Zeitpunkt allerdings, kam es, wie es
kommen mu&szlig;te und wie es sp&auml;ter auch Phillips mit einer &auml;hnlichen (und
durch Marketing noch wesentlich mehr gepushten) Entwicklung, dem 'CDi',
ging: es floppte f&uuml;rchterlich! Da half Commodore auch die 1991
erscheinende Towerversion (A 3000 T) des Amiga 3000 wenig.
</P><P>
<B>Seltsame Firmenpolitik</B>
</P><P>
Im Hause Commodore wurde derweil an der bisherigen Firmenstruktur
festgehalten. Neben C64/128, wurden die Amigas und nicht zuletzt auch
konventionelle IBM-kompatible PC's entwickelt und verkauft. Ja, selbst
der C64 wurde weiterentwickelt! Was lange Zeit nur als Ger&uuml;cht galt,
best&auml;tigte sich sp&auml;ter: Ein 'C65' als C64-Nachfolger befand sich nicht
nur im Planungsstadium, sondern es gab bereits funktionst&uuml;chtige
Prototypen des Tastaturrechners, der leistungsf&auml;hig zwischen C 128 und
Amiga 500 anzusiedeln ist. Eine sehr offensichtlich fragw&uuml;rdige
Entwicklung, vom unternehmerischen Standpunkt aus gesehen, so sehr die
Vorstellung eines C65 auch faszinieren mag.
</P><P>
Schlimmer noch als die Verzettelung, waren aber die weiteren
Fehlentscheidungen, die die Amiga-Produktpalette betrafen. Denn f&uuml;r alle
unvermutet, der Amiga 500 stand im Zenit seines Erfolges, brachte
Commodore Anfang 1991 den (optisch identischen) 'A 500+' heraus, der
mit ECS-Chipset und dem (nun nicht mehr so) neuen OS 2.0, sowie 1 MByte
Chip-RAM ausgestattet war und in technischer Hinsicht (s. oben zu ECS)
also nur marginale Verbesserungen gegen&uuml;ber einer rapide verschlechterten
Kompatibilit&auml;t aufwies. Gerade die vielen hardwarenah programmierten Spiele
streikten nun, die ja f&uuml;r viele den Kaufgrund des Amiga 500 darstellten.
Die, mit nun pl&ouml;tzlich zum alten Eisen gestempelten A 500, gef&uuml;llten
Lager, mu&szlig;ten mit Verlust ger&auml;umt und verramscht werden.
</P><P>
<B>Die Ger&uuml;chte und ihr wahrer Kern</B>
</P><P>
1991 war das Jahr der vielen Ger&uuml;chte. Atari, inzwischen doch recht
abgeschlagen, wollte Commodore nicht kampflos das Feld &uuml;berlassen und
steckte seine verbliebenen Kr&auml;fte in das 'Sparrow'-Projekt, das mit
phantastischen technischen Daten von sich Reden machte. Auch von
Commodores Seite aus, wurde viel von neuen Entwicklungen gesprochen,
die sehr phantastisch klangen. Das allgemeine Umfeld wurde schwieriger
f&uuml;r die Hersteller: der C64 lief langsam aus, w&auml;hrend der Amiga 500
dieses Segment langsam v&ouml;llig f&uuml;r sich in Anspruch nahm. Die Preise
fielen also und die PC's begannen langsam auch im Entertainment-Sektor
gef&auml;hrlicher zu werden. Ein Boom der Spielkonsolen von Nintendo und Sega
bereitete allen Computerherstellern, die ebenfalls in diesem Bereich
Marktanteile besa&szlig;en, zunehmend Sorge. Tats&auml;chlich mu&szlig;te Neues her.
</P><P>
Trotzdem erwies sich dann alles zwar nicht als falsch, aber doch als etwas
anders, als gedacht. Der Sparrow (Spatz) des Atari erschien 1992 als Falcon
(Falke) und zeigte zwar, bei einer weitgehenden Kompatibilit&auml;t zum ST,
erstaunliche Merkmale und eine gro&szlig;e Leistungssteigerung, erwies sich aber
dann doch nicht als die Killermaschine, als welche er vorher angepriesen
worden war.
</P><P>
Atari machte zu diesem Zeitpunkt einen Proze&szlig; durch, den Commodore sp&auml;ter
auch noch erleben sollte. Es gab w&auml;hrend der Zeit des Niedergangs kaum
gen&uuml;gend Geld, um die Entwicklung zu finanzieren, aber als das endlich
geschafft war, gab es kaum noch R&uuml;cklagen, um eine ausreichende
rechtzeitige Produktion sicherzustellen, von Werbung ganz abgesehen. So
wurden die, die sich &uuml;berzeugen lie&szlig;en, oftmals auch noch durch
Lieferschwierigkeiten vom Kauf abgehalten und bald zeigte sich, da&szlig; Atari
nicht mehr in der Lage sein w&uuml;rde, sich mit dem Falcon am eigenen Schopf
aus dem Abgrund zu ziehen. Einige Lizenzen zum Nachbau wurden noch an sehr
kleine Unternehmen verkauft und man verabschiedete sich endg&uuml;ltig vom
Computersektor, um sich, radikal verkleinert, der Entwicklung einer neuen
64-Bit-Spielkonsole (Jaguar) zu widmen, die auf einer britischen
Entwicklung der Firma 'Flair' basierte und, nachdem sie fertig war,
allerdings aus den selben Gr&uuml;nden, wie eben beschrieben, auch floppte.
Aber das ist wiedermal eine ganz andere Geschichte.
</P><P>
<B>Commodore immer noch ziellos</B>
</P><P>
Zur&uuml;ck zu Commodore: Es gab unverst&auml;ndlich erscheinende wirre
Entscheidungen der Unternehmensleitung, teilweise erkl&auml;rbar, durch das
sich st&auml;ndig drehende Personalkarussel bei Managern und Entwicklungschefs.
Sie konnte sich, angesichts des zunehmenden Drucks auf dem Markt, nicht
entscheiden, in welche Richtung die Entwicklung eigentlich gehen sollte.
</P><P>
Eine neue Technologie (AA/AGA) war bereits im Februar 1991 fertig geworden.
Jedoch wurde bis Oktober jede Verwendung bzw. Integration in angefangenen
neuen Modellen untersagt. Urspr&uuml;nglich war der Produktionsanlauf eines
'A 3000+' inkl. AGA f&uuml;r April vorgesehen und auch technisch m&ouml;glich
gewesen, ist aber so verhindert worden.
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../cc/9912poin.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../kw/9912netz.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
