<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - Netzwerkgrundlagen 3/4</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Netzwerkgrundlagen 3/4:</H1><b>Anwender-Software</b><br>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>F&uuml;r diesen Kurs sind vier Teile geplant:</P>

<OL>
<LI>Hardware</LI>
<LI>Netzprotokolle (Genesis, MiamiDx)</LI>
<LI><b>Anwendersoftware (Apache, Samba,...)</b></LI>
<LI>Sicherheitsprobleme </LI>
</OL>
</P>

<P>
<B>Roter Teppich</B>
</P><P>
Nachdem Sie nun Ihre Rechner vernetzt und &uuml;ber einen TCP-Stack eine
Verbindung hergestellt haben, k&ouml;nnen Sie endlich auch Anwendungsprogramme
benutzen. Die meisten werden Sie schon besitzen, etwa einen Webbrowser
und ein FTP-Programm.
</P><P>
Haben Sie sich f&uuml;r Genesis oder Miami Deluxe entschieden, k&ouml;nnen Sie Ihren
Amiga zum Internet-Gateway machen, falls er eine W&auml;hlverbindung zum
Internet hat. Hierzu m&uuml;ssen Sie nur &quot;Gateway&quot; (Genesis) oder &quot;IP-NAT&quot;
(Miami Deluxe) aktivieren, und schon werden Anfragen der lokalen Rechner
im Netz ins Internet geroutet und umgekehrt die Antworten aus dem Netz
wieder an die richtigen lokalen Rechner weitergegeben.
</P><P>
In der neuesten Beta-Version besitzt Miami Deluxe nun auch einen IP-Filter
wie Genesis und au&szlig;erdem eine Seite f&uuml;r SysCtrl-Einstellungen, f&uuml;r die
zuvor nur ein Shell-Tool vorlag. Damit kann Miami Dx nun alles, was auch
Genesis kann - bis auf die fehlenden Server, die aber leicht extern
nachr&uuml;stbar sind.
</P><P>
<B>Bevollm&auml;chtigter</B>
</P><P>
Nur als geteilter Internetzugang ist ein lokales Netz aber viel zu schade,
denn man will ja nicht immer gleich ins Internet, was dann richtig Geld
kosten kann. Da empfiehlt es sich, auf dem Gateway-Rechner gleich einen
Proxy einzurichten.
</P><P>
Urspr&uuml;nglich ist &quot;Proxy&quot; ein juristischer Begriff und meint jemanden, der
mit einer Vollmacht ausgestattet ist, also stellvertretend z.B. an einer
Verhandlung teilnimmt.
</P><P>
Ein Netzwerk-Proxy ist also ein Programm, das stellvertretend f&uuml;r alle
Rechner im Netz ans Internet geht. Das hat allerdings den Preis, da&szlig; der
Proxy nur das HTTP-Protokoll unterst&uuml;tzt. FTP, IRC, etc. sind dar&uuml;ber
nicht m&ouml;glich. Der einzige Amiga-Proxy, den ich kenne, ist 'httpproxy0.14'
im Aminet unter comm/tcp, seit Jahren nicht mehr weiterentwickelt, aber
ich habe ihn pers&ouml;nlich seit langem im Einsatz und er erledigt seine Sache
zufriedenstellend.
</P><P>
Um den Proxy zu nutzen, mu&szlig; man ihn einfach nur im Browser eintragen,
statt dem des Providers. Um auf den Provider-Proxy nicht verzichten zu
m&uuml;ssen, kann man 'httpproxy' so konfigurieren, da&szlig; es diesen intern
nutzt - als &quot;Proxy-Proxy&quot;.
</P><P>
Der Vorteil eines Proxys ist, da&szlig; er alle Webseiten eine einstellbare Zeit
lang speichert, und solange nur auf die gespeicherten Seiten zugreift, wie
sie als g&uuml;ltig markiert sind. In dieser Zeit braucht kein Zugriff auf
das Internet zu erfolgen. Ungeeignet ist das nat&uuml;rlich f&uuml;r Seiten, die
t&auml;glich oder noch &ouml;fter aktualisiert werden; f&uuml;r diese mu&szlig; man ihn
ausschalten oder per Reload-Doppelklick die fraglichen Seiten zwangsweise
neu laden. Das ist aber reine Gew&ouml;hnungssache und bald in Fleisch und Blut
&uuml;bergegangen.
</P><P>
Nebenbei kann ein Proxy Seiten, die offline angefordert wurden, aber
nicht vorhanden oder schon abgelaufen waren, beim n&auml;chsten Onlinegehen
automatisch aktualisieren, so da&szlig; sie dann auch offline wieder existent
sind.
</P><P>
<B>Megaspeicher</B>
</P><P>
Die interessanteste Anwendung f&uuml;r ein Netzwerk sind jedoch
netz&uuml;bergreifende Dateisysteme. Oft l&auml;uft die Festplatte auf einem Rechner
schon &uuml;ber, w&auml;hrend auf dem anderen noch massig Platz ist. Wie sch&ouml;n w&auml;re
es, den &uuml;bersch&uuml;ssigen Platz bedarfsgerecht an die anderen Rechner zu
verteilen. Hierzu braucht man nur ein Netzdateisystem wie NFS (Network
File System) oder Samba. F&uuml;r den Amiga gibt es beides, sowohl als Server
zum Exportieren von Amiga-Partitionen, als auch als Client zum Importieren
von Partitionen anderer Rechner.
</P><P>
Unter Windows und MacOS sieht es leider nicht so rosig aus, da sind
alle NFS-Server kommerziell. Lediglich Samba wird von Windows aus
uneingeschr&auml;nkt unterst&uuml;tzt. MacOS hat sowieso ein eigenes Protokoll
(AppleTalk und AppleShare), aber mit einiger Suche wird sich vielleicht
etwas passendes finden lassen. Leider habe ich keinen Mac, so da&szlig; ich
das nicht ausprobieren kann.
</P><P>
Linux unterst&uuml;tzt hingegen NFS vollkommen, es stammt schlie&szlig;lich aus der
Unix-Welt. Auch Samba wird voll unterst&uuml;tzt, wenn ich es auch auf meinem
Rechner einfach nicht zum Laufen bewegen konnte. Ein Vorgeschmack auf die
sch&ouml;ne, neue Linux-Welt der kommenden Amiga-Modelle... [...sollten
wirklich welche erscheinen, was derzeit wieder einmal zweifelhaft ist;
d. Chefred.] Linux unterst&uuml;tzt auch die Mac-Protokolle, so da&szlig; man hier
doch noch Partitionen mit anderen Rechnern teilen kann, wenn man sie
re-exportiert, also die Mac-Partitionen unter Linux abbildet und dann
z.B. per NFS wieder exportiert.
</P><P>
Noch einige Links, die das Samba-Leben etwas einfacher machen:
</P>
<li>Samba 1.9.17p4 - <A HREF="http://www.gbar.dtu.dk/~c948374/Amiga/Samba/download/">http://www.gbar.dtu.dk/~c948374/Amiga/Samba/download/</A>
</li><li>Samba 2.04     - <a href="ftp://ftp.logicalline.de/pub/">ftp://ftp.logicalline.de/pub/</a>
</li><li>SMB-Handler    - <A HREF="http://www.dmbsoft.de/">http://www.dmbsoft.de/</A>
</li><li>SMB-Mounter    - <A HREF="http://linux.tc3net.com/cgi-bin/select.cgi?name=PROGRAMS">http://linux.tc3net.com/cgi-bin/select.cgi?name=PROGRAMS</A>
</li></P><P>
F&uuml;r NFS hat AmiTCP, bzw. Genesis schon einen Client im Paket, der auch
mit Miami bestens funktioniert.
</P><P>
Ein Server ist unter &quot;<A HREF="http://www.warwick.ac.uk/~mavfh/nfsd/">http://www.warwick.ac.uk/~mavfh/nfsd/</A>&quot; zu finden.
</P><P>
<B>Klimmzug</B>
</P><P>
Vor allem Samba ist nicht leicht zu konfigurieren. Das liegt weniger
am Amiga, als an der Sturheit der Windowsversion, die Probleme mit
unverschl&uuml;sselten Passw&ouml;rtern macht und unbelehrbar nach Netzdruckern
und anderen Services sucht. Ein Einbinden des Amiga &uuml;ber Arbeitsgruppen
in einen Windows-PC wollte mir nicht gelingen, erst wenn eine Amiga-
Partition als PC-Laufwerk (z.B. &quot;F:&quot;) eingebunden ist, funktioniert
auch die Arbeitsgruppe.
</P><P>
Eine gute Anleitung findet sich auf der Miami-Homepage:
<A HREF="http://www.nordicglobal.com/MSamba.txt">http://www.nordicglobal.com/MSamba.txt</A>
</P><P>
Bei NFS ist die einzige Stolperfalle die Systemsicherheit von Unix.
Standardm&auml;&szlig;ig ist es dem Systemverwalter &quot;root&quot; nicht erlaubt, auf NFS-
Partionen schreibend zuzugreifen, da es als &quot;root&quot; m&ouml;glich ist, wirklich
alles mit dem Zielrechner anzustellen. Bei Rechnern ohne Userverwaltung
(Amiga, Mac, Windows 9x) ist der einzige User des Systems aber
standardm&auml;&szlig;ig &quot;root&quot;.
</P><P>
Der oben angegebene NFS-Server hat deswegen die Option &quot;allowroot&quot;, das
dem User &quot;root&quot; Schreiberlaubnis erteilt. Es mu&szlig; aber jedem klar sein,
da&szlig; dies ein Sicherheitsloch darstellt, wenn der Rechner auch am Internet
h&auml;ngt.
</P><P>
<B>Klassiker</B>
</P><P>
Aber auch ohne Netzwerkdateisysteme kann man gl&uuml;cklich werden. L&auml;&szlig;t man
auf jedem Rechner einen FTP-Server laufen, so kann man, zumindest vom
Amiga aus, die FTP-Verzeichnisse der anderen Rechner mittels FTPMount
als ein Laufwerk mounten. Der Vorteil ist, da&szlig; FTPMount (im Aminet unter
comm/tcp/FTPMount_1_0.lha, bzw. FTPMount_upd.lha) wesentlich weniger
Speicher verbraucht, als portierte Komplettl&ouml;sungen wie Samba.
</P><P>
Nat&uuml;rlich macht es auch Spa&szlig;, einen eigenen Webserver auf dem Amiga zu
betreiben, nur ist der Nutzen nat&uuml;rlich fraglich, denn in der kurzen Zeit,
die man online ist, wird der Server h&ouml;chstens zuf&auml;llig gefunden...
</P><P>
Wer trotzdem Spa&szlig; daran hat: Im Aminet unter comm/www gibt es eine bunte
Vielfalt an Servern, vom klassischen &quot;Apache&quot; bis zum ARexx-gesteuerten
&quot;hserv&quot;. Wer an der Konfiguration nicht zugrunde gehen will, dem seien
allerdings die Amiga-eigenen Server (PowerWeb, hserv, ...) nahegelegt.
</P><P>
Zu guter Letzt ist die Fern-Administration eines Rechners noch eine
interessante Sache. Unter comm/tcp finden sich einige Telnet-Server, die
f&uuml;r andere Rechner den direkten Zugriff auf eine Amiga-Shell erm&ouml;glichen.
Hier geht wirklich alles, hat jemand eine Telnetverbindung zu Ihrem
Rechner aufgebaut, ist l&ouml;schen und formatieren nur eine Frage des Ein-
oder Vertippens. Deshalb ist es auf jeden Fall unabdingbar, vorher genau
die Anleitung zu den Programmen zu lesen, und die Sicherheitstips genau
zu beherzigen. Finden Sie keine solchen Hinweise, dann lassen Sie lieber
die Finger von dem Programm. Doch zu diesem Thema in der n&auml;chsten und
letzten Netzwerk-Folge mehr.
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../kw/9912ami.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912mmx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
