<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Packer-Kurs 2/2</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><A NAME="Top"><H1>Packer-Kurs 2/2</H1></A>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A>
</DIV>

<p><b>Einf&uuml;hrung:</b><br>
Dieser Kurs widmet sich in zwei Teilen den Packern/Archivern. Im ersten
Teil werden die meistverbreitetsten Packer kurz vorgestellt und ein
Geschwindigkeitsvergleich gemacht. Im zweiten Teil geht es um die Bedienung
und die Optionen.</P>

<ol>
<li><a href="../kw/packer_1.htm">Auflistung und Geschwindigkeitsvergleich</a></li>
<li><b>Bedienung und Optionen</b></li>
</ol>

<hr width=90%>

<p>
<B>Im diesem zweiten Teil</B> beschreibe ich die Bedienung der meistbenutzten Packer.
Ich will und kann hier keine vollst&auml;ndige Beschreibung aller m&ouml;glichen
Optionen und Funktionen geben, die die einzelnen Packer bieten, sondern
nur eine &Uuml;bersicht, wie man die wichtigsten Sachen macht. F&uuml;r eine
genaue Erkl&auml;rung schauen Sie sich bitte die entsprechende Anleitung an.</P>

<BR>
<TABLE ALIGN="CENTER" BORDER=0>
<TR>
    <TD><A HREF="#LZX">LZX</A> / </TD>
    <TD><A HREF="#LhA">LhA</A> / </TD>
    <TD><A HREF="#GZip">GZip</A> / </TD>
    <TD><A HREF="#tar">tar</A> / </TD>
    <TD><A HREF="#UnTGZ">UnTGZ</A> / </TD>
    <TD><A HREF="#UnARJ">UnARJ</A> / </TD>
    <TD><A HREF="#UnRAR">UnRAR</A> / </TD>
    <TD><A HREF="#Ub">&Uuml;bersicht</A></TD>
</TR></TABLE>

<A NAME="LZX"><HR width=70%></A>

                        <H2 align=center>LZX 1.21r</H2>

<p>Aufruf-Maske:</p>
<pre>
    <B>LZX [-&lt;Optionen&gt;] &lt;Kommandos&gt; &lt;Archive&gt; [&lt;Datei&gt;...] [&lt;Zielver&gt;]</B>
</pre><br>

<p><h3>I. Packen/Archivieren</h3></p>

<p>
Das wichtigste Kommando f&uuml;r das Archivieren ist 'a'. Der einfachste Aufruf, um 
ein File in ein Archiv zu &quot;adden&quot; (hinzuf&uuml;gen), lautet daher:</p>

<pre>
    <B>LZX a Archive.LZX DateiA</B>
</pre><p>

Damit wird das File &quot;DateiA&quot; zu dem Archiv &quot;Archive.LZX&quot; hinzugef&uuml;gt
(falls das Archiv noch nicht existiert, wird es erstellt).</p>

<p>Es k&ouml;nnen aber auch mehrere Dateien gleich mit&uuml;bergeben werden:</p>

<pre>
    <B>LZX a Archive.LZX DateiB DateiC Ram:DateiD Work:DateiE</B>
</pre><p>

Mit diesem Aufruf w&uuml;rden die Files &quot;DateiB&quot;, &quot;DateiC&quot;, 
&quot;Ram:DateiD&quot; und &quot;Work:DateiE&quot; dem Archiv hinzugef&uuml;gt werden. 
Dabei ist zu beachten, da&szlig; die Pfadangabe der Dateien DateiD bzw. DateiE *nicht* 
mit abgespeichert wird! Um dies zu erreichen, mu&szlig; eine spezielle Option verwendet 
werden (siehe unten).</p>

<p><B>f&uuml;r Fortgeschrittene:</B><br>
Als Abwandlung des 'a'-Kommandos gibt es das <B>'af'</B>-Kommando (add fast).</p><p>

Es wird einfach anstelle von 'a' verwendet. Der Unterschied ist, da&szlig; LZX nicht 
&uuml;berpr&uuml;ft, ob die hinzuzuf&uuml;gende Datei schon existiert, dadurch wird
der Vorgang erheblich schneller. Allerdings sollte diese Option nur verwendet werden, 
wenn man sichergehen kann, da&szlig; kein File zweimal &quot;geadded&quot; wird. 
</p><p>
Als Beispielanwendung wird in der Anleitung eine FidoNet-Anwendung erw&auml;hnt, bei 
der jedes Mailpaket ein anderen Namen besitzt. Durch die Verwendung von 'af' kann dieser 
Bereich einer BBS erheblich beschleunigt werden.</p>
<p>
Die Kommandos <B>'f'</B> (&quot;freshen&quot;), <B>'r'</B> (&quot;replace&quot;) und 
<B>'u'</B> (&quot;update&quot;) dienen auch dem Hinzuf&uuml;gen von Dateien zu einem 
Archiv.</p><p>

Bei 'f' werden &auml;ltere Dateien durch neuere ersetzt, wobei das letzte 
&Auml;nderungs-Datum der Files beachtet wird. Dabei wird angenommen, da&szlig; ein 
fr&uuml;heres Datum eine &auml;ltere Datei bedeutet. Das Kommando 'r' ersetzt hingegen 
einfach nur bereits existierende Files. 'u' wirkt fast genauso wie 'f', jedoch 
f&uuml;gt es auch neue Datei hinzu (im Gegensatz zu 'f' und 'r').</p>
<p><br>

<h3>II. Entpacken</h3></p>

<p>
Ein Archiv wird entweder mit dem Kommando <B>'e'</B> oder mit <B>'x'</B> entpackt.</p>
<p>
Der einzige Unterschied ist, da&szlig; bei 'e' keine Dateipfade beachtet werden,
bei 'x' hingegen die Pfade (soweit vorhanden) beachtet und ggfs. Unterverzeichnisse 
angelegt werden. Wird das Zielverzeichnis beim Aufruf von LZX nicht angegeben, wird 
das aktuelle Verzeichnis benutzt.</p>
<p><br>

<h3>III. Weitere Kommandos</h3></p>

<p>
Auflisten des Inhalts eines Archivs kann &uuml;ber die zwei Kommandos <B>'l'</B> und
<B>'v'</B> geschehen.</p>
<P>
Der Unterschied ist, da&szlig; 'v' mehr Informationen anzeigt als 'l'. Die meisten 
ausgegebenen Informationen sollten verst&auml;ndlich sein. Die &quot;CRC-32&quot;-Spalte 
gibt die Checksumme der einzelnen Files aus (im Gegensatz zu LhA's 16Bit-CRC verwendet 
LZX eine 32Bit-CRC-Checksumme, was die Sicherheit erh&ouml;ht). Die &quot;m&quot;-Spalte 
gibt den Modus der Kompression von LZX an.</p>
<p>
Um sich eine Datei aus einem Archiv heraus anzeigen zu lassen, mu&szlig; man LZX mit 
<B>'p'</B> aufrufen. Damit l&auml;&szlig;t sich z.B. ein schneller Blick in eine
Readme-Datei werfen, ohne sie extra entpacken zu m&uuml;ssen.</p>
<p>
Wenn man zwei Archive zusammenpacken m&ouml;chte, kann man das <B>'c'</B>
(&quot;concatenate&quot;)-Kommando verwenden. Jedoch ist dabei, genau wie mit 'af', 
Vorsicht walten zu lassen, da LZX keine &Uuml;berpr&uuml;fung vornimmmt, ob die Dateien 
vielleicht schon vorhanden sind.</p>
<p>
Falls man testen m&ouml;chte, ob das Archiv korrekt &uuml;bertragen wurde, kann man 
mit dem Kommando <B>'t'</B> einen Test der Archivs durchf&uuml;hren.</p>
<p>
Es lassen sich zu guter Letzt auch einzelne Dateien aus einem Archiv l&ouml;schen. 
Der entsprechende Aufruf k&ouml;nnte z.B. so aussehen:</p>
<pre>
    <B>LZX d Archiv.LZX DateiB DateiC</B>
</pre><p>
Damit w&uuml;rden die Dateien &quot;DateiB&quot; und &quot;DateiC&quot; aus dem Archiv
&quot;Archiv.LZX&quot; gel&ouml;scht werden.</p>
<p><br>
<h3>IV. wichtige Optionen</h3></p>
<p>
Nun noch eine Beschreibung der wichtigsten Optionen. F&uuml;r eine vollst&auml;ndige 
&Uuml;bersicht schauen Sie bitte in der Anleitung nach.</p>
<pre>
Option   Beschreibung

-e       Archiviert auch leere Unterverzeichnisse.

-F       Mit dieser Option gibt LZX kein Linefeed mehr nach jeder
         (de-)komprimierten Datei aus. Das ist extrem n&uuml;tzlich, da
         je nach Rechner und Archiv das Scrolling der Konsole den
         Pack- bzw. Entpackvorgang erheblich verlangsamt.

-Qf      Mit dieser Option packt LZX schneller (ohne Effizienzverlust),
         ben&ouml;tigt aber 32 KB mehr Speicher.

-r       Mit dieser Option durchsucht LZX bei Verwendung von Jokern
         auch Unterverzeichnisse, um passende Dateien zu finden. Durch
         -r wird normalerweise auch automatisch -x aktiviert.

-w       Hiermit kann ein spezielles Verzeichnis angegeben werden, indem
         LZX seine tempor&auml;ren Dateien anlegt. Dadurch lassen sich auch
         bei geringem Speicher gr&ouml;&szlig;ere Dateien packen. Der Pfad mu&szlig; mit
         einem Semikolon oder Slash enden. Default ist T:

-x       Mit dieser Option speichert LZX auch die Pfadnamen der
         einzelnen Dateien (au&szlig;er die Device-Namen). Dadurch wird
         die Verzeichnisstruktur erhalten. Diese Option wird von -r
         automatisch aktiviert.

-Y       Normalerweise werden Dateien mit bestimmten Endungen nicht
         gepackt, da diese bereits in komprimierter Form vorliegen (z.B.
         '.lha', '.rar', etc.) Mit der -Y Option werden auch diese von LZX
         erneut gepackt.

-0       Hiermit wird der Modus von LZX eingestellt. -0 bedeutet keine
         Komprimierung,
-1       etwas schlechtere Komprimierung als -2,
-2       Default-Einstellung,
-3       bessere Komprimierung als -2,
-9       bestm&ouml;gliche Komprimierung von LZX, jedoch extrem langsam.
</pre>

<A NAME="LhA"><HR width=50%></A>

                             <H2 align=center>LhA</H2>

<p>Aufruf-Maske:</p>
<pre>
 <B>LhA [-&lt;Optionen&gt;] &lt;Kommandos&gt; &lt;Archiv[.LHA]&gt; [[homedir] &lt;Dateispec&gt;...]
     [destdir]</B>
</pre><p>
Der Klassiker unter den Packern. LhA hat fast die gleichen Kommandos und Optionen wie LZX 
(oder genauer: LZX hat die von LhA, da LZX nach LhA programmiert wurde).</p>
<p>
Die Bedienung ist im gro&szlig;en und ganzen die gleiche wie bei LZX, jedoch
unterst&uuml;tzt LhA (unregistriert) einige Optionen nicht bzw. haben sie eine 
andere Bedeutung.</p>

<p><br>
<h3>I. Packen</h3></p>
<p>
Die Option zum Packen entspricht der von LZX, der Aufruf ist daher:</p>

<pre>
    <B>LhA a &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre><p>

Ebenfalls lassen sich mit <B>'c'</B> zwei Archive zusammenfassen, wobei, genau wie 
bei LZX, nicht &uuml;berpr&uuml;ft wird, ob die Dateien schon im Archiv vorhanden
sind.</p>
<p>
Dateien lassen sich auch in ein Archiv verschieben, so da&szlig; die Original-Datei 
gel&ouml;scht wird (Kommando: <B>'m'</B>).</p>
<p><br>

<h3>II. Entpacken</h3></p>

<p>
Die Kommandos zum Entpacken <B>'a'</B> bzw. <B>'e'</B> entsprechen genau LZX.</p>
<p><br>

<h3>III. weitere Kommandos</h3></p>

<p>
Das Auflisten geschieht mit <B>'l'</B> bzw. <B>'v'</B>. Das Testen des Archivs macht
<B>'t'</B> und eine Datei wird aus dem Archiv mit <B>'d'</B> gel&ouml;scht.</p>


<A NAME="GZip"><HR width=50%></A>

                        <H2 align=center>GZip</H2>

<p>
GZip ist eigentlich nur ein Packer und bietet nur eine umst&auml;ndliche M&ouml;glichkeit 
Dateien zu einem Archiv zusammenzupacken. Er wird meist zusammen mit tar, einem reinem 
Archiver, verwendet. tar bietet eine Unterst&uuml;tzung von GZip, so da&szlig; zwei 
getrennte Aufrufe auch vermieden werden.</p>
<p>
Endung einer GZip-gepackten Datei: .gz
Endung eines tar/GZip-Archivs:  .tgz oder .tar.gz
</p><p>
Aufruf-Maske von GZip:</p>
<pre>
    <B>gzip [-cdfhlLnNrtvV19] [-S Suffix] &lt;Datei ...&gt;</B>
</pre><p><br>

<h3>I. Packen</h3></p>

<p>
Normalerweise packt GZip einfach die &uuml;bergebenen Dateien, h&auml;ngt die Endung
'.gz' daran und l&ouml;scht das Original. Bei dieser Verwendung mu&szlig; keine weitere
Option angegeben werden.</p>
<p>
Durch Angabe einer Zahl zwischen 1 und 9 als Option wird die Komprimierungsqualit&auml;t 
beeinflusst. &quot;-1&quot; ist schnell, aber wenig effizient, w&auml;hrend &quot;-9&quot; 
die beste Effizienz ergibt, aber langsamer ist.</p>
<p>
Um f&uuml;r jede Datei eine Ausgabezeile mit der Packratio und dem neuem Dateinamen zu 
bekommen, mu&szlig; <B>&quot;v&quot;</B> als Option angegeben werden. <B>&quot;r&quot;</B> 
sorgt f&uuml;r die bekannte Rekursion.</p>
<p>
Damit die urspr&uuml;ngliche Datei unber&uuml;hrt bleibt, kann die Option <B>&quot;c&quot;</B>
angegeben werden. Dann wird die Ausgabe nach 'stdout' umgeleitet. Um das dann n&uuml;tzlich 
zu verwenden kann sie wieder auf gewohnte AmigaDOS-Weise umgeleitet werden.</p>
<p>
Beispiel:</p>
<pre>
    <B>gzip -c TestDatei &gt;RAM:Datei.gz</B>
</pre><p>
Damit wird die Datei &quot;TestDatei&quot; gepackt und als File &quot;Ram:Datei.gz&quot;
abgespeichert.</p>
<p><br>

<h3>II. Entpacken</h3></p>

<p>
GZip entpackt ein gepacktes File mit <B>&quot;-d&quot;</B>, stellt den urspr&uuml;nglichen
Dateinamen wieder her und l&ouml;scht dann die gepackte Datei. Ansonsten l&auml;&szlig;t
sich ebenfalls die Ausgabe mit &quot;-c&quot; umleiten.</p>
<p><br>

<h3>III. Sonstige Optionen</h3></p>

<p>
Als weitere Optionen kann man mit <B>&quot;-l&quot;</B> bzw. <B>&quot;-lv&quot;</B> einige 
Informationen &uuml;ber eine gepackte Datei abrufen. Mit <B>&quot;-h&quot;</B> erh&auml;lt 
man einen kurzen Hilfstext. Die Option <B>&quot;-t&quot;</B> testet das Archiv. Um eine 
Ausgabe pro gepr&uuml;fte Datei zu erhalten, mu&szlig; wieder die Verbose-Option 
eingeschaltet sein.</p>

<A NAME="tar"><HR width=50%></A>

<H2 align=center>tar</H2>

<p>
&quot;tar&quot; ist ein GNU-Programm, das zum Archivieren von Dateien auf &quot;Tapes&quot;
entwickelt wurde (daher der Name &quot;Tape ARchiver&quot;). Jedoch lassen sich die Archive 
auch auf jedes andere Ger&auml;t umlenken.</p>
<p>
Als typisches Un*x-likes Programm ist die Bedienung etwas gew&ouml;hnungsbed&uuml;rftig 
und m.E. nicht so komfortabel, wie bei den anderen Amiga-Tools. Das zeigt sich z.B. daran, 
da&szlig; zwischen zwei verschiedene Optionen unterschieden wird, je nach dem, ob man ein 
neues Archiv anlegen will oder einem bereits bestehenden Dateien hinzuf&uuml;gen will.</p>
<p>
Die Kommandos von tar beginnen mit einem &quot;--&quot; (ohne die Anf&uuml;hrungsstriche)
und sind meist ganze Worte, jedoch gibt es f&uuml;r die wichtigsten Kommandos eine 
verk&uuml;rzte Schreibweise, die mit einem &quot;-&quot; beginnt und nur aus einem
Buchstaben besteht.</p>
<p>
Eine &Uuml;bersicht der Befehle wird mit dem Aufruf &quot;tar --help&quot; angezeigt und
zeigt auch beide Varianten an. Ich werde daher nicht immer beide Varianten angeben. Da tar 
ein recht komplexes Programm ist, empfehle ich bei h&auml;ufiger Benutzung auf jeden Fall 
die Anleitung zu lesen. Wer lediglich tar ben&ouml;tigt, um .tgz Files zu entpacken, sollte 
dagegen lieber UnTGZ von Oliver Wagner benutzen (siehe unten).</p>
<p>
Empfohlen wird die Portierung aus dem &quot;GeekGadget&quot;-Projekt. Ich habe n&auml;mlich 
noch eine andere Portierung, die allerdings die Pfade nur im Un*x-Stil akzeptiert, was 
sicherlich unn&ouml;tig gew&ouml;hnungsbed&uuml;rftig ist.</p>
<p>
Endung eines tar-Archivs: .tar<br>
Endung einer tar/GZip-Archivs: .tgz oder .tar.gz
</p><p><br>

<h3>I. Archivieren</h3></p>

<p>
Der Aufruf, um ein neues tar-Archiv anzulegen, lautet:</p>

<pre>
   <B> tar --create --file &lt;Archiv&gt; &lt;File1&gt; &lt;File2...&gt;</B>
</pre><p>

Oder mit den abgek&uuml;rzten Optionen:</p>

<pre>
    <B>tar -cf &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre><p>

Damit werden die Dateien File1, File2.. zusammen in das Archiv gepackt, ohne dabei 
gepackt zu werden. Allerdings unterst&uuml;tzt tar auch &quot;compress&quot; und 
&quot;GZip&quot; direkt. Soll das Archiv mit GZip gepackt werden, mu&szlig; die 
Option -z mit angegeben werden (sowohl beim Packen also auch beim Entpacken).</p>

<pre>
    <B>tar -czf &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre><p>

Falls das Archiv bereits existiert und nur die Files hinzugef&uuml;gt werden sollen, 
darf die <B>--create</B> (-c)-Option nicht angegeben werden, da sonst das Archiv 
&uuml;berschrieben wird. In diesem Fall ist die <B>--append</B> bzw. -r Option zu 
verwenden.</p>

<pre>
    <B>tar -rf &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre><p>

Dabei ist jedoch zu beachten, da&szlig; tar nicht checkt, ob die Dateien bereits
im Archiv sind und sie einfach als letzte Dateien hinzuf&uuml;gt. Um bereits
bestehende Dateien upzudaten, gibt es die Option &quot;<B>--update</B>&quot; ('-u').</p>
<p><br>

<h3>II. Entpacken</h3></p>

<p>
Um nun das Archiv wieder zu entpacken, gibt es folgenden Aufruf:</p>

<pre>
    <B>tar -xf &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre><p>

Die <B>'x'</B> Option ist die Kurzfassung von '--extract', womit die angegebenen
Dateien entsprechend ihres Pfades entpackt werden.</p>
<p><br>

<h3>III. Weitere Optionen</h3></p>

<p>
Soll tar anzeigen, welche Dateien bearbeitet werden, ist die Option 
<B>--verbose </B>('-v') mit anzugeben. Z.B.:</p>

<pre>
    <B>tar -cvzf &lt;Archiv&gt; &lt;File1&gt; &lt;File2..&gt;</B>
</pre>

<A NAME="UnTGZ"><HR width=50%></A>

<H2 align=center>UnTGZ 1.5</H2>

<p>
&quot;UnTGZ&quot; von Oliver Wagner (zu finden unter <a href="http://ftp.vapor.com">ftp.vapor.com</A>) 
entpackt Dateien, die mit tar und GZip zu einem Archiv zusammengepackt sind. Als reines
Entpacktool ist es einfacher zu bedienen als tar. Die tar/GZip-Archive enden auf .tgz oder 
.tar.gz</p>
<p>
Der Aufruf von UnTGZ ist denkbar einfach:</p>

<pre>
    <B>UnTGZ &lt;Archiv&gt; &lt;Zielverzeichnis&gt;</B>
</pre><p>

Zum Anzeigen des Inhaltes besitzt UnTGZ noch die Option -v.</p>

<pre>
    <B>UnTGZ -v &lt;Archiv&gt;</B>
</pre>

<A NAME="UnARJ"><HR width=50%></A>

<H2 align=center>Unarj</H2>

<p>
Unarj ist ein Entpacker f&uuml;r den arj-Packer des PC's. Die Bedienung ist relativ 
einfach. Es gibt mehrere Portierungen von Unarj f&uuml;r den Amiga. Deren Benutzung ist 
jedoch gleich.</p>
<pre>
    <B>UNARJ &lt;Archiv&gt;</B>
        Damit wird der Inhalt des arj-Archives angezeigt.

    <B>UNARJ e &lt;Archiv&gt;</B>
        Damit wird das Archiv in das aktuelle Verzeichnis hinein entpackt.

    <B>UNARJ x &lt;Archiv&gt;</B>
        Damit wird das Archiv entpackt und die Pfade der Dateien bleiben
        erhalten.

    <B>UNARJ t &lt;Archiv&gt;</B>
        Damit wird das Archiv getestet.
</pre>

<A NAME="UnRAR"><HR width=50%></A>

<H2 align=center>Unrar</H2>

<p>
Unrar ist ein Entpacker f&uuml;r den PC-Packer rar. Hinweis: Die Version 2.01 von 
Amiga-Unrar hat einen Bug, es sollte daher auf jeden Fall Version 2.02 verwendet 
werden!</p>

<pre>
    <B>Unrar x &lt;Archiv&gt; &lt;Pfad_des_Zielverzeichnisses&gt;</B>
        Zum Auspacken des Archivs.

    <B>Unrar l &lt;Archiv&gt;</B>
        Listet den Inhalt des Archivs.

    <B>Unrar t &lt;Archiv&gt;</B>
        Checkt den Inhalt des Archivs.

</PRE>

<hr width=50%>

<A NAME="Ub"></A>
<h2 align=center>Kommando-&Uuml;bersicht</h2>

<TABLE ALIGN="CENTER" BORDER=1>
<TR><TD></TD><TD align=center><b>Packen</b></TD><TD align=center><b>Entpacken</b></TD><TD align=center><b>Auflisten</b></TD></b></TR>
<TR><TD align=center><b>LhA</b></TD><TD align=center>a         </TD><TD align=center>x oder e</TD><TD align=center>l oder t   </TD></TR>
<TR><TD align=center><b>LZX</b></TD><TD align=center>a         </TD><TD align=center>x oder e</TD><TD align=center>l oder t   </TD></TR>
<TR><TD align=center><b>tar</b></TD><TD align=center>-c oder -r</TD><TD align=center>-x      </TD><TD align=center>-t         </TD></TR>
<TR><TD align=center><b>GZip</b></TD><TD align=center>k.A.     </TD><TD align=center>d       </TD><TD align=center>-l oder -lv</TD></TR>
<TR><TD align=center><b>UnTGZ</b></TD><TD align=center>k.A.    </TD><TD align=center>k.A.    </TD><TD align=center>-v         </TD></TR>
<TR><TD align=center><b>UnARJ</b></TD><TD align=center>k.A.    </TD><TD align=center>x oder e</TD><TD align=center>k.A.       </TD></TR>
<TR><TD align=center><b>UnRAR</b></TD><TD align=center>k.A.    </TD><TD align=center>x       </TD><TD align=center>l          </TD></TR>
</TABLE>

<br>
<DIV ALIGN="CENTER"><A HREF="#Top">Zur&uuml;ck zum Anfang</A></DIV>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="wb_tun4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803inst.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
