<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 09/98 - WBTuning-Kurs 6</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>WBTuning-Kurs 6/6</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<p><b>Einführung:</b><br>
Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench,
der Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich
gibt es unz&auml;hlige Programme, Patches usw., die dazu beitragen (wollen).
Ich werde nicht auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar
Anregungen und Tips dabei sein werden, die noch nicht allen bekannt sind.
</P><P>
Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es
kann sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht
in jedem Fall explizit ein. Eine Demoversion ist so gut wie immer frei
erh&auml;ltlich. Als Quelle fungiert das <A HREF="http://ftp.uni-paderborn.de/aminet/">Aminet</A>.
</P>

<p>Verschiedene Funktionen sind auch in Multifunktions-Commodities integriert.</p>

<hr width=50%>

<p><b>Der Kurs setzt sich aus folgenden Artikeln zusammen:</b></p>

<TABLE BORDER=0>
<TR><TD><OL>
<LI> <A HREF="wb_tun1.htm">Optische WB-Verbesserung</A></LI>
<LI> <A HREF="wb_tun2.htm">Smarte ZusatzFX</A></LI>
<LI> <A HREF="wb_tun3.htm">Disk-Tuning</A></LI>
<LI> <A HREF="wb_tun4.htm">Hilfreiche C-Vitamine</A></LI>
<LI> <A HREF="wb_tun5.htm">Sonstige Helferlein</A></LI>
<LI> <b>Beispiel f&uuml;r Multicommodities: MultiCX</b></LI>
</OL>
</TD></TABLE></P>
<BR>

<hr width=70%>

<H2 ALIGN="CENTER">6. Multicommodities im Einsatz</H2>

<P>Dieses Mal sind wir beim letzten Teil des WBTuning-Kurses angelangt.</P>
<P>Ich werde nicht, wie urspr&uuml;nglich vorgesehen, lediglich einige besondere
Merkmale von MultiCX vorstellen, sondern zus&auml;tzlich das ebenfalls sehr
weit verbreitete MCP. </P><P>
Diese beiden Commodities stehen stellvertretend f&uuml;r einige weitere
Vertreter, die diesen Bereich abdecken, wie z.B. MagicCX, das &uuml;ber
die SASG vertrieben wird.
</P><P>
Nachfolgend handelt es sich um keine Tests, sondern es geht wie immer
um die Verbesserung der WB und die Erleichterung der Arbeit mit ihr.
</P><P>
<B>Kurz allgemein zu den beiden Programmen:</B>
</P><P>
<B>MultiCX</B> ist mit unter 25 KByte besonders klein und f&uuml;r die saubere,
systemkonforme Einbindung in das Betriebssystem bekannt, wodurch nur
in den seltensten F&auml;llen Unvertr&auml;glichkeiten durch MultiCX verschuldet
sein d&uuml;rften. Die neueren Versionen sind leicht eingeschr&auml;nkt. Die
Bedienung bzw. die Ver&auml;nderung der Einstellungen von MultiCX erfolgt im
allgemeinen durch die Tooltypes im dazugeh&ouml;rigen Icon-File. Es gibt aber
von anderer Seite auch eine MUI-Oberfl&auml;che, die das Ganze komfortabler
gestaltet.
</P><P>
<B>MCP</B>, das Master Control Programm (wer den Film Tron kennt, bei dem
klingelts :), ist mit &uuml;ber 90 KByte wesentlich umfangreicher. Der
mitgelieferte MUI-Prefseinsteller, der nat&uuml;rlich nicht permanent
l&auml;uft, ben&ouml;tigt &uuml;ber 200 KByte.
</P><P>
MCP ist in Sachen Systemkonformit&auml;t nicht uneingeschr&auml;nkt zu empfehlen,
da in ihm auch eine gro&szlig;e Anzahl diverser Hacks und Patches integriert
sind, die das originale OS &uuml;berbr&uuml;cken. Es empfiehlt sich daher, nach
einer Installation und erfolgter Einrichtung auf die pers&ouml;nlichen
Bed&uuml;rfnisse, zuerst eine Testphase einzuschieben, in der man das
System beobachtet. Wenn sich diverse Abst&uuml;rze h&auml;ufen, die vor MCP
nicht auftraten, sollte man an einigen kritischen Einstellungen
herumprobieren bzw. sie deaktivieren, bis sich das gibt. Das h&ouml;rt
sich ziemlich gef&auml;hrlich an - ist es aber nur, wenn man diesen Rat
nicht beherzigt. Auf der Haben-Seite von MCP stehen eine fast
unschlagbare Feature-Liste und der Umstand, da&szlig; es Freeware ist.
</P><P>
Dieser Umstand verbietet auch alle Merkmale aufzuz&auml;hlen und zu
erkl&auml;ren. Wer sich genau informieren will, sei auf die, auch jeweils
in Deutsch, vorliegenden Dokumentationen der Programme verwiesen.
</P><P>
Viele Hilfmittel, die in den vergangen Kursteilen besprochen wurden,
sind in einem oder auch beiden Commodities integriert. Ich werde ein
paar von diesen erw&auml;hnen, gehe aber vornehmlich auf die Spezielleren
ein.
</P><P>
In MCP sind einige Dinge eingebunden, die weit &uuml;ber den urspr&uuml;nglich
angepeilten Einsatzbereich eines MultiCommodities hinausgehen. Da
w&auml;re zum Beispiel der komplexe <B>Bildschirm-Manager</B>, mit dem man u.a.
Screenmodes umlenken kann, der aber in der Einfachheit der Bedienung
nicht mit einigen der etablierten Spezialprogramme mithalten kann.
</P><P>
Dann gibt es neben einer guten <B>Hotkey-Verwaltung</B>, in der man die
einsetzbaren Funktionen mit speziellen Tastenkombinationen belegen
kann, auch einige weitere Listen.
</P><P>
Eine davon beinhaltet die sehr sinnvolle Funktion <B>PackerPatch</B>. Hier
kann man Programme angeben, die zuk&uuml;nftig Packerformate wie z.B. XPK,
Powerpacker oder Imploder lesen k&ouml;nnen sollen, obwohl sie von Hause
aus eigentlich dazu nicht f&auml;hig sind.
</P><P>
Bei <B>ToolAlias</B> ist die recht bekannte Funktion gemeint, die beim
Doppelklick auf ein Daten-Icon nicht das unter Standard-Werkzeug
vorgegebene Programm startet, sondern das hier eingestellte (z.B.
bei einem Text statt des vorgegebenen 'More' das bessere 'Muchmore').
</P><P>
Bei <B>AssignPrefs</B> kann man seine Assigns verwalten und somit die Startup-
und User-Startup-Sequence stark verk&uuml;rzen. Aber Vorsicht: wenn man
dieses Angebot nutzt, ist man von nun an auf das Starten von MCP
angewiesen!
</P><P>
<B>Speicher-Patch</B> ist f&uuml;r Grafikkartenbesitzer interessant, da sie im
Normalbetrieb ihres Rechners (au&szlig;er f&uuml;r Soundprogramme) nur FastRAM
ben&ouml;tigen. Hiermit k&ouml;nnen sie die Nutzung dessen forcieren und von
erh&ouml;hter Performance profitieren.
</P><P>
Beim <B>Auswahlfenster Auszeit</B> ist es m&ouml;glich, spezielle regelm&auml;&szlig;ig
auftretende Requester oder Fenster automatisch beantworten zu lassen
(Stichwort: Nervrequester ;). Das macht sich auch gut f&uuml;r l&auml;ngere
Aufgaben, die der Rechner ohne st&auml;ndige Beobachtung ausf&uuml;hren soll
(z.B. Raytracing) und man sicher sein will, da&szlig; nicht pl&ouml;tzlich
bestimmte Meldungen auftreten, die Stunden ungenutzter Zeit ihrer
Beantwortung harren, w&auml;hrend alle anderen T&auml;tigkeiten unterbrochen
sind.
</P><P>
<B>MCX</B> (Kurzform von MultiCX) <B>und MCP gleich</B> (jedenfalls im wesentlichen
von der Funktion her) <B>sind</B> z.B. ein Bildschirmblanker. Bei MCP kann
man Swazblanker-Module verwenden (ansonsten wird der Schirm nur
Schwarz); bei MCX ist ein Moire-Effekt integriert.
</P><P>
Au&szlig;erdem haben nat&uuml;rlich beide jeweils Mausbeschleuniger, Opaque-
Effekt (Fenster werden mit Inhalt verschoben), spezielle Schirm-
und Fensterwechselmechanismen, Nutzung der dritten Maustaste (falls
vorhanden), TrackDisk zur Floppyprefs-Ver&auml;nderung, Flagver&auml;nderungen
(Soundfilter, BlackBorder, Wildstar [als zus&auml;tzliche Jokerfunktion]),
sowie Hilfsfunktionen f&uuml;r den Apple-Emulator Shapeshifter, um nur
einiges herauszugreifen.
</P><P>
Als wichtig empfinde ich auch die <B>MapUmlauts</B>-Funktion, durch die die
deutschen Umlaute automatisch in ihre datenfern&uuml;bertragungstechnisch
unbedenklichen Pendants (z.B. '&auml;' in 'ae') umgewandelt werden.
</P><P>
MCP bietet noch einiges mehr, z.B. auch CycleToMenu, eine SysIHack/
UrouHack-Nachbildung, CacheFont (Fontliste ohne langes Laden sofort),
RamPatch (Ram-Fensterrand zeigt wirklich vorhandenen Speicher an) und
und und...
</P><P>
Das Suchen nach vielen einzelnen Patchs und Hilfsprogrammen kann man
sich mit MCP sparen. Dieses Ziel haben die Programmierer bereits ereicht.
</P><P>
Ob man alles braucht, einem MCP zu &quot;pat(s)chig&quot; ist oder man mehr die
Kontrolle &uuml;ber die einzelnen Programme bevorzugt und mit dem &quot;ma&szlig;volleren&quot;
MCX zufrieden ist, mu&szlig; jeder f&uuml;r sich selbst entscheiden.
</P><P>
Zur WB-Verbesserung tragen mit Sicherheit beide Programme bei.
</P><P>
<B>Ich hoffe</B> der Kurs hat auf einiges aufmerksam machen k&ouml;nnen, was
vielleicht noch nicht allgemein bekannt war. Wenn er Anregungen
vermitteln konnte und wirklich half, ein paar Workbenches zu
'tunen', dann hat er seinen Zweck erf&uuml;llt. <B>Schreibt mir!</B>
</P><P>
<B>Gregor Franz.</B>
</P>
<HR WIDTH="50%">
<P>
eMail-Adressen der Programmautoren:</P>
<UL>
<LI>MultiCX: <A HREF="mailto:m_berndt@wanderer.gun.de">Martin Berndt</A></LI>
<LI>MCP: <A HREF="zerocom@cs.tu-berlin.de">Stefan Sommerfeld</A></LI>
<LI>oder <A HREF="knoke@cs.tu-berlin.de">Michael Knoke</A></LI>
</UL>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../cc/9809bb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0998/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9809inst.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
