<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Landesblindengeld weniger gek&uuml;rzt?</TITLE>
  </HEAD>

  <BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Landesblindengeld weniger
          gek&uuml;rzt?</B></FONT></P>

          <P>Aus der CDU-Fraktion des hessischen Landtages erfuhr
          heute horus aktuell, dass das Landesblindengeld ab 2004
          um 14 Prozent auf 503 Euro abgesenkt werden soll. Ein
          erster Gesetzentwurf sah eine K&uuml;rzung um 30 Prozent
          vor. Vorausgegangen waren intensive Verhandlungen
          zwischen Landesregierung und der CDU-Mehrheitsfraktion im
          Landtag einerseits und Interessenvertretern andererseits.
          Beteiligt waren Blindenverb&auml;nde und der hessische
          Landesbehindertenrat (LBR). &laquo;Wir haben einen
          Kompromissvorschlag gemacht und die Fraktion hat ihn
          &uuml;bernommen&raquo;, meinte LBR-Vorsitzender Michael
          Richter in einer ersten Stellungnahme. Jetzt noch mehr zu
          fordern, w&auml;re unsinnig. sch</P>
          <HR>
          Aus der CDU-Fraktion des hessischen Landtages verlautet
          soeben: 

          <OL>
            <LI>Das Landesblindengeld wird ab 2004 um 14 % auf 503
            Euro abgesenkt. Das Sehbehindertengeld wird dann also
            151 Euro betragen.</LI>

            <LI>Die Dynamisierung der Leistung bleibt
            erhalten.</LI>

            <LI>Minderj&auml;hrige Leistungsempf&auml;nger erhalten
            50 % des BSHG-Blindenhilfesatzes, also 292,50 Euro
            monatlich.</LI>

            <LI>Die h&ouml;here Anrechnung von Pflegesachleistungen
            auf das Landesblindengeld bei der Pflegestufe III wird
            nicht umgesetzt. Es bleibt bei der Anrechnung um 40 %
            bei allen drei Pflegestufen, die damit aus der Praxis
            in das Gesetz &uuml;berf&uuml;hrt wird.</LI>
          </OL>

          <P>Wie hoch die Leistung f&uuml;r minderj&auml;hrige
          Empf&auml;nger des Sehbehindertengeldes ist, k&ouml;nnen
          wir im Moment noch nicht sagen. Wahrscheinlich ist aber,
          da&szlig; es auch hier beim bisherigen Betrag bleiben
          wird.</P>

          <P>Ein erster Gesetzentwurf sah bekanntlich eine
          K&uuml;rzung des Landesblindengeldes um 30 %, die
          Aussetzung der Dynamisierung, die Reduzierung der
          Leistung auch f&uuml;r Minderj&auml;hrige und die
          Anrechnung der Leistungen in der Pflegestufe III zu 60 %
          auf das Blindengeld vor. Wie weiter bekannt wurde, wird
          die Fraktion den in o.g. Sinne ge&auml;nderten
          &Auml;nderungsantrag bereits morgen in zweiter Lesung in
          den Landtag einbringen. Vorausgegangen waren intensive
          Verhandlungen zwischen der Landesregierung und der
          CDU-Mehrheitsfraktion im Landtag einerseits und
          Interessenvertretern andererseits. Beteiligt waren der
          BSBH, der DVBS und der hessische Landesbehindertenrat
          (LBR).</P>

          <P>"Wir haben einen Kompromi&szlig;vorschlag gemacht und
          die Fraktion hat ihn &uuml;bernommen", meinte der
          LBR-Vorsitzende, Michael Richter, in einer ersten
          Stellungnahme. "Jetzt noch mehr zu fordrn, w&auml;re
          unsinnig", f&uuml;gte er hinzu. In der Tat hatte der LBR
          am gestrigen Montag eine Modellrechnung vorgelegt, aus
          der hervorging, da&szlig; das anvisierte Sparziel auch
          mit einer deutlich moderateren K&uuml;rzung erreicht
          werden kann. Damit untermauerte er eine Argumentation,
          die auch der DVBS in einem Gespr&auml;ch mit
          Fraktionsvertretern und der Sozialministerin am letzten
          Donnerstag bereits in die Diskussion eingebracht
          hattte.</P>

          <P>Die Verb&auml;nde werden bereits am heutigen
          Dienstagabend dar&uuml;ber befinden, ob und ggf. in
          welcher Weise weitere Aktionen sinnvoll sind. F&uuml;r
          Michael Richter ist das erreichte zun&auml;chst ein gutes
          Ergebnis, das Mut f&uuml;r die Zukunft macht. "Vielleicht
          sollte sich unser Blick nun Richtung Berlin wenden, wo
          mit dem Sozialgesetzbuch XII weiteres Unheil lauert",
          meinte der LBR-Chef und dankte abschlie&szlig;end allen
          Betroffenen f&uuml;r deren enormen Einsatz beim Kampf ums
          hessische Blindengeld.</P>

          <P>Michael Herbst<BR>
          DVBS-&Ouml;ffentlichkeitsarbeit</P>
          <HR>

          <H2>"Bei den Blinden spare ich zuletzt"</H2>

          <P>Dieses Zitat stammt von niemand geringerem als dem
          bayerischen Ministerpr&auml;sidenten Edmund Stoiber. Es
          ist jetzt so weit.</P>

          <P>Nach "althessischem" Vorbild will auch der Freistaat
          das Blindengeld um 30 % auf 409 Euro monatlich
          k&uuml;rzen. Dies meldeten heute die Medien. Der
          bayerische Blinden- und Sehbehindertenbund (BBSB)
          best&auml;tigt die Information. Das Mitglied der dortigen
          Blindengeld-Task-Force, Dr. Demmel, wei&szlig; zu
          berichten, da&szlig; man zun&auml;chst die Abschaffung
          diskutierte, sich im Sozialministerium dann aber
          entschlo&szlig;, sich bei der K&uuml;rzung am Vorgehen
          der Freunde n&ouml;rdlich der Main-Linie zu
          orientieren.</P>

          <P>Diese Information gibt den BBSB jetzt wiederum
          Anla&szlig; zur Hoffnung. Denn im hessischen Landtag
          wurde von der CDU-Mehrheitsfraktion gestern ein
          ver&auml;nderter Antrag eingebracht, der vorsieht, das
          Blindengeld auf 503 Euro und also "nur" um 14 %
          abzusenken. Eine Delegation des BBSB wird am kommenden
          Dienstag die Gelegenheit haben, diese Neuigkeit &uuml;ber
          den "Wei&szlig;wurst&auml;quator" ins bayerische
          Sozialministerium zu transportieren. Die Ministerin, Frau
          Steevens, hat dem Gespr&auml;chswunsch des Verbandes sehr
          rasch entsprochen. Auch beim Ministerpr&auml;sidenten
          liegt bereits ein Schreiben in dieser Sache.</P>

          <P>Direkt im Anschlu&szlig; an das Gespr&auml;ch bei Frau
          Steevens wird im BBSB dar&uuml;ber beraten werden, wie
          weiter zu verfahren ist. Der bayerische Landeshaushalt
          jedenfalls, soll dem Vernehmen nach im Januar
          verabschiedet werden. Wir warten gespannt auf die
          Ergebnisse der Unterredungen.</P>

          <P>Michael Herbst<BR>
          DVBS-&Ouml;ffentlichkeitsarbeit</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

