<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">

    <TITLE>Untitled Document</TITLE>
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
  </HEAD>

  <BODY bgcolor="#FFFFFF" text="#000000" background="bgd.gif">
    <B>Willkommen im November-Newsletter von BLINDzeln.</B> 

    <P>irgendwie sammeln sich innerhalb weniger Wochen immer
    irrsinnig viele Neuigkeiten an und ich muss mich schon beinahe
    bei euch entschuldigen, dass dadurch unser Newsletter immer so
    umfangreich zu einem regelrechten Roman mutiert. Nehmt es als
    gutes Zeichen hin - es geht vorw&auml;rts.</P>

    <P>Nehmt Euch gem&uuml;tlich eine Tasse Kaffee oder Tee und
    dann viel Spa&szlig; beim Lesen des Newsletters.</P>
    <HR>
    <A name="top"></A> 

    <P><B>Inhaltliche &Uuml;bersicht:</B></P>

    <UL>
      <LI><A href="#a01">1.0 BLINDzeln Statistiken</A></LI>

      <LI><A href="#a02">2.0 Onlinemagazin "No Cover" Ausgabe 116
      erschienen</A></LI>

      <LI><A href="#a03">3.0 BLINDzeln europaweit</A></LI>

      <LI><A href="#a04">3.1 BLINDzeln &Ouml;sterreich</A></LI>

      <LI><A href="#a05">4.0 AS-Newsletter unseres Sponsors
      erschienen</A></LI>

      <LI><A href="#a06">5.0 Vorstellung von Mailinglisten anderer
      Anbieter</A></LI>

      <LI><A href="#a07">5.1 Werbung f&uuml;r
      Mailinglistenbetreiber</A></LI>

      <LI><A href="#a08">5.2 Eigene Mailingliste bei
      BLINDzeln?</A></LI>

      <LI><A href="#a09">6.0 [SIGMUND] komplett</A></LI>

      <LI><A href="#a10">6.1 Fachm&auml;nnische Betreuung bei
      BLINDzeln [SIGMUND]</A></LI>

      <LI><A href="#a11">7.0 Teamverst&auml;rkung in der
      technischen Moderation</A></LI>

      <LI><A href="#a12">7.1 Wir brauchen
      Verst&auml;rkung!</A></LI>

      <LI><A href="#a13">7.2 Moderatorinnen und Moderatoren
      f&uuml;r die n&auml;chsten Foren gesucht</A></LI>

      <LI><A href="#a14">8.0 Listensignaturen (Footer) werden bei
      BLINDzeln umgestellt</A></LI>

      <LI><A href="#a15">8.1 Serverumzug geplant</A></LI>

      <LI><A href="#a16">8.2 Neue Logins bei den
      Kurzvorstellungen</A></LI>

      <LI><A href="#a17">9.0 Das Geheimnis um Mole</A></LI>

      <LI><A href="#a18">9.1 Schlussgru&szlig;</A></LI>
    </UL>
    <HR>
    <A name="a01"></A> 

    <P><B>1.0 BLINDzeln Statistiken</B><BR>
    <BR>
     Unser Mailinglistenserver AS2-Detroit beliefert derzeit: 1786
    EMailpostf&auml;cher. Dadurch, dass User in mehreren Listen
    vertreten sind, ist die tats&auml;chliche Zahl der User: 823.
    Durchschnittlich ist also jeder User in mindestens 2
    Mailinglisten angemeldet.</P>

    <P>Unsere Homepage <A href="http://www.BLINDzeln.de" target=
    "_blank">www.BLINDzeln.de</A> wurde 6062 mal besucht.</P>

    <P>Es gibt derzeit 21 Foren bei BLINDzeln. Eine detailiertere
    &Uuml;bersicht aller Foren bei BLINDzeln bekommt Ihr per EMail
    zugesendet, nachdem Ihr einfach eine leere EMail an:</P>

    <P><A href=
    "mailto:forenindex@blindzeln.de">forenindex@blindzeln.de</A></P>

    <P>gesendet habt.</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a02"></A> 

    <P><B>2.0 Onlinemagazin "No Cover" Ausgabe 116
    erschienen</B></P>

    <P>In gewohnter P&uuml;nktlichkeit ist am 1. November die
    Ausgabe 116 des beliebten Onlinemagazins NoCover erschienen und
    wurde bereits allen Abolesern per EMail zugestellt.</P>

    <P>Auch auf der Homepage der NoCover - http://www.nc-mag.de und
    auf der Homepage http://nocover.blindzeln.de kann die aktuelle
    Ausgabe online gelesen werden. Dar&uuml;berhinaus ist das
    Magazin im Aminet und auf diversen Cover-CD-ROM&acute;s zu
    bekommen. F&uuml;r BLINDzeln gibt es eine Extra-Textausgabe,
    die Ihr in wenigen Tagen unter http://www.nc-mag.de/text
    erreicht.</P>

    <P>Auch die eigene Homepage der NoCover <A href=
    "http://www.nc-mag.de">http://www.nc-mag.de</A> wird immer
    beliebter. Im Oktober haben immerhin bereits 11278
    Onlinereisende die Homepage besucht. Daf&uuml;r, dass es die
    Homepage gerade erst 8 Monate gibt, ist das ein grosser Erfolg,
    &uuml;ber den wir uns freuen.</P>

    <P>Viel Spass mit der neuen NoCover w&uuml;nschen Euch<BR>
     Wolf Zimmer - <A href=
    "mailto:wolf@blindzeln.de">wolf@blindzeln.de</A> und Cord Hagen
    - <A href="mailto:cord@blindzeln.de">cord@blindzeln.de</A></P>

    <P>Die NoCover ist ein kostenloses Onlinemagazin von Lesern
    f&uuml;r Leser. Ein kostenloses EMailabo kann man bekommen,
    indem man eine EMail an:</P>

    <P><A href=
    "mailto:nocover@blindzeln.de">nocover@blindzeln.de</A><BR>
     oder<BR>
     <A href="mailto:nc@blindzeln.de">nc@blindzeln.de</A>
    sendet.</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a03"></A> 

    <P><B>3.0 BLINDzeln europaweit</B></P>

    <P>BLINDzeln hat schon jetzt sehr viele BLINDzler aus allen
    L&auml;ndern unserer Erdkugel und nat&uuml;rlich freuen wir uns
    dar&uuml;ber und sind sehr stolz darauf.</P>

    <P>Schon an den Domains kann man schnell erkennen, aus welchen
    L&auml;ndern unsere BLINDzler kommen, - hier einige
    Bespiele...<BR>
     .cc .cn .edu .hr .info .name .nl .au .ru .org .com .net .de
    .at .ch</P>

    <P>Wir werden nach und nach in unseren Nachbarl&auml;ndern
    St&uuml;tzpunkte bilden, um f&uuml;r BLINDzeln auch ausserhalb
    Deutschlands immer einen direkten Ansprechpartner zu haben. Den
    ersten St&uuml;tzpunkt (bei BLINDzeln "Treffpunkt" genannt)
    haben wir bereits errichtet...</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a04"></A> 

    <P><B>3.1 BLINDzeln &Ouml;sterreich</B></P>

    <P>Wir d&uuml;rfen Euch unseren ersten St&uuml;tzpunkt
    ausserhalb Deutschlands pr&auml;sentieren? Seit dem 2003-10-17
    ist BLINDzeln nun auch in &Ouml;sterreich in der sch&ouml;nen
    Weltstadt Wien pr&auml;sent. Der St&uuml;tzpunkt wird von
    Christine Kahlert geleitet. Unsere Anschrift in &Ouml;sterreich
    ist...</P>

    <P><B><FONT size="+1">BLINDzeln - Treffpunkt
    &Ouml;sterreich<BR>
     Waldgasse 8-10, A-1100 Wien, Austria<BR>
     Phone +43 1 6037735 und +43 1 515523856<BR>
     <A href="http://www.BLINDzeln.at" target=
    "_blank">http://www.BLINDzeln.at</A> <A href=
    "mailto:info@blindzeln.at">info@blindzeln.at</A></FONT></B></P>

    <P>Auch ein eigener Chat f&uuml;r unsere &ouml;sterreichischen
    BLINDzler ist bereits online.</P>

    <P>Im Ircnet findet Ihr den Chatroom <B>#blindzeln.at</B> (In
    &Ouml;sterreich &uuml;ber den IrcserverLinz.irc.at und in
    Deutschland u. a. &uuml;ber irc.fu-berlin.de erreichbar).
    F&uuml;r alle Fragen steht Euch Christine gern zur
    Verf&uuml;gung:</P>

    <P><A href="mailto:info@blindzeln.at">info@blindzeln.at</A></P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a05"></A> 

    <P><B>4.0 AS-Newsletter unseres Sponsors erschienen</B></P>

    <P>Am 2003-10-02 ist der wieder recht umfangreiche <A href=
    "http://www.blindzeln.de/adminsysteme/newssystem/artikelanzeige.php?2003110201"
     target="_self">AS-Newsletter</A> unseres Sponsors All Systems
    erschienen. Mit diesem Newsletter bekommt man in
    unregelm&auml;&szlig;igen Abst&auml;nden aktuelle Trends, tolle
    Angebote, und g&uuml;nstige Schn&auml;ppchen aus einem
    Sortiment von &uuml;ber 25.000 Artikeln in sein EMailpostfach.
    Die Unternehmensgruppe von All Systems bietet ein sehr
    umfangreiche Sortiment in den Bereichen...</P>

    <P><B>Informations- &amp; Medientechnologien<BR>
     IT/TK-Peripherie &amp; Zubeh&ouml;r<BR>
     Software-Entwicklung &amp; Vertrieb<BR>
     Telekommunikation &amp; Mobilfunk<BR>
     Security- &amp; &Uuml;berwachungssysteme<BR>
     Stempel, Marketing &amp; Offset-Druck<BR>
     Show- &amp; B&uuml;hnentechnik<BR>
     Office-Internet-Services<BR>
     Webseitendesign &amp; Shopsysteme<BR>
     Webspace &amp; Domainregistrierung<BR>
     Webserver &amp; Mailinglistensysteme</B></P>

    <P><B>Kompetent + Preiswert + Schnell +
    Zuverl&auml;ssig</B></P>

    <P>Im aktuellen Newsletter gibt es wieder eine reichhaltige
    Auswahl vieler PC-Systeme ab 349,00 Euro. Auch Zubeh&ouml;r
    f&uuml;r den PC und g&uuml;nstiger barrierefreier Webspace
    f&uuml;r die Homepage mit vielen Funktionen und riesigen
    EMailpostf&auml;chern f&uuml;r wenige Cent fehlen
    nat&uuml;rlich nicht. Ein Blick lohnt sich.</P>

    <P>Ein Abo des Newsletters bekommt man per EMail an:</P>

    <P><A href=
    "mailto:as-news-subscribe@as-2.de"><B>as-news-subscribe@as-2.de</B></A></P>

    <P>Wer den gerade aktuellen Newsletter erhalten m&ouml;chte,
    sende bitte eine EMail an:</P>

    <P><A href=
    "mailto:as-news@as-3.de"><B>as-news@as-3.de</B></A></P>

    <P>M&ouml;chte man den aktuellen Newsletter - UND auch ein Abo
    haben, so sollte man am besten beide Adressen anschreiben.</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a06"></A> 

    <P><B>5.0 Vorstellung von Mailinglisten anderer
    Anbieter</B></P>

    <P>Wieder m&ouml;chten wir Euch auch gerne Mailinglisten
    vorstellen, die nicht bei BLINDzeln angeboten werden. Diesmal
    m&ouml;chten wir Euch eine Alternative zu [SIGMUND] von
    BLINDzeln vorstellen. Die neue Liste mit dem Namen
    "Seelische-Probleme" wurde k&uuml;rzlich von Christian Tillmann
    ins Leben gerufen. Hier der Listentext...</P>

    <P>Nicht mit allen Problemen die man hat mu&szlig; man zu einem
    Psychologen gehen. Es reicht unter Umst&auml;nden auch aus, mit
    anderen &uuml;ber seine Probleme offen zu sprechen. Wir alle,
    die wir hier versammelt sind, haben f&uuml;r dich ein offenes
    Ohr und werden dir zuh&ouml;ren. Doch auch wir sind nur
    Menschen die ebenfalls Probleme haben. Darum sind wir auch
    keine Fachleute und &uuml;bernehmen f&uuml;r aus unseren
    Vorschl&auml;gen resultierende Taten keinerlei
    Verantwortung.</P>

    <P>Diese Group ist unmoderiert. Sollte allerings jemand sich
    auff&auml;llig negativ verhalten werde ich f&uuml;r seinen
    Rausschmi&szlig; und dauerhaften Ausschlu&szlig; aus der Group
    sorgen.</P>

    <P>P.S.: F&uuml;r fachm&auml;nnische Unterst&uuml;tzung
    mu&szlig; nat&uuml;rlich eine kompetente Fachperson aufgesucht
    werden, z. B. ein Neurologe, Psychologe oder
    Psychotherapeut.</P>

    <P>Und nun tritt ein und sei gewi&szlig;, wir werden f&uuml;r
    uns da sein!</P>

    <P>Anmeldung mit leerer EMail an: <A href=
    "mailto:join-seelische-probleme@kbx7.de">join-seelische-probleme@kbx7.de</A></P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a07"></A> 

    <P><B>5.1 Werbung f&uuml;r Mailinglistenbetreiber</B></P>

    <P>Ihr habt oder kennt eine gute Mailingliste, die nicht bei
    BLINDzeln angeboten wird? Kein Problem - hier in unserem
    Newsletter stellen wir Eure Mailingliste gerne vor. Wir
    BLINDzler freuen uns &uuml;ber jede angebotene Mailingliste -
    selbstverst&auml;ndlich auch, wenn sie nicht von BLINDzeln
    kommt! Je mehr Angebot, desto besser f&uuml;r uns Alle!</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a08"></A> 

    <P><B>5.2 Eigene Mailingliste bei BLINDzeln?</B></P>

    <P>Oder es gibt scheinbar zu einem Thema noch keine
    Mailingliste? Auch dann k&ouml;nnt Ihr uns schreiben. Wenn die
    Idee auch uns fasziniert, wird es nicht lange dauern und wir
    starten diese Liste dann mit Euch zusammen. Noch besser ist es,
    wenn Ihr diese Liste auch gleich inhaltlich moderieren
    m&ouml;chtet. BLINDzeln bietet Euch den gro&szlig;en Vorteil,
    dass Ihr Euch kein St&uuml;ck mit der Technik befassen
    m&uuml;sst. Durch das duale Moderationssystem bei BLINDzeln
    k&uuml;mmert sich unser technisches Team um alles rund um
    Einrichtung und Verwaltung der Mailingliste und seiner
    Mitglieder. Die inhaltlichen Moderatoren k&ouml;nnen sich dann
    voll auf i</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a09"></A> 

    <P><B>6.0 [SIGMUND] komplett</B></P>

    <P>[SIGMUND] ist komplett<BR>
     Am 20. Juli 2003 startete eines der interessantesten, aber mit
    Sicherheit auch das sensibelste Forum bei BLINDzeln. [SIGMUND]
    war ins Leben gerufen. Mit [SIGMUND] bieten wir ein Forum, an
    das sich Menschen mit seelischen Problemen wenden
    k&ouml;nnen.</P>

    <P>Viele von uns haben es selbst erlebt, dass sie nach einem
    Schicksalsschlag in ein tiefes Loch fielen. Pl&ouml;tzlich,
    nach einer schweren &auml;rztlichen Diagnose, dem Verlust des
    Partners oder der Arbeit steht man allein und hilflos da. Aber
    auch andere Dinge, wie &Auml;ngste, Depression, &Auml;rger in
    der Familie oder im Freundeskreis und &auml;hnliche Dinge
    k&ouml;nnen zu einer seelischen Belastung werden. Bei Sigmund
    findest du immer ein offenes Ohr. Menschen, die aufmerksam
    zuh&ouml;ren und lesen und die versuchen Dir zu helfen.</P>

    <P>Wir, die inhaltlichen Moderatoren Anke Kasbohm, Kornelia
    Faber, Zeljko Pezelj und Jochen Weisenburger lesen alles
    aufmerksam und versuchen zu helfen. Auch die anderen
    Sigmund-User stehen oft mit Rat und einem offenen Ohr zur
    Verf&uuml;gung. Nat&uuml;rlich k&ouml;nnen wir professionelle
    Hilfe nicht ersetzen. Aber oft hilft schon ein Gespr&auml;ch
    mit anderen Betroffenen. Bei Bedarf bieten wir auch an, Kontakt
    zu professioneller Hilfe herzustellen. Sei es in Form von
    Adressen oder Telefonnummern oder auch mal beim oft etwas
    schweren Erstkontakt zu den Profis, sind wir gerne
    behilflich.</P>

    <P>Unterst&uuml;tzend und beratend greifen uns Ursula Remann
    und Richard Schmidt<BR>
     unter die Arme, die durch ihre Menschenkenntnis und
    Lebenserfahrung eine gro&szlig;e Hilfe sind.</P>

    <P>Aber Sigmund wurde erst vor einigen Tagen mit Wolfgang
    Rehmert, dem Leiter des Arbeitskreises Psychologie der Pro
    Retina Deutschland (Zusammenschluss blinder und sehbehinderter
    PsychologInnen und PsychotherapeutInnen) komplett. Er steht uns
    und mit reichlichem Fachwissen und Berufserfahrung bei allen
    Fragen jederzeit zur Verf&uuml;gung.</P>

    <P>Vertrauen, R&uuml;cksicht und Fairness sind das oberste
    Gebot bei Sigmund. Es ist selbstverst&auml;ndlich, dass alles,
    was in der Liste besprochen wird, vertraulich behandelt wird.
    Auch ein r&uuml;cksichtsvoller Umgang miteinander zeichnet
    Sigmund aus. N&auml;heres dazu findet ihr in den
    Nutzungsbedingungen<BR>
     unter Link:</P>

    <P><A href=
    "http://www.blindzeln.de/downloads/sigmund/nutzungbedingungen_v_sigmund.txt"
     target=
    "_self">http://www.blindzeln.de/downloads/sigmund/nutzungbedingungen_v_sigmund.txt</A></P>

    <P>Ihr solltet Euch diese Textdatei lieber herunterladen und in
    Eurer Textverarbeitung durchlesen. Noch einfacher geht alles,
    wenn Ihr Euch diesen Text bequehm per EMail kommen lasst.
    Schreibt hierzu eine leere EMail an:</P>

    <P><A href=
    "mailto:sigmund-nutzung@blindzeln.de">sigmund-nutzung@blindzeln.de</A></P>

    <P>Auch eine von Wolfgang Rehmert zusammengestellte
    Literaturliste findet ihr<BR>
     unter Link:</P>

    <P><A href=
    "http://www.blindzeln.de/downloads/sigmund/literatur/literaturliste.txt"
     target=
    "_self">http://www.blindzeln.de/downloads/sigmund/literatur/literaturliste.txt</A></P>

    <P>Oder Ihr lasst Euch auch diese Liste per EMail kommen.
    Einfach leere EMail an:</P>

    <P><A href=
    "mailto:sigmund-literatur@admin.blindzeln.de">sigmund-literatur@admin.blindzeln.de</A></P>

    <P>Wir laden alle Interessierten ganz herzlich zu [SIGMUND]
    ein!</P>

    <P>Inhaltliche Moderation: Anke Kasbohm, Kornelia Faber, Zeljko
    Pezelj und Jochen Weisenburger.</P>

    <P>Inhaltliche Betreuung: Ursula Rehmann und Richard
    Schmidt.</P>

    <P>Fachm&auml;nnische Betreuung: Wolfgang Rehmert, Leiter des
    Arbeitskreises Psychologie der Pro Retina Deutschland
    (Zusammenschluss blinder und sehbehinderter PsychologInnen und
    PsychotherapeutInnen).</P>

    <P>Direkte Homepage: <A href="http://sigmund.blindzeln.de"
    target="_blank">http://sigmund.blindzeln.de</A></P>

    <P>Anmeldung an [SIGMUND]: <A href=
    "mailto:sigmund-subscribe@blindzeln.net">sigmund-subscribe@blindzeln.net</A></P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a10"></A> 

    <P><B>6.1 Fachm&auml;nnische Betreuung bei BLINDzeln
    [SIGMUND]</B></P>

    <P>Wolfgang Rehmert, geb. 1949 in Bremerhaven. An Retinitis
    pigmentosa erblindet. Gr&uuml;ndungsmitglied und seit 1998
    Leiter des Arbeitskreises Psychologie der Pro Retina
    Deutschland, eines Zusammenschlusses blinder und sehbehinderter
    PsychologInnen und PsychotherapeutInnen. Bis 2002 Erfahrungen
    mit der psychologischen Einzel- und Paarberatung blinder und
    sehbehinderter Menschen. Ver&ouml;ffentlichungen,
    Vortragsreisen und Seminare in Deutschland und &Ouml;sterreich.
    Seit Oktober 2003 aktiv bei [SIGMUND] als psychologischer
    Berater.</P>

    <P>Telefonische Beratung dienstags 18 - 21 Uhr,</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a11"></A> 

    <P><B>7.0 Teamverst&auml;rkung in der technischen
    Moderation</B></P>

    <P>BLINDzeln w&auml;chst in allen Bereichen nahezu
    t&auml;glich. Ob bei den BLINDzlern, in den Foren, den
    inhaltlichen Moderatorinnen und Moderatoren und somit war auch
    in der technischen Moderation Verst&auml;rkung dringend
    notwendig. Und um unsere Frauenquote auch hier in den Griff zu
    bekommen sind wir froh, von unserer Anja Winkler keinen Korb
    bekommen zu haben. Anja steht seit Oktober in der technischen
    Moderation BLINDzeln zur Verf&uuml;gung und hat auch f&uuml;r
    Eure Fragen immer ein offenes Ohr.</P>

    <P>Aber auch die wieder vielen inhaltlichen
    Moderationskolleginnen und Kollegen, die neu hinzugekommen sind
    m&ouml;chten wir hier offiziell noch einmal Willkommen heisen.
    Es sind gerade diese vielen aktiven Helfer, die BLINDzeln so
    schnell vorantreiben.</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a12"></A> 

    <P><B>7.1 Wir brauchen Verst&auml;rkung</B></P>

    <P>Wir sind st&auml;ndig auf der Suche nach fleissigen
    Menschen, die mit uns zusammen an BLINDzeln bauen m&ouml;chten.
    Schaut zwischendurch immer wieder mal im Bereich [Jobs] auf
    unserer Homepage http://www.blindzeln.de nach, wenn Ihr gerne
    mitmachen m&ouml;chtet.</P>

    <P>Besonders suchen wir Verst&auml;rkung in der inhaltlichen
    Moderation bestehender Foren und auch bei neuen geplanten Foren
    bei BLINDzeln.</P>

    <P>F&uuml;r unsere Foren...</P>

    <P><B>PINGUIN<BR>
     BRANDMAUER<BR>
     GAMEPORT<BR>
     BLINDFISCH</B></P>

    <P>suchen wir noch Moderatorinnen und Moderatoren f&uuml;r die
    inhaltliche Moderation zur Unterst&uuml;tzung.</P>

    <P>Die Aufgaben einer inhaltlichen Moderation bei BLINDzeln
    bestehen darin, ein Forum lebendig zu halten. Wenn sich also
    l&auml;ngere Zeit in einem BLINDzelnforum nichts tut, sollte
    ein iMOD (inhaltlicher Moderator) versuchen, das Forum wieder
    in Gang zu bringen. So kann man beispielsweise neue Themen zur
    Diskussion vorschlagen oder zum Forenthema passende
    Beitr&auml;ge aus dem Internet suchen und in das Forum
    einstellen. Sollten sich Streitereien in einem Forum anbahnen,
    sollte man als iMOD dem sensibel entgegenwirken.
    Dar&uuml;berhinaus sollten iMODs von BLINDzeln Material zum
    Thema sammeln, damit wir f&uuml;r jedes Forum a</P>

    <P>Wenn Du auch gerne aktiv bei BLINDzeln helfen m&ouml;chtest
    und eine Moderation &uuml;bernehmen m&ouml;chtest, - dann melde
    Dich bitte bei uns....</P>

    <P><A href="mailto:job@blindzeln.de">job@blindzeln.de</A></P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a13"></A> 

    <P><B>7.2 Moderatorinnen und Moderatoren f&uuml;r die
    n&auml;chsten Foren gesucht</B></P>

    <P>Eifrig planen wir schon wieder an den n&auml;chsten Foren,
    die bei BLINDzeln bald starten sollen. Auch hierf&uuml;r
    ben&ouml;tigen wir aber Eure Unterst&uuml;tzung. Wenn Euch
    eines der folgenden Themen besonders anspricht, Ihr Euch gut
    auskennt damit oder einfach Lust und Interesse zu einer
    Moderation habt, dann meldet Euch doch mal bei uns. Ihr solltet
    aber bitte wirklich Interesse und Zeit daf&uuml;r
    mitbringen!</P>

    <P>Geplant ist bei BLINDzeln demn&auml;chst...</P>

    <P><B>[TRABBI]</B> - Erinnerungen an den Osten, oder was
    Wessies schon immer mal wissen wollten. Ihr solltet passender
    Weise vielleicht die Wende aus den neuen Bundesl&auml;ndern
    miterlebt haben und auch f&uuml;r dieses Thema rund um
    "Ostalgie" sehr empf&auml;nglich sein.</P>

    <P><B>[METROPOLIS]</B> - Interessantes und Wissenswertes zu
    allen Metropolen dieser Erdkugel. Andere St&auml;dte, andere
    L&auml;nder, andere Menschen, andere Sitten. Hierf&uuml;r
    solltet Ihr bestenfalls schon recht gut "herumgekommen" sein
    oder Euch sehr f&uuml;r Reisen und Weltgeschehen
    interessieren.</P>

    <P><B>[SOKRATES]</B> - Die Liste rund um die Philosophie. Hier
    haben wir eventuell bereits einen Moderator, der aber gerne
    Unterst&uuml;tzung h&auml;tte. Ist die Philosophie Euer
    beliebtes Thema? Dann helft uns doch, ein Forum daf&uuml;r
    aufzubauen.</P>

    <P>Bedenkt bitte, dass die Namen der Foren lediglich
    Projektnamen sind und sich noch &auml;ndern k&ouml;nnen - das
    Thema bleibt nat&uuml;rlich.</P>

    <P>F&uuml;hlt Ihr Euch von einem dieser Themen besonders
    angesprochen? Vielleicht ist sogar Euer Hobby dabei? Dann seit
    Ihr genau die Richtigen und wir hoffen auf Eure EMail an:</P>

    <P><A href="mailto:job@blindzeln.de">job@blindzeln.de</A></P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a14"></A> 

    <P><B>8.0 Listensignaturen (Footer) werden bei BLINDzeln
    umgestellt</B></P>

    <P>In einigen Mailinglisten von BLINDzeln habt Ihr es
    vielleicht schon bemerkt. So nach und nach &auml;ndern wir die
    Listensignaturen (Listenfooter) um, damit sie noch effektiver
    von Euch genutzt werden k&ouml;nnen. Der Listenfooter ist der
    kleine Text ganz unten am Ende jeder EMail, die &uuml;ber die
    Mailinglisten von BLINDzeln verteilt wird.</P>

    <P>K&uuml;nftig wird der Listenfooter &auml;hnlich wie dieses
    Beispiel aussehen:</P>

    <P><B>Dein Abo von [Forumname] bearbeiten oder abmelden?<BR>
     http://www.blindzeln.net/mailman/options/forumname/email%40adresse.de<BR>

     [Forumname]-Homepage: http://forumname.blindzeln.net</B></P>

    <P>Nat&uuml;rlich wird statt des "Forumname"ns wirklich der
    Name der Mailingliste angezeigt, in deren Mail Ihr den
    Listenfooter findet. Man kann dann auf den Link in der
    mittleren Zeile klicken und gelangt immer zu seinen eigenen
    ganz pers&ouml;nlichen Einstellungen zu der jeweiligen
    Mailingliste. Dort k&ouml;nnt Ihr alle Einstellungen zu Eurem
    Zugang selbst &auml;ndern. Wenn Ihr zB. die EMails einer Liste
    in einer Sammlung erhalten m&ouml;chtet, oder mal
    vor&uuml;bergehend wegen Urlaub etc. gar keine EMails aus der
    Liste bekommen m&ouml;chtet, oder auch abmelden und Euch Euer
    Passwort zusenden lassen, - das k&ouml;nnt Ihr alles &uuml;ber
    diesen Link. Ihr seht, auch</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a15"></A> 

    <P><B>8.1 Serverumzug geplant</B></P>

    <P>Es ist mal wieder soweit. Wir wollen noch mehr Leistung
    haben und werden daher vermutlich im Dezember mit BLINDzeln auf
    einen neuen Server umziehen. Unser Sponsor www.ConnectWeb.de
    mietet einen neuen Hochleistungsserver mit etwa der
    f&uuml;nfachen Leistung des jetzigen Servers AS3-Chicago an und
    auch BLINDzeln soll davon profitieren d&uuml;rfen. Das Ganze
    sollte relativ unspektakul&auml;r von statten gehen und sowohl
    unsere Homepages als auch EMailpostf&auml;cher sollten ohne
    Ausfallzeiten dann ab sp&auml;testens dem neuen Jahr auf
    AS4-Memphis laufen. Es k&ouml;nnte h&ouml;chstens passieren,
    dass es zu leichten Verz&ouml;gerungen bei</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a16"></A> 

    <P><B>8.2 Neue Logins bei den Kurzvorstellungen</B></P>

    <P>Alle Zug&auml;nge zum Bereich [Kurzvorstellungen] auf
    unserer Homepage wurden personalisiert. Es gibt also kein
    allgemein g&uuml;ltiges Zugangssystem mehr. Jeder BLINDzler,
    der seine Kurzvorstellung abgegeben hat, hat von uns seine ganz
    pers&ouml;nlichen Zugangsdaten per EMail zugesendet bekommen.
    Wir konnten hierf&uuml;r nat&uuml;rlich nur die EMailadressen
    verwenden, die in den Kurzvorstellungen angegeben wurden.
    Leider mussten wir feststellen, dass einige BLINDzler
    zwischenzeitlich andere EMailadressen nutzen, ohne uns diese
    mitgeteilt zu haben. So kamen einige Zugangsdaten nicht
    zugestellt mit Fehlermeldung zur&uuml;ck.</P>

    <P>Wer jetzt seine Kurzvorstellung schon abgegeben hat, aber
    noch nicht seine pers&ouml;nlichen Zugangsdaten bekommen hat,
    m&ouml;ge sich bitte an Nathalie wenden, die f&uuml;r den
    Bereich der Kurzvorstellungen zust&auml;ndig ist. Ihr erreicht
    Nathalie per EMail an:</P>

    <P><A href=
    "mailto:nathalie@blindzeln.de">nathalie@blindzeln.de</A></P>

    <P>Selbstverst&auml;ndlich k&ouml;nnt Ihr Euch nach wie vor
    gerne an den Kurzvorstellungen beteiligen! Der Bereich
    "Kurzvorstellungen" ist nur f&uuml;r BLINDzler zug&auml;nglich,
    die sich selbst in diesem Bereich den anderen BLINDzlern
    vorgestellt haben. Wenn Du also gern die anderen BLINDzler
    kennenlernen m&ouml;chtest, so sende uns bitte zuerst auch
    Deine Kurzvorstellung per EMail. Erst dann erh&auml;ltst Du die
    Zugangsdaten f&uuml;r diesen Bereich.</P>

    <P>Hierzu haben wir ein kleines Textformular mit einigen Fragen
    vorbereitet, Du kannst es mit einer leeren Mail an...</P>

    <P><A href=
    "mailto:kurzvorstellung@blindzeln.de">kurzvorstellung@blindzeln.de</A></P>

    <P>...anfordern. Schreibe einfach mit der Antwortfunktion
    Deines EMailprogramms Deine Antworten unter die Fragen im
    Textformular und sende Deine vollst&auml;ndige Kurzvorstellung
    dann einfach zur&uuml;ck. Sobald Nathalie Deine Kurzvorstellung
    bearbeitet, bekommst Du dann Deine pers&ouml;nlichen
    Zugangsdaten, die Du selbstverst&auml;ndlich bitte keinesfalls
    weitergibst.</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a17"></A> 

    <P><B>9.0 Das Geheimnis um Mole</B></P>

    <P>Wer oder was ist denn nun wieder Mole? Tja das ist ein
    andere Geschichte und soll ein anderes mal erz&auml;hlt werden.
    Bleibt also gespannt bis wir Euch Mole vorstellen - bis dahin
    ist Mole nicht mehr und nicht weniger, als ein Geheimnis von
    BLINDzeln :-)</P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <A name="a18"></A> 

    <P><B>9.1 Schlussgru&szlig;</B></P>

    <P>Lange Rede kurzer Sinn. Es ist schon erstaunlich, was alles
    in einem Monat bei BLINDzeln passiert. Etwas chaotisch,
    reichlich schnell aber es geht voran - merklich.</P>

    <P>Euer Team von BLINDzeln w&uuml;nscht Euch viel Spass mit
    BLINDzeln.</P>

    <P><B>Herzliche Gr&uuml;&szlig;e<BR>
     Cord Hagen und das komplette Team von BLINDzeln</B></P>

    <P><B>www.BLINDzeln.de - Die Welt mit anderen Augen
    sehen</B><BR>
     Specken 3 D-27308 Kirchlinteln Germany<BR>
     Phone and Fax +49 (0) 4236 1657<BR>
     Fax +49 (0) 721 151576120 SMS +49 (0) 172 5805619<BR>
     <A href="http://www.blindzeln.de" target=
    "_blank">www.blindzeln.de</A> <A href=
    "mailto:info@blindzeln.de">info@blindzeln.de</A></P>

    <P><BR>
    </P>
    <A href="#top">zum Inhaltsverzeichnis</A> 
    <HR>
    <BR>
  </BODY>
</HTML>

