<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">

    <TITLE>Pl&auml;doyer f&uuml;r das Blindengeld</TITLE>
  </HEAD>

  <BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Pl&auml;doyer f&uuml;r das
          Blindengeld</B></FONT></P>

          <H3>Pressemitteilung 21. November 2003</H3>

          <P>50.842 Unterschriften gegen die geplanten
          K&uuml;rzungen &uuml;bergeben</P>

          <P>Am Donnerstag, dem 20.11.2003 fand im Berliner
          Abgeordnetenhaus vor dem Fachausschuss f&uuml;r
          Gesundheit, Soziales und Migration die Anh&ouml;rung zum
          Landespflegegeldgesetz und damit zum Blindengeld statt.
          Der Senat will mit seinem Gesetzentwurf die Leistungen
          f&uuml;r Blinde um 20 Prozent und die f&uuml;r
          Sehbehinderte sogar um bis zu 50 Prozent senken.</P>

          <P>Ca. 160 Blinde und Sehbehinderte waren der
          Aufforderung des Allgemeinen Blinden- und
          Sehbehindertenvereins Berlin gefolgt und waren ins
          Abgeordnetenhaus gekommen. Die Sitzung musste in zwei
          R&auml;ume &uuml;bertragen werden, um Platz f&uuml;r alle
          Zuh&ouml;rer zu schaffen.</P>

          <P>Der Vorsitzende des Allgemeinen Blinden- und
          Sehbehindertenvereins Berlin (ABSV), Dr. Manfred Schmidt,
          hielt stellvertretend f&uuml;r die Blinden und
          Sehbehinderten Berlins das Pl&auml;doyer (Text folgt am
          Ende dieser Pressemitteilung). Danach &uuml;bergab er an
          die Ausschussvorsitzende Dr. Stefanie Schulze (PDS) einen
          eindrucksvollen Beweis f&uuml;r das Engagement der
          Betroffenen: Die Blinden und Sehbehinderten haben in den
          vergangenen Monaten 50.842 Unterschriften gegen die
          geplanten K&uuml;rzungen des Blindengeldes gesammelt!</P>

          <P>Die anschlie&szlig;ende Fragerunde offenbarte
          teilweise erschreckende Informationsdefizite auf Seiten
          der Ausschussmitglieder. Ein Beschluss zum
          Landespflegegeldgesetz wurde noch nicht gefasst.</P>

          <P>St&auml;ndig aktualisierte Informationen zur
          "Protestaktion Blindengeld" der Berliner Blinden und
          Sehbehinderten unter www.absv.de</P>

          <P>Pressekontakt:<BR>
          ABSV Berlin<BR>
          Volker Lenk, &Ouml;ffentlichkeitsarbeit<BR>
          Auerbacher Str. 7, 14193 Berlin<BR>
          Tel.: 030 - 895 88 123 (mobil: 0177 - 7 60 60 93)<BR>
          Fax: 030 - 895 88 99<BR>
          volker.lenk@absv.de</P>

          <H2>Text des Pl&auml;doyers</H2>

          <P>Stellungnahme zur Drucksache 15/ 2186
          Landespflegegeldgesetz von Dr. Manfred Schmidt:</P>

          <P>Meine Damen und Herren Abgeordneten,</P>

          <P>Sie haben heute &uuml;ber ein Gesetz zu entscheiden,
          das tief in die Lebenssituation von etwa 3.100 blinden
          und von rund 1.400 hochgradig sehbehinderten Menschen
          eingreift. Nach dem vorliegenden Entwurf sollen bei den
          blinden Menschen 20 % und bei fast 2/3 der hochgradig
          Sehbehinderten &uuml;ber 50 % der bisherigen Leistungen
          gek&uuml;rzt werden. Sie sollten sich im Klaren sein, was
          dieser Einschnitt f&uuml;r den einzelnen Menschen
          bedeutet. Ich komme darauf sp&auml;ter zur&uuml;ck.</P>

          <P>Die K&uuml;rzungen werden damit begr&uuml;ndet, dass
          sich Berlin in einer Haushaltsnotlage befindet und
          Leistungsvorspr&uuml;nge abbauen m&uuml;sse. Das
          j&uuml;ngste Urteil des Landesverfassungsgerichtes
          &uuml;ber die Verfassungswidrigkeit des Haushaltes 2002/
          2003 dient als weitere Begr&uuml;ndung. Dem m&ouml;chte
          ich entgegnen: Die Summe, die Berlin zur Zeit als
          Blindengeld zahlt - n&auml;mlich 585,- Euro - wird in
          gleicher H&ouml;he in f&uuml;nf weiteren
          Bundesl&auml;ndern gezahlt, darunter sind Hamburg, mit
          dem wir uns sonst gern vergleichen, und das kleine
          Saarland, dessen Haushaltsnotlage durch das
          Bundesverfassungsgericht anerkannt worden ist und das
          seit 1994 Sonderbundeserg&auml;nzungszuweisungen zur
          Sanierung seines Haushaltes erh&auml;lt. Keiner ist dort
          auf den Gedanken gekommen, das Blindengeld wegen der
          Haushaltsnotlage zu k&uuml;rzen. Was das kleine Saarland
          kann, sollte auch die Hauptstadt k&ouml;nnen. Es kommt
          nur auf eine sorgf&auml;ltige Begr&uuml;ndung an. Ich
          kann also hier keinen Leistungsvorsprung erkennen und
          auch keinen K&uuml;rzungsgrund.</P>

          <P>Berlin hat trotz Haushaltsnotlage und trotz
          Verfassungswidrigkeit des gegenw&auml;rtigen Haushaltes
          einen Gestaltungsspielraum. Politik sollte nicht auf
          Sparen beschr&auml;nkt werden. Bei einer K&uuml;rzung des
          Blindengeldes um 20 % l&auml;ge Berlin noch hinter
          Mecklenburg-Vorpommern, das ebenfalls SPD/ PDS-regiert
          ist, und hinter Th&uuml;ringen.</P>

          <P>Ferner behauptet die Fachverwaltung, die K&uuml;rzung
          sei sozial vertr&auml;glich. Wer ein geringes Einkommen
          und Verm&ouml;gen habe, k&ouml;nne ja erg&auml;nzende
          Blindenhilfe nach &sect;67 BSHG beantragen. Das ist in
          zweierlei Hinsicht falsch. Erstens haben hochgradig
          Sehbehinderte &uuml;berhaupt keinen Anspruch nach dem
          BSHG. Zweitens erfolgen die meisten Erblindungen im
          h&ouml;heren Lebensalter. Wer ein Leben lang gearbeitet
          und sich, wie von allen Seiten gefordert, auch nur ein
          wenig Geld zur Altersvorsorge zur&uuml;ckgelegt hat,
          kommt schon nicht mehr in Frage. Zwar sind die Renten der
          meisten Blinden so klein, dass die Einkommensgrenze nicht
          erreicht wird, aber wer f&uuml;r sein Alter vorgesorgt
          und gespart hat, muss dieses Geld dann f&uuml;r den
          blindheitsbedingten Mehraufwand einsetzen. Und nach dem
          SGB XII, das n&auml;chstes Jahr kommen soll, erhalten
          ohnehin nur noch Sozialhilfeempf&auml;nger die
          Blindenhilfe. Alle anderen mit kleinem Einkommen und
          Gespartem &uuml;ber 2.600,- Euro und sogar die
          Bezugsberechtigten nach dem Grundsicherungsgesetz gehen
          leer aus. Au&szlig;erdem reicht selbst die geringe Summe
          von 2.600,- Euro nicht einmal aus, um ein teures
          Blindenhilfsmittel kaufen zu k&ouml;nnen.</P>

          <P>In diesem Zusammenhang empfinde ich es als
          Verh&ouml;hnung, wenn drei Politikerinnen der PDS,
          darunter die behindertenpolitische Sprecherin der
          Fraktion, in einem sogenannten Argument des Tages, von
          blinden Million&auml;ren sprechen. Die gibt es in Berlin
          nicht. Obendrein werden Tatsachen auf den Kopf gestellt.
          Das ist Stimmungsmache, die ich von seri&ouml;sen
          Politikerinnen nicht erwartet h&auml;tte.</P>

          <P>Der Gesetzentwurf beinhaltet eine drastische
          K&uuml;rzung der Leistungen f&uuml;r fast 2/3 der
          hochgradig Sehbehinderten, ohne dass daf&uuml;r eine
          Begr&uuml;ndung gegeben wird. In der
          Gegen&uuml;berstellung der Leistungen in den einzelnen
          Bundesl&auml;ndern fehlt diese Position sogar, so dass es
          aussieht, als w&uuml;rden die hochgradig Sehbehinderten
          lediglich 2,Euro einb&uuml;&szlig;en. In Wirklichkeit
          sind es 122,- Euro, also &uuml;ber 50 % der jetzigen
          Bez&uuml;ge. Warum hier der Bestandsschutz nicht weiter
          gelten soll, w&auml;hrend er f&uuml;r andere Gruppen
          erhalten bleibt, ist nicht zu verstehen!</P>

          <P>Indiskutabel ist auch die k&uuml;nftige Gestaltung der
          Leistungen f&uuml;r taubblinde Menschen. W&auml;hrend
          &sect;8, Absatz 2 vorsieht, dass diejenigen, die bereits
          am 31.03.1995 entsprechende Leistungen bezogen haben,
          diese auch weiterhin erhalten, sind f&uuml;r alle anderen
          Taubblinden nur noch das Blindengeld und das
          Geh&ouml;rlosengeld vorgesehen. Das sind nach dem
          Gesetzentwurf 585,- Euro. Nun kann man bei einem
          Taubblinden nicht einfach Blindheit und Taubheit
          addieren, sondern der Ausfall dieser beiden wichtigsten
          Sinne potenziert die Behinderung. Ein taubblinder Mensch
          braucht faktisch immer Assistenz. Daf&uuml;r sind die zur
          Zeit bezahlten 1.189,- Euro nicht zu viel. 585,- Euro
          bedeuten erhebliche Einschr&auml;nkungen. Obendrein
          handelt es sich bei den Taubblinden nur um eine kleine
          Gruppe von maximal 40 Personen. F&uuml;r sie sollte auch
          k&uuml;nftig die alte Regelung gelten.</P>

          <P>Die K&uuml;rzung des Blindengeldes bedeutet eine
          doppelte Belastung f&uuml;r die Betroffenen, denn sie
          m&uuml;ssen alle Abgabenerh&ouml;hungen und alle
          Leistungsk&uuml;rzungen, die die Bundesregierung und das
          Land Berlin f&uuml;r die B&uuml;rger bereit halten, mit
          tragen. Sie ist auch angesichts gro&szlig;z&uuml;giger
          Ausgaben des Landes Berlin nicht einzusehen. So hat der
          Rechnungshof nachgewiesen, dass das Land und landeseigene
          Betriebe im Jahre 2002 231 Millionen Euro verschwendet
          haben. Die Senatsverwaltung f&uuml;r Gesundheit, Soziales
          und Verbraucherschutz hat im Bereich der Betreuung
          psychisch Kranker &uuml;ber Jahre hinweg auf Gelder
          verzichtet, die ihr zustanden, und dadurch
          Millionensch&auml;den verursacht. Ca. 6 Millionen Schaden
          sind dadurch entstanden, dass dieselbe Verwaltung
          &uuml;berh&ouml;hte Krankenversicherungsbeitr&auml;ge
          f&uuml;r freiwillig versicherte Sozialhilfeempf&auml;nger
          gezahlt hat und wohl auch noch zahlt. Wir sehen im
          &uuml;brigen nicht ein, weshalb die 8,3 Millionen Euro,
          die durch das Gesetz eingespart werden sollen, unbedingt
          nur aus dem Sozialressort kommen m&uuml;ssen. Die BVG
          will f&uuml;r 50 Millionen Euro Kartenleseger&auml;te
          anschaffen, deren Erfolg h&ouml;chst fraglich ist. Die
          Bez&uuml;ge der Aufsichtsratmitglieder der
          Bankgesellschaft Berlin wurden k&uuml;rzlich erst
          erh&ouml;ht. Hier liegen echte Einsparm&ouml;glichkeiten.
          Das gilt auch f&uuml;r das Tempodrom und den Neubau der
          Akademie der K&uuml;nste, wo Millionen vergeudet
          wurden.</P>

          <P>Aber wir haben auch einen eigenen Sparvorschlag zu
          unterbreiten: Statt das Blindengeld zu k&uuml;rzen,
          sollte der Verwaltungsaufwand minimiert werden. Durch
          eine zentrale Blindengeldstelle f&uuml;r Berlin
          k&ouml;nnten Einsparungen erzielt werden. Bisher erfolgt
          die Bearbeitung in 46 Dienststellen. Eine zentrale
          Blindengeldstelle w&uuml;rde au&szlig;erdem eine
          einheitliche Rechtsanwendung erm&ouml;glichen, was bisher
          leider oft nicht der Fall ist und immer wieder zu
          &Auml;rger und Ungerechtigkeiten f&uuml;hrt.</P>

          <P>Viele Mitb&uuml;rger sind emp&ouml;rt &uuml;ber die
          beabsichtigte K&uuml;rzung des Blindengeldes. Mehr als
          50.000 Menschen haben das mit ihrer Unterschrift
          bekundet. Diese gro&szlig;e Zahl ist Ausdruck der
          Unzufriedenheit der B&uuml;rger und sollte Ihnen zu
          denken geben. Die Stimmung hat die Berliner Abendschau
          mit den Worten auf den Punkt gebracht: "Der Senat macht
          jetzt auch vor den Schw&auml;chsten nicht mehr Halt."</P>

          <P>Ich darf Ihnen, verehrte Frau Vorsitzende, im
          Anschluss die Unterschriften &uuml;berreichen.</P>

          <P>Das Blindengeld dient zum Ausgleich der durch die
          Behinderung bedingten Mehrausgaben. Es handelt sich also
          nicht um Almosen oder um Einkommen, sondern um die
          Kompensation von Mehrausgaben, die eben nur ein Blinder
          oder hochgradig Sehbehinderter hat. Dazu geh&ouml;ren
          Assistenzleistungen der unterschiedlichsten Art, wie
          Hilfe beim Einkaufen, Vorlesen, Begleiten zu
          Arztbesuchen, Beh&ouml;rdeng&auml;ngen, zu kulturellen
          Veranstaltungen oder auch zu Spazierg&auml;ngen im Urlaub
          und vieles mehr; der Erwerb von Hilfsmitteln, die in der
          Regel teure Sonderanfertigungen sind, von B&uuml;chern in
          Blindenschrift, die das Vielfache eines Buches in
          Normalschrift kosten, usw.</P>

          <P>Ich will die Aufz&auml;hlung jetzt nicht fortsetzen,
          wir haben Ihnen das alles schon geschrieben. Aber all
          dieses ist notwendig, um ein einigerma&szlig;en
          gleichberechtigtes Leben zu f&uuml;hren, wie es die
          Verfassung von Berlin und das
          Landesgleichberechtigungsgesetz fordern. Eine
          K&uuml;rzung der Leistungen bedeutet weniger
          Gleichberechtigung oder anders ausgedr&uuml;ckt
          Benachteiligung.</P>

          <P>Und ich m&ouml;chte Ihnen das an einem konkreten
          Beispiel deutlich machen: Die Masse der Blinden,
          n&auml;mlich 3/4, sind 65 Jahre oder &auml;lter, darunter
          viele Alleinstehende. Bei einer K&uuml;rzung des
          Blindengeldes m&uuml;ssen sie &uuml;berlegen, wo sie
          Abstriche machen. Bei den lebensnotwendigen Dingen, wie
          Hilfe zum Einkaufen usw., geht es nicht. Also bleibt das
          auf der Strecke, wo wir seit Jahren erfolgreich um
          Integration ringen und die Menschen zu Veranstaltungen
          und anderen Anl&auml;ssen aus der Wohnung holen. Um an
          solchen Dingen teilnehmen zu k&ouml;nnen, wird das Geld
          f&uuml;r eine Begleitperson nicht mehr ausreichen. Das
          hei&szlig;t, die Menschen vereinsamen. Auch das bitte ich
          Sie zu bedenken.</P>

          <P>Lassen Sie mich zum Schluss drei Dinge nennen, die
          eine K&uuml;rzung des Blindengeldes nach sich zieht:</P>

          <P>Es wird eine Flut von Antr&auml;gen auf
          erg&auml;nzende Blindenhilfe nach &sect;67 BSHG geben,
          die einen hohen Verwaltungsaufwand verursacht. Einem
          Papier der bremischen Sozialverwaltung zufolge beziehen
          dort 40 Prozent der Blinden Leistungen nach dem BSHG, was
          darauf schlie&szlig;en l&auml;sst, dass mehr als 60
          Prozent einen Antrag stellen d&uuml;rften; viele
          &auml;ltere alleinstehende Blinde, die sich die Hilfe im
          wahrsten Sinne des Wortes kaufen m&uuml;ssen, werden mit
          dem verk&uuml;rzten Blindengeld nicht mehr auskommen und
          fr&uuml;her als sonst in ein Heim gehen. Die dadurch
          entstehenden Mehrkosten sind enorm; und das ist das
          gr&ouml;&szlig;te Problem, es wird zur Vereinsamung
          vieler &auml;lterer blinder Menschen kommen.</P>

          <P>Ich bitte Sie deshalb eindringlich, meine Damen und
          Herren Abgeordneten, dem vorliegenden Gesetzentwurf nicht
          zuzustimmen.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

