<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Diverse Amiga-News</H1>
<H2>1. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P><B>&raquo;Freespace: Endlich lieferbar</B></P>
<P>
07. Jan. 2002: Letzte Woche haben wir endlich die offizielle Freigabe f&uuml;r
Freespace bekommen. Die Vorbestellungen sind daher bereits ausgeliefert
worden.
</P>
<P>
Freespace wurde von Hyperion Entertainment umgesetzt und ist mit Sicherheit
die beste Weltraumschlachten-Simulation, die jemals f&uuml;r den Amiga
erschienen ist. Es bietet einen einmaligen Mix aus phantastischen
Grafiken, komplexer Handlung und herausragender Spielbarkeit.
</P>
<P>
Freespace l&auml;uft auf jedem Amiga mit PPC-Prozessor und 64 MB Speicher oder
auf Amigas mit 68060 und 3D-Beschleuniger (z.B. Voodoo 3, Permedia 2).
Weitere Informationen findet man auf freespace.haage-partner.de.
</P>
<P><B>AmigaOS XL: Aktualisierte Software-Liste und neuer Support-Beitrag</B></P>
<P>
08. Jan. 2002: Der neue Beitrag &quot;Verwendung von PC-Disketten unter
Amithlon&quot; beschreibt den Datenaustausch zwischen Amiga und Amithlon &uuml;ber
PC-Disketten. FAQ
</P>
<P>
Dank der Informationen einiger Kunden (Heinz Gyrole, Udo Ga&szlig;ner, Paul de
Vries, G&uuml;nter Wirth u.a.) konnte die Kompatibilit&auml;tsliste wieder um einige
Eintr&auml;ge erweitert werden. Enthalten sind jetzt auch: ADM, ArtStudio,
Digibooster Pro, Elastic Dreams, Fantastic Dreams, Octamed Soundstudio,
PhotoFolio, Photogenices, Picture Manager, X-Trace, Xi-Paint und ZShell.
Liste
</P>
<P>
Wenn Sie ein Programm getestet haben, das noch nicht in unserer Liste
steht, dann w&uuml;rden wir uns &uuml;ber eine Nachricht sehr freuen. Wir haben dazu
ein Formular eingerichtet. Vielen Dank f&uuml;r Ihre Hilfe.
</P>
<P><B>OS 3.9: Euro-Update</B></P>
<P>
24. Jan. 2002: Endlich k&ouml;nnen wir das neue Euro-Update f&uuml;r AmigaOS 3.9
freigeben. Es hatte etwas l&auml;nger gedauert, da doch einige &Auml;nderungen
notwendig wurden, die erst nach und nach w&auml;hrend der Testphase erkannt
wurden. Vielen Dank an die vielen Mitwirkenden.
</P>
<P>
Dieses Update enth&auml;lt unter anderem Tastaturbelegungen und
Amiga-Bitmap-Zeichens&auml;tze, die es erm&ouml;glichen das Euro-Symbol zu
verwenden. Es ist auch eine deutsche Euro-Tastaturbelegung f&uuml;r AmigaOS XL
enthalten.
</P>
<P><B>PageStream 4.1</B></P>
<P>
28. Jan. 2001: Ab heute beginnen wir mit der Auslieferung der Version 4.1
f&uuml;r Windows. Es hatte diesmal etwas l&auml;nger gedauert, bis wir die Version
freigegeben konnten, das wir der Meinung sind, dass es keinen Sinn macht,
eine offensichtlich sehr anf&auml;llige Version an Kunden weiterzugeben. Der
Eindruck der aktuellen Version 4.1.2 ist sehr gut, wir konnten bei unseren
ersten Tests keine nennenswerten Fehler feststellen.
</P>
<P>
Seit geraumer Zeit bietet Grasshopper auch die Macintosh-Version 4.1 an.
Doch ist diese noch im Teststadium und wird daher von uns noch nicht
ausgeliefert werden. Wir rechnen aber in K&uuml;rze mit der Endversion. Ebenso
erwarten wir in K&uuml;rze die Amiga-Version 4.1. www.pagestream.de&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
