<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<P>
<H3>&raquo;Amiga Arena - Interview Aktion<BR>
(05.01.2002)</H3><BR>
</P>
<P>
Mit der Version 3.19 wurde die Geb&uuml;hrenz&auml;hler Software &quot;TTime-Deluxe&quot;
Freeware.
</P>
<P>
Die Amiga Arena sprach mit J&uuml;rgen Reinert &uuml;ber die neue Version von
&quot;TTime-Deluxe&quot;, sowie &uuml;ber die Zukunft der Programe &quot;Dragon Tools&quot; und
welche Eigenschaften er am Amiga sch&auml;tzt!&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena - &quot;AmiFIG 3.1&quot; Vollversion
(08.01.2002)</H3>
</P>
<P>
Mit der Gehnemigung von &quot;Andreas Schmidt&quot; liegt &quot;AmiFIG 3.1&quot; registriert
auf die &quot;Amiga Arena&quot; zum Download bereit.
</P>
<P>
AmiFIG ist ein universelles Vektorzeichen-Programm, das auf dem
bekannten Unix-Programm Xfig von Supoj Sutanthavibul und anderen basiert.
Diese Version ist nun nahezu kompatibel zu Xfig 3.1.
</P>
<P>
Die Oberfl&auml;che wurde teilweise mit GadToolsBox 2.0b von JaBa Development
erstellt.
</P>
<P>
AmiFIG verf&uuml;gt &uuml;ber eine breite Palette von Zeichen- und Editierfunktionen
und ist damit eines der leistungsf&auml;higsten Vektorzeichenprogramme f&uuml;r den
Amiga.&laquo;
</P>
<P>
<H3>&raquo;Amiga Arena News<BR>
(10.01.2002)</H3><BR>
</P>
<P><B>Amiga Arena - Interview Aktion</B></P>
<P>
Mit &quot;Kray&quot; befindet sich seit Anfang des Jahres ein neuer Freeware &quot;Szene&quot;
Raytracer in Entwicklung.
</P>
<P>
Die Amiga Arena sprach mit Grzegorz Tanski wie es zur Entwicklung kam und
was wir noch in Zukunft erwarten d&uuml;rfen.
</P>
<P>
Auf der Homepage von Grzegorz Tanski befinden sich noch weitere Programme
sowie eine interessante Demoversion eines 3D Fussballspiels! Wie die Amiga
Arena erfahren konnte besteht seitens Grzegorz Tanski reges interresse bei
geeigneter Hardware  hochwertige Software zu entwickeln!&laquo;
</P>
<P>
&raquo;Amiga Arena News<BR>
(13.01.2002)<BR>
</P>
<P><B>Amiga Arena - Interview Aktion</B></P>
<P>
Im November zur &quot;Amiga 2001&quot; war es endlich soweit, der erfolgreichste
Routen und Reiseplaner &quot;AmiATLAS&quot; lag erstmals seit 1998 in einer neuen
Version vor.
</P>
<P>
Damals von Andreas Regul entwickelt, &uuml;bernahm durch eine Aktion der &quot;Amiga
Arena&quot;, Gerd Frank die weiterentwicklung und realisierte in relativ kurzer
Zeit ein hochwertiges St&uuml;ck Software - AmiATLAS 6.
</P>
<P>
Die Amiga Arena sprach mit Gerd Frank &uuml;ber die Entwicklung und Zukunft von
AmiATlAS und warum einige der geplanten Features es nicht mehr zum Release
geschaft hatten!
In eigener Sache
Ich kann nur an Euch apellieren,wer weiterhin gute Software f&uuml;r den Amiga
erhalten m&ouml;chte sollte dies nicht mit Raubkopien die es leider auch von
AmiATLAS gibt zerst&ouml;ren!
Vielen scheint selbst heute nicht bewust zu sein das jede Registrierte und
Verkaufte Einheit z&auml;hlt!
Gerade jetzt wo Wir eventuell vor einer wirklich neuen Chance stehen, mit
neuer Hardware und OS, Zeitgem&auml;sse Software zu erhalten    w&auml;hre es eine
&quot;Schande&quot; wenn Wir uns durch Raupkopien selbst zerst&ouml;ren und somit die
Zukunft der Plattform Amiga.
</P>
<P>
Ich nehme dieses Interview zum Anlass, um nochmals darauf Aufmerksam zu
machen!
</P>
<P><B>Euer Olaf - Amiga Arena&laquo;</B></P>
<P><B>&raquo;Amiga Arena - Interview Aktion</B></P>
<P>
Mit &quot;Charon&quot; existiert wohl der beste Downloadmanager f&uuml;r den Amiga.
Die Amiga Arena befragte Andrija Antonijevic der auch f&uuml;r die Programme
&quot;AmiSSL&quot; und &quot;HTTPResume&quot;    verantwortlich ist &uuml;ber die Zukunft von
&quot;Charon&quot;
und wie er zum Amiga kam!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Sonderpreis Aktion!</B></P>
<P>
Auch 2002 versucht die Amiga Arena Sonderpreise f&uuml;r Shareware Software zu
erm&ouml;glichen, dies ist Aufgrund der schlechten Shareware Situation
allerdings kaum noch m&ouml;glich.
</P>
<P>
Umso mehr freue ich mich zum Anfang eine ganz besondere Aktion vorstellen
zu d&uuml;rfen!
In Zusammenarbeit mit Helmut Hoffmann erm&ouml;glicht die Amiga Arena eine
Sonderpreis Aktion f&uuml;r die Bildverwaltung &quot;PhotoAlbum&quot;,
inklusive dem Bildanzeiger &quot;Cybershow&quot;.
</P>
<P>
Bevor das Urlaubs-Restgeld verf&auml;llt, lieber in Shareware investieren...
Gro&szlig;e <A HREF="http://home.arcor.de/helmuthoffmann/photoalbum/index.html" TARGET="_top">http://home.arcor.de/helmuthoffmann/photoalbum/index.html</A> -
PhotoAlbum und  CyberShow Euro-Vorg&auml;ngerw&auml;hrungs-Shareware-Aktion.
Wer noch (g&uuml;ltige) Geldscheine in den 12 Vorl&auml;ufer-W&auml;hrungen der 12
Euro-Teilnehmerl&auml;nder hat, kann bis zum 28.2.2002 PhotoAlbum/Cybershow bei
Barzahlung durch    beliebige Kombinationen der W&auml;hrungen zum Online-Preis
(Gegenwert mindestens 20  EURO) bestellen (also z.B. 280 Schilling von
Ihrem Wien-Wochenende oder 4000 Peseten vom letzten Mallorca-Trip). Falls
noch etwas fehlt, kann der Restbetrag nat&uuml;rlich auch in Euro-Scheinen
beigelegt werden. M&uuml;nzen in fremden W&auml;hrungen k&ouml;nnen allerdings nicht
akzeptiert werden.&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview Aktion</B></P>
<P>
Seit der letzten Version 1999 wurde im Dezember 2001 fast auf den Tag genau
ein neues Update zu &quot;PhotoAlbum/CyberShow&quot; ver&ouml;ffentlicht!
F&uuml;r mich pers&ouml;hnlich war dies eine kleine Sensation, denn nachdem der
Server &quot;AmigaWorld&quot; Offline war,wurde es still um PhotoAlbum/CyberShow.
Mit &quot;PhotoAlbum&quot; existert heute noch einer der ganz wenigen Shareware
Programmen, die sich nicht nur mit vergleichbaren    Kommerzielen Produkten
messen, sondern diesen sogar &uuml;berlegen ist.
</P>
<P>
Die Amiga Arena sprach mit Helmut Hoffmann &uuml;ber den Werdegang von
PhotoAlbum/CyberShow sowie der aktuellen Situation!
Ich pers&ouml;hnlich kann &quot;PhotoAlbum&quot; nur empfehlen und hoffe das Helmut
Hoffmann weiterhin neue Features einf&uuml;gt!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview Aktion</B></P>
<P>
Mit dem Entwicklungspaket &quot;Inga&quot; von Timo Kloss besteht die m&ouml;glichkeit
ohne Programmierkenntnise eigene Grafik Adventures zu erstellen.
</P>
<P>
Die Amiga Arena sprach mit Timo Kloss &uuml;ber die Zukunft von &quot;Inga&quot;,warum es
in der angestrebten Version 1.0,nur bei 8-Bit Grafik unterst&uuml;zung vorerst
bleiben wird und was wir sonst noch erwarten d&uuml;rfen.
</P>
<P>
Mir scheint es das man mit &quot;Inga&quot; wirklich ansprechende und hochwertige
Adventure Spiele erstellen kann und ich hoffe, es finden sich genug
Kreative User die uns auf &quot;Inga&quot; basierende, neue Abenteuer f&uuml;r den Amiga
bescheren werden!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Sonderpreis Aktion!</B></P>
<P>
In Zusammenarbeit mit &quot;Beer Productions&quot; erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r das wohl beste Amiga Erdkundeprogramm &quot;GeoWorld&quot;.
&Uuml;ber ein Jahr hat es gedauert bis das k&uuml;rzlich erschienende Update Nr.13
erh&auml;ltlich war.
</P>
<P>
Umso mehr freut es mich das diese Software auch in Zukunft weiterentwickelt
wird!
F&uuml;r weitere Informationen &uuml;ber &quot;GeoWorld&quot; besuchen Sie bitte die Homepage
unter [<A HREF="http://GeoWorld.AmigaSoft.de" TARGET="_top">http://GeoWorld.AmigaSoft.de</A> ] GeoWorld.
</P>
<P>
In k&uuml;rze erscheint ein &quot;Entwicklungs Tool Kit&quot; damit u.a. der Datenbestand
noch aktueller und Umfangreicher werden kann,auch f&uuml;r den Grafikbereich
suchen die Entwickler weiterhin Private &quot;Landschaftsaufnahmen&quot; sowie
&quot;Kartenzeichner&quot;!
Es w&auml;hre sch&ouml;n wenn sich in Zukunft,weiterhin User finden die dazu
beitragen das es auch f&uuml;r den Amiga,umfangreiche &quot;Wissens Software&quot; gibt.
Die Sonderpreis Aktion ist bis zum 28.2.2002 Online!&laquo;
</P>
<P><B>&raquo;Amiga Arena - Interview Aktion</B></P>
<P>
Mit Spitfire&sup2; existiert eine sehr gute Shareware Software f&uuml;r alle Amiga /
PalmOS User.
</P>
<P>
Spitfire&sup2; erm&ouml;glicht das PalmOS mit Amiga synchronisiert!
Die Amiga Arena sprach mit Ralph Torchia dem Entwickler von Spitfire&sup2; &uuml;ber
die Vergangenheit wie Zukunft&laquo;!
</P>
<P><B>&raquo;Amiga Arena - Interview Aktion</B></P>
<P>
Richard Smedley,Entwickler eines der wohl besten Heim-
Kontof&uuml;hrungsprogramme f&uuml;r den Amiga - &quot;UltraAccounts&quot;,ver&ouml;ffentlichte vor
kurzem ein Update, um die Dateien von &quot;UltraAccounts&quot; EURO kompatibel zu
machen.
</P>
<P>
&quot;UltraAccounts&quot; ist Shareware und wird mittlerweile seit neun Jahren
entwickelt!
Wie wichtig Resonanz f&uuml;r die Entwickler ist,macht dieses Interview einmal
mehr,wieder deutlich!
Ob &quot;UltraAccounts&quot; in Zukunft weiter entwickelt wird liegt ganz daran ob
Interesse seitens der Anwender besteht!
Es w&auml;hre mehr als Schade wenn ein weiterer Entwickler aufgrund mangelnder
Resonanz die entwicklung einstellt!
Hinweis in eigener Sache!
Liebe Amiga Freunde auch die &quot;Amiga Arena&quot; wird wohl in naher Zukunft Ihre
aktivit&auml;ten einstellen!
Erste Massnahmen sind allerdings nicht vor Ostern 2002 zu erwarten!
Olaf K. - Amiga Arena&laquo;
</P>
<P>
&raquo;Die Amiga Arena fragte bei Digital Dreams Entertainment an
ob Sie noch aktiv f&uuml;r den Amiga sind!
Digital Dreams Entertainment ver&ouml;ffentlichten 1999 mit &quot;Wasted Dreams&quot;
eines der besten Action Adventure Spiele der letzten Jahre!
</P>
<P><B>Hier die Orginal Antwort:</B></P>
<P>
Unfortunately we had to cancel all our Amiga only projects.
</P>
<P>
We are now working on several new projects, from support parts for 3D
animators (in 3dsMax, Lightwave or Maya) to children games for PC and
Console.
</P>
Kind Regards,<BR>
Thomas<BR>
Digital Dreams Entertainment&laquo;<BR>
<P><B>&raquo;Goodbye Amiga Arena!</B></P>
<P><B>Liebe Amiga Freunde,</B></P>
<P>
die Amiga Arena stellt zum 31.01.2002 Ihre Online Aktivit&auml;ten ein.
Private und Pers&ouml;hnliche Gr&uuml;nde haben mich letzendlich zu diesem Schritt
bewegt.
</P>
<P>
Ich m&ouml;chte mich an dieser Stelle ganz besonders bei allen Entwicklern und
Online Magazinen,Print Magazinen sowie den Usern f&uuml;r Ihre Mithilfe,der
Unterst&uuml;zung und der langj&auml;hrigen Zusammenarbeit bedanken!
Ohne Euch w&auml;hre die Amiga Arena nie m&ouml;glich gewesen!
Ich k&auml;me dem nicht Gerecht wenn ich hier alle Namentlich erw&auml;hnen w&uuml;rde!
Zum Abschied liegen die Spiele &quot;Cygnus 8&quot; und &quot;Mobile Warfare&quot; von Applaud
Software zum Download bereit!
Die Amiga Arena wird auch weiterhin nach Ablauf der letzten Sonderpreis
Aktionen Online bleiben.
</P>
<P>
Bis dahin Euer Olaf K&ouml;bnik - Amiga Arena R.I.P. 1998 - 2002&laquo;
</P>
<P><B>&raquo;Amiga Arena - Nachtrag</B></P>
<P>
Ich m&ouml;chte mich ganz herzlich bei allen bedanken die mir mit Ihren Mails
und Kommentaren soviel positives Feedback geschenkt haben!
Die Amiga Arena bleibt weiterhin Online und der Support f&uuml;r das Spiel
&quot;PuzzelBOBS&quot; ist auch gew&auml;hrleistet.
</P>
<P>
In unregelm&auml;ssigen abst&auml;nden werden kleinere Updates der Amiga Arena
m&ouml;glich sein und noch eingehende Interviews etc. werden selbstverst&auml;ndlich
ver&ouml;ffentlicht!
Eine &quot;Auszeit&quot; auf unbestimmte Zeit wird es aber wie angek&uuml;ndigt geben.
Vielen Dank f&uuml;r Euer Verst&auml;ndnis!
Euer Olaf K.
</P>
<P><B>Amiga Arena - Interview Aktion</B></P>
<P>
Nicolas Ramz haben wir es mit seinem &quot;ScummVM&quot; Amiga68k port zu verdanken,
das es m&ouml;glich ist alte Spiele von LucasArts wie z.b. &quot;Day of the Tentacle&quot;
auf dem Amiga zu spielen.
</P>
<P>
Die Amiga Arena sprach mit Nicolas Ramz &uuml;ber seine Arbeit zu &quot;ScummVM&quot; und
wie er die Zukunft von Amiga sieht.
</P>
<P>
Besonderen Dank an Christian Busse f&uuml;r seine unerm&uuml;dlichen &Uuml;bersetzungen
f&uuml;r die Amiga Arena!
</P>
<P><B>Shareware News</B></P>
<P>
Nach langer Zeit konnte die Amiga Arena den Entwickler der Shareware
Software &quot;ScanTek&quot; ausfindig machen und hat folgende Informationen:
</P>
<P>
Die neue Version 4.6 steht ist absofort auf der Homepage unter
<A HREF="http://www.zoehner.de/scantek.html" TARGET="_top">http://www.zoehner.de/scantek.html</A> zum Download bereit.
</P>
<P><B>ScanTek unterst&uuml;zt SCSI Microtek Scanner Modelle!&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
