<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Neuigkeiten von Airsoft Softwair</H2>
<P><B>Airsoft Softwair (<A HREF="http://www.airsoftsoftwair.de" TARGET="_top">http://www.airsoftsoftwair.de</A>) informiert:</B></P>
<P><B>&raquo;Verschiedene News bei Airsoft Softwair</B></P>
<P>
Die Euro-Umstellung ist nun auch auf der Airsoft Softwair Homepage
(<A HREF="http://www.airsoftsoftwair.de/" TARGET="_top">http://www.airsoftsoftwair.de/</A>) erfolgt. Bald wird es &uuml;brigens neue
Versionen von Akiko (u.a. mit NV-Ram und echter Joypad-Unterst&uuml;tzung) sowie
von NewInstaller und Rainboot3 geben.
</P>
<P>
Seid also schon mal gespannt. Au&szlig;erdem gab es einige kleinere &Auml;nderungen
auf der Homepage.&laquo;
</P>
<P>
&raquo;Der CD32-Emulator f&uuml;r Windows Akiko von Airsoft Softwair
(<A HREF="http://www.airsoftsoftwair.de/" TARGET="_top">http://www.airsoftsoftwair.de/</A>) kann jetzt auch das MPEG-Modul vom CD32
emulieren und zwar in atemberaubender Geschwindigkeit und super Sound- und
Bildqualit&auml;t, da alle Rechenoperationen von der x86 CPU erledigt werden.
Das zu implementieren war ein echtes St&uuml;ck Arbeit, aber das Ergebnis ist
einfach &uuml;berw&auml;ltigend. Endlich kann man die MPEG-Intros sehen, die dem
Benutzer ohne MPEG-Modul einfach vorenthalten bleiben (z.B. bei Cannon
Fodder). Und nat&uuml;rlich den Amiga CD32 Werbespot von Commodore mit dem
verr&uuml;ckten Professor und seinem Assistenten. Ich habe mal schnell ein paar
Screenshots gemacht und diese auf die Akiko-Produktseite
(<A HREF="http://phobos.spaceports.com/~sfa/de/prod_akiko.html" TARGET="_top">http://phobos.spaceports.com/~sfa/de/prod_akiko.html</A>)
gestellt. Desweiteren hoffe ich, dass ich die MPEG-Modul-Emulation bereits
in der n&auml;chsten Akiko-Version endg&uuml;ltig fertigstellen kann (allerdings nur
in der Vollversion!). Eine weitere erfreuliche Nachricht ist, dass jetzt
auch Microcosm mit Akiko l&auml;uft (man hat nicht gelebt, wenn man das nicht
gesehen hat!). Die n&auml;chste Version von Akiko wird demn&auml;chst erscheinen
und auf jeden Fall NV-Ram Emulation und echte Joypad-Emulation mit sich
bringen. Wenn alles klappt, gibt's aber auch schon die MPEG-Modul-
Emulation. Ihr solltet also &ouml;fters mal hier vorbeischauen, denn der Winter
ist alles andere als kalt! Ich m&ouml;chte mich &uuml;brigens noch bei den vielen
registrierten Benutzern f&uuml;r die tolle Unterst&uuml;tzung bedanken! Akiko wird
durch euch immer besser!&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
