<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Forum2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Forum
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Anmerkungen zum Leserbrief von Andreas Guldner (von Carsten Schr&ouml;der)</H2>
<P>
Mitte Januar hat mich eine Reaktion auf mein Schlusswort der letzten AMIGA-
aktuell-Ausgabe (Titel: &quot;Neues Jahr - neues Gl&uuml;ck?&quot;) erreicht, die ich mit
ziemlich gemischten Gef&uuml;hlen aufnahm. Einerseits bewundere ich die M&uuml;he,
die sich der Leser Andreas Guldner gemacht hat, indem er auf drei in
kleiner Schrift bedruckten DIN-A4-Seiten seine Kritik an dem erw&auml;hnten
Artikel &auml;u&szlig;erte. Kurz gesagt stimmt Andreas in nahezu allen darin
angesprochenen Punkten nicht mit mir &uuml;berein. Damit und auch mit Passagen,
in denen er mir beispielsweise vorwirft, meinerseits ein x86-Fanatiker zu
sein (was definitiv nicht der Fall ist), k&ouml;nnte ich gut leben, denn es gibt
nun mal nicht nur eine, sondern sehr viele unterschiedliche Positionen in
der &quot;Amiga-Frage&quot;. Allerdings habe ich beim Lesen der Zeilen doch etwas den
Eindruck gewonnen, dass der Leser mein Schlusswort &quot;in den falschen Hals
bekommen&quot; hat, denn er unterstellt mir, ich betriebe Schuldzuweisungen und
w&uuml;rde einen S&uuml;ndenbock suchen.
</P>
<P>
Beides m&ouml;chte ich mit aller Entschiedenheit zur&uuml;ckweisen. Ich habe
niemanden irgendeiner Sache beschuldigt, erst recht keinen Amiga-Anwender.
Ich habe lediglich zum Ausdruck gebracht, dass ich der festen &Uuml;berzeugung
bin, dass diejenigen, die an eine PPC-only-Zukunft des Amiga glauben, mit
ihrer Einsch&auml;tzung der Erfolgschancen falsch liegen - und zu irren kann
keinem verboten sein. Ebenso mache ich niemanden f&uuml;r das Scheitern dieses
Weges verantwortlich, da dies zu verhindern meiner &Uuml;berzeugung nach ja
gerade nicht in der Macht der Amiga-User liegt. Somit kann es auch keinen
&quot;S&uuml;ndenbock&quot; geben. Im &Uuml;brigen bin ich der Meinung, dass ich den
betreffenden Artikel eher ruhig und relativ emotionslos verfasst habe - im
Gegensatz zu manch anderem Schlusswort der Vergangenheit.
</P>
<P>
Abschlie&szlig;end m&ouml;chte ich anmerken, dass ich zum Thema &quot;PPC-Amiga&quot; in den
letzten Monaten nahezu alles gesagt habe, was mir wichtig ist. Nun warte
ich mit euch gemeinsam auf das Erscheinen der angek&uuml;ndigten Hard- und
Softwareprodukte - wenn auch mit einer v&ouml;llig anderen Erwartungshaltung
als dies bei manch anderem User der Fall ist.
</P>
<P>
Meiner Sch&auml;tzung zufolge wird etwa ein halbes bis Dreivierteljahr nach dem
Erscheinen von Pegasos und des AmigaOS 4.0 bzw. einer Endanwenderversion
von MorphOS der (Miss)Erfolg dieses Weges schon relativ klar erkennbar
sein. Zu der Zeit werde ich mich erneut zu diesem Thema &auml;u&szlig;ern.
</P>
<P><B>Carsten Schr&ouml;der &lt;<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
