<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P><B>Der falsche Weg (von Christian Aichinger)</B></P>
<P>
Eigentlich will ich nicht! Nein, ich mag kein Schlusswort schreiben. Warum?
Weil sich in einigen Teilen der Amiga-Fangemeinde ein derart sturer
Fanatismus entwickelt hat, da&szlig; die Folge auf eine pers&ouml;nliche Einsch&auml;tzung
der Amiga-Situation eine verbale und anonyme &quot;Lynchjustiz&quot; in einem
beliebigen Amiga-Forum im Internet sein kann. Langsam bekomme ich das
Gef&uuml;hl, da&szlig; einigen Amiga-Fans die lange Isolation vom technologischen
Fortschritt gar nicht gut getan hat. Werden in einer Mailingliste oder
einem Forum Zweifel angemeldet und mit konkreten Argumenten untermauert,
da&szlig; eine Entwicklung des zuk&uuml;nftigen AmigaOS exklusiv f&uuml;r PowerPC-Hardware
nur geringe Zukunftschancen haben k&ouml;nnte...allein diese Aussage scheint
f&uuml;r einige Verfechter des PowerPC-Lagers ein pers&ouml;nlicher Angriff zu sein,
der zumeist mit &Auml;u&szlig;erungen gekontert wird, die schon weit unterhalb der
G&uuml;rtellinie liegen. Tja, Amiga-Fans &quot;k&auml;mpfen&quot; mit harten Bandagen und viele
zudem mit Scheuklappen. Wenn die Argumente fehlen, gibt es nur noch verbale
Tiefschl&auml;ge, mit denen die eigene Meinung verteidigt werden kann.
</P>
<P>
AmigaOS auf x86? Das ist Ketzerei! Zumindest denken so einige Amiga-Fans,
die sich selbst als gebrannte Kinder bezeichnen und &quot;Wintel&quot; f&uuml;r
Teufelszeug halten. Nun ja, wer nicht in der Lage ist, einen PC korrekt zu
konfigurieren (sei es aus Unwissenheit oder den eingeschr&auml;nkten
administrativen Befugnissen) schiebt dies allzu gern auf die verwendete
Plattform (ich spreche aus eigener Erfahrung ;-) ). Dass so ein PC aber
sehr leicht selbst zusammengebaut werden kann, da alle Teile genormt und
&uuml;berall erh&auml;ltlich sind und au&szlig;erdem der hart umk&auml;mpfte x86-Markt den
Hardwarehersteller zu Bestleistungen in Sachen Leistungsf&auml;higkeit,
Verf&uuml;gbarkeit und Preis zwingt, wird dabei aber gerne verschwiegen. Ja, ich
frage mich wirklich, wozu ich &uuml;berhaupt eine eigene Plattform f&uuml;r den
Bestandteil des Amigas, der mir am meisten bedeutet - dem AmigaOS -
ben&ouml;tige? W&auml;re die Zeit und das Geld in der Weiterentwicklung und Anpassung
des AmigaOS an x86-CPUs nicht wesentlich besser aufgehoben? Mu&szlig; wirklich
eine Plattform aus dem Boden gestampft werden, die mit dem Erscheinen fast
schon wieder veraltet und zu allem &Uuml;berflu&szlig; alles andere als preiswert ist?
Ist es nicht egal, welches &quot;Herz&quot; in einem Computer schl&auml;gt, so lange es
den heutigen Anspr&uuml;chen v&ouml;llig gen&uuml;gt?
</P>
<P>
Schauen wir uns doch mal die beiden zuk&uuml;nftigen Amiga-Plattformen an:
Pegasos als auch AmigaONE verf&uuml;gen &uuml;ber AGP-, USB-, PCI- und IDE-
Schnittstellen, an denen selbstverst&auml;ndlich wieder herk&ouml;mmliche Peripherie,
ihre Arbeit erledigen soll. Sogar der Formfaktor des Mainboards ist
standardisiert - denn als ATX ausgelegt und somit in fast beliebigen
Computergeh&auml;usen einsetzbar. Nur ein kleines letztes Detail unterscheiden
diese beiden Plattformen vom sogenannten Industriestandard: die CPU!
</P>
<P>
Anstatt auf das bestm&ouml;gliche Ergebnis des freien x86-Marktes (Intel, AMD
und diverse andere Hersteller) zu setzen, verschreiben sich Amiga-User
lieber dem Wohlwollen des PowerPC-Kartells von IBM und Motorola? F&uuml;r mich
ist dieser Schritt ein Widerspruch zur Individualit&auml;t des Amigas und seiner
Anh&auml;nger. Ein gro&szlig;er Fehler ist dieser Weg allemal, da mit einer
ausreichend gro&szlig;en Anzahl abgesetzter AmigaOS-Systeme, die eine
Wiederbelebung des Softwaremarktes zur Folge h&auml;tte, nicht gerechnet werden
kann. Nun, sei es drum. Ich zumindest habe die Hoffnung auf ein v&ouml;llig
plattformunabh&auml;ngiges AmigaDE, das meiner Meinung nach ein Konzept mit
wesentlich besseren Karten darstellt und das vor allem die Fehde unter den
Amiga-Anwendern endlich beenden w&uuml;rde, noch nicht aufgegeben.
</P>
<P><B>Bis zur n&auml;chsten Ausgabe,</B></P>
<P><B>Euer</B></P>
<P><B>Christian Aichinger</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
