<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. News</H2>
<B> ---------------------------------------------------------------------------<BR>
AmigaOS<BR>
---------------------------------------------------------------------------</B><BR>
<P><B>&quot;dynAMIte&quot;</B></P>
<P>
Wie kurz nach Ver&ouml;ffentlichung der letzten Ausgabe von AMIGA aktuell
bekannt wurde, ist die Entwicklung des Bomberman-Clones dynAMIte wieder
aufgenommen worden. Es ist zwar seitdem kein weiteres Update des Spiels
erschienen, daf&uuml;r aber ein inoffizieller Soundtrack von DJBase, ein neuer
Style namens Enlightenment, angelehnt an Druid II, und au&szlig;erdem ein Update
des SouthPark-Styles sowie des polnischen Catalog-Files auf Version 1.9.
</P>
<P>
<BR>[<A HREF="http://amisource.de/dynamite/" TARGET="_top">http://amisource.de/dynamite/</A>]
<BR>[<A HREF="http://http://www.djbase.de/audio/letsdynamite.mp3" TARGET="_top">http://http://www.djbase.de/audio/letsdynamite.mp3</A>]
</P>
<P><B>&quot;Payback&quot;</B></P>
<P>
Apex Designs hat das mittlerweile siebte Update f&uuml;r das Gangsterspiel
Payback herausgegeben, das einige Fehler beseitigt und der 68k-Version noch
einen kleinen Geschwindigkeitsschub verpassen soll.
Weiterhin ist ein Update der Map &quot;D-Town&quot; erschienen.
</P>
<P>
Wenn man die Amiga-Mailinglisten verfolgt, dann wird man von Zeit zu Zeit
auch ein paar Nachrichten vom Autor James Daniels finden, und die k&ouml;nnten
mit dem Port des Spiels nach AmigaDE zusammenh&auml;ngen.
</P>
<P>
Payback-Fans, die Lust haben, eigene Maps zu erstellen, k&ouml;nnen sich zudem
bei Ricco Clemens von <A HREF="mailto:Amig@lien">Amig@lien</A> melden, denn die Jungs m&ouml;chten eine
Payback-Update-CD-ROM erstellen.
</P>
<P>
<BR>[<A HREF="http://www.apex-designs.net/" TARGET="_top">http://www.apex-designs.net/</A>]
<BR>[<A HREF="http://www.amigalien.de/paypack/" TARGET="_top">http://www.amigalien.de/paypack/</A>]
</P>
<P><B>&quot;Earth 2140 Mission Pack&quot;</B></P>
<P>
Das Ende letzten Jahres erschienene Mission Pack zum Command&amp;Conquer-Clone
Earth 2140 soll bei einigen PPC-Besitzern f&uuml;r Probleme gesorgt haben.
Pagan Games hat Abhilfe in Form eines Updates geschaffen, das allerdings
nur installiert werden sollte, falls wirklich Fehler aufgetreten sind.
</P>
<P>
<BR>[<A HREF="http://www.pagan-games.com" TARGET="_top">http://www.pagan-games.com</A>]
</P>
<P><B>&quot;ScummVM&quot;</B></P>
<P>
Letzten Monat nur f&uuml;r MorphOS erh&auml;ltlich, nun auch f&uuml;r AmigaOS-best&uuml;ckte
Rechner: ScummVM. Mittels dieses Tools wird es m&ouml;glich, diverse Klassiker
aus dem Hause LucasArts auch auf der Freundin zu spielen, so z.B. &quot;Day Of
The Tentacle&quot; oder &quot;Sam&amp;Max&quot;. Das Programm ist zwar noch in der Betaphase
und einige Bugs gilt es noch zu beheben, aber auf einem 68060er rennen die
Spiele eigentlich, man sollte es nicht glauben, zu schnell.
</P>
<P>
<BR>[<A HREF="http://sebelinteractive.de/scummvm/" TARGET="_top">http://sebelinteractive.de/scummvm/</A>]</P>
<P><B>&quot;Mahjongg&quot;</B></P>
<P>
Das polnische Programmierteam hat Version 1.4 des asiatischen Brettspiels
ver&ouml;ffentlicht, das einige Fehler weniger enth&auml;lt als die Vorg&auml;ngerversion.
</P>
<P><BR>[<A HREF="http://www.amiga.pl/redgroup/" TARGET="_top">http://www.amiga.pl/redgroup/</A>]</P>
<P><B>&quot;Quake 2&quot;</B></P>
<P>
Leider, leider, leider ist der Port von Quake 2 noch nicht fertig. Als
kleinen Appetithappen gibt es aber zumindest einige neue Screenshots zu
bestaunen, die auch diverse funktionierende MODs zeigen. Die Amiga-Quaker
werden beispielsweise nicht auf &quot;Star Wars&quot; oder &quot;Matrix&quot; verzichten
m&uuml;ssen.
</P>
<P><BR>[http:/aug99.de/quake2/]</P>
<P><B>&quot;Feeble Files&quot;</B></P>
<P>
Das Adventure um die Au&szlig;erirdischen soll laut Aussagen von Epic-Interactive
beinahe fertig sein und Mitte Februar sollten alle Zocker den Amiga-H&auml;ndler
ihres Vertrauens aufsuchen und sich das Spiel zulegen.
</P>
<P><BR>[<A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A>]</P>
<P><B>&quot;Ermentrud&quot;</B></P>
<P>
Auf der Website zum wohl durchgedrehtesten Amiga-Adventure der letzten Zeit
kann man erste Bilder des Spiels bestaunen. Die Arbeiten an der Engine sind
n&auml;mlich endlich abgeschlossen und es kann am Spielinhalt gearbeitet werden.
Wer sich berufen f&uuml;hlt, dem Spiel einige Grafiken beizusteuern, darf sich
&uuml;brigens beim Autor melden, denn der sucht noch ein paar tatkr&auml;ftige
Unterst&uuml;tzer. Mehr dazu auf der Website.
</P>
<P><BR>[<A HREF="http://www.inutilis.de/ermentrudgame/" TARGET="_top">http://www.inutilis.de/ermentrudgame/</A>]</P>
<P><B>&quot;Tales of Tamar&quot;</B></P>
<P>
Ich glaube fast, man sollte dem Spiel mittlerweile einen Untertitel
verpassen, so etwas wie &quot;Die unendliche Geschichte&quot;. Eternity Entertainment
Software hat f&uuml;r die Betatester mittlerweile Version 0.40 R5 des auf
Mittelalter getrimmten Internet-Spiels herausgebracht, aber die
kaufwilligen Hobbyk&ouml;nige warten immer noch. Hey, Eternity, ich habe da mal
eine Frage: &quot;Wann???&quot;
</P>
<P><BR>[<A HREF="http://www.tamar.net/" TARGET="_top">http://www.tamar.net/</A>]</P>
<B> ---------------------------------------------------------------------------<BR>
MorphOS<BR>
---------------------------------------------------------------------------</B><BR>
<P>
Tja, f&uuml;r MorphOS gibt's eigentlich keine Neuigkeiten zum Thema Spiele.
&quot;Feeble Files&quot; wird nat&uuml;rlich so wie es im AmigaOS-Spiele-Newsteil steht
auch f&uuml;r MorphOS erscheinen, denn Epic-Interactive m&ouml;chte sich ja zuk&uuml;nftig
auf dieses Betriebssystem beschr&auml;nken - ich wollte aber einfach irgendwie
ein Copy&amp;Paste vermeiden. ;)
</P>
<P><B>Oliver &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt; - schickt mir eure News!</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
