<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>5. Oldies but Goldies</H2>
<P>
Eigentlich hatte ich f&uuml;r diese Ausgabe ja einen ganz anderen Klassiker
geplant, aber der muss bis zum n&auml;chsten Mal warten. Beim St&ouml;bern habe ich
n&auml;mlich einen anderen entdeckt, der vor kurzem zum Download freigegeben
wurde...
</P>
<P>
Anno 1150, prasselnde Lagerfeuer, Britannien, holde Maiden. Hat schon
jemand erraten, welchen Titel ich diesmal ausgesucht habe? Richtig:
Defender of the Crown.
</P>
<P>
 <A HREF="img/defender.jpg"><IMG SRC="thumb/defender.jpg" WIDTH="120" HEIGHT="87" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Im Jahre 1986, als eines der ersten Amiga-Spiele &uuml;berhaupt, erschien das
gute St&uuml;ck und schlug ein wie eine Bombe. Cinemaware hatte einen wahren
Knaller hingelegt.
</P>
<P>
Zur Hintergrundgeschichte: K&ouml;nig Richard ist ermordet worden und man selbst
ist von den Sachsen auserw&auml;hlt worden, den Thron zu erobern, den Normannen
in den Allerwertesten zu treten und dem ausgebrochenen B&uuml;rgerkrieg ein Ende
zu bereiten.
</P>
<P>
Bewaffnet mit der Maus dirigiert der Spieler fortan seine Streitmacht &uuml;ber
die Landkarte, beschafft Nachschub und erobert gegnerische L&auml;ndereien.
Spannend wird das Einnehmen einer Burg. Zuerst gilt es, die Mauern per
Katapult einzurei&szlig;en, und anschlie&szlig;end muss man auch noch seine Fechtk&uuml;nste
unter Beweis stellen.
</P>
<P>
Da das alles gar nicht so einfach ist, darf man dreimal seinen alten Kumpel
Robin Hood zu Hilfe holen, der die eigene Armee ein wenig unterst&uuml;tzt.
</P>
<P>
Und damit das Erobern nicht zu langweilig wird, kann man auch schon einmal
ein Turnier ausrufen (oder eingeladen werden), um sich mit der Lanze beim
Gegner Respekt zu verschaffen und ihm mit gen&uuml;gend K&ouml;nnen auch eine seiner
L&auml;ndereien abzukn&ouml;pfen.
</P>
<P>
Ja, und f&uuml;r die Tapferen und Edlen unter den Zockern gibt es von Zeit zu
Zeit auch noch die Chance, eine Lady aus der Gefangenschaft zu befreien und
bei Gefallen zu ehelichen.
</P>
<P>
Wer das Spiel noch nicht kennt oder wer es noch in seiner Diskettenbox
vermisst, darf es sich ganz legal von der Website des Herstellers
Cinemaware [1] herunterladen. Dort findet man auch noch ganz andere Dinge
dazu. Musikst&uuml;cke und Screenshots zum Spiel sind sicherlich nichts
Besonderes, aber das Spiel, als Shockwave-PlugIn im Browser spielbar
(leider nicht auf dem Amiga), oder eine angek&uuml;ndigte WAP-Version f&uuml;r
entsprechend potente Handies [2], &uuml;berraschen dann doch. F&uuml;r alle g&auml;ngigen
Handies findet man jedoch auf der Psyria-Website [3] den Soundtrack zum
Spiel, den man per Noteneditor als Klingelton eingeben kann.
</P>
<P>
In Arbeit ist sogar eine general&uuml;berholte neue Version des Spiels mit
zeitgem&auml;&szlig;er Optik und Musik, aber ob die jemals den Sprung auf die
Freundin schaffen wird, ist fraglich.
</P>
[1] <A HREF="http://www.cinemaware.com" TARGET="_top">http://www.cinemaware.com</A><BR>
[2] <A HREF="http://www.atomic-planet.com" TARGET="_top">http://www.atomic-planet.com</A><BR>
[3] <A HREF="http://www.psyria.de" TARGET="_top">http://www.psyria.de</A><BR>
<P><B>Oliver &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
