<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Spieleteil (von Oliver Tacke und J&uuml;rgen Theiner)</H1>
<H2>1. Vorwort</H2>
<P>
Jetzt stehe ich aber vor einem Problem. Ich bin zu einer Netzwerkparty
eingeladen worden, auf der haufenweise Spiele gedaddelt werden sollen -
nat&uuml;rlich auf dem PC, und ich habe keinen. Ich habe ja angeboten, man k&ouml;nne
Heretic II spielen oder Shogo, aber die kannte gar keiner. Bleibt zu
hoffen, dass irgendwann einmal wieder wirklich aktuelle Spieletitel den Weg
auf die Freundin finden - oder eine lebende Legende wie &quot;Counterstrike&quot;,
&quot;StarCraft&quot; oder &quot;Ultima Online&quot;. Sicher, kann keiner bezahlen, ich h&ouml;re
ja auch schon auf...
</P>
<P>
Es stellt sich aber unweigerlich die Frage, ob der Amiga im Spielebereich
&uuml;berhaupt noch eine Zukunft hat. Selbst die PCs bekommen langsam aber
sicher Konkurrenz von den Konsolen, denn sie werden einfach an den
Fernseher angest&ouml;pselt und laufen und bieten von der Technik her akzeptable
Werte, auch wenn ich von Hardcore-Gamern immer h&ouml;re, dass ihre Soundkarte
ja noch zwei Kan&auml;le mehr h&auml;tte, etc.
</P>
<P>
Um so erfreulicher, dass immer noch hochwertige Spiele f&uuml;r den Amiga
erscheinen, wenn auch nicht die taufrischesten. Gerne h&auml;tte ich diesmal
ein wenig mehr &uuml;ber &quot;Quake II&quot; erz&auml;hlt, aber das ist leider noch nicht
ganz fertig, vielleicht beim n&auml;chsten Mal.
</P>
<P>
Wor&uuml;ber ich noch viel lieber berichten w&uuml;rde, weil es eine eigenst&auml;ndige
Amiga-Entwicklung ist und zuerst f&uuml;r unseren Lieblingsrechner erscheinen
wird, ist &quot;Tales of Tamar&quot;. Die Betatester sind schon fr&ouml;hlich am zocken,
und das schon seit geraumer Zeit, aber irgendwie will das Spiel nicht
erscheinen.
</P>
<P>
Trotzdem haben wir wieder einige interessante Dinge f&uuml;r euch fertig gemacht
und im Schlusswort bringe ich einen kleinen Ausblick auf das, was wir
zuk&uuml;nftig noch planen. Viel Spa&szlig; mit dem aktuellen Spieleteil!
</P>
<P><B>Oliver &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
