<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Review: &raquo;Conflict: Freespace&laquo;</H2>
<P><B>Im Weltraum h&ouml;rt dich niemand schreien</B></P>
<P>
Es ist mal wieder soweit, Hyperion bringt ein neues Spiel auf den Markt.
Oder anders ausgedr&uuml;ckt: Das Spiel des Jahres 2002 ist erschienen!
Ganz so voreilig wollen wir mit den Vorschusslorbeeren allerdings nicht
sein, aber es ist schon wahrscheinlich. Momentan scheint bei Hyperion K&ouml;nig
Medas zu regieren: Alles was die anfassen, wird zu Gold. Heretic II wurde
von Shogo &uuml;bertroffen, und nun steht das dritte Spiel an: Freespace.
Hyperion entwickelt Warp3D und arbeitet am neuen AmigaOS. Beim Fu&szlig;ball sagt
man da: Die haben einen Lauf.
</P>
<P>
&raquo;Conflict: Freespace - The Great War&laquo; (so der volle Titel; urspr&uuml;nglich
angek&uuml;ndigt als &raquo;Descent: Freespace&laquo;) erscheint in einer schicken DVD-
H&uuml;lle. Das Cover, die CD, alles ist professionell gemacht. Mir pers&ouml;nlich
fehlt ein gedrucktes Booklet mit einer Kurzanleitung und der
Hintergrundstory, zumal in den Readme-Dateien auf der CD nur die &Auml;nderung
gegen&uuml;ber dem Handbuch zu lesen sind. Apropos CD: Auf der prall gef&uuml;llten
Silberscheibe sind neben dem Spiel (nat&uuml;rlich gepackt) und den eben
angesprochenen Texten (in Deutsch und Englisch, als Guide- und Textdatei)
noch die aktuellen Versionen von WarpOS, Warp3D und AHI. Diese Dateien
werden dringend ben&ouml;tigt. Und da es immer noch Leute geben soll, die
Heretic II nicht haben, ist auch eine Demoversion des Hyperion-Hits mit auf
der CD.
</P>
<P>
Da die Hintergrundstory wie gesagt nicht mitgeliefert wollen wir uns die
Zeit nehmen zu sehen, worum es &uuml;berhaupt in Conflict: Freespace geht:
</P>
<P>
 <A HREF="img/freespace1.jpg"><IMG SRC="thumb/freespace1.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Die&nbsp;</TD><TD VALIGN="TOP">Geschichte von Freespace beginnt im 14. Jahr des Krieges zwischen den&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Erdbewohnern&nbsp;</TD><TD VALIGN="TOP">und&nbsp;</TD><TD VALIGN="TOP">den&nbsp;</TD><TD VALIGN="TOP">Vasudans. Beide Seiten beendeten aber sofort ihre&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Auseinandersetzung, nachdem&nbsp;</TD><TD VALIGN="TOP">die technologisch &uuml;berlegenen Shivans in den&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Kampf eingriffen. Sie sind technologisch derart &uuml;berlegen, dass Sie beim&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">ersten&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Zusammentreffen ihre Schiffe nicht anvisieren k&ouml;nnen und ihrer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Schutzschild-Technologie haben Sie ebenfalls nichts Vergleichbares&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">entgegenzusetzen. Sie m&uuml;ssen daher anfangs jede direkte Auseinandersetzung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">mit den Shivans vermeiden und stattdessen versuchen, ihre Technologie zu&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">stehlen. Gl&uuml;cklicherweise sind Sie nicht alleine, denn Ihre Wingman&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">unterst&uuml;tzen Sie. Sie haben sogar Kontrolle &uuml;ber alle befreundeten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Kampfflugzeuge und k&ouml;nnen zus&auml;tzlich noch Verst&auml;rkung anfordern.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Bevor ich in die Details des Spieles eingehe, hier die
Mindestvoraussetzungen (laut Hyperion):
PPC603e/160MHz + Grafikkarte (mu&szlig; keine 3D-Karte sein) oder 68060 +
Permedia2/Voodoo3-basierte 3D-Grafikkarte, 64 MByte RAM (mindestens 48
MByte frei). Aber wie gesagt: Dies ist wirklich das absolut Mindeste, was
dein Amiga bieten mu&szlig;; ich (siehe &quot;Testkonfig&quot;) kann auf meinem Rechner
schon nicht die beiden h&ouml;chsten Detailstufen laufen lassen. Richtig
ruckelfrei ist selbst bei mir nur die vorletzte Stufe.
</P>
<P>
Aber langsam kann es doch mal losgehen, oder? Also installiere ich
Freespace. Der Installer ist wie gehabt professionell aufgebaut, die
Installation dauert aufgrund der Datenmenge allerdings mehrere Minuten.
Vielleicht w&auml;re f&uuml;r die Zukunft ein Zwischenspiel á la Tetris oder
SpaceInvaders ein witziges Goodie. Und einen Fehler hat die Installation
auch noch: Liegen ben&ouml;tigte Libraries in &auml;lteren Versionen vor, werden
diese nicht automatisch &uuml;berschrieben, und beim Systemstart kommt es zu
Fehlermeldungen aufgrund falscher Libs. Hier mu&szlig; man diese dann von Hand
kopieren.
</P>
<P>
Nachdem nun alles installiert ist, sollte sich auf der Festplatte ein
Ordner mit 3699 Dateien und einer Gesamtgr&ouml;&szlig;e von 676,214,122 Bytes
befinden (Vollinstallation). Klar, da&szlig; es so lange gedauert hat.
Wir starten FSLaunch und k&ouml;nnen hier Freespace unseren W&uuml;nschen
entsprechend anpassen, das Readme lesen, die Webseite von Hyperion aufrufen
und das Spiel starten bzw. komplett verlassen. Auf das Setup werde ich
nicht komplett eingehen, da es sehr umfangreich ist und die Bubble-
Hilfetexte (leider Englisch) eigentlich alles erkl&auml;ren. Nur als Tipp: Wenn
man eine Voodoo-Karte hat, mu&szlig; man bei Warp3D die Alpha-Texturen
ausschalten, sonst hat man Grafikfehler. Wenn nun jeder das Spiel seinem
System angepasst hat, kann es endlich losgehen: Das Setup schlie&szlig;en und
PlayFreespace dr&uuml;cken!
</P>
<P>
 <A HREF="img/freespace2.jpg"><IMG SRC="thumb/freespace2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das Spiel startet mit dem obligatorischen Einblenden der Logos, und dann
kommt das Intro. Und hier hei&szlig;t es festhalten. Ich empfehle, den Sound voll
aufzudrehen, sich zur&uuml;ckzulehnen und in das Freespace-Universum
einzutauchen. Dieser gerenderte Film (auch hier leider komplett in
Englisch, aber &quot;HELP, HELP&quot; kriegen wir alle hin, oder?) f&uuml;hrt
eindrucksvoll ins Spielgeschehen ein. Nach dem Film mu&szlig; man einen Piloten
generieren bzw. einen bereits vorhandenen ausw&auml;hlen. Und dann kommt man in
den Optionsscreen. Und wenn dieser euch hier auf dem Screenshot schon
gef&auml;llt, werdet ihr im Spiel aus dem Staunen nicht mehr herauskommen: Er
ist komplett animiert! Geil! Von hier aus geht es los zum Grundtraining.
Hier gilt es drei Abschnitte zu bestehen, und man wird so in die grobe
Steuerung des Schiffes eingewiesen. Eine Stimme aus dem Off (Deutsch!)
unterst&uuml;tzt einen und zeigt, wie es geht. Nachteil: Wenn die Stimme sagt
&quot;Erfassen sie mich als Ziel&quot;, steht au&szlig;erdem dort &quot;T&quot;, weil dies zum
Zielerfassen ist. Hat man allerdings in den Optionen die Taste ge&auml;ndert
steht dort trotzdem &quot;T&quot;. Also aufgepasst mit dem Einstellen der Tastatur.
Ansonsten kann ich nur sagen: WAHNSINN!!! Ich war ja schon immer ein Freund
von Learning by doing, aber ich h&auml;tte nie gedacht, da&szlig; ich auf so coole
Weise von dem fehlenden Handbuch abgelenkt werde. Spitze!
Aber nicht nur die Aufmachung dieses Grundtraining ist spitze, die Grafik
(vorletzte Detailstufe!) haut mich echt um. Hier wurde echt geklotzt, nicht
gekleckert. Da gibt es Nebel und Asteroidenfelder, die Explosionen sind
Spitzenklasse und haben sogar eine Druckwelle. Es gibt Lichteffekte wie
Lenseflares und vieles mehr. Schaut euch die Screenshots an oder, besser
noch, spielt die Demo bzw. kauft das Spiel!
</P>
<P>
 <A HREF="img/freespace3.jpg"><IMG SRC="thumb/freespace3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Der Kauf lohnt sich auf jeden Fall f&uuml;r alle, die die Grundvoraussetzung
erf&uuml;llen. Denn die Grafik und das geniale Gameplay sind noch nicht alles.
Da gibt es ja noch diesen ph&auml;nomenalen Sound. Komplett deutsche
Sprachausgabe, Explosionen, die die Boxen zum Zittern bringen und
Flugger&auml;usche wie aus Krieg der Sterne. Die Hintergrundmusik wird nie
langweilig, weil sie sich immer dem Geschehen anpasst und nicht als
Endlosschleife vor sich hintr&auml;llert. Das und die Tatsache, da&szlig; sich immer
ein roter Faden durch das Spiel zieht, macht Freespace zum Tophit. Und das,
obwohl ich gar keine Weltraumflugsimulatoren mag. Ich war fr&uuml;her
wahrscheinlich der Einzige, der WingCommander geha&szlig;t hat. Aber das hier ist
echt der Hammer.
</P>
<P>
Die Missionen sind abwechslungsreich und nicht zu leicht, nicht zu schwer
(zur Not gibt es ja Cheats). Cutscenes lassen keine Langeweile aufkommen
und vermitteln eher das Gef&uuml;hl, einen Film zu sehen. Man ist echt gespannt,
wie die Geschichte weitergeht.
</P>
<P>
Nat&uuml;rlich mu&szlig; man auch erw&auml;hnen, da&szlig; die Steuerung sehr komplex ist, wie in
diesem Genre halt &uuml;blich. Mit den Grundkenntnissen aus der &Uuml;bungsphase
kommt man nicht immer hin und manch einer mu&szlig; die Tastatur seinen
Bed&uuml;rfnissen anpassen. Wer damit absolut nix am Hut hat, sollte auch von
Freespace die Finger lassen. Die Grafik ist zwar genial, wem aber schon bei
Descent schlecht wurde oder wer sich einfach keine Tastenkombinationen
merken kann und/oder will (bei Heretic II ist das Ma&szlig; schon fast
&uuml;berschritten), der ist hier falsch. Da reicht die Demo, um den Bekannten
zu zeigen, was noch alles in unserer Freundin steckt. Und wer wei&szlig;,
vielleicht entdeckt so mancher in sich einen versteckten Kampfpiloten...
</P>
<P>
 <A HREF="img/freespace4.jpg"><IMG SRC="thumb/freespace4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P><B>Fazit:</B></P>
<P>
Was soll man sagen? Weltraumsimulation der Extraklasse! Wer allerdings
sonst nur Echtzeitstrategiespiele zockt oder ab und zu mal Heretic II
reintut, wird schnell ein flaues Gef&uuml;hl im Magen kriegen, denn Freespace
ist hier ernst gemeint. Man dreht sich in diesem Spiel &ouml;fters um 360 Grad
als AMIGA neue Produkte ank&uuml;ndigt. Wer damit keine Probleme hat und auch
&uuml;ber die n&ouml;tige Hardware verf&uuml;gt, bekommt ein absolutes Hammerspiel
serviert.
</P>
<P><B>Systemanforderung:</B></P>
<P>
Minimum: Amiga mit AmigaOS 3.0, 68060 und 3D-Grafikkarte (Permedia2,
Voodoo3) bzw. PPC603e/160MHz (dann reicht eine 2D-Grafikkarte), 64 MByte
RAM (48 MByte frei) oder Virtual Memory und 32 MByte RAM (nur bei 68k).
Empfohlen ist alles, was dar&uuml;ber liegt. ;-)
</P>
<P><B>Testkonfiguration:</B></P>
<P>
A1200, Zorro IV, PPC603e/240MHz, 128 MByte RAM, Mediator-PCI-Board,
Voodoo3-3000, 60-GByte-Festplattenplatz, 21&quot;-Monitor
</P>
<P><B>J&uuml;rgen &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
