<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Hintergrund: Nutzung des Euro auf dem Amiga (von Michael Christoph)</H2>
<P><B>Einen Klick entfernt vom Euro im AmigaOS</B></P>
<P>
300 Millionen Menschen in 12 L&auml;ndern der Europ&auml;ischen Union haben seit dem
1. Januar 2002 den Euro als Bargeld in ihren Geldb&ouml;rsen. Doch schon seit
dem 1. Januar 1999 ist der Euro offizielles Zahlungsmittel, zumindest im
bargeldlosen Zahlungsverkehr. Umfangreiche Informationen zum Euro sind zu
finden auf den Internetseiten der Europ&auml;ischen Union <A HREF="#310">[1]</A>. Zur &Uuml;bersicht
seien hier nur die M&uuml;nzen und Scheine aufgezeigt.
</P>
<P>
 <A HREF="img/EuroMuenzen.jpg"><IMG SRC="thumb/EuroMuenzen.jpg" WIDTH="120" HEIGHT="84" ALT="Euro - Münzen"  BORDER="0"></A> und  <A HREF="img/EuroScheine.jpg"><IMG SRC="thumb/EuroScheine.jpg" WIDTH="56" HEIGHT="96" ALT="Euro - Scheine"  BORDER="0"></A>
</P>
<P>
W&auml;hrend die Scheine in allen L&auml;ndern gleich aussehen, weisen die M&uuml;nzen
eine landesspezifische R&uuml;ckseite auf. Trotzdem sind auch diese in allen
L&auml;ndern g&uuml;ltig und m&uuml;ssen nicht umgetauscht werden. Die Europ&auml;ische Union
bezweckt damit eine &quot;sichtbare&quot; Vermischung der Europ&auml;er.
</P>
<P>
Dar&uuml;ber hinaus wird der Euro in vielen L&auml;ndern als &quot;Fremdw&auml;hrung&quot;
akzeptiert und teilweise sogar ohne Umtausch angenommen.
</P>
<P>
Nach dieser allgemeinen Einf&uuml;hrung zum Euro wollen wir uns wieder dem Amiga
zuwenden. Erfreulich ist anzusehen, da&szlig; jetzt auch endlich das &quot;Euro-
Update&quot; zum Download <A HREF="#313">[2]</A> bereitsteht. Es bringt den Euro zumindest dem
AmigaOS n&auml;her. Wozu das Euro-Update in der Lage ist, was installiert wird
und noch viele Informationen mehr, folgt in den n&auml;chsten Passagen dieses
Artikels.
</P>
<UL>
<LI> Euro-Update-Installation
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Nachdem das LhA-Archiv geladen und entpackt wurde (z.B. mittels UnArc von&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">OS 3.9) ist folgendes Fenster auf der Workbench vorzufinden:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B> <A HREF="img/EuroInstall1.png"><IMG SRC="thumb/EuroInstall1.jpg" WIDTH="120" HEIGHT="53" ALT="In der Workbench Schublade"  BORDER="0"></A></B></P>
<P>
Nach einem Doppelklick auf das Install-Icon, wird der InstallerNG
gestartet, wie er auch schon zur Installation von AmigaOS 3.9 zum Einsatz
kam. Links oben wird eine Euro-Grafik angezeigt, w&auml;hrend sich rechts unten
das gewohnte Installer-Fenster zeigt. Als erstes ist dabei anzugeben, wie
gut man sich mit dem Amiga auskennt.
</P>
<P><B> <A HREF="img/EuroInstall2.png"><IMG SRC="thumb/EuroInstall2.jpg" WIDTH="120" HEIGHT="67" ALT="Installationsmodus auswählen"  BORDER="0"></A></B></P>
<P>
Diese Auswahl hat n&auml;mlich entscheidende Auswirkungen auf den weiteren
Verlauf der Installation bzw. die weiteren R&uuml;ckfragen.
</P>
<P>
W&auml;hrend bei &quot;Einsteiger&quot; keine weiteren R&uuml;ckfragen mehr erfolgen, mu&szlig; als
&quot;Fortgeschrittener&quot; zumindest noch das Systemlaufwerk angegeben werden,
auf dem AmigaOS installiert ist. Als &quot;Experte&quot; hingegen erfolgt keine
Aktion, ohne erst eine R&uuml;ckfrage inkl. Auswahl der zu installierenden
Komponenten anzuzeigen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><I>&quot;Einsteiger&quot; k&ouml;nnen die nachfolgenden Zeilen &uuml;berspingen.</I>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Alle anderen werden jetzt nach dem Ziellaufwerk befragt. Auf diesem werden
die entsprechenden Systemdateien aktualisiert. Sind mehrere System-
Partitionen vorhanden, z.B. mit unterschiedlichen OS-Versionen, so ist die
Installation f&uuml;r jede einzelne Partition zu wiederholen.
</P>
<P><B> <A HREF="img/EuroInstall3.png"><IMG SRC="thumb/EuroInstall3.jpg" WIDTH="120" HEIGHT="67" ALT="Laufwerk wählen"  BORDER="0"></A></B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><I>&quot;Fortgeschrittene&quot; k&ouml;nnen die nachfolgenden Zeilen &uuml;berspringen.</I>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Bleiben nur noch die &quot;Experten&quot; &uuml;brig, die sich nichts ungefragt auf ihr
System schaufeln lassen wollen. Sie k&ouml;nnen in den nachfolgenden drei
Schritten genau festlegen, welche Dateien aktualisiert werden sollen.
Dabei wird als erstes nach den Tastaturbelegungen gefragt (Keymaps).
</P>
<P><B> <A HREF="img/EuroInstall4.png"><IMG SRC="thumb/EuroInstall4.jpg" WIDTH="120" HEIGHT="67" ALT="Zu installierende Tastaturbelegung wählen"  BORDER="0"></A></B></P>
<P>
Als n&auml;chstes folgen die Systemschriften (Fonts).
</P>
<P><B> <A HREF="img/EuroInstall5.png"><IMG SRC="thumb/EuroInstall5.jpg" WIDTH="120" HEIGHT="67" ALT="Zu installierende Schriften auswählen"  BORDER="0"></A></B></P>
<P>
Und zum Schlu&szlig; kommen noch die Landesbeschreibungen (Country).
</P>
<P><B> <A HREF="img/EuroInstall6.png"><IMG SRC="thumb/EuroInstall6.jpg" WIDTH="120" HEIGHT="67" ALT="Zu installierende Landesbeschreibungen auswählen"  BORDER="0"></A></B></P>
<P>
Und damit h&auml;tten dann alle Benutzer ihr AmigaOS aktualisiert.
</P>
<P>
Zur Sicherheit sollte noch ein Reboot vorgenommen werden, damit die neuen
Keymaps und Fonts auch zum Einsatz kommen!
</P>
<UL>
<LI> ISO 8859-15?
</LI>
</UL>
<P>
Wer die Installationstexte aufmerksam verfolgt und liest, wird bereits
dar&uuml;ber informiert, da&szlig; das Euro-Symbol ab sofort (bzw. nach dem Reboot)
&uuml;ber die Tastenkombination &quot;ALT + E&quot; abgerufen werden kann. Diese
Kombination wird auch in der PC-Welt verwendet und ist auf den neueren PC-
Tastaturen auch aufgedruckt. Wie dies nun intern realisiert wird, folgt im
n&auml;chsten Abschnitt. Zuerst soll noch auf die, bereits in der &Uuml;berschrift
genannte, Norm ISO 8859-15 eingegangen werden. Der Amiga verwendet, wie
auch Linux, die ASCII-Code-Zeichensatztabelle 8859-1. In dieser ist genau
festgelegt, welches Zeichen auf welchem ASCII-Code zu finden ist.
</P>
<P>
Dabei sind die unteren 128 Zeichen (Code 0-127) in aller Welt identisch und
stammen noch aus den (7 Bit-) Anf&auml;ngen des Computers. W&auml;hrend die Codes 0
bis 31 als Steuercodes bezeichnet werden, sind ab 32 die &quot;sichtbaren&quot;
Zeichen zu finden. Lediglich 127 ist wieder ein Steuerzeichen, und zwar die
Del-Taste.
</P>
<P><B> <A HREF="img/iso8859-basis.png"><IMG SRC="thumb/iso8859-basis.jpg" WIDTH="91" HEIGHT="96" ALT="ISO 8859 - Basistabelle"  BORDER="0"></A></B></P>
<P>
Die oberen 127 Zeichen (Code 128-255) hingegen sind l&auml;nderspezifisch belegt
worden, wobei wieder die ersten 31 Codes (128-159) f&uuml;r Steuerzeichen
reserviert sind. So finden sich z.B. in anderen Tabellen kein &auml;, &ouml; oder &uuml;,
wie sie im Deutschen vorkommen. ISO 8859-15 entspricht einer Erweiterung
bzw. Aktualisierung der 8859-1-Tabelle. Dabei wurde das Euro-Zeichen auf
den ASCII-Code 164 genormt, das bisher bereits ein allgemeines
W&auml;hrungssymbol enthielt, welches aber in der Praxis nicht verwendet wurde.
</P>
<P><B> <A HREF="img/iso8859-1_15.png"><IMG SRC="thumb/iso8859-1_15.jpg" WIDTH="109" HEIGHT="96" ALT="ISO 8859-1- und -15-Tabelle im Vergleich"  BORDER="0"></A></B></P>
<P>
Die anderen l&auml;nderspezifischen Zeichen aus 8859-15 wurden allerdings nicht
&uuml;bernommen, so da&szlig; man eigentlich von einer 8859-1 mit Euro-Zeichen
sprechen mu&szlig;.
</P>
<P>
Windows-User sollten aber nicht darauf vertrauen, da&szlig; auch dort das Euro-
Symbol auf 164 zu finden ist. Hier kocht Microsoft wieder mal ein eigenes
S&uuml;ppchen (ich sage nur Steuercode 128)...
</P>
<UL>
<LI> Wozu Keymaps?
</LI>
</UL>
<P>
Woher wei&szlig; aber nun der Amiga, da&szlig; er das Euro-Symbol (bzw. das Zeichen mit
ASCII-Code 164) darstellen soll, wenn die Taste &quot;ALT + E&quot; gedr&uuml;ckt wird?
Dies regeln die sogenannten Keymaps, welche &uuml;ber den Prefs-Einsteller
&quot;Input&quot; festgelegt werden. F&uuml;r Deutschland und Umgebung w&auml;re das die &quot;d&quot;-
Belegung. Bisher produzierte der Amiga den ASCII-Code 169, was dem
Copyrightsymbol entsprach ((c)). Nach der Update-Installation werden die
Tastenbelegungen von E und Z vertauscht. Das Copyrightzeichen ist also nun
mit &quot;ALZ + Z&quot; erreichbar. Was mir pers&ouml;nlich nicht gef&auml;llt, ist auch die
Vertauschung von &quot;ALT + Shift + E und Z&quot;. Konnte man doch das Copyright-
Symbol bisher auch mit &quot;ALT + Shift + E&quot; erzeugen.
</P>
<UL>
<LI> Mit KeyComp zur eigenen Tastaturbelegung!
</LI>
</UL>
<P>
Es w&auml;re aber kein Amiga, wenn dem nicht auch durch den Benutzer beizukommen
w&auml;re! Im Aminet ist hierzu ein kleines Tool, genannt &quot;KeyComp&quot; zu finden
<A HREF="#316">[3]</A>. Es handelt sich zwar nur um ein Shell-Kommando ohne GUI (grafischer
Oberfl&auml;che), trotzdem sollte jeder damit zurechtkommen.
</P>
<P>
Das Archiv enth&auml;lt zwei Programme. Mit dem ersten, KeyRes, kann eine
existierende Keymap-Datei zur Bearbeitung extrahiert werden, w&auml;hrend mit
KeyComp aus dieser Beschreibung wieder eine Keymap-Datei erzeugt wird.
</P>
<P><B>KeyRes erwartet eine Input-Datei und optional eine Output-Datei:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">keyres sys:devs/keymaps/d d.kms&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B> <A HREF="img/KMFEditieren.png"><IMG SRC="thumb/KMFEditieren.jpg" WIDTH="120" HEIGHT="45" ALT="Die von KeyRes erzeugte Datei bearbeiten"  BORDER="0"></A></B></P>
<P>
Die Datei d.kms kann mit einem beliebigem Texteditor bearbeitet werden. Pro
Taste sind die unterschiedlichen Zeichen angegeben, die je nach gedr&uuml;ckter
Qualifier-Taste angezeigt wird. In der Original-d-Keymap-Datei ist in Zeile
103 die Tastenkombination &quot;ALT + E&quot; zu finden. Dort hat das Euro-Zeichen
seinen neuen Platz. 22 Zeilen tiefer ist dann die Kombination &quot;ALT + Z&quot; zu
finden, auf die das Copyrightsymbol gelegt werden kann.
</P>
<P>
Mit KeyComp, das wieder eine Input-Datei erwartet, w&auml;hrend die Output-Datei
optional ist, wird dann die neue Keymap-Datei generiert:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">keycomp d.kms sys:devs/keymaps/d&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Danach ist ein Rechnerneustart notwendig, damit die neue Tastaturbelegung
in allen Bereichen aktiv wird. Zum Ausprobieren reicht es aber aus, einfach
ein neues Shell-Fenster zu &ouml;ffnen.
</P>
<P>
Auf diese Weise k&ouml;nnen nat&uuml;rlich auch andere Tasten ver&auml;ndert und nach
eigenen Vorlieben belegt werden.
</P>
<P>
Einen Mangel an KeyComp mu&szlig;te ich auf meinem System allerdings feststellen.
Es funktioniert nicht unter meiner Version von AmigaOS 3.9. Ob das nur an
meiner Version liegt oder generell ein Problem ist, kann ich nicht sagen.
</P>
<UL>
<LI> Weitere Schriftarten am Amiga
</LI>
</UL>
<P>
Und jetzt wird das Euro-Symbol auch sichtbar - durch die Fonts (Schriften).
Die Fonts sind beim Amiga im Systemverzeichnis in der Schublade &quot;Fonts&quot; zu
finden (zumindest bei allen Benutzern, die dies nicht umkonfiguriert
haben). Dabei existiert jeweils ein Verzeichnis, in dem die Schriftgr&ouml;&szlig;en
abgelegt sind, und eine Verwaltungsdatei mit der Endung &quot;.font&quot;.
Interessant sind die Dateien in den Schubladen, z.B. &quot;courier/12&quot;. Die
Fonts kann man sich als gro&szlig;es Blatt Papier mit 255 nummerierten K&auml;stchen
vorstellen. In jedem K&auml;stchen ist die Grafik eines Zeichens untergebracht.
Wird nun &quot;ALT + E&quot; gedr&uuml;ckt, so &uuml;bersetzen dies die Keymaps in den ASCII-
Code 164, und der Amiga holt sich das 164ste Zeichen aus der Fonts-Tabelle
und &quot;pinselt&quot; es auf den Bildschirm.
</P>
<P>
Damit sollte dann aber auch jedem verst&auml;ndlich sein, da&szlig; das Euro-Symbol
nur mit den aktualisierten System-Schriften funktioniert. Die von AWeb
installierten Gr&ouml;&szlig;en 30 der Schriftart courier beispielsweise enthalten
kein Euro-Symbol. Besonders &auml;rgerlich ist dabei, da&szlig; auch die AGFA-
Compugraphic-Schriften (CGTimes, CGTriumvirate und LetterGothic) nicht
aktualisiert wurden. Dies d&uuml;rfte aber mit den abgelaufenen Lizenzen an den
Schriften zusammenh&auml;ngen.
</P>
<P>
Eine durchaus als legal anzusehende M&ouml;glichkeit w&auml;re, nur die Differenzen
zu ver&ouml;ffentlichen (z.B. mittels des SAS-Tools scompare zum Erzeugen und
spatch zum Einmischen der &Auml;nderungen vom Benutzer). Dadurch w&uuml;rden keine
&quot;gesch&uuml;tzten&quot; Dateien verbreitet. Vielleicht findet sich ja noch jemand,
der sich diese M&uuml;he macht.
</P>
<P>
Neben den Bitmap- und Compugraphic-Schriften kann der Amiga aber auch noch
TrueType darstellen, zumindest wenn die ttf.library installiert ist. Manche
Programme, z.B. AmigaWriter, unterst&uuml;tzten die TrueType-Fonts auch direkt.
Diese aus der Windows-Welt stammenden Schriften sind auf vielen CDs und
Onlineseiten zu finden. Entsprechend gro&szlig; ist aber auch die Bandbreite an
Qualit&auml;t!
Problematisch ist allerdings, da&szlig; in den TrueType-Schriften das Euro-Symbol
teilweise auf dem Steuercode 128 zu finden ist - nennen wir es mal
&quot;Microsoft-Norm&quot;. Da es sich hierbei um ein Steuerzeichen handelt, kann es
nicht direkt eingegeben werden.
</P>
<P>
Desweiteren gibt es noch TrueType-Fonts in Unicode, bei welchen das Euro-
Zeichen in Tabelle 1252 auf Buchstabe 8364 zu finden ist.
</P>
<P>
Eine weitere Schriftfamilie ist PostScript von Adobe, die beim Amiga aber
praktisch kaum eine Rolle spielt. Sie ist vor allem im DTP-Bereich sehr
verbreitet und wird daher auch in PageStream direkt unterst&uuml;tzt. Vor allem,
wenn Druckvorlagen f&uuml;r ein Kopierstudio erstellt werden sollen, eignen sich
die PostScript-Fonts sehr gut. Eine korrekte Umwandlung der Compugraphic-
Fonts in eine Postscript-Datei hat, zumindest bei mir, PageStream noch
nicht geschafft.
</P>
<UL>
<LI> Neue Schriften braucht der Amiga
</LI>
</UL>
<P>
Eine qualitativ hochwertige Schrift-CD hat Haage &amp; Partner f&uuml;r 49 EUR in
seinem Sortiment. Die &quot;Mega Font Euro Edition&quot;-CD <A HREF="#319">[4]</A> enth&auml;lt 5000
Schriften, jeweils in den Formaten TrueType und PostScript, welche alle &uuml;ber
ein zur Schrift passendes Euro-Symbol verf&uuml;gen.
</P>
<P><B> <A HREF="img/megafontcd.png"><IMG SRC="thumb/megafontcd.jpg" WIDTH="96" HEIGHT="96" ALT="MegaFont CD"  BORDER="0"></A></B></P>
<P>
Auf der Herstellerseite von freefont.de findet sich auch eine sogenannte
&quot;Starter Edition&quot; mit 50 Schriften. Dieses Archiv <A HREF="#322">[5]</A> mit 16.6 MByte Umfang
kann sich jeder Interessierte herunterladen, um sich so von der Qualit&auml;t
der Schriften zu &uuml;berzeugen.
</P>
<P><B> <A HREF="img/starteredition.jpg"><IMG SRC="thumb/starteredition.jpg" WIDTH="112" HEIGHT="96" ALT="Die Starter Edition"  BORDER="0"></A></B></P>
<UL>
<LI> EuroCalc
</LI>
</UL>
<P>
Wer einen kleinen W&auml;hrungsrechner f&uuml;r den Amiga sucht, dem kann ich auf
meine Homepage <A HREF="#325">[6]</A> bzw. die Amiga-Magazin-CD 2/3-2002 verweisen. Dort ist
das Programm EuroCalc zu finden. Es zeigt den eingegebenen Wert jeweils
in den 12 anderen Landesw&auml;hrungen an.
</P>
<P>
Interessierte finden au&szlig;erdem den Sourcecode hierzu auf der Developer-CD
2.1 im Verzeichnis &quot;ADCD_2.1:NDK/NDK_3.5/Tools/ReActor/Examples/EuroCalc/&quot;.
</P>
<P><B> <A HREF="img/EuroCalc.png"><IMG SRC="thumb/EuroCalc.jpg" WIDTH="83" HEIGHT="96" ALT="EuroCalc Währungsrechner"  BORDER="0"></A></B></P>
<UL>
<LI> Der Euro in der Software
</LI>
</UL>
<P>
Obwohl dem Euro ein Chaos bei der Einf&uuml;hrung vorausgesagt wurde, hat sich
nichts davon bewahrheitet. Die B&uuml;rger kommen mittlerweile mit dem Euro
recht gut zurecht und bald wird auch keiner mehr von DM oder DM-Betr&auml;gen in
der Praxis oder der Software sprechen.
</P>
<P>
Betrachtet man so manches Programm, wird dabei nicht einmal eine W&auml;hrung
angezeigt, war doch immer klar, da&szlig; Betr&auml;ge in DM ausgewiesen waren. Mit
gleicher Selbstverst&auml;ndlichkeit kann man nun davon ausgehen, da&szlig; ab sofort
alle Betr&auml;ge als Euro zu werten sind - der g&uuml;ltigen Basisw&auml;hrung eben.
Wenn es m&ouml;glich ist, mu&szlig; auch nur das &quot;DM&quot; gegen ein &quot;EUR&quot; getauscht
werden. Das kann von der Software (auch ohne eventuell angepasste Fonts)
dargestellt und gedruckt werden.
</P>
<P>
Ist die W&auml;hrung fest einprogrammiert, k&ouml;nnen erfahrene Anwender auch mit
einem Hex-Editor auf Suche gehen. Problematisch k&ouml;nnte es allerdings
werden, da normalerweise nur zwei Stellen vorgesehen sind, aber EUR(O) mit
drei Zeichen abgek&uuml;rzt wird. Verwendet das Programm allerdings eine
Standard-Systemschrift, kann auch das Euro-Zeichen selbst (und ein
folgendes Leerzeichen) eingesetzt werden.
</P>
<P>
Schwieriger wird es mit alten Daten (z.B. Benzinkostenverwaltung). Hier ist
es am einfachsten, ein neues Projekt zu beginnen. Wenn man unbedingt noch
die alten Daten direkt mit den neuen vergleichen will, wird man nicht um
die m&uuml;hselige Arbeit herumkommen, jeden einzelnen Eintrag von Hand
umzurechnen und einzugeben. EuroCalc ist hierbei eine m&ouml;gliche Hilfe.
Findige Programmierer k&ouml;nnen dieses Vorgang aber auch automatisieren und
direkt die gespeicherten Datenbest&auml;nde manipulieren.
</P>
<UL>
<LI> Schwarz auf wei&szlig;
</LI>
</UL>
<P>
W&auml;re abschlie&szlig;end nur noch das Problem mit dem Drucker anzugehen. Das Euro-
Zeichen soll schlie&szlig;lich auch auf dem Papier herauskommen. Bereitet das
gew&auml;hlte Programm die Druckausgabe selbst auf und wird das Euro-Zeichen am
Bildschirm dargestellt, kommt es auch am Drucker heraus. In diesem Fall
wird n&auml;mlich die ganze Seite als &quot;Grafik&quot; an den Drucker geschickt.
Etwas anderes ist es, wenn z.B. reiner Text direkt gedruckt wird, wie es
bei (einfachen) Texteditoren der Fall ist. Dann kommen i.d.R. die
druckereigenen Schriften zum Einsatz. Und ob diese bereits &uuml;ber ein Euro-
Symbol verf&uuml;gen, l&auml;sst sich am einfachsten durch Probieren ermitteln.
Teilweise bieten die Hersteller auch Patches oder neue ROM-Bausteine f&uuml;r
den Drucker an. Ein Blick auf die Homepage des Druckerherstellers oder
Nachfrage bringen hier Klarheit.
</P>
<UL>
<LI> Der H&auml;rtetest zum Schlu&szlig;
</LI>
</UL>
<P>
Nachdem jetzt unterschiedliche Aspekte des Euro genauer beleuchtet wurden,
abschlie&szlig;en noch der &quot;H&auml;rtetest&quot;:
</P>
<P><B> ¤</B></P>
<P>
Wer jetzt kein Euro-Zeichen sieht, hat das Euro-Update noch nicht
installiert oder verwendet keine Systemschrift zur Anzeige dieses Textes!
Sollten noch Fragen vorhanden sein, kann sich jeder gern per Mail an
mich pers&ouml;nlich wenden!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A NAME=310>[1]&nbsp;</TD><TD VALIGN="TOP">Europ&auml;ische Union&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://europa.eu.int/euro/html/home3.html?lang=3" TARGET="_top">http://europa.eu.int/euro/html/home3.html?lang=3</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP"><A NAME=313>[2]&nbsp;</TD><TD VALIGN="TOP">Euro-Update&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.haage-partner.de/aos39/Euro-Update.lha" TARGET="_top">http://www.haage-partner.de/aos39/Euro-Update.lha</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP"><A NAME=316>[3]&nbsp;</TD><TD VALIGN="TOP">KeyComp&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="ftp://de.aminet.net/pub/aminet/util/cli/KeyComp.lha" TARGET="_top">ftp://de.aminet.net/pub/aminet/util/cli/KeyComp.lha</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP"><A NAME=319>[4]&nbsp;</TD><TD VALIGN="TOP">Mega Font Euro Edition&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.haage-partner.com/products/megafonts_d.htm" TARGET="_top">http://www.haage-partner.com/products/megafonts_d.htm</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><BR>[5] MegaFont &quot;Starter Edition&quot; [zip-Archiv]&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.softspace.de/down/megastar.exe" TARGET="_top">http://www.softspace.de/down/megastar.exe</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">[6]&nbsp;</TD><TD VALIGN="TOP">EuroCalc&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.meicky-soft.de/abin/eurocalc.html" TARGET="_top">http://www.meicky-soft.de/abin/eurocalc.html</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
