<HTML>
<HEAD>
<TITLE>REFLECTOR 036</TITLE>
</HEAD>
<BODY BACKGROUND="../Pix/Back.GIF">
<CENTER>
<H1><IMG SRC="../Pix/Reflecto.GIF" ALT="[REFLECTOR]"></A></H1>
<H2>EDITORIAL</H2><P>
</CENTER>
<HR SIZE=5><P>
<B>Reflector 036</B><P>

Schon wieder einen neue Ausgabe von Reflector. Reflections 4.1 ist ja jetzt endlich ausgeliefert
worden und Carsten Fuchs hat mal wieder einen großen Schritt nach vorne gemacht. Partikel Animation
in einem Raytracer für unter 500,- DM, wo hat es das schon mal gegeben. Der gute alte Kamera
Editor aus Ref 2.5 hat auch wieder einzug in Reflections erhalten. Mathe Texturen, auch zum Nachkaufen,
super. Jetzt muß Oberland nur noch die Power PC Version bringen, dann ist der Amiga dem PC in Sachen 
Geschwindigkeit wieder ebenbürtig.<P>

Nun noch etwas in eigener Sache. Wir wissen, daß Urlaubszeit ist. Aber mit so wenig 
Post haben wir im Traum nicht gerechnet. Unsere Dauerschreiber und unsere einzigen 
Club-Aktiven kommen in dieser Ausgabe zum Schuß. Ansonsten Fehlanzeige. Was ist denn bloß
los in unserem Club ? Gibt es nicht genug neues in Reflections was einem zum Rendern
bewegen könnte ? Schon mal die neuen Mathe Texturen ausprobiert ? Die 060'er Version für
den AMIGA sollte jetzt auch schon da sein, habt Ihr da nicht Neuerungen oder so gefunden?<P>

<B>Hier nochmals unser Aufruf: Schickt uns Bilder, Szenen, Fonts, Leserbriefe und
alles was mit Raytracing zu tun hat. Das Schriftliche bitte auf Disk im ASCII Format.
Nur so können wir eine Interessante Ausgabe erstellen.</B><P>


Viel Spa&szlig; mit dieser Ausgabe.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
<HR><P>

<DL>
<DT>Unsere Adressen:<DD><P>

<B>Uwe Sauder<BR>
Aakerf&auml;hrstr. 104<BR>
47058 Duisburg<BR>
Tel.: 0203-338557<P>

Olaf Gr&ouml;ning<BR>
Beckeradstr. 111<BR>
45897 Gelsenkirchen<BR>
Tel.: 0209-598816<P>

Werner Prass<BR>
Am Feldbusch 40<BR>
45889 Gelsenkirchen<BR>
Tel.: 0209-812029</B><P>
</DL>

<DL>
<DT>Bankverbindung:<DD><P>

<B>Volksbank Gelsenkirchen-Buer, Bankleitzahl: 42260001, Konto: 130 141 100</B><P>
</DL>

<DL>
<DT>Die REFLECTIONS-Mailboxen:<DD><P>

<B>O U Z O N I X - B B S<BR>
offline:  0.00-0.06 + 3.30-4.30 h<BR>
Sysop:  Ioannis Chatziandreou<P>

Fido Line #1 2:2448/1460.0 - Tel. Nr. 0234-9351320 (US-Robotic-DS 1200-36600 Baud)<BR>
Fido Line #2 2:2448/1461.0 - Tel. Nr. 0234-9351321 (ZyXEL U1496EG+ 1200-19200 Baud)<BR>
Fido Line #3 2:2448/1462.0 - Tel. Nr. 0234-9351318 (ISDN)<BR>
UUCP: ouzonix.ruhr.de<P>

D A R K S T A R - B B S<BR>
Sysop: Scarabeus (Andreas Stevens)<P>

Port #0: Tel. Nr. 02451-66999  (Active V.34 + ISDN)<BR>
Port #1: Tel. Nr. 02451- 7918  (ZyXEL V.34 + FAX)<BR>
eMail: Scarabeus@DarkStar.tng.oche.de</B><P>
</DL><P>

Downloads aus den <B>REFLECTIONS</B>-Areas der Mailboxen sind frei !!<P>
<HR> <P>

<H3>WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG</H3> <P>
 Die Archive (bzw. die Disketten) d&#252;rfen nur UNVER&#196;NDERT weitergegeben werden !
 Mailboxen, die sich mit dem Verbreiten von NAZI - Parolen und Hetze gegen
 Ausl&#228;nder und anderen Minderheiten hervortun, ist die Benutzung  von
 <B>REFLECTOR</B>-Disketten (egal ob zum Up- oder Downloaden) im ganzen oder teilweise
 (z. B. einzelne Bilder etc.) bei Strafandrohung (auch gegen User dieser Boxen)
 untersagt. Alle <B>REFLECTOR</B>-Ausgaben und Sonderdisks sind zwar im weitesten Sinne
 PublicDomain-Disks, aber kein Werbetr&#228;ger f&#252;r braune Schei&#223;e. Wir hoffen, das
 war klar und deutlich. Gleiches gilt nat&#252;rlich auch f&#252;r Mailboxen die sich mit
 dem Verbreiten linksradikal ausgerichteter Propaganda hervortun. Bei Fragen zu
 der <B>REFLECTOR</B>-PD-Serie oder zum <B>REFLECTIONS-Club</B> wendet Euch an die weiter oben
 genannten Adressen.<P>

 <B>Copyrights</B><P>
 sind nicht ganz unwichtige Sachen. Die Bilder, Animationen, Fonts, Objekte
 und Tools usw. auf dem <B>REFLECTOR</B>-Magazin und dessen Sonderausgaben, wie der
 <B>FontBox</B>-, der <B>REFLECTUR</B>- oder <B>REFLECTOR-Objektbibliothek</B> unterliegen zum
 gro&#223;en Teil diesem Copyright. Das hei&#223;t, da&#223; keine Beitr&#228;ge ohne die
 Einwilligung des Autors f&#252;r andere Zwecke, wie z. B. Ver&#246;ffentlichung auf
 anderen PD-Serien, Verkauf oder &#228;hnliches, benutzt werden d&#252;rfen. Vom
 Copyright ausgenommen sind Beitr&#228;ge, bei denen der Autor auf sein Copyright
 verzichtet, bzw. sein Beitrag als PublicDomain, Free- oder Shareware
 deklariert hat. Entsprechende Hinweise sind in den Info-Texten zu finden.
 Das gleiche gilt selbstverst&#228;ndlich auch f&#252;r die auf <B>REFLECTOR</B> und seinen
 Sonderausgaben benutzten Programme. Die Rechte der Programme liegen beim
 jeweiligen Autor. Wenn ein Beitrag vom Autor als Shareware, Giftware oder
 anderes deklariert ist, dann ist, entsprechend den Nutzungsbedingungen des
 Autors, das gew&#252;nschte Entgeld, Geschenk oder &#228;hnliches zu entrichten.<P>
 Wir k&#246;nnen aus eigener Erfahrung sagen,da&#223; jeder Autor, der uns f&#252;r das
 <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben Beitr&#228;ge zur Verf&#252;gung gestellt
 hat, dazu gerne bereit war. Bei Interesse an einer weiteren Verwendung dieser
 Beitr&#228;ge schreibt an den jeweiligen Autor. Schlie&#223;lich freut sich wohl jeder
 &#252;ber Post (wenn´s denn keine Rechnungen sind).<P>
 &#252;brigens gibt es f&#252;r das <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben ebenfalls
 ein Copyright. Wir behalten uns n&#228;mlich das Recht vor, da&#223; <B>REFLECTOR</B> und seine
 Sonderausgaben nur in unver&#228;nderter Form weitergegeben werden d&#252;rfen.<P>

<HR Size=5>
<A HREF="../Hauptmen.HTM"><IMG SRC="../Pix/Pfeilz.GIF" ALT="[ZURUECK]"></A> ZURUECK
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>