<HTML>
<HEAD>
<TITLE>REFLECTOR 036</TITLE>
</HEAD>
<BODY BACKGROUND="../Pix/Back.GIF">
<CENTER>
<H1><IMG SRC="../Pix/Reflecto.GIF" ALT="[REFLECTOR]"></A> </H1>
<B>T O O L S - P O O L</B>
</CENTER>
<HR Size=5><P>

<B>VirusZ II v1.39 (Amiga)</B><P>

Jeder kommt fr&uuml;her oder sp&auml;ter mal in die Verdr&uuml;ckung, sich mit den geha&szlig;ten
digitalen Plagegeistern, im Jargon auch Viren genannt, herumzuschlagen. Bedeutet
dies in der Regel jede Menge &Auml;rger, Kopfzerbrechen, defekte Datenbest&auml;nde, infizierte
Programme, erh&ouml;hter Zigaretten- und Kaffeekonsum, unglaubliche Fl&uuml;che, die die
gute Erziehung durch die Eltern anzweifeln lassen, den Wunsch so einen verfl...
Viren - Programmierer mal kennenzulernen und K&ouml;rpersprache walten zu lassen und
so weiter und so weiter.<BR>
Umso wichtiger sind Vorbeugema&szlig;nahmen und der Einsatz eines oder besser mehrerer
Antiviren - Tools. Zwar bietet kein Viruskiller absoluten Schutz vor den Plagegeistern,
aber man schl&auml;ft halt besser.<P>

<B>VirusZ II</B> ist ein solches Antiviren-Tool. Als Commodity konzipiert kann
das Tool als Hintergrundprogramm benutzt werden, das jederzeit Disketten und den
Speicher auf Viren pr&uuml;ft. Au&szlig;erdem verf&uuml;gt das Programm &uuml;ber umfangreiche
Pr&uuml;fmechanismen f&uuml;r Sektoren, Dateien, Systemvektoren und auch Bootbl&ouml;cke. Hinzu
kommt noch der ARexx-Port, mit dem man <B>VirusZ II</B> auch von anderen
Programmen aus nutzen kann. Selbstverst&auml;ndlich kann das Programm auch gepackte
Datenbest&auml;nde entpacken und auf Virenbefall pr&uuml;fen und erkennt auch etliche
Patches, die in so manchen System vor sich hin laufen.<P>

<B>VirusZ II</B> ben&ouml;tigt mindestens OS 2.04 und l&auml;uft auch auf einem 68000er.
Weiterhin werden die regtools.library und die xfdmaster.library ben&ouml;tigt, wobei
sich diese im Lieferumfang befinden. Die deutschsprachige AmigaGuide kl&auml;rt
gr&uuml;ndlich &uuml;ber die Bedienung des Programmes auf. Das Programmpaket ist Shareware,
bei Nutzung ist also ein gewisser Betrag an den Autor zu &uuml;berweisen. Im Anbetracht
dessen, da&szlig; <B>VirusZ II</B> keinerlei Beschr&auml;nkungen aufweist, ist es mehr als
nur fair den Betrag auch zu bezahlen. Der Autor empfiehlt hier einen Betrag von
DM 20 oder mehr.<P>

Hier die Anschrift des Programmautors:<P>

<PRE><B><FONT SIZE=4>
        Georg H&ouml;rmann
        Martinswinkelstr. 16c

        82467 Garmisch-Partenkirchen
</B></PRE></FONT><P>


<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<A HREF="../Tools.HTM"><IMG SRC="../Pix/Pfeilz.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../Hauptmen.HTM"><IMG SRC="../Pix/Pfeil.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
