<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Change Of Heart</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Change Of Heart&quot;</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Hierbei handelt es sich um das Beb&uuml;t der gleichnamigen britischen Band
&quot;<B>Change of Heart</B>&quot;. Auf dem Cover springt gerade, irgendwo in r&ouml;tlichen
Wolken, eine Frau mit einem Hechtsprung durch eine quadratische Fl&auml;che,
auf der sich Wasserringe abzeichnen. Das Booklet macht einen schlichten
Eindruck, es sind aber zumindest alle Texte verzeichnet.</P>

<P>Das wichtigste ist nat&uuml;rlich die Musik. Und mit &quot;<B>Sweat It Out</B>&quot; beginnt
das Album schon einmal sehr flott. Wunderbar melodischer Rock mit einer
gef&auml;lligen Liedstimme und einem reichhaltigen Sound, bei dem besonders
der markante Einsatz von Keyboards auff&auml;llt. Gitarre und Schlagzeug
kommen nat&uuml;rlich auch nicht zu kurz.</P>

<P>&quot;<B>The Fire Is Gone</B>&quot; beginnt ruhiger, ist wieder mit einer sehr eing&auml;ngigen
Melodie ausgestattet und relativ schnell. Neben dem, offenbar f&uuml;r diese
Gruppe stehenden, virtuosen Einsatz von Keyboards und gutem Gesang, fallen
das `sich Zeit nehmen` f&uuml;r kurze Instrumentalvariationen und der gelungene
Hintergrundgesang auf. Den Schlu&szlig;akkord setzt hier eine Akustikgitarre.</P>

<P>&quot;<B>A Place In Your Heart</B>&quot; ist eine Midtempo-Ballade, die sehr gelungen ist.
Ein prima Gitarrensolo beginnt wieder eine gute Instrumentalsequenz, die
keine langweilige Abfolge `Strophe, Refrain, Strophe, Refrain` zul&auml;&szlig;t. Die
Zuversicht, die der Text ausstrahlt, beginnt auf den Zuh&ouml;rer &uuml;berzugehen.</P>

<P>&quot;<B>When It`s Love</B>&quot; ist wieder ein eher schnellerer Titel, der beim Kehrreim
mitrei&szlig;t und ebenfalls mit dem eigent&uuml;mlich keyboardbeeinflu&szlig;ten Sound
begeistert, da merkt man wie dieses Mittel von vielen Gruppen sch&auml;ndlich
vernachl&auml;ssigt wurde. Hintergrundgesang und Liedstimme spielen sich
au&szlig;erdem die `B&auml;lle` gekonnt zu.</P>

<P>&quot;<B>Someone Else</B>&quot; ist etwas Spezielles. Als langsamer Titel, mit besonders
intensivem Gesang vorgetragen, folgt er nicht dem gewohnten Schema, denn
er hat keinen Refrain und der Text wiederholt sich &uuml;berhaupt nicht.</P>

<P>Es dreht sich um eine Frau, die gegangen ist, aber niemals zur&uuml;ckkehren
wird. Hat `er` sie in den Selbstmord getrieben, war es ein Unfall...?</P>

<center>
             <B>&quot;      They said the body was hers<br>
                    But I swore it couldn`t be<br>
                     Because I saw her tonight<br>
              And she was just as alive as you and me &quot;</B>

</center>
<P>
Der Schmerz wird f&ouml;rmlich sp&uuml;rbar. Enden tut der Song mit einer langen
Instrumentalsequenz, die immer neue Variationen im Klang aufzeigt und
einfach nicht langweilig wird. Phantastisch!</P>

<P>&quot;<B>Always Be The One</B>&quot; ist wieder ein Titel, der Lebensfreude vermittelt
und Spa&szlig; macht. Etwas zum richtig mitgehen.</P>

<P>&quot;<B>Until The End Of Time</B>&quot; wird von etwas getragenerem Tempo bestimmt, klingt
nachdenklicher. Eine sch&ouml;ne Ballade!</P>

<P>&quot;<B>Don`t Walk Away</B>&quot; ist einer meiner Lieblingstitel, wegen seinem so
markanten, einzigartigen Sound. Melodie, Stimme und Instrumente vereinen
sich zu einer unbeschreiblich gelungenen Mischung. Der Song ist ruhig,
verk&ouml;rpert aber eine unterdr&uuml;ckte, von innen kommende Kraft. Die
Endsequenz, wieder nur mit Instrumenten vorgetragen, findet bis zum
immer leiser werdenden Schlu&szlig; st&auml;ndig neue Variationen des Grundthemas. </P>

<P>Mit Gitarrenkl&auml;ngen beginnt &quot;<B>All I Need</B>&quot; und ist vordergr&uuml;ndig nicht dem
von den anderen Titeln gewohnten Stil unterworfen, weist mehr Klavierkl&auml;nge
auf und wirkt sehr beschwingt.</P>

<P>In &quot;<B>Stranger</B>&quot; wirkt die eigentlich bekannte Stadt, die so gut bekannten
Stra&szlig;en und Pl&auml;tze auf den Mann, der sie betritt, pl&ouml;tzlich anders. Alles
erinnert ihn an die, mit der er hier war und die ihm jetzt fehlt. Er f&uuml;hlt
sich wie ein Fremder. Diese Gef&uuml;hle wuden hier in Musik gekleidet und sind
kongenial umgesetzt worden.</P>

<P>Bei &quot;<B>Somebody To Love</B>&quot; ist wieder eine etwas typischere Ballade, die
dazu aufruft, gewisse Entscheidungen zu &uuml;berdenken. </P>
<P>
<B>Fazit:</B></P>

<P>Ein beeindruckender Erstling der neuen Gruppe, der auch f&uuml;r die
Zukunft neugierig macht. Der sehr eigenst&auml;ndige, ausgereifte Stil,
eine Geschlossenheit des Albums zur Einheit und nicht zuletzt der
beeindruckende, nicht langweilig werdende, variable Sound, machen dieses
Album f&uuml;r mich zu einer der besten Neuerscheinungen der letzten Zeit.</P>

<P>&copy; 1998 Escape Music Ltd., Vertrieb in Deutschland durch Point Music.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903cd3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


