<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Das gro&szlig;e Krabbeln</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Das gro&szlig;e Krabbeln</H1>von<BR>
<A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P>Schon knapp ein halbes Jahr ist es her, da&szlig; wir die Abenteuer des
Ameisenhelden Z auf der gro&szlig;en Leinwand bewundern durften. Ger&uuml;chtehalber
entstand dieser Film aus dem Hause Dreamworks erst nach dem nun zu
bewundernden Disney/Pixar-Kontrahenten <B>&quot;Das gro&szlig;e Krabbeln&quot;</B>, das dasselbe
V&ouml;lkchen als seine Hauptdarsteller bezeichnen kann. </P>

<P>Und obwohl es sich also um dieselben Tierchen handelt und es ganz klar
eine Menge &Auml;hnlichkeiten gibt, f&auml;llt es doch schwer, die Filme wirklich
als Kontrahenten zu bezeichnen. W&auml;hrend <a href="../mmx/9812film.htm">&quot;ANTZ&quot;</a> wohl eher f&uuml;r ein
erwachsenes Publikum gestrickt war oder dessem Geist zumindest auch
eine Menge zu tun zu geben vermochte, so handelt es sich hier doch klar
um eine Disney-Produktion, die vornehmlich kindgerecht ist, obgleich
nat&uuml;rlich der ganzen Familie Spa&szlig; machen kann.</P>

<P>Die Differenzen ergeben sich schon in der Darstellung der Ameisen: sie sind
bl&auml;ulichviolett und haben statt sechs Beinen nur vier, genauer: zwei Beine
und zwei Arme. Auch die Darstellung ihrer Welt ist nicht so verspielt-
detailliert wie bei ANTZ; man beschr&auml;nkt sich auf die Existenz eines
Ameisenhaufens auf einer &quot;Insel&quot;, eigentlich auf alles, was man braucht,
um die Story zu erz&auml;hlen: die Geschichte des Helden Flick, der, voll von
Ideen, aber von seinen Mitameisen nicht f&uuml;r voll genommen, auszieht, um
Hilfe gegen die Grash&uuml;pfer zu holen, die die Ameisen unterdr&uuml;cken, um sich
die Nahrung von ihnen erarbeiten zu lassen.</P>

<P>Flick will die Grash&uuml;pfer verjagen, und zwar indem er eine bunte
Zirkustruppe engagiert, die er f&uuml;r Kampfinsekten h&auml;lt. Und w&auml;hrend er
seinen Irrtum erkennt und sich endg&uuml;ltig f&uuml;r einen Versager h&auml;lt, merkt er
nicht, da&szlig; er wirklich etwas geleistet hat, indem er an sie geglaubt und
ihnen dadurch das Gef&uuml;hl, etwas besonderes zu sein, gegeben hat...</P>

<P>Darum geht es eigentlich auch im &quot;gro&szlig;en Krabbeln&quot;: um das Ringen nach
Akzeptanz und Anerkennung; das Gef&uuml;hl, jemand zu sein; gebraucht zu werden.
Danach strebt nicht nur Flick, sondern auch Prinzessin Ata, ihre kleine
Schwester und besondere Freundin Dot, die gesamte Zirkustruppe und der
Bruder des Oberb&ouml;sewichtes Hopper: sie alle streben danach, gro&szlig; zu sein.</P>

<P>Dies alles wird rasant und mit vielerlei Gags dargestellt, die aber eher
zum Schmunzeln denn zum Lachen anregen.</P>

<P>Technisch schien mir dieses Werk etwas hinter &quot;ANTZ&quot; hinterherzuhinken,
aber das mag ein subjektiver Eindruck sein, der vielleicht einerseits auf
die kr&auml;ftigeren Farben, andererseits auf die gehaltreichere Welt des
Kontrahenten zur&uuml;ckzuf&uuml;hren ist.</P>

<P>Bleibt noch zu sagen, da&szlig; man das Kino nicht zu fr&uuml;h verlassen sollte,
denn im Abspann wartet noch ein ganz besonderer Gag auf den geduldigen
Betrachter. Hier wird so getan, als seien die Figuren wirklich Schauspieler
und man bekommt Fehl-Takes zu sehen, die wirklich sehr witzig sind. Als
Beispiel sei die Szene angef&uuml;hrt, in der Flick sich einen Pusteblumensamen
krallt, um damit das Flu&szlig;bett zu &uuml;berqueren, und pl&ouml;tzlich Captain Buzz
Lightyear (na, klingelts?) immitiert. </P>
   
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903fil2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


