<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Shakespeare in Love</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Shakespeare in Love</H1>von<BR>
<A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P>Shakespeare's Werke waren ja in den letzten Jahren beliebtes Material
f&uuml;r Kinofilme. Nun hat sich John Madden dem K&uuml;nstler selbst gewidmet
und ihm eine schwungvolle Liebesstory spendiert. Dabei erspart er es
sich und dem Publikum, seinen Helden schw&uuml;lstige Redensarten beizulegen,
macht sie stattdessen durch einen freiz&uuml;gigen Jargon vertraut und
bereichert ihre Rollen mit allerlei Schwung, Witz und Komik. Der Stand
der Dichter und Schauspieler wird mit liebevoll sympathischen Z&uuml;gen
versehen, deren bester der der Verspieltheit ist.</P>

<P>Shakespeare (Joseph Fiennes) ermangelt es an Ideen, er w&auml;hnt sein Talent
verloren und ist auf der Suche nach einer Mu&szlig;e, die seine Feder wieder
befl&uuml;gelt. An Gespielinnen fehlt es ihm nicht, jedoch ist es nur die
wahre Liebe, die seine Worte wieder tanzen lassen kann.</P>

<P>Noch w&auml;hrend er nach dieser sucht, erh&auml;lt er den Auftrag, eine Kom&ouml;die
zu schreiben, den er gleich von zwei Geldgebern annimmt. Damit wissen
wir nicht nur unseren Helden gem&auml;&szlig; dem Mythos des tapsigen Genies
charakterisiert, sondern kennen auch gleich sein Umfeld, welches
vornehmlich in der Theaterszene der beiden konkurrierenden B&uuml;hnen
besteht. Klar, da&szlig; es da Turbulenzen gibt.</P>

<P>Nach einigem hin und her verliebt sich der Gute endlich in die h&uuml;bsche
Viola (Gwyneth Paltrow) und es entbrennt eine hoffnungsvolle und durch
deren Verm&auml;hlung doch zum j&auml;hen Ende bestimmte Romanze, die das Herz des
Zuschauers zuweilen erweichen und Shakespeare's Geist zu inspirieren
vermag.</P>

<P>Viola will wahre Liebe, keine Romantik, wie man sie in den Theatern findet,
sondern das wirkliche Leben, die wirkliche leibhaftige Liebe ... und findet
sie bei Shakespeare, einem Tr&auml;umer, der mit ihr lebt, was er in seinem
Drama schreibt, und zu seinem Drama verarbeitet, was er mit ihr lebt.</P>

<P>Somit stricken sie gemeinsam an einem Theaterst&uuml;ck, das die Liebe so
darstellt, wie sie wirklich ist, w&auml;hrend Madden uns davon verschont,
indem er denselben Stoff zu einer unterhaltsamen Kom&ouml;die macht: mit
Verwechslungen, mit einem Helden, mit Liebe, mit Piraten und mit einem
Hund, wie eine Kom&ouml;die dieser Tage eben sein mu&szlig;, die zwar nicht das
reale Leben sein mag, die aber tr&auml;umen l&auml;&szlig;t.</P>

<P>&quot;Shakespeare in Love&quot; ist die getr&auml;umte Wirklichkeit eines wirklich
gewordenen Traums, ein Theaterst&uuml;ck &uuml;ber die Realit&auml;t des Theaters und
das Theater der Realit&auml;t, in dem die Schauspieler wahrhaftig sind, w&auml;hrend
ihre Gegner sich hinter Masken verstecken, in dem der K&uuml;nstler das Leben
kennt, w&auml;hrend sich die, die es verwalten, seinen Illusionen hingegeben.</P>

<P>Kurzum ist also alles so, wie es im wahren Leben eben ist: was ist,
scheint, die Tr&auml;ume aber sind Realit&auml;t. Und doch lebt dies alles nur
innerhalb von 2 Stunden, ist alles nur Licht, das auf eine Leinwand
projiziert wird. Also doch alles nichts? Wer wei&szlig;. Doch das Gef&uuml;hl ist
so wirklich wie wir selbst und also lieben wir die Tr&auml;ume, in denen wir
von Liebe tr&auml;umen: so vielleicht auch diesen.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903fil1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0399/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


