<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Spellbound</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Spellbound&quot; / Ten</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Ziemlich gro&szlig;e Erwartungen wurden in das neue Studioalbum einer der
f&uuml;hrenden Melodic Hardrock-Bands Gro&szlig;britanniens gelegt. Nun ist es, fast
zeitgleich mit der japanischen Ver&ouml;ffentlichung, auch in Europa erh&auml;ltlich.</P>

<P>Das <B>Cover</B> wurde von dem bekannten spanischen K&uuml;nstler Luis Royo speziell
f&uuml;r &quot;Spellbound&quot; gezeichnet und stellt ein Fantasymotiv dar, auf dem ein
wirklich f&uuml;rchterlicher Drache eine jungfr&auml;uliche Reiterin auf einem
Einhorn angreift. Ein B&uuml;cher-beschw&ouml;render Magier, Flederm&auml;use und eine
Burg d&uuml;rfen auch nicht fehlen.</P>

<P>Auch das <B>Booklet</B> mit zahlreichen Fotos der Gruppenmitglieder und den
gesamten Songtexten wei&szlig; zu gefallen.</P>

<P>Los geht`s mit dem gef&auml;lligen Instrumental &quot;<B>March Of The Argonauts</B>&quot;,
haupts&auml;chlich von Schlagzeug und Gitarren getragen.</P>

<P>Beinahe &uuml;bergangslos folgt dann &quot;Fear The Force&quot;, ein Titel, der bereits
ein hohes Tempo vorlegt und sich inhaltlich, mit dem Kampf zwischen Drachen
und Einhorn, auf das Titelbild bezieht. Gerade die Gitarre sticht beim
Sound hervor und insgesamt schafft es der Titel, einen gerade beim
Kehrreim mitzurei&szlig;en.</P>
<CENTER>
                     <B>&quot; As day and night were born<br>
                       The yin and yang were torn<br>
                      They sail a chartered course<br>
                        Each as the purest source<br>
                        Of darkness and of light<br>
                         In their eternal fight<br>
                       The dragon knows his claws<br>
                         Can`t touch the unicorn<br>
                              Fear the force      &quot;</B>
</CENTER>
<P>Noch h&auml;rter geht es bei &quot;<B>Inside The Pyramid of Light</B>&quot; weiter. Ein recht
origineller Text, der den Kampf zwischen Mark Anton, der mit seinen
Legionen nach &Auml;gypten kam, und Cleopatra beschreibt, den letztere
(allerdings nicht mit milit&auml;rischen Mitteln) gewann.</P>

<P>Leider ist der Titel f&uuml;r meine Verh&auml;ltnisse einfach nicht melodi&ouml;s zu
nennen, sondern ist einfach nur hart und macht keinen Spa&szlig;. Der Schw&auml;chste
der Scheibe.
            </P>
<P>Darauf folgt der Titelsong &quot;<B>Spellbound</B>&quot;. Auch er beginnt mit recht harten
Kl&auml;ngen, einem Merkmal, das sich wesentlich st&auml;rker durch dieses Album
zieht, als in den bisherigen drei. Der Refrain ist dann wieder melodischer
und klingt sehr gut - bildet mit dem Rest durchaus eine Einheit, an die
man sich gew&ouml;hnen kann.</P>

<P>Trotzdem schl&auml;gt ihn der folgende um L&auml;ngen. &quot;<B>We Rule The Night</B>&quot; beginnt
mit Pferdegetrappel und -Gewieher und die Stimme von Gary Hughes wird am
Anfang nur von klassischen keltischen Instrumenten begleitet, bis beim
Kehrreim auch die restlichen Instrumente wirkungsvoll hinzukommen, ohne
das Tempo zu st&ouml;ren. Dieses wird erst allm&auml;hlich schneller, Gesang und
Instrumentierung intensiver. Eine wundervolle Midtempo-Ballade, deren
origineller, einzigartiger Klang &uuml;berzeugt.</P>

<P>Auch &quot;<B>Red</B>&quot; beginnt mit klassisch wirkenden keltischen Kl&auml;ngen, in einer
ruhigen Instrumentalsequenz bis der Gesang, zuerst verhalten, beginnt.
Dann l&auml;utet ein echter Gitarren-Hardrock-Part die schnellere Gangart ein,
trotzdem bleibt Ten auch hier melodisch und ein gewisser markanter Klang,
der sich an den Beginn des Titels anlehnt ist dem &quot;Red&quot; nicht abzusprechen.</P>

<P>&quot;<B>The Alchemist</B>&quot; beginnt schnell und wieder etwas konventioneller `rockig`.
Der Titel bleibt auch schnell und beschreibt die Umtriebe eines Alchimisten
und Zauberers von seiner Burg aus, in einem Land vor unserer Zeit.
Beschwingt vermittelt der Song gute Laune.</P>

<P>&quot;<B>Wonderland</B>&quot; ist ein ziemlich krasser Gegensatz zu den vorangegangenen
Titeln, denn hierbei handelt es sich um sehr softe Ballade, langsam und
ohne jeden harten Klang. Klingt sicherlich gut, aber selbst von Ten
gibt es bessere `weiche` Songs.</P>

<P>Nat&uuml;rlich geht es mit &quot;<B>Eclipse</B>&quot; zur&uuml;ck in die h&auml;rteren Gefilde, wie schon
die ersten Kl&auml;nge verraten. Dieser Titel geh&ouml;rt zu den besseren dieser
Platte, denn kein Instrument sticht zu vereinnahmend hervor, der
Hintergrundgesang im Refrain unterst&uuml;tzt den Sound, zusammen mit einem
wieder sehr interessanten Text, in dem Seeleute auf ein mysteri&ouml;ses
R&auml;tsel treffen, das sie nicht fassen k&ouml;nnen.</P>

<P>Superhart und schnell geht &quot;<B>The Phantom</B>&quot; los, was sich aber wieder etwas
einrenkt. Die Geschwindigkeit bleibt, ebenso wie eine recht eing&auml;ngige
Melodie und ein gewisses Mitf&uuml;hlen mit den Qualen des Phantoms.</P>

<P>Der letzte Titel ist &quot;<B>Till The End Of Time</B>&quot;. Die zweite softe Ballade auf
&quot;Spellbound&quot;. Sehr sparsam (gerade am Anfang) instrumentiert, sehr langsam
und wirklich sehr soft - leider schon in die Schmalzigkeit abdriftend, was
bisher bei noch keinem Ten-Titel der Fall war.</P>

<P>Auch f&uuml;r diese Ballade gilt: da hat man von Ten schon besseres geh&ouml;rt!
Wahrscheinlich sollte mit dieser Extraportion `Weichheit` die ansonsten
verst&auml;rkte H&auml;rte des Albums etwas kompensiert werden. Dies ist aber nicht
gelungen.</P>

<P><B>Fazit:</B></P>

<P>Die Titel haben gro&szlig;es Potential, trotzdem gef&auml;llt mir die neue Richtung
der Gruppe nicht. Jetzt handelt es sich nicht mehr um eine (teilweise)
harte Melodic Rock-Band, sondern um eine melodi&ouml;se aber nichtsdestoweniger
Hardrock-Gruppe. Wer mehr darauf steht, kann hier vielleicht ein
Meisterwerk entdecken.</P>

<P>Aber auch unabh&auml;ngig davon war bisher meiner Meinung nach die Mischung der
Titel und die Einheit, die sie auf den Scheiben bildeten, besser. Da war
schnelles, mittleres und langsames Tempo einfach gekonnt verteilt und
Balladen wirkten nicht eher deplaziert.</P>

<P>F&uuml;r Fans der fr&uuml;hen Ten-Musik ist aber als Trostpflaster auch die Solo-CD
von Gary Hughes &quot;Precious Ones&quot;, sowie &quot;The Tower&quot; von Bob Catley (Ex-
Magnum-S&auml;nger) interessant, f&uuml;r die ersterer ebenfalls die Songs schrieb.</P>

<P>&copy; by Frontiers Records Srl. 1999; Vertrieb durch Point Music; ca. 33,- DM</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


