<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Dangerous Nights</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Dangerous Nights&quot; / Intruder</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Das <B>Cover</B> dieser CD wirkt etwas seltsam: Ein dreidimensionaler, virtueller
(?) Kopf, der &uuml;ber den Augenbrauen in einer glatten Fl&auml;che endet, auf dem
sich ein orangefarbener Wirbel befindet. Nun ja, aber zumindest sch&ouml;n bunt.
:) Im sachlich gehaltenen <B>Booklet</B> sind alle Texte enthalten. </P>

<P>Voller Energie geht es mit &quot;<B>Hearts On The Loose</B>&quot; los. Kr&auml;ftige
Gitarren und Keyboards unterst&uuml;tzen den S&auml;nger und nehmen einen in
bester melodischer Manier f&uuml;r sich ein. Ein &uuml;berzeugender Einstieg.</P>

<P>&quot;<B>Yesterday`s Gone</B>&quot; beginnt mit verhaltenem Gesang, bis Schlagzeug und
restliche Instrumente akzentuiert einsetzen. Der Titel ist ruhiger als der
vorhergehende, aber nicht leise. Sehr gef&uuml;hlvoll, mit einem Gitarrensolo,
wieder recht markanten Keyboards und unterst&uuml;tzendem Hintergrundgesang im
Refrain.</P>

<P>&quot;<B>Deep Inside Our Hearts</B>&quot; kann man als beschwingte Ballade bezeichnen.
Die Stimme von Tracy White kommt besonders gut zur Geltung. </P>

<P>&quot;<B>Surprise Attack</B>&quot; ist wieder etwas `dunkler` und geheimnisvoll, bis man
vom Kehrreim mitgerissen wird. Die Melodie ist sehr eing&auml;ngig und
&uuml;berzeugt.</P>

<P>&quot;<B>Only Make Believe</B>&quot; ist eine klassische Ballade, die mit Klavierkl&auml;ngen
beginnt und zu Beginn nur von der Stimme, wie eine Akustikversion,
begleitet wird. Der Gesang ist sehr einf&uuml;hlsam, umkurvt ohne jede M&uuml;he
die Klippen der &Uuml;bertreibung, bis er sich zusammen mit den begleitenden
Instrumenten zu vollem Einsatz steigert. Ein sch&ouml;nes Lied und ein echter
Ohrwurm.</P>

<P>&quot;<B>(What Goes On) Behind Closed Doors</B>&quot; ist der einzige Titel auf der
CD, der mir nicht zusagt. H&auml;rter und unmelodi&ouml;ser als der Rest.</P>

<P>&quot;Love Emergency&quot; begeistert dagegen wieder. Ruhiger Beginn des Gesangs,
bis beim Refrain die Post abgeht! Bei diesem vollen, runden Sound kommt
Freude auf, und man wird in andere Sph&auml;ren entf&uuml;hrt.</P>

<P>Mit schnellen Kl&auml;ngen startet &quot;<B>Surrender Your Heart</B>&quot;. Etwas h&auml;rter vom
Grundtenor, aber genauso melodisch und mitrei&szlig;end wie die meisten anderen
Titel. </P>

<P>Was folgt, ist der Titelsong &quot;<B>Dangerous Nights</B>&quot;. Er vermag eine
eigent&uuml;mliche Stimmung zu erzeugen, bis der Refrain einsetzt und einem
erkl&auml;rt, wie &quot;gef&auml;hrliche N&auml;chte&quot; sind.</P>

<P>&quot;<B>Will I See You In My Dreams</B>&quot; beginnt mit ruhigem Gesang, bis schlie&szlig;lich
ein Rhythmuswechsel einsetzt. Auch hier sind die Instrumente im Hintergrund
gerade in den leisen Passagen sehr charakteristisch.</P>

<P>Mit &quot;<B>Things We Did For Love</B>&quot; endet das Album und best&auml;tigt den guten
Gesamteindruck mit gef&auml;lligen, lebensfrohen Kl&auml;ngen.</P>

<P>Fachbl&auml;tter meinen, da&szlig; Fans von Survivor diese Scheibe m&ouml;gen werden.
Nun meine ich zwar, da&szlig; da ein geh&ouml;riger Unterschied besteht, aber sie
m&uuml;ssen es ja wissen und die Richtung stimmt auf jeden Fall.</P>

<P>Handgemachte Rockmusik mit Herz!</P>

<P>&copy; 1998 Escape Music Ltd.; Vertrieb in Deutschland durch Point Music</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


