<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - MMX: Waiting For The Sun</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Waiting For The Sun&quot; / Unruly Child</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Einige Jahre nach dem in Fankreisen legend&auml;ren Deb&uuml;t (das mir allerdings
nicht bekannt ist) gibt es entgegen aller Erwartungen nun doch ein weiteres
Album von &quot;<B>Unruly Child</B>&quot;, diesmal mit neuem S&auml;nger: Kelly Hansen.</P>

<P>Das Cover ist schon einmal wirklich sch&ouml;n! Es ist Nacht. Ein kleines Kind
ist im Vordergrund zu sehen, das vor einem Weg steht, der &uuml;ber eine Br&uuml;cke
zu einer auf einer Felsinsel gelegenen mittelalterlichen Burg f&uuml;hrt.
Alles wirkt wie aus einem Traum und die Mondsichel &uuml;ber dieser Szenerie
f&uuml;gt sich als `C` in das &quot;Child&quot; des Gruppennamens ein. Auch das Booklet
ist gelungen und enth&auml;lt alle Texte.</P>

<P><B>Doch zur Musik:</B></P>

<P>&quot;<B>Heart Run Free</B>&quot; ist schnell, melodi&ouml;s und eine gute Einf&uuml;hrung in die
CD. Abgestimmter, gelungener Sound, kraftvoller Gesang des Frontmannes,
Rhythmuswechsel, stimmungsvoller Hintergrundgesang und kurze eingeflochtene
Instrumentalsequenzen lassen das Herz des Melodic Rock-Fans h&ouml;herschlagen.</P>

<P>&quot;<B>Rise Up</B>&quot; startet mit arabisch klingenden Instrumenten und entpuppt sich
ebenfalls als beschwingter, mitrei&szlig;ender Song, der gelegentlich zu den
besonderen Elementen zur&uuml;ckkehrt und sein Grundthema stark variiert.</P>

<P>Mit leisem, vorsichtigen Gesang beginnt &quot;<B>Why Should I Care</B>&quot;. Er wird
sp&auml;ter, bei Beginn des Refrains fordernder. Der Kontrast der Intensit&auml;t
zwischen Strophe und Kehrreim ist sehr markant und auch die Melodie
gef&auml;llt.</P>

<P>Bei &quot;<B>Forever</B>&quot; wird nach ruhigem Beginn der Gesang im Refrain besonders
intensiv und eindringlich. Eine perfekte Mischung aus einem `Erz&auml;hlen`
der Geschichte und Ausbreiten der Gef&uuml;hle im Kehrreim Spitzensound und
eine gute Melodie machen diesen Titel besonders h&ouml;renswert.</P>

<P>&quot;<B>Man Inside</B>&quot; ist ein Titel, der mich von der Art des Beginns, mit der
unterdr&uuml;ckten Power des Gesangs, etwas an das erste Album von Towercity
erinnert, da&szlig; an dieser Stelle auch besprochen wurde. Laut Text sollte
man manchmal auf die Stimme des Mannes in einem h&ouml;ren!</P>

<P>Hinter &quot;<B>Do You Ever Think Of Me</B>&quot; steht eine besondere Geschichte. Denn
um diesen Titel, der eine bewegte Geschichte hinter sich hat, haben sich
einige der an ihm Beteiligten gestritten, wer denn nun die Rechte an ihm
habe. Auf jeden Fall gibt es aus diesem Grunde mehrere mehr oder minder
recht &auml;hnliche Versionen, so eine von Stuart Smith, sowie eine von
Message (die mir auch bekannt ist).</P>

<P>Wie dem auch sei: Es ist ein Spitzentitel, der auch und gerade hier
wunderbar klingt. Phantastische Instrumentierung, tolle Melodie und
Gesang, der in Mark und Bein f&auml;hrt. Mitrei&szlig;end und hitverd&auml;chtig!</P>

<P>&quot;<B>Still Believe</B>&quot; vollzieht einen relativ gro&szlig;en Bruch mit den davor
befindlichen Titeln. Teilweise fast nur von Akustikgitarre begleitet
pl&auml;tschert der Gesang vor sich hin, bis der Refrain mit h&ouml;herer
Intensit&auml;t einsetzt. Nicht schlecht.</P>

<P>&quot;<B>To The Cross</B>&quot; beginn auch sehr langsam um dann teilweise schneller zu
werden. Auch nicht schlecht, aber nicht ganz den Standard der ersten
Titel erreichend, bzw. einem etwas anderen Stil entsprechend.</P>

<P>Auch bei &quot;<B>Fool Again</B>&quot; geht der Bruch mit dem ersten Teil des Albums weiter,
aber noch st&auml;rker. Teilweise etwas seltsame Kl&auml;nge, die experimenteller
wirken, zu einem gro&szlig;en Teil wurde die Stimme des S&auml;ngers leicht ver&auml;ndert
- aber vor allen Dingen ist das Potential der Melodie nicht so gro&szlig;. </P>

<P>&quot;<B>Live In The Night</B>&quot; - diesen Titel sollte man am besten aus dem Ged&auml;chtnis
streichen, denn hier handelt es sich um alles m&ouml;gliche, nur kaum um Rock
oder Pop. Country Rock`n`Roll?</P>

<P>Der letzte Titel &quot;<B>Waiting For The Sun</B>&quot; ist ein sehr ruhiger Titel, der
wieder an die gelungeneren ersten Titel ankn&uuml;pft, was ihm aber nur
teilweise gelingt. Originell hier ist auch die &quot;Radiostimme&quot; die in
einer Sequenz ert&ouml;nt. Insgesamt ein vers&ouml;hnlicher Ausklang des Albums.</P>

<P>Fazit:</P>

<P>Wie alleine die Geschichte hinter dem Titel &quot;Do You Ever Think Of Me&quot;
zeigt, handelt es sich hier teilweise um eine Zusammenstellung
unterschiedlicher Titel aus unterschiedlichen Schaffensperioden mit
unterschiedlichen Beteiligten. Das macht sich leider auch bemerkbar,
denn ein gewisser logischer Zusammenhalt innerhalb der Zusammenstellung
fehlt. Die sehr gute Qualit&auml;t der Titel wird nur &uuml;ber etwas mehr als die
H&auml;lfte des Albums durchgehalten und dann folgen einige schw&auml;chere bis
schwache Songs, die den Eindruck tr&uuml;ben.</P>

<P>Insgesamt keine Entt&auml;uschung, da einige Titel das Ganze rausrei&szlig;en. </P>

<P>(P) &amp; &copy; 1998 MTM Music M&uuml;nchen</P>
   
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903fil1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


