<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,avalon,eurasia">
<title>Avalon:Eurasia</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Avalon: Eurasia</font></center></h1></P>

<p>Einige Bands haben es, trotz konstant guter Releases, nicht so ganz einfach - dazu z&#228;hlen auch Avalon, die mit &quot;Eurasia&quot; ihr nunmehr viertes Studioalbum am Start haben, welches im Vergleich zum Vorg&#228;nger &quot;Vision Eden&quot; mit einigen Neuerungen daherkommt: Neben dem bisher bekannten melodischen Power Metal, der bisweilen mit dem einen oder anderen Progressive Splitter daherkommt,  hat die Band nun auch orientalische Einfl&#252;sse in die Musik mit einflie&#223;en lassen: Da es sich bei &quot;Eurasia&quot; um ein Album handelt, das sich lyrisch mit den Kulturen und Religionen des gr&#246;&#223;ten Kontinents der Erde, Eurasien, auseinandersetzt, wirken die orientalischen Einfl&#252;sse (M&#246;nchsges&#228;nge, indische Sitar etc.) f&#252;r die Lyrics sehr unterst&#252;tzend. Nebenbei hat die Band damit einiges an Eigenst&#228;ndigkeit gewonnen, denn den Sound, den man auf &quot;Eurasia&quot; h&#246;rt, klingt nicht nur neu, sondern baut sogar eine mitrei&#223;ende 
Atmosph&#228;re auf. Kompositorisch zeigt sich die Band um S&#228;nger Chitral Somapala auch deutlich gereift und liefert ihr bisher bestes Werk ab, was sich insbesondere an Songs wie dem mitrei&#223;enden Opener &quot;Burning Souls&quot;, dem ruhigen &quot;The Painting&quot; oder dem epischen &quot;Eternal Flame&quot; zeigt. Produziert wurde &quot;Eurasia&quot; &#252;brigens von Sascha Paeth, seines Zeichens Gitarrist bei Heavens Gate und Producer von so nahmhaften Acts wie Rhapsody, Angra oder Kamelot, und nat&#252;rlich ist das Endresultat eine &#228;u&#223;erst druckvolle Produktion, bei der ein gro&#223;er Wert auf die Klangvielfalt, bedingt durch die vielen verschiedenen orientalischen Einfl&#252;sse, gelegt wurde. &quot;Eurasia&quot; ist sicherlich kein Album f&#252;r all jene, die ein hartes und schnelles Power Metal Album erwarten und ordentlich abbangen wollen, sondern richtet sich mit seinem neuartigen Sound vielmehr an all jene Metaller, die zum einen etwas aufgeschlossener gegen&#252;ber neuen 
Einfl&#252;ssen sind und zum anderen auch den bisher gefr&#246;nten Progressive Melodic Metal von Avalon mochten. Keine Frage: &quot;Eurasia&quot; ist ein anspruchsvolles und eigenst&#228;ndiges Werk geworden, mit dem man sich intensiv besch&#228;ftigen muss, um es vollkommen zu erschlie&#223;en. Wer damit keine Probleme hat, der sollte sich &quot;Eurasia&quot; unbedingt zulegen, denn das es ein starkes Album geworden ist, daran besteht kein Zweifel. </P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd1.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
