<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,cage,astrology,unveiled">
<title>Cage: Astrology</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Cage: Astrology</font></center></h1></P>

<p>Mit &quot;Astrology&quot; folgt nun nach &quot;Unveiled&quot; (1999) das zweite Album der Gewinner der &quot;Unerh&#246;rt Aktion `99&quot; (Aktion vom Rock Hard f&#252;r Bands ohne Plattenvertrag), auf dem die Band locker beweist, keine Eintagsfliege zu sein und mal eben ein superstarkes Album aus den &#196;rmeln sch&#252;ttet, welches dem ohnehin schon gutklassigen Vorg&#228;nger in allen Bereichan &#252;berlegen ist: Das f&#228;ngt bei der kraftvolleren Produktion an, geht &#252;ber das bessere Songwriting hin zum deutlich angezogenen H&#228;rtegrad der neuen Scheibe, die mit fast 70 Minuten zwar etwas l&#228;nger ausgefallen ist, aber auf der auch niemals Langeweile aufkommt und F&#252;llmaterial schon gar nicht zu finden ist. So man&#246;vriert die Band stilistisch zwischen Combos wie Metal Church, Vicious Rumours und den alten (!) Savatage und d&#252;rfte f&#252;r Fans dieser Bands genau das richtige sein, denn Speed Granaten wie der fulminante Opener &quot;Final Solution&quot; oder &quot;The 
Edge&quot; erinnern nicht selten an eben diese genannten Bands - wohlgemerkt zu den besseren Zeiten von Metal Church und Vicious  Rumours. Neben diesen beiden hervorstechenden Highlights bietet &quot;Astrology&quot; noch zahlreiche weitere Old School Power Metal Bretter, die erfreulicherweise ohne jegliche Trendanbiederungen und moderne Elemente daherkommen und somit auf Anhieb z&#252;nden. Dazu verf&#252;gen Cage mit Sean Peck an den Vocals &#252;ber einen starken Frontman, der nicht selten an Harry Conklin (Jag Panzer) erinnert und den Songs erst den letzten Schliff mit auf den Weg gibt.  Bei &quot;Astrology&quot; handelt es sich &#252;brigens um ein &quot;Pseudo Konzeptalbum&quot; &#252;ber die zw&#246;lf Sternzeichen - Pseudo aus dem Grunde, da die Songs zum einen in sich abgeschlossen sind und zum anderen die 12 Sternzeichen in den zw&#246;lf Songs (plus Intro) nur rudim&#228;nt&#228;r vorkommen (man k&#246;nnte die Songs als kurze Stories zu den Sternzeichen betrachten). Das sollte aber wohl niemanden 
st&#246;ren, denn Cage machen trotz dieses Pseudo Konzepts einfach nur Spa&#223; und wer mal wieder ein richtig fettes Metal Album um die Ohren gepustet haben will, auf US amerikanischen Old School Power Metal steht und die letzte Halford Scheibe schon sein eigen nennt, der muss bei &quot;Astrology&quot; einfach zugreifen. So einfach ist das!</P>

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd2.jpg"></P>
<p><img src="kit.gif"></P></Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
