<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant,Metal,Metalmusik,Metalcorner,Radio,Heavy,sunrise, edenbridge,eden,Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal">
<title>Edenbridge: Sunrise In Eden</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Edenbridge: Sunrise In Eden</font></center></h1></P>

<p>Nach den Erfolgen von Nightwish war es nur eine Frage der Zeit, bis weitere Kapellen mit einem &#228;hnlichen Sound auf den Markt dr&#228;ngen. Im Falle Edenbridge, die mit &quot;Sunrise In Eden&quot; ihr Debutalbum ver&#246;ffentlichen, stimmt das allerdings nur teilweise, denn die Vergleiche mit Nightwish hinken doch sehr stark, da Edenbridge im gro&#223;en und ganzen musikalisch nicht alzu viel mit der Band aus Finnland zu tun haben. Die Vergleiche scheinen wohl eher daher zu kommen, da&#223; in beiden Bands eine S&#228;ngerin f&#252;r die Vocals sorgt, die dementsprechend hoch klingen. Das ist aber auch die einzigste Gemeinsamkeit, denn musikalisch fabrizieren Edenbridge einen recht eigenst&#228;ndigen Mix aus epischem Metal gepaart mit einigen Bombast Elementen und dem einen oder anderen kleinen progressiven Splitter. Dabei verzichtet die Band darauf, permanent auf`s Gaspedal zu treten und l&#228;sst stattdessen lieber gef&#252;hlvolle und mitrei&#223;ende Songs, die unter die Haut gehen, auf die 
Zuh&#246;rer los. Kein Wunder, da&#223; die beiden Halbballaden &quot;Forever Shine On&quot; sowie &quot;In The Rain&quot; zusammen mit dem Opener &quot;Cheyenne Spirit&quot; zu den Highlights auf &quot;Sunrise In Eden&quot; z&#228;hlen. Dazu gibt`s mit dem Titeltrack sowie dem Abschluss &quot;My Last Step Beyond&quot; noch zwei wunderbare epische Nummern, die den sehr variablen und mitrei&#223;enden Gesang von Sabine Edelsbacher erst so richtig zum Ausdruck bringen - sie klingt in der Tat fast wie Engel, denn die Stilrichtung, die Edenbridge spielen, wird vom Label als &quot;Angelic Bombast Metal&quot; bezeichnet, ist aber im Grunde nichts anderes als leicht vertr&#228;umter epischer Metal mit weiblicher S&#228;ngerin, der von der ersten Sekunde an zu &#252;berzeugen vermag und zudem recht abwechselungsreich gestaltet wurde. Langeweile kommt beim Genuss von &quot;Sunrise In Eden&quot; auf jeden Fall nicht auf und wer sich vorstellen kann, sich auch mal ruhigere T&#246;ne anzuh&#246;ren, der liegt mit diesem Debut sicherlich nicht falsch. Falsch w&#228;re es hingegen diesen Newcomer einfach so zu ignorieren und links liegen zu lassen, denn daf&#252;r steckt einfach zu viel Potential in der schon jetzt starken Band, die in Zukunft sicherlich noch von sich h&#246;ren lassen wird und locker als einer der Newcomer des Jahres durchgehen wird - f&#252;r mich ist es schon jetzt, neben Sonata Arctica, der Newcomer des Jahres. Check this out!</P>

<p>Fazit: 10 von 10 Punkten</P>

<p<Weitere Infos auf <a href="http://edenbridge.org" target="_blank">http://edenbridge.org</A></P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P></Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
