<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,nocturnal,rites,afterlife">
<title>Nocturnal Rites: Afterlife</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Nocturnal Rites: Afterlife</font></center></h1></P>

<p>Bisher hatten es die schwedischen True Metaller Nocturnal Rites alles andere als leicht: Obowohl ihre beiden letzten Alben &quot;Tales Of Mystery And Imagination&quot; bzw. &quot;The Sacred Talisman&quot; zumindest mir sehr gut gefallen haben und sicherlich einige Freunde gefunden habe d&#252;rften, stand die Presse der Band immer recht negativ gegen&#252;ber und bezeichnete die Band als billige HammerFall Kopie. Und auch wenn der Vergleich mit HammerFall fr&#252;her sicherlich stimmig war, verstehe ich nicht, warum die Band einen bisher so schweren Stand hatte, denn es gab (und gibt) weitaus schlechtere True Metal Bands. Aber 
wie auch immer: Die Vergleiche mit HammerFall d&#252;rften mit dem neuen Album &quot;Afterlife&quot; endg&#252;ltig der Vergangenheit angeh&#246;ren, denn neben einem geringf&#252;gigen stilistischem Kurswechsel gibt`s auf der neuen Scheibe auch einen neuen S&#228;nger zu h&#246;ren, der, im Gegensatz zu seinem Vorg&#228;nger, nicht in die Rubrik &quot;Michael Kiske Clone&quot; einzuordnen ist, sondern seine Vocals deutlich tiefer und aggressiver einsetzt, was hervorrragend zum Songmaterial der neuen Scheibe passt: Dies ist bei weitem nicht mehr so episch und bombastisch ausgefallen wie in der Vergangenheit und ist nun eine ganze Ecke rauher und wirkt insgesamt nicht mehr so glatt geb&#252;gelt wie bisher. Dies wird schon beim Einstieg in die neue CD mit dem kraftvollen, speedigen Ohrwurm &quot;Afterlife&quot; deutlich - es finden sich mit &quot;Wake Up Dead&quot;, &quot;The Devil`s Child&quot; und &quot;Sacrifice&quot; drei weitere hervorragende Nummern auf &quot;Afterlife&quot;, die man so von Nocturnal Rites wohl nicht erwartet h&#228;tte. Der gelungenste Track ist aus meiner Sicht aber &quot;Temple Of The Dead&quot;, der zwar, wie 
auch das restliche Songmaterial &#252;ber zahlreiche Ecken und Kanten verf&#252;gt, aber trotzdem hypereing&#228;ngig ist und eindrucksvoll beweist, da&#223; die Band den sicherlich nicht einfachen Schritt aus der HammerFall Ecke in Richtung Eigenst&#228;ndigkeit zu Recht gemacht hat. Fans der ersten beiden Alben werden sich anfangs sicherlich ein wenig umgew&#246;hnen m&#252;ssen, werden aber auch recht schnell merken, da&#223; sich die Band merklich weiterentwickelt hat und in Zukunft sicherlich noch von sich h&#246;ren lassen wird. &quot;Afterlife&quot; ist auf jeden Fall der erste Schritt in die richtige Richtung!</P>

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P></Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
