<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,steel,prophet,genesis">
<title>Steel Prophet: Genesis</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="green">Steel Prophet: Genesis</font></center></h1></P>

<p>Steel Prophet geh&#246;ren sicherlich zu jener Sorte Metal Bands, die trotz jahrelanger hochkar&#228;tiger Releases (man denke an das gnadenlos geile &quot;Into The Void&quot; Album, welches 1997 leider zeitgleich mit dem HammerFall Debut erschien und infolge dessen unterging) im Schatten der Gro&#223;en standen und erst in den letzten Monaten, auch bedingt durch einen Vertrag mit Nuclear Blast, einem gr&#246;&#223;eren Teil der Metalheads bekannt wurden. Nach dem hervorragenden &quot;Messiah&quot; Album, folgt mit &quot;Genesis&quot; nun das n&#228;chste Output der Band, wobei es sich allerdings nicht um ein neues Studioalbum, sondern um eine Art Compilation handelt. Hauptgrund f&#252;r die Ver&#246;ffentlichung von &quot;Genesis&quot; waren n&#228;mlich die st&#228;ndigen Nachfragen nach dem &quot;Inner Ascendence&quot; Demo von 1989, welches mit zu den 10 besten Demos im US Metal Sektor geh&#246;ren d&#252;rfte, heute aber nat&#252;rlich l&#228;ngst vergriffen ist oder als Bootleg zu horrenden Preisen 
gehandelt wird. Neben diesen  6 gnadenlos geilen Songs, die deutlicher als die aktuellen Releases in die (alte) Fates Warning Richtung gehen, wurden auch noch 7 Coverversionen, die zum Teil nur auf diversen Samplern erschienen sind, auf &quot;Genesis&quot; wiederver&#246;ffentlicht: Neben dem Accept Cover &quot;Fast As A Shark&quot; mussten auch noch Black Sabbath (&quot;Neon Knights&quot;), Judas Priest (&quot;Dreamer, Deceiver&quot;), Metallica (&quot;Fade To Black&quot;), Iron Maiden (&quot;Gangland&quot; und &quot;Ides Of March / Purgatory&quot;, welches einigen vielleicht schon vom `97er Album &quot;Into The Void&quot; bekannt sein d&#252;rfte) und die Simple Minds (&quot;Don`t You Forget About Me&quot;) dran glauben. Die Coverversionen unterscheiden sich zwar nicht wesentlich vom Original, k&#246;nnen aber vielleicht, mit Ausnahme des Simple Minds Covers, gerade deswegen &#252;berzeugen - zumal es sich nicht um die bekanntesten St&#252;cke von Acts wie Iron Maiden, Metallica oder Judas Priest handelt. Somit kann man &quot;Genesis&quot;, welches &#252;brigens auf 10.000 St&#252;ck limitiert ist, ein hohes Niveau atttestieren, welches insbesondere f&#252;r Leute interessant sein d&#252;rfte, die die Band erst in den letzten Monaten kennengelernt haben - diese k&#246;nnen das Teil ebenso wie alle &#228;lteren Steel Prophet Fans, die nicht im Besitz des &quot;Inner Ascendence&quot; Demos sind, bedenkenlos abgreifen, denn es lohnt sich wirklich.</P>

<p>Fazit: 10 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd7.jpg"></P>
<p><img src="kit.gif"></P></Center>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
