<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,duke,gallows,pole,edguy,konzert,at,vance">
<title>Konzertbericht: Edguy & At Vance & Duke & Gallows Pole</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="yellow">Konzertbericht: Edguy, At Vance, Duke &amp; Gallows Pole</Font></center></h1></P>

<p>Die Matrix in Bochum mausert sich immer mehr zu einer Metal Hochburg, denn seit der Umbenennung sowie diversen Umbauten wird dort erfreulicherweise stark auf Metal gestezt, was sich auch in diversen Live Gigs zu sehr humanen Preisen bemerkbar macht. F&#252;r dieses Package musste man z.B. nur 25 DM hinbl&#228;ttern, was f&#252;r die einzigste Clubshow von Edguy in diesem Jahr wohl auch in Ordnung geht - allerdings muss ich zugeben, da&#223; ich die Zeche in Bochum als Location lieber mag; sei es nun wegen der gr&#246;&#223;eren Halle oder wegen des besseren Sounds, denn letzterer ist in der Matrix nicht immer das gelbe vom Ei...</P>

<p>Er&#246;ffnet wurde der (kurzweilige) Abend von Gallows Pole, die ich bisher nur vom h&#246;rensagen kannte und die mit ihrem klassischen Metal, der einige Anleihen an Iron Maiden enthielt, zumindest bei mir einen guten Eindruck hinterlie&#223;en. Das musikalische Material wirkte auf jeden Fall recht ausgereift und mit dem abschlie&#223;enden Iron Maiden Cover &quot;Remember Tomorrow&quot; konnten die Jungs bei mir nochmals Pluspunkte sammeln...</P>

<p>Was danach kam, war einer der witzigsten Gigs &#252;berhaupt, wobei ich nicht wei&#223;, ob Duke das beabsichtigt haben: Zun&#228;chst einmal sei festzuhalten, da&#223; die Band True Metal mit deutlichen Paralellen zu HammerFall spielt, was im Grunde auch kein Problem ist und da zudem musikalisch alles in bester Ordnung war (will sagen: Die mir ebenfalls unbekannten Songs knallten ordentlich und sobald diese Band eine CD drau&#223;en hat, werde ich sie mir sicherlich zulegen), will ich mich daran auch gar nicht weiter hochziehen. Das erheiternde Element an dem Gig war der S&#228;nger eben dieser Band, der mit reichlich beknackten Ansagen, einem true metalisch parodierenden Kleidungsstil (Nietenarmb&#228;nder meets Muskelshirt) sowie posigem Auftreten f&#252;r jede Menge Lacher im
Publikum sorgte und auch ich habe mich durch das Set hinweg total &#252;ber den S&#228;nger kaputt gelacht - das hier zu beschreiben ist fast unm&#246;glich, aber wer dabei gewesen ist, wird schon wissen, was ich meine. Na ja, das der gute sich offenbar auch nicht so ernst nahm, verleiht der Band sympathische Grundz&#252;ge und auf die entsprechende CD bin ich schon jetzt gespannt. Cooler und vor allem ungew&#246;hnlicher Gig...</P>

<p>Deutlich normaler ging es dann bei den Melodic Metallern At Vance zu, die f&#252;r mich zu einer der wenigen Bands geh&#246;ren, die den Durchbruch verdient h&#228;tten. Auch Live boten die Jungs eine amtliche Leistung, aber anfangs wollte der Funke beim Publikum nicht wirklich &#252;berspringen, auch wenn Songs wie &quot;Heart Of Steel&quot;, &quot;King Of Your Dreams&quot;, &quot;The Brave And The Strong&quot; (vom zweiten Album) sowie &quot;One For All, All For One&quot;, &quot;No Escape&quot;, &quot;Flyingh High&quot; sowie &quot;Power And Glory&quot; (vom Debutalbum) Ohrw&#252;rmer par excellence darstellen und die Band mit &quot;Princess Of The Night&quot; eine wirklich unter die Haut gehende Ballade pr&#228;sentierte. Mit der Zeit wurden die Fans mit der Band zwar auch warm, aber ein enthusiastisches Publikum ist dann doch etwas anderes. Schade, denn an At Vance lag es nun wirklich nicht.</P>

<p>Und dann enternten Edguy endlich die B&#252;hne und  die Stimmung erreichte nun endlich ein hohes Niveau, auch wenn es diverse Pappnasen nicht lassen konnte, im Mittelbereich zu pogen -hey mann, sind wir hier auf einem Metalkonzert oder auf irgendeinem Kommerzverseuchten &quot;Allternative Festival&quot;? Tut mir leid, aber mir geht dieses komische Rumgeh&#252;pfe total auf den Senkel  und auf Metal Konzerten sollte so ewtas wirklich verboten geh&#246;ren. Nun aber zur&#252;ck zu Edguy, die ein langen Set mit s&#228;mtlichen Highlights ihrer bisherigen 4 CD`s hinlegten und dabei auch die eine oder andere &#220;berraschung dabei hatten: Songs wie &quot;Scarlet Rose&quot;, &quot;Babylon&quot;, &quot;Headless Game&quot;, &quot;Key To My Fate&quot;, &quot;Vain Glory Opera&quot; oder auch &quot;Misguidung Your Life&quot; hatte man von der Band irgendwie erwartet - aber das auch &quot;The Unbelivier&quot; (von &quot;Theater Of Salvation&quot;) sowie &quot;Heart Of Twilight&quot; vom `97er Album &quot;Kingdom Of Madness&quot; (!!) auf die Fans losgelassen werden w&#252;rden, h&#228;tte wohl kaum jemand geahnt. Die Band war auch in bester Spiellaune und auch S&#228;nger und Spa&#223;kanone Tobias Sammet sorgte nat&#252;rlich mit seinen Ansagen (&quot;Ihr wollt den Kuhflecken Songs? Den haben wir nicht, aber hier ist &quot;Headless Game&quot;!) f&#252;r einiges Gl&#228;chter - da sehen wir einfach mal &#252;ber seine zweifelhaften modischen Vorstellungen (Kuhflecken Jacke, die fast so stylisch wie das Muskelhemd vom Duke S&#228;nger war) sowie der einen oder anderen kleinen Umgereimheit beim Singen (die zweite Strophe von &quot;Until We Rise Again&quot; sollte sich von der ersten unterscheiden, Tobi!) hinweg. Die Band gab auf jeden Fall Vollgas und es wurde ein richtig guter Gig einer der Bands der Zukunft. Schade nur, da&#223; es diesesmal kein &quot;How Many Miles&quot; sowie das Helloween Cover &quot;Dr.Stein&quot; gab, was die Band ansonsten Live immer wieder mal entstaubte.</P>


<p>Unter dem Strich war es ein sehr gelungener Abend in der Matrix, der nur durch die lokalen Gegebenheiten (kleine B&#252;hne, schwacher Sound etc.) ein wenig geschm&#228;hlert wurde. Aber mal ehrlich: In Zeiten, bei denen Bands wie AC / DC 90 DM und Iron Maiden 66 DM f&#252;r ein Ticket verlangen, fragt man sich ohnehin, ob das Geld nicht besser in die eine oder andere Clubshow investiert w&#228;re. Ich jedenfalls w&#252;rde f&#252;r 90 DM lieber 3 mal die Matrix besuchen...</P>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
