<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" CONTENT="Metal Corner">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais,melodic,power,trash,rock,hard,heavy,herne,bürgerfunk,lokal,judas,priest,oldie,painkiller">
<title>Oldie Review: Judas Priest`s Painkiller</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="gray">Oldie Review: Judas Priest`s Painkiller</font></center></h1></P>

<p>Neben Iron Maiden geh&#246;ren Judas Priest sicherlich zu den wichtigsten Heavy Metal Bands &#252;berhaupt und d&#252;rften wohl Lesern dieser Zeilen hinreichend bekannt sein, auch wenn der letzte Opus &quot;Jugulator&quot; mit dem neuen S&#228;nger Ripper Owens aufgrund moderner Ausrichtung baden ging. Eine CD dieser lebenden Legende rauszusuchen ist zwar alles andere als einfach und indem ich das `90 Album &quot;Painkiller&quot; w&#228;hle, d&#252;rfte ich die Wahl zwar auch nicht 100%ig richtig getroffen haben (&quot;British Steel&quot; w&#228;re wohl angebrachter gewesen), aber es geh&#246;rt nunmal zu einem meiner Lieblingsalbum im Metal Bereich &#252;berhaupt und sollte all jenen, die es tats&#228;chlich noch nicht kennen, hier einmal n&#228;her gebracht werden.</P>

<p>&quot;Painkiller&quot; ist nach einer schwachen Judas Priest Phase, die Alben wie &quot;Turbo&quot; hervorbrachte, ein Meisterwerk par excellence und stellt den schon guten Vorg&#228;nger &quot;Ram It Down&quot; ohne Probleme in den Schatten, was H&#228;rtegrad und Songwriting angeht: So ist &quot;Painkiller&quot; ein verdammt hartes Album geworden, auf dem Metal Gott Rob Halford, &#252;brigens hier zum letzten mal bei Judas Priest an den Vocals t&#228;tig, zur absoluten H&#246;chstform aufl&#228;uft und Songs wie den alles wegblasenden Opener &quot;Painkiller&quot; oder die Metal Hymne &quot;Metal Meltdown&quot; mit seiner aussergew&#246;hnlichen Stimme zu Perlen im Metal Bereich avancieren l&#228;sst. Keine Frage, da&#223; auch die weiteren St&#252;cke auf dieser CD ihresgleichen suchen und &quot;Painkiller&quot; zu einem einmaligen Album machen, das Judas Priest in absoluter H&#246;chstform und zudem unvergleichbar heavy zeigt - Kompromisse werden auf dieser Scheibe auf jeden Fall nicht gemacht und die kommerzielle Seite, die auf Alben wie &quot;Turbo&quot; mehr als deutlich zu Tage trat, wird hier komplett in den Hintergrund ger&#252;ckt. Hier regieren schnelle, harte und eing&#228;ngige Songs im klassischen Heavy Metal Gewand.</P> 

<p>&quot;Painkiller&quot; geh&#246;rt in jede Metal Sammlung und sollte einem Gro&#223;teil der Leser eigentlich bekannt sein - wer &quot;Painkiller&quot; tats&#228;chlich nicht kennt, hat schlicht und einfach eines der zeitlosesten Alben der `90er Jahre verpasst und zugleich ein Highlight im Metal Bereich &#252;berhaupt nicht zur Kenntniss genommen bzw. es bisher nicht gekannt. Also: Wer diese CD noch nicht sein eigen nennt, rennt jetzt schnell zum CD H&#228;ndler seines Vertrauens und greift diese Scheibe ohne zu z&#246;gern ab und wird danach in einer guten dreiviertel Stunde erleben, was wirklicher Heavy Metal, fern ab von all dem ganzen Pseudo Metal Kram wie Korn, Limp Bizkit und dem ganzen &quot;New Metal&quot; Zeugs, ist!</P> 

<p>Fazit: 10 von 10 Punkten </P>
<center>
<p><img src="kit.gif"></P>
<p><img src="oldie.jpg"></P>
<p><img src="kit.gif"></P></Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
