<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Rugmark-wer</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>

<table width=100% border=0 cellpadding=8><tr><td>
<div align="center"><center>

<table border="0" cellspacing="0" width="580" background="onl_rugmark0.jpg"
bgcolor="#d04040" height="120">
<tr>
<td align="center" width="100%" valign="middle"><img src="onl_rugmarka.gif"
alt="logo.gif (3670 byte)" height="101" width="100" align="middle"><img
src="onl_rugmarkc.gif" width="58" height="51" align="middle"><img
src="onl_rugmarkb.gif" alt="dslogan.gif (6027 byte)" height="95" width="260"
align="middle"></td>
</tr>
</table>
</center></div>
<p>&nbsp;</p>
<div align="center"><center>

<table border="0" cellspacing="1" width="580">
<tr>
<td><h2 align="left"></a><font face="Courier">Wer ist RUGMARK?</font></h2>
<p><br> <strong>Unabh&auml;ngige Stiftungen in den
Kn&uuml;pfl&auml;ndern</strong><br> Die RUGMARK-Organisationen in den
Kn&uuml;pfl&auml;ndern sind wirtschaftlich wie politisch unabh&auml;ngigen
Foundations (= Stiftungen) nach dem jeweiligen Landesrecht. Vor allem sind
sie nicht an die Interessen des Teppichhandels gebunden. Getragen werden
die Foundations von Nichtregierungsorganisationen und integeren Personen
des &ouml;ffentlichen Lebens. Deren erkl&auml;rtes gemeinsames Ziel ist es,
wirksame Ma&szlig;nahmen gegen die illegale Kinderarbeit zu ergreifen. Als
international t&auml;tige Organisation geh&ouml;rt auch das Kinderhilfswerk
der Vereinten Nationen UNICEF&nbsp; zu den Tr&auml;gern.</p>

<p>Die RUGMARK Foundation India besteht seit 1995. Pr&auml;sidentin ist die
fr&uuml;here indische Umweltministerin, Frau Maneka Ghandi. Im Dezember
1996 hat die RUGMARK Foundation Nepal ihre Arbeit aufgenommen. Seit August
1998 gibt es RUGMARK auch in Pakistan. Dort m&uuml;ssen die Strukturen
f&uuml;r die Kontrolle der Produktion und die Organisation von
Sozialprogrammen jedoch erst noch geschaffen werden.</p>

<p><strong>Kampagnenarbeit in den Absatzl&auml;ndern</strong><br>
RUGMARK-Initiativen in den Absatzl&auml;ndern gibt es bislang in
Deutschland, den Niederlanden, Luxemburg, Gro&szlig;britannien, Kanada und
den USA. Ihre Aufgabe ist es, die K&auml;uferinnen und K&auml;ufer
&uuml;ber die Notwendigkeit eines sozialvertr&auml;glichen Teppichhandels
zu informieren und m&ouml;glichst viele Handelsfirmen davon zu
&uuml;berzeugen, verst&auml;rkt Teppiche mit dem RUGMARK-Siegel
anzubieten.</p>

<p>In Deutschland wird RUGMARK von renommierten Hilfswerken wie Brot
f&uuml;r die Welt, Misereor, terre des hommes und UNICEF getragen. Sie
finanzieren dar&uuml;ber hinaus auch einen Fonds f&uuml;r Sozialprogramme
in den Kn&uuml;pfl&auml;ndern. Auch das Bundesministerium f&uuml;r
wirtschaftliche Zusammenarbeit und Entwicklung (BMZ) unterst&uuml;tzt
RUGMARK, u.a. durch eine Anschubfinanzierung f&uuml;r die Arbeit des
Deutschlandb&uuml;ros. Aber auch alle Parteien, zahlreiche Personen des
&ouml;ffentlichen Lebens sowie das Europ&auml;ische Parlament stehen hinter
der RUGMARK-Idee.</p></td>
</tr>
<tr>
<td align=center><a href="onl_rugmark2.html">
<img src="onl_rugmark1.gif" width="41" height="28" border=0></a>
<a href="onl_rugmark4.html">
<img src="onl_rugmark3.gif" width="41" height="28" border=0></a>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
<a href="onl_rugmark.html"><img src="onl_rugmark0.gif" width="60" height="63" border=0></a>
<font face="Courier"><strong><a href="onl_rugmark.html">Startseite</strong></font></a></td>
</tr>
</table>
</center></div>
</tr></table>
</center></div>
</body>
</html>
