<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Erkl&auml;rung von Eyetech zu den Projekten AmigaOS 4.0 und AmigaOne

Die folgende Pressemeldung wurde von Christoph Gutjahr &lt;C.Gutjahr@gmx.de&gt;
f&uuml;r unseren Partner http://www.amiga-news.de ins Deutsche &uuml;bersetzt und uns
freundlicherweise f&uuml;r eine Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt:


»Zur sofortigen Ver&ouml;ffentlichung

Es ist beinahe November und der AmigaOne wird auf der WoA-SE in London,
England am 3. November 2001 erstmals verkauft werden - richtig? Nein, es
tut uns leid, aber der AmigaOne wird nicht vor Neujahr auf den Markt
kommen. Ist das das ultimative Desaster, das jetzt &uuml;ber die Amiga-Gemeinde
hereinbricht? Ist der AmigaOne ein weiterer Boxer? Ist dies das endg&uuml;ltige
Ende des Amigas, so wie wir ihn kennen? Sicher nicht.

Bevor ihr jetzt losrennt und erkl&auml;rt, dass Nostradamus die ganze Zeit recht
hatte mit seinen Prophezeiungen &uuml;ber den Amiga, nehmt euch bitte ein paar
Minuten Zeit, und lest die Hintergrundgeschichte &uuml;ber das, was wirklich
hinter den Kulissen passiert ist bez&uuml;glich der AmigaOne und OS4-Entwicklung
und warum beides - trotz aller Widrigkeiten - bald Wirklichkeit werden
wird.

Amiga Inc. &uuml;bernahmen die Amiga-Rechte im Dezember 1999, auf dem H&ouml;hepunkt
des dot.com-Booms - und Amiga Inc., obwohl selbst keine dot.com-Firma,
waren sehr wohl ein Teil des Neuen Marktes. Sie hatten keine
Schwierigkeiten, erste Kapitalgeber zu finden. Aber als sie ca. 8 Monate
sp&auml;ter neues Kapital ben&ouml;tigten - wie bereits in ihrem urspr&uuml;nglichen
Gesch&auml;ftsplan vorgesehen - waren IT-Firmen &auml;hnlich angesagt wie britisches
Rindfleisch. Selbst mit den vern&uuml;nftigsten und konservativen
Gesch&auml;ftspl&auml;nen von bew&auml;hrten Firmen in der IT-Branche war es nicht
m&ouml;glich, Kapital in relevanten Gr&ouml;&szlig;enordnungen aufzutreiben. Dar&uuml;ber hinaus
waren die Risikokapitalgeber nicht nur weiteren Investitionen abgeneigt,
oft mussten sie auch um ihr eigenes &Uuml;berleben k&auml;mpfen (und das schlie&szlig;t
einen von Amigas und TAOs Hauptgeldgebern ein). Und seitdem sind die
Zust&auml;nde nur noch schlimmer geworden.

Es muss Amiga Inc. hoch angerechnet werden, dass sie es nicht nur geschafft
haben, die letzten 14 Monate von nicht viel mehr, als frischer Luft zu
leben, sondern auch in der Lage waren, Etwas - wenn auch nicht alles - von
dem umzusetzen, was sie sich bez&uuml;glich neuer Technologien und wichtiger
Vertr&auml;ge vorgenommen hatten. Bemerkenswerterweise haben sie es sogar
geschafft, einige wichtige neue Investoren an Land zu ziehen - Amigas
Zukunft sieht jetzt sehr positiv aus. Aber um mit so geringen finanziellen
Mitteln zu &uuml;berleben, musste irgend etwas eingeschr&auml;nkt werden - im
heutigen finanziellen Klima sind potentielle Investoren nur an sehr
schlanken Firmen interessiert, die mindestens zwanzig Mal nachdenken,
bevor sie irgendeinen Aufwand betreiben. Dieses Etwas war OS 4.0. Und OS
4.0 ist von existentieller Bedeutung f&uuml;r den AmigaOne.

Im Gegensatz zu Amiga ist Eyetech eine privat finanzierte Firma. Das
bedeutet unsere Ressourcen bestehen aus den in der Vergangenheit erzielten
Profiten, und wir sind nicht darauf angewiesen, Geld von
Risikokapitalgebern oder den Aktienm&auml;rkten aufzutreiben. Das bedeutet
zwar, dass wir Entscheidungen sehr schnell treffen k&ouml;nnen, ohne dass
Investoren jede Facette unseres Gesch&auml;ftes genaustens &uuml;berpr&uuml;fen. Der
Nachteil ist aber, dass ein einziger gro&szlig;er Fehler sich f&uuml;r unsere Firma
und unsere Angestellten desastr&ouml;s auswirken kann. Unsere Investition in
die Entwicklung des AmigaOne war ein kalkuliertes Risiko, aber eines, von
dem wir &uuml;berzeugt waren, dass es uns mittelfristig ad&auml;quate Eink&uuml;nfte
bringen w&uuml;rde. Es war allerdings abh&auml;ngig von zwei Faktoren, die sich
beide mehr oder weniger au&szlig;erhalb unserer Kontrolle befinden. Der erste
war Escenas F&auml;higkeit, die ma&szlig;geschneiderten Chips f&uuml;r den AmigaOne zu
entwickeln. Der andere war Amiga Inc.'s F&auml;higkeit, OS4.0 zu liefern sobald
die Hardware sich in einem marktreifen Stadium befindet.

Es ist wahr, dass wir anfangs einige Schwierigkeiten mit der
Hardwareentwicklung hatten. Dabei ging es haupts&auml;chlich um das
Platinenlayout des AmigaOne, das zwar streng genommen nicht zu Escenas
Spezialgebiet geh&ouml;rt, das aber so sehr mit dem Chipdesign zusammenhing,
dass es sowohl kontraproduktiv als auch teuer gewesen w&auml;re, dies einem
weiteren Entwickler zu &uuml;bergeben. Und wenn wir bereits beim Thema sind,
wieso haben wir beschlossen, dass ein selbst entwickelter Chipsatz
notwendig ist? Daf&uuml;r gab es, und gibt es immer noch, drei gewichtige
Gr&uuml;nde.

   o Es waren keine passenden PPC North/Southbridges in kleinen
     Kontingenten (weniger als 100.000 Einheiten) verf&uuml;gbar, als wir das
     Projekt starteten.
   o Solche Chips&auml;tze, selbst wenn sie verf&uuml;gbar sind, haben einen
     Produktionszyklus von einigen Monaten, bevor sie abgel&ouml;st werden. Das
     h&auml;tte jedes Design mit kleinen St&uuml;ckzahlen, das auf solchen Chips
     basiert h&auml;tte, bereits zu veralteter Technologie gemacht, bevor es
     &uuml;berhaupt fertiggestellt gewesen w&auml;re.
   o Ohne eine komplette &Uuml;berarbeitung des AmigaOS - statt der
     schrittweisen Portierung die Bestandteil der OS4.x-Strategie ist -
     ist die M&ouml;glichkeit, den klassischen Amiga-Chipsatz anzusprechen
     essentiell, und kein kommerzieller Chipsatz h&auml;tte diese M&ouml;glichkeit
     geboten.

Die Implementierung dieser Dinge war ebenfalls sehr komplex, aber sie
basiert auf bereits getesteten Modulen, die den Kern von Escenas Erfahrung
bilden.

Wie auch immer, im Mai dieses Jahres wurde deutlich, dass Amiga Inc. es
sich nicht leisten konnte, seinen Vertragspartnern die vorgesehenen - und
zugesicherten - Betr&auml;ge f&uuml;r die Entwicklung von OS4 zu bezahlen. Es gab
immer noch gro&szlig;e Hoffnungen, dass jeden Moment Kapital hereinkommen muss,
aber Risikokapitalgeber machen keinen schnellen oder leichtfertigen
Investitionen angesichts des Zusammenbruchs des neuen Marktes.

Ohne einen garantierten Ver&ouml;ffentlichungstermin (f&uuml;r OS4.0, Anm. d. &Uuml;bers.)
haben wir, Eyetech, die Entwicklung des AmigaOne vor&uuml;bergehend gestoppt, um
die Wiederaufnahme der OS4-Entwicklung abzuwarten. Escena haben in der
Zwischenzeit einige "mission-critical" (und weitaus besser bezahlte)
Auftragsarbeiten f&uuml;r international bekannte "Blue Chip"-Firmen &uuml;bernommen.

Seitdem haben wir mit Amiga Inc. zusammen hart gearbeitet, um nach einer
praktikablen L&ouml;sung f&uuml;r die Entwicklung von OS4 zu suchen. Nach vielen
Monaten und mehr als eine paar Sackgassen haben wir endlich eine
Vereinbarung zwischen uns, Amiga Inc. und Hyperion ausgearbeitet. Diese
erm&ouml;glicht die sofortige Wiederaufnahme der Entwicklung von OS4 - und zwar
ohne initiale Kosten f&uuml;r Amiga Inc. - w&auml;hrend sie Amiga Inc. erlaubt, auf
der Arbeit, die f&uuml;r OS4.0 geleistet wird, aufzusetzen und OS 4.2 und
sp&auml;tere Versionen zu entwickeln. Au&szlig;erdem wird ein Pfad f&uuml;r den AmigaOne
garantiert, der die Fertigstellung der Entwicklung und schlussendlich die
Produktion erlaubt. Die Vereinbarung garantiert auch eine weitergehende
Entwicklung des Betriebssystems f&uuml;r den AmigaOne, nach OS4.0. Und als ein
Teil der Vereinbarung wird Hyperion OS 4.0 auch f&uuml;r die CyberstomPPC-
Beschleunigerkarten f&uuml;r den A3/4000 anbieten, das ist wohl die beste
Nachricht des Jahres f&uuml;r alle Eigent&uuml;mer von solchen "Big Box"-Amigas.

Nat&uuml;rlich entwickeln Hyperion OS 4.0 nicht alleine, stattdessen f&uuml;hren sie
ein Konsortium von bekannten und respektierten Amiga-Entwicklern an, zu
dem Haage & Partner, das Picasso96 Team, Matay, Olaf Barthel und viele
andere geh&ouml;ren.

Aber die beste Nachricht von allen ist, dass diese Vereinbarung - die
endlich und unwiderruflich den zuk&uuml;nftigen Pfad f&uuml;r alle Classic-Amiga-
Besitzer festlegen wird - an diesem Wochenende auf der WoA-SE am 3.
November in London unterzeichnet werden wird. Es hat viele Stunden der
Verhandlungen gebraucht, aber jetzt ist alles festgelegt, die letzte gro&szlig;e
H&uuml;rde vor dem Next-Generation-Amiga wurde &uuml;bersprungen. Alle Parteien
arbeiten jetzt ein weiteres Mal hart, um sicherzustellen, dass OS4.0 und
der AmigaOne zusammen Anfang des n&auml;chsten Jahres ver&ouml;ffentlicht werden
k&ouml;nnen.

Danke f&uuml;r Ihre Geduld und Ihr Verst&auml;ndnis

Alan M Redhouse
Managing Director, Eyetech Group Ltd.«


Das englischsprachige Original der Eyetech-Erkl&auml;rung ist auf
http://www.eyetech.co.uk/addbar.php?Address=/NEWS/AMIGA001.HTM zu finden.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
