<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Review: Quake Mission Pack »Scourge of Armagon«

So, ihr dachtet, da&szlig; ihr alle G&uuml;nstlinge von Quake beseitigt habt, oder
nicht? Nun, zum Gl&uuml;c (f&uuml;r alle Spielefans) ist dem nicht so. der erste
Mission Pack: Scourge of Armagon (Die Gei&szlig;el des Armagon) zeigt uns, da&szlig;
das Ausl&ouml;schen von Shub-Niggurath erst der Anfang war. Ein weiteres Portal
wurde gefunden und der Held unseres Vertrauens mu&szlig; einmal mehr losziehen um
die Zukunft zu retten. Es stellt sich heraus, da&szlig; Armagon, Quakes General
noch immer nicht gefa&szlig;t und bereit zum Angriff ist.

Nun, soweit die Hintergrundstory. Hoffen wir, da&szlig; das Spiel sich als etwas
origineller erweist. Dieses Mission Pack bekommt ihr relativ g&uuml;nstig auf
Flohm&auml;rkten oder in Internet Versteigerungen.
Die Installation geht einfach. Man mu&szlig; nur den Ordner Hypnotic von der CD
in die Quake-Schublade kopieren:

copy cd0:hypnotic spiele:quark

Zum Start w&auml;hlt man dann sein bevorzugtes Executable und erg&auml;nzt es
dementsprechend

glquarkWOS -game hypnotic -width 640

Scourge of Armagon ist der erste von id-Software lizenzierte Mission Pack.
Verantwortlich hierf&uuml;r zeigen sich Hypnotic. Und die haben ganze Arbeit
geleistet. Dieser Pack setzt nicht nur den Quake-Mythos konsequent fort
sondern ist so professionell gemacht, da&szlig; ich zugeben mu&szlig;, da&szlig; er besser
als Quake selbst ist. VIEL BESSER!

Das Leveldesign ist nicht anders als genial zu nennen, absolut
atemberaubend. Riesige, unmenschliche Level, die wirklich grandios
aussehen. Man f&uuml;hlt sich wirklich in das Spiel hineinversetzt. Aber nicht
nur der Aufbau ist super, das Zusammenspiel mit der Umgebung ist
unglaublich. Als Beispiel nenne ich hier mal den "Lost Mine"-Level:
Zusammenklappbare Bauten, fliegende Bef&ouml;rderung, gigantische L&uuml;fter,
riesige elektrische Generatoren und die drehende S&auml;ge des Todes sind nur
ein paar der Ger&auml;tschaften welche es zu &uuml;berwinden gilt und die einen von
Panik gel&auml;utert zur&uuml;cklassen.

Erw&auml;hnte ich bereits, wie fantastisch die Level sind?

Aber nicht nur am Leveldesign wurde ordentlich gefeilt: Es gibt zwei neue
Gegner, drei neue Waffen, drei zus&auml;tzliche PowerUps und einen neuen
Endgegner. Die Feinde sind zum einen die Gremlins, kleine, schnelle
Monster, die in Schw&auml;rmen angreifen, sich Waffen stehlen und einen
Festschmaus aus den gefallenen Soldaten machen (nicht erschrecken beim
ersten Mal) und zum anderen mit Nailguns bewaffnete, schwer gepanzerte
Skorpione, die Centroids (aufgepasst: Der Schwanz hat es ebenso in sich).
An neuen Waffen h&auml;lt der Missionpack so coole Ger&auml;tschaften wie einen
Minenleger, den Hammer des Thor und eine Laserkanone bereit. Der Minenleger
bringt vor allem im Mehrspielermodus viel. Ich hingegen bin froh, da&szlig;
endlich dieselbe Kanone wie die Quake-Soldaten besitze. Der Megahit
allerdings ist der Hammer des Thor: Mjolmir. Dieser drischt nicht nur
ordentlich auf die B&ouml;sewichte ein, wenn man damit auf den Boden schl&auml;gt
spr&uuml;ht er elektrische Blitze, welche alles und jeden herum r&ouml;stet.
Ungl&uuml;cklicherweise kann man ihn nicht schmei&szlig;en. Das w&auml;re ein Spa&szlig;!
Als PowerUps gibt es: Das "Horn of Conjuring" welches eine Kreatur
herbeiruft die dir im Notfall hilft; der "Emphaty Shild" teilt deinen
Schaden zwischen dir und dem Angreifer auf und eine besonderer Schwimmanzug
erlaubt dir nicht nur unter Wasser zu atmen sondern auch schneller zu
schwimmen und elektrischen Angriffen mit nicht mehr als einem L&auml;cheln zu
begegnen.

Screenshot:
<IMG SRC="../extra/armagon1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/armagon2.jpg" ALT="Screenshot">

Zum Schlu&szlig; k&auml;mpfst du gegen Armagon pers&ouml;nlich. Diese Bedrohung aus halb
Fleisch, halb Maschine ist eine Aufgabe f&uuml;r sich. Genauso wie dieser
Mission Pack an sich. Es stimmt einfach alles: Die Level sind etwas heller,
sogar die paar d&uuml;steren Level die es gibt wirken alles in allem besser. Der
CD-Soundtrack steuert wieder ein paar neue Killertracks bei. Das Gameplay
ist typisch Quake, aber die Erweiterungen und Ver&auml;nderungen bringen
wesentlich mehr Spa&szlig;. Es gibt nat&uuml;rlich auch diesmal wieder einige
unheimliche Todesfallen, die Blitzfalle und treibende Stachelminen - man
mu&szlig; genauso schnell handeln wie denken. &Uuml;berhaupt ist der
Schwierigkeitsgrad nicht von Pappe. Aber im Endeffekt erf&uuml;llt dieses AddOn
die Erwartungen bei weitem. Es gibt zwei Einschr&auml;nkungen: zum einen
erfordert dieses wundersch&ouml;ne Leveldesign einiges an Rechenpower (mit 68k-
Quark braucht ihr gar nicht erst anzufangen) zum anderen sind 15 Level
(Episoden) und ein Deathmatch-Level nicht allzuviel. Und dann gibt es auch
noch nur einen Endgegner. Was waren das f&uuml;r Tage mit einem Big Boss nach
jeder Episode. Vielleicht m&ouml;chte ich aber auch nur nicht, da&szlig; dies alles
endet.
Dieses Spiel ist so, wie Quake h&auml;tte sein sollen.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
