<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. PD-Spieletests

-Entity
-Imperium Terranum II
-Diamond Challenge 1.31


------------
---Entity---
------------

Bud Lightning, Held einer Adventure-Reihe, die im AMIGA-aktuell-Spieleteil
bislang nie Beachtung fand, st&uuml;rzt sich in sein drittes Abenteuer.
Diesmal muss er einen mysteri&ouml;sen Mordfall auf dem Weltraumschiff "Du Pont"
des Unternehmers Jacques Du Pont kl&auml;ren. Keine leichte Sache, gestaltet
sich dieses grafisch anspruchsvolle Spiel doch &auml;hnlich schwer wie zum
Beispiel Monkey Island oder Day of the Tentacle: Die meisten R&auml;tsel l&ouml;st
man nur durch puren Zufall oder durch systematisches Ausprobieren. Doch im
Gegensatz zu den beiden genannten Vorbildern sind die Dialoge und das
Geschehen nicht so interessant und lustig. Dies liegt wohl auch an dem
teils mangelnden (laut Anleitung ist er gar nicht vorhanden) Sound.
Hergestellt wurde das Game mit dem allseits bekannten GRAC System, so dass
sich jeder, der schon mal ein Spiel in der Art gespielt hat, schnell zurecht
finden wird.

Sehr lieb gedacht, beim Spiel jedoch gibt es schwere spieltechnische M&auml;ngel
zu beklagen. N&auml;chstes Mal vielleicht ein wenig einsteigerfreundlich...

Name: Entity
Autor: DAS Software

Grafik: 9 von 10 Punkten
Sound: 4 von 10 Punkten
Steuerung: 7 von 10 Punkten
Spielspa&szlig;: 6 von 10 Punkten

Gesamteindruck des Redakteurs: 6 von 10 Punkten


--------------------------
---Imperium Terranum II---
--------------------------

Imperium Terranum kann man als direkten Nachfolger von "Civilization"
ansehen, es kn&uuml;pft genau dort an, wo Civilization aufh&ouml;rt: Bei der
Besiedelung anderer Planeten. Es ist also so etwas wie ein inoffizieller
Nachfolger, was man von den sp&auml;ter erschienenen PC-Teilen nicht sagen kann.
Die sind nur billige Abklatsche.
Jedoch hat sich der Programmierer ein wenig zu weit aus dem Fenster gelehnt
bei seinem Nachfolger, denn der ist an Komplexit&auml;t und
Bedienungsunfreundlichkeit kaum zu &uuml;bertreffen - da hilft auch das lustig
geschriebene Guide nichts. Die Aufgabe, mit Raumschiffen und Siedlern
andere Planeten, und sp&auml;ter auch andere Sonnensysteme f&uuml;r den Menschen zu
entdecken, gestaltet sich als schwierig insofern dass man zum Beispiel beim
fliegen durch das System die Umlaufbahnen der Planeten mit berechnen muss.
Auch wenn man dank des rundenbasierenden Systems genug Bedenkzeit hat, mit
einem langsamen Raumschiff holt man die Erde nie wieder ein.
Von solchen "&Uuml;berkomplexit&auml;ten" abgesehen ist das Spiel aber sehr gelungen,
man sollte vorher halt ein wenig Zeit mit der Anleitung verbringen.
Au&szlig;erdem w&auml;re ein Flickerfixer brauchbar, die vielen Texte gehen wegen des
HiRes-Screens auf die Augen...das k&ouml;nnen auch der pomp&ouml;se Sound,
Musikst&uuml;cke von bekannten Komponisten, etc. nicht wettmachen.

Name: Imperium Terranum II
Autor: Virtual Worlds Productions

Grafik: 7 von 10 Punkten
Sound: 8 von 10 Punkten
Steuerung: 4 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck des Redakteurs: 7 von 10 Punkten


----------------------------
---Diamond Challenge 1.31---
----------------------------

Er kann's nicht lassen. Christian Kargl Josef (ich hoffe, der Name ist
richtig geschrieben), ebenfalls Autor von Arkanoid, von dem hoffentlich
bald der Nachfolger kommt, hat nicht nur ein tolles Feature in sein
Knobelspiel Diamond Challenge eingebaut, mit dem man sich seine eigene
Musik f&uuml;rs Spiel zusammenstellen kann, nein, er hat auch noch den
Leveleditor freigegeben, der - wir erinnern uns - ja fr&uuml;her Shareware war.
Der Editor ist erstaunlich einfach zu bedienen, so dass auch
Nichteingeweihte in die Programmierkunst fix ein paar Level kreieren
k&ouml;nnen. Jedoch sollte man sich hierf&uuml;r die Anleitung mal ordentlich zur
Hand nehmen, da es sonst zu Missverst&auml;ndnissen kommen kann.
Ansonsten ist alles beim Alten geblieben, das Knobelspiel bringt immer noch
eine Menge Spa&szlig; f&uuml;r langweilige Regentage und man kann immer noch nicht
ausmachen, was die Spielfigur darstellen soll.

Name: DiamondChallenge v1.31
Autor: Christian Kargl

Grafik: 7 von 10 Punkten
Sound: 7 von 10 Punkten
Steuerung: 5 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck des Redakteurs: 7 von 10 Punkten

Wobei angemerkt sein will, dass sich nach der Wertungstabelle, die ich vor
wenigen Monaten erstellt und ver&ouml;ffentlicht habe, die Wertung 7/10 als
"Gut" eingestuft werden kann. F&uuml;r 8/10 Punkte (also "Sehr gut") reichten
die Neuerungen aber nicht. Sorry, Christian. ;)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
