<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Aktuell</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/aktuell.gif"  alt="Aktuell" width=89 height=35>
<h1>diverse neuigkeiten</h1>
(was geschah in den vergangen 2 monaten?)
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>
3dFX Erweiterung kommt!<br>
Wie wir erfahren haben, wird es die 3dFX Erweiterung f&uuml;r die PicassoIV
Karte geben. Erscheinen soll sie im M&auml;rz oder April n&auml;chsten Jahres (99).
Leider konnten wir noch nicht herausbekommen, ob die gew&uuml;nschte Anzahl an
Vorbestellungen erreicht wurde oder nicht... es ist aber anzunehmen.
<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>
Wieder keine Chance...<br>
NEUES... die Redaktion wird auch zuk&uuml;nftig nicht vom Amiga berichten,
dies ergab eine Anfrage von Alexander Kurtz. Man sei erst wieder bereit,
wenn der Markt Neuerungen zum Vorschein bringt, zwar berichtete man schon
einmal &uuml;ber die PPC Karten, doch solange wie es keine &quot;wirklich&quot; neue
Hardware (sicher meint man damit ein neuen Amiga) gibt, wird man den Amiga
nicht in das Programm mit einbeziehen.

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

AAA Awards gibt es wieder! <br>
Auch in diesem Jahr gibt es wwieder einen AAA Award, diesmal auch
International in Belgien, Spanien und in England. Jeder kann sich 
diesmal an der Wahl beteiligen und Vorschl&auml;ge werden gerne entge-
gengenommen und sollen auch kommen!<br>
URL: <a href="http://www.aaa-awards.org/suggest.html">http://www.aaa-awards.org/suggest.html</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Warp3D erschienen <br>
Hans-Joerg Frieden, einer der Autoren von Warp3D, informiert in einem
Newsgroup-Posting: <br>
&raquo;Mit dem heutigen Tage sind Warp3D 1.0 und StormMesa 3.0 auf der Haage&amp;
Partner-Homepage zum Download verfuegbar. Warp3D ist ein hardware-unabhaengiges 
Treibersystem fuer 3D-Hardware. Im Augenblick wird die Cyber-
Vision64/3D unterstuetzt, ein Treiber fuer die Permedia2-Karten von
Phase 5 und einer fuer die 3D/fx von Village Tronic werden in Kuerze 
folgen. StormMesa ist eine Portierung der Mesa-GL-Library von Brian
Paul. Die neue Version 3.0 unterstuetzt Warp3D als Rasterizer, kann 
also 3d-Hardware benutzen. Beides ist auf der Haage&amp;Partner-Homepage
in der neuen 3DWorld unter<br> <a href="http://www.haage-partner.com">www.haage-partner.com</a> bzw. per FTP von
ftp.haage-partner.com/3DWorld erhaeltlich.<br> Man sollte auf jeden Fall
bei StormMesa das &quot;Readme.txt&quot; lesen, um zu sehen, welche Dateien 
downgeloaded werden muessen... MfG Hans-Joerg Frieden&laquo;<br>
(Quelle: Amiga Aktuell)

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Haage &amp; Partner mit einer Sonderaktion<br>
Haage &amp; Partner bringt uns ein besonderes Weihnachtsgeschenk. Fusion/
PCx gibt es f&uuml;r nur 89 DM und sind voll updatef&auml;hig auf die geplanten
PPC Versionen. Wer nur Fusion 3.1 bzw. PCx 1.1 haben will, bekommt 
diese f&uuml;r jeweils 69,- DM. Das oben genannte Angebot gilt nur solange
der Vorrat reicht. Danach gibt es nur noch das Bundle-Angebot. Mehr
Infos unter Haage&amp;Partner.com

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Auch SASG mit Weinhachtspreisen<br>
Die SASG bietet ihre Shareware-Programme MUI, MagicWB, MCX und DFA 
bis zum 25. Dezember mit einem 20 prozentigen Rabatt an. Zuschlagen
empfohlen! Schaut doch mal bei der SASG vorbei:<br> <a href="http://www.sasg.com/xmas.html">www.sasg.com/xmas.html</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

ComputerClub Nacht f&uuml;r AMIGA ein Flop!!!<br>
Leider war die tolle ComputerClub Nacht ein reiner Flop, in den 6 
Stunden Sendezeit gab es nur knapp 2 Minuten etwas vom Amiga zu sehen
und auch so hatte man sich lieber mit dem PC befa&szlig;t, als mit anderen
Systemen. Der sp&auml;te Auftritt von ANNEX ware auch nicht gerade motivierend, so da&szlig; man abschlie&szlig;end sagen kann... das waren verschwendete
Stunden!!! Vielleicht wird es das n&auml;chste mal besser!?!

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

NEUES... das Computer Magazin berichtet &uuml;ber AMIGA in K&ouml;ln!!!!<br>
Am Montag, dem 30.11.98, berichtete das Computer Magazin NEUES in 3sat
&uuml;ber die K&ouml;lner Computer Messe! Vergessen hat man diesmal auch den AMIGA
nicht! In einem kurzen Bericht (knapp 4 Minuten) wurde unteranderem Petro
Tyschtschenko interview`t (Petro dankte &uuml;bringes allen usern und Mags f&uuml;r
die Unterst&uuml;tzung und berichtete, da&szlig; nur noch 1,1 Millionen Mark Umsatz
gemacht werden m&uuml;ssten, um den Gewinn seit M&auml;rz `97 auf 10 Millionen zu
steigern!!!!) die neuen printed Mags vorgestellt und ein paar Erweiter-
ungen, sowie einige Programme wurden ebenfalls positiv ins Rampenlicht
gesetzt und dazu gabs im Hintergrund ANNEX mit &quot;Back for the future&quot; -
also wirklich eine gute Werbung f&uuml;r unsere Freundin!!!!! BillMcEwen gab
auch vor laufender Kamera noch keine Ausk&uuml;nfte &uuml;ber Amiga OS5! Tja, da 
werden wir eben warten m&uuml;ssen.

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

eMail Virus treibt sein Unwesen <br>
User aufgepa&szlig;t, wie uns Sascha von Wahnem (Snoopy) berichtet hat, treibt
derzeit ein Virus im Netz sein Unwesen. Wenn Ihr eine eMail mit dem Betreff `Get more Money` erhalten solltet, so l&ouml;scht diese sofort, da sie
einen Virus freisetzt, der Eure Festplatte zerst&ouml;ren kann. Mircosoft hat
letzte Woche diese Information bekanntgegeben, derzeit gibt es noch kein
Gegenmittel. Zwar soll der Virus f&uuml;r nicht IBM kompatible Rechner ungef&auml;hrlich sein, trotzdem ist Vorsicht geboten!

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

www.amigaos.COM ??? <br>
Seit geraumer Zeit sind unter der Adresse <a href="http://www.amigaos.com">www.amigaos.com</a> Bilder einer
eventuell m&ouml;glichen OS5 Version vorzufinden. Angbelich seien diese keine
Fotomontage, sondern echt, eine User Group, die leider noch nicht viel 
Informationen &uuml;ber sich rausr&uuml;cken, haben angeblich eine lauff&auml;hige 
Version eines neuen OS entwickelt, jedoch ist einiges schon mit OS3.1
und einigen Tools machbar, eine Demo gibt es auch noch nicht. Was nun
wirklich an der Sache dran ist... ? Wir werden sehen! 

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Fleecy Moss nun nicht mehr bei Amiga??? <br>
Fleecy Moss hat in einem Newsgroup-Posting gesagt, da&szlig; er nicht l&auml;nger
f&uuml;r Amiga, Inc. arbeiten wird. Der Grund f&uuml;r den Ausstieg ist noch 
nicht bekannt. Wer Nachfolger wird ist auch noch unklar. Neben Joe 
Torre ist Fleecy Moss nun schon der zweite Mitarbeiter der Amiga, Inc.
verl&auml;&szlig;t. Nun mu&szlig; sich doch die Frage stellen, ob man sich im Unternehmen nicht versteht oder ob man sich nicht gegenseitig abspricht und
einige Leute von anderen Projekten nichts wissen? Ist der Ausstieg eine
Trotzreaktion, weil man nun mehr auf Amiga OS5, statt OS3.5 (welches 
Fleecy Moss leitete) gesetzt wird? Das alles sind Vermutungen und wir
werden sehen, wann es eine offizielle Stellungnahme geben wird.

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Amiga Arena trotzt mit immer mehr Sonderangeboten!<br>
Die Amiga Arena bietet nun schon Shareware Produkte zu absoluten 
Billigpreisen an, also Ihr solltet mal dort vorbeischauen!!!!<br>
URL: <a href="http://www.online-club.de/~ARENA">www.online-club.de/~ARENA</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Village Tronic ist zufrieden! <br>
Viele user waren beim Village Tronic Stand und es gab auch ein gro&szlig;,
Interesse bez&uuml;glich der Voodoo Karten f&uuml;r die Picasso IV. Der Stand
vom 16.11.98= 185 Vorbesteller und 439 Interessenten! Wer auch an 
solch einer Karte interessiert ist, sollte unseren Fragebogen ausf&uuml;llen oder sich direkt bei Village Tronic melden!!!<br>
URL: <a href="http://www.villagetronic.com">www.villagetronic.com</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

MIAMI 3.2 jetzt verf&uuml;gbar <br>
Miami 3.2b kann man sich jetzt von der NordicGlobal Inc. WebSite 
downloaden.<br> URL:<a href="http://www.nordicglobal.com">www.nordicglobal.com</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

QNX entwickelt das neue Betriebssystem f&uuml;r den NEXT GENERATION AMIGA<br>
QNX, die es seid 1981 gibt, sind nun Partner bei der Entwicklung des
neuen Next Generation Amiga`s und werden sich um das Betriebssystem 
k&uuml;mmern. Bekanntgeworden ist QNX durch ihr Betriebssystem, welches im 
Servermarkt gro&szlig;e Aktzeptanz fand. QNX behaupten von sich selbst, 
enthusiastische Amiga-Anwender zu seien und deshalb w&auml;ren auch die 
Vorraussetzungen zur Zusammenarbeit mit Amiga Inc. vorhanden.
 <p>
Was soll das Betriebssystem alles bieten?
<ul>
<li> Echtzeit-Betriebssystem, vollstaendig 32 Bit
<li> vollkommen geschuetztes praeemptives Multitasking (mit Prozessen
  und Threads)
<li> Multiprozessor-Unterstuetzung
<li> offene Standards
<li> Unterstuetzung von virtuellem Speicher
<li> 3D (OpenGL) mit hoher Leistung
<li> Grafik: vollstaendig 24 Bit (True-Color)
<li> unterstuetzte Video-Standards: TV, SVGA und Aufloesungen bis zu HDTV
<li> Echtzeit-Animationen (Audio/Video/Grafiken)
<li> Internet-Loesungen mit hoher Performance
<li> vollstaendiger Java-Support
<li> weniger als 4 MB Umfang <br>
  (Angaben ohne Gew&auml;hr!!!) </ul>


<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Amiga Writer Patch 1.2 bei Haage &amp; Partner<br>
Auf der Haage &amp; Partner Homepage kann man sich nun den Patch auf 
die Version 1.2 von Amiga Writer kostenlos downloaden.<br>
<a href="http://www.haage-partner.com">www.haage-partner.com</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Computer-Club Nacht im WDR mit AMIGA Pr&auml;senz???<br>
In der Nacht vom 5. auf den 6. Dezember veranstaltet der WDR-
Computerclub eine Sendung, welche gegen 23:30 Uhr beginnt und 
ca. 6:00 Uhr morgens enden soll. Es werden immer noch Vorschl&auml;ge 
gesucht. Da darf der AMIGA nat&uuml;rlich nicht fehlen, also beteiligt 
Euch an der Umfrage vom Computer-Club!!! <br>
<a href="http://www.wdr.de/tv/Computer-Club/home_nacht.htm.">http://www.wdr.de/tv/Computer-Club/home_nacht.htm.</a>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Haage &amp; Partner ist wieder gro&szlig; auf der Computer`98 vertreten.<br>
Haage &amp; Partner wird einiges neues vorstellen und hier bekommt Ihr 
schon einmal einen kleinen Einblick. Zu finden ist Haage &amp; Partner 
auf ihrem Stand C34/D35 und bie Amiga International!
<ul>
<li> Die neue Textverarbeitung AmigaWriter 1.2 (neue Version)
<li> Das bekannte Grafikprogramm ArtEffect 3 (neue Version)
<li> WarpUP und Warp3D (der neue 3D Grafikstandard)
<li> Das neue Entwicklungssystem StormC DSK (neus Komplettpaket)
<li> Auf geht's ins Netz mit der kompletten Internet-Suite Net
  Connect 2.1 (neue Version)
<li> Das Faxprogramm STFax Pro 3.5 (neue Version)
<li> Das neue Videopaket VideoFX 2 (neues Produkt)
<li> Die neue PowerPC-Version des Videoprogramms X-DVE 3.50 (neue Version)
<li> Der Fontgenerator FontMachine 3.20 (neue Version)
<li> Das aussergewoehnliche Rendering- und Animationsprogramm Tornado3D 2
  (neue Version)
<li> SoftLogik's neue Version von PageStream 3.4 (neue Version) und
  einiges mehr...</ul>

<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Neue Schnittstellenkarte f&uuml;r den Amiga<br>
Kato Development Group pr&auml;entiert eine neue, sehr schnelle serielle
Schnittstellenkarte f&uuml;r den Amiga. Eine Demonstration soll es auf der 
WOC`98 in K&ouml;ln geben, Markteinf&uuml;hrung soll auch auf der Messe sein. 
Die TWISTER 1200 Schnittstellenkarte solle eine fehlerfreie Daten-
&uuml;bertragung bieten und ist f&uuml;r den anspruchsvollen Einsatz im Bereich
der Internetdienste gedacht.
<p>
Hier einige Daten:<ul>
<li> 300...460800 bps
<li> 7-wire Handshake auf Hardwarebasis (Autoflow)
<li> 2x32 Byte Puffer
<li> kombinierbar mit MELODY 1200
<li> Adapter zur einfachen Nutzung von &quot;PC&quot; und &quot;Rest-der-Welt&quot;-
  Geraeten mitgeliefert</ul>


<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Village Tronic macht zur Computer`98 in K&ouml;ln eine Umfrage.<br>
Als einer der wenigen verbliebenen Hardware Hersteller f&uuml;r die Zorro 
basierenden AmigaClassic Systeme stellt sich f&uuml;r uns nach der Fertigstellung der AriadneII die Frage nach einer Weiterentwicklung der AddOn
Board-Serie f&uuml;r unsere Grafikkarte PicassoIV.<br>
Da es leider keine klaren statistischen Aussagen &uuml;ber die derzeitige 
Lage des Amiga Marktes gibt und wir nicht sicher sind, wieviele aktive 
und interessierte PicassoIV Nutzer es noch gibt, haben wir uns zu 
folgender Umfrage entschlossen. <br>
Unser Ziel ist es, eine 8MB 3D-Karte mit Voodoo-Chipsatz (3dfx) zuentwickeln. 
Diese Karte wird eine PicassoIV im ZorroIII-Betrieb voraussetzen 
(d.h. A4K, A3K, A1200 mit Z3 Erweiterung). Wir ben&ouml;tigen allerdings 
im Vorfeld ca. 500 Bestellungen, um unsere Entwicklungskosten und
Zeit rechtfertigen zu k&ouml;nnen und darum bitten wir Sie, die angef&uuml;gte 
Umfrage bzw. Bestellung auszuf&uuml;llen: Sie k&ouml;nnen dem Amiga Markt zu einem
fortschrittlichen Produkt verhelfen. An der Umfrage kann man am Stand
von Village Tronic auf der Computer`98 Messe in K&ouml;ln teilnehmen (Halle
11.2 , E32/F33). Desweiteren befindet sich ein Wahlzettel auf unserer
Homepage auf <a href="http://www.villagetronic.com/amiga/surveydt.html">www.villagetronic.com/amiga/surveydt.html</a> oder schicken 
sie einfach eine Email mit dem Titel &quot;SURVEY&quot; an <a href="mailto:amigasupport@village.de">amigasupport@village.de</a>
Sie k&ouml;nnen dem Amiga Markt zu einem modernen und progressiven Produkt
verhelfen.
<p>
Ekkehard Brueggemann<br>
Village Tronic Support Team<br>
Village Tronic Marketing GmbH<br>
M&uuml;hlenstr.2 - D-31157 Sarstedt<br>
<a href="http://www.villagetronic.com">www.villagetronic.com</a><br>
<a href="mailto:amigasupport@village.de">amigasupport@village.de</a><br>
Tel.: +49(0)5066-7013-20 <br>
Fax.:+49(0)5066-7013-49<br>

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Vorerst kein AMIGA BODYGUARD! <br>
Das Programm Amiga Bodyguard, welches Stefan Ossowksi`s Schatztruhe
schon im Januar 1998 angek&uuml;ndigt hatte, wird vorerst auf unbestimmte
Zeit verschoben. Grund hierf&uuml;r sind andauernde Terminverschiebungen, 
und man habe den Umfang eines solchen Projektes etwas untersch&auml;tzt.
Da die Schatztruhe  keine unvollst&auml;ndige oder Vorabversion ver&ouml;ffentlichen m&ouml;chte, wird das Programm erst einmal nicht erscheinen. Der
Programmierer Martin Brandt arbeitet aber weiterhin an Amiga BodyGuard und man kann davon ausgehen, das im n&auml;chsten Jahr das Produkt
auf den Markt kommen wird.

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Was bringt die Schatztruhe zur Computer`98? <br>
Diese Produkte werden erscheinen:
<ul><li> Aminet Set 7
<li> CyberGraphX V4
<li> Directory Opus Magellan II
<li> DOpus Plus CD
<li> Envoy 3
<li> Linux 5.1 (inoffizielle RedHat version)
<li> Miami 3.2
<li> Miami Deluxe
<li> PFS 2 V4.2
<li> SuperView Productivity Suite </ul>


<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Siedler II kommt nun f&uuml;r den Amiga!!! <br>
Was schon eine ganze Zeit als Ger&uuml;cht in diversen Netzen rumging, 
ist nun endlich offiziell klar. Siedler II wird von Titan Computers 
f&uuml;r den Amiga umgesetzt, nachdem man sich mit BlueByte &uuml;ber ein Lizenzabkommen geeinigt hatte. Wenn Siedler II ein Erfolg wird und sich gut
verkauft, stehe auch weiteren BlueByte Umsetzungen nichts im Wege. 
Auf der Computer`98 soll es schon ein Demo geben!

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

clickBOOM bringt keine PPC Version von Q***e <br>
Da im Aminet eine illegale PPC Version von Q***e erschienen ist, und 
clickBOOM diese nicht autorisiert hat, hat man dies zum Anla&szlig; genommen
und nun endg&uuml;ltig die PPC Version von Q***e auf Eis gelegt! Gr&uuml;nde, 
wie der das es zuwenig PPC Besitzer g&auml;be, kamen schon vor einiger Zeit
von clickBOOM, so da&szlig; ja eigentlich schon zu erwarten war.

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

ESCENA k&uuml;ndigt G3-PPC Boards an!<br>
Die Firma ESCENA, die bereits seit vielen Jahren Hardware- Entwicklungen
z.B. f&uuml;r DCE und IBH &uuml;bernommen hat, wird auf der Computer '98 den Prototyp
eines G3-PowerPC-Boards vorstellen. Hierbei handelt es sich um ein
G3-ZorroIII-Board (ohne 68k CPU), das im A3000/4000 und A1200 mit Zorro-
Erweiterung eingesetzt werden kann. Das Board ist best&uuml;ckbar mit Prozessortypen von 233 bis 400 MHz mit 512KB oder 1MB Backside-Cache und bis
zu 512MB SDRAM. Als Treibersystem kommt das WarpUP-Paket und das 68k-
Emulatorsystem von Haage&amp;Partner zum Einsatz. Die Prototypenfertigung 
wird von der Firma DCE vorgenommen. Weitere Informationen erhalten Sie
in K&uuml;rze auf der Homepage von ESCENA und nat&uuml;rlich auf der Computer'98.<br>
(Quelle: Haage &amp; Partner)

<p>
<center><img src="../pic/hr1.gif" alt="---" width=415 height=19></center>
<p>

Vulcan Software verl&auml;&szlig;t den Amiga!!!<br>
Wie wir heute in einer Pressemitteilung erfahren haben, wird Vulcan 
Software zuk&uuml;nftig keine Amiga Produkte mehr herstellen. Wasted Dreams 
(erscheint noch vor Weihnachten`98) und Explorer 2260 (Anfang n&auml;chsten
Jahres) sind die beiden letzten Produkte, die erscheinen werden. Der
Amiga Markt ist nicht mehr &quot;ertragreich&quot; und somit will Vulcan f&uuml;r
andere Systeme produzieren, aber sie werden weiterhin als Publisher
f&uuml;r Amiga Software zur Verf&uuml;gung stehen. Vulcan hat seit 1994 10 Disk 
Spiele, 5 CD Titel und 2 bald erscheindende Prdoukte ver&ouml;ffentlicht.
<p>
<img src="../pic/mn.gif" alt="mn" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell2.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
