<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>Amiga Revolution</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19><br>
<img src="../pic/ar.gif"  alt="Amiga Revolution">
<h1>I n f o - T e x t</h1>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


<b>Inhalt</b><br>
<ol>
<li> Einf&uuml;hrung<br>
<li> History:<ul>
<li>2.1 Der Amiga
<li>2.2 Die Amigianer - Die einzigartige Fangemeinde </ul>
<li> Revolution:<ul>
<li>3.1 Verlauf
<li>3.2 Neue Perspektiven
<li>3.4 Neue Technologie / Neue Software
<li>3.5 Das Ziel: Die glorreiche Revolution</ul>
<li> Amigianer aller Welt vereinigt Euch!<br>
<li> Anhang</ol>
<p>
<b>1. Einf&uuml;hrung</b>
<p>
Es liegt gar nicht so lange zur&uuml;ck, da stand in jedem Haushalt ein k&ouml;niglicher 
Amiga 500. Dieses Ger&auml;t bot alles, was das Herz begehrte. Seinem damals engsten 
Konkurrenten, dem Atari 1040 ST, war es &uuml;berlegen und die weit unterentwickelten 
MS-DOS-Schreibmaschinen waren damals noch nicht ernst zu nehmen. In der gesamten 
Spieleindustrie galt der Amiga als Non-Plus-Ultra und als Spielecomputer Nummer 
Eins. Dar&uuml;berhinaus faszinierte er mit seinem Konzept, welches einen 
benutzerfreundlichen Rechner mit den modernsten multimedialen Finessen zu einem 
erschwinglichen Preis darstellte.
<p>
Heute sieht die Lage leider anders aus. Bill Gates hat es mit Microsoft 
geschafft, die Menschen in totale Abh&auml;ngigkeit zu setzten. Windows 95 &uuml;bernimmt 
die Kontrolle &uuml;ber den Computer, der Mensch hat nur noch wenig Einflu&szlig; auf sein 
System und benutzt am Besten gleich die von Microsoft diktierte Software. Ein 
Ausbrechen aus dem Windows-Kreislauf ist nicht m&ouml;glich, da es zu weit verbreitet 
ist. Auch das dem Windows weit &uuml;berlegene Mac-OS, verbreitet auf durchaus 
anschaulichen Macintosh-Rechnern, konnte sich bisher nicht durchsetzten und die 
Anteile sind eher r&uuml;ckl&auml;ufig. Apple ist seit einiger Zeit in einer tiefen Krise 
und ein Ende ist nicht in Sicht. Der Erzrivale des Amigas hat sich schon seit 
l&auml;ngerem g&auml;nzlich verabschiedet und die durchaus noch existierende Firma Atari 
k&uuml;mmert sich lieber um PC-Spiele.<br>
Wir sind mitten in dem Zeitalter, in dem der Mensch ohne Computer nicht mehr 
auskommt und die Computer immer wichtiger werden - im t&auml;glichen Leben, im Beruf 
und nat&uuml;rlich im Unterhaltungssektor. An dieser Stelle d&uuml;rfen wir es nicht 
zulassen, da&szlig; der PC, der ganz unter Windows-Kontrolle geraten ist, die
Herrschaft endg&uuml;ltig und f&uuml;r immer &uuml;bernimmt. Die Zeit ist reif, da&szlig; wir 
zur&uuml;ckschlagen und der Amiga wieder dahin kommt, wo er hingeh&ouml;rt.
<p>


<b>2. History</b>
<p>
2.1. Die Geschichte des Amigas
<p>
Richtig angefangen zu existieren hat der Amiga im Jahre 1985. Der erste Amiga 
ging in Serie. Es war der legend&auml;re A1000 und die Menschen liebten ihn. Dieser 
Computer war genau das, was die Welt gebraucht hat. Einen Computer, der auch 
mehrere Farben auf den Schirm bringt und vielseitig verwendbar ist. Man kann von 
einer Sensation sprechen. Leider gab es gleich nach dem Erscheinen zu wenig Ware 
f&uuml;r die vielen Interessenten, und dies sollte auch in Zukunft eins der gr&ouml;&szlig;ten 
Probleme bei Commodore bleiben.<br>
Die n&auml;chsten Schritte kommen 1987. Es erschienen die Modelle A500 und A2000. Der 
A500 als Home-computer f&uuml;r jedermann, der A2000 als die leistungsstarke 
Maschine, die in der B&uuml;rowelt die IBM-Rechner verdr&auml;ngen sollte. Zumindest auf 
dem Homesektor ging die Rechnung voll auf. Der A500 verkaufte sich schnell, und 
bald stand in jedem Haushalt ein solches Prachtexemplar. Dieser Compi konnte mit 
allen Spielkonsolen mithalten, Textverarbeitung war ebenso kein Problem, er war 
der Grafikcomputer Nummer eins und f&uuml;r den Video- und Musikbereich erste Klasse. 
Der Musikbereich fiel dann sehr bald unter die Kontrolle der Atari STs und in 
Sachen Textverarbeitung blieben die meisten B&uuml;ros unklugerweise den PCs treu. 
Commodore brachte dann sehr bald einige weitere Modelle auf den Markt: Dazu 
geh&ouml;rten der High-End-Rechner A3000, sowie die Tower-Version, das CDTV und den 
A500plus, im Jahre 1992 kam noch der A600 dazu. Das CDTV war ein totaler Flop. 
Dies schreiben zu m&uuml;ssen schmerzt, denn das CDTV (Commodore Dynamic Total 
Vision) beherrschte damals (1991) schon alles, was in den letzten Jahren 
CD-ROM-m&auml;&szlig;ig auf dem Markt gefragt war. Das CDTV hatte ein CD-ROM-Laufwerk. Man 
konnte es als CD-Player benutzen und nat&uuml;rlich f&uuml;r CD-ROMs. Wenn wir uns heute 
umgucken, dann sehen wir nur noch CDs. Es pa&szlig;t einfach viel mehr darauf und die 
Haltbarkeit scheint unbegrenzt. Lauter Vorteile gegen&uuml;ber den Disketten, 
Commodore hat es im Jahre 1991 schon erkannt, ebenso einige User, die sich 
dieses Ger&auml;t zugelegt haben. Leider hat Commodore bei der Vermarktung glorreich 
versagt, aber allgemein kann man sagen, da&szlig; das CDTV seiner Zeit voraus war. Die 
Menschen waren noch nicht empf&auml;nglich genug f&uuml;r diese neue Technologie. Der A600 
war genauso wie der A500 plus ein &uuml;berfl&uuml;ssiges Modell. Technisch nichts neues, 
und schon bei der ersten Vorstellung veraltet.<br> 
1993 war es dann soweit: Eigentlich schon viel zu sp&auml;t erschienen, und trotzdem 
h&auml;tte er den Amiga an die weltweite Spitze bringen m&uuml;ssen: Der A1200, begleitet 
von dem gro&szlig;en professionellen Bruder A4000. Der neue AGA-Chipsatz er&ouml;ffnete 
neue Horizonte an dem so begrenzten Computerhimmel. Auch ansonsten waren die 
neuen Modelle einfach perfekt. Nur hat Commodore schon wieder zu viele Fehler 
gemacht:<p> 
1. Man wollte den A600 noch verkaufen, und deshalb wurde die AGA-Generation zu 
lange zur&uuml;ckgehalten.<p>
2. Die Vermarktung war schlimmer als jemals zuvor in der Commodore-Geschichte.<p>
3. Der A1200 wurde niemals von Grund auf erweitert. Der Prozessor blieb immer 
ein 68020, der Speicher kam nicht auf &uuml;ber 2MB, und die Festplatte fehlte 
meistens g&auml;nzlich.<p>
4. Commodore verfolgte einen Ann&auml;hrungskurs an MS-DOS. Dieser setzte das hohe 
Niveau herab und ver&auml;rgerte die Fangemeinde.<p>
5 ...(es gibt wahrscheinlich noch viele Fehler, von der die &Ouml;ffentlichkeit noch 
gar nichts erfahren hat)<p>
1994 kam dann noch das CD32, bevor sich Commodore schmerzlich verabschiedete und 
einen Tr&uuml;mmerhaufen mit viel Potential hinterlie&szlig;. Das CD32 war eine 
Spielekonsole. Bis auf Atari war niemand in der Lage, ein &auml;hnliches Ger&auml;t 
herauszubringen, das eine Konkurrenz zu dem CD 32 h&auml;tte darstellen k&ouml;nnen. Doch 
dem CD 32 ging es nicht viel besser als dem Atari Jaguar. Trotz hervorragender 
Technik und der M&ouml;glichkeit, zu einem vollwertigen A1200 aufger&uuml;stet zu werden, 
blieben diesem Ger&auml;t die Weiten einer Nintendo oder Sega Spielekonsole immer 
verschlossen. Auch die 2 Jahre sp&auml;ter erschienene Sony Playstation hat nicht 
viel mehr zu bieten als das CD32. Es gab eben gleich zu Beginn mehr Werbung, 
mehr  Spiele und mehr Toleranz. Mittlerweile, wo die Playstation mit &uuml;ber 250 
Spielen wirbt, Nintendo das N64 auf den Markt gebracht hat und krampfhaft 
probiert, die PSX zu &uuml;berholen, ist f&uuml;r das nicht weiterentwickelte CD 32 kein 
Platz mehr. Aber es h&auml;tte anders kommen k&ouml;nnen. Das CD 32 k&ouml;nnte an der Stelle 
von der Playstation die Nummer eins sein und der Nachfolger, das CD 64 h&auml;tte 
sich um das Nintendo 64 k&uuml;mmern k&ouml;nnen.
<p>
Das beste System konnte sich in den Jahren unter Commodore, dann unter Escom und 
jetzt unter neuer Herrschaft nicht zu dem entwickeln, zu dem es bestimmt war. 
Der Amiga sollte f&uuml;r immer ein Traum bleiben, wie es R.J. Mical, ein wichtiger 
Entwickler der Amiga-Technologie, schon ausgedr&uuml;ckt hat:
&quot;Der Amiga hat von Anfang an den Tr&auml;umern geh&ouml;rt. Ich war ein einfacher Junge 
aus dem S&uuml;den Chicagos, aber ich wollte etwas Weltbewegendes tun. Als ich zu 
Amiga ging, hatte ich den Traum von einem neuen Computer, einem, den ich selbst 
benutzen wollte - so ungemein schnell und leistungsstark. Wir bei Amiga tr&auml;umten 
alle den selben Traum.&quot;
<p>

<b>2.2. Die Amigianer - Die einzigartige Fangemeinde des Amigas</b>
<p>
Der Amiga ist ein au&szlig;ergew&ouml;hnlicher Computer. Genauso au&szlig;ergew&ouml;hnlich sind die 
User dieses Systems. Diese User bezeichnen sich allgemein als &quot;Amigianer&quot;. Man 
mu&szlig; bei den Usern jedoch zwischen zwei Gruppen differenzieren.<br> 
Zu der ersten Gruppe kann man all diejenigen z&auml;hlen, die den Amiga ganz normal 
benutzen, weil sie seine F&auml;higkeiten sch&auml;tzen und es keine, bzw. nur schlechtere 
Alternativen gibt. Diese Gruppe existiert jetzt so gut wie gar nicht mehr, war 
aber in den glorreichen Amiga-Zeiten sehr gro&szlig; und &uuml;berall vertreten.
Heute gibt es eigentlich nur noch die andere Gruppe. Zu dieser z&auml;hlt man die 
User, die, aufgrund ihrer Liebe und Zuneigung zu dem Amiga, ihm die Treue halten 
und ihn loben und ehren bis zum Tod. Zu dieser Gruppe z&auml;hle ich mich. Ich bin 
ein Amigianer und jeder der ebenso denkt, ist auch ein Amigianer.<br>
Wir sind die User, die trotz schwerer Krisen den Amiga noch nicht verkauft haben 
und andere Systeme, auch wenn sie mittlerweile weiter entwickelt sind als unser 
Amiga, verachten. Commodore hat das vorhandene Potential nicht entsprechend 
gef&ouml;rdert und vermarktet, sie haben vielmehr versucht, auf dem nicht sehr 
lukrativen und ge&auml;chteten PC Markt Fu&szlig; zu fassen, was allerdings gr&uuml;ndlich 
daneben ging. Der Amiga mu&szlig;te darunter leiden, und mit ihm nat&uuml;rlich all die 
Personen, die an ihn geglaubt haben und es immer noch tun. Nach Commodores 
Niedergang verging ein Jahr der Ungewi&szlig;heit bis endlich feststand, da&szlig; Escom den 
Amiga &uuml;bernimmt und &quot;gro&szlig;e&quot; Pl&auml;ne mit ihm vorhat. Davon haben wir bis zu Escoms 
Untergang wenig mitbekommen, so da&szlig; dieses Escom-Jahr nicht besser verlief als 
ohne jeglichen Amiga-Besitzer. Nun sind wir immer noch nicht weiter. Der Amiga 
geh&ouml;rt jetzt zu Gateway 2000, die eine Tochterfirma mit dem erfolgversprechenden 
Namen &quot;Amiga Int.&quot; gegr&uuml;ndet haben. Diese Firma versucht mit Lizenzvergaben den 
Amiga wiederzubeleben. Sicherlich eine gute Idee, die vor vielen Jahren einmal 
h&auml;tte umgesetzt werden m&uuml;ssen. Leider sehen wir von Neuentwicklungen direkt 
nichts. Es gibt viele Firmen, die auf Basis des Amigas neue Computer und neue 
Betriebssysteme entwickeln, aber diese zerteilen die Amiga-Fangemeinde lediglich 
in viele kleine, handlungsunf&auml;hige und total abh&auml;ngige Gruppen. Deshalb m&uuml;&szlig;te 
endlich von Amiga Int. etwas kommen und wir warten und warten und warten. Nur 
wer dieses Warten &uuml;bersteht und in dieser Zeit weiterhin seinen Amiga liebt und 
gut beh&uuml;tet, nur der kann sich als Amigianer bezeichnen. 
<p>
Der Amiga hat es solchen Leuten zu verdanken, da&szlig; er noch lebt. Uns allen 
geb&uuml;hrt ein gro&szlig;es Lob und unser Warten wird nicht umsonst sein. Wir werden den 
Amiga wieder ganz nach oben bringen. Dies wird geschehen durch die gro&szlig;e 
Revolution und getragen wird diese durch uns!
<p>


<b>3. Revolution</b>
<p>
3.1. Der Verlauf der Revolution
<p>
F&uuml;r den Beginn der Revolution ist kein bestimmtes Datum vorgesehen. Welchen Tag 
man sp&auml;ter unter dem Tag der Amiga-Revolution verstehen wird, das kann man im 
Voraus sowieso noch nicht sagen und es wird kein einzelner Tag sein. Auf jeden 
Fall wird die Revolution kommen. Bestehende Verh&auml;ltnisse werden gest&uuml;rzt, der 
Amiga wird revolution&auml;r Einzug in jeden Haushalt, in jedes B&uuml;ro, in jedes Studio 
und in alle Universit&auml;ten und Schulen halten. &Uuml;berall wo man hinkommt wird es 
nur noch Amigas geben. Vobis, Proline, Comtech, usw. werden ersetzt durch Amiga 
Oberland, GTI, Fischer, usw., sofern sie sich nicht rechtzeitig auf die neuen 
Verh&auml;ltnisse einstellen.<br>
Die Revolution wird folgenderma&szlig;en ins Rollen kommen. &Uuml;berall auf der Welt 
werden sich Amigianer treffen und vereinen, um als geschlossene Masse mehr Macht 
und mehr Einflu&szlig; zu erlangen. Die Amiga-Revolution (im folgenden AR) wird wie 
eine Lawine ins Rollen gebracht, und sie wird irgendwann nicht mehr zu stoppen 
sein. Dieser Zeitpunkt wird sehr schnell erreicht sein. Kritiker werden an 
dieser Stelle bemerken, da&szlig; es fast keine Amigianer mehr gibt - es also nicht 
genug Leute da sein werden, die die Revolution tragen werden. Das stimmt nicht. 
Nat&uuml;rlich ist der Kreis der aktiven Amigianer auf ein Minimum geschrumpft, er 
ist aber durchaus noch eine nicht zu verachtende Masse. Au&szlig;erdem zeichnen sich 
die Amigianer durch extreme Stand-festigkeit und eine durchdringende 
Schlagfertigkeit aus. Auf der anderen Seite gibt es auch noch die nicht mehr 
aktiven Amigianer. Das sind die Leute, die ihren Amiga verkauft oder in den 
Keller verfrachtet haben, um &quot;mit der Zeit zu gehen&quot; und sich in diesem Sinne 
einen PC zugelegt haben. Allerdings geh&ouml;rt ihr Herz noch dem Amiga, meistens 
bereuen sie den Kauf des PCs und den Verkauf des Amigas noch auf das H&auml;rteste. 
Wenn diese Menschen jetzt durch uns - die aktiven Amigianer - angesprochen 
werden, dann kann man sie wieder reaktivieren. Der Ruf des Amigas wird durch ihr 
Herz schallen, sie werden diesem Ruf bedingungslos folgen und mit uns zusammen 
eine bessere Zukunft erleben. Momentan sind sie n&auml;mlich von der ganzen Welt 
ent-t&auml;uscht, da sie mit ihren neuen Windows System niemals gl&uuml;cklich werden 
k&ouml;nnen. Sie warten nur darauf, da&szlig; es endlich eine Erl&ouml;sung gibt. Wir werden sie 
erl&ouml;sen, und sie werden mit uns zusammen den weiteren Verlauf der Revolution 
bestimmen.<br>
Neben den aktiven und reaktivierten Amigianern wird es noch eine ganz neue 
Gruppe geben: Die Oppositionellen. Diese unterst&uuml;tzen die AR in ihrem Denken 
eigentlich nicht, doch werden sie uns aus taktischen Gr&uuml;nden unterst&uuml;tzen. Unter 
den Oppositionellen versteht man n&auml;mlich Menschen, die mit den bestehenden 
Verh&auml;ltnissen, ganz wie die Amigianer, nicht einverstanden sind. Das k&ouml;nnen zum 
Beispiel Apple-Fans sein, oder PCler, die jedoch alternative Betriebssysteme zu 
Windows bevorzugen und dementsprechend Probleme haben, da die MS Bill 
Gates-Monarchie auch sie trifft. Nehmen wir zum Beispiel User, die ihr Leben 
lang mit MS-DOS (zugegeben auch ein dem Amiga OS weit unterlegenes System) 
gearbeitet haben, und dieses in ihr Herz geschlossen haben. Diese Leute werden 
froh sein, wenn die AR die Windows-Herrschaft beendet und somit ein Feindbild 
ausgeschaltet wird. Nicht zu vergessen sind hierbei die Atari-User. Als 
ehemalige Erzfeinde des Amigas wird man aus ihnen nicht gleich einen Amigianer 
machen k&ouml;nnen. Jedoch wird es hier &auml;hnlich wie bei den MS-DOS und Apple-Fans 
laufen: St&uuml;rzt die Windows-Herrschaft. Der Atari wird seit langem nicht mehr als 
Feind und Konkurrent gehandelt und so kann man wohl auch nebeneinander, Seite an 
Seite gegen die nichtzufriedenstellenden Verh&auml;ltnisse ank&auml;mpfen. Nebenbei kann 
man ihnen auch durch diese Friedenserkl&auml;rung den Amiga n&auml;her bringen. Sie sollen 
die Vorz&uuml;ge und die User (also uns) erst einmal richtig von der 
freundschaftlichen Seite kennenlernen, und das wird dem eventuell noch 
angespannten Verh&auml;ltnis zwischen Amiga und Atari auf die Beine helfen. 
<p>
An dieser Stelle k&ouml;nnte dem unbedarften Leser vielleicht folgendes Gespinst im 
Kopfe herumgeistern: &quot;Die von der Amiga-Revolution, die spinnen doch. Die leben 
in ihrer Traumwelt und h&auml;tten am liebsten eine Zeitmaschine, um in das Jahr 1985 
zur&uuml;ckzureisen, als ihr Computer noch eine Sensation war. Au&szlig;erdem sind das 
sowieso alles Fanatiker, die kein anderes System unterst&uuml;tzen und nur die 
Anh&auml;nger anderer Systeme tolerieren, weil sie selbst nicht gen&uuml;gend Leute f&uuml;r 
eine Revolution haben. Au&szlig;erdem wei&szlig; ich nicht, was die gegen meinen Windows-PC 
haben. Das Betriebssystem l&auml;uft doch gut, ich mu&szlig; nur einmal im Monat den 
Service-Techniker kommen lassen und es kostet doch auch nur 400 Mark.&quot;
<p>
Jawohl, es gibt diese bedauernswerten Menschen, die so oder &auml;hnlich denken, doch 
wir nehmen uns auch (oder gerade) ihnen an, denn sie sind von skrupellosen 
Menschen auf den Pfad der Verwirrung gef&uuml;hrt worden, sie sind an dem Punkt 
angelangt, an dem sie sich ihre Ideologien von plakativen Werbespr&uuml;chen und 
Verkaufszahlen vorschreiben lassen. Unser Ziel ist es, diese und alle Menschen 
aufzukl&auml;ren, sie von ihrer Verblendung zu befreien und in ihre Erl&ouml;sung zu 
f&uuml;hren. Dies wird der Motor unserer glorreichen Revolution sein, und auf den 
Fl&uuml;geln, die uns dorthin tragen werden, wird der Name stehen, der bald auf der 
ganzen Welt zum Synonym f&uuml;r Freihet und Br&uuml;derlichkeit werden wird: AMIGA!
<p>
Der AMIGA steht in seiner urspr&uuml;nglichen Konzeption f&uuml;r Innovation, Vorsprung 
durch Technik und Vision. Deshalb ist es nicht etwa unser Ziel, allen Haushalten 
der Welt ihre alten 500er zur&uuml;ckzugeben, da diese schon hoffnungslos (aber in 
Ehren) veraltet sind. Vielmehr stellt der Amiga ein Symbol dar, welches f&uuml;r das 
urspr&uuml;ngliche Konzept dieses gro&szlig;artigen Rechners steht, ebenso f&uuml;r die 
Ideologien und die Treue seiner einzigartigen Fangemeinde. Wir werden uns mit 
allen Usern dieser Welt, egal von welchem System sie kommen, verbr&uuml;dern und 
werden jedes System, das da kommen mag und die ehrw&uuml;rdigen Traditionen des AMIGA 
weiterf&uuml;hren kann, unterst&uuml;tzen, egal welcher Name darauf steht.
<p>
Zusammen sind wir stark und werden Bill Gates st&uuml;rzen. Wir werden nat&uuml;rlich auch 
alle anderen Menschen davon &uuml;berzeugen m&uuml;ssen, welches die einzig wahre 
Ideologie ist. Dies wird Zeit brauchen, aber die Bewegung, die unaufhaltsame 
Bewegung wird immer weiter laufen.
<p>

<b>3.2. Neue Perspektiven</b>
<p>
Manch einer mag in dieser Bewegung eventuell ein Forum erkennen, in dem er einem 
alten Klassenfeind oder einem neuen erkl&auml;rten Feindbild im Namen der AR einen 
vor den Latz knallen kann. Die AR stellt sich jedoch entschieden gegen jegliche 
Art von extremer oder militanter Interpretation des Wortes &quot;Revolution&quot;, welches 
Bestandteil unseres Namen ist. In &quot;Revolution&quot; steckt auch der Begriff 
&quot;Evolution&quot;, welcher &quot;Entwicklung&quot; bedeutet. Damit soll gesagt sein, da&szlig; die 
Steinzeit und auch die Zeit der kriegerischen Auseinandersetzungen (hoffentlich) 
hinter uns liegen, und wir uns anderen Formen des Widerstandes zuwenden m&uuml;ssen. 
Unsere Bewegung folgt dem Prinzip des gewaltlosen Widerstandes, was hei&szlig;t, da&szlig; 
zur Protestkundgebung alles erlaubt ist, was nicht gewaltt&auml;tigen, militanten 
oder extremen Ansichten zugrundeliegt. Wir von der AR haben einen Traum, eine
Vision, die wir verwirklichen wollen, und wir werden solche, die in unserem 
Namen nur ihrem &Auml;rger und Frust oder irgendwelchen alten verbohrten Ansichten 
gewaltsam Luft machen wollen, nicht unterst&uuml;tzen.
<p>
Wir schauen in die Zukunft, wir sind auch keine verblendeten Tr&auml;umer, die nur 
schlau daherreden. Unsere Vision hat eine konkrete Form, dazu geh&ouml;rt auch, da&szlig; 
wir wissen, wer unsere Gegner sind: Alle, die sich durch eigenn&uuml;tzige und 
skrupellose Handlungen gegen die freie Entwicklung des Computermarktes und gegen 
die Amiga-typischen Ideologien stellen. Typisches Aush&auml;ngeschild dieser Spezies 
ist der Tyrann Bill Gates, der sich mit den zwielichtigen Praktiken seines 
Konzerns Microsoft seit Jahren gegen einen plattform&uuml;bergreifenden Markt stellt, 
um sein Softwaremonopol zu behalten und die PC-Welt in Sklaverei zu halten (mehr 
dazu im Bereich &quot;Aufkl&auml;rung&quot;). Ihn und &auml;hnlich denkende Individuen zu bek&auml;mpfen 
gilt es in unserer Bewegung. Dies soll wie gesagt nicht auf militantem Wege 
geschehen, sondern AR-w&uuml;rdig, eben revolution&auml;r. Mehr dazu im n&auml;chsten Manifest 
(coming soon).
<p>
<b>3.3. Neue AMIGA-Hardware /Software</b>
<p>
Es mag sein, da&szlig; momentan keine neue AMIGA-spezifische Hardware in Sicht ist. 
Der Walker ist leider schon im Anfangsstadium stehengeblieben, und w&auml;re f&uuml;r viel 
mehr auch nicht in der Lage gewesen, aufgrund seiner Technik, die einem A4000 
weit unterlegen war. Aber das ist im Prinzip egal, denn es w&auml;re ein Amiga 
geworden. Vielleicht ein Fun-Amiga, auf jeden Fall ein Amiga. Wir sollten alle 
Amigas ehren und sammeln, bis das der Tod uns scheidet. Ich wei&szlig; auch einen A600 
zu sch&auml;tzen. Vielleicht weil er so s&uuml;&szlig; ist, vielleicht auch einfach nur, weil 
Amiga drauf steht und drinnen zu finden ist.<br> 
Es ist nicht wichtig, ob es gleich morgen oder p&uuml;nktlich zur Revolution einen 
neuen leistungsstarken und sch&ouml;nen Amiga gibt, neue Amiga Hard- und Software 
wird es mit der Zeit sowieso geben. Wir brauchen sie nicht zwangsweise, man kann 
die AR auch mit sch&ouml;nen alten A500er und A1200er f&uuml;hren (andere Modelle erw&auml;hne 
ich jetzt nicht, weil es sie nicht in solchen Massen gibt, wie die zwei 
erw&auml;hnten). Nat&uuml;rlich mu&szlig; allen klar sein, da&szlig; es keinen Konflikt zwischen den 
alten und neuen Amiga-Generationen geben darf. AGAler und ECSler m&uuml;ssen 
zusammenhalten. Die alten Amigas k&ouml;nnen auch noch dann aufger&uuml;stet werden, wenn 
der Feind geschlagen ist. Vielleicht legt sich zu diesem Zeitpunkt auch jeder 
einen ganz neuen Amiga zu, vielleicht den AR300. Hinter diesen Namen k&ouml;nnte sich 
ein revolution&auml;rer Amiga mit PPC 300Mhz verbergen, der die offizielle Nachfolge 
vom 1200 antritt, nicht mehr kostet und mit einem v&ouml;llig neuen OS ausgestattet 
ist. <br>
Sobald die Hard-und Softwareentwickler bemerken, da&szlig; es wieder viel Interesse am 
Amiga gibt, werden sie mehr Geld und Anstrengungen in die Amiga-Entwicklung 
stecken. Der Kreislauf schlie&szlig;t sich und der Weg ist geebnet f&uuml;r eine 
hervorragende Zukunft in der Sonne. Windowsler werden dann sehen, in welche 
Richtung die Softwareentwickler abwandern, und neue Spiele wird es erst f&uuml;r 
Amiga, dann f&uuml;r Windows, PSX und N64 geben. F&uuml;r die Zukunft ist den Amiga ein 
Platz an der Sonne sicher!
<p>

<b>3.4. Das Ziel: Die glorreiche Revolution</b>
<p>
Am Ende werden wir von der &quot;glorreichen Revolution&quot; sprechen, eine Revolution,
die in die Geschichte eingehen wird. Wenn am Ende jedermann, vom einfachen 
Arbeiter und Sch&uuml;ler bis hin zum Manager und Pr&auml;sidenten, einen Amiga besitzen 
wird, und dieser der Computer ist, der das Internet als einziger beherrscht und 
auch sonst die absolute Nummer eins sein wird, dann hat sich unser Bem&uuml;hen 
gelohnt. Gelingen kann eine solche Revolution nur durch au&szlig;ergew&ouml;hnliche Leute 
wie uns, die auch im Stande sind, etwas zu bewegen. Wenn in nicht allzuweiter
Zukunft das letzte verbliebene PC-Heft im Vorwort schreiben wird, da&szlig; das Heft 
leider nur noch jeden zweiten Monat erscheint, da es einfach keine 
Neuentwicklungen mehr gibt, dann ist der Zusammenschlu&szlig; von der AG und dem Amiga 
Magazin, sowie das g&auml;nzliche Verschwinden von der AJ ger&auml;cht. Dann werden im 
Zeitschriftenhandel in der Computerecke 90% Amiga-Hefte stehen, der Rest
verteilt sich auf Spielekonsolen und verbliebene Computermagazine aus den alten 
Tagen. Wenn man im Internet surft und 95% des gesamten Netzes nur den 
Amiga-Besitzern zug&auml;nglich sind, weil die Browser auf den anderen Systemen nicht 
weit genug entwickelt sind, dann k&ouml;nnen wir uns gl&uuml;cklich zur&uuml;cklehnen und Stolz 
auf das sein, was ein paar verbliebene Amiga-Veteranen am Ende des
20.Jahrhunderts ins Rollen gebracht haben. &quot;Die glorreiche Revolution&quot; wird dann
vollendet sein.
<p>


<b>4. Amigianer aller Welt vereinigt Euch!</b>
<p>
Die Zeit ist reif, da&szlig; wir zur&uuml;ckschlagen. Die Revolution kann sich lange 
hinziehen, doch wird sie niemals mehr zu stoppen sein, und am Ende werden wir 
den Sieg f&uuml;r uns beanspruchen k&ouml;nnen. Der Amiga wird die absolute Nummer eins
sein und damit erf&uuml;llen wir uns endg&uuml;ltig einen Traum. Genauso wie der Amiga ein
Traum ist, sind seine Anh&auml;nger Tr&auml;umer, und diese werden den Traum wahr und der 
ganzen Welt zug&auml;nglich machen. Wir m&uuml;ssen uns vereinigen, denn zusammen sind wir 
stark. Am Ende wird der Erfolg stehen und ich freue mich auf die Revolution und 
die anschlie&szlig;ende Zeit, wo ich nicht mehr 100 Kilometer weit fahren mu&szlig;, um f&uuml;r 
meinen Computer - meinen Amiga - kompetente Beratung und guten Support zu 
bekommen. Dann wird in jedem Dorf ein autorisierter Amiga-H&auml;ndler sein, und alle 
werden gl&uuml;cklich sein, das gr&ouml;&szlig;te Virus der Geschichte ist dann endg&uuml;ltig 
besiegt.
<p>


<b>5. Anhang</b>
<p>
Dies ist eine &uuml;berarbeitete Version der Amiga-Revolution. &Uuml;berarbeitet wurde sie 
von Prof. BSE, der sich gl&uuml;cklicherweise dem AR-Team angeschlossen hat. Ohne 
seine Unterst&uuml;tzung w&auml;re dieses geschichtlich sehr wichtige Dokumente immer noch 
mit Fehlern &uuml;berf&uuml;llt, was mir schon lange ein Dorn im Auge war, jedoch konnte 
ich nie so richtig dagegen ank&auml;mpfen :-)  An dieser Stelle m&ouml;chte ich allen 
Menschen danken, die sich diese Revolution zu Herzen nehmen und zu dem machen, 
was sie einmal werden soll. 
<p>
Jack Miller
<p>

Dieses Manifest(3.5) wurde in den Bereichen 3.1, 3.2 und im Vorwort an unsere 
aktuelle Ideologie angepa&szlig;t. Die darauffolgenden Punkte sollten mit verminderter 
Ernsthaftigkeit zur Kenntnis genommen werden. Ansonsten verweise ich auf das 
AR-Manifest Version 4, welches komplett &uuml;berarbeitet wird und sp&auml;testens Ende 
August ver&ouml;ffentlicht wird.
Prof. BSE
<p>
In Hoffnung auf eine gute Zukunft
<p>
Jack Miller , Prof. BSE ; 3. Juli 1998
</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="help.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="rubrik.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="ar2.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
