<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Spieleteil</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/game.gif"  alt="Spiele">
<h1>WET</h1>
<b>The sexy Empire</b>
<p><img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


Eigentlich war es eine klare Sache. Der Sheriff hatte das Kaff verlassen
und somit konnten Betty, Billy und ich die Bank der West Buffallo Company
ausrauben. Jedoch stellte man sich dort etwas quer, Billy quitierte
das Problem mit einer Kugel und wir verschwanden dicht gefolgt vom
Hilfssherriff. Dieser hatte zwar platte Reifen, aber trotzdem heizte er
uns mit seinem Gewwehr ein. Circa 50 Milen au&szlig;erhalb hielten wir an und
mir wurde mit einer Pistole am Kopf verst&auml;ndlich gemacht, da&szlig; weder Billy
noch Betty lust hatten mit mir weiterzufahren. Also ging ich zur&uuml;ck nach
Wet Rock. Dort traf ich Lula, sie wollte Schauspielerin werden, aber au&szlig;er
ein paar liegenden Rollen fand sie nichts. Aus diesem Grund, wollte sie
nach Las Vegas. Ihre Reise nahm aber ein schnelles Ende und so landete sie
in dem W&uuml;stenkaff Wet Rock, wo ich sie kennengelernt habe. Nach einer
kurzen und hei&szlig;en Affaire bot ich ihr an, doch noch Karriere zu machen -
was sie dankbar annahm.
<p>
Diese Geschichte wird dem Spieler durch ein knapp 4 min&uuml;tiges Intro
dargestellt. Die vorkommende Sprachausgabe ist wirklich hervorragend,
denn auch ohne Soundkarte ist sie sehr deutlich und ohne knistern im
Hintergrund zu vernehmen. Das Comic Intro wurde auch grafisch gut in
Szene gesetzt, jedoch ist ein 68040 mindestens anzuraten, um es fl&uuml;ssig
zu sehen.

</td></tr></table>
<p><img src="../pic/wet_westernstadt.jpg" border=0 alt="Die Westernstadt" width=637 height=435>
<p><table width=75%><tr><td>
Das Spiel

<p>
WET ist in drei Stufen eingeteilt. Begonnen wird, wie anfangs erw&auml;hnt,
in Wet Rock (Stufe 1). Auch in WET hat der Tag 24 Stunden und die k&ouml;nnen
schnell vorbeigehen. Betty, die Ex-Komplizin, hat auch noch daf&uuml;r gesorgt, 
da&szlig; das FBI hinter einem her ist und deshalb mu&szlig; man schnell handeln.
Viel Zeit bleibt einem also nicht, so da&szlig; man in wenigen Tagen viel Geld
auftreiben mu&szlig;, um Wet Rock zu verlassen. Als angehender Produzent 
schl&uuml;pfrieger Filme, besorgt man sich erstmal eine Kameraausr&uuml;stung und
&quot;Spielzeug&quot; f&uuml;r Lula. In der Bar von Wet Rock kann man Lula als 
Unterhalterin auftreten lassen, neben der M&ouml;glichkeit Leute zu erpressen 
oder zu verpr&uuml;geln, die einzige Chance an das n&ouml;tige finanzielle Polster
zu gelangen. Lula ist sehr hilfsbereit und Aktfotos stellen kein Problem
da, der anschlie&szlig;ende Verkauf der Foto`s bringt auch wieder Geld. Das 
Gesch&auml;ft ist hart, p&uuml;nktliches Zahlen der Miete, kauf von Untensilien
und und und. Wenn man es aber geschafft hat und soviel Kies hat um Wet
Rock den R&uuml;cken zu kehren, so beginnt Stufe 2 des Spieles.<br>
In besserer Umgebung und mit mehr Mitteln kann man nun richtig ins
Gesch&auml;ft einsteigen. Filme drehen und verleihen, Geb&auml;ude mieten oder 
kaufen und im Castingb&uuml;ro geignete Schauspieler finden, sowie alles
organisatorische kl&auml;ren. Neben der Bearbeitung eines Filmes (vertonen,
mit einer Titelsequenz versehen und so weiter) kann man auch richtig
Werbung betreiben, Ziel der zweiten Spielstufe ist es einen Gewinn von
ungef&auml;hr 2 Millionen Dollar zu erzielen. Hat man das geschafft steigt man
in die dritte Spielstufe ein. Nun hei&szlig;t es richtig Kohle zu machen.
Er&ouml;ffnen von Erotikshops in der gesamten USA und die Versorgung dieser
L&auml;den steht nun an. Zeit ist Geld und es ist eigentlich nur noch wichtig
Moneten zu scheffeln und wenn einem das gelungen ist, kann man das gr&ouml;&szlig;te
aller Ziele verwirklichen: Einen Fernsehsatelliten ins All schicken und
mit den eigenen Filmen welteweit auf Sendung gehen, doch bis das geschieht,
wird noch viel Zeit vergehen!


</td></tr></table>
<p><img src="../pic/wet_polizei.jpg" border=0 alt="Die Polizei" width=541 height=442>
<p><table width=75%><tr><td>
Gameplay

<p>
Der alte Mauspfeil ist eben out, dies bewei&szlig;t uns auch NEW GENERATION
Software. Anstatt des Pfeiles gibt es die Hauptdarstellerin Lula stark
verkleinert zu sehen. Befindet man sich &uuml;ber einem betrettbaren Geb&auml;ude
oder benutzbaren Gegenstand, so l&auml;&szlig;t Lula alle H&uuml;llen fallen. Will man
irgendeine Sache (zum Beispiel: der Kauf eines Spielzeuges), hat man
die M&ouml;glichkeit dies abzusegnen, in dem man auf den &quot;Daumen&quot; klickt, oder
abbricht, in dem man auf das &quot;Klo&quot;-Icon dr&uuml;ckt. Ansonsten gestaltet sich
das Gameplay nicht weiter abwechslungsreich, benutzbare Utensilien werden
mit Namen und einer nackten Lula kenntlich gemacht. Das wichtigste ist
aber die Men&uuml;leiste am unteren Bildschirmrand, welche einem den Kontostand,
die aktuelle Zeit und das Datum. Dies sollte man gut im Auge behalten,
damit man nicht vorzeitig Pleite geht oder sich zu lange in Wet Rock
aufh&auml;lt und dadurch vom FBI geschnappt wird.

<u>  </u>
</td></tr></table>
<p><img src="../pic/wet_verleih.jpg" border=0 alt="Der Verleiher" width=560 height=403>
<p><table width=75%><tr><td>
Grafik &amp; Sound
<p>
Am Ende jeden Tages (in Spielstufe 1) gibt es die &quot;SM-News&quot;. Sie
berichten &uuml;ber den &Uuml;berfall und &uuml;ber den derzeitigen Stand der
Ermittlungen. Diese Nachrichtensendung, sowie Intro und Extro
sind mit Sprachausgabe versehen worden, die sehr gut ist. Andere
Spiele nutzen ja meist AHI, was auf Amiga`s ohne Soundkarte zum
knistern f&uuml;hrt, doch bei WET ist das nicht der Fall! Die Musik
ist immer oder sagen wir mal oft, auf den jeweiligen Ort bezogen
und pa&szlig;t gut zum Geschehen. Grafisch gibt es volle 256 Farben
im Comic Stil zu bewundern. Neben vielen kleinen Animationen
im Hintergrund, werden auch andere &quot;Bewegungsabl&auml;ufe&quot; detailiert
und lustig dargestellt. Es ist auf dem Bildschirm immer etwas 
los und es wird nie langweilig. V&ouml;gel kann man abschie&szlig;en, 
aufdringliche Menschen erleben und teilweise gibt es auch 
eingescannte Fotografien zu sehen. Man sollte aber schon eine
Grafikkarte besitzen, sowie einen schnellen Prozessor um die
Zwischenanimationen in annehmbarer Geschwindigkeit betrachten
zu k&ouml;nnen. Bei normalen AGA Amiga`s tritt leider auch eine
kleine Zeitverz&ouml;gerung auf, wenn man den Handlunsgort wechselt.

<p>
Hardwarevorraussetzungen

<p>
WET ist hier etwas anspruchsvoll, obwohl ein normaler AGA Amiga mit
Festplatte, 8 MB Ram und 4-fach CD Laufwerk reicht, sollte man 
mindestens einen 68030 Prozessor mit 16 MB und ca. 160 MB 
Festplattenspeicher und ein 8-fach CD Laufwerk zur Verf&uuml;gung haben.
Grafikkarten werden nat&uuml;rlich auch unterst&uuml;tzt. 

<p><table><tr><td>
Fazit:
<br>
WET ist sehr lustig, ob sadistische Spr&uuml;che, erotische T&auml;tigkeiten, 
anz&uuml;gliche Gehsten oder bestechliche Personen, alles ist vorhanden.
Diese bunte Mischung ist ein Garant f&uuml;r lange Abende am heimischen
Computer und wer &quot;Biing!&quot; kennt, wird mit WET voll auf seine Kosten
kommen. Leicht ist es zwar nicht gerade und man mu&szlig; &uuml;berlegt handeln,
damit der werdende Multikonzern nicht in den Kinderschuhen stecken 
bleibt, aber welche Wirtschaftssimulation ist schon einfach? WET bietet
erstklassige Grafik und tolle Animationen, gepaart mit Sprachausgabe
und witzigem Sound/FX. Ein fantastisches Spiel, bei dem vorallem der
Humor nicht zu kurz kommt. Einziges (moralisches) Manko: WET sollte
man mit einer Altersgrenze versehen, da es doch sehr freiz&uuml;gige
Darsteller beinhaltet und einige Dialoge nicht ganz ohne sind - eben
genrebezogen! WETten, das es Dir auch gef&auml;llt?!!<br>
<b><i>- Empfehlenswert - </i></b>
</td><td><img src="../pic/award.gif" alt="Award" width=111 height=111></td></tr></table>

<p>&nbsp;</p>
Quelle: NEW GENERATION SOFTWARE

<p>
<img src="../pic/mn.gif" alt="mn" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="game1.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="game.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="game3.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

