<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/soft.gif"  alt="Software">
<h1>GlobalTrash 1.3</h1>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>
Ein gro&szlig;er Mangel der Workbench des AmigaOS ist das M&uuml;lleimersystem. Es
verschiebt Dateien einfach nur in ein bestimmtes Verzeichnis auf dem Datentr&auml;ger und stellt einen neuen Men&uuml;punkt f&uuml;r diese Verzeichnisse bereit.
Ein laufwerks&uuml;bergreifender M&uuml;lleimer existiert ebensowenig wie zus&auml;tzliche Funktionen, die ihn eigentlich erst benutzbar machen.
<p>
Im Aminet gibt es GlobalTrash das diesem Manko abhilfe schaft und ein 
einziges Piktogramm f&uuml;r alle M&uuml;lleimer bereitstellt mit zus&auml;tzlichen 
Funktionen. Die Hauptmerkmale im Kurz&uuml;berblick:
<ul><li> Zentrales AppIcon f&uuml;r alle Laufwerke
<li> Fontsensitive und ansprechende Oberfl&auml;che
<li> Einf&uuml;hrung eines globalen M&uuml;lleimers mit dem Inhalt aller Dateien in
  s&auml;mtlichen Trashcan-Verzeichnissen der Laufwerke
<li> S&auml;mtliche Trashcan-Verzeichnisse sind gleichzeitig auch einzeln ansprechbar
<li> Automatisches L&ouml;schen von Dateien nach einer f&uuml;r jedes Laufwerk
  einzeln einstellbaren &quot;Verweildauer&quot; im M&uuml;lleimer in Tagen. Dadurch
  wird der M&uuml;lleimer zu einer perfekten Einstellung der Backuppfade 
  verschiedener Programme (z.B. GoldED, PageStream, ...)
<li> M&ouml;glichkeit, f&uuml;r jedes Laufwerk einen definierbaren AmigaDOS-Befehl
  zu starten (z.B. Auswurf von ZIP-Datentr&auml;gern)
<li> CLI-/Shell-Kommando GlobalTrashClient als externes Interface (Nutzung
  von GlobalTrash durch Programme wie DirectoryOpus oder ToolManger 
  m&ouml;glich)
<li> Abfragerequester mit umfangreichen Wahlm&ouml;glichkeiten
<li> Fortschrittsanzeiger
<li> Korrekte Handhabung doppelter Dateinamen beim Verschieben in den M&uuml;lleimer
<li> Restaurierungsfunktion, die eine Datei in ihrem alten Pfad mit dem
  originalen Dateinamen wiederherstellt
<li> Verzeichnisbaumdarstellung von Verzeichnissen und M&ouml;glichkeit der
  Manipulation einzelner Dateien (Restaurieren, L&ouml;schen) aus dem Verzeichnisbaum
<li> Automatische Erkennung und Registrierung von neuen Dateien, die nicht
  von GlobalTrash in das Trashcan-Verzeichnis kopiert wurden - in so 
  einem Fall aber ohne Kenntnis des Originalpfades
<li> Restaurieren auch laufwerks&uuml;bergreifend m&ouml;glich.
<li> Korrekte Handhabung der '#?.info'-Dateien.
uvm.</ul>

<b>Voraussetzungen!</b> <br>
Dieses Programm ben&ouml;tigt:
<ul><li> Einen Computer mit AmigaOS (Amiga&copy; oder auch Draco&copy;)
<li> Mind. AmigaOS 3.0
<li> ca. 80-100KByte freien Speicher
<li> 'Copy'-Befehl im Pfad f&uuml;r die laufwerks&uuml;bergreifende Restaurierungs-
   funktion (wird in einer nachfolgenden Version ge&auml;ndert)
<li> und selbstverst&auml;ndlich Laufwerke mit Trashcan-Verzeichnis</ul>

GlobalTrash ist ganz einfach zu benutzen:<br>
Man kann &uuml;ber die Workbench eine oder mehrere Dateien auf das AppIcon 
werfen; diese Dateien werden dann in das Trashcan-Verzeichnis des jeweiligen Datentr&auml;gers verschoben oder (falls auf diesem Datentr&auml;ger kein
Trashcan-Verzeichnis existiert) sofort gel&ouml;scht. Vor jeder L&ouml;schaktion
erfolgt noch eine Sicherheitsabfrage (die man aber auch &uuml;ber den Voreinsteller ausstellen kann). GlobalTrash bietet auch noch ein Hauptfenster&nbsp;,
&uuml;ber das man alle weiteren Funktionen aufrufen kann. Dieses Fenster wird
ge&ouml;ffnet, indem man auf das Piktogramm (AppIcon) doppelt klickt, das 
Programm erneut startet, den Hotkey benutzt oder die Anzeige per Exchange
&ouml;ffnet. Ein Eintrag im Tools-Men&uuml; der Workbench wird auch vorgenommen. 
Dieser verh&auml;lt sich identisch wie das AppIcon (Anwahl f&uuml;hrt zum &Ouml;ffnen 
des Hauptfenster&nbsp; oder es werden - falls Piktogramme angew&auml;hlt sind - 
die L&ouml;sch- oder Verschiebeaktionen durchgef&uuml;hrt - als wenn man die Piktogramme auf das AppIcon legen w&uuml;rde).
<p>
<b>Das Hauptfenster</b></td></tr></table>
<img src="../pic/global.gif" alt="bild" width=677 height=301>
<table width="75%"><tr><td>
Im Hauptfenster werden s&auml;mtliche &uuml;ber die L&ouml;schfunktionen hinausgehenden
Funktionen bereitgestellt; es ist die zentrale Anlaufstelle f&uuml;r dieses
M&uuml;lleimersystem.
<p>
Das Gadget Aktueller M&uuml;lleimer bestimmt, welche Dateien im darunterlie
genden Listview-Gadget angezeigt werden. Zur Auswahl stehen hier 'Global'
und die Namen jedes Laufwerks mit Trashcan-Verzeichnis. Bei Anwahl von 
'Global' bekommt man eine nach Namen sortierte Auflistung aller Dateien
aus den Trashcan-Verzeichnissen aller Laufwerke angezeigt. Eine Auswahl
eines einzelnen Laufwerkes hat die Auflistung aller Dateien im Trashcan-
Verzeichnis dieses Laufwerkes zur Folge. Die linken Gadgets f&uuml;hren eine
der gegebenen Aktionen aus und k&ouml;nnen alternativ zum Doppelklick benutzt
werden:
<p>
<i>Restaurieren: </i><br>
Verschiebt die angew&auml;hlte Datei an ihre urspr&uuml;ngliche Position.
<p>
<i>Restaurieren&nbsp;als: </i> <br>
&Ouml;ffnet f&uuml;r jede Datei ein Filerequester, in dem man den Pfad und 
den Dateinamen &auml;ndern kann. Ist der Ursprung bekannt, so wird dieser
vorgeschlagen.
<p>
<i>L&ouml;schen: </i><br>
L&ouml;scht die Datei.
<p>
<i>Anzeigen: </i><br>
Zeigt die angew&auml;hlten Dateien an; hierbei wird der Typ ber&uuml;cksichtigt.
Diese Funktion steht erst ab Version 1.4 von GlobalTrash zur Verf&uuml;gung !
<p>
<i>M&uuml;lleimer&nbsp;leeren: </i> <br>
L&ouml;scht s&auml;mtliche Dateien im Listview
 <p>
<i>Verbergen: </i> <br>
Schlie&szlig;t das Hauptfenster und GlobalTrash wartet wieder im Hintergrund.
<p>
Den Mittelpunkt der GUI-Implementierung stellt aber das Listview Gadget
dar. Hier bekommt man den Inhalt des oder der M&uuml;lleimer angezeigt. Jeder
Eintrag setzt sich aus folgenden Spalten zusammen:
<p>
<i>Name: </i> <br>
zeigt den Dateinamen im Trashcan-Verzeichnis an. Vor dem Namen befindet 
sich noch ein Image, welches den Dateityp kennzeichnet - falls dieser 
dem Programm bekannt ist. Wenn der Eintrag ein Verzeichnis darstellt, 
kommt ein weiteres Element hinzu: der Verzeichnispfeil. Wenn man auf 
diesen klickt, so &quot;klappt&quot; das Verzeichnis auf und man kann die Dateien
in diesem Verzeichnis ebenfalls manipulieren.
<p>
<i>Gr&ouml;&szlig;e: </i><br>
Zeigt die Dateigr&ouml;&szlig;e inkl. der Gr&ouml;&szlig;e der Icon-Datei an.
<p>
<i>Restzeit: </i> <br>
gibt die Anzahl der noch restlichen &quot;Verweildauer&quot; an. Nach dieser Zeit
wird diese Datei automatisch gel&ouml;scht. Ist die &quot;Verweildauer&quot; deaktiviert,
wird hier angegeben.
<p>
<i>Ursprung: </i><br>
Gibt den urspr&uuml;nglichen Pfad (inkl. des urspr&uuml;nglichem Namens) an. Falls
dort nur ein Laufwerksname steht (z.B. 'Work:'), so ist die Datei manuell
und nicht &uuml;ber GlobalTrash verschoben worden und der Ursprung ist daher 
nicht bekannt. Das Kommando 'Restaurieren' fragt dann nach einem Pfad.
<p>
Im ListView Gadget kann man mehrere Dateien selektieren oder deselektieren.
Dazu mu&szlig; man einfach nur einfach mit der Maus jede Datei anw&auml;hlen bzw. 
Maustaste gedr&uuml;ckt halten und die Maus nach oben oder unten verschieben
- kein zus&auml;tzliches Bet&auml;tigen der &#060;SHIFT&#062; Taste ist dazu n&ouml;tig. Ein Dop-
pelklick f&uuml;hrt den aktuellen Befehl auf alle angew&auml;hlten Dateien (inkl.
der doppeltgeklickten Datei) aus. Zus&auml;tzlich kann man die einzelnen Spalten
sortieren lassen. Standarm&auml;&szlig;ig wird immer nach dem Namen sortiert - man
kann dies &auml;ndern, indem man einfach den entsprechenden Titel mit der linken Maustaste anw&auml;hlt.
<p>
<b>Die Men&uuml;s des Hauptfensters </b> <br>
GlobalTrash bietet folgende Men&uuml;punkte in seinem Hauptfenster an:
<p>
<i>Auffrischen: </i> <br>
Liest den Inhalt des aktuellen M&uuml;lleimers neu ein (falls der globale
M&uuml;lleimer angew&auml;hlt ist, werden die Trashcan-Verzeichnisse s&auml;mtlicher
Laufwerke neu eingelesen).
<p>
<i>Laufwerksliste: </i><br>
Sucht nach Trashcan-Verzeichnisses auf s&auml;mtlichen zur Zeit im System
angemeldeten Laufwerken und aktualisiert die Laufwerksliste (z.B. 
falls ein Trashcan-Verzeichnis auf einem Laufwerk neu erstellt wurde).
 <p>
<i>Alles anw&auml;hlen: </i><br>
W&auml;hlt alle Eintr&auml;ge im Listview an.
<p>
<i>Alles abw&auml;hlen: </i><br>
L&ouml;scht alle Selektierungen im Listview.
 <p>
<i>Invertieren: </i> <br>
W&auml;hlt alle nicht selektierten Eintr&auml;ge an und alle selektierten Eintr&auml;ge
ab.
<p>
<i>Gr&ouml;&szlig;e&nbsp;berechnen:</i><br>
Berechnet die Gr&ouml;&szlig;e der angew&auml;hlten Verzeichnisse rekursiv; gleichzeitig
frischt es die Gr&ouml;&szlig;e der angew&auml;hlten Dateien auf.
<p>
<b>Einstellungen</b> <br>
Man kann GlobalTrash nach eigenen Vorstellungen konfigurieren und somit
seinen Bed&uuml;rfnissen anpassen. Dazu stehen, abgesehen von den Men&uuml;punkten,
folgende Optionsgruppen bereit:
<p>
<i>Allgemein: </i><ul>
<li> Befehl (Doppelklick): <br>
   W&auml;hlt den auszuf&uuml;hrenden Befehl, falls ein Doppelklick auf eine 
   Datei im Listview erfolgt.

<li> WB-Piktogrammname:<br>
   Gibt den Namen des AppIcons an, das GlobalTrash auf der Workbench
   anmeldet und somit unterhalb des Piktogrammes auf der Workbench er-
   scheint - ein leerer Eintrag schaltet das AppIcon aus.

<li> WB-Men&uuml;name:<br>
   Gibt den Namen des Men&uuml;eintrages im Toolsmen&uuml; der Workbench) an -
   ein leerer Eintrag schaltet diesen Men&uuml;eintrag ab.

<li> Standardfunktion: <br>
   Dient zur Definition eines AmigaDOS-Programmes, das bei Ablage
   eines Laufwerksicons ausgef&uuml;hrt werden soll.

<li> Standardl&ouml;schzeit: <br>
   Gibt die 'Verweildauer' an, mit der neue und f&uuml;r GlobalTrash bisher
   unbekannte Datentr&auml;ger initialisiert werden.
</ul>
<i>Oberfl&auml;che: </i><ul>
<li> Zusatzabstand: <br>
   Gibt einen Zusatzabstand (in Pixel) zwischen einzelnen Eintr&auml;gen 
   im ListView an.

<li> Zeichensatz: <br>
   W&auml;hlt den Zeichensatz f&uuml;r alle Fenster.

<li> Icon (leer): <br>
   Gibt den Dateinamen f&uuml;r das Icon an, das als AppIcon benutzt
   werden soll, falls gerade alle M&uuml;lleimer keinen Inhalt haben.

<li> Icon (voll): <br>
   Gibt den Dateinamen f&uuml;r das Icon an, das als AppIcon benutzt
   werden soll, falls sich mind. eine Datei in einem Trashcan-
   Verzeichnis befindet.

<li> Holen:    <br>
   &Ouml;ffnet ein Requester zur Auswahl des Fonts bzw. der Icons - je 
   nachdem, zu welchem Gadget es geh&ouml;rt.

<li> Fixieren...: <br>
   Dient zur Fixierung des AppIcons an seiner jetzigen Position.
</ul>
<i>Datentr&auml;ger: </i><ul>
<li> M&uuml;lleimer: <br>
   W&auml;hlt den aktuellen M&uuml;lleimer f&uuml;r die n&auml;chsten beiden Gadgets.

<li> Laufwerksfunktion:  <br>
   Dient zur Definition eines AmigaDOS-Programmes, das bei Ablage 
   des Laufwerksicons ausgef&uuml;hrt werden soll.

<li> L&ouml;schzeit: <br>
   Definiert die 'Verweildauer' der Dateien bis zum automatischen
   L&ouml;schen.
</ul>
<i>Verschiedenes: </i><ul>
<li> Best&auml;tigung (...): <br>
   Schaltet die Sicherheitsabfrage beim L&ouml;schen oder Restaurieren
   an oder aus.

<li> Baumstruktur&nbsp;speichern: <br>
   Veranla&szlig;t GlobalTrash, die Baumstruktur mit abzuspeichern. Dadurch 
   werden beim n&auml;chsten Programmstart alle bisher aufgeklappten Verzeichnisse noch aufgeklappt sein.
</ul>
<b>Die Abfragerequester</b> <br>
Da GlobalTrash nicht eigenm&auml;chtig handeln kann bzw. soll, stellt es
mit den Abfragerequestern R&uuml;ckfragen an den Benutzer, wenn die Sicherheitsabfrage-Option des Einstellers aktiviert ist.
<ul>
<li> L&ouml;schen: <br>
   Immer dann, wenn der Benutzer eine Datei l&ouml;schen will fragt Global
   Trash, ob diese Datei auch wirklich zu l&ouml;schen ist.

<li> Neuer&nbsp;M&uuml;lleimer: <br>
   Falls auf dem aktuellen Laufwerk kein Trashcan-Verzeichnis existiert.

<li> L&ouml;schschutz:  <br>
   Es kann passieren, da&szlig; eine Datei, die zu l&ouml;schen ist, l&ouml;schge-
   sch&uuml;tzt ist.

<li> Restaurieren: <br>
   Wenn eine Datei, von der der Urspung bekannt ist, restauriert werden 
   soll, erfolt eine Sicherheitsabfrage. Sollte die Datei im Ursprungspfad
   schon vorhanden sein, so erfolgt eine weitere Abfrage.

<li> abgelaufene&nbsp;Dateien: <br>
   Eine herausragende Eigenschaft von GlobalTrash ist das automatische
   L&ouml;schen von Dateien, die schon eine gewisse Zeit in dem M&uuml;lleimer 
   liegen. Bevor diese Dateien allerdings gel&ouml;scht werden , wird der 
   Benutzer mit Hilfe dieses Requesters darauf aufmerksam gemacht, da&szlig;
   Dateien zum automatischen L&ouml;schen anstehen.
</ul>
</b>Fazit:</b>
<table><tr><td>
GlobalTrash ist Mailware (unentgeltlich registrierungspflichtig) und ist
ein keiner Weise eingeschr&auml;nkt und vollst&auml;ndig benutzbar. Bevor ich Global-
Trash installiert hatte, hatte ich gar keine Trashcan`s auf meiner Festplatte. Den einfach die Daten verschieben ist mit Dopus ja kein Problem,
nun habe ich aber GlobalTrash in Dopus eingebunden und jetzt macht es 
einen Sinn Trashcan`s auf den Laufwerken zu haben.<br>
<b><i>- Empfelenswert - </i></b></td><td><img src="../pic/award.gif" alt="AT - Award" width=111 height=111></td></tr></table>
<p>
Quelle:<br> Aminet: util/wb/GlobalTrash.lha <br>
        WWW: <a href="http://home.pages.de/~bolli">http://home.pages.de/~bolli</a>



<p>
<img src="../pic/sk.gif" alt="sk" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft2.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
