<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/soft.gif"  alt="Software">
<h1>Wildfire7 / PPC</h1>
<b>animations Software in hochform</b>

<p><img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

Wildfire7PPC ist die zweite Generation eines neuen und
m&auml;chtigen Konzept zur Bild-und Animationsbearbeitung zu erzeugen.
<p>
Der `normale` Weg der Bildbearbeitung ist es, eine oder mehrere Operationen
(z.B. Skalieren, Mischen, ...) auf ein Eingabe-Bild anzuwenden. Zum Schluss
wird das Ergebnis abgespeichert und normalerweise gehen alle Informationen
&uuml;ber die Art und Weise der Ver&auml;nderung verloren.<br>
Der `normale` Weg der Animationsbearbeitung ist es, eine Animation von einem
Format in ein anderes zu konvertieren, mehrere Animationen zu kombinieren
oder einige vordefinierte Effekte auf Animationen anzuwenden.
In Wildfire7 PPC sind diese beiden Operationen nur zwei ganz einfache
Spezialf&auml;lle des einzigartigen Konzeptes:<br>
Abstrakte Grafik &quot;Str&ouml;me&quot; (Streams)
Anstelle von dem einlesen von einzelnen Bildern oder Animationen bearbeitet
Wildfire sogenannte `Streams`. Nat&uuml;rlich werden im Endeffekt nichts anderes
als Einzelbilder oder Animationen gelesen/gespeichert, aber f&uuml;r den Prozess
der Bildbearbeitung ist der spezielle Typ der Grafiken nicht von Interesse.
<p>
&Uuml;berlagerung von Effekten
<p>
Jeder `Prozess` ist eine &Uuml;berlagerung von einem oder mehrerer Effeekte.
Wildfire7 PPC enth&auml;lt &uuml;ber 100 Effekt-PlugIns, die (fast) uneingschr&auml;nkt
kombiniert werden k&ouml;nnen. Die Kombination der Effekte wird auf der Effekt 
Seite dargestellt. Dort k&ouml;nnen Sie so viele Effekte wie sie wollen verkn&uuml;pfen.
<p>
Bild Puffer
<p>
Sie sind nat&uuml;rlich nicht darauf eingeschr&auml;nkt, nur ein Bild gleichzeitig zu 
bearbeiten (Es gibt eigentlich keine Einschr&auml;nkung). Eine Animation wurde geladen,
dann bearbeitet (rotiert, ausgeschnitten, vergr&ouml;ssert) und dann gespeichert.
Jedoch gibt es viele Effekte, die mehr als nur eine Eingabe verwenden.
<p>
Solche (etwas komplizierteren) Operationen werden mittels der sogenannten 
`Temp-Puffer` in Wildfire gel&ouml;st. Als Vorgabe werden alle Operatoren auf
das `Standard` Bild angewandt. Dieses `Standard` Bild (das Bild, was als 
Einzelbild geladen oder aus einer Animation extrahiert wurde) befindet sich
immer in einem Puffer, dem sogenannten `Stream` Puffer. Weiterhin gibt es 11 
andere Puffer: 7 Temp-Puffer und 4 3D Puffer.
<p>
Jedes Effekt PlugIn hat mindestens zwei Parameter: den Namen des Eingabe Puffers 
(das zu ver&auml;ndernde Bild) und den Namen des Ausgabe Puffers
(das moifizierte Resultat). Als Vorgabe sind diese beiden Werte als `Stream`
initialisiert. Im linearen Effekt Modus k&ouml;nnen Sie dies ver&auml;ndern und auch
jeden der 7 Temp Puffer als Ein-und Ausgabe verwenden. Somit k&ouml;nnen Sie 
gleichzeitig 8 Bilder zur gleichen Zeit im Speicher behalten und mittels 
zweier Spezieller PlugIns weitere Bilder jederzit laden oder speichern.
Einige Effkt-PlugIns haben mehrere m&ouml;gliche Eingaben. Somit kann man damit 
Bilder kombinieren.
<p>

Anstatt nur fest vorgegeben zu sein, kann jeder Parameter eines Effektes 
zeitabh&auml;ngig animiert werden. Anstelle eines festen Wertes benutzt man in
Wildfire dazu eine Variable. Der zeitliche Verlauf der Variablen wird durch 
eine Spline-Kurve, den sogenannten `Envelop`, definiert. Somit kann man bei
jedem beliebigen Bild der Animation/Sequenz die Effekt Parameter &uuml;ndern.
<p>
Um es ganz einfach auszudr&uuml;cken, man kann Wildfire als eine Kombination eines
(sehr m&auml;chtigen) Bildverarbeitungsprogrammes und eines Animations-Konverters
ansehen. Somit besteht aus aus zwei Haupt-Programmteilen:
Der Konverter und der Spezial Effekt Prozessor.
Im Konverter (auf der Projekt Seite) w&auml;hlen Sie den Grafik-`Stream` aus und im 
Prozessor bestimmen Sie die Spezialeffekte (deshalb wird diese Seite auch
Effekte genannt), die Variablen, die Berechnungs-Einstellungen u.s.w.
<p>
<b>Die 3 Seiten</b>
<p>
Projekt
<p>
Hier kann man sein jeweiliges Projekt erstellen. Dazu geh&ouml;ren unter anderem
die Eingabe, Ausgabe, die Art der verwendeten Effekte und der Vorschau-Type,
der benutzt werden soll. Weiterhin kann man spezielle Bereiche der sogenannten
`Sessions` einstellen, die bearbeitet werden sollen.
Weiterhin werden Sie hier dann die Berechnung `in Gang setzen`. Mittels der
Schaltfl&auml;chen `Einzelbild` und `Konvertieren` k&ouml;nnen Sie einzelne Bilder oder
ganze Bildsequenzen/Animationen erstellen.
<p>
Effekte
<p>
Auf dieser Seite bestimmen Sie die Effekte, die zwischen Ein-und Ausgabe eingef&uuml;gt 
werden. s ist auch m&ouml;glich, die Effekte ganz auszuschalten. Dann weden die Bilder
direkt von der Eingabe zur Ausgabe geleitet. (falls Sie z.B. nur das Format einer
Animation &auml;ndern wollen.)
Abh&auml;ngig von der Effekt-Auswahl auf der Projekt Seite (Keine / Linear / Nicht Linear)
&auml;ndert diese Seite Ihr Erscheinungsbild.
<p>
Einstellungen
<p>
Die Einstellungen f&uuml;r das derzeitige Projekt (die Session) kann man auf dieser Seite
bestimmen. Bringen Sie dies nicht mit den Programmeinstellungen durcheinander. Die
Programm-Einstellungen gelten f&uuml;r das ganze Programm, die Optionen, die Sie hier
festlegen, sind f&uuml;r die derzeit bearbeitete Session g&uuml;ltig.
<p>
<b>Wildfire 7 test Tagebuch:</b>
<p>
Getestet wurde Wildfire auf einem Amiga 4000 Tower mit einer PowerUp Karte 
604e-200 Mhz / 040-25 Mhz, 80 MB Fastram und einer CyberVision PPC 8 MB. Mit
dieser configuration macht Wildfire richtig spass, dank PPC und Grafikkarten
unterst&uuml;zung. Auf dem 040 sollte man sich aber auf die 2d effekt beschr&auml;nken,
da die 3D Effekte sehr rechen intensiew sind. Eins vorweg Wildfire 7 ist die 
beste Software die ich seit langen gesehen habe, denn seit Maxon Cinema konnte
mich kein Programm mehr so begeistern!
<p>
Tag Eins: <br>
Ich kannte bis dahin nur eine Demo von Wildfire 5 mit der ich aber &uuml;berhaupt
nicht klar kann. Aber nach der instalation von Wildfire 7 (ca. 24 MB auf
Festplatte) war ich neugierig und starte erst mal Wildfire und wollte dan
nachlesen wenn ich nicht weiter weis. Lesen ? Wo zu ? Wildfire hat jetzt eine 
sehr gut gemachte und durchdachte MUI Oberfl&auml;che! Denn 5 minuten nach dem Start
von Wildfire war die erste kleine animation fertig f&uuml;r eine test berechnung.
Dank der sehr guten Online hilfe, wenn mann nicht weis wozu der buton gut ist
einfach die maus einen augenblick ruhig &uuml;ber den buton halten , wie man es von
MUI Programmen gewohnt ist.
<p><center><img src="../pic/wild5.jpg" alt="Bild" width=320 height=256></center>
<p>
Tag Zwei:<br>
Nun wollte ich aber doch mal ein wenig lesen, da war die n&auml;chste &uuml;berraschung.
eine sehr gut gemachte, optisch wie auch inhaltlich in deutsch und englisch,
HTML guide. Wo ich dann auch gleich auf ein menu aufmerksam wurde das ich bis
dahin &uuml;bersehen hatte. Das war die umstellung von Lineare auf Nichtlineare
Effekt Prozessor. Was zur folge hatte IBrowse kann in den hintergrund und
Wildfire wurde gestartet. Nach dem ich nun auf nicht linear umgestellt hatte,
kann ich aus dem staunen nicht mehr raus! Nun geht alles per Drag `n` Drop und
um die Bild Puffer braucht man sich jetzt nicht mehr zu k&uuml;mmern. Bewegt mann
nun den &quot;Ausgabe Bild regler&quot; sieht man gleich was sich beim n&auml;chsten Bild
ver&auml;ndert und selbst bei aufwendigen 3D effecten in fast echtzeit vorschau.
<br><a href="gfx.html">Nichtlineare Effekt Prozessor (Bild)</a>
<p>
Tag Drei:<br>
Endlich habe ich mir mal die zeit genommen in allerruhe zu lesen.
<p>
Tag Vier:<br>
Da bei meiner ganzen rumspielerei Wildfire nur einmahl h&auml;ngen geblieben ist.
Wollte ich nun wissen wie stabil l&auml;uft Wildfire wenn es mal richtig arbeiten
muss. Also habe ich eine animation mit vielen 2D und 3D effekten entworfen.
Nach dem das erste Bild berechnet war im requester zu lesen das er noch 8
Stunden f&uuml;r die berechnung der animation braucht. Also bin ich zu Bett
gegangen. Am morgen war die Animation fertig, kein anderes PPC Programm,
das ich habe, l&auml;uft so stabil!
<p><center><img src="../pic/wild4.jpg" alt="Bild" width=320 height=256></center>
<p>
Tag F&uuml;nf:<br>
Nun legte ich noch mal die Wildfire CD ein, den immerhin ist sie mit ca. 450 MB
Daten gef&uuml;llt. Wovon ca. 400 MB sehr guter und zahlreicher Beispiel Animationen
sind. Auch sonst ist alles auf der CD was man f&uuml;r Wildfire braucht, eine Demo von
MUI 3.8 , IBrowse und die ppc.library in der Version 46.19 . Im Verzeichnis Bonus
fand ich dan auch noch eine f&uuml;r Wildfire Regestrirte Version von Dust. Dust ist
eine Effect Software f&uuml;r die Raytracer Imagine,LightWave und Maxon Cinema die diese
zum Beispiel um ein Partikel-System erweitert.
<p>
<b>Systemanforderungen:</b>
<p>
Hardware:<br>
mindestens 68030 Processor mit FPU <br>
AGA oder Grafikkarte<br>
mindestens 600x420 Pixel Bildschirm zum starten <br>
mindestens 8 MB freier Speicher<br>
mindestens 30 MB freier Festplattenplatz
<p>
Software:<br>
mindestens Betriebssystem V39 (3.0)<br>
MUI 3.8<br>
wenn man eine PowerUp Karte hat:<br>
ppc.library Version 46.19 oder h&ouml;her
<p>
Empfohlen f&uuml;r herk&ouml;mmliche 2D Operationen in vollem Umfang:<br>
68030 FPU 50 MHZ<br>
AGA<br>
16 MB Speicher
<p>
Empfohlen f&uuml;r hochwertige 3D Spezial Effekte:<br>
68060 FPU 50 MHZ <br>
AGA<br>
32 MB Speicher
<p>
Empfohlen f&uuml;r High-End Operationen in proffesioneller Video Aufl&ouml;sung:<br>
68060 FPU 50 MHZ + PPC 604e<br>
GFX-Karte<br>
64 MB Speicher
<p>
Haupt Eigenschaften:<ul>
<li>Volle PowerPC und CyberGraphX-Unterst&uuml;tzung
<li>(wirklich) einfach zu bedienende MUI Oberfl&auml;che
<li>Vorschau f&uuml;r fast alle Effekte (auch in ECHTZEIT m&ouml;glich!!!)
<li>Effekt-Generator mit zeitabh&auml;ngigen Variablen unter der
 Zuhilfenahme von `Envelopes`
<li>Eine sehr gro&szlig;e Auswahl an Spezial-Effekten (&uuml;ber 100!),
 die fast v&ouml;llig frei kombiniert werden k&ouml;nnen
<li>Einige wirklich einzigartige Effekte
<li>3D-Engine mit mehreren Lichtquellen, Phong-shading und Transparenz
<li>&Uuml;berlagerung von 3D-Effekten (PowerPlugs!)
<li>&Uuml;berlagerung von Lightwave-Objeten und Bildern im 3-dimensionalen Raum
<li>3D Texte
<li>PlugIns werden erst geladen, wenn sie ben&ouml;tigt werden!
<li>Envelope-Editor
<li>Timecodes-Editor
<li>Transition-Maker f&uuml;r die einfache Erstellung von Umblendungen zwischen
 Bildern oder Animationen
<li>Einfach zu bedienendes Player-Interface
<li>AnimInfo-Funktion die Gr&ouml;&szlig;en-Profile und andere Daten anzeigt
<li>Gadgets, die mathematische Ausdr&uuml;cke anstatt von einfachen
 Zahlen verarbeiten k&ouml;nnen
<li>ARexx-port
<li>Import von Bildern aus anderen Programmen
<li>Schneller und komfortabler Konverter:
<li>Eingabe: YAFA, ANIM5/7/8, MPEG, Bild-Sequenzen, QT, AVI
<li>Ausgabe: YAFA, ANIM5/7/8, MPEG, Bild-Sequenzen
<li>und vieles mehr</ul>

<p><table><tr><td>
Fazit:<br>
Wildfire 7 ist in allen Bereichen mehr als durchdacht, alle Menu`s sind logisch
und &uuml;bersichtlich aufgebaut.Ich bin mehr als beeindruckt und endlich wei&szlig; ich
wof&uuml;r ich soviel Geld in Hardware gesteckt habe. Ich kann jeden der eine PowerUp
Karte hat nur dazu raten sich Wildfire zu kaufen. Wer keine PowerUp Karte hat
sollte es sich aber auch holen, man braucht denn aber etwas gedult bis eine
Animation fertig ist. Solche Software braucht der Amiga Markt, den Wildfire hat 
nur eine einzige Grenze, die eigene Fantasy! Wo f&uuml;r man Wildfire gebrauchen kann
ist auch egal, ob man nun schon immer mal eine eigene Demo machen wollte, oder
f&uuml;r ausgew&ouml;hnliche Web grafiken, oder f&uuml;r Video effect &uuml;berbl&auml;nden, oder ... 
wie gesagt es hat nur eine Grenze die eigene Fantasy!<br>
Mehr als nur <i><b>-Empfehlenswert-</i></b> </td><td><img src="../pic/award.gif" alt="Award" width=111 height=111></td></tr></table>
 <P>
Quelle:<br>
Oberland Computer<BR>
In der Schneithohl 5<BR>
61476 Kronberg<BR>
Tel. 06173-6080<BR>
email: info@oberland.com
<p>
<img src="../pic/sk.gif" alt="sk" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft6.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft8.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
