<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Fun und Talk</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/fun.gif"  alt="Fun Talk">
<h1>Forum</h1>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


Christopher beantwortet wieder Fragen...
<p>
Feedback auf meinen letzten Artikel.<br>
Viele von Euch haben mir Emails zu meinem letzten Artikel geschrieben.
Einige sogar mehrmals. Vielen Dank daf&uuml;r. Ich denke, Marios Brieftr&auml;ger
wird Arbeit bekommen, wenn das so weitergeht ;-)
<p>
Nat&uuml;rlich solltet Ihr das auch so weitermachen, denn ohne Euch ist da&szlig;
Forum nichts wert. Ich m&ouml;chte nun die interessantesten Beitr&auml;ge hier 
auflisten. Falls keine gravierenden &Auml;nderungsvorschl&auml;ge von Euch kommen,
mach ich das auch in Zukunft so. 
<p>
<b>Wolfgang W.</b> schrieb mir einen der Gr&uuml;nde, warum Ich keinen PC kaufen
werde: &quot;Ich arbeite beruflich an einem alten 486SX25 unter OS/2 (zwar 
kein Vergleich zu AmigaOS/Workbench, aber auf jeden Fall besser als 
Windoze) und freue mich nach Feierabend auf meinen A1200 (noch von Commo,
Blizzard 1230-IV mit SCSI, 24 MB Fast, 50 MHz-Copro) Ich habe mir jetzt 
einen A1500Ti mit CyberstormPPC und Picasso IV f&uuml;r knapp 5.000, 00 DM bestellt 
(ein PII-400 ist f&uuml;r ca. 2.000,00 DM zu haben, ganz normal kann
ich also nicht sein :-) ) und hoffe nat&uuml;rlich, da&szlig; diese Ausgabe nicht 
ganz f&uuml;r die Katz` sein wird.
<p>
Mit <b>Thomas Franziskowski</b> hatte ich eine kleine Diskussion &uuml;ber die Zukunft
unseres Computers: &quot;Win98 ist tats&auml;chlich das Ende Fahnenstange. Nicht 
wegen dessen Qualit&auml;t sondern weil es kein weiteres Windows mehr geben 
wird. MS konzentriert sich in Zukunft nur noch auf Windows NT und CE was
Betriebssysteme angeht. (Nebenbei:Windows 01 w&uuml;rde sich ja auch etwas 
bl&ouml;de anh&ouml;ren!)
<p>
Diese Fakten sind mir bekannt. Aber &uuml;berlege mal. Warum wird es kein
Windows01 geben? Ich denke mal, weil das Monster Win98 schon so aufgebl&auml;ht 
(Hierbei handelt es sich keineswegs um Hetze eines Micro$oft-
Hassers. Win98 ist ein aufgebl&auml;htes MS-DOS. Micro$oft behauptete zwar,
da&szlig; Win95 schon ohne DOS auskommt, aber das ist eine L&uuml;ge. Jeder, der 
die WinInternals mal genauer studiert hat, m&uuml;sste sich dar&uuml;ber im Klaren
sein.) ist, da&szlig; man einfach nichts mehr reinstopfen kann. Der Code ist
zu kompliziert geworden. Es ist zu m&uuml;hsam weiterzucoden, sich um die 
ganzen Altlasten zu k&uuml;mmern. NT und CE dagegen, tragen den DOS M&uuml;ll garnicht 
oder nur im vermindertem Ma&szlig;e mit sich rum.
<p>
Jaja, das Schwein wird gem&auml;stet bis es dick und fett ist und dann wird
es geschlachtet! Oink! :-) Ich bin noch nicht auf den Gedanken gekommen,
da&szlig; die Microsoft Leute ihren eigenen Code nicht mehr durchschauen k&ouml;nnten,
glaube Dir das allerdings gerne!
<p>
Und ich bin der Meinung, da&szlig; ich doch recht habe ;-) Der WindowsPC ist
nicht preiswert. Ein durchschnittlicher PC kostet ca. 1500DM. Damals, als
der C64 noch the state of the art war, mu&szlig;te man etwa 800 DM berappen. Ein
C64 brauchte auch nicht jedes 2. Jahr neue Rambausteine. Das Beispiel ist 
nicht 100% gerecht, aber Tatsache ist, das Personalcomputer sogesehen teurer
geworden sind. Die Bedienung von Windows ist nicht einfach. Viele Menschen
merken es nicht, weil sie nichts besseres gewohnt sind. Ich kenne
viele Gamer, die DOS und Win95 installiert haben. Nur um alle Spiele zum 
Laufen zu kriegen.
<p>
Tja, zugegeben, da ist was dran. Man sollte vielleicht besser sagen, dass
der PC zur Zeit nur die billigste M&ouml;glichkeit ist zu einem vollwertigen und
zeitgem&auml;&szlig;en Computer zu kommen. So gesehen d&uuml;rfte es aber gar nicht so schwer 
sein dieses aktuelle Preisniveau zu unterbieten; vor allem was auch
diesen st&auml;ndigen Zwang zum Aufr&uuml;sten betrifft der nat&uuml;rlich auch noch ins
Geld geht. Der k&uuml;nftige Amiga w&auml;re sicher geeignet daf&uuml;r solange Amiga Inc.
und Int. sich keine Fehler leisten.
<p>
...abgesehen: Die in PCs verwendeten Bauteile werden nun mal in weitauh&ouml;heren 
St&uuml;ckzahlen gefertigt als diejenigen die im zuk&uuml;nftigen Amiga Verwendung 
finden werden.
<p>
Laut AmigaInc werden die neuen Amigas aus Standardkomponenten gefertigt.
Einzig und allein der &quot;Superchip&quot; ist extra. Und der soll ja ein gutes 
Preis/Leistungsverh&auml;ltnis haben. Standardkomponenten hei&szlig;t ja nicht, das
das Design der Motherboards so scheisse ist, wie das der PCs.
<p>
Wenn es dabei bleibt sehen die Dinge in der Tat gut aus. Ich kann mir nur
noch nicht so recht einen &quot;echten&quot; Amiga mit Standartkomponenten vorstellen.
Wo bleibt denn da der Sinn f&uuml;r Tradition?? ;-)
<p>
Warum ist heute Microsoft Marktf&uuml;hrer in Sachen Software und nicht Apple
oder Commodore?
<p>
Microsoft spielt kein faires Spiel. Die Redmonder haben schon immer mit
illegalen Methoden versucht, Konkurentten ausgebootet. Lies dazu mal Boycott 
Micro$oft! Apple war so dumm, sich auf propriet&auml;re Hardware zu versteifen: 
Dadurch wurden die Macs zu teuer. Ausserdem gabs kaum Werbung.
Bei Commodore hat das Management nur Mist gebaut.
<p>
<b>Weiterhin wurde ich gefragt:</b><br>
&quot;Aber - soll ich meinen &uuml;ber Jahre liebgewonnenen wohlf&uuml;hl-Rechner A1200 
aufgeben? Oder konstant Geld reinballern? Einen gebrauchten Pentium II mit
200 MHz kriegst Du f&uuml;r 1000.- und das ist schon viel. Was tun?&quot;
Bleibe bei deinem Amiga. Dort f&uuml;hltst Du dich schlie&szlig;lich wohl. Irgendwann
im Jahre 1999 werden die Pl&auml;ne von Amiga inc. auf dem (Laden)tisch liegen.
Und wenn dir das, was du da siehst nicht gef&auml;llt, kannst Du immer noch auf
einen anderen Rechner umsteigen. Ich mache das jedenfalls so. Ich spare, um
mir im Jahre 2000 einen richtig fetten Rechner auf den Tisch zu stellen.
Amiga Inc. hat die Chance. Wenn sie die nicht nutzen, und nur M&uuml;ll liefern,
dann gibt es immer noch Apple, und Linux, und BeOS und Sun (Wie gesagt, ich
spare!) und Atari... Aber so lange bleibe ich dem Amiga treu. Das hat Jay
Miner verdient. Falls Ihr interessiert seit, auf meiner Homepage sind noch
mehr Artikel und &quot;tidbits&quot; zu genie&szlig;en.
Die URL ist <a href="http://listen.to/sub.etha">http://listen.to/sub.etha</a> und denkt dran, mir zu mailen!

<p>
<img src="../pic/ck.gif" alt="ck" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="talk1.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="talk.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="talk3.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
