<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Fun und Talk</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/fun.gif"  alt="Fun Talk">
<p><b>Hard- &amp; Softwaretuning f&uuml;r den Amiga </b><p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>



Ein Buch oder Nachschlagewerk habe ich noch nie testen m&uuml;ssen, aber es
gibt ja bekanntlich immer eine erstes mal und so habe ich mir das Werk
vom INTEREST Verlag &quot;Hard- und Softwaretuning f&uuml;r den Amiga&quot; einmal n&auml;her
angesehen. Das &quot;Buch&quot; ist eigentlich ein Order, dem man Bl&auml;tter entfernen
oder zuf&uuml;gen kann. Dieser Ordner enth&auml;lt au&szlig;erdem noch zwei Disketten, die
das &uuml;ber 600 Seiten starke Werk, mit Beispieldateien unterst&uuml;tzen.

Das Nachschlagewerk befa&szlig;t sich mit sehr vielen Themen rund um den Amiga.
Doch ich fange mal am Anfang an. Neben einer kurzen Auff&uuml;hrung des gesamten
Inhaltes, wird man sofort in die Hardware des Amigas eingef&uuml;hrt. Dieser 
Teil ist in insgesamt 7 Unterpunkte eingeteilt. Angefangen wird mit der
Geschichte des Amigas, von der eigentlichen Idee, bis hin zur Verwirklichung 
und der Pleite von Commodore. Wenn man sich diesen Abschnitt
durchliest, wird man richtig nostalgisch, zumahl man auf alte Rechner, 
wie den Pet oder den Sinclair eingeht und zum Schlu&szlig; zur Auffassung kommt,
da&szlig; der Amiga nach seinem Erscheinen technisch voll &uuml;berlegen war und
die bis dahin f&uuml;hrenden Computer vom Thron sto&szlig;en k&ouml;nnte bzw. konnte.
Weiterhin wird der genaue Aufbau der Hardware, wie Prozessor, Chips (gr&uuml;ndlich 
befa&szlig;t man sich auch mit den drei Chips: Denise, Paula und Agnus),
Speicher, Schnittstellen... ja man erkl&auml;rt sogar die Programmierung der
Coprozessoren. Alles wird unterlegt, mit Beispielen, die in Assembler
oder anderen Programmen geschrieben wurden. Danach berichtet man auch &uuml;ber
die Schnittstellen des Amigas, die man kurz zusammengefa&szlig;t auch als 
Steckpl&auml;tze bezeichnen kann, die sich hinten am normalen Desktop Amiga befinden.
Die internen Anschl&uuml;sse werden aber auch nicht vergessen. Gerade Namen,
wie SCSI oder IDE, die einem zwar nicht unbekannt sind, aber wo n&auml;here 
Informationen fehlen, werden hier gut definiert und schaffen somit ein
Hintergrundwissen. Wie ich feststellen mu&szlig;te, ist man nach dem einfachen
schm&ouml;kern und nach einem intensiven lesen um einiges schlauer als vorher,
doch dazu sp&auml;ter mehr.

Kapitel drei des Ordners, befa&szlig;t sich mit dem Betriebssystem. Auch hier,
wie schon beim Hardwarekapitel, geht man ersteinmal auf Allgemeines ein,
und verschafft dem Leser die notwendigen Informationen. Untermalt wird 
dieses Kapitel mit Bildern, die auf die Strukturen des OS`s in Verbindung 
mit den Dateien eingehen (Library`s, Device`s oder aber Pheripherie). Das
Kapitel &quot;Betriebssysteme&quot; ist das umfangreichste von allen 9 enthaltenen
und erkl&auml;rt DOS Befehle und wie schon erw&auml;hnt Devices und Library`s, aber
auch Unix/Linux und Macintosh-Emulationen. Im vierten Kapitel wird man in
die Kunst der Programmiersprachen eingeweiht. ARexx, Assembler, C und Modula2
werden auf mehreren Seiten mit vielen Beispielen zum selber ausprobieren 
beschrieben und dem Leser detailiert erkl&auml;rt. Einige Kommandos werden 
mit einem Begleittext und Kurzprogrammen, die man als kleine Tools bezeichnen kann, aufgef&uuml;hrt.

Kapitel f&uuml;nf ist schon etwas f&uuml;r interessierte User, die sich auch mit dem
Programmieren besch&auml;ftigen, denn hier geht es um Musterprogramme. Von der
Idee, bis hin zur Verwirklichung... Algorithmen, mathematische Berechnungen, 
Datenbanken oder die Erstellung von fraktalen Gestalten, alles wird behandelt 
und mit Beispielen (die auch auf den beiliegenden Disketten sind)
verst&auml;ndlich gemacht. Kapitel 6 gibt Auskunft &uuml;ber Multimedia. IFF Format,
Datatypes, Multiview oder wie in jedem Kapitel, Fakten zu den Grundlagen!
Recht kurz gehalten, aber sehr informativ ... so pr&auml;sentiert sich dieser
Teil des Werkes &quot;Hard- und Softwaretuning f&uuml;r den Amiga&quot;. 

Die letzten drei Kapitel (7, 8 &amp; 9) sind noch etwas unvollst&auml;ndig. So sind
zwar im Inhalt alle Themen aufgef&uuml;hrt, jedoch fehlen ein paar. &quot;Tips, 
Tricks und Utilities&quot; verbirgt das Kapitel 7. Verwendung und Nutzung von
Programmen wie SuperDuper oder DiskSalv2 bekommt man genausten beschrieben
und da beide Programme den dazugeh&ouml;rigen Disketten beiliegen, kann man es
auch gleich einmal ausprobieren. Im Bereich Dateiverwaltung, stehen alle
F&auml;higkeiten des Freeware-Tools TashIcon schwarz auf wei&szlig; gedruckt und auch
dieses Programm kann man sich von den Disketten ziehen. Detailiert geht 
man auch auf das eigene erstellen von WBIcons ein, sowie auf die Grundlagen 
der Workbench-Standarduhr und der Datumsanzeige. Kapitel 8 ist auf
Anwendungen zugeschnitten. PersonalPaint hat man ganze 10 Seiten zur Verf&uuml;gung 
gestellt, da PPaint zur Standardsoftware bei neuen Amigas geh&ouml;rt,
hat man sich diesem Programm besonders angenommen. Ersetzen kann es das 
PPaint Handbuch nat&uuml;rlich nicht, aber Grundfunktionen werden ausreichend
erkl&auml;rt.
Weiterhin werden die Spiele DeluxePacman und GNU Chess &quot;vorgestellt&quot;. Nunja
die Spiele haben schon ganz paar Jahre auf dem Buckel und ich glaube, da&szlig;
sowas eigentlich in solch einen Order nicht reingeh&ouml;rt... denn es sind eben
nur 2 von XXX Spielen. Aber eines mu&szlig; man den Autoren lassen, beide Spiele
wurde ordentlich erkl&auml;rt, Ziel, Installation, Steuerung und Tastenkombinationen hat 
man teilweise tabellarisch in Szene gesetzt. Ein sehr interessanter 
Abschnitt des achten Kapitels, ist der Punkt &quot;8/7 Netzwerke&quot;. Viele
User wissen zwar was mit diversen Namen, wie ftp oder ppp etwas anzufangen,
doch was dahinter steckt... das ist den wenigsten bekannt. Auf 20 Seiten, 
werden sehr viele Abk&uuml;rzungen umfangreich erl&auml;utert und Grundwissen verdeutlicht. 
Erweitert wurde dies alles mit einer Liste, aller internationalen
Internetabk&uuml;rzungen (z.B.: UK f&uuml;r United Kingdom = England). Das letzte
Kapitel ist nur f&uuml;r echte Bastler interessant, denn hier geht man auf das
Hardwaretuning und Erweiterungen ein. Ob Ports, Interface oder dem Messen,
Steuern und Regeln, man hat nichts ausgelassen. Besonders hervorzuheben ist,
da&szlig; man dieses Kapitel mit Folien &quot;versorgt&quot; hat, die man mittels Polylux
(oder zu deutsch &quot;Bildwerfer&quot;) projezieren kann und anderen Leuten in einem
Vortrag - als Beispiel - zeigen kann. Wirklich eine gute Sache.

Das ganze &quot;Buch&quot; ist sehr gut gemacht worden, viele Informationen enth&auml;lt
es und Definitionen, somit kann man auch mit Abk&uuml;rzungen etwas anfangen.
Die Hintergrundinformationen zum Amiga und dessen Hardware sind sehr informativ 
und gerade die ersten Seiten, lassen einen Hauch von Nostalgie aufkommen. 
Gro&szlig;er Nachteil ist die Tatsache, da&szlig; dieses Werk 1996 zum ersten
Mal erschien und bis heute keine erkennbaren Ver&auml;nderungen beinhaltet, so
geht man dort noch auf AmiTCP als ultimatives Internetzugangsprogramm ein,
obwohl man heute zugeben mu&szlig;, da&szlig; sich Miami durchgesetzt hat. Auch ist 
der Workbenchersatz DOpus mehr und mehr f&uuml;r User interessant geworden und
somit werden angesprochene Tools &uuml;berfl&uuml;ssig, da sie in DOpus (als Beispiel) 
integriert sind. Also einige Kapitel sollten dringendst &uuml;berarbeitet
werden, damit eine Aktualit&auml;t garantiert ist und der Leser, der schon &uuml;ber
ein breitgef&auml;cherten Wissensstand verf&uuml;gt, auch noch dazulernen kann und
nicht die Seiten &uuml;berbl&auml;ttert. Der Ordner kostet 99,- DM mit zwei Disketten, 
die - wie ich schon sagte - alle Tools, Programme und erw&auml;hnten Beispiele 
enthalten. Der Preis ist wegen der teilweise auftretenden Unaktualit&auml;t
zu hoch, wenn man aber &quot;Hard- und Softwaretuning f&uuml;r den Amiga&quot; 
&uuml;berarbeitet und erweitert, so ist er gerechtfertigt!

<p>
<img src="../pic/mn.gif" alt="mn" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="talk3.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="talk.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="talk5.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>