<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
<meta name="GENERATOR" content="CygnusEd 4.2">
</head>
<title>AMIGA TIMES 06/98 - Workshop</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">
<script language="javascript">
 menu0on = new Image();
	menu0on.src = "../pic/backon.gif";
 menu1on = new Image();
	menu1on.src = "../pic/ion.gif";
 menu2on = new Image();
	menu2on.src = "../pic/nexton.gif";
       

	menu0off = new Image();
	menu0off.src = "../pic/back.gif";
	menu1off = new Image();
	menu1off.src = "../pic/i.gif";
	menu2off = new Image();
	menu2off.src = "../pic/next.gif";
	
	
<!-- End of roll-menu pre-load //-->

function img_act(imgName) {
	imgOn = eval(imgName + "on.src");
	document [imgName].src = imgOn;
}

function img_inact(imgName) {
	imgOff = eval(imgName + "off.src");
	document [imgName].src = imgOff;
}

</script>
<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><img src="../pic/work.gif"  alt="Software">
<p><b>HTML Seiten selber erstellt.... blo&szlig; wie? </b>
<p><img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


Themen:<br> <u>1. Grundlagen</u> <br>
        2. Tabellen und Grafikerstellung (Ausgabe 1/99)<br>
        3. Frames und cgi-Scripts (Ausgabe 2/99)
<p>
<b>1. Grundlagen</b>
<p>
Viele User m&ouml;chten sich im Internet gern mit einer eigenen WebSite pr&auml;sentieren, 
doch diese sollte nicht nur dem allgemeinen Standard entsprechen, 
sondern auch etwas ausgefallen sein. In den kommenden Ausgaben,
werden wir uns einwenig mit dem Thema der HTML Programmierung auseinandersetzte. 
Wir k&ouml;nnen aber leider aus zeitmangel nicht jeden Befehl definieren 
und somit m&ouml;chte ich jeden Interessierten an folgende Internet Adresse
verweisen, welche die gesamte HTML Programmierung sehr ausf&uuml;hrlich behandelt 
(und wenn ich schreibe &quot;sehr ausf&uuml;hrlich&quot;, dann ist das nicht gesponnen!!!). Die Adresse lautet:
<p>
In dieser Ausgabe werde ich nur auf ein paar Grundlagen eingehen und demn&auml;chst 
auf alles weiter eingehen. Das Schreiben von HTML Dokumenten ist
sicherlich am Anfang schwer und undurchsichtig, wenn man sich mal im Web
eine Quelldatei ansieht, so versteht man mei&szlig;t nur Bahnhof, doch der Aufbau 
und die Formatierungen von Worten ist im Grunde einfach und einwenig
vergleichbar mit dem Schreiben eines Amiga Guide`s. Bevor wir jetzt mit
dem Programmieren oder Schreiben solcher Seiten anfangen, sollten wir uns
&uuml;berlegen mit welchen Programmen wir dies anstellen. Im Aminet gibt es bereit`s 
sehr viele L&ouml;sungen, z.B.: WebPlug oder WebDesign. Diese sind aber
Shareware und aus diesem Grund oftmals mit gravierenden Einschr&auml;nkungen 
versehen. Deshalb empfehlen wir, alle Dokumente in einem normalen ASCII
Editor zu schreiben, Ihr k&ouml;nnt nat&uuml;rlich auch ein Programm kaufen, jedoch
schlucken die oftmals viel Speicher und f&uuml;r eine gute Erstellung, &Uuml;berpr&uuml;fung 
und Verarbeitung von Dokumenten m&uuml;ssen oftamsl mehrere Programme
gleichzeitig laufen und da ist esratsam einen ASCII Editor zu verwenden,
dieser nimmt den wenigsten Platz weg. Hat man nun einen Editor gefunden,
sollte man sich auch noch ein Demo eines Webcreators besorgen, wir verwenden 
WebPlug 1.45. Ich wei&szlig; das das wiederspr&uuml;chlig klingt, aber ein solches
Programm ist gut brauchbar, wenn man Hintergrundfarben festlegen will. Das
Programm braucht man aber nicht immer starten, nur wenn man es unbedingt
ben&ouml;tigt. Als n&auml;chstes ist ein Malprogramm empfehlenswert, damit man seine
Seiten auch grafisch versch&ouml;nern kann, wir nehmen PPaint 7.1, jedes andere
Programm kann man aber auch nutzen, man mu&szlig; sich eben nur damit auskennen.
Und zum Schlu&szlig; ben&ouml;tigt man noch einen Browser.
<p>
Zusammenfassung:
<pre>
wir ben&ouml;tigen.... ein Malprogramm    (z.B.: PPaint 7.1)
                  einen HTML Editor  (z.B.: WebPlug 1.45)
                  einen Browser      (z.B.: IBrowse 1.2)
                  einen ASCII Editor (z.B.: MegaED 1.2)
</pre><p>
So... und jetzt beginnen wir mit der eigentlichen Programmierung!
Jede Datei f&auml;ngt mit einem bestimmten Befehl an und h&ouml;rt auch mit einem
Befehl wieder auf, dieser Befehl ist &#060;HTML&#062;, gefolgt von &#060;BODY&#062;. Das kleiner/gr&ouml;&szlig;er Zeichen ist in der HTML Sprache sehr wichtig, sonst werden Befehle
nicht ausgef&uuml;hrt. Wenn Ihr also ein rohes Dokument schreiben wollt,
reicht es aus mit:
<pre>
   &#060;HTML&#062;
   &#060;BODY&#062;

   (Text von Euch!)

   &#060;/BODY&#062;
   &#060;/HTML&#062;
</pre>
<p>
... diesen kurzen Befehlen! Wie Ihr seht, ein Befehl macht man R&uuml;ckg&auml;ngig,
wenn man einen Schr&auml;gstrich vor den Befehl setzt!<br>
Erweitert kann man den Kopf des Dokumentes mit folgenden Argumenten:
<pre>
   &#060;HTML&#062;
   &#060;HEAD&#062;
   &#060;TITLE&#062;Amiga Times Workshop&#060;/TITLE&#062;   
   &#060;/HEAD&#062;
   &#060;BODY&#062;

   (Text)

   &#060;/BODY&#062;
   &#060;/HTML&#062;
</pre><p>
... dies bewirkt, das in der Browserleiste oben, der Titel &quot;Amiga Times
Workshop&quot; erscheint.<br>
Das war eigentlich eindeutig, jetzt z&auml;hlen wir Euch noch Formatierungen
auf, die man jeweils vor einem Wort plaziert und nach dem Wort wieder
l&ouml;scht:
<pre>
 &#060;B&#062;Hallo&#060;/B&#062;            .... <b>Hallo</b> wird fett geschrieben
 &#060;I&#062;Hallo&#060;/I&#062;            .... <i>Hallo</i> wird kursiv geschrieben
 &#060;U&#062;Hallo&#060;/U&#062;            .... <u>Hallo</u> wird unterstrichen

 &#060;HR&#062;                    .... einf&uuml;gen eines Querstriches z.B.: als Absatz
                         (hier aber OHNE &#060;/HR&#062;, nur &#060;HR&#062;)

 &#060;P&#062;                     .... Leerzeile

 &#060;BR&#062;                    .... Zeilenabbruch

 &#060;IMG SRC=&quot; &quot;&#062;           .... einf&uuml;gen einer Grafik
                         (z.B.: &#060;IMG SRC=&quot;amigatimes.gif&quot;&#062;)

 &#060;A HREF=&quot; &quot;&#062; &#060;/A&#062;       .... einf&uuml;gen eines Links
                         (z.B.: &#060;A HREF=&quot;amigatimes.html&quot;&#062;AmigaTimes&#060;/A&#062;)

 &#060;A HREF=&quot;<a href="mailto:">">mailto:"></a> &#060;/A&#062; .... einf&uuml;gen eines EMail-Links
                         (z.B.: &#060;A HREF=&quot;<a href="mailto:amigatimes@amigaworld.com">">mailto:amigatimes@amigaworld.com"></a>
                         Amiga Times&#060;/A&#062;)

 &#060;A HREF=&quot;<a href="http://">">http://"></a> &#060;/A&#062; .... einf&uuml;gen eines Hyperlinks
                         (z.B.: &#060;A HREF=&quot;<a href="http://www.amigaworld.com/">http://www.amigaworld.com/</a>
                         amigatimes&quot;&#062;Amiga Times WebSite&#060;/A&#062;)

 &#060;H1&#062;&#060;/H1&#062; _
 &#060;H2&#062;&#060;/H2&#062;  |
 &#060;H3&#062;&#060;/H3&#062;  |_________   .... Gr&ouml;&szlig;e der Schrift, wobei H1 die gr&ouml;&szlig;te
 &#060;H4&#062;&#060;/H4&#062;  |                 und H6 die kleinste Schriftgr&ouml;&szlig;e ist
 &#060;H5&#062;&#060;/H5&#062; _|
 &#060;H6&#062;&#060;/H6&#062;
</pre>
 <p>
Die gerade genannten Befehle sind ersteinmal ausreichend, mit diesen kann
man sich seine eigene Seite erstellen, jedoch noch ohne Hintergrundfarben,
die wir in der n&auml;chsten Ausgabe behandeln werden. Da das Internet teilweise
keine Umlaute erlaubt, mu&szlig; man sich hier an ein paar Formatierungen gew&ouml;hnen,
als da w&auml;ren:
<pre>
  statt: &auml;   &amp;auml;
         &Auml;   &amp;Auml;

         &ouml;   &amp;ouml;
         &Ouml;   &amp;Ouml;

         &uuml;   &amp;uuml;
         &Uuml;   &amp;Uuml; eingeben!
</pre><p>
N&uuml;tzlich sind aber hier auch Konverter, ein solcher ist auch in WebPulg integriert. Eine weitere einfache L&ouml;sung, ist das Tool GuideML, welches im
Aminet vorhanden ist. Dieses Tool konvertiert komplette Amiga Guide Dateien
ins HTML Format, Vorraussetzung ist allerdings, der richtige Befehlskopf
der Guidedatei, damit GuideML diese auch als solche erkennt. <br>
Da dieser Workshop erst sehr sp&auml;t ins Leben gerufen wurde (auf Wunsch eines
Lesers) k&ouml;nnen wir aufgrund von akutem Zeitmangel nicht weiter auf die HTML
Programmierung eingehen und verweisen Euch deshalb auf unsere n&auml;chste Ausgabe,
die sich dann mit Tabellen und Grafikeinbindung, sowie Grafikerstellung befa&szlig;t. Wir hoffen, Ihr nehmt uns das nicht &uuml;bel!

<p>
<img src="../pic/mn.gif" alt="mn" align=right>
</td></tr></table>
<p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="rubrik.html" onmouseover="img_act ('menu0')" onmouseout="img_inact ('menu0')" TITLE="eine Seite zur&uuml;ck"><img name="menu0" src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="rubrik.html" onmouseover="img_act ('menu1')" onmouseout="img_inact('menu1')" TITLE="zum Inhalt"><img name="menu1" src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="inet.html" onmouseover="img_act ('menu2')" onmouseout="img_inact ('menu2')" TITLE="zur n&auml;chsten Seite"><img name="menu2" src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

