<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img src="kuvat/thoriel.jpg" width="187" height="193" alt="Anu" border="1"></center>
						<p>Vilkaiskaapa t&auml;m&auml;n lehden etusivulle tai otsikkopalkkiin. Totta se on, yhdeks&auml;s vuosikerta starttaa sinnikk&auml;&auml;ll&auml; lehdell&auml;mme. Pitk&auml;lle on tultu alkuaikojen ensi askeleitaan haparoivasta levykelehdest&auml; - nyky&auml;&auml;n haparoi l&auml;hinn&auml; p&auml;&auml;toimittaja aina silloin t&auml;ll&ouml;in, ja senkin pit&auml;isi v&auml;h&auml;n v&auml;henty&auml; kun ei en&auml;&auml; tarvitse tehd&auml; moninkertaista ty&ouml;t&auml;...</p>
						<p>Ympyr&auml; on siis sin&auml;ns&auml;kin sulkeutunut, ett&auml; julkaisuformaatteja on vihdoinkin vain yksi. &quot;The real millennium&quot; k&auml;ynnistyy yhden version voimin, ja se versio on Saku. Ei en&auml;&auml; etuliitteit&auml; eik&auml; s&ouml;hl&auml;&auml;mist&auml; eri versioiden v&auml;lill&auml;. Jonkinlainen taakka on pudonnut toimituksen harteilta, ja t&auml;t&auml; lehte&auml; oli pitk&auml;st&auml; aikaa pelk&auml;st&auml;&auml;n hauskaa tehd&auml;, kun aiemmin kasauspaineita kertyi liiankin kanssa ja yritys pit&auml;&auml; kaikki langat k&auml;siss&auml; sai aikaan vain muhkeita umpisolmuja ja numerosta toiseen t&auml;yttyv&auml;&auml; Errata-palstaa.</p>
						<p>Kovin suuria muutoksia emme viel&auml; t&auml;m&auml;n numeron ulkoasuun tehneet, vaikka kaikenlaista onkin suunnitellu jatkoa varten. Loppuvuosi meni tiiviisti yhdistyksen asioita selvitelless&auml; ja t&auml;lle vuodelle suunniteltua Saku-tapahtumaa pohjustaessa. L&auml;hiviikkoina on tarkoitus saada sek&auml; yhdistysrekisterimuutokset (s&auml;&auml;nt&ouml;j&auml; uusittiin ja nimenkirjoittajat muuttuivat hallituksen vaihtusessa) ett&auml; pankkitilin siirto tehty&auml;. N&auml;in voimme jatkaa lehden ja Saku-tapahtuman kehitt&auml;mist&auml; t&auml;ysin voimin, kun tausta on kunnossa ja asiat vastuullisten ihmisten hoidossa.</p>
						<p>Kerhoilloista muualla kuin p&auml;&auml;kaupunkiseudulla on puhuttu ja haikailtu pitk&auml;&auml;n. Ehk&auml; nyt voisi sellaistakin suunnitella - vaikka Ouluun, jossa jonkun irvileuan mukaan &quot;asuu 95% Suomen amigisteista&quot;. Tarvitsisimme kuitenkin illanviettoa varten tilat, jotka mielell&auml;&auml;n saisivat olla ilmaiset tai v&auml;hint&auml;&auml;nkin hyvin edukkaat - uuden Saku-tapahtuman rahoittaminen vaatii my&ouml;s yhdistyksen budjetista suuren osan. Allekirjoittaneelle voi ilmoittaa, mik&auml;li tiet&auml;&auml; esim. Oulun alueella mahdollisen illanviettopaikan.</p>
						<p>T&auml;lle vuodelle on luvattu Amiga-saralla monenlaisia tuotejulkistuksia niin laite- kuin softapuolellakin - my&ouml;s merkitt&auml;vi&auml; sellaisia. Mik&auml;li edes osa niist&auml; toteutuu, saamme enemm&auml;n uutta katseltavaa ja kokeiltavaa kuin aikoihin. Mielenkiintoista uutta vuotta, amigistit - olkoon vuosi 2001 meille oivallinen!</p>
						<p>Anu&nbsp;Seilonen</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
