<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt; </font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<img height="238" width="250" src="kuvat/petro1.jpg" border="0" alt=" "></center>
						<div align="left">
							<p>Hyv&auml;&auml; uutta vuotta amigistit! Vuosituhat on viimein vaihtunut useimpien laskutapojen mukaan. T&auml;ll&auml; kertaa vuoden vaihtuessa j&auml;tettiin taakse muutakin kuin laskutapakriitikkojen vanha vuosituhat. Commodoren konkurssin tuhkista vuonna 1995 maineeseen noussut Amiga-kansan feeniks, Petro, j&auml;tt&auml;&auml; Amigan sparraamisen nuorempien k&auml;siin.</p>
							<p>Amiga Deutschlandin (ex-Amiga International, ex-Amiga Technologies) johtaja Petro Tyschtschenko ilmoitti viime vuoden lopulla j&auml;&auml;v&auml;ns&auml; Amigalta el&auml;kkeelle. Petro kertoi lyhyess&auml; tiedotteessa Saksan toimistojen sulkevan vuoden vaihteessa ovensa Escomilta perittyjen Classic Amiga -varastojen viimein huvettua. Petro itse jatkaa alasajoa viel&auml; maaliskuulle, mutta virallisesti Saksan toimistot suljettiin vuoden vaihteessa. Merkitt&auml;v&auml; kappale Commodoren j&auml;lkeisess&auml; Amiga-historiassa on tullut p&auml;&auml;t&ouml;kseen.</p>
							<p>Tiedote ei varsinaisesti yll&auml;tt&auml;nyt, mutta pys&auml;ytti silti hetkiseksi. Olin pist&auml;nyt merkille Bill McEwenin johtaman Amiga Inc.:n uuden PR-politiikan (jonka mukaan McEwen on yksin yrityksen puhemies) k&auml;yt&auml;nn&ouml;ss&auml; sulkeneen Petron entisest&auml; roolistaan k&auml;ytt&auml;j&auml;ryhmien ahkerana tukijana. Petroa n&auml;htiin en&auml;&auml; kaksilla messuilla Yhdysvalloissa McEwenin seurana sek&auml; Intiassa, jossa h&auml;n teki bisnest&auml; Classic Amigoilla. Poissa olivat vierailut k&auml;ytt&auml;j&auml;ryhm&auml;tapaamisissa ja pikkutapahtumissa.</p>
							<p>McEwen ei itse ehdi joka paikkaan, joten k&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; merkitsi sit&auml;, ett&auml; Amiga on kuluneen vuoden aikana osallistunut v&auml;hemm&auml;n ja USA-keskeisemmin Amiga-yhteis&ouml;n toimintaan. Sivusin aihetta s&auml;hk&ouml;postinvaihdossa McEwenin kanssa taannoin ja tied&auml;n, ett&auml; h&auml;n kyll&auml; jollain tasolla tiedostaa tilanteen - ehk&auml;p&auml; Petron j&auml;tt&auml;m&auml; aukko paikataan ajan my&ouml;t&auml;, ainakin McEwenin Australian vierailu oli askel oikeaan suuntaan (n&auml;ht&auml;v&auml;ksi j&auml;&auml;, ehtiik&ouml; Bill joskus Suomeen). Tilanne oli kuitenkin jo kauan ennen Petron ilmoitusta se, ett&auml; h&auml;net oli ajettu viime vuosien roolistaan Amigan maskottina kai l&auml;hinn&auml; tyhjent&auml;m&auml;&auml;n Amigan varastoja.</p>
							<p>T&auml;ss&auml; valossa, ja kun viel&auml; huomioidaan Petron osakkuus Intiasta ohjelmistoty&ouml;voimaa v&auml;litt&auml;v&auml;ss&auml; yrityksess&auml;, on sangen todenn&auml;k&ouml;ist&auml;, ettei kysymys ollut pelk&auml;st&auml;&auml;n el&auml;kkeelle j&auml;&auml;misest&auml;. Sin&auml;ns&auml; ymm&auml;rr&auml;n hyvin McEwenin tarpeen keskitt&auml;&auml; yrityksen julkisuuskuvaa (tosin nykyisell&auml;&auml;n se vaatisi kyll&auml; paljon lis&auml;ty&ouml;t&auml;), mutta on s&auml;&auml;li, ettei Petron potentiaalia er&auml;&auml;nlaisena cheerleaderina osattu enemp&auml;&auml; hy&ouml;dynt&auml;&auml;. Kun uusi Amiga keskittyi rakentamaan bisnest&auml;&auml;n rapakon takana, Petro taisi j&auml;&auml;d&auml; ulkopuoliseksi.</p>
							<p>On todellakin s&auml;&auml;li, ettei uusi Amiga ymm&auml;rt&auml;nyt Petron potentiaalia. Olen kuullut loputtomasti heittoja Petron heikosta tekniikan ymm&auml;rryksest&auml;, vihjailuja huonoista ratkaisusta liikejohtajana - ja uskon ett&auml; useimmissa niist&auml; on jotain per&auml;&auml;. En jaksa uskoa, ett&auml; Petron oikea paikka koskaan olisi ollut johtamassa Amigan globaalia strategiaa ja vet&auml;m&auml;ss&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n kehitysprojektia. Sen sijaan viime vuosien aikana h&auml;n ehti osoittaa rautaisen kykyns&auml; v&auml;litt&auml;&auml;, nostaa tunnelmia ja tukea - meit&auml;.</p>
							<p>Petro oli ja tulee varmasti pitk&auml;&auml;n olemaan yksi merkitt&auml;vimmist&auml; hahmoista Amigan historiassa. Ei pelk&auml;st&auml;&auml;n siksi, ett&auml; h&auml;n auttoi nostamaan Amiga-yrityksen Commodoren konkurssista ja piti sit&auml; edelleen pystyss&auml; l&auml;pi Escomin konkurssin ja Gatewayn p&auml;&auml;tt&auml;m&auml;tt&ouml;myyden, vaan siksi, ett&auml; h&auml;n onnistui ennenn&auml;kem&auml;tt&ouml;m&auml;ll&auml; tavalla iskem&auml;&auml;n kiinni siihen kultasuoneen, jota on Commodoren konkurssin j&auml;lkeen kenties useimmiten siteerattu yhdeksi Amigan syvimmist&auml; olemuksista - meihin.</p>
							<p>Yhteis&ouml;, k&auml;ytt&auml;j&auml;t, mill&auml; nimell&auml; meihin sitten halutaankin viitata, ei tietenk&auml;&auml;n ole se merkitt&auml;vin syy, josta Amiga muistetaan. Totta kai se Amiga-juttu alunperin oli nimenomaan loistava teknologia. Parhaat pelit, parhaat ohjelmat, paras k&auml;ytt&ouml;j&auml;rjestelm&auml;. Yhteis&ouml;ss&auml; kyse on enemm&auml;nkin Commodoren j&auml;lkeisest&auml; ilmi&ouml;st&auml;, jossa vaille emoyhti&ouml;n turvaa ja suuntaa j&auml;&auml;nyt Amiga on joutunut tukeutumaan sekalaiseen k&auml;ytt&auml;j&auml;joukkoon, joka on vaikean paikan tullen onnistunut h&auml;mm&auml;stytt&auml;v&auml;ll&auml; tavalla pit&auml;m&auml;&auml;n yht&auml;.</p>
							<p>Ja kun uudesta teknologiasta kinasteltiin muualla, Petro otti yhteis&ouml;n ty&ouml;maakseen ja teki kerrassaan loistavaa ruohonjuuritason ty&ouml;t&auml;. Voimme olla monta mielt&auml; kaikista niist&auml; markkinakikoista, joita Petro hy&ouml;dynsi - AmiCola ei varsinaisesti ollut hyv&auml;&auml;, Boing-bokserit l&auml;hinn&auml; naurattivat ja Annexin musiikistakin oltiin monta mielt&auml; - mutta silti kuvat Petrosta jakamassa Amiga-mainoskr&auml;&auml;s&auml;&auml; luoja tiet&auml;&auml; mink&auml; maalaisten Amiga-k&auml;ytt&auml;jien keskell&auml; pitiv&auml;t mielialaa yll&auml;, kun Amigan tulevaisuus oli kyseenalainen.</p>
							<p>Ja ehtih&auml;n se Petro koskettaa meid&auml;n suomalaistenkin el&auml;m&auml;&auml;. En ole koskaan tainnut tarpeeksi kiitt&auml;&auml; Broadline Oy:n Seppo Virtasta k&auml;ytt&auml;j&auml;ryhm&auml;mme ensiesittelyst&auml; (ilmeisesti faksitse) Petrolle kev&auml;&auml;ll&auml; 1997. Kiitos, Seppo. Sen seurauksena Petro l&auml;hetti meille tervehdyksen ja ehdotti vierailua, joka sitten toteutui vuotta my&ouml;hemmin Saku 98:n merkeiss&auml;. Saku 98:n kokoisen tapahtuman j&auml;rjest&auml;minen oli muutenkin askel tuntemattomaan, mutta Amigan johtohahmon vierailu Saksasta lis&auml;si muutaman &auml;mp&auml;rillisen perhosia vatsaan.</p>
							<p>Petro teki kuitenkin itse vierailustaan meille helpon. Mies oli hyvin k&auml;yt&auml;nn&ouml;nl&auml;heinen, mielell&auml;&auml;n yksi porukasta, ja koko homma sujui kuin omalla painollaan. Vierailun ensimm&auml;isen&auml; iltana illastimme Janne Pikkaraisen ja Petro Tyschtschenkon kanssa Sokos Hotel Vantaan ravintolassa (sielt&auml; my&ouml;s yll&auml; oleva kuva), ja siit&auml; illasta j&auml;i monta hauskaa muistoa. Oli ep&auml;todellista kuunnella Petron juttuja VIScorpista, ESCOMista ja kaikista niist&auml; Amiga-historian vaiheista, joita olimme seuranneet webin ja lehtien otsikoista.</p>
							<p>Kaikki varmasti muistamme l&auml;mpim&auml;sti Petron vierailun Saku 98 -tapahtumassa. Petro oli pienentyneess&auml; Amiga-yhteis&ouml;ss&auml; maailmanluokan hahmo, jonka l&auml;hes kaikki tunsivat nimelt&auml;<br>
							ja jonka saapumista Suomeen eiv&auml;t jotkut edes uskoneet, ennen kuin n&auml;kiv&auml;t miehen Heurekan k&auml;yt&auml;vill&auml;. V&auml;h&auml;n vaikeahan sit&auml; oli itsek&auml;&auml;n uskoa, sill&auml; Suomessa ei oikein ollut totuttu siihen, ett&auml; Amigan emoyhti&ouml; kiinnitt&auml;isi meihin erityist&auml; huomiota.</p>
							<p>Puolitoista vuotta my&ouml;hemmin, Saku 99:ss&auml;, Petro ei p&auml;&auml;ssyt Jim Collasin eron vuoksi Suomeen saakka, mutta Saku 99 muistetaan erityisesti niist&auml; lukuisista Amiga-lahjoista, joita h&auml;n meille l&auml;hetti. UPS toimitti Amigalta Suomeen kolme isoa pahvilaatikollista ja pari pienemp&auml;&auml; pakettia Amiga-tavaraa - kaikki jaettavaksi Suomen Amiga-k&auml;ytt&auml;jille. Eiv&auml;tk&auml; tapahtumavieraiden hymyt valehtele. Petro Tyschtschenko my&ouml;s soitti tapahtumaan ja selv&auml;sti liikuttuneena pahoitteli poisj&auml;&auml;mist&auml;&auml;n.</p>
							<p>Ennen Saku 98:aa kaikki t&auml;m&auml; olisi ihmetytt&auml;nyt minua suuresti, mutta j&auml;lkiviisaasti ja etenkin huomattuani, millaisen aukon Amiga-yhteis&ouml;&ouml;n Petron hiljaisuus uuden Amiga-johdon my&ouml;t&auml; on j&auml;tt&auml;nyt, en en&auml;&auml; ihmettele lainkaan. Jos olisin tiennyt, mik&auml; Petro on miehi&auml;&auml;n ennen Saku 98 -kutsun l&auml;hett&auml;mist&auml;, en koskaan olisi edes ep&auml;illyt sit&auml;, vastaako h&auml;n siihen my&ouml;nt&auml;v&auml;sti. Petro yksinkertaisesti otti &quot;el&auml;m&auml;nteht&auml;v&auml;kseen&quot; pit&auml;&auml; huolta siit&auml;, ett&auml; Amiga-yhteis&ouml; pysyy vetre&auml;n&auml;. Ja Petrolle me t&auml;&auml;ll&auml; Suomessa olimme konkreettisesti osa tuota yhteis&ouml;&auml;, emme vain joku marginaalipoppoo pohjoisessa.</p>
							<p>Moni on sittemmin todennut, mukaan lukien Amigan nykyjohto, kuinka t&auml;rke&auml; Amiga-yhteis&ouml; on ollut Amigan taistelulle olemassaolostaan. Se tulee my&ouml;s n&auml;yttelem&auml;&auml;n ratkaisevaa osaa Amigan yrityksess&auml; palata markkinoille. Mutta, lainatakseni er&auml;st&auml; toista kuuluisaa herraa, &quot;there is a difference between knowing the path, and walking the path.&quot; Petro todellakin k&auml;veli tuota polkua tavalla, jota emme v&auml;ltt&auml;m&auml;tt&auml; tule en&auml;&auml; n&auml;kem&auml;&auml;n. Ja vaikka kuinka olen iloinen siit&auml;, ett&auml; Amiga tekee nyt paluuyrityst&auml; teknisin meriitein, j&auml;&auml;n kaipaamaan sit&auml; jotain, mit&auml; Petro toi harrastukseemme.</p>
							<p>Petro kertoi jo Saku 98:aa edelt&auml;neell&auml; illallisella etsiv&auml;ns&auml; ty&ouml;lleen jatkajaa. H&auml;n teki pitk&auml;n p&auml;iv&auml;ty&ouml;n Amigalla, joten h&auml;nen p&auml;&auml;t&ouml;ksens&auml; j&auml;&auml;d&auml; el&auml;kkeelle ei yll&auml;tt&auml;nyt. Toisaalta se, liittyyk&ouml; tuohon p&auml;&auml;t&ouml;kseen enemm&auml;n kuin mit&auml; julkisuudessa on annettu ymm&auml;rt&auml;&auml;, on melko lailla toisarvoista. Itse en kyll&auml; yll&auml;ttyisi lainkaan, vaikka n&auml;kisimme Petron viel&auml; jossain roolissa liike-el&auml;m&auml;ss&auml;, mutta niin tai n&auml;in, Petro l&auml;htee j&auml;tt&auml;en j&auml;lkeens&auml; uuden alun. H&auml;n oli Commodoren j&auml;lkeen mukana yritt&auml;m&auml;ss&auml; useaa sellaista, ja suunnitelmien menness&auml; m&ouml;nk&auml;&auml;n jatkoi sit&auml; mink&auml; osasi parhaiten, roikkui mukana ja raahasi meit&auml; muita per&auml;ss&auml;&auml;n.</p>
							<p>Siit&auml; ja monesta hauskasta muistosta Petro ansaitsee kiitoksemme. Nyt on muiden vuoro onnistua tai ep&auml;onnistua. Ettei kiitos j&auml;isi pelk&auml;ksi maininnaksi Saku-lehden sivuilla, l&auml;hetimme loppuvuodesta Petrolle kirjeen. Ker&auml;simme kirjeeseen Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n entisten ja nykyisten aktiivij&auml;senien allekirjoituksia ja onnentoivotuksia sek&auml; viestej&auml; Amiga-k&auml;ytt&auml;jilt&auml; kaikkialta Suomesta. Kiitos kaikille teille, jotka osallistuitte t&auml;h&auml;n l&auml;hti&auml;istervehdykseen.</p>
						</div>
						<center>
							<p><img height="290" width="368" src="kuvat/petro2.jpg" border="0" alt=" "></p>
						</center>
						<div align="left">
							<p>Kiitos, Petro.</p>
							<p>Janne Sir&eacute;n</div>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
