<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2>11. Leserbrief zu PowerUp und AMIGA Magazin (von Matthias Zwerschke)</H2>
&#187;Durch einen Freund bin ich auf Euer Magazin gesto&szlig;en und m&ouml;chte zun&auml;chst
erst mal, na was schon, Lob und Danke los werden. Euer Magazin ist sehr
&uuml;bersichtlich und informativ.<BR>
Besonders interessiert mich nat&uuml;rlich die weitere Entwicklung von PPC und
des Amiga allgemein und die sich aufzeigenden Tendenzen zum Krieg sind f&uuml;r
mich alles andere als positiv. Der Amiga ist nach wie vor sehr sehr krank
und die Wiederbelebungsversuche chaotisch und unorganisiert.
Wenn sich bei einem schwer Kranken die &Auml;rzte unendlich streiten, stirbt er
trotz guter Konzepte. Das ist nicht mit dem PC &amp; Microsoft zu vergleichen.
Die Lage ist ernst, und wer in dieser Zeit Grabenk&auml;mpfe anzettelt, wird mit
allen alles verlieren. Auch die Bemerkungen von T. (Anm. der Redaktion:
Gemeint ist Petro Tyschtschenko, Pr&auml;sident von AMIGA International)
&uuml;ber die Prozessoren sind f&uuml;r mich angesichts der Entwicklung am Markt
nicht zu begreifen. Das einzige Konzept, was mich im Moment noch &uuml;berzeugt,
ist das von Phase5 und Micronik. Das ganze hat aber den enormen
Pferdefu&szlig;, zu teuer zu sein. Wenn ich heute meinen Amiga 1200 umr&uuml;sten
will, bezahle ich ca. 500.- DM f&uuml;r den Einbau in einen Tower, 1500.- f&uuml;r
die schnellste Blizzard und mu&szlig; noch f&uuml;r 500.- DM den 68060 dazu kaufen.
Da bin ich mit Aufr&uuml;sten genauso teuer, wie mit einem K6 233 PC inklusive
CD, 2GB Festplatte etc. Dazu kommt noch das &auml;u&szlig;erst schmale Angebot an
Software und Equipment. Was also spricht f&uuml;r die Umr&uuml;stung - lediglich der
Traum vom Amiga ? Ob dies in der Zukunft reicht, wage ich zu bezweifeln.
Auch der RISC-Chip wird nicht in alle Ewigkeit das Argument bleiben, denn
auch Intel und KMD (Anm. der Redaktion: Gemeint ist wohl AMD) entwickeln
einen solchen. Der Hauptprozessor von Intel wird zur Jahrtausendwende ein
kombinierter RISC-Chip sein. Was dann ?<BR>
Ich werde meinen Amiga nochmal umr&uuml;sten, wegen des Traums Amiga, und ich
kann blo&szlig; hoffen, da&szlig; mich alle Amiga-Entwickler und Programmierer nicht
im Regen stehen lassen und ganz schnell GEMEINSAM den Karren aus dem Dreck
ziehen helfen.<BR>
Schnell noch ein Wort zum Amiga Magazin. Wer den Weg der C64er verfolgt
hat, kennt den Weg des Amiga Magazins, Gott sei Dank bleiben Amiga Plus,
Amiga Special und Amiga-Magazine (engl.) uns erhalten.<BR>
Ich hatte diesen Weg in einem Leserbrief ans Amiga Magazin vor einem Jahr
schon erw&auml;hnt, da l&auml;chelte man noch ungl&auml;ubig.&#171;
<CENTER><BR><A HREF="0020.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0022.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

