<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=Top>
<A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>12. Leserbrief zu PowerUp und AMIGA aktuell (von J&ouml;rg Handwerg)</H2>
J&ouml;rg Handwerg (er bietet im Rhein-Main Gebiet &uuml;brigens Vor-Ort-Service im
Softwarebereich und Probleml&ouml;sungen gegen bezahlbares Entgelt an, ebenso
verkauft er AMIGAs mit allem, was dazugeh&ouml;rt) m&ouml;chte seine Meinung zu
PowerUp und AMIGA aktuell loswerden:<P><BR>
&#187;Hallo Carsten !<P>
Erst einmal m&ouml;chte ich mein Lob zu Eurem sehr interessanten und
informativen Magazin aussprechen. Die Aktualit&auml;t und die Inhalte sind
hervorragend ! Seit ich die AMIGA aktuell vor 4 Monaten "entdeckt" habe,
bin ich regelm&auml;&szlig;iger, eifriger Leser geworden. Was allerdings ein wenig zu
kurz kommt, sind die Graphiken. Insbesondere bei Spieletest w&uuml;rde ich mir
mindestens ein paar aussagekr&auml;ftige Bilder (SCANS oder Grabs) w&uuml;nschen, und
zwar nicht nur vom Intro oder der Verpackung, sondern was mich dann
wirklich erwartet. Wenn die Datenmengen zu gro&szlig; werden, so macht halt eine
"kleine" und eine normale Version, es gibt ja auch Leute mit ISDN, wie ich,
denen die Datenmenge recht egal ist.<P>
(Anm. der Redaktion: AMIGA aktuell versucht, diesen Vorschlag aufzugreifen,
siehe Vorwort.)<P>
Was ich sehr positiv finde, ist, da&szlig; endlich auch mal eine tendenziell
"ehrliche" Bewertung der Soft- und Hardware stattfindet, und nicht alles
mit mindestens 75% wie im AMIGA Magazin ausgestattet wird, selbst wenn es
noch so schlecht ist. Worauf Ihr achten solltet, ist zwischen Ank&uuml;ndigung
und Erscheinung genau zu trennen, d.h. f&uuml;r die Piccolo-Graphikkarte wurde
mal ein TV-Modulator angek&uuml;ndigt, aber nie gebaut; f&uuml;r die Cybervision
wurde mal ein MPEG-Modul angek&uuml;ndigt (immer noch auf der Homepage bei
P5!!), wurde aber nie gebaut, und so gibt es noch viele Beispiele. Man
sollte ausdr&uuml;cklich hervorheben, da&szlig; einige Produkte lediglich angek&uuml;ndigt
sind und noch nicht zur Verf&uuml;gung stehen (und evtl. auch nie werden!), um
den K&auml;ufer hier vor "Fehlinvestitionen" zu sch&uuml;tzen.<P>
Verkaufsargumente, wie bei P5 (UW-Kontroller bis zu 40 MB/sec) sind oftmals
vollkommen unrealistisch. Zur Zeit sieht es jedenfalls so aus, da&szlig; ich laut
Sysinfo mit meinem PPC604e/200-060/50 Board nicht &uuml;ber 2.2 MB/sec mit einer
IBM DCAS 2GB UW-SCSI Platte herauskomme !!! Das ist gerade mal halb so
schnell als mit der Cyberstorm MK II mit Fast SCSI und einer IBM DORS 2 GB
Fast-SCSI-Platte, die ich vorher hatte !!! So etwas sollte eigentlich auch
mal geschrieben werden, oder auch, da&szlig; es bei (zumindest meiner) PPC Karte
nach nur etwa jedem 3. RESET erfolgreich gebootet wird. Auch da&szlig; das FAST-
RAM auf dem AMIGA-Mainboard nicht mehr eingebunden wird, sollte mal erw&auml;hnt
werden, genauso wie die Notwendigkeit, sich einen K&uuml;hler auf den 68060 zu
setzen, da es sonst zumindest im 4000 Desktop zu Hitzeproblemen kommt.
Diese "kleinen" Bugs hab ich der Firma Phase 5 schon vor Wochen mitgeteilt,
aber dort werden Anfragen nach den Fortschritten bei diesen Problemen nicht
mal mehr beantwortet !!!<P>
Es h&auml;tte auch einmal geschrieben werden sollen, da&szlig; der von Phase5
geforderte Adapter von UW-&gt;FAST mit "aktiver Terminierung der &uuml;brigen 8
Leitungen" meiner Recherche nach nicht erh&auml;ltlich ist ! Ich habe diverse
Elektronikversender, auch Gro&szlig;h&auml;ndler befragt und bin in einigen L&auml;den
gewesen z.B. in Hamburg, und habe diesen Adapter NIRGENDS bekommen. Auf
eine diesbez&uuml;gliche Mitteilung bei Phase5 bekam ich die Antwort, da&szlig; diese
Adapter demn&auml;chst (innerhalb der n&auml;chsten 2 Wochen etwa) in das Programm
bei P5 aufgenommen werden. Das war vor gut 8 Wochen und bisher habe ich
keine Nachricht bekommen oder irgendwo gesehen, da&szlig; dies geschehen ist.
Also, so sch&ouml;n die PPC-Karten in der Theorie sind, so dringend sind noch
Nachbesserungen n&ouml;tig, und darauf sollte man auch hinweisen. Ich f&auml;nde das
ja alles noch ertr&auml;glich, wenn Phase5 wenigstens mal den Dialog &uuml;ber ihre
WEB-Pages aufrecht erhalten w&uuml;rde. Leider gibt es hier bekanntlich kaum
noch Updates und auch die Information &uuml;ber neue Softwareupdates sind nur
m&uuml;hselig zu finden (meistens liest man es anderswo). Fehler sollten
registriert und eine Ank&uuml;ndigung der Fehler, welche beim n&auml;chsten Update
vorgenommen werden, ver&ouml;ffentlicht werden, so da&szlig; man sich nicht so
vollkommen unsicher ist, ob und wie es weitergeht.<P>
Nichtsdestotrotz sollte sich jeder Amiga-User dar&uuml;ber im klaren sein, da&szlig;,
wenn er durch K&auml;ufe, die vielleicht unmittelbar noch nicht besonders
"lohnend" erscheinen, nicht die wenigen verbliebenen Hersteller
unterst&uuml;tzt, dann k&ouml;nnen diese Firmen nicht weiterentwickeln, und auch die
Softwarefirmen werden genau darauf schauen, wie viele Boards &uuml;berhaupt
verkauft wurden und ob es sich rechnet, eine Software mit Unterst&uuml;tzung des
Boards zu schreiben oder nicht. Einfach gesagt No PPC Boards = NO Soft !&#171;
<CENTER><BR><A HREF="0021.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0023.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

