<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 10/97 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>1. Softwaretest: Multiterm KIT v5.0 (von Thomas Franziskowski)</H2>
&#187;Nach genau anderthalb Jahren erscheint ein alter Bekannter in der DF&Uuml;-
Szene zur&uuml;ck auf der Bildfl&auml;che: Multiterm aus dem Hause TKR, ein
Softwarepaket bestehend aus einem T-Online-Dekoder, einem Terminalprogramm,
der speziellen Skriptsprache MPL und mittlerweile sogar einem Homebanking-
Modul. Sp&auml;testens seit der letzten Version 4.0, die im Amiga-Bereich
erstmals und bis heute konkurrenzlos auch den sogenannten KIT-Standard
(KIT= Kernsoftware f&uuml;r Intelligente Terminals) darstellen konnte, d&uuml;rfte
wohl kaum ein Amiga-User ohne Multiterm auskommen, sobald er Zugriff auf
Deutschlands gr&ouml;&szlig;ten Online-Dienst nehmen m&ouml;chte. Selbst der Umweg &uuml;ber den
bekannten Macintosh-Emulator Shapeshifter blieb einem bislang verwehrt: Der
offizielle T-Online-Dekoder der Telekom, den es nur f&uuml;r Windows, MacOS und
OS/2 gibt, l&auml;uft damit leider nicht!<BR>
So haben die TKRler aus Kiel ein Quasi-Monopol auf dem Amiga, das sie auch
auszunutzen scheinen: Die Liste der neuen Features des kostenpflichtigen
Updates von der letzten Version 4.1 auf die neue Version 5.0 ist &auml;u&szlig;erst
gering.<P>
Systemanforderungen:<BR>
<UL>
<LI>ECS, AGA oder CyberGraphX
<LI>mind. 2 MB RAM
<LI>MC 68020 empfohlen
<LI>OS 2.04+
<LI>Festplatte
<LI>Hayes-Modem oder ISDN
</UL>
Neue Features in V5.0:<BR>
<UL>
<LI>Zugang zu T-Online jetzt auch mittels PPP m&ouml;glich (externer TCP/IP-Stack
vorausgesetzt)
<LI>neues Homebanking-Modul
<LI>Abspielm&ouml;glichkeit von AVI-, MIDI- und WAVE-Dateien (&uuml;ber externe
Applikationen)
<LI>M&ouml;glichkeit des Aufrufens externer Programme bei Programmstart und -ende
sowie im Online- und Offline-Zustand
<LI>einige kleinere, kosmetische Verbesserungen
</UL><P>
<CENTER><A HREF="Multiterm5.jpg"><IMG WIDTH=320 HEIGHT=240 SRC="Multiterm5sm.gif" ALT="Screenshot - Klick f&uuml;r grosses Bild!"></A></CENTER>
Wichtigste &Auml;nderung hierbei ist sicherlich die M&ouml;glichkeit der Nutzung des
neuen PPP-Zugangs zum T-Online-Netz, wenn auch nur &uuml;ber einen externen
TCP/IP-Stack. Hier hat man dann allerdings die Wahl ob man Inet-225,
AmiTCP/IP oder Miami benutzen will. Letzterer wird &uuml;brigens, neben einigen
anderen Programmen, gleich mitgeliefert, leider in der unregistrierten und
daher eingeschr&auml;nkten Version. Und zum PPP-Zugang sei gesagt: Er ist zwar
merklich schneller und einfacher zu konfigurieren als der alte Zugang &uuml;ber
SLIP, allerdings auch wesentlich teurer. Die Geb&uuml;hren belaufen sich dabei
auf 4,80 DM/Std. von 8-18 Uhr und 3,00 DM/Std. in der &uuml;brigen Zeit. Es
wird, im Gegensatz zu fr&uuml;her, nicht mehr zwischen einem Zugriff auf T-
Online und dem Internet unterschieden. Beim Zugang &uuml;ber SLIP kostet der T-
Online-Zugang dagegen nur m&uuml;de 1,20 DM/Std., solange man nicht ins Internet
geht, dann kommen n&auml;mlich pl&ouml;tzlich 3,00 DM/Std. zu den &uuml;brigen Geb&uuml;hren
hinzu. Letztlich l&auml;&szlig;t sich also sagen: Solange die Telekom den alten Zugang
noch unterst&uuml;tzt, und das wird vermutlich noch einige Zeit der Fall sein,
wird wohl angesichts der deutlich h&ouml;heren Kosten kaum ein Amiga-User von
dieser neuen M&ouml;glichkeit Gebrauch machen. Denn: Um ins Internet zu kommen,
und sei es auch nur um E-Mails zu verschicken, braucht man ohnehin externe
Programme, die Multiterm 5 gerade einmal aufrufen kann, mehr aber auch
nicht. Und f&uuml;r den neben KIT und dem recht unbekannten Foto-Btx in vielen
Bereichen immer noch g&auml;ngigen CEPT-Standard ist der SLIP-Zugang immer noch
schnell genug. Au&szlig;erdem wird ein schnellerer Zugang durch die leider immer
noch vorhandene allgemeine Tr&auml;gheit von Multiterm ohnehin regelrecht
ausgebremst.<P>
Eine weitere Neuerung, sozusagen als kleiner Bonus zum Paket, stellt das
neue "BankManager"-Programm dar. Damit ist es m&ouml;glich, offline
&Uuml;berweisungen auszuf&uuml;llen, um sie dann beim Zugriff auf den jeweiligen
Bank-Computer via beigef&uuml;gter Skriptsprache MPL in einem Rutsch &uuml;bertragen
zu k&ouml;nnen, anstatt erst dort die Auftragsmaske ausf&uuml;llen zu m&uuml;ssen. Damit
spart man vor allem dann Geb&uuml;hren, wenn man gleich mehrere &Uuml;berweisungen
auf einmal t&auml;tigen m&ouml;chte. Bei dieser Gelegenheit werden dann auch gleich
noch automatisch der Kontostand und die letzten Ums&auml;tze abgefragt und
gespeichert. Die GUI ist dabei schmucklos und einfach(st) gehalten. Es
existiert, typisch TKR, noch nicht einmal ein Pulldown-Men&uuml;. Ausdrucken
lassen sich lediglich die &Uuml;berweisungsauftr&auml;ge nicht aber die Ums&auml;tze oder
der Kontostand. Und was wohl das Schlimmste ist: In der jetzigen Version
1.0 ist der "BankManager" lediglich f&uuml;r Kunden der Postbank verwendbar.
Alle anderen br&auml;uchten ein speziell angepa&szlig;tes MPL-Skript, welches die
Daten auch richtig in die Auftragsmaske der Bank eingibt. Solche
alternativen Skripts werden allerdings derzeit noch nicht mitgeliefert. Man
kann sich jedoch freilich die M&uuml;he machen, selbst eines zu programmieren.<P>
Multiterm kommt auf insgesamt drei Disketten, von der eine mit passenden
Share- und Freewareprogrammen beschrieben ist. Als da w&auml;ren: Das bereits
erw&auml;hnte Miami 2.1, PlayDT zum Abspielen von Soundfiles, ein WAVE-Datatype
und eigenartigerweise das schon recht betagte SnoopDOS 3.0, das ja rein gar
nichts mit DF&Uuml; zu tun hat. Ist das wom&ouml;glich als Pr&auml;ventivma&szlig;nahme gegen
die ber&uuml;chtigten Multiterm-Abst&uuml;rze gedacht?<P>
<B>Fazit:</B><BR>
Das Update ist kaum den Preis von stolzen 40 DM wert. S&auml;mtliche
Neuerungen werden praktisch ausschlie&szlig;lich &uuml;ber externe Programme zur
Verf&uuml;gung gestellt. Der Gedanke hierbei war anscheinend: Wozu das Rad neu
erfinden, wenn es schon existiert? Zudem wurden etwa das Terminalprogramm
oder die MPL nicht mehr weiterentwickelt. Man scheint sich nun ganz, wenn
auch nicht sonderlich intensiv, auf das Hauptprogramm zu beschr&auml;nken. Dem
Amiga-User bleiben angesichts des geringer gewordenen Engagements seitens
TKR die recht hohen Kosten f&uuml;r T-Online- und Internet-Software. Im
Gegensatz zu PC- oder Apple Macintosh-Besitzern, die ihren Dekoder samt
zahlreicher Internet-Applikationen kostenlos fast hinterhergeschmissen
bekommen (vor allem durch diverse Computermagazine), mu&szlig; er einige hundert
DM berappen, bevor er beide Dienste auch wirklich voll nutzen kann. Und das
wird sich wohl auch bis auf weiteres nicht &auml;ndern. Zumindest nicht, solange
der Amiga-Markt nicht wieder gr&ouml;&szlig;er wird.<P>
Multiterm KIT 5.0 ist bei TKR (<A HREF="http://www.tkr.de">http://www.tkr.de</A> oder *tkr plus#) und &uuml;ber
diverse H&auml;ndler f&uuml;r 98,- DM erh&auml;ltlich. Das Update auf V5.0 gibt es
ausschlie&szlig;lich bei TKR f&uuml;r 40,- DM.<P>
Thomas Franziskowski (<A HREF="mailto:Th.Franziskowski@t-online.de">Th.Franziskowski@t-online.de</A>) f&uuml;r AMIGA aktuell&#171;
<CENTER><BR><A HREF="0100.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0102.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

