<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Test</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amite.gif" ALT="Amiga-Aktuell 10/97 - Test" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>

</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>3. Softwaretest: Selector (von Christopher K&uuml;ttner)</H2>
Christopher K&uuml;ttner stellt sein Lieblings-Freeware-Programm vor:<P>
&#187;Vor einigen Wochen (oder waren es Monate?) loadete ich ein Programm aus
dem gr&ouml;&szlig;ten ftp-Verzeichnis der Welt (Aminet) down, das meinen Amiga-Alltag
grundlegend ver&auml;nderte, ich m&ouml;chte fast schreiben, revolutionierte. Dieses
Programm hat mich, au&szlig;er den Online-Geb&uuml;hren, nichts gekostet: Freeware.
Ich spreche von Selector, einer Scriptsprache mit Interpreter, k&ouml;nnte man
sagen. Das Programm l&auml;uft auf meinem A500+ und auf meinem A1200
reibungslos, und das schon geraume Zeit. Jeder Befehl funktioniert
reibungslos. Im Archiv waren auch tierisch viele Beispiele, und die Online-
Hilfe im AmigaGuide-Format ist auch erstklassig gemacht. So, nach dem
Sch&uuml;ren der Vorfreude, dem Hinwegfegen der Bedenken und Bef&uuml;rchtungen,
N&auml;heres zu den Funktionen.<P>
Wie schon erw&auml;hnt, ist Selector so etwas wie eine Skriptsprache. Sie ist
&auml;hnlich leicht zu erlernen, wie das Basic des C64 o. &auml;., allerdings lohnt
sich hier die M&uuml;he. Man bastelt mit einem Texteditor und wenig
komplizierten Befehlen sein Skript zusammen, und erlebt die wahrsten
Wunderdinge (verglichen mit dem Arbeitsaufwand). Wieviele "Win95-
Taskleisten" gibt es eigentlich im Aminet? Und welche von denen st&uuml;rzten
nicht ab? Mit Selector baut man sich seine Taskleiste mit den Features, die
man m&ouml;chte, in null-kommata-&uuml;berhauptnichts zusammen. Man braucht f&uuml;r die
einfachste Version gerade mal zwei Befehle zu lernen! Selector &ouml;ffnet auch
Screens, man kann so zum Beispiel ein ultra-cool aussehendes BootUp-Menu
skripten. Desweiteren ist Selector in der Lage, sozusagen interaktiv, mit
einem Dos-Skript zusammenzuarbeiten. Es stellt dem Skript dann zum Beispiel
Requester zur Verf&uuml;gung, mit anderen Worten: Dos-Skripts mit GUI! Meine
kleine Lieblings-Freeware ist sogar in der Lage, "resident" zu sein, also
mehrere Skripts laufen gleichzeitig ohne zus&auml;tzlichen Speicherverbrauch.<P>
Okay, also Selector ist voll geil. Unbedingt sollte man sich das mal
ansehen (ach, fast vergessen, l&auml;uft ab OS 2.0), weil es fast jedem was
bringt. Die Nachteile gibt es nat&uuml;rlich auch. Selector unterst&uuml;tzt keine
Grafiken. Also keine Icons in der Taskbar. Selector ist auch so doof, und
kann mit PublicScreens nicht ordentlich umgehen. Selector ist kein
Commodity und hat keinen ARexx-Port, der bei einer Skriptsprache wohl
sowieso eher fragw&uuml;rdig ist. Wen diese Nachteile nicht st&ouml;ren, und wer
keine gro&szlig;e Lust hat, C oder Assembler zu lernen, und trotzdem
"Applications" erstellen m&ouml;chte, f&uuml;r den ist Selector ein Volltreffer..&#171;
<CENTER><BR><A HREF="0102.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0104.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A>
<BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test1.gif" ALT="[Test]" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

