<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>5. Spiele-News aus aller Welt</H2>
<B>Vulcan Software-News</B><P>
The Final Odyssey, ein Puzzle-Action-Adventure mit hervorragender Grafik,
ist inzwischen erschienen; ein Review des Spiels lest Ihr in der n&auml;chsten
AMIGA AGPJ-Ausgabe. Das Spiel ist auch komplett in deutsch spielbar.
Von dem Spiel Hard Target sind neue Screenshots ver&ouml;ffentlicht worden.
Hard Target ist ein Spiel, das an das PC-Spiel Virtua Cop erinnert. Der
Spieler hat die simple Aufgabe, auf alles zu schie&szlig;en, was sich bewegt.
Vulcan entwickelt angeblich auch eine spezielle Light Gun, mit der das
Spielen noch realistischer werden soll. Systemvoraussetzungen von Hard
Target sind im Moment: 8MB Fast RAM, 4x CD-ROM und AGA.<P><BR>
<B>Sadeness Software-News</B><P>
Sadeness hat nach Foundation und onEscapee die n&auml;chsten beiden Titel
angek&uuml;ndigt. Es handelt sich um den Command&amp;Conquer-Clone Forgotten Forever
und das Spiel Dafel: Bloodline (ehemals The Child of Darkness), eine
Mischung aus Rollenspiel im Stile von Zelda und Beat Em Up-Elementen.
Dafel: Bloodline verf&uuml;gt angeblich &uuml;ber hervorragende Grafik und Film-
Zwischensequenzen.<BR>
Forgotten Forever macht mit Features wie 256 Farben-Grafik, Multitasking,
Spielen in jedem Screenmode und TCP-Support auf sich aufmerksam.
Weiterhin hat Sadeness verk&uuml;ndet, da&szlig; das ebenfalls von vielen sehns&uuml;chtig
erwartete Spiel onEscapee am 16.12. erscheinen soll. Wenn Ihr diese
Ausgabe lest, soll es also schon erh&auml;ltlich sein. Ein Review des Spiels
gibt es in der n&auml;chsten AMIGA AGPJ-Ausgabe.<P><BR>
<B>Myst endg&uuml;ltig erschienen</B><P>
Das von vielen AMIGA-Fans lang erwartete Spiel Myst ist nun endg&uuml;ltig
erschienen. Ein Test des meistverkauften Computerspiels aller Zeiten folgt
in der n&auml;chsten Ausgabe von AMIGA AGPJ. Myst ist in einer deutschen und in
einer englischen Version erh&auml;ltlich, beide Versionen auf eine CD zu packen,
war aufgrund von Platzmangel nicht m&ouml;glich. Vorerst erschien Myst als AGA-
only-Spiel, ein CyberGFX-Patch soll aber in K&uuml;rze erh&auml;ltlich sein. Auch die
PPC-Version wird in K&uuml;rze erh&auml;ltlich sein.<P><BR>
<B>Riven f&uuml;r AMIGA ?</B><P>
Sunsoft, Hersteller von Riven, dem Nachfolger von Myst, haben auf ihrer
Homepage eine Umsetzung von Riven f&uuml;r den AMIGA f&uuml;r die Zukunft nicht
ausgeschlossen. Der AMIGA wird ausdr&uuml;cklich f&uuml;r m&ouml;gliche Umsetzungen
genannt. Da wird sich doch wohl ein AMIGA-Publisher finden, oder...?<P><BR>
<B>Quake-Pressemitteilung von clickBOOM</B><P>
clickBOOM hat eine Pressemitteilung zum Thema Quake herausgegeben. Darin
wird verk&uuml;ndet, da&szlig; man zwar in Verhandlungen mit id Software wegen einer
eventuellen Lizensierung des Spiels sei, jedoch noch nichts feststehe.
clickBOOM bittet alle AMIGA-Fans abzuwarten und keine E-Mails zum Thema
Quake mehr an clickBOOM zu schicken, da man Tausende solcher Anfragen
erhalten hat. clickBOOM wird das Ergebnis der Verhandlungen mit id auf
ihrer Homepage ver&ouml;ffentlichen, sobald ein positives oder negatives
Ergebnis feststeht.<BR>
Ger&uuml;chten zufolge soll die Programmierung der Amiga-Quake-Version bereits
abgeschlossen sein. Nur die Verhandlungen stehen einer Ver&ouml;ffentlichung
noch im Wege.<P><BR>
<B>Fratzengeballer: Nachfolger von Trapped 2</B><P>
Der Nachfolger von Trapped 2 heisst Fratzengeballer. Laut Oxyron wird das
Spiel ein reiner 3D-Shooter ohne Rollenspielelemente. Die 3D-Engine der
beiden Vorg&auml;nger Trapped und Trapped 2 wird f&uuml;r Fratzengeballer nochmal
erheblich verbessert. Das Spiel spielt auf einer Raumstation, auf der der
Spieler die Aufgabe erh&auml;lt, 15 Levels von vielen Feinden zu s&auml;ubern. Ein
Demo von "Fratzengeballer" ist bereits erschienen. Ein Preview folgt in
der n&auml;chaten Ausgabe von AMIGA AGPJ.<P><BR>
<B>Neues in Sachen BRAVO SCREENFUN</B><P>
Folgende Antwort auf seine Mail an BRAVO SCREENFUN erhielt ein AMIGA-
Besitzer:<BR>
Wir  werden  in  der  &uuml;bern&auml;chsten  Ausgabe einmal wieder ein paar Seiten
&uuml;ber  den  Amiga  bringen  und  dann  mal  schauen  wie  die Reaktion
der Leserschaft  ist.   Es  wird  zwar noch nicht um die neuesten Kisten
gehen aber  der  Amiga  wird  wie  das  SNES vorgestellt und es soll auch
gezeigt werden, wie sich das ganze so entwickelt hat.<P>
Chriss<BR>
SCREENFUNTeam<BR>
Leserservice<P>
Mal sehen, was das f&uuml;r ein Artikel wird, aber ein Anfang ist immerhin
gemacht.<P><BR>
<B>Gilbert Goodmate und Goblin Tanks erscheinen bei Alive MediaSoft</B><P>
Der auf Screenshots sehr gut aussehende Monkey-Island-Clone Gilbert
Goodmate and the Mushroom of Phungoria wird bei der englischen Firma Alive
MediaSoft erscheinen.<BR>
Goblin Tanks ist ein 3D-Fantasy-Shoot-Em-Up und wird &uuml;ber gerenderte
Grafiken, Animationen und Sprachausgabe verf&uuml;gen.<P><BR>
<B>ACSYS von Unique</B><P>
Die Programmierer-Gruppe Unique entwickelt ein Spiel, das inoffizieller
Nachfolger der Turrican-Reihe werden soll. Der Spieler steuert dabei
ACSYS (Autonomous Cybernetic System), einen speziellen Droiden. Zu den
Features von ACSYS geh&ouml;ren multidirektionales Parallax-Scrolling, bis zu
6 Waffen, intelligente Feinde und animierte Sequenzen zwischen den Leveln.
Die Systemvoraussetzungen sind im Moment: 4 MB Fast RAM + 4x-CD-ROM.<P><BR>
<B>Doom f&uuml;r AMIGA ?</B><P>
Die Source Codes von Doom werden demn&auml;chst Public Domain. Ger&uuml;chten zufolge
sollen mehrere Umsetzungen f&uuml;r den Amiga existieren, die lediglich aus
legalen Gr&uuml;nden nicht ver&ouml;ffentlicht wurden. Nachdem dieses Problem also
in nicht alzu ferner Zukunft gel&ouml;st ist, k&ouml;nnte Doom f&uuml;r den AMIGA doch
noch erscheinen.<P><BR>
<B>Mobile Warfare von Epic</B><P>
Noch vor Weihnachten soll Mobile Warfare von Epic Marketing erscheinen.
Es soll sich um eine Mischung aus Warcraft und Worms handeln.<P><BR>
<B>MAX Rally von Fortress Software</B><P>
MAX Rally wird ein Multi-Player-Rennspiel aus der Vogelperspektive, also
&auml;hnlich wie Super Cars oder All Terrain Racing. Bis zu 4 Spieler k&ouml;nnen
in MAX Rally gleichzeitig gegeneinander antreten, daf&uuml;r ist allerdings
eine Verbindung zwischen 2 AMIGAs n&ouml;tig. Viele verschiedene Optionen und
Spielmodi sollten aber auch daf&uuml;r sorgen, da&szlig; man allein Spa&szlig; an MAX
Rally hat. Das fertige Spiel soll f&uuml;r 14.99 englische Pfund (ca. 45 DM)
direkt bei den Autoren erh&auml;ltlich sein. Einzige Systemvoraussetzung ist
1.5 MB RAM.<P><BR>
<B>Championship Manager 3 f&uuml;r AMIGA ?</B><P>
Kaum ist nach Jahren das Spiel Championship Manager 2 f&uuml;r den AMIGA
erschienen (&uuml;brigens mit sehr mittelm&auml;&szlig;igen Testberichten in der englischen
AMIGA-Presse), besteht nun angeblich die Chance, da&szlig; auch der Nachfolger
auf dem AMIGA erscheinen wird. Die Entwickler Sports Interactive Ltd.
haben eine AMIGA-Umsetzung scheinbar nicht ausgeschlossen. Es besteht die
M&ouml;glichkeit, da&szlig; ein AMIGA-Spiele-Publisher die Rechte erwirbt. Es wurde
au&szlig;erdem eine Kampagne gestartet, um dies m&ouml;glich zu machen, wer
interessiert ist, sollte hier nachschauen: http://www.geocities.com/Vienna/
Strasse/3660/<P><BR>
<B>fUbAR-Autoren suchen Hilfe</B><P>
Q-Group, Entwickler des Spiels Fubar, suchen Leute, die Grafiken f&uuml;r das
Spiel fUbAR herstellen wollen. fUbAR soll ein Action-Strategiespiel der
besten Sorte werden, weswegen nur sehr professionelle Grafiker gesucht
werden. Wer sich f&uuml;r solch eine Person h&auml;lt, kann sich hier melden:
<A HREF="mailto:aking@coventry.ac.uk">aking@coventry.ac.uk</A><P><BR>
<B>Fortress of Fear-Autor sucht Hilfe</B><P>
Der Autor des Spiels Fortress of Fear, das ein Diablo-Clone f&uuml;r den AMIGA
wird, sucht Hilfe. Alle, die irgendetwas produziert haben, das in das
Spiel passen k&ouml;nnte (z.B. 3D-Objekte, Audiodateien,...), melden sich bei:
<A HREF="mailto:dahmen@Chlor.Informatik.RWTH-Aachen.De">dahmen@Chlor.Informatik.RWTH-Aachen.De</A>
<CENTER><BR><A HREF="0204.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0206.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

