<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>9. Review: Pinball Brain Damage</H2>
Pinball Brain Damage erzeugte schon vor einigen Monaten oder Jahren
Aufsehen, als ein selbstablaufendes Demo im Aminet erschien, das einen sehr
guten Eindruck hinterlie&szlig;. Nun ist das Spiel also nicht wie urspr&uuml;nglich
angek&uuml;ndigt bei Vulcan Software, sondern bei APC&amp;TCP erschienen.
Das Spiel befindet sich in der APC&amp;TCP-typischen Papp-Box, in der sich
neben der Anleitung leider wieder eine lose CD ohne Jewel-Case befindet.
Auf der Papp-Box befindet sich ein Hinweis, der einige AMIGA-Besitzer
aufhorchen und starke Kritik &auml;u&szlig;ern lassen wird: "Achtung Nicht fuer 060er
geeignet!". Ob diese Einschr&auml;nkung zeitgem&auml;&szlig; ist, mu&szlig; wohl stark bezweifelt
werden. Noch ein weiterer Minuspunkt f&auml;llt auf, bevor man die CD &uuml;berhaupt
eingelegt hat: die unzureichende Anleitung. Kurz und knapp werden hier die
Spielmodi auf eine nicht sehr erhellende Weise erkl&auml;rt bzw. nur erw&auml;hnt.
Gerade die einzelnen Missionen bzw. Aufgaben des Spielers h&auml;tten erkl&auml;rt
werden m&uuml;ssen.<P>
Will man das Spiel starten, begegnet einem der n&auml;chste Minuspunkt von
Pinball Brain Damage. Es ben&ouml;tigt sehr viel Chip-RAM, mehr als 1.9 MB.
F&uuml;r viele AMIGA-Benutzer, die einige Programme im Hintergrund der Workbench
laufen lassen, bedeutet dies wohl: "Boot with no Startup-Sequence". Hat man
das Spiel endlich gestartet, f&auml;llt nach einem netten Intro der n&auml;chste
negative Punkt auf. Pinball Brain Damage enth&auml;lt nur 2 Tische. Im Vergleich
aller anderen Pinball-Spiele der letzten Jahre ist dies eine entt&auml;uschende
Anzahl. Abhilfe kann man sich selbst durch den in der CD-Version
mitgelieferten Editor schaffen, dazu aber sp&auml;ter mehr. Positiv f&auml;llt nach
Wahl des Tisches sofort die butterweich scrollende Grafik auf. Alles andere
w&auml;re nach Spielen wie "Slam Tilt" aber auch nicht gut genug gewesen. Auch
die Steuerung des Spiels ist sehr gut gelungen. Ein kleiner Fehler f&auml;llt
aber jedoch auch beim Spielen auf. Bei jeder Aufw&auml;rts-Bewegung des Balles
verschwindet dieser f&uuml;r einen kleinen Zeitraum. Das beeinflu&szlig;t zwar den
Spielabluf nicht, es ist aber etwas st&ouml;rend. Das Design der Tische ist
nicht &uuml;berragend, aber auch nicht schlecht. Der Tisch "Magnetic Whirlpool"
wirkt zwar etwas &uuml;berladen, aber auch daran gew&ouml;hnt man sich schnell. Dank
sehr guter Grafik und Steuerung l&auml;uft das Spiel sehr einfach ab, man hat
Spa&szlig;. Leider gibt es bei Pinball Brain Damage nicht so viele verschiedene
Modi und Missionen wie bei dem Genre-Klassenbesten Slam Tilt, so wird
Pinball Brain Damage zwar nicht langweilig, der riesige Spielspa&szlig; von Slam
Tilt will sich aber auch nicht einstellen. Ein weiterer kleiner Fehler, der
aber eine sehr gro&szlig;e Wirkung haben kann, ist mir aufgefallen. Der Tisch
"Magnetic Whirlpool" beinhaltet eine schneckenf&ouml;rmige Rampe in der oberen
H&auml;lfte des Tisches. Schafft die Kugel den Weg bis auf die Spitze dieser
Schnecke nicht ganz, rollt er zur&uuml;ck. Hierbei kann es vorkommen, da&szlig; die
Kugel auf halbem Weg einfach liegenbleibt. In einigen F&auml;llen hilft selbst
ein Ruckeln am Tisch durch Amiga- oder Space-Taste nicht mehr, das Spiel
ist verloren, gerade bei hohem Punktestand eine sehr schlechte Sache.
All die negativen Punkte an Pinball Brain Damage sollen jedoch nicht
dar&uuml;ber hinwegt&auml;uschen, da&szlig; es ein gutes Pinball-Spiel ist, das durchaus
Spa&szlig; machen kann. Sie f&uuml;hren aber dazu, da&szlig; das Spiel nicht das beste im
Flipper-Genre ist. Pinball-Fans k&ouml;nnen ruhig einen Blick auf das Demo
riskieren.<P>
Eine Option, die Pinball Brain Damage aufwertet, ist der in der CD-Version
mitgelieferte Editor. Durch ihn ist es jedem K&auml;ufer m&ouml;glich, eigene Tische
auf eine sehr einfache Weise zu erstellen. Man w&auml;hlt ein Objekt aus und
plaziert es an eine beliebige Stelle des Tisches. Danach kann man noch
einen Sound mit dem Objekt verbinden, der ert&ouml;nt, sobald die Kugel es
ber&uuml;hrt. Zwar erreichen die selbstgebastelten Tische grafisch nicht die
Qualit&auml;t der bereits fertigen Tische des Spiels, aber vielen wird es
gro&szlig;en Spa&szlig; machen, eigene Tische zu entwerfen.<P>
<PRE>
Grafik:       8/10
Sound:        7/10
Handhabung:   8/10
Spielspa&szlig;:    7/10      
                        
GESAMT:       75 %

</PRE>
<B>Systemvoraussetzungen:</B><BR>
mind. OS 3.0 + AGA + 2MB<BR>
Chip-RAM (kein 060 !!!)<P>
erh&auml;ltlich im Handel oder bei APC&amp;TCP<BR>
empfohlener Verkaufspreis: 69.95 DM<P>
<B>Fazit:</B><BR>
solides Pinball-Spiel mit gelungenem Editor, das durchaus gut f&uuml;r
ein Spielchen zwischendurch ist, aber mit dem Genre-Primus Slam Tilt nicht
mithalten kann.
<CENTER><BR><A HREF="0208.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0210.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

