<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>10. Review: Uropa2 - The Ulterior Colony</H2>
<CENTER><IMG SRC="Uropa2.png" WIDTH=320 HEIGHT=203 ALT="Screenshot Uropa2"></CENTER>
Uropa2 wurde urspr&uuml;nglich als Shareware-Spiel ver&ouml;ffentlicht, bevor Vulcan
Software die Rechte erwarb und eine erweiterte und verbesserte Version
des Spiels nun als kommerzielles Spiel herausbrachte.<BR>
Das Spiel Uropa2 zu beschreiben, ist gar nicht so einfach. Handelt es sich
doch um eine Mixtur aus mehreren Spielprinzipien. Aber fangen wir am Anfang
an. Das Spiel kommt im schlichten Jewel Case daher, ohne Pappkarton, was
zur Folge hat, da&szlig; man auf eine gedruckte Anleitung verzichten mu&szlig;. Als
Ausgleich befindet sich auf der CD allerdings eine recht gut gelungene
Anleitung im AmigaGuide-Format in sage und schreibe 10 Sprachen. In genau
derselben Anzahl der Sprachen ist auch das Spiel spielbar. Die umfangreiche
Sprachausgabe ist aber nur in Englisch verf&uuml;gbar. Bevor man das Spiel
startet, kann man sich wahlweise noch ein ca. 7 Minuten langes gerendertes
Intro ansehen. Man kann das Spiel aber auch ohne das Intro starten.
Schauplatz des Spiels ist der Mond Uropa. Auf diesem Mond befindet sich die
Kolonie Uropa2, die aus 12 Stationen besteht, die durch ein Netzwerk
miteinander verbunden sind. Der Spieler erh&auml;lt die Aufgabe, die b&ouml;sen
Kapones zu bek&auml;mpfen, deren Anf&uuml;hrer zu finden und so viele Kolonisten wie
m&ouml;glich zu retten.<BR>
Das Spiel verf&uuml;gt &uuml;ber 10 Einzelmissionen, die jeweils beendet werden
m&uuml;ssen, bevor man die n&auml;chste Mission in Angriff nehmen kann. Jede Mission
verf&uuml;gt &uuml;ber sehr unterschiedliche Aufgaben, wie Zerst&ouml;rungen, Rettungen,
Reparaturen usw. Der gr&ouml;&szlig;te Teil des Spiels findet dabei in den R&auml;umen
der Kolonie statt, die aus einer isometrischen 3D-Grafik bestehen. Die
Sicht f&uuml;hrt am Anfang des Spiels zwar zu Schwierigkeiten mit der Steuerung,
je l&auml;nger man Uropa2 spielt, um so mehr gew&ouml;hnt man sich aber daran. Man
steuert &uuml;brigens einen Roboter, der anfangs &uuml;ber ein Laserschwert verf&uuml;gt,
aber auch andere Waffen und Gegenst&auml;nde aller Art einsammeln kann bzw.
mu&szlig;. Dieser Teil des Spiels erinnert vom Spielprinzip etwas an den Bitmap
Brothers-Klassiker Cadaver. Man l&auml;uft durch verschiedene R&auml;ume, macht
Gegner unsch&auml;dlich, l&ouml;st R&auml;tsel, durchsucht Gegenst&auml;nde, benutzt Computer
zum Download von Daten und Informationen, usw.<BR>
Der andere, geringere Teil des Spiels ist ein Shoot Em Up in einer
3D-Vektorlandschaft. Diese Abschnitte des Spiels sind zwar in der
Minderheit, die erfolgreiche Absolvierung ist jedoch f&uuml;r den Erfolg einiger
Missionen zwingend erforderlich. Diese Spielabschnitte sind auch die
einzigen M&ouml;glichkeiten des Reisens von Basis zu Basis. Dieser
Spielabschnitt steht in einem Gegensatz zum Hauptteil des Spiels, werden
hier doch keine R&auml;tsel gel&ouml;st. Statt dessen hat der Spieler nahezu nur die
Aufgabe zu ballern.<BR>
Im sogenannten HoverWar kann man das 3D-Shoot-Em-Up auch losgel&ouml;st vom
eigentlichen Spiel mittels serieller Verbindung zweier AMIGAs zu zweit
gegeneinander spielen. Ein netter Bonus, der aber mit dem eigentlichen
Spiel nicht viel zu tun hat.<BR>
Alle Aspekte der Story und des Spielablaufs von Uropa2 aufzuf&uuml;hren, w&uuml;rde
den Rahmen sprengen, zu durchdacht ist jedes Detail des Spiels.
Uropa2 verf&uuml;gt zwar nicht &uuml;ber eine brilliante Grafik, daf&uuml;r aber &uuml;ber
ein gutes Intro und eine sehr gute Sprachausgabe.<BR>
Der sehr logische Spielablauf und die umfangreichen Missionen f&uuml;hren dazu,
da&szlig; die Langzeitmotivation sehr hoch ist. Alle Fans von Action-Adventures
mit R&auml;tsel-Elementen k&ouml;nnen zuschlagen, andere Interessierte sollten sich
einfach das Demo des Spiels, das auch im Aminet verf&uuml;gbar ist, anschauen.<P>
<PRE>
Grafik:       7/10
Sound:        8/10
Handhabung:   8/10
Spielspa&szlig;:    8/10

GESAMT:       78 %

</PRE>
<B>Systemvoraussetzungen:</B><BR>
Festplatte + mind. 2 MB RAM<P>
erh&auml;ltlich im Handel/Versand<BR>
empfohlener Verkaufspreis: 29.99 englische Pfund<P>
<B>Fazit:</B><BR>
gut gelungenes Spiel, das alle Fans von Action-Adventures voll auf
ihre Kosten kommen l&auml;&szlig;t.<P>
Anmerkung zum Wertungssystem: AMIGA AGPJ m&ouml;chte sich nicht dem Trend in
vielen (allen ?) Amiga-Zeitschriften anschlie&szlig;en, die nahezu allen
Produkten von vornherein 90 Prozent geben. Je nachdem, wie gut das Spiel
ist, bekommt es dann noch einige Prozent dazu.<BR>
Ein Spiel, das in AMIGA AGPJ 70 Prozent bekommt, ist keineswegs schlecht.
Nur wirkliche Spielehits bekommen in AMIGA AGPJ eine Wertung von &uuml;ber 85
Prozent und somit einen AMIGA AGPJ Award.
<CENTER><BR><A HREF="0209.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0211.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

