<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 - Diverse News</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amidn.gif" ALT="Amiga-Aktuell 10/97 - Diverse News" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H2 ALIGN=CENTER>1. AMIGA Magazin wird als eigenst&auml;ndige Zeitschrift eingestellt</H2>
F&uuml;r AMIGA-aktuell-Leser war diese Meldung vom 10. Dezember fast schon ein
"alter Hut", berichteten wir doch bereits in Ausgabe 12/97 &uuml;ber das
bevorstehende Ereignis - lediglich die offizielle Best&auml;tigung durch den
MagnaMedia-Verlag fehlte damals noch.<BR>
Mit Erscheinen der AMIGA-Magazin-Ausgabe 1/98 hat die Redaktion die Karten
auf den Tisch gelegt: Das AMIGA Magazin wird als eigenst&auml;ndige Zeitschrift
eingestellt. Die Abonnenten erhalten zuk&uuml;nftig die (ab Januar '98) im WEKA
Computerzeitschriften-Verlag erscheinende "PCgo!" inkl. einer 32-seitigen
Beilage mit dem Titel "AMIGA High Tech" sowie alle zwei Monate eine "AMIGA-
Bonus-CD". Die w&ouml;chentliche AMIGA-Magazin-Hotline soll erhalten bleiben.
Weiterhin "solo", d.h. ohne AMIGA-Beilage erscheinen wird die PCgo! im
Zeitschriftenhandel und f&uuml;r regul&auml;re PCgo!-Abonnenten.<P>
&Uuml;brigens hat AMIGA aktuell aus verl&auml;&szlig;licher Quelle erfahren, da&szlig; zumindest
ein Redakteur des AMIGA-Magazins ganz und gar nicht mit der neuen
Erscheinungsweise einverstanden ist.<P><BR>
<H3 ALIGN=CENTER>Kommentar:</H3>
Nun haben wir also Gewi&szlig;heit. Wer die entsprechende Meldung in der letzten
AMIGA aktuell bislang noch nicht fassen konnte oder wollte, mu&szlig; sie
sp&auml;testens jetzt als die traurige Wahrheit zur Kenntnis nehmen.
Denn f&uuml;r viele AMIGA-Anwender war das AMIGA Magazin bis vor nicht allzu
langer Zeit eindeutig die qualitativ beste AMIGA-Zeitschrift. Leider jedoch
machten Redaktion, Verlag und Management in den letzten Monaten und Jahren
mehrere verheerende Fehler, die allm&auml;hlich zum Niedergang und jetzt zu der
Quasi-Einstellung des AMIGA Magazins f&uuml;hrten.<P>
Bis 1995 war die Welt noch &uuml;berwiegend in Ordnung. Zwar betrug die
durchschnittliche Seitenst&auml;rke schon damals nur etwa 132 Seiten (zum
Vergleich: Ende 1993 waren es noch knapp 200 Seiten), was auch auf eine
widersinnige Anzeigen-Preispolitik zur&uuml;ckzuf&uuml;hren ist, jedoch war das AMIGA
Magazin die erste deutschsprachige AMIGA-Zeitschrift, die regelm&auml;&szlig;ig mit
Cover-CD-ROM erschien. Aber schon wenige Monate sp&auml;ter nach dieser
fortschrittlichen Entscheidung wurde der erste gro&szlig;e Fehler gemacht: Die
Cover-CD-ROM wurde der Kostensenkung geopfert und war fortan nur noch auf
Bestellung und f&uuml;r Abonnenten erh&auml;ltlich. Da&szlig; sich die AMIGA-Magazin-CD nie
gr&ouml;&szlig;erer Beliebtheit erfreute, verdankt sie einer v&ouml;llig verfehlten
Schwerpunktsetzung: So wurde eigens eine spezielle Benutzeroberfl&auml;che
programmiert, aber der qualitative Inhalt der CD vernachl&auml;ssigt. Sogar das
Konkurrenz-Blatt AMIGA Special hat mittlerweile, und offenbar noch
rechtzeitig, eingesehen, da&szlig; eine Zeitschrift ohne Cover-Datentr&auml;ger, am
besten mit mindestens einer Software-Vollversion (allein schon der Begriff
zieht K&auml;ufer an), l&auml;ngerfristig keine Chance hat, auf dem kleinen AMIGA-
Markt zu bestehen - zu dieser naheliegenden Erkenntnis ist das AMIGA-
Magazin leider nicht gekommen. Der zweite verh&auml;ngnisvolle Fehler war eine
rigorose Sparpolitik, jedoch an der v&ouml;llig falschen Stelle: bei den
Redakteuren. Konnte die Zeitschrift bis 1996 mit einer aus kompetenten
AMIGA-Kennern zusammengesetzten Redaktion aufwarten, hat sich dies im
darauffolgenden Jahr gr&uuml;ndlich ge&auml;ndert: Unter einem neuen Chefredakteur
(dem dritten innerhalb von drei Jahren) wurde die Zahl der festangestellten
Redakteure auf ein Minimum verringert, oder anders formuliert:
Redaktionsmitglieder, die zur PCgo! wechselten, wurden nicht durch neue
Kr&auml;fte ersetzt.<BR>
Sofern gen&uuml;gend freie Mitarbeiter zur Verf&uuml;gung stehen, mu&szlig; ein solcher
Schritt nicht zwangsl&auml;ufig negative Konsequenzen haben. Dies war jedoch
zun&auml;chst nicht der Fall, was dazu f&uuml;hrte, da&szlig; der redaktionelle Inhalt in
den Ausgaben von Anfang 1997 auf ein unertr&auml;gliches Ma&szlig; zusammenschrumpfte.
Auch wenn die inhaltliche Qualit&auml;t in den darauffolgenden Monaten
allm&auml;hlich wieder anstieg, erweckten die Hefte trotzdem den Eindruck einer
"lieblosen" Zusammenstellung, was nicht zuletzt auch auf die weiter
gesunkene Seitenzahl (zuletzt nur 76 Seiten) zur&uuml;ckzuf&uuml;hren ist.
Einen ersten Todessto&szlig; schlie&szlig;lich wurde der Zeitschrift mit den
Einschr&auml;nkungen in der Distribution versetzt: Seit Ende 1997 war das Heft
nur noch im Abonnement und in Bahnhofsbuchhandlungen erh&auml;ltlich. Bereits
ein Jahr zuvor war die AMIGA-Magazin-Sonderheft-Reihe, die erst Anfang 1996
gestartet wurde, komplett gestrichen worden.<BR>
Auch lie&szlig;en 1997 Aff&auml;ren um einen rechtsextremen Redakteur und ein
angeblich gef&auml;lschtes Interview mit Petro Tyschtschenko, sowie &uuml;berhastete
Entscheidungen (zun&auml;chst Integration des AMIGA-Games-Spieleteils, der
wenige Monate sp&auml;ter wieder entfernt wurde), das AMIGA Magazin in einem
immer schlechteren Licht erscheinen.<BR>
Es w&auml;re unehrlich, zu verschweigen, da&szlig; auch die schlechte AMIGA-Situation
ihren Anteil am Niedergang des AMIGA-Zeitschriftenmarktes hat. Bedenkt man
jedoch, da&szlig; die AMIGA Plus sich in einer recht guten Verfassung (sowohl aus
inhaltlicher als auch aus betriebswirtschaftlicher Sicht) befindet, die
AMIGA Special ihre Krise, die zur zweimonatlichen Erscheinungsweise f&uuml;hrte,
offensichtlich &uuml;berwunden hat, und da&szlig; sowohl die media Verlagsgesellschaft
als auch der ICP-Verlag die Herausgabe neuer AMIGA-Zeitschriften wagen,
wird deutlich, da&szlig; das AMIGA Magazin in erster Linie an sich selbst
eingegangen ist.<BR>
Und auch, wenn es sich um zwei v&ouml;llig unterschiedliche Paar Schuhe handelt:
Viele der getroffenen Fehlentscheidungen erinnern an die
Unternehmenspolitik von Commodore.
<CENTER><BR><A HREF="0700.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0702.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div1.gif" ALT="[diverse News]" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

