<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 01/98 Abschlie&szlig;end</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">
<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisc.gif" ALT="Amiga-Aktuell 10/97 - Abschlie&szlig;end" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<H1 ALIGN=CENTER>Abschlie&szlig;end</H1>
Verglichen mit den Vorjahren verlief 1997 f&uuml;r den AMIGA gar nicht so
schlecht. Gerade wer sich in den letzten Wochen und Monaten (und speziell
auf der Computer 97) einen &Uuml;berblick &uuml;ber den AMIGA-Hard- und Softwaremarkt
verschaffte, konnte durchaus positive Tendenzen wahrnehmen: So langsam
scheint der AMIGA-Markt aus einer Art Ohnmacht, von der er zwischen 1994
und 1996 erfa&szlig;t war, zu erwachen.<P>
Diese Tendenzen - es ist wohlgemerkt noch KEIN deutlicher, und erst recht
kein selbsttragender Aufschwung - haben wir im wesentlichen zwei
Ereignissen und deren Folgen zu verdanken:<P>
<UL>
<LI>Dem Ende M&auml;rz erfolgten Aufkauf der AMIGA-Technologie durch Gateway 2000
<LI>Dem Erscheinen der CyberstormPPC-Karten von phase 5 im September
</UL><P>
Das erste hat nicht nur die symbolische Bedeutung, da&szlig; es endlich wieder
einen Inhaber der AMIGA-Rechte gibt, der sich um eine Weiterentwicklung der
durch die beiden Konkurse jahrelang zum Stillstand verdammten AMIGA-
Technologie k&uuml;mmern will, nein, ohne den Aufkauf w&auml;ren auch die
verschiedensten Lizensierungen im Laufe des vergangenen Jahres nicht
m&ouml;glich gewesen, so da&szlig; z.B. AMIGA-kompatible Computer mit neuentwickelten
Mainboards nicht legal verkauft werden d&uuml;rften.<P>
Das zweite Ereignis, PowerUp, hat uns einen gewaltigen Schub bei der
Rechenleistung beschert. Leider sind PowerUp-Umsetzungen bekannter AMIGA-
Programme bislang noch nicht in der Anzahl erschienen, die ich mir
pers&ouml;nlich erhofft habe. Vielleicht &auml;ndert sich dies ja jetzt nach dem
Erscheinen der PPC-Erg&auml;nzung f&uuml;r den SAS/C-Compiler bzw. mit der
Verf&uuml;gbarkeit der PowerUp-Karten f&uuml;r den A1200. Angepeilter Termin hierf&uuml;r:
Ende Januar.<P>
Als prim&auml;res Ziel mu&szlig; 1998 und in den Folgejahren gelten, den Absatz von
AMIGAs und kompatiblen Rechnern zu steigern. Denn nur, wenn es gelingt,
allm&auml;hlich einen gr&ouml;&szlig;eren Marktanteil unter den Computersystemen zu
erreichen, besteht die Chance, da&szlig; Firmen, die den AMIGA w&auml;hrend der Krise
verlassen haben, wieder auf den Zug aufspringen,<P>
Solange die Entwicklung einer vollkommen neuen AMIGA-Generation noch nicht
abgeschlossen ist, bleibt als einziger Weg in diese Richtung nur eine
konsequent niedrige Preispolitik. AMIGA International hat dies richtig
erkannt, mit der Folge, da&szlig; der K&auml;ufer eines neuen A1200 mittlerweile bei
einigen H&auml;ndlern nicht einmal mehr DM 450,- zu berappen braucht.
Nicht verschwiegen werden jedoch soll, da&szlig; es AMIGA International ohne
diese "Preiskur" wohl kaum gel&auml;nge, die hohen A1200-Lagerbest&auml;nde
abzubauen.<P>
F&uuml;r die AMIGA-Entwicklungsabteilung bedeutet 1998 ein Jahr harter Arbeit,
gilt es doch, schnellstm&ouml;glich einen Entwicklungsr&uuml;ckstand von f&uuml;nf Jahren
wettzumachen. Um so unverst&auml;ndlicher ist, da&szlig; sich seit der Computer '97
selbst in der Personalfrage - vorrangig ist ja die Einstellung von
Entwicklern - offenbar nichts getan hat, wie eine Anfrage von AMIGA aktuell
bei Petro Tyschtschenko ergab. Der Pr&auml;sident von AMIGA International lie&szlig;
durchblicken, da&szlig; er selbst nicht zufrieden mit den bisherigen Ergebnissen
von AMIGA, Inc. ist. Ihm kann man freilich keinen Vorwurf machen, ist er
doch ausschlie&szlig;lich f&uuml;r Verkauf und Marketing zust&auml;ndig - die
Entwicklungsabteilung wird dagegen von den USA aus gef&uuml;hrt.<P>
Allerdings gilt es hier, Ruhe zu bewahren: Jeff Schindler, Chef von AMIGA,
Inc., hat auf der Entwicklerkonferenz am 14. November in K&ouml;ln erkl&auml;rt, da&szlig;
sein Unternehmen _weltweit_ nach den besten Entwicklern sucht.
Wenn es eine gewisse Zeit beansprucht, die richtigen Leute zu finden, dann
sollten wir noch etwas Geduld beweisen.<P>
Wollen wir also hoffen, da&szlig; dies nur eine Art Ruhe vor dem Sturm ist. Denn
eines d&uuml;rfte sicher sein: 1998 wird ein f&uuml;r den AMIGA entscheidendes Jahr -
im wahrsten Sinn des Wortes.<P>
Damit bis n&auml;chsten Monat,<P>
Euer<P>
Carsten Schr&ouml;der

<CENTER><BR><A HREF="0900.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<IMG SRC="../gfx/0nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 01/98</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0100.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0200.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0300.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0400.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0600.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0700.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0800.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0900.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="1000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl1.gif" ALT="[Absclie&szlig;end]" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

