<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://batman.jypoly.fi/~saku/">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/thoriel.jpg" alt="Anu" height="193" width="187" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Minulla oli hieno p&auml;&auml;kirjoitus. Mutta Janne ehti taas ensin ja kirjoitti P&auml;&auml;kirjoituksen. Oikeasti, olemme monesti IRCiss&auml; nauraneet sit&auml;, kuinka minusta on tullut Janne - ja Jannesta v&auml;lill&auml; min&auml;. Mist&auml;&auml;n sukupuolenvaihdoksesta ei sent&auml;&auml;n ole kyse. Olemme vain olleet tavalla tai toisella mukana yhdistyksen toiminnassa ja seuranneet Amiga-maailman tapahtumia niin kauan, ett&auml; linjanvetomme muistuttavat v&auml;lill&auml; toisiaan. Toisaalta my&ouml;s pid&auml;mme toisiamme v&auml;h&auml;n aisoissa. Milloin min&auml; olen vinkumassa el&auml;kkeelle p&auml;&auml;sy&auml; ja Janne sanoo ykskantaan &quot;EI.&quot; Tai kun 10-vuotisjuhlan kunniaksi p&auml;&auml;tet&auml;&auml;n vuokrata Silja Opera ja on minun vuoroni sanoa &quot;EI.&quot; Toisaalta on sitten hetki&auml;, kun muistelemme menneit&auml;... aikaa, jolloin min&auml; upotin 700 silloista markkaa Amiga SDK:n ostoon tuosta vain ja Janne aikaa ja kyyneli&auml; sen testaamiseen. Haluaako joku ostaa hyvin v&auml;h&auml;n k&auml;ytetyn SDK:n edullisesti...?<br>
							<br>
							T&auml;n&auml; vuonna ei tullut Saku-tapahtumaa, mutta muuten yhdistys eteni varsin j&auml;rk&auml;ht&auml;m&auml;tt&auml; polullaan. Tiliasiat saatiin kuntoon, viiden ensimm&auml;isen tilikauden kirjanpito on valmis ja niiden aikaisille hallituksille on my&ouml;nnetty yksimielisesti vastuuvapaus. Ja j&auml;rjestimmeh&auml;n me lopulta varsin muikean vuosikokouksen. Alkuun n&auml;ytti kaikki vastustavan. Esittelykoneeseen piti l&auml;hte&auml; haalimaan n&auml;ytt&ouml;&auml; ja koteloa powereineen tapahtumap&auml;iv&auml;n&auml;, kun emme olleet saaneet etuk&auml;teen tietoa siit&auml;, ett&auml; sellaiset tarvitaan. Verkko-ongelmat l&ouml;iv&auml;t kynsille, ja kokoustilan varanneena allekirjoittanut &quot;ahistui&quot;, kun ei ollut ottanut asiasta tarpeeksi selv&auml;&auml; etuk&auml;teen.<br>
							<br>
							Etsiskelin jo sopivaa sein&auml;&auml; otsalohkon ly&ouml;miseksi siihen, kun kaiken taistelun j&auml;lkeen asiat kuitenkin l&auml;htiv&auml;t joten kuten luistamaan. Internet-tarjonta tosin supistui, kun web-kamera ja Shoutcast-l&auml;hetys saatiin toimimaan useita tunteja ilmoitettua my&ouml;hemmin. Mutta p&auml;&auml;asia t&auml;ss&auml; mielest&auml;ni oli, ett&auml; periksi ei annettu. #saku-kanavalla meit&auml; auttoi moni kanavalle osunut, ja yhteisvoimin homma saatiin toimimaan mutkien kautta.<br>
							<br>
							Siit&auml; t&auml;ss&auml; hommassa on kyse. Saku ja yhdistys on kauan sitten lakannut olemasta Amigan tai mink&auml;&auml;n muunkaan firman aisankannattaja. Meill&auml; on h&auml;peilem&auml;tt&auml; oma lehm&auml; ojassa, ja siit&auml; me ensisijaisesti huolta pid&auml;mme. Totta, meit&auml; yhdist&auml;&auml; aikanaan leimahtanut rakkaus Amigaan, mutta vuosien varrella asioille on syntynyt tietty t&auml;rkeysj&auml;rjestys. Yhdistys ja sen j&auml;senet ensin, muut asiat sitten. Siksi me olemme viel&auml; olemassa kaikkien n&auml;iden vuosien j&auml;lkeen.<br>
							<br>
							Jonkinlaista luonteenlujuutta edustaa my&ouml;s se seikka,&nbsp;ett&auml; Saku-lehden 11. vuosikerta starttaa ensi vuonna. Artikkelim&auml;&auml;r&auml; on valitettavasti ollut tasaisessa laskussa, ja haluankin ev&auml;st&auml;&auml; t&auml;ss&auml; kaikkia lukijoita ensi vuoteen. Jos ja kun uusia tuotteita tulee ensi vuonna markkinoille ja tulet sellaisia hankkineeksi, kirjoita ihmeess&auml; siit&auml; juttu Sakuun, vaikka pienikin. Ei tekstin tarvitse olla Nobel-tasoista - t&auml;m&auml; on lehti harrastajalta toiselle, ja t&auml;&auml;ll&auml; toimituksessa kyll&auml; oiotaan pahimmat mutkat. Lehte&auml; ei olisi olemassa ilman teit&auml;, ja jokaiselle jutulle on varmasti lukijoita. <br>
							<br>
							Vuosikokouksessa kaiken myllerryksen sivussa istuimme Jannen kanssa hiljentyneess&auml; sivup&ouml;yd&auml;ss&auml;. Janne n&auml;pytteli l&auml;pp&auml;ri&auml;&auml;n ja min&auml; katselin Pegasoksen ja GE:n p&ouml;yd&auml;n ymp&auml;rill&auml; kuhisevaa ja iloisesti purpattavaa k&auml;vij&auml;parvea. Hymyilin. Janne kysyi, mille nauran.<br>
							<br>
							&quot;T&auml;m&auml;n takia t&auml;t&auml; hommaa tehd&auml;&auml;n&quot;, sanoin. Ja se on totuus. Ei Amigan, ei Thendic-Francen, ei kenenk&auml;&auml;n muun. Meid&auml;n.</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							<br>
							
							
							Anu Seilonen<br>
							
							
							P&auml;&auml;toimittaja<br>
						</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>