<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://batman.jypoly.fi/~saku/">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><a name="top"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:janne.siren@helsinki.fi">janne.siren@helsinki.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/janne.jpg" alt="Janne" height="150" width="346" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Minulla oli hieno p&auml;&auml;kirjoitus. No, en tied&auml; oliko se niin hieno. Ainakin se oli pitk&auml;. Se k&auml;sitteli joidenkin Amigan ymp&auml;rill&auml; toimivien yritysten k&auml;mm&auml;yksi&auml;, toistuvia puolitotuuksia ja muita peittelyit&auml; viime vuosilta. N&auml;ihin on syyllistynyt luvattoman moni. Naureskelimme p&auml;&auml;toimittaja Anu Seilosen kanssa pitkin syksy&auml; Saku-lehden uutispalstankin muistuttavan yh&auml; enemm&auml;n vitsinurkkaa. Kuka niit&auml; extreme executive -uutisia jaksaa en&auml;&auml; vakavalla naamalla lukea - niist&auml; kirjoittamisesta nyt puhumattakaan.<br>
							<br>
							Se oli perusteellinen p&auml;&auml;kirjoitus, tai ainakin olisi ollut valmistuttuaan. K&auml;ydess&auml;ni l&auml;pi kymmeni&auml; l&auml;hdeviitteit&auml; totesin, ett&auml; meille on sy&ouml;tetty tuhottomasti pajunk&ouml;ytt&auml; odotellessamme Amigoita ja sen monen monituisia seuraajia. Jopa moni aiemmin arvostamani taho on ryvett&auml;nyt itsens&auml; pahasti t&auml;ss&auml; sopassa, kun rehellisyys sek&auml; avoin ja yleis&ouml;&auml; kunnioittava asenne on unohtunut teknisten ja taloudellisten vaikeuksien kurimuksessa. Moni yritys, jolle olisin aikaisemmin suonut ja jolle olen aikaisemmin suonut vapaa-aikaani ja apuani, on menett&auml;nyt luottamukseni - ja tukeni.<br>
							<br>
							Et l&ouml;yd&auml; sit&auml; p&auml;&auml;kirjoitusta t&auml;st&auml; lehdest&auml; etk&auml; tulevistakaan. Ei sill&auml;, ett&auml; haluaisin asioita peitell&auml;. En vain usko, ett&auml; tapahtumia pystyisi en&auml;&auml; kiteytt&auml;m&auml;&auml;n tavalla, joka tyydytt&auml;isi lukijaa ja palvelisi totuutta. Tapahtumat on dokumentoitu moneen kertaan Amiga-yhteis&ouml;n kohtaamispaikoissa, ja sielt&auml; ne jokainen valveutunut lukija voi kaivaa ja muodostaa omat mielipiteens&auml;. Ja niinh&auml;n monet tekev&auml;tkin. Keskusteluissa kohtaamme p&auml;ivitt&auml;in niit&auml;, joiden mielest&auml; se toinen yritys on kaiken pahan alku ja juuri, ja niit&auml;, joiden mielest&auml; n&auml;in ei ole vaikka tapahtuisi mit&auml;. Ja p&auml;invastoin.<br>
							<br>
							Minun kirjoitukseni ei t&auml;t&auml; todellisuutta muuta suuntaan eik&auml; toiseen. Vaikka saisin kaikki suuret linjat kohdalleen, l&ouml;ytyy aina joku porsaanreik&auml; tai pieni toivon kipin&auml;, jolla selitt&auml;&auml; kaikki ik&auml;v&auml;t asiat. Tai vastaavasti antaa oikeuden manata tekij&auml;t ja tapahtumat syvimp&auml;&auml;n helvettiin. Amiga-yhteis&ouml;ss&auml; objektiivisuus j&auml;tti talon jo kauan sitten, ja nyt j&auml;ljell&auml; on liuta apologisteja ja fanaatikkoja - sek&auml; sitten se kourallinen niit&auml; inhorealisteja, jotka her&auml;siv&auml;t kahvin tuoksuun ajat sitten, mutta eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; en&auml;&auml; haista sit&auml;k&auml;&auml;n omalta kyynisyydelt&auml;&auml;n. Min&auml; lienen t&auml;ss&auml; viimeisess&auml; ryhm&auml;ss&auml;. Suomessa tilanne on meill&auml; sent&auml;&auml;n inhimillisempi, mutta kuitenkin.<br>
							<br>
							Viattomuuden aika on ohi. Suurin osa Amiga-yhteis&ouml;lle tehdyist&auml; lupauksista on rikottu ties mist&auml; syyst&auml; ja ties kuinka monta kertaa. Ovat rikkoneet my&ouml;s ne, jotka ovat aina vakuuttaneet meille rehellisyytt&auml;&auml;n. Toimitus- ja talousvaikeuksia on peitelty niin monta kertaa, ett&auml; yh&auml; harvempi jaksaa en&auml;&auml; ottaa selityksi&auml; todesta. Yh&auml; useampi tiet&auml;&auml; kaiken t&auml;m&auml;n. Siin&auml; vaiheessa kun yhteis&ouml; v&auml;&auml;nt&auml;&auml; k&auml;tt&auml; siit&auml;, onko jonkin yrityksen puhelinlinjojen sulkeminen ilman ilmoitusta merkki ammattimaisesti k&auml;yt&ouml;ksest&auml; vai ei, olemme aika syv&auml;ll&auml;. Mutta aina l&ouml;ytyy joku selitt&auml;m&auml;&auml;n se viimeinenkin fiasko. Ja joku tuomitsemaan. T&auml;h&auml;n on lempikonemerkkimme tullut.<br>
							<br>
							Niin. Nyt me tappelemme siit&auml;, tarjoaako vakavasti otettava yritys ilmaisia laitteita potentiaaliselle yhteisty&ouml;kumppanille julkisessa keskustelufoorumissa. Tai siit&auml;, onko oikein mainostaa lasten juniorijalkapallojoukkueen paidoissa. Tai siit&auml; mit&auml; se kaksitoista kuukautta oikeasti tarkoittaakaan. Tai se kolme viikkoa. Ja kuinka kallis oikeasti on paketoitu Linux-distro ja mill&auml; teknikaliteetilla selit&auml;mme sen kommentin, ettei hardware-donglea vaaditakaan, vaikka se oikeasti vaaditaan. Tai ett&auml; saako piraattien kiintolevyjen tunnistetietoihin kajota. Tai sy&ouml;mmek&ouml; sinisi&auml; pillereit&auml;.<br>
							<br>
							Valhekaan ei en&auml;&auml; ole valhe, kun asiat voidaan selitt&auml;&auml; kaikenmaailman clintoneita pelastaneella lakimieslogiikalla - tai vedota viimeist&auml;&auml;n siihen, ett&auml; me maallikot emme ymm&auml;rr&auml;, kuinka vaikeaa venture capital -rahalla el&auml;vill&auml; yrityksill&auml; on ja kuinka paljon he ovat uhranneet vain meid&auml;n t&auml;htemme ja kuinka meid&auml;n vain pit&auml;isi sokeasti jatkaa rahojemme ja vapaa-aikamme syyt&auml;mist&auml; johonkin pohjattomaan ja kiitt&auml;m&auml;tt&ouml;m&auml;&auml;n kaivoon&#x2026; Kaivoon, joka muistaa aina v&auml;lill&auml; hokea &quot;Tukekaa meit&auml;!&quot;, mutta joka ei vaivaudu olemaan kanssamme rehellinen, koska rehellisyys ei ilmeisesti kannata, ja meid&auml;n pit&auml;isi ymm&auml;rt&auml;&auml; se.<br>
							<br>
							Hyv&auml;t naiset ja herrat, t&auml;t&auml; kaikkea on Amiga-tietokone vuonna 2002.<br>
							<br>
							Muistan viel&auml; ajan, kun se oli ylivoimaista grafiikkaa, parasta &auml;&auml;nt&auml;, johtavaa suorituskyky&auml; ja upea moniajok&auml;ytt&ouml;j&auml;rjestelm&auml;. Nyt se on jatkuvaa nahistelua, ideologiaa ja sokeaa yrityspalvontaa. Ket&auml;&auml;n ei en&auml;&auml; kiinnosta, onko teknologia erinomaista tai tuotteet laadukkaita, nyt ratkaisevat tavaramerkit, keinotekoiset puoluerajat ja jokamiehen k&auml;sitykset laeista ja yrityskulttuurista. Hiljattain er&auml;s ulkomaalaisen foorumin k&auml;ytt&auml;j&auml; aivan tosissaan totesi minulle, ettei Amiga koskaan ole merkinnyt teknologista etevyytt&auml;. Amiga 500 oli h&auml;nen mukaansa t&auml;ysin keskinkertainen juttu, ainakin heti kun t&auml;m&auml; keskikertaisuus toimi argumenttina puolustaa jotain nykyist&auml; yritysjumalaa. Katin kontit, Amiga 500 oli 80-luvun upein kotitietokone ja voitti siksi, ett&auml; se oli teknisesti paras - &auml;lk&auml;&auml;k&auml; antako kenenk&auml;&auml;n kertoa teille toisin.<br>
							<br>
							T&auml;m&auml; kaikki on j&auml;tt&auml;nyt minut tavattoman pettyneeksi ihmisiin ja yrityksiin maailmalla. Suomessa olemme olleet kokolailla immuuneja t&auml;lle hullunmyllylle, mist&auml; kiitos asianosaisille, mutta ei t&auml;t&auml; kaikkea ole t&auml;&auml;lt&auml;k&auml;&auml;n kovin hyv&auml;ll&auml; mielell&auml; voinut katsella. Toisin kuin viel&auml; muutama vuosi sitten, t&auml;m&auml;n p&auml;iv&auml;n Amiga-maailmasta ei pahemmin l&ouml;ydy yrityksi&auml;, joille jaksaisin en&auml;&auml; talkooapuani tarjota tai muutenkaan lippua kantaa. Ilopilkut ovat harvassa. Lojaalius tai aate ei merkitse mit&auml;&auml;n. Eik&auml; se ei olisi koskaan saanutkaan merkit&auml; mit&auml;&auml;n - olemme kadottaneet asian ytimen, sen mit&auml; Amiga oikeasti tarkoitti. Se on tuossa ylh&auml;&auml;ll&auml;. Amiga oli aikansa paras kotitietokone. Ei mik&auml;&auml;n uskonto tai nimikultti.<br>
							<br>
							Read my lips: Amiga oli aikansa paras kotitietokone. Ei mik&auml;&auml;n uskonto tai nimikultti.<br>
							<br>
							Kirjoitan t&auml;t&auml; p&auml;&auml;kirjoitusta vuoden 2002 k&auml;ydess&auml; pian mailleen. Kirjoitan, koska meill&auml; on viel&auml; hetki aikaa ottaa opiksi - sill&auml; se, joka unohtaa historian, on tuomittu toistamaan sit&auml;. Jaa, ett&auml; miksik&ouml; on kiire? Koska kaikesta tapahtuneesta huolimatta vuosi 2003 tulee lunastamaan sen kauan kaivatun lupauksen - Amiga saa seuraajan, jopa kaksi sellaista. Virallisen ja ep&auml;virallisen. T&auml;ll&auml; kertaa ne tulevat, se on varmaa. Ja kun pienet markkinat viimein saavat potkua uusista tuotteista, menestyiv&auml;t ne tai eiv&auml;t, tulevat tapahtumat keskittym&auml;&auml;n niihin. Puheet on puhuttu ja teot alkavat laulaa. Valheetkin unohtuvat, ik&auml;v&auml; kyll&auml;. Niinp&auml; juuri nyt on oikea hetki mietti&auml; kaikkea tapahtunutta ja sit&auml;, mit&auml; siit&auml; voisi ottaa opiksi.<br>
							<br>
							Henkil&ouml;kohtainen valintani on selv&auml;. &Auml;&auml;nest&auml;n lompakollani. Amiga-tuotemerkin varjolla ja sen rinnalla on vuosien saatossa kaupiteltu ties mit&auml; soopaa, milloin virallisesti ja milloin ep&auml;virallisesti. En koe, ett&auml; monikaan yritys ansaitsee en&auml;&auml; tukeani, joten tyydyn kohtelemaan niit&auml; kuten mit&auml; tahansa markkinatalouden pelinappuloita - kysynn&auml;n ja tarjonnan laki ratkaisee. Tarjotkaa minulle hyv&auml; tuote hyv&auml;&auml;n hintaan, joko harrastukseeni tai liiketoimintaani, niin min&auml; ostan. En palvo enk&auml; saarnaa ilosanomaanne, mutta hyv&auml;&auml; ja minulle tarpeellista tuotetta vastaan luovun euroistani ilomielin. Ja jos se tuote on todella hyv&auml;, ehk&auml; kehaisen kaverillekin, ja katsotaan siit&auml; sitten eteenp&auml;in. Huonoa en osta enk&auml; tue. En edes keskinkertaista, ellen jostain syyst&auml; sit&auml; tarvitse.<br>
							<br>
							N&auml;ist&auml; asetelmista ponnisti my&ouml;s aikansa paras kotitietokone Amiga, joskus silloin 80-luvulla. Se oli paras, ja ihmiset halusivat sellaisen. Ja kehaisivat muuten kaverillekin. Minullekin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Janne Sir&eacute;n</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../etusivu.html" target="_self">Etusivulle</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><a href="../sivukartta.html" target="_self">Sivukartta</a>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font></td>
				</tr>
			</table>
		</center>
	</body>

</html>