<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Interview: Stefan Burstroem</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Interview</U></H1></A><BR>mit<BR><A HREF="mailto:stefan@comnipresence.com">Stefan Burstr&ouml;m</A></CENTER>

<P>Stefan Burstr&ouml;m ist der Programmierer des im Moment im Amiga-
Bereich erfolgreichsten Web-Browsers (lt. diversen Zugriffsstatistiken) <B>IBrowse</B>.</P>
<P>Andreas Schlick f&uuml;hrte mit ihm im IRC folgemdes Interview auf
Englisch und &uuml;bersetzte es ins Deutsche.</P>

<P>Desweiteren wurde uns freundlicherweise ein <A HREF="ivss.htm">Bild</A> von Stefan und Rüdiger überlassen.
Das Copyright des Bildes liegt bei Thomas Svenson/Amiga Info 1996.</P>

<P>
AmZ: AmZeiger (Andreas Schlick)<BR>
SB : Stefan Burstr&ouml;m </P>

<HR>


<TABLE BORDER=1>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Hallo, Stefan. Du bist der Hauptprogrammierer von IBrowse, aber Du programmierst nicht alleine daran, oder? Also, wer arbeitet noch an IBrowse und wer ist Omnipresence?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Hallo. Nett von Dir dieses Interview zu arrangieren.<BR>
Erstmal wurde Omnipresence Intl. vor zwei Jahren von den Hauptprogrammierern von AMosaic gegr&uuml;ndet.
Es geh&ouml;rt damit Michael Witbrock, Michael Fisher, Mike Meyer, R&uuml;diger Sopp und mir, Stefan Burstroem.
Momentan bin ich es, der die Hauptarbeit an IBrowse macht, da R&uuml;diger
mit seinem Examen besch&auml;ftigt ist. Und dann haben wir noch eine Reihe
von Programmieren, die Teilarbeit machen, wie die FTP- und Gophermodule.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Hast Du schon immer an IBrowse gearbeitet oder hattest Du vorher schon andere Projekte (au&szlig;er AMosaic)?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich habe bisher keine anderen kommerziellen Programme geschrieben, falls Du das meinst. Ich schreibe seit Jahren Demos, haupts&auml;chlich
        f&uuml;r den C=64. Und dann habe ich noch einige aufs Programmieren bezogene
        Projekte der Schule (zuerst in der Highschool und sp&auml;ter in der Universit&auml;t) beendet.
</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wann kam der Wechsel zum Amiga?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich habe ebenfalls einige Entwicklungstools f&uuml;r den C64 gemacht, die
        ich ein paar Leuten gegeben habe, aber keines war "offiziell" ver&ouml;ffentlicht. Ich bekam meinen
        ersten Amiga vor 7 Jahren. Aber ich benutzte ihn f&uuml;r C64-Entwicklung bis vor 2 Jahren.. eh, mach` 2,5
        Jahre draus.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>So, Du programmiertest auf deinem Amiga und kopiertest es auf den C64? Warum hast Du weitergemacht f&uuml;r den C64 zu entwickeln?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich wei&szlig; nicht, warum ich wieder zum C64 zur&uuml;ck ging, aber ich vermute, es ist eine gr&ouml;&szlig;ere Herausforderung f&uuml;r den C64
        Demos zu machen, als f&uuml;r den Amiga.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Die Zukunft des Amiga ist momentan sehr unsicher. Siehst Du eine
        Zukunft f&uuml;r den Amiga?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich kann f&uuml;r ihn keine Zukunft als eine Hauptplattform sehen.<BR>
         Aber er wird immer als eine Alternative sein f&uuml;r Leute, die nicht
        dem Hauptstrom folgen wollen. Ich sehe den Amiga als eine Alternative
        zu Windows oder Mac f&uuml;r die Leute, die einen Computer statt einem
        Werkzeug haben wollen.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Es gibt einige geplante Nachfolgerkonzepte. Wirst Du IBrowse f&uuml;r
        eines davon umsetzen, wie z.B. p.OS oder die A\Box?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>p.OS ist interessant, aber ich wei&szlig; nicht, wann sie einen integrierten TCP/IP-Stack daf&uuml;r haben werden. Solange werden wir nur
        die Technologie absch&auml;tzen, wir machen keine Hauptarbeit daf&uuml;r.<BR><BR>
        Bezogen auf die A\Box, ist es mehr eine Frage, welches OS darauf laufen wird, daher kann ich nicht antworten, da es bisher nicht
        entschieden/bekannt ist, welches Betriebsystem es f&auml;hrt.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Aber Du bist an anderen OS interessiert? Wenn Du die Wahl h&auml;ttest zwischen dem originalen AmigaOS, p.OS, dem geplanten A\OS, dem
        geplanten OS von Carl Sassenrath, AROS, Windows (3.x / 95 / NT) und einem Unix-&auml;hnlichem OS (Unix, Linux, NetBSD etc.), welches w&uuml;rdest
        Du lieber unterst&uuml;tzen (basierend auf deinen momentanen Empfindungen und Wissen) und welches magst Du wirklich?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich vermute, ich w&uuml;rde die ersten drei nehmen: AmigaOS, p.OS und A\Box-OS.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was planst Du f&uuml;r die Zukunft von IBrowse? Wird es JavaScript, Java unterst&uuml;tzen und/oder eine API bekommen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ja, es wird JavaScript unterst&uuml;tzen und ja, es wird eine Plugin-API geben.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Aber es wird nicht Java-f&auml;hig werden?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Es wird auch Java unterst&uuml;tzen, aber erst zu einem sp&auml;teren Zeitpunkt.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Denkst Du, Du kannst mit der Entwicklung von NetScape mithalten? Sie haben wahrscheinlich ein gr&ouml;&szlig;eres Entwicklungsteam als ihr.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Nein, wir k&ouml;nnen nicht mit NetScape konkurrieren.<P> Der Schl&uuml;ssel ist, nicht zu versuchen jedes einzelne Feature zu
        implementieren, wie es in NetScape ist. Es gibt Tonnen von Sachen, die nicht n&uuml;tzlich sind und wenn die Leute wirklich diese Sachen
        haben wollen, dann k&ouml;nnen sie sich einen PC und NetScape besorgen.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Und wie stehst Du zu den anderen Amiga-Web-Browsern Voyager, AWeb und dem FinalWebCruiser? Sind sie eine harte Konkurrenz?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Konkurrenz ist immer interessant. Die einzige Bedrohung ist soweit Voyager.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was h&auml;ltst Du von der Diskussion &uuml;ber die
        Sicherheitsl&uuml;cken im Internet? Ist es wirklich so gef&auml;hrlich, wie die Medien es manchmal
        suggerieren? Zum Beispiel die Cookies. Kann jemand wirklich damit einen Computer ausspionieren?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Es gibt keine M&ouml;glichkeit, da&szlig; jemand Information &uuml;ber deinen Computer durch Cookies bekommt. Es gibt vielleicht Wege, aber diese basieren
        auf Fehlern in NSN und IE. Sicherheit hat f&uuml;r uns immer eine gro&szlig;e      Bedeutung. Zum Beispiel ist unser JavaScript sehr sicher und alles,      was wir implementieren, ist gr&uuml;ndlich gepr&uuml;ft, damit es keine Sicherheitsl&uuml;cken enth&auml;lt.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Ihr arbeitet also bereits an einer JavaScript Implementierung? Wie weit seid Ihr?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Wir haben eine komplette JavaScript-Engine lauff&auml;hig. Alles was ich noch zu tun habe, ist die Callbacks zum Browser einzubauen.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was denkst Du, wird das Internet unsere Gesellschaft positiv oder negativ beeinflussen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Hey, ich bin ein Ingenieur... :-)<P> Ich denke nicht, da&szlig; sich im Moment viel &auml;ndern wird. In einigen
        Jahren, denke ich, werden die Leute das Internet in ihr Leben
        integriert haben, auf eine Art, da&szlig; es ihnen in ihr heutiges Leben
        pa&szlig;t. Du wei&szlig;t, die Mehrheit der Bev&ouml;lkerung benutzt nicht das
        Internet bisher...</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wie denkst Du &uuml;ber einige der Gesetzesentw&uuml;rfe zur &Uuml;berwachung des
        Internets? Oder um kryptografische Software zu verbieten, wie z.B. Zimmermanns PGP?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD><P>Ich denke nicht, da&szlig; es m&ouml;glich ist, das Internet zu &uuml;berwachen. Ich
        hoffe, da&szlig; die Leute einsehen, da&szlig; das Verbot von Software etc. es
        nur schwieriger f&uuml;r normale Leute macht. Kriminelle werden sich nicht
        darum k&uuml;mmern, ob es illegal ist, Verschl&uuml;sselungssoftware zu
        benutzen.</P>

        <P>Aber was ich wichtig finde, ist, da&szlig; Wege gefunden werden, um die
        Drogen, Kinderpornographie und Raubkopien, die durch das Internet
        flie&szlig;en, zu &uuml;berwachen. Nur durch das Beobachten, <U>wie</U> es sich
        verbreitet, wird es m&ouml;glich sein, dagegen zu handeln und nicht durch
        ein Verbot im Internet.<P>

        <P>Am Ende kann schlie&szlig;lich alles im Internet jeden Endpunkt irgendwo
        erreichen und dort sitzt ein Mensch. Dieser ist es, mit dem wir uns
        besch&auml;ftigen m&uuml;ssen und nicht mit der Technik, die er oder sie benutzt.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Hast Du irgendwelche Ideen, wie ein Staat verhindern kann, da&szlig; Drogen, Kinderpornographie etc. durch das Internet vertrieben werden? Der T&auml;ter lebt meist in einem anderen Land mit anderen Gesetzen.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD><P>Durch die Annahme der Gesetze der anderen Staaten und es gibt immer
        eine Person, die den Kram erh&auml;lt, in einem Staat wo es verboten ist.
        Dann kann man sie oder ihn festnehmen...</P>
        <P>Man verklagt ja auch nicht die US-Post, weil man Drogen in normalen
        Briefumschl&auml;gen verschickt, nicht wahr? ;)</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>La&szlig; uns noch &uuml;ber Dich reden. Was tust Du au&szlig;er Programmieren?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD><P>Ich schlafe und esse, hm, habe ich f&uuml;r etwas anderes Zeit?... ;-)</P>
     <P>Okay, momentan arbeite ich etwas f&uuml;r eine schwedische Firma, die
        Axis hei&szlig;t und ich studiere, um Ingenieur f&uuml;r physikalische Technik
        und Computer-Design zu werden.</P>
     <P>Ich mag Sport. Ich spiele Volleyball und Beach-Volleyball h&auml;ufig und
        manchmal auch Tennis.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Willst Du weiterhin f&uuml;r eine l&auml;ngere Zeit programmieren oder was planst Du f&uuml;r deine Zukunft?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ich w&uuml;rde gerne an einigen Hardware-Entwicklungs-Projekten arbeiten,
        vielleicht eine neue optische CPU konstruieren :-)

     <P>Ich denke nicht, da&szlig; ich noch lange so wie bisher programmieren werde,
        vielleicht f&uuml;nf Jahre, vielleicht mehr oder weniger. Es h&auml;ngt davon
        ab, wie viel Spa&szlig; es macht.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Vielen Dank, da&szlig; Du die Zeit f&uuml;r das Interview hattest. Und einen sch&ouml;nen Tag noch.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>SB:</TH>
    <TD>Ebenfalls danke!</TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="pure.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

