<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Editorial</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Editorial</H1></CENTER>
<BR>
<P><B>Hallo</B> und Herzlich Willkommen zur zweiten Ausgabe des AmZeigers,</P>
<P>Es hat leider etwas etwas l&auml;nger gedauert, als urspr&uuml;nglich vorgesehen.</P>
<P>Daf&uuml;r k&ouml;nnen wir eine behutsam <B>aufgepeppte HTML-Version</B> vorweisen. F&uuml;r
die Leser der AmigaGuide-Ausgabe liegt lediglich ein kleines Bild des
`AmZeigerchens`, unserem neuen <B>Maskottchen</B>, bei. Der Dank f&uuml;r diese und
die weiteren, speziell f&uuml;r uns handgemalten Gimmicks geht an Andre Wyrwa!</P>
<P>Die Reaktionen zur Nummer Eins waren positiv, wenn sich bis jetzt auch
kaum jemand gemeldet hat, der sich an den Artikeln beteiligen m&ouml;chte.
(Weshalb ich gleich nochmal auf <A HREF="wanted.htm">WANTED!</A> hinweise :)</P>
<P>Insbesondere beim Hardware-Bereich k&ouml;nnen wir immer die Hilfe eines
derjenigen, mit neuem Equipment gebrauchen.</P>
<P>Die Software- und Kursecke konnten wir f&uuml;r diese Ausgabe etwas ausbauen,
genauso, wie ich auf die erweiterte Magazin-Rubrik hinweisen m&ouml;chte, in
der unter anderem auch Fragen gestellt bzw. Antworten gegeben werden
k&ouml;nnen.</P>
<P>F&uuml;r alle, die es nicht abwarten k&ouml;nnen oder Schwierigkeiten haben
regelm&auml;&szlig;ig an unsere Ausgaben zu kommen, haben wir eine <A HREF="../ml.htm">Mailingliste</A>
eingef&uuml;hrt, so da&szlig; ein Versand an eMail-Adressen erfolgen kann.</P>
<P>Au&szlig;erdem haben wir nun eine <A HREF="http://home.pages.de/~AmZeiger2/">Mirrorsite</A>,
f&uuml;r alle, die evtl. Probleme mit der Zugriffs-Geschwindigkeit der Web-Site hatten.</P>
<P>Nicht zu vergessen, da&szlig; sich die Kontaktadressen von uns und dem AmZeiger
ge&auml;ndert haben. Die neuen sind bei <A HREF="../kontakt.htm">Kontakt</A> zu finden.</P>
<P>Im &Uuml;brigen haben wir uns vorgenommen, in Zukunft etwa alle drei Monate
zu erscheinen.</P>
<P><B>In Sachen Amiga</B> lassen sich als gravierendste Ereignisse die Lizensierung
an weitere Unternehmen vermelden. Wobei aber mehrere lediglich das 1200er-
Motherboard in ihren Towergeh&auml;usen verwenden. Phase5 vermeldete k&uuml;rzlich
den Produktionsbeginn der PowerUp-Karten.</P>
<P>Das Amiga-Magazin scheint sich auf einen schleichenden Abgang vorzubereiten, 
in dem es nur noch per Abo oder in Bahnhofsbuchhandlungen
vertrieben wird. Interessant fand ich, da&szlig; dies im Grunde noch als
Errungenschaft `verkauft` werden sollte, unter dem Motto: Sie geh&ouml;ren
jetzt zum exklusiven Club. (Kein weiterer Kommentar.)</P>
<P>N&auml;heres dazu, sowie u.a. zu den ersten Lizenzstreitigkeiten bei <A HREF="news.htm">Am Puls</A>.</P>
<P>Viel Spa&szlig; mit dieser Ausgabe und in der ausdr&uuml;cklichen Hoffnung auf
weitere Reaktionen,</P>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<CENTER>...und unser <A HREF="danke.htm">DANK</A> geht an...<CENTER>

<P>P.S.: Wenn Sie gerade <B>online</B> lesen, denken Sie daran, da&szlig; sie das ganze
Archiv auch downloaden k&ouml;nnen, um sp&auml;ter dann in aller Ruhe zu schm&ouml;kern.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
