<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - AmPuls</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P>
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A> <A HREF="#Sonstiges">Sonstiges</A></P></CENTER>
<H2 ALIGN=CENTER>Amiga-Allgemein</H2>

<P>Das <B>Amiga-Magazin</B> des <A HREF="http://www.magnamedia.de">MagnaMedia</A>-Verlages wird ab sofort nur noch in
Bahnhofsbuchhandlungen und per Abonnement verkauft.</P>
<P>Gleichzeitig wurde mit der Ausgabe 9/97 auch die <B>Amiga-Games</B>, die erst
vor kurzem (teilweise) in das Amiga-Magazin integriert wurde, eingestellt.</P>
<P>Damit wird das Amiga-Zeitschriftenangebot in Deutschland immer kleiner.</P>
<P>Der <B>MagnaMedia-Verlag</B> hatte in der Vergangenheit finanzielle
Schwierigkeiten und wurde an die WEKA-Gruppe ver&auml;u&szlig;ert. Im Zuge erster
Umstrukturierungen wurden die Zeitschriften PowerPlay und Videogames an den
DMV-Verlag verkauft.</P>
<P><HR WIDTH="50%"></P>
<P>Nach <B>Mikronik</B> (die allerdings die Original 1200er Motherboards verwenden),
wurde von Amiga International Inc. eine weitere Lizenz zur Produktion von
Amigas vergeben. <A HREF="http://www.cix.co.uk/~index/">Index Information</A> m&ouml;chte eigene Amiga-Motherboards und
Computer fertigen.</P>
<P>Index hat einen &quot;<B>Access</B>&quot;-Computer entwickelt, der auf dem Amiga-Chipset
und OS basiert. Die ersten Ausf&uuml;hrungen der sp&auml;ter auf eine Produktlinie
erweiterten Acess-Rechner sollen im dritten Quartal 97 erh&auml;ltlich sein.</P>
<P>Vorproduktions-Motherboards sollen derzeit bereits an Entwickler und
Tester gesandt werden.</P>
<P><HR WIDTH="50%"></P>
<P>Die ebenfalls britische Firma <A HREF="http://www.centrenet.co.uk/~ics/index.html">Intrinsic Computer Systems</A> sorgte f&uuml;r 
Verwirrungen in Sachen Amiga-Lizenz, da sie f&uuml;r sich eine Lizenz, &auml;hnlich
der Mikronik-Lizenz in Anspruch nahmen (fertige 1200er-Boards mit
unterschiedlicher Ausstattung in Tower-Geh&auml;usen). Sie verbreiteten bereits
eine eigene Pressemeldung, die, wie sich herausstellte, nicht mit Amiga
Int. in Einklang stand, die von der Lizenz nichts wu&szlig;ten. Es soll sich
um ein Mi&szlig;verst&auml;ndnis handeln.</P>
<P><HR WIDTH="50%"></P>
<P>Auch <B>echte Lizenzstreitigkeiten</B> sind im Gange. Denn Mitte Juli
ver&ouml;ffentlichte die Firma <B>Lotus Pacific</B> eine Pressemitteilung, nachdem sie
&uuml;ber ihr in New Jersey ans&auml;ssiges Tochterunternehmen Regent Electronics Corp. die
fern&ouml;stlichen Rechte f&uuml;r den Commodore-Amiga (Patente, Lizenzen, Handels-
marken) von der ebenfalls in New Jersey beheimatete Firma Righttiming
Electronics Corp. f&uuml;r 5 Millionen US-Dollar, sowie 8 weiteren Millionen
in Regent-Aktienanteilen gekauft h&auml;tte.</P>
<P>Die Rechte w&uuml;rden f&uuml;r China, Taiwan, Hong Kong, Macao und den angrenzenden
Staaten zwischen China und der fr&uuml;heren Sowjetunion gelten. Rightiming
h&auml;tte im vergangenen Jahr eine Multimedia-Settopbox, namens <B>Wonder-TV</B>
<B>A 6000</B> entwickelt, die gerade im und f&uuml;r den chinesischen Markt 
produziert werden solle.</P>
<P>Gateway 2000 oder Amiga International wurden mit keinem Wort erw&auml;hnt.</P>
<P>Insider meinten, da&szlig; das Ganze auf einem Vor-Vertrag zwischen Escom und
Righttiming aus dem Jahre 95 basieren w&uuml;rde. Weiterhin soll Rightiming
angeblich im Grunde identisch mit Lotus sein.</P>
<P>Fast gleichzeitig ver&ouml;ffentlichte Lotus die Mitteilung, da&szlig; sie eine
strategische Allianz mit <B>Sichuan Changhong</B>, dem gr&ouml;&szlig;ten chinesischen
TV-Hersteller (achtgr&ouml;&szlig;ter der Welt) eingegangen w&auml;ren, der noch vor Ablauf des
Jahres 1998 200.000 Einheiten Wonder-TV 6000 produzieren wolle.</P>
<P>Die <B>Reaktion von Gateway 2000</B> lie&szlig; nicht lange auf sich warten. In ihrer
Pressemitteilung bestritten sie, da&szlig; Rightiming/Lotus irgendwelche Amiga-
Rechte bes&auml;&szlig;en und somit nichts verkaufen k&ouml;nnten. Sie alleine h&auml;tten
die weltweiten Amiga-Rechte.</P>

www.lpfc.com

<P><HR WIDTH="50%"></P>
<P>...und nochmal Lizenzstreitigkeiten: <A HREF="http://www.villagetronic.com">VillageTronic</A> hat die Distribution
des Amiga-OS 3.1, die nach einer gerichtlichen einstweiligen Verf&uuml;gung auf
Veranlassung durch Amiga Technologies i.K. vor etwa einem halben Jahr grstoppt wurde,
wieder aufgenommen. Petro Tyschtschenko, Pr&auml;sident von Amiga Intern.
habe seine Rechtsabteilung einschalten m&uuml;ssen.</P>
<P><HR WIDTH="50%"></P>
<P>Ende Juli gab Amiga Intern. die offiziellen neuen Distributoren f&uuml;r
<B>das Amiga-OS 3.1</B> bekannt. In Deutschland &quot;Computer-Vesalia&quot;, in den USA
&quot;Software Hut&quot; und in Gro&szlig;britannien &quot;Power Computing&quot;.</P>
<P><HR WIDTH="50%"></P>
<P>Eine Lizenz vergab Amiga Intern. auch an das schwedische Unternehmen
<B>Vidamus Multimedia</B> zur Herstellung und dem Vertrieb von Werbeartikeln
mit der Aufschrift Amiga.</P>
<P><HR WIDTH="50%"></P>
<P>Mit dem Hardwareentwickler <B>Jeff Schindler</B> hat die neugegr&uuml;ndete
Entwicklungsabteilung von Amiga (als <B>Amiga, Inc.</B> in Dakota Dunes, USA,
residierend) einen Chef. Bisher hatte er aber noch nichts mit dem Amiga zu
tun.</P>
<P>Petro Tyschtschenko bleibt von Deutschland aus, als Pr&auml;sident von Amiga
International Inc. weiterhin f&uuml;r weltweiten Verkauf und Marketing zust&auml;ndig.</P>
<P>Am 11.08.97 fand dann auch in Dakota Dunes ein erstes <B>`konstitutionelles`</B>
<B>Treffen</B> zwischen Jeff Schindler, Petro Tyschtschenko und einigen amerik.
User-Groups und diverser privater Amiga-Initiativen statt, um sich kennenzulernen und besser zu verstehen.</P>
<P><U>Kommentar:</U><BR>
An sich eine sehr lobenswerte Sache. Warum ist so etwas aber
nicht in Deutschland m&ouml;glich? Man darf doch nicht vergessen,
da&szlig; der Amiga in den USA niemals &uuml;ber den Status eines Randgruppensystems
hinausgekommen ist und die User-Basis in Zentral-Europa und Deutschland wesentlich gr&ouml;&szlig;er ist.
</P>
<P><HR WIDTH="50%"></P>
<P>Laut Derrick Lisle, bei Amiga Inc. PR-und Veranstaltungs-Koordinator, sind
&quot;die Leute bei <B>Epson</B> einverstanden mit uns zu arbeiten und uns mit allem
zu unterstützen, was wir benötigen, um ihre gesamte Produktlinie von
Druckern und Scannern zu unterstützen.&quot;</P>
<P><HR WIDTH="50%"></P>
<P><B>Ger&uuml;chten</B> zu Folge soll <A HREF="http://www.maxon.de">Maxon Computer</A> planen sich vom Amiga
zur&uuml;ckzuziehen bzw. alle Aktivit&auml;ten einzufrieren.</P>
<P><HR WIDTH="100%"></P>
<H2 ALIGN=CENTER><A NAME="Hardware">Hardware:</A></H2>
<P><B>Phase5</B> hat nach eigenen Angaben mit der Produktion der PowerUP-Turboboards
begonnen. Die Auslieferung soll ab der 37. Kalenderwoche erfolgen.</P>
<P><HR WIDTH="50%"></P>
<P><A HREF="http://www.oberland.com">Oberland</A> plant mit der <A HREF="http://www.oberland.com/amiga/obox.asp">o/box</A>
eine eigene PPC-A4000T-Komplettvariante
anzubieten. Es handelt sich um originale Amiga 4000 Tower mit phase5-
PPC-Beschleunigerkarten und 2 MB Chip und 32 MB FastRam.</P>
<P>Basispreis mit PPC604e/150 MHz und 68040/25 MHz ab ca. 4.000 DM.</P>
<P><HR WIDTH="50%"></P>
<P>Mit der <B>SoundStage</B> von <B>Applied Magic Inc.</B> kommt eine Soundkarte f&uuml;r
Zorro-III. Sie ist insbesondere zur Unterst&uuml;tzung der JPEG-Videokarten der
selbigen Firma gedacht und von ihnen bisher im Moment auch abh&auml;ngig. Basieren
tut sie auf einem 40 MHz-Texas Instruments DSP. &Uuml;ber ihn soll sie auch
Videoeffekte beschleunigen k&ouml;nnen, teilweise 4-10 mal schneller als ein
Standard-A 4000.</P>
<P>Basispreis ab ca. 1.400 US-Dollar.</P>
Applied Magic Inc.,<BR>
2649 Vista Way, Suite 837,<BR>
Oceanside, California,<BR>
92056 USA<BR>
<P><HR WIDTH="50%"></P>
<P><B>Digital Lightyear Technologies</B> bringt die <B>Argent Ethernet-Karte</B> heraus. Es
handelt sich um eine Zorro-II-Karte, die bis zu 10MBit/Sekunde schnell und
100% Ethernet-Kompatibel ist.</P>
<P>Der Preis liegt mit etwa 100 US-Dollar unter vergleichbaren bisherigen
Angeboten f&uuml;r den Amiga.</P>
<P>1517 105th Ave. Ct. E.<BR>
Edgewood Washington, 98372 USA<BR>
Tel. (206) 927-3817<BR></P>
<P><HR WIDTH="50%"></P>
<P>Mit dem <A HREF="www.infinet.com/~erd/GG2/index.html">GG2 Bus+</A> sollen in Zukunft preiswerte
ISA-Bus-Interfacekarten an den Amiga angeschlossen werden k&ouml;nnen. Z.B. zus&auml;tzliche parallele und
serielle Ports, sowie Netzwerk-Karten, interne Modems, IDE-Kontroller
und mehr. Es werden so gut, wie alle Nicht-DMA AT- kompatiblen
PC-Steckkarten unterst&uuml;tzt (8 MHz-Bus). Die Treiberunterst&uuml;tzung soll gut
sein.</P>
<P>Basispreis etwa 125 US-Dollar.</P>
<P><HR WIDTH="50%"></P>
<P>Die franz&ouml;sischen Entwickler von <A HREF="http://www.ateo-concepts.com/eprojcarte.html">Ateo Concepts</A>
wollen mit der <B>Pixel64</B> die
erste Grafikkarte f&uuml;r den Amiga 1200 zur Marktreife bringen. Allerdings
pa&szlig;t sie aus Platzgr&uuml;nden nur in mit Towergeh&auml;usen aufger&uuml;stete 1200er.
Sie basiert auf dem GD5434-Chipsatz von Cirrus Logic und wird mit einem
neuen speziellen Expansionsbus ausger&uuml;stet sein, der sogar schnellere
Datendurchsatzraten, als Zorro-III erreichen soll und f&uuml;r den weitere
Erweiterungen geplant sind. Als WB-Emulations-Software soll Picasso 96
eingesetzt werden.</P>
<P>Der Preis soll sich zwischen 250-300 US-Dollar bewegen. Im September/
Oktober 97 soll die Karte erh&auml;ltlich sein, ein erster Prototyp ist
bereits im Test.</P>
<P>Au&szlig;erdem wird &uuml;berlegt, ob ein <B>PPC-Turboboard</B> f&uuml;r den 1200 entwickelt
werden soll. Die Entscheidung ist aber noch nicht getroffen.</P>
<P><HR WIDTH="50%"></P>
<P>Mit dem <A HREF="http://lamicounter.epfl.ch/Smaky/">Smaky 400</A> kommt eine PCI-Karte mit
einem 68040 als Prozessor f&uuml;r PC`s heraus. Obwohl urspr&uuml;nglich nicht daf&uuml;r gedacht, sollen evtl.
auch die Betriebssysteme des Amigas und Ataris daf&uuml;r genutzt werden
k&ouml;nnen.</P>
<P><HR WIDTH="50%"></P>
<P>Die n&auml;chste <A HREF="http://www.chips.ibm.com">PowerPC-Generation</A> ist nicht mehr fern.
<B>IBM und Motorola</B> haben die neuen Prozessoren <B>PowerPC 740 und 750</B> angek&uuml;ndigt.
Die ersten 750`er Versionen sollen mit 266 MHz bei einer Leistungsaufnahme von 5 Watt auf
den Markt kommen.</P>
<P>Der 740 stellt die Embedded-Variante dar. Ihm fehlt im Gegensatz zum 750
der eingebaute Cache-Controller. Erste geringe St&uuml;ckzahlen sollen bereits
verf&uuml;gbar sein und die Massenproduktion im 4. Quartal 97 anlaufen.
Gleichzeitig wurden neue Versionen des 604 mit bis zu 350 MHz angek&uuml;ndigt.
</P>
<HR WIDTH="100%">
<H2 ALIGN=CENTER><A NAME="Software">Software</A></H2>
<B>CygnusED</B>, einer der bekanntesten Editoren f&uuml;r den Amiga, wird von
<A HREF="http://www.schatztruhe.de">Schatztruhe</A> weiterentwickelt wiederver&ouml;ffentlicht. Zusammen mit Bruce
Dawson und Olaf Barthel soll er &uuml;berarbeitet werden. Unter der
eMail-Adresse <A HREF="mailto:schatztruhe@cww.de">schatztruhe@cww.de</A> k&ouml;nnen Vorschl&auml;ge
zur Verbesserung gemacht werden. CygnusED soll noch vor Ende des Jahres auf CD erscheinen, wobei
auch Cross-Updates (von anderen Editoren) m&ouml;glich sind.
<P><HR WIDTH="50%"></P>
<P>Die <B>rtgmaster.library</B>, ein System um Spiele Grafikkartenunabh&auml;ngig
entwickeln und spielen zu k&ouml;nnen, wird gegenw&auml;rtig auf PPC umgesetzt, obwohl
der Programmierer Steffen H&auml;user noch keine Karte besitzt.</P>
<P>Die <B>rtgmasterPPC.library</B> soll trotzdem schon weit gediehen sein.</P>
<P><HR WIDTH="50%"></P>
<P><A HREF="http://blittersoft.wildnet.co.uk/mcode.htm">Microcode Solutions</A>
neuer Macintosh-Emulator <B>FUSION</B> wird von <A HREF="http://www.haage-partner.com">Haage&amp;Partner</A>
f&uuml;r 169 DM in der aktuellen Version 1.1 vertrieben.</P>
<P><HR WIDTH="50%"></P>
<P><B>Nova Design</B> k&uuml;ndigt mit der Version 5.0 den <B>Aladdin 4D</B>-Nachfolger an. Er
ben&ouml;tigt unter anderem keinen Dongle mehr, gl&auml;nzt im OS2.1/3.0-Look, hat
volle CyberGrafX-Unterst&uuml;tzung und nat&uuml;rlich zahlreiche neue Effekte.</P>
<P>Upgradepreis zu allen vorherigen Versionen ca. 100 US-Dollar.</P>
<P>Bob Fisher, Nova Design, Inc. ,  USA, Tel.: 804-282-5868</P>
<P><HR WIDTH="50%"></P>
<P>Martin Wulffeld, d&auml;nischer Programmierer des verbreiteten Virenkillers
<B>XTruder</B>, hat in seinem eigenen Programm einen Virus versteckt und dann
verbreitet!</P>
<P>Wegen der Zunahme gef&auml;lschter Keyfiles und aus pers&ouml;nlicher Rache
gegen&uuml;ber einem bestimmten User, hat er in Version 3.5 einen eigens daf&uuml;r
programmierten Trojan eingebaut, der bei Einsatz eines gef&auml;lschten Keyfiles
aktiviert wird und Dateien auf der Systempartition ver&auml;ndert.</P>
<P>Nachdem die Aktion bekannt wurde, hat Wulffeld angek&uuml;ndigt, das XTruder
ab Version 3.6 wieder &quot;sauber&quot; sei.</P>

<P><U>Kommentar:</U><BR>
Eigentlich braucht man dazu nicht viel sagen oder schreiben.
Unabh&auml;ngig von den Gr&uuml;nden ist eine solche Vorgehensweise
einfach skandal&ouml;s!</P>
<P><HR WIDTH="50%"></P>
<P>Von dem bekannten Web-Browser <A HREF="http://www.vapor.com">Voyager</A> soll eine Version 3.0 erscheinen,
die unter anderem Javascript und HTTP 1.1 unterstützt. Auf der Messe
Computer 97 soll bereits eine Vorab-Version zu sehen sein.</P>

<HR WIDTH="100%">

<A NAME="Spiele"><H2 ALIGN=CENTER>Spiele</H2></A>

<P>Die Rechte f&uuml;r <B>Pinball Brain Damage</B> liegen laut dem <B>APC&amp;TCP</B> nicht bei
Vulcan, sondern bei dem Club! Es soll im Laufe des Jahres 97 erscheinen
und mehrere Tische im HiRes-Modus (640x256) mit Multiballmodi im
Super-HiRes-Modus (1280x512) bieten, sowie eine Pseudo-3D-Darstellung.<BR>
Voraussetzung: AGA-Chipsatz.</P>
<P><HR WIDTH="33%"></P>
<P>Weiterhin plant der <B>APC&amp;TCP</B> gegen Ende des Jahres den Action-Hit <B>Pulsator</B>
herauszubringen. Dabei handelt es sich um ein klassisches Shoot`em`up in
der Tradition von Project-X und Apydia.</P>
<P>Es soll durch einen neuartigen Zwei-Spieler-Modus gl&auml;nzen, sowie ein
Extrawaffensystem besitzen, das noch nicht seinesgleichen gesehen hat. Das AGA-
Chipset soll bis zum &auml;u&szlig;ersten ausgereizt werden, 512 Farben gleichzeitig
anzeigen, Parallaxscrolling und andere Effekte bewerkstelligen. Manche
Endgegner sollen mehrere Bildschirme gro&szlig; sein.</P>
<P><B>Pulsator</B> wird in einer aufgebohrten CD-Version erscheinen, sowie auf HD-
Disketten (!). Der Preis soll ca. 70 DM betragen.</P>
<P>Ein <A HREF="sshots.htm#puls">Screenshot</A> gibt es auch. :-)</P>
<HR WIDTH="33%">
<P>Noch ein weiteres Spiel soll Ende des Jahres Bewegung in den Amiga-Markt
bringen. Denn <B>Phoenix</B> soll Ma&szlig;st&auml;be setzen. Das Team nennt
sich &quot;<B>Future Tales</B>&quot; und prorammiert &quot;eine Art WingCommander
mit ELITE-Elementen und durchgehender Story...&quot;.</P>
<P>Es gibt Echtzeit-3D-Gefechte, sowie Adventure- und Handelssimulations-
Elemente. Man darf also gespannt sein. Geplant ist unter anderem auch
eine TCP/IP-Implementation f&uuml;r Multiplayer-Spiele. Voraussetzung wird
ein A1200/4000 mit mindestens 68030/50 MHz sein. Grafikkarten sollen
&uuml;ber die rtgmaster.library unterst&uuml;tzt werden.</P>
<CENTER><A HREF="sshots.htm#phoenix">Screenshot!</A></CENTER>
<P>APC&TCP, Dorfstr. 17, 83236 &Uuml;bersee</P>

<P><HR WIDTH="50%"></P>
<P><B>BlitzBombers</B>, &quot;Amigas bestes Multiplayer-Spiel&quot;, soll jetzt doch in B&auml;lde
erscheinen. <B>Red When Excited Software</B> war im Februar 96 gezwungen die
Auslieferung zu stoppen, da andere Software-Entwickler aus rechtlichen Gr&uuml;nden
Einspruch erhoben.</P>
<P><B>BlitzBombers</B> ist eine gelungene Mischung aus dem bekannten Dynablaster und
der Bomberman-Serie. Es wurde sehr stark aufgepeppt und macht bereits in
der Demoversion einen Heidenspa&szlig;.</P>
<P>Das Erscheinen h&auml;ngt allerdings von dem Zuspruch der Amiga-Fans ab, die
auf der Web-Site votieren k&ouml;nnen. Hier ist auch die Demoversion ladbar,
die ebenfalls im Aminet erscheinen soll.</P>
<CENTER><A HREF="http://www.ldngedge.demon.co.uk">www.ldngedge.demon.co.uk</A></CENTER>
<P><HR WIDTH="50%"></P>
<P>Mit <B>Forgotten Forever</B> soll ein guter Command&Conquer-Clone f&uuml;r den Amiga
erscheinen. <B>Charm Design</B> benutzt konsequent OS-Aufrufe, so da&szlig; z.B. alle
AGA- und CyberGrafX-Aufl&ouml;sungen mit 256 Farben verwendet werden k&ouml;nnen.
Vier unterschiedliche Gel&auml;ndetypen, 50-60 Missionen, 50 verschiedene
Fahrzeuge, digitallisierte Sprachsamples und ein Nullmodem-Zweispieler-Modus
werden h&ouml;chstwahrscheinlich keine Langeweile aufkommen lassen. Die Ungarn
haben bis jetzt noch keinen Publisher.</P>
<CENTER><A HREF="sshots.htm#forgfor">Screenshot!</A></CENTER>
<CENTER><A HREF="http://www.klte.hu/~zavacki/">www.klte.hu/~zavacki</A></CENTER>
<P><HR WIDTH="50%"></P>
<P><B>onEscapee</B> ist das Spiel des ungarischen <B>Invictus Team</B>`s, dessen Vertrieb,
wie schon bei Foundation, Sadeness Software aus Gro&szlig;britannien &uuml;bernommen
hat. Es handelt sich um eine Mischung aus `Another World` und `Flashback`
und macht in der Demoversion einen vielversprechenden Eindruck. Diese ist
allerdings ca. 5MByte gro&szlig;, wodurch sie sicher nicht allzuviele `Vorkoster`
aus dem Aminet runterladen werden. Von onEscapee wird gleichzeitig eine
Amiga- und eine PC-Version entwickelt.</P>
<CENTER><A HREF="sshots.htm#on">Screenshot!</A></CENTER>
<CENTER><A HREF="http://www.klte.hu/~dakos/">www.klte.hu/~dakos/</A></CENTER>
<P><HR WIDTH="50%"></P>
<P><A HREF="http://www.vulcan.co.uk">Vulcan</A> plant ein weiteres neues Spiel. <B>Hard Target</B> soll als 3D-Shoot`em`up
mit vollst&auml;ndig geraytraceten Charakt&auml;ren die Amiga-Antwort auf
&quot;Virtua Cop&quot; werden. AGA, 2MB Chipram, 8 MB Fastram und CD-Laufwerk sollen Voraussetzung
des im Fr&uuml;hjahr 98 erscheinenden Spiels sein.</P>
<P><HR WIDTH="50%"></P>
<P><A HREF="http://www.valivue.demon.co.uk">Guildhall Leisure</A> plant neben Gloom 3 zusammen mit EPIC Marketing auch eine
Umsetzung des f&uuml;r die unterschiedlichsten Systeme erschienenen <B>Street Racer</B>
an. Es soll eines der besten Rennspiele f&uuml;r den Amiga werden und scheint
grafisch in Richtung XTreme Racing zu gehen. AGA ist Voraussetzung.</P>
<HR WIDTH="100%"><BR>
<A NAME="Sonstiges"><H2 ALIGN=CENTER>Sonstiges:</H2></A>

<P>Anfang August k&uuml;ndigten Steve Jobs, Vorstandsmitglied und Mitbegr&uuml;nder der
<A HREF="http://www.aple.de">Apple</A> Computer Inc. und Bill Gates, Aufsichtsratsvorsitzender und CEO der
<B>Microsoft</B> Corp. auf der MacWorld in Boston eine neue Allianz zwischen ihren
Unternehmen an. Microsoft &uuml;bernimmt nichtstimmberechtigte Aktien im Werte
von 150 Millionen US-Dollar und wird u.a. Office 98 f&uuml;r den Mac
herausbringen. In Zukunft wird der Internet Explorer von Microsoft mit dem Mac
geb&uuml;ndelt, so da&szlig; er nach der Auslieferung bereits vorinstalliert
ist.</P>
<P>Wie bekannt, ist der Computerhersteller Apple schon seit l&auml;ngerer Zeit ins
Trudeln geraten. Marktbeobachter vermuten in der Aktion einen geschickten
Schachzug Microsofts mit Augenmerk auf die amerikanische Monopolbeh&ouml;rde,
die die zunehmende Monopolstellung Microsofts im Betriebsystemsektor
argw&ouml;hnisch betrachtet. So w&uuml;rde vordergr&uuml;ndig ein Gegenpol im Markt erhalten
bleiben und das bei einer vergleichsweise geringen Summe von 150 Millionen
Dollar, denn Microsofts Kriegskasse ist mit einigen Milliarden gef&uuml;llt und
somit kaum belastet.</P>
<P><HR WIDTH="50%"></P>
<P><A HREF="http://www.pios.de">PIOS</A> plant seinen B&ouml;rsengang. In Hardwarefragen gibt es dagegen nichts
Neues zu vermelden.</P>

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="www.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

