<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Der alte Postsack</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Der alte Postsack</U></H1></CENTER>

<B>Absender: martinhofm@metronet.de (Martin)</B>
<PRE>
<B>MH></B> Hallo Leute,
<B>MH></B>
<B>MH></B> ich find die Idee und die Zeitung echt super. Ich hab gerade die
<B>MH></B> erste Ausgabe mit viel Spa&szlig; und Interesse gelesen.
<B>MH></B>
<B>MH></B> Ich werd sie allen Freunden und Bekannten weitergeben bzw.
<B>MH></B> weiterempfehlen.
<B>MH></B>
<B>MH></B> Gru&szlig; Martin

Dieser Brief steht stellvertretend auch f&uuml;r einige weitere (nicht
genug! :), die wir erhalten haben. Ein herzliches Dankesch&ouml;n an
alle, die sich &uuml;berwunden und die M&uuml;he einer eMail auf sich
genommen haben!

Der Idee des Weitergebens- bzw. Empfehlens kann ich nur die
wohlwollendste Aufmerksamkeit schenken, sprich: Macht das bitte!

<HR>

Bevor wir zur n&auml;chsten eMail kommen, die ich wegen ihrer `Kritik`
ebenfalls f&uuml;r die heutige Briefkastenonkel-Ausgabe verwende, m&ouml;chte
ich noch einmal betonen, da&szlig; nichts, was hier `abgedruckt` wird,
in irgendeiner Weise gestellt ist!

<B>Absender: rutter@uni-muenster.de (Markus R&uuml;tter)</B>

<B>MR>></B> Nach der Ank&uuml;ndigung im Usenet wollte ich doch mal meine Eindr&uuml;cke
<B>MR>></B> vom Newcomer unter den Amiga-Magazinen loswerden.
<B>MR>></B>
<B>MR>></B> [Spannung erzeugende Pause....]
<B>MR>></B>
<B>MR>></B> Gratuliere! Ich halte es f&uuml;r das mit Abstand Beste! Weiter so!
<B>MR>></B>
<B>MR>></B> [Langsam wieder beruhig'...]

Wir konnten nat&uuml;rlich ein leises geschmeicheltes L&auml;cheln, ob dieses
Lobes, nicht ganz unterdr&uuml;cken und fragten nach, was Markus denn
besonders gefallen habe...

<B>MR></B> H&uuml;ten werd' ich mich, irgendwas besonders hervorzuheben. Eben das
<B>MR></B> Gesamtkunstwerk gef&auml;llt mir. Sowohl Aktualit&auml;t, Themenvielfalt und
<B>MR></B> auch Objektivit&auml;t (Hallo, Amiga-Magazin!) sind vorhanden, das
<B>MR></B> Seitendesign l&auml;&szlig;t auch "kleineren" Internetinstallationen eine
<B>MR></B> Chance (wenn's mir auch wurscht sein k&ouml;nnte :)). Was w&uuml;nscht man
<B>MR></B> sich mehr? Wenn's auf dem Level weitergeht:
<B>MR></B>
<B>MR></B> Alle Achtung.
<B>MR></B>
<B>MR></B> Und noch ein paar Ob-Anregungen zur Startseite:
<B>MR></B>
<B>MR></B> - Erkl&auml;rt mir doch mal den "Server"-Link auf der Startseite...
<B>MR></B>

Durch diesen ist man in der Lage, sowohl die heimische, auf der Fest-
platte befindliche Ausgabe, als auch eine auf dem Server befindliche
(bei laufender TCP/IP-Verbindung) zu lesen. Das macht nat&uuml;rlich erste
Sinn, wenn sich mehrere Ausgaben angesammelt haben und man nicht alle
&auml;lteren aufgehoben hat.

Das `Frontend` gilt ja im Prinzip f&uuml;r alle Ausgaben. Zugegebenerma&szlig;en
war das aber in der ersten Ausgabe nicht ganz eindeutig ersichtlich
und daher haben wir das Ganze etwas &uuml;berarbeitet.

<B>MR></B> - "Kontakte"-Link k&ouml;nnte man in Impressum umbenennen und mit der
<B>MR></B>   entsprechenden Seite zusammenlegen. Au&szlig;erdem ist er unter der
<B>MR></B>   &Uuml;berschrift "Ausgaben irgendwie deplaziert, es sei denn es gibt
<B>MR></B>   f&uuml;r jede Ausgabe eine neue Redaktionsmannschaft. :)
<B>MR></B>

Ich gehe davon aus, da&szlig; Du jetzt auch von der ersten Main-Seite (mit
dem gro&szlig;en Logo) sprichst. An sich hat die Zweiteilung aber schon
ihren Sinn, da das Ganze ansonsten &uuml;berfrachtet w&auml;re und von mehreren
Stellen nur die Kontakte-Seite angesprungen werden soll.

In Bezug auf die Redaktionsmannschaft: Wer wei&szlig;? ;)

<B>MR></B> - Statt "Index" vielleicht "Artikelverzeichnis"? (s.o)
<B>MR></B>

Okay. Ge&auml;ndert!

<B>MR></B> Ansonsten kann ich mich dem Editorial 6/97 nur vollstens anschlie&szlig;en.

Die Entwicklung des Amiga-Magazins gibt uns recht... leider.

<HR>

Jetzt folgt noch ein recht aufschlu&szlig;reicher Disput, der im offiziellen
AmZeiger-Diskussionsbrett unserer Support-Box `BBrandes` gef&uuml;hrt wurde,
zwischen Andre Wyrwa, den wir in der Folgezeit dazu animieren konnten
seine k&uuml;nstlerischen Talente in den Dienst unserer HTML-Ausgabe zu
stellen, und unserem Chefredakteur Gregor Franz.

<B>Absender: A.Wyrwa@BBrandes.in-brb.de</B>

<B>AW>></B> Hallo Gregor, hallo Andreas ;-), hallo BBrandesen oder wie auch immer,
<B>AW>></B>
<B>AW>></B> nach einer auszugsweisen Einsichtnahme in den AmZeiger m&ouml;chte ich
<B>AW>></B> mich nunmehr 'mal zu einem kleinen Meinungsbekundungsversuch hinrei&szlig;en
<B>AW>></B> lassen. Zun&auml;chst einmal ist mein Blick sowieso positiv getr&uuml;bt, da ich
<B>AW>></B> f&uuml;r Alternatives immer zu haben bin.
<B>AW>></B>
<B>AW>></B> Neben dem AmZeiger beziehe ich regelm&auml;&szlig;ig das AmigaMagazin, allerdings
<B>AW>></B> zunehmend weniger aus Hoffnung auf eine umwerfende Informationsflut,
<B>AW>></B> als vielmehr aus Spa&szlig; am Betrachten des Heranwachsens des Gegensatzes
<B>AW>></B> zwischen Durchhalteparolen im Editorial und Dicke sowie Inhalt des
<B>AW>></B> gelieferten Papiermaterials. Aus &ouml;kologischen Gesichtspunkten h&auml;tte
<B>AW>></B> ich das gute Bl&auml;ttchen wohl schon l&auml;ngst abbestellen m&uuml;ssen, denn es
<B>AW>></B> ist schade um die Ressourcen, die daf&uuml;r draufgehen.
<B>AW>></B>

<B>GF></B> Siehe dazu auch den Kommentar des `Alten Postsacks` in der akt.
<B>GF></B> Ausgabe.

(Postsack: Die Juni-Ausgabe.)

<B>AW>></B> Womit wir ja auch schon bei einem der Vorteile des AmZeigers w&auml;ren
<B>AW>></B> und ich damit den Bogen doch besser bekommen habe, als ich zu denken
<B>AW>></B> wagte. ;-)

<B>GF></B> Wenn Du so weitermachst wirst Du noch zwangsverpflichtet. ;)

(Postsack: Hat ja dann auch geklappt! :))

<B>AW>></B> Obwohl ich mich anfangs gefreut habe, da&szlig; der AmZeiger auch als
<B>AW>></B> AmigaGuide-Version erscheint, habe ich nun doch kaum einen Blick
<B>AW>></B> auf diese

<B>GF></B> ohhh...

<B>AW>></B> geworfen, zugunsten der gelungenen HTML-Variante. Dennoch halte ich
<B>AW>></B> die Ver&ouml;ffentlichung als Guide f&uuml;r alles andere als &uuml;berfl&uuml;ssig.

<B>GF></B> Ahhh...

<B>AW>></B> Inhaltlich - sofern ich das anhand meines doch eher kurzen und knappen
<B>AW>></B> Studiums burteilen kann - habe ich nichts auszusetzen. Nur m&ouml;chte ich
<B>AW>></B> hier anmerken, da&szlig; ich nicht versuchen w&uuml;rde, professionell zu wirken,
<B>AW>></B> wie das in der Vorstellungs-Mail anklang. Aber ich denke, dies wird
<B>AW>></B> schon durch die

<B>GF></B> Das ist sicherlich nicht uebersteigert gemeint und als Massstab wird
<B>GF></B> auch nicht das Amiga-Magazin herangezogen (argh ;).
<B>GF></B>
<B>GF></B> Ich habe mich aber in der Vergangenheit mit so fast allen dt. Online-
<B>GF></B> Zeitschriften befasst (mit Online meine ich, was z.B. im Aminet
<B>GF></B> erhaeltlich ist) und dort neben einigen wenigen guten Dingen auch
<B>GF></B> manches von, aus meiner Sicht, erschreckend schlechter Qualitaet
<B>GF></B> entdeckt. (Ich beziehe mich nur auf den Inhalt.)

<B>AW>></B> hoffentlich eintrudelnden Beitr&auml;ge von unterschiedlichsten Amateur-
<B>AW>></B> Autoren ganz selbstt&auml;tig vermieden werden.

<B>GF></B> Deswegen braucht das ganze doch nicht unprofessionell zu werden? :)
<B>GF></B>
<B>GF></B> Gerade die User, die sich staendig mit ihrem Compi und spezieller
<B>GF></B> Soft-und Hardware beschaeftigen, haben doch oft mehr drauf, als so
<B>GF></B> mancher `professionelle` Redakteur einer gedruckten Publikation.
<B>GF></B>
<B>GF></B> Aber ganz klar: die Qualitaet regelt sich von selbst.
<B>GF></B>
<B>GF></B> Und dem HOFFENTLICH muss ich mich ganz ausdruecklich anschliessen,
<B>GF></B> denn davon haengt die Zukunft ab. Ich kann mir nicht jedesmal eine
<B>GF></B> komplette Zeitschrift abringen und bin froh, dass mich Andreas,
<B>GF></B> neben der HTML-Arbeit, auch mit dem WebBrowser-und dem PicassoIV-
<B>GF></B> Test unterstuetzt hat. (Nebenbei: letzterer ist von ihm - durch
<B>GF></B> ein Versehen ist in der HTML-Version sein Name dort abhanden
<B>GF></B> gekommen).
<B>GF></B>
<B>GF></B> Fragt sich auch, wie das mit der Berlinet-Domain weitergeht, denn
<B>GF></B> davon haengen wir kommunikationstechnisch ab. Denn egal woher man
<B>GF></B> den AmZeiger schliesslich bezieht, so sind die Kontakt-eMail-
<B>GF></B> Adressen immer `BBrandes.berlinet.de`-Adressen. (Das setzt
<B>GF></B> natuerlich voraus, dass uns ueberhaupt etwas geschickt wird ;)

(Postsack: Die Domain hat sich jetzt ver&auml;ndert und somit haben wir
           neue Adressen. Siehe <A HREF="../kontakt.htm">Kontakt</A>.)

<B>AW>></B> So viel zur Meinung...Anregungen hab' ich vorerst keine, aber noch
<B>AW>></B> eine klitzekleine Frage: Warum hei&szlig;t das gute St&uuml;ck eigentlich
<B>AW>></B> "AmZeiger"?

<B>GF></B> "Der AmZeiger" kommt von "Der Anzeiger" (nein nicht der Bonner, oder
<B>GF></B> was auch immer ;), was den Bezug zu einer deutschsprachigen Zeitung
<B>GF></B> herstellen soll. Das "Am" soll dann noch das Amiga implizieren.
<B>GF></B>
<B>GF></B> "Zeiger" koennte auch von Mauszeiger kommen, aber so weit will ich
<B>GF></B>  dann doch nicht gehen. ;)
<B>GF></B>
<B>GF></B> Grund ist, dass mich stoert, dass fast alle Amiga-Magazine als Namen
<B>GF></B> irgendetwas wie "AmigaXXX" tragen. Z.B. AmigaMagazin, AmigaPlus,
<B>GF></B> AmigaSpecial, AmigaGadget, AmigaAktuell, AmgaDOS, AmigaReport,
<B>GF></B> AmigaMonitor usw. usf. - Langweilig! (Ausnahme: die selige `Kickstart`)

<B>AW>></B> Bleibt die Hoffnung auf das Eintrudeln von Beitr&auml;gen und das
<B>AW>></B> Durchhalteverm&ouml;gen der Redaktion.

<B>GF></B> Dem kann ich mich nur anschliessen. :)

<HR>

Somit auch mal ein kleiner, vielleicht interessanter Blick in unsere
`Interna`.

F&uuml;r die n&auml;chste Ausgabe bin ich wieder auf Eure Kommentare, Briefe und
Reaktionen angewiesen, &uuml;ber die sich auch die gesamte Redaktion freut,
daher: la&szlig;t Euren alten Postsack nicht h&auml;ngen! ;)

Euer

<B>Alter Postsack. </B>
</PRE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../kw/uhl.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0997/mmx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

