<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Interview: P.U.R.E.-Design</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Interview</U></H1><BR>mit<BR>P.U.R.E.-Design</CENTER>

<P>P.U.R.E.-Design ist das Team, das mit Flyin`High sein erstes Spiel
f&uuml;r den Amiga herausgebracht hat. Ein <A HREF="../sw/9709fh.htm">Test</A> ist ebenfalls in dieser
Ausgabe zu lesen.</P>

<BR>
<TABLE BORDER=0>
<TR>
    <TH>AmZ:</TH><TD>Gregor Franz</TD><TD>(AmZeiger)</TD>
</TR>
<TR>
    <TH>IV:</TH><TD>Igor Vucinic</TD><TD>(Projektleiter)</TD>
</TR>
<TR>
    <TH>MP:</TH><TD>Markus P&ouml;llmann</TD><TD>(Programmierer)</TD>
</TR>
</TABLE>
<BR><BR>
<TABLE BORDER=1>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TD>
    <TD>Kannst du P.U.R.E.-Design kurz vorstellen. Wer steht dahinter?
    Wann und wie kam es zur Bildung eures Teams?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Also, PURE-Design besteht aus...<BR>
    <P>Markus P&ouml;llmann, das Programmier- und 3D-Genie (er mu&szlig; immer
    meine Ideen ausbaden :-), Michael Zimmer, unserem Grafiker, der
    Reflections praktisch im Schlaf bedienen und auch mit Personal
    Paint die irrsten Grafiken zaubern kann (ihm haben wir &uuml;brigens
    fast s&auml;mtliche Level in FLYIN'HIGH zu verdanken, aber dazu sp&auml;ter
    mehr...), Jochen Heizmann (er ist unser Musikus und fuer s&auml;mtliche
    Mods und Soundeffekte in FLYIN'HIGH verantwortlich) und last but
    not least bin ich auch noch da und k&uuml;mmere mich um Projektleitung,
    Spieldesign und was nebenbei noch anf&auml;llt. Gegr&uuml;ndet wurde PURE
    eigentlich mehr zuf&auml;llig. Als wir alle Leute beisammen hatten,
    brauchten wir noch einen Namen f&uuml;r die Truppe.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Habt ihr, evtl. auch solo, vor Flyin` High schon etwas anderes
    herausgebracht?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>FLYIN'HIGH ist das erste Projekt von PURE-Design. Markus hat aber
    zuvor noch einen prima Weltraumshooter namens &quot;Virtual Interceptor&quot;
    hingelegt und unser Grafiker, der Michael, zeichnet f&uuml;r
    Programmierung und Design von &quot;Amitron&quot; verantwortlich.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wieso habt ihr euch dann als Projekt f&uuml;r ein Rennspiel in der
    Machart von Flyin` High entschieden?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Ui, das war eine ganz lustige Geschichte :) FLYIN'HIGH sollte
    urspr&uuml;nglich gar kein Renn-, sondern ein Ballerspiel werden und
    &quot;Trigger&quot; hei&szlig;en. Als ich Markus das erste Mal angerufen hatte,
    wollte ich &quot;ein Spiel, wo man die Raumschiffe von hinten sieht
    und durch einen Tunnel fliegt&quot;... Naja, nach einigen Tagen sollte
    es dann ein Polygon-Rennspiel werden, weil gute Rennspiele nach
    wie vor auf dem Amiga rar sind. Dann hab ich Markus solange mit
    Texturemapping genervt, bis er einige Versuche und
    Nervenzusammenbr&uuml;che sp&auml;ter doch noch eine ausreichend schnelle Routine
    zusammengebaut hatte, die noch perfektioniert werden mu&szlig;te.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Jaja, Flyin'High habe ich sechs mal von vorne angefangen, bis wir
    was hatten, was Igors Tr&auml;umen am n&auml;chsten kam.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Eine der fr&uuml;heren Demos wartete noch mit Sound von Marcel D&ouml;ring
    auf. Jetzt, in der Endversion, zeichnet Jochen Heizmann daf&uuml;r
    verantwortlich. Wie kommts? Gab es Probleme?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Leider hat Marcel unser Team aufgrund privater Probleme verlassen
    und wir standen pl&ouml;tzlich ohne Musiker da. Dann hab ich einen
    befreundeten Producer (gell, Emmanuel? :) gefragt und der hat mir
    den Jochen empfohlen.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Einige sind der Ansicht, da&szlig; Vollwertspiele auf dem Amiga keine
    Berechtigung haben bzw. sich nicht rechnen. Seid ihr auch der
    Ansicht, habt ihr die Sache mehr `just for fun` durchgezogen
    oder ganz andere Erwartungen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD><P>Die Zeiten, in denen man mit Amiga-Spielen viel Geld verdienen
    konnte, sind (leider :) vorbei - wenn es sie denn je gegeben haben
    sollte. H&auml;tten wir FLYIN'HIGH rein aus finanziellen Interessen
    aufgezogen, w&auml;re das Projekt wahrscheinlich fr&uuml;hzeitig wegen
    &quot;Etatmangel&quot; hingeschmissen worden. Es stecken immerhin rund
    anderthalb Jahre Entwicklungszeit in diesem Spiel!</P>
    <P>Ein Grund f&uuml;r die Existenz von FLYIN'HIGH ist, da&szlig; wir
    eingefleischte Amiga-Freaks sind, die vielleicht nicht immer ganz
    vern&uuml;nftig denken (Aufwand). Aber ich hoffe, es ist uns gelungen, mit
    diesem Spiel eine Bresche zu schlagen, was Systemanforderungen
    angeht. Die Leute muessen verstehen lernen, da&szlig; solche Spiele nun
    mal nicht auf einem &quot;nackten&quot; 1200er, geschweige denn 500er, m&ouml;glich
    sind.</P>
    <P>Allerdings bedeutet der &quot;Freak&quot;-Faktor nicht, da&szlig; es uns egal ist,
    wie das Spiel verkauft wird. Positive Reaktionen von begeisterten
    Usern sind uns sehr wichtig, aber was n&uuml;tzt uns ein Lobregen, wenn
    das Spiel im Ladenregal verstaubt...?</P></TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Ich habe es wirklich nur aus Spass am Programmieren gemacht. Es war
    eine Herausforderung. Wenn dabei noch etwas Geld herausspringt, ist
    das nat&uuml;rlich auch nicht schlecht. F&uuml;r eine eventuelle Fortsetzung
    mu&szlig; Flyin'High aber wirklich gut ankommen.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Das Spiel wird vom APC&amp;TCP-Computerclub ver&ouml;ffentlicht. Warum?
    Weil ihr Mitglieder seid, niemanden anderen gefunden habt, oder
    weil die Konditionen nberzeugt haben?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD><P>Wir haben selbstverst&auml;ndlich auch andere Firmen angeschrieben. Aber
    dort wollte man sich entweder noch nicht festlegen, oder man schien
    uns nicht zu beachten (so passiert bei einem gro&szlig;en britischen
    Softwarehaus, das sich inzwischen vom Amiga zur&uuml;ckgezogen hat - bis
    heute hat man uns NICHTS geantwortet) :(</P>

    <P>Schlie&szlig;lich haben wir uns fuer den APC&amp;TCP entschieden, tats&auml;chlich
    haben die &uuml;berzeugende Konditionen und, ..sagen wir mal, das
    &quot;Betriebsklima&quot; stimmt auch :)</P></TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Ich kannte den Andreas von APC&amp;TCP schon von fr&uuml;her, und er hatte
    mich auch als Programmierer &quot;angeworben&quot;.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>War wohl Trick 17 ? ;)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Erraten...</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was bedeutet eigentlich das ISLONA-Logo im Vorspann? Steht
     P.U.R.E. fnr eine Abk&uuml;rzung?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>Igor:</TH>
    <TD>Islona ist der englische Distriutor fuer APC&amp;TCP-Produkte. &Ouml;hm,
    die Punkte bei &quot;PURE&quot; haben eigentlich keine besondere Bedeutung
    (..Mist, erwischt ;) - es sah nur besser aus ;))</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD> Wohnt ihr eigentlich weit weg voneinander bzw. wie habt ihr das
    Projekt eigentlich besprochen, ver&auml;ndert und aufeinander
    abgestimmt?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Tja, dummerweise wohnen wir nun extrem weit weg voneinander, genauer
     gesagt, in ganz Deutschland verstreut :) Das macht so eine Koordination
     nat&uuml;rlich nicht gerade einfacher, was wiederum die Post und
     die Telekom gefreut haben d&uuml;rfte ;)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD><P>Wenn das Geld, was ich durch Flyin'High bekomme, zumindest ausreicht,
    um Telefongeb&uuml;hren, Porto und Disketten zu bezahlen, bin ich schon
    zufrieden. ;-)</P>
    <P>Es ist schon ziemlich aufwendig und kostet `ne Menge Zeit, wenn man
    f&uuml;r jede Kleinigkeit erstmal versuchen mu&szlig;, einen der Gruppe an die
    Strippe zu bekommen.</P></TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Gab es besondere Probleme im Verlauf der Entwicklung? Wenn ja, wie
     habt ihr sie in den Griff bekommen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Das gr&ouml;&szlig;te Problem war es, eine Steuerung f&uuml;r den Buggy einzubauen,
    mit der man auch zurechtkam :) Es hat wirklich lange gedauert, bis
    wir die Sache im Griff hatten. Und im Entwicklungs-Endspurt habe ich
    mir dann noch die Hand verstaucht, so da&szlig; unser Grafiker die
    restlichen Levels konstruieren mu&szlig;te.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Ich kann das Wort &quot;Steuerung&quot; nicht mehr h&ouml;ren. ;-)</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Ich wei&szlig;, da&szlig; ihr schon oft gefragt worden seid, warum Flyin` High
     keine Grafikkarten unterst&uuml;tzt. Aber f&uuml;r alle, die die Diskussionen
     nicht verfolgen konnten: Woran liegts? An der technischen Machbarkeit?
     Am Aufwand/Nutzen-Verh&auml;ltnis?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Aaargh, ich liebe diese Frage... Daher bitte ich den Markus, sie zu
    beantworten ;)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Daf&uuml;r gibt es mehrere Gr&uuml;nde. Ich besitze keine Grafikkarte und h&auml;tte
     f&uuml;r jeden Testlauf das Programm zum Andreas schicken m&uuml;ssen. Au&szlig;erdem
     benutzt Flyin'High vier verschiedene Aufl&ouml;sungen, die nicht immer von
     jeder Grafikkarte zu jeder Zeit dargestellt werden k&ouml;nnen. Man h&auml;tte
     das Spiel von Anfang an anders konzipieren m&uuml;ssen, und als das Wort
     &quot;Grafikkarte&quot; zum ersten Mal fiel, war es dazu schon zu sp&auml;t.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Flyin` High tr&auml;gt im Moment die Versionsnummer 1.0 . Bedeutet dies,
     da&szlig; eventuell sp&auml;ter eine erweiterte Version herauskommen wird,
     vielleicht mit zus&auml;tzlichen Cups?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Schau`n mer mal :)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Inzwischen sind wir bei 1.01. Man kann ja nie wissen, ob wir trotz
    gr&uuml;ndlichen Testens einen Bug &uuml;bersehen haben. Falls doch, gibts
    halt ein Update.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Mit welcher Software habt ihr Flyin` High realisiert?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Anfangs Gcc, dann StormC und MaxonAsm. GFABasic kam auch mal zum
    Einsatz. ;-) Unser Streckeneditor l&auml;uft mit der bgui.library.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was wollt ihr als n&auml;chstes machen? Habt ihr schon konkrete
    Planungen oder h&auml;ngt das vom Erfolg von Flyin` High ab?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD><P>Markus arbeitet im Moment an einem Erste-Sahne-Weltraum-Game a la
    &quot;Privateer&quot; namens &quot;Phoenix&quot; und Jochen programmiert flei&szlig;ig an
    &quot;Pulsator&quot;, einem prima Horizontalshooter.</P>
    <P>Was in Zukunft von PURE zu sehen sein wird, h&auml;ngt im wesentlichen
    davon ab, wie FLYIN'HIGH ankommen wird... Wir lieb&auml;ugeln da mit
    etwas, aber da m&ouml;chte ich noch nichts n&auml;heres zu sagen.</P></TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Ein 68020 wird da zumindest nicht mehr reichen.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Was haltet ihr von der Gateway2000-&Uuml;bernahme? Hat der Amiga eine
    neue Chance oder welche Entwicklungen k&ouml;nnen ihm zu einer verhelfen?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Langsam wird es Zeit, das sich etwas tut. Leistungsf&auml;higere Rechner
     m&uuml;ssen her, aber schnell! Und vor allem sollte AI endlich auch mal
     mit den Spieleentwicklern zusammenarbeiten. Sicher ist die &Uuml;bernahme
     von Gateway2000 eine tolle Sache (es war ja auch die letzte Hoffnung),
     aber jetzt m&uuml;ssen auf diese Worte auch endlich mal Taten folgen.</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Die sollten sich zwischen TransAm und A\Box entscheiden und einen
     als offiziellen Amiga-Nachfolger k&uuml;ren.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Wie alt seid ihr eigentlich? Welche Ortschaften macht ihr unsicher? ;)
    Was sind eure Hobbies? Schule/Beruf/Studium etc.?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>18, Rinteln, Auto-Tuning :), Auto-Fahren :), Kino</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>23, F&uuml;rstenfeldbruck, Tanzen, Fliegen, Informatik-Studium.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Fliegen... interessant. Segelflug? Motorflug? Drachenflug? :)</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Motorflug. Ja,ja, ich wei&szlig;: &quot;Umweltsau&quot;. Daf&uuml;r habe ich aber kein
     Auto und bewege mich nur mit Fahrrad und &ouml;ffentlichen Verkehrsmitteln.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Habt ihr eigentlich schonmal einen Blick in den AmZeiger geworfen? Was haltet ihr von ihm?</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>IV:</TH>
    <TD>Also, wenn ich ehrlich gestehen soll... ich kenne ihn nur vom H&ouml;rensagen her :))
    Jaja, ich wei&szlig;, Schande &uuml;ber mich ;) Aber k&ouml;nnte ich
    wenigstens die Ausgabe mit unserem Interview drin haben???</TD>
</TR>
<TR BGCOLOR=#DADADA>
    <TH>MP:</TH>
    <TD>Sicher, allerdings wegen knapper Zeit nur einen kurzen. Es macht
    aber einen guten Eindruck.</TD>
</TR>
<TR BGCOLOR=#FFFFFF>
    <TH>AmZ:</TH>
    <TD>Vielen Dank f&uuml;r das Interview!</TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="0997iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="apctcp.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

