<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Frau Gisela`s Problemecke</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Frau Gisela`s Problemecke</U></H1></CENTER>
Dies ist eine neue Rubrik, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.<BR>
<HR>
<P>Von verschiedenen DOpus5-Usern wurden spezielle Probleme an Andreas
Schlick herangetragen, an den ich somit das Wort &uuml;bergebe:</P>
<BR>
<TABLE BORDER=1>
<TR BGCOLOR="#FFFFFF">
    <TD><A NAME="piktoplus">Frage:</A></TD>
    <TD>Ich kann per Short-Cut einfach nicht die Lister in den Piktogramm Plus
        Modus umschalten. Was mache ich falsch, bzw. wo ist die Taste mit dem Hochkomma?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TD>Antwort:</TD>
    <TD>Die &#180;-Taste ist direkt neben der Any-Key-Taste. ;-))<BR>
    Im Ernst, die Short-Cuts der Men&uuml;s sind f&uuml;r die amerikanische Tastaturbelegungen ausgelegt.
    Ich pl&auml;dere daher schon seit V5.0 daf&uuml;r, da&szlig; die <B>gesamten</B> Men&uuml;s konfigurierbar werden,
    damit die Short-Cuts auch &auml;ndern kann. Bei der deutschen Tastaturbelegung liegt das ben&ouml;tigte
    Zeichen auf der Tastekombination &lt;linke Alt + &auml;&gt;.<BR>
    Um nun den Lister umzuschalten, mu&szlig; man zuerst den Mauszeiger auf die Statuszeile des Listers bewegen
    (die Zeile, in der angezeigt wird, wieviele Dateien und Verzeichnisse vorhanden sind), dr&uuml;ckt dann
    die rechte Amiga-Taste (gedr&uuml;ckt halten), dann die linke Alt-Taste (gedr&uuml;ckt halten) und zu guter letzt noch
    die &auml;-Taste. Mit etwas Geschick wird dann der Lister umgeschaltet. :)</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TD>Frage:</TD>
    <TD>Hm, aber warum mu&szlig; ich denn auch noch den Mauszeiger auf die Statuszeile bewegen??</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TD>Antwort:</TD>
    <TD>Durch das Dr&uuml;cken der linken Alt-Taste und der Amiga-Taste wird die linke Maustaste simuliert, dadurch
    w&uuml;rde dann z.B. ein anderes Fenster aktiviert, anstatt da&szlig; DOpus das &#180;-Zeichen zum Umschalten erh&auml;lt. :(
</TR>
<TR BGCOLOR="#FFFFFF">
    <TD><A NAME="Script">Frage:</A></TD>
    <TD>Gibt es denn keine andere M&ouml;glichkeit? Es mu&szlig; doch trotz dt. Tastaturbelegung bequemer gehen!</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TD>Antwort:</TD>
    <TD>Doch, die gibt es! Und zwar kann ein HotKey in DOpus definiert werden, der den Quelllister umschaltet.
    Die Typ des Hotkeys ist &quot;Befehl&quot; und dann mu&szlig; folgendes eingegeben werden:<BR>
    <BLOCKQUOTE>Set Mode Icon Action</BLOCKQUOTE>
    Ich habe mir jedoch auch keine Kosten und M&uuml;hen gescheut &lt;h&uuml;stel&gt; und habe ein ARexx-Script geschrieben,
    das z.B. auf einen Hotkey gelegt, dann die Modi des Quell- bzw. Ziellister hin- und herschaltet.
    Dadurch kann man dann mit <B>einem</B> Hotkey den Quelllister oder Ziellister zwischen Piktogramm Plus und
    Text und/oder Piktogramm hin- und herschalten. Das <A HREF="scripts.lha">Script</A> liegt diser AmZeiger als
    lha gepacktes Archive bei. Nach dem Entpacken wird es einfach nach Rexx: kopiert und dann der entsprechende
    Hotkey eingerichtet (Typ: ARexx):
    <BLOCKQUOTE>Rexx:DO-Pikto.rexx {Ql}</BLOCKQUOTE> f&uuml;r den Quelllister, bzw.
    <BLOCKQUOTE>Rexx:DO-Pikto.rexx {Qd}</BLOCKQUOTE> f&uuml;r den Ziellister.
    Es ist leider <B>nicht</B> m&ouml;glich den <B>aktiven</B> Lister unabh&auml;ngig von der Quell/Ziellister-Einstellung
    zu manipulieren. :-(
    <P>Zur Konfiguration des Script mu&szlig; mit einem Texteditor (Ich empfehle <A HREF="http://www.clearlight.com/~dietmar/">GoldED</A>)
    die Zeile &quot;IconToo = 0&quot; ge&auml;ndert werden.<BR>
    Wird &quot;IconToo = 0&quot; gesetzt (ohne die Anf&uuml;hrungsstriche!) dann wird nur zwischen dem Text und dem Piktogramm Plus
    Modus hin- und hergeschaltet. Wird &quot;IconToo = 1&quot; gesetzt (ohne die Anf&uuml;hrungsstriche!), dann schaltet
    das Scriipt zwischen allen drei Modi hin- und her.</P>
    Bei langsamen Rechner/Festplatte <U>k&ouml;nnte</U> es einen Geschwindigkeitsgewinn bringen, wenn man vorher (am besten
    aus der User-Startup heraus) das Script nach RAM: kopiert und es von da aus aufruft. Tests in dieser Richtungen
    wurden von uns jedoch nicht vorgenohmen.
    </TD>
</TR>
<TR>
    <TD COLSPAN=2><HR></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TD>Frage:</TD>
    <TD>Ich habe einen Internet-Zugang und benutze Miami mit div. Zusatztools. Wenn ich nun online gehen, mu&szlig; ich immer
    s&auml;mtliche Programme starten (z.B. Voyager, YAM, AmFTP...). Kann sowas nicht auch automatisiert werden?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TD>Antwort:</TD>
    <TD>Auch daf&uuml;r habe ich ARexx-Script da. (Welch ein Zufall ;-) Das <A HREF="scripts.lha">Script</A> liegt ebenfalls
    in dem Lha-Archive.
    <P>Zur Installation wird es einfach nach Rexx: kopiert (Dateiname: &quot;MST.rexx&quot;).
    Die Konfiguration l&auml;uft wieder &uuml;ber einen Texteditor. Nach dem einleitenden Kommentar kommen die Konfig-Zeilen.
    F&uuml;r jede der unterst&uuml;tzten Programme gibt es zwei Zeilen. Die erste Zeile gibt an, ob das Programm gestartet, bzw.
    beendet wird und die zweite gibt den Pfad+Programnamen an. Die Variablen entsprechen den Programmnamen und die
    Variablen des Pfades entspricht dem Programmnamen + &lt;Unterstrich&gt; + &quot;path&quot;<BR>
    Bei einer 0 wird das Programm nicht gestartet/beendet und bei einer 1 wird es.</P>
    <P><B>Hinweis:</B> MicroDot-II kann aufgrund des Mangels einer Dokummentation des ARexx-Ports bzw. dem Fehlen
    desselben nicht beendet werden!</P>
    <P>Das ARexx-Script erwartet als Parameter eine 0 oder eine 1. Bei der Null werden die Programme gestartet und bei der
    Eins werden sie beendet. Das Script kann entweder direkt aus einer Shell aufgerufen werden (mit rx) oder l&auml;&szlig;t sich
    als Button in DOpus eingebunden werden. Desweiteren l&auml;&szlig;t es sich noch in Miami einbinden.
    Auf der Seite &quot;Events&quot; von Miami lassen sich n&auml;mlich ARexx-Scripts definieren, die beim Start oder beim Beenden
    von Miami ausgef&uuml;hrt werden. Dort kann dann das Script eingetragen werden (dann sollte aber Miami=0 eingestellt sein und
    der Parameter darf auch nicht weggelassen werden).</P>
    </TD>
</TR>
</TABLE>

<P>Soweit meine Antworten... :-) <BR> Euer <A HREF="mailto:A.Schlick@BBrandes.in-brb.de">Andreas Schlick</A></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../kw/9709c.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0997/postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

