<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - Gedanken zum WWW</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>"Im Netz der Vorurteile"</U></H1><BR>
Gedanken zum WWW<BR>von<BR><A HREF="mailto:G.Franz@BBrandes.in-brb.de">Gregor Franz</A></CENTER>

<P><B>Internet-Boom... Cyber-Sex... Online-Kriminalit&auml;t... Web-Surfen...</B> usw.</P>

<P>Schlagw&ouml;rter, Modew&ouml;rter und teilweise sinnentleerte Neusch&ouml;pfungen unseres
Sprachschatzes, oftmals von Leuten ohne viel Durchblick geschaffen oder
gebraucht, sollen uns bzw. die Allgemeinheit, darauf bringen, da&szlig; entweder
das Internet (vordergr&uuml;ndig meist nur auf das WorldWideWeb reduziert) uns
vollkommene Freiheit verschafft und den Sprung in das n&auml;chste Jahrtausend
bedeutet oder, als extremer Gegensatz, vollkommene &Uuml;berwachung und das
totale Verbrechen erm&ouml;glicht.</P>

<P>Dann fallen einem Fernseh- oder Zeitungsberichte (insbesondere `themenfremde` Publikationen) ein bzw. auf, in denen u.a. von der Verbreitung
pornographischer, radikaler, verbrecherischer oder volksverhetzender
Inhalte die Rede ist.</P>

<P>Das entgegengesetzte Extrem verspricht die eierlegende Wollmilchsau und
meint, das Internet w&uuml;rde den gr&ouml;&szlig;ten Umbruch in der Zivilisation, seit
Erfindung des Rades, bewirken.</P>

<B>Was ist dran?</B><BR>
<P>Keine einfach zu beantwortende Frage. Ich werde mich auch nicht
verleiten lassen, sie wirklich beantworten zu wollen, sondern nur
ein paar Eindr&uuml;cke schildern.</P>

<P>Es gibt Risiken. Von Cookies/Java/Javascript u.&auml;. ist die Rede, die es
m&ouml;glich machen sollen, heimische Festplatten zu durchforschen oder dort
zu schalten und zu walten, wie es ihnen gef&auml;llt. Teilweise ist das ganz
sicher noch Zukunftsmusik.</P>

<P>Tats&auml;chlich nutzt `das Verbrechen` das Internet. Genau wie alle anderen
Institutionen und Lebensbereiche. Und genau, wie es schon immer alle
M&ouml;glichkeiten, die sich bieten, genutzt hat und nutzen wird.</P>

<P>Ist das wirklich so verwunderlich? Ganz klar, da&szlig; rechtlich gesehen
noch vieles im Argen liegt, da&szlig; da etwas getan werden mu&szlig;. Deswegen
wird aber doch nicht gleich aus jedem Nutzer ein Verbrecher, selbst
wenn er durch Zufall auf solch einen Bereich sto&szlig;en sollte.</P>

<P>Genauso wenig, wie man nicht automatisch zum Extremisten wird, weil
einem eine solche Zeitschrift in die Finger kommt.</P>

<P>Das bedeutet, da&szlig; insbesondere die jeweiligen `Kreise` diese Angebote
in Anspruch nehmen, die rechtliche Grauzone des Internet (in vielen
L&auml;ndern) f&uuml;r ihre Zwecke ausnutzen.</P>

<P>Zur anderen Seite der Medaille: Kaufen wir, die wir Zugriff zum Internet
haben, jetzt wirklich alles hier im `virtuellen Kaufhaus` ein? Nein?</P>

<P>Bl&auml;ttern wir etwa doch h&auml;ufiger in aller Ruhe im dicken, papiernen (aber
kostenlosen) Quelle-Katalog, als teuer online in deren WWW-Angebot?</P>

<P>Und das normale Versandgesch&auml;ft hat sicherlich noch die beste M&ouml;glichkeit
Kunden auch im Internet zu gewinnen. Aber die CD kann man im Gesch&auml;ft
probeh&ouml;ren, einen Blick in das Buch werfen, Sachen anprobieren, Lebensmittel
begutachten - bevor man kauft!</P>

<P>Selbst wenn das `virtuelle Geld` sicher ist, so hat `die Wirklichkeit`
von Gesch&auml;ften mit menschlicher Beratung dem Internet noch einiges voraus.</P>

<P>Fast alle bekannten und alle m&ouml;glichen nicht so bekannten Firmen st&uuml;rmen
das Internet, um, wie es hei&szlig;t, den Zug nicht zu verpassen oder das Bein
in der T&uuml;r zu haben, wenn der Zug denn so richtig abgehen sollte und das
Netz ein profitables Pflaster wird.</P>

<P>Denn das ist es noch nicht. Viele Provider machen Miese, die meisten
kommerziellen Angebote im Internet werfen keine gro&szlig;en Gewinne ab,
ja von den Suchmaschinen z.B., die eigentlich Werbung am sinnvollsten
Vermarkten k&ouml;nnen, soll bis jetzt gerademal Yahoo! knapp im gr&uuml;nen
Bereich liegen.</P>

<P>Eines sp&uuml;rt man dagegen kaum in den lobpreisenden Berichten oder den
Verunglimpfungen der Medien. Das, trotz einer gewaltigen Zunahme mit
steigender Tendenz, und einer &Uuml;berlastung des Netzes, nur ein sehr
geringer Teil der Bev&ouml;lkerung im Internet rumtingelt. Selbst in den
Industrienationen.</P>

<P>F&uuml;r mich ist das Netz immer noch in der Hauptsache das, wof&uuml;r es
geschaffen wurde. Ein gewaltiger Pool von Informationen. Das ist
auch sein gr&ouml;&szlig;ter Nutzen.</P>

<P>Hier kann man auch Gleichgesinnte treffen, ob Nutzer desselben Computers,
Betriebssystems oder ob Fans derselben Musikgruppe oder etwas anderem.</P>

<P>...und man kann auf der Suche nach ihnen und den gew&uuml;nschten Informationen
auf einer Vielzahl von obskuren Seiten landen, die einem das Blaue vom
Himmel weg versprechen und dann nur einen Haufen Werbung beinhalten, laue,
alte oder unbewiesene Infos anbieten, oder der Selbstdarstellung dienen.</P>

<P>Denn Suchmaschinen &uuml;berpr&uuml;fen halt (meistens) nur nach Stichw&ouml;rtern und
nicht auf den Inhalt von Seiten. Trotzdem sind die Suchmaschinen die
festen Adressen im Web. Sie versuchen Ordnung in das Chaos zu bringen,
einen vor dem unorganisierten Fall ins bodenlose Internet zu bewahren.</P>

<P>So habe ich schon einige `Sessions` erlebt, die ich begonnen habe, in
der festen Absicht, nach einer bestimmten Sache Ausschau zu halten, ja
intensiv danach zu suchen und man sich dann, nach stundenlanger Hangelei
durch unz&auml;hlige, teilweise obskure Seiten, genauso schlau wie zuvor
wiederfindet.</P>

<P>Das waren einige meiner Ansichten und Eindr&uuml;cke, da, wie ich festgestellt
habe, einige Leser nicht mit dem Internet vertraut sind und noch keine
eigenen Erfahrungen sammeln konnten.</P>

<P>Das sollte kein Pl&auml;doyer f&uuml;r oder gar gegen das Internet, respektive
WorldWideWeb sein, sondern zeigen, da&szlig; es noch kein Forum f&uuml;r 
&uuml;bersteigerte Hoffnungen oder &uuml;bertriebene &Auml;ngste ist.</P>

<P>Die Zukunft h&auml;lt noch einiges an Entwicklungsm&ouml;glichkeiten bereit, aber
bis das Internet oder &auml;hnliche Netze eines Tages mit der Realit&auml;t
konkurrieren k&ouml;nnen, wie in einigen Science Fiction (oder Horror?)-
Visionen, wird noch einige Zeit ins Land gehen, wenn es denn je dazu
kommen sollte.</P>

<P>Im Moment ist es (das WWW) einfach ein guter Platz, um frische
Informationen zu bekommen, die man teilweise in anderer Form sonst gar
nicht, nur schwer oder sp&auml;ter erhalten kann.</P>

<P>Man mu&szlig; nur wissen, wo sie zu finden sind! Ein paar Anhaltspunkte dazu,
versuche ich weiterhin in der Rubrik <A HREF="web_adv.htm">"Spiderman`s Web-Adventure"</A>
zu geben.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="news.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0997/web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

