<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Bubble Heroes</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Ville Sarell &lt;<a href="mailto:tripper@mbnet.fi">tripper@mbnet.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Bubble Heroesin juoni ei ole niit&auml; omaper&auml;isimpi&auml;, mutta harvemmin sellaista puzzle-peleihin edes kaipaa. Kauan aikaa sitten planeetta Radyaa hallitsi kuningatar Adora ja h&auml;nen kolme sisartaan. Er&auml;&auml;n&auml; p&auml;iv&auml;n&auml; kuitenkin Radyan rauhallinen el&auml;m&auml; mureni ilman tummuessa ja nelj&auml;n leijuvan &quot;saaren&quot; ilmestyess&auml; taivaalle. Pahanilman lintu oli kukas muukaan kuin ilke&auml; ritari Gonzul. Gonzul havitteli Radyan mahtavia taikavoimia ja niiden saamiseksi h&auml;nen t&auml;ytyisi p&auml;&auml;st&auml; kuningattaresta sisareineen eroon. Gonzul loihti loitsun, jolla sisarukset erotettiin ja vangittiin kolmelle saarelle, kuningattaren jouduttua Gonzulin linnaan nelj&auml;nnelle. Kuningatar Adora sai kuitenkin l&auml;hetetty&auml; telepaattisen viestin toivoen jonkun kuulevan sen. Ja n&auml;in tapahtui: kolme Radyan urhoollista asukasta kuuli viestin, ja t&auml;st&auml; peli p&auml;&auml;see alkamaan...
						<p>Pelin hahmoja on siis kolme: Yorumaru, 25-vuotias ritari, jonka harrastuksiin kuuluu mm. kaunotarten pelastaminen; Gupochi, sammakolta n&auml;ytt&auml;v&auml; suloinen, hyv&auml;tapainen olento, joka on vain suudelmaa vaille prinssi ja Nekochan, 18-vuotias kaunotar, ammattinaan palkkatappaja (ulkon&auml;k&ouml; voi pett&auml;&auml;!). Hahmojen kuvitus on selv&auml;stikin saanut vaikutteita japanilaisilta s&ouml;p&ouml;peleilt&auml;, mutta sopii hyvin pelin kokonaisvaikutelmaan.</p>
						<p>Pelityyppej&auml; on my&ouml;s kolme: Story, Championship ja Deathmatch, joista kaksi ensimm&auml;ist&auml; on yksinpelej&auml;. Nimet kertovat kaiken, eli Story-modessa tarina kehittyy sit&auml; mukaa kuin pelaat. Sinun t&auml;ytyy pelastaa kaikki sisarukset ja itse kuningatar, joten peli on jaettu nelj&auml;&auml;n osaan eli saareen. Jokaisessa saaressa on 10 tasoa, jotka t&auml;ytyy selvitt&auml;&auml;, ennen kuin alkaa vangittujen s&ouml;p&ouml;l&auml;isten pelastustaso. Sitten onkin aika kohdata saaren p&auml;&auml;pahis, ja nelj&auml;nnen saarekkeen megapahis on itse p&auml;&auml;piru Gonzul.</p>
						<center>
							<p><img height="240" width="320" src="kuvat/bh1.jpg" border="0" alt=" "></p>
						</center>
						<p>Pelin idea on hyvin samanlainen kuin muiden formaattien hittipelin Puzzle Bobblen (Bust a Move). Itse en ole Puzzle Bobblea pelannut, mutta olen kuullut, ett&auml; Bubble Heroes on omalla tavallaan kuitenkin aivan eri peli, eik&auml; n&auml;it&auml; voi verrata kesken&auml;&auml;n, vaikka perusidea olisikin sama. Tarkoituksena on siis ampua eri v&auml;risi&auml; pallukoita ja yritt&auml;&auml; saada samanv&auml;riset osumaan vierekk&auml;in. T&auml;ll&auml; tavalla pallot r&auml;j&auml;ht&auml;v&auml;t ja ruudun tyhj&auml;ksi saaminen helpottuu. Kuulostaa helpolta? Sit&auml; se ei v&auml;ltt&auml;m&auml;tt&auml; ole, sill&auml; kyseess&auml; ei mielest&auml;ni ole puhdasverinen puzzle-peli, vaan pikemminkin taitopeli. Palloja ammutaan liikuttamalla alhaalta nuolen osoittamaan suuntaan ja usein t&auml;ht&auml;yksen t&auml;ytyy olla todella tarkka, eik&auml; aina ole aikaa mietti&auml; t&auml;ht&auml;yst&auml;&auml;n ikuisuuksiin, sill&auml; ajan kuluessa my&ouml;s ikkunan yl&auml;osa vierittyy alasp&auml;in. Kun sitten yksikin pallo ylitt&auml;&auml; alhaalla olevan rajan, peli loppuu.</p>
						<p>Vaikeustaso on mielest&auml;ni kohdallaan, vaikka en loppuun asti ole ehtinyt pelaamaan. Itse ei peli&auml; voi tallentaa, vaan uuden pelin aloittaessasi p&auml;&auml;set jatkamaan siit&auml; saaresta, johon viimeksi j&auml;it. Huomasin omalla kohdallani ik&auml;v&auml;n bugin: Valitsin sammakkoprinssin ja kuolin kolmannessa saaressa. Kuitenkin jatkettuani peli&auml; my&ouml;hemmin sainkin jatkaa sit&auml; toisella hahmolla. Toivottavasti kyseess&auml; oli ihan satunnainen bugi.</p>
						<p>Championship-modessa pelataan tietokonetta vastaan jaetulla ruudulla v&auml;h&auml;n samaan tapaan kuin Story-moden loppuvastustajia vastaan taistellessa. Jokaisella hahmolla on omat erikoiskykyns&auml;, jotka aktivoituvat sit&auml; mukaa kuin pallukoita tuhoat. Yorumarun erikoiskyky on ruudun t&auml;ytt&ouml; palloilla, Gupochin taas taikoo vastustajan ikkunan yl&auml;osaa alemmas ja Nekochan osaa pys&auml;ytt&auml;&auml; vastustajan pelin hetkeksi ajan kuitenkin kuluessa. Deathmatchissa pelataan samalla tavoin, mutta toista ihmispelaajaa vastaan. T&auml;m&auml; kuulemma on todella hauskaa, mutta itse en ole ehtinyt l&ouml;yt&auml;&auml; kaveria pelaamaan, joten enemp&auml;&auml; en voi sanoa. Verkkopelituki olisi tietenkin muuttanut asian. ;)</p>
						<center>
							<p><img height="240" width="320" src="kuvat/bh2.jpg" border="0" alt=" "></p>
						</center>
						<p>Bubble Heroesin grafiikka on miellytt&auml;v&auml;&auml;. V&auml;rej&auml; k&auml;ytet&auml;&auml;n mukavasti, ja vaikka peli on matalaresoluutioisessa (320x240 8-bit) grafiikkatilassa, se ei haittaa, koska pelattavuus on todella mainio. Pelist&auml; on AGA/RTG-versiot ja molemmat toimivat muitta mutkitta ainakin testikokoonpanossa. RTG-versiossa tarvitset RTGmasterin koneelle asennettuna (on mukana CD:ll&auml;) ja grafiikkatilan t&auml;ytyy olla edell&auml; mainittu 320x240 8-bit. Kuvien h&auml;ivytt&auml;minen tosin hieman t&ouml;kkii eiv&auml;tk&auml; animaatiot yms. tunnu niin nopeilta kuin AGA-versiossa. Toisaalta peli on alun perin AGA-koneille tehty, eik&auml; itse pelattavuus k&auml;rsi RTG-versiossa tippaakaan.</p>
						<p>&Auml;&auml;niefektit ovat varsin hyv&auml;laatuisia ja peliin sopivia. AHIa ei tueta, mutta eip&auml; se olisi juuri vaikuttanut. Musiikki taas ei mielest&auml;ni ole niin onnistunutta, vaikka suhteellisen hyvin peliin sopiikin. Varsinkin alkudemo olisi kaivannut Chris H&uuml;elsbeckin tapaista melodista pelimusiikkia, tai sitten vain mieleeni muistui niin hyvin Apidya-pelin vastaava intro :) Musiikit toistetaan latausbiisi&auml; lukuunottamatta CD:lt&auml;, joten tarvitset &auml;&auml;nikortin tai jonkun, jolla saat miksattua musiikit ja pelin &auml;&auml;niefektit yhteen.</p>
						<p>Bubble Heroes on hyvin addiktiivinen ja kaksinpelimahdollisuus vain pident&auml;&auml; sen ik&auml;&auml;. Ensimm&auml;iset p&auml;ivityksetkin ovat jo saatavilla ArcadiA developmentsin sivuilta (linkki arvostelun lopussa). Suosittelen l&auml;mpim&auml;sti.</p>
						<p>Loppuhuomautus: Pelin ohjekirjan sivuilla j&auml;lleen kerran varoitetaan piratismista ja kerrotaan, ett&auml; ellei peli myy riitt&auml;v&auml;sti, julkaisija Crystal Interactive Software ei todenn&auml;k&ouml;isesti tule jatkossa Amiga-pelej&auml; julkaisemaan. T&auml;m&auml; koskee mm. peli&auml; Gilbert Goodmate, jonka varmasti useimmat meist&auml; haluaisivat n&auml;hd&auml;!</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.made.net/arcadia/" target="_blank">ArcadiA Developments Team</a> (kotisivuilta l&ouml;yd&auml;t my&ouml;s p&auml;ivitykset)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.crystal-software.com/" target="_blank">Crystal Interactive Software Ltd</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">290 markkaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelityyppi:</font></td>
					<td width="50%" bgcolor="#d8ecfd">puzzle</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Demoversiot (kahdessa osassa + lis&auml;ksi p&auml;ivityspaketti):</font></td>
					<td width="50%" bgcolor="#d8ecfd">AGA: <a href="http://www.crystal-software.com/downloads/BHDemo000.dat">osa 1</a> (2,46 Mt), <a href="http://www.crystal-software.com/downloads/BHDemo001.dat">osa 2</a> (2,3 Mt), <a href="http://www.crystal-software.com/downloads/BHAGAPatch.lzx">patch</a><br>
						RTG: <a href="http://www.crystal-software.com/downloads/BHRTGDemos000.dat">osa 1</a> (2,5 Mt), <a href="http://www.crystal-software.com/downloads/BHRTGDemos001.dat">osa 2</a> (1,85 Mt), <a href="http://www.crystal-software.com/downloads/BHRTGPatch.lzx">patch</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">68030, 4 Mt RAM, AGA tai RTG-grafiikkakortti, CD-ROM, kiintolevy</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">
						<ul>
							<li>A1200 (PPC 240 MHz/060 50 MHz), OS 3.9, BVisionPPC, 64 Mt, Delfina Lite, Ariadne II, HyperCom 3Z, 36x CD, 2x CD-R, 20 Gt HD
							<li>A2000 AGA (040/40 MHz) OS 3.9, 32 Mt, 8x CD, 4,3 Gt HD, Multisync
						</ul>
					</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd">85%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd">90%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Musiikki</font></td>
					<td width="50%" bgcolor="#d8ecfd">73%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">95%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">91%</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
