<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Zombie Massacre</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jatko-osat, tuo el&auml;m&auml;n suola. &quot;Viel&auml;k&ouml; maistuisi hyppysellinen Gloomia?&quot; ehdotti pelip&ouml;yd&auml;n ruokalista minulle houkuttelevaan s&auml;vyyn, ja p&auml;&auml;tin ojentaa lautaseni viel&auml; kerran.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Tarjottimen t&auml;ydelt&auml;</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Pelipakettiin on kasattu tavaraa yli puoli rompullista - aikamoinen m&auml;&auml;r&auml; pelille, joka ensimm&auml;isiss&auml; versioissaan julkaistiin parille DD-korpulle mahdutettuna. Tiedostoja on kaikkiaan 268 megatavua, joista introfilmi bonusp&auml;tkineen vie suurimman osan, 164 megaa. Levyll&auml; on my&ouml;s Multimedia-hakemistossa demoja Alpha Softwaren muista peleist&auml; ja ohjelmista sek&auml; &auml;&auml;ni- ja animaatiotiedostoja, yhteens&auml; 63 megan edest&auml;. Lis&auml;ksi l&ouml;ytyy viel&auml; kolme CD-audioraitaa, mukaan lukien pelin alkumusiikki hieman parempilaatuisena, ja englanninkielinen esittelyteksti &auml;&auml;neen luettuna.
						<p>Peli&auml; on tarkoitus k&auml;ytt&auml;&auml; suoraan rompulta, tosin minimiasennus on silti ensin teht&auml;v&auml;, tai peli kaatuu k&auml;ynnistett&auml;ess&auml;. Asennusskripti tekee s-hakemistoon alihakemiston, jossa sijaitsevat rekister&ouml;intikoodi ja pelin tilannetallennus. Kuten aiemmissakin Gloomeissa, tallennuspaikkoja on vain kahden ensimm&auml;isen vaiheen lopussa, ja tallennus tapahtuu tuolloin automaattisesti. Pelin kolme vaihetta sis&auml;lt&auml;v&auml;t yhteens&auml; noin 40 tasoa.</p>
						<p>Itse asensin pelin vakioksi muodostuneeseen tapaani kopioimalla sen k&auml;sin kiintolevylle. Kopioimalla pelk&auml;st&auml;&auml;n varsinaisen pelin sis&auml;lt&auml;v&auml;n hakemiston kului levytilaa vain 29 Mt. T&auml;ll&ouml;in User-Startup-tiedostoon tarvitaan viel&auml; yksi assign-k&auml;skyrivi asennusskriptin jo tekem&auml;n rivin lis&auml;ksi, esim. &quot;assign Zombie_Massacre: HD5:Pelit/ZM&quot;. Sen j&auml;lkeen romppua ei en&auml;&auml; tarvitse laittaa asemaan pelaamista varten.</p>
						<p>Aiemmista Gloomeista tuttuun tapaan ennen ensimm&auml;ist&auml; pelikertaa ajetaan viel&auml; Setup-ohjelma, jolla asetetaan mm. haluttu n&auml;ytt&ouml;tila. Ohjetiedoston mukaan pelimoodin valinnoissa oleva iGlasses-vaihtoehto tukee nyt kyseisten datalasien lis&auml;ksi my&ouml;s BVisionPPC- ja CyberVisionPPC -n&auml;ytt&ouml;kortteihin liitett&auml;vi&auml; &quot;virtual reality glasses&quot; -laseja.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Levottomat hautausmaat</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Jo Gloom 3:ssa k&auml;vi selv&auml;ksi tekij&auml;tiimin peittelem&auml;t&ouml;n innostus zombie-aiheeseen, ja kuten pelin nimest&auml; voi arvata, pahantuulisten raatojen r&auml;hin&ouml;inti jatkuu t&auml;ll&auml;kin kerralla. Mukaan on kirjoitettu my&ouml;s jonkin verran juonentynk&auml;&auml;, joka etenee vaiheiden v&auml;lill&auml;, tosin itse pelin sis&auml;lt&ouml;&ouml;n sill&auml; ei ole liiemmin vaikutusta.
						<p>Vastustajat ovat geneettisill&auml; l&auml;&auml;kkeill&auml; k&auml;siteltyj&auml; entisi&auml; ihmisi&auml;, jotka ovat muuttuneet aivottomiksi mutta sangen vihaisiksi lihasm&ouml;ykyiksi. Heh. No, ainakin se selitt&auml;&auml; niiden huisin ketter&auml;n liikkumisen verrattuna perinteiseen k&auml;sitykseen zombien vaivalloisesta raahautumisesta uhriaan kohti.</p>
						<center>
							<p><img height="252" width="392" src="kuvat/zm1.jpg" border="0" alt=" "><br>
							<i>Vuodet mikrotukihenkil&ouml;n&auml; ovat j&auml;tt&auml;neet j&auml;lkens&auml;.</i></p>
						</center>
						<p>Pelin alkuintro on mustavalkoinen digitoiduista videop&auml;tkist&auml; koostettu animaatio, joka on kuvattu tekij&ouml;iden kotipihalla. Filmin ei liene tarkoituskaan olla ammattitasoinen tai pelottava, vaan pikemminkin rentoa kotivideotyylist&auml; huumoria. Harmi kyll&auml; osittain saman kuuloisia sampleja kuin introssa esiintyy my&ouml;s itse peliss&auml;kin, joten jos haluaa p&auml;&auml;st&auml; peliss&auml; edes jonkinlaiseen tunnelmaan, kannattanee j&auml;tt&auml;&auml; alkuintro katsomatta. Tai edes katsoa se vasta pelattuaan pelin l&auml;pi. You have been warned. :)</p>
						<p>Loppujen lopuksi Zombie Massacre on kuitenkin samanlainen ihan hauska ja paikoitellen vauhdikaskin hupir&auml;iskint&auml; kuin muutkin Gloomit (katso my&ouml;s aiemmat artikkelit Gloom Sakusta #15 ja Gloom Deluxe Sakusta #24). Pelin kaksi ensimm&auml;ist&auml; vaihetta tosin sis&auml;lt&auml;v&auml;t v&auml;h&auml;n turhankin helppoja ja lyhyit&auml; ratoja, jotka eiv&auml;t oikein tarjoa riitt&auml;v&auml;sti haastetta.</p>
						<center>
							<p><img height="210" width="310" src="kuvat/zm2.jpg"><br>
							<i>Ken t&auml;st&auml; k&auml;y saa kaiken toivon heitt&auml;&auml;?</i></p>
							<p><img height="210" width="310" src="kuvat/zm3.jpg" border="0" alt=" "><br>
							<i>Tasojen loput voivat olla h&auml;m&auml;&auml;v&auml;n n&auml;k&ouml;isi&auml;.</i></p>
						</center>
						<p>Kuten aiemmissa Gloomeissa, t&auml;ss&auml;kin on mukana my&ouml;s kaksinpeli sek&auml; koneiden linkitysmahdollisuus, jota tosin ei ollut tilaisuutta testata. Itse pelimoottori ei ole ottanut kovinkaan merkitt&auml;vi&auml; edistysaskelia sitten viime n&auml;kem&auml;n, mutta p&auml;&auml;asia onkin ett&auml; Gloomin hyv&auml; ja nopeasti reagoiva ohjaustuntuma on yh&auml; tallella. Juoksumahdollisuus kun viel&auml; olisi..</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b>Ja kaikilla muisteilla, kiitos!</b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Toisin kuin Setup-ohjelman tarjoaman Multitasking-valinnan perusteella voisi olettaa, moniajo ei tunnu luonnistuvan niin hyvin kuin pit&auml;isi. Toimiihan se kyll&auml; sin&auml;ns&auml; moitteetta, eli taustalle py&ouml;rim&auml;&auml;n j&auml;tetyt taskit saavat kiltisti osansa CPU-ajasta, mutta peli vaikuttaa ry&ouml;st&auml;v&auml;n koko n&auml;pp&auml;imist&ouml;n pelk&auml;st&auml;&auml;n omaan k&auml;ytt&ouml;&ouml;ns&auml;. Niinp&auml; ruudunvaihto tai muiden ohjelmien hallinta n&auml;pp&auml;imist&ouml;lt&auml; eiv&auml;t onnistu lainkaan pelin aikana.
						<p>Ainakin omassa kokoonpanossani peli my&ouml;s joskus jopa kaatuu k&auml;ynnistyksen aikana, ellei muita isompia ohjelmia ensin sammuta kokonaan. Lieneek&ouml; syyn&auml; sitten riitt&auml;v&auml;n suuren yhten&auml;isen Chip-muistialueen puute vai mik&auml;, mutta samaa vikaa ei kyll&auml; Gloom Deluxessa koskaan esiintynyt. Pelaamista se ei onneksi est&auml;, eik&auml; pelaamisen aikana ole tapahtunut ainuttakaan kaatumista.</p>
						<p>Zombie Massacre on nykymittapuulla tietysti enemm&auml;n kuin vain hiukan vanhanaikainen peli teknisesti, joten se ei taida olla kovinkaan kannattava hankinta yhdenk&auml;&auml;n aiemman Gloom-version jo omistavalle, mutta onhan se jonkinlainen pakko-ostos &quot;ker&auml;&auml; kaikki Amigan 3D-pelit&quot;-fanaatikoille. ;)</p>
						<p>Tiett&auml;v&auml;sti Zombie Massacre on mukana my&ouml;s Aminet-rompulla #37 bonusohjelmana. Siihen tuskin on sis&auml;llytetty pelin alkuanimaatioita tai CD-audioraitoja, mutta menetys ei aiheuttane kovinkaan monelle ylitsep&auml;&auml;sem&auml;t&ouml;nt&auml; murhetta.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.alpha-software.co.uk/" target="_blank">Alpha Software</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Julkaisija:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Islona Entertainment Ltd. / Epic Marketing</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td width="50%" bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td width="50%" bgcolor="#d8ecfd">180 markkaa (tai Aminet-CD #37, 90 markkaa)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelityyppi:</font></td>
					<td width="50%" bgcolor="#d8ecfd">3D-r&auml;iskint&auml;</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kieli:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Englanti</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga AGA tai CGFX, 68020, 10 Mt, kiintolevy, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td width="50%" bgcolor="#d8ecfd">Amiga 1200, 68060/50 MHz, 32 Mt, kiintolevy, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td width="50%" bgcolor="#d8ecfd">70%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td width="50%" bgcolor="#d8ecfd">55%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Musiikki</font></td>
					<td width="50%" bgcolor="#d8ecfd">75%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td width="50%" bgcolor="#d8ecfd">90%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td width="50%" bgcolor="#d8ecfd">80%</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
