<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td>
								<td>KOKOUSMUISTIO</td>
							</tr>
							<tr>
								<td width="300">HALLITUS 2000-2001</td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td>7.1.2001</td>
							</tr>
						</table>
						<br>
						HALLITUKSEN KOKOUS 4/2000<br>
						<br>
						<table width="100%">
							<tr>
								<td valign="top" width="100">AIKA</td>
								<td>1. lokakuuta - 31. joulukuuta</td>
							</tr>
							<tr>
								<td valign="top" width="100">PAIKKA</td>
								<td>Internet-postituslista</td>
							</tr>
							<tr>
								<td valign="top" width="100">L&Auml;SN&Auml;</td>
								<td>Terho Henriksson<br>
									Tomi Jaskari<br>
									Timo Kemppaala<br>
									Valtteri Murto<br>
									Jarmo Piippo<br>
									Ville Sarell<br>
									Anu Seilonen<br>
									Paula-Christiina Wirtanen<br>
								</td>
							</tr>
						</table>
						<br>
						<b>1</b><br>
						<b>T&auml;st&auml; kokousmuistiosta</b>
						<p>T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 1.10. - 31.12.2000 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.</p>
						<p>Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.</p>
						<p><b>2</b><br>
						<b>K&auml;siteltyj&auml; aiheita</b></p>
						<p>Yhdistyksen tilinhoidon uudistus etenee. Kirjanpitoj&auml;rjestelm&auml;n suunnittelu ja tilikausien 1994-1999 toteuttaminen uuden j&auml;rjestelm&auml;n mukaisesti ovat Janne Sir&eacute;nin urakoimana jo valmistuneet tilip&auml;iv&auml;kirjojen ja p&auml;&auml;t&ouml;slaskelmien osalta, ja tilinp&auml;&auml;t&ouml;sten muokkaaminen on seuraava teht&auml;v&auml;. Tilinp&auml;&auml;t&ouml;sten laskemisen ja tarkastuttamisen j&auml;lkeen ne hyv&auml;ksytet&auml;&auml;n ylim&auml;&auml;r&auml;isess&auml; yhdistyskokouksessa.</p>
						<p>Vuosikokouksessa 2000 tehtyjen p&auml;&auml;t&ouml;sten toteuttaminen on my&ouml;s ollut ty&ouml;n alla. Yhdistyksen uudeksi tilipankiksi valittiin k&auml;yt&auml;nn&ouml;n syist&auml; Oulun Osuuspankki, jonne tili siirret&auml;&auml;n, kunhan toimenpiteeseen tarvittavat yhdistysrekisteriote ja allekirjoitetut p&ouml;yt&auml;kirjanotteet ovat k&auml;ytett&auml;viss&auml;. Tilink&auml;ytt&ouml;oikeudet m&auml;&auml;r&auml;t&auml;&auml;n ainakin alkuvaiheessa puheenjohtaja Anu Seiloselle ja sihteeri Jarmo Piipolle. K&auml;ytt&ouml;oikeuksia voidaan my&ouml;hemmin lis&auml;t&auml;, jos tarvetta ilmenee.</p>
						<p>Vuosikokouksen toteuttamat yhdistyksen s&auml;&auml;nt&ouml;muutokset toimitetaan virallisten muutosilmoituskaavakkeiden avulla Patentti- ja rekisterihallitukselle p&auml;ivitett&auml;v&auml;ksi yhdistysrekisteriin. Ilmoitusten k&auml;sittely on maksullinen, joten asiaa on valmisteltu rauhassa huolellisesti paneutuen, jotta kaikki tarvittavat muutokset rekisteriin saadaan yhdell&auml; ilmoituskerralla hoidettua.</p>
						<p>Vuosikokouksen 2000 p&auml;&auml;t&ouml;ksiin ja niiden perusteluihin voi tutustua tarkemmin vuosikokouksen p&ouml;yt&auml;kirjasta, joka on n&auml;ht&auml;vill&auml; Saku-lehdess&auml; #34 ja yhdistyksen kotisivuilla.</p>
						<p>Saku 2001 -tapahtuman suunnittelu on hyv&auml;ss&auml; vauhdissa. Yhdistyksen tapahtumavastaava Terho Henriksson on ahkerasti haalinut tapahtuma-avustajia, avannut yhteyksi&auml; Amiga Inc.:n ja muiden yritysten suuntaan, selvitellyt tapahtuman sponsorointimahdollisuuksia, tutkinut sijoitusvaihtoehtoja ja kehitellyt ideoita. Monelle osa-alueelle kaivataan edelleen lis&auml;apua, joten Terholle (<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>) kannattaa tarjota osaamistaan tai esimerkiksi laitteistoaan k&auml;ytett&auml;v&auml;ksi tapahtumassa.</p>
						<p>Janne Sir&eacute;nin aloitteesta yhdistys l&auml;hetti loppuvuodesta tervehdyskirjeen Amigalta el&auml;kkeelle j&auml;&auml;v&auml;lle Amiga Deutschlandin Petro Tyschtschenkolle. Kirjeeseen ker&auml;ttiin entisten ja nykyisten yhdistysaktiivien ja suomalaisten amigistien nimikirjoituksia ja tervehdyksi&auml; ymp&auml;ri maata.</p>
						<p>Yhdistyksen kotisivujen osoite muuttui vuoden vaihteessa. Tieto muutoksesta tuli yhdistyksest&auml; riippumattomista syist&auml; valitettavasti vasta aivan viime hetkell&auml; ennen vanhan osoitteen sulkemista. Sivut on onneksi kuitenkin suunniteltu mahdollisimman helposti uuteen ymp&auml;rist&ouml;&ouml;n siirrett&auml;viksi, joten niille teht&auml;v&auml;t muutokset eiv&auml;t vaatineet kohtuuttoman pitk&auml;&auml; aikaa. Jatkossa tavoitteena on l&ouml;yt&auml;&auml; jokin varmatoiminen ja pysyv&auml; ratkaisu yhdistyksen ikiomaksi osoitteeksi, jotta mahdolliset palvelinten vaihtumiset tai vastaavat muutokset eiv&auml;t vaikuttaisi sivujen toimintaan tai yll&auml;pitoon.</p>
						<p>Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
