<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Vuonna 2000 puhdistettiin p&ouml;yt&auml;&auml;</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
						Valokuvat: Anu Seilonen, Marko Lustim&auml;ki</font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Huippuonnistuneen ja toiminnaltaan Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n historiassa kaikkein tasaisimmin jakautuneen vuoden 1998 j&auml;lkeen vuosi 1999 oli hieman vaisumpi esitys: Saku 99 oli kyll&auml; monessa mieless&auml; onnistuneempi, suurempi ja parempi kuin aikaisemmat Saku-tapahtumat, mutta Petro Tyschtschenkon vierailun peruuntuminen, Jim Collasin ero ja Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vanhan hallituksen selv&auml; taisteluv&auml;symys maalasivat mielialoja selv&auml;sti edellisvuotta tummemmilla s&auml;vyill&auml;. Vuoden aikana oli my&ouml;s v&auml;hemm&auml;n merkitt&auml;vi&auml; tapahtumia ja tapauksia kuin vuonna 1998.
						<p>Vuoteen 2000 l&auml;hdettiinkin aika ristiriitaisissa merkeiss&auml;. Syksyll&auml; 1999 yhdistyksen ruoriin oli tarttunut uusi hallitus, johon oli valittu aivan uusia henkil&ouml;it&auml; viem&auml;&auml;n hankkeita eteenp&auml;in, mutta avainteht&auml;v&auml;t olivat edelleen vanhasta hallituksesta jatkaneiden k&auml;siss&auml;. Webmasterointi takerteli pahasti, eiv&auml;tk&auml; yhdistyksen perustoiminnot olleet sen paremmassa jamassa kuin ne olivat vanhankaan hallituksen lopetellessa. T&auml;m&auml; johtui paljolti siit&auml;, ett&auml; ne oli - j&auml;lkiviisaasti - pakon edess&auml; jouduttu j&auml;tt&auml;m&auml;&auml;n sellaisten ihmisten harteille, jotka olisivat ansainneet jo aikaa sitten &quot;el&auml;kkeelle&quot;.</p>
						<p>Pikkujoulut 1999 olivat hauska kavereiden tapaaminen, mutta monien vanhojen partojen puheissa oli selv&auml;sti havaittavissa kiinnostuksen haalenemista. Kun oli paahdettu viimeiset kolme vuotta t&auml;ysill&auml; Gatewayn Amiga-suunnitelmien ajamina, oli kokolailla pys&auml;ytt&auml;v&auml; kokemus n&auml;hd&auml; Amigan tulevaisuuden kuihtuvan kokoon silmien edess&auml;. Toisaalta hallitukseen oli valittu uusia ihmisi&auml;, joilla oli uusia ideoita ja intoa, Amiga OS 3.5 tuli sittenkin ja pian pikkujoulujen j&auml;lkeen Bill McEwen ja Fleecy Moss ilmoittivat ostaneensa Amigan. Vuosi 2000 alkoi monella tapaa uudistumisen merkeiss&auml;.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Saku-lehti uudistuu</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Samalla kun Amiga vaihtoi j&auml;lleen kerran omistajaa ja ensimm&auml;isi&auml; uutisia uudelta omistajalta alkoi tihkua, my&ouml;s Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n pitk&auml;ik&auml;inen &auml;&auml;nenkannattaja sai uudet kuoret. Uuden hallituksen j&auml;sen Terho Henriksson uudisti Saku-lehden web-painoksen kertaheitolla. Lehti sai ammattimaisemman ilmeen ja samalla web-painokselle pedattiin paikkaa Saku-lehden keulakuvana pitk&auml;&auml;n suosionsa huipulla keikkuneen disketti-Sakun tilalle.
						<center>
							<p><img height="228" width="350" src="kuvat/vuosi2000_1.jpg" border="0" alt=" "></p>
						</center>
						<p>Saku-lehden uudistus otettiin kiitoksella vastaan, ja uudistunutta Saku-lehte&auml; ehdittiinkin julkaista vuoden aikana nelj&auml;n numeron verran. Samalla web-lehden toimittaminen keskitettiin p&auml;&auml;toimittaja Anu Seiloselle. Pient&auml; hienos&auml;&auml;t&ouml;&auml; lehden ulkoasuun tehtiin jokaisessa numerossa, mutta kokonaisuutena uudistus onnistui laakista mainiosti, mist&auml; suuri kiitos Anulle ja Terholle. Pikkulinnut tosin laulavat, ett&auml; Terholla olisi jo roppakaupalla uusia ideoita lehden ulkoasun varalle... Kiitos my&ouml;s Risto M&auml;ki-Pet&auml;ykselle avusta web-lehden siirtym&auml;vaiheessa.</p>
						<p>Lehtiuudistus onnistui jopa niin hyvin, ett&auml; viimein uskallettiin ottaa pitk&auml;&auml;n keskusteltu askel tuntemattomaan: disketti-Sakusta luovutaan kokonaan t&auml;m&auml;n Saku-lehden numeron my&ouml;t&auml;, eli viimeiseksi alkuper&auml;isess&auml; levykeformaatissa julkaistuksi Sakuksi j&auml;i #34 (4/2000). Samalla luovuttiin yhdistyksen j&auml;senten kotiinkantomahdollisuudesta - lehden mahduttaminen levykkeille ei en&auml;&auml; onnistu k&auml;tev&auml;sti, ja palvelulla oli muutenkin vain v&auml;h&auml;n k&auml;ytt&auml;ji&auml;. Tarkempia perusteluita p&auml;&auml;t&ouml;kselle sopii lukea lokakuun Sakusta, mutta yksi hyv&auml; syy l&ouml;ytyy nykyisin Saku-lehden kannesta.</p>
						<p>Lehden etusivulle tuotiin nimitt&auml;in vuonna 2000 kunnioitusta her&auml;tt&auml;v&auml; vuosikertanumero. Harva lienee ajatellut, ett&auml; vapaaehtoisvoimin kasattu Saku-lehtemme ehti vuoden 2000 my&ouml;t&auml; jo kahdeksannelle(!) julkaisuvuodelleen. Olikin jo aika p&auml;&auml;st&auml;&auml; melkein kahdeksan vuotta meit&auml; palvellut levykemedia el&auml;kkeelle ja keskitty&auml; tulevaisuuden mahdollisuuksiin. AmigaGuide-Sakuhan oli jo lopetettu vuoden 1999 p&auml;&auml;tteeksi. Siirtym&auml;ajan pituudesta voidaan olla monta mielt&auml;, mutta nyt nuo ratkaisevat askeleet on viimein huolella otettu, ja voimme keskitty&auml; rakentamaan yht&auml;, entist&auml; rikkaampaa Saku-kokemusta!</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Hallitus hakee muotoaan</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vuoden 2000 alussa k&auml;vi ilmeiseksi, ettei vanhasta hallituksesta jatkaneilla j&auml;senill&auml; en&auml;&auml; ymm&auml;rrett&auml;v&auml;sti ollut paljoakaan aikaa tai intoa yhdistyksen asioihin. Hallituksen kokoonpano kun oli s&auml;ilynyt melko lailla samana vuodesta 1997, ja tuona aikana yhdistys oli viett&auml;nyt historiansa tapahtumarikkaimmat vuodet. Webmasterointi siirrettiin maaliskuussa pois Janne Sir&eacute;nin teht&auml;vi&auml; syksyll&auml; 1999 jatkaneelta Janne Pikkaraiselta, ja uudella innolla hommaan ryhtyi uuden hallituksen yleismiehen rooliin noussut Jarmo Piippo.
						<p>Yhdistyksen taloudenhoidosta sen perustamisesta saakka vastannut puheenjohtaja Tomi Jaskari ei h&auml;nk&auml;&auml;n en&auml;&auml; ehtinyt huolehtimaan teht&auml;vist&auml;&auml;n, joten kev&auml;&auml;ll&auml; yhdistyksen kirjanpidon tarjoutui viimeistelem&auml;&auml;n Janne Sir&eacute;n keskener&auml;isten vuosien osalta. Jarmo Piippo lupautui jatkamaan Jannen ty&ouml;t&auml; nykyisten ja tulevien tilikausien osalta, jahka vanhat r&auml;stikaudet on saatu s&auml;&auml;nt&ouml;jen ja lain vaatimaan kuntoon. Mittava ty&ouml; onkin edennyt hyvin, Jannen ottama urakka eli kirjanpito tilikausilta 1994-1999 on viimein tilinp&auml;&auml;t&ouml;ksi&auml; ja -tarkastuksia vaille valmis, ja olemme edelleen toiveikkaita, ett&auml; saavutamme vaaditun kirjanpitorytmin vuonna 2001.</p>
						<p>Anu Seilonen jatkoi l&auml;pi vuoden hyv&auml;&auml; ty&ouml;t&auml;&auml;n Saku-lehden parissa, mutta otti selv&auml;sti aktiivisemman roolin my&ouml;s hallituksessa, jossa h&auml;n ei aikaisemmin ollut ollut. Anu profiloituikin siin&auml; m&auml;&auml;rin yhdistyksen keulakuvaksi, ett&auml; h&auml;net valittiin vuoden 2000 vuosikokouksessa yhdistyksen puheenjohtajaksi. Yhdistyksen perustamisesta l&auml;htien puheenjohtajan teht&auml;vi&auml; hoitanut Tomi Jaskari jatkaa edelleen hallituksen j&auml;senen&auml;, mutta viimeisi&auml;kin avainteht&auml;vi&auml; ollaan h&auml;nelt&auml; siirt&auml;m&auml;ss&auml; uusiin k&auml;siin entist&auml; tehokkaamman yhdistysrakenteen saavuttamiseksi. Tomille kiitos pitk&auml;st&auml; ty&ouml;st&auml;!</p>
						<p>Yhdistyksen uudeksi varapuheenjohtajaksi nousi vuoden 2000 vuosikokouksessa Terho Henriksson, joka oli ansainnut kannuksensa paitsi Saku-lehden uudistajana, my&ouml;s seuraavan Saku-tapahtuman ahkerana puuhaajana ja tapahtumavastaavana. Vuoden verran varapuheenjohtajan titteli&auml; kantanut Janne Pikkarainen ei teht&auml;v&auml;&auml;ns&auml; ollut ehtinyt paneutua, mik&auml; yhdess&auml; puheenjohtaja Tomi Jaskarin kiireisyyden kanssa aiheutti ongelman: yhdistyksen pj ja vpj kun ovat ratkaisevan t&auml;rke&auml;ss&auml; asemassa esimerkiksi kokousten p&auml;&auml;t&ouml;svaltaisuuden suhteen. Jatkoa ajatellen uudet pj ja vpj valittiinkin hallituksen aktiivij&auml;senist&auml; ja lis&auml;ksi eri puolilta Suomea maantieteellisten ongelmien minimoimiseksi. Uuden hallituskokoonpanon aktiivitrion t&auml;ydensi sihteeri Jarmo Piippo.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Vuosikokous 2000 - uusi alku</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Syyskuun lopulla Espoossa j&auml;rjestetyst&auml; vuosikokouksesta 2000 muodostui, kuten edell&auml; kuvailluista hallitusuudistuksistakin voi p&auml;&auml;tell&auml;, melkoinen siivoustalkoo, mik&auml; tuntuu olevan koko vuoden toiminnalle melko leimallista. Hallituksesta p&auml;&auml;stettiin vanhoja aktiivij&auml;seni&auml; el&auml;kkeelle ja uusia tekij&ouml;it&auml; nimettiin avainrooleihin. Disketti-Sakusta ja kotiinkannosta luopuminen vahvistettiin viimein vuosien p&auml;hk&auml;ilyn j&auml;lkeen, ja hallituksen j&auml;senm&auml;&auml;r&auml;kin muutettiin joustavammaksi, jotta v&auml;ltytt&auml;isiin jatkossa paremmin v&auml;kin&auml;isilt&auml; j&auml;senvalinnoilta.
						<center>
							<p><img height="262" width="350" src="kuvat/vuosi2000_2.jpg" border="0" alt=" "></p>
						</center>
						<p>Vuosikokouksessa esitettiin Janne Sir&eacute;nin raportti pitk&auml;&auml;n r&auml;stiss&auml; olleen kirjanpidon Edistymisest&auml;, ja t&auml;m&auml;kin riippakivi uskotaan saatavan valmiiksi seuraavan vuoden aikana. Samalla p&auml;&auml;tettiin koko joukosta s&auml;&auml;nt&ouml;muutoksia, joilla saadaan yhdistyksen s&auml;&auml;nn&ouml;ist&auml; ja aikaisempien kokousten p&auml;&auml;t&ouml;ksist&auml; karistettua turhat historialliset j&auml;&auml;nteet.</p>
						<p>P&ouml;yt&auml;&auml; puhdistettiin poistamalla s&auml;&auml;nn&ouml;ist&auml; spesifiset Fidonet- ja Internet-maininnat, aikanaan avoimeksi j&auml;tetty yhdistyksen logoasia suljettiin toteamalla nykyisen sammakkologon vakiintuneen k&auml;ytt&ouml;&ouml;n sek&auml; purettiin vuosikokouksen 1995 p&auml;&auml;t&ouml;s tukij&auml;senluokasta, jota ei koskaan k&auml;yt&auml;nn&ouml;ss&auml; ollut k&auml;ytetty. Lis&auml;ksi p&auml;&auml;tettiin lis&auml;t&auml; s&auml;&auml;nt&ouml;ihin maininta yhdistyksest&auml; eroamisesta nykyist&auml; k&auml;yt&auml;nt&ouml;&auml; vastaavasti ja p&auml;&auml;tettiin hakea yhdistykselle nykyist&auml; edullisempi pankkitiliratkaisu.</p>
						<p>S&auml;&auml;nt&ouml;uudistuksen toteuttaminen on viel&auml; vuoden vaihtuessa kesken, mutta uusi hallitus on jo ottanut merkitt&auml;vi&auml; askeleita sen eteen. Toivoa sopiikin, ett&auml; vuoden 2001 vuosikokoukseen menness&auml; yhdistyksen historiallinen painolasti on saatu tiputettua minimiin, ja menneisyyden haamujen tilalla on en&auml;&auml; hyvi&auml; muistoja. Onnistunut siirtyminen hallituksesta toiseen on osoittautunut ty&ouml;l&auml;&auml;ksi mutta samalla hedelm&auml;lliseksi mahdollisuudeksi korjata niit&auml; asioita, jotka ovat pitk&auml;&auml;n olleet korjaamatta.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Muutakin ehdittiin tehd&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Yhdistystoiminnan peruskorjauksen lis&auml;ksi ehdittiin vuoden 2000 aikana luoda my&ouml;s ensimm&auml;isi&auml; silm&auml;yksi&auml; uuden Amigan ty&ouml;n tuloksiin. Vuosikokouksessa 2000 oli kokeiltavana Amiga Software Development Kit 1.0. Kokouksessa oli mukana my&ouml;s j&auml;lleenmyyj&auml; Gentle Eye Ky viimeisimpine Amiga-tuotteineen.
						<center>
							<p><img height="292" width="350" src="kuvat/vuosi2000_3.jpg" border="0" alt=" "></p>
						</center>
						<p>Lis&auml;ksi loppuvuoden ajan yhdistyksen kotisivuilla esiteltiin joka viikko nk. viikon namupalana uusi Amiga SDK:lla tehty ohjelma. Namupaloja julkaistiin yhteens&auml; 13, ja ne l&ouml;ytyv&auml;t sivuiltamme vuoden lopulla uudistuneesta osoitteesta: <a href="http://batman.jypoly.fi/~saku" target="_blank">http://batman.jypoly.fi/~saku</a></p>
						<center>
							<p><img height="331" width="350" src="kuvat/vuosi2000_4.jpg" border="0" alt=" "></p>
						</center>
						<p>My&ouml;s media kiinnitti huomiota tekemisiimme: Suomen Nuorkauppakamarin j&auml;sen- ja sidosryhm&auml;lehti Meriitti kirjoitti numerossaan 2/2000 Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toiminnasta. Lehden painos oli 6000 kappaletta ja kyseisen numeron teemana yhteisty&ouml;. Artikkelin takana oli Terho Henriksson. Syksyll&auml; Janne Sir&eacute;n kutsuttiin MTV3:n Jyrki-televisio-ohjelmaan keskustelemaan yhdistyksest&auml;, Amigan nykytilasta ja tulevaisuudesta.</p>
						<p>Saku-CD-ROMin kakkospainoksen j&auml;ljelle j&auml;&auml;neit&auml; romppuja myytiin sek&auml; vuosikokouksessa ett&auml; postimyyntin&auml;. Lis&auml;ksi yhdistyksen kotisivut saivat tunnustusta Amiga Inc.:lt&auml; Amiga Recognized User Organization -leiman muodossa, ja uusi lukijakyselykin ehdittiin j&auml;rjest&auml;&auml;.</p>
						<p>Vuoden 2000 p&auml;&auml;tteeksi valmistauduttiin p&auml;&auml;st&auml;m&auml;&auml;n viel&auml; yksi historiamme kannalta t&auml;rke&auml; henkil&ouml; el&auml;kkeelle l&auml;hett&auml;m&auml;ll&auml; alkuvuodesta 2001 Amigalta lopettavalle Petro Tyschtschenkolle hallituksen ja Suomen Amiga-k&auml;ytt&auml;jien tervehdyskirje. Kirjeeseen ker&auml;ttiin allekirjoituksia eri puolilta Suomea kierr&auml;tt&auml;m&auml;ll&auml; sit&auml; postissa nykyisten ja entisten yhdistysaktiivien kautta. Lis&auml;ksi ker&auml;ttiin tervehdyksi&auml; Internetist&auml;.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black"><b>Vilkaisu tulevaisuuteen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on t&auml;n&auml;&auml;n terveemm&auml;ll&auml; pohjalla kuin aikoihin. Tilanne on viel&auml;kin parempi, jahka yhdistysrakenteiden tukevoittaminen saadaan toivottavasti alkavan vuoden aikana p&auml;&auml;t&ouml;kseen ja voidaan keskitty&auml; varsinaisen toiminnan laajentamiseen. Toiminnan laajenemisen edellytykset riippuvat kuitenkin paljolti uuden Amigan tekemisist&auml;, sen ep&auml;onnistumisista ja onnistumisista. Me olemme valmiita, jos ja kun jotain merkitt&auml;v&auml;&auml; tapahtuu. Toisaalta jos Amiga-yhteis&ouml; jatkaa kutistumistaan, eiv&auml;t yhdistyksenk&auml;&auml;n toimintaedellytykset parane.
						<p>Yhdistys ei kuitenkaan ole aikeissa odotella tyhj&auml;n panttina tulevaisuutta, vaan suunnitelmat uusista tempauksista k&auml;yv&auml;t kuumana. Saku 2000 jouduttiin j&auml;tt&auml;m&auml;&auml;n v&auml;liin yhdistyksen taloudellisen tilanteen ja Amiga-maailman tilan vuoksi, mutta olemassa olleet suunnitelmat on siirretty Saku 2001:n pohjaksi, ja sik&auml;li kuin Amiga Inc.:n puheita on uskominen, tarjoaa vuosi 2001 tapahtumalle paljon kulunutta vuotta paremmat edellytykset. J&auml;senmaksu- ja sponsoritulojakin toivottavasti ehtii kerty&auml; tarpeeksi, jotta kunnon tapahtuma saadaan aikaiseksi. Uteliaiden kannattaa ottaa yhteytt&auml; tapahtumavastaava Terho Henrikssoniin (<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>). Muitakin tempauksia on ty&ouml;n alla mm. yhdistyksen kotisivujen ja mahdollisten kerhoiltojen osalta.</p>
						<p>Vuonna 2000 k&auml;rr&auml;ttiin roppakaupalla vanhaa romua pihalle. Nyt yhdistyksen virtuaalinen kerhohuone on viimeist&auml; silausta vaille siivottu - on meist&auml; kaikista kiinni, kuinka paljon uutta kannetaan sis&auml;&auml;n vuonna 2001... Kiitos kaikille teille, jotka valoitte uskoa, toivoa ja toimintakyky&auml; yhdistykseen vuonna 2000 ja etuk&auml;teen kiitos kaikille teille, jotka tulette viem&auml;&auml;n sit&auml; eteenp&auml;in vuonna 2001!</p>
						<center>
							<p>* * *</p>
						</center>
						<p>Yhdistyksen aikaisempien vuosien historiasta kiinnostuneiden kannattaa kurkistaa Saku-lehden numeroihin #31 (1/2000), #27 (1/99) ja #25 (2/98).</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#191970">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
