<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.</b></font></td>
				</tr>
			</table>
			</p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n &quot;tarkoituksena on edist&auml;&auml; Amiga-tietouden tuntemusta ja yll&auml;pit&auml;&auml; ja kehitt&auml;&auml; tietokoneharrastusta j&auml;sentens&auml; keskuudessa&quot;. Yhdistys aloitti ep&auml;virallisen toimintansa jo vuonna 1993 Suomen Amiga-k&auml;ytt&auml;jien unionin nimell&auml; ja varsinainen perustamiskirja allekirjoitettiin vuotta my&ouml;hemmin. Viralliseen yhdistysrekisteriin Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. hyv&auml;ksyttiin alkuvuodesta 1996.<br>
						<br>
						Yhdistys perustettiin alun perin julkaisemaan Saku-levykelehte&auml; ja yli kolmekymment&auml; julkaistua numeroa my&ouml;hemmin lehti on edelleen toiminnan keskipisteess&auml;. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on my&ouml;s j&auml;rjest&auml;nyt useita kokouksia ja tapaamisia sek&auml; kolme Saku-tapahtumaa. Lis&auml;ksi yhdistys yll&auml;pit&auml;&auml; suosittuja kotisivuja Internetiss&auml; sek&auml; omaa Fidonet-tyylist&auml; verkkoaan, Sakuneti&auml;. Toiminta rakentuu vapaaehtoisty&ouml;lle ja rahoitetaan p&auml;&auml;asiassa j&auml;senmaksuilla.</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de">
						<center>
							<font color="black"><b>J&auml;seneksi liittyminen</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;senen&auml; tuet arvokasta toimintaa maamme Amiga-markkinoiden el&auml;v&ouml;itt&auml;misess&auml;. Syyskuussa 1999 j&auml;rjestetty Saku 99 -tapahtuma on esimerkki tavasta, jolla yhdistyksen varoja voidaan k&auml;ytt&auml;&auml; yhteiseksi hyv&auml;ksi. Saat samalla &auml;&auml;nioikeuden yhdistyksen kokouksiin ja hy&ouml;dyt mahdollisista muista j&auml;seneduista. Yhdistyksen j&auml;senen&auml; voit my&ouml;s eri maksusta tilata Saku-lehden kotiin levykkeell&auml; j&auml;senvuoden ajaksi.<br>
						<br>
						Yhdistyksen j&auml;seneksi liittyminen on helppoa: Astele l&auml;himp&auml;&auml;n pankkiin, Internet-pankkipalvelun &auml;&auml;reen tai maksuautomaatille, ja maksa j&auml;senmaksu yhdistyksen pankkitilille. J&auml;senmaksu on vuosikokouksen p&auml;&auml;t&ouml;ksell&auml; vuodelle 2001 seitsem&auml;nkymment&auml; (70) markkaa tai yksitoista (11) euroa ja j&auml;senyys on voimassa kyseisen vuoden loppuun.<br>
						<br>
						Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n pankkitili:<br>
						Merita Korso 150630-100355<br>
						<br>
						Jotta j&auml;senyys astuisi voimaan, tarvitsemme my&ouml;s j&auml;senen nimen ja yhteystiedot. Kirjoita siis pankkisiirtolomakkeen viestilaatikkoon nimesi, osoitteesi ja mahdollisesti puhelinnumerosi sek&auml; s&auml;hk&ouml;postiosoitteesi. &Auml;l&auml; k&auml;yt&auml; viitenumeroa.<br>
						<br>
						Jos j&auml;sentietojen antamisessa ilmenee ep&auml;selvyyksi&auml; tai yhteystietosi muuttuvat, ota yhteytt&auml; yhdistyksen hallituksen j&auml;seneen Tomi Jaskariin. H&auml;net tavoittaa s&auml;hk&ouml;postiosoitteesta <a href="mailto:tmjj@iki.fi">tmjj@iki.fi</a> tai puhelinnumerosta 050 330 3784.<br>
						<br>
						Tervetuloa mukaan Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toimintaan!</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de">
						<center>
							<font color="black"><b>Yhteystiedot</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Pankkitili: Merita Korso 150630-100355<br>
						<br>
						Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. Internetiss&auml;:<br>
						<a href="http://batman.jypoly.fi/~saku/" target="_top">http://batman.jypoly.fi/~saku/</a><br>
						<a href="http://tzimmola.tky.hut.fi/saku/" target="_top">http://tzimmola.tky.hut.fi/saku/</a><br>
						<br>
						Anu Seilonen, puheenjohtaja ja Saku-lehden p&auml;&auml;toimittaja - <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
						<br>
						Terho Henriksson, varapuheenjohtaja, tapahtuma- ja mediavastaava - <a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net<br>
						</a><br>
						Jarmo Piippo, sihteeri - <a href="mailto:jarmopiippo@yahoo.com">jarmopiippo@yahoo.com</a><br>
						<br>
						Saku-lehden kotipurkki ja Sakunet-verkon keskus:<br>
						Amiga Zone BBS, 65:10/1.0@sakunet, (015) 348 968, auki 24h<br>
						<br>
						<b>Puheenjohtaja:</b><br>
						Anu Seilonen<br>
						Sammaltie 51<br>
						90650 Oulu<br>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font face="Trebuchet MS,Verdana,Arial,Helvetica">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de">
						<center>
							<font color="black"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n s&auml;&auml;nn&ouml;t</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table>
							<tr>
								<td valign="top"><b>1&sect;</b></td>
								<td><b>NIMI JA KOTIPAIKKA</b>
									<p>Yhdistyksen nimi on Suomen Amiga-k&auml;ytt&auml;j&auml;t ja kotipaikka on Vantaa.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>2&sect;</b></td>
								<td><b>TARKOITUS JA TOIMINTA</b>
									<p>Yhdistyksen tarkoituksena on edist&auml;&auml; Amiga-tietouden tuntemusta ja yll&auml;pit&auml;&auml; ja kehitt&auml;&auml; tietokoneharrastusta j&auml;sentens&auml; keskuudessa.</p>
									<p>Tarkoituksen toteuttamiseksi yhdistys julkaisee lehte&auml;, jonka ilmestymistiheydest&auml; p&auml;&auml;tt&auml;&auml; vuosikokous, sek&auml; j&auml;rjest&auml;&auml; koulutusta, retki&auml; ja juhlia.</p>
									<p>Toimintansa tukemiseksi yhdistys julkaisee mainoksia, ker&auml;&auml; j&auml;senmaksuja, j&auml;rjest&auml;&auml; myyj&auml;isi&auml; ja arpajaisia ja ottaa vastaan lahjoituksia ja testamentteja.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>3&sect;</b></td>
								<td><b>J&Auml;SENET</b>
									<p>Yhdistyksen j&auml;seneksi voi liitty&auml; kuka tahansa tietokoneharrastaja. Yhdistyksen j&auml;senet hyv&auml;ksyy hallitus.</p>
									<p>J&auml;senell&auml; on oikeus erota yhdistyksest&auml; ilmoittamalla siit&auml; kirjallisesti hallitukselle tai sen puheenjohtajalle taikka ilmoittamalla eroamisesta yhdistyksen kokouksessa.</p>
									<p>J&auml;senilt&auml; peritt&auml;v&auml;n liittymis- ja vuotuisen j&auml;senmaksun suuruudesta p&auml;&auml;tt&auml;&auml; vuosikokous.</p>
									<p>J&auml;senten yhteystietoja voidaan k&auml;ytt&auml;&auml; suoramarkkinointitarkoituksiin henkil&ouml;rekisterilain mukaisesti.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>4&sect;</b></td>
								<td><b>HALLITUS</b>
									<p>Yhdistyksen asioita hoitaa hallitus, johon kuuluu vuosikokouksessa valitut puheenjohtaja ja 4 muuta varsinaista sek&auml; 5 varaj&auml;sent&auml;.</p>
									<p>Hallituksen j&auml;senten toimikausi on vuosikokousten v&auml;linen aika.</p>
									<p>Hallitus valitsee keskuudestaan varapuheenjohtajan sek&auml; ottaa sihteerin, rahastonhoitajan ja muut tarvittavat toimihenkil&ouml;t.</p>
									<p>Hallitus kokoontuu puheenjohtajan tai h&auml;nen estyneen&auml; ollessaan varapuheenjohtajan kutsusta, kun he katsovat siihen olevan aihetta tai kun v&auml;hint&auml;&auml;n 2 hallituksen j&auml;sent&auml; sit&auml; vaatii.</p>
									<p>Hallitus on p&auml;&auml;t&ouml;svaltainen, kun v&auml;hint&auml;&auml;n kolme sen j&auml;sent&auml;, puheenjohtaja tai varapuheenjohtaja mukaanluettuna on l&auml;sn&auml;. Asiat ratkaistaan yksinkertaisella &auml;&auml;ntenenemmist&ouml;ll&auml;. &Auml;&auml;nten menness&auml; tasan ratkaisee puheenjohtajan mielipide, vaaleissa kuitenkin arpa.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>5&sect;</b></td>
								<td><b>YHDISTYKSEN NIMEN KIRJOITTAMINEN</b>
									<p>Yhdistyksen nimen kirjoittavat puheenjohtaja, varapuheenjohtaja, sihteeri tai henkil&ouml;, jolla on siihen hallituksen erikseen antama henkil&ouml;kohtainen oikeus; kukin yksin.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>6&sect;</b></td>
								<td><b>TILIT</b>
									<p>Yhdistyksen tilikausi on 1.7. - 31.6.</p>
									<p>Tilinp&auml;&auml;t&ouml;s tarvittavine asiakirjoineen ja hallituksen vuosikertomus on annettava tilintarkastajille viimeist&auml;&auml;n kolme viikkoa ennen vuosikokousta. Tilintarkastajien tulee antaa kirjallinen lausuntonsa hallitukselle viimeist&auml;&auml;n kaksi viikkoa ennen vuosikokousta.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>7&sect;</b></td>
								<td><b>YHDISTYKSEN KOKOUSTEN KOOLLEKUTSUMINEN</b>
									<p>Yhdistyksen kokoukset kutsuu koolle hallitus. Kokouskutsu on toimitettava viimeist&auml;&auml;n seitsem&auml;n (7) p&auml;iv&auml;&auml; ennen kokousta l&auml;hett&auml;m&auml;ll&auml; kutsu s&auml;hk&ouml;postina tai kirjeen&auml; kullekin j&auml;senelle. J&auml;sen saa itse valita kumpaa tapaa h&auml;n haluaa k&auml;ytett&auml;v&auml;ksi.</p>
									<p>Jos mahdollista koollekutsu julkaistaan my&ouml;s soveliaalla Fidonetin viestialueella kuten sf.amiga.saku sek&auml; Internetiss&auml; - esimerkiksi uutisryhm&auml;ss&auml; <a href="news:sfnet.atk.amiga">sfnet.atk.amiga</a>.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>8&sect;</b></td>
								<td><b>YHDISTYKSEN KOKOUKSET</b>
									<p>Yhdistyksen vuosikokous pidet&auml;&auml;n vuosittain hallituksen m&auml;&auml;r&auml;&auml;m&auml;n&auml; p&auml;iv&auml;n&auml; hein&auml;-syyskuun aikana.</p>
									<p>Ylim&auml;&auml;r&auml;inen kokous pidet&auml;&auml;n, kun yhdistyksen kokous niin p&auml;&auml;tt&auml;&auml; tai kun hallitus katsoo siihen olevan aihetta tai kun v&auml;hint&auml;&auml;n yksi kymmenesosa (1/10) yhdistyksen &auml;&auml;nioikeutetuista j&auml;senist&auml; sit&auml; hallitukselta erityisesti ilmoitettua asiaa varten kirjallisesti vaatii.</p>
									<p>Yhdistyksen kokouksessa on jokaisella 12 vuotta t&auml;ytt&auml;neell&auml; j&auml;senell&auml; &auml;&auml;nioikeus ja jokaisella &auml;&auml;nioikeutetulla yksi (1) &auml;&auml;ni.</p>
									<p>Yhdistyksen p&auml;&auml;t&ouml;kseksi tulee, ellei s&auml;&auml;nn&ouml;iss&auml; ole toisin m&auml;&auml;r&auml;tty se mielipide, jota on kannattanut yli puolet annetuista &auml;&auml;nist&auml;. &Auml;&auml;nten menness&auml; tasan ratkaistaan vaalit arvalla. Muutoin p&auml;&auml;t&ouml;kseksi tulee kokouksen puheenjohtajan kannattama mielipide.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>9&sect;</b></td>
								<td><b>VUOSIKOKOUS</b>
									<p>Yhdistyksen vuosikokouksessa k&auml;sitell&auml;&auml;n seuraavat asiat:</p>
									<ol>
										<li>kokouksen avaus;
										<li>valitaan kokouksen puheenjohtaja, sihteeri, kaksi p&ouml;yt&auml;kirjantarkistajaa ja tarvittaessa kaksi &auml;&auml;ntenlaskijaa; todetaan kokouksen laillisuus ja p&auml;&auml;t&ouml;svaltaisuus;
										<li>hyv&auml;ksyt&auml;&auml;n kokouksen ty&ouml;j&auml;rjestys;
										<li>esitet&auml;&auml;n tilinp&auml;&auml;t&ouml;s, vuosikertomus ja tilintarkastajien lausunto;
										<li>p&auml;&auml;tet&auml;&auml;n tilinp&auml;&auml;t&ouml;ksen vahvistamisesta ja vastuuvapauden my&ouml;nt&auml;misest&auml;;
										<li>vahvistetaan toimintasuunnitelma, tulo- ja menoarvio sek&auml; liittymis- ja j&auml;senmaksun suuruus;
										<li>valitaan hallituksen puheenjohtaja ja muut j&auml;senet;
										<li>valitaan tilintarkastaja ja h&auml;nelle yksi (1) varamies, tilintarkastajan toimikausi on 1.10 - 30.9;
										<li>k&auml;sitell&auml;&auml;n muut kokouskutsussa mainitut asiat.
									</ol>
									<p>Mik&auml;li yhdistyksen j&auml;sen haluaa saada jonkin asian yhdistyksen vuosikokouksen k&auml;sitelt&auml;v&auml;ksi, on h&auml;nen siit&auml; kirjallisesti ilmoitettava niin hyviss&auml; ajoin, ett&auml; asia voidaan sis&auml;llytt&auml;&auml; kokouskutsuun.<br>
									<br>
								</td>
							</tr>
							<tr>
								<td valign="top"><b>10&sect;</b></td>
								<td><b>S&Auml;&Auml;NT&Ouml;JEN MUUTTAMINEN JA YHDISTYKSEN PURKAMINEN</b>
									<p>P&auml;&auml;t&ouml;s s&auml;&auml;nt&ouml;jen muuttamisesta ja yhdistyksen purkamisesta on teht&auml;v&auml; yhdistyksen kokouksessa v&auml;hint&auml;&auml;n kolmen nelj&auml;sosan (3/4) enemmist&ouml;ll&auml; &auml;&auml;nestyksess&auml; annetuista &auml;&auml;nist&auml;. Kokouskutsussa on mainittava s&auml;&auml;nt&ouml;jen muuttamisesta tai yhdistyksen purkamisesta.</p>
									<p>Yhdistyksen purkautuessa k&auml;ytet&auml;&auml;n yhdistyksen varat hyv&auml;ntekev&auml;isyyteen purkamisesta p&auml;&auml;tt&auml;v&auml;n kokouksen m&auml;&auml;r&auml;&auml;m&auml;ll&auml; tavalla. Yhdistyksen tullessa lakkautetuksi menetell&auml;&auml;n samoin.</td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
			</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
