<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - &quot;Warp 7&quot; / Heyne</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<P><CENTER><H1><U>Warp 7 / Heyne</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.in-brb.de">Gregor Franz</A></CENTER></P>
<P>Der <B>Heyne-Verlag</B> startet eine neue l&ouml;bliche Initiative, um Science Fiction-
B&uuml;cher unters Volk zu bringen.</P>
<P>In speziellen Papp-Anrichten ist in gutsortierten Buchhandlungen die neue
Buchreihe <B>&quot;Warp 7&quot;</B> zu finden, die ausgesuchte Einzelausgaben der `normalen`
SF-Reihe beinhaltet.</P>
<P>Neue, sehr ansprechende Cover und g&uuml;nstige Preise sollen zum Kauf animieren.
Und tats&auml;chlich sollte f&uuml;r jeden etwas dabei sein, da das Spektrum
breitgef&auml;chert ist.</P>
<P>Die Preise liegen einige Mark unter denen der &Auml;quivalente aus der
Standard-SF-Reihe und bewegen sich zwischen ca. 10 bis 12 DM. Einige Romane waren
au&szlig;erdem vorher bereits vergriffen und sind nicht neu aufgelegt worden.</P>
<P>Somit sind also tats&auml;chlich Schn&auml;ppchen m&ouml;glich.</P>
<P>Namhafte Autoren, wie <B>Ray Bradbury, Alan Dean Foster, Harry Harrison
Frank Herbert, Jack Vance, James White</B> und einige mehr, wecken Interesse.</P>
<P>Ganz besonders m&ouml;chte ich auf die ersten beiden B&auml;nde des <B>Barrayar-Zyklus</B>
von <B>Lois McMaster-Bujold</B> hinweisen (&quot;Scherben der Ehre&quot; und &quot;Barrayar&quot;),
die zum Besten geh&ouml;ren, was mir in den letzten Jahren unter die Augen kam.</P>
<P>Nicht umsonst hat die Autorin f&uuml;r die Reihe mehrere Hugos gewonnen,
den sicherlich ber&uuml;hmtesten SF-Preis. Obwohl sie gerade in den n&auml;chsten
B&auml;nden zu H&ouml;chstform aufl&auml;uft, sollte man diesen Einstieg nicht verpassen.</P>
<P>Zu bemerken ist das gr&ouml;&szlig;ere Engagement, die bessere Sorgfalt, gegen&uuml;ber
der letzten &auml;hnlichen Aktion, aus Anla&szlig; des Heyne-SF-Jubil&auml;ums, wo ein
paar der gutgehendsten SF-Romane, mit hinter dem Komma nach unten
abgerundeten Preisen und etwas schlechterer Papierqualit&auml;t, als
Jubil&auml;ums-Edition angeboten wurden.</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9709circ.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0997/wanted.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

