<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - &quot;Morning Light&quot; / Locust</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<P><CENTER><H1><U>Morning Light / Locust</U></H1><BR>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></CENTER></P>
<P><B>&quot;Morning Light&quot;</B> ist der Titel des aktuellen <B>Locust</B>-Albums.</P>
<P>Was die Band mit dieser Scheibe pr&auml;sentiert, l&auml;&szlig;t sich wohl am besten als
sinnlichen TripHop bezeichnen. Dabei kn&uuml;pfen Locust aber nicht einfach nur
an die Tradition von Gr&ouml;&szlig;en wie Massive Attack, Tricky, Sneaker Pimps und
Olive an, sondern finden ihren eignen Weg, der jeden Track der CD zu einem
unverkennbaren Locust-Song macht und trotzdem gen&uuml;gend Experimentierfreude
und Abwechslung parat h&auml;lt, da&szlig; kein Song wie der andere klingt.</P>
<P>Daf&uuml;r sorgt nicht zuletzt die vielseitige Instrumentalisation, in die
neben den &uuml;blichen Kl&auml;ngen wie Gitarre, Piano, Synthi und B&auml;ssen auch so
eher au&szlig;ergew&ouml;hnliche wie Xylophon, Orgel, Fl&ouml;te und Trompete einflie&szlig;en.</P>
<P>Denkt man bei den ersten T&ouml;nen von <B>&quot;Your selfish Ways&quot;</B> noch an den
aktuellen Lewis-Hit <B>&quot;Underwater Love&quot;</B>, so mu&szlig; man bald darauf einsehen,
da&szlig; man es hier mit etwas anderem zu tun hat. Schnell kommt man auch zu
dem Schlu&szlig;, da&szlig; dies sich nicht im geringsten vor der Konkurrenz zu
verstecken braucht. Somit besteht auch eine gute Chance, da&szlig; man einige der
Titel, wie <B>&quot;One way or another&quot;</B> oder <B>&quot;No-One in the World&quot;</B>, bald aus den
Lautsprechern seines Radios zu h&ouml;ren bekommen wird.</P>
<P>Zwischen den mit Gesang bereicherten Songs, denen verschiedene S&auml;ngerinnen
und S&auml;nger ihre einf&uuml;hlsamen und berauschenden Stimmen verliehen haben,
findet man verschiedene kleine Instrumentalst&uuml;cke, die sie harmonisch
verbinden. Dadurch entsteht ein in 16 Tracks gegliedertes Gesamtwerk von
63:29 Minuten Spieldauer <A HREF="#Footnote">(*)</A>.
<P>K&auml;uflich erwerben kann man die CD f&uuml;r einen Standard-Preis von ca. 30,-DM.
Ist man nach einem evt. Probeh&ouml;ren bereit, diese zu investieren, so erh&auml;lt
man ein farbloses Plastcover mit blauer Einlage. Das ebenfalls blaue
Booklet, welches seitenweise poetische Songtexte bereith&auml;lt, schm&uuml;ckt sich
auf der Vorderseite mit einem etwas ungew&ouml;hnlichen Foto, das aber dieselbe
Ausgewogenheit ausstrahlt, wie die Musik, die sich im innern des Covers
verbirgt.</P>
<P>Au&szlig;erdem wird ein Teil der CD's als <B>Limited Edition</B> gepre&szlig;t, die sich im
Pappklappcover pr&auml;sentiert und einen zus&auml;tzlichen &quot;Ghost-Track&quot; bereit
h&auml;lt.</P>
<P><B>Quintessenz:</B></P>
<P>F&uuml;r Fans sanften und melodischen TripHops ist diese Scheibe schon fast ein
Mu&szlig;, f&uuml;r Freunde schwerm&uuml;tiger Kl&auml;nge ebenfalls. Mit Sicherheit ist sie
eine Bereicherung f&uuml;r das Genre und es bleibt zu hoffen, da&szlig; Locust damit
ihre Linie gefunden haben.</P>
<P><A NAME="Footnote">(*)</A> Es handelt sich um die Spieldauer der Limited Edition. Die
Normalversion d&uuml;rfte etwa 4 Minuten k&uuml;rzer sein.</P>
<P>&quot;Morning Light&quot; von Locust, R & S Records, ca. 30 DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0997/mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../mmx/9709circ.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

