<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Neues Jahr - neues Gl&uuml;ck? (von Carsten Schr&ouml;der)

Zugegeben, etwas zweckentfremdet habe ich den bekannten Ausspruch schon,
aber glich das Hoffen und Bangen mit (dem) Amiga in den letzten Jahren
nicht wirklich einem Gl&uuml;cksspiel?
Nun ist also ein weiteres Jahr angebrochen, in dem angeblich alles besser
werden soll. Diverse Hard- und Softwareprojekte, welche dem Amiga neues
Leben einhauchen sollen, befinden sich in Entwicklung. Aber werden diese -
sofern sie &uuml;berhaupt erscheinen (wir wissen ja, dass das l&auml;ngst nicht bei
jeder Ank&uuml;ndigung im Amiga-Bereich der Fall ist) - auch das halten, was
sich die Anwender erhoffen?

Das h&auml;ngt allein von deren Realismus ab. User, die meinen, die
Ver&ouml;ffentlichung von AmigaOS 4.0 bzw. MorphOS und AmigaOne bzw. Pegasos
werde dazu f&uuml;hren, dass viele neue (und alte) Amiga-Anh&auml;nger
(wieder)gewonnen werden, sollten sich schon jetzt von dieser Illusion
l&ouml;sen. Dies w&uuml;rde h&ouml;chstens in so geringem Umfang passieren, dass es f&uuml;r
einen Fortbestand des Amiga v&ouml;llig unerheblich w&auml;re. Denn beiden Gruppen
k&ouml;nnten die Amiga-Entwicklungen nichts bieten, was sie nicht schon h&auml;tten,
im Gegenteil: Das Problem fehlender konkurrenzf&auml;higer Anwendersoftware und
Spiele w&auml;re damit ja l&auml;ngst nicht vom Tisch. Dieses Manko ist heutzutage
nur zu beseitigen, wenn ein neues oder neu zu etablierendes Betriebssystem
auf den Massenmarkt abzielt und auf diese Weise mittelfristig weltweit
einen nennenswerten Marktanteil im Desktop-Computer-Bereich erringt (nach
meiner Sch&auml;tzung mindestens etwa ein bis zwei Prozent), was derzeit bei
Verwendung einer PPC-Hardware nicht realistisch ist.

Denn ausgerechnet diejenigen Computeranwender au&szlig;erhalb des Amiga-Bereichs,
die am ehesten bereit w&auml;ren, sich einen neuen PPC-Rechner zuzulegen, die
Apple-User, fallen als m&ouml;gliche Zielgruppe schon einmal fast komplett weg.
Die Mac-Gemeinde setzt sich vereinfacht dargestellt aus zwei Gruppen
zusammen: Die einen benutzen ihren Rechner vor allem als Arbeitsger&auml;t und
werden schon deshalb nicht auf einen PPC-Amiga umsteigen k&ouml;nnen, weil
schlichtweg die von ihnen ben&ouml;tigte Software nicht zur Verf&uuml;gung stehen
wird. Die andere Gruppe sind die sogenannten Mac-Fans. Warum sie nicht auf
den Amiga umsatteln werden, liegt auf der Hand: Sie lieben, &auml;hnlich wie die
Amiga-User, ihr Betriebssystem und f&uuml;hlen sich ihrer "Community" zugeh&ouml;rig
- ein Wechsel k&auml;me f&uuml;r sie einem Verrat gleich.

Diese beiden Nutzergruppen findet man auch bei anderen Betriebssystemen.
Lediglich im Windows-Bereich gibt es daneben noch eine dritte User-Schicht:
Die der sprichw&ouml;rtlichen Heimanwender ohne feste Bindung zu ihrem
Betriebssystem, welche sich auch mit Einschr&auml;nkungen bez&uuml;glich der
Softwareauswahl und -qualit&auml;t zufrieden geben w&uuml;rden, wenn sie daf&uuml;r ein
Betriebssystem der Spitzenklasse nutzen k&ouml;nnten, das vor allem sehr einfach
zu handhaben sein muss, damit selbst absolute Computerlaien keine
Bedienungsschwierigkeiten haben. Jedoch ist gerade diese potenzielle
K&auml;ufergruppe - ebenso wie die extrem wichtige Masse der Noch-Nicht-
Computerbenutzer - ganz &uuml;berwiegend nicht bereit, mehr Geld f&uuml;r einen
Rechner auszugeben als absolut notwendig, so dass f&uuml;r sie ein teures PPC-
Ger&auml;t nicht in Frage kommt.

&Uuml;brigens: Der beste Beweis, weshalb ein PPC-basierendes Betriebssystem sich
nicht etablieren kann, zeigt das Beispiel Linux. Dieses existiert f&uuml;r eine
Vielzahl von Prozessoren, darunter auch x86- und PPC-CPUs. Nun ist es
jedoch so, dass dieses OS auf x86-Hardware durchaus mit dem Macintosh um
Platz 2 auf dem Computermarkt konkurriert, w&auml;hrend sich die PPC-Versionen
der Linux-Distributionen am Rand der Bedeutungslosigkeit befinden. Dasselbe
Schicksal w&uuml;rde jedes Betriebssystem treffen, das ausschlie&szlig;lich f&uuml;r PPC-
Rechner erscheint. Dass Linux heutzutage in aller Munde ist, verdankt es
ausschlie&szlig;lich seiner Plattformunabh&auml;ngigkeit bzw. konkret der dadurch
erm&ouml;glichten Unterst&uuml;tzung der x86-Prozessorreihe.

Was aber k&ouml;nnen die Anwender von einem "PPC-Amiga" erwarten? Nun, immerhin
eine deutliche Geschwindigkeitssteigerung im Vergleich zu den aktuellen
68k(&PPC)-Amigas. Zwar wird mangels konkurrenzf&auml;higer PPC-Prozessoren bei
weitem nicht die Performance heutiger x86-Rechner realisiert, so dass die
x86-Amiga-Emulatoren weiterhin das Nonplusultra bez&uuml;glich der Leistung von
68k-Applikationen bleiben werden, aber PPC-native Programme d&uuml;rften
durchaus eine damit vergleichbare Geschwindigkeit erreichen (sofern es
Motorola und IBM in Zukunft gelingt, das Leistungsdefizit ihrer CPUs zu den
x86-Prozessoren nicht noch weiter ausufern zu lassen).

Jedoch stellt sich die Frage, wie lange wir denn nun noch auf das
Erscheinen der Amiga-PPC-Entwicklungen warten m&uuml;ssen - ja richtig gelesen:
wir. Denn auch ich w&uuml;rde es sehr begr&uuml;&szlig;en, wenn die gemachten Ank&uuml;ndigungen
allm&auml;hlich mal auf den Markt k&auml;men - wenn auch aus einem ganz anderen Grund
als die PPC-Fanatiker (wer sich durch diese - nicht b&ouml;se gemeinte -
Bezeichnung angegriffen f&uuml;hlt, kann sich bei mir melden): Mir stinkt es
allm&auml;hlich, &uuml;ber ungelegte Eier zu diskutieren. Denn ich kann hundertmal
argumentieren, warum dieses oder jenes Projekt chancenlos ist - solange sie
nicht auf den Markt kommen, kann und wird dies jeder ihrer Anh&auml;nger
zur&uuml;ckweisen - danach aber nicht mehr, weil auch sie die Realit&auml;t nicht
einfach ignorieren k&ouml;nnen.

Und noch eines: Je schneller das (leider unabwendbare) Scheitern des PPC-
only-Weges deutlich wird, desto eher besteht die Chance, dass die Amiga-
Firmen doch noch "die Kurve kriegen" und die Weiterentwicklung von Amithlon
hin zu einem echten x86- oder gar plattformunabh&auml;ngigen OS vorantreiben.
Denn da AMIGA, Inc. nicht in der Lage zu sein scheint, das AmigaOS 5.0 in
absehbarer Zeit - wenn &uuml;berhaupt - zu realisieren, ist das meines Erachtens
die einzige (wenn auch kleine) Chance, um noch irgendetwas, das den Namen
Amiga verdient, zu retten.

&Uuml;brigens: Manche Amiga-User geben mittlerweile unumwunden zu, dass ihr PPC-
Fanatismus eine reine Glaubensfrage ist und ihrer Meinung nach "soviel
Ideologie einfach sein m&uuml;sse". Na das ist doch endlich mal ein (aus deren
Sicht) plausibles Argument!
Nun ja, ich kann nur f&uuml;r mich sprechen, aber ich lehne jede Form von
Ideologie ab (da sie meiner Ansicht nach in jeder Beziehung die Effizienz
verringert bzw. in diesem Fall die ohnehin bescheidenen Erfolgschancen
einer Amiga-Weiterentwicklung gegen Null tendieren l&auml;sst) - f&uuml;r mich ist
ein Prozessor nur ein Mittel, jedoch kein Selbstzweck. Daher d&uuml;rfte
sp&auml;testens jetzt klar sein, weshalb "unsere" Positionen schlichtweg
unvereinbar sind - und zu wissen, WARUM man nicht "miteinander kann", ist
doch schon mal ein Fortschritt, nicht wahr?


Damit bis zur n&auml;chsten Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
