<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. News

 ---------------------------------------------------------------------
 AmigaOS
 ---------------------------------------------------------------------

 "Descent Freespace: The Great War"

 Der hei&szlig; ersehnte Weltraum-Flugsimulator ist fertig und alle
 Vorbestellungen sollten bereits ausgeliefert worden sein. Wer also
 mindestens einen 68060 samt 3D-Karte (oder alternativ einen PPC auch ohne
 3D-Karte) sein Eigen nennt, darf zuschlagen. Unentschlossene k&ouml;nnen sich
 vorher nat&uuml;rlich die rund 30 MByte gro&szlig;e Demoversion ansehen, f&uuml;r die
 mittlerweile das vierte Update erschienen ist.

 [http://www.amigart.com]
 [http://www.hyperion-entertainment.de]


 "Payback"

 Erneut hat James Daniels ein Update zum Gangsterspiel "Payback"
 herausgebracht. Verbessert wurden die Fahrzeug-Texturen, es gibt nun
 eine Bestenliste im Rampage-Modus und es ist jetzt im Editor m&ouml;glich,
 den Maps Fahrzeuge hinzuzuf&uuml;gen.
 Und wo wir gerade bei Maps sind: "D-Town" und "Amigalien's
 Metropolis" sind auch in einer neuen Version erh&auml;ltlich.
 Und wer mit dem Namen "Payback" nun &uuml;berhaupt nichts anzufangen wei&szlig;,
 der findet auf den Seiten von Apex-Designs auch eine aktualisierte
 Demoversion.

 [http://www.apex-designs.net/payback.html]


 "It Came From The Desert" und "It Came From The Desert 2"

 Freunde alter Klassiker, spitzt die Ohren: Cinemaware hat als
 Weihnachtsgeschenk die Disk-Images des Spiels "It Came From The
 Desert" und dessen Nachfolger "Antheads: It Came From The Desert 2"
 zum Download ins Netz gestellt. Wer also Lust hat, 20 Fu&szlig; hohe
 Ameisen zu bek&auml;mpfen, sollte sich die gelungene Kombination aus
 Rollenspiel, Strategie und Arcade-Einlagen einmal antun.

 [http://www.cinemaware.com]


 "Quake 2"

 Darf man Quake &uuml;berhaupt ausschreiben? Wer es wei&szlig;, darf sich melden.
 Aber ob nun Q***e, Quark oder Quack: Die Entwickler haben den
 Quellcode des 3D-Shooters, dessen Engine u.a. auch von "Heretic 2"
 benutzt wird, freigegeben. Innerhalb einiger Stunden haben die Jungs
 von Hyperion (Hans-J&ouml;rg Frieden und Steffen H&auml;user) in ihrer Freizeit
 bereits erste Portierungstests erfolgreich abschlie&szlig;en k&ouml;nnen. Mit
 ein wenig Gl&uuml;ck und gutem Willen der Portierer k&ouml;nnte "Quake 2" also
 bald auch auf der Freundin laufen. Einen ersten Screenshot gibt
 es immerhin schon.

 [http://www.idsoftware.com]
 [http://www.amiga-news.de/forum/thread.php3?id=1552&BoardID=1]
 [http://www.hyperion-spftware.com/quake2.jpg]


 "PuzzleBOBS"

 Bereits in der letzten Ausgabe wurde "PuzzleBOBs", ein Spiel im Stil
 von "Bubble Heroes" oder "Bust A Move 2", kurz vorgestellt.
 Mittlerweile gibt es eine eigene Website, von der aus es auch direkt
 bestellt werden kann.

 [http://www.funtime-world.de/puzzlebobs/index.html]
 [http://www.genie.it/utenti/nexusdev]


 "Bangboo"

 Die Amiga ARENA hat den Autor des Spiel "Bangboo" dazu bewegen k&ouml;nnen,
 das Spiel freizugeben. Alle Freunde von bunten Spielemischungen aus
 den Bereichen Knobel, Geschicklichkeit und Puzzelei sollten einmal
 einen Blick darauf werfen.

 [http://online-club.de/~ARENA/]


 "B&uuml;rgermeister 2"

 Wer "Hamurabi" von C64 noch kennt, dem brauche ich gar nicht mehr
 viel zu erz&auml;hlen. Allen anderen sei gesagt, dass die Amiga ARENA es
 geschafft hat, das Keyfile f&uuml;r "B&uuml;rgermeister 2" zum Download
 freizugeben und man nun in die Rolle eines B&uuml;rgermeisters schl&uuml;pfen
 darf - wer h&auml;tte das gedacht.
 Rundenweise gilt es, seine Einwohner mit Nahrung, Infrastruktur und
 entsprechendem Wohnraum auszustatten, so dass die Stadt wachsen kann.
 Ver&auml;rgert man die B&uuml;rger, dann setzt aber auch schon einmal die
 Landflucht ein und man regiert nur noch sich alleine.

 [http://online-club.de/~ARENA/]


 "Blockhead I und II"

 Und Amiga ARENA zum dritten, denn mit "Blockhead I und II" werden uns
 wirklich kurzweilige Spiele pr&auml;sentiert. Um  den versteinerten Pete vor
 einem herunterfallenden schweren Gewicht zu bewahren, gilt es ganz im
 Stile von "Oxxonian" oder "Diamond Caves" in die Rolle von Bertie zu
 schl&uuml;pfen und Kisten an ihren Platz zu schieben oder zu ziehen. Das h&ouml;rt
 sich durchaus nicht spektakul&auml;r an, macht aber dennoch Laune, denn viele
 Extras wie z.B. Dynamit peppen das Spielprinzip auf.

 [http://online-club.de/~ARENA/]


 "SDL-Spiele"

 Mittels der SDL-Libraries ist es m&ouml;glich, plattform&uuml;bergreifend
 Spiele und Multimediaanwendungen zu programmieren. Einige Programme,
 liegen portiert als Betaversionen vor und k&ouml;nnen von der
 SixK-Homepage heruntergeladen werden. Die Geschwindigkeit der Spiele
 ist allerdings sogar auf gut ausgebauten Systemen nicht berauschend.

 [http://sixk.maniasys.com/index_en.html]


 "WormsDC Christmas Level"

 Zwar ist Weihnachten schon vorbei, wenn ihr diese Zeilen hier lest,
 aber f&uuml;r "Worms Director's Cut" gibt es zwei kleine Geschenke in Form
 von neuen Levels.

 [http://people.freenet.de/unicornis]


 "DeepSilence: Secret of my Soul"

 Das Team um das Zelda-&auml;hnliche Spiel "DeepSilence" wurde um die Japanerin
 Rei erg&auml;nzt. Sie wird f&uuml;r einen Teil der Musik verantwortlich sein und
 Stimmen synchronisieren. totemo omoshiroi desu

 [http://soms.fanhp.de]


 "dynAMIte"

 Das Netzwerkspiel "dynAMIte" wurde in Version 1.9 ver&ouml;ffentlicht und
 enth&auml;lt diverse Neuerungen wie z.B. Computergegner im Offline-Modus.
 Die weitere Entwicklung des Spiels liegt allerdings vorerst auf Eis, da
 der Programmierer des Spiels ohne ausreichend engagierte Betatester nicht
 mehr f&uuml;r die Stabilit&auml;t des Programms garantieren kann.

 [http://amisource.de/dynamite/]
 [http://wrongpla.net/forum/viewtopic.php?topic=122&forum=2&10]


 ---------------------------------------------------------------------
 MorphOS
 ---------------------------------------------------------------------

 "Rage Hard"

 Angek&uuml;ndigt f&uuml;r MorphOS (und MacOS) ist "Rage Hard", ein reiner
 Multiplayer-3D-Shooter f&uuml;r bis zu 32 Personen im Stil von
 Counterstrike. Auch hier werden Terroristen gegen "die Guten"
 antreten, jedoch gilt es vor Beginn der Mission den Beteiligten
 passende F&auml;higkeiten und Waffen mit auf den Weg zu geben. Sehr
 interessant k&ouml;nnte der Flammenwerfer werden.
 Das Spiel soll im Oktober 2002 fertiggestellt werden und bereits
 auf einem G3 mit 350 MHz und Voodoo 3 fl&uuml;ssig laufen.

 [http://www.morphos-news.de/software.php?o=ragehard]
 [http://www.titan-computer.com]


 "Gamma Patrol"

 Das Spiel "Gamma Patrol" ist ein klassischer Vertical Shooter, l&auml;uft
 in Truecolor in der Aufl&ouml;sung 640x480 Pixel und hat u.a. Parallax
 Scrolling zu bieten.

 [http://ftp.unina.it/aminet/aminet/game/shoot/gammapatrolmos.lha]


 "ScummVM"

 Nein, "ScummVM" ist kein Spiel, aber eine kleine Sensation f&uuml;r
 MorphOS-Fans. "ScummVM" ist ein Interpreter f&uuml;r die von Lucasfilm
 (heute LucasArts) geschaffene Skriptsprache mit der legend&auml;re Titel
 wie "Maniac Mansion" oder "Indiana Jones and the Fate of Atlantis"
 geschrieben wurden. Und? Nun, mittels dieses Interpreters ist es
 m&ouml;glich, diese Spiele auch auf MorphOS laufen zu lassen. Ja. Geht
 &uuml;ber die 68k-Version auch. Aber nun zum interessanten Teil: Die
 sp&auml;teren Titel wie "Day of the Tentacle" und "Sam & Max hit the Road"
 laufen auch! Und an "The Dig" und "Vollgas" wird gewerkelt. Die
 Originale muss man nat&uuml;rlich dennoch kaufen, der Interpreter
 &uuml;bernimmt nur das Umsetzen des Codes f&uuml;r MorphOS.


 "SDL-Spiele"

 Mittels der SDL-Libraries ist es m&ouml;glich, plattform&uuml;bergreifend
 Spiele und Multimediaanwendungen zu programmieren. Einige Programme,
 liegen portiert als Betaversionen vor und k&ouml;nnen von der
 SixK-Homepage heruntergeladen werden.

 [http://sixk.maniasys.com/index_en.html]

Oliver Tacke &lt;oliver@aakt.de&gt; - schickt mir eure News!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
