<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Update: So senkt ihr eure Telekom-Rechnung!

Vorab: Erfreulicherweise haben sich auf unseren Aufruf in der letzten
Ausgabe hin doch einige Leser gemeldet, die an einer Weiterf&uuml;hrung dieser
Rubrik interessiert sind. So soll es also geschehen...

Nun zum &Uuml;blichen. Die aktuelle Tariftabelle weist zwei gravierende
&Auml;nderungen zur Version des Vormonats auf: Zum einen sind die Tarife jetzt
nat&uuml;rlich in Cent angegeben, zum anderen ist die Tabelle wesentlich
"schlanker" geworden. Das liegt daran, dass Telediscount nun an allen Tagen
zwischen 7 und 22 Uhr der g&uuml;nstigste Anbieter ist.
Hierzu eine Anmerkung: Vor einigen Monaten hatten wir bereits den
Billiganbieter Teledump aus der Liste entfernt, da die Leitungen in weiten
Teilen Deutschlands st&auml;ndig &uuml;berlastet waren. Falls ihr also Probleme habt,
&uuml;ber Telediscount zu telefonieren, dann gebt uns bitte Bescheid.


Hier nun die aktuelle Tariftabelle:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |        Wohin:  Festnetz -&gt; Festnetz    Festnetz -&gt; Mobilfunknetz
===========================================================================
t&auml;gl. 7-22 Uhr Telediscount (0190035), 2 ct Telediscount (0190035), 18,5 ct
t&auml;gl. 22-7 Uhr Talkline (01050), 1,9 ct     Telediscount (0190035), 18,5 ct

Ortsgespr&auml;che k&ouml;nnen rund um die Uhr &uuml;ber Telediscount (0190035) f&uuml;r 2
ct./min. gef&uuml;hrt werden, wobei der Anbieter bis 21 Uhr g&uuml;nstiger ist als
die Deutsche Telekom und ansonsten eine verbraucherfreundlichere Taktung
hat.

(Alle Angaben ohne Gew&auml;hr)


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es passieren, dass ihr "f&auml;lschlicherweise" mal nicht den g&uuml;nstigsten
  Anbieter benutzt.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: http://www.teltarif.de

* Alle in der Tabelle oben aufgef&uuml;hrten Anbieter rechnen im Minutentakt ab.
  Anbieter, die in einem - wie wir meinen unfairen - Mehr-Minuten-Takt

  abrechnen oder eine pauschale Verbindungsgeb&uuml;hr erheben, werden nicht
  ber&uuml;cksichtigt.

F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
