<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,edenbridge,arcana">
<title>Edenbridge: Arcana</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Edenbridge: Arcana</font></h1><BR> (57:14 / Massacre)</center></P>

<p>Das Debut &quot;Sunrise In Eden&quot; der &#246;sterreichischen Truppe um Gitarrist Lanvall und S&#228;ngerin Sabine Edelsbacher war sicherlich eine der positiven &#220;berraschungen des vergangenen Jahres. Gut ein Jahr sp&#228;ter legt die Combo mit &quot;Arcana&quot; das zweite Album nach und hier wirkt alles eine Spur reifer und ausgegorener, insbesondere auch was die Produktion betrifft, die ja beim Vorg&#228;nger eine der wenigen Kritikpunkte darstellte. Alle Songs knallen absolut transparent und druckvoll durch die heimische Anlage, was auch insbesondere dem grandiosen Gitarrenspiel zu gute kommt, welches auf dem Debut - trotz aller technischen Rafinessen - eher drucklos im Hintergrund blieb. Musikalisch hat sich erwartungsgem&#228;&#223; nicht alzu viel ver&#228;ndert: Neben eing&#228;ngigen Tracks wie etwa dem Opener &quot;Starlight Reverie&quot; oder &quot;Fly On A Rainbow Dream&quot; setzt die Band auch ganz bewusst auf &#252;berlange epische Kompositionen, die sich zwar in ihrer Gesamtheit nicht sofort dem Zuh&#246;rer erschlie&#223;en, aber nach einigen Durchl&#228;ufen umso mehr z&#252;nden. Als 
Paradebeispiele seien an dieser Stelle vor allem der Titeltrack, &quot;The Palace&quot; oder auch &quot;Suspiria&quot; genannt. Das in der Presse allerdings st&#228;ndig Vergleiche mit Nightwish rumgeistern kann ich nicht so ganz verstehen, wenn man mal davon absieht, dass beide Bands gerne auch mal Klassikpassagen einsetzen und halt &#252;ber weibliche Vocals verf&#252;gen - das war es dann aber auch schon mit den Gemeinsamkeiten und wer Edenbridge nach wie vor in die Nightwish Schubalde steckt, hat sich die Platte nur sehr oberfl&#228;chlich angeh&#246;rt. Das soll allerdings nicht hei&#223;en, dass Nightwish Fans mit Edenbridge nichts anfangen k&#246;nnen - ganz im Gegenteil: Trotz des unterschiedlichen Stils werden Nightwish Fans sicherlich auch Edenbridge in ihr Herz schlie&#223;en, eben weil es keine simpele Kopie der finnischen Senkrechtstartet ist. Und Fans, die sich das Debutalbum schon in den heimischen Plattenschrank gestellt haben, die werden auch &quot;Arcana&quot; in ihr Herz schlie&#223;en. Edenbridge haben auf jeden Fall eine goldige Zukunft vor sich...</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
