<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,rough silk, symphony of life">
<title>Rough Silk: Symphony Of Life</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Rough Silk: Symphony Of Life</font></h1><BR> (71:46 / Breaker Records)</center></P>

<p>Nach monatelanger Wartezeit, st&#228;ndigen Terminverschiebungen und einer geh&#246;rigen Portion an Ger&#252;chten ist es nun endlich da: Das neue Rough Silk Album &quot;Symphony Of Life&quot;. Tja, dass ich derma&#223;en begeistert von der Scheibe bin wie von dem hammergeilen `97er Output &quot;Mephisto&quot; oder dessen Vorg&#228;nger &quot;Circle Of Pain&quot; kann ich eigentlich nicht behaupten. Zwar ist man bem&#252;ht deutlich &quot;back to the roots&quot; zu gehen und damit mehr in Richtung Queen zu tendieren, aber schaffen tut man das richtig &#252;berzeugend eigentlich zu keiner Sekunde. Stattdessen versucht man durch den Einsatz vieler stilfremder Elemente die Qualit&#228;t einiger der mittelm&#228;&#223;igen Songs zu kaschieren, was aber auch nicht so recht klappen will. Wenn man mal von den beiden Metal kompatibelsten Songs &quot;Suicide King &amp; Chaos Queen&quot; (hier f&#252;hlt man sich noch am ehesten an die selige &quot;Mephisto&quot; Platte der Epic Metaller erinnert) und &quot;The Truth&quot; absieht, regiert auf &quot;Symphony Of Life&quot; eher der Durchschnitt, wobei man vor allem einige Songs - wie z.B. den 
zweigeteilten Titeltrack - massiv &#252;berladen hat. Da hilft es auch nicht sonderlich, dass Savatage Vordenker Jon Olivia bei &quot;Lucifer&quot; ein Duett mit S&#228;nger Thomas Ludolphy hinlegt, denn irgendwie riecht es hier zu sehr nach Namensdropping. Und wo wir gerade bei S&#228;nger Thomas Ludolphy sind: So sehr er sich auch bem&#252;hen mag - ein adequater Ersatz f&#252;r Jan Barnett ist er immer noch nicht und wird es wohl auch nicht mehr werden. Eventuell sollten sich die Herrschaften mal &#252;berlegen, die vielen Sideprojekte sausen zu lassen und sich stattdessen ganz auf Rough Silk zu konzentrieren. Immerhin war auch das Soloalbum von Mainmann Ferdy D&#246;rnberg ein Flop, zumal man gerade dabei ist den bisherigen guten Ruf der Band massiv zu ruinieren, denn das letzte Studioalbum &quot;Beyond The Sundown&quot; war ja auch kein Hammer vor dem Herrn. Da hilft auch die &#252;berlange Spieldauer der neuen Scheibe nicht mehr viel, denn zu einem Gro&#223;teil regiert hier (leider) gepflegte Langeweile...</P>

<p>Fazit: 4 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
