<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Gamma Ray Interview</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="blue">Gamma Ray Interview</font></center></h1></P>

<p>Das neue Album der sympathischen Hanseaten &quot;New World Order&quot; hat zwar auch schon wieder einige Monate auf dem Buckel, aber das ist nat&#252;rlich kein Grund, sich mit Gamma Ray Mastermind Kai Hansen - dem Gott des deutschen Heavy Metals - dar&#252;ber zu unterhalten und ihn zu seiner Sicht der Dinge zu befragen.</P>

<p><i>&quot;Der Druck nach dem letzten Album war nat&#252;rlich gross, aber wir haben uns davon nicht beeindrucken lassen&quot;,</I> t&#246;nt es auch gleich aus dem Telefonh&#246;rer. </P>

<p><i>&quot;Wenn da ein neues Album kommt und das gut war, warten die Leute nat&#252;rlich umso gespannter auf das, was als n&#228;chstes kommt. Aber das war im Grunde schon seit der &quot;Land Of The Free&quot; (Album von 1995, Anmerkung des Verfassers) so und wir lassen uns da auch nicht verr&#252;ckt machen, ein besseres Album zu machen. Wobei das &quot;besser&quot; dann auch echt Geschmackssache ist und wir nicht vorhaben, progressiver zu Werke zu gehen. In erster Linie bedeutet &quot;besser&quot;
f&#252;r uns, dass die Band noch tighter geworden ist um das, was wir machen wollen, noch besser auf den Punkt bringen zu k&#246;nnen. &quot;Besser&quot; bedeutet f&#252;r uns auf jeden Fall jetzt nicht, auf Teufel komm raus noch mehr Ch&#246;re oder noch mehr Gitarrenoverdubs auf die Platte zu packen.&quot;</i> Kann man wohl ohne Umschweife so stehen lassen. Warum sollte man auch etwas reparieren, was nicht kaputt ist?</P>

<p>Angsprochen auf die musikalischen Unterschiede zwischen &quot;No World Order!&quot; und den vorausgegangen Werken muss selbst ein Kai Hansen erstmal nachdenken. <i>&quot;Tja, die sind eigentlich gar 
nichtmal so einfach zu definieren. Aber um es auf den Punkt zu bringen: Das neue Album ist klassischer, basischer</I> (Mmhh, das hat aber nix mit den chemischen Basen zu tun, oder?; Anmerkung des Verfassers)<i> und deutlich an die NWOBHM angelehnt. Wobei das Material auch deutlich aggressiver und gradliniger ausgefallen ist, als es sonst der Fall war. Die Songs sind nicht mehr so komplex, wie es fr&#252;her teilweise der Fall war.&quot;</I> Auch hier kommt sicherlich kein Demmenti von mir, zumal das Material nach wie vor ganz eindeutig nach Gamma Ray klingt und das inwzischen gewohnte hohe Niveau der Band m&#252;helos 
halten kann. Zudem haben sich die Jungs mit dem Thema Verschw&#246;rungstheorien einen echt interessanten Unterbau f&#252;r die Texte geschaffen.<I> &quot;Mark Brauneis, ein Fan und inzwischen auch Freund der Band, hat uns auf dieses Thema gebracht. Wir haben uns sehr viel &#252;ber dieses Thema unterhalten und er hat uns dann einfach mal seine ganze Sicht der Dinge &#252;ber die Illuminaten erz&#228;hlt. Am Ende wurde es dann aber echt sehr verwirrend, zumal ich niemand bin, der sofort alles glaubt und eigentlich ein eher skeptischer Mensch bin, gerade wenn es auch um solche Themen geht oder ins spirituelle abdriftet. Um das alles dann mal klarer zu kriegen, fragten wir dann nach ob er nichtmal alles aufschreiben k&#246;nnte, damit man vor allem auch mal die Zusammenh&#228;nge kapiert. Er war da z.B. auch mit der Bibel zugange und war dann irgendwann bei den Ufos angelangt. Er hat dann tats&#228;chlich alles aufgeschrieben und das war ein sehr faszinierendes Buch, in dem dann die gesamte Band interessante 
Denkans&#228;tze fand. Und irgendwie ist das dann zum Basisthema der neuen Scheibe geworden&quot;.</I> 

<p>Ah, so einfach ist das also. Praktisch purer Zufall. Zufall scheint auch zu sein, dass zum ersten mal nach dem Debutalbum &quot;Heading For Tomorrow&quot; (1989) mit &quot;Induction&quot; mal wieder ein Intro auf einer Gamma Ray Platte zu finden ist<I>. &quot;Ich hatte einfach dieses Thema im Kopf und w&#228;hrend der ganzes Produktion schwirrte es mir halt im Kopf rum. Selbst im Auto summte ich es vor mich hin bis ich mir dachte, jetzt musst Du es halt mal machen. Und die anderen fanden das auch geil und dann haben wir das halt spontan und ohne Fremde Hilfe gemacht.&quot;</I> Spontane Ideen sind ja fast immer auch die besten Ideen. Der &#252;berraschende Aufkauf von der Gamma Ray Plattenfirma Modern Music durch Sanctuary (Label von Iron Maiden Manager Rod Smallwood), d&#252;rfte dann aber auch f&#252;r die dauergrinsenden Strahlem&#228;nner aus Hamburg zu spontan gewesen sein und brachte auch die eine oder andere Neuigkeit f&#252;r die Band mit, da unter anderem auch die im Vorfeld geplante Single 
wieder eingestampft wurde.</I>
<i> &quot;Das war eigentlich eine witzige Sache. Bei Modern Music haben wir einfach immer gesagt: Wir wollen das oder das machen und so ist es dann im allgemeinen auch passiert. So war auch die Single geplant und dann kam halt die &#220;bernahme und wir sind eigentlich nach wie vor davon ausgegangen, dass wir die Single machen. So haben wir dann auch im Studio brav angefangen diese Songs zuerst einzuspielen und zu mischen, um die 
Single fertig zu machen. Irgendwann haben wir dann aber erfahren, dass Sanctuary eigentlich gar keine Single will und f&#252;hrten daf&#252;r zahlreiche Gr&#252;nde auf. Und irgendwie ist das ja auch sinnig, denn mal abgesehen von dem einen Bonustrack w&#228;re auf der Single ja auch sonst nichts draufgewesen, was den 
Kaufpreis von 12 DM rechtfertigen w&#252;rde. Tja, und da Bonustracks in der Regel Coverversionen oder etwas &#228;hnliches sind, w&#228;re das eh nur etwas f&#252;r Die-Hard Fans gewesen. Zwar bleibt jedem selber &#252;berlassen, ob er nun die Single kauft oder nicht, aber ich finde, an dem Argument ist echt was dran, zumal die beinharten Fans sich sp&#228;ter auch das Album kaufen und die beiden Studiotracks, die auf der Single draufgewesen w&#228;ren, dann nochmal serviert bekommt und schlussendlich die 12 DM f&#252;r den einen Bonustrack gezahlt h&#228;tte.&quot;</I> Das wird sicherlich jeder Fan mit chronisch leerem Geldbeutel unterschreiben.</P>
<p> Zwar ist auf Dauer nicht geplant, alle B-Seiten in Form einer einzelnen CD auf den Markt zu bringen, aber daf&#252;r verr&#228;t uns Kai Hansen etwas anderes.<I> &quot;Noise Records, unsere alte Plattenfirma, wollen ins absehbarer Zeit unseren ganzen Backkatalog neu ver&#246;ffentlichen, so &#228;hnlich wie es Judas Priest gerade machen. Neben neuen Covern und ausf&#252;hrlicheren Bookletts sollen dann auch die Bonustracks den Weg auf die neuen CDs finden. Momentan ist der Februar angedacht, aber so ganz konkret ist dieser Termin noch nicht.&quot;</I> Ob das jetzt f&#252;r den Fan so sinnvoll ist, sei einfach
mal dahingestellt. Meine Wenigkeit hat sich aber auch schon damals &#252;ber das Rerelease des kompletten Running Wild Backkataloges ge&#228;rgert, in dessen Zuge die entsprechenden CDs mit einigen Bonus Tracks versehen wurden und im Laden f&#252;r 25 DM an den Mann bzw. die Frau gebracht wurden. Ein Spiel, dass 
sicherlich nicht jeder Fan mitmachen wird. Aber das soll hier ja nicht das Thema sein. Stattdessen w&#252;rde mich ja mal ein neues Live Album von Gamma Ray mit dem aktuellen Line-up interessieren, immerhin hat sowohl der &quot;Power Of Metal - Volume I Sampler&quot; (damals noch mit S&#228;nger Ralf Scheepers) als auch das &quot;Alive 95&quot; Album einige Jahre auf dem Buckel. Auch hier r&#252;ckt der Meister einige aktuelle Infos raus.<i> &quot;Das ist eigentlich unser n&#228;chster Plan und wollten schon auf der aktuellen Tour etwas mitfilmen, was DVD tauglich ist. Live CD - sch&#246;n und gut, aber wir wollten eigentlich dann lieber gleich eine Live DVD machen, weil es eben auch noch keine Video Geschichten von dem aktuellen Line-up gibt. Das war auch eigentlich f&#252;r zwei Shows geplant, was aber leider an organisatorischen Querelen gescheitert ist. Deshalb haben wir f&#252;r n&#228;chstes Jahr eine extra Show geplant, wo wir das machen werden und dementsprechend wir dann auch die B&#252;hne und die 
Setlist gestaltet werden.&quot;</I></P>

<p>  H&#246;rt sich auf jeden Fall schonmal gut an, 
zumal Gamma Ray Live Konzerte eigentlich immer ein Kn&#252;ller sind und wenige Bands eine &#228;hnliche Magie auf der B&#252;hne verspr&#252;hen wie Gamma Ray im aktuellen Line-up. Apros pos Line-up: Nach dem Split bei Helloween - bei denen bekanntlich Drummer Uli Kusch und Gitarrist (und Kai Hansen Nachfolger) Roland Grapow ihren Hut nehmen mussten - kursierten die wildesten Ger&#252;chte, wer denn bei Helloween einsteigt. Nachdem erst Kai Hansen selber dort ger&#252;chteweise gehandelt wurde, hat es nun seinen Gamma Ray Mistreiter Henjo Richter erwischt, was weitaus weniger abwegig war, als das erstere. <i>&quot;Es ist nicht wirklich ein Ger&#252;cht. Michael Weikath (Helloween Gitarrist und Gr&#252;ndungsmitglied, Anmerkung des Autors) ist seit langen Jahren ein guter Freund von Henjo Richter und hat ihm tats&#228;chlich auch ein Angebot gemacht, bei Helloween einzusteigen, wobei Henjo aber bei Gamma Ray nicht weg m&#246;chte. &#220;bergangsweise hat Henjo Helloween wohl seine Hilfe angeboten, wobei ich 
das eher skeptisch sehe. Man darf nicht vergessen, dass Helloween die beiden anderen aufgrund der Soloprojekte gefeuert haben und es w&#228;re Schwachsinn, dann einen Gitarristen einzustellen, der nebenbei noch eine andere Band hat. Konkret hei&#223;t das: Henjo ist exclusiv bei Helloween oder er ist exclusiv bei Gamma Ray. So sehe ich das. 
Und Henjo hat sich erstmal auch f&#252;r Gamma Ray ausgesprochen und das ist der Stand der Dinge. Man wei&#223; zwar nie was die Zukunft bringt, aber wir hatten eine echt geile Tour und die Chemie stimmt auch absolut, so dass ich da optimistisch in die Zukunft schaue.&quot;</I></P><P> Ein gutes Schlusswort von einem der schillernsten und sympathischsten Pers&#246;nlichkeiten im Heavy Metal Bereich &#252;berhaupt. Und um ehrlich zu sein: Mir w&#228;re es schon lieber, wenn das aktuelle Gamma Ray Line-up beibehalten w&#252;rde, denn eine Truppe, die ein so superbes Album wie &quot;No World Order!&quot; auf den Markt bringt, darf einfach nicht auseinandergerissen werden. </P>

<p>Interview: Kilian Servais</P>







<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
