<html>
<head>
  <title>AMIGA</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="amiga5.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

4. Jeff Schindler meldet sich zu Wort

&raquo;Das Neueste von Jeff Schindler - 23. November 1998

Tr&auml;ume und Wirklichkeit

Als Generaldirektor von Amiga Inc. hat man Tage, in denen man seine Tr&auml;ume 
mit Blick auf die Realit&auml;t verliert. Ich muss zugeben, dass ich manchmal 
lieber tr&auml;umen w&uuml;rde, der unm&ouml;gliche Amiga sei nicht nur eine Traum; es 
geht um die Verwirklichung der entstandenen Tr&auml;ume. Wir haben schwer 
gearbeitet, um das zu erreichen. Ich glaube, dass wir uns, um diese 
Gesellschaft weiter empor bringen zu k&ouml;nnen, immer wieder darauf 
konzentrieren m&uuml;ssen, diese Tr&auml;ume selbst zu verwirklichen und nicht nur 
darauf zu vertrauen, dass sie vielleicht von alleine wahr werden.

Auf der Computer '98 haben wir unsere Zusammenarbeit mit QNX als Grundlage 
f&uuml;r die Amiga-Architektur der n&auml;chsten Generation bekanntgegeben. Wir sind 
auf dem Sprung in den Aufbruch und ich sah die Begeisterung in den Augen 
vieler Menschen und f&uuml;hlte knisternde Spannung in der Luft! Die Aufregung, 
die die Zukunft uns bietet, ist gro&szlig;; wir freuen uns auf die Zusammenarbeit 
mit QNX und seiner Mannschaft. QNX bringt die Grundlagen der Technik und 
der Wertigkeiten, die Amiga immer hatte. Das QNX RTOS ist eine Grundlage, 
auf der wir aufbauen k&ouml;nnen. Nur auf einer sicheren Basis k&ouml;nnen die 
gr&ouml;&szlig;ten Bauwerke errichtet werden. Dies ist nicht nur der Traum eines 
Architekten oder die Vision eines Baumeisters, wir widmen unsere Kr&auml;fte dem 
Ziel, es Wirklichkeit werden zu lassen. Realit&auml;t ist aber auch, dass die 
gr&ouml;&szlig;ten Geb&auml;ude nicht &uuml;ber Nacht entstehen. Dazu braucht es Planung, 
Hingabe, Einsicht und eine Menge Schwei&szlig;!

Wir legen ab zu neuen Ufern und es gibt sicher Leute, denen unsere 
Strategie nicht gef&auml;llt. Einige werden auf &Auml;nderungen dr&auml;ngen und unsere 
Zukunftspl&auml;ne nicht unterst&uuml;tzen. Anderen wird der Weg, den wir w&auml;hlten, 
nicht gefallen.
Allen diesen m&ouml;chte ich sagen: &quot;Wir wollen nicht in der Vergangenheit 
stecken bleiben oder in einer Traumwelt leben&quot;. Wir wollen 
zusammenarbeiten, damit Amiga nicht mehr nur der Name einer kleinen Gruppe 
ist, sondern dass er weltweit bekannt wird. Ein Name, auf den wir alle 
stolz sein k&ouml;nnen.

Die Ereignisse der letzten Wochen haben die Gemeinschaft wie eine 
Schockwelle getroffen und sie in Aufregung und Angst versetzt. Es ist 
unangenehm, dass so viel Aufregung und soviele Ger&uuml;chte entstanden. Wechsel 
ist schwierig und bitte glauben Sie mir, wenn ich sage, dass ich mir der 
Werte bewusst bin, die die Gemeinschaft einbringt. Ich f&uuml;hle mit jedem 
einzelnen von Ihnen w&auml;hrend dieser schweren Zeiten im Wiederaufbau. Denken 
Sie daran, dass Amiga mehr ist als eine Person oder ein Computer. Es ist 
wie Menschen, die sich nicht f&uuml;rchten bis zur Grenze zu gehen, 
hin&uuml;berschauen, alles erkennen, was dort ist, und dann den gro&szlig;en Sprung 
wagen. Wir leben nicht in einer Traumwelt, wir leben in der Wirklichkeit 
und jetzt ist der Moment der Wahrheit gekommen.

Die Vorstellungen sind da, die Architekten haben mit der Arbeit begonnen, 
nun m&uuml;ssen wir geduldig zusehen, wie das Bauwerk entsteht. Um das zu 
erreichen, ist es lebensnotwendig, dass die Gemeinschaft zusammenh&auml;lt.
Die Unterst&uuml;tzung durch die Gemeinschaft der User Groups (Anwendergruppen) 
ist wichtig bei der Bekehrung der &uuml;brigen Welt (Kommt und seht, was wir da 
Neues bauen!) Die Gruppe der Entwickler ist kritisch bei der Ausbreitung 
und bei der Vernetzung eines Baus mit vielen weiteren. Das ist Amiga, und 
heute mehr als fr&uuml;her m&uuml;ssen wir den Weg nach oben wagen, w&auml;hrend die Welt 
staunend zuschaut. Wir k&ouml;nnen das als Gemeinschaft, die nicht nur tr&auml;umt, 
sondern deren Tr&auml;ume auf die Realit&auml;t zielen und die keine Angst vor dem 
gro&szlig;en Aufschwung hat.

Danke f&uuml;r Ihre Unterst&uuml;tzung und daf&uuml;r, dass Sie f&uuml;r den Amiga immer ein 
offenes Herz haben.
  
Jeff Schindler

Generaldirektor

Amiga Inc.


Die Informationen &uuml;ber die Wirklichkeit (ich wei&szlig;, Sie alle wollen sie 
haben) lesen Sie im Interview von Dr. Allan Havemose, unseres 
Vizepr&auml;sidenten f&uuml;r Technology and Developments (Technologie und 
Entwicklung), das in K&uuml;rze in den Amiga-Publikationen erscheinen wird.&laquo;

(Quelle des Originals: AMIGA, Inc.)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="amiga3.html"><img src="prev.gif" alt="PREV" border=0></a><a href="amiga5.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
