<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Vorstellung der neuen Preise

Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm CDCat f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&raquo;CDCat (MUI) ist DER CD-ROM-Katalogisierer f&uuml;r den Amiga. Dar&uuml;ber hinaus 
k&ouml;nnen aber auch s&auml;mtliche Festplatten, Disketten und Verzeichnisse (z.B. 
mit vielen Grafiken) archiviert werden.

Es eignet sich auch besonders f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-
Beschreibungen mitber&uuml;cksichtigt werden. CDCat besitzt einen superschnellen 
Suchmodus (85% Inline-Assembler!), au&szlig;erdem k&ouml;nnen mit dem &quot;Browser&quot; 
archivierte CDs verzeichnisweise durchst&ouml;bert werden, ohne eingelegt zu 
sein.

Direkt aus CDCat heraus k&ouml;nnen Archive entpackt, Bilder angezeigt werden 
etc. Dabei sind alle Programme frei konfigurierbar.

Weitere Features: XPK-Unterst&uuml;tzung, Merkbrett zur Verwaltung gefundener    
                  Dateien, DiskIDs zur schnellen Identifizierung der CDs,   
                  usw...

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar. Aktuell ist 
Version 2.2. Ein Test von CDCat l&auml;sst sich unter 
<a href="http://www.amigaworld.com/support/cdcat/C_test_de.html">http://www.amigaworld.com/support/cdcat/C_test_de.html</a> abrufen.

In K&uuml;rze wird die Version 3.0 ercheinen, u.a. mit PowerPC-Support, Katalog-
Manager zum Reorganisieren der Kataloge, Filterfunktion etc.

Der Autor ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland

E-Mail: <a href="mailto:frank@cc86.de">frank@cc86.de</a>                                                     &laquo;


Peter Elzner hat sein Programm ManiacBall f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;ManiacBall basiert auf dem klassischen Breakout, bei dem mit einem 
Schl&auml;ger und einem Ball Steine getroffen werden m&uuml;ssen und diverse Extras 
das Leben erleichtern. ManiacBall bietet als Erweiterung die M&ouml;glichkeit 
von mehreren Schl&auml;gern und mehreren B&auml;llen auf einem Spielfeld, ein 
lustiger Zwei-Spieler-Modus (gleichzeitig!) und jede Menge Extras, wie z.B. 
Laser, Schutzschild und vieles mehr. Wem die vorhandenen Level zu 
langweilig werden, kann sich mit dem Leveleditor auch eigene Spielstufen 
erschaffen.
Voraussetzungen: Amiga mit Kick2.0, 1MB Speicher.
          Grafikkarten werden unterst&uuml;tzt, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 25 Level, Editor eingeschr&auml;nkt
Registrierte Version: 25 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Stephan Rupprecht hat sein Programm PrintManager f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;PrintManager ist ein Programm, das die Arbeit mit einem Drucker flexibler 
und kontrollierbarer macht. Es kann Daten, die ein Programm an den Drucker 
schickt, zun&auml;chst in einer Datei speichern. So wird ein Anwenderprogramm 
nicht durch den langsameren Drucker aufgehalten. Je nach Wunsch kann der 
PrintManager die gespeicherten Daten anschlie&szlig;end ausdrucken oder sie  
zun&auml;chst auf Diskette belassen, um sie sp&auml;ter in einem Rutsch auszudrucken.  
Des weiteren bietet Ihnen der PrintManager die M&ouml;glichkeit, &uuml;ber das 
Datatypes-System, Dateien beliebigen Formats auszudrucken (dies setzt 
nat&uuml;rlich einen entsprechenden Datatype f&uuml;r das jeweilige Format voraus).

Die Sharewaregeb&uuml;hr betr&auml;gt DM 15,- bzw. DM 20,- bei Postversand, die 
Demoversion ist im Aminet unter text/print/prtman39.lha zu finden.

Adresse des Autors:

Stephan Rupprecht
Apfeldweg 1
44359 Dortmund

E-Mail:

<a href="mailto:stephan.rupprecht@metronet.de">stephan.rupprecht@metronet.de</a>&laquo;


Andreas Etzrodt hat sein Programm HomeCINEMA f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:

&raquo;HomeCINEMA ist eine Video-Datenbank, die endlich einmal wirklich
EINFACH zu bedienen ist. Sie ist nicht &uuml;berladen mit Funktionen,
bietet daf&uuml;r aber alle wesentlichen Funktionen, die man sich
verspricht. Eine Demoversion ist unter: <a href="http://sharksoft.notrix.de">http://sharksoft.notrix.de</a>
zu finden. F&uuml;r Amiga-Arena-Besucher gelten bis zum 31.12.98 f&uuml;r die 
Registrierung Sonderkonditionen, unter <a href="http://online-club.de/~ARENA/«">http://online-club.de/~ARENA/«</a>


Des Weiteren hat Thomas Hasemann das 24-Bit-Malprogramm XiPaint 4.0 zur 
Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="gewinnspiel1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="gewinnspiel3.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
