<html>
<head>
  <title>Nachlese: Computer '98</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele11.html"><img src="prev.gif" alt="PREV" border=0></a><a href="messe2.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

Nachlese: Computer '98
----------------------

1. Messebericht (von Christian Wimmer)

&raquo;Computer 98
-----------

Nach 10 Stunden habe ich sie dann doch gefunden, DIE Amiga Messe - die
Computer 98.
Viel Interessantes gab es zu sehen und gro&szlig;teils auch zu kaufen.
Hier nun schnell ein &Uuml;berblick &uuml;ber das Geschehen:

APC&amp;TCP
-------

An diesem Stand war ich vertreten. An Neuerscheinungen gab es zu bewundern:

CD-ROMs:

- AmigaTimes 1 , 1 CD des bekannten Diskmags, mit allen Ausgaben und der
                 Vollversion AmiAtlas 2.0 + PD, bestverkaufte CD am Stand

- Best of Scene Archives: Scene-Demos on masse, es steht BEST drauf, es ist
                          BEST of der letzten Jahre drauf!

- Digibooster PRO: Das bekannte und wirklich professionelle Porgramm zum
                   &quot;Mod&quot; machen. Ein paar Highlights: 128 Kan&auml;le, volle
                   Grafik- und Soundkartenunterst&uuml;zung
                 
- Games Attack Volume 1: MEINE erste CD :-) Spielesammlung der h&ouml;heren G&uuml;te
                         Spiele, Demos + alle HD-Installer

Spiele:                          

- Marbelous 2: S&uuml;chtig machendes Murmelspiel. Nachfolger von Marblelous 1,   
               nun mit 256 Farben (AGA oder Grafikkarte)

Alle 3 Tage war Markus P&ouml;llmann am Stand, zusammen mit seiner PPC-Karte 
(die er von Phase 5 quasi geschenkt bekam), und war PANISCH dabei, Ph&ouml;nix 
zum Laufen zu bewegen.

*Dieses Game wird den PPC nutzen!!!!!!!!!!!*

Und zwar WarpOS (nach der Entscheidung von AInc.) und wohl auch bestimmte 
3D-Karten (jedoch NICHT Warp3D, da noch zu langsam).
Leider wurde es dank verschiedener Widrigkeiten nix. :-(
Zuerst st&uuml;rzte die Beta ab, dann hatte Markus das PowerUp-Modul nicht dabei 
(Aufsatz f&uuml;r StormC, damit man PPC proggen kann).
Am Samstag bekam er dieses dann &uuml;ber gekauftem ZipDrive von Haage&amp;Partner 
gestellt. Haage&amp;Partner leisten in Sachen Support &uuml;brigens erstklassige 
Arbeit! Nicht jede Firma w&uuml;rde einem Programmierer bei der Realisierung in 
diesem Ma&szlig;e helfen, indem sie ihm von IHREM Rechner StormC geben bzw. dem 
Programmierer auf der C97 das PowerUP-Modul SCHENKEN!
Nun, auch mit dem PowerUP-Modul war nix zu machen. Markus schaffte es zwar 
noch, eine lauff&auml;hige Version zu machen, diese lief jedoch nur auf dem 68k 
(040/25 ohne FPU), war jedoch weit von fl&uuml;ssig entfernt (3 Frames/s). Aber 
wer dachte, Lambda wird besser als Ph&ouml;nix, hat sich get&auml;uscht!!!
Leider wird Ph&ouml;nix noch dauern, Markus hat gerade Pr&uuml;fungen, und deshalb 
wird Ph&ouml;nix wohl erst Mitte n&auml;chstes Jahr erscheinen (ist jedoch blo&szlig; 
gesch&auml;tzt!).
Einie weitere &Uuml;berraschung (zumindest f&uuml;r mich) gab es gleich mitzunehmen: 
Flyin High Patch auf V1.2 Das Besondere daran: Grafikkartenunterst&uuml;tzung! 
JA, Markus hat es nach einiger schweisstreibender Arbeit geschafft, das 
Game auf Grafikkarten laufen zu lassen!


Amiga Inc, Amiga International
------------------------------

Man glaubt es kaum: Ein Preview von OS 5.0!
Der Kernel (Grundstein f&uuml;r ein Betriebssystem) ist, nicht wie von vielen 
vermutet BeOS, es wurde zwar angeblich mit Be Inc. verhandelt, man kam 
jedoch zu keinem Ergebnis, sondern QNX (hoffentlich richtig geschrieben). 
Dieses sah auf der Pr&auml;sentation jedoch stark nach X-Windows aus (Unix), 
wird aber wohl GUI-m&auml;&szlig;ig noch ver&auml;ndert, war ja noch 'ne Alpha.
Dieser Kernel wird wohl mit dem Amiga-Kernel &quot;verheiratet&quot; werden und CPU- 
unabh&auml;ngig!! D.h. PPC, Intel, Alpha...... Amiga Inc. wird nun wirklich 
vorerst keine Hardware machen, jedoch werden externe Firmen dies erledigen. 
Man wollte die Anwesenden beeindrucken und schob eine laufende Applikation
von einem zum anderen Rechner (&uuml;ber Netzwerk), dies klappte auch, jedoch
st&uuml;rzte die Sache dabei ab.
Das OS 3.5 wurde erneut best&auml;tigt. ARTAS (Nachfolger f&uuml;r AHI) f&uuml;r 
Soundkarten, Picasso 96 f&uuml;r Grafikkarten und WarpOS f&uuml;r PPC.
Zum GUI wurde keine endg&uuml;ltige Aussage gemacht. Entwickler von OS 3.5 
wurden auch genannt: Haage&amp;Partner, Olaf Barthel, Carl Sassenrath, etc.
Am Stand von AInc. konnte man die &uuml;blichen Goodies, wie Kugelschreiber,
kaufen. Auch wurde Annex gepowert. Autogrammstunden waren regelm&auml;&szlig;ig, auch
gab es jede Menge Vorf&uuml;hrungen.
Besonders gefreut habe ich mich &uuml;ber einen &quot;Boing&quot;-Wasserball, den ich
kostenlos ergattern konnte.

Die Unteraussteller von AInc.
-----------------------------

Ateo Concepts
-------------

Die Franzosen zeigten die &quot;Grafikkarte&quot; Pixel 64. Diese Karte ist sehr viel 
mehr als &quot;nur&quot; eine Grafikkarte, sie ist eher als &quot;Picasso IV&quot; f&uuml;r den 
A1200 zu verstehen. Der Ateo Bus nimmt einige zus&auml;tzliche Erweiterungen 
auf, wie z.B. SCSI-Controller. Die Pixel 64 hat, f&uuml;r Amigas, ganz 
ordentliche Leistungswerte, so z.B. 1024 x 768 in 16 Bit. Leider waren 
nicht sehr viele Infos zu erfahren, auf dem Flyer standen nicht sehr viele 
Daten, und die Entwickler waren &quot;nur&quot; des Englischen m&auml;chtig und st&auml;ndig 
besch&auml;ftigt.

Escena
------

G3-Boards!!!!!! Kurz vor der Messe wurden offiziell G3-Boards unter dem 
Namen &quot;Brainstormer&quot; angek&uuml;ndigt. Ein Prototyp war zwar auf der Messe 
vorhanden, weigerte sich aber zu funktionieren. Die Messe war leider 2 
Wochen zu fr&uuml;h. Diese Boards werden vorerst NUR unter ZorroIII laufen und 
G3-CPUs von 233 - 400 MHz aufnehmen. Zusammen mit SD-RAM (EDO-RAMs werden 
nicht unterst&uuml;tzt) wird dies die ABSOLUTE Spitze des auf dem Amiga 
denkbaren Speeds sein. WarpOS wird ben&uuml;tzt, auch die 68k-CPU-Emulation von 
Haage&amp;Partner. Diese 68k-Emulation wird einen berauschenden Speed 
erm&ouml;glichen, der wohl auch 68060-CPUs um mehrere Faktoren (!!!!!) 
&uuml;bertrifft. Dies allein macht die Karten schon interessant. Man stelle sich 
*uake mit 5-facher Geschwindigkeit vor!
In Richtung G3 wird &uuml;brigens evtl. noch mehr von anderen Firmen kommen, 
jedoch ist hier noch nichts offiziell.

Kato Developments
-----------------

Melody hie&szlig; hier das Schlagwort. Diese Soundkarte wurde auch live 
demonstriert und ist vor allem f&uuml;r A1200-User interessant. Die Karte passt 
n&auml;mlich komplett in den A1200 und hat eine hervorragende Qualit&auml;t, die sich 
ohne Weiteres mit PC-Karten messen l&auml;sst. Zum Einsatz kommt kein &quot;billiger&quot; 
Soundblaster-Chip, sondern ein anderer, hochwertigerer, der auch bei PC-
Profi-Soundkarten zum Einsatz kommt. Bei der Vorf&uuml;hrung kam auch das MPEG- 
Modul zum Einsatz. Dieses bietet MP 1-2(3)-De- und -Encoding OHNE CPU-
Belastung, was auch eindrucksvoll zu beobachten war. Ohne Karte stockte der 
Sound, und das mitlaufende 3D-Labyrinth ruckelte, mit Einsatz der Karte 
jedoch lief alles glatt.

Es waren noch einige Unteraussteller mehr vertreten, leider hatte ich nicht
die n&ouml;tige Zeit, mir alles anzusehen.


DAUG (Dachorganisation der Amiga-User-Gruppen)
----------------------------------------------

Mission: Amiga

...hie&szlig; hier das Stichwort und das Thema.
Die Ziele: Weiterentwicklung des Amiga, PPC, OS 3.5.
Schlagworte: WIR SIND DIE USER!

Der DAUG hat es geschafft, mit einem Stand anwesend zu sein. Es wurden 
insgesamt ca. 28000 Flyer verteilt, von denen ca. 1300 unterschrieben 
zur&uuml;ckkamen. Unterschrieben von Leuten wie Petro Tyschtschenko. 
Der DAUG besteht aus 16 (nach der Messe wohl 18 oder mehr) Usergruppen, die 
gro&szlig;teils Amigas als ihre Rechner haben. Der DAUG WILL bewegen, etwas f&uuml;r 
die Zukunft des Amigas tun. Der momentane Hauptpunkt ist die Mission Amiga, 
deren Hauptanliegen der PPC darstellt.
Es wurde bereits einiges erreicht, wie z.B. die G3-Boards von Escena.
Es wird auch in Zukunft hoffentlich einiges bewegt werden, so will der DAUG 
weitere Clubs gewinnen, wobei hier nicht nur deutschland- sondern 
europaweit gedacht wird. Einige Kontakte nach England und Frankreich wurden 
hierbei bereits gekn&uuml;pft.
Aber auch weitere Entwicklungen f&uuml;r den Amiga will der DAUG vorantreiben, 
so wurden zum Ende der Messe einige erfolgreiche Gespr&auml;che in Richtung 
Amiga-Notebook gef&uuml;hrt.
Der DAUG wurde auf der Messe offiziell von Amiga Inc. anerkannt, und auch 
sonst wurden viele wichtige Gespr&auml;che gef&uuml;hrt.
Die Flyer wurden dem DAUG &uuml;brigens von Haage&amp;Partner &quot;geschenkt&quot;, f&uuml;r
eine kleine Anmerkung &uuml;ber Werbung (ankreuzen und man kriegt Werbung).
Dieser Flyer erscheint in der Erstausgabe der amigaOS und wird wohl auch
noch in einigen anderen Zeitschriften erscheinen.
Der DAUG wird wohl in n&auml;chster Zeit eine der aktivsten Bewegungen werden.


Einige DAUG-Messeimpressionen:

&quot;Also ich denke: Freaks haben den Amiga entwickelt, Freaks m&uuml;ssen
ihn weiterentwickeln.&quot;
Ich: &quot;Lasst doch Petro einen Flyer unterschreiben&quot;
Andreas Magerl: &quot;Ach, das ist doch &uuml;bertrieben&quot;
Tja, am Sonntag wurde dann ein Flyer von ihm unterschrieben. :-)
&quot;Amiga? Was ist denn das?&quot;

DAUG = D&uuml;mmste anzunehmende User-Gruppe
DAUG = D&uuml;mmster anzunehmender User in Gruppen


Eternity
--------

Hier war vor allem &quot;Tales of Tamar&quot; zu sehen.
Und ich kann sagen: Es sieht SEHR gut aus.
Es war eine Animation zu sehen, und es sah WIRKLICH beeindruckend aus.
Wenn alles glatt l&auml;uft, d&uuml;rft ihr diese Anim bald auf einer AFuture-CD 
sehen.


Falke Verlag
------------

Angek&uuml;ndigt wurde sie zur Messe, und sie hat es geschafft:

Die amigaOS erschien p&uuml;nktlich und wurde zum Mega-Messe-Einf&uuml;hrungspreis 
von 5 DM in Massen gekauft. Das Heft hat ca. 86 Seiten und ist wirklich 
gelungen. Das Einzige, was st&ouml;rt, sind die vielen Schwarzwei&szlig;-Seiten. Daf&uuml;r 
gibt es sie zum erfreulich niedrigen Preis von 7,90 DM.


New Generation
--------------

WET! hie&szlig; hier das Wort. Und man bekam wirklich feuchte Augen:

Das Game war f&uuml;r Amiga zu kaufen! Mindestanforderung: 68020 + 8 MB Fast-
RAM. Empfohlen: 68060 + Grafikkarte. Grafikkarten werden &uuml;ber CyberGraphX
oder Picasso96 unterst&uuml;tzt. Grafisch ist das Spiel auf alle F&auml;lle ein Hit,
spielerisch wird es seine St&auml;rken zeigen m&uuml;ssen.

Auch war etwas von &quot;Chartbuster&quot; zu sehen, ob dies jedoch f&uuml;r Amiga oder
PC war, war nicht zu erkennen. Die Animation sah auf alle F&auml;lle fein aus.


Protovision Verlag
------------------

Die AmigaFever war auch anwesend.
Und es war nicht nur ein Preview zu sehen, man konnte gleich das 
frischgedruckte Erstexemplar mitnehmen!
Alles komplett und Farbe und 68 Seiten dick. Dieses Magazin legt einen 
starken Start mit seiner Erstausgabe hin.


Titan
-----

Kurz vor der C98 kam noch mal ein Hammer: Siedler 2 kommt von TITAN f&uuml;r den 
Amiga!
Titan hatte sogar noch was Lauff&auml;higes f&uuml;r die Messe dabei, leider hat eine 
Festplatte wohl irgendwas nicht &uuml;berlebt, und so wurde nix daraus. Jedoch 
hatten sie ein erstes ALPHA-Preview von Claws of the Devil dabei. Man 
konnte Terry Fletcher in diesem High-End-TombRaider-Clone um ein Geb&auml;ude 
rennen sehen, und ein Bild der holden Maid. Wem die Oberweite von &quot;Lara 
Croft&quot; ein Begriff ist, der wird bei Terry Fletcher eine weitere Steigerung 
erleben! Das Demo war wirklich noch weit vom fertigen Spiel entfernt. Die 
Grafik war noch nicht sehr berauschend und es waren noch grafische Fehler 
enthalten, so waren in der blonden M&auml;hne der Hauptdarstellerin jede Menge 
rote Punkte zu erkennen, jedoch scheint die Kameraf&uuml;hrung ziemlich gut zu 
sein.
Dieses Spiel wird &uuml;brigens auch f&uuml;r PPC sein, was es wohl auch bitter n&ouml;tig 
hat. Grafikkarten-Support ist ja heutzutage sowieso logisch.
Auch zu sehen war FantasticDreams, der Nachfolger von ElasticDreams.


Village Tronic
--------------

Picasso IV zum Messepreis f&uuml;r hammerharte 599 DM!
Auch war hier die komplett neue Ariadne II zu bewundern und f&uuml;r 199 DM 
gleich mitzunehmen.


Zorro-Boards
------------

Manchen ist sicher die Anzeige von Vesalia in der letzten Ausgabe der APlus 
aufgefallen. &quot;Zorro2-Board mit 2 ZorroIV-Slots&quot; Zorro IV? Und schneller als 
ZorroIII? Wie geht das? Manche dachten, es sei ein Schreibfehler o.&Auml;., doch 
wie sich herausstellte, ist wirklich ein solches Zorro-Board f&uuml;r den A1200 
in Entwicklung. Wie mir erz&auml;hlt wurde, waren die ZorroIV-Slots bereits vor 
Jahren fertig entwickelt, jedoch kamen sie nie auf den Markt.
Wie mir gesagt wurde, &uuml;bernimmt die Entwicklung dieselbe Firma, die bereits 
mit Entwicklungen wie der Hypercom von sich reden gemacht hat.
Angesichts der kommenden Zorro-G3-Boards und des Preises von Vesalia (289 
DM in der Anzeige) scheint dies etwas sehr Interessantes zu sein.
Ich hoffe nur, dass das Zorro-Board auch ZorroIII-kompatibel ist.
Aber auch, wenn es &quot;nur&quot; ZorroII-kompatibel ist: der Preis allein ist schon 
interessant, denn ZorroIII-Boards kosten &uuml;ber 700 DM und ZorroII-Boards 
sind mit 249 DM auch nicht viel g&uuml;nstiger, jedoch wohl um einiges 
langsamer.
Auch war im &quot;Micronik&quot;-Katalog ein ZorroII mit *aktivem* PCI-Slot 
enthalten, was es damit auf sich hat, konnte ich jedoch nicht mehr 
herausfinden.


War das alles?
--------------

Noch lange nicht! So gab es einige angek&uuml;ndigte Produkte zu kaufen, wie den 
IOBlix und einige CD-Neuerscheinungen. Der Amiga BodyGuard liegt momentan 
&uuml;brigens leider auf Eis. Besonders ge&auml;rgert hat mich die Abwesenheit von 
Phase5.
Irgendwann muss auch mein Messebericht zu Ende sein, au&szlig;erdem k&ouml;nnte ich 
&uuml;ber die anderen Neuerscheinungen nicht sehr viel schreiben.
Aber eins ist sicher: Diese Messe war einen Besuch wert!

Messe Preish&auml;mmer:

Apollo 68060 A1200-Turbokarte: A1260/50: 599.- A1260/66 699.-
Village Tronic: Picasso IV 599.-
Plextor SCSI CDROM: 190.-
CoolBits: Amiga 1200 inkl. HD  399.-
Conny Figge: A1200 inkl. HD + CD-ROM 555.-
CDRom Brenner Teac (bester Brenner auf dem Markt): 459.-
NoName-CD-Brenner 2x: 359.-

Christian Wimmer&laquo;

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="spiele11.html"><img src="prev.gif" alt="PREV" border=0></a><a href="messe2.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
