<html>
<head>
  <title>Workshops</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="workshops1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="tests1.html"><img src="next.gif" alt="NEXT" border=0></a>
<hr>
<pre>

2. Update: So senkt ihr eure Telekom-Rechnung!

Bevor wir zu den unver&auml;nderten Tabellen kommen (es war keine Aktualisierung 
n&ouml;tig geworden), noch einige andere Meldungen, die f&uuml;r euch interessant 
sein d&uuml;rften:

* Die Deutsche Telekom hat die f&uuml;r 1999 geplante Geb&uuml;hrenstruktur bekannt 
gegeben, die jedoch noch von der Regulierungsbeh&ouml;rde abgesegnet werden 
muss. Demnach kosten Regio50-Gespr&auml;che in der Hauptzeit 24 Pfennig (pro 
Minute), in der Nebenzeit 12 Pfennig und nachts von 02.00 bis 05.00 Uhr 
(nur montags bis freitags) 6 Pfennig. Gespr&auml;che ab 50 km Entfernung sind 
f&uuml;r Besitzer von Analog-Anschl&uuml;ssen (also nicht ISDN) in der Hauptzeit 12 
Pfennig teurer, ansonsten gelten die Regio50-Tarife.
An den Ortstarifen &auml;ndert sich vorerst nichts, allerdings plant die Telekom 
nach eigenen Angaben einen g&uuml;nstigen Internet-Tarif.

* Viag Interkom hat einen Weihnachtstarif eingef&uuml;hrt: An allen Wochenenden 
bis Weihnachten sowie an den beiden Weihnachtsfeiertagen kostet eine 
Gespr&auml;chsminute &uuml;ber die Netzvorwahl 01090 nur 10 Pfennig, d.h. im Bereich 
ab 50 km Entfernung ist Viag an diesen Tagen zwischen 09.00 und 21.00 Uhr 
der g&uuml;nstigste Anbieter. &Uuml;brigens ist es nicht ausgeschlossen, dass diese 
Geb&uuml;hrenstruktur nach Weihnachten zum regul&auml;ren Tarif bestimmt wird.

* TelDaFax wird einen Weihnachts-/Silvestertarif einf&uuml;hren, der vom 
24.12.98 bis 03.01.98 durchgehend gilt. Dann sind &uuml;ber die Netzvorwahl 
01030 14 Pfennig pro Minute f&auml;llig, d.h. montags bis freitags (au&szlig;er am 
25.12.) ist TelDaFax dann zwischen 09.00 und 18.00 Uhr im Bereich ab 50 km 
Entfernung der g&uuml;nstigste Anbieter.

* Gute Nachrichten f&uuml;r Quix-Teilnehmer: Der Funkrufdienst wird vorerst doch 
weitergef&uuml;hrt, allerdings nicht mehr von o.tel.o, sondern von der Firma 
Herrmann.


Nun aber zu den Tabellen (alle Angaben ohne Gew&auml;hr):

G&uuml;nstigster Anbieter (ohne Anmeldung, Mindestgeb&uuml;hr, etc.) f&uuml;r Verbindungen 
innerhalb des Festnetzes:

Tag, Uhrzeit      | Bis 50 km Entfernung      |         Ab 50 km Entfernung
===========================================================================
    
Mo-Fr, 05.00-09.00  Talkline (01050), 9 Pfg.       Talkline (01050), 9 Pfg.
Mo-Fr, 09.00-18.00  Arcor (01070), 15 Pfg.        Mobilcom (01019), 19 Pfg.
Mo-Fr, 18.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Mo-Fr, 21.00-02.00  Arcor (01070), 7,5 Pfg.&sup2;       Talkline (01050), 9 Pfg.
Mo-Fr, 02.00-05.00  Deutsche Telekom, 6 Pfg.       Deutsche Telekom, 6 Pfg.

Sa/So, 05.00-09.00  Talkline (01050), 9 Pfg.       Talkline (01050), 9 Pfg.
Sa/So, 09.00-21.00  Arcor (01070), 11 Pfg.&sup1;       TelDaFax (01030), 14 Pfg.
Sa/So, 21.00-05.00  Arcor (01070), 7,5 Pfg.&sup2;       Talkline (01050), 9 Pfg.

&sup1;: Bei Verbindungen von bis zu 6 Minuten Dauer ist auf Grund der       
   Arcor-Verbindungsgeb&uuml;hr (s.u.) Viag Interkom (01090), 12 Pfg.,           
   g&uuml;nstiger.
&sup2;: Bei Verbindungen von bis zu etwa 2 Minuten Dauer ist auf Grund der     
   Arcor-Verbindungsgeb&uuml;hr (s.u.) Talkline (01050), 9 Pfg., g&uuml;nstiger.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 55,9 Pfg.!)


G&uuml;nstigster Anbieter (ohne Anmeldung, Mindestgeb&uuml;hr, etc.) f&uuml;r Verbindungen 
vom Festnetz in ein Mobilfunknetz:

Tag, Uhrzeit        |            gilt f&uuml;r alle Mobilfunknetze (0161x, 017x)
=========================================================================== 

Mo-Fr, 09.00-18.00                                  Viatel (01079), 73 Pfg.
Mo-Fr, 18.00-09.00                                  Viatel (01079), 36 Pfg.

Sa/So, 00.00-24.00                                  Viatel (01079), 36 Pfg.

(Zum Vergleich: Die Deutsche Telekom berechnet bis zu 137 Pfg.!)


Die Tabellen sollten im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Gespr&auml;chs- / Onlineminute f&auml;llig          
  werdende Betrag.

* An Feiertagen gilt der Samstag/Sonntag-Tarif.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf <a href="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</a> k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: <a href="http://www.teltarif.de/db/index.html">http://www.teltarif.de/db/index.html</a>


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax und Viag Interkom rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die das Gespr&auml;ch / die Online-Sitzung dauert.

* Dasselbe gilt im Prinzip auch f&uuml;r Arcor, blo&szlig; berechnet das Unternehmen   
  pro Gespr&auml;ch zus&auml;tzlich eine Verbindungsgeb&uuml;hr von 6 Pfg.

* Viatel berechnet bei Gespr&auml;chen bis 30 Sekunden Dauer die gesamten 30     
  Sekunden, danach wird exakt abgerechnet.

* Mobilcom rechnet minuten(un)genau ab, d.h. auch wenn das Gespr&auml;ch nur 5   
  Sekunden dauert, zahlt ihr 19 Pfg.

* Talkline verf&auml;hrt zwischen 21 und 9 Uhr ebenso, ansonsten wird in einem   
  10-Sekunden-Takt abgerechnet.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</pre>
<hr>
<a href="main.html"><img src="toc.gif" alt="CONTENTS" border=0></a><a href="workshops1.html"><img src="prev.gif" alt="PREV" border=0></a><a href="tests1.html"><img src="next.gif" alt="NEXT" border=0></a>
</body>
</html>
