<HTML>
<HEAD>
<meta name="description" content="CD-Test">
<meta name="author" content="Sieglinde Peters"
     <title>test AmigaOs-CD-Rom</TITLE>
</head>
<body>
  <body background="stucco.gif" text=black link=darkblue alink=green>
    <Font Color=red>
      <center>
      <img src="amoc.gif">
          <h1> Beschreibung der AmigaOS Leser-CD-Rom</h1>
    </Font Color=red>
       </center>
<Font Size=5>
Heute m&#246;chte ich mich  an einen CD-Rom-Test heranwagen. Da ich zum ersten Mal
so einen Test schreibe, erwartet bitte nicht zu viel von mir. F&#252;r Anregungen oder
Kritik w&#228;re ich aber sehr dakbar. Man kann daraus ja nur lernen.
Vorstellen m&#246;chte ich Euch die Erstausgabe der Leser-CD  von der Zeitschrift
AmigaOS.<BR><p>
In den Zeitschriften war die Inhaltsangabe der CD nur recht sp&#228;rlich. Darum habe
ich mit Herrn Raukamp von der Redaktion telefoniert, um  so etwas mehr &#252;ber die
Leser-CD zu erfahren.  Aber auch dort erhielt ich nur sehr wage Ausk&#252;nfte.<br>
Mutig, wie ich nun einmal bin, habe ich also einen Scheck an den Verlag geschickt
und nur wenige Tage sp&#228ter landete die CD-Rom in meinem Biefkasten.
Sie steckte in einem stabilen Umschlag, eine CD-H&#252;lle wurde nicht mitgeliefert.
Also ab damit ins Laufwerk!<br><p>
Mit knapp 500MB ist die CD nicht ganz gef&#252;llt.
Neben dem &#252blichen Assignfile  finde ich auch ein AmigaOS-Guide. Dort kann man
w&#228;hlen, ob man die Inhaltsbeschreibung im Amigaguideformat oder als HTML-
Datei lesen m&#246;chte.<br>  Mit der Guidedatei lassen sich fast alle Programme direkt
starten. Die HTML-Version bietet zu fast allen Programmen Informationen und
Screenshots. Das Layout ist &#228;hnlich dem der AmigaOS-Homepage.<hr>
<p><dt><a href=test1.gif><IMG SRC=frage2.gif></a> Bitte anklicken<p><hr>

Im Verzeichnis AmigaOS  findet man die versprochene Vollversion.<br>
Es handelt sich um den Datei-Manager RO1.27. Ein Programm, da&#223; an die
Anfangszeiten des Datei-Managers DOpus erinnert.<p><hr>
<p><dt><a href=ro.gif><IMG SRC=frage2.gif></a> Bitte anklicken<p><hr>

Im gleichen Verzeichnis ist noch ein Audiomitschnitt von der Amiga.Inc Konferenz.
Leider hat mich beim Versuch, die Sounddatei abzuspielen, mein Amiga
schmerzlich daran erinnert, da&#223; er dringend aufger&#252;stet werden mu&#223;.
 Nur die
Besitzer von schnellen Amigas werden also in den Genu&#223; der wichtigen Worte von
Dr. Havermose kommen.<br> Wenn man m&#246;chte, kann man auch den Amigauftritt in
der Sendung "Neues" des Senders 3Sat. erleben.<br><p>
Im Demoverzeichnis kann man sich &#252;ber Neuerscheinungen auf dem Amigamarkt
informieren. So gibt es z.B. eine Demoversion von AmigaWriter oder Wildfire 7.
Demoversionen von Spielen wie Monnbase oder OloFight findet man hier ebenso
wie die ersten Screenshots von Siedler2.<Br><p>
Im Sceneverzeichnis kommen die Grafik und Scenedemofans auf ihre Kosten.
Es gibt einige sch&#246;ne Demos zu bewundern . Am Besten gefiel mir ein Demo  von
R.E.L.I.C.<p><hr>
<p><dt><a href=test3.gif><IMG SRC=frage2.gif></a> Bitte anklicken<p><HR>
Ein Verzeichnis ist dem Thema "Online" gewidmet. Da findet man Programme zum
Mailen und Faxen und kleine Helferlein zum Erstellen von HTML-Seiten.  Auch das
von Wolf in der letzten NoCover beschriebene SelfHTML von Stefan M&#252;nz ist
vertreten.  Nicht unwichtig ist  ein Geb&#252;hrenmanager, der Eure Telefonkosten
&#252;berwacht. Man will ja schließlich nicht nur f&#252;r die Telekom arbeiten.
<br><p>
Musik gibt es auch auf der CD. Die j&#252;ngeren unter Euch werden von den
 Kl&#228;ngen
sicher etwas mehr erfreut sein als ich.  Ein MP3 Modul von Annex  mit ihrem
Amigasong ist wieder  nur von Besitzern schneller Amigas zu h&#246;ren.<br><p>
Tools aus dem Free-und Sharewarebereich sind auch vorhanden. Besonders m&#246;chte
ich da das Programm "ShapeShifter" erw&#228;hnen, das in der Version 3.10
 als Freeware
auf der CD zu finden ist. Meine Sreenshots geben Euch da vielleicht einen kleinen
Überblick über die weiteren Programme.<p><hr>
<p><dt><a href=test2.gif><IMG SRC=frage2.gif></a> Bitte anklicken <p><hr>
Mein pers&#246;nliche Bewertung.
Wer regelm&#228;&#223;iger Bezieher der Aminet-CD ist, wird  hier nicht viel
 neues finden.
Allerdings liegen hier die Programme nicht gepackter Form vor und k&#246;nnen meist
direkt von der CD gestartet werden.  Ob die Vollversion als Kaufanreiz interessant
genug ist, muß jeder f&#252;r sich entscheiden.
Mir fehlten Dateien oder Programme zu den in der Zeitschrift behandelten Themen
z.B. zum Arexx-Workshop oderPowerPC-Programmierung. Hier hat mir der Verlag
aber für zuk&#252;nftige CD-Roms Besserung versprochen.<br><p>
Sieglinde Peters

</Font Size=5>

<br>
<hr>
    <CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
  </body>
</html>






