<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Markus Thomaschewski">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [de] (Win98; I) [Netscape]">
   <TITLE>Last Exit</TITLE>
</HEAD>
<BODY BACKGROUND="steinmauer.gif">

<CENTER>
<H1>
<B>Es war einmal ..... <FONT COLOR="#FF0000">Es wird Zeit die Illussion
einiger bez&uuml;glich der Classic-Amigas zu zerst&ouml;ren!</FONT></B></H1></CENTER>

<DIV ALIGN=right>
<H5>
<B><FONT COLOR="#000000">"Hirn, Herr! Wir brauchen mehr Hirn!"</FONT></B></H5></DIV>

<HR SIZE=4 NOSHADE WIDTH="100%">
<P><FONT COLOR="#006600"><FONT SIZE=+1>Urspr&uuml;nglich sollte dieser
Text schon in der No Cover 59 erscheinen. Textpassagen die nachtr&auml;glich
eingef&uuml;gt wurden, sind in der selben Farbe wie dieser Textabschnitt
gehalten. Wolfgang Zimmer und Sieglinde Peters werden gegen Ende pers&ouml;nlich
angesprochen.</FONT></FONT>
<P>
<HR SIZE=4 NOSHADE WIDTH="100%">
<P><FONT SIZE=+1>Kollege Silvio brachte in der letzten Ausgabe wieder das
alte Thema "PC vs Amiga" auf den Tisch. Keine Sorge, ich will nicht das
Thema komplett neu aufrollen, aber dennoch etwas grunds&auml;tzliches dazu
sagen, da es indirekt auch das Thema "PPC vs MMC" ber&uuml;hrt.</FONT>
<P><FONT SIZE=+1>Wir haben verloren. Der Classic-Amiga hat verloren. Deshalb
finde ich es mutig von Silvio das Thema wieder zu bringen. Auch mein Herz
h&auml;ngt am Amiga. Er steht mir wesentlich n&auml;her als mein PC. Man
k&ouml;nnte meinen der Amiga hat eine Seele. Woran das liegt, ist mir zwar
nicht klar, aber die mei&szlig;ten Amiga-user empfinden so. Der Amiga wurde
schon als "Multimedia"-Computer konzipiert, lange bevor dieses &uuml;berstrapezierte
Modewort allen aus den Ohren hing.&nbsp; Das erkennt man an der Hardware-Architektur
und dem Betriebssystem, wodurch der Amiga auch sehr bedienerfreundlich
wurde. Das die Entwicklung seit Anfang der Neunziger so ziemlich zum Stillstand
kam (eigentlich schon seit Ende der 80er, noch unter Commodore!) und auch
dort sehr lange verharrte, ist kein Geheimnis.</FONT>
<P><FONT SIZE=+1>Der PC wurde als B&uuml;romaschine konzipiert und nicht
als Entertainment-Kiste. Aber der PC ist heutzutage dank stetiger Weiterentwicklung
eine eierlegende Wollmilchsau. Windows 95/98 ist zwar noch weit davon entfernt
ein perfektes Betriebsystem zu sein, ist aber auch l&auml;ngst nicht mehr
die Katastrophe wie es Windows 3.x noch war. Auch die Benutzerfreundlichkeit
des PC&acute;s hat deutlich zugelegt. Das Installieren von Software und
neuer Hardware l&auml;uft in aller Regel ziemlich problemlos ab. Auch im
Bereich Software klaffen Welten zwischen dem Amiga und dem PC. Beispiel:
W&auml;hrend wohl die mei&szlig;ten unter euch ihre HTML-Dokumente und
deren Tags m&uuml;hselig per Hand tippen, findet man auf vielen CDs, die
auf Computer-Zeitschriften, Lifestyle-Magazinen und manchmal sogar auf
TV-Zeitschriften kleben, kostenlose Browser wie Explorer und Netscape,
deren Amiga-Pendants dagegen teilweise wie "Kinderkacke" anmuten. Aber
das ist noch nicht alles: Netscape beinhaltet den WYSIWYG-Editor Composer,
der wirklich alle W&uuml;nsche erf&uuml;llt und sehr kompfortabel ist.
Und so ein Programm, wovon Amigauser nur tr&auml;umen k&ouml;nnen, bekommt
man f&uuml;r den PC kostenlos nachgeschmi&szlig;en! Das Preis-Leistungsverh&auml;ltnis
von PC-Hardware kann man ohne &Uuml;bertreibung als "gut" bis "sehr gut"
bezeichnen. Dein (Silvio) Preis-Beispiel stammt wohl noch aus &auml;lteren
Angeboten, oder? Du hast 3300 DM als Preis f&uuml;r folgende Ausstattung
angegeben: Pentium MMX/200, 32 MB Ram, 850 MB HD, 4x Speed CD-ROM.</FONT>
<P><FONT SIZE=+1>Mein PC hat vor etwa 3 Monaten keine 2000.- DM gekostet:
Pentium-II/350, 64 MB Ram, 6,4 GB HD, 32x Speed CD-ROM, 56K-Modem, Riva
128 (AGP-Grafikkarte mit 8 MB-Ram), 16-Bit-Soundkarte. Das bei diesem Preis
Tastatur, Maus, 3"5-Laufwerk, Win98, Word 97, Works 4.5 und nat&uuml;rlich
der Tower inklusive sind, brauche ich wohl nicht extra&nbsp; zu erw&auml;hnen!
Nein, ich schreibe dies nicht, um zu sagen: "B&auml;h, und der PC ist doch
besser!". Nein, ich m&ouml;chte nur eins klarstellen: Der Zug ist f&uuml;r
den Classic-Amiga abgefahren. Endg&uuml;ltig! Daran &auml;ndert weder ein
PPC-Prozessor was, noch eine Vodoo-I-Karte von 3Dfx!</FONT>
<P><FONT SIZE=+1>Selbst wenn es gelingt unseren betagten Rechner anhand
einer PPC-Karte in modernere Leistungsregionen zu pushen, mag das zwar
uns begeistern, aber die Computerwelt wird dies nicht sonderlich tangieren.
Der sicherlich immer noch vorhandene Vorteil eines schlanken und flexiblen
Betriebsystem ist nicht mehr so gro&szlig;, das es den normalen PC-user
die Nachteile des kleinen Amiga-Marktes (besonders das geringe und semi-professionelle
Soft-Angebot) in Kauf nehmen l&auml;&szlig;t. Sollte es AI wirklich schaffen,
einen neuen Amiga zu entwickeln, der die Bezeichnung "innovativ" verdient,
k&ouml;nnte der Amiga tats&auml;chlich die Aufmerksamkeit erregen, die
er verdient.</FONT>
<P><FONT SIZE=+1>Einem guten Freund von mir (friedlicher PC-user) habe
ich schon &ouml;fters was &uuml;ber den Amiga erz&auml;hlt und gezeigt.
Auch als Escom die PPC-Pl&auml;ne auf den Tisch legte, erz&auml;hlte ich
ihm das "<I><FONT COLOR="#FF0000">...endlich der Amiga mit dem PPC-Prozessor
soviel Leistung bringen werde, wie der schnellste aktuelle Pentium...</FONT></I>",
usw. usf. Doch doch, er h&ouml;rte interessiert zu. Als ich ihm vor wenigen
Monaten AI&acute;s Pl&auml;ne &uuml;ber den Next Generation-Amiga erz&auml;hlte,
war er so neugierig wie noch nie und l&ouml;cherte mich regelrecht nach
allen Details die ich ihm geben konnte. Erst vor wenigen Tagen fragte er
mich, ob es schon was Neues &uuml;ber den MMC-Amiga zu vermelden g&auml;be.
Ich glaube, das war das erste mal, wo er von sich aus das Thema Amiga angesprochen
hat! Wie viele technik-begeisterte PC-user, ist auch er an neuen und innovativen
Entwicklungen auf dem Markt stark interessiert. Unter anderem deswegen
setze ich mehr vertrauen auf eine komplette Neuentwicklung, anstatt auf
ein Update der Prozessoren!</FONT>
<P><FONT SIZE=+1>Wenn man bedenkt, wie lange der Amiga ohne nennenswerte
Weiterentwicklung auskommen mu&szlig;te und in welche Au&szlig;enseiter-Position
er deswegen abgerutscht ist (vom Marktf&uuml;hrer im Home-Computer-Bereich,
bis heute, wo er in der &Ouml;ffentlichkeit faktisch tot ist!) und dann
immer noch glaubt, es reiche f&uuml;r unseren Amiga aus, schnellere CPU&acute;s
zu benutzen, die gr&ouml;bsten Mankos aus dem Betriebsystem auszub&uuml;geln
(OS 3.5) und sich schon wie ein Honigkuchen &uuml;ber das angek&uuml;ndigte
Vodoo-I-Board freut, hat wohl ein kindliches Gem&uuml;t! Und wenn sie noch
nicht gestorben sind... <FONT COLOR="#006600">Nein, daf&uuml;r ist viel
zu viel Zeit ins Land gezogen, als das man alleine durch austauschen einzelner
Komponenten noch gro&szlig;artig verlorenes Terrain wieder gut machen k&ouml;nnte!</FONT></FONT>
<P><FONT SIZE=+1>&nbsp;Es ist vergebene Liebesm&uuml;h den Amiga mit den
PC zu vergleichen, und zu hoffen das der Amiga dabei als strahlender Sieger
hervorgeht. Das mag sich alles sehr resignierend anh&ouml;ren. Ja, was
die Classic-Amigas angeht, stimmt das auch: Diese Modelle sind nur noch
f&uuml;r Freaks (wie wir) und Nostalgiker wirklich interessant. In einen
NG-Amiga stecke ich hingegen gro&szlig;e Hoffnungen und Erwartungen, auch
wenn meine beinahe unb&auml;ndige Vorfreude einer etwas neutralen und abwartenden
Haltung gewichen ist. Nicht das jemand mich in den letzten Diskussions-Beitr&auml;gen
mit Argumenten zum Zweifler bekehrt h&auml;tten.</FONT>
<P><FONT SIZE=+1>&Uuml;brigens, ich habe an der Diskussion nicht mehr teilgenommen,
weil ich fand, das die Diskussion immer mehr auf "Nebenkriegschaupl&auml;tzen"
ausgetragen wurde. Zu welchen Termin nun der neue Amiga k&auml;mme, wieviel
er genau kosten w&uuml;rde, ob die angek&uuml;ndigten Leistungsmerkmale
nun wirklich so kommen, usw., usf. Kommt Zeit - kommt Rat! Aber zu zwei,
drei Stichpunkten m&ouml;chte ich mich doch noch &auml;u&szlig;ern:</FONT>
<P><FONT SIZE=+1><U><FONT COLOR="#000099">PPC als Zwischenl&ouml;sung:</FONT></U>
Nat&uuml;rlich ist das in erster Linie abh&auml;ngig vom finanziellen Background
jedes Einzelnen, aber nicht gerade billige PPC-Boards allgemeing&uuml;ltig
als Zwischenl&ouml;sung zu bezeichnen, ist mehr als gewagt! Eins ist doch
sicher: es wird kein zukunftstr&auml;chtigen Markt geben, wo PPC- und MMC-Amigas
nebeneinander in Eintracht existieren k&ouml;nnen. Also, die PPC-Zukunft
ist nicht gew&auml;hrleistet. Hinzu kommt das die Mutterfirma sich eh f&uuml;r
das MMC-Projekt entschieden hat. Wie auch immer der Amiga der Zukunft aussehen
wird, oder ob es in der Zukunft &uuml;berhaupt noch einen Amiga geben wird:
die unwahrscheinlichste Variante von allen ist, das es ein PPC-Amiga sein
wird! Ein Amiga mit PPC-Board wird dann wirklich eine Zwischenl&ouml;sung
im wahrsten Sinne des Wortes: Ein L&uuml;ckenf&uuml;ller zwischen Classic-Amigas
und der neuen Generation von Amigas, aber ohne eigene Zukunft! Kann man
wirklich immer noch PPC als Zwischenl&ouml;sung f&uuml;r jeden Amiga-user
empfehlen?!</FONT>
<P><FONT SIZE=+1><U><FONT COLOR="#000099">Commodore vs Gateway:</FONT></U>
Ich will wirklich nicht Commodore nachtr&auml;glich noch schlecht machen,
denn die Sache ist wirklich "gestorben". Aber ich finde es nicht normal,
wenn man auf einmal anf&auml;ngt die Vergangenheit romantisch zu verkl&auml;ren
und Commodore als Beinah-Heilige hinstellt und im gleichen Atemzug AI unter
Gateway so vehement verteufelt! Commodore hat &uuml;brigens nicht den Amiga
entwickelt, sondern den Amiga von der gleichnamigen Entwickler-Firma gekauft
und ver&ouml;ffentlicht. Was aber auch stimmt, ist das Commodore den Amiga
verrecken hat lassen! Vielleicht w&auml;re der Amiga mit einer anderen
Firma besser gefahren. =( Commodore hat sozusagen stark angefangen und
stark nachgelassen. Gateway hat schwach (passiv) angefangen und scheint
endlich in die G&auml;nge zu kommen. Wie die Gateway-Geschichte weitergeht
wird man noch sehen, jedenfalls zeigen sie Initiative: Sie investieren
mit Mut, Elan und Entschlossenheit in die Zukunft des Amigas und machen
etwas, was schon l&auml;ngst &uuml;berf&auml;llig war! Sie entwickeln endlich
einen komplett neuen NG-Amiga! Riecht ihr das nicht? die Classic-Amigas
modern schon seit geraumer Zeit!</FONT>
<P><FONT SIZE=+1><U><FONT COLOR="#000099">Zweck des Dreamcast-Vergleichs:</FONT></U>
Der Hauptpunkt war folgender: F&uuml;r die Leistungsmerkmale eines Computersystems
oder einer Konsole sind der Prozessor und die Grafikchips ausschlaggebend.
Auch sind diese Hardwarebausteine nicht gerade unwichtig was den k&uuml;nftigen
Preis der neuen Hardware betrifft. Dies betrifft besonders Konsolen, da
hier auf unn&ouml;tige Zusatzhardware verzichtet werden kann. Dennoch haben
viele daran gezweifelt, das man zu einem Preis von knapp 500 DM (in Japan
wird das DC f&uuml;r umgerechnet 375 DM verkauft!) eine Konsole mit den
Leistungsdaten des Dreamcast verwirklichen kann. Was lernen wir im Bezug
auf den MMC-Amiga daraus? Wenn AI bei der Grundausstattung eines MMC-Amigas
"behutsam" vorgeht, wird es durchaus m&ouml;glich sein, f&uuml;r unter
2000 DM einen Amiga mit den angek&uuml;ndigten Leistungsmerkmalen zu produzieren!
Schlie&szlig;lich werden ja keine Intel-Chips oder andere handels&uuml;bliche
Prozessoren und Chips verwendet. Es macht also keinen Sinn, mit einem Stift
und Zettel bewaffnet irgendwelche Preislisten bekannter PC-Hardware durchzuackern
und zu glauben, man k&ouml;nnte selber einen Computer f&uuml;r 1500 DM
zusammen basteln, der in etwa den angek&uuml;ndigten Daten von AI entspricht!
Da man dies nun wirklich nicht kann, hei&szlig;t es aber lange noch nicht,
das es AI auch nicht gelingen wird!</FONT>
<P><FONT SIZE=+1>Das meinte ich auch mit dem "gro&szlig;kotzigen" Gehabe
in Sachen Hardwarewissen: Nur weil es sich so ein Schlumpf nicht vorstellen
kann, weigert er sich auch aus trotz und &Uuml;berheblichkeit daran zu
glauben. Es soll sogar welche geben, die nur an das glauben was sie sehen...
Und was ist mit dem Wind? Was ist mit Strom? Was ist mit Magnetismus? Was
ist mit der Erdanziehungskraft? Was ist mit...</FONT>
<P><FONT SIZE=+1>Nat&uuml;rlich wird man darauf erwiedern, das man deren
Existens beweisen kann, anhand deren &uuml;berpr&uuml;fbaren Auswirkungen.
Den Wind sp&uuml;rt man und kann ihn auch an den Wellen oder dem rauschen
der B&auml;ume erkennen. Wenn er stark ist, kann man ihn sogar ohne Probleme
h&ouml;ren. Man kann seine St&auml;rke und seine Richtung messen, aus der
er kommt. Dasselbe in Gr&uuml;n mit dem Strom: Fa&szlig; mal in eine Steckdose!
Man kann dessen Existens auf verschiedene Arten beweisen. Genauso verh&auml;lt
es sich mit dem neuen Amiga und das OS 5.0: Die Entwicklung ist offiziell
bekanntgegeben, die Eckdaten ebenso und man wird regelm&auml;&szlig;ig
auf den aktuellen Stand der Entwicklungen gebracht. Nat&uuml;rlich kann
man nicht w&ouml;chentlich mit spektakul&auml;ren News rechnen. Und eines
Tages wird man seine Hand an das neue Ger&auml;t legen k&ouml;nnen. Bis
dahin mu&szlig; man sich halt noch etwas gedulden</FONT>
<P><FONT SIZE=+1>&nbsp;Wer dann immer noch meint, er, respektive man(n),
wisse rein gar nichts &uuml;ber das MMC-Project, hat entweder die letzten
Monate 2-Meter tief unter der Verbracht oder er ist ein Ignorant der &uuml;belsten
Sorte. Ich ha&szlig;e solche Typen! Selbst wenn mir bestimmte Dinge nicht
passen (besonders im politischen Bereich), nehme ich deren Existens dennoch
mit Z&auml;hneknirschen zur Kenntnis und akzeptiere sie! Es w&auml;re mir
peinlich bei einer Diskussion unangenehme Tatsachen wider besserem wissens
zu leugnen!</FONT>
<P><FONT SIZE=+1>Sorry, das waren harte Worte, aber sie waren meiner Meinung
nach Verdient!</FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Klar, wir Amigauser haben in den
letzten Jahren gesehen wie sich viele Versprechungen und Hoffnungen in
Luft aufl&ouml;sten. Wir Amigauser haben tats&auml;chlich keinen Grund
naiv und allesglaubend jedes Versprechen als bahre M&uuml;nze zu nehmen.
Das ist wahr! Aber auch das Gegenteil ist nicht angebracht: Niemanden &uuml;berhaupt
noch was zu glauben - alles grunds&auml;tzlich als "leere Versprechen"
abzutun! Inwieweit AI unter Gateway ihr Wort halten wird man erst noch
sehen. Aber Fakt (!!!) ist:</FONT></FONT>
<OL>
<LI>
<FONT COLOR="#006600"><FONT SIZE=+1>Das OS 3.5 wird derzeit au&szlig;er
Haus (Haage&amp;Partner) entwickelt!</FONT></FONT></LI>

<LI>
<FONT COLOR="#006600"><FONT SIZE=+1>AI entwickelt zur Zeit einen neuen
Amiga (Hardware &amp; OS 5.0)</FONT></FONT></LI>
</OL>
<FONT COLOR="#006600"><FONT SIZE=+1>Ob nun die angek&uuml;ndigten Daten
(Leistung, Preis, ...) zu 100% eingehalten werden, kann Niemand zur Zeit
definitiv wissen! Wof&uuml;r ich "k&auml;mpfe" und weshalb ich mich eigentlich
an dieser Diskussion so ausf&uuml;hrlich beteilige, ist das Konzept...,
die Idee..., das Vorhaben... von AI! Deswegen reg(t)e ich mich auch so
&uuml;ber Kommentare auf, wie "</FONT>...alles Quatsch! ...wird eh nicht
kommen! [der MMC-Amiga] ...wird ein Mega-Flop, ...wird nicht die versprochene
Leistung bringen, ...wird wesentlich teurer sein, ...wird beim erscheinen
technisch veraltet sein!<FONT SIZE=+1>", usw usf. Woher wollt ihr das so
sicher wissen? Ok, vielleicht wird der neue Amiga nicht Ende `99 zu einem
Preis von etwa 1500.- DM zu haben sein und meinetwegen auch nicht drei
MPEG-2-Videos gleichzeitig ruckelfrei abspielen k&ouml;nnen - sondern wird
erste Mitte 2000 auf den Markt kommen, zu einem Preis von 2500.- DM und
auch nur maximal zwei MPEG-2-Videos gleichzeitig abspielen k&ouml;nnen
- es &auml;ndert aber nichts an der Tatsache, diese diese Daten f&uuml;r
einen Amiga aus heutiger Sicht trotzdem FANTASTISCH sind und PPC-Daten
locker toppen! Fakt ist, das die angek&uuml;ndigten Daten in allen Bereichen
mehr als ausgezeichnet sind und eine Rundumerneuerung des in die Tage gekommenen
Amigas darstellen!</FONT></FONT>
<P>
<HR SIZE=4 NOSHADE WIDTH="100%">
<P><FONT COLOR="#006600"><FONT SIZE=+1>Noch ein paar Worte &uuml;ber einige
sehr gesch&auml;tzte, &auml;ltere Clubmitglieder. Man sagt ja, das Alter
mache Weise. Zumindest mache das Alter ausgeglichener und man ist wohl
nicht mehr so "hippelig" oder so wechselhaft in seinen Ansichten. Man sei
"gereift". Aber dennoch verwundern mich gewisse Ansichten. Wolfgang Zimmer
zum Beispiel, meinte vor einigen Ausgaben, er s&auml;he die Zukunft des
Amigas alleine im unaufh&ouml;rlichen Aufr&uuml;sten des Users. Ich bin
zwar erst 26, habe aber sofort beim lesen unweigerlich den Kopf gesch&uuml;ttelt.
Das ist weniger eine Frage der pers&ouml;nlichen Ansichten, sondern eher
eine Frage der Vernunft. Lieber Wolfgang, wieso h&auml;ngst Du so an dem
Amiga?! W&auml;re der PC nicht f&uuml;r Dich die bessere Wahl? Dort werden
Schw&auml;chen des Betriebsystem durch aufgebl&auml;hte Updates "verbessert".
Dort werden Schw&auml;chen in der Hardware-Architektur durch schnellere
Bauteile "ausgebessert"! Es geht jetzt weniger um Detailfragen, sondern
um den Ansatz an sich. Ich bin Multiformat-User und mein Herz h&auml;ngt
am Amiga. Und das nicht ohne Grund!</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Der Amiga ist anders. Er funktioniert
anders. Er ist kein Konklumerat aus irgendwelchen 08/15-PC-Bauteilen. Okay,
das mag jetzt alles ziemlich pathetisch klingen, ist aber ernstgemeint.
Schnelle Zusatzboards, Grafikarten- und Soundkarten-Addons, die die veralteten
Ur-Chips des Amigas ersetzen, unterst&uuml;tzen oder gar &uuml;berbr&uuml;cken
sind der absolut falsche Weg. Was die Einzigartigkeit des Amigas ausmacht
und weshalb wir ihn doch alle lieben, ist das Grundkonzept die hinter dem
Amiga steckt. Inzwischen stimmt nur noch das Konzept, die Technik ist total
veraltet. Wenn die Fantasie und Visionen fehlen, ist der Versuch schwere
Mankos halbwegs mit Updates auszub&uuml;geln und das "herumdoktern" an
einer Hardware aus der Vergangenheit, wohl der einfachste Weg.</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Wie bereits gesagt bin ich ein Multiformat-user
und beobachte nicht nur den Amiga-Markt. Mal von Intel und Microsoft abgesehen,
die von ihrem Megaerfolg anscheinend &uuml;berfressen sind, wird in der
Technikwelt in naher Zukunft geklotzt und nicht gekleckert. Es stehen in
vielen wichten Bereichen Quantenspr&uuml;nge bevor und das, was recht viele
von euch f&uuml;r den Amiga als erstrebenswert halten ist im Licht der
Wirklichkeit - L&Auml;CHERLICH - !!!</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Wir brauchen einen komplett neuen
Amiga. Dieser wird dann nat&uuml;rlich bei Zeiten auch aufger&uuml;stet,
aber dann macht es Sinn. Keinen Sinn macht es, eine faktisch tote Hardware
mit L&ouml;sungen aus der PC-Welt halbwegs am Leben zu erhalten. La&szlig;t
den Classic-Amiga in Frieden sterben - Rest in peace, my love!!!</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Der K&ouml;nig ist tot - es lebe
der K&ouml;nig!</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Jetzt zu Siegelinde Peters, die
k&uuml;rzlich geringsch&auml;tzig meinte "Au&szlig;er einer superteuren
Uhr, handsigniert von Petro Tyschtschenko, und einer Popgruppe hat Amiga
Inc. noch nichts brauchbares zu Stande gebracht". Streng genommen hast
Du recht, Sieglinde. Diesen neuen "Super-Amiga" gibt es noch nicht zu kaufen.
Auch habe ich ihn noch nicht, wie wohl auch Du - noch nicht in Aktion gesehen.
Ob wir jetzt einer Meinung sind?! Hmm, glaube ich weniger. Wenn von AI
die Rede ist, verneige ich mich ehrfurchtsvoll (nur sinnbildlich nat&uuml;rlich!),
Du spuckst ihnen wahrscheinlich eher vor die F&uuml;&szlig;e (nat&uuml;rlich
auch nur sinnbildlich!). Vielleicht interpretiere ich in diesen Satz zu
viel hinein, aber ich habe andere Ausf&uuml;hrungen und Kommentare von
Dir noch wage in Erinnerung, die dieses Res&uuml;mee zulassen.</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Meine Bitte: Respektiere die Bem&uuml;hungen
seitens AI und wertsch&auml;tze sie! Ich wei&szlig; nicht wie lange Du
einen Amiga hast und inwieweit Du die (Leidens-)Geschichte des Amigas kennst,
aber Tatsache ist wohl, das seit fast zehn Jahren (!) nicht mehr mit diesem
Ehrgeiz und diesen Zielen der Amiga weiter entwickelt wurde! Da, besonders
f&uuml;r die Computerwelt, viele Jahre lang nichts wesentlich weiter entwickelt
wurde, reichte es AI nicht mehr - und das v&ouml;llig zurecht! - die Classic-Amigas
zu "renovieren", sondern es war an der Zeit eine v&ouml;llig neue Generation
von Amigas zu erschaffen. Das Endresultat kennen wir noch nicht, aber diese
Bem&uuml;hung verdient unseren Respekt und nicht unseren Hohn!</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Als AI unsere Amigas als "Classic-Amigas"
klassierte - gab es ein Aufschrei! Und das ist symptomatisch: AI sieht
der Realit&auml;t ins Gesicht und stuft den (derzeitigen) Amiga richtig
ein. Ein Gro&szlig;teil der Amiga-Fan-Gemeinde will das nicht wahrhaben.
Haben AI keinen Respekt vor dem Amiga, weil sie das taten? Ist er ihnen
v&ouml;llig egal? Nein, sonst w&uuml;rden sie sich nicht diese M&uuml;he
mit dem neuen Amiga machen. AI erkennt zurecht, das der "Classic-Amiga"
inzwischen viel zu veraltet ist und nicht mehr als Basis eines neuen Amigas
dienen kann, und geben deswegen die Entwicklung eines komplett neuen
Amigas bekannt: Oh man, was f&uuml;r ein Aufschrei! Sicher, die erste (unplanm&auml;&szlig;ige)
Ank&uuml;ndigung ging in die Hose und brachte ein gro&szlig;es Mi&szlig;verst&auml;ndnis
hervor. Aber selbst als es aufgekl&auml;rt war und die Eckdaten bekannt
waren, ging das elende jammern weiter! <I>Born loser</I>.</FONT></FONT>
<P><FONT COLOR="#006600"><FONT SIZE=+1>Was ich daraus gelernt habe? Um
so lauter ihr jammert - um so sicherer kann ich mir sein, das AI gerade
das Richtige macht!</FONT></FONT>
<P><FONT SIZE=+1>Manchmal sind Diskussionen wirklich sinnlos und f&uuml;r
die Katz. Abwarten und Tee trinken. Mal sehen was die Zukunft uns bringt
und wer am Schlu&szlig; recht behalten hat!</FONT>
<BR>&nbsp;
<HR><P>
<CENTER><B><H1><FONT COLOR=RED>
<A HREF="nocover.html"> « Zurück zum Inhaltsverzeichnis der No Cover » </FONT></A>
</CENTER>
</BODY>
</HTML>