<HTML>
<HEAD>
<TITLE> SCSI und mehr </TITLE>
<META NAME="Unterschiede der SCSI-Standards" CONTENT=
"scsi,uwscsi,ide,at,ide,hdd,festplatte,ata,eide,festplatten"
</HEAD>
<BODY BACKGROUND=scsi.png TEXT=black link=blue alink=red bgcolor=white>

<P><CENTER><H1> IDE, SCSI, SCA - Wer blickt noch durch? </H1></CENTER> </P>
<P>
Fr&uuml;her war alles leichter. Man kaufte sich einen
Festplattencontroller und st&ouml;pselte seine Platte dran. Der Standard
nach dem sie funktionierte hie&szlig AT. Sp&auml;ter sprach man von
IDE oder von EIDE, aber was es hie&szlig; war egal, da alles passte.
</P><P>
Anfangs unterschieden sich Festplatten nur nach ihrer Kapazit&auml;t.
Sie hatten entweder 10 oder 20 MB. Mit der Zeit kamen dann noch
40-MB-Platten hinzu. <BR>
Dann tauchten Begriffe wie VH und HH auf. VH stand f&uuml;r normale
H&ouml;he und HH f&uuml;r halbe H&ouml;he. VH-Festplatten sind heute
nicht mehr auf dem Markt und HH-Festplatten nennt man heute etwas
komplizierter 5,25&quot;-Platten. Diese Platten wurden weiter
verkleinert, so dass heute vor allem 3,5&quot;-Platten auf dem Markt
sind. Noch kleinere Platten gibt es auch: 2,5&quot; und 2&quot;
</P><P>
Die IDE-Anschl&uuml;sse der 3,5&quot;- und der 5,25&quot;-Platten
unterscheiden sich nicht. Nur die 2,5&quot;- und die 2&quot;-Platten
weichen davon ab, da bei ihnen die Stromversorgung &uuml;ber das
Flachbandkabel abgewickelt wird.
</P><P>
1986 wurde etwas neues ver&ouml;ffentlicht: der SCSI-Standard. <BR>
Die wesentliche Neuerung an diesem Standard ist die Entlastung der
CPU. Bei IDE muss sie der Platte sagen:&quot;Bewege Lesekopf zu
Block x und lese bis Block y!&quot; Unter SCSI sagt sie:&quot;
Lade Datei xyz!&quot;, den Rest erledigt die Festplatte
eigenst&auml;ndig. <BR>
Statt eines IDE-Controllers sitzt ein SCSI-Hostadapter an der Stelle
und jede Platte hat einen SCSI-Controller eingebaut. <BR>
Waren unter IDE nur zwei bzw. vier Ger&auml;te pro Controller
m&ouml;glich, so sind es nun pro Hostadapter 7 bzw. 14 und jedes
Ger&auml;t kann sich nochmal in 8 verschiedene Ger&auml;te
aufteilen, die alle unabh&auml;ngig voneinander angesprochen werden
k&ouml;nnen.
</P><P>
Der 1986 definierte SCSI-Standard ist heute unter <STRONG>SCSI-1</STRONG> bekannt.
Der externe Standard-Stecker ist der 50 polige Centronics-Stecker. Da
Macs stattdessen einen 25 poligen SubD-Stecker haben, gibt es
verschiedene Ger&auml;te, die diese Buchsen statt der Centronics-Buchsen
haben. Ein Beispiel sind die Zip-Drives.
Der interne Stecker ist der 50 polige Pfostenstecker.
Die Datenbusbreite betr&auml;gt 8 Bit und es k&ouml;nnen 7 Ger&auml;te
an den Hostadapter angeschlossen werden.<BR>
Man kann SCSI-1 (und SCSI-2) im &quot;Single Mode&quot;  oder im &quot;Differential
Mode&quot; betreiben. Im Single-Mode darf die SCSI-Busl&auml;nge maximal
6 m betragen (SCSI-Bus = Kabel vom Hostadapter bis zum Terminator).
<BR>
Im Differential-Modus darf die L&auml;nge 25 Meter betragen. Die
Datensicherheit wird erreicht, da jedes Signal auf zwei Leitungen
&uuml;bertragen wird.
</P><P>
Sobald SCSI-1 ver&ouml;ffentlicht wurde, begann man mit der Entwicklung
von <STRONG>SCSI-2</STRONG>. Mit dem neuen Standard kamen verschiedene externe
Steckverbindungen hinzu:
</P>
<UL>
<LI> 50 poliger Mini-Centronics
<LI> 50 poliger Mini-SubD
<LI> 50 poliger SubD
</UL>
<P>
SCSI-2 kann man in drei Standards unterteilen: </P>
<UL>
<LI> <B>Standard SCSI-2 </B> Keine Ahnung, wo der Unterschied zu SCSI-1 liegt.
<LI> <B>Fast-SCSI-2     </B> Die Daten&uuml;bertragung verl&auml;ft doppelt so schnell. Im Differential-Modus sind 16 Bit Datenbusbreite m&ouml;glich.
<LI> <B>Wide-SCSI-2     </B> hat 16 oder 32 Bit breiten Datenbus, verwendet 68 polige Stecker (SCSI-3-Standard), ist 4x so schnell wie Fast-SCSI.
</UL>
<P>
Wie unter Wide-SCSI schon erw&auml;hnt, gibt es den <STRONG>SCSI-3-Standard</STRONG>.
An einen SCSI-3 Hostadapter kann man bis zu 14 Ger&auml;te
anschlie&szlig;en. Als interne Stecker werden 68 polige Mini-SubD-Stecker
verwendet. Diese werden auch extern verwendet. Extern kommen aber auch
68 polige Mini-Centronics-Stecker zum Einsatz. Bei diesen Kabeln muss
man vorsichtig sein, da diese in P-Kabel und Q-Kabel unterschieden
werden. Die P-Kabel sind f&uuml;r 16 und 32 Bit geeignet, w&auml;hrend man
die Q-Kabel nur f&uuml;r 32 Bit verwenden kann.<BR>
Fragt mich bitte nicht, wo der Unterschied zwischen SCSI-3 und Wide-SCSI-2
liegt.
</P>
<P>
Was alle diese SCSI-Standards gemeinsam haben ist, dass sie terminiert
werden m&uuml;ssen. Das bedeutet, dass etwas vorhanden sein muss, das
die Spannung auf 2,85 V h&auml;lt. Dies geschieht durch einen Terminator.
Dieser kann in einem SCSI-Ger&auml;t eingebaut sein und mit einem Schalter
ein und ausgeschaltet werden. Diese Terminatoren sollten alle abgeschaltet
sein au&szlig;er der des letzten Ger&auml;tes. Hat man kein Ger&auml;t mit
eingebauten Terminator, dann kann man sich Terminatoren kaufen. Dabei
werden aktive und passive unterschieden. Die passiven Terminatoren
enthalten einen Spannungsteiler, der die Spannung auf ca. 3V h&auml;lt.
Die aktiven enthalten einen Spannungsregler, der die Spannung auf exakt
2,85V h&auml;lt. Aktive Terminatoren sorgen daher f&uuml;r eine bessere
Datensicherheit und sollten bei l&auml;ngeren SCSI-Bussen den passiven
vorgezogen werden.
</P><P>
Die Standards sind untereinander kompatibel bzw. es gibt Adapter um die
unterschiedlichen Stecker und Buchsen miteinander verbinden zu
k&ouml;nnen. Solltet ihr euch selbst einen Adapter basteln wollen, so
m&uuml;sst ihr folgendes bedenken: Ihr habt z.B. einen SCSI-Hostadapter
mit 68 poligen Ausgang und wollt daran eine Festplatte mit 50 poligen
Buchsen anschlie&szlig;en. Diese Festplatte hat einen eingebauten
Terminator. Es reicht nun nicht, dass ihr die Dr&auml;hte, die ihr f&uuml;r
diese Platte braucht durchleitet und mit dem Terminator der Platte
terminiert. Ihr m&uuml;sst euch zus&auml;tzlich einen Terminator basteln,
der die vorderen 8 Datenbits terminiert, die in dem selbstgebastelten
Adapter enden. Kauft ihr euch einen solchen Adapter, so ist je nach
Qualit&auml;t ein Terminator eingebaut.
</P>
<P>
<STRONG>SCA</STRONG> basiert auf SCSI-3. Der wesentliche Unterschied besteht darin, dass
man die Ger&auml;te wie beim IDE-Bus anschlie&szlig;en kann und nicht
durch jedes Ger&auml;t gehen muss. Im Klartext: Bei den
SCSI-Ger&auml;ten wird jeweils nur eine Buchse belegt. Eine Terminierung
wird nicht ben&ouml;tigt und die SCSI-IDs fallen auch weg. Es wird UWSCSI
unterst&uuml;tzt. Es sind maximal 15 Ger&auml;te m&ouml;glich. <BR>
Wenn ich es richtig verstanden habe, muss man nur einen SCA-Adapter in
den SCSI-Bus stecken und an Strom anzuschlie&szlig;en und schon hat man
einen SCA-Bus. Die SCA-Stecker sind 80 polige Mini-Centronics.


</P><P ALIGN=RIGHT>
<A HREF="mitglieder/steffens.html">
<IMG SRC=umo.gif WIDTH=84 HEIGHT=41 BORDER=0 ALT="UMO - Thomas Steffens"> </RIGHT>
</A> </P>
<P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
