<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>

<body background="wol1.jpg" text=black link=blue alink=red bgcolor=gray>
<a name="top"></a>
<p>
<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul>
<li><a href="#a1"><b>f&uuml;r Daniel Stein</a></b></li>
<li><a href="#a2"><b>f&uuml;r Sieglinde Peters</a></b></li>
<li><a href="#a3"><b>f&uuml;r Henning Wolf Knopp</a></b></li>
</ul>
<br><br>
<p>
<a name="a1"><font size="+2">Gr&uuml;&szlig; Dich Daniel</font></p>

<p><font size="+1"> Eigentlich wollte ich Dir auf Deinen Artikel &raquo;Amiga
&amp; NoCover&laquo; per E-Mail antworten, dann habe ich mir aber gesagt, dann
h&auml;tten wir ja wieder einen Artikel weniger in der NoCover. So bekommst Du
einen Leserbrief und diesen etwas ausf&uuml;hrlicher als eine E-Mail.</p>

<p>Bevor ich etwas detaillierter auf Deinen Artikel eingehe, m&ouml;chte ich
doch den etwas versteckten Vorwurf an meine Adresse bez&uuml;glich der
Konzentrierung mehrerer Artikel in meiner Wolf-INFO entkr&auml;ften. Dieses
Miniatur-Magazin soll mehr oder weniger so etwas wie eine Laberecke darstellen.
Das habe ich doch schon in der zweiten &Uuml;berschrift definiert, dass hier nur
Nachrichten und Statements enthalten sind. Zu meinen bisherigen
10&#160;Wolf-INFO's sind in der gleichen Zeit von mir 8&#160;Artikel,
7&#160;CD-Besprechungen, 3&#160;Workshops, 1&#160;DFUe-Artikel,
3&#160;Tools-Tests und 4&#160;Leserbriefe erschienen. Aus diesem Grunde verstehe
ich Deinen Vorwurf nicht, ich sollte anstelle der Konzentrierung in Wolf-INFO
aus diesem Stoff mehrere einzelne Artikel machen. Ich bin der festen
&Uuml;berzeugung, dass mein von mir eingeschlagener Weg f&uuml;r mich die beste
L&ouml;sung und auch soetwas wie mein Wahrzeichen ist.<p>

<p>Deinen gesamten Artikel hast Du ja den Neuank&ouml;mmlingen gewidmet und hast
diese direkt angesprochen, sie m&ouml;gen doch bitte an der inhaltlichen
Gestaltung der NoCover mithelfen und gibst gleich viele Anregungen. Aber um
eines bitte ich Dich inst&auml;ndig, gib keine falschen Anregungen zur Benutzung
von HTML-Tags. Das Tag &lt;Hx&gt; ist ein reinrassiger
Fontgr&ouml;&szlig;enaufruf f&uuml;r eine &Uuml;berschrift und nicht f&uuml;r
die Textgestaltung. Das Tag &lt;/Hx&gt; bewirkt ein Breaksignal also einen
Zeilenumbruch. Also sind hier &lt;p&gt; &lt;/p&gt; und &lt;br&gt; v&ouml;llig
&uuml;berfl&uuml;ssig. F&uuml;r die Fontbenutzung innerhalb des Textes gibst Du
dann die Anweisung &lt;font size=&quot;+1&quot;&gt; und am Ende des Textes
lautet es dann &lt;/font&gt;. Nat&uuml;rlich kann auch die direkte
Fontgr&ouml;&szlig;e angegeben werden, man muss nur wissen, dass die
Standardgr&ouml;&szlig;e &lt;font size=&quot;3&quot;&gt; ist.
Selbstverst&auml;ndlich musst Du auf die Abh&auml;ngigkeit weiterer Tags
innerhalb des Textes achten und den Font ein- und ausschalten. Wof&uuml;r gibt
man sich eigentlich die M&uuml;he und schreibt Workshops f&uuml;r das Handling
mit HTML. Da bin ich mit Verlaub gesagt ein ganz kleines bisschen sauer.</p>

<p>In diesem Zusammenhang m&ouml;chte ich Dir gerne noch sagen, dass die
Anweisung &lt;pre&gt; eine Formatierung mit diktengleicher Schrift ist. Im
Regelfalle werden von den Browsern der Font Courier 13 herangezogen. Die gleiche
Wirkung erh&auml;lst Du auch mit der Anweisung &lt;tt&gt;</font><tt> und die
Schrift wird mit dem im Browser eingestellten Font geschrieben, egal wie die
Anweisung &lt;font=..&gt; gelautet hatte.</tt><font size="+1">&lt;/tt&gt; Das
war ein kurzer Ausflug in die Gestaltungsm&ouml;glichkeit mit diktengleichem
Font. Also ist das Tag &lt;pre&gt; auch nicht immer das g&uuml;nstigste. Wenn
wir uns im Sommer in Velmar treffen, erinnere mich an diesen Leserbrief und ich
zeige Dir Deinen Artikel in der NC-61 auf einem Bildsschirm 800*600 mit dem
Browser IBrowse. Du wirst wahrscheinlich erschrecken und das Tag &lt;pre&gt;
f&uuml;r eine Gesamtartikelgestaltung vergessen. Auf einem Bildschirm 1280*1024
ist Dein Text fast nicht mehr lesbar und bei Usern mit 1600*1200 hilft noch
nicht mal eine Lupe mehr, wenn in Prefs des Browsers die Fontgr&ouml;&szlig;e
nicht ge&auml;ndert worden ist.</p>

<p>Nun noch ein paar Worte zum weiteren Inhalt Deines Artikels:
<blockquote><i></font>
.... aber so wie es jetzt ist, kann es nicht weitergehen!<br><br>
Habt Ihr schoneinmal die &auml;lteren Ausgaben der NoCover gesehen?
DAS waren Zeiten, dass kann ich Euch sagen... Es ging dem Amiga-Markt
um L&auml;ngen schlechter, als es ihm heute geht und die Zahl der User
war angeblich so niedrig wie nie.
</i></blockquote><font size="+1">
Daf&uuml;r k&ouml;nnen wir die Neuzug&auml;nge nicht verantwortlich machen. Da
sollte sich jeder selber an die eigene Nase fassen. Es ist bekannt, dass im
Fr&uuml;hjahr die wichtigen Klausuren anstehen, Abiturienten und Vorabiturienten
stehen im Dauerstress und schwache Sch&uuml;ler m&uuml;ssen sehen, dass bis zum
Sommer die F&uuml;nfen vom Januarzeugnis ausgeb&uuml;gelt werden. Da bleibt halt
nicht viel Zeit, Artikel f&uuml;r die NoCover zu verfassen. Aber es ist doch
verflixt mal kein allzu gro&szlig;es Problem, ein schon fertig geschriebenes
Referat z.B. &uuml;ber den Vulkanismus schnell mal in eine HTML Dummydatei zu
setzen und f&uuml;r jeden Abschnitt das Tag &lt;p&gt; zu setzen. Denn welcher
Sch&uuml;ler hat seine Arbeiten heute nicht als ASCII vorliegen? Schneller kommt
doch keiner zu einem vern&uuml;nftigen Artikel. Und diese zwei Stunden Brutto
sollte jeder doch schnell &uuml;brig haben.</p>

<blockquote><i></font>
Nun, dieser Verfall der NC ist seit der Umstellung auf das HTML Format besonders
verst&auml;rkt zu beobachten.<br><br>

Ich finde es ja auch toll, wie man seine Artikel so layouten kann, aber meiner
Meinung nach wird es deutlichst &uuml;bertrieben. Das neue Format wurde nach
einer kurzen Eingew&ouml;hnungsphase NURNOCH zur m&ouml;glichst effektiven
Selbstdarstellung verwandt. Die Leserbriefe werden bunter, besser und
geschickter, doch gibt es &uuml;berhaupt noch den Grund, Briefe zu schreiben?
</i></blockquote>

<p><font size="+1">Diese Beobachtung ist zwar richtig, aber falsch
interpretiert. In der Zeit von MagneticPages wurden keine 50% der Artikel von
den Autoren selber layoutet, weil sie es einfach nicht konnten oder es nicht
lernen wollten. Und die meisten, die selber formatierten, kamen trotzdem mit den
Bildern nicht zurecht und lie&szlig;en sie einfach weg. Mit HTML haben die
Wenigsten ihre gro&szlig;en Schwierigkeiten, wenn sie den Mut gehabt haben,
einmal damit zu beginnen. Manche haben heute noch Angst davor und lassen
intuitiv die Finger weg vom Schreiben, weil sie nicht zugeben wollen, dass sie
Angst vor HTML haben. In der Schule kann man schnell mal den Nachbarn fragen
oder kurz &uuml;ber dessen Schulter schauen. Aber hier ist jeder auf sich selbst
und seine Courage angewiesen. Zugeben wird es aber keiner. Und die wenigen User,
die nach Deiner Meinung euphorisch im Gebrauch und auch Mi&szlig;brauch der
HTML-Sprache schwelgen, das legt sich wieder. Hier gilt wirklich der Ausspruch:
"learning by doing". Also habe etwas Geduld und &uuml;be Nachsicht.</p>

<p>Nun k&ouml;nnte ich noch eine Menge zu Deinen Vorschl&auml;gen am Ende Deines
Artikels sagen, aber das werden andere wahrscheinlich schon getan haben und
deswegen lasse ich es sein. Nur das mit der Verwendung der Tags, wie ich dies
Eingangs des Briefes schon erw&auml;hnte, das solltest Du tunlichst sein lassen.
Ich sch&auml;tze Du benutzt als Browser AWeb mit der Standardeinstellung der
Prefs wie geliefert. Benutze bitte mal Voyager und Du machst Augen wie
Baukl&ouml;tze. AWeb verzeiht viele kleine Fehler in der Schreibweise, andere
nicht. Setze in Deiner AWeb-Prefs bei Stile die Fontgr&ouml;&szlig;e bei PRE auf
Minus 1 und dann hast Du die g&auml;ngige Gr&ouml;&szlig;e aller anderen
Browser.</p>

<p>Weiter bitte ich Dich von der Forderung nach einem festen Frame in der
NoCover abzur&uuml;cken. Leider gibt es noch viele junge Leute, die einen
alten 13 Z&ouml;ller nutzen m&uuml;ssen und die haben dann veflixt wenig
Freude an der verbliebenen Restseite für die Beitr&auml;ge, besonders wenn
der Scrollbalken f&uuml;r Seitenansichten genutzt werden muss, weil die Bilder
auf 600 bzw auf 640 Pixel festgelegt wurden. Alle PRE Texte, die mit einem
Editor auf 72 Zeichen eingestellt wurden, gehen &uuml;ber den rechten Seitenrand
hinaus.</p>

<p>So nun habe ich genug gel&auml;stert, aber ich hoffe, dass Du manche Aussagen
auch als Anregung nimmst.<br>Alles Gute bis zum n&auml;chsten Mal, Wolf.</p>
</font>
Gehe <a href="#top"> zum Anfang </a>
<hr>
<br>
<a name="a2"><font size="+2">Gr&uuml;&szlig; Dich Sieglinde</font></p>

<p><font size="+1"> Dass Dir meine HTML Workshops geholfen haben, finde ich
erbaulich, denn dann waren sie ja nicht ganz umsonst geschrieben. Das Problem
mit AWeb ist eigentlich normal, wenn bei Dir die entsprechenden Datatypes nicht
geladen sind. AWeb nutzt n&auml;mlich als einziger nicht die graphische
Oberfl&auml;che von MUI, sondern greift direkt auf die Datatypes zu. Lies doch
nochmals den Artikel OnlineOnline von Thomas Szedlak in NC-50, da kannst Du es
zwischen den Zeilen herauslesen.</p>

<p>In Aminet24 findest Du folgenden Text als aminet/comm/www/AWebGif.txt</font>
<pre>
   AWebGIF plugin
   ==============

   The AWebGIF plugin for AWeb-II (version 3.0 or higher) allows you
   to view all kind of GIF images.

   Features include:

    * Optional progressive display of loading images
    * Optional playback of animated GIFs
    * Support for transparent images
    * Support for scaling
    * Support for CyberGraphics

   Due to Aminet's policy on GIF software, the plugin isn't available
   on Aminet.
   You can download it from:
      http://www.amitrix.com/awebgif.lha

   The AWeb GIF plugin is copyright © 1998 by Yvon Rozijn.
</pre><font size="+1">
Im gleichen Archiv findest Du aber AWebJFIF.lha falls Du dieses auch benötigst.
Der Text hierzu lautet:</font>
<pre>
   AWebJFIF plugin
   ===============

   The AWebJFIF plugin for AWeb-II (version 3.0 or higher) allows
   you to view all kind of JFIF (JPEG) images.

   Features include:

    * Optional progressive display of loading images
    * Support for scaling
    * Support for CyberGraphics

   The AWeb JFIF plugin is copyright © 1998 by Yvon Rozijn.
   It uses code from the JPEG library that was written by the
   Independent
   JPEG Group (IJG).
</pre><font size="+1">
Ich hoffe Dir damit geholfen zu haben.</p>

<p>Mein Artikel &uuml;ber die GEPA habe ich absichtlich nicht &uuml;ber das
breite Sortiment geschrieben, sondern nur den Fu&szlig;ball als symptomatisch
herausgegriffen. Das ist auch ein Gegenstand, mit dem die meisten NC-Leser etwas
anfangen k&ouml;nnen und den Artikel auch lesen. Ein Bericht &uuml;ber das Leben
auf einer Kaffeeplantage w&auml;re bestimmt &uuml;berschlagen worden. Ebenso
w&uuml;rde es die meisten nicht interessieren, wenn ich nun den Unterschied
zwischen "Dritte Welt" und "Eine Welt" herausgearbeitet h&auml;tte.</p>

<p>Sieglinde, Du monierst das Einschlafen der Feedbackcorner. Nun habe ich aber
eine ketzerische Frage, warum hast Du dann nicht unter Deinem Artikel ein
kleines Statement &uuml;ber gute und schlechte Artikel der letzten NC gemacht?
Das w&auml;re auch ein Feedback und wenn Du nur ge&auml;u&szlig;erst
h&auml;ttest, wie Dir die Comics gefallen. Unsere beiden K&uuml;nstler
w&uuml;rde dies brennend interessieren. Nun auf Deine Frage, ob Du Artikel aus
Deinem Metier schreiben sollst. Bitte aber keine Abhandlung &uuml;ber Kopf- und
Fu&szlig;verb&auml;nde und dass es ungesund ist, gleich 20 Aspirintabletten auf
einmal zu nehmen.<br>Alles Gute bis zum n&auml;chsten Mal, Wolf.</p></font>
Gehe <a href="#top"> zum Anfang </a>
<hr>
<br>
<a name="a3"><font size="+2">Gr&uuml;&szlig; Dich Henning</font></p>

<p><font size="+1">
Ausschlaggebend f&uuml;r diese Zeilen ist Dein Artikel "FC-Manager". Schon in Deinem
Leserbrief "an alle" beschwerst Du Dich &uuml;ber das Fehlen der Feedback Corner. Nun
hast Du die alte Vorschlagsliste noch ausgegraben, aber diese kann nicht mehr
aktuell sein, denn Thomas Szedlak wird h&ouml;chstwahrscheinlich keinen Artikel
schreiben, er hat keinen Amiga mehr. Die NoCover wird er wohl lesen, auch diese
Zeilen hier, schreiben wird er leider wider Erwartung nicht mehr. Mir pers&ouml;nlich
fehlt die alte Liste Online Online, die immer sehr informativ war. Bookmarks war
zwar interessant, aber nicht &uuml;berw&auml;ltigend notwendig, obwohl ich irgend in einem
Artikel oder Leserbrief der NC-61 ein Ruf nach Aufzeigen interessanter
Web-Seiten gelesen habe. Also Bedarf ist auch hier.</p>

<p>Da nun die Pflege, Fortschreibung und &Uuml;berwachung der Autorenliste verwaist
scheint, nimmt es Dir bestimmt keiner &uuml;bel, wenn Du nun ganz laut <b> HIER </b>
schreist und diese Aufgabe auf Dein Panier schreibst. &Uuml;berlege also nicht so
lange und mache es. Alle werden es Dir danken. Meinen Namen wirst Du aber
in der Liste nicht auftauchen sehen, siehe dazu meinen Schlusssatz in der
Wolf-INFO.</p>

<p>Jetzt noch ein paar S&auml;tze zu Deinem HTML-Stil. Auch bei Dir gilt der Satz,
wie bei Daniel, &uuml;ber den Gebrauch von &lt;Hx&gt; als Textschriftgr&ouml;&szlig;e. Da Du so
einen gro&szlig;en Font w&auml;hlst, scheint mir, dass Du Voyager bevorzugst, aber mit den
gelieferten Prefs, in denen die Fontgr&ouml;&szlig;e generell eine Nummer zu klein ist. Ich
schlage Dir vor, die Fonts und Gr&ouml;&szlig;en wie bei IBrowse zu nehmen, dann f&auml;hrst Du
am besten (finde ich).<br>Alles Gute bis zum n&auml;chsten Mal, Wolf.</p></font>

<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center>
<a href="NoCover.html#a12"> <img border=0 src="l_hauptinhalt.jpg" width=495 height=75></a>
</td></tr></table><br>
</body>
</html>

