<html>
 <head>
<meta name="description" content="Leserbrief">
<meta name="author" content="Sieglinde Peters"
     <title>Leserbrief Sieglinde Peters</TITLE>
</head>
  <body>
  <body background="stucco.gif" text=black link=darkblue alink=green>
    <Font Color=red>
      <center>
            <h1> Heute gibt es Nachrichten f&#252;r</h1>
    </Font Color=red>    
      </center>
<IMG SRC="compwom.gif" ALIGN=right Width=88 height=88>
<p>
<Font Size=5>
<UL Type="Circle">
<li><a href="#1">Andreas Magerl</a>
<li><a href="#2">Wolf Zimmer</a>
<li><a href="#3">Reiner Lübkemeier</a>
<li><a href="#4">Nagash</a>
</UL>
<HR>
<a Name="1"><br>
<b> Andreas Magerl</b> <br>
</Font Size=5>
<Font Color=black Font Size=4>
Hallo Andreas
Kurz vor der Er&#246;ffnung der Amigamesse hast Du uns gebeten den DAUG zu
unterst&#252;tzen, jetzt nur wenige Monate sp&#228;ter teilst Du im Editorial
kurz und knapp mit, daß der APC&TCP nicht meht Mitglied im DAUG ist.
Es w&#228re schon gut zu wissen, warum der Club nun nicht mehr im DAUG
vertreten ist. Vielleicht k&#245;nntest Du Dich in der NoCover wenigstens
kurz einmal dazu &#228;ußern.
<BR>
<hr>
</Font Size=4>
<font size=5
<a Name="2"><BR>
<b>An Wolf</b><br>
<Font Color=Black>
</Font Size=5>
<Font Color=black Font Size=4>
Hallo Wolf,
Vielen Dank f&#252;r Deine E-Mail. Mein Problem mit dem Browser AWeb hat nichts
mit den Datatypes zu tun. Ein GIF-Datatype ist auf meinem Rechner installiert
und funktioniert eigentlich auch. Probleme verursachen die Gr&#246;&#223;enangaben.
W&#228;hrend bei IBrowse die Grafiken genau in der von mir bestimmten Gr&#246;&#223;e
angezeigt werden, werden die Bilder bei Aweb in der Originalgr&#246;&#223;e angezeigt.
Wenn ich also das Bild mit einem Grafikprogramm vorher auf das gew&#252;nschte
Format bringe, klappt die Anzeige auch mit AWeb. 
Das kann natürlich auch an der Tatsache liegen, da&#223; ich Aweb nur als
Demo besitze.
In der NoCover stellst Du das HTML4.0 Handbuch vor. Ich besitze auch ein Buch
 &#252;ber HTML4.0. Allerdings eines ohne CD-Rom, aber ich denke mal, da&#223;
die auf dem Amigasowieso nicht laufen w&#252;rde.
 Leider mußte ich feststellen, da&#223; einige Befehle mit
den Amigabrowsern nicht funktionieren. Da scheinen wir wohl wieder einmal
hinterherzuhinken.
</Font Size=4>
<hr>
<Font Size=5>
<a Name="3"><BR>
<b> Reiner Lübkemeier</b> <br>
</Font Size=5>
<Font Color=black Font Size=4>
Grüß Dich Reiner,
Den Einfall mit den Fotos f&#252;r die Mitgliederliste finde ich gut.
Mein Bild m&#252;&#223;te schon bei Dir angekommen sein.
<BR>
<hr>
</Font Size=4>
<font size=5>
<a Name="4"><BR>
<b>An Nagash</b> <br>
 </Font Size=5>
<Font Color=black Font Size=4>
Hallo Nagasch!
Du hast uns in der NoCover ja eine ordentliche Standpauke gehalten.
Das war aber auch nö&#246;tig. Ich werde mir Deine Worte zu Herzen nehmen
und einen CD-Test schreiben.
Da ich so etwas noch nie gemacht habe, wei&#223: ich nat&#252;rlich nicht, ob
mein Werk den Qualit&#228;tsanspr&#252;chen der NoCoverleser gen&#252;gen wird.
<BR>
<Strong>Viele Gr&#252;&#223;e Sieglinde
</Font Size=5>
<Font Color=black Font Size=4>
<br>
<hr>
    <CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
  </body>
</html>