<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red "background="l_bg.gif"">
<CENTER>
<P><H2>Leserbriefe:</H2></P>
</CENTER>
<P>

Hallo u. gr&uuml;&szlig; Gott !

Ich habe hier ein paar Zeilen,

<Li><A href="#1.html">1. f&uuml;r den ratgebenden Andreas Guldner</A>
<Li><A href="#2.html">2. f&uuml;r den ebenfalls ratgebenden Kilian Servais</A>
<Li><A href="#3.html">3. f&uuml;r den um Kommentare bittenden Uwe Brunen</A>
<Li><A href="#4.html">4. f&uuml;r den flei&szlig;igen Wolf Zimmer</A>

und

<Li><A href=#"5.html">5. f&uuml;r den ebenso flei&szlig;igen aber leider nicht ganz aufmerksamen "SAINT" !</A>


<A name="5.html">
<H3> 5. Also fangen wir mit dem leider etwas negativ ausfallendem an!</H3><P>

Lieber "SAINT",<P>

Du bist zwar ein sehr flei&szlig;iger Schreiber in der NC und
hast auch immer wieder gute Artikel drin, aber ich habe mir es abgew&ouml;hnt
Deine Artikel erst umzufriesieren, da ich sie nicht lesen kann mit 
Deinen "bl&ouml;den" Hintergr&uuml;nden.<br> Daher schalte ich immer sofort weiter und
das ist ja wohl nicht der Sinn des Ganzen oder ?<BR>

Du willst doch auch eine Resonanz auf Deine Artikel haben, nicht wahr ?<BR>
Sonst macht das Schreiben doch keinen Spa&szlig; !<BR><P>

Ich jedenfalls, bin froh wenn auf meine sp&auml;rlichen Schreibereien eine
Reaktion erfolgt.<BR>
<P>
Du wirst sehen, ich stehe sicher nicht alleine da mit meiner Ansicht !
<P>
Also mach was draus, ich bitte Dich !
<P>
Rolf Nue. aus Wue.<br>
<HR>

<P>
<A name="1.html">
<H3> 1. Nun zum guten Andreas Guldner ! </H3><P>

Ich danke Dir f&uuml;r Deine vielen gut gemeinten Ratschl&auml;ge !<BR>

Aber wie Du an meiner AMIGA-Ausr&uuml;stung sehen kannst, bin ich "leider"
nicht so betucht wie Du.<BR>
Mein CD-Rom-Laufwerk l&auml;uft mit dem veraltetem "Speedup-System" der
nicht mehr f&uuml;r AMIGA t&auml;tigen Firma VOB, DO.<BR>
Ich hatte damals schon unendliche Schwierigkeiten, daﬂ Laufwerk
anzuschlie&szlig;en und es zum Laufen zu bringen. <BR>Muﬂte sogar nach Dortmund
fahren um mir mein geliebtes St&uuml;ck wieder in Ordnung bringen zu 
lassen.<BR>
Ich gehe an die Hardware nicht mehr dran! Und schon gar keine
"L&ouml;tarbeiten" ! Ich habe mir zwar noch das System "AMIGA OS 3.1"
eingebaut und war froh, daﬂ es ohne Probleme lief.<BR>
<P>
Aber die Anordnung f&uuml;r das CD-ROM-Laufwerk werde ich nicht ver&auml;ndern.
Ich habe zwar vorne einen Kopfh&ouml;rerausgang, aber damit kann ich immer
nur einen "Song" h&ouml;ren und dann h&auml;ngt sich mein gutes St&uuml;ck einfach
auf und ich kann neu starten.<BR>
<P>
Sicher wei&szlig; ich, daﬂ ich mit den guten Datatypen Musik h&ouml;ren kann,
aber mein Chip-Ram ist nur knapp 2 MB groﬂ und so l&auml;uft dann nicht
mehr viel.<BR> Die L&ouml;sung mit einem CD-Player neben dem Computer ist
ja wohl auch nicht das wahre oder ?<BR>
<P>
Ich werde mir irgendwann eine Grafikkarte kaufen und dann habe ich
das Problem mit dem Speicherplatzmangel wohl ein wenig gel&ouml;st.<BR>
<P>
Tja und das mit der fehlenden Library, das war ein versehen von mir !
Ich hatte mir die Demo von Haage&Partner aus dem Internet gesaugt
und die wollte und wollte nicht laufen. Bis es dann doch irgendwie
geklappt hat.<BR>
Ich will mir das Programm noch nicht kaufen. ES scheint mir noch
nicht ausgereift zu sein.<BR>
Ich hatte schon mal ein Problem mit Haage&Partner und zwar mit
der neuesten Version von STFax-Prof V.3.3. Ich wei&szlig; nicht
wieviele E-Mails ich mit allen m&ouml;glichen Leuten gewechselt habe.
Aber es l&auml;uft immer noch nicht. Ich habe jetzt einfach keinen
Nerv mehr. Ich habe es zwar noch auf der Festplatte, aber ich
faxe jetzt mit dem alten Programm von TKR - Multifax.<BR>
<P>
Du konntest mir mit den gut gemeinten Ratschl&auml;gen zwar nicht direkt
helfen, aber ich danke Dir trotzdem !<BR>

Gr&uuml;&szlig;e nach Niedersachsen !<BR>
<P>
R.Nue.aus Wue.<BR>
<HR>
<P>
<A name="2.html">
<H3>2. f&uuml;r den ebenfalls ratgebenden Kilian Servais!</H3><P>

Hallo Kilian !<P>

Ich m&ouml;chte mich auch bei Dir bedanken, da&szlig; Du meine Fragen aufgegriffen
hast. Aber wie Du aus dem obigen Text an den Andreas Guldner ersehen kannst
sind diese Ratschl&auml;ge alle etwas f&uuml;r die Katz. Ich br&auml;uchte mal jemand der
sich mit meinem AMIGA auseinandersetzt. Vielleicht bringe ich ihn
einfach mal zu einem Treffen mit. Dann kann man ja weiter sehen.
Es ist einfach zuviel zu beachten. Vielleicht ist es wirklich so,
da&szlig; ich zuviele Programme oder Patches am laufen habe, die man
irgendwie abschalten kann. f&uuml;r mich sieht zwar alles prima aus. aber
ein anderer w&uuml;rde vielleicht gleich herausfinden woran es liegt.<BR>
<P>
R.Nue. aus Wue.<BR>
<HR>
<A name="3.html">
<H3>3. f&uuml;r den um Kommentare bittenden Uwe Brunen !</H3><P>
Hallo Uwe !<BR>
<P>
Dein Tip mit der Schublade worin die Hintergrund-Bilder und viele
andere Bilder drin verschwinden kˆnnten und das man ja lieber viele
kleine Bildchen als Auflockerung benutzen sollte, spricht mir auch
aus der Seele.<BR>
Sicher k&ouml;nnen wir die NC wieder interessanter gestalten, aber daf&uuml;r
br&auml;uchte man dann ja wieder einen Koordinator.<BR>
Unser guter Andreas, der ja f&uuml;r die NC "zeichnet" ist leider total
&uuml;berfordert, nt&uuml;rlich nur aus Zeitgr&uuml;nden. Ansonsten k&ouml;nnen und wollen
wir uns ja wohl nicht beschweren, oder ?<BR>
<P>
Irgendwie sollten sich einige unserer gut geschulten und versierten
Club-Mitglieder zusammentun und sich dar&uuml;ber Gedanken machen, wie
man die NC auch in dem neuen HTML-Format (womit sich sicher einige
ganz sch&ouml;n schwer tun - ich z&auml;hle mich auch dazu) wieder zu der machen
was sie mal war - leicht zu lesen, sch&ouml;n anzuschauen und sogar zu h&ouml;ren.<BR>
<P>
Unser, z.Zt., bester Layouter ist f&uuml;r mich Wolf Zimmer !<BR>
<P>
Er hat schon so viele gute Ideen in der NC verwirklicht und seine Texte
sind eine wahre Augenweide, warum sollte er sich nicht mit unserem Boss
zusammentun und ein neues Layout pr&auml;sentieren, worin viele kleinere
Bildchen bereits in einer Schublade vorhanden sind und die blo&szlig; in unseren
Texten mit dem entsprechendem Befehl aufgerufen werden brauchen.<BR>
<P>
Dann haben wir (die sich mit der Materie nicht so gut auskennen) und die,
die nicht soviel Zeit er&uuml;brigen k&ouml;nnen f&uuml;r das entwerfen von kleinen
Grafiken, auch mehr Zeit zum schreiben von Artikeln.<BR>
<P>
Stimmt`s ????<BR>
<P>
R.Nue.aus Wue.<BR>
<HR>
<P>
<A name="4.html">
<H2> Hallo mein Bester !</H2><P>

Als erstes m&ouml;chte ich Dir mal wieder ein Lob aussprechen, obwohl Du es
ja mei&szlig;tens nicht gern hast, aber es muﬂ sein !<BR>

Deine Artikel/Workshops/Bildchen usw. usw. alles vom Feinsten !
Ich wei&szlig; gar nicht, was man am ehesten hervorheben soll. 
Alles gro&szlig;e Klasse !<BR>
<P>
Das Du mir die Leviten gelesen hast, habe ich zwar nicht ganz verstanden,
aber vielleicht habe ich mich nicht richtig ausgedr&uuml;ckt.<BR>
<P>
Ich meinte: Viele E-Mails zu Weihnachten waren nur als sogenannter
"Schneeball" weitergereicht worden, obwohl man ja bei einigen
schon im Kopf drin stand. Das war das was mich ein wenig ge&auml;rgert
hat.<BR>
<P>
Es ist ja heute so leicht, einfach die eingegangene Mail als "seine"
zu deklarieren und weiter geht`s.<BR>
<P>
Dieweil ich noch nicht auf Dein Angebot zur&uuml;ckgekommen bin,
m&ouml;chte ich Dir folgendes zu meiner Homepage sagen:<BR>
<P>
Ich f&uuml;hle mich durch Deine guten und vielen Workshops hinsichtlich
des HTML-Standards so verunsichert, da&szlig; mich der Mut verlassen hat,
etwas eigenes zu kreieren.<BR>
Wenn wir uns im Vellmarer Hof dann sehen sollten, bringe ich das,
was ich mir so ausgedacht habe, mal mit. Okay ?<BR>
<HR>
<BR>



von: &#160;<a href="Mitglieder/nuenninghoff.html">Rolf Nue. aus Wue.</a><br>
E-Mail:<a href="mailto:093113563-0001@t-online.de">
0931136563-0001@t-online.de</a><p>

</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="klein_hauptinhalt.jpg" width=320
height=58></A>
</CENTER>
</P>
</BODY>
</HTML>
