<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Markus Thomaschewski">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [de] (Win98; I) [Netscape]">
   <TITLE>FASTFOOD - Februar 1999</TITLE>
</HEAD>
<BODY BACKGROUND="steinmauer.gif">

<CENTER>
<H1>
<B><U></U></B></H1></CENTER>

<CENTER>
<H1>
<B><U>FASTFOOD</U></B></H1></CENTER>

<CENTER><B>( <FONT COLOR="#3333FF">April</FONT> <I><FONT COLOR="#CC0000">1999</FONT></I>
)</B>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<BR>&nbsp;
<H2>
<B><U></U></B></H2>

<H2>
<B><U>INHALT:</U></B></H2>

<UL>
<LI>
<B><FONT COLOR="#3333FF">E</FONT>.<FONT COLOR="#3333FF">D</FONT>.<FONT COLOR="#CC0000">itorial</FONT>
/ <FONT COLOR="#3333FF">V</FONT>.<FONT COLOR="#3333FF">O</FONT>.<FONT COLOR="#3333FF">R</FONT>.<FONT COLOR="#CC0000">wort</FONT></B></LI>

<LI>
<B><U>CD-Tips:</U></B></LI>

<UL>
<LI>
<B><FONT COLOR="#3333FF">Alanis Morissette</FONT> "<I><FONT COLOR="#CC0000">Supposed
Former Infatuation Junkie</FONT></I>"</B></LI>

<LI>
<B><FONT COLOR="#3333FF">Echobelly</FONT> "<I><FONT COLOR="#CC0000">Lustra</FONT></I>"</B></LI>

<LI>
<B><FONT COLOR="#3333FF">Hole</FONT> "<I><FONT COLOR="#CC0000">Celebrity
Skin</FONT></I>"</B></LI>
</UL>

<LI>
<B><U><FONT COLOR="#000000">Buch-Tip:</FONT></U></B></LI>

<UL>
<LI>
<B><FONT COLOR="#3333FF">Elisabeth George</FONT><FONT COLOR="#000000">
"</FONT><I><FONT COLOR="#CC0000">Gott sch&uuml;tze dieses Haus</FONT></I><FONT COLOR="#000000">"</FONT></B></LI>
</UL>

<LI>
<B><U><FONT COLOR="#000000">Spiel-Tip:</FONT></U></B></LI>

<UL>
<LI>
<B><FONT COLOR="#3333FF">Dark Project</FONT> - <FONT COLOR="#3333FF">Der
Meisterdieb</FONT> (<I><FONT COLOR="#CC0000">PC</FONT></I>)</B></LI>
</UL>

<LI>
<B>NURBS: Die 3D-<FONT COLOR="#3333FF">Technologie</FONT> der <I><FONT COLOR="#CC0000">Zukunft</FONT></I>
?</B></LI>

<LI>
<B>Sachen zum <I><FONT COLOR="#CC0000">lachen</FONT></I> <FONT COLOR="#3333FF">:))</FONT></B></LI>

<LI>
<I><FONT COLOR="#000000">credits</FONT></I></LI>
</UL>

<CENTER><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P><B>/ <FONT COLOR="#3333FF">E</FONT>.<FONT COLOR="#3333FF">D</FONT>.<FONT COLOR="#CC0000">itorial</FONT>
/
<FONT COLOR="#3333FF">V</FONT>.<FONT COLOR="#3333FF">O</FONT>.<FONT COLOR="#3333FF">R</FONT>.<FONT COLOR="#CC0000">wort</FONT>
/</B></H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Juhuu, Fastfood ist wieder da! ;)</FONT></B></CENTER>

<P><B><FONT COLOR="#333333">HINWEIS:</FONT></B>
<BR><B><FONT COLOR="#333333">Diese Fastfood-Ausgabe sollte schon in der
No Cover 59 erscheinen, wurde aber nicht rechtzeitig fertig. Dann wollte
ich diese Ausgabe &uuml;berhaupt nicht mehr ver&ouml;ffentlichen, da ich
absolut keine Lust mehr hatte irgendetwas noch f&uuml;r die No Cover zu
ver&ouml;ffentlichen. Ich weis zwar selber nicht genau wieso, aber ich
habe mich nun doch dazu entschlo&szlig;en meine getippten Beitr&auml;ge
(nach einer &Uuml;berarbeitung) dem Andreas zu schicken. Wenn euch das
Konzept von Fastfood gef&auml;llt und ihr gerne weitere Ausgaben davon
in der No Cover lesen m&ouml;chtet, dann gebt mir in der n&auml;chsten
Ausgabe Feedback (Verbesserungsvorschl&auml;ge und Kritik ebenso willkommen!).
So, das war der Hinweis!</FONT></B>
<P>Wenn ihr diese Zeilen lest, konnte ich wohl endg&uuml;ltig meinen inneren
Schweinehund &uuml;berwinden. Sind die fr&uuml;hen Ausgaben von <B><FONT COLOR="#3333FF">Fastfood</FONT></B>
alle noch aus einem Bed&uuml;rfnis heraus enstanden, war es diesesmal anders.
Auch mir ist es aufgefallen, das die letzten Ausgaben der <B><FONT COLOR="#3333FF">NoCover</FONT></B>
immer d&uuml;nner und langweiliger wurden.Ob es nur an der Weihnachtszeit
und dem Jahreswechsel lag, wie <I><FONT COLOR="#CC0000">Andreas Magerl</FONT></I>
vermutet, oder ob eher <I><FONT COLOR="#CC0000">Wolfgang Zimmer</FONT></I>
damit recht hat, das es eine Ressezion bez&uuml;glich neuer Schreiber gibt,
die die alten ersetzen, wer wei&szlig;. Jedenfalls hat <I><FONT COLOR="#CC0000">Markus
Castro</FONT></I> recht in seiner Einsch&auml;tzung, das es immer weniger
Artikel werden und die daf&uuml;r immer k&uuml;rzer.
<P>Wieso sind solche Rubriken wie "<B>Dfue</B>", "<B>Tools</B>" oder "<B>Multimedia</B>"
so h&auml;ufig verwaist? (<I>PS</I>: CD-Tests wie die Serie <B>Metal-Corner</B>
sind eigentlich in der <B>Multimedia</B>-Rubrik besser aufgehoben, als
in der <B>Small-Talk</B>-Rubrik, oder?!) Naja, wie auch immer. Eigentlich
wollte ich als <B><FONT COLOR="#3333FF">No Cover</FONT></B>-Redakteur in
Rente gehen, da aber diese "Misere" (wenns denn wirklich eine ist) kein
einzelner beseitigen kann, sind alle gefragt, also auch ich. Eigentlich
kann jeder was f&uuml;r die <B><FONT COLOR="#3333FF">No Cover</FONT></B>
schreiben. Es m&uuml;&szlig;en ja nicht immer nur Amiga-Themen sein. <I><FONT COLOR="#CC0000">Marcus
Castro</FONT></I> schw&auml;rmt von alten Spielklassikern auf dem Amiga
(ok, das ist <B>ein</B> Amiga-Thema!), die ihm und vielen von uns viele
Stunden Freude bereiteten, <I><FONT COLOR="#CC0000">Kilian Servais</FONT></I>
schreibt &uuml;ber sein Interesse an Metal und stellt uns regelm&auml;&szlig;ig
neue Platten vor, <I><FONT COLOR="#CC0000">Thomas Windecker</FONT></I>
l&auml;&szlig;t alle Trekkie-Fans und diejenigen die Interesse zeigen,
an seinem Hobby teilhaben, usw usf.
<P><B><FONT COLOR="#3333FF">Fastfood</FONT></B> ist im Prinzip nichts anderes:
Welche Alben habe ich in letzter Zeit geh&ouml;rt, welche B&uuml;cher gelesen,
welche Filme gesehen, welche Ger&uuml;chte geh&ouml;rt, &uuml;ber welche
Witze mu&szlig;te ich lachen... Da es neben Storys aus verschiedenen Gebieten
besonders um Musik, B&uuml;cher und Spiele auf "fremden" Systemen geht,
denke ich das <B><FONT COLOR="#3333FF">Fastfood</FONT></B> gut in der Multimedia-Rubrik
aufgehoben ist.
<P>Trotz diesem eher ernsten E.D.itorial, w&uuml;nsche ich euch eine gute,
fettige &amp; hei&szlig;e Unterhaltung mit dieser Ausgabe!
<P>&nbsp;<B><FONT COLOR="#CC0000">( Mark Tom )</FONT></B>
<BR>&nbsp;
<BR>&nbsp;
<BR>
<BR>
<BR>
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P>Alanis Morissette: "<FONT COLOR="#3333FF">Supposed Former Infatuation Junkie</FONT>"</H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Das zweite Album der Queen of Rock</FONT></B></CENTER>

<P>Ich liebe
Alanis. Morgen werde ich ihr einen Heiratsantrag machen. Hoffentlich l&auml;uft
sie mir morgen auch &uuml;ber den Weg. Aber ich halte dies f&uuml;r &auml;u&szlig;erst
unwahrscheinlich. Also werde ich mich mit ihren zwei Alben zufrieden geben
m&uuml;&szlig;en. Und das ist mehr als ein schwacher Trost. In jeder Beziehung
gibt es leider auch immer wieder Stre&szlig; und Streit, bis hin zur schmerzhaften
Trennung. Mit den Alben hingegen, teile ich Freud und Leid mit Alanis,
ohne die negativen Nebenwirkungen einer Beziehung erleben zu m&uuml;&szlig;en.
Frauen mit ausgepr&auml;gten Charakter, St&auml;rke und Intelligenz, die
sich kein X f&uuml;r ein U vormachen lassen, faszinieren mich. Alanis ist
so eine Frau! Woher ich das wissen will? Ich kenne ihre Musik.
<P>Sie singt nicht immer im klassischem Sinne sch&ouml;n, wie zB. Celine
Dion, teilweise schreit sie sogar und qu&auml;kt, aber immer mit voller
Leidenschaft und &Uuml;berzeugung. Mit ihrem Debut <B>Little Jagged Pill</B>
legte sie ein Album vor, welches 12 beinahe perfekte Rocksongs zu bieten
hatte. 12 drei bis vier Minuten-Kracher, die ihren H&ouml;hepunkt fast
immer in eing&auml;ngigen Refrains fand. Ihre zweites Album unterscheitet
sich darin stark von ihrem Deb&uuml;t. 17 (!) kleine Dramen und Geschichten,
die als Ganzes von ihrer teilweisen ungeheuren Dramaturgie leben. Nat&uuml;rlich
findet man auch auf diesem Album wunderbare Melodien, die aber eher selten
in den Refrains eingefercht sind, sondern sich &uuml;ber das ganze Lied
erstrecken.
<P>Beim ersten schnellen reinh&ouml;ren, mag man vielleicht etwas entt&auml;uscht
sein, wie ich es zuerst war, aber nimmt man etwas Abstand vom eindimensionalen
Single-Format-h&ouml;ren, taucht man in ein wunderbares Rockm&auml;rchen
ab, wo einem mehr als einmal Schauer &uuml;ber den R&uuml;cken laufen.
Das Album ist gro&szlig;artig und sogar deutlich besser als das Deb&uuml;t
- jedenfalls f&uuml;r denjenigen, der nicht nur die Anzahl der potentiellen
Hit-Singles z&auml;hlt. Ein Gro&szlig;teil der Songs ist einfach zu lang,
zu vielschichtig, zu kompliziert f&uuml;r das Easy-Listening-Format der
heutigen Radio-Lanschaft!
<P><B>Supposed Former Infatuation Junkie</B> ist beileibe kein Fastfood-Album
f&uuml;r den schnellen Verzehr ohne Nachgeschmack. Nein, es ist ein Festmahl,
f&uuml;r das man sich ruhig Zeit nehmen sollte, um es richtig genie&szlig;en
zu k&ouml;nnen! Ein Album mit Nachgeschmack: Werde ich in vielen vielen
Jahren an die musikalischen Neunziger zur&uuml;ckdenken, wird mir sicherlich
dieses Album als eines der Highlights des Jahrzehnts ins Ged&auml;chtnis
zur&uuml;ckkehren. Vielen Dank, Alanis!
<P><FONT COLOR="#CC0000"><B><U>Tracklist:</U></B> </FONT>Front row, Baba,
Thank U, Are you still mad, Sympathic character, That I would be good,
The Couch, Can&acute;t not, Ur, I was hoping, One, Would not come, Unsent,
So pure, Joining you, Heart of the house, Your congratulation.
<BR>&nbsp;
<BR>&nbsp;
<BR>
<BR>
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P>Echobelly: "<FONT COLOR="#3333FF">Lustra</FONT>"</H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Lustvoller und erfrischender Brit-Rock</FONT></B></CENTER>

<P>Ich
habe gerade <B>Lustra</B> in den CD-Player gelegt und die erste T&ouml;ne
des Openers <B>Bulldog Baby</B> erklingen. Ein Drumcomputer ist zu h&ouml;ren,
ein Streicherquartett erklingt kurz darauf, der Computer f&auml;ngt an
zu zirpen, leise erklingt das Schlagzeug - diesesmal nicht aus dem Computer
- und die zartbittere Stimme von <B>Sonya Aurora Madan</B> verf&uuml;hrt
die Geh&ouml;rg&auml;nge. Die Bezeichnung <B>zartbitter</B> pa&szlig;t
wie die Faust aufs Auge f&uuml;r die Musik von Echobelly.
<P>Computer-Elemente werden nur dezent bei manchen Songs eingesetzt. Das
Schlagzeug stolpert beschwingt los, die Guitarren schrammeln zwar etwas,
bringen aber dennoch einen wohlgelaunten Klang her&uuml;ber, der ab und
zu etwas melancholisch anmutet. Die Melodien sind teilweise zuckers&uuml;&szlig;
und vibrieren an luftigen und etwas schr&auml;gen H&ouml;hen. Die Kl&auml;nge
von Streichern laufen zwar nicht v&ouml;llig parallel zur Melodie, sondern
unterwandern sie minimal, befl&uuml;geln aber gerade wegen dieser Tatsache
die T&ouml;ne, weswegen die Melodien niemals kitschig oder schmalzig wirken.
Wenn Engel Rockmusik machen klingen sie wohl wie Echobelly.&nbsp; Die Stimme
von Sonya setzt dem ganzen die Krone auf. Das englische Musikblatt New
Musical Express meinte: "F&uuml;r diese Stimme w&uuml;rden andere S&auml;nger
t&ouml;ten!". Auch andere "seri&ouml;se" englische Magazine, wie der <B>Observer</B>
oder die <B>Times</B> waren voller Lob &uuml;ber Echobelly.
<P>Wer sich nun eine "Wohlklangstimme" wie bei Celine Dion vorstellt, sieht
sich get&auml;uscht. Kennt ihr die <B>Cranberries</B>? Die hatten den Hit
<B>Zombies</B> vor drei Jahren glaube ich. In diese Richtung geht jedenfalls
die Stimme. Etwas schwierig zu erkl&auml;ren. Klingt so, als w&uuml;rde
ihre Stimme direkt aus dem Kehlkopf kommen, und sie singt in einem relativ
hohem Ton und "eiert" dabei etwas. Klingt jedenfalls gut. Anders. Lustra
ist jedenfalls wieder so ein Album Marke "Suchtgefahr erst bei &ouml;fterem
h&ouml;ren". Titel wie <B>Bulldog Baby</B>, <B>Here comes the big rush</B>
und der Titelsong <B>Lustra</B> gehen einem zwar sofort ins Ohr (und bleiben
dort auch f&uuml;r halbe Ewigkeiten), aber die anderen Titel entfalten
ihre wahre Pracht erst etwas sp&auml;ter. Allerdings geht dies mir bei
relativ vielen Alben so (zB. <B>Catatonia</B> mit "<B>International Velvet</B>"),
liegt vielleicht somit nur an mir und euch gefallen alle Songs gleich auf
anhieb!
<P><B>Musikexpress Sounds</B> schrieb &uuml;ber das Album: "Da blubbert
kein seichter Britpop aus den Boxen, sondern dichte, teils hypnotische
Musik auf Gitarrenbasis, die in ihren besten Momenten eruptiv und berauschend
klingt. (...) Lustra ist ein kleiner Geniestreich!" Tja, was bleibt mir
dann noch anderes, als ausdr&uuml;cklich zu betonen, das es sich hierbei
um eine sehr gute Platte handelt!
<P>PS: Die Platte ist nicht brandneu sondern erschien schon im letzten
Jahr!
<P><B><U><FONT COLOR="#CC0000">Tracklist:</FONT></U></B> Bulldog baby;
I&acute;m not a saint; Here comes the big rush; Iris art; The world is
flat; Everyone knows better; Wired on; O; Bleed; Paradise; Angel B; Lustra.
<BR>&nbsp;
<BR>&nbsp;
<BR>
<BR>
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P>Hole: "<FONT COLOR="#3333FF">Celebrity Skin</FONT>"</H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Courtney Love auf dem musikalischen H&ouml;henflug</FONT></B></CENTER>

<P><BR>
<P><IMG SRC="mm_fast3.gif" BORDER=2 HEIGHT=376 WIDTH=247 HSPACE="4" VSPACE="4" ALIGN=LEFT>Courtney
Love zuerst auff&auml;llig als Kurt Cobains Witwe, hat es inzwischen geschafft
ihr Image radikal zu wechseln. Von einer herunter gekommenen Junkie-Braut,
hin zur Lady mit Stil und Klasse. Sie schaffte es sogar f&uuml;r ihre Rolle
in dem Film <B>Larry Flint</B> f&uuml;r den Oscar nomimiert zu werden!
Beeindruckt mich. Ja, schon wieder! Bin halt leicht zu beeindrucken! Mal
ehrlich, sieht diese Frau nicht neuerdings total sexy aus?! Zur Musik:
Ihre Band Hole hatte sie schon zu Lebzeiten von Kurt (dem toten Nirvana-Frontmann),
mit der sie durchaus kleinere Erfolge in den USA erzielen konnte.
<P>Das neue Album entstand unter der Mithilfe vom Mastermind der <B>Smashing
Pumpkins</B>, <B>Billy Corgan</B>. Unter anderem dieser Tatsache ist es
auch wohl zu verdanken, das Celebrity Skin wohl das beste Album bisher
von Hole ist. Ob man es glaubt oder nicht: Bei Celebrity Skin handelt es
sich um ein Konzept-Album &uuml;ber den "Hollywood way of life" -&nbsp;
gegen Starlets, den Sch&ouml;nheitswahn, falsche Freunde und satte Stars.
Daher auch der Titel Celebrity Skin. So hei&szlig;t n&auml;mlich eine Zeitschrift,
die man in den USA unter der Ladentheke des gut sortierten Fachhandels
bekommt. Hier sind die Jugends&uuml;nden von Stars und Starlets zu bewundern:
fr&uuml;he Nacktfotos, freiz&uuml;gige Filmszenen und indiskrete Schnappsch&uuml;&szlig;e.
Dieses Blatt ist bei der Prominenz gef&uuml;rchtet, wie das Weihwasser
vom Teufel.
<P>Die Musik erinnert mich teilweise an die fr&uuml;hen Heart, bevor sie
ins seichte abwanderten. Herbe Gitarren, feine Melodien unter einer rauhen
Oberfl&auml;che. Mit der Ballade <B>Northern Star</B> beweisen Hole, das
Balladen nicht so sauber und glatt produziert werden m&uuml;&szlig;en,
wie bei Celine Dion &uuml;blich (f&uuml;r mich der Inbegriff von Schmalz
und kalkulierten Gef&uuml;hlen, also b&auml;h!!!), um sch&ouml;n und bezaubernd
zu sein. Mit spr&ouml;dem, zerbrechlichem Charme leidet Courtney bei <B>Northern
Star</B>, soda&szlig; einem beinahe beim zuh&ouml;ren die Tr&auml;nen kommen,
ohne genau zu wissen warum eigentlich. Das Album ist mal etwas ruhiger,
mal wild und berstend wie bei <B>Use once and destroy</B> oder <B>Playing
your song</B>, aber niemals langweilig oder gar erm&uuml;dent. Ein absolut
feines Rock-Album. Das Courtney nebenbei ein Riesenfan von Stevie Nicks
und zudem sehr gut mit ihr befreundet ist, ist f&uuml;r mich Grund genug
Courtney zu m&ouml;gen. Ich bin n&auml;mlich auch von Stevie Nicks sehr
beeindruckt... =)
<P>Kann mir mal jemand bitte erkl&auml;ren, warum musikalische Rohrkrepierer
wie Modern Talking, Tic Tac Toe, DJ Bobo und so ein Schei&szlig; die Charts
dominieren und die beste Musik der Welt in den mei&szlig;ten F&auml;llen
nie das Licht der Charts erblicken? Nicht nur die drei hier besprochenen
Alben h&auml;tten einen Mega-Erfolg verdient, sondern auch Bands wie Catatonia,
Fastball, Matchbox 20, Goo Goo Dolls, K&acute;s Choice .... Ja, die Welt
ist gemein und ungerecht!
<P><B><U><FONT COLOR="#CC0000">Tracklist:</FONT></U></B> Celebrity skin;
Awful; Hit so hard; Malibu; Reasons to be beautiful; Dying; Unse once and
destroy; Northern Star; Boys on the radio; Heaven tonight; Playing your
song; Petals.
<BR>&nbsp;
<P><BR>
<BR>
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P>Elisabeth George: "Gott sch&uuml;tze dieses Haus"</H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Kurzweiliger Krimi in bester englischer
Tradition</FONT></B></CENTER>

<P>"Gott sch&uuml;tze dieses Haus" (Originaltitel "A great deliverance")
erschien 1988 als Deb&uuml;t der amerikanischen Schriftstellerin Elisabeth
George und war gleich ein gro&szlig;er Erfolg:1989 wurde dieser Roman mit
dem Athony Award als Krimi des Jahres geehrt. Es ist in der Tat ein lesenwerter
Krimi und man k&auml;me nie darauf, das dieser Roman von einer Amerikanerin
geschrieben wurde. Nicht weil dieser in dem englischen Dorf Yorkshire spielt,
sondern weil der Roman die typischen Merkmale eines englischen Krimis besitzt.
Die englischen Landsleute werden mit viel Liebe in allen ihrern Schrulligkeiten
beschrieben, der Mord gibt von Anfang an viele R&auml;tsel auf und ist
in seiner Art leicht Bizzar und es gibt viele potentielle Verd&auml;chtige
in diesem Roman. Aber worum gehts eigentlich?
<P>In Yorkshire wird die enthauptete Leiche von William Teys endeckt. Neben
seiner Leiche, kauerte seine debile Tochter in einem blutverschmierten
Kleid, welche, als der Dorfpolizist eintraf, stammelt "Ich wars". Das war
auch gleichzeitig das letzte, was sie von sich gab, da sie von da an verstummt.
Auch die Begleitumst&auml;nde des Mordes geben R&auml;tsel auf: Auf der
Axt mit der William Teyes enthauptet wurde sind keinerlei Fingerabdr&uuml;cke
zu finden. Aber wieso sollte seine Tochter Roberta die Fingerabdr&uuml;cke
wegwischen, wenn sie sowieso nicht vorhatte ihre Tat zu vertuschen? Zudem
glaubt niemand im Dorf daran, das Roberta ihren Vater umgebracht hat. Der
Dorfpfarrer macht sich sogar die M&uuml;he in das entfernte London zu fahren,
um bei Scotland Yard f&uuml;r Robertas Unschuld zu k&auml;mpfen.
<P>Hier w&uuml;rfelt man ein neues Team zusammen, welches den Fall vor
Ort l&ouml;sen soll. Und bei diesem Team handelt es sich nicht um zwei
08/15-Kommisare, sondern ein eigenwilliges Gespann. Da ist einmal der Inspector
Thomas Lynley, er stammt aus gutem Hause, sieht blendent aus und hat einen
umwerfenden Erfolg bei den Frauen und einen sehr guten Ruf bei der Polizei,
was Barbara Havers gar nicht verstehen kann. Barbara Harvers stammt aus
&auml;rmlichen Verh&auml;ltnissen, ist alles andere als eine Sch&ouml;nheit,
hat eine schlechte Figur und kommt selbst mit den sanftm&uuml;tigsten Inspectoren
nicht aus, weshalb sie auch wieder in den Stra&szlig;endienst versetzt
wurde. Die Zusammenarbeit mit Inspector Lynley ist ihre letzte Chance um
auf der Karriereleiter eine Sprosse nach oben zu erklimmen, weshalb Havers
sich schw&ouml;rt, sch&ouml;n brav mit Lynley zusammen zu arbeiten und
nie zu widersprechen, obwohl sie diesen Typ ha&szlig;t!
<P>Das dies in der Praxis nicht so klappt und sie nahe an einem Nervenzusammbruch
ist und Lynley sich als sensibler, verst&auml;ndnisvoller und sehr guter
Inspector entpuppt, gibt dem sowieso schon interessanten Kriminalroman
erst die richtige Note. Ich bin schon auf die neuen F&auml;lle von Havers
und Lynley gespannt, die ich mit Sicherheit auch lesen werde!
<P><B><U><FONT COLOR="#CC0000">Fazit:</FONT></U></B> Dank Taschenbuch-Ausgabe
preiswerter Lesespa&szlig; f&uuml;r alle, die A. Christie und M. Walters
m&ouml;gen!
<BR>&nbsp;
<BR>&nbsp;
<BR>
<BR>
<BR>
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P><B>Project Dark - Der Meisterdieb</B></H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Das neue Spielgef&uuml;hl am PC: Nicht
metzelnd durch die G&auml;nge rasen, sondern unbemerkt anschleichen!</FONT></B></CENTER>

<P><FONT COLOR="#000000">Mein Spieltip des Monats ist eindeutig das neue
Spiel von <B>Looking Glass</B>, deren vorz&uuml;gliches </FONT><B><FONT COLOR="#3333FF">System
Shock</FONT></B><FONT COLOR="#000000"> mir auf meinem 486er schon viel
Freude bereitete. <B>Looking Glass</B> ist kein Entwickler, der alle paar
Monate ein Spiel auf den Markt bringt, sondern solange an originellen Spiel-Konzepten
bastelt, bis sie Marktreife erlangen. </FONT><B><FONT COLOR="#3333FF">System
Shock</FONT></B><FONT COLOR="#000000"> zum Beispiel, war kein &uuml;blicher
3D-Ego-Shooter, sondern bot auch Adventure-Elemente, war also eines der
ersten Action-Adventure &uuml;berhaupt.&nbsp; </FONT><B><FONT COLOR="#3333FF">PD</FONT></B><FONT COLOR="#000000">
bietet ein erfrischend neues Konzept im Bereich der PC-Spiele. Zwar wird
</FONT><B><FONT COLOR="#3333FF">PD</FONT></B><FONT COLOR="#000000">
aus der Ego-Perspektive gespielt, wie </FONT><B><FONT COLOR="#3333FF">Quake</FONT></B><FONT COLOR="#000000">
oder </FONT><B><FONT COLOR="#3333FF">Unreal</FONT></B><FONT COLOR="#000000">,
aber die Spieltechnik unterscheidet sich dennoch sehr stark von den genannten
Vertretern. Gewinnt man diese Spiele noch allein durch brachiale Waffengewalt,
w&uuml;rde diese Vorgehensweise bei </FONT><B><FONT COLOR="#3333FF">PD</FONT></B><FONT COLOR="#000000">
das schnelle Ende bedeuten. Im Konsolensektor gibt es schon einige Spiele
dieser Art, die ein vorsichtiges und behutsames Vorgehen des Spielers vorraussetzen,
wie </FONT><B><FONT COLOR="#3333FF">Golden Eye</FONT></B><FONT COLOR="#000000">
(<B>N64</B>), </FONT><B><FONT COLOR="#3333FF">Tenchu</FONT></B><FONT COLOR="#000000">
oder </FONT><B><FONT COLOR="#3333FF">Metal Gear Solid</FONT></B><FONT COLOR="#000000">
(beide <B>PSX</B>) um nur einige zu nennen.</FONT>
<P><FONT COLOR="#000000">Das ganze spielt &uuml;brigens im Mittelalter.
Man schl&uuml;pft in die Rolle des Meisterdiebs Garrett, der verschiedene
Auftragsarbeiten animmt.&nbsp; Im ersten Auftrag soll man ein wertvolles
Prunkzepter von Lord Bafford entwenden. Aber leider streunern &uuml;berall
seine Wachen herum. Durch den Vordereingang gibts kein reinkommen, aber
da man ja bekanntlich niemals nie sagen sollte, sucht man nach einer Alternative.
Eine M&ouml;glichkeit w&auml;re vielleicht das Brunnenhaus, welches aber
leider auch bewacht ist. Ein bessoffener W&auml;chter steht direkt mit
dem R&uuml;cken zur T&uuml;r des Brunnenhauses und krakehlt durch die Gegend.
Ein zweiter, n&uuml;chterner W&auml;chter, l&auml;uft vor dem Brunnenhaus
seine Streife. Es gibt nun zwei m&ouml;gliche Vorgehensweisen: <B>1.</B>
Man z&uuml;ckt das Schwert und l&auml;&szlig;t es zu einem Kampf kommen.
Diese Methode ist aber in der Regel nicht zu empfehlen, da die W&auml;chter
dann um Hilfe rufen und und sofern sich in der n&auml;he andere W&auml;chter
befinden, diese zur Unterst&uuml;tzung angelaufen kommen. Selbst wenn man
hinterr&uuml;cks die Wachen niedersticht, scheiden sie mit einem lauten
Schrei aus ihrem Dasein. Ist ein W&auml;chter in der N&auml;he, wird er
nat&uuml;rlich durch den Schrei alarmiert. <B>2.</B> Man schleicht sich
an und zieht dem W&auml;chter mit einem Kn&uuml;ppel eins &uuml;ber. Dieser
f&auml;llt dann still und leise um. Damit niemand seinen ohnm&auml;chtigen
K&ouml;rper sp&auml;ter endeckt und gewarnt ist, kann man die ohnm&auml;chtigen
oder leblosen K&ouml;rper wegtragen und an einer einsamen, dunklen Ecke
ablegen. Versucht man die Spuren eines im Kampf niedergestreckten Gegners,
auf diese Art zu beseitigen, bleiben aber noch Blutspuren zur&uuml;ck (zumindest
eine Zeit lang) die verr&auml;terisch sind.</FONT>
<P>Wie aber
kann man sich an Gegner heranschleichen, ohne das man selber bemerkt wird?
Indem man sich im Dunkeln fortbewegt. Die mei&szlig;ten G&auml;nge bieten
solche dunklen Stellen. Ob man ganz im Dunkeln steht oder nur zur H&auml;lfte,
kann man an einer Anzeige unten am Bildschirmrand ablesen. Es handelt sich
hierbei um eine Art Leuchte oder Lampe. Steht man ganz im Dunklen ist sie
v&ouml;llig erloschen. Findet man kein dunkles Fleckchen, kann man auch
das eine oder andere Licht l&ouml;schen. Es gibt drei Arten von Lichtquellen:
Fackeln,&nbsp; Petroleumlampen (beide h&auml;ngen an den W&auml;nden) und
Kaminfeuer. Fackeln und Kaminfeuer kann man mit den sogenannten Wasserpfeilen
l&ouml;schen, um sich so besser unbemerkt bewegen zu k&ouml;nnen. Desweiteren
mu&szlig; man darauf achten keine Ger&auml;usche beim laufen zu machen.
Auf Teppichen h&ouml;rt man rein gar nichts, auf einen anderen Bodenbelag
kann unter Umst&auml;nden jeder Schritt ein lautes Ger&auml;usch hervor
rufen. Aber auch hier gibt es Abhilfe mit den Moospfeilen, die einen Moosteppich
an der Stelle hinterlassen, wohin der Pfeil gescho&szlig;en wird. Ger&auml;usche
spielen nicht nur bei Garrett eine wichtige Rolle, sondern auch die der
Wachen und Angestellten k&ouml;nnen sehr hilfreich sein. H&auml;ufig h&ouml;rt
man sie bevor man sie sehen kann. Man mu&szlig; also gut auf die Ger&auml;usche
achten, damit man Niemanden aus Versehen in die Arme l&auml;uft. Desweiteren
geben die gesprochenen S&auml;tze Aufschlu&szlig; dar&uuml;ber, ob man
schon endeckt wurde oder die Wachen v&ouml;llig ahnungslos sind. Dies macht
schon einen gewaltigen Unterschied: Sind die Wachen ahnungslos, laufen
sie sogar dicht an einem vorbei, ohne was zu bemerken, aber nat&uuml;rlich
nur solange man im dunkeln steht und keine schnellen Bewegungen macht.
Ferner sollte man kein Schwert oder Bogen in der Hand halten, da dies doch
trotz aller Dunkelheit auff&auml;llig ist.
<P>Sind die Wachen einmal gewarnt, entweder durch laute Ger&auml;usche
oder durch den Fund eines leblosen / ohnm&auml;chtigen Kollegen, bleibt
man nicht unendeckt wenn die Wachen einem sehr nahe kommen.Sie schleichen
sich dann geduckt durch die G&auml;nge und R&auml;ume und versuchen was
im Dunkeln erkennen zu k&ouml;nnen oder zumindest ein verr&auml;terisches
Zeichen von uns auszumachen. Es macht einen riesigen Spa&szlig; Wachen
in ein komplett abgedunkeltes Zimmer zu locken und dann feige von hinten
eins &uuml;berzubraten! Das ist gar nicht so einfach wie es sich anh&ouml;rt,
da sie in diesem Fall schon gewarnt sind und sich nicht mehr so leicht
&uuml;berraschen la&szlig;en.
<P>Es gibt auch einen L&auml;rmpfeil, der am Einschlagsort einen kurzen
Moment "Laufger&auml;usche" von sich gibt, wodurch W&auml;chter in diese
Richtung gelockt werden sollen. Vergleichbare Effekte erzielt man auch
mit diversen anderen Objekten, die man &uuml;berall finden kann (Kisten,
Vasen...), indem man sie in die Hand nimmt und sie in die gew&uuml;nschte
Richtung wirft. Damit ist das Sortimenet an Gimmicks beileibe noch nicht
zu Ende. Schon mal von einem Seilpfeil geh&ouml;rt? Wenn man solche Pfeile
in Holz-Balken oder -Decken schie&szlig;t, h&auml;ngt ein Seil herab woran
man hoch klettern kann, um an h&ouml;her gelegene Orte zu gelangen, wie
beispielsweise auf Balkons. Es gibt Blitzbomben, Gasgranaten, Heiltr&auml;nke
usw. usf. Solches Zubeh&ouml;r kann man in einem Laden erwerben, wo mit
dem erbeuteten Diebesgut bezahlt wird.
<P>Zur&uuml;ck zum Anfang. Wie kommen wir nun ins Brunnenhaus? Die einfachste
Methode ist zu warten, bis der eine W&auml;chter auf seiner Patroullie
aus unserem Blickfeld ist, sich dann hinter dem arglosen und besoffenen
W&auml;chter zu stellen, ihm den Schl&uuml;ssel zu klauen, dann damit die
T&uuml;r des Brunnenhauses aufzuschlie&szlig;en, reinzugehen und todesmutig
sich in den Brunnen zu st&uuml;rzen. Ein unterirdischer Flu&szlig; bringt
uns zum Kellergew&ouml;lbe von Lord Baffords Anwesen; das Abenteuer kann
beginnen!
<P>Es gibt die M&ouml;glichkeit jede Mission in drei verschiedenen Schwierigkeitsstufen
zu meistern. Der normale Modus begn&uuml;gt sich in der Regel damit, das
man das gew&uuml;nschte Objekt stiehlt und sich aus dem Staub macht. Im
Experten-Modus mu&szlig; man noch Diebesgut in einem bestimmten Wert zusammen
raffen und darf niemanden t&ouml;ten. Zudem ist dann auch die Anzahl der
Wachen erh&ouml;ht, was wirklich sehr reizvoll ist. Man schleicht mit echten
Herzklopfen durch dunkle, fiese und feuchte Gem&auml;uer und vergi&szlig;t
dabei ganz, das man eigentlich nur vor einem Monitor sitzt!
<P>Was mir bei <B><FONT COLOR="#3333FF">Project Dark</FONT></B> <B><I>positiv</I></B>
auffiel, war neben dem Spiel-Konzept und der relativ realistischen Spielumgebung,
die Sound-Qualit&auml;ten. Man kann sehr gut einsch&auml;tzen, aus welcher
Richtung die Ger&auml;usche kommen und wie weit weg der Ursprung liegt.
Auch die (Selbst-)Gespr&auml;che der W&auml;chter sind mitunter ziemlich
realistisch und interessant. Was mir auch gefiel, waren die &uuml;berraschenden
Wendungen in der Story, die ich nat&uuml;rlich an dieser Stelle nicht verraten
werde! :)
<P>Hmm, was richtig <B><I>negatives</I></B> ist mir eigentlich nicht aufgefallen,
jedenfalls nichts was den Spielspa&szlig; deutlich tr&uuml;ben k&ouml;nnte.
Sicher, die 3D-Engine kann es nicht mit <B><FONT COLOR="#3333FF">Half-Life</FONT></B>,
<B><FONT COLOR="#3333FF">Quake</FONT></B>
oder gar <B><FONT COLOR="#3333FF">Unreal</FONT></B> aufnehmen, was aber
wirklich nicht tragisch ist, da auch so gen&uuml;gend Atmosph&auml;re r&uuml;berkommt
und man den Schimmelpilz in den feuchten Gem&auml;uern zu riechen glaubt.
Mit dem zweiten Level hat man aber, meiner Meinung nach, richtig daneben
gegriffen: Zombies, Riesenspinnen und merkw&uuml;rdige Mini-Dinos bev&ouml;lkern
den riesigen Level. Diese Gestalten sind aber weit davon entfernt gruselig
zu sein, sondern nerven nur, da man hier mit der Anschleich-Taktik nicht
weit kommt, sondern nur die ganze Zeit diesen langsamen Kreaturen aus dem
Weg l&auml;uft und somit der Level zu einer Art Tomb Raider f&uuml;r Arme
verkommt! Auch wenn das Spiel halbwegs erfolgreich versucht hat, eine realistische
Spielumgebung zu schaffen, gibt es f&uuml;r den zweiten Teil noch gen&uuml;gend
Spielraum f&uuml;r Verbesserung. Zum Beispiel kann man, wenn man in einer
dunklen Ecke sicher vor den Blicken eines W&auml;chters ist, mit einem
Wasserpfeil eine Fackel direkt neben diesen W&auml;chter "ausschie&szlig;en",
ohne das er darauf reagiert.&nbsp; Offen stehende T&uuml;ren und verschwundene
Wertsachen verdutzen die Wachen ebenfalls nicht. Vasen die man auf einen
Steinboden wirft gehen nicht kaputt. Personen die mit dem Kn&uuml;ppel
ohnm&auml;chtig geschlagen wurden, sind praktisch "tot", das sie w&auml;hrend
des gesamten Spiels, wie lange es auch dauert, nicht mehr aufwachen. Ich
f&auml;nde es reizvoller, wenn solche Personen nach einer gewissen Zeit
wieder zu Bewu&szlig;tsein kommen und einem &Auml;rger bereiten k&ouml;nnten.
So aber kann man ohne Scheu durch bereits "ges&auml;uberte" Areale laufen,
da diese Bereiche auch weiterhin keine Gefahr mehr bieten, weshalb in diesen
Gebieten der Nervenkitzel endeckt zu werden, auch gleich Null ist.
<P>Ach ja, die Auto-Map k&ouml;nnte auch wesentlich detaillierter sein,
denn in den seltensten F&auml;llen war sie mir wirklich eine Hilfe. Auch
wenn jetzt der Negativ-Absatz l&auml;nger war, als der Absatz &uuml;ber
die positiven Aspekte des Spiels, bedeutet das nicht, das das Spiel schlecht
w&auml;re, wie meine Bewertung zeigt:
<BR>&nbsp;
<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GRAFIK/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">65 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">SOUND/FX:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">85 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<TABLE BORDER COLS=22 WIDTH="440" BGCOLOR="#000000" >
<TR>
<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">GAMEPLAY:</FONT></B></CENTER>
</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#00CC00">&nbsp;</TD>

<TD BGCOLOR="#33FF33">&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD>&nbsp;</TD>

<TD WIDTH="100" BGCOLOR="#FFFFFF">
<CENTER><B><FONT COLOR="#FF0000">85 %</FONT></B></CENTER>
</TD>
</TR>
</TABLE>

<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="100%" BGCOLOR="#FFCC99" >
<TR>
<TD ALIGN=CENTER VALIGN=CENTER>
<CENTER><B>Wie wird bewertet?</B></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC">Selbstverst&auml;ndlich ist die Bewertung der einzelnen
Komponenten v&ouml;llig subjektiv, soll also nur zur groben Einsch&auml;tzung
des Spieles dienen. Desweiteren wird nur in 5%-Schritten und systembezogen
bewertet. Da die Grafik- und Sound-Bewertungen wohl f&uuml;r sich sprechen,
gehe ich nicht weiter darauf ein. Das Gameplay-Element bedarf aber einer
kurzen Erkl&auml;rung: Die Gameplay-Bewertung ist eine Melange aus der
Steuerung der Spielfigur oder des Fahrzeuges (Ist die steuerung zu ungenau,
zu schwammig,...) und der Bewertung des Levelaufbaus (Unfaire Stellen die
Frust aufkommen lassen?). Hat ein Spiel eine hohe Gameplay-Wertung, dann
machte es einfach Spa&szlig; dieses Spiel zu spielen und keine schlechte
Steuerung oder schlechtes Spieldesign konnte die Freude verderben! Obwohl
bei dieser Bewertung die Grafik und der Sound &uuml;berhaupt nicht miteinflie&szlig;en,
sollte man die Gameplay-Wertung durchaus als die <U>Endwertung</U> des
Spiels betrachten!&nbsp;</TD>
</TR>
</TABLE>

<BR>&nbsp;
<CENTER>
<P><IMG SRC="mm_fastbar.gif" HEIGHT=58 WIDTH=580></CENTER>

<CENTER>
<H2>
<P><B>NURBS: Die 3D-Technologie der Zukunft?</B></H2></CENTER>

<CENTER><B><FONT COLOR="#CC0000">Echte Virtual Reality allein durch mehr
Polygone?!</FONT></B></CENTER>

<P>Seit <B><FONT COLOR="#3333FF">Doom</FONT></B>, einem der 3D-Games der
ersten Stunde, hat sich einiges im 3D-Bereich getan. Besonders bei Spielen
hat die Grafik im Vergleich zum Ur-<B><FONT COLOR="#3333FF">Doom</FONT></B>
wahre Quantenspr&uuml;nge hinter sich. Durch schnelle CPU&acute;s und leistungsf&auml;hige
Grafikchips wurde es m&ouml;glich, immer mehr Polygone zu zeichnen, h&ouml;here
Aufl&ouml;sungen zu benutzen und dazu aufwendigere Texturen bei einer gleichzeitig
h&ouml;heren Farbtiefe zu verwenden. Aber wenn man genau hinsieht, sind
selbst Spiele wie <B><FONT COLOR="#3333FF">Unreal</FONT></B> weit davon
entfernt, wirklichkeitsgetreue Grafiken bieten zu k&ouml;nnen.
<P>Die reale Welt ist voll von runden Formen und Kurven. Polygone hingegen
sind eckige Gebilde. Es ist zwar m&ouml;glich auch mit Polygonen runde
Formen darzustellen, aber nur mit einem nicht zu untersch&auml;tzenden
Aufwand. Um so runder eine Form dargestellt werden soll, um so mehr Polygone
werden daf&uuml;r auf den kleinsten Raum ben&ouml;tigt. Das mag zwar nicht
sonderlich schwierig klingen, da aktuelle PC&acute;s und Konsolen sehr
viele davon darstellen k&ouml;nnen, aber die Wahrheit sieht leider etwas
anders aus. Das gestalten der Polygon-Modelle wird dadurch immer aufwendiger
und schwieriger. Auch die Grafik-Engines m&uuml;&szlig;en mit immer mehr
Polygone zurecht kommen, wodurch das programmieren einer guten 3D-Engine
zunehmend schwieriger wird. Es kommt nicht nur auf die Schnelligkeit der
CPU an, sondern auch auf die F&auml;higkeiten der Programmierer. Die 3D-Engines
werden umfangreicher und komplizierter, dadurch aber auch fehleranf&auml;lliger.
Die Entwicklungszeit w&auml;chst ebenso an wie die Entwicklungskosten.
Auch die Hardware wird in h&ouml;chsten Ma&szlig;e in Anspruch genommen,
da immer mehr Arbeitsspeicher und Rechenzeit f&uuml;r die Verwaltung und
die Darstellung der Polygon-Modelle ben&ouml;tigt wird.
<P>Zudem ist irgendwann ist auch der Punkt erreicht, wo das Ergebnis den
Aufwand nicht mehr rechtfertigt. Als der Chef von <B>Sega Europe</B> bezogen
auf das <B><FONT COLOR="#CC0000">Dreamcast</FONT></B> gefragt wurde, ob
er die Konkurrenz <B><FONT COLOR="#CC0000">Playstation 2</FONT></B> f&uuml;rchte,
meinte er sinngem&auml;&szlig;: <I>Auch wenn Sonys zuk&uuml;nftige Hardware
noch mehr Polygone darstellen k&ouml;nne</I> (er nannte als Beispiel f&uuml;nf
Millionen Polygone pro Sekunde), <I>w&uuml;rde das keine gro&szlig;en Fortschritte
auf der Grafikebene mit sich bringen, da kein Entwickler solche Mengen
nutzen w&uuml;rde</I>.
<P>Das die herk&ouml;mmliche 3D-Grafik auf Polygon-Basis nicht unbedingt
der Weisheit letzter Schlu&szlig; ist, erkannte schon vor etwa 1,5 Jahren
der PSX-Vater <B>Ken Kutaragi</B>, der meinte das man neue Techniken entwickeln
m&uuml;&szlig;e, um den Kunden ein radikal besseres, realistischeres 3D-Vergn&uuml;gen
bieten zu k&ouml;nnen. Und nun sind wir bei der <B>NURBS</B>-Technologie
angekommen, &uuml;ber die die Playstation 2 wohl definitiv verf&uuml;gen
wird!
<P><B>NURBS</B> steht f&uuml;r "<B>N</B>on-<B>U</B>niform <B>R</B>ational
<B>B</B>-Line<B>s</B>".
Grob gesagt bezeichnet dieser Begriff eine Linie, die durch eine mathematische
Formel definiert ist und die Umri&szlig;linien eines 3D-Modells bildet.
Wie sieht es in der Praxis aus? Zwar malt der Grafik-Chip am Ende immer
noch Polygone, mit diesem Part kommt aber der Entwickler nicht mehr in
Ber&uuml;hrung. Man f&uuml;ttert die Maschine mit echten, runden K&ouml;rpern
und Welten, bestimmt wo die Kamera sein soll - und den Rest erledigt der
Chip. Das Interessante: Je nach Blickwinkel der Kamera werden jedem Detail
pro Bildschirmaufbau (also bis zu 60 mal die Sekunde) automatisch so viele
Polygone zugeteilt, wie in diesem Augenblick n&ouml;tig sind, um das Aussehen
des runden Originalk&ouml;rpers vorzugaukeln. Befindet sich ein 3D-Charakter
nahe vor der Kamera, wird die Hardware ihm von den insgesamt angeblichen
5 bis 7 Millionen Polygonen der <B><FONT COLOR="#CC0000">PSX 2</FONT></B>
wohl mehrere Hundertausend zuteilen. Ist er weit in der Distanz positioniert,
endet der Charakter mit drei&szlig;ig Polygonen. Dieses permanente sogenannte
Echtzeit-Tesselieren macht nicht nur unglaublich realistische K&ouml;rper
in der Nahansicht m&ouml;glich, sondern gleichzeitig auch erhebliche Blicktiefen
- und alles ohne gro&szlig;en Speicherverbrauch, denn das eigentliche Modell
steht nur einmal, in seiner optimalen Form, im Speicher bereit und wird
laufend in Echtzeit in Polygone umgesetzt.
<P>Ihr kennt sicherlich die Dinos aus <B>Jurrasic Park</B> 1+2: Ihr k&ouml;nnt
noch so lange mittels der Zeitlupe-Funktion eures Videorekorders die Dinos
auf&nbsp; Ecken und Kanten untersuchen - ihr werdet keine finden, denn
diese Dinos wurden mit der <B>NURBS</B>-Technologie erschaffen. Ein Bump-Mapping
der Texturen sorgte schlie&szlig;lich f&uuml;r die rauhe Oberfl&auml;che
der Dinosaurier. Dieselbe Technologie findet ihr bei dem <B>Shiny</B>-Spiel
<B><FONT COLOR="#3333FF">Messiah</FONT></B>
wieder, welches gerade f&uuml;r
<B>PC</B> und <B>Playstation</B> in Entwicklung
ist. Hier werden aber nur die Charaktere tesseliert, die 3D-Umgebung wird
konventionell dargestellt. Wieso eigentlich nur die Figuren und nicht das
ganze Spiel? Und &uuml;berhaupt, wieso ist diese Technik heute nicht gang
und g&auml;be?
<P>Um das ganze Shiny-Spiel mit der <B>NURBS</B>-Technologie auszustatten,
fehlt selbst dem schnellsten <B>Pentium-II</B>-Prozessor die n&ouml;tige
Power. Wenn man die Umwandlung der Polygone auf die herk&ouml;mmliche Form
von der CPU erledigen l&auml;&szlig;t, sind die Anspr&uuml;che an die Leistungsf&auml;higkeit
des Prozessors gigantisch. Sony wird diese Umwandlung von der Hardware
mittels eines Spezial-Chips vornehmen lassen, wodurch die Haupt-CPU davon
verschont bleibt und sich nur noch darauf zu konzentrieren braucht, so
viele Polygone wie m&ouml;glich zu zeichnen!
<P>Zwar sollen erst in diesem Februar offiziell die Fakten zur <B>Playstation
2</B> bekannt gemacht werden, aber viel deutet darauf hin, das die derzeit
bekannten Ger&uuml;chte der Wahrheit verdammt nahe kommen! Waren technisch
gesehen die beiden Kontrahenten <B>Playstation</B> und <B>Saturn</B> noch
nahe beieinander, k&ouml;nnte Sonys zweiter Streich <B>Dreamcast</B> deutlich
in manchen wichtigen Bereichen toppen:
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=0 CELLSPACING=2 CELLPADDING=2 WIDTH="100%" >
<TR>
<TD></TD>

<TD ALIGN=CENTER VALIGN=CENTER BGCOLOR="#FFFFCC"><B>Dreamcast</B></TD>

<TD ALIGN=CENTER VALIGN=CENTER BGCOLOR="#FFFFCC"><B>PSX 2</B></TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC"><B>Video-Qualit&auml;t:</B></TD>

<TD>
<CENTER><FONT COLOR="#3333FF">MPEG-1</FONT></CENTER>
</TD>

<TD>
<CENTER><FONT COLOR="#3333FF">MPEG-2</FONT></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC"><B>Datentr&auml;ger-Medium:</B></TD>

<TD>
<CENTER><FONT COLOR="#3333FF">CD-ROM (Spezial-Format)</FONT></CENTER>
</TD>

<TD>
<CENTER><FONT COLOR="#3333FF">DVD</FONT></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC"><B>Datentr&auml;ger-Kapazit&auml;t:</B></TD>

<TD>
<CENTER><FONT COLOR="#3333FF">Etwa 1,2 GB</FONT></CENTER>
</TD>

<TD>
<CENTER><FONT COLOR="#3333FF">Bis 17 GB</FONT></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC"><B>Grafik-Technik:</B></TD>

<TD>
<CENTER><FONT COLOR="#3333FF">Konventionelle Polygon-Technik</FONT></CENTER>
</TD>

<TD>
<CENTER><FONT COLOR="#3333FF">NURBS-Technologie</FONT></CENTER>
</TD>
</TR>

<TR>
<TD BGCOLOR="#FFFFCC"><B>Anzahl der Polygone/Sek.:</B></TD>

<TD>
<CENTER><FONT COLOR="#3333FF">3 Millionen</FONT></CENTER>
</TD>

<TD>
<CENTER><FONT COLOR="#3333FF">5-7 Millionen</FONT></CENTER>
</TD>
</TR>
</TABLE>

<P>Wann kommen die beiden Konsolen nach Europa? <B>Dreamcast</B> im September
&acute;99, <B>PSX 2</B> h&ouml;chstwahrscheinlich Ende &acute;99 in Japan
und Mitte 2000 in Europa. &uuml;brigens darf man im Jahre 2000 zumindest
in Japan mit einer neuen Konsole von Nintendo rechnen!
<P><B><U>Nachtrag 20.03:</U></B>
<P>Auf der International Solid-State Circuits Conference, die Mitte Februar
in San Fransico stattfand, stellten Sony und Toshiba die gemeinsam entwickelte
CPU namens <B>Emotion Engine</B> vor, welches in einer "<I>high volume
consumer media application</I>" Verwendung finden soll. Zwar gab Sony keine
direkte Antwort auf die Frage, ob diese CPU in der <B>PSX 2</B> verwendet
werden wird, aber keiner in der Fachwelt zweifelt ernsthaft daran.
<P>Was leistet denn nun die <B>Emotion Engine</B>? Der Chip besteht aus
der mit 250 Mhz getakteten echten 128-Bit-CPU (Die Dreamcast CPU ist strengenommen
"nur" eine 64-Bit-CPU) inklusive Floating-Point-Unit (FPU) und zwei Vector
Processor Units (VPU 0 und 1). Der interne Datenbus hat eine &Uuml;bertragungsrate
von 2 Gigabyte pro Sekunde. Theoretisch kann die Einheit 55 Millionen Polygone
in der Sekunde zeichnen, mit allen Effekten immerhin noch 13 Millionen!
Zu diesen Effekten geh&ouml;ren &uuml;brigens Bezier-Kurven, eine Variante
der NURBS-Technologie. Diese Zahl ist aber deswegen nur theoretisch, da
die Haupt-CPU diese 13 Millionen Polygone nur dann erzielen kann, wenn
sie nicht anderes zu berechnen hat, wie zB. die k&uuml;nstliche Intelligenz
bei Spielen. Aber selbst 3 bis 6 Millionen Polygone w&auml;ren eine sensationelle
Zahl. Der oft zu h&ouml;rende Vergleich mit den 8 Millionen (nackten) Polygonen
der <B>Voodoo-3-Karte</B> ist v&ouml;llig fehl am Platz, denn dabei handelt
es sich um eine reine Grafikkarte: Und der erneut von LSI entwickelte Grafikchip
f&uuml;r die <B>PSX 2</B> soll problemlos 20 Millionen Polygone erzeugen
k&ouml;nnen!
<P>Da fragt man sich nat&uuml;rlich, wie Sony es schaffen will, eine so
neue und sicherlich teure Technologie in "billige" Konsolen zu stecken.
Tatsache ist, das der Videospielmarkt inzwischen das ertragreichste Segment
des Elektronikkonzerns ist. Es wurden weltweit &uuml;ber <B>50.000.000</B>
(50 Millionen!) Playstations verkauft und ein Ende ist immer noch nicht
abzusehen. Um die Gr&ouml;&szlig;enverh&auml;ltnisse besser einsch&auml;tzen
zu k&ouml;nnen: Das PC-Spiel <B>Command &amp; Conquer 2</B> hat auf dem
PC-Markt s&auml;mtliche Verkaufsrekorde gebrochen, mit &uuml;ber 2 Millionen
Exemplare. Von <B>Gran Turismo</B>, wurden auf der Playstation - trotz
dem hohen Anteil der Raubkopien - weit &uuml;ber 6 Millionen Exemplare
verkauft! Am 11. Februar wurde in Japan <B>Final Fantasy VIII</B> ver&ouml;ffentlicht
und in den ersten zwei Tagen (11. &amp; 12. Februar) 4,8 Millionen mal
verkauft! Und das nur in Japan: USA und Europa noch gar nicht mitgez&auml;hlt!
F&uuml;r Sony ist der Videospielmarkt inzwischen auf der Priorit&auml;tenliste
ganz nach oben, auf Platz eins gerutscht. Sony wird mit hohem Einsatz spielen
und mit einem Preisdumping bei der neuen Konsole beginnen und notfalls
draufzahlen!
<P>Sony hat die Resourcen und das n&ouml;tige Geschick um auch bei der
n&auml;chsten Konsolengenration die unumstrittene Nr. 1 zu bleiben. W&auml;hrend
Sega mit dem <B>Dreamcast</B> eine rundum modernisierte 32-Bit-Konsole
vorlegt, die mit aktuellen PC&acute;s gut mithalten kann, fehlt es dennoch
an innovativen oder revolution&auml;ren Ideen (mal von den Features wie
Online-F&auml;higkeit und dem VMS abgesehen). Sony setzte schon bei der
Einf&uuml;hrung der Playstation neue Ma&szlig;st&auml;be: Urspr&uuml;nglich
sollte Segas neues Schlachtschiff, der Saturn, bei weitem nicht diese 3D-F&auml;higkeiten
haben, aber durch Sonys Ank&uuml;ndigungen wurde Sega &uuml;berrascht und
die Pl&auml;ne schnell &uuml;berarbeitet. Als dann die PSX (kurz darauf
auch der Saturn) auf den Markt kammen, sah selbst die damals brandneue
Pentium-Generation gegen die Konsolen verdammt schlecht aus. Die s&uuml;ndhaftteuren
Pentiums 60/90 mit 16 MB Ram eroberten zwar langsam den Homeconsumermarkt,
aber selbst stolzen Pentium-Besitzer fiel die Kinnlade runter, wenn sie
<B>Wipeout</B>
oder <B>Ridge Racer</B> &uuml;ber die Bildschirme flimmern sahen. Es brauchte
spezielle 3D-Karten und eine neue Pentium-Generation um die Konsolenspiele
technisch endg&uuml;ltig zu &uuml;berfl&uuml;geln.
<P>Was bringt das <B>Dreamcast</B> auf die Waagschale? Bei aller Begeisterung
f&uuml;r Segas kleinen, grauen Kasten, aber <B>Dreamcast</B> zieht nicht
m&uuml;helos an Pentium-II-PC&acute;s mit einer 3D-Karte der 2. Generation
vorbei, sondern siedelt sich "nur" in denselben oberen Leistungsregionen
an (Bei geschickter Programmierung der Hardware gibts vielleicht noch einen
kleinen Vorteil). Vergleicht man diese Situation mit 1994, ist Dreamcast
sogar eher ein kleiner R&uuml;ckschritt! Sony hingegen kleckert nicht,
sondern klotzt. Die <B>PSX 2</B> soll M&auml;rz 2000 in Japan erscheinen
und Ende des Jahres in USA und Europa. Zudem wird die <B>PSX 2</B> h&ouml;chstwahrscheinlich
abw&auml;rtskompatibel zur Playstation sein! Die ersten Entwicklungskits
wurden jedenfalls Ende letzten Jahres an die ersten japanischen Entwickler
geschickt.
<P>Frage: Wird bei erscheinen der <B>PSX 2</B>, die Emotion-Engine und
die ganze Hardware an sich, immer noch um Welten besser als die ganze Konkurrenz
(Dreamcast, Spielautomaten &amp; PC) sein? Fachleute haben dies jedenfalls
eindeutig bejaht, und ich meine, wenn man sich mal anschaut, was die Pentium-III-Generation
so an Leistungssteigerung bringt, glaube ich das auch gerne! Wer meint
der Pentium-III stelle eine gro&szlig;e Leistungssteigerung gegen&uuml;ber
dem Pentium-II dar und Windows 2000 w&uuml;rde eine deutlich bessere Variante
von Windows 98 darstellen, darf weiter tr&auml;umen!
<P>An dieser Stelle ein kleiner Hinweis: AI hat f&uuml;r den neuen Amiga
angek&uuml;ndigt, das dieser in der Lage sein soll, bis zu <B>drei</B>
(!) MPEG-2-Videos gleichzeitig ruckelfrei abzuspielen (gilt vielleicht
nicht unbedingt f&uuml;r das Low-Cost-Modell). Sony und Toshiba verk&uuml;ndeten
stolz, das die <B>Emotion Engine</B> beim abspielen eines MPEG-2-Videos
nur zu 50 % ausgelastet sei, was ja bedeutet das diese CPU maximal zwei
solcher Videos gleichzeitig abspielen kann! Und das ist schon verdammt
viel!!! Also an die N&ouml;rgler unter euch, die AI vorwarfen, das die
angek&uuml;ndigten Daten beim Erscheinen veraltet seien: La&szlig;t uns
AI die Daumen dr&uuml;cken, das sie mit ihren Bem&uuml;hungen Erfolg haben
werden!!!
<P><B><U>Wie ich die nahe Zukunft sehe:</U></B>
<P>Dreamcast wird ein gr&ouml;&szlig;erer Erfolg als der Saturn und schafft
es mit etwas Gl&uuml;ck Nintendo in arge Bedr&auml;ngnis zu bringen. Die
betagte Playstation sitzt weiter fest im Sattel. Bei erscheinen der PSX
2 verlieren Nintendo und Sega stark an Bedeutung, wie seinerseit der Mac
und Amiga gegen&uuml;ber dem PC. Nintendo wird zuerst mit einer neuen Hardware
zur&uuml;ckschlagen (2000/2001). Sollte Nintendos neue Hardware alles andere
als nahezu Perfekt sein, wird sich an der inzwischen trostlosen Situation
von Nintendo nichts wesentlich &auml;ndern! Fazit: Sony wird nicht nur
diese Konsolengeneration dominieren, sondern seine Dominanz in der n&auml;chsten
sogar ausbauen k&ouml;nnen! Sorry, Sega und Nintendo!!!
<P>
<HR SIZE=4 NOSHADE WIDTH="100%">
<P><U>credits</U>
<BR><B>HTML-EDITOR</B>&nbsp; <I><FONT COLOR="#993366">netscape composer</FONT></I>
<BR><B>AMIGA TEST-BROWSER</B>&nbsp; <I><FONT COLOR="#993366">voyager ng
2.88 / ibrowse aminet version</FONT></I>
<BR><B>AMIGA TEXT-EDITOR</B>&nbsp; <I><FONT COLOR="#993366">golded 4 demo</FONT></I>
<BR><B>TEXT &amp; LAYOUT</B>&nbsp; <I><FONT COLOR="#993366">mark tom</FONT></I>
<P>
<HR SIZE=4 NOSHADE WIDTH="100%">
<H1><FONT COLOR=RED>
<B><CENTER><A HREF="nocover.html">  Zurck zum Inhaltsverzeichnis der No Cover  </FONT></A>
</CENTER>
</BODY>
</HTML>
