<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Hypertext: Hypertext, Computer und Computernetze</title>
</head>

<body background="wol1.jpg" text=black link=blue alink=red bgcolor=gray>
<p>
<center><font color="#000080" size="5"><b>Hypertext, Computer und Computernetze</b>
</font></center></p>

<font size="+1">
<p>Hypertext wird heute ausschlie&szlig;lich auf Computern realisiert, weil
Computer die spezifischen Anforderungen eines Hypertextes hervorragend
unterst&uuml;tzen. In der Vergangenheit gab es jedoch auch Versuche, so etwas
wie Hypertext mit herk&ouml;mmlichen Mitteln zu realisieren. So kam in den
fr&uuml;hen siebziger Jahren ein didaktisches Konzept in Mode, das sich
&quot;programmierte Unterweisung&quot; nannte. Es handelte sich um B&uuml;cher,
die man nicht sequentiell lesen konnte, sondern die so aufgebaut waren,
da&szlig; der Sch&uuml;ler kleine Informationsh&auml;ppchen oder Fragen
angeboten bekam und dazu eine Auswahl an Querverweisen zu anderen Stellen im
Buch. Auch die Verweisziele waren Informationsh&auml;ppchen oder Kommentare zu
der ausgew&auml;hlten Antwort mit neuen Querverweisangeboten zu anderen Stellen.
</p>

<p>Es zeigte sich jedoch, da&szlig; das viele Bl&auml;ttern in solchen
B&uuml;chern nicht gerade die Konzentration auf den Lehrstoff f&ouml;rderte.
Hier sind Computer weit &uuml;berlegen. Ein Klick mit der Maus auf einen
Verweis, und das gew&uuml;nschte Verweisziel wird angezeigt. Dieser Komfort wird
freilich mit einem Nachteil bezahlt: einem im Computer verf&uuml;gbaren
Hypertext kann man nicht ansehen, wie gro&szlig; er ist, d.h. man kann sich
keine rechte Vorstellung davon machen. Hypertext-interne Techniken wie
<b>Web-Views</b> versuchen diesen Nachteil auszugleichen.</p>

<p>Da &uuml;ber erstaunlich wenige Gedankenspr&uuml;nge aber alles mit allem
vernetzbar ist, haben Hypertexte die Tendenz, potentiell allumfassend zu sein.
Deshalb sind lokal auf einem Computer oder Speichermedium verf&uuml;gbare
Hypertexte auf die Dauer unbefriedigend. Auch kam schon fr&uuml;h (bereits 1965
bei Ted Nelson) der Wunsch auf, Hypertext-Einzelprojekte weltweit zu vernetzen.
Doch erst Ende der achtziger Jahre, als das Thema Hypertext in weiteren Kreisen
diskutiert wurde, wurde die Idee geboren, das weltweite Internet f&uuml;r einen
Hypertext-orientierten Dienst zu nutzen. Aus diesen &Uuml;berlegungen entstand
Anfang der neunziger Jahre schlie&szlig;lich das World Wide Web.</p>
</font>

<hr>
gehe &#160; <a href="st_hypertext.html"> zurück zur Hauptseite</a><br>
oder &#160; <a href="st_hypertext5.html"> zum n&auml;chsten Kapitel</a><br>
</body>
</html>
