<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wol1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#808080"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">NC l&#228;uft &#252;ber
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Amiga vs PC
</font></a></p>
<p><a href="#a3"><font size="1" face="arial">NoCover Index
</font></a></p>
<p><a href="#a4"><font size="1" face="arial">Feedback
</font></a></p>

<p><center> <a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0></a><br><br><br>
<font size="2"> eMail: </font> <a href="mailto:wozim@t-online.de">
<font size="1" face="arial">wozim@t-online.de</font></a>
</center></p>
<p><a href="NoCover.html#a14"><font size="1" face="arial">Zur&#252;ck zum NoCover-Index
</font></a></p>
</td>
<td valign="top">
<a name="a1"><font color="800000" size="7"><center>
<b>NoCover l&#228;uft &#252;ber </font></b></a></center><br>
<p>
Uwe Brunen hat sich Gedanken gemacht, wie der Umfang der NoCover durch Teilung
der variablen und festen Daten effektiver gestaltet werden k&#246;nnte. Es hat
vordergr&#252;ndig wirklich etwas f&#252;r sich, die wiederkehrenden festen
Daten einmal zu versenden und dann monatlich quasi ein Update herauszugeben.
Diese Methode h&#228;tte wirklich aber nur dann Sinn, wenn die Empf&#228;nger
der NoCover einen festen Kundenstamm darstellten und es auch keine Fluktuation
auftreten w&#252;rde. Neukunden m&#252;ssten gesondert behandelt werden. Ein
weiterer Hinderungsgrund ist aber dann der starre Rahmen der NoCover, der wie
eine Fessel festgelegt ist und eine Modifikation des Outfits w&#228;re fast
nicht m&#246;glich, respektive nur wieder mit einem erforderlichen Update der
Grunddatei.</p>
<p>
Die Leserschaft der NoCover besteht aber nicht nur aus den zahlenden Mitgliedern
des Clubs, sondern rekrutiert sich auch aus Aussenstehende, die z.B. die NoCover
sich aus dem Aminet oder von der Club Homepage downloaden k&#246;nnen. Im
Impressum gibt Andreas die Zahl 130 als Abonenten an, aber sch&#228;tzt die
Leser auf 10.000. Und sollten es nur 10% der Sch&#228;tzung sein, dann sind dies
immer noch 1000, die keine vollst&#228;ndige NC mehr vorfinden w&#252;rden.</p>
<p>
Eine Splittung einer Vollversion und einer Updateversion der NoCover ist
f&#252;r einen Einmannbetrieb viel zu aufwendig und vollkommen unzumutbar und
deshalb indiskutabel. Schon der damalige Ansatz eines Versuches beim
Diskettenversand beide M&#246;glichkeiten (DD und HD) zu verwenden, war wegen
des Zeitaufwandes zum Scheitern verurteilt, weil jede Form u.a. einen eigenen
Installerscript ben&#246;tigt.</p>
<p>
Sollte der NoCover durch Straffung geholfen werden, gibt es f&#252;r jedermann
die M&#246;glichkeit, einen Rahmenvorschlag mit entsprechend weniger
bytesfressenden Grafiken (GIF-Bildchen) bei Andreas zur Begutachtung vorzulegen.
Ein weiterer Vorschlag ist schon immer gewesen, auf aufwendige und zu gro&#223;e
JPG-Pictures zu verzichten und daf&#252;r mehr und lesbaren Texte
einzusenden.</p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
</td></tr></table>
<a name="a2"><font color="800000" size="7"><center>
<b>Amiga vs PC</font></b></a></center><br>
<p>
Keine Angst, ihr werdet keine Abhandlung &#252;ber das <b>F&#220;R</b> oder das
<b>GEGEN</b> lesen. Es verwundert mich nur, dass dieses leidliche Thema wieder
so aufgeflammt ist. Artikel werden seit NoCover#1 dar&#252;ber verfasst und
zeitweise wurde eine richtiggehende Orgie daraus entwickelt, besonders wenn
eklatantes Unwissen vorlag. Es ist doch viel informativer, wenn anstelle dieses
leidlichen Themas andere Artikel erscheinen w&#252;rden und wenn es eine
detaillierte Beschreibung und Darstellung des geschichtlichen Hintergrundes
eines Gegenstandes aus dem &#246;rtlichen Heimatmuseum w&#228;re.
Selbstverst&#228;ndlich gibt es wieder welche, die dar&#252;ber schimpfen und
sagen, was hat das mit Amiga zu tun? Aber lesen tuen es alle und irgendetwas
Wissen bleibt dann vielleicht haften. Der Sinn dieses Artikels ist also damit
erreicht.</p>
<p>
Das Warten auf eine neue Generation des Amigas h&#228;lt noch weiter an und bis
es dann soweit ist, vertreiben wir uns halt die Zeit mit sinnvollen und
lesenswerten Themen. Und wenn die neuen Amigas einmal in zwei oder drei Jahren
im Handel in den Regalen stehen werden, dann schauen alle, aber die wenigsten
kaufen sofort. Alle warten dann auf irgendeine M&#246;glichkeit der
Kompatibilit&#228;t mit dem eigenen nun veralteten Hobel und schimpfen erneut.
Wenn ich einen alten VW K&#228;fer fahre, komme ich auch von M&#252;nchen nach
Hamburg und mache mir keine Gedanken dar&#252;ber, wie die anderen 33
Familienmitglieder, die auch nach Hamburg wollen, dorthin kommen. Deswegen kaufe
ich f&#252;r diese eine Fahrt doch keinen Bus. Na gut das Beispiel war nicht
besonders orginell, aber ein ganz klitzekleines bisschen Wahrheit steckt schon
dahinter, obwohl der Geschwindigkeitsgewinn in diesem Beispiel nicht
ber&uuml;cksichtigt wurde.
</p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<a name="a3"><font color="800000" size="7"><center>
<b>NoCover-Index </font></b></a></center><br>
<p>
Auf meiner Homepage: <a href="http://home.t-online.de/home/wozim">
http://home.t-online.de/home/wozim </a> habe ich neuerdings auch ein Update zum
NC-Index zum Downloaden eingerichtet. Hier sind alle Ver&#228;nderungen seit der
letzten NoCover enthalten. Wer aber einen Monat ausgelassen hat, muss schon das
gesamte Verzeichnis ziehen, denn das Update betrifft nur die Ver&#228;nderung
des letzten Monats. Sollte der Wunsch nach E-Mail Versand des Updates bestehen,
dann kann dieses eingerichtet werden. </p>
<p>
Nun nochmals eine Bitte. Schreibt bitte bitte euren Namen zu den Artikeln.
Manche Pseudonyme muss ich erst immer nachlesen, wozu ich eine Querverweisdatei
einrichen m&#252;sste, wenn diese Unart wieder einrei&#223;t. Andere vergessen
jegliches Signum. Im NC-Index erscheinen hier halt f&#252;nf Fragezeichen unter
Autor.</p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<a name="a4"><font color="800000" size="7"><center>
<b>Feedback </font></b></a></center><br>
<p>
Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b>ABackup &amp; DSP</b> von Kilian Servais</li>
<li> <b>Listen</b> von Markus Castro</li>
<li> <b>Network</b> von Christian Schmidt (geh&ouml;rt nach Tools Theke)
<br>- Windows89 kenne ich nicht ;-)</li> 
<li> <b>Pro Pain: act of god</b> von Fabian Kruse</li>
<li> <b>STP</b> von Thomas Windecker</li>
</ul>
Diesesmal h&auml;tte ich die Liste um weitere Beitr&auml;ge erh&ouml;hen k&ouml;nnen.
<p>Nachwort:<br>
In der NC-61 ist ein Hauptkonsens vieler Artikel/Leserbriefe das Vermissen der
Feedback Corner. Ich will jetzt nicht nachgraben, wer sich hier freiwillig als
Ansprechstelle gemeldet hatte, als der Initiator Cord Hagen diese Arbeit abgeben
musste. Als diese Institution eingerichtet wurde, gab es viel Harnisch, Schl&auml;ge
und Besserwisserei. Jetzt wo kein Feedback mehr kommt, da weinen alle. Also ran
an die Buletten. Aber mich lasst draussen vor. Das habe ich schon von Anfang an
zu Cord gesagt, da ich weiss, dass ich zu kritisch und auch zu einseitig bin.
Ich habe echt kein Feeling z.B. f&uuml;r Spieleberichte und schon fehlt ein gro&szlig;er
Sektor in der R&uuml;ckbetrachtung. Aber Ihr die Angesprochenen macht das schon.
<hr>
<center>
<table border="0" width=100% bgcolor="#808080"><tr><td>
<br>
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
<br><br>Gehe zum &#160; <a href="#top"> Anfang </a><br>
oder zum &#160; <a href="NoCover.html#a14"> NoCover-Inhaltsverzeichnis </a><br>
</table></center><br>
</body>
</html>
