<HTML>
<HEAD><TITLE>
Das AMIGA-aktuell-Gewinnspiel
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0301.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0303.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Das AMIGA-aktuell-Gewinnspiel
</font>
</TD></tr>
</TABLE>


<P>

<H2>Die neuen Preise</H2>


Und jetzt gibt es f&#252;r alle eine neue Chance auf einen Preis:
<P>
<B>Frank Weber hat sein Programm AFiloFaxPro f&#252;r das Gewinnspiel zur Verf&#252;gung
gestellt:</B>
<P>
&#171;AFiloFaxPro managet Ihr t&#228;gliches Leben. Dazu bietet es eine umfangreiche
Terminplanerfunktion und dar&#252;ber hinaus Features wie einen elektronischen
Notizblock oder Statistikfunktionen, die u.a. die t&#228;gliche Computerlaufzeit
protokollieren. (Unterst&#252;tzt MUI)&#187;
<P>
Eine Demo-Version des Programms ist im Aminet verf&#252;gbar.
<P>
Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:
<P>
Frank Weber<BR>
Schlizstra&#223;e 53<BR>
74076 Heilbronn<BR>
Deutschland
<P>
E-Mail: <A HREF="mailto:fweber@amigaworld.com">fweber@amigaworld.com</A>
<P>
<B>Peter Elzner hat sein Programm Diamond Caves II f&#252;r das Gewinnspiel zur
Verf&#252;gung gestellt:</B>
<P>
&#187;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&#246;hle m&#252;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&#252;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&#252;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.<BR>
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
schneller Prozessor empfohlen, MUI wird f&#252;r den Editor ben&#246;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&#228;nkt
Registrierte Version: 40 DM&#171;
<P>
Eine Demo-Version kann von <A HREF="http://www.diamond-pro.com">http://www.diamond-pro.com</A> heruntergeladen
werden.
<P>
Der Autor ist unter folgender Adresse erreichbar:
<P>
Peter Elzner<BR>
Grudene 6a<BR>
58644 Iserlohn
<P>
E-Mail: <A HREF="mailto:order@diamond-pro.com">order@diamond-pro.com</A> (Bestellungen) bzw.
<A HREF="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</A> (Fragen)
<P>
<B>Stephan Rupprecht hat sein Programm PrintManager f&#252;r das Gewinnspiel zur
Verf&#252;gung gestellt:</B>
<P>
&#187;PrintManager ist ein Programm, das die Arbeit mit einem Drucker flexibler
und kontrollierbarer macht. Es kann Daten, die ein Programm an den Drucker
schickt, zun&#228;chst in einer Datei speichern. So wird ein Anwenderprogramm
nicht durch den langsameren Drucker aufgehalten. Je nach Wunsch kann der
PrintManager die gespeicherten Daten anschlie&#223;end ausdrucken oder sie
zun&#228;chst auf Diskette belassen, um sie sp&#228;ter in einem Rutsch auszudrucken.
Des weiteren bietet Ihnen der PrintManager die M&#246;glichkeit, &#252;ber das
Datatypes-System, Dateien beliebigen Formats auszudrucken (dies setzt
nat&#252;rlich einen entsprechenden Datatype f&#252;r das jeweilige Format voraus).
<P>
Die Sharewaregeb&#252;hr betr&#228;gt DM 15,- bzw. DM 20,- bei Postversand, die
Demoversion ist im Aminet unter text/print/prtman39.lha zu finden.
<P>
Adresse des Autors:
<P>
Stephan Rupprecht<BR>
Apfeldweg 1<BR>
44359 Dortmund<BR>
<P>
E-Mail:
<P>
<A HREF="mailto:stephan.rupprecht@metronet.de&#171">stephan.rupprecht@metronet.de&#171</A>;
<P>
<B>Des weiteren hat Thomas Hasemann die Animationssoftware "MainActor
Broadcast" zur Verf&#252;gung gestellt.</B>
<P>
Vielen Dank an alle Preisstifter!
<P>
<B>Aufruf an alle innovativen Programmierer und AMIGA-Firmen:</B>
<P>
Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
Online-Magazine, beinahe kostenlos f&#252;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&#252;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere
Preise! Jedes Produkt wird mit dem von Ihnen gew&#252;nschten Text vorgestellt.
Als H&#228;ndler haben Sie die M&#246;glichkeit, Ihr Unternehmen besser
bekanntzumachen.
<P>


<P ALIGN=RIGHT>
<A HREF="0301.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0303.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
