<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0403.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0405.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>4. Reaktion auf den Leserbrief von Alexx Riedel (von Tobias Weihmann)</H2>

<P>
&#187;In seinem Leserbrief in der Amiga Aktuell 6/98 befa&#223;te sich Alexx mit den
Systemen, gegen die sich ein Intel-AmigaOS durchsetzen m&#252;&#223;te, Windows,
Linux, OS/2, BeOS usw.
<P>
<PRE><FONT COLOR="#880000">&#62;Also, wie soll sich ein AmigaOS auf Intel-Plattformen durchsetzen, sei es
&#62;bei &#62;Anwendern oder Entwicklern? Da m&#252;&#223;te es schon einiges zu bieten
&#62;haben. Das
&#62;Softwarefundament an alter Amiga-Software, welches ohnehin wie bei UAE
&#62;emuliert &#62;werden m&#252;&#223;te, kann gegen obige Konkurrenten schon mal kein
&#62;Argument sein</FONT></PRE>
<P>
Ich glaube, da&#223; wir mit dem Wort "durchsetzen" vorsichtig sein sollten. Der
Amiga hat zur Zeit keinerlei realistische Chancen, sich gegen die
etablierten Systeme "durchzusetzen". "Durchsetzen" - dieses Wort wird mir
dauernd von Wintel-Besitzern entgegengeworfen, z.B. in "Du glaubst doch
nicht wirklich, da&#223; sich der Amiga auf dem Markt durchsetzen k&#246;nnte???"
<P>
Nein, sage ich dann, das glaube ich nicht. Warum denn "durchsetzen"? Ich
w&#252;nsche mir eine moderne Alternative zu Windows, f&#252;r die gen&#252;gend
aktuelle Software existiert. "Durchsetzen" ist ein negativer Begriff.
Ich bin gegen ein System, das die anderen "vom Markt verdr&#228;ngt" oder
"den Markt beherrscht", aber genau das impliziert "durchsetzen". Jeder
soll sich das System raussuchen k&#246;nnen, das ihm am besten pa&#223;t: "We
demand choice!". Wenn Wahlfreiheit herrscht, werden die meisten Leute
auch zu den Systemen gehen, die ihnen bei der Arbeit am besten behilflich
sind, mag das AmigaOS hei&#223;en oder sonstwie.
<P>
Zur Zeit existiert eine solche Wahlfreiheit nicht. Firmen wie Microsoft
erfinden immer neue propriet&#228;re Formate, um plattform&#252;bergreifendes
Arbeiten zu erschweren bzw. unm&#246;glich zu machen. So werden viele gezwungen,
Microsoft-Systeme zu verwenden, um den reibungslosen Austausch mit der
Arbeitsstelle oder den Kollegen zu gew&#228;hrleisten.
<P>
Und wie schafft man nun diese Wahlfreiheit? a. Man mu&#223; standardisierte
Austauschformate (auch plattform&#252;bergreifend) forcieren! b. Man mu&#223;
durch Schichtenmodelle und Objektorientierung die Softwareportierung
m&#246;glichst einfach gestalten. c. Plattformunabh&#228;ngige Codes und Sprachen wie
Java m&#252;ssen optimiert und gef&#246;rdert werden. d. Jeder User sollte in der
Lage sein, beliebige Hardware-Erweiterungen (GFX, Sound etc.) mit seinem
Rechner zu verwenden. Dies sollte ebenfalls durch Protokolle geregelt und
forciert werden.
<P>
Dies w&#252;rde uns geradewegs in Marc B&#246;ttchers Traum aus der letzten Ausgabe
bef&#246;rdern. Ein Leser mailte mir seine Furcht vor solchen Systemen: Es w&#228;re
dann ja f&#252;r jeden leichter, seinen Amiga, Mac oder was wei&#223; ich zu
verscherbeln und auch auf Windoze umzusteigen.
Da kann ich nur sagen: Das ist nicht unsere Art, sonst w&#252;rden wir uns hier
schon lange nicht mehr unterhalten. Man kann Menschen nicht durch
k&#252;nstliche Barrieren zwingen, einem System die Treue zu halten. Das beste
Beispiel hierf&#252;r ist die ehemalige DDR.
<P>
Mit besten Gr&#252;&#223;en
Tobias Weihmann&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0403.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0405.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
