<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0404.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0406.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>5. Reaktion auf Toshs Leserbrief (von Tobias Weihmann)</H2>

<P>
&#187;Reaktion auf Toshs Brief in 6/98, Thema "Apple und Amiga"
<P>
Thorsten Blanckes &#196;u&#223;erungen kann ich so nat&#252;rlich nicht stehenlassen.
Angefangen hatte es damit, da&#223; ich auf Apples Gewinne durch MacOS 8 und die
G3-Prozessorfamilie hinwies.
<P>
<PRE><FONT COLOR="#880000">&#62;So ein, sorry, Quatsch! Wer Gewinne aufgrund von Umsatzeinbu&#223;en von ca.
&#62;30% (im Vergleich zum Vorjahr) macht, dem steht das Wasser bis zum Hals.
&#62;Apples Strategie ist defensiv, d. h. die Firma verabschiedet sich gerade
&#62;&#62;endg&#252;ltig vom Massenmarkt, um &#252;berhaupt weiterzubestehen.</FONT></PRE>
<P>
Es w&#228;re sch&#246;n, wenn Du Deine Behauptungen mit ein paar Beispielen
untermauern k&#246;nntest, denn sonst reduziert sich Dein letzter Absatz
lediglich auf die "30% Umsatzeinbu&#223;en". Egal, wie Du es drehst und wendest,
Apple f&#228;hrt Gewinne ein, und zwar immer gr&#246;&#223;ere. Dies allein ist angesichts
der alles beherrschenden Stellung Wintels schon mehr als erstaunlich und
lobenswert. Wenn Du willst, kann ich Dir Abschlu&#223;berichte zuschicken.
<P>
Auch die "defensive Stategie" nehme ich Dir nicht ab, wenn man den
spektakul&#228;ren Erfolg der (provokanten) "Think Different"-Werbekampagne in
den USA betrachtet. U.a. hat der Dalai Lama Apple die Erlaubnis gegeben,
mit seinem Konterfei zu werben (SZ). Aus eigener Erfahrung heraus kann ich
sagen, da&#223; Apple durch diese Kampagne omnipr&#228;sent war. F&#252;r beliebte Serien
wie "Seinfeld" wurden die Spots speziell angepa&#223;t. Apple wirbt in den USA
mit einem verbrennenden Intel-Maskottchen und einem PentiumII-Prozessor,
der von einer Schnecke durch den Raum geschleift wird!!!
<P>
So ein aggressives Auftreten w&#252;rde ich dem Amiga w&#252;nschen, aber das ist
leider in weiter Ferne.
<P>
Apple trennt sich von kostspieligen Randbereichen, wie z.B. der
Laserdruckerproduktion, und konzentriert sich auf Verkaufsschlager wie
MacOS 8 und den G3-Rechnern (einem der schnellsten Prozessoren &#252;berhaupt).
Nat&#252;rlich ist MacOS 8 kein Betriebssystem f&#252;r die Amiga-Gemeinde. Aber
warum m&#252;ssen wir immer nur an uns denken?
Ich jedenfalls denke auch an meine Eltern, und alle anderen Leute,
die anderes vorhaben, als ihren Computer zu konfigurieren und zu
programmieren. Und Tatsache ist, zu MacOS 8 gibt es in dieser Sparte
einfach (noch) keine Alternative.
<P>
Vielleicht verstehst du Apples neue Firmenpolitik, &#252;ber Produkte erst dann
zu reden, wenn diese fertiggestellt sind, auch falsch.
So etwas ist auf dem Amiga-Markt halt v&#246;llig unbekannt. Ich verweise nur
auf Rhapsody, also dem angestrebten MacOS X, welches auf Mach-Kerneln
basieren wird und den Programmierern ein vollst&#228;ndiges Unix zur Verf&#252;gung
stellt (war schon versteckt auf der letzten Cebit zu sehen). Termin:
Sp&#228;testens 1999.
<P>
Apple stellt die schnellsten Laptops her, und das benutzerfreundlichste
Betriebssystem (nein, das ist AmigaOS NICHT) -- und was macht der Amiga???
Macht er &#252;berhaupt was? Ich glaube den Amiga-Oberen kein Wort, seien es
M&#228;rchen von geheimnisvollen Prozessoren, Wunderrechnern oder anderen
Tr&#228;umereien. Ich begr&#252;&#223;e das Verhalten von Firmen wie phase5, die zumindest
mit dem powerUp-System bewiesen haben, da&#223; sie mehr drauf haben als leere
Spr&#252;che.
Realistisch betrachtet ist der Amiga seit Jahren nicht mehr auf dem Markt
pr&#228;sent, und wenn die Firma bzw. Firmen wieder aus der Versenkung
auftauchen wollen, werden sie weit mehr brauchen als Zwischenl&#246;sungen.
<P>
Ja, ich hoffe auf die Zukunft des Amigas. Und sollte je wieder ein wirklich
innovativer Amiga bzw. ein AmigaOS auftauchen, dann ist ein Vergleich mit
Apple wieder angebracht. Solange wir nur auf ausgetretenen Pfaden wandern
bzw. warten m&#252;ssen, sollten wir einsehen, da&#223; sich die Firma Apple wirklich
in weitaus angenehmeren Gefilden befindet, als wir es dem Amiga zur Zeit
w&#252;nschen k&#246;nnen.
<P>
Im &#252;brigen sind MacOS und AmigaOS keine Konkurrenten, sie sprechen imho
vollkommen unterschiedliche Zielgruppen an bzw. erg&#228;nzen sich ideal, wie
viele Amiga-User zeigen, die beide Systeme benutzen. Der wahre Konkurrent
und die wirkliche Bedrohung haust in Redmond.
<P>
Tobias Weihmann
<P>
P.S. An dieser Stelle m&#246;chte ich noch einmal auf die neuen Amiga-Umfrage-
Seiten hinweisen, auf denen Ihr Eure Meinung zu diesem und anderen Amiga-
Themen kundgeben k&#246;nnt. Die URL:
<A HREF="http://www.geocities.com/SiliconValley/Park/3680/amiga_survey.html">http://www.geocities.com/SiliconValley/Park/3680/amiga_survey.html</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0404.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0406.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
