<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0408.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0410.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>9. Leserbrief zu den Plänen von AMIGA, Inc. (von Alexx Riedel)</H2>

<P>
&#187;Auf diesen Seiten fanden in letzter Zeit schon einige kontroverse
Diskussionen statt, wie denn der neue Traum-Amiga auszusehen h&#228;tte. Die
W&#252;rfel diesbez&#252;glich sind nun gefallen, wir Amiga-Fans haben wenig andere
M&#246;glichkeiten, als zuzuschauen und abzuwarten. Amiga, Inc. hat sich hier
ehrgeizige Ziele gesetzt, neben der technischen Realisierbarkeit stellt
sich allerdings noch die Frage, ob dieses geplante komplett neue
Computersystem (was anderes ist das nicht) mit der gegenw&#228;rtigen
Marketingstrategie gut eingef&#252;hrt wird werden k&#246;nnen. Die bisherige
Vorgehensweise der beiden Amiga-Firmen (Inc. und Int.) ist in dieser
Hinsicht bislang etwas fragw&#252;rdig: Schauen wir uns die Zeit seit der
(letzten) &#220;bernahme der Amiga-Technologie einmal an:
<P>
Da&#223; in den ersten Monaten au&#223;er Durchhalteparolen nichts zu h&#246;ren war, mu&#223;
einfach akzeptiert werden: So schnell l&#228;uft das nach einer &#220;bernahme nicht,
das war vorherzusehen. Kritischer ist dann schon das Verhalten von Amiga
International bez&#252;glich der Prozessorfrage zu sehen: Erst nach einer
seinerzeit unverst&#228;ndlich langen Verz&#246;gerung und Heimlichtuerei wurde
er&#246;ffnet, da&#223; der neue Amiga mit PowerPC und m68k ausgestattet sein sollte.
Zwar wieder mal ein halber Schritt, aber immerhin gab er den innovativen
Hard- und Softwareentwicklern rund um den Amiga eine klare Marschrichtung
f&#252;r die Zukunft: PowerPC! Damals nahmen alle an, da&#223; das, was die
Offiziellen von Amiga International sagen, auch das ist, was f&#252;r die
Zukunft des Amiga allgemein g&#252;ltig ist. Da war es dann auch zu
verschmerzen, da&#223; die Homepage als News meistens nur irgendwelche &#228;u&#223;erst
periphere Ereignisse rund um den Amiga (Verkauf von Amiga-Merchandising-
Shirts usw.) zu vermelden hatte.
<P>
Niemand hatte mit Amiga, Inc. gerechnet, die auf der WoA wie mit einem
Paukenschlag auftraten, und wirklich alle bisherigen Planungen &#252;ber den
Haufen warfen. Klar, das Versprechen, einen v&#246;llig neuen Amiga, ebenso
innovativ wie seinerzeit der A1000, zu entwickeln, l&#228;&#223;t einen aufhorchen
und endlich mal wieder Hoffnung fassen - keine &#252;berfl&#252;ssigen
Kompatibilit&#228;tskompromisse, sondern richtungsweisende Technik. Doch schon
die dilettantische, mi&#223;verst&#228;ndliche Presseerkl&#228;rung l&#228;&#223;t nicht auf die
n&#246;tige Professionalit&#228;t schlie&#223;en - wie kann man eine Konkurrenz zu Wintel-
Computern einf&#252;hren, wenn man sich nicht mal verst&#228;ndlich &#252;ber seine
eigenen Pl&#228;ne ausdr&#252;cken kann? Alles, was man &#252;ber den neuen Amiga h&#246;rt,
h&#246;rt sich toll an, doch wenn man mal genau aufpa&#223;t, mu&#223; man feststellen,
da&#223; man eigentlich rein gar nichts Genaues wei&#223;. Au&#223;er, da&#223; dieser Computer
leistungsf&#228;hig und innovativ sein wird, ziemlich preiswert, und erst in
knapp zwei Jahren rauskommen wird. Etwas mager, irgendwie, wenn ein
Hersteller gegen die geballte Macht des Wintel-Kartells und der zahlreichen
ebenfalls milliardenschweren Entwickler in dessen Dunstkreis antreten will,
oder? Da hilft es auch nix, wenn Amiga, Inc. auf seiner Homepage ein
nettes, nichtssagendes Bild eines Computergeh&#228;uses f&#252;r den Entwickler-Amiga
ver&#246;ffentlicht, das h&#228;tte ich auch noch gekonnt.
<P>
Damit mich keiner falsch versteht: Es ist schon m&#246;glich in der
schnellebigen Computerbranche, da&#223; mal ein kleinerer Hersteller die gro&#223;en
Ideen hat, und ich w&#228;re wohl unter den ersten, die einen solchen tollen
neuen Amiga kaufen. Nur: Selbst phase5 konnten f&#252;r ihre sagenumwobene A\Box
eine Roadmap, einen Upgrade-Pfad und eine ausf&#252;hrliche Erl&#228;uterung von
Design-Spezifikationen bieten. Dadurch konnten sie gleich Vertrauen in die
neue Technologie wecken (den Rest kennen wir ja). Nicht einmal das haben
wir bislang von Amiga, Inc.! Und die Amiga-Technologie kann sich
Heimlichtuerei &#252;ber neue Innovationen kaum erlauben, gerade jetzt sollte
man den Amiga-Fans eine klare Strategie vorweisen k&#246;nnen, um sie bei der
Stange halten zu k&#246;nnen.
<P>
Ich kann ja nur f&#252;r mich pers&#246;nlich sprechen: Ich habe einen 4000er mit
68040, reichlich RAM, Grafikkarte, SCSI usw., f&#252;r Amiga-Verh&#228;ltnisse
durchaus keine kleine Maschine. Aber trotzdem ist diese Hardware f&#252;r
heutige Verh&#228;ltnisse einfach zu schwach, da hilft kein schlankes
Betriebssystem: Kompiliervorg&#228;nge dauern ewig, schon bei einfachen JPEG-
Bildern geht die Rechenleistung in die Knie, die interne serielle
Schnittstelle ist untauglich f&#252;r einen halbwegs schnellen Internetzugang
usw. Gut, es gibt Hardwarerweiterungen (PowerUP, Schnittstellenkarte ...),
mit denen man diesen Problemen abhelfen kann - aber warum soll ich tausende
von Mark in eine Technologie investieren, die laut der offiziellen Linie eh
praktisch tot ist? Und wie soll ich die Zeit bis zum Erscheinen des neuen
Amiga - selbst wenn die in der Computerbranche &#252;blichen Verz&#246;gerungen nicht
auftreten - &#252;berbr&#252;cken?
<P>
Ich hoffe nun, da&#223; Amiga, Inc. m&#246;glichst bald die n&#246;tigen Details &#252;ber die
geplante neue Technologie ver&#246;ffentlicht, um dem arg gesch&#252;ttelten Amiga-
Markt wieder etwas Halt zu geben. Und nicht zuletzt sollten die
Verantwortlichen mit den f&#252;hrenden Entwicklern rund um den Amiga
zusammenarbeiten, anstatt diese mit ihrer Informationspolitik vor den Kopf
zu sto&#223;en.&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0408.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0410.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
