<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0409.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0411.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>10. Meinung zur AMIGA-Situation (von Heiko Krappmann)</H2>

<P>
&#187;Meine Meinung zur Amiga-Situation:
<P>
Ich habe schon des &#246;ffteren dar&#252;ber nachgedacht, wie es aussehen w&#252;rde,
wenn das Amiga-OS endlich auf dem PC laufen w&#252;rde, und ich mu&#223; sagen, da&#223;
es ein sch&#246;ner Gedanke ist: Endlich kann der EX-Amiga-User ein
Alternativbetriebssystem laufen lassen, so da&#223; man wieder ehemalige
Amiganer zur&#252;ckgewinnt.
Es sollte dennoch kostenfrei wie der MS Internet-Explorer verteilt werden,
um so einem breiten Userkreis die M&#246;glichkeit zu bieten, sich mit dem
Betriebssystem vertraut zu machen, sp&#228;ter wird man so oder so eine Geb&#252;hr
f&#252;r das A-OS verlangen.
So beugt man gegen das Raupkopieren vor, da diejenigen, denen das A-OS
gefallen wird, sowieso das Update kaufen werden.
Es sollte dennoch eine &#252;berarbeitete Version sein, da man ja etwas bieten
mu&#223; und mit schlagkr&#228;ftigen Argumenten auf A-OS-Fang gehen&#160;sollte. Was
nutzt das, wenn man wie immer sagt, das A-OS sei das beste der Welt, und
der User "friemelt" immer noch mit den guten alten Druckertreibern rum, wie
peinlich!
Die dazugeh&#246;rige Hardware sollte jedoch bald kommen. Was den User dennoch
irritiert, ist die Tatsache, da&#223; der Prozessor&#160;noch nicht feststeht, was
unter anderem die Entwickler anderer Firmen ver&#228;rgert.
Einige Firmen, die dem Amiga immer noch die Stange halten und wahre
Pioniere sind, haben viel Geld und Zeit in Sachen Entwicklung gesteckt und
dem Amiga ein neues Herz gegeben haben, werden, wenn es so kommen sollte,
auf widerlichste Art verprellt.
Sollte dennoch endlich Licht ins Dunkle kommen, mu&#223; es bald Klarheit geben,
was die Sache Zukunft betrifft!
Werbung&#160;soll und mu&#223; es geben, wenn, dann aber nur, wie es einst Apple
getan hat! Komplett neue Rechnergeneration, OS, Zusatzhardware,&#160;verpackt in
einer kurzen pr&#228;gnanten und heftigen Werbung!
Ich m&#246;chte nicht sagen, da&#223; die Amiga-Chefriege unf&#228;hig ist, aber
Nennenswertes haben sie noch nicht auf die Reihe gebracht, man kann nicht
immer hergehen, dem User das erz&#228;hlen, was er sowieso schon wei&#223;!
Auf dem PC sind zwischen Ank&#252;ndigung&#160;und Vertrieb gerade mal 6 Monate, was
sich auf dem Amiga schon mal auf 12-18 Monate hinausz&#246;gern kann!
Die lieben Spiele sollten auch nicht fehlen, aber ich sage dazu nur, da&#223; es
schon &#252;bertrieben ist, f&#252;r ein Spiel wie MYST 100.-DM zu verlangen, da man
es zu diesem Zeitpunkt schon auf dem PC f&#252;r 39.-DM bekommen hat.
Der Amiga-User ist der treueste User, den ich &#252;berhaupt kenne, aber wie
bereits erw&#228;hnt, sollte schon Klarheit geschaffen werden!
<P>
Also Servus sagt diesmal leise Euer,
<P>
OTT&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0409.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0411.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
