<HTML>
<HEAD><TITLE>
AMIGA-aktuell-Forum
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0410.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0412.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA-aktuell-Forum
</font>
</TD></tr>
</TABLE>


<P>

<H2>11. Fragen und Vorschläge zu verschiedenen Themen (von Markus Lunk)</H2>

<P>
&#187;Zum ARexx-Kurs von Heiko Kuschel:
<P>
Super, weiter so! Wie w&#228;re es damit, z.B. einen B&#246;rsenticker abzufragen
und dessen Daten in eine TurboCalc-Tabelle einflie&#223;en zu lassen, oder aus
einem Systemmonitor heraus z.B. ein Nutzerverhalten grafisch darzustellen,
in Form eines Protokolls? Man k&#246;nnte auch aufgrund von Fahrplan&#228;nderungen
der Bahn oder Daten von Fluggesellschaften Reiserouten neu berechnen
lassen.
<P>
Ganz allgemein w&#252;nsche ich mir einen Einf&#252;hrungskurs in die OOP,
zun&#228;chst einmal mit ANSCHAULICHEN Erkl&#228;rungen, was Objekte, Instanzen etc.
sind, wie sie funktionieren und wie am besten damit anf&#228;ngt, wenn man von
der &#252;blichen prozeduralen Programmierung kommt, z.B. COBOL. Vielleicht
k&#246;nnen ja hier mehrere Autoren zusammenarbeiten.
<P>
Im Zusammenhang mit COBOL m&#246;chte ich auch folgenden Aufruf starten. Ich
sch&#228;tze, viele von uns sind (angehende) DV-Kaufleute bzw. in den
entsprechenden neuen IT-Berufen und/oder haben im Betrieb mit COBOL zu tun.
COBOL hat in der Tat einen sehr schlechten Ruf, ist aber in der Praxis
unersetzlich, weshalb es seine uneingeschr&#228;nkte Daseinsberechtigung hat.
Nach langen Recherchen bin ich auf dem Amiga lediglich eines Compilers
f&#252;ndig geworden. Dies ist ein kleiner Compiler eines PD-Programmierers, der
leider nicht viel hergibt. Damit will ich nicht die Leistung dieses
Programmierers schm&#228;lern, aber das Angebot ist eben nicht gerade &#252;ppig. Da
ich beruflich u.a. mit DOSen zu tun habe, bin ich vor einiger Zeit auf das
System der AcuCorp Inc., AcuCobol, aufmerksam geworden, welches eine
Entwicklungsumgebung mit grafischen M&#246;glichkeiten der Screendefinition
etc. bietet. Dieses System gibt es laut Hersteller f&#252;r etwa 600
Plattformen, allerdings nicht f&#252;r den Amiga. Es w&#228;re also dringend n&#246;tig,
ein solches System auf unser AmigaOS zu portieren, zumal das eventuell von
einer Unix-Version und den entsprechenden Sources m&#246;glich sein sollte.
Eines der gro&#223;en Mankos unserer Plattform ist es, da&#223; z.B. gerade im
kaufm&#228;nnischen Bereich keine ernstzunehmende Software erh&#228;ltlich ist.
COBOL ist DIE kaufm&#228;nnische Sprache, die jeder DV-Kaufmann/jede DV-Kauffrau
mehr oder weniger gut beherrscht. G&#228;be es also eine entsprechende Umgebung
f&#252;r das AmigaOS, k&#246;nnte in diesem defizit&#228;ren Bereich endlich aufgeholt
werden, was all die Jahre verpa&#223;t wurde. Von den einfachen F&#228;llen
abgesehen, da&#223; man nicht mehr wie ich mittels PC-Task und MicroFocus in der
Emulation arbeiten m&#252;&#223;te, w&#252;rde sich jeder freuen, vern&#252;nftige Programme zu
Hause zu schreiben, zumal wenn er/sie sie auch tats&#228;chlich privat nutzen
oder ausbauen kann.
<P>
Lange Rede, kurzer Sinn: Ich m&#246;chte m&#246;glichst viele von Euch animieren,
an AcuCorp heranzutreten und einen Amiga-Port zumindest &#246;fter mal ins
Gespr&#228;ch zu bringen. Vielleicht &#252;berlegen die es sich irgendwann oder
erlauben f&#228;higen Freiwilligen die Portierung, wenn die Nachfrage
entsprechend gro&#223; ist.
<P>
Andere haben dies schlie&#223;lich auch schon getan, und ein weiteres Argument
w&#228;re, da&#223; es auf eine Plattform mehr oder weniger auch nicht mehr ank&#228;me.
Ich wei&#223;, wie oft so etwas zwecklos ist, aber warum sollen wir es nicht
versuchen, siehe OperaSoftware?
<P>
Hier noch die Web-Adresse, &#252;ber die man auch eine E-Mail-Adresse
ausfindig machen kann: <A HREF="http://www.acucobol.com">http://www.acucobol.com</A>.
<P>
Zum zweiten m&#246;chte ich hier einmal den Computer Flohmarkt (CF) kurz
vorstellen, den einige von Euch bestimmt kennen. Er erscheint zweimonatlich
in gehefteter Zeitungspapierform mit unspektakul&#228;rem &#196;u&#223;eren. Der Inhalt
teilt sich in Gebote und Gesuche in Sachen Hard- und Software, Erfahrungs-
und Informationsaustausch, Diskussionen, Literatur, Zubeh&#246;r usw. f&#252;r die
g&#228;ngigen Computersysteme des privaten Bereichs der letzten 20 Jahre auf.
Das alles geschieht kostenlos. In den vergangenen Jahren sind die Amiga-
Rubriken immer d&#252;nner geworden, die DOSen-Rubriken haben entsprechend
zugelegt. Dieser Aufruf soll Euch den CF n&#228;herbringen. Schaut ihn Euch
einfach mal am Kiosk oder bei Bekannten an und  macht mit. Inseriert, was
Ihr zu verkaufen habt oder sucht, beteiligt Euch an den Diskussionen und
sorgt daf&#252;r, da&#223; der Amiga-Anteil wieder etwas anw&#228;chst. Man kann die Anzis
auch ganz bequem per E-Mail aufgeben.
<P>
Folgende Frage habe ich zu einem Aufenthalt im Internet. Wenn auch im
Amiga-Bereich wenig verbreitet, da nicht dominant, gibt es doch auch bei
uns die grunds&#228;tzliche M&#246;glichkeit, per Cookies etc. Daten auf meinem
Rechner auszuspionieren. Dies gilt nat&#252;rlich auch f&#252;r Intranets, und da ist
es wohl noch viel interessanter, weil hier eher jemand wei&#223;, was ich auf/in
meinem Rechner habe. Die Frage lautet daher, ob es m&#246;glich ist, wenn ich
z.B. in der Early Startup Control ein Volume disable, von einem anderen
Rechner im Netz darauf zuzugreifen.
<P>
Die Idee ist jene, sich z.B. eine Internet-Partition anzulegen und immer
dann, wenn man "auf Session" geht, die anderen Platten derart abzuh&#228;ngen.
Wenn ich damit vermeiden k&#246;nnte, da&#223; jemand irgendwie an meine Daten kommt,
z.B. indem er versucht, meine Laufwerke zu mounten, h&#228;tte man ein sehr
einfaches Mittel der Datensicherheit zur Hand.
<P>
Wie w&#228;re es, wenn hier Leute auch mal ihre Hardwarebasteleien zur Schau
stellten?
Ich denke da z.B. an Netzwerk- oder Soundkarten. Gibt es noch Menschen,
die so etwas machen, das man nachbauen kann? An meinem 500er hatte ich
fr&#252;her mal eine DCF-77-Uhr. Kann jemand so etwas heute noch f&#252;r einen A4000
bauen?
<P>
Was mir noch etwas wenig ausgepr&#228;gt ist in AMIGA aktuell ist derzeit eine
Basis f&#252;r die Diskussion, bzw. es geht zumeist nur um AI oder P5 und H&#38;P.
Ich w&#252;rde mir w&#252;nschen, z.B. auch mal &#252;ber die Cloner zu diskutieren. Mich
wundert z.B., warum die Cloner keine Eigeninitiative bei der Entwicklung
zeigen. Letztlich bauen sie die Originale nur nach, was den Anwender
genauso viel kostet, ihm aber keine oder nur sehr geringe Variationen in
Leistung und Preis bietet. Erste Ausnahme wird vermutlich BoXeR sein, aber
DCE und Konsorten halten sich mit Eigenentwicklungen sehr zur&#252;ck, dabei
hatten gerade die zun&#228;chst herumget&#246;nt. Warum baut keiner von denen ein
neues Mainboard mit Gfx-Chip heutiger Technik onboard, schnellen DIMMs, UW-
SCSI onboard im ATX-Format etc.? Liegt es nur am fehlenden Geld oder an der
fehlenden Investitionsbereitschaft aufgrund der noch immer nicht gekl&#228;rten
Zukunft des Amiga dank der Verwirrspiele von AI und AI?
<P>
Ich bin am Kauf eines Scanners interessiert. Wer kennt Treiber f&#252;r das
Modell Microtek Scanmaker 630 oder wei&#223;, welche Software damit klarkommt?
<P>
Markus Lunk
<P>
E-Mail: <A HREF="mailto:Markus.Lunk@SoftM-Berlin.de">Markus.Lunk@SoftM-Berlin.de</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0410.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0412.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
