<HTML>
<HEAD><TITLE>
Workshops / Hintergrundberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0500.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0502.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Workshops / Hintergrundberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Verfasser eines C-Workshops gesucht - und gefunden!</H2>

<P>
Stefan Schulze hat sich auf unseren Aufruf hin bereit erkl&#228;rt, einen C-
Workshop zu schreiben. Bitte lest Euch seine Vorstellungen durch, und teilt
ihm oder uns mit, ob Ihr damit einverstanden seid bzw. etwas anmerken oder
kritisieren m&#246;chtet. Danke!
<P>
&#187;Wenn es wirklich so sehr gew&#252;nscht wird, &#252;bernehme ich das. Ich denke mal,
da&#223; ich f&#252;r so was recht gut geeignet bin, da ich selbst noch nicht so
lange in C/C++ programmiere (ca. 6 Monate) und somit auch noch wei&#223;, wie
viele sinnlose, kleine Gemeinheiten C/C++ bereith&#228;lt. Jedoch verlange ich
ein klein wenig Entgegenkommen daf&#252;r:
<P>
1. Das wichtigste: Ich ERWARTE, da&#223; hier mit reichlich Eigeninitiative
herangegangen wird, genauso wie sich bitte keiner vormacht, da&#223; man mit 2
Stunden programmieren pro Woche zum Super-Coder mutiert. Zum Programmieren
ist nun mal viel Zeit und sehr viel Geduld n&#246;tig, deswegen erwarte ich, da&#223;
man sich auch mal selbst nach Probleml&#246;sungen umsieht und gewillt ist,
einiges an Dokumentation ranzuschaffen und durchzuw&#252;hlen, falls n&#246;tig.
<P>
2. Es w&#228;re vielleicht von Vorteil, wenn schon grundlegende
Programmierkenntnisse vorhanden w&#228;ren (es reicht schon BASIC, von da kam
ich n&#228;mlich auch), mu&#223; aber nicht sein.
<P>
3. Es w&#228;re weiterhin von Vorteil, w&#252;rde StormC zum Einsatz kommen. Die
Storm-Linie mag auf den ersten Blick recht teuer sein, sie ist aber
wirklich jeden Pfennig wert. Da ich kaum andere Compiler kenne, kann ich
auch nicht auf eventuelle Unterschiede in Syntax o.&#228;. eingehen. Weitere
Vorteile w&#228;ren einfache PPC-Portierung, WarpUP, *relative*
Einsteigerfreundlichkeit und der schlichtweg geniale Support nach dem Kauf
durch H&#38;P.
<P>
4. Des weiteren ist ein Internetanschlu&#223; hilfreich, mu&#223; aber auch nicht
sein.
<P>
Ich w&#252;rde anfangs ausf&#252;hrlich die n&#246;tigen Grundlagen beschreiben,
vielleicht auch einige wichtige Befehle durchnehmen und mich dann sp&#228;ter
auf RTGMaster-Programmierung, Optimierung und PPC konzentrieren. Kurz:
Jeder, der wie ich an Spieleprogrammierung interessiert ist, d&#252;rfte in dem
Workshop goldrichtig sein. :)  Wer dagegen an System-Programmierung
(Intuition, Exec, GUI, MUI) interessiert ist, m&#252;&#223;te sich zu gegebener Zeit
alleine schlau machen, da ich von diesen Gebieten nicht sehr viel Ahnung
habe.
<P>
Wer an diesem Workshop interessiert ist, kann sich gern mit eventuell
abweichenden Vorstellungen bei mir melden.
<P>
E-Mail: <A HREF="mailto:stefan.cbyte@sz-online.de">stefan.cbyte@sz-online.de</A><BR>
Phone:  (0351) 8809439 (bitte nur werktags ab 17 Uhr)&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0500.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0502.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
