<HTML>
<HEAD><TITLE>
Workshops / Hintergrundberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0502.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0600.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Workshops / Hintergrundberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>3. Erfahrungsbericht: PC-Tower für A4000 (von Holger Hesselbarth)</H2>

<P>
&#187;A4000 in einen PC-Tower einbauen.
<P>
Ich besa&#223; einen Desktop-A4000 und eines Tages reifte in mir der Entschlu&#223;,
das ganze "Gebimsel" in einen Tower einzubauen, damit die Maschine mehr
Platz hatte.
<P>
Also zum lokalen PC-Dealer gefahren und nach Towern gefragt. Ein gro&#223;er
sollte es sein und mit einem Netzteil und billig. Da kam ein Allkauf-Tower
gerade recht. Ein ausgemusterter 486-Tower, den keiner mehr wollte. Also
50 DM auf den Tresen gelegt und fertig! Ab nach Hause und den Amiga
zerlegt.
<P>
Hauptplatine in den Tower gehalten... L&#246;cher in die PC-Board-Halterung
gebohrt und schon sa&#223; die Platine. Das war ja einfach...
Jetzt ging es los. Die Ports mu&#223;ten ja nach drau&#223;en. Mist. Also
Portverl&#228;ngerungen mit Flachbandkabeln gebaut. Am Monitoranschlu&#223; gleich
einen Amiga-&#62;VGA-Anschlu&#223; eingebaut, und pa&#223;t. Nach 3 Stunden l&#246;ten waren
alle Kabel fertig. Jetzt ging es an die Karten.
Das Daughterboard ist so eingebaut, da&#223; die Karten KOPF&#220;BER im Tower
h&#228;ngen.
<P>
Egal, Hauptsache alles l&#228;uft. Karten rein und TOWERPOWER!
Ach.. ich habe ja noch keinen Power-Stecker auf die Platine gesteckt.
Und der pa&#223;t auch prompt nicht. Also. Powerstecker uml&#246;ten. Nach 15 min.
ist der Power-Stecker, wie er sein sollte. Power also!!!!!!!!!!
Und alles funktioniert gleich beim ersten Mal. Sch&#246;n sieht es im Inneren
nicht gerade aus, daf&#252;r erf&#252;llt alles seinen Zweck, und das Platzangebot
ist reichlich!
<P>
Vor kurzem habe ich noch ein RBM-Daughterboard eingebaut. Keine Probleme
beim Einbau, keine Probleme mit den Karten, und jetzt liegen sie sogar
RICHTIG im Tower, und ich kann sie endlich festschrauben.
<P>
Letztendlich gesehen bin ich doch stolz, da&#223; ich den Umbau gemacht habe,
denn so schlimm war es nicht, und das Platzangebot entsch&#228;digt f&#252;r alle
verbrannten Finger beim L&#246;ten. Billig war es auch...
<P>
F&#252;r Fragen... <A HREF="mailto:intolerance@betaweb.net">intolerance@betaweb.net</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0502.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
