<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0600.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0602.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>1. Testreihe: Die Multiview-Herausforderer - Teil 3 (von Uwe Pannecke)</H2>

<P>
&#187;Der heutige Kandidat:
<P>
<B>iX-Guide 0.7 demo Beta von Ivan Sturlic &#38; Tetsuo Tawara</B>
<P>
Nachdem in den ersten beiden Teilen Programme getestet wurden, die die
Funktionalit&#228;t von Amigaguide/ Multiview durch das dateiabh&#228;ngige Einbinden
von externen (Hilfs-) Programmen zu erweitern suchten, heute ein Vertreter,
der einen Gro&#223;teil der Aufgaben selbst erledigt und zus&#228;tzlich ein eigenes
GUI mitbringt.
<P>
<B>Installation</B>
<P>
Das ca. 500 kByte gro&#223;e Programmpaket kommt zwar ohne eine
Installationsroutine, dennoch ist die Installation denkbar einfach:
Die komplette Schublade "ixg07db" auf die gew&#252;nschte Festplatte(npartition)
kopieren und eine Pfad- Zuweisung zu ixg07db in der "user- startup"- Datei
setzen, das war's.
<P>
<B>Programbeschreibung</B>
<P>
<A HREF="img/ix-Guide1.png">Screenshot</A>
<P>
iX- Guide ben&#246;tigt AMIGA- OS 3.x.
Nach erfoglreicher Installation und Aufruf des Programmes erscheint ein
Requester, der die Auswahl der anzuzeigenden Daten erm&#246;glicht.
iX- Guide akzeptiert und verarbeitet eine gro&#223;e Anzahl unterschiedlicher
Formate:
<P>
<UL><LI>
   Amigaguide
</LI><LI>
   IXML (basiert auf Amigaguide)
</LI><LI>
   HTML
</LI><LI>
   C- Quelltexte
</LI><LI>
   ASCII
<P>
</LI></UL>
und mit Hilfe der Datatypes
<P>
<UL><LI>
   diverse Bildformate.
<P>
</LI></UL>
Au&#223;erdem besitzt das Programm u.a. neben einer umfangreichen Suchfunktion
auch &#252;ber ein Export- Modul, das jede angezeigte Seite (Text oder Bild) als
HTML- Datei speichert.
<P>
F&#252;r die Darstellung der Texte und Bilder &#246;ffnet iX- Guide
jeweils ein Fenster auf der Workbench oder auf einem eigenen Bildschirm.
Ohne weiteres lassen sich so mehrere Texte oder Bilder in mehreren Fenstern
quasi gleichzeitig betrachten.
<P>
Die ge&#246;ffneten Fenster bieten f&#252;r die Navigation durch die Dokumente in der
obersten Zeile eine Piktogramm- Leiste. Diese Piktogramme sind in ihrer
Gestaltung einpr&#228;gsam, aussagef&#228;hig und erinnern auf den ersten Blick an
einen WWW- Browser. Wem diese Piktogramm nicht gefallen, kann alternativ
auch selbstgestaltete 'Sinnbilder' einbinden.
<P>
Das Scrollen &#252;bergro&#223;er Bilder oder Textseiten wird durch am unteren und
rechten Rand befindliche Scrollbalken erm&#246;glicht.
Dar&#252;berhinaus besitzt iX- Guide einen ARexx- Port.
<P>
<A HREF="img/ix-Guide2.png">Screenshot</A>
<P>
<B>Nutzung</B>
<P>
Nach diesen vielversprechenden potentiellen M&#246;glichkeiten sollte nun ein
Test zeigen, inwieweit iX- Guide seinen selbstgestellten Anspr&#252;chen gerecht
werden kann.
Ich testete das Programm unter AMIGA- OS 3.1, CyberGraphX 3.x, 12 MB Fast-
RAM und einer 68040/40 CPU.
<P>
Mit der Anzeige von Amigaguide- Dateien hat iX- Guide keine Probleme.
Die Guides samt eingebundenen Bildern werden layoutgerecht und lesbar
dargestellt.
<P>
Wird die Fenstergr&#246;&#223;e ver&#228;ndert, pa&#223;t iX- Guide den Wortumbruch automatisch
der neuen Fenstergr&#246;&#223;e an. Ein Scrollen in horizontaler Richtung kann damit
entfallen und der Leseflu&#223; wird deutlich verbessert.
Gleichzeitig legt iX-Guide in einer separaten Schublade die
Pfadinformationen zu den geladenen Guides ab. Was auf den ersten Blick wie
Platzverschwendung aussieht, bietet zu einem sp&#228;teren Zeitpunkt jedoch eine
elegante M&#246;glichkeit der Dateiauswahl, denn iX-Guide vergi&#223;t kein gelesenes
Guide und kann selbige bei Bedarf sofort namentlich auflisten und mit einem
Link erreichbar machen. Gute Idee.
<P>
Das Ganze wird noch besser mit der eingebauten Suchfunktion. Neben der
Textsuche im geladenen Guide bietet das Programm eine "Super Search"-
Funktion. Mit ihr kann man alle dem Programm bekannten (also schon einmal
geladenen) Guides nach einem gesuchten Text durchforsten lassen.
Geniale Idee.
Kleine Einschr&#228;nkung: Das ganze funktioniert jedoch nur mit Amigaguide- und
IXML- Dateien. HTML- Dateien bleiben au&#223;en vor.
<P>
Apropos HTML- Dateien. Selbige soll iX- Guide ebenfalls anzeigen k&#246;nnen.
Das klingt doch wunderbar. Endlich EIN Programm f&#252;r Amigaguide und HTML!
Kein zus&#228;tzliches Starten eines WWW- Browsers.
Der Test mit diversen HTML's bringt dann die Ern&#252;chterung. iX- Guide kann
diese Dateien anzeigen- aber die Anzeige ist praktisch unbrauchbar. Bei
gaaaaanz einfachen Dokumenten ist das Layout noch in etwa dem im WWW-
Browser &#228;hnlich. Neuere HTML- Versionen (zB. mit Tabellen und Frames) sind
zuviel f&#252;r iX- Guide.
Ein wildes, unleserliches Tohuwabohu an Text-, Links- und Bildgemisch f&#252;llt
das Programmfenster.
Die HTML- Anzeige ist leider fast unbrauchbar.
Schade.
<P>
<A HREF="img/ix-Guide3.png">Screenshot</A>
<P>
Aber - die vorliegende Programmversion ist 0.7 BETA! Das l&#228;&#223;t auf
zuk&#252;nftige Programmversionen hoffen.
Eine weiterer interessanter Menu- Punkt ist die Export- Funktion des
geladenen Dokuments im HTML- Format. So k&#246;nnte man doch einfach die
Amigaguide- Dateien in das HTML- Format konvertieren.
K&#246;nnte- denn die Export- Funktion unterst&#252;tzt nur die gerade angezeigte
Seite, jedoch nicht die komplett geladene Datei. Das schr&#228;nkt den
Nutzeffekt doch wesentlich ein.
Auch hier ein guter Ansatz, der in einer sp&#228;teren Programmversion ausgebaut
werden sollte.
<P>
Die Anzeige von Bildern bringt keine gro&#223;en Probleme. Sofern die
entsprechenden Datatypes im System vorhanden sind, zaubert iX- Guide nach
kurzer Zeit das gew&#252;nschte 'Kunstwerk' auf den Monitor.
Ein Abspielen von Animationen, die vom anim(ation).datatype unterst&#252;tzt
werden, war dem Programm jedoch nicht zu entlocken.
<P>
<B>Fazit</B>
<P>
iX- Guide ist ein sehr interessanter MultiView- Clone. Selbst in dieser
fr&#252;hen Programmversion k&#246;nnen viele Funktionen &#252;berzeugen.
Insbesondere die durchdachte Suchfunktion und der automatische Wortumbruch
stellen einen echten Fortschritt zu Amigaguide/ MultiView dar.
Andere Features bed&#252;rfen einer intensiven Weiterentwicklung.
Besonders bedauerlich aus meiner Sicht ist die in der vorliegenden Version
praktisch unbrauchbare HTML- Unterst&#252;tzung.
<P>
Sch&#246;n w&#228;re auch eine leichte Konfigurierbarkeit der Benutzeroberfl&#228;che, die
in der jetzigen Programmversion nur eingeschr&#228;nkt und m&#252;hsam &#252;ber ein
mittels Texteditor ver&#228;ndertes Config- file erfolgen kann.
<P>
Obwohl iX- Guide V0.7b bereits im April des letzten Jahres vom Autor ins
AMINET geladen wurde und seither kein Update erfolgte, wird das Programm
weiterentwickelt.
<P>
Davon kann sich jeder auf der Homepage von I. Sturlic informieren.
Erste fr&#252;he Previews einer neuen V 0.8 sind ladbar.
Aber Vorsicht: Ivan Sturlic: 'This is just a dirty, quick preview.'
<P>
Zu finden ist das Programm im Aminet und auf den Aminet- CDs unter
<P>
text/hyper/ixg07db.lha
<P>
und neuere Previews auf der Homepage des Programmautors
<P>
<A HREF="http://www.fortunecity.com/skyscraper/hudson/187/">http://www.fortunecity.com/skyscraper/hudson/187/</A>
<P>
Uwe Pannecke
<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="0600.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0602.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
