<HTML>
<HEAD><TITLE>
Testberichte
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0601.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0603.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Testberichte
</font>
</TD></tr>
</TABLE>


<P>

<H2>2. Softwaretest: AGM v3.3b</H2>

<P>
Die Abk&#252;rzung AGM steht f&#252;r "AMIGA-Geb&#252;hren-Manager". Und genau das ist es
auch, was dieses n&#252;tzliche Programm von Felix Schwarz macht: Es f&#252;hrt Buch,
wann immer der Anwender die Telefonleitung benutzt. Beim Telefonieren mu&#223;
man dem Programm noch Start und Stop des Gespr&#228;chs per Klick auf das
entsprechende Gadget der Programmoberfl&#228;che signalisieren.
<P>
<A HREF="img/AGM.png">Screenshot</A>
<P>
Dieser eher l&#228;stige Schritt entf&#228;llt beim Modembetrieb gl&#252;cklicherweise.
Gleich zwei verschiedene Varianten sorgen hier f&#252;r einen vollautomatischen
Ablauf: Zum einen besteht die M&#246;glichkeit, AGM &#252;ber die Einbindung von
ARexx-Skripts in die eigentlichen Online-Programme (z.B. Miami) zu steuern
(AGM hat einen Satz von rund 15 ARexx-Befehlen), zum anderen kann das
Programm aber auch angewiesen werden, den Status des Modems abzufragen.
<P>
Seit der Version 3.3 verf&#252;gt AGM &#252;ber die neuesten Tarifzonen der Deutschen
Telekom, auch Spezial-Tarife (wenn auch teilweise, wie im Fall von
CityPlus, noch nicht ganz fehlerfrei) sowie Mobilfunk- und Online-Tarife,
wie z.B. T-Online, sind einstellbar. N&#252;tzlich ist, da&#223; der Anwender auf
Wunsch neue Zonen bzw. Tarife erstellen und nutzen bzw. die vorhandenen
&#228;ndern kann.
<P>
W&#228;hrend der aktiven Zeit signalisiert AGM durch akustische Signale, wenn in
K&#252;rze eine neue Geb&#252;hreneinheit anf&#228;llt bzw. soeben angefallen ist.
Die so gewonnenen Daten (Datum, Einschalt-, Ausschalt- und Gespr&#228;chs-/
Onlinezeit, Kosten und Tarifzone) k&#246;nnen auf Wunsch &#252;bersichtlich geordnet
in einem Logbuch ausgegeben oder ausgedruckt werden, auch l&#228;&#223;t sich eine
bestimmte Zeichenfolge suchen und im Logbuch hervorheben. Das ist zum
Beispiel dann n&#252;tzlich, wenn man einen &#220;berblick &#252;ber s&#228;mtliche gef&#252;hrten
Gespr&#228;che einer Tarifzone erlangen will.
<P>
AGM verf&#252;gt aber auch &#252;ber eine recht umfangreiche Analyse-Funktion. So
kann man sich &#252;ber die Gesamtkosten und Gesamtgespr&#228;chsdauer sowie die
prozentuale Nutzung der verschiedenen Tarifzonen, Wochentage und
Tageszeiten auf dem laufenden halten. Auch hier sind Druck- und
Suchfunktion vorhanden.
<P>
Aber AGM kann noch mehr. So ist zus&#228;tzlich eine vollwertige Vorwahl-
/Ortsnamen-Suchfunktion enthalten, bei der die Eingabe eine dieser beiden
Informationen die Ausgabe der anderen zur Folge hat.
<P>
AGM ist Shareware (10 Mark per E-Mail, 15 Mark per Schneckenpost). Eine
eingeschr&#228;nkte Demo-Version kann &#252;ber die Homepage des Autors
(<A HREF="http://innovative.in-tec.de/">http://innovative.in-tec.de/</A>) bzw. das Aminet (comm/misc/AGM#?)
heruntergeladen werden.
<P>
Die Adresse des Autors:
<P>
Felix Schwarz<BR>
Am Gr&#252;ndla 3<BR>
91074 Herzogenaurach<BR>
<P>
E-Mail: <A HREF="mailto:bs168@fen.baynet.de">bs168@fen.baynet.de</A>
<P>
<B>Fazit:</B>
<P>
AGM ist ideal, um sich &#252;ber die angefallenen Geb&#252;hreneinheiten beim
Telefonieren und/oder Online-Surfen auf dem laufenden zu halten. Es bietet
n&#252;tzliche Funktionen und flexible Konfigurationsm&#246;glichkieten. Quasi als
Bonus enth&#228;lt es zus&#228;tzlich eine Vorwahl&#60;-&#62;Ortsnamen-Suchfunktion.
Die Sharewaregeb&#252;hr von 10 bzw. 15 Mark ist vollkommen gerechtfertigt.
<P>


<P ALIGN=RIGHT>
<A HREF="0601.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0603.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
