<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0701.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0703.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>2. Aufruf</H2>


Liebe Leser,
<P>
Auch in dieser Ausgabe gibt es wieder Lesercharts. Es beteiligen sich
leider nicht mehr so viele Leser an den Charts, aber ich kann nicht genug
davon bekommen. Wenn ihr also meint, da&#223; Euer Lieblingsspiel in die Top 10
geh&#246;rt, schreibt mir Eure pers&#246;nliche Top 10. Alle Zuschriften nehmen an
der Verlosung von AMIGA AKTUELL teil. Verge&#223;t aber bitte nicht, die
Meinungsfrage von AMIGA AKTUELL zu beantworten, da Ihr nur dann etwas
gewinnen k&#246;nnt. Wenn Ihr mit zwei Stimmen an der Verlsoung teilnehmen
wollt, m&#252;&#223;t Ihr au&#223;erdem die Masterfrage beantworten. Ihr k&#246;nnt &#252;brigens
alle Amiga-Spiele in Eure Top 10 aufnehmen, egal ob kommerziell oder
Shareware, Hauptsache es macht Spa&#223; und l&#228;uft auf einem AMIGA. Diese
Zeitschrift lebt durch Eure Mithilfe, bitte schreibt mir, was ich anders
oder Eurer Meinung nach besser machen soll. Aber schreibt mir auch, wenn
ihr News zu Spielen habt.
<P>
Liebe Programmierer und Softwarefirmen,
<P>
jetzt, da es in Deutschland nahezu keine geeignete Publikation mehr gibt,
die &#252;ber AMIGA-Spiele berichtet, ist es umso wichtiger, jede verbliebene
M&#246;glichkeit zu nutzen, um die treuen AMIGA-Fans mit News, Previews und
Tests zu versorgen. Ich denke AMIGA AGPJ ist eine sehr gute dieser
M&#246;glichkeiten. Mit seinen extrem vielen Verbreitungswegen hat es sicherlich
einige Tausend potentielle Leser. Es liegt an Ihnen, ob Sie mich bei meiner
Arbeit unterst&#252;tzen, und Ihre Spiele bekannt werden. Bitte schicken Sie mir
News zu Ihren Spielen, aber auch Demoversionen. Auch &#252;ber das eine oder
andere Testmuster Ihrer Spiele w&#252;rde ich mich freuen. Dies w&#252;rde nat&#252;rlich
mit einem ausf&#252;hrlichen Test des Spiels gew&#252;rdigt.
<P>


<P ALIGN=RIGHT>
<A HREF="0701.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0703.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
