<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0703.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0705.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>4. Spiele-News aus aller Welt</H2>


<P>
<H3>clickBOOM-Update</H3>
<P>
<A HREF="img/Z.png">Screenshot</A>
<P>
Nach der Veröffentlichung von Quake (Review in dieser AGPJ-Ausgabe) wird
clickBOOM nun QuakeWorld ver&#246;ffentlichen, das das Spielen &#252;ber das
Internet verbessern soll. Au&#223;erdem soll ger&#252;chtehalber ein Patch f&#252;r
Quake erscheinen, der das Tempo auf 060-AMIGAs um einige Frames pro
Sekunde verbessern soll. Der Patch soll nur f&#252;r registrierte Besitzer
des Spiels erh&#228;ltlich sein.
<P>
Die Mindestvoraussetzungen von Napalm haben sich auf 16 MB RAM gesteigert.
Grund daf&#252;r ist die gro&#223;e Menge an Animationen w&#228;hrend des Spiels.
clickBOOM &#252;berlegt jedoch, eine abgespeckte Version des Spiels f&#252;r AMIGAs
mit 8 MB RAM zu ver&#246;ffentlichen.
<P>
clickBOOM stellten ihre Produkte &#252;brigens auf der bekannten Entertainment-
Messe E3 aus (sehr wahrscheinlich als einzige AMIGA-Firma).
Die Umsetzung des Bitmap-Brothers-Echtzeit-Strategiespiels Z f&#252;r den AMIGA
durch clickBOOM d&#252;rfte inzwischen feststehen. In einem animierten GIF auf
der clickBOOM-Homepage ist zumindest schon das Logo des Spiels zu sehen.
Weiterhin hat clickBOOM angek&#252;ndigt, das PC/MAC-Spiel Safecracker auch f&#252;r
AMIGAs umzusetzen. Das Spiel basiert auf QuicktimeVR-Sequenzen, die 360-
Grad-Kamera-Perspektiven mit Zoom, sowie 360 Grad-Rotationen aller Objekte
in einer perfekt gerenderten Umgebung erm&#246;glichen. In Safecracker &#252;bernimmt
der Spieler &#252;brigens (wie der Titel schon vermuten l&#228;&#223;t) die Rolle eines
Tresorknackers. Die AMIGA-Version soll Anfang 1999 erscheinen.
<P>
<H3>Vulcan-Update</H3>
<P>
Das endg&#252;ltige Demo des Spiels Genetic Species (Review in dieser AGPJ-
Ausgabe) ist nun im Aminet erh&#228;ltlich.
Wasted Dreams ist kurz vor der Fertigstellung. Als Ver&#246;ffentlichungstermin
wird nun Ende Juli angestrebt.
<P>
<H3>neue Spiele von Epic Marketing</H3>
<P>
<A HREF="img/QuietPleaseTennis.jpg">Screenshot</A>
<P>
In den n&#228;chsten Monaten wird die Firma Epic Marketing vor allem Fans von
Sport-Spielen begl&#252;cken. Gleich drei Vertreter des Genres werden bei Epic
erscheinen. Das Tennis-Spiel "Quiet Please Tennis", das Fu&#223;ball-Spiel "Eat
the Whistle" und das Formel 1-Rennspiel "XXXXXXXXXXXXXXXXXXXX".
Quiet Please Tennis wird von "The Spooky Fellows" produziert, die aus der
bekannten Szene-Gruppe Ram Jam ("The Charts") hervorgegenagen sind,
produziert. Das Spiel wird eine Mischung aus Simulation und Action-Spiel.
Quiet Please Tennis bietet bis zu 4 Spielern die M&#246;glichkeit gleichzeitig
zu spielen. In Turnieren k&#246;nnen sogar bis zu 32 menschliche Spieler
teilnehmen. Der Karriere-Modus bietet die M&#246;glichkeit, die ATP-Tour
nachzuspielen und eine gute Position in der Weltrangliste zu erreichen.
Ebenfalls interessant klingt der "Crazy Tournament"-Modus, der neben den
normalen Schl&#228;gen einige unm&#246;gliche Schl&#228;ge bietet. Zu den Features des
eigentlichen Spiels geh&#246;ren so verr&#252;ckte Sachen, wie die M&#246;glichkeit den
Schiedsrichter um die &#220;berpr&#252;fung einer umstrittenen Entscheidung zu
bitten. Dieser verl&#228;&#223;t dann seinen Stuhl und pr&#252;ft den Abdruck des Balles.
Die Grafik bietet 128 Farben auf dem Screen, wobei die Spieler aus 32
Farben bestehen und mit 200 Frames animiert sind.
<P>
Eat the Whistle wird auf jedem AMIGA laufen, Weltmeisterschaften, Ligen
und Pokale f&#252;r 1-4 Spieler bieten. Auf der technischen Seite gibt es
Sprachausgabe, mehr als 550 Frames an Animationen f&#252;r die Spieler und 300
Frames f&#252;r den Torwart. Den Spieler erwarten au&#223;erdem 30 verschiedene
Platzverh&#228;ltnisse (von matschig &#252;ber gefroren bis na&#223;), komplexe Men&#252;-
Optionen, ein Spieler, Mannschafts und Taktik-Editor sowie eine Replay-
Funktion. Betrachtet man diese Featureliste, wird schnell deutlich, da&#223;
das alterw&#252;rdige Sensible World of Soccer starke Konkurrenz bekommen wird.
Das Spiel soll in den n&#228;chsten Wochen erscheinen und wird 59 DM kosten.
Virtual GP ist eine Formel 1-Simulation mit allen 16 Grand Prix-Strecken
und allen an der WM beteiligten Fahrern. Virtual GP und Quiet Please
Tennis werden im Herbst erscheinen.
<P>
<A HREF="img/VirtualGP.png">Screenshot</A>
<P>
<H3>Operation: CounterStrike</H3>
<P>
Operation: CounterStrike ist ein weiteres angek&#252;ndigtes Echtzeit-
Strategiespiel. Es wird sehr wahrscheinlich zu den besseren Vertretern des
Genres geh&#246;ren. Produziert wird es von BlueBlackSolutions, Deflexion und
Spex. Hauptfeatures des Multi-CD-Spiels sind 25 unterschiedliche Geb&#228;ude
pro Team, 70 Einheiten, 3 Teams, ca. 50 Missionen, kostenlose AddOn-Level,
ca. 800 MB Animationen und 400 MB Sprache und Soundeffekte (deswegen auch
Multi-CD-Spiel), deutsche und englische Sprachausgabe, beigelegter Game-
Editor, CyberGFX-Support, AHI-Support, TCP/IP-Support, 25 Frames pro
Sekunde selbst auf 68030/25 (in LowRes/AGA), verschiedene
Aufl&#246;sungsstufen, ein qualitativ hochwertiger Soundtrack, filmartige
Zusammenschnitte der Handlung und intelligente Computergegner.
Die Systemvoraussetzungen von Operation: Counterstrike sind ein 020-
Prozessor, 8 MB RAM und ein 2x-CD-ROM-Laufwerk. Empfolhen werden jedoch
ein 030/50-Prozessor, 16 MB RAM und ein schnelleres CD-ROM-Laufwerk.
Das Spiel soll sp&#228;testens Weihnachten 1998 erscheinen, ein Publisher
steht noch nicht fest, da man mit mehreren Firmen verhandelt.
<P>
<H3>Maim &#38; Mangle gestoppt</H3>
<P>
Nachdem in der letzten AGPJ-Ausgabe noch &#252;ber den gestoppten PowerPC-
Support von Deimos Design berichtet wurde, gilt es nun eine traurige
Nachricht zu &#252;berbringen. Das Spiel Maim &#38; Mangle wurde eingestellt. Das
Team wird einige neue Projekte starten, die nur f&#252;r PCs erscheinen werden.
Inwiefern diese Nachricht mit der Ank&#252;ndigung Vulcans zusammenh&#228;ngt, auch
Spiele f&#252;r Playstation und PC zu produzieren, kann nur gemutma&#223;t werden.
Der Sourcecode des Spiels wurde nun The World Foundry &#252;bergeben. Wenn sich
jemand findet, der das Spiel fortsetzen m&#246;chte, ist eine Weiterf&#252;hrung des
Projekts nicht ausgeschlossen. Doch auch ohne Maim &#38; Mangle brauchen
Strategie-Fans nicht zu verzweifeln. Schlie&#223;lich sind mit Napalm, Z,
Operation: Counterstrike oder Forgotten Forever mehrere Echtzeit-
Strategiespiele angek&#252;ndigt, die versprechen, Hits zu werden.
<P>
<H3>Lebenszeichen von Trauma Zero</H3>
<P>
<A HREF="img/TraumaZero.jpg">Screenshot</A>
<P>
Vor einiger Zeit berichtete AMIGA AGPJ &#252;ber ein neues Shoot Em Up namens
Trauma Zero. Ein selbstablaufendes Demo des Spiels im Aminet sorgte damals
f&#252;r Aufsehen. Nun gibt es neue Lebenszeichen des Spiels. Trauma Zero wird
vom Spielprinzip her &#196;hnlichkeiten zu Spielen wie R-Type, X-Out, Project X
haben. Technisch gesehen wird Trauma Zero jedoch all diese AMIGA-Klassiker
schlagen. 256 Farben, horizontales und vertikales Scrolling in 50 hz sowie
besondere Routinen die eine Verringerung des Spieltempos bei vielen
Objekten auf dem Screen verhindern, reichen wohl als Beispiel. Das Spiel
bietet weiterhin 1- und 2-Spieler-Modi, &#252;ber 100 Level (!!!) sowie die
Auswahl aus drei Raumschiffen, freie Farbwahl und 54 verschiedene Waffen.
Ein CD-Soundtrack, Sprachausgabe und eine animierte Introsequenz runden die
Featureliste ab. Systemvoraussetzungen sind ein AGA-Amiga mit 030/50-
Prozessor, 4 MB Fast RAM, Festplatte und CD-ROM-Laufwerk. 040- und 060-
Besitzer erhalten spezielle Versionen f&#252;r ihre Prozessoren. Leider gibt
es immer noch keinen Ver&#246;ffentlichungstermin, doch angesichts der
Screenshots d&#252;rften sich die Publisher gegenseitig &#252;berbieten, um die
Programmierer von Trauma Zero unter Vertrag zu nehmen.
<P>
<H3>Letzte Meldung: Abuse-Port erschienen</H3>
<P>
Die Frieden-Br&#252;der, die auch schon eine Descnet-Portierung f&#252;r AMIGAs
programmiert haben, haben ein weiteres PC-Spiel portiert: Abuse. Der
Source-Code dieses Spiels wurde etwa zeitgleich mit dem von Descent
ver&#246;ffentlicht. Die AMIGA-Portietung ben&#246;tigt die Data-Files der PC-
Version, die auch als Shareware im Internet erh&#228;ltlich sind. Der Amiga-
Port ist im Aminet oder &#252;ber
<A HREF="http://www.informatik.uni-trier.de/CIP/tfrieden">http://www.informatik.uni-trier.de/CIP/tfrieden</A> downloadbar. Ein Test
folgt in der n&#228;chsten AGPJ-Ausgabe.
<P>
<H3>Factor 5-Spiele kostenlos</H3>
<P>
Factor 5 bieten auf ihrer Website einige AMIGA-Klassiker zum kostenlosen
Download an. Die Spiele befinden sich im Amiga-Emulator-eigenen .ADF-
Format, das aber mit Hilfe des Tools ADF2Disk (Aminet) in Amiga-Disketten
umgewandelt werden kann. Bei den Spielen handelt es sich um folgende:
Katakis, Shoot Em Up-Klassiker ist ein Geschenk von Factor 5 an alle
AMIGA-Fans. Jeder darf es kostenlos downloaden. Ebenfalls komplett frei
downloadbar ist eine Diskette mit der Original-Turrican-Musik im .ADF-
Format. Die restlichen Spiele R-Type, BC Kid, Turrican, Turrican 2 und
Turrican 3 d&#252;rfen nur zu Backup-Zwecken von denjenigen heruntergeladen
werden, die die Originale besitzen. Auch diese f&#252;nf Spiele befinden sich
im .ADF-Format, wobei nur R-Type auf eine AMIGA-Diskette geschrieben werden
kann. Die vier anderen Titel sind aufgrund ihres modifizierten Formats
(mehrere Disketten in einer ADF-Datei) nicht auf dem AMIGA verwendbar.
Besitzer der Originale, die die Spiele auf einem PC mit UAE oder Fellow
spielen wollen, wenden sich vertrauensvoll an: <A HREF="http://www.factor5.com/">http://www.factor5.com/</A>
<P>
<H3>neue AMIGA-Spiele-Zeitschrift / Crystal Software-News</H3>
<P>
AMIGA Survivor ist eine neue Zeitschrift f&#252;r AMIGA-Spiele, die in England
erscheinen wird und vorerst nur per mailorder erh&#228;ltlich ist. Das Magazin
wird in DIN A5 erscheinen und im Innenteil schwarzwei&#223; sein. Der
vergleichsweise geringe Preis (ca. 9 DM) rechtfertigt diesen Verzicht auf
Farbe zum Teil. Die Erstausgabe soll Ende Juni / Anfang Juli erscheinen.
&#220;ber die Qualit&#228;t der neuen Zeitschrift werde ich in der n&#228;chsten AGPJ-
Ausgabe berichten. Amiga Survivor erscheint &#252;brigens unter der
Federf&#252;hrung von Crystal Software, der aus dem Alive Mediasoft-Split
hervorgegangenen Firma. Bei Crystal Software werden in der n&#228;heren Zukunft
au&#223;erdem folgende Spiele erscheinen: der Monkey-Island-Clone Gilbert
Goodmate &#38; the Mushroom of Phungoria, das Fantasy Shoot-Em-Up Tank Goblins,
die Weltraum-Strategie-Kriegs-Simulation Arcangel, die Multi-Player-
Flugsimulation Space Patrol und das Echtzeitstrategiespiel Base
<P>
<H3>SWOS-Update auf CU AMIGA-Coverdisk</H3>
<P>
Die aktuelle CU AMIGA-Ausgabe bietet unter anderem ein Daten-Update des
beliebten Fu&#223;ball-Spiels Sensible World of Soccer namens SWOS 98. Das
Update ist sowohl in der Disketten-Version, als auch in der CD-Version
der Zeitschrift enthalten.
<P>
<H3>Sayonara-Update</H3>
<P>
Das Spiel Travel Manager wird nun f&#252;r 10 DM verkauft und soll sehr
wahrscheinlich als Zugabe auf die Samba World Cup-CD gepresst werden.
Samba World Cup liegt in den letzten Entwicklungsz&#252;gen und soll in den
n&#228;chsten Wochen erscheinen. Eine erste Beta-Version des Spiels l&#228;&#223;t
bezweifeln, ob das Spiel so gro&#223;e Verbesserungen im Vergleich zu den
Vorg&#228;ngern Samba Partie und Samba Partie Professional bietet, da&#223; es den
Preis rechtfertigt. Ein Test der endg&#252;ltigen verkaufsversion erscheint in
der n&#228;chsten AMIGA AGPJ-Ausgabe.
Samba World Cup wird in England &#252;brigens von Alive Mediasoft vertrieben.
<P>
<H3>Lambda-Update</H3>
<P>
<A HREF="img/Lambda.jpg">Screenshot</A>
<P>
Lambda wird stetig verbessert. Neue Screenshots sehen im Vergleich zu den
letzten Shots wiederum besser aus. Lambda l&#228;uft mittlerweile nur auf
AMIGAs mit FPU.
<P>
<H3>Fortress of Fear-Update</H3>
<P>
Fortess of Fear ist ein Action-Rollenspiel im Stil von Diablo (AGPJ
berichtete). Der Spieler steuert dabei einen m&#228;nnlichen oder weiblichen
Helden, der (bzw. die) Monster t&#246;tet, R&#228;tsel l&#246;st, und einiges mehr.
Digital Reality Softworx hat nun neue Screenshots ver&#246;ffentlicht um zu
zeigen, da&#223; das Spiel immer besser wird. Fortress of Fear ben&#246;tigt AGA
oder CyberGFX, 030-Prozessor, 4 MB Fast RAM, ein CD-ROM-Laufwerk und eine
Festplatte. Ein eventueller Publisher steht noch nicht fest.
<P>
<H3>"it goes"-Update</H3>
<P>
Die in der letzten AGPJ-Ausgabe erw&#228;hnte Kompatibilit&#228;tsliste f&#252;r AMIGA-
Spiele beschr&#228;nkt sich nat&#252;rlich nicht nur auf 060-Prozessoren, sondern
gibt zu bereits 300 Spielen Auskunft, auf welchem Prozessor (000, 020,
030, 040 oder 060) sie laufen. Selbst &#252;ber die Kompatibilit&#228;t einzelner
Spiele mit dem Amiga-Emulator UAE gibt die Liste Auskunft. Wer bei der
Vervollst&#228;ndigung der Liste helfen will, melde sich bei Dirk Wenk
(E-Mail: <A HREF="mailto:Wax-home@t-online.de">Wax-home@t-online.de</A>). Die Liste ist als Turbocalc-Version und
als .html-Version im Aminet und auf einer der Homepages (z.B.
<A HREF="http://Wax.home.pages.de">http://Wax.home.pages.de</A> ) downloadbar.
<P>
<H3>inoffizielles Quake-Update</H3>
<P>
Im Aminet ist ein Patch f&#252;r Quake erh&#228;ltlich (game/patch/PatchQuake.lha),
der Quake einige Frames pro Sekunde schneller machen soll. Auf 060er-
Rechnern kann der Patch das Spiel allerdings langsamer machen. Besitzer
anderer Prozessoren (falls diese &#252;berhaupt Quake spielen k&#246;nnen bzw.
wollen) sollten sich den Patch einmal ansehen.
<P>
<H3>Dynamic Youth brauchen Fotos von Fu&#223;ballern</H3>
<P>
Dynamic Youth ben&#246;tigen f&#252;r ihr angek&#252;ndigtes Fu&#223;ballspiel The Boot Room
noch Fotos, die bei Fu&#223;ballspielen aufgenommen wurden. Interessenten
schicken ihre Fotos (und zwar nur Fotos, die sie selbst gemacht haben)
an <A HREF="mailto:photos@amigauni.unet-com">photos@amigauni.unet-com</A>
<P>
<H3>Space Station 3000</H3>
<P>
Bei Space Station 3000 handelt es sich um ein Managementspiel, bei der
der Spieler eine Raumstation baut und diese gegen Feinde verteidigt.
Elemente aus Handel und Wissenschaft geh&#246;ren ebenso zum Spiel. Das Spiel
soll etwas an Theme Park erinnern. Space Station 3000 wird auf CD-ROM
erscheinen und 2 MB Fast RAM ben&#246;tigen. Die Entwickler hei&#223;en Digital
Images, ein Publisher steht noch nicht fest.
<P>
<H3>neues Voxel-Rennspiel</H3>
<P>
AMR Voxel ist der Gewinner des CU AMIGA-PowerUp-Wettbewerbs. Das Spiel
ist ein Voxel-Rennspiel, da&#223; f&#252;r PowerPC-Prozessoren optimiert wird
und Tunnel, Br&#252;cken und vieles mehr bieten wird. Auch das Spielen
per seriellem Link soll m&#246;glich sein. Ein erstes Demo der Engine sieht
allerdings nicht sehr vielversprechend aus.
<P>
<H3>Homegrown Software sucht Beta-Tester</H3>
<P>
Homegrown Software, Entwickler des Echtzeit-Strategiespiels Moonbases
sucht nach Beta-Testern f&#252;r das Spiel. Wer Interesse hat, das &#228;u&#223;erst
mittelm&#228;&#223;ige Spiel (Preview in AGPJ 10) zu testen, sollte 2 AMIGA 1200s
besitzen, die er mit einem Nullmodem-Kabel verbinden kann. Auch Besitzer
eines Modems sind willkommen. Kontakt: <A HREF="mailto:homegrown@eclipse.co.uk">homegrown@eclipse.co.uk</A>
<P>
<H3>Mutation Software stoppt Mailorder-Aktivit&#228;ten</H3>
<P>
Der Spielepublisher Mutation Software, der nur durch schlechte Spiele
auffiel mu&#223;te seine Mailorder-Aktivit&#228;ten einstellen. Als Gr&#252;nde wurden
schlechte Verkaufszahlen der "Mutation Gold Compilation CD-ROM" (kein
Wunder bei den schlechten Spielen) und nicht bezahlte Rechnungen durch
Alive Mediasoft angegeben.
<P>


<P ALIGN=RIGHT>
<A HREF="0703.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0705.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
