<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0706.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0708.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>Review: Quake</H2>


Quake. Jeder der irgendwie mit PCs zu tun hat oder Bekannte mit einem PC
hat, kennt dieses Spiel. Bei erscheinen der PC-Shareware-Version des Spiels
vor fast genau zwei Jahren brachen die Web- und FTP-Server von id Software
fast zusammen. Kein Spiel wurde bis dahin sooft in so kurzer Zeit aus dem
Internet heruntergeladen. Nun ist Quake dank der Umsetzung von clickBOOM
auch f&#252;r den AMIGA erh&#228;ltlich. F&#252;r alle, die Quake noch nicht kennen, kommt
hier der ausf&#252;hrliche Test.
<P>
Das Spiel kommt in einer edlen Papp-CD-H&#252;lle mit einer gedruckten Aleitung
im Booklet. Die Verpackung d&#252;rfte dieselbe sein, die schon f&#252;r die
PC-Version benutzt wurde, zumal auf der R&#252;ckseite die Systemvoraussetzungen
der PC-Version zu lesen sind und die AMIGA-Systemvoraussetzungen mittels
Aufklaber hinzugef&#252;gt sind. Dort steht als Mindestvoraussetzung ein 68020-
Prozessor mit FPU, 8 MB RAM, AGA oder Grafikkarte und 60 MB freier Platz
auf der Festplatte. Empfohlen wird dagegen ein 68060-Prozessor und 16 MB
RAM und noch nie ware eine Empfehlung so wichtig wie bei Quake. Jeder,
dessen AMIGA nur die Mindestvoraussetzungen erf&#252;llt, sollte lieber nicht
weiterlesen oder seinen Rechner aufr&#252;sten, denn Quake ist selbst auf
AMIGAs mit 68040-Prozessor zwar lauff&#228;hig, angesichts der
Spielgeschwindigkeit aber nicht spielbar. Nur Besitzer von 68060-AMIGAs
k&#246;nnen Quake mit einer halbwegs ertr&#228;glichen Frames-Pro-Sekunde-Rate
spielen. So empfielht clickBOOM sogar, den Prozessor zu &#252;bertakten.
Angesichts von Raten um 10 Frames pro Sekunde, je nach Monsteraufkommen
und Raumgr&#246;&#223;e ist es umso verwunderlicher, da&#223; clickBOOM KEINE PowerPC-
Version des Spiels plant, w&#228;re diese doch weitaus sinnvoller als die
geplante Myst-PPC-Version. PPC-Besitzer mit Internet-Anschlu&#223; kommen dank
zweier illegaler PPC-Ports des Spiels bereits in den Genu&#223; h&#246;herer
Spielgeschwindigkeit.
<P>
Hat man die ca. 60 MB auf seine Festplatte installiert (Start des Spiels
von CD ist nicht m&#246;glich), kann das Spiel gestartet werden.
Vom Spielprinzip her bietet Quake gegen&#252;ber seinen Vorg&#228;ngern Doom und
Doom 2 erwartungsgem&#228;&#223; kaum Neuerungen, wie auch in anderen 3D-Shootern
sieht der Spieler die R&#228;ume aus der Perspektive seines Helden, bewegt sich
durch unz&#228;hlige R&#228;ume und schie&#223;t auf alles was sich bewegt. Was macht
Quake aber so besonders ? Hier ist wohl vor allem die Technik zu nennen.
Die komplette Quake-Welt besteht aus echten dreideimensionalen Objekten,
es gibt ein oben und ein unten. Die Monster in Quake sind auf Wireframe-
Modellen basierende Figuren. Die dunkel gehaltenen Level verbinden sich
zusammen mit dem stimmigen Sound zu einem Spielvergn&#252;gen, das an Atmosph&#228;re
kaum zu &#252;berbieten ist. Die CD-Audio-Tracks aus der Feder der Nine Inch
Nails tun ihr &#220;briges f&#252;r diesen Eindruck.
<P>
Besonders beliebt an Quake ist auch dessen Multiplayer-Funktionalit&#228;t.
Mittels Nullmodemkabel, Modem, lokalem Netzwerk oder Internet lassen sich
relativ einfach komplexe Schlachten mit mehreren Spielern schlagen. Nicht
um sonst haben sich zahlreiche "Clans" gebildet, die auf dem Weg zu Ehre
und Ruhm andere Clans herausfordern und sich gigantische Gefechte liefern.
Die Steuerung des Spiels ist noch einfacher als bei vielen anderen
3D-Shootern, eigentlich kann man sich lediglich bewegen und schie&#223;en.
W&#228;hrend des Spiels, das &#252;brigens aus vier Episoden mit jeweils vielen
einzelnen Levels besteht, begenen dem Spieler au&#223;er den Monstern viele
Secrets. Manche dieser Geheimnisse sind leicht und andere schwer zu
entdecken. In diesen Geheimverstecken finden sich zumeist n&#252;tzliche
Extras wie Energie oder Munition. Hat man ein Level beendet, gibt es eine
Erfolgsstatistik, die &#252;ber die Spielzeit, die gefundenen Secrets und die
erledigten Monster Auskunft gibt.
<P>
Unter dem Strich bleibt der auf dem AMIGA bisher technisch beste
3D-Shooter, der allerdings auch die h&#246;chsten Systemanforderungen verlangt.
Kein Spiel hat den AMIGA-Besitzern bisher so vor Augen gef&#252;hrt, da&#223; eine
Neu- bzw. Weiterentwicklung der AMIGA-Hardware dringend notwendig ist.
Wie diese Entwicklung auch aussieht (PPC oder neuer Super-AMIGA), so ist
sie doch dringend erforderlich und zwar zu einem vern&#252;nftigen Preis. F&#252;r
unter 2000 DM bekommt man heute schon einen PC, auf dem Spiele wie Quake 2
oder Unreal, die Quake wie ein Spiel aus alten Zeiten aussehen lassen,
nahezu perfekt laufen. Gefordert sind au&#223;erdem die Softwarefirmen. Eine
PPC-Version von Quake k&#246;nnte ein gro&#223;er Schub f&#252;r die PowerPC-Plattform
sein. Also, tut es clickBOOM !
<P>
Der Wertungskasten bezieht sich lediglich auf das Spielen von Quake mit
060-AMIGAs. Allen anderen AMIGA-Besitzern mu&#223; ich vom Kauf des Spiels
abraten.
<P>
<PRE>+-------------------------------------------------------------------------+
|  Name:          Quake                                                   |
|  Hersteller:    clickBOOM / PXL Computers; Box 969 - 31 Adelaide St.East|
|                 Toronto Canada, M5C 2K3                                 |
|  Preis:         ca. 100 DM                                              |
|  Datentr&#228;ger:   1 CD-ROM                                                |
|  Genre:         3D-Shooter             | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        mind. 68020 + FPU, 8 MB RAM, AGA oder Grafikkarte, 60 MB|
|                 Platz auf der Festplatte, CD-ROM-Laufwerk               |
|  Fazit:         eins der besten Action-Spiele aller Zeiten mit den      |
|                 h&#246;chsten Hardwareanforderungen aller Zeiten. NUR F&#220;R    |
|                 BESITZER VON 060-AMIGAS GEEIGNET !!!                    |
|  Wertung:                                                               |
|                             Grafik:    10/10                            |
|                             Sound:      8/10                            |
|                             Handhabung: 9/10                            |
|                             Spielspa&#223;: 10/10                            |
|                             GESAMT:     95 %     AMIGA AGPJ AWARD       |
+-------------------------------------------------------------------------+</PRE>
<P>


<P ALIGN=RIGHT>
<A HREF="0706.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0708.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
