<HTML>
<HEAD><TITLE>
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="0708.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="0710.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
AMIGA ActionGamesPlayerJoker - von Jens Schröder (jschroe@gwdg.de)
</font>
</TD></tr>
</TABLE>


<P>

<H2>Review: Virtual Karting 2</H2>


Ebenfalls im Juni erschienen ist das neue Rennspiel Virtual Karting 2. Der
Vorg&#228;nger dieses Titels, Virtual Karting war seinerzeit umstritten, einige
Teile der Presse schrieben Verrisse, andere Teile lobten das Spiel. Doch
wie sieht der zweite Teil des Rennspiels aus. Hat sich viel ge&#228;ndert ? Das
erfahrt Ihr, wenn Ihr weiterlest.
Das Spiel kommt in einer Epic-&#252;blichen Pappschachtel daher, in der die CD
bzw. die Disketten, sowie eine deutschsprachige Anleitung liegen. Nach
Starten des Spiels (Direkter Start von CD ist m&#246;glich) sieht der Spieler
das Titelbild und das Hauptmen&#252;. Dort kann er zuerst im Options-Men&#252; einige
Einstellungen vornehmen. Die Steuerung l&#228;&#223;t sich zwischen Joystick und Maus
&#228;ndern, man kann die Schaltung zwischen manueller Schaltung und Automatik
wechseln und die Pixelgr&#246;&#223;e l&#228;&#223;t sich zwischen 2x1 und 2x2 ver&#228;ndern.
Leider gibt es keine 1x1-Option, so da&#223; die Grafik w&#228;hrend des Spiels recht
grobpixelig aussieht. Auf der anderen Seite wird durch diese Modi erreicht,
da&#223; das Spiel auch auf unaufger&#252;steten AMIGAs in hoher Geschwindigkeit
l&#228;uft. Zur&#252;ck im Hauptmen&#252; kann vor Start des Rennens noch zwischen 80ccm-
und 125ccm-Kart gew&#228;hlt werden. Den 80ccm-Modus h&#228;tte man jedoch weglassen
k&#246;nnen, da die gegnerischen Karts dieselbe Geschwindigkeit wie in 125ccm-
Rennen erreichen, so da&#223; der Spieler selbst in perfekten Rennen ohne Fehler
nicht gewinnen kann. Da auch die ablaufende Zeit keinen Unterschied
zwischen 80ccm- und 125ccm-Rennen macht, kommt man auch gar nicht erst ins
Ziel. Der 125ccm-Modus ist zum Gl&#252;ck etwas fairer. Hier lassen sich sogar
ein paar gegner &#252;berholen und Rennen gewinnen. Doch was passiert nach einem
solchen Sieg. Nein: Kein h&#252;bsches Siegerbild, das die Pause bis zum
n&#228;chsten Rennen verk&#252;rzt. Der Spieler gelangt zur&#252;ck ins Hauptmen&#252;, von wo
aus er sich eine weitere der sechs Strecken ausw&#228;hlen kann. Ein
Championship- oder Liga-Modus h&#228;tte der Langzeitmotivation des Spiels
sicher gutgetan, so hat man sehr schnell keinen Spa&#223; mehr, die wenigen
Strecken zu befahren.
<P>
Die Unterschiede zum Vorg&#228;ngerspiel sind sehr gering. Nennen mu&#223; man hier
lediglich die Erh&#246;hung der Streckenzahl von drei auf sechs, der
zus&#228;tzliche Screenmode 2x1 und die eher kosmetischen Features von
Reflexionen im Wasser und Objekten an der Fahrbahn. Weiterhin wurde der
angeblich nervende Kopierschutz des Vorg&#228;ngers weggelassen.
Diejenigen, die dieser Testbericht noch nicht abgeschreckt hat, k&#246;nnen
sich im Aminet eine Demoversion des Spiels herunterladen. Mein Fazit
lautet zumindest, da&#223; Virtual Karting 2 f&#252;r ein Volpreisspiel zu wenig
bietet. Eine Ver&#246;ffentlichung als Data Disk f&#252;r Virtual Karting zu einem
geringeren Preis w&#228;re sicher sinnvoller gewesen.
<P>
<PRE>+-------------------------------------------------------------------------+
|  Name:          Virtual Karting 2                                       |
|  Hersteller:    epic marketing, Hirschauer Stra&#223;e 9, 72070 T&#252;bingen,    |
|                 Tel.: 07071/400492, E-Mail: <A HREF="mailto:epic@swol.de">epic@swol.de</A>                |
|  Preis:         59 DM                                                   |
|  Datentr&#228;ger:   1 CD-ROM                                                |
|  Genre:         Rennspiel              | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: deutsch             |
|  System:        mind. AGA                                               |
|  Fazit:         mittelm&#228;&#223;iges Rennspiel, da&#223; nur wenig Neues bietet und |
|                 das Dank fehlendem Championship-Modus keine gro&#223;e       |
|                 Langzeitmotivation bietet.                              |
|  Wertung:                                                               |
|                             Grafik:     7/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 6/10                            |
|                             Spielspa&#223;:  5/10                            |
|                             GESAMT:     57 %                            |
+-------------------------------------------------------------------------+</PRE>
<P>


<P ALIGN=RIGHT>
<A HREF="0708.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="0710.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
