<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1103.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1105.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>4. Maxon verkündet Abschied vom AMIGA</H2>

<P>
&#187;Amiga Statement
<P>
Offizielle Bekanntmachung der Firma MAXON Computer GmbH
<P>
Liebe Amiga-Fangemeinde,
<P>
hei&#223;e Diskussionen um die Zukunft des AMIGA haben seit Mitte der neunziger
Jahre die Szene bewegt.
<P>
Oft war leider nur hei&#223;e Luft dahinter oder gut gemeinte, aber schlecht
kalkulierte Konzepte.
<P>
Hat sich auch in letzter Zeit wieder ein Silberstreif am Horizont
abgezeichnet, eine moderne Hardware-Basis in die AMIGA-Technik zu
implementieren, so zeigt sich doch die Praxis etwas komplexer als geplant.
Die wirtschaftlichen Erfordernisse des Marktes zwingen in solchen F&#228;llen
leider zum Handeln.
<P>
Leider haben wir uns daher dazu durchringen m&#252;ssen, die AMIGA-
Produktpalette ab sofort einzustellen.
<P>
Auf den letzten Messen konnten wir auf die zahlreichen Fragen nach einer
Portierung von CINEMA 4D f&#252;r die PowerUP-Plattform immer wieder nur
antworten: "Sobald die entsprechenden Entwicklungswerkzeuge verf&#252;gbar sind"
- diese gibt es bis heute nicht. F&#252;r eine derart komplexe Applikation wie
CINEMA 4D ist eine solch hochentwickelte Programmierumgebung aber absolut
notwendig. Ohne objektorientierte Hochsprache wie C++ ist eine sinnvolle
Portierung nicht m&#246;glich - die existierende Hardware ist bereits mit der
derzeit erh&#228;ltlichen Version 4 ausgereizt.
<P>
Als Firma, die u.a. mit dem AMIGA seit 1986 gro&#223; geworden ist und die nicht
nur als Software-Anbieter (und Marktf&#252;hrer im Raytracing-Bereich), sondern
auch als Verleger von Zeitschriften wie "Kickstart" und zahlreichen B&#252;chern
den AMIGA-Markt mitgepr&#228;gt hat, f&#228;llt eine solche Entscheidung alles andere
als leicht.
<P>
Aber auch die j&#252;ngsten Ereignisse auf den AMIGA-Events im Mai in London und
Toronto zeigten, da&#223; in den n&#228;chsten Jahren eine konkrete Besserung der
Situation nicht abzusehen ist. Zu lange wurde mit wichtigen Entscheidungen
gewartet, haben falsche Entscheidungen in Sackgassen gef&#252;hrt, haben zu
viele Seiten unkoordiniert gehandelt.
<P>
Pl&#228;ne sind gut und sch&#246;n, doch in einem so schnellebigen Markt, wie der
Computerbranche sind 2 Jahre unendlich lange - zu lange.
<P>
Ein Markt, der nur noch minimale St&#252;ckzahlen abnimmt, so da&#223; ein
wirtschaftliches Arbeiten nicht mehr m&#246;glich ist, bietet einem Unternehmen
mit seiner sozialen Verantwortung den Mitarbeitern und Angestellten
gegen&#252;ber kein sicheres Einkommen mehr.
<P>
Der Blick mu&#223; daher nach vorne gerichtet sein, und CINEMA 4D hat sich in
den letzten Jahren im High-End Bereich eine sichere Position im weltweiten
Markt erk&#228;mpft. Heute z&#228;hlen wir viele gro&#223;e Fernsehanstalten und TV-
Produktionsfirmen zu unseren Kunden, die Fachwelt &#228;u&#223;ert sich begeistert
&#252;ber das Produkt (z.B. Siggraph 1997 "Best Animation-Tool: CINEMA 4D XL")
und verlangt eine kontinuierliche Entwicklung. Diesem Markt werden wir auch
in Zukunft gerecht werden k&#246;nnen.
<P>
Als Abschiedsgeschenk bieten wir daher allen treuen AMIGA-Usern die
Vollversion von Cinema 4D V4 Pro auf einer der n&#228;chsten AmigaPlus CD-ROMs
an.
<P>
Wir sagen Goodbye und w&#252;nschen euch weiterhin noch viel Erfolg.
<P>
Eure,
<P>
MAXON Computer GmbH
<P>
(Friedrichsdorf, 11.06.1998)&#171;
<P>
<B>Fazit:</B>
<P>
Nach monatelangen Ger&#252;chten hielt es Maxon nun also endlich f&#252;r angebracht,
eine Stellungnahme zu ver&#246;ffentlichen. Ob der darin genannte Grund "Es g&#228;be
keine geeigneten Entwicklungswerkzeuge" stichhaltig ist, mu&#223; jeder selbst
entscheiden. Ich m&#246;chte aber daran erinnern, da&#223; es mit Storm einen nach
Meinung vieler Nutzer &#228;u&#223;erst leistungsf&#228;higen C++-Compiler gibt; und zudem
hat ja Maxon noch vor gar nicht so langer Zeit ein eigenes C-Compilersystem
angeboten (von den anderen Programmiersprachen gar nicht zu reden).
<P>


<P ALIGN=RIGHT>
<A HREF="1103.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1105.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
