<HTML>
<HEAD><TITLE>
Diverse Neuigkeiten
</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">

<TABLE width=100% border=0 cellpadding=3 cellspacing=0>

<tr>
<td bgcolor="#000000">
<A HREF="1114.html"><IMG SRC="../menu/links.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<A HREF="1200.html"><IMG SRC="../menu/rechts.gif" BORDER=0 WIDTH=15 HEIGHT=15></A>
<font color="#FFFFFF">
Diverse Neuigkeiten
</font>
</TD></tr>
</TABLE>


<P>

<H2>15. Statement des Computer-Club Hof zur Computronika '98</H2>

<P>
&#187;Wir, der CCH werden mit sofortiger Wirkung&#160;die Zusammenarbeit&#160; mit der
Firma Th&#252;mmler&#160;k&#252;ndigen, und andererseits ebenfalls, da man von Seiten
Dritter, die Namen sind&#160;uns mittlerweile bekannt, immer wieder&#160;f&#252;r negative
Schlagzeilen gesorgt hat!
Daraus resultierte, da&#223; man das Vertrauen untereinander verlor und&#160;somit
eigene Wege geht; wir&#160; w&#252;nschen jedoch der Firma Th&#252;mmler gutes Gelingen
dieser Messe&#160;und werden&#160;eine eigene Messe organisieren!
Man spioniert uns immer wieder hinterher, so da&#223; wir gezwungen sind,
einiges geheimzuhalten; man will &#252;ber Dritte herausfinden, was wir f&#252;r
Mitgliederzahlen&#160;sowie Zugriffe, Aktivit&#228;ten haben, usw. Jedoch wollen wir
eigentlich nur unseren Frieden und Ruhe, aber er wird durch solche&#160;
Minderheiten gest&#246;rt.
Sogar bei Firmen wird man angepriesen, was wir f&#252;r Lottergesellschaft (O-
Ton eines Unruhestifters) sind, aber die meisten Firmen haben sich Gott sei
Dank darauf nicht eingelassen, und von denen, die es geglaubt haben, werden
wir uns distanzieren und auf jegliche Zusammenarbeit&#160;verzichten!!!
Auch andere Sachen, wie Homepage-Gestaltung,&#160;sowie einige andere kleine
Dinge, wie &#228;hnliches Logo auf einem Banner im Bayernnetz usw., sind
abgekupfert, so da&#223; man sich eigentlich an den Kopf langen mu&#223;, um dies zu
glauben.
Ist schon wahnsinnig, da&#223; man bei einem ehemaligen Club viel&#160;Arbeit
investierte und dies zerschlagen wurde, und nun soll es wieder sein, aber
wir sagen diesmal "Nein".
<P>
Es ist nur eine Frage der Zeit, bis man&#160;diese Erkl&#228;rung&#160;in irgendeiner
Form&#160;auf einer Homepage ver&#246;ffentlicht. Auch die aktuelle Meldung, da&#223; man
Mitveranstalter der Computronika `98 ist, kann nicht mehr lange dauern.
<P>
Wir m&#246;chten jedoch eine eigene Messe veranstalten und werden diesbez&#252;glich&#160;
weiterhin planen, was wir auch ohnehin schon gemacht haben!
Eine geeignete Halle haben wir auch schon gefunden und werden somit mit der
Werbung beginnen.
<P>
Das offizielle&#160;Veranstaltungsdatum sowie die anderen Dinge, wie z.B Ort,
Inhalt usw., werden wir bekanntgeben. Wer jedoch daran interessiert ist
und&#160;bei uns Aussteller oder Besucher sein m&#246;chte, kein Problem, wir werden&#160;
Ihnen dann die n&#246;tigen Unterlagen zusenden, sobald wir diese Dinge
abgekl&#228;rt haben.
<P>
Ich hoffe, da&#223; wir ein bi&#223;chen Licht ins Dunkle gebracht haben, und hoffen,
da&#223; somit ein klein&#160; wenig&#160;beigetragen wurde, um das Vertrauen in einen
Club, der eigentlich das Ziel&#160; hat, Computer-User&#160;in jeder Sache beiseite
zu stehen, geholfen zu haben.
<P>
Mit freundlichen Gr&#252;&#223;en
<P>
Computer-Club Hof&#171;
<P>


<P ALIGN=RIGHT>
<A HREF="1114.html"><IMG SRC="../menu/pfeil_links.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
<A HREF="1200.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER=0 WIDTH=20 HEIGHT=20></A>
</P>
</BODY>
</HTML>
