<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0A - Scalos</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00C4.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00C3.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C5.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00C4.html">Scalos</A> | <A HREF="0x00C5.html">The Digital Universe V1.03</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00BF.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00C0.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00C1.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00C2.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00C3.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00C4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00C6.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00C8.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00C9.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00CA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00CB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Scalos - Multitasking von seiner sch&ouml;nsten Seite</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Was ist Drag'n Drop doch Sch&ouml;nes? Einfach das Icon
nehmen, ins andere Fenster ziehen, fallenlassen und - flutsch! - kopiert
sind die ganzen Daten. Aber ach, das wollte ich doch gar nicht und jetzt
dauert das wieder so lange, bis die Workbench wieder benutzbar wird? Tja,
genau daf&uuml;r gibt es den Workbench-Ersatz namens Scalos.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das wichtigste Attribut des AmigaOS in vielen Diskussionen ist immer
wieder sein pr&auml;emptives Multitasking-Konzept, und ausgerechnet beim
Sichtbarsten aller Tools, der Workbench, gibt es keines. Schlecht, dachte
sich da ein engagierter Programmierer aus deutschen Landen und
programmierte sich seine eigene Workbench. Was daraus geworden ist?
Probieren Sie es aus, es lohnt sich!<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>&quot;Des is ja olls des S&ouml;lbe!!&quot;</B></H3>&nbsp;

<BR>Ja freilich schaut die Scalos-Oberfl&auml;che nach der reibungslosen
Installation und dem praktischen Doppel(!)-Klick aufs Icon genau gleich
aus, wie die Workbench. Das ist ja auch der Sinn der Sache. Die
Interessantheiten treten dann zu tage, wenn man sich etwas n&auml;her mit
der Thematik befa&szlig;t. Auch wenn ich jetzt schon seit l&auml;ngerer
Zeit Scalos bei mir laufen habe, kenne ich noch nicht alles. Zugute halten
kann ich aber schon mal vorab, da&szlig; es mir in dieser Zeit kein
einziges Mal abgest&uuml;rzt ist, die getestete Version 1.1 also wirklich
brauchbar stabil ist.<BR>

<BR>Die Testversion &ouml;ffnet einen eigenen Screen, der auf den ersten
Blick gar nicht von der Workbench zu unterscheiden ist und die gleiche
Funktionalit&auml;t bietet. Einige Einschr&auml;nkungen sind eingebaut,
aber man sollte dieses geniale St&uuml;ck Software sowieso registrieren
lassen. In der registrierten Version kann Scalos dann als
vollst&auml;ndiger Workbench-Ersatz zum Einsatz kommen, indem einfach der
<TT>LoadWB</TT>-Befehl ausgetauscht wird.<BR>

<BR>Obiges Kopier-Szenario kann sich nun nicht mehr wiederholen, denn
sobald man zum Kopieren anf&auml;ngt, &ouml;ffnet sich ein Fenster mit der
Anzeige der kopierten Dateien. Dessen Schlie&szlig;-Gadget kann zum
Abbrechen des Kopier-Vorganges eingesetzt werden. Die Reaktionszeit darauf
ist erfreulich kurz und das Ergebnis ist eine teilweise Kopie.
Gel&ouml;scht wird dabei nichts wieder. Beim L&ouml;schen von Dateien
&ouml;ffnet sich ein ganz &auml;hnliches Fenster, das nun aber auch ein
zus&auml;tzliches &quot;Abbrechen&quot;-Gadget besitzt, da&szlig; zwar
Gel&ouml;schtes nicht wieder herholen kann, aber der Vorgang wird wirklich
sogleich abgebrochen. So soll das sein :-))<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>&quot;Ich will jetzt!&quot;, &quot;Nein! Ich!&quot;</B></H3>&nbsp;

<BR>Nur keine Sorge, jeder kommt dran. Denn da f&uuml;r jedes Fenster ein
eigener Task gestartet wird, k&ouml;nnen auch unz&auml;hlige Kopier-,
L&ouml;sch- und dergleichen Vorg&auml;nge gleichzeitig ausgef&uuml;hrt
werden, ohne da&szlig; irgendeine Funktion dieser besseren Workbench
gesperrt werden w&uuml;rde.<BR>

<BR>Eigentlich k&ouml;nnte dieser Testbericht hier schon aufh&ouml;ren,
denn dieses feine Feature ist es, der Scalos so bemerkenswert macht. Ja, da
gibt es auch noch so einen anderen Workbenchersatz, aber der ist mir zu
&quot;astronomisch&quot;, sprich, viel zu &uuml;berladen. Gerade dieses ist
Scalos (noch? hoffentlich nicht!) nicht und genau dieses Multitasking
funktioniert einfach. Feine Sache.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Konfigurationen</B></H3>&nbsp;

<BR>Nun kann man sicher Scalos einfach mal so als Ersatz der Workbench
&uuml;bernehmen, aber mit den 4 zus&auml;tzlichen Preferences kann man
unter anderem auch seine Men&uuml;s frei gestalten.<BR>

<BR>Und hier stutzt man schon mal, denn in der Grundeinstellung sind keine
Men&uuml;s definiert und die rechte Maustaste f&uuml;hlt sich in der
Titelleiste schon sehr vereinsamt. Gl&uuml;cklicherweise lassen sich aber
die Standardeinstellungen leicht aus Voreinstellungen f&uuml;r deutsch,
englisch, zweimal franz&ouml;sisch, italienisch oder schwedisch importieren
und man kommt wieder in den Genu&szlig; der bekannten Men&uuml;s, mit der
Beruhigung, diese jederzeit an seine eigenen W&uuml;nsche anpassen zu
k&ouml;nnen. Mir ist es aber lieber so, wie ich es schon seit Jahren
gewohnt bin. Man wird faul im Alter ;-)) Einzig dem Men&uuml;punkt
<I>L&ouml;schen</I> habe ich endlich Amiga-D zuordnen k&ouml;nnen.<BR>

<BR>In den Men&uuml;-Einstellungen stutzt man dann schon wieder (lese man
die mitgeliefteren Dokumentationen, w&auml;re das freilich anders), denn
dort gibt es auch Unterpunkte f&uuml;r Popup-Men&uuml;s. Fein
s&auml;uberlich aufgeteilt f&uuml;r Disk-, Schubladen-, Werkzeug/Projekt-
und M&uuml;lleimer-Piktogramme einzeln. Weiters l&auml;&szlig;t sich auch
ein Kontextmen&uuml; f&uuml;r Directory-Fenster &ouml;ffnen, wenn man in
dessen Titelzeile klickt. Diese kann auch verdeckt, das Fenster dagegen
aktiv sein. Zu diesen praktischen Men&uuml;s kommt man, wenn man die <TT><A
HREF="http://at.aminet.net/pub/aminet/util/libs/pmuser.lha">popupmenu.libra
ry</A></TT> installiert, die bei Scalos nicht dabei ist.<BR>

<BR>Die <TT>newicon.library</TT> dagegen ist mit inkludiert und bietet so
auf einfache Weise diese &quot;anderen&quot; Icons. Ob sie Gefallen finden,
ist ja nun Geschmackssache, aber wof&uuml;r kann man denn Files umbenennen
oder l&ouml;schen?<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Scalos ist an sich sehr modular aufgebaut und so sind auch so
essentielle Sachen, wie <I>Befehl ausf&uuml;hren</I> aus dem Hauptmen&uuml;
als Modul (lokalisierbar - f&uuml;r jedes Plugin gibt es einen eigenen
Katalog, fertig mitgeliefert in d&auml;nisch, deutsch, spanisch,
franz&ouml;sisch, italienisch und noch ein paar anderen) ausgef&uuml;hrt.
Das bietet bei der Installation die M&ouml;glichkeit, zwischen Gadtools-,
ClassAct- und MUI-Aussehen und -Funktionalit&auml;t zu w&auml;hlen. Die
Preferences selber sind dabei aber immer MUI-Programme.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Icons mal durchsichtig</B></H3>&nbsp;

<BR>Zieht man Icons durch die Gegend, werden sie transparent dargestellt,
soda&szlig; der Untergrund sch&ouml;n durchscheint. Bei der richtigen
Einstellung werden sie dann wieder fl&auml;chig, sobald man sich an einer
Stelle befindet, an der das Icon fallengelassen werden kann. Das schaut
nicht nur sch&ouml;n aus, das ist auch praktisch. Dabei gehen die
Einstellungsm&ouml;glichkeiten so weit, da&szlig; man zum Beispiel angeben
kann, da&szlig; bei Disks die Icons fl&auml;chig werden sollen, beim
Trashcan aber nicht, oder auch ganz anders. Die Scalos-Prefs bieten da
ungez&auml;hlte M&ouml;glichkeiten.<BR>

<BR>Ebenso wie auch die Titelzeilen v&ouml;llig frei definiert werden
k&ouml;nnen. Mittels Prozent-Zeichen werden dann in die Zeile Daten wie
Versionsnummern oder Speichergr&ouml;&szlig;en und dergleichen mehr
eingef&uuml;gt.<BR>

<BR>Der Men&uuml;punkt <I>Fenster aufr&auml;umen</I> tut auch nicht nur
das, was er soll, nein, es k&ouml;nnen die Abst&auml;nde, in denen die
Icons angeordnet werden sollen, festgelegt werden. Und sollen es mal keine
Icons sein, so wechselt man in den Textmodus. Hier sieht man dann ganz
deutlich schon Unterschiede. Denn es kommt eine zus&auml;tzliche
Men&uuml;zeile ins Fenster, die Gadgets darstellen. Das jeweils aktivierte
legt fest, da&szlig; nach dieser Eigenschaft sortiert werden soll, wie zum
Beispiel nach Name, Gr&ouml;&szlig;e, Datum oder Zugriffsbits.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Alles wie aus einem Gu&szlig;??</B></H3>&nbsp;

<BR>Ja, und doch nicht, denn das modulare Konzept von Scalos erlaubt es,
weitere Plugins und Module einzubinden, indem sie ins passende
<TT>Plugins</TT>-Verzeichnis kopiert und in den Preferences angew&auml;hlt
werden.<BR>

<BR>Da gibt es dann zum Beispiel Plugins, die man als zus&auml;tzlichen
Men&uuml;punkt einbinden kann, als Beispiel w&auml;re da sortiertes
Aufr&auml;umen zu nennen. Andere Plugins stellen so praktische
M&ouml;glichkeiten wie automatische Filetypen-Erkennung dar, oder die
Anzeige der jeweils freien Farbstifte in der Titelzeile und dergleichen
mehr.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Und da wird es jetzt interessant, denn das Filetype-Plugin soll die
M&ouml;glichkeit bieten, da&szlig; per Doppelklick auf zum Beispiel ein
Lha-Archiv ein Requester erscheint, in dem ausgew&auml;hlt werden kann, ob
das Archiv angeschaut, entpackt (mit Angabe des Ziel-Verzeichnisses) oder
zum Beispiel auch getestet werden soll. Und alles wie immer sch&ouml;n brav
frei konfigurierbar, leider auch ein Mu&szlig;, denn es gibt keinerlei
Voreinstellungen dazu. Das mu&szlig; alles selber gebaut oder von den
Default-Icons importiert werden. Dieses ist aber alles noch sehr im
Beta-Stadium, weshalb zum Beispiel das Preferences-Fenster nicht durch das
Close- oder das Save-Gadget geschlosen werden kann, sondern nur durch das
Cancle-Gadget. Die Einstellungen bleiben dabei aber erhalten. Leider helfen
auch die Doku-Files dazu nicht viel weiter, denn etliche Seiten darin sind
noch leer. Warten wir also ab, was denn da noch so alles kommen mag...<BR>

<BR>Was man alles einstellen kann, ist schier unglaublich. Die
Funktionsweise ist die, da&szlig; man einem Icon ein Default-Tool zuordnet,
zum Beispiel auch <TT>DoCommand</TT> aus dem Tools-Verzeichnis von Scalos.
Dieses <TT>DoCommand</TT> kann dann Requester &ouml;ffnen, Shells
aufmachen, Befehle ausf&uuml;hren - ganz nach Belieben. Die Auswahl,
welches dieser Default-Icons nun zu nehmen ist, h&auml;ngt von den
Kriterien ab, die in den FileType-Preferences eingestellt werden. Da kann
zum Beispiel nach einer ganz bestimmten Zeichenfolge an einem bestimmten
Offset im File gesucht werden (zum Beispiel &quot;-lh&quot; ab Position 2
erkennt LHA-Archive, etc.) oder man vergleicht auf Dateigr&ouml;&szlig;e
(gleich, kleiner, gr&ouml;&szlig;er, etc.) oder -name in bekannter
DOS-Pattern-Notation. Auch die Suche nach FileType (Datei, Schublade, Link,
etc.) oder Protection-Bits ist m&ouml;glich. Das alles dann auch noch in
ausschlie&szlig;ender Suche, Kriterien ODER-verkn&uuml;pft usw. erfolgen.
Wirklich feine Sache. Nur hat das einen Haken: bei mir funktioniert die
Erkennung nicht und es wird bei Klick auf Nicht-Programm-Icons immer der
normale Requester ge&ouml;ffnet, der die Eingabe des auszuf&uuml;hrenden
Programmes (wie Men&uuml;punkt <I>Befehl ausf&uuml;hren</I> aus der
Workbench) verlangt. Hmmm, aber ich komm schon noch drauf...<BR>

<BR>Auch ein Hindernis dabei ist die Tatsache, da&szlig; der Voreinsteller
f&uuml;r die Filetypes ein MUI-Programm ist, das die MUI-Class
<TT>Betterstring.mcc</TT> braucht. Diese ist aber nirgends in den Archiven
enthalten und mu&szlig; erst mal besorgt werden.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wie immer machen nat&uuml;rlich die ungez&auml;hlten Versionen des
picture.datatype so ihre eigenen Sachen. Ich habe hier Picasso96 auf einer
PicassoII laufen und da ist es mir nicht gelungen, das sch&ouml;ne Bild von
Imladris als Scalos-Hintergrund anzeigen zu lassen. Es sind zwar &uuml;ber
1MB im IFF-Format, aber mit der Workbench geht das. Naja, ist eigentlich
nicht so wichtig, denn nehme ich eben was Kleineres, wie ein sch&ouml;nes
Amiga-Background-GIF; so erscheint das dann auch erfreulich schnell auf
meinem 030er mit 40MHz.<BR>

<BR>Sch&ouml;n auch der entsprechende neue Voreinsteller zu den
Hintergrundbildern, analog dem Original <TT>Scalos Pattern</TT> benannt,
der auch die originalen Preferences ersetzen sollte, wobei lt. Doku in
WBPattern auch kein Bild eingestellt werden soll. In diesem neuen
Voreinsteller kann man nun unz&auml;hlige Bilder und Hintergr&uuml;nde
ausw&auml;hlen und jedem Nummern zuordnen. Mehrere Bilder k&ouml;nnen auch
gleiche Nummern bekommen. Dem Screen, der Workbench-Oberfl&auml;che und den
Fenstern in Icon- oder Textmodus werden nun auch jeweils eine Zahl
zugeordnet, die angibt, welcher Hintergrund wo angezeigt werden soll. Gibt
es nun mehrere Bilder mit gleicher Nummer, wird zuf&auml;llig
ausgew&auml;hlt, was wann wo erscheint. Die Darstellung kann nun nicht nur
einfach zentriert oder gekachelt, wie in der Original-Workbench, erfolgen,
sondern auch auf volle Screen-Gr&ouml;&szlig;e skaliert werden. Daf&uuml;r
k&ouml;nnen eigene Routinen oder die von GUIGfx eingesetzt werden. Was
vielleicht noch ganz interessant w&auml;re, w&auml;re ein zyklisches und
nicht nur zuf&auml;lliges Durchwechseln der Hintergrundbilder...<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#11"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Palette des Scalos-Screens wird durch <TT>Scalos Palette</TT> als
Ersatz f&uuml;r das originale <TT>Palette</TT> eingestellt. In der
Grundkonfiguration bleiben die ganzen Vielfarben-Icons in ihrer
Falschfarbendarstellung, wie man sie von einer Standard-WB her kennt.
Importiert man aber die Farben aus einer laufenden Workbench, in der durch
entsprechende Patches oder &auml;hnliches die Farben angepa&szlig;t wurden,
so werden auch unter Scalos die Farben passend und ansprechend dargestellt,
soda&szlig; der Unterschiede in &auml;sthetischer Richtung keine mehr
w&auml;ren.<BR>

<BR>Eines w&auml;re vielleicht noch zu erw&auml;hnen, abgesehen davon,
da&szlig; man sich diesen Workbench-Ersatz, den man mit dem Original in
Bezug auf die Funktionsvielfalt eigentlich gar nicht mehr vergleichen kann,
nicht entgehen lassen sollte, da&szlig; bei mit dem Lasso eingefangenen und
somit aktivierten Icons das Kontextmen&uuml; (sprich fixieren der Position
oder gar l&ouml;schen, etc.) immer nur auf das gerade aktuelle Icon wirkt
und nicht auf die anderen noch aktivierten. Das kann man nun als Feature
sehen, ich finde es aber unlogisch. In den Preferences zur popup.library
habe ich allerdings auch nichts gefunden, wo dieses Verhalten zu
&auml;ndern w&auml;re.<BR>

<BR><CENTER><A NAME="11" HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Alles in allem habe ich nun eine Workbench, die keine ist, aber so tut
und noch dazu viel mehr kann. Ich bin's zufrieden und kann Scalos nur guten
Gewissens weiterempfehlen.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00C4.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://at.aminet.net/pub/aminet/util/wb/Scalos11.lha">Scalos</A> - derzeit im Aminet<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://at.aminet.net/pub/aminet/util/libs/pmuser.lha">Popup Men&uuml;s</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00C3.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C5.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
