<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0A - Diskarchive</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00C7.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00C6.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C8.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="../images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00C6.html">TCP/IP (Teil 4): LAN</A> | <A HREF="0x00C7.html">Diskarchive</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00BF.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00C0.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00C1.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00C2.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00C3.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00C4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00C6.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00C8.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00C9.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00CA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00CB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Diskarchive - ADF, ADZ</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">(Workshop, Teil 1)</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Diskarchive, wie sie sein sollen</B></H3>&nbsp;

<BR>Die Idee, die hinter Diskarchiven steckt, ist einfach: Man fa&szlig;t
eine ganze Diskette zu einer Datei zusammen. Das ist erstens sinnvoll
f&uuml;r Backup-Zwecke, weil Harddisk und Streamer-Tapes wesentlich
zuverl&auml;ssiger sind. Weiters sind in letzter Zeit Diskarchive f&uuml;r
Amiga unter anderen Systemen beliebt geworden, und mancheiner von uns
Veteranen will bei dem gesteigerten Datenaufkommen mitnaschen.<BR>

<BR>Die ansprechenste Implementierung eines Diskarchiv-Programms findet
sich wahrscheinlich bei Gevatter Macintosh. Dort gibt es
<TT>MountImage</TT>, auf das man einfach eine Diskarchiv-Datei
&quot;fallen&quot; l&auml;&szlig;t, und - schwupps - findet man schon die
zugeh&ouml;rige Disk auf dem Finder (dem Apfel-&Auml;quivalent zu unserer
Workbench).<BR>

<BR>So sch&ouml;n praktisch geht es bei uns leider nicht zu. Also ist es
Zeit f&uuml;r einen Workshop.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Diskarchive f&uuml;r unsereins</B></H3>&nbsp;

<BR>Diskarchive haben am Amiga eine lange Tradition. Schon bevor LHA als
<B>das</B> Archiv-Tool etabliert war, kurvten bereits massig DMS-Archive in
der Gegend herum. Mit diesen werden wir uns im zweiten Teil
besch&auml;ftigen.<BR>

<BR>Sp&auml;ter kam FMS dazu, das aber einen etwas anderen Weg geht:
FMS-Archive lassen sich nicht nur auf Disketten extrahieren, sondern gleich
direkt auf der Workbench mounten. Aus verschiedenen Gr&uuml;nden wurde FMS
aber nie wirklich popul&auml;r, obwohl es unbestritten praktisch ist. Auch
das wird im zweiten Teil behandelt.<BR>

<BR>Heute findet man meistens ADF und ADZ Archive. Deren Existenz verdanken
wir der Popularit&auml;t der diversen Amiga-Emulatoren. Sie sind der
Mittelpunkt unseres Interesses im ersten Teil.<BR>

<BR>Teil drei fa&szlig;t das Wissen der ersten beiden Teile zusammen, um
uns den elendigen CLI und das Usability-Desaster rund um die diversen
Programme zu ersparen. Ziel ist es nat&uuml;rlich, das Extrahieren und
Mounten auf einen Doppelklick zu reduzieren, damit der Apfel-Mann zumindest
nicht mehr &uuml;ber uns l&auml;stern kann.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Diskarchive according to Unix-Mann</B></H3>&nbsp;

<BR>ADF steht kurz f&uuml;r &quot;Amiga Disk File&quot; und wurde mehr oder
weniger &quot;erfunden&quot; von Bernd Schmidt, dem Programmierer von UAE.
Wirkliches Know-how steckt aber eigentlich nicht darin, den ADFs sind
einfach alle Daten der Disk zu einer langen Wurscht aneinandergereiht.
Solche Dateien sind an der Endung &quot;.adf&quot; zu erkennen und haben
&uuml;blicherweise die L&auml;nge von 901120 Bytes (= 880*1024 Bytes =
880K). Dies entspricht der Standardkapazit&auml;t von Amiga-Disketten.<BR>

<BR>ADFs sind also nur eine nackte Kopie aller Tracks und Sektoren der
Diskette. Es werden keine Vorraussetzungen bzgl. Filesystem gemacht. In
weniger Techno-Blabla bedeutet das: Die einzelnen Dateien, die im ADF
enthalten sind, sind nicht einfach aufzulisten wie z.B. bei LHA und ZIP,
weil nichts &uuml;ber die Directory-Struktur bekannt ist oder vorausgesetzt
wird.<BR>

<BR>Dies ist im Zusammenhang mit UAE durchaus sinnvoll. Hier ist es
wichtig, auch Zugriff auf Programme zu erlauben, die ein eigenes Filesystem
anstatt einen der Standards verwenden. Gr&uuml;nde daf&uuml;r gab es
(zumindest in den Augen mancher Programmierer) fr&uuml;her einige: damit
lie&szlig;en sich schnellere (aber meist fehleranf&auml;lligere) Zugriffe,
einfache (und trivial zu &uuml;berwindende) Kopiersch&uuml;tze und ein paar
(aus heutiger Sicht belanglose) Optimierungen implementieren. Der Nutzen
hielt sich in Grenzen und der Haupteffekt waren meistens
Kompatibilit&auml;tsprobleme. Aber genug der dunklen Vergangenheit.<BR>

<BR>Diese ADFs werden von den Emulatoren &quot;als Disk&quot; angesprochen,
und der Programmierer des Emulators mu&szlig; keine eigenen
Zugriffsroutinen schreiben. Stattdessen kann er direkt die Routinen des
emulierten Amigas drauf hetzen. Das hebt die Kompabilit&auml;t des
Emulators enorm, weil sich damit viele Inkompabilit&auml;ten emulieren
lassen.<BR>

<BR>Aus Gr&uuml;nden des allgemeinen Am&uuml;sements beschreiben wir mal
kurz das originale <TT>transdisk</TT>, das mit UAE ausgeliefert wird, um
ADFs zu erzeugen: Um z.B. eine Disk in DF1: in ein <TT>sepp.adf</TT> zu
konvertieren, gibt man &quot;einfach&quot; ein:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>transdisk &gt;sepp.adf -d trackdisk 1</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Und will man das <TT>sepp.adf</TT> wieder auf DF1: schreiben, braucht
man &quot;nur&quot; zu sagen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>transdisk -w sepp.adf -d trackdisk 1</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Unn&ouml;tig zu erw&auml;hnen, das <TT>transdisk</TT> keine wie auch
immer geartete Fehlerbehandlung macht und man bei unvorsichtig angegebenen
Parametern auch die ersten paar Sektoren der eigenen Harddisk
&uuml;berschreiben kann.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>ADZ - ADF komprimiert</B></H3>&nbsp;

<BR>Was f&uuml;r einen Emulatorprogrammierer praktisch ist, mu&szlig; nicht
unbedingt angenehm sein f&uuml;r den Anwender. Im Falle von ADF ist das
Problem die Gr&ouml;&szlig;e: 880K sind auch heutzutage eine nicht ganz
untriviale Gr&ouml;&szlig;e, vor allem wenn man sie aus dem Internet laden
mu&szlig;.<BR>

<BR>Technisch ist die L&ouml;sung nat&uuml;rlich trivial: komprimieren
konnten wir schon am C64 halbwegs effizient. Die Frage war dann eher,
welchen der mannigfaltigen Komprimieralgorithmen man verwendet. Weil bei
ADF (zumindest am Anfang) die Unix-M&auml;nner das Sagen hatten, wurde
<TT>gzip</TT> gew&auml;hlt. Das pa&szlig;te am ehesten zu ihrer
Freiheit/Einheit/Br&uuml;derlichkeit/Hurra-wir-haben-den-Quellcode
Mentalit&auml;t. Rein technisch ist es nicht nennenswert besser oder
schlechter als die meisten anderen g&auml;ngigen Komprimierer. Die ADFs
werden jedenfalls kleiner, und das ist es, was das Volk will.<BR>

<BR>Findet man daher irgendwo ein <TT>sepp.adz</TT>, so k&ouml;nnte man
folgenderma&szlig;en ein <TT>sepp.adf</TT> daraus machen:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>gzip -d sepp.adz</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Das kryptische <TT>-d</TT> k&ouml;nnte man sich als
&quot;decompress&quot; merken, wenn man sich sich &uuml;ber gzip irgendwas
merken wollte.<BR>

<BR>Denn es gibt zwar diverse Amiga-Version von <TT>gzip</TT>, die werden
hier aber nicht n&auml;her beschrieben, weil es den Workshop sprengen
w&uuml;rde. Wer mit ein bi&szlig;chen guten Willen und Freude am
Experimentieren und Rebooten im Aminet sucht, der wird in einer der
mannigfaltigen Portierungen schon eine finden, die nicht ma&szlig;los viel
Stack braucht, halbwegs aktuell ist und sogar ohne spezielle
Preferences-Programme und Libraries Amiga-Pfade verarbeiten kann.<BR>

<BR>Will man umgekehrt aus dem <TT>sepp.adf</TT> ein <TT>sepp.adz</TT>
machen, so wird es etwas komplizierter:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>gzip sepp.adf</TT> ; liefert <TT>sepp.adf.gz</TT><BR> <TT>rename
sepp.adf.gz sepp.adz</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Eine Eigenschaft von <TT>gzip</TT> ist n&auml;mlich, da&szlig; es nach
dem komprimieren immer die Endung &quot;.gz&quot; an den Dateinamen
dranh&auml;ngt.<BR>

<BR>&quot;Buhuu, das k&ouml;nnt ihr doch nicht machen!&quot; haben da
nat&uuml;rlich sofort die PC-M&auml;nner geschrieen. &quot;Warum nicht, ihr
habt's jetzt doch auch so tolle lange Filenamen wie wir?&quot; fragten die
Unix-M&auml;nner zur&uuml;ck. Da kam die Antwort: &quot;Nicht wirklich, die
funktionieren n&auml;mlich nur die halbe Zeit, und vor allem in Netzwerken
geht da schon mal was verloren im Namen.&quot; Also nix
&quot;.adf.gz&quot;, sondern per Definition &quot;.adz&quot;.<BR>

<BR>Soll uns recht sein, ist in den ersten Teilen des Workshops weniger
Tippaufwand.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Jetzt aber richtig</B></H3>&nbsp;

<BR>Mancheiner fragt sich jetzt wahrscheinlich, warum ich den ganzen
Bl&ouml;dsinn hier erz&auml;hle. Naja, es ist immer lustig, wenn man
wei&szlig;, wie die Dinge passiert sind. Au&szlig;erdem werden so Workshops
l&auml;nger und literarisch wertvoller.<BR>

<BR>Der Hauptgrund ist aber zugegeben: das
&Uuml;berlegenheitsgef&uuml;hl.<BR>

<BR>Denn jetzt kommt endlich der Teil, wo erkl&auml;rt wird, wie wir es
wirklich machen. W&auml;ren das die A-Files, h&auml;tten wir folgenden
Kasten an den Anfang gestellt:<BR>

<BR><TABLE BORDER=0 BGCOLOR="#EEEEEE" CELLPADDING=4 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>T&auml;ter:</TD><TD> Karl J. Ots</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Aktennummer:</TD><TD> 4.0.46</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Quelle:</TD><TD> aminet:disk/misc/TransADF.lha</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Pr&auml;mie:</TD><TD> Freeware</TD></TR>
<TR VALIGN=TOP><TD ALIGN=RIGHT NOWRAP>Anforderungen:</TD><TD> AmigaOS 2.04</TD></TR>
</TABLE>&nbsp;

<BR>Also flux aus dem Aminet geholt und das Archiv extrahiert. Darin findet
sich u.a. ein Guide, der erkl&auml;rt, da&szlig; wir nichts zahlen
m&uuml;ssen, der Quellcode dabei ist und wie immer wir selbst schuld sind,
wenn was kaputt geht. So soll es sein.<BR>

<BR>Weiters finden sich mehrere Varianten des selben Programmes. Wer will,
kann selbst nachlesen, was es damit auf sich hat. Der Rest von uns kann
ziemlich bedenkenlos <TT>TransADF</TT> nach <TT>c:</TT> kopieren und die
anderen beiden Programme wieder l&ouml;schen. So viel zur Installation.<BR>

<BR>Damit man die Beispiele selbst ausprobieren kann, haben wir zu diesem
Workshop ein <TT>sepp.adz</TT> dazugegeben. Das Archiv ist komprimiert
gerade mal 1K gro&szlig; und enth&auml;lt eine Textdatei mit dem Wort
&quot;Sepp&quot;. Wenig sinnvoll, aber zum Herumspielen gut genug.<BR>

<BR>Schnell eine leere Disk nach DF0: und folgendes im CLI eingegeben:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>TransADF Write Drive DF0: File sepp.adz</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Wichtig ist das <TT>Write</TT>. Die Ausgabe sollte etwa
folgenderma&szlig;en sein:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Inflating from sepp.adz to trackdisk.device unit 0 (df0:).
<BR>Starting at track 0, Ending at track 79.
<BR>Input is a GZip file, decompressing.
<BR>Inflated: 1004 ==&gt; 901120
<BR>Done.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR><TT>TransADF</TT> hat also von selbst erkannt, da&szlig; es sich
hierbei um ein komprimiertes <TT>sepp.adf</TT> handelt, und - oh Wunder -
es automatisch w&auml;hrend des Lesens im Speicher dekomprimiert. Unser
originales <TT>sepp.adz</TT> wurde aber nicht ver&auml;ndert, sonder liegt
immer noch klein und schlank auf unserer Platte.<BR>

<BR>H&auml;tten wir statt einem <TT>sepp.adz</TT> ein <TT>sepp.adf</TT>
gehabt, so m&uuml;ssten wir in obigen Aufruf nur den <TT>File</TT>
Parameter &auml;ndern. Alles andere schnallt <TT>TransADF</TT> von selbst.
So soll es sein.<BR>

<BR>Und was, wenn wir eine Disk in DF0: in ein ADF konvertieren wollen?
Dann lassen wir einfach den <TT>Write</TT> Parameter weg:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>TransADF Drive DF0: File sepp.adf</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>H&auml;tten wir gerne ein komprimiertes ADZ, was in fast allen
F&auml;llen sinnvoll ist, h&auml;ngt man einfach den Schalter <TT>GZip</TT>
dran:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>TransADF Drive DF0: File sepp.adz GZip</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Das einzige, was man hier aufpassen mu&szlig;, ist, da&szlig; man
selbst daf&uuml;r verantwortlich ist, da&szlig; der gute <TT>sepp</TT> die
richtige Endung erh&auml;lt. F&uuml;r <TT>TransADF</TT> ist es zwar egal,
weil es sinnvollerweise nicht auf die Endung achtete, sondern auf die
&quot;Kennungssequenz&quot;, die am Anfang der Datei gespeichert ist. Aber
in Zeiten von Dummkonzepten wie MIME und Windows-Dateitypen sollte man im
Sinne des reibungslosen Datenaustauschs daran denken.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Viele ADFs auf einmal</B></H3>&nbsp;

<BR>Oft geh&ouml;ren mehrere ADFs zusammen, wenn z.B. ein Programm aus
mehreren Disketten bestehen. Die werden dann einfach zu einem Archive
zusammengefa&szlig;t. Also so in der Richtung wie LHA.<BR>

<BR>Weil die Hauptzielgruppe von ADFs ja nicht wir Amiga-User sind, wird
dazu das ZIP-Format verwendet. Das ist trotzdem eine angenehme Sache, weil
es f&uuml;r so ziemlich jede Plattform feine Archivier-Programme f&uuml;r
ZIP gibt. Im Unterschied zum bei Unix-M&auml;nner beliebten TGZ (vulgo
&quot;.tar.gz&quot;) funktionieren diese ZIP-Utilities sogar
untereinander.<BR>

<BR>Mehr dar&uuml;ber erfahren kann man auf der <A
HREF="http://www.cdrom.com/pub/infozip/">Info-ZIP Homepage</A>. Die daraus
resultierende Amiga-Version findet man unter <A
HREF="http://at.aminet.net/pub/aminet/util/arc/UnZip.lha">aminet:util/arc/U
nZip.lha</A>.<BR>

<BR>Taucht also irgendwo ein <TT>sepp.zip</TT> auf, kann man folgendes im
CLI eingeben:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>unzip sepp.zip</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>Dann finden sich alle darin enthaltenen Dateien fertig dekomprimiert im
aktuellen Verzeichnis. Wer vorher wissen will, was drin ist, der kann<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT>
<BR><TT>unzip -l sepp.zip</TT><BR>
<BR></TD></TR></TABLE>&nbsp;

<BR>eingeben. Das <TT>-l</TT> kann man sich als Abk&uuml;rzung f&uuml;r
&quot;list contents&quot; vorstellen.<BR>

<BR>Wie &uuml;blich gibt es noch jede Menge anderer CLI-Optionen, die auch
in der Unzip-Dokumentation beschrieben werden. Aber das sollte f&uuml;r
unsere Zwecke reichen.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wie geht's weiter?</B></H3>&nbsp;

<BR>Im n&auml;chsten Teil befassen wir uns mit DMS, einem veralterten und
eher zu vermeidenden Format. Nichtsdestotrotz findet man immer noch Archive
damit. Weiters lernen wir FMS kennen, damit das dahinschneckende DF0: der
Vergangenheit angeh&ouml;rt.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00C7.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0A/sepp.adz">sepp.adz</A> - Kleines Archiv zum Herumspielen<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> TransADF.lha - Entpackt und erzeugt ADF/ADZ-Archive<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> unzip.lha - Entpackt ZIP-Archive<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00C6.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C8.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
