<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0A - K&ouml;ln '98</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00C9.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00C8.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00CA.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00C9.html">K&ouml;ln '98</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00BF.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00C0.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00C1.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00C2.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00C3.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00C4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00C6.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00C8.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00C9.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00CA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00CB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>K&ouml;ln '98 - Goldst&uuml;ckchen im Ramschhaufen</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Nun war es endlich wieder mal die richtige Jahreszeit,
um sich gen&uuml;&szlig;lich dem Bahia und edlen Steaks widmen zu
k&ouml;nnen - &auml;h, nun ja, aber da war doch noch etwas...</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der erste Eindruck in den Messevorhallen war: fein, angenehm viele
Leute. Der zweite Eindruck in der Halle war eher der einer Ramschmesse.
Viel PC-Zeugs, viel Billig-CD-Verk&auml;ufer, viel (Windows-)Spiele, aber
Amiga? Irgendwie nicht sehr herausragend, sah man mal vom gro&szlig;en
Stand von Amiga Inc. in der Mitte der Halle ab.<BR>

<BR>Nach gr&uuml;ndlichem Durchgrasen der Halle in Quer-, L&auml;ngs- und
allen sonstigen m&ouml;glichen Richtungen und Lagen, kam man dann langsam
drauf, da&szlig; nun doch an vertrackten Stellen ganz interessante
Einzelheiten zu finden waren. Nicht finden konnte man allerdings
PPC-Cyberstorms. Keiner der doch einigen H&auml;ndler konnte auf der Messe
diesbez&uuml;gliches verkaufen, da wieder einmal die Phase5-14-Tage
zugeschlagen hatten. Aber &quot;in 14 Tagen&quot; soll es eine n&auml;chste
Lieferung geben...<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>In einigen (auch deutschen) Newsgroups ist es ja schon gestanden: der
Partner von <A HREF="http://www.amiga.com/">Amiga Inc.</A>, der ihnen dabei
&quot;hilft&quot;, das OS5.0 zu bauen, ist <B><A
HREF="http://www.qnx.com">QNX</A></B>, eine kleine Firma, die einen
genialen MikroKernel entworfen hat und bereits erfolgreich vertreibt.<BR>

<BR>Das Besondere an diesem Kernel ist nun nicht nur die fast unbegrenzte
Skalierbarkeit (bis hinunter zu 42KB, das Ganze nat&uuml;rlich in ROMs
brennbar) von Waschmaschinensteuerungen bis hin zu weltweiten
Rechnerverb&uuml;nden zur extensiven Parallelrechner-Ausnutzung, sondern es
ist sehr modular, dadurch einfach erweiterbar und bietet als Grundlage
f&uuml;r die aufgesetzten APIs (wie eben durch Amiga Inc. eines gebaut
werden wird) enorme Funktionsvielfalt.<BR>

<BR>Das bezeichnendste und sicherlich werbewirksamste Feature ist die
M&ouml;glichkeit, nicht nur einzelne Fenster, sondern ganze, laufende(!!)
Tasks inklusive Datenbereich einfach so per Mausklick auf einen anderen
Rechner irgendwo anders im Netz zu verschieben und dort weiterlaufen zu
lassen. Das Programm braucht dazu weder abgebrochen zu werden, noch
irgendwelche vom User durchzuf&uuml;hrende Neuinitialisierungen vornehmen.
Dies wurde eindrucksvoll auf der Pressekonferenz (die dann am Freitag auch
f&uuml;r das &quot;normale&quot; Publikum ge&ouml;ffnet wurde) gezeigt und
es ist damit auch m&ouml;glich, Teile eines Fensters auf einem und andere
Teile auf einem anderen Rechner laufen zu lassen, oder ein Fenster (samt
Inhalt und Funktionsf&auml;higkeit) auf mehreren Rechnern sichtbar zu haben
und von allen gesteuert werden zu k&ouml;nnen, oder einfach eine Anwendung
zu einem anderen zu schieben, der am anderen Ende der Welt sitzt und sich
trotzdem das Gleiche ansieht, etc. pp.<BR>

<BR>Da tun sich gewaltige M&ouml;glichkeiten auf, da daf&uuml;r ja unter
anderem die komplette Netzwerkf&auml;higkeit nicht nur zum OS
dazugeh&ouml;ngt wird (wie es ein herk&ouml;mmlicher TCP-Stack ja tut),
sondern fest darin integriert ist. Peinlich kanns nur werden, wenn man
seine sch&ouml;nen Datatypes auf anderen, schnellen Rechner laufen
l&auml;&szlig;t, sich gem&uuml;tlich(?) diverse &quot;interessante&quot;
Biler anschauen will, und dann die Fenster am falschen Screen aufpoppen,
oder was macht ein Virus in diesem System? Der wei&szlig; dann ja gar
nicht, wo er denn hin soll, wird ja v&ouml;llig verwirrt, der Arme. Ja, ich
sehe schon, da kommen turbulente Zeiten auf uns zu :-))<BR>

<BR>Quasi als Folge dieser Task-Migration-F&auml;higkeiten ergibt sich eine
sehr einfache und transparente M&ouml;glichkeit, ja eigentlich Forderung zu
effektivem Multitasking (und QNX hat ein echtes pr&auml;emptives
Multitasking mit definierten Antwortzeiten (sprich: echtes, hartes
Multitasking) gebaut, dem zus&auml;tzlich per MMU die Schutzfunktionen
beigebracht wurden), Multiprocessing und weiters auch Multicomputing.
F&uuml;r den Benutzer alles eigentlich nicht notwendigerweise sichtbar und
einfach benutzbar. Das auf der Homepage von <A
HREF="http://www.qnx.com/">QNX</A> verf&uuml;gbare Demo f&uuml;r PCs hat da
eine GUI dabei, die als Beispiel dient und in dieser Form nicht f&uuml;r
den neuen Amiga Verwendung finden soll. Jetzt schon findet dieser Kernel
allerdings in den Space Shuttles erfolgreich Verwendung, denn wer will dort
schon &quot;bunte&quot; Systeme???<BR>

<BR>Die Portierung auf andere oder neue Prozessoren ist sehr einfach
m&ouml;glich, da genau darauf auch schon bei der Konzeptionierung
R&uuml;cksicht genommen wurde und so nun schon jetzt eine PPC-Version
existiert.<BR>

<BR>Am Samstag wurden Ausschnitte dieser Pressekonferenz auf der Videowall
am Stand von Amiga gezeigt, moderiert von einem sich in den technischen
Feinheiten badenden Bill McEwen, dem Marketingleiter von Amiga Inc., dem
man richtig ansah, welche Freude ihm die Pr&auml;sentation dieser Features
bereitete.<BR>

<BR>Im ersten Quartal 1999 wird V2 des RealTimeOS von QNX erscheinen,
Codename &quot;Neutrino&quot;, dessen Schutzmechanismen, die per MMU
implementiert sind, nicht nur auf Applikationen und eben
Datenspeicherbereiche wirken, sondern auch hinunter auf Kernelebene. Das
bewirkt, da&szlig; nun auch Treiber, Protokoll-Stacks oder eigene
OS-Erweiterungen aus Fehlerzust&auml;nden geholt werden k&ouml;nnen und das
System wieder stabilisert wird, im Normalfall ohne rebooten zu m&uuml;ssen.
Dadurch werden nat&uuml;rlich die Turn-around-Zeiten beim Compilieren und
somit die gesamten Entwicklungszeiten erheblich verk&uuml;rzt und
vereinfacht. Siehe dazu auch die <A
HREF="http://www.qnx.com/hotnews/pr/oct18_98-neutrino.html">Pressemitteilun
g von QNX</A> dazu.<BR>

<BR>Man darf also wohl gespannt sein, was denn da kommen wird. Ein im IRC
eingespannter Jeff Schindler (direkt vom Amiga-Stand von der Messe mitten
in einer Traube von Leute) sagte dagegen nicht viel und redete, bzw.
vielmehr schrieb, von &quot;will take several months&quot; and &quot;then
months again&quot;. Petro meinte, der Vertrag sei unterschrieben, insofern
kann man nun auch Amiga zugute halten, ihre urspr&uuml;nglichen Aussagen zu
halten: erst dann etwas zu verlautbaren, wenn es denn wirklich feststeht.
Freut mich.<BR>

<BR>Kommt da nun ein System, wie es sich wir Amiga-User es uns
w&uuml;nschen und kann es das, was QNX uns zeigte, so haben wir auf jeden
Fall Tr&uuml;mpfe in der Hand. Welche, das bleibt der lieben Fortuna
vorbehalten ;-)<BR>

<BR>In Bezug auf OS3.5 wurden seitens Amiga keine Aussagen get&auml;tigt,
wahrscheinlich auch, weil eines der neuen (gedruckten) Amiga-Magazine einen
Exklusivartikel zum Update bekommen hatte. Die <I>AmigaFever</I> ist die
buntere der beiden neuen Zeitschriften und die <I>amigaOS</I> erinnert
vielleicht an die gute alte <I>Kickstart</I> (zumindest hatte ich diese
Assoziation), beide bieten da auch interessante, brauchbare Artikel und
somit begr&uuml;ssen wir diese &quot;Neuank&ouml;mmlinge&quot; in der
Amiga-Welt.<BR>

<BR>Das 3.5-Update wird also mit einer angepa&szlig;ten Version von
Picasso96 erscheinen, weiters ein WarpOS von H&amp;P beinhalten, den
entpsrechenden 68K-Emulator dabei haben, ein SoundSystem namens ARTAS (mit
Abw&auml;rtskompatibilit&auml;t zum AHI) besitzen und integrierte
Netzwerkfunktionen vorweisen k&ouml;nnen. Erscheinen soll diese Version im
2. Quartal 1999. Amiga Inc. t&auml;te da gut daran, dies zur CeBit
pr&auml;sentieren zu k&ouml;nnen. Reden tun sie ja davon...<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Am Stand von <B><A
HREF="http://www.villagetronic.com/amiga/">VillageTronic</A></B> traf man
unter anderem auch Klaus Burkert, der ob der obskuren PCI-Slots auf seiner
mitgebrachten Entwickler-PicassoIV wohl gel&ouml;chert wirkte, aber mit
einer MacPicasso am PCI-Slot der PIV die Werbetrommel f&uuml;r die
Voodoo-Zusatzkarte f&uuml;r die PIV r&uuml;hrte. Ergeben sich 500
Vorbestellungen, so wird diese Karte f&uuml;r den Amiga produziert werden,
da ja von einigen Spieleherstellern und Produzenten von Anwendersoftware
(wie w&auml;re es mit einem 3D-Beschleuniger f&uuml;r die
Konstruktionsteile in Renderern? was sagen diverse OpenGL-Clones dazu?
etc.) Anfragen dazu vorliegen. Also Leute: ran an die Tasten und hin zum <A
HREF="http://www.villagetronic.com/amiga/survey.html">VillageTronic Voodoo
Survey</A>, um die Umfrage dazu auszuf&uuml;llen, damit auch am
ClassicAmiga die Entwicklungen ihren Lauf nehmen.<BR>

<BR>Eine davon ist die neue AriadneII, die neu konstruiert nun auf der
Messe erstmals erworben werden konnte. Die Produktion d&uuml;rfte denkbar
knapp angeliefert worden sein, denn die netten Damen am Stand hatten alle
H&auml;nde voll zu tun, die Ariadnes in die Kartons zu verpacken, bevor sie
&uuml;ber die Budel wanderten. Das hat den Vorteil, zusehen zu k&ouml;nnen,
ob wohl auch alles drinnen ist, was denn drinnen sein soll. Was die Karten
k&ouml;nnen, wird die Dezember-Ausgabe der AmigaScene zeigen, in der
Schachtel sind neben Karte, T-St&uuml;ck, Terminator, englischem Handbuch
auch noch zwei Disketten, die neben den &uuml;blichen Treibern das
komplette AmiTCP Genesis enthalten sollen.<BR>

<BR>Auf den neuen Ariadnes gibt es keine zus&auml;tzlichen parallelen Ports
mehr, daf&uuml;r aber sch&ouml;ne Stiftleisten, die dazu verleiten, einen
gewissen Klaus noch mehr zu l&ouml;chern, und so werde ich mir nun die
Weihnachtsfeiertage freihalten, da dann die Spezifikationen f&uuml;r diesen
Zusatzsteckplatz auf der Ariande (der die Signale eines ISA-Busses
f&uuml;hrt) und ebenfalls die Informationen zu diesem PCI-Slot auf der
Picasso IV fertig sein werden. Videosignale auf PCI-Addons k&ouml;nnen
&uuml;ber kurze Kabel von der Paloma bzw. ihren Sockeln geholt werden, also
sind der M&ouml;glichkeiten nur dadurch (vorerst) Grenzen gesetzt,
da&szlig; die PCI-Bridge auf der PIV als einziger BusMaster am PCI-Bus
spielen kann.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Interessant auch der &quot;Stand&quot; von <B><A
HREF="http://www.escena.de/">Escena</A></B>. Dieser beschr&auml;nkte sich
auf ein Viertel dieser Eckst&auml;nde, die am gro&szlig;en Amiga-Stand zu
sehen waren, diese Seite betitelt mit &quot;Dual-G3-Board&quot;. Zu sehen
war nichts, denn die Prototypen sollen erst zwei Wochen nach der Messe
(schauen denn alle von Phase 5 ab ???) kommen, dann mu&szlig; noch getestet
werden und im 1. Quartal 1999 wird es lt. dem Herrn am Stand eine Karte
geben, die in einem Zorro-Slot(!!) den Rechner &uuml;bernimmt, dadurch
schneller sein will/wird als andere eventuelle G3-Karten, da nicht der
langsame Buster die Zorro-Zugriffe bremst. Allerdings handelt man sich
damit einen ganzen Haufen Probleme im Zusammenhang mit Zugriffen auf die
AGA-Chips, Tastaur, Maus, Schittstellen, etc. ein, die mit einem neuen
Buster umgangen werden sollen. Wozu dann aber die Karte auf der
Zorro-Seite?? Entweder habe ich da was nicht ganz kapiert, da die
Laust&auml;rkeaussteuerung des netten Herrns etwas zu wenig aufgedreht war,
oder/und es ist so ein sonderbares Konzept, da&szlig; es sich erst in
puncto Kompatibilit&ouml;t und Brauchbarkeit beweisen wird m&uuml;ssen.<BR>

<BR>Der Preis soll sich ohne Prozessormodul bei 748,- DM bewegen, als
Module sollen Standard-G3-Module von PowerMacs verwendet werden
k&ouml;nnen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Weiters war Turboprint 7 von <B><A
HREF="http://www.irseesoft.com/">Irseesoft</A></B> erh&auml;ltlich, das nun
neben den bekannten sch&ouml;nen Features auch eine Unterst&uuml;tzung
f&uuml;r den mitgelieferten GhostScript besitzt, mit der Ausdrucke von
PostScript- und den beliebten PDF-Dateien nur kein gr&ouml;&szlig;eres
Problem mehr darstellen. F&uuml;r die Verwendung mit den g&auml;ngigen
Textverarbeitungen wurde nun die Unterst&uuml;tzung erweitert und erheblich
beschleunigt. Mit PageStream soll in voller Qualit&auml;t gedruckt werden
k&ouml;nnen. Interessant auch der Grafik-Textmodus, der eine Textdatei in
Grafik umwandelt und so auch nicht textf&auml;hige Drucker
einsatzf&auml;hig macht. Im GraphikPublisher ist ein Zommen eingebaut. Und
nat&uuml;rlcih sind wieder die aktuellen Druckertreiber mitgeliefert.<BR>

<BR>Auch neu die Version 5.5 des Picture Managers. Sie unterst&uuml;tzt nun
erweitert den PPC beim Laden von JPG, PNG und TIFF, bietet das Exportieren
von Thumbnails, ist auf Grafikkarten lauff&auml;hig und auch neue
Graphikformate wurden implementiert.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der Stand von <B><A HREF="http://www.rbm.de/">RBM</A></B> war vielfach
belagert. Nicht nur, da&szlig; dort die neue I/O-Karte namens <I>IOBlix</I>
zu sehen war, dort war auch ein Programm von <B><A
HREF="http://www.amigawares.com/">AmigaWares</A></B> zu bekommen.<BR>

<BR>Die IOBlix ist eine modular erweiterbare Schnittstellenkarte, die je
nach aufgesteckten Modulen mehrere serielle und parallele Schnittstellen in
unterschiedlicher Konfiguration bietet. Die Parallelen sind vollwertige
ECP/EPP-Ports, mit denen sich somit auch ZIP-Drives ohen Hacks betreiben
lassen, die seriellen Ports kann man bis 460KBaud einsetzen. Theoretisch
sollen 1.5MBaud m&ouml;glich sein. Vorgesehen ist ein Platz f&uuml;r ein
AHI-kompatibles Sound-Modul und ein Sana-II-kompatibles Netzwerkmodul, das
es in einer 10MB- und in einer 100MB-Ausf&uuml;hrung geben soll. Weiters
denkt man &uuml;ber ein Interface f&uuml;r 1.44MB-PC-Floppy-Laufwerke
nach.<BR>

<BR>Unter dem Label <B><A
HREF="http://www.amigawares.com/">AmigaWares</A></B> ist eine ganze Menge
an &quot;additionals&quot; zu finden, wie T-Shirts, Pullover, Shirts,
Hosen, Bikinis, Tops, B&auml;lle, Kapperl, etc. Auf der Messe waren unter
anderem T-Shirts zu kaufen, die auf Fruit-of-the-Loom-Leiberln das
Amiga-Logo auf gedruckt oder aufgestickt(!!) haben. Die Qualit&auml;t ist
dabei sehr gut, die gestickte Variante r&uuml;ckseitig hinterlegt, der
Stoff angenehm zu tragen. Alles in allem eine gute Idee. Was da noch fehlt,
sind halt Shorts mit dem &quot;powered by Amiga&quot;-Logo vorne drauf,
oder Bikinis mit zwei gro&szlig;en Boing-B&auml;llen als Textur, oder...
Naja, f&uuml;r die Skeptiker unter Euch gibt es auch ein Video, das wohl
einige Strandnixen mit den ganzen Sachen beim Ballspielen zeigt.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Alles in Allem f&auml;hrt man jedes Jahr im November sowieso nach
K&ouml;ln, ob da nun eine Amiga-Messe stattfindet oder nicht :-)) Das
Ambiente (der Messe) ist halt nicht so ganz das, was man sich unter einer
gediegenen Veranstaltung vorstellt, eher ein freakiges Treffen, das in den
letzten Jahren leider von PCs, Playstations und Billig-Verramschern
unterwandert wurde und dementsprechend leidet diese Veranstaltung. Das tut
aber den diesmal doch sehr interessanten Ver&ouml;ffentlichungen (Hmmm??
waren es derer mehrerer???) keinen Abbruch.<BR>

<BR>Also hei&szlig;t es, sich zu Hause mit ekligen, schlecht zubereiteten
M&ouml;chtegern-Steaks zu deprimieren, auf da&szlig; es n&auml;chstes Jahr
wieder voller Freude auf nach K&ouml;ln gehen kann, mal ganz abgesehen vom
K&ouml;lsch, aber davon reden wir ja nicht...<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00C9.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.qnx.com/">QNX</A> - die mit dem Mikrokernel<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.amiga.com/">Amiga Inc.</A> - die mit den Rechten f&uuml;r's Look&amp;Feel<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.cucug.org/amiga/aminews/1998/981115-cucug.html">CUCUG</A> - die mit den ersten Infos auf ihren Pages<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.villagetronic.com/amiga/">VillageTronic</A> - die mit der neuen Ariadne<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.escena.de/">Escena</A> - die mit der &quot;G3-Prototypenkarte in 14 Tagen&quot;<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.amigawares.com/">AmigaWares</A> - die mit den (herz-)erw&auml;rmenden Leibesumh&uuml;llungen<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.irseesoft.com/">Irseesoft</A> - die mit den sch&ouml;nen Bildern<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.rbm.de/">RBM</A> - die mit den vielen kleinen Zusammenbastel-&quot;IObelixen&quot;<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00C8.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00CA.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
