<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0A - The Digital Universe V1.03</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00C5.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00C4.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C6.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00C4.html">Scalos</A> | <A HREF="0x00C5.html">The Digital Universe V1.03</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00BF.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00C0.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00C1.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00C2.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00C3.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00C4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00C6.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00C8.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00C9.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00CA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00CB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>The Digital Universe V1.03</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Astronomie hat mich schon immer sehr interessiert und
fasziniert. Leider habe ich mich trotzdem nie als Amateur-Astronom
bet&auml;tigt, was ich mittlerweile ebenso bedaure wie das Faktum,
da&szlig; ich zus&auml;tzlich zur Technischen Physik die Astronomie
eigentlich 2 Semester lang fast v&ouml;llig umsonst inskribiert habe.
Alles, was ich davon hatte, waren ein paar vereinzelt besuchte
Vorlesungsstunden und ein Haufen kopierter Skripten. Und mein Wissen? Das
ist immer noch peinlich beschr&auml;nkt.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber das wird sich jetzt &auml;ndern! Denn ich halte ein geniales
Testobjekt in meinen H&auml;nden. Genauer gesagt h&auml;lt es das CD-LW in
seinen motorischen F&auml;ngen. Aber selbst das ist im Moment nicht mehr
der Fall, denn das Teil, von dem ich spreche, l&auml;&szlig;t sich voll und
ganz auf Platte installieren und verbraucht vielleicht 17 MB. Es kommt ohne
multimedialen Schnickschnack daher, der zwar meist recht nett und
eindrucksvoll ist, aber andererseits oft multilinguale Fl&uuml;che
provoziert. Wozu braucht der Wissenschafter, den die Materie interessiert,
hundert Zwischenanimationen, die sich vielleicht nicht mal abk&uuml;rzen
lassen und noch dazu eine reine Platteninstallation genial verhindern (oder
wenigstens erschweren)?<BR>

<BR>Womit ich das Programm <B>&quot;The Digital Universe&quot;</B> von den
Kanadiern von <I>&quot;SYZYGY Research &amp; Technology Ltd.&quot;</I>
gleich zu Beginn mal kr&auml;ftig gegen alle potentiellen Unk-Zwischenrufe
verteidigt habe. In der Tat kommt das Astronomie-Tool, mit dem man
haupts&auml;chlich den Nachthimmel gefinkelt erforschen und sich auch durch
haufenweise Infos zur gesamten Materie weiterbilden kann, ohne jeglichen
Schnickschnack aus. Zu Beginn ein eher schlichtes &quot;Intro&quot;, das
eigentlich nur mit typischen About-Infos und Credits aufwartet. Im Programm
selber herrscht Stille, also keine Musik und keine FX, bis auf ein paar
historische Samples wie z.B. von der Mondlandung, wenn Armstrong beim
ersten Aufsetzen seiner F&uuml;&szlig;e auf dem Erdtrabanten seine
ber&uuml;hmten Worte lallt. Also grunds&auml;tzlich Mimimalismus zum Zwecke
der Konzentration auf das, was den Forscher eigentlich interessiert.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Vor mir der Nachthimmel. Viel Schwarz, ein paar Sterne als Punkte sind
zu sehen. Klickt man in eine Region, an der Objekte zu sehen sind,
&ouml;ffnet sich ein Informationsfenster mit so ziemlich allen relevanten
und verf&uuml;gbaren Informationen. Die bekanntesten Dinger bieten dann
noch zus&auml;tzliche Infos in einer Art Amiga-Guide-Format mit vielen
Querverbindungen, immer wenn relevante Stichworte auftreten. Ich habe da
mal ein bisserl in den Infos &quot;herumgesurft&quot; und zu meinem
Leidwesen festgestellt, da&szlig; es zwar ein paar nette Bildchen gibt,
aber keine vom Marsgesicht. Als ob es die Fotos nie gegeben h&auml;tte.
Grummel! Wollen uns wohl den Spa&szlig; an Spekulationen und Theorien
verderben. Naja, egal. Ungleich faszinierender ist das Faktum, da&szlig;
man so ziemlich alles einstellen kann, was irgendeinen Einflu&szlig; auf
das Bild haben k&ouml;nnte.<BR>

<BR><CENTER><A HREF="../images_0A/sternenhimmel.gif"><IMG WIDTH=320 HEIGHT=256 ALT="[Sternenhimmel]" SRC="../images_0A/sternenhimmeltn.gif"></A></CENTER>&nbsp;

<BR>Zun&auml;chst der Standort. Wir haben sogar Wels, Steyr, St.P&ouml;lten
zur Auswahl - aber ich entscheide mich nat&uuml;rlich f&uuml;r Graz. Ein
Kreis am Himmel markiert den von Graz aus sichtbaren Ausschnitt. Als
n&auml;chstes stelle ich alle Breiten- und L&auml;ngenkreise ein,
Deep-Sky-Objekte, den von der Erde geworfenen Schattenbereich und
wei&szlig; der liebe Gott was noch alles. Siehe da, der Himmel wimmelt
pl&ouml;tzlich von Dingern! Man kann sogar spezielle einzelne Objekte
(Kometen, ...) anzeigen lassen, nach ihnen suchen, oder sich aussuchen, bis
zu welchen Gr&ouml;&szlig;enordnungen Objekte angezeigt werden sollen.
Beeindruckend. Nat&uuml;rlich kann man nach Herzenslust herumzoomen und hat
pl&ouml;tzlich Planeten samt Monden im Visier. Die tragen dann auf Wunsch
nette Texturen, die ewig lang Pixel f&uuml;r Pixel berechnet werden, aber
dennoch immer gleich aussehen (war zumindest beim Mars der Fall).
Vielleicht fiel ich aber auch nur meiner Unwissenheit zum Opfer. Ich werde
das noch genauer erforschen!<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<A HREF="../images_0A/prefs_1.gif"><IMG WIDTH=320 HEIGHT=256 ALT="[Options]" SRC="../images_0A/prefs_1tn.gif" ALIGN=RIGHT HSPACE=15 VSPACE=15 BORDER=0></A>

<BR>Nun zur Berechnung des Nachthimmels. Auf meiner 68030/50er Blizzard (am
1200er) braucht so ein normaler Ausschnitt doch 5-10 Sekunden, je nach
Detailstufe. Es kann auch eine Minute draus werden, wenn ich wie ein Irrer
alle bekannten Sternchen, Objekte und sonstigen bunten Details auf dem
Screen haben will. Ein automatisches Time Advancement (Schritte beliebig
w&auml;hlbar, auch Sekunden!) ist also leider nicht so toll. Manuell gehts
aber auch. Ich habe mir mal in den Readme-Files angesehen, was so alles zur
Berechnung verwendet wird. Da sind die neuesten Algorithmen am Werk, und
auch noch so kleine Bugs, die ein paar Sekunden Fehler bewirken, wurden
(soweit entdeckt) ausgemerzt. Die Berechnungen werden bis in den
Sub-Bogensekunden-Bereich durchgef&uuml;hrt. Die Liebe zum Detail ist also
genau dort vorhanden, wo man sie braucht! Da kann man schon verschmerzen,
da&szlig; graphischer Schnickschnack fehlt. Wir wollen ja kein
Pseudoprodukt. Ein paar Bugs sind mir aber doch aufgefallen: beim manuellen
Time Advancement malt er manchmal einfach das neue Bild &uuml;ber das alte
(k&ouml;nnt aber fast Absicht sein: man sieht die Bewegung vom Mars viel
besser, und per Redraw kommt dann eh das aktuelle Bild ;-)), und manchmal
beim &Ouml;ffnen und Schlie&szlig;en eines Preferences-Fensters (derer gibt
es viele! <b>lechz</b>) wird das Bild unn&ouml;tigerweise neu berechnet,
aber eben nicht immer. Naja, Bugs sind dazu da, da&szlig; man sie
vernichtet. An solchen Kleinigkeiten solls nicht scheitern!<BR>

<BR>Man sollte vielleicht noch anmerken, da&szlig; die Informationen zum
Teil nicht am neuestens Stand sind: zum Beispiel fehlen Details und
Ergebnisse &uuml;ber die wohl als geplant erw&auml;hnten
Mars-Global-Surveyor- bzw. -Pathfinder-Missionen. Aber da werden uns doch
hoffentlich noch Updates beschert werden (kann ja nicht so schwer sein).
Notfalls holt man sich die Infos dazu halt aus dem Netz, denn wo ein Wille
ist, ist immer auch ein Weg.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="../images_0A/zoomed.gif"><IMG WIDTH=320 HEIGHT=256 ALT="[Planet Information]" SRC="../images_0A/zoomedtn.gif" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=320>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Planeten lassen sich anzoomen.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Dann seh ich mir auch noch die Encyclopaedia an (oder wie sie auch
immer genannt wird) und durchforste alle Themenkreise, von den alten
Griechen &uuml;ber Kosmologie, Sternenlebenszyklen und schwarze L&ouml;cher
bis zum Stephen Hawking. Es ist alles da. Vielleicht fehlt hier und da ein
kleines bi&szlig;chen, und die reine Info ist im wahrsten Sinne des Wortes
sehr grau, aber was solls. Ich jedenfalls sehe meiner astronomischen
Zukunft nun wieder viel motivierter ins Auge!<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ich habe keine Vergleichsm&ouml;glichkeiten, und <B>&quot;The Digital
Universe&quot;</B> ist das erste solche Produkt, mit dem ich mich
besch&auml;ftige. Aber ich mu&szlig; sagen, es scheint sich zumindest das
Anschauen und Testen durchaus zu lohnen. Also sollten sich alle
Interessenten gleich mal die <A
HREF="http://www.syz.com/">Syzygy-Homepage</A> vornehmen.<BR>

<BR>Das Produkt erscheint wie gesagt auf einer Schillerscheibe, und das zum
Preise von etwa 599 &Ouml;schis (als Euro-Skeptiker verweise ich blo&szlig;
auf den Umrechnungsfaktor von 1 Euro = etwa 14 &ouml;S, hehe). Und
nat&uuml;rlich hat das Ding auch Mindestanforderungen, aber die sind
offensichtlich nicht erw&auml;hnenswert, zumindest konnte ich keine
entdecken. Sagen wir mal so: zum vern&uuml;nftigen Arbeiten braucht man
sowieso ein bisserl Power im Kasten und brauchbare Aufl&ouml;sungen. AGA
ist aber nicht Grundvoraussetzung f&uuml;r das Programm.<BR>

<BR>Au&szlig;erdem bietet Syzygy 90 Tage Garantie auf ihr digitales
Universum. Falls die CD ohne eigenes Verschulden eingehen sollte...<BR>

<BR>Zu guter Letzt noch die Bewertungsbox, beruhend auf purer
Subjektivit&auml;t des Testers, der hier reinste Willk&uuml;r walten
l&auml;&szlig;t! :-)<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=83 HEIGHT=10 ALT="[83]"><IMG SRC="../images/_box_black.gif" WIDTH=17 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="../images/_box_black.gif" WIDTH=9 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=78 HEIGHT=10 ALT="[78]"><IMG SRC="../images/_box_black.gif" WIDTH=22 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=92 HEIGHT=10 ALT="[92]"><IMG SRC="../images/_box_black.gif" WIDTH=8 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=87 HEIGHT=10 ALT="[87]"><IMG SRC="../images/_box_black.gif" WIDTH=13 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00C5.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.syz.com/">Syzygy</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0A/sternenhimmel.gif">Sternenhimmel</A> (GIF; 26K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0A/prefs_1.gif">Options</A> (GIF; 25K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0A/zoomed.gif">Planet Information</A> (GIF; 19K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0A/prefs_2.gif">Report and Anim Options</A> (GIF; 25K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00C4.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C6.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
