<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0A - The Strangers AGA</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00C8.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00C7.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C9.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00C8.html">The Strangers AGA</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00BF.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00C0.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00C1.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00C2.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00C3.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00C4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00C6.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00C8.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00C9.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00CA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00CB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>The Strangers AGA - Es darf gehaut werden!</B></FONT></H1>&nbsp;

<IMG WIDTH=82 HEIGHT=49 SRC="../images/_bsemmel_.gif" ALT="[Betasemmel]" ALIGN=RIGHT HSPACE=15 VSPACE=15>

<BR><FONT SIZE="+1">&quot;Da hast was zum Testen - damit wir endlich mal
eine Betasemmel verteilen k&ouml;nnen!&quot; Mit diesen Worten dr&uuml;ckte
mir mein Bruder und Sklaventreiber eine CD in die Hand, in der Erwartung,
da&szlig; ich fauler Sack mich wieder mal n&uuml;tzlich mache. Doch ich
schreite trotz Suggestion ohne Vorurteil ans Werk: denn hat nicht er selbst
dereinst ein Spiel namens &quot;Hydra&quot; verehrt, nur weil der
legend&auml;re Amiga Joker in einem Test &uuml;ber den Spielwitz gemeint
hatte: &quot;[...] [darum] m&uuml;&szlig;te <I>&quot;Hydra&quot;</I>
eigentlich eher <I>&quot;Hydrant&quot;</I> hei&szlig;en&quot;? (kleine
Anmerkung: der Joker hatte recht! ;-))</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;


<BR>Zwar ist das Design des CD-Covers nicht gerade umwerfend (mit
Wohlwollen und einer sehr schlechten Brille k&ouml;nnte man es eventuell
als &quot;impressionistisch&quot; bezeichnen - oh nein, ich h&ouml;re
schon, wie sich Maler und K&uuml;nstler schreiend im Grabe
&uuml;berschlagen!), aber der R&uuml;ckseite sind ja haufenweise
interessante Fakten zu entnehmen. Mit entsprechendem 4-Spieler-Adapter (am
seriellen Ausgang zu connecten) kann man sich gegenseitig sogar zu sechst
verm&ouml;beln. Umwerfende Animationen, geraytracte Grafiken und
Wahnsinns-Soundeffekte? Optionale Brutalit&auml;ten und
Blutvergie&szlig;en? Hm... klingt doch vielversprechend!<BR>

<BR>Wie bei allen Games von <B>Vulcan</B> findet man auf der CD neben einer
Anleitung in allen Sprachen auch noch einen Haufen Demos. Mein Interesse
gilt jetzt aber einzig und alleine den <B>&quot;The Strangers&quot;</B> und
dem erhofften Spielspa&szlig;. Die Voraussetzungen erf&uuml;lle ich ja
gottseidank: AGA, 2MB Chip Ram, 68020+, Harddisk, 4x-CD-Rom. Ein Teil des
Spiels l&auml;&szlig;t sich auf die Platte installieren. Soweit, so gut -
ein Doppelklick aufs Spiel-Icon, ich lehne mich zur&uuml;ck und knabbere am
virtuellen Popcorn, dazwischen ein paar Z&uuml;ge aus meinem virtuellen
Cola, nat&uuml;rlich per virtuellem Strohhalm. Zumindest hatte ich mir das
so vorgestellt... Das Intro wirkt auf den ersten Blick recht... hm...
interessant. Eine Auto-Verfolgungsjagd aus verschiedensten Perspektiven.
Der Sinn bleibt mir leider vorenthalten, ebenso wie die Action. Ich
mu&szlig; lediglich ans ber&uuml;chtigte und geniale Demo von
&quot;Roadkill&quot; denken, das bot nicht nur Action, Witz und nette
Effekte, sondern auch K&ouml;pferollen. :-) Aber hier? Es passiert
buchst&auml;blich nichts. Nicht au&szlig;ergew&ouml;hnlich toll gerendert,
minimalistische Handlung, wenig Action und die Pointe ist vermutlich wie
bei einem Preisr&auml;tsel versteckt. Die Suche ist mir aber zu
m&uuml;hsam, also vergesse ich das Intro wieder und widme mich dem Spiel
selbst.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Auf der Suche nach dem Spielwitz</B></H3>&nbsp;

<BR>Ich motiviere mich, indem ich an das motivierende &quot;Auf
gehts!&quot; unseres ehemaligem Lateinprofessors denke, mit dem er unserer
Klasse oft den Startschu&szlig; gegeben hatte, um in herrlich diffusem
akustischen Chaos den Hexameter eines gewissen Ovid grausam zu entstellen.
Und ich stelle fest: der Spielwitz liegt einmal ganz bestimmt nicht im
Main-Screen. Weder vom Sound her, noch grafisch gesehen. Wenigstens kann
man eine Menge Sachen einstellen (Spielmodi, Schwierigkeitsgrad, Steuerung,
...). Der gr&ouml;&szlig;te Gewinn liegt wohl in den Varianten: da gibt es
den Trainingsmodus, der anfangs sehr zu empfehlen ist, um mit der
Handhabung einigerma&szlig;en zurechtzukommen. Die Steuerung ist relativ
einfach, woraus sich auch mit Recht schlie&szlig;en l&auml;&szlig;t,
da&szlig; die Schlagauswahl nicht &uuml;berragend ist. Dann kann man
alleine oder zu zweit die Gegner jedes der 8 Levels aus dem Weg
r&auml;umen, inklusive Oberboss nat&uuml;rlich, der ein bi&szlig;chen
tougher ist als die gew&ouml;hnlichen Feinddarsteller. Deathmatch ist die
klingende Bezeichnung f&uuml;r den gnadenlosen jeder-gegen-jeden-Fight mit
bis zu 6 Spielern, was auch f&uuml;r &quot;Gangwars&quot; gilt - hier geht
man allerdings in Teams vor. Tja, was gibt es Sch&ouml;neres, als mit
mehreren Freunden zugleich Spiele zu zocken? Erinnerungen an &quot;alte
Zeiten&quot; werden wach...<BR>

<BR>Der erste Level wird geladen, und ich bekomme die ersten &quot;Full
Speech Intros and Endings With Awesome Animations&quot; sowie &quot;High
Quality Raytraced Level Graphics&quot; zu sehen, nicht zu vergessen die
&quot;Digitally Mastered Screams &amp; Speech&quot; und &quot;Incredibly
Disgusting Blood Fatalities&quot; (gottseidank kann man eine
Passwort-Kindersicherung aktivieren, damit die kleinen St&ouml;pseln nicht
verdorbenen Geistes zu Gewalttaten animiert werden!). Was davon wirklich zu
halten ist, daf&uuml;r suche ich gerade passende Beschreibungen... Sagen
wir zur ersten Phrase mal das Folgende: auf Dauer wird es l&auml;stig,
jedesmal zu Beginn eines Levels ein gerendertes, aber nur
m&auml;&szlig;iges Bild inklusive m&auml;&szlig;igem Soundsample bewundern
zu m&uuml;ssen, und das zehn Sekunden lang. Da seh ich 10x lieber die
Zwischengrafiken von <I>Agony</I> (das Ballerspiel von Psygnosis) an, da
wartet man zwar l&auml;nger, aber wenigstens sind Sound und nat&uuml;rlich
Grafik vom Feinsten. Das finde ich ja &uuml;berhaupt schade: einst zauberte
man noch aus 16 oder 32 Farben meisterhafte Prachtwerke auf den Schirm, und
aus einfachen Samples wurden unverge&szlig;liche Melodien komponiert. Heute
spart keiner mehr, Sound und Grafik fressen massenhaft Speicher weg, man
benutzt mindestens 256 Farben und rendert mit tollen Programmen herum, und
doch kommt man mit alldem meist nicht &uuml;ber ein recht
mittelm&auml;&szlig;iges Niveau hinaus. Zumindest kommt die Einzigartigkeit
allzu leicht abhanden. Aber ich will ja nicht herumsumpern, sondern testen!
Wie schon angedeutet, hei&szlig;t heute &quot;raytraced&quot; noch lange
nicht &quot;gut&quot;, und ebendies l&auml;&szlig;t sich auch auf die
Levelgrafiken anwenden. Sie sind ja nicht schlecht, aber sooo toll wie
beschrieben? Naja. Die digitalen Schreie sind ebenfalls h&ouml;rbar,
l&ouml;sen aber noch lange keine Begeisterungsst&uuml;rme in mir aus. Auch
die Schlagvielfalt ist nicht gar so gewaltig, wie man sich das gerne
vorstellen w&uuml;rde.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Jetzt ist es mal an der Zeit, ein paar positive Aspekte zu vermerken!
In jedem Level (der ist nicht gro&szlig;, scrollt nur ein bi&szlig;chen
nach links und rechts) gibt es einen Obermotz. Zuerst h&auml;lt der sich
eher cool aus der Sache heraus und raucht ein letztes Zigaretterl, aber
wenn es knapp wird, dann bequemt er sich her und qu&auml;lt den Spieler mit
seiner doch etwas gr&ouml;&szlig;eren Z&auml;higkeit und eventuell mit
&Auml;xten, Baseball-Schl&auml;gern oder anderen Waffen. Letztere kann man
nat&uuml;rlich auch selber verwenden, wenn man dazu kommt, sie einem Gegner
ab- und dann selbst aufzunehmen. Auch geworfene F&auml;sser explodieren
recht gern inmitten des Gegners Scharen. Apropos Werfen: das kann man auch
mit Gegnern. Wenn diese nach einigen Schl&auml;gen benommen dastehen, kann
man sie aufheben, ein bi&szlig;chen mit ihnen herumspazieren und sie dann
irgendwo hinschleudern, idealerweise auf ein paar andere Gegner. Aber
zur&uuml;ck zum Obermotz: wer sich diese Brutalit&auml;t in den Optionen
eingestellt hat, kann n&auml;mlich im Falle des Absinkens der eigenen
Energie auf knapp &uuml;ber Null betrachten, wie der Obermotz kommt, coole
Reden schwingt und einem dann den Garaus macht. Je nach Level wird man dann
z.B. in St&uuml;cke geschossen - inklusive Blut nat&uuml;rlich! -, oder der
Boss rei&szlig;t dem wehrlosen Spieler das Herz raus und verspeist es dann
gen&uuml;&szlig;lich unter Anwendung eines Kommentars, dessen sich schon
Bill Clinton bedient hatte, als er mit Zigarren und Praktikantinnen
spielte...<BR>

<BR>Aber all das kann auf Dauer auch keinen gro&szlig;artigen
Spielspa&szlig; herzaubern. Technisch gesehen sind keine Glanzleistungen
vorhanden, an denen man sich weiden k&ouml;nnte, und es fehlt
gro&szlig;teils an innovativen Gags, abgesehen von den bereits
erw&auml;hnten, welche mich aber auch nicht vom Hocker rei&szlig;en. Eine
Menge an Ideen scheint mir eher abgekupfert zu sein, wie zum Beispiel die
Sache mit den Motorradfahrern. Die Mehrspieler-Optionen sind meiner Ansicht
nach der einzige Grund, sich f&uuml;r das Spiel zu interessieren, aber ich
gehe wohl recht in der Annahme, da&szlig; auch daf&uuml;r l&auml;ngst Games
existieren, die dieses hier &uuml;bertreffen k&ouml;nnen. Wer sich selbst
davon &uuml;berzeugen will, der besorge sich einfach die Demoversion, die
auch auf jeder neueren CD von <A HREF="http://www.vulcan.co.uk/">Vulcan</A>
erh&auml;ltlich sein d&uuml;rfte.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Abschlie&szlig;end gilt vielleicht noch, abgesehen von der
tats&auml;chlich etwas schlechteren Wertungsbox (mein Bruder hatte also
recht), noch zu sagen: Das Spiel kostet bei <A
HREF="http://www.pointdesign.com">Point Design</A> nur wenige Schillinge
(Anm. d. Red.: und ist im Bundle mit Uropa2 und <A HREF="0x004E.html">Final
Odyssey</A> sehr g&uuml;nstig dort zu erwerben!). Das Handbuch ist wie
gesagt in diversen Sprachen auf der CD drauf, und die Voraussetzungen habe
ich auch bereits erw&auml;hnt. Tja, schade eigentlich! Ich hatte schon
gehofft, wieder einen Hit testen zu d&uuml;rfen. Leider hat es nicht dazu
gereicht...<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=55 HEIGHT=10 ALT="[55]"><IMG SRC="../images/_box_black.gif" WIDTH=45 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=63 HEIGHT=10 ALT="[63]"><IMG SRC="../images/_box_black.gif" WIDTH=37 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=38 HEIGHT=10 ALT="[38]"><IMG SRC="../images/_box_black.gif" WIDTH=62 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=43 HEIGHT=10 ALT="[43]"><IMG SRC="../images/_box_black.gif" WIDTH=57 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=50 HEIGHT=10 ALT="[50]"><IMG SRC="../images/_box_black.gif" WIDTH=50 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=32 HEIGHT=10 ALT="[32]"><IMG SRC="../images/_box_black.gif" WIDTH=68 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=74 HEIGHT=10 ALT="[74]"><IMG SRC="../images/_box_black.gif" WIDTH=26 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=45 HEIGHT=10 ALT="[45]"><IMG SRC="../images/_box_black.gif" WIDTH=55 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00C8.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.vulcan.co.uk/">Vulcan</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00C7.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00C9.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
