<html>
<head>
<title>Poldi hat etwas zu sagen</title>
</head>
<body background="poldibg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Mediator und Pinnacle-<br>
PCTV-Studio-Pro</b></font></p>

<p>Leider musste ich diese TV-Karte im PC-Laden kaufen, da ich keinen
Amiga-H&auml;ndler fand der diese Karte hat. Diese Karte wollte ich haben,
weil sie Preis- Leistungssieger in der Computerbild 19/2001 war und in der
PC-Games-Hardware den Hardware Award 03/2001, f&uuml;r hervorragende
Leistung, bekam. </p>

<p>Die technichen Daten: <ul>
<li> Video Prozessor: Conexant BT878  </li>
<li> High-Quality TV-Radio-Tuner: Temic (Vollkabeltauglich) </li>
<li> Antenneneing&auml;nge: IEC-Buchsen (Radio u. TV) </li>
<li> Video-Eing&auml;nge: S-Video(Mini-DIN-Buchse), Composite-Video(Chinch-Buchse) </li>
<li> Audio-Ausg&auml;nge: 3,5mm Stereo-Klinkenbuchse(Extern) </li>
<li> Intern: 1.Soundeingang und 1. Soundausgang. </li></ul>

Lieferumfang: <ul>
<li> Die TV-Karte(nat&uuml;rlich),
<li> externes Audiokabel,
<li> Treiber-CD mit Progs. (leider nur f&uuml;r PC),
<li> Dokumentation,
<li> Fernbedienung m. Empf&auml;ngerteil. </li></ul>

Kostenpunkt: 97,95 Eur. oder 191,57 DM. </p>

<p>Kurzer &Uuml;berblick zum Einbau und der Installation der Software: <br>

Nehmt die Karte und steckt sie Euch... oh, das meinte ich jetzt gar nicht,
aber wie eine Karte in einen PCI-Port gesteckt wird, sollte jeder sofort
erkennen, wenn er sich die Sache einmal kurz ansieht :-) Ist die Karte dort
wo sie hingeh&ouml;rt, habt Ihr die Wahl den Sound entweder extern oder
intern anzuschlie&szlig;en, ich rate Euch alles was geht intern
anzuschlie&szlig;en, da der Line-in Anschluss der Soundkarte noch gebraucht
wird, um den Amiga-Sound durchzuschleifen. Also kommt das Kabel an den
Audio-out der TV-Karte und dem Aux Anschluss der Soundkarte. So ein Kabel
ist in der Regel bei jedem CD-ROM-LW dabei, aber Ihr bekommt es auch
f&uuml;r 3,- (1,5 EUR) bei jedem PC-H&auml;ndler. </p>

<p>Dann schlie&szlig;t Ihr noch eine Antenne (Stabantenne oder was
wei&szlig; ich was) an, die Antenne f&uuml;r´s Radio braucht man noch
nicht, da die Radiofunktion noch nicht geht, das dauert wohl noch etwas.
Auch die Fernbedienung k&ouml;nnt Ihr einmotten, erst dachte ich, dass der
Empf&auml;nger an die TV-Karte kommt, aber dem ist nicht so, der
Empf&auml;nger kommt an einen Seriellen Port:-( </p>

<p>Eigentlich war ich der Meinung, dass die TV-Karte mit einem Kabel an die
Grafikkarte angeschlossen wird, zumindest ist der interne Anschluss der
Grafikkarte daf&uuml;r gedacht, aber bei dieser TV-Karte werden die Daten
direkt &uuml;ber die PCI-Ports geschickt! </p>

<p>Nun ist die Software dran: <br>

Legt die MM-CD ein und w&auml;hlt die Installation f&uuml;r die TV-Treiber,
im Installationsscript w&auml;hlt Ihr Eure TV-Karte, dann w&auml;hlt Ihr
PAL-BDGHI und Euren Standort (Rest der Welt) aus, schon sollte alles fertig
sein. Jetzt werdet Ihr eine neue Schublade auf der Systempartition finden,
die hei&szlig;t CHANNEL, in dieser Schublade sind noch zwei weitere
Schubladen mit den ganzen Sendern. Klickt mal alle Sender der Reihe nach
doppelt, um zu testen welche Sender schon gefunden werden. Habt Ihr dann
Sender gefunden, die aber nicht so sauber sind, dann &ouml;ffnet Ihr diese
Datei mit einem Editor und ver&auml;ndert die Zahl, am besten geht Ihr in
Zweierschritten vor, sonst dauert es zu lange. Dann, nach ungef&auml;hr 10
Tagen:-), wenn alles richtig ist, k&ouml;nnt Ihr die Sender umbenennen, das
erh&ouml;ht den Wiedererkennungswert, auch habt Ihr es leichter, wenn Ihr
die Sender mit Hilfe von ToolsDaemon in die Titelleiste integriert. </p>
 
<p>Da irgend etwas nicht zu stimmen scheint, so z.B. geht der Ton nicht,
geht Ihr in die C-Schublade und nehmt Euch das Prog. TV vor, von diesem
Prog. lasst Ihr Euch die Informationen anzeigen und guckt mal wo der
Eintrag namens Audio_Mode=0 ist, diesen &auml;ndert Ihr in Audio_Mode=1,
speichert ab und ruft nochmal ein Tv-Programm auf, hoppla da ist ja auf
einmal ein Ton! Habt Ihr das gesehen? In den Informationen vom TV ist ja
noch Platz, da schreiben wir doch gleich mal was rein! Also, schreibt mal
das Wort "Backdrop" in die 2. Zeile und speichert wieder. Dann ruft Ihr das
Prog. WBPattern auf und stellt den Workbenchhintergrund ab, w&auml;hlt dann
wieder einen TV-Sender aus und schwubdiwub habt Ihr das TV-Bild als
Hintergrund, sehr geil !!! </p>

<p>Jetzt bleibt aber noch ein Problem, wenn das Fernsehfenster geschlossen
wird, ist der Ton weiterhin da. Um diese Erscheinung wieder weg zu
bekommen, m&uuml;sst Ihr die Treiberupdates installieren, nat&uuml;rlich
solltet Ihr immer darauf achten, das neueste Update von Eurer E-Mail
Adresse zu holen, Elbox hat es schon bis zum Update V.1.12 gebracht! Die
letzten beiden Updates gab es innerhalb von einer Woche! </p>

<p>W&auml;hrend ich das hier schreibe, gucke ich in einem kleinen Fenster
die Sendung Beknacktenzeichen XY Einged&ouml;st (Schulfernsehen) an, das
ist echt gut. Sonst hatte ich den Fernseher und noch den Amiga an, jetzt
nur noch ein Ger&auml;t, das spart mal etwas Strom. Oh, was geht bei XY ab,
suchen die etwa mich? Wartet mal... Puuuh, (schwitz) da habe ich nochmal
Gl&uuml;ck gehabt, dauernd das schlechte Gewissen, ich sollte doch
aufh&ouml;ren in der Einbahnstra&szlig;e zu rauchen! </p>

<p>Dass die TV-Karte Stereo hat, habe ich noch nicht geh&ouml;rt, es kann
sein, dass ich es nicht h&ouml;re, weil ich sowieso dauernd &Auml;rger mit
dem Sound habe. Am Anfang war der Ton gleich da und jetzt kommt nur alle 10
- 20 Neustarts ein Sound der laut genug ist. Deshalb denke ich auch dauernd
daran mir ein neues Netzteil zu kaufen, da es daran liegen kann, dass der
Saft nicht reicht! Wenn einer von Euch dasselbe Problem haben sollte, kann
er den externen Soundausgang der TV-Karte in den Mic-Eingang der Soundkarte
stecken und im Mixer den 20db Verst&auml;rker einschalten, dann geht es
einigerma&szlig;en! Ihr k&ouml;nnt auch eine Spielekonsole an die TV-Karte
anschlie&szlig;en, das testete ich mit einem SNES und es geht sehr gut,
alle anderen Konsolen die &uuml;ber den Antenneneingang angeschlossen
werden, m&uuml;ssten auch gehen:-( </p>

<p>Die Belastung vom 68k liegt bei null, selbst wenn ich fernsehe und
nebenbei noch mit AmigaAmp ein Mpg-2 Modul in mono anh&ouml;re, liegt die
Belastung gerade einmal bei 5-10%, das ist sehr gut, da l&auml;&szlig;t
sich in normaler Geschwindigkeit noch ein Schreibprogramm oder ein Spiel
benutzen! </p>

<p>Leider kann ich Euch nicht noch mehr &uuml;ber diese Karte schreiben,
aber wenn Ihr mal Fragen haben solltet, dann stellt sie einfach und Ihr
werdet eine Antwort von mir bekommen. </p>

<p>Macht es gut: &nbsp; &nbsp; &nbsp; Poldi </p>

</td></tr></table>
<br>
</body>
</html>
