<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner - RIP??</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><b>Hi!</B><br>
Sorry, aber diesen Monat wird es keine Ausgabe der Metal Corner geben! Und h&#246;chstwahrscheinlich wird es auch einer der letzten Ausgaben der Metal Corner im letzten Monat - wenn nicht sogar die letzte! - gewesen sein. Allerdings m&#246;chte ich mich nicht so ganz wortlos diesbezgl. von der Bildfl&#228;che verziehen, weswegen wird es an dieser Stelle einige Erklr&#228;ungsversuche geben:</P>

<p>Die Metal Corner ist innerhalb der NC entstanden und war Anfangs auch nur f&#252;r diese gedacht. Auch als das Projekt immer umfangreicher wurde, sah ich keinen Grund dieses wieder einzustellen, denn es war ja alles f&#252;r die NC. Mit der Zeit fanden sich weitere Verwendungszwecke wie etwa die HP meiner Radiosendung, das Aminet sowie weitere Diskmags, was ich prinzipiell f&#252;r recht sinnvoll erachtete. Mit dieser weiten Vertreibung im Netzt stieg allerdings auch der Qualit&#228;tsdruck, wobei ich diesbezgl. kein Feedback erhalten habe. Vor wenigen Monaten erhielt ich dann das Angebot an einem Fanzine namens &quot;The Rock&quot; mitzuarbeiten, welches sowohl Online als auch als Print Version existiert. Neben der Tatsache, dass das Mag wesentlich umfangreicher ist und gerade deswegen mehr Leser erreicht, f&#228;llt vor allem der logistische Aufwand weg. Das w&#228;re noch kein Argument, aber gerade das Layouten in HTML nimmt doch wesentlich mehr Zeit weg als man glauben m&#246;chte. Grob gesch&#228;tzt kostet mich eine Ausgabe der Metal Corner rund 10 Stunden und das sind momentan 10 Stunden, die ich einfach nicht &#252;brig habe. Bei &quot;The Rock&quot; habe ich den ganz entscheidenden Vorteil, dass ich mich vollst&#228;ndig auf das Schreiben konzentrieren kann und mich nicht mehr mit dem ganzen Drumherum besch&#228;ftigen brauche. Wer mal Interesse an dem Mag hat, kann sich unter <a href="http://www.therock-online.de" target="_blank">http://www.therock-online.de</A> einloggen - auch E-Mail Abo`s sind m&#246;glich. Das mag f&#252;r den einen oder anderen vielleicht nur ein schwacher Trost sein, aber ich konnte niemals absch&#228;tzen wieviele Fans die Metal Corner hatte bzw. ob es &#252;berhaupt jemanden so richtig interessiert hat, zumal es mit dem Rock Hard / Hammer / Heavy oder was?!? drei richtig gute Print Mag`s gibt, ganz zu schweigen von der gro&#223;en Online Konkurrenz.</P> 

<p>Diese Entscheidung ist mir beileibe nicht leicht gefallen, aber meine anderen Aktivit&#228;ten (NoCover, Radio, Amiga Plus &amp; The Rock) zwingen mich einfach zu diesem Schritt. Eventuell bringe ich sporadisch nochmal die eine oder andere Ausgabe raus, aber bis zum Sommer wird das wohl eher die Ausnahme bleiben. Sollte sich jemand finden, der richtig Ahnung von HTML hat und die Umsetzung macht, w&#228;re auch wieder eine monatliche Erscheinungsweise m&#246;glich. </P>


<p>Alle, die die Metal Corner im laufe der Jahre unterst&#252;tzt haben und gerne gelesen haben, sei an dieser Stelle gedankt. And remember: Stay heavy!</P>



<center><p><i>&quot;And every prayer we pray at night has somehow lost his meaning&quot;</I><br> 
(Taken from Dead Winter Dead / Savatage)</Center>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
