<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="mm_schweissfuss.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</p>

<p align=center><font color="#000080"
size="7"><b>www.schweissfuss.de</b></font></p>

<p><img src="mm_schweissfuss.gif" width=320 heigth=240 alt="" align=left
hspace=6>Schweissfuss.de ist ein Funsportmagazin im Internet, das &uuml;ber
au&szlig;ergew&ouml;hnliche Sportveranstaltungen und Trends berichtet. Im
Impressum steht:

<blockquote><i>Alle Texte und Fotos sind urheberrechtlich gesch&uuml;tzt.
Vervielf&auml;ltigungen jeglicher Art sind nur mit schriftlicher
Genehmigung des jeweiligen Copyright-Inhabers gestattet. </i> </blockquote>

Bei Interesse an der Verwendung von Text- oder Bildmaterial oder wenn
jemand mehr &uuml;ber die Ersteller und deren Arbeit wissen will, setzt
sich mit: <br> <b>J&uuml;rgen Frey </b><a href="mailto:webmaster@schweissfuss.de">webmaster@schweissfuss.de</a><br> in
Verbindung. <br clear=all></p>

<p>Der Titel dieser Website lautet: Freizeit und Trendsport, Abenteuer und
Funsport. Und da ist nichts zu wenig versprochen. Dieses Freizeit- und
Trendsportmagazin pr&auml;sentiert t&auml;glich die neuesten und
verr&uuml;cktesten Trends aus der weiten und unentdeckten Welt des Sports.
Und getreu dem Motto der Betreiber der Website &raquo;Sport zum selber
schwitzen&laquo; solltet ihr die hier vorgestellten Funsportarten und
Freizeitbesch&auml;ftigungen auch ruhig einmal selber ausprobieren und
dabei m&auml;chtig Schweissperlen vergie&szlig;en. </p>

<p>Ganz egal, ob freizeits&uuml;chtiger Funsportler oder abenteuerlustiger
Extremfreak, hier ist f&uuml;r jeden was im Angebot. Also nix wie raus in
die verr&uuml;ckte Sportwelt. Die Seite ist folgenderma&szlig;en aufgebaut
und eingeteilt: Entweder links &uuml;ber die Menueleiste oder &uuml;ber die
vielen sch&ouml;nen Bildchen im Hauptfenster. </p>

<p>Die Menueleiste ist aufgebaut in:
<dl>
<dt><b>Aktuelle Termine</b></dt>
<dd>Trends und Funsport, Adrenalin&nbsp;&amp;&nbsp;Action,
Extremsport, Wintersport</dd><br>

<dt><b>Hobby &amp; Freizeit</b></dt>
<dd>Laufen&nbsp;&amp;&nbsp;Marathon, Fitnesswelt, Hobby und Freizeit,
Denksportaufgaben, Sport und Reisen</dd><br>

<dt><b>Entertainment Zone</b></dt>
<dd>Movie Sports World, PC Games Check, Spieleabend, Playstation
Action</dd>
</dl>

und das Hauptfenster:
<dl>
<dt><b>Die neuesten Themen vom 21.01.2002 lauteten: </b></dt>
<dd>DM im Wasserrutschen, Rennfahrerschule, Australian Cattle Drive 
und als Buchtitel: Warum M&auml;nner nicht zuh&ouml;ren und Frauen schlecht
einparken. </dd> <br>

<dt><b>Der Winter steht vor der T&uuml;r ...</b></dt>
<dd>Snowgolf, Snowbike, Snowfer </dd> <br>

<dt><b>... aber auch drinnen geht's hei&szlig; her</b></dt>
<dd>Cheerobics, Gyrotwister, Core Board </dd> <br>

<dt><b>Immer festen Boden unter den F&uuml;ssen ...</b></dt>
<dd>Bobby Car, Zorbing, Mountainboard</dd> <br>

<dt><b>Mit h&uuml;bscher Bademode hinein ins k&uuml;hle Nass ...</b></dt>
<dd>Watertown 2002, Wasserrutschen, Aqua Power</dd> <br>

<dt><b>Die Freiheit der L&uuml;fte sp&uuml;ren ...</b></dt>
<dd>Fly by wire, Sky Diving, Power Skip</dd>
</dl>

Und wem dieses noch nicht reicht, hat nun die M&ouml;glichkeit:
<dl>
<dt><b>Sport und Action auf der Playstation 2 ...</b></dt>
<dd>PE Soccer, Smugglers Run 2, SSX</dd> <br>

<dt><b>Action, Strategie und Sport auf dem PC ...</b></dt>
<dd>Madden 2002, Wiggles, Carrera Grand Prix</dd>
</dl>
</p>

<p>Gleich die erste Sportart klingt ganz sch&ouml;n verr&uuml;ckt:
<b>Snowgolf</b>. Also habe ich mir dies mal angeschaut. Gefragt habe ich
nicht, ob ich diese Seite hier abdrucken darf, aber ich kann mir nicht
vorstellen, dass der Betreiber von www.schweissfuss.de etwas dagegen hat,
da ich den Text und die Bilder nicht ver&auml;ndere. Nur den Font habe
angeglichen und die CSS-Steuerung unterdr&uuml;ckt. <table border=0
width=100% bgcolor="#FF9900" cellspacing=0 cellpadding=0> <tr><td>

<p><font size="3" color="navy"><b>Fliegende B&auml;lle im wei&szlig;en
Schnee</b></font><br>

<font size="1"><b>Alle Bilder zum Beitrag mit freundlicher Genehmigung von
Graub&uuml;nden Ferien.</b></font></p>


<p>Hinaus in die bl&uuml;hende Natur und mit einem einzigen kr&auml;ftigen
und gezielten Schlag gleich das Gr&uuml;n erreichen. Das h&ouml;rt sich auf
Anhieb doch recht gut an f&uuml;r jeden Golfer, doch warum muss das
Gr&uuml;n eigentlich immer gr&uuml;n sein?</p> <p>Muss es eben nicht.
Bislang lagen im Winter die sorgsam und bis ins Detail gepflegten
gr&uuml;nen Golferwiesen wie im Winterschlaf unbenutzt unter dem
wei&szlig;en Schutzmantel. Doch jetzt ist es vorbei mit der Ruhe, selbst
der Winter kann die verr&uuml;ckten Golfer nicht mehr stoppen: Snow Golfing
ist angesagt.</p>

<p><img src="mm_schweissfuss2.jpg" width="255" height="135" border="0"
alt="" align=left hspace=6>Mit roter Farbe werden die wei&szlig;en
B&auml;lle schneetauglich gemacht, warme Kleidung und Handschuhe sollen die
etwas geringeren Temperaturen wie im Sommer ausgleichen. </p>

<p>Ansonsten k&ouml;nnen nahezu alle Golf-typischen Vorz&uuml;ge auch in
winterlicher Atmosph&auml;re genutzt werden: Spazieren gehen, frische Luft
atmen und drau&szlig;en im Gr&uuml;nen (pardon, im Wei&szlig;en) sein.</p>

<p>Damit der Ball auf dem weichen Untergrund besser rollt, wird der Schnee
zuvor gro&szlig;fl&auml;chig gewalzt. Der Abschlag erfolgt wie beim
Rasengolf von einem Tee. Immer lustig und nach jedem Schlag erforderlich
ist die Ballsuche, die sich aber recht einfach gestaltet. Selbst wenn der
Ball im Tiefschnee landet, verr&auml;t ein tiefes Einschlagsloch dessen
Position... na ja, immer noch besser als im sommerlichen Wassergraben. </p>

<p>Zugegeben, Golfen im wei&szlig;en Schnee ist schon etwas
gew&ouml;hnungsbed&uuml;rftig und mancher Fundamentalist wird die Nase
r&uuml;mpfen, aber es ist dennoch echtes Golf und wird nach den gleichen
Regeln wie im Sommer gespielt. Und rein technisch gesehen ist der Schlag
aus einem Schneeloch um einiges schwieriger als von einer ordentlich
gepflegten Golferwiese. Trotzdem sollte man Wintergolf eher als Funsport
sehen und das Ganze nicht allzu ernst nehmen. Winterliche Golfturniere sind
vor allem ein Anlass, um golfbegeisterten G&auml;sten und Einheimischen im
Winterurlaub eine Freude zu machen und die saisonbedingte Winterpause der
Golfer ein wenig zu &uuml;berbr&uuml;cken. <br clear=all></p>
        
<p><img src="mm_schweissfuss4.jpg" width="255" height="170" border="0"
alt="" align=left hspace=6>Das Mekka der Schneegolfer liegt &uuml;brigens
im Schweizer Kanton Graub&uuml;nden. Jedes Jahr werden dort verschiedene
Golfturniere auf Schnee organisiert, bereits im Januar 1979 wurde im
Engadin das erste winterliche Golfturnier in Europa ausgetragen. </p>
        
<p>Bemerkenswert auch der Schauplatz dieses ungew&ouml;hnlichen Treibens.
Wegen eines im Februar stattfindenden Pferderennens musste der St. Moritzer
See ohnehin gewalzt werden und nachdem das Bootshaus des &ouml;rtlichen
Segelclubs kurzerhand zum Clubhaus f&uuml;r Golfer umfunktioniert wurde,
stand dem ersten Winter Golf Turnier auf dem gefrorenen See nichts mehr im
Wege. </p>

<p>Sehr zur Freude der Organisatoren nahmen ganze 87 Personen daran teil,
auch an neugierigen (und teilweise kopfsch&uuml;ttelnden) Zuschauern fehlte
es nicht. <br clear=all></p>


<p><img src="mm_schweissfuss3.jpg" width="255" height="153" border="0"
alt="" align=left hspace=6>Diese sahen gleich im ersten Jahr das erste
"Hole in one", mit einem Schlag vom Abschlag direkt ins Loch - was sich in
den darauffolgenden j&auml;hrlichen Turnieren bis heute insgesamt noch
sechs Mal wiederholte. </p>
        
<p>Die k&auml;ltesten Temperaturen hatte man im zweiten Jahr, damals wurden
auf dem See morgens beim Start der ersten Partie minus 19 Grad gemessen. In
diesem Jahr spielte auch ein damals noch kaum bekannter junger Mann mit,
dem man eine gro&szlig;e Karriere voraussagte. Sein Name: Bernhard Langer.
</p>

<p>Vom tiefgefrorenen See hinauf ins Hochgebirge. In Leukerbad auf dem
Gemmipass wurde Mitte Februar dieses Jahres in 2350 Metern H&ouml;he die
erste hochalpine Golf-Trophy ausgetragen. Vor der imposanten Kulisse der
Walliseralpen spielten die frostgesch&uuml;tzten Teilnehmer an zwei Tagen
jeweils 9 L&ouml;cher, f&uuml;r die Wertung z&auml;hlte die Summe beider
Resultate. </p>

<p>Zwar k&uuml;hl da oben, aber nicht cool genug, scheinen die Amerikaner
dar&uuml;ber zu denken und setzen dem europ&auml;ischen Wintergolfen noch
eins drauf. Schneegolfen? Nur auf Skiern! Unter den Golfverr&uuml;ckten
jedenfalls sind Skigolf-Turniere in den Skigebieten quer durch die USA und
Kanada der absolute Renner. Auch unsere skandinavischen Nachbarn erfreuen
sich der Besonderheiten des winterlichen Golfspiels auf ihre Weise. In
Arvidsjaur im schwedischen Lappland beispielsweise steht an Stelle des
Golfjungen ein echtes Rentier Caddie (kein Witz!) zur Verf&uuml;gung. Und
sollte das golfbegeisterte Tier das Interesse verlieren, kann die Reise von
Loch zu Loch auch mit einem motorisierten Schneemobil fortgesetzt werden.
<br clear=all></p>
        
</td></tr></table>

<p>Diese eine Seite sollte ausreichend sein, um den Charakter der
beschriebenen Website hervorzuheben. Geht sie besuchen, es ist ein
Erlebnis. </p>

<p> &nbsp; <br> <font size="-1">Kein linker Frame? Dann klicke
<a href="javascript:history.back()"><b>hier</b></a>
&nbsp; &nbsp; &nbsp; oder zur&uuml;ck zur
<a href="index.html" target="_top"> <b>NoCover?</b></a></font> </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
