<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Leserbrief Charly</title>
<meta name="author"         content="Karl-Heinz Bader">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

</head>

<body background="../bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
<a name="top"></a>

<table width="95%" align="center" border="0" cellspacing="0" cellpadding="0" summary="Text">
<tr>
<td height="25" colspan="4">
<h2 align="center">Charly&acute;s Leserbrief</h2></td>
</tr>

<tr>
<td height="100">
<div align="center"><img src="charly.jpg" width="67" height="75" border="1" alt="meiner einer"></div>
</td>

<td height="100" width="793"> <br>
<div align="center">
<p>
&#149; <a href="#a1">Kilian</a> &#149;
<br>
&#149; <a href="#a8">Impressum</a>&#149;
</p>
</div>
</td>
</table>
<br><br><br>
<table width="95%" bgcolor="#ffffff" align="center" border="1" cellspacing="4" cellpadding="40" summary="Text">
<tr><td>
<h1>Hallo alle zusammen,</h1><br>
<p>nach ein paar Monaten Pause schreibe ich auch mal wieder in der NoCover.
Ausschlaggebend daf&uuml;r war, dass es jetzt Freeware ist. Irgendwie war es fr&uuml;her bl&ouml;d,
dass man bezahlen musste, um etwas zu schreiben zu d&uuml;rfen. :) Und ich pers&ouml;nlich
finde dass HTML doch mehr Spass macht als AmigaGuide.<br><br>
Nochmal f&uuml;r alle, die es nicht wissen. Mein Amiga ist emuliert und l&auml;uft
mit WinUAE Version 0.8.16 R 4 und Amiga OS 3.9 auf einer Windows-Oberfl&auml;che.
Ich habe aber noch echte Amiga&acute;s. :))
</p>
<H3><i> Charly </i></H3>

</td>
</table>
<br><br><br>
<table width="95%" bgcolor="#ddffff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<a name="a1"></a><br>
<h3>Hallo Kilian,</h3>
<p>
hier bin ich wieder. :) Entgegen den Richtlinien werde ich aber meine Texte
in<br><b>HTML 4.01 Transitional</b> schreiben. Auch w&uuml;rde ich gern CSS verwenden,
aber das k&ouml;nnen die Amiga-Browser nicht. Aber auch die Windows-Browser sind nicht
alle zu allem kompatible. Kleiner Trost. :)<br> Es gibt vielleicht M&ouml;glichkeiten
durch ein paar Tricks doch noch etwas dazustellen. Mal sehen, ob ich da was finde.
</p><p>
Hier im Mag werden ja noch Frames verwendet - ist ja eigentlich auch nicht mehr so
der gute HTML-Stil. Jedenfalls die Profis sehen das so. Hier ist es ja mehr Amiga-Intern.
Wof&uuml;r sind Frames gut? Man sieht immer alle Dateien einer Rubrik und das Hauptfenster
ist dadurch kleiner. Alternativ k&ouml;nnte man es so machen, wie es schon bei den
Mitgliedern aufgebaut ist. Nur mal ein Vorschlag.
</p><p>
Wenn ich spaﬂeshalber mal ein paar NoCover Seiten mit <b>Tidy</b> pr&uuml;fen lasse,
dann werden reichlich Fehler angezeigt. ;(( Da sind nat&uuml;rlich Fehler bei, die nicht
so ins Gewicht fallen. Zum Beispiel fehlende Beschreibungen zu Bildern und 'table'.
</p><p>
Hier habe ich mal den ersten Beitrag gepr&uuml;ft:<br>
<br><i>
Tidy (Version vom 4. August 2000) parst &quot;NoCover94\nc\afuture.html&quot;<br>
NoCover94\nc\afuture.html: Der Dokumenten-Inhalt sieht aus wie HTML 3.2<br>
1012 Warnungen/Fehler wurden gefunden!<br>
Das 'summary'-Attribut sollte benutzt werden, um die Struktur der
Tabelle zu beschreiben. Das ist sehr hilfreich f&uuml;r Menschen, die
nicht-visuelle Browser verwenden (z.B. f&uuml;r Blinde). Die 'scope'- und
&acute;header&acute;-Attribute f&uuml;r Tabellenzellen sind n&uuml;tzlich, um zu spezifizieren,
welche Tabellenk&ouml;pfe zu der jeweiligen Tabellenzelle geh&ouml;ren. So k&ouml;nnen sich
die Benutzer von Textbrowsern einen sinnvollen Kontext f&uuml;r jede Zelle
 erschlieﬂen.
Das &acute;alt&acute;-Attribut sollte benutzt werden, um eine kurze
Beschreibung des Bildes anzugeben; l&auml;ngere Beschreibungen sollten
im &acute;longdesc&acute;-Attribut gegeben werden, das eine URL beinhaltet, die
auf die Erkl&auml;rung zeigt.
Diese Maﬂnahmen werden f&uuml;r Menschen ben&ouml;tigt, die einen Textbrowser
benutzen (also z.B. Blinde, Konsolensurfer etc.).
F&uuml;r weitere Ratschl&auml;ge, wie Sie Ihre Seiten besser erreichbar
machen, besuchen Sie &quot;http://www.w3.org/WAI/GL&quot;. Probieren Sie vielleicht auch
einmal die Seite &quot;http://www.cast.org/bobby/&quot;, die einen web-
basierten Service darstellt, der URLs auf Erreichbarkeit pr&uuml;ft.
Sie sollten CSS benutzen, um Ihre Schriftart und Eigenschaften
wie Schriftgr&ouml;ﬂe und -farbe zu spezifizieren. Das wird die Gr&ouml;ﬂe
Ihrer HTML-Dateien reduzieren und die Wartung im Vergleich zur
Benutzung des &lt;FONT&gt;-Elements vereinfachen.
HTML &amp; CSS Spezifikationen finden sich auf http://www.w3.org/
Um mehr &uuml;ber Tidy zu lesen, besuchen Sie http://www.w3.org/People/Raggett/tidy/
Bitte senden Sie Fehlerbenachrichtigungen an Dave Raggett c/o &lt;html-tidy@w3.org&gt;
Bitten Sie Ihre Firma, das W3C zu unterst&uuml;tzen - http://www.w3.org/Consortium
</i></p>
<p>
Hier ist jetzt nur die Textbeschreibung der Fehler. Alle Fehler werden in <b>Tidy</b>
noch erkl&auml;rt. F&uuml;r den Amiga gibt es auch eine Tidy-Version, wohl zu finden im AmiNET
unter comm/www. Gut, ich werde f&uuml;r die Rubrik <b>Tools</b> noch einen Text schreiben.
</p>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>

<table width="95%" align="center" summary="Text">
<tr><td>
&#149; <a href="#top">zum Anfang</a>
&#149;
</tr>
<tr><td>
</tr></table>
<a name="a8"></a>
<table align="center" bgcolor="#ddeeff" border="6" width=95% cellspacing=0 cellpadding="1" summary="Autor">
<tr><td align="center">Autor:<a href="mitglieder/bader.html">Charly Bader</a>&nbsp;
Mail:<a href="mailto:charly-ham@t-online.de">charly-ham@t-online.de</a>&nbsp;
Web:<a href="http://charly-ham.bei.t-online.de/">http://charly-ham.bei.t-online.de/</a></td>
</tr>
</table>

</body>
</html>
