<html>
<head>
<title>Interview5</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table>
<tr><td valign=top>
Entwickler: <br>
Software: <br>
Homepage: <br>
Email: </td>
<td valign=top>
<b> Helmut Hoffmann</b><br>
PhotoAlbum / CyberShow <br>
home.arcor.de/helmuthoffmann/photoalbum <br>
helmuthoffmann@arcor.de
</td></tr>
</table>
</p>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Mein Name ist Helmut Hoffmann und ich bin vom Jahrgang 1968. Vor einigen
Jahren habe ich mein Informatik Studium an der RWTH in Aachen
abgeschlossen. W&auml;hrend der Studienzeit habe ich begonnen, Shareware
Programme f&uuml;r den Amiga zu entwickeln. </p>

<p><b>Wann hast Du angefangen, mit dem Amiga zu arbeiten? </b><br>

Das d&uuml;rfte so ca. 1989 gewesen sein. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

Mein letzter "echter" Amiga ist ein Amiga 3000 (mit einer betagten 25MHz
68030-CPU). Tats&auml;chlich nutze ich aber fast nur noch den "UAE" auf
einem Windows-PC mit 1Ghz, da dieser (dank des seit kurzem im UAE
enthaltenen Just-in-time-Compilers) um ein Vielfaches schneller ist. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

Zur Zeit noch OS3.1 </p>

<p><b>Welche Software entwickelst Du? </b><br>

Meine Shareware-Programme sind &uuml;berwiegend aus dem Bereich
Grafik-Programme (PhotoAlbum, CyberShow; fr&uuml;her auch EGS-TV und
EGSPhotoAlbum) oder Zusatzprodukte f&uuml;r andere Grafik-Programme (Module
f&uuml;r ImageFX, Photogenics und XiPaint). </p>

<p>Kaum bekannt ist, da&szlig; ich auch einmal ein Spiel entwickelt habe
("supertrail", zu finden im Aminet). Dies ist aber sehr lange her (und eher
eine "Jugends&uuml;nde", zumindest was die Programmierqualit&auml;t angeht
in Bezug auf Systemkonformit&auml;t). </p>

<p>Im &uuml;brigen habe ich auch zeitweise Auftragsarbeiten f&uuml;r
Gesch&auml;ftsprogramme am Amiga durchgef&uuml;hrt. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

Meine aktuelle Software (im Bereich Grafik) hat das Ziel, den Umgang mit
Grafiken aller Art auf eine sehr schnelle, komfortable und vor allem auch
zuverl&auml;ssige und stabile Art zu erm&ouml;glichen. Was mich bei vielen
(auch kommerziellen) Produkten aus diesem Bereich sehr &auml;rgert, ist
tr&auml;ge Bedienung und vor allem h&auml;ufige Abst&uuml;rze. Dies habe
ich versucht, bei meinen Programmen zu vermeiden. </p>

<p><b>Was hat in Dir die Idee geweckt, Deine Software (weiter) zu
entwickeln? </b><br>

Einige Gr&uuml;nde habe ich oben gerade genannt. Der Ausgangspunkt f&uuml;r
mich, Grafikprogramme zu entwickeln, war aber der Mangel an guten
Programmen mit Unterst&uuml;tzung speziell von Grafikkarten in der
Anfangszeit der Amiga-Grafikkarten (im Jahr 1994). Ich benutzte damals
einen VLab-Framegrabber und hatte eine EGS-Grafikkarte. Leider gab es keine
vern&uuml;nftige M&ouml;glichkeit, beides zusammen zu benutzen, da der
Hersteller der VLab nur seine eigenen Grafikkarten in der Software
unterst&uuml;tzte. Das war f&uuml;r mich der Anlass, EGS-TV zu entwickeln.
Leider war der Markt f&uuml;r dieses Produkt recht klein, da nur wenige
Anwender sowohl eine EGS-Karte als auch eine VLab-Karte in Kombination
besa&szlig;en. </p>

<p>Die Idee, ein digitales PhotoAlbum zu machen ergab sich dann als
Abspaltung aus den in EGS-TV integrierten Lade- und Speicherfunktionen. Es
gab damals zwar f&uuml;r EGS schon eine Art Bildverwaltung, die war aber
sehr langsam und umst&auml;ndlich zu benutzen (ich hatte mal eine
Demo-Version davon bekommen). Daraus entstand dann EGS-PhotoAlbum. </p>

<p>Nach kurzer Zeit verschwanden dann allerdings die EGS-Grafikkarten (bzw.
die EGS-Grafiksoftware) vom Amiga-Markt und CyberGraphX begann sich zu
etablieren. Da ich bis dahin nur Oberfl&auml;chen f&uuml;r EGS geschrieben
hatte, war mein erstes Produkt f&uuml;r diesen Markt mein "CyberShow",
welches nur mit Men&uuml;s, Tastenbedienung und Shell-Parametern auskommt.
Doch recht schnell wurde der Druck gro&szlig;, auch EGS-PhotoAlbum f&uuml;r
CyberGraphX anzubieten. Damit der Nutzerkreis noch gr&ouml;&szlig;er war,
habe ich es so ausgelegt, da&szlig; es nicht nur auf 24Bit mit CyberGraphX
l&auml;uft, sondern auch auf allen AGA-Amigas (ab OS3.x), wenn es auch
f&uuml;r Grafikkarten schneller und qualitativ hochwertiger ist. </p>

<p>Weiterentwicklungen entstanden entweder auf Wunsch von Benutzern oder
aufgrund eigener W&uuml;nsche, wie zuletzt die Rotationsfunktionen, die ich
f&uuml;r die Nutzung meines digitalen Fotoapparates eingebaut habe. </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert? </b><br>

Die ersten Programmteile meiner aktuellen Grafik-Programme sind bereits in
EGS-TV im Juni 1994 entstanden. Die erste Version von CyberShow erschien
Juni 1995, die von PhotoAlbum erschien Mai 1996. Seitdem sind die beiden
Programme kontinuierlich weiterentwickelt worden (wenn auch mit
L&uuml;cken). </p>

<p><b>Welche Software verwendest Du? </b><br>

Als Assembler kommt der "OMA" zum Einsatz. Bis auf die JPeg-Routinen sind
alle meine Grafikprogramme in Assembler entwickelt und hochoptimiert
worden. F&uuml;r die &Uuml;bersetzung des JPeg-Codes (C++) verwende ich
Maxon C++. </p>

<p><b>F&uuml;r welches System (AmigaOS,AmigaDE,MorphOS)entwickelst Du?
</b><br>

F&uuml;r das klassische AmigaOS

<p><b>Welches Os wirst Du in Zukunft unterst&uuml;zen? </b><br>

Ein Wechsel ist bei mir im Moment nicht geplant. Da ich als
Entwicklungsumgebung mittlerweile vornehmlich den UAE-Simulator auf einem
billigen PC einsetze, kommen die anderen Systeme wohl auch nicht in Frage.
Und das Geld f&uuml;r eine neue Amiga-Hardware mit PowerPC oder
&auml;hnliches kann durch Shareware sowieso nicht erwirtschaftet werden,
daher wird es wohl bei AmigaOS bleiben. Meine Hoffnung ist, da&szlig; durch
moderne Just-In-Time-Compiler (wie es sie im UAE-Simulator schon gibt)
k&uuml;nftig auch Nutzer von PowerPC-Amigas meine 68k-Assembler-Programme
blitzschnell ausf&uuml;hren k&ouml;nnen. Auf dem PC bemerke ich jedenfalls
von der Geschwindigkeit keinen nennenswerten Unterschied mehr zwischen
meinen Amiga-Programmen unter UAE und &auml;hnlichen PC-Programmen. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Auf jeden Fall eine Funktion zum Umbenennen von Bildern in PhotoAlbum;
weitere geplante Neuerungen sind (m&ouml;glicherweise) PNG-Ladefunktionen
und eine feinere Skalierung in CyberShow. Dies h&auml;ngt nat&uuml;rlich
vom Interesse der Benutzer ab... </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln,
wenn Du siehst, wie wenig Resonanz Du aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Dies tr&uuml;bt leider schon ziemlich die Stimmung. </p>

<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software? </b><br>

In den letzten Jahren leider nein. </p>

<p><b>Wann hast Du Deinen Amiga das letzte Mal benutzt? </b><br>

Den richtigen vor einigen Tagen; den UAE-Simulator auf dem PC benutze ich
fast t&auml;glich. </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r den Amiga gekauft? </b><br>

Falls das z&auml;hlt: Vor einigen Jahren die Amiga-Forever-CD mit dem
UAE-Simulator, aber strenggenommen ist dies ja eine PC-Software, auch wenn
sie einen Amiga simuliert. </p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

Irgendwie schon, aber was das letztendlich sein wird, ist v&ouml;llig unklar.
F&uuml;r mich ist schon ein schneller Simulator letztendlich ein gelungenes
Comeback. Ich verbinde Amiga nicht zwingend mit einer speziellen Hardware.
</p>

<p><b>Deine letzten Worte an die Leser? </b><br>

Ein Zitat aus meinen Shareware-Anleitungen: <br>

Die Zukunft der Amiga-Software-Entwicklung liegt in Ihren H&auml;nden... </p>

<p>Also in diesem Sinne hoffe ich auf die Unterst&uuml;tzung aller
grafik-begeisterten Amiga-Nutzer, damit ich meine geplanten Erweiterungen
realisieren kann und vielleicht auch weitere Anregungen bekomme. </p>

<p>Mit freundlichen Gr&uuml;&szlig;en Helmut Hoffmann </p>

<p>© Amiga Arena 01/2002 </p>

</td></tr></table>
<br>
</body>
</html>



