<html>
<head>
<title>Interview6</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table>
<tr><td valign=top>
Entwickler: <br>
Software: <br>
Homepage: <br>
Email: </td>
<td valign=top>
<b> Ralph Torchia</b><br>
Spitfire <br>
www.amigaspitfire.com <br>
rtorchia@cogeco.ca
</td></tr>
</table>
</p>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
 
Mein Name ist Ralph (Raffaele) Torchia, ich bin 30 Jahre alt, habe vor
kurzem geheiratet und bin von Beruf Zahnarzt in Kanada. </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich kaufte meine ersten Amiga 1000 1987, und ich mu&szlig; in der Stadt
einer der ersten gewesen sein, die einen kauften. </p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
Momentan besitze ich einen Amiga 2000 mit einer 030/882/MMU G-Force Karte,
PicassoII, ioExtender, A2320 Flicker Fixer usw. Ich verwende auch WinUAE
auf meinem Pentium III-System. </p>
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
Auf meinem A2000 l&auml;uft OS 3.9 und bei WinUAE ist 3.5 installiert. </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Momentan entwickle ich Spitfire, ein Palm-Desktop f&uuml;r das AmigaOS.
</p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>
 
Spitfire ist meine Anwendung der zweiten Generation, die Amiga-Benutzern
mit PalmOS-Ger&auml;ten erm&ouml;glicht, ihre PDAs mit dem Amiga zu
synchronisieren. </p>
  
<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln?</b><br>

Als ich 1997 zuerst meinen PalmPilot kaufte, gab es nur Software f&uuml;r
Windows und MacOS. Damals hatte ich keinen dieser Computer. Nachdem mir
klar wurde, da&szlig; niemand eine Amiga-Software zum Anbinden des Palm
entwickelte, machte ich mich auf, meine eigene zu entwicklen. </p>
  
<p><b>Wie lange hat die Entwicklung bisher gedauert?</b><br>
 
I begann 1998 mit der Entwicklung von Spitfire und ging dann 1999 dazu
&uuml;ber, Spitfire zu entwickeln, welches die zweite Generation der
Software war. Spitfire hatte viel mehr Features und war f&uuml;r
einfachere Erweiterbarkeit vom Entwickler- als auch Benutzerstandpunkt
entworfen worden. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
Spitfire wird in AmigaE geschrieben, und ich verwende WinUAE mit GoldED
als Entwicklungssystem. Getestet wird auf meinem A2000. </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>
 
Momentan nur f&uuml;r AmigaOS. </p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig
unterst&uuml;tzen?</b><br>
 
Wahrscheinlich nur AmigaOS. Das ist nat&uuml;rlich nicht in Stein
gemei&szlig;elt, und alles kann passieren. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
H&ouml;chstwahrscheinlich Bugfixes und die Erweiterung der Desktopelemente,
wie mehr Import/Export-M&ouml;glichkeiten, was die gr&ouml;&szlig;te
Nachfrage bei den registrierten Benutzern gewesen ist. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>
  
Du verlierst schon etwas das Interesse, aber das ist nicht die Hauptsache
beim Programmieren auf dem Amiga; das ist, Resonanz zu bekommen. Jeder, der
f&uuml;r den Amiga entwickelt, wei&szlig;, da&szlig; Du niemals genug Geld
verdienen wirst, um die Kosten zu decken oder reich zu werden (oder auch
nur genug, um Lebensmittel einkaufen zu gehen!). Du tust es, weil du es
irgendwie genie&szlig;t.
  
<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</b><br>
 
Ich erhalte etwas Resonanz, und es ist toll wenn du das tust, aber nicht
ann&auml;hernd genug. Es gibt dir ein gutes Gef&uuml;hl, da&szlig; da
drau&szlig;en Leute sind, die deine Arbeit sch&auml;tzen und auch willens
sind, auf irgendeine Weise zu helfen, sie zu verbessern.
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Meinen A2000 habe ich zuletzt im Dezember 2001 benutzt. Ich tendiere dazu,
&ouml;fter WinUAE zu benutzen, da es auf meinem PIII wohnt, der bei mir zu
Hause das Arbeitspferd ist. </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>
 
AmigaOS 3.9 </p>
  
<p><b>Welche Amiga-Software verwendest Du noch?</b><br>
 
Haupts&auml;chlich verwende ich Entwicklungswerkzeuge f&uuml;r meine
Software. Davon abgesehen verwende ich PersonalPaint, um ein paar Grafiken
zu bearbeiten, Spitfire zum Synchronisieren und Nachschlagen von
Informationen, die auf meinem PDA gespeichert sind, und DOpus 5, das auf
meinem WinUAE-System l&auml;uft. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Keine. Ich habe momentan eine gro&szlig;e Bibliothek von Amiga- und
PC-Software, und meine Frau w&uuml;rde in die Luft gehen, wenn ich noch
irgendwelche Hardware f&uuml;r meine Computer kaufte. ;-) </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Ich denke, seine Popolarit&auml;t kann immer noch wachsen, aber er wird
immer vom Windows-Moloch in den Hintergrund gedr&auml;ngt werden. Ich kann
ihn &uuml;ber den momentanen Zustand hinauswachsen sehen, aber nur, wenn
alle in der Community als ein Team zusammen kommen, mit viel besserer
Richtung und F&uuml;hrung von Amiga, Inc. </p>
  
<p><b>Deine letzten Worte an Die Leser?</b><br>
 
Unterst&uuml;tz Amiga-Entwickler weiter wie Ihr nur irgend k&ouml;nnt.
Au&szlig;erdem, gebt nie die Hoffnung bei den Dingen auf, die in Eurem
Leben wichtig sind. Wunder geschehen auch heute noch, Ihr m&uuml;&szlig;t
nur lernen, wo Ihr suchen m&uuml;&szlig;t. </p>
  
<p>Mit freundlichen Gr&uuml;&szlig;en <br> Ralph Torchia, B.Sc., D.D.S. </p>

<p> Amiga Arena 01/2002 <br>
(aus dem Englischen von Christian Busse)</p>

</td></tr></table>
<br>
</body>
</html>



