<html>
<head>
<title>Interview2</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table>
<tr><td valign=top>
Entwickler: <br>
Software: <br>
Homepage: <br>
EMail: </td><td valign=top>
<b>Gerd Frank</b><br>
AmiATLAS 6 <br>
go.to/amiatla <br>
AmiATLAS@gmx.net 
</td></tr>
</table>
</p>


<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Mein Name ist Gerd Frank und ich bin 28 Jahre jung, sehe aber angeblich
viel &auml;lter aus was ich f&uuml;r ein stark &uuml;bertriebenes
Ger&uuml;cht halte... ;) Diese Angaben sollten reichen, da mich im
Amiga-Sektor doch einige Leute kennen... Oder ?! ;) </p>

<p><b>Wann hast Du angefangen, mit dem Amiga zu arbeiten?</b><br>

War Ende 1986 soweit ich mich erinnere, und somit war es ein A1000 mit den
&uuml;blichen Erweiterungen. <br>

Um 1990 wurde dieser durch einen A3000 ersetzt, sp&auml;ter A3000T und
zuletzt ein A4000T. Dazwischen kam immer mal wieder der eine oder andere
Amiga mit diverser Ausstattung dazu oder auch wieder weg, au&szlig;er A500
wohlgemerkt. Obiges stellt aber die Hauptsysteme dar. Vor mittlerweile rund
drei Jahren hab ich mit der Abr&uuml;stung angefangen und die vorhandene
Hardware sehr stark reduziert. Da waren HW-Sch&auml;tzchen wie GVP
ImpactVision24, DPS PAR oder Broadcaster Elite dabei, wonach sich auch
heute noch mancher Amiga-Freak die Finger lecken w&uuml;rde! </p>

<p><b>Welches Amiga-Modell besitzt Du?</b><br>

F&uuml;r die Entwicklung ist ein A3000UX mit CyberStorm Mk2-040,
CyberVision64/4, Ariadne2 und ISDN-Master im Einsatz, inkl. 128+2 MByte
RAM, 4GByte Platte, 32x SlotIn CD und 12x CD-R. Mehr f&auml;llt mir jetzt
gar nicht ein. <br>

Zu Testzwecken steht noch ein A4000D mit Mk2-060, Flickerfixer, 32MByte RAM
1GByte Platte und 16x CD zur Verf&uuml;gung. <br>

Gelegentlich wird auch mein Apple PowerBook mit UAE benutzt, und der meist
nur umherstehende Athlon 1400 mit Amithlon zur schnellen Compilierung
eingesetzt. Ne alte SGI ist auch noch in Gebrauch... <br>

Und nat&uuml;rlich der &uuml;bliche Kram wie Laserdrucker, diverse Monitore
(CRT und TFT) und anderer Kram. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

A3000UX: AmigaOS3.9, ShapeShifter mit MacOS8, NetBSD 1.5 <br>

A4000D: AmigaOS3.1 <br>

Athlon-PC: Win2k, Linux 2.4.x, Amithlon/AmigaOS XL mit AmigaOS3.9 <br>

PowerBook: MacOS 9, MacOS X, UAE mit AmigaOS3.1 <br> SGI: IRIX 6.x </p>

<p>Die Rechner sind allesamt vernetzt. </p>

<p><b>Welche Software entwickelst Du?</b><br>

Aktuell und offiziell nur AmiATLAS 6. Ist auch mehr als genug Arbeit...
Ansonsten k&uuml;mmere ich mich um diverse Auftragsarbeiten,
haupts&auml;chlich unter anderen Betriebssystemen und speziell im Bereich
Video/Grafik. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>

Wenn ich das w&uuml;sste! ;) </p>

<p>Nun ja, ist halt ein Routenplaner inkl. Reise-/Hotelf&uuml;hrer f&uuml;r
diverse L&auml;nder Europas. Mittlerweile auf diesem Sektor das einzige
Produkt f&uuml;r den Amiga. War auch der Grund, wieso ich &uuml;berhaupt
damit angefangen hab! </p>

<p><b>Was hat in Dir die Idee geweckt, Deine Software (weiter) zu
entwickeln?</b><br>

Langeweile?! Mangelnde Auslastung?! Ich wollte einfach mal wieder etwas
f&uuml;r den Amiga machen, das letzte ver&ouml;ffentlichte Projekt ist
bestimmt gut f&uuml;nf Jahre her. Kennt noch jemand diese omin&ouml;se
CD-ROM "Amiga FD Inside" ? Au&szlig;erdem ist AmiATLAS marktwirtschaftlich
gesehen das sinnvollste Projekt. H&auml;tte hier noch gut ein Dutzend
Sources anderer ehemaliger kommerzieller Software, aber die Entwicklung ist
einfach unrentabel und vor allem zeitlich bring ich das gar nicht unter,
nicht mal ansatzweise. Davon abgesehen gibt es im ShareWare-Bereich oft
bereits bessere Alternativen. </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert?</b><br>

Der Kontakt mit Andreas Regul zur &Uuml;bernahme von AmiATLAS kam circa
M&auml;rz 2001 zustande. Allerdings fand ich da die allgemeine
Amiga-Situation noch ein ganzes St&uuml;ck schlechter als momentan,
weswegen nichts gemacht wurde. Wenigstens gingen die Sources schon mal
nicht ganz unter. <br>

Die Weiterentwicklung wurde letztlich erst sehr kurzfristig im Oktober 2001
gestartet als ich kurzentschlossen einige Umfragen startete und auch
&uuml;ber diverse News-Dienste eine Ank&uuml;ndigung zu AmiATLAS erschien.
Die Resonanz war sehr gut, also fing ich an gute 16h/Tag an AmiATLAS zu
arbeiten, eben bis zur geplanten Amiga-Messe Anfang November in K&ouml;ln.
Dummerweise gabs ein paar h&auml;ssliche Systemcrashes, wodurch zur Messe
nur eine stark eingeschr&auml;nkte bzw. &auml;u&szlig;erlich relativ wenig
erweiterte Version ver&ouml;ffentlicht werden musste. </p>

<p>Nichtsdestotrotz wurden gut 15.000 Files unter die Lupe genommen und bei
Bedarf fehlerbereinigt! Hiervon hatte ich zum Gl&uuml;ck ne Menge
funktionierender Backups! Am Source wurde ja tagt&auml;glich gearbeitet,
nach Murphy aber nicht tagt&auml;glich ein Backup gemacht! Deswegen konnte
ich rund eine Woche vor der Messe nochmal neu starten, dar&uuml;ber war ich
nat&uuml;rlich total begeistert... ;(((

<p><b>Welche Software verwendest Du?</b><br>

Originale (zu 99% Anwender) hab ich hier weitaus mehr als ich einsetze,
teils auch um nur den maroden Amiga-Markt etwas zu unterst&uuml;tzen, teils
weil es sich um gute alte Sch&auml;tzchen aus der glorreicheren
Amiga-Vergangenheit handelt. Zeiten in denen es noch richtige gro&szlig;e
Verpackungen inkl. viel Zubeh&ouml;r und nicht nur DVD-H&uuml;llen gab...
;) </p>

<p>Im Einsatz sind z.B. SAS C, StormC, CygnusEd, DOpus4 (v5 gef&auml;llt
mir nicht), Miami3, YAM, IBrowse2 und nat&uuml;rlich AmiATLAS. Gelegentlich
auch MasterISO, FinalWriter, FinalData, TurboCalc, PageStream, SuperView
und TVPaint. Als ich noch mehr Amigas im Einsatz hatte waren es
nat&uuml;rlich noch weitaus mehr Programme. Die liegen aber bestenfalls
brach auf der Platte oder sind gut in den Schr&auml;nken verstaut. </p>

<p><b>F&uuml;r welches System (AmigaOS,AmigaDE,MorphOS)entwickelst
Du?</b><br>

Speziell f&uuml;r den Amiga nur AmigaOS. MorphOS auf jeden Fall sobald die
Entwicklungssysteme ver&ouml;ffentlicht wurden. <br>

Ansonsten Linux bzw. IRIX. BeOS stand mal zur Debatte, ging ja leider den
Bach runter. Hat mir von allen aktuellen Betriebssystemen mit Abstand am
besten gefallen, wohl auch weil viele Parallelen zum AmigaOS vorhanden
sind. </p>

<p><b>Welches OS wirst Du in Zukunft unterst&uuml;tzen?</b><br>

Sicherlich weiterhin das AmigaOS 3.x bzw. sp&auml;ter MorphOS, m&ouml;glich
w&auml;re zuk&uuml;nftig nat&uuml;rlich auch AmigaOS 4. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>

In Sachen AmiATLAS? Ich m&ouml;chte keinerlei Versprechungen abgeben, die
ich nicht einhalten kann, deswegen wird das hier nicht verraten, sorry!
Amiga-User wurden die letzten Jahre genug verarscht durch die vielen
Ank&uuml;ndigungen. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln,
wenn Du siehst, wie wenig Resonanz Du aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Reich wird man bei dem kleinen Markt sicherlich nicht, aber unter solchen
Gesichtspunkten wird auch kaum jemand mit irgendeiner Entwicklung beginnen.
Die noch aktiven Leute sehen das wohl mehr als Spa&szlig; am Amiga an.
Davon leben kann man ja noch ganz gut, aber eben nicht reich werden. <br>

F&uuml;r diesen besonderen Markt sind die Verkaufszahlen aber wirklich sehr
gut, liegen allerdings noch im unteren dreistelligen Bereich, wobei
gr&ouml;&szlig;ere (4/5-stellige) St&uuml;ckzahlen kaum zu erreichen sein
d&uuml;rften. Mir fehlt einfach der Verkauf bei einem bekannten Discounter
in Millionenauflagen! ;) </p>

<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</b><br>

Bin ehrlich sehr zufrieden, alles nette User mit sehr konstruktiver Kritik!
Und vorhandene Probleme versuche ich umgehend zu l&ouml;sen, teils erhalten
die User sogar speziell angepasste Versionen. </p>

<p>Etwas &auml;rgerlich finde ich manchmal solche Kommentare wie "AmiATLAS
ist absolut &uuml;berteuert", "taugt nix" usw. Aber das sind nun mal Leute
die wenig bis gar keine Ahnung vom bestehenden Markt haben. Und deswegen
ist eben vieles finanziell gesehen schon gar nicht m&ouml;glich was z.B.
vergleichbare g&uuml;nstigere Programme am PC bieten. W&uuml;rden die
Verkaufszahlen um ein vielfaches h&ouml;her ausfallen liese sich dieser
Zustand vielleicht &auml;ndern... </p>

<p><b>Wann hast Du Deinen Amiga das letzte Mal benutzt?</b><br>

Genau jetzt! Und wohl auch noch die n&auml;chsten Stunden, gerade erst
wurde ein kompletter Compilerlauf gestartet, und das dauert wirklich... Und
nach dem Interview werde ich an AmiATLAS weiterarbeiten, m&ouml;chte gegen
Ende Januar ein neues umfangreiches Update rausbringen k&ouml;nnen. </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r den Amiga gekauft?</b><br>

Gute Frage, glaube es war Amithlon/AmigaOS XL und davor OS3.9, keine
Ahnung. Kommt ja leider so selten neues raus! </p>


<p><b>Welche Hard/Software hast Du vor zu kaufen?</b><br>

Bei Hardware nur ein PEGASOS System. An Software d&uuml;rfte ich versorgt
sein, wobei mir ein wirklich gutes Entwicklungssystem allerdings schon
gefallen w&uuml;rde... Bin sicherlich durch die Arbeit mit anderen Systemen
etwas verw&ouml;hnt in diesen Dingen. </p>

<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>

Vergleichbar fr&uuml;heren Zeiten ganz sicher nicht, der Nischenmarkt wird
aber weiterhin auf die eine oder andere Art bestehen. Ich hoffe aber sehr
auf einen Erfolg von PEGASOS !!! </p>

<p><b>Deine letzten Worte an die Leser?</b><br>

Bleibt dem Amiga treu! Es gibt wirklich keinen Grund f&uuml;r einen PC mit
Windoze... ;) Zum Spielen taugt auch ne billige PlayStation, und macht noch
dazu keinen &Auml;rger! </p>

<p> © Amiga Arena 01/2002 </p>

</td></tr></table>
<br>
</body>
</html>
