<html>
<head>
<title>Interview7</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table>
<tr><td valign=top>
Developer: <br>
Software: <br>
Homepage: <br>
Email: </td>
<td valign=top>
<b> Inutilis Software</b><br>
 Inga<br>
 http://www.inutilis.de<br>
 Timo@inutilis.de
</td></tr>
</table>
</p>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Ich hei&szlig;e Timo Kloss, bin '82 gebohren und wohne seit letzten
November in Hamburg. Ich komme aber aus Schneverdingen. Das ist so ein Ort
in der L&uuml;neburger Heide, wo zwar nix los ist, aber man trotzdem
lustige Saufgelage machen kann... In Hamburg ist das alles immer so teuer.
Hach ja... </p>

<p><b>Wann hast Du angefangen, mit dem Amiga zu arbeiten?</b><br>

&Auml;h, irgendwann in der Bl&uuml;tezeit des A500 hat mein Bruder einen
bekommen. Auf dem habe ich mit DeluxePaint angefangen kreativ zu werden.
Ich glaube '94 habe ich dann AMOS geschenkt gekriegt, womit dann meine
Programmier-Zeit anfing. </p>

<p><b>Welches Amiga-Modell besitzt Du?</b><br>

Seit '96 einen A4000T aus der Escom-Produktion. Er ist nicht sehr
spektakul&auml;r ausgestattet: 16MB Fast-RAM, 4x-CD-ROM und
ZIP100-Laufwerk, naja und immerhin mit 'ner CV64/4MB und
Prelude-Soundkarte. Eine schnellere CPU und mehr RAM fehlen mir schon
irgendwie :-( </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>

AmigaOS 3.9 </p>

<p><b>Welche Software entwickelst Du?</b><br>

Momentan die Grafikadventure-Engine "Inga", welche aber gleichzeitig Teil
des Spiels "Ermentrud" sein wird. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>

"Inga" soll es jedem erm&ouml;glichen, eigene Adventures zu programmieren,
auch wenn er eigentlich keine Ahnung vom Coden hat. </p>

<p>F&uuml;r alle, die auch selbst eine Engine programmieren k&ouml;nnten,
w&auml;re es immerhin eine gro&szlig;e Zeitersparnis, wenn sie "Inga"
benutzen w&uuml;rden. </p>

<p>Man kann sich also ganz auf die Story, Grafik und Musik konzentrieren.
Einige Leute meinen, dass "Inga" unbedingt 16-Bit-Grafik unterst&uuml;tzen
sollte. Ich sage hier aber mal ganz definitiv, dass es in der Einserversion
bei "nur" 8 Bit bleiben wird. Ich will nun mal, dass die Spiele auch auf
meiner Rechnerkonfiguration gut laufen k&ouml;nnen, und das ist nur bei 8
Bit gegeben. Au&szlig;erdem sieht 16-Bit-Grafik nicht zwangsweise besser
aus als in 256 Farben. Es kommt auf die Gestaltung an! </p>

<p><b>Was hat in Dir die Idee geweckt, Deine Software zu
entwickeln?</b><br>

Ich wollte einfach nur das Spiel "Ermentrud" machen, wof&uuml;r ich mir
sogar einen Programmierer gesucht hatte. Der begann dann aber, seine
eigenen Ideen zu verwirklichen und hat ein seltsames System f&uuml;r Java
gemacht. Also habe ich mir gedacht, dass ich das auch irgendwie selbst
hinkriege. </p>

<p>Erst sp&auml;ter habe ich die Engine "Inga" getauft, weil mir die Idee
kam, dass man mit so einer Engine mehr anfangen kann, als nur "Ermentrud"
zu realisieren. Die Eigenschaften von "Inga" orientieren sich aber immer
noch sehr an meinen Ideen f&uuml;r "Ermentrud". Daher auch keine
Hi-Color-Grafik! </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert?</b><br>

Ich habe irgendwann Mitte 2000 angefangen. Genauer wei&szlig; ich es nicht.
</p>

<p><b>Welche Software verwendest Du f&uuml;r die Entwicklung?</b><br>

Zum Programmieren benutze ich StormC in der Version 3. Ansonsten finden
noch verschiedene Grafikprogramme Verwendung. Haupts&auml;chlich
"PersonalPaint" und "ArtEffect", beide in irgendwelchen veralteten
Versionen, die man billig kriegen konnte, bzw. die dem "Magic"-Paket
angeh&ouml;rten. Ach ja, "Photogenics" habe ich auch noch benutzt. </p>

<p><b>F&uuml;r welches System (AmigaOS,AmigaDE,MorphOS)entwickelst
Du?</b><br>

Ich habe auf meinem Rechner nur die M&ouml;glichkeit f&uuml;r's klassische
AmigaOS zu programmieren. </p>

<p><b>Welches Os wirst Du in Zukunft unterst&uuml;zen?</b><br>

Da ich vorerst keine Anschaffung eines anderen Computers geplant habe,
werde ich wohl beim AmigaOS bleiben. Sollte ich mir mal ein PPC-Board
leisten k&ouml;nnen, so wird sich zeigen, was darauf noch so l&auml;uft...
Keine Ahnung. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>

Momentan hei&szlig;t es erstmal "Inga" auf die Version 1.0 zu bringen, da
es noch nicht ganz fertig ist. Dann ist "Ermentrud" an der Reihe! Abgesehen
von Fehlerbehebungen, wird es in dieser Zeit keine neue "Inga"-Version
geben. F&uuml;r sp&auml;ter ist nat&uuml;rlich geplant, dass die jetzigen
Einschr&auml;nkungen der Engine behoben werden, wie etwa Scrolling usw.
Hi-Color kann ich aber nicht versprechen, da ich dazu eine schnellere
Hardware haben m&ouml;chte. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln,
wenn Du siehst, wie wenig Resonanz Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>

Resonanz bekomme ich genug, aber es k&ouml;nnte mehr Geld sein. Aber bei
"Inga" hatte ich nichts Gro&szlig;es erwartet, denn meine Hauptentwicklung
ist ja "Ermentrud". Damit hoffe ich aber doch einiges zu verdienen, aber
das dauert noch... </p>

<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?</b><br>

Schon gesagt. </p>

<p><b>Wann hast Du Deinen Amiga das letzte Mal benutzt?</b><br>

Jetzt gerade beim Schreiben! </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r den Amiga gekauft?</b><br>

Oh, &auml;h, muss ich mal &uuml;berlegen. Ich brauche recht selten neue
Software. Ich glaube, das Letzte war ganz einfach OS 3.9. </p>

<p><b>Welche Software nutzt Du heute noch?</b><br>

F&uuml;r die Entwicklung habe ich ja schon alles gesagt. Ansonsten f&uuml;r
Internet Miami, YAM, FTPMount und AWeb. F&uuml;r Musik haupts&auml;chlich
Camouflage, aber seit Kurzem auch wieder etwas OctaMED Soundstudio f&uuml;r
Samples. &Auml;h, und das war's im Gro&szlig;en und Ganzen ja schon. </p>

<p><b>Welche Hard/Software hast Du vor zu kaufen?</b><br>

Wie gesagt, w&auml;re ein PPC mit viel RAM n&uuml;tzlich, und ein alter,
gammeliger CD-Brenner k&ouml;nnte auch nicht schaden. Momentan investiere
ich aber eher in mein "Tonstudio", so dass f&uuml;r den Computer kein Geld
&uuml;brig ist. </p>

<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>

Wenn die Leute das mit dem AmigaDE wirklich hinkriegen, dann gibt es schon
Chancen. Eine Revolution wird es aber wohl nicht geben, denn das Argument,
dass alles auf jeder Hardware l&auml;uft, ist f&uuml;r den Massenmarkt
nicht sooo relevant; die Software von Microsoft l&auml;uft auch
&uuml;berall, denn schlie&szlig;lich gibt's &uuml;berall Windows! </p>

<p><b>Deine letzten Worte an die Leser?</b><br>

Keine Ahnung. Macht was draus... (woraus auch immer) </p>

<p>© Amiga Arena 01/2002 </p>

</td></tr></table>
<br>
</body>
</html>



