<html>
<head>
<title>Interview1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table>
<tr><td valign=top>
Entwickler: <br>
Software: <br>
Homepage: <br>
Email: </td>
<td valign=top>
<b>Andrija Antonijevic </b><br>
Charon, AmiSSL, HTTPResume <br>
http://www.bigfoot.com/~TheAntony/ <br>
TheAntony@bigfoot.com
</td></tr>
</table>
</p>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
 
Mein Name ist Andrija Antonijevic, ich bin ein 23 Jahre alter Student an
der Mathematischen Universit&auml;t in Belgrad. </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich kaufte meinen ersten Amiga ende 1995, aber davor nutzte ich jede
Gelegenheit, die ich hatte, um am Amiga 500+ meines Freundes zu arbeiten.
</p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
A1200 mit Blizzard060/50 MHz und Netzwerk-Karte, aber ich &uuml;berlege,
eine PPC-karte zu kaufen und alles in der nahen Zukunft in einen Tower zu
stecken. </p>
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
OS3.9 </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Momentan arbeite ich haupts&auml;chlich an Charon und AmiSSL, den Support
f&uuml;r HTTPResume habe ich aufgegeben (da Charon so etwas wie die
n&auml;chste Generation von HTTPResume ist). </p>
  
<p><b>Kannst Du uns erz&auml;hlen, worum es bei Deiner Software
geht?</b><br>
 
Tja, es ist haupts&auml;chlich Netzwerk-Software auf die eine oder andere
Art. </p>
  
<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln?</b><br>
 
Ich mag das Programmieren, es kann sehr erf&uuml;llend sein, und das
l&auml;&szlig;t mich weitermachen. </p>
  
<p><b>Wie lang hat die Entwicklung bisher gebraucht?</b><br>
 
Das kommt darauf an, wie man es sieht. Soweit ich mich erinnere, habe ich
mit der Arbeit an HTTPResume 1997 begonnen, und 2000 hat sich das langsam
zu Charon weiterentwickelt, und jetzt in 2002 ist es bei Version 1.98. Also
hat es entweder 5 oder 2 Jahre gelegentliche Programmierung gebraucht. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
SAS/C als Compiler und ein paar GNU-Tools. </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>
 
Momentan f&uuml;r AmigaOS, falls ich die PPC-Karte kaufe, k&ouml;nnte ich
etwas Programmierung f&uuml;r ein PPC-Betriebssystem machen. </p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig
unterst&uuml;tzen?</b><br>
 
Das kann ich nicht sagen. Es sehr schwer irgendwas vorherzusagen, wenn es
um die Amiga-Entwicklung geht, also werde ich einfach abwarten und sehen,
wie die Dinge laufen. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Ich habe eine Menge Sahcne geplant, aber die w&uuml;rde ich nicht verraten
wollen, ich ziehe es vor, die User zu &uuml;berraschen :) </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst? </b></p>
  
<p>Nicht wirklich. Es ist eine Tatsache, da&szlig; man imn dem kleinen
Amiga-Markt nicht viel Geld verdienen kann, aber wenn du magst, was du tust
und selbst eine minimale Resonanz von den Usern bekommst, ist es genug um
dich bei der Stange zu halten. </p>
  
<p><b>Erh&auml;ltst Du gen&uuml;gend Resonanz auf Deine Software?</b><br>
 
Die Leute schreiben gerade genug &uuml;ber Sachen, die sie m&ouml;gen und
was sie gern hinzugef&uuml;gt oder verbessert haben w&uuml;rden :) </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Heute. Es gab eine 6-12 Monate lange Zeit, in der ich zu besch&auml;ftigt
war, ihn regelm&auml;&szlig;ig zu verwenden (und die Entwicklung von Charon
hat darunter gelitten), aber das hat sich gl&uuml;cklicherweise
ge&auml;ndert. </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>
 
La&szlig; mich mal sehen... Momentan gibt es da drau&szlig;en fast keine
neue Software, haupts&auml;chlich Updates. Und ich &uuml;bersetze oder
betateste die meiste Software, die ich verwende, also habe ich bereits
registrierte Versionen. Das letzte, das ich mich erinnern kann gekauft zu
haben, ist SAS/C. Soviel zur Gr&ouml;&szlig;e des Amiga-Marktes :( </p>
  
<p><b>Welche Software verwendest Du noch?</b><br>
 
DOpus 4.12, Progrmmierwerkzeuge, IBrowse/AWeb, Thor und Charon :) </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Momentan habe ich vor, eine PPC-Karte und einen Tower zu kaufen. </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Ich kann's nur hoffen... Es gibt ein paar interessante Projekte, die das
vollbringen k&ouml;nnten, aber man wei&szlig; ja nie. </p>
  
<p><b>Deine abschlie&szlig;enden Worte an die Leser?</b><br>
 
Tja, la&szlig;t uns einfach hoffen, da&szlig; wir alle dieses Jahr einige
Amiga-Projekte sehen werden, die etwas ausmachen. </p>

<p> © Amiga Arena 1/2002 <br>

(aus dem Englischen von Christian Busse)

</p>

</td></tr></table>
<br>
</body>
</html>
