<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Brief an Poldi</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><b>Hi Poldi!</B><br>
Ersteinaml finde ich es gut, dass Du dich nun f&#252;r die NoCover engagierst. Wir k&#246;nnen momentan wirklich jeden Schreiberling gebrauchen und ich bin f&#252;r jeden User mehr als dankbar!</P>

<p><FONT COLOR="#87CEFA"><i>muss man sich wirklich 100%ig an die SchreiberRichtlinien halten oder kann man es auch etwas anders schreiben? Es ist extrem schwer f&#252;r mich ohne Schimpfw&#246;rter zu schreiben:-))) (Das soll ein Witz gewesen sein!) Aber um seine Wut auszudr&#252;cken und den Lesern zu zeigen, dass es einem Ernst ist wenn man seine Meinung &#228;u&#223;ert, braucht man hin und wieder ein paar W&#246;rter die sonst (hoffentlich) nicht so oft im Gebrauch sind!</i></font></P>

<p>Na ja, also die Richtlinien sollten schon eingehalten werden. Klar, ab und an kann man sich schonmal dar&#252;ber hinweg bewegen, aber im gro&#223;en und ganzen sollte es schon recht gesittet ablaufen. Aber ich fand auch das Niveau bei der Fireball / 4ever (RIP) okay, so dass es f&#252;r Dich keine Umstellung sein
sollte. Mach es einfach so wie bisher auch :-)))</P>

<p><FONT COLOR="#87CEFA"><i>Was mich erinnert, das mit dem Feedback muss ich bei mir selbst auch einmal &#228;ndern, anderen zu schreiben, dass einem deren Texte gefallen haben, ist sehr wichtig! An alle: Eure Texte sind voll in Ordnung, es d&#252;rften nur mehr werden, vor allem sollten sie sich mehr um den Amiga drehen!:-)</i></font></P>

<p>Dem kann ich mich wohl nur anschlie&#223;en - aber im Ernst: Amiga Themen sind immer mehr als gerne gesehen (das Aminet bietet zahlreiche tolle Tools, die man mal vorstellen k&#246;nnte) und Feedback f&#252;r andere Autoren ist ebenso wichtig. Also Leute: Der Poldi hat da schon recht!</P>

<p><FONT COLOR="#87CEFA"><i>Aber an der NoCover konnte man zu dieser Zeit noch den starken Zusammenhalt erkennen, der mitlerweile irgendwie verloren gegangen ist! Ich war immer besonders stolz darauf, einer so starken Gemeinschaft anzugeh&#246;ren! Jetzt bin ich aber immer noch am hoffen, dass sich die paar User zusammenraffen und 
wieder den Geist von einst zeigen. Nur leider wei&#223; ich auch, dass alle Aufrufe nach Beteiligung ins Leere gehen, so kann man also nur warten und hoffen, es ist ja noch nicht aller Tage Abend oder etwa doch schon?</i></font></P>

<p>Klar gibt der Amiga Markt nicht mehr soviel her wie noch vor einigen Jahren, aber was den Zusammenhalt bei der NoCover angeht: Davon bin ich inzwischen doch echt &#252;berrascht, wie gut es seit der &#220;bernahme gelaufen ist. Die User beteiligen sich aktiv an der NoCover und es kommen st&#228;ndig neue passive Mitglieder hinzu. Alleine der E-Mail Verteiler w&#228;chst st&#228;ndig an und das zeigt doch eindrucksvoll, dass auch heute noch Bedarf an einem Diskmag besteht. Und mit Rainer, Bernhard Murmann, Deiner und meiner Wenigkeit sind doch immerhin einige ehemalige Fireball / 4ever Leute an Bord un mit etwas Gl&#252;ck 
kommt auch noch der Rest in`s Boot. Also, die Gemeinschaft lebt ganz offensichtlich doch noch!</P>

<p><FONT COLOR="#87CEFA"><i>Dann m&#246;chte ich aber noch mein Lob an denjenigen aussprechen der die HTML-Version macht, im Moment f&#228;llt mir nicht ein wer das macht oder machst Du das auch? Die NoCover ist wirklich sehr gelungen, alles l&#228;&#223;t sich prima lesen und sieht sehr gut aus. Da macht sich doch der Vorteil einer Grafikkarte gut bemerkbar. Nicht aufgeben oder denken, dass sich keiner etwas daraus macht, das Feedback von mir hast Du schonmal!:-)</i></font></P>

<p>F&#252;r die HTML Version zeichnet sich im Grunde der Wolf aus, der mir auch heute noch viel Arbeit abnimmt. Ohne ihn w&#252;rde ich das alles unter Garantie nicht schaffen - das steht fest. Ich bekomme nur die Artikel und f&#252;ge diese zu einer NoCover zusammen. Wenn alles fertig ist geht noch alles zur Endkontrolle zu einem User namens Rainer Wrieden, der die NoCover auf Fehler und dergleichen kontrolliert, die mir entgangen sind. Das ist auch ein unsch&#228;tzbarer Vorteil und deswegen Dank an dieser Stelle auch an Rainer Wrieden. Das Layout finde ich pers&#246;nlich so wie es momentan gibt auch v&#246;llig okay, auch wenn es nat&#252;rlich immer Kleinigkeiten zu verbessern gibt. Ich halte allerdings nix von grafischen Orgien, denn die NoCover soll ja nach wie vor auf Diskette passen und auch per E-Mail zu empfangen sein. Das sind 2-3 MB dann das absolute Maximum. Vergessen darf man nie: Die NoCover soll vor allem gut lesbar sein und das ist - so denke ich - mit dem aktuellen Layout gut bewerkstelligt.</P>

<p><FONT COLOR="#87CEFA"><i>Kannst Du mir sagen wo ich noch die Info-CD bekommen kann, erst gab es sie ja &#252;ber die NoCover, aber jetzt? Zum Andreas schickte ich schonmal Bargeld, aber nach ein paar Wochen kam der Brief und die Kohle zur&#252;ck. Ich glaube zu der Zeit war der Andreas im Krankenhaus, kann es aber nicht beschw&#246;ren! W
as kostet die CD und sind dort wirklich alle NoCover&#180;s drauf?</i></font></P>

<p>Die Info CD macht weiterhin der Andreas. Meines Wissens nach sollten da alle NC`s drauf sein. Der Kostenpunkt betrug seinerzeit 15 DM - sollten also inzwischen rund 8 Euro oder so sein. Am besten w&#228;re es, Du wendest Dich an Andreas, da ich leider keinen Brenner geschweige denn eine aktuelle Info CD 
da habe. Da aber alles mit Andreas diesbezgl. abgekl&#228;rt ist, sollte es kein Problem sein, an eine aktuelle Info CD zu kommen. Aus eigener Erfahrung kann ich sagen, dass es duchaus Spass machen kann, auch mal in den &#228;lteren Ausgaben der NoCover zu st&#246;bern. Ich hatte daran jede Menge Spass und man bekommt zudem noch einige Anregungen f&#252;r die aktuelle Ausgabe. Wenn man sich mal die Ausgaben 30-40 anguckt, wei&#223; man, wo ich langfristig mit der HTML NoCover hin m&#246;chte.</P>

<p><FONT COLOR="#87CEFA"><i>Noch etwas zu meinen Bindestrichen: Sollte ich es lassen die W&#246;rter am Zeilenende zu trennen und am Zeilenende einfach weiterschreiben? Und wie mache ich es dann wenn ich m&#246;chte, dass an einer bestimmten Stelle eine freie Zeile kommt? Manche Bindestriche haben aber auch den Sinn zu zeigen, dass die 
W&#246;rter zusammen geh&#246;ren, so zum Beispiel bei: CD-ROM-LW oder bei EXT. HD-LW... Ich m&#246;chte nur, dass Du nicht zu viel Arbeit mit meinem Gekrackel hast!</i></font></P>


<p>Trennungsstriche bitte unterlassen, freie Zeilen einfach ganz normal weiterhin machen. Trennungsstriche f&#252;r Worte wie CD-Rom sind v&#246;llig okay. Aber vielleicht m&#246;chte der Wolf dazu auch noch was sagen, da er ja die HTML Umsetzung i.d.R. vornimmt, da mir daf&#252;r einfach nicht gen&#252;gend Zeit zur Verf&#252;gung steht. </P>

<p><FONT COLOR="#87CEFA"><i>Es macht Dir doch hoffentlich noch Spa&#223; die NoCover zu machen?! In einer Ausgabe las ich, dass Du nur weitermachen m&#246;chtest wenn es genug Beteiligung gibt, wie sieht es zur Zeit aus, beteiligen sich wieder genug Leute? Wir wollen es doch hoffen, sonst ist das letzte Mag. auch noch weg und das w&#228;re schade!!!</i></font></P>

<p>Momentan l&#228;uft es eigentlich recht gut, was man auch an der Beteiligung an der aktuellen Ausgabe erahnen kann. Klar, zufrieden ist man nie so ganz, aber es sah auch durchaus schonmal schlechter aus. Gerade in der nahen Vergangenheit gab es schon massiv schlechtere Ausgaben. Vorerst habe ich noch gen&#252;gend Motivation weiterzumachen, zumal ich ja von diversen Usern tatkr&#228;ftig unterst&#252;tzt werden. Und das betrifft auch den freundlichen Diskabo Menschen und alle User, die Artikel einreichen. Also, ich bleibe solange bei der NoCover, solange ich unterst&#252;tzt werde. Und momentan sieht es so aus, als ob
es zweiter fr&#252;hling f&#252;r die NC wieder m&#246;glich ist!</P>

<p>See ya!</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
