<html>
<head>
<title>Poldi stellt sich vor</title>
</head>
<body background="poldibg1.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>Vorstellung Poldi</b></font></p>

<p><img src="mitglieder/poldi1.jpg" width=122 heigth=190 alt="Poldi"
align=right> Erst einmal gibt es von mir ein gro&szlig;es HALLO an alle
NoCover Mitglieder und die anderen die leider nur lesen und keine Lust
haben etwas zu schreiben! Besonders m&ouml;chte ich alle gr&uuml;&szlig;en
die ich schon durch andere Magazine kenne, das w&auml;re in diesem Fall der
Bernhard M. und der Rainer T., und ich hoffe, dass wir uns sehr oft lesen
und schreiben k&ouml;nnen:-))) </p>

<p>Jetzt aber zu meinereiner: <br> Den ersten Amiga hatte ich mir 1991
f&uuml;r 800,- gekauft, ich h&auml;tte nicht gedacht das ein Computer so
gut sein kann. Diesen Amiga r&uuml;stete ich in keinster weise auf, dennoch
ging er einige Zeit sp&auml;ter kaputt. Zu dieser Zeit hatte ich alle
H&auml;nde voll zu tun, so dass ich erst einmal keinen neuen Amiga kaufte,
aber ich redete immer vom Amiga, dass ich mir wieder einen kaufen werde und
wie geil er doch ist. </p>

<p>1995 ungef. zog ich leider um und nahm mir vor so schnell wie es geht
einen Amiga aufzutreiben, nur ein paar Monate sp&auml;ter kam ich dann an
einen gebrauchten Amiga 500, den ich dann endlich aufr&uuml;stete und durch
die viele Aufr&uuml;sterei wieder zerst&ouml;rte, der Versuch ein
2MB-Chip-Mem-Modul einzubauen war doch zuviel! </p>

<p>Bis Februar 1998 schaffte ich es zwei 500er und einen 1200er zu
zerst&ouml;ren, einen 500er verschenkte ich noch, da ich ja endlich den
Infinitiv hatte. Diesen Amiga r&uuml;ste ich jetzt schon dauernd auf, ein
Ende der Aufr&uuml;stung ist nicht in Sicht:-) </p>

<p>Mitlerweile bin ich so abh&auml;ngig vom Amiga, dass ich es kaum einen
Tag aushalte ohne ihn zu nutzen, auch gehe ich allen Leuten, die ich kenne,
total auf die Nerven mit dem Gelaber &uuml;ber den Amiga, aber leider gibt
es zu viele PCler die immer glauben, dass der PC das Beste ist was es gibt
und sie ignorieren jeden, der gute Argumente f&uuml;r einen anderen
Computer hat. Sogar die Kinder glauben, dass der PC das Geilste auf der
Welt ist, sie geben es auch nicht zu wenn ich denen die Nachteile des PC´s
aufz&auml;hle und sie sagen, dass der Amiga nur ein alter Mistkasten
w&auml;re, mit dem man nichts machen k&ouml;nne, nur weil sie den
unaufger&uuml;steten A500 kennen. Haben die ein Gl&uuml;ck, dass ich Kinder
nicht schlage:-) Aber wenn diese PCler einen Rat brauchen, kommen sie zu
mir und machen so als w&uuml;rde denen der Amiga gefallen, da sie wissen,
dass ich keinem, der &uuml;ber den Amiga l&auml;stert, helfen werde! Es ist
eben schlimm, dass es immer Leute gibt die &uuml;ber Sachen l&auml;stern
die sie garnicht kennen. </p>

<p>Naja, das hier soll Euch nur zeigen, dass ich den Amiga absolut geil
finde und ihn auch nie hergeben w&uuml;rde, zwar interessiert mich der PC
auch, und zwar in erster Linie die Hardware und das Überangebot an Spiele,
aber bis jetzt reicht mir noch der Amiga. Ich w&uuml;rde nur umsteigen,
wenn mein Amiga einen Totalschaden haben sollte, da mir ein neuer Amiga,
mit der Ausstattung wie ich sie jetzt habe, doch zu teuer w&auml;re! (Wir
wollen es nicht heraufbeschw&ouml;ren.) Aber ich w&uuml;rde versuchen einen
PC ohne Windows XL zu bekommen, da ich finde, dass das XL aussieht als ob
die Teletuppies im Drogenrausch mit Farbe gespielt h&auml;tten:-) </p>
 
<p>Was ich am Amiga gerne mache? Na alles was geht, ich spiele gern, mache
auch sehr gerne AmigaGuide-Sachen und teste alle Programme die ich in die
H&auml;nde bekomme, am liebsten nat&uuml;rlich PD-Zeugs und Patches, die
Workbench kann ja nicht geil genug aussehen! Also, die
Workbenchoberfl&auml;che ist mir sehr wichtig, daran sieht man meinen
Ordnungstick:-( Zeige mir Deine Workbench und ich sage Dir, wer Du
bist:-))) Ansonsten lese ich noch gerne, alles was &uuml;ber den Amiga
geschrieben wird oder geschrieben wurde, auch PC-Zeitungen lese ich, am
liebsten die PC- Games-Hardware, da, und in der PC-Games, ist der Rainer
Rosshirt drin, den kennt Ihr doch bestimmt noch von der Amiga Games? Wenn
mal einer von Euch alte Amiga-Zeitschriften verkaufen will, sage er mir
Bescheid, mit Angabe der Ausgabenummer. </p>

<p>Jetzt f&auml;llt mir leider nichts besonderes mehr ein, wenn aber einer
etwas fragen m&ouml;chte, kann er das ruhig mal machen, Antworten gibt es
in jedem Fall! </p>

<p> Macht es gut: &nbsp; &nbsp; &nbsp; Poldi </p>
</td></tr></table>
<br>
</body>
</html>
