<html>
<head>
<title>Poldis Leserbrief an Kilian</title>
</head>
<body background="poldibg2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Hallo Kilian,</b></font></p>

<p>muss man sich wirklich 100%ig an die SchreiberRichtlinien halten oder
kann man es auch etwas anders schreiben? Es ist extrem schwer f&uuml;r mich
ohne Schimpfw&ouml;rter zu schreiben:-))) (Das soll ein Witz gewesen sein!)
<br> Aber um seine Wut auszudr&uuml;cken und den Lesern zu zeigen, dass es
einem Ernst ist wenn man seine Meinung &auml;u&szlig;ert, braucht man hin
und wieder ein paar W&ouml;rter die sonst (hoffentlich) nicht so oft im
Gebrauch sind! </p>

<p>Es steht zwar in einigen Magazinen, dass die Texte unver&auml;ndert in
das Magazin kommen, da der Autor auch das Copyright hat, aber hiermit
m&ouml;chte ich Dir sagen, dass Du meine Texte ver&auml;ndern darfst, vor
allem dann, wenn Dich meine Schimpfw&ouml;rter nerven. Bevor sich die Leser
bei Dir beschweren, kannst Du ruhig ein "Piiiip" in meine Texte setzen :-)
Den Sinn meiner Texte kann man sowieso nicht mit einem Piiiip
ver&auml;ndern, da meine Texte allesamt eh sinnlos sind, geht man von dem
Feedback aus, das ich bisher erhalten habe! :-( <br> Was mich erinnert, das
mit dem Feedback muss ich bei mir selbst auch einmal &auml;ndern, anderen
zu schreiben, dass einem deren Texte gefallen haben, ist sehr wichtig! An
alle: Eure Texte sind voll in Ordnung, es d&uuml;rften nur mehr werden, vor
allem sollten sie sich mehr um den Amiga drehen!:-) </p>

<p>Da las ich Dein Editorial in der Ausgabe 90 und war &uuml;berzeugt
davon, dass meine Aussagen, bez&uuml;glich der Fragen und Antworten der
User, genau richtig waren. Seit langem habe auch ich bemerkt, dass keiner
mehr auf Fragen reagiert, da jeder nur denkt: "Es wird schon irgend einer
antworten, also brauche ich nicht schreiben und mir Gedanken machen!" Genau
das ist der Fehler an der Amiga-Gemeinde, keiner will sich mehr f&uuml;r
andere bem&uuml;hen, jeder denkt nur an sich und der Amigamarkt geht in die
Knie. Als die NoCover noch mit MagneticPages gemacht wurde, gab es zu einer
Frage gleich 10 Antworten, da konnte man sich die Richtige aussuchen! </p>

<p>1996 fand ich das erste mal die NoCover auf den Amiga Games CD´s, das
war echt eine geile Zeit, zwar machte ich mir dauernd Gedanken &uuml;ber
einen Beitritt in die NoCover, aber es war mir dann doch immer zu
umst&auml;ndlich und so fand sich ein paar Jahre sp&auml;ter eine bessere
Alternative, die nichts kostete. Aber an der NoCover konnte man zu dieser
Zeit noch den starken Zusammenhalt erkennen, der mitlerweile irgendwie
verloren gegangen ist! Ich war immer besonders stolz darauf, einer so
starken Gemeinschaft anzugeh&ouml;ren! Jetzt bin ich aber immer noch am
hoffen, dass sich die paar User zusammenraffen und wieder den Geist von
einst zeigen. Nur leider wei&szlig; ich auch, dass alle Aufrufe nach
Beteiligung ins Leere gehen, so kann man also nur warten und hoffen, es ist
ja noch nicht aller Tage Abend oder etwa doch schon? </p>

<p>Dann m&ouml;chte ich aber noch mein Lob an denjenigen aussprechen der
die HTML-Version macht, im Moment f&auml;llt mir nicht ein wer das macht
oder machst Du das auch? Die NoCover ist wirklich sehr gelungen, alles
l&auml;&szlig;t sich prima lesen und sieht sehr gut aus. Da macht sich doch
der Vorteil einer Grafikkarte gut bemerkbar. Nicht aufgeben oder denken,
dass sich keiner etwas daraus macht, das Feedback von mir hast Du
schonmal!:-) </p>

<p>Oh, da gibt es eine Frage, ohne geht es bei mir leider nicht. Kannst Du
mir sagen wo ich noch die Info-CD bekommen kann, erst gab es sie ja
&uuml;ber die NoCover, aber jetzt? Zum Andreas schickte ich schonmal
Bargeld, aber nach ein paar Wochen kam der Brief und die Kohle zur&uuml;ck.
Ich glaube zu der Zeit war der Andreas im Krankenhaus, kann es aber nicht
beschw&ouml;ren! Was kostet die CD und sind dort wirklich alle NoCover´s
drauf? </p>

<p>Noch etwas zu meinen Bindestrichen: Sollte ich es lassen die W&ouml;rter
am Zeilenende zu trennen und am Zeilenende einfach weiterschreiben? Und wie
mache ich es dann wenn ich m&ouml;chte, dass an einer bestimmten Stelle
eine freie Zeile kommt? Manche Bindestriche haben aber auch den Sinn zu
zeigen, dass die W&ouml;rter zusammen geh&ouml;ren, so zum Beispiel bei:
CD-ROM-LW oder bei EXT. HD-LW... Ich m&ouml;chte nur, dass Du nicht zu viel
Arbeit mit meinem Gekrackel hast! </p>

<p>Es macht Dir doch hoffentlich noch Spa&szlig; die NoCover zu machen?! In
einer Ausgabe las ich, dass Du nur weitermachen m&ouml;chtest wenn es genug
Beteiligung gibt, wie sieht es zur Zeit aus, beteiligen sich wieder genug
Leute? Wir wollen es doch hoffen, sonst ist das letzte Mag. auch noch weg
und das w&auml;re schade!!! </p>

<p>Jetzt bin ich fertig, viel Spa&szlig; noch, alles gute und viel Erfolg:
&nbsp; &nbsp; &nbsp; Poldi </p>

 <p>P.S.: Wann ist immer der Einsendeschlu&szlig; f&uuml;r die Texte? </p>
</td></tr></table>
<br>
</body>
</html>
