<html>
<head>
<title>Poldis Leserbrief an Murmel</title>
</head>
<body background="poldibg2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Hallo Murmel,</b></font></p>

<p>na wie geht es Dir denn so? Ich bin aber ganz sch&ouml;n
anh&auml;nglich, es hat also doch nicht so lange gedauert wie ich erst
dachte und deshalb bin ich jetzt auch hier. Erst sollte es noch etwas
dauern bis ich mich bei der NoCover melde, aber so wie es derzeit auf dem
AmigaMarkt aussieht, ist jeder Amiganer der etwas schreibt wichtig, damit
alle anderen sehen, dass wir doch noch zusammenhalten! </p>

<p>Leider hat es mit dem Starmag nicht sollen sein, das war der beste
Beweis, dass es um den AmigaMarkt nicht gut steht, kaum einer hat sich
beteiligt, nur einer machte bei den Gewinnspielen mit:-) und keiner hat auf
Fragen reagiert! Das alles muss Dich doch ganz sch&ouml;n genervt haben,
aber zumindest hast Du dem Amiga nicht den R&uuml;cken gekehrt, was manch
anderer bestimmt gemacht h&auml;tte! Die Hoffnung auf Beteiligungen von
anderen (neuen) Amiganern habe ich aber nie aufgegeben und das werde ich
auch weiterhin nicht aufgeben. Nur werden wir es nicht schaffen die
Amiga-Gemeinde zu vergr&ouml;&szlig;ern, selbst wenn jemand einen Amiga
kaufen wollte, wird er/sie daran scheitern, dass er/sie keinen H&auml;ndler
findet, da ein neuer User auch keine Zeitschriften mit Anzeigen finden
kann!!! Die einzigen neuen User k&ouml;nnten die sein, die jemand anderem
einen alten Amiga abkauften, aber ob die dem Amiga-Markt etwas bringen,
wage ich zu bezweifeln. </p>

<p>Wo sind denn jetzt die neuen Amigas? Und selbst wenn es neue Amigas
geben wird, frage ich mich wo und wann es daf&uuml;r Werbung geben soll,
denn die Werbung ist das wichtigste, egal wof&uuml;r Werbung gemacht wird,
aber Produkte die beworben werden, werden auch verkauft. Oder wollen die
von Amiga Inc. nur an alte Amiganer den neuen Amiga verkaufen? Selbst das
PPC-Board von Elbox soll nur ein Witz gewesen sein, also frage ich mich
schon dauernd was hier eigentlich abgeht, will uns denn jeder nur
verarschen, l&auml;uft da irgendwo einer umher der die Firmen daf&uuml;r
bezahlt, damit sie uns auf den Arm nehmen und wir dann endlich den
AmigaMarkt verlassen? Aber ich werde den Amiga nicht im Stich lassen,
daf&uuml;r h&auml;nge ich viel zu sehr an ihm/ihr. Wenn es das PPC-Board
von Elbox nicht geben sollte, dann muss ich mir eben das G-Rex Board
kaufen, mit diesem Gedanken spiele ich schon seit einiger Zeit, solange ich
den anderen PCI-Kram weiter verwenden kann, ist es mir egal. Vor allem
bekommt man das G-Rex schon f&uuml;r 290 DM und die Fernbedienung mit Skins
sieht von DCE besser aus und hat mehr Funktionen. Zum Gl&uuml;ck habe ich
bei Dir das PPC-Board gewonnen, so das ich die gro&szlig;e Auswahl habe,
dann hat das PPCDing wenigstens einen Sinn:-) Es gibt noch mehr Vorteile
f&uuml;r das G-Rex, z.B. hat es einen PCI-Port mehr und man kann die
Grafikkarte schon in der Early-Startup (zumindest im Menu der PPC)
ausw&auml;hlen und aktivieren und vielleicht wird es von DCE die PPC-Karte
geben, die auch noch einen AGP-Steckplatz und noch mehr andere
Anschl&uuml;sse hat,(Da werden aber einige User hoffentlich zufrieden
sein), wenn es diese PPC-Karte von DCE wirklich geben sollte, steht es 111%
fest, dass ich auf das G-Rex umsteigen werde!!! Das soll jetzt kein
Wiederspruch sein, ich halte auch weiterhin zu Elbox und bleibe auch bei
der Meinung das Elbox es erst erm&ouml;glichten, dass es endlich PCI-Boards
auf dem Amiga gibt (Bin schon ganz besessen von dem PCI Zeugs:-)) Du
wunderst Dich vielleicht, dass ich das hier an Dich schreibe, aber ich
wusste nicht wo ich es sonst h&auml;tte schreiben sollen, nat&uuml;rlich
kann auch jedes andere NoCoverMitglied darauf reagieren und seine Meinung
dar&uuml;ber verk&uuml;nden, das w&auml;re mir sehr recht! </p>

<p>Wie l&auml;uft es denn mit Deinem Mac? Funktioniert alles so wie Du es
wolltest? Hast Du darauf das MacOS 10? Das w&uuml;rde mich auch mal
interessieren, ob das MacOS 10 besser ist als seine Vorg&auml;nger,
langsamer soll es ja sein! Wenn das Prog. IFusion mal billiger werden
w&uuml;rde, dann w&uuml;rde ich es kaufen, nur ungef. 400,- ist mir viel zu
teuer, 100,- w&auml;re in Ordnung:-) Junge, Junge, was habe ich immer
Fragen auf Lager, kein Wunder, dass die Leute laut schreiend fl&uuml;chten,
wenn sie mich um die Ecke kommen sehen;-) Aber von Dir bekommt wann
wenigstens auch Antworten, im Gegensatz zu vielen anderen, die immer
denken, dass ja vieleicht jemand anderes antwortet, so kommt es dann, dass
der Fragende ein Jahr oder f&uuml;r immer auf Antworten warten kann und der
Fragende wird es sich dann zweimal &uuml;berlegen, ob er nochmal etwas
schreibt !!! </p>

<p>F&uuml;r dieses mal mache ich Schlu&szlig; und w&uuml;nsche Dir alles gute:
&nbsp; &nbsp; &nbsp; Poldi </p>

</td></tr></table>
<br>
</body>
</html>
