<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Geschichten</title>
<meta name="author"         content="Karl-Heinz Bader">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

</head>

<body background="../bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
<a name="top"></a>

<table width="95%" align="center" border="0" cellspacing="0" cellpadding="4" summary="Text">
<tr>
<td colspan="4"><h1 align="center">Kleine Geschichten</h1></td>
</tr>
<tr>
<td height="100" colspan="2">
<div align="center"><img src="charly.jpg" width="67" height="75" border="1" alt="meiner einer"></div>
</td></tr>
<tr>
<td height="100" width="793"> <br>
<div align="center">
<h3>gefunden von Charly</h3>
&#149;<a href="#a">Autohaus Schulze</a>&#149;<br>
&#149;<a href="#a1">Gerichtsverhandlung</a>&#149;<br>
&#149;<a href="#a2">Ferrero</a>&#149;
</div>
</td></tr>
</table>
<br>
<br>
<br><a name="a"></a>
<table width="95%" bgcolor="#ddffff" align="center" border="1" cellspacing="4" cellpadding="50" summary="Text">
<tr><td>

<p align="center"> Autohaus Schulze </p>
<p>


     Im Autohaus Schulze &amp; Co. klingelt das Telefon.<br>
     Ein Kunde (K) ruft an.                         <br>
     Herr Huber (H) ein Verk&auml;ufer, redet pers&ouml;nlich mit ihm.<br><br>

     H: Autohaus Schulze, Guten Tag.<br><br>

     K: Ja, guten Tach, M&uuml;ller hier. Ich habe doch da dieses Auto von Ihnen... <br><br>

     H: Jaaa...                              <br><br>

     K: Es geht nicht.                       <br><br>

     H: Was hei&szlig;t es geht nicht? Springt er nicht an?<br><br>

     K: Hmm, was meinen Sie denn damit? Es f&auml;hrt einfach nicht.<br><br>

     H: Naja, das kann ja viele Gr&uuml;nde haben. L&auml;uft der Motor? <br><br>

     K: Woran sieht man das?                                   <br><br>

     H: Nun, das kann man am Motorenger&auml;usch h&ouml;ren. Und aus dem Auspuff<br>
&nbsp; &nbsp;&nbsp; m&uuml;ssten dann die Abgase kommen. K&ouml;nnen Sie die sehen. <br><br>

     K: Wo ist denn der Auspuff?                              <br><br>

     H: Hinten.                                               <br><br>

     K: Nee, da sehe ich nix. Und h&ouml;ren tue ich auch nix.     <br><br>


     H: Na, dann stecke n Sie doch jetzt mal den Schl&uuml;ssel in <br>
&nbsp; &nbsp;&nbsp; das Z&uuml;ndschloss und drehen sie ihn herum.             <br><br>

     K: Oh je, schon wieder ein neuer Begriff...              <br><br>

     H: Das kleine, verchromte Loch rechts neben dem Lenkrad. <br>

&nbsp; &nbsp;&nbsp;        Wissen Sie, wo das Lenkrad ist? <br><br>

     K: Klar doch, meinen Sie ich bin bl&ouml;d? Moment... &ouml;ttl &ouml;ttl &ouml;ttl &ouml;ttl...<br>
&nbsp; &nbsp;&nbsp;        ist das das Ger&auml;usch?                                      <br><br>

     H: Nein, das ist der Anlasser. Hmm,scheint nicht anzuspringen.<br>
&nbsp; &nbsp;&nbsp;        Ist denn Benzin drin?                                      <br><br>

     K: Keine Ahnung. Sie haben mir das Auto doch verkauft, was    <br>
&nbsp; &nbsp;&nbsp;        wei&szlig; ich was da alles drin ist.                            <br><br>

     H: Da gibt es hinter dem Lenkrad eine Anzeige daf&uuml;r.          <br><br>

     K: Ohje, da gibt es so viele Anzeigen... welche denn? Die, bei<br>
&nbsp; &nbsp;&nbsp;        der die Skala bis 220 geht? Oder die mit 8000?            <br><br>

     H: Nein, das sind der Tacho und der Drehzahlmesser. Ein kleineres<br>
&nbsp; &nbsp;&nbsp;        Instrument, unterhalb des Tachos.                             <br><br>

     K: Dazwischen ist noch ein kleineres, allerdings oberhalb. Das hat gleich<br>
&nbsp; &nbsp;&nbsp;        zwei Zeiger. Einer steht auf 10, der kleinere, und der gr&ouml;&szlig;ere auf 1. <br><br>

     H: Das ist die Uhr. UNTEN!!                                              <br><br>

     K: Ah ja, hier ist noch was... steht ganz unten auf 50 Grad.             <br><br>

     H: Das ist das K&uuml;hlwasserthermometer. Rechts daneben.                    <br><br>

     K: Ah, ja hier. Das mit der kleinen Zapfs&auml;ule?                           <br><br>

     H: Ja, genau. Was zeigt es an?                                           <br><br>

     K: Steht auf 0.                                                          <br><br>

     H: Na also, da haben wir schon das Problem. Ist kein Benzin drin.        <br><br>

     K: Hee, h&ouml;ren Sie mal, ich habe 45.000 Mark f&uuml;r das Auto gel&ouml;hnt.        <br>
&nbsp; &nbsp;&nbsp;        Daf&uuml;r haben Sie mir versprochen, dass alles drin ist, was es f&uuml;r      <br>
&nbsp; &nbsp;&nbsp;        das Modell &uuml;berhaupt gibt.                                            <br>
&nbsp; &nbsp;&nbsp;        Und dass mehr drin ist als im Auto meines Nachbarn.                   <br><br>

     H: Ja, das haben Sie ja auch alles drin... Klimaanlage,                  <br>
&nbsp; &nbsp;&nbsp;        Schiebedach, Ledersitze.                                              <br><br>

     K: Und dieses 'Benzin'? Wird das noch eingebaut? Was kostet denn das     <br>
&nbsp; &nbsp;&nbsp;        schon wieder? Dauert die Montage sehr lange?                          <br><br>

     H: Das bekommen Sie an der Tankstelle. Das ist der Betriebsstoff,        <br>
&nbsp; &nbsp;&nbsp;        sonst f&auml;hrt es nat&uuml;rlich nicht.                                       <br><br>

     K: Das hat mir aber beim Verkaufsgespr&auml;ch keiner gesagt!                 <br><br>

     H: So etwas setzen wir voraus.                                           <br><br>

     K: Aber... ich bin doch Fahranf&auml;nger, woher soll ich denn das wissen?    <br>
&nbsp; &nbsp;&nbsp;        Stand auch nicht in Ihrem bunten Prospekt! Wissen Sie was?            <br>
&nbsp; &nbsp;&nbsp;        Holen Sie Ihr tolles Auto wieder ab, ich fahre weiterhin mit dem      <br>
&nbsp; &nbsp;&nbsp;        Fahrrad, da wei&szlig; ich wenigstens, dass es geht.                        <br>
                                                                              <br><br>
     &auml;hnlichkeiten mit bestehenden Firmen oder Personen sind rein zuf&auml;llig.
</p><br>
</td></tr>
</table>
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&#149; <a href="#top">zum Anfang</a>&#149;
<br>
<br>
<a name="a1"></a>
<table width="95%" bgcolor="#dddfff" align="center" border="1" cellspacing="4" cellpadding="40" summary="Text">
<tr><td>

<p align="center"> Die Gerichtsverhandlung </p><p>

Richter: Wie hei&szlig;en Sie?  <br><br>

Angeklagter: Anton W&uuml;rmer <br><br>

R: Was sind Sie?          <br><br>

A: Suspensorium           <br><br>

R: Unterlassen Sie solche Witze!<br><br>

A: Herr Amtsrichter, ich wollte mich nur fein ausdr&uuml;cken.  Ich bin<br>
&nbsp; &nbsp;&nbsp;   Sacktr&auml;ger bei der Firma Biermann.          <br><br>

R: Was ist Ihr Vater?                                             <br><br>

A: Alles, was auf den Tisch kommt.                                <br><br>

R: Ich meine, was Ihr Vater von Beruf ist?                        <br><br>

A: Bundesbahnwagenb&uuml;chsenschmierer.                               <br><br>

R: Die Lina Neuwert will von Ihnen ein Kind haben?                <br><br>

A: Wird gemacht, wo wohnt das M&auml;dchen?                            <br><br>

R: Lassen Sie die Witze. Bekennen Sie sich der Vaterschaft schuldig?<br><br>

A: Ja.                                                              <br><br>

R: Wie steht es mit der Bezahlung?                                  <br><br>

A: Daf&uuml;r nehme ich kein Geld, sowas mache ich umsonst.              <br><br>

R: Haben Sie die Lina Neuwert allein gebraucht?                     <br><br>

A: Nein, auch ihre Schwester.                                       <br><br>

R: Sie sind ein Schwein! Zum dritten Mal stehen Sie wegen  Alimente <br>
&nbsp; &nbsp;&nbsp;   vor Gericht. Nehmen Sie sich doch eine Frau!  <br><br>

A: Das habe ich getan, da kam ihr Mann dazu!                        <br><br>

R. Vernehmen wir die Zeugin: Lina Neuwert, warum kommen Sie  so sp&auml;t?<br>
&nbsp; &nbsp;&nbsp;   Wann haben Sie die Ladung erhalten?            <br><br>

Zeugin: In der Nacht vom 1. zum 2. Oktober.                          <br><br>

R: Sie verstehen mich falsch, ich meine die Vorladung.               <br><br>

Z: Vier Wochen fr&uuml;her, bei M&uuml;llers auf der Kegelbahn.                <br><br>

R: Sie verstehen mich nicht. Was ist Ihr Beruf?                      <br><br>

Z. Dienstm&auml;dchen.                                                    <br><br>

R: Ihr Alter?                                                        <br><br>

Z: Mein Alter ist Schneider.                                         <br><br>

R: Quatsch, ich meine, wie alt sind Sie?                             <br><br>

Z: 17 Jahre.                                                         <br><br>

R: Also Fr&auml;ulein Neuwert, wie hatte die Sache mit dem Angeklagten gelegen?<br><br>

Z: Wir haben gestanden.                                                   <br><br>

R: Machte der Angeklagte von vornherein den Eindruck...                   <br><br>

Z: Nein, von hinten im Stehen...                                          <br><br>

R: Lassen Sie mich doch aussprechen. Ich meine, machte der                <br>
&nbsp; &nbsp;&nbsp;   Angeklagte von vornherein den Eindruck, da&szlig; er Sie  heiraten wollte?<br><br>

Z: Das wei&szlig; ich nicht.                                           <br><br>

R: Fr&auml;ulein Neuwert, haben Sie sich gewehrt?                     <br><br>

Z: Das konnte ich nicht.                                         <br><br>

R: Wieso nicht?                                                  <br><br>

Z: Mit der einen Hand mu&szlig;te ich mich am Zaun festhalten, und     <br>
&nbsp; &nbsp;&nbsp;   mit der anderen den Rock hochhalten.       <br><br>

Die Verhandlung mu&szlig;te wegen &uuml;berlautem Gel&auml;chter der Zuschauer unterbrochen werden.                                             <br><br>

</p><br>

</td></tr>
</table>
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&#149; <a href="#top">zum Anfang</a>&#149;
<br>
<br>
<a name="a2"></a>
<table width="95%" bgcolor="#ddeeff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>

<p>
Verehrter Herr Ferrero!<br><br>

Ich m&ouml;chte mich bei Ihnen beklagen!
Nein, kein Wort gegen Ihre Produkte. M&ouml;gen Sie auch Schweineblut bei
der Herstellung ihrer kakaohaltigen Glasuren verwenden, oder
Rindertalg, was solls. Ihre Hanutas sind knusprig, die Milchschnitten
sogar bei F&uuml;hrungskr&auml;ften beliebt und die Duplos knackig.<br><br>

Es geht um Ihre Werbeagentur, deren neuestes Machwerk ich gerade eben
im RTL-Fernsehen bewundern durfte. Sie wissen schon - diese Duplo-Serie.
Die, die immer diese (w&uuml;rg) netten, herzerfrischenden, jungen Leute in
den Vordergrund stellt, die aussehen, als w&auml;ren sie die diesj&auml;hrigen
Gewinner des "Jugend forscht" - Wettbewerbs in der Sparte
L&auml;ngenmessung am Schokoriegel und uns seit vielen Jahren mit der
frappierenden Aussage des "vielleicht L&auml;ngsten der Welt" begl&uuml;cken. <br><br>

Einen dilettantischeren und st&uuml;mperhafteren Spot finden Sie heutzutage
nur noch in der Waschmittelbranche. Ist Ihre Zielgruppe wirklich so
bl&ouml;de, wie das Drehbuch? Glauben Sie, durch jahrelange Laufzeiten des
gleichen Klischees w&uuml;rde ein Kultfilm draus?
                                                                    <br><br>
In einem nicht so beh&auml;bigen Land wie dem unseren, einem Staat mit
hervorragenden Rechtsanw&auml;lten und dubioser Rechtssprechung h&auml;tten Sie
schon l&auml;ngst Schadensersatz in Millionenh&ouml;he abdr&uuml;cken m&uuml;ssen. Wegen
wiederholter K&ouml;rperverletzung von Fernsehkunden.                    <br><br>

Ihr erster Spot, in dem der pubertierende Knabe seine zickige
Yuppiemieze durch Entfernen der Verpackung t&auml;uscht und ihr den
Schokoriegel als angebliche Praline pr&auml;sentiert, war ja noch ganz
witzig. Wenigstens beim ersten Mal. Hach, haben wir gelacht als der
kleine Bruder hereingeschneit kam, und das Komplott durch ein
unschuldiges &quot;Wo sind die Duplos?&quot; aufdeckte! Wir haben uns tagelang
gefragt, ob er sie jetzt noch (F&uuml;llstoff) durfte oder nicht. Naja,
sp&auml;testens beim 153. Mal wurde es schon ein bi&szlig;chen langweilig, weil
ja der &uuml;berraschungseffekt weg war.                                 <br><br>

Danach wurde es waaahnsinnig progressiv! Geradezu ein High-Tech
Adventure haben Sie uns pr&auml;sentiert, die kleine galaktische
Prinzessin, die sich beim Anblick der Knusperware in den irdischen
&uuml;berbringer, ebenfalls ein pubertierender Jugendlicher mit einem
Daniel D&uuml;sentrieb - Komplex, verknallt. Der kleine Roboter, erst beim
120. Mal als Kopie des legend&auml;ren R2D2 zu erkennen, wie putzig! Delta
Ufo Pluto Omega! Auch ein kleines Bonmot f&uuml;r den Kryptographen haben
Sie nicht vergessen. Tja, au&szlig;er den Liebhabern von kleinen
Prinzessinnen schaut heute auch niemand mehr hin.                   <br><br>

Nun ist endlich die dritte Staffel da! Im Rahmen der
P&auml;dophilendiskussion haben Sie weise vorgesorgt und die kleine
Prinzessin durch eine &auml;ltere, wenn nicht gar schon verweste Dame
ersetzt. Das alte Schlo&szlig;, der originelle Diener, die mutige
Pfadfindertruppe, bestehend aus pubertierenden Jugendlichen, ohne
Scheu und Respekt vor Alter und Spuk! Wahrhaft gruselig! Stephen King
h&auml;tte es nicht besser machen k&ouml;nnen!                                <br><br>


Und das soll ich ich mir nun die n&auml;chsten zwei Jahre lang anschauen?<br><br>

NEIN DANKE!                                                         <br><br>

Ich verbleibe mit den vielleicht l&auml;ngsten Gr&uuml;&szlig;en der Welt           <br><br>


Chris
</p><br>

</td></tr>
</table>
<br>
<table width="95%" align="center" summary="Text">
<Tr><td>
&#149; <a href="#top">zum Anfang</a>&#149;
</tr>
<tr><td>
Sch&ouml;ne Gr&uuml;&szlig;e aus Hannover von<br>
<br>
<H3><i> Charly </i></H3>
</tr></table>
<a name="a8"></a>
<table align="center" bgcolor="#ddeeff" border="6" width=95% cellspacing=0 cellpadding="1" summary="Autor">
<tr><td align="center">Autor:<a href="mitglieder/bader.html">Charly Bader</a>&nbsp;
Mail:<a href="mailto:charly-ham@t-online.de">charly-ham@t-online.de</a>&nbsp;
Web:<a href="http://charly-ham.bei.t-online.de/">http://charly-ham.bei.t-online.de/</a></td>
</tr>
</table>

</body>
</html>
