<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat etwas gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>Kalenderblatt</b></font></p>

<p>Alle wollen hier in der NoCover &uuml;ber Amiga lesen. Ja das tut mir
aber leid, ich habe auch keine weiteren Neuigkeiten, was nicht schon alles
bekannt ist. Daf&uuml;r lese ich aber jeden Morgen das Kalenderblatt meines
Abreisskalenders, der hier neben dem Amiga an der Wand h&auml;ngt. Da
stehen gerne schlaue Spr&uuml;che, Rezepte f&uuml;r das Mittagsessen,
Anektoden und Wissenswertes darauf. Und heute lautet der Haupttext:

<blockquote><i><font color="#006000">
Wussten Sie, dass in 10 Kilometer Meerestiefe in v&ouml;lliger Dunkelheit
noch Fische leben? Hier herrscht ein Druck von 1000 Athmosph&auml;ren! Wenn
Fische so tief noch leben k&ouml;nnen, muss dort auch Luft vorhanden sein.
Diese kann nur von der Oberfl&auml;che kommen. Es muss also senkrechte
Str&ouml;mungen geben.
</font></i>
</blockquote>

Oha, schon wieder etwas gelernt. Oder doch nicht? Komisch, es steht gar
nicht dabei, wer das entdeckt und beschrieben hat. Also bleibt nichts
anderes &uuml;brig, als mal kurz nachzudenken. Eines steht mal fest, die
Tiefen des Meeres sind noch weitgehend unerforscht. Man kennt das Relief
des Meeresbodens, wei&szlig; in etwa wo welche Rohstoffe vorkommen und
bekommt von der Industrie nur Geld, wenn es sich lohnt, die Kupfer-,
Kobalt-, Nickel-, Phospat-, Mangan- und Erd&ouml;lvorkommen abzubauen.
Dabei darf man auch schauen, wie weit reicht eigentlich das Shelf
(geh&ouml;rt noch zu den den Kontinenten). Dann darf man auch Vermutungen
anstellen, wie sind eigentlich die Canyons im Kontinentalabhang entstanden
und wie kommt es, dass diese sogar auf dem Boden der Tiefseen noch
vorkommen. Ach ja Tiefsee: Diese reichen nur bis zu einer Tiefe von 6000 m.
Und hier wurden bisher nur bizarre Lebensformen entdeckt, wirbellose Tiere
und ganze &Ouml;kosysteme, die ihre Nahrung aus hei&szlig;en Tiefseequellen
gewinnen m&uuml;ssen. Bis aber diesem allem erst mal nachgegangen wird, hat
man bestimmt schon die ersten Tiefbohrungen auf dem Pluto hinter sich. </p>

<p>10 Kilometer: das kann eigentlich nur der Marianengraben sein, dessen
tiefste Stelle 11.034 m betr&auml;gt und wo im Januar 1960 Jacques Piccard
mit einer Tauchkugel (Bathyscaph) sich 10.900 m hinab gleiten lie&szlig;.
Mir ist momentan leider nicht bekannt, wie tief Jacques-Yves Cousteau
wirklich gekommen ist. Seine Dokumentarfilme betrafen eigentlich immer das
Schelf und den Kontinentalabhang. Wenn ich mich nicht t&auml;usche, hatte
es ihm der mittelozeanische R&uuml;cken sehr angetan und dort besonders die
"sea mounts", die unterirdischen Vulkane bzw. auch die "black smoker"
(schwarze Raucher), wo sich gerne die oben erw&auml;hnten wirbellosen Tiere
aufhalten und ihn sehr faszinierten. Aber von Sauerstoffbedarf f&uuml;r
diese Lebensform hatte er nie gesprochen und meines Erachtens ist dies auch
nur durch chemische Reaktion m&ouml;glich und nicht z.B. durch
Kiemenatmung. </p>

<p>Um sicher zu gehen, habe ich auch mal im Lexikon nachgeschaut und da
steht, dass Fische Wirbeltiere sind und es ca. 22.000 Arten geben soll.
Hier ist die Unterteilung in zwei Kategorien vorgenommen, die Knorpel- und
die Knochenfische. Leider habe ich keine Angaben gefunden, bis zu welcher
Tauchtiefe Fische gehen k&ouml;nnen. Lebensformen der Tiefseeregionen in
4000 bis 6000 m Tiefe k&ouml;nnen nie auftauchen, da sie bei Druckabnahme
einfach zerplatzen. Weiterhin sollte man einmal einen Physiker fragen, was
passiert, wenn ein Luftmolek&uuml;l von der Wasseroberfl&auml;che bis auf
10.000 m Tiefe transportiert wird. Trennt sich das Makromolek&uuml;l in
seine einzelnen Bestandteile oder bleibt es im originalen Verh&auml;ltnis
zusammen? Wie verh&auml;lt sich der Stickstoff? Wie verh&auml;lt sich der
Sauerstoff? Bleibt das Kohlendioxid bestehen oder wird es auch
aufgespalten? Diese Fragen sollte man erst tunlichst betrachten und
erl&auml;utern, bevor man einfach behauptet, Luft wird in senkrechten
Str&ouml;mungen bis zu einer Tiefe von 10 Kilometer bef&ouml;rdert und von
Fischen eingeatmet. </p>

<p>Und was habe ich nun wirklich gelernt? Auch die schlauen Spr&uuml;che
und die Lebensweisheiten der Kalenderbl&auml;tter sollte ich etwas
skeptischer gegen&uuml;berstehen und diese nicht einfach kommentarlos
&uuml;bernehmen. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
