<html>
<head>
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Spassseite</b></font></p>

<p> Und hier nun wieder die etwas lustigere Ecke in der NoCover, - viel
Spass und gut lachen.... </p>

<p><b>Weissheit des Monats </b><br>

"Man empfindet es oft als ungerecht, dass Menschen, die Stroh im Kopf
haben, auch noch Geld wie Heu besitzen." </p>


<p><b>Die Schwaben... </b><br>
 
Ein Schwabe kommt mit einer Zeitung in ein Karlsruher Reiseb&uuml;ro:
"Entschuldigen Sie, hier steht, dass ich bei Ihnen eine Luxusreise f&uuml;r
98 Mark bekommen kann. Gilt das Angebot noch?" Der Verk&auml;ufer stimmt zu
und kassiert den Schwaben ab. Da kommen zwei M&auml;nner aus dem
Hinterzimmer, packen den Schwaben und zerren ihn nach drau&szlig;en, wo sie
ihn in ein Fass stecken, welches sie in den Rhein werfen. Kurz darauf kommt
ein Bayer in das Reiseb&uuml;ro. Auch er erkundigt sich nach der Reise,
bezahlt und wird mitsamt dem Fass in den Rhein geworfen. Nach einer Weile
sto&szlig;en die beiden F&auml;sser zusammen. Meint der Bayer:
"Entschuldigen Sie, k&ouml;nnen Sie mir sagen, ob auf dieser Kreuzfahrt ein
Abendessen serviert wird?" Antwortet der Schwabe: "Ich glaube nicht,
jedenfalls gab es letztes Jahr keines..." </p>


<p><b>Nicht ganz jugendfrei?</b><br>

M&auml;nner haben in jedem Fall den kleinsten Garten. Eine Karotte, zwei
Kartoffeln, ein bisschen Petersillie und dann freuen sie sich, wenn die
Schnecken kommen! </p>


<p><b>Der Notfall </b><br>

Ein Arzt stellt mitten in der Nacht fest, dass sein Keller unter Wasser
steht. Sofort ruft er einen Klempner an. Dieser weigert sich allerdings, zu
dieser sp&auml;ten Stunde noch zu kommen. Daraufhin wird der Arzt
aufgebracht und erkl&auml;rt, dass er auch mitten in der Nacht kommen muss,
wenn er zu einem Notfall gerufen wird. Eine viertel Stunde sp&auml;ter ist
der Klempner da. Gemeinsam mit dem Arzt betritt er die Kellertreppe, die
bereits zur H&auml;lfte unter Wasser steht. Der Klempner &ouml;ffnet seine
Tasche, holt zwei Dichtungsringe heraus, wirft diese ins Wasser und sagt:
"Wenn es bis morgen nicht besser ist, rufen Sie wieder an." </p>



<p><b>Wer NT kennt....</b><br>

Flugzeugabsturz &uuml;ber Afrika. Kannibalen nehmen die drei
&Uuml;berlebenden, zwei Mitarbeiter der Windows-NT-Abteilung sowie einen
EDV-Leiter, gefangen. Ehe sie verspeist werden, d&uuml;rfen sie einen
letzten Wunsch &auml;ussern. Der Windows-NT-Programmierer bittet um eine
Pizza und eine B&uuml;chse Cola. Der Windows-NT-Marketing-Manager fordert
einen Overheadprojektor; er will die Wilden &uuml;ber die Vorz&uuml;ge von
Windows-NT aufkl&auml;ren. Der letzte Wunsch des EDV-Leiters: Er
m&ouml;chte vor der Marketingvorf&uuml;hrung in den Kochtopf wandern. </p>


<p><b>Verst&auml;ndnislosigkeit </b><br>

"So, mein lieber Junge, jetzt habe ich dir die Geschichte von deinem Vater
im Krieg erz&auml;hlt." "Ja, aber wozu hat man dann all die anderen
Soldaten gebraucht?" </p>


<p><b>Weissheit des Jahres </b><br>

Kein kluger Mann widerspricht seiner Frau. Er wartet, bis sie es selbst
tut. </p>


<p><b>Bald arbeitslos? </b><br>

Die Ehefrau eines H&auml;ftlings beschwert sich beim
Gef&auml;ngnisdirektor: "Geben Sie meinem Mann doch leichtere Arbeit in
Ihrer Anstalt. Er ist schon ganz geschw&auml;cht..." <br> Nachdem der
Direktor die Unterlagen &uuml;berpr&uuml;ft hat: "Also eine noch Leichtere
gibts wohl kaum: er verteilt hier nur die Briefe..." "Das ist nicht wahr!
Mir hat er gesagt, er muss jede Nacht einen Tunnel graben !!!" </p>


<p><b>Genau SO ist das Leben.... </b><dl>

<dt>Kommt man morgens zu sp&auml;t, </dt>
<dd> - ist man ein schlechtes Vorbild, </dd>
<dt>kommt man p&uuml;nklich, </dt>
<dd> - gilt an als Aufpasser. </dd>
<dt>Ist man zu seinen Mitarbeiter freundlich, </dt>
<dd> - will man sich anbiedern, </dd>
<dt>ist man zur&uuml;ckhaltend,</dt>
<dd> - gilt man als hochn&auml;sig. </dd>
<dt>K&uuml;mmert man sich um die Arbeit seiner Leute, </dt>
<dd> - ist man ein Schn&uuml;ffler, </dd>
<dt>tut man es nicht, </dt>
<dd> - hat man von der Sache keine Ahnung, </dd>
<dt>teilt man Lob aus, </dt>
<dd> - ist man ein Schmeichler, </dd>
<dt>tadelt man, </dt>
<dd> - wird man als Verleumder hingestellt. </dd>
<dt>Bleibt man abends etwas l&auml;nger, </dt>
<dd> - makiert man den &Uuml;berbesch&auml;ftigten, </dd>
<dt>geht man p&uuml;nktlich, </dt>
<dd> - fehlt das Firmenintresse.</dd>
<dt>Beharrt man auf seinen Standpunkt, </dt>
<dd> - ist man stur, </dd>
<dt>tut man es nicht, </dt>
<dd> - ist man wankelm&uuml;tig. </dd>
<dt>Ist man &auml;lter, </dt>
<dd> - gilt man als verkalkt, </dd>
<dt>ist man j&uuml;nger, </dt>
<dd> - hat man keine Erfahrung, </dd>
<dt>hat man neue Ideen, </dt>
<dd> - ist man ein Phantast, </dd>
<dt>bleibt alles beim alten, </dt>
<dd> - gilt man als r&uuml;ckst&auml;ndig. </dd></dl>


<p><b>So soll eine Frau sein.... </b><br>

Eine Frau soll aussehen <br>
- wie ein junges M&auml;dchen, <br>
- auftreten wie eine Lady, <br>
- denken wie ein Mann <br>
- und arbeiten wie ein Pferd ! </p>


<p><b>Der Vergleich </b>
<table border=0>
<tr><td colspan=3>

Falls Du Gef&auml;ngnis und Arbeit einmal verwechseln solltest, so
helfen Dir vielleicht die nachstehenden Vergleiche,
die Beiden auseinander zu halten:
</td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>

<td>Du verbringst die  meiste Zeit in einer 2 x 3 m Zelle.
</td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du verbringst die meiste Zeit an einem Platz 2 x 2 m.
</td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Du bekommst drei Mahlzeiten pro Tag. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du bekommst nur eine Pause f&uuml;r eine einzige Mahlzeit und musst
auch noch daf&uuml;r bezahlen. </td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Bei gutem Betragen bekommst du Urlaub. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>F&uuml;r gutes Betragen wirst du mit mehr Arbeit belohnt.
</td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Der W&auml;chter schliesst und &ouml;ffnet alle T&uuml;ren f&uuml;r
dich. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du musst eine ID tragen und alle T&uuml;ren selbst &ouml;ffnen.
</td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Du kannst fernsehen und Spiele spielen. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du wirst sofort gek&uuml;ndigt, wenn du fern siehst oder Spiele
spielst. </td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Du hast eine eigene Toilette. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du musst die Toilette teilen. </td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Freunde und Verwandte d&uuml;rfen dich besuchen. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du darfst nicht einmal mit deiner Familie reden. </td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Es ist alles durch Steuergelder bezahlt und du brauchst
nicht einmal daf&uuml;r zu arbeiten. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Du musst f&uuml;r die Spesen selbst aufkommen und dann zieht
man dir vom Lohn noch Steuern ab um f&uuml;r die Gefangenen zu zahlen.
</td></tr>

<tr><td valign=top>Gef&auml;ngnis: </td><td> &nbsp; </dt>
<td>Dort hast du Wachpersonal. </td></tr>

<tr><td valign=top>B&uuml;ro: </td><td> &nbsp; </dt>
<td>Hier nennt man  sie "Manager". </td></tr></table



<p><b>Zuviel Ehrlichkeit </b><br>

Ein Fahrzeug wird von einem Polizisten angehalten. <br>
<b>Polizist:</b> "Haben Sie nicht bemerkt, dass Sie in einer 30er
Zone 50 gefahren sind?" <br>
<b>Fahrer:</b> "Nein ich fuhr 40." <br>
"Oh nein, du bist 60 gefahren" sagt seine <b>Frau</b> und erntet
daf&uuml;r einen verachtenden Blick. <br>
<b>Polizist:</b> "Au&szlig;erdem bekommen sie einen Strafzettel f&uuml;r das
kaputte R&uuml;cklicht!" <br>
<b>Fahrer:</b> "Ich wei&szlig; nichts von einem kaputten R&uuml;cklicht."
<br>
"Oh nein, du wei&szlig;t seit Wochen von dem kaputten R&uuml;cklicht", sagt
die <b>Frau</b> und erntet daf&uuml;r den n&auml;chsten b&ouml;sen Blick.
<br>
<b>Polizist:</b> "Und dann noch einen daf&uuml;r, dass sie nicht
angeschnallt sind" <br>
<b>Fahrer:</b> "Ich habe meinen Gurt erst beim anhalten gel&ouml;st." <br>
"Oh nein, du gurtest dich doch nie an!", sagt die <b>Frau</b>. <br>
Ihr Mann rastet aus und schreit Sie an: "Halte jetzt endlich 
mal deine Klappe!" <br>
<b>Polizist:</b> "Sagen sie mal, br&uuml;llt Ihr Mann sie denn immer so
an?" <br>
<b>Frau:</b> "Nein nicht immer! Nur wenn er betrunken ist!" </p>


<p><b>Auch nicht ganz jugendfrei? </b><br>

Internationales Pfadfindertreffen bei Paris. Einige der Halbw&uuml;chsigen
kneifen abends aus dem Lager aus und nehmen auch den kleinen Henry mit. Der
Gruppenleiter sucht die Ausrei&szlig;er und findet sie in einer
Stripteaseshow, die schon recht fortgeschritten ist. Henry sitzt am Tisch
und weint. Der Gruppenleiter fragt ihn: "Warum weinst Du denn?" "Meine
Mutter hat mir gesagt, wenn ich nackte Frauen ansehe, werde ich zur
Salzs&auml;ule erstarren. Und ich glaube, es hat schon angefangen!" </p>


<p><b>Missverst&auml;ndnis </b><br>

Kommt ein W&uuml;rstchenverk&auml;ufer durch den Zug und ruft immer: <br>
"Heisse W&uuml;rstchen, Heisse W&uuml;rstchen". <br>
Schreit pl&ouml;tzlich einer zur&uuml;ck: <br>
"Ist mir doch egal, wie Sie hei&szlig;en!" </p>



<p>So, das wars f&uuml;r diesen Monat, - noch viel Freude beim lesen Eurer
NoCover. <br>
Euer HIGGINS <br>
Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
