<html>
<head>
<!-- author = "Wolf Zimmer"   -->
 
<title>Die neue Wolf-INFO ist da!</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a>  

<table border="0" cellpadding="5" width=100%>
<tr><td colspan=2>
<tr><td width=260 align=center>
<img src="wolf1.gif" border=0 width=230 heigth=240
alt="mein Logo" align=left></td>
<td><ul><font color=blue><b>I N H A L T </font></b>
<li> <a href="#a1"> Rechenk&uuml;nstler</a></li>
<li> <a href="#a2"> Hausaufgaben</a></li>
<li> <a href="#a3"> Studienanf&auml;nger</a></li>
<li> <a href="#a4"> Studentenetat</a></li>
<li> <a href="#a5"> Die Namensgeschichte des Geldes</a></li>
</ul></td>
</tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>
<p align=center><a name="a1"></a>
<b><font color="800000" size="5"> Rechenk&uuml;nstler</font></b></p>

<p>Die Deutschen sind im internationalen Vergleich relativ gute Rechner.
Dies hat eine Studie der OECD ergeben. In der Untersuchung getestet wurde
unter anderem, wie sicher Menschen zwischen 16 und 65 Jahren in den
einzelnen L&auml;ndern mit Zahlen umgehen k&ouml;nnen. Die Ergebnisse
wurden in f&uuml;nf Leistungsniveaus eingeordnet. Um das Niveau 4 oder 5 zu
erreichen, mussten komplexe Aufgaben gel&ouml;st werden, beispielsweise die
Kalkulation von Zinsen und Zinseszinsen oder die Erstellung von Bilanzen.
Wer nur die Grundrechenarten beherrschte, schaffte es allenfalls auf das
Niveau 1. Knapp ein Viertel der am Test beteiligten Deutschen (23,5%) waren
gute oder sehr gute Rechner. Schweden (35,8%, Tschechien (31,9%),
D&auml;nemark (28,4%) und Norwegen 27,4%) konnten allerdings noch bessere
Ergebnisse erreichen. Mathematische Defizite wurden vor allem in Slowenien,
Polen und Portugal ermittelt. Hier lag der Anteil an guten oder sehr guten
Rechnern nur bei 8,6%, 6,8% bzw. 5,2%. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a2"></a>
<b><font color="800000" size="5">Hausaufgaben </font></b></p>

<p>Sch&uuml;ler Hausaufgabendienste im Internet werden von Experten
schlecht bewertet. Nach Angaben der Verbraucherzentrale Nordrhein Westfalen
k&auml;men die Antworten auf Sch&uuml;lerfragen entweder sehr sp&auml;t
oder seien sogar falsch. F&uuml;r den Test hatten Experten insgesamt 108
Fragen zu verschiedenen Fachgebieten an neun Internetdienste gestellt. Nur
34 wurden beantwortet, davon lediglich 22 innerhalb einer Woche und drei
der Dienste reagierten &uuml;berhaupt nicht. Auch die Referate und
Aufs&auml;tze, die im Internet bereitgestellt werden, seien h&auml;ufig von
zweifelhafter Qualit&auml;t. Das Schummeln sollte man also lieber lassen.
Zudem kann man &uuml;ber Suchmaschinen herausfinden, ob die Referate oder
Hausaufgaben neu oder kopiert sind. N&auml;heres unter <font
color="#0000ff"><b>www.vz.nrw.de/hausaufgaben</b></font>. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a3"></a>
<b><font color="800000" size="5"> Studienanf&auml;nger</font></b></p>

<p>Im Wintersemester 2001/2002 haben sich an deutschen Hochschulen
insgesamt 1.864.000 Studierende eingeschrieben, das sind 64.000 oder fast
4% mehr als im Wintersemester 2000/2001. Zu diesem vorl&auml;ufigen
Ergebnis kommt Destatis, das Satistische Bundesamt. Die Zahl der
Studierenden liegt damit nur knapp unter dem H&ouml;chststand des
Wintersemesters 1994/1995 (1.872.000). 72% der Nachwuchsakademiker
studieren an Universit&auml;ten oder gleich rangierenden wissenschaftlichen
Hochschulen. 26% an Fach- oder Verwaltungshochschulen und 2% an
Kunsthochschulen. Im gesamten Studienjahr 2001/2002 haben 342.000
Studienanf&auml;nger erstmals ein Hochschulstudium in Deutschland
aufgenommen, das waren nahezu 9% mehr als 2000/2001. Das Studienfach
Informatik verzeichnete dabei seit dem Aufschwung zur Mitte der neunziger
Jahre erstmals wieder r&uuml;ckl&auml;ufige Studierendenzahlen (-4,6%
gegn&uuml;ber dem Vorjahr). Ebenfalls abgenommen haben die Zahlen der
Studierenden im Fach Bauingenieurwesen (-19,5%). Beliebter sind hingegen
die Ingenierwissenschaften Maschinenbau und Elektrotechnik/Elektronik mit
Zuw&auml;chsen von 7,2% bzw. 4,4%. </p>
                 
<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a4"></a>
<b><font color="800000" size="5"> Studentenetat</font></b></p>

<p>Zur Finanzierung des Lebensunterhalts ben&ouml;tigte ein Student in den
alten Bundesl&auml;ndern im vergangenen Jahr im Schnitt 1.295 D-Mark im
Monat, in den neuen Bundesl&auml;ndern waren es 1.056 D-Mark. Nach Angaben
des Instituts der deutschen Wirtschaft stiegen die Studentenbudgets im
Osten seit Mitte der neunziger Jahre um insgesamt 25%, im Westen um
lediglich 5%. Etwa die H&auml;lfte des Studentenetats bringen die Eltern
auf, rund ein Drittel (West) bzw. ein F&uuml;nftel (Ost) des Budgets
verdienen die Studierenden selbst hinzu. Das Baf&ouml;G spielt heutzutage
nur noch eine untergeordnete Rolle. Der Anteil am Etat betrug 9% im Westen
bzw. 18% im Osten. Die fehlenden rund 10% zum Gesamtetat stammen aus
sonstigen Quellen wie beispielsweise Stipendien, Krediten oder
Ersparnissen. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> <hr></p>

<p align=center><a name="a5"></a>
<b><font color="800000" size="5"> Die Namensgeschichte des
Geldes</font></b></p>

<p>Seit dem 01.01.2002 halten die Europ&auml;er eine W&auml;hrung in den
H&auml;nden, deren Name auch ihr Programm ist: "Euro" steht f&uuml;r die
europ&auml;ische Idee. Doch meist leuchtet nicht unmittelbar ein, wie das
Geld zu seinem Namen gekommen ist. Von vielen traditionsreichen
europ&auml;ischen W&auml;hrungen hei&szlig;t es nun Abschied zu nehmen -
Anlass f&uuml;r einen R&uuml;ckblick auf einige Beispiele der
Namensgeschichte des Geldes. </p>

<p>Der Ursprung der <b>Mark</b> war eine nordgermanische Gewichtseinheit,
die erstmals im Jahr 857 erw&auml;hnt wurde und im Nordischen mork, im
Angels&auml;chsischen mearc und im Lateinischen marca hie&szlig;.
Abgeleitet sind diese Begriffe wiederum von einer Markierung, die die
Gewichtsst&uuml;cke erhielten. Seit dem 11. Jahrhundert war die Mark in
Deutschland das Edelmetallgewicht, das bei der M&uuml;nzpr&auml;gung zu
Grunde gelegt wurde. Ihre Masse schwankte je nach Region zwischen etwa 200
und 280 Gramm, und aus einer Mark Silber wurden urspr&uuml;nglich 160
Pfennige gepr&auml;gt. Sp&auml;ter wurden es mehr, der Pfennig wurde immer
leichter. So war die Mark zun&auml;chst nur ein Z&auml;hlmedium. Das
&auml;nderte sich im 16. Jahrhundert. Ab 1506 wurden vom Wendischen
M&uuml;nzverein, dem auch die Hansest&auml;dte Hamburg, L&uuml;beck,
L&uuml;neburg und Wismar angeh&ouml;rten, M&uuml;nzen im Wert von 16
Schillingen bzw. 192 Pfennigen gepr&auml;gt: Aus der Z&auml;hl-Mark war ein
Geldst&uuml;ck geworden. </p>

<p>Damit hat die Mark zwar eine Geschichte als Einzelw&auml;hrung, doch im
Grunde ist sie - wie der Euro - eine Gemeinschaftsw&auml;hrung, und das
seit 1871: Nach dem erfolgreichen Krieg gegen Frankreich hatte der
preu&szlig;ische K&ouml;nig Wilhelm das deutsche Kaiserreich ausgerufen,
die Kleinstaaten verloren an Bedeutung. So brauchte man eine neue,
einheitliche deutsche W&auml;hrung - und einen Namen daf&uuml;r. Die
Bezeichnung der damals m&auml;chtigsten deutschen W&auml;hrung - das war
der preu&szlig;ische Taler - stie&szlig; allerdings auf den heftigen
Widerstand der s&uuml;ddeutschen L&auml;nder. Deren W&auml;hrung, der
Gulden, lie&szlig; sich genauso wenig durchsetzen, und so einigte man sich
auf den Begriff Mark. Und die Mark sollte nicht nur eine deutsche
W&auml;hrung bleiben: Es gab sie auch von 1918 bis 1927 in der Republik
Estland und als Markka ab 1860 in Finnland.</p>

<p>In Frankreich wurden im Jahr 1360 Goldm&uuml;nzen gepr&auml;gt, die als
L&ouml;segeld f&uuml;r die Befreiung von K&ouml;nig Johann aus englischer
Gefangenschaft dienten. Diese M&uuml;nzen, auf denen der franz&ouml;sische
K&ouml;nig, der Francorum Rex, zu Pferd abgebildet war, hie&szlig;en
dementsprechend "<b>Franc</b> d'or à cheval". Wenige Jahre sp&auml;ter
folgten Goldm&uuml;nzen, auf denen der K&ouml;nig stehend, ohne Pferd zu
sehen war. Man nannte sie folgerichtig "Franc d'or à pied".</p>

<p>Im 16. Jahrhundert gab es erneut franz&ouml;sische M&uuml;nzen mit dem
Namen Franc, doch diesmal waren es Silberst&uuml;cke, wiederum mit einem
Abbild des K&ouml;nigs. Im 17. Jahrhundert wurde dieser Franc durch den
silbernen Ecu abgel&ouml;st. Schlie&szlig;lich f&uuml;hrte Frankreich 1795
eine neue W&auml;hrungseinheit mit dem Namen Franc ein. Franc, Frank oder
Franken gab es sp&auml;ter auch in Belgien, Luxemburg, der Schweiz und
einigen au&szlig;ereurop&auml;ischen L&auml;ndern.</p>

<p>Abwechslungsreich ist die Geschichte des <b>Gulden</b>. Von 1252 an
wurde in der reichen Handelsstadt Florenz eine M&uuml;nze zu 3,5 Gramm
Feingold gepr&auml;gt. Auf einer Seite zeigte sie den Stadtheiligen,
Johannes den T&auml;ufer, und auf der anderen Seite das Stadtsymbol von
Florenz, eine Lilie. Dies gab der M&uuml;nze ihren Namen: florenus aureus
(lateinisch flos = Blume, aureus = Gold) oder kurz Floren. In gro&szlig;en
St&uuml;ckzahlen hergestellt, verbreitete sich der Floren als
Handelsm&uuml;nze in weiten Teilen Europas. In Deutschland hie&szlig; er
G&uuml;lden, G&uuml;ldiner oder Gulden, abgeleitet von "golden". Er wurde
zur wichtigsten Goldm&uuml;nze Europas im Sp&auml;tmittelalter, und noch
heute k&uuml;ndet die Abk&uuml;rzung "fl." f&uuml;r den holl&auml;ndischen
Gulden von der Identit&auml;t zwischen Floren und Gulden. </p>

<p>Seit dem 16. Jahrhundert pr&auml;gte man auch Silberm&uuml;nzen mit der
Bezeichnung Gulden. Vor allem in S&uuml;ddeutschland entwickelte sich der
Gulden zur allgemeinen Rechnungs- und W&auml;hrungseinheit und hatte erst
mit dem &Uuml;bergang zureichseinheitlichen Mark-W&auml;hrung 1871 in
Deutschland ausgedient.</p>

<p>Zu den &auml;ltesten <b>Kronen</b> z&auml;hlen franz&ouml;sische
Goldm&uuml;nzen aus dem Sp&auml;tmittelalter sowie spanische Escudos. Auch
die von den deutschen Zollvereinsstaaten und &Ouml;sterreich geschaffene
Vereinsgoldm&uuml;nze der Jahre 1857 bis 1871 wurde Krone genannt. Im
Deutschen Reich von 1871 wurden goldene Zehnmarkst&uuml;cke als Kronen
bezeichnet, die Zwanzigmarkst&uuml;cke als Doppelkronen. In D&auml;nemark,
Schweden, Norwegen, Island sowie der Tschechischen und der Slowakischen
Republik ist die Krone bis heute W&auml;hrungseinheit.</p>

<p>Sehr jung im Vergleich zu anderen W&auml;hrungen ist der <b>Cent</b>. Er
leitet sich aus dem lateinischen centum (ein Hundert) ab und findet sich
nicht nur als ein Hundertstel Dollar in den USA wieder, sondern auch auch
als Centime in Frankreich, als Centesimo in Italien, als Centimo in Spanien
und als Centavo in S&uuml;d- und Mittelamerika. Und nicht nur dort: Seit
Beginn dieses Jahres haben (fast) alle Europ&auml;er ihren Cent - als
Untereinheit des <b>Euro</b>. </p>

<p>Gehe zum <a href="#top" align=left> Anfang </a> 

<hr size=4></p>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff"><font color="#0000ff">
<td>Autor: &nbsp; <b><font color="#0000ff">Wolf Zimmer</font></b> </td>
<td>E-Mail: <b><font color="#0000ff"> wolf@wozim.de</font></b> </td>
<td>Homepage: <b><font color="#0000ff"> http://www.wozim.de </font></b>
</td></tr></table></center>
<br>
</body>
</html>
