<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Nix zu verlieren</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Nix zu verlieren</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P><B>Tim Robbins</B> sitzt auf der Bettkante, schaut bierernst in die Kamera und
labert einen h&uuml;bsch r&uuml;cksichtslosen Text herunter, dessen Inhalt ist, wie
wenig derjenige - besser diejenige, zu der er spricht, noch k&ouml;rperlich
reizt.
</P><P>
Schnitt. Wir sehen Kelly Preston, die ebenfalls bierernst, ja, nahezu
betroffen die harten Worte entgegennimmt, um pl&ouml;tzlich in Gel&auml;chter
auszubrechen. Schnell wird klar, da&szlig; dies nur ein Spiel zwischen einem
gl&uuml;cklichen P&auml;&auml;rchen ist. Das Spielchen wird umgedreht und sie ist an der
Reihe, erz&auml;hlt von ihren &quot;Erfahrungen&quot; mit anderen M&auml;nnern. Erneut erfolgt
eine Aufl&ouml;sung und man nimmt sich in den Arm. Schnitt.
</P><P>
Ein poppiger Titelsong ert&ouml;nt, die Leinwand wird schwarz und der Vorspann
benennt die Darsteller und sontige Beteiligte.
</P><P>
Schwungvoll f&auml;ngt sie an, diese Kom&ouml;die um den Wei&szlig;en Nick, den seine
Frau mit seinem Chef betr&uuml;gt, der kurz darauf vom schwarzen Stra&szlig;enr&auml;uber
T. (Martin Lawrence) &uuml;berfallen wird und der in diesem Moment zu der
&Uuml;berzeugung gelangt, da&szlig; er nunmehr <B>nix zu verlieren</B> h&auml;tte und deshalb
aus seinem gewohnten Leben aussteigt und beschlie&szlig;t, sich mit T.'s Hilfe
an seinem Chef zu r&auml;chen.
</P><P>
So zeigt sich die Situation bereits nach wenigen weiteren Szenen. Alles
hat sich gewandelt, auch die Musik, die erinnert nun eher an Country bis
Jazz, ist aber weiterhin sehr schwungvoll.
</P><P>
Nick und T. kommen sich nur schwerlich n&auml;her, ein Proze&szlig;, in dem sich
viel Humor unterbringen l&auml;&szlig;t, da k&ouml;nnen Spr&uuml;che geklopft werden, da kann
gelabert werden, Mimiken, Gestiken, f&uuml;r alles ist Platz, wenn ein wei&szlig;er
Business-Waschlappen und ein schwarzer Verlegenheits-Ganove Probleme mit
den jeweiligen Geflogenheiten haben.
</P><P>
Aber nat&uuml;rlich werden sie dadurch letztendlich nur umso bessere Freunde
und gehen letztlich gemeinsam durch dick und d&uuml;nn.
</P><P>
Beide Rollen sind gut besetzt, werden prima ausgef&uuml;llt, so da&szlig; es Spa&szlig;
macht, sich davon berieseln zu lassen und seinen Lachmuskeln hier und da
freien Lauf zu lassen. Man am&uuml;siert sich also...und am&uuml;siert sich...und
dennoch stellt man fest, da&szlig; einen das ganze nicht vom Hocker rei&szlig;t.
Und warum?
</P><P>
Weil es reichlich wenig originell ist.
</P><P>
Martin Lawrence ist Martin Lawrence, wie Martin Lawrence schon immer war,
und Tim Robbins ist Tim Robbins, wie Tim Robbins schon immer war. Und die
Story ist eine Story, wie sie immer sind, wenn es daraum geht, eine
Kom&ouml;die zu kreieren, &uuml;ber die die Zuschauer sich totsicher am&uuml;sieren, eine
lockere Story, die unbemerkt dahinrieselt, w&auml;hrend der Zuschauer l&auml;chelt
und lacht und l&auml;chelt. Nat&uuml;rlich mu&szlig; sie auch hier und da Mitgef&uuml;hl
erwecken, aber nicht zu viel bitte, und freilich geh&ouml;rt auch ein
Happy-End dazu, so da&szlig; die Welt wieder heil ist, wenn der Bezauberte
das Kino verl&auml;&szlig;t. Um das ganze perfekt zu machen, nimmt man noch eine
Portion zeitgen&ouml;ssische und vor allem schwungvolle Musik, die ins Ohr
geht - Auswahl und Zusammenspiel mit dem Filmmaterial sind tats&auml;chlich
sehr gelungen.
</P><P>
Regisseur Steve Oedekerk wu&szlig;te was er tat und er wu&szlig;te, wie er es zu tun
hatte und somit gibt es nichts an diesem Film zu beklagen. Oder doch?
</P><P>
Nein.
</P><P>
Denn wer nichts riskiert, kann nichts verlieren. - Aber auch nichts
gewinnen.
</P><P>
Am Ende l&ouml;st sich alles auf und f&uuml;gt sich wieder zusammen...das Leben
lacht, die Sonne scheint, der Abspann startet und der Vergn&uuml;gte wird
von einem vertrauten HipHop-Song aus dem Kino geleitet.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803cd4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803fil2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
