<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Katarrhus</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>KATARRHUS</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR><br>
&copy;opyright by Gregor Franz. All rights reserved.<BR>

<P>
 [<B>Kommentar</B>: Urspr&uuml;nglich war diese Geschichte als Titel-Story
  f&uuml;r ein nie zu Ende programmiertes Computer-Spiel gedacht.
  Im Spiel ging es lediglich darum, ein kleines, sich den Weg
  durch seine Feinde freiballerndes Raumschiff durch einen
  Hintergrund von Chips und Leiterbahnen zu steuern.
  Auch unter diesen Bedingungen wollte ich zeigen, da&szlig; die Story
  nicht ganz so platt werden mu&szlig;, wie die meisten von &auml;hnlichen
  Spielen: B&ouml;sen, dummdreisten Au&szlig;erirdischen f&auml;llt es urpl&ouml;tzlich
  ein, in Scharen loszuziehen, um die Erde zu vernichten und
  ein einsamer Held, mit dem einzigem verf&uuml;gbaren Superduper-
  kampfraumer mu&szlig; sich ihnen entgegenstellen (oder so &auml;hnlich) ...]
</P>
<CENTER>(so geschehen 1993)<br><BR>Fortsetzung:</CENTER>
<HR>
<PRE>
 Gehetzt wandte sich Misan Teriks alias Konter Fei mitten im Lauf
 um.
  Langsam wurde es wirklich knapp. Das Stiefelgetrappel kam immer
 n&auml;her. Gef&auml;hrlich n&auml;her, aber er hatte es fast geschafft.
  In seinem Ohr meldete sich pl&ouml;tzlich leise der Piepser mit
 hektischen Quietschlauten. Sein St&ouml;rsender war also ausgeschaltet
 und er in diesem Moment wahrscheinlich schon auf einem Bildschirm
 zu sehen.
  Als er hinter sich einen verhaltenen Befehlsruf h&ouml;rte, lie&szlig;
 Misan sich instinktiv zu Boden fallen, sonst h&auml;tte er wahrschein-
 lich ein daumengro&szlig;es Brandloch sein eigen genannt.
  Schnell rutschte er zur gegen&uuml;berliegenden Wand, drehte sich um
 und &uuml;bersah die Situation hinter sich.
  Mehrere Soldaten hatten am anderen Gangende hinter dessen Bie-
 gung Deckung gesucht und wagten sich nur kurz hervor, um mit
 ihren schwerkalibrigen Milit&auml;rlasern zu feuern.
  Er gab ein paar Sch&uuml;sse in ihre Richtung ab und versengte etwas
 den Wandbelag in ihrer N&auml;he. Misan Teriks lag an der Wand so gut,
 wie ohne Deckung. Die Gangkreuzung war nur noch wenige Meter
 entfernt.
  Dadurch, da&szlig; sich die Soldaten hinter der rechten Gangecke
 befanden, w&auml;hrend er etwa zehn Meter weiter an der gegen&uuml;ber-
 liegenden linken Wand lehnte, h&auml;tten sie sich weiter vorwagen
 m&uuml;ssen, um ihn zu treffen und w&auml;ren damit in sein Feuer gerannt.
 Trotzdem w&uuml;rde er bei einem geballten Angriff schnell den
 K&uuml;rzeren ziehen.
  Ein voreiliger Soldat in schwarzer Uniform warf sich vor, um
 hinter die gegen&uuml;berliegende Gangecke zu gelangen.
  Teriks feuerte auf gut Gl&uuml;ck ein paar mal in seine Richtung und
 traf ihn tats&auml;chlich am Arm. Der Soldat schrie laut auf, aber
 irgendwie gelang es ihm noch hinter die Deckung zu kommen.
  Seine w&uuml;tenden Kameraden wurden daraufhin dreister und schossen
 jetzt ein paar Magazine in seine Richtung ab, w&auml;hrend sie be-
 gannen weiter vorzur&uuml;cken.
  Von mehreren Treffern &uuml;ber ihm, die sich als schwarze Striemen
 in die Wand eingebrannt hatten, tropfte hei&szlig;es Plastik auf seinen
 Arbeitsanzug. Hier w&uuml;rde er sich keinen Moment l&auml;nger halten
 k&ouml;nnen.
  Misan Teriks gab noch ein paar Sch&uuml;sse auf die Angreifer ab,
 von deren Wirkung er sich nicht mehr &uuml;berzeugen konnte, da er
 einen gewaltigen Hechtsprung vorw&auml;rts machte.
  Neben ihm schlugen mehrere Laserblitze ein, als er sich blitz-
 schnell hinter den linken Gangabzweig der Kreuzung rollte.
  Ein Feuersto&szlig; mu&szlig;te ihn gestreift haben. Auf seinem R&uuml;cken
 breitete sich h&ouml;llischer Schmerz aus und es roch nach ver-
 branntem Stoff und versengter Haut.
  Vorsichtig f&uuml;hlte er mit der linken Hand nach. Aber scheinbar
 hatte der Laserstrahl die Wunde gleichzeitig zugeschwei&szlig;t.
  Teriks gab, ohne sich zu zeigen, ein paar Sch&uuml;sse um die Ecke
 ab, um die Soldaten auf Distanz zu halten. Danach kroch er
 schnell auf eine kleine, kaum erkennbare Klappe zu, die in
 Bodenn&auml;he angebracht war.
  Als er den Blaster in die Linke nahm und mit der Rechten hastig
 an einem Tronic-Schl&uuml;ssel in seiner Innentasche zerrte, regis-
 trierte er, da&szlig; die roten Digitalziffern am Abzug der Waffe nur
 noch acht Schu&szlig; anzeigten. Den scheckkarten&auml;hnlichen Schl&uuml;ssel
 steckte er in einen Schlitz an der Klappe.
  Mit einem kleinen, glocken&auml;hnlichem Ger&auml;usch, sprang sie auf.
 Dahinter waren ein winziger, im Moment dunkler Bildschirm mit
 Tastatur und ein roter plombierter Druckschalter zu sehen.
  Ohne zu z&ouml;gern ri&szlig; Misan die Plombe mit einem kurzen Ruck ab
 und schlug mit der flachen Hand auf den Schalter.
  Ein starkes Summen begann zu ert&ouml;nen und als er sich umdrehte,
 schossen aus der Decke mitten auf der Kreuzung zahlreiche, wei&szlig;-
 glei&szlig;ende Strahlen, die ein vorerst un&uuml;berwindliches Lasergitter
 bildeten. Zwischen den einzelnen, faustdicken Strahlen gab es nur
 sehr schmale Spalten.
  Hinter der Barriere fluchten die Soldaten, die umsonst vorge-
 st&uuml;rmt waren, als einer ihrer abgeschossenen Laserstrahlen mit
 &uuml;berlautem Gesirre von dem Bollwerk abprallte und als Quer-
 schl&auml;ger zur&uuml;ckkam.
  Noch etwas benommen, fuhr sich Misan Teriks &uuml;ber die Augen.
 Hatte sich der Einbau des Gef&auml;ngnisgitters, da&szlig; er unter gro&szlig;en
 Gefahren und hohem Verbrauch von Bestechungsgeldern als Einzel-
 teile bekommen hatte, also wirklich gelohnt.
  Er hatte vier Tage daf&uuml;r gebraucht, es hier einzubauen. Keiner
 hatte ihn nach dem Grund seiner Arbeiten gefragt, obwohl er sie
 als Klimaanlagenreparatur auszugeben bereit gewesen war.
  Auf den Bildschirm, neben dem er lehnte, war Leben gekommen.
 Zahlreiche Angaben und Daten liefen von unten nach oben durch.
 Er betrachtete ihn nun genauer und tippte sich zufrieden gegen
 den Ohrh&ouml;rer.
  Tats&auml;chlich war dessen leises Gefiepe verstummt. Die verkabelte
 Kommunikation in der Westh&auml;lfte dieser Stadtebene war zusammen-
 gebrochen. Mit dem Druck auf den roten Knopf hatte er nicht nur
 die Laserbarriere in Gang gesetzt, sondern auch ein bestimmtes
 Signal ausgesendet.
  Um den Informationsaustausch per Kabel in dem gesamten Bereich
 lahmzulegen, h&auml;tte es nicht ausgereicht irgendwo ein paar der
 Leitungen zu sabotieren. Also hatte er die Idee gehabt, selbst-
 gemachte Virenprogramme einzusetzen.
  Doch trotzdem er ein durchaus guter Programmierer war, wu&szlig;te
 er, da&szlig; in die hochgesicherten Stadtcomputer, die f&uuml;r das Daten-
 netz verantwortlich waren, keine noch so unscheinbaren Viren
 eingesetzt werden konnten, ohne da&szlig; sie bemerkt worden w&auml;ren.
  Die zahlreichen, &uuml;ber der Deckenverkleidung befindlichen Knoten-
 punkteinheiten, die einen Datenverlust &uuml;ber die gro&szlig;en Strecken
 innerhalb Pyronhas ausschlie&szlig;en sollten, waren mit hochentwickel-
 ten, elektronischen Computereinheiten versehen.
  Hier hatte er ansetzen wollen. Aber eigentlich waren sie nicht
 direkt mit der Au&szlig;enwelt verbunden, damit man an ihnen nicht
 herummanipulieren konnte.
  Teriks jedoch lie&szlig; sich seine Virenprogramme an normale Daten-
 sendungen anh&auml;ngen und wenn diese durch die Knotenpunkte gesendet
 wurden, koppelten sich die Viren ab und warteten auf ein bestimm-
 tes Signal, um sich zu aktivieren und die Knotenpunkte au&szlig;er
 Betrieb zu setzen.
  Misan Teriks hoffte, da&szlig; die Verwirrung, die er damit stiftete,
 ausreichen w&uuml;rde, um relativ ungeschoren an sein Ziel zu gelangen.
  Froh war er jetzt schon mal, als er nach der kleinen Flasche
 Wundbalsam griff, die er vorsorglich in einer Ecke des Wartungs-
 faches deponiert hatte.
  Vorsichtig spr&uuml;hte er sich seinen R&uuml;cken damit ein und dachte
 an den Grund, warum er hier nicht mehr Verbandszeug gelagert
 hatte.
  Wenn er mehr als diese eine Spr&uuml;hflasche brauchen w&uuml;rde, so war
 seine &Uuml;berlegung gewesen, h&auml;tte er sowieso keine Chance mehr, es
 zu schaffen.
  Langsam stand er auf, stellte die Flasche zur&uuml;ck, schlug die
 Klappe zu und rannte ohne weitere Verz&ouml;gerungen weiter. Tats&auml;ch-
 lich f&uuml;hlte er auf dem R&uuml;cken nur noch eine k&uuml;hle, etwas taube
 Stelle.
  W&auml;hrend seines Laufes sah er kurz auf die Uhr. In seinen
 Gliedern machte sich langsam die Anstrengung bemerkbar, was
 seiner Leistungsf&auml;higkeit aber bis jetzt noch keinen Abbruch tat.
  'Bei diesem Tempo noch etwa zehn Minuten', dachte Teriks und
 versuchte sich auf den Weg vor sich zu konzentrieren, wobei er
 zufrieden feststellte, da&szlig; die gro&szlig;en seitlichen Alarmleuchten
 in den W&auml;nden noch nicht rot aufgeflammt waren.
  Dieser Ebenenbereich schien mehr kleinere Hallen zu beherbergen,
 als der, den er gerade eben verlassen hatte. In den G&auml;ngen
 passierte er daher jetzt h&auml;ufiger eine, von den Schiebet&uuml;r-
 &ouml;ffnungen, die durch das Auflegen der Hand auf eine Digiba-
 Scheibe ge&ouml;ffnet wurde. Au&szlig;er den personentypischen Hautlinien,
 testete sie auch die jeweilige K&ouml;rpertemperatur und Feuchtigkeit.
  Ihm fiel ein, da&szlig; einer seiner Arbeitskollegen, den die anderen
 alle nur 'Clown Dolli' nannten, die makabre Wahrheit ausge-
 sprochen hatte: "`Ne abgehackte Hand draufdr&uuml;cken, alleine reicht
 nicht."
  Jetzt nahm er den rechten Abzweig und lief in einen Gang, in dem
 hier und da provisorisch ein paar Kisten gestapelt waren, als
 pl&ouml;tzlich, etwa zwanzig Meter vor ihm auf der linken Seite, mit
 einem leisen Zischen eine T&uuml;r aufglitt und zwei behelmte Soldaten
 heraustraten. Die T&uuml;r schlo&szlig; sich sofort wieder.
  Jeder von ihnen trug einen schweren, silberspiegelnden Panzer.
 Also waren das 'Silberlinge', zumindest wurden diese Spezial-
 patrouillen von den Einwohnern Pyronhas unter vorgehaltener Hand
 so genannt.
  Sie erfa&szlig;ten die Situation sehr schnell und w&auml;hrend der eine
 sofort die Hand neben die T&uuml;r dr&uuml;ckte, um sie zu &ouml;ffnen und
 Hilfe zu holen, sprang der andere, ein paar Sch&uuml;sse aus seinem
 Lasergewehr abfeuernd, hinter ein paar Kisten, die genau gegen-
 &uuml;ber dem Eingang standen.
  Auch neben Misan befanden sich einige Kisten, ebenfalls auf der
 rechten Seite, die ihm eine, leider etwas d&uuml;rftige, Deckung boten.
  Die Hand&uuml;berpr&uuml;fung an der T&uuml;r dauerte einige Sekunden und der
 Soldat, der dort ohne jede Deckung stand, f&uuml;hlte sich sichtlich
 unwohl, w&auml;hrend er einen vereinzelten Schu&szlig; in Misans Richtung
 abfeuerte.
  Teriks mu&szlig;te aber verhindern, da&szlig; noch mehr Gegner kamen, also
 scho&szlig; er zur&uuml;ck. Der Strahl, der den Soldaten in die Seite getrof-
 fen h&auml;tte, prallte von seinem dicken, spezialverspiegelten Panzer
 ohne gro&szlig;e Wirkung ab. Der Aufprall, hatte ihn lediglich etwas
 durchgesch&uuml;ttelt.
  Verbissen dr&uuml;ckte er weiterhin seine Hand auf die T&uuml;r.
 Da Misan Teriks wu&szlig;te, da&szlig; die Glieder der Soldaten, auf Grund
 der Bewegungsfreiheit, etwas weniger gesch&uuml;tzt waren, als der
 Rumpf, scho&szlig; er, ohne auf das Deckungsfeuer dessen Kameraden zu
 achten, ein paar Sch&uuml;sse auf seine Beine ab.
  Und tats&auml;chlich mu&szlig;ten sie die Panzerung irgendwo durchschlagen
 haben, denn der Soldat fiel wie gef&auml;llt um. Der Schmerz hatte
 ihm offenbar das Bewu&szlig;tsein geraubt. Mit einem weiteren gezielten
 Schu&szlig; zerst&ouml;rte Misan dann die Digiba-Scheibe.
  Seine Deckung, die nur aus ein paar por&ouml;sen Plastikkisten
 bestand, w&uuml;rde dem nun folgenden Dauerfeuer des zweiten 'Silber-
 lings' nicht mehr lange standhalten, erkannte er, als sie sich
 langsam in ihre Bestandteile aufzul&ouml;sen begann.
  Der Ergo-Blaster machte durch hastiges, oranges Blinken auf
 sich aufmerksam. Das Magazin war leer. Schnell dr&uuml;ckte er auf
 die Auswurfautomatik und das leere Magazin klirrte zu Boden. In
 den Schaft dr&uuml;ckte er nun sein erstes Reservemagazin.
  &Uuml;berraschend trat er kurz aus der Deckung und feuerte mehrmals
 auf sein Gegen&uuml;ber, der sich zu weit hervorgewagt hatte und ein
 paar Treffer einfing.
  Allerdings verpufften sie wirkungslos auf seinem Rumpfpanzer.
 Ehe er zur&uuml;ckfeuern konnte, brachte Misan sich schnell hinter
 den Kisten in Sicherheit und atmete tief durch.
  Mit dieser M&ouml;glichkeit hatte er aber gerechnet und sich deshalb
 nicht ohne Grund f&uuml;r seine V 12 entschieden. Ihre obere, ebene
 Fl&auml;che, direkt &uuml;ber der Fusionskammer, dr&uuml;ckte er nun erst nach
 unten und schob sie dann nach hinten weg. Selbstst&auml;ndig erhob
 sich daraus jetzt ein Mechanismus, der entfernt an ein Zielfern-
 rohr erinnerte.
  "Na dann, Waidmanns Heil", fl&uuml;sterte er leise, seinen Blaster
 vor sich abhaltend und bereit, mit ihm aus seiner Deckung heraus-
 zufeuern.
  Die Waffe seines Gegners schwieg jetzt einen Moment.
 Vielleicht weil er ebenfalls das Magazin wechseln mu&szlig;te?
  Misan &uuml;berlegte nicht lange, ob es andem war, oder nicht,
 sondern warf sich vor und rannte, alle &Auml;ngste f&uuml;r den Moment
 ausschaltend, in Richtung des Soldaten. Nach ein paar Metern
 hatte er ihn im Blickfeld.
  Tats&auml;chlich stand er da und war dabei, ein Magazin in sein
 Gewehr einzulegen. Verdutzt sah er auf.
  Immer noch im vollen Lauf ri&szlig; Teriks seine Arme hoch und feuerte
 durch einen halbgedr&uuml;ckten Abzug mehrere Farbkugeln auf den
 anderen ab. Es kam ihm vor, als laufe alles in Zeitlupe ab.
  Der 'Silberling' schaute kurz wie ein begossener Pudel an sich
 herab - sein gl&auml;nzender Schutzpanzer war mit zahlreichen, gro&szlig;en,
 bunten Farbklecksen bedeckt. Dann richtete er mit einem Aufschrei
 die Waffe auf Misan, um zu schie&szlig;en.
  Im selben Moment, in dem er quer zur Seite sprang, gab Teriks
 einen echten Schu&szlig; auf den beschmutzten Rumpf des Soldaten ab.
  Der verfehlte ihn mit seinem unvorbereiteten Laserstrahl nur
 &auml;u&szlig;erst knapp, doch pl&ouml;tzlich fa&szlig;te er sich an seinen Bauch, von
 dem eine kleine Rauchfahne aufstieg. Der Panzer hatte Misans
 Volltreffer nicht reflektieren k&ouml;nnen und ein Loch hatte sich in
 ihn gebrannt.
  Misan Teriks war nach dem Sprung indes der ganzen L&auml;nge nach auf
 die Seite gefallen. Unf&auml;hig zu feuern starrte er stumm auf den
 Soldaten, der nur wenige Meter vor ihm nach Luft rang.
  Er war auf seine Knie gesunken und &ouml;ffnete noch ein letztes Mal
 lautlos seine Lippen, um dann vorn&uuml;berzukippen.
  Misan verharrte einen Augenblick reglos, um zu verarbeiten, was
 eben in diesen wenigen Sekunden passiert war.
  Er hatte gerade zum ersten Mal in seinem Leben einen Menschen
 get&ouml;tet, keine Spezialausbildung des Universums konnte ihn darauf
 gen&uuml;gend vorbereiten. Obwohl Teriks wu&szlig;te, da&szlig; es einmal dazu
 kommen mu&szlig;te, hatte er den Gedanken daran bisher verdr&auml;ngt.
  Langsam stand er auf, sich unbewu&szlig;t die schmerzenden Glieder
 reibend und nahm seinen Blaster vom Boden. Er warf einen Blick
 auf den Bewu&szlig;tlosen neben der T&uuml;r und ging dann auf den anderen
 zu, der regungslos hinter den Kisten lag. Misan drehte ihn auf
 den R&uuml;cken und wandte sich dann kreidebleich ab.
  Da war nichts mehr zu machen.
 Er atmete tief durch und dachte daran, da&szlig; er sich beeilen m&uuml;&szlig;te,
 wenn er diesen &ouml;den Planeten noch jemals verlassen wollte.
  Ohne weiter zu z&ouml;gern, setzte er seinen Dauerlauf fort.
 Immer wieder zogen w&auml;hrend des Laufens die Bilder dieser wenigen
 Sekunden an ihm vorbei. Er mu&szlig;te sich davon befreien, denn sein
 Ziel war nah.
  Der Gang, der sich unendlich weit zu erstrecken schien, endete
 nun in einer kleinen Halle. Hinter ihr befand sich der hochent-
 wickelte Raumj&auml;ger des F&uuml;rsten Lnoli, der f&uuml;r einen Notfall zur
 Verf&uuml;gung stehen sollte.
  Dieser Notfall war jetzt eingetreten, fand Misan Teriks. Niemand
 w&uuml;rde sich an dem Raumfahrzeug vergreifen, so meinte man. Deshalb
 stand hier nur ein Posten Wache und der war noch dazu in eine
 auff&auml;llige, bunte Paradeuniform gekleidet.
  Die Halle hatte einen dreieckigen Grundri&szlig;. In der Mitte der
 l&auml;ngsten Seite befand sich der t&uuml;rgro&szlig;e Eingang zu dem kleinen
 Nothangar.
  Genau dort stand auch der Posten, auf sein riesiges, altert&uuml;m-
 liches Lasergesch&uuml;tz gest&uuml;tzt. Sonst war die Halle menschenleer.
  An jeder Ecke des Dreiecks endete ein Gang. Misan befand sich
 im Linken und verbarg sich hinter einem Vorsprung, um seine
 Nerven noch etwas zu beruhigen.
  'So kurz vor dem Ziel machst du nicht schlapp', sagte er sich
 und das Zittern seiner H&auml;nde begann langsam zu schwinden. Breit-
 beinig sprang er in die kahle, schlecht beleuchtete Halle und
 richtete seinen Blaster auf den Posten: "Okay, ganz ruhig. Keine
 falsche Bewegung und la&szlig; deine Waffe fallen, Mann - sofort!"
  Seine Stimme schallte gespenstisch von den W&auml;nden wieder .
 Doch der Posten reagierte sofort - und lie&szlig; seine Waffe zu
 Boden gehen.
  Vorsichtig ging Teriks auf ihn zu: "Los H&auml;nde hoch!", herrschte
 er ihn an. Als er den Wachposten erreichte, lie&szlig; Misan ihn sich
 gegen die Wand lehnen und durchsuchte ihn nach weiteren Waffen.
  Tats&auml;chlich fand er einen Lasovolver, den er weit ins Dunkel
 der Halle schleuderte.
  "Was wollen Sie?", fragte der Posten, ein junger, gedrungener
 Mann, &auml;ngstlich.
  Misan antwortete nicht, sondern zwang ihn, seine Hand auf die
 Digiba-Scheibe neben der T&uuml;r zu legen. Tats&auml;chlich schob sie sich
 in die Wand.
  "Unklug die Identit&auml;t des Postens in die Platte einzuspeichern",
 murmelte Teriks. Dann gab er dem Posten mit dem Griff seines
 Blasters einen kr&auml;ftigen Schlag auf den Hinterkopf, um ihn
 Bewu&szlig;tlos zu machen.
  Eigentlich ha&szlig;te er Gewalt, aber diese Methode war die beste
 L&ouml;sung f&uuml;r beide. Und als Geheimagent hatte man oftmals keine
 andere Alternative.
  Dann trat er durch die schmale T&uuml;r, die sich hinter ihm sofort
 wieder schlo&szlig;.

                             ***

 "Ich will augenblicklich wissen, was dieser verdammte Spion ange-
 stellt hat, um die halbe Kommunikation Pyronhas lahmzulegen!",
 schrie F&uuml;rst Lnoli wutentbrannt.
  Selbst sein dunkler Spitzbart zitterte dabei lebhaft, stellte
 Hike Hammerhart, Chef des hiesigen CIB schadenfroh fest, der ihn
 interessiert beobachtete.
  "Halten sie hier nicht Maulaffen feil, sondern unternehmen sie
 gef&auml;lligst etwas, Oberst!", entlud sich des F&uuml;rsten Wut nun auch
 auf ihn.
  "Zu Befehl, Gro&szlig;f&uuml;rst", antwortete er betont schneidig und
 wandte sich ab.
  Nerv&ouml;s trommelte der F&uuml;rst mit seinen Fingern auf den Armlehnen
 seines Throns herum. Immer noch trafen keine positiven Nachrich-
 ten ein.
  Der Cheftechniker der Stadt kam herangehetzt und nahm vor dem
 Thron Haltung an.
  "Nun Techniker Harjalas. In wieviel Minuten wird Pyronha wieder
 problemlos kommunizieren k&ouml;nnen?"
  Der F&uuml;rst betonte den 'Techniker' besonders, da er von Zivi-
 listen im allgemeinen nicht viel hielt.
  "Sir, Gro&szlig;f&uuml;rst", rief der Cheftechniker aufgeregt, "Das wird
 noch Stunden in Anspruch nehmen. Wer das angerichtet hat, mu&szlig;
 ein Spezialist gewesen sein. Er hat alle Signalverst&auml;rker durch
 Computerviren au&szlig;er Gefecht gesetzt."
  Mit einer m&uuml;den Handbewegung winkte F&uuml;rst Lnoli Harjalas weg,
 er f&uuml;hlte sich zu ausgelaugt, um sich in einem weiteren Wutaus-
 bruch abzureagieren.
  "Wir denken, da&szlig; wir jetzt das Ziel dieses Konter Fei kennen,
 Gro&szlig;f&uuml;rst", meldete sich Oberst Hammerhart wieder.
  "Was ist es?", fragte ihn Lnoli.
  "Der Not-Hangar mit ihrem pers&ouml;nlichen PLUS-Gleiter. Er wird
 fliehen wollen."
  "Das ist mir klar, da&szlig; er fliehen will", fuhr ihn der F&uuml;rst an,
 "Sie m&uuml;ssen ihn unbedingt aufhalten!"
  Hammerhart runzelte die Stirn: "Ich kann leider keine Wachein-
 heiten oder CIB-M&auml;nner in der N&auml;he des Hangars erreichen. Das
 einzige was ich tun k&ouml;nnte, ist einige meiner Agenten von hier
 aus loszuschicken, aber selbst in einem TURBOMIL d&uuml;rften sie
 eine ganze Weile dorthin brauchen."
  Dem Gro&szlig;f&uuml;rsten fehlten im ersten Moment die Worte. "Soll er
 etwa mit einem unserer modernsten Raumgleiter und dem einzigen
 Prototyp einer vernichtenden Waffe aus unserer Stadt, die voll
 ist von Soldaten, entfliehen k&ouml;nnen? Das w&uuml;rde mich zum Gesp&ouml;tt
 der NASO machen. Wer wei&szlig; ob der K&ouml;nig noch zu mir halten w&uuml;rde?",
 brach es nach einem kurzen R&auml;uspern daf&uuml;r um so intensiver aus
 ihm hervor.
  'Das w&auml;re kein schlechter Nebeneffekt', fuhr es Oberst Hammer-
 hart unwillk&uuml;rlich durch den Kopf. Laut sagte er: "Das wird
 nicht passieren, Gro&szlig;f&uuml;rst. Sollte es dem Agenten gelingen, mit
 dem J&auml;ger zu entkommen, wird ihn unsere im Orbit stationierte
 Raumflotte abfangen. Dem Rostblock lassen wir diese unsch&auml;tz-
 baren G&uuml;ter nicht in die H&auml;nde fallen. Wenn sie erlauben, werde
 ich sofort die notwendigen Anweisungen geben."
  Hike Hammerhart zog sich verneigend zur&uuml;ck. Nachdem er ein paar
 Befehle in sein Kehlkopfmikrofon gesprochen hatte, die die NASO-
 Flotte im All instruieren sollte, winkte er einen seiner Unter-
 gebenen zu sich: "Leutnant, geben sie jetzt den Befehl an die
 Agenten weiter, da&szlig; sie eingreifen k&ouml;nnen!"
  "Aber Oberst, schon direkt nach dem Defekt h&auml;tten wir sie akti-
 vieren k&ouml;nnen... ", wandte der CIB-Offizier ein.
  Er spielte auf das geheime, unabh&auml;ngige Kommunikationssystem des
 NASO-Geheimdienstes an, von dem selbst F&uuml;rst Lnoli nichts wu&szlig;te.
  Hike Hammerhart, der sich schon abgewandt hatte, drehte sich
 energisch um: "F&uuml;hren sie unverz&ouml;glich ihren Befehl aus oder ich
 mu&szlig; sie ersetzen lassen!"
  Der Leutnant wu&szlig;te, was das bedeutete und schluckte: "Zu Befehl,
 Sir." Er salutierte und ging dann hastig in Richtung des Haupt-
 zentralenausgangs davon.
  'Du hast deine Chance gehabt, Konter Fei oder wie du auch hei&szlig;en
 magst, dachte Oberst Hike Hammerhart.

                             ***

 Misan Teriks sah sich kurz in dem relativ kleinen Hangar um, den
 er betreten hatte. Au&szlig;er dem einen gro&szlig;en, brandneu wirkenden
 Raumgleiter war aber nicht viel interessantes zu sehen.
  Die Stirnseite der quaderf&ouml;rmigen Halle war ein einziges
 riesiges Tor, da&szlig; sich, wie er wu&szlig;te, von dem Gleiter aus &ouml;ffnen
 lie&szlig;.
  Langsam ging er auf den schnittigen Raumj&auml;ger zu. Seine
 Konstrukteure hatten scheinbar eine gro&szlig;e Portion Humor gehabt,
 denn an den Seitenfl&auml;chen stand in gro&szlig;en, blauen Lettern:
 'PLUS' und klein darunter: "Prima Leben Und Sterben".
  Oder sollte dies eine Warnung sein?
 Misan machte sich jetzt lieber keine unn&ouml;tigen Gedanken deswegen,
 sondern fing an, die an der linken Tragfl&auml;che eingehackte, d&uuml;nne
 Plastikleiter hinaufzusteigen.
  Pl&ouml;tzlich war ihm als h&auml;tte er ein kurzes Piepen in seinem Ohr-
 h&ouml;rer wahrgenommen. 'Das kann gar nicht sein', dachte er, 'jetzt
 kriege ich schon Sinnest&auml;uschungen vor Abgespanntheit.'
  Oben angekommen hakte er die Leiter aus und ging vorsichtig auf
 das flache Cockpit zu, das sich kaum vom stromlinienf&ouml;rmigen Leib
 des Raumfahrzeugs abhob.
  Dabei fiel ihm ein kurzes Stativ mit Kugelgelenk auf, da&szlig; direkt
 hinter der Einstiegshaube fast wie eine Antenne aufragte. Das
 kleine drehbare Gesch&uuml;tz, was eigentlich darauf geh&ouml;rte, fehlte.
  Pr&uuml;fend zog er das neuartige Ger&auml;t aus seinem Overall, f&uuml;r das
 er schon soviel gewagt hatte.
  K&ouml;nnte es klappen ?
 Er betrachtete die Waffe genau von allen Seiten, wobei ihm auf-
 fiel das die Bezeichnung 'Defluxtrusator' nur klein aufgedruckt
 war. In gro&szlig;er Schrift eingepr&auml;gt war jedoch das Wort 'REPIX' .
  Pr&uuml;fend setzte Teriks das Ger&auml;t auf das Stativ und siehe da,
 tats&auml;chlich schien es wie daf&uuml;r gemacht. Jetzt mu&szlig;te er nur
 noch das rote und das blaue Kabel, die aus dem REPIX-Ger&auml;t
 herauslugten in die richtigen Buchsen unter dem Kugelgelenk
 stecken.
  Leider waren dort keine Symbole angebracht, so da&szlig; er sich f&uuml;r
 eine von zwei M&ouml;glichkeiten entscheiden mu&szlig;te. Misan Teriks
 hoffte, da&szlig; er die richtige genommen hatte und b&uuml;ckte sich, um
 die durchsichtige Cockpit-Haube anzuheben, die sich mit einem
 Schmatzen &ouml;ffnete.
  Jetzt, wo er in dem bequemen Sitz Platz genommen hatte,
 studierte er die Schiffskontrollen vor sich. Misan fand sich
 schnell ein, da er schon einmal einen &auml;hnlichen Typ geflogen
 hatte.
  Er zog die Haube &uuml;ber sich hinunter, bis sie sich wieder mit
 einem Saugger&auml;usch schlo&szlig;. Dann dr&uuml;ckte er auf den goldgelb
 blinkenden Schalter auf dem das Hallentor abgebildet war, das
 sich auch sofort ger&auml;uschlos &ouml;ffnete.
  Zufrieden fuhr er die Turbinen hoch, hob ab und beschleunigte,
 um aus dem Hangar herauszukommen.
  Der Tank und die Akkus waren voll, wie ein kurzer Blick seine
 Erwartungen best&auml;tigte. Also konnte es losgehen.
  Als er in den rotgrauen Himmel hineinscho&szlig; und die riesige
 Pyramidenstadt Pyronha hinter sich verschwinden sah, konnte er
 dort einige kleine Silberp&uuml;nktchen erkennen, die sich ebenfalls
 von ihr gel&ouml;st hatten.
  Er beschleunigte zus&auml;tzlich und etwa eine Minute sp&auml;ter hatte
 er die Atmosph&auml;re von 'KATARRHUS' hinter sich gelassen.
  Misan Teriks wu&szlig;te, da&szlig; es noch nicht so einfach ausgestanden
 sein w&uuml;rde. Doch ein paar Minuten Flug durch das All hatte er
 Ruhe vor Feinden. Und er stellte fest, da&szlig; KATARRHUS von weiter
 weg gar nicht so &uuml;bel aussah.
  Als er dessen zweiten Mond hinter sich gelassen hatte, hingen
 sich mehrere NASO-Abfangj&auml;ger an sein Heck und begannen sofort
 mit ihren Bordgesch&uuml;tzen zu feuern. Sie mu&szlig;ten wohl von einer
 Mondbasis gekommen sein.
  Obwohl er jetzt viele Haken schlug und seinen PLUS-J&auml;ger hoch-
 und runterzog, um ihren Sch&uuml;ssen zu entgehen, kamen sie langsam
 immer n&auml;her.
  Die Beschleunigungswerte des PLUS waren also nicht wesentlich
 h&ouml;her, als die anderer Raumgleiter. Seine Vorz&uuml;ge mu&szlig;ten auf
 anderen Gebieten liegen. 'Wahrscheinlich Reichweite, oder so',
 verschwendete er einen kurzen Gedanken daran.
  'REPIX', dachte er dann und musterte die Waffenausl&ouml;ser auf
 seinem Steuerkn&uuml;ppel. Als er ohne zu z&ouml;gern auf den roten Knopf
 f&uuml;r die Heckwaffe dr&uuml;ckte, hatte das unglaubliche Konsequenzen.
  Was eigentlich mit seinen Verfolgern h&auml;tte passieren sollen,
 wirkte sich jetzt scheinbar auf ihn aus.
  'Das waren also doch die falschen Kontakte gewesen', dachte er
 noch. Ihm war,als ob der ganze Raumgleiter in die Waffe hinein-
 gezogen w&uuml;rde. Blitzschnell tauchte der Lauf der 'REPIX'-Waffe
 vor ihm auf, die Miniaturisierung mu&szlig;te also in einer wahnsinnig
 hohen Geschwindigkeit vonstatten gehen.
  Mitten im Trudeln des kleiner werdens tauchte pl&ouml;tzlich neben
 seinem PLUS-J&auml;ger ein gro&szlig;er Metallblock auf. 'Das ist also mit
 ihm passiert', dachte Misan, bis er mit seinem Gleiter f&uuml;r einen
 Augenblick in absolute Dunkelheit eintauchte.

                             THE END...

 Teil 1 erschien in der letzten Ausgabe (Nr. 3) des AmZeigers.
</PRE>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803b1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0398/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
