<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Erblast-II / Erblast</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Erblast-II / Erblast</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
Noch vor nicht langer Zeit registrierte ich es nicht mal besonders, wenn
mir ein Mensch begegnete, der auff&auml;llig schwarz gekleidet war. Doch seit
meinem Leben ein weibliches Wesen hinzutrat und mir eine unbekannte
gleichsam traumhafte wie reale Welt offenbarte, scheint diese mich mit
Hilfe raffinierter Zuf&auml;lle zu sich ziehen zu wollen.
</P><P>
Als ich vor kurzem ohne h&ouml;here Motivation an einer &ouml;ffentlichen
Anh&ouml;rstation in das zweite Erblast-Album reinh&ouml;rte und dabei von
Cover-Art und Musik gleichsam beeindruckt war, hatte ich keine Ahnung,
da&szlig; auch dieses einer ihrer Boten war - dabei scheint es mir inzwischen,
als w&auml;re dies nicht zu &uuml;bersehen und -h&ouml;ren gewesen.
</P><P>
Wenig sp&auml;ter fand ich einen Flyer, der ein Konzert besagter Gruppierung
ank&uuml;ndigte und beschlo&szlig;, mir dies mal anzuschauen. Doch wie schlug ich
mir innerlich vor den Kopf, als ich mich abermals von dunklen Gestalten
umgeben sah. Ungeachtet dessen wu&szlig;ten mich Erblast dort in ihren Bann zu
ziehen, sicherlich nicht zuletzt dank Unterst&uuml;tzung der Vorgruppe
&quot;la floa maldita&quot;, und nachdem ich die CD zwei weitere Male probegeh&ouml;rt
hatte, wurde sie letztlich mein.
</P><P>
Ich bin neu in dieser Welt und somit obliegt es mir kaum, ihre
Hintergr&uuml;nde, Motive, Kultur, Geflogenheiten, Geschichte zu benennen.
Wor&uuml;ber ich aber berichten kann, ist dieses Album.
</P><P>
Aber bevor es losgeht, l&ouml;schen wir noch das Licht und entfachen die
Kerze zu unserer Linken. Schon rieseln die ersten T&ouml;ne in das flackernde
Dunkel...
</P><P>
...ein Tropfen trifft die spiegelglatte Oberfl&auml;che eines unterirdischen
Sees. An den feuchtkalten W&auml;nden der H&ouml;hle hallt der Aufprall dumpf wieder.
Ein zweiter, ein dritter und etliche weitere folgen. Bewegung kommt in das
stille Gew&auml;sser, rhythmisch entstehen kreisrunde Wogen, die sanft am Ufer
zerschellen. Die Stimme Oswald Henkes setzt ein...
&quot;
&quot;<B>Ismael</B>&quot;, der erste Track des Albums, ist der einzige, den man im
klassischen Sinne als Song bezeichnen k&ouml;nnte, er ist auch der einzige
englisch vorgetragene. Im Gegensatz zu den anderen Kompositionen des
Albums ist er sogar so rhythmisch, da&szlig; er den K&ouml;rper in langsam
schwingende Bewegungen versetzen kann.
</P><P>
Schon das zweite St&uuml;ck, &quot;<B>Alles was sch&ouml;n ist</B>&quot;, ist g&auml;nzlich anders...
...langsam schwillt ein tiefes Schwingen an, h&auml;lt sich, w&auml;hrend O.H. mit
seinem Vortrag beginnt. Was hier zu h&ouml;ren ist, l&auml;&szlig;t sich als vertontes
Gedicht bezeichnen - und was f&uuml;r eines. W&auml;hrend es inhaltlich in
tiefsinnigen Satzfetzen den R&uuml;ckblick auf die fr&uuml;hjugendliche Liebe,
die erste Liebe, darstellt, wirkt die betont deutliche Vortragsweise
O.H.'s vorwurfsvoll, geradezu verachtend. Unterst&uuml;tzt wird dies freilich
durch die frostig-d&uuml;stere Musik, die ihn begleitet.
</P><P>
&Auml;hnlich verh&auml;lt es sich mit dem zweigeteilten Titel &quot;<B>Wolf</B>&quot;, die Mehrzahl
der St&uuml;cke ist jedoch instrumentaler Natur. In der ewigen Suche nach der
&quot;Wahrheit&quot;, ebenfalls ein Zweiteiler, brauen sich dunkle Wolken zusammen,
wird ein anhaltender Spannungsbogen aufgebaut, der sich aber nie entl&auml;dt.
</P><P>
Nach dem zweiten rhythmischeren Track &quot;<B>Warum</B>&quot; schlie&szlig;t das Album
schlie&szlig;lich mit einem leicht irisch klingenden Cello-Violinen-Duett &quot;<B>Was</B>
<B>liebt Ihr den, der aller Welt verha&szlig;t ist?</B>&quot;.
</P><P>
Die neun Titel dieses Albums bieten 47:35 Minuten lang frostige und
d&uuml;stere Musik, teilweise mit poetischen Texten in beschw&ouml;render
Vortragsweise verziert - keine leichte Kost f&uuml;r nebenbei, sondern
schweres geistvolles Material zum zur&uuml;ckgezogenen Genie&szlig;en.
</P><P>
Das Booklet ist nur achtseitig, aber ansprechend gestaltet und mit einem
sehr sch&ouml;nen Text, der der Musik ein Motiv verleiht, und den Texten der
beiden benannten vertonten Gedichte versehen.
</P><P>
&quot;<B>Erblast-I</B>&quot; enth&auml;lt &uuml;brigens auch sehr sch&ouml;ne Titel, vor allem auch mehr
dieser herrlichen Texte, dort allerdings meinem Empfinden nach leider
nicht so stark vorgetragen, wie hier.
</P><P>
Der Preis f&uuml;r beide CD's betr&auml;gt jeweils 30,-DM und wer dann noch nicht
genug hat, sollte einen Blick auf die Auswahl von &quot;Goethes Erben&quot; werfen,
meinem Verst&auml;ndis nach Oswald Henkes erstem Projekt. Dort k&ouml;nnte die
Scheibe auch zu finden sein, wenn sie nicht unter dem Anfangsbuchstaben
&quot;E&quot; einsortiert ist.
</P>
&copy; 1997 KODEX [edition Suhshia Light]<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803cd3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
