<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Mutter und Sohn</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Mutter und Sohn</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
Bewegte Bilder nennt man gern die Zelluloid-Illusionen, wenn das Wort
Film einem zu n&uuml;chtern klingt. Bewegte Bilder. Aber ist dies wirklich
eine passende Beschreibung f&uuml;r das, was man gr&ouml;&szlig;tenteils in den Kinos
zu sehen bekommt? Sind das wirklich Bilder? Oder ist es nicht viel eher
schon l&auml;ngst etwas vollkommen eigenes, etwas, das &uuml;ber schlichte Bilder
bei weitem hinaus geht?
  </P><P>
Bilder schweigen in der Regel und lassen die Gedanken des Betrachters
sprechen, Filme hingegen reden in einem fort, erz&auml;hlen Geschichten,
belehren, vermitteln Botschaften, unterhalten oder br&uuml;llen gar. Bilder
sind bescheiden und stumm, Filme sind laut und eitel... die meisten
zumindest.
</P><P>
Denn Alexander Soljokov hat einen schweigenden Film geschaffen oder
besser gesagt ein wirkliches bewegtes Bild, genauer bewegtes Gem&auml;lde.
</P><P>
Zun&auml;chst zeigt dieses die Ecke eines b&auml;uerlichen Raumes, die von einem
diffusen Lichteinfall sp&auml;rlich erhellt wird. Man kann einen jungen Mann
ausmachen, der, seinen Kopf auf einen Ellenbogen st&uuml;tzend, an der Seite
einer &auml;lteren Frau liegt, die, vom Dunkel fast verborgen, zu schlafen
scheint. Das Bild wirkt etwas gedehnt und an den R&auml;ndern unscharf.
Au&szlig;erdem wirken Farben und die seichten Konturen, als w&auml;re es handgemalt.
Doch war da nicht eben ein Zucken in den Mundwinkeln? Und da - bewegten
sich nicht eben die Augenlider? Bewegung kommt in das Gem&auml;lde. Der junge
Mann beginnt, in ruhigem und gef&uuml;hlvollem Ton mit der alten Frau zu
sprechen. Geradezu z&auml;rtlich. Es dauert, bis die leise und st&ouml;hnende
Antwort kommt. Es entwickelt sich ein langgezogener und dennoch nicht
z&auml;her Dialog, in dem wir erfahren, da&szlig; es sich um <B>Mutter und Sohn</B>
handelt. Sie beschlie&szlig;en, spazieren zu gehen.
</P><P>
Die beiden Hauptfiguren - die einzigen Figuren - des Films wirken
vom ersten Augenblick an unverst&auml;ndlich, befremdlich, und doch sehr
menschlich.
</P><P>
Aber &quot;Augenblick&quot; ist ein Wort, das hier v&ouml;llig unangebracht ist. In
Soljokovs Film gibt es keine Augenblicke, auch keine Sekunden. Alles
geschieht im Minutentakt, mit unglaublicher Ruhe, die den Zuschauer
zun&auml;chst sehr verwirrt, nach einer Eingew&ouml;hnungsphase aber in ihren
Bann zieht.
</P><P>
In unglaublich langen Einstellungen zeigt der Regisseur farbverfremdete
Landschaften, die gleichzeitig eine unglaubliche Sch&ouml;nheit und fr&ouml;stelnde
Distanz ausstrahlen. Einen Bezug zu ihnen erh&auml;lt der Zuschauer nur durch
Mutter und Sohn, die sie jedoch weder durch W&auml;rme noch N&auml;he bereichern
k&ouml;nnen. Irgendwo in der Ferne pustet ein Zug wei&szlig;e Wolken in den Himmel.
Ein andernmal sieht man durch das Fenster blickend in der Ferne eine
Frau &uuml;ber einen H&uuml;gel gehen. Bedeutungslos, ohne Konsequenz, unwesentlich.
Einsamkeit wird sp&uuml;rbar, die Einsamkeit des Sohnes und seiner sterbenden
Mutter. Sie tun nichts, als Leben, sie existieren, sind einfach da, Arm
in Arm und doch weit voneinander entfernt, ebenso wie der Zuschauer.
Der Mensch ist allein, isoliert, der Betrachter ebenso wie die
Betrachteten und keiner kann dem anderen n&auml;her kommen, so sehr er
dies auch w&uuml;nscht.
</P><P>
All dies erz&auml;hlt Soljokov nicht, er malt es. Die Kamera &auml;ndert nur
tr&auml;ge ihre Blickwinkel, Bewegungen laufen langsam und ruhig ab, manchmal
geschieht gar nichts. Schnitte werden zu einer Seltenheit.
</P><P>
&quot;Mutter und Sohn&quot; ist nicht nur au&szlig;ergew&ouml;hnlich, er ist anders. Er ist
nicht umwerfend, nicht fesselnd, alles andere als spannend. Und doch
beeindruckend und vor allem sch&ouml;n. Dieser Film verdient einen Rahmen.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803fil4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803b1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
