<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Shadow of the Moon</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Shadow of the Moon / Blackmore's Night</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
<B>Ritchie Blackmore</B>, seinerzeit Gr&uuml;ndungsmitglied von <B>Deep Purple</B>, gr&uuml;ndete
1995 eine neue Gruppierung mit dem Namen Rainbow. 1997 kreierte der Kern
dieser Gruppe, bestehend aus Ritchie Blackmore selbst, Candine Night und
Pat Regan, zusammen mit The Minstrel Hall ein neues Album mit dem Titel
&quot;<B>Shadow of the Moon</B>&quot;.
</P><P>
Jenes pr&auml;sentiert sich zun&auml;chst in einem Plastcover mit Booklet, dessen
Titelseite ein ansprechendes handgemaltes Bild ziert, das den H&ouml;rer auf
die Zeit einstimmt, die durch die Musik repr&auml;sentiert wird. "Shadow of
the Moon" bietet knapp gesagt die Wiederaufarbeitung mittelalterlicher
Weisen oder verwandten Stoffes f&uuml;r Ohren von 1997. Dennoch b&uuml;&szlig;t die
Musik nichts von ihrer Stimmung ein.
</P><P>
Die Lieder sind einerseits besinnlich, nachdenklich, romantisch und sehr
gef&uuml;hlvoll, andererseits besitzen sie aber eine au&szlig;ergew&ouml;hnliche Kraft,
die den H&ouml;rer ergreift, ihn emporhebt und mit sich davontr&auml;gt. Sie sind
wie Oszillatoren, die auf die Stimmung des H&ouml;renden aufgreifen und
steigern.
</P><P>
Als Themen der 15 Titel dienten unter anderem alte Sagen, die Liebe oder
Lebensweisheiten, wie aus den im Booklet abgedruckten Texten zu entnehmen
ist. Die musikalische Basis reicht neben &uuml;berlieferten Volksweisen von
ebenso klassichem Stoff, wie Peter Tchaikovskys &quot;<B>Schwanensee</B>&quot;, bis zu so
jungem wie Rednex' &quot;<B>Wish you were here</B>&quot;.
</P><P>
Was Blackmore und Co. hier geschaffen haben sind nicht gerade kunstvolle
oder beeindruckende Kompositionen oder Instrumentalisierungen, das ganze
wirkt sogar minimalistischer, als es in Wahrheit ist, aber gerade die
Einfachheit dieser Musik ist einfach genial. Die weichen Gitarren-Melodien,
verziert mit der gef&uuml;hlvollen Stimme Candice Nights, gehen auf direktem
Wege ins Ohr und erschaffen je nach Gem&uuml;tszustand eine wohlige Stimmung
der Geselligkeit oder sch&uuml;ren eine vielleicht bereits vorhandene Sehnsucht
wonach auch immer.
</P><P>
Der Titelsong wurde auch als Single ausgekoppelt, wer sich aber zum Kauf
dieser verf&uuml;hrt f&uuml;hlt, sollte lieber gleich zum Album greifen, denn selbst
von den darauf enthaltenen 62:41 Minuten Musik bekommt man lange nicht
genug.
</P>
&copy; 1997 Ritchie Blackmore / ca. 30,-DM<BR>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
