<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Event Horizon</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Event Horizon</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
Zu dieser Kritik mu&szlig; ich eine <B>Anmerkung</B> machen, n&auml;mlich die, da&szlig; ich den
Film als Sneak-Preview in O-Ton gesehen habe. Daraus l&auml;&szlig;t sich ableiten,
da&szlig; meine mangelhaften Englisch-Kenntnisse nat&uuml;rlich dazu f&uuml;hrten, da&szlig;
hier und da diverse Verst&auml;ndnisl&uuml;cken des verbalen Materials auftraten.
Allerdings hielt sich dies hier in Grenzen. Au&szlig;erdem fehlt hierbei
nat&uuml;rlich die Synchro-Komponente, die doch viel in einem Film
zerst&ouml;ren kann. Aber ich leg einfach mal los.
</P><P>
Der Titel dieses Werkes ist &quot;<B>Event Horizon</B>&quot; und das wird auch der
deutsche Titel sein, ein Poster hab' ich n&auml;mlich schon erblicken k&ouml;nnen.
Und wie dieses auch sofort ersichtlich machte, handelt es sich dabei um
Science Fiction - zun&auml;chst zumindest.
</P><P>
Alles f&auml;ngt erstaunlich gut an, obgleich es gerade zu Beginn sehr an Alien
erinnert. Mit viel Stimmung, beeindruckender Kameraf&uuml;hrung und sehr sch&ouml;nen
Special-Effects wird der Kinog&auml;nger in eine relativ nahe Zukunft eingef&uuml;hrt,
n&auml;mlich ins Jahr 2047.
</P><P>
Bevor er aber in diesen Genu&szlig; kommt, wird er gleich gewarnt, durch eine
kurze Szene, die aber den ganzen Film zu repr&auml;sentieren vermag und die
sich auch sofort ins Ged&auml;chtnis einbrennt...
</P><P>
Eine Kamera zoomt in die d&uuml;stere Commandobr&uuml;cke eines Raumschiffes, &uuml;ber
ein paar Konsolen hinweg. Hinter einer zentralen Konsole sieht man im
Gegenlicht, das von der gegen&uuml;berliegenden Wand kommt, den schwarzen Umri&szlig;
eines menschlichen K&ouml;rpers, der in Schwerelosigkeit rotiert. Die Kamera
zoomt immer weiter heran, nun f&auml;llt Licht aus einer anderen Richtung auf
den K&ouml;rper und seine Mi&szlig;gestaltetheit wird kurz aber einpr&auml;gsam sichtbar.
</P><P>
Schnitt.
</P><P>
Wie gesagt geht es ruhig weiter. Wir befinden uns an Bord eines
Rettungsschiffes, das von der Erde zum Neptun startet, da von dort ein
Signal der seit sieben Jahren verschollenen "Event Horizon" aufgefangen
wurde. Nicht sehr hoch motiviert bricht die milit&auml;risch anmutende
Besatzung auf und findet tats&auml;chlich das alte Schiff, eine Mixtur aus
der 2001-Zigarre und einem "Bird of Prey", die man aus StarTrek kennt,
die wirklich einiges hermacht. Sp&auml;testens hier beginnt ein fesselnder
Spannungsfaden, der bis zum Ende dieses Filmes nicht mehr abrei&szlig;en soll.
</P><P>
Die Idee hinter der Story, n&auml;mlich die &Ouml;ffnung eines Loches in eine Welt
(die H&ouml;lle), aus der das Grauen pers&ouml;nlich in unsere gelangt, ist alt,
wurde aber interessant variiert.
</P><P>
Sehr schnell stellt sich heraus, da&szlig; die Kategorisierung als
Science-Fiction etwas voreilig war, da&szlig; dieser Film noch wesentlich mehr
in Richtung Horror geht, als Alien, da&szlig; er sogar eher Horror als
Science-Fiction ist, nur eben kein Spinner-Horror, sondern wirklich
spannender ernsthafter Thrill.
</P><P>
Sp&auml;testens bei dieser Erkenntnis hat man die ersten ekligen Szenen bereits
gesehen...eine mit Ged&auml;rmen, Blut und Knochen verklebte Cockpitwand, eine
schwerelos treibende, entstellte Leiche ohne Augen (die aus der ersten
Szene) und das ist erst der Anfang. "Event Horizon" ist das schlichte
Grauen, die filmische Inkarnation krankhaftester Fantasien.
</P><P>
Das ganze entwickelt sich ziemlich heftig, und so bekommt man -
gottseidank nur sehr kurz - die ekligsten Entstellungen gezeigt, die
man sich nur denken kann. Der bekannte aufgeschlitzte Polizist in "Das
Schweigen der L&auml;mmer" ist vergleichsweise harmlos dagegen.
</P><P>
Das alles dient durchaus der Story, wird ben&ouml;tigt, um die Stimmung zu
erhalten, aber dennoch h&auml;tte es nicht in diesem Ma&szlig;e sein m&uuml;ssen. &quot;Event
Horizon&quot; ist sicher eine Herausforderung an Masken- und Kulissenbildner
gewesen, aber vielleicht h&auml;tten sie weniger ehrgeizig sein sollen.
</P><P>
Auch st&ouml;rend empfand ich die &uuml;bertriebene Spr&uuml;cheklopferei, die zwar
teilweise aufheitert, in dieser H&auml;ufung aber zu platt wirkt. Am Ende hat
man somit ein einziges Space-Gemetzel, rein technisch durchaus genial,
allerdings mit einer zu einfachen Story, zu oberfl&auml;chlichen Rollen und
zu viel Blut, dessen Bilder aber noch ein Weilchen durch den Kopf
geistern.
</P><P>
Gelungen allerdings ist das vorhersehbare Ende, das einem auch dank
der Wahl der End-Title-Musik nochmal ein kleines vers&ouml;hnendes L&auml;cheln
abzuringen wei&szlig;, da es wirkt, als wolle der Regisseur uns sagen:
&quot;Nehmt's nicht so tragisch, ist halt nur so'n Horror-Quark&quot;.
</P><P>
Im &uuml;brigen ist mir die restliche Filmmusik nie aufgefallen, was
einerseits f&uuml;r sie selbst, andererseits f&uuml;r die Spannung des Films
spricht.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803fil1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803fil3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
