<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Media Mal X</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>So far...the best of Sinead O'Connor</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
1989 sang sich Sinead O'Connor mit &quot;<B>Nothing Compares 2 U</B>&quot; in die Herzen
vieler Radioh&ouml;rer, was dazu f&uuml;hrte, da&szlig; dieser Titel nicht nur wochenlang
die Deutschen Charts anf&uuml;hrte, sondern auch Nummer 1 in der damaligen und
bisher einzigartigen deutschlandweiten Top2000 belegte.
</P><P>
Sehr viel mehr h&ouml;rte die breite &Ouml;ffentlichkeit nicht von ihr. 1994
hangelte sie sich mit &quot;<B>Thank you for hearing me</B>&quot; nochmal die Charts
hinauf, konnte aber nicht an den alten Erfolg ankn&uuml;pfen. Das dies aber
bei weitem nicht alles ist, was es von der Irin zu h&ouml;ren gibt, beweist
nun eine umfangreiche Best-of-Sammlung.
</P><P>
Diese beinhaltet denn tats&auml;chlich auch Songs von jedem ihrer bisher
sieben erschienenen Alben, vom 1987er Debut &quot;<B>The Lion and the Cobra</B>&quot;
bis zu ihrer meiner Meinung nach sehr sch&ouml;nen aber leider &uuml;berteuerten
&quot;<B>Gospel Oak EP</B>&quot;, einem Ende 1997 ver&ouml;ffentlichten Kurzalbum mit 6 Titeln
(in etwa 20 Minuten), das f&uuml;r 25,-DM im Handel zu haben ist...20,-DM
h&auml;tten's auch getan.
</P><P>
Die typische Sinead O'Connor findet man wahrscheinlich auf ihren auch
bekanntesten Alben &quot;<B>I do not want what I haven't got</B>&quot; und &quot;<B>Universal
Mother</B>&quot;. Einzuordnen ist die Musik, die man hier vorfindet, vermutlich
am ehesten als "Irish Pop/Rock", im Grunde ist sie aber einzigartig und
auch sofort als die Sinead O'Connors erkennbar, da bei ihr nicht nur die
Texte von Herzen kommen, sondern auch ihre Musik selbst, ihre Stimme mit
tiefer &Uuml;berzeugung und viel Gef&uuml;hl sprechen. Wer tanzbares erwartet, liegt
also falsch, wenn auch einige Songs durchaus ziemlich "poppig" sind.
</P><P>
Die Auswahl der Titel f&uuml;r ein Best-of-Album erscheint gerade angesichts
dieser beiden Alben ein sehr schweres Unterfangen, denn hier klingt ein
Song sch&ouml;ner als der andere. So fehlen mir denn auch &quot;A perfect Indian&quot;,
&quot;All Apologies&quot; und &quot;Scorn not his simplicity&quot; vom &quot;Universal Mother&quot;-
Album, aber da mu&szlig; ich wohl der Einsicht gew&auml;hr geben, da&szlig; eine CD nunmal
nur eine begrenzte Kapazit&auml;t hat. Angesichts dieser Tatsache w&uuml;rde ich die
Auswahl als sehr gelungen bezeichnen, zumal neben Vertretern der erw&auml;hnten
eigenen Alben auch &quot;Empire&quot;, den sie f&uuml;r Bomb the Bass gesungen hat, und
&quot;You made the thief of your heart&quot;, der auf dem Soundtrack zu &quot;In the name
of the father&quot; zu finden ist, enthalten sind. Insgesamt handelt es sich um
15 Titel mit einer Gesamtspielzeit von 73:44 Minuten.
</P><P>
Somit bietet &quot;So far...&quot; einen sehr sch&ouml;nen Querschnitt f&uuml;r alle, die
bisher weitestgehend ohne Sinead leben konnten. Sie finden hier sch&ouml;ne,
gef&uuml;hlvolle Musik sowohl f&uuml;r kuschelige oder melancholische Stunden, wie
auch f&uuml;r Minuten der Hochstimmung, die wohl zum besten geh&ouml;rt, was derzeit
zu erstehen ist.
</P><P>
Man sollte auf jeden Fall einmal probeh&ouml;ren und wenn Herz und Ohren dabei
&quot;Kaufen! Kaufen!&quot; rufen, so sei geraten, genau davon Abstand zu nehmen.
Stattdessen sollte man sich lieber einmal die benannten Erfolgsalben
anh&ouml;ren und sich &uuml;berlegen, ob man nicht vielleicht eines von ihnen nimmt.
</P><P>
Wer sie schon hat, sollte ebenfalls die Finger von der Best-of lassen,
da ca. die H&auml;lfte der Titel von diesen beiden stammen. Das Geld ist
vermutlich besser investiert, indem man sich ein weiteres Album zulegt.
</P><P>
Das Debut-Album und &quot;Am I not your girl?&quot;, das Sinead ihrer Mutter widmete,
auf dem sie bekannte Gospelsongs covert und das leider nur mit einem Titel
(&quot;Don't cry for me Argentina&quot;) auf der hier besprochenen Scheibe vertreten
ist, sind bereits seit l&auml;ngerem im SmilePrice-Angebot, was bedeutet, da&szlig;
sie f&uuml;r h&ouml;chstens 20,-DM zu haben sind.
</P><P>
Auch das Booklet bietet eigentlich alles, was man sich von einer Best-of
w&uuml;nscht, vorausgesetzt man z&auml;hlt Songtexte nicht dazu, aber die haben da
meiner Meinung nach auch nichts zu suchen. Die Front schm&uuml;ckt ein gro&szlig;es
CloseUp der S&auml;ngerin, dahinter geht's mit Text weiter. John Waters schrieb
einen Kommentar mit dem Titel &quot;Voice of the dead unburied.&quot;, der Sineads
musikalische Geschichte zum Inhalt hat. Danach folgt eine Auflistung der
Titel mit den &uuml;blichen Angaben und von welchem Album sie jeweils stammen.
</P><P>
Alles in allem ist diese Best-of ein sehr gelungenes musikalisches Portrait
einer der begnadetsten S&auml;ngerinnen unserer Zeit, die dar&uuml;ber hinaus auch
noch das Herz am richtigen Fleck hat. Sie empfielt sich besonders f&uuml;r
diejenigen, die noch keines ihrer Alben haben, die anderen sollten dar&uuml;ber
nachdenken, ob es nicht besser w&auml;re, diesen lieber gleich ein weiteres zur
Seite zu stellen.
</P>
&copy; 1997 Chrysalis Records Ltd. / ca. 30 DM<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
