<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Planet der Habenichtse</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Planet der Habenichtse&quot; / Ursula K.LeGuin</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrnades.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
Originaltitel: &quot;The Dispossessed&quot;
</P><P>
Original:      &copy; 1974 Ursula K.LeGuin<BR>
&Uuml;bersetzung:   &copy; 1976 Wilhelm Heyne Verlag GmbH & Co. KG, M&uuml;nchen<BR>
mein Exemplar: &copy; 1987 Verlag Das Neue Berlin, Berlin (DDR)<BR>
</P><P>
Soweit meine Erinnerungen mich nicht tr&uuml;gen, war es mein 14. Geburtstag,
an welchem ich dieses Buch geschenkt bekam, weil meine Eltern bemerkt
hatten, da&szlig; ich eine Vorliebe f&uuml;r Science Fiction herausgebildet hatte.
Zu jener Zeit las ich aber nur noch das, was mir die Schule zu lesen
auftrug. Andere Medien hatten mein Interesse geweckt und nahmen meine
Zeit in Anspruch. 6 Jahre sp&auml;ter hatte ich die Schule beendet und eine
Unmenge an Zeit brach &uuml;ber mich herein. Also begann ich wieder zu lesen
und nach "Drachenkreuzer Ikaros" erweckte pl&ouml;tzlich dieser 450 Seiten
schwere Roman mein Interesse, den ich in all den Jahren unz&auml;hlige Male
in den H&auml;nden hatte, ohne ihn auch nur einmal zu &ouml;ffnen. Dies &auml;nderte
sich nun...
</P><QUOTE>
&quot;Da war eine Mauer. Besonders wichtig wirkte sie nicht. Sie bestand aus
 roh zugehauenen, verm&ouml;rtelten Feldsteinen; ein Erwachsener konnte m&uuml;helos
 dar&uuml;ber hinwegblicken, und sogar ein Kind konnte sie erklettern. Wo sie
 die Stra&szlig;e kreuzte, besa&szlig; sie kein Tor, sondern reduzierte sich zu reiner
 Geometrie, zu einer Linie, einem Symbol f&uuml;r Grenze. Doch dieses Symbol,
 diese Idee war real. Und sie war wichtig. Seit sieben Generationen gab es
 nichts Wichtigeres auf der Welt als diese Mauer. ...&quot;</QUOTE>
<P>
So f&auml;ngt es an. Die Mauer spielt eine sehr gro&szlig;e Rolle in diesem Buch,
sie ist ein immer wiederkehrendes Motiv f&uuml;r alle Arten von Barrieren,
besonders auch von Denkbarrieren. Die Welt, von der hier die Rede ist,
ist nicht die Welt, die wir kennen. Ihre Bewohner - die Odonier - nennen
sie Anarres und sie ist der Schwesternplanet von Urras, Heimat der
Urrasti.
  </P><P>
Dies ist das Szenarium, in das die Autorin den Leser einf&uuml;hrt: Urras, ein
sch&ouml;ner Planet, reich an Rohstoffen, reich an Leben, von verschiedenen
V&ouml;lkern bewohnt, die in Staaten unterschiedlicher, u.a. kapitalistischer
und sozialistischer Gesellschaftsformen leben, der sich dem Leser schnell
als Ebenbild der Erde, die es aber als Terra in der beschriebenen Welt
auch noch gibt, entpuppt; und Anarres, ein d&uuml;rres, unfreundliches St&uuml;ck
kosmischen Treibholzes, auf dem sich die Odonier, benannt nach ihrer
F&uuml;hrerin Odo, vor ca. 150 Jahren ansiedelten, als sie Urras verlie&szlig;en,
um eine g&auml;nzlich neue Gesellschaftsform zu gr&uuml;nden. Zwischen diesen
beiden Welten bestehen nur Handelsbeziehungen und der Austausch
wissenschaftlicher Erkenntnisse. Passagiere haben die Schiffe nicht an
Bord, die auf dem Flugplatz landen, der durch oben beschriebene Mauer
eingegrenzt wird.
</P><P>
U.K.LeGuin schildert diese Welten in zwei Handlungsebenen. Die erste
beginnt im Leben des erwachsenen Shevek, einem bedeutenden Physiker, der
auf Anarres lebt und der der erste Odonier ist, der nach 150 Jahren -
deshalb von seinem Volk verachtet - wieder nach Urras zur&uuml;ckkehrt, was
der Inhalt dieser Ebene wird. Die zweite beginnt in seiner fr&uuml;hen Jugend
und beschreibt sein Leben auf Anarres, bis zum Abflug nach Urras, so da&szlig;
sich beide Ebenen am Ende des Buches verbinden.
</P><P>
Dadurch beschreibt die Autorin dem Leser stets im Wechsel die Zust&auml;nde auf
Anarres und Urras, genauer gesagt Sheveks Sicht dieser Zust&auml;nde und diese
glaubw&uuml;rdige Perspektive macht es ihr m&ouml;glich, die Geflogenheiten auf
Urras, unsere Geflogenheiten, auf beeindruckende Weise auseinanderzunehmen.
Aber diese Kritik bleibt wiederum nicht ohne Alternativentwurf, denn
diesen findet man im Odoismus, wenn auch U.K.LeGuin dessen Schw&auml;chen
wiederum gleich selbst aufzeigt.
</P><P>
Die Geschichte, die in &quot;Planet der Habenichtse&quot; erz&auml;hlt wird, ist klein,
nichtssagend, eigentlich kaum der Rede wert, aber die Probleme, die in sie
eingebettet sind, die philosophischen Thesen, die herbe Kritik an den
Dingen, die wir als selbstverst&auml;ndlich hinnehmen und die nur aus der
Sicht eines v&ouml;llig Fremden angefochten werden k&ouml;nnen, wenn dies nicht an
einem viel zu oft zu h&ouml;renden &quot;Es ist nun aber mal so.&quot; scheitern soll,
sie sind es, die dieses Buch interessant, die es zu einem gro&szlig;artigen
Werk machen.
</P><P>
Aber zun&auml;chst noch einmal zur&uuml;ck zur odonischen Welt, denn diese mu&szlig;
glaubhaft sein, damit der Held glaubhaft werden kann und damit seine
Perspektive auf Urras, seine Kritik an uns.
</P><P>
Auf Anarres herrscht eine Gesellschaftform, die man vielleicht irgendwo
zwischen Anarchie und Sozialismus einordnen k&ouml;nnte. &quot;Die odonische
Gesellschaft war als permanente Revolution gedacht...&quot; Deshalb mag man
dieses Buch auch als Auseinandersetzung zwischen Sozialismus und
Kapitalismus auffassen - denn Shevek besucht auf Urras das
kapitalistische Land Io, jedoch finde ich dies zu fordergr&uuml;ndigig
betrachtet. Die Kritik der Autorin geht wesentlich tiefer und der
Konflikt zwischen diesen beiden Gesellschaftsformen auf Urras bekommt
auch einige Zeilen gewidmet, spielt aber eine eher untergeordnete Rolle.
</P><P>
Die Anarresti sind eine Gesellschaft der Gleichstellung, die auch
vordergr&uuml;ndig gut funktioniert, sie teilen alles - und haben nichts. Es
wird wirklich ein sehr ideelles Bild gezeichnet, eine gerechte und humane
Gesellschaft, nur logisch, da&szlig; diese so nicht glaubhaft w&auml;re. Deshalb
versetzt U.K.LeGuin sie in eine permanente Not, indem sie Anarres als
eine extrem unfreundliche Welt beschreibt, in der die Anarresti all ihre
Kr&auml;fte aufbieten m&uuml;ssen, um Roh- und N&auml;hrstoffe aus ihr herauszupressen.
Durch diese Not wird eine Einsicht der Bewohner in die Notwendigkeit der
Zusammenarbeit, der Zur&uuml;ckstellung der eigenen Bed&uuml;rfnisse nach
Individualit&auml;t heraufbeschworen.
</P><P>
Aber es w&auml;re immernoch zu einfach, wenn dies so funktionieren w&uuml;rde und so
zeigt die Autorin, da&szlig; es nicht funktioniert, da&szlig; es auch auf Anarres
Menschen gibt, die ihren eigenen Weg zu gehen suchen, die sich von der
Gesellschaft zur&uuml;ckziehen (beziehungsweise von ihr abgewiesen werden), die
einfach ihre Individualit&auml;t ausleben, denn das ist die Schw&auml;che des
Odoismus: da&szlig; er den Individualismus des Menschen leugnet oder zumindest
zu begrenzen sucht. Die "permanente Revolution" war zum Erliegen gekommen.
Das ist auch das Problem, was schlie&szlig;lich dazu f&uuml;hrt, da&szlig; Shevek nach Urras
fliegt.
</P><P>
Aus dieser Welt also kommt er nach Urras, zu uns, und prangert an. Aber er
tut dies nicht mit dem erhobenen Zeigerfinger, sondern dadurch, da&szlig; er
strauchelt, da&szlig; diese Gesellschaft ihn nahezu zu Fall bringt, weil er
vieles einfach nicht begreifen kann, so fremd ist es ihm. Der Leser wird
durch seine Sympathie f&uuml;r Shevek entsetzt &uuml;ber sich selbst oder zumindest
&uuml;ber die Welt, in der er lebt.
</P><P>
In beeindruckenden Formulierungen schildert U.K.LeGuin diese
unbegreiflichen Dinge, z.B. das zur Schau stellen der Sexualit&auml;t, bzw.
das Vorteil aus seinem K&ouml;rper schlagen...
</P><P>
&quot;...
 Es wurde ein sehr kleiner Spaziergang: ein langsames, h&ouml;chstens zehn
 Minuten langes Schlendern &uuml;ber den Rasen, dann lie&szlig; sich Vea grazi&ouml;s
 im Schatten einer hohen, gelb bl&uuml;henden Hecke nieder. Er setzte sich
 neben sie. Als er Veas schlanke, mit kleinen, wei&szlig;en, sehr hochhackigen
 Schuhen bekleidete F&uuml;&szlig;e betrachte, kam ihm ein Ausdruck in den Sinn,
 den Takver zu benutzen pflegte, &gt;K&ouml;rperprofitlerin&lt; hatte Takver jene
 Frauen genannt, die bei einem Machtkampf gegen M&auml;nner ihre Sexualit&auml;t
 als Waffe einsetzten. Und wenn man Vea betrachtete, war sie eine
 vollendete K&ouml;rperprofitlerin. Schuhe, Kleider, Kosmetika, Schmuck,
 Gesten, alles an ihr war provozierend. Sie war so v&ouml;llig und
 demonstrativ ein weiblicher K&ouml;rper, da&szlig; sie kaum noch ein weiblicher
 Mensch zu sein schien. Sie war die Inkarnation der Sexualit&auml;t...&quot;
</P><P>
Ich sollte vielleicht anmerken, da&szlig; Vea eine Frau ist, wie sie zuhauf auf
unserem Planeten zu finden sind, obgleich sie aus sehr gehobenem Stande
ist.
</P><P>
Hauptanklagepunkt ist aber der Besitz. Er ist, woran all unser Elend
haftet, allen voran unsere Unfreiheit. Die schildert die Autorin in einer
Szene, in der Shevek auf einer Party bei Vea mit ein paar G&auml;sten ins
Gespr&auml;ch kommt und Vea ihn nach seiner Heimatwelt fragt. In dieser
Schl&uuml;sselszene bricht einfach alles aus Shevek hervor, wovon er in
seiner Zeit auf Urras keine genauen Begriffe hatte...
</P><P>
&quot;&gt;&gt;Aber erz&auml;hlen sie doch von Anarres!&lt;&lt; sagte Vea, &gt;&gt;Wie ist es dort
 wirklich? Ist es tats&auml;chlich so wunderbar?&lt;&lt;
  Er hockte auf der Armlehne des Sessels, w&auml;hrend Vea zu seinen F&uuml;&szlig;en auf
 einem Hocker sa&szlig;, aufrecht und zart, mit Br&uuml;sten, die ihn mit ihren
 blinden Augen anstarrten; Vea mit l&auml;chelndem selbstgef&auml;lligem, ger&ouml;tetem
 Gesicht.<BR>
  Irgend etwas Dunkles breitete sich in Sheveks Kopf aus, verdunkelte
 alles. Sein Mund war trocken. Er leerte das Glas, das ihm der Diener
 gerade gef&uuml;llt hatte. &gt;&gt;Ich wei&szlig; es nicht&lt;&lt;, antwortete er; seine Zunge
 war wie gel&auml;hmt.
 &gt;&gt;Nein. Es ist nicht wunderbar. Es ist eine h&auml;&szlig;liche Welt. Nicht wie
 diese. Anarres besteht nur aus Staub und trockenen Bergen. Alles &ouml;de,
 alles trocken. Auch die Menschen sind nicht sch&ouml;n. Sie haben gro&szlig;e H&auml;nde
 und F&uuml;&szlig;e, wie ich und der Diener dort. Aber keine gro&szlig;en B&auml;uche. Sie
 werden sehr schmutzig und baden zusammen, das tut hier niemand. Die
 St&auml;dte sind sehr klein und langweilig, richtig trostlos. Keine Pal&auml;ste.
 Das Leben ist langweilig und besteht aus harter Arbeit. Man kann nicht
 immer bekommen, was man m&ouml;chte, nicht einmal das, was man braucht, denn
 es ist einfach nicht genug da. Ihr Urrasti habt von allem genug. Genug
 Luft, genug Regen, Gras, Meere, Nahrung, Musik, H&auml;user, Fabriken,
 Maschinen, Kleider, Geschichte. Ihr seid reich, ihr besitzt. Wir sind
 arm, wir leiden Mangel. Ihr habt, wir haben nicht. Hier ist alles sch&ouml;n.
 Nur die Gesichter nicht. Auf Anarres ist gar nichts sch&ouml;n, nichts au&szlig;er
 den Gesichtern. Die anderen Gesichter, die M&auml;nner und Frauen. Etwas
 anderes haben wir nicht, wir haben nur uns. Hier sieht man den Schmuck,
 dort sieht man die Augen. Und in den Augen sieht man die Pracht, die
 Pracht des menschlichen Geistes. Weil unsere M&auml;nner und Frauen frei sind;
 da sie nichts besitzen, sind sie frei. Und ihr, die Besitzenden, ihr seid
 besessen. Ihr lebt alle im Gef&auml;ngnis. Jeder f&uuml;r sich allein, mit einem
 Haufen all dessen, was er besitzt. Ihr lebt im Gef&auml;ngnis, sterbt im
 Gef&auml;ngnis. Das ist alles, was ich in Euren Augen sehe - die Mauer,
 die Mauer&lt;&lt;&quot;
</P><P>
Es gibt noch viele weitere Punkte, die beleuchtet werden, unter anderem
auch das Verh&auml;ltnis von Armen und Reichen, aber dies ist einer der
Spannungsf&auml;den des Buches, der zu seinem Ende eskaliert, wo wiederum
viel in Frage gestellt und angeklagt wird...
</P><P>
&quot;Planet der Habenichtse&quot; hat das Potential, Mauern - Denkbarrieren -
einzurei&szlig;en, wo bereits kleine L&ouml;cher sind, an denen es ansetzen kann.
</P><P>
F&uuml;r mich ist es immernoch das beste Buch, das ich gelesen habe
(zugegebenerma&szlig;en sind das aufgrund der langen Pause nicht viele),
aber es ist keine sch&ouml;ne, unterhaltsame Geschichte, sondern erfordert die
Bereitschaft, sich mit den Thesen auseinanderzusetzen. Dann macht es aber
umso mehr Spa&szlig;, und ist letztendlich ein sch&ouml;ner Denkansatz zu der Frage
nach uns selbst, wer wir sind, was wir brauchen und woraus unsere W&uuml;nsche
resultieren.
</P><P>
Ursula K.LeGuin &quot;Planet der Habenichtse&quot;; ISBN 3-360-00081-1<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803fil5.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803kat.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
