<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Starship Troopers</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Starship Troopers</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>

<B><QUOTE>&quot;Es w&auml;re wahrscheinlich besser, diesen Film todzuschweigen, aber dann kann
 jeder behaupten, er sei nicht gewarnt worden...&quot; [030]</QUOTE><BR><BR>
<QUOTE>&quot;Grandioses Gemetzel, das man keinen Moment ernst nehmen darf. Ironischer
SF-Effektspa&szlig;&quot; TV-Spielfilm</QUOTE><BR>
<P>
&quot;Wild! Sexy! Explosiv! Der ultimative Thrill-Ride!&quot; l&auml;&szlig;t Paul Verhoeven
sich auf die Fahne seines Werkes schreiben.
</P></B><P>
Diese Reaktionen waren es, die mich erst neugierig werden lie&szlig;en. "Fritz",
(der Radiosender, d. Chefred.) so lie&szlig; ich mir sagen, reagierte mit einer
genauso krassen Ablehnung, wie der Schreiber der "[030]", wenn nicht noch
entschiedener. Diese Kritiken und die Trailer wiesen darauf hin, da&szlig; hier
tats&auml;chlich entweder der gr&ouml;&szlig;te Schund zu bewundern w&auml;re, den die
Filmindustrie in letzter Zeit hervorbrachte, oder aber ein Geniestreich
der Parodie...glaubte ich zumindest.
</P><P>
W&auml;re ich nicht auf diese heftigen Reaktionen aufmerksam geworden, h&auml;tte
ich mir diesen Film vermutlich nie angetan, jedoch wollte ich mir selbst
eine Meinung dazu bilden und diese nat&uuml;rlich auch niederschreiben. Und
hier sitze ich und habe den Salat. Aber mal immer der Reihe nach.
</P><P>
Ein kurzer Text weist uns gleich zu Beginn des Filmes darauf hin, da&szlig; ein
gleichnahmiger Roman von 1959 als Vorlage f&uuml;r den Streifen diente. Gleich
darauf folgt eine Art zuk&uuml;nftige Wochenschau, in der dazu aufgerufen wird,
sich zum Kriegsdienst bei den <B>Starship Troopers</B> zu verpflichten.
</P><P>
Desweiteren f&uuml;hrt uns diese Wochenschau in Lehrbuchmanier in den Kontext
ein. Da ist die Erde auf der einen Seite, auf der vereint die Guten leben
und das Milit&auml;r die h&ouml;chsten Ehren hat, und die b&ouml;sen Bugs auf der anderen.
Bis auf die Tatsache, da&szlig; die Bugs ab und zu mal einen Asteroiden auf die
Erde loshetzen, herrscht eine Art Status Quo zwischen diesen beiden.
</P><P>
Ein Schnitt erfolgt, wir werden informiert, da&szlig; unser zeitlicher Kontext
nun ein Jahr vor dieser Wochenschau liegt und wir lernen den Helden der
Geschichte, Johnny Rico, kennen. Wir erfahren, da&szlig; er auf der Erde lebt,
da&szlig; er ein M&auml;dchen namens Carmen liebt und von einem anderen namens Dizzy
begehrt wird. Nur f&uuml;r Carmen verpflichtet sich Johnny zur mobilen
Infanterie. Die Wege der Freunde trennen sich bei der Rekrutierung, denn
sie kommen in unterschiedliche T&auml;tigkeitsbereiche. Gerade als Johnny die
horrende milit&auml;rische Ausbildung schmei&szlig;en und nach Hause zur&uuml;ckkehren
will, erreicht ein Asteroid die Erde und vernichtet sein Elternhaus. Nur
logisch, da&szlig; unser Held sich doch noch zum Krieg entschlie&szlig;t und mit
wehenden Fahnen und Ha&szlig; in der stolzen Brust dem Feindkontakt
entgegenfiebert.
 </P><P>
Freilich f&auml;llt dieser unerwartet hart aus und Johnny wird fast get&ouml;tet.
Im folgenden besteht die Story vorwiegend aus verschiedenen Schlachten
und Metzeleien, zwischen denen Johnny und Carmen sich immer wieder
begegnen, bis schlie&szlig;lich der "Brain-Bug", das Gehirn der Kampfinsekten
gefunden und gefangen wird und somit die Menschen alles in der Hand haben,
was sie brauchen, um die Bugs zu besiegen. Nachdem am Ende von allen, die
ihre Beziehung h&auml;tten st&ouml;ren k&ouml;nnen, keiner mehr &uuml;brig ist, bekommen sich
Carmen und Johnny nat&uuml;rlich und sind dar&uuml;ber hinaus auch noch gefeierte
Helden des Krieges.
   </P><P>
Dies ist die ganze Story des Films. Obwohl ich mangels Erinnerungsverm&ouml;gens
bez&uuml;glich einiger Namen diverse Details weggelassen habe, ist da nichts
mehr an wesentlichem Material. Das einzige, was man an diesem Film
interessant finden mag, ist die Art, wie er inszeniert wurde. Aber um
wirklich sicherzugehen, da&szlig; niemand ihn sich mehr ansehen braucht, werde
ich mich auch dar&uuml;ber auslassen.
 </P><P>
Volker Bleeck, verantwortlich f&uuml;r die TV-Spielfilm-Kritik kommt zu
seiner sehr positiven Meinung scheinbar vor allem auf Basis eines dort
abgedruckten Interviews mit Verhoeven. In seiner Kritik nimmt er Bezug
auf einen Propagandafilm von 1935 mit dem Titel "Triumph des Willens"
von Leni Riefenstahl. Dieser solle als Vorlage f&uuml;r Verhoevens Werk
gedient haben und dessen Absicht w&auml;re es gewesen, diesen zu parodieren.
Das erkl&auml;rt tats&auml;chlich einiges.
    </P><P>
In &quot;Starship Troopers&quot; taucht so ziemlich jede Form
nationalsozialistischer Ideologie auf, seien es blau&auml;ugige Sch&ouml;nlinge
in den Positionen der Hauptdarsteller, schwarze Uniformen bei den
Soldaten, die extreme Huldigung alles milit&auml;rischen oder der extreme
Ha&szlig; und die Propaganda gegen den Feind, den niemand wirklich kennt.
       </P><P>
Tats&auml;chlich wirkt das alles, als h&auml;tte man hier versucht, einen SF-Stoff
in das Korsett eines Nazi-Propagandafilmes zu stecken und tats&auml;chlich
entfaltet dies zun&auml;chst auch seine Wirkung, wirkt es so aufgesetzt, so
absurd, da&szlig; man gar nicht auf die Idee kommt, es ernstzunehmen, wie er
es laut besagtem Interview vom Zuschauer fordert.
 </P><P>
Aber das h&auml;lt nicht lange an. Mit dem Beginn der Einf&uuml;hrung in die
Charakt&auml;re gew&ouml;hnt sich der Zuschauer zumindest so sehr an die groteske
Darstellung, da&szlig; er den distanzierten Blick verliert und der Langeweile
nur noch Entsetzen weicht. Entsetzen n&auml;mlich &uuml;ber eine erstaunlich
schamlose Ekelhaftigkeit und Rohheit des Bildmaterials. Verhoeven
scheute offensichtlich keine M&uuml;he, die Zerst&uuml;ckelung von Menschen bei
lebendigem Leibe, die Entstellungen unz&auml;hliger herumliegender Toter,
einfach alle m&ouml;glichen Formen von greulichem Gemetzel in Szene zu
setzen.
       </P><P>
Da wird ein Soldat zweigeteilt, ein anderer wird f&uuml;r die Bugs zum
lebenden Football, und selbst die Insekten m&uuml;ssen hart einstecken. Worum
sich Verhoeven jedoch nicht bem&uuml;ht, ist dies tats&auml;chlich als Greuel zu
verurteilen. Er metzelt einfach drauf los, in voller Bilderpracht, wie
in einem geschmacklosen modernen Comuterspiel. Wozu sonst sollten solch
emotionslose Blutb&auml;der dienen, wenn nicht purer Effekthascherei? Da mag
Herr Verhoeven noch so viel davon reden, da&szlig; niemand den Film ernstnehmen
solle, da&szlig; die Story dazu viel zu albern w&auml;re, da&szlig; er sich mit dem
Verhalten seiner Figuren keineswegs identifizieren w&uuml;rde und da&szlig; sein
Film aus vielen Schichten bestehen w&uuml;rde, die der Zuschauer zerlegen
solle; nichts von alldem rechtfertigt diese v&ouml;llig &uuml;berfl&uuml;ssigen
Gewaltakte.
 </P><P>
&quot;Wenn die Leute auf der Leinwand sterben, dann sollte keiner mehr lachen.&quot;,
sagt er. Wenn ich das erreichen will, dann mu&szlig; ich auch daf&uuml;r sorgen, da&szlig;
ich den Zuschauer schockiere. Das ist bei Starship Troopers keineswegs der
Fall, hier wird so viel durchstochen, aufgespie&szlig;t, zerbissen, zerschossen,
ver&auml;tzt und zerbombt, da&szlig; es den Betrachter fast schon wieder zu
langweilen beginnt.
      </P><P>
Nebenbei, meint er, w&uuml;rde sein Film die Frage stellen, wie Propaganda
von Superm&auml;chten funktioniere. Auch hier fehlt jeglicher Ansatz einer
Wertung. Klar ist der Film in ein Gewand l&auml;cherlicher Absurdit&auml;t geh&uuml;llt,
aber es fehlt einfach jeder reale Punkt dabei, an dem sich der Zuschauer
festhalten kann. Was unterscheidet denn dieses Werk noch von einem der
Propaganda-Filme, die es angeblich anklagt? Mag sein, da&szlig; Verhoeven der
Meinung war, die Verlagerung der Thematik auf ein SciFi-Thema w&uuml;rde die
Propaganda-Schablone hervorstechen lassen, aber da scheint er sich geirrt
zu haben. Eine wesentlich schockierendere Wirkung h&auml;tte das blo&szlig;e Zeigen
eines realen Propagandafilmes bewirkt und wenn Humor war, was er wollte,
so ist der Anspruch, den er an den Zuschauer stellt, einfach entschieden
zu hoch. Wer bittesch&ouml;n kann &uuml;ber einen Witz lachen, dessen Pointe
anderthalb Stunden dauert?
</P><P>
Letztlich sind da noch die Helden, zu denen ich auch ein paar Worte
verlieren m&ouml;chte. Diese sind Verk&ouml;rperungen drastisch &uuml;bertriebener
Heldenmotive. Vielleicht wollte Verhoeven auch damit spotten, vielleicht
macht er sich &uuml;ber den amerikanischen Film lustig, aber auch hier gilt,
da&szlig; er es nicht vermag, diese Absicht so weit zu transportieren, da&szlig; sie
beim Zuschauer wirklich ankommt. Stattdessen geht dieser fr&uuml;her oder
sp&auml;ter dazu &uuml;ber, ihre Oberfl&auml;chlichkeit zu akzeptieren und sich mehr
auf ihre Handlungen zu konzentrieren.
</P><P>
Verhoeven hat aber auch daf&uuml;r gesorgt, da&szlig; niemand ausreichend Zeit
bekommt, sich &uuml;ber all diese Mi&szlig;st&auml;nde w&auml;hrend des Films zu &auml;rgern oder
sich Gedanken dar&uuml;ber zu machen. Dazu wird der Betrachter viel zu sehr
durch bunte Knalleffekte und nahezu l&uuml;ckenlose Action besch&auml;ftigt.
</P><P>
Nach all diesen Betrachtungen sind wir also genauso schlau, wie zuvor:
Entweder ist Verhoeven total genial und sein Werk stellt einfach
astronomische Anspr&uuml;che an den Betrachter, oder aber er war so belustigt
von seiner Idee, da&szlig; ihm die Konzentration f&uuml;r die Schaffung einer
geistvollen Umsetzung fehlte. Die Quintessenz ist in beiden F&auml;llen
dieselbe, n&auml;mlich die, da&szlig; der Film wertlos wird. Wenn es etwas gibt,
das Verhoeven damit wirklich erreicht, so ist es ein gro&szlig;er Beitrag zur
Verrohung. Starship Troopers &uuml;berbietet Tarantino spielend an Ekel, aber
was letzterer in Pulp Fiction mit Hilfe nur einer einzigen Szene h&ouml;chsten
Ekels zu erreichen vermochte, schafft Verhoeven nicht in hunderten.
</P><P>
Starship Troopers ist tats&auml;chlich einer der unsehenswertesten Filme,
die ich kenne. Ich bezweifle zwar, da&szlig; es mir gelungen ist, den Film
uninteressant zu machen, aber zumindest bin auch ich meine Warnung
losgeworden. Und man m&ouml;ge sich bei einem Kinobesuch immer vor Augen
halten, da&szlig; jede gekaufte Karte eine Stimme ist, die das Gesehene
bejaht.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803fil3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803fil5.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
