<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - X / Ten</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;X&quot; / Ten</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

Das &quot;<B>X</B>&quot; des Deb&uuml;talbums der englischen Gruppe "<B>Ten</B>" steht nat&uuml;rlich f&uuml;r
die r&ouml;mische Zehn. Solch eine ist es auch, die einem relativ unauff&auml;llig
aber stilvoll ins Auge f&auml;llt, wenn man auf das Cover schaut. Ein gro&szlig;es,
beinahe plastisch nach oben hervortretendes &quot;X&quot;, nahtlos verbunden mit
einer grauen, `angelaufenen` und blasenschlagenden Metallfl&auml;che, die im
Booklet beinahe wie frisch geschmiedet wirkt. Ansonsten enth&auml;lt das
Booklet neben ein paar gelungenen Bildern der K&uuml;nstler auch die
vollst&auml;ndigen Songtexte.
      </P><P>
Nicht nur in einschl&auml;gigen Kreisen Europas wurde diese &quot;Melodic Rock&quot;-
Scheibe als eindrucksvoller Auftakt gewertet, gerade auch in Japan
ist die Gruppe um Leads&auml;nger Gary Hughes, dem Guitarristen Vinny Burns,
und dem Bassisten Martin Shelton (beide jeweils Ex-Dare) sowie dem
bekannten Produzenten Mike Stone (u.a. Whitesnake, Journey, Queen und
Foreigner) regelrecht zum Blockbuster geworden.
     </P><P>
Doch zum Wichtigsten: Der Musik selbst.
     </P><P>
Der erste Titel wird &uuml;bergangslos von dem Instrumental &quot;<B>the crusades</B>&quot;
eingeleitet. Harte Gitarrengriffe, zu denen sich nach einer Weile
Streichinstrumente gesellen. Doch dann beginnt schlie&szlig;lich
&quot;<B>it`s all about love</B>&quot; recht vielversprechend: relativ ruhig, mit Temposteigerung
beim Refrain. Doch da sich dieser nach einer Weile st&auml;ndig wiederholt,
wirkt der gesamte Titel auf Grund seiner etwa acht Minuten Laufzeit
doch arg &uuml;berdehnt.
     </P><P>
Mit sanften &quot;Ah`s&quot; und &quot;Oh`s&quot; beginnt der n&auml;chste Titel
&quot;<B>after the love is gone</B>&quot;, ehe die gesamte Instrumentierung furios einsetzt. Schnell, mit
einem gef&uuml;hlvollen Gesang, der den teilweise harten Sound relativiert
und einen interessanten Kontrast bietet. Phantastisch!
   </P><P>
Die meisten der folgenden Titel sind etwas ruhiger.
&quot;<B>yesterday lies in the flames</B>&quot;, &quot;<B>eyes of a child</B>&quot;, &quot;<B>close your eyes and dream</B>&quot; und die
wunderbare Ballade &quot;<B>the loneliest place in the world</B>&quot; als Abschlu&szlig;, die
gl&uuml;cklicherweise die gef&auml;hrlichen Klippen der Schmalzigkeit umschifft,
was vielen anderen, in den derzeitigen Radio-Charts herauf- und
heruntergedudelten Songs nicht gelingt (wenn sie es denn &uuml;berhaupt
vermeiden wollten). Der Titel dauert zusammen mit ausf&uuml;hrlichen
Instrumental-Abschnitten &uuml;brigens etwas &uuml;ber zehn Minuten.
     </P><P>
Dagegen halten &quot;<B>the torch</B>&quot;, &quot;<B>stay with me</B>&quot;, &quot;<B>can`t slow down</B>&quot; und
&quot;<B>lamb to the slaughter</B>&quot;, mit mittlerer bis schneller Geschwindigkeit.
   </P><P>
Insgesamt geht es auf &quot;X&quot; haupts&auml;chlich um das Thema Nummer 1 &quot;Die
Liebe&quot;: von bitteren Erinnerungen, Entt&auml;uschungen und Hoffnungen.
 </P><P>
Trotzdem ist die CD alles andere als der &quot;X-te&quot; Aufwasch von altbekanntem
Standard-Sound, sondern bietet &uuml;ber sechzig Minuten guter Musik, mit
origineller, markanter Instrumentierung und einem gut aufgelegten Gary
Hughes, dessen Stimme mit ihrer Intensit&auml;t dem Ganzen sicherlich erst
die richtige &quot;Seele&quot; verleiht.
</P><P>
&copy; &amp; (P) MTM Music 1996, M&uuml;nchen; ca. 33 DM<BR>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9803fil1.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
