<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Comedian Harmonists</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Comedian Harmonists</H1>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>
<B>Alte Bekannte</B> trifft man in Jospeh Vilsmaiers aktuellem Leinwandf&uuml;ller
&quot;Comedian Harmonists&quot; nicht nur in Form der gleichnahmigen Gruppierung
aus den fr&uuml;hen 30ern wieder, sondern auch in Form eines riesigen
Aufgebotes an in vergangenen deutschen Produktionen vielgesehenen
Gesichtern.
</P><P>
Neben seiner Frau Dana Vavrova und Ben Becker, mit dem er wohl bereits
in &quot;Schlafes Bruder&quot; gute Erfahrungen machte, findet man unter ihnen
auch Kai Wiesinger (&quot;Kleine Haie&quot;, &quot;Hunger&quot;, etc.), Meret Becker
(&quot;Kleine Haie&quot;), Katja Riemann (&quot;Nur &uuml;ber meine Leiche&quot;, &quot;Bandits&quot;,
&quot;Stadtgespr&auml;ch&quot;, etc.), Heino Ferch (&quot;Knocking on Heavens Door&quot;, &quot;Der
Winterschl&auml;fer&quot;) und andere.
</P><P>
Sie alle sind angetreten, um eines der bekanntesten deutschen
musikalischen Ensembles zu huldigen, obgleich man genausogut annehmen
k&ouml;nnte, sie wollten Joseph Vilsmaier huldigen, der es sicher auch
verdient und einige von ihnen gro&szlig; gemacht hat.
</P><P>
Allerdings...gilt das auch f&uuml;r diesen Film?
</P><P>
Zun&auml;chst beginnt alles sehr schwungvoll und mit einigem Witz, der den
Charme jener Zeit zu verk&ouml;rpern vermag. W&auml;hrend sich die Charakt&auml;re
gegenseitig kennenlernen, wird auch uns ein Eindruck von ihnen, ihrer
Situation, ihrem Umfeld vermittelt. Wir lernen sie als einen haufen
junger Menschen kennen, die das Leben von der spa&szlig;igen Seite nehmen
und der ernsten Realtit&auml;t weitestgehend den R&uuml;cken zuwenden. Diese
finden sich - initiiert von Harry Frommermann, dem zentralen Helden
der Geschichte - zu besagter Gruppierung zusammen und beginnen nach
anf&auml;nglichen Schwierigkeiten ihren Weg nach oben.
</P><P>
Freilich l&auml;uft das Zusammenspiel des Sextetts nicht v&ouml;llig reibungslos
ab und so kommt es schon bald zu ersten Konflikten. Allen voran der
heranwachsende Konflikt zwischen Harry und Robert, die beide in Erna
verliebt sind. Dieser aber schwillt lange nur an, nimmt sich Zeit, zu
wachsen, bevor er endlich zum Ausbruch kommt, als die Gruppe schon
l&auml;ngst Erfolg hat.
</P><P>
Aber nicht nur diese zwischenmenschlichen Problemchen machen den Herren
zu schaffen, hinzu kommen die Nazis, die die Herrschaft in Deutschland
&uuml;bernehmen und es freilich nicht gern sehen, da&szlig; sich unter den
Mitgliedern einer der erfolgreichsten Bands ihres sch&ouml;nen Landes
drei Juden befinden.
</P><P>
Somit dauert es nicht mehr lange, bis die Comedian Harmonists ihr letztes
Konzert geben. Dies ist der H&ouml;hepunkt des Films, alle Konflikte laufen in
diesem Punkt zusammen und l&ouml;sen sich auf. Was folgt ist das Happy-End.
</P><P>
&quot;Comedian Harmonists&quot; wirkt wie ein Betriebsausflug der deutschen
Filmindustrie, oder als wolle man Herrn Pavarotti und Gemeinde Konkurrenz
machen. Die Story ist einfach zu seicht, zu kom&ouml;diantisch, um den ge&uuml;bten
Darstellern gro&szlig;e Leistungen abzuverlangen. Man sieht eigentlich genau
das, was man erwartet, wenn man all die aufgez&auml;hlten Schauspieler in
einen Film zusammenpackt. Da&szlig; dabei nichts Schlechtes herauskommen kann,
scheint nur logisch, aber um dann wirklich gro&szlig;es zu schaffen, sollte
man ihnen Rollen auferlegen, in denen sie nicht dieselben Seiten zeigen
k&ouml;nnen, wie sie es sonst tun d&uuml;rfen.
</P><P>
Vilsmaier aber setzte Personen aus den 90ern in eine Geschichte aus den
30ern, kreierte echte Helden in einer Welt voller Sonnenschein, die
seichte Schatten wirft. Das ganze wirkt wie durch einen Hochglanzfilter
betrachtet. Somit kommt nie wirklich ein 30er-Jahre-Flair auf, ebensowenig
wie der aufkommende Nationalsozialismus seine schockierende Wirkung
entfalten kann.
</P><P>
Obgleich der Film eine gewisse Dramatik besitzt, obwohl er auch r&uuml;hrende
wie schockierende Momente hat, so vermag er es doch nicht, die Dramatik
der Beziehungen und der Machtergreifung Hitlers ergreifend darzustellen.
Es hat den Anschein, als wolle Vilsmaier das Publikum diesmal nicht mit
schwerem Material belasten und vielleicht verschrecken. Dadurch beweist
er zwar Flexibilit&auml;t, wird aber <b>sein</b> Publikum entt&auml;uscht haben, denn
&quot;Comedian Harmonists&quot; reicht bei weitem nicht an die Klasse heran, die
er &quot;Stalingrad&quot; durch marternde Sachlichkeit und &quot;Schlafes Bruder&quot; durch
erdr&uuml;ckende Mystik zu verleihen vermochte.
</P><P>
Sehr gelungen aber ist das Zusammenspiel von Film und Musik. Die
Songs wurden wunderbar passend zu den Szenen gew&auml;hlt, spiegeln die
Stimmungsbilder wieder und tragen viel zu lockeren Gesamteindruck bei.
</P><P>
&quot;Comedian Harmonists&quot; ist solides Kino, unterh&auml;lt, macht Spa&szlig;, hat einen
gewissen eigenen Charme und ist leicht verdaulich. G&ouml;nnen wir doch Herrn
Vilsmaier diese Abwechslung und hoffen, da&szlig; er sich das n&auml;chste Mal
wieder darauf besinnt, ein paar Gr&auml;ten drin zu lassen, an denen wir
uns verschlucken k&ouml;nnen.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9803fil2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803fil4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
