<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #94 (1.1.2002)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>

<p>Ich hoffe erstmal, dass ihr alle nicht nur ein fr&#246;hliches Weihnachtsfest, sondern auch einen guten Rutsch in das neue Jahr hattet und inzwischen den Neujahreskater gut verarbeitet habt :-)) Ich jedenfalls habe es geschafft und bin nun wieder flei&#223;ig am arbeiten.</P>

<p>Warum ich am arbeiten bin? Tja, zum einen wollt ihr ja die aktuelle Ausgabe auf dem heimischen Rechner bestaunen und zum anderen bin ich in der Zeit vom 7.1-12.1. nicht erreichbar, da ich auf einer hyper wichtigen Fortbildung f&#252;r ZDL bin. Tja, habe da irgendwie &#252;berhaupt keinen Bock drauf, aber was 
gemacht werden muss, muss schlie&#223;lich gemacht werden, oder?</P>

Nun aber zur vorliegenden Ausgabe: Trotz der Tatsache, dass sich inwzischen wieder einige neue Gesichter in der NoCover eingefunden haben, bin ich mit der aktuellen Beteiligung alles andere als zufrieden. Artikelm&#228;&#223;ig ist in diesem Monat nicht wirklich viel eingegangen und das finde ich ehrlich gesagt ziemlich schade. W&#228;ren da nicht einige ganz aktive, k&#246;nnte man die aktuelle Ausgabe wirklich vergessen. Somit d&#252;rft ihr Euch auch nicht wundern, dass einige Rubriken wieder ganz verwaist sind, aber &#228;ndern kann ich diesen Zustand beim besten Willen nicht. Bisher hatte ich immer den Eindruck, dass 
es wieder bergauf gehen w&#252;rde und insbesondere was die Zahl der Leser angeht kann man das wohl auch so stehen lassen, aber ich ben&#246;tige mehr aktive Mitarbeit von Euch was die Artikel angeht - das m&#252;ssen ja keine super professionellen Testberichte sein, sondern k&#246;nnen auch einfache Leserbriefe, kurze Previews, pers&#246;nliche Meinungen &#252;ber bestimmte Software oder Tipps und Kniffe sein. Jeder Beitrag ist wirklich gerne gesehen und ich hoffe inst&#228;ndig, dass die Beteiligung in den n&#228;chsten Wochen wieder ansteigt. Auch ich habe keine List st&#228;ndig dar&#252;ber nachzudenken, wo ich Artikel herbekomme. Auch die E-Mail Rundmails bzw. pers&#246;nliche Anschreiben machen mir keinen Spass, aber das waren die kurzfristigen L&#246;sungen, die ich gesehen habe. Ich w&#228;re also allen wirklich sehr verbunden, wenn jeder einmal ein wenig in die Tastatur hauen w&#252;rde und mir das Zeugs so schnell
als m&#246;glich zukommen lassen w&#252;rde. Denn wenn es so &#252;ber kurz oder lang weitergeht, kann die NoCover nicht existieren. Aber ich hoffe inst&#228;ndig, dass es nicht soweit kommt, zumal es ja tats&#228;chlich positive Anzeichen gibt, dass wieder frischer Wind in die NoCover Einzug erh&#228;lt. </P>

<p>Ausser diesen harschen Worten, die bitter n&#246;tig waren und die ich garantiert jetzt nicht in jeder Ausgabe wiederholen werde, gibt es nat&#252;rlich auch noch positives zu vermelden: Der E-Mail Verteiler w&#228;chst und auch das Feedback von Usern, die die NoCover nur so lesen, nimmt zu. Daf&#252;r bin ich sehr dankbar und es zeigt doch - trotz aller Artikelflaute, dass ein ernsthaftes Interesse an der NoCover besteht.</P>

<p>Ihr helft mir auch schon dadurch, wenn ihr andere User auf die NoCover aufmerksam macht und vor allem betont, dass die NoCover inzwischen Freeware ist und kostenlos (!) per E-Mail bezogen werden kann. Wenn Ihr also noch aktive Amiga User kennt, dann z&#246;gert nicht lange und macht die Jungs und M&#228;dels 
ruhig mal auf die NoCover aufmerksam. Ihr k&#246;nnt denen auch ohne Probleme mal die aktuelle Ausgabe r&#252;bermailen - da das ganze inzwischen Freeware ist, besteht darin &#252;berhaupt kein Problem!</P>

<p>Ausserdem m&#246;chte ich alle jene, die sich noch nicht in die Mitgliederkartei eingetragen haben, bitten, mir ihre aktuelle Vorstellung zu mailen (Snail Mail oder E-Mail). Das kann schon fertig in HTML sein oder wahlweise auch als Text (gilt auch f&#252;r Artikel - User, die kein HTML k&#246;nnen, d&#252;rfen auch Artikel als Text einreichen. Das ist &#252;berahupt kein Problem!!). Wir wollen doch schlie&#223;lich eine aktuelle Mitgliederliste mit m&#246;glichts vielen aktiven Usern, oder?</P>


<p>Last but not least m&#246;chte ich mich an dieser Stelle bei Olaf K&#246;bnik von der Amiga Arena bedanken, der mir erneut die Interviews f&#252;r die NoCover zur Verf&#252;gung gestellt hat. Ohne diese w&#252;rde es noch &#252;bler aussehen. danke auch an Wolf, der sich bereit erkl&#228;rt hat, diese nach HTML umzusetzen. </P>

<p>So, ich hoffe, dass es f&#252;r Euch ein weitestgehen entspannter Januard wird und denkt bitte auch ein kleines bi&#223;chen an die NC.</P>

</p>

<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der
aktuellen NC. See ya,<br>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</b></p>

</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
