<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, crystal eyes">
<title>Crystal Eyes: In Silence They March</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Crystal Eyes: In Silence They March</font></center></h1></P>
<p>Wie das Cover schon unschwer erahnen l&#228;sst, handelt es sich bei Crystal Eyes um eine weitere True Metal Kapelle, die mit &quot;In Silence They March&quot; bereits ihr zweites Langeisen vorlegt (das Debutalbum &quot;The World Of Black And Silver&quot; erschien bereits 1999). Allerdings d&#252;rfte auch &quot;In Silence They March&quot; - ebenso wie seinerzeit der Vorg&#228;nger - in der Flut von Ver&#246;ffentlichungen untergehen, denn das Material ist bestenfalls durchschnittlich ausgefallen. Das liegt jetzt nicht an dem platten Umgang mit Klischee`s (das machen bekanntlich etablierte Acts wie HammerFall oder Manowar auch), sondern schlicht und ergreifend daran, da&#223; sich das Material auch nach einigen Durchl&#228;ufen nicht wirklich im Geh&#246;rgang festsetzen will. Zwar gibt es mit dem Opener &quot;Time Flight&quot; und dem Titeltrack &quot;In Silence They March&quot; zwei wirklich ganz nette Kompositionen, aber um die restlichen Songs wirklich gut zu finden, muss man schon zu den truesten 
der True Metaller geh&#246;ren. Das mag vielleicht auch daran liegen, da&#223; Crystal Eyes nicht wirklich aggressiv zur Sache gehen und stellenweise zu kitschig wirken - die schwache Produktion tut ihr &#252;briges dazu, die Songs zu verw&#228;ssern. Auch die vereinzelt eingestreuten Bombast Elemente und Accustic Parts verm&#246;gen nicht wirklich zu beeindrucken und zeugen eher von Orientierungslosigkeit als von Songwriter Qualit&#228;ten der Marke HammerFall &amp; Co. Tja, und dann w&#228;re da noch die etwas gew&#246;hnungsbed&#252;rftige Stimme von S&#228;nger Mikael Dahl, an die man sich nach einigen Durchl&#228;ufen zwar gew&#246;hnt, die aber insbesondere in den hohen Passagen noch leichte Defizite aufweist und nicht immer treffsicher ist. Anyway, das wirkliche Defizit liegt halt aber im Songwriter Bereich - wenn die Band es schafft, die Songs etwas abwechselungsreicher und vor allem packender (im Sinne von &quot;aggressiver&quot;) zu gestalten, dann k&#246;nnte aus der Band durchaus noch was 
werden. So kann ich &quot;In Silence They March&quot; aber wirklich nur jenen empfehlen, die alles blind abgreifen, wo nur ansatzweise True Metal draufsteht. Alle anderen Fans dieser Musikrichtung sollten ihr Geld lieber in die neuen Scheiben von Freedom Call oder Avantasia 
investieren - da ist das Geld auf jeden Fall besser angelegt.</P>

<p>Fazit: 4 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
