<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, zanister">
<title>Zanister: Fear No Man</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><center><h1><font color="#00ff00">Zanister: Fear No Man</font></center></h1></P>
<p>Mit dem Debutalbum &quot;Symphonica Millennia&quot; machten Zanister 1999 erstmals im gro&#223;en Rahmen auf sich aufmerksam und die verschiedenen Rezensionen fielen &#252;berwiegend positiv aus. Nun liegt der Nachfolger in Form von &quot;Fear No Man&quot; vor, der schon beim ersten Durchlauf deutlich gem&#228;&#223;igter r&#252;berkommt - wer fulminanten Power Metal mit permanent durchgetretenem Gaspedal erwartet, ist hier also definitiv an der falschen Addresse. Das soll jetzt aber garantiert kein Vorwurf sein, denn Zanister beherrschen es dennoch, kraftvolle Songs zu schreiben, was nicht nur der Opener &quot;The Shades They Color Thee&quot; beweist. So finden sich vereinzelt auch immer wieder progressive Elemente im Soundbild von Zanister wieder, was insbesondere am Titeltrack oder dem abschlie&#223;endem, etwas l&#228;ngerem &quot;Egyptian Nights&quot; deutlich wird. Trotz dieser vereinzelt progressiven Einfl&#252;sse steht der Metal amerikanischer Pr&#228;gung der fr&#252;hen Achtziger immer im 
Vordergrund und manifestiert sich in dem einzigen, etwas schneller gespielten Song &quot;Words Of Fate&quot;. Auch das restliche Material ist recht gut und vor allem immer nachvollziehbar ausgefallen und h&#228;lt mit &quot;You Live For Greed&quot; gerade mal einen etwas durchschnittlicheren Track bereit, der mich nicht gerade umgepustet hat. Die restlichen Songs sind so geschrieben, da&#223; man diese zwar erst nach einigen Durchl&#228;ufen richtig erfasst, daf&#252;r aber bei jedem weiteren H&#246;ren der Scheibe neue Facetten und Feinheiten entdeckt, die man vorher nicht wirklich wahrgenommen hat - das volle Potential der Scheibe kann man also beim kurzen reinh&#246;ren bestenfalls erahnen. So kommt es dann auch, da&#223; &quot;Fear No Man&quot; auch nach vielen Durchl&#228;ufen nicht`s von seiner Klasse verliert und immer interessant bleibt. Metal Fans, die sich auch mal intensiver mit einem Longplayer besch&#228;ftigen wollen und nichts gegen Metal amerikanischer Pr&#228;gung haben, sollten &quot;Fear 
No Man&quot; zumindest mal antesten und intensiv (!) durchh&#246;ren. Insgesamt also eine alles in allem sehr gute Scheibe, die zudem etwas abseits des momentanen True Metal / Melodic Power Metal Trends steht und gerade dadurch interessant wirkt.</P> 

<p>Fazit: 8.5 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
