<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li>Jetzt ist es amtlich: Der neue Gitarrist bei <b>Grave Digger</B> ist niemand geringeres als <b>Manni Schmidt</B>, der bis Ende `94 noch bei den Ruhrpott Metallern <b>Rage</B> in Lohn und Brot stand und u.a. die Alben &quot;Perfect Man&quot;, &quot;Trapped&quot; und &quot;Missing Link&quot; einspielte.</LI></P>

<p><li>Wird das Jahr 2001 das Jahr der Live Alben? Es sieht ganz so aus: Neben den geplanten Live Alben von <b>Iron Maiden</B> und <b>Rob Halford</B> (dessen Live Scheibe &#252;brigens auf den Namen &quot;Live Insurrection&quot; h&#246;ren wird) wird es im Jahre 2001 auch Live Mitschnitte von <b>Symphony X</B> und <b>Virgin Steele</B> geben. Und als ob das ganze noch nicht genug w&#228;re, erwarten uns auch noch ein <b>Mot&#246;rhead</B> Live Album und ein <b>Transatlantic</B> Live Mitschnitt. Wer Priorit&#228;ten setzen kann, ist klar im Vorteil...</LI></P>

<p><li><b>Stratovarius</B> haben es geschafft, in ihrem Heimatland Finnland 20.000 Einheiten von ihrer neuen Scheibe &quot;Infinite&quot; abzusetzen. Der Lohn daf&#252;r: Eine goldene Schallplatte. Herzlichen Gl&#252;ckwunsch!</LI></P>

<p><li><b>Jag Panzer</B> kennen wohl kein Privatleben: Nachdem man im Sommer des vergangenen Jahres noch das superbe Konzeptalbum &quot;Thane To The Throne&quot; l&#228;ssig aus dem &#196;rnel sch&#252;ttelte, stehen nun schon die Arbeiten zur n&#228;chsten Langrille an, die bis Ende Mai spruchreif sein soll. </LI></P>

<p><li>Nachdem das neue Langeisen der Heavy Metal Legende <b>Slayer</B> eigentlich schon f&#252;r Anfang Janaur eingeplant war, m&#252;ssen sich die Fans nun doch noch bis zum Sommer gedulden. Ger&#252;chteweise soll der Silberling &#252;brigens von Matt Hyde produziert werden.</LI></P>

<p><li>In den Staaten l&#228;uft das <b>Savatage</B> Side Projekt <b>Trans Siberian Orchestra</B> (kurz: TSO) mehr als nur gut, hier in Europa juckt das kaum einen: So haben sich die beiden ersten TSO Scheiben, die gerade erst in Europa releast wurden, gerade mal eine Woche in den Top 100 halten k&#246;nnen. Mal schauen, ob das immer noch aktuelle Drittwerk &quot;Beethoven`s Last Night&quot; (in den Staaten bereits im Fr&#252;hjahr 2000 erschienen), welches diesen Sommer auch endlich hierzulande released wird, in puncto Verkaufszahlen mehr erreichen kann.</LI></P>

<p><li>Das neue <b>Iced Earth</B> Album &quot;Horror Show&quot; wird jetzt definitiv erst im Sommer in den hiesigen Plattenl&#228;den stehen. Als kleines Trostpflaster sei gesagt, da&#223; Jon Schaffer bei einem Song evtl. selber singen wird und die Scheibe vom H&#228;rtegrad wieder deutlich &quot;back to the roots&quot; gehen wird (lt. Aussage von Jon Schaffer in einem Interview). Die &quot;Melancholy EP&quot; ist daf&#252;r mitlerweile erh&#228;ltlich (siehe Review in dieser Ausgabe). </LI></P>

<p><li>Die geplanten <b>Helloween</B> Live Termine im Februar zusammen mit Iron Savior und ex-Iron Maiden Frontsirene Blaze Bayley im Vorprogramm mussten aufgrund von krankheitsbedingten Problemen leider gecancelt werden. Allerdings werden die Deutschland Dates nachgeholt werden - konkrete Termine lagen zwar noch nicht vor, aber sobald die Dates spruchreif sind, werde ich es Euch nat&#252;rlich mitteilen.</LI></P>

<p><li>Nachdem wochenlang Ger&#252;chte im Umlauf waren, nachdem ex-Take That Mitglied (!!!) (eigentlich furchtbar, soetwas in einem Metal Magazin zu schreiben...) <b>Robbie Williams</B> Rock Legende <b>Queen</B> bei einigen Shows aushilft, k&#246;nnen Queen Fans nun erleichtert aufatmen: Robbie wird mitnichten die Nachfolge von Freddie Mercury antreten. Bleibt nur zu hoffen, da&#223; auch Gitarrengott <b>Brian May</B> mal langsam wieder zur Besinnung kommt und statt irgendwelche Bands wie Five oder Foo Fighters zu unterst&#252;tzen seine n&#228;chste Soloplatte in Angriff nimmt. </LI></P>

<p><li>Bassist <b>Jason Newsted</B> ist &#252;berraschend bei <b>Metallica</B> ausgestiegen. &#220;ber die genauen Gr&#252;nde ist bisher noch wenig konkretes durchgesickert - genauso wenig wie &#252;ber einen potentiellen Nachfolger. Mal abwarten, wen unsere Napster Freunde engagieren.</LI></P>

<p><li>Ruhe kennt man im Hause <b>Virgin Steele</B> wohl nicht: Im Moment sind die Mannen zwar noch auf Tour mit HammerFall und Freedom Call, aber im Juni wird bereits, nach dem Erfolg von &quot;The House Of Atreus&quot;, die zweite Oper von Mastermind David DeFeis aufgef&#252;hrt. &quot;Die Rebellen&quot;, so der Titel der neuen Oper, hat als inhaltliche und musikalische Grundlage die Virgin Steele Triologie &quot;The Marriage Of Heaven And Hell - Part I und II&quot; sowie &quot;Invictus&quot;. </LI></P>

<p><li>Das geplante neue <b>Rough Silk</B> Album wird nun doch nicht in den n&#228;chsten Wochen, sondern erst im Sommer seine Premiere feiern. Einer der Gr&#252;nde daf&#252;r ist sicherlich, da&#223; Co-Produzent <b>Jon Olivia</B> in den letzten Wochen viel zu sehr mit seiner eigenen Band Savatage, derren neues Album &quot;Poets And Madmen&quot; samt Single in den n&#228;chsten Wochen erscheint, besch&#228;ftigt war.</LI></P>

<p><li><b>Overkill</B> haben einen neuen Gitarristen: Nachdem Joe Comeau zu Annihilator gewechselt ist, zeichnet sich von nun an <b>Derek Tailer</B> (ex-Dee Snider) f&#252;r die Gitarren verantwortlich. Schon bei den Dates in Japan Ende Januar ist Derek Tailer als neues, festes Bandmitglied vorgestellt worden.</LI></P></UL>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
