<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Blick in die Zukunft</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Blick1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Blick.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Tests.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Blick in die Zukunft
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Vorstellung: USB (Universal Serial Bus)</H2>
<P>
<A HREF="img/USB-Logo.png"><IMG SRC="thumb/USB-Logo.jpg" WIDTH="120" HEIGHT="49" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
&quot;Einstecken und loslegen&quot;,
</P>
<P>
&quot;Alte Z&ouml;pfe kappen&quot; oder auch &quot;Plug-and-Play in Perfektion&quot; waren die
Schlagworte, die man seit der Vorstellung des USB (Busses) im Jahre 1996 zu
h&ouml;ren und zu lesen bekam. Seit 1 1/2 Jahren, werden praktisch alle neuen
PC´s mit den zwei obligatorischen aber unscheinbaren USB Ports
ausgeliefert ohne aber zu Begin rechte Begeisterungsst&uuml;rme ausgel&ouml;st zu
haben.
</P>
<P>
Die USB-Technologie wurde von der Computerindustrie gemeinsam entwickelt,
allen voran Intel, mit dem Ziel eines plattform&uuml;bergreifenden
Industriestandards im Bereich Schnittstellen f&uuml;r Peripherieger&auml;te, als da
z.B. w&auml;ren:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Tastatur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Maus&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Joystick&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">ISDN-Adapter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Monitore als USB Hub ( konventionelle wie auch Flachbildschirme)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Kamera&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&quot;Langsamere&quot; Wechseldatentr&auml;ger ( ZIP, Streamer, Disk Nachfolger, usw.)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Modem&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Scanner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Drucker&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Dongle (Hardlock)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Lautsprecher(ohne Soundkarte nutzbar)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">USB-Parallelportadapter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">USB-Serielportadapter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Zusatzger&auml;te wie z.B. Finger-Scanner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Ebenso,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- einfachere Verbindung,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- h&ouml;here Leistung,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- automatische Konfiguration&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- flexiblere Erweiterungsoptionen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">- einschlie&szlig;lich der f&uuml;r die Hardware Entwickler entscheidenden Aspekten,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">wie niedrigere Kosten, sowohl der Elektronik in den Ger&auml;ten, aber besonders&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">auf Seite der Rechner durch Wegfall vieler verschiedener Controller und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Schnittstellen, sowie umfassender Kompatibilit&auml;t und einer mit der Zeit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">immer gr&ouml;&szlig;er werdenden Anzahl verf&uuml;gbarer Peripherieger&auml;te. Bis es&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">schlie&szlig;lich soweit ist, dass diese Ger&auml;te nur noch einen USB Port, gewisse&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Drucker h&ouml;chstens noch Netzwerk Anschl&uuml;sse haben. Wer keinen USB Port am&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ger&auml;t hat, kann sich ja mit Adapter behelfen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Denn w&auml;hrend zu Beginn nur Prototypen und Vorserienmodelle einzelner Ger&auml;te
&uuml;ber die Messen und durch Redaktionsb&uuml;ros geisterten, hat sich die
Situation schlagartig ge&auml;ndert. Da Intel daran beteiligt war, konnte man
dem USB eine durchaus reale Chance einr&auml;umen, da&szlig; es mehr wird, wie eine
kurzfristige Modeerscheinung. Wie das Beispiel DirectRambus, die neue
Speichertechnologie allerdings zeigt, hat Intel auch nicht mehr den
Gott-gleichen Einfluss im Hardware Bereich, wie Intel sich das w&uuml;nscht.
</P>
<P>
Mitentscheidend war, dass Microsoft im letzten Windows 95 Update, bekannt
als Win 95 B, das vor dem Weihnachtsgesch&auml;ft 97/98 kam, direkte
Betriebssystem Unterst&uuml;tzung f&uuml;r den USB bot. Allerdings in einer Art und
Weise, mit etlichem installieren von Diskette und Neustart des Rechners,
aber nur direkt nach einer kompletten Neuinstallation, die man nur als
peinlich f&uuml;r ein Plug-and-Play OS bezeichnen kann. Aber sei´s drum, ich
denke USB ist heute schon nicht mehr wegzudenken und wird auch aus mehreren
Gr&uuml;nden seinen Weg machen, gerade weil die Idee die dahinter steht, einfach
gut ist und man sich nicht so sehr in Feindbilder verrennen soll. Oder
besser gesagt, man soll nicht so viel durcheinander werfen. Auch nicht,
wenn ich gerade in diesem Absatz, DAS Feindbild erw&auml;hnt habe.
</P>
<P>
Denn der entscheidende Schub kam, als Apple ihren, trotz berechtigter oder
unberechtigter Kritik und allen Unkenrufen, erfolgreichen iMac auf den
Markt brachte, der dem USB zum entg&uuml;ltigen Durchbruch verhalf. Apple setzt
beim iMac ausschlie&szlig;lich auf den USB Port. Also, zum Teufel mit dem eigenen
ADB (Apple Desktop Bus), ja selbst SCSI soll erst mal dran glauben. Daran
wird sich wahrscheinlich auch nichts mehr &auml;ndern.
</P>
<P>
Sah es kurze Zeit so aus, dass es Mode werden w&uuml;rde, sich eine
PCI-Schnittstellenkarte mit zwei USB Ports zu besorgen, ist es nun so, dass
man sich durch die Kurzlebigkeit heutiger Rechnergenerationen h&ouml;chstens
noch USB-Parallelportadapter zulegen muss, um seinen neuen teuren Tinten-
oder Laserdrucker anzuschlie&szlig;en, selbst wenn man noch eine Parallele oder
Serielle hat, denn auch an der Geschwindigkeit merkt man die
Neuentwicklung.
</P>
<P>
Weil ich hier ja in einem Amiga Magazin schreibe, eine daraus
resultierende, an und f&uuml;r sich &uuml;berfl&uuml;ssige Bemerkung:
Die Zeit der Insel-L&ouml;sungen bei Schnittstellen bei einem m&ouml;glichen neuen
Amiga ist endg&uuml;ltig vorbei. Also keine Extratouren mehr bei Tastaturen,
M&auml;use oder Joysticks, wo man in den letzten Jahren, abgesehen von der
Auswahl des Designs, das immer gr&ouml;&szlig;ere Problem der Beschaffung hatte. Auch
das Trauerspiel mit dem in einigen Bereichen inkompatiblen Parallelport
(Streamer) UND Serialport (wer erinnert sich noch an die ISTEC ?) ist dann
Geschichte. Auch k&ouml;nnte das Thema &quot;Dongle&quot; wieder den ein oder anderen
K&auml;ufer teurer Software besch&auml;ftigen. Was aber nat&uuml;rlich system&uuml;bergreifend
ist und von mir nur so eingeschoben wurde.
</P>
<P>
==================================
</P>
<P>
Ich denke es macht im Moment, nach 5 Seiten Papier (dem Technologie Brief),
noch keinen Sinn &uuml;ber die Implementierung in ein neues Amiga System zu
schreiben. Auch nicht so sehr, wie das bei Windows, OS/2 oder MacOS
abl&auml;uft, h&ouml;chstens demn&auml;chst mal &uuml;ber den aktuellen Stand bei Linux oder
FreeBSD / NetBSD . Links mit Infos zu den beiden Letzten sind immer
willkommen.
</P>
<P>
Darum werde ich hier erstmal die Bus- und Datentransferprotokolle aussparen
und mich nach der langen Vorrede auf die Hardware konzentrieren, die einige
sehenswerte Neuerungen bietet.
</P>
<P>
USB-Peripherieger&auml;te bieten echte ,,Plug&amp;Play``-Funktionalit&auml;t, da die
Ger&auml;te bei eingeschaltetem Rechner ein- und ausgesteckt werden k&ouml;nnen. Dies
ist besser bekannt als &quot;Hot-Plug-In&quot; oder &quot;Hot-Plugging&quot; , womit die
Notwendigkeit entf&auml;llt, den Computer nach einer &Auml;nderung der
Ger&auml;tekonfiguration neu zu starten. Dank dieser F&auml;higkeit k&ouml;nnen die
Benutzer ihre USB-Peripherieger&auml;te jederzeit bei Bedarf anschlie&szlig;en oder
vom System trennen. Allerdings, wenn ich mir diese Bemerkung noch erlauben
darf, hat Euer Mr T., wir mir ein Bekannter erz&auml;hlte, dieses Hot-Plugging
auf einer Messe mit einem A-1200 und den originalen Schnittstellen auch
mehrmals erfolgreich vorgef&uuml;hrt.
</P>
<P>
Hatte man bisher bei den vielen verschiedenen Schnittstellen wenige
M&ouml;glichkeiten weitere Ger&auml;te anzuschlie&szlig;en, IDE intern max. 2x2 oder bei
der SCSI Familie 7 bzw. 15, so sind es beim USB Port im Moment max. 127
Ger&auml;te! Das &quot;Moment&quot; bezieht sich darauf, dass aktuell bereits an den
Spezifikationen zur Version 2.0 des USB Standards gearbeitet wird, wo nicht
nur der Datendurchsatz drastisch erh&ouml;ht werden soll, sondern m&ouml;glicherweise
auch diese Beschr&auml;nkung aufgehoben wird.
</P>
<P>
F&uuml;r den Anschluss eines USB-Ger&auml;ts muss wirklich einfach nur das USB-Kabel
in den USB-Anschluss des Computers gesteckt werden. Aktive / passive
Abschlusswiderst&auml;nde oder -stecker, Speicheradressen
(Interrupt-Einstellungen - PC hehe ) oder ID-Nummern, inkl. der doppelten
Vergabe, bzw. die gelegentliche Beachtung der Reihenfolge, geh&ouml;ren damit
der Vergangenheit an.
</P>
<P>
Viele, nicht alle der l&auml;stigen 230V Netzkabel verschwinden.Oder sollte ich
besser schreiben, das suchen nach einer freien Steckdose f&auml;llt weg. Ebenso
die unhandlichen dicken Parallel- oder SCSI Kabel und der Unsicherheit, ob
sie richtig eingesteckt sind und dauerhaft fest sitzen, sind kein Thema
mehr. Es wird ein neuer Kabeltyp verwendet - klein, einfach, preiswert und
leicht anzuschlie&szlig;en - der allem Kabelsalat ein Ende macht - na gut, machen
soll. Dank USB k&ouml;nnen beim Anschluss eines Peripherieger&auml;ts praktisch keine
Fehler mehr passieren. Es gibt erst mal nur einen Kabeltyp (USB A-B) mit
zwei unterschiedlichen Steckern, die beim Anschluss nicht vertauscht werden
k&ouml;nnen.
</P>
<P>
So zumindest die Theorie. Die Praxis sieht manchmal etwas anders aus, denn
ein Spiel dauert 90 Minuten und der Ball ist rund.
</P>
<P>
Nun wirklich mehr zur Hardware. Das USB System l&auml;sst sich in verschiedener
Hinsicht in zwei Teile aufteilen:
</P>
<P>
USB Version 1.1 hat einen theoretischen Datendurchsatz von 12 MBit /
Sekunde. Zum Vergleich, das ist etwas mehr wie der 10 MBit/s Ethernet
Standard vorsieht. Das Kabel selbst, ist nichts weiter, als ein 4 adriges
Kabel, mit 90 Ohm Impedanz, mal mit, mal ohne Abschirmung, dazu gleich
mehr. Allerdings m&uuml;ssen sich daher auch alle an einem Host angeschlossenen
Ger&auml;te, diese 12 MBit/s teilen. Je mehr Ger&auml;te dranh&auml;ngen und gleichzeitig
aktiv sind, je problematischer kann es werden.
</P>
<P>
<A HREF="img/USB-Kabel.png"><IMG SRC="thumb/USB-Kabel.jpg" WIDTH="120" HEIGHT="37" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Kabeldetails
</P>
<P>
Alle Daten werden &uuml;ber ein bidirektionales Leitungspaar gef&uuml;hrt. Dazu kommt
noch eine Masseleitung, sowie eine Versorgungsspannungsleitung (+5V). Die
Daten werden differentiell &Uuml;bertragen, wodurch sich der USB als sehr robust
erweist. Dementsprechend &quot;einfach&quot; sind auch die Steckverbindungen
ausgelegt. Also nichts mehr mit 50/68 Pins wie bei SCSI. Schon gar nichts
mehr mit den diversen 9 oder 25 poligen, m / w Sub-D Stecker, wo z.T. dann
doch nur ein paar Adern belegt sind und den manchmal n&ouml;tigen Adaptern und
den daraus resultierenden Umtauschorgien.
</P>
<P>
Die Bemerkung &uuml;ber die Abschirmung deutet es schon an. Trotz gleicher
Stecker und wirklich nur einer Leitung f&uuml;r alle Daten, teilt man den USB
nochmal auf. Einmal in einen Low-Speed Kanal und einen Medium-Speed Kanal.
Eigentlich wird dieser noch High-Speed Kanal genannt. Im Hinblick auf USB
2.0, der dann wie erw&auml;hnt beim Datendurchsatz zulegen soll, ziehe ich
Medium-Speed vor. Allerdings wird die Verabschiedung noch etwas dauern.
Auch habe ich was die Speed angeht, schon alles von 120 - 500 MBit/s
geh&ouml;rt. Hardware kompatibel soll er aber bleiben. Beide Modi sind zur
selben Zeit im USB-System m&ouml;glich, was durch ger&auml;te-transparentes
Umschalten zwischen diesen Modi erm&ouml;glicht wird. Entsprechent teilt man
auch Ger&auml;te in Low-Speed und High-Speed Ger&auml;te auf, was f&uuml;r den Anwender
prinzipiell egal ist.
</P>
<P>
Low-Speed Kanal
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Datendurchsatz:&nbsp;</TD><TD VALIGN="TOP">1,5 MBit/s&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ger&auml;te:&nbsp;</TD><TD VALIGN="TOP">M&auml;use, Joystick, Dongle&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Kabel:&nbsp;</TD><TD VALIGN="TOP">einfach, nicht abgeschirmt, feste Verbindung am Ger&auml;t (meist)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Max. Kabell&auml;nge:&nbsp;</TD><TD VALIGN="TOP">3 Meter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Medium-Speed Kanal
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Datendurchsatz:&nbsp;</TD><TD VALIGN="TOP">12 MBit/s&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Ger&auml;te:&nbsp;</TD><TD VALIGN="TOP">Drucker, Modems&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Kabel:&nbsp;</TD><TD VALIGN="TOP">abgeschirmt,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Max. Kabell&auml;nge:&nbsp;</TD><TD VALIGN="TOP">5 Meter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Leser werden im Technologie Brief bereits von einer weiteren
Eigenschaft gelesen haben, die Collas besonders herausgestellt hat, die
Interaktivit&auml;t. Durch das vollst&auml;ndig bidirektionale System (Signalfluss in
beide Richtungen), sind einige nette Spielereien bereits in Planung. Und
&quot;Spielerei&quot; nehme ich hier als Beispiel. Mit einem Autorennspiel und einer
mit Elektonik und Mechanik entsprechend ausger&uuml;steter (und kostspieligerer)
Lenkrad / Fusspedal Kombination, fahre ich ein Formel 1 Rennen. Durch einen
Fahrfehler und nicht etwa durch einen technischen Defekt verursacht, knalle
ich ungebremst mit 200 Sachen in einen Reifenstapel. Beim Aufprall bekomme
ich einen Schlag der Pedale auf die F&uuml;sse und das Lenkrad verreisst es mir.
Alles nat&uuml;rlich in den Grenzen der Hardware. Das Prinzip wurde hoffentlich
deutlich.
</P>
<P>
Noch ein paar Anmerkungen zu &quot;USB 2 und danach&quot;, am Ende des Artikels.
</P>
<P>
Stecker / Anschlussarten:
</P>
<P>
<A HREF="img/USB-Stecker.jpg"><IMG SRC="thumb/USB-Stecker.jpg" WIDTH="104" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Steckertypen
</P>
<P>
Bild Steckertypen zeigt mit USB-Buchse Typ A, die rechteckige Buchse, die
sich immer auf Hostseite befindet. Nat&uuml;rlich im Ger&auml;t eingebaut. USB -
Buchse Typ B demgegen&uuml;ber, die Quadratische, ist die Buchse, die sich im
Falle eines steckbaren Anschlusses, in dem USB Ger&auml;t befindet. Daraus wird
auch die &quot;Codierung&quot; der USB Kabel ersichtlich. Ein dadurch ben&ouml;tigtes
Kabel mit einem Stecker Typ A und einem Stecker Typ B, ist dann ein
USB-Kabel A-B.
</P>
<P>
Stecker Typ B ist dann &uuml;berfl&uuml;ssig, wenn es sich um ein Low-Speed Ger&auml;t,
wie eine Maus handelt und das Kabel fest am Ger&auml;t angebracht ist.(Bild:
Maus).
</P>
<P>
<A HREF="img/USB-Maus.png"><IMG SRC="thumb/USB-Maus.jpg" WIDTH="120" HEIGHT="89" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Maus
</P>
<P>
Eine weiter Unterteilung besteht in der Leistungsaufnahme der Ger&auml;te,
Low-Power und High-Power. Dieser Punkt kann einen Anwender schon mehr
ber&uuml;hren. Da es dem n&auml;chsten Abschnitt vorgreifen w&uuml;rde, kommt das Thema
nach dem n&auml;chsten Abschnitt.
</P>
<P>
USB Ger&auml;te Aufteilung:
</P>
<B>Host:</B>
<P>
Es gibt nur einen Host in jedem USB-System (Rechner). Das USB-Interface zum
Host-Computer-System wird als Host-Controller bezeichnet, welcher
normalerweise als Kombination von Hardware, Firmware und Software
implementiert wird. Ein sogenannter Root-Hub ist im Host-System integriert
um schon Anschlussm&ouml;glichkeiten f&uuml;r ein oder mehr Endger&auml;te, zu
erm&ouml;glichen. Kurz: Das was man auf der R&uuml;ckseite des Rechners sieht,(
gebr&auml;uchlich, zwei Ports) inkl. der Unterst&uuml;tzung durch das Betriebssystem
und den entsprechenden Treibern.
</P>
<P>
Bild R&uuml;ckseite, zeigt eben eine R&uuml;ckseite eines aktuellen PC´s mit einem
ATX Motherboard und zwei USB Ports:
</P>
<P>
<A HREF="img/USB-Rückseite.png"><IMG SRC="thumb/USB-Rückseite.jpg" WIDTH="74" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
R&uuml;ckseite
</P>
<B>Hubs:</B>
<P>
Hubs (Verteiler) stellen zus&auml;tzliche Anschlussm&ouml;glichkeiten f&uuml;r Endger&auml;te
im USB-System bereit. Irgendwie muss man ja auf die theoretisch m&ouml;glichen
127 Ger&auml;te kommen! Sie stellen Schl&uuml;sselelemente in der
Plug-and-Play-Umgebung des USB dar.
</P>
<P>
<A HREF="img/USB-Hub-Schema.png"><IMG SRC="thumb/USB-Hub-Schema.jpg" WIDTH="120" HEIGHT="53" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bild: Hub-Schema
</P>
<P>
Ein Anschluss an einem Hub wird als Port bezeichnet. In einem USB-System
kann es mehrere Hubs geben. Der
Upstream-Port (die Zuleitung), verbindet den Hub mit dem Host Rechner oder
mit einem anderen Hub n&auml;her am Host. Alle weiteren (Downstream-) Ports
erm&ouml;glichen den Anschluss eines beliebigen USB-Ger&auml;ts. Wobei es
gleichg&uuml;ltig ist, an welchen Port welche oder wie viele Hubs oder Ger&auml;te
angesteckt werden. Hubs sind in der Lage, neu angeschlossene oder wieder
entfernte Ger&auml;te automatisch zu erkennen und stellen die Energieversorgung
f&uuml;r das entsprechende Ger&auml;t sicher,(wird unten n&auml;her beschrieben). Ports
von langsamen und normalen USB-Ger&auml;ten werden voneinander isoliert. Der Hub
besteht hardwarem&auml;&szlig;ig aus dem Hub-Controller und dem Hub-Repeater.
Letztgenannter ist ein Protokollgesteuerter Schalter zwischen Upstream- und
Downstream-Ports. Er besitzt au&szlig;erdem Reset- und Energiesparfunktionen. Der
Hub-Controller stellt Register zur Verf&uuml;gung, um die Kommunikation mit dem
Host zu erm&ouml;glichen. Spezifische Kotroll-Befehle erlauben es dem Host, den
Hub zu konfigurieren und seine Ports zu &uuml;berwachen.
</P>
<B>Endger&auml;te:</B>
<P>
Um dem USB-System zu seiner Funktionalit&auml;t zu verhelfen, m&uuml;ssen Endger&auml;te
an den Host oder einen Hub angeschlossen werden. Ein Endger&auml;t ist
normalerweise ein separates Peripherieger&auml;t mit einem Anschlusskabel, das
in den Port gesteckt wird. Siehe Aufz&auml;hlung am Anfang.
</P>
<P>
Endger&auml;te: Multifunktionsger&auml;te
</P>
<P>
Es ist jedoch auch m&ouml;glich, ein Ger&auml;t mit mehreren Funktionen zu versehen,
die sonst in verschiedenen Endger&auml;ten realisiert w&uuml;rden. Solche Ger&auml;te
werden Multifunktionsger&auml;te (compound devices) genannt. Sie erscheinen f&uuml;r
den Host in Gestalt eines Hubs mit mehreren permanent angeschlossenen
Ger&auml;ten. Ein Ger&auml;t dieser Art ist z.B. ein Monitor mit integriertem Hub,
aber auch hochwertigere Tastaturen dieser Bauart sind schon im Handel, wenn
auch nur mit Low-Power Hubs. Alles schon mal da gewesen, k&ouml;nnen nun Apple
Anwender sagen, die dieses Prinzip bereits mit dem Apple Desktop Bus erlebt
hatten, wo u.a.die Maus an der Tastatur eingesteckt wurde.
</P>
<P>
Als besonderes Beispiel sei hier eine neue Monitor Serie von LG
Electronics, der Flatron 795 FT / 895 FT erw&auml;hnt. Diese haben einen
internen 4-Port USB Hub. Rechts der Anschluss vom Host oder einem anderen
Hub. Und links die vier USB Ports.
</P>
<P>
<A HREF="img/USB-Monitor-Hub.png"><IMG SRC="thumb/USB-Monitor-Hub.jpg" WIDTH="120" HEIGHT="45" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Monitor-Hub
</P>
<P>
Die Ports haben zwar nix mit der Daten&uuml;bertragung der Video Signale zu tun,
sind aber eben als High-Power Hub sehr n&uuml;tzlich wenn man Ports braucht und
sich somit den zus&auml;tzlichen Hub sparen kann. Nachteilig in dem Fall ist,
da&szlig; die Ports nur ansprechbar sind, wenn der Monitor eingeschaltet ist,
oder wenigstens im StandBy l&auml;uft. Zu fr&uuml;h freut man sich, wenn man einen
Monitor aus einer neueren Philips Reihe geschenkt bekommt und dort einen
einzigen USB Downstream Port entdeckt. Dieser dient ausschlie&szlig;lich zum
Austausch von ganz bestimmten Steuersignalen zwischen Grafiksystem und
Monitor.
</P>
<P>
Die Energiefrage:
</P>
<P>
Beim Leistungsverbrauch teilt man die Ger&auml;te in Low-Power und High-Power
auf. Low-Power Devices &lt; 100 mA, sind z.B. M&auml;use und Joysticks. High-Power
Devices, bis 500mA, sind Laserdrucker, Scanner oder, besonders zu nennen,
Aktiv-Lautsprecher Systeme.
</P>
<P>
Das Prinzip bisher war, dass Maus oder Tastatur &uuml;ber das Datenkabel mit
Strom versorgt werden. Bei Drucker, Scanner und dem Rest verfluchte man das
bl&ouml;de Netzkabel und die viel zu kleine Steckdosenleiste. Bei USB kommt der
Strom wie oben schon beschrieben eben auch &uuml;ber das Datenkabel, allerdings
stellt jeder USB-Host nur einen begrenzten Strom zur Verf&uuml;gung. Bei 500 mA
ist Sennse. Das bl&ouml;de, das auch schon Herr Ohm feststellte, ist die
bekannte Tatsache, dass je kleiner die Spannung ist, in dem Fall lausige 5
V, je gr&ouml;&szlig;er muss der Strom sein, um eine vergleichbare Leistung zu
erzielen.
</P>
<P>
Bei meinen beiden Ports im Rechner selbst, erledigt das das Netzteil gleich
mit. Sonst hilft nur eine zus&auml;tzliche Stromversorgung. Nat&uuml;rlich ist das
dann die Zusatzfunktion der Hubs. Da kommt man dann zwar nicht mehr um eine
zus&auml;tzlich Steckdose herum, hat aber nur ein kleines zus&auml;tzliches
Netzteilkabel als Stolperdraht. Ist die zus&auml;tzliche Stromversorgung nicht
n&ouml;tig, braucht man den Hub auch nicht mit Steckernetzteil zu betreiben.
Oder man hat das Gl&uuml;ck und besitzt einen Hub, der z.B. in einem Monitor
eingebaut ist und dann nat&uuml;rlich von dessen Netztteil versorgt wird. Auch
haben viele der High-Power Ger&auml;te eine eigene Stromversorgung und auf Dauer
wird kaum ein leistungshungriges Ger&auml;t ohne zus&auml;tzlichen Stromanschluss,
sei es mit Steckernetzteil oder direkt mit Netzanschluss, verkauft werden.
</P>
<P>
Der USB-Host verf&uuml;gt auch noch &uuml;ber ein Energiesparsystem das unabh&auml;ngig
vom USB funktioniert. Die USB-System Software interagiert mit dem
Host-Energiersparsystem, um auf Ereignisse wie SUSPEND (schlafen, DATA,
schlafen :) oder RESUME (aufwachen) zu reagieren. Zus&auml;tzlich kann jedes
USB-Ger&auml;t &uuml;ber ein eigenes, USB-definiertes Energiesparsystem verf&uuml;gen, was
es erm&ouml;glicht, von der USB-System-Software oder generischen (im OS
implementierter) Ger&auml;te-Treibern manipuliert zu werden. Das
Energiesparsystem macht den Einsatz von USB in energiesensitiven Rechnern
wie zum Beispiel Notebooks interessant.
</P>
<P>
In dem Zusammenhang noch zwei Fremdw&ouml;rter. Arbeitet ein Ger&auml;t ohne
zus&auml;tzliche Stromversorgung, bezeichnet man das als bus-powerer, also
busbetrieben. Mit eigener Stromquelle l&auml;uft es dann eben self-powered,
selbstbetrieben.
</P>
<B>Spezialanwendung:</B>
<P>
Ich m&ouml;chte noch auf den potentiellen SerNet oder ParNet Nachfolger auf USB
Basis hinweisen, der schon ausgemacht wurde und m&ouml;glicherweise auch f&uuml;r
Classic-Amigas mit Zorro -USB Karte interessant sein k&ouml;nnte. Nat&uuml;rlich auch
f&uuml;r alle anderen aus der Par/Ser-Net Vergangenheit bekannten Kombinationen.
Wie dann auch die Verbindung Amiga-Mac ohne Ethernet einfacher werden
k&ouml;nnte. Allerdings unter der Voraussetzung, dass jemand die Software f&uuml;r
Amiga Classic/NG daf&uuml;r schreibt.
</P>
<P>
Seit ein paar Wochen bietet die auch in Amiga Kreisen bekannte, oder
gehasste, Firma Alternate f&uuml;r DM 99.-, das Advance USB Link Kabel an, um
zwei Rechner miteinander zu verbinden. Das &quot;Paket&quot; besteht aus einem zwei
Meter langen USB Kabel (Typ A-A), mit einem in der Mitte integrierten ASIC
Controler f&uuml;r die Hardware Erkennung, Treibern und &Uuml;bertragungs-Software
f&uuml;r Win 95B und 98. &Uuml;bertragungsraten von 6MBit/s bei moderater CPU
Auslastung sind m&ouml;glich.
</P>
<P>
Mein &quot;Blick in die (USB) - Zukunft:
</P>
<P>
Die Erweiterung des USB ist aufgrund einiger Aspekte n&ouml;tig, wichtig,
interessant, wie man will. Zum einen wegen der bereits erw&auml;hnten m&ouml;glichen
Kapazit&auml;tsprobleme. Es werden dadurch auch mehr Reserven geschaffen. Auch
wird es dann erst m&ouml;glich oder sinnvoll, Ger&auml;te anzuschliessen, die einfach
einen h&ouml;heren Datendurchsatz erzeugen, wie diese 12 MBit/s des USB 1.1
Protokols. Zu nennen ist da in erster Linie der Multimediabereich. Als
Schnittstelle f&uuml;r (digital) Audio und Video, das ansteuern umfangreicher
Pr&auml;sentatsionsanlagen und Soundsysteme. Ein Bereich den Apple gerne mit
deren neuer Firewire Schnittstelle abdecken m&ouml;chte. Auch um saftig
Lizensgeb&uuml;hren einzusacken. - Ein kleiner Seitenhieb muss sein.
</P>
<P>
Noch wichtiger erscheint mir das Einbeziehen von Massenspeicher aller Art.
Um wieder Apple ins Spiel zu bringen, muss man dazusagen dass deren max. 63
Ger&auml;te, 400MBit/s, Firewire (IEEE 1394) Bus, urspr&uuml;nglich als SCSI
Nachfolger/Ersatz konzipiert wurde. Firewire, IEEE 1394 oder auch iLink
genannt, kommt bereits in den aktuellen blau/weissen G3 Macs zum Einsatz.
Auch gibt es die ersten externen Festplattenkits von einem Drittanbieter,
sowie digitale Videoschnittsysteme auf Basis von PCI Steckkarten inkl.
Anschluss f&uuml;r entsprechende Cameras .
</P>
<P>
Meine Vorstellung hier, geht IN den Rechner hinein, ohne zu sehr auf
externe Ger&auml;te zu achten. Dieser hat z.B. zwei Festplatten, ein DVD-RW und
SCSI MOD Laufwerk. Sicher sind die 2x2 IDE Ports und eine SCSI Karte mit
der &uuml;blichen Stromversorgung eine feine Sache. Sofern man nie etwas &auml;ndern
und umbauen muss, oder mit irgendwelchen Jumper, Terminatoren, Pin1 auf
Pin1, ID´s, Master,- Slave,- CableSelect Mist oder Reihenfolgeprobleme zu
k&auml;mpfen hat.
</P>
<P>
Nun stelle man sich vor, man hat auf seiner Mutterplatine eine Steckleiste
mit sieben USB Ports, wo man nach Lust und Laune mit 30 cm langen USB A-B
Kabeln, seine Laufwerke mit der Mutterplatine verbinden kann, ohne sich
noch um Stromversorgung und den anderen B&uuml;ttel k&uuml;mmern zu m&uuml;ssen.
</P>
<P>
Allerdings bedarf es es dazu neben den F&auml;higkeiten des USB, auch der
Unterst&uuml;tzung der Massenspeicherhersteller. Denn L&ouml;sungen mit Adapter, egal
ob bei USB oder Firewire, sind auf Dauer nicht durchsetzbar. Denn auch das
oben erw&auml;hnte externe Firewire Festplattenkit, basiert auf einer banalen
IDE Platte mit IDE-Firewire Adapter!
</P>
<P>
Ein weiteres Argument f&uuml;r den USB, heute oder sp&auml;ter, l&auml;sst sich kaum mit
einem Sammelbegriff beschreiben. Viele Ger&auml;te oder Anwendungsbereiche
wurden noch gar nicht auf ihre USB tauglichkeit abgeklopft. Einschlie&szlig;lich
dort, wo Schnittstellen scheinbar keine Rolle spielen. Ich meine in erster
Linie der Vorteil einer einheitliche system&uuml;bergreifenden Schnittstelle,
die in Anbetracht immer leistungsst&auml;rkerer Desktop Computersysteme auch f&uuml;r
 Forschung, Wissenschaft und Lehre in einigen Bereiche f&uuml;r Datenerfassung
und Daten&uuml;bertragung interessant erscheinen.
</P>
<P>
Meine Vorstellungen dazu stehen und fallen mit den Spezifikationen der USB
Version 2.0 und danach. Je stabiler der Bus und je gr&ouml;&szlig;er der
Datenduchsatz, je geringer wird auf Dauer die Chance von Firewire sein.
Sch&auml;tze ich den USB zu hoch ein, wird es bis zum n&auml;chsten, ganz anderen
Standard eben eine mehr oder weniger friedliche Koexistens werden, bzw.
meine getr&auml;umte interne 7-fach USB Steckleiste, ist dann eben eine 7-fach
Firewire Leiste. Wie sich die &quot;Netzwerkwelt&quot;, ob 100 MBit/s / Giga-Bit
Ethernet oder all die anderen in Betrieb oder in Planung befindlichen
Netzwerktechniken im Hinblick auf einen schnelleren USB entwickeln, ist
auch noch ein Fall f&uuml;r die Zukunft.
</P>
<P>
Der ein oder andere Leser der nun so lange durchgehalten hat, wird mich die
ganze Zeit verflucht haben, weil ich fast wie ein Werbeprospekt geschrieben
habe, obwohl es meine Meinung und zum Teil Erfahrung ist. Diese Leser haben
vielleicht schon schlechte Erfahrungen mit USB Treibern oder Ger&auml;te
gamacht, von Kollegen geh&ouml;rt oder dar&uuml;ber gelesen. Nun ja, diese Probleme
sind an einem Windows PC entstanden! Seltener an einem Mac!
</P>
<P>
Ich schreibe hier ja in einem Amiga Magazin und bringe nun auch etwas meine
Hoffnung und Gef&uuml;hle zum Ausdruck, die auch nicht jeder Ex Amigarianer hat.
Amiga Inc. hat es nun in der Hand, etwas aus diesem Neuanfang zu machen.
Denn die sind in der einmaligen Lage, die weder Linux hat, noch Be jemals
wieder haben wird. Amiga kan sowohl das Betriebssystem wie auch die
Hardware neu aufbauen. Der Linux Kern ist nicht alles! Wichtig ja, aber
nicht alles! Amiga und Collas M&Uuml;SSEN ein System vorlegen dass nach Prospekt
funktioniert. Oder ich schreibs etwas anders:
</P>
<P>
Nur ein funktionierendes System, das es nicht n&ouml;tig hat sich die besten
Ideen von anderen zu klauen und dann zu behaupten es w&auml;ren ihre eigenen
Innovationen oder so zu tun als ob, und wenn was nicht l&auml;uft, die Schuld
auf andere zu schieben, hat das Zeug zu einem (neuen) Amiga.
</P>
<P>
So, das war's f&uuml;r die Septemberausgabe. N&auml;chsten Monat kommt entweder was
zur sagenhaften CPU oder zu Firewire oder zu etwas ganz anderem.
</P>
<P>
Gute Nacht.
</P>
<P>
Thomas Hasemann
</P>
<P ALIGN="RIGHT">
<A HREF="Blick1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Tests.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
