<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P>
Wenn Ihr einen Beitrag habt, schreibt bitte an:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<H2>1. Reaktion auf den Leserbrief von Harald Knoop (von Steffen H&auml;user)</H2>
<P>
&raquo;<BR>
&gt; <I>Ich halte es fur falsch, Linux zum Kernel des Amiga-Betriebssystems zu</I><BR>
&gt; <I>machen. Warum gibt Amiga Inc. QNX auf, das schon</I><BR>
&gt; <I>fast fertig ist? Au&szlig;erdem ware bei einem urplotzlichen Systemwechsel die</I>
</P>
<P>
Ich halte es dagegen f&uuml;r richtig. QNX hatte ein Jahr Zeit, ihr OS zu
&quot;AMIGA-isieren&quot; aber in dieser Richtung hat sich NICHTS getan. Dies zeigt,
dass QNX niemals an &quot;AMIGA&quot; interessiert war, sondern nur, einen Markt f&uuml;r
ihr OS zu finden. Ebenso wie fr&uuml;her die Firma Be. Ich war gegen BeOS, und
ich war eigentlich auch von Anfang an gegen QNX, auch wenn ich solange es
von AMIGA unterst&uuml;tzt worden war, nichts dazu gesagt habe.
</P>
<P>
Bei Linux ist der Source-Code &ouml;ffentlich verf&uuml;gbar. AMIGA besitzt die
Chance, das OS nach ihren W&uuml;nschen zu ver&auml;ndern. Es geht wie gesagt *nicht*
darum, einen Rechner mit einer Standard-Linux-Distribution auszuliefern, es
geht darum, ein neues AmigaOS um einen modernen OS-Kernel herum aufzubauen.
&Auml;hnliches macht derzeit (allerdings nicht um Linux, sondern ein anderes
Unix-nahes Betriebssystem) die Firma Apple mit Mac OS X. Wenn man Mac OS X
betrachtet, merkt man in keinster Weise, dass es eigentlich ein Unix ist.
Es sieht aus und verh&auml;lt sich genau wie Mac OS. Genau so etwas hat AMIGA
vor.
</P>
<P>
Mit QNX w&auml;re das aufgrund der Tatsache, dass QNX sich scheinbar geweigert
hat, das Look&amp;Feel ihres OS zu ver&auml;ndern (oder warum sonst sieht Neutrino
immer noch nicht wie AmigaOS aus?) niemals m&ouml;glich gewesen.
</P>
<P>
&gt; <I>Als ALTERNATIVE ist Linux zwar in jedem Fall gut. Wenn es aber wirklich</I>
</P>
<P>
Noch einmal. Es geht NICHT um das Betriebssystem Linux, wie es auf PCs
eingesetzt wird!!!
</P>
<P>
Was auch gesagt werden sollte: QNX mag &uuml;ber einen effizienten Kernel
verf&uuml;gen (was bei Linux &uuml;brigens auch der Fall ist), aber das OS drumherum
ist nach dem was ich bisher dar&uuml;ber gelesen habe ziemlich SCHLECHT. Etwa
gibt es nicht einmal ein Datatype-Konzept...
</P>
<P>
Aber wie immer bei solchen Dingen geben in den Newsgroups etliche Leute
ihren &quot;Senf&quot; dazu ab, die sich eigentlich in keinster Weise ausreichend
informiert haben, um gen&uuml;gend dar&uuml;ber zu wissen.
</P>
<P>
Ein weiterer Punkt ist, falls die Ger&uuml;chte wirklich stimmen, wird die CPU
der Transmeta-Prozessor des Linux-Erfinders sein. Dank der speziellen
F&auml;higkeiten dieser CPU (soweit die Ger&uuml;chte besagen), sollte es m&ouml;glich
sein, eine Amiga Classic Emulation aufzubauen, die selbst die Leistung
einer PowerPC-Karte schl&auml;gt.
</P>
<P>
Steffen H&auml;user &lt;<A HREF="mailto:magicsn@birdland.es.bawue.de">magicsn@birdland.es.bawue.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
