<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Im Vergleich zum Vormonat ist die Einsenderzahl leicht angestiegen: 65
Leser haben mitgemacht. Bitte denkt auch diesmal wieder an die Teilnahme.
</P>
<P>
Jetzt aber zur Aufl&ouml;sung:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">AMIGA hat im Juli eine Kooperation mit einem bekannten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Softwarehersteller angek&uuml;ndigt. Wie hei&szlig;t er?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Es handelt sich nat&uuml;rlich um die Corel Corporation.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Welcher Schnittstellen-Standard zur &Uuml;bertragung digitaler&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Daten verbirgt sich hinter der Bezeichnung 'IEEE 1394'?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Damit ist der sogenannte FireWire-Bus gemeint. Die offizielle&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Bezeichnung lautet 'IEEE 1394-1995 Standard for a High Performance&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Serial Bus' und wurde ebenfalls als Antwort akzeptiert, genauso&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">wie die auch gebr&auml;uchliche Wortsch&ouml;pfung 'iLINK'.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wie bewertest du die Anstrengungen von Phase 5 und QNX, ein&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Konkurrenz-Computersystem zum AmigaNG zu schaffen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Auswertung:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Finde ich gut.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">23&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Nicht gut, es k&ouml;nnte eine Spaltung des Amiga-Marktes bewirken.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">23&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Nicht gut, aber eine Spaltung des Marktes bef&uuml;rchte ich nicht.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">17&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Zwei Leser konnten sich nicht f&uuml;r eine Antwort entscheiden.
</P>
<P>
Einige Einsender haben zu ihrer Beantwortung der Masterfrage Stellung
genommen:
</P>
<P>
Oliver Tacke glaubt nicht an eine Spaltung des Amiga-Marktes: &raquo;Meiner
Meinung nach spielt sich phase5 (mal wieder) als Retter der Amiga-Welt auf
und versucht durch die teilweise recht unpopul&auml;re Linux-Entscheidung von
Amiga mit QNX Stimmen zu sammeln. Auch wenn ihr System vielleicht recht
interessant werden sollte - ich bef&uuml;rchte keine Spaltung des Amiga-
Marktes.&laquo;
</P>
<P>
Kilian Servais wartet erst einmal ab: &raquo;Erstmal muss es &uuml;berhaupt da sein
(Pre / Box, A / Box, Blizzard 2604 PPC etc.). Ein Konkurrenzsystem ist
immer gut (da Konkurrenz bekanntlich den Markt belebt), zumal es sich ja
erst noch herausstellen muss, welches von beiden Systemen das bessere ist.
Eine Spaltung des Marktes wird es eh geben (diejenigen, die bisher Tausende
von Mark in PPC gesteckt haben und jene, die das neue System bevorzugen),
so da&szlig; ein weiterer Rechner auch nicht weiter schlimm ist :-)) Abwarten...&laquo;
</P>
<P>
Thomas Mitzschke w&uuml;nscht sich eine Zusammenarbeit von AMIGA, Phase 5 und
QNX: &raquo;Wenn schon ein Konkurrenz-Comutersystem, dann aber ein kompatibles
zum AmigaNG. Ich w&uuml;rde es begr&uuml;&szlig;en, wenn Phase 5, QNX und AMIGA zusammen
arbeiten w&uuml;rden und nicht gegeneinander. Konkurrenz-Computersysteme haben
wir schlie&szlig;lich genug, auch wenn man eine WinDose nicht mit einem Amiga
vergleichen kann, wo eine gro&szlig;e Fangemeinde dahinter steht und auch bereit
ist, f&uuml;r ein gutes Amiga-System etwas mehr Geld auszugeben.&laquo;
</P>
<P>
Zeljko Vulinovic sieht im Amirage keine Konkurrenz zum AmigaNG: &raquo;Finde ich
gut, obwohl ich die Relevanz f&uuml;r den angepeilten Markt f&uuml;r den AmigaNG
nicht sehe - von daher eigentlich keine Konkurrenz...&laquo;
</P>
<P>
Christian Kess bef&uuml;rchtet eine Spaltung des derzeitigen Amiga-Marktes: &raquo;Es
ist nicht gut, wenn der Amiga-Markt in zwei Richtungen f&auml;hrt. Aber ich
denke, das k&ouml;nnte ohne weiteres passieren, da QNX-Applications wohl nicht
Linux-kompatibel sind und umgekehrt. Aber das wird wohl haupts&auml;chlich von
den Developers gepr&auml;gt, es kommt halt darauf an, auf welchem System die
meisten bzw. besten Programme rauskommen.&laquo;
</P>
<P>
Stefan Klein bewertet das Projekt von Phase 5 positiv, &raquo;solange beide
Systeme untereinander kompatiebel und austauschbar bleiben.&laquo;
</P>
<P>
Dieter Schoo sieht keinerlei Sinn im Amirage-Rechner: Er &raquo;ist v&ouml;llig
unn&uuml;tz; das Ger&auml;t wird h&ouml;chstens von einigen jetzigen Amiganern gekauft und
wird in Zukunft genauso ein Nischendasein f&uuml;hren, wie es der Amiga jetzt
tut; keinerlei Konkurrenz f&uuml;r den neuen Amiga. Wenn Jim Collas und seine
Mannen das verwirklichen und durchsetzen, was sie sich vorstellen (und
davon gehe ich aus, nach dem Aufwand, den sie betreiben und mit Gateway im
R&uuml;cken!), dann ist der neue Amiga gleichzusetzen mit der Idee und deren
Durchsetzung vor ein paar Jahren, den Computer zu einem &quot;Personal-Computer&quot;
f&uuml;r jedermann zu machen. Das war damals auch &quot;revolution&auml;r&quot;.&laquo;
</P>
<P>
Marcus Stratmann sieht das Amirage-Projekt positiv, aber kaum Chancen, dass
es sich auf dem Markt etabliert: &raquo;Konkurrenz belebt das Gesch&auml;ft.
Allerdings wird es der neue Amiga schon schwer genug haben, da wird es f&uuml;r
Phase 5 / QNX wohl fast unm&ouml;glich, einen Nischenplatz zu ergattern. Und
wieder mal hat die bessere Technik verloren...&laquo;
</P>
<P>
Wolf Zimmer glaubt nicht an den Erfolg des Phase5-Projekts: &raquo;Ich sehe keine
Gefahr, dass der Amirage TM K2 je eine nur ann&auml;hernd konkurrenzf&auml;hige Rolle
erwerben wird. Es kann sehr leicht sein, dass er noch nicht einmal das
Prototypstadium verlassen wird. Was n&uuml;tzt ein Rolls Royce in einer
eingemauerten Garage ohne Verbindung nach au&szlig;en? Mit einem mitgebrachten
Benzinkanister kann ich zwar den Motor laufen lassen, aber nicht fahren.&laquo;
</P>
<P>
Michael Alzheimer findet das Ganze &raquo;prinzipiell gut - denn &quot;Konkurrenz
belebt das Gesch&auml;ft&quot; - nur sollten die beiden Systeme wenigstens ein wenig
kompatibel miteinander sein. Es sollte in jedem Fall m&ouml;glich sein, dass man
auf beiden Systeme jeweils die Applikationen des anderen Systems laufen
lassen kann, und sei es durch eine Hardware-Emulation (Software klaut zu
viele Ressourcen). Wenn die Systeme nicht kompatibel zueinander sind, gibt
es eine Splittung - und das muss man auf jedem Fall vermeiden!&laquo;
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Markus Castro&nbsp;</TD><TD VALIGN="TOP">ist skeptisch: &raquo;Wieder so eine Aktion ala Phase 5 plus Haage&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">/ IWin / etc.&nbsp;</TD><TD VALIGN="TOP">Kommt nie was bei raus, spaltet den Markt, senkt Hoffnung und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Vertrauen in&nbsp;</TD><TD VALIGN="TOP">diese Firmen - und &uuml;berhaupt: F&uuml;r einen Computer mit QNX&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">brauch ich nicht auf deren Kiste zu warten. Da w&uuml;rde es auch ein x86&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">tun...&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>Fazit:</H3>
<P>
Knapp zwei Drittel der Teilnehmer lehnen das Projekt von Phase 5 ab,
hingegen wird es von den &uuml;brigen Einsendern bef&uuml;rwortet. Unter den Gegnern
bef&uuml;rchtet eine knappe Mehrheit die Spaltung der Amiga-Gemeinde.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Schnittstellenkarte &quot;Hypercom 1&quot;: Peter Pfeifer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Wildfire 5 PPC (engl. Handbuch): Frank Wickel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Wildfire 5 (engl. Handbuch): Holger Jeromin&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Johannes Geiss&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;ManiacBall&quot;: Olaf Krafft&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Sharks!&quot;: Mark Buonfrate&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herzlichen Gl&uuml;ckwunsch!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
