<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Amiga PowerPC & AmigaNG-Konkurrenzsysteme</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="PowerPC.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="PowerPC4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Amiga PowerPC &amp; AmigaNG-Konkurrenzsysteme
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Statement zum geplanten Volltext&uuml;bersetzer warpTrans ver&ouml;ffentlicht</H2>
<P>
&raquo;Pressebericht
</P>
<P>
Statement &uuml;ber die derzeitige Lage des warpTrans Projekts von WARP9
</P>
<P>
Hallo Amiganer!
</P>
<P>
Vielleicht ist ihnen in den Medien unser warpTrans Projekt aufgefallen.
Wenn nicht hier nochmal eine kurze Beschreibung:
</P>
<UL>
<LI> Volltext&uuml;bersetzer f&uuml;r Englisch-Deutsch, Deutsch-Englisch
</LI>
<BR><LI> hohe Erkennungsgenauigkeit von Diktaten (Soundkarte erw&uuml;nscht)
</LI>
<BR><LI> Diktate speicherbar in Text und HTML
</LI>
<BR><LI> Mit erweiterbaren Easy-Click-Dictionary W&ouml;rterbuch f&uuml;r 480.000 W&ouml;rter
</LI>
<BR><LI> direktes &Uuml;bersetzen von Diktaten, iff, aiff und wav, allen Texten (ASCII,
  Wordworth, RTF..), Email (YAM) und HTML Dateien
</LI>
<BR><LI> &uuml;ber 46.000 Redewendungen
</LI>
<BR><LI> neu entwickeltes Sprachausgabensystem (englisch oder deutsch)
</LI>
<BR><LI> OCR Unterst&uuml;tzung
</LI>
</UL>
<P>
H&ouml;rt sich doch gut an, oder?
Seit Januar 1999 laufen die Programmierarbeiten, die von einem
Niederl&auml;ndischen Team durchgef&uuml;hrt werden. Aufbauend auf eine schon fertige
W&ouml;rterdatenbank war eine Umsetzung &uuml;berhaupt erst m&ouml;glich. Die
Spracherkennung ist so gut wie abgeschlossen und ist auf dem AMIGA in
dieser qualitativ hochwertigen Form bislang einmalig. Eine Integration
dieses Systems in anderen Anwendungen ist auch denkbar. Um das warpTrans
Projekt zu einer Final Version zu abzuschlie&szlig;en, sollte der Zeitraum bis
November ausreichen.
</P>
<P>
Trotz Bekanntmachungen war die Resonanz interessierter User eher d&uuml;rftig.
Dabei rufen doch alle immer nach neuer innovativer Software. Da sollte man
doch meinen, da&szlig; ein solches Programm mehr Aufmerksamkeit verdient h&auml;tte.
Aber anscheinend ist dem nicht so. Es gibts wohl schon alles und keiner
will und braucht was Neues?
Dies f&uuml;hrte dazu das ein wichtiger Programmierer aus unseren Team absprang,
da er keine Zukunft mehr in diesen Projekt sah.
</P>
<P>
Zum einen erschwert dies massiv unseren angestrebten Zeitplan einzuhalten
und au&szlig;erdem sind wir von WARP9 mit dem Interesse der Amiganer auch sehr
unzufrieden, was uns dazu zwingt, zu pr&uuml;fen inwiefern es Sinn macht den
finanziellen Aufwand einzugehen, das Programm zu ver&ouml;ffentlichen. Die von
uns eingesch&auml;tzten Verkaufszahlen best&auml;tigen unseren Zweifel. Gespr&auml;che mit
anderen Software-Firmen im AMIGA-Sektor ergaben, da&szlig; diese oftmals nur sehr
geringe Anzahlen von Kopien ihrer mitunter hochwertiger Software verkaufen,
die unserem Programm gegen&uuml;ber, vom Nutzen her, zum Teil viel interessanter
und wichtiger f&uuml;r jeden Benutzer sein sollten. Aber es gibt auch eine
Vielzahl &quot;mieser&quot; Produktionen, die man keinen K&auml;ufer zumuten kann - Man
schau nur einmal kritisch auf dem Spiele-Markt. Wenn die keiner kauft
k&ouml;nnen wir dies sehr gut nachvollziehen. Wir werden jedenfalls den Markt
peinlich genau beobachten und dann unseren n&auml;chsten Schritt einleiten. Wir
werden dabei auch die n&auml;chste Amiga Generation Beachtung schenken. Bis
dahin werden wir definitiv an unseren Projekt weiterarbeiten!
Wir weisen hiermit auch darauf hin, da&szlig; Raubkopien einen erschreckend
gro&szlig;en Teil zu geringen Verkaufzahlen beitragen und verweisen auf die
Anti-Piracy Kampagne von Haage&amp;Parter.
</P>
<P>
Noch haben wir nichts entg&uuml;ltiges entschieden. Fest steht:
</P>
<P>
Die Fertigstellung von warpTrans liegt ganz bei euch.
</P>
<P>
Sollten wir den traurigen Weg gehen m&uuml;ssen, werden wir bereit sein, die
Rechte des Programms weiterzugeben. Wir w&uuml;nschen allen Softwareschmieden
den Erfolg den sie verdienen.
</P>
<P>
Kontakt: <A HREF="mailto:warptrans@w-9.de">warptrans@w-9.de</A>
Besuchen sie auch unsere Webseite www.w-9.de&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="PowerPC4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
