<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Techniknews.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Wurde Jim Collas 'gegangen'? - Es spricht einiges daf&uuml;r.
</P>
<P>
Vor weniger als zwei Wochen hat Jim Collas f&uuml;r Ende August einen weiteren
offenen Brief angek&uuml;ndigt, au&szlig;erdem ein Update der h&auml;ufig gestellten
Fragen.
</P>
<P>
Am 27. August (ja, wieder einmal ein Freitag) folgte dann der erste
Paukenschlag, in Form des folgenden Mini-Statements, das in der Rubrik
'Executive Update' auf der AMIGA-Website ver&ouml;ffentlicht wurde:
</P>
<P>
&raquo;In den kommenden Monaten wird sich das Amiga-Team auf die Realisierung
unserer Gesch&auml;fts- und Produktpl&auml;ne konzentrieren. W&auml;hrend dieser Zeit
werden wir zuk&uuml;nftige Firmenziele weder diskutieren noch kommentieren.&laquo;
</P>
<P>
Gleichzeitig wurden s&auml;mtliche Texte, die man bislang in dieser Rubrik
abrufen konnte, entfernt, ebenso wie das Portr&auml;t von Jim Collas. Spontan
haben zwar vereinzelt Anwender einen erneuten Wechsel an der AMIGA-Spitze
vermutet, da jedoch in der Sektion 'Mitarbeiter und Adressen' keine
&Auml;nderungen in der F&uuml;hrungsetage zu verzeichnen waren, sowie durch ein
Statement von AMIGA-Vizepr&auml;sident Petro Tyschtschenko, wurden diese
Bef&uuml;rchtungen schnell wieder zerstreut - zu unrecht, wie sich am 1.
September herausstellte.
</P>
<P>
Jim Collas ist nicht mehr Pr&auml;sident von AMIGA. Vor dem 27. August deutete
nichts darauf hin, dass ein erneuter Wechsel an der Amiga-Spitze
bevorstehen w&uuml;rde, im Gegenteil, in einem Newsgroup Posting von Anfang
August erkl&auml;rte er:
</P>
<P>
&raquo;Die Leitung von Gateway wundert sich, wie ich &uuml;berhaupt so viele
Informationen ver&ouml;ffentlichen konnte. Ich musste mir die Zeit nehmen sie
&uuml;ber die Amiga-Gemeinschaft zu informieren und warum diese die fr&uuml;hzeitige
Unterrichtung verdient. Ich glaube doch, dass ich die Forderungen der
Gesellschaft mit den W&uuml;nschen der Gemeinschaft in ein ausgewogenes
Verh&auml;ltnis gebracht habe. Ich werde mich weiterhin um ein vern&uuml;nftiges
Gleichgewicht bem&uuml;hen.&laquo;
</P>
<P>
Wenn die aus meiner Sicht wahrscheinlichste Theorie zutrifft, haben die
Verantwortlichen bei Gateway seine sehr offene Informationspolitik doch
nicht nachvollziehen k&ouml;nnen - Ger&uuml;chten zufolge sollen sie sogar sehr
ver&auml;rgert gewesen sein - und jetzt eine ihrer Meinung nach gute L&ouml;sung
gefunden - den Wechsel an der AMIGA-Spitze.
</P>
<P>
Es gibt auch Spekulationen, Collas selbst habe alles hingeschmissen, weil
er die von Gateway gew&uuml;nschte Politik nicht erf&uuml;llen konnte oder wollte.
Ist das plausibel? Ich meine nein, denn dann h&auml;tte es h&ouml;chstwahrscheinlich
schon einige Zeit vorher Anzeichen daf&uuml;r gegeben. Ich konnte jedoch in
keinem seiner letzten Newsgroup-Postings Andeutungen/Hinweise finden, dass
er einen R&uuml;cktritt erwogen hatte. Insbesondere die Ank&uuml;ndigung eines
weiteren Executive Updates spricht aus meiner Sicht eindeutig gegen diese
Theorie.
</P>
<P>
Eines aber ist besonders bitter: Wie sich der Wechsel wirklich vollzog,
werden wir vermutlich nie erfahren, weil hochrangige F&uuml;hrungskr&auml;fte von
gr&ouml;&szlig;eren Unternehmen sich normalerweise verpflichten m&uuml;ssen, Stillschweigen
&uuml;ber die Gr&uuml;nde ihres Ausscheidens zu bewahren.
</P>
<P>
Die Erfolge von Jim Collas sind unbestreitbar. Im Februar zum AMIGA-
Pr&auml;sidenten ernannt, ist in den letzten Monaten mehr geschehen, als in den
ganzen letzten f&uuml;nf Jahren zuvor. Jim Collas hat eine
Entwicklungsabteiluung mit einem hochqualifizierten F&uuml;hrungsteam an der
Spitze aufbauen und vor allem ein Konzept f&uuml;r den AmigaNG pr&auml;sentieren
k&ouml;nnen. Dabei scheute er auch nicht die unpopul&auml;re Entscheidung, einen
Linux-Kernel als Basis f&uuml;r den AmigaNG zu verwenden.
</P>
<P>
Jim Collas ist offenbar die allzu offene Informationspolitik - vielleicht
sein einziger gro&szlig;er Fehler - zum Verh&auml;ngnis geworden. Aber es gab nicht
wenige Anwender, die noch mehr wollten - und jetzt vermutlich gar keine
Informationen mehr bekommen. Denn momentan sieht es ganz so aus, als ob der
neue AMIGA-Pr&auml;sident Tom Schmidt &uuml;berhaupt keine Informationspolitik
betreiben wird. Ob davon auch die Mitglieder des Amiga Advisory Councils
betroffen sind, dieses Gremium also &uuml;berhaupt noch eine Existenzgrundlage
besitzt, bleibt abzuwarten.
</P>
<P>
Jim Collas hat w&auml;hrend seiner Amtszeit eine Menge bewegt - es bleibt zu
hoffen, dass die in Fahrt gekommene Produktentwicklung unter der F&uuml;hrung
von Tom Schmidt nicht stehenbleibt. Wir k&ouml;nnen wieder einmal nur abwarten,
was uns die Zukunft bringt. Eines d&uuml;rfen wir Amiga-Anwender aber auf keinen
Fall tun: Die Hoffnung aufgeben.
</P>
<P>
Damit bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Techniknews.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
