<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele4a.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>5.2. Woher bekommt man Spiele ?</H1>
<P>
Ein Thema, das ich in dieser Ausgabe der Mac-Ecke anschneiden m&ouml;chte, ist
meine &Auml;u&szlig;erung vom letzten Mal, man k&ouml;nne alte Mac-Spiele noch bei
&quot;einigen&quot; Mac-H&auml;ndlern zu g&uuml;nstigen Preisen bestellen. Na ja, das h&ouml;rt sich
etwas &uuml;bertrieben an.
</P>
<P>
Der Mangel an entsprechenden Versandh&auml;ndlern hat einen guten Grund, denn
als Spielecomputer war der Macintosh noch nie ber&uuml;hmt. Entsprechend wenig
Anbieter haben im Laufe der Jahre Spiele in ihr Angebot aufgenommen. Das
mag nicht zuletzt durch die hohen Preise begr&uuml;ndet sein, die der Software
dieses Computers seit jeher anlasten. Kosten von 150DM f&uuml;r ein neu
erschienenes Spiel waren fr&uuml;her keine Seltenheit, den Gipfel aber stellte
die unverbindliche Preisempfehlung von 190DM (einhundertneunzig) f&uuml;r
Kings Quest VII in einer Zeitschrift dar. Bei jedem anderen Computer h&auml;tte
ich &uuml;ber diesen augenscheinlichen Druckfehler gelacht - aber beim Mac... ?
</P>
<P>
Auf jeden Fall kann ich drei H&auml;ndler mit gutem Gewissen empfehlen:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Playmax&nbsp;</TD><TD VALIGN="TOP">&quot;www.playmax.de&quot;&nbsp;</TD><TD VALIGN="TOP">Einige Spiele zu g&uuml;nstigen Preisen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Arktis&nbsp;</TD><TD VALIGN="TOP">&quot;www.arktis.de&quot;&nbsp;</TD><TD VALIGN="TOP">Gro&szlig;e Auswahl mit echten Schn&auml;ppchen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gravis&nbsp;</TD><TD VALIGN="TOP">&quot;www.gravis.de&quot;&nbsp;</TD><TD VALIGN="TOP">Gelegentlich gute Angebote&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Allerdings k&ouml;nnte ich mir auch gut vorstellen, dass es noch ein paar kleine
Versandh&auml;ndler gibt, die noch die ein oder andere Rarit&auml;t bereithalten. Man
denke nur daran, das es heute immer noch vereinzelte Versender gibt, die
C64 Spiele im Angebot haben. Sollte einer von euch einen solchen H&auml;ndler,
oder andere Quellen alter Spiele, kennen (gemeint sind nicht Raubkopien),
w&auml;re ich sehr erfreut, davon zu erfahren.
</P>
<P>
Und hier das Angebot des Monats:
</P>
<P>
Wer point&amp;click-Adventure im Stil von Monkey Island mag, und sich schon
immer ge&auml;rgert hat, das LucasArts keine Spiele mehr f&uuml;r den Amiga
ver&ouml;ffentlicht hat, der sollte mal einen Blick auf das LucasArts-Bundle
werfen, das beispielsweise bei Playmax angeboten wird.
</P>
<P>
In diesem Bundle enthalten sind:
</P>
<UL>
<LI> Vollgas  (Full Throttle)
</LI>
<BR><LI> Sam &amp; Max
</LI>
<BR><LI> Day of the Tentacle
</LI>
</UL>
<P>
Alles Spitzenspiele, zwar schon etwas &auml;lter, aber immer noch genauso gut
und witzig wie zum Zeitpunkt ihres Erscheinens. Das ganze kostet, mit f&uuml;nf
anderen Spielen, die man sich aus einer eigenen Liste zusammenstellen kann
(muss), nur 99DM. So ein 6-Produkte-Bundle k&ouml;nnte zum Beispiel folgende
Artikel beinhalten:
</P>
<UL>
<LI> Das Lucas-Arts-Bundle
</LI>
<BR><LI> &quot;4 Mega Games&quot; Superspy, Jewels of the Oracle,
                 Total Distortion, Rave Schuttle
</LI>
<BR><LI> Pirates Gold
</LI>
<BR><LI> Kings Quest VII
</LI>
<BR><LI> The last Express
</LI>
<BR><LI> Ultimate Doom
</LI>
</UL>
<P>
Das sind ganze 9 DM pro Spiel. Wer da nicht zugreift, ist selber schuld...
Und wer die ganze Liste m&ouml;glicher Spiele sehen will, sollte auf der
Playmax-Homepage vorbeischauen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
