<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4a.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Hyperion Software bringt Worms: Armageddon
</LI>
</UL>
<P>
Es ist schon fast ein Standard des Spieleteils: Jeden Monat
als erste Schlagzeile findet man eine Ank&uuml;ndigung von Hyperion
Software! Diesen Monat hat sich die deutsche Firma bestehend
aus so namhaften Personen wie z.B. Thomas und Hans-J&ouml;rg Frieden
das Team 17 Spiel Worms: Armageddon lizensieren lassen.
Erscheinen soll das ganze diesmal nicht nur f&uuml;r Classic Amigas
sondern auch f&uuml;r den AmigaNG. Somit ist es das erste Hyperion
Spiel, welches auch f&uuml;r den AmigaNG erscheint. Die Classic
Amiga Version soll vorerst nur auf Grafikkarten laufen, aber
evtl. unterst&uuml;tzt sie auch AGA.
</P>
<P>
<A HREF="img/WormsArmageddon1.jpg"><IMG SRC="thumb/WormsArmageddon1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/WormsArmageddon2.jpg"><IMG SRC="thumb/WormsArmageddon2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/WormsArmageddon3.jpg"><IMG SRC="thumb/WormsArmageddon3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/WormsArmageddon4.jpg"><IMG SRC="thumb/WormsArmageddon4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Heretic II auch f&uuml;r 68k Amigas?
</LI>
</UL>
<P>
M&ouml;glicherweise wird es von Hyperion Software auch eine 68k
Version von Heretic II geben. Diese w&uuml;rde dann aber auf jeden
Fall eine Warp3D-kompatible Grafikkarte voraussetzen. Momentan
zweifelt Hyperion jedoch noch daran, ob der Software Renderer
auf einem 68k schnell genug sein wird. Also abwarten und
gespannt sein. Erste Prognosen f&uuml;r die Geschwindigkeit von
Heretic II auf PPC Amigas gibt es auch schon: Steffen H&auml;user
glaubt aufgrund der schnellen Geschwindigkeit von Quake II,
welches auf der Heretic II Engine basiert, auf seinem PowerMAC,
dass auch die Amiga PPC-Version sehr schnell laufen wird.
</P>
<UL>
<LI> Titan Software ver&ouml;ffentlicht zuk&uuml;nftige Hyperion Software Titel
</LI>
</UL>
<P>
Titan Software hat die Kooperation mit Hyperion Software
bekanntgegeben. Die ersten zwei Titel, die ver&ouml;ffentlicht
werden, sind Shogo und Heretic II. Sie soll sowohl f&uuml;r Classic-
als auch f&uuml;r NG Amigas erscheinen. Gleichzeitig appellierte
Titan Software an die Amiga Gemeinde, diese Produkte nicht
raubzukopieren.
</P>
<UL>
<LI> Operation Counterstrike abgebrochen
</LI>
</UL>
<P>
Der R&uuml;ckzug des Publishers Sadeness Software hat jetzt auch
BlueBlack Solution dazu veranlasst, ihr Spiel Operation Counterstrike
einzustellen. Operation Counterstrike war wohl eines der
meisterwarteten Amiga Spiele. Angeblich war es auch schon fast
fertig, denn eine Demo sollte diesen Monat erscheinen. Gleichzeitig
k&uuml;ndigte BlueBlack Solution ein neues Spiel namens Siberian
Sun an, welches das beste Amiga Realtime Strategiespiel werden
soll. Siberian Sun w&uuml;rde sehr viel an Operation Counterstrike
anlehnen. Eine Vorschau des Spiels soll auf einer der n&auml;chsten
Amiga Format CD`s ver&ouml;ffentlicht werden.
</P>
<UL>
<LI> Aqua von Emerald Imaging
</LI>
</UL>
<P>
Die Newcomer von Emerald Imaging haben ein neues Adventure aus der
Ego-Sicht a`la Myst angek&uuml;ndigt. Zu den Features z&auml;hlen 256-farbige
hochaufl&ouml;sende Grafiken und Raytracings. Au&szlig;erdem gibt es InGame
Animationen. Die Hardwareanforderungen belaufen sich auf einen Amiga
mit mindestens einem 68030 sowie AGA oder RTG mit 4- 8MB Ram.
</P>
<UL>
<LI> Crystal Software vertreibt Max Rally
</LI>
</UL>
<P>
Crystal Software hat eine Lizenz von Fortress Software erworben,
um Max Rally zu vertreiben, welches schon im Oktober letzten Jahres
ver&ouml;ffentlicht wurde. Max Rally ist ein Draufsicht-Autorennen mit
eher bescheidener Grafik a`la Amiga 500/1MB Ram.
</P>
<UL>
<LI> Zuk&uuml;nftige Foundation Versionen erscheinen bei Epic-Marketing
</LI>
</UL>
<P>
Paul Burkey und Epic Marketing haben ihre Zusammenarbeit bekanntgegeben.
Nachdem Paul Burkey letzten Monat &uuml;berraschend angek&uuml;ndigt hatte,
Foundation nicht weiterzuentwickeln, da der Distributor Sadeness
nicht mehr existiere, beschloss Epic Marketing ihn zu &uuml;berzeugen,
doch noch die vielerwartete PPC Version und die neuen Levels zu
bringen. Diese Aktion ist gegl&uuml;ckt und die n&auml;chste Foundation Version,
ein komplettes Remake, soll etwa Ende dieses Jahres erscheinen.
</P>
<UL>
<LI> Land of Genesis
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Jump`n`Run Fans k&ouml;nnen aufatmen: Nachdem es die letzten Monate&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">an guten Jump`n`Runs geh&ouml;rig mangelte, hat Maurizio Demelli&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Land of Genesis, ein Jump`n`Run Spiel mit Shoot`em`Up Extras,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">angek&uuml;ndigt. &Uuml;ber 3 Jahre soll er an dem Spiel gearbeitet haben,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">was auch die Begeisterung durch die Amiga User auf der World&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">of Amiga zeigte. Land of Genesis ist fast fertig und bietet&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fantastisches: &Uuml;ber 120 Gegner mit &uuml;ber 2000 Animationsframes&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">und ein revolution&auml;res Soundsystem mit digitaler Sprachausgabe,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">CD Musik und Musikwechsel in einzelnen Levels. Erscheinen soll&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">es im Oktober, also sehr bald.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<A HREF="img/Genesis1.jpg"><IMG SRC="thumb/Genesis1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Genesis2.jpg"><IMG SRC="thumb/Genesis2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Genesis3.jpg"><IMG SRC="thumb/Genesis3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Genesis4.jpg"><IMG SRC="thumb/Genesis4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Starfighter ver&ouml;ffentlicht
</LI>
</UL>
<P>
Der Wing Commander Klon Starfighter wurde nun endlich von
Epic Marketing ver&ouml;ffentlicht. Urspr&uuml;nglich war Starfighter
schon f&uuml;r Ende letzten Jahres angek&uuml;ndigt worden. Zum Preis
von umgerechnet etwa 50 DM kann Starfighter bei Epic bezogen
werden. Das Spiel ben&ouml;tigt 4MB Ram.
</P>
<UL>
<LI> Sabrina Offline von Digital Images
</LI>
</UL>
<P>
Digital Images bezeichnete auf der World of Amiga ihr
Spiel als &quot;das beste Spiel aller Zeiten&quot;. Nun, was soll
man dazu sagen? Sabrina Offline soll ein 3D Plattform
Spiel mit Charakteren von Eric W. Schwartz werden. Es
basiert auf dessen Comic Sabrina Online. Es soll ein
komplett neuartiges Spiel werden, was in solcher Form
noch nie dagewesen ist. Au&szlig;erdem trifft man im Spiel
alle bekannten Charakteren von Eric Schwartz wieder, wie
z.B. Sabrina, Amy, Thomas usw. Erscheinen soll das
ganze nur f&uuml;r den AmigaNG.
</P>
<UL>
<LI> Edict 2999 von Amiga Farm
</LI>
</UL>
<P>
Ein neues Weltraumkampfspiel namens Edict 2999 wurde
von Entwicklern, die sich seltsamerweise Amiga Farm
nennen, angek&uuml;ndigt. Viel wurde noch nicht bekanntgegeben,
aber zwei interessante Features sind schon bekannt:
Zum einen soll es einen zwei Bildschirmmodus geben,
der f&uuml;r Grafikkarten Benutzer interessant sein d&uuml;rfte.
Der Action Bildschirm wird dabei &uuml;ber die Grafikkarte
laufen und der Bildschirm mit den Statistiken &uuml;ber
den AGA Chipsatz. Au&szlig;erdem soll es eine Form von 'richtig
intelligenten Gegnern' geben. Man darf gespannt sein.
</P>
<UL>
<LI> Neues von Delsyd Software
</LI>
</UL>
<P>
Nachdem es die letzten Monate sehr still um Delsyd
Software geworden war, hat man sich nun endlich mal
wieder zu Wort gemeldet. Zum einen zieht die Website
der Firma um und zum anderen hat man gleich zwei neue
Spiele angek&uuml;ndigt: Einmal ein Management Spiel namens
Pimpin' ain't easy und dann noch ein Syndicate &auml;hnliches,
namenloses Spiel. Weitere Details wurden noch nicht
ver&ouml;ffentlicht. Au&szlig;erdem gab Delsyd bekannt, dass sie
die Linux Entscheidung von Amiga Inc. voll unterst&uuml;tzen.
</P>
<UL>
<LI> Update zu Moonbases ver&ouml;ffentlicht
</LI>
</UL>
<P>
Auf der Homegrown Software Webseite wurde ein Update
f&uuml;r Moonbases ver&ouml;ffentlicht, welches einige Probleme
bei der Steuerung behebt.
</P>
<UL>
<LI> Prelusion Software sucht Beta-Tester
</LI>
</UL>
<P>
F&uuml;r die PC-Version von Gilbert Goodmate and the Mushroom
Experience sucht Prelusion Software noch Beta Tester.
Interessierte findet auf <A HREF="http://www.prelusion.com" TARGET="_TOP">http://www.prelusion.com</A> weiter
Infos.
</P>
<UL>
<LI> Unique ben&ouml;tigt immer noch Hilfe
</LI>
</UL>
<P>
F&uuml;r ihr Spiel ACSYS ben&ouml;tigt Unique Software immer
noch einen talentierten Musiker sowie 2D/3D Grafiker.
Meldet euch bei Unique &lt;<A HREF="mailto:christian.sobotta@rz.tu-ilmenau.de">christian.sobotta@rz.tu-ilmenau.de</A>&gt;!
</P>
<UL>
<LI> Tales of Heaven Release steht kurz bevor
</LI>
</UL>
<P>
Der SuperMario64 Klon f&uuml;r Classic-Amigas Tales of Heaven
stehr kurz vor der Ver&ouml;ffentlichung. Das endg&uuml;ltige Spiel
soll in diesem Monat ver&ouml;ffentlicht werden. Auch wird diese
Version Grafikkarten unterst&uuml;tzen.
</P>
<UL>
<LI> Lambda News
</LI>
</UL>
<P>
Seit langem gibt es mal wieder was Neues von Lamba zu
berichten: Diesen Monat wurde bekanntgegeben, dass die
Entwicklung des Spiels jetzt komplett auf den PC umgelagert
wurde, aber es trotzdem nur f&uuml;r den Amiga erscheinen soll.
M&ouml;glicherweise soll es aber nur f&uuml;r PPC Amigas mit 3D
Hardware erscheinen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4a.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
