<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Technik & Net NEWS</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses14.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Technik &amp; Net NEWS
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Technik &amp; Net NEWS</H1>
<P>
&raquo;Hallo und willkommen zur ersten Ausgabe der Technik &amp; Net NEWS.
</P>
<P>
Die Themenzusammenstellung f&uuml;r AMIGA aktuell ist nun absolutes Neuland f&uuml;r
mich und die Septemberausgabe so etwas wie ein Versuchsballon. Das m&ouml;gliche
Problemchen hab ich ja schon im Vorwort angesprochen.
</P>
<P>
News mit Quellenangabe, Nachdruck gestattet, sonst aus dem Nachrichtenwust
des Internets selbst zusammengestellt.
</P>
<P>
Davon unabh&auml;ngig, eine Anfrage von mir. Leider hatte ich es vers&auml;umt, mich
vorher mit Carsten abzustimmen, ob einer von uns, etwas zu dem Thema
&quot;Markengrabbing&quot; schreibt oder ob es nicht schon ausf&uuml;hrlich in den Amiga
Online- oder Printmedien behandelt wurde.
</P>
<P>
Ich wei&szlig; nicht, ob ich es verst&auml;ndlich darlegen kann, da es recht &quot;seltsam&quot;
ist. Wer aber von der rechtlichen Seite durchblickt, kann auch z.B. die
Abseitsfalle nach zwei Kisten Karlsberg UrPils oder Paulaner verst&auml;ndlich
erkl&auml;ren. Wenn genug Interesse besteht, bitte kurze Mitteilung.
</P>
<P>
Let the show begin :-)
</P>
<HR>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">+++---+++ Meldung des Monats&nbsp;</TD><TD VALIGN="TOP">+++---+++&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Der 24. August stand ganz im Zeichen der RegTP, kurz auch
Regulierungsbeh&ouml;rde f&uuml;r Post und Telekommunikation genannt. Die RegTP
erteilte insgesamt 975 Lizenzen f&uuml;r die WLL - Richtfunktechnik, mit deren
Hilfe Telefonkunden, drahtlos an ein festes Netz angeschlossen werden
k&ouml;nnen, d.h., womit die ber&uuml;hmte &quot;letzte Meile&quot;, von einer Basisstation zu
jedem einzelnen Anschluss, drahtlos &uuml;berbr&uuml;ckt werden soll, ohne von der
Telekom die Leitungen zu mieten oder selbst teure Ortsnetzte zu verlegen
und zu unterhalten.
</P>
<P>
Insgesamt waren bundesweit 262 Versorgungsbereichen und 662
Frequenznutzungen f&uuml;r die drahtlose Teilnehmeranschlussleitung
ausgeschrieben worden. Es hatten sich 32 Unternehmen mit 1450
Einzelbewerbungen um die Richtfunkfrequenz bem&uuml;ht. Zw&ouml;lf Firmen bekamen
insgesamt 975 Lizenzen f&uuml;r ein bis 193 Versorgungsbereiche. Das Prinzip der
Bereiche l&auml;sst sich sehr schnell mit der Einteilung eines Landes in
Wahlbezirke o.&auml;. erkl&auml;ren. Vier der Bewerber hatten ein bundesweite Netz
mit allen 262 m&ouml;glichen Bereichen angeboten, womit aber keiner zum Zug kam.
Trotzdem gibt es, nicht zuletzt durch das lange und sorgf&auml;ltige
Auswahlverfahren, (angeblich hatten alle eingereichten Antr&auml;ge ein Gewicht
von knapp 22 Tonnen!)  keine Region in Deutschland ohne Frequenzzuteilung
und damit auch keine wei&szlig;en Flecke auf der Landkarte. Zudem wurden bereits
vorher 17 Frequenzen im Antragsverfahren vergeben, f&uuml;r die es keine
Mitbewerber gab.
</P>
<P>
Die Bewerbungen wurden nach den Kriterien Fachkunde, Leistungsf&auml;higkeit,
Versorgungsgrad, technische Planung und gesch&auml;ftliche Planung ausgewertet,
aus denen sich ein Ranking ergab. Waren zwei Unternehmen gleichwertig,
bekam der Bewerber den Zuschlag, der in anderen Versorgungsbereichen einen
h&ouml;heren r&auml;umlichen Versorgungsgrad sicherstellt.
</P>
<P>
Der Pr&auml;sident der RegTP, Klaus D. Scheuerle rechnet mit einem
Investitionsaufwand der gro&szlig;en Anbieter mit 500 Millionen bis einer
Milliarde DM. Spekulationen mit den Lizenzen sei ausgeschlossen. Sie
m&uuml;ssten entweder vom Bewerber selbst genutzt oder an die Beh&ouml;rde
zur&uuml;ckgegeben werden. Auch d&uuml;rfen sie nicht &quot;gehortet&quot; werden. Wenn sie
nicht in angemessener Zeit genutzt w&uuml;rden, dann werden sie von der Beh&ouml;rde
wieder eingezogen.
</P>
<P>
Wer nun meint, es ginge dabei nicht so sehr um die Ballungsr&auml;ume, da sich
hier ein eigenes Festnetz eher rechnet, der irrt gewaltig. Gerade diese
wurden stak umworben. Berlin, Dortmund, D&uuml;sseldorf, Frankfurt, Hannover,
K&ouml;ln, M&uuml;nchen und Stuttgart hatten jeweils 13 Interessenten!.
</P>
<P>
Hier liegt aber auch die Krux des ganzen. (Nein nicht Rux, gibt es den
&uuml;berhaupt noch?). Wer nun glaubt, die in dem Zusammenhang gemachten
Schlagworte wie &quot;Mehr Wettbewerb im Ortsnetz&quot; oder &quot;Sinkende Preise nun
auch im Ortnetz&quot;, werden bald Realit&auml;t, der sollte mal etwas warten mit
seiner &quot;Hassbrief-Totalk&uuml;ndigung&quot; bei der Telekom. &Auml;hnlich wie bei ASDL der
T-Kom, wird es auch zu Begin beim Funknetz, noch ein extravagantes
Vergn&uuml;gen sein. Obwohl bereits im Prinzip seit Jahren die Sende- und
Empfangstechnik gleich von mehreren Anbieter zur Verf&uuml;gung steht, muss die
Infrastruktur f&uuml;r dieses Netz auch erst mal finanziert und aufgebaut sein.
Die Endger&auml;te m&uuml;ssen zur Verf&uuml;gung und an den Endverbraucher gebracht sein.
Zielgruppen werden zu Begin kleine und mittlere Unternehmen sein, wie auch
Vielsurfer, die sich auch ADSL leisten k&ouml;nnen, oder leisten d&uuml;rfen.
</P>
<P>
Am besten hat es meiner Meinung nach der Vorsitzende des Verbandes f&uuml;r Post
und Telekommunikation (DVPT) Wilhelm H&uuml;bner, in einem Interview gegen&uuml;ber
dpa erkl&auml;rt:
</P>
<P>
&quot;Die Vergabe von Richtfunkfrequenzen f&uuml;r den drahtlosen Telefonanschluss
bringt keinen wirklichen Wettbewerb im Ortsnetz.&quot; Die Bedeutung der
Lizenzen werde &uuml;bersch&auml;tzt. F&uuml;r private Kunden h&auml;tten sie keine
Auswirkungen. Wegen der sehr hohen Investitionen in die Richtfunktechnik
sind private Kunden nicht die Zielgruppe der Lizenznehmer, Vielmehr
konzentrierten sich die Telefonfirmen auf Industriegebiete mit
Gesch&auml;ftskunden. Der Wettbewerb im Ortsnetz wird deshalb nicht gef&ouml;rdert.
Nach wie vor sei es notwendig, den Mietpreis zu senken, den Telekom-
Konkurrenten f&uuml;r die &Uuml;berlassung der Anschlussleitung zum Kunden zahlen
m&uuml;ssen. Nach einer Entscheidung der Regulierungsbeh&ouml;rde in Bonn m&uuml;ssen die
Telefonfirmen daf&uuml;r 25,40 Mark plus Mehrwertsteuer zahlen. Der DPVT
fordert, dass der monatliche Mietpreis unter der Telekom-Grundgeb&uuml;hr von
21,39 Mark plus Mehrwertsteuer liegen m&uuml;sse. Bis auf weiteres findet kein
echter Wettbewerb im Ortsnetz statt. Dabei seien von 100 Telefongespr&auml;chen
60 Orts- und weitere 20 Nahbereichsgespr&auml;che.
</P>
<P>
Ende dieser Meinung. Was dabei rauskommt, wer von den Anbietern das beste
Angebot macht ohne dabei auf der Strecke zu bleiben, wird die Zeit zeigen.
</P>
<P>
===========================0
</P>
<P>
1) Freuet euch ihr Musikfans.
</P>
<P>
Seit dem 31. August steht die neue Maxi von Sabrina Setlur in den L&auml;den!
Die Maxi enth&auml;lt neben vier Remixen von &quot;Ich leb f&uuml;r Dich&quot; und
dazugeh&ouml;rigen Instrumentals auch das Video als CD Extra Track.
Klar, das hat nix mit Amiga oder Internet zu tun, ich mag sie eben!
</P>
<P>
===========================0
</P>
<P>
2) Folgende drei Artikel &uuml;bernehme ich fast originalgetreu da sie sehr
neutral geschrieben sind, um in erster Linie m&ouml;gliche Zukunftspl&auml;ne von
Amiga Inc zu umreissen:
</P>
<P>
Eine Meldung, auf die sich daher wohl auch Euer Pr&auml;sident gefreut hat...
</P>
<P>
Bluetooth Spezifikation ver&ouml;ffentlicht
</P>
<P>
Die Bluetooth Special Interest Group, ein Zusammenschluss von Ericsson,
IBM, Intel, Nokia und Toshiba f&uuml;r drahtlose Kommunikation zwischen
Mobilger&auml;ten, aber auch zwischen Mobilen und Station&auml;ren, ver&ouml;ffentlichte
die Version 1.0 seiner Bluetooth - Spezifikation. Mit der Bluetooth -
Technologie sollen sich mobile PCs und Kommunikationsger&auml;te schnell und
einfach drahtlos miteinander verbinden lassen und Daten bei sehr hohen
&Uuml;bertragungsraten &Uuml;ber das Internet austauschen. Auch die Daten
Synchronisation zwischen Notebooks, Mobiltelefonen und Peripherieger&auml;ten
soll damit erleichtert werden. Es handelt sich dabei um ein Funk-System zum
Austausch von Daten &uuml;ber kurze Distanzen  bis zu zw&ouml;lf Metern, das die
bestehenden Kabel- und infrarot- Verbindungen abl&ouml;sen soll. Erste Ger&auml;te
werden n&auml;chstes Jahr erwartet. Bereits &uuml;ber 850 Firmen haben ihre
Unterst&uuml;tzung zugesagt.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">www.bluetooth.com&nbsp;</TD><TD VALIGN="TOP">Quelle:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.stern.de/" TARGET="_TOP">http://www.stern.de/</A>&nbsp;</TD><TD VALIGN="TOP">Edupage Newsletter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
3) ... denn Jimi will ja ein St&uuml;ck vom Kuchen...
</P>
<P>
Die Zukunft liegt auf der Hand
</P>
<P>
Drahtlose Technologien haben das Zeitalter der Handheld - Ger&auml;te,
handfl&auml;chengro&szlig;er Kleinstcomputer, eingeleitet, und inzwischen wollen sehr
viele Unternehmen sich einen Teil dieses vermutlich explodierenden Marktes
sichern. Die Verkaufszahlen f&uuml;r Handhelds, 1998 waren es 3,9 Millionen
verkaufte Einheiten, werden wohl mit jedem Jahr weiter steigen und
wom&ouml;glich 2002 die PC-Verkaufszahlen &uuml;berholen. Obwohl allgemein erwartet
wird, dass sich die drahtlose Internet-Nutzung zur beliebtesten Funktion
der Handheld-Ger&auml;te entwickeln wird, m&uuml;ssen zun&auml;chst einmal erschwingliche
Zugangsm&ouml;glichkeiten angeboten werden. Zu den g&uuml;nstigsten Angeboten geh&ouml;rt
zur Zeit der sogenannte &quot;clipping service,&quot; der Palm VII-Nutzern in den
Vereinigten Staaten f&uuml;r umgerechnet 18 DM bis 45 DM angeboten wird. Der
Dienst bietet zwar keinen uneingeschr&auml;nkten Internet-Zugang, erlaubt seinen
Nutzern aber den Zugriff auf bestimmte Internet-Informationen, zum Beispiel
Aktienkurse. 3Com plant eine Ausweitung seines Internet-Zugangsangebots
durch einen neuen Gesch&auml;ftsbereich mit der Bezeichnung OpenSky, der einen
erschwinglichen Zugriff auf Email und &quot;Clipping&quot; - Dienste verspricht.
Unterdessen haben Microsoft und Qualcomm gemeinsam &quot;Wireless Knowledge&quot;
entwickelt, eine Technologie, bei der Handheld-, Notebook- und
Smart-Phone-Daten mit Hilfe eines Microsoft Exchange Servers miteinander
synchronisiert werden k&ouml;nnen. Zu den weiteren Entwicklungen im Bereich der
Internet-Dienste geh&ouml;ren ProxiNets Dienst ProxiWeb, der den Internet-Zugang
&uuml;ber Proxy-Server bietet, und Oracles &quot;Projekt Panama,&quot; bei dem HTML- und
XML-Formate f&uuml;r Handhelds aufbereitet werden.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Quelle:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.stern.de/" TARGET="_TOP">http://www.stern.de/</A>&nbsp;</TD><TD VALIGN="TOP">Edupage Newsletter&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
4) ... und mit etwas Phantasie wird der Markt noch gr&ouml;&szlig;er!
</P>
<P>
Handhelds boomen in Europa
Auch WAP-Handies wird gro&szlig;er Erfolg vorausgesagt
</P>
<P>
Nach einer Untersuchung von International Data Corp. (IDC) befindet sich
der Markt der Taschencomputer in Europa in einer rasanten Wachstums-Phase.
In Westeuropa sind 1998 1,4 Millionen Handhelds im Wert von einer Milliarde
US-Dollar verkauft worden.
</P>
<P>
Unangefochtener Spitzenreiter sind die PalmOS- basierten Ger&auml;te. Den
WindowsCE- Ger&auml;ten mit Farbdisplay sagt man aber einen starken Zuwachs
voraus. Entt&auml;uschend seien hingegen die bisherigen Verkaufszahlen bei den
Smart-Phones in Europa. Diese Handies mit Computer- und
Internet-Funktionalit&auml;t basieren auf dem Wireless Application Protocol
(WAP). Das liegt aber wohl haupts&auml;chlich am Mangel an verf&uuml;gbaren
Produkten. IDC rechnet hier im n&auml;chsten Jahr mit stark steigenden
Verk&auml;ufen, wenn die wichtigsten Anbieter wie Nokia und Ericsson den Markt
mit ihren neuen Ger&auml;ten in gro&szlig;en St&uuml;ckzahlen bedienen k&ouml;nnen. Die
skandinavischen Branchenriesen werden ihre Handies mit dem
Kleinger&auml;te-Betriebssystem Epoc32 ausstatten.
</P>
<P>
Durch den Hype den WAB durch die IFA erlebt, wird evtl. in der n&auml;chsten
Ausgabe ein Special dar&uuml;ber folgen.
</P>
<P>
===========================0
</P>
<P>
5) AMIGA gibt Zusammenarbeit mit Corel Corporation bekannt (22.07.99)....
</P>
<P>
... war am 22. Juli die Schlagzeile der Amiga Community. Interessant, da
sie nur wenige Tage nach dem Collaschen Technologie Brief ver&ouml;ffentlicht
wurde. Nun wissen wir zwar mittlerweile, dass man eine Linux - Distribution
nicht gleichsetzen kann mit DEM Linux - Kernel, zumal gerade dieser, einer
bestimmten Konvention unterworfen ist, die Linus Torvald hei&szlig;t. Aber, lange
Rede, gar kein Sinn: Bahnt sich da was an?
</P>
<P>
Linux vom Grafikspezialisten
</P>
<P>
Corel stellte seine Linux Distribution Corel LINUX erstmals der
&Ouml;ffentlichkeit vor.
</P>
<P>
Auf der LinuxWorld in San Jose zeigte Corel zum ersten Mal &ouml;ffentlich seine
neue Linux Distribution, das Betriebssystem Corel Linux. Diese Distribution
soll sich schnell und einfach installieren lassen, denn sie basiert auf der
Debian/GNU-Distribution mit der K-Desktop-Umgebung. Wobei die grafische
Oberfl&auml;che nochmals verbessert und die Installationsroutine wesentlich
vereinfacht worden sein sollen. Laut Corel werden erste Betaversionen von
Corel LINUX im September diesen Jahres verf&uuml;gbar sein, erste Vollversionen
noch bis zum Jahresende.
</P>
<P>
Das Corel LINUX enth&auml;lt diverse neuartige Funktionen: So soll der Vorgang
der Netzwerkkonfiguration dem unter Windows &uuml;blichen Ablauf &auml;hneln. Der
Datei-Manager soll einen integrierten Internet-Browser enthalten und
FTP-Unterst&uuml;tzung, sowie den Zugriff auf lokale und Netzwerklaufwerke
bieten. Dazu gibt's eine Online-Aktualisierung mit automatischer
Installation der aktuellsten Linux Dateien und -Patches.
</P>
<P>
Corel LINUX wird sowohl als Einzelprodukt, als auch im Bundle erh&auml;ltlich
sein - inklusive der WordPerfect Office-Suit f&uuml;r Linux. Letzteres wird aber
voraussichtlich erst Anfang n&auml;chsten Jahres verf&uuml;gbar sein. Die Preise der
Versionen will Corel sp&auml;ter bekannt geben.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP"><A HREF="http://www.corel.com" TARGET="_TOP">http://www.corel.com</A>&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://linux.corel.com" TARGET="_TOP">http://linux.corel.com</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
===========================0
</P>
<P>
6)  Folgende Meldung, von <A HREF="http://www.heise.de" TARGET="_TOP">http://www.heise.de</A>, soll nicht so sehr ein
bestimmte Feindbild pflegen, sondern vielmehr die Problematik der Browser
Entwicklung deutlich machen, wie sie momentan speziell die Entwickler der
Netscape Navigator Umsetzung, aMozillaX, mit voller Wucht zu sp&uuml;ren
bekommen. Das gilt nat&uuml;rlich auch f&uuml;r andere Entwickler. Leider bin ich da
nicht auf dem laufenden, was Amiga betrifft.
</P>
<P>
Web Standards Project - Offener Brief an Microsoft
</P>
<P>
Das &quot;Web Standards Project&quot;, ein Zusammenschluss aus  Web-Seiten
Entwicklern, hat sich jetzt in einem offenen Brief
an Microsoft gewandt und fordert, den Internet Explorer endlich komplett zu
Standards kompatibel zu machen. Die Mitglieder des seit letztem Jahr
existierenden Projekts bem&auml;ngeln Microsofts teils nur sehr halbherzige
Umsetzung der W3C Standards und verlangen eine 100%ige Unterst&uuml;tzung von
Cascading Style Sheets Level-1, HTML 4.0, DOM 1.0 und XML 1.0 in der
n&auml;chsten Version des Internet Explorer.
</P>
<P>
Hintergrund der Aktion ist eine steigende Unzufriedenheit von
Web-Entwicklern, die auf bestimmte W3C Standards ganz verzichten m&uuml;ssen,
weil diese in Browsern zu unterschiedlich, halbherzig oder gar nicht
implementiert wurden. Die Web-Entwickler f&uuml;rchten nun, dass sich das Web,
aufgrund der vielen Propriet&auml;ren Pseudo-Standards, mit der viele Browser-
Hersteller bisher ihre Kunden an sich binden wollen, in technischer
Hinsicht wesentlich langsamer entwickelt, als m&ouml;glich w&auml;re.
</P>
<P>
Zwar ist im Internet Explorer, laut dem Web Standards Project, die
derzeitige Unterst&uuml;tzung der W3C Standards wesentlich besser als die von
Netscape, doch w&uuml;rde sich das mit der n&auml;chsten Netscape Navigator Version
&auml;ndern, die zu 100% kompatibel zu den vom W3C abgesegneten Web-Standards
sein soll. Microsoft w&uuml;rde dann zum Schlusslicht, was  Kompatibilit&auml;t
angeht.
</P>
<HR>
<P>
Dazu kommt dann noch, dass st&auml;ndig neues Zeug auf die Anwender losgelassen
wird, das alles sch&ouml;ner und schneller machen soll und irgendwie doch nur
Bandbreite vernichtet. Beste Beispiele sind zwei neue &quot;Standards&quot; des
Internets.
</P>
<P>
Zum einen VoiceXML, f&uuml;r das diesen Monat die vorl&auml;ufige Spezifikationen
verabschiedet wurden. Die &quot;Voice eXtensible Markup Language&quot;, soll in
erster Linie die Sprach&uuml;bertragung im WWW und damit den Ausbau des Internet
zu einem &uuml;bergreifenden Medium f&ouml;rdern. VoiceXML, ist eine
Weiterentwicklung der Speech-Markup-Language, die IBM, in das  &quot;Voice
eXtensible Markup Language&quot;-Forum eingebracht hat, zu dem einige wichtige
Mitglieder und &quot;Macher&quot; der Internet Welt geh&ouml;ren.
</P>
<P>
Auch ist die XHTML-Standardisierung in greifbare N&auml;he ger&uuml;ckt. Die XHTML
setzt sich aus Bestandteilen des momentanen HTML-Standards und der
Extensible Markup Langugage (XML) zusammen. Sie soll Web-Designern
zus&auml;tzliche Flexibilit&auml;t bei der Erfassung, Sortierung und Darstellung von
datenbank&auml;hnlichen Informationen bieten und  f&uuml;r die verbesserte
Darstellung von Informationen auf Handheld -Computern sorgen. &Uuml;ber die
Einf&uuml;hrung  soll am 22. September 1999 entschieden werden.
</P>
<P>
===========================0
</P>
<P>
7) Preiskampf, Preissturz, Preisspirale
</P>
<P>
Nach &uuml;bereinstimmender Meinung einiger Newsdienste, steht uns in der
n&auml;chsten Zeit ein drastischer Preisanstieg bei DRAM Speicherchips bevor.
Mit DRAM werden nicht etwas spezielle Speicherarten, wie SIMM oder SDRAM
bezeichnet, sondern die Chip´s an sich, die sich AUF den Modulen befinden.
Also so etwas wie system&uuml;bergreifend und daher betrifft es (fast) jeden.
Grund ist diesmal nicht etwa irgendwelche W&auml;hrungsturbulenzen, sondern der
endg&uuml;ltig durchschlagende Effekt des Abbaus der Herstellungskapazit&auml;ten bei
den Hersteller, verbunden mit einem Anstieg der PC Nachfrage nach dem
Sommer. Dabei muss man wissen, dass es in den USA, wo sich immer noch der
wichtigste Markt befindet, es im Jahr zwei Nachfragespitzen gibt. Einmal
logischerweise das Weihnachtsgesch&auml;ft und dann die Zeit nach den gro&szlig;en
Ferien, beim Schulanfang. Eine Tendenz, die sich von Jahr zu Jahr verst&auml;rkt
und nat&uuml;rlich auch immer mehr auf andere L&auml;nder &uuml;bergreift.
</P>
<P>
Demgegen&uuml;ber geht der Preiskampf der Festplattenhersteller munter weiter.
Mit Ausnahme von Quantum. Jedenfalls solange, bis der verantwortliche CEO
abgesetzt wird. Mike Brown, CEO von Quantum bittet die Mitbewerber den
verr&uuml;ckten Preiskrieg zu beenden, der die Industrie in den letzten Monaten
mehr denn je qu&auml;lt. &quot;Die Festplattenindustrie zerst&ouml;rt sich selber. Die
Unternehmen senken die Preise bis zur Selbstkostengrenze oder tiefer, nur
um Marktanteile zu ergattern. Das ist untragbar: Wir k&ouml;nnen doch solange
nicht weitermachen, bis alle nur noch Geld verlieren&quot;.
</P>
<P>
Deutlich wird das ganze Elend, betrachtet man sich die Quartalsberichte
oder die Kursverl&auml;ufe der Aktien der jeweiligen Hersteller die den
Grossteil ihres Umsatzes mit Speichermedien erzielen, wie Maxtor, Seagate,
Western Digital oder Quantum. Weniger zu heulen haben da z.B. IBM und
Fujitsu. Aber auch mit Iomega geht es immer mehr in den Keller, w&auml;hrend es
SyQuest bekannterma&szlig;en schon hinter sich hat. Auch Micropolis war noch warm
als der Sand auf sie fiel und Conner wie auch DEC wurden ein Fressen f&uuml;r
die Geier.
</P>
<P>
Derzeit geht es einfach darum, wer am preisg&uuml;nstigsten liefern kann und da
hat Seagate die Nase vorne. Dass dann wie die Tage beschlossen, 1600 der
60000 von Seagate im asiatischen Raum besch&auml;ftigten Mitarbeiter entlassen
werden, oder Western Digital mal eben 2500 freistellt, ... was soll's,
Hauptsache Alternate oder itMedia haben geile Preise.... .
</P>
<P>
===========================0
</P>
<P>
8) Brenne liebe CD, brenne schnell...
</P>
<P>
Erster 12-fach CD-Brenner angek&uuml;ndigt
</P>
<P>
Der US-Hersteller Smart and Friendly hat jetzt das erste CD-RW  Laufwerk
vorgestellt, das CD-Rohlinge in 12-facher
Geschwindigkeit beschreiben und in 4-facher Geschwindigkeit
wiederbeschreiben (ReWrite) kann. Der &quot;CD Rocket Mach 12&quot;  genannte Brenner
kann zudem CDs in 32-facher Geschwindigkeit auslesen und wird unter anderem
mit
Adaptecs Easy CD Creator 4 Deluxe Software ausgeliefert. Dank der hohen
Schreibgeschwindigkeit soll dabei eine 650
MByte CD in knapp 6 Minuten beschrieben werden k&ouml;nnen.
</P>
<P>
Das CD Rocket Mach 12 Laufwerk f&uuml;r den Anschluss an Ultra SCSI Controller
soll im September in zwei Versionen auf den Markt kommen: Eine interne
Version mit der Produktnummer SAF1200 f&uuml;r 399 US-Dollar und eine externe
Version mit der Produktnummer SAF1201 f&uuml;r 499 US-Dollar. F&uuml;r eine leichte
Integration in bestehende Windows 95/98 bzw. Windows NT Rechner sind
jeweils Ultra SCSI Plug-and-Play PCI Hostadapter inkl. Treiber und Kabel
beigelegt.
</P>
<P>
Deutsche Preise und beiliegende Software sind noch nicht bekannt.
</P>
<P>
===========================0
</P>
<P>
9) Nun noch zwei Meldungen oder Tendenzen, wie man will, die das Internet
betreffen ohne in Wirklichkeit viel damit zu tun zu haben. Das Web wird nur
als S&uuml;ndenbock vorgeschoben, sei es um von den wirklichen Problemen und
URSACHEN abzulenken, oder schlicht aus Unwissenheit, Verbohrtheit oder
Dummheit.
</P>
<P>
Diese Meldung wurde aus dem Newsletter des hervorragenden Internet Dienstes
der AME Aigner Media &amp; Entertainment [r] - <A HREF="http://ame.de" TARGET="_TOP">http://ame.de</A> &lt;-
&uuml;bernommen.  Es ist kaum besser zu beschreiben! Wer von den Lesern
amerikanische Bekannte hat, die einem mit dem Somm-Urteil nerven, der hat
hier etwas zum zur&uuml;ckschlagen.
</P>
<P>
ENTWURF - DIESEN GESETZENTWURF KANN MAN IN DER PFEIFE RAUCHEN
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Bei etlichen Seiten w&uuml;rde es sich lohnen, ernsthaft dar&uuml;ber&nbsp;</TD><TD VALIGN="TOP">nachzudenken,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">sie zu schlie&szlig;en. Seien es Anleitungen zum Bombenbau oder&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">kinderpornographische Seiten.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Doch statt dessen k&uuml;mmern sich die US-Senatoren Orrin Hatch und Diane
Feinstein (66) um Seiten, die Links zu Seiten mit &quot;s&uuml;chtig machendem
Inhalt&quot; - sprich Drogen - beinhalten. Der &quot;Methamphetamine
Anti-Proliferation-Act&quot; der beiden Senatoren soll solche Links nun unter
Strafe stellen.
</P>
<P>
Schon der Verweis auf entsprechende Seiten soll mit einer hohen Geldbusse
oder bis zu drei Jahren Haft, in manchen F&auml;llen bis zu zehn Jahren,
bestraft werden. Unter das angestrebte Gesetz fielen dann auch Seiten bzw.
die dazugeh&ouml;rigen Links, auf denen Marihuana-Raucher Tipps zum Zubeh&ouml;r
(Pfeifen, etc.) finden oder dieses gleich kaufen k&ouml;nnen.
</P>
<P>
Selbst Journalisten sind von dieser Regelung nicht ausgenommen. Auch dann
nicht, wenn sie lediglich &uuml;ber das Thema Drogen berichten und auf
entsprechende Seiten im Netz verweisen. Kiffermagazine wie &quot;High Times&quot;
oder der einschl&auml;gige Suchindex &quot;Yahooka&quot; w&auml;ren ebenso betroffen.
</P>
<P>
Ob die Senatoren mit ihrem Vorschlag erfolgreich sein werden, bezweifeln
viele. Hardliner hatten in der US-Drogenpolitik bislang nur selten die
Mehrheit hinter sich. Etliche sehen darin auch einen Angriff auf die
Pressefreiheit. Und f&uuml;r andere ist der Vorsto&szlig; der Senatoren nur der
Ausdruck von Hilflosigkeit: Die Politik wisse einfach nicht, wie sie mit
den kaum zu zensierenden Informationen im Web umgehen soll.
</P>
<P>
Wenn es nach Hatch und Feinstein ginge, w&auml;ren also auch diese Links zum
&quot;Reinschnuppern&quot; schon strafbar:
</P>
<P>
++ Der Gesetzesentwurf:
</P>
<UL>
<LI> <A HREF="http://www.senate.gov/~feinstein/releases/meth99.html" TARGET="_TOP">http://www.senate.gov/~feinstein/releases/meth99.html</A>
</LI>
<BR><LI> <A HREF="http://thomas.loc.gov/cgi-bin/bdquery/z?d106:s.01428:" TARGET="_TOP">http://thomas.loc.gov/cgi-bin/bdquery/z?d106:s.01428:</A>
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD COLSPAN="0"><HR></TD></TR>
<TR></TR>
</TABLE>
<P>
Drogen? Fragt sich dann nur, ob Phillip Morris, BAT oder Budweiser oder all
DIE Anderen demn&auml;chst ihre Web-Pr&auml;senz beenden m&uuml;ssen, da die dann niemand
mehr braucht!
</P>
<P>
===========================0
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">10)&nbsp;</TD><TD VALIGN="TOP">Online-Buchversender verkaufen Nazi-Literatur nach Deutschland&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Vor kurzem hat das Simon Wiesenthal Zentrum die deutschen
Strafverfolgungsbeh&ouml;rden darauf hingewiesen, dass die Online-Buchversender
Barnes &amp; Noble und Amazon gegen deutsches Recht versto&szlig;en und
volksverhetzende Literatur auch nach Deutschland liefern. Das Zentrum wirft
den US-amerikanischen Firmen vor, mit dem Versand verbotener Materialien
direkt an deutsche Haushalte&quot; deutsches Recht zu brechen.
</P>
<P>
In Deutschland ist der Vertrieb von B&uuml;chern wie Hitlers &quot;Mein Kampf&quot;
definitiv verboten. Die Buchh&auml;ndler tun dabei  trotzdem nichts Illegales,
denn in den USA d&uuml;rfen diese B&uuml;cher straffrei vertreiben werden. Wie auch
die USA f&uuml;r Deutschland gr&ouml;&szlig;ter Exporteur von Nazi-Propaganda Material ist.
</P>
<P>
Die beiden betroffenen Unternehmen verteidigen ihr Vorgehen:
&quot;Unserer Meinung nach ist unser Verhalten genauso zu bewerten wie das eines
deutschen Urlaubers, der sich in den Vereinigten Staaten aufh&auml;lt und in
einer Buchhandlung die betreffenden B&uuml;cher kauft,&quot; erkl&auml;rte
Amazon-Sprecherin Lizzie Allen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Kaum anders die &Auml;u&szlig;erungen von Bertelsmannn, die 40% der Anteile an Barnes&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&amp; Noble besitzt.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Allen wies darauf hin, dass auf den deutschen Seiten des Unternehmens keine
B&uuml;cher angeboten w&uuml;rden, die in Deutschland verboten seien, denn bestellen
kann man dieses &quot;Material&quot; auch nur &uuml;ber die jeweiligen amerikanischen
Seiten mit der .com Endung.
</P>
<P>
Das deutsche Justizministerium hatte ebenso wie die Bertelsmann AG,
angek&uuml;ndigt, dass die Vorw&uuml;rfe des Simon Wiesenthal Zentrums gepr&uuml;ft
w&uuml;rden.
</P>
<P>
Bisheriges Ende vom Lied ist: Die deutschen Justizministerin Herta
D&auml;ubler-Gmelin, die die Sache auf politischem Weg l&ouml;sen wollte, musste bei
einem Treffen mit ihrer amerikanischen Kollegin Janet Reno feststellen,
dass sie gegen geltendes amerikanisches Recht chancenlos ist, vollmundige
Ank&uuml;ndigung von Bertelsmann-Chef Middelhoff bisher nix wie hei&szlig;e Luft war
und es zeitweise (nach einer Testbestellung von Internet World
Redakteuren) m&ouml;glich war, die Hetzschrift in Deutschland, nach deren
&Uuml;bernahme des Internet-B&uuml;cherantiquariat ZVAB, &uuml;ber buecher.de, zu
bestellen.
</P>
<P>
Dabei wird allzuoft verdr&auml;ngt, dass es das Zeug l&auml;ngst in vielen Sprachen
kostenlos und problemlos zu finden und zu saugen in elektronischer Form
gibt. Schon seit Jahren, lange bevor es das Internet gab.
</P>
<P>
Fortsetzung folgt.
</P>
<P>
===========================0
</P>
<P>
Bis zum n&auml;chsten Monat, dann mit etwas mehr Technik.
</P>
<P>
Thomas Hasemann &lt;<A HREF="mailto:1145-87@onlinehome.de">1145-87@onlinehome.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses14.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
