<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort (mit R&uuml;ckblick auf den vergangenen Monat und den Anfang September)</H1>
<P>
+++ JIM COLLAS ALS PR&Auml;SIDENT UND CEO VON AMIGA ZUR&Uuml;CKGETRETEN +++
Nachfolger Tom Schmidt will Zielrichtung des Unternehmens offenbar
beibehalten +++ Grundlegende &Auml;nderung der Informationspolitik angek&uuml;ndigt
</P>
<P>
Soweit die dramatischen Schlagzeilen, die am 1. September bekannt geworden
sind. Bereits wenige Tage zuvor wurde auf der Website von AMIGA die neue -
oder eher: &uuml;berhaupt keine - Informationspolitik - angek&uuml;ndigt. Dass es
sich dabei jedoch um die Entscheidung eines neuen AMIGA-Pr&auml;sidenten handeln
k&ouml;nnte, hat wohl kaum jemand ernsthaft in Erw&auml;gung gezogen.
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Martin Henke, der AMIGA aktuell jeden Monat ins Englische &uuml;bersetzt,
  wendet sich mit einem dringenden Appell an euch:
<P>
  &raquo;------&gt; Help needed &lt;------
</P>
<P>
  Due to the fact that the number of sections is growing the translation of
  Amiga aktuell on time can no longer guaranteed. This is why I, Martin
  Henke (<A HREF="mailto:M.Henke@lycosmail.com">M.Henke@lycosmail.com</A>), the translator of Amiga aktuell, am
  looking for help. It would be that way, that the translation of Amiga
  aktuell would be spread to those, who would like to help me. I have some
  programs, helping me with the translation. Of course, you would receive
  those programs (including its BASIC source codes). Please send me an
  eMail, what section you would like to translate.
</P>
<P>
  Yours,
</P>
<P>
  Martin Henke&laquo;
</P>
</LI>
<BR><LI> Und wieder gibt es zwei neue Rubriken in AMIGA aktuell: Der 'Blick in die
  Zukunft' besch&auml;ftigt sich mit der Technologie des AmigaNG und dem
  &Uuml;bergang von den Classic-Rechnern zum Amiga der n&auml;chsten Generation; die
  Technik &amp; Net NEWS beschr&auml;nken sich nicht auf den Amiga-Markt, sondern
  umfassen den gesamten Computer- und Informationsbereich. Um beide
  Rubriken k&uuml;mmert sich Thomas Hasemann, der einigen von euch vielleicht
  noch aus seiner Amiga-Zeit bekannt ist. Nun ja, vielleicht wird er ja
  bald wieder zu einem Amiga-User werden, wer wei&szlig;...
</LI>
<BR><LI> Damit die Anzahl der Rubriken nicht zu gro&szlig; wird, haben wir
  &quot;Softwareupdates&quot;, &quot;Kurzmeldungen&quot; und &quot;Ger&uuml;chtek&uuml;che&quot; in
  &quot;Diverse Amiga-News&quot; (ehemals &quot;Diverse Neuigkeiten&quot;) integriert.
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge. Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests
  kommerzieller Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener
  FD-Software. Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
