<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf</H1>
<P>
Das Wort &quot;Innovation&quot; ist sehr schick. Viele Firmen schm&uuml;cken ihre neuen
Produkte mit diesem Pr&auml;dikat und werden nicht M&uuml;de, dem potentiellen Kunden
einzubl&auml;uen, wie dumm und kurzsichtig er (der Kunde) doch w&auml;re, wenn er
sicht nicht f&uuml;r das gepriesene Produkt entscheiden w&uuml;rde.
</P>
<P>
Dieser Kampf steht dem Amiga-User noch bevor. Amiga hat die Schotten dicht
gemacht und wird aus Furcht vor der gr&ouml;&szlig;er werdenden Konkurrenz vorerst
keine Executive Updates mehr ver&ouml;ffentlichen.
</P>
<P>
Wird da jemand flatterig? Nun, zu verdenken ist die Angst den Amiga-Oberen
nicht. Wer offenen Auges die Presse der letzten Wochen verfolgt hat und
&uuml;ber den Tellerrand hinaus blickt wird erkennen, dass Amiga nicht der
einzige Wegbereiter der Multimedialen Zukunft ist.
</P>
<P>
Die Ifa in Berlin zeigt, welche Masse an multimedialen Ger&auml;ten in den
n&auml;chsten Monaten auf uns zu rollt. Jeder Hersteller verspricht ungeahnte
M&ouml;glichkeiten mit dem Medium Internet ... Fernsehen, Rundfunk und der
klassische Einkauf sind nur die neuen Schlagw&ouml;rter.
</P>
<P>
Die Frage die sich jedoch breit macht ist folgende:
Welche Anwendungsbereiche, au&szlig;er den achso hochgelobten
&quot;Netzwerkeigenschaften&quot; und &quot;bahnbrechenden Grafikl&ouml;sungen&quot;, soll der
k&uuml;nftige Amiga-User durch die Wundermaschine denn abdecken k&ouml;nnen? Die
Anwendungsbereiche f&uuml;r Computer haben sich in den letzten Jahren extrem
ver&auml;ndert. Nicht mehr nur Freaks sitzen vor der Kiste sondern auch
Pseudo-Computer-Profis (&quot;Um ein neues Dokument zu &ouml;ffnen mu&szlig;t du auf -Neu-
klicken...&quot;).
</P>
<P>
Als langj&auml;hrigem Freak bleibt da die Wehmut &uuml;ber vergangene Tage.
Vielleicht sollte langsam die Diskussion dar&uuml;ber anfangen, welche
besonderen Profile, welches Image sich die Community in der n&auml;chsten Zeit
zulegen soll.
</P>
<P>
Jesco v. Puttkamer (NASA-Mitarbeiter; ist u.a. mitverantwortlich f&uuml;r den
Bau der Raumstation ISS und geplanter Marsfl&uuml;ge) sagte k&uuml;rzlich in einem
Interview, da&szlig; die Gesellschaft eine Vision f&uuml;r die Raumfahrt braucht. Nur
so kann die Jugend eine Perspektive gewinnen und mit dem Ziel vor Augen in
die Zukunft starten.
</P>
<P>
Vielleicht wird es auch im Computersektor Zeit, Ziele f&uuml;r die Zukunft
abzustecken. Nur so kann sich ein Produkt und die dazugeh&ouml;rige Community
weiterentwickeln; der Hinweis aufs Internet erscheint jedenfalls mir zu
flach...
</P>
<P>
Lebt lang und erfolgreich...
</P>
<P>
Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
