<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Traumf&auml;nger&quot; / Marlo Morgan</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Traumf&auml;nger&quot; / Marlo Morgan</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>
</P><P>
<B>B&uuml;cher online - ein Widerspruch in sich</B>
</P><P>
Was ist das Wichtigste, wenn man in den Urlaub f&auml;hrt? Nat&uuml;rlich: Ein
gutes Buch f&uuml;r die weniger sch&ouml;nen Tage. Und wie findet man ein gutes
Buch?
</P><P>
Der Blick in eine Online-Buchhandlung ist schon mal nicht schlecht. Schon
auf der Einstiegsseite gibt es Empfehlungen f&uuml;r diverse B&uuml;cher, genau wie
die Auslage in einem echten Buchladen. Aber nat&uuml;rlich ist das Angebotene
trotzdem nicht das Richtige, zumal wenn man keine Ahnung hat, was man
eigentlich lesen will.
</P><P>
Also ist das Lesen des Klappentexts schon mal wichtig. Online steht man
da schon auf dem Schlauch, denn nat&uuml;rlich gibt es eine Kurzinfo zum Buch,
aber mal kurz im Buch bl&auml;ttern ist nicht. Und mit den zugegeben sehr
m&auml;chtigen Suchfunktionen findet man entweder viel, gar nichts, oder man
wei&szlig;, was man sucht, damit man es finden kann - und das ist ein
Paradoxon...
</P><P>
So f&uuml;hrte mich der Weg also ganz altmodisch in die leibhaftige
Buchhandlung, wo man das Papier riechen und die Verk&auml;uferin um
fachm&auml;nnischen Rat fragen kann. Der war jedoch gar nicht n&ouml;tig, nach
einer halben Stunde, die mir viel k&uuml;rzer vorkam, hatte ich ein Buch
gefunden, das mich interessierte: Marlo Morgan's &quot;Traumf&auml;nger&quot;.
</P><P>
Hierzu gibt es eine Kurzbeschreibung bei <a href="http://www.amazon.de/">www.amazon.de</a>, die aus dem
Buch &uuml;bernommen wurde:
</P><P>

<hr width=75%>
<i>
</P><P>
Drei Monate verbrachte die amerikanische &Auml;rztin Marlo Morgan in der
australischen Wildnis und begleitete einen kleinen Nomadenstamm auf
seiner abenteuerlichen Wanderung.
</P><P>
&quot;Die Geschichte einer mutigen Frau, die mit den Aborigines wanderte und
die wundervollen Geheimnisse und die Weisheiten eines sehr alten Stammes
erfuhr. Es geht dabei um Dinge, die wir alle in unserer modernen
Gesellschaft lernen m&uuml;ssen: wieder eine Beziehung zur Natur herzustellen,
zu vertrauen und an unser inneres Wissen und unsere eigenen Ziele zu
glauben.&quot;
</P><P>
(Elisabeth K&uuml;bler-Ross.)
</P><P>
<hr width=75%></i>
</P><P>
<B>Zum Inhalt</B>
</P><P>
Die Autorin weist in ihrem Vorwort darauf hin, da&szlig; der Roman eine
Erz&auml;hlung ist, die auf erlebten Fakten basiert, aber auch - zum Schutz
der Aborigines und deren Kultur - viele ver&auml;nderte Details enth&auml;lt. Es
bleibt dem Leser &uuml;berlassen, das Buch als Tatsachenbericht oder
Abenteuerroman zu werten, wichtig seien weniger die harten Fakten, als
deren Aussage und Bedeutung f&uuml;r jeden Einzelnen von uns.
</P><P>
Das Buch handelt von einer sozial engagierten amerikanischen &Auml;rztin,
die die M&ouml;glichkeit erh&auml;lt, einige Zeit in Australien zu lehren und
praktizieren. Sehr bald setzt sie sich f&uuml;r die Mischlinge der Wei&szlig;en und
Eingeborenen ein, die in den Gro&szlig;st&auml;dten ein trostloses Leben in Slums
f&uuml;hren. Dabei liefert sie nicht nur medizinische Unterst&uuml;tzung, sondern
gr&uuml;ndet mit ihnen eine Firma, um auch f&uuml;r ein Selbstwertgef&uuml;hl zu sorgen.
Dies spricht sich schnell herum und sie bekommt eine Einladung - jedoch
nicht zu einem f&ouml;rmlichen Empfang, wie sie anfangs glaubt, sondern zu
einem Walkabout mit einem Stamm urspr&uuml;nglicher Aborigines. Dieses
Walkabout f&uuml;hrt sie einige Monate lang quer durch die australische
W&uuml;ste...
</P><P>
Alles halb so schlimm, mag man meinen, aber so etwas wird nach den Regeln
der Eingeborenen durchgef&uuml;hrt. Zuerst bekommt sie ein einfaches Kleid der
Aborigines, alle anderen Sachen, auch Ausweis, Geld und Schmuck werden
verbrannt. Zu einem Walkabout wird nichts mitgenommen, au&szlig;er sich selbst,
kein Wasser, kein Proviant, alles wird sich auf dem Weg finden.
</P><P>
Im Verlauf schildert das Buch die t&auml;glichen Schwierigkeiten des Lebens in
der W&uuml;ste: verbrannte F&uuml;&szlig;e, Sonnenbrand, Wasser- und Nahrungssuche. Ganz
langsam und kaum merklich wird beschrieben, wie die &Auml;rztin langsam das
Denken der Aborigines begreift und dadurch auch das &Uuml;berleben in der W&uuml;ste
immer leichter wird. Denn die Eingeborenen glauben an eine Vorbestimmung
der Dinge, Wasser findet man nicht, weil man es sucht, sondern weil man
darum bittet, da&szlig; es sich zeigen m&ouml;ge. Genauso f&auml;ngt man keine Schlange
zum Abendessen, weil man schlau oder geschickt genug ist, sondern weil
sich die Schlange dazu bereit erkl&auml;rt hat, das Abendessen zu werden.
</P><P>
<B>Die Botschaft</B>
</P><P>
Die totale Einbindung des Stammes der &quot;Wahren Menschen&quot; in die Natur ist
auch die Botschaft des Romans. Ein Zusammenleben mit der Natur kann nicht
durch einseitiges und verantwortungsloses Nehmen geschehen, sondern es
setzt voraus, mit dem auszukommen, was die Natur freiwillig hergibt. Man
dankt nicht dem J&auml;ger, sondern der Beute, da&szlig; sie der Bestimmung gefolgt
ist, heute die Nahrung f&uuml;r die Gruppe zu sein.
</P><P>
Diese Denkweise ist f&uuml;r uns sehr schwer zu verstehen, deshalb ist es um so
bemerkenswerter, da&szlig; es im Roman in dieser Hinsicht nie eine Unstimmigkeit
oder Ungereimtheit gab. Sehr &uuml;berzeugend ist auch, da&szlig; die Protagonistin am
Ende nicht als eine &quot;perfekte&quot; Aborigine in die Zivilisation zur&uuml;ckkehrt,
sondern als jemand, der beide Welten gesehen und verstanden hat, als
Mittler zwischen den Welten.
</P><P>
Weniger vorstellen kann ich mir allerdings, da&szlig; ein zivilisationsgewohnter
Mensch seelenruhig zuschaut, wie sein Geld, seine Kleidung und pers&ouml;nlichen
Andenken durch wildfremde Menschen verbrannt werden. Da&szlig; dies nach der
Erfahrung eines Walkabouts der Fall sein kann, ist plausibel, aber bereits
davor?
</P><P>
<B>Die Form</B>
</P><P>
Ganz gut an dem Buch hat mir gefallen, da&szlig; es viele, kurze Kapitel sind.
Dadurch kann man immer eine kleine Portion lesen und verdauen, ohne den
Faden zu verlieren. Auf jeden Fall ist es ein Buch zum Nachdenken, zum
Hinterfragen der Grundlagen unserer Zivilisation. Ich kann mir nicht
vorstellen, da&szlig; es jemand nur als Abenteuerroman lesen kann; selbst wenn
alles nur erfunden sein sollte, ist die Lebensweise der &quot;Wahren Menschen&quot;
so in sich logisch geschildert, da&szlig; sie unm&ouml;glich ein Hirngespinst sein
kann.
</P><P>
<B>Fazit</B>
</P><P>
Das Buch ist ideal f&uuml;r den Urlaub. In der entspannten Urlaubsatmosph&auml;re
hat man genug Mu&szlig;e, den Gedankeng&auml;ngen zu folgen, ist das Wetter schlecht,
w&auml;rmen die Schilderungen der W&uuml;ste von innen. Die kurzen Kapitel helfen,
die Gedanken zwischendurch zu ordnen und erlauben es, schnell mal ein
St&uuml;ckchen weiterzulesen, wenn man Leerlauf hat.
</P><P>
Die Beschreibung einer v&ouml;llig anderen Sicht der Welt ist so faszinierend,
da&szlig; man sich mehr als einmal die Frage stellt, ob wir unser Leben
eigentlich nicht total verkehrt leben. Dabei ist von Belehrung durch die
Autorin gar nichts zu sp&uuml;ren, sie schildert einfach nur ihre Eindr&uuml;cke
und Gedankeng&auml;nge w&auml;hrend des (vielleicht imagin&auml;ren) Walkabouts. Und
wohl gerade deshalb ist das Buch gleichzeitig unterhaltend, aber auch
eine gute Anregung zur Hinterfragung des eigenen Lebens.
</P><P>
Zu kaufen ist das Buch in jeder Buchhandlung und nat&uuml;rlich in den
diversen Internet-Online-Buchl&auml;den:
</P><P>
Marlo Morgan - &quot;Traumf&auml;nger&quot;<br>
Taschenbuch, 251 Seiten (1998)<br>
Goldmann, M&uumlnchen, ISBN: 3442437407
</P><P>
Preis: 14,90 DM (7,62 EURO)
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912stro.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912hack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
