<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Begierde&quot; (The Hunger)</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Begierde&quot;<br> (The Hunger)</H1>(1983)<br><br>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>
</P><P>
Der erste Spielfilm des Musikvideomachers Tony Scott (Bruder von Ridley
Scott) wurde schon gleich nach seinem Erscheinen zum Kultfilm und
definierte mit seiner diffusen Beleuchtung und den photographischen
Effekten f&uuml;r Jahre den &quot;MTV - Look&quot;. Auch wegen der f&uuml;r damalige Zeiten
provokativen Erotik war der Film schon vor seinem Erscheinem in aller
Munde.
</P><P>
Miriam Blaylock (Catherine Deneuve) ist eine alt&auml;gyptische Vampirin, die
rastlos die Jahrhunderte mit ihren Geliebten durchstreift. Ihren jetzigen
Liebhaber, John (David Bowie) hat sie im 18. Jahrhundert kennen- und
liebengelernt. Doch nun, in der Gegenwart, passiert bei ihm dasselbe
was bei allen ihren Partnern und Partnerinnen durch die Jahrhunderte
passiert: er stirbt, aber auf eine andere Art und Weise als die
Normalsterblichen. John beginnt an einem Tag in einer beeindruckenden
Sequenz zum Greis zu altern.
</P><P>
Die beiden geraten in Panik und suchen eine Wissenschaftlerin auf, die
sich mit dem Problem des Altern besch&auml;ftigt und dar&uuml;ber ein Buch
geschrieben hat. Sarah Roberts (Susan Sarandon) und ihr Freund (Cliff
de Young) arbeiten gemeinsam an einem Projekt, bei dem sie mit
Tierversuchen bewiesen haben, da&szlig; es eine innere Uhr gibt und da&szlig;
diese beeinflu&szlig;t werden kann.
</P><P>
Sarah glaubt John jedoch zun&auml;chst nicht, als er sie in ihrer Praxis
aufsucht, erst sp&auml;ter kommen ihr Zweifel und sie versucht ihn zu Hause
zu erreichen. Zu diesem Zeitpunkt ist es jedoch f&uuml;r John schon zu sp&auml;t.
Er liegt schon lebendig begraben mit Dutzenden von anderen, die das
gleiche Schicksal erleiden wie er, im obersten Stock von Miriams Haus.
</P><P>
Obwohl sein K&ouml;rper unheimlich alt ist, kann er nicht sterben und mu&szlig;
die Ewigkeit in seinem Sarg verbringen. Sarah ist sofort fasziniert
von Miriam und erliegt ihrem Charme. In der wohl bekanntesten Szene des
Filmes lieben sich die beiden und Miriam gibt Sarah ihr Blut, um sie zu
ihrer n&auml;chsten Geliebten zu machen. Sarah saugt nun ihrem Freund das Blut
aus, kann sich aber mit dem Leben als Vampirin nicht abfinden und versucht
sich selbt umzubringen.
</P><P>
Als Miriam sie nun auch begraben will, mu&szlig; sie feststellen, da&szlig; John
zusammen mit den anderen Untoten Liebhabern es in seinem Sarg nicht mehr
aush&auml;lt. In der wohl beeindruckendsten Szene des Filmes, werfen die
Untoten Miriam vom Balkon hinunter, und diese altert nun zum Greis,
w&auml;hrend all ihre Liebhaber nun endlich sterben k&ouml;nnen.
</P><P>
Das Ende des Filmes zeigt Sarah, die nun die neue Vampirin ist, mit
Miriam als ihrem ersten untoten Opfer im Sarg ihrer schicken Londoner
Wohnung.
</P><P>
Die schauspielerische Leistung von Catherine Deneuve ist unvergleichlich,
da sie immer etwas seltsam unechtes auszustrahlen scheint, so als w&auml;re
sie auch in Wirklichkeit kein richtiger Mensch.
</P><P>
Der Film basiert auf dem gleichnamigen Roman von Whitley Strieber und ist
auf VHS in der Serie &quot;Terror Classics&quot; erschienen. Auch der Soundtrack von
Varese Sarabande ist erh&auml;ltlich. Darauf enthalten sind auch ein paar
wundersch&ouml;ne klassische St&uuml;cke, wie &quot;Lakme&quot; von Delibe und das &quot;Trio
in Es&quot; von Schubert.
</P><P>
Die vielleicht f&uuml;r manchen etwas abstruse Story vermag durch die komplexe
Erz&auml;hlweise und faszinierende Machart des Filmes zu fesseln. Dieser Film
war der erste Vampirfilm, der sich von dem althergebrachten Motiven
(Friedh&ouml;fe, Kruxifixe, etc.) verabschiedete und damit eine Flut solcher
&quot;modernen&quot; Vampirfilme ausl&ouml;ste.
</P><P>
Dieser Film ist meiner Meinung nach der einzig gute von Tony Scott,
seine anderen Werke sind meist nur &uuml;berproduzierte Projekte mit lausigem
Drehbuch, wie &quot;True Romance&quot;, &quot;Crimson Tide&quot;, &quot;Staatsfeind Nr. 1&quot;, oder
&quot;Days of Thunder&quot; und einige andere.
</P><P>
Auch Whitley Strieber, der in den 80gern eine steile Karriere als Autor
von guten Horror-Romanen machte, setzte dieser leider selbst ein Ende,
indem er jetzt nur mehr langweilige B&uuml;cher &uuml;ber seine angebliche
UFO-Entf&uuml;hrung fabriziert.
</P><P>
In seinem Roman hat die Geschichte &uuml;brigens ein anderes Ende: Sarah t&ouml;tet
sich zwar auch aus Verzeiflung selbst, wird von  Miriam aber ebenso wie
ihre Vorg&auml;nger in einen Sarg verfrachtet und teilt das Schicksal derer.
Miriams Kraft ist jedoch zu stark um je von irgendjemandem gebrochen zu
werden, und sie lebt ihr Leben wie gehabt weiter. Der Roman besticht auch
von athmosph&auml;rischen Beschreibungen ihres fr&uuml;heren Lebens im Altertum und
ihrer faszinierend morbiden Gedankeng&auml;nge.
</P><P>
Als spezieller Gaststar tritt die in den 80ern zum Kult aufgestiegene
Band &quot;Bauhaus&quot; mit ihrem Song &quot;Bela Lugosi is dead&quot; in der Er&ouml;ffnungsszene
auf. Das Lied ist deshalb so passend, da Bela Lugosi in den 30ern besonders
durch seine Darstellung des Grafen Dracula, also eine &quot;altmodische&quot;
Vampirdarstellung, ber&uuml;hmt wurde.
</P><P>
Au&szlig;erdem ist Ann Magnuson, in einer ihrer ersten Rollen, als Vampiropfer
am Beginn in der Disco zu sehen, die sp&auml;ter eine gr&ouml;&szlig;ere Karriere
als Schauspielerin und S&auml;ngerin machte, sowie auch William Dafoe (&quot;Body
of Evidence&quot;), der hier sein Deb&uuml;t als Stra&szlig;enjunge hat.
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912trau.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912blut.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
