<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Risk&quot; / Megadeth</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Risk&quot; / Megadeth</H1>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>
</P><P>
Endlich, endlich, endlich... hat eine meiner Lieblingsbands wieder ein
neues Album herausgebracht. Das letzte, &quot;<B>Cryptic Writings</B>&quot; (&uuml;brigens
sehr gut), liegt ja schon zwei Jahre zur&uuml;ck.
</P><P>
Allerdings mein erster Eindruck nach dem Reinh&ouml;ren: naja...
</P><P>
Aber fangen wir mal mit dem Optischen an: Das Booklet ist in gelb gehalten
und beeinhaltet die &uuml;blichen Bandphotos, die aber diesmal im Vergleich zu
den Alben &quot;Cryptic Writings&quot; (1997) und &quot;Youthanasia&quot; (1994) irgendwie
uninspiriert und einfallslos wirken. Aber dazu noch sp&auml;ter. Was mich
wirklich &auml;rgerte, war, da&szlig; diesmal die Liedtexte nicht abgedruckt wurden.
</P><P>
Da ich mir gerne, besonders beim ersten H&ouml;ren, gleichzeitig den Text
durchlese (wenn er es wert ist, aber bei Megadeth ist er das meistens.
Vielleicht hatte da jemand Angst, diesmal w&auml;re es &uuml;berhaupt nicht so?),
war ich diesmal ziemlich entt&auml;uscht, obwohl er bei der ersten, hart und
schnell gehaltenen Nummer &quot;<B>Insomnia</B>&quot; anscheinend nur aus ein paar Zeilen
(&quot;Insomnia  - I can't go to sleep&quot; oder so in die Richtung) besteht, was
eigentlich im Vergleich zu ihren anderen Alben ungew&ouml;hnlich ist.
</P><P>
Au&szlig;erdem ist man als Megadeth-Kenner leicht &uuml;berrascht, da&szlig; auf diesem
Album keines ihre typisch depressiven &quot;Gebrochenes Herz&quot;-Lieder ist, wo
diese harte Schwerm&uuml;tigkeit (damit meine ich, es ging nie so in die
Richtung Gothik oder &auml;hnlich - sie blieben, egal ob depressiv oder
agressiv, immer eine Heavy Metal-Band) doch von manchen Leuten schon
fast als Markenzeichen bezeichnet wurde!
</P><P>
Und jetzt zu den Bandphotos: Es ist immer wieder erstaunlich, wie sich
in den 2-3 Jahren zwischen den einzelnen Alben die Leute ver&auml;ndern und
besonders lustig anzusehen, wenn man, wie ich, alle verf&uuml;gbaren Alben
besitzt. Ich denke da an ihre Anf&auml;nge in den Achtzigern (&quot;So far, so
good, so what&quot;, dort sind &uuml;brigens ein paar meiner Lieblingsnummern
versammelt) bis zu dem recht verkrachten &quot;Rust in Peace&quot;, in dem sie
auch ziemlich schlecht aussehen.
</P><P>
Es ist schade, da&szlig; sie sich von ihrem Drummer Nick Menza getrennt haben
(ca. 1998). Statt dessen wurde Jimmy DeGrasso in die Band aufgenommen,
aus dieser Anfangszeit gibt es ein paar unfreiwillig komische Fotos auf
denen DeGrasso mit ultrakurzen Haaren leicht verloren zwischen all den
Typen mit den langen M&auml;hnen steht. David Ellefson, der in &quot;Cryptic
Writings&quot; auf den wundersch&ouml;nen in schwarz/wei&szlig; gehaltenen Photos
irgendwie wie ein alkohols&uuml;chtiger Penner aussah, hat sich jetzt die
Haare aufhellen, ein bi&szlig;chen k&uuml;rzen und kr&auml;useln lassen, wodurch er
auf den ersten Blick gar nicht mehr erkennbar ist und  um Jahre j&uuml;nger
aussieht, im Gegensatz zum Gr&uuml;nder der Band, Ex-Mitglied von &quot;Metallica&quot;,
Dave Mustaine.
</P><P>
Sein sch&ouml;nes, fein geschnittenes Gesicht wirkt jetzt aufgedunsen und
krank. Tja... DeGrasso f&auml;llt jetzt nicht mehr auf, weil er sich auch
die Haare wachsen lie&szlig;.
</P><P>
Aber jetzt (endlich) zum Sound:
</P><P>
Also um es gleich zu sagen, &quot;Cryptic Writings&quot; war um Hochh&auml;user besser,
auch von der Gestaltung des Booklets her. Auf  &quot;Risk&quot; sind die Songs alle
insgesamt zu soft und die Songs, die eigentlich hart h&auml;tten sein sollen,
wirken nur bem&uuml;ht hart (z.B. &quot;<B>Crush 'Em</B>&quot;). Die soften Songs sind aber
meistens gut, obwohl man zum Beispiel bei &quot;<B>The Doctor is calling</B>&quot; fragt,
um was es in diesem reingemischten Telefongespr&auml;ch &uuml;berhaupt gehen soll.
Obwohl Mustaines Gesangsstil derselbe geblieben ist, fehlt auch ihm das
gewisse Etwas, welches &uuml;berhaupt dem ganzen Album fehlt. Schade.
</P><P>
Der CD-Extra-Track ist einfach, aber gelungen. Ein Quicktime-Video mit
Interviews der Band, in dem Mustaines Verfall meiner Meinung nach noch
deutlicher zu sehen ist und der mich irgendwie an den gealterten &quot;Capt.
Kirk&quot; William Shatner erinnert.
</P><P>
Auch ihre Homepage <A HREF="http://www.megadeth.com">http://www.megadeth.com</a>
konnte mich nicht vom konnte mich nicht vom Hocker
rei&szlig;en. Das ShockWave-Plugin f&uuml;r ein paar Effekte zu nutzen, ist ja ganz
nett, aber es so zu &uuml;bertreiben, wie hier und alles mit Effekten
zuzukleistern, ist meiner Meinung nach &uuml;bertrieben. Jedem der glaubt,
Megadeth w&auml;ren nur ein paar primitive Heavy Metal-Typen, die nichts
k&ouml;nnen, au&szlig;er m&ouml;glichst laut zu spielen, wird dieses Album (wie aber
jedes andere auch) nat&uuml;rlich das Gegenteil beweisen.
</P><P>
Aber, wie gesagt, das Vorg&auml;ngeralbum &quot;Cryptic Writings&quot; war einfach
inspirierter, besser balanciert zwischen harten und softeren Nummern
und au&szlig;erdem waren da alle Texte im Booklet abgedruckt (f&uuml;r mich ein
wichtiger Punkt) welches auch besser gestaltet war. Da kann man nur
hoffen und beten, da&szlig; ihr n&auml;chstes Werk besser wird und dieses nicht
so stark floppt, da&szlig; sie allen Mut verlieren.
</P><P>
(c) by Capitol Records Inc. 1999, ca. 29,- DM bzw. 44,- DM (¹)
</P><P>
</P><P>
(¹) - In der Version mit der zweiten CD, die von jedem bisher
ver&ouml;ffentlichtem Album einen ausgew&auml;hlten Track und ein Interview mit
Dave Mustaine enth&auml;lt (meiner Meinung nach zwar reiner Nepp, genauso
wie diese teuerere Version von &quot;Cryptic Writings&quot;, die einen Track
mehr enthielt - aber wer's will...)
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912joge.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
