<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Bis das Blut gefriert&quot; (The Haunting)</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Bis das Blut gefriert&quot;<br> (The Haunting)</H1>(1963)<br><br>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>
</P><P>

<p align=center><IMG SRC="../amz1299/haunting.jpg" width=480 heigth=319></p>

<center><B>&quot;Ein b&ouml;ses altes Haus... drohend, geheimnisvoll. Wie ein unentdecktes
Land das es zu erforschen gilt.&quot;</B><br> Dr. Markway am Beginn von &quot;Bis das
Blut gefriert&quot;.
</P></center>

<P>
Dieser Klassiker des Horrorfilms von Robert Wise (&quot;West Side Story&quot;, &quot;The
Sound of Music&quot;) gewinnt gerade jetzt wieder an Aktualit&auml;t, da er von Jan
de Bont (&quot;Speed&quot;) mit Catherine Zeta Jones neu verfilmt wurde und in
dieser Fassung im Oktober in die Kinos kommen wird. Schon allein von den
Berichten her l&auml;&szlig;t sich aber sagen, da&szlig; das Remake wohl kaum das Niveau
des Originals erreichen wird und wahrscheinlich zum Gro&szlig;teil aus
aufwendiger Effekthascherei besteht.
</P><P>
&quot;The Haunting&quot; basiert auf dem Roman &quot;The Haunting of Hill House&quot; von
Shirley Jackson, die in Amerika schon zu ihren Lebzeiten als geniale
Autorin des Psychohorrors gefeiert wurde. Ihr erster Durchbruch war
eine Kurzgeschichte f&uuml;r eine Tageszeitung, die die Leser so verschreckte,
da&szlig; sie die Redaktion sofort mit Leserbriefen bombardierten.
</P><P>
Dr. Markway (George Johnson) ist ein anerkannter Wissenschaftler, der
ein bizarres Experiment vorhat: Die Untersuchung eines als verflucht
geltenden Hauses. Auf seiner Suche nach einem geeigneten Anwesen, st&ouml;&szlig;t
er auf Hill House, das verlassene Anwesen des Million&auml;rs Hugh Crain.
</P><P>
Seit eine seiner T&ouml;chter als alte Frau auf mysteri&ouml;se Weise im Haus
umkam und ihre Gesellschafterin als Alleinerbin das Haus bewohnte,
h&auml;uften sich Ger&uuml;chte um seltsame Vorg&auml;nge im Haus. Nachdem die
Gesellschafterin sich im Turm erh&auml;ngt, wird das Haus verschlossen.
</P><P>
Dr. Markway hat vor, das Haus f&uuml;r einige Zeit mit ausgew&auml;hlten Assistenten
zu bewohnen, um etwaige auftretende paranormale Erscheinungen zu
registrieren.
</P><P>
Nachdem der Film die dramatische Geschichte des Hauses und das Vorhaben
des Doktors geschildert hat, schwenkt er gleich &uuml;ber zum Geschehen rund
um seine Protagonistin, Eleonor Lance (Julie Harris,&quot;Jenseits von Eden&quot;).
Der Film wird aus ihrer Sicht erz&auml;hlt. Eleonor lebt seit dem Tod ihrer
Mutter bei ihrer ekelhaften Schwester, die ihr vorwirft, die kranke Mutter
nicht richtig gepflegt zu haben.
</P><P>
Die Einladung von Dr. Markway ist f&uuml;r sie die erste Chance, aus dem
tristen Alltag zu entfliehen. Schon von Anfang an klammert sie sich an
den Strohhalm, da&szlig; bei diesem Ausflug etwas in ihrem Leben geschehen mu&szlig;.
Doch schon beim ersten Blick auf Hill House wei&szlig; sie, da&szlig; es b&ouml;se ist.
</P><P>
Neben Eleonor sind nur noch die lebenslustige Theodora (Claire Bloom, &quot;Die
Br&uuml;der Karamasow&quot;) und der Skeptiker Luke (Russ Tamblyn, &quot;West Side Story&quot;)
anwesend, der das Haus einmal erben wird.
</P><P>
Schon in der ersten Nacht manifestieren sich die paranormalen Kr&auml;fte, und
Eleonor sowie Theodora werden in ihrem Zimmer tyrannisiert. Eleonor
verstrickt sich mit der Zeit immer tiefer in ihrer Vorstellung, da&szlig; Hill
House ihr wirkliches Zuhause ist. Als auch noch die Frau des Doktors
(Lois Maxwell, bekannt als &quot;Miss Moneypenny&quot;) vorbeischaut und prompt
bei einem &uuml;bersinnlichen H&ouml;llenspektakel entf&uuml;hrt wird, h&auml;lt der Doktor
es f&uuml;r besser, wenn sie Hill House wieder verl&auml;&szlig;t.
</P><P>
Eleonors zerqu&auml;lte Seele kann sich jedoch dem Griff von Hill House nicht
entrei&szlig;en und mit letzter Verzweiflung f&auml;hrt Eleonor ihr Auto gegen einen
Baum als sie das Grundst&uuml;ck verlassen soll. Das Haus hat somit, was es
wollte.
</P><P>
<center><B>&quot;Wie viele wird Hill House noch in seinen Bann schrecken? Doch wo liegt
es eigentlich, dieses Hill House? In Neuengland hei&szlig;t es, oder vielleicht
doch in einem unbekannten Ort unserer Seele, der zwischen Gut und B&ouml;se
entscheidet? Ich wei&szlig; nicht.&quot;</B><br>Eleonor am Ende von &quot;Bis das Blut gefriert&quot;
</P></center><P>
Der Film beeindruckt besonders durch die, bis in die Nebenrollen
fantastische Leistung der Schauspieler. Julie Harris &uuml;berzeugt besonders
als heimatlose, einsame, junge Frau, die einfach nur ein Zuhause sucht.
</P><P>
Auch die Musik von Humphrey Searle, der f&uuml;r alle Hauptpersonen jeweils
ein eigenes Thema komponierte und diese dann immer wieder variiert, tr&auml;gt
einiges zur Atmosph&auml;re des Films bei. Am beeindruckendsten ist jedoch die
Inszenierung von Robert Wise und seine sorgf&auml;ltig komponierten,
wundersch&ouml;n fotographierten Schwarzwei&szlig;bilder.
</P><P>
Der Film ist auf VHS in der Reihe &quot;Terror Classics&quot;, auf Laserdisc und
wahrscheinlich auch bald auf DVD erh&auml;ltlich. Der Roman &quot;The Haunting of
Hill House&quot; von Shirley Jackson ist im Penguin Verlag erschienen bzw. in
Deutsch als &quot;Spuk in Hill House&quot;.
</P>
<P>
Das Bild oben ist ein PR-Foto f&uuml;r
den Film und zeigt das Team vor Hill House. Von links nach rechts:
Theodora (Claire Bloom), Luke (Russ Tamblyn), Eleonor (Julie Harris),
Dr. Markway (George Johnson)
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912begi.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../amz1299/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
