<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Hackerland&quot; / Denis Moschitto &amp; Evrim Sen</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Hackerland&quot; / Denis Moschitto &amp; Evrim Sen</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>
</P><P>
&quot;Hackerland - <B>Das Logbuch der Szene</B>&quot; versucht dem Leser die
mythenumwobenen Geschichten und Erlebnisse rund um die Computerszene
n&auml;herzubringen.
</P><P>
Die beiden Autoren Denis Moschitto und Evrim Sen, die selbst jahrelang
Mitglieder der Amiga-Demo-Szene bei den Gruppen &quot;Scoopex&quot; und &quot;Shining 8&quot;
waren, gliederten das Buch in mehrere Abschnitte, auf die ich sp&auml;ter noch
eingehen werde.
</P><P>
Das Cover des Taschenbuchs zeigt eine Computer-Tastatur im &quot;nackten&quot;
Zustand (also ohne Geh&auml;use), was bei mir kurzfristig den Gedanken
aufkommen lie&szlig;, ob denn im Buch auch einige interessante Bastelanleitungen
zu finden seien, die eventuell zu eigenen (illegalen?) T&auml;tigkeiten f&uuml;hren
k&ouml;nnten.
</P><P>
Die Antwort hierauf lautet: Nein, so etwas ist hier nicht zu finden.
Es werden zwar verschiedene M&ouml;glichkeiten der Szene grob umschrieben,
wie z.B. das kostenlose Telefonieren mit &quot;Calling Cards&quot;, aber technische
Details dar&uuml;ber wurden nicht ver&ouml;ffentlicht.
</P><P>
&quot;Hackerland&quot; ist in <B>sieben Kapitel</B> aufgeteilt, die von den ersten
Aktivit&auml;ten der Szene (ca. 1984) bis zum heutigen Tag erz&auml;hlen.
</P><P>
<B>Softwarepiraterie</B>
</P><P>
Angefangen von den ersten Raubkopierern (auf dem Commodore 64) bis hin
zum heutigen Bezug von Cracks im Internet, wird hier die Chronologie
derartiger Aktionen geschildert.
</P><P>
<B>Mailboxsysteme</B>
</P><P>
Dieser Abschnitt enth&auml;lt interessante Informationen &uuml;ber den Betrieb
und die Regeln dieser &quot;Online-Bezugsquelle&quot;.
</P><P>
<B>Der Phreaker</B>
</P><P>
Telefonieren ist teuer. Das es auch anders geht, ist hier zu lesen.
</P><P>
<B>Die Szene und das Gesetz</B>
</P><P>
Diese Kapitelbezeichnung sollte selbsterk&auml;rend sein.
</P><P>
<B>Die Kunst des Hackens</B>
</P><P>
Dieser Abschnitt ist am gr&ouml;&szlig;ten ausgefallen. Auf &uuml;ber 20 Seiten wird
hier ausf&uuml;hrlich auf den Mythos des Hackens eingegangen.
</P><P>
<B>Hauptsache Spa&szlig;</B>
</P><P>
Hier wird die andere (legale!) Seite der Szene beschrieben: die
Demoszene! Auch ein Bericht &uuml;ber Szene-Partys (z.B. &quot;The Party&quot; in
D&auml;nemark) wurde nicht vergessen.
</P><P>
<B>Im Kontakt mit der Szene</B>
</P><P>
Welche M&ouml;glichkeiten bestehen, selbst mit Szenemitliedern in Kontakt
zu treten und was dabei f&uuml;r Regeln zu beachten sind, wird hier erl&auml;utert.
</P><P>
Nach diesen Abschnitten folgt der Anhang, welcher nicht minder interessant
ist:
</P><P>
Hier finden sich u.a. Interviews mit Szenemitgliedern, als auch
Softwarefirmen, ein Internet-Adressenverzeichnis, sowie ein Lexikon
der Szenebegriffe.
</P><P>
Der Amiga selbst wird im Buch fast gar nicht namentlich erw&auml;hnt, dennoch
sp&uuml;rt man f&ouml;rmlich, da&szlig; viele Aktivit&auml;ten mit eben diesem Rechner
stattfanden.
</P><P>
Im Nachwort des Buches wird bef&uuml;rchtet, da&szlig; die Ver&ouml;ffentlichung von
&quot;Hackerland&quot; eventuell der Szene schaden k&ouml;nnte, doch aus meiner
objektiven Sicht- und Leseweise konnte ich hierf&uuml;r keinen
Anhaltspunkt finden.
</P><P>
Bemerkenswert finde ich die Zeilen der beiden Autoren, die den Wandel
der Szene vom einstigen Pioniergeist und dem Zusammenhalt der Szene
zur heutigen Kommerzialisierung kritisch ansprechen!
</P><P>
<B>Fazit:</B>
</P><P>
Wenn man selbst einigerma&szlig;en &uuml;ber die geschichtlichen Ereignisse
in diesem Umfeld informiert ist, so wird man sicherlich die meisten
Fakten des Buches schon kennen.
</P><P>
Die einstige Amiga-Zeitschrift &quot;Amiga Joker&quot; informierte Zeit Ihres
Bestehens viel &uuml;ber diese Szene, so da&szlig; die ehemaligen Leser dieser
Publikation nicht allzuviel neues erfahren.
</P><P>
Trotzdem ist es sehr erfreulich, da&szlig; alle einschl&auml;gigen Informationen
in einem Werk zusammengefa&szlig;t wurden, von daher ist &quot;Hackerland&quot; f&uuml;r
alle Computer-Interessierten eine empfehlenswerte Lekt&uuml;re.
</P><P>
Ich selbst habe da&szlig; 170-seitige Buch in einem St&uuml;ck durchgelesen. Da
dies eine Seltenheit bei mir ist, beweist es mir, da&szlig; mich der Ausflug
in's &quot;Hackerland&quot; faszinierte.
</P><P>
Denis Moschitto und Evrim Sen - &quot;Hackerland&quot;<br>
Taschenbuch, 170 Seiten (1999)<br>
Tropen Verlag, K&ouml;ln, ISBN: 3-932170-29-6
</P><P>
Preis: 24,80 DM
</P><P>
<A HREF="http://www.hackerland.de">http://www.hackerland.de</A>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912trau.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912begi.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
