<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;The Burning Red&quot; / Machine Head</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;The Burning Red&quot; / Machine Head</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>
</P><P>
Nun ist sie endlich da, die dritte CD der US-amerikanischen Gruppe
'Machine Head'. Komplett, von der CD-H&uuml;lle, dem Cover und der CD selbst,
in tiefrot gehalten, merkt man, wie sehr der Albumtitel hier auch nochmal
symbolisch Ausdruck fandt.
</P><P>
<B>Wer ist Machine Head?</B>
</P><P>
Nachdem sich die Heavy-Metal-Musik Anfang der 90'er Jahre durch die
Integration neuer Stile, wie z.B. Grunge, immer radiokompatibler wurde,
ersch&uuml;tterte Machine Head 1994 die Heavy-Metal-Welt mit dem brachialen
Album &quot;<B>Burn my Eyes</B>&quot;.
</P><P>
Dieses Album bestach durch enorme H&auml;rte und gleichzeitig spieltechnisch
herausragenden Finessen, die bis dato nicht bekannt waren. Damit
katapultierte Machine Head sich gleich in die Eliteliga der harten Musik
und f&uuml;r alle anderen Gruppen dieser Richtung, auch f&uuml;r Machine Head
selbst, war ein neuer Ma&szlig;stab gesetzt, der bis heute kaum wieder
erreicht wurde.
</P><P>
Das 1997 erschienene Nachfolgealbum &quot;<B>The More Things Change...</B>&quot;, das
dreimal neu eingespielt werden mu&szlig;te, da die Gruppe mit den
Studioaufnahmen nicht zufrieden war, ergab hinsichtlich des Stils eine
kleine &Auml;nderung, indem das Tempo der Songs ein wenig gedrosselt wurde.
Dies f&uuml;hrte zu einigen Kritiken an dem Album, die ihm ein etwas
eint&ouml;niges Songmaterial vorwarfen.
</P><P>
Diese Kritiken nahm sich Machine Head zu Herzen und will nun mit dem
neuen Album &uuml;berzeugen.
</P><P>
<B>Musik</B>
</P><P>
Um es gleich vorweg zu nehmen: Machine Head hat nichts an H&auml;rte
verloren!
</P><P>
Die Komplexit&auml;t und die Abwechlungsvielfalt der Songs hat aber enorm
zugenommen, so da&szlig; man sich das ganze Album erst nach mehrmaligen
Durchl&auml;ufen richtig erschlie&szlig;en kann.
</P><P>
High-Speed-Passagen finden sich nicht mehr auf der CD, die typischen
Riffs und der gewaltige Groove stehen dagegen nach wie vor im Vordergrund.
</P><P>
Der Sound ist &uuml;berw&auml;ltigend, nur wenige meiner CD's besitzen dieses
glasklare und gewaltige Soundvolumen. Um sich die Qualit&auml;t aber auch
zug&auml;nglich zu machen, sollte man den Lautst&auml;rkeregler doch ein ganz
gro&szlig;es St&uuml;ck weiter aufdrehen und/oder einen guten Kopfh&ouml;rer verwenden.
</P><P>
12 Songs sind auf der CD mit einer Gesamtl&auml;nge von ca. 60 Minuten
vertreten, hier erkennt man schon, da&szlig; die L&auml;nge eines Songs mit
durchschnittlich f&uuml;nf Minuten weit &uuml;ber dem normalen Schnitt liegt.
</P><P>
Die Titel sind vielf&auml;ltig aufgebaut, zwei von ihnen (&quot;<B>Desire to Fire</B>&quot;
und &quot;<B>From This Day</B>&quot;) sind sogar durch HipHop-Elemente aufgelockert.
</P><P>
Zwei weitere Songs fallen musikalisch ebenfalls aus dem Gesamtkonzept.
Der Titelsong &quot;<B>The Burning Red</B>&quot;, den man wohl als erste Ballade Machine
Heads bezeichnen kann und das sehr gelungene Police-Cover &quot;<B>Message in a
Bottle</B>&quot;. Dieser Titel, den wohl jeder von uns kennt, hat weiterhin einen
sehr hohen Wiedererkennungswert, wurde aber sehr gelungen mit dem
typischen Machine Head-Groove versehen.
</P><P>
<B>Lyrik</B>
</P><P>
W&auml;hrend sich die Texte auf den ersten beiden Alben noch um die
Verherrlichung von Kriminalit&auml;t, Drogen und &auml;hnlichem drehten, sind
die aktuellen zwar mit der gleichen Thematik befasst, allerdings
wird sie diesmal sozialkritisch beleuchtet und dadurch erstmals auch
lesenswert!
</P><P>
<B>Fazit</B>
</P><P>
Die Bef&uuml;rchtungen vor der Ver&ouml;ffentlichung des Albums, Machine Head
k&ouml;nnten an H&auml;rte verloren haben, wischt dieses Album eindrucksvoll
vom Tisch.
</P><P>
&quot;The Burning Red&quot; ist gegen&uuml;ber dem Vorg&auml;ngeralbum wieder ein Schritt
nach vorne, was sich dem H&ouml;rer aber erst nach mehrmaligen H&ouml;ren der CD
komplett erschlie&szlig;t. Durch die komplexen Kompositionen wurde eine
facettenreiche Vielfalt erschlossen, die der Gruppe wohl auch einen
neuen H&ouml;rerkreis erschlie&szlig;en kann.
</P><P>
Nichtdestotrotz bleibt das Deb&uuml;talbum &quot;Burn my Eyes&quot; f&uuml;r mich dennoch
unerreicht, dies liegt aber auch daran, da&szlig; sich meine pers&ouml;nlicher
Geschmack an sehr schnellen Songs orientiert.
</P><P>
(C) Roadrunner Record 1999, ca. 29,- DM
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912bau.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912stro.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
