<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;The Wanderer&quot; / Jogeir Liljedahl</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;The Wanderer&quot; / Jogeir Liljedahl</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
</P><P>
<B>Jogeir Liljedahl</B> ist ein erfolgreicher Amiga-Mod-Komponist, dessen
Aktivit&auml;ten bis ins Jahr 1987 zur&uuml;ckreichen und der Anfang der Neunziger
Jahre die Musikdemo-Gruppe &quot;Noiseless&quot; gegr&uuml;ndet hat. Viele seiner Mods
sind sehr bekannt geworden und haben auf Conventions Preise gewonnen. Der
ebenfalls nicht ganz unbekannte Computer-Musiker <B>Bj&ouml;rn Lynne</B> (Team 17)
hat nun in seinem kleinen Label ein Album von Liljedahl herausgebracht.
</P><P>
Der CD sieht man auf den ersten Blick die professionelle Herstellung an.
Das <B>Design</B> der H&uuml;lle und des Booklets wird von der Farbe Blau dominiert
und die etwas expressionistisch angehauchten Motive von Antony Squizzato,
die Spielraum in ihrer Deutung lassen, geben dem Artwork der CD etwas
Markantes.
</P><P>
&quot;The Wanderer&quot; enth&auml;lt wirklich harmonische, insgesamt sehr ruhige,
und angenehme - aber dabei &uuml;berhaupt nicht langweilige Kompositionen.
Sehr positiv f&auml;llt auf, das die Musik kaum k&uuml;nstlich wirkt, wie es bei
manchen anderen Produktionen aus &auml;hnlichem Umfeld gelegentlich auftritt.
</P><P>
Trotz eines Stils, der sich durch das gesamte Album zieht und der nur
geringen Tempounterschiede zwischen den Titeln, gleichen diese sich nicht.
Es bleibt st&auml;ndig Spielraum f&uuml;r etwas Neues und immer wieder st&ouml;&szlig;t man auf
frische Ideen.
</P><P>
So sind z.B. in &quot;<B>Imaginative</B>&quot; besonders viele Kl&auml;nge aus der Natur
eingeflochten und in mehreren Titeln, wie dem sch&ouml;nen &quot;<B>G-Comp</B>&quot;, mit
dem die CD beginnt, wird die Melodiestimme wirkungsvoll von gezupfter
Akustikgitarre unterst&uuml;tzt.
</P><P>
Einigen Titeln wie z.B. &quot;<B>Overture</B>&quot; merkt man als Kenner (in positiver
Weise) die Mod-Herkunft an.
</P><P>
Jogeirs vielleicht bekanntestes St&uuml;ck, stellt &quot;<B>Guitar Slinger</B>&quot; dar, das
schon als Mod wunderbar klingt. In der hier enthaltenen Version wurden
aber nat&uuml;rlich die besseren M&ouml;glichkeiten der Audio-CD genutzt.
</P><P>
Die, im Vergleich zu den anderen, etwas peppigeren Tracks, sind &quot;<B>Too Far
Away</B>&quot;, &quot;<B>Impulse</B>&quot; und der &quot;<B>BeetleMix'99</B>&quot;.
</P><P>
Der Bonus-Titel &quot;<B>The Squirrel</B>&quot; vermag wirklich die Vorstellung eines
fr&ouml;hlich und unbeschwert vor sich hin h&uuml;pfenden Eichh&ouml;rnchens
hervorzurufen.
</P><P>
Elektrisieren wird die CD kaum k&ouml;nnen, aber das soll sie auch nicht.
&quot;The Wanderer&quot; ist ideal zum Abspannen, garantiert Nervfreiheit und 57
Minuten guter Musik.
</P><P>
Nur online zu bestellen &uuml;ber <A HREF="http://www.lynnemusic.com/">http://www.lynnemusic.com/</a> oder per
Mailorder bei: Bjorn Lynne, Longlands House, Wakefield Road, Ossett
WF5 9JS, England.
</P><P>
(C) Jogeir Liljedahl 1999, Published by LynneMusic Productions
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912risk.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912bau.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
