<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - MMX: &quot;Stronger&quot; / Gary Barlow</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>&quot;Stronger&quot; / Gary Barlow</H1>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>
</P><P>
Vor kurzem meldete sich der Ex-&quot;Take That&quot;ler mit seiner neuen Single
&quot;Stronger&quot; zur&uuml;ck. Ich, eingeschworener Boygroup-Hasser, versuchte
vorurteilfrei an das Studienobjekt heranzutreten.
</P><P>
Also gleich erstmal: Robbie Williams (ein anderer Ex-&quot;Take That&quot;ler)
neue Single hei&szlig;t &quot;Strong&quot;. Hmmm..., angeblich soll aber Williams Single
viel besser sein (da ich sie nicht kenne, kann ich da&szlig; leider nicht
beurteilen). Zugegeben, &quot;Millennium&quot; von Robbie Williams ist ja wirklich
eine tolle Nummer und eines meiner Lieblingsst&uuml;cke, auch wenn die Melodie
der Streicher im Hintergrund das geklaute Thema irgendeines James Bond-
Films ist.
</P><P>
Also, im Stil kann man Barlows Single in diesem Mainstream Latino Pop
einordnen, der einem jetzt &uuml;berall in die Ohren quillt. Man kann
&quot;Stronger&quot; vorwerfen, es sei halt nur so seichter Pop wie er auf
Radiosendern wie Bayern3 oder &Ouml;3 fast schon fetischistisch verehrt wird.
</P><P>
&quot;Stronger&quot; ist aber sicher um tausende Prozente besser, als ihre anderen
&quot;Fetischobjekte&quot; wie Lou Begas Frechheit, die sich auch noch Musik nennt
&quot;Mambo Nr.5&quot; (Tschuldigung wenn ich jetzt ein bi&szlig;chen zu sarkastisch
werde, aber ich kann ihn einfach nicht ausstehen) oder die
Geschmacklosigkeiten von Jennifer Lopez und Konsorten.
</P><P>
Auf der Maxi-CD (wieso werden diese Singles &uuml;berhaupt immer als Maxi
bezeichnet, die sind doch nur Mini?) sind dann noch zwei andere Nummern,
&quot;Wondering&quot; und &quot;Looking for Change&quot;, die man aber getrost vergessen kann,
da sie wirklich einfach nur seicht sind, und wie &uuml;blich ein Dance-Remix
von &quot;Stronger&quot;. Von der musikalischen Seite her, so weit so gut/seicht/
schlecht. Was mich wirklich an dieser CD &auml;rgerte, war der CD-Extra Track.
</P><P>
Das Video f&uuml;r &quot;Stronger&quot; gleich mit auf die CD zu pressen fand ich ja an
sich eine tolle Idee, aber warum bitte im Zeitalter von MPEG und Quicktime
als briefmarkengro&szlig;es AVI? Nebenbei gesagt fand ich das Video sowieso
schlecht und nicht wirklich zu der Nummer passend. Wieso zeigen sie eine
deprimierende Collage aus Verkehrsstaus und Regenwolken zu so einer
heiteren Nummer?
</P><P>
Punkt zwei ist dann das Installationsprogramm (sorry, ab jetzt mu&szlig;te
ich halt auf den PC mit Windoze ausweichen *schluchz*): Nachdem 8 MB
auf die Platte kopiert wurden, wird eiskalt &uuml;ber mein mein neues
Quicktime 3.x eine uralte Version 2.1 dr&uuml;berkopiert. Danke!
</P><P>
Das sorgf&auml;ltig gestaltete Programm kann ein paar Fotos von Gary anzeigen,
hat ein Herz als Icon (!!!???, da mu&szlig; man sich ja sch&auml;men), hat einen
&quot;Secret Part&quot;, f&uuml;r den man erst ein Pa&szlig;wort von Garys Homepage (oder so
in die Richtung) braucht, beinhaltet den ersten von drei Schl&uuml;sseln, die
auf Garys n&auml;chsten CDs sind und mit denen man dann bei einem Gewinnspiel
mitmachen kann, um Gary zu treffen (*Hilfe*) und zeigt noch ein paar
Ruckel-AVIs, in denen Gary sich als lausiger Klavierspieler outet.
</P><P>
Kurz und b&uuml;ndig: &quot;Stronger&quot; ist wohl keine so schlechte Nummer, aber
die technische Umsetzung (optisch finde ich sie ja gelungen) des
EnhancedCD-Teils war wirklich unter jedem Niveau.
</P><P>
Im Netz kann man Gary auch unter <A HREF="http://www.garybarlow.co.uk">http://www.garybarlow.co.uk</A> besuchen.
Hatte bis jetzt keine Gelegenheit mir seine Site anzuschauen, aber wenn
dort die selben Wahnsinnigen am Werk waren, dann lieber nicht!
</P><P>
(c) by BMG Entertainment International 1999, ca. 13,- DM
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../mmx/9912burn.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../mmx/9912trau.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
