<HTML>
<HEAD><TITLE>AmZeiger 06/97 - Editorial</TITLE>
<META NAME="description" CONTENT="Editorial des AmZeiger 06/97">
<META NAME="keywords"    CONTENT="Amiga, Magazin, Computer, Gregor, Franz">
<META NAME="author"      CONTENT="Andreas Schlick">
<META NAME="generator"   CONTENT="WWW publishing extensions for GoldED">
</HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U>Editorial</U></H1><P><B>Warum eine Neue?</B></CENTER><BR>
Das wird wohl die erste Frage sein, die sich vermutlich nach der Ank&uuml;ndigung
berechtigt stellt. Sie soll auch gleich beantwortet werden.<P>

Wir sind <U>unzufrieden</U> mit der Situation auf dem (deutschen) Zeitschriftenmarkt f&uuml;r
den Amiga. Immer mehr Publikationen verabschieden sich oder erscheinen in l&auml;ngeren
Abst&auml;nden. Auch von Qualit&auml;tseinbu&szlig;en wissen einige Leser zu berichten.<P>

Dort entstehen L&uuml;cken, die wir hoffen f&uuml;llen zu k&ouml;nnen. Wir werden uns in der
Hauptsache dem Amiga widmen, obwohl im Magazinteil auch Platz f&uuml;r das eine oder
andere Thema ist. Wir wollen wichtige Neuigkeiten, interessante Tests und gute
Kurse bieten - in m&ouml;glichst hoher Qualit&auml;t. Keine einfache Wiederholung
offizieller Presseerkl&auml;rungen bzw. von Werbetexten.<P>
Ob wir diesen Anspr&uuml;chen gerecht werden, wird die Zukunft zeigen. Sie k&ouml;nnen daf&uuml;r
sorgen, da&szlig; sie gesichert ist! Mit eigenen Beitr&auml;gen als freier oder sp&auml;ter
vielleicht fester Redakteur f&uuml;r den AmZeiger. N&auml;heres unter <A HREF="wanted.htm">WANTED!</A><P>
Ohne einen Wiederhall wird es vielleicht keine zweite Ausgabe geben... <P>

Doch nun viel Spa&szlig; und auf ein erneutes Wiedersehen in der n&auml;chsten Ausgabe, die
in ca. zwei Monaten zu erwarten ist, wenn sich der Artikelzuflu&szlig; (hoffentlich)
einpendelt.<P>

Ihr<BR>

<TABLE ALIGN=CENTER BORDER=0>
<TR><TD ALIGN=CENTER><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A></TD><TD></TD><TD ALIGN=CENTER><A HREF="mailto:A.Schlick@BBrandes.berlinet.de">Andreas Schlick</A></TD></TR>
<TR><TD ALIGN=CENTER>Chefredakteur</TD><TD></TD><TD ALIGN=CENTER>Redakteur HTML-Ausgabe</TD></TR>
</TABLE><BR>
<U>Anmerkung zur HTML-Version:</U><BR>

Ich habe Wert darauf gelegt, da&szlig; die HTML-Version m&ouml;glichst auch mit &auml;lteren, einfacheren
Browsern gut lesbar ist und verzichtete daher auch auf diverse &quot;Spielereien&quot;
wie z.B. Frames. Desweiteren herrscht bei uns die Meinung vor, da&szlig; auch zu viele
Bilder, Screenshots und sonstige Ausschm&uuml;ckungen eher zu Ablenkung f&uuml;hren, als wirklich
dem Inhalt dienlich zu sein. Daher werden auf gro&szlig;artige &quot;Bildergalerien&quot; verzichtet,
was auch den positiven Nebeneffekt hat, da&szlig; sich die Gr&ouml;&szlig;e der AmigaGuide-Version und die der
HTML-Version nicht um eine Zehnerpotenz unterscheidet und &auml;hnlich bleibt.<P>

Und noch ein Wort zur Verzeichnisstruktur: Alle HTML-Archive werden das Verzeichnis
&quot;AmZeiger&quot; anlegen und dort hinein die Daten entpacken. Hierbei ist
zu beachten (<B>WICHTIG!</B>), da&szlig; alle vorhandenen Dateien durch die einer
neueren Ausgabe ersetzt werden! Es kann sonst zu herrlichen Problemen kommen.
Jede Ausgabe legt ein eigenes Unterverzeichnis an, dessen Name sich aus AmZ und
der Nummer der Ausgabe zusammensetzt (f&uuml;r Ausgabe 06/97 hei&szlig;t das Verzeichnis
AmZ0697). In dieses Verzeichnis werden dann alle Dateien entpackt, die auf Grund
von sp&auml;terer Veraltung, Ausgabenabh&auml;ngigkeit oder &auml;hnlichem nur f&uuml;r diese Ausgabe gebraucht
werden. Die Artikel selber landen (sortiert nach Bereichen) in eigenen
Verzeichnissen. Wer sich also z.B. die Hardware&amp;Software-Tests/Berichte
aufheben will, kann alle Verzeichnisse au&szlig;er das Verzeichnis &quot;HW&quot; und
&quot;SW&quot; l&ouml;schen und die Artikel dann &uuml;ber den Index.htm immer noch erreichen.<P>

Ihr<BR>
Andreas Schlick<BR>
Redakteur HTML-Ausgabe

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="main.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../AmZ0697/news.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY>
</HTML>

