<HTML>
<HEAD><TITLE>AmZeiger 06/97 - News</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P>
<A HREF="#Hardware">Hardware</A> <A HREF="#Software">Software</A> <A HREF="#Spiele">Spiele</A> <A HREF="#Sonstiges">Sonstiges</A>
<H2><A NAME="Hardware">Hardware</A>:</H2></CENTER><BR>
<A HREF="http://www.phase5.de">phase 5</A> will die PowerUP-Modellreihe erweitern.<P>

Das <B>Blizzard 603e</B> Powerboard soll mit einem 175 MHz 603e-PPC
ausger&uuml;stet werden. Zus&auml;tzlich wird das <B>Blizzard 603e+</B> ins Angebot
aufgenommen, welches mit 200 MHz aufwartet und einen 68040 oder 68060 gegen&uuml;ber dem
68030 des Standard-Blizzard-Boards aufnehmen kann. Beide Modelle sollen mit
integriertem Fast SCSI-II-Controller ausgeliefert werden.<BR>
F&uuml;r den Amiga 2000 wird die <B>Blizzard 2604</B> angek&uuml;ndigt. Eine PPC 604e-
Turbokarte, die mit 68040 oder 68060 als Companion-Prozessor best&uuml;ckt
werden mu&szlig;. Sie enth&auml;lt einen Wide-Ultra-SCSI-Controller.<P>
Upgradem&ouml;glichkeiten bestehen.<P>

F&uuml;r die Cyberstorm PPC und die Blizzard 2604-Karten kommt eine neue
Grafikkarte, die <B>CyberVision PPC</B> raus. Die Verf&uuml;gbarkeit ist
gleichzeitig mit der Lieferbarkeit der Blizzard 2604 im August geplant.
Die Karte ist f&uuml;r A2000/3000 und 4000 geeignet und wird speziell f&uuml;r
die Blizzard 2604 empfohlen, da deren langsamer Zugriff ins ECS-
ChipRAM bzw. auf Zorro-II-Grafikkarten die Systemperformance
empfindlich einschr&auml;nken kann. <P>

Vom Prozessor in die Grafikkarte soll ein Datendurchsatz von bis zu
100 MB/s erreicht werden, was auch die Leistung der Cyberstorm PPC
in vielen Anwendungen beschleunigt.<P>

Auch die interne Leistung der CyberVision PPC soll durch den
verwendeten <B>PERMEDIA-Chip</B>, der eine Leistung von bis zu 42 Millionen
texturierten Pixeln erreicht, enorm gro&szlig; sein. Er unterst&uuml;tzt auch
viele 3D-Funktionen, wie Z-Buffering und Gouraud-Shading usw..<P>

Die Karte wird mit 4 MB SGRAM ausgeliefert und erreicht 1280x1024 Pixel
in TrueColor bei 70 Hz Bildwiederholfrequenz.<P>

Der <B>Preis</B> betr&auml;gt 549,-- ; f&uuml;r PowerUP-Kunden 449,-- und f&uuml;r alle,
die vor dem 30.06.97 eine PPC-Karte erhalten haben 349,-- , da deren
Preise im zweiten Halbjahr auf Grund gesunkener CPU-Preise etwas
runtergehen.<P>

Dann, ab dem 01.07.97 gelten folgende empfohlene Verkaufspreise:
<P>
<TABLE ALIGN=CENTER BORDER=0>
<TR><TH COLSPAN=3>Cyberstorm PPC</TH></TR>
<TR><TD></TD><TD>Normal</TD><TD>Upgrade</TD></TR>
<TR><TD>- 150 MHz</TD><TD>DM 1295,--</TD><TD>DM 1195,--</TD></TR>
<TR><TD>- 180 MHz</TD><TD>DM 1549,--</TD><TD>DM 1595,--</TD></TR>
<TR><TD>- 200 MHz</TD><TD>DM 1795,--</TD><TD>DM 1595,--</TD></TR>
<TR><TH COLSPAN=3>Blizzard 2604</TH></TR>
<TR><TD>- 150 MHz</TD><TD>DM 1349,--</TD><TD>DM 1249,--</TD></TR>
<TR><TD>- 180 MHz</TD><TD>DM 1599,--</TD><TD>DM 1449,--</TD></TR>
<TR><TD>- 200 MHz</TD><TD>DM 1849,--</TD><TD>DM 1649,--</TD></TR>
</TABLE><BR>

Die Blizzard 603e soll 799,-- und die Blizzard 603e+ 1.049,--
kosten. Alle Preise ohne Companion-Prozessor.

<P><HR WIDTH=50%><P>

Die <B>Prelude</B>-Soundkarte von <B>A.C.T.</B>, die auf einem `Crystal Multimedia Codec` aufbaut, soll
preiswerten, aber qualitativ guten 16Bit-Sound f&uuml;r den Amiga m&ouml;glich machen. Voraussetzung ist
ein Zorro-II-Port. Sie befindet sich seit Februar in der Auslieferung. Zusammen mit
Dokumentation, Treibern (u.a. auch f&uuml;r AHI), diverser Zusatzsoftware und einer Audiolab16-Demo
kostet sie 380 DM. Im Bundle mit Samplitude inkl. Upgrade-M&ouml;glichkeit betr&auml;gt der Preis 410 DM
(Bundlepreis bis Ende Juni g&uuml;ltig!). Die Audiolab16 Prelude-Vollversion kostet 225 DM. Alle
Preise exkl. Versandkosten. Adapter f&uuml;r den Expansionsport des A500 oder 1000 auf Anfrage.
<P>
<CENTER><A HREF="http://www.act-net.com">A.C.T.</A></CENTER><P>
<HR WIDTH=100%>
<P>

<CENTER><H2><A NAME="Software">Software:</A></H2></CENTER>
<P>
Bei <A HREF="http://www.haage-partner.com"><B>Haage &amp; Partner</B></A> tut sich einiges:<P>

Laut Haage &amp; Partner sind die neuen <B>StormC-Module</B> f&uuml;r p.OS und PowerUP fertig. Mit dem
Oberfl&auml;chen-Generator <B>StormWizard</B> erstellte GUI`s k&ouml;nnen &uuml;bernommen werden. Au&szlig;erdem stellen sie
mit <B>StormPowerASM</B> einen Assembler f&uuml;r die PowerPC-Prozessoren zur Verf&uuml;gung.
<P>
H&P hat nicht nur f&uuml;r PCx die Distributorenrolle &uuml;bernommen, sondern auch f&uuml;r den neuen Renderer
(mit Animationsf&auml;higkeiten) <B>Tornado3D</B>. Neben Echtzeit-Preview, Animationsf&auml;higkeiten und vielen
eingebauten Effekten legten die Entwickler von <B>EYELIGHT</B> wert auf ein userfreundliches Interface
und hohe Geschwindigkeit.<P>

H&P peilt eine Ver&ouml;ffentlichung Ende Juni 97 zum Preis von 398 DM an. Kurz vorher soll auch eine
Demoversion erh&auml;ltlich sein.<P>

Mit <B>NetConnect</B> bringt H&P ca. im Juni ein komplettes Internet- Paket f&uuml;r den Amiga heraus.
Enthalten soll die `Internet-Suite` au&szlig;er VoyagerNG in der Version 3.0 auch einen
`professionellen TCP-Stack` (in ersten Ver&ouml;ffentlichungen war von `AmiTCP 4.5 Dialup` die Rede),
MicroDot II, AmFTP, AmIRC, AmTelnet, AmFinger, AmTerm, NetInfo und NC Controller (einer
Werkzeugleiste).<P>

Der Preis wird voraussichtlich 169 DM betragen. Bei allen Programmen handelt es sich um
Vollversionen, Updates sollen &uuml;ber den NetConnect- Support verf&uuml;gbar
sein.<P>

Mit <B>MERAPI</B> (Codename, steht f&uuml;r einen gro&szlig;en Vulkan auf Java) arbeitet Jeroen Vermeulen,
zusammen mit H&P`s Storm-Team, an einer `Java Virtual Machine`-Implementation, deren Entwicklung
Ende 1996 begonnen wurde.<P>

MERAPI soll in Web-Browser wie VoyagerNG integriert werden und ebenso als
Stand-alone-Interpreter mit eingebautem Just-In-Time-Compiler JAVA- Applikationen wie
CorelOffice for Java ausf&uuml;hren k&ouml;nnen. Damit auch auf dem Amiga Java-Programme entwickelt werden
k&ouml;nnen, soll MERAPI in das STORM-Entwicklungssystem integriert werden. Portierungen f&uuml;r p.OS und
PowerUP sind ebenfalls geplant. Fertig werden soll MERAPI im August.<P>

<CENTER><A HREF="http://www.haage-partner.com/">Haage &amp; Partner</A></CENTER>
<BR>
<HR WIDTH=50%>
<BR>
An einer zweiten JAVA-Implementation f&uuml;r den Amiga arbeitet <A HREF="http://www.finale-dev.com">Finale Development</A>
mit <B>`MOca`</B>, welcher auch sp&auml;ter f&uuml;r pOS herauskommen soll. Die Fertigstellung ist f&uuml;r das zweite Quartal 97
geplant.<P>

`MOca` ist, ebenso wie `MERAPI`, eine Java Virtual Machine mit Just In Time- Compiler, der
gegen&uuml;ber einer Standard-VirtualMachine eine Geschindigkeitssteigerung um den Faktor 10
erm&ouml;glichen soll.<P>

F&uuml;r alle die <A HREF="../Lexikon/J.htm">Java</A> noch nicht so orientiert sind, ist die kurze Erkl&auml;rung von Finale
Development recht n&uuml;tzlich, die ich schnell &uuml;bersetzt habe.<P>

Finale Development plant weiterhin einen neuen Web-Browser f&uuml;r den Amiga (und f&uuml;r p.OS) mit dem
Namen <B>`Finale Web Cruiser`</B>. Er soll neben voller Unterst&uuml;tzung des HTML 3.2-Befehlssatzes auch
Frames unterst&uuml;tzen und FTP, Mail, News und Gopher-Clients beinhalten. Nat&uuml;rlich ist die
Unterst&uuml;tzung von MOca vorgesehen, sobald dieser erh&auml;ltlich sein
wird.<P>
<CENTER><A HREF="http://www.finale-dev.com">Finale Development</A></CENTER>
<BR><HR WIDTH=50%><BR>
<A HREF="http://www.livewire.com.au/gpsoft/">GPSoftware</A> k&uuml;ndigt eine neue DOpus 5-Version mit dem Namen <B>`Magellan`</B> an. Es soll ein gro&szlig;es
Update werden, da 12 Monate Entwicklungsarbeit eingeflossen seien. Vielen Anregungen von Usern
wurde gefolgt und der Workbench-Ersatzmodus mit Startmen&uuml;, Extra-PopUp-Men&uuml;s und vielem mehr
augebohrt. Die Kompatibilit&auml;t, Grafikkartenunterst&uuml;tzung und Geschwindigkeit vieler Routinen
wurden verbessert.<P>
<CENTER><A HREF="http://www.livewire.com.au/gpsoft/">GPSoft</A></CENTER>
<BR><HR WIDTH=50%><BR>
<A HREF="http://www.oberland.com/">Oberland Computer</A> k&uuml;ndigt <B>FinalWriter 97</B> von <A HREF="http://www.softwood.com">Softwood</A> an (der Virus der
Jahreszahl-Versionsnummern greift auch hier um sich). Eins der neuen Hauptmerkmale sind
Textboxen, die neben weiteren Features, z.B. flexiblere M&ouml;glichkeiten zum Erstellen von
Zeitschriften und Brosch&uuml;ren erlauben sollen. Die deutsche Version soll bereits in der
Auslieferung sein.<P>
<HR WIDTH=25%><BR>
Die neue Version 4.1 des Renderers <B>Reflections</B> soll in K&uuml;rze auch in einer PowerUP-Version
erh&auml;ltlich sein.<P>

<CENTER><A HREF="http://www.oberland.com">Oberland Computer</A></CENTER>
<BR><HR WIDTH=50%><BR>
<B>CLOANTO</B> bringt mit <B>Personal Paint 7.1</B> wieder eine neue Version des bekannten Malprogrammes
heraus. Zahlreiche Routinen wurden &uuml;berarbeitet, die Kompatibilit&auml;t mit Utilities verbessert und
spezielle Versionen f&uuml;r die unterschiedlichen Motorola-Prozessoren
erstellt.<P>
<BR><HR WIDTH=50%><BR>
Andreas Kleinert, Programmierer von <B>SuperView</B>, hat ein Paket mit <B>PowerUP-</B> <B>PlugIn-Modulen</B>
fertiggestellt. Im Moment sind es 26 Module, die auf die existierende SView-Library aufsetzen,
weitere sollen st&auml;ndig hinzukommen.<P>

Als Beispiel f&uuml;r die Beschleunigung wurde eine 716x580 Pixel gro&szlig;e 24-Bit- Grafik mit dem
`RotateFree`-Operator um 125,3 Grad gedreht. Mit einer CyberStorm 060/50 dauerte der Vorgang ca.
21 Sekunden und mit einer CyberStorm 060/50 in Verbindung mit einem PPC 603e 150 MHz ca. 2
Sekunden.<P>

<CENTER><A HREF="http://home.t-online.de/home/Andreas_Kleinert/">Andreas Kleinerts Homepage</A></CENTER>
<P>
Eine `PreRelease` von <B>proDAD`s</B> neuem Betriebssystem <B>p.OS</B>
soll ab Mitte Juli f&uuml;r 49 DM bei Stefan Ossowskis Schatztruhe erh&auml;ltlich
sein, welche zusammen mit GTI den Vertrieb &uuml;bernommen haben. p.OS soll als
nahezu vollst&auml;ndige Version auf CD und eingeschr&auml;nkt auch auf Diskette
erscheinen, wobei der Differenzpreis auf die Endversion voll
angerechnet wird.<P>

<CENTER><A HREF="http://www.schatztruhe.de">Schatztruhe</A></CENTER>
<P>

Stefan Sommerfeld, Mitautor von MCP, arbeitet an <B>Scalos</B>, einem
Workbench- Ersatz in der Tradition von DOpus 5+. Als Unterschied zu DOpus
soll Scalos eine bessere Workbench-Emulation bieten und hat auch noch nicht
denselben Funktionsumfang. Neben verbessertem Multitasking sollen
Funktionen wie Drag&Drop und kontextsensitive Men&uuml;s den Workbench-
Alltag vers&uuml;&szlig;en.
<P>
<CENTER><A HREF="http://www.cs.tu-berlin.de/~zerocom/Aliendesign.html">Aliendesign</A></CENTER>
<P>
<HR WIDTH=100%>
<P>
<CENTER><A NAME="Spiele"><H2>Spiele:</H2></A></CENTER>
<BR>
Die durch das Edel-Pr&uuml;gelspiel `CapitalPunishment` bekanntgewordene kanadischen Entwickler von
<A HREF="http://www.clickboom.com">clickBOOM</A> und die Firma PXL ver&ouml;ffentlichen im Sommer eine Umsetzung des bisher meistverkauften
CD-ROM-Spiels <B>`Myst`</B> f&uuml;r den Amiga. 4 MB Speicher, AGA und CD-ROM-LW sind Vorraussetzung,
Grafikkarten sollen unterst&uuml;tzt werden.<P>

clickBOOM gab auch bekannt, da&szlig; ab sofort das PowerUP-Programm von phase5 voll unterst&uuml;tzt
werden soll. Es wurde eine Umfrage gestartet, welche Umsetzungen sich die Amiga-User am meisten
w&uuml;nschen. N&auml;heres unter der Web-Adresse.<P>

<CENTER><A HREF="http://www.clickboom.com">clickBOOM</A></CENTER>
<P><HR WIDTH=50%><P>

Die australischen Entwickler von <B>GeoSync Media</B> planen einige neue Spiele f&uuml;r den Amiga.
<P>
<B>`StarFighter D`Yammen`s Reign`</B> soll "der beste Weltraum-Kampf-Simulator f&uuml;r den Amiga 1200"
werden. Die ersten Bilder texturierter Raumschiffe sehen durchaus vielversprechend aus. Auch
eine Demo ist von den Web-Seiten ladbar, sie hat allerdings eine L&auml;nge von
12 Disketten!<P>

Ansonsten ist neben dem 3D-Rally-Spiel <B>`Rally Worlds`</B> auch noch <B>`Matrix Assault`</B> geplant, in
denen man ebenfalls in einer 3D-Umgebung einige Missionen aus dem Film `Tron`
nachspielen kann.<P>

<B>`H.A.R.D. Corps`</B> soll `eine total schamlose Kopie von Command & Conquer`, aber f&uuml;r den Amiga"
werden. Splitted Screens und Netzwerk-Spiele &uuml;ber Seriell oder Internet sollen auch m&ouml;glich
sein.<P>

<CENTER><A HREF="http://www.ozemail.com.au/~geosync/">GeoSync Media</A></CENTER>
<P><HR WIDTH=50%><P>
<B>Digital Anarchy Software</B> (DAS), arbeitet an dem Spiel <B>EXPLORER 2260</B>. Es soll die Antwort auf
`Frontier ELITE III: First Encounters` werden, mit &uuml;ber 100 Schiffen, 1000 m&ouml;glichen Upgrades,
3D-Ploygongrafik und komplexen Missionen.<BR>
<P><HR WIDTH=50%><P>
<B>VULCAN</B>, eine der emsigsten kommerziellen Spielefirmen f&uuml;r den Amiga, haben einige Spiele in der
Planung. Auf Disk: <B>Final Odyssey</B>, <B>Pinball</B> <B>Brain Damage</B>,
<B>Valhalla & the Charms of King Paul</B>.<P>

Auf CD: <B>Strangers</B> (ein Pr&uuml;gelspiel), <B>Uropa2-The Ulterior Colony</B>, <B>Wasted Dreams</B>, <B>Hell Pigs</B>,
<B>Genetic Species</B> (DUMM-Clone ;), <B>Breed 2001</B> (Nachfolger des bekannten PD-Spiels) und <B>Scions Of A
Forgotten World</B>. Genauere Informationen, wie z.B. Erscheinungsdaten sind
noch kaum erh&auml;ltlich.<P>
<CENTER><A HREF="http://www.vulcan.co.uk/">Vulcan</A></CENTER>
<P><HR WIDTH=50%><P>
<B>Sadeness</B>, bekannt durch CD-ROM-Vertrieb, hat den Programmierer des neuen Strategiespiels
<B>Foundation</B> Paul Burkey unter Vertrag genommen und will sein Spiel gegen Ende des Jahres
ver&ouml;ffentlichen. Im Aminet waren bereits vielversprechende Landschaftseditoren f&uuml;r Foundation
ver&ouml;ffentlicht worden, das eine gelungene Mischung aus Siedler, Warcraft_II, Command and
Conquer, Populous und Mega-Lo-Mania zusammen mit vielen neuen Ideen werden soll. Mehrspielermodi
sind ebenso geplant wie CyberGrafX-Unterst&uuml;tzung u.v.m. Zuerst soll eine CD-ROM-Version
erscheinen. Bis jetzt sollen etwas 70 Prozent des Spieles fertiggestellt
sein.<P>
<CENTER><A HREF="http://www.sadeness.demon.co.uk">Sadeness</A></CENTER>
<P>
<HR WIDTH=100%>
<BR>
<CENTER><H2><A NAME="Sonstiges">Sonstiges:</A></H2></CENTER>

Laut dem US-Nachrichtenmagazin TIME soll der PC-Weltmarktf&uuml;hrer <B>Compaq</B> angeblich geplant haben
<B>Gateway 2000</B> zu schlucken. Wenige Stunden vor Bekanntgabe des 7-Milliarden-Dollar-Deals h&auml;tte
Gateway-Chef Ted Waitt die Notbremse gezogen, weil er seine F&uuml;hrungsmannschaft nicht dem
Compaq-Management unterordnen wollte. Gateway 2000 ist nach der Firma Dell der zweitgr&ouml;&szlig;te
PC-Direktversender der Welt.<P>
<HR WIDTH=50%><P>

<B>Gateway 2000</B> konnte im ersten Quartal 97 den zweitgr&ouml;&szlig;ten Konzerngewinn in der Firmengeschichte
verbuchen: 67,5 Millionen US-Dollar. Der Umsatz stieg im selben Zeitraum um 24% auf 1,42
Milliarden US-Dollar. <P>

Nebenbei bemerkt wird neuerdings auch an der New Yorker B&ouml;rse mit Gateway 2000-Aktien
gehandelt. <P>
<CENTER><A HREF="#Top">Top</A></CENTER>
<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="About.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="Web_Adv.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY>
</HTML>

