<HTML>
<HEAD><TITLE>AmZeiger 06/97 - Feedback</TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U>Der alte Postsack</U></H1><BR>von<BR><A HREF="mailto:AmZeiger@BBrandes.berlinet.de">AmZeiger</A><P></CENTER>

<B>Von:</B> <A HREF="mailto:Th_Schulze@BBrandes.berlinet.de">Th_Schulze@BBrandes.berlinet.de</A><P>
<PRE>
TS> Hallo Leutz,
TS>
TS> ich wei&szlig; zwar nicht ob Euch Kommentare der folgenden Art interessieren,
TS> aber da ich mich gerne am Amzeiger-Projekt beteiligen w&uuml;rde, schicke ich
TS> Euch mal den Text, den ich sonst in ein &ouml;ffentliches Brett gepostet h&auml;tte:

Jawoll, ja! Wir interessieren uns immer f&uuml;r pers&ouml;nliche Eindr&uuml;cke
unserer Klientel. Deswegen startet diese Messi auch die allererste
Postsack-Rubrik der allerersten AmZeiger-Ausgabe!

TS> <B>Sorgen...</B>
TS> mu&szlig; man sich machen um die Heftst&auml;rke der neuen Ausgabe der Amiga-Special.
TS> Bislang waren 100 Seiten die Schmerzgrenze. Diese Grenze ist nach unten
TS> durchbrochen.
TS>
TS> Jederman wei&szlig;, da&szlig; der redaktionelle Teil der Amiga-Zeitschriften w&auml;chst
TS> oder schrumpft mit der Anzahl der gut verkauften Werbeseiten. Nicht so
TS> sehr mangelnde Leserschaft, als ausbleibende Anzeigen haben f&uuml;r die
TS> Unwirtschaftlichkeit bereits toter Magazine gesorgt.
TS>
TS> Von dieser Seite gesehen, darf man AmigaSpecial sicher nicht kritisieren.
TS> Wieso man den redaktionellen Teil jedoch mit seitenweisen A320-Karten
TS> f&uuml;llen mu&szlig;, bleibt mir verborgen. Wie gesagt, die potentiellen Werber
TS> werden weniger .. und was sollen sie auch bewerben ? Amiga Special (und
TS> noch mehr AmigaPlus) werben dann eben st&auml;rker f&uuml;r die eigenen Produkte
TS> und werten damit zumindest rechnerisch die eigene Bilanz als Teil des
TS> Verlages auf - wir wollen hoffen da&szlig; Gateway dem Markt neue Impulse
TS> verleihen kann, damit den Beiden nicht die Luft ausgeht.
TS>
TS> <B>Den Nagel auf den Kopf getroffen ..</B>
TS> hat die ASpecial zumindest mal wieder mit dem Artikel "ShapeShifter und
TS> Spiele" auf Seite 94 (also ganz am Ende ;-)
TS>
TS> Den Hinweis "Sie sollten mal einen Blick &uuml;ber den Zaun riskieren und
TS> sehen, wie Sie ihre Spielesammlung mit Hilfe des Mac-Emulators
TS> Shapeshifter erweitern k&ouml;nnen" wird man sicher so leicht in keinem
TS> anderen AmigaMagazin lesen.
TS>
TS> Und in der Tat ist das DIE Alternative f&uuml;r Besitzer von 040/060 Maschinen
TS> MIT Grafikkarte, wenn sie nach wie vor, hin und wieder, ein aktuelles
TS> Spiel auf Ihrem Rechner spielen wollen.
TS>
TS> Aber die Sache hat noch einen intersessanten Nebeneffekt!
TS> Zitat "SimCity 2000 spielt sich auf dem ShapeShifter wesentlich fl&uuml;ssiger
TS> und komfortabler als auf dem Amiga. Durch eine hohe Aufl&ouml;sung von 1024*768
TS> beh&auml;lt man auch leichter die &Uuml;bersicht." Und das ist wahr und es zeigt was
TS> auf dem 68K-Amiga m&ouml;glich ist !
TS>
TS> Es zeigt aber auch wie veraltet eben die Grafikchips des Amigas sind.
TS> Alles ruft nach dem PowerPC (mit Recht), aber das ist nur die halbe Wahrheit.
TS>
TS> "Wer sich die Spiele mal ansieht, wird sofort den Unterschied zu
TS> Flugsimulatoren wie Tornado oder dem neuen Jetpilot am Amiga feststellen.
TS> Bei vierfacher Aufl&ouml;sung (640*480) laufen beide Mac-Spiele mit bis zu 20
TS> Bildern pro Sekunde ab, und bei dem gegebenen Realismus kommt wirklich
TS> Fluggef&uuml;hl auf. .."
TS>
TS> .. und das Schlu&szlig;endlich auf einem (Shape) - Amiga.
TS>
TS> Thomas Schulze
</PRE>
<BR>
Danke Dir, Thomas Schulze f&uuml;r Deine Eindr&uuml;cke!<P>

Zu der Sache mit den Werbeeinnahmen die die Zeitungen finanzieren:
Manchmal habe ich den Eindruck, das einfach gar kein Wille mehr
vorhanden ist, deutlich erkennbar am Beispiel MagnaMedia mit
seinem Amiga-Magazin. Die langj&auml;hrigen alteingestandenen Redakteure
wandern zu, im eigenen Verlag als wichtiger bewerteten Magazinen ab,
ohne das auch nur eine Notiz oder ein Kommentar dar&uuml;ber informiert.
Trotz erh&ouml;htem Preis sinkt die Seitenzahl auf einen kl&auml;glichen
Umfang, dessen redaktioneller Inhalt schon beinahe jeder
Beschreibung spottet. Aber was ist das? Keine Einnahmen durch
Werbung? Vorne mehrere Vollfarbseiten Werbung und nach dem
angeblichen Heft im Heft (Amiga-Games) kommen nur noch zahlreiche
Seiten Werbung und dann die Vorschau auf das n&auml;chste Heft.
Dabei mu&szlig; man wissen, das Werbeseiten im Verlag f&uuml;r alle
Publikationen einen Einheitspreis haben! Da der Absatz meines
Wissens auch nicht wesentlich zur&uuml;ckgegangen ist, kann das nur
bedeuten, da&szlig; im Verlag eine ungerechte Umverteilung der
Finanzen eben nicht nach dem Prinzip `jeweilige Werbeeinnahmen
schlagen sich in der Anzahl der Seiten mit redaktionellem Inhalt
nieder` erfolgt.<P>
In Sachen Shapeshifter: Das kann sicher die gr&ouml;&szlig;te Not einiger
lindern. Aber ob das wirklich eine L&ouml;sung der Probleme darstellt...
Das Shapeshifter eine Glanzleistung der Emulationen darstellt
und damit auch den Amiga gut pr&auml;sentiert, ist kaum noch einer
Erw&auml;hnung wert (erw&auml;hne ich aber trotzdem ;) <P>
Ups, jetzt ist mein Kommentar fast so lang, wie der oben, was
eigentlich auch nicht unbedingt Sinn dieser Rubrik sein soll, aber
f&uuml;r die erste Ausgabe mu&szlig; dieser Raum ja gef&uuml;llt werden und das
mu&szlig;te einfach mal gesagt werden. ;))<P>
In diesem Sinne und in Hoffnung auf viele interessante Meinungen
und Kommentare von Euch zum Amiga und AmZeiger f&uuml;r diese Ecke
verbleibt,
<P>
Euer<BR>
<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Alter Postsack</A>.

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="../KW/WB_Tun1.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="Media.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
</BODY>
</HTML>
