<HTML><HEAD>
<TITLE>AmZeiger 06/97 - Neues aus dem Netz</TITLE>
<META NAME="keywords"    CONTENT="Amiga,Magazin,Computer">
</HEAD>
<BODY BACKGROUND="../images/BG.gif">
<H1><CENTER>Spidermans Web-Abenteuer</H1><BR>
von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A></CENTER>
<P>

<U>Hinweis:</U> F&uuml;r diese regelm&auml;&szlig;ige Rubrik k&ouml;nnten wir noch einen Redakteur
gebrauchen! Wer Lust hat und &ouml;fter Kreuz und Quer durchs Web `surft`, der
<A HREF="wanted.htm">melde</A> sich bitte! <P>

Und wieder bin ich zur&uuml;ckgekehrt aus den unendlichen Weiten des Internet, um Euch
zu berichten. :) Dieses Mal von einigen der wichtigsten Anlaufpunkten f&uuml;r den
Amiga-Fan.<P>
<TABLE BORDER=0 ALIGN=CENTER>
<TR><TD><A HREF="#AmigaWebDir">AmigaWebDirectory</A></TD><TD><A HREF="#Phase5">Phase 5</A></TD><TD><A HREF="#PIOS">PIOS</A></TD><TD><A HREF="#proDAD">proDAD</A></TD><TD><A HREF="#HaagePartner">Haage &amp; Partner</A></TD></TABLE>
<HR WIDTH=75%>

<CENTER><H2><A NAME="AmigaWebDir">Amiga Web Directory</A></H2></CENTER>
<BR>

Die wichtigste Site f&uuml;r Amiga-Freaks, die orientierungslos eine Internet- Sitzung
starten wollen, ist sicherlich die des <A HREF="http://www.cucug.org/amiga.html">AmigaWebDirectories</A>
vom CUCUG-Club in den USA.<P>

In einem netten Outfit werden hier Unmengen an Informationen zum Amiga und
zahlreiche Links zu allem, was mit dem Amiga zu tun hat, angeboten. Ob private
Entwickler, Demogruppen, Firmen oder Seiten von Anwendern, fast alle sind hier
verzeichnet und &uuml;ber die eingebaute Suchmaschine <A HREF="http://www.cucug.org/agnes.html">`AGNES`</A>
auch komfortabel zu finden.<P>
Viele Listen nach speziellen Rubriken sind bereits vorbereitet und die jeweiligen
Links komfortabel anzuspringen. F&uuml;r den regelm&auml;&szlig;igen Zugriff aber am
interessantesten sind die, auch an Wochenende und Feiertagen immer UpToDate
gehaltenen News, mit Presseerkl&auml;rungen, Messeberichten und Infos, die auf dem
Server gepuffert sind.<P>
Dann aber sollte man auch einen Blick auf die `New Links`-Seite werfen, da hier
nicht nur `irgendwelche` neuen Links aufgenommen werden, sondern auch oft neue
Informationsquellen zu finden sind. Alles, was nicht auf dem CUCUG-Server selbst
gepuffert ist.<P>
Nat&uuml;rlich wird hier, wie eigentlich generell im internationalen Amiga- Webbereich
ein durchschnittliches Englisch vorausgesetzt. F&uuml;r alle, die Probleme beim Zugriff
in die USA haben, stehen gen&uuml;gend Mirrors u.a. in Polen und Gro&szlig;britannien zur
Verf&uuml;gung.<P>
<TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>Amiga Web Directory</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.cucug.org/amiga.html">http://www.cucug.org/amiga.html</A></TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>MITTEL</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>GUT</TD></TR>
<TR><TD>Design</TD><TD>GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>SEHR GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TD>SEHR GUT</TD></TR>
</TABLE></CENTER><BR>
<HR WIDTH=75%>

<CENTER><H2><A NAME="Phase5">Phase 5</A></H2></CENTER><BR>
Als n&auml;chstes steht die Website von <A HREF="http://www.phase5.de/">phase5</A> an. Sie hat sich vor einiger Zeit einem
gro&szlig;en Facelifting unterzogen. Nach der Einstiegsseite, in der man zwischen
deutsch und englisch w&auml;hlen kann, folgt die neue Hauptseite.<P>

Vom &auml;sthetischen Standpunkt aus gesehen, mu&szlig; ich sagen, da&szlig; mir das alte Design
einen Tick besser gefallen hat. Allerdings scheint die Aussage von der
Bandbreitenoptimierung zuzutreffen, da sich die Ladezeiten wesentlich verk&uuml;rzt
haben.<P>

N&uuml;tzlich auf der Hauptseite ist die Angabe des Datums der letzten &Auml;nderung an den
Seiten und auch in welchem Bereich. Da wei&szlig; man sofort, ob man sich gleich wieder
verabschieden kann.<P>

Ansonsten d&uuml;rfte mit den Produktinfos, dem Bereich f&uuml;r techn. Support (Anwender),
Entwicklersupport und H&auml;ndlersupport f&uuml;r jeden phase5- Interessenten etwas dabei
sein.<P>

Der neu erstellte `&Uuml;ber phase5`-Bereich ist zumindest des einmaligen Anschauens
wert, wie ich finde, denn so bekommt man doch einmal einen gewissen Eindruck, wie
es eigentlich wirklich aussieht, bei einer der wichtigsten Amiga-Firmen der
letzten Jahre (trotz vieler Kritik ein wohl unbestreitbares Faktum). Zahlreiche
kleine Bilder vermitteln einen Eindruck vom Geb&auml;ude, den B&uuml;ros und den
Mitarbeitern bei der Arbeit.<P>

Wichtiger f&uuml;r den Wald und Wiesen-Anwender ist sicher sein Supportbereich. Hier
kann man neben den Frequently Asked Questions, den am h&auml;ufigsten gestellten Fragen
(und nat&uuml;rlich ihren Antworten :) auch eine Produkt- Errata abrufen mit einer
Aufstellung bekannter Probleme. Jumper-Belegungen und eine SoftwareSupport-Ecke,
von der man Treiber etc. f&uuml;r die p5-Hardware laden kann, runden diesen Bereich
ab.<P>
<TABLE ALIGN=CENTER BORDER=1>
<CAPTION>Phase 5 - Webseite</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.phase5.de">http://www.phase5.de</A></TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>KURZ</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Design</TD><TD>GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TD>GUT</TD></TR>
</TABLE></CENTER><BR>
<HR WIDTH=75%>
<CENTER><H2><A NAME="PIOS">PIOS</A></CENTER></H2>
Nun zu <A HREF="http://www.pios.de/">PIOS</A>. Nicht direkt eine Amiga-Firma, aber sicherlich doch interessant, wenn
man die Entwicklung anderer Alternativen verfolgen m&ouml;chte.<P>

K&uuml;rzlich fand eine vollst&auml;ndige Umkrempelung der Web-Site durch einen finnischen
Web-Designer statt, was nach der wirklich ziemlich schlechten Pr&auml;sentation und der
geringen Aktualit&auml;t auch dringend erforderlich war.<P>

Nichtdestotrotz waren die Zugriffszahlen der Internet-Reisenden Rekordverd&auml;chtig,
was aber sicherlich auch darauf zur&uuml;ckzuf&uuml;hren ist, da&szlig; sie nicht die Hoffnung
aufgaben und immer wieder geschaut haben, ob sich hier denn nun endlich mal was
tat.<P>

Tats&auml;chlich wurde ich dann eines Tages nicht entt&auml;uscht. &Uuml;bersichtliches und
h&uuml;bsches Design und auch detailliertere Informationen, in Zukunft sicherlich auch
auf dem Stand gehalten, stillen einigerma&szlig;en den Informationshunger, der ja so
viele Web-Reisende kennzeichnet.<P>

Allerdings waren die deutschen Seiten noch nicht fertig, was sicher daran liegt,
da&szlig; der neue WebDesigner da auf die Mithilfe seiner deutschen Kollegen angewiesen
ist. Das Design ist au&szlig;erdem in den Farben des sehr eigenen PIOS-Logos
ausgerichtet und leidet ein wenig unter dieser Vorgabe.<P>

Obwohl sicherlich von nur geringem Nutzen, ist der Besuch dieser Site auch
einmal ganz interessant.<P>
<TABLE BORDER=1 ALIGN=CENTER>
<CAPTION>PIOS - Webseite</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.pios.de">http://www.pios.de</A></TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>MITTEL</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Design</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>MITTEL</TD></TR>
<TR><TD>Seitenpflege</TD><TD>k. A.</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TD>GUT</TD></TR>
</TABLE></CENTER>
<HR WIDTH=75%>

<CENTER><H2><A NAME="proDAD">proDAD</A></H2></CENTER><BR>
Welches Thema bewegt die Amiga-Anh&auml;ngerschaft im Moment noch? pOS, das neue
Betriebssystem der Firma <A HREF="http://www.prodad.de">proDAD</A> sicherich.
<P>
Das ist nat&uuml;rlich ebenfalls ein Grund, einmal auf deren Web-Seiten
vorbeizuschauen, au&szlig;er, wenn man auch Kunde anderer proDAD-Produkte ist.
<P>
Leider mu&szlig; man dazu sagen, da&szlig; diese Web-Site ziemlich schlecht gepflegt ist,
zumindest was die Aktualit&auml;t angeht. Nur sehr selten tut sich etwas und dann meist
eher wenig. Es kann vorkommen, da&szlig; Monate ohne &Auml;nderung vergehen. Schlecht also
f&uuml;r Info-Junkies, denn das Interesse ist gro&szlig;.
<P>
Vom Design her herrscht leider auch eher Un&uuml;bersichtlichkeit vor, obwohl die
Seiten nicht h&auml;&szlig;lich sind. Wie gesagt, mehr Pflege w&uuml;rde hier sicher mehr draus
machen k&ouml;nnen.
<P>
<TABLE ALIGN=CENTER BORDER=1>
<CAPTION>proDAD - Webseite</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.proDAD.de">http://www.proDAD.de</A></TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>MITTEL</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>MITTEL</TD></TR>
<TR><TD>Design</TD><TD>MITTEL</TD></TR>
<TR><TD>Nutzen</TD><TD>GERING</TD></TR>
<TR><TD>Seitenpflege</TD><TD>SCHLECHT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TD>DURCHSCHNITTLICH</TD></TR>
</TABLE></CENTER>

<HR WIDTH=75%>

<CENTER><H2><A NAME="HaagePartner">Haage &amp; Partner</A></H2></CENTER><BR>
Nun zum letzten Punkt f&uuml;r heute: der Web-Site von
<A HREF="http://www.Haage-Partner.com">Haage&amp;Partner</A>. Eine der
wichtigsten Entwicklungsfirmen im Moment f&uuml;r den Amiga, aber auch wichtiger
Distributor von Programmen, wie PCx und Tornado3D.<P>

Nun zum letzten Punkt f&uuml;r heute: der Web-Site von <B>Haage &amp; Partner</B>.
Eine der wichtigsten Entwicklungsfirmen im Moment f&uuml;r den Amiga, aber auch
wichtiger Distributor von Programmen, wie PCx und Tornado3D.
<P>
Zum ersten f&auml;llt (und das nicht positiv) die lange Ladezeit auf. Das liegt
sicherlich auch an der recht gro&szlig;en Anzahl von Bildern und dergleichen
Designelemente.
<P>
Man startet nach der Sprachauswahl auf einer Newsseite auf der wieder
(sehr lobenswert) auf einen Blick erkennbar wird, wann etwas ge&auml;ndert
wurde. Hier sieht es, wenn man erstmal das Laden der vielen Bilder und
einiger kleiner Animationen abgewartet hat, gar nicht schlecht aus,
ja das Design wirkt recht h&uuml;bsch.
<P>
Bei n&auml;herem Betrachten der gesamten Web-Site wird allerdings klar, da&szlig;
die Untergliederung etwas inkonsequent ist, ja viele Dinge absolut
unn&ouml;tigerweise doppelt und dreifach erreichbar sind. Z.B. werdenn bei den
Produkten die einzelnen Programme aufgelistet, jeweils mit Links zu
Pressestimmen und Demo-Download. Es gibt aber auch eine der Produkteseite
gleichgestellte Presseseite und ebenso eine Download-Seite, auf die im
Endeffekt von anderen Bereichen aus immer hinverwiesen wird.
<P>
Immerhin werden Neuigkeiten schnell eingebunden und die Informationen
sind meist ausreichend ausf&uuml;hrlich. Zu den meisten Programmen lassen
sich, wie erw&auml;hnt Demos herunterladen.
<P>
<TABLE ALIGN=CENTER BORDER=1>
<CAPTION>Haage&amp;Partner - Webseite</CAPTION>
<TR><TD COLSPAN=2><A HREF="http://www.Haage-Partner.com">http://www.Haage-Partner.com</A></TD></TR>
<TR><TD>Frames ?</TD><TD>NEIN</TD></TR>
<TR><TD>Ladezeit</TD><TD>LANG</TD></TR>
<TR><TD>&Uuml;bersicht</TD><TD>MITTEL</TD></TR>
<TR><TD>Design</TD><TD>SEHR GUT</TD></TR>
<TR><TD>Nutzen</TD><TD>GUT</TD></TR>
<TR><TD>Seitenpflege</TD><TD>GUT</TD></TR>
<TR><TD COLSPAN=2></TD></TR>
<TR><TD>INSGESAMT</TD><TD>GUT</TD></TR>
</TABLE></CENTER>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN=LEFT><A HREF="News.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="WOA0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
