<HTML>
<HEAD><TITLE>AmZeiger 06/97 - WOA`97 </TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif">
<CENTER><H1><U>World Of Amiga 97<BR>Pressekonferenz</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrandes.berlinet.de">Gregor Franz</A></CENTER><P>

<B>Nach</B> einigen Besitzern bzw. M&ouml;chtegern-Besitzern des Amiga ist nun
Gateway 2000 als die neue Mutterfirma am Zug. Wurde ein neues Kapitel
in der Amiga-Story von Pleiten, Pech und Pannen aufgeschlagen?
<P>
Diese Frage sollte die erste offizielle Pressekonferenz des neuen
Besitzers auf der Londoner Amiga-Messe am 16.Mai kl&auml;ren.
<P>
Wie nicht anders zu erwarten, wurde sie nur unzureichend beantwortet.
Ob das daran lag, da&szlig; Gateway 2000 sich noch nicht wirklich im Klaren
ist, was sie mit dem Amiga anfangen sollen oder konkrete Entscheidungen
noch nicht gefallen sind, bleibt im Dunkeln.<P>

Die Rede wurde vom neuen/alten Gesch&auml;ftsf&uuml;hrer von AMIGA, Petro
Tyschtschenko gehalten, dessen &Uuml;berwasserhalten der Dreimannfirma i.K
(im Konkurs) durchaus anerkennenswert ist.<P>

Nach den Standard-`Belobigungen` der Amiga-Gemeinde werden die
Schwierigkeiten der ESCOM-Konkurszeit erw&auml;hnt und der neue Besitzer
Gateway 2000 als potentes und solides Unternehmen dargestellt.<P>

<B>Nun zu den Fakten:</B> Aus rechtlichen Gr&uuml;nden wurde AMIGA International
Inc. als in den USA ans&auml;ssiges Unternehmen neugegr&uuml;ndet. Es wird als
Tochterfirma von Gateway 2000 operieren und zwar von dem neuen B&uuml;ro
in Langen aus, in der N&auml;he des Frankfurter Flughafens gelegen. Drei
Angestellte f&uuml;r Verkauf, Marketing und Verwaltung sind f&uuml;r dort
vorgesehen.<P>

Seit Anfang April k&uuml;mmern sich in Braunschweig vier Angestelte um
Logistik, Lager- und Bestellwesen, Support, Internet und technischen
Service. Ein weiterer Mitarbeiter soll als Leiter der Produktentwicklungsabteilung
eingestellt werden.<P>

Alles in allem also nicht gerade &uuml;berw&auml;ltigend, zumindest im Moment.<P>

Die Ziele gehen zwar in die richtige Richtung, sind aber zu unkonkret.
Die Aussagen sind nach der langfristigen Ank&uuml;ndigung der Pressekonferenz
eher entt&auml;uschend undetailliert. Allgemeine Erkl&auml;rungen im Stil von
"Alles wird besser" haben wir sicherlich schon tausendmal geh&ouml;rt,
ohne Taten folgen zu sehen.<P>

Bleibt zu hoffen, da&szlig; das nicht auf diesen neuerlichen Anlauf
zutreffen m&ouml;ge. Nachfolgend Zitate des Wesentlichen:<PRE>
PT> <B>Worauf werden wir uns konzentrieren?</B>
PT>
PT> 1. Die bestehenden AMIGA-Anwender unterst&uuml;tzen.
PT> 2. St&auml;rkung der AMIGA Technologie durch umfassende Lizenzverteilung
PT> 3. Unterst&uuml;tzung bei Entwicklungen neuer Produkte, die auf den
PT>    basierenden Standards des Homecomputer- und des Video-/Grafik-
PT>    Marktes beruhen."

Das Vielversprechendste sind die Andeutungen zur <B>neuen Lizenzpolitik</B>,
die nachfolgend etwas genauer ausgef&uuml;hrt wurden:

PT>&#183; Zusammenarbeit mit Entwicklern mittels Konzepten wie etwa der
PT>  <B>"Open AMIGA Initiative"</B>, welche mit Hilfe vieler prominenter
PT>  Namen der AMIGA Gemeinde gegr&uuml;ndet wurde.
PT>
PT>  Die Basis des Erfolgs in diesem Projekt ist es, mit Partnern
PT>  zusammenzuarbeiten und einen gemeinsamen Weg der Entwicklung
PT>  festzulegen. Der AMIGA-Markt kann sich keine Teilung leisten,
PT>  wir m&uuml;ssen zusammen in eine Richtung gehen.

Tats&auml;chlich das, was die Amiga-Anh&auml;nger im Moment am meisten besch&auml;ftigt.

Alleine kann eine neuen Firma, die AMIGA ja wieder einmal ist, auch wenn
sie Eigner der Rechte ist, den Entwicklungsvorsprung von Drittfirmen
nicht mehr aufholen, selbst wenn sie, was ich nicht glaube, gro&szlig;e
Ressourcen f&uuml;r diesen Bereich aufwenden w&uuml;rde.

Selbst die Drittfirmen kommen m&ouml;glicherweise zu sp&auml;t f&uuml;r die gro&szlig;e
Wende, inbesondere wenn sich der verkleinerte bestehende Markt zwischen
ihnen noch weiter aufsplittet. Vern&uuml;nftige (!) Lenkung in eine gemeinsame
Richtung k&ouml;nnte viel bewirken.

PT> Um den Markt am Leben zu halten, ist es f&uuml;r uns notwendig, vielen
PT> Firmen durch Lizenzvergabe Produktentwicklungen zu erm&ouml;glichen.
PT> Unsere Lizensierungspolitik wird sehr offen und umfassend sein und
PT> sich auf die Lizensierung des Standard-Betriebssystems, die Chipsets
PT> und die Warenzeichen konzentrieren.
PT>
PT> Au&szlig;erdem wird die Lizensierung es erm&ouml;glichen, den AMIGA in viele
PT> verschiedene Anwendungsgebiete, wie z.B. medizinische L&ouml;sungen,
PT> Simulations-Anwendungen, Fitnessger&auml;te, Bew&auml;sserungssysteme, Kiosk-
PT> Terminals usw. vorzudringen.
PT>
PT> Nat&uuml;rlich sind wir auch auf der Suche nach neuen Partnern.
PT>
PT> Durch Lizensierung und gezielte Entwicklungsarbeit, gef&uuml;hrt von
PT> AMIGA International, planen wir, den Markt bei der Entwicklung neuer
PT> Produkte zu unterst&uuml;tzen. Zur Zeit erkunden wir viele der neuen
PT> m&ouml;glichen Produkte, die an uns herangebracht wurden, wie etwa ein
PT> Betriebssystem-Upgrade und neue Hardware-Plattformen. Wir m&ouml;chten
PT> das Verfahren dabei so einfach wie m&ouml;glich halten.
PT>
PT> Wir m&uuml;ssen mit Technologie-Unternehmen des AMIGA Marktes im regen
PT> Know-How-Austausch bleiben.
PT>
PT> Es ist au&szlig;erdem wichtig, da&szlig; wir an einer offenen AMIGA Plattform
PT> arbeiten, die Industrie-Standard-Komponenten verwendet, um g&uuml;nstiger
PT> produzieren, schneller entwickeln und einfacher aufr&uuml;sten zu k&ouml;nnen.

Viel ist dem nicht mehr hinzuzuf&uuml;gen. Denn genau dies ist schon seit
einiger Zeit der Wunschtraum jedes Realisten im Amiga-Lager.

Offene unb&uuml;rokratische Lizensierung, sowie sanfte und vern&uuml;nftige
Lenkung der Entwicklung in geregelten Bahnen. Voraussetzung ist die
Professionellit&auml;t der Entscheider, die an einem Tisch sitzen m&uuml;ssen.

<B>Bleibt zu hoffen das tats&auml;chlich folgendes passiert:</B>

PT> All diese Dinge m&uuml;ssen schnell, aber auf eine gut gef&uuml;hrte Art und
PT> Weise geschehen.

Wir werden zwangsl&auml;ufig alle Zeugen der weiteren Entwicklung werden,
so wie wir die, als nicht anders, als dramatisch zu beschreibenden
Geschehnisse der letzten Jahre um den Amiga verfolgten.

Spannend ist es allemal, aber wird es auch ein Happy-End geben?
</PRE>
<BR><HR WIDTH=25%><BR>
&Uuml;brigens wurde an einem Stand eine Version des von Ocean nie herausge-
brachten <B>Flugsimulators TFX</B> auf einem Amiga vorgef&uuml;hrt. Wer wei&szlig;,
welche Spiele noch in irgendwelchen Kammern vergraben sind, weil
die Vertriebsfirmen sich keinen Profit versprachen.
<BR><HR WIDTH=25%><BR>
<B>Micronik und <A HREF="http://www.phase5.de">phase5</A></B> pr&auml;sentierten den <B>A1500-150 PPC</B> und 200 PPC. Dabei
handelt es sich um Microniks Infinitiv-Tower mit A1200-Motherboard und
Zorro-III-Tochterplatine zusammen mit phase5 Blizzard PPC-Turbokarten,
die mit 150 bzw. 200 MHz getaktet sind.<P>
Knackpunkt dabei: Lieferbarkeit und Preis. Wenn beides akzeptabel ist,
so ist dies sicher ein richtiger Schritt.<P>
Siehe auch den ausf&uuml;hrlichen <A HREF="WOA97Rep.htm">&quot;WOA 97-Bericht&quot;</A> unseres Reporters.
                           

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN =LEFT><A HREF="Web_Adv.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="../AmZ0697/WOA97Rep.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
