<HTML><HEAD><TITLE>AmZeiger 06/97 - WOA`97 </TITLE></HEAD>
<BODY BACKGROUND="../images/BG.gif"><CENTER>
<H1><U>World Of Amiga 97-Report</U></H1><BR>von<BR><A HREF="mailto:frankm@glo.be">Frank `BF' Mosch</A></CENTER><P>

<BLOCKQUOTE>
<B>Danke</B> an Frank Mosch, der exklusiv f&uuml;r uns diesen ausf&uuml;hrlichen Bericht schrieb. &Uuml;bersetzt aus dem Englischen von Gregor Franz.
</BLOCKQUOTE>

<B>London, 17.Mai 1997</B><P>

<B>Vor</B> dem Eingang der Veranstaltungshalle des Novotel Hammersmith in London
versammelten sich viele Leute f&uuml;r die zweite World Of Amiga. Diese
ungeduldig erwartete Veranstaltung zieht, da sie (eine der) nur auf das
Amiga Publikum spezialisierte Messe ist, so viele Leute an, das sich zwei
Schlangen bildeten.<P>

Die eine gr&ouml;&szlig;ere, mit Leuten, die ihre Karten vorbestellt hatten und die
andere aus Leuten, die sich erst welche kaufen mu&szlig;ten. Ein paar Minuten
nach Zehn werden die T&uuml;ren ge&ouml;ffnet und die zwei Schlangen bewegen sich
hinein. Als die Leute, die bereits Tickets haben, sie am Eingang hoch-
halten, bewegt sich ihre Schlange schneller und es braucht nicht allzu
lange, bis schlie&szlig;lich jeder drinnen ist. Einmal in der Halle, ist das
Erste, was auff&auml;llt, da&szlig; es ein ziemlich kleiner Veranstaltungsort ist,
aber der Amiga ist wohl nicht so ein gro&szlig;es Format.<P>

Einer der am ungeduldigsten erwarteten St&auml;nde, ist der von <B>'Amiga
International/Gateway'</B>, der gr&ouml;&szlig;te ringsum. Er ist rund um ein `B&uuml;ro`
gebaut, in welchem Petro Tyschtschenko sich mit interessierten
Gesch&auml;ftskunden/-partnern unterh&auml;lt.<P>

Der normale User konnte ihn nicht treffen, da er zu besch&auml;ftigt war, aber
es gab ein Blatt, auf dem Fragen beantwortet wurden. Das interessanteste
Merkmal des Standes waren die zahlreichen Tower-Amigas. Nein, keine
A4000-Tower, sondern (basierend auf?) <B>Infinitiv-Tower mit Namen, wie
A1300 und A1500</B>. K&ouml;nnte dies bedeuten, da&szlig; der n&auml;chste `neue` Amiga auf
diesen Towers basieren wird? Die Zeit wird es zeigen...<P>

Sie lie&szlig;en keine spezielle Software laufen, nur WB3.1 auf den meisten.
Zumindest hatten sie eine CyberVision-Grafikkarte und ein F&uuml;lle (130 MB)
von RAM. Also nicht viel Neues von Amiga International bis jetzt, au&szlig;er
ein paar staunende Leute... :)<P>

<B>phase5</B> hatte auch einen Stand und obwohl er etwas hinter den CU Amiga-
Stand gedr&uuml;ckt wurde, war er einen Besuch wert. Speziell f&uuml;r die Briten,
die nicht auf der K&ouml;lner Messe letzten November waren. Es wurden die
<B>neuen PPC-Karten</B> vorgef&uuml;hrt, mit einer Maschine, die einen MPEG-Film
als Workbench-Hintergrund abspielte.<P>

Au&szlig;erdem wurden Fraktale gerendert, als ob sie von der Harddisk kamen. Es
gab auch Prospekte mit Informationen &uuml;ber die PPC-Karten, einschlie&szlig;lich
der Blizzard 603-Karten f&uuml;r den 1200. Mehr Infos dar&uuml;ber k&ouml;nnen aber
genausogut auf der <A HREF="http://www.phase5.de">phase5-Homepage</A> abgerufen werden.<P>

Um &uuml;ber das <B>CU Amiga-Magazin</B> zu sprechen: sie waren auch online live von
der Messe auf dem IRC-Channel #Amiga und zeigten auch Bilder von der
Veranstaltung, die mit einem digitalen Fotoapparat aufgenommen und in
Minuten auf die Site von CU-Amiga geladen wurden. Sie hatten eine laufende
<B>Demo von TFX</B>. Ich kenne nicht die Story dahinter, aber es liegt nah, da&szlig;
es nicht komplett verloren gegangen ist...<P>

Au&szlig;erdem wurde dort ein selbstgefertigter <B>portabler Amiga</B> gezeigt,
basierend auf einem A600, komplett mit LCD-Bildschirm und CD-ROM-Laufwerk!
Sie wollten nicht zu viel offenbaren, aber ein weiteres Merkmal ist/wird
bald in ihrem Magazin ver&ouml;ffentlicht, wie wohl auch auf ihrer Homepage.<P>

Das andere gro&szlig;e (das gr&ouml;&szlig;te) englische Magazin <B>Amiga Format</B> pr&auml;sentierte
sich auch. Und obwohl sie keinerlei Hard-und Software hatten, verkauften
sie Magazine und Abonnements wie warme Semmeln.<P>

<B>Scala UK</B> hatte einen eher gro&szlig;en Stand und sie verkauften haupts&auml;chlich
Scala-Software neben etwas anderer Hard-und Software.<P>

Der Stand von <B>PIOS</B> war etwas entt&auml;uschend. Nicht nur, da&szlig; er ziemlich
klein und praktisch den gr&ouml;&szlig;ten Teil des Tages verlassen war, zeigte
er nur gelegentlich einen TransAM mit MacOS. :(<P>

[Dabei handelte es sich wohl nicht um den TransAM, der nach anderen
Quellen bis dato nicht funktionsf&auml;hig war (ist?), sondern um den auf
einem Motorola-Tanzania-Motherboard basierenden Mac-Clone KEENYA - d.Red.]<P>

Interessantere Neuigkeiten gab es von dem <B>HiQ</B>-Stand. Sie pr&auml;sentierten
die neueste Version des <B>Siamese</B> Systems, welche einen Amiga mit einem PC
verbindet, inklusive RTG. Es erlaubt einem Besitzer eines Amigas und
PC`s aus ihnen eine Killermaschine zu machen, wobei sich beide Systeme
denselben Bildschirm teilen. Die Demonstration zog immer gro&szlig;e Menschen-
massen an.<P>

<B>Blittersoft</B> verkaufte den Web-Browser <B>AWeb</B> und w&auml;hrend die neue Version
3.0 gerade fertiggestellt wurde, offerierten sie allen denen ein kosten-
loses Upgrade, welche sich auf der Messe AWeb gekauft hatten. Sie
verkauften auch viele Produkte von phase5, Mikronik und VillageTronic.
<P>
Um von Netzsoftware zu sprechen: Auf dem <B>Sadeness</B>-Stand verkaufte Active-
Software ihr <B>NetConnect-Paket</B>, welches die gesamte Internet-Software, die
man lange Zeit brauchen wird vereint. Und es sind alles offiziell
registrierte Produke, keine Demos einschlie&szlig;lich AmiTCP 4.5, Voyager,
AmFTP, MicroDot-II usw.<P>

Dann waren da auch noch die Newcomer von <B>Finale-Development</B>, die ihren
Browser <B>`FinaleWebCruiser`</B> zeigten. Er benutzt nicht MUI und wird (in
Zukunft) alles unterst&uuml;tzen, von AnimGIFs bis Javascript.<P>

<B>Digita International</B> hatten ihr komplettes Produktprogramm im Angebot, von
der angek&uuml;ndigten <B>Wordworth 6-CD</B> bis zu Personal Paint und Organizer 2.
<P>
<B>Eyetech Group Limited</B>, welche bekannt sind f&uuml;r ihre schnellen, kleinen
Festplatten, boten neben anderem die neue <B>Pro-33</B> Erweiterungseinheit f&uuml;r
das CD32 an und ein 8-und 16(!)-fach CD-ROM-Laufwerk, mit integriertem
IDE-Controller. Dann wurden noch die seriellen Highspeedkarten <B>HyperCOM</B>
und die <B>Connectix Quickcam</B> f&uuml;r den Amiga offeriert.<P>

<B>Guildhall Leisure</B> verkaufte viele neue Wiederver&ouml;ffentlichungen von alten
(aber guten) Spielen, wie <B>F1 Grandprix, Theme Park, Colonization, UFO</B> und
vielen anderen. Sie werden viele mehr in naher Zukunft herausbringen.
<P>
Die Mitarbeiter von <B>HiSoft</B> waren stolz ihren neuesten Artikel zu
pr&auml;sentieren. Das <B>Whippet</B>, ein Highspeed Seriel-Adapter, der in den
PCMCIA-Port gesteckt wird. Grunds&auml;tzlich ist es ein Sqirrel ohne SCSI-
Interface. Sie verkauften auch die CD-Version von Cinema 4D, genauso wie
das CD-R-System f&uuml;r das Sqirrel.<P>

<B>Power Computing</B> ver&ouml;ffentlichen ein neues Spiel namens <B>`Big Red Adventure`</B>.
Es ist eine Konvertierung von der PC-Plattform und ein (sehr sch&ouml;nes)
Grafik-Adventure - nur auf CD.<P>

Wizard Development waren Gastgeber von <B><A HREF="http://www.livewire.com.au/gpsoft/">GP Software</A></B>, die ihre neueste
Version von <B>DOpus</B> vorf&uuml;hrten.<P>

<B>Direct Software</B> hatten angek&uuml;ndigt ihren <B>Power-Amiga</B> zum ersten Mal auf
der WOA zu zeigen, aber technische Probleme verhinderten dies leider.<P>

Im Laufe des Tages f&uuml;llte sich das Ausstellungszentrum ziemlich und das
lie&szlig; die Temperatur extrem steigen, unterst&uuml;tzt durch das sch&ouml;ne Wetter
drau&szlig;en. So machte auch das Erfrischungsareal ein gutes Gesch&auml;ft. Gegen
16 Uhr begann die Menschenmasse langsam zu schrumpfen, wodurch dem
verbleibenden Publikum die Chance er&ouml;ffnet wurde, einen n&auml;heren Blick
auf die St&auml;nde zu werfen.<P>

<B>Alles in allem</B> war die zweite WOA in London ein gro&szlig;er Erfolg und
jederman erwartet bereits die n&auml;chste. Wo auch immer sie stattfinden
wird!<P>

<P><HR>
<TABLE WIDTH=100%>
<TR><TD ALIGN =LEFT><A HREF="WOA0697.htm"><FONT SIZE=2>Prev</FONT></A></TD>
<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../AmZ0697/main.htm">Inhaltsverzeichnis</A></FONT></TD><TD ALIGN=RIGHT><A HREF="IV0697.htm"><FONT SIZE=2>Next</FONT></A></TD></TR>
<TR><TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@BBrandes.berlinet.de">Der AmZeiger</A></FONT></TD></TR></TABLE>
</BODY></HTML>
