<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues von AMIGA
---------------

1. JIM COLLAS ALS PR&Auml;SIDENT UND CEO VON AMIGA ZUR&Uuml;CKGETRETEN

ZDNet verbreitete die unglaubliche Meldung am Abend des 1. September als 
erstes: Jim Collas ist unerwartet als Pr&auml;sident und Chief Executing Officer 
(CEO) von AMIGA zur&uuml;ckgetreten. Ein AMIGA-Sprecher erkl&auml;rte, dass Collas 
das Unternehmen verlassen habe, um pers&ouml;nliche Interessen zu verfolgen. 
Gleichzeitig berichtet ZDNet, dass Jim Collas sich von 118.000 eigenen 
Gateway-Aktien trennen will, wohl ein Zeichen daf&uuml;r, dass Collas das 
'Kapitel Gateway', dem er einst als Senior Vice President angeh&ouml;rte, f&uuml;r 
sich als erledigt betrachtet.
Der bisherige AMIGA-Vizepr&auml;sident und Chief Operating Officer (COO) Tom 
Schmidt habe die Leitung des Unternehmens &uuml;bernommen. 

Laut CNET News hat Gateway-Sprecher Brad Shaw den R&uuml;cktritt best&auml;tigt. Die 
grundlegenden Pl&auml;ne w&uuml;rden mit Tom Schmidt an der Spitze und mit dem 
bestehenden Entwicklerteam weiter verfolgt. "Tom ist gut geeignet, um Amiga 
auf die n&auml;chste Stufe zu bringen, und die Technologie wird unvermindert 
vorangetrieben.", wird Shaw zitiert.

Hier die von Gernod Schomberg &uuml;bersetzten Informationen zum neuen AMIGA-
Pr&auml;sidenten Tom Schmidt, die der AMIGA-Homepage entnommen wurden:

»Bevor er zu Amiga kam, war Tom Schmidt Vizepr&auml;sident und 
Hauptgesch&auml;ftsf&uuml;hrer eines strategischen Gesch&auml;ftsunternehmens innerhalb 
von AlliedSignal, einem Technologie- und Herstellerunternehmen in 
Morristown, New Jersey, USA. Davor hatte Tom Schmidt bei der "Baxter 
Healthcare Corporation" verschiedene Schl&uuml;sselpositionen sowie 
Sales&Marketing-Funktionen inne. Weiterhin war er t&auml;tig als "Senior Project 
Manager" und "Strategic Management Consultant" bei Arthur Andersen. «

Ebenfalls nicht mehr bei AMIGA ist Bill McEwen, der formell im Marketing-
Bereich t&auml;tig war, sich in der Praxis aber vor allem um die Belange der 
Amiga-Gemeinde gek&uuml;mmert hat. Nach eigenen Aussagen hat McEwen erst am 30. 
August erfahren, dass der 31. August sein letzter Arbeitstag bei AMIGA sei.

M&ouml;glicherweise steht auch Usergroup-Koordinator Darreck Lisle nicht mehr 
bei AMIGA unter Vertrag. Darauf deutet zumindest hin, dass die Moderation 
der AMIGA-Bulletin-Boards, die McEwen und Lisle unter sich aufgeteilt 
hatten, seit kurzem vollst&auml;ndig auf den AMIGA-Webmaster Matthias Grohmann 
&uuml;bergegangen ist.

Unterdessen hat AMIGA-Vizepr&auml;sident Petro Tyschtschenko seine Teilnahme an 
der finnischen Amiga-Messe Saku 99, die am 4. September stattfindet, 
abgesagt. Wegen des Wechsels an der AMIGA-Spitze sei an diesem Wochenende 
seine Anwesenheit bei wichtigen Treffen in den USA erforderlich.

Mehr zu den dramatischen Ereignissen dieser Tage mit einer Einsch&auml;tzung zum 
Schluss dieser Ausgabe.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
