<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Blick in die Zukunft
--------------------

1. Vorwort zu den Rubriken 'Blick in die Zukunft' und 'Technik & Net News'

Hallo liebe AMIGA-aktuell-Leserinnen und -Leser

So ganz ohne Vorwort zu den beiden m&ouml;glicherweise neuen Rubriken in
AMIGA aktuell, "Blick in die Zukunft" und "Technik-News", komme ich nun 
doch nicht aus.

Nat&uuml;rlich werde ich hier nicht die Vorgeschichte ausbreiten, mit der sich
locker eine AA-Ausgabe f&uuml;llen lie&szlig;e, eine Bemerkung kann ich mir aber nicht
verkneifen.

Vor 1 1/2, fast zwei Jahren, kurz vor Ende meiner "Amiga-Karriere", als ich
auch die letzten Sachen in diesem Amiga-Club im Sowieso, schrieb, fielen
mir zwei Ph&auml;nomene auf.

Zum einen die Tatsache, dass einige "Hardliner" Leser ausschlie&szlig;en wollten, 
die einen "PC-Browser" verwendeten. Der zweite, mir nun wichtigere Punkt 
war, dass man Kommentare lesen konnte wie "ach die wieder mit ihrem PC-
Sch...". Dann n&auml;mlich, wenn man ab und zu dar&uuml;ber sinnierte, was f&uuml;r neue 
Technologie in einem m&ouml;glichen neuen Amiga drin sein sollte und dann eben 
nicht Zorro IV, den PPC-Chip oder einen 68080/200 erw&auml;hnte, sondern auch 
ein paar "PC-Standards" ins Spiel brachte.

F&uuml;r einige, sofern die heute &uuml;berhaupt selbst noch Amigas benutzen, muss
der Technology Brief von Jim Collas vom 16.Juli 99, dann doch so etwas wie
ein Schock gewesen sein. Nat&uuml;rlich meine ich da in erster Linie den Absatz,
der sich auf die Hardware eines m&ouml;glichen neuen Amigas bezieht.

Der Chefredakteur von AMIGA aktuell kam also auf die Idee, dass ein 
Freiwilliger eine neue Rubrik anfangen k&ouml;nnte, in der neue Techniken, die 
bisher noch nicht oder zumindest nur als Prototypen oder Kleinserien, in 
einem Amiga Verwendung fanden, kurz erkl&auml;rt werden sollten. Auch, um im 
Einzelfall m&ouml;gliche Vorurteile oder vorschnelle Reaktionen zu vermeiden.

Das h&ouml;rt sich nun vielleicht von mir etwas hochtrabend an. Ich m&ouml;chte es 
aber ganz kurz mit einem Beispiel deutlich machen. Eine kurze 
Begriffserkl&auml;rung seitens Amiga Inc.'s (hei&szlig;t das nun so? ) zum Zeitpunkt
der Bekanntmachung bez&uuml;glich des Linux-Kernels, h&auml;tte durchaus einige
Aufregung (was ich so geh&ouml;rt habe) erspart.

Denn dass ein Linux-Kernel nicht gleichzusetzen ist mit einer kompletten
Distribution von RedHat, SuSE oder Corel, hat sich mittlerweile hoffentlich
schon rumgesprochen. ALLE, aber auch wirklich ALLE negativen, aber auch
positiven Voraussagungen, sind im Moment noch nix Wert. Ich diskutiere
gerne mit jedem der Schwarzseher, behaupte aber auch, dass davon 90% in
ihrer Meinung dadurch negativ beeinflusst wurden, dass sie bei der
Bezeichnung Linux-Kernel, den schwarzen Bildschirm und die
Eingabeaufforderung vor Augen hatten. So, das reicht nun von meiner Seite
dazu.

Der Name "Blick in die Zukunft" ist von Carsten, mir ist er etwas
&uuml;bertrieben.

[Ich bin offen f&uuml;r eine bessere Betitelung, Vorschl&auml;ge bitte an 
aakt@gmx.de; Anm. d. Red.]

Obwohl ich mir nicht sicher bin, ob die gew&auml;hlte Form des ersten Artikels
ausf&uuml;hrlich genug oder f&uuml;r einige Leser zu oberfl&auml;chlich ist, g&auml;be es, da
selbst im Technology Brief noch sehr oft "in Entwicklung" bzw. "optional"
steht, eine vorl&auml;ufige, unvollst&auml;ndige Themen&uuml;bersicht f&uuml;r die n&auml;chsten
Monate:

o USB-Schnittstelle
o CPU (sobald OFFIZIELL angek&uuml;ndigt)
o Firewire (inkl. erh&auml;ltlicher Ger&auml;te)
o SDRAM (Speichertypen allgemein, da es hier Bewegung im Markt gibt)
o ATX-Motherboard (besser, die aktuellen Systeme)
o PCI- / AGP-Schnittstellen
o Grafik- / Video-System (sobald speziellere Angaben vorhanden)
o Sound-System (siehe oben)
o Netzwerktechniken
o Tipps und neue Mittel zur richtigen Entwurmung von Katzen und Gefahren,
  wenn man es nicht macht

[Ein typischer Hasemann'scher Scherz...; Anm. d. Red.]

o Eure Vorschl&auml;ge


==========================================================
Noch ganz kurz zur zweiten Rubrik "Technik News"

Nat&uuml;rlich komme ich da nicht mit Meldungen, dass Microbrain ein neues
Service Pack f&uuml;r NT 4 ins Netz gestellt hat. Allerdings werde ich 
versuchen, sofern gew&uuml;nscht, oder besser, sofern die Negativ-E-Mails nicht
&Uuml;berhand nehmen, einen etwas weiteren Bereich, inkl. Internet abzudecken 
und evtl. auch die ein oder andere Bemerkung dazusetzen.

Hier noch die obligatorischen Adressen f&uuml;r Kritik, Anregungen, Fragen,
Verbesserungsvorschl&auml;ge und Hinweise, wo ich mich mit dem PC-Zeug 
hinscheren soll:

1145-87@onlinehome.de
thomashasemann@businessnet.de
Fax: 06336 993175

Die Wahrheit liegt irgendwo da drau&szlig;en
Oder vielleicht auch, hier drinnen
Oder auch, ganz wo anders.
Ich habe keine Ahnung.

Thomas Hasemann &lt;1145-87@onlinehome.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
