<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Haage&Partner-News

Und hier wieder die neuesten Meldungen des Unternehmens:

»04 Aug 99: Neue T3D-Werbung

Im Stil unserer neuen Anzeigenserie gibt es jetzt auch eine T3D-Werbung.
Die Anzeige in gro&szlig;er Aufl&ouml;sung (608x437, 83 kB).


04 Aug 99: 3DWorld-Logos endlich online...

Endlich sind die Logo-Vorschl&auml;ge online.


05 Aug 99: PageStream 4.0

Bald ist es soweit - die Version 4 des DTP-Klassikers wird verf&uuml;gbar sein.
Schon seit geraumer Zeit ist die Version im Betatest. Wir werden Ihnen
diese Version den n&auml;chsten Tagen anbieten k&ouml;nnen. Preise f&uuml;r Updates, sowie
die Mac- und PC-Version werden ebenfalls in K&uuml;rze bekanntgegeben.


18 Aug 99: Amiga "No Piracy" Campaign

Raubkopien gef&auml;hrden immer mehr die Existenz von Amiga-Firmen. Besonders 
bei Anwendungsprogrammen und Spielen f&uuml;hren Raubkopien dazu, da&szlig; neue 
Projekte nicht mehr realisiert werden. Es wird h&ouml;chste Zeit f&uuml;r eine 
gemeinsame Aktion... http://www.haage-partner.com/actions/nopiracy-d.htm


18 Aug 99: Amiga bei 3SAT

Demn&auml;chst wird in der Computersendung NEUES - Die Computershow (3SAT) ein
Bericht &uuml;ber den Amiga erscheinen. Am 23. August.99 kommt um 21.30 Uhr im
ZDF eine Newsmeldung dazu. Das Fernsehteam traf sich dazu auch mit dem
Entwicklungsleiter des AmigaOS 3.5-Projekts Jochen Becher.
http://www.3sat.de/

(Leider verwenden die 3SAT-Seiten ausgiebig JavaScript f&uuml;r die Men&uuml;f&uuml;hrung.
Es ist daher mit Amiga-Browsern kaum m&ouml;glich, auf die NEUES-Seiten zu
gelangen. Ich werde jedoch einen direkten Link legen, sobald es eine
Vorschau gibt. Der Webmaster)


27 Aug 99: Neue 3D World-Logos...

Wir haben noch weiter Vorschl&auml;ge f&uuml;r die Logos erhalten. Uns w&uuml;rde nun
interessieren, welche Art von Logo Euch am besten gef&auml;llt.


27 Aug 99: Neue Werbung

Eine neue Werbung f&uuml;r PageStream 4.0, STFax 4.0, Tornado3D 3.0 und
ArtEffect 3.0 in unserem neuen Werbestil.


02 Sept 99: Amiga "No Piracy" Kampagne (Update)

Die Kampagne geht weiter: einige neue Logos und auch das endg&uuml;ltige :) Ein
Diskussions-Forum wird in K&uuml;rze ge&ouml;ffnet. Wir haben gerade eine neue 
Domaine (www.amiga-planet.de) er&ouml;ffnet, die nun die NoPiracy Kampagne 
beheimatet. http://www.amiga-planet.de/nopiracy/«

(Quelle: Haage & Partner)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
