<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Amiga PowerPC & AmigaNG-Konkurrenzsysteme
-----------------------------------------

1. Phase 5 best&uuml;ckt kommende PPC-Karten mit G4- statt G3-Prozessor

»Informationen &uuml;ber den aktuellen Entwicklungsstand der Next Generation G4
Prozessorkarten von phase 5 digital products
---------------------------------------------------------------------------

NEU 02.09.99: Treten Sie dem exklusiven Club der GigaFLOPS-Anwender bei -
phase 5 digital products liefert Next Generation PowerPC-Prozessorkarten
mit G4 Prozessor aus!

Schneller als noch vor f&uuml;nf Wochen erwartet, ist ab sofort die neue PowerPC
G4-Prozessorserie mit der herausragenden ALTIVEC-Erweiterung verf&uuml;gbar. Aus
diesem Grund haben wir uns dazu entschieden, allen Amiga
1200/3000/4000-Anwendern diese neue Technologie zug&auml;nglich zu machen, und
alle CYBERSTORM- und BLIZZARD-Karten der neuen Generation ausschlie&szlig;lich
mit G4-Prozessoren (XPC7400) auszuliefern!

Damit - und nur damit -

   o erh&auml;lt Ihr Amiga den topaktuellsten Prozessor, den es je in einer
     Amiga-Erweiterung gegeben hat

   o bietet Ihr Amiga eine Leistung wie kaum ein anderer aktueller
     Desktop-Computer heutzutage - Supercomputerleistung auf Ihrem
     Schreibtisch. Und das sogar mit der Option auf Multiprozessorbetrieb
     mit Dual-XPC7400-Modulen!

   o ist Ihr Amiga technologisch wieder vorne - mit leistungsstarker
     Hardware, Erweiterbarkeit, und Unterst&uuml;tzung durch hochmoderne
     Bestriebssysteme bei voller Amiga 3.x-Kompatibilit&auml;t!

Bitte beachten Sie hierzu die Produktbeschreibungen und technischen Daten,
und die Motorola-Website http://www.mot.com/SPS/PowerPC/ !

F&uuml;r alle AMIGA-Anwender, die sich aus diesem Grund jetzt erst f&uuml;r ein
CYBERSTORM oder BLIZZARD G4 Board entscheiden wollen, haben wir das
Einf&uuml;hrungsangebot letztmalig bis zum 15.09.1999 verl&auml;ngert!

WICHTIG: Wenn Sie bereits eine Bestellung f&uuml;r eine G3-Karte get&auml;tigt haben,
so m&uuml;ssen Sie nicht neu bestellen. Alle Kunden, die eine 400MHz-G3-Version
bestellt haben, erhalten zum gleichen Preis eine 400MHz-G4-Version des
CYBERSTORM- oder BLIZZARD G4-Boards. Kunden einer 300MHz-Version werden
gesondert angeschrieben.


Das neue SOFTWARE-KONZEPT - neu am 03.08.99:

Nach Abschlu&szlig; einer Kooperationsvereinbarung mit dem kanadischen
Betriebssystemhersteller QNX Software Systems, Ltd., sind wir in der Lage,
die neuen CYBERSTORM und BLIZZARD G4 Boards mit dem herausragenden
Betriebssystem QNX Neutrino auszuliefern. Da dieses Betriebssystem
gleichzeitig auch - f&uuml;r die bisherigen Anwender kostenfrei - f&uuml;r alle
PowerUP-Boards der ersten Generation verf&uuml;gbar wird, dazu in K&uuml;rze von
einer Vielzahl von bisherigen Amiga-Entwicklern unterst&uuml;tzt werden wird,
und zus&auml;tzlich als Betriebssystem f&uuml;r verschiedene zuk&uuml;nftige Stand-Alone
Hardware-Produkte (auch verschiedener Hersteller) eingesetzt wird, &ouml;ffnen
die CYBERSTORM und BLIZZARD G4 Boards mit dem QNX Neutrino OS allen
Amiga-Anwender eine Br&uuml;cke in die Zukunft. Die Kompatibilit&auml;t zu allen
bisherigen Anwendungen unter AmigaOS 3.x bleibt dabei durch einen
leistungsstarken AmigaOS Legacy Support gew&auml;hrleistet. Mit diesem
innovativen und offenen Konzept, das auch von anderen Herstellern genutzt
und unterst&uuml;tzt wird, nehmen die CYBERSTORM und BLIZZARD G4 Boards mit dem
QNX Neutrino OS eine Vorreiterrolle bei der Entwicklung und Markteinf&uuml;hrung
einer neuen Generation von Computern und Systemen verschiedener Hersteller,
darunter auch das von phase 5 digital products selbst angek&uuml;ndigte
AMIRAGETM K2-System, ein.

Was bedeutet das neue Software-Konzept f&uuml;r den Anwender?
Ganz einfach: Mehr Leistung, mehr Funktionalit&auml;t, mehr Zukunft - und das
alles zu einem nochmals verbesserten Preis! Damit bieten die neuen
CYBERSTORM und BLIZZARD G4 Boards allen Amiga-Anwender und Entwicklern den
perfekten Start in die leistungsf&auml;hige n&auml;chste Technologiegeneration.

Gleichzeitig werden die CYBERSTORM und BLIZZARD G4 Boards offenen Systeme
sein, welche auch anderen Software-L&ouml;sungen offenstehen. Das integrierte
Flash-ROM erlaubt &uuml;ber ein Boot-Select-Men&uuml; den Start verschiedener
Software-L&ouml;sungen aus dem Flash-ROM bzw. von Boot-Partitionen auf der
Harddisk, von denen mehrere parallel installiert sein k&ouml;nnen. Die
Programmierung und Hardwarefunktionalit&auml;t ist dokumentiert und steht allen
Entwicklern zur Verf&uuml;gung. Damit ist es problemlos m&ouml;glich, andere Software
(wie z.B. Warpup oder Linux) ohne Verwendung des mitgelieferten QNX
Neutrino OS zu installieren bzw. das System damit zu starten.


Konzeptionelle &Auml;nderungen der CYBERSTORM und BLIZZARD G4 Hardware

Als wesentliche &Auml;nderung im Design der beiden Boards werden die CYBERSTORM
und BLIZZARD G4 Karten serienm&auml;&szlig;ig ohne SCSI- oder IEEE1394-Erweiterungen
geliefert (und daf&uuml;r im Basispreis gesenkt), welche als Module nach Bedarf
verf&uuml;gbar werden. Dies liegt darin begr&uuml;ndet, da&szlig; hier die Anwenderw&uuml;nsche
sehr weit auseinander gehen; viele Anwender w&uuml;nschen z.B. eine teure und
mit aufwendiger Verkabelung verbundene U2W-SCSI-Schnittstelle, andere
ben&ouml;tigen nur einen einfachen 8-Bit-SCSI, um vorhandene &auml;ltere Laufwerke
noch anschlie&szlig;en zu k&ouml;nnen; wieder andere Anwender w&uuml;nschen sich einfach
nur ein m&ouml;glichst g&uuml;nstiges Basisboard. Aus diesem Grund haben wir uns
entschlossen, die m&ouml;glichen I/O-Schnittstellen als optionale Module
anzubieten.

Eine besonders wichtige Verbesserung des Designs ist die Tatasche, da&szlig;
sowohl auf der CYBERSTORM als auch auf der BLIZZARD G4 serienm&auml;&szlig;ig mehrere
PCI-Slots installiert sein werden, die dem neuen Mini-PCI-Standard
entsprechen. Damit wird es m&ouml;glich, da&szlig; die neuen Prozessorkarten
mechanisch in dieselben Systeme eingebaut werden k&ouml;nnen, wie die
PowerUP-Karten der ersten Generation - und das selbst bei installierten
Mini-PCI-Erweiterungen! In die auf den Boards vorhandenen Mini-PCI-Stecker
k&ouml;nnen die Mini-PCI-karten direkt eingesetzt werden, so da&szlig; weiterhin die
Notwendigkeit einer teuren PCI Bus Erweiterungsplatinen (mit all den damit
verbundenen elektrischen und mechanischen Problemen) entf&auml;llt, was die
andernfalls bei der Nutzung des PCI-Anschlusses aufgetretenen erheblichen
Zusatzkosten eliminiert. Entwickler k&ouml;nnen dar&uuml;berhinaus Mini-PCI-Karten,
die f&uuml;r den PC-Markt angeboten werden, mit Amiga-geigneten Treibern
versehen und anbieten, oder relativ einfach eigene Mini-PCI-Karten auf
Basis von Standard-PCI-Chips designen.

Damit die CYBERSTORM als auch auf der BLIZZARD G4 in einem kompakten
Formfaktor geliefert werden k&ouml;nnen, der bei voller Aufr&uuml;stung mit Speicher
und Erweiterungen mechanisch in praktisch alle A1200-Towerger&auml;te bzw. alle
A3000/A4000 Desktop- und Towermodelle passt, werden auf beiden
Prozessorkarten moderne SO-DIMMs (100 MHz SDRAM) eingesetzt, die heute in
vielen Notebooks, aber auch im iMac von Apple verwendet werden. Der
Preisunterschied dieser Module gegen&uuml;ber den gr&ouml;&szlig;eren DIMMs ist bei den
g&auml;ngigen Gr&ouml;&szlig;en sehr gering bzw. nicht mehr vorhanden (gem&auml;&szlig; Anbietern im
Magazin c't 16/99 sind die Kosten f&uuml;r eine 128MB-Aufr&uuml;stung identisch, bei
256 MB kosten die SO-DIMMS einen Mehrpreis von DM 20), so da&szlig; der
mechanische Vorteil hilft, Kosten zu sparen, die sonst aufgrund ggfs.
notwendiger mechanischer &Auml;nderungen anfallen w&uuml;rden.

Als Erg&auml;nzung der Funktionalit&auml;t wird auf den CYBERSTORM und BLIZZARD G4
Karten serienm&auml;&szlig;ig ein USB-Interface mit zwei 12MBit-Kan&auml;len integriert
sein, &uuml;ber das ein Vielzahl von Ger&auml;ten und Erweiterungen f&uuml;r Eingabe,
Storage, aber auch Video, Drucker oder Scanner u.&auml;. angeschlossen werden
k&ouml;nnen.


ERWEITERUNGSOPTIONEN - Stand 03. August 1999:

phase 5 digital products wird weiterhin preisg&uuml;nstige Zusatzmodule f&uuml;r die
CYBERSTORM und BLIZZARD G4 anbieten. Wir bieten ab sofort mehrere Module
optional an, die vorbestellt werden k&ouml;nnen, und bei ausreichender
Nachfrage (siehe unten) verf&uuml;gbar werden. Es handelt sich dabei im
wesentlichen um die urspr&uuml;nglich geplanten I/O-Funktionalit&auml;ten, die jetzt
einfach auf Mini-PCI-Karten ausgelagert werden. Zur Zeit sind folgende
Module geplant:

   o Ein U2W SCSI Controller mit internem 68poligen Anschlu&szlig; und aktiver
     Terminierung, Datenrate max. 80MB/sec, bis zu 15 Ger&auml;te anschlie&szlig;bar,
     f&uuml;r einen unverbindlich empfohlenen Verkaufspreis von EURO 150 zzgl.
     MwSt.

   o Ein Ultra-SCSI Controller mit internem 50poligen Anschlu&szlig; und aktiver
     Terminierung, Datenrate max. 20MB/sec, bis zu 7 Ger&auml;te anschlie&szlig;bar,
     f&uuml;r einen unverbindlich empfohlenen Verkaufspreis von EURO 80 zzgl.
     MwSt.

   o Ein Ultra-DMA IDE/ATA Controller 66MHz mit zwei Kan&auml;len (unterst&uuml;tzt
     bis zu 4 Ger&auml;te) f&uuml;r einen unverbindlich empfohlenen Verkaufspreis
     von EURO 80 zzgl. MwSt.

   o Ein IEEE-1394 Controller mit zwei Anschl&uuml;ssen und 400Mbps, f&uuml;r einen
     unverbindlich empfohlenen Verkaufspreis von EURO 100 zzgl. MwSt.

HINWEIS: F&uuml;r jedes dieser Module mu&szlig; eine minimale Bestellmenge von 250
St&uuml;ck vorliegen, bevor das jeweilige Produkt realisiert werden kann, um
den Entwicklungsaufwand von Hard- und Software abzudecken. Sollte diese
Menge aufgrund mangelnder Nachfrage f&uuml;r eines der Module nicht erreicht
werden, werden alle Kunden, die daf&uuml;r eine Vorbestellung im neuen
Bestellformular get&auml;tigt haben, rechtzeitig vor Auslieferung informiert.


GRAFIK-OPTIONEN - Stand 03. August 1999:

phase 5 digital products wird ebenfalls eine neue und aktuelle Grafikkarte
f&uuml;r die neuen G3/G4-Beschleuniger anbieten. Diese neue Grafikkarte, die
CyberVisionNG, wird nach aktuellem Planungsstand

   o einen schnellen 2D/3D Grafik-Chip mit einer 128bit 3D-Einheit
     verwenden

   o ine maximale Aufl&ouml;sungen von 1920x1200 Pixeln in 32bit Farbe bei 72Hz
     Bildwiederholrate bieten

   o &uuml;ber Hardware Video Beschleunigung f&uuml;r Full-Screen, Full-Frame DVD
     Wiedergabe verf&uuml;gen

und f&uuml;r einen empfohlenen Verkaufspreis von EURO 180 zzgl. MwSt. inklusive
32 MB Grafikspeicher angeboten werden (dieser Preis basiert auf den
aktuellen Speicherpreisen Anfang August 99).

Durch den gro&szlig;en lokalen Speicher f&uuml;r Display und Texturen kann die
CyberVisionNG hohe Leistung und beeindruckende 3D-Funktionalit&auml;t bieten,
wie sie zuvor nicht auf dem Amiga realisierbar war, zu einem attraktiven
Preis, wie er bisher nur in der PC-Welt &uuml;blich war.

&Uuml;BERSICHT &Uuml;BER DIE LEISTUNGSDATEN DER BLIZZARD UND CYBERSTORM G4 BOARDS -
Stand 03. September 1999:


BLIZZARD G4 f&uuml;r A1200 Tower-Systeme

   o PowerPC Accelerator Board f&uuml;r Amiga 1200 Tower-Systeme
     Basisboard im A1200-kompatiblen Formfaktor mit einem 288-poligen ZIF
     Prozessorsockel (Interposer-Standard) f&uuml;r g&auml;ngige G3/G4
     Prozessor-Module

   o Supercomputerleistung im Desktop: Der neue PowerPC G4-Prozessor
     XPC7400 bietet mehr als 1 Miliarde Flie&szlig;kommaoperationen pro Sekunde
     (&gt; 1GigaFLOPS) Dauerleistung, bis zu 4 GigaFLOPS Spitzenleistung
     (Leistungsangaben beruhen auf Werten des Herstellers, in der
     400MHz-Version)

     Bis zu 8 Milliarden parallele Multimedia-Operationen pro Sekunde (bei
     400MHz) f&uuml;r herausragende Leistung in allen komplexen Anwendungen der
     Audio-, Video- und Bildverarbeitung sowie 3D-Anwendungen und vielem
     mehr

     Mehr Informationen zum PowerPC G4 und Altivec finden Sie beim
     Hersteller Motorola unter http://www.mot.com/SPS/PowerPC/

   o Vorbereitet f&uuml;r Dual-Processing (volles SMP mit Interposer-Modulen mit
     zwei G4-Prozessoren); Upgrades auf Dual-CPU-Module werden Anfang 2000
     gegen Inzahlungnahme der alten Module von phase 5 digital products
     verf&uuml;gbar werden

   o Bis zu 1GB Hauptspeicher auf zwei B&auml;nken (Steckpl&auml;tzen) unter
     Verwendung handels&uuml;blicher SO-DIMM Module (100 MHz SDRAM)

   o Zwei Standard Mini-PCI Anschl&uuml;sse f&uuml;r Mini-PCI Steckkarten, plus ein
     PCI-Erweiterungssteckplatz f&uuml;r eine dritte PCI-Karte oder eine aktive
     PCI-Erweiterung (z.B. PCI Expansion Board mit zus&auml;tzlichen
     Steckpl&auml;tzen)

   o Zwei unabh&auml;ngige 12MBit USB Kan&auml;le serienm&auml;&szlig;ig integriert, inklusive
     externem Steckanschlu&szlig;

   o 512 KByte Flash-ROM f&uuml;r Systemsoftware, Bootmen&uuml; sowie OS-Software

   o Das BLIZZARD G4 wird inklusive dem Echtzeit-Mikrokernel-Betriebssystem
     QNX Neutrino und einer darauf aufsetzenden leistungsstarken
     68k-Emulation f&uuml;r Amiga 3.x Legacy Support ausgeliefert

     Mehr Informationen zu QNX finden Sie unter www.qnx.com

   o Kompatibel zu den f&uuml;hrenden PowerUP-Anwendungen mit zus&auml;tzlicher
     Leistungssteigerung in vielen Anwendungsbereichen

   o Benutzung mit alternativer Systemsoftware anderer Anbieter problemlos
     m&ouml;glich, darunter auch Linux f&uuml;r PowerPC

   o Zwei Jahre Garantie auf Teile und Verarbeitung

Unverbindlich empfohlener Verkaufspreis
in der EU:
Inklusive 350MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 649.00 zzgl. MwSt.

Inklusive 400MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 799.00 zzgl. MwSt.

Verg&uuml;nstiger Preis bei Vorbestellung* (inklusive Post-Versand frei Haus):
*Dieser Preis gilt nur f&uuml;r Vorbestellung, die bis zum 15.09.1999 unter den
Konditionen des Vorbestellungsprogramms get&auml;tigt werden

Inklusive 350MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 579.00 zzgl. MwSt.

Inklusive 400MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 679.00 zzgl. MwSt.



CYBERSTORM G4 f&uuml;r A3000/A4000 -Systeme

   o PowerPC Accelerator Board f&uuml;r Amiga 3000(T)/40000(T)-Systeme
     Basisboard im A3000/A4000-kompatiblen Formfaktor mit einem 288-poligen
     ZIF Prozessorsockel (Interposer-Standard) f&uuml;r g&auml;ngige G3/G4
     Prozessor-Module

   o Supercomputerleistung im Desktop: Der neue PowerPC G4-Prozessor
     XPC7400 bietet mehr als 1 Miliarde Flie&szlig;kommaoperationen pro Sekunde
     (&gt; 1GigaFLOPS) Dauerleistung, bis zu 4 GigaFLOPS Spitzenleistung
     (Leistungsangaben beruhen auf Werten des Herstellers, in der
     400MHz-Version)

     Bis zu 8 Milliarden parallele Multimedia-Operationen pro Sekunde (bei
     400MHz) f&uuml;r herausragende Leistung in allen komplexen Anwendungen der
     Audio-, Video- und Bildverarbeitung sowie 3D-Anwendungen und vielem
     mehr

     Mehr Informationen zum PowerPC G4 und Altivec finden Sie beim
     Hersteller Motorola unter http://www.mot.com/SPS/PowerPC/

   o Vorbereitet f&uuml;r Dual-Processing (volles SMP mit Interposer-Modulen mit
     zwei G4-Prozessoren); Upgrades auf Dual-CPU-Module werden Anfang 2000
     gegen Inzahlungnahme der alten Module von phase 5 digital products
     verf&uuml;gbar werden

   o Bis zu 1GB Hauptspeicher auf zwei B&auml;nken (Steckpl&auml;tzen) unter
     Verwendung handels&uuml;blicher SO-DIMM Module (100 MHz SDRAM)

   o Zwei standard Mini-PCI Anschl&uuml;sse f&uuml;r Mini-PCI Steckkarten, plus ein
     PCI-Erweiterungssteckplatz f&uuml;r eine dritte PCI-Karte oder eine aktive
     PCI-Erweiterung (z.B. PCI Expansion Board mit zus&auml;tzlichen
     Steckpl&auml;tzen)

   o Zwei unabh&auml;ngige 12MBit USB Kan&auml;le serienm&auml;&szlig;ig integriert, inklusive
     externem Steckanschlu&szlig;

   o 512 KByte Flash-ROM f&uuml;r Systemsoftware, Bootmen&uuml; sowie OS-Software

   o Das CYBERSTORM G4 wird inklusive dem
     Echtzeit-Mikrokernel-Betriebssystem QNX Neutrino und einer darauf
     aufsetzenden leistungsstarken 68k-Emulation f&uuml;r Amiga 3.x Legacy
     Support ausgeliefert

     Mehr Informationen zu QNX finden Sie unter www.qnx.com

   o Benutzung mit alternativer Systemsoftware anderer Anbieter problemlos
     m&ouml;glich, darunter auch Linux f&uuml;r PowerPC

   o Zwei Jahre Garantie auf Teile und Verarbeitung

Unverbindlich empfohlener Verkaufspreis
in der EU:

Inklusive 400MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 799.00 zzgl. MwSt.

Verg&uuml;nstiger Preis bei Vorbestellung* (inklusive Post-Versand frei Haus):
*Dieser Preis gilt nur f&uuml;r Vorbestellung, die bis zum 15.09.1999 unter den
Konditionen des Vorbestellungsprogramms get&auml;tigt werden

Inklusive 400MHz G4 Prozessor-Modul mit 1MB Backside-Cache:
EURO 679.00 zzgl. MwSt.


DIE REALISIERUNG SCHREITET VORAN, DIE AUSLIEFERUNG R&Uuml;CKT N&Auml;HER!

Aufgrund der Umstellung auf die neuen G4-Prozessoren wird die Auslieferung
der CYBERSTORM- und BLIZZARD G4-Boards ab Oktober 1999 beginnen. Wenn Sie
bis heute noch keine Vorbestellung f&uuml;r eines dieser neue, topaktuellen
Erweiterungsprodukte f&uuml;r Ihren Amiga bestellt haben, so beachten Sie
bitte, da&szlig; das verg&uuml;nstigte Einf&uuml;hrungsangebot bei Vorbestellung aufgrund
des Wechsels zur neuen G4-Prozessorgeneration bis zum 15.09.1999
verl&auml;ngert wurde; danach kann das Produkt nur noch &uuml;ber den Fachhandel zu
den dort &uuml;blichen Preisen bezogen werden.

WICHTIG: Wenn Sie bereits eine Bestellung f&uuml;r eine G3-Karte get&auml;tigt haben,
so m&uuml;ssen Sie nicht neu bestellen. Alle Kunden, die eine 400MHz-G3-Version
bestellt haben, erhalten zum gleichen Preis eine 400MHz-G4-Version des
CYBERSTORM- oder BLIZZARD G4-Boards. Kunden einer 300MHz-Version werden
gesondert angeschrieben.

Alle AMIGA-Anwender, die noch keine Vorbestellung get&auml;tigt haben, haben
jetzt letztmalig bis zum 15.09.99 die M&ouml;glichkeit, die
Einf&uuml;hrungssonderpreise zu nutzen. Z&ouml;gern Sie nicht l&auml;nger, sondern gehen
Sie jetzt auf unsere

aktuelle Bestellseite f&uuml;r BLIZZARD und CYBERSTORM G4 Boards!


&#169; 1999 phase 5 digital products. Alle Rechte vorbehalten. &Auml;nderungen in
Preis, Technik oder Lieferumfang vorbehalten. Alle Preise sind
unverbindlich empfohlene Netto-Preise f&uuml;r EU-L&auml;nder und gelten zzgl. der
jeweiligen Mehrwertsteuer. QNX, Photon microGUI, und Neutrino sind
eingetragene Warenzeichen der QNX Software Systems Ltd. Amiga&#174; ist ein
eingetragenes Warenzeichen von Amiga International. PowerUPTM ist ein
eingetragenes Warenzeichen von phase 5 digital products; BLIZZARDTM,
CYBERSTORMTM, AMIRAGETM K2 and ISBEETM sind Warenzeichen von phase 5
digital products.«

(Quelle: Phase 5 digital products)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
