<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5.6. Reviews
------------

Abuse Demo (Test)
-----------------

Name des Spiels : Abuse
Hersteller      : Bungie
Voraussetzungen : 68040+   System 7.1+   6MB Ram
erh&auml;ltlich bei  :

Grundlage       : ( ) Vollversion     (X) Demo   ( ) Andere: 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
    

Einleitung :

Da ich nur ein Demo des Spieles Abuse besitze, ist der Test recht
oberflächlich. Trotzdem vermittelt er schon einen guten Eindruck, worum
es im Gro&szlig;en und Ganzen geht.


Spielbeschreibung :

Abuse wird in der Anleitung als 360&#176 voller seitw&auml;rts-scrollender Action
beschrieben. Das Spiel selbst erinnert zun&auml;chst stark an Turrican, nur
eben mit einem entscheidenden Unterschied: Abuse wird zeitgleich mit
Tastatur und Maus gesteuert. W&auml;hrend man sich mit den frei konfigurierbaren
Tasten bewegt, Waffen wechselt oder Aktionen ausf&uuml;hrt, erlaubt einem die
Maus tats&auml;chlich, um 360&#176 um sich zu ballern, was das Zeug h&auml;lt.
Verschiedene Waffen machen dabei die Arbeit des Hobby-Terminatoren zu
einem reinen Vergn&uuml;gen.
Weniger orginell als die Spielidee ist die Geschichte: Der Held wurde zu
Unrecht in ein illegales Genlabor gesperrt, in dem ein neu entdecktes Gen
alle Menschen in groteske Unholde verwandelt. Nur man selbst, wer h&auml;tte
das gedacht, ist immun gegen die Mutation, und muss nun verhindern, dass
das Gen &uuml;ber die Wasserversorgung auf die Menschheit losgelassen wird.
Wesentlich wichtiger als die Story ist aber die Grafik, die auch recht
h&uuml;bsch aussieht. Vor allem die Animationen der Spielfigur und das Design
der Mutanten (erinnern irgendwie an die Viecher aus "Aliens") wissen zu
&uuml;berzeugen.


Spielgeschwindigkeit :

Die 360&#176-Action fordert leider ihren Tribut. Auf meinem System ist das
Spiel enorm langsam. Zwar gibt es die M&ouml;glichkeit, jede zweite Zeile beim
Bildschirmaufbau wegzulassen, oder das ganze Bild auf die H&auml;lfte zu
reduzieren, der rechte Spa&szlig; will aber nicht aufkommen.

Note: 4


Fazit :

Trotz der langsamen Geschwindigkeit auf meinem System merkt man schon,
dass das Spiel sehr gut ist. Die Kombination aus Maus- und Tastatur-
steuerung klappt erstaunlich gut, und die in der Anleitung angek&uuml;ndigten
Waffen machen Lust auf die Vollversion. Sollte das Spiel mit Grafikkarte
und eventuell einem 060er Prozessor in einer h&ouml;heren Geschwindigkeit
laufen, d&uuml;rfte es einen Kauf rechtfertigen.


Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de


Zur Emulationsgeschwindigkeit:

1 = :-] = l&auml;uft in voller Geschwindigkeit
2 = :-) = ruckelt leicht, ist aber ohne Probleme spielbar
3 = :-| = ruckelt merklich und ist nur mit der n&ouml;tigen Geduld spielbar
4 = :-( = so langsam, das das Spiel keinen wirklichen Spa&szlig; macht
5 = :-[ = Das Spiel ist unspielbar langsam

Zwischenwerte (2-3) sind zul&auml;ssig.


Daedalus Encounter (Vorstellung)
--------------------------------

Name des Spiels : Daedalus Encounter
Hersteller      : Mechadaeus und Virgin Interactive
Voraussetzungen : 68040 (eventuell auch 030)
erh&auml;ltlich bei  : 

Grundlage       : ( ) Vollversion       ( ) Demo     (X) Andere: MacUP 7/95 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            


Einleitung :

Ein Genre, das nie seinen Weg auf den Amiga gefunden hat, ist das des
sogenannten "interaktiven Film", also das Ablaufen einer Handlung, auf die
der Spieler nur sehr wenig Einfluss hat. Wirft man einen Blick auf Daedalus
Encounter, das mit einem Schauspielerangebot aufwartet, welches einem
Hollywood-Streifen ebenb&uuml;rtig ist, kann man sich vorstellen, welch gro&szlig;er
und kostenintensiver Aufwand getrieben werden muss, um ein solches Spiel
in die Tat umzusetzen.


Spielbeschreibung :

W&auml;hrend eines interstellaren Raumsprungs mit Lichtgeschwindigkeit landen
die drei Hauptakteure des Spiels auf einem fremdartigen Sternenkreuzer,
der direkt auf eine Sonne zurast. Das augenscheinliche Ziel des Spieles
ist es, das Raumschiff zu erforschen und umzuleiten, um nicht als "Toast"
zu enden. Dabei trifft man unweigerlich auch auf die obligatorische
Bioform, die f&uuml;r das Massaker an der urspr&uuml;nglichen Crew verantwortlich
ist.
Soviel zur Story des Spiels. Spielerisch ist Daedalus Encounter eine
Mischung aus Film, Adventure und diversen Puzzlespielen. Der Spieler
agiert dabei haupts&auml;chlich &uuml;ber eine, mit diversen Sensoren, Kamera und
Greifarm ausgestattete Sonde. Die L&ouml;sung der R&auml;tsel erfordert mal
logisches, mal r&auml;umliches Denken, oder auch einfach nur Schnelligkeit
beim Ausprobieren verschiedener Kombinationen. Hinter jeder T&uuml;r warten
neue Abenteuer, deren l&ouml;sen mit den exzellenten Videosequenzen belohnt
wird.


Spielgeschwindigkeit :

"Das Ganze l&auml;uft erstaunlicherweise in einem 14 Zoll gro&szlig;en Monitorfenster
auch mit 68040er und Doublespeed-Laufwerk bei 16 Bit Farbe v&ouml;llig
ruckelfrei."

Geht man von diesem Zitat aus, kann man annehmen, dass das Spiel auch
auf einem Mac-Emulator in einer sehr vern&uuml;nftigen Geschwindigkeit l&auml;uft


Fazit :

Wer sich auch an seinem heimischen Amiga einfach mal entspannt
zur&uuml;cklehenn m&ouml;chte, w&auml;hrend am Monitor ein qualitativ hochwertiges
Grafikspektakel abl&auml;uft, f&uuml;r den ist dieses Spiel vermutlich genau das
richtige. Nat&uuml;rlich darf man nicht vor logischem Denken und zahlreichen
Puzzles zur&uuml;ckschrecken, ansonsten d&uuml;rfte diese Space-Odyssee, die
&uuml;brigens auf drei CDs ausgeliefert wird und etwa 2 Stunden Film enth&auml;lt,
das richtige f&uuml;r lange Abende sein.


Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de


Zur Emulationsgeschwindigkeit: statt Text kann hier auch eine Zahl stehen.

1 = :-] = l&auml;uft in voller Geschwindigkeit
2 = :-) = ruckelt leicht, ist aber ohne Probleme spielbar
3 = :-| = ruckelt merklich und ist nur mit der n&ouml;tigen Geduld spielbar
4 = :-( = so langsam, das das Spiel keinen wirklichen Spa&szlig; macht
5 = :-[ = Das Spiel ist unspielbar langsam

Zwischenwerte (2-3) sind zul&auml;ssig.


Havoc (Vorstellung)
-------------------

Name des Spiels :Havoc
Hersteller      :Reality Bites
Voraussetzungen :68040+    System 7     8MB Ram      
erh&auml;ltlich bei  :

Grundlage       : ( ) Vollversion    (X) Demo   (X) Andere:Mac Magazin 6/96 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
           

Einleitung :

Zum Spiel "Havoc" liegt mir sowohl der Testbericht des Mac-Magazins, als
auch ein spielbares Demo vor. Eins sei vorweg gesagt: weder ich, noch der
Autor des Testberichtes waren &uuml;berm&auml;&szlig;ig beeindruckt.


Spielbeschreibung :

Havoc ist ein reinrassiges Ballerspiel in einer dreidimensionalen Welt.
Nachdem man sich f&uuml;r sein Gef&auml;hrt entschieden hat, beispielsweise einen
Panzer oder ein Luftkissenboot, geht es in jedem der 35 Level darum, alles,
was einem in den Weg kommt, &uuml;ber den Haufen zu ballern, und am Ende das
"Gate-Icon" f&uuml;r den Sprung ins n&auml;chste Level aufzusammeln.
Das Spiel basiert auf Quickdraw 3D und wurde in Polygongrafik realisiert,
allerdings ist die Perspektive arg verschoben, was sich spielerschwerend
auswirkt. Auch sonst kann der optische Teil des Spieles nicht durch
Feinheiten brillieren, einzig die Hintergrundmusik f&uuml;gt sich ganz gut ins
Geschehen ein - was man leider von den Soundeffekten nicht behaupten kann.


Spielgeschwindigkeit :

Obwohl man die Detailgenauigkeit der Landschaft und der Fahrzeuge &auml;ndern
kann, ist die Geschwindigkeit erwartungsgem&auml;&szlig; nicht gerade berauschend. Man
hat die Wahl zwischen einer extrem tristen Optik, die daf&uuml;r zumindest das
Spielen erm&ouml;glicht, und einer texturierten und recht h&uuml;bschen Darstellung,
die das Ruckeln nur leider unertr&auml;glich macht. Vielleicht ist das Spiel
aber mit Grafikkarte und 060er spielbar.

Note: 3-4


Fazit:

Havoc kann wohl nur Leuten empfohlen werden, denen wildes Ballern in
3D-Umgebung Spa&szlig; macht. Zus&auml;tzlich sollten diese Leute aber auch &uuml;ber einen
schnellen Rechner und eine Grafikkarte verf&uuml;gen, damit der Spielspa&szlig; nicht
schon aufgrund des penetranten Ruckelns verloren geht.

Wertung des Artikels: 1 von 5 Punkten.


Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de


Zur Emulationsgeschwindigkeit: statt Text kann hier auch eine Zahl stehen.

1 = :-] = l&auml;uft in voller Geschwindigkeit
2 = :-) = ruckelt leicht, ist aber ohne Probleme spielbar
3 = :-| = ruckelt merklich und ist nur mit der n&ouml;tigen Geduld spielbar
4 = :-( = so langsam, das das Spiel keinen wirklichen Spa&szlig; macht
5 = :-[ = Das Spiel ist unspielbar langsam

Zwischenwerte (2-3) sind zul&auml;ssig.


Marathon (Test)
---------------

Name des Spiels : Marathon I
Hersteller      : Bungie
Voraussetzungen : 68020    System 6.0.5+    3MB Ram    256 Farben
erh&auml;ltlich bei  :

Grundlage       : (X) Vollversion       ( ) Demo      ( ) Andere:
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40    ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:_________________        
               

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            


Einleitung: 

Was beispielsweise die Alien Breed 3D-Reihe oder andere Genre-Vertreter wie
Gloom oder Nemac IV f&uuml;r den Amige sind, ist die Maratho-Reihe f&uuml;r den Mac:
Exclusive First-Person-Shooter, die nie f&uuml;r die Wintel-Platform konvertiert
wurden. Gerade diese Exklusivit&auml;t macht vielleicht den Erfolg der
entsprechenden Spiele aus; allerdings kann Marathon auch mit anderern
Qualit&auml;ten bestechen.  


Spielbeschreibung:

Marathon ist ein First-Person-Shooter im klassischen Sinne. Aus der Ego
Perspektive jagt man finstere Aliens mit einem breit gef&auml;cherten Arsenal an
Waffen hinterher, angefangen bei der einfachen Pistole bis hin zum
Flammenwerfer Marke R&ouml;stmaster 2000. Was Marathon von anderen Spielen
dieses Genres (zumindest von &auml;lteren) abhebt, ist die Storyline, die sich
im Spiel immer weiter entwickelt. Zu Beginn hat man nur das Wissen, dass
das eigene Raumschiff, die "Marathon", von unbekannten Ausserirdischen
angegriffen und gekapert wurde. Mit Hilfe der noch intakten k&uuml;nstlichen
Intelligenzen des Schiffes, Leela und Durandel, die einem mit Hilfe
sogenannter Comlinks (Monitore, die &uuml;ber das Schiff verteilt sind)
Nachrichten zukommen lassen und Anweisungen geben, erf&auml;hrt man immer mehr
&uuml;ber Herkunft und Motive der Aliens.
Neben der Hintergrundgeschichte, die dieses Spiel zu etwas Besonderem
machen, stehen nat&uuml;rlich auch immer Grafik und Sound im Vordergtund.
Erstere kann durchaus &uuml;berzeugen, Texturen und Grafiken sind gut
gezeichnet, das Alien-Design ist ansprechend. Auch der Sound kann sich
h&ouml;ren lassen. Die Hintergrundmusik ist (teilweise) sehr atmosph&auml;risch und
f&uuml;gt sich gut in das Spiel ein (obwohl man in andereren Leveln geneigt ist,
sie auszuschalten), die Soundsamples sind ebenfalls von relativ hoher
Qualit&auml;t.
Weitere Pluspunkte sind ein gutes Leveldesign, die Auto-Map, und die
M&ouml;glichkeit,  mit der entsprechenden Software komplette eigene Level zu
entwerfen.


Spielgeschwindigkeit:

Da es viele verschiedene Einstellm&ouml;glichkeiten gibt (Fenstergr&ouml;sse,
Ausgabequaltit&auml;t, Decken-und Boden-Texturen ein- und ausschalten) kann man
das Spiel recht gut an sein System anpassen. Ruckelfrei l&auml;uft das Spiel auf
meinem System leider in keiner Einstellung. Wenn man aber schon Alien
Breed 3d II auf dem Amiga durchgespielt hat, ist man an sowas sowieso
gew&ouml;hnt.

Note: 2-3


Fazit:

Wer First-Person-Shooter mag und sich bereits durch die Amiga-Vertreter
geballert hat, kann bei Marathon I ruhigen Gewissens zugreifen.


Autor : Andreas Koch
E-Mail: andreas.koch@rz-online.de


Hinweis zur Emuationsgeschwindigkeit:

1 = :-] = l&auml;uft in voller Geschwindigkeit
2 = :-) = ruckelt leicht, ist aber ohne Probleme spielbar
3 = :-| = ruckelt merklich und ist nur mit der n&ouml;tigen Geduld spielbar
4 = :-( = so langsam, das das Spiel keinen wirklichen Spa&szlig; macht
5 = :-[ = Das Spiel ist unspielbar langsam


Nethack (Vollversion)
---------------------

Name des Spiels : Nethack v.3.2
Hersteller      : Freeware
Voraussetzungen : keine
erh&auml;ltlich bei  : Mac-Shareware-Seiten

Grundlage       : (X) Vollversion       ( ) Demo      ( ) Zeitschrift: 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
        

Einleitung :

Manch einer wird sich wundern, dass an dieser Stelle ein Spiel aus der
Freeware-Welt getestet wird, das zus&auml;tzlich noch f&uuml;r den Amiga erh&auml;ltlich
ist. Daf&uuml;r gibt es aber einen ganz einfachen Grund. Nethack ist meiner
Meinung nach das beste Computerspiel, das je entwickelt wurde, auch im
kommerziellen Bereich. Und da ich die Mac-Version im Vergleich mit der
Amiga-Version f&uuml;r die bessere halte, ist dieser Test entstanden.


Spielbeschreibung :

Wer nach dieser Einleitung etwa Grafik-Orgien oder Sound-Wunder erwartet,
wird zun&auml;chst bitter ent&auml;uscht. Nethack geh&ouml;rt zur Klasse der Rogue-like
Games, das heisst, die "Grafik" beruht auf Zeichen des ASCII-Codes, Sound
ist keiner vorhanden. Diesem vermeindlichen Manko steht aber ein
brilliantes Spielprinzip gegen&uuml;ber:
Bei jedem neuen Spielbeginn wird ein zuf&auml;lliges Dungeon erzeugt, also
quasi ein Labyrinth, in das R&auml;ume eingebettet sind. Es gilt nun, die Level
zu erforschen, Gold zu sammeln, Gegenst&auml;nde einzusammeln, Monster zu
verpr&uuml;geln und  Erfahrungsstufen aufzusteigen. Nethack verwendet das
Fantasy-Genre als Hintergrund, man begegnet also mit seinem Barbaren,
Samurai, Magier, etc... fantastischem Gez&uuml;cht wie beispielsweise Orks oder
Untoten. Erschlagend ist dabei die hohe Anzahl an verschiedenen Monstern,
Gegenst&auml;nden, Zaubern und Handlungsm&ouml;glichkeiten. Ausserdem wurden viele
Feinheiten bedacht, die Nethack zu einem vollkommen abgerundeten Spiel
machen.
Eine weitere Besonderheit der Rogue-&auml;hnliche Spiele: Die Speicheroption
steht nur zur Verf&uuml;gung, um ein Spiel zu unterbrechen, nicht etwa, um alle
f&uuml;nf Schritte "erstmal den Charakter in Sicherheit zu bringen". Das h&ouml;rt
sich zwar zun&auml;chst ziemlich extrem an, begr&uuml;ndet aber das riesige Sucht-
potential, das Nethack bietet. Nach dem Tod werden alle Gegenst&auml;nde
identifiziert und eine Liste der Monster angezeigt, die man besiegt hat.
Das Wichtigste ist jedoch die Endpunktzahl, die sich aus verschiedenen
Faktoren berechnet, und Zusammen mit der Todesursache in der Top100
aufgef&uuml;hrt wird.


Spielgeschwindigkeit :

Fusion habe ich mir mit dem Gedanken geordert: "Wenn der Rest zu langsam
l&auml;uft, kann ich wenigstens Nethack spielen." Klar, denn da das Spiel auf
dem ASCII-Code beruht, gibt es auch keine Geschwindigkeitseinbu&szlig;en.

Note: 1


Fazit :

Nethack bietet ein extrem hohes Suchtpotential und ist zudem kostenlos
erh&auml;ltlich. Jeder, der keinen Wert auf Grafik oder Sound legt und die Zeit
hat, sich ein wenig in das Spiel "einzuarbeiten", sollte auf jeden Fall
mal einen Blick auf die Mac-Version werfen - es lohnt sich. Wen das
Nethack-Fieber einmal gepackt hat, der hat schnell die 100 Highscore-Pl&auml;tze
belegt, und schl&auml;gt sich immer tiefer in das Gew&ouml;lbe des "Wizards of
Yendor" vor.
Mein Platz 1 Magier liegt &uuml;brigens bei 350.000 Punkten - nur als Ansporn
f&uuml;r die Leute, die sich das Spiel angucken. Geschafft habe ich Nethack 
allerdings
noch nie...


Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de


Hinweis zur Emulationsgeschwindigkeit:

1 = :-] = l&auml;uft in voller Geschwindigkeit
2 = :-) = ruckelt leicht, ist aber ohne Probleme spielbar
3 = :-| = ruckelt merklich und ist nur mit der n&ouml;tigen Geduld spielbar
4 = :-( = so langsam, das das Spiel keinen wirklichen Spa&szlig; macht
5 = :-[ = Das Spiel ist unspielbar langsam

Zwischenwerte (2-3) sind zul&auml;ssig.


Sim City 2000 (Test) - von Ingo Schmitz &lt;schmitz@amiga-forum.de&gt;
----------------------------------------------------------------

Eines der Kult-Computerspiele &uuml;berhaupt d&uuml;rfte Sim City von Maxis sein.
Die geniale Spielidee hat zusammen mit der einfachen Spielbarkeit und der
schier endlosen Motivation dazu beigetragen, dass dieses Spiel ein grosser
Erfolg wurde. Auch Sim City 2000 basiert auf dieser Spielidee und brachte
in das (erstaunlicherweise nie erfolgreich kopierte) Spiel noch einige
sinnvolle Erweiterungen ein.

Ziel des Spiels ist es eine Stadt zu erschaffen. Man mu&szlig; Platz f&uuml;r die
Bewohner, das Gewerbe und die Industrie schaffen, Strassen bauen und so in
seiner eigenen Stadt eine Infrastruktur aufzubauen, um die Stadt attraktiv
zu gestalten und so auch letztlich Steuereinnahmen zu sichern. Als 
Alternative zum Aufbau einer eigenen Stadt kann man auch ein bestehendes 
Szenarium laden, in dem eine bestimmte Mission zu erf&uuml;llen ist. Bei der 
Version von Sim City 2000, die hier besprochen wird, ist au&szlig;erdem das 
"Urban Renewal Kit" dabei, mit dem man eigene Grafiksets erstellen kann und 
neue Geb&auml;ude erschaffen kann.

Kenner der Amiga-Version von SC 2000 sind geschwindigkeitsm&auml;&szlig;ig leider 
nicht sehr verw&ouml;hnt, was daran liegt, dass Sim City 2000 nur in hoher 
Aufl&ouml;sung in 256 Farben nur auf AGA l&auml;uft, auf Grafikkartenmodi ist die 
Grafik leider v&ouml;llig zerst&ouml;rt. Erfreulicherweise ist die Mac-Version von 
Sim City 2000 auf meinem Rechner (Blizz PPC 040/25, AGA ; MacOS 7.5.3) in 
Verbindung mit dem TurboEVD f&uuml;r ShapeShifter wesentlich schneller als die 
Amiga-Version. In Multiscan 256-Farben ist SC 2000 um ein vielfaches besser 
spielbar als die Amiga-Version.
Auch grafisch sind die beiden Versionen sehr &auml;hnlich, wobei ich meine, dass
die Amiga-Version ein wenig farbenfroher ist. Noch besser haben es da 
freilich die Besitzer von Grafikkarten. Auf einem 060/50 mit CVision 64/3D 
ist die Mac-Version in 1024*768 rasend fix!! Wobei auch auf 030er und 
Grafikkarte noch eine akzeptable Geschwindigkeit erreicht wird. Auf AGA und 
030 sehe ich geschwindigkeitsm&auml;&szlig;ig allerdings schwarz. Nat&uuml;rlich ist die 
getestete Version komplett deutsch. Freuen k&ouml;nnen sich in Zukunft auch 
Besitzer eines (evtl. kommenden) Powermac-Emulators, denn die getestete 
Version (Sim City 2000 SE, aufgelegt von EOA f&uuml;r die Serie "cd rom 
classics") ist eine FatBinary-Version, so da&szlig; das Programm auf einem 
PowerPC noch einen Geschwindigkeitsschub bekommt.
Am Rande sei au&szlig;erdem noch angemerkt, dass auch der CD noch 3 PC-Versionen
enthalten sind (DOS/Win31/Win95) ;-( .

Fazit: Wer Sim City 2000 liebt und Blut und Wasser &uuml;ber die Amiga-Version
       geheult hat, dem sei die Mac-Version w&auml;rmstens ans Herz gelegt.
       Die Geschwindigkeit l&auml;&szlig;t vergessen, dass das Spiel auf einer         
       Emulation l&auml;uft. Au&szlig;erdem ist das Spiel in jedem gr&ouml;sseren Kaufhaus  
       (Kaufhof, Karstadt...) f&uuml;r ca. 40 DM erh&auml;ltlich.  Eine ganz klare    
       Kaufempfehlung!!!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
