<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Update: So senkt ihr eure Telekom-Rechnung!

Die 'Sonnenfinsternis'-Aktion von Talkline (kostenloser Internet-Zugang am 
11. August) ist erfolgreicher verlaufen als ich zu hoffen gewagt hatte: 
Zwar war das Netz fast st&auml;ndig &uuml;berlastet, sprich dauerbesetzt, jedoch kam 
man mit etwas Gl&uuml;ck und einiger Geduld doch ab und zu durch. Hauptgrund 
daf&uuml;r d&uuml;rfte gewesen sein, dass Talkline nur einen 45-min&uuml;tigen Internet-
Aufenthalt am St&uuml;ck zulie&szlig; und die Verbindung nach dieser Frist unterbrach, 
womit einem anderen User die M&ouml;glichkeit gegeben wurde, sich einzuw&auml;hlen. 
Allerdings scheinen, wie mir berichtet wurde, nicht alle User von dieser 
Unterbrechnung betroffen gewesen zu sein.

Mit Debitel hat sich zum ersten Mal eine bekannte Telefongesellschaft 
vollst&auml;ndig vom offenen Call-by-Call zur&uuml;ckgezogen, was Auswirkungen auf 
die Tariftabelle hatte.

In den letzten Wochen haben mir mehrere Leser mitgeteilt, dass sie die 
Telefongesellschaft 01051 in ihrer Region problemlos nutzen k&ouml;nnen. Bei mir 
ist das Netz jedoch fast st&auml;ndig &uuml;berlastet.
F&uuml;r alle, die 01051 nutzen k&ouml;nnen: Die Gesellschaft ist mo-fr von 9-18 Uhr 
mit 9 Pfennig pro Minute (Festnetz -&gt; Festnetz) bzw. 40 Pfg. pro Minute 
(Festnetz -&gt; Mobilfunknetz) g&uuml;nstiger als Viatel bzw. TelDaFax. 
Ausprobieren kann sich also lohnen. Die Vorwahl lautet nat&uuml;rlich 01051.
Bitte gib unter aakt@gmx.de Bescheid, ob du 01051 nutzen kannst oder nicht.

Ebenfalls hochinteressant ist die Tarifstruktur von Telegate (01080): Denn 
im Festnetz unterbietet dieses Unternehmen den jeweils zweitg&uuml;nstigsten 
Anbieter zu jeder Zeit um 0,1 Pfg. pro Minute, bei Gespr&auml;chen ins 
Mobilfunknetz ist Telegate immerhin mo-fr von 9-18 Uhr nach 01051 der 
zweitg&uuml;nstigste Anbieter. Der einzige Grund, warum Telegate noch nicht in 
die Tariftabelle aufgenommen wurde: Der Service l&auml;sst sich noch nicht 
bundesweit nutzen. Das soll sich aber bis Mitte September ge&auml;ndert haben.


Jetzt aber zur aktuellen Tarif&uuml;bersicht:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-17 Uhr      Viatel (01079), 10,25 Pfg. TelDaFax (01030), 48 Pfg.
werktags 17-18 Uhr      Interoute (01066), 8 Pfg. TelDaFax (01030), 48 Pfg.
werktags 18-19 Uhr      Interoute (01066), 8 Pfg.   Viatel (01079), 36 Pfg.
werktags 19-20 Uhr      Mobilcom (01019), 8 Pfg.    Viatel (01079), 36 Pfg.

sa/so/feiert. 9-18 Uhr  Drillisch (010050), 7 Pfg. Viatel (01079), 36 Pfg.¹
sa/so/feiert. 18-20 Uhr Drillisch (010050), 7 Pfg.  Viatel (01079), 36 Pfg.

t&auml;glich 20-21 Uhr       3U (01078), 5,9 Pfg.        Viatel (01079), 36 Pfg.
t&auml;glich 21-22 Uhr       o.tel.o (01011), 4 Pfg.     Viatel (01079), 36 Pfg.
t&auml;glich 22-7 Uhr        Talkline (01050), 3,9 Pfg.  Viatel (01079), 36 Pfg.
t&auml;glich 7-8 Uhr         Esprit (01040), 5 Pfg.      Viatel (01079), 36 Pfg.
t&auml;glich 8-9 Uhr         Viatel (01079), 5 Pfg.      Viatel (01079), 36 Pfg.

¹: An Feiertagen, die nicht aufs Wochenende fallen, ist TelDaFax (01030)     
   mit 48 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDafax, Debitel und 3U rechnen sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die die Verbindung andauert.

* Viatel berechnet mo-fr zwischen 9 und 18 Uhr bei Verbindungen bis 30      
  Sekunden Dauer die gesamten 30 Sekunden, danach wird exakt abgerechnet. 
  Zu anderen Zeiten wird minutenweise abgerechnet.
  ACHTUNG: An Feiertagen, die nicht aufs Wochenende fallen, rechnet Viatel  
  nach dem Werktags-Tarif ab.

* Drillisch berechnet bei Verbindungen bis 60 Sekunden Dauer die gesamten   
  60 Sekunden, danach wird im 15-Sekunden-Takt abgerechnet.

* Mobilcom, o.tel.o, Talkline, Esprit, 01051 und Interoute rechnen          
  minutenweise ab.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
