<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
  vlink="#000080" bgcolor="#b0b0b0">
    <CENTER>
      <BR>
      <IMG src="../el.gif" width="365" height="45" alt=""><BR>
       

      <H2><B>zur NoCover #103 (03.10.2002)</B></H2>
      <IMG src="el2.gif" alt=""> 

      <TABLE summary="" width="96%">
        <TR>
          <TD>
            <P>Liebe Leser(Innen) !</P>

            <P>Die NoCover ist tot - es lebe die NoCover !</P>

            <P>Diese Einf&uuml;hrung ist wohl nicht ganz das Richtige, aber mir
            f&auml;llt irgendwie leider kein passender Anfang ein. Die meisten Leser
            haben wohl das Hickhack der letzten Tage mitbekommen und irgendwie kam ich
            nicht dar&uuml;ber hinweg, dass dies mit der NoCover nun gewesen sein soll.
            Gut gut, es gab viele Kultmagazine aller Couleur, haupts&auml;chlich zur
            Zeit der "Disketten", die auch pl&ouml;tzlich so ganz ohne Abgesang einfach
            weggeblieben sind. Aber warum soll dieses Schicksal die NoCover auch
            ereilen?</P>

            <P>Der gr&ouml;&szlig;te Fehler, der zuletzt gemacht wurde, war die
            permanente Meinung weniger Besserwisser, die immer sagten, in einem
            Amigamagazin hat nur etwas &uuml;ber Amiga zu stehen. Irgendwie einesteils
            nachzuvollziehen und trotzdem ist diese Meinung falsch. Wir leben nicht
            mehr in der Zeit, wo Neuigkeiten mindestens vier Wochen Zeit
            ben&ouml;tigten, um bekannt zu werden. Dazu gibt es in der jetzigen Zeit
            elektronische Informationsquellen, die t&auml;glich aktualisiert sind. Also
            ist die NoCover als Plattform hierf&uuml;r vollkommen das falsche
            Informations-Mittel.</P>

            <P>Was ist die NoCover also? Die Frage kannst du als Leser doch selbst
            sofort beantworten. Warum liest du gerade diese Zeilen? Bestimmt nicht, um
            hier zu erfahren, was nun mit dem AmigaOne los ist. Kommt er oder kommt er
            nicht? Ist dies nun ein potentieller Nachfolger f&uuml;r den A4000 oder
            habe ich mal wieder etwas verkehrt verstanden? Was ist nun mit Amithlon?
            Ist dies nun ein Amiga oder doch nicht? Was ist besser OS 3.9 oder das OS
            4.0? Was ist der Unterschied und wer kann es nehmen und wer leider doch
            nicht nehmen?</P>

            <P>Eigentlich alles Fragen, die ihr meist schon wisst und nicht zum xten
            Mal verkehrt definiert er&ouml;rtert sehen wollt. Hier in der NoCover
            erwartet ihr bestimmt keine Antwort, sondern nur ein Essay vom xxx, eine
            Persiflage vom yyy oder einen Leserbrief bzw ein Hilfeersuchen.</P>

            <P>Selbstverst&auml;ndlich w&auml;re es sehr begr&uuml;&szlig;enswert, wenn
            ihr Tools, die ihr entdeckt habt, beschreibt und erkl&auml;rt. Oder
            meinethalben auch &uuml;ber Systeme diskutiert. Die NoCover ist doch ein so
            wunderbares Mittel, um sich zu unterhalten, seine Meinung loszuwerden und
            auf Resonanz zu hoffen.</P>

            <P>Aus diesem Grunde habe ich beschlossen, die NoCover nicht sterben zu
            lassen und sie weiter mit euren Beitr&auml;gen zusammenzustellen, auch wenn
            meine Infrastruktur nicht besonders hierf&uuml;r geeignet ist. Irgendwie
            wird es schon gehen. Und wenn ich in meinen &Auml;u&szlig;erungen nicht
            immer eure L&auml;ngenwelle erreiche und meine S&auml;tze manchmal etwas
            antiquiert klingen - vergesst bitte nicht, ich bin schon 62(&frac12;).</P>

            <P>Und nun w&uuml;nsche ich viel Spa&szlig; beim Lesen der eingesandten
            Beitr&auml;ge !<BR> Wolf.</P>

            <P align="center"><IMG src="el2.gif" alt=""></P>

            <P>Nun hier das letzte vorbereitete (und &uuml;berholte) Editorial von
            Kilian:</P>

            <P><B>Hi Folks!</B></P>

            <P>Es geht etwas in Sachen NoCover, was man nicht zuletzt am
            Erscheinungsbild dieser Ausgabe merken kann. Stillschweigend hat sich
            n&auml;mlich auch ein Wechsel an der Chefredakteuersfront vollzogen, der
            mit dieser Ausgabe auch offiziell wird: Ich trete ganz offiziell ab und
            Thorsten Schl&ouml;zel &uuml;bernimmt von nun an das Ruder der NC und
            f&uuml;hrt diese in - hoffentlich - ruhigere Gew&auml;ssern.</P>

            <P>Warum das ganze? Nun, als Andreas mich damals gebeten hatte die NC zu
            &uuml;bernehmen, bin ich mit viel Enthusiasmus an die Sache gegangen und
            habe versucht, die NC wieder zu dem zu machen, was sie einmal war. Gewisse
            Bereiche konntent zwar erfolgreich erneuert werden - so etwa die
            Mitgliederliste und die Einf&uuml;hrung des kostenlosen E-Mail Abos - aber
            insgesamt gesehen habe auch ich es nicht geschafft, die NC dauerhaft zu
            st&auml;rken. Insbesondere die Tatsache, dass immer weniger Artikel
            eintrudelten hat mir doch arg zu schaffen gemacht....</P>

            <P>Hinzu kommt, dass ich mit meinem Engagement bei der AMIGAplus und einem
            Musikmagazin zeitlich gen&uuml;gend belastet bin, zumal ab Oktober auch das
            Jura Studium beginnt. Klar, ich h&auml;tte die NC weiter herausbringen
            k&ouml;nnen - allerdings dann auf Spaarflamme, was dem Magazin auf Dauer
            nur geschadet h&auml;tte und schon gar keine neuen Leser angezogen
            h&auml;tte. Gro&szlig;artige Erneuerungen w&auml;ren somit auf Dauer nicht
            machbar gewesen. Thorsten Schl&ouml;zel hat mir seine Vorschl&auml;ge
            erkl&auml;rt und mich davon &uuml;berzeugt, das er der richtige Mann
            f&uuml;r diese Aufgabe ist - ansonsten h&auml;tte ich die NC, derren
            Werdegang ich weiterhin verfolgen werde, auch nicht abgegeben.</P>

            <P>Bedanken m&ouml;chte ich mich im folgenden bei allen Personen, die mir
            in meiner Amtszeit geholfen haben, die NC aufrecht zu erhalten. Ich
            m&ouml;chte an dieser Stelle keine Namen nennen - es waren sehr viele, die
            im Hintergrund aktiv mitgearbeitet haben und mit denen ich bestimmt auch in
            Kontakt bleiben werde.</P>

            <P>Alles gute und wir lesen uns in Zukunft bestimmt in der NC. See ya,
            <B>Kilian <BLINK>"The Bruce"</BLINK> Servais</B></P>
          </TD>
        </TR>
      </TABLE>

      <P><IMG src="el2.gif" alt=""></P>

      <H3><B><A href="../nc/index.html">zur NoCover</A> &nbsp;
      &nbsp; <A href="../aa/index.html">zu AmigaAktuell</A> &nbsp;
      &nbsp; <A href="../index.html">zum Start</A></B></H3>
    </CENTER>
    <BR>
  </BODY>
</HTML>

