<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 10/97 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
<!-- Net-Trak Plain HTML v2.0 START -->
<CENTER>
<a href="http://net-trak.stats.net/cgi-bin/stats/stats?account_id=1099& page_id=1097" target="_top">
<img ALT="Counter" src="http://net-trak.stats.net/cgi-bin/trakker?account_id=1099& page_id=1097&image=1" width=88 height=49 border=0></a><BR>
Besucher seit 01.10.1997</CENTER>
<!-- Net-Trak Plain HTML v2.0 END -->
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<CENTER><H1>AMIGA-aktuell-Forum</H1></CENTER>
Dies ist eine neue Rubrik, die probeweise in AMIGA aktuell eingef&uuml;hrt wird.
In ihr sind die (bei den meisten anderen Magazinen getrennt gef&uuml;hrten)
Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke" zusammengefa&szlig;t.
Wenn Ihr also m&ouml;chtet, da&szlig; diese Rubrik erhalten bleibt, dann beteiligt
Euch bitte an ihr!<P>
Die Adresse:<P>
Carsten Schr&ouml;der<BR>
Helmoltstra&szlig;e 10<BR>
37081 G&ouml;ttingem<P><BR>
E-Mail: c<A HREF="mailto:schroe@stud.uni-goettingen.de">schroe@stud.uni-goettingen.de</A><P>
<BR>
Zur Premiere habe ich drei Beitr&auml;ge von Euch bekommen:
<OL>
<A NAME="001"></A>
<LI><B>Kleinanzeige: Kickstart- und WBStart-Disketten f&uuml;r A 1000 gesucht</B><BR>
&#171;Gesucht werden die Kickstart- und WBStart-Disketten f&uuml;r Amiga 1000,
Originale oder Kopien, zum Testen eines alten Ger&auml;tes.<P>
Kosten werden gern &uuml;bernommen.<BR>
Bitte Kontaktaufnahme mit<P>
Gernod Schomberg<BR>
<A HREF="mailto:g.schomberg@t-online.de">g.schomberg@t-online.de</A>&#187;<BR>
...oder &uuml;ber AMIGA aktuell!
<P><CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A></CENTER>
<A NAME="002"></A>
<LI><B>Problem: CD-ROM-Laufwerk und Shapeshifter</B><BR>
Michael Preu&szlig; ist es nicht gelungen, sein PCMCIA-CD-ROM-Laufwerk beim
Shapeshifter anzumelden. Wer wei&szlig; Rat? Schreibt bitte an AMIGA aktuell!
<P><CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A></CENTER>
<A NAME="003"></A>
<LI><B>Leserbrief: Wolfgang G. Wettach</B><BR>
&#171;Aakt.2/97 war das erste der Reihe, das ich gelesen habe, aber f&uuml;r die 8/97
m&ouml;chte ich mich doch mal lobend zu Wort melden. Ich lese ja eigentlich die
meisten &uuml;ber das AmiNet verbreiteten Amiga-Zines, von AmigaMonitor,
AmigaMetaFileFormat, ExecBase &uuml;ber -vor allem- den AmigaReport bis zum
StarMag und AmZeiger. Dazu immer das AmigaMagazin, meist die APlus und nie
die Spezial (keine Spielezeitschriften). Ich habe daf&uuml;r das Lesen der FIDO-
und UseNet-Foren zum Amiga derzeit aufgegeben, weil die Diskussionen mit
frustrierten ExAmiganern und pubertierenden Wintel-Spielefreaks einfach zu
nervig sind.<P>
Ob es zu kritisieren ist, dass die AAkt jetzt auch Pressemitteilungen
bringt? Wahrscheinlich, weil es f&uuml;r mich oft Wiederholungen sind. Da wird's
nicht besser, wenn das AMag sich auch vornehmlich auf Pressemitteilungen
st&uuml;tzen mu&szlig; und umgekehrt die EZines dann wieder das AMag zitieren (oder
kritisieren).<P>
Insgesamt bietet das Aakt das was es verspricht: Informationen zum Amiga,
die recht aktuell und vor allem knapp genug gehalten sind, so da&szlig; mensch
sich schnell einen &Uuml;berblick verschaffen kann. Vielleicht ein deutscher AR?
W&auml;r' ganz gut.<P>
Was die Zukunft des Amiga angeht, so frage ich mich, ob Gateway2000 nicht
zu bed&auml;chtig ist darin, auf andere zu reagieren, etwa auf die vielen
W&uuml;nsche und Anfragen nach Kooperation bez&uuml;glich des Amiga. Ich h&auml;tte mir
bei der vorhandenen Marktmacht durchaus einen Amiga-Eigner vorstellen
k&ouml;nnen, der mit weiterem Kleingeld die Streith&auml;hne Dietrich und Huber
zwangsvereinigt - als Tochterfirmen und Entwicklungsabteilungen von AI...
Es lohnt sich, den Amiga-H&auml;ndlern genau zuzuh&ouml;ren, um Tendenzen ablesen zu
k&ouml;nnen. Nur wenige trauen Petro zu, den Amiga wieder dorthin zu f&uuml;hren
wohin er geh&ouml;rt - an die technische Spitze als Maschine von der viele
tr&auml;umen und von der viele eine Light-Version (TransAM?) erwerben m&ouml;chten
und k&ouml;nnen.<P>
Ich glaube an die Zukunft der Amiga-Technologie - wenn sie nur in gen&uuml;gend
H&auml;nde gelangt. Umso wichtiger, da&szlig; jetzt rasch weitere Lizensierungen
stattfinden... Ich glaube auch an die Zukunft von pOS - sobald es mit mehr
als 150 Mhz getaktet wird. PIOS und pOS liegen ja schon klanglich sehr nahe
beieinander... Ein wirklicher Erfolg kann pOS aber nur werden, wenn es eine
existierende Benutzergruppe erobert und nicht wie BeOS eine neue treue
Fangemeinde aufbauen mu&szlig; (oder wie ReBOL will). Das bedeutet pOS mit
PowerUP-Unterst&uuml;tzung auf meinem A4000T ist meine Wunschl&ouml;sung, ein Wunsch,
der erf&uuml;llbar sein sollte und auch den Nutzen der PowerUP-Karten erh&ouml;hen
w&uuml;rde, wenn n&auml;mlich nicht nur einzelne Programme sondern ein ganzes (das
ganze) Betriebssystem von der neuen Rechenleistung profitieren w&uuml;rde.<P>
Die Amiga Translators' Organization ATO &uuml;bersetzt nicht nur die wichtigsten
Internet-Programme in die vielen Sprachen der Amiga-Nutzer (und tr&auml;gt so
dazu bei, da&szlig; der Amiga auch in Zukunft die benutzerfreundlichste Plattform
bleibt), sondern hat mit der &Uuml;bersetzung der pOS-Entwicklerdokumente ins
Englische auch einen Beitrag f&uuml;r die Amiga-Zukunft geleistet und vielen
Entwicklern so die Programmierung f&uuml;r pOS erst m&ouml;glich gemacht.<P>
Arbeiten wir weiter f&uuml;r unseren Amiga - auf unserem Amiga!
Oder wie es jemand im AmigaReport so richtig sagte: JUST USE IT!&#187;</OL>
<CENTER><BR><A HREF="0003.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0005.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 10/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0006.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0011.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0021.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0033.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0038.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0043.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0047.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0055.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0056.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="0057.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

