<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 10/97 - Intern</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amint.gif" ALT="Amiga-Aktuell 10/97 - Intern" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
<!-- Net-Trak Plain HTML v2.0 START -->
<CENTER>
<a href="http://net-trak.stats.net/cgi-bin/stats/stats?account_id=1099& page_id=1097" target="_top">
<img ALT="Counter" src="http://net-trak.stats.net/cgi-bin/trakker?account_id=1099& page_id=1097&image=1" width=88 height=49 border=0></a><BR>
Besucher seit 01.10.1997</CENTER>
<!-- Net-Trak Plain HTML v2.0 END -->
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<CENTER><H1>Auswertung der Umfrage in Ausgabe 8/97</H1></CENTER>
Vielen Dank nochmals an die 37 Leser, die an der in AMIGA aktuell 8/97
ver&ouml;ffentlichten Umfrage teilgenommen haben. Mit Ausnahme der Fragen 18 und
19 (dabei ging es um die Systemausstattung der Leser, auf die ich das
n&auml;chste Mal genauer eingehen werde) habe ich die gesamte Umfrage
statistisch aufbereitet. Der Einfachheit halber habe ich allerdings keine
Verkn&uuml;pfungen, wie z.B. "Wieviele der Leser, die AMIGA aktuell von der
NoCover her kennen (Frage 1), haben einen Internetanschlu&szlig; (Frage 20),
untersucht. Dies h&auml;tte einen weiteren betr&auml;chtlichen Aufwand bedeutet.<P>
Nach der Auswertung k&ouml;nnt Ihr noch ein Fazit von mir lesen.<P>
Bevor ich zu den Fragen komme, noch eine Anmerkung:<P>
Einige Teilnehmer haben nicht alle Fragen beantwortet, zum Teil wegen eines
Fehlers in der HTML-Version, aber auch aus Gr&uuml;nden, die mir verborgen
geblieben sind... Trotzdem habe ich diese Einsendungen bei der
Preisverleihung in der letzten Ausgabe ber&uuml;cksichtigt. Allerdings
resultiert daraus bei manchen Fragen eine geringere Gesamtstimmenanzahl als
37.<P>
Nun aber zur Auswertung:<P>
<B>1. Woher kennst Du AMIGA aktuell?</B><BR>
Die &uuml;berwiegende Zahl der Teilnehmer kennt AMIGA aktuell aus dem Aminet,
eine gro&szlig;e Minderheit aus dem Diskettenmagazin NoCover, in dem AMIGA
aktuell bis 1996 exklusiv ver&ouml;ffentlicht wurde. Andere Antworten kamen nur
vereinzelt.<P>
<B>2. Seit wann liest Du AMIGA aktuell?</B><BR>
Bei Ber&uuml;cksichtigung der ersten Frage ist es nicht schwer zu erraten, da&szlig;
die meisten Einsender AMIGA aktuell erst in diesem Jahr kennengelernt
haben, einige kennen das Magazin jedoch schon von der NoCover-
Exklusivverbreitung her.<P>
<B>3. Welche Gesamtnote (1=sehr gut, 6=ungen&uuml;gend) w&uuml;rdest Du AMIGA aktuell
geben?</B><P>
Folgende Antworten wurden gegeben:<PRE>

Note Anzahl
-----------
1    8 mal
1-2  1 mal
2    23 mal
3    3 mal   Die Noten 4 bis 6 waren nicht vertreten.

</PRE>
Daraus ergibt sich eine Durchschnittnote von 1,84.<BR>
Mit einem guten Ergebnis war zu rechnen. Denn wer liest schon ein Magazin,
das ihm nicht gef&auml;llt?! Da&szlig; AMIGA-aktuell im Durchschnitt aber sogar besser
als mit Note 2 bewertet wird, war eine sehr angenehme &Uuml;berraschung!<P>
<B>4. Liest Du noch andere AMIGA-News-Magazine?</B><BR>
Bei dieser Frage lag die Betonung auf "News", vielleicht h&auml;tte ich dieses
Wort hervorheben sollen. Ich war also nicht an gemischten AMIGA-Magazinen
interessiert.<P>
Die allermeisten Teilnehmer lesen keine weiteren Newsmags, lediglich eine
Minderheit nutzt neben AMIGA aktuell mehr oder weniger regelm&auml;&szlig;ig auch
andere Nachrichten-Magazine.<P>
<B>4j. Wenn ja, welche?</B><BR>
Die h&auml;ufigste Nennung war hier mit f&uuml;nf Stimmen der englischsprachige AMIGA
Report, andere Mags waren nur vereinzelt vertreten.<P>
<B>5. Soll AMIGA aktuell einen m&ouml;glichst hohen Eigentext-Anteil, also viele
selbst verfa&szlig;te Artikel, enthalten?</B><BR>
Einer klare Mehrheit ist dieser Punkt egal, die &uuml;brigen Teilnehmer
votierten mit "Ja", Nein-Stimmen gab es - beinahe erwartungsgem&auml;&szlig; - nicht.<P>
<B>6. W&uuml;rdest Du die Aussage "Je umfangreicher AMIGA aktuell, desto besser"
unterst&uuml;tzen?</B><BR>
Eine deutliche Mehrheit von 22 Stimmen spricht sich f&uuml;r diese Aussage aus,
14 Leser sind dagegen.<P>
<B>7. Soll AMIGA aktuell zu bestimmten Themen auch die pers&ouml;nliche Meinung des
Autors (&uuml;ber Kommentare) widerspiegeln, oder eher die Rolle eines neutralen
Beobachters &uuml;bernehmen?</B><BR>
Eine klare Mehrheit (21 Stimmen) hat f&uuml;r die Beibehaltung von pers&ouml;nlichen
Kommentaren votiert, sechs sind dagegen, und acht Einsendern ist es egal.<P>
<B>8. St&ouml;ren Dich englischsprachige Texte?</B><BR>
Eine der strittigsten Fragen &uuml;berhaupt: 19 Leser haben nichts gegen
englischsprachige Texte, fast genauso viele, n&auml;mlich 18, f&uuml;hlen sich durch
sie gest&ouml;rt.<P>
<B>9. Bist Du an den Presseerkl&auml;rungen von AMIGA-Firmen interessiert?</B><BR>
Auf diese Frage gab es ein eindeutiges Votum: Eine klare Mehrheit findet
die Presseerkl&auml;rungen von AMIGA-Firmen interessant, nur wenige m&ouml;chten sie
aus AMIGA aktuell entfernt sehen.<P>
<B>10. Soll in AMIGA aktuell auch &uuml;ber den AMIGA nur indirekt betreffende
Entwicklungen (Bsp.: Rechner von Pios) berichtet werden?</B><BR>
Auch hier haben die meisten mit "Ja" gestimmt, allerdings ist es vielen
auch schlicht und ergreifend egal.<P>
<B>11. W&uuml;nschst Du Dir, da&szlig; dem Spielebereich in AMIGA aktuell ein hoher
Stellenwert einger&auml;umt wird?</B><BR>
Diese Frage war sehr strittig: Jeweils etwas ein Drittel sprach sich f&uuml;r
"Ja" / "Nein" aus bzw. enthielt sich der Stimme.<P>
<B>12. Soll AMIGA aktuell in erster Linie ein News-Mag bleiben oder in Zukunft
auch Produkttests o.&auml;. ber&uuml;cksichtigen?</B><BR>
Klare Mehrheit: 26 der Teilnehmer sind f&uuml;r einen &Uuml;bergang zu einem Voll-
Magazin, zehn sprachen sich dagegen aus.<P>
<B>13. Sind die Fragen des Gewinnspiels zu einfach?</B><BR>
Aus Erfahrung wei&szlig; ich, da&szlig; viele bei einer solchen Frage eher zu einem
"Nein" tendieren... Jedenfalls haben 21 Leute so votiert, es gab 13 Ja-
Stimmen. Ich habe beschlossen, das Konzept des Gewinnspiels ab dieser
Ausgabe etwas zu &auml;ndern, mehr dazu direkt beim Gewinnspiel.<P>
<B>14. Bislang lose ich die Gewinner mit Hilfe eines Zufallszahlen-Generators
aus. H&auml;ltst Du es f&uuml;r besser, wenn in Zukunft immer der 10., 20. und 30.
Einsender mit den richtigen L&ouml;sungen gewinnt?</B><BR>
Hier kam von den allermeisten ein (teilweise) kategorisches "Nein".
Offenbar ist das Vertrauen in einen Zufallszahlen-Generator immer noch am
gr&ouml;&szlig;ten... Acht Leser stimmten f&uuml;r "Egal", "Ja"-Stimmen gab es keine.<P>
<B>15. Welche Rubrik(en) von AMIGA aktuell findest Du am besten?</B><BR>
Auf dem ersten Platz liegt hier die Ger&uuml;chtek&uuml;che, was mich pers&ouml;nlich
etwas &uuml;berrascht hat. Es folgen die verschiedenen News-Rubriken (Diverse
Neuigkeiten, Newsflash, PowerUp-to-date usw.), und mit etwas Abstand das
Gewinnspiel. Sechs Leser finden alle Rubriken gleich gut.<P>
<B>16. Und auf welche Rubrik(en) k&ouml;nnte Deiner Meinung nach verzichtet werden?</B><BR>
Die allermeisten Einsender wollen auf keine Rubrik verzichten, ansonsten
gab es ganz vereinzelte Nennungen. Lediglich f&uuml;r eine Abschaffung des
Spieleteils votierten vier Leser.<P>
<B>17. Was ist Deiner Meinung nach an AMIGA aktuell (sonst noch) zu
verbessern?</B><BR>
Kritikpunkte wurden nur vereinzelt ge&auml;u&szlig;ert. Die h&auml;ufigste Nennung betraf
das Design der AMIGAGuide-Version. Dazu werde ich mir etwas &uuml;berlegen.<P>
<B>Die Fragen 18 und 19 werden in der n&auml;chsten Ausgabe behandelt.</B><P>
<B>20. Hast Du einen Zugang zum Internet?</B><BR>
Erfreulicherweise scheint bei den AMIGA-Anwendern die Nutzung des Internets
zur Normalit&auml;t geworden zu sein: Weit mehr als 2/3 der Umfrageteilnehmer
haben einen Zugang zum Internet.<P>
<B>21. Spielst Du mit dem Gedanken, auf ein anderes Computersystem
umzusteigen?</B><BR>
Vom Ausgang dieser Frage war ich positiv &uuml;berrascht. Die &uuml;berw&auml;ltigende
Mehrheit der Teilnehmer will auch in Zukunft auf den AMIGA setzen.
Lediglich drei Anwender planen die Aufgabe des AMIGA-Systems und den Kauf
eines anderen Computers.<P>
<B>21j. Wenn ja, auf welches?</B><BR>
Der Standard-PC kommt hier noch am ehesten in Frage, vier Leser planen,
sich ein solches Ger&auml;t anzuschaffen. Einmal wurde der Macintosh genannt.
Ein Teil derjenigen, die sich einen anderen Rechner zulegen wollen, haben
ihre Absicht bekundet, den AMIGA weiterhin zu benutzen und die Frage 21 aus
diesem Grund mit "Nein" beantwortet.<P>
<B>22. Wie beurteilst Du die bisherige Arbeit von AMIGA International (1=sehr
gut, 6=ungen&uuml;gend)?</B><BR>
Bei dieser Frage waren sich die Leser in ihrer Uneinigkeit einig ;-) , wie
die folgende Notentabelle verdeutlicht:<P>
<PRE>
Note Anzahl
-----------
1    2 mal
1-2  1 mal
2    7 mal
2-3  1 mal
3    10 mal
4    5 mal
5    2 mal           Die Note 6 war nicht vertreten.
</PRE>
Das ergibt einen Durchschnitt von 2,86.<P>
Da ich die Entwicklung in dieser Frage sehr interessant finde, werde ich
sie in einer der n&auml;chsten Ausgaben des Gewinnspiels erneut stellen.<P>
<B>23. Glaubst Du, da&szlig; die Verbreitung des AMIGAs in Zukunft wieder zunehmen
wird?</B><BR>
Auch hier waren sich die AMIGA-aktuell-Leser uneins: Zehn antworteten mit
"Ja",  acht mit "Nein", und wiederum zehn zogen sich mit einem "wei&szlig; nicht"
aus der Aff&auml;re.<P>
<B>24. Von welcher AMIGA-Firma erwartest Du Dir pers&ouml;nlich am meisten f&uuml;r die
Zukunft?</B><BR>
Hier lag - weit vor AMIGA International (AMIGA, Inc. gab es, als die
Umfrage aktuell war, noch nicht) - eine andere Firma ganz eindeutig an der
Spitze: phase 5 digital products, der Hersteller von PowerUp-, 68K- und
Grafikkarten f&uuml;r den AMIGA. Diesem Unternehmen schenkten 23 Leser ihr
Vertrauen, AMIGA International dagegen bekam nur acht Stimmen. Etwas
&uuml;berrascht war ich vom guten Abschneiden des Softwareunternehmens Haage &amp;
Partner, die mit sechs Stimmen den dritten Platz belegen, wohl aufgrund der
hohen Qualit&auml;t ihrer Produkte (z.B. Storm C). Als einzige Spielefirma war
Clickboom mit zwei Stimmen vertreten.<P>
<B>25. Eine unverbindliche Frage: Kannst Du Dir vorstellen, an AMIGA aktuell
mitzuarbeiten?</B><BR>
Immerhin 13 Leser sind dazu bereit, dieselbe Zahl sieht dazu keine
M&ouml;glichkeit.<P>
<H3>Fazit:</H3>
Insgesamt betrachtet hat die Umfrage ihren Zweck erf&uuml;llt. Sie hat gezeigt,
was an AMIGA aktuell gut ist, und was eventuell besser gemacht werden kann.
Ich versuche, die W&uuml;nsche der Mehrheit zu ber&uuml;cksichtigen, werde mich
jedoch in jedem Fall bem&uuml;hen, in den Streitfragen einen Kompromi&szlig; zu
finden, damit sich die (teilweise gro&szlig;e) Minderheit nicht im Stich gelassen
f&uuml;hlt.<P>
Auf einige Dinge m&ouml;chte ich konkret eingehen:<P>
Eines der gr&ouml;&szlig;ten Probleme scheinen englischsprachige Texte zu sein. Ich
selbst sehe f&uuml;r mich keine M&ouml;glichkeit, auch noch &Uuml;bersetzungsarbeit zu
&uuml;bernehmen. Zwar hat sich freundlicherweise Heiko Kuschel bereiterkl&auml;rt,
dies bei Bedarf f&uuml;r mich zu erledigen, aber Texte ab einer gewissen L&auml;nge
m&ouml;chte ich weder ihm noch einem anderen Leser zumuten (es sei denn, es
erkl&auml;rt sich jemand ausdr&uuml;cklich damit einverstanden).
Leider gibt es Unternehmen im deutschsprachigen Raum, die nur englische
Presseerkl&auml;rungen, Produkinfos usw. ver&ouml;ffentlichen. Eine zus&auml;tzliche
Deutsch-Fassung d&uuml;rfte f&uuml;r diese jedoch im Regelfall kein Problem sein.
Ich werde mich aber auf jeden Fall weiterhin bem&uuml;hen, den
englischsprachigen Anteil von AMIGA aktuell so niedrig wie m&ouml;glich zu
halten, was jedoch manchmal auch aus Copyright-Gr&uuml;nden (siehe Produkttests
in dieser Ausgabe) nicht immer m&ouml;glich ist.<P>
Die Mehrheit der Leser hat sich f&uuml;r einen &Uuml;bergang von AMIGA aktuell zu
einem Vollmagazin ausgesprochen. Damit bin ich sehr einverstanden,
allerdings wird der Schwerpunkt auch in Zukunft eindeutig bei den News
liegen.<P>
Damit gleich zur Frage der Beteiligung: Wie die Umfrage ergab, ist die
Bereitschaft zur Mitarbeit relativ gro&szlig;. Jedoch wissen einige Leser nicht,
womit sie sich eigentlich beteiligen sollen.
Kurz gesagt: mit allem, was ein Magazin ausmacht. Ganz besonders
interessieren mich Produkttests (bzw. -vorstellungen). Ihr werdet doch ab
und zu neue Hard- und Software kaufen/benutzen (und sei es gute PD-
Software, die es immer noch reichlich gibt). Oder wie w&auml;re es mit
Messeberichten - die Computer '97 steht vor der T&uuml;r!
Auch m&ouml;chte ich eine mittlerweile fast vergessene Sparte wiederbeleben: Die
Rede ist von der Berichterstattung &uuml;ber den AMIGA in Nicht-AMIGA-
Publikationen. Wird der AMIGA noch ab und zu in anderen Zeitschriften, im
Radio und Fernsehen erw&auml;hnt? Wenn Ihr also etwas mitbekommt, dann teilt mir
bitte das "was", "wo" und "wann" mit!<P>
Und auch wenn Ihr meint, da&szlig; in AMIGA aktuell eine bestimmte Rubrik fehlt,
meldet Euch bei mir!<P>
<PRE>
Meine Adresse: Carsten Schr&ouml;der
               Helmoltstra&szlig;e 10
               37081 G&ouml;ttingen

       E-Mail: <A HREF="mailto:cschroe@stud.uni-goettingen.de">cschroe@stud.uni-goettingen.de</A>
</PRE>
<CENTER><BR><A HREF="0004.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0006.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 10/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int1.gif" ALT="[Intern]" BORDER=0></A><BR>
<A HREF="0006.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0011.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games0.gif" ALT="Spiele" BORDER=0></A><BR>
<A HREF="0021.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0033.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0038.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0043.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0047.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0055.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0056.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="0057.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

