<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 10/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
<!-- Net-Trak Plain HTML v2.0 START -->
<CENTER>
<a href="http://net-trak.stats.net/cgi-bin/stats/stats?account_id=1099& page_id=1097" target="_top">
<img ALT="Counter" src="http://net-trak.stats.net/cgi-bin/trakker?account_id=1099& page_id=1097&image=1" width=88 height=49 border=0></a><BR>
Besucher seit 01.10.1997</CENTER>
<!-- Net-Trak Plain HTML v2.0 END -->
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<CENTER><H1>Spiele-News aus aller Welt</H1>
<H2>Vulcan-News</H2></CENTER>
Desolate ist das neueste in der langen Liste von zuk&uuml;nftigen Vulcan-Relea-
ses. Es handelt sich um ein Jump N Run-Platform-Shoot Em Up und erinnert
auf den ersten Screenshots stark an den Klassiker Gods von den Bitmap
Brothers. Ein 68020-AMIGA, ein 4x-CD-ROM, 2MB CHIP  und 4MB FAST RAM und
Ihr seit dabei, wann steht allerdings noch nicht fest.<P>
Au&szlig;erdem wurden erste Hard Target-Screenshots ver&ouml;ffentlicht. Sie sehen
nicht schlecht aus. Hard Target wird ein Virtua-Cop-Clone. N&auml;here Infor-
mationen gibt es leider noch nicht, nur die Systemvoraussetzungen: AGA,
020, 2MB Chip RAM, 8MB Fast RAM und ein 4xCD-ROM.<P>
Hell Pigs wird ein Action-Adventure der Spitzenklasse. Es beinhaltet so-
wohl komplexe Puzzles als auch extreme Gewalt- und Kampfsequenzen mit
Aliens. Aus diesem Grund wird es auch nur an Erwachsene (&uuml;ber 18) ver-
kauft. Hell Pigs bietet au&szlig;erdem Sprachausgabe und Full Motion Video und
aufwendig gestaltete Charaktere und Hintergrundgrafiken. Mit ein bi&szlig;chen
Gl&uuml;ck soll Hell Pigs noch in diesem Jahr erscheinen.<P>
Ein weiterer Warcraft-Clone kommt von Vulcan. Er hei&szlig;t Scions of a Forgot-
ten World und wurde vor langer Zeit schon als Demo ver&ouml;ffentlicht.
Seit dieser Zeit hat sich allerdings viel getan. Das Spiel basiert auf
Levels, in dem der Spieler seinen Feind besiegen mu&szlig;, indem er Geb&auml;ude
baut, Waffen herstellt, Nahrung produziert und seine Armee verst&auml;rkt.
Dann wird der Feind angegriffen und hoffentlich besiegt. H&ouml;rt sich leicht
an ? Abwarten ! Systemvoraussetzungen sollen AGA oder Cyber-GFX-Rechner
mit mind. einer 020-CPU sein, die mit HD, 2 MB Chip RAM, 4 MB Fast RAM
und einem 4x CD-ROM ausgestattet sind. Au&szlig;erdem gibt es AHI-Sound-Support.<P>
Final Odyssey, urspr&uuml;nglich als letztes Spiel von Vulcan angek&uuml;ndigt, das
auf Diskette erscheinen soll, kommt jetzt auch nur auf CD-ROM heraus.
Das Action-Adventure, in dem man Gefangene befreien und b&ouml;se Monster
zerst&ouml;ren mu&szlig;, sowie Puzzles l&ouml;st, soll noch im September erscheinen.
Systemvoraussetzungen sind 2MB RAM, eine HD und ein CD-ROM-Laufwerk.<P>
<CENTER><IMG WIDTH=290 HEIGHT=244 SRC="Desolate.jpg" ALT="Desolate Screenshot"><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Foundation-Update</H2></CENTER>
Foundation, inzwischen zu 83 % fertig, wird wahrscheinlich im November
erscheinen. Als letztes wurden die Kampfsequenzen und der TCP-Support
programmiert. Ach ja, Foundation ist ein Echtzeit-Strategiespiel im Stile
von "Die Siedler". Vorbestellungen werden bei Sadeness Software schon
angenommen. Ein Demo soll laut Programmierer Paul Burkey im Oktober im
Aminet zum Download bereit sein.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Pinball Brain Damage</H2></CENTER>
Pinball Brain Damage, urspr&uuml;nglich bei Vulcan Software angek&uuml;ndigt, er-
scheint nun bei APC &amp; TCP. Das Spiel beinhaltet eine 640x256-Aufl&ouml;sung
mit 256 Farben und eine Super-Hi-Res-Aufl&ouml;sung (1280x512) f&uuml;r den Multi-
ball-Modus, der &uuml;brigens der beste bisher in einem AMIGA-Pinball-Spiel
sein soll. Systemvoraussetzungen: AGA, 2MB Chip, HD (f&uuml;r die Disk-Version)
oder CD-ROM (f&uuml;r die CD-Version). Au&szlig;erdem wird das Spiel &uuml;ber einen Edi-
tor verf&uuml;gen, mit dem man seine eigenen Tische produzieren kann. Diese
Option gibt es auch zum ersten Mal in einem AMIGA-Pinball-Spiel. Jetzt
bleibt blo&szlig; abzuwarten, ob das Spiel h&auml;lt, was die Ank&uuml;ndigung verspricht.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Maim &amp; Mangle bester Command &amp; Conquer-Clone?</H2></CENTER>
Maim &amp; Mangle von Deimos Designs verspricht der beste der vielen geplanten
Command &amp; Conquer-Clones (Forgotten Forever von Charm Developments;
Diversia von Vulcan Software; Hard Corps von Geosync; ...) zu werden. Be-
sonders die Licht- und Schatteneffekte der Grafik sollen das Spiel zu
einem Hit machen. Die Landschaften werden 3-dimensional sein, das hei&szlig;t
Truppen k&ouml;nnen sich in Bergen oder W&auml;ldern verstecken usw. Auch Wetter-
effekte sind eingeplant. TCP-Support, Level Editor und vieles mehr macht
Lust auf dieses Spiel, das auf CD-ROM im n&auml;chsten Jahr erscheinen soll.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Trauma Zero</H2></CENTER>
Vor ein paar Wochen landete ein selbstablaufendes Demo des R-Type-Clones
Trauma Zero im Aminet. Und was soll ich sagen: Brilliant... PAL Overscan-
Grafik mit 256 Farben, superweiches Scrolling, fantastische Zwischen-
sequenzen, gute Musik,... eine Firma zu finden, die dieses Spiel ver-
&ouml;ffentlicht d&uuml;rfte nicht schwer fallen, hoffentlich dauert es nicht mehr
so lang. Solche Spiele braucht die AMIGA-Welt.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Guildhall Leisure bringt Klassiker in gro&szlig;e britische L&auml;den</H2></CENTER>
Guildhall Leisure hat in Kooperation mit Epic Marketing eine Reihe von
Klassikern auf CD gepresst, die nun in L&auml;den der gro&szlig;en britischen
Ketten Game, HMV und Electronics Boutique erscheinen. Zu den Titeln
geh&ouml;ren Formula One Grand Prix, Theme Park, Dune 2, Super Skidmarks
und Civilization.<P>
Au&szlig;erdem erscheint bei Guildhall Gloom 3. Der Nachfolger der Titel Gloom
und Gloom Deluxe ist nicht wirklich ein neues Spiel. Vielmehr verf&uuml;gt es
&uuml;ber die Engine von Gloom Deluxe. 50 neue Levels, 10 neue Feinde neue
Grafiken und Sound sollten dar&uuml;ber jedoch hinwegtr&ouml;sten. Der Multiplayer-
Modus soll ebenfalls verbessert werden. 30 neue 2Player-Levels und besser-
er Modem-Support geh&ouml;ren dazu. Man braucht zwar theoretisch nur einen
A1200 um Gloom 3 zu spielen. Empfohlen werden aber ein 030-Prozessor, 4MB
FAST RAM oder besser noch ein 040 oder 060-Prozessor. Das Spiel wird auch
CyberGFX unterst&uuml;tzen. Erscheinungsdatum ? Weihnachten!<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Explorer 2260</H2></CENTER>
Explorer 2260 wird ein Spiel mit einem Umfang, wie es ihn bisher selten
gab. Es handelt sich dabei um ein Spiel im Stile von Elite 2. Man handelt,
entdeckt neue, riesige Welten, f&uuml;hrt Kriege. Mit &uuml;ber 20 au&szlig;eridischen
Rassen gibt es immer etwas zu tun. Die Grafik in Explorer 2260 basiert auf
einer Texture-Engine mit Licht- und Schatten-Effekten. Geplant sind eine
AGA- und eine CyberGFX-Version. Das Spiel soll Mitte 1998 (nat&uuml;rlich nur)
auf CD-ROM erscheinen.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Alive Mediasoft-News</H2></CENTER>
Alive Mediasoft haben bekanntgegeben, da&szlig; Haunted an Halloween erscheinen
soll. Das Spiel soll ein interaktiver Film im Stile eines Mystery-Krimis
werden. Gerenderte Grafiken, Animationen und Full Motion Videos sorgen f&uuml;r
den Umfang des Spiels, der 5 CD-ROMs !!! betr&auml;gt.<P>
Ein neuer Titel, der bei Alive Mediasoft erscheint ist Blade. Es handelt
sich dabei um ein Rollenspiel, in dem der Spieler Dungeons entdeckt, Gold
und Sch&auml;tze findet, Monster t&ouml;tet und Erfahrungspunkte sammelt. Man hat
dabei eine Gruppe von vier Charakteren, die &uuml;ber eine Anzahl von Bewe-
gungspunkten verf&uuml;gt. Sind diese verbraucht, ist der Zug beendet, und der
Computer ist an der Reihe. Da die Level in Blade per Zufallsgenerator er-
mittelt werden, spielt man niemals dasselbe Level zweimal, eine Langzeit-
motivation sollte somit garantiert sein. Die Grafiken sind zwar ziemlich
klein, aber auf einem AGA-Rechner immerhin mit 256 Farben. Das Spiel wird
in zwei Versionen erscheinen, die ECS-Version ben&ouml;tigt 1 MB RAM, die AGA-
Version ben&ouml;tigt einen 030-Prozessor und 4 MB Fast RAM, beide Versionen
sind (nat&uuml;rlich) HD-installierbar. Das Spiel erscheint &uuml;brigens auf
Disketten und nicht auf CD-ROM.<P>
Alive MediaSoft haben au&szlig;erdem einen Weg entwickelt, nahezu jedes Mac-
Spiel auf den AMIGA umzusetzen. Die ersten Titel sollen Doom 2 und Phan-
tasmagoria werden.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Total Destruction 3D</H2></CENTER>
Total Destruction 3D wird ein Beat Em Up von Deepcore Entertainment Soft-
ware. Es wird &auml;hnlich wie Virtual Fighter und Tekken auf den Konsolen eine
auf 3D-Polygonen und Texturen basierende Grafik haben, was etwas total
Neues auf dem AMIGA ist. Die Systemvoraussetzungen sind dementsprechend
hoch: AGA oder CyberGFX mit 030, f&uuml;r eine h&ouml;here Aufl&ouml;sung sogar 040 plus
2 MB Chip RAM und 8 MB Fast RAM. Erscheinungstermin ist der Sommer 1998.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Olofight</H2></CENTER>
Auch Olofight wird ein neues Beat Em Up. Eine Demo-Version soll im Oktober
erh&auml;ltlich sein. Das Spiel wird ein AGA-only-Spiel und wird mit 25 Frames
pro Sekunde laufen. Laut Programmierern l&auml;uft das Spiel mit ca. 5000 Far-
ben auf einem Screen. Alle Fighter sind 100 % gerendert, animierte Hinter-
gr&uuml;nde, Schatteneffekte und andere Grafikspezialit&auml;ten sollen Olofight
zu einem guten Spiel machen. Das komplette Spiel soll in der Weihnachts-
zeit nur als Disketten-Version (ca. 8 St&uuml;ck) erscheinen. Diese wird
nat&uuml;rlich HD-installierbar sein, eine CD-Version soll vielleicht nach-
tr&auml;glich erscheinen.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>neue Pulsator-Screenshots</H2></CENTER>
Es gibt neue Screenshots von Pulsator, dem Shoot Em Up im Stile von
R-Type, &uuml;ber das AMIGA AGPJ schon im letzten Monat berichtete. Das
Spiel wird z.B. 512 Farben auf einem Screen haben und in 50 Frames pro
Sekunde ablaufen. Das Waffensystem des Spiels soll alle anderen von vo-
rigen Spielen in den Schatten stellen. Regen-, Schatten- und Lichteffekte
runden den hervorragenden optischen Eindruck ab. Es wird zwei Versionen
geben, eine Disketten-Version, die eine HD voraussetzt und eine CD-ROM-
Version, die zus&auml;tzliche Film-Sequenzen und direkt von CD abgespielte Mu-
sik enthalten wird. Beide Versionen sollen im Januar erscheinen, eine
Demoversion soll jedoch schon vorher erh&auml;ltlich sein. Das Spiel erscheint
&uuml;brigens bei APC &amp; TCP.<P>
<CENTER><IMG WIDTH=320 HEIGHT=256 SRC="Pulsator.jpg" ALT="Pulsator Screenshot"><BR><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>TFX released</H2></CENTER>
TFX ist nach jahrelanger Wartezeit endlich erschienen. Es ist auf der
Cover-CD der englischen Zeitschrift CU AMIGA enthalten, die auch in wei-
ten Teilen Deutschlands am Anfang des Monats Oktober zum Preis von 28 DM
erh&auml;ltlich ist. F&uuml;r Freunde von Flugsimulationen sicherlich eine Ausgabe,
die sich lohnt. Was das Spiel taugt, erfahren Leser von AMIGA AGPJ im
n&auml;chsten Monat, dann gibt es einen umfassenden Testbericht. Nach ersten
Berichten aus England soll die Grafik die beste sein, die je in einer
Flugsimulation gesehen wurden.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>The World Foundry gegr&uuml;ndet</H2></CENTER>
Die Entwickler der Spiele Explorer 2260 und Maim &amp; Mangle (beide oben
n&auml;her beschrieben). Das neue Softwarehaus hei&szlig;t The World Foundry, und
setzt sich aus den Entwicklerteams Digital Anarchy Software, Deimos Design
und Intuition Software zusammen. Hiermit sollen Erfahrungen und Ressourcen
geb&uuml;ndelt werden, um neben den oben erw&auml;hnten Titeln auch weitere
zuk&uuml;nftige Titel erfolgreich zu produzieren. Auch Power PC-Rechner sollen
unterst&uuml;tzt werden. Auch Maim &amp; Mangle und Explorer 2260 sollen schon f&uuml;r
PPC-AMIGAs herauskommen.<P>
<CENTER><A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<H2>Lebenszeichen von Myst</H2></CENTER>
Nachdem es lange ruhig geblieben ist um Myst, sind jetzt neue Screenshots
im Aminet erschienen. Und wie sehen sie aus? Halt so wie Myst aussieht.
<CENTER><BR><A HREF="0012.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0014.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 10/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0006.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0011.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0021.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0033.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0038.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0043.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0047.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0055.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0056.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="0057.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

