<HTML>
<HEAD>
<TITLE>Amiga-Aktuell 10/97 - Spiele</TITLE>
</HEAD>

<BODY BACKGROUND="../gfx/newbg.gif" BGCOLOR="#75BAFF" TEXT="#000000" LINK="#0000FF" VLINK="#000088">


<TABLE>
<TR>
<TD VALIGN=TOP COLSPAN=2 WIDTH=100><IMG WIDTH=491 HEIGHT=86 SRC="../gfx/amisp.gif" ALT="Amiga-Aktuell 1ß/97 - Spiele" BORDER=0></TD>
<TD WIDTH=100 VALIGN=TOP>
<!-- Net-Trak Plain HTML v2.0 START -->
<CENTER>
<a href="http://net-trak.stats.net/cgi-bin/stats/stats?account_id=1099& page_id=1097" target="_top">
<img ALT="Counter" src="http://net-trak.stats.net/cgi-bin/trakker?account_id=1099& page_id=1097&image=1" width=88 height=49 border=0></a><BR>
Besucher seit 01.10.1997</CENTER>
<!-- Net-Trak Plain HTML v2.0 END -->
</TD>
</TR>
<TR>
<TD VALIGN=TOP><IMG WIDTH=51 HEIGHT=351 SRC="../gfx/akt.gif" ALT="Logo">
<CENTER><BR><BR>
<IMG WIDTH=100 HEIGHT=1 SRC="../gfx/spc.gif" BORDER=0 ALT="">
<BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</CENTER>
</TD>
<TD WIDTH=391 VALIGN=TOP>
 <A NAME="Top"></A>
<BR>
<CENTER><H1>Review: Flyin' High</H1></CENTER>
Tja, da liegt es nun vor mir: das umstrittene Spiel Flyin' High. W&auml;hrend
die Presse in Deutschland sich einig ist: AMIGA Magazin: 90 %, AMIGA
Special: Sehr Gut (Spielspa&szlig; 100%), sieht man es im Ausland etwas anders:
CU AMIGA, weltweit bekanntes AMIGA Magazin schreibt: "Great looking game,
but unfortunately no gameplay" und bewertet das Spiel mit 68 %.
Nun ja, fragend wer nun Recht hat, mach ich mich daran, es herauszufinden.<P>
Die Verpackung ist etwas schlicht, vorbei sind die Zeiten, in denen auch
AMIGA-Spiele mit &uuml;ppigen Kartons in L&auml;den aus der Masse hervorstechen
mussten, um gekauft zu werden, heute da der AMIGA-Spiele-Markt fast nur
noch &uuml;ber Versand abl&auml;uft, ist die Verpackung nur Nebensache, aber das ist
sie ja eigentlich sowieso. Die Anleitung ist kurz undd knapp, aber leicht
verst&auml;ndlich, halt so, wie eine gute Anleitung sein mu&szlig;.<P>
CD in den Schacht und los geht's, ganz nett ist, da&szlig; das Spiel nicht nur
einmal auf der CD ist, sondern zus&auml;tzlich in mehreren Backups. Angeblich
geschah dies, um einen eventuellen Kratzer auf der CD nicht zum Tod der
CD zu machen, vielleicht l&auml;uft ja noch ein Backup.<P>
Startet man das Spiel, wird man von einem hervorragend gemachten Intro
empfangen: sehr gelungene Animationen, eine nette und passende Musik, die
Lust auf das Spiel w&auml;chst und w&auml;chst. Mit einem Mausclick gelangt man nun
in die Werkstatt, das Hauptmen&uuml; von Flyin' High. Hier kann man Grafikein-
stellungen vornehmen, die Steuerungssensitivit&auml;t und die Sichtweite einstellen,
Spiele laden und speichern, den Spielmodus w&auml;hlen (es gibt drei:
Flyin' High Cup, bei dem es Punkte f&uuml;r erreichte Pl&auml;tze gibt, den SpeedCup,
bei dem die jeweilige beste Rundenzeit entscheidend ist, egal wievielter man
wird und einen Testmodus, mit dem man die verschiedenen Rennstrecken testen kann).<P>
Au&szlig;erdem l&auml;&szlig;t sich in der Werkstatt der aktuelle
Punktestand und die Highscoreliste ansehen. Wir wollen aber jetzt endlich
losfahren, also schnell die Grafik auf h&ouml;chste Detailstufe gestellt und
los geht's... eine weitere wundersch&ouml;ne Zwischenanimation und das Rennen
beginnt. Die Sprachausgabe 3.2.1.Go ist zwar nicht synchron mit der Ampel,
aber das ist zu verschmerzen. Aber was m&uuml;ssen meine Augen da sehen, ein
leichtes Ruckeln, selbst auf meinem 68030-50Mhz-Rechner, auf einem normalen
AMIGA 1200 m&ouml;chte ich das lieber nicht sehen. Will man ein ruckelfreies
Spiel, bleiben nur die beiden anderen Grafikeinstellungen, entweder
ein sehr grobpixeliger Screen, auf dem das Rennen keinen gro&szlig;en Spa&szlig; macht
oder das Fahren in einem kleinen Fenster in der Mitte des Bildschirmes,
dann schon lieber die h&ouml;chste Aufl&ouml;sung, denn das Ruckeln ist ja auch
nicht so schlimm.<P>
Aber die Steuerung, das gibt's doch nicht, ein kleines Lenken nach rechts
und schon kleb ich an der Mauer, na ja wird nur an der Einstellung der
Steuerungssensitivit&auml;t liegen, also per Escape-Taste zur&uuml;ck ins Hauptmen&uuml;
und von niedrig auf sehr niedrig gestellt. Zur&uuml;ck zum Rennen, doch leider
ist das Spiel unter dieser Einstellung komplett unspielbar, die Steuerung
reagiert so langsam, da&szlig; man nicht durch schnelle und scharfe Kurven kommt
ohne die ganze Zeit an der Mauer zu kratzen. Zur&uuml;ck in die Werkstatt und
auf mittel gestellt. Wieder im Spiel, die Musik w&auml;hrend des Spiels ist
&uuml;brigens recht gut, mu&szlig; ich feststellen, da&szlig; diese Einstellung das Spiel
auch nicht besser steuerbar macht, ein kurzes Lenken in eine der beiden
Richtungen, schon stellt sich der Buggy quer, oder dreht sich bis zum
Stillstand. Ein weiteres Mal ins Hauptmen&uuml; und auf hoch gestellt. Achtung:
beim n&auml;chsten Lenken h&auml;ngen Sie an der Mauer, eine solche Warnung w&auml;re
angebracht, da dieser Zustand beim geringsten Lenken eintritt, die
Steuerungseinstellung "sehr hoch" treibt es dann auf die Spitze und macht
das Spiel komplett unspielbar, also zur&uuml;ck zur Einstellung niedrig, und
versuchen, sich an die Steuerung zu gew&ouml;hnen, aber das kann ja eigentlich
nicht Sinn der Sache sein, und die Wochen oder Monate, die daf&uuml;r draufgehen
sollte man lieber damit verbringen mal wieder eine Runde Lotus Turbo Challenge
oder &auml;hnliche Spiele zu spielen, die zwar keine texturierte Grafik haben, aber daf&uuml;r spielbar sind.<P>
Zwischen den Rennen kann man &uuml;brigens die unterwegs eingesammelten M&uuml;nzen
zu Extras, wie verbesserte Reifen, Motoren oder netten kleinen Dingen,<P>
wie Raketen, machen. Auch die anderen Strecken Jungle, Snow, usw. sehen gut
aus, wenn der normale Spieler sie auch h&ouml;chstens im Testmodus sehen wird,
da er die Geduld, dieses Spiel so lang zu spielen, bis man bei den anderen
Strecken angekommen ist, nicht haben wird.<P>
Ach ja, nicht zu vergessen ist das schlechte Design der Rennstrecken,
extrem scharfe Kurven, Berg- und Talfahrten ohne Ende, das sieht zwar gut
aus, wenn sich alles bewegt, aber das Spiel macht es nicht besser, im Gegenteil,
aber auch dies w&auml;re zu verschmerzen, wenn blo&szlig; die Steuerung
besser w&auml;re. Das ist sie aber nicht und deswegen bleibt unter dem Strich
ein Spiel, das wahrscheinlich nicht einmal zu den besten zwanzig Rennspielen auf
dem AMIGA geh&ouml;rt, auch wenn es eine Grafik bietet, &uuml;ber die
man nicht meckern kann, aber was n&uuml;tzt die, wenn der Spielspa&szlig; vergessen
wurde. Wenn dann die AMIGA Special von "Konsolen-Feeling" schreibt und behauptet:
"Noch vor ein paar Jahren w&auml;re dieses Spiel der Hit in der &ouml;rt-
lichen Spielhalle gewesen.", kann man eigentlich nur noch lachen oder
besser noch: weinen. Tja, hier also die Wertung:<P>
<TABLE>
<TR><TD WIDTH="30%">Grafik:</TD><TD WIDTH="30%">9/10</TD></TR>
<TR><TD>Sound:</TD><TD>8/10</TD></TR>
<TR><TD>Handhabung:</TD><TD>3/10</TD></TR>
<TR><TD>Spielspa&szlig;:</TD><TD>4/10</TD></TR>
<TR><TD>&nbsp;</TD><TD></TD></TR>
<TR><TD>GESAMT:</TD><TD>51 %</TD></TR>
</TABLE><P><BR>
<B>Fazit:</B><P>
Eindrucksvolles Grafikdemo, das so gern ein Spiel sein wollte, es
aber nicht geschafft hat, eins zu werden.<P>
P.S.: Es ist ein Patch geplant, der laut Andreas Magerl die Steuerung und
den Schwierigkeitsgrad verbessern soll. Wenn dieser Patch erh&auml;ltlich ist
und die Probleme des Spiels tats&auml;chlich verbessert werden, erfolgt
selbstverst&auml;ndlich ein Nachtest mit einer neuen Bewertung des Produkts.
<CENTER><BR><A HREF="0014.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="0016.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
</TD>
<TD VALIGN=TOP>
<A HREF="../index.htm"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/home0.gif" ALT="Homepage" BORDER=0></A><BR>
<A HREF="../hot.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/letzm0.gif" ALT="letzte Meldung" BORDER=0></A><BR>
<H3><B>Ausgabe 10/97</B></H3>
<A HREF="0000.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/int0.gif" ALT="Intern" BORDER=0></A><BR>
<A HREF="0006.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/test0.gif" ALT="Test" BORDER=0></A><BR>
<A HREF="0011.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/games1.gif" ALT="[Spiele]" BORDER=0></A><BR>
<A HREF="0021.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/anews0.gif" ALT="Amiga News" BORDER=0></A><BR>
<A HREF="0033.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/powup0.gif" ALT="PowerUp-to-date" BORDER=0></A><BR>
<A HREF="0038.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/messe0.gif" ALT="Messe News" BORDER=0></A><BR>
<A HREF="0043.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/prod0.gif" ALT="Produktvorstellungen" BORDER=0></A><BR>
<A HREF="0047.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/div0.gif" ALT="diverse News" BORDER=0></A><BR>
<A HREF="0055.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/nflash0.gif" ALT="Newsflash" BORDER=0></A><BR>
<A HREF="0056.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/gerk0.gif" ALT="Ger&uuml;chtek&uuml;che" BORDER=0></A><BR>
<A HREF="0057.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abschl0.gif" ALT="Absclie&szlig;end" BORDER=0></A><BR>
<BR><BR>
<A HREF="../archiv.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/archiv0.gif" ALT="Archiv" BORDER=0></A><BR>
<A HREF="../abo.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/abo0.gif" ALT="Abo" BORDER=0></A><BR>
<A HREF="../kontakt.html"><IMG WIDTH=98 HEIGHT=23 SRC="../gfx/kont0.gif" ALT="Kontakt" BORDER=0></A><BR>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>

