<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - WBTuning-Kurs 5</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>WBTuning-Kurs /5</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench,
der Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich
gibt es unz&auml;hlige Programme, Patches usw. die dazu beitragen (wollen).
Ich werde nicht auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar
Anregungen und Tips bei sein werden, die noch nicht allen bekannt sind.
</P><P>
Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es
kann sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht
in jedem Fall explizit ein. Eine Demoversion ist so gut wie immer frei
erh&auml;ltlich. Als Quelle fungiert das <A HREF="http://ftp.uni-paderborn.de/aminet/">AMINET</A>.
</P><P>
Verschiedene Funktionen sind auch in Multifunktions-Commodities
integriert, im Teil 6 werde ich auf ein Beispiel hierf&uuml;r eingehen.
</P>
<P><TABLE BORDER=0 ALIGN=CENTER>
<TR><TD COLSPAN=2>Der Kurs setzt sich aus folgenden Artikeln zusammen:</TD></TR>
<TR><TD><OL>
<LI> Optische WB-Verbesserung</LI>
<LI> Smarte ZusatzFX</LI>
<LI> Disk-Tuning</LI>
<LI> Hilfreiche C-Vitamine</LI>
<LI> Sonstige Helferlein</LI>
<LI> Beispiel f&uuml;r Multicommodities: MultiCX</LI>
</OL>
</TD><TD>#1<BR>#2<BR>#3<BR>#4<BR>#5<BR>#6</TD></TR></TABLE></P>
<BR>
<H3 ALIGN="CENTER">5. Sonstige Helferlein</H3>
<P>Diesmal sind wir bereits im vorletzten Kursteil angelangt. Sonstige
Helferlein: das ist ein Sammelsurium an kleinen netten, manchmal
entbehrlichen, aber manchmal auch sehr hilfreichen Tools, die nicht
so recht in die anderen Rubriken gepa&szlig;t haben.</P><P>
<B>HDEnv</B> ist eines der Programme, die durch einen speziellen Trick daf&uuml;r
sorgen, da&szlig; man etwas RAM sparen kann. Die Kopien ben&ouml;tigter Einstellungen,
die sonst in den Arbeitsspeicher geladen werden (ENV), werden auf die
Festplatte verlagert. N&uuml;tzlich und absolut systemkonform.
</P><P><B>AAVD</B> ist interessant f&uuml;r Leute, die entweder auf ihrem riesigen Monitor
schnell den &Uuml;berblick verlieren oder insbesondere f&uuml;r diejenigen, die die
Bildschirmgr&ouml;&szlig;e wesentlich gr&ouml;&szlig;er eingestellt haben, als real m&ouml;glich ist.
</P><P>Es &ouml;ffnet sich ein Fensterchen, dessen Gr&ouml;&szlig;e frei einstellbar ist und in
dem klein die Umrisse der auf dem Screen ge&ouml;ffneten Windows dargestellt
werden (also auch der evtl. gerade nicht sichtbare Bereich des Schirms).
Wenn man in eines hineinklickt, so wird dieses Fenster aktiv. Beim Wechsel
auf einen anderen Screen folgt einem das AAVD-Fenster, so da&szlig; man es immer
im Blick hat.
</P><P>In diese Richtung geht auch <B>SIW</B> (ScreenInWindow). Das ist ein sehr
originelles Tool, denn hiermit ist es m&ouml;glich, in einem Fenster einen
bestimmten Bereich eines anderen Public-Screens zu beobachten. Diesen
Sichtbereich kann man verschieben, wenn man mit der linken Maustaste in
das SIW-Fenster hineinklickt und sie bei der Bewegung gedr&uuml;ckt h&auml;lt.
</P><P>Es ist sogar m&ouml;glich, in dem Fenster Aktionen per Maus durchzuf&uuml;hren oder
mittels Tastatur etwas einzugeben, also den anderen Screen `fernzubedienen`.
Der Anwendung sind kaum Grenzen gesetzt, so wird es auch m&ouml;glich Programme
auf anderen Bildschirmen zu bedienen, denen es von Hause aus eigentlich
nicht m&ouml;glich ist, zu `springen`. In neueren Versionen ist SIW komfortabel
per Men&uuml;s bedienbar.
</P><P>Wem die Tastatur zu leise ist, der kann mit <B>KeyClicker</B> nachhelfen. Bei
jeder Tastenbet&auml;tigung ert&ouml;nen jetzt leise Klackerger&auml;usche (nat&uuml;rlich
aus den Lautsprechern, wenn welche angeschlossen sind ;).
</P><P>Mit <B>ResetHandler</B> ist es m&ouml;glich bei dem sogenannten `Affengriff` den
Reset zu verz&ouml;gern und zus&auml;tzlich ein DOS-Kommando aufrufen. So kann man
z.B. ein Abschlu&szlig;bild anzeigen lassen oder auch etwas sinnvollere Sachen
machen, wie z.B. Programme beenden oder &auml;hnliches.
</P><P>Nicht nur zur Versch&ouml;nerung des Boot-Prozesses dient <B>WBStartupPlus</B>. Beim
Hochfahren wird in einem Fenster, w&auml;hrend des Ladens der Programme aus
dem Startup-Verzeichnis, das dazugeh&ouml;rige Icon angezeigt. Au&szlig;erdem werden
in dem eigentlichen WBStartup-Directory zwei Unterverzeichnisse mit dem
Zusatz &quot;(Disabled)&quot; und &quot;Enabled&quot;  angelegt. Verwaltet werden sie mit einem
Extra-Prefsprogramm, in dem man die einzelnen Boot-Kandidaten an- und
ausschalten, sowie ihre Priorit&auml;t &auml;ndern kann.
</P><P>Eine gute M&ouml;glichkeit h&auml;ufige Vorg&auml;nge zu automatisieren, stellt <B>Record</B>
dar. Dieses kleine Programm zeichnet nach dem Start alle User-Aktionen,
wie Mausbewegungen oder Tastatureingaben auf. So kann man seine WB wie
von Zauberhand bedienen lassen, was sich auch f&uuml;r Pr&auml;sentationen sehr
gut macht oder einzelne Aktionen als Skripte abspeichern und ausf&uuml;hren
lassen, wenn die einzelnen Anwenderprogramme so etwas nicht anbieten.
</P><P>Es gibt auch zahlreiche kleine Utilities, die dem Abfangen sogenannter
`Gurus` dienen, die sich in den neueren OS-Versionen selbst nur noch als
`Software Failures` und `Alerts` bezeichnen.
</P><P><B>AlertPatch</B> ist eines davon. Auch dieser Patch kann nicht jeden Absturz
verhindern, bzw. auf seine erweiterten Requester umleiten. Trotzdem werden
einem so etwas genauere Daten &uuml;ber den soeben aufgetretenen Crash geliefert
und wenn gew&uuml;nscht in einem Logfile abgespeichert.
</P><P><B>LastAlert</B> gibt nach einem auf einen Absturz folgenden Bootvorgang ein
paar Informationen zu dem letzten Crash aus. Eventuell f&uuml;r Programmierer
interessant, da es sich bei mir als zu undetailliert erwies.
</P><P>Eine wichtige M&ouml;glichkeit sich sein Leben auf der Workbench zu erleichtern,
k&ouml;nnen Screenmode-Umleiter darstellen. Wer mit Grafikkarten arbeitet, wird
beinahe mit Sicherheit davon geh&ouml;rt haben, aber auch unter AGA sind sie
oft n&uuml;tzlich, gerade wenn man mit &auml;lterer Software zu tun hat, die man
nicht intern auf eine moderne Aufl&ouml;sung umstellen kann. Wenn es sich um
systemkonforme Programme handelt, kann z.B. ForceMonitor helfen.
</P><P><B>ForceMonitor</B> leitet einfach global einen oder mehrere Modi auf andere
Bildschirmaufl&ouml;sungen um. Das eignet sich gut daf&uuml;r z.B. generell das
Aufrufen von LowRes auf der WB zu verhindern. Einzelne Programme kann
man davon auch ausnehmen.
</P><P>Ein weiterer Vertreter mit anderen Merkmalen ist <B>NewMode</B>. Dieses ist
ebenso ein Commodity und &uuml;berwacht auch alle Programmaufrufe. Der
L&ouml;sungsansatz ist hier aber ein anderer, denn NewMode registriert alle
Programme und fragt, wenn es die aufgerufene Software noch nicht kennt
(und es so eingestellt ist), in welchem Screenmode dieses ge&ouml;ffnet werden
soll und dann wird es auch in Zukunft so aufgerufen. Wenn man m&ouml;chte,
nimmt NewMode auch neue Programme ohne nachzufragen in die Liste auf
und man kann deren Konfig sp&auml;ter editieren.
</P><P>Zu guter Letzt sei noch <B>Argue</B> erw&auml;hnt, mit dem es m&ouml;glich ist, kleine
DOS-Skripte bzw. Programm-Argumente in gutaussehende und komfortable
MUI-Requester zu verwandeln. Auch komplexe Benutzeroberfl&auml;chen werden
so m&ouml;glich. Zahlreiche Beispiele auch f&uuml;r bekannte Programme sind dabei.
</P><P>Damit schlie&szlig;e ich erst einmal. Wir sehen uns im n&auml;chsten und letzten
Teil des WB-Tuning-Kurses!
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../cc/9806bb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806inst.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
