<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Aminet Set 9 - Quite Simply The Best CD Compilation Around?!</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><center><font color="Green">Aminet Set 9</font></center></h1></P>

Das Aminet d&#252;rfte jedem Amiga User wohl ein Begriff sein, genauso wie die
alle zwei Monate erscheinenden Aminet CD`s, die s&#228;mtliche Daten der letzten
zwei Monate, fein s&#228;uberlich in Archive gepackt, auf einer CD enthalten. Und
ohne zu &#252;bertreiben kann man wohl sagen, da&#223; sich die Aminet CD Reihe zu
der wichtigsten auf dem Amiga entwickelt hat. Alle 8 Monate (respektive 4
regul&#228;re Aminet CD`s) erscheint auch ein Aminet Set (4 CD`s), welches vom Inhalt her
nahezu identisch mit den letzten 4 Einzel CD`s ist, daf&#252;r aber
preisg&#252;nstiger, wenn auch weniger aktuell ist. Mit dem Aminet Set 9 ist nun
wieder ein weiteres Set erschienen, welches ich hier vorstellen m&#246;chte.</p>

<h2><center><font color="yellow">Die Vollversionen</Font></center></h2></P>
Mit <b>GoldED 4.8, Marblelous 2, AmiAtlas 4</B> und <B>Digital Almanac II SE</B> befinden
sich insgesamt vier Vollversionen als Bonus auf den 4 CD`s, die das ganze
Set nat&#252;rlich stark aufwerten.</P>

<u>GoldED 4.8:</U><br>
Wer regelm&#228;&#223;ig Texte f&#252;r die NoCover schreibt oder programmiert ist auf
einen leistungsf&#228;higen und flexibelen Texteditor angewiesen. Mit &quot;ED&quot; und
&quot;EditPad&quot; liegen dem OS 3.5 zwar zwei Editoren bei, aber beide sind in ihrer
Leistung sehr eingeschr&#228;nkt und eignen sich bestenfalls f&#252;r kleinere Scripte
oder die eine oder andere Notiz. Wie man nun unschwer erahnen kann, ist
GoldED auch ein Texteditor - wenn auch ein ziemlich leistungsstarker. Auch
wenn GoldEd in erster Linie f&#252;r Programmierer entworfen wurde, so eignet
es sich auch ganz hervorragend f&#252;r das Schreiben jeglicher Artikel, weil es
damit einfach wesentlich komfortabeler als mit dem angestaubten &quot;ED&quot; der WB
geht. Hier nur einige Features von GoldED:</P><ul>

<li> ARexx Port<BR>
<li> Drag &amp; Drop<BR>
<li> HotKey &amp; Commodity Unterst&#252;tzung<BR>
<li> Auto Backup (sehr n&#252;tzlich!)<BR>
<li> frei konfigurierbare GUI<BR>
<li> Clipboard Unterst&#252;tzung<BR>
<li> Formatierrungsfunktionen inklusive Blocksatz &amp; WordWrap<BR>
<li> flexibele Suchfunktionen<BR>
<li> automatische Wortvervollst&#228;ndigung<BR>
<li> komplett lokalisiert<BR>
<li> u.v.m.</P></UL>

Das waren zwar zugegebenerma&#223;en nur einige Features von GoldED, aber da dies
hier nur eine Kurzvorstellung der Vollversionen werden soll, reicht das wohl
aus. Mit GoldED 4.8 hat man schonmal einen leistungsf&#228;higen Texteditor
zusammen mit dem Aminet Set 9 erworben, den man, wenn man ihn erstmal
installiert hat, nicht mehr hergeben m&#246;chte.</P><center><img src="asv1.jpg"></center></P><br>

<u>Marblelous 2:</U><BR>
Nat&#252;rlich darf auch die &quot;Zocker Fraktion&quot; nicht zu kurz kommen und so hat es
mit Marbelous 2 auch eine Spiele Vollversion, &#252;brigens von unserem Club, auf
das neue Aminet Set geschafft. Bei Marbelous 2 handelt es sich um ein
Denkspiel, in dem man eine bis drei Kugeln steuern muss, die die Aufgabe
haben, eine bestimmte Anzahl an sog. &quot;Poweritems&quot; aufzusammeln und dann noch zum
Ausgang gef&#252;hrt werden wollen. Das h&#246;rt sich zwar recht einfach an, wird in
der Praxis aber dadurch erschwert, da&#223; man die Kugeln nicht direkt, sondern
nur durch das platzieren von Richtungspfeilen steuern kann. Ein
zugegebenerma&#223;en simples Spielprinzip, das aber &#252;ber einen gnadenlos hohen
Suchtfaktor verf&#252;gt. Dem Spiel liegt als Bonus noch ein Editor bei, mit dem
man selbst neue Levels erschaffen kann, was f&#252;r die Dauermotivation
sicherlich sehr f&#246;rdernd ist. Zu guter letzt sei noch erw&#228;hnt, da&#223; das Spiel
l&#246;blicherweise auch Grafikkarten unterst&#252;tzt und zudem in 256 Farben
vorliegt. Wer gute Denkspiele zu sch&#228;tzen wei&#223;, der wird mit Marblelous 2
sicherlich einige sehr unterhaltsame Stunden vor dem Monitor verbringen
k&#246;nnen!</P><center>
<img src="asv3.jpg"></Center></P><br>
<U>AmiAtlas 4:</U><BR>
Im professionellen Anwendugssektor ist der Amiga momentan ja nicht gut
bedient und so muss man sich schon freuen, da&#223; es mit AmiAtlas, hinter dem
Jahre von Entwicklung stecken, ein professionellen Routenplaner gibt, der
st&#228;ndig weiterentwickelt und aktualisiert wird. Die hier vorhandene Version
4.0 ist zwar etwas angestaubt (Stand: Ende `97; aktuell ist &#252;brigens Version 5.0), reicht aber v&#246;llig aus, um
die eine oder andere Route innerhalb von Deutschland zu berechnen oder sich
einen Eindruck &#252;ber die Leistungsf&#228;higkeit des Programms zu machen. Es wird
zwar nur eine Deutschlandkarte mitgeliefert (wer also Touren in die Schweiz
oder nach &#214;sterreich plant, muss wohl oder &#252;bel auf die aktuelle Version
zur&#252;ckgreifen) und diese scheint obendrein auch nicht identisch mit der der
eigentlichen Vollversion zu sein, reicht aber wie gesagt f&#252;r gelegentliche
Planungen aus. Positiv erw&#228;hnt werden sollte noch die Tatsache, da&#223;
dem Tool noch eine AmigaGuide Datei, die auch aus dem Programm heraus
aufgerufen werden kann, beiliegt, in der s&#228;mtliche (?) Hotels aus
Deutschland, sortiert nach St&#228;dten, aufgef&#252;hrt sind - inkl. Preise und
Leistungen! Alles in allem ist AmiAtlas auch ein gutes Programm, auch wenn
die hier vorliegende Version verst&#228;ndlicherweise nicht mit der aktuellen
Version 5.0 mithalten kann.</P><center><img src="asv4.jpg"></Center></P><br>

<U>Digital Almanac II - SE Version</U><BR>
Es d&#252;rfte auf der Hand liegen, da&#223; es sich bei dieser Version um eine
speziell f&#252;r die Aminet CD Reihe produzierte handelt, da vor kurzem erst die
eigentliche Vollversion erschienen ist (Review in NC 71). Die hier
vorliegende SE Version ist somit zwar leistungsf&#228;higer als die frei
vertreibbare Sharewareversion, &quot;gl&#228;nzt&quot; aber auch noch durch viele
Einschr&#228;nkungen, die ein professionelles Arbeiten mit dem Programm nicht
zulassen. So bekommt man zwar volle Druckerunterst&#252;tzung und auch die
Einstellungen lassen sich abspeichern, aber daf&#252;r ist der Arbeitszeitraum
auf 20 Jahre (1990-2010), die Asteroidenzahl auf 20 und das Bildverzeichniss
auf 2 beschr&#228;nkt. Hinzu kommen noch die fehlende ARexx Unterst&#252;tzung sowie
starke Limitierungen im Animationsbereich. Insofern kann man mit Digital
Almanac zwar ein bi&#223;chen experimentieren und es auch bedingt als
Astronomieprogramm einsetzen, allerdings dr&#228;ngt sich mir stark der Eindruck
auf, da&#223; es sich hierbei lediglich um eine etwas erweiterte Preview Version
handelt, die den Titel &quot;Vollversion&quot; eigentlich zu unrecht tr&#228;gt. Wer
wirklich proffessionell damit arbeiten will, kann diese SE Version (nach
anf&#228;nglicher Euphorie) getro&#223;t links liegen lassen und ist praktisch
&quot;gezwungen&quot;, auf die regul&#228;re Vollversion umzusteigen...Den Screenshot hier habe ich übrigens vom Wolf Zimmer aus einem seiner
Artikel geklaut :-)))</P><center><img src="asv2.jpg"></Center></P><BR>

Und bevor wir zum eigentlichen Inhalt der CD`s kommen, sei noch erw&#228;hnt, da&#223;
sich auch das Amiga News Archiv &quot;www.amiga-news.de&quot; von Petra Struck (die
damit einen wirklich tollen Job hinlegt!) auf dem Set vorhanden ist -auch
wenn der Inhalt logischerweise alles andere als aktuell ist.</P>

<U>CD A:</U><BR>
Komischerweise haben die Herrsteller der CD die Struktur etwas abge&#228;ndert:
War auf der ersten CD des Sets bisher immer die zahlreichen Utilities zu
finden, so sucht man diese hier vergebens. Komischerweise hat man sich diesesmal dazu entschlossen, die erste
CD extrem &quot;stiefm&#252;tterlich&quot; zu behandeln, indem man dort nur gut 200 MB an
Material der Verzeichnisse &quot;docs&quot; und &quot;text&quot; untergebracht hat. Damit die CD
nicht zu zwei Dritteln leer ist, hat man einfach noch Material von der
dritten CD dieses Sets hier draufkopiert, so da&#223; auch CD A bis zum Anschlag
gef&#252;llt ist. Wenn man das mal au&#223;en vor l&#228;sst und sich nur auf die zwei
Ordner (mit zahlreichen Unterordnern) konzerntriert, wird man auch mehrfach
f&#252;ndig; insbesondere nat&#252;rlich dann, wenn man gerne Texte auf dem heimischen
Bildschirm lie&#223;t. So finden sich u.a. &#228;ltere Ausgaben der NoCover, der
Amiga4ever, des Gadgets, des Star Mags (Rest In Peace), der Amiga Ph&#246;nix und
der Fun Time im Ordner Mags - ebenso wie alle bis dato erschienenen Ausgaben
der AmigaAktuell. Und wem dieser Lesespa&#223; nicht reicht, der wird auch im
Bereich der Hypertextdokumente f&#252;ndig werden. Hier m&#246;chte ich vor allem die
Iron Maiden und Bruce Dickinson Guide (beide auf Englsuch) hervorheben, die
f&#252;r Heavy Metal Fans bestimmt sehr interessant zu lesen sind. Der Bereich
&quot;text&quot; war f&#252;r mich pers&#246;nlich weniger interessant, auch wenn sich hier
ebenfalls sehr viele tolle Tools tummlen; vor allem im Bereich der
Texteditoren wird man hier mehrfach f&#252;ndig (auch wenn die Vollversion GoldED
4.8 eine &#252;berm&#228;chtige Konkurrenz darstellt :-)).</P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="brown">

</TR><TR>
<TD>docs</TD>
<TD>189 MB</TD>
</TR>
<TR>
<TD>text</TD>
<TD>14 MB</TD>
</TR>
</TABLE></CEnter></P><BR>


<u>CD B:</U><BR>
Wesentlich gewohnter geht`s bei CD B des Set`s weiter: Neben den &#252;blichen ganzen Bildern (WB Shots, Bootpics, Background Bilder etc) sind hier zuerst einmal die vielen Icon Sammlungen zu nennen, wobei ich erfreut feststellen kann, da&#223; der Trend weg von MagicWB (mochte ich noch nie...) hin zu NewIcon`s und (OS 3.5 bedingt) zu den tollen Glow Icon`s geht - letztere sind &#252;brigens auch mein pers&#246;nlicher Favorit. Wer also noch Icon`s sucht, der wird hier bestimmt f&#252;ndig. Hinzu kommt noch einiges an Developer Software (ich bin leider kein Programmierer, kann dazu also folgerichtig auch nix sagen), 12 MPEG Animationsdateien (die ordentlich Platz fressen) und die interessanten Verzeichnisse &quot;biz&quot;, &quot;gfx&quot; und &quot;misc&quot;. Und hier wird man viele Softwareperlen finden k&#246;nnen, von denen ich im folgenden einige (wenige) herausgreifen m&#246;chte: Neben den beiden Treibersystemen &quot;WarpUP 4&quot; und &quot;Picasso96&quot; (Version 2.0), m&#246;chte ich im grafischen Bereich vor allem den Bildanzeiger &quot;Mystic View&quot; (sollte man zumindest mal ausprobieren) sowie das Konvertierungsprogramm (auch wenn dieser Titel dem Tool bei weitem nicht mehr gerecht wird) &quot;Super View IV&quot; hervorheben. Dazu gibt`s noch eine ganze Masse an guten MPEG Abspielern (Frogger, akMPEG, Riva), die zum Teil aber schon in neuen Versionen auf diversen anderen CD`s zu finden sind (Amiga Plus, Amiga Future, AmigaOS etc.). Selbiges gilt auch f&#252;r den stark besetzten Emulatoren Bereich der CD, wof&#252;r nat&#252;rlich ein gut ausger&#252;steter Amiga, am besten mit einem PPC Board ausgestattet, von n&#246;ten ist. &quot;Mame&quot;, ebenfalls auf dieser CD vertreten, macht auf 68K Basis zumindest recht wenig Spa&#223; und d&#252;rfte nur mit PPC Board zur H&#246;chstform auflaufen. Nicht ganz so hardwarehungrig sind dann die diversen Anwendungen, die teilweise ein echt hohes Niveau haben: Exemplarisch sei an dieser Stelle die ganz hervorragende Tabellenkalkulation &quot;StarAmPlan&quot; genannt, die einzigste Tabellenkalkulation f&#252;r den Amiga, die noch aktiv 
weiterentwicklet wird. Dazu gibt`s noch einige Demoversionen sowie einen Haufen an Updates f&#252;r diverse Programme, die diese CD des Set`s abrunden.</P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="brown" FONTCOLOR="BLACK">

</TR><TR>
<TD>biz</TD>
<TD>93 MB</TD>
</TR>
<TR>
<TD>dev</TD>
<TD>97 MB</TD>
</TR>
<TR>
<TD>gfx</TD>
<TD>95 MB </TD>
</TR>
<TR>
<TD>misc</TD>
<TD>72 MB</TD>
</TR>
<TR>
<TD>mods</TD>
<TD>136 MB</TD>
</TR>
<TR>
<TD>pix</TD>
<TD>383 MB</TD>
</TR>
</TABLE></Center></P><BR>
<u>CD C:</U><BR>
Urspr&#252;nglich waren Spiele auf der dritten CD des Sets immer der Schwerpunkt, aber diesesmal bekommen diese noch geh&#246;rig Konkurrenz. So finden sich zwar diesesmal auch wieder eine gro&#223;e Anzahl von qualitativ sehr schwankenden Games auf der CD, von denen man hier insbesondere &quot;WormWars&quot; (Schlangenspiel - macht echt Spa&#223;) sowie den Shooter &quot;Chaos Castle&quot; erw&#228;hnen sollte - aber um erhlich zu sein, l&#228;sst die allgemeine Qualit&#228;t in diesem Sektor etwas nach. So gibt es zum einen immer weniger Games und zum anderen l&#228;uft ein Viertel aller Games erst gar nicht auf Grafikkarten, was man im Jahre 2000 eigentlich erwarten kann. Wer sich trotzdem die M&#252;he macht und alles durchw&#252;hlt, der wird sicherlich noch das eine oder andere Highlight entdecken. Aprospos Highlight: Wer gerne mal in der Vergangenheit schwelgt und an gute, alte Amiga Spiele Zeiten zur&#252;ckdenkt, der sollte mal seine alten Games vom Dachboden holen und kontrollieren, ob sich nicht ein passender HD Installer daf&#252;r im Ordner &quot;patch&quot; findet. Denn von Festplatte machen viele Spiele einfach mehr Spa&#223;. Qualitativ hochwertige Demos befinden sich im Ordner Demos - einer der Bereiche, wo wohl niemals Flaute herrschen wird. Und da bald hoffentlich wieder die &quot;Multimedia Corner&quot; vom Yonder kommt, &#252;berlasse ich es ihm mal, dort das passende rauszusuchen. Ebenfalls auf dieser CD sind die zahlreichen gr&#246;&#223;eren und kleineren Utilities f&#252;r unsere Freundinn aus den verschiedensten Bereichen vertreten. Aus dieser Masse etwas rauszusuchen ist nicht ganz einfach und so entscheide ich mich f&#252;r den ebenfalls in dieser Ausgabe getesteten Bootpicviewer &quot;Show Amiga 96&quot; (derren Konkurrent &quot;Rainboot&quot; befindet sich in Version 2.69 auch hier), die Entpacker GUI &quot;Packmaster&quot; (nicht h&#252;bsch, aber effizient) sowie den ultimativen Textconverter &quot;TextloaderNG&quot;. Nat&#252;rlich sind hier noch zahlreiche weitere Programme zu erw&#228;hnen, von denen viele auch in neuen Versionen vorliegen, aber das w&#252;rde wahrscheinlich den Rahmen dieses Artikels sprengen. Insofern kommen wir lieber zum Bereich Disk, 
in dem sich u.a. die Version 5.22 des Backup Tools &quot;ABackup&quot; sowie eine Demo zum &quot;Future Drive Accelerator&quot; befindet - letzter h&#246;rt sich im Readme sehr interesant an und verspricht schnelles Caching, aber da es sich nur um eine Demoversion mit begrenzter Laufzeit handelt, habe ich es erst gar nicht  installiert. Dann gibt`s noch einen Defragmentierer f&#252;r PFS Partitionen sowie ein Windows95 kompatibeles Filesystem namens &quot;Fat95&quot;, welches teilweise zu gebrauchen ist (endlich lange Filenamen auf dem Amiga bei PC Disketten). Das war auch schon unser kleiner Rundgang durch die dritte CD des Aminet Set`s, welche mein pers&#246;nlicher Favorit ist. </P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="brown" FONTCOLOR="BLACK">

</TR><TR>
<TD>comm</TD>
<TD>136 MB</TD>
</TR>
<TR>
<TD>demo</TD>
<TD>392 MB</TD>
</TR>
<TR>
<TD>disk</TD>
<TD>18 MB </TD>
</TR>
<TR>
<TD>game</TD>
<TD>304 MB</TD>
</TR>
<TR>
<TD>hard</TD>
<TD>21 MB</TD>
</TR>
<TR>
<TD>util</TD>
<TD>90 MB</TD>
</TR>
</TABLE></center></P><BR>
<u>CD D:</U><BR>
Ah, wenigstens etwas, da&#223; sich nicht ver&#228;ndert hat: CD D steht ganz im Zeichen der Musik, wenn auch der Anteil an mods f&#252;r meinen Geschmack viel zu hoch ausgefallen ist und die Musiksoftware an sich zu kurz kommt. Ok, daf&#252;r k&#246;nnen die Zusammensteller ja auch nichts und somit muss man sich wohl oder &#252;bel mit dem begn&#252;gen, was man bekommt: Un um ehrlich zu sein, alle mods habe ich mir nicht angeh&#246;rt, da Techno, Hardcore oder auch Trance ganz einfach nicht mein Geschmack ist. Auch im Rock Bereich konnte mich nicht alzu viel Material ansprechen, was aber keineswegs bedeuten soll, da&#223; das Material an mods auf dieser CD durchweg schlecht w&#228;re. Vielmehr war es schon immer so, da&#223; mir ein Gro&#223;teil der mods auf einem Set nicht gefallen hat und da macht dieses hier erwartunsgem&#228;&#223; keinerlei Ausnahme. F&#252;r User, die mods m&#246;gen, wird aber auch hier wieder viel Material dabei sein - f&#252;r mich war da eher die Musiksoftware interessant: 
Neben einigen guten Soundbearbeitungsprogrammen der Marke &quot;SampleE&quot; oder 
&quot;Wavetracer&quot; und etwas Midi Software (wovon ich ebenfalls kein Fan bin), waren vor allem die Abspieler f&#252;r mich interessant: Neben der alten Garde der Soundplayer (&quot;Hippoplayer&quot;, &quot;Eagle Player&quot; (Plugins), &quot;DeliTracker&quot; (Plugins)), machen vor allem die neuen MP3 Spieler, die i.d.R. auch noch viele andere Formate wiedergeben k&#246;nnen, auf sich aufmerksam. Das beste aus diesem Bereich darf nat&#252;rlich hier nicht fehlen und somit ist es kein Wunder, da&#223; &quot;AmigaAMP&quot;, &quot;AMPlifier&quot; und &quot;Prayer 2&quot; den Weg hierher gefunden haben. Dazu gibt`s die &#252;blichen Plugins sowie einige Skin`s und weitere MP3 Tools (Tag
 Editoren, Encoder etc.). Nicht vergessen werden darf an dieser Stelle der neue Modplayer &quot;PlayGUI&quot;, der vor allem dadurch auff&#228;llt, da&#223; er viele Formate beherrscht und zudem eine frei konfigurierbare Oberfl&#228;che mit Skins bereitstellt. Tja, auch der Amiga gliedert sich modernen Trends an....</P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="brown" FONTCOLOR="BLACK">

</TR><TR>
<TD>mods</TD>
<TD>1045 MB</TD>
</TR>
<TR>
<TD>mus</TD>
<TD>36 MB</TD>
</TR>
</TABLE></Center></P><BR>
<h1><center><font color="white">Fazit</Font></h1></center></P>
Sind schon die Einzel CD`s mit Regelm&#228;&#223;igkeit die Kn&#252;ller &#252;berhaupt, so gilt das f&#252;r das Set erst recht. Neben dem unschlagbaren Preis (59 DM) f&#252;r 4 CD`s und dem kompletten Aminet Inhalt nach Set 8 muss man nat&#252;rlich noch die 4 Vollversionen erw&#228;hnen. Man muss zwar leichte Abstriche bei der Aktualit&#228;t machen, aber das ist bei der riesigen Menge an Software zu diesem Preis (um es nochmal zu erw&#228;hnen :-)) wohl mehr als nur vertretbar. Wer nicht im Besitz der Einzel CD`s ist (die Wolf Zimmer ja immer vorstellt - macht wirklich einen guten Job!), der kommt an dem Aminet Set 9 in keinem Fall mehr vorbei. Wer sich &#252;ber mangelnde Software f&#252;r unsere Freundinn beschwert, der soll einen Blick auf dieses Set werfen und wird erstmal einige Tage besch&#228;ftigt sein. Noch eine Warnung; Wer das Set 9 kauft, wird die n&#228;chsten Tage nicht ansprechbar, erreichbar und vor allem nicht unternehmenslustig sein. Will sagen: Das Teil fesselt Euch an Euren Amiga und 
geh&#246;rt in jedes Haus, wo ein Amiga steht. Kaufen!!</P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>59 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>PD Software</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>mehr als 3 GB an Software</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>95 %</TD>
</TR>
</TABLE>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
