<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 3 /2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><center><font color="green">Amiga Plus CD 3 / 2000</Font></center></h1></P>

Wie mitlerweile &#252;blich, erscheint alle zwei Monate eine neue A+ CD, die nat&#252;rlich auch in der NC vorgestellt werden sollte. Was der gute Markus Castro diesesmal abgeliefert habt, k&#246;nnt ihr im weiteren nachlesen.</P>

<h2><center><font color="yellow">Die &#252;blichen Verbesserungen</Font></center></h2></P>
Am auff&#228;lligsten war die nochmalige &#220;berarbeitung des multimedialen Prefs Programm., welches jetzt auch mit Glow Icons sowie diversen Sound Dateien unterlegt ist und einiges hermacht. Zwar ist es noch nicht 100 % bugfrei, aber es l&#228;uft schon sehr ordentlich und sieht auch verdammt gut aus - da hat der Programmierer wirklich ganze Arbeit geleistet. Auch einige neue Icons wurden der CD hinzugef&#252;gt, was dem optischen Gesmatbild sicherlich nur gut tun kann, auch wenn es da in der Vergangenheit (sprich: die letzten beiden Ausgaben) keinen Anlass zur Kritik gab. Ansonsten hielten sich die Ver&#228;nderrungen vornehm zur&#252;ck, was vielleicht auch daran liegen mag, da&#223; man nicht mehr alzu viel zum positiven&#228;ndern kann :-))</P><center><img src="aplus2.jpg"></P><BR><img src="aplus3.jpg"></P></Center>

<h2><center><font color="white">Der  Inhalt</Font></h2></center></P>
An der bew&#228;hrten Struktur der letzten CD`s hat man gl&#252;cklicherweise nichts ge&#228;ndert, so da&#223; man sich recht schnell zurecht finden kann.</P>

<h3><b>Scene</H3></B></P>

<u>Demos:</U><BR>
Wie &#252;blich, kommen hier Fans von Demos voll auf ihre Kosten und k&#246;nnen sich u.a. die neuen Erg&#252;sse mit den Titeln &quot;Killer&quot;, &quot;Wild&quot;, &quot;Overt&quot; und &quot;DeepPan&quot; angucken. Highlight dieses Ordners ist aber sicherlich das unbeschreibliche &quot;Alien2&quot; Demo, welches zwar schon l&#228;nger existiert, aber erst vor kurzem in`s Aminet gestellt wurde. Selbst User, die sonst nix mit Demos am Hut haben, sollten da mal wenigstens reingeguckt haben.</P>

<u>Mags:</U><br>
Auch im Bereich der Demorelevanten Mags hat man ordentlich was auftreiben k&#246;nnen und so sind Mags wie &quot;Oepir&quot;, &quot;ST&quot;, &quot;Frozen&quot;, &quot;Obligement&quot; und &quot;Speed&quot; (jeweils die neuesten Ausgaben) allesamt lesenwert - sofern man etwas mit dem Inhalt anfangen kann und sich nicht an den jeweiligen individuellen GUI`s st&#246;rt...</P>

<h3><b>Multimedia</h3></b></P>

<u>GFX:</U><BR>
Neben einigen dunklen Background Pics (&quot;Gothbench&quot;) f&#252;r die WB gibt`s noch ein paar Icons f&#252;r DirOpus sowie einige Glow Icons f&#252;r NewIcons und OS 3.5 Benutzer. Zwar nicht gerade viel, aber trotzdem n&#252;tzlich.</P>

<u>Videos:</U><BR>
Neben einem QT Video aus dem Aminet befinden sich hier auch 5 MPEG Videos, die mit der Handkamera von Dave Haynie kurz vor dem Commodore Konkurs aufgezeichnet wurden und das bittere Ende nochmals eindrucksvoll dokumentieren; u.a. wird hier auch das ferige AAA (Nachfolger des AGA) Chipset gezeigt. F&#252;r Amiga Freaks also sehr interessante, wenn auch qualitativ nicht hochwertige, Videos.</P>

<u>Sound:</U><br>
Hier befinden sich die obligatorischen (legalen) MP3 Soundfiles aus dem Internet, die zwar mal wieder nicht meinen Geschmack treffen, aber f&#252;r den einen oder anderen Sound Fan sicherlich interessant sind. Aber irgendwann wird`s bestimmt auch mal Metal geben :-)))</P>

<u>Homepages:</U><BR>
Homepages sind immer wieder interessant und das hat auch das Team (...) der A+ CD erkannt und einige gut gemachte HP`s auf die CD kopiert: So findet sich hier neben der &quot;CD32-Source HP&quot;, die sich mit dem CD32 besch&#228;ftigt, auch ein Picture Report der Amiga2000 Show aus St.Louis (leider unvollst&#228;ndig) sowie die offizielle HP des Manga Games &quot;Deep Silence&quot;. Am interessantesten aber fand ich pers&#246;nlich die &quot;Pixelmaster&quot; HP von Thorsten Dudai, der die bekannten Karikaturen f&#252;r den Internet News Dienst &quot;www.amiga-news.de&quot; erstellt. Eines aber haben alle HP`s gemeinsam: Sie sind allesamt echt gut gelungen und ich freue mich in Zukunft schon auf weiteres interessantes Material! </P>

<h3><b>Misc</h3></b></P>

<u>Mags (unterteil in Guide und HTML):</U><BR>
Neben der &quot;AmigaAktuell&quot; (sowohl in Guide als auch HTML) ist auch die 13. Ausgabe der &quot;Amiga Times&quot; (gutes Layout, aber wenig Inhalt) sowie die 73. Ausgabe der von uns allen geliebten &quot;NoCover&quot; hier zu finden. Die &quot;Amiga4ever&quot; hat es leider mal wieder nicht auf die CD geschafft :-(((</P>


<u>Data:</U><br>
Hier ist erstmal das Projekt &quot;Amiga User Liste&quot; zu finden, die sich zum Ziel gesetzt hat, alle aktiven Amiga User in Deutschland zu katalogisieren. Wer sich hier noch nicht eingetragen hat, sollte das schleunigst nachholen und wer wei&#223;: Vielleicht wohnt in Deiner N&#228;he ja noch ein Amiga User? Ansonsten befindet sich hier nur noch ein englischsprachiges Protokoll von einem Chat mit Fleecy als ASCII Datei, die allerdings nicht alzu viel an Informationen hergibt.</P>

<h3><b>Games</h3></b></P>

<u>Demos &amp; Previews:</U><BR>
Neben Videos zu den beiden neuen Amiga Games &quot;Nightlong&quot; und &quot;Virtual Ball Fighters&quot; (zu dem es auch eine spielbare Demo,sowohl f&#252;r AGA als auch RTG Systeme, auf die CD geschafft hat) gibt es auch &quot;spielbare Kurzversionen&quot; (Umschreibung der &quot;Computer Bild&quot; f&#252;r Demoversion) von neuen Games wie z.B. &quot;Wipeout 2097&quot;, &quot;Tales From Heaven&quot; (f&#252;r CGFX), &quot;Homeland&quot; und dem Megaseller &quot;Foundation&quot;. </P>

<u>Starter:</U><br>
Neue HD Installer haben es zwar nicht auf die CD geschafft (wer selbige sucht, sei auf die aktuelle Ausagbe der Amiga Future verwiesen, auf der sich wirklich unz&#228;hlige dieser Installer befinden), aber daf&#252;r gibt`s die jeweils aktuellen Versionen von &quot;JST&quot; und &quot;WHD Load&quot;, die von den Installern ben&#246;tigt werden. Wer diese noch nicht installiert hat, sollte dies schleunigst nachholen!</P>

<u>Oldies &amp; PD</U><BR>
Neben dem einzigen Oldie &quot;Madhouse&quot; tummeln sich auch mal wieder einige qualitativ sehr unterschiedliche PD Games auf der CD; u.a. das grafisch total armselige &quot;Kikstart&quot; (macht aber Spa&#223;!), &quot;A51&quot; (hat nix mit dem gleichnahmigen PSX Game zu tun!), &quot;Freeciv&quot;, &quot;Space&quot;, &quot;Legend&quot; und &quot;Worm Wars&quot;. Dar&#252;ber hinaus gibt`s noch einiges mehr an aktueller Aminet Spielesoft, die man zumindest mal antesten sollte.</P>

<h2><center><Font color="blue">Tools &amp; PowerPC</Font></center></h2></P>

Wie es sich mitlerweile eingeb&#252;rgert hat, verzichte ich auf die detallierte Auflistung s&#228;mtlicher Tools, die sich hier befinden, da es sich zum einen um zu viele Unterordner handelt (insgesamt 22 mit jeweils weiteren Unterordnern) und ich zum anderen keine PPC Karte besitze. Wie &#252;blich handelt es sich bei einem Gro&#223;teil der Software um das aktuellste, was es zum jetztigen Zeitpunkt gibt und es ist in der Tat aus allen Bereichen etwas n&#252;tzliches dabei (Musik, Grafik etc.) - und nicht zuletzt kann man mit den gesammeltem Material sein System nochmals auf den aktuellen Stand der Dinge bringen. Aber trotzdem gibt`s noch ein besonderes Schmankerl, das man nicht unerw&#228;hnt lassen sollte (obwohl es in der HTML Datei keinen Hinweis drauf gibt): Die Oldies! Rainer Benda, der momentan aus total unerkl&#228;rlichen Gr&#252;nden &#196;rger mit Amiga / Cloanto hat (wie das teilweise von den Firmen argumentiert wird, ist ein Witz!!), hat den Inhalt seiner BBS der Amiga Plus CD 
freundlicherweise zur Verf&#252;gung gestellt und so befinden sich hier neben den Kickstart und WB Files von Version 1.0 - 2.0 auch massenweise BETA / Entwicklersoftware, EPROM`s, Schaltpl&#228;ne und sogar einiges an total alter Software wie z.B. &quot;Textcraft&quot; oder das Game &quot;Mindwalker&quot;. F&#252;r Nostalgiefans ist dieser Ordner sicherlich sehr interessant und wer den UAE auf einem Amiga / PC benutzt, der sollte spa&#223;eshalber zumindest mal die WB 1.0 installieren. Aber auch das sonstige Material lie&#223; zumindest mich noch mal in angenehmen Erinerrungen schwelgen - zumal ich Textcraft nochmals auf einem alten Kick 1.3 A2000 benutzen konnte. Diesen Bonus Ordner in Worte zu fassen ist nicht ganz einfach, aber ich bin sicher, da&#223; 99 % aller Amiga User etwas mit dem antiquierten Inhalt anfangen k&#246;nnen :-))</P>
<center><img src="aplus1.jpg"></Center></P><br>
<h2><center><Font color="red">Fazit</Font></Center></h2></P>
Im Grunde k&#246;nnte ich das Fazit der letzten CD einfach &#252;bernhemen, obwohl die CD im gro&#223;en und ganzen noch einen Tick besser geworden ist - das war zumindest mein Gef&#252;hl, nachdem ich die CD mehrfach durchw&#252;hlt hatte. Gro&#223;artige Ver&#228;nderrungen sind zwar ausgeblieben, aber warum sollte man auch etwas gut funktionierendes &#228;ndern? Die kleinen Detailverbessrungen werten die CD zus&#228;tzlich auf und der Inhalt ist &#252;ber jede Kritik erhaben. Eine lieblose Zusammenstellung sieht auf jeden Fall anders aus und so kann ich Euch ohne schlechtes Gewissen die 3 / 2000 der Amiga Plus CD an`s Herz legen.</P> 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
