<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Desert Racing From BarDos</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CEnter><h1><b>Desrt Racing From BarDos - Preview</CEnter></h1></b><hr>
<center><img src="dr1.jpg"></Center><BR>
<hr>
<font size="+1">
Rennspiele, in allen m&#246;glichen Varinaten, haben auf unserer Freundinn ja eine lange Tradition, oder wer erinnert sich nicht gerne an klassische Vertreter wie &quot;Super Cars&quot; oder &quot;Lotus Esprit Turbo Challenge&quot; zur&#252;ck? Seit diesen Klassikern sind nat&#252;rlich auch einige Jahre in`s Amigaland gezogen und die Technik ist nat&#252;rlich nicht stehen geblieben. Ein komplett neues Rennspiel nennt sich &quot;Desert Racing Of BarDos&quot; (im folgenden nur noch &quot;Desert Racing&quot;), welches bisher zwar erst in einer Preview Version vorliegt, aber dennoch einen vielversprechenden Eindruck macht. </P>

Nachdem man die Demo (zu finden u.a. auf der Future CD 24) gestartet hat, wird man erstmal von einer kleinen Introanimation und einem tollen Raytraycing Pic begr&#252;&#223;t. Insbesondere letzteres macht einen recht guten Eindruck und l&#228;sst zumindest schonmal die Ahnung aufkommen, da&#223; es sich nicht nur um ein etwas &quot;geputschtes&quot; PD Game auf unterem Niveau handelt. Anschlie&#223;end gelangt man auch schon in`s Optionsmenu, wo man u.a. die zu befahrende Strecke, die Rundenzahl (1-32) und sogar zwischen Single und Season Race w&#228;hlen kann. Auch das Fahrzeug ist frei w&#228;hlbar, wobei sich dabei ein neuer Screen &#246;ffnet und die detalliert gestalteten Fahrzeuge in ihrer ganzen Pracht pr&#228;sentieren.</P>

Hat man alle Einstellungen, unterlegt von gut gemachten Sounds, getroffen, kann es endlich an`s eingemachte, sprich das Rennen, gehen: Und auch hier beweist der Programmierer, da&#223; er nicht auf dem Stand von 1990 stehen geblieben ist. So wird &quot;Desert Racing&quot; nicht etwa aus der Sicht des Cockpits gesteuert, sondern mittels einer drehbaren &quot;virtuellen Kamera&quot; von schr&#228;g oben, die zudem einstellbar ist. Die Steuerrung erfolgt nat&#252;rlich mittels eines Joysticks und gibt in der Previewversion keinen Anlass zur Klage (man denke nur an &quot;Flyingh High&quot;...). Auch im grafischen Bereich hat man sich sichtlich M&#252;he gegeben und f&#252;t ein Ein-Mann-Projekt schaut das ganze auch schon sehr ordentlich aus. Wie man auf dem Screenshot erkennen kann, wurde die Landschaft komplett in 3D gehalten und auch die Fahrzeuge sehen sehr edel aus. Was mir als Grafikkartenbesizer pers&#246;nlich fehlt ist zum einen eine h&#246;here Aufl&#246;sung (die zu erkennenden Pixel am Boden tr&#252;ben das Gesamtbild der Grafik sicherlich nicht unwesentlich) und zum anderen noch etwas mehr Details in der Landschaftsgestaltung, denn hier wird ausser einigen B&#228;ume, die man zugunsten der Geschwindigkeit auch abstellen kann, nicht viel geboten. Ideal w&#228;re aus meiner Sicht die Unterst&#252;tzung von g&#228;ngigen Standards wie RTG und Warp3D, denn damit k&#246;nnte man aus &quot;Desert Racing&quot; im grafischen Bereich sicherlich noch eine Menge rausholen. Alles in allem ist die Grafik trotzdem recht ansehnlich gelungen und hebt sich deutlich (!) vom PD Standard ab - was man ja in den letzten Monaten wirklich nicht von jedem Amiga Game behaupten konnte. Der gut gemachte Sound w&#228;hrend des Rennens rundet den ersten Eindruck positiv ab und l&#228;sst zudem auch richtig Atmosph&#228;re aufkommen, was einem Rennspiel bestimmt nicht schaden kann.</P>

Wirklich negativ zu erw&#228;hnen ist nur die sehr spartanische Deutsche Guide Datei, in der sich nur die n&#246;tigsten Informationen abrufen lassen, sowie der eine oder andere Absturz beim beenden des Rennens (was aber nicht unbedingt am Spiel, als vielmehr meinem System liegen kann, da es bei einem Kollegen absturzfrei lief).</P>

<h2><center><b>Fazit</h2></Center></B></P><font size="+1">
&quot;Desert Racing&quot; macht auf mich schon in dieser Previewversion einen sehr guten Eindruck und man merkt gleich, da&#223; der Programmierer hier eine Menge Arbeit reingesteckt hat. Vom spielerischen geht alles v&#246;llig in Ordnung und sollte man noch kleinere Verbesserungen in Bezug auf die Grafik vornehmen, kann man davon ausgehen, da&#223; &quot;Desert Racing&quot; als Full Price Game sicherlich ein Erfolg werden k&#246;nnte. Das Potential dazu ist allemal vorhanden und ich bin schon jetzt gespannt, was daraus wird! </P>
<center><img src="kit.gif"></P><br></Center><pre> 

Name           : Desert Racing Of BarDos

Programmierer  : Ralf Schmidt

Release        : ???

Preis          : ???

Anforderrungen : AGA, 68030, CD Laufwerk, 2 MB Chip Ram, 8 MB Fast Ram

Empfohlen      : mehr schadet nie...</PRE></P><BR>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
