<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<h1><center><font color="green">Leserbrief von Kilian &quot;The Bruce&quot; Servais</font></center></h1></P>
<ul>
<li><a href="#mark.html">An Mark Tom</A><BR>
<li><a href="#jon.html">An Jon Doe.</A><BR>
<li><a href="#sieglinde.html">An Sieglinde</A><BR>
<li><a href="#castro.html">An Markus Castro</A><BR>
<li><a href="#wolf.html">An Wolf Zimmer</A><BR>
<li><a href="#top.html">Top 5</A></P></Ul>
<hr>
<a name="mark.html">
<u>An Mark Tom:</U><BR>
Erstmal danke f&#252;r Deine lobenden Worte in der letzten Feedback Corner - tut echt gut sowas zu lesen :-))
</P>
Was die diversen Spiele Tests angeht: Ist sicherlich alles eine reine Geschmackssache, aber zumindest mir ist die Grafik erstmal v&#246;llig schnuppe, wenn das dahintersteckende Spielprinzip s&#252;chtig macht. Und da ich ohnehin keinen PC besitze (bzw. benutze) und auch keine Konsole mein eigen nenne, bin ich vielleicht nicht der kompetenteste, um &#252;ber Spiele zu berichten bzw. diese mit Standards auf anderen Systemen zu vergleichen. Aber trotzdem bin ich der Ansicht, da&#223; auch der heutige Amiga Spielemarkt noch gen&#252;gend Potential hat. Warten wir`s mal ab...</P>

Yup, die Metal Corner habe ich bisher noch nie ausfallen lassen und sollte nix weltbewegend wichtiges dazwischenkommen, d&#252;rfte es  auch in absehbarer Zeit nicht dazu kommen. Ganz im Gegenteil: H&#246;chstwahrscheinlich wird das Ding noch ausgebaut und erweitert, aber dazu an anderer Stelle mehr. Zu Deiner Frage bezgl. True Metal: Als True Metal Bands bezeichnet man gemeinhin die Bands, die versuchen, die alten Bands (also inkl. s&#228;mtlicher Klischees etc.) nachzumachen und insofern k&#246;nnte man sicherlich einen Vergleich zur NWOBHM ziehen. Pegazus zum Bleistift, eine recht junge Band, spielt klassischen Metal im Sinne von Iron Maiden und werden auch als True Metal Band bezeichnet - hier stimmt Deine These. Die bekannteste True Metal Band sind aber HammerFall und erinnern mehr an die deutsche Garde des Metals, also Helloween, Gamma Ray und Co., die wiederrum auch von Acts der NWOBHM beeinflusst wurden. Ist also etwas kompliziert, aber wenn Dir die NWOBHM Acts (Iron Maiden, Samson, Judas Priest, Angel Witch etc.) gefallen haben, dann wirst Du auch einen Gro&#223;teil der heutigen True Metal / Power Metal Bands m&#246;gen. Ist aber auch ein wirklich kniffliges Thema und ich hoffe einfach mal, da&#223; ich nicht an Deiner Frage vorbeigesegelt bin....</P>

Das zweite Mag, in dem die Metal Corner ver&#246;ffentlicht wird, hei&#223;t &#252;brigens Amiga4ever und unterschiedet sich ziemlich stark von der NC. Davon kann sich aber auch jeder ein Bild machen und mal im Aminet nachschauen - eine Garantie daf&#252;r, da&#223; man die 4ever dann auch mag, kann ich hier nat&#252;rlich nicht geben. Und in HTML gef&#228;llt mir die Metal Corner ohnehin etwas besser.</P>

Die A-Z of Amiga Games habe ich mir nicht zugelegt, sondern der Andreas hat mir diese zum testen in der NC geschickt und insofern brauchte ich daf&#252;r keinen Pfenning bezahlen - ausser nat&#252;rlich das Porto f&#252;r das zur&#252;ckschicken der CD. Mal abgesehen davon: Das Geld w&#228;re in einer Modern Talking CD IMHO nicht besser angelegt gewesen - im Grunde ist alles besser, als sich eine Modern Talking CD zu holen (h&#246;ren sich ohnehin alle gleich an.... frage mich nur, wann der &quot;S&#228;nger&quot; seine Eier verliert :-)); da w&#252;rde ich das Geld eher zum Fenster rauswerfen. </P>

So, da&#223; war`s von meiner Seite. Lass mal wieder was von Dir h&#246;ren!!</P>

Read You!</P>
<hr>
<a name="jon.html">
<u>An Jon Doe:</U><br>
Sch&#246;n, da&#223; du mal wieder etwas in die NC geschrieben hast! Zu Deinem Drucker Problem kann ich Dir nur einen Rat geben: Kauf Dir Turbo Print und genie&#223;e das Leben danach! Mal im Ernst: Ich habe TP seit Jahren im einsatz und selbst mit der heute total veralteten Version 4.1 niemals Probleme gehabt. Die Installation ist kinderleicht und vor allem kannst Du danach mit JEDEM Tool ausdrucken; die WB Voreinsteller werden dann absolut &#252;berfl&#252;ssig und k&#246;nnen gel&#246;scht werden. Die Canon Disk kenne ich zwar nicht, aber ich w&#252;rde prinzipiell jedem User, der einen Drucker hat, TP empfehlen, da es der de facto Standard auf dem Amiga ist. Falls noch Fragen sind, kannst Du mich gerne kontakten. See ya! </P>
<hr>
<a name="sieglinde.html">
<u>An Sieglinde:</U><br>
Sch&#246;n, da&#223; Du immer noch Deinen Amiga benutzt, wobei ich Dir nur einen Tip geben kann: Hol Dir eine GraKa, denn damit wisrt Du Deinen Amiga nicht wiederkennen und einen Gedanken an den PC wirst Du auch nicht mehr verschwenden. Denn einfach nur all Deine Probleme auf das System Amiga zu schieben, ist nicht fair - insbesondere dann nicht, wenn man &quot;nur&quot; einen 030er sein eigen nennt. Sorry, aber das damit das Arbeiten keinen Spa&#223; macht verstehe ich 
absolut und deswegen w&#252;rde ich Dir zumindest zur Investition einer GraKa raten - alleine schon deshalb, um die Augen zu schonen. Ich w&#252;rde durchaus auch dem jetztigen Amiga noch eine Chance geben, nicht zuletzt deswegen, weil der NG Amiga auch auf einem PPC Classic Amiga laufen soll - also grunds&#228;tzlich auch auf einem A1200 wie Du ihn besitzt (wenn da nicht die PPC Karte fehlen w&#252;rde). Einfach nur das System zu wechseln, ist eine ziemlich bl&#246;de L&#246;sung und f&#252;hrt i.d.R. ohnehin schnell zur Frusterlebnissen und &#228;hnlichem. Sp&#228;testens wenn Du die ersten Probleme mit Windows bekommst, wirst Du Dir schnell einen Amiga zur&#252;ckw&#252;nschen. Diese Erfahrung m&#246;chte ich Dir erspaaren und bitte Dich, doch nochmal die Lage zu &#252;berdenken und evtl. das Geld in Amiga Hardware zu investieren - es lohnt sich nach wie vor!!</P>
<hr>
<a name="castro.html">
<u>An Markus Castro:</U><br>
Auch wenn wir uns inzwischen schon des &#246;fteren anderweitig gesprochen haben, wollte ich auch kurz per NoCover etwas an Deine Addy loswerden - dann ist die Rubrik &quot;Leserbriefe&quot; wenigstens nicht ganz verwaist! </P>

Den Test f&#252;r die A+ CD habe ich mitlerweile auch fertig und sollte in dieser Ausgabe auch drin sein. Vielen Dank auch f&#252;r Deine hilfe bezgl. der Fragen, die ich in der letzten NC gestellt habe. Leider ist sonst nur noch der Wolf Zimmer drauf eingegangen, aber mit soetwas habe ich insgeheim schon gerechnet gehabt. Die n&#228;chsten Metal Tapes habe ich auch schon in Angrif genommen und heute morgen (15.5.00) habe ich dann das erste fertig gekriegt. Sollte aber eigentlich mitlerweile alles bei Dir angekommen sein, wenn du diese Zeilen hier liest. Was das Layout angeht, habe ich dich wahrscheinlich schon kontaktiert. Bis dann mal!</P>
<hr>
<a name="wolf.html">
<u>An Wolf Zimmer:</U><br>
Sei gegr&#252;&#223;t! Jetzt habe ich auch endlich wieder etwas mehr Zeit, um auf Deine diversen Mails einzugehen - vor einigen Tagen sah es da leider noch ganz anders aus, da dort einige sehr wichtige Klausuren auf dem Programm standen. Viiiieeeeelllllllleeeeeennnnn Dank &#252;brigens nochmals f&#252;r das Zusenden der NC Guide - mitlerweile sollte das E-Mail Problem auch behoben sein :-))</P>

Auch Dir gilt mein Dank bezgl. der Fragen, die ich in der vorletzten NC gestellt hatte und zudem Du mir auch eine Antwort per E-Mail gesendet hattest. Um eine neue Tastatur komme ich wohl nicht mehr rum, aber ich werde zumindest die Amiga Messe in Neuss abwarten - vielleicht bekomme ich da ja auch eine etwas billiger und brauch diese dann nicht bestellen.</P>

Was die NC Guide angeht: Ich kann Dich immer wieder nur ermutigen damit weiterzumachen, denn diese hilft mir teilweise sehr und ich bin mir sicher, da&#223; auch die anderen Clubber Deine Arbeit w&#252;rdigen. Nur ist es oftmals so, da&#223; man positive Dinge lieber f&#252;r sich beh&#228;lt und nur die negativen Sachen erw&#228;hnt. Ich kann dir dazu nur sagen, da&#223; es wirklich klasse ist, wie du Dich f&#252;r den Club einsetzt und ich bin mir sicher, da&#223; der Markus Castro, die Schaltfl&#228;che tats&#228;chlich aus Zeitmangel so gestaltet hat, wie du es in Deinem Brief an mich bem&#228;ngelt hast. Das du dar&#252;ber nicht sehr gl&#252;cklich bist, kann ich durchaus verstehen, aber aus mehreren Gespr&#228;chen mit dem Makus wei&#223; ich, da&#223; er wirklich total im Stress steht und es da leider zu solchen kleineren Fehlern kommen kann. Deine Theorie, da&#223; er immer noch wegen des Filmberichts auf Dich sauer ist, kann ich nicht teilen - wie w&#228;re es, wenn Du ihn einfach mal drauf ansprichst?</P>

Was das Thema Birthday angeht: Leider habe ich jetzt das Problem, da&#223; mein Organiser auf dem Rechner wegen der defekten Uhr nicht mehr korrekt l&#228;uft und ich deshalb nicht mehr dran erinnert werde, wann wer Birthday hat. Bei meinen Kollegen aus Herne ist das auch kein Problem, aber insbesondere wenn es um Bekanntschaften aus dem Amiga Sektor geht, wird soetwas dann leicht problematisch. Das ich dennoch Deinen Birthday in Erinerrung hatte lag nur daran, da&#223; ich mal kurz durch die Mitgliederliste gegangen war und dann entdeckt hatt, da&#223; Du eines der Geburtstagskinder bist. Aber mach Dir nix raus, 
da&#223; sonst kaum noch welche gratuliert haben; ich pers&#246;nlich hasse die eigenen Geburtstage aus verschiedenen Gr&#252;nden und bin froh, wenn diese vorbei sind (nur dieses Jahr wird es bestimmt cool - ist immerhin der 18).</P>

Danke auch f&#252;r Deine Tips &amp; Hinweise bezgl. der Future - evtl. werde ich den Andreas mal anmailen. </P>

Read you!</P>
<hr>
<a name="top.html">
<h1><center><font color="yellow">Top 5</Font></h1></center></P>

1. Aminet von Wolf Zimmer (sicherlich viel Arbeit)<br>
2. Alle 3 Drucker Tests von Cord &quot;Mr. Amiga Future&quot; Hagen (kompetent berichtet)<br>
3. Aminet 36 von Wolf Zimmer (potentielle Nachfolger haben es schwer :-))<br>
4. Beide Feedback Corners von Mark Tom &amp; The Saint (gelungene Ausleuchtung der vorletzten NC)<br>
5. Vivanco von John Doe (Welcome Home!) </P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
