<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Feedback Corner</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<h1><center><font color="green">Feedback Corner</Font></h1></center></P>

Mal wieder ist eine Ausgabe der NC erschienen und diesesmal fiel mir das Privileg zu, eine Feedabck Corner zu schreiben. Ich hoffe einfach mal, da&#223; ich ausf&#252;hrlich genug auf die diversen Artikel eingehe und dabei objektiv zu Werke gehe - los geht`s also! Vorher aber noch die Anmerkung, da&#223; ich auf meine eigenen Artikel nat&#252;rlich nicht eingehe. Deswegen fehlen hierbei auch leider die Rubriken &quot;Multimedia&quot; und &quot;Tools&quot;...</P>

<h2><b>Rubriken</h2></b></P>

Zu den &quot;festen&quot; Einrichtungen wie Amiga Aktuell, AUL, HP News und Kleinanzeigen sage ich an dieser Stelle nichts mehr, da wohl einschl&#228;gig bekannt ist, was sich dahinter verbirgt und ich an dieser Stelle keine abgedroschenen S&#228;tze neu zum besten geben m&#246;chte...</P>

<u>Comic:</U><br>
Nack kurzer Abstinenz sind die Comics, komplett runderneuert, wieder da und ich muss sagen, da&#223; sich der Thomas Weber da wirklich M&#252;he gegeben hat. Neben einem neuen grafischen Format (gut so) ist vor allem das neue Layout mit einem langen Vorwort zu begr&#252;&#223;en. Mir gefielen die Comics schon fr&#252;her immer wieder und auch im neuen Format sind sie allemal zu begr&#252;&#223;en und sind ein wichtiger Bestandteil einer jeden NC. Ich kann Dich also zu Deiner Entscheidung nur begl&#252;ckw&#252;nschen und wenn Deine neuen Ideen ebenfalls so toll sind, kann im Bezug auf Comics in der NC nix mehr schiefgehen. Sch&#246;n, da&#223; Du wieder da bist!!</P>

<h2><b>Workshops</h2></b></P>

<u>Harald Schmidt:</U><Br>
Schon seit Monaten sind die Spr&#252;che von Harald Schmidt ein fester Bestandteil einer jeden NC, auch wenn ich an dieser Stelle gestehen muss, da&#223; ich die letzten Ausgaben nur sehr fl&#252;chtig gelesen habe. Warum das? Es ist einfach zu viel Text auf einmal und um sich das alles an einem St&#252;ck durchzulesen, muss man wirklich Langeweile haben. Ein weiterer Kritikpunkt ist der Hintergrund, den auch Mark Tom in seiner letzten Ausgabe kritisierte: Er ist de facto viel zu bunt und wird bei mir, wenn ich diesen &quot;Workshop&quot; lese, immer ausgeschaltet - es lie&#223;t sich dann wesentlich entspannter. Aber bevor diese Kritik zu negativ klingt: Mach blo&#223; weiter damit Yonder, denn momentan braucht die NC wirklich jeden Artikel und da Harald Schmidt wirklich einige gute Spr&#252;che auf Lager hat, kann des&#246;fteren zumindest geschmunzelt werden. </P>

<h2><b>Games</h2></b></P>

<u>Nachtrag Blade:</u><BR>
Nachtr&#228;ge zu Artikeln sind in letzter Zeit fast &#252;berhaupt nicht mehr in der NC zu finden und deshalb finde ich es gut vom Andreas Guldner (kein Pseudo?), da&#223; er sich auf diese Weise aktiv an der NC beteiligt. Der Text an sich ist zwar kompetent geschrieben worden, allerdings sind mir auch einige Sachen negativ aufgesto&#223;en: Da w&#228;re zum ersten das Layout, welches komplett mit dem Befehl &quot;Center&quot; gestaltet worden ist. Meiner Meinung nach erschwert das den Lesefluss unn&#246;tig und sieht IMHO auch nicht besonders gut aus. Ist zwar Geschmackssache, aber in Zukunft w&#252;rde es mich sehr freuen, wenn Du die Artikel normal ausgerichtet abspeichern w&#252;rdest. Der Hintergrund ist ok und vertr&#228;gt sich gut mit der wei&#223;en Schrift, aber daf&#252;r gibt`s noch zwei kleinere M&#228;ngel, die aber sofort abgeschaltet werden k&#246;nnen: Zum einen w&#228;re da die kaum vorhandene Gro&#223;schreibung von Nomen (ich bin sicher, du wei&#223;t, da&#223; Worte wie 
&quot;Funktion&quot; gro&#223; geschrieben werden; beim n&#228;chsten mal einfach nochmal den Artikel durchgehen) und zum anderen das Inhaltsverzeichniss Bild am unteren Rand, welches, bedingt durch die Umstellung auf Frames, keinen Sinn mehr erf&#252;llt und nur unn&#246;tig Platz belegt. Beim n&#228;chsten mal einfach diesen Teil aus dem HTML Text l&#246;schen und die Datei nicht mehr mitkopieren.</P>

<u>Chaos Castle:</u><BR>
Tests oder Vorstellungen zu PD Games waren in den letzten NC`s nur sehr sp&#228;rlich anzufinden und G&#252;nter Kohlm&#252;ller hat sich die M&#252;he gemacht, das PD Game &quot;Chaos Castle&quot; zu empfehlen. Obwohl im Text alle n&#246;tigen Info`s drin sind, fehlt mir pers&#246;hnlich ein Screenshot, aber aufgrund dieses Artikels werde ich es trotzdem mal antesten. Ein Layout ist zwar nicht wirklich vorhanden, aber aufgrund der Tatsache, da&#223; es sich auch nur um eine Empfehlung handelt, ist es sicherlich verzeilich. Ich finde es auf jeden Fall gut, da&#223; sich jemand die M&#252;he macht und ein PD Game in der NC vorstellt. Ist sicherlich noch ausbauf&#228;hig, aber der Ansatz stimmt. Weiter so!!</P>

<h2><b>Hardware</h2></b></P>

<u>Drucker Tests:</U><br>
Cord Hagen treibt wieder einmal sein Unwesen und stellt uns sein technisches Wissen mittels drei Drucker Tests (HP, Canon, Epson) zur Verf&#252;gung und das mit bemerkenswerter Kompetenz. Da er ja eigentlich kaum Zeit hat ist es umso bemerkenswerter, da&#223; er sich die M&#252;he macht und Artikel f&#252;r die NC schreibt. Ein durchweg guter Schreibstil sowie ausf&#252;hrliches Hintergrundwissen runden diese drei Artikel ab - ebenso wie bei &quot;Chaos Castle&quot; ist auch hier das Layout recht karg ausgefallen, ist aber bei Artikeln aus diesem Genre zu verzeihen. Ansonsten sehr gut!!</P>

<u>Fujitsu:</U><BR>
Nochmals ein Artikel von Higgins f&#252;r den im gro&#223;en und ganze das selbe gilt, wie oben. Hier fehlen lediglich Info`s &#252;ber die Kompatibilit&#228;t zum Amiga, aber ansonsten auch top. Nur muss ich sagen, da&#223; Digitale Kameras gegen&#252;ber den normalen Kameras noch zahlreiche Einschr&#228;nkungen bezgl. der Technik haben, so da&#223; diese f&#252;r mich noch keine Alternative sind. Aber wer nicht unbedingt professioneller Fotograph ist, wird dar&#252;ber wohl hinwegsehen k&#246;nnen...</P>


<u>Pioneer:</U><BR>
Ein Artikel aus John Doe`s Feder, der sich nach einigen Ausgaben auch mal wieder zur&#252;ckmeldet. Zwar geht er in dem Artikel nicht ausf&#252;hrlich auf das neue Laufwerk ein (ist zugegebenerma&#223;en wohl auch recht &#252;berfl&#252;ssig, da es heutzutage wohl auch nicht mehr so entscheidend ist, welches Markenlaufwerk man angeschlossen hat), zeigt aber die entstandenen Probleme auf und nat&#252;rlich auch derren L&#246;sung. Vielleicht hat ja jemand ein &#228;hnliches Problem gehabt und ist nun auf die L&#246;sung gekommen?? Ok, auch dieser Artikel war nicht besonders lang, aber in &#228;lteren Ausgaben der NC sind gerade solche kurzen Dateien immer wieder zu finden und es ist allemal besser, als nix zu schreiben. Weiter so John Doe!!</P>

<u>Vivanco:</U><BR>
Nochmal ein Artikel aus John Doe`s Feder. Diesesmal hat es aber mit Amiga &#252;berhaupt nix zu tun, sondern es dreht sich um einen Funk Kopfh&#246;rer, den John Doe kompakt, aber mit allen wichtigen Fakten in einem recht ahnsehnlichen HTML Dokument vorstellt. Und auch wenn das Thema nix mit Amigas zu tun hat (doch, man kann ihn auch daran anschlie&#223;en :-)), so habe ich diesen Bericht sehr gerne gelesen und da zudem auch noch eine Bezugsaddy drin war, ist alles komplett. Ein alles in allem kompakter Artikel, mit allem wichtigen. Hat mir wirklich gefallen!</P>

<h2><b>CD-Theke:</h2></b></P>

<U>Aminet 36:</U><BR>
Wolf Zimmer war mal wieder flei&#223;ig und hat die neueste Aminet CD nach seinem altbewährten und meiner Meinung nach gutklassigem System vorgestellt. Da es recht schwierig ist, &#252;ber eine solch gro&#223;e Sammlung wirklich kompetent zu berichten (habe ich gerade in Form des Aminet Sets 9 am eigenen Leibe gemerkt :-)), macht Wolf das einzig richtige und gibt kurze Infos zur aktuellen Vollversion &quot;Max Ralley&quot; (zugegebenerma&#223;en nicht so der Kn&#252;ller), listet die Empfehlungen der CD Zusammensteller auf (auch sinvoll!!) und greift sich dann noch einige Sachen raus, auf die er nochmal genauer eingeht. Das ganze verpackt er in ein ansprechendes Layout und der Bericht ist fertig. Sollte sich endlich jemand gefunden haben, der die Tests &#252;bernimmt (was ich immer noch nicht ganz verstehe - immerhin leistet der Wolf hier Weltklasse Arbeit), sollte er versuchen dieses System zu &#252;bernehmen - alles andere w&#252;rde wohl nur beschr&#228;nkt Sinn machen. Zusammengefasst ein f&#252;r diese 
CD idealer Artikel, bei dem es an nichts fehlt. Top!</P>

<h2><b>Leserbriefe</h2></b></P>
Also ehrlich Leute: So geht es nun wirklich nicht mehr!! Ist Sieglinde etwa die einzige, die neben mir noch etwas zu sagen hat?? Das kann ich mir wirklich absolut nicht vorstellen und selbst wenn man nichts mehr zu besprechen hat, so kann man wenigstens seine Top 5 (oder was wei&#223; ich) eintippen und evtl. noch ein bi&#223;chen Feedback mitsenden. Wenn man sowieso etwas schreibt, macht es doch wirklich keine M&#252;he eine neue Datei mit seinen Eindr&#252;cken von der letzten NC schnell zu tippen - man braucht ja auch wirklich nicht auf jeden Artikel eingehen, daf&#252;r ist die Feedback Corner ja auch da, aber schon so kurze Phrasen wie &quot;Der Aminet CD Test hat mir gefallen&quot; w&#252;rden dem einen oder anderen Autor sicherlich gut tun und w&#252;rden sicherlich auch dazu beitragen, da&#223; sich diverse verschollene Autoren auch mal wieder zur&#252;ckmelden. Und mal ehrlich: Es gibt bestimmt etwas, &#252;ber das ihr Euch mit anderen Clubbern unterhalten k&#246;nnt. Schreibt also bitte mal wieder den einen oder anderen Leserbrief!</P>

<h2><b>Diskussionen:</h2></b></P>
Auf die Artikel an sich m&#246;chte ich an dieser Stelle auch nicht weiter eingehen, aber es war zum einen toll, da&#223; man nun zumindest eine halbwegs aktuelle Diskussion am laufen hat (weitere Meinungen gefragt) und zum anderen hat sich hier Rolf Nue. mal wieder zur&#252;ckgemeldet. Was war los? Habe ja schon lange nix mehr von Dir und Deinem Amiga geh&#246;rt. Dich gibt es also auch noch. Nur weiter so, finde ich ehrlich echt gut, da&#223; Du Dich mal wieder zur&#252;ckgemeldet hast und zudem auch noch etwas positives &#252;ber den Falke Verlag zu berichten hattest. Ok, ich stehe zwar oppositiv zu Deinem Beitrag, aber das macht ja nix. Hoffe, da&#223; in dieser Hinsicht auch weiterhin etwas von Dir kommt. Ansonsten ist leider auch im Bereich der Diskussionen g&#228;hnende Leere zu verzeichnen.</P>

<h2><b>Small Talk</h2></b></P>

<u>NC Hitparade:</U><BR>
Einer der wenigen Autoren, der sich auch ein Kompliment verdient hat, ist der Yonder: Monat f&#252;r Monat macht er sich die M&#252;he und verfasst die Hitparaden der NC. Auch wenn der Sascha mich vom Thron gesto&#223;en hat (das bedeutet Krieg :-))) ist es allemal lobenswert, da&#223; der Yonder regelm&#228;&#223;ig mit seinen Top X (das differiert von Ausgabe zu Ausgabe) in der NC vertreten ist. Wenn jetzt noch endlich die Multimedia Corner mal wieder an Bord w&#228;re (komm, gib`s schon zu, Du hast `ne neue Perle :-)), w&#228;re alles in Butter und ich h&#228;tte an dieser Stelle nix mehr zu kritisieren. </P>

<u>Feedback Corner 1 (von Mark Tom):</U><BR>
Auch er hat sich hier mal wieder zur&#252;ckgemeldet und gleichzeitig eine Ausrede parat gehabt, warum er die letzten Ausgaben nicht schreiben konnte. Ist aber v&#246;llig in Ordnung, da sich Mark Tom sowieso in der Vergangenheit stark f&#252;r die NC engagiert hatte und ihm sicherlich kein Vorwurf zu machen ist. Zu dieser FC gibt`s unter Garantie viel zu sagen, allerdings habe ich das alles in meinen Leserbrief an Mark Tom reingeschrieben und eine Wiederholung w&#228;re wohl &#252;berfl&#252;ssig. Um trotzdem dazu noch was zu sagen: Diese Ausgabe der FC hat mir sehr gut gefallen, zudem Mark Tom in keiner Hinsicht ein Blatt vor den Mund nimmt, was ich sehr sch&#228;tze. Und auch das negative Fazit am Ende ist wohl nicht ganz verfehlt. Und da zudem alles in einem guten Layout verpackt war, bleibt mir wohl nix anderes &#252;brig, als diesen Artikel mit &quot;sehr gut&quot; zu bewerten...</P>

<u>Feedback Corner 2 (von Markus Castro):</U><BR>
Mmhh, gleich zwei FC Ausgaben in einer NC? Wann hat es das denn das letztemal gegeben? Ist ja im Prinzip auch egal, denn lieber einen Artikel zu viel als zu wenig. Und auch wenn der gute Saint ein bi&#223;chen was intus hatte (und ich sage immer: Nimm &quot;Amaretto&quot; ; greetings to Alex Form.), war auch diese FC gut zu lesen, auch wenn er sich wiederholt hat. Alles in allem eine wirklich sinnvolle Erg&#228;nzung zur anderen FC und, bedingt durch das sehr gute Layout, ebenfalls &quot;sehr gut&quot; (bin ich jetzt besoffen, oder was??).</P>

<u>Erfahrungen mit Disk Salv:</U><BR>
Erfahrungsberichte lese ich immer wieder gerne in der NC und nicht anders war es mit diesem hier - auch wenn es sich um einen ziemlich negativ durchsetzten Artikel aus der Feder von Rolf Nue. handelt. Da Du jetzt ja die HD an Deinem Rechner ohnehin formatiert hast, kannst du ja praktisch nochmal bei null anfangen und solltest Du irgendwelche Hilfe brauchen, kannst Du mich gerne anmailen (kilianservais@gmx.de) oder per NC fragen. Und wo wir gerade dabei sind: Rolf lobt den Wolf Zimmer nebenbei in diesem Artikel und ich kann ihm da wirklich nur zustimmen! Nicht viele User sind derma&#223;en hilfsbereit und t&#252;chtig wie der Wolf Zimmer und wenn es darum ginge, dem hilfsbereitesten Menschen im Club auszuzeichnen, so w&#228;re Wolf Zimmer sicherlich die unangefochtene Nr.1!</P>

<u>Wolf Info:</U><BR>
Die &quot;Wolf Info&quot; ist schon seit einiger Zeit fester Bestandteil einer jeden NC und ich bewundere Wolf`s Talent, immer wieder solch interessante (allgemeine) Themen wie etwa die der aktuellen Ausgabe (&quot;Wohin mit Eurer  HP&quot; und &quot;Geldverdienen mit der HP&quot;) rauszusuchen und ansehnlich darzustellen. Dazu gibt`s Monat f&#252;r Monat Feedback von ihm und es ergibt sich somit eine erneut lesenswerte Mischung aus diversen Bereichen. Ich zumindest m&#246;chte die &quot;Wolf Info&quot; in der NC nicht mehr missen - ein herausragender Artikel!</P>

<u>Zeit:</U><BR>
Dieses kleine Gedicht wurde ebenfalls vom Wolf Zimmer in die NC gebracht und wurde ursprpnglich von Elly Michler geschrieben. Ich bin leider, wohl auch bedingt durch stundenlanges interpretieren von Gedichten in der Schule, nicht so der Gedicht Fan und enthalte mich an dieser Stelle einfach mal eines Kommentars - es sind halt nicht so die Artikel, die ich mag. Obwohl man mit Sicherheit sagen kann, da&#223; dieses kleine Gedicht perfekt zu der k&#252;rzlichen Diskussion &#252;ber Zeit passt und dieses Thema nochmal aufgreift. Sinnlos ist &quot;Zeit&quot; also nicht....</P>

<u>Alles zum Thema Amiga Messe:</U><BR>
Info`s zur Amiga Messe sind immer zu begr&#252;&#223;en, auch wenn ich den Inhalt der diversen Artikel bereits aus dem Internet bzw. der Amiga Plus kannte. Aber es wird wohl User geben, f&#252;r die hier etwas neues zu finden war und da es dieses Jahr wohl leider die einzigste Messe auf deutschem Boden bleiben wird, hoffe ich, da&#223; jeder Amiga User informiert worden ist und das m&#246;glichst viele APC &amp; TCP Clubber dort auch vorbei kommen. Ich werde auf jeden Fall am Samstag da sein und w&#252;rde mich freuen, wenn man sich dort irgendwo treffen kann. Zu erkennen bin ich daran, da&#223; ich ein Metal T-Shirt (Longsleeve) tragen werde :-))))</P>

<u>Aminet:</U><BR>
Mit diesem Artikel verdeutlicht Wolf Zimmer eindrucksvoll das quantitative (!!) Dilemma, in dem die Aminet CD`s momentan stecken. Zwar ging es die letzte Ausgabe wieder etwas bergauf, aber der rapide Absturz der Datenmenge macht mich schon etwas nerv&#246;s. Auf jeden Fall spricht es mal wieder f&#252;r Wolf, da&#223; er sich die M&#252;he gemacht hat und s&#228;mtliche Daten in einer &#252;bersichtlichen Tabelle zusammengefasst hat. Da er bewusst auf eine entsprechende Bewertung verzichtet hat, kann sich jeder selbst so seine Gedanken machen. Ein zweifellos guter Artikel, der leider mal wieder negativ endet...</P>

<u>Treffen 2000:</U><BR>
Der obligatorische Artikel &#252;ber das APC &amp; TCP Treffen am 22. &amp; 23.7 2000 in Vellmar. Die Info`s m&#252;ssten sich mitlerweile ja auch rumgesprochen haben und auch hier w&#252;rde ich mich sehr freuen, wenn viele User vorbeischauen w&#252;rden. Es lohnt sich bestimmt und zudem hat man dort auch endlich mal die M&#246;glichkeit, sich pers&#246;nlich kennenzulernen - wer sich also noch nicht angemeldet hat, der sollte nicht mehr lange z&#246;gern...</P>

<h2><b>Tips &amp; Tricks</h2></b></P>
Neben einigen Tips zu diversen &#228;lteren Amiga Spielen aus unbekannter Feder, tut sich Wolf Zimmer hier mal wieder mit einem Tip zum WWW Anzeigetool IBrowse hervor und l&#228;sst auch andere User an seinem Wissen teilhaben. Da ich noch eine &#228;ltere Version von IBrowse benutze, kenne ich dieses Problem gl&#252;cklicherweise nicht und kann dazu auch nicht`s weiter sagen.

<h1><center><font color="yellow">Fazit:</Font></h1></Center></P>
Schlecht war die Ausgabe Nr.74 zwar nicht (es gab unter Garantie schon schw&#228;chere Ausgaben der NC), aber Andreas hat sicherlich recht, wenn er meint, da&#223; sich der eine oder andere ebenfalls noch an der NC beteiligen konnte. An dieser Stelle geht insbesondere ein Lob an Wolf Zimmer, Sascha und Cord, die sich insbesondere in den letzten beiden Ausgaben m&#228;chtig in`s Zeug gelegt haben. Positiv ist auf jeden Fall, da&#223; sich auch mal wieder Leute wie Jon Doe, Rolf Nue. und Andreas Guldner zur&#252;ckgemeldet haben und ich hoffe, da&#223; da in Zukunft auch noch etwas kommt. Jetzt warten wir erstmal die Jubil&#228;umsausgabe 75. ab und dann sehen wir weiter!</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
