<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> Randa ist wieder da </a></li>
<li> <a href="#a2"> IBrowse 2.2 </a></li>
<li> <a href="#a3"> Expo2000 </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>

<p align=center><a name="a1"><font color="800000" size="5">
<b>Randa ist wieder da!!! </font></b></a></p>

<p><table border=0 width=360 align=left><tr><td align=center>
<img src="st_wolfinfo1.gif" width="160" height="226" hspace=6>
<img src="st_wolfinfo2.gif" width="160" height="226" hspace=6>  
</td></tr></table>Nun ist Randa doch wieder da und sogar in neuem Outfit.
Sieht sie jetzt nicht direkt h&uuml;bsch aus? Und zum Lesen der jetzigen
Geschichten braucht man auch keine Lupe mehr. </p>

<p>Jetzt auch von Thomas noch verlangen, die Spacys wieder zu beleben, ist
wirklich zuviel von einem verlangt. Vielleicht haben wir doch au&szlig;er
Oliver einen anderen K&uuml;nstler unter uns, der diese Arbeit dem Thomas
gerne abnehmen m&ouml;chte? </p>

<p>Jetzt noch ein paar ganz deutliche Worte eines Clubbers an alle anderen
Clubber. Es ist ja ein verdammt trauriges Bild gleich in zwei Feedbacks
lesen zu m&uuml;ssen, dass man f&uuml;r diese sehr zeitintensive
Pixelarbeiten kein Interesse bekundet kann, weil man keinen Draht
daf&uuml;r hat. F&uuml;r Thomas muss das ja gewirkt haben, als ob er ein
Eimer voll kaltes Wasser &uuml;ber seinen erhitzten Nacken gesch&uuml;ttet
bekommen hat. Und neben diesen beiden sehr negativen &Auml;u&szlig;erungen,
gab es aber auch rein gar nicht dar&uuml;ber zu lesen. Kein Statement,
keine Erkundigung, kein Vermissen, kein, kein, kein. Nichts, nichts,
nichts. Wie sagte weiland Theo Lingen? Traurig, traurig, traurig. Das
gleiche k&ouml;nnte man nun ebenso &uuml;ber die
&Auml;u&szlig;erungsbereitschaft der Allgemeinheit zum Ausdruck bringen.
</p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>IBrowse 2.2</font></b></a></p>

<p>Auf der Homepage von HiSoft ist seit 05.05. (dieser Termin wurde mir so
per E-Mail genannt) IBrowse 2.2 als Demoversion (½ Stunde) oder als
Upcreate von IBrowse 2.1 auf 2.2 downloadbar. Upcreate klingt gut, aber das
File ist etwas &uuml;ber 1,4 MB gro&szlig; und ist das Komplettprogramm.
Entpackt sind dies stolze 2,75 MB und bevor ich die Installation (eine
Neu-Installation gem. Hinweis der Homepage von HiSoft) begann, habe ich
erst meine Version 2.1 als .BAK umbenannt. Bei der Installation darf man
auch hier den Sprachenkatalog ausw&auml;hlen.
<blockquote>
&quot;Català&quot; &quot;Czech&quot; &quot;Dansk&quot;
&quot;(Deutsch)&quot; &quot;English (built in)&quot; &quot;Español&quot;
&quot;Français&quot; &quot;(Greek)&quot; &quot;Italiano&quot;
&quot;Magyar&quot; &quot;(Nederlands)&quot; &quot;(Norsk)&quot;
&quot;(Polski)&quot; &quot;Português&quot; &quot;Português-brasil&quot;
&quot;Russian&quot; &quot;Slovensko&quot; &quot;Srpski&quot;
&quot;Suomi&quot; &quot;Svenska&quot;
</blockquote>
<img src="st_wolfinfo1.jpg" width=150 heigth=170 align=left hspace=6>aber
f&uuml;r die Sprachen, die hier in Klammer gesetzt sind, ist kein Katalog
mitgeliefert und beim Versuch der Installation wird eine Fehlernachricht
herausgegeben. Die Klammern sind aber bei der Installation nicht sichtbar,
man merkt erst hinterher, dass da nichts war. Wann also ein deutscher
Katalog verf&uuml;gbar sein wird und wie man dar&uuml;ber informiert wird,
ist mir nicht bekannt. Was sich nun im Einzelnen alles ge&auml;ndert hat,
habe ich noch nicht festgestellt. Daf&uuml;r habe ich das Programm noch
nicht lange genug. Zwei Punkte fielen mir sofort positiv auf, die
Farbverf&auml;lschung, wie bei Tipps&Tricks in NC-74 angef&uuml;hrt, ist
verflogen. Auch das Anspringen von Marken auf anderen HTML-Seiten
funktioniert jetzt. Der Seitenspeicher l&auml;sst sich l&ouml;schen und das
Reloading wird anstandslos ausgef&uuml;hrt. Nur das Verschieben von
Framer&auml;ndern geht noch nicht, oder ich habe in meinen Prefs
irgendetwas falsch eingestellt. &Uuml;brigends damit man &uuml;berhaupt mit
dem neuen Programm arbeiten kann, ist es vonn&ouml;ten, den Key von 2.1
nach 2.2 zu kopieren.
<pre>
------------------
iBrowse 2.2 Update
------------------

Maintenance update for iBrowse 2 now available at
http://www.hisoft.co.uk/cgi-bin/gp?pg=amigashop(ibrowse)

Improvements / fixes

+ Added ftp/http resume
- Fixed a bug that caused some jpeg images not to be loaded
+ Added a much more flexible download system.
- Fixed a bug that cause files to be left open in the cache
- Fixed crash problems when using multiple browser tabs
- Fixed the editable gui
+ Removed the clicktabs if only 1 browser is open
+ Cycle gadgets with too many entries are now transformed into a listview
  automatically
+ Added support for editable fabmenus
+ Added support for font styles. Now you can define fontstyles that
  matches the contents of &lt;font face=...&gt; tags
- Fixed a bug that could cause problems when changing font preferences
- Made iBrowse recognize OS3.5 as a valid OS version
+ Added a SECURE indicator for secure pages
- Fixed a Y2K compatibility bug with non Y2K aware servers
- Minor changes to the parser to be handle illegal params better
- Rewrite the timer code to avoid a lockup bug in timer.device
- Fixed Network URL MIME type
- Fixed a bug in the HTML reading code that wasted approx 50% of the
  memory needed to load an HTML page
+ Added support for displaying progressive jpegs progressively

</pre>
Der Vollst&auml;ndigkeithalber habe ich die Mitteilung aus der Mail von
HiSoft hier einmal aufgezeigt und jeder kann nachlesen, was er nun bekommt.
Wie jeder, der ebenfalls IBrowse 2.2 schon hat, hier deutlich sehen kann,
funktioniert die Fontr&uuml;ckumschaltung nach &lt;/pre&gt; jetzt
einwandfrei. </p>

<p>Wer also nun das neue IBrowse beziehen will und von 1.22 auf 2.2 gehen
will, kein Problem. Entweder mit Kreditkarte &uuml;ber Internet oder gem.
der Verfahrensweise &uuml;ber die Fa. GTI, wie ich es in NC-73 /
Tipps&Tricks beschrieben habe. Dieser muss sich aber das Demoprogramm
ziehen und sich neu registrieren lassen. So zu tun, man habe schon 2.1 und
es ist nicht der Fall, hat keinen Sinn, es funktioniert nicht. </p>

<p>Ein gewaltiges Manko ist mir heute aufgefallen: IBrowse 2.2 hat
verlernt, wie geschachtelte &lt;li&gt;-Anweisungen unter Verwendung von
&lt;ul&gt; und &lt;ol&gt; auszuschauen haben. Um jetzt aufzuzeigen, wann
einger&uuml;ckt wird und wann nicht, ist an dieser Stelle unerheblich. Ich
will nur sagen, es ist falsch und ich verstehe nicht, dass soetwas beim
Beta-Testen &uuml;bersehen werden kann. </p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000" size="5">
<b>Expo 2000</font></b></a></p>

<p>Nein, ich war nicht in Hannover und berichte nun &uuml;ber meine
Eindr&uuml;cke. Nein, ich m&ouml;chte keine Reklame &uuml;ber die Expo
machen oder ein sonstiges Statement abgeben. Nein, ich bekomme keine
Sponsoringbeitr&auml;ge oder sonstige Zuwendungen. Aber ich habe die
Homepage gesehen &quot;www.expo2000.de&quot; und sie hat mir gefallen. Da
die Seiten mittels Javascript und CSS aus vielen kleinen Komponenten
aufgebaut wird (sogar schnell aufgebaut wird) habe ich einmal einen
Sreenshot gemacht und zeige davon einen kleinen Ausschnitt der Startseite.
<br>
<img src="st_wolfinfo3.gif" width=210 heigth=260 align=left hspace=6>Die
Homepage wird in zwei Sprachen gef&uuml;hrt (deutsch und englisch). Die
separate Willkommenseite gibt es in zig Sprachen und entsprechenden
Schriften. Wer nun einen einfachen Browser eingesetzt hat, kann sich gerade
einmal das Grundger&uuml;st anschauen. Denn ein besonderes Erlebnis dieser
Website ist die 3-D-Cybertour &uuml;ber das Expogel&auml;nde. So kann man
sich mit der Maus ein virtuelles Bild vom Ausstellungsgel&auml;nde machen.
Es geht aber auch einfacher indem man sich auf der Karte orientiert. Die
einzelnen Namen erscheinen dann in Sprechblasen, je nachdem wo der
Mauszeiger hinzeigt. Endeckt habe ich eine Seite mit Live-Cams, eine Seite
f&uuml;r Kinder mit Spiel und R&auml;tsel, ein Shopingcenter f&uuml;r
Fan-Artikel, ein Veranstaltungskalender mit detaillierten Informationen und
eine Seite zum Bestellen von Eintrittskarten. Es gibt bestimmt noch eine
ganze Reihe mehr, die ich dann leider &uuml;bersehen habe. <br clear=all>
<center>
<img src="st_wolfinfo4.gif" width=430 heigth=430>
</center>

</p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5">
<b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir wie
immer nur einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b> Die Games-Previews und der CD-Test</b> von  Kilian Servais</li>
<li> <b> Comic</b> von  Thomas Weber, ist zwar kein Artikel, geh&ouml;rt aber doch hierher</li>
<li> <b> Druckerberichte</b> von  Cord Hagen</li>
<li> <b> Feedback - Corner</b> von Mark Thomaschewski </li>
<li> <b> Kopfh&ouml;rer und Laufwerkbericht</b> von Uwe Brunen </li>
</ul>

<p>Eigentlich sollte ich die drei Diskussionsbeitr&auml;ge und Rolf&acute;s
langen Sorgenartikel bez&uuml;glich Disksalv auch mit ber&uuml;cksichtigen.
Auch f&uuml;r G&uuml;nters ersten Spieletest sollte hier Platz sein. Aber
bei mir bleibt eine F&uuml;nf eben halt eine F&uuml;nf und ich habe mich
halt mal f&uuml;r eine Erw&auml;hnung von f&uuml;nf Autoren festgelegt. Und
wenn ich manchmal keine richtige Wichtung vornehmen kann, dann wird nach
Gef&uuml;hl und Wellenschlag entschieden. Genau genommen k&ouml;nnte ich
auch einen W&uuml;rfel als Auswahlmethode ins Kalk&uuml;l ziehen. </p>

<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
