<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Photo Folio 2.0 - Endlich Konkurrenz für Picture Manager?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><center><Font color="YEllow"> Photo Folio 2.0</Font></Center></h1></P>

Wer viele Bilder auf seiner Platte hat und &#252;ber selbige immer den &#220;berblick behalten will, der braucht daf&#252;r ein entsprechendes Programm. Und wenn man mal vom bisher einzigsten kommerziellen Vertreter &quot;Picture Manager&quot; aus dem Hause Irsee Soft sowie einigen semiprofessionellen Vertretern aus dem Shareware / Freeware Sektor absieht, war der Amiga in Sachen Bildkatalogisierer bisher nie alzu gut bedient. Mit &quot;Photo Folio 2.0&quot; ist nun bei der Schatztruhe ein neues kommerzielles Programm erschienen, das verspricht, frische Luft in diesen Bereich zu bringen. Ob es ein Tornado oder aber nur ein laues L&#252;ftchen ist, soll dieser Test zeigen!</P>

<h2><center><font color="green">Nur ein Katalogisierer?</Font></h2></Center></P>
In erster Linie ist &quot;Photo Folio&quot; nat&#252;rlich als Bildkatalogisierer geschrieben worden, bietet dar&#252;ber hinaus nat&#252;rlich noch einige weitere, n&#252;tzliche Optionen, die ihn erst kommerziell verwertbar machen. Vorweg also mal die wichtigsten Features von &quot;Photo Folio&quot;, anhand derer man sich schnell einen ersten &#220;berblick &#252;ber das Programm machen kann:</P><ul>

<li> Abz&#252;ge k&#246;nnen benutzerspezifisch eingestellt werden<BR>
<li> Bilder k&#246;nnen direkt aus &quot;Photo Folio 2.0&quot; angezeigt werden<BR>
<li> diverse Einteilungsm&#246;glichkeiten f&#252;r Bilder<BR>
<li> selektive Anzeige m&#246;glich<BR>
<li> automatische Korrektur des Gamma Wertes<BR>
<li> diverse Modi zur Skalierung &amp; Sortiermethode vorhanden<BR>
<li> kompatibel zu &quot;Photo Album&quot; (Shareware)<BR>
<li> Datatype, CyberGFX &amp; OS 3.5 Unterst&#252;tzung<BR>
<li> MUI Oberfl&#228;che</P></UL>

Schon diese Features h&#246;ren sich sehr interessant an, so da&#223; man nach einem Blick in die deutschsprachige Amiga Guide Datei (warum benutzt man eigentlich keine HTML Dokumentationen?) sich an die Installation des Programms wagt...</P>

<h2><center><Font color="blue">Photo Folio in der Praxis</font></Center></h2></P>

Die Installation von &quot;Photo Folio 2.0&quot; gestaltet sich erwartungsgem&#228;&#223; auch nicht weiter schwierig. So muss man im Verlauf der Installation, die nat&#252;rlich mit dem bekannten &quot;Installer&quot; vonstatten geht, nur die eine oder andere Entscheidung treffen (z.B. ob etwaige Tools wie &quot;Open URL&quot; mitkopiert werden sollen, welche Sprachen installiert werden sollen etc.) und alles andere l&#228;uft automatisch ab - eben wie bei jeder anderen halbwegs aktuellen Anwendung f&#252;r unsere Freundinn auch. Wenn man das Programm nach gegl&#252;ckter Installation zum ersten mal startet, ist es nur noch notwendig einige Daten (u.a. auch die Seriennummer, die man beim Kauf der Original CD auf der R&#252;ckseite des CD Covers findet) einzugeben und schon kann es losgehen. Bevor man allerdings mit &quot;Photo Folio 2.0&quot; anf&#228;ngt zu arbeiten, sollte man noch die bevorzugten Einstellungen bei den beiden mitgelieferten Prefs Programmen &quot;Open URL&quot; (hiermit kann man den Pfad 

des Browsers angeben) sowie &quot;ImageIOLibrary&quot; (hier muss u.a. angegeben werden, ob Datatypes
oder interne Routienen benutzt werden sollen, wie der Pfad f&#252;r das tempor&#228;re Verzeichniss lautet etc.). Jetzt kann man endlich anfangen, das Programm zu benutzen, wobei sich die Oberfl&#228;che nach dem ersten Start nat&#252;rlich arg karg gibt.</P><center>
<img src="pf1.jpg"></P>
<img src="pf2.jpg"></P></Center>
Diesen Zustand kann man aber mit einigen Mausklicks &#228;ndern: Um seine Bilder zu katalogisieren, muss man zun&#228;chst einfach nur ein Verzeichniss mit Bildern w&#228;hlen, die dann automatisch eingelesen werden. Thumbnails (also eine verkleinerte Grafik des Original Pics) werden dabei nat&#252;rlich auch gleich erstellt, wobei diese frei konfigurierbar sind.  Wer seine Workbench in einer hohen Aufl&#246;sung mit einer Grafikkarte betreibt hat nat&#252;rlich mehr Platz zur Verf&#252;gung und kann bei der Gr&#246;&#223;e der Thumbnails das Maximum von 200 X 200 Pixeln voll aussch&#246;pfen. Wer demhingegen nur die Standard AGA Modi zur Verf&#252;gung hat, der wird die Gr&#246;&#223;e der Thumbnails zwangsweise kleiner halten, wobei der kleinste Wert 20 X 20 Pixel betr&#228;gt. Hat man alle seine gew&#252;nschten Bilderpfade eingelesen (die &#252;ber s&#228;mtliche Partitionen verstreut sein k&#246;nnen) und &quot;Photo Folio 2.0&quot; die gew&#252;nschten Abz&#252;ge erstellt, sollte man beim 
n&#228;chsten Programmstart auch tunlichst darauf achten, da&#223; das Programm mittels der Pfadangabe auch die Abz&#252;ge und nicht etwa die Bilder erneut einlie&#223;t. Ist letzteres n&#228;mlich der Fall, wird der ganze Vorgang (skalieren etc.) wiederholt und von einer angenehmen Arbeitsgeschwindigkeit kann nicht mehr die Rede sein. An dieser Stelle sei auch drauf verwiesen, da&#223; &quot;Photo Folio 2.0&quot; &#252;ber drei verschiedene Qualit&#228;tsmodi, n&#228;mlich &quot;normal&quot; (=&gt; schnell), &quot;hohe Qualit&#228;t&quot; (=&gt; langsam) und &quot;beste Qualit&#228;t&quot; (=&gt; sehr langsam), verf&#252;gt, wobei sich &quot;hohe Qualit&#228;t&quot; in der Praxis als idealer Mittelweg erwiesen hat. Und wem das alles immer noch zu langsam geht, kann auch die JPG Qualit&#228;t (respektive Kompressionsrate) 
der Abz&#252;ge einstellen, die zwischen 20 und 100 % frei w&#228;hlbar ist. Last but not least ist es auch noch m&#246;glich, mit den Abz&#252;gen eine Gamma Korrektur durchf&#252;hren zu lassen, was sich wiederrum in einer besseren Qualit&#228;t niederschl&#228;gt.</P>
<center><img src="pf4.jpg"></Center></P><br>
Wenn man alles richtig gemacht hat (was dank der intuitiven MUI Oberfl&#228;che eigentlich kein gr&#246;&#223;eres Problem darstellen sollte), kann man sich nun im Ansichtsfenster zum einen die Abz&#252;ge einfach nur angucken und zum anderen nat&#252;rlich noch weiter verarbeiten bzw. sortieren. Und letzteres ist sicherlich die wesentliche Aufgabe eines Bildkatalogisierers: So kann man seine Abz&#252;ge (respektive die einzelnen Bilder) einem von 255 Besitzern, einer von vier Gruppen sowie 22 m&#246;glichen Kategorien zuteilen. Um es mal kurz zu erkl&#228;ren: &quot;Besitzer&quot; erm&#246;glicht es ihnen, sich die eigenen Kataloge sowie etwaige Kataloge von Freunden &amp; Bekannten anzugucken, ohne das dabei die individuellen Eigenschaften ge&#228;ndert werden m&#252;ssten. Die &quot;Gruppen&quot; stellen im Grunde 
eine &#220;berschrift (z.B. Clip Art) f&#252;r die Abz&#252;ge dar und &quot;Kategorie&quot; verfeinert das ganze schlie&#223;lich noch (z.B. farbige Clip Art`s, s/w Clip Art etc.). Mit diesem System ist es ohne weiteres m&#246;glich, ein komplexes und dennoch einfach nachvollziehbares System in seine Bildersammlung zu bringen und immer den &#220;berblick &#252;ber alles zu haben - mit einem Mausclick hat man sofort gefunden, was man gesucht hat und in der Praxis kann &quot;Photo Folio&quot; wirklich dazu beitragen, ein gew&#252;nschtes Bild schnell zu finden oder sich global ein Verzeichniss anzugucken. Nat&#252;rlich kann man auch die diversen erstellten Kataloge noch weiter sortieren, sei es nun nach Gr&#246;&#223;e oder Typ (z.B. IFF, JPG, BMP etc.) - mit &quot;Photo Folio 2.0&quot; ist dies auch ohne weiteres m&#246;glich.
Die Zahl der zur Verf&#252;gung stehenden Ansichtsfenster ist &#252;brigens nicht vom Programn limitiert; man kann, sofern es der Speicher zul&#228;sst, soviele davon &#246;ffnen wie man m&#246;chte. Nat&#252;rlich ist dies wieder nur sinnvoll, wenn man eine hohe Aufl&#246;sung zur Verf&#252;gung hat, was mit den AGA Chip`s nicht m&#246;glich ist. Der Vollst&#228;ndigkeit halber sei noch erw&#228;hnt, da&#223; man Abz&#252;ge auch kopieren, verschieben und l&#246;schen kann - auch wenn im letzteren Fall das Bild immer mitgel&#246;scht wird. </P>

Hat man irgendwann mal alle seine Bilder nach seinen W&#252;nschen katalogisiert und ist damit auch zufrieden, kann man von nun an auch &quot;Photo Folio 2.0&quot; benutzen, um sich diese in voller Gr&#246;&#223;e anzeigen zu lassen. Wie &#252;blich, ist man auch hier vom Programm in keinster Weise limitiert: Man kann entweder auf den zugegebenerma&#223;en langsamen internen Bildanzeiger zur&#252;ckgreifen, das mitgelieferte &quot;Mystic View&quot; benutzen oder seinen eigenen Bildanzeiger benutzen. Letzteres klappt in der Praxis ganz hervorragend und wer mit &quot;Mystic View&quot; weniger anfangen kann (ist schlie&#223;lich `ne Geschmacksfrage), der sollte sich nicht scheuen, seinen eigenen Bildanzeiger einzustellen. </P><center><img src="pf3.jpg"></P><br><img src="pf5.jpg"></P><br></Center>

<h2><center><font color="RED">Noch zu erw&#228;hnende Kleinigkeiten</Font></Center></h2></P>
&quot;Photo Folio 2.0&quot; unterst&#252;tzt auch die  Digitizerkarte &quot;VLab&quot;, was ich aufgrund von einem Mangel an selbiger leider nicht testen konnte. Ferner sollte an dieser Stelle noch lobenswert erw&#228;hnt werden, da&#223; &quot;Photo Folio 2.0&quot; auch in deutscher Sprache (sowie diversen weiteren) vorliegt und die Anleitung auch ausf&#252;hrlich (in Deutsch) auf alle Funktionen eingeht. Der Form halber sie noch angemerkt, da&#223; sich das Prohgramm nicht nur von der WB aus starten l&#228;&#223;t, sondern auch per CLI bedienen l&#228;&#223;t. Negatives gibt es eigentlich kaum zu berichten - das Tool arbeitet &#228;u&#223;erst stabil und vertrug sich auch mit allen installierten Systempatches (MCP &amp; Co.). Laut Anleitung kommt es manchmal zu einem Enforcer Hit, wenn man den &quot;Tempor&#228;ren Pfad&quot; auf den &quot;Bilderpfad&quot; zieht. Das Problem ist mir auch aufgefallen, beeintr&#228;chtigt den Nutzen des Programms aber nicht alzu sehr. Und da der Fehler untersucht wird, kann 

man bei der n&#228;chsten Update Runde damit rechnen, diesem Bug nicht mehr zu begegnen. Das einzigst gro&#223;e Problem von &quot;Photo Folio 2.0&quot; ist nur die Tatsache, da&#223; es keine direkte Unterst&#252;tzung f&#252;r &quot;Picture Manager&quot; Kataloge gibt und das man diese somit praktisch in den virtuellen Papierkorb werfen kann, wenn man sich f&#252;r &quot;Photo Folio 2.0&quot; als neuen Katalogisierer entscheidet. Da ist es nur ein schwacher Trost, da&#223; &quot;Photo Album&quot; Dateien direkt unterst&#252;tzt werden...</P>

<h2><center><font color="GRAY">Benötigte Hardware</Font> </h2></center>
Minimal wird ein Amiga mit 68020, Kickstart 3.0, CD Laufwerk, etwas Fast Ram sowie MUI in Version 3.8 (auf der CD vorhanden) vorrausgesetzt. Ob man man dieser &quot;Konfiguration&quot; viel Spa&#223; an &quot;Photo Folio 2.0&quot; haben wird, waage ich einfach mal zu bezweifeln. Viel Speicher ist immer empfehlenswert und ein 68030 sollte auch im Amiga werkeln. Eine Grafikkarte ist ebenso mehr als dringenst anzuraten, da es unter AGA einfach keinen Spa&#223; macht zu arbeiten. Neben der h&#246;heren Farbtiefe macht sich vor allem die h&#246;here Aufl&#246;sung in der Praxis angenehm bemerkbar - ich w&#252;rde sagen alles ab 800 X 600 ist f&#252;r &quot;Photo Folio 2.0&quot; ideal. CyberGFX wird &#252;brigens als Treibersystem sofort erkannt und sorgt f&#252;r optimale Geschwindigkeit - &quot;wohl denen, die eine GraKa haben&quot; w&#252;rde ich da sagen :-)) Wer heute immer noch keine hat, sollte sofort eine bestellen!</P>

<h1><center><font color="White">Fazit:</FONT></Center></h1></P>
Das es &quot;Photo Folio&quot; schon in Version 2.0 mit dem Quasi-Monopolisten &quot;Picture Manager&quot; aufnehmen kann, hat mich zugegebenerma&#223;en etwas gewundert. Einige Kleinigkeiten sind zwar noch zu &#228;ndern bzw. zu verbessern, aber im gro&#223;en und ganzen macht &quot;Phot Folio 2.0&quot; auf mich einen sehr guten Eindruck und sorgt f&#252;r angenehm frischen Wind in diesem Genre. Bedenkenlos empfohlen werden kann &quot;Photo Folio 2.0&quot; allemal, zumal f&#252;r die Zukunft weitere Updates geplant ist und eine langfristige Entwicklung des Programms wohl garantiert ist. Wer noch keinen Katalogisierer hat, kann hier blind zugreifen!</P><center><BR>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>69 DM, Update (Crossupdate) 49 DM</TD>
</TR>
<TR>
<TD>Art</TD>
<TD>Bildkatalogisierer</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>12</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE>

 



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
