<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Show Amiga 96 - Hübschere Bootbilder?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><center><Font color="GREEN">Show Amiga 96 - Der ultimative Bootbildanzeiger?</Font></Center></h1></P>

Ein Feature, &#252;ber das Windows Kisten zwar verf&#252;gen, aber das selbst mit
AmigaOS 3.5 noch nicht Einzug auf unserer Freundinn gehalten hat, ist das
Anzeigen von Bootbildern. Das ganze ist aber auch nicht so tragisch, da es
erstens ohnehin nicht jedermanns Sache ist, ein Bootbild beim Starten zu
sehen und zweitens gibt`s im Aminet ja gen&#252;gend Programme, die diese Aufgabe
&#252;bernehmen k&#246;nnen. Eines dieser vielen Programme ist <b>Show Amiga 96</B> und
l&#228;uft, das soll gleich erw&#228;hnt werden, da sonst sp&#228;ter Entt&#228;uschung
aufkommt, nur auf Picasso96 Systemen - eine GraKa ist also Vorraussetzung
f&#252;r die Nutzung von Show Amiga 96!</P>

<h2><center><Font color="yellow">Was macht Show Amiga 96 so besonders?</Font></center></h2>
Neben der Tatsache, da&#223; es nur mit der Picasso Software zum laufen zu
bewegen ist (was f&#252;r unsere lieben UAE User sicherlich auch interessant
ist), gibt es noch weitere Features, die dieses Programm aus der Masse
&#228;hnlich gearteter Tools abheben:</P><ul>

<li> schnell &amp; resourcenschonend<BR>
<li> modular aufgebaut<BR>
<li> optional Effekte einstellbar<BR>
<li> GUI f&#252;r die Prefs<BR>
<li> einfache Installation &amp; Bedienung<BR>
<li> transparente Einbindung in`s OS<BR>
<li> Mailware</P></UL>

Schon diese Auflistung zeigt sehr deutlich, da&#223; &quot;Show Amiga 96&quot; ein nahezu
perfektes Programm ist, dem eigentlich nicht mehr viel fehlt. Bisher war es
bei vielen Tools ja leider der Fall, da&#223; entweder die Installation oder die
Bedienung alles andere als einfach war und wenn man diese H&#252;rden gemeistert
hat, fehlte irgendetwas anderes in dem entsprechenden Tool, so da&#223; man fast
verzweifeln konnte. Ich verspreche Euch, da&#223; dies bei &quot;Show Amiga 96&quot; nicht
der Fall ist...</P><center><img src="sa.jpg"></center></P>

<h2><center><font color="RED">Immer wieder wichtig: Die Praxis</Font></Center></h2></P>
Die Installation gestaltet sich sehr einfach und geht mit dem Installer
recht schnell und vor allem problemlos von dannen und gibt schonmal keinen
Anlass zu irgendeiner Kritik. Im Verlauf der Installation wird neben dem
eigentlichen Programm auch gleich &quot;HappyENV&quot; installiert, mit dem s&#228;mtliche
ENV: Variablen nicht mehr bei jedem Systemstart in`s Ram kopiert werden
m&#252;ssen, was neben dem geringen Speichergewinn (bei mir ca. 700 KB) vor allem
einen deutlich beschleunigten Bootvorgang mit sich bringt. Und keine Angst:
Danach l&#228;uft immer noch alles perfekt!</P>

Ist die Installation erfolgreich verlaufen, kann man seinen Rechner gleich
neustarten und schonmal das Standardbootbild (nicht ganz so mein Fall) von &quot;Show Amiga 96&quot; bewundern und
wer damit zufrieden ist, braucht sich auch gar nicht weiter mit dem Prefs
Programm rumschlagen. Aber da Amiga User ja bekanntlich alles individuell
konfigurieren, ist davon nicht auszugehen und das &#252;bersichtliche, auf MUI
basierende Prefs Programm bietet viele Optionen, die jeden Bootvorgang
einzigartig machen.</P>

Als erstes muss man sich nat&#252;rlich f&#252;r ein Bild entscheiden, welches man im
Prefs Programm aussuchen muss. Aber schon hier zeigt der Programmierer deutlich,
da&#223; er wirklich an jede Kleinigkeit gedacht hat: Die Bilder werden nicht
einfach nur ausgesucht, sondern gleichzeitig vom Prefs Programm als Rohdaten
gespeichert, so da&#223; sie nicht bei jedem Systemstart neu aufbereitet werden
m&#252;ssen und direkt in den Grafikkartenspeicher geladen werden k&#246;nnen. Es ist
also nicht weiter erstaunlich, da&#223; die Bilder erstaunlich schnell angezeigt
werden k&#246;nnen und selbst gr&#246;&#223;ere Projekte wie etwa ein 800 X 600 gro&#223;es 24
bit Bild brauchen zum laden weniger als eine Sekunde. Durch diesen
Trick, eben das die Grafik direkt in den Grafikkartenspeicher geladen wird,
ist Show Amiga 96 auch &#228;u&#223;erst resourcenschonend (laut Anleitung verbraucht
das Tool nur 30 KB Amiga Speicher) und eine unn&#246;tige Fragmentierung des
Speichers kann ebenfalls vermieden werden.</P>

Hat man also sein Bootpic, oder wahlweise auch mehrere, die dann entweder per Zufall
oder in einer festen Reihenfolge gezeigt werden,
ausgesucht und entsprechend aufbereiten lassen, kann man sich den weiteren
Einstellungsm&#246;glichkeiten zuwenden. Die sog. &quot;Allgemeinen Einstellungen&quot;
kann man erstmal getro&#223;t links liegen lassen (hier werden nur einige Info`s
angezeigt und bei Bedarf kann man hier dem Bootvorgang den letzten Schliff
geben) und sich stattdessen den Einblend-, Action- und &#220;berblendmodulen widmen. Wie
die Namen schon vermuten lassen, hat man hiermit die M&#246;glichkeit, die anzuzeigenden Bilder auf verschiedene Weise auf den Bildschirm zu zaubern bzw. wieder verschwinden zu lassen und dabei noch den einen oder anderen Effekt auftreten zu lassen. In der aktuellen Release 2.3a stehen zwar noch nicht alzu viele Effekte zu Verf&#252;gung, aber die vorhandenen demonstrieren eindrucksvoll, was da noch alles in Zukunft m&#246;glich ist. So kann man das Bootpic z.B Pixel f&#252;r Pixel laden lassen (sieht echt cool aus!) und wenn der Bootvorgang beendet ist, besteht u.a. die M&#246;glichkeit, das Bild nach &quot;unten wegflie&#223;en&quot; zu lassen, wobei dahinter nat&#252;rlich die WB erscheint. Auch die &quot;Actionmodule&quot; haben es wahrlich in sich: Neben der M&#246;glichkeit eine Progressbar darzustellen (&#228;hnlich dem Macintosh System) und am unteren Rand einen animierten Farbverlauf  anzeigen zu lassen (Windows l&#228;sst gr&#252;&#223;en), kann vor allem 
die Tatsache, da&#223; man auch Animationen in &quot;Show Amiga 96&quot; einbinden kann, begeistern, wobei man auch hier, &#228;hnlich wie bei 
den &quot;Animated Icons&quot; von OS 3.5, auf die zahlreichen Transfer Animationen, die u.a. auf den Aminet CD`s zu finden sind, zur&#252;ckgreifen kann. Nat&#252;rlich muss man mit den diversen Modulen etwas herumprobieren, aber da das mit der intuitiven GUI kein Problem ist, sorgt dieser Vorgang sogar noch f&#252;r viel Spa&#223;. Und da neue Module gl&#252;cklicherweise nicht unbedingt vom Programmierer selbst kommen m&#252;ssen und diesen Job auch dritte &#252;bernehmen k&#246;nnen, werden wohl bald noch einige Module mehr f&#252;r &quot;Show Amiga 96&quot; verf&#252;gbar sein - aber auch mit den schon jetzt vorhandenen kann man, wie oben beschrieben, sehr ansehnliche Resultate erzielen.</P>

Aber als ob das noch immer nicht genug w&#228;re, kann man zu den diversen Ereignissen (z.B. Einblenden beendet, Action Module geladen etc.) noch eigene CLI Befehle spezifizieren. Wer also gerne ein Soundsample beim Booten abgespielt h&#228;tte, der braucht einfach nur den entsprechenden CLI Befehl dort eintippen und schon ert&#246;nt beim n&#228;chsten Start der entsprechende Sound aus den Boxen. F&#252;r diesen Vorgang kann ich an dieser Stelle das Tool &quot;Play16&quot; aus dem Aminet empfehlen, das diese Aufgabe mit Bravour meistert. Und wem das jetzt immer noch nicht genug ist, der wird sich an der Funktion &quot;Anmeldung&quot; erfreuen k&#246;nnen: Wer das Multi User File System auf seinem Amiga installiert hat, kann den entsprechenden Requester zur Anmeldung (also Eingabe des Usernamens und Passwortes) einfach auf den Bootbildschirm umleiten lassen und alles funktioniert so wie vorher. Prinzipiell kann man diese Funktion zwar auch auf jedem anderem Amiga anwenden, wobei man da allerdings auf die 
eine oder andere Funktion verzichten muss. </P><center><img src="sa2.jpg"></center></P>

<h2><center><font color="Blue">Hardwareanforderrungen &amp; sonstige Kleinigkeiten</font></center></h2></P>
Was die Anforderrungen an die Hardware angeht, so ist &quot;Show Amiga 96&quot; nicht sehr anspruchsvoll: Ein Amiga mit Picasso96 kompatibeler GraKa sowie AmigaOS 3.0 ist alles, was das Tool ben&#246;tigt. Etwas Fast Ram ist auch zu empfehlen, da die MUI Oberfl&#228;che auch etwas Speicher ben&#246;tigt, aber wer ohnehin eine GraKA installiert hat, wird wohl auch &#252;ber eine gesunde Menge an Fast Ram verf&#252;gen. Weitaus wichtiger ist die Stabilit&#228;t: Auch hier muss man &quot;Show Amiga 96&quot; hervorragende Noten erteilen, denn bis jetzt hatte ich beim Bootvorgang noch nie irgendwelche Probleme, die sich auf &quot;Show Amiga 96&quot; zur&#252;ckf&#252;hren lie&#223;en und ausserdem vertr&#228;gt sich &quot;Show Amiga 96&quot; auch mit allen anderen installierten Patches sehr gut - und sollte trotzdem mal was schief gehen, braucht man nur die linke Maustaste zu dr&#252;cken und schon &#246;ffnet sich eine Shell, in der man dann ganz normal arbeiten und ggbf. den Bootvorgang fortsetzen kann. Leichte Probleme kann es nur mit den Tools &quot;SYSIHack&quot; sowie dem &quot;Toolmanager&quot; geben, f&#252;r die die ausf&#252;rhliche deutsche AmigaGuide Datei aber sofortige Hilfe parat h&#228;lt.</P>

<h1><center><font color="White">Fazit</Font></center></h1></P>
ShowAmiga ist sicherlich erste Wahl, wenn man einen einfach zu installierenden &amp; konfigurierenden, aber dennoch m&#228;chtigen Boodbildanzeiger sucht. Was die Effekt angeht: Es mag sein, da&#223; &quot;Rainboot&quot; hier noch die Nase vorn hat, aber ich denke, hier wird &quot;Show Amiga 96&quot; in Zukunft noch kr&#228;ftig aufholen. Da das Programm zudem noch Mailware ist (eine E-Mail gen&#252;gt also!!), ist es zudem recht kosteng&#252;nstig und f&#252;r Picasso96 kompatibele Grafikkartenbesitzer allemal zu empfehlen. F&#252;r mich ist eines sicher: Das Tool verrichtet seine Aufgabe ganz hervorragend und ist f&#252;r mich erste Wahl in diesem Bereich. Top!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
