<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Monitor PV 995</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Monitor PV 995</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
      

<h3>Einf&uuml;hrung</h3>

<P>Der PV 995 von <B>Proview</B> ist ein 19-Zoller. Die Preise f&uuml;r Ger&auml;te dieser
Gr&ouml;&szlig;enordnung waren noch bis vor Kurzem generell weit jenseits der
1000-DM-Schallgrenze. Doch auch hier hat nun ein Preisrutsch eingesetzt
und 17-Zoll-Monitore werden nun zum Standard.</P>

<P>Der Proview-Monitor war eines der ersten 19-Zoll-Ger&auml;te, die im gro&szlig;en
Umfang zum Kampfpreis von 750,- DM (jetzt teilweise um die 700,- DM)
angeboten wurde. Proview ist &uuml;brigens, wie man vielleicht im ersten Moment
vermutet, keine NoName-Marke, die nur von irgendeinem Hersteller im
Hintergrund verwendet wird, sondern ein relativ gro&szlig;er taiwanesich/
chinesischer Hersteller, welcher im Moment zur Top 20 der Welt-
Monitorhersteller z&auml;hlt und der sich noch einiges vorgenommen hat.</P>

<P>Trotzdem werden Proview-Monitore gelegentlich auch unter anderem Logo
verkauft, z.B. habe ich den PV 995 auch schon als &quot;IPC&quot;-Monitor gesehen.
Das relativ markante Design, das ich gleich n&auml;her beschreibe, und das PV
auf der Typenbezeichnung am R&uuml;ckwand-Schildchen dieser Ger&auml;te, verraten
aber die Herkunft.</P>

<h3>Design</h3>

<P>Der Monitor ist recht formsch&ouml;n: vorne leicht abgerundete Kanten, der
eigentlich Monitor-`K&ouml;rper` hinten, mit elegant geschwungenen Linien. An
der Vorderseite, links unten, das Proview-Logo, rechts unten die
Bedienkn&ouml;pfe, die zusammen einen Kreis ergeben und daneben, rechts, ein
kleines L&auml;mpchen f&uuml;r den Betriebszustand (Orange - Standby/ Gr&uuml;n - Ein)
und der Ein/Aus-Knopf. Nat&uuml;rlich ist der PV 995 mit einem verstellbaren
Standfu&szlig; ausger&uuml;stet.</P>

<P>Vorne unten an den Seiten, befinden sich kleine Steckbuchsen. Sie sind f&uuml;r
ein Proview-Lautsprecherpaar gedacht, das aber &uuml;ber meine Bezugsquelle
(PC-Spezialist) nicht erh&auml;ltlich war. Die Stromversorgung f&uuml;r dieses ist
im Ger&auml;t schon beinhaltet.</P>

<h3>Mikrophon</h3>

<P>An der Vorderseite sind oben in der Mitte ein paar Lamellen und darunter
ein L&ouml;chlein zu erkennen. Dabei handelt es sich um ein integriertes
Mikrofon, dessen Verbindungsbuchse sich hinten am Ger&auml;t befindet. Ein
Klinkenkabel wird mitgeliefert. Da ich leider keinen Amiga-Soundsampler
besitze, habe ich den Mikrophon-Test mit Hilfe eines PCs und seiner 30-
DM-Soundkarte vollzogen, die die notwenige Elektronik standardm&auml;&szlig;ig
enth&auml;lt. Es funktionierte sehr gut.</P>

<P>Der vordere Aus-Knopf bringt das Ger&auml;t nur in einen Standby-Modus, der
immer noch recht viel Strom verbraucht. Gl&uuml;cklicherweise gibt es hinten,
rechts unten, einen relativ gut erreichbaren `echten` Aus-Knopf.</P>

<h3>Verbindung</h3>

<P>Verbunden wird der Monitor mittels eines am Ger&auml;ter&uuml;cken fest installierten
abgeschirmten VGA-Kabels. Dies ist nat&uuml;rlich der erste Kritikpunkt, da ein
Bruch im Kabel gleich einen Werkstattaufenthalt n&ouml;tig macht. Die Garantie
betr&auml;gt &uuml;brigens drei Jahre.</P>

<P>Der zweite Kritikpunkt ist, da&szlig; leider keine weiteren Eing&auml;nge zur
Verf&uuml;gung stehen. Dies ist von Nachteil, wenn man mehrere Rechner an dem
Monitor betreiben will. Die Verwendung einer VGA-Umschaltbox bringt bei
Verwendung von hohen Aufl&ouml;sungen leider einen st&ouml;renden Schatteneffekt
mit sich.</P>

<h3>Dokumentation</h3>

<P>Das mitgelieferte Handb&uuml;chlein ist nat&uuml;rlich nur in Englisch verfa&szlig;t,
aber einfach zu verstehen. Es erweist sich als im Verh&auml;ltnis recht
gut und informiert detailliert &uuml;ber die technischen Daten und die
Kabelbelegung.</P>

<h3>F&auml;higkeiten und Eigenschaften</h3>

<P>Der PV 995 ist ein Multiscan-Monitor, der alle horizontalen Frequenzen
zwischen 30 und 95 KHz und vertikale Frequenzen von 50 bis 150 Hz
automatisch darstellen kann. </P>

<P>Da viele klassische Amiga-Frequenzen des OCS und ECS 15-KHz-Modi sind,
ist ihre Darstellung ohne Hilfmittel, wie Scandoubler, nicht m&ouml;glich.
Bei Verwendung eines solchen Scandoublers, sowie einer Cybervision 64-
Grafikkarte, gab es bei mir keinerlei grunds&auml;tzliche Probleme am Amiga. </P>

<P>15 Standard-VGA und VESA-Modi sind bereits eingebaut, was f&uuml;r die, die
Grafikkarten und/oder PCs an ihm betreiben hilfreich ist, da meistens
kaum Ver&auml;nderungen n&ouml;tig sind. Er entspricht auch der EPA Energy Star-
Richlinie, kann also in die unterschiedlichen Stromsparmodi verfallen
und h&auml;lt die TCO 95-Verordnung (abgegebene Strahlung) ein. Die DDC-
Monitorerkennung von Windows 95 ist nat&uuml;rlich auch kein Problem, OSD
(OnScreenDisplay) heutzutage obligatorisch.</P>

<P>Die maximale Bandbreite, also der Leistungswert, betr&auml;gt 150 MHz, das
ist ein sehr guter Wert f&uuml;r diese Klasse. In der Praxis ist die
Leistungsgrenze in etwa bei einer Aufl&ouml;sung von 1.600 mal 1.200 Pixeln
und 75 Hz Wiederholfrequenz erreicht. Sehr wichtig auch: die Lochmaske
betr&auml;gt 0.26. Dies ist auch ein guter Wert - Voraussetzung daf&uuml;r, da&szlig;
in hohen Aufl&ouml;sungen auch wirklich alles klar erkennbar ist. </P>

<P>Er wiegt etwa 16,5 kg und verbraucht im vollen Betrieb etwa 150 Watt
(lt. Handbuch), was dann allerdings ziemlich viel ist.</P>

<P>Nun aber zu dem Entscheidenden: zu Bedienung und Funktion. </P>

<h3>Viel Bild</h3>

<P>Das Bild ist wunderbarerweise schon einmal wirklich gro&szlig;. Auch bei hohen
Aufl&ouml;sungen, die bei 15- und selbst bei 17-Zoll-Monitoren gewisse
Schwierigkeiten in der Erkennbarkeit verursachen, ist alles sehr gut zu
erkennen. Voraussetzung f&uuml;r diese hohen Aufl&ouml;sungen ist nat&uuml;rlich erst
einmal eine entsprechend leistungsf&auml;hige Grafikkarte.</P>

<P>Die 1.600 x 1.200-Aufl&ouml;sung beispielsweise, kann, bei der f&uuml;r die Augen
mindestens notwendigen Wiederholfrequenz, durch den S3-Virge-Chip gerademal
mit 256 Farben dargestellt werden. Auf diesem Chip basieren viele PC-
Grafikkarten, aber auch die Cyvervision 64/3D (die Vorg&auml;ngerkarte CV64
enthielt den &auml;lteren Trio64-Chip). Jetzt ist pl&ouml;tzlich nicht mehr der
Monitor, sondern die Grafikkarte das Problem, durch das man unvermutet
an Leistungsgrenzen st&ouml;&szlig;t.</P>

<P>Ansonsten sind keine Bildfehler zu entdecken, die Farben sind gut,
Helligkeit und Kontrast auch. Nachteilig ist, da&szlig; man teilweise
Schwierigkeiten hat, im Hintergrund ein sattes Schwarz zu erreichen,
ohne die anderen Grundeinstellungen in unsinnige Bereiche zu bringen.</P>

<h3>Katze im Sack?</h3>

<P>Gerade im Zusammenhang mit dem Bild ist folgendes beim Kauf WICHTIG:</P>

<P>Kaufen Sie nicht die Katze im Sack! Sehen Sie sich generell beim
Monitorkauf im Laden nicht nur ein Modell desselben Typs an, sondern
vor allen Dingen das Exemplar, das sie kaufen wollen! Selbst innerhalb
der gleichen Fertigungsreihe, auch bei teuersten Markenprodukten, kann
die Qualit&auml;t der Bildr&ouml;hre schwanken. Sie haben das Recht auf eine
Vorf&uuml;hrung und lassen Sie sich auch nicht durch unwillige Verk&auml;ufer
einer Kette (&quot;Das ist doch ein Sonderangebot!&quot;) beirren oder davon
abhalten!</P>

<h3>Der Monitor meldet...</h3>

<P>Wenn kein Signal den Monitor &uuml;ber das VGA-Kabel erreicht, meldet er dies
mit einer gro&szlig;en Box, die im Bild eingeblendet wird. &quot;Selftest - monitor
is working&quot;, sowie &quot;Check your PC and signal cable&quot; erscheint als Text
und mit rotem, gr&uuml;nem und blauem Hintergrund.</P>

<P>Ist das Signal au&szlig;erhalb seines Scanbereichs, macht der PV 995
gl&uuml;cklicherweise keinen schnellen Abgang, sondern zeigt in einer anderen
markanten Box: &quot;Freq. out of range - the monitor will shut down in few
seconds&quot; und ein paar Sekunden sp&auml;ter schaltet er sich auch tats&auml;chlich
in den Standby-Modus, die gr&uuml;ne Statusleuchte schaltet auf Orange.</P>

<P>Ein &auml;hnliche Box erscheint auch, wenn der Monitor von entsprechender
Software in einen Stromsparmodus geschaltet wird: &quot;Power-saving enable
- The monitor will shut down in few seconds&quot;.</P>

<h3>Die Bedienung per OSD</h3>

<P>Das OnScreenDisplay wird &uuml;ber vier Tasten bedient, die kreisf&ouml;rmig
angeordnet sind und in der Mitte ein rundes St&uuml;ckchen freilassen,
da&szlig; aber kein zus&auml;tzlicher Knopf ist.</P>

<P>Oben ist die &quot;MENU&quot;-Taste, unten die &quot;EXIT&quot;-Taste, links &quot;-&quot; (Minus) und
rechts &quot;+&quot; (Plus). Nach einem Druck auf MENU erscheint das Men&uuml; dann auch
gleich. Zuerst sollte man die Funktion &quot;Language&quot; auf Deutsch einstellen!</P>

<P>Mit Plus und Minus kann man im Men&uuml; auf und ab wandern, MENU entspricht
nun Return. In Untermen&uuml;s gibt es zwar einen Punkt EXIT, ein Anw&auml;hlen w&auml;re
aber aufwendiger, als einmal kurz die EXIT-Taste und flott danach die MENU-
Taste zu Bet&auml;tigen, da man so das Hauptmen&uuml; schneller erreicht.</P>

<P>In der abschlie&szlig;enden Zeile im Hauptmen&uuml; stehen die derzeitigen
(horizontalen und vertikalen) Frequenzen. Man braucht f&uuml;r diese Angabe
also nicht, wie in manchen anderen OSD-Men&uuml;s, extra ein Untermen&uuml; &ouml;ffnen.</P>

<P>Die Men&uuml;s sind durch die Farbwahl sehr gut zu erkennen, Text erscheint
in einem recht hochaufgel&ouml;sten, nicht primitiv wirkenden Zeichensatz. In
Submen&uuml;s zeigen Symbole vor dem Text auch optisch die Funktion an, z.B.
eine Sonne die Helligkeit.</P>

<P>Ich nenne jetzt die <B>Men&uuml;eintr&auml;ge</B>, wenn bereits auf Deutsch umgeschaltet
wurde: </P>

<P>&quot;LUMINESZENZ&quot; - im Untermen&uuml; befinden sich KONTRAST und HELLIGKEIT.</P>

<P>&quot;GR&Ouml;&szlig;E-POSITION&quot; - POSITION und GR&Ouml;&szlig;E, jeweils f&uuml;r die Horizontale und
                   Vertikale.</P>

<P>&quot;GEOMETRIE&quot; - KISSENVERZERRUNG, TRAPEZOID, PARRALLELE, ABBALANCE (? - auf
              Englisch UNBALANCE - damit kann man Kurven an den Seiten
              ver&auml;ndern) und ROTATION.</P>

<P>&quot;FARBE&quot; - 9300 FARBE, 6550 FARBE (bei beidem handelt es sich um
          voreingestellte Farbtemperaturen, also Farbwerte), sowie
          ROT, GR&Uuml;N und BLAU, womit die Farbeinstellungen auch
          individuell regelbar sind.</P>

<P>&quot;OSD-LOKALIT&Auml;T&quot; - LOKALIT&Auml;T (Position des OSD-Men&uuml;s) horizontal und
                  vertikal, sowie OSD-ZEIT</P>

<P>&quot;UMSETZEN&quot; - Vorsicht vor dieser &Uuml;bersetzung, bei der ansonsten
             erstaunlicherweise sogar Umlaute korrekt darstellt werden.
             In diesem Fall bedeutet es aber &quot;Zur&uuml;cksetzen&quot;. Die
             Werkseinstellungen dieses Modus ersetzen dann wieder
             pers&ouml;nliche Ver&auml;nderungen.</P>

<P>&quot;DEGAUSS&quot; - Entmagentisieren des Monitors.</P>

<P>&quot;SPRACHE&quot; - Englisch, Deutsch, Spanisch, Franz&ouml;sisch und Chinesisch (!)
            sind m&ouml;glich.</P>

<P>&quot;AUSGANG&quot; - wie gesagt: die EXIT-Taste ist schneller.</P>

<P>Bei Untermen&uuml;s wird unten ein Balken angezeigt, der den Stand des gerade
aktiven Men&uuml;punktes anzeigt und mit Plus und Minus ver&auml;ndert werden kann.</P>

<h3>OSD im Vergleich</h3>

<P>Im Vergleich mit anderen OSD`s: Die Erkenn- und Lesbarkeit ist sehr gut.
Die Bedienung ist auf manchen Ger&auml;ten schneller zu bewerkstelligen, ist
aber hier okay und besser als einige andere, die ich getestet habe. Der
Funktionsumfang bewegt sich nur im Mittelfeld, es werden aber alle
wesentlichen Funktionen geboten.</P>

<h3>User-Modi</h3>

<P>Was ist aber mit Modi, die nicht den 15 vordefinierten entsprechen? Eine
Frage, die gerade f&uuml;r Amiga-Besitzer interessant ist.</P>

<P>Dann wird automatisch ein unbelegter Speicherplatz des Momitors f&uuml;r
Einstellungen verwendet. Erkennbar ist das im Hauptmen&uuml;, wenn kein
Bindestrich im Wort &quot;HAUPT FUNKTION&quot; dargestellt wird. Man kann hier also
seine eigenen Einstellungen t&auml;tigen. Wieviele unbelegte Speicherpl&auml;tze es
gibt, ist im Handbuch nicht zu erfahren, aber f&uuml;r mich hat es gereicht.</P>

<h3>Zusammenfassung:</h3>

<P>Dieser Monitor ist besonders f&uuml;r Amiga-Benutzer mit Grafikkarte
interessant. Er ist auf lange Sicht zukunftskompatibel, da er gute
Leistungsreserven bietet. Bild und Bedienung sind insgesamt gut,
Stromverbrauch, fest installiertes Kabel ohne weitere Eing&auml;nge sind die
wichtigsten Kritikpunkte, wovon letzterer gerade f&uuml;r Benutzer von mehreren
Rechnern wichtig sein kann. Das eingebaute Mikrophon ist eine nette Zugabe.</P>

<P>Wenn Sie eine Neuanschaffung planen, sollten Sie sich dieses Ger&auml;t
genauer anschauen.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>PV 995</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Proview</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Monitor (19 Zoll)</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>750,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Computer-Handel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../pd/9903web.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9903a2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


