<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Nachtrag zur Ariadne II</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Nachtrag zur Ariadne II</H1>von<BR><A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>Aus diversen Mailinglisten ist zu entnehmen, da&szlig; die Ariadne 2 zu einer,
wenn nicht der beliebtesten Netzwerkkarte geworden ist. Ganz sicher hat
der Preis den allergr&ouml;&szlig;ten Anteil daran. Denn seit dem Test in der letzten
Ausgabe hat sich zwar bei der Software etwas getan, aber leider nichts,
das Anla&szlig; zur Freude geben k&ouml;nnte.</P>

<P>Positiv ist, da&szlig; endlich Installationsdisketten erh&auml;ltlich sind, die mit
LhA gepackte Archive benutzen. Die Abst&uuml;rze von &quot;untgz&quot;, die eindeutig auf
zu wenig Stack zur&uuml;ckzuf&uuml;hren sind, sind damit vom Tisch. Doch leider
funktioniert die Installation noch immer nicht richtig. Die Archive der
ersten Installationsdiskette werden ordnungsgem&auml;&szlig; entpackt, bei der
zweiten Disk wird das darauf enthaltene Archiv zwar intensiv beackert,
aber installiert wird gar nichts. So hat man dann nach &quot;erfolgreicher
Installation&quot; ein AmiTCP:-Verzeichnis, in dem nichts als die Dokumentation
enthalten ist. AmiTCP, bzw GENESiS fehlt v&ouml;llig.</P>

<P>Immerhin sind auf der ersten Diskette jetzt die SANA-2-Hilfsprogramme
enthalten, die in der Anleitung beschrieben werden, jedoch auf den &auml;lteren
Installationsdisketten nicht vorhanden waren.</P>

<P>Auch aus den Mailinglisten konnte man entnehmen, da&szlig; nicht wenige Anwender
eine &quot;tote&quot; Ariadne 2 erhalten haben, die entweder gar nicht lief, oder
nur kurz und dann den Geist aufgab. Es scheint sich doch die fahrl&auml;ssige
Verpackung ohne Antistatik-T&uuml;te zu r&auml;chen.</P>

<P><B>Ergebnis:</B></P>

<P>Trotz Nachbesserung keine Besserung, im Gegenteil. Eigentlich m&uuml;&szlig;te man
die Kosten des Downloads von 1,5 MB f&uuml;r die beiden DMS-Archive, die
letztendlich gar nichts gebracht haben, mit in die Wertung einflie&szlig;en
lassen, aber es widerstebt mir, die an sich recht brauchbare Hardware
durch die indiskutable &quot;Leistung&quot; beim Handling zu sehr schlechtzumachen.</P>

<P><B>Schade</B> um ein potentiell gutes Produkt.</P>

<P>[Die <B>Wertung</B> &auml;ndert sich folglich nicht gegen&uuml;ber dem <a href="9812a2.htm">Test</a> in der letzten
 Ausgabe des AmZeigers, d.Chefred.]</P>

<P>Bezugsquelle:<BR>
Village Tronic Marketing GmbH<BR>
M&uuml;hlenstr. 2<BR>
31157 Sarstedt
</P>

Tel.:  05066 701318<BR>
WWW:   <A HREF="http://www.villagetronic.de">http://www.villagetronic.de</A><BR>
EMail: <A HREF="mailto:support@village.de">support@village.de</A><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903mon.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9903bas.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


