<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Sicherheit</h2>
<i>Dieser Abschnitt ist nicht Teil des amerikanischen Originals! </i>

<hr>

<h3>Einleitung</h3>

<p>Stellen Sie sich folgende Situation vor: Sie sitzen gem&uuml;tlich in
einem Lokal und unterhalten sich mit einem Fremden, den Sie gerade an
diesem Abend kennengelernt haben. Auf einmal fragt dieser Unbekannte: "Sag
mal, wie ist eigentlich Deine Kreditkarten-Nummer?" - "Ach, ich habe eine
VISA-CARD mit der Nummer 1234 4567 8912 3456 und sie l&auml;uft im
M&auml;rz 2000 ab."</p>

<p>Bl&ouml;dsinn? W&uuml;rde IHNEN nie passieren? - Seltsam, da&szlig; sich
im Internet viele Menschen genauso verhalten. In diesem Text sollen Sie nun
lernen, mit den "Gefahren", die im Internet auf Sie lauern, richtig
umzugehen. Diese Hinweise gelten im &Uuml;brigen nicht nur f&uuml;r den
Versand von Emails, sondern f&uuml;r viele allt&auml;gliche
Internet-Situationen. Teilweise gebe ich &uuml;brigens Beispiele f&uuml;r
Hilfsprogramme: Dies sind wirklich nur Beispiele und keine
Kaufempfehlung!</p>

<h3>Gefahrenpunkt 1: Pers&ouml;nliche sensible Daten</h3>

<p>Was sind
eigentlich sensible Daten, nun daf&uuml;r gibt es eigentlich keine
verbindlichen Kriterien. Das obige Beispiel zeigte - gewi&szlig; etwas
&uuml;bertrieben -, da&szlig; es Daten gibt, die man nicht preisgeben will
bzw. nicht preisgeben sollte. Dazu geh&ouml;ren u.a.<ul>
<li>Angaben &uuml;ber Kreditkarten<li>Angaben &uuml;ber die finanzielle
Situation
<li>Angaben &uuml;ber die Gesundheit
<li>Angaben &uuml;ber die Familienverh&auml;ltnisse</ul></p>

<p>Diese Daten nennt man "sensible Daten".
Als Anhaltspunkt k&ouml;nnte Ihnen dazu folgende Frage dienen: "Was
w&uuml;rde ich einem Fremden &uuml;ber mich erz&auml;hlen?".</p>

<p>Nun kommt es aber oft vor, da&szlig; Sie solche Informationen mitteilen
sollen. Die erste Frage lautet dann: "Wof&uuml;r brauchen Sie (die Firma,
Organisation oder die Privatperson) diese Information?" Erkennen Sie keinen
Grund daf&uuml;r, dann sollten Sie auch keine Informationen
weitergeben.</p>

<p>Wenn Ihnen die Weitergabe der Informationen vern&uuml;nftig erscheint,
erkundigen Sie sich unbedingt nach dem Datenschutz (in Amerika: Private
Policy), d.h. verlangen Sie Auskunft dar&uuml;ber, was mit Ihren Daten
geschieht, insbesondere wenn die Daten nicht mehr ben&ouml;tigt werden
(weil z.B. der Kauf abgeschlossen ist). Seri&ouml;se Firmen bieten solche
Informationen deutlich sichtbar an. Insbesondere sollten Sie sicherstellen,
da&szlig; diese Daten nicht weitergegeben und nach Abschlu&szlig; der
Dienstleistung o.&auml;. vernichtet werden. Z&ouml;gern Sie auch nicht,
Fragen zu stellen!</p>

<p>Selbst wenn alle diese Informationen zu Ihrer Zufriedenheit ausfallen:
Seien Sie sich dar&uuml;ber klar, da&szlig; die &Uuml;bertragung &uuml;ber
das Internet - auch die &Uuml;bertragung von Emails - nur "im Prinzip"
sicher ist! </p>

<p>Die &Uuml;bertragung einer Email im Internet ist vergleichbar mit dem
Versand von Postkarten. Ebenso wie der Brieftr&auml;ger die Postkarte lesen
k&ouml;nnte, kann eine Email leicht elektronisch nach
Schl&uuml;sselw&ouml;rtern durchsuchen werden und es wird somit Dritten
erm&ouml;glicht, f&uuml;r ihn interessante Nachrichten aus der Vielzahl der
Emails herauszufiltern. So geht das hartn&auml;ckige Ger&uuml;cht,
da&szlig; der amerikanische Geheimdienst CIA Emails auf bestimmte Begriffe
wie Terror u.&auml;. untersuchen l&auml;&szlig;t.</p>

<p>Sie werden sich vielleicht fragen: Wie soll das gehen? Nun, Ihre
Nachricht wird im Klartext sowohl zum Zielsystem &uuml;bertragen als auch
dort gespeichert. D.h. nicht nur der Systemadministrator des Zielsystems
ist technisch berechtigt, s&auml;mtliche Dateien und somit auch die dort
gespeicherten Mails zu lesen, zu ver&auml;ndern und zu l&ouml;schen, die
Nachricht kann auch auf ihrem Weg zum Zielsystem abgefangen und gelesen,
ver&auml;ndert oder gel&ouml;scht werden.</p>

<p>Wenn Sie also sensible Daten weitergeben m&uuml;ssen, tun Sie dies
pers&ouml;nlich, auf dem Postweg oder per Fax. Seri&ouml;se Firmen bieten
diese M&ouml;glichkeit immer an!</p>

<p>Sollten Sie doch - aus welchen Gr&uuml;nden auch immer - gezwungen sein,
die Daten per Email zu versenden, so sollten Sie diese Daten vor dem
Versand verschl&uuml;sseln. Ein Beispiel f&uuml;r ein solches Programm ist
PGP (Pretty Good Privacy) von Phil Zimmermann, das als extrem sicher gilt -
zumindest aus heutiger Sicht. Das Prinzip ist etwas komplizierter und macht
das Schreiben von Emails etwas umst&auml;ndlicher. Das sollte Ihnen Ihre
Sicherheit allerdings Wert sein! Nat&uuml;rlich mu&szlig; die entsprechende
Firma etc. auch dieses oder ein &auml;hnliches (wie z.B. Secure Multi
Purpose Mail Extension (S/MIME), Privacy Enhanced Mail (PEM) und MIME
Object Security Services (MOSS ) Verfahren unterst&uuml;tzen. Wiederum
gilt: Seri&ouml;se Firmen bieten diese M&ouml;glichkeit!</p>

<p>Wenn keine der genannten M&ouml;glichkeiten angeboten wird: VERTRAUEN
SIE SOLCHEN FIRMEN IHRE DATEN NICHT AN!</p>

<h3>Gefahrenpunkt 2: Viren</h3>

<p>Computer-Viren sind Programme, deren einziger "Sinn" es ist, Computer zu
sch&auml;digen, Daten auszuspionieren oder kleine "Scherze" an bestimmten
Tagen (z.B. Weihnachten o.&auml;.) auszuf&uuml;hren. Durch Datenverluste
und Mi&szlig;brauch von Zugangsdaten (z.B. des Internet-Accounts) entstehen
weltweit hohe Sch&auml;den, die man teilweise nicht finanziell beziffern
kann, z.B. wenn eine Diplom-Arbeit f&uuml;r alle Zeit verloren
ist.</p>

<p>&Auml;hnlich wie biologische Viren, m&uuml;ssen diese Viren aber
erstmal auf Ihren Computer gelangen. Heute ist die Hauptursache von
Virenbefall - neben den klassischen &Uuml;bertr&auml;gern wie Disketten und
CD's - das Internet. Viren tarnen sich hier z.B. als Teil von
Word-Textdokumenten (Makro-Viren) oder als Hilfsprogramme. </p>

<p>Im Rahmen dieser Bedrohung sind Emails nur die &Uuml;bertr&auml;ger von
Viren. Oft wird davor gewarnt, da&szlig; das &Ouml;ffnen der Email
gef&auml;hrlich sei. Dies aber gilt nur, wenn das Programm es
ausdr&uuml;cklich zul&auml;&szlig;t, da&szlig; aktive Inhalte (wie
VBScript, ActiveX, Java oder JavaScript) interpretiert werden. Diese
Warnung betrifft vor allem die Programme MS Outlook und Outlook Express. Um
sich selbst zu sch&uuml;tzen, sollten Sie unbedingt: Die
Sicherheitseinstellung auf "Hohe Sicherheit" einstellen und die Punkte
"Active Scripting", "Java" und "ActiveX" vollst&auml;ndig deaktivieren.</p>

<p>Doch Datenverlust durch Viren mu&szlig; nicht sein! Wenn Sie folgende
drei Regeln beachten, reduzieren Sie die Gefahr auf ein Minimum.</p>

<h3>1. Vorsorge durch Schutzsoftware und Backup</h3>

<p>Grunds&auml;tzlich gilt: kaufen Sie eine
kommerzielle Virenschutzsoftware, wie z.B. Norton Antivirus o.&auml;. Die
Betonung liegt dabei eindeutig auf Kaufen! Anti-Virensoftware, die aus
irgendwelchen omin&ouml;sen Quellen stammt, ist definitiv nicht sicher!
</p>

<p>Doch damit nicht genug: Stellen Sie auch sicher, da&szlig; Sie immer
die aktuellen Virendefinitionen haben. Mit Hilfe dieser Definitionen,
die die Hersteller - in der Regel monatlich und kostenlos -
ver&ouml;ffentlichen, wird das Programm auf den neuesten Stand gebracht und
dar&uuml;ber informiert, welche Viren es gibt. Nur so k&ouml;nnen Sie
sicher sein, da&szlig; Viren erkannt werden.</p>

<p>F&uuml;r alle F&auml;lle
sollten Sie aber auch REGELM&Auml;SSIG Backups Ihrer Daten anlegen - damit
der Schadensfall nicht zur Katastrophe wird.</p>

<h3>2. Vorsicht bei Anh&auml;ngen!</h3>

<p>&Ouml;ffnen Sie keine Anh&auml;nge, egal
ob Sie von Bekannten oder Unbekannten kommen. &Uuml;berpr&uuml;fen Sie
zun&auml;chst mit Hilfe Ihrer Virensoftware (am Besten automatisch) diese
Dateien vor dem &Ouml;ffnen. Dies gilt auch f&uuml;r Mails von Bekannten,
denn auch diese k&ouml;nnten verseucht sein! Der bekannte Melissa-Virus
verschickt z.B. an alle, die im entsprechenden Email-Adressbuch verzeichnet
sind, eine Email, die den Virus weiter verbreitet. Dieser Virus richtet
zwar keinen direkten Schaden an, verursacht aber ein enormes Mailaufkommen,
das teilweise Mailserver zum Zusammenbruch brachte.</p>

<p>Achten Sie daher auch darauf, Ihr Email-Programm so
einzustellen, da&szlig; Emails nicht automatisch, sondern nur dann
verschickt werden, wenn Sie es ausdr&uuml;cklich erlauben. Seien Sie sich
auch nicht zu schade, vor dem Abschicken einen Blick in den Ausgangsordner
zu werfen!</p>

<h3>3. Meiden Sie Microsoft-Produkte!</h3>

<p>Dieser Hinweis mag Ihnen merkw&uuml;rdig
vorkommen - aber es ist eine Tatsache, da&szlig; viele Viren die
Funktionalit&auml;t von Microsoft-Produkten und auch deren weite
Verbreitung nutzen (z.B. die erw&auml;hnten Macroviren). Wenn Sie diese
Programme nicht haben, kann auf Ihrem Rechner kein Schaden entstehen -
obgleich Sie nat&uuml;rlich durch Weiterschicken andere Rechner damit
infizieren k&ouml;nnen.</p>

<p>Als besonders anf&auml;llig gelten
&uuml;brigens MS Word und Outlook (auch Outlook Express). Dar&uuml;ber
hinaus zeichnet sich der Internet Explorer durch zahlreiche
Sicherheitsl&uuml;cken aus, von denen regelm&auml;&szlig;ig z.B. im
Heise-Newsletter berichtet wird. </p>

<p>Aber machen Sie sich keine Sorgen:
es gibt ausreichend Alternativen, die in der Funktionalit&auml;t den
Produkten von Microsoft in nichts nachstehen. Teilweise kosten diese
Produkte aber Geld bzw. mehr Geld als das vergleichbare Produkt. Aber das
sollte Ihnen Ihre Sicherheit wert sein.</p>

<hr>

<p>Weiter zum Thema <a href="onl_email11.html">Anhang A: Bibliographie</a><br>
zur&uuml;ck zum Thema <a href="onl_email09.html">Zusammenfassung</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a> </p>

<hr>

<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>

<p>&nbsp;</p>
</body>
</html>

