<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - PowerUp/WarpUp - Kommentar</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>PowerUp/WarpUp-Kommentar</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P><B>Lange</B>, sehr lange war sie erwartet worden: Die Einf&uuml;hrung der
PowerUP-Beschleunigerkarten von phase5. Doch schon kurz nachdem
die ersten HighEnd-Karten ausgeliefert wurden, rumorte es geh&ouml;rig
im Amigamarkt.</P>

<P>Die ersten nachfolgenden Abschnitte liefern einen Abri&szlig; der Ereignisse
und eine Zusammenfassung der jeweiligen Presseerkl&auml;rungen.</P>

<P><B>Was war passiert?</B></P>

<P>Haage&amp;Partner, seit einiger Zeit zu einer der f&uuml;hrenden Firmen f&uuml;r
Softwareentwicklung und -Vertrieb aufgestiegen, wandten sich mit einer
bedeutungsvollen Presseerkl&auml;rung an die &quot;Amiga-Gemeinde&quot;.</P>

<P>Ein neues Software-Paket f&uuml;r die PowerUp-Karten sollte mit ungew&ouml;hnlichen
Geschwindigkeitszuw&auml;chsen die originale PowerUp-Systemsoftware von phase 5
&uuml;berfl&uuml;geln. Au&szlig;erdem w&auml;re <B>WarpUp</B>, so die Bezeichnung, hardwareunabh&auml;ngig
und zukunftskompatibel, mit StormC die Compilierung kein Problem.</P>

<P>Der Clou: Das Paket sei <B>kostenlos</B> auf H&amp;P`s Web-Site downloadbar.</P>

<P>Tats&auml;chlich alles besser, ohne den ber&uuml;hmten Haken?</P>

<P><B>phase 5 reagiert</B></P>

<P>Nicht lange auf sich warten, lie&szlig; ein erstes Posting von phase 5, das dann
auch als erste offizielle Stellungnahme verbreitet wurde.</P>

<P>Hier wurde massiv und in klaren Worten von WarpUp abgeraten und auf die
Inkompatibilit&auml;t zur mitgelieferten Systemsoftware bzw. die nicht gegebene
Zukunftsf&auml;higkeit bei fortentwickelter Hardware hingewiesen.</P>

<P>phase 5 w&uuml;rde keine inkompatible L&ouml;sung tolerieren, die, ohne das
die originalen Softwarebestandteile noch funktionieren w&uuml;rden, die
mitgelieferte Systemsoftware ersetzen soll.</P>

<P>Nach einer langen Zeit der Zusammenarbeit und Unterst&uuml;tzung w&auml;re phase 5
von der Handlungsweise H&amp;P`s entt&auml;uscht und w&uuml;rden jeglichen weiteren
Entwicklersupport einstellen.</P>

<P><B>Zwischenspiel: Worum geht es eigentlich?</B></P>

<P>Es geht, vereinfacht ausgedr&uuml;ckt, um das Betriebssystem auf Seiten des
PPC`s. Die Software, die PPC`s unterst&uuml;tzt und teilweise auf der
Amigaseite abl&auml;uft, ist nat&uuml;rlich abh&auml;ngig von der Art der L&ouml;sung
auf der PPC-Seite. Das Zusammenspiel mu&szlig; vorher detailliert festgelegt
werden.</P>

<P>Bei phase 5 handelt es sich im Wesentlichen um die <B>ppc.library</B>, die von
der WarpUp-Software ersetzt wird, allerdings so, da&szlig; Programme, die die
Originall&ouml;sung voraussetzen, selbst mitgelieferte Bestandteile, nun nicht
mehr laufen. Es existiert zwar auch eine kompatible L&ouml;sung von H&amp;P, die
installiert werden kann, aber mit dieser w&uuml;rde man kaum einen Unterschied
zum Original erhalten und h&auml;tte somit keinen Vorteil.</P>

<P>Lohnt es sich trotzdem? Ist es so, wie H&amp;P es darstellt, da&szlig; ihre L&ouml;sung
die bessere und schnellere ist? H&auml;tte gleich von Anfang an WarpUp die
Systemsoftware stellen sollen und phase 5 w&uuml;rde nur auf einer eigenen,
aber schlechteren Alternative beharren?</P>

<P>Im recht ausf&uuml;hrlichen Antwort-Statement &auml;u&szlig;ert H&amp;P sich dazu und die
wahrscheinlich aus der &Uuml;berraschung heraus geborene p5-Mitteilung bot
ihnen gute Angriffspunkte.</P>

<P><B>Haage &amp; Partner`s Stellungnahme</B></P>

<P>H&amp;P unterstellt phase 5 eine emotionale &Uuml;berreaktion.</P>

<P>Neben diversen technischen Erl&auml;uterungen, die die eigene Technologie des
Amiga-&auml;hnlichen <B>Hunkformats</B> dem von phase 5 favorisierten <B>ELF-Format</B> als
&uuml;berlegen darstellen, lautet eines ihrer Argumente, da&szlig; phase 5 in
Wirklichkeit zukunftskompatibel zu einem sp&auml;ter von ihnen eingef&uuml;hrten
eigenen Nachfolgebetriebssystem des AmigaOS sein wolle.</P>

<P>phase 5 w&uuml;rde auch die Softwareseite monopolistisch &uuml;berwachen wollen,
um Konkurrenten auch hier zu verdr&auml;ngen.</P>

<P>In Zukunft m&ouml;gicherweise erscheinende PPC-L&ouml;sungen anderer Hersteller
w&uuml;rden wahrscheinlich nicht kompatibel zu Software sein, die jetzt f&uuml;r
die PPC-L&ouml;sung von phase 5 geschrieben werden.</P>

<P>Insgesamt erh&auml;lt man nach den Ausf&uuml;hrungen den Eindruck, da&szlig; die
ppc.library (p5) zumindest lange Zeit fehlerhaft war und eine umst&auml;ndliche
L&ouml;sung darstellt. H&amp;P w&auml;re immer zur Zusammenarbeit bereit gewesen, nur
phase 5 h&auml;tte dies in Wirklichkeit nicht gen&uuml;gend gewollt und die
Entwicklung einer anderen L&ouml;sung behindert bzw. absichtlich
Inkompatibilit&auml;t herbeigef&uuml;hrt.</P>

<P>Das als die wesentlichen Punkte der Ausf&uuml;hrungen.</P>

<P>Mit diesen an sich schl&uuml;ssig wirkenden Erl&auml;uterungen, deren technische
Aspekte allerdings von den meisten Anwendern und auch vielen Programmierern
nicht wirklich beurteilt werden konnten, hatte Haage&amp;Partner einige
Sympathiepunkte f&uuml;r sich verbuchen k&ouml;nnen, was auch viele Reaktionen in
diversen Netzen ausdr&uuml;ckten.</P>

<P><B>phase 5 geht ins Detail</B></P>

<P>Bei der Antwort lie&szlig; sich phase 5 diesmal mehr Zeit. Zwar erschien
nicht allzulange sp&auml;ter ein kurzes Statement, das die Kernpunkte des
Firmenstandpunkts noch einmal auflistete. Untermauern wolle man dies
aber sp&auml;ter ausf&uuml;hrlicher auf der Website.</P>

<P>Hier waren dann eine ganze Menge Artikel zu finden, die auf spezielle
Aspekte detailliert aus der Sicht von phase 5 eingehen.</P>

<P>Zuallererst wird betont, informieren und deeskalieren zu wollen.</P>

<P>H&amp;P k&ouml;nnten mit ihrer Softwareentwicklung machen was sie wollen. Solange
sie keine zu PowerUp kompatible L&ouml;sung erstellten, w&uuml;rde phase 5 dies
nicht beeinflu&szlig;en, im positiven, wie im negativen Sinne.</P>

<P>phase 5 widerspricht H&amp;P`s Darstellung, nachdem sie quasi heimlich die
Entwicklung eines Nachfolge-AmigaOS betrieben und PowerUp daf&uuml;r kompatibel
gehalten werden sollte.</P>

<P>Offene Standards, die teilweise auch au&szlig;erhalb des Amiga-Bereichs ihre
Berechtigung haben, k&ouml;nnten nur gut f&uuml;r die zuk&uuml;nftige
Amiga-Softwareentwicklung sein.</P>

<P>phase 5 weist den Vorwurf der absichtlichen Inkompatibilit&auml;t zur&uuml;ck und
gibt diesen schwarzen Peter an Haage&amp;Partner zur&uuml;ck. Haage&amp;Partner h&auml;tte
zwar auch eine kompatible L&ouml;sung, bewerbe aber die inkompatible, die den
Leistungszuwachs bringen soll.</P>

<P>Genau dann w&auml;re aber keinerlei PowerUp-Systemsoftware lauff&auml;hig,
einschlie&szlig;lich CyberGL (PPC-nativ) oder der diversen MPEG-Tools.</P>

<P>phase 5 h&auml;tte Haage&amp;Partner lange mit kostenlosen Developerboards, sowie
vollem Entwicklersupport unterst&uuml;tzt, um alternative, aber systemkonforme
L&ouml;sungen nicht zu blockieren. Das die Unterst&uuml;tzung eingestellt wurde, ist
f&uuml;r sie ein logischer Schritt, da die Zusammenarbeit, die auf einem
Vertrauensverh&auml;ltnis basiert hatte, sich pl&ouml;tzlich zu einem
Konkurrenzverh&auml;ltnis wandelte.</P>

<P>H&amp;P, das war in ihrem Statement auch tats&auml;chlich zu lesen, favorisiere
grunds&auml;tzlich Einprozessorsysteme. Die p5-L&ouml;sung w&auml;re im Gegensatz dazu
f&uuml;r Multiprozessorsysteme konzeptioniert.</P>

<P>phase 5 wirft Haage&amp;Partner au&szlig;erdem vor, selbst WarpUp als Standard
etablieren zu wollen, um die zuk&uuml;nftige OS-Entwicklung zu bestimmen,
sowie ihren Entwicklerwerkzeugen Dominanz zu verschaffen.</P>

<P>Neben vielen weiteren Informationen, die z.T. technische Details betreffen,
waren das die wesentlichsten Punkte.</P>

<P><B>Wie soll man das Ganze bewerten?</B></P>

<P>Sicher ist eines klar: Beide Firmen haben wirtschaftliche Interessen
und daher nichts zu verschenken, nur um den Amiga-Markt aufzupeppeln.</P>

<P>Das ist legitim.</P>

<P>Nach der Darstellung von phase 5 erh&auml;lt man den Eindruck und das wurde
dort auch ausf&uuml;hrlich geschildert, da&szlig; H&amp;P phase 5 im Grunde hintergangen
hat, in dem sie die WarpUp-Entwicklung bis kurz vor der Ver&ouml;ffentlichung
anders (als kompatible L&ouml;sung) dargestellt haben und das Paket dann
pl&ouml;tzlich, trotz gegenteiliger Zusicherungen, ohne weitere Diskussion
verbreitet und massiv beworben haben.</P>

<P>Wie dem auch sei. Es steht aber fest, da&szlig; der Anwender freie Wahl hat.</P>

<P>Der Entwickler, der f&uuml;r WarpUp entwickeln m&ouml;chte, hat keine. Er mu&szlig;
StormC benutzen, um eine WarpUp-Software kompilieren zu k&ouml;nnen (auch
wenn H&amp;P beteuert, sie w&uuml;rden andere Compiler-Ersteller unterst&uuml;tzen,
wenn sie das Einbauen wollten). An sich ist das aber durchaus eine
plausible Erkl&auml;rung f&uuml;r H&amp;P`s wirtschaftliche Interessen.</P>

<P>phase 5 ist sicher daran interessiert, da&szlig; sich ihre PowerUp-Karten gut
verkaufen und als Anreiz daf&uuml;r gilt auch eine quantitativ und qualitativ
gute Softwareunterst&uuml;tzung.</P>

<P>Deshalb, und das d&uuml;rfte jedem klar sein, ist <B>EIN EINZIGER</B> Standard
notwendig, der alle Anstrengungen auf sich vereint. Der Markt, sowie
die Softwareentwickler d&uuml;rfen nicht gesplittet werden, sondern brauchen
Sicherheit.</P>

<P>Haage&amp;Partner, und das ist ebensowenig zu bestreiten, hat sehr pl&ouml;tzlich
gro&szlig;e Unsicherheit in diesen Markt gebracht.</P>

<P>Welches Interesse sollte phase 5 haben, die Softwareseite zu bestimmen?</P>

<P>Der Grund ist, da&szlig; der Standard und damit der einige Absatzmarkt nicht
gef&auml;hrdet werden soll. Aber sicher nicht, da&szlig; es emsigen Softwarefirmen
verwehrt werden soll, Entwicklerwerkzeuge oder &auml;hnliches f&uuml;r PowerUp zu
programmieren.</P>

<P>Als Produzent der mit Sicherheit &auml;u&szlig;erst komplexen PowerUp-Boards, deren
Entwicklung Jahre und viel Geld gekostet hat, finde ich, hat phase 5
durchaus das Recht, erst einmal einen verbindlichen, auch zu ihren
zuk&uuml;nftigen Entwicklungen kompatiblen Standard zu definieren, nach
dessen Richtlinien Software f&uuml;r ihre Hardware programmiert werden
soll.</P>

<P>Wenn im Moment noch nicht erh&auml;ltliche Turbokarten und Zusatzmodule, wie
von phase 5 angedeutet, dann nicht wie vorgesehen mit der WarpUp-Software
funktionieren, obwohl es diese tats&auml;chlich inzwischen geschafft h&auml;tte
einen Teil des Softwaremarktes f&uuml;r sich zu gewinnen (ein geteilter Markt
w&auml;re aus einleuchtenden Gr&uuml;nden f&uuml;r User und Applikationsentwickler
gleicherma&szlig;en in jedem Falle von Nachteil), dann w&uuml;rde die gesamte
bisherige Produktlinie in Mi&szlig;kredit geraten - ein Kollaps des verbliebenen
Amiga-Marktes, der die PowerUp-Karten zum gro&szlig;en Teil doch als letzte
Hoffnung f&uuml;r sich anerkennt, w&auml;re dann nicht auszuschliessen.</P>

<P>Haage&amp;Partner setzt dem entgegen, da&szlig; die PowerUp-Karten nicht die einzige
PPC-Implementation f&uuml;r den Amiga bleiben w&uuml;rde und somit nicht phase 5
den Standard bestimmen und kontrollieren sollte.</P>

<P>Bis jetzt gibt es aber noch keinerlei konkrete Ank&uuml;ndigungen f&uuml;r weitere
echte PPC-Karten von anderen Firmen.</P>

<P>Werden in absehbarer Zukunft andere Firmen den Entwicklungsvorsprung
von phase 5 aufholen k&ouml;nnen, dem nachweislich erfolgreichsten
Turbokartenhersteller, mit in vielen Jahren in diesem Bereich erworbenem
gro&szlig;en Know-How? Das soll kein &amp;In-den-Himmel-heben&amp; sein, aber diese
Frage stellt sich berechtigt.</P>

<P>Das ist eine ziemlich ungewisse Aussicht und daher reine Spekulation.</P>

<P><B>Egal wie die Entwicklung weiterl&auml;uft. Fest steht, da&szlig; zwei zueinander
inkompatible L&ouml;sungen, genau eine zu viel ist.</B></P>

<P>Machen Sie sich bitte selbst ein Bild von den Statements auf den
jeweiligen Firmen-Homepages:</P>

<P ALIGN="CENTER">
<A HREF="http://www.haage-partner.com">Haage&amp;Partner</A><BR>
<A HREF="http://www.phase5.de">phase 5</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="news.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="comp97.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

