<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Interview: Olaf Barthel</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR>Olaf Barthel</P>

<P>
Olaf Barthel, seit vielen Jahren einer der f&auml;higsten
Amiga-Programmierer, wurde unter anderem bekannt durch <B>TERM</B>, welches
zum Standard der Amiga-Terminalprogramme avancierte, sowie durch
die PhotoCD-Software <B>Photoworx/Folioworx</B>. Sein neuestes Werk ist
das Update des legend&auml;ren <B>CygnusED</B>.</P>
<P>
AmZ: Gregor Franz<BR>
OB : Olaf Barthel
</P>
<HR WIDTH="50%">
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wann hast Du eigentlich angefangen zu programmieren? Um was hatte
     es sich dabei gehandelt?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Das mu&szlig; 1983 gewesen sein. Ich hatte mir damals einen VC-20 gekauft
     und nach und nach damit begonnen, BASIC zu lernen. Mein erstes
     Programm war eine Art &quot;programmierbarer Taschenrechner&quot;.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Dann muss man zur Orientierung der Leser eigentlich schon indiskret
     werden. Wie alt bist Du eigentlich? Gehst Du schon einem Beruf nach?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Ich bin Gesellschafter einer von mir mitgegr&uuml;ndeten GmbH, die in
     Hannover ans&auml;ssig ist. In diesem Zusammenhang bin ich wohl schon
     &quot;selbst&auml;ndig&quot;, aber ich betreibe immer noch mein Informatikstudium
     und f&uuml;hre Software-Auftragsentwicklung durch. Derzeit bin 28 Jahre
     alt.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie sieht Deine Computervergangenheit aus? Welches war Dein
     Einstiegsmodell und wie ging es weiter?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Mit dem VC-20 fing es an, danach kam ein C-64 und 1987 dann ein
     Amiga 500. 1991 hatte ich gen&uuml;gend Geld f&uuml;r einen Amiga 3000
     gespart, den ich 1993 gegen einen Amiga 3000T eingetauscht habe.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Eines Deiner kontinuierlich fortgefuehrten Projekte ist TERM, von
     dem k&uuml;rzlich die Version 4.8 erschien. Gibt es eigentlich noch
     nennenswerte Konkurrenz und was werden zuk&uuml;nftige Versionen
     bringen? Ist es nicht schon sehr komplex und ausgereift?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Jedes weniger komplexe Amiga-Terminalprogramm ist Konkurrenz f&uuml;r
     `term'. Die Komplexit&auml;t des Programmes ist sein gr&ouml;&szlig;ter Nachteil.
     Ich denke sogar, da&szlig; es sich in den letzten Jahren immer weiter
     davon entfernt hat, &quot;ausgereift&quot; zu sein.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Erfreulicherweise ist die Entwicklung auch von MagicMenu nicht
     eingeschlafen, nachdem Martin Korndoerfer sich vom Projekt
     zur&uuml;ckgezogen hat. Wie kam es dazu, dass Du die Weiterentwicklung
     &uuml;bernommen hast?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Martin hatte den Multicolour-Modus ins Programm eingebaut und ein
     neues Preferences-Programm geschrieben, das die gtlayout.library
     benutzte. Das sah schon alles sehr gut aus, aber dann passierte eine
     ganze Weile lang nichts. Ich habe ihn dann gefragt, ob er das Projekt
     w&uuml;rde an mich abgeben wollen und er hat eingewilligt.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>TERM ist uneingeschr&auml;nkt nutzbar, bei regelm&auml;ssiger Benutzung wird
     aber um eine Spende gebeten. Fuer MagicMenu soll man sich mit einer
     einem angemessen erscheinenden Summe registrieren lassen. Es ist
     aber ebenfalls nicht eingeschr&auml;nkt. Wie ist der Widerhall auf
     solche Bitten ohne einen gewissen Druck? Und wie stehst Du der
     Idee der Shareware/Freeware an sich gegen&uuml;ber?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Als es dem Amiga noch gut ging, bekam ich fast w&ouml;chentlich Post
     oder Spenden zu `term', aber das ist nach und nach abgeflaut. F&uuml;r
     MagicMenu habe ich eine Handvoll Spenden und ein paar Briefe bekommen,
     der Enthusiasmus ist wohl nicht mehr so gro&szlig;. Aber das ist immer noch
     besser, als sich &uuml;ber eine &quot;geknackte&quot; Shareware-Version zu &auml;rgern.
     Ich halte nicht viel von Shareware, der &Auml;rger den man sich damit
     einhandelt, steht in keinem Verh&auml;ltnis zum Nutzen.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Bei Schatztruhe ist nun die Version 4 des legend&auml;ren CygnusED
     erh&auml;ltlich. F&uuml;r dieses Update zeichnest Du mitverantwortlich.
     Es sind auf dem Amiga in diesem Metier einige sehr ausgereifte
     L&ouml;sungen im PD-Sektor, also g&uuml;nstiger, erh&auml;ltlich. Was hat
     CygnusED, was die anderen nicht haben?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>CygnusEd hat eine 10-j&auml;hrige Vorgeschichte, fast jeder Amiga-
     Programmierer, den ich kenne, benutzt ihn und hat sich mit den
     Jahren an seine guten Eigenschaften und an seine Schw&auml;chen gew&ouml;hnt.
     CygnusEd ist au&szlig;erdem immer noch der schnellste und der kompakteste
     Texteditor f&uuml;r den Amiga.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie kam es &uuml;berhaupt dazu, da&szlig; nach einigen Jahren Pause jetzt die
     Entwicklung an CygnusED wieder aufgenommen wurde? War Schatztruhe
     der Initiator und sie sind dann an Dich herangetreten?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Nein, ich habe im M&auml;rz einfach bei Bruce Dawson angeklopft und
     ihn gefragt, ob er den Sourcecode f&uuml;r die Weiterentwicklung
     herausgeben w&uuml;rde. Er hat schlie&szlig;lich eingewilligt, mich aber
     auch gewarnt, da&szlig; er den Sourcecode schon einmal abgegeben h&auml;tte,
     aber da&szlig; aus einer Weiterentwicklung nichts geworden sei. Eine
     Woche sp&auml;ter hatte ich ein 3 MByte gro&szlig;es Archiv in meinem
     Mail-Folder und ich konnte loslegen. Einfach nur ein weiteres
     Shareware-Programm aus CygnusEd zu machen, fand ich dann doch zu
     schade. Au&szlig;erdem zieht ein kommerzielles Produkt normalerweise mehr
     Aufmerksamkeit auf sich, als der X-te Upload eines Programmpaketes
     ins Aminet es erwarten kann.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was f&uuml;r ein Amiga ziert eigentlich Deine Heimstatt und welche
     Programmiersprache bevorzugst Du?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Seit Anfang dieses Jahres arbeite ich auf einem Amiga 3000UX.
     Nach wie vor programmiere ich in `C'.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Und die Gretchenfrage ;) - Mit welchem Editor arbeitest/
     programmierst Du eigentlich?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Ich benutze CygnusEd und TurboText. SAS/C ist bei mir f&uuml;r den
     TurboText konfiguriert, mit CygnusEd w&auml;re das alles noch viel
     zu kompliziert. Mit Betonung auf &quot;noch&quot;.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Was h&auml;ltst Du von der derzeitigen Lage des Amiga seit der &Uuml;bernahme
     durch Gateway 2000 und von den bisherigen Aktivit&auml;ten und Planungen
     der Amiga-Tochterfirmen?</P><P>
     Warst Du vielleicht auf der Computer 97? Wenn ja, was hattest Du
     f&uuml;r einen Eindruck von der Messe?</P></TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD><P>Ich sehe ein, da&szlig; die Weiterentwicklung des Amigas der
     Vorbereitung bedarf, aber es ist einfach zu still, viel zu still.
     Die sich wiederholenden Presse-Statements von Petro T. sind kein
     Ersatz f&uuml;r das sichtbare Fortschreiten der Produktentwicklung.</P>
     <P>Ich habe die Computer '97 besucht und auch die Pressekonferenz
     am Freitag Abend besucht. Von der Messe habe ich nicht soviel
     mitbekommen, aber das kann auch gut an meiner permanent
     vorhandenen Abneigung gegen&uuml;ber Messen generell liegen.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Stellen die PPC-Beschleunigerboards f&uuml;r Dich eine praktikable
     L&ouml;sung der dringendsten Amiga-Probleme dar? Wie siehst Du, als
     potentiell betroffener Programmierer, die nach der ersten
     Lieferung aufgetretenen Zwistigkeiten zwischen phase5 und
     Haage&amp;Partner um die Standard-Softwarel&ouml;sung auf der PPC-Seite?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD><P>Wenn die PowerPC-Beschleuniger dringendste Amiga-Probleme
     l&ouml;sen k&ouml;nnen, dann bin ich bisher noch von keinem dieser
     Probleme betroffen. Die CPU-intensivste Anwendung, die ich
     benutze, ist mein `C' Compiler. Und alleine daf&uuml;r lohnt sich
     f&uuml;r mich pers&ouml;nlich die Investition noch nicht.</P>
     <P>Zu dem Konflikt zwischen phase 5 und Haage &amp; Partner halte ich
     mich mit &Auml;u&szlig;erungen lieber zur&uuml;ck. Es h&auml;tte gar nicht erst soweit
     kommen d&uuml;rfen.</P>
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Ist f&uuml;r Dich der Amiga-Emulator UAE, von dem in dieser Ausgabe
     berichtet wird, eine gute L&ouml;sung den Amiga auch in der PC-Welt
     bekannt zu machen oder w&uuml;rdest Du ihn eher als Gefahr f&uuml;r einen
     potentiellen Absatzmarkt sehen</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD><P>Wer UAE als Spielzeug auf seinem PC einsetzt, wird auch kaum in
     Amiga-Software investieren wollen. UAE ist meiner Meinung nach
     allenfalls ein Problem f&uuml;r Gateway 2000.</P>
     <P>Das aktuelle Workbench-Disks und Kickstart-ROMs im Internet
     problemlos zu finden sind, ist da wohl das gr&ouml;&szlig;ere Problem.</P>
    </TH>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Du hast keinen st&auml;ndigen Internetanschluss. Kommt das noch oder
     hast Du kein Interesse? Gen&uuml;gen Dir die M&ouml;glichkeiten lokaler
     Mailboxen?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Eigentlich gen&uuml;gen mir News und Mail. Wenn ich Daten aus dem
     Internet ben&ouml;tige, ist der Abruf meist in weniger als einer
     Viertelstunde geschehen. Weshalb man mehr als diese Zeit im
     Internet verbringen sollte, ist mir immer noch nicht so recht
     einsichtig.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wo liegen Deine Interessen neben dem Computern? F&uuml;r welche
     Hobbies bleibt noch Zeit?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Ich habe meinen Spa&szlig; mit englischer und amerikanischer
     Literatur. :)</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Welches Genre bevorzugst Du? Kannst Du ein paar Deiner
     Lieblingsautoren nennen?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Ich orientiere mich eher an Autoren als an Genres, bei beidem
     kann man aber auf entt&auml;uschende B&uuml;cher sto&szlig;en. Lieblingsautoren?
     Das sind wohl am ehesten Bruce Chatwin und T.C. Boyle.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Kanntest Du den AmZeiger eventuell schon vor der Interview-Anfrage?
     Wenn Du einen Blick riskiert haben solltest: Wie findest Du ihn?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OB:</TH>
    <TD>Ich habe seinerzeit die Ank&uuml;ndigung f&uuml;r die erste Ausgabe in
     de.comp.sys.amiga.misc gelesen, aber zum Downloaden und Lesen
     bin ich damals nicht gekommen. Ich bin eigentlich nicht dazu zu
     begeistern, Texte am Bildschirm zu lesen, Gedrucktes liest sich
     meiner Meinung nach doch besser. Ich habe mir die letzten beiden
     Ausgaben jetzt aber doch noch geholt und durchgelesen. Der
     Informationsgehalt war um ein Vielfaches h&ouml;her als der des
     Amiga-Magazins :)
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>:) Danke fuer das Interview!</TD>
</TR>
</TABLE>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9712cd.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
