<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Computer 97</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Computer 97 - Zusammenfassung</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P>Viel wurde im Vorfeld spekuliert. Eine Menge Neuerscheinungen waren
angek&uuml;ndigt, mindestens ein Geheimnis sollte auf der Messe gel&uuml;ftet
werden. Nachfolgend eine kommentierte Zusammenfassung:</P>

<P><B>Was gab es Neues?</B></P>

<P>Das gro&szlig;e Geheimnis waren wohl die, schon im Vorfeld bekanntgewordenen
Amiga-Neuentwicklungen von DCE.</P>

<P>DCE hat auch offiziell von Amiga International eine Lizenz zur
Fertigung ihrer auf dem A1200 bzw. A4000 und OS 3.1 basierenden A5000
und A6000 bekommen.</P>

<P>Ob die mit Scandoubler, Zorro-II und 68030/50 bzw. 68060/50
ausger&uuml;steten AGA-kompatiblen Rechner mit PC-Tastatur und -Geh&auml;use,
sowie DD-Diskettenlaufwerk wirklich einen Schritt in die Zukunft f&uuml;r
den Amiga darstellen, wie die offizielle Pressemitteilung verlautbaren
l&auml;&szlig;t, ist doch etwas zweifelhaft.</P>

<P>Laut neuestem Stand hat DCE auf Grund der Kundenw&uuml;nsche beim A5000 den
68030 durch den 68040 mit Taktraten zwischen 25 und 40 MHz ersetzt und
neben IDE wird SCSI integriert. Au&szlig;erdem soll die Zorro-III-Option an
der Verf&uuml;gbarkeit des daf&uuml;r zust&auml;ndigen Custom-Chips Buster h&auml;ngen.</P>

<P>Als Sensation kann man diese neuentwickelten Motherboards sicher
nicht werten, aber verdammen, wie es einige voreilige Reaktionen
ausdr&uuml;ckten, kann man sie sicher auch nicht.</P>

<P>Ob man mit einem, mit 16 MB Ram, 1,7 GB Festplatte und CD-ROM-Laufwerk
ausgestatteten A5000 mit 68040/33 MHz und einem anvisierten Preis von
etwa 1.600 DM (040/40 soll 120 DM teurer sein) allerdings einen guten
Absatz erreichen kann, wird sich zeigen.</P>

<P>Mir zumindest ist nicht eing&auml;ngig, warum sich Leute, die nicht aus
dem Amiga-Umfeld stammen, einen exotischen Rechner schlechterer
Rechenleistung bei vergleichbaren PC-Angeboten kaufen sollten.</P>

<P>Die Amiga-User w&uuml;rden sich einen Rechner kaufen, der kaum gravierende
Vorteile gegen&uuml;ber der jahrealten Amiga-AGA-Generation besitzt, au&szlig;er
besserer Erweiterbarkeit gegen&uuml;ber dem A1200 (der daf&uuml;r aber selbst
mit 68030/50-Erweiterung, die im &uuml;brigen in vielen Bereichen der
Leistung einen 68040/25 entspricht, auch um einiges billiger ist).</P>

<P>Der Preis und die eventuelle Aufr&uuml;stung mit zus&auml;tzlichen geplanten
Komponenten, wie PowerUp werden &uuml;ber die Gunst der K&auml;ufer entscheiden.</P>

<P>Interessant k&ouml;nnte aber auch das von <B>Index</B> vorgestellte <B>BoXeR</B>-Design
werden, ein Amiga-kompatibles Motherboard, das ZorroIII integriert
hat und mit MC68040 und 68060 best&uuml;ckt werden soll.</P>

<P><B>Und wo sind nun die Sensationen?</B></P>

<P>Auch von Amiga International gab es nichts sensationelles zu
vermelden. Au&szlig;er der von Petro Tyschtschenko, dem Gesch&auml;ftsf&uuml;hrer,
im Umfeld gemachten &Auml;u&szlig;erung, am liebsten w&auml;re ihm die Fortf&uuml;hrung
der alten Motorolla-CPU-Reihe, da g&auml;be es keine Probleme mit der
OS-Frage (sinngem&auml;&szlig;).</P>

<P>Nun, da hat er zwar nicht unrecht, aber ob Motorolla die 680XX-Reihe
z.B. mit einem 68070 fortf&uuml;hren wird, nachdem sie vor Jahren die
Entwicklung eingestellt hat, nur um dem Amiga etwas unter die Arme
zu greifen, ist doch zu bezweifeln.</P>

<P>F&uuml;r den Realit&auml;tssinn und die Entscheidungsfreudigkeit von Amiga spricht
auch nicht unbedingt der, auf der DevCon, der Entwicklerkonferenz,
ausgeteilte Fragebogen, auf denen f&uuml;r den bevorzugten Prozessortyp eines
zuk&uuml;nftigen Amigas votiert werden sollte. Anzukreuzen waren neben 68K (!),
Intel und diversen anderen CPU`s auch der PPC.</P>

<P>Ansonsten also also wieder nichts konkretes, au&szlig;er da&szlig; Amiga-OS 3.5,
dessen Entwicklung zu dem Zeitpunkt noch nicht einmal begonnen hatte,
eventuell schon Ende Januar 98 zu haben sei und wohl kein ROM-Update
ben&ouml;tige, da unter anderem viele bestehende Softwarel&ouml;sungen
integriert werden sollen. (Was ja durchaus Sinn macht.)</P>

<P><B>Aber die Neuerscheinungen...?</B></P>

<P>Unter anderen ist das neue Turbocalc erschienen.</P>

<P>Viele Erscheinungstermine wurden aber verschoben, auch f&uuml;r die
PowerUp-Karten konnten erst wenige Applikationen (z.B. Wildfire)
pr&auml;sentiert werden. Mal sehen, wie es da weiterl&auml;uft.</P>

<P>Reflections (PPC), das bestverkaufte CD-Spiel `Myst` oder JAVA (Merapi),
sie alle waren (noch) nicht zu bestaunen.</P>

<P><B>...und deshalb?</B></P>

<P>...waren nicht wenige Besucher entt&auml;uscht, da die Messe auch noch
von zwei auf eine Ausstellungshalle geschrumpft ist und so einige
geweckte Erwartungen nicht erf&uuml;llt hat.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9712p5hp.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

