<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A> <A HREF="#Sonstiges">Sonstiges</A></P>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Nach diversen Ger&uuml;chten hat es sich nun best&auml;tigt: Das <B>Amiga-Magazin</B> des
MagnaMedia-Verlages wird ab der Ausgabe 02/98 nur noch unter dem Namen
&quot;<B>Amiga-HighTech</B>&quot; als 32-seitige Beilage zur PCgo! zum bisherigen Preis
an die Abonnenten gehen. Alle zwei Monate soll eine Amiga-CD enthalten
sein.</P>
<P><HR WIDTH="50%"></P>
<P>
Im <A HREF="http://www.icp-verlag.de">ICP-Verlag</A>, Herausgeber der <A HREF="http://www.amigaplus.de">AmigaPlus</A>,
soll ab n&auml;chstem Jahr eine neue Zeitschrift unter der Bezeichnung &quot;<B>Amiga-Future</B>&quot;
zweimonatlich erscheinen und die bisherigen Sonderhefte ersetzen. Der redaktionelle
Inhalt dieser neuen Zeitschrift, die sich haupts&auml;chlich Spielen
widmen soll, wird vom Computerclub APC&amp;TCP beigesteuert. Jede
Ausgabe wird eine CD mit aktuellen Spielen und Demos enthalten.
</P>
<P><HR WIDTH="50%"></P>
<P>
Wie <B>Petro Tyschtschenko</B> am Rande der Computer 97 verlautbaren lie&szlig;,
sollen zuk&uuml;nftige Amiga-Einstiegsmodelle etwa 400,- DM kosten, das
Topmodell, welches ebenfalls 1998 erscheinen soll, um die 1.500,- DM.
</P>
<P>
Weiterhin w&uuml;rde <A HREF="http://www.amiga.de">Amiga International</A> bereits
schwarze Zahlen schreiben und h&auml;tte schon Geld an die Mutterfirma
<A HREF="http://www.gw2k.com">Gateway 2000</A> in die USA &uuml;berwiesen. Gro&szlig;en Anteil an dem Ergebnis h&auml;tten
u.a. die neuen Absatzm&auml;rkte in den ehemaligen Ostblock-Staaten.
</P>
<P><HR WIDTH="50%"></P>
<P>
Stolz meldet Amiga International die Unterzeichnung eines Vertrages &uuml;ber
die Lieferung von 2.000 Amiga1200 an das Unternehmen <A HREF="http://www.shafindia.com">Shaf Information &amp;
Teknologies PVT. LTD.</A> nach Indien. Es w&uuml;rde sich um den gr&ouml;&szlig;ten Auftrag
f&uuml;r AI aus Asien handeln, der jemals abgeschlossen wurde. Die Auslieferung
beginnt ab Februar 1998.
</P>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>
<P>
<A HREF="http://www.sasg.com/mwb/download.html">MagicWB 2.1p</A>, Vollversion des popul&auml;ren MagicWB-Sharewarepaketes, ist
jetzt kostenlos auf der WWW-Site von <A HREF="http://www.sasg.com">SASG</A> downloadbar.
</P>
<P><HR WIDTH="50%"></P>
<P>
<A HREF="http://www.schatztruhe.de">Stefan Ossowski`s Schatztruhe</A> bietet die neue Version 4 des bekannten
Texteditors <B>CygnusEd</B> f&uuml;r 69,- DM an. Updates kosten 39,- DM.
</P>
<P>
Zu den vielen neuen Features z&auml;hlen, neben h&ouml;herer Geschwindigkeit
und einer generellen Modernisierung, eine bessere Unterst&uuml;tzung von
Grafikkarten-WBEmulationen und unbegrenztes UNDO/REDO.
</P>
<P><HR WIDTH="50%"></P>
<P>
<A HREF="http://www.asimware.com">Asimware</A> ver&ouml;ffentlicht die neue Version 2.0 der CD-Brenner-Software
<B>MasterISO</B>. Sie soll von Grund auf &uuml;berarbeitet sein und durch besonders
hohe Stabilit&auml;t gl&auml;nzen.
</P>
<P>
Die Demoversion ist aus dem Aminet oder von der Website zu beziehen.
</P>
<P><HR WIDTH="50%"></P>
<P>
Auf Grund der gro&szlig;en Nachfrage hat sich <A HREF="http://www.cloanto.com">Cloanto</A> dazu entschlossen
bereits eine Vorversion 1.0 von <B>Amiga Forever</B> herauszubringen, da
die endg&uuml;ltige Fertigstellung sich noch verz&ouml;gert. Sie soll die
selbe Funktionalit&auml;t besitzen und sp&auml;ter zum Differenzpreis
upgradebar sein. Den Vertrieb &uuml;bernimmt Schatztruhe.
</P>
<P>
Diese Version enth&auml;lt u.a. die Amigaemulatoren UAE f&uuml;r Windows
(inklusive <A HREF="http://wwwcip.rus.uni-stuttgart.de/~etk10317/Picasso96/Picasso96.html">Picasso96</A>-Treiber),
sowie Fellow f&uuml;r DOS, die AmigaROM- und Workbench-Dateien bis OS 3.0 und Personal Paint 7.1.
</P>
<P><HR WIDTH="50%"></P>
<P>
Mit <B>SiSys 2.5</B> kommt von <B>HiQ</B> der Nachfolger von Siamese. Jetzt als reine
Softwarel&ouml;sung wird eine Bedienung unterschiedlicher Betriebssysteme
(AmigaOS 3.X, Win95/NT 4.0, MacOS) so erm&ouml;glicht, als wenn es sich um
einen Computer handeln w&uuml;rde. Der Datenaustausch erfolgt entweder &uuml;ber
Nullmodem oder &uuml;ber einen TCP/IP-Stack. Der deutsche Vertrieb erfolgt
&uuml;ber <A HREF="http://www.oberland.de">Oberland</A>.
</P>
<P><HR WIDTH="50%"></P>
<P>
Der <B>APC&amp;TCP</B> senkt ab Anfang 1998 einige Preise. In Klammern steht der
bisher g&uuml;ltige Preis:</P>
<BR>
<TABLE BORDER=0 ALIGN=CENTER>
<TR>
    <TH>Testament</TH><TD>39,95 DM</TD><TD>(59,95 DM)</TD><TH>Kargon</TH><TD>39,95 DM</TD><TD>(49,95 DM)</TD>
</TR>
<TR>
    <TH>Jaktar</HT><TD>30,95 DM</TD><TD>(59,95 DM)</TD><TH>Marblelous</TH><TD>9,95 DM</TD><TD>(19,95 DM)</TD>
</TR>
<TR>
    <TH COLSPAN="2">APC&amp;TCP-CD-Volume-1</TH><TD ALIGN="CENTER" COLSPAN="2">9,95 DM</TD><TD ALIGN="CENTER" COLSPAN="2">(19,95 DM)</TD>
</TR>                                                                                                                                    
<TR>                                                                                                                                     
    <TH COLSPAN="2">APC&amp;TCP-CD-Volume-2</TH><TD ALIGN="CENTER" COLSPAN="2">9,95 DM</TD><TD ALIGN="CENTER" COLSPAN="2">(19,95 DM)</TD>
</TR>
<TR>
    <TH ALIGN="CENTER" COLSPAN="6">APC&amp;TCP, Dorfstr. 17, D-83236 &Uuml;bersee</TD>
</TR>
</TABLE><BR>
</P>
<P><HR WIDTH="50%"></P>
<P>
<B>Nova Design</B> bietet allen ADPro-Benutzern ein <B>Crossupdate</B> auf ImageFX 2.6
f&uuml;r 179 US-Dollar an. Das Angebot gilt bis zum 28.Februar 1998. Einfach
die innere Cover-Seite der Anleitung von ADPro zusammen mit Scheck,
Geldanweisung oder Kreditkarteninformation an Nova Design einsenden.
</P><P>
Nova Design, Inc.; 1910 Byrd Avenue, Suite 204; Richmond, VA 23230; USA
</P>
<P><HR WIDTH="50%"></P>
<P>
Ab 1. Januar 1998 soll <B><A HREF="http://www.scala.com">Scala</A> Multimedia 400</B> nach Neupressung der CD
wieder erh&auml;ltlich sein. Der Preis mit einem Online-Handbuch betr&auml;gt
149,- DM (Update von MM 300 99,- DM). Den Vertrieb &uuml;bernimmt die
Firma <A HREF="http://www.nightshifts-web.com/">Nightshift</A>.
</P>
<P><HR WIDTH="100%"></P>
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>

<P>
<B>DCE</B> stellt von Amiga International lizensierte selbstentwickelte
<B>Amiga-Klones</B> her. Dazu siehe die <A HREF="comp97.htm">Computer 97</A>-Zusammenfassung.
</P>
<P><HR WIDTH="50%"></P>
<P>
<A HREF="http://www.cix.co.uk/~index/ ">Index</A>, der britische Hersteller, der durch seinen geplanten
Access-AmigaKlon bekannt geworden ist, hat auf der Computer 97 ein
eigenes Motherboard unter der Bezeichnung <B>BoXeR</B> vorgestellt.
</P>
<P>
Es soll mit MC68040 und 68060 mit Taktraten von 25 bis 75 MHz
erh&auml;ltlich werden. In die Platine wurden neben 4 Zorro-III-Slots
auch 2 ISA-Slots und ein Videosteckplatz integriert.
</P>
<P><HR WIDTH="50%"></P>
<P>
F&uuml;r den Uhrenport des Amiga 1200 befindet sich eine Soundkarte in der
Entwicklung. Die <B>Melody A1200</B>, basierend auf der Melody Z2 (f&uuml;r Amigas
mit Zorro-Bus), erm&ouml;glicht mit ihrer 20-Bit-Hardware MPEG-Dekompression,
sowie eine Soundausgabe in CD-Qualit&auml;t.
</P>
<P><HR WIDTH="50%"></P>
<P>
<B>Nova Sector Engineering</B>, eine amerikanische Computerfirma, will im
Fr&uuml;hjahr 1998 ein Amiga-kompatibles Notebook auf PPC-Basis ausliefern.
Der Prozessor soll mit 300 MHz arbeiten und der Preis ab 2.500 US-Dollar
beginnen.

<B>Kommentar:</B> Ger&uuml;chteweise soll lediglich der Emulator UAE f&uuml;r die
           Amiga-Kompatibilit&auml;t sorgen.
</P>
<P><HR WIDTH="50%"></P>
<P>
<A HREF="HTTP://www.villagetronic.com">Villagetronic</A> bietet mit <B>Concierto</B>
ein Soundmodul f&uuml;r die bekannte Grafikkarte Picasso IV an. Sie
kann Kl&auml;nge in CD-Qualit&auml;t erzeugen und hat einen Yamaha-Synthesizer-Chip
nach dem OPL3-Standard integriert. Der Preis liegt bei 299,- DM.
</P><HR>
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
<P>
Mit <B>The Final Odyssey</B> bringt <A HREF="http://www.vulcan.co.uk">Vulcan</A> ein
neues CD-Rom-Spiel auf den Markt, das auf jedem Amiga laufen soll, aber von
einer besseren Ausstattung Gebrauch macht. Das Jump`N`Run ist u.a. in Deutsch
f&uuml;r ca. 30 englische Pfund erh&auml;ltlich.
</P>
<HR WIDTH="50%">
<P>
<B>The World Foundry</B>, ein Zusammenschlu&szlig; der Entwicklerteams von Digital
Anarchy Software, Deimos Design und Intuition Software vom September 1997,
entwickeln ihre Spiele nun exklusiv f&uuml;r Vulcan. Als erstes werden von The
World Foundry <B>Explorer 2260</B> und <B>Maim & Mangle</B> erscheinen.
</P>
<P>
Damit hat Vulcan jetzt 14 verschiedene Entwicklungsteams mit &uuml;ber 100
Leuten unter Vertrag.
</P>
<P>
Au&szlig;erdem wird Vulcan Software die herausgebrachten Spiele nicht mehr
selbst vertreiben, sondern hat diese Aufgabe an <A HREF="http://www.weirdscience.co.uk">Weird Science</A>,
sowie <A HREF="http://http://www.grentrade.com/homeami.htm">GTI</A> abgegeben.
</P>
<P><HR WIDTH="50%"></P>
<P>
<A HREF="http://www.sadeness.demon.co.uk">Sadeness Software</A> k&uuml;ndigt
nach Foundation und OnEscapee zwei weitere Spiele f&uuml;r den Amiga an.
</P>
<P>
Bei <B>Dafel:Bloodline</B> (vorher als Child of Darkness bekannt) von dem
Team Digital Corruption soll es sich um eine Mischung aus Zelda und
StreetFighter handeln. Lauff&auml;hig auf jedem AGA-Amiga.
</P><P>
Das andere Spiel, das Sadeness vertreiben wird, ist <B>Forgotten Forever</B>,
eine Mischung aus Dune 2 und Command&Conquer, von dem schon im letzten
<B>Am Puls</B> berichtet wurde.
</P><P>
<B>OnEscapee</B> soll noch vor Weihnachten herauskommen, <B>Foundation</B> nicht
vor Januar/Februar 1998.
</P>
<P><HR WIDTH="50%"></P>
<P>
Neben <B>Uropa2</B> (<A HREF="../sw/9712uro.htm">Test</A> in dieser Ausgabe) bewirbt
<A HREF="http://www.schatztruhe.de">Schatztruhe</A> auch <B>Myst</B>
(mindestens 020 und 8 MB Ram) und <B>Shadow of the Third Moon</B> (mindestens
030 und AGA oder Grafikkarte), einen Voxel-Flugsimulator. Myst soll
99,- DM kosten, die anderen zwei Spiele je 89,- DM.
</P>
<P><HR></P>
<H2 ALIGN="CENTER"><A NAME="Sonstiges">Sonstiges</A></H2>
<P>
<A HREF="http://www.gw2k.com">Gateway 2000</A> hat im dritten Quartal 97, trotz um 25 Prozent gesteigertem
Umsatz, 107 Millionen Dollar Verlust gemacht, gegen&uuml;ber 60 Millionen
Dollar Gewinn im Vorjahreszeitraum. Gr&uuml;nde seien au&szlig;ergew&ouml;hnliche
Belastungen in H&ouml;he von 113,8 Millionen Dollar, zu denen die &Uuml;bernahme
der Firma <B>Advanced Logic Research</B> (ALR) mit 60 Millionen, sowie
Verm&ouml;genswerte von <A HREF="http://www.amiga.de">Amiga Technologies</A> und Wertverluste durch zu
gro&szlig;e Lagerbest&auml;nde z&auml;hlen.
</P>
<P><HR WIDTH="50%"></P>
<P>
Spekulationen, nach denen die deutsche Gateway 2000-Niederlassung
geschlossen werden soll, scheinen sich nicht zu best&auml;tigen. <B>Karola</B>
<B>Bode</B>, fr&uuml;her Pressesprecherin bei Commodore Deutschland und seit 1994
Gesch&auml;ftsf&uuml;hrerin der deutschen GW-Tochter, verl&auml;&szlig;t das
Unternehmen. Au&szlig;erdem wird der Showroom in Frankfurt geschlossen.
Die weiteren zwei Standorte M&uuml;nchen und K&ouml;ln bleiben bestehen.
</P>
<P><HR WIDTH="50%"></P>
<P>
Das <A HREF="http://www.w3.org">W3-Konsortium</A>, zust&auml;ndig f&uuml;r die Weiterentwicklung des WWW-Standards,
hat die <B>HTML 4.0</B>-Empfehlung verabschiedet. Neben Verbesserungen bei
Formularen, Frames und Tabellen werden Objekte, Skripte und Style Sheets
eingef&uuml;hrt.
</P>

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712p5hp.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

