<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Der alte Postsack</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>Der alte Postsack</U></H1>
<P>Heute gibt es neben den Leserbriefen, die gleich im Anschlu&szlig; folgen,
auch einen Extraabschnitt, der dokumentiert, da&szlig; wir mit den Firmen,
deren Produkte wir testen, in Kontakt kommen wollen.</P><P>
Wie unterschiedlich diese Reaktionen ausfallen k&ouml;nnen, ist schon
beeindruckend. Unser &quot;Zeitschriftenalltag&quot; wird so jedenfalls
ganz gewi&szlig; nicht langweilig!</P>
<P>&Uuml;berzeugen Sie sich hier warum: <A HREF="ps2.htm">Firmenkontakte</A></P>
<HR>
Nun aber wie gewohnt zu den versprochenen Leserbriefen:
<PRE>
      <B> Absender: zxbrand@berlin.snafu.de (<A HREF="mailto:zxbrand@berlin.snafu.de">Christian Brand</A>) </B>

<B>CB&gt;</B> Hallo Leute,
<B>CB&gt;</B>
<B>CB&gt;</B> Mit entz&uuml;ckender Fasination habe ich Eure Ausgabe 09/97 gelesen.
<B>CB&gt;</B> Obwohl ich alle noch vorhandenen Amiga-Zeitschriften lese, (auch
<B>CB&gt;</B> die dt. im Aminet) habe ich seit langer Zeit so etwas tolles nicht
<B>CB&gt;</B> mehr gesehen.
<B>CB&gt;</B>
<B>CB&gt;</B> Wie Ihr sicherlich merkt, bin ich begeistert :-)).

Was uns ehrlich freut. :)

<B>CB&gt;</B> Der Inhalt ist ziemlich umfangreich und ich habe l&auml;nger und
<B>CB&gt;</B> interessierter gelesen als in jedem anderen Mag.
<B>CB&gt;</B>
<B>CB&gt;</B> Ich kann nur sagen -Rundum gelungen-, Aktuell, tolle Interviews,
<B>CB&gt;</B> klasse Rubriken. - Weiter so.

Wir geben uns M&uuml;he!

<HR>

    <B> Absender: markus.lamers@tu-clausthal.de (<A HREF="mailto:markus.lamers@tu-clausthal.de">Markus Lamers</A>) </B>

<B>ML&gt;</B> Hi AmZeiger,
<B>ML&gt;</B>
<B>ML&gt;</B> lese gerade eure News Seite ...
<B>ML&gt;</B>
<B>ML&gt;</B> a) ist der link zur GG2+ Homepage kaputt, im Source fehlt das
<B>ML&gt;</B>    &quot;http://&quot;

Danke f&uuml;r den Tip. Trotz aller Sorgfalt schleichen sich doch
gelegentlich solcherlei Fehler ein.

<B>ML&gt;</B> b) was hei&szlig;t hier in Zukunft !?
<B>ML&gt;</B>    Die Karte ist schon relativ und bei mir ist sie schon seit
<B>ML&gt;</B>    Jahren im Einsatz. Ich habe sie mir gekauft, weil mir die
<B>ML&gt;</B>    Amiga Ethernetkarten zu teuer waren. Ich benutze sie zusammen
<B>ML&gt;</B>    mit einer NE2000 kompatiblen Ethernetkarte und bin sehr
<B>ML&gt;</B>    zufrieden damit.

Der Pressemitteilung, aus welcher diese Meldung dann resultierte,
war das eigentlich anders zu entnehmen.

<B>ML&gt;</B> Gru&szlig;,
<B>ML&gt;</B>   Markus

Jedenfalls sind wir durchaus auch mal froh, solche Post mit Hinweisen
zu erhalten.

<HR>

       <B> Absender: T.Heinrich@t-online.de (<A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A>) </B>

<B>TH&gt;</B> Hallo, Ihr da AmZeiger !
<B>TH&gt;</B>
<B>TH&gt;</B> Vor ca. zwei Stunden habe ich eure Online-Zeitung aus dem Aminet
<B>TH&gt;</B> gefischt und bin nun fertig mit der HTML-Lekt&uuml;re (von vorn bis hinten
<B>TH&gt;</B> - ganz durch. Ehrlich !)

Sehr l&ouml;blich! :)

<B>TH&gt;</B> Ich mu&szlig; sagen: Hut ab. Ihr habt wirklich gute Arbeit geleistet. Die
<B>TH&gt;</B> Informationen, die ihr anbietet sind recht aktuell und gut hinterfragt.
<B>TH&gt;</B> Besonders gut gef&auml;llt mir die deutliche Abgrenzung der Kommentare zur
<B>TH&gt;</B> Meldung. Das ist leider nicht immer so, oft wird Meinung und Meldung
<B>TH&gt;</B> vermischt.

Nicht mit uns...

<B>TH&gt;</B> Was mir an der HTML-Ausgabe nicht gef&auml;llt, ist das, was mir auch an
<B>TH&gt;</B> den meisten Web-Seiten den Spa&szlig; vermiest: Die Hintergrundgrafik !
<B>TH&gt;</B>So eine Kachel mag ja sch&ouml;n aussehen, aber um der Geschwindigkeit
<B>TH&gt;</B> meiner seriellen Schnittstelle (nein, eigentlich wegen der meines
<B>TH&gt;</B> Amigas ;^) willen, surfe ich eben nicht in Hi- oder Truecolor sondern
<B>TH&gt;</B> nur mit 256 Farben. Und dann wird ein Hintergrundbild eben gedithert.
<B>TH&gt;</B> Was nat&uuml;rlich ziemlich k&ouml;rnig aussieht. Wenn dann noch Text dar&uuml;ber
<B>TH&gt;</B> steht, kann man nur noch mit tr&auml;nenden Augen lesen. Deshalb: Lieber

Erst einmal mu&szlig; ich zu unserer Schande gestehen, da&szlig; es uns vorher
nicht aufgefallen war, denn bei ca. 16.000 Farben z.B. sieht das
prima aus. :)

<B>TH&gt;</B> ein einfarbig heller Hintergrund (am besten wei&szlig; mit leichten
<B>TH&gt;</B> Gelbstich - soll die Lesbarkeit f&ouml;rdern, allerdings nur rein optisch,
<B>TH&gt;</B> nicht inhaltlich).

Da sind wir dagegegen. Denn man kann ja beim Browser, zumindest z.B. bei
IBrowse die vom Dokument vorgegebenen Farben und Hintergr&uuml;nde ignorieren
lassen und hat dann z.B. augenschonendes Grau.

Das ist das, was ich fuer die vergangenen Ausgaben empfehlen kann. ;)

F&uuml;r die n&auml;chsten werden wir aber Deinen Hinweis beherzigen und uns
einen neuen, besseren (und auch mit 256 Farben getesteten) Hintergrund
zulegen.

<B>TH&gt;</B> Nun zu etwas ganz anderem: Ich bin auch so ein AmigaMagazin Leser
<B>TH&gt;</B> (seit Sommer 1990...) und inzwischen (seit einem Jahr) zu dem Schlu&szlig;
<B>TH&gt;</B> gekommen, da&szlig; die Zeitschrift sich von einer stabilen &quot;Gut&quot;-Wertung
<B>TH&gt;</B> zu einem wackeligen &quot;Ausreichend&quot; zur&uuml;ckentwickelt hat. Seither lese
<B>TH&gt;</B> ich parallel auch die c't, damit ich nichts Wichtiges auf dem
<B>TH&gt;</B> Computermarkt verpasse.

Das es sich um ein Ende auf Raten handelt, ist wohl selbst Optimisten
schon seit einiger Zeit klar geworden.

<B>TH&gt;</B> Noch was anderes: Ihr habt zu wenig Hardwaretests ? Wie gerne h&auml;tte
<B>TH&gt;</B> ich Euch einen Test der Hypercom 4 Schnittstellenkarte zukommen
<B>TH&gt;</B> lassen. Das Ding habe ich am 10. Januar 1997 bestellt - und gestern,
<B>TH&gt;</B> den 19. September 1997 wieder abbestellt, da immer noch kein
<B>TH&gt;</B> endg&uuml;ltiger Liefertermin in Aussicht ist. Ich steige jetzt auf
<B>TH&gt;</B> internen ISDN-Adapter um. Mal sehen, wie lange das dauert.

Sch&ouml;n, das es geklappt hat, denn dadurch haben wir einige gute Artikel
mehr in dieser Ausgabe. :)

<B>TH&gt;</B> Naja, es ist sp&auml;t nachts, ich fange schon an zu tr&auml;umen.
<B>TH&gt;</B> Dann gute Nacht,
<B>TH&gt;</B> Hoin.

Guten Morgen!

<HR>

            <B> Absender: Niffi@t-online.de (<A HREF="mailto:Niffi@t-online.de">Niffi</A>) </B>

<B>N&gt;</B> Hi,
<B>N&gt;</B>
<B>N&gt;</B> ich lese echt gerna Amiga Mags und
<B>N&gt;</B> bin somit auch auf Eures gekommen.
<B>N&gt;</B> Nun als erstes... viel Gl&uuml;ck!
<B>N&gt;</B> Ich glaube jedes Mag hat irgendeine
<B>N&gt;</B> Zukunft, so da&szlig; Eures sicher auch noch
<B>N&gt;</B> ein Weilchen bestehen wird.

Das hoffen wir mal.

<B>N&gt;</B> Aber leider habe ich auch einwenig
<B>N&gt;</B> Kritik - ich hoffe es ist mir gestattet
<B>N&gt;</B> zu kritisieren???!!!

Klar. Wir wollen wissen, was unsere Leser denken.

<B>N&gt;</B> Ihr habt ja vor, den AmZeiger nur alle
<B>N&gt;</B> drei Monate rausbringen wollt. Nun dagegen
<B>N&gt;</B> ist in erster Linie nichts auszusetzten,
<B>N&gt;</B> Eure zweite Ausgabe, welche ja auch 3
<B>N&gt;</B> Monate Zeit gebraucht hat, ist recht mager.
<B>N&gt;</B> Also f&uuml;r 3 Monate zeit sollte echt mehr drinn
<B>N&gt;</B> sein! Mein Vorschlag, jeden Monat oder alle
<B>N&gt;</B> 2 Monate, da drei Monate einfach zulang sind.

Das w&uuml;rde bedeuten, da&szlig; wir die Artikel schon lange fertig haben
und nur so lange warten, damit wir nicht zu oft erschienen? ;)

So ist es nicht! Das Problem ist, da&szlig; wir neben der T&auml;tigkeit f&uuml;r
diese Zeitschrift auch noch einiges anderes zu tun haben.

Man darf nicht vergessen, da&szlig; in den ersten beiden Ausgaben die
Artikel im wesentlichen von zwei (!) Leuten geschrieben wurden.
Und an so einem Magazin h&auml;ngt noch einiges mehr dran, als
lediglich Artikel zu schreiben.

Kurz: Wir machen das in unserer Freizeit und unentgeltlich und
haben den Dreimonats-Rhythmus eingef&uuml;hrt, damit wir (hoffentlich)
den Termin einhalten k&ouml;nnen.

<B>N&gt;</B> News sind unaktuell und Spieltest`s kennt
<B>N&gt;</B> eh schon jeder, also solange w&uuml;rde ich nicht
<B>N&gt;</B> waten bis zur n&auml;chsten Ausgabe.

Die Nachrichten sind zum Teil unaktuell. Ganz klar. Ein ganz guter
&Uuml;berblick, was in diesem Zeitraum im Amiga-Bereich abgelaufen ist.

(&Uuml;brigens wird der Begriff News von uns auch nirgends verwendet.)

Doch das ist auch nicht unser Ziel. Fuer News gibt es andere
Publikationen, die monatlich erscheinen und mit einem wesentlich
geringeren Aufwand die angefallenen Pressemitteilungen und
Neuigkeiten ver&ouml;ffentlichen.

Wir versuchen wie eine `echte` Zeitschrift, richtige Artikel zu
bestimmten Themen zu bieten oder Tests.

Das Spieltests schon jeder kennt, w&uuml;rde ich nicht sagen, und
insbesondere gibt es da ganz interessante Unterschiede in den
Bewertungen verschiedener Magazine. Da ist eine Meinung mehr
f&uuml;r den Kaufinteressenten sicherlich nicht uninteressant.

<B>N&gt;</B> Was hei&szlig;t eigentlich &quot;AmZeiger&quot;???

Eine ziemlich detaillierte Erkl&auml;rung steht in der Postsack-Rubrik
der letzten Ausgabe.

Nur soviel: Es kommt von &quot;Der (z.B. Bonner) Anzeiger&quot;, also
vom Namen her an diese Zeitungen erinnernd. Das `Am` steht dann
nat&uuml;rlich f&uuml;r Amiga. `Zeiger` k&ouml;nnte man auch auf Mauszeiger
beziehen (siehe Maskottchen.)

<B>N&gt;</B> Gut ich hoffe dies war nicht zuviel Kritik?

Nein.

Das man ungerne drei Monate auf die n&auml;chste Ausgabe einer Zeitschrift
wartet, ist uns klar, aber wir handhaben das lieber so, als das uns
nach ein paar wenigen Ausgaben die Luft ausgeht.

&Uuml;ber Artikel-Einsendungen, die uns ohne Mehraufwand die Ausgabe
anf&uuml;llen, w&uuml;rden und werden wir uns immer freuen.

Dann w&auml;re das kein Problem mit einer `dickeren` Ausgabe.

</PRE>
<HR WIDTH="50%">
<P>Davon abgesehen, hat sich &uuml;brigens mit der n&auml;chsten Antwort
herausgestellt, da&szlig; `Niffi` selbst ein Amiga-Onlinemagazin macht.</P>
<P>Nun m&ouml;chte ich mich dazu nicht weiter &auml;u&szlig;ern, au&szlig;er das ich es ein
wenig seltsam finde `inkognito` Leserbriefe zu verfassen und nicht
gleich mit `offenem Visier` zu schreiben und unterschreiben.</P>
<HR WIDTH="50%">
<P>
Wie immer schlie&szlig;e ich mit dem Wunsch auf Leserbriefe, Kommentare,
Hinweise und Kritiken, ohne die diese Rubrik jeden Sinnes entbehren
w&uuml;rde,</P>

Euer<BR>
<B>Alter Postsack</B>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="uhl.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="ps2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

