<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Frau Gisela`s Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>Frau Gisela`s Problemecke</U></H1></CENTER>
<p><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.</P>
<HR>
<DIV ALIGN=CENTER><B>Drei wichtige Anmerkungen:</B></DIV>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR>
<P>Wie schon in der letzten Ausgabe des AmZeigers &uuml;bernimmt diesmal wieder
Andreas die Rolle der Frau Gisela :) Dein Publikum, Andreas:</P>
<!-- Haha, als ob ich auf sowas stehen w&uuml;rde. -->

<B>Korrektur zur letzten Ausgabe:</B>
<P>In der letzten Ausgabe stand, da&szlig; der DOpus Befehl &quot;Set Mode Icon&quot; nur auf
den aktuellen Quelldateilister wirkt. Dies ist (gl&uuml;cklicherweise :) falsch
(auch wenn es in der Anleitung steht). Der Befehl wirkt immer auf den
aktiven Lister und stellt damit die einfachste L&ouml;sung des Problems da.</P>

<B>Tip zu MicroDot</B>

<TABLE BORDER=1>
<TR BGCOLOR="#FFFFFF">
    <TD>Frage:</TD>
    <TD>
    <P>Es ist zwar sch&ouml;n, da&szlig; MicroDot automatisch ein Backup von meinen
    Pointpuffern anlegt, jedoch n&uuml;tzen sie mir nur bedingt, z.B. bei
    einem Festplattencrash, wenn meine Nachrichten alle fehlen.</P>
    <P>K&ouml;nnte nicht auch ein Backup vom meinem &quot;caller.lha&quot; angelegt
    werden?</P>
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TD>
        Antwort:
    </TD>
    <TD>
    <P>Direkt unterst&uuml;tzt MicroDot die Funktion nicht, jedoch liegt
    dieser Ausgabe des AmZeigers ein <A HREF="tools.lha">ARexx-Script</A> bei, das diese
    Funktion &uuml;bernimmt.</P>
    <P>Momentan verwendet das Script nur LhA, wenn ein weiterer Packer
    unterst&uuml;tzt werden soll, schreibt mir.</P>
    <P>Nach dem Entpacken des Archivs liegt das Script im Verzeichnis
    &quot;MDSP&quot;. Die Datei &quot;MDSP.rexx&quot; mu&szlig; ins Verzeichnis &quot;Rexx:&quot; kopiert
    werden und mit einem Texteditor, wie z.B. <A HREF="http://www.clearlight.com/~dietmar/">GoldED</A> editiert werden.</P>
    <P>Am Anfang des Scripts gibt es drei Zeilen, mit denen die Optionen
    eingestellt werden k&ouml;nnen. Die Optionen bedeuten:</P>
    <B>Pfad_Transfer</B>
    <P>Diese Variable spezifiziert den Pfad zum Transfer-Verzeichnis
    von MicroDot.</P>
    <B>Pfad_Backup</B>
    <P>Diese Variable spezifiziert den Pfad zum Verzeichnis, in das die
    Backups kopiert werden soll.</P>
    <B>Name_Backup</B>
    <P>Mit dieser Variable wird angegeben, wie der Name der Backups
    beginnen soll. Achtung: Da der Dateiname im gleichen Format
    endet, wie die Backups von MicroDot, darf die Variable nicht
    dem Namen der BBS entsprechen, wenn MicroDot und das Script die
    Backups im gleichen Verzeichnis kopieren soll. Es empfiehlt sich
    daher entweder getrennte Verzeichnisse zu verwenden oder die
    Variable auf einen anderen Namen zu setzen, als den Boxnamen.</P>
    </TD>
</TR>
</TABLE>
<P>Soweit meine Antworten... :-)</P>
<P>Euer<BR><BR>
<A HREF="mailto:A.Schlick@BBrandes.in-brb.de">Andreas Schlick</A>.
</P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

