<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf die Nervensäge</title>
</head>
<body background="../wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>
<table width=100% border=0 cellpadding=8><tr><td>
<center><img src="st_euro.gif" width=300 height=44 border=0 alt="der Euro kommt">
</center>
<br>

<p>Bald hei&szlig;t es Abschied nehmen von lieb gewonnen Groschen, von
Clara Schumann auf den Hundert-Mark-Scheinen. Das Euro-Bargeld r&uuml;ckt
n&auml;her. Wann der Euro-Treck losrollt und wie die gr&ouml;&szlig;te
deutsche Umtauschaktion aller Zeiten ablaufen soll, wei&szlig; man schon,
ahnt aber Schlimmes. </p>

<p>Rund 100.000 Tonnen Pfennig- und D-Mark-M&uuml;nzen m&uuml;ssen im Zuge
der Euro-Einf&uuml;hrung eingesammelt werden. Das sind 28,5 Milliarden
St&uuml;ck. Um den erwarteten Andrang f&uuml;r den Bargeldtausch Anfang
2002 zu entzerren, raten die Banken dazu, bereits jetzt Spardosen zu leeren
und das Bargeld auf Konten einzuzahlen. </p>

<p>Fast 60 Prozent der Deutschen sind der Auffassung, dass der Euro
langfristig ein Erfolg sein wird&quot;, sagte Dr. Manfred Weber,
Hauptgesch&auml;ftsf&uuml;hrer und Vorstandsmitglied des Bankenverbandes
(BdB), anl&auml;sslich der Vorstellung einer neuen Euro-Brosch&uuml;re des
Verbandes. Interessant sei dabei vor allem, dass die Zahl seit Oktober
vergangenen Jahres um 12 Prozentpunkte angestiegen sei. Der Euro sei damit
schon heute, gut zwei Jahre nach seiner Einf&uuml;hrung als Buchgeld, ein
Erfolg - trotz der Vorbehalte, die immer noch best&uuml;nden.&quot;Worauf
es jetzt ankommt, ist eine hohe Akzeptanz f&uuml;r den Euro bei den
B&uuml;rgern zu schaffen&quot;. </p>

<p>Im Zusammenhang mit der Einf&uuml;hrung des Euro bzw. des Euro-Bargeldes
f&uuml;rchteten die Deutschen vor allem die Gefahr von Preissteigerungen.
Gerade diese Sorge habe sich jedoch als unbegr&uuml;ndet erwiesen. In den
letzten f&uuml;nf Jahren habe die Preissteigerungsrate im Euro-Raum im
Durchschnitt bei 1,9 Prozent pro Jahr, in Deutschland sogar nur bei 1,2
Prozent gelegen. Der gegenw&auml;rtige Anstieg der Inflationsrate auf 3,5
Prozent sei in aller erster Linie auf Sondereffekte (Energiepreise,
&Ouml;kosteuer, BSE und Maul- und Klauenseuche) zur&uuml;ckzuf&uuml;hren,
die auch bei der D-Mark aufgetreten w&auml;ren.</p>

<p>Was Sicherheit und Logistik in Zusammenhang mit der
Euro-Bargeldeinf&uuml;hrung angehe, sei man inzwischen auf einem guten Weg,
so der Bankenverband. Alle erforderlichen Rahmenbedingungen f&uuml;r eine
reibungslose Euro-Einf&uuml;hrung seien geschaffen worden. Auch die
Tarifparteien h&auml;tten ihre Hausaufgaben gemacht und notwendige
Ausnahmen bei der Arbeitszeit vereinbart. &quot;Jetzt sind die
zust&auml;ndigen Beh&ouml;rden der Bundesl&auml;nder gefordert&quot;, so
Weber, &quot;die Vorschl&auml;ge bis auf die kommunale Ebene
umzusetzen.&quot;</p>

<p>In Punkto Information der B&uuml;rger bliebe allerdings noch einiges zu
tun. Erst rund die H&auml;lfte der Deutschen habe sich bisher damit
besch&auml;ftigt, welche Auswirkungen die Umstellung auf den Euro f&uuml;r
sie pers&ouml;nlich haben werde. Dies gelte h&auml;ufig auch f&uuml;r
Firmenkunden. Insbesondere kleinere Einzelhandelsunternehmen seien nach
Erkenntnissen der privaten Banken in vielen F&auml;llen noch nicht
ausreichend auf die Bargeldumstellung vorbereitet. Die Euro-Brosch&uuml;re
bietet daher u.a. spezielle Checklisten f&uuml;r Firmenkunden an.</p>

<p>Neben den politischen Erw&auml;gungen f&uuml;r die Euro-Einf&uuml;hrung
und den bisherigen Erfahrungen mit dem Euro enth&auml;lt die Brosch&uuml;re
des Bankenverbandes den genauen Zeitplan f&uuml;r die Euro-Einf&uuml;hrung. <br>
Dargestellt sind au&szlig;erdem der rechtliche Rahmen, das konkrete
Einf&uuml;hrungsprocedere des neuen Bargelds sowie die einzel- und
gesamtwirtschaftlichen Auswirkungen der W&auml;hrungsumstellung. </p>

<p>Wer sich wirklich für diese 70-seitige Brosch&uuml;re interessiert, geht
einfach auf die Web-Site <b>www.bankenverband.de</b> und klickt sich durch
über Euro-Spezial und auf der rechten Seite "Euro-Brosch&uuml;ren". Ihr
gebt Namen, Adresse und eMail an und dann kommt der Hinweis: Vielen Dank
für Ihr Interesse! Wir werden Ihre Bestellung so schnell wie möglich
bearbeiten. Wer diese Website noch nicht verlassen will, schaut im linken
Frame einfach Unter Aktuell, Scheine&Münzen, Bargeld-Einführung oder unter
Euro in der Praxis nach. </p>

<p>In meinem ersten Artikel, der scheinbar gut angekommen ist, habe ich die
Münzen etwas stiefmütterlich behandelt. Das möchte ich heute nachholen. In
diesem Zusammenhang auch noch einmal eine kurze Zusammenfassung der Scheine. </p>

<p>Damit Blinde und Sehbehinderte die Nennwerte der Noten ertasten
k&ouml;nnen, wurden entsprechende Merkmale in die Banknoten eingearbeitet.
Einige Elemente der Banknoten sind mit einer speziellen Drucktechnik
(Stichtiefdruck) als Relief gedruckt. Die 200- und
500-Euro-Banknoten sind auf den R&auml;ndern mit speziellen, ertastbaren
Mustern versehen, die das Erkennen erleichtern. </p>
                          
<p>Ferner ist der Nennwert der Banknoten in gro&szlig;en Ziffern mit
kontrastreichen, dominanten Farben aufgedruckt. Au&szlig;erdem wurde darauf
geachtet, dass aufeinander folgende Banknotenwerte deutliche Farbkontraste
aufweisen.</p>

<p>Auch die M&uuml;nzen weisen klare Unterscheidungsmerkmale auf. Dazu
geh&ouml;ren die unterschiedlichen Gewichte. Je schwerer eine M&uuml;nze
ist, umso h&ouml;her ist ihr Wert. Das Gleiche gilt f&uuml;r die Dicke der
Cent-M&uuml;nzen  je dicker eine M&uuml;nze ist, desto h&ouml;her ist
ihr Wert. Die Nennwerte erscheinen gut sichtbar auf der einheitlichen
europ&auml;ischen Seite. Auf der R&uuml;ckseite jeder M&uuml;nze sind
vertraute Motive der bisherigen nationalen W&auml;hrungen eingepr&auml;gt.</p>


<p>Zum Schutz vor F&auml;lschungen werden die Banknoten mit einer Reihe von 
Sicherheitsmerkmalen versehen. Dazu geh&ouml;ren die Oberfl&auml;chenstruktur 
des Papiers und das Stichtiefdruckrelief </p>

<ul>
  <li>fluoreszierende Fasern und ein Wasserzeichen, das
    sich mit Kopier- oder Drucktechniken nicht ohne weiteres
    reproduzieren l&auml;sst</li>
  <li>Sicherheitsfaden </li>
  <li>Durchsichtsregister </li>
  <li>spezielle Folien </li>
  <li>spezielle Druckfarben.</li>
</ul>

<p> Die Euro-Banknoten werden auch mit maschinenlesbaren Merkmalen
ausgestattet, damit Automaten die Echtheit der Banknoten eindeutig
feststellen k&ouml;nnen.</p>

<p>Zum Einbau dieser Sicherheitsmerkmale wurde die modernste Technik
eingesetzt. F&auml;lschungen werden hierdurch erheblich erschwert.
Allerdings wird es immer F&auml;lschungsversuche geben. Insbesondere in der
Anfangsphase, in der man erst noch das Gef&uuml;hl f&uuml;r die neuen
Banknoten entwickeln muss, sollte jeder auf die Echtheit der Banknoten
achten. Die Einzelheiten zu den Echtheitsmerkmalen werden von der
Europ&auml;ischen Zentralbank im September 2001 ver&ouml;ffentlicht.</p>

<p>Auch die Euro-M&uuml;nzen werden so gepr&auml;gt, dass F&auml;lschungen
leicht erkennbar sind. So werden die 1- und 2-Euro-M&uuml;nzen in einer
speziellen, besonders f&auml;lschungssicheren Bimetalltechnik hergestellt.
Der Rand der 2-Euro-M&uuml;nze wird mit einer Schriftpr&auml;gung versehen.
Die Euro-M&uuml;nzen weisen au&szlig;erdem maschinenlesbare Merkmale auf.
</p>

<p>Die Euro-M&uuml;nzen werden durch die Regierungen der beteiligten
Staaten ausgegeben. Die Einnahmen aus dem M&uuml;nzgewinn kommen den
jeweiligen Staatshaushalten zugute. Das Volumen muss durch die
Europ&auml;ische Zentralbank genehmigt werden. </p>

<p><img src="st_euroall.jpg" width="340" height="220" align=left hspace=6>
                     
Acht verschiedene M&uuml;nzen werden ausgegeben. Sie lauten auf 1, 2, 5,
10, 20 und 50 Cent sowie 1 und 2 Euro. Sie unterscheiden sich in
Gr&ouml;&szlig;e, Farbe und Dicke. Die M&uuml;nzvorderseiten sind in allen
zw&ouml;lf Teilnehmerstaaten identisch. Sie zeigen stilisierte Landkarten
von Europa, umgeben von den zw&ouml;lf Sternen der Europ&auml;ischen Union
sowie den M&uuml;nzwert. Im Gegensatz zu den Banknoten sehen die in den
einzelnen Teilnehmerl&auml;ndern ausgegebenen M&uuml;nzen auf der
R&uuml;ckseite unterschiedlich aus. Dort kann jeder Teilnehmerstaat eigene,
nationale Symbole abbilden. </p>

<p>Die M&uuml;nzen gelten jedoch ohne Einschr&auml;nkung in allen
Teilnehmerl&auml;ndern des Euro-Raums als gesetzliche Zahlungsmittel. Die
unterschiedlichen R&uuml;ckseiten geben letztlich nur wieder, in welchem
Land die M&uuml;nze gepr&auml;gt wurde. Trotz der verschiedenartigen
R&uuml;ckseiten k&ouml;nnen die M&uuml;nzen in allen M&uuml;nzautomaten des
gesamten Euro-W&auml;hrungsgebiets verwendet werden.</p> <hr>

<p><img src="st_eurod.gif" width="52" height="45" align=left>
Die deutschen M&uuml;nzen tragen auf den 1-, 2- und 5-Cent-Werten einen
Eichenzweig, auf den 10-, 20- und 50-Cent-M&uuml;nzen das Brandenburger Tor
und auf den 1- und 2-Euro-M&uuml;nzen den deutschen Adler. <br clear=all>
<img src="st_eurod1.jpg" width="85" height="85">
<img src="st_eurod2.jpg" width="85" height="85">
<img src="st_eurod3.jpg" width="85" height="85"><hr></p>

<p><img src="st_euroa.gif" width="52" height="45" align=left>
Die &Ouml;sterreicher zeigen eine breite Palette ihrer Sch&auml;tze aus
Kultur und Natur: Friedensk&auml;mpferin Bertha von Suttner und Mozart
zieren die Spitzenwerte, die Architektur Wiens wird mit Schloss Belvedere,
dem Stephansdom und der Secession auf den mittleren Werten gefeiert. Die
Flora-Sch&auml;tze Enzian, Edelwei&szlig; und Alpenprimel sind auf den
R&uuml;ckseiten der kleinsten M&uuml;nzen zu entdecken. <br clear=all>
<img src="st_euroa.jpg" width="335" height="170"><hr></p>

<p><img src="st_eurob.gif" width="52" height="45" align=left>
Auf allen M&uuml;nzen ist das Portr&auml;t des belgischen K&ouml;nigs
Albert II. zu sehen. F&uuml;r die Wallonen, Flamen und die deutschsprachige
Gemeinschaft ist das K&ouml;nigshaus das verbindende Element. <br clear=all>
<img src="st_eurob.jpg" width="85" height="85"> <hr></p>

<p><img src="st_euroe.gif" width="52" height="45" align=left>

K&ouml;nig Juan Carlos prangt auf den 1- und 2-Euro-M&uuml;nzen der
Spanier. Miguel Cervantes, Autor des weltber&uuml;hmten Romans Don
Quixote, ist auf den mittleren M&uuml;nzen zu sehen. An den weltweit
ber&uuml;hmten Wallfahrtsort Santiago de Compostela erinnern die kleinen
Cent-M&uuml;nzen mit einer Abbildung der Kathedrale. <br clear=all>
<img src="st_euroe1.jpg" width="85" height="85">
<img src="st_euroe2.jpg" width="85" height="85">
<img src="st_euroe3.jpg" width="85" height="85"><hr></p>

<p><img src="st_eurof.gif" width="52" height="45" align=left>

Den Stolz auf die Fruchtbarkeit ihres Landes zeigen die Franzosen mit dem
Baum auf den 1- und 2-Euro-M&uuml;nzen. Hinzu kommt die S&auml;erin auf den
drei mittleren M&uuml;nzst&uuml;cken. Das Nationalsymbol, die Marianne,
ziert die kleinen Cent-St&uuml;cke. <br clear=all>
<img src="st_eurof1.jpg" width="85" height="85">
<img src="st_eurof2.jpg" width="85" height="85">
<img src="st_eurof3.jpg" width="85" height="85"><hr></p>

<p><img src="st_eurofi.gif" width="52" height="45" align=left>
Die weit verbreitete Moltebeere ist auf der finnischen 2-Euro-M&uuml;nze
abgebildet. Zwei Schw&auml;ne fliegen &uuml;ber die R&uuml;ckseite der
1-Euro-M&uuml;nze. Das finnische Wappentier, der L&ouml;we, thront auf
allen Cent-St&uuml;cken. <br clear=all>
<img src="st_eurofi1.jpg" width="85" height="85">
<img src="st_eurofi2.jpg" width="85" height="85">
<img src="st_eurofi3.jpg" width="85" height="85"><hr></p>

<p><img src="st_eurogr.gif" width="52" height="45" align=left>
Auf der R&uuml;ckseite der griechischen 1-Euro-M&uuml;nze ist eine Eule
abgebildet. Diese stammt von der antiken Drachme und erinnert an die Wiege
der europ&auml;ischen Idee. Auch die Europa auf der 2-Euro-M&uuml;nze
verk&ouml;rpert diese Wurzeln. Nationalhelden auf den mittleren M&uuml;nzen
feiern das moderne Griechenland. Schiffe aus drei verschiedenen Epochen
verk&ouml;rpern auf den kleinsten Geldst&uuml;cken die weltoffene Tradition
der griechischen Seefahrernation. <br clear=all>
<img src="st_eurogr.jpg" width="335" height="170"><hr></p>

<p><img src="st_euroi.gif" width="52" height="45" align=left>
Die Italiener konnten &uuml;bers Fernsehen ihre Versionen bestimmen. Sie
w&auml;hlten haupts&auml;chlich kulturelle Motive: Dantes Portr&auml;t und
Leonardos Vitruvianischer Mann zieren die Euro-M&uuml;nzen, Botticellis
Venus die 10-Cent-M&uuml;nze. Auf den weiteren Cent-St&uuml;cken sind die
Reiterstatue des Kaisers Marc Aurel (50), das Collosseum (5), das
ber&uuml;hmte Oktagon von Castel del Monte (1), die moderne Skulptur
Symbol (20) und die Turmspitze der Turiner Mole Antoniella (2)
abgebildet. <br clear=all>
<img src="st_euroi.jpg" width="335" height="170"><hr></p>

<p><img src="st_euroirl.gif" width="52" height="45" align=left>
Auf allen irischen Euro- und Centm&uuml;nzen ist das Nationalsymbol, die
Harfe, zu sehen. <br clear=all>
<img src="st_euroirl.jpg" width="85" height="85"><hr></p>

<p><img src="st_eurol.gif" width="52" height="45" align=left>
Das kleinste Euroland schm&uuml;ckt seine Euro-M&uuml;nzen mit einer
Profilansicht des Gro&szlig;herzogs Henri aus dem traditionsreichen Haus
derer von Luxemburg. <br clear=all>
<img src="st_eurol1.jpg" width="85" height="85">
<img src="st_eurol2.jpg" width="85" height="85">
<img src="st_eurol3.jpg" width="85" height="85"><hr></p>

<p><img src="st_euronl.gif" width="52" height="45" align=left>

Schon jetzt Favoritin bei den Sammlern und Sammlerinnen: K&ouml;nigin
Beatrix versch&ouml;nert mit ihrer charakteristischen Frisur die
niederl&auml;ndischen Euro- und Cent-M&uuml;nzen. <br clear=all>
<img src="st_euronl1.jpg" width="85" height="85">
<img src="st_euronl2.jpg" width="85" height="85"><hr></p>

<p><img src="st_europt.gif" width="52" height="45" align=left>

Historische Siegel sind auf den R&uuml;ckseiten der portugiesischen
M&uuml;nzen zu sehen. Sie erinnern an den Gr&uuml;nder Portugals,
K&ouml;nig Alfonso Henriques. Er lebte im 12. Jahrhundert. <br clear=all>
<img src="st_europt1.jpg" width="85" height="85">
<img src="st_europt2.jpg" width="85" height="85">
<img src="st_europt3.jpg" width="85" height="85"><hr></p>

<p><img src="st_euroz.jpg" width="52" height="45" align=left>
Und wer erkennt diese Euro-Banknote anhand des Ausschnittes? ER/sie kann mir
gerne eine Mail schicken, zu gewinnen gibt es nichts, erst recht nicht diese
Banknote. <br clear=all></p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
