<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</td>
								<td>KOKOUSMUISTIO</td>
							</tr>
							<tr>
								<td width="300">HALLITUS 1999-2000</td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td>2.4.2000</td>
							</tr>
						</table>
						<br>
						HALLITUKSEN KOKOUS 1/2000<br>
						<br>
						<table width="100%">
							<tr>
								<td valign="top" width="100">AIKA</td>
								<td>1. tammikuuta - 2. huhtikuuta</td>
							</tr>
							<tr>
								<td valign="top" width="100">PAIKKA</td>
								<td>Internet-postituslista</td>
							</tr>
							<tr>
								<td valign="top" width="100">L&Auml;SN&Auml;</td>
								<td>Terho Henriksson<br>
									Tomi Jaskari<br>
									Timo Kemppaala<br>
									Oliver Kruusi<br>
									Valtteri Murto<br>
									Jarmo Piippo<br>
									Janne Pikkarainen<br>
									Anu Seilonen<br>
									Tapani Tanskanen<br>
									Paula-Christiina Wirtanen</td>
							</tr>
						</table>
						<br>
						<b>1</b><br>
						<b>T&auml;st&auml; kokousmuistiosta</b>
						<p>T&auml;h&auml;n muistioon on ker&auml;tty Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n hallituksen Internetiss&auml; postituslistallaan ja IRC-kokouksissaan 1.1.-2.4.2000 k&auml;ym&auml;n keskustelun p&auml;&auml;kohtia. Otteet ovat eritt&auml;in tiiviit&auml; lyhennelmi&auml;, eik&auml; muistion ole edes tarkoitus sis&auml;lt&auml;&auml; selvityst&auml; kaikista k&auml;sitellyist&auml; aiheista, vaan tuoda esille yhdistystoiminnan kannalta merkitt&auml;v&auml;t seikat.
						<p>Hallituksen postituslista tavoittaa kaikki hallituksen j&auml;senet, mutta kaikki eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ole ottaneet osaa kaikkiin aiheisiin.</p>
						<b>2</b><br>
						<b>K&auml;siteltyj&auml; aiheita</b>
						<p>Yhdistyksen tiliasioiden hoito etenee. Janne Sir&eacute;n ottaa ty&ouml;stett&auml;v&auml;kseen tilinp&auml;&auml;t&ouml;sten tekemisen tilikausilta 1994-1999. Asiakirjojen valmistumisen ja tilintarkastajien niille antaman hyv&auml;ksynn&auml;n j&auml;lkeen j&auml;rjestet&auml;&auml;n kev&auml;tkokous vastuuvapauden my&ouml;nt&auml;mist&auml; varten kahdelle aiemmalle hallitukselle. Sen j&auml;lkeen tiliasioiden hoito ja siihen liittyv&auml; j&auml;sentietokannan yll&auml;pitoteht&auml;v&auml; tulevat meneill&auml;&auml;n olevan ja tulevien tilikausien osalta todenn&auml;k&ouml;isesti siirtym&auml;&auml;n Jarmo Piipolle.
						<p>Taustaselvittely uuden Saku-tapahtuman j&auml;rjest&auml;misen mahdollisuuksista jatkuu. Alustavien kyselyjen perusteella kiinnostusta tapahtumaa kohtaan on ainakin periaatteessa olemassa niin j&auml;rjest&auml;jien, Amiga-j&auml;lleenmyyjien kuin yleis&ouml;nkin taholta. Valitettavasti my&ouml;s yhdistyksen rahatilanne sanelee j&auml;rjest&auml;miselle omat ehtonsa, eik&auml; ainakaan t&auml;ll&auml; hetkell&auml; taloudellisia edellytyksi&auml; aiemmille tapahtumille kunniaa tekev&auml;n tilaisuuden j&auml;rjest&auml;miseen ole olemassa. Tilanne toivon mukaan kuitenkin nyt paranee Amigan suunnitelmien selvi&auml;misen ja uusien developer-ty&ouml;kalujen julkistuksen my&ouml;t&auml;. Erityisen toivottavaa olisi saada yhdistyksen t&auml;m&auml;n vuoden osalta tavoitteestaan j&auml;lkeen j&auml;&auml;nyt j&auml;senm&auml;&auml;r&auml; takaisin v&auml;hint&auml;&auml;n entiselle tasolleen. Saku-tapahtuman toteutusmahdollisuuksien selvitysty&ouml;t&auml; on mallikkaasti hoitanut Terho Henriksson, joka tammikuussa nimitettiin yhdistyksen uudeksi tapahtumavastaavaksi.
						<p>Saku-lehden uuden web-painoksen taitto on siirretty p&auml;&auml;toimittaja Anu Seiloselle, jotta h&auml;n saa pidetty&auml; kaikki langat k&auml;siss&auml;&auml;n lehden monimutkaisen tuotantoprosessin kaikissa vaiheissa. Hallitus kiitt&auml;&auml; Risto M&auml;ki-Pet&auml;yst&auml; h&auml;nen vuoden jatkuneesta erinomaisesta ty&ouml;st&auml;&auml;n HTML-lehden toimittajana.
						<p>User Group Networkissa ei ole t&auml;ll&auml; hetkell&auml; Suomen edustajaa edellisen edustajan Janne Sir&eacute;nin lopetettua teht&auml;v&auml;ns&auml;. Yhteyshenkil&ouml; k&auml;ytt&auml;j&auml;ryhmien asioita ajavaan User Group Networkiin olisi todenn&auml;k&ouml;isesti kuitenkin yhdistykselle eritt&auml;in hy&ouml;dyllinen olemassa, joten kiireellisyysj&auml;rjestyksess&auml; etusijalla olevien asioiden ja vastuullisten t&ouml;iden teht&auml;v&auml;njaon selvitty&auml; voidaan ryhty&auml; pohtimaan uuden edustajan nime&auml;mist&auml;.
						<p>Ajatuksesta uuden logon aktiivisesta etsimisest&auml; yhdistykselle on toistaiseksi luovuttu. Nykyinen tuttu voimasammakko ei siis viel&auml;k&auml;&auml;n ole kohdannut voittajaansa, mutta bittikarttakuvan muodossa oleva logo olisi syyt&auml; saada muunnettua vektorimuotoon, jotta sen skaalautuvuus ja k&auml;ytt&ouml;mahdollisuudet paranisivat.
						<p>Usein toivottua ja ehdotettua uutta lukijakysely&auml; ei saada viel&auml; ainakaan Sakun huhtikuun numeroon, mutta kyselyn tekeminen seuraavaan numeroon on kuitenkin alustavan pohdinnan kohteena. Ajankohta kyselylle on tuolloin todenn&auml;k&ouml;isesti otollisempi, sill&auml; Amigan suunta ja kehitysn&auml;kym&auml;t ovat ehk&auml; silloin tarkemmin selvill&auml; kuin nyt.
						<p>Kaivattujen kerhoiltojen j&auml;rjest&auml;miseen ei edelleenk&auml;&auml;n ole ollut aikaa eik&auml; henkil&ouml;resursseja k&auml;ytett&auml;viss&auml;, mutta kunhan kiireellisten yhdistysteht&auml;vien hoito on ensin saatu viety&auml; p&auml;&auml;t&ouml;kseen, voidaan tutkia mahdollisuutta ensimm&auml;isen kerhoillan pit&auml;miseen Oulussa. Suurin hankaluus on tarkoitukseen sopivien tilojen l&ouml;yt&auml;misess&auml;, sill&auml; niiden tulisi j&auml;rjesty&auml; ilman merkitt&auml;vi&auml; kustannuksia yhdistykselle.
						<p>Esitettiin pohdittavaksi mahdollisuuksia tilisiirtolomakkeiden l&auml;hett&auml;miseen j&auml;senille aina uuden tilikauden vaihduttua seuraavan vuoden j&auml;senmaksun mahdollisimman helppoa hoitamista varten. K&auml;yt&auml;nn&ouml;n toteutus ja hankkeen kannattavuus ty&ouml;m&auml;&auml;r&auml;&auml;n n&auml;hden vaativat viel&auml; miettimist&auml;, mutta alustavissa pohdinnoissa ajatus sai kuitenkin positiivisen vastaanoton.
						<p>Yhdistyksen nykyisess&auml; kirjanpitoj&auml;rjestelm&auml;ss&auml; j&auml;sennumerot m&auml;&auml;r&auml;ytyv&auml;t liittymisj&auml;rjestyksess&auml;, joten ne vaihtuvat vuosittain aina j&auml;senyyden uusimisen yhteydess&auml;. K&auml;yt&auml;nt&ouml; todettiin kirjanpitotarpeisiimme riitt&auml;v&auml;ksi, joten sit&auml; ei tulla muuttamaan. J&auml;senkohtaiset tietonsa saa jokainen halutessaan tarkistaa, kuten ennenkin, j&auml;senrekisterin yll&auml;pit&auml;j&auml;lt&auml;, joka t&auml;ll&auml; hetkell&auml; on Tomi Jaskari.
						<p>P&auml;&auml;tettiin j&auml;rjest&auml;&auml; Saku-rompun kakkospainoksen j&auml;ljell&auml; olevan er&auml;n myynti postitse alkuper&auml;iseen hintaan 40 mk/kpl plus postikulut. Myynnin j&auml;rjestelyt sovitaan erikseen my&ouml;hemmin.
						<p>Pohdittiin saatua ehdotusta j&auml;rjest&auml;&auml; ulkomaisten shareware-ohjelmien rekister&ouml;intej&auml; kimppatilauksina. Todettiin, ettei yhdistys voi ainakaan nykytilanteessa ryhty&auml; ohjelmien rekister&ouml;intej&auml; v&auml;litt&auml;m&auml;&auml;n. Ensinn&auml;kin esteen&auml; on resurssipula, vapaaehtoista ylim&auml;&auml;r&auml;iseen j&auml;ttiurakkaan ei l&ouml;ydy, ja toisekseen yhdistys ei voisi ottaa tilauksien v&auml;litt&auml;misest&auml; lainkaan palkkiota yhdistysmuotoon liittyvien s&auml;&auml;nt&ouml;jen takia.
						<p>Yhdistyksen Internet-kotisivuille on ehdotettu k&auml;ytetyn Amiga-tavaran osto- ja myyntipalstaa. Kaupank&auml;yntisivun toteuttaminen ja yll&auml;pito on kuitenkin varsin kaukana yksinkertaisesta teht&auml;v&auml;st&auml;. Sivuilla pit&auml;isi olla jatkuva valvonta, ja ilmoitusten pit&auml;isi kulkea tarkastajan kautta, jottei niille p&auml;&auml;se mit&auml; tahansa teksti&auml; esille. Lis&auml;ksi vastaan saattaisi tulla my&ouml;s tilaongelma, sill&auml; jo ennest&auml;&auml;nkin kookkaiden kotisivujen vaatima levytila rajoittaa ylim&auml;&auml;r&auml;isten palvelujen paikallista toteuttamista. Yhdistys ei siis rajallisine voimavaroineen pysty kauppapaikkaa j&auml;rjest&auml;m&auml;&auml;n, mutta jos joku yksityinen perustaa asiallisen ja luotettavan palvelun omille kotisivuilleen, ei linkin saaminen sinne yhdistyksen linkkisivuilta ole lainkaan mahdoton ajatus.
						<p>Kotisivujen webmasterointi on maaliskuussa siirretty Jarmo Piipolle. Hallitus kiitt&auml;&auml; Janne Sir&eacute;ni&auml; Jarmolle antamastaan mittavasta k&auml;ytt&ouml;opastuksesta webmasterointia varten viime vuonna luomiensa kotisivujen yll&auml;pitoj&auml;rjestelm&auml;n ja apuohjelmien k&auml;ytt&ouml;&ouml;n.
						<p>Hallitus kiitt&auml;&auml; my&ouml;s itse&auml;&auml;n ahkerasta yhdistysasioiden selvittelyst&auml; kesken&auml;&auml;n s&auml;hk&ouml;isten viestimien v&auml;lityksell&auml;, sill&auml; t&auml;h&auml;n menness&auml; puolisen vuotta kest&auml;neen kautensa aikana uusi hallitus on k&auml;ynyt painokasta keskustelua jo per&auml;ti 1393 s&auml;hk&ouml;postiviestin verran.
						<p>Muistion kokosi ja kirjoitti Jarmo Piippo. Oikoluvusta kiitos Anu Seiloselle.
				</tr>
			</table>
			
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font><p></center>
	</body>

</html>
