<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Pelit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Pelit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Bill's Tomato Game</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">&quot;Tohtori AivoTurmio&quot;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Lastillinen tomaatteja on matkalla ilmeisesti ketsuppitehtaalle. Kaksi tomaattia, Bill ja Terry, eiv&auml;t kuitenkaan ole tyytyv&auml;isi&auml; kohtaloonsa, vaan hypp&auml;&auml;v&auml;t pois lastista kohti vapautta. Aikansa pompittuaan he pys&auml;htyv&auml;t vihdoin vapaana, kun Suuri Liito-orava nappaa Terryn mukaansa ja vie h&auml;net kohti puun yll&auml; olevaa linnaansa. Nyt Bill-tomaatin tulee pelastaa Terryns&auml; liito-oravan kynsist&auml;.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/bill_1.jpg" alt="Bill's Tomato Game - Title" height="250" width="400" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Bill's Tomato Game on puzzle-peli, joka sis&auml;lt&auml;&auml; pienen, kohtuullisen turhan alipelin aina paikasta toiseen edett&auml;ess&auml; sek&auml; loppuvihulaisen kanssa matsaamisen. Puzzle-osuudessa on tarkoitus pompauttaa Bill pomppusysteemill&auml; ilmaan ja saada tuulettimien, trampoliinien, pomppupellejen ja lahjalaatikoiden avulla aina jossain p&auml;in kentt&auml;&auml;, yleens&auml; oikeassa laidassa, sijaitsevalle liukuhihnalle, josta edet&auml;&auml;n aina seuraavaan kentt&auml;&auml;n. Jos joku on joskus pelannut The Incredible Machinea, niin t&auml;m&auml; on ik&auml;&auml;n kuin sen toiminnallisempi ja yksinkertaistettu pikkuveli. Puzzle-osuuden kentiss&auml; on v&auml;h&auml;isist&auml; v&auml;lineist&auml; huolimatta saatu kuitenkin ihan mukavasti vaihtelua aikaan, ja peli jaksoi ainakin minua viihdytt&auml;&auml; ihan alusta loppuun saakka. Tuli jopa sellainen olo, ett&auml; kakkososakin kelpaisi.<br>
							<br>
							Ennen kaikkea on ilahduttavaa, ett&auml; peli on kest&auml;nyt todella hyvin aikaa. Huolimatta siit&auml;, ett&auml; t&auml;m&auml; taitaa olla l&auml;hemm&auml;s kymmenen vuotta vanha, ellei jopa enemm&auml;nkin, miss&auml;&auml;n vaiheessa ei tullut sit&auml; &quot;muistin grafiikat parempana&quot; -oloa tai vastaavaa. L&auml;hinn&auml; ajasta on k&auml;rsinyt vain musiikki, se kun on t&auml;ytynyt saada &auml;ngetty&auml; yhdelle disketille, niin hitusen piippauksiksi nuo musiikkien soittimet ovat j&auml;&auml;neet.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Peli jakaantuu kymmeneen eri paikkaan ja lopputappeluun. Paikasta toiseen siirryt&auml;&auml;n sin&auml;ns&auml; turhasta mutta mukavasta lis&auml;st&auml;, jossa Bill pomppii puun oksalta toiselle aina vain yl&ouml;sp&auml;in kunnes l&ouml;yt&auml;&auml; seuraavan kent&auml;n. K&auml;yt&auml;nn&ouml;ss&auml; osuus on todella helppo, kovin kummoista kuolemisen vaaraa ei ole, eik&auml; se muutenkaan mitenk&auml;&auml;n h&auml;iritse. T&auml;m&auml; onkin ainoa osuus, jossa ohjekirjaa saattaa tarvita selvitt&auml;&auml;kseen ohjauksen. Ohjauksessa on nimitt&auml;in kolme tapaa: oikea nappi pohjassa Bill tekee pikku pompun, vasemmalla saa isomman pompun ja molemmat napit pohjassa yht&auml; aikaa maksimipompun. Ilman t&auml;t&auml; maksimipomppua ei kaikkiin kenttiin pysty p&auml;&auml;sem&auml;&auml;n.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<img src="kuvat/bill_2.jpg" alt="Bill's Tomato Game - Level 1" height="242" width="400" border="1"></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jokaisessa kymmeness&auml; paikassa on kymmenen kentt&auml;&auml;, jotka pyrkiv&auml;t vaikeutumaan, mik&auml; on sin&auml;ns&auml; mukavaa: kun kymppikent&auml;n on mennyt, tuleekin seuraavassa paikassa ensiksi pari helpompaa kentt&auml;&auml;, eik&auml; vaikeusaste vain tasaisen turhauttavasti nouse loppua kohti, vaan menee aaltomaisella liikkeell&auml; toki loppua kohti nousten. Vaikeusaste peliss&auml; on pelityypin vuoksi eritt&auml;in korkea, ja huomasin muita katsellessani, ett&auml; jotkut eiv&auml;t yksinkertaisesti tahdo suoriutua edes ensimm&auml;isist&auml; kentist&auml;. Etenkin loppua kohti p&auml;&auml;stess&auml; alkavat kent&auml;t olla l&auml;hes pikselintarkkaa puuhaa sek&auml; nopeata ja vakaata hiirik&auml;tt&auml; vaativaa. Veikkaankin, ett&auml; suurimmalla osalla t&auml;m&auml; peli j&auml;&auml; l&auml;pipelaamatta.<br>
							<br>
							
							Kentt&auml;suunnittelu on hyv&auml;&auml; l&auml;pi koko pelin, mutta miinuksiksi on sanottava aika ja joidenkin kenttien pakollinen nopea hiirik&auml;si. Kun mieluummin keskittyisi siihen, ett&auml; vehkeille l&ouml;yt&auml;&auml; kaikessa rauhassa oikean paikan, niin ensiksikin aika nostaa oman rajoituksensa - tosin vasta loppukentiss&auml; h&auml;iritsev&auml;sti - ja lis&auml;ksi joissain kentiss&auml; on kaiken maailman liikkuvia h&auml;rveleit&auml;, jotka saattavat v&auml;lill&auml; menn&auml; v&auml;kisin siihen kohtaan, mihin vaikka trampoliini kuuluisi, jolloin pit&auml;&auml; toimia nopeasti. Yleens&auml; kent&auml;t ovat yhden kuvaruudun kokoisia, mik&auml; mielest&auml;ni on mukavaa, mutta oli my&ouml;s muutama kentt&auml;, jotka vieriv&auml;t sivusuunnassa. Lis&auml;ksi paikkojen teemat vaihtelevat ihan mukavasti, ja joskus harvoin kenttien teemoja on lis&auml;tty tuomaan lis&auml;&auml; ominaisuuksia peliin, kuten hypnoositeemassa on teleportteja.<br>
							<br>
							
							Lopputaistelu oli kohtuullinen pettymys. Ei niink&auml;&auml;n, etteik&ouml; idea olisi ollut hyv&auml;, mutta toteutus oli aika k&ouml;kk&ouml;. Lis&auml;ksi lopputappelussa tarvitaan hitunen tuuriakin: jos liito-orava p&auml;&auml;tt&auml;&auml; hyp&auml;t&auml; tietyll&auml; hetkell&auml; Bill-tomaatin ollessa m&auml;&auml;r&auml;tyss&auml; kohtaa ilmassa, ei Bill yksinkertaisesti ehdi pois alta, mik&auml; entisest&auml;&auml;n lis&auml;&auml; t&auml;m&auml;n kohdan typeryytt&auml;. Se mik&auml; peli&auml; on varmasti paljolti auttanut aikaa kest&auml;m&auml;&auml;n on kotikutoisuuden tuntu peliss&auml;, mik&auml; selittyykin pelin l&auml;p&auml;isty&auml;, kun lopputeksteiss&auml; mainitaan, ett&auml; ohjelmoija, muusikko ja piirt&auml;j&auml; ovat kaikki tehneet peli&auml; kotoaan k&auml;sin. Loppudemot sin&auml;ns&auml; olivat pettymys, kun olisi odottanut enemm&auml;n alkudemojen perusteella. L&auml;hinn&auml; se muistuttaa tavallisen demon lopputekstej&auml;.<br>
							<br>
							
							Pelin sai installoitua kovalevylle JST:n avulla, ja WHDload-mahdollisuuskin on. JST ei ihan t&auml;ydellisesti toiminut. V&auml;lill&auml; saattoi k&auml;yd&auml;, ett&auml; kun p&auml;&auml;si tiettyyn kentt&auml;&auml;n, niin peli valittaa, ett&auml; on v&auml;&auml;r&auml; salasana. Koneen buuttaminen kuitenkin auttaa t&auml;h&auml;n ongelmaan, sill&auml; peliss&auml; onneksi on salasana jokaiseen kentt&auml;&auml;n, mink&auml; seurauksena yht&auml;k&auml;&auml;n kentt&auml;&auml; ei tarvinnut pelata kahteen kertaan. Sellainen ongelma kuitenkin taitaa JST:n kanssa olla, ettei peli&auml; voi lopettaa Del-napilla. Viimeisen pelikertani j&auml;lkeen lopetin Del-n&auml;pp&auml;imell&auml;, ja kun oli tarkoitukseni tarkistaa salasanojen toimivuus, niin peli ei en&auml;&auml; suostunut k&auml;ynnistym&auml;&auml;n ollenkaan.<br>
							<br>
							
							Suosittelen peli&auml; kaikille puzzle-peleist&auml; yleens&auml;kin pit&auml;ville, mutta jos demoversion l&ouml;yd&auml;t, niin kannattaa sit&auml; ensiksi kokeilla, koska joillekin t&auml;m&auml; peli vain yksinkertaisesti on liian vaikea. </font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td colspan="2" valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Bill's Tomato Game</b></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Tekij&auml;:&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Psygnosis</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Myyj&auml;:&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, puh. (03) 363 0048, <a href="mailto:ge@vip.fi">ge@vip.fi</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hinta:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">48 e</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Vaatii:&nbsp;&nbsp;</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">030, 16 Mt RAM, AGA/GFX, 50 Mt kovalevytilaa, 4x CD-ROM</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Suositus:&nbsp;&nbsp;</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">040+/PPC, 32 Mt RAM, grafiikkakortti, 300 Mt kovalevytilaa, 8x CD-ROM. Tukee grafiikkakortteja (HiColor), AHI:a, peliohjaimia ja 4 pelaajan sovitinta.</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Toimii:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga 68K, WarpOS, MorphOS, Amithlon</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Testattu:</b></font></td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Amiga 1200, Blizzard PPC/040, 64 Mt, Mediator, Voodoo 3, Paula, 52x CD-ROM, OS3.9</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Pelit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>