<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Pelit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Pelit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Crossfire II: Haastattelussa Thomas Schulze</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Haastattelija:&nbsp;Seppo Typp&ouml;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Pitk&auml;n kuivan kauden j&auml;lkeen Amiga-pelimaailmassa tapahtuu - pelattava demo Dreamworlds Development -tiimin uusimmasta pelist&auml; nimelt&auml; Crossfire II ilmestyi nettiin juuri sopivasti joulun alla. T&auml;ss&auml; haastattelussa DD-tiimin perustajaj&auml;sen Thomas Schulze kertoo pelist&auml;, itse tiimist&auml; ja Amigasta yleens&auml;. Alkuper&auml;inen englanninkielinen versio on julkaistu comp.sys.amiga.games-uutisryhm&auml;ss&auml;.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Seppo Typp&ouml;: </b>Aloitetaan taustatiedoilla - voitko kertoa itsest&auml;si, Dreaworlds Development tiimist&auml; ja Amiga-historiastasi?<br>
							<br>
							<b>Thomas Schulze: </b>Kaksoisveljeni Stefan ja min&auml; aloitimme tietokoneharrastuksen jo hyvin nuorina...7-vuotiaina aloitimme ohjelmoinnin pienell&auml; GDR tietokoneella, vuosi oli 1985. Koulussa tapasimen Dirkin, jolle h&auml;nen vanhempansa olivat hankkineet samanlaisen tietokoneen. Yhdess&auml; aloimme &quot;kiduttaa&quot; koneitamme ensimm&auml;isill&auml; pienill&auml; &quot;peleill&auml;mme&quot; joita sitten vaihdoimme kasettinauhoilla kesken&auml;mme.<br>
							<br>
							Er&auml;&auml;n&auml; p&auml;iv&auml;n&auml; sitten Amiga 500 l&ouml;ysi tiens&auml; kotiimme ja pian sen j&auml;lkeen Dirk sai samanlaisen. Aloimme ohjelmoida sill&auml;, tutkien sen tuomia hienoja uusia ominaisuuksia. Aloitimme AmigaBasicilla, mutta siirryimme pian AMOSiin. AMOS on hieno ohjelmointikieli aloittelijoille mutta se tarjoaa tarpeeksi ominaisuuksia my&ouml;s pidemm&auml;lle ehtineille ohjelmoijille. Uskoisin ett&auml; hyvin moni Amiga-ohjelmoija aloitti t&auml;ll&auml; samalla tavalla. Ensimm&auml;inen peli jonka laitoimme julkiseen levitykseen, Crossfire 1, tehtiin AMOS-kielell&auml; 1997. Siit&auml; oli tarkoitus tehd&auml; Shareware-peli mutta p&auml;&auml;dyimme lopulta julkaista sen Freewarena.<br>
							<br>
							Samoihin aikoihin pelin julkaisun kanssa siirryimme k&auml;ytt&auml;m&auml;&auml;n C:t&auml; ja my&ouml;hemmin C++:aa. Vuonna 1998, tehty&auml;mme ensin ruuduns&auml;&auml;st&auml;ji&auml; ja muuta vastaavaa p&auml;&auml;timme lopulta tehd&auml; Crossfiren uudestaan k&auml;ytt&auml;en uusia moderneja ohjelmointitekniikoita. Ja se mit&auml; silloin aloitimme valmistui nelj&auml; vuotta my&ouml;hemmin. Tuona aikana aloitimme ja keskeytimme useita pelej&auml;, kuten AMOS- kielell&auml; tehty RPG AGA Amigoille, PPC-koneille suunnattu voxel-tekniikkaa hy&ouml;dynt&auml;v&auml; kilpa-autopeli ja niin edelleen - mik&auml;&auml;n n&auml;ist&auml; ei p&auml;&auml;ssyt alkutekij&ouml;it&auml; pidemm&auml;lle.<br>
							<br>
							CrossfireII:n ohjelmointity&ouml;n ollessa t&auml;ydess&auml; vauhdissa, saimme postia yhdelt&auml; Crossfire I - fanilta, joka harrasti vapaa-aikanaan tietokonegrafiikan tekoa. T&auml;ll&auml; tavalla Simon, toinen graafikoistamme liittyi meihin. Ensimm&auml;inen muusikkomme, Audun, liittyi jengiin samoihin aikoin kun ensimm&auml;inen 'teknologiademo' Voxelracesta julkaistiin. H&auml;n erosi kuitenkin melko pian henkil&ouml;kohtaisista syist&auml; johtuen. Kes&auml;ll&auml; 2001 etsimme uutta graafikkoa auttamaan meit&auml; Crossfire II:n kehitysty&ouml;n loppuun saattamiseksi. Monien hakijoiden joukosta l&ouml;ytyi Sven joka on vastuussa monista pelin animaatioista. Valitettavasti my&ouml;s h&auml;n erosi juuri silloin kun tarve olisi ollut suurin, eli muutama kuukausi ennen Aachenin messuja. Samoihin aikoihin v&auml;rv&auml;simme mukaan tiimiin Jan Morgensternin, miehen jolla on kyky tuottaa laadukasta musiikkia. Sitten...Crossfire II:n kehitysty&ouml; pys&auml;htyi l&auml;hes vuodeksi. Olimme p&auml;&auml;tt&auml;neet saada pelin valmiiksi seuraaville Aachenin messuille, mutta Jan oli ylity&ouml;llistetty ja tarvitsimme toisenkin &auml;&auml;nimiehen. Markus Holler (joka on jo tunnettu Tales Of Tamar -pelin soundtrack-ty&ouml;st&auml;) auttoi meit&auml; tekem&auml;&auml;n &auml;&auml;nipuolen animaatioihin. Timo Kloss (Inutilis Software) teki loistavaa ty&ouml;t&auml; pelin musiikin kanssa. Suuri kiitos kuuluu kaikille osallistuneille viimeisten kuukausien hirve&auml;n puristuksen ansioista.<br>
							<br>
							<b>Seppo:</b> Mik&auml; on Crossfire II:n historia?<br>
							<br>
							<b>Thomas:</b>&nbsp;Se tuli jo osaksi kerrotua edell&auml;. Vaihdettuamme AMOS:in C:hen saimme samalla uusia hienoja mahdollisuuksia. Pian joku ehdotti Crossfiren uudelleen- koodaamista k&auml;ytt&auml;en n&auml;it&auml; uusia tekniikoita. Teimme puoli vuotta t&ouml;it&auml; ja saimme ensimm&auml;isnen demon pelist&auml; ulos. Yleison reaktio oli uskomattoman hieno ja meit&auml; l&auml;hestyttiin useiden pelikustantajien tahoilta, ja he esittiv&auml;t ett&auml; pelist&auml; teht&auml;isiin kaupallinen versio - joten me p&auml;&auml;timme tehd&auml; pelist&auml; laajemman, ja loimme siihen kampanjamoodin. Peli edistyi ripein askelin, mutta motivaatiomme jatkaa katosi muiden projektien viedess&auml; mielenkiintomme. Stefan lopetti koodaamisen t&ouml;idens&auml; takia. N&auml;ytti ett&auml; koko peli katoaisi unholaan, kunnes kolme kuukautta ennen Aachenin showta p&auml;&auml;tin yht&auml;kki&auml;, ett&auml; peli teht&auml;isiin loppuun. Kysyin asiaa kaikilta alkuper&auml;isilt&auml; Dreamworlds tiimin j&auml;senilt&auml; ja onni oli my&ouml;t&auml; - hekin halusivat jatkaa. Se oli pirun kova puristus, kukaan meist&auml; ei nukkunut enemp&auml;&auml; kuin 5 tuntia viimeisen viikon aikana ennen messuja. Mutta me saimme pelin valmiiksi.<br>
							<br>
							<b>Seppo:</b> Voitko kertoa hieman Crossfire II:n kehitysymp&auml;rist&ouml;st&auml;?<br>
							<br>
							<b>Thomas:</b>&nbsp;Kehitysty&ouml; alkoi Amiga 1200/030 AGA:lla. Pian kuitenkin siirryimme A1200/060:n kautta A4000/PPC + CybervisionPPC ymp&auml;rist&ouml;&ouml;n. Viimeisen vuoden ajan teimme hommia WinUAE:n alla 700 MHz Duron PC:ll&auml;. A4000 oli niin vanha ett&auml; siit&auml; tuli ep&auml;stabiili. Bonuksena koneen uudelleenboottaus ja ty&ouml;skenteleminen yleens&auml; oli nopeampaa emulaattorin kanssa. Eik&auml; mpeg musiikki vaikene joka kerta kun 'kone' kaatuu :-))<br>
							<br>
							Aloitimme koodauksen StormC V3:lla ja siirryimme my&ouml;hemmin V4:seen. Eka grafiikat tehtiin Maxon Cinema V4:sella ja Personal Paintill&auml;. My&ouml;hemm&auml;t grafiikat syntyiv&auml;t Maxon Cinema V6:lla ja Paint Shop Pro:lla. PicConvert niminen hy&ouml;dylline apuohjelma mahdollisti kaiken grafiikan muuntamisen T&auml;ysv&auml;rimoodista fixattuun 8-bittiseen palettiin. Pelin musiikki ja animaatioiden &auml;&auml;net tuotettiin syntikoilla ja PowerMacill&auml;.<br>
							<br>
							<b>Seppo:</b> Crossfire II:n demosta p&auml;&auml;telleen kyseess&auml; on hyvin viimeistelty peli - kauanko kehitysty&ouml; vei kaikkiaan aikaa?<br>
							<br>
							<b>Thomas:</b> Nelj&auml; vuotta! NELJ&Auml; vuotta! Peli on todellakin loppun saakka viimeistelty - esimerkiksi moninpelimoodia pelitestattiin niin kauan ett&auml; kaikki siin&auml; oli varmasti niinkuin pit&auml;&auml;kin. Kampanjan testaaminen oli hieman hankalampi tapaus, l&auml;hinn&auml; siksi ett&auml; pelaajalla on vapaus tehd&auml; mit&auml; haluaa eik&auml; testauksessa voi ennakoida kaikkia temppuja mit&auml;, pelaaja haluaa tehd&auml;. Mutta teimme siin&auml;kin parhaamme :-))<br>
							<br>
							<b>Seppo:</b> Mitk&auml; olivat mielest&auml;si kehitysty&ouml;n kohokohdat?<br>
							<br>
							<b>Thomas:</b> Hetki jolloin kotisivumme Internetiss&auml; julkaistiin - oli hienoa saada huomiota, n&auml;hd&auml; nimens&auml; esiintyv&auml;n monilla merkitt&auml;vill&auml; uutispalstoilla ja saada postia ymp&auml;ri maailmaa...se kaikki motivoi meit&auml; hurjasti.<br>
							<br>
							Toinen Hyv&auml; Juttu (TM) oli CFII:n ennakkotarina AmigaFuture lehdess&auml;. Kaveri joka teki tuon jutun oli ilmeisesti peliemme suuri fani ja se kuvastui h&auml;nen artikkelissaan. Vaihdoimme h&auml;nen kanssaan useita viestej&auml; ja l&ouml;ysimme hyv&auml;n yst&auml;v&auml;n, jonka sitten lopulta tapasimme Aachenin messuilla.<br>
							<br>
							Yleens&auml; ottaen: paras juju koko hommassa oli ne kaikki ihmiset, joihin saimme tutustua.<br>
							<br>
							<b>Seppo:</b> Mist&auml; Crossfire II:n ominaisuudesta olet eniten ylpe&auml;?<br>
							<br>
							<b>Thomas:</b> Pid&auml;n erityisesti graafisesta efektist&auml; jonka Black Hole Blaster tuottaa. Ja sitten olen ylpe&auml; pelin viimeisist&auml; teht&auml;vist&auml;. Teht&auml;v&auml;t 17-25 ovat parhaita mit&auml; olen tehnyt, sis&auml;lt&auml;en monenlaista rinnakkaista tapahtumaa ja olennaista juonenk&auml;&auml;nnett&auml;. Ne ovat jokainen ainutlaatuisia, tuoden uusia n&auml;k&ouml;kulmia perusasetelmaan ja sis&auml;lt&auml;v&auml;t lis&auml;ksi hienoja efektej&auml;...ei ihme, ett&auml; n&auml;it&auml; teht&auml;vi&auml; me esittelimem eniten messuilla :-))<br>
							<br>
							<b>Seppo:</b> Mitk&auml; olivat suurimmat haasteet pelin teossa?<br>
							<br>
							<b>Thomas:</b> Kaikkien eri rauta/softa yhdistelmien tukeminen. Sain viestej&auml; 030/AGA k&auml;ytt&auml;j&auml;lt&auml; joka kysyi kuinka nopeuttaa peli&auml; esim kytkem&auml;ll&auml; pois joitain efektej&auml;. Sitten sain mailia Pegasos-k&auml;ytt&auml;j&auml;lt&auml; joka pyysi parempia resoluutoita ja ruudunp&auml;ivityst&auml;. Peli t&auml;ytyi toimia niin OS3.0:lla, OS3.5:lla, OS3.9:ll&auml;, MorphOS:issa, Amithlonilla... oli kolmen tyyppisis&auml; installointiohjelmia, kolme eri grafiikkasysteemi&auml; ja erilaisia grafiikkakortteja, kaksi erilaista audio API:a, eri ikonityyppej&auml; ja erilaisia patcheja. Ei ollut hauskaa muokata pelimoottoria tukemaan KAIKKEA T&Auml;T&Auml;. Olen p&auml;&auml;tt&auml;nyt etten tee nyky-Amigalle mit&auml;&auml;n ennenkuin OS4 yhdist&auml;&auml; kaikki 'r&ouml;nsyt' saman API:n alle. Haluan tehd&auml; pelej&auml;, en tekniikkademoja joiden suurin ominaisuus on toimia samalla tavalla kaikenlaisissa Amigoissa mit&auml; maa p&auml;&auml;ll&auml;&auml;n kantaa.<br>
							<br>
							<b>Seppo:</b> Crossfire II n&auml;ytt&auml;&auml; eritt&auml;in hienolta mutta kaikki nuo efektit sy&ouml; taatusti paljon preosessoritehoa. Oletko harkinnut 3D-kiihdytetyn version tekemist&auml; Warp3D:n avulla?<br>
							<br>
							<b>Thomas:</b> T&auml;m&auml; idea tuli mieleeni mutta pelin sis&auml;inen rakenne ei tukenut Warp3D:n k&auml;ytt&ouml;&auml;. Meid&auml;n olisi pit&auml;nyt koodata peli t&auml;ysin uusiksi, ja mieluummin k&auml;yt&auml;n sen ajan uuden 3D-pelin tekemiseen. 3D-kiihdytetty&auml; versiota varten meid&auml;n pit&auml;isi tehd&auml; kaikki grafiikka uusiksi - mik&auml; tarkoittaisi non 5 Gb edest&auml; dataa jotka menisiv&auml;t remonttiin. Kyseessa olisi liian iso homma hoidettavaksi pelkk&auml;n&auml; p&auml;ivitysversiona. P&auml;ivityksen koko olisi v&auml;hint&auml;&auml;n 100 Mb joten meid&auml;n pit&auml;isi tuottaa uudet CDROM:it. Nykyinen CDROM on jo ihan t&auml;ynn&auml; (640 Mb pelidataa plus hieman oheisohjelmia ja dataa) eli se tarkoittaisi sit&auml; ett&auml; meid&auml;n pit&auml;isi tehd&auml; Crossfire II:sta kahden rompun peli. Se taas tarkoittaisi sit&auml; ett&auml; pit&auml;isi kirjoittaa uusiksi pelin sis&auml;inen tiedostonhallinta, installointiskriptit ja niin edelleen, ja t&auml;m&auml; on jotain, jonka mieluusti v&auml;ltt&auml;isin :-))<br>
							<br>
							<b>Seppo:</b> Oletteko miettineet jatkoa pelille, esimerkiksi Crossfire II lis&auml;teht&auml;v&auml;levy&auml; tai jopa Crossfire III:sta?<br>
							<br>
							<b>Thomas:</b> Ehk&auml; lis&auml;teht&auml;v&auml;levy&auml;...CF II:n suurin vika on kampanjamoodin lyhyys verrattuna PC pelien vastaaviin. Pelisss&auml; on vapaamuotoisia pelimoodeja jotka kompensoivat t&auml;t&auml; mutta silti kampanjan pelaa l&auml;pi turhankin nopeasti. Joten lis&auml;teht&auml;v&auml;levy voisi olla hyv&auml; idea.<br>
							<br>
							Henkil&ouml;kohtainen ongelmani on se, ett&auml; pelin idea on pitk&auml;lti k&auml;ytetty loppuun nykyteht&auml;vien yhteydess&auml;. Uudet teht&auml;v&auml;t eiv&auml;t ehk&auml; tarjoaisi uusia ideoita. Lis&auml;ksi tekniset ongelmat edelleen rajoittaisivat - olisi edelleen mahdotonta laajentaa pelikentt&auml;&auml;, joten yksitt&auml;iset teht&auml;v&auml;t olisivat edelleen lyhyit&auml;. Yksikin teht&auml;v&auml; vaatii rutosti ty&ouml;t&auml; ja aikaa useita p&auml;ivi&auml;, silti keskiverto pelaaja pelaa sen l&auml;pi 5 minuutissa. T&auml;m&auml;nkin ajan k&auml;ytt&auml;isin mieluusti kokonaan uuden pelin tekemiseen.<br>
							<br>
							Normaalip&auml;ivitykset peliin tulee olemaan ilmaisia, tosin ne tulee olemaan l&auml;hinn&auml; bugifiksej&auml;. Yksi iso p&auml;ivitys tuo mukanaan uusia areenoita vapaamuotoisiin pelimoodeihin, joitain uusia ominaisuuksia ja ehk&auml; uusia aseita jos saamamme k&auml;ytt&auml;j&auml;palaute sis&auml;lt&auml;&auml; niit&auml;.<br>
							<br>
							<b>Seppo:</b>&nbsp;Haluatko l&auml;hett&auml;&auml; jonkin viestin Sakun lukijoille?<br>
							<br>
							<b>Thomas:</b> En oikeastaan. Minun ei tarvitse pyyt&auml;&auml; teit&auml; ostamaan t&auml;t&auml; peli&auml;. Olette n&auml;hneet demon ja ehk&auml; jo tehneet p&auml;&auml;t&ouml;ksenne. Minun ei tarvitse puhua piratismista, koska se ei ole ongelma en&auml;&auml;. Me emme tienaa yht&auml;&auml;n rahaa miss&auml;&auml;n tapauksessa.<br>
							<br>Pit&auml;k&auml;&auml; hauskaa tietokoneenne kanssa, oli se sitten millainen tahansa. Ja pit&auml;k&auml;&auml; silm&auml;ll&auml; uutta Amigaa ja OS4:&auml;&auml;, se on viimeinen mahdollisuus, mink&auml; saamme.<br>
							<br>
							<hr>
							<br>Mik&auml;li et ole viel&auml; kokeillut Crossfire II:n demoa, l&ouml;ytyy se sek&auml; <a href="http://ftp.sunet.se/pub/aminet/game/demo/cf2_demo.lha">Aminetist&auml;</a> (11 Mt) ett&auml; tekij&ouml;iden <a href="http://www.dreamworlds.de" target="_blank">kotisivulta</a>. Sivulta l&ouml;ytyy lis&auml;tietoja tekij&ouml;ist&auml; ja muuta mukavaa - esimerkiksi alkuper&auml;inen Crossfire-peli. Mik&auml;li t&ouml;rm&auml;&auml;tte ongelmiin demon tai pelin kanssa tai haluatte vain antaa palautetta Thomasille, yhteystiedot l&ouml;ytyv&auml;t demon README-tiedostosta tai suoraan kotisivuilta. T&auml;t&auml; kirjoittaessa peli on jo myynniss&auml; l&auml;himm&auml;ll&auml; Amiga-myyj&auml;ll&auml;, eli Gentle Eye:lta l&ouml;ytyy, jos demo her&auml;tt&auml;&auml; kiinnostuksen ostaa koko peli. Omaani olen jo 19 teht&auml;v&auml;n verran tahkonnut, eik&auml; minulla ole kuin hyv&auml;&auml; sanottavaa - perinteisell&auml; tavalla addiktiivinen peli. Lue my&ouml;s pelin <a href="cf2_pikatesti.html" target="_self">pikatesti t&auml;st&auml; Sakusta</a>!</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Pelit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>