<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Status</h2>
<p><i>(Anm. d. &Uuml;.: gemeint ist sozialer Status, aber auch Bildungsniveau etc.)</i></p>

<hr>

<p>Weil Sie das Umfeld und das Erscheinungsbild des Empf&auml;ngers nicht
kennen, wissen Sie wenig &uuml;ber seinen sozialen Status. Sie k&ouml;nnen
nicht seine Kleidung sehen und wissen nicht, ob er einen Dialekt spricht.
&Uuml;ber das Alter, das Geschlecht, den Familienstand, seine Intelligenz
und Ausbildung k&ouml;nnen Sie auch nur spekulieren. Ebenso geht es dem
Empf&auml;nger - auch er ist auf Vermutungen angewiesen. Ich m&ouml;chte
hier nichts &uuml;ber den Wert von Vermutungen und Vorurteilen sagen. Es
ist aber eine Tatsache, da&szlig; man auf solche Spekulationen angewiesen
ist, wenn Sie keine Informationen &uuml;ber sich mitteilen. </p>

<h3>Wortwahl</h3>
<h4>Sprache</h4>

<p>Ihre Kompetenz im Umgang mit Sprache ist ein wichtiger Hinweis auf Ihren
sozialen Status. Wenn Sie viele Rechtschreib- und Grammatikfehler machen
oder einfach unpassende Worte verwenden, gewinnt man schnell den Eindruck,
da&szlig; Sie wenig gebildet sind. Es spielt dabei keine Rolle, da&szlig;
der Zusammenhang zwischen Sprachkompetenz und Intelligenz nur gering ist -
gerade bei Nicht-Muttersprachlern - viele Menschen ziehen diese Folgerung
trotzdem. Einige sind sogar beleidigt, wenn Sie eine Email erhalten, die
Fehler enth&auml;lt (gleichzeitig kann man nat&uuml;rlich auf diesem Weg
auch gerade den Eindruck vermitteln, da&szlig; man dumm ist). </p>

<p>In einer vollkommenen Welt k&ouml;nnten wir vielleicht alle hervorragend
und fehlerfrei schreiben. Da diese Welt aber nicht vollkommen ist, gibt es
eben Menschen, die eine Sache besser und eine andere schlechter
beherrschen: vielleicht ist man nicht sicher in der Grammatik - daf&uuml;r
kann man aber hervorragend Fliesenlegen.</p>

<p>Bis zum Aufkommen der digitalen Technik kamen wir in der Regel mit der
m&uuml;ndlichen Kommunikation (z.B. Telefon) aus. Medien wie Email machen
es nun n&ouml;tig, da&szlig; wir uns miteinander schriftlich
auseinandersetzen. Sicher kann man im Laufe der Zeit die Qualit&auml;t
seiner Korrespondenz verbessern, aber wenn man jeden Tag zehn oder mehr
Emails verschickt, w&auml;re es Unsinn, f&uuml;r jede eine Stunde
aufzuwenden, um sie stilistisch, orthographisch und grammatikalisch
auszufeilen. </p>

<p>Zum Gl&uuml;ck bieten einige Email-Programme eine
Rechtschreibpr&uuml;fung an. Wenn es Ihnen wichtig ist, einen
m&ouml;glichst guten Eindruck zu hinterlassen, sollten Sie diese
M&ouml;glichkeit unbedingt nutzen. Verlassen Sie sich aber nicht auf solche
Programme - es gibt Fehler, die auch diese Programme nicht erkennen! </p>

<p>Mir pers&ouml;nlich ist der Sinn und Zweck einer Email wichtiger als die
korrekte Grammatik. Ich mag also lieber solche Emails:</p>

<p><tt>Hey da sin ne Menge Leute draussen, die wo zimlich w&uuml;tend auf
dihc sind und dich verpr&uuml;geln wollen.</tt></p>

<p>als:</p>

<p><tt>Geh nicht vor die T&uuml;r!</tt></p>

<p>Korrekte Grammatik ist gut - korrekter Kontext und Informationen sind
besser!</p>

<h3>Absender-Angabe</h3>

<p>Viele Menschen filtern aus den Domain-Angaben Informationen &uuml;ber
den Absender (Informationen &uuml;ber &quot;Domains&quot; finden Sie <a
href="onl_email13.html">hier</a>). Jede Information, die man aus dieser
Absender-Adresse erh&auml;lt, wird auf Sie &quot;&uuml;bertragen&quot;,
z.B.: <ul>
<li>ibm.com - man vermutet, da&szlig; Sie ein Erwachsener sind und sich mit
Computern gut auskennen,
<li>aol.com - man vermutet, da&szlig; Sie diesen Anschlu&szlig; privat
nutzen und da&szlig; diese Adresse nichts mit Ihrer Berufst&auml;tigkeit zu
tun hat,
<li>washington.k12.ia.us - man vermutet, da&szlig; Sie unter 18 Jahre alt
sind,
<li>webtv.net - man vermutet, da&szlig; Ihr Interesse an Computern
weniger technisch ist. </ul></p>

<p>Ihr Partner wird auch aus Ihrem Namen (wenn sichtbar) bzw. aus Ihrer
Email-Kennung Schl&uuml;sse ziehen. Solange Ihr Name nichts gegenteiliges
verr&auml;t, wird man annehmen, da&szlig; Sie zur dominierenden Gruppe
innerhalb Ihrer Firma bzw. Ihres Landes geh&ouml;ren. So werden viele
denken, da&szlig; sich hinter der Email-Adresse bpj@thromble.com ein Mann
und hinter barbaraP@thromble.com eine Frau verbirgt - obgleich letztere
durchaus f&uuml;r einen Mann, z.B. Peter Barbara, stehen k&ouml;nnte. Aus
demselben Grund vermutet man, da&szlig; Emails aus Taiwan nur von Asiaten
und Emails aus den USA nur von Wei&szlig;en geschrieben werden - es sei
denn, der Name suggeriert eindeutig etwas anderes.</p>

<p>Ihre Email-Kennung gibt sogar noch subtilere Hinweise auf Ihre Person.
Wenn Sie z.B. eine sehr kurze Kennung ohne Zahl haben, kann man vermuten,
da&szlig; Sie als einer der ersten eine solche erhalten haben. Man vermutet
daher, da&szlig; steve@thromble.com l&auml;nger in der Firma arbeitet als
steve9672@thromble.com. </p>

<p>Daraus k&ouml;nnen sich auch Vermutungen &uuml;ber Ihre Stellung
innerhalb Ihrer Organisation ergeben. So wird man
Barbara.J.Periwinkle@thromble.com f&uuml;r wichtiger halten, als
babsimaus@thromble.com. </p>

<p>Klarheit verschafft hier eine sogenannte Signatur, in der Sie Ihre
Stellung eindeutig klarstellen:</p>

<p><tt>Barbara J. Periwinkle<br> Rechtsabteilung<br> Fraunheimer
Maschinenfabriken GmbH</tt></p>

<p>Oder</p>

<p><tt>Peter Periwinkle<br> Helene-Lange-Gymnasium<br> (14 Jahre)<br>
Besuchen Sie auch die lettische Homepage: http://www.latvia.org!</tt></p>

<p>Der junge Herr Periwinkle gibt hier gleichzeitig einen Hinweis darauf,
da&szlig; er aus Lettland stammt.</p>

<p>Es kann auch hilfreich sein, wenn man in die Email eine Information
&uuml;ber die Funktion bzw. den sozialen Status einbindet:</p>

<p><tt>Hallo - ich bin Sch&uuml;ler am Helene-Lange-Gymnasium und
interessiere mich f&uuml;r Hochleistungsrechner. K&ouml;nnten Sie mir
Informationen zusenden?</tt></p>

<p>oder:</p>

<p><tt>Hallo - ich bin Vizepr&auml;sident von Fraunheimer. Schicken Sie mir
bitte Informationen &uuml;ber Ihre Hochleistungsrechner, da wir
erw&auml;gen, einige Maschinen zu erwerben.</tt></p>

<p>Beachten Sie, da&szlig; der Autor nicht nur seine Funktion angibt,
sondern auch seine Sprachkompetenz beweist, indem er davon spricht,
da&szlig; man &quot;erw&auml;gt, einige Maschinen zu erwerben.&quot; Solche
Formulierungen k&ouml;nnen etwas abgehoben klingen, erh&ouml;hen aber den
Status ungemein. Man sollte aber darauf achten, sie nicht zu h&auml;ufig zu
verwenden und damit den Empf&auml;nger zu verwirren.</p>

<h3>Einsatz von Emails</h3>
<p>Eine letzte Sache, auf die sehr geachtet wird, ist die Art und Weise,
wie Sie Ihre Emails einsetzen. Wenn Sie keinen konkreten Kontext angeben,
nur in Gro&szlig;buchstaben schreiben oder zu lange Zeilen verwenden,
entsteht der Eindruck, da&szlig; Sie im Umgang mit Emails sehr unerfahren
sind. Dar&uuml;ber hinaus k&ouml;nnte man annehmen, da&szlig; Sie zu dumm
oder faul sind, den richtigen Umgang mit Emails zu lernen. </p>

<p>Erg&auml;nzend zum Aufbau der Email, achten viele darauf, wie sehr die
Email dem Zweck angemessen ist: Wurde die Email an die richtige
Kontaktperson geschickt? War es eine vern&uuml;nftige Frage? </p>

<h3>M&uuml;ssen Sie sich mit diesen Punkten besch&auml;ftigen?</h3>

<p>Wie entscheiden Sie, wieviel Zeit Sie auf das Entwickeln Ihrer
Statusinformationen verwenden sollten? Das h&auml;ngt von verschiedenen
Einfl&uuml;ssen ab:  <ul>
<li>Kennen Sie den Empf&auml;nger bereits? Wenn Sie schon sehr intensiven
Kontakt mit dem Adressaten gehabt haben, sind dessen Annahmen &uuml;ber Ihr
Alter, Geschlecht, Status und Intelligenz bereits sehr klar. Nur wenn Sie
massiv gegen Grammatikregeln oder die Email-Netiquette versto&szlig;en,
werden Sie dieses Urteil noch ver&auml;ndern k&ouml;nnen.

<li>Interessiert sich der Empf&auml;nger f&uuml;r solche
Statusinformationen? Universit&auml;tsprofessoren interessieren sich meist
mehr f&uuml;r die Grammatik als ein Dachdeckermeister. Menschen, die viele
Emails versenden, werden wesentlich toleranter mit solchen
Statusinformationen umgehen, als Menschen, die eine Stunde auf eine Email
verwenden.

<li>Was h&auml;ngt von dieser Email ab? Wenn Sie eine Email an
Ihren Chef senden, m&uuml;ssen sie wahrscheinlich sehr auf die Grammatik
achtgeben. Verk&auml;ufer interessiert es dagegen weniger -
schlie&szlig;lich wollen Sie Ihnen etwas verkaufen. Um Menschen dazu zu
bewegen, Ihnen einen Gefallen zu tun, sollten Sie den Eindruck erwecken,
da&szlig; Sie dem Empf&auml;nger in Zukunft n&uuml;tzlich sein
k&ouml;nnten.

<li>Wie sehen die Emails des Partners aus? Wenn man Ihnen
Emails mit mangelhafter Interpunktion und Rechtschreibung schickt, macht es
wahrscheinlich nichts, wenn Sie dasselbe tun.

<li>St&ouml;ren Sie Vorurteile? Wenn Sie ein Mann sind und Patrick
hei&szlig;en, es Ihnen aber nichts ausmacht mit einer Frau verwechselt zu
werden, k&ouml;nnen Sie gern &quot;Pat&quot; anstelle von
&quot;Patrick&quot; verwenden. </ul></p>

<p>&nbsp;</p>
<h3>Zusammenfassung</h3>
<p>Auch wenn ich Vorurteile nicht ausdr&uuml;cklich guthei&szlig;e,
geh&ouml;ren Sie doch zur menschlichen Natur. Sie m&uuml;ssen daher darauf
achten, welche Informationen Sie dem Adressaten mitteilen und wie Sie
falsche Ansichten korrigieren.</p> <ul> <li>Die Sprachkompetenz kann durch
Rechtschreib- und Grammatikprogramme verbessert werden. <li>Signaturen und
einleitende Informationen k&ouml;nnen falsche Einsch&auml;tzungen
verhindern. <li>Diese Anleitung wird Ihnen - hoffentlich - helfen, wie Sie
zuk&uuml;nftig Ihre Emails formulieren sollten. </ul> <p> </p> <hr>


<p>Weiter zum Thema <a href="onl_email07.html">Konventionen</a><br>
zur&uuml;ck zum Thema <a href="onl_email05.html">&quot;Mimik und Gestik&quot;</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>

<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;</p>
</body>
</html>
