<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<title>Spaceward HO!</title>
<meta name="author" content="Rainer Wrieden">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="../bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">

<div align="center">
<table cellspacing="10" cellpadding="10">
<tr>
	<td><img src="spaceward/cowboy1b.png" width=75 height=75 border=0 alt=""></td>
	<td><h1><font face="" color="Green">SPACEWARD HO!</font></h1></td>
	<td><img src="spaceward/cowboy1a.png" width=75 height=75 border=0 alt=""></td>
</tr>
</table>

<table width="670" border="0" cellspacing="0">
<tr><td>

<p title="" align="JUSTIFY">Heute m&ouml;chte ich euch das Spiel Spaceward HO! vorstellen. Dies ist ein Spiel in dem man Planeten erobern muss. Dies wird einem nicht so leicht gemacht, weil einem,  nat&uuml;rlich wie immer, ein oder mehrere Gegner davon abhalten m&ouml;chten. Dies k&ouml;nnen Computergegner sowie auch menschliche Gegner sein. Aber fange ich doch erst mal bei der Festplatteninstallation an. Das Installicon auf der ersten von zwei Disketten einfach in den Ordner ziehen, wo man das Spiel installieren m&ouml;chte. Danach einfach das Icon anklicken und schon beginnt die Installation, die nach ca. 2-3 min. abgeschlossen ist. Man kann aber auch direkt von Diskette aus spielen. Nun kann man ein neues Spiel erstellen und hat dazu folgende Parameter:<br><br>
<img src="spaceward/spaceward1.png" width=670 height=283 border=0 alt=""><br><br>
Sternendichte: (dicht oder licht)<br>
Art der Galaxis: (Kreis, Zufall, Ring, Spirale oder Gitter)<br>
Computerintelligenz: (dumm, normal oder klug)<br>
Gr&ouml;sse der Galaxis: (klein, mittel, gross, sehr gross oder riesig)<br>
Anzahl Computergegner: (1-19)<br>
Spielstufe: (Neuling, Anf&auml;nger, Normal, Profi oder Experte)<br><br>

<img src="spaceward/spaceward2.png" width=670 height=283 border=0 alt=""><br><br>

Interessant ist auch die M&ouml;glichkeit das ganze als Mailspiel zu erstellen.
Jeder Mitspieler bekommt eine Initdatei und kann sich in das Spiel mit Name und Passwort eintragen.
Danach wird der erste Spielstand errechnet und an die jeweiligen Spieler geschickt, die dann ihren Zug machen und den Spielstand dann an den Spielleiter zur&uuml;ckschicken. Beim Erstellen des Spieles kann man auch Computerspieler mit hinzuf&uuml;gen, die sich dann wie Menschliche verhalten. D. h. der Spieler weiss eventuell garnicht ob der Gegner ein Mensch oder Compi ist.<br><br>

<img src="spaceward/spaceward3.png" width=670 height=283 border=0 alt="spaceward3.png"><br><br>

Am Anfang des Spieles f&auml;ngt man mit einem Heimatplaneten an. Nun kann man verschiedene, schon vorgefertigte Raumschiffe, zu anderen Planeten schicken um die zu erforschen oder letztendlich zu kolonisieren. Man hat aber nicht nur diese vorgefertigten Raumschiffe zu Verf&uuml;gung, sondern kann sich selber Prototypen aus unterschiedlichen Technikstufen (Weite, Tempo, Waffen, Schilde und Mini) zusammenstellen. Die Produktion von den Raumschiffen erfordert zum einen Geld und zum anderen Metall. Die Raumschiffe werden in vier Kategorien augeteilt (Sp&auml;her, Kolonieschiff, Kampfschiff und Satellit). <br><br>

<img src="spaceward/spaceward6.png" width=670 height=283 border=0 alt=""><br><br>

Diese Technikstufen m&uuml;ssen aber erst im Laufe des Spieles erforscht werden. Dazu stellt man seiner Forschungsabteilung Geld zur Verf&uuml;gung, welche dann den Spieler nach weiteren Z&uuml;gen mit einer fortschrittlicheren Technikstufe erfreut, die dann sofort f&uuml;r neue Prototypen benutzt werden kann.<br><br>

<img src="spaceward/spaceward4.png" width=670 height=283 border=0 alt=""><br><br>

Die Planeten haben unterschiedliche Temperatur, Schwerkraft und Metallgehalt. Die Schwerkraft ist immer ein fester Wert, wobei die Temperatur durch Umwandlung des Planeten (Terraforming) an den Idealwert von 22,2 &#176;C gebracht werden kann. Dieses kostet aber Geld das vom Spieler individuell zugeteilt werden kann. Das Metall kann abgebaut und f&uuml;r den Schiffbau verwendet werden. Durch das Terraforming verbessert sich die Lebenssituation auf dem Planeten erheblich, was dazu f&uuml;hrt
das anf&auml;nglich die Planeten f&uuml;r ihren Unterhalt etwas Kosten welche sich nach einigen Runden auch in eine Geldquelle wandeln k&ouml;nen. Das h&auml;ngt aber haupts&auml;chlich von der Schwerkraft ab. Ist die nahe 1 G sieht es damit sehr gut aus. Es gibt auch Planeten die nie Profit abwerfen werden. Auf diesen sollte man vorhandenes Metall abbauen und ihn dann verlassen um die Unterhaltskosten zu sparen.<br><br>

<img src="spaceward/spaceward5.png" width=670 height=283 border=0 alt=""><br><br>

Haupts&auml;chlich werden die Geldzuteilungen durch Verschiebebalken ausgef&uuml;rt. Es gibt auch einen Menup&uuml;nkt "Ausgaben anpassen", der hilft zuviel oder zuwenig gezahlte Mittel automatisch anzupassen.
<br><br>
<img src="spaceward/spaceward7.png" width=670 height=283 border=0 alt=""><br><br>
Das Spiel unterst&uuml;tzt verschiedene Bildschirmaufl&ouml;sungen und Farben.
<br><br>
Spielziel ist es alle Gegner zu vernichten.
<br><br>
</p>
<br><br>
Euer Rainer<br><br></td>
</tr>
</table>
<table border="5" cellspacing="1" cellpadding="5" align="CENTER">
<tr>
	<td>Rainer Wrieden</td>
	<td>E-Mail: <a href="mailto:spezis@terra.es">spezis@terra.es</a></td>
</tr>
</table>
</div>
</body>
</html>

