<HTML>
<HEAD>
<TITLE>Interview Nr 3</TITLE>
</HEAD>

<BODY background="ncb_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<CENTER>
<P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

<TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
<TR>
<TD valign="top">Entwickler:</TD> 
<TD><B>Davy Wentzler</B> </TD>
</TR>

<TR>
<TD valign="top">Software:</TD>   
<TD>Audio Evolution</TD>
</TR>

<TR>
<TD valign="top">Homepage:</TD>   
<TD>www.audio-evolution.com</TD>
</TR>

<TR>
<TD valign="top">Email:</TD>      
<TD>info@audio-evolution.com</TD>
</TR>
</TABLE>
</CENTER>

<P><FONT color="#006000"><B>Hallo David, kannst Du bitte ein bisschen
&uuml;ber Dich und Deinen Amiga- Hintergrund erz&auml;hlen?</B></FONT><BR>

Hallo Olaf! Danke, dass Du mich um ein Interview gebeten hast :-) Ich bin
28 Jahre alt, lebe in den Niederlanden und arbeite als Projektleiter/
Software-Ingenieur f&uuml;r eine medizine Firma, die
Behandlungsplan-Systeme f&uuml;r die Behandlung von Krebs mit radioaktiven
Quellen herstellt. In meiner Freizeit entwickle ich auf dem Amiga, schaue
DVDs, h&ouml;re Musik (Jazz/ Fusion, Satriani, Vai, Dream Theater, Toto
usw.) und manchmal mache ich die Live-Abmischung f&uuml;r eine Band.</P>

<P>Ich benutze den Amiga jetzt seit mehr als 10 Jahren und begann vor etwa
5 oder 6 Jahren, 'PlayHD' zu entwickeln, da ich einen
Multitrack-Audiorekorder brauchte, weil ich damals eine Menge Gitarre
spielte. Seitdem habe ich nie aufgeh&ouml;rt, es zu entwickeln, und ich
&auml;nderte den Namen in das professioneller klingende 'Audio Evolution'.
Im August '99 bekam ich pl&ouml;tzlich schwere RSI (Repetitive Strain
Injury, alias 'Maus-Arm') in beiden Armen, weshalb ich lange Zeit weder
Instrumente spielen noch einen Computer benutzen konnte. Ich m&ouml;chte
darum diese Gelegenheit nutzen um alle Computer- Benutzer da draussen zu
warnen: Wenn Eure H&auml;nde/Arme/Schultern/Nacken schmerzen, nehmt es
ernst bevor es schlimmer und lebensver&auml;ndernd wird!! Ok jetzt,
schaltet Euren Computer noch nicht ab, Ihr m&uuml;sst noch dieses Interview
fertig lesen! :-) Also, entspannt Eure Schultern, setzt Euch grade hin und
wir gehen zur n&auml;chsten Frage!</P>

<P><FONT color="#006000"><B>Kannst Du und bitte etwas &uuml;ber Deine
Software "Audio Evolution" (ex-"playHD") erz&auml;hlen?</B></FONT><BR>

Audio Evolution ist ein Audio Harddiskrecording-, Arrangier- und
Editiersystem &auml;hnlich Programmen wie CubaseSX, Logic und ProTools auf
dem PC/Mac. Es erlaubt Euch Tonaufnahmen, w&auml;hrend des Abspielens
mehrerer anderer Tonspuren. Daneben bietet es Echtzeiteffekte,
Automatisierung, Editieren, Synchronisierung mit anderen Anwendungen und
MIDI-Sequenzern usw.</P>

<P><FONT color="#006000"><B>Wie lang hat die Entwicklung bisher
gedauert?</B></FONT><BR>

Etwa 5 oder 6 Jahre.</P>

<P><FONT color="#006000"><B>Was hat Dich auf die Idee gebracht, Deine
Software (weiter) zu entwickeln?</B></FONT><BR>

Tja, OS4 kann nur zu einem wirklichen Erfolg werden wenn es Anwendungen
daf&uuml;r gibt. Also um meinen Teil zu tun, der Amiga-Gemeinschaft wieder
auf den rechten Weg zu helfen, begann ich wieder, an AE zu arbeiten. Ich
hoffe, andere werden dasselbe mit ihren Anwendungen tun!</P>

<P><FONT color="#006000"><B>Die letzte Version von "Audio Evolution" wurde
im Mai 2001 ver&ouml;ffentlicht. Warum wurden &uuml;ber ein Jahr keine
neuen Updates ver&ouml;ffentlicht?</B></FONT><BR>

Tatst&auml;chlich war das Release im Mai 2001 auch ein sehr kleines Update.
Das gr&ouml;ssere Release davor war gegen Juni 2000. Im August 2000 trat
ich dem Amiga Inc. Ausio-Team bei und hatte, neben meinem normalen Job,
einfach keine Zeit mehr, um an AE zu programmieren.</P>

<P>Gegen September 2001 h&ouml;rte ich auf, f&uuml;r Amiga Inc. zu arbeiten
und begann wieder an AE zu arbeiten. Ich beschloss, dass das n&auml;chste
Release nur f&uuml;r OS4 und PPC sein w&uuml;rde, um Qualit&auml;t zu
garantieren, da ich zuvor jede Menge &auml;rger mit dem PowerUP-Zeug hatte.
Ich portierte tats&auml;chlich den ganzen PPC-bezogenen Code zur&uuml;ck
nach 68k, damit ich einfach alles auf einmal f&uuml;r PPC rekompilieren
kann wenn OS4 ver&ouml;ffentlicht ist.</P>

<P>Um OS4 und den Amiga vorw&auml;rts zu bringen ist es keine gute
Entscheidung (und zu viel Arbeit), weiter f&uuml;r OS3/68k zu entwickeln.
Wir m&uuml;ssen uns vorw&auml;rts bewegen! :-)</P>

<P><FONT color="#006000"><B>Was meinst Du ist der Unterschied zwischen
"Audio Evolution" und vergleichbarer Software?</B></FONT><BR>

Seine einfache Bedienbarkeit, es ist billiger, und AE4 wird mehr Features
haben, die es zuvor auf dem Amiga einfach nicht gab!</P>

<P><FONT color="#006000"><B>Auf Deiner Website schreibst Du, dass "Audio
Evolution 4" in Entwicklung ist und nur f&uuml;r "AmigaOS 4.x"
ver&ouml;ffentlicht wird, heisst das, dass es zu 100% PPC
unterst&uuml;tzt?</B></FONT><BR>

Ja, es wird nativ f&uuml;r OS4/PPC kompiliert sein.</P>

<P><FONT color="#006000"><B>Kannst Du uns bitte einige kommende Features
von "Audio Evolution 4" sagen?</B></FONT><BR>

OK, ich werde nicht alles ausplaudern, aber ich nenne mal ein paar: <UL>

<LI>Non-lineares, non-destruktives Editieren auf der Zeitschiene mit
Ausschneiden, Kopieren, Einf&uuml;gen, Verschieben, Splitten, Trimmen und
Crossfade-Aktionen.</LI>

<LI>Unbegrenztes Undo.</LI>

<LI>Echtzeiteffekte mit Echtzeit-Parameterkontrolle. Parameter k&ouml;nnen
auch durch MIDI-Controller ferngesteuert und voll automatisiert werden.
Mehr Informationen werden sp&auml;ter ver&ouml;ffentlicht werden...</LI>
</UL></P>

<P><FONT color="#006000"><B>Hast Du ein Entwickler-Board oder wie kannst Du
"Audio Evolution 4" f&uuml;r "AmigaOS 4.x" entwickeln?</B></FONT><BR>

Ich stehe auf der A1-Entwicklerliste, habe mich aber dagegen entschieden,
mein Board jetzt schon zu bekommen, da an der Firmware noch gearbeitet wird
und ich nicht noch eine Linux-Inkarnation laufen lassen wollte. Wie bereits
zuvor gesagt, ist es f&uuml;r die Entwicklung f&uuml;r OS4 am besten, jetzt
unter OS3 zu entwickeln, was ich noch tue. Es hat seine Vorteile, weil wenn
es auf OS3/68k fl&uuml;ssig l&auml;uft, wird es auf OS4/PPC abrocken!
:-)</P>

<P>Ein Beispiel, ich habe die Abspiel- und Pufferungs-Routinen in AE4
komplett neu geschrieben, was bereits eine ziemliche Geschwindigkeits- und
ReaktionsSteigerung verglichen mit AE3 zeigt. Zweifellos werdet Ihr auf dem
A1 &uuml;ber 40 Spuren mit einer Menge Hallund Compressor-Plugins fahren
k&ouml;nnen!</P>

<P><FONT color="#006000"><B>Wann denkst Du werden wir die erste Demoversion
von "Audio Avolution 4" sehen k&ouml;nnen?</B></FONT><BR>

Wahrscheinlich wenn OS4 kurz vor der Ver&ouml;ffentlichung steht, was
ahem... sein wird, "wenn es fertig ist!".</P>

<P>Es wird eine eingeschr&auml;nkte OS3/68k-Demo zum Download von der
Website geben, und auf der OS4-CD wird eine Demo-Version verf&uuml;gbar
sein, die durch Registrierung leicht zu einer Lite-Version upgegradet
werden kann.</P>

<P><FONT color="#006000"><B>So, was wird aus der "Audio Evolution 3"-
Version f&uuml;r das Classic OS?</B></FONT><BR>

Es ist das sogenannte "Lebensende" f&uuml;r Software. Es wird keine weitere
Entwicklung an AE3 mehr geben.</P>

<P><FONT color="#006000"><B>Wird das neue "Audio Evolution 4" ebenfalls von
"Computer City" herausgegeben?</B></FONT><BR>

Definitiv.</P>

<P><FONT color="#006000"><B>Weisst Du, was der Verkaufspreis sein
wird?</B></FONT><BR>

Ja, wir denken an einen Preis, der h&ouml;her als der von AE3 aber immer
noch billiger als jede vergleichbare Software, die f&uuml;r Amiga, PC oder
Mac erh&auml;ltlich ist.</P>

<P>Es macht keinen Sinn, den genauen Preis zu nennen, da ich auch nicht
alle Features genannt habe, also w&uuml;rdet Ihr gar nicht wissen, was Ihr
daf&uuml;r bekommt, aber das bringe ich sp&auml;ter.</P>

<P>Leute, die ihre Registrierungskarten f&uuml;r AE3 eingeschickt haben,
werden einen Rabatt bekommen.</P>

<P><FONT color="#006000"><B>Welche Software verwendest Du zum
Entwickeln?</B></FONT><BR>

SAS/C, MuForce, PPaint und StormC4 f&uuml;r einen kleinen Teil.</P>

<P><FONT color="#006000"><B>F&uuml;r welches System (AmigaOS, AmigaDE,
MorphOS) entwickelst Du?</B></FONT><BR>

AmigaOS4.</P>

<P><FONT color="#006000"><B>Was ist der Grund, dieses OS zu
unterst&uuml;tzen?</B></FONT><BR>

Tja, siehe oben, und vom gesch&auml;ftlichen Standpunkt ist es die einzig
logische Wahl. Der Amiga-Markt ist bereits klein, und wer will schon
f&uuml;r Doppelg&auml;nger- Produkte wie MorphOS entwickeln? Das ist ein
noch kleinerer Markt! Versteht mich nicht falsch, ich fand MorphOS sehr
cool als ich es das erst Mal probierte, aber mit OS4 vor der T&uuml;r
besteht daf&uuml;r kein Bedarf mehr.</P>

<P><FONT color="#006000"><B>Welche Features zum Entwickeln vermisst Du beim
AmigaOS?</B></FONT><BR>

Eine IDE und eine Komponentenarchitektur.</P>

<P><FONT color="#006000"><B>Welche Features w&uuml;nscht Du Dir f&uuml;r
AmigaOS?</B></FONT><BR>

Speicherschutz und einen guten schnell reagierenden Scheduler.</P>

<P><FONT color="#006000"><B>Verlierst Du nicht den Spass und das Interesse
am Programmieren wenn Du die geringe Resonanz siehst, die Du aus dem
kleinen Amiga-Markt erh&auml;ltst?</B></FONT><BR>

Es ist manchmal schwer, ja. Dieses Jahr hatte ich 0 Verk&auml;ufe! Ich
hoffe, dass OS4 mit AE4 das andern wird.</P>

<P><FONT color="#006000"><B>Erh&auml;ltst Du genug Resonanz auf Deine
Software?</B></FONT><BR>

Heutzutage nicht von Kunden. Ich arbeite mit Don Cox, der mir eine Menge
n&uuml;tzlicher R&uuml;ckmeldungen gibt, AE4 jetzt seit vielen Monaten
getestet hat und nun ein neues Handbuch in HTML und PDF schreibt.</P>

<P><FONT color="#006000"><B>Welche Hard-/Software hast Du vor zu
kaufen?</B></FONT><BR>

Den AmigaONE offensichtlich, und IBrowse f&uuml;r OS4.</P>

<P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
Amiga?</B></FONT><BR>

Ich hoffe es nat&uuml;rlich, ansonsten w&auml;re all meine Arbeit verloren!
;-)</P>

<P><FONT color="#006000"><B>Deine letzten Wore an die Leser?</B></FONT><BR>

Bleibt am Ball! Ich hasse die Phrase "wenn es fertig ist" genau so sehr wie
Ihr! Und bez&uuml;glich Audio Evolution 4, falls Ihr mit aktuellen
Nachrichten versorgt werden wollt, abonniert einfach den Newsletter auf
meiner Website oder schickt mir ein E-Mail mit Fragen, Vorschl&auml;gen
oder einfach nur um mich wissen zu lassen, dass es Euch gibt und Ihr
Interesse an dem Produkt habt!</P>

<P align="center">-- &copy; Amiga Arena 07/2002 --<BR>

(aus dem Englischen von Christian Busse)</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

