<HTML>
<HEAD>
<TITLE>Interview Nr 1</TITLE>
</HEAD>

<BODY background="ncb_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<CENTER>
<P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

<TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
<TR>
<TD valign="top">Entwickler:</TD> 
<TD><B>Alfred Faust</B> </TD>
</TR>

<TR>
<TD valign="top">Software:</TD>   
<TD>BarsnPipes New 1.</TD>
</TR>

<TR>
<TD valign="top">Homepage:</TD>   
<TD>www.alfred-j-faust.de</TD>
</TR>

<TR>
<TD valign="top">Email:</TD>      
<TD>alfred.j.faustgmx.de<BR>
oder alfredfaustonlinehome.de</TD>
</TR>
</TABLE>
</CENTER>

<P><FONT color="#006000"><B>Hallo Alfred,kannst Du bitte ein wenig
&uuml;ber Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

Angefangen habe ich im Dezember 1990 mit einem AMIGA 500. Da ich im Osten
aufgewachsen bin, war das mein erster Computer &uuml;berhaupt. Entschieden
habe ich mich f&uuml;r einen AMIGA (nicht PC oder Atari), weil AMIGAs von
Haus aus einen vollwertigen (damals) Chip (PAULA) f&uuml;r die Soundausgabe
haben,der auch noch Stereo-Ausgabe hatte.</P>

<P>Bald habe ich gemerkt, was der AMIGA f&uuml;r eine fantastische Maschine
ist, deren M&ouml;glichkeiten alles &uuml;berstieg, was ich mir damals von
einem Computer vorgestellt hatte. Wegen der netten Spiele, waren bald auch
meine Kinder von der Maschine begeistert.</P>

<P>Dann kamen die ersten, f&uuml;r mich erschwinglichen Beschleuniger.
Meine Wahl fiel auf einen Apollo-Beschleuniger mit einem 68020, der auf
28Mhz &uuml;bertaktet war, und einen beeindruckenden Leistungsschub
brachte. Danach kam ein Festplattenkontroller (Combicontroller AT und SCSI)
mit einer AT-Festplatte 170MB. Die Verbl&uuml;ffung war riesig, als der
AMIGA zum ersten mal von der Festplatte bootete in 5(!) Sekunden ("nacktes"
OS2.1). Bald reichte der Platz auf dem Tisch nicht mehr aus, so kam die
Entscheidung das ganze in einen Tower zu bauen. Fr&uuml;her hatte ich
&uuml;ber viele Jahre schon duch elektronische Basteleien den Umgang mit
Leiterplatten und L&ouml;tkolben gelernt.</P>

<P>Der Umbau war nicht einfach, da es f&uuml;r den AMIGA vorgefertigte
Geh&auml;use nicht gab. Letztendlich hat dann aber doch alles funktioniert.
Bald war ich dann auch im Netz. Anfangs noch Mailbox-User mit einem Modem
1200 Bit/s (Telefonkosten je Minute 25 Pf). Sobald das Internet &uuml;ber
T-Online zug&auml;nglich war, war ich dabei. Ich habe so das Werden dieses
Netzes aller Netze in Deutschland f&uuml;r "Otto Normalverbraucher" vom
Anfang an miterlebt.</P>

<P>Sehr bald hatte ich mit dem AMIGA angefangenm Musik zu machen.
Programme, wie MED - Tracker also - haben mir sehr dabei geholfen. MIDI hat
mich sehr interessiert, aber ich war zu arm, um mir ein solches Programm zu
leisten. Die haben damals sehr viel Geld gekostet (Bars&amp;Pipes1 z.B.
480,-DM). Ich konnte mir aber dann doch ein gebrauchtes MIDI-Programm
irgendwann leisten. Zu meiner riesigen Freude bekam ich auch einen
Synthesizer (DX11 von YAMAHA) von Freunden geschenkt(!).</P>

<P>Auch hatte ich mir das Geld zusammengespart, um Bars&amp;Pipes 1.3 zu
kaufen (inzwischen war der Preis auf 390,-DM gesunken).</P>

<P>Nun konnte es richtig losgehen.<BR>
In den Jahren dazwischen hat einer meiner S&ouml;hne sich einen AMIGA1200
gekauft, sp&auml;ter auch mit 68040/40er BlizzardII und einer Festplatte
und CD-ROM.</P>

<P>Er fing bald an, selbst (meist in E) zu programmieren. Bald hatte er
sich entschlossen Informatiker zu werden. Nun studiert er an der
Technischen Uni in Ilmenau. Da er zum "normalen" PC-ler wurde, hat er mir
seinen Computer zur Nutzung &uuml;berlassen.</P>

<P><FONT color="#006000"><B>Du entwickelst das Program "Bars&amp;Pipes"
seit Juli 2001 weiter,kannst Du uns bitte erz&auml;hlen wobei handelt es
sich um "Bars&amp;Pipes"?</B></FONT><BR>

Bars&amp;Pipes Professional ist der meineserachtens beste
Multimedia-MIDI-Sequencer, der jemals f&uuml;r ein Computersystem
geschrieben wurde. Ich wage mir diese Einsch&auml;tzung,weil ich dieses
sagenhafte Programm nun von au&szlig;en und von innen sehr gut kenne. Es
ist selbst f&uuml;r nicht so erfahrene Nutzer sehr schnell zu begreifen,
wie man mit diesem Programm arbeitet.</P>

<P>MIDI: Musical Integrated Digital Interface</P>

<P>Bei MIDI-Musik werden keine T&ouml;ne &uuml;bertragen, sondern nur
Steuerbefehle f&uuml;r einen Tonerzeuger, der Kl&auml;nge intern
gespeichert hat.</P>

<TABLE border="0" summary="">
<TR>
<TD valign="top">z.B.: &nbsp;</TD>

<TD>Note an - Note aus<BR>
Anschlagst&auml;rke (wie beim Klavier)<BR>
Programmnummer (welches Instrument soll gespielt
werden)<BR>
und ...... viel .......mehr</TD>
</TR>
</TABLE>

<P>Es gab in den 80er und 90er Jahren (und gibt heute noch) auch noch
andere Ger&auml;te, die &uuml;ber MIDI gesteuert werden konnten.</P>

<TABLE border="0" summary="">
<TR>
<TD valign="top">z.B.: &nbsp;</TD>

<TD>Diaprojektoren,Tonbandmaschinen, Video-Recorder,
B&uuml;hnen Lichtanlagen und noch mehr.
</TD>
</TR>
</TABLE>

<P>Bars&amp;Pipes ist in der Lage alle diese Ger&auml;te zu synchronisieren
und so eine Multimedia-Show zu steuern.</P>

<TABLE border="0" summary="">
<TR>
<TD valign="top">z.B.: &nbsp;</TD>

<TD>einen Dia-Ton-Vortrag, bei dem der Vorf&uuml;hrer nur Bars&amp;Pipes
bedienen mu&szlig;. Das geht auch ferngesteuert, z.B. von der
Tonbandmaschine aus. Das Zusammenspiel &uuml;bernimmt dann Bars&amp;Pipes,
das im richtigen Moment das Dia wechselt, die Bandmaschine stoppt und
startet, den Tonerzeuger f&uuml;r die Musik steuert. Und nicht zuletzt
(vorausgesetzt die Technik ist vorhanden) das Licht im Raum steuert. (Wie
gesagt, das ist "nur" ein Beispiel.)</TD>
</TR>
</TABLE>

<P><FONT color="#006000"><B>Was hat Dich auf die Idee gebracht
"Bars&amp;Pipes" weiterzuentwickeln?</B></FONT><BR>
Da mu&szlig; ich etwas weiter ausholen:<BR>
1993/94 kam ja Bars&amp;Pipes Professional 2.0 sp&auml;ter 2.5 heraus.</P>

<P>Mitten in der Zeit, in der zwischen AMIGA und Win-PC ein erbitterter
ideologischer "Grabenkampf" tobte erschreckte im Oktober 1995 die
Bars&amp;Pipes-Nutzergemeinde die Nachricht, da&szlig; Blue Ribbon Inc. von
Microsoft Inc. aufgekauft wurde. Zum Trost f&uuml;r alle Nutzer wurden aber
alle Programme als Freeware ins Netz gestellt.</P>

<P>Freeware hei&szlig;t hier NICHT Public Domain -logisch - die Rechte
lagen ja nun bei Microsoft. Au&szlig;erdem mu&szlig;te man Mitglied bei
Compuserve werden, um &uuml;berhaupt an die Programme zu kommen.
Au&szlig;erdem gab es keine Anleitung dazu.</P>

<P>Ich selbst habe mir damals die Programme von Werner Gusset (in
Biel/Schweiz) besorgt, der bis dahin der offizielle Vertreiber von Blue
Ribbon Inc. Produkten in Europa war, und auch selbst die deutschen
&Uuml;bersetzungen der Handb&uuml;cher verfasst hatte. Die Programme waren
zwar jetzt kostenfrei, aber die Handb&uuml;cher nicht.</P>

<P>Mit der &Uuml;bernahme von Blue Ribbon Inc. stoppte nat&uuml;rlich
Microsoft die Weiterentwicklung von BarsnPipes.SuperJAM! (die elektronische
Begleitband) wurde f&uuml;r den PC (Win 3.1) umgesetzt.</P>

<P>Immer wieder haben es die Anwender (ich selbstverst&auml;ndlich auch)
bedauert, da&szlig; es keine Weiterentwicklung (somit auch keine
Fehlerbereinigung) von Bars&amp;Pipes gab.</P>

<P>NB: Es ist mir KEIN Computerprogramm bekannt, da&szlig; 100% fehlerfrei
ist.</P>

<P>Es hatte ein Freund aus England bei Microsoft angefragt, ob der
Quellcode zu Bar&amp;Pipes zu kaufen sei. Die Antwort war JA (!) f&uuml;r
1.000.000 (eine Million) US$. Damit war selbst AMIGA International
&uuml;berfordert.</P>

<P>So war die Zukunft von Bars&amp;Pipes hoffnungslos ...</P>

<P>Doch das konnte und durfte doch nicht sein, da&szlig; so ein geniales
Programm einfach im "Nirwana" verschwindet.</P>

<P>Inzwischen hatte ich gelernt in C zu programmieren, und hatte ein
Toolset f&uuml;r die hervorragende Soundkarte DB-50XG von YAMAHA
geschrieben. So bin ich durch und &uuml;ber Bars&amp;Pipes zum
(Hobby)-Programmierer geworden.</P>

<P><FONT color="#006000"><B>Wie bist Du an den Source Code gekommen bez.
wie kam der Kontakt zu "Todor Fay" zustande?</B></FONT><BR>

Da ich mit viel M&uuml;he eine eigene Homepage aufgebaut hatte (die sich
ganz um das Thema "Bars&amp;Pipes" und Blue Ribbon Inc. rankte), wollte ich
die Erlaubnis einholen, alle Blue Ribbon Inc. Produkte zum Download auf
meiner Seite zur Verf&uuml;gung zu stellen. Inzwischen hatte ich alles mir
erreichbare Material im Netz aufgesammelt.</P>

<P>Die e-mail Adresse von Todor Fay hatte ich dann rein zuf&auml;llig bei
einem meiner Streifz&uuml;ge im Netz gefunden. Auf meine Anfrage um die
oben genannte Erlaubnis, hat er mir sehr freundlich und umfassend
geantwortet.</P>

<P>Doch der Quelltext blieb mir (uns) versagt.... :-((</P>

<P>Wie gro&szlig; war dann die Freude, als Todor Fay uns (die Newsgroup
"barsnpipes" bei groups.yahoo.com) Ende November 2000 ganz
&uuml;berraschend mitteilte: (sinngem&auml;&szlig;)</P>

<P>"... also Freunde, so kann das nicht weitergehen.Gibt es unter Euch
Freiwillige,die bereit w&auml;ren, an einer Ver&ouml;ffentlichung des
Quelltextes von Bars&amp;Pipes mitzuarbeiten?"</P>

<P>Da war ich einer der ersten, die eine R&uuml;ckmeldung machten.
Insgesamt sind es wohl 8 Programmierer auf der ganzen Welt gewesen, denen
Todor Fay am 4.12.2000 dann den Quelltext von Bars&amp;Pipes2.5cbeta (nicht
die letzte offizielle Ausgabe von Bars&amp;Pipes Pro 2.5b) schickte.</P>

<P>Ich war erstaunt; der gesamte Quelltext war nicht gr&ouml;&szlig;er als
2,5 MB und bestand aus 136 Dateien.</P>

<P>Damals war die Freude dar&uuml;ber bei mir so gro&szlig;, da&szlig; ich
mich sofort in die Arbeit st&uuml;rtzte.</P>

<P>Inzwischen war ich Invalidenrentner geworden, und habe dadurch relativ
viel Zeit, ja ich m&ouml;chte sagen, die Arbeit an Bars&amp;Pipes ist nun
mein Lebensinhalt geworden.</P>

<P>Ich hatte (damals) keine Ahnung, worauf ich mich eingelassen hatte.</P>

<P>Erst ca. 6 Monate sp&auml;ter war der teilweise unvollst&auml;ndige,
teilweise fehlerhafte Code dieser Ausgabe dann soweit gebracht (inclusive
der Quelltexte der Tools, Accessories und Libraries), da&szlig; man sofort
ohne Probleme ein lauff&auml;higes Bars&amp;Pipes daraus kompilieren
konnte.</P>

<P>Mitte Mai 2001 hat dann Todor Fay die offizielle Ausgabe des Quelltextes
authorisiert.</P>

<P><FONT color="#006000"><B>Liegt das Copyright jetzt bei
Dir?</B></FONT><BR>
Dazu mu&szlig; man zweierlei sagen: <OL>

<LI>Das Copyright des ver&ouml;ffentlichten Quellcodes, so wie er auf
meiner Homepage zum Download bereit steht, liegt bei Microsoft. Inc. . D.h.
wenn jemand diesen Quellcode irgendwo herausgibt, MUSS der
Copyright-Vermerk in den unver&auml;nderten Dateien enthalten sein.
<BR><BR>
JEDER (der m&ouml;chte) kann den Quelltext (ganz oder teilweise) frei
f&uuml;r eigene (FREEWARE!!!)-Projekte verwenden.</LI>

<LI>Sobald man den Quelltext f&uuml;r eigene Projekte nutzt
(ver&auml;ndert) kann auch der Copyright-Vermerk wegfallen, dann kann man
seinen eigenen Copyright-Vermerk einf&uuml;gen.</LI></OL></P>

<P>F&uuml;r die Nutzung des Quellcodes hat Microsoft
Einschr&auml;nkungen gemacht: <OL>

<LI>Der Quelltext ist Freeware aber kein Public Domain, d.h. er kann NICHT
im AMINET ver&ouml;ffentlicht werden.</LI>

<LI>Niemand darf damit Geld verdienen.</LI>

<LI>Niemand darf sein Copyright vor Gericht einklagen,wenn er den Quelltext
benutzt. Was soll das hei&szlig;en?<BR>

Microsoft will damit vermeiden,da&szlig; sie indirekt in
Schadenersatzforderungen Dritter hineingezogen werden.Wer das amerikanische
Rechtssystem ein klein wenig kennt, wei&szlig; weshalb diese
Einschr&auml;nkung gemacht worden ist. Dort gehen Schadensersatzforderungen
meist in die Millionen.</LI></OL></P>

<P>Ich meine dies alles hat seine Berechtigung. Denn mit diesem Quelltext
gibt Blue Ribbon Inc. seine (berechtigt) lang geh&uuml;teten Geheimnisse
preis.</P>

<P>Die Programmierer von Blue Ribbon Inc. (vor allem Todor Fay) haben mit
Bars&amp;Pipes ein unglaublich geniales Programmierkonzept entworfen. Ein
Programm mit dieser Funktionsvielfalt,seiner genialen PlugIn-Schnittstelle
(mit der es beinahe beliebig erweiterbar ist) w&uuml;rdeauf einem Win98-PC
ganz sicher 8-10MB gro&szlig; sein, und w&uuml;rde Unmengen an Resourcen
benutzen.</P>

<P>Zeitweise war ich der einzige Programmierer auf der ganzen Welt,der
effektiv an Bars&amp;Pipes weitergearbeitet hat.</P>

<P>Um die N&auml;he zu dem originalen Bars&amp;Pipes zu zeigen und doch
klarzustellen, da&szlig; die Weiterentwicklung eine neue
"Entwicklungslinie" ist, habe ich den Namen zu: BarsnPipes New
ge&auml;ndert. Ich hatte auch ein eigenes Copyright angebracht.</P>

<P>Nun hat sich aber gezeigt, da&szlig; durch mein "Vorpreschen" einige von
denen, die auch den Quelltext bekommen haben, sich nicht mehr trauten
irgend etwas selbst anzugreifen, damit am Ende nicht 7 verschiedene
Bars&amp;Pipes auf dem Markt sind.</P>

<P>Besonders Richard Hagen aus Australien ist es zu verdanken, der seinen
eigenen Computer als Server zur Verf&uuml;gung stellte, da&szlig; nun ein
zentraler "Software-Sammelpunkt" weltweit existiert, wo alle Entwickler
mitarbeiten k&ouml;nnen.</P>

<P>Nach dem Aufbau dieses "CVS"-Systems, habe ich mein Copyright wieder
entfernt,arbeite aber kontinuierlich weiter. Das Tempo h&auml;ngt immer ein
wenig davon ab, was ich zu leisten imstande bin, und was die Nutzer
f&uuml;r W&uuml;nsche haben.</P>

<P><FONT color="#006000"><B>Was zeichnet den Amiga heute noch aus um mit
Ihm Musik zu erstellen?</B></FONT><BR>

Nachdem ich auch einige Jahre (man kommt einfach nicht darum herum) einen
Win98-PC benutze, m&ouml;chte ich dazu folgendes sagen: <OL>

<LI>Es gibt auf beiden Systemen hervorragende Musikprogramme.</LI>

<LI>Inzwischen sind aber auf dem AMIGA fast alle Profi-Musik-Programme
Freeware geworden, z.B. (nicht vollst&auml;ndig)<BR>
Bars&amp;Pipes<BR>
Camouflage<BR>
OctaMED Soundstudio<BR>
Samplitude Plus</LI></OL>

Der AMIGA braucht im Gegensatz zum PC wesentlich weniger Resourcen
(Speicher, Festplattenplatz). </P>

<P>Ich selbst arbeite mit 32 MB Fast-Ram un einer 3,2 GB Festplatte. Beides
wird im Normalfall nur zu 50% genutzt.</P>

<P>(NB: Win98 f&auml;ngt bei 32 MB RAM gerade erst an, vern&uuml;nftig zu
arbeiten,da l&auml;uft aber noch kein anderes Programm.)</P>

<P>Ich habe Kontakt zu BarsnPipes Nutzern auf der ganzen Welt.Viele haben
mir schon geschrieben, da&szlig; BarsnPipes f&uuml;r sie der einzige Grund
ist, beim AMIGA zu bleiben.</P>

<P><FONT color="#006000"><B>Amiga und MIDI ist meines Erachtens eine der
wenigen bekannten St&auml;rken des Amigas, was denkst Du wieso konnte sich
der Amiga bei Musikern nicht gegen&uuml;ber dem Atari,trotz des damals
besseren Soundchips behaupten?</B></FONT></P>

<P>Der Grund war eindeutig, da&szlig; der Atari mit einem eingebauten
MIDI-Interface ausgeliefert wurde, da&szlig; man sich (damals) beim AMIGA
erst f&uuml;r teures Geld extra kaufen mu&szlig;te. So haben die
MIDI-Programmierer (z.B. Steinberg) den Atari als Ziel ausgeguckt.</P>

<P><FONT color="#006000"><B>Wer nutzt heute noch den Amiga f&uuml;r Musik
bzw. worin siehts Du den Vorteil von Amiga und
"Bars&amp;Pipes"?</B></FONT><BR>

Einiges ist ja schon gesagt worden.</P>

<P>Die einfache Bedienungs-Oberfl&auml;che von Bars&amp;Pipes und der
geniale Track-Editor sind die St&auml;rken des Programmes.</P>

<P>Beispiele:<BR> Das Konzept "Bars" (Takte) &amp; "Pipes" (R&ouml;hren)
ist auf Anhieb von JEDEM zu verstehen.</P>

<P>Ein Track ist wie eine Spur in einer Mehrspurbandmaschine. Jeder Track
hat einen Eingang (links) einen Sequencerteil (in der Mitte wo sich die
aufgenommenen Daten befinden) und einen Ausgang (rechts).</P>

<TABLE border="0" cellspacing="0" cellpadding="0" summary="">
<TR>
<TD width="20">&nbsp;</TD>
<TD></TD>
<TD></TD>
<TD align="center">Pipeline</TD>
<TD></TD>
<TD align="center">Pipeline</TD>
<TD></TD>
<TD></TD>
</TR>

<TR>
<TD colspan="8"></TD>
</TR>

<TR>
<TD></TD>
<TD></TD>
<TD>-</TD>
<TD></TD>
<TD>---------------------------</TD>
<TD></TD>
<TD>-</TD>
<TD></TD>
</TR>

<TR>
<TD></TD>
<TD>|</TD>
<TD>O</TD>
<TD>| --------- |</TD>
<TD></TD>
<TD>| ------------- |</TD>
<TD>O</TD>
<TD>|</TD>
</TR>

<TR>
<TD></TD>
<TD></TD>
<TD>-</TD>
<TD></TD>
<TD>---------------------------</TD>
<TD></TD>
<TD>-</TD>
<TD></TD>
</TR>

<TR>
<TD colspan="8"></TD>
</TR>

<TR>
<TD></TD>
<TD colspan="3">Eingang</TD>
<TD align="center">Sequencer</TD>
<TD colspan="3" align="right">Ausgang</TD>
</TR>
</TABLE>

<P>Links flie&szlig;en die "Events" hinein, in der Mitte werden sie
aufgenommen, und rechts flie&szlig;en sie wieder heraus.</P>

<P>Um Events zu ver&auml;ndern (z.B. alle sollen lauter werden) nimmt man
ein entsprechendes Werkzeug (Tool) aus der Werzeugkiste (Toolbox) mit der
Maus und l&auml;&szlig;t es auf der entsprechenden Pipeline fallen. Alle
Events die durch die Pipeline flie&szlig;en, m&uuml;ssen durch das Tool
hindurch und werden nach Wusch (einstellbar) ver&auml;ndert.</P>

<P>Dies ist nur ein ganz kleines Beispiel der gigantischen
Funktionsf&uuml;lle von Bars&amp;Pipes.</P>

<P>Ich habe eine eigene Anleitung f&uuml;r Bars&amp;Pipes Professional 2.5b
geschrieben.Dazu habe ich ALLE(!) Funktionen des Programmes getestet.
Insgesamt hat es etwa ein ganzes Jahr gedauert, diese Anleitung fertig zu
stellen.</P>

<P><FONT color="#006000"><B>Gibt es noch Alternative Programme zu
"Bars&amp;Pipes"?</B></FONT><BR>

Ja es gibt noch einige MIDI-Sequencer f&uuml;r AMIGA. Z.B. ist Camouflage
ein ganz hervorragendes Programm. Es ist aber, selbst f&uuml;r mich, nur
schwer zu durchschauen.</P>

<P>Der "Normal"-Anwender, d&uuml;rfte das Programm kaum l&auml;ngere Zeit
benutzen. Besonders schwer ist es, direkt an die Daten ("Events")
heranzukommen.</P>

<P>Daf&uuml;r hat Bars&amp;Pipes einen ganz hervorragenden Editor,der nach
dem WYSIWYG Prinzip arbeitet. Da ist ein Stift zum Einzeichnen neuer
Events, ein Zauberstab zum Ver&auml;ndern, ein Radierer zum L&ouml;schen,
eine Hand zum Verschieben und und und ...</P>

<P><FONT color="#006000"><B>W&uuml;rdest Du "Bars&amp;Pipes" auch
Einsteigern empfehlen oder richtet es sich mehr an Profis?</B></FONT><BR>

Gerade Einsteigern empfehle ich Bars&amp;Pipes. In meiner Anleitung habe
ich geschrieben, da&szlig; (vorausgesetzt die erforderlichen Ger&auml;te
sind vorhanden und korrekt verkabelt) die Erstellung eines (einfachen)
Songs selbst f&uuml;r einen Neueinsteiger in maximal einer Stunde erledigt
sein d&uuml;rfte.</P>

<P><FONT color="#006000"><B>Welche Software verwendest Du zum
Entwickeln?</B></FONT><BR>

Da ist zuerst der unvergleichliche GoldED6 von Dietmar Eilert. Bisher habe
ich PC-Bereich keinen vergleichbaren Editor gefunden.</P>

<P>Als Kompiler dient mir SAS/C V.6.68</P>

<P><FONT color="#006000"><B>Was k&ouml;nnen wir von zuk&uuml;nftigen
Versionen erwarten?</B></FONT><BR>

Ich selbst w&uuml;nsche mir noch eine Verbesserung des Notenausdruckes.
Seit einiger Zeit arbeite ich an dem Problem.Die wichtigste H&uuml;rde ist
eine sogenannte Render-Engine zu finden, die schnell ist, und einfach in
der Bedienung.</P>

<P>Sehr erfolgversprechend ist die ttrender.library V.3.1 von Grzegorz
Kraszewski (krashan@matay.pl)</P>

<P><FONT color="#006000"><B>Wird es m&ouml;glich sein ein "Glow Icon"
Design zu erstellen?</B></FONT><BR>

Ein Glow Icon ... Freiwillige vor ... ;-))</P>

<P><FONT color="#006000"><B>Welches Betriebssystem wirst Du zuk&uuml;nftig
unterst&uuml;tzen?</B></FONT><BR>

Interessant d&uuml;rfte sein, da&szlig; ich zwei Versionen compiliere.<OL>

<LI>eine mit der von Bars&amp;Pipes Pro gewohnten
Oberfl&auml;che in 8 Farben f&uuml;r OS 2.1 / ECS / 68000 mit mindestens
1MB Chip- und 2MB Fast-RAM,</LI>

<LI>eine mit einer von mir (optisch) erneuerten Oberfl&auml;che in 32
Farben f&uuml;r OS 3.0 (und h&ouml;her) / AGA / 68020 (und
h&ouml;her).</LI></OL>

OS 1.3 wird nicht mehr unterst&uuml;tzt, da die meisten Requester die
Gadtools.library ben&ouml;tigen. </P>

<P><FONT color="#006000"><B>Was sind die Gr&uuml;nde um dieses OS zu
unterst&uuml;zen?</B></FONT><BR>

In Australien ist ein Freund, der Bars&amp;Pipes f&uuml;r seine
Musikproduktion benutzt,der hat einen erweiterten AMIGA 1000. Mit seiner
Hilfe habe ich die "abger&uuml;stete" Version erstellt, die au&szlig;er der
Oberfl&auml;che die selben Funktionen hat wie die "Normale". Er benutzt
OS2.1.</P>

<P>So kann man sagen BarsnPipes New l&auml;uft auf allen AMIGAS ab OS2.1,
mit ECS, AGA oder Grafikkarte.</P>

<P><FONT color="#006000"><B>Welche M&ouml;glichkeiten vermisst Du am
AmigaOS f&uuml;r die Entwicklung?</B></FONT><BR>

Im wesentlichen nur die Geschwindigkeit. "Unser aller Petro" hat ja mal
gesagt, er w&uuml;nscht sich einen 68060 mit 200Mhz ... das w&auml;re
es.</P>

<P><FONT color="#006000"><B>Welche M&ouml;glichkeiten w&uuml;nschst Du Dir
f&uuml;r die Entwicklung am Amiga?</B></FONT><BR>

Fast bin ich geneigt "Keine" zu sagen, weil es ja doch so viele tolle
Nachr&uuml;stungen gibt.</P>

<P>Am AMIGA ein Programm zu entwickeln, ist reine Freude, will man es
vergleichen mit der Entwicklung am PC (wo ich mal reingeschnuppert
habe).</P>

<P>Die Sprache C ist zwar dieselbe, aber die M&ouml;glichkeiten f&uuml;r
Entwickler sind auf dem AMIGA einfacher und &uuml;berschaubarer. Am Ende
kommen gute, schnelle und kleine(!) Programme heraus.</P>

<P><FONT color="#006000"><B>Verlierst Du nicht den Spass und das Interesse
am Programmieren wenn Du die geringe Resonanz siehst, die aus dem kleinen
Amiga-Markt erh&auml;ltst?</B></FONT><BR>

Das spielt f&uuml;r mich eigentlich &uuml;berhaupt keine Rolle. Ich
schreibe auch schon mal ein kleines Tool f&uuml;r BarsnPipes, wenn es einer
der Nutzer m&ouml;chte.</P>

<P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
Amiga?</B></FONT><BR>

Bei dem heutigen Konkurenzdruck auf dem Computermarkt ... ehrlich gesagt
nein.</P>

<P>Das ist kein Pessimismus, sondern Realismus. Die Zeiten sind halt
vorbei, als der AMIGA DER Computer war. Seien wir mal ehrlich, wie
m&uuml;&szlig;te denn ein AMIGA aussehen, der mithalten k&ouml;nnte?

<TABLE border="0" summary="" cellspacing="0" cellpadding="0">
<TR>
<TD width="20">-</TD>
<TD>Prozessor:</TD>        
<TD>schneller als G4</TD>
</TR>

<TR>
<TD>-</TD>
<TD>RAM:</TD>
<TD>mindestens DDR-RAM</TD>
</TR>

<TR>
<TD>-</TD>
<TD>Schnittstellen: &nbsp; </TD>
<TD>alles, was heute verf&uuml;gbar ist (von USB2 bis Firewire)</TD>
</TR>

<TR>
<TD>-</TD>
<TD>Grafik:</TD>
<TD>kaum mehr zu &uuml;berbieten.</TD>
</TR>
</TABLE>

Doch die Frage ist, mu&szlig; ein neuer AMIGA sein? Ich meine, die guten
"alten" Maschinen sind in ihren M&ouml;glichkeiten doch nicht
ersch&ouml;pflich. </P>

<P>So d&uuml;rfte es wohl am sinnvollsten sein selbstbewu&szlig;t eine
(wenn auch kleine) Marktl&uuml;cke zu f&uuml;llen. Es d&uuml;rfte nur
f&uuml;r Leute, die damit ihren Lebensunterhalt bestreiten m&uuml;ssen,
nicht m&ouml;glich sein, allein f&uuml;r den AMIGA zu arbeiten.</P>

<P><FONT color="#006000"><B>Deine letzten Worte an die
Leser?</B></FONT><BR>

Langsam aber sicher bekommt unser guter alter AMIGA Oldtimer-Status. Und
das ist wie bei den Freunden alter Autos. Wer seinen AMIGA liebt, sollte
ihn auf keinen Fall ausmustern. Ich garantiere, es kommt die Zeit, da ist
man f&uuml;r jedes dieser guten St&uuml;cke dankbar, wenn man einen
hat.</P>

<P>Ich bleibe dabei .... ;-))</P>

<P align="center">-- &copy; Amiga Arena 07/2002 --</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

