<HTML>
<HEAD>
<TITLE>Interview Nr 2</TITLE>
</HEAD>

<BODY background="ncb_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<CENTER>
<P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

<TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
<TR>
<TD valign="top">Entwickler:</TD>
<TD><B>Andreas Kleinert</B> </TD>
</TR>

<TR>
<TD valign="top">Software:</TD>  
<TD>SView, SBase, Datatypes</TD>
</TR>

<TR>
<TD valign="top">Homepage:</TD>  
<TD>http://www.ar-kleinert.de</TD>
</TR>

<TR>
<TD valign="top">Email:</TD>     
<TD>info@ar-kleinert.de</TD>
</TR>
</TABLE>
</CENTER>

<P><FONT color="#006000"><B>Hallo Andreas,kannst Du bitte einwenig
&uuml;ber Dich und Deinem Amiga Werdegang erz&auml;hlen?</B></FONT><BR>

Ich weiss nicht genau, was ich in den letzten Interviews so geschrieben
habe, aber eine Kurzfassung der Stationen w&uuml;rde in etwa wie folgt
aussehen: <UL>

<LI>Amiga seit 1988</LI>

<LI>Programmierung des Amiga (bevorzugt in C) seit 1989</LI>

<LI>in 1993 (nach kleineren Tools) Beginn der Arbeit an SView und
-Library</LI>

<LI>diverse Kooperationen mit den Entwicklern von Picture Manager und
ImageEngineer folgten</LI>

<LI>sp&auml;ter Plugins f&uuml;r ArtEffect</LI>

<LI>parallel dazu div. weitere Entwicklungen, sowie die erste (zweite)
PPC-Software f&uuml;r die phase5-Boards (die erste kam von Cloanto, lief
dann aber nach einer LastMinute-&Auml;nderung der ppc.library nicht
mehr)</LI>

<LI>Y2K-Anpassung von SBase professional</LI>

<LI>diverse andere Programme, wie akMPEG oder die akDatatypes (68k, PPC und
WarpOS)</LI>

<LI>uvm.</LI></UL>

Anfang 2000 war ich eigentlich im AmigaDE-Kernteam von Amiga Inc. dabei
(siehe das damalige Executive Update), wollte mich dann allerdings doch
erst einmal wieder auf mein Studium konzentrieren und habe dann "was
anderes" gemacht (ebenfalls eine bekannte Firma mit Amiga-Bezug, aber mehr
wird nicht verraten). </P>

<P><FONT color="#006000"><B>Nachdem Du Dich ja eigentlich vom AMIGA Markt
verabschiedet hattest,erschien vor kurzem ein Update Deiner Dataypes,wie
kam es dazu?</B></FONT><BR>

Ich hatte schon l&auml;nger geplant meinen A4000/PPC durch etwas
neues,frisches zu ersetzen.</P>

<P>Einerseits weil die Hardware sicher nicht ewig halten wird, andererseits
wegen der immensen Kosten wegen der limitierten Auflagen existierender
Hardware (Aufr&uuml;stung, Ersatz).</P>

<P>Wo bekommt man heute noch genau die UW-Festplatten, die man f&uuml;r
phase5-Boards braucht? Oder PS/2-Speicher? Wie packe ich einen zweiten
IDE-Controller in einen Desktop-Rechner, wo der CD-Brenner am internen Port
sonst nur regelrecht dahinschleicht? etc.</P>

<P>Aus der Sicht eines Software-Entwicklers hat Amithlon den Vorteil, dass
die Plattform wieder recht einheitlich ist: <UL>

<LI>800x600 in 24 Bit mit Picasso96 ist praktisch Minimum</LI>

<LI>weniger als 128 MB RAM hat keiner</LI>

<LI>OS 3.9 mit Boingbag 1/2 ist vorhanden</LI>

<LI>die 68k-CPU ist ausreichend schnell f&uuml;r alles</LI>

<LI>nervige (PPC) Dual-CPU-Programmierung und viele Spezialf&auml;lle haben
sich erledigt</LI> </UL></P>
         

<P><FONT color="#006000"><B>Wirst Du wieder verst&auml;rkt f&uuml;r den
Amiga entwickeln oder handel es sich hier um eine "Entwickler
Laune"?</B></FONT><BR>

Ich sehe da keinen Widerspruch. Die Entwicklung von (Hobby-)Software muss
auch - und sogar in erster Linie - Spass machen. Die Uneinheitlichkeit der
Amiga-Plattform, die 1000 zu ber&uuml;cksichtigenden Konfigurationen, Hacks
und Patches haben den Spass verdorben.</P>

<P>Amithlon - oder auch PPC-Systeme, wenn sie denn mal kommen - machen hier
wieder einen l&auml;ngst f&auml;ligen Schnitt. Ich m&ouml;chte gerne bei
Software sagen k&ouml;nnen "l&auml;uft erst ab OS 3.9 mit 128 MB RAM und 5x
060-Power".</P>

<P>Solange ich Spass daran habe - und entsprechend Zeit &uuml;brig - werde
ich div. Sachen f&uuml;r OS 3.9-Amithlon anpassen.</P>

<P><FONT color="#006000"><B>Bereust Du es Deinen Amiga verkauft zu haben
und hat es Dich nicht einwenig verletzt nachdem Du so "unsch&ouml;n" von
den Amiga Usern Kritisiert wurdest?</B></FONT><BR>

Es gab keine zeitliche Pause zwischen meinem A4k und dem Amithlon-Amiga,
insofern auch keine Zeit irgendetwas zu bereuen. Den Amiga habe ich stets
verwendet, allerdings ein paar Monate lang praktisch nur noch, um meine
eMail zu beantworten (was in Zeiten div. eMail-Viren und -W&uuml;rmer recht
praktisch ist).</P>

<P>Was die Kritik angeht: man kann es ohnehin nicht allen recht machen, und
die meiste Kritik disqualifiziert sich bereits durch die Anonymit&auml;t
der jeweiligen Schreiber in irgendwelchen Foren - w&uuml;rde mich nicht
&Uuml;berraschen, wenn da anonym der eine oder andere hetzt, der einem in
eMails dann wieder den sprichw&ouml;rtlichen Honig um's Maul
schmiert...</P>

<P>Sachliche Kritik ist immer in Ordnung. Aber im Amiga-Bereich herrscht
meist eher Fandom (Fan kommt bekanntlich von Fanatic) vor.</P>

<P><FONT color="#006000"><B>Desweiteren wurden die Datatypes nicht nur
f&uuml;r "Amithlon" angepast sonder Du hast Sie auch als
"Freeware"freigeben,sind die User nicht mehr bereit "Shareware" Datatypes
zu akzeptieren oder was war der Grund f&uuml;r eine
Freigabe?</B></FONT><BR>

Die Einschr&auml;nkungen der Datatypes waren in der 68k-Version eigentlich
schon l&auml;nger kaum noch vorhanden - da die PPC-Version jetzt
weggefallen ist, erschien es nur logisch, auch das Keyfilesystem
fallenzulassen.</P>

<P>Wer eine PPC-Version braucht, kann inzwischen relativ g&uuml;nstig z.B.
bei Schatztruhe die "SViewIV Productivity Suite" erwerben - da sind dann
u.a. sogar noch SViewIV und akMPEG dabei.</P>

<P>Ausserdem ist es nat&uuml;rlich richtig, dass niemand mehr f&uuml;r
(PPC-)Datatypes extra bezahlen will. Ich bin auch sicher, dass in OS 4.0
weitere dabei sein werden.</P>

<P><FONT color="#006000"><B>Worin siehst Du die Vorteile zu Deinen
Datatypes im vergleich zu anderen?</B></FONT><BR>

Ich weiss nicht, wieso von mir &uuml;berwiegend nur die Datatypes
wahrgenommen werden und wurden. Vermutlich, weil jeder welche braucht, und
mir es nie richtig gelungen ist, die Vorteile von z.B. SViewIV so richtig
rauszustellen - es ist oft ja auch eher im Hintergrund aktiv (Picture
Manager, ImageEngineer).</P>

<P>Die Vorteile der Datatypes... nunja. F&uuml;r mich ist nat&uuml;rlich
sehr wichtig, zu wissen, was innendrin passiert ;-) F&uuml;r den Anwender
w&uuml;rde ich dementsprechend als Vorteil die gute Konfigurierbarkeit und
die M&ouml;glichkeit, auf Per-Task-Basis unterschiedliche Konfigurationen
anzulegen, nennen.</P>

<P><FONT color="#006000"><B>Kannst Du uns jetzt schon was &uuml;ber weitere
geplante Features, Programmversion etc. erz&auml;hlen?</B></FONT><BR>

Nein. -- Was ich mir demn&auml;chst nochmal anschauen werde, ist
akMPEG.</P>

<P>Bei der PPC-Version wusste man nie, wo man nach Bugs suchen soll -
irgendwelche Cache-&Uuml;berlappungen in irgendeinem Systemodul (akMPEG?
AHI? mpegaPPC?) fallen nun in der emulierten 68k-Umgebung von Amithlon
endlich weg, so dass ich vielleicht die Audioausgabe endlich einmal richtig
zum Laufen bekomme...</P>

<P>Ich h&auml;tte gerne Software f&uuml;r MorphOS entwickelt - aber
einerseits sind mir die PPC-Karten zu leistungsschwach, andererseits gab es
am Anfang keinen wirklich leicht zu benutzenden Compiler. Wenn man
Entwickler-Support m&ouml;chte, sollten gerade diese H&uuml;rden recht
gering sein. Deshalb habe ich mich von der MOS-Entwicklung relativ
fr&uuml;h abgekoppelt - wenn sowohl die Pegasos- Boards als auch eine
komplette Entwicklungsumgebung (am Besten als Beilage auf CD, mit
Installer) <B>wirklich</B> verf&uuml;gbar sind, werde ich mir das System
noch einmal genauer ansehen. Das gilt ggf. auch f&uuml;r AmigaOS 4.0 &amp;
Co. - auch wenn ich garantiert keinen Coupon f&uuml;r $50 darauf
"verwetten" wollen w&uuml;rde. Erst die Ware, dann das Geld...</P>

<P><FONT color="#006000"><B>Welche Software verwendest Du zum
Entwickeln?</B></FONT><BR>

SAS/C und StormWizard. Vielleicht demn&auml;chst Reaction oder MUI. Mal
sehen.</P>

<P><FONT color="#006000"><B>Wirst Du Deine anderen Amiga Programme weiter
entwickeln oder f&uuml;r "Amithlon" anpassen?</B></FONT><BR>

Ich denke daran, den jetzigen PPC-Support komplett zu entfernen, und einige
Programme mit Blick auf Amithlon weiter zu entwickeln. Sp&auml;ter
k&ouml;nnte man dann ja immer noch wieder f&uuml;r PPC recompilieren - wenn
das wirklich so einfach ist, wie immer gesagt wird...</P>

<P><FONT color="#006000"><B>Werden diese auch "Feeware"?</B></FONT><BR>

Nein.</P>

<P><FONT color="#006000"><B>K&ouml;nnen Wir in Zukunft auf neue Versionen
von "SVievIV", "akMPEG" oder "JPEG-Box" hoffen?</B></FONT><BR>

Hope dies at last ;-)</P>

<P><FONT color="#006000"><B>Wie gef&auml;llt Dir das AmigaOS unter
"Amithlon"?</B></FONT><BR>

Super. Alleine schon die M&ouml;glichkeit, billige Netzwerkkarten verwenden
und endlich den Amiga mit dem PC (Samba) vernetzen zu k&ouml;nnen. Oder
DSL-Anbindung.</P>

<P><FONT color="#006000"><B>Siehst Du hier die Zukunft f&uuml;r das
AmigaOS?</B></FONT><BR>

Das h&auml;ngt davon ab, wieviele ihrer Versprechen die PPC-Fraktion (und
vor allen Dingen: wann) halten kann.</P>

<P><FONT color="#006000"><B>Glaubst Du an ein Comeback von
Amiga?</B></FONT><BR>

Das ist schwer zu sagen. Wie definiert man Comeback? W&auml;re es ein
Comeback, wenn AmigaOS 4.0 auf einer SetTopBox laufen w&uuml;rde?</P>

<P>Sicher ist der Zug f&uuml;r Betriebssysteme ohne Speicherschutz
abgefahren.</P>

<P>Andererseits soll AmigaOS 4.0 Speicherschutz bekommen. Desweiteren hat
Java ebenfalls keinen Speicherschutz, und wenn .NET Applikationen &uuml;ber
das Internet laufen, dann reicht bereits ein verlorenes Packet oder eine
"lost connection", um zu verdeutlichen, dass das WWW eben per se ein
"grosser, ungesch&uuml;tzer Speicher" ist.</P>

<P>Man wird sehen. Jeder Anwendung ihre Nische. DVD-Player und Handies
haben schliesslich auch keinen Speicherschutz.</P>

<P><FONT color="#006000"><B>Deine letzten Worte an die
Leser?</B></FONT><BR>

Den Spass nicht vergessen. Es ist schliesslich nur ein Hobby.</P>

<P align="center">-- &copy; Amiga Arena 07/2002 --</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

