<HTML>
<HEAD>
<TITLE>Interview Nr 4</TITLE>
</HEAD>

<BODY background="ncb_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<CENTER>
<P><FONT color="#000080" size="7"><B>Amiga Arena Interview</B></FONT></P>

<TABLE width="60%" cellpadding="0" cellspacing="0" summary="">
<TR>
<TD valign="top">Entwickler:</TD> 
<TD><B>Gods &amp; IRIS</B> </TD>
</TR>

<TR>
<TD valign="top">Software:</TD>   
<TD>D.I.S.C.</TD>
</TR>

<TR>
<TD valign="top">Homepage:</TD>   
<TD>www.idf.net/gods</TD>
</TR>

<TR>
<TD valign="top">Email:</TD>      
<TD>zerox@post.com</TD>
</TR>
</TABLE>
</CENTER>

<P><FONT color="#006000"><B>Hallo Frode, kannst Du uns bitte etwas
&uuml;ber Dich und Deinen Amiga-Hintergrund erz&auml;hlen?</B></FONT><BR>

Hallo Olaf, nat&uuml;rlich kann ich. Ich bin 28 Jahre alt und lebe im
S&uuml;dwesten Norwegens in einer Stadt namens Stavanger. Meine Ausbildung
hat nichts mit dem Amiga noch anderen Computern zu tun, da ich ein "Anwalt"
bin (Jura-Studium) und heutzutage an Steuerangelegenheiten arbeite.</P>

<P>Nachdem ich einige Jahre einen alten Commodore 64 hatte, kaufte ich 1987
schlie&szlig;lich einen Amiga 500. Und tja... Ich liebte die Maschine und
nach einiger Zeit als Spiele-Verr&uuml;ckter, begann ich etwas kreativ zu
werden und trat der "Szene" bei. Der Rest ist wirklich Geschichte... In der
Szene werde ich Zerox genannt.</P>

<P><U><B>Der Einstieg:</B></U></P>

<P><FONT color="#006000"><B>Wie kamst Du in die "Szene"?</B></FONT><BR>

Als ich einige fantastische Spiele auf dem Amiga spielte, begann ich mit
einigen Freunden und anderen innerhalb und au&szlig;erhalb Norwegens zu
tauschen. Dann kam ich mit der Cracker-Szene in Ber&uuml;hrung, da mir
manche Leute Spiele schickten, die keine Originale sondern von bestimmten
Gruppen gecrackt waren. Die hatten am Anfang ihr eigenes Intro
eingef&uuml;gt. Zwischen den Spielen schickten mir manche Leute auch Demos.
Ich fand sie interessant und wurde neugierig, also nahm ich mit einigen
Szenern Kontakt auf, die ihre Adressen in diese Produktionen eingef&uuml;gt
hatten. Ich begann Demos, Intros, Mags usw. zu tauschen und schloss mich
damals im Januar 1989 meiner ersten internationalen Amiga-Gruppe namens
Argon an. Mehr Gruppen folgten, wie Beastie Boys, Mega Menace, IRIS, und
seit 1994 bin ich Mitglied von Gods.</P>

<P><FONT color="#006000"><B>Was unterscheidet einen "Szener" von einem
nicht-"Szener"?</B></FONT><BR>

Der Unterschied ist nicht unbedingt so gro&szlig;, aber ein Szener ist
gew&ouml;hnlich Teil einer Gruppe und leistet bestimmte Beitr&auml;ge in
Form von kreativer Arbeit wie Demos, Intros, Mags, Slideshows, Musikdiscs
usw. Er ist z.B. mehr daran interessiert etwas zu schaffen statt einfach
nur Benutzer von Spielen oder Utilities zu sein. Dann widerum spielen auch
Szener Spiele und nutzen verschiedene Software. Und auch nicht-Szener
k&ouml;nnen kreativ sein und Dinge machen, aber normalerweise keine Demos
und Intros usw. f&uuml;r die kleine Gemeinschaft namens Szene. Bede Gruppen
haben die Liebe zum Amiga gemeinsam...</P>

<P><FONT color="#006000"><B>Wie kam es zur Geburt von
D.I.S.C.?</B></FONT><BR>

Das D.I.S.C.-Projekt wurde mitte 1989 von einem Haufen engagierter Szener
begonnen, von denen oft als dem 'Salat-Team' gesprochen wird. Die Absicht
war, 'ein Magazin f&uuml;r jeden Computerfreak zu machen, nicht nur die,
die sich selbst gro&szlig;artig finden', wie die Sch&ouml;pfer uns
erz&auml;hlten. Ich pers&ouml;nlich trat dem Team nicht vor 1992/93 bei,
als ich das Projekt &uuml;bernahm und Hauptredakteur wurde. Das war
ziemlich schwer, da die meisten alten Team-Mitglieder die Szene verlassen
hatten, und wir au&szlig;er Artikeln auch weder Code noch Grafik und Musik
hatten.</P>

<P><FONT color="#006000"><B>Kannst Du mir sagen, worum es bei D.I.S.C.
geht?</B></FONT><BR>

D.I.S.C. steht f&uuml;r Digitaler Informations-Service f&uuml;r
Computerfrekas, und unser Ziel ist, sehr informativ &uuml;ber was in der
Amiga-Szene vor sich geht zu sein. Wir versuchen, die neuesten
Szene-Nachrichten abzudecken, die neuesten Amiga-Nachrichten, die aktivsten
Gruppen und Personen, Produktionen und mehr.</P>

<P><FONT color="#006000"><B>Seit wann existiert D.I.S.C.?</B></FONT><BR>

Die erste Ausgabe wurde am 10.01.90 nach einer internen Sitzung, die vom
3.-7. Januar gehalten wurde, ver&ouml;ffentlicht. Das Einzigartige an
D.I.S.C. war, dass das Magazin von so vielen verschiedenen Leuten und
Gruppen kreiert wurde. D.I.S.C. hatte weder einen Hauptredakteur noch eine
Gruppe hinter der Produktion, und das war tats&auml;chlich die St&auml;rke
dieses legend&auml;ren Diskmags. Nat&uuml;rlich waren manche Leute
wichtiger als andere, und wir arbeiteten hart daran, dieses Team zusammen
zu halten. Jedenfalls wird D.I.S.C. als digitales Magazin jetzt schon seit
&uuml;ber 12 Jahren ver&ouml;ffentlicht...</P>

<P><FONT color="#006000"><B>Welche Software verwendet Ihr f&uuml;r die
Entwicklung von D.I.S.C.?</B></FONT><BR>

Normalerweise sollte man denken, dass wir eine Menge verschiedener Software
br&auml;uchten, um D.I.S.C. herzustellen, und das ist auch wahr. Aber wir
m&uuml;ssen z.B. den Code nicht f&uuml;r jede Ausgabe assemblieren, darum
ist f&uuml;r mich nicht l&auml;nger notwendig, Asm-Pro zu verwenden.
Stattdessen verwende ich ein speziell gemachtes Editor-Tool vom Coder von
D.I.S.C.. Nat&uuml;rlich brauche ich auch ein normales Texteditor-Programm,
und die meisten Programme sind daf&uuml;r geeignet. Ich brauche auch ein
Grafikprogramm, aber nicht alle sind geeignet, da ich eins brauche, das
verschiedene Formate konvertieren kann, besonders nach GIF. Dann brauche
ich einen Musik-Konverter, ich verwende da TrackerPacker. Ich brauche auch
einen Komprimierer, da verwende ich Stone Cruncher.</P>

<P><FONT color="#006000"><B>Wie im Einzelnen wird D.I.S.C.
hergestellt?</B></FONT><BR>

Zuallererst m&uuml;ssen mich genug Leute mit Fragen nach einer neuen
Ausgabe qu&auml;len. Dann frage ich die andere Person im Hapt-Team,
Darkhawk, ob er auch eine neue Ausgabe machen m&ouml;chte. Dann fangen wir
an, nach ein paar Ideen zu suchen und bitten ein paar der anderen in
unserem Redaktionsteam, auch zu schreiben. Wir bitten den Coder um einen
aktualisierten Quellcode, ein paar Grafiker um mehr Bilder und Cliparts und
ein paar Musiker um ein paar neue Songs. Dann recherchieren wir und
schreiben unsere Artikel, und ich versuche, alles mit dem Spezial-Editor in
D.I.S.C. einzubauen.</P>

<P>Ich mache die Anpassungen und Konvertierungen der neuen Grafiken und
Musik und beginne mit dem Einf&uuml;gen der Artikel.</P>

<P>Ich brauche diese Artikel nicht zu formatieren, weil die Source das
alles fixt. Aber ich muss eine Menge Sachen mit dem Editortool machen. Ich
muss eine Seite nach der anderen in das Magazin einpassen. Ich muss den
Text dort einf&uuml;gen, wo ich ihn haben will, und dann auch noch die
Grafiken, Seite f&uuml;r Seite. So ist das ein sehr zeitraubendes
Gesch&auml;ft, da ich jeden Artikel gern mit jeder Menge Bildern bestimmter
Produktionen und Leute illustriere. Gew&ouml;hnlich f&uuml;ge ich auch noch
eine Menge versteckter Links auf verschiedene Sachen ein.</P>

<P><FONT color="#006000"><B>Gibt es noch genug "Input" aus der "Szene", um
ein Magazin wie D.I.S.C. mit Artikeln zu f&uuml;llen?</B></FONT><BR>

Nicht wirklich. Die Szene wird heutzutage ziemlich klein, und wir haben
nicht mehr als 4 Magazine &uuml;brig. Vom Inhalt her ist D.I.S.C.
normalerweise das Gr&ouml;&szlig;te (mit Ausnahem von Party-Ausgaben), und
es gibt einfach nicht mehr genug freischaffende Redaktuere um uns zu
unterst&uuml;tzen, und die meinsten Szener werden heutzutage ziemlich faul.
Darum muss das DISC-Team das Magazin selbst f&uuml;llen und interessante
Sachen finden, &uuml;ber die man schreiben kann. Trotzdem gibt es noch
&uuml;ber gen&uuml;gend Produktionen und Ereignisse zu berichten...</P>

<P><FONT color="#006000"><B>Steht Ihr unter dem Druck, nicht "Lame" sein zu
d&uuml;rfen, d.h. m&uuml;sst Ihr qualitativ hochwertige Artikel von Szenern
haben, um akzeptiert zu werden?</B></FONT><BR>

Das kann ich nicht sagen. Die Qualit&auml;t der Amiga-Magazine hat in den
letzten Jahren sehr nachgelassen, will sagen sie waren um 1995 herum viel
besser. Heutzutage scheint es den Szenern ziemlich egal zu sein was
geschrieben wird, sie sind mehr am Layout und Code interessiert. Darum
f&uuml;hle ich mich nicht mehr unter Druck, mein allerbestes zu geben, wenn
es um Artikelleistung geht.</P>

<P><FONT color="#006000"><B>D&uuml;rfen auch nicht-"Szener" Artikel
f&uuml;r Euch schreiben?</B></FONT><BR>

Ja, nat&uuml;rlich. Das Wichtige ist, wor&uuml;ber sie schreiben. Die
Artikel sollten f&uuml;r den normalen Leser etwas von Interesse sein. Also
nat&uuml;rlich bevorzugen wir strikte Szene-Artikel (&uuml;ber Gruppen,
Leute, Parties usw.), aber auch jede Art von Amiga-bezogenen Themen ist
seht willkommen. &Uuml;ber Spiele, Software, Hardware und mehr... und
gelegentlich etwas reine Unterhaltung. Aber wir versuchen, keine reinen
F&uuml;ller aufzunehmen, und Zeug, das man leicht an tausend Orten im
Internet findet... &uuml;ber Filme, B&uuml;cher, CDs, normale Ereignisse
usw., da es in D.I.S.C. um den Amiga und die Amiga-Szene geht.</P>

<P><U><B>&Uuml;ber die "Szene"</B></U></P>

<P><FONT color="#006000"><B>Inwieweit hat sich die Amiga-"Szene"
ge&auml;ndert?</B></FONT><BR>

Es ist offensichtlich, dass die Szene in den letzten 5 Jahren oder so sehr
geschrumpft ist, oder tats&auml;chlich begann das bereits damals 1994/95
als AGA &uuml;bernahm. Viele Leute habe nie auf AGA aufger&uuml;stet, und
immer weniger Szener haben weiter aufger&uuml;stet. Wenn sie die
Produktionen nicht mehr ansehen k&ouml;nnen, h&ouml;ren die meisten Leute
einfach auf. Nat&uuml;rlich werden auch viel weniger Produktionen
ver&ouml;ffentlicht, aber heutzutage findet man nicht so viele "schlechte"
Produktionen... und die meisten Produktionen werden heutzutage auf den
verschiedenen Parties ver&ouml;ffentlicht. Besonders auf den gro&szlig;en
Parties. Es ist auch eine Tatsache, dass die Szener heutzutage viel
&auml;lter sind, und die meisten sind schon eine ganze Weile Szener, da es
nicht viele Newcomer gibt.</P>

<P><FONT color="#006000"><B>Gibt es noch das "Elite"-Denken unter den
"Szene"-Mitgliedern?</B></FONT><BR>

Nicht so sehr wie in der Vergangenheit, aber es gibt immer noch ein paar
die denken sie seien viel besser als der Rest. Ich glaube man wird diese
Leute nie los, aber im allgemeinen sind sie heutzutage viel weniger
arrogant.</P>

<P><FONT color="#006000"><B>Was glaubst Du, wie "aktiv" die "Szene"
ist?</B></FONT><BR>

Wenn wir uns die Zahlen ansehen, sind fr&uuml;her viel mehr Produktionen
ver&ouml;ffentlicht worden. Aber heutzutage sind die Gruppen, die noch am
Leben sind, ziemlich aktiv. Also k&ouml;nnte man sagen, dass wir im
Vergleich zu fr&uuml;her mehr Produktionen pro Szener kriegen... ;-)
Trotzdem, viele Leute werden m&uuml;de und werden immer weniger
aktiv...</P>

<P><FONT color="#006000"><B>Lebt die Amiga-"Szene" nur von ihrer
Vergangenheit, oder bilden sich neue Gruppen mit
Nachwuchsk&uuml;nstlern?</B></FONT><BR>

Traurigerweise gibt es in der Szene nicht viele Newcomer. Von den meisten
Leuten hat man schon eine ganze Weile geh&ouml;rt, aber hin und wieder
tauchen ein paar neue auf. Ein paar neue Gruppen bilden sich, aber
haupts&auml;chlich von Szenern, die schon eine Weile da sind.</P>

<P><FONT color="#006000"><B>Ist es f&uuml;r einen nicht-"Szener"
&uuml;berhaupt m&ouml;glich, sich in diesem Teil der Amiga-Kultur zurecht
zu finden?</B></FONT><BR>

Ja, es ist nat&uuml;rlich m&ouml;glich, der "Szene" beizutreten.
Tats&auml;chlich w&uuml;rde ich sogar sagen, dass es heute einfacher ist
als fr&uuml;her, da ich sicher bin, dass es genug freundliche Leute gibt,
einem in die Szene hinein zu helfen. Und da die Szene verzweifelt neue
Gesichter braucht, w&uuml;rde ich jedem raten, es zu versuchen... :-)</P>

<P><FONT color="#006000"><B>Haben Slogans wie "Friendship rules" noch
Geltung? Ich meine, stehen die Leute noch per Post in Kontakt
(Swapping)?</B></FONT><BR>

Die Swapping-Szene ist praktisch tot. Es gibt aber noch ein paar Leute, die
Slow-Swapping betreiben, aber E-Mailen/Internet sind so viel schneller. Auf
jeden Fall ist Freundschaft heutzutage in der Szene viel wichtiger als je
zuvor. Und ja, es gibt noch Gruppen, die "Friendship" in ihren Slogans
haben. IRIS z.B. haben den Slogan "When It Comes To Friendship!",
hihi...</P>

<P><FONT color="#006000"><B>Wie, glaubst Du, wird sich die Amiga-Szene in
Zukunft entwickeln?</B></FONT><BR>

Das ist sehr schwer vorherzusagen, aber ich bin wirklich nicht zu
optimistisch. Die Szene hat sich jetzt etwas stabilisiert, aber wir werden
immer &auml;lter und darum sinkt unsere Produktivit&auml;t, da die meisten
Leute auch Beruf, Freundin usw. haben. Jedes Mal, wenn wir unsere Sachen
aufr&uuml;sten, verlassen mehr Szener die Szene. Normalerweise brauchst Du
einen 060, um die verschiedenen Classic Amiga-Produktionen anzusehen, un
nun mit den PPC-Boards reicht das nicht mehr. Auf der diesj&auml;hrigen
Mekka-Symposium-Party z.B. brauchte fast die H&auml;lfte der Beitr&auml;ge
zum Ausf&uuml;hren einen PPC. Und ich denke, mit dem neuen AmigaOne wird
die Szene noch mehr gespalten, und deshalb weniger Szener. Aber hoffentlich
irre ich mich, und durch die neue Hardund Software werden mehr Szener von
der Amiga-Szene angezogen.</P>

<P><FONT color="#006000"><B>Deine letzten Worte an die
Leser?</B></FONT><BR>

Unterst&uuml;tzt die Amiga-Gemeinschaft, weil Ihr wisst, man kann keiner
besseren Gemeinschaft angeh&ouml;ren. Ob Ihr User oder Szener seid ist
nicht wichtig. Aber wenn Ihr nicht wisst, worum es in der Szene
&uuml;berhaupt geht, dann schnuppert mal rein, ich bin sicher, es wird Euch
gefallen. Es gibt &uuml;berall jede Menge Amiga-Prduktionen zum
Herunterladen. Ihr k&ouml;nnt nat&uuml;rlich auch ein oder zwei Ausgaben
von D.I.S.C. herunterladen... Falls Ihr Euch nicht wirklich f&uuml;r die
Szene begeistern k&ouml;nnt, aber Deutsch k&ouml;nnt und den Amiga liebt,
seht zu, dass Ihr das Printmagazin AMIGAplus in die Finger bekommt!
Zuguterletzt m&ouml;chte ich Euch nur noch einen gro&szlig;artigen Sommer
w&uuml;nschen...</P>

<P align="center">-- &copy; Amiga Arena 07/2002 --<BR>
(aus dem Englischen von Christian Busse)</P>
</TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

