<!-- saved from url=(0022)http://internet.e-mail -->
<HTML>

<HEAD>
	<TITLE>Software</TITLE>
</HEAD>

<BODY BGCOLOR=FFFF12 TEXT=000000 LINK=FF0012 VLINK=0011FF ALINK=01FF01>

<CENTER>
			<TABLE><TR><TD><TD><font size=10>Postele</font><BR>




</TABLE>
			<HR>
			Gr&uuml;zi Poldi :-)<br>
			<font color="red"><br>
				-das mit Deinem Amiga tut mir 
nat&uuml;rlich leid, kann man den L&uuml;fter selbst austauschen <br>
				-oder musst Du die Karte daf&uuml;r 
zum reparieren wegschicken? Aber auch dieses Problem, <br>
				-soweit es eins f&uuml;r Dich ist, 
wirst Du schon geregelt bekommen:-) Den AmigaOne hast <br>
				-Du jetzt schon bestellt? Ganz 
sch&ouml;n fr&uuml;h, ich w&uuml;rde erst warten bis ich einige Tests 
<br>
				-gelesen habe, aber wenn das dann 
jeder so machen w&uuml;rde wie ich, dann k&auml;men nie Tests 
zustande:-)<br>
			</font><br>
			Nein das hast Du falsch verstanden, oder ich 
vieleicht bl&ouml;d beschrieben. Um meinen 68040er<br>
			mit 50 Mhz zu betreiben brauche ich 3 
L&uuml;fter im System die die Temparatur konstant halten.<br>
			Sonst st&uuml;rzt das Teil andauernd ab. 
Gerade bei der Hitze zu Zeit. Dazu kommen noch Wakelkontakte<br>
			in der Spannungszuf&uuml;hrung. Dazu kommt 
das ich nicht mehr wirklich Lust habe an dem <br>
			alten Teil rumzubasteln.<br>
			<br>
			Vom AmigaOne verspreche ich mir einen Rechner 
aus einem Gu&szlig; auf dem alte 68k-Soft problemlos<br>
			und schnell l&auml;uft. Ein Rechner mit 
Grafikkarte an dem man einfach einen PC-Monitor st&ouml;pseln<br>
			kann und los geht es :-) Amithlon ist 
f&uuml;r mich keine L&ouml;sung das ich den PC-Markt/Windows nicht<br>
			&uuml;nterst&uuml;tzen werde. Und falls hier 
jemand einhakt. Ja wer einen PC hat auch Windows auf der<br>
			Platte. <br>
			Falls der AmigaOne nicht kommen sollte wirds 
wohl irgendwann ein G5 werden. Aber das wohl ma mal net <br>
			hoffen :-)<br>
			<br>
			<font color="red">-Dir kann ich niemals sauer 
sein, das wei&szlig;t Du doch?! Aber Gedanken mache ich mir immer,<br>
				-wenn Du Dich so lange nicht meldest, 
aber das schrieb ich Dir schon einmal. Es ist halt <br>
				-bl&ouml;d, wenn ich nicht 
wei&szlig;, warum Du Dich nicht meldest, dann glaube ich immer, dass 
es an mir <br>
				-liegt, weil Du Dich nicht meldest, 
aber Du hast mit Sicherheit mehr um die Ohren als ich!!!<br>
				<br>
			</font>Ja ich wei&szlig;. Ich bin ziemlich 
faul geworden :-) Witzigerweise beantworte ich Briefe was umgehend<br>
			aber bis ich sie dann loschicke (Oh Jemine) ;-)<br>
			<br>
			<font color="red">-Kann es sein, dass Du mich 
eventuell falsch verstanden hast? Ich meinte mit dem Intel oder 
AMD<br>
				-nur den Prozessor. Ein normaler 
Amiga mit einem Intel-Proz. als Steckkarte, f&uuml;r PCI oder dem <br>
				-Expansionsport, darauf dann das 
AmigaOS und schon w&auml;re alles beim Alten, nur erheblich 
schneller! <br>
				-Das Umsetzten des OS f&uuml;r Intel 
oder AMD d&uuml;rfte auch nicht viel l&auml;nger dauern als f&uuml;r 
den PPC.<br>
			</font><br>
			Naja ich halte von diesen &quot;R&uuml;stet 
die alten Amigas auf&quot; nichts mehr. Du steckst unmengen an 
Kohle<br>
			in alte Hardware. Phase 5 h&auml;tte damals 
auch einfach eine PPC-Karte ohne 68k-Prozi auf den Markt<br>
			bringen k&ouml;nnen. Einfach mit ner 68k-Emu. 
H&auml;tte vieles einfacher (Programmierung) gemacht, und die<br>
			Dinger w&auml;ren um einiges billiger 
gewesen. Die wollten halt nur ihre Restbest&auml;nde (68k) auch 
loswerden.<br>
			Ja ein so ein Turboboard mit x86 h&auml;tte 
man auch machen k&ouml;nnen. Ich denke das aber hier die Angst zu 
gro&szlig; <br>
			war das die User es nicht annehmen. <br>
			<br>
			<font color="red">-Auch habe ich mit den 
PPC-Prozessoren die gemeint, die in Arbeit sind, falls es sie 
wirklich geben <br>
				-sollte, damit w&auml;ren die neuen 
und alten Amigas gleich schnell, zumindest in der Theorie. Die 
PPC&acute;s <br>
				-die es jetzt f&uuml;r den Amiga gibt 
sind zwar ganz gut, k&ouml;nnten aber besser unterst&uuml;tzt 
werden!<br>
				<br>
			</font>Ein G3/G4 ist schon um einiges 
schneller als ein PPC604 im Amiga. Mein Mac kann mit VirtualPC 
(Software)<br>
			einen Pentium4 mit 200 Mhz emulieren. Darauf 
laufen dann auch problemlos Spiele.<br>
			Dazu gibt es schon G4-Karten mit 1 Ghz 
f&uuml;r PCI. Mann stelle sich vor es schreibt jemand einen 
Treiber<br>
			f&uuml;rs AmigaOS.<br>
			<br>
			<br>
			<font color="red">-Das AmigaOS-4.0 werde ich 
mir auf jeden Fall kaufen, da ja auch die BlizzardPPCKarten 
unterst&uuml;tzt <br>
				-werden, auch sollen die PCI-Boards 
unterst&uuml;tzt werden, was kann mich da noch davon abhalten das 
OS-4.0 <br>
				-zu kaufen? Der jetzt bekannte Preis 
st&ouml;rt mich nur, weil vorher ein anderer Preis genannt wurde, die 
<br>
				-h&auml;tten lieber den Preis erst 
nennen sollen als sie wussten wieviel das OS kosten soll! Da wir es 
schon<br>
				-gewohnt sind zu warten, ist der 
Erscheinungstermin wieder einmal verschoben worden, das OS sollte 
schlie&szlig;lich <br>
				-schon im Februar kommen!<br>
			</font><br>
			Ja das ist halt alles eine Hinhaltetaktik:-( 
Habe jetzt auch bei dieser 50$ Dollar-Aktion mitgemacht. 
Hoffendlich<br>
			kommt das alles.<br>
			<br>
			<font color="red">-Da im Internet dauernd 
dar&uuml;ber gestritten wird welches OS das Beste ist, m&ouml;chte 
ich hier auch noch etwas dar&uuml;ber<br>
				-ablassen, aber f&uuml;hle Dich nicht 
angemacht, es ist eben nur meine Meinung!:<br>
				<br>
				-Wenn es nach mir ginge, w&uuml;rde 
Amiga INC. die Leute von MorphOS vor Gericht schleppen und denen 
verbieten lassen <br>
				-Ihr OS unter die Leute zu bringen!!! 
Es hat keinen Sinn wenn es mehrere OS&acute; gibt und einige 
Softwarehersteller <br>
				-das AmigaOS unterst&uuml;tzen und 
andere wiederum das MorphOS, es sollte alles in eine Richtung gehen 
und alle Firmen <br>
				-nur f&uuml;r ein OS entwickeln. Ich 
habe lieber ein OS wo Amiga drauf steht und auch Amiga drin ist, 
MorphOS ist sowieso<br>
				-noch Beta und wer wei&szlig; ob die 
von MorphOS auch die Ausdauer haben &uuml;ber l&auml;ngere Zeit 
Updates und eine Hotline zur <br>
				-Verf&uuml;gung zu stellen. Das 
Pegasos-Team sollte lieber das AmigaOS lizensieren und damit 
w&auml;re alles in Ordnung.<br>
				-Hoffentlich wird das MorphOS niemals 
fertig, dann erledigt sich dieses leidige Thema ganz von allein!<br>
				<br>
			</font>Mos soll schon so gut wie fertig sein. 
Bplan/Thendic haben nur keine Lizenz bekommen den Desktop von 
AOS3.1<br>
			zu verwenden so das sie jetzt selber einen 
bauen m&uuml;ssen. Mos h&auml;tte das AmigaOS4.0 sein sollen, nur 
konnte man<br>
			sich nicht einigen. Danach hat Hyperion erst 
begonnen mit AOS4.0. Dieses wird sicherlich 2-3 Monate l&auml;nger<br>
			brauchen.<br>
			Also mich h&auml;tte Mos schon interessiert. 
Nachdem es aber Aussagen von Thendic gegeben hat wo sie gesagt haben 
das sie<br>
			der Amigamarkt nicht interessiert, und ich 
der festen &Uuml;berzeugung bin das ein Amiga unter mit dem Namen 
Amiga nochmal<br>
			eine Chance hat habe ich mich schon sehr 
fr&uuml;h f&uuml;r den AmigaOne erschienen.<br>
			Ageblich sollen auch schon die ersten Pegasos 
mit Linux ausgeliefert worden sein.<br>
			<br>
			----------<br>
			<br>
			Nun zu Deiner Mail.<br>
			<br>
			Es hat mal jemand in einem Forum behauptet 
das sie MacOS8.5 auch auf einem 68k-Rechner zum laufen bekommen 
haben. <br>
			Man m&uuml;&szlig;te mal in Google suchen ob 
es jemand genauer beschrieben hat. Das w&auml;r doch was f&uuml;r 
Dich. <br>
			<br>
			Mit Doom kenn ich mich aber &uuml;berhaut 
nicht aus. Habe es zwar am Amiga.Mac, aber nie mehr gemacht als 
angespielt. Habe<br>
			aber vor kurzem, gelesen das wenn Du das 
Orginal-Wad hast auch Alternativ-Wads runterladen kannst. Schau mal 
ob ich die Seite<br>
			finde.<br>
			Bei www.Versiontracker.com gibt es viel 
Freeware Stuff f&uuml;r den Mac. Die Frage ist nur was noch auf 68k 
noch l&auml;uft. Ja es gibt<br>
			zwar kein Aminet f&uuml;r den Mac, aber viele 
Seiten die einiges an Macsoft horten. Schaue mal nach ein paar Links. 
Dern Rest schreibe <br>
			ich Dir noch privat.<br>
			<br>
			Bis dann,<br>
			<br>
			Gr&uuml;&szlig;e,<br>
			<br>
			<font color="#330099">Murmel<br>
			</font> <br>
			<br>
			<br>












































































































		