<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Etwas &uuml;ber die Erde</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Die Erde wird fetter</B>
</FONT></P>

<TABLE border="0" width="100%" summary=""> <TR> <TD width="175"
valign="top"><IMG src="st_erde1.jpg" width="170" height="161" alt=""> </TD>

<TD valign="top">Die "Potsdamer Kartoffel" ist nicht etwa eine leckere
Beilage, vielmehr handelt es sich um das komplexe Modell der Gestalt der
Erde, die eben keineswegs rund ist, sondern einer rotierenden Kartoffel
gleicht. Seit den Eiszeiten hatten sich die Proportionen zwar zugunsten
h&ouml;herer Breiten verschoben, doch seit 1998 str&ouml;men die Massen
wieder &auml;quatorw&auml;rts. Infolge der Rotation und der
ungleichm&auml;&szlig;igen Verteilung der Kontinente und Massen im
Erdinneren pr&auml;gen die Erdmassen die Gestalt unseres Planeten.<BR> <BR>

<FONT size="-1">Bild: Die 'Potsdamer Kartoffel' - ein Modell (Grafik:
GeoForschungsZentrum Potsdam)</FONT></TD></TR></TABLE>

<P><B>Schiffahrt unter dem Meeresspiegel</B><BR> So fahren Schiffe - keine
U-Boote - im Indischen Ozean bis zu 110 Meter unterhalb des mittleren
Meeresspiegels, w&auml;hrend Fischer im Pazifik ihrer Arbeit stellenweise
80 Meter dar&uuml;ber nachgehen. Im Mittel ist die Erde am &Auml;quator
deshalb rund 0,3 Prozent weiter als entlang der L&auml;ngengrade. Dass sich
dies jedoch ziemlich rasch &auml;ndern kann, zeigten schon die ersten
Satellitenmessungen vor 20 Jahren, als Forscher feststellten, dass sich die
Abplattung der Erde - das Verh&auml;ltnis von polarem zu &auml;quatorialem
Umfang also - in jedem Jahr linear verringerte.</P>

<TABLE border="0" width="100%" summary=""> <TR> <TD width="175"
valign="top"><IMG src="st_erde2.jpg" width="170" height="133" alt=""> <FONT
size="-1">F&uuml;llige Erde<BR> (Montage: T-Online)</FONT></TD>

<TD valign="top"><B>Trendwende seit 1998</B><BR> Der Grund daf&uuml;r lag
im Ende der letzten Eiszeit und dem Schwinden der Kilometer m&auml;chtigen
Eismassen in den mittleren und hohen Breiten der Nord- und
S&uuml;dhalbkugel. Von dem ungeheuren Druck entlastet, hoben sich in diesen
Regionen weite Bereiche der Erdkruste - Skandinavien steigt bis heute
stellenweise um einige Dezimeter pro Jahr auf, was zur Konsequenz hat, dass
sich Mantelmaterial von den niedrigen in die h&ouml;heren Breiten bewegt.
Doch seit kurzem - oder genauer gesagt: seit 1998 -ist der Trend umgekehrt.
Die Erde wird seitdem wieder flacher - und zwar deutlich. Das erkannten die
US-Forscher Christopher Cox und Benjamin Chao, nachdem sie zahlreiche Laser
gest&uuml;tzte Satellitenvermessungen von 1979 bis 2001 ausgewertet
hatten.</TD></TR></TABLE>

<P><B>Spekulation &uuml;ber Ursachen</B><BR> &Uuml;ber die Ursachen
f&uuml;r diese pl&ouml;tzliche Umkehr k&ouml;nnen auch die Forscher nur
spekulieren. Ob die abschmelzenden Gletscher und polaren Eismassen f&uuml;r
den Massentransfer in Richtung &Auml;quator verantwortlich sind? Nein,
zumindest als alleinige Ursache ist dies auszuschlie&szlig;en, denn die
Zunahme in den &Auml;quatorregionen ist um einiges gr&ouml;&szlig;er.
Bleiben noch zwei andere Ursachen: Zum einen die Ozeane und zum anderen der
fl&uuml;ssige &auml;u&szlig;ere Erdkern. In letzterem kommt es immer wieder
zu gr&ouml;&szlig;eren Massenverlagerungen, die sich durch pl&ouml;tzliche
Schwankungen im Erdmagnetfeld &auml;u&szlig;ern. Tats&auml;chlich hat es so
etwas 1999 gegeben, und es ist nicht auszuschlie&szlig;en, dass der Erdkern
seinen Anteil an dem Ph&auml;nomen hat.</P>

<P><B>Einfluss des El Ni&ntilde;o vermutet</B><BR> In welcher
Gr&ouml;&szlig;enordnung die Wassermassen der Ozeane schwanken,
illustrieren die eingangs geschilderten Unterschiede in den
Meeresspiegelh&ouml;hen. Auch die sind von Jahr zu Jahr unterschiedlich und
k&ouml;nnen -im Zuge eines kr&auml;ftigen El Ni&ntilde;os beispielsweise -
die Erde verformen. Vielleicht, so meinen die Forscher, bedurfte es
mehrerer El Ni&ntilde;os, die schlie&szlig;lich die Massenverlagerung mit
ausl&ouml;sten. Letztlich sind die Ursachen hierf&uuml;r jedoch bis heute
unbekannt.</P>

<P>Quelle des Artikels: <FONT color="#0000ff"><B>www.karriere.t-online.de</B>
</FONT></P></TD></TR></TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR></TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

