<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<!-- Author = Wolf Zimmer -->

<TITLE>Neuigkeiten im Weltraum</TITLE>
</HEAD>

<BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="8" summary="">
<TR>
<TD>
<P align="center"><FONT color="#000080" size="7"><B>Gasf&auml;den</B></FONT></P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD width="175" valign="top">
<IMG src="st_gas2.jpg" width="170" height="146" alt=""><BR>
<FONT size="-1">Aufnahme der Galaxie NGC 891 (Foto: Nasa/CXC/SAO)</FONT></TD>

<TD valign="top">Das Chandra-Weltraumteleskop hat ein gigantisches
intergalaktisches Netz aus hei&szlig;em Gas und Dunkler Materie entdeckt,
in dem die meiste Materie des Universum gefangen sein soll. Nach Angaben
der US-Raumfahrtbeh&ouml;rde Nasa liegt das bis zu f&uuml;nf Millionen Grad
Celsius hei&szlig;e Gas wie Fr&uuml;hnebel in intergalaktischen
Gr&auml;ben, die von der Schwerkraft geformt werden. Die Entdeckung, die
fr&uuml;here Beobachtungen im ultravioletten Licht best&auml;tigt und
erweitert, soll den Astronomen helfen, die Entwicklung des Universums
w&auml;hrend der vergangenen zehn Milliarden Jahre besser zu verstehen, und
sie m&ouml;glicherweise auf die Spur der nach wie vor mysteri&ouml;sen
Dunklen Materie f&uuml;hren.</TD></TR></TABLE>

<P><B>Riesiges System in der kosmischen Landschaft</B><BR>

Das von Chandra entdeckte Gasnetz ist der Nasa zufolge Teil eines riesigen
Systems, das die kosmische Landschaft bildet. Eine solche Struktur war von
Theorien vorhergesagt worden, entzog sich bisher aber weitgehend der
Beobachtung. In den ersten Jahrmilliarden nach dem Urknall sollen sich
demnach etwa 20 Prozent der Materie im Universum unter dem Einfluss der
Schwerkraft zusammengeballt haben, um die noch heute existierenden riesigen
Haufen von Galaxien zu bilden. Das Alter des Universums wird
gegenw&auml;rtig auf etwa 14 Milliarden Jahre gesch&auml;tzt.</P>

<TABLE border="0" width="100%" summary="">
<TR>
<TD width="175" valign="top">
<IMG src="st_gas3.jpg" width="170" height="115" alt=""><BR>
<FONT size="-1">R&ouml;ntgenstrahlung passiert eine Gaswolke<BR>
(Grafik: Nasa/CXC/SAO)</FONT></TD>

<TD valign="top"><B>Faserartiges Netz verbindet Galaxienhaufen</B><BR>

Die restliche normale Materie und die bisher erst indirekt nachgewiesene
Dunkle Materie sollen den Theorien zufolge ein gigantisches faserartiges
Netz geformt haben, das die Galaxienhaufen verbindet und so hei&szlig; ist,
dass es f&uuml;r Infrarot- und Radioteleskope sowie f&uuml;r optische
Instrumente unsichtbar ist. Stattdessen soll es im energiereicheren
R&ouml;ntgenlicht leuchten. Mit dem R&ouml;ntgensatelliten Chandra wurden
die Forscher nun f&uuml;ndig.</TD></TR></TABLE>

<P><B>Mehr Masse als alle Sterne zusammen</B><BR>

"Wir hatten von der Urknalltheorie und den Beobachtungen des fr&uuml;hen
Universums her den starken Verdacht, dass das Gas existiert; aber wie ein
Tarnkappenbomber hatte es sich bisher der Entdeckung entzogen",
erkl&auml;rte Claude Canizares vom Massachusetts Institut f&uuml;r
Technologie (MIT), der zu einem von vier unabh&auml;ngigen Teams
geh&ouml;rt, die ihre Beobachtungen im "Astrophysical Journal"
ver&ouml;ffentlichen. Allein das hei&szlig;e Gas soll mehr Masse enthalten
als alle Sterne des Universums zusammen.</P>

<P><B>Ursprung der Dunklen Materie gesucht</B><BR>

Das Gasnetz kann den Wissenschaftlern helfen, die noch massereichere
Komponente der Dunklen Materie aufzusp&uuml;ren. Die Dunkle Materie, die
den gr&ouml;&szlig;ten Teil der Masse im Universum ausmachen soll, hat sich
bisher erst durch ihre Schwerkraft verraten. Direkt beobachten l&auml;sst
sie sich bislang nicht. Die Entdeckung des hei&szlig;en Gasnetzes
k&ouml;nnte Astronomen einmal erm&ouml;glichen, die Verteilung der Dunklen
Materie zu kartieren und m&ouml;glicherweise ihren Ursprung zu
entr&auml;tseln, glaubt die Nasa.</P>

<P>Quelle des Artikels:
<FONT color="#0000ff"><B>www.karriere.t-online.de</B></FONT></P>
</TD></TR></TABLE>

<CENTER>
<TABLE border="8" width="95%" cellspacing="0" cellpadding="8" summary="">
<TR bgcolor="#88ccff">
<TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
<TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
<TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
</TR></TABLE>
</CENTER>
<BR>
</BODY>
</HTML>

