<HTML>
  <HEAD>
    <!-- Author = Wolf Zimmer -->

    <TITLE>Wolf hat Hunger (stimmt aber nicht!!!)</TITLE>
  </HEAD>

  <BODY background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
  vlink="#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="7"><B>Was wir essen</B></FONT></P>

          <H2 align="center"><B>Nur gesunde Kinder k&ouml;nnen gut lernen</B></H2>

          <P>Nach der Ver&ouml;ffentlichung der PISA-Studie h&auml;ufen sich die
          Verbesserungsvorschl&auml;ge zur Gesamtsituation Schule. Fast t&auml;glich
          kommen neue Vorschl&auml;ge auf, die das Lernen, die Leistungs- und
          Konzentrationsf&auml;higkeit der Kinder sowie das gesamte schulische
          Lernumfeld verbessern sollen. Diese Diskussion ist notwendig und f&uuml;r
          die Zukunft unserer Kinder auch wichtig. Je mehr Politiker, Verb&auml;nde,
          Fachinstitutionen und andere Bev&ouml;lkerungsgruppen ein echtes Interesse
          an Schule entwickeln und konstruktiv um L&ouml;sungen zur Verbesserung
          ringen, desto zielf&uuml;hrender.</P>

          <P>Auff&auml;llig ist jedoch, dass die Gesundheit der Kinder nicht oder
          kaum einbezogen wird, wenn es um die Lernf&auml;higkeit der Sch&uuml;ler
          geht. Dabei hat sich in den letzten Jahrzehnten die Gesundheitssituation
          von Kindern drastisch verschlechtert, was zur Folge hat, dass auch die
          Lernf&auml;higkeit darunter leidet. Noch nie waren so viele Kinder dick, so
          h&auml;ufig krank und psychisch beeintr&auml;chtigt wie heute.</P>

          <P>Die Ursachen hierf&uuml;r sind vielf&auml;ltig. Ein wichtiger Grund ist,
          dass sich die Ern&auml;hrungssituation f&uuml;r Kinder in den letzten
          Jahren deutlich verschlechtert hat. "Wenn es um die Gesundheit unserer
          Kinder geht, ist die ad&auml;quate Ern&auml;hrung sicherlich nicht der
          einzige Aspekt. Allerdings dies zeigen statistische Daten zur Verbreitung
          von ern&auml;hrungsabh&auml;ngigen Erkrankungen bei Kindern - ist die
          Ern&auml;hrung ein zentraler Faktor zur F&ouml;rderung und Erhaltung ihrer
          Gesundheit, ihres Wohlbefindens und ihrer - auch schulischen
          -Leistungsf&auml;higkeit", betont Dr. Margret B&uuml;ning-Fesel,
          gesch&auml;ftsf&uuml;hrender Vorstand des aid infodienstes.</P>

          <P>Viele Kinder kommen ohne Fr&uuml;hst&uuml;ck zur Schule und gemeinsame
          warme Mahlzeiten sind in den Elternh&auml;usern nicht mehr
          selbstverst&auml;ndlich. Lebensmittel haben an Wertsch&auml;tzung verloren,
          sie werden im Supermarkt wie Non-Food-Artikel gekauft. Weil aber Essen und
          Trinken die elementare Lebensbasis ist und Leistung darauf aufbaut, muss
          dieser Bereich st&auml;rker beachtet werden.</P>

          <P>In keiner Phase ist eine gesunde Ern&auml;hrung so wichtig wie in der
          Kindheit. Der N&auml;hrstoffbedarf ist hoch, das Ern&auml;hrungsverhalten
          wird gepr&auml;gt und die Grundlagen f&uuml;r die Pr&auml;vention
          ern&auml;hrungsbedingter Krankheiten gelegt. Nur gesunde Kinder sind
          fr&ouml;hlich und lebens-bejahend, neugierig und wissensdurstig,
          konzentrationsf&auml;hig und leistungsbereit. Kinder, die
          gefr&uuml;hst&uuml;ckt haben, sind leistungsf&auml;higer,
          reaktionsschneller und erm&uuml;den nicht so schnell wie Kinder, die nicht
          oder nicht ausreichend gefr&uuml;hst&uuml;ckt haben.</P>

          <P>Fest steht: Nur gesunde Kinder k&ouml;nnen optimal lernen!</P>

          <P>Gesundheits- und Ern&auml;hrungserziehung m&uuml;ssen daher feste
          Bestandteile der Grundbildung in der Schule werden. Dringen erforderlich
          ist deshalb die Aus-, Fortund Weiterbildung von Lehrern zu diesem Thema.
          Die Vermittlung von Grundlagen einer gesunden Ern&auml;hrung und das Wissen
          um die Herkunft unserer Lebensmittel geh&ouml;rt aus unserer Sicht zum
          Erziehungsauftrag der Schulen.</P>

          <P>Das "Netzwerk Gesunde Ern&auml;hrung" (bestehend aus Verbraucherzentrale
          NRW, aid infodienst und UGB) hat es sich zur Aufgabe gemacht, Lehrer bei
          dieser Arbeit zu unterst&uuml;tzen. Als erstes Medium haben die beteiligten
          Institutionen eine Erlebniskiste f&uuml;r die Grundschule entwickelt
          (n&auml;here Informationen unter <A href="wwe/st_wwe3.html" target=
          "_top"><B>www.erlebniskiste.de</B></A>). Aber das ist nur der Anfang
          f&uuml;r das Netzwerk!</P>

          <P>Die Erlebniskiste Essen, Trinken &amp; Co. entstand im Rahmen des
          "Netzwerkes Gesunde Ern&auml;hrung". Finanziell unterst&uuml;tzt wurde das
          Projekt durch die <IMG src="wwe/st_wwe3q.jpg" width="122" height="15" alt=
          "" border="0">. Und resultierend hieraus enstand die Website <A
          href="wwe/st_wwe1.html" target= "_top"><B>www.was-wir-essen.de</B></A>
          unter f&uuml;hrender Mitarbeit und F&ouml;rderung der Zentralstelle
          f&uuml;r Agrardokumentation und -information, (ZADI) [die zentrale
          wissenschaftliche Informationseinrichtung des Bundesministeriums f&uuml;r
          Verbraucherschutz, Ern&auml;hrung und Landwirtschaft (BMVEL)], aber
          verantwortlich ist<BR>

          "aid infodienst"<BR>

          Verbraucherschutz Ern&auml;hrung Landwirtschaft e.V.<BR>

          Friedrich-Ebert-Stra&szlig;e 3<BR>

          53177 Bonn<BR>

          Internet: <FONT color= "#0000ff"><B>www.aid.de</B></FONT>.</P>

          <P>Diese Homepage ist wirklich interessant und wirklich besuchenswert. Als
          Beispiel habe ich auch die Seite <A href="wwe/st_wwe2.html" target=
          "_top"><B>Erzeugung</B></A> hier mit aufgezeigt. Alle Links sind
          deaktiviert, damit beim Anschauen mit der Maus nicht unendliche
          Fehlerrequester auftauchen.</P>
        </TD>
      </TR>
    </TABLE>

    <CENTER>
      <TABLE border="8" width="95%" cellspacing="0" cellpadding="8"
      summary="Fu&szlig;note">
        <TR bgcolor="#88ccff">
          <TD>Autor: &nbsp; <FONT color="#0000ff"><B>Wolf Zimmer</B></FONT> </TD>
          <TD>E-Mail: <FONT color="#0000ff"><B>wolf@wozim.de</B></FONT> </TD>
          <TD>Homepage: <FONT color="#0000ff"><B>http://www.wozim.de</B></FONT> </TD>
        </TR>
      </TABLE>
    </CENTER>
    <BR>
  </BODY>
</HTML>

