<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H2>AMIGA International, Inc. / AMIGA, Inc.</H2>
<H3>1. AMIGA, Inc. k&uuml;ndigt AMIGA OS 3.5 an</H3>
<P>
Das Ger&uuml;cht in AMIGA aktuell 10/98 hat sich als wahr erwiesen: AMIGA, Inc.
hat auf der Midwest AMIGA Exposition, die Anfang Oktober in den USA
stattfand, eine Weiterentwicklung des AMIGA-Betriebssystems f&uuml;r 68k-AMIGAs
angek&uuml;ndigt. AMIGA OS 3.5 soll bereits im ersten Halbjahr 1999 auf CD-ROM
erscheinen und zur Nutzung das/die OS3.1-ROM(s) ben&ouml;tigen.
</P>
<P>
Laut AMIGA, Inc. handelt es sich bei dem Projekt, das unter der Leitung von
Fleecy Moss steht, um eine Kooperation von rund 20 Entwicklern.
Das AMIGA OS 3.5 soll bereit f&uuml;r das Internet sein, was auf eine
Integration der wichtigsten Internet-Applikationen (TCP/IP-Stack, WWW-
Browser, E-Mailer, etc.) schlie&szlig;en l&auml;sst.
</P>
<P>
Alle Programme, die unter dem OS 3.1 lauff&auml;hig sind, 'sollen' auch unter
dem OS 3.5 funktionieren.
</P>
<P>
Die PowerUp-Karten von Phase 5 w&uuml;rden mittels der PowerPC-Systeml&ouml;sung
WarpOS von Haage &amp; Partner unterst&uuml;tzt, jedoch sei dies nur f&uuml;r
Fremdapplikationen gedacht: Alle Teile des AMIGA OS 3.5 sollen
ausschlie&szlig;lich in 68k-Code geschrieben werden. Laut Fleecy Moss ist Phase 5
&uuml;ber die Entscheidung pro WarpOS nicht erfreut, akzeptiere sie aber.
</P>
<P>
Weitere Informationen, die AMIGA, Inc. mittlerweile herausgegeben hat:
</P>
<P>
<UL>
<LI> Das Erscheinen der f&uuml;r November 1998 geplanten Entwickler-Maschine
  verz&ouml;gere sich bis voraussichtlich Anfang 2. Quartal 1999, ausgel&ouml;st
  durch Schwierigkeiten mit dem anf&auml;nglichen Partner, der jedoch
  zwischenzeitlich durch einen &quot;viel, viel besseren&quot; ersetzt worden sei.
</P>
<P>
</LI>
<LI> Bei der neuen AMIGA-Generation liege man jedoch perfekt im Zeitplan, so
  dass von einem Erscheinungstermin Ende 1999 ausgegangen werden k&ouml;nne.
</P>
<P>
</LI>
<LI> Das AMIGA OS 5.0 soll r&uuml;ckw&auml;rtskompatibel zum OS 3.5 sein.
</P>
<P>
</LI>
<LI> Programmierer f&uuml;r das OS 5.0 seien aus verschiedenen Gr&uuml;nden noch nicht
  eingestellt worden, Dr. Havemose wisse aber, wen er in seinem Team haben
  m&ouml;chte.
</P>
<P>
</LI>
<LI> Weitere Informationen zum OS 3.5 sollen auf der Computer '98
  ver&ouml;ffentlicht werden, ebenso soll dort ein Blick auf die
  Entwickler-Maschine m&ouml;glich sein.
</P>
<P>
</LI>
<LI> AMIGA, Inc. will seine Informationspolitik &auml;ndern und in Zukunft
  AMIGA-Printmagazine (als Beispiele wurden AMIGA Format, Amazing AMIGA und
  AMIGA Informer genannt) verst&auml;rkt &uuml;ber Neuigkeiten unterrichten.
</P>
<P>
</LI>
</UL>
&Uuml;brigens: Auf <A HREF="http://ugn.amiga.org/events/audio.shtml" TARGET="_TOP">http://ugn.amiga.org/events/audio.shtml</A> l&auml;sst sich die Rede
von Bill McEwen im GSM-Format abrufen.
</P>
<P>
Mittlerweile hat AMIGA, Inc. Support-Seiten zum AMIGA OS 3.5 eingerichtet,
die unter <A HREF="http://boing.amiga.com/3.5/index.shtml" TARGET="_TOP">http://boing.amiga.com/3.5/index.shtml</A> erreichbar sind.
Bei Redaktionsschluss dieser Ausgabe ist die Entwicklung der neuen
Betriebssystemversion demnach zu etwa 9 Prozent fertiggestellt.
</P>
<P>
Auch die folgenden Informationen sind den Support-Seiten entnommen:
</P>
<P>
&raquo;Betriebssystem Amiga OS 3.5
</P>
<P>
Anforderungen
</P>
<P>
Um Ihr Amiga-System auf OS 3.5 aufzur&uuml;sten, muss Ihr Rechner mit folgender
Hardware ausger&uuml;stet sein:
</P>
<P>
<UL>
<LI> CD-ROM-Laufwerk
</LI>
<LI> Festplatte
</LI>
<LI> Prozessor 68020 oder besser
</LI>
<LI> Amiga 3.1 ROMs
</LI>
<LI> 4 MB Fast-RAM
</P>
</UL>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">F&uuml;r bessere Leistungf&auml;higkeit empfiehlt Amiga Inc.:&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
</LI>
<UL>
<LI> Prozessor 68030 oder besser
</LI>
<LI> 8 MB Fast-RAM
</LI>
<LI> Graphik-Beschleuniger und/oder Scandoubler
</LI>
<LI> Modem
</P>
<P>
</LI>
</UL>
Um in den vollen Genuss der M&ouml;glichkeiten von OS 3.5 zu kommen,
empfehlen wir die Erweiterung um Folgendes:
</P>
<P>
<UL>
<LI> Prozessor 68060 mit PowerPC-Beschleuniger-Karte
</LI>
<LI> 16-Bit-Soundkarte
</LI>
<LI> 32 MB Fast-RAM
</LI>
<LI> I/O-Beschleuniger
</P>
</UL>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Wenn Sie ein neues klassisches Amiga-System brauchen, setzen Sie Sich&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">mit Ihrem n&auml;chsten Amiga-H&auml;ndler in Verbindung oder pr&uuml;fen Sie in&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">Amiga-Ver&ouml;ffentlichungen, wo A1200 noch erh&auml;ltlich sind.&laquo;&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">(Quelle des Originals: AMIGA, Inc.)&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
&raquo;Eigenschaften des Amiga-OS 3.5
</P>
<P>
</LI>
<UL>
<LI> RTG-(ReTargetable Graphics)-Karten werden unterst&uuml;tzt
</P>
<P>
</LI>
</UL>
Eingebaute Unterst&uuml;tzung f&uuml;r Amiga-Grafikkarten durch einen modernen
Systemrequester. Es ist sogar die Unterst&uuml;tzung neuer Karten, wie z.B.
f&uuml;r die ATEO-Grafikkarte f&uuml;r A1200, eingeschlossen.
</P>
<P>
<UL>
<LI> RTA-(ReTargetable Audio)-Karten werden unterst&uuml;tzt
</P>
<P>
</LI>
</UL>
Um die Musikuntermalung und die Soundeffekte Ihrer Spiele wirklich zu
verbessern, bietet RTA Ihrem System die M&ouml;glichkeit, moderne Sound-
Harware einzubinden, ohne die Kompatibilit&auml;t mit AHI (Audio Hardware
Interface) zu verlieren.
</P>
<P>
<UL>
<LI> Internet-Zugang eingerichtet
</P>
<P>
</LI>
</UL>
Besorgen Sie Sich die Zugangsberechtigung bei Ihrem Netzbetreiber,
verbinden Sie Sich mit dem Internet &uuml;ber Ihr Modem und erkennen Sie,
wor&uuml;ber die Welt spricht - Web-Seiten, eMail, FTP. Treffen Sie Sich
online mit der Amiga-Gemeinschaft und sp&uuml;ren Sie den Unterschied.
</P>
<P>
<UL>
<LI> Verbesserte Druckausgabe
</P>
<P>
</LI>
</UL>
Ein umfangreicherer Satz an Einstellm&ouml;glichkeiten, mehr Treiber und
moderne Druckerunterst&uuml;tzung.
</P>
<P>
<UL>
<LI> Verbessertes Dateisystem
</P>
<P>
</LI>
</UL>
Sie brauche Sich nicht l&auml;nger Ihre Festplatte im Museum zu kaufen.
OS3.5 unterst&uuml;tzt gro&szlig;e Fesplatten mit mehr als 4 GB.
</P>
<P>
<UL>
<LI> CD-Dateisystem
</P>
<P>
</LI>
</UL>
OS3.5 unterst&uuml;tzt die glitzernden Scheiben. Bessere Grafik, starker
Klang, mehr von allem. Sie k&ouml;nnen Audio-CDs h&ouml;ren, w&auml;hrend Sie
arbeiten. Cool!
</P>
<P>
<UL>
<LI> Arexx Update
</P>
<P>
</LI>
</UL>
M&auml;chtige Verbesserungen Ihrer Systemscript- und Verbindungssprache.
</P>
<P>
<UL>
<LI> Neue Eigenschaften der Shell und erweiterter Befehlssatz.
</P>
<P>
</LI>
</UL>
Ihr Amiga wird viel produktiver dank neuer Eigenschaften und weiterer
AmigaDOS-Befehle.
</P>
<P>
<UL>
<LI> Verbesserte Benutzeroberfl&auml;che
</P>
<P>
</LI>
</UL>
Eine besser aussehende Workbench f&uuml;r gr&ouml;&szlig;ere Produktivit&auml;t mit neuer
Aufmachung, GUI-(Graphic User Interface = Grafische Benutzerschnittstelle)
System, Icons und weiteres.
</P>
<P>
<UL>
<LI> PowerPC-Koprozessor-Unterst&uuml;tzung
</P>
<P>
</LI>
</UL>
Unterst&uuml;tzung f&uuml;r Anwendungen, die PowerPC-Koprozessorkarten verwenden.
</P>
<P>
<UL>
<LI> Anwender-Dokumentation
</P>
<P>
</LI>
</UL>
Vollst&auml;ndig neu verfasste Anwender-Dokumentation wird im bequemen
HTML-Format mitgeliefert.
</P>
<P>
... Plus einer Myriarde weiterer Verbesserungen und Eigenschaften.
</P>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Als besonderes Geschenk f&uuml;r die Amiga-Anwender wird &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">jedes OS 3.5 mit&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">einer Sammlung der Geschichte des Amiga geliefert:  &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">B&uuml;cher &uuml;ber die&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">Vergangenheit, Gegenwart und Zukunft.&laquo;              &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">                                                    &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)
</P>
<P>
In der Zwischenzeit ist auch bekannt geworden, dass die neue Audio-Software
ARTAS als RTA-L&ouml;sung vorgesehen ist. Es folgen Informationen von der ARTAS-
Homepage (<A HREF="http://artas.amiga-software.com" TARGET="_TOP">http://artas.amiga-software.com</A>):
</P>
<P>
&raquo;ARTAS
</P>
<P>
Amiga ReTargetable Audio-System
</P>
<P>
Antworten auf oft gestellte Fragen
</P>
<P>
Was ist ARTAS?
</P>
<P>
Obwohl sich aus dem Namen schlie&szlig;en lie&szlig;e, das ARTAS nur mit T&ouml;nen
umgehen kann, ist es tats&auml;chlich ein Verwaltungssystem f&uuml;r alle Arten
von Datenstr&ouml;men, wie MIDI, MPEG Audio, Musik und ebenso f&uuml;r Video.
</P>
<P>
ARTAS bietet ein einfach anwendbares API (Amiga Programmers Interface
= Amiga-Programmiererschnittstelle), um mehrfache gepufferte
Datenstr&ouml;me zu kontrollieren. Abspielen eines Samples ist leicht:
F&uuml;llen eines Puffers mit Daten; &Ouml;ffnen der &quot;artas.library&quot;; Mitteilung
an das System, wo die Daten sind, welches Format sie haben und wie
schnell sie abgespielt werden sollen. Aufnehmen ist ebenso einfach.
</P>
<P>
W&auml;hrend Entwickler auf Nicht-Amigasystemen magische Tricks ben&ouml;tigen,
um mehrere Komponenten miteinander zu synchronisieren, bietet ARTAS
einen eingebauten Sync-Mechanismus, der von Treibern (auf Hard- oder
Softwarebasis) getriggert werden kann, und damit das gleichzeitige
Abspielen von MIDI und Audio zusammen mit der Videoausgabe zu einer
einfachen Sache macht.
</P>
<P>
Plug-Ins k&ouml;nnen an alle Arten von Datenstr&ouml;men angef&uuml;gt werden. ARTAS
verarbeitet notwendige Konversionen intern, ohne dass der Anwender
oder Entwickler die einzelnen Datenformate individuell ansprechen
muss. Codecs (= Kodierer/Dekodierer) werden aufgerufen, wenn immer sie
zur Umwandlung von einem Typ in den anderen gebraucht werden, wie z.B.
zur Wandlung von MPEG Audio in den internen Audio-Standard.
</P>
<P>
Mit ARTAS kontrolliert der Benutzer alle Treiber durch einfache
Markierungen. Anwendungsprogrammen, die ARTAS erkennen, sind nicht
l&auml;nger auf das einfache Starten und Stoppen der Datenbehandlung
beschr&auml;nkt.
</P>
<P>
Was wird durch ARTAS unterst&uuml;tzt?<BR>
Wer unterst&uuml;tzt ARTAS?<BR>
</P>
<P>
ARTAS ist eine integrierte Komponente von OS3.5 und steht damit allen
Amiga-Anwendern weltweit &uuml;ber die vorhandenen Vertriebswege zur
Verf&uuml;gung. Das bedeutet auch, das es &uuml;berhaupt nichts kostet
(abgesehen vom Preis f&uuml;r die Aufr&uuml;stung des OS selbt).
</P>
<P>
Es gibt Treiber f&uuml;r die meisten Soundkarten am Markt ebenso wie f&uuml;r
die eingef&uuml;hrten, aber nicht mehr gefertigten Produkte. Es wird
Treiber geben f&uuml;r Hardware-Erweiterungen wie PPC-Karten und
DSP-Boards.
</P>
<P>
Entwickler wohlbekannter Audio-Anwendungen und verwandter Software
haben bereits mitgeteilt, dass sie ARTAS unterst&uuml;tzen werden, wenn es
f&uuml;r ihre Zwecke verf&uuml;gbar sein wird.
</P>
<P>
AHI (Audio Hardware Interface) ist weder &uuml;berfl&uuml;ssig noch ist es ein
konkurrierendes Produkt. ARTAS gestattet die Verwendung von
AHI-Treibern zum Zugriff auf Komponenten, die noch keine angepassten
Treiber haben. Da die Kontrollmechanismen von AHI begrenzt sind, f&uuml;gt
ARTAS diese Eigenschaften zu AHI-Anwendungen durch asynchrone Editoren
hinzu.
</P>
<P>
Nat&uuml;rlich ist ARTAS vollst&auml;ndig OS3.5-konform, was auch bedeutet, es
unterst&uuml;tzt den Einsatz zus&auml;tzlicher CPUs wie PPC direkt von Anfang
an. Der Umfang der CPU-Belegung durch ARTAS h&auml;ngt allein von der
Anwendung (und den aufgerufenen Treibern) ab, die es benutzt, nicht
vom System selbst.
</P>
<P>
Kontakt: - <A HREF="mailto:ARTAS@amiga-software.com">ARTAS@amiga-software.com</A> -
Bitte beachten Sie, dass Sie eventuell bis zum Ende der Computer-98 in
K&ouml;ln warten m&uuml;ssen, bis Ihre eMail bearbeitet wird.
</P>
<P>
Diese Seite wird so bald wie m&ouml;glich aktualisiert werden und wird
Links zu Projekten, Entwicklungsinformationen und allem weiteren
Interessanten &uuml;ber ARTAS bekommen.&laquo;
</P>
<P>
&Uuml;bersetzt aus dem Englischen von Gernod Schomberg.
(Quelle des Originals: <A HREF="http://artas.amiga-software.com" TARGET="_TOP">http://artas.amiga-software.com</A>)
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
