<HTML>
<HEAD>
<TITLE>Vorbericht: Computer '98</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
Vorbericht: Computer '98
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H2>Vorbericht: Computer '98</H2>
<P>
In K&uuml;rze ist es wieder soweit: Die wohl immer noch wichtigste AMIGA-Messe
der Welt &ouml;ffnet f&uuml;r drei Tage in K&ouml;ln ihre Tore. Grund genug, um euch in
diesem Vorbericht &uuml;ber alles Wichtige zu informieren.
</P>
<P>
Bevor wir zu den ausstellenden Firmen kommen, hier einige Allgemein-
Informationen zu der Messe, die der offiziellen Homepage
(<A HREF="http://www.computer98.de" TARGET="_TOP">http://www.computer98.de</A>) entnommen wurden:
</P>
<P>
&raquo;computer '98
</P>
<P>
Europas gro&szlig;e Verkaufsmesse f&uuml;r Computer, Zubeh&ouml;r und Entertainment.
</P>
<P>
K&ouml;ln ist im November der Treffpunkt f&uuml;r den privaten Anwender, Freiberufler
und professionellen Nutzer von Computerhard- und software.
</P>
<P>
Auf dieser Messe erf&auml;hrt der interessierte Konsument alles &uuml;ber Technik,
Trends und Tendenzen aus der bunten Welt der Computerunterhaltung. Das
Messeangebot umfa&szlig;t system&uuml;bergreifende Hard- und Software, Online,
Entertainmentsoftware, Internet, Multimedia und Zubeh&ouml;r.
</P>
<P>
Auch die AMIGA-User kommen voll auf ihre Kosten - Bestandteil der computer
´98 ist die gr&ouml;&szlig;te AMIGA-Messe der Welt. Zahlreiche Aussteller aus dem In-
und Ausland pr&auml;sentieren News und Trends rund um den Amiga. Weitere
Informationen k&ouml;nnen &uuml;ber die entsprechenden Links im Bereich der computer
´98-webpages abgerufen werden.
</P>
<P>
Die COMPUTER `93-97 war eine Gemeinschaftsveranstaltung der PRO Concept
GmbH und der ICP GmbH &amp; Co. KG. Als Nachfolgeveranstaltung wird die
computer '98in diesem Jahr erstmalig von der PRO Concept GmbH als
Alleinveranstalter pr&auml;sentiert.
</P>
<P>
1993-1997 waren bis zu 160 Aussteller und Zehntausende Besucher von den
Veranstaltern zu verzeichnen.
</P>
<P>
Die computer '98 findet vom 13.-15.11.1998auf dem K&ouml;lner Messegel&auml;nde in
der Gro&szlig;raumhalle 11.2 statt. Die &Ouml;ffnungszeiten sind t&auml;glich von 10.00 Uhr
bis 18.00 Uhr.
</P>
<P>
Eintrittskarten k&ouml;nnen im Vorverkauf bei allen
K&ouml;lnTicket-Vorverkaufsstellen bezogen werden und sind dem VRS angebunden
(Anreise). W&auml;hrend der Veranstaltung k&ouml;nnen die Eintrittskarten an den
Tageskassen erworben werden.
</P>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">VV-Preise:     &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">DM 17,00 Sch&uuml;ler/Studenten/Schwerbehinderte&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">               &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">DM 22,00 Erwachsene&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">               &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
Die Eintrittskarten an den Tageskassen sind ab 9.00 Uhr erh&auml;ltlich.
</P>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Preise:     &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">DM 15,00 Sch&uuml;ler/Studenten/Schwerbehinderte&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">            &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">DM 20,00 Erwachsen&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">            &nbsp;</TD><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
Ein Messef&uuml;hrer wird kostenlos auf der Messe ausgegeben.&laquo;
</P>
<P>
(Quelle: PRO Concept)
</P>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Der - m&ouml;glicherweise auch durch das Ausscheiden von ICP als Mitveranstalter&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">- gesunkene AMIGA-Stellenwert der Messe zeigt sich nicht zuletzt am&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">Seminarangebot, das bis 1997 durchaus zufriedenstellend war.&nbsp;</TD></TR>
</TABLE></P>
<P>
In diesem Jahr sieht das leider vollkommen anders aus. Den AMIGA speziell
behandeln nach heutigem Stand der Dinge nur drei Events:
</P>
<P>
<UL>
<LI> WarpOS im Einsatz (Samstag um 13.30 Uhr, Sonntag um 11.30 Uhr)
</LI>
<LI> StormRexx (Freitag um 11.30 Uhr)
</LI>
<LI> DAUG und AMIGA (Fr um 13.30 Uhr, Sa um 15.00 Uhr, So um 16.30 Uhr)
</P>
<P>
</LI>
</UL>
Daneben gibt es wenigstens noch ein paar Veranstaltungen, die _auch_ f&uuml;r
den einen oder anderen AMIGA-User interessant sein k&ouml;nnten, zum Beispiel:
</P>
<P>
<UL>
<LI> Recht im Internet, mit dem bekannten Rechtsanwalt G&uuml;nther Freiherr von
</LI>
</UL>
Gravenreuth (Fr um 16.00, 16.30, 17.00 Uhr, Sa &amp; So je 12.30 und 13.00 Uhr)
<UL>
<LI> Suchpraxis im Internet (Fr um 12.30 Uhr, Sa um 11.30 Uhr, So um 16.00
</LI>
</UL>
Uhr)
</P>
<P>
Jetzt aber zu den auf der Computer '98 ausstellenden AMIGA-Firmen:
</P>
<P>
<UL>
<LI> Albrecht Computer Technik
</P>
<P>
</LI>
</UL>
Pr&auml;sentiert wird wohl die gesamte Hardware-Palette. Gespannt darf man auf
die neue A1200-Soundkarte Prelude 1200 sein, und vielleicht auch auf die
neue RTA-Software ARTAS, wenn sie vorgef&uuml;hrt wird.
</P>
<P>
<UL>
<LI> ACT Electronic
</P>
<P>
</LI>
</UL>
Hersteller u.a. der Apollo-Turbokarten
</P>
<P>
<UL>
<LI> AMIGA-Club im BTX &amp; Internet
</P>
<P>
</LI>
</UL>
Einer der gr&ouml;&szlig;ten AMIGA-Clubs im deutschsprachigen Raum.
</P>
<P>
<UL>
<LI> AMIGA International
</P>
<P>
</LI>
</UL>
Nat&uuml;rlich wird auch das AMIGA-Tochterunternehmen von Gateway anwesend sein,
ebenso Mitarbeiter der Entwicklungsabteilung AMIGA, Inc., die Auskunft zum
AMIGA OS 3.5 geben wollen. Wahrscheinlich wird auch das AMIGA-
Entwicklersystem vorgef&uuml;hrt.
</P>
<P>
<UL>
<LI> AMIGA Magazin
</P>
<P>
</LI>
</UL>
Ehemals popul&auml;res Magazin, das mittlerweile nur noch im Rahmen der PCgo!
abonniert werden kann. Das AMIGA Magazin ist Unteraussteller bei AMIGA
International.
</P>
<P>
<UL>
<LI> APC&amp;TCP
</P>
<P>
</LI>
</UL>
Einer der gr&ouml;&szlig;ten AMIGA-Clubs im deutschsprachigen Raum, DAUG-Mitglied und
Software-Distributor - viele Neuheiten sind zu erwarten, unter anderem
Phoenix, Pulsator, Marblelous 2 und APC&amp;TCP-CD Volume7.
</P>
<P>
<UL>
<LI> Ateo Concepts
</P>
</UL>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Zu sehen sein wird vermutlich die A1200-Grafikkarte Pixel 64 f&uuml;r die Ateo-&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">Steckplatzerweiterung.&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<P>
</LI>
<UL>
<LI> AZT Amiga Zentrum Th&uuml;ringen
</P>
<P>
</LI>
</UL>
Computerclub
</P>
<P>
<UL>
<LI> B&uuml;hler Electronic
</P>
<P>
</LI>
</UL>
Hardware-H&auml;ndler
</P>
<P>
<UL>
<LI> Canon
</P>
<P>
</LI>
</UL>
Druckerhersteller mit gutem AMIGA-Support
</P>
<P>
<UL>
<LI> Conny Figge AMIGA-Versand
</P>
<P>
</LI>
</UL>
Hard- und Softwareh&auml;ndler mit einer gro&szlig;en Auswahl an Spielen
</P>
<P>
<UL>
<LI> Cool bits
</P>
<P>
</LI>
</UL>
H&auml;ndler
</P>
<P>
<UL>
<LI> DAUG
</P>
<P>
</LI>
</UL>
Zusammenschluss deutscher AMIGA-Clubs
</P>
<P>
<UL>
<LI> DCE Computer Service
</P>
<P>
</LI>
</UL>
Hardware-Hersteller
</P>
<P>
<UL>
<LI> Epic Marketing
</P>
<P>
</LI>
</UL>
Softwarehersteller und -Distributor mit vielen Neuheiten
</P>
<P>
<UL>
<LI> Eternity
</P>
<P>
</LI>
</UL>
Entwickler des Spiels 'Tales of Tamar', das auf der Messe vorgestellt
werden soll.
</P>
<P>
<UL>
<LI> Falke-Verlag
</P>
<P>
</LI>
</UL>
Herausgeber der neuen Zeitschrift amigaOS; die Erstausgabe soll auf der
Messe erh&auml;ltlich sein.
</P>
<P>
<UL>
<LI> Gr&uuml;nhof-Verlag
</P>
<P>
</LI>
</UL>
Hersteller der AMIGA-Grafikserie 'Bildersturm'
</P>
<P>
<UL>
<LI> Haage &amp; Partner (zwei St&auml;nde)
</P>
<P>
</LI>
</UL>
Softwarehersteller mit vielen Neuheiten, unter anderem will man die 68k-
Emulation f&uuml;r WarpOS vorstellen.
</P>
<P>
<UL>
<LI> ICP
</P>
<P>
</LI>
</UL>
Herausgeber der Zeitschriften AMIGA Plus und AMIGA Future
</P>
<P>
<UL>
<LI> Impera
</P>
<P>
</LI>
</UL>
Hersteller von Arcade-Spielautomaten auf AMIGA-Basis
</P>
<P>
<UL>
<LI> IOM Industrial Optical Messages
</P>
<P>
</LI>
</UL>
AMIGA-Hard- und -Software
</P>
<P>
<UL>
<LI> IrseeSoft
</P>
<P>
</LI>
</UL>
Hersteller von Turboprint Pro und Picture Manager Pro
</P>
<P>
<UL>
<LI> Kato Development Group
</P>
<P>
</LI>
</UL>
Sound-Hardware
</P>
<P>
<UL>
<LI> MicroniK Computer-Service
</P>
<P>
</LI>
</UL>
Hardware-Hersteller; Micronik will die neue Version des Infinitiv-Towers
vorstellen.
</P>
<P>
<UL>
<LI> New Generation Software
</P>
<P>
</LI>
</UL>
Spiele-Hersteller; vorgestellt werden soll die AMIGA-Version von 'Wet'.
</P>
<P>
<UL>
<LI> NIGHTSHIFT Multimedia Design
</P>
<P>
</LI>
</UL>
AMIGA-Hard- und -Software
</P>
<P>
<UL>
<LI> Nova Design Inc.
</P>
<P>
</LI>
</UL>
&raquo;From: Kermit Woodall
</P>
<P>
Come see Nova Design, Inc. and their German distributor Oberland at the
upcoming Computer '98 show in Cologne, Germany on November 13th through the
15th, 1998.
</P>
<P>
Nova Design, Inc. will be exhibiting the latest releases of ImageFX and
Aladdin 4D. See all the new features of these exciting software packages.
Plus a few surprizes!
</P>
<P>
ImageFX 3.2 is the all new version of the Amiga's top-rated image editing
and special effects package. ImageFX now offers more special effects,
Photoshop PSD file format and Filter Factory  compatibility, multiple image
buffers and views, as well as the most advanced image layers/compositing
system anywhere!
</P>
<P>
Aladdin 4D is a 3D modeling, rendering and animation package. Nova Design,
Inc. has improved Aladdin 4D with new features and a completely Amiga Style
Guide compliant interface. Aladdin 4D is the perfect package for the
beginning 3D artist - while offering features for the professional that
aren't available in any other Amiga 3D package.
</P>
<P>
Show Specials
Oberland will be selling ImageFX and Aladdin 4D for Nova Design, Inc.
during the show at fantastic show specials. If you have been thinking about
purchasing ImageFX and Aladdin 4D, Computer '98 will be the place to be.
See Oberland's booth at the show for a list of all the show specials!
</P>
<P>
Upgrades
Upgrades from the older ImageFX 2.0 through 2.6 releases are only $79.95
plus shipping. Versions of ImageFX prior to 2.0 can be upgraded for only
$124.95 plus shipping. Prices in Britain and Germany may vary. You can
order via 1-800-IMAGE-69 in the US and Canada or call (804) 282-1157
elsewhere. Orders can also be faxed to (804) 282-3768 or mailed to the Nova
Design, Inc , 1910 Byrd Avenue, Suite 204, Richmond, VA 23230 USA,
Attention: Upgrades
</P>
<P>
To order your upgrade in Germany from Oberland just call them at 06173-608-
0, or mail them at: Oberland Computer, In der Schneithohl 5, D-61476
Kronberg im Taunus
</P>
<P>
To order your upgrade from Compute! in Britain call them at: 0181-303-1800,
or mail them at: Compute!, 5 Blackfen Parade, Sidcup, Kent, Da15 9LU&laquo;
</P>
<P>
<UL>
<LI> Oberland Computer
</P>
<P>
</LI>
</UL>
Pr&auml;sentiert werden sollen der Raytracer monzoom 3D (hie&szlig; fr&uuml;her
Reflections) und das Animationssystem Wildfire in der neuen Version 7.
</P>
<P>
<UL>
<LI> Protovision Verlags AG
</P>
<P>
</LI>
</UL>
Herausgeber der neuen Zeitschrift AMIGA Fever; die Erstausgabe soll auf der
Messe erh&auml;ltlich sein.
</P>
<P>
<UL>
<LI> RBM Computertechnik
</P>
<P>
</LI>
</UL>
&raquo;RBM Computertechnik auf der Computer 98
</P>
<H3>13. - 15. November</H3>
<P>
Auf der Computer 98 in der Zeit vom 13. - 15. November wird RBM den
Towerhawk 1200 ex mit allen Erweiterungen pr&auml;sentieren: Dazu geh&ouml;ren
unter anderem der Video-Steckplatz VidiON ex sowie die ZorroIII-Erweiterung
f&uuml;r das ONBoard 1200 ex und der zugeh&ouml;rige Prozessor-Karten-Adapter
TurboON 32 4000, der es erm&ouml;glicht, Amiga 4000 Prozessorkarten im Amiga
1200 zu betreiben.
</P>
<P>
Au&szlig;erdem wird die Multi-I/O-Karte IOBlix zu sehen sein, die mit vier
seriellen High-Speed-Schnittstellen und zwei EPP/ECP- Parallel-Ports
ausgestattet ist. Zus&auml;tzlich verf&uuml;gt der IOBlix &uuml;ber zwei
Modul-Steckpl&auml;tze f&uuml;r die eine Sound- und eine Ethernet-Karte
vorgestellt werden.
</P>
<P>
Erstmals wird in K&ouml;ln der IOBlix 1200 erh&auml;ltlich sein. Diese modular
aufgebaute Multi-I/O-Karte r&uuml;stet den Amiga 1200 intern (&uuml;ber den
sogenannten &quot;Uhrenport&quot;) mit zwei seriellen High-Speed Schnittstellen
und/oder einem EPP/ECP-Port auf. F&uuml;r diese Schnittstellen wird RBM bis
dahin auch ScanQuix 4 angepa&szlig;t haben, so da&szlig; interessante Angebote mit
Parallel-Port-Scannern zu erwarten sind!
</P>
<P>
Neben ScanQuix 4 bietet RBM jetzt auch UltraConv 3 an. Der kommerzielle
Nachfolger der bekannten Shareware setzt neue Ma&szlig;st&auml;be in puncto Bilder-
und Animations-Effekte und bietet nun auch PPC Unterst&uuml;tzung. Weiterhin
wird der bekannte News- und Mailreader FFNews in der Version 2.40
verf&uuml;gbar sein.&laquo;
</P>
<P>
(Quelle: RBM)
</P>
<P>
<UL>
<LI> Schatztruhe GmbH
</P>
<P>
</LI>
</UL>
Nach monatelangen Verz&ouml;gerungen soll nun endlich die Speicherschutzsoftware
AMIGA Bodyguard vorf&uuml;hrbar sein. Weitere Neuigkeiten werden Directory Opus
Magellan II und das ab jetzt kommerziell vertriebene CyberGraphX sein, das
in Version 4 &uuml;ber die Ladentische gehen soll.
</P>
<P>
<UL>
<LI> Seidel Softwareservice
</P>
<P>
</LI>
</UL>
AMIGA-Grafiksoftware
</P>
<P>
<UL>
<LI> The Real Ologram
</P>
<P>
</LI>
</UL>
Der Spiele-Hersteller will das Beat'em'Up Olofight vorf&uuml;hren.
</P>
<P>
<UL>
<LI> Titan Computer
</P>
<P>
</LI>
</UL>
Software-Hersteller, der auf der Computer '98 vermutlich _das_ AMIGA-Spiel
des Jahres 1999 ank&uuml;ndigen will... Des Weiteren soll das Grafikprogramm
Fantastic Dreams gezeigt werden.
</P>
<P>
<UL>
<LI> Verkosoft
</P>
<P>
</LI>
</UL>
Spiele-Hersteller
</P>
<P>
<UL>
<LI> Vesalia
</P>
<P>
</LI>
</UL>
Hard- und Softwareh&auml;ndler
</P>
<P>
<UL>
<LI> Village Tronic
</P>
</UL>
<B>&raquo;Pressemitteilung:</B>
<P>
Village Tronic auf der Computer`98 in K&ouml;ln.
</P>
<P>
Auch dieses Jahr l&auml;&szlig;t es sich Village Tronic aus Sarstedt bei Hannover
nicht nehmen, seine Zelte auf der altehrw&uuml;rdigen Amiga Messe, der Computer
98 in K&ouml;ln aufzuschlagen.
</P>
<P>
Wie in den Jahren zuvor wird die aktuelle Produktpalette der
Hardwareschmiede vorgstellt werden. Auf gro&szlig;es Interesse d&uuml;rfte hierbei
eine Neuentwicklung sto&szlig;en: Die AriadneII Ethernetkarte, das
Nachfolgemodell der bekannten Highspeed-Netzwerkkarte, wird hier
voraussichtlich zu bestaunen und zu kaufen sein - nat&uuml;rlich zu
Messepreisen.
</P>
<P>
Das gleiche gilt f&uuml;r die PicassoIV Grafikkarte, die durch ihre Modularit&auml;t
einen Standart im Amigamarkt gesetzt hat. Das Zusatzmodul Paloma soll mit
einer neuen Zusatzfunktion gezeigt werden und die F&auml;higkeit unter Beweis
stellen, kleine Animationsseqeunzen im AVI Format abspeichern zu k&ouml;nnen.
Der Programmierer von PalomAVI wird f&uuml;r Fragen und Antworten zur Verf&uuml;gung
stehen.
</P>
<P>
Am Samstag den 14.11. wird der Entwickler der Picasso IV, Klaus Burkert,
zwischen 13-16 Uhr ebenfalls mit Rat und Tat zur Verf&uuml;gung stehen.
</P>
<P>
Village Tronic freut sich auf Ihren Besuch!
</P>
<P>
E.Br&uuml;ggemann, AmigaSupport VT - Tel.:+(49)(0)5066-7013-10&laquo;
</P>
<P>
(Quelle: Village Tronic)
</P>
<P>
</LI>
<UL>
<LI> Y/C Plus Inc.
</P>
<P>
</LI>
</UL>
Hersteller von AMIGA-Monitoren und -Video-Zubeh&ouml;r
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
