<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H3>6. A.C.T. k&uuml;ndigt Soundkarte f&uuml;r A 1200 an</H3>
<P>
&raquo;Prelude1200 Presse Information
</P>
<P>
Audio Hardware f&uuml;r Amiga 1200 Computer
</P>
<P>
Nach ca. dreimonatiger Entwicklung ist die Prelude1200 nun in
Serienproduktion gegangen. Die Karte wurde bei A.C.T. wie immer von Thomas
Wenzel entwickelt und d&uuml;rfte aufgrund der mehrj&auml;hrigen Erfahrung von A.C.T.
im Amiga-Audio Sektor innerhalb kurzer Zeit zum neuen Standard werden.
Selbstverst&auml;ndlich ist der bekannte Rundum- Service von A.C.T. auch f&uuml;r
dieses Produkt per Telefon, Brief, Fax, E- und FidoMail verf&uuml;gbar.
</P>
<P>
Nach katastrophal verlaufenen Versuchen, die Entwicklung durch Fremd-
Entwickler ausf&uuml;hren zu lassen wurde das Design der Prelude (Zorro)
&uuml;berarbeitet und an die Anforderungen des Amiga1200 angepasst.Sobald die
ersten Vorserienmuster verf&uuml;gbar sind, werden wir Fotos davon auf unserer
Homepage ver&ouml;ffentlichen.
</P>
<P>
Aus der gro&szlig;en, komplett in konventioneller Best&uuml;ckung hergestellten
Prelude ist eine kompakte, nahtlos in den A1200 integrierbare Karte in SMD
geworden, mit einem Audio-Chipsatz, der sich auch auf qualitativ
h&ouml;herwertigen PC-Soundkarten (z.B. von Terratec) vielfach bew&auml;hrt hat.
Durch die gesunkenen Produktionskosten werden wir in der Lage sein, die
Karte zu einem interessanten Preis anbieten zu k&ouml;nnen, gleichzeitig bietet
die Prelude1200 gute Klangqualit&auml;t und Kompatiblit&auml;t.
</P>
<P>
Prelude1200 ist die erste Soundkarte, die zu ihrem Schwestermodell 95%
hard- und 100% softwarekompatibel ist. Das aus zwei Platinen bestehende
System belegt lediglich den Steckplatz, der urspr&uuml;nglich f&uuml;r die
Echtzeituhr vorgesehen war,sowie den Einschub unter dem Disketten-
laufwerk. Als Wandler wurde kein billiger Soundblaster-Chip verwendet,
sondern ein Codec der gehobenen Klasse, der speziell f&uuml;r den Einsatz
innerhalb von Computern konzipiert wurde. Neben den zur Aufnahme und
Wiedergabe (fullduplex) notwendigen Wandlern hat dieser Codec zus&auml;tzlich
einen Mehrkanalmischer mit Record-Selector und feinstufiger Aussteuerung
sowie eine hochgenaue, geregelte Referenzspannung zur wirkungsvollen Unter-
dr&uuml;ckung von St&ouml;rungen in der Stromversorgung gleich eingebaut. Die gleiche
Signalqualit&auml;t mit herk&ouml;mmlichen AD-DA Wandlern zu erreichen w&uuml;rde einen
nicht zu vertretenen Aufwand an analoger Beschaltung er- fordern, der den
Verkaufspreis unn&ouml;tig nach oben triebe.
</P>
<P>
Dennoch entspricht auch der Analogteil gehobenen Anspr&uuml;chen. Im Signalweg
kommen nur verzerrungs- und rauscharme Bauteile zum Einsatz. Die Platine im
Erweiterungsschacht arbeitet komplett niederfrequent und ist &uuml;ber
Entst&ouml;rfilter mit dem hochfrequenten Digitalteil im Uhrenport verbunden.
Solange die Karte nicht durch die Treibersoftware initialisiert wurde, z.B.
bei &auml;lteren Spielen mit Bootloader, wird das Amiga-Audiosignal 1:1
durchgeschliffen. Durch dieses von den Amiga Grafikkarten bekannte Prinzip
entf&auml;llt das l&auml;stige Umstecken der Kabel wie es bei anderen Soundkarten
notwendig ist.
</P>
<P>
Die Prelude1200 wird komplett in Deutschland industriell gefertigt und ist
damit bereits voraussichtlich kurz nach dem Anlaufen der Serien- produktion
in gr&ouml;&szlig;eren St&uuml;ckzahlen verf&uuml;gbar.Bei der angestrebten Fertigungsmenge und
Lieferzeit (kurzfristig) kommt eine Handbest&uuml;ckung schon aus Kostengr&uuml;nden
nicht in Frage.
</P>
<P>
Die Prelude1200 wurde mit dem Hintergrund entworfen, vollst&auml;ndig
softwarekompatibel zur Zorroversion zu sein. Sowohl die von einer
wachsenden Zahl von Programmen verwendete prelude.library als auch der AHI
Treiber lassen sich v&ouml;llig transparent f&uuml;r beide Modelle verwenden.
Aufgrund der hohen Hardwarekompatibilit&auml;t waren hierzu nur geringe
&Auml;nderungen an den Treibern notwendig, wodurch s&auml;mtliche Updates automatisch
f&uuml;r beide Versionen gelten - es wird nur eine Software ben&ouml;tigt, die
Treiber erkennen selbstst&auml;ndig, welche Hardware vorhanden ist.
</P>
<P>
F&uuml;r den Einbau in einen Tower werden wir sobald wie m&ouml;glich ein passendes
Slotblech anbieten, welches einfach statt der Blende f&uuml;r den A1200 Einschub
am Analogteil angebracht werden kann und dann alle Anschl&uuml;sse extern zur
Verf&uuml;gung stellt.
</P>
<P>
Zum Lieferumfang der Karte geh&ouml;ren neben der Library und dem AHI Treiber
selbstverst&auml;ndlich Programme f&uuml;r Wiedergabe und Aufnahme sowie zur
Bedienung des Audiomischers. Ebenso selbstverst&auml;ndlich ist die volle
Unterst&uuml;tzung der Prelude1200 durch Samplitude (HD-Recording Software), da
die Enwickler der Treibersoftware und von Samplitude die gleichen sind. Die
seit der SEK'D &Auml;ra stark &uuml;berarbeitete und st&auml;ndig weiterentwickelte
Version &quot;Samplitude Opus&quot; wird bereits in mehreren Studios erfolgreich
eingesetzt. Um den Neueinsteiger schnell an die M&ouml;glichkeiten der Hardware
heranzuf&uuml;hren wird die Prelude1200 mit SAMPLITUDE OPUS CD Version
ausgeliefert - damit erh&auml;lt der Kunde ein vollwertiges HD-Recording- und
Editing System.
</P>
<P>
Ferner wird mit der Prelude1200 auch AmigaAMP ausgeliefert. AmigaAMP ist
ein Programm zur Wiedergabe von MPEG-Audio (MP3) und ist f&uuml;r das demn&auml;chst
f&uuml;r die Zorro-Version der Prelude erscheinende MPEG Decoder Modul bereits
vorbereitet. Ohne dieses Modul arbeitet AmigaAMP rein softwarem&auml;&szlig;ig und
kann zur Dekodierung sowohl den 680x0 als auch einen eventuell vorhandenen
PPC benutzen. Der interne PPC Dekoder ist so schnell, da&szlig; problemlos
zwischen zwei gleichzeitig spielenden Instanzen von AmigaAMP &uuml;bergeblendet
werden kann. Die weiteren Features von AmigaAMP (wahlweise GadTools
(fontsensitiv) oder WinAMP Skins, AREXX Port, etc.) d&uuml;rften hinreichend
bekannt sein.AmigaAMP ist Freeware und arbeitet ausserdem mit jeder AHI
kompatiblen Soundkarte zusammen.
</P>
<P>
Neu auf der Prelude1200 ist ein aktiver Mikrofon-Vorverst&auml;rker, der sowohl
den Betrieb von dynamischen als auch von aktiven und passiven Kondensator-
mikrofonen erlaubt. Zusammen mit der hardwareunterst&uuml;tzten ADPCM-Kodierung
von Audiosignalen ist somit nahezu CPU-lastfreie Internettelefonie leicht
zu entwickeln. Ein entsprechendes Programm wird derzeit von dritter Seite
vorbereitet. Ferner sind zwei der insgesamt vier Stereo- Eing&auml;nge auch
intern zug&auml;nglich, z.B. f&uuml;r den Anschlu&szlig; eines CD-ROM- Laufwerkes und der
internen Einspeisung des Amiga-Audiosignals. Die technischen Daten der
Prelude Zorro Version gelten bis auf die Erweiterbarkeit (die Prelude1200
ist aus mechanischen Gr&uuml;nden nicht erweiterbar) auch f&uuml;r die Prelude1200:
5kHz bis 64kHz (!) Sampling Raten mit korrekten Quarzen auch f&uuml;r 44.1kHz
(kein Resampling n&ouml;tig, kein Jitter durch falsche Quarzbest&uuml;ckung), Full
Duplex (Aufnahme/Wiedergabe gleichzeitig), 16Bit (ADPCM, uLaw, ALaw, 8 Bit
ebenfalls direkt unterst&uuml;tzt), niedrige CPU Last, einfach zu
programmierende API.&laquo;
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
