<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H3>3. Demo-Wettbewerb zur Computer '98 gestartet</H3>
<P>
&raquo;Amiga Democompetition98 &copy;by Nightshift
</P>
<P>
!!! Zeigt der Welt, was der Amiga kann !!!
</P>
<P>
Die Teilnahmebedingungen!
Der Wettbewerb wird eingeteilt in folgende Kategorien.
</P>
<P>
&quot;Mini-Demo.&quot; Amiga Power auf kleinstem Raum.&quot; 40 KByte Filegr&ouml;&szlig;e.
</P>
<P>
&quot;Classic 1200.&quot; Demospa&szlig; f&uuml;r jedermann. bis 2 MB Filegr&ouml;&szlig;e.
</P>
<P>
&quot;The Big.&quot; Cyberspace bis der Arzt kommt. bis 5 MB Filegr&ouml;&szlig;e.
</P>
<P>
ACHTUNG !! AGA Only !
Bitte keine Anim-Orgien mit MPEG, AVI, YAFA oder &auml;hnliches !
Echtzeit-Coding ist gefragt.
</P>
<P>
Es ist geplant die Demos auf einer gro&szlig;en Leinwand auf der &quot;Fun-B&uuml;hne&quot; bei
Amiga International vorzuf&uuml;hren. Um einen reibungslosen Ablauf bei der
Vorf&uuml;hrung zu gew&auml;hrleisten sind folgende Bedingungen einzuhalten.
Das Demofile mu&szlig; aus der Shell startbar sein und nach Ablauf
&quot;SAUBER&quot;aussteigen und das System wieder freigeben.Abgesehen vom Titel
bitte keine Texterg&uuml;sse innerhalb des Demos. Da die Demofiles in eine
Gesamtpr&auml;sentation eingebaut werden sollen, k&ouml;nnt Ihr zwei Bilder (eines
f&uuml;r den Anfang, das andere f&uuml;rs Ende) und einen &quot;Credit-Text&quot; von max 300
Zeichen L&auml;nge extrabeilegen.
</P>
<P>
Eine Anspruchsvolle Pr&auml;sentation wird garantiert !!!!
Pornographische oder Gewalt verherrlichende Darstellungen sind
ausgeschlossen !
Um m&ouml;glichst vielen Teilnehmern eine Chance zu bieten sollte die
Abspieldauer der einzelnen Demofiles die L&auml;nge von
5 Minuten nicht &uuml;berschreiten. .
</P>
<P>
Die Konfigurationen der Vorf&uuml;hrrechner sind wie folgt:
F&uuml;r &quot;Mini-Demo&quot; und &quot;Classic 1200&quot;:
A1200/030 (50Mhz), XXXX82 CoPro, +4Meg Fast
F&uuml;r &quot;The Big&quot; und &quot;High End&quot;:
A4000/060/PPC604e, CGfx3D, +128 Fast.
</P>
<P>
Die Daten (Demofile + Bilder + Textfile + evtl. Readme) bitte mit LHA
packen und per E-Mail einsenden an:
&quot;<A HREF="mailto:demo98@nightshift.de">demo98@nightshift.de</A>&quot;
</P>
<P>
Zu gewinnen gibt es folgende Preise:
</P>
<P>
Die Preise stehen noch nicht Fest.
</P>
<P>
Einsendeschlu&szlig; ist der 10.11.1998
</P>
<P>
Je nach Anzahl der eingesendeten Demos kann es nat&uuml;rlich vorkommen, da&szlig; nur
eine Auswahl in die Endausscheidung auf der Computer98 kommt.
Auf einer CD-Rom, die nach der Messe zu erhalten sein wird, werden wir
jedoch jedes bis zum letzten Tag vor der Messe eingesendete Demo mit
aufnehmen. Vorausgesetzt, der/die Autor/en geben uns dazu die Erlaubnis in
Ihrem Readme-file.
</P>
<P>
Diese CD wird dann zu einem absoluten &quot;Low Cost&quot; Preis(ca. 10 DM ), zu
erwerben sein.
</P>
<P>
So long...<BR>
Gru&szlig;<BR>
NIGHTSHIFT<BR>
Jooachim + Ralf<BR>
</P>
<P>
Dies ist ein Demowettbewerb iniziiert von Amiga inc..
</P>
<P>
Nightshift stellt seinen Server zur Verf&uuml;gung, regelt die Zusammenstellung
und stellt die Rechner auf der &quot;Amiga Democompetition auf der Computer 98
&quot;zur Verf&uuml;gung.
</P>
<P>
Nightshift kann f&uuml;r keine eventuellen Sch&auml;den haftbar gemacht werden.&laquo;
</P>
<P>
(Quelle: Nightshift)
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
