<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses7.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="Diverses9.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H3>8. Schatztruhe GmbH k&uuml;ndigt Directory Opus 5 Magellan II an</H3>
<P>
&raquo;Directory Opus 5 Magellan II
</P>
<P>
Seit der ersten Ver&ouml;ffentlichung Anfang des Jahres 1995 haben die Benutzer
des Amiga die M&ouml;glichkeiten gesehen, die Ihnen Opus 5 mit seinem
einzigartigen Konzept des Workbenchersatzes, des Dateimanagements und
seiner benutzerdefinierbaren Funktionen bietet. Diese Konzepte wurden in
der Opus-Version von Mai 1996 und Opus Magellan im Jahre 1997 noch weiter
ausgearbeitet. W&auml;hrend dieser noch anhaltenden Zeit der gro&szlig;en Ungewi&szlig;heit
f&uuml;r die Amiga-Plattform als solche, erhielten wir neuen Auftrieb durch die
Unterst&uuml;tzung der zahlreichen Opus-Benutzer, die uns st&auml;ndig ermunterten
und uns auch wertvolle Informationen und Anregungen f&uuml;r die zuk&uuml;nftige
Entwicklung von Opus 5 zukommen liessen.
</P>
<P>
Durch Ihre Unterst&uuml;tzung hat sich Opus 5 als das f&uuml;hrende Programm f&uuml;r den
Workbenchersatz und das Dateimanagement f&uuml;r den Amiga fest etablieren
k&ouml;nnen.
</P>
<P>
Wir m&ouml;chten Ihnen daf&uuml;r danken!
</P>
<P>
Mit dieser neuen Version unternehmen wir den Versuch Ihnen etwas von dieser
Loyalit&auml;t durch die laufende Unterst&uuml;tzung der Amiga-Plattform und eine
Fortf&uuml;hrung unserer Entwicklungspl&auml;ne f&uuml;r Opus 5 zur&uuml;ckzugeben. Wir haben
auch versucht soviel wie m&ouml;glich von den Vorschl&auml;gen unserer Benutzer zu
integrieren, sofern diese mit dem Konzept von Opus vereinbar waren.
</P>
<P>
Wir hoffen, da&szlig; Ihnen die erweiterten F&auml;higkeiten in dieser neuen Version
gefallen werden, die wir &quot;Directory Opus 5 Magellan II&quot; nennen.
</P>
<P>
Zusammenfassung der Verbesserungen:
</P>
<P>
Die vorliegende Magellan II Version ist nicht nur ein simples Upgrade,
sondern das Produkt von mehr als 12 Monaten intensiver Entwicklung
zahlreicher Komponenten des Opus 5 Magellan Systems und der
enthusiastischen Tests unserer Betatester.Diese Version bietet Ihnen viele
neue M&ouml;glichkeiten mit &uuml;berlegener Nutzbarkeit speziell im Einsatz als
Workbenchersatz, mit vielen neuen F&auml;higkeiten wie Themes, Sound
Ereignissen, erweiterten Konfigurationsm&ouml;glichkeiten und stark verbesserter
Nutzung der Hintergr&uuml;nde, um nur einige zu nennen.
</P>
<P>
Nach intensiven Testl&auml;ufen haben wir auch die Kompatibilit&auml;t mit der
Workbench und anderen Programmen noch weiter erh&ouml;hen k&ouml;nnen.Opus 5 Magellan
II verf&uuml;gt &uuml;ber ein v&ouml;llig neu geschriebenes OpusFTP-Modul und bietet Ihnen
dadurch nicht nur noch einfacheren Zugriff auf das Internet, sondern auch
eine wesentlich verbesserte grafische Benutzeroberfl&auml;che f&uuml;r das Adressbuch
und die zu nutzenden Parameter.
</P>
<P>
Die neuen M&ouml;glichkeiten:
</P>
<P>
<UL>
<LI> Verbesserte Funktionalit&auml;t der Dateilister einschlie&szlig;lich:
</P>
<P>
</LI>
<LI> Verwendung von Proportionalen Schriften
</LI>
<LI> Gr&ouml;&szlig;enver&auml;nderbare Felder
</LI>
<LI> Indikator zur Anzeige des aktuellen Sortiermodus
</LI>
<LI> Verbessertes Inline-Editing
</P>
<P>
</LI>
<LI> Verbessertes OpusFTP-Modul einschlie&szlig;lich:
</P>
<P>
</LI>
<LI> Komplett neu gestaltete grafische Benutzeroberfl&auml;che
</LI>
<LI> Individuelle Einstellm&ouml;glichkeiten f&uuml;r jede FTP Site
</LI>
<LI> Erweitertes Drag&amp;Drop erm&ouml;glicht FTP-Shortcuts
</LI>
<LI> Rekursives Kopieren von Verzeichnissen
</LI>
<LI> Erweiterte Unterst&uuml;tzung f&uuml;r Opus Kommandos
</LI>
<LI> Vollst&auml;ndige Unterst&uuml;tzung von Protection Bits
</LI>
<LI> Neue Skript Dateien
</LI>
<LI> Automatischer Neuaufbau der Verbindung
</LI>
<LI> Verbesserte Site-to-Site M&ouml;glichkeiten
</LI>
<LI> Optionale Anzeigen f&uuml;r &Uuml;bertragungsstatus
</LI>
<LI> Unterst&uuml;tzung f&uuml;r Firewalls und IP-Masking
</LI>
<LI> Pfadgadget der Lister unterst&uuml;tzen jetzt URL Syntax
</LI>
<LI> Inline-Editing f&uuml;r Dateinamen und Schutzbits
</LI>
<LI> Synchrone Kommandostruktur f&uuml;r interaktive ARexx Skripte
</LI>
<LI> Verbesserte Geschwindigkeit und Unterst&uuml;tzung aller Amiga TCP Stacks
</LI>
<LI> Spezielle Popup-Men&uuml;s f&uuml;r FTP Lister
</P>
<P>
</LI>
<LI> Themes - konfigurieren Sie Ihr System mit Ihren bevorzugten Grafiken, T&ouml;nen und Schriften
</LI>
<LI> Neues intuitives Layout der Einstellungsrequester
</LI>
<LI> Hintergrundbilder in Knopfb&auml;nken und Startmen&uuml;s
</LI>
<LI> Zufallsgesteuerte Hintergr&uuml;nde
</LI>
<LI> Umri&szlig;- und Schattenschriften auf der Arbeitsoberfl&auml;che
</LI>
<LI> Vollst&auml;ndig konfigurierbare Bildschirm Titelleiste mit vielen Optionen
</LI>
<LI> Frei konfigurierbare Sound Ereignisse, z.B. beim Einlegen einer Diskette
</LI>
<LI> Einstellm&ouml;glichkeit f&uuml;r Opus-interne Suchpfade
</LI>
<LI> Unterst&uuml;tzung von langen Filenamen bis 107 Buchstaben
</LI>
<LI> Neues grafisches Layout und bessere Konfigurierbarkeit von Knopfb&auml;nken
</LI>
<LI> &Uuml;berarbeitete interne Kommandos, viele davon sind nun extern ersetzbar
</LI>
<LI> Erweitertes Skriptsystem mit verbesserter Anbindung an interne Kommandos und OpusFTP
</LI>
<LI> Verbesserte Multilevel-Startmen&uuml;s
</LI>
<LI> Die Filetypenerkennung wurde um neue Funktionen erweitert
</LI>
<LI> Neue und erweiterte Popup Men&uuml;s
</LI>
<LI> Stark erweiterte Piktogramm sowie Drag&amp;Drop Funktionalit&auml;t
</LI>
<LI> Zahlreiche neue ARexx Befehle
</P>
</UL>
<P><TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD ALIGN="LEFT" VALIGN="TOP">Wie Sie sehen, gibt es zahlreiche Gr&uuml;nde, Directory Opus Magellan II lieber&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">heute als morgen zu bestellen.&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">lieferbar ab dem 13.11.98 f&uuml;r nur DM 99,-Update von Opus 5.x erh&auml;ltlich f&uuml;r&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">nur DM 69,-&laquo;&nbsp;</TD></TR>
<TR><TD ALIGN="LEFT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE></P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="Diverses9.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
