<HTML>
<HEAD>
<TITLE>Gehört - notiert</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses16.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
Geh&ouml;rt - notiert
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H2>Geh&ouml;rt - notiert</H2>
<H2>AMIGA-Meldungen</H2>
<P>
<UL>
<LI> Zun&auml;chst leider zu einer traurigen Nachricht, die uns erreichte: Wolfgang
  Lug, Autor des Programms AMIGAWorld, ist vor kurzem verstorben. Wir
  werden ihn in Erinnerung behalten.
</P>
<P>
</LI>
<LI> &raquo;Das Grafikpaket Photoalbum/Cybershow Professional von Helmut Hoffmann
  gibt es f&uuml;r alle Besucher der Amiga Arena bis zur Computer '98 (15.11.98)
  f&uuml;r 40 DM statt bisher 50 DM (Preisnachlass 20%). Sinn und Zweck der
  Aktion ist es, die aktiven Shareware-Programmierer zu unterst&uuml;tzen.&laquo;
  (Olaf K&ouml;bnik, E-Mail: <A HREF="mailto:olaf.koebnik@online-club.de,">olaf.koebnik@online-club.de,</A> WWW: <A HREF="http://online-club.de/~ARENA/" TARGET="_TOP">http://online-club.de/~ARENA/</A>)
</P>
<P>
</LI>
<LI> &raquo;Nach PhotoAlbum/Cybershow, ein weiteres Shareware-Highlight! Das
  Astronomie-Programm &quot;Digital Almanac&quot; gibt es exklusiv f&uuml;r alle Amiga-
  Arena-Besucher f&uuml;r nur 20 DM!&laquo; (Olaf K&ouml;bnik, E-Mail: <A HREF="mailto:olaf.koebnik@online-club.de,">olaf.koebnik@online-club.de,</A> WWW: <A HREF="http://online-club.de/~ARENA/" TARGET="_TOP">http://online-club.de/~ARENA/</A>)
</P>
<P>
</LI>
<LI> Anl&auml;sslich der Computer '98 wird am 14. November in K&ouml;ln eine Scene-Party
  veranstaltet. N&auml;here Infos sind auf <A HREF="http://www.academicus.de/cc98" TARGET="_TOP">http://www.academicus.de/cc98</A> zu
  erfahren.
</P>
<P>
</LI>
<LI> Der WDR-Computerclub veranstaltet in der Nacht vom 5. auf den 6. Dezember
  eine sechseinhalbst&uuml;ndige Sonderausgabe. F&uuml;r diese Sendung werden noch
  Themenvorschl&auml;ge gesucht, die sich auf <A HREF="http://www.wdr.de/tv/Computer-" TARGET="_TOP">http://www.wdr.de/tv/Computer-</A>
  Club/vorschlag.htm online &uuml;bermitteln lassen. Angesichts der langen
  Sendezeit wird es doch wohl m&ouml;glich sein, wenigstens 1 AMIGA-Thema
  durchzubringen, oder?!
</P>
<P>
</LI>
<LI> Die Ver&ouml;ffentlichung einer AMIGA-Umsetzung des WWW-Browsers Opera ist
  wieder unwahrscheinlicher geworden. Nach Angaben von OperaSoftware hat
  das Entwicklerteam beschlossen, das Projekt auf Grund der schlechten
  AMIGA-Situation bis zur Computer '98 auf Eis zu legen. Von den
  Ergebnissen der Messe wolle man abh&auml;ngig machen, ob das Projekt
  weitergef&uuml;hrt oder endg&uuml;ltig gestoppt wird.
</P>
<P>
</LI>
<LI> In K&uuml;rze wird bei Titan Computer Candy Factory Pro, die kommerzielle
  Version des Grafikprogramms, erscheinen. Vollst&auml;ndiger 24-Bit-Support und
  Anti-Aliasing sollen zu den neuen Features geh&ouml;ren.
</P>
<P>
</LI>
<LI> Das bekannte E-Mail-Programm YAM ist in einer neuen Betaversion
  erschienen. YAM v2.0 Preview 6, bei der sowohl Fehler behoben als auch
  neue Features integriert wurden, l&auml;sst sich auf <A HREF="http://www.yam.ch" TARGET="_TOP">http://www.yam.ch</A>
  herunterladen und l&auml;uft - zumindest bei mir - stabil.
</P>
<P>
</LI>
<LI> Bei Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_TOP">http://www.haage-partner.com</A>) ist ein weiterer
  Update-Patch f&uuml;r die Textverarbeitung AMIGA Writer erschienen. Die neue
  Version 1.1 beinhaltet dem Unternehmen zufolge unter anderem folgende
  Verbesserungen:
</LI>
<UL>
<LI> verbessertes Drucken
</LI>
<LI> Fontersetzungstabelle
</LI>
<LI> Multi-Assigns f&uuml;r Fontverzeichnisse
</LI>
<LI> Bubble-Help-Kontrolle
</LI>
<LI> vollst&auml;ndige Lokalisierung
</LI>
<LI> verbesserte Anbindung des StormScreenManagers
</P>
<P>
</LI>
</UL>
<LI> Die k&uuml;rzlich auf der WWW-Site von AMIGA, Inc. f&uuml;r Programmierer bereit
  gestellten ROM Kernal Manuals (RKMs) sind wieder verschwunden. Offenbar
  gab es rechtliche Probleme.
</P>
<P>
</LI>
<LI> Mit der 'HighVoltage', betrieben vom APC&amp;TCP, hat Anfang Oktober eine der
  bekanntesten AMIGA-Mailboxen ihren Betrieb wohl f&uuml;r immer eingestellt.
  Grund sei ein kompletter Datenverlust, ausgel&ouml;st durch einen Festplatten-
  Crash, so Andreas Magerl vom APC&amp;TCP.
</P>
<P>
</LI>
<LI> &raquo;Die Software &quot;AMIGA Bodybuard&quot;, angek&uuml;ndigt f&uuml;r den Mai '98 wird nun
  definitiv sp&auml;testens bis zur Messe Computer '98 in K&ouml;ln erscheinen...&laquo;
  (Dirk Wenk, E-Mail: <A HREF="mailto:Wax@topmail.de">Wax@topmail.de</A>)
</P>
<P>
</LI>
<LI> Nach Angaben von NewTekniques ist der Rechtsstreit zwischen QuikPak und
  Escom-Konkursverwalter Dr. Bernhard Hembach, der zur Verknappung von
  A4000T-Rechnern gef&uuml;hrt hat, beigelegt. Demnach soll QuikPak sein
  Inventar nach Deutschland schicken, wo die Produktion des A4000T wieder
  aufgenommen w&uuml;rde. Bereits zu Weihnachten k&ouml;nnten wieder etwa 2000 A4000T
  auf dem Markt sein. W&auml;hrend des Rechtsstreits sei die  Zahl der
  Mitarbeiter bei QuikPak von &uuml;ber zwanzig auf nur noch einen geschrumpft.
</P>
<P>
</LI>
<LI> In Ausgabe 9/98 haben wir noch &uuml;ber das Unternehmen Nova Sector
  Engineering spekuliert, das Ende letzten Jahres ein AMIGA-Notebook auf
  PowerPC-Basis angek&uuml;ndigt hat. Nun ist klar: Nova Sector hat seine
  Gesch&auml;ftst&auml;tigkeit eingestellt.
</P>
</UL>
<H2>Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)</H2>
<P>
</LI>
<UL>
<LI> Die bekannte Computer-Handelskette Schadt befindet sich seit dem 28.10.98
  zusammen mit ihren Tochterfirmen Proline, Topline und Cube Systems in
  Konkurs. In letzter Zeit war Schadt durch besonders g&uuml;nstige Angebote
  aufgefallen, was die Pleite verhindern sollte - vergeblich.
</P>
<P>
</LI>
<LI> Der Verkauf der Vobis-Gruppe an das amerikanische Unternehmen CHS ist
  nachtr&auml;glich gescheitert. Trotz Fristverl&auml;ngerung konnte die vereinbarte
  Kaufsumme, rund 1,2 Milliarden Mark, nicht aufgebracht werden.
</P>
<P>
</LI>
<LI> Die Bonner Koalition plant ein 'Informationsfreiheitsgesetz', das &quot;unter
  Ber&uuml;cksichtigung des Datenschutzes den B&uuml;rgerinnen und B&uuml;rgern
  Informationszugangsrechte verschaffen&quot; soll.
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="Diverses16.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
