<HTML>
<HEAD>
<TITLE>PowerUp-to-date</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerUp.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="PowerUp2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
PowerUp-to-date
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H2>PowerUp-to-date</H2>
<H3>1. Neues zur BVisionPPC / Phase 5 nicht auf der Computer '98</H3>
<P>
&raquo;19. Oktober 1998: phase 5 digital products pr&auml;sentiert nicht auf der
Computer 98
</P>
<P>
Auslieferungsplan f&uuml;r BVisionPPC-Grafikkarte
</P>
<P>
Auf der diesj&auml;hrigen Computer 98 in K&ouml;ln ist phase 5 digital products nicht
mit einer eigenen Pr&auml;sentation vertreten. Diese Entscheidung wurde in
Hinblick darauf gef&auml;llt, da&szlig; zum Zeitpunkt der Messe keine neuen Hardware-
Entwicklungen vorgestellt werden k&ouml;nnen, und da&szlig; f&uuml;r die Anwender aktuell
vor allem der Wunsch nach neuen Software-Produkten mit PowerUP-
Unterst&uuml;tzung besteht. Diese Produkte - und damit auch die aktuellen
Hardware-Produkte von phase 5 - werden von einer Vielzahl von Software-
Firmen vorgestellt oder pr&auml;sentiert; insofern sehen wir eine separate
Pr&auml;sentation der aktuellen Hardware-Produktlinie als nicht zus&auml;tzlich
informativ f&uuml;r die Anwender an. Selbstverst&auml;ndlich werden viele unserer
Partner und Fachh&auml;ndler im Amiga-Markt mit Verkaufsst&auml;nden auf der Messe
vertreten sein, und alle aktuell lieferbaren Produkte von phase 5 anbieten,
wobei bei einigen Modellen mit interessanten Angeboten gerechnet werden
kann.
</P>
<P>
Dar&uuml;ber hinaus erwarten auch wir mit Interesse weitere Neuigkeiten von
Amiga Inc. &uuml;ber die seit kurzem angek&uuml;ndigte AmigsOS 3.5-Entwicklung,
welche leider auch f&uuml;r uns nicht vor der Computer 98 verf&uuml;gbar sind. Da wir
auf diese Entwicklung keinen Einflu&szlig; nehmen bzw. an der Softwareseite nicht
beteiligt sind, k&ouml;nnen wir erst nach Festsetzung und Ver&ouml;ffentlichung aller
Einzelheiten dar&uuml;ber entscheiden, welchen zuk&uuml;nftigen Hardware-
Entwicklungen wir f&uuml;r den Amiga realisieren werden; diese werden sich nach
den Anforderungen der n&auml;chsten OS-Generation, der Kunden und der Entwickler
gleicherma&szlig;en richten.
</P>
<P>
Wir m&ouml;chten an diesem Punkt der und in einige Zuschriften angetragenen
Besorgnis mancher Amiga-Anwender entgegentreten, da&szlig; wir uns aus dem Amiga-
Markt zur&uuml;ckziehen wollten. Dies ist nicht der Fall. Unsere aktuelle
Produktlinie wird kontinuierlich produziert, und wird weiterhin verf&uuml;gbar
sein. Die Lieferzeiten f&uuml;r alle Produkte liegen &uuml;blicherweise bei zwei, in
einzelnen F&auml;llen bis etwa vier Wochen, da wir aufgrund der Modellpalette
ein Built-To-Order-Verfahren einsetzen, in dem Produkte nach Bestellung der
Fachh&auml;ndler gefertigt werden.
</P>
<P>
Aufgrund verschiedener Priorisierungen sind einzelne Projekte (speziell die
BVisionPPC) leider versp&auml;tet, werden aber definitiv realisiert und in naher
Zukunft verf&uuml;gbar. Neuentwicklungen sind wie oben bereits erl&auml;utert
zur&uuml;ckgestellt worden, bis seitens Amiga Inc. die endg&uuml;ltigen Konzepte und
eine Roadmap f&uuml;r die n&auml;chste OS-Generation f&uuml;r die aktuelle
Ger&auml;tegeneration besteht.
</P>
<P>
Die Entwicklung und der Serienstart der Grafikkarte BVisionPPC konnten in
den letzten Monaten aufgrund verschiedener Priorit&auml;ten und verteilter
Resourcen f&uuml;r diese Aufgabenbereiche noch nicht abgeschlossen werden. Die
BVisionPPC wird nach einer aktuellen Entscheidung der Gesch&auml;ftsleitung
nicht vor der Messe in K&ouml;ln ausgeliefert werden. Dieser Entschlu&szlig; wurde
nach Konsultation verschiedener Vertriebspartner bewu&szlig;t gef&auml;llt, da eine
Auslieferung des Produkts zur Messe zu folgen haben k&ouml;nnte, da&szlig; viele
Kunden ihre Vorbestellungen in der Hoffnung stornieren, auf der Messe die
Karte schneller oder g&uuml;nstiger zu erhalten; dies k&ouml;nnte bei vielen Kunden
zu Entt&auml;uschung f&uuml;hren, wenn die Karte auf der Messe nicht oder nicht in
ausreichenden Mengen verf&uuml;gbar ist, und bei den Fachh&auml;ndlern einen deutlich
erh&ouml;htem Aufwand bewirken. Daher empfehlen wir allen Interessenten, die die
BVisionPPC vorbestellt haben, ihre Vorbestellungen aufrecht zu erhalten.
Die Auslieferung der BVisionPPC wird nach aktueller Planung Ende November
erfolgen; bis dahin ist vorgesehen, auch den Preis der Karte attraktiver zu
gestalten.&laquo;
</P>
<P>
(Quelle: Phase 5 digital products)
</P>
<P>
Ein Anruf bei Phase 5 ergab zudem, dass das Unternehmen an Personalmangel
leide.
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="PowerUp.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="PowerUp2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
