<HTML>
<HEAD>
<TITLE>PowerUp-to-date</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerUp2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<A HREF="PowerUp4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15"></A>
<font color="#FFFFFF">
PowerUp-to-date
</font>
</TD></tr>
</TABLE>
<BR>
<!--------------------------------------------------->
<H3>3. &raquo;X-DVE 3.50 f&uuml;r PowerPC</H3>
<P>
ClassX und H&amp;P k&uuml;ndigen die Verf&uuml;gbarkeit von X-DVE 3.50 PPC an, eines
kompletten und professionellen Videobetittlungs- und Effekt-Pakets f&uuml;r
AmigaOS 2.1+, WarpOS, V-Lab Motion und DraCO Videosysteme.
</P>
<P>
Mit dieser innovativen Ver&ouml;ffentlichung vervollst&auml;ndigt ClassX seinen
Support f&uuml;r die komplette Motorola Prozessorreihe durch die Unterst&uuml;tzung
des schnellen PowerPC 603/604. Die Entwicklung wurde dabei speziell f&uuml;r die
WarpOS/PowerPC-L&ouml;sung von Haage&amp;Partner vorgenommen.
</P>
<P>
Spezielle Tests auf einem Amiga mit Cyberstorm 604/240MHz zeigen
eindrucksvoll eine Steigerung um den Faktor 4 gegen&uuml;ber einem 68060/50MHz.
</P>
<P>
X-DVE 3.50 bietet auch vollen RTG-Support &uuml;ber Picasso96 und CyberGraphiX-
Treiber. Dies ist besonders f&uuml;r DraCO-Besitzer interessant, da dadurch eine
phantastische Berechnungsgeschwindigkeit bei X-DVE erreicht wird und die
Ausgabe auf jeder Art von Bildschirmmodus erfolgen kann.
</P>
<P>
X-DVE 3.50 enth&auml;lt einen speziellen Operator, der die X-DVE-Ausgabe direkt
in die MovieShop-Zeitleiste integriert. Die neue Version des Operators
wurde offiziell von MacroSystems gepr&uuml;ft und freigegeben. Der Operator
bietet volle 24-Bit Ausgaben (mit Antialias) und verschiedene Modi um eine
perfekte Videoqualit&auml;t zu erreichen.
</P>
<P>
X-DVE 3.50 stellt zudem eine gro&szlig;e Bandbreite neuartiger optionaler Alpha-
Effekte bereit. Diese k&ouml;nnen zus&auml;tzlich zu bestehenden Effekten angewendet
werden. Damit kann ein Alpha-&Uuml;bergang z.B. zu einem Umbl&auml;ttereffekt oder
einem 3D-Lichteffekt hinzugef&uuml;gt werden. Die Ergebnisse sind einfach
unglaublich.
</P>
<P>
Die Alpha-Effekte k&ouml;nnen buchst&auml;blich in die X-DVE-Effektbibliothek
eingeklinkt werden, indem man sie in den entsprechenden Ordner zieht.
Nat&uuml;rlich wurde die Bedienung der Effekt sehr einfach gehalten und man mu&szlig;
nur das entsprechende ANIMATED-Icon aus einer Liste ausw&auml;hlen. Die aktuelle
Alpha-Effekt-Bibliothek enth&auml;lt bereits mehr als 80 Effekte inklusive
&Uuml;berblendungen, Zeit, Plasmas etc.
</P>
<P>
Neue Alpha-Effekte werden in K&uuml;rze erscheinen.
</P>
<P>
Mit dieser X-DVE-Version setzt ClassX einen neuen Standard im Desktop TV-
Umfeld mit einem ausgereiften, stabilen und produktiven Werkzeug f&uuml;r die
professionelle Videoerstellung.
</P>
<P>
Neuheiten gegen&uuml;ber X-DVE 3.10:
</P>
<P>
(NEU) optionale Alpha-Effekte
(NEU) Effektbibliothek mit 80 Alpha-Effekten
(NEU) PowerPC-Unterst&uuml;tzung
(NEU) 4 neue &Uuml;berblendeffekte
(NEU) verbesserter Sternenfeld-Effekt (verschiedene Formen)
(NEU) mehrere Detailverbesserungen&laquo;
</P>
<P>
(Quelle: Haage &amp; Partner)
</P>
<!--------------------------------------------------->
<P ALIGN="RIGHT">
<A HREF="PowerUp2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
<A HREF="PowerUp4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20"></A>
</P>
</BODY>
</HTML>
