<HTML>
<HEAD><TITLE>Amiga Aktuell 07/97 - HTML Version</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 07/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>
<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>
<TR>
<TD WIDTH=105></TD>

<TD WIDTH=496>
<A HREF="index.html"><IMG SRC="../gfx/ti_0.gif" ALT="Titel" BORDER=0 WIDTH=121 HEIGHT=39></A>
<A HREF="inhalt.html"><IMG SRC="../gfx/ih_0.gif" ALT="Inhalt" BORDER=0 WIDTH=121 HEIGHT=39></A>
<A HREF="intern.html"><IMG SRC="../gfx/in_1.gif" ALT="[Intern]" BORDER=0 WIDTH=121 HEIGHT=39></A>
<A HREF="news.html"><IMG SRC="../gfx/ne_0.gif" ALT="News" BORDER=0 WIDTH=120 HEIGHT=40></A>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
<A HREF="#Mitmach">Mitmachen!</A>
<BR><BR>
<A HREF="#Kontakt">Kontaktadresse</A>
<BR><BR>
<A HREF="#Vertrieb">Vertrieb</A>
<BR><BR>
<A HREF="#Copyright">Copyright</A>
<BR><BR>
<A HREF="#Gewinnspiel">Aufl&ouml;sung des Gewinnspiels</A>
<BR><BR>
<A HREF="#Neugewinn">Die neuen Fragen</A>
</TD>
<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<CENTER>
<H2>Willkommen zur neuesten Ausgabe von</H2><BR>
<H1>AMIGA aktuell</H1>
</CENTER>
<BR><H3>Eine schlechte Nachricht zuerst: Wieder wurde es bei <A HREF="http://www.phase5.de">phase 5</A>
nichts mit der Auslieferung der Cyberstorm PPC-Karten. Neuer
Termin ist Juli. Auch die anderen Boards erscheinen sp&auml;ter,
die Blizzard PPC 603e ist jetzt f&uuml;r August angek&uuml;ndigt. Da
in dem Monat jedoch erst die CE-Pr&uuml;fung f&uuml;r diese Karte
stattfindet, k&ouml;nnte es zu weiteren Verz&ouml;gerungen kommen.
Neuer Termin f&uuml;r den "gro&szlig;en Bruder", die Blizzard PPC 603e+,
ist September, die Blizzard 2604 f&uuml;r den A 2000 soll nun im
Oktober erscheinen.<P>
Durch die erneuten Verz&ouml;gerungen wird es bei Erscheinen der
Karten zwar bereits eine Reihe von PowerUp-Umsetzungen geben
- ein schwacher Trost -, nicht vergessen werden sollte
allerdings, da&szlig; insbesondere die vielen Programmierer frei
kopierbarer Software, die kein PowerUp-Developer-Board
ergattert haben, in aller Regel erst dann mit der
Entwicklung von PPC-Software beginnen (k&ouml;nnen), wenn es die
PowerUp-Hardware zu kaufen gibt.<P>
Es bleibt zu hoffen, da&szlig; wenigstens bis zum Beginn des
Weihnachtsgesch&auml;fts alle bislang angek&uuml;ndigten PPC-Karten
lieferbar sind.</H3>
<P><BR>
<H2>Nun zu drei Dingen in eigener Sache:</H2>
<OL>
<LI><H3>Trotz der Absenkung des Schwierigkeitsgrads des letzten
Gewinnspiels (zwei Fragen lie&szlig;en sich sogar anhand der
letzten bzw. vorletzten Ausgabe von AMIGA aktuell
beantworten), ist die Teilnehmerzahl weiterhin &auml;u&szlig;erst
gering.<BR>
Aus diesem Grund habe ich beschlossen, in diesem Monat einen
letzten Versuch zu machen. Sollte das von mir selbst
gesteckte Ziel bez&uuml;glich der Beteiligung auch diesmal nicht
erreicht werden, wird dies zumindest vorerst das letzte
Gewinnspiel in AMIGA aktuell gewesen sein.<P>
<LI>Unabh&auml;ngig davon wird es in der August-Ausgabe eine
Umfrage zu AMIGA aktuell geben, mit deren Hilfe ich mein
Magazin (noch) st&auml;rker auf die W&uuml;nsche der Leser ausrichten
m&ouml;chte. Ich k&uuml;ndige dies schon jetzt an, damit sich jeder
rechtzeitig darauf einrichten kann.<P>
<LI>Ab sofort kann AMIGA aktuell auch in einer HTML-Version
per E-Mail abonniert werden - nat&uuml;rlich kostenlos. F&uuml;r eine
Abo-&Auml;nderung bzw. -Einrichtung gen&uuml;gt eine Mail an mich.
Weitere Informationen dazu gibt es im Intern-Teil.<P>
</OL>
Jetzt w&uuml;nsche ich noch viel Spa&szlig; beim Lesen!
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER>

Ein gro&szlig;es Dankesch&ouml;n an alle, die mitgeholfen haben:<BR><BR>
<UL>
<LI>Harald Knoop
<LI>Matthias Gradinger
<LI>Sven Kalus
<LI>Jens Schr&ouml;der<BR>
haben mich auf der Suche nach AMIGA-Neuigkeiten unterst&uuml;tzt.</UL><BR>
<UL><LI>Frank Weber<BR>
hat mir f&uuml;r das Gewinnspiel sein brandneues Programm CDCat
zur Verf&uuml;gung gestellt.</UL><BR>
<UL><LI><A HREF="http://www.neuss.netsurf.de/~herowlin">Henning Rowlin</A><BR>
hat eine standardisierte HTML-Version von AMIGA aktuell
entwickelt, die ab sofort zum Einsatz kommt.</UL><BR>
<UL><LI>Marc Jochimsen<BR>
betreut die <A HREF="http://www.home.pages.de/~Amiga-aktuell">AMIGA-aktuell-Homepage</A> im Internet (Adresse
s.u.).</UL><BR>

<A NAME="Mitmach"></A>
AMIGA aktuell lebt von der Beteiligung der Leser, von Euch!
Wenn Ihr einen Beitrag f&uuml;r mich habt, dann z&ouml;gert nicht
lange, sondern schickt ihn mir bitte f&uuml;r eine
Ver&ouml;ffentlichung zu!<BR>
Nat&uuml;rlich bin ich auch sehr an Kritik, Anregungen, also an
Eurer Meinung zu AMIGA aktuell interessiert.<P>
Und falls jemand zu Werbezwecken einen oder mehrere Preise
f&uuml;r das AMIGA-aktuell-Gewinnspiel zur Verf&uuml;gung stellen
m&ouml;chte, habe ich auch nichts dagegen. Jeder Stifter wird
genannt, die zur Verf&uuml;gung gestellten Preise kurz
vorgestellt.<P>


Meine Adresse:

<A NAME="Kontakt"></A><PRE><ADDRESS>
               Carsten Schr&ouml;der
               Helmoltstra&szlig;e 10
               37081 G&ouml;ttingen
               E-Mail: <A HREF="mailto:CSchroe@Stud.Uni-Goettingen.de">CSchroe@Stud.Uni-Goettingen.de</A>
</PRE></ADDRESS>
Ich z&auml;hle auf Eure Unterst&uuml;tzung!</H3>
<BR><BR><BR><BR>
<A NAME="Vertrieb"></A><UL>
<BR>
<H2>Viele Wege f&uuml;hren zu AMIGA aktuell:</H2><BR>
<H3>Zur Zeit sind die Diskettenmagazine<P>
<LI>NoCover      (Herausgeber: APC&amp;TCP)
<LI>HAM          (Herausgeber: Karl-Heinz Bader)
<LI>AMIGA Flight (Herausgeber: Frank Zender)
<LI>AA           (Herausgeber: Berlin PD)
<LI>StarMag      (Herausgeber: Christian Keller)</UL><BR>
zur Ver&ouml;ffentlichung von AMIGA aktuell berechtigt.<P>
Dar&uuml;ber hinaus gibt es eine Reihe weiterer
M&ouml;glichkeiten, an AMIGA aktuell zu kommen:<P>
<BR>
<UL>
<LI><B>per Post:</B><BR>Die neueste Ausgabe kann jeweils ab Ende
des Vormonats gegen Diskette und R&uuml;ckporto direkt bei mir
angefordert werden.<P>
<LI><B>per E-Mail-Abo:</B><BR>Wer AMIGA aktuell regelm&auml;&szlig;ig bei
Erscheinen automatisch erhalten m&ouml;chte, und angeh&auml;ngte
Dateien empfangen kann, sollte mir eine entsprechende Mail
(unter Angabe der gew&uuml;nschten Version - AMIGAGuide oder
HTML) senden. Anschlie&szlig;end wird AMIGA aktuell jeweils zum
Ende eines Monats UU-kodiert und LhA-gepackt zugeschickt.
Eine Abbestellung ist nat&uuml;rlich jederzeit m&ouml;glich, Mail
gen&uuml;gt.<P>
<LI><B>&uuml;ber das Aminet:</B><BR>AMIGA aktuell ist auch im Aminet (und mit
entsprechender zeitlicher Verz&ouml;gerung auf den Aminet-CDs) zu
finden, und zwar im Verzeichnis docs/mags unter
AaktMMJJ.lha, wobei "MM" den Monat und "JJ" das Jahr
darstellt. Die Januar-Ausgabe 1997 z.B. ist unter
Aakt0197.lha zu finden.<P>
<LI><B>&Uuml;ber das WWW:</B><BR>
Auf der Homepage <A HREF="http://www.home.pages.de/~Amiga-aktuell">http://www.home.pages.de/~Amiga-aktuell</A>
sind die neueren Ausgaben von AMIGA aktuell abgelegt, nach
und nach sollen auch die &auml;lteren folgen.<P>
<LI><B>&uuml;ber die G&ouml;ttinger Mailbox Liteline</B><BR>im Verzeichnis
100-Amiga-PD/150-Serien/155-AmiAktuell<P>
<B>Die Telefonnummern:</B><BR>
0551/7701346 (USR-Courier V34+)<BR>
0551/7701356 (ELSA-Microlink 28800 TL V34)<BR>
0551/71620 (Zyxel U-1496-E+)<BR>
0551/75614 (ISDN)<BR>
0551/75615 (ISDN)<P>
<LI>per Anonymous-FTP im Verzeichnis
ftp.liteline.de/pub/amiga/docs/mags
</UL>
<BR>
In den letztgenannten Versionen sind ab und zu auch Grafiken
enthalten, die in den Diskmags keinen Platz finden.
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER>

<A NAME="Copyright"></A>AMIGA aktuell wird als Freeware herausgegeben. Die
Zusammenstellung steht unter meinem Copyright und darf
nicht ver&auml;ndert werden, f&uuml;r den Inhalt &uuml;bernommener Beitr&auml;ge
bin ich jedoch nicht verantwortlich. Ich verpflichte mich
nicht, jeden erhaltenen Text zu ver&ouml;ffentlichen.<P>
AMIGA aktuell darf von jedermann frei kopiert werden,
solange als Gegenleistung (einschl. Datentr&auml;ger) nicht mehr
als 3 DM bzw. ein vergleichbarer Betrag in einer anderen
W&auml;hrung verlangt wird. Eine Lizenz zum Kopieren ist nicht
notwendig.<P>
&Uuml;ber die Aufnahme von AMIGA aktuell in weitere Magazine, PD-
Serien, auf CD-ROMs etc. m&ouml;chte ich vorher informiert
werden. In jedem Fall m&ouml;chte ich ein kostenloses Exemplar
des Endprodukts zugeschickt bekommen.</H3>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER>
<A NAME="Gewinnspiel"></A>
<BR>
<H2>Das AMIGA-aktuell-Gewinnspiel</H2><BR>
<H3>Die Teilnehmerzahl war leider wiederum sehr unbefriedigend,
lediglich ein Leser war in der Lage, mir die richtigen
L&ouml;sungen zu den drei Fragen mitzuteilen. Sollte sich dieser
Zustand auch mit der aktuellen Ausgabe des Gewinnspiels
nicht &auml;ndern, wird es in Zukunft nichts mehr zu gewinnen
geben (siehe Vorwort).<P>
Zun&auml;chst zur Aufl&ouml;sung des Gewinnspiels in Ausgabe 6/97:<BR><BR>
<UL>
<LI><B>Mit welcher Workbench-Version ist das FastFileSystem f&uuml;r
Festplatten eingef&uuml;hrt worden?</B><P>
Die meisten Leser haben diese Frage mit "OS 2.0" - leider
falsch - beantwortet. In bezug auf Disketten ist das zwar
richtig, da sie sich erst seit dem Erscheinen dieser
Betriebssystem-Version mit dem FastFileSystem formatieren
lassen.<P>
Ich fragte jedoch ausdr&uuml;cklich - dies sollte gleichzeitig
ein kleiner Hinweis sein - nach Festplatten. Und Fakt ist:
Bereits die Workbench 1.3 enthielt die n&ouml;tige Routine, um
HardDisks mit dem FFS zu formatieren.<P>
<LI><B>Bei welchem Unternehmen und in welcher Funktion ist
Karola Bode, bis 1994 Pressesprecherin bei Commodore
Deutschland, jetzt t&auml;tig?</B><P>
Wer sich noch einmal das Special zum AMIGA-Verkauf in AMIGA
aktuell 5/97 durchgelesen hat, mu&szlig; auf die richtige Antwort
gesto&szlig;en sein. Karola Bode arbeitet bei der deutschen
Niederlassung von Gateway 2000, und zwar als
Gesch&auml;ftsf&uuml;hrerin (Begriffe wie "Chef(in)", "Leiter(in)"
usw. h&auml;tte ich selbstverst&auml;ndlich auch gelten lassen).<P>
<LI><B>Wie viele Instruktionen kann laut phase 5 ein mit 200 MHz
getakteter PowerPC604e pro Sekunde verarbeiten?</B><P>
Wem bekannt war, da&szlig; damit "nur" die Zahl der MIPS
(Millionen Instruktionen pro Sekunde) gemeint war, und
einmal in der PowerUp-Karten-&Uuml;bersicht der letzten Ausgabe
von AMIGA aktuell nachgeschaut hat, wird den gesuchten Wert
dort gefunden haben. Es sind 350 MIPS.</UL><P>
<BR>
<B>Gewonnen hat:</B><BR><BR>
1 x Vollversion von AFiloFaxPro: Sascha van Wahnem<BR><BR>
Herzlichen Gl&uuml;ckwunsch!</H3><P><BR><BR>
<A NAME="Neugewinn"></A>
<H2>Nun zum neuen R&auml;tsel:</H2><P>
<BR><H3>Freundlicherweise hat mir Frank Weber sein brandneues
Programm CDCat zur Verf&uuml;gung gestellt, das jetzt kurz
vorgestellt wird:<P>
CDCat (MUI) ist DER CD-ROM-Katalogisierer. Es eignet sich
auch besonders f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-
Beschreibungen mitber&uuml;cksichtigt werden. Im Browser k&ouml;nnen
CDs durchst&ouml;bert werden, ohne eingelegt zu sein. Auch ist
Entpacken, Texte anzeigen etc. aus CDCat heraus m&ouml;glich.<P>
Au&szlig;erdem unternehme ich einen weiteren Versuch, den von
Marco Siegel gestifteten Fujitsu-/IBM-Rucksack an den Mann
(oder die Frau) zu bringen. (Da&szlig; letztere Firma zur
PowerPC-Allianz geh&ouml;rt, sei nur am Rande erw&auml;hnt - f&uuml;r den
Fall, da&szlig; sich bislang jemand an den Firmen gest&ouml;rt hat...)
<P>Als dritten Preis stifte ich eine neue und originalverpackte
AMIGA-Plus CD-ROM 5/6-95.<P>
<B>Jetzt aber zu den neuen Fragen:</B><BR><BR>
<OL>
<LI>Nenne drei Firmen oder Programmierer, die beabsichtigen,
Software f&uuml;r die PowerUp-Karten zu schreiben bzw. dies schon
getan haben.<P>
<LI>In welcher Stadt hat AMIGA International seinen Sitz?<P>
<LI>Welche - auf anderen Plattformen l&auml;ngst erh&auml;ltliche -
Computersprache, die insbesondere im Internet Verwendung
findet, wird derzeit von zwei Firmen unabh&auml;ngig voneinander
f&uuml;r den AMIGA umgesetzt?<P>
</OL>
<BR>
Unter allen Einsendern, die mir diese drei Fragen bis zum
<B>20. Juli</B> (Einsendeschlu&szlig;) richtig beantworten (<A HREF="#Kontakt">Adresse</A> im
Intern-Teil), werden die folgenden Gewinne verlost:<P>
1 x Vollversion von CDCat (gestiftet von Frank Weber)<BR>
1 x Fujitsu-/IBM-Rucksack (gestiftet von Marco Siegel)<BR>
1 x AMIGA-Plus CD-ROM 5/6-95<BR><BR>
Wer einen der Preise bevorzugt, kann seinen Wunsch angeben
Eine Garantie, da&szlig; derjenige im Gewinnfall dann auch diesen
Preis erh&auml;lt, gibt es allerdings nicht.</H3>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER>

</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
