<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Classix 2</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><center><img src="ac1.jpg"></center></P>
<p><h1><center><font color="green">Amiga Classix 2</font></CEnter></h1></P>
<p>CD Compilations von Epic sind beileibe keine Seltenheit mehr und einige dieser Compilations waren ja auch ganz gut - die neueste Compilation tr&#228;gt den Namen &quot;Amiga Classix 2&quot; und hat mit dem schwachen Vorg&#228;nger &quot;Amiga Classix&quot; (Test in der NC 62) gl&#252;cklicherweise nur noch wenig zu tun. Insgesamt &#252;ber 270 Games, sowohl (&#228;ltere) kommerzielle als auch Shareware / Freeware Games, sind auf dieser Compilation vertreten. Ob sich der Kauf lohnt, soll dieser Test zeigen!</P>

<p><h2><center><font color="yellow">Games, Games und nochmals Games</font></CEnter></h2></P>
<p>Vorweg sollte erw&#228;hnt werden, da&#223; diese CD nicht ausschlie&#223;lich f&#252;r den Amiga gemacht wurde. Nat&#252;rlich wurde das Hauptaugenmerk auf den Amiga gelegt und die liebevolle Gestaltung mit vielen verschiedenen Glow Icons unterstreicht dies auch eindrucksvoll. Um aber noch einige weitere User zu erreichen,
 hat man zus&#228;tzlich noch einige Emulatoren f&#252;r diverse Betriebssysteme (u.a. MacOS, Windows, DOS, BeOS und Arcorn) beigelegt sowie s&#228;mtliche Spiele noch als ADF Files (Diskimages) auf die CD gepackt. Den normalen Amiga User sollte das aber nicht weiter interessieren, denn man kann s&#228;mtliche Games, die man in insgesamt 10 verschiedenen Genres einsortiert hat, direkt von der randvollen CD starten und hat sogar die M&#246;glichkeit, beim starten, da&#223; System automatisch zu degraden; dies ist leider h&#228;ufiger n&#246;tig, da nicht alle Spiele systemkonform geschrieben wurden und f&#252;r die Nutzung mit Grafik- und / oder Turbokarten vorgesehen waren. Ansonsten kann man aber immer noch seinen alten A500 vom Dachboden holen und wiederspenstige Games einfach vom ADF Format zur&#252;ck auf eine Diskette schreiben -  entsprechende Tools daf&#252;r gibt`s im Aminet (ich empfehle &quot;TransADF&quot; samt GUI Aufsatz). Wer im Besitz einer PPC Karte ist, kann nat&#252;rlich auch den UAE auf 
einem aufgemotzten Amiga laufen lassen...</P>

<p>Ebenso wie auf dem Vorg&#228;nger haben es auch die zweite CD der &quot;Amiga Classix&quot; Reihe einige Vollversionen &#228;lterer Games geschafft, die aber beileibe nicht zu den bekanntesten der Amiga Spiele History geh&#246;ren. So gibt`s hier eine kleine Liste der bekanntesten Games, wobei ich nicht garantieren kann, da&#223; ich alle &#228;lteren Vollversionen hier aufgelistet habe:</P><center><p><img src="ac3.jpg"></Center></P>

<p>Wie Ihr seht, sind einige Games recht bekannt und geh&#246;ren zu den besten, die unsere Freundinn je gesehen hat - zumindest ich glaube, da&#223; das Strategiespiel &quot;Ports Of Call&quot; zu einem der besten Vertreter dieses Genres geh&#246;rt, denn vor einigen Jahren habe ich stundenlang nur dieses eine Game gespielt und auch heute hat &quot;Ports Of Call&quot; absolut nichts von seinem Charme verloren. Das gilt nat&#252;rlich auch f&#252;r viele weitere Games, wie z.B. &quot;Beneath A Steel Sky&quot; oder auch &quot;Space M.A.X.&quot;, welches vor einiger Zeit auch schon von der Amiga Special (R.I.P) auf einer CD als Vollversion &quot;verbraten&quot; wurde. Zu den kommerziellen Games sei nur noch zu sagen, da&#223; man hier des &#246;fteren ein wenig mit den diversen Degradern spielen muss, um Games auf OS 3.5 Systeme
n mit Turbo- und Grafikkarten zum laufen zu bewegen. </P><center><p><img src="ac2.jpg"></center></P>

<p>In Sachen Freeware / PD Games hat man sich nicht einfach darauf beschr&#228;nkt, irgendwas auf die CD zu kopieren sondern bietet dem K&#228;ufer eine Auswahl an den besseren Amiga PD Games, von denen keines eingeschr&#228;nkt ist. Auf Deutsch hei&#223;t das: Beim ausprobieren erwarten Euch keine nervigen Requester, keine 1 Level Demoversionen oder nicht aktivierbare Extras. Mit von der Partie sind u.a. so illustere Games wie &quot;Blitzbombers&quot;, &quot;Alien Bash 2&quot;, &quot;Mad Bomber 2&quot; (Kult auf dem Clubtreffen 2000), &quot;Gringos&quot; und &quot;Deluxe Galaga&quot; sowie die eine oder andere Vollversion von bestimmten Sharewaregames, die, ebenso wie deutschsprachige Games, durch bestimmte Glow Icons nochmals gekennzeichnet wurden.</P>

<p>Das ist aber noch nicht alles: Die Ersteller der CD (Darkage Software, die u.a. auch den Mario Klone &quot;Tales From Heaven&quot; programmiert haben) haben sich die M&#252;he gemacht und eine HTML Datei mit allen Spielen, die auf der CD vertreten sind, anzulegen. Eingebettet in eine ansprechende HTML Datei kann man sich nochmal einen Global&#252;berblick sowie einige (wenige) Infos &#252;ber bestimmte Spiele einholen (Titel, Genre, Maker), wobei sich hier auch zu jedem Spiel ein mehr oder minder aussagekr&#228;ftiger Screenshot befindet. Und um die Sache noch sinnvoll abzurunden, gibt`s noch eine lange ASCII Guide Datei zum Thema &quot;Emulieren eines Amigas&quot;, in der u.a. auch auf den WinUAE und dessen richtige Konfiguration eingegangen wird. Das d&#252;rfte zwar f&#252;r den normalen Amiga User nicht von sonderlich gro&#223;em Interesse sein, aber f&#252;r den durchschnittlichen PC Dau, der sich mit WinUAE rum&#228;rgern darf, ist das sicherlich eine sinnvolle Hilfestellung, auch wenn dieser Emulator niemals einen Original Amiga ersetzen kann!</P>
<center><p><img src="ac4.jpg"></center></P>
<p><h1><center><font color="red">Fazit</font></CEnter></h1></P>
<p>Die &quot;Amiga Classix 2&quot; CD ist im gro&#223;en und ganzen eine runde Sache geworden und kann sowohl durch eine gelungene Zusammenstelung als auch liebevolle Umsetzung (Glow Icons, HTML Datei, Degrader etc.) begeistern. Zwar sind alle Spiele &#228;lteren Datums und heute absolut nicht mehr zeitgem&#228;&#223;, aber wer sich daran und an dem zugegebenerma&#223;en etwas hohen Preis von 59 DM (wobei man die zahlreichen Vollversionen in diesem Zusammenhang nicht vergessen darf!) nicht st&#246;ren l&#228;sst, der erh&#228;lt eine gelungene Compilation, die f&#252;r viele vergn&#252;gliche (Nostalgie) Stunden vor dem heimischen Amiga sorgen wird. Good Job!</P><p><br>

<CENTEr>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>59 DM</TD>
</TR>
<TR>
<TD>Art</TD>
<TD>Spiele Compilation</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>640</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE></P><br>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
