<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Arena CD Test</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Amiga Arena CD</font></center></h1></P>
<p>Schon seit einigen Jahren ist der Amiga Sharewaremarkt, bedingt durch die quantitative Ausd&#252;nnung des kommerziellen Softwaremarktes, eines der wichtigsten Standbeine des Amigas und hat im Laufe der Jahre schon so manche Softwareperle hervorgebracht. Unterst&#252;tzt wird der Sharewaremarkt von vielen Organisationen, wobei eine davon die Amiga Arena ist, die seit mehr als zwei Jahren in diesem Bereich t&#228;tig ist und in regelm&#228;&#223;igen Abst&#228;nden mit Sonderpreisaktionen f&#252;r bestimmte Produkte aufwarten kann. Vor kurzem ist die erste CD der Amiga Arena erschienen, die auch Usern ohne Internet Zugang die Amiga Arena n&#228;her bringen soll - ob es gelungen ist, soll dieser Test zeigen.
</p>

<p><h2><center><font color="yellow">Was ist drauf?</Font></h2></center></P>
<p>Die Amiga Arena CD ist mit knapp 400 MB zu fast zwei dritteln gef&#252;llt und wurde komplett im New Icons Stil gehalten und ist recht spartanisch aufgemacht: Neben einem ASCII Hinweis Text erwarten den K&#228;ufer nur noch 6 Schubladen  mit verschiedenen Titeln, auf die ich im folgenden kurz eingehen werde.</P>


<p><b>Amiga Arena:</B><BR>
Hier befindet sich die, &#252;brigens gut gemachte, Homepage der Amiga Arena sowohl in der Online- als auch Offline Version, so da&#223; auch User ohne Internetzugang sich die Seite, die mitlerweile nat&#252;rlich wieder veraltet ist, mal anschauen k&#246;nnen. Zus&#228;tzlich haben die Herausgeber noch eine ganze Reihe an weiteren Homepages von diversen Amiga Programmen, die auf dieser CD vertreten sind, auf die CD gepackt. Insgesamt 125 MB an Daten belegen die gesamten Homepages schon alleine, die aber durchweg recht gelungen sind und die einen recht lange vor dem Amiga fesseln k&#246;nnen. Zwar merkt man teilweise, da&#223; hier nicht immer kommerzielle Firmen hinterstecken, aber daf&#252;r verbreiten viele Pages das typische Amiga Flair, wobei ich hier insbesondere die &quot;Assampler&quot; Homepage mit vielen interessanten Texten empfehlen kann. Um aber zur&#252;ck zur Amiga Arena zu kommen: Nat&#252;rlich kann man sich hier auch gleich &#252;ber die Amiga Arena ausf&#252;hrlich informieren sowie sich eine 
&#220;bersicht &#252;ber verbilligte Programme anschauen, die zudem in verschiedene Genres (Spiele, System Tools etc.) eingeteilt wurden.</P><p><center><img src="ama1.jpg"></center></P>

<p><b>Texte:</B><BR>
Neben einem Vorwort (hier merkt man deutlich, mit welchem Enthusiasmus der Herausgeber vorgegangen ist - thanx!) gibt`s hier noch einen Datei mit einer Dankesliste sowie den &#252;blichen rechtlichen Kram und den kompletten CD Inhalt in diversen Listen (sortiert nach Vollversionen, Sonderpreisen, Demoversionen etc.). Zwar ist die Aufmachung als ASCII Datei alles andere als zeitgem&#228;&#223; (ein HTML Dokument h&#228;tte mir wesentlich besser gefallen - aber wir wollen mal nicht p&#228;pstlicher als der Pabst sein), reicht aber f&#252;r einen groben &#220;berblich allemal aus. </P>

<p><b>Browser:</B><BR>
Um sich die Amiga Arena offline &#252;berhaupt angucken zu k&#246;nnen, ben&#246;tigt man nat&#252;rlich einen Browser und diesen findet man in diesem Ordner in Form von &quot;AWeb&quot; (der als SE Version auch dem OS 3.5 Paket beilag). Wer also immer noch keinen Browser installiert hat (obwohl jeder, der diese Zeilen lie&#223;t, dies zweifelsohne hat :-)), der wird hier f&#252;ndig. Wobei man hier aber konsequenterweise auch gleich noch Demoversionen von IBrowse und Voyager h&#228;tte reinpacken k&#246;nnen; Platz w&#228;re schlie&#223;lich noch dagewesen.</P>

<p><b>Programme:</B><BR>
Dieser Ordner ist nochmals in drei Unterordner unterteilt, wobei sowohl die zahlreichen &quot;Demoversionen&quot; (u.a. von Homeland,  FX-Paint, FDA, PhotoFolio, ADM, Bonds etc.) als auch die sog. &quot;Vollversionen&quot;, bei denen es sich lediglich um freie, nicht eingeschr&#228;nkte Software handelt (u.a.&quot;Madhouse&quot;, &quot;Show Amiga 96&quot;, &quot;Scalos&quot;, &quot;Amiga AMP&quot;, &quot;Convertor&quot;, &quot;Amiga World&quot; etc.), auch komplett im Aminet zu finden sind und insofern nichts anderes als eine Auswahl an zugegebenerma&#223;en recht guter PD Soft darstellen. Deswegen lasse ich diese beiden Unterordner einfach mal links liegen und widme mich stattdessen lieber dem Ordner &quot;Sonderpreise&quot;: Hier hat es der Herausgeber geschafft, einige qualitativ hochwertige Sharewareprogramme aus verschiedenen Bereichen zu verg&#252;nstigten Preisen, die nur gelten, wenn man im Besitz dieser CD ist, zusammenzustellen. Hier eine Liste der Programme mit Genreangabe:</P><center><p>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Sonderpreise</B></H2></CAPTION><TR>
</TR><TR>
<TD>CD Cat</TD>
<TD>Datenbank</TD>
</TR>
<TR>
<TD>Fiasco</TD>
<TD>Datenbank</TD>
</TR>
<TR>
<TD>Geo World</TD>
<TD>Geographieprogramm</TD>
</TR>
<TR>
<TD>Greatkartei</TD>
<TD>Datenbank</TD>
</TR>
<TR>
<TD>Home Banking</TD>
<TD>Home Banking für Multiterm Kit</TD>
</TR>
<TR>
<TD>MUIBase</TD>
<TD>Datenbank</TD>
</TR>
<TR>
<TD>MusicMan III</TD>
<TD>Datenbank</TD>
</TR>
<TR>
<TD>News Coaster</TD>
<TD>Newsreader</TD>
</TR>
<TR>
<TD>Photo Album / Cybershow</TD>
<TD>Bildkatalogisierer / Bildanzeiger</TD>
</TR>
<TR>
<TD>WHDLoad</TD>
<TD>Installer für Spiele</TD>
</TR>
</TABLE></P></center><BR>

<p>Wie man sehen kann, handelt es sich durchweg um bekannte Software, die es wert ist, unterst&#252;tzt zu werden. Falls man Interesse an der Vollversion eines der Programme hat, kann man sich gleich das entsprechende Registrier Formular, welche allesamt im Ordner &quot;Reg. Formulare&quot; zu finden sind, ausdrucken und abschicken - ein netter Service, den sicherlich einige in Anspruch nehmen werden.</P>  

<p><b>Programme gepackt:</B><BR>
Tja, hier findet man s&#228;mtliche entpackten Programme (sieh oben) nochmal als gepackte LHA &#196;quivalente wieder, wobei ich den Sinn dieser Aktion nicht ganz verstanden habe. Den somit verschwendeten Platz h&#228;tte man sinnvoller (z.B. mit der einen oder anderen weiteren Homepage) nutzen k&#246;nnen und weiterhin relativiert sich somit nochmal der Datenmenge von 400 MB - immerhin sind somit viele Sachen doppelt auf der CD vorhanden.</P>

<p><b>Packer:</B><BR>
Damit die gepackten Archive auch gleich entpackt werden k&#246;nnen, hat man hier nochmals die wichtigsten Packer, ebenfalls entpackt und gepackt (man, was f&#252;r ein Satz...), zusammengestellt. Wer also LHA, LZX und Co. immer noch nicht auf der heimischen Platte hat, der wird hier f&#252;ndig. Zus&#228;tzlich hat man noch f&#252;r all jene, die das CLI verabscheuen, noch die praktische Oberfl&#228;che &quot;Packmaster&quot; beigelegt, wobei ich sagen muss, da&#223; dieses Tool in der aktuellen Version 1.27 wirklich sehr n&#252;tzlich ist und zudem einfach zu bedienen ist - sollte jeder mal ausprobiert haben. </P><p><center><img src="ama2.jpg"></center></P>

<p><h2><center><font color="red">Fazit</Font></h2></center></P>

<p>Die Amiga Arena CD ist mit dem Hauptaugenmerk auf Qualit&#228;t zusammengestellt worden und bietet wirklich zahlreiche Softwareperlen aus dem PD / Sharewaremarkt und keine &#252;berfl&#252;ssigen F&#252;llprogramme. Das Problem an der Sache ist nur, da&#223; alle Programme auch im Aminet (und somit zwangsweise auch auf vielen weiteren CD`s) zu finden sind und diese Compilation insofern nicht wirklich etwas neues bietet. Aufgewertet wird die CD einerseits durch die vielen Homepages und anderseits nat&#252;rlich durch die Sonderpreis Aktion. Sollte man also Interesse an einem oder mehreren der in der Tabelle aufgef&#252;hrten Programme haben, kann man sich den Kauf, der mit knapp 30 DM zu Buche schl&#228;gt, ja mal &#252;berlegen - ansonsten empfehle ich, weiterhin auf die Aminet CD`s zu setzen, denn 30 DM f&#252;r diese CD dann noch auszugeben, macht wenig Sinn. </P><center>
<p><TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>APC & TCP</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>rund 30 DM</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>Amiga Arena Material (HP`s, ausgesuchte Tools etc.)</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>384 MB</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>60 %</TD>
</TR>
</TABLE>
</P><BR>




<p><CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
