<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Digital Make Up CD-Die zweite...</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Digital Make Up CD</font></h1></Center></P>
<p>In der vorletzten NC hatte der gute Yonder die &quot;Digital Make Up&quot; CD aus dem Hause APC &amp; TCP ja schon ausf&#252;hrlich vorgestellt, so da&#223; ich diesen Job jetzt nicht nochmal wiederholen brauche. Stattdessen gibt es hier von mir meinen pers&#246;nlichen Eindruck von der CD - also praktisch ein &#252;berlanges Fazit, wobei ich gleich dazu sagen muss, da&#223; ich Yonder in vielen Punkten zustimme.  </P>

<p><h1><center><font color="yellow">Mein pers&#246;nlicher Eindruck</font></h1></Center></P>
<p>Zuerst muss man einmal festhalten, da&#223; die CD mit 620 MB bis zum Anschlag gef&#252;llt ist und somit schonmal datentechnisch (!) einen realen Gegenwert f&#252;r`s Geld bietet. Zwar hat die Vergangenheit (z.B.Amiga Plus CD`s vor einiger Zeit) gezeigt, da&#223; randvolle CD`s nicht gleichzeitig auch immer gut sein m&#252;ssen, aber immerhin ist eine volle CD schonmal besser als eine halbleere. Ebenfalls positiv f&#228;llt auf, da&#223; man bei der Erstellung der CD konsequent auf die Glow Icons gesetzt hat, was die CD zumindest schonmal in einem attraktiven Gewand erscheinen l&#228;sst, wozu auch eine kleine Multimediashow beim Einrichten der CD beitr&#228;gt. </P>

<p>Wesentlich wichtiger aber als eine sch&#246;ne &quot;Verpackung&quot; ist aber der Inhalt und hier muss ich mich Yonder anschlie&#223;en: Bei der &quot;Digital Make Up&quot; handelt es sich um eine CD mit viel Standard Software, die lediglich f&#252;r Einsteiger interessant sein d&#252;rfte. Das einzigste Problem an der Sache ist nur, da&#223; es im Amiga Markt momentan mehr Au&#223;- als Einsteiger gibt und die CD somit nur einen verschwindend geringen Prozentanteil der User anspricht.  Zwar muss man dem CD Zusammensteller zugute halten, da&#223; er alle wichtigen Tools / Programme auf die CD kopiert hat und diese zudem noch in passende Schubladen sortiert hat, aber da&#223; eben jene Tools ohnehin auf jedem halbwegs aktuellen Amiga installiert sind - als Beispiele seien hier nur RTG, AHI, ReORG oder ModePro genannt - darf man auch nicht vergessen. Hinzu kommt noch viel Soundmaterial schwankender Qualit&#228;t sowie eine Reihe von Bildern, wobei vor allem die zahlreichen Bootpics recht interessant sind. Hierzu muss man aber auch 
gleich sagen, da&#223; es oftmals nicht das einfachste ist, aus der Masse an Bildern das passende herauszufinden - hier w&#228;re ein vorangefertigter Picture Manager oder Photo Folio Katalog bzw. ein HTML Dokument mit entsprechenden Thumbnail Versionen der Bilder sicherlich sehr hilfreich gewesen. Letzteren h&#228;tte man &#252;brigens recht einfach mit dem Tool &quot;FX-Paint&quot; anfertigen k&#246;nnen...</P>

<p>Was bisher hingegen noch recht selten auf einer CD vorhanden war und sich auf der &quot;Digital Make Up&quot; CD befindet, sind die besten Workbench Games aus vielen unterschiedlichen Genres, die perfekt dazu geeignet sind, zwischendurch (wenn man z.B. den einen oder anderen NC Test schreiben muss :-)) einfach mal abzuschalten und sich etwas zu erholen. Und da die Games ohnehin nicht sehr gro&#223; sind, kann man davon immer welche auf der Platte haben. Insbesondere Snakes, welches vielen wohl vom Handy (..) bekannt sein d&#252;rfte, hat es mir in diesem Bereich richtig angetan. Diese sind aber allesamt, &#228;hnlich wie die Tools, im Aminet zu finden und k&#246;nnen auch von dort bezogen werden. </P>

Tja, &#252;ber den weiteren Inhalt der CD brauche ich wohl nicht mehr viele Worte verlieren, denn im ersten Abschnitt habe ich dazu wohl alles wichtige gesagt und wer tats&#228;chlich noch Details zu &quot;Digital Make Up&quot; braucht, dem sei Yonders Artikel in der NC 76 an`s Herz gelegt. Und was das Fazit angeht: Diese CD braucht wirklich kaum jemand, der regelm&#228;&#223;ig die Aminet CD`s, Future CD`s oder Amiga Plus CD`s kauft, denn 99 % aller Software befindet sich auch auf diesen Compilations. Zwar merkt man &#252;berdeutlich, da&#223; sich der Herausgebener M&#252;he gegeben hat, aber alleine schon das Konzept, eine CD f&#252;r Einsteiger herauszubringen, war von Anfang an zum scheitern verurteilt. Insofern darf auch bezweifelt werden, da&#223; sich viele User diese CD f&#252;r knapp 30 DM zulegen. Ich w&#252;rde es auf jeden Fall nicht tun...</P>
<p><center><img src="dmku1.jpg"></Center></P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
