<html>
<head>
<!--  Autor = Wolf Zimmer   -->
<title>Fernsehen</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<br>

<p align="center"><font color="#000080" size="7">
<b>Fernsehen - meine Antwort</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr><td>
<p>Kilian, es ist ganz sch&#246;n schlau, solch ein provokantes Thema zur
Er&#246;ffnung einer Diskussionsrunde heranzuziehen. Hoffentlich bekommst
du viele Antworten und diese werden selbstverst&#228;ndlich je
Gem&#252;tslage und Wissensstand mit vielen emotionsvollen
Wortsch&#246;pfungen dargebracht werden. Obwohl ich pers&#246;nlich nicht
so schnell auf fahrende Z&#252;ge aufspringe, hatte ich beim Lesen sofort
das Bed&#252;rfnis, dir zu antworten. Und eines m&#246;chte ich dabei
betonen, meine Zeilen m&#252;ssen mit den tats&#228;chlichen Gegebenheiten
nicht &#252;bereinstimmen, sie sind meine pers&#246;nliche
Betrachtungsweise. </p>

<p>Pers&#246;nlich hatte ich mir erst einen Fernseher zugelegt, als die
Olympiade in M&#252;nchen anstand, also 1972 (da war ich 32 Jahre alt).
Schon damals wurde immer gesagt, Fernsehen verdummt, wozu also die
Flimmerkiste erst anmachen. Das Familienleben ist weg, keiner macht mehr
Hausmusik und das Gespr&#228;ch untereinander und vor allem miteinander ist
auch verstummt. Die Realit&#228;t sah nicht ganz so schlimm aus. Aber auch
damals wurde ganz genau erkannt, welches wirksame Medium zur Meinungsmache
das Fernsehen ist. Als Helmut Schmitt noch Bundeskanzler war und von einer
Reise zur&#252;ckgekehrt von Journalisten umlagert interviewt werden
sollte, schaute er erst auf die Uhr, um festzustellen, welche
Nachrichtensendung bei ARD oder ZDF als n&#228;chste anstand. Und dieser
Kamera wandte er sich zu. Dann kam H&#246;rfunk, aber da schaute er ganz
genau auf die Mikrofone, um festzustellen, wo ist die aktuelle Schaubude
des NDR und wo ist WDR2 (SPD-freundlich gesinnte Moderatoren). Erst wenn
der H&#246;rfunk komplett abgehandelt war, kam die schreibende Zunft, wie
WAZ, SZ, dann FAZ und anschlie&#223;end erst die etwas schwarze Presse wie
Merkur. Bl&#228;tter des Springerkonzerns kamen ganz am Ende, wenn
&#252;berhaupt noch Zeit war. Dieses Prinzip der Meinungsmache hat auch
heute noch volle G&#252;ltigkeit, nur durch die Vielfalt der derzeitigen
Sender kommt sehr gravierend der pekun&#228;re Aspekt hinzu. Und solange
alle glauben nur die Einschaltquoten und die damit verbundenen geschalteten
Werbesendungen finanzieren das Ganze, solange wird das gesendet, was eine
hohe Einschaltquote garantiert. Und hier kommt das Wesen Mensch zum Tragen,
nicht das Inviduum Mensch. Der Mensch im Allgemeinen ist ein Voyeur und
dieses Ph&#228;nomen wird gnadenlos ausgenutzt und der Verstand bleibt auf
der Strecke. </p>

<p>Nun will ich noch ein kleines Beispiel anf&#252;gen, das belegt, dass
seichte Sendungen nicht nur verbl&#246;den sondern auch reinigen
k&#246;nnen. Zu meinem etwas weitl&#228;ufigen Familienkreis geh&#246;rt
ein junger Professor, der ein anerkannter Wirtschaftsfachmann ist und schon
11 Fachb&#252;cher ver&#246;ffentlicht hat. Wenn dieser Mann nachdenken
m&#246;chte, h&#228;ngt er sich beispielsweise eine Sch&#252;rze um und
beginnt in der K&#252;che etwas zu kochen. In der Sch&#252;rzentasche ist
immer ein Comic-Heft wie Asterix, MickyMouse oder &#228;hnliches. Und
sobald er eine kleine Pause hat, holt er das Heft hervor und liest, bzw.
schaut Bilder. Er nennt diese Phase die Reinigungsphase. Anschlie&#223;end
kehrt er zum Laptop zur&#252;ck und denkt in die Tasten, wie er sich
auszudr&#252;cken beliebt. Mit diesem Beispiel wollte ich nur sagen, dass
auch seichte Sendungen eine geistige Reinigung bewirken k&#246;nnen,
solange man sich nicht mit dem Gesehenen identifiziere. Das w&#228;re der
Umkehrschluss und dann kommt deine Meinung voll zur Geltung. </p>

<p>Kilian, dies war ein kleiner Exkurs zu deinem Thema: Fernsehen. </p>

</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
