<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Joyride Tests</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="yellow">Joyride</Font></center></h1></P>
<p>Ein Preview zu diesem neuen Autorennen aus dem Hause Titan Computer (u.a. &quot;Heretic II&quot;, &quot;Shogo&quot;, &quot;Burn It&quot;) war schon vor einiger Zeit zu lesen, aber der angepeilte Termin wurde immer wieder nach hinten verschoben. Jetzt endlich ist dieses Rennspiel erh&#228;ltlich und wer schon immer mal richtig Gummi geben wollte, dabei aber nicht auf Klassiker wie &quot;Lotus&quot; zur&#252;ckgreifen will, der sollte unbedingt weiterlesen. Denn ob &quot;Joyride&quot; wirklich Spa&#223; macht, werden folgende Zeilen kl&#228;ren m&#252;ssen...</P>

<p><h2><center><font color="green">Mal wieder einige Dinge vorweg</Font></center></h1></P>
<p>Heutige Amiga Games tendieren auch immer mehr dazu, h&#246;here Anforderungen an die vorhandene Hardware zu stellen und da macht Joyride (gl&#252;cklicherweise) auch keine Ausnahme, auch wenn die Anforderungen f&#252;r den heutigen Amiga User eigentlich erf&#252;llbar sein m&#252;ssten: </P>

<p><u>Minimum:</U><BR><ul>
<li> 68030 <BR>
<li> 16 MB Ram<BR>
<li> AGA<BR>
<li> CD Rom Laufwerk<BR>
<li> Festplatte</P></ul>

<p><u>Empfohlen:</U><br><UL>
<li> 68040 / 060<BR>
<li> 20 MB Ram<BR>
<li> Grafikkarte<BR>
<li> 6X CD Rom<BR>
<li> 100 MB Festplattenplatz</P></ul>

<p>Um die Sache zu komplettieren sei an dieser Stelle noch erw&#228;hnt, da&#223; Picasso96 User zwingend OS 3.1 als Betriebsystem verwenden m&#252;ssen und CyberGFX Betreiber mindestens Version 3.0 eben dieses Grafikkarten-Systems installieren m&#252;ssen. Damit w&#228;re dann auch gleich die Frage gekl&#228;rt, ob &quot;Joyride&quot; auf Grafikkarten l&#228;uft, wobei Besitzer einer Grafikkarte lediglich in den Genuss eines fl&#252;ssigeren Spielablaufs kommen. Als Aufl&#246;sung wird nur ein l&#228;cherliches 320 X 240 geboten, was im Jahre 2000, auch mit einem Blick auf den PC Spielemarkt, einfach indiskutabel ist.</P><p><center><img src="jr1.jpg"></Center></P>

<p>Als Entsch&#228;digung befindet sich auf der CD noch ein astreiner CDDA Soundtrack (10 Titel), der zumindest die gute Absicht des Herausgebers unterstreicht, in dessen Genuss man allerdings nur kommt, wenn man den eigenen Amiga entweder an eine Stereoanlage angeschlossen hat oder einen Audiomixer sein eigen nennt - letzteren bekommt man u.a. bei KDH Datentechnik. Der Vollst&#228;ndigkeit halber sei erw&#228;hnt, da&#223; die Installation (mal wieder mit dem bekannten &quot;Installer&quot;) anstandslos verlief und keinen Grund zur Kritik lieferte - ganz im Gegensatz zur &#228;u&#223;erst schwachen (deutschsprachigen) Amiga Guide Datei, die als Ersatz f&#252;r ein nicht vorhandenes Handbuch auf der CD mitgeliefert wird. Hier wird n&#228;mlich nur &#228;u&#223;erst knapp auf das wichtigste eingegangen 
und auch optisch macht dieses Dokument recht wenig her. Da wundert es wohl keinen mehr, wenn ich verrate, da&#223; &quot;Joyride&quot; auf einem selbst gebrannten Rohling daherkommt....</P>


<p><h2><center><font color="red">Ich geb Gas - ich will Spa&#223; </Font></center></h1></P>
<p>Nach diesem ganzen Vorgepl&#228;nkel ist nat&#252;rlich das Spiel an sich viel wichtiger und sollte letztendlich &#252;ber die Qualit&#228;t von Joyride entscheiden. So reicht ein Blick auf das gut gemachte, komplett gerenderte Intro sowie die liebevoll gestalteten Men&#252;s aus um klarzustellen, da&#223; hier keine Anf&#228;nger am Werke waren. Bevor es an`s eigentliche Rennen gehen kann, m&#252;ssen zun&#228;chst noch einige Einstellungen getroffen werden: Neben dem Schwierigkeitsgrad kann noch der Controller (Joystick oder Tastatur), die Beschleunigungsart, die Anzahl der Spieler sowie die Gangstellung eingestellt werden. Ferner k&#246;nnen 68040 / 60 Brenutzer hier eine optimierte Version f&#252;r ihre CPU w&#228;hlen. Jetzt kann`s aber endlich an`s eingemachte gehen:</P>


<p>Wie oben schon erw&#228;hnt, macht sich zun&#228;chst die verschwindend geringe Aufl&#246;sung von 320 X 240 bemerkbar, die nat&#252;rlich f&#252;r das eine oder andere Manko in Sachen Grafik sorgt, die ansonsten gar nicht mal so schlecht ist: Alles ist gerendert und auch die Landschaft macht einiges her, wie man unschwer auf den Screenshots erkennen kann. So gibt`s z.B. mal Amiga Werbetafeln in der Landschaft zu bestaunen und auch auf den Fahrtstrecke bleibt nicht immer alles gleich, da hier und da durchaus auch mal Wasser, dem man besser ausweichen sollte, auftauchen kann.  Aprospos Landschaften: Es gibt insgesamt 10 verschiedene Rennstrecken und Landschaften, die das ganze etwas auflockern sollen - ebenso stehen 6 verschiedene Autotypen mit individueller Fahrphysik zur Verf&#252;gung. F&#252;r Abwechselung in diesem Bereich ist also auf jeden Fall gesorgt.</P>

<p>Das Spiel an sich ist sicherlich als grundsolide zu bezeichnen und wenn man sich erstmal an die Steuerrung gew&#246;hnt hat, kommt man recht schnell mit Joyride zurecht. Im Test ist allerdings negativ aufgefallen, da&#223; die Steuerrung an der einen oder anderen Stelle durchaus mal &quot;haaken&quot; kann, was insbesondere in ernsten Situationen recht unpassend ist. Um Euch aber zu beruhigen: So oft kam es nun wirklcih nicht vor und der Spielspa&#223;, der anfangs durchaus aufkam, wurde dadurch nun wirklich nicht wesentlich beeinflusst. Positiv bemerkbar konnte sich zudem der Sound machen, der das Rennspiel sinnvoll abrundet und vollkommen zu gefallen wei&#223;. </P>

<p>Das h&#246;rt sich bisher auch alles recht gut an, aber der eigentliche Knackpunkt von &quot;Joyride&quot; liegt in der mangelnden Langzeitmotivation: Sicherlich hat man versucht, da&#223; Spiel m&#246;glichst abwechselungsreich zu gestalten, aber schon nach einigen Stunden wurde &quot;Joyride&quot; recht schnell langweilig, da es einfach an &#220;berraschungen mangelte und das Spiel sehr eindimensional weiter verlief - da hatten &#228;ltere Klassiker, die einen stundenlang vor dem Rechner fesselten, teilweise etwas mehr auf dem Kasten. Vielleicht liegt es aber auch einfach daran, da&#223; ich nicht unbedingt der gro&#223;e Autorennfan bin und dementsprechend anders als ein Fan dieses Genre an die Sache rangegangen bin. </P><p><center><img src="jr2.jpg"></Center></P>

<p><h1><center><font color="white">Fazit</Font></center></h1></P>
<p>Insgesamt ist &quot;Joyride&quot; ein Produkt, welches mit ziemlicher Sicherheit nicht zu den Highlights im Amiga Spielemarkt geh&#246;rt, sich aber gleichfalls wohlwollend von einigen peinlichen Ver&#246;ffentlichungen in der Vergangenheit abhebt. Neben leichten technischen Unzul&#228;ssigkeiten (Aufl&#246;sung, Steuerrung) ist vor allem die Langzeitmotivation ein Problem dieses Produkts - Pluspunkte kann &quot;Joyride&quot; durch die insgesamt zufriedenstellende Grafik sowie den guten Sound sammeln. Bleibt unter dem Strich ein etwas zwiesp&#228;ltiger Eindruck &#252;brig, der zudem noch dadurch best&#228;rkt wird, da&#223; der Spa&#223; 70 Ocken kostet - 
ich w&#252;rde einfach mal sagen, da&#223; Fan dieses Genres sich &quot;Joyride&quot; zulegen k&#246;nnen; alle anderen sollten zun&#228;chst die Demo Version antesten und dann entscheiden, ob sie sich &quot;Joyride&quot; zulegen. </P>
<p>
<CENTEr>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Titan Computer</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>69 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Autorennen</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>231</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>65 %</TD>
</TR>
</TABLE></P><br>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
