<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<p><h1><center><font color="green">Leserbrief von Kilian Servais</font></center></h1></P>
<p><ul>
<li><a href="#rene.html">An Rene</A><BR></LI>
<li><a href="#wolf.html">An Wolf Zimmer</A><BR></LI>
<li><a href="#weber.html">An Thomas Weber</A><BR></LI>
<li><a href="#top.html">Top 5</A></LI></UL></P>
<hr>
<a name="rene.html">
<p><b>Hi Rene!</B><br>
Erstmal mein Kompliment zu Deinen vielen Artikeln in der letzten NC. Hast Dich ja wirklich richtig in`s Zeug gelegt - wenn Du so weiter machst, kann ich mich ja bald zur Ruhe setzen. Aber da ich in Zukunft ohnehin ein wenig k&#252;rzer treten muss (Abitur etc.), ist mit dir ja jetzt passender Ersatz da :-)))</P>

<p>Was Deinen Comment bezgl. der A+ angeht: Irgendwie muss die Zeitschrift ja auch am Kiosk ankommen, oder? Und das dauert ja auch so seine Zeit. Was ich sagen will: An der Post liegt es mit Sicherheit nicht - Schuld hat einzig und alleine der liebe Falke Verlag, der ja jetzt zu allem &#220;berfluss auch noch die Amiga Future abgestossen hat. Meine Meinung &#252;ber den Verlag kennst du ja mitlerweile und es sieht wohl nicht so aus, als ob ich diese nochmal &#228;ndern w&#252;rde....</P>

<p>Was die NC Classix angeht: Bei mir liegt es momentan an mangelnder Zeit, diese Rubrik regelm&#228;&#223;ig umzusetzen. Nat&#252;rlich wird es irgendwann von mir noch einen Beitrag dazu geben, aber eben nicht jetzt. Deinen Ansatz fand ich auch ganz gut und ich w&#252;rde mich freuen, wenn Du damit weiter machen w&#252;rdest. Allerdings f&#228;nde ich es besser, wenn Du mit Deinen NC Classics ab der NC 50 (Umstellung nach HTML) anfangen w&#252;rdest. F&#228;nde ich zumindest interessanter...</P>

<p>See ya!</P>
<hr>
<a name="wolf.html">
<p><b>Hallo Wolf!</B><BR>
Auch wenn wir uns per E-Mail st&#228;ndig unterhalten, wollte ich auf Deinen Leserbrief in der letzten NC lieber an dieser Stelle eingehen - positiver Nebeneffekt ist, da&#223; die NC mal wieder etwas voller wird...</P>

<p>Tja, momentan kann ich f&#252;r die NC leider nur sehr bedingt Zeit aufbringen, da ich einfach nur noch im Stress stecke und obendrein jetzt auch noch die Schule wieder angefangen hat. Und da ich mir es nicht leisten kann, mein Abitur in den Sand zu setzen, muss ich schon jetzt daf&#252;r sorgen, da&#223; die Noten am Anfang meines letzten Schuljahrs &#252;berhaupt stimmen. Insofern darfst Du Dich nicht wundern, wenn in den n&#228;chsten NC`s weniger von meiner Seite zu lesen ist.</P>

<p>Was Deinen Absatz zum Thema &quot;Art Effect&quot; angeht: Nat&#252;trlich aktzeptiere ich Deine Einstellung diesbezgl. und wollte Dich auch keineswegs dazu n&#246;tigen, einen halbgaren Artikel &#252;ber dieses Programm zu schreiben. Ich dachte nur, da&#223; ein kleiner Bericht von dir dar&#252;ber ganz interessant w&#228;re, aber da ich selber wei&#223;, wie schwer es ist, einen guten Artikel &#252;ber ein solch komplexes Programm zu schreiben, verstehe ich Deinen Einwand nat&#252;rlich. Vielleicht kommt ein Artikel in Zukunft ja trotzdem noch....</P>

<p>Alles weitere dann per E-Mail!</P>

<p>See ya!</P><hr>
<a name="weber.html">
<p><b>Sei gegr&#252;&#223;t Thomas!</B><BR>
<p>Ersteinmal vielen Dank f&#252;r Deinen Eintrag im G&#228;stebuch auf unserer Homepage - finde ich wirklich nett, da&#223; zumindest mal einer aus der NC vorbeigeguckt hat. Offensichtlich lie&#223;t Du ja dann doch die Metal Corner :-)) </P>

<p>Tja, und auch ich lese die Comics in der NC und da ist mir in der letzten Ausgabe nat&#252;rlich Dein Comment bezgl. des &quot;Rades&quot; aufgefallen. Insiderwitze sind immer gut und ich bin schon echt gespannt, was f&#252;r ein Spielprinzip noch stumpfsinniger sein kann als &quot;Mad Bomber II&quot; - bleibt ja nur noch &quot;Backtooth Bob&quot; &#252;brig. Wie gesagt: Ich freue mich jetzt schon total auf die n&#228;chste NC und hoffe, da&#223; Du weiterhin uns mit den monatlichen Comics sowie PD Tests bereicherst.
</P>
<p>Bis dann!</P>
<hr>
<a name="top.html">
<p><h1><center><font color="yellow">Top 5</font></center></h1></P>

<p>1. E-Mail von Wolf Zimmer<br>
2. Supporter von Cord Hagen<br>
3.Treffen Vellmar von Annemie &amp; G&#252;nther<br>
4. Ork Attack von Thomas Weber<br>
5. NC Classix von Rene</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
