<html>
<head>
<!--  "author"="Wolf Zimmer"  -->
<title>Sch&#252;ler im Internet</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>
Wenn Frame noch vorhanden, dann bitte hier <a href="st_schueler.html"
target="_top"> <b> klicken </a></b>, oder auch nicht, dann bleibt der linke
Frame erhalten, aber zum Betrachten der Unterseiten w&#228;re es schon von Vorteil.</font><br><br>

<p align="center"><font color="#000080" size="7">
<b>Sch&#252;ler im Internet</font></b></p>

<table border=0 width=100% cellpadding=6><tr><td>

<p>F&#252;r Jugentliche hat das Internet eine Anziehungskraft, die viele Eltern
zur Wei&#223;glut bringen kann. "Hausaufgaben? Mache ich sp&#228;ter. Erst mal
schauen, ob Karl gemailt hat." Diese Gedanken sind absolute Realit&#228;t. Aber
es bleibt nicht beim Nachschauen in der Mailbox. Beim anschlie&#223;enden
Chatten und Spielen verinnen die Stunden ganz unbemerkt. Dabei hat gerade
das Netz auch Hilfreiches f&#252;r Sch&#252;ler zu bieten. Es gibt viele
Hilfestellungen wie &#220;bersetzungen, Nachhilfe und Referate. Bei Downloaden
von Lernsoftware sollte man tunlichst vorher mit den Eltern R&#252;cksprache
genommen haben und sich das Go geben lassen. Spezifisch f&#252;r das Amigasystem
sieht es hier aber etwas mager aus (und das ist noch voll &#252;bertrieben!).
Lernsoftware sollte man gezielt betrachten und sich dann von den Eltern als
CD-ROM schenken lassen. Aber nicht die ganze Palette, denn dann sind ganz
schnell mal 1500,- DM &#252;ber den Ladentisch gewandert. Es ist aber heute
unaufhaltbar, der Bildschirm hat mehr Anziehungskraft als das gedruckte
Buch und eine Lexikon-CD ist schneller eingelegt, als das entsprechende
Lexikon aus dem Regal geholt. </p>

<p>Die Verwendung von Lernsoftware hat Vor- und Nachteile. Der Computer ist
geduldig, er lobt und korrigiert individuell. Der Lernstand jedes Nutzers
wird gespeichert, so dass der Computer genau aufzeigt, wo der Sch&#252;ler noch
R&#252;ckst&#228;nde hat. Lernprogramm k&#246;nnen den Schulunterricht nicht ersetzen,
aber sie k&#246;nnen ihn erg&#228;nzen. Viele Lehrer kennen auch diese Lernprogramme
und werden wohlweislich die Hausaufgabenstellungen so formulieren, dass
diese noch per Hand erledigt werden m&#252;ssen und nicht digital erstellt zu
mehr Freizeit verhelfen. </p>

<p>Wir wollen aber heute nicht die Vor- und Nachteile von Lernsoftware
betrachten (da kenne ich mich fast &#252;berhaupt nicht aus), sondern einen
kleinen Blick auf die N&#252;tzlichkeit des Netzes f&#252;r Sch&#252;ler riskieren. </p>

<h3><b>Nachhilfe</b></h3>
<p>Eigentlich funktioniert dies ganz einfach. Man ruft die Website von
<a href="st_schueler1.html"><b> www.nachhilfe.com </b></a> auf und klickt bei
"<b>Nachhilfe online</b>". Es erscheinen zwei Masken: eine f&#252;r die pers&#246;nlichen
Daten, die zweite dient der Probleml&#246;sung. Vorher muss eingegeben werden,
welche Schule besucht wird und um welches Fach es sich handelt. Danach
einfach die Frage formulieren und senden. Innerhalb von 24 Stunden ist in
der Regel die Antwort per e-Mail da. Kosten? Ich habe diese Frage nicht
untersucht und kann keine Angaben machen, daf&#252;r habe ich aber alle Links
auf der Ansichtsseite deaktiviert. </p>

<h3><b>&#220;bersetzungen</b></h3>
<p>Manchmal fallen einem die richtigen Worte nicht ein und stundenlang im
Lexikon zu bl&#228;ttern dauert viel zu lange. Da kommt <b> www.world.altavista.com </b>
gerade recht. Der Onlinedialog l&#228;uft &#228;hnlich wie eben beschrieben ab, zus&#228;tzlich
ist nat&#252;rlich die Sprache auszuw&#228;hlen. </p>

<h3><b>Referate</b></h3>
<p>Davon kann man eigentlich nur tr&#228;umen, aber es ist wahr. 500 Referate,
und es werden immer mehr, warten bei <a href="st_schueler2.html"><b>
www.schulhilfen.com</b></a>. Egal ob Deutsch, Englisch, Chemie, Physik oder
ein anderes Fach. diese Adresse bietet (fast) perfekte Referate mit
Gliederung, verfasst von Sch&#252;lern und Studenten. Man sollte nur aufpassen,
dass der Tischnachbar nicht das Gleiche vortr&#228;gt. </p>

<h3><b>Hausarbeiten</b></h3>
<p>Die Mathearbeit droht und ich kann nicht erkl&#228;ren, wie das Rechenbeispiel
so gel&#246;st wird, dass der Lehrer den Rechengang nachvollziehen kann. Wenn das
der Fall ist, dann schnell bei <b> www.zahlreich.de </b> in der Easybox die
Matheaufgabe eingegeben und bald ist die L&#246;sung inklusive Erkl&#228;rung da. </p>

<h3><b>Lexika</b></h3>
<p>Nachschlagen in den verstaubten B&#252;chern im Wohnzimmerregal ist out. Wer
top informiert werden will, schl&#228;gt im Internet unter <b> www.iicm.edu/meyers </b>
nach und erh&#228;lt Erkl&#228;rungen f&#252;r (fast) alle Begriffe und Sachverhalte. </p>


<hr size=4>
</td></tr></table>
<center><font size="+1">
<a href="NoCover.html" target="_top"> Zur&#252;ck zur NoCover </a></font>
</center></table></center></center><br>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
