<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. AMIGA-Pr&auml;sident Bill McEwen wendet sich an die User</H2>
<P>
Anmerkung: Es handelt sich im Folgenden nicht um die &Uuml;bersetzung des
Executive Updates, das Anfang Februar in einem AMIGA-aktuell-Special
ver&ouml;ffentlicht worden ist, da AMIGA wenige Tage sp&auml;ter diese &uuml;berarbeitete
Fassung herausgegeben hat:
</P>
<H3>&raquo;EXECUTIVE UPDATE</H3>
<H3>4. Februar 2000</H3>
<P>
Gr&uuml;&szlig;e an alle und jeden:
</P>
<P>
Eine Menge ist geschehen w&auml;hrend der letzten paar Wochen und es wird immer
interessanter, so wie wir vorw&auml;rts gehen. Es ist eine Weile her, dass ich
zu Ihnen gesprochen habe und m&ouml;chte nun meine Freude mit Ihnen teilen.
</P>
<P>
In den letzen beiden Wochen haben wir unseren neuen OS-Partner vorgestellt,
haben die technische Ausbildung begonnen und hatten zahlreiche Treffen mit
zuk&uuml;nftigen Technologie-Partnern.
</P>
<P>
Die Reaktionen waren &uuml;berw&auml;ltigend positiv und, um ein altes Lied zu
zitieren, &quot;they ain't seen nothing yet&quot; (&quot;sie haben ja &uuml;berhaupt noch
nichts gesehen&quot;)!
</P>
<P>
Am 8. Januar 2000 auf der CES in Las Vegas gaben wir unsere Partnerschaft
mit der Tao-Gruppe als unserem Gr&uuml;ndungsgesellschafter f&uuml;rs OS bekannt.
Das ist nicht einfach eine technische, sondern auch eine strategische
Gemeinschaft  und wird f&uuml;r uns sehr lohnend sein. Ich habe Fleecy gebeten,
ein kurzes Papier zu schreiben, das die Verbindung Amiga/Tao aus einem mehr
technischen Blickwinkel betrachtet, um Ihnen meine Spr&uuml;che zu ersparen, wie
unglaublich gro&szlig;artig und fantastisch das ist. Wir m&ouml;chten, dass Sie Sich
selbst ein Bild machen.
</P>
<P>
Innerhalb der n&auml;chsten beiden Wochen werden wir eine weitere strategische
Verbindung mit Bezug auf die Richtung f&uuml;r den neuen Amiga bekanntgeben.
Wie bei allen unseren Bekanntmachungen, betrachten Sie das im ganzen
Zusammenhang, nicht isoliert f&uuml;r sich.
</P>
<P>
Nach einer wochenlangen Reise nach Deutschland und England kam ich zur&uuml;ck
mit einem viel besseren Verst&auml;ndnis daf&uuml;r, was wir tun k&ouml;nnen und was
nicht. Wie schon fr&uuml;her erw&auml;hnt, werden wir keine Versprechen oder Produkt-
Ank&uuml;ndigungen machen. Wir werden Ihnen, der Gemeinschaft, erst Mitteilung
machen, wenn ein Handel besiegelt ist oder wenn wir ein Produkt vor uns
stehen haben. Damit k&ouml;nnen wir zwar die kursierenden Ger&uuml;chte nicht
ausschlie&szlig;en, aber dadurch zeigen wir ihre Unglaubw&uuml;rdigkeit um so
deutlicher. &Auml;nderungen f&uuml;hren zur Unsicherheit und in einem Informations-
Vacuum &uuml;bernehmen gern die Miesmacher die F&uuml;hrung. Wenn es nicht offiziell
von Amiga best&auml;tigt ist, glauben Sie es nicht.
</P>
<P>
Es ist unsere Aufgabe als Gesellschaft, errregende neue Marktm&ouml;glichkeiten
zum Vorteil der Amiga-Entwickler zu schaffen und den Amiga-Anwendern eine
Platform zu bieten, an der sie Freude haben. Das bedeutet mehr als eine
Aufr&uuml;stung des bestehenden OS. Das braucht, nein, es erfordert eine
komplette Strategie, die in alle Bereiche der Gegenwart und der Zukunft
hineinzielt. Die Zeit ist reif f&uuml;r uns alle, Eigner, Entwickler und
Anwender, um vorw&auml;rts zu gehen.
</P>
<P>
Wir erhielten von Ihrer Seite zahlreiche Gesch&auml;fts-Vorschl&auml;ge und Produkt-
Vermarktungsideen, wir danken Ihnen daf&uuml;r und bitten um Ihre Geduld,
w&auml;hrend wir diese Pl&auml;ne pr&uuml;fen. Manche sind darunter, die uns wertvolle
Einblicke in die W&uuml;nsche der Amiga-Gemeinschaft als Ganzes bieten, andere
lie&szlig;en uns kr&auml;ftig Schmunzeln. Das ist der Amiga-Vorteil, den andere
Platformen einfach nicht haben.
</P>
<P>
W&auml;hrend der n&auml;chsten paar Monate k&ouml;nnen einige Gesellschaften mit ihren
eigenen Pl&auml;nen herauskommen oder sie werden behaupten, dass wir nicht an
die Gemeinschaft denken, wenn wir weitermachen. Tatsache ist, dass sie
nicht wissen, was wir vor haben. Um uns zu konzentrieren und unser
unglaubliches Tempo beizubehalten, werden wir an unseren Pl&auml;ne niemanden
au&szlig;erhalb unserer besiegelten Partnerschaften Teil haben lassen.
</P>
<P>
Wir m&uuml;ssen Priorit&auml;ten setzen und einm&uuml;tig handeln, wenn wir die erste
Stufe unserer vorgegebenen Zeitlinie erreichen wollen. Sobald wir dort
sind, haben wir eine Atempause. Manche f&uuml;hlen sich nicht besonders begl&uuml;ckt
dar&uuml;ber, aber die kennen eben nicht den Gesamtplan. Unsere Mission ist es,
nicht einfach den Amiga wieder aufzubauen, sondern ihn voran zu treiben
als DIE Technologie f&uuml;r Morgen.
</P>
<P><B>Klar und deutlich:</B></P>
<P>
Wenn Sie es nicht von uns h&ouml;rten oder unter dieser Web-Adresse gelesen
haben, entspricht es nicht der Wahrheit!
</P>
<P>
Wir bitten Sie nicht um Ihr Vertrauen oder Ihre unzweifelhafte Gl&auml;ubigkeit.
Wir bitten Sie nur, uns an UNSEREN Worten und Taten zu messen, nicht an den
Fehlinterpretationen anderer.
</P>
<P>
Wir werden bald mit offiziellen Treffen in Deutschland, England und den US
f&uuml;r Entwickler und H&auml;ndler beginnen. Es werden dabei einf&uuml;hrende &Uuml;bungs-
Seminare f&uuml;r das neue OS abgehalten werden und Einf&uuml;hrungen in die
Preisgestaltung und die Zeitpl&auml;ne im Einzelhandel. Wir werden auch mit dem
Prozess der Einf&uuml;hrung unserer neuen Web Site beginnen und den Amiga
Advisory Council wieder an die Arbeit setzen.
</P>
<P>
Ich m&ouml;chte jedem einzelnen von Ihnen f&uuml;r Ihre Gastfreundschaft w&auml;hrend der
Treffen danken und daf&uuml;r, dass Sie uns st&auml;ndig dabei unterst&uuml;tzten, mit
unseren &Uuml;berlegungen voran zu kommen. Wir konnten uns mit Endanwendern,
Entwicklern, H&auml;ndlern und neuen Partnern treffen und erwarten, mit der Zeit
noch viele mehr von Ihnen kennen zu lernen.
</P>
<P>
Es ist viel im Gange mit vielen ersten Schritten auf manchem ganz
erstaunlichem Pfad. Neue Partner sind &uuml;berrascht, altbekannte Gesichter
kommen zur&uuml;ck, wohlbekannte Gesichter erinnern uns an unsere Verpflichtung.
Tats&auml;chlich m&uuml;ssen wir schon in gr&ouml;&szlig;ere R&auml;ume umziehen, weil wir so
wachsen.
</P>
<P>
Ich verstehe Ihre Ent&auml;uschung, aber nach Jahre langem Herumirren im Dunkeln
beginnt die Sonne wieder am Horizont zu l&auml;cheln. Zusammen werden wir die
Zukunft erobern.
</P>
<P><B>Wir halten die Treue,</B></P>
<P>
Bill McEwen und das &uuml;brige Amiga-Team&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
