<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA geht strategische Partnerschaft mit der Tao Group ein</H2>
<P><B>AMIGA informiert:</B></P>
<P>
&raquo;Amiga Incorporated hat f&uuml;r den neuen Amiga eine strategische
Zusammenarbeit mit der Tao-Gruppe aufgenommen.
</P>
<P>
Las Vegas, 8.Januar 2000 - Amiga Incorporated, eine Gesellschaft in
Privatbesitz, die in Maple Valley, Washington, USA, angesiedelt ist, hat
eine strategische Zusammenarbeit mit der Tao-Gruppe als dem neuen Partner
zur Begr&uuml;ndung einer gemeinsamen Plattform f&uuml;r den neuen Amiga begonnen.
Die Bedingungen des Beschlusses wurden nicht offengelegt.
</P>
<P>
Bill McEwen, Pr&auml;sident und CEO von Amiga, erkl&auml;rte, dass die Gesellschaft
Tao als Partner f&uuml;r die Gr&uuml;ndung des neuen Amiga gew&auml;hlt wurde, nachdem
zahlreiche weitere potenzielle Partner gepr&uuml;ft worden waren.
</P>
<P>
&quot;Nach ausgedehnter Durchforschung des Marktes fanden wir, dass Tao in
seiner Zielsetzung und seinen St&auml;rken am meisten unseren Vorstellungen
entsprach und die F&auml;higkeit aufwies, die Sache voranzubringen,&quot; sagt
McEwen. &quot;Amiga zusammen mit Tao steigt auf eine neue Ebene an Leistungen,
Beweglichkeit und Anpassungsf&auml;higkeit, die nie zuvor erreicht war.&quot;
</P>
<P>
&quot;Die Wurzeln von Tao gr&uuml;nden im Amiga und damit stellt dieses Ergebnis
f&uuml;r uns eine ganz besondere Befriedigung dar,&quot; sagt Francis Charig,
Vorsitzender und CEO der Tao-Gruppe. &quot;Was diese Verbindung f&uuml;r Tao so
reizvoll macht, ist die erfreuliche Zusammenarbeit mit Amiga und der
Amiga-Gemeinschaft. Die Welt hat sich in den letzten Jahren radikal
ver&auml;ndert und es gibt Nachholbedarf im Hinblick auf Inhalt und Umfeld der
Software, die den Massenmarkt bedient. Die F&auml;higkeiten der Amiga-
Gemeinschaft zusammen mit der Kraft und Flexibilit&auml;t der Software-
Infrastruktur von Tao bedeutet, dass die neue Gesellschaft Amiga die
anspruchsvollsten Artikel f&uuml;r die wachsenden digitalen Dienste erzeugen
und damit die M&auml;rkte befriedigen kann.
</P>
<P><B>HINWEISE F&Uuml;R REDAKTEURE</B></P>
<P><B>&Uuml;BER AMIGA</B></P>
<P>
Amiga Incorporated widmet sich der Entwicklung, dem Entwurf und der
Fertigung von Komponenten, Dienstleistungen und Modellen, die die digitale
M&ouml;glichkeiten der Zukunft unterst&uuml;tzen. Amiga f&uuml;hrte die Welt in die Multi-
Media-Technik in den fr&uuml;hen 80er Jahren und wird sie weiter in das
umfassende digitale Universum der Zukunft leiten.
</P>
<P><B>&Uuml;BER TAO</B></P>
<P>
Die Tao-Gruppe ist eine Gesellschaft zur Ideen- und Software-Entwicklung,
die sich auf die Technologie f&uuml;r Inhaus- und mobile Netzwerke spezialisiert
hat. Gegr&uuml;ndet im Jahre 1992 bietet die Gesellschaft wichtige Startprodukte
f&uuml;r den wachsenden Markt intelligenter Verbraucherger&auml;te. Die Philosophie
der Gesellschaft ist es, leistungsstarke Rahmensysteme zu bieten, die &uuml;ber
den ganzen Bereich von vernetzte Einrichtungen von intelligenten Telefonen
bis zu digitalen Fernseheinrichtungen reichen, in die die Auftraggeber von
Tao ihre eigenen Markensysteme einsetzen und mit Aufwertungen versehen
k&ouml;nnen. Zu den Kunden von Tao geh&ouml;ren die Gesellschaften der &quot;BlueChip-
Technologie&quot; in den Vereinigten Staaten, Japan und Europa. Motorola ond
Sony sind Investoren in die Tao-Gruppe. Die Zentrale von Tao ist in
Reading, United Kingdom, mit Niederlassungen in Japan und den Vereinigten
Staaten, zu seinem Mitarbeiter-Stab geh&ouml;ren &uuml;ber f&uuml;nfzig Software-
Ingenieure von Weltklasseformat. Tao ist &quot;Deloitte &amp; Touche Fast 50 Winner&quot;
und hat dazu noch eine Reihe von Innovationspreisen f&uuml;r sein Betriebssystem
und seine auf Java basierende Technik (Java-based engine) erhalten.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P>
<B>Anmerkung zu &quot;FAST 50&quot;:</B><BR>
(Auszug aus der Pressever&ouml;ffentlichung einer anderen Firma)
</P>
<P>
&raquo;Deloitte &amp; Touche Fast 50 Winner
</P>
<P>
Gesellschaften, die f&uuml;r den Status &quot;Fast 50&quot; ber&uuml;cksichtigt werden sollen,
m&uuml;ssen eine Technologie oder ein Technologie-bezogenes Produkt herstellen,
wobei ein hoher Anteil des Aufwandes der Forschung und der Entwicklung
gewidmet sein mu&szlig;. Der Reihenfolge der Nominierung liegt der prozentuale
Zuwachs des Betriebseinkommens in einer F&uuml;nfjahresperiode zu Grunde, das
an deren Beginn mindestens 50 000 Dollar betragen haben muss.
</P>
<P>
Bob Weaver, Partner der San Diego Technologie-Gruppe Deloitte &amp; Touche,
beschreibt: &quot;Als Fast-50-Gewinner benannt zu werden ist eine Best&auml;tigung
f&uuml;r die herausragende Stellung einer Firma und f&uuml;r ihre F&auml;higkeit, nicht
nur die richtige Entscheidung im richtigen Moment zu treffen, sondern auch
die Weitsicht zu haben, die ein kontinuierliches Wachstum &uuml;ber f&uuml;nf Jahre
gew&auml;hrleistet.&quot;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
