<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Bericht zum Informationsmeeting mit Bill McEwen und Petro Tyschtschenko</H2>
<P>
Am 17. Januar fand in Frankfurt/Main eine Informationsveranstaltung mit
AMIGA-Pr&auml;sident Bill McEwen und Petro Tyschtschenko statt, an dem
zahlreiche Amiga-Entwickler, -H&auml;ndler und -Journalisten teilnahmen. F&uuml;r
AMIGA aktuell dabei war unser Mitarbeiter Gernod Schomberg. Hier sein
ausf&uuml;hrlicher Bericht:
</P>
<P>
Informationsmeeting mit Bill McEwen und Petro Tyschtschenko
am 17.Januar 2000 im ESPRIX HOTEL, Rhein-Main-Flughafen, Frankfurt.
</P>
<P>
Diese Veranstaltung, die nach Bill McEwens Worten bewusst als erste
nach Gr&uuml;ndung der neuen Amiga Incorporated nach Deutschland gelegt
worden war, sollte Entwickler, H&auml;ndler und Presse &uuml;ber die Pl&auml;ne und
Strategien unterrichten, mit denen die Zukunft unseres Rechners
gesichert werden soll. Die Teilnehmerzahl lag bei etwa 30 (gesch&auml;tzt,
ich hatte leider vergessen zu z&auml;hlen), die aus allen Teilen
Deutschland angereist waren. Kurz nach 15 Uhr wurde das Treffen von
Petro Tyschtschenko er&ouml;ffnet.
</P>
<P>
<A HREF="img/Petro&Bill.jpg"><IMG SRC="thumb/Petro&Bill.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Es gab noch keine schriftlichen Unterlagen, lediglich das so genannte
NDA (Confidentality and Non-Disclosure Agreement) musste von allen
Teilnehmern unterschrieben werden und verpflichtet jeden, nichts &uuml;ber
konkrete Dinge zu berichten, die irgend einen Bezug auf die
Gesch&auml;ftspolitik von Amiga haben. Damit ist leider alles gemeint, was f&uuml;r
uns von gro&szlig;em Interesse ist, die Hard- und Software-Ausstattung k&uuml;nftiger
Amiga-Rechner, aber auch &uuml;ber die finanziellen Bedingungen der neuen
Gesellschaft und  Partner, mit denen man verhandelt, ist Schweigen geboten.
</P>
<P>
Bill McEwen sprach frei &uuml;ber seine Ansichten und Ideen und sprang in
launiger Art zwischen den Themen hin und her (... und sein &quot;Yankee drawl&quot;
machte es f&uuml;r manchen Teilnehmer und auch f&uuml;r den Berichter nicht ganz
leicht, ihm immer zu folgen).
</P>
<P>
Zun&auml;chst und sp&auml;ter noch mehrfach bedauerte Bill, dass die ungl&uuml;ckliche
Vorgehensweise von Gateway die Entwicklung um drei Jahre zur&uuml;ck geworfen
hat. W&auml;hrend zun&auml;chst die Leitung von Gateway die Entwicklung von Amiga
unterst&uuml;tzte, wurde nach einem Wechsel in der F&uuml;hrungsetage der Kurs
vollkommen umgekehrt.
</P>
<P>
<A HREF="img/Kaffeepause.jpg"><IMG SRC="thumb/Kaffeepause.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Es wurde immer wieder deutlich, dass f&uuml;r Bill die Idee des Amiga eine
Vision darstellt, der zu folgen er alle Amiga-Freunde aufrief. Wenn das
was er &uuml;ber die neuen M&ouml;glichkeiten sagte, wahr wird, dann haben wir
wirklich etwas Gro&szlig;artiges zu erwarten. Nat&uuml;rlich wird es wie &uuml;blich
nicht jedem gefallen, aber damit muss man leben. Amiga Inc. betreibt
damit aber durchaus eine vern&uuml;nftige Gesch&auml;ftspolitik.
</P>
<P>
Was mir besonders wichtig erschien, war die ausgesprochene Unterst&uuml;tzung
f&uuml;r Entwickler und Programmierer, die ganz besonders betont wurde. Ger&auml;te
und Softwarepakete sollen f&uuml;r sie schnellstens bereitgestellt werden. Ein
Zeitpunkt im Februar ist daf&uuml;r ins Auge gefasst.
</P>
<P>
Wir, die Endanwender, sollen schon in diesem Jahr, m&ouml;glicherweise im
Sp&auml;tsommer, den Neuen Amiga kaufen k&ouml;nnen. Auch auf das Weihnachtsgesch&auml;ft
wolle man sich konzentrieren. Genaue Daten und Leistungsmerkmale werden
bekanntgegeben, sobald sie vorliegen. Der Eindruck besteht aber, dass
Amiga Inc. die Hardware nicht selbst fertigen wird. F&uuml;r die Software,
besonders f&uuml;r das Betriebssystem, scheint die Zusammenarbeit mit dem
neuen Partner TAO vorprogrammiert zu sein.
</P>
<P>
Der &quot;klassische&quot; Amiga (Bill verwendete auf Zuruf aus der Zuh&ouml;rergruppe
sp&auml;ter nur noch den Ausdruck &quot;current&quot; = &quot;derzeitig&quot;) soll nach M&ouml;glichkeit
unterst&uuml;tzt werden, Weiterentwicklungen des OS sind nicht ausgeschlossen.
</P>
<P>
Zum Schluss forderte Bill alle Entwickler auf, mit Amiga Inc. zu sprechen
und mit ihnen zusammenzuarbeiten, damit es nicht zu Fehlentwicklungen
kommt. Er bat allgemein darum, mit ihm engen Kontakt zu halten. In diesem
Zusammenhang betonte er auch, dass der AAC (Amiga Advisory Council) wieder
angesprochen und aktiv in die Entwicklung eingeschaltet werden soll.
</P>
<P>
Amiga Incorporated will sich nicht an den &uuml;blichen Messen und Shows
beteiligen, sondern eigene Events veranstalten. Wichtig sei es, einen
Markt zu begr&uuml;nden und Amiga als Marke bekannt zu machen. Scherzhaft
bemerkte Bill, dass sogar schon CNN von Amigas Vorhaben Wind bekommen
hatte und er dort ein Interview gab, das vor allem in seiner Familie
helle Freude hervorrief!
</P>
<P>
Mehrfach und auch noch zum Schluss betonte Bill seine Begeisterung f&uuml;r
die Amiga-Community und dankte ihr, dass sie die Hoffnung nicht
aufgegeben hatte. Es sei erstaunlich, wie in diesen letzten drei Jahren
von Enthusiasten immer noch Neues an Soft- und Hardware geschaffen wurde.
Er bedankte sich bei allen und bat nocheinmal, mit ihm in Verbindung zu
bleiben. Seine eMail-Adresse sei bekannt und auch seine Telefonnummer. Wenn
immer er in seinem B&uuml;ro sei, nehme er pers&ouml;nlich den H&ouml;rer ab.
</P>
<P>
Gegen 17.30 war der offizielle Teil zu Ende, man traf sich noch zu
Gespr&auml;chen in der Bar. Diesen Teil des Abends lie&szlig; der Berichter aus,
leider, wie er nachtr&auml;glich sagen muss, denn da wurde von Petro
Tyschtschenko noch eine vorher nicht angek&uuml;ndigte Pressebesprechung
abgehalten.
</P>
<P>
<A HREF="img/VKBill.jpg"><IMG SRC="thumb/VKBill.jpg" WIDTH="120" HEIGHT="81" ALT="Screenshot"  BORDER="0"></A>
</P>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:g.schomberg@t-online.de">g.schomberg@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGA3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
