<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. Der Verkauf der AMIGA-Rechte - eure Meinungen</H2>
<P>
In der letzten Ausgabe baten wir um eure Statements zum Verkauf der AMIGA-
Rechte an Bill McEwen und Fleecy Moss. Hier sind sie:
</P>
<P>
Lars Wache meint: &raquo;Ich sehe der Sache mit Bill McEwen und Fleecy Moss eher
optimistisch entgegen. Wir sind zwar so oft von anderen Firmen entt&auml;uscht
worden - nicht zuletzt auch von Gateway, so dass ich eigentlich nur sagen
kann: Abwarten und Tee trinken. Mal sehen, was das neue Team aus unserer
Freundin macht. Wenn sich dem auch noch Jim Collas hinzugesellen w&uuml;rde,
dann kann alles nur noch besser werden.&laquo;
</P>
<P>
Wolf Zimmer sieht den Verkauf der Rechte als &raquo;die einzig verbliebene
Hoffnung&laquo; an.
</P>
<P>
Auch Hans Happe ist positiv gestimmt:
</P>
<P>
&raquo;Ihr fragt nach der Meinung der Amiga-User zur &Uuml;bernahme.
</P>
<P>
Nun, ich sehe darin eine gro&szlig;e Chance, da&szlig; diese uns vertraute Plattform
nicht ganz untergeht. Wir, die User, wissen, was wir an unserem
Computersystem haben, da&szlig; es immer noch Spa&szlig; macht, damit zu arbeiten,
auch wenn die Leistung des Prozessors nicht mehr uptodate ist. Also,
liebe Herren McEwen und Moss, baut endlich den Amiga mit st&auml;rkerer
Prozessorleistung zu einem vern&uuml;nftigen Preis, unter Beibehaltung des
Amiga-Konzepts, was nicht unbedingt hei&szlig;t, da&szlig; das Betriebssystem sich
nicht &auml;ndern darf. Es mu&szlig; sich sogar &auml;ndern, um aktuellen Anforderungen
(DVD, Digitalschnitt usw.) gerecht werden zu k&ouml;nnen. Ob das mit Linux
geschieht oder anderen Komponenten ist egal: Hauptsache, das
Amiga-Feeling bleibt dabei nicht auf der Strecke.
</P>
<P>
Und wir, die Amiga User, sollten noch offensiver f&uuml;r das Amiga-Konzept
werben, damit endlich auch neue M&auml;rkte erschlossen werden.&laquo;
</P>
<P>
Wolfgang M&uuml;nch reagiert dagegen eher abwartend:
</P>
<P>
&raquo;Ankn&uuml;pfend an meinen Kommentar zur Meinungsfrage 12/99 kann ich den
Verkauf fast nur positiv werten! Hier haben zwei Leute zugegiffen, die im
Gegensatz zu Gateway Wissen um das Potential des Amigas haben. Die Frage
ist nur, wie sie den Amigamarkt wieder ankurbeln wollen. Nach dem was man
bis jetzt h&ouml;rt, wollen sie das NG-Konzept fortf&uuml;hren. Ich habe aber meine
Bedenken, ob dieses System mit dem Amiga-look-and-feel noch was gemeinsam
hat. Mal abwarten. Als gebranntes Kind setzte ich jedenfalls keine allzu
hohen Erwartungen in Amino.
</P>
<P>
Sie sollten vor allem Haage &amp; Partner die Lizenz f&uuml;r die Portierung des OS
auf CHRP erteilen (auch wenn ich von WarpUP nicht viel halte); erste
Kontakte hat es da wohl schon gegeben. Ich pers&ouml;nlich finde die Entwicklung
zum PowerPC interessanter, da hier kein so harter Bruch mit dem
ClassicAmiga entsteht und es eine offene Plattform darstellt, die jeder
bauen darf. Diese Strategie hat auch den IBM-Kompatiblen zum Erfolg
verholfen. Dazu kommt, da&szlig; diese Plattform bis jetzt nur MacOS hat.
&Uuml;berzeugt hier ein schnelles, sicheres Amiga-OS, k&ouml;nnte das die Verbreitung
des Amigas wieder erh&ouml;hen. Ich hoffe, Amino bezieht diese Entwicklung
zumindest in ihre &Uuml;berlegungen mit ein.
</P>
<P>
Sollte der NG-Amiga (wenn er je kommt) so ein Hammer sein wie damals der A
1000, so werde ich mich dieser Technik jedenfalls nicht verschlie&szlig;en! Ich
habe mittlerweile einige Erfahrung mit MacOS und WinDOS, sowie erste
Schritte mit Linux gemacht. An das jetzige Amiga-System kommen sie aber
alle nicht heran. Da mu&szlig; auch der NG-Amiga wirklich revolution&auml;r sein.&laquo;
</P>
<P>
Nils Goers ist die AMIGA-&Uuml;bernahme &raquo;ziemlich egal.&laquo;
</P>
<P>
Markus Lunk sieht die Sache dagegen &raquo;eher positiv, wenn nur die Finanzlage
nicht so unklar w&auml;re. Hoffen wir, dass Jim so schnell wie m&ouml;glich mit an
Bord kommt! Die Finanzen sind meine einzige Sorge, dass Bill und Fleecy
zwei von uns sind und es drauf haben, steht au&szlig;er Frage.&laquo;
</P>
<P>
Gerd Engelmann &auml;u&szlig;ert sich wie folgt:
</P>
<P>
&raquo;Ich bin sehr erfreut &uuml;ber die Entwicklung seit Anfang diesen Jahres.
Nachdem ich meine Hoffnungen auf einen w&uuml;rdigen Amiga-Nachfolger schon
begraben hatte und mich damit abfand, das ich bis zum technischen Versagen
meines A 2000 weiter mit ihm arbeiten werde, r&uuml;ckt nun ein neuer Rechner
wieder in den Bereich des m&ouml;glichen. Und zwar mehr denn je.
</P>
<P>
Denn jetzt liegen die Rechte bei Leuten, die zu sch&auml;tzen wissen, was der
Amiga war und immer noch ist.
</P>
<P>
Die Ank&uuml;ndigungen der letzten Tage h&ouml;ren sich sehr vielversprechend an,
auch die Zusammenarbeit mit der TAO-Gruppe finde ich sehr positiv, auch
wenn man nicht sehr viel &uuml;ber deren Projekte wei&szlig;.
</P>
<P>
Ich w&uuml;nsche mir allerdings auch, das man die Firma Haage &amp; Partner nicht
vergisst, denn sie haben einen grossen Anteil daran, das nicht noch mehr
User dem Amiga den R&uuml;cken kehren.&laquo;
</P>
<P>Fritz Trampnau schreibt:</P>
<P>
&raquo;Ich mu&szlig; sagen, da&szlig; mir im Augenblich &uuml;berhaupt nichts zum
neuen AMIGA-Verkauf einf&auml;llt! Sicher, B. McEwen, hat in in der
Vergangenheit schon einiges - auch zum AMIGA - ge&auml;u&szlig;ert, und er wird gewi&szlig;
weitere Erkl&auml;rungen abgeben - doch nun ist der Punkt erreicht, wo nichts
mehr geglaubt, aber auch nichts mehr erhofft wird - WHITE OUT - Horizont
und Landschaft sind eins geworden - in welche Richtung man auch immer
geht, man sieht stets dasselbe - so gehen wir voran - und drehen uns bald
schon im Kreis - und - um uns selbst herum.
</P>
<P>
ABER: Sp&auml;testens im Fr&uuml;hling hat sich das WHITE OUT aufgel&ouml;st, und im
Sommer gibt's die neuen AMIGAs!
Also, wacker voran - die Todgeweihten leben l&auml;nger, als sie es
selbst f&uuml;r m&ouml;glich hielten!
In diesem Sinne -
</P>
<P>AMIGA forever!!&laquo;</P>
<P>Dieter Schoo ist optimistisch:</P>
<P>
&raquo;Man spricht von 5 Mio Dollar, die f&uuml;r Amiga gezahlt wurden. So viel Geld
konnte sicher nicht aus der Hosentasche gezahlt werden, sondern dahinter
stehen Geldgeber. Und die wollen ihr Geld wiedersehen, m&ouml;glichst bald und
m&ouml;glichst um vieles vermehrt. Also schauen sie genau, wof&uuml;r sie Geld geben.
</P>
<P>
Folgerung: Die Aminos haben ein Konzept vorgelegt, das &uuml;berzeugt!
</P>
<P>Ich hoffe jetzt, dass</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1.&nbsp;</TD><TD VALIGN="TOP">der Kauf von Amiga wirklich aus Interesse am &quot;Amiga&quot; stattfand (k&ouml;nnte&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">man bei Bill McEven und Fleecy Moss sehr stark annehmen) und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2.&nbsp;</TD><TD VALIGN="TOP">das Geld ausreicht, ihre Vorstellungen zu verwirklichen, und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3.&nbsp;</TD><TD VALIGN="TOP">sie nicht aus den Augen verlieren, wohin die Entwicklung geht, damit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der Amiga immer up-to-date sein kann.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Dann werden wir ein neues System bekommen, das auch die jetzigen Amiga-
Freaks begeistern wird (nat&uuml;rlich erst nach geh&ouml;rigem Meckern und
verteufeln, wie es sich f&uuml;r richtige Amiganer geh&ouml;rt! ;-) ).&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
