<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Falke-Verlag meldet sich mit Statement zur neuen Amiga Plus zu Wort</H2>
<P><B>Falke-Verlag informiert:</B></P>
<P>
&raquo;&Uuml;ber den Preis und die Leistung
</P>
<P><B>Liebe Amiga-Freunde,</B></P>
<P>
in den vergangenen Wochen ist viel &uuml;ber die Ver&auml;nderungen bei der Amiga
plus und amigaOS geredet und diskutiert worden - zu Recht, das gebe ich zu,
denn eines ist sicherlich wahr: Der Zusammenschlu&szlig; beider Zeitschriften hat
nicht den von vielen Lesern gew&uuml;nschten Effekt gehabt, dass das Heft bei
geringerem oder gleichbleibendem Preis umfangreicher wird. Die Kritik, es
w&auml;re f&uuml;r amigaOS-Leser teurer geworden, den Amiga-plus-Lesern sei die
Diskette verloren gegangen (ausser den Abonnenten) und insgesamt h&auml;tte die
Papierqualit&auml;t nachgelassen, muss ich gelten lassen. Aber gerne m&ouml;chte ich
auch erl&auml;utern, wie diese Entwicklung zustande gekommen ist. Ich werde
Ihnen ehrlich wichtige Details aus dem Verlagswesen aufzeigen, und ich
werde Sie schlie&szlig;lich hoffentlich davon &uuml;berzeugen k&ouml;nnen, dass ich den
richtigen Weg gew&auml;hlt habe, um dem Amiga-Markt &uuml;ber viele Jahre hinweg eine
gute Publikation sichern zu k&ouml;nnen.
</P>
<P>
Der Amiga-Markt hat sich in den vergangenen Monaten stark gewandelt:
Traten wir vor 16 Monaten noch gegen 3 Mitstreiter an, erkl&auml;rt sich
heutzutage nur noch unser Verlag gerne bereit, f&uuml;r den Amiga zu
publizieren.
</P>
<P>
Die Grundlage allen &Uuml;bels ist, dass es f&uuml;r jedes Unternehmen wichtig ist,
rentabel zu wirtschaften. Und um eine Printpublikation wirtschaftlich
herauszugeben, muss ein wesentlicher Teil der Kosten durch Werbeanzeigen
gedeckt werden. Nun schauen Sie sich doch bitte einmal eine Amiga plus vom
Sommer 1998 an und vergleichen Sie das Werbeaufkommen mit der aktuellen
Ausgabe. Sie werden sehen, dass sich das Volumen marktbedingt mindstens
halbiert hat. Und selbst, wenn wir vielleicht ein paar Hefte weniger
herstellen und drucken m&uuml;ssen als vor zwei Jahren, so bleibt ein
wesentlicher Kostenfaktor, n&auml;mlich die gesamte Vorproduktion eines Heftes,
stets bestehen. Ganz gleich, ob Sie 100 oder 100.000 Heft vertreiben.
</P>
<P>
Wir haben uns dar&uuml;ber Gedanken gemacht, wie wir Ihnen den gleichen
Netto-Informationsgehalt bieten k&ouml;nnen und haben folgende Konzepte
umgesetzt:
</P>
<P>
Die ausfallenden Werbeseiten wurden selbstverst&auml;ndlich mit redaktionellem
Inhalt gef&uuml;llt, und sowohl Schriftgr&ouml;&szlig;e als auch Zeilenabstand wurden
gegen&uuml;ber der bisherigen Amiga plus drastisch reduziert. Das Resultat ist,
dass Sie durch den Erwerb des Heftes das gleiche Informationsspektrum
erhalten wie bei einem Heft, das einige Seiten mehr hat.
</P>
<P>
Dass die Monatsdiskette nicht mehr jedem im Handel vertriebenen Heft
beiliegt, werden einige von Ihnen sicherlich schmerzlich vermissen. Doch
stellen Sie sich vor, welche Kosten es verursacht, wenn wir tausende von
Disketten herstellen lassen, von denen ein Teil (n&auml;mlich der der
Heftr&uuml;ckl&auml;ufer) anschlie&szlig;end &uuml;berfl&uuml;ssig ist und kostenaufwendig entsorgt
werden muss. Schlie&szlig;lich muss jede Zeitschrift in solchen St&uuml;ckzahlen am
Markt sein, dass sie auch noch am Ende ihres Erscheinungszeitraums
fl&auml;chendeckend verf&uuml;gbar ist. Jeder Abonnent erh&auml;lt die Monatsdiskette
weiterhin ohne jeglichen Aufpreis frei Haus zugestellt. Das erm&ouml;glicht eine
kalkulierte Produktion f&uuml;r uns - und einen Erhalt der Heftqualit&auml;t f&uuml;r Sie.
</P>
<P>
Abschlie&szlig;end ergeben sich folgende Gewinne f&uuml;r Sie und f&uuml;r uns:
</P>
<UL>
<LI> Wir bleiben in der Lage, die Amiga plus bundes- und nahezu europaweit in
  guten St&uuml;ckzahlen anzubieten, ohne auf den Bahnhofsbetrieb oder gar das
  Abonnement umstellen zu m&uuml;ssen.
</LI>
<BR><LI> Auf diese Weise verhindern wir, dass der Amiga-Markt g&auml;nzlich in eine
  Nische verdr&auml;ngt wird und bieten Bill Mc. Ewen und seinem Team die richtige
  Plattform, um den Amiga wieder popul&auml;r zu machen.
</LI>
<BR><LI> Wir k&ouml;nnen Ihrem Anspruch an den Inhalt gerecht werden, weil wir hier
  nicht an den S&auml;ulen der Qualit&auml;t r&uuml;tteln m&uuml;ssen, indem wir auf gute und
  wichtige redaktionelle Mitarbeiter verzichten.
</LI>
</UL>
<P>
Nicht ohne Grund haben soviele Verlage das Handtuch geworfen und einfach
festgestellt, dass es gen&uuml;gt, ihre weiteren Publikationen weiterzuf&uuml;hren
und den Amiga-Bereich aufzugeben. Aber ich habe mit dem Atari-Markt 1996
die Erfahrung gemacht, dass es m&ouml;glich ist, eine Zeitschrift &uuml;ber viele
Jahre mit hohem Anspruch am Leben zu erhalten, wenn sich die Leser
bereiterkl&auml;ren, einen Teil der Mehrkosten f&uuml;r eine exzellente redaktionelle
Leistung zu tragen, wenn der Kostenapparat eines Verlags anderweitig nicht
mehr gehalten werden kann. Und die ST-Computer lebt auch heute noch
pr&auml;chtig und das &uuml;brigens ganz ohne Preissteigerung oder Seitenzahl-
Reduzierung seit 4 Jahren!
</P>
<P>
Ich hoffe, dass ich Ihnen einen kleinen Einblick in die Arbeitsweise
unseres Verlages gew&auml;hren konnte, und ich bin mir sicher, dass Sie nun
bestens nachvollziehen k&ouml;nnen, dass wir einen Weg gew&auml;hlt haben, der
langfristig den Amiga-Anwendern dienlich sein wird.
</P>
<P>
In diesem Sinne verbleibe ich mit den besten Gr&uuml;&szlig;en
</P>
<P>
Ihr Ali Goukassian<BR>
Verlagsleiter&laquo;<BR>
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
