<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Haage&amp;Partner-News</H2>
<P>
Und hier wieder die neuesten Meldungen des Unternehmens:
</P>
<P>
&raquo;<B>04 Jan 2000:</B> PageStream 4.0 Revision 2
</P>
<P>
Auf unserem FTP-Server befindet sich jetzt der Patch auf die Version 4.0r2
(~600KB).
</P>
<P>
<B>12 Jan 2000:</B> Amiga, Amino, TAO-Group
</P>
<P>
Zum Jahresanfang erwarb die Firma Amino die Rechte an Amiga. Am 8. Januar
wurde die Zusammenarbeit mit der englischen Firma TAO-Group bekanntgegeben.
</P>
<P>
Wir sind bereits in Kontakt mit den Gr&uuml;ndern von Amino/Amiga Bill McEwen
und Fleecy Moss und werden uns in K&uuml;rze auch zu einem Gespr&auml;ch treffen.
</P>
<P>
<B>18 Jan 2000:</B> Das Treffen mit Bill
</P>
<P>
Am Montag fand das angek&uuml;ndigte Treffen einer Gruppe von Amiga-Entwicklern,
H&auml;ndlern und der Presse mit Bill McEwen (CEO Amiga Inc.) in Frankfurt
statt.
</P>
<P>
Bill erl&auml;uterte die Zusammenarbeit mit TAO und die Pl&auml;ne f&uuml;r die Zukunft.
Wir von H&amp;P sind sehr begeistert von der vielversprechenden Aussichten und
werden uns daher schon bald zu weiteren Gespr&auml;chen zusammensetzen.
</P>
<P>
<B>20 Jan 2000:</B> Treiber f&uuml;r Wacom-Graphire
</P>
<P>
Endlich k&ouml;nnen auch die Amiga-Fans in den Genu&szlig; des neuen Grafiktabletts
kommen. Die Treiber unterst&uuml;tzen dabei sowohl den drucksensitiven Stift,
als auch die beiliegende kabellose Maus und deren Scrollrad.
</P>
<P>
<B>20 Jan 2000:</B> G4 mit 2 GHz - Neue ppclib-Emulation
</P>
<P>
Motorola stellte Pl&auml;ne f&uuml;r die Zukunft des PPC-G4 vor und verspricht
Taktraten von &uuml;ber 2 GHz. Frank Wille hat eine neue Version der
ppc.library-Emulation unter WarpUP fertiggestellt.
</P>
<P>
Auch in der Warp3D-Liste gab es in letzter Zeit einige neue Eintr&auml;ge.
</P>
<P>
<B>20 Jan 2000:</B> Was tun, wenn man auf Raubkopien trifft?
</P>
<P>
Kent Seaton hat einige Anweisungen hierzu im NoPiracy Forum ver&ouml;ffentlicht,
die jetzt auch auf den NoPiracy-Seiten nachgelesen werden k&ouml;nnen.
</P>
<P>
<B>25 Jan 2000:</B> 535.353
</P>
<P>
Obwohl wir es nicht mehr angek&uuml;ndigt hatten, konnten sich doch einige an
unsere Aktion erinnern. Neun Surfer hatten sich diesmal gemeldet, doch der
erste war Dariusz Gora aus Polen. Gratulation!
Wir bedanken uns bei allen, die teilgenommen haben. Die n&auml;chste Aktion ist
ja schon am Laufen...
</P>
<P>
<B>02 Feb 2000:</B> Der neue Online-Shop...
</P>
<P>
... ist endlich fertig. Er basiert auf der Scriptsprache PHP3 und der
Datenbank MySQL und l&auml;uft auf dem Server ab. Daher ist er auch mit allen
Amiga-Browsern benutzbar. In den n&auml;chsten Wochen werden noch einige
Erweiterungen in den Shop eingebaut werden, er ist aber schon voll
funktionsf&auml;hig.
</P>
<P>
<B>02 Feb 2000:</B> Gewinnt ArtEffect oder AmigaWriter
</P>
<P>
In den n&auml;chsten Tagen erwarten wir den 555.555sten Besucher auf unserer
Homepage. Um das zu feiern verlosen wir wieder ein Softwarepaket.
</P>
<P>
<B>09 Feb 2000:</B> Wer gewinnt ArtEffect oder AmigaWriter ???
</P>
<P>
In den n&auml;chsten Tagen erwarten wir den 555.555sten Besucher auf unserer
Homepage. Um das zu feiern verlosen wir wieder ein Softwarepaket.
</P>
<P>
<B>09 Feb 2000:</B> Neue 3D Software angek&uuml;ndigt
</P>
<P>
In den letzten Tagen hat es wieder einige Neuank&uuml;ndigungen von 3D-Software
Titeln gegeben.&laquo;
</P>
<P><B>(Quelle: Haage &amp; Partner)</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
