<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. Vorstellung: CD&sup3;&sup2;-Allianz</H2>
<P>
&raquo;Sehr geehrte Leser und Leserinnen der Amiga aktuell,
</P>
<P>
sicherlich hat der ein oder andere von Ihnen noch ein CD32 bei sich zuhause
stehen, vielleicht sogar zusatzlich mit dem SX1 oder SX32-Modul, und Eure
Meinung ist, dass viel zu wenig f&uuml;r das CD32 getan wird, genau derselben
Meinung sind Dieter wie auch Thorsten Sch&ouml;lzel sowie Manuel Gatz, zusammen
bilden wir die CD32-Allianz.
</P>
<P>
Zusammen mit H&auml;ndlern, Soft- und Hardwarefirmen haben wir uns zum Ziel
gesetzt, wieder Leben in den schon toten CD32-Markt zu bringen. Wir bitten
diejenigen, die ein CD32 haben bzw. alle CD32-Freaks, uns zu unterst&uuml;tzen.
Denn von Euch h&auml;ngt jetzt mal wieder alles ab, ob noch etwas f&uuml;r das CD32
erscheint oder nicht, daher m&ouml;chte ich Euch bitten, an der Umfrage
teilzunehmen die z.Z. im CD32-Corner durchgef&uuml;hrt wird. Der CD32-Corner ist
unter folgender URL-Adresse erreichbar:
</P>
<P>
<A HREF="http://home.t-online.de/home/amiga-freak" TARGET="_top">http://home.t-online.de/home/amiga-freak</A>
</P>
<P>
Unsere Umfrage kann nur zum Erfolg f&uuml;hren, wenn sich jeder an dieser
beteiligt. Der BreakEven liegt bei 500 CD32-User, das hei&szlig;t, es m&uuml;ssen sich
mindestens 500 User an der Umfrage beteiligen, besser w&auml;ren sogar mehr.
Denn f&uuml;r 10 oder 20 User werden Firmen sicherlich keine 3D-Erweiterung oder
ein MPEG-Modul herstellen.
</P>
<P>
Au&szlig;erdem wird von der CD32-Allianz der &quot;CD32 Tips-Guide&quot; weiterentwickelt,
der schon bei Erscheinen dieser Amiga aktuell erh&auml;ltlich sein k&ouml;nnte. Es
gibt viele Neuerungen... Neu wird u.a. der Name sein, denn ab der Version
20 wird der CD32 Tips-Guide &quot;CD32 Cheats-Guide&quot; hei&szlig;en. Erh&auml;ltlich wird
dieser auf dieser Homepage (im Games-Bereich) wie auch im Aminet sein. Es
stehen Tipps &amp; Tricks zu rund 60 CD32 Games zur Verf&uuml;gung.
</P>
<P>
Anmerkung: Im Aminet wird der CD32 Cheats-Guide allerdings noch unter
&quot;CD32-Tips.lha&quot; zum Download bereitstehen. Erst ab der n&auml;chsten Version
plane man einen Wechsel auf &quot;CD32Cheats-lha&quot;.
</P>
<P>
Wir m&ouml;chten Sie alle herzlich einladen, uns im CD32-Corner zu besuchen und
dass Sie uns evtl. Ihre Meinung zukommen lassen.
</P>
<P>
Auf der Homepage, die &quot;powered by CD32-Allianz&quot; wird, wird man eine Menge
Infos rund um das CD32 und allem, was jemals f&uuml;r dieses Ger&auml;t entwickelt
worden ist, finden. Sei es das MPEG-Modul, die Erweiterungen SX-1, SX32,
dem CD32-Joypad...
</P>
<P>
In K&uuml;rze werden weitere Seiten online gehen, ein Anfang wird eine Support-
Page f&uuml;r Entwickler machen, um jenen zu verdeutlichen, wie man sein eigenes
programmiertes Spiel auf dem CD32 zum laufen bekommt. Was man daf&uuml;r braucht
und wie es denn nun genau geht, genau das werdet Ihr dort erfahren.
Na, seid Ihr auf den Geschmack gekommen und wollt Euch auch ein CD32
kaufen, kein Problem, schaut doch einfach in unserem Kleinanzeigen-Markt
nach, vielleicht werdet Ihr f&uuml;ndig.
</P>
<P>
Ich m&ouml;chte an dieser Stelle einen Aufruf starten, wenn Ihr CD32-User seid
und Informationen rund um das CD32 erfahren habt, oder Ihr einen H&auml;ndler
kennt, der noch Soft- wie Hardware f&uuml;r das CD32 im Angebot hat, wie auch
Softwareprogrammierer, die Software f&uuml;r die Konsole entwickeln, teilt sie
uns bitte mit.
</P>
<P>
Es w&uuml;rde uns freuen, wenn das Logo der CD32-Allianz auch bald Eure
Homepage zieren w&uuml;rde. Ich bitte um Kontakt.
</P>
<P>
Software-Entwickler aufgepasst, Ihr habt ein Spiel f&uuml;r das CD32 entwickelt
und m&ouml;chtet es jetzt der breiten Masse der CD32-User zug&auml;nglich machen
und wisst nicht wie, kein Problem, tretet einfach mit uns in Kontakt und
schon bald k&ouml;nnte Euer Produkt in den Verkaufsregalen verschiedener
H&auml;ndler stehen. Auch dahingehend bitte ich um Kontaktaufnahme, um weitere
Konditionen zu besprechen.
</P>
<P>
Ein Software-Produkt, das von der CD32-Allianz vertrieben wird, wird
&quot;powered by CD32-Allianz&quot;.
</P>
<P><B>Kontakt: <A HREF="mailto:CD32-Allianz@gmx.de">CD32-Allianz@gmx.de</A></B></P>
<P><B>Thorsten Sch&ouml;lzel&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
