<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Gedanken zum Amiga (von Gerd Engelmann)</H2>
<P>
&raquo;Seit 1989 nutze ich nun schon den Amiga, habe ihn als schnellen, einfach
zu bedienenden Computer sch&auml;tzen gelernt. Was den Amiga ausmacht ist f&uuml;r
mich in erster Linie das schlanke Betriebssystem, die Hardware ist dabei
relativ nebens&auml;chlich. Letztendlich macht es f&uuml;r mich keinen Unterschied,
ob die Turbocalc-Tabelle nun von einem Motorola-68k-Prozessor, von einem
PPC oder gar einem Intelchip berechnet wird. Wenn es das Amiga-OS im
gleichen Umfang und mit der gleichen Geschwindigkeit f&uuml;r andere Plattformen
geben w&uuml;rde, w&auml;re es mir recht. Leider ist das nicht der Fall, weshalb ich
weiterhin meinen alten A2000 benutze.
</P>
<P>
Mal im Ernst: Ich nutze neben meinem Amiga noch einen schnellen PC, den ich
inzwischen mit verschiedenen Betriebssystemen vergewaltige.
</P>
<P>
Windows ist ja klar, daneben habe ich noch Linux installiert und seit
einigen Monaten auch noch BeOS. Auf dem Amiga nutze ich auch per Emulation
den Mac mit MacOS 8.0.
</P>
<P>
Doch die meisten Sachen mache ich nach wie vor mit dem Amiga. Irgendwie
komisch. Warum?
Nun, &uuml;ber Windows brauche ich wohl nur wenig Worte verlieren, wie Win 3.11
zum Standard-BS wurde, ist mir bis heute nicht klar. Von Win 9x ganz zu
schweigen. Die Ans&auml;tze sind jedesmal nicht schlecht, nur an der
Realisierung scheitert es dann doch. In Win 9x sind viele Sachen
integriert, die ich mir f&uuml;r den Amiga auch w&uuml;nschen w&uuml;rde. Aber der gesamte
Aufbau von Windows ist das letzte.
</P>
<P>
Als User beh&auml;lt man keinen &Uuml;berblick &uuml;ber das System, da es (meiner Meinung
nach) v&ouml;llig chaotisch aufgebaut ist. Selbst Profis haben Probleme damit.
Linux ist f&uuml;r Leute, die gerne experimentieren eine feine Sache, nur f&uuml;r
den normalen Anwender nicht zu gebrauchen. Das sage ich als jemand, der
sich ganz gut auskennt mit Linux. Nur sehe ich eben auch die Schw&auml;chen. Es
ist immer noch zu kompliziert, Linux zu installieren, vom nutzen des
Systems ganz zu schweigen. Wie gesagt, absolut super f&uuml;r Freaks.
MacOS, edel, cool und eine Alternative zum AmigaOS!? Es gef&auml;llt mir ganz
gut und ist wirklich narrensicher, so sollte es sein. Nur, wo ist das
Multitasking????
Wer intensiv vom MT auf dem Amiga Gebrauch macht wie ich, wird wissen, was
ich meine. Auch wenn man ein wenig mehr in die Tiefen des Betriebssystems
schauen will, macht es einem das MacOS nicht leicht.
</P>
<P>
Doch nun zu BeOS: Das ist das, was ich mir w&uuml;nschen w&uuml;rde. Es kommt dem
AmigaOS am n&auml;chsten, es ist sehr schnell, macht Multitasking in Vollendung
und sieht modern aus. Leider gibt es noch zu wenig Anwendungen und auf dem
Amiga l&auml;uft es auch nicht.
</P>
<P>
Womit mir nur der Amiga &uuml;brigbleibt. Ich surfe lieber mit dem Amiga durchs
Netz, schreibe meine E-Mails lieber mit YAM als mit Outlook und fast alles
andere mache ich auch lieber mit dem Amiga. Den PC nutze ich eigentlich
haupts&auml;chlich f&uuml;r Rechenintensive Sachen, also MP3-coden und Raytracen.
Es macht einfach Spa&szlig;, mit dem Amiga zu arbeiten, mit dem PC ist es nur
Frust, leider.
</P>
<P>
Wer nun sagt, es macht keinen Sinn mehr, mit dem Amiga zu arbeiten, den
kann ich nicht verstehen. Wer einen gut ausgestatteten Rechner hat, kann
doch alles damit machen, was man sich so vorstellen kann. Sicher w&auml;re es
sch&ouml;n, wenn es noch mehr gute Software geben w&uuml;rde und auch auf einen neuen
Amiga warte ich sehns&uuml;chtig, aber bis dahin komme ich mit meinem Rechner
gut hin.
</P>
<P>
Ich hoffe, dass die neuen Besitzer der Amigarechte etwas tolles auf die
Beine stellen, aber es muss vergleichbar mit dem bisherigen bleiben, es
muss ganz einfach Spa&szlig; machen, damit zu arbeiten.
</P>
<P>
Dies alles sind meine pers&ouml;nlichen Meinungen. Ich m&ouml;chte damit keine
Amiga-PC-Diskussion in Gang setzen, sondern nur mal meine Gedanken kundtun.
Ich habe nichts gegen andere Meinungen, wer sie mir mitteilen m&ouml;chte, sei
hiermit aufgefordert, es zu tun.
</P>
<P>
[Bitte schickt eure Gedanken an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> ; Anm. d. Red.]
</P>
<P><B>Gerd Engelmann &lt;<A HREF="mailto:G.Engelmann@t-online.de">G.Engelmann@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
