<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Vorstellung der neuen Preise</H2>
<P>
Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:
</P>
<P>
Frank Weber hat sein Programm AFiloFaxPro f&uuml;r das Gewinnspiel zur Verf&uuml;gung
gestellt:
</P>
<P>
&raquo;AFiloFaxPro managet Ihr t&auml;gliches Leben. Dazu bietet es eine umfangreiche
Terminplanerfunktion und dar&uuml;ber hinaus Features wie einen elektronischen
Notizblock oder Statistikfunktionen, die u.a. die t&auml;gliche Computerlaufzeit
protokollieren. (Unterst&uuml;tzt MUI)&laquo;
</P>
<P>
Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.
</P>
<P>
Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:
</P>
<P>
Frank Weber<BR>
Schlizstra&szlig;e 53<BR>
74076 Heilbronn<BR>
Deutschland<BR>
</P>
<P><B>E-Mail: <A HREF="mailto:fweber@amigaworld.com">fweber@amigaworld.com</A></B></P>
<P>
Andreas Falkenhahn hat sein Programm NewInstaller f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:
</P>
<P>
&raquo;Es gibt viele Software Pakete im Aminet ohne Installationsprogramm,
obwohl Commodore das Installerprogramm entwickelt hatte, welches
eine einfach-zu-bedienende grafische Benutzeroberfl&auml;che bietet und
dazu noch powervolle Funktionen hat.
</P>
<P>
Aber viele Autoren haben nicht die Zeit oder sind zu faul ein
Installer Skript zu schreiben. Viele fanden es auch zu
schwer.
</P>
<P>
Diese Zeit ist jetzt vorbei. NewInstaller macht es jedem
Autor m&ouml;glich, ein Installskript in seinem Software Paket mitzuliefern.
Aber stop - Sie m&uuml;ssen das Skript nicht selber schreiben - NewInstaller
macht das alles automatisch.
</P>
<P>
Die einzige Sache, die Sie noch machen m&uuml;ssen, ist ein Piktogramm mit
dem Standardprogramm NewInstaller in Ihr Software Paket zu f&uuml;gen.
Au&szlig;erdem k&ouml;nnen Sie weitere Optionen in den Tooltypes
einstellen.
</P>
<P>
NewInstaller ist voll ins Internet integriert. Sie brauchen nur
zwei Tooltypes hinzuzuf&uuml;gen und schon kann der Benutzer Ihr Programm
online registrieren wenn er m&ouml;chte. Oder f&uuml;gen Sie einen Tooltype
hinzu und er kann gleich Ihre Homepage im Internet besuchen!
</P>
<P>
Aber es geht noch weiter: NewInstaller kann die Installation zu einem
Multimedia Event der Extraklasse machen. Er kann verschiedene Bilder
anzeigen und Samples und Module abspielen. Dabei spielt &uuml;berhaupt keine
Rolle, ob die Installation auf AGA/ECS/OCS/Grafikkarten oder wei&szlig;
der Geier was l&auml;uft...Die Bilder werden immer bestm&ouml;glichst angezeigt
und den Workbench Farben sowie der Workbench Gr&ouml;&szlig;e perfekt angepasst!
</P>
<P>
Viele Dinge k&ouml;nnen in den Tooltypes ge&auml;ndert werden.
</P>
<P>
Ich entschied mich NewInstaller als Shareware zu ver&ouml;ffentlichen.
</P>
<P>
Wenn Sie sich registrieren lassen und Ihr Keyfile per Email m&ouml;chten, kostet
das 10 DM. Soll es per Post auf Diskette geschickt werden erh&ouml;ht sich
der Preis auf 15 DM!
</P>
<P>
Eine Demoversion (bis auf Nervrequester voll funktionst&uuml;chtig) k&ouml;nnen
Sie von der Airsoft Softwair Homepage (<A HREF="http://airsoft.home.pages.de/" TARGET="_top">http://airsoft.home.pages.de/</A>)
oder aus dem Aminet laden (util/wb/NewInstaller1_5.lha).&laquo;
</P>
<P>
Desweiteren hat Thomas Hasemann die Netzwerk- und
Internetanbindungssoftware AmiTCP/IP zur Verf&uuml;gung gestellt.
</P>
<P>
Vielen Dank an alle Preisstifter!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
