<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses11.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Ist der Amiga-Hardwaremarkt noch zu retten?
</P>
<P>
In Sachen Software sieht es f&uuml;r die derzeitige Amiga-Linie schon nicht
rosig aus - in den verschiedenen Anwendungsbereichen klaffen immer gr&ouml;&szlig;ere
L&uuml;cken, die nicht mehr ausgef&uuml;llt werden. Bestes Beispiel ist das Gebiet
der Textverarbeitungen. Final Writer wurde ebenso wie Wordworth vor
geraumer Zeit eingestellt, und von der n&auml;chsten AmigaWriter-Version
existiert bislang nur eine Ank&uuml;ndigung - das jedoch schon seit einiger
Zeit.
</P>
<P>
Aber wenigstens erscheint &uuml;berhaupt noch Software. Denn noch schlechter
sieht es auf dem Hardware-Markt aus. Was ist denn, abgesehen von
Schnittstellenkarten diverser Hersteller, in den letzten Monaten an Amiga-
Hardware erschienen? Zumindest mir f&auml;llt auf die Schnelle &uuml;berhaupt nichts
ein. Die Situation w&auml;re noch ertr&auml;glicher, wenn zumindest die in letzter
Zeit auf den Markt gebrachten Produkte lieferbar w&auml;ren - nur herrscht hier
leider ebenfalls Ebbe. Ein gutes Beispiel ist sicher DCE, das vor kurzem
Lizenzen zur Fertigung diverser Phase5-Produkte erworben hat. Erh&auml;ltlich
sind die Erweiterungen bislang aber nicht.
</P>
<P>
Was es dagegen in H&uuml;lle und F&uuml;lle gibt, sind Ank&uuml;ndigungen. Angefangen von
Village Tronics 3D-AddOn f&uuml;r die Grafikkarte Picasso IV, &uuml;ber G3/G4-
PowerPC-Erweiterungen von f&uuml;nf verschiedenen Herstellern (wobei wir die
Phase5-Karten wohl abschreiben k&ouml;nnen) bis hin zu Amiga-kompatiblen bzw. -&auml;hnlichen
Computersystemen ist fast jeder Hardwarebereich vertreten.
Das Problem nur: Es kommt nichts.
</P>
<P>
Nun, zumindest die PowerPC-G3-Reihe von Metabox gibt ab und zu ein
Lebenszeichen von sich, so da&szlig; wir in diesem Fall wohl mit einem Erscheinen -
wann auch immer - rechnen k&ouml;nnen. &Auml;hnlich ist die Lage wohl bei Village
Tronics 3D-AddOn. Wenigstens gibt das Unternehmen offen zu, dass ParaGlide
nicht die h&ouml;chste Priorit&auml;t genie&szlig;t, womit eine baldige Auslieferung des
Produkts jedoch weiterhin fraglich bleibt. So verh&auml;lt es sich aus meiner
Sicht auch bei der von TigerTronics angek&uuml;ndigten USB-Erweiterung - aus
einem ebenso einfachen wie einleuchtenden Grund: Wenn sich die Entwicklung
einer solchen Hard- und Softwarekombination einfach gestalten w&uuml;rde, g&auml;be
es l&auml;ngst entsprechende Produkte f&uuml;r den Amiga. Denn neu ist das Thema USB
ja nicht, daf&uuml;r aber um so popul&auml;rer.
</P>
<P>
Fazit: Trotz einiger weniger Lichtblicke ist die momentan au&szlig;erordentlich
d&uuml;stere Lage des Amiga-Hardwaremarktes nicht zu &uuml;bersehen. Und auch in
Zukunft ist wohl kaum mit einer deutlichen Besserung zu rechnen, eher im
Gegenteil, denn was fehlt, ist eine ausreichende Zahl an Anwendern, die die
Produkte auch kaufen. Um die zu erh&ouml;hen, bedarf es aber konkurrenzf&auml;higer
Rechner.
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses11.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
