<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Wasted Dreams 2
</LI>
</UL>
<P>
Digital Dreams Entertainment hat Wasted Dreams 2 f&uuml;r den Amiga angek&uuml;ndigt.
Der erste Teil erschien letztes Jahr und war ein gro&szlig;er Erfolg.
</P>
<UL>
<LI> Neues von Alive Mediasoft
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">F&uuml;r das Jahr 2000 hat Alive Mediasoft neue PC Portierungen angek&uuml;ndigt.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Es sind Konvertierungen f&uuml;r Descent 2, Elite 3 und Quake World vorgesehen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Alle Spiele werden auch den PPC und Warp3D unterst&uuml;tzen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Tales from Heaven
</LI>
</UL>
<P>
Epic Marketing hat bekanntgegeben, dass Tales from Heaven fertig ist und
sich im Presswerk befindet. Die ersten Exemplare d&uuml;rften sehr bald
verf&uuml;gbar sein. Tales from Heaven ist das spektakul&auml;re 3D Jump`n`Run
im Stil von Super Mario 64.
</P>
<UL>
<LI> Nightlong
</LI>
</UL>
<P>
F&uuml;r die PPC Portierung von clickBOOM sind es 91 Vorbestellungen
eingegangen.
</P>
<P>
Wer Interesse an diesem Spiel hat, sollte dringend eine Vorbestellung
abgeben, damit die Entwicklung gesichert ist. Auf der clickBOOM Homepage
wurde jetzt auch ein neuer Trailer des Spiels zum Download bereitgestellt.
</P>
<UL>
<LI> Crystal Software bringt Amiga Spiele in &uuml;ber 30000 L&auml;den weltweit
</LI>
</UL>
<P>
&quot;Wie denn das?&quot;, werden jetzt wohl alle fragen. Der Trick besteht darin,
dass auf einer CD-ROM sowohl Amiga- als auch PC-Version vorhanden sind.
Die CD-ROMs kommen dann also in ganz normale PC-L&auml;den.
</P>
<UL>
<LI> Quake Portierungen
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Im Aminet sind einige Amiga-Portierungen von Quake zu finden, die auch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">PPCs mit WarpOS unterst&uuml;tzen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> SeaSide
</LI>
</UL>
<P>
Die englische Version von SeaSide ist diesen Monat beim APC&amp;TCP
erschienen.
</P>
<UL>
<LI> Simon the Sorcerer 2
</LI>
</UL>
<P>
Epic Marketing hat bekanntgegeben, dass rund 400 Vorbestellungen f&uuml;r
Simon the Sorcerer 2 eingegangen sind. Um das Spiel f&uuml;r den Amiga
zu ver&ouml;ffentlichen, m&uuml;ssten es allerdings 500 Vorbestellungen sein.
Wer also noch nicht bestellt hat, sollte dies so schnell wie m&ouml;glich
tun.
</P>
<UL>
<LI> Virtual Ball Fighters Preview ver&ouml;ffentlicht
</LI>
</UL>
<P>
Diesen Monat wurde ein Preview von Virtual Ball Fighters ver&ouml;ffentlicht.
Au&szlig;erdem haben die Entwickler von XTeam Software bekanntgegeben, dass
das Spiel bereits fertig ist und von Epic Marketing ver&ouml;ffentlicht wird.
</P>
<UL>
<LI> Subwar 2050 zum legalen Download
</LI>
</UL>
<P>
Der Amiga Sector One hat das Spiel Subwar 2050 von Microprose in der
AGA Version zum freien Download bereitgestellt. Es kann von
<A HREF="http://www.emucamp.com/amiga/" TARGET="_top">http://www.emucamp.com/amiga/</A> geladen werden.
</P>
<UL>
<LI> WHDLoad
</LI>
</UL>
<P>
Die WHDLoad Webseite ist komplett umgezogen. Auf <A HREF="http://www.whdload.org/" TARGET="_top">http://www.whdload.org/</A>
befindet sich jetzt das komplette Archiv von HD Installern. Au&szlig;erdem
wurde WHDLoad Version 10.5 ver&ouml;ffentlicht.
</P>
<UL>
<LI> Neues von Darkage Software
</LI>
</UL>
<P>
Darkage Software hat zwei neue Spiele angek&uuml;ndigt: Powerball, ein
einfaches Puzzlespiel, und eine neue CD-ROM namens Amiga Classix 2,
auf der klassische Amiga Spiele vorhanden sein sollen. Amiga Classix 2
erscheint Ende Februar und Powerball soll Ende M&auml;rz verf&uuml;gbar sein.
Vertreiber ist Epic Marketing.
</P>
<UL>
<LI> Neue Spiele von Epic Marketing
</LI>
</UL>
<P>
Epic Marketing hat zwei neue CD-ROM Kollektionen ver&ouml;ffentlicht:
Bei der CD-ROM Adventures Lair handelt es sich um eine CD-ROM mit
zehn kompletten Grafikadventures, die allerdings alle den
Public Domain Status besitzen. Auf der anderen CD-ROM namens
Mutantology finden sich ebenfalls 10 Spiele wieder, darunter
einige kommerzielle Spiele von Mutation Software (Tin Toy
Adventure, Tommy Gun etc.).
</P>
<UL>
<LI> Hyperion Software sucht Programmierer
</LI>
</UL>
<P>
Hyperion Software sucht f&uuml;r zuk&uuml;nftige Projekte einen C/C++
Programmierer. Erfahrungen mit Warp3D, OpenGL und PowerPC
Programmierung w&auml;ren w&uuml;nschenswert.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
