<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Reviews</H2>
<H3>Immortal</H3>
<P>
Und hier mal ein eher ungew&ouml;hnlicher Test eines ungew&ouml;hnlichen Produktes:
Im Dezember 1999 wurde von Ruben Monteiro eine Audio CD-ROM ver&ouml;ffentlicht,
auf der einige der besten Amiga Kompositionen vorhanden sein sollten. Alle
Musikst&uuml;cke sollen mit neuester Studiotechnik neu aufgenommen worden sein
und jetzt in bester Qualit&auml;t zur Verf&uuml;gung stehen. Dies hat gereicht, um
mich als alten Amiga Protracker Mod Fan, zu begeistern und mir die CD
mal genauer anzusehen.
</P>
<P>
Die CD kommt professionell gestaltet und gepresst (!) daher, was in
diesen Zeiten sicherlich nicht mehr selbstverst&auml;ndlich ist. Solch eine
CD k&ouml;nnte man sicherlich genauso auch im Einzelhandel vorfinden, da
sie sehr professionell gestaltet wurde. Auf der CD befinden sich neben
einer Datenspur insgesamt 18 Musikspuren mit bekannten Remakes von
Amiga Spielen.
</P>
<P>
Auf der Datenspur findet man ein unterhaltsames, gerendertes MPG Video,
welches einen genervten Windows User zeigt, wie er seinen alten Amiga
wieder herauskramt. Das Video demonstriert, dass der Amiga einfach
&quot;unsterblich&quot; ist und erkl&auml;rt somit den CD Titel &quot;Immortal&quot;. Au&szlig;erdem
sind auf der Datenspur reichlich Informationen zu den Musikst&uuml;cken
vorhanden. Allesamt im HTML Format. Auch diese Informationen wurden
professionell gestaltet.
</P>
<P>
Folgende Musikst&uuml;cke findet man nun auf den Musikspuren:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Spur 2:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - Intro&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 3:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - Eerie Forests&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 4:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - The Cavern&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 5:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - Beast`s Stronghold&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 6:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - Underwater&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 7:&nbsp;</TD><TD VALIGN="TOP">Shadow of the Beast - Game Over&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 8:&nbsp;</TD><TD VALIGN="TOP">Dafel: Bloodline&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 9:&nbsp;</TD><TD VALIGN="TOP">Project X `99&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 10:&nbsp;</TD><TD VALIGN="TOP">Superfrog&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 11:&nbsp;</TD><TD VALIGN="TOP">The Final Odyssey&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 12:&nbsp;</TD><TD VALIGN="TOP">Blockhead II&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 13:&nbsp;</TD><TD VALIGN="TOP">The Strangers&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 14:&nbsp;</TD><TD VALIGN="TOP">Harlequin&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 15:&nbsp;</TD><TD VALIGN="TOP">Utopia&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 16:&nbsp;</TD><TD VALIGN="TOP">Space Station 3000&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 17:&nbsp;</TD><TD VALIGN="TOP">Gunbee F-99&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 18:&nbsp;</TD><TD VALIGN="TOP">Turrican&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spur 19:&nbsp;</TD><TD VALIGN="TOP">Alien Breed 3D&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Alle Musikst&uuml;cke befinden sich in astreiner Qualit&auml;t auf der CD.
Hier h&ouml;rt man wirklich, dass sie komplett neu aufgenommen und
vertont wurden. Auffallend ist allerdings, dass teilweise einige
recht unbekannte Titel mit in die Kollektion aufgenommen wurden,
wie z.B. Blockhead II und Harlequin. Da h&auml;tte es sicherlich noch
bessere Musikst&uuml;cke gegeben. Aber vielleicht gibt es die ja bald
auf einem Nachfolger zu h&ouml;ren.
</P>
<P>
Abschlie&szlig;end hinterl&auml;sst diese CD-ROM einen recht guten Eindruck.
Professionelle Gestaltung der CD-ROM und Qualit&auml;t der Musikst&uuml;cke
k&ouml;nnen &uuml;berzeugen. F&uuml;r alle Amiga Musik-Fans ist diese CD-ROM
ein praktisches Muss, auch wenn der Preis mit etwa 40 DM vielleicht
etwas hoch angesetzt ist. Aber wenn man die CD dann in den H&auml;nden
h&auml;lt, kann man ihn doch einigerma&szlig;en nachvollziehen. Kommen wir
also zur Wertung, die nat&uuml;rlich jetzt etwas anders aufgestellt ist,
als bei Spielen:
</P>
<P>
<A HREF="img/Immortal1.jpg"><IMG SRC="thumb/Immortal1.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Immortal2.jpg"><IMG SRC="thumb/Immortal2.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<TABLE BORDER WIDTH=80%><TR><TD><PRE>

  Name:          Immortal                                                
  Hersteller:    Monteiro Music, Ruben Monteiro, Portugal,               
                 <A HREF="http://www.monteiro-music.com" TARGET="_top">http://www.monteiro-music.com</A> (Best. &uuml;. Internet m&ouml;gl.) 
  Preis:         $18.99 US-Dollar                                        
  Datentr&auml;ger:   1 CD                                                    
  Genre:         Musik CD               | Spieler: -                     
  Sprache:       englisch               | Anleitung: englisch            
  System:        OCS/ECS/AGA            | CD-ROM                         
                                                                         
  Fazit:         Professionell erstellte Musik CD, die f&uuml;r Amiga Musik   
                 Fans wirklich zu empfehlen ist.                         
                                                                         
  Wertung:                                                               
                             Grafik:     ----                            
                             Sound:      8/10                            
                             Handhabung: 7/10                            
                             Spielspa&szlig;:  ----                            
                             GESAMT:      75%                            

</PRE></TD></TR></TABLE>
<H3>Foundation - The Directors Cut (von Michael Scholz)</H3>
<P>
Der Ort: K&ouml;ln, das Datum, 13. November 1999. Fast exakt ein Jahr, nachdem
ich auf der Computer `98 in K&ouml;ln, dass damals sehns&uuml;chtig erwartete
Foundation erstand, schlug ich wieder zu und leistete mir das Update auf
Foundation - The Directors Cut.
</P>
<P>
Wieder in heimatlichen Gefilden angekommen, geriet Foundation erst einmal
in Vergessenheit, da auf der Messe auch noch WipeOut 2097 in meinen
Einkaufsbeutel wanderte. Doch kurze Zeit sp&auml;ter des WipeOut Spielens
&uuml;berdr&uuml;ssig, erinnerte ich mich an eine weitere CD, die ich auf der Messe
erstanden hatte, richtig, es handelte sich um Foundation. Also schnell
ausgepackt und angeschaut, etwas skeptisch betrachtete ich jene CD, denn es
handelte sich dabei um keine aus dem Presswerk, nein, es ist eine
&quot;selbstgebrannte&quot;, welche mich blau angrinste (ich hoffe doch stark, dass
das so i.O. ist, schlie&szlig;lich habe ich sie bei EPIC gekauft). Na gut dachte
ich mir, nicht verzagen, CD in die Schublade wagen. Was dann auch geschah.
</P>
<P>
Die erste &Auml;nderung, die zu sehen war, die CD besitzt ein Newicon als
Piktogramm, nach dem obligatorischen Doppelclick auf das Icon &ouml;ffnet sich
die Schublade, und erfreulicherweise geht es da weiter mit Newicons, auch
programmtechnisch hat sich einiges getan, war Foundation damals noch
Version 1.12 , l&auml;chelt mich hier schon mal die Version 1.25 an, und was
noch erfreulicher ist, es besteht keine Trennung mehr zwischen AGA und RTG,
man kann Foundation nun einheitlich &uuml;ber das Icon starten, und man ist
drin, nat&uuml;rlich nur, wenn man vorher in den Foundation-Prefs die
entsprechende Aufl&ouml;sung definiert hat. Es ist bei Foundation DC auch nicht
mehr n&ouml;tig, das Spiel auf die Platte zu bannen, nein, es ist jetzt direkt
von CD aus startbar, nat&uuml;rlich ist es weiterhin m&ouml;glich, Programmteile oder
auch das ganze Programm auf die Platte zu schaufeln. Man mu&szlig; lediglich die
FoundationPrefs in die gew&uuml;nschte Directory auf die Festplatte ziehen, die
Prefs starten und in den Unterpunkt Installation gehen, die gew&uuml;nschten
Programmpakete selektieren und auf Install clicken, und ab geht er, der
Peter.
</P>
<P>
<A HREF="img/Foundation1.jpg"><IMG SRC="thumb/Foundation1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
So nun aber zum Spiel, vorausgesetzt wird nat&uuml;rlich erst einmal ein Amiga,
dieser sollte idealerweise &uuml;ber eine Grafikkarte verf&uuml;gen, aber f&uuml;r den
Anfang tut es auch ein AGA Modus, f&uuml;r die RTG Modi ist es egal, ob man nun
Anh&auml;nger von CybergraphX oder Picasso96 ist, es werden beide unterst&uuml;tzt.
Als Prozessor wird Minimum ein 68030 gefordert , besser ist es aber, wenn
ein 040 oder 060 im entsprechenden Rechner seine Arbeit verrichtet. F&uuml;r den
guten Ton sorgt, je nach dem wie man es einstellt, die original Paula oder
eine AHI-Installation, allerdings hab ich so meine Probleme, wenn ich
Foundation mit AHI-Sound spiele, da kommt es &ouml;fter mal zu Audioh&auml;ngern, so
dass ich auf die gute alte Paula Tonausgabe zur&uuml;ckgegriffen habe,  die
meines Erachtens keinen Qualit&auml;tsunterschied erh&ouml;ren l&auml;sst, zumal nebenbei
noch die CD-Audiotracks abgespielt werden (k&ouml;nnen). Weiterhin sollte der
Rechner noch &uuml;ber mindestens 6 MegaByte Arbeitsspeicher verf&uuml;gen, was aber
angesichts der Speicherhungrigen Wintel-Rechner Games geradezu l&auml;cherlich
ist. Oder seid ihr anderer Meinung ???
</P>
<P>
Hat man das Spiel erst einmal gestartet, wird man von einer komplett
gerenderten Intro begr&uuml;&szlig;t, die man in den Prefs auch deaktivieren kann. Ist
man erst einmal im Hauptmen&uuml;, hat man die Wahl. Enweder entscheidet man
sich f&uuml;r ein Eroberungsspiel, von denen 40 zur Verf&uuml;gung stehen, jedoch
hintereinander, also nix mit freier Auswahl, nein ganz nach dem Siedler
Prinzip, sch&ouml;n ein Level nach dem anderen, oder man entscheidet sich f&uuml;r
ein &quot;gew&ouml;hnliches&quot; Spiel, in dem man sich dann aussuchen kann, auf welchem
Terrain gegen wieviele Gegner und um welches Ziel man k&auml;mpft.
</P>
<P>
<A HREF="img/Foundation2.jpg"><IMG SRC="thumb/Foundation2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
M&ouml;glich ist zum Beispiel, dass man ganz alleine spielt oder gegen bis zu 3
Computer-Gegner, auf den Gel&auml;ndearten Sommer, Winter, D&uuml;ster und Lava mit
technischem Niveau 1 bis 4 sowie Grundausstattung Niedrig, Mittel oder
Hoch, um dann das Spielziel &quot;Feind vernichten&quot;, &quot;80% des Landes&quot; oder
&quot;Feind anz&uuml;nden&quot;, zu erreichen. Beim Eroberungsspiel bekommt man nat&uuml;rlich
seine Ziele vorgegeben, ich muss aber zugeben, dass ich selbst noch nicht
weiter als bis zum f&uuml;nften Scenario gekommen bin.
</P>
<P>
<A HREF="img/Foundation3.jpg"><IMG SRC="thumb/Foundation3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Zum Spielablauf ist eigentlich nicht sehr viel zu sagen, es funktioniert
ungef&auml;hr nach dem Prinzip, welches wir alle schon von &quot;Die Siedler&quot; kennen,
Minen bauen, um Rohstoffe zu f&ouml;rdern, Rohstoffe zu Gold oder Stahl
einschmelzen. Eine Farm bauen, um f&uuml;r Nahrung zu sorgen, Bauernh&auml;user
bauen, in denen die M&auml;gde wohnen, um f&uuml;r Nachwuchs zu sorgen, ein Kirche
(oder Krematorium), um die Verstorbenen in Magie zu verwandeln, die Magie
und Gold sowie andere Rohstoffe, Stein, Holz usw., um Geb&auml;ude zu zaubern.
</P>
<P>
<A HREF="img/Foundation4.jpg"><IMG SRC="thumb/Foundation4.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Ja richtig, hier werden die Geb&auml;ude nicht gebaut, wie bei den Siedlern,
hier kommt ein Zauberer vorbei, zaubert mal kurz, und schon steht das Haus,
also wenn man die entsprechenden Rohstoffe hat, ist ein Geb&auml;ude schnell
errichtet, ebenfalls sind die Menschen hier auch wesentlich intelligenter,
sie brauchen keine Stra&szlig;en, um zu ihren Zielorten zu gelangen, allerdings
sehen sie proportional zu den Geb&auml;uden doch ein wenig gro&szlig; aus, aber das
kann man ja verkraften. Was ebenfalls noch positiv zu bemerken ist, ist die
M&ouml;glichkeit zu handeln, sollten bestimmte Rohtoffe einmal knapp sein, kann
man sie gegen andere, die man zuviel hat, eintauschen, und so doch noch den
Sieg davontragen. Bei den Siedlern war man ja auf eine funktionierende
Versorgung mit allen ben&ouml;tigten Rohstoffen angewiesen, hier kann dann schon
mal der eine oder andere Rohstoff ausgehen, und man kommt trotzdem noch
&uuml;ber die Runden. Wenn man eine Mission erf&uuml;llt hat, bekommt man hinterher
die Statistik angezeigt, wieviele Leute man selbst oder der Gegner hatte,
wievele Jahre ben&ouml;tigt wurden, um die Mission zu erf&uuml;llen, die Anzahl der
get&ouml;teten Gegner und die eigenen Verluste.
</P>
<P>
<A HREF="img/Foundation5.jpg"><IMG SRC="thumb/Foundation5.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Das Gameplay ist gegen&uuml;ber Foundation Geschwindigkeitsm&auml;&szlig;ig stark
verbessert worden, trotzdem kann ich keinem empfehlen, Foundation DC in
einer 1024x768 Aufl&ouml;sung zu starten, bei mir ruckelte in dieser Aufl&ouml;sung
das Game nur so &uuml;ber den Bildschirm, trotz eines 060ers, der in meinem
4000er arbeitet, der PPC wird ja leider nicht unterst&uuml;tzt, vielleicht
&auml;ndert sich das ja mit dem n&auml;chsten Game Foundation`s Edge, welches
bekanntlich dieses Jahr erscheinen soll. Ebenfalls w&auml;re noch die Mouse-
Steuerung zu bem&auml;ngeln, diese ist meiner Meinung nach viel zu sensibel
gestaltet, einmal kurz etwas angeclickt, und man ist trotzdem schon drei
Men&uuml;s zu weit, au&szlig;erdem ist die Spitze des Mousepfeils nicht 100%tig
identisch mit dem, was man anclickt. Das angeclickte Objekt befindet sich
immer ein klein wenig links neben dem Pfeil, das hei&szlig;t, man kann schon mal
aus Versehen in das falsche Men&uuml; gelangen oder das falsche Objekt
selektieren. Positiv zu bewerten ist die M&ouml;glichkeit, Foundation DC in
einem Fenster auf der Workbench spielen zu k&ouml;nnen, und dass das Spiel im
Multitasking-Modus l&auml;uft, ich habe nebenbei den NCoder auf dem PPC arbeiten
lassen und keinerlei Geschwindigkeitseinbu&szlig;en bemerkt, sicherlich ist es
auch problemlos m&ouml;glich, andere Programme, wie zum Beispiel Tornado 3D
nebenbei ihre Arbeit auf dem PPC verrichten zu lassen, w&auml;hrend man
gem&uuml;tlich ein paar Runden Foundation auf dem 68k spielt.
</P>
<P>
Leider konnte ich aber auch in dieser Version keine M&ouml;glichkeit entdecken,
gegen mehrere menschliche Gegner zu spielen, weder ein Splitscreen
Zweispielermodus, wie von &quot;Die Siedler&quot;,  noch eine M&ouml;glichkeit &uuml;ber ein
TCP/IP-Netzwerk, egal ob nun lokal oder &uuml;ber das Internet. Naja, vielleicht
kann ja der Nachfolger damit aufwarten.
</P>
<P>
Abschlie&szlig;end bleibt zu sagen, dass es sich f&uuml;r diejenigen, welche
Foundation schon besitzen, nicht lohnt, sich auch noch Foundation DC zu
kaufen, da sich am Spiel nichts ge&auml;ndert hat und ein kostenloser Patch im
Web erh&auml;ltlich ist. Aber f&uuml;r alle, die noch keines von beiden in ihrem
Besitz haben und &uuml;ber die entsprechenden Systemvoraussetzungen verf&uuml;gen,
kann ich es uneingeschr&auml;nkt empfehlen, zumal der Preis von 49,- DM unerh&ouml;rt
g&uuml;nstig ist, Interesse f&uuml;r Strategiespiele nat&uuml;rlich vorausgesetzt.
</P>
<P><B>Bezugsquelle:</B></P>
Epic Marketing<BR>
Hirschauer Stra&szlig;e 9<BR>
72070 T&uuml;bingen<BR>
Tel. 07071/40 04 92<BR>
Fax: 07071/40 04 93<BR>
E-Mail: <A HREF="mailto:epic@swol.de">epic@swol.de</A><BR>
Internet: <A HREF="http://www.epicmarketing.de" TARGET="_top">http://www.epicmarketing.de</A><BR>
<P>
Preis: 49 Mark.
</P>
<P><B>Michael Scholz &lt;<A HREF="mailto:MGF-Design@gmx.net">MGF-Design@gmx.net</A>&gt;</B></P>
<H3>Max Rally (von Christian Keller)</H3>
<P>
Mit Max Rally ist ein neues Buggy-Rennen im Stile von Micro Machines auf
dem Amiga-Markt. Bis zu vier Spieler k&ouml;nnen dabei in der Draufsicht durch
26 Levels in vier Umgebungen gurken und versuchen, gegen seine kleinen
Mitstreiter oder gegen die Zeit zu k&auml;mpfen. Die niedrigen
Systemanforderungen lassen auf keine grafischen Sensationen schlie&szlig;en,
fortschrittlich ist allerdings die M&ouml;glichkeit, zwei Amigas per
Null-Modem-Kabel miteinander zu verbinden und so an zwei Bildschirmen zu
spielen.
</P>
<P><B>Das Spiel</B></P>
<P>
Das zwei Disketten umfassende Spiel kommt in einem optisch gelungenen
CD-Cover daher, auf welchem neben dem gerenderten Tourenwagen auf der
Vorderseite auch das lustige &quot;FLOPPY disk&quot; Logo im Stile des &quot;COMPACT disc
DIGITAL AUDIO&quot; Logo auff&auml;llt. Nach einer gedruckten Anleitung sucht man
vergeblich, allerdings ist eine ausf&uuml;hrliche Readme-Datei beigelegt. Zum
Spielen ist diese jedoch nicht direkt n&ouml;tig, und auch die
Festplatteninstallation ist idiotensicher (3 MB werden ben&ouml;tigt, aber auch
der Start direkt von Diskette ist m&ouml;glich).
</P>
<P>
Zur Auswahl stehen drei verschiedene Spielmodi. Im &quot;Championship&quot; tritt man
im Rennen gegen drei Computergegner an. Man darf sich Sieger nennen, wenn
man in allen 26 Leveln, die man in beliebiger Reihenfolge durchspielen
kann, als erster &uuml;ber die Ziellinie f&auml;hrt. Wird man zweiter oder
schlechter, gilt das Level als nicht gemeistert und muss erneut gefahren
werden. Nach dem f&uuml;nften nicht gewonnenen Rennen ist der Championship
vorbei. Als kleiner zus&auml;tzlicher Ansporn wird nach jedem Rennen die beste
Rundenzeit ermittelt, wobei pro Strecke eine Zeit in der Hall of Fame
landet. Einfallsreich ist, dass man diese dann sogar speichern und und in
einem anderen Max Rally Spiel wieder laden kann, wobei beim Laden nur die
besseren Highscores &uuml;bernommen werden. Um diese Rekorde noch zu optimieren,
ohne st&auml;ndig von anderen Buggies genervt zu werden, kann man im &quot;Speed
Trial&quot; einsam seine Runden drehen, w&auml;hrend die beste Rundenzeit
festgehalten wird. Erw&auml;hnenswert sind dar&uuml;ber hinaus auch die &quot;Challenge&quot;-
Level im Championship. Dabei f&auml;hrt man alleine durch eine Weltraumgegend
und muss gewisse Stationen anfahren. Der Bildschirm bewegt sich
w&auml;hrenddessen unabh&auml;ngig vom Fahrer gleichm&auml;&szlig;ig, so dass man stets
aufpassen muss, nicht zu langsam zu sein, da man sonst quasi &uuml;berrollt wird
und das Level als verloren gilt.
</P>
<P>
F&uuml;r Leute, die gerne zweisam oder sind, sind die Multi-Player-Rennen
angesagt. Im Mehrspielerrennen wird der Bildschirm in zwei Teile geteilt,
leider ist damit aber nur zwei Spielern gleichzeitig gedient. Ist
allerdings auch der Amiga &quot;zweisam&quot;, kann man zwei Rechner miteinander
verbinden und so insgesamt vier Leute in das Geschehen verwickeln. Dazu
sind aber zwei gekaufte Versionen von Max Rally n&ouml;tig. Eine andere und
neuartige Mehrspielerm&ouml;glichkeit ist das Battle in Max Rally. Hier gilt es,
seinen Konkurrenten davonzufahren. Alle Spieler fahren gleichzeitig in
einem Bildschirm, wobei die &quot;Kamera&quot; stehts auf den ersten gerichtet ist.
Wer es schafft, als einziger auf dem Schirm &uuml;brig zu bleiben, erh&auml;lt einen
Punkt, von denen man f&uuml;nf zum Sieg bekommen muss.
</P>
<P><B>Meine (hochwertigen) Erfahrungen</B></P>
<P>
&quot;Bin ich schon drin oder was?&quot; kann man wohl meine erste Reaktion auf das
Spiel beschreiben, wobei dies weniger als &quot;Das ist ja einfach&quot;, sondern
vielmehr als &raquo;Ist das alles?&laquo; zu verstehen ist. Zumindest von der
Spielgrafik erwartet man &uuml;blicherweise von neu erschienenen Spielen mehr
als nur durchschnittliches PD-Niveau, doch in dieser Hinsicht wird man
entt&auml;uscht. Da ist die AOL-Startseite durchaus noch faszinierender ;-( Doch
nichts f&uuml;r ungut, weniger kann oft mehr sein, auch (ja f&uuml;r meinen Geschmack
sogar gerade) PD-Games haben ihren Reiz, denn auf den Spielspa&szlig; kommt es
schlie&szlig;lich an, und so bin ich losgefahren. Doch auch auf den zweiten Blick
stellten sich bei mir noch keine Gl&uuml;cksgef&uuml;hle ein: Normale Steuerung (mit
Schlittern in den Kurven (falls verst&auml;ndlich ist, was ich damit meine)),
eine unspektakul&auml;re Strecke und auch sonst keine Highlights. Mehr als
Rechts/Links/Gas/Bremsen ist leider nicht m&ouml;glich. Einzige Besonderheit ist
der pro Rennen einmalige &quot;Turbo&quot;, der, wenn man ihn nicht schon zuvor aus
Versehen ausgel&ouml;st hat, den eigenen Wagen quasi von Null auf Hundertzehn in
ein paar Millisekunden beschleunigt. Die vier verschiedenen Umgebungen
(Wald, Weltall, Eis und D&uuml;nen) bieten zwar grafische Abwechslung, doch
richtige Unterschiede fallen nicht auf (lediglich im Weltraum muss man
aufpassen, dass man nicht an manchen Stellen von der Fahrbahn abkommt und
die Weiten des Alls kennenlernen darf). Eine &Uuml;bersicht &uuml;ber die ganze
Strecke w&auml;hrend des Rennens h&auml;tte vielleicht auch gut getan. Gut gedacht
ist die M&ouml;glichkeit, dass man vor einem Rennen/Championship einen aus sechs
verschiedenen Fahrern ausw&auml;hlen muss, von denen jeder unterschiedliche
Fahreigenschaften besitzt. Wo genau die Unterschiede sind, konnte ich
allerdings nicht feststellen.
</P>
<P>
Um ehrlich zu sein konnte mich das Einzelspiel nicht sehr lange Zeit
fesseln, sodass ich bislang noch keinen Championship gewonnen habe. Die
Idee, dass nur ein erster Platz Erfolg verspricht, ist zwar etwas
Besonderes, aber leider endet dies oft in &ouml;den Einzelrunden vorneweg vor
den anderen bei manchen Strecken (die Rundenzahl l&auml;sst sich nur im
Multiplayer-Race ver&auml;ndern) und einem totalen Scheitern bei anderen
Strecken. Das Multiplayer-Rennen bietet hier schon mehr. Doch das
Zweikampf-/Gegeneinander-Gef&uuml;hl k&ouml;nnte jedoch besser gestaltet sein. So ist
es nur schwer m&ouml;glich, andere absichtlich zu schikanieren oder z.B. von der
Bahn zu werfen. Richtig Spa&szlig; macht auch auf l&auml;ngere Frist dagegen das
Mehrspieler-Battle. Diese Idee ist zwar simpel, aber kann durchaus f&uuml;r
lustige Stunden sorgen.
</P>
<P>
Leider ist Max Rally bei mir &ouml;fters pl&ouml;tzlich abgest&uuml;rzt, was allerdings an
zu wenig freiem RAM lag. Mit &quot;Boot with no startup-sequence&quot; und Start von
der Shell macht das Spiel allerdings keine Probleme.
</P>
<P><B>Fazit:</B></P>
<P>
Max Rally ist ein nettes kleines Buggy-Rennspiel mit einigen interessanten
M&ouml;glichkeiten, das wirklich Besondere fehlt allerdings, weshalb nur m&auml;&szlig;iger
Spielspa&szlig; aufkommt. Einzige Ausnahme ist da das Multiplayer-Battle.
Aufgrund der mittelm&auml;&szlig;igen Grafik gelingt es dem Spiel nur schwer, sich von
PD-Spielen abzuheben, welche ja h&auml;ufig sehr witzige Ideen aufzuzeigen
haben.
</P>
<P>
F&uuml;r Spielefreaks oder auch A500-User ist das Erscheinen von Max Rally
sicherlich eine Bereicherung.
</P>
<P>
Ich will mit diesem Test niemanden abschrecken, in Tests der Konkurrenz ist
das Spiel h&auml;ufig besser weggekommen, seine eigene Meinung bilden kann sich
jeder, indem er sich aus dem Internet die Demo-Version herunterl&auml;d, was
sicherlich kein Fehler ist.
</P>
Kontakt: <A HREF="http://www.allcomm.co.uk/~fortress" TARGET="_top">http://www.allcomm.co.uk/~fortress</A><BR>
<P>
Das Test-Exemplar wurde mir freundlicherweise zur Verf&uuml;gung gestellt von
CS&amp;E Ltd. (<A HREF="http://www.csande.co.uk" TARGET="_top">http://www.csande.co.uk</A>).
</P>
<P><B>Christian Keller &lt;<A HREF="mailto:chrisman@bigfoot.de">chrisman@bigfoot.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
