<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Hintergrundbericht: Amiga und ISDN (von Gerd Engelmann)</H2>
<P>
&raquo;Amiga und ISDN - geht das denn &uuml;berhaupt? Und wenn ja, wie?
Ich m&ouml;chte in diesem Artikel einige M&ouml;glichkeiten erl&auml;utern.
</P>
<P>
Die einfachste M&ouml;glichkeit ist der Anschluss eines externen Terminal-
Adapters, vergleichbar mit einem Modem, an den NTBA der Telekom. Der NTBA
ist der eigentliche ISDN-Anschluss in der Wohnung. Er hat zwei Anschl&uuml;sse
in Form von 8-poligen Western-Digital-Buchsen und einen internen Anschluss,
an den man ein mindestens 4-poliges Kabel direkt anschliessen kann.
</P>
<P>
Terminaladapter (kurz TA) gibt es einige Ger&auml;te am Markt, die man alle ohne
Probleme am Amiga nutzen kann. Man muss nur darauf achten, das der TA die
sogenannten AT-Kommandos versteht. Es gibt auch einige Ger&auml;te, welche das
nicht k&ouml;nnen. Diese kann man nur mit einer speziellen Software ansprechen,
welche es nur f&uuml;r die Betriebssysteme Windows 9x und eventuell MacOS gibt.
Empfehlen kann ich pers&ouml;nlich den &quot;Elsa Tango 1000&quot;, da ich ihn selber
benutze.
</P>
<P>
Auch die Hagenuk-Ger&auml;te &quot;Databox Speeddragon&quot; oder &quot;Databox Powerdragon&quot;
kann ich empfehlen. Diese Ger&auml;te sind eigentlich schon kleine
Telefonanlagen, da man analoge Ger&auml;te anschliessen kann. Ein grosser
Vorteil ist auch, das es f&uuml;r diese Ger&auml;te Amigasoftware gibt, mit denen man
Konfigurationen vornehmen kann und Geb&uuml;hren auslesen. Die Software heisst
&quot;Dragontools&quot; und ist im Aminet zu bekommen.
</P>
<P>
Es gibt sicher noch eine Vielzahl anderer externer TA am Markt, aber wie
gesagt, darauf achten, das sie AT-Kommandos verstehen.
</P>
<P>
Bei der Nutzung eines externen Ger&auml;tes muss noch beachtet werden, das doch
recht gro&szlig;e Datenmengen in kurzer Zeit &uuml;ber die serielle Schnittstelle
transportiert werden wollen. Diese ist am Amiga aber nicht die schnellste
und zudem ist die Geschwindigkeit auch noch Prozessorabh&auml;ngig. Ich empfehle
f&uuml;r Amigas mit einem Prozessor kleiner 68060 unbedingt eine
Schnittstellenkarte. Mit einem 060 geht es ganz gut, ohne das die CPU
&uuml;berm&auml;ssig ausgelastet w&auml;re.
</P>
<P>
Eine andere Variante sind interne ISDN-Karten f &uuml;r den Zorro-Slot.
Auch davon gibt es verschiedene, ISDN-MasterI und II, ISDN-Blaster und
andere. Mir pers&ouml;nlich sagen die Teile nicht zu, da man keine optische
Kontrolle &uuml;ber den Verbindungsstatus hat.
</P>
<P>
Der Vorteil ist, das man die serielle Schnittstelle umgeht. Ausserdem kann
man einige Karten als Telefon benutzen. Man kann dazu einen normalen
Telefonh&ouml;rer an die Karte anstecken. Das ist recht praktisch.
F&uuml;r die auf dem Amigamarkt verbreiteten ISDN-Karten gibt es im &uuml;brigen
mehrere Treiber und auch verschiedene Software.
</P>
<P>
Noch eine M&ouml;glichkeit besteht in der Installation einer Telefonanlage. Dies
empfiehlt sich insbesondere in Ein-oder Mehrfamilienh&auml;usern. Man kann dann
kostenlose Interngespr&auml;che &uuml;ber die Analoganschl&uuml;sse f&uuml;hren. Auch der
Anschluss von T&uuml;rsprechanlagen ist m&ouml;glich.
</P>
<P>
Ich m&ouml;chte hier als Beispiel die Telefonanlagen &quot;Istec 1003&quot; und &quot;Istec
1008&quot; der Firma Emmerich empfehlen. Warum? Weil es daf&uuml;r eine sehr gute
Amigasoftware gibt, die seit kurzem auch noch Freeware ist. Die Software
heisst &quot;UFT-Istec&quot; und ist ebenfalls im Aminet erh&auml;ltlich. Mit Dem Programm
ist die Konfiguration der Tk-Anlage ein Kinderspiel und auch das Auslesen
der Geb&uuml;hren ist m&ouml;glich.
</P>
<P>
F&uuml;r die Nutzung von Onlinediensten braucht man in diesem Fall aber auch
einen TA.
</P>
<P>
Die Istec-Anlagen kann man sehr g&uuml;nstig gebraucht kaufen, bei &quot;EBAY&quot; werden
oft welche angeboten.
</P>
<P>
Ich hoffe, das ich ein wenig Klarheit in das Thema &quot;Amiga und ISDN&quot; geben
konnte. Sicher kennen sich viele damit aus, da ich aber in letzter Zeit
&ouml;fter auf diverse Anfragen im *AC#-Forum sties, habe ich diesen Artikel
geschrieben. Und wer noch nicht genug bekommen hat, kann mich gerne per E-
Mail kontakten.
</P>
<P><B>Gerd Engelmann &lt;<A HREF="mailto:G.Engelmann@t-online.de">G.Engelmann@t-online.de</A>&gt;&laquo;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
