<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Der Commodore-Untergang aus meiner Sicht - Teil 4 (von Rainer Benda)</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>Was war der Commodore C65?</H3>
<P>
Der C65 (Arbeitstitel C64DX) sollte Ende 1991, Anfang 1992 den originalen
C64 ersetzen. Auch hier dieselbe Situation wie beim A500/600. Der C64
verkaufte sich zur geplanten Einf&uuml;hrung des C65 noch gute 150.000 mal pro
Quartal. Sei es in den Osten, Asien oder wohin auch immer. Der Absatz in
Europa (Deutschland) lie&szlig; zwar nach, allerdings war es nicht so
beunruhigend, als dass man nun h&auml;tte panikartig reagieren m&uuml;ssen. Helmut
Josts Aussagen dazu waren immer &quot;was interessiert mich mein Geschw&auml;tz von
gestern&quot; und &quot;der tote Fisch stinkt am Kopf zuerst&quot;. Sozusagen die
Universalantwort zu jedem Problem.....ich verga&szlig;, es gibt ja keine
Probleme, sondern nur L&ouml;sungen.
</P>
<P>
Die Vorstellung der Gesch&auml;ftsleitung war zu diesem Zeitpunkt irgendwie
&quot;ungeordnet&quot;. Auf der einen Seite wollte man mit einem C64 und einem Spiel
wie Terminator (man beachte, das Paket sollte Weihnachten 1991 auf den
Markt kommen) den Nintendo-Konsolen Konkurenz machen (alle Achtung), auf
der anderen Seite suchte man einen technisch fortschrittlicheren C64-
Nachfolger, der preislich unterhalb eines A500/600 liegen sollte, die
Leistungen eines C64 aber &uuml;bertreffen sollte. Doc Peter Kittel hatte Helmut
Jost (unfreiwillig) auf einen Trip gebracht, der uns seitdem immer
verfolgte. Ein Spiel wie Terminator, untergebracht auf einem Modul, ist
nat&uuml;rlich von den Datenmengen gr&ouml;&szlig;er als der Arbeitsspeicher des C64. Man
bedient sich daher des &quot;Bankswitching&quot;-Verfahrens, um Speicherbl&ouml;cke von x-
KB durch die Gegend zu schieben, um nicht die kompletten Daten im Speicher
halten zu m&uuml;ssen (ging ja wie geschrieben auch gar nicht). Seitdem war
Helmut Josts ultimative L&ouml;sung zu jedem Speicherproblem das Bankswitching-
Verfahren, sei es bei einem A600, einem CDTV oder was auch immer. H&auml;tten
wir blo&szlig; nicht versucht, ihm etwas zu erkl&auml;ren. &quot;:-))&quot;
</P>
<P>
Anfangs war es zuerst nur ein internes Ger&uuml;cht, man arbeite in Westchester
an einem C64-Nachfolger (immerhin war gerade der Kampf um den A4000 im
Gange - kommt vorher nochmal eine ECS-Maschine oder nicht?) und es schien
uns absurd, f&uuml;r 1991/92 noch an so was zu denken. Leider weit gefehlt.
</P>
<P>
Ein komplettes Entwicklerteam, best. aus 8 Personen (!), angef&uuml;hrt von Fred
Bowen (er ist auch in Dave Haynies Video zu sehen) wurde f&uuml;r dieses System
abgestellt.
</P>
<P>
Die Leistungen des C65 waren durchaus beeindruckend, und h&auml;tte es nicht
schon einen C64 und einen A500 gegeben, w&auml;re dieses Ger&auml;t m&ouml;glicherweise
auch ein Erfolg geworden. Nur gab es diese Ger&auml;te schon, und die Zeit
sprach gegen den C65.
</P>
<P>
Wir hatten 10 Exemplare des C65 zu Testzwecken in Deutschland, die wir nach
den Tests (leider) wieder abgeben mussten (einen zum Sammeln h&auml;tte ich
schon gerne behalten, zumal die Teile &quot;Top Secret&quot; wie sie angeblich waren,
nachher f&uuml;r fast umsonst vertickt wurden), inkl. den Schaltpl&auml;nen, einem
Quick-Reference Guide und einer Demo-Diskette (die ich auch noch haben
sollte, aber nicht finde...grummel).
</P>
<P>
Der C65 hatte zwei SID-Chips (f&uuml;r Stereo-Sound), tolle grafische
F&auml;higkeiten (sie standen denen eines Amiga 500 kaum nach), nur gro&szlig;artig
kompatibel war er nicht. Wir haben in Frankfurt rund 200 Titel getestet und
die Kompatibilit&auml;t lag maximal bei 40-50%. Zuwenig, wenn man bedenkt, da&szlig;
der C65 den C64 nicht erg&auml;nzen, sondern ersetzen sollte. Der C65 hatte ein
internes 3,5&quot; Laufwerk, das dem externen Floppy-Laufwerk 1581 entsprach,
nur gab es zu dem damaligen Zeitpunkt schon keine Chips mehr, um 1581-
Floppies herstellen zu lassen, da die entsprechende Fabrik eben keine mehr
produzierte.
</P>
<P>
Es gab zwar einen externen Floppy-Anschlu&szlig; f&uuml;r ein 1541-Laufwerk, nur
wollte man ja das 3,5&quot;-Format zum Standard machen, und das geht nat&uuml;rlich
schlecht, wenn man gleich wieder bei 5,25&quot; landet, nur weil sich keine
Floppies mehr produzieren lie&szlig;en. Nein, eine Amiga-Floppy lief auch nicht,
nicht nur wegen des 800KB-Formats nicht.....
</P>
<P>
Geht man davon aus, da&szlig; der C65 standardm&auml;&szlig;ig zumindest intern &uuml;ber 3,5&quot;-
Format verf&uuml;gte, musste ja auch erstmal Software in diesem Format
vorliegen, d.h. entweder vorhandene Titel konvertieren und/oder neue in
diesem Format produzieren. Das h&auml;tten selbst gro&szlig;e Softwarefirmen nicht
mitgemacht.
</P>
<P>
Die zwei SIDs waren zwar auch ganz nett, entlockten alter C64-Software aber
entweder nur ein Kr&auml;chzen oder gar nichts. Der C65-Modus war interessant,
mangels Material aber kaum zu testen, und der C64-Modus eben nicht so gut,
wie er h&auml;tte sein m&uuml;ssen.
</P>
<P>
Fred Bowen wurde von Commodore Deutschland f&uuml;r eine Woche eingeladen, um
uns den C65 &quot;schmackhaft&quot; zu machen. Doc Peter Kittel und meiner einer
durften uns ihm annehmen.
</P>
<P>
Ehrlich gesagt, tat er uns wirklich leid, und wir haben versucht, ihn nicht
zu hart anzupacken. Letztendlich haben wir ihm unsere Bedenken zum C65
klargemacht, und wie die Situation des C64 hier in Deutschland (Europa)
aussieht, im Gegensatz zu USA, etc.
</P>
<P>
Wir haben ihm nat&uuml;rlich auch die Problematik (Absatz 1 + 2) verdeutlicht,
und er gab uns letztendlich in allen Punkten recht. Auf meine Frage an ihn,
wo er die Vorz&uuml;ge des Ger&auml;ts sehen w&uuml;rde, antwortete er nur, da&szlig; er das
auch nicht w&uuml;sste. Er habe die Anweisung von &quot;Oben&quot; erhalten, ein Ger&auml;t mit
diesen Spezifikationen zu entwickeln und das habe er getan, und er gab uns
recht, wenn wir der Ansicht seien, das Ger&auml;t w&uuml;rde uns mehr schaden, als
helfen.
</P>
<P>
Fred Bowen reiste dann nach dieser Woche wieder ab und Doc Peter Kittel und
ich entwarfen ein &quot;Argumentationspapier&quot; in dem wir mehr als eindringlich
darauf hinwiesen, da&szlig; der C65 uns das Genick endg&uuml;ltig brechen w&uuml;rde, und
dass wir das so nicht hinnehmen k&ouml;nnten, sollte der C65 Gestalt annehmen.
</P>
<P>
In dem besagten Vertriebsmeeting, in dem uns mitgeteilt wurde, da&szlig; der
PCMCIA-Port des A600 nicht von Commodore unterst&uuml;tzt werden w&uuml;rde, sagte
Helmut Jost dann, da&szlig; der C65 nicht kommen w&uuml;rde und da&szlig; sich dar&uuml;ber
sicherlich Doc Peter und ich am meisten freuen w&uuml;rden. Das haben wir dann
auch lautstark mit Applaus honoriert. Der Vertrieb wusste eh nicht so
recht, was der C65 denn nun h&auml;tte sein sollen und war &uuml;ber unsere Reaktion
leicht verwundert.
</P>
<P>
Das war uns allerdings v&ouml;llig wurscht. Eines der wenigen Dinge, bei denen
man das gute Gef&uuml;hl hatte, etwas bewirkt zu haben, auch wenn es &quot;nur&quot; die
Abwendung einer Katastrophe war.&laquo;
</P>
<P>
Fortsetzung folgt...
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
