<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. 5 Fragen - 5 Antworten: Interview mit Stefan Ossowski/Schatztruhe</H2>
<P>
&raquo;Die zunehmende Zersplitterung und Uneinigkeit ist die gr&ouml;&szlig;te Bedrohung f&uuml;r
den Amiga.&laquo; - Stefan Ossowski
</P>
<P>
<B>AMIGA aktuell: Herr Ossowski, aus welchen Gr&uuml;nden wird die von Ihnen
gegr&uuml;ndete Schatztruhe GmbH in GTI eingegliedert?</B>
</P>
<P>
Stefan Ossowski: Die Schatztruhe GmbH als solche wird nicht in die GTI GmbH
eingegliedert; die GTI GmbH &uuml;bernimmt lediglich das operative Gesch&auml;ft der
Schatztruhe GmbH. Nach Abschlu&szlig; dieser Transaktion wird es weiterhin zwei
getrennte und voneinander unabh&auml;ngige Gesellschaften (Schatztruhe und GTI)
geben, wobei die GTI GmbH k&uuml;nftig auch unter dem Label 'Schatztruhe' am
Markt auftreten wird und die Schatztruhe GmbH am Markt nicht mehr in
Erscheinung tritt.
</P>
<P>
Aufgrund der schwierigen Marktlage habe ich mir zusammen mit Richard Small
Gedanken dar&uuml;ber gemacht, inwiefern es m&ouml;glich ist, die bestehende
Kooperation zu intensivieren und dadurch Kostensenkungspotentiale
wahrzunehmen. So haben wir es erreicht, die Anzahl der Kostenstellen
(Miete, B&uuml;ro, Marketing, ...) deutlich zu reduzieren, ohne einen einzigen
Kompromi&szlig; in Bezug auf das Produktsortiment, die Produkt-Roadmap und den
Kundenservice eingehen zu m&uuml;ssen. Alles wird in unver&auml;ndertem Umfang
fortgesetzt, und die GTI GmbH wird sich in bester Schatztruhe-Tradition als
schneller, zuverl&auml;ssiger und kompetenter Versender und
Amiga-Ansprechpartner bereits in K&uuml;rze einen hervorragenden Ruf erarbeiten.
</P>
<P>
<B>AMIGA aktuell: Welche Rolle werden Sie pers&ouml;nlich bei GTI spielen? Werden
die bisherigen Schatztruhe-Mitarbeiter weiter besch&auml;ftigt?</B>
</P>
<P>
Stefan Ossowski: Mitarbeiter aus den Bereichen Technik und Support werden
voraussichtlich zur GTI GmbH wechseln; es finden derzeit entsprechende
Verhandlungen statt. Ich gehe davon aus, da&szlig; keinerlei Entlassungen zu
bef&uuml;rchten sind - GTI wird die Schatztruhe - wie angek&uuml;ndigt - in
unvermindertem Umfang weiterf&uuml;hren!
</P>
<P>
Ich werde dem neuen Team selbstverst&auml;ndlich auch k&uuml;nftig beratend zur Seite
stehen.
</P>
<P>
<B>AMIGA aktuell: Sie haben erkl&auml;rt, dass es auch weiterhin neue Amiga-
Produkte von GTI/Schatztruhe geben wird. Was k&ouml;nnen die Anwender in
n&auml;chster Zeit erwarten?</B>
</P>
<P>
Stefan Ossowski: Es sind einige sehr interessante Projekte in Vorbereitung,
zu denen ich mich noch nicht &auml;u&szlig;ern kann. Richard Small wird es sich mit
Sicherheit nicht nehmen lassen, die Amiga-User zum fr&uuml;hest m&ouml;glichen
Zeitpunkt mit konkreten Informationen zu versorgen.
</P>
<P>
<B>AMIGA aktuell: Wie beurteilen Sie die derzeitige Lage der (bisherigen)
Schatztruhe GmbH sowie die der Amiga-Firmen allgemein?</B>
</P>
<P>
Stefan Ossowski: Die bisherige Schatztruhe war und ist seit mehr als 13
Jahren ein gesundes und erfolgreiches Unternehmen, dessen operatives
Gesch&auml;ft ich in einem ordentlichen Zustand, mit ein wenig Stolz und
nat&uuml;rlich mit viel Herzblut, an einen geeigneten Nachfolger &uuml;bergebe.
</P>
<P>
Der Amiga-Markt hat sich in den letzten Monaten stabilisiert. Die neue
Schatztruhe steht sozusagen in den Startl&ouml;chern - und freut sich auf
zuk&uuml;nftige Entwicklungen in Bezug auf AmigaNG/ONE/DE/MorphOS/... .
</P>
<P>
Mit mehr als 13 Jahren Branchenerfahrung, wird Schatztruhe/GTI auch k&uuml;nftig
einer der Key-Player im - hoffentlich wieder bl&uuml;henden - Amiga-Markt sein.
</P>
<P>
<B>AMIGA aktuell: Wie sehen Sie die Amiga-Zukunft? Welche Chancen geben Sie
dem AmigaDE und auf der anderen Seite dem MorphOS-Projekt?</B>
</P>
<P>
Stefan Ossowski: Ich kann die Zukunft leider nicht vorhersagen. Insofern
ma&szlig;e ich mir nicht an, dar&uuml;ber zu entscheiden, welches dieser Systeme sich
durchsetzen wird. Ich hoffe jedoch, da&szlig; die &uuml;berlegene technische
Architektur den Ausschlag geben wird und da&szlig; alle verbliebenen Amiga-User
sodann den Fokus auf diese Plattform richten, um gemeinsam an EINEM Strang
zu ziehen. Die zunehmende Zersplitterung und Uneinigkeit ist die gr&ouml;&szlig;te
Bedrohung f&uuml;r den Amiga.
</P>
<P>
<B>AMIGA aktuell: Herr Ossowski, vielen Dank f&uuml;r die Beantwortung unserer
Fragen.</B>
</P>
<P><B>Carsten Schr&ouml;der &lt;<A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
