<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Reaktion auf Achim Stegemanns Kritik am AmigaOS 3.9 (von M. Christoph)</H2>
<P>
Genesis kostet in der Vollversion einzeln 98 DM, die Aminet-Programme sind
keine Vollversionen...
</P>
<P>Es ergibt sich also folgende Rechnung:
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Aminet-CD&nbsp;</TD><TD VALIGN="TOP">20,00 DM&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Genesis&nbsp;</TD><TD VALIGN="TOP">98,00 DM&nbsp;</TD></TR>
</TABLE></P>
<P>
Macht zusammen 118 DM! Und Du beschwerst Dich, weil Du f&uuml;r alles zusammen
nur 89 Mark zahlen mu&szlig;test und als Bonus auch noch einen Annex-Titel
bekommen hast?
</P>
<P>
Warum welches Programm in das OS integriert wurde, wurde von H&amp;P bereits
mehrfach deutlich und &ouml;ffentlich bekanntgegeben. Also vielleicht einfach
mal zuh&ouml;ren!
Man kann nicht einfach ein xy-Programm aus dem Aminet auf die AmigaOS-CD
kopieren, und fertig - nein. Die Programmierer m&uuml;ssen mit Haage &amp; Partner
zusammenarbeiten, damit ihre (oftmals) Systemeingriffe ins Betriebssystem
integriert werden. Zus&auml;tzlich m&uuml;ssen auch die Sourcen offengelegt werden,
damit H&amp;P im Bedarfsfall auf Fehler reagieren und sie beseitigen kann!
W&uuml;rde das der Programmierer von xy machen und nicht lieber sein Programm
als Shareware vertreiben, spricht nichts gegen weitere &quot;Systemtools&quot;!
</P>
<P>
Da&szlig; Amiga Inc vier Wochen vor Weihnachten feststellt, da&szlig; sie der Amiga-
Gemeinde nichts zu pr&auml;sentieren haben, kann nicht H&amp;P angelastet werden.
Nur ihnen ist es zu verdanken, da&szlig; in so kurzer Zeit &uuml;berhaupt ein so
fehlerfreies Produkt zustande kommen konnte. Die Zeit, einen MPEG-Player
(fehlerfrei) zu schreiben, ist nicht vorhanden gewesen, und seien wir
ehrlich, w&auml;re von Amiga Inc auch nicht finanziert worden!!!
</P>
<P>
AmigaOS 3.9 ist definitiv kein BoingBag 2, das mittwerweile frei erh&auml;ltlich
ist. In dem Punkt gab es NIE eine andere Aussage. Da&szlig; in den Newsgroups
etc. den Falschaussagen mehr Wert beigemessen wird, als H&amp;P, ist den Leuten
selbst zuzuschreiben!
</P>
<P>
Man kann eine positive oder negative Meinung zu AmigaOS 3.9 haben, aber ein
Programm einfach nur schlecht machen, ist keine objektive Beschreibung.
Nicht AmigaOS 3.9 ist schlecht, sondern in diesem Fall die Vorgehensweise
von Amiga Inc - also sollte man die Sache mal aus der &quot;richtigen Richtung&quot;
betrachten!
</P>
<P>
Bereits die unqualifizierten &quot;Ersten Eindr&uuml;cke&quot; von Gernod Schomberg in
AMIGA aktuell 01/2001 waren eine Zumutung. Er h&auml;tte nur mit dem OS arbeiten
m&uuml;ssen, um mehr sagen zu k&ouml;nnen, als es nur schlecht zu machen.
[In dem Punkt muss ich meinen engagierten Mitarbeiter Gernod in Schutz
nehmen. Er hat seinen Artikel bewusst nicht als &raquo;Testbericht&laquo; verfasst,
sondern seine pers&ouml;nlichen Eindr&uuml;cke geschildert und argumentativ
erl&auml;utert, weshalb IHM das AmigaOS 3.9 nicht gef&auml;llt. Meiner Meinung nach
steht es niemandem zu, dies zu kritisieren, egal wie man selbst zum AmigaOS
3.9 steht; Anm. d. leit. Red.]
</P>
<P>
P.S.: Ich bin, bereits seit AmigaOS 3.5, Betatester und wei&szlig; auch, wieviel
sich intern verbessert hat, was gar nicht &quot;nach au&szlig;en&quot; dringt oder zur
Kenntnis genommen wird.
</P>
<P>
Unabh&auml;ngig davon schlie&szlig;e ich mich der Meinung an, da&szlig; ein PPC-AmigaOS
nicht erforderlich ist und eher negative Auswirkungen auf AmigaDE hat.
Abgesehen von einem (sinnlosen) Jahr Entwicklungszeit habe ich meine
Zweifel an der Bin&auml;rkompatibilit&auml;t zu dem jetzigen OS. Und wird die
Bin&auml;rkompatibilit&auml;t nur durch Emulation erreicht, ist kein
Geschwindigkeitszuwachs mehr vorhanden. In dieser Zeit k&ouml;nnte man eine
Menge an Verbesserungen im jetzigen AmigaOS vornehmen, die JEDEM zugute
kommen w&uuml;rden und nicht nur einer kleinen Anwendergruppe.
</P>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
