<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Amiga PowerPC</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="PowerPC.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="PowerPC3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Amiga PowerPC
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Interview mit Thomas Kn&auml;bel/bplan GmbH (von Christian Aichinger)</H2>
<P>
Vor kurzem hat die bplan GmbH interessante Neuigkeiten zu ihrem Pegasos-
Projekt ver&ouml;ffentlicht. Thomas Kn&auml;bel, Gesch&auml;ftsf&uuml;hrer des Unternehmens,
war so freundlich, AMIGA aktuell ein Interview zu gew&auml;hren:
</P>
<P>
<B>AMIGA aktuell: K&ouml;nnten Sie vielleicht zuerst kurz etwas &uuml;ber die Firma
bplan erz&auml;hlen?</B>
</P>
<P>
Thomas Kn&auml;bel: Ziel des Unternehmens ist seit seiner Gr&uuml;ndung im Herbst
2000 die Entwicklung eines marktf&auml;higen PPC-Systems. Weitere Projekte
betreffen den industriellen Bereich in den Sparten Me&szlig;technik und
Steuerungssysteme. Durch die konsequente Verwirklichung der Lean-
Management-Idee kann die bplan GmbH hierbei die n&ouml;tigen Leistungen mit
einem Personaleinsatz von sechs Mitarbeitern realisieren. Laufende Projekte
sind, soweit eine Ver&ouml;ffentlichung durch den Kunden gestattet ist, auf
unserer Web-Pr&auml;senz einsehbar.
</P>
<P>
<B>AMIGA aktuell: Es gibt einige Ger&uuml;chte, da&szlig; die Firma bplan mehr oder
weniger der direkte Nachfolger der in Amiga- und Macintosh-Kreisen sehr
bekannten Firma Phase 5 ist. Die identische Postanschrift von bplan und
Phase 5 und die sehr &auml;hnlichen Projekte sind sicherlich kein Zufall. Wie
sieht der Zusammenhang zwischen Ihrer Firma und Phase 5 aus? (Anm. dazu im
Anschluss an das Interview)</B>
</P>
<P>
Thomas Kn&auml;bel: Die bplan GmbH ist KEINE Nachfolgegesellschaft der
ehemaligen Phase 5. Auch sind die Postanschriften in keiner Weise
identisch, wie Sie leicht auf unserer Web-Seite ersehen k&ouml;nnen. Die
urspr&uuml;ngliche Idee, Teile der ehemaligen Phase5-Ressourcen (auch
R&auml;umlichkeiten) zu &uuml;bernehmen, konnte in Folge des Insolvenzverfahrens
nicht wie geplant erfolgen. Die von Ihnen angesprochene &Auml;hnlichkeit der
Projekte liegt in der Natur der Sache begr&uuml;ndet. Ein PowerPC-Mainboard wird
auch bei unterschiedlichen Herstellern (IBM, Motorola, Apple oder bplan)
immer gewisse Gemeinsamkeiten aufweisen.
</P>
<P>
<B>AMIGA aktuell: Ihr aktuelles Projekt ist das Pegasos-Motherboard. K&ouml;nnen
Sie mir sagen, welche Anwender Sie mit diesem Projekt anvisieren, und was
glauben Sie, wie Ihre Chancen in diesem Marktsegment aussehen?</B>
</P>
<P>
Thomas Kn&auml;bel: Die Zielgruppe der Pegasos-Plattform sind prim&auml;r jene
Anwender und Entwickler, die die Leistung eines Mehrprozessor-PowerPC-
Systems einsetzen wollen. Durch den Einsatz von Standardkomponenten wird
der Stra&szlig;enpreis eines Komplettsystems hierbei deutlich unter den Preisen
anderer PowerPC-System-Lieferanten liegen. Wir bieten hiermit einer
Zielgruppe, die mehr als nur eine vorgefertigte Wintel-L&ouml;sung sucht, eine
flexible, leistungsf&auml;hige und vor allem bezahlbare Alternative an, die z.B.
in einer Dual-G4-750MHz-Variante keinen Vergleich zu scheuen braucht.
</P>
<P>
<B>AMIGA aktuell: Die Spezifikationen des Pegasos-Boards h&ouml;ren sich f&uuml;r mich
sehr nach den, nicht sehr erfolgreichen, CHRP-Pl&auml;nen (CHRP = common
hardware reference plattform) von IBM an. K&ouml;nnen Sie mir sagen, wie Sie auf
die Idee mit dem Pegasos-Board gekommen sind? Hat das CHRP-Design von IBM
f&uuml;r Ihre Pl&auml;ne irgendeine Rolle gespielt?</B>
</P>
<P>
Thomas Kn&auml;bel: Die prinzipielle Idee der CHRP hatte sicherlich Einflu&szlig; in
der konzeptionellen Phase des Projektes. Die Entwicklung des Pegasos-
Designs vereint alle unsere bisherigen Erfahrungen, sowie die Anforderungen
an ein modernes PPC-Mainboard. Ziel der Entwicklung war es von Anfang an,
eine Plattform zu realisieren, die den W&uuml;nschen an ein benutzbares PPC-
System entspricht. Benutzbar hei&szlig;t in diesem Fall: a) Ausreichend
standardisiert in Bauform(ATX) und Schnittstellenbest&uuml;ckung (siehe Pegasos-
Spezifikation unten im Text), b) Leistungsf&auml;higkeit und
Anwenderskalierbarkeit durch ein modulares CPU-Konzept, c) bezahlbar.
</P>
<P>
<B>AMIGA aktuell: Ist ein eigener Komplettrechner geplant, der auf den
Pegasos-Spezifikationen aufbaut oder wird das Board von OEM-Partnern
vertrieben? Gibt es schon Vertragspartner und/oder Interessenten? Oder soll
das Board zum Nachbau durch Fremdfirmen lizenziert werden?</B>
</P>
<P>
Thomas Kn&auml;bel: Zum heutigen Zeitpunkt existieren Pl&auml;ne f&uuml;r Komplettrechner
nur f&uuml;r Entwicklungssysteme. Der Vertrieb wird &uuml;ber OEM-Partner erfolgen,
welche gleichfalls die Produktion in Lizenz &uuml;bernehmen.
</P>
<P>
<B>AMIGA aktuell: Wann w&auml;re, nach Ihren Pl&auml;nen, der Verkaufsstart des Pegasos-
Boards?</B>
</P>
<P>
Thomas Kn&auml;bel: Der geplante Verkaufsstart ist Q3/2001.
</P>
<P>
<B>AMIGA aktuell: Und wie hoch w&auml;re nach Ihren Erwartungen der geplante
Endkundenpreis?</B>
</P>
<P>
Thomas Kn&auml;bel: Der Preis eines Komplettsystems (inkl.
HD/DVD/RAM/Maus/Tastatur) liegt im Bereich von 1000 EUR.
</P>
<P><B><B>AMIGA aktuell: Wird AmigaDE von dem Board unterst&uuml;tzt?</B></B></P>
<P>
Thomas Kn&auml;bel: Diese Frage ist nach unserer Meinung in Ihrer Formulierung
irref&uuml;hrend. Eine Hardware mu&szlig; nicht ein Betriebssystem unterst&uuml;tzen,
sondern eben dieses die Hardware (die Wintel-Ausnahme best&auml;tigt hier die
Regel). Durch ein OpenFirmware-BIOS bietet die Pegasos Hardware eine ideale
Schnittstelle, um von den verschiedensten Betriebssystemen unterst&uuml;tzt zu
werden.
</P>
<P>
<B>AMIGA aktuell: Es w&auml;re also theoretisch m&ouml;glich, AmigaDE beispielsweise mit
Linux als Hostenvironment zu verwenden?</B>
</P>
<P>
Thomas Kn&auml;bel: Auch praktisch. Die Tatsache, da&szlig; das Betriebssystem die
Hardware unterst&uuml;tzen mu&szlig;, und nicht umgekehrt, soll hier keinesfalls
bedeuten, da&szlig; AmigaDE nicht auf der Pegasos-Plattform l&auml;uft.
</P>
<P>
<B>AMIGA aktuell: Gibt/gab es bereits eine Korrespondenz mit der Firma AMIGA?</B>
</P>
<P>
Thomas Kn&auml;bel: Ja.
</P>
<P>
<B>AMIGA aktuell: Welche Linux-Variationen (SusePPC, LinuxPPC, etc.) sollen
von dem Board unterst&uuml;tzt werden?</B>
</P>
<P>
Thomas Kn&auml;bel: Wir werden allen interessierten Entwicklern die
bestm&ouml;glichste Unterst&uuml;tzung bieten, um eine gr&ouml;&szlig;tm&ouml;gliche Abdeckung zu
erreichen. Zu Ihrer Auflistung der verschiedenen Linux-Distributionen
m&ouml;chte ich an dieser Stelle noch QNX und VxWorks erw&auml;hnen.
</P>
<P>
<B>AMIGA aktuell: Wurde schon mit den genannten Distributoren Kontakt
aufgenommen? Gibt es in der Hinsicht schon eine Zusammenarbeit? Wenn ja,
wie genau sieht diese Zusammenarbeit aus?</B>
</P>
<P>
Thomas Kn&auml;bel: Ja. Wir stehen z.B. in engem Kontakt mit LinuxPPC und
anderen. Sicherlich werden Sie und Ihre Leser in K&uuml;rze entsprechende
Hinweise aus den Webseiten der jeweiligen Distributoren entnehmen k&ouml;nnen.
</P>
<P>
<B>AMIGA aktuell: Wie sieht die Zusammenarbeit mit dem MorphOS-Team aus?</B>
</P>
<P>
Thomas Kn&auml;bel: Teile des MorphOS-Teams und des bplan-Mitarbeiterstabes sind
identisch.
</P>
<P>
<B>AMIGA aktuell: K&ouml;nnten Sie mir vielleicht noch einige Namen nennen?</B>
</P>
<P>
Thomas Kn&auml;bel: Als bekannteste &quot;MorphOS&quot;-Pers&ouml;nlichkeit kann ich Ihnen hier
Ralph Schmidt nennen.
</P>
<P>
<B>AMIGA aktuell: K&ouml;nnen Sie schon etwas &uuml;ber die zu erwartende System-
Performance sagen? Existieren schon irgendwelche Benchmarks, die
aussagekr&auml;ftige Argumente gegen&uuml;ber alteingesessenen Plattformen
(vergleichbare PowerMacs und Wintel-Rechner) liefern?</B>
</P>
<P>
Thomas Kn&auml;bel: Wir werden aussagekr&auml;ftige Benchmarks in K&uuml;rze
ver&ouml;ffentlichen.
</P>
<P>
<B>AMIGA aktuell: Wie sehen die zuk&uuml;nftigen Pl&auml;ne der Firma bplan aus?</B>
</P>
<P>
Thomas Kn&auml;bel: Wir werden unsere Produktpalette an PPC-Hardware
verbreitern. Ausgehend vom heutigen Design werden wir zuk&uuml;nftig sowohl
leistungsf&auml;hige Serversysteme sowie Thin Clients im Low-Cost-Bereich
entwickeln.
</P>
<P><B><B>AMIGA aktuell: Ich bedanke mich f&uuml;r das Interview.</B></B></P>
<P><B>Weitere Quellen:</B></P>
bplan-GmbH: <A HREF="http://www.bplan-gmbh.de" TARGET="_top">http://www.bplan-gmbh.de</A><BR>
CHRP von IBM: <A HREF="http://www.rs6000.ibm.com/resource/technology/chrp/" TARGET="_top">http://www.rs6000.ibm.com/resource/technology/chrp/</A><BR>
MorphOS: <A HREF="http://www.morphos.de" TARGET="_top">http://www.morphos.de</A><BR>
LinuxPPC: <A HREF="http://www.linuxppc.com" TARGET="_top">http://www.linuxppc.com</A>, <A HREF="http://www.linuxppc.org" TARGET="_top">http://www.linuxppc.org</A><BR>
<P><B>Zus&auml;tzliche Anmerkung:</B></P>
<P>
Die Informationen betreffs der Postanschrift wurden folgender Internet-
Seite entnommen:<BR>
<A HREF="http://www.checkdomain.com/cgi-bin/checkdomain.pl?domain=www.bplan-gmbh.de" TARGET="_top">http://www.checkdomain.com/cgi-bin/checkdomain.pl?domain=www.bplan-gmbh.de</A>
Die dort genannten Informationen entsprechen nicht mehr dem heutigen Stand
der Dinge.
</P>
<P><B>Die von bplan ver&ouml;ffentlichten Pegasos-Spezifikationen:</B></P>
<UL>
<LI> microATX Mainboard
</LI>
<BR><LI> 133 MHz Prozessor Slot
</LI>
<BR><LI> Optional mit 350 MHz G3 PowerPC / 512k Cache bis hin zu Dual G4
  PowerPC / 2 MB Cache in aktuellen Taktraten
</LI>
<BR><LI> PC133 Hauptspeicher mit zwei Steckpl&auml;tzen
</LI>
<BR><LI> AGP Slot
</LI>
<BR><LI> Optional mit Matrox G450 Dualhead oder Anwender w&auml;hlbarer
  Grafikkarte
</LI>
<BR><LI> PCI Subsystem mit drei Steckpl&auml;tzen f&uuml;r Anwender spezifische
  Erweiterungen
</LI>
<BR><LI> FireWire mit 100/200/400 MBit Daten&uuml;bertragung
</LI>
<BR><LI> 10/100 MBit Netzwerk
</LI>
<BR><LI> USB I/O System mit vier Anschl&uuml;ssen
</LI>
<BR><LI> AC97 Sound Subsystem mit Mikrofon Eingang, Line In/Out und Headset
  Anschlu&szlig;
</LI>
<BR><LI> Optional Soundblaster Live! (belegt einen PCI Slot)
</LI>
<BR><LI> IRDA zur Komunikation &uuml;ber Infarot
</LI>
<BR><LI> ATA100 mit zwei Kan&auml;len zum Anschlu&szlig; von vier ATA Ger&auml;ten
</LI>
<BR><LI> Keyboard f&uuml;r PS2 kompatible Tastaturen
</LI>
<BR><LI> Mouse f&uuml;r PS2 kompatible Zeigeger&auml;te
</LI>
<BR><LI> Seriell f&uuml;r zwei RS232 Ger&auml;te
</LI>
<BR><LI> Parallel f&uuml;r Standard Drucker (Centronics)
</LI>
<BR><LI> Floppy
</LI>
<BR><LI> Gameport f&uuml;r PC-kompatible Joysticks
</LI>
</UL>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
