<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P><B>Wo bleibt der gro&szlig;e Knall? (von Christian Aichinger)</B></P>
<P>
Das ist die Frage, mit der sich die meisten Amiga-User im Moment
besch&auml;ftigen. Die Hardware-Hersteller stehen in den Startl&ouml;chern und warten
nur noch auf den Kanonenschu&szlig; seitens Amiga. Thendic will den Smartboy, den
zuk&uuml;nftigen und wahrscheinlich ersten Amiga-PDA, zur diesj&auml;hrigen Cebit
pr&auml;sentieren, bPlan ver&ouml;ffentlichte vor kurzem das Design ihres Linux-,
MorphOS-, und somit auch AmigaDE-kompatiblen Motherboards und k&uuml;ndigten
weiterhin einen Prototyp desselben an, und auch die Insel - besser gesagt
Eyetech - kann mit einem &quot;halbfertigen&quot; AmigaOne 1200 gl&auml;nzen.
</P>
<P>
Plattformunabh&auml;ngiges &quot;Computing&quot; ist die Zukunft, und es bieten sich
&uuml;berw&auml;ltigende und noch nicht zu erahnende Chancen f&uuml;r die Zukunft an.
Viele heutige &quot;Power-User&quot;, die sehr viel Geld in ihren Amiga gesteckt
haben und denen die gesamte Community zu danken hat, n&ouml;rgeln teilweise noch
m&uuml;rrisch &uuml;ber das AmigaDE (was auch immer man darunter begreift) und ihren
wom&ouml;glichen finanziellen Verlust. Aber selbst diejenigen m&uuml;&szlig;ten aufgrund
ihrer Einstellung zur Amiga-Technologie langsam auf den Geschmack gekommen
sein. Man stelle sich doch nur mal ein AmigaDE-Plugin f&uuml;r den Webbrowser
vor. &quot;Amiga&quot; aus dem Netz? Durchaus vorstellbar! Theoretisch br&auml;uchte man
f&uuml;r den neuen Amiga nur noch einen transportablen Datentr&auml;ger. Denn Amiga
ben&ouml;tigt nur eine CPU, etwas RAM und zum vern&uuml;nftigen Arbeiten eine
Grafikkarte und einen Monitor. Mehr nicht. Um welchen Typ oder Hersteller
es sich bei der Hardware handelt, ist fast egal. Wer keine veralteten
Industriestandards f&ouml;rdern und jungfr&auml;uliche, ohne Altlasten durchsetzte,
Hardware verwenden m&ouml;chte, dem stehen alle M&ouml;glichkeiten offen.
Und auch Windows-, MacOS- und Linux-J&uuml;nger oder -Anwender die, um ihre
Hardware neusten Anspr&uuml;chen anzupassen, lieber zum H&auml;ndler um die Ecke
gehen wollen, anstatt, auf den ersten Blick, &uuml;berteuerte &quot;Spezialhardware&quot;
zu kaufen, k&ouml;nnen in den Genu&szlig; einer vorher nie gekannten Unabh&auml;ngigkeit
kommen, ohne auf ihr altbew&auml;hrtes Betriebssystem verzichten zu m&uuml;ssen.
</P>
<P>
Jetzt stellt sich nur die Frage, wo bleibt AmigaDE? Ja, es ist richtig, da&szlig;
Amiga gut daran beraten ist, ihre Pl&auml;ne nicht an die gro&szlig;e Glocke zu
h&auml;ngen. Schlie&szlig;lich sollte nicht vergessen werden, da&szlig; auch andere und
weitaus m&auml;chtigere Unternehmen an vergleichbaren Projekten arbeiten.
Andererseits ist die Informationspolitik von Amiga alles andere als
befriedigend. Das letzte Executive Update h&auml;tte sich Amigas Pressesprecher
wahrhaft sparen k&ouml;nnen. Eine Einladung zur Gateway-Computer-Show in St.
Louis ist ja ganz &quot;nett&quot;, aber sicherlich nicht die Information, die sich
der User bzw. Hardware-Entwickler seitens Amiga gew&uuml;nscht h&auml;tte. Und auch
der Anwender der real existierenden Amiga-Plattform fischt im Tr&uuml;ben, was
die Zukunft oder wenigstens das sehnlichst erwartete BoingBag f&uuml;r AmigaOS
3.9 betrifft.
</P>
<P>
Hoffentlich schallt demn&auml;chst das Echo des Startschusses &uuml;ber den gro&szlig;en
Teich, und es geht endlich wieder vorw&auml;rts. Bleibt nur noch zu w&uuml;nschen,
da&szlig; das nerv&ouml;se Warten nicht zu einem Fehlstart und damit zum Desaster
wird.
</P>
<P>
Also, liebe Community! Bringt Ruhe in euer Leben und bewahrt Geduld! Es
wird Fr&uuml;hling und mal wieder Zeit, den Rechner abzuschalten und mit der
besseren H&auml;lfte oder wenigstens dem geliebten Haustier um den Block zu
spazieren und die Sorgen f&uuml;r einige Zeit zu vergessen. Vielleicht bringt es
auch etwas, den Blickwinkel zu &auml;ndern. Setzt euch dazu einfach mal an einen
Windows-PC und installiert einige Spiele, die ihr kurz darauf wieder
deinstalliert. Das hebt die Stimmung und relativiert alle Probleme, die es
auf dem Amiga-Sektor gibt.
</P>
<P>
Alles wird gut.
</P>
<P><B>Mit besten Gr&uuml;&szlig;en,</B></P>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
