<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Review: Payback</H2>
<P>
<A HREF="img/Payback1.jpg"><IMG SRC="thumb/Payback1.jpg" WIDTH="120" HEIGHT="48" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Endlich ist es soweit! Payback ist erh&auml;ltlich. Um dieses Ereignis geb&uuml;hrend
zu feiern, veranstaltet Playamiga zusammen mit Eternity ein Payback-
Gewinnspiel. Aber mehr unter Play!Amiga.
</P>
<P>
Zuerst einmal wollen wir uns dieses Spiel in aller Ruhe anschauen. Payback
kommt in einem professionell bedruckten Jewel-Case daher. Im Booklet
befindet sich eine kurze Anleitung in nicht weniger als zehn (10!) Sprachen
und dem Inhaltsverzeichnis des Soundtracks. Na gut, dachte ich mir, wollen
wir den Test mal etwas anders als sonst beginnen, und so habe ich mir
zuerst den Soundtrack reingezogen. Und was h&ouml;re ich da? 15 stimmungsvolle
Tracks, meist im harten Gangsta-Rap-Stile aber zum Teil auch mit richtigen
Pop-Perlen (Anspieltipps: 03-crime in 99 (venom records), 07-the general
(dispatch) und 08-bleed (cynic guru)). Es lohnt sich wirklich, dieses Album
einmal separat zu h&ouml;ren.
</P>
<P>
Mein positiver Eindruck wird durch die Installation noch verst&auml;rkt: Es
stehen Installer f&uuml;r neun Sprachen zur Verf&uuml;gung, so da&szlig; dieses Spiel
wirklich als international bezeichnet werden kann. Schnell werden die
ben&ouml;tigten Daten, wahlweise mit oder ohne Intro, auf die Festplatte
gespielt. In der nun entstandenen Schublade befindet sich jetzt das Start-
Icon, ein Setup-Programm um die gew&uuml;nschte Aufl&ouml;sung einzustellen sowie ein
Mapeditor (hierzu mehr im Fazit) und eine Anleitung f&uuml;r diesen. Nachdem uns
ein stimmungsvolles, gerendertes Intro in das Spielgeschehen eingef&uuml;hrt
hat, kann es nun endlich losgehen: Wir starten unsere Laufbahn auf der
anderen Seite des Gesetzes!
</P>
<P>
<A HREF="img/Payback2.jpg"><IMG SRC="thumb/Payback2.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bevor wir allerdings als Gangster durch die Stra&szlig;en ziehen k&ouml;nnen, gilt es,
einige Einstellungen vorzunehmen. Hierf&uuml;r gibt es einen sehr gut gemachten
Optionsschirm. Im Hintergrund sehen wir das Bild einer Stadt, im
Vordergrund gro&szlig;e animierte Objekte, passend zum jeweiligen Men&uuml;punkt. Ein
Joystick zum Starten, eine CD zur Einstellung des CD-ROM-Devices, eine
Weltkugel f&uuml;r die Sprache usw. Hier kann man auch w&auml;hlen, ob der
Musiksoundtrack durchgehend gespielt werden soll oder die St&uuml;cke nur dann
laufen, wenn man sich im einem Wagen befindet (Radio). Es lassen sich
abgespeicherte Spielmitschnitte oder aber auch das Intro nochmals anschauen
sowie schon gespeichterte Spiele starten. Wir aber beginnen ein neues
Spiel. Dazu m&uuml;ssen wir erst einmal unser Pseudonym eingeben und zwischen
Ein- und Mehrspielermodus w&auml;hlen. Im Einspielermodus geht es darum,
m&ouml;glichst viel Geld zu sammeln, um in der Gangsterhierarchie nach ganz oben
zu gelangen. Dies l&auml;&szlig;t sich auf verschiedenste Weise gestalten: F&uuml;r jede
illegale Tat gibt es Geld. Also kann man einfach herumlaufen und Wagen
stehlen, Leute zusammenschlagen oder Frauen &uuml;berfahren. Auch werden an
bestimmten &ouml;ffentlichen Telefonzellen Auftr&auml;ge angeboten, um sich noch mehr
Geld zu verdienen. Diese reichen vom Steuern eines Fluchtfahrzeugs &uuml;ber
Autodiebstahl und Drogenschmuggel bis hin zum Auftragsmord. Auch einige
versteckte Missionen gibt es. Diese sind zwar meist schwerer, bringen aber
auch mehr Geld. So mu&szlig; man z.B. in einer Milit&auml;rbasis einen Panzer stehlen
und damit Amok fahren!
</P>
<P>
<A HREF="img/Payback3.jpg"><IMG SRC="thumb/Payback3.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Technisch wurde Payback ziemlich perfekt umgesetzt. Man sieht das ganze
Spiel von oben. Oben rechts in der Ecke befindet sich ein Radar, wo man
immer den aktuellen Standort und den jeweiligen Zielort (wenn es denn einen
gibt) sehen kann. Hier sieht man auch, wieviele &quot;Leben&quot; man noch und
wieviel Geld man schon hat. Der Rest wird von der Stadt eingenommen. Aber
das Spielfeld ist nicht wie z.B. bei Sensible World of Soccer platt,
sondern wird mittels einer 3D-Engine dargestellt. So kann man die H&ouml;he der
verschiedenen Geb&auml;de absch&auml;zen, der Betrachter schaut ganz nah auf die
Person, wenn sie langsam ist und geht automatisch in die Ferne, wenn es
sich um ein schnelles Fahrzeug handelt. So hat man immer den perfekten
&Uuml;berblick. Auch wenn irgendetwas den Blick versperrt, st&ouml;rt das nicht
sonderlich: Ein blauer Pfeil zeigt immer, wo sich unser Held befindet und
in welche Richtung er blickt. Steuerungstechnisch ist es da schon etwas
komplizierter. Bei der Steuerung mit dem Joystick benutzt man Rechts und
Links, um die Blickrichtung zu drehen. Mit Hoch und Runter geht man dann in
diese Richtung oder halt r&uuml;ckw&auml;rts. Das hei&szlig;t aber auch, da&szlig; man in manchen
Situationen den Joystick nach oben halten mu&szlig;, um auf dem Spielfeld nach
unten zu gehen (n&auml;mlich genau dann, wenn man nach unten guckt). Beim Fahren
wird es aufgrund der Geschwindigkeit noch einen Tick schwerer. Dazu kommt
noch der Linksverkehr, da es sich um ein englisches Spiel handelt, und zum
Ein- und Aussteigen mu&szlig; die Tastatur benutzt werden. Ebenso zum Ausw&auml;hlen
der Waffen und Benutzen der Handbremse. Besser klappt es da schon, wenn man
eine CD32- oder PSX-Pad hat. Beide werden perfekt unterst&uuml;tzt. Schade ist
nur, da&szlig; die Tastaturbelegung fix ist und sich nicht &auml;ndern l&auml;&szlig;t. Aber ich
will ja nicht nur meckern: Eine zus&auml;tzliche Hilfe wurde eingebaut, indem
ein Pfeil immer in die Richtung zeigt, in die man sich bewegen mu&szlig;, so kann
man sich kaum verirren.
</P>
<P>
<A HREF="img/Payback4.jpg"><IMG SRC="thumb/Payback4.jpg" WIDTH="120" HEIGHT="77" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Die Screenshots vermitteln ein bisschen von der Qualit&auml;t des Spiels, aber
bei weitem nicht alles. Payback ist gespickt von grafischen Schmankerln.
Fangen wir bei den verschiedenen Leveln an: Die Texturen sind &uuml;ber jeden
Zweifel erhaben und erwecken gerade in den hohen Aufl&ouml;sungen einen sehr
realistischen Eindruck. Aber das ist noch nicht alles. Der zweite Level
spielt komplett im Schnee. Und nicht nur das Fahrverhalten &auml;ndert sich
hier, auch hinterlassen die Fahrzeuge und Personen Spuren im Schnee,
Schneeflocken fallen permanent vom Blickwinkel des Betrachters aus zu
Boden, und auf dem Wasser hat sich eine Eisschicht gebildet. In der dritten
Stadt ist es Nacht. So kommen hier die Lichteffekte wie die Explosionen
besonders zur Geltung. Auch ein Gewitter mit Blitzen und feiner Nieselregen
wissen zu begeistern. Es gibt Lensflares, und die Schatten werden in
Echtzeit berechnet! Diese Ansamlung von Effekten wirken an mancher Stelle
nat&uuml;rlich unrealistisch (wenn man z.B. mit der Shotgun schie&szlig;t, gibt es
eine kleine Explosion mit Lensflares beim Schie&szlig;en, man kann die Kugeln
verfolgen, und beim Einschlag in eine Pappfigur gibt es eine riesige
Explosion mit Schockwellen!). Klar: unrealistisch, aber GEIL! Solche
Effekte hat man auf einem 68k-Amiga meines Wissens noch nie gesehen. Es
gibt zig verschiedene Fahrzeuge, alle mit unterschiedlichem Fahrverhalten.
Probiert mal den Eiswagen! Der ist cool. Am schnellsten sind in der Regel
die Polizeiwagen, aber diese zu stehlen, bedeutet auch das meiste Risiko.
Nat&uuml;rlich! Habt ihr wirklich gedacht, ihr k&ouml;nnt rumfahren, stehlen,
zerst&ouml;ren oder sogar t&ouml;ten ohne da&szlig; euch die gerechte Strafe ereilt? Oben
am Bildschirm tauchen nach und nach Sterne auf. Je mehr dort sind, desto
mehr &Auml;rger bekommst du. Ab einer gewissen Anzahl gibt es Stra&szlig;ensperren und
ab sechs Sternen wird ohne Vorwarnung geschossen. Bei der ersten Stadt sind
die Bullen noch ziemlich harmlos und beruhigen sich, sobald du eine
Zeitlang ruhig bist oder den Wagen wechselst. Aber das bleibt nicht immer
so.
</P>
<P>
<A HREF="img/Payback5.jpg"><IMG SRC="thumb/Payback5.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Wenn ihr jetzt sagt: Das h&ouml;rt sich nach meinem Spiel an, dann habe ich mein
n&auml;chstes Stichwort. Denn nicht nur das Auge wird bei Payback durch die
grafischen FX verw&ouml;hnt, auch das Ohr kommt nicht zu kurz. Neben dem bereits
angesprochenen, ultrageilen Soundtrack sorgen die SoundFX f&uuml;r richtige
Stimmung. Die Schritte h&ouml;ren sich unterschiedlich an, je nachdem auf
welchem Belag man gerade geht (Asphalt, Rasen, Schnee...). Die ganze Stadt
ist erf&uuml;llt von Stra&szlig;enl&auml;rm und das Quitschen der Reifen ist sehr
realistisch. Wenn der Wagen einen Defekt hat, h&uuml;llt er sich in schwarzen
Rauch und der Motor f&auml;ngt an zu klappern. Und so geht es immer weiter: Es
gibt Dutzende von Ger&auml;usche, die Payback wirklich zu etwas Besonderem
machen: T&uuml;rschlagen, Explosionen, Sirenen, Hilferufe angefahrener Personen
usw.
</P>
<P>
WOW!!! Aber das ist noch lange nicht alles, denn Payback verf&uuml;gt auch &uuml;ber
einen ultrageilen Mehrspielermodus. Deathmatch ist angesagt. Bis zu vier
Personen k&ouml;nnen gegeneinander antreten. Leider ist dies (noch) nicht &uuml;ber
Netzwerk oder (Null)Modem m&ouml;glich, daf&uuml;r aber im Splitscreen. Und das macht
echt Laune. Man kann einstellen, wieviele Kills man braucht, um zu
gewinnen, und wo man spielen m&ouml;chte. Hierzu lassen sich per Mapeditor auch
noch eigene Level erstellen. WAHNSINN! Alles in allem ist Payback f&uuml;r mich
das erste Spiel des Jahres. Wer wei&szlig;, was noch alles kommt, aber bis dahin
steht mein Lieblingsspiel fest. Hier stimmt einfach alles: ultrageniales
Gameplay (allerdings abgeschaut, da es sich nur um einen GTA-Clone
handelt), superausgereifte Grafikeffekte und spitzenm&auml;&szlig;iger Sound. Es
bleibt eigentlich nur noch zu erw&auml;hnen, da&szlig; in diesem Spiel Gewalt
verherrlicht wird. Dies geschieht zwar auf eine so &uuml;bertriebene Art, da&szlig; es
schon fast als ironisch einzustufen ist, aber trotzdem sollte man das Spiel
nicht gerade in die H&auml;nde von kleinen Kindern gelangen lassen. Wer sich
also nicht damit abfinden kann, da&szlig; es Punkte beim &Uuml;berfahren von Personen
und einen BULLENKILLERBONUS gibt, sollte wirklich die H&auml;nde von diesem
Spiel lassen!!!
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
