<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Is there anybody out there?!</B></P>
<P>
Die internationalen Raumfahrtbeh&ouml;rden arbeiten an einem Projekt, einem
schier gigantischen Projekt... die Raumstation Alpha (ISS) ist nur der
Sprung in die Weite des Alls. Zur&uuml;ck zum Mond, zum Mars und (wenn Stanley
Kubrick das noch erlebt h&auml;tte) irgendwann auch mal zum Jupiter und dar&uuml;ber
hinaus.
</P>
<P>
Die Menschheit br&uuml;stet sich mit stolzgeschwellter Brust &uuml;ber die gro&szlig;en
Schritte in eine neue Zeitepoche. Der Einflu&szlig;bereich der menschlichen Hand
(und meinetwegen auch der F&uuml;&szlig;e) wird erweitert. Potentielles au&szlig;erirdisches
Leben wurde in versteinerter Form in einem Marsmeteoriten entdeckt. Wie
aufregend...
</P>
<P>
Ich sitze vor meiner Amiga und surfe im Internet. Jedenfalls versuche ich
es. Aber der Wahnsinn &uuml;berf&auml;llt mich langsam... ich bin schon auf der
f&uuml;nften Website in Folge mit dem Hinweis &quot;Sie benutzen einen Browser der
dritten Generation. Um diese Seite besuchen zu k&ouml;nnen brauchen Sie jedoch
einen Browser der vierten oder f&uuml;nften Generation&quot; gequ&auml;lt worden. Upps...
Microsoft und Netscape lassen freundlich gr&uuml;&szlig;en.
</P>
<P>
So dem&uuml;tigend habe ich mir bislang noch nie vor Augen f&uuml;hren lassen m&uuml;ssen,
dass die von mir ben&uuml;tzte Software wohl in keinster Weise mehr dem Stand
des M&ouml;glichen entspricht.
</P>
<P>
Wie stolz war ich vor etwas &uuml;ber drei Jahren, als mein erster Browser
(IBrowse 1.2) und mein erster Stack (Miami 2.wei&szlig; der Geier was) die ersten
Lebenszeichen des globalen, weltumspannenden Netz der Netze auf meinen
Bildschirm zauberten. Ich war sowas wie ein bunter Hund unter meinen
Kollegen, der erste, der Zugang zur Welt hatte. Wie global. Und jetzt?
Jetzt mu&szlig; ich mich mit solchem Kinderkram rum&auml;rgern. Ausgegrenzt...
abgenabelt von der Welt. Keine Website liebt mich mehr...
</P>
<P>
Pl&ouml;tzlich kommt mir da ein Gedanke... war da nicht mal so eine Firma, die
schnell ein neues Amiga-Betriebssystem auf den Markt bringen wollte? War da
nicht auch die Rede von einem neuen Browser?
</P>
<P>
Ja richtig, nur ist mir der genaue Name dieser Firma momentan entfallen.
Schlie&szlig;lich hat sich dieser ja schon so oft ge&auml;ndert. Und bei jeder
Namens&auml;nderung kamen auch wieder neue Pl&auml;ne... vom Bleistift &uuml;ber das
Kickboard bis zum Raumschiff Enterprise (oder war's die Voyager?) sollte
alles mit dem Boingball funktionieren.
</P>
<P>
Ein Fingerschnipp, und ein neuer Planet (rot-wei&szlig; kariert) sollte
automatisch konstruiert werden. Und wir als gro&szlig;e Community sind ja alle so
toll, nett und lieb. Das hat man uns gesagt.
</P>
<P>
Die Realit&auml;t hat mich wieder. Ein letzter Versuch soll mich auf die Seite
der Amiga-News bringen. Und tats&auml;chlich... es funktioniert. Mmmh, mal
sehen, was so aktuell ist. Aha, ein neuer offener Brief von Amiga Inc. Ein
sogenanntes &quot;Executive Update&quot;. Aber alles, was ich bis jetzt gelesen habe
h&ouml;rte sich eher immer wie ein &quot;may-sometimes-be-executed/released-update&quot;
an. Aber die Rettung naht von unvorhersehbarer Seite.
</P>
<P>
Das Telefon klingelt und eine Bekannte k&uuml;ndigt ihren baldigen Besuch an.
Bevor ich den offenen Brief studieren kann, klicke ich auf den &quot;Offline&quot;-
Button von Miami, und die Verbindung zum letzten Reservat der sch&ouml;nen
Tagtr&auml;ume wird gekappt. Irgendwie ist mir pl&ouml;tzlich wurscht, was Amiga Inc.
zu sagen hat.
</P>
<P>
Mal sehen, wie es weitergeht in den n&auml;chsten Wochen. Vielleicht wurde ja
gerade in diesem &quot;Newsletter&quot; die Entwicklung einer intelligenten Klobrille
mit Kabelfernsehanschlu&szlig; angek&uuml;ndigt. Etwas praktisches... das bringt die
Menschheit voran. Die Sch.... im Fernsehen bekommt gnadenlose Konkurrenz.
</P>
<P>
Lebt lang und erfolgreich...
</P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
