<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x05 - TCP/IP: I-Net 225</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x007B.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x007A.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x007C.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="../images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0078.html">WGet</A> | <A HREF="0x0079.html">Programmieren</A> | <A HREF="0x007A.html">TCP/IP: AmiTCP</A> | <A HREF="0x007B.html">TCP/IP: I-Net 225</A> | <A HREF="0x007C.html">Tunnel-Anims</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x006F.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0070.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0071.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0072.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0073.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0074.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0078.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x007D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x007E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x007F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0080.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>TCP/IP (Teil 3b): I-Net 225</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Auf dem Amiga gibt es mehrere TCP/IP-Stacks zur
Auswahl. Einer davon, der bei uns weniger verbreitet ist, hei&szlig;t I-Net
225 und ist von der amerikanischen Firma Interworks. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Dabei handelt es sich um einen direkten Nachfahren des einst von Commodore
entwickelten AS225, welcher unter registrierten ADSP-Entwicklern, denn er
war aufgrund seines Beta-Status nur diesen zug&auml;ngig, eine gewisse
Verbreitung gefunden hat. Durch diese Abstammung arbeiten somit auch alle
Programme, die f&uuml;r das alte AS225 geschrieben wurden, mit dem I-Net
225 zusammen. Jedoch haben in der Zwischenzeit andere TCP/IP-Stacks wie
AmiTCP und Miami eine weitere Verbreitung erfahren und
ungl&uuml;cklicherweise sind diese nicht mit AS225 oder I-Net 225
kompatibel, da sich deren Socket-Schnittstellen unterscheiden. Somit ist in
diesem Fall die Vielzahl der TCP/IP-Implementationen eigentlich als
Nachteil anzusehen und wir haben damit am Amiga eine Situation, wie sie in
fr&uuml;heren PC-Tagen &uuml;blich war.<BR>

<BR>Etwas gelindert wird diese Situation durch die M&ouml;glichkeit, den einen
TCP/IP-Stack durch den jeweils anderen zu emulieren. Im Falle des I-Net 225
handelt es sich dabei um die bsdsocket.library, welche diesem eine
AmiTCP-kompatible Schnittstelle verschafft. Diese Library kann von <A
HREF="http://www.iworks.com/">http://www.iworks.com</A> heruntergeladen
werden. Jedoch ist sie nicht hundertprozentig fertig und es laufen auch
nicht alle Programme damit.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Interworks verkauft sein I-Net 225 in zwei verschiedenen
Gr&ouml;&szlig;enordnungen: Eine mit einer Lizenz f&uuml;r nur einen
Rechner und eine mit einer Lizenz f&uuml;r f&uuml;nf Rechner. Diese
unterschieden sich auch im Umfang der mitgelieferten Komponenten und in der
Serviceleistung. In der 5-Rechner Lizenz ist bereits der NFS-Server
enthalten, w&auml;hrend dieser bei der Einzellizenz extra erworben werden
mu&szlig;. Auch beinhaltet die 5-Rechner Lizenz einen telefonischen Support
Service.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Seine St&auml;rken hat das I-Net 225 bei der Vernetzung &uuml;ber Ethernet,
denn es gibt neben dem FTP auch einen NFS-Client und NFS-Server, &uuml;ber
welche Dateien ausgetauscht werden k&ouml;nnen. Beide arbeiten
zuverl&auml;ssig, jedoch hat der NFS-Server die schon vom AS225 bekannte
unangenehme Eigenschaft, da&szlig; er f&uuml;r alle exportierten Laufwerke
oder Verzeichnisse ein sogenanntes Mapfile ben&ouml;tigt. In diesem werden
die von Unix-Systemen verwendeten Userkennungen und Zugriffsberechtigungen
gespeichert, die im Dateisystem des Amiga nicht untergebracht werden
konnten. Dies erm&ouml;glicht zwar eine vollst&auml;ndige Abbildung aller
von Unix-Rechnern bekannten Attribute auch auf vom Amiga exportierten
Verzeichnissen, jedoch hat diese Methode auch einige gravierende Nachteile.
Erstens wird der Zugriff verlangsamt, da auch das Mapfile st&auml;ndig
aktualisiert werden mu&szlig; und zweitens darf auf exportierte
Verzeichnisse auch auf dem eigenen Rechner nicht mehr direkt geschrieben
werden, da ansonsten dieses Mapfile nicht aktualisiert wird und dann das
ganze System durcheinander kommt. Man mu&szlig; somit die &uuml;ber NFS
exportierten Verzeichnisse selbst wieder &uuml;ber den NFS-Client mounten
und darf schreibend nur auf diese importierten Laufwerke zugreifen, was
jedoch um einiges langsamer geht, als der direkte Zugriff.<BR>

<BR>Der einzige sinnvolle Einsatz ist also, bestimmte Verzeichnisse anzulegen,
die explizit zum Exportieren gedacht sind. Alle Dateien, auf die von
anderen Rechnern zugegriffen werden soll, kann man dort ablegen. Einfach
schnell einmal ein Verzeichnis freigeben, wie es unter Envoy m&ouml;glich
ist, kann man vergessen. Auch die Freigabe von CD-ROMs ist damit
unn&ouml;tig erschwert, da auch hierf&uuml;r ein Mapfile angelegt werden
mu&szlig;, obwohl man auf diese ohnehin nichts schreiben kann.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Zum Ausdrucken &uuml;bers Netzwerk existiert ein lpr-Programm. Damit kann
man auf einem entfernten Drucker drucken. Dies erfolgt jedoch nicht auf der
Amiga-&uuml;blichen Art, sondern es mu&szlig; bei diesem Programm der Name
einer Datei angegeben werden, die gedruckt werden soll. Es ist somit nicht
m&ouml;glich, einen entfernten Drucker wie einen lokalen anzusprechen. Das
Gegenst&uuml;ck zum lpr, n&auml;mlich der lpd, ist auch im Lieferumfang
enthalten. Dadurch kann der Amiga seinen Drucker anderen Rechnern am Netz
zu Verf&uuml;gung stellen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Folgende Client-Programme sind enthalten:<BR>

<BR><TT>arp, chmod, chown, finger, ftp, host, ifconfig, login, lpr, ls,
ncftp, netstat, nfsc, nfsmgr, passwd, ping, rcp, rsh, rlogin, route,
showmount, telnet, traceroute, whois und weitere.</TT><BR>

<BR>Folgende Server-Programme sind eintahlten:<BR>

<BR><TT>fingerd, ftpd, inetd, lpd, portmapd, rshd, syslogd, telnetd, timed,
wprintd</TT><BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Folgende Internet-Utilities sind enthalten:<BR>

<BR>
<TT>GMail&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Ein einfacher Intuition-basierender Mail-Reader
<BR>GRn&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Ein einfacher Intuition-basierender News-Reader
<BR>SMTPd&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Ein Mail protocol daemon
<BR>SMTPpost&nbsp;&nbsp;&nbsp;- Ein SMTP posting Programm
<BR>SMTPExpand&nbsp;- Ein SMTP aliases expanding Programm
<BR>NNTPpost&nbsp;&nbsp;&nbsp;- Ein NNTP posting Programm
<BR>NNTPXfer&nbsp;&nbsp;&nbsp;- Ein NNTP article transfer Programm
<BR>newgroup&nbsp;&nbsp;&nbsp;- Ein Verwaltungsprogramm f&uuml;r NNTP
<BR>GetActive&nbsp;&nbsp;- Ein NNTP active file transfer Programm
<BR>AmiPOP&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- Ein POP message handler von Scott Ellis
</TT>
<BR>

<BR>Auf einer weiteren Extras-Diskette werden noch folgende Programme
mitgeliefert:<BR>

<BR>
<TT>AWeb  - Eine unregistrierte Demoversion des Internet Web Browser von AmiTrix Development
<BR>DaFTP - Ein einfach zu bedienendes, mit grafischer Bedienoberfl&auml;che versehenes FTP-Program von Mutant Soup Software
<BR>PPP v1.45 - Eine unregistrierte Demoversion des ppp.device von Holger Kruse
</TT>
<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Mit den mitgelieferten Programmen rlogin und telnet kann man sich also auch
auf anderen Rechnern im Netz einloggen. Auch das Einloggen auf dem Amiga
von einem anderen Rechner wird durch telnetd und rshd erm&ouml;glicht.
Einfache Mail- und Newsreader (GMail und GRn) werden mitgeliefert.<BR>

<BR>Grunds&auml;tzlich steht einem mit den mitgelieferten Shareware-Programmen
auf der Extras-Diskette der Weg ins Internet offen. Jedoch mu&szlig; man
dann fr&uuml;her oder sp&auml;ter diese Programme noch registrieren, um den
vollen Funktionsumfang zu erm&ouml;glichen. Zumindest das ppp.device
h&auml;tte schon in einer registrierten Version vorhanden sein k&ouml;nnen.<BR>

<BR>Die Anbindung zur Netzwerkkarte oder der seriellen Schnittstelle erfolgt
&uuml;ber SANA-II-Devices. Dabei werden folgende Devices schon
mitgeliefert: a2060.device, a2065.device, a4066.device, hydra.device,
icard.device, plip.device, ppp.device und das slip.device. Aber auch mit
der Ariadne arbeitet das I-Net 225 ohne Probleme zusammen.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Leider gibt es f&uuml;r I-Net 225 keinen Vertrieb in Europa und man
mu&szlig; es direkt beim Hersteller in Amerika bestellen, was einerseits
l&auml;stig und andererseits mit gro&szlig;en Kosten (Zoll und Versand)
verbunden ist. Weiters scheint die Weiterentwicklung in letzer Zeit
gestoppt. Zumindest sind schon seit geraumer Zeit keine neuen Komponenten
mehr herausgekommen. Auch das l&auml;ngst angek&uuml;ndigte gedruckte
Handbuch ist bis jetzt noch nicht erschienen. Man kann sich jedoch eine
Vorabversion von diesem als PostScript-Datei von der Interworks-Seite
herunterladen. Grunds&auml;tzlich sind auch zahlreiche Dokumente im
AmigaGuide-Format beim Lieferumfang enthaltenen. S&auml;mtliche
Dokumentation sowie alle Bedienoberfl&auml;chen existieren nur in
englischer Sprache.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Installation wird &uuml;ber den standard Installer abgewickelt. Zur
Konfiguration des Netzwerks, was &uuml;blicherweise sehr kompliziert und
aufwendig sein kann, werden zwei Programme Quick_Prefs und I-Net_Prefs
mitgeliefert, welche diese Prozedur sehr erleichtern. Mann kann jedoch auch
alles h&auml;ndisch mit Hilfe von Konfigurationsdateien konfigurieren, wenn
man will. Der gesamte Aufbau und die einzelnen Programme &auml;hneln stark
ihren Vorbildern auf Unix-Rechnern, weshalb Benutzer, die sich in diesem
Betriebssystem auskennen, mit der Konfiguration leichter tun werden.<BR>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Insgeammt betrachtet ist das I-Net 225 gut geeignet f&uuml;r die Einbindung
des Amiga in ein TCP/IP-Netz, die Stabilit&auml;t ist sehr hoch und es
h&auml;tte eigentlich alle Voraussetzungen gehabt, sich als Standard in
diesem Bereich zu etablieren. Derzeit sind jedoch die AmiTCP-Kompatiblen
TCP/IP-Stacks nicht zuletzt aufgrund von Miami, mit seiner hervorragenden
Anbindung ans Internet, wesentlich weiter verbreitet und
kosteng&uuml;nstiger zu haben.<BR>

<BR>Will man jedoch seinen Amiga haupts&auml;chlich in ein bestehendes
TCP/IP-Netzwerk einbinden und dort &uuml;ber NFS auf die Platte anderer
Rechner zugreifen, dann ist man mit dem I-Net 225 sicher gut beraten.<BR>

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#thomas">Thomas &Ouml;llinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x007B.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.iworks.com/">http://www.iworks.com</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x0050.html">Workshop Teil 1</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_05/prefs.gif">Prefs</A> (GIF; 16K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x0066.html">Workshop Teil 2</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x007A.html">Workshop Teil 3a</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_05/programme.gif">Programme</A> (GIF; 20K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x007A.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x007C.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
