<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x05 - Tornado3D</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0077.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0076.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0078.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0074.html">Elastic Dreams</A> | <A HREF="0x0075.html">Easy Writer</A> | <A HREF="0x0076.html">Wordworth</A> | <A HREF="0x0077.html">Tornado3D</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x006F.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0070.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0071.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0072.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0073.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0074.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0078.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x007D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x007E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x007F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0080.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Tornado3D V1.5b</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Bereits seit einem Monat ist das Update von Tornado3D
V1.0 auf V1.5 f&uuml;r registrierte User auf der Eyelight- bzw. Tornado3D <A
HREF="http://www.tornado3d.com/">Homepage</A> erh&auml;ltlich. Dort kann
neuerdings auch eine Demoversion von V1.5 (mit eingeschr&auml;nkten
M&ouml;glichkeiten beim Rendern) heruntergeladen werden, dies sind dann 3
Archive zu je ca. 600KB. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Gleich vorweg: Wer nur die Release 1.0e besitzt, darf sich nicht
wundern, wenn ihm ein paar <A HREF="#99">Files</A> fehlen, denn beim Update
bekommt man lediglich (oder besser gesagt Gott sei Dank) nur das neue
T3D-Executable zugeschickt. Also sollte man sich von besagter Homepage die
Demo-Archive &quot;B&quot; und &quot;C&quot; besorgen und die fehlenden
Files kopieren - siehe da, die Tips beim Start funktionieren auf einmal und
die Men&uuml;s erscheinen sogar in deutscher Sprache. Nachfolgend eine
&Uuml;bersicht (die ganz neuen Dateien sind <B>fett</B>, die zu
aktualisierten Dateien <U>unterstrichen</U>, die mit einem &quot;!&quot;
findet man sogar versteckt auf der CD der Version V1.0):<BR>

<BR><TABLE WIDTH="90%" BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=TOP><TD>catalogs/<B>deutsch</B></TD><TD><B>tornado3d.catalog</B></TD></TR>
<TR VALIGN=TOP><TD>lothlorien</TD><TD><U>galadriel.elf</U></TD></TR>
<TR VALIGN=TOP><TD>maps/<B>bumps</B></TD><TD><B>TieWingBump.24</B></TD></TR>
<TR VALIGN=TOP><TD>maps/environment</TD><TD><U>GoldEnvio.24</U>, <U>MetalEnvio.24</U></TD></TR>
<TR VALIGN=TOP><TD>maps/misc</TD><TD><B>Burn.24</B>, <B>BurnClip.24</B>, <B>MiddleAge.24</B>, <U>SatelliteRefMap.24</U></TD></TR>
<TR VALIGN=TOP><TD>maps/space</TD><TD><B>VenusSmall.24</B></TD></TR>
<TR VALIGN=TOP><TD>maps/stones</TD><TD><U>FloorTile.24</U>, <U>OrangeMarble.24</U>, <U>TexturedStone.24</U></TD></TR>
<TR VALIGN=TOP><TD>materials</TD><TD><B>Alluminium.mat</B>, <B>Bronze.mat</B>, <U>CherryRed.mat</U>, <B>ColoredBall.mat</B>, <B>ColorMetal.mat</B>, <B>FactoryGreen.mat</B>, <B>GoldText.mat</B>, <U>Green.mat</U>, <B>LizardSkin.mat</B>, <B>MokaMetal.mat</B>, <B>Paint.mat</B>, <B>TechMetal.mat</B>, <B>WhitePlastic.mat</B></TD></TR>
<TR VALIGN=TOP><TD>objects</TD><TD><B>FaceMask.tor</B>, <B>Marker.tor</B>, <B>SnowMan1.tor</B></TD></TR>
<TR VALIGN=TOP><TD>plug-in/textures</TD><TD><B>Bricks.ptx</B>, <U>Crumpled.ptx</U>, <U>Fireball.ptx</U> (!), <U>Gradient.ptx</U>, <U>Granite.ptx</U> (!), <B>Wave.ptx</B></TD></TR>
<TR VALIGN=TOP><TD>projects</TD><TD>[viele neue Projekte]</TD></TR>
<TR VALIGN=TOP><TD><B>system</B></TD><TD><B>data</B>, <B>objrecentload</B>, <B>prjrecentload</B>, <B>tips</B></TD></TR>
</TABLE>&nbsp;

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Objekte &amp; Projekte</B></H3>&nbsp;

<BR>Was hat sich nun ver&auml;ndert? Beim Laden von Objekten und Projekten
kann man nun die 6 letzten &uuml;ber das Men&uuml; laden (ohne
ASL-Requester), bei Druck auf &quot;Help&quot; und beim Starten des
Programms (abstellbar) bekommt man ein paar hilfreiche Informationen
angeboten. Das &quot;Redraw&quot; mu&szlig; nun nicht mehr nach beinahe
jedem Schritt manuell ausgef&uuml;hrt werden, und falls man einen schwachen
Prozessor sein eigen nennt, kann man f&uuml;r polygonale, Spline- und
implizite Objekte die Redraw-Settings ver&auml;ndern. Export funktioniert
nach wie vor nur als DXF-Objekt, neuerdings kann man jedoch auch Imagine-
und Lightwave Objekte importieren. Weil Lightwave ein &quot;anders
drehendes&quot; Koordinaten System zur Grundlage hat als Tornado3D, gibt es
zum Beispiel den Schalter &quot;Vertausche X- und Y-Koordinate&quot;. Eine
weitere sehr wichtige &Auml;nderung ist die, da&szlig; beim Speichern eines
Projektes alle Objekte mitsamt ihren Eigenschaften in ein zugeh&ouml;riges
Verzeichnis gespeichert werden - wie es sich ja geh&ouml;rt. So kann man
ein ganzes Projekt schneller irgendwohin kopieren, alles ist sch&ouml;n
&uuml;bersichtlich und die Objekte im &quot;Objects&quot; Verzeichnis
bleiben unangetastet, au&szlig;er man speichert sie explizit ab.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Von Eltern und Kindern</B></H3>&nbsp;

<BR>Ein weiterer gro&szlig;er Unterschied zur Vorversion besteht darin,
da&szlig; es nun nicht mehr 4 Editier-Modi gibt (Groups, Objects, Points,
Polygons) sondern nur mehr drei (Groups, Points, Polygons). Ja hoppla, wo
sind denn die Objekte hin, die brauchen wir ja schlie&szlig;lich! Keine
Sorge, es ist gewisserma&szlig;en so, da&szlig; der Gruppen- und
Objekt-Modus kombiniert worden ist. Das bringt gewisse Vorteile mit sich
(einen Modus weniger schalten), aber auch Nachteile: Man kann das
Mutter-Objekt nicht alleine selektieren, Tochter-Objekte schon. Mit denen
kann man daf&uuml;r alles machen (verschieben, rotieren, usw.), jedoch
nicht skalieren! Nur wenn man das Mutterobjekt selektiert (und somit
unweigerlich alle Tochterobjekte), kann man alle Objekte zusammen in der
Gr&ouml;&szlig;e ver&auml;ndern (s-cale). Die geht jedoch nur manuell. Will
man denselben Effekt &uuml;ber den &quot;Transformation Panel&quot;
erzielen (z.B. skalieren), dann wirkt sich dieser Effekt nur auf das
Mutterobjekt aus. Andererseits wird es durch den &quot;Transformation
Panel&quot; erst wieder m&ouml;glich, einzelne Tochter-Objekte zu
skalieren, was im Editor mit der Maus nicht m&ouml;glich ist.<BR>

<BR>Das klingt jetzt verwirrend und sinnlos, aber ganz so schlimm ist es
nicht: Der &quot;Transformation Panel&quot;, welcher f&uuml;r absolute
(bzw. relative) Ausrichtung (Rotation), Position (Translation) und
Gr&ouml;&szlig;e (Skalierung) zust&auml;ndig ist, wirkt leider immer nur
auf ein Objekt! Und zwar auf das Objekt, das entweder aktiv ist, oder bei
einem &quot;Multiselect&quot; als erstes selektiert wurde. Die Philosophie
von hierarchischen Eltern-Kind Objekten besagt angeblich, da&szlig; Kinder
sich bewegen und drehen (und miteinander spielen) d&uuml;rfen, aber nicht
wachsen (klar, dann sind sie ja keine Kinder mehr ;-) ). Und abgesehen
davon ist es ja Sinn der Sache, ein komplexes Objekt durch einen Mausklick
zu bewegen, und nicht alle hundert Objekte selektieren zu m&uuml;ssen. Es
bleiben also lediglich 2 Fragen offen: Warum darf man mit dem
&quot;Transformation Panel&quot; Kinder auf einmal skalieren und Eltern
pl&ouml;tzlich ganz alleine bewegen? Vielleicht wird in Version 2.0 doch
noch etwas unternommen, mehr Konsistenz zu schaffen, denn sogar im Handbuch
sind diese &quot;Features&quot; nur am Rande erw&auml;hnt.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Arbeiten</B></H3>&nbsp;

<BR>Nach wie vor gilt trotz der oben angef&uuml;hrten Ungereimtheiten,
da&szlig; das Arbeiten mit Tornado3D ein wahres Vergn&uuml;gen ist, nicht
zuletzt deshalb, weil das Programm so sch&ouml;n intuitiv zu bedienen ist,
was Men&uuml;s und Editor betrifft. So kann man wie gehabt mit dem linken
Mausknopf mehrere Men&uuml;punkte zugleich ausw&auml;hlen (welche sehr
&uuml;bersichtlich angeordnet sind) und mit den sch&ouml;nen Gadgets am
Rand (bzw. den Men&uuml;s) jede Funktion anw&auml;hlen. Mit Shift kann man
bei so manchem Requester eine Sicherheitsabfrage unterdr&uuml;cken, die
Gadgets darf man - wenn man Lust hat, selber neu zeichnen (sind als Icons
im Verzeichnis &quot;Gadgets&quot; gespeichert). Beim Editieren (bewegen,
rotieren, usw.) verdoppelt &quot;Shift&quot; den Effekt,
&quot;Control&quot; halbiert ihn (vgl.: mehr Kontrolle haben). Beim
Selektieren darf man mit Shift Multiselect machen oder mit Drag-Boxen wie
gehabt mehrere Objekte / Gruppen / Polygone / Punkte einfangen, Space
deselektiert alles, Backspace nur das zuletzt Aktivierte.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Hierarchie</B></H3>&nbsp;

<BR>Obwohl sich manch einer vielleicht weniger Hierarchie w&uuml;nscht, ich
fand zum Beispiel das System von Real3D einfach und genial - dort wurde die
Hierarchie in einem Objects-Fenster wie ein Verzeichnisbaum angezeigt, und
&Auml;nderungen wirkten sich entweder auf selektierte oder untergeordnete
Objekte aus. Tornado3D zeigt im &quot;Objects-Info&quot;-Fenster diese
Hierarchie ebenso an (nur da&szlig; man sie nicht so bequem ver&auml;ndern kann wie in
R3D), erlaubt daf&uuml;r jedoch andere M&ouml;glichkeiten beim Gruppieren. Ein
Beispiel: &quot;A&quot; ist der Vater von &quot;B&quot;. Ein neues Objekt
&quot;C&quot; kommt. Selektiert man &quot;C&quot;, dann &quot;A&quot;, so
ist die Hierarchie &quot;C-A-B&quot;. Somit ist der Vorteil ersichtlich,
warum bei Aktivierung eines Eltern-Objektes auch die &quot;Kinder -
Generationen&quot; mit aktiviert werden (so ist es ja auch in Real3D
implementiert). Hebt man die Gruppierung auf, so kommt es darauf an, ob
&quot;C-A-B&quot; oder nur mehr &quot;A-B&quot; aktiviert ist. Somit kann
man ein Kind &quot;aussetzen&quot;, wenn man jedoch einen Elternteil
freigibt, l&ouml;st sich gleich dessen ganze &quot;Familie&quot; auf. Die
L&ouml;sung, um die Gruppe &quot;A-B&quot; vor der Aufl&ouml;sung zu
bewahren ist: Man selektiert &quot;A&quot; (und somit unweigerlich
&quot;B&quot;) und macht Copy &amp; Paste.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Animationen, Editieren und Rendern</B></H3>&nbsp;

<BR>Bei den Animationen hat sich auch einiges getan: Man darf Keyframes per
Men&uuml; f&uuml;r Morphs, Transformationen (drehen, bewegen,
vergr&ouml;&szlig;ern) Eigenschafts- und hierarchische Ver&auml;nderungen
erzeugen (bzw. sie werden automatisch erzeugt, falls n&ouml;tig).
Desweiteren gibt es einen &quot;Pose-Manager&quot;, den ich noch nicht
durchblickt habe (die Zeit war einfach zu knapp!). Ein weiterer Vorteil
beim Animieren sind die Animationskurven: Man gibt keine Pfade vor, sondern
kann die komplette Animation (bis auf die grundlegenden Ver&auml;nderungen
der Objekte) vom &quot;Animation-Panel&quot; aus steuern. Weiteres:
&Uuml;berf&auml;hrt man mit der Maus den HotSpot eines Objekts, dann
&auml;ndert sich der Mauszeiger in ein Kreuz. Aufwendige Previews kann man
abbrechen, indem man mit der Maus in die linke obere Ecke des Bildschirms
f&auml;hrt.<BR>

<BR>Das Icon ganz links oben kann man anklicken, aber da passiert nichts.
Erst wenn man den Keyboard-Shortcut (Taste &quot;ALT&quot;) aktiviert,
sieht man, da&szlig; das Gadget &quot;gedr&uuml;ckt&quot; bleibt und man
kann nun in den 3 Ansichten (XY, YZ, XZ) hin- und herscrollen (wenn
&quot;M-ove&quot; aktiviert ist), heran- bzw. wegzoomen (wenn
&quot;S-cale&quot; aktiviert ist), nur drehen macht hier keinen Sinn. In
der 4.Ansicht, dem Preview Fenster, kann man hin- und herscrollen (wenn
&quot;M-ove&quot; aktiviert ist), heran- oder wegzoomen (wenn
&quot;S-cale&quot; aktiviert ist) und drehen (wenn &quot;R-otate&quot;
aktiviert ist). Hier wirken die Tasten Shift und Control als &quot;Snap to
Global Axis&quot; bzw. &quot;Snap to Camera Axes&quot;.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Beim Rendern sollte jeder selbst herausfinden, ob einem das Programm
&quot;liegt&quot;. Die Ergebnisse von Tornado3D lassen sich eher mit
Lightwave als mit Reflections oder Maxon Cinema4D vergleichen: Stichwort
&quot;Smooth&quot;. Die Szenen wirken dadurch extrem realistisch, weil
keine &quot;mathematische&quot; harte Kanten auftreten. Naja, ein
Lightwave-User wird trotzdem nur ein Grinsen &uuml;brig haben - das
Programm hat einfach schon so viele Jahre auf dem Buckel, Tornado3D steckt
noch sehr in den Kinderschuhen. Aber es macht Fortschritte. Generell:
Tornado3D hat eine Menge interessanter Features und mit Version 2.0, die
bei diesem Entwicklungstempo des beinahe Ein-Mann Teams um Massimiliano
Marras wohl bald erschienen wird, steht bereits fest, da&szlig; die
Render-Engine komplett PPC-native sein wird (als Vorgeschmack
l&auml;&szlig;t sich schon jetzt f&uuml;r Goraud Shading der PPC
an/abstellen). Allerdings hat es noch nicht ganz die Reife eines
&quot;Real3D&quot; oder den Umfang eines &quot;Lightwave&quot;. Leider.<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=81 HEIGHT=10 ALT="[81]"><IMG SRC="../images/_box_black.gif" WIDTH=19 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=73 HEIGHT=10 ALT="[73]"><IMG SRC="../images/_box_black.gif" WIDTH=27 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=91 HEIGHT=10 ALT="[91]"><IMG SRC="../images/_box_black.gif" WIDTH= 9 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=72 HEIGHT=10 ALT="[72]"><IMG SRC="../images/_box_black.gif" WIDTH=28 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=54 HEIGHT=10 ALT="[54]"><IMG SRC="../images/_box_black.gif" WIDTH=46 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=79 HEIGHT=10 ALT="[79]"><IMG SRC="../images/_box_black.gif" WIDTH=21 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#lutz">Bernhard Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0077.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.tornado3d.com/">Tornado3D Homepage</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Fehlende <A HREF="../images_05/t3d.lha">Files</A> aus der V1.5-Demo (ohne Projekte). (LHA;328K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0076.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0078.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
