<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x05 - Wordworth 7</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0076.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0075.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0077.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0074.html">Elastic Dreams</A> | <A HREF="0x0075.html">Easy Writer</A> | <A HREF="0x0076.html">Wordworth</A> | <A HREF="0x0077.html">Tornado3D</A> |

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x006F.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0070.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0071.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0072.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0073.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0074.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x0078.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x007D.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x007E.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x007F.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0080.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>WordWorth 7 - Ist das Wort sein Gold wert?</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">In der nun schon siebenten Version stellt nun diese
Textverarbeitung den Anspruch, sich mit einem &quot;Word&quot; messen zu
k&ouml;nnen. Aber zumindest im Umfang der Dokumentation schl&auml;gt es das
ungeliebte &quot;Vorbild&quot;(?) um L&auml;ngen. </FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Denn das Einzige, was der geneigte K&auml;ufer bekommt, ist eine CD.
Gut, sie ist in einem Cover drinnen, aber die gedruckte Anleitung ist nun
doch etwas sp&auml;rlich: &quot;Klicken Sie das
Wordworth-Programmpiktogramm im Verzeichnis Wordworth7 auf Ihrer Festplatte
doppelt an.&quot; Davor ist noch ein wenig davon zu lesen, da&szlig; es auf
der CD ein Installationsprogramm gibt.<BR>

<BR>Die Frage, die bleibt, ist, ob es nun gut ist, da&szlig; keine
gedruckte Dokumentation dabei ist. Im Inlet steht, da&szlig; zu jedem
Programm eine Online-Dokumentation dabei ist. Zumindest zu den
mitgelieferten Tools, mit denen man unter anderem nachtr&auml;glich weitere
Fonts installieren kann, habe ich keine Dokumentation gefunden. Die
Online-Dokumentation im Help/-Verzeichnis ist zwar 255K gro&szlig;, aber
nicht wirklich &uuml;bersichtlich.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Installation an sich verl&auml;uft unspektakul&auml;r und ohne
Probleme. Zur Einbindung von Grafiken n&ouml;tige Filter werden bei einer
Anf&auml;nger-Installation allerdings nur f&uuml;r IFF und CGM
mitinstalliert. Die restlichen Filter m&uuml;ssen dann danach selbst per
Hand von der CD auf die Platte kopiert werden, wenn sie gebraucht
werden.<BR>

<BR>W&auml;hrend der Installation wird nach dem Tabellenverzeichnis von
Turbocalc gefragt, damit diese Tabellen leichter importiert werden
k&ouml;nnen. Das Vorhandensein einer Grafikkarte will der Installer auch
noch wissen. Da auch eigene Druckertreiber verwendet werden k&ouml;nnen,
mu&szlig; auch der Drucker ausgew&auml;hlt werden, und zu guter Letzt
bleibt einem noch die Frage zu beantworten, ob Compugraphic-Fonts verwendet
werden sollen.<BR>

<BR>Allerdings kann bei den Druckereinstellungen wieder ein Workbench oder
Turboprint-Drucker ausgew&auml;hlt werden und so kann auch die sehr gute
Druckqualit&auml;t der Drucker genutzt werden. Man sollte allerdings nicht
auf die Idee kommen, in voller Aufl&ouml;sung und Farbe mit allen
m&ouml;glichen Gl&auml;ttungseinstellungen innerhalb endlicher Zeit zu
einem Druckergebnis kommen zu wollen. Der Druckertreiber ist der Schnellste
nicht.<BR>

<BR>Auffallend ist, da&szlig; auf der CD eine ganze Menge an Cliparts
gelagert sind, von diesen aber nur ein Bruchteil mitkopiert wird. Es
erfolgt auch nirgends der Hinweis darauf, da&szlig; es mehr dieser
Kleingraphiken g&auml;be. Man setzt also voraus, da&szlig; der Anwender
selber auf der CD zum St&ouml;bern anf&auml;ngt.<BR>

<BR>Die Installation der Fonts bewirkt eine Menge Files im
WWFonts/-Verzeichnis, die aber nur als eine Art Link zum echten FontFile
wirken. Allerdings m&uuml;ssen diese Links auch nachtr&auml;glich erst
&uuml;ber eines dieser undokumentierten CLI-Programme aus WWTools/
installiert werden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Nach dem Doppelklick auf das Programmicon erscheint erst einmal eine
gegen&uuml;ber der Vorg&auml;ngerversion nicht sehr ver&auml;nderte
Oberfl&auml;che. Hat man ein Wordworth in einer &auml;lteren Version
erkennt man auf Anhieb keine Unterschiede.<BR>

<BR>Als Erstes verwundert aber das ungewohnte Handling des Men&uuml;s: es
mu&szlig; erst einmal ein paar Pixel der Mauszeiger bei gedr&uuml;ckter
rechter Maustaste bewegt werden, bevor sich das Men&uuml; &ouml;ffnet. Das
ist ungewohnt und auch l&auml;stig.<BR>

<BR>Die Oberfl&auml;che an sich schaut einem Word nun doch sehr
&auml;hnlich. Auch die Struktur der Men&uuml;s ist vergleichbar aufgebaut.
Im Fenster eines Dokumentes gibt es verschiedene Leisten, mit denen der
Dokumentinhalt bearbeitet werden kann (Neue Datei, &ouml;ffnen,
schlie&szlig;en, usw...). Darunter liegt die &uuml;bliche Leiste f&uuml;r
die Text-Formatierungen. Auch Blocksatz kann nat&uuml;rlich verwendet
werden, Ein- und Ausr&uuml;ckungen festgelegt und Listenelemente erstellt
werden.<BR>

<BR>Die Verwaltung von Inhaltsverzeichnissen oder eines Index ist
allerdings nicht sehr komfortabel. Nach Erstellen eines Verzeichnisses sind
das f&uuml;r WordWorth nur mehr einzelne Textzeilen, die bei einem
Ver&auml;ndern der Listenelemente nicht mehr angepa&szlig;t werden. Das
Verzeichnis mu&szlig; daher dann immer wieder neu erzeugt werden.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Die Verwendung von Kopf- und Fu&szlig;zeilen ist zwar m&ouml;glich,
allerdings kann nicht innerhalb einer Zeile etwas rechtsb&uuml;ndig,
zentriert und linksb&uuml;ndig erscheinen, das geht nur in mehreren Zeilen.
Allerdings lassen sich automatisch aktualisiertes Datum, Zeit und
Filenamen, sowie Seitenzahlen verwenden.<BR>

<BR>Mit dem Men&uuml;punkt &quot;Objekt-Bild einf&uuml;gen&quot; kann man
relativ einfach und auch noch nach dem Einf&uuml;gen frei skalier- und
plazierbar Objekte, bzw. Bilder einf&uuml;gen. Allerdings funktioniert das
nicht ganz richtig, denn zu gro&szlig;e IFF-Bilder (so um 900K) bringen nur
die lapidare Fehlermeldung, da&szlig; kein passender Filter verf&uuml;gbar
sei. Kleinere Bilder lassen sich aber ohne Probleme laden. Genauso lassen
sich EPS-Dateien nicht konvertieren. Es wird zwar ein Rahmen angezeigt,
aber der Inhalt des Files ist weder am Bildschirm, noch am Ausdruck zu
sehen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>An Filtern f&uuml;r Bilder werden welche f&uuml;r BMP, CGM, GEM, GIF, IMG,
PCX und TIFF mitgeliefert,<BR>

<BR>Bei Texten gibt es die Filter f&uuml;r ASCII, MSWORD, MSWORKS, RTF,
WORDPERFECT und WORDSTAR.<BR>

<BR>Da wollte ich denn nun gleich ein einfaches Wordfile laden (aus Word 6.0,
sollte also keine gr&ouml;&uuml;eren Probleme darstellen), aber was ich
bekam, war eine eingebundene ASCII-Version des Wordfiles. Dieser Filter
scheint nicht sehr brauchbar zu sein. Allerdings ist es bei diesem genialen
Konzept, mit jeder neuen Programmversion des Word ein neues Dateiformat
einzuf&uuml;hren, ja auch nicht gerade leicht, Schritt zu halten. Aber ein
Word6.0-File h&auml;tte man schon laden k&ouml;nnen.<BR>

<BR>RTF-Files zu laden funktioniert dagegen ganz anstandslos und es sind auch
alle Formatierungen drinnen enthalten.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>An integrierten Zusatztools gibt es zum Beispiel eine Silbentrennung
inklusive den Hyphenation-Patterns f&uuml;r deutsch, die doch ziemlich gut
funktioniert. In ihrer Qualit&auml;t kommt sie fast an ein TeX heran, doch
bei Kleinigkeiten haperts dann wieder, aber was wollen wir? Ein Word kann
nicht mal das...<BR>

<BR>Automatische Rechtschreibkontrolle ist dabei schon fast genauso
obligatorisch wie ein Thesaurus, wenn mal wieder Mangel an
Alternativ-Ausdr&uuml;cken herrscht.<BR>

<BR>Mit den TextEffects lassen sich doch einige ganz ahnsehnlich Effekte
zustandebringen, wie im Screenshot zu sehen. Der Textumlauf kann entweder
vertikal oder konturiert erfolgen, jedoch leider nur auf einer Seite.<BR>

<BR>Beim Berechnen der TextEffects macht es sich schon bemerkbar: Auf
meinem 2000er mit 68030 bei 50MHz ist das Programm ziemlich tr&auml;ge. Zur
Berechnung des Linieneffektes braucht es schon mal einfach so eine gute
halbe Minute. Der Ringeffekt lies ziemlich genau 3 Minuten auf sich
warten.<BR>

<BR>Erfreulich ist, da&szlig; die Bewegungen des Mauszeigers sehr
fl&uuml;ssig sind und wirklich Amiga-Feeling aufkommen lassen, dagegen ist
es aber fast nicht mehr m&ouml;glich, ein 22-Seiten-Dokument ohne Grafiken
zu bearbeiten. Wordworth wird dabei so langsam, da&szlig; es zum Teil schon
Buchstaben vergi&szlig;t. Vor allem nach Neuplazierung des Cursors ist zwar
der erste Buchstabe da, aber alle weiteren, die vor Nachr&uuml;cken des
Cursors (das in diesem Fall ziemlich lange dauert) getippselt werden,
verschwinden einfach. Auch das Schreiben von einfachem Nonsense-Text, wie
unter den TextEffects im ScreenShot zu sehen, war nicht ganz so einfach, da
es immer wieder sekundenlange Pausen gab, bis der Text nachgeschrieben
wurde.<BR>

<BR>Eine h&auml;ufig gebrauchte Funktion w&auml;re auch, einen
PC-formatierten ASCII-Text einlesen zu k&ouml;nnen, und den dann wieder
ohne den Zeilenumbruchszeichen abzuspeichern. Das scheitert aber daran,
da&szlig; Wordworth die PC-Umlaute nicht erkennt, was aber jeder bessere
Texteditor zusammenbringt (der dann daf&uuml;r aber die zus&auml;tzlichen
Zeilenende-Zeichen nicht wegl&ouml;scht).<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ein interessantes Tool sind die neuen Quickshapes, die auf einer
kleinen freifliegenden Menu&uuml;zeile einfach anklickbare und plazierbare
kleine Grafikobjekte bieten. Diese Objekte (wie Quadrate, Kreise, Sterne,
Pfeile, Sprechblasen, ...) lassen sich auch nach dem Plazieren noch frei
skalieren und eignen sich somit hervorragend f&uuml;r kleine Illustrationen
im Text.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=319 HEIGHT=66 SRC="../images_05/wordworth_shapes.gif" ALT="[Wordworth Shapes]"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=319>
<TR><TD ALIGN=LEFT BGCOLOR="#FFFFFF"><FONT SIZE="-1" COLOR="#000000">
Sprechblasen und andere interessante Formen mit dem Text zu kombinieren
sind mit Wordworth 7 ein Kinderspiel.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Im Men&uuml; bietet sich so sch&ouml;n als Letztes eine Hilfefunktion
an, die alles m&ouml;gliche mit sich machen l&auml;&szlig;t. Bis zu einem
Index der Dokumentation (f&uuml;r das Hauptprogramm und einige Tools sind
ja die Guide-Files dabei) findet man alles. Aber eine Suchm&ouml;glichkeit,
wie sie in &quot;vielverwendeten&quot; Programmen vorkommt, fehlt halt nun
doch. Es l&auml;&szlig;t sich nirgends ein Suchstring eingeben. So ein
System fehlt auf dem Amiga generell noch weitgehend.<BR>

<BR>In den Men&uuml;s gibt es auch Eintr&auml;ge, mit denen freifliegende
Men&uuml;s ge&ouml;ffnet werden k&ouml;nnen, diese werden dann im Men&uuml;
mit dem Haken gekennzeichnet. Schlie&szlig;t man diese Fenster aber dann
mit dem Close-Gadget, bleibt der Haken beim Men&uuml;punkt jedoch bestehen.
Man sollte doch meinen, da&szlig; in einer Version 7 solche Kleinigkeiten
beseitigt w&auml;ren...<BR>

<BR>Will man Text markieren, um diesen dann zum Beispiel im Format zu
ver&auml;ndern, geht das mit den Curosrtasten und gedr&uuml;ckter
Shift-Taste ganz einfach. Dasselbe sollte auch mit der Maus funktionieren.
Praktischerweise gibt es im Bearbeiten-Men&uuml; einen Punkt: &quot;alles
markieren&quot;, mit dem der gesamte Text ausgew&auml;hlt wird. Das
funktioniert. Auch das Markieren ganzer Zeilen oder mehrerer ganzer Zeilen
mit der Maus oder der Tastatur ist kein Problem. Soll allerdings nur ein
Teil einer Zeile oder Abschnitte &uuml;ber mehrere Zeilen markiert werden,
ist das mit der Maus nicht immer richtig m&ouml;glich, da kein wirklich
kausaler Zusammenhang zwischen der Position des Mauszeigers und dem
markierten Text besteht. Auch so etwas sollte in einer Version 7 besser
sein. Wir sind schlie&szlig;lich nicht im Billy-Land!<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>&Uuml;ber ein Kennwort kann das Dokument auch vor unberechtigtem Zugrif
gesch&uuml;tzt werden, genauso kann ein ASCII-File dazu verwendet werden,
Serienbrief-Funktionen bereitzustellen. Dazu kann man ziemlich detailliert
festlegen, wie das File aussieht, welche Trennzeichen zwischen den
Datenpunkte vorkommen und auch, ob es aus einer der bekannten Anwendungen
stammt. Ein Twist kommt darin aber zum Beispiel nicht vor, und ich denke
doch, da&szlig; dieses Datenbanksystem einigerma&szlig;en verbreitet
ist.<BR>

<BR>Will man wirklich ordentlich formatierten Text aus seinem Rechner
bringen, geht immer noch kein Weg an einem ordentlichen TeX vorbei (das es
ja auch in brauchbarer Version f&uuml;r unseren geliebten Amiga gibt), will
man aber eine Textverarbeitung, in der man in etwa das am Bildschirm sieht,
was sp&auml;ter aus dem Drucker herauskommt, so ist Wordworth nun doch eine
verwendbare M&ouml;glichkeit dazu.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Mir pers&ouml;nlich sagt es nicht so zu, einfach, weil es auf meinem
System zu tr&auml;ge ist, aber es ist bis jetzt absolut absturzfrei
gelaufen und hat somit einen Gro&szlig;teil meines Frustes vom Test des
letzten Monats (Aladdin 5.0) wieder wettgemacht. Auf meiner PicassoII mit
Picasso96 V1.37 gab es absolut keine Probleme, einen Screen auf der Picasso
aufzumachen und ihn auch in 256 Farben zu verwenden. &Auml;ndert man den
Screen auf 8 Farben, sieht man an den eingebetteten Grafiken, da&szlig;
Wordworth wirklich drauf reagiert und seine Grafiken umrechnet. Erweitert
man die Palette, funktioniert das auch wieder. Und dabei ist kein einziger
Neustart des Programms oder gar des ganzen Systems n&ouml;tig.<BR>

<BR>Es w&auml;re halt noch sch&ouml;n, wenn die st&ouml;renden
Kleinigkeiten beseitigt werden w&uuml;rden, denn dann k&ouml;nnte man mit
diesem Programm, das mehr ist, als nur ein erweiterter Texteditor, durchaus
auch sinnvollere und umfangreichere Projekte angehen. So mu&szlig; es aber
leider zum Flugzettel und Partyeinladungen erstellen herhalten.<BR>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=65 HEIGHT=10 ALT="[65]"><IMG SRC="../images/_box_black.gif" WIDTH=35 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=70 HEIGHT=10 ALT="[70]"><IMG SRC="../images/_box_black.gif" WIDTH=30 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=65 HEIGHT=10 ALT="[65]"><IMG SRC="../images/_box_black.gif" WIDTH=35 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=65 HEIGHT=10 ALT="[65]"><IMG SRC="../images/_box_black.gif" WIDTH=35 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=50 HEIGHT=10 ALT="[50]"><IMG SRC="../images/_box_black.gif" WIDTH=50 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=40 HEIGHT=10 ALT="[40]"><IMG SRC="../images/_box_black.gif" WIDTH=60 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=60 HEIGHT=10 ALT="[60]"><IMG SRC="../images/_box_black.gif" WIDTH=40 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0076.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.digita.com/">Digita</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.digita.com/catalogue/wordworth/wordworth7.html">Wordworth 7</A><BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_05/wordworth_1.gif">Screenshot 1</A> (GIF;22K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_05/wordworth_2.gif">Screenshot 2</A> (GIF;26K)<BR>

				</TD></TR>
				</TABLE>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0075.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0077.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
