<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA4.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. AMIGA k&uuml;ndigt &ouml;ffentliche Beta-Version des AmigaOS 3.5 an</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;16.06.1999&nbsp;</TD><TD VALIGN="TOP">Amiga k&uuml;ndigt die &ouml;ffentliche Beta Version des OS 3.5 an.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>16. Juni 1999, San Diego, Kalifornien - Langen, Deutschland</H3>
<P>
Amiga hat mit Haage &amp; Partner die &ouml;ffentliche Beta Version des Amiga OS 3.5
bekanntgegeben.
</P>
<P>
Die erste externe Beta Version des 3.5 wird diese Woche versendet.
Die Beta Produk-Testreihe wird allerdings noch &uuml;ber die n&auml;chsten Wochen
weiterlaufen, bis zur endg&uuml;ltigen Version.
</P>
<P>
Es wurden Beta Tester von der ganzen Welt ausgesucht, die die weltweiten
Belange der Amiga Gemeinde vereinen.
</P>
<P>
&quot;Wir sind sehr stolz, so nah an der Ver&ouml;ffentlichung des 3.5 zu sein. Wir
wissen, da&szlig; es eine lange Zeit war, bis wir die &uuml;berarbeiteten Amiga OS
Version zu Verf&uuml;gung stellen konnten und wir m&ouml;chten versichern, da&szlig; wir
ein jetzt und auch in Zukunft Interesse an den derzeitigen Amiga Systemen
haben, obgleich wir mit gro&szlig;en Schritten auf die Bekanntgabe von neuen
Amiga Produkten zugehen.&quot; sagte Jim Collas, Pr&auml;sident und CEO von Amiga.
</P>
<P>
Wir haben mit Haage &amp; Partner zusammengearbeitet, um eine &uuml;berzeugende
Version des neuen OS 3.5 pr&auml;sentieren zu k&ouml;nnen.
</P>
<P>
Wir freuen uns schon, mit den externen Beta Usern zusammenzuarbeiten und zu
testen, um das Produkt noch diesen Sommer fertigzustellen und zu
ver&ouml;ffentlichen.
</P>
<P>
Das OS 3.5 kann bei Eurem Amiga H&auml;ndler vorbestellt werden. Viele
akzeptieren auch Internet Bestellungen.
</P>
<P>
Schaut immer mal auf die Amiga.com WebPage, damit Ihr immer auf neuestem
Stand seit, je n&auml;her wir an die Ver&ouml;ffentlichung des OS 3.5 kommen.&laquo;
</P>
<P>
(Quelle: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA4.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
