<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Schatztruhe GmbH gibt Erscheinen von Photogenics 4 bekannt</H2>
<P>
&raquo;Photogenics 4 CD-ROM has been released!
Suggested Retail Price DM 179.00
Update Price DM 119.00 (serial number of previous version required!)
US$1 = DM 1.89 given current exchange rates.
</P>
<P>
Photogenics 4 (Deutsche Version) wird in ca. 14 Tagen ver&ouml;ffentlicht!
Empfohlener Verkaufspreis DM 179,00
Update-Preis DM 119,00 (Angabe der Seriennummer erforderlich!)&laquo;
</P>
<P>
&raquo;Produktinformation
</P>
<P>
Photogenics 4
</P>
<P>
Nach 4 Jahren harter Arbeit hat Paul Nolan nun endg&uuml;ltig die neue Version
der bekannten und beliebten Bildbearbeitungssoftware Photogenics
ver&ouml;ffentlicht.
</P>
<P>
Photogenics ist ein Grafikpaket, welches es Ihnen erlaubt, erstaunliche
Bilder aus dem Nichts zu erschaffen oder bestehende Bilder zu ver&auml;ndern. Es
kann f&uuml;r eine Vielzahl von Anwendungen genutzt werden, von der einfachen
Dateikonvertierung bis hin zur fortgeschrittenen Photomanipulation und
Bildretuschierung. Es bietet zudem extrem realistische Malwerkzeuge, wie
z.B. Kreide und Wasserfarbe, um erstaunliche Meisterwerke in Minuten zu
erzeugen.
</P>
<P>
Zahlreiche neue Funktionen erlauben bislang ungeahnte Experimente bei der
grafischen Gestaltung.
</P>
<P>
Die Liste der neuen Features:
</P>
<P>
Ver&auml;nderung der Farben, der Transparenz, des Bildbeabeitungsmodus und der
Position des Gezeichneten in Echtzeit.
</P>
<P>
Realistische Arbeitswerkzeuge wie Airbrush, Kreide, Stift, Wasserfarben und
auch Schmierfunktionen.
</P>
<P>
Verschiedenste Symmetrie- und Texttools.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Beste Arbeitsergebnisse schon bei Verwendung einer Standardmaus.&nbsp;</TD><TD VALIGN="TOP">Arbeiten&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">ohne aufwendiges Maskieren mit jedem der Malwerkzeuge. Dabei stehen Ihnen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&uuml;ber drei Dutzend Arbeitsmodi zur Verf&uuml;gung.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einfaches L&ouml;schen von Fehlern mit der rechten Maustaste ohne die guten
Teile zu beeinflussen.
</P>
<P>
Unbegrenzte Anzahl von Layern erlauben eine effiziente Bildkomposition.
Erstaunliche pyrotechnische Maltechniken wie Lensflares, Feuer und
Explosionen. Kombiniert mit dem Schmierwerkzeug produzieren Sie Supernovae,
Wellen von Feuer und sogar Sonnenunterg&auml;nge und Wasserf&auml;lle.
</P>
<P>
Innovative Benutzeroberfl&auml;che mit frei positionierbaren Bedienelementen.
</P>
<P>
Volles Multithreading: Kein Warten, viele Effekte in Echtzeit.
</P>
<P>
Fortgeschrittene und dennoch einfache Nutzung des Alpha-Kanals. Benutzen
Sie ein beliebiges Bild als Maske oder zeichnen Sie einfach eine auf das
Bild. &auml;nderungen an der Maske werden im Hauptbild in Echtzeit dargestellt.
</P>
<P>
24-Bit-Alpha-Kan&auml;le. Nur Photogenics bietet die M&ouml;glichkeit farbige Alpha-
Kan&auml;le zu nutzen, die Ihnen eine Ausmaskierung von Rot, Gr&uuml;n und Blau
erlauben. Ein Zeichnen mit Grau erzeugt dabei ganz herk&ouml;mmliche Masken.
Erzeugen Sie au&szlig;ergew&ouml;hnliche Effekte durch die Nutzung von 24-Bit-Alpha-
Kan&auml;len zur Maskierung von Bildbearbeitungseffekten.
</P>
<P>
Symmetriewerkzeug - erlaubt in Verbindung mit den Malwerkzeugen unglaublich
Effekte in Sekunden.
</P>
<P>
Textwerkzeug - Klicken sie einfach irgendwo ins Bild und schreiben Sie in
eine Malebene. Text bleibt v&ouml;llig editierbar, bis er auf das unterliegende
Bild fixiert wird.
</P>
<P>
Mehrfache Anzeige mit unterschiedlichen Vergr&ouml;&szlig;erungsfaktoren.
</P>
<P>
Eindrucksvolle Farbbeeinflussung mit f&uuml;nf Farbw&auml;hlern, RGB- und HSV-
Schiebern. Sie k&ouml;nnen zudem Farben aus Bildern w&auml;hlen, wobei Ver&auml;nderungen
in Echtzeit sichtbar werden.
</P>
<P>
Ausgedehnte Dateiformatunterst&uuml;tzung. Aktuell k&ouml;nnen Sie laden und
speichern in den Formaten IFF-ILBM, IFF-DEEP, JPEG, Targa, BMP, PNG, wobei
weitere Formate folgen werden. Photogenics unterst&uuml;tzt zudem das Laden &uuml;ber
24-Bit-Datatypes.
</P>
<P>
24-Bit-Druckunterst&uuml;tzung &uuml;ber Studioprint.
</P>
<P>
Offene Plug-In Architektur zur leichten Erweiterbarkeit durch Dritte.
Photogenics ist effektiv eine Sammlung von Plug-Ins, die &uuml;bergangslos ein
Programm formen. Drittentwickler haben Zugrif zur selben API wie
Photogenics, was Entwicklern eine beliebige Erweiterungsm&ouml;glichkeit des
Programmkerns bietet.
</P>
<P>
Minimale Systemanforderungen:
68020, 8MB RAM, Amiga OS 3.0,CD-ROM-Laufwerk.
</P>
<P>
Empfohlene Systemanfoderungen:
68060, 16 oder 24-Bit-Anzeige, 16MB RAM, Amiga OS 3.0, CD-ROM-Laufwerk.
</P>
<P>
Photogenics ist ein eingetragenes Warenzeichen von Paul Nolan. Alle
weiteren Warenzeichen befinden sich im Besitz der entsprechenden
Eigent&uuml;mer.&laquo;
</P>
<P>
(Quelle: Schatztruhe GmbH)
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
