<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Diverse Neuigkeiten</H1>
<H2>1. aMozillaX soll zur World of Amiga erscheinen</H2>
<P>
Die zuletzt f&uuml;r Juni angek&uuml;ndigte Ver&ouml;ffentlichung einer ersten Version des
WWW-Browsers aMozillaX verz&ouml;gert sich erneut:
</P>
<P>
&raquo;[free amiga organisation]
</P>
<P>
Zur sofortigen Ver&ouml;ffentlichung:
</P>
<P>
Presse-Ver&ouml;ffentlichung &uuml;ber aMozillaX
</P>
<P>
Diese Mitteilung wird im Namen des ganzen aMozillaX-Teams von Ben Rothwell
herausgegeben.
</P>
<P>
Als wir im Januar 1999 die M&ouml;glichkeit erhielten, mit der &Uuml;bertragung des
Mozilla-Quellcodes auf die 68k- und PPC-Amigaebenen zu beginnen, war die
Berichterstattung durch die Presse sehr umfangreich und die Gemeinschaft
war sehr interessiert an einem Browser, der wesentliche Teile des
Netscape-Quellcodes enh&auml;lt.
</P>
<P>
Nun mussten wir zur Kenntnis nehmen, dass die Ent&auml;uschung unter den
Amiga-Anwendern immer gr&ouml;&szlig;er wird, weil sie tats&auml;chlich immer noch nicht
&uuml;ber aMozillaX verf&uuml;gen k&ouml;nnen.
</P>
<P>
Wir m&ouml;chten uns hiermit ganz ausdr&uuml;cklich bei der ganzen Gemeinschaft f&uuml;r
die entstandene Situation entschuldigen. Zun&auml;chst hatten wir die Freigabe
im Juni angestrebt und es sah tats&auml;chlich so aus, dass wir schon fr&uuml;h im
Mai damit herauskommen k&ouml;nnten. Aber die Entwicklung eines Programms dieser
Gr&ouml;&szlig;e und dieser Komplexit&auml;t ist keine einfache Aufgabe und manche Probleme
mit dem Code und andere Schwierigkeiten lassen die Zeit fliegen und machen
die Gemeinschaft noch ungeduldiger.
</P>
<P>
Wir m&ouml;chten Ihnen jedoch versichern, dass wir intensiv an der Arbeit sind
um die Version 1.0 von aMozillaX bestimmt auf der World-of-Amiga-Show in
London in der Mitte des Monats Juli vorzustellen. Einige Eigenschaften
werden noch fehlen, wie z.B. Java haupts&auml;chlich wegen Problemen und
Verz&ouml;gerungen bei JVM-L&ouml;sungen von dritter Seite.
</P>
<P>
Wir glauben aber fest daran, dass aMozillaX alle derzeitigen Amiga-Browser
sofort mit der Erstausgabe &uuml;bertreffen wird mit seinen M&ouml;glichkeiten sowohl
bei der Geschwindigkeit wie auch bei Flexibilit&auml;t und Leistungsf&auml;higkeit.
ECMAScript, Dynamic HTML, DOM1 und HTML4.0 werden in dieser Ausgabe voll
unterst&uuml;tzt werden.
</P>
<P>
Wir arbeiten auch daran sicherzugehen, dass bei der Ver&ouml;ffentlichung der
Bin&auml;rdateien und der Quellcodes die Strukturen am richtigen Platz sind,
um anderen Entwicklern in Zusammenarbeit mit uns die Verbesserung von
aMozillaX zu erm&ouml;glichen. Zus&auml;tzliche Mitteilungen dar&uuml;ber k&ouml;nnen bei
unserer
erweiterten Web-Adresse &quot;www.freeamiga.org&quot; gefunden werden.
</P>
<P>
Weitere Anfragen richten Sie bitte an &quot;<A HREF="mailto:ben@freeamiga.org">ben@freeamiga.org</A>&quot;.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
