<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Haage&amp;Partner-News</H2>
<P>
Und hier wieder die neuesten Meldungen des Unternehmens:
</P>
<P>
&raquo;03 Juni 99: AmigaOS 3.5 Werbekampagne
</P>
<P>
Amiga Intl. hat mit der weltweiten Werbekampagen f&uuml;r AmigaOS 3.5 begonnen.
</P>
<P>
08 Juni 99: Beispiele zu FontMachine &amp; X-DVE
</P>
<P>
Um zu zeigen, da&szlig; man mit FontMachine und X-DVE beeindruckende
Internet-Grafiken erstellen kann, hat Klaus Ziereis einige Beispiele
erstellt.
</P>
<P>
09 Juni 99: Der Gewinner ist...
</P>
<P>
Am fr&uuml;hen Morgen war auf unserem Server wieder einmal die H&ouml;lle los -
unz&auml;hlige Surfer wollten sehen, ob sie der 400.000 Besucher unserer
Homepage sind. Und es ist eingetreten, was wir uns schon dachten: fast 40
Personen haben die 400.00 angezeigt bekommen. Wir mu&szlig;ten daher denjenigen
nehmen, der alle Bedingungen erf&uuml;llt und als erster auf unserem Server
angekommen ist. Der Gewinner ist: Guillaume Ubbelohde aus Belgien.
Gratulation :)
</P>
<P>
10 Juni 99: Neues bei 3D World
</P>
<P>
Im 3DWorld-Bereich wurde das Aussehen der Seiten leicht ge&auml;ndert und
&uuml;berarbeitet. Au&szlig;erdem gibt es drei neu Softwareank&uuml;ndigungen.
</P>
<P>
16 Juni 99: Tornado3D Aktionspreise
</P>
<P>
Noch bis zum 1. Juli 99 k&ouml;nnen Kunden, die die Version 1.5 gekauft haben,
das Update auf die Version 3.0 zum Aktionspreis von 398 DM erwerben
(danach: 498 DM). Wer jetzt die Version 2.1 erwirbt oder schon erworben hat
(nicht das kostenlose Update von 1.x), kann das 3.0 Update sp&auml;ter kostenlos
bei Eyelight im Internet laden. Studenten und Besitzer eines anderen
3D-Programms k&ouml;nnen T3D jetzt f&uuml;r 649 DM erhalten.
</P>
<P>
16 Juni 99: Amiga startet Animationswettbewerb
</P>
<P>
Amiga Intl. sucht in Zusammenarbeit mit der Firma IOM den besten
Videotrailer f&uuml;r das neue AmigaOS 3.5. Zu gewinnen gibt es 3x AMIGA 1200HD
Magic-Paket sowie 25x das neue OS 3.5.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">16 Juni 99:&nbsp;</TD><TD VALIGN="TOP">Amiga Advisory Council Nominierung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Amiga m&ouml;chte Anfang Juli ein Beratergremium einsetzen, das aus
verschiedenen Personen aus Firmen, Clubs etc. besteht. Jeder kann hier bis
zum 19. Juni (!) eine geeignete Firme oder Person aufstellen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">16 Juni 99:&nbsp;</TD><TD VALIGN="TOP">Fusion PPC Vorbestellung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Microcode Solutions erwartet bis zum 1. Juli 500 Vorbestellungen um die
Produkte Fusion und PCx f&uuml;r den PowerPC fertigzustellen. Wir finden diese
Vorgehen aus verschiedenen Gr&uuml;nden bedenklich, doch da die erste Stufe noch
keine Vorauszahlung bedarf, kann man so sein Interesse an dem Produkt
nochmals bekunden.
</P>
<P>
17 Juni 99: WOA99 &amp; AmiWest im Juli
</P>
<P>
In den n&auml;chsten Monaten werden weltweit mehrere Amiga Shows stattfinden.
H&amp;P wird auf der WOA99 in London das neue AmigaOS 3.5 vorf&uuml;hren.
</P>
<P>
Programmierer gesucht!
</P>
<P>
F&uuml;r verschiedene Aufgaben suchen wir schnellstm&ouml;glich einen erfahrenen
Amiga-Programmierer.&laquo;
</P>
<P>
(Quelle: Haage &amp; Partner)
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
