<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. H&auml;ndler-Erfahrungsbericht: Pernat Hard- &amp; Software (von Ingo Schwedler)</H2>
<P>
&raquo;Habe ebenfalls einen negativen Erfahrungsbericht zu einem Amiga-H&auml;ndler
abzugeben. Vor kurzem (Anfang Juni) bestellte ich telefonisch neue und
gebrauchte Anwender- und Spielesoftware im Wert von ca. 400 DM bei der
Firma PERNAT HARD &amp; SOFTWARE.
</P>
<P>
Ich bekam auch alles geliefert, wobei ich die M&ouml;glichkeit wahrnahm, mit
VisaCard zu bezahlen, um Kosten f&uuml;r die Nachnahme zu sparen.
Als ich das Paket bekam und die Rechnung sah, traf mich der Schlag.
Nicht wegen der Gesamtsumme - nein, Herr Pernat stellte mir die Kosten f&uuml;r
die Abrechnung mit der VisaCard in Zahlung. Immerhin noch mal zus&auml;tzlich
rund 20 DM.
</P>
<P>
Dann kam der n&auml;chste Schreck. Ein von mir gebraucht bestelltes Spiel wurde
mir neu zugesandt und nat&uuml;rlich auch berechnet. Bei der telefonischen
Bestellung wurde aber alles genau abgekl&auml;rt und best&auml;tigt. Das f&uuml;r die
Bezahlung mit Visa Geb&uuml;hren erhoben werden, wurde verschwiegen. Ebensowenig
war dies aus seiner Internet-Seite ersichtlich. Ich habe schon so einiges
mit Visa bezahlt, Geb&uuml;hren wurden dabei noch nie erhoben. Sonst w&uuml;rde man
ja mit Nachnahme noch g&uuml;nstiger kommen. Als ich daraufhin bei dieser Firma
anrief und auf die Falschlieferung (Software neu statt gebraucht) und auf
die VisaCard-Geb&uuml;hren ansprach, wurde Herr Pernat sehr ungehalten mir
gegen&uuml;ber.
</P>
<P>
Gut, nach langer Diskussion wurde mir versprochen die Visa-Geb&uuml;hren
zur&uuml;ckzuerstatten und mir das neue gegen das bestellte Spiel umzutauschen
(wieder Versandkosten).
</P>
<P>
F&uuml;r die Visa-Geb&uuml;hren bekam ich dann tats&auml;chlich einen V-Scheck von rund 20
DM mitsamt dem neuen Spiel, das ich hingeschickt hatte, zur&uuml;ckgesandt.
Hinweis der Firma: Ge&ouml;ffnete Spiele werden nicht umgetauscht. Ist schon
richtig, aber es ist wohl meine Schuld, dass ich von au&szlig;en dem Spiel nicht
ansah, dass es neu war (war mit Tesa zugeklebt), und es erst nach dem
&Ouml;ffnen der Packung bemerkte.
</P>
<P>
Und es ist wahrscheinlich auch meine Schuld. dass mir der falsche Artikel
zugesandt wurde?
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Fazit:&nbsp;</TD><TD VALIGN="TOP">Es beweist sich wieder mal, dass eine Firma mit g&uuml;nstigen Preisen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">nicht unbedingt die beste ist. M&uuml;ssen es einige Anbieter unbedingt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ausnutzen, da&szlig; die Amiga-H&auml;ndler-Konkurrenz schrumpft???&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ingo Schwedler &lt;<A HREF="mailto:ingo_schwedler@01019freenet.de">ingo_schwedler@01019freenet.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
