<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P>
Wenn Ihr einen Beitrag habt, schreibt bitte an:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<H2>1. Stellungnahme zum Amiga der n&auml;chsten Generation (von Ralf Driesner)</H2>
<P>
Leider ist mit Ralf Driesner lediglich ein Leser meinem Aufruf im
Schlusswort der letzten Ausgabe gefolgt, sich zum geplanten Amiga der
n&auml;chsten Generation zu Wort zu melden:
</P>
<P>
&raquo;Hallo,
</P>
<P>
digital convergence... das neu aufsteigende Zauberwort der
Computerindustrie hat bislang eher futuristischen Charakter.
</P>
<P>
Futuristisch hei&szlig;t hierbei jedoch nicht fantastisch...
</P>
<P>
In der Vergangenheit gab es bereits einige (teilweise bel&auml;chelte) Versuche
deutscher und internationaler Hersteller, Ger&auml;te auf den Markt zu bringen
die, &quot;all-in-one&quot; sozusagen, m&ouml;glichst viele Funktionen und Anwendungen
b&uuml;ndeln sollten.
</P>
<P>
Der Vertriebserfolg dieser &quot;Ich-kann-fast-alles&quot;-Maschinen war jedoch eher
mager.
</P>
<P>
Einer der Hauptgr&uuml;nde f&uuml;r diverse Fehltritte d&uuml;rfte wohl die fehlerhafte
Integration der Einzelger&auml;te in das Gesamtsystem gewesen sein. So wurden
zum Teil Betriebssysteme verwandt, die f&uuml;r ihre Absturzh&auml;ufigkeit und
integrierten Systemfehler bekannt waren. Dar&uuml;berhinaus wurden Hardware-
Komponenten verwandt, deren antiquiertes Speichermanagment eher zum
abnudeln einiger Spiele oder einfachster Internetanwendungen geeignet
waren.
</P>
<P>
Desweiteren wurde die Zusammenarbeit der computer&uuml;blichen SVGA- und der
fernseh&uuml;blichen PAL/NTSC-Standards eher schlecht als recht gel&ouml;st; selbst
der Amiga h&auml;tte mit der damals verf&uuml;gbaren Technik keine Wunder erwirken
k&ouml;nnen (trotz 15khz-Technik).
</P>
<P>
Wie sieht die Zukunft aus? Bessere Technik, voranschreitende
Digitalisierung von TV und Radio, Internet 2 und &auml;hnliches l&ouml;sen die
infrastrukurellen Probleme. Bessere Endger&auml;te, die derzeit entwickelt
werden, versprechen atemberaubende M&ouml;glichkeiten.
</P>
<P>
Amiga mit Jim Collas an der Spitze k&ouml;nnte das derzeit (fast) unm&ouml;gliche
Ziel erreichen: Verbraucherfreundliche, g&uuml;nstige und hochintegrierte
Technik... verpackt in einem h&uuml;bschen Kleid. Auch wenn die ver&ouml;ffentlichten
Konzeptzeichnungen des Amiga NGs vorerst eher provisorisch bzw. kaum
erkennbar die neue Computerrevolution anrei&szlig;en... das Ziel ist klar.
</P>
<P>
Falls sich die Technik durchsetzt kann sich  der Gateway-Aktion&auml;r wohl
schon bald beim Anblick der Charts zur&uuml;cklehnen und der Spruch &quot;Die Zukunft
geh&ouml;rt den Paranoiden&quot; k&ouml;nnte f&uuml;r einige Computergr&ouml;&szlig;en schon bald zur
bitteren realit&auml;t werden...
</P>
<P>
Warten wir's gespannt ab
</P>
<P>
Ralf Driesner, M&uuml;nchen &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
