<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Interviews</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Interviews.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Interviews.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Interviews2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Interviews
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Interviews</H1>
<H2>1. Interview mit Marcel Beck, Autor der E-Mail-Software 'YAM'</H2>
<P>
AMIGA aktuell:
</P>
<P>
Herr Beck, erst mal danke ich Ihnen, dass Sie sich f&uuml;r AMIGA aktuell Zeit
genommen haben, um uns die folgenden Fragen zu beantworten.
</P>
<P>
Marcel Beck:
</P>
<P>
Gern geschehen.
</P>
<P>
AMIGA aktuell:
</P>
<P>
YAM ist derzeit in der Version 2.0p7 vorhanden. Wird bzw. soll es eine
endg&uuml;ltige Version 2.0 geben?
</P>
<P>
Marcel Beck:
</P>
<P>
2.0p7 war die letzte &ouml;ffentliche Betaversion. Es gibt zwar noch ein paar
interne Zwischenversionen, aber die n&auml;chste Ver&ouml;ffentlichung ist YAM 2.0
&quot;final&quot;.
</P>
<P>
AMIGA aktuell:
</P>
<P>
Wann k&ouml;nnte dies sein?
</P>
<P>
Marcel Beck:
</P>
<P>
Sofern die &Uuml;bersetzungen rechtzeitig eintreffen und keine gr&ouml;&szlig;eren Probleme
mehr auftreten, wird YAM 2.0 in der ersten Juli-H&auml;lfte im Aminet
erscheinen.
</P>
<P>
AMIGA aktuell:
</P>
<P>
Welche Neuerungen wird es in Zukunft geben?
</P>
<P>
Marcel Beck:
</P>
<P>
F&uuml;r die Versionen nach 2.0 ist HTML-Unterst&uuml;tzung geplant, d.h. HTML-
formatierte Nachrichten k&ouml;nnen direkt in YAM angezeigt werden. Auch
angeh&auml;ngte Bilder lassen sich dann direkt im Nachrichtentext darstellen.
Weitere geplante Features sind hierarchische Postf&auml;cher, IMAP4-Support und
einiges mehr.
</P>
<P>
Die YAM-Benutzer sind sehr ideenreich, die Liste der Vorschl&auml;ge enth&auml;lt
inzwischen fast 200 Eintr&auml;ge...
</P>
<P>
AMIGA aktuell:
</P>
<P>
Haben Sie vor, sobald die NG-Amigas erschienen sind, YAM umzusetzen?
</P>
<P>
Marcel Beck:
</P>
<P>
Wenn ich meinen A4000T eines Tages durch einen NG-Amiga ersetze, dann
vielleicht. Ich programmiere grunds&auml;tzlich nicht f&uuml;r Plattformen, die ich
nicht selbst benutze (deshalb wird es auch nie ein YAM f&uuml;r Windows geben).
</P>
<P>
AMIGA aktuell:
</P>
<P>
Eigentlich ben&ouml;tigt man bei YAM keine PPC-Unterst&uuml;tzung. Erw&auml;gen Sie
dennoch, es PPC-f&auml;hig zu machen?
</P>
<P>
Marcel Beck:
</P>
<P>
Das Kodieren und Entpacken von Attachments k&ouml;nnte mit einer PPC-Version um
mindestens Faktor 10 beschleunigt werden. Ich habe mir vorgenommen, dies zu
testen, sobald ich mein PPC-Board kriege.
</P>
<P>
AMIGA aktuell:
</P>
<P>
Die neuen G3/G4-Turboboards werden keine 68k-Prozessoren mehr haben. Somit
w&auml;re eine PPC-Umsetzung sinnvoll - oder?
</P>
<P>
Marcel Beck:
</P>
<P>
Ja gewiss, aber dies setzt voraus, dass ich so ein Turboboard und die
ben&ouml;tigte Compiler-Software besitze.
</P>
<P>
AMIGA aktuell:
</P>
<P>
Abschlie&szlig;end m&ouml;chte ich gern von Ihnen wissen, ob noch andere Projekte in
absehbarer Zeit m&ouml;glich sind? Was k&ouml;nnten das f&uuml;r Projekte sein?
</P>
<P>
Marcel Beck:
</P>
<P>
Die Programmierung von YAM und die Beantwortung von E-Mails beansprucht
bereits einen beachtlichen Teil meiner Freizeit, f&uuml;r andere gr&ouml;&szlig;ere Amiga-
Projekte fehlt mir deshalb schlicht die Zeit.
</P>
<P>
AMIGA aktuell:
</P>
<P>
Ich w&uuml;nsche Ihnen alles Gute und auf bald!
</P>
<P>
Marcel Beck:
</P>
<P>
Besten Dank, Ihnen auch!
</P>
<P>
Das Interview wurde gef&uuml;hrt von Sofiane Ben Hassine.
</P>
<P ALIGN="RIGHT">
<A HREF="Interviews.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Interviews2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
