<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<H2>Nichts Neues von G3/G4?!</H2>
<P>
In den letzten Wochen ist es sehr still geworden um die diversen
Ank&uuml;ndigungen von G3/G4-PowerPC-Erweiterungskarten f&uuml;r die aktuellen Amiga-
Modelle - verd&auml;chtig still. Schon k&ouml;nnte man meinen, die Projekte
entwickelten sich allesamt zu 'Luftnummern'. In der Tat war es schon etwas
merkw&uuml;rdig, dass - Monate nach dem Vorreiter Escena - im M&auml;rz/April
innerhalb weniger Wochen mit Phase 5, Metabox, Titan Computer (bzw. ACT)
und GVP-M gleich vier Unternehmen nachzogen und ebenfalls entsprechende
Produkte ank&uuml;ndigten.
</P>
<P>
Hat man in den Chefetagen dieser Firmen eventuell die
Realisierungsm&ouml;glichkeiten solcher Boards &uuml;bersch&auml;tzt? Dabei sollte die
Entwicklung von Ein-Prozessor-PPC-Karten (die ja u.a. auch schon f&uuml;r
Macintosh-Rechner erh&auml;ltlich sind) doch 'kaum mehr als ein Klacks' sein,
zumindest aber weit weniger problematisch als die der Dual-Prozessor-Boards
von Phase 5. An der Betriebsssoftware d&uuml;rfte es ebenfalls nicht hapern,
wenn man Haage &amp; Partner Glauben schenkt, denn nach Angaben des
Unternehmens ist die ben&ouml;tigte 68k-Emulation bereits seit Monaten fertig
und werde nur deshalb noch nicht ausgeliefert, weil sie ja ohne Existenz
einer reinen PowerPC-Karte keinen Sinn mache.
</P>
<P>
Auf der anderen Seite k&ouml;nnte es durchaus gut m&ouml;glich sein, dass man nur
deshalb nichts Neues h&ouml;rt, weil die genannten Unternehmen flei&szlig;ig mit der
Entwicklung eben der angesprochenen Produkte besch&auml;ftigt sind. Im Falle von
Phase 5 w&auml;re das aber deshalb nicht schl&uuml;ssig, weil der Hersteller erst
nach Eingang von 1000 verbindlichen Vorbestellungen mit den Arbeiten an den
Karten beginnen wollte. Da bislang jedoch keinerlei Best&auml;tigung, dieses
Ziel erreicht zu haben, ver&ouml;ffentlicht wurde und unseres Wissens auch noch
kein Vorbesteller dazu aufgefordert worden ist, den f&auml;llig werdenden Betrag
an Phase 5 zu zahlen, ist davon auszugehen, dass die ben&ouml;tigte Zahl an
Vorbestellungen (noch?) nicht erreicht wurde, was bei Ber&uuml;cksichtigung der
Gr&ouml;&szlig;e des Amiga-Markts und des relativ hohen Anschaffungspreises der
Produkte wohl auch nicht verwundern k&ouml;nnte.
</P>
<P>
Sei es, wie es ist: Wenn sich die verschiedenen Hersteller nicht in K&uuml;rze
zum Stand der Dinge &auml;u&szlig;ern, w&auml;re das nicht nur unh&ouml;flich gegen&uuml;ber den
Amiga-Usern, sondern verst&auml;rkte auch die anfangs in diesem Artikel
ge&auml;u&szlig;erte Bef&uuml;rchtung. Denn zumindest Metabox hat eine Auslieferung seiner
'AmiJoe'-Karten f&uuml;r den Beginn des dritten Quartals 1999 - also in diesen
Wochen - angek&uuml;ndigt. Ob dies tats&auml;chlich der Fall sein wird, bleibt
abzuwarten...
</P>
<P>
Bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
