<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Heute m&ouml;chte ich mal die Einleitung etwas anders anfangen...: Gibt es noch
Leser des AMIGA aktuell Spieleteils? Oder sind die potentiellen Leser schon
alle im Sommerurlaub? Jedenfalls habe ich diesen Monat gerade mal eine
Zuschrift zum Spieleteil bekommen. Das bringt mich ins R&auml;tseln. Ist der
Spieleteil denn perfekt, dass es gar keine Sachen zu bem&auml;ngeln gibt oder
ist der Spieleteil so schlecht, dass man ihn ganz vergessen kann? Oder
gibt es halt einfach keine News mehr? Fragen &uuml;ber Fragen...Ich hatte schon
bef&uuml;rchtet, ich w&uuml;rde nach der letzten Mini Ausgabe mit Protest-E-Mails
&uuml;bersch&uuml;ttet werden, aber dann kam eine ganze E-Mail. Eigentlich k&ouml;nnte
ich ja zufrieden sein, dass es anscheinend nichts zu sagen gibt, aber
irgendwie gibt mir die Sache zu denken. Also probieren wir es doch mal
mit einem konkreten Aufruf: Schreibt mir mal eine E-Mail, wie euch der
Spieleteil gef&auml;llt, vielleicht ist er ja wirklich perfekt! Die E-Mail
muss ja kein Roman werden, ein paar Zeilen reichen schon.
</P>
<P>
Nun zu den News in diesem Monat: Obwohl wir uns langsam aber sicher auf
das gro&szlig;e Sommerloch zubewegen, gab es diesen Monat noch relativ viele
Spiele News, darunter viele neue Ank&uuml;ndigungen. Au&szlig;erdem wurde Wasted
Dreams ver&ouml;ffentlicht, wie lange mussten wir darauf warten! Ein Review
zu Wasted Dreams k&ouml;nnt ihr dann auch gleich in der n&auml;chsten Ausgabe
lesen. Und wenn wir schon von Reviews reden, gehen wir doch gleich ein
bisschen ins Detail: Wenn alles glatt geht, k&ouml;nnt ihr in der n&auml;chsten
Ausgabe Reviews von Speccy 99, WET - The sexy Empire, Superfrog und
Wasted Dreams lesen. Wollen wir hoffen, dass es klappt.
</P>
<P>
Die Rubrik &quot;Neue Spiele im Aminet&quot; ist diesen Monat wirklich klein.
Das liegt daran, dass die Aminet Mailingliste anscheinend wieder &quot;down&quot;
war. Denn nach dem 11. Juni erreichte mich keine weitere E-Mail mehr,
in der die t&auml;glichen Aminet Uploads aufgef&uuml;hrt sind. Also gibt es
diesmal nur die neuen Spiele im Aminet vom 29. Mai bis 11. Juni.
Hoffen wir, dass die Mailingliste bald wieder l&auml;uft.
</P>
<P>
So, dann viel Spa&szlig; mit dieser Ausgabe,
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
