<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Wasted Dreams ver&ouml;ffentlicht
</LI>
</UL>
<P>
Um kein Spiel wurde wohl soviel gebangt wie um Wasted Dreams,
welches fr&uuml;her Distant Dreams. Was gab es nicht alles f&uuml;r Probleme
mit dem Spiel: Das Original Entwicklungsteam geht bankrott und
wird von einem anderen Entwicklungsteam aufgekauft, Namen
werden dauernd ge&auml;ndert, Vulcan Software st&ouml;sst das Projekt ab
und verkauft die Rechte an das Entwicklungsteam....Viele glaubten
gar nicht mehr an eine Ver&ouml;ffentlichung. Nun ist sie Realit&auml;t!
Wasted Dreams ben&ouml;tigt einen Amiga mit AGA oder Grafikkarte und
3MB Ram sowie CD-ROM. Ein Review k&ouml;nnt ihr erst in der n&auml;chsten
AMIGA aktuell lesen, da mein Exemplar noch nicht eingetroffen
ist.
</P>
<P>
<A HREF="img/WastedDreams1.jpg"><IMG SRC="thumb/WastedDreams1.jpg" WIDTH="120" HEIGHT="85" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/WastedDreams2.jpg"><IMG SRC="thumb/WastedDreams2.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Hyperion Software Update
</LI>
</UL>
<P>
Steffen H&auml;user hat mich diesen Monat nochmal intensiv zum Thema
Shogo &amp; Co. informiert und ich m&ouml;chte euch dies nicht vorenthalten:
Hyperion hat also nicht nur eine Lizenz f&uuml;r das Spiel Shogo
erhalten sondern auch eine Lizenz f&uuml;r die LithTech Engine. Dies
ist eine generelle 3D Engine mit der man alle m&ouml;gliche Spiele
realisieren kann. Die Programmierung des Spiels wird damit zur
Nebensache, denn ist die Engine einmal portiert, kann man auch
gleich andere auf dieser Engine basierenden Spiele ohne gr&ouml;&szlig;ere
Schwierigkeiten umsetzen. Entsprechende Verkaufszahlen von Shogo
vorausgesetzt, k&ouml;nnten noch weitere LithTech-basierende Spiele
von Hyperion Software folgen, wie z.B. der 3D Shooter Blood 2.
</P>
<UL>
<LI> Crystal Software und Electronics auch weiterhin am Amiga
</LI>
</UL>
<P>
Crystal Software und Electronics wollen auch weiterhin Spiele f&uuml;r
den Amiga ver&ouml;ffentlichen. Besonders interessiere man sich f&uuml;r den
kommenden NG Amiga, so der Managing Director David Connolly. Man
m&ouml;chte allerdings keine Spiele f&uuml;r den Amiga entwickeln, nur
vertreiben oder ver&ouml;ffentlichen. Connolly stellt klar, dass nur
Spiele mit sehr hoher Qualit&auml;t ver&ouml;ffentlicht werden w&uuml;rden.
Interessierte k&ouml;nnen sich an David Connolly &lt;<A HREF="mailto:david@pc-software.com">david@pc-software.com</A>&gt;
wenden.
</P>
<UL>
<LI> Alive Mediasoft ver&ouml;ffentlicht Hexen Deathkings of the Dark Citadel
</LI>
</UL>
<P>
Dieses Addon verspricht &uuml;ber 20 neue, noch d&uuml;sterere und spannendere
Levels sowie speziell f&uuml;r den Death Match Modus entwickelte Levels.
F&uuml;r das Addon wird das Original Hexen ben&ouml;tigt, welches nat&uuml;rlich
auch &uuml;ber Alive Mediasoft erh&auml;ltlich ist. Hexen Deathkings of the
Dark Citadel kostet umgerechnet etwa 25 DM und kann &uuml;ber die Alive
Mediasoft Seite bezogen werden. Das Addon kommt auf CD-ROM und
unterst&uuml;tzt Grafikkarten sowie den PowerPC Prozessor.
</P>
<UL>
<LI> The World Foundry sucht Grafiker
</LI>
</UL>
<P>
F&uuml;r deren Spiel Maim &amp; Mangle sucht The World Foundry einen Grafiker.
Die Anforderungen an den Grafiker sind relativ hoch, so muss er z.B.
mit Lightwave umgehen k&ouml;nnen, Erfahrungen im 3D Bereich haben und
er muss die The World Foundry Game Enzyklop&auml;die lesen. Ich hoffe jetzt
keinen erschreckt zu haben.Interessierte wenden sich an
<A HREF="mailto:rob@worldfoundry.com!">rob@worldfoundry.com!</A>
</P>
<UL>
<LI> Amiga NG Spiele
</LI>
</UL>
<P>
Neulich habe ich auf der Webseite der Amiga Flame einen &Uuml;berblick
&uuml;ber angek&uuml;ndigte Spiele f&uuml;r den NG Amiga gefunden, die ich euch
nicht vorenthalten m&ouml;chte. Folgende Spiele wurden f&uuml;r den NG Amiga
angek&uuml;ndigt: Dark Soul, Destitution, Digital Soccer, D.P. Tennis,
D.P. Kart, Explorer 2260, Kijitsu Warriors, I-40 Cross Country Rally,
The Adventures of D.P. Dog, The Last Patriot und Total Tennis.
Au&szlig;erdem wurden noch zwei unbenannte Spiele von Delsyd Software und
Digital Images angek&uuml;ndigt.
</P>
<UL>
<LI> Joyride
</LI>
</UL>
<P>
X-Treme Racing Fans k&ouml;nnen sich freuen: Mit Joyride ist ein Spiel
im Stil des Silltuna Klassikers in Entwicklung. Das Team besteht
aus einer kleinen Gruppe von Entwicklern, die schon seit einem
Jahr an Joyride arbeiten und hoffen, dass es in ca. 2 Monaten
fertiggestellt ist. In der Endversion soll es drei verschiedene
Autotypen geben sowie mindestens 10 verschiedene Strecken. Das
Spiel ben&ouml;tigt mindestens einen 030 Amiga mit 8 MB Fast Ram und
kommt nat&uuml;rlich auf CD-ROM. Einen Publisher f&uuml;r Joyride gibt es
noch nicht.
</P>
<P>
<A HREF="img/Joyride1.jpg"><IMG SRC="thumb/Joyride1.jpg" WIDTH="120" HEIGHT="95" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Joyride2.jpg"><IMG SRC="thumb/Joyride2.jpg" WIDTH="120" HEIGHT="95" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Neues von der Los Angeles Entertainment Electronic Expo
</LI>
</UL>
<P>
Rick Jones, ein Amiga Journalist, erz&auml;hlte in einigen Newsgroups
von seinem Besuch auf der Los Angeles Entertainment Electronic
Expo, auf der er einige bekannte Spielefirmen &uuml;ber ihre Meinung
zum Amiga NG fragte. Er fragte nat&uuml;rlich nicht irgendwelche
&quot;kleine Angestellten&quot; sondern Personen mit Titeln wie Pr&auml;sident,
Vize Pr&auml;sident, Manager und Direktor, also durchaus keine
unbedeutenden Personen. Firmen wie Psygnosis, Blue Byte und
Microprose wissen &uuml;ber die NG Amigas Bescheid, m&ouml;chten aber
erst f&uuml;r diese entwickeln, wenn genug Computer verkauft wurden
und ein potentieller Markt vorhanden ist. Rick Jones machte
aber deutlich, dass viele Firmen gar nicht w&uuml;ssten, dass sich
ein neuer Amiga in Entwicklung bef&auml;nde. Dies wirft nat&uuml;rlich
Fragen auf, warum Amiga Inc. die Firmen nicht informiert. Man
kann also nur hoffen, dass Amiga Inc. das bald nachholt und
die Entwickler f&uuml;r sich gewinnt.
</P>
<UL>
<LI> Minimum Safe Distance von Satanic Dreams
</LI>
</UL>
<P>
Was kommt heraus, wenn man Worms, Cannon Fodder und King Arthur`s
World kreuzt? Satanic Dreams wei&szlig; die Antwort: Heraus kommt das
Spiel Minimum Safe Distance, welches laut den Entwicklern massive
Explosionen, viel Blut (?) und &uuml;ber 40 verschiedene Waffen besitzt.
Au&szlig;erdem soll es mit 50fps auf einem Standard 020 Amiga laufen.
Es ben&ouml;tigt allerdings AGA und 4 MB Fast Ram sowie ein CD-ROM
Laufwerk.
</P>
<UL>
<LI> Neues Spiel von Digital Images
</LI>
</UL>
<P>
Ein noch unbenanntes, auf einem Film basierendes,  Spiel soll
von Digital Images ver&ouml;ffentlicht werden. Laut Stuart Walker darf
man sich auf ein actiongeladenes Spektakel gefasst machen. Das
Spiel soll Action mit Strategie verbinden und besitzt eine
isometrische 3D Game Engine mit qualitativ sehr guten FMV Sequenzen
sowie Manga/Anime Grafiken. Das Spiel wird &uuml;ber einen Single-
sowie einen Multi Player Modus (&uuml;ber Netzwerk und Internet)
verf&uuml;gen. Eine Webseite mit Informationen &uuml;ber das Spiel soll
bald ge&ouml;ffnet werden. Digital Images will das Spiel etwa immer
Sommer 2000 ver&ouml;ffentlichen.
</P>
<UL>
<LI> Amiga Spiele von Q-Lab
</LI>
</UL>
<P>
Q-Lab, die erst nur als Musiker t&auml;tig waren, wollen jetzt auch
in die Spieleentwicklung einsteigen. Kannte man sie vorher nur
von der Musik aus z.B. Zombie Massacre und FUBAR, werden in
Zukunft wohl noch einige Spiele hinzukommen. Drei davon wurden
schon angek&uuml;ndigt: Po Po Chicken ist eine Mischung aus Donkey
Kong Country, Bubble Bobble und Chuckie Egg. W.E.L. (Arbeitstitel)
ist ein 3D Action Adventure. Das letzte noch unbenannte Spiel
wird ein 3D Kriegsspiel. Bei Q-Lab sucht man noch Programmierer
f&uuml;r verschiedene Projekte: Interessierte k&ouml;nnen sich an
<A HREF="mailto:q@qlab.swinternet.co.uk">q@qlab.swinternet.co.uk</A> wenden.
</P>
<P>
<A HREF="img/Wel1.jpg"><IMG SRC="thumb/Wel1.jpg" WIDTH="120" HEIGHT="91" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Wel2.jpg"><IMG SRC="thumb/Wel2.jpg" WIDTH="120" HEIGHT="91" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Wel3.jpg"><IMG SRC="thumb/Wel3.jpg" WIDTH="120" HEIGHT="91" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Recovery: 2190 von Trogladite Software
</LI>
</UL>
<P>
Bei den Newcomern von Trogladite Software arbeitet man zur
Zeit an einem der Dune-Serie &auml;hnelnden Spiel namens Recovery:
2190. Einige Teile des Spiels &auml;hneln auch dem Spiel Myst.
Recovery: 2190 ben&ouml;tigt mindestens einen AGA Amiga mit 68030
Prozessor sowie 6 MB Ram. Es ist noch in der fr&uuml;hen Phase
und hat noch keinen Publisher.
</P>
<UL>
<LI> Neues Great Nations Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Das Civilization &auml;hnliche Multi-Player Spiel Great Nations ist
in einer neuen Demoversion erschienen. Great Nations ist wie
auch FreeCiv f&uuml;r verschiedene Plattformen erh&auml;ltlich: Diese
sind momentan Amiga, Windows und Linux. Great Nations enth&auml;lt
viele Features des Original Civilization, aber auch einige
neue, wie unlimitierte Gr&ouml;&szlig;e der Welt, Unterst&uuml;tzung f&uuml;r
2D und 3D Tilesets sowie AGA und Grafikkarten Unterst&uuml;tzung.
Seit der Demoversion 1.3 wurde u.a. folgendes ver&auml;ndert:
Verbesserung der Grafik, viele Geschwindigkeitsverbesserungen,
statistische Bildschirm hinzugef&uuml;gt, viele Fehlerbehebungen,
Handeln &amp; Beziehungen wurden eingebaut und mehr. Das Demo
kann von der Great Nations Internet-Seite geladen werden:
<A HREF="http://gn.gameshock.com/gn140.lha" TARGET="_TOP">http://gn.gameshock.com/gn140.lha</A>.
</P>
<UL>
<LI> T-Zer0 Neuigkeiten
</LI>
</UL>
<P>
Es gibt endlich mal wieder was Neues von clickBOOM zu berichten:
Ihr n&auml;chstes Shoot-em-up Spiel T-Zer0 wird nun vorraussichtlich
durch eine kleine Versp&auml;tung Ende Juli ausgeliefert. clickBOOM
verriet au&szlig;erdem, dass das Spiel mit einem Leveleditor ausgeliefert
wird, was etwas au&szlig;ergew&ouml;hnlich f&uuml;r Shoot-em-Up`s ist. Der Editor
wurde vorher nur von den Programmierern benutzt, um die Standard
Levels zu erstellen. Auch wurde auf der clickBOOM Website die
Musik des Spiels als MP3 zum Download aufgestellt. Interessierte
k&ouml;nnen sich die Musik also direkt von <A HREF="http://www.clickboom.com" TARGET="_TOP">http://www.clickboom.com</A>
laden.
</P>
<UL>
<LI> Gilbert Goodmate Update
</LI>
</UL>
<P>
Ein Preview Video zu dem Spiel Gilbert Goodmate von Prelusion
Software wurde jetzt auf deren Homepage ver&ouml;ffentlicht und l&auml;sst
sich von <A HREF="http://www.prelusion.se/dload/gilbert_preview.zip" TARGET="_TOP">http://www.prelusion.se/dload/gilbert_preview.zip</A>
laden. Auch wurden einige Daten zum Entwicklungsfortschritt
ver&ouml;ffentlicht, die so aussehen: Grafik: 70%, Animation: 25%,
Musik: 50%, Dialoge: 30% und Engine: 50%. Macht gesamt: 45%.
Es wird also bis zum endg&uuml;ltigen Release noch ein bisschen
dauern.
</P>
<UL>
<LI> Operation: Counterstrike News
</LI>
</UL>
<P>
Es gibt seit langem mal wieder was Neues von Operation: Counterstrike zu
berichten. Auf der Website wurde ver&ouml;ffentlicht, dass es in naher Zukunft
keine Demo von dem Spiel geben wird. Es besteht allerdings eine Chance,
dass man auf der World of Amiga Show doch ein Exemplar in die H&auml;nde
bekommt. Die TCP/IP Unterst&uuml;tzung sei sogut wie fertig und man habe die
Wetter Effekte eingebaut, so hei&szlig;t es. Momentan arbeite man an einem
neuen Animationsformat.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
