<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Workshops / Hintergrundberichte / Buchvorstellungen</H1>
<H2>1. Bericht: AmigaOS3.5-Pr&auml;sentation bei AmiPoint (von Thorsten Sch&ouml;lzel)</H2>
<P>
&raquo;AmigaOS3.5-Pr&auml;sentation beim Amiga-User Meeting des AUGGD &amp; PCC
</P>
<P>
Diese Pr&auml;sentation wurde mit freundlicher Unterst&uuml;tzung von Marc Gerlitzki
im Ladenlokal des AmiPoint abgehalten. Aber nicht nur dies, sondern auch
weitere Dinge wurden den interessierten Amiga Usern vorgef&uuml;hrt, als da
w&auml;ren: AmiAtlas 5, Soundkarte Delfina oder ApusPPC. Ein weiterer
Anziehungspunkt war die Vorf&uuml;hrung von Tornado3D. Andreas Weyrauch,
der dieses Programm zeigte, gab sich dabei viel M&uuml;he, um den Usern alle
wichtigen Details &amp; Features dieses Programms vorzuf&uuml;hren.
</P>
<P>
Eine kleine Attraktion war sicherlich der Amiga 1000, auf dem das alte
Boing-Ball-Demo lief.
</P>
<P>
An dem Meeting nahm ich schon ab 11:00 Uhr teil. Wer dachte, es w&uuml;rden
nicht viele Amiga-User kommen, der hatte sich geirrt.
Um ca 13:00 Uhr platze das Ladenlokal schon aus allen N&auml;hten.
Einmal mehr f&uuml;hlte man sich nicht mehr so allein, man merkte richtig,
dass die Amiga-Gemeinde lebt.
</P>
<P>
Um ca. 14:00 kam pl&ouml;tzlich Hektik ins Ladenlokal, als User aufriefen, dass
Herr Haage im Anmarsch sei, dann kam er endlich in Begleitung seiner Frau.
Im Gep&auml;ck hatte er ein Paket mit Haage&amp;Partner-CDs, aber auch Aufkleber
waren mit von der Partie.
</P>
<P>
F&uuml;r die Vorf&uuml;hrung wurde ein A1200 im Infinitiv-Tower, 1240/40-MHz-
Prozessor, Cybervision64/3D, 16MB RAM und eine 1GB-SCSI-Festplatte benutzt.
</P>
<P>
Gespannt waren wir, als Herr Haage anfing, die Beta-Version des OS3.5-
Updates zu installieren, doch gab es dabei anf&auml;nglich erste Probleme, die
man nach ca. 10 Minuten beheben konnte.
</P>
<P>
Es handelte sich um das Installer-Script, doch man &auml;nderte dieses ein klein
wenig um und schon konnte man den n&auml;chsten Versuch starten, der gl&uuml;cklich
verlief.
</P>
<P>
Das OS 3.5 erstellt bei der Installation zuerst eine Notfall-Diskette,
danach wird das System von dieser neu gestartet und das OS 3.5 installiert.
Jeder, der das OS 3.1 besitzt (was im &uuml;brigen zwingend vorausgesetzt wird,
um das OS3.5-Update zu installieren) kennt auch noch die meterhohen
Diskettenstapel, Abhilfe verschafft eine Option, die mit auf der CD-Rom
geliefert wird.
</P>
<P>
Denn es wurde eine Option geschaffen, womit man sein OS 3.1 vorinstallieren
kann, nur braucht man die Original-3.1-Disketten, um danach OS 3.5 zu
installieren.
</P>
<P>
Ein kleiner Haken ist aber &uuml;berall, wie auch dort: Leider kann man das OS
3.1, wie auch das OS 3.5, nur &uuml;ber die normalen Amiga-Modi installieren,
dies d&uuml;rfte aber keine gro&szlig;en Probleme bereiten, da jeder User mindestens
einen Fernseher zu Hause stehen haben sollte.
</P>
<P>
Um auf die Notfall-Diskette zur&uuml;ckzukommen, womit man beginnt, das OS 3.5
zu installieren: Leider bietet eine DD-Diskette nicht genug Platz, damit
auch noch die Grafikkarten-Treiber genug Platz finden w&uuml;rden, doch kann man
leider nicht auf HD-Disketten zur&uuml;ckgreifen, da das DD-Laufwerk bei uns
noch zu weit verbreitet ist. Doch man ist dabei, sich eine L&ouml;sung einfallen
zu lassen.
</P>
<P>
Der Test aufs Exempel!
</P>
<P>
Die Oberfl&auml;che sieht jetzt mit den GlowIcons viel anspruchsvoller aus,
als noch mit den alten Amiga-Icons. Mit dabei nat&uuml;rlich als Background-Bild
das OS3.5-Logo, wie man es aus der Werbung kennt.
</P>
<P>
Wenn man nun einige Tools oder Preferences startet, kommen erste
Neuerungen zum Vorschein. Sehr viele dieser &uuml;berarbeiteten Programme
verwenden inzwischen die Reaction-Oberfl&auml;che.
</P>
<P>
Hierbei handet es sich um das stark erweiterte ClassAct-System, das sehr
schnell und systemkomform ist.
</P>
<P>
Neu ist die Unterst&uuml;tzung von (3!) verschiedenen Icon-Sammlungen, ob Amiga-
Icons (Old-Icons), die NewIcons oder die GlowIcons, diese neue Icon-Library
verwaltet sie alle. Probleme, wie es fr&uuml;her mit den verschiedenen Farben
gab, wird es damit nicht mehr geben.
</P>
<P>
Weitere Details wurden zum integrierten WWW-Browser AWeb bekannt gegeben,
dieser wird &gt;kein&lt; JavaScript unterst&uuml;tzen. Diese Aussage traf uns User
nat&uuml;rlich hart, da wir eigentlich mit einer erweiterten Version von AWeb
3.2 gerechnet hatten, inkl. JavaScript-1.2-Unterst&uuml;tzung.
</P>
<P>
Bei Miami wird es sich auch lediglich um eine spezielle Version handeln.
Die HTML-Anleitung wird auf der CD-ROM auch im PDF-Format vorliegen, nur
wird kein Anzeiger im Lieferumfang enthalten sein, so dass man auf
Ausweichl&ouml;sungen zur&uuml;ckgreifen muss, mit denen wir diese Anleitung
allerdings nicht lesen, sondern nur ausdrucken k&ouml;nnen.
</P>
<P>
Es gibt jetzt auch die M&ouml;glichkeit, von einem Request einen neuen Ordner
zu erstellen, und es sind neue Befehle hinzugekommen, wenn man seinen
Inhalt auf der jeweiligen Partition aufr&auml;umen m&ouml;chte.
</P>
<P>
Wo liegen aber nun die wirklichen Neuerungen?
</P>
<P>
Diese liegen ganz klar intern, z.B. ist das Laden der Workbench sowie das
&Ouml;ffnen von Partitionen um ein Vielfaches beschleunigt worden.
</P>
<P>
Das ganze System scheint robuster geworden zu sein, man merkt, so langsam
gleicht sich das AmigaOS Operating-Systemen anderer Plattformen an, es wird
aber trotzdem unsere Amiga-Linie beibehalten. Die Datatypes wurden komplett
&uuml;berarbeitet, und als &Uuml;berraschung ist sogar ein GIF-Datatype im
Lieferumfang enthalten.
</P>
<P>
Viele Dinge wurden intern verbessert, wovon der Anwender bei der Benutzung
des Updates im Wesentlichen gar nichts mitbekommt.
Daher: Ein Kauf lohnt sich!
</P>
<P>
Als die erste Pr&auml;sentation zu Ende gewesen ist, die speziell f&uuml;r die
Besucher des Meetings bestimmt war, kam &uuml;berraschend die Firma IOM Film &amp;
Videoproduktion vorbei, wovon wir bis dato nichts gewu&szlig;t hatten. Diese
Firma ist durch das Produzieren eines AmigaOS3.5-Werbefilms bekannt, Dirk
&quot;Docki&quot; Dockbreyder f&uuml;hrte das Update noch einmal vor, diesmal aber mit
weniger Besuchern des Ladenlokals. Herr Haage kommentierte diese neue
Pr&auml;sentation. Erste Ergebnisse des OS3.5-Werbespots m&ouml;chte man auf der
World of Amiga'99 vorzeigen, wir sind gespannt.
</P>
<P>
Dieser Werbefilm soll dann, wenn das OS 3.5 verf&uuml;gbar ist, bei regionalen
Fernsehsendern ausgestrahlt werden. Es sind &Uuml;berlegungen im Gange, wonach
man verst&auml;rkt auch in der ComputerBild Anzeigen schalten m&ouml;chte, doch ist
es hierbei eine Kostenfrage, die erst noch gekl&auml;rt werden mu&szlig;.
Doch w&auml;re diese Vorgehensweise ein weiterer Schritt, um den Namen Amiga
wieder in die K&ouml;pfe anderer zu bringen.
</P>
<P>
Nat&uuml;rlich lie&szlig;en wir es uns nicht nehmen, mit Herrn Haage ein Interview zu
f&uuml;hren, lest selbst, was er auf unsere Fragen geantwortet hat:
</P>
<P>
Fragen zum AmigaOS3.5 Update:
</P>
<P>
1.) Wird das AmigaOS3.5 endg&uuml;ltig auf der Downunder Show'99 erscheinen?
</P>
<P>
Man versucht das Update rechtzeitig bis zur Downunder Show fertig zu
bekommen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">2.)&nbsp;</TD><TD VALIGN="TOP">Wie kam es dazu, dass entgegen ersten Informationen nun doch der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">TCP/IP-Stack Miami Bestandteil des Amiga OS 3.5 sein wird?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Man war zwar mit Active Software in Gespr&auml;chen wegen einer eventuellen
Integrierung von Genesis ins OS 3.5, doch bot sich mit Miami eine doch
bessere L&ouml;sung. Zum einen ist Holger Kruse in der Amiga-Gemeinde hoch
angesehen, zum zweiten basiert Miami auf dem ClassAct bzw. dem neuen
Reaction-System. Damit war eine Umsetzung von Genesis, das auf MUI basiert,
auf das Reaction-System &uuml;berfl&uuml;ssig geworden. Dieses h&auml;tte auch zuviel Zeit
in Anspruch genommen. Es w&auml;re auch kaum realisierbar gewesen.
</P>
<P>
Daher nahm man auch anstatt IBrowse oder Voyager AWeb als Browser.
</P>
<P>
3.) Wird Warp3D standardm&auml;&szlig;ig im OS3.5 enthalten sein?
</P>
<P>
Warp3D wird auf der OS3.5-CD-ROM mitgeliefert werden, es wird sich um die
Version 2.0 handeln.
</P>
<P>
Aber nicht nur Warp3D, sondern es wird auch StormMesa mitgeliefert und noch
etliche andere Tools, die in einer eigenen Schublade auf der CD-ROM zu
finden sind.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">4.)&nbsp;</TD><TD VALIGN="TOP">Wieso werden keine Treiber mitgeliefert, um DVD-Laufwerke am&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Amiga zu betreiben?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Man ist dabei, Treiber f&uuml;r DVD-Laufwerke zu entwickeln, ob man es schafft,
diese noch rechtzeitig bis zum Verkaufsstart mit zu integrieren, bleibt
abzuwarten.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">5.)&nbsp;</TD><TD VALIGN="TOP">Angeblich rechnet man damit, dass das AmigaOS3.5 zu einem&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Verlustgesch&auml;ft wird. Entspricht das der Wahrheit?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Haage&amp;Partner erwartet, dass sich ca. 20.000 Exemplare des OS3.5-Updates
verkaufen, damit es kein Verlustgesch&auml;ft wird, mit diesem Ergebnis w&auml;re man
zufrieden.
</P>
<P>
Nach Aussage von Herrn Haage werden es aber ca. 50.000 Exemplare werden.
Es entstehen aber keine Konsequenzen daraus, wenn die 20.000-Marke weltweit
nicht erreicht wird.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">6.)&nbsp;</TD><TD VALIGN="TOP">Gibt es bereits jetzt &gt;konkretere&lt; &Uuml;berlegungen f&uuml;r ein OS 3.6, 4.0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">etc.?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die gibt es, nur m&ouml;chte man jetzt erst einmal das kommende OS 3.5 abwarten.
</P>
<P>
Fragen zu den NG-Amigas:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">7.)&nbsp;</TD><TD VALIGN="TOP">Glauben Sie, dass der Prototyp des Entwickler-NG-Amigas auf der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">World of Amiga`99 vorgef&uuml;hrt wird?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herr Haage: &quot;Ich hoffe es!&quot;
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">8.)&nbsp;</TD><TD VALIGN="TOP">Wie beurteilen Sie die Konzeptzeichnungen der NG-Amigas, ist dies&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">der richtige Weg?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Leider h&auml;lt Herr Haage von Konzeptzeichnungen nicht viel, da sich jederzeit
etwas &auml;ndern kann.
</P>
<P>
Herr Haage ist sich sicher, dass es nicht nur bei einem Ger&auml;t bleibt,
sondern dass es mehr Ger&auml;te, wie z.B. ein HandHeld, geben wird.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">9.)&nbsp;</TD><TD VALIGN="TOP">Wann wird es von Haage &amp; Partner die erste Software f&uuml;r die NGs geben?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Will man &uuml;berhaupt f&uuml;r den Next-Generation-Amiga Software entwickeln?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herr Haage: &quot;Ja, selbstverst&auml;ndlich!&quot;
Nat&uuml;rlich l&auml;&szlig;t man die Classic-Reihe nicht au&szlig;er acht, man will zweigleisig
fahren, falls der NG ein Riesenerfolg wird, denkt man daran, ganz
umzuschwenken.
</P>
<P>
Es ist aber schwierig, seine Leute einzuteilen, da man noch so wenig &uuml;ber
das NG-AmigaOS wei&szlig;. Daher wird man im Moment noch komplett auf der
Classic-Linie bleiben, es gibt aber schon Vorstellungen, was man denn als
erstes auf den NG portieren m&ouml;chte.
</P>
<P>
Fragen zum PPC-Prozessor:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">10.)&nbsp;</TD><TD VALIGN="TOP">Die PowerPC-Karte &quot;Twister&quot; ist eine Kooperation zwischen Titan&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Computer, ACT (Apollo) und Haage &amp; Partner. Ist Haage &amp; Partner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ausschlie&szlig;lich f&uuml;r die Implementierung der PPC-Betriebssoftware&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">zust&auml;ndig oder &uuml;bernimmt das Unternehmen weitergehende Aufgaben?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Haage &amp; Partner k&uuml;mmert sich ausschlie&szlig;lich um die Software-Emulation. Die
Hardware wird von ACT kommen und TitanComputer wird die Treiber-Software
f&uuml;r das SCSI-Kit bereitstellen.
</P>
<P>
11.) Gibt es bereits weitere Details zur &quot;Twister&quot;?
</P>
<P>
Leider wu&szlig;te Herr Haage keine weiteren Details zum Twister-Projekt.
Aber abgesprochen ist alles, jeder kennt sein Aufgabengebiet und man wei&szlig;,
wie was aussehen mu&szlig;.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">12.)&nbsp;</TD><TD VALIGN="TOP">Was ist am G3-Rechner von Amiga International dran (Ger&uuml;cht oder&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Wahrheit), wann wird er kommen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herr Haage: &quot;Gute Frage!&quot;
Die Realisierbarkeit ist noch nicht 100%ig entschieden, es gibt
verschiedene Faktoren, die erst noch gekl&auml;rt werden m&uuml;ssen, zusammen mit
Phase 5, die prim&auml;r an der Hardware-Entwicklung beteiligt sind.
An der Software soll es nicht liegen, es gibt ein sch&ouml;nes Bundle dazu,
worauf man aber achten mu&szlig;, ist ein aktraktiver Preis. Man m&ouml;chte versuchen
einen G3-Amiga-Rechner f&uuml;r weniger als 2000,-DM auf den Markt zu bringen.
</P>
<P>
Au&szlig;erdem will man zur World of Amiga'99 einen ersten Prototyp zeigen.
</P>
<P>
Fragen zum AmigaNG-Magazin:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">13.)&nbsp;</TD><TD VALIGN="TOP">Wie Sie wissen, bin ich der Organisator des AmigaNG-Magazin-Projektes,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">wie beurteilen Sie dieses Projekt (ehrliche Antwort!)?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Leider hat sich Herr Haage noch keine Meinung dazu gebildet.
</P>
<P>
14.) W&auml;ren Sie bereit, uns zu unterst&uuml;tzen?
</P>
<P>
Herr Haage: &quot;Selbstverst&auml;ndlich!&quot;
</P>
<P>
Abschlie&szlig;endes Fazit:
</P>
<P>
Man merkt, es tut sich was, nicht nur durch das AmigaOS3.5-Update oder den
Konzeptzeichnungen. Die Augen sollten jetzt auf die World of Amiga'99
gerichtet sein, da man der Amiga-Anwenderschaft dort weitere Details und
Zukunftspl&auml;ne pr&auml;sentieren wird. Eventuell mit einem Prototyp des G3-
Rechners oder mit einem Prototyp des Entwickler-NG-Amigas. So oder so
erwartet uns ein hei&szlig;er Tanz.
</P>
<P>
Dieses Interview unterliegt dem Copyright des AmigaNG Magazin und wurde
der AmigaAktuell freundlicher Weise zur Verf&uuml;gung gestellt.
Weitere Ver&ouml;ffenlichungen nur mit Gehnemigung von Thorsten Sch&ouml;lzel.
</P>
<P>
Thorsten Sch&ouml;lzel &lt;<A HREF="mailto:thorty-amiga@t-online.de">thorty-amiga@t-online.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
