<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Beispiel</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>


   Beispiel f&uuml;r den Einsatz von Augendiagnose und Haar-Mineral-Analyse
<p>   
   Haar-Mineral-Analyse und Augendiagnose in der praktischen Anwendung
<p>   
   Sehr geehrte Patientin, sehr geehrter Patient!
<p>   
   Auf den folgenden Seiten m&ouml;chte ich Ihnen eine Patientin vorstellen. Sie bleibt
   selbstverst&auml;ndlich anonym, aber an ihrem Beispiel l&auml;&szlig;t sich sehr gut aufzeigen,
   wie ich in meiner Naturheilpraxis diagnostisch und therapeutisch vorgehe.
<p>   
   Zun&auml;chst werde ich Ihnen einen Einblick in die Krankengeschichte dieser
   Patientin geben. Danach zeige ich Ihnen - f&uuml;r Sie nachvollziehbar -, wie sich
   mit Hilfe der Haar-Mineral-Analyse und der Augendiagnose eine zuverl&auml;ssige
   Diagnose stellen l&auml;&szlig;t. Schlie&szlig;lich lege ich dar, welche therapeutischen
   Ma&szlig;nahmen f&uuml;r diese Patientin angezeigt sind.
<p>   
   Hier zun&auml;chst die Krankengeschichte (Anamnese) der Patientin, wie sie sich aus
   der Befragung und den mitgebrachten Unterlagen ergeben hat:
<ul>   
    <li> Patientin im Alter von 40 Jahren
    <li> Infektanf&auml;lligkeit (h&auml;ufig Erk&auml;ltungen)
    <li> gelegentlich schmerzhafte Bl&auml;hungen
    <li> Migr&auml;ne (besonders an Wochenenden)
    <li> seit Jahren geringf&uuml;gig Haarausfall
    <li> st&auml;ndig br&uuml;chige N&auml;gel
    <li> Schilddr&uuml;senhormone und &Ouml;strogene im Normalbereich
    <li> unauff&auml;llige Blutwerte, nur Cholesterin leicht   erh&ouml;ht (240)</ul>
<p>   
   Wie mir die Patientin au&szlig;erdem berichtete, sprach die Migr&auml;ne nur auf starke
   Schmerzmittel an; die grippalen Infekte wurden h&auml;ufig mit Antibiotika behandelt.
   Auch &Ouml;strogene waren ihr &uuml;ber einige Jahre verordnet worden. All das brachte
   etwas Linderung. Gegen den schleichenden Haarausfall hatte ihr bislang nichts
   geholfen, ja es gab nicht mal einen konkreten Therapievorschlag. Immerhin: Eine
   Untersuchung der Haarwurzeln in einem Universit&auml;tskrankenhaus ergab, da&szlig; die
   Ern&auml;hrung der Haarwurzeln nicht ausreichend gew&auml;hrleistet ist. Auf eine m&ouml;gliche
   Behandlungsstrategie angesprochen, empfahlen die Experten Pr&auml;parate zum
   Auftragen auf die Kopfhaut - aber auch dies f&uuml;hrte zu keiner Besserung der
   Symptome.
<p>   
   Die Patientin stellte daraufhin eigene &Uuml;berlegungen an, denn es war ihr
   inzwischen aufgefallen, da&szlig; eine ganzheitliche Betrachtung ihrer Beschwerden
   fehlte. Die Suche nach alternativen Untersuchungs- und Behandlungsma&szlig;nahmen
   f&uuml;hrte die Patientin schlie&szlig;lich in meine Praxis. Mein Vorschlag lautete: Lassen
   Sie mich eine Augendiagnose und eine Haar-Mineral-Analyse durchf&uuml;hren. Ich
   erkl&auml;rte ihr, da&szlig; die Kosten f&uuml;r diese Diagnose-Verfahren in der Regel nicht von
   den gesetzlichen Krankenkassen getragen werden (wohl aber von der Mehrzahl
   privater Krankenkassen).
<p>   
   Meine eigenen Erfahrungen mit &uuml;ber 700 Haar-Mineral-Analysen und einer noch
   gr&ouml;&szlig;eren Zahl von Augendiagnosen lie&szlig;en mich nicht daran zweifeln, die Ursachen
   der Beschwerden der Patientin doch noch feststellen und wirksam behandeln zu
   k&ouml;nnen.
<p>   
   Nach einem ausf&uuml;hrlichen Gespr&auml;ch entschied sich die Patientin sowohl f&uuml;r eine
   Haar-Mineral-Analyse als auch f&uuml;r eine Augendiagnose. Der Ablauf der beiden
   Untersuchungen l&auml;&szlig;t sich in wenigen Worten zusammenfassen:
<p>   
   Zun&auml;chst zur Haar-Mineral-Analyse: Den Patienten werden ca. 1 Gramm Haare aus
   dem Nackenbereich entnommen, und zwar m&ouml;glichst nah an der Kopfhaut und an
   verschiedenen Stellen. Auf diese Weise f&auml;llt der geringe Haarverlust&quot; nicht auf.
   Die Haare werden dann in ein Schweizer Labor geschickt, das eine &uuml;ber 25-j&auml;hrige
   Erfahrung mit diesem sehr aufwendigen Analyse-Verfahren vorweisen kann.
<p>   
   Bei der Augendiagnose werden die Augen der Patienten mit Hilfe eines speziell
   f&uuml;r diesen Zweck konstruierten Stereo-Irismikroskops fotografiert. Ein Vorgang,
   der nur wenige Minuten in Anspruch nimmt.Die erstellten Fotos (Diapositive)
   dienen mir sp&auml;ter zur Erstellung eines sorgf&auml;ltig ausgearbeiteten
   Befundberichtes, denn sie werden auf eine Leinwand projiziert. (Die meisten
   Irisdiagnostiker begn&uuml;gen sich mit einer relativ kurzen Betrachtung der Augen
   durch das Mikroskop und erstellen keine Fotografien).
<p>   
   Im Fall unserer Patientin lagen der Laborbericht zur Haar-Mineral-Analyse sowie
   der Befundbericht zur Augendiagnose nach drei Wochen vor und konnten besprochen
   werden.
<p>   
   Hier nun zun&auml;chst der Laborbericht zur Haar-Mineral-Analyse:
<p>   
   Der Laborbericht, den alle Patienten im Original erhalten,
   unterscheidet zun&auml;chst zwischen lebensnotwendigen Mineralstoffen und giftigen
   Schwermetallen:
<br>
<img src="../pic/haar.gif" width=504 height=724>
<p>   
   MINERALIEN:
<p>   
   In der graphischen Darstellung werden die einzelnen Mineral-Werte mit Sternen
   gekennzeichnet. Der graue Bereich entspricht dabei den Normalwerten des
   einzelnen Minerals. Bei einem ausgeglichenen Mineralhaushalt (also bei
   Mineralwerten entsprechend denen eines gesunden Patienten) befinden sich alle
   Sterne innerhalb des grauen Bereiches. Gehen die Sterne nach links &uuml;ber den
   grauen Bereich hinaus, ist das entsprechende Mineral im Minus, d.h. nicht
   ausreichend im K&ouml;rper vorhanden. Gehen die Sterne nach rechts &uuml;ber den grauen
   Bereich hinaus, ist das entsprechende Mineral im &Uuml;berschu&szlig; im K&ouml;rper vorhanden.
   Je mehr Sterne eines Mineralwertes nach links oder rechts weisen, desto st&auml;rker
   befindet sich das entsprechende Mineral im Minus oder im &Uuml;berschu&szlig;. Generell
   gilt: Mineralien, die sich im Minus befinden, sollten dem K&ouml;rper vermehrt
   zugef&uuml;hrt werden, bis ein Normalwert f&uuml;r das Mineral erreicht ist. Mineralien,
   die sich im &Uuml;berschu&szlig; befinden, sollten durch eine entsprechende Therapie aus
   dem K&ouml;rper ausgeleitet werden, bis ein Normalwert f&uuml;r das Mineral erreicht ist.
<p>   
   SCHWERMETALLE:
<p>   
   In einem gesunden Organismus befinden sich die Sterne im linken Teil der grauen
   Zone. Idealerweise (nur geringe Belastung) weisen die Sterne sogar nach links
   &uuml;ber den grauen Bereich hinaus.Keinesfalls sollten die Sterne &uuml;ber den grauen
   Bereich hinaus nach rechts weisen. Dann ist es erforderlich, die giftigen
   Schwermetalle aus dem K&ouml;rper zu entfernen.
<p>   
   Zu den einzelnen Ergebnissen: Die Analyse der Patientin zeigt drei Mineralien,
   die in erh&ouml;hter Menge im K&ouml;rper vorliegen, sowie f&uuml;nf Mineralien, die im Defizit
   liegen:
<p>   
   KALZIUM ERH&Ouml;HT:<br>
   Ursache: Die Patientin nahm jahrelang Kalzium-Tabletten zur
   Osteoporose-Vorbeugung ein.
   Bedeutung: Der erh&ouml;hte Kalziumspiegel gibt hier noch keinen Anla&szlig; zur Sorge.
   Erst ein Kalziumspiegel ab 3000 mg/kg f&uuml;hrt erfahrungsgem&auml;&szlig; zu gef&auml;hrlichen
   Kalziumablagerungen in den Organen (z.B. in den Nieren).
<p>   
   MAGNESIUM ERH&Ouml;HT:<br>
   Ursache: Die Patientin nahm jahrelang Magnesium-Tabletten aufgrund geh&auml;ufter
   n&auml;chtlicher Wadenkr&auml;mpfe ein.
   Bedeutung: Ein Magnesium&uuml;berschu&szlig; kann M&uuml;digkeitserscheinungen ausl&ouml;sen.
<p>   
   KUPFER ERH&Ouml;HT:<br>
   Ursache: Nachgewiesen werden konnte stark kupferhaltiges Leitungswasser durch
   neu verlegte Kupferrohre in der Wohnung der Patientin. Als Ursache der hohen
   Kupferbelastung ist auch die Einnahme von &Ouml;strogenpr&auml;praten &uuml;ber einen langen
   Zeitraum m&ouml;glich. &Ouml;strogene f&uuml;hren zu Verlust von Zink und Vitamin B6 sowie zu
   einer verst&auml;rkten Speicherung von Kupfer im Organismus.
   Bedeutung: Kupfer wirkt bereits bei geringf&uuml;gig erh&ouml;hten Werten stark giftig. So
   kommt es oft zu Haarausfall, M&uuml;digkeit, Kopfschmerzen oder sogar zu
   Depressionen.
<p>   
   CHROM NIEDRIG:<br>
   Ursache: Chrom z&auml;hlt zu den Mineralien, die (wie Selen und Mangan) im deutschen
   Boden kaum ausreichend vorhanden sind.
   Bedeutung: Chrom reguliert die Funktion der Bauchspeicheldr&uuml;se und wirkt somit
   ausgleichend auf den Zuckerstoffwechsel. Chrommangel &auml;u&szlig;ert sich oft in einem
   starken Verlangen nach S&uuml;&szlig;igkeiten.
<p>   
   EISEN NIEDRIG:<br>
   Ursache: H&auml;ufige Ursachen von Eisenmangel sind ein Mangel an k&ouml;rpereigener
   Magens&auml;ure, Blutverluste (z.B. durch Magengeschw&uuml;re) oder eine starke
   Regelblutung.
   Bedeutung: Eisenmangel nimmt Einflu&szlig; auf die Blutbildung und steht auch in
   Zusammenhang mit Hautbl&auml;sse und br&uuml;chigen Haaren und Fingern&auml;geln.
<p>   
   MANGAN NIEDRIG:<br>
   Ursache: Mangan z&auml;hlt zu den Mineralien, die im deutschen Boden oft zu gering
   vorhanden sind.
   Bedeutung: Mangan besitzt einen besonderen Einflu&szlig; auf Muskulatur und Skelett.
   So k&ouml;nnen Bandscheibenprobleme im Zusammenhang mit Manganmangel stehen
   (Bandscheiben enthalten gro&szlig;e Mengen an Mangan).
<p>   
   PHOSPHOR NIEDRIG:<br>
   Ursache: Ein niedriger Phosphorspiegel steht im allgemeinen in Zusammenhang mit
   einem Mangel an mehrfach unges&auml;ttigten Fetts&auml;uren. Auch die Einnahme von
   Magnesium und Kalzium vermag den Phosphorspiegel im K&ouml;rper zu senken.
   Bedeutung: Behandlungsbedarf besteht nur bei erh&ouml;hten Phosphorwerten.
<p>   
   ZINK NIEDRIG:<br>
   Ursache: Der wichtigste Nahrungslieferant von Zink ist das Fleisch (vor allem
   Rindersteak). So haben Vegetarier oft einen niedrigen Zinkspiegel. Auch gro&szlig;e
   Mengen an Kupfer k&ouml;nnen Zink im Organismus verdr&auml;ngen.
   Bedeutung: Zink ist von gro&szlig;er Bedeutung wichtig f&uuml;r Haut, Haare, N&auml;gel sowie
   f&uuml;r ein stabiles Immunsystem. So f&uuml;hrt oft schon ein geringer Mangel an Zink zu
   Krankheitserscheinungen.
<p>   
   Nun zum Befund der Augendiagnose. Auch hier erhalten die Patienten eine
   schriftliche Analyse. Im Fall der vorgestellten Patientin ergab sich folgender
   Befund:
<p>   
   Hinweis: Die Patienten erhalten zu dem Befundbericht der Augendiagnose mehrere
   Farbfotos (Format: 13x18) der Augen, mit deren Hilfe sie sich den Befund
   veranschaulichen k&ouml;nnen. In dem hier vorgestellten Fall beziehen sich die Zahlen
   im Befundbericht auf die Zahlen, die auf den Farbfotos eingezeichnet sind.
<p>   
   BEFUNDE DER AUGENDIAGNOSE
<p>  
<img src="../pic/220.gif" width=544 height=178><br>   <u> 2.20 </u> ockerfarbene F&auml;rbung der zentralen Heterochromie (Krausenzone): Prozesse im
   Leber- und Pankreasbereich mit S&auml;fteverarmung im Duodenum.
<p>   
<img src="../pic/312.gif" width=544 height=178><br>   <u> 3.12 </u> braune Pigmente: Es m&uuml;ssen alle Kriterien einer Leber- und / oder
   Pankreasst&ouml;rung (exkretorisch) &uuml;berpr&uuml;ft werden.
<p>   
<img src="../pic/411.gif" width=544 height=178><br>   <u> 4.11 </u> ab Lakunen auf Bauchspeicheldr&uuml;sensektor, rechte Iris: St&ouml;rung der
   exkretorischen Funktion der Bauchspeicheldr&uuml;se (Enzymproduktion).
<p>   
<img src="../pic/413.gif" width=544 height=178><br>   <u> 4.13 </u> b Lakune auf Herzsektor, linke Iris: Herz-Schw&auml;chezeichen.
<p>   
<img src="../pic/511.gif" width=544 height=178><br>   <u> 5.11 </u> starke Gef&auml;&szlig;schl&auml;ngelung: Verdacht auf Hypertonie (hoher Blutdruck).
<p>   
<img src="../pic/610.gif" width=544 height=178><br>   <u> 6.10 </u> a Lipoidh&uuml;gel, Gelbf&auml;rbung: Fett-Stoffwechselst&ouml;rung.
<p>   
<img src="../pic/712.gif" width=544 height=178><br>   <u> 7.12 </u> beginnender Milchs&auml;urering: Gest&ouml;rter S&auml;ure-Basen-Haushalt, Warnhinweis vor
   &Uuml;bers&auml;uerung.
<p>   
   Allgemeine Information zu den aufgef&uuml;hrten Fachbegriffen des augendiagnostischen
   Befundberichtes:
<p>   
   DIE KRAUSE:<br>
   Die Krause befindet sich direkt um die Pupille und nimmt etwa ein Drittel des
   Platzes zwischen Pupille und Irisrand ein. Beurteilt werden Form, Weite und
   Helligkeit der Krause. Die Krause kennzeichnet in der Iristopografie
   (Projektionsorte der Organe auf der Iris) den Magen-Darm-Trakt. Das Magenfeld
   umfa&szlig;t dabei den inneren Bereich der Krausenzone. Ein stark aufgehelltes
   Magenfeld bedeutet zum Beispiel immer auch eine &Uuml;bers&auml;uerung des Magens (zuviel
   Magens&auml;ure). Das Magenfeld wird vom Darmfeld umschlossen.
<p>   
   IRISVERF&Auml;RBUNGEN: (= HETEROCHROMIEN)<br>
   Im Gegensatz zu den Pigmenten (die meist tupferartig aussehen) verf&auml;rben die
   Heterochromien ganze Irissektoren (bestimmte Bereiche im Auge) und sind oft mit
   blo&szlig;em Auge leicht zu erkennen. So wird die eigentliche Augenfarbe durch
   Farbauflagerungen in bestimmten Irisbereichen ganz &uuml;berdeckt. Neben der Gr&ouml;&szlig;e
   und dem Sitz der Heterochromie (Andersfarbigkeit) wird auch die F&auml;rbung
   ausgewertet. So deutet zum Beispiel eine violette bis rotbraune Verf&auml;rbung der
   Krause auf Diabetes (Zuckerkrankheit) hin.
<p>   
   PIGMENTE: (= FARBAUFLAGERUNGEN)<br>
   Im Irismikroskop sieht man deutlich, da&szlig; die Farbpigmente auf der obersten
   Irisschicht liegen. Es handelt sich um R&uuml;ckst&auml;nde (eventuell auch um Gifte), die
   aus dem Stoffwechsel oder aus der Umwelt (zum Beispiel von Medikamenten) stammen
   und die der Organismus nicht ausscheiden konnte. Pigmente deuten also immer
   darauf hin, da&szlig; Gifte oder Schlacken vermehrt im K&ouml;rper vorhanden (abgelagert)
   sind. Sie sollten durch eine entsprechende Therapie ausgeleitet werden. Die
   Farbe der Pigmente deutet dabei auf ihre Herkunft. Pigmentierungen k&ouml;nnen
   durchaus mit der Zeit verblassen oder sich verst&auml;rken. Allgemein gilt:
<ul>   
    <li> gelb deutet auf nicht ausgeschiedene harnpflichtige Stoffe
    <li> ocker bis hellbraun weist auf St&ouml;rungen im   Leberstoffwechsel hin
    <li> dunkelbraun l&auml;&szlig;t Vergiftungen aus dem   Verdauungstrakt vermuten
    <li> schwarz oder rot weist auf Krebserkrankungen oder eine   Vererbung f&uuml;r
      Krebserkrankungen hin</ul>
<p>   
   LAKUNEN:<br>
   Sie entstehen durch Zerst&ouml;rung des oberen Irisblattes (durch Substanzverlust)
   und deuten auf Schw&auml;chezust&auml;nde der in dem jeweiligen Sektor (Bereich) liegenden
   Organe hin.
<p>   
   GEF&Auml;&szlig;ZEICHNUNGEN:<br>
   In der Lederhaut des Auges (im Bereich der Sklera = das Augenwei&szlig;e) werden
   vielf&auml;ltige und unterschiedliche Gef&auml;&szlig;zeichnungen sichtbar, die auf bestimmte
   Krankheitsdispositionen (Veranlagungen) und auf aktuelle Erkrankungen hinweisen
   k&ouml;nnen. So weisen zum Beispiel stark geschl&auml;ngelte Gef&auml;&szlig;e (Arteriolen) im
   Augenwei&szlig; auf einen erh&ouml;hten Blutdruck hin.
<p>   
   SKLERAZEICHEN:<br>
   Den Bereich der Sklera nennt man auch den Abladeplatz von Schadstoffen oder
   Fetten im K&ouml;rper. Gelbe erhabene H&uuml;gel (sogenannte Lipoidh&uuml;gel = Fetth&uuml;gel) im
   Sklerabereich weisen auf eine Ablagerung von Fetten im K&ouml;rper hin (Verfettung
   der Leber oder der Arterienw&auml;nde). Meistens ergeben Blutanalysen dann auch
   erh&ouml;hte Cholesterinwerte. Graue erhabene H&uuml;gel entstehen dagegen durch massive
   Ablagerung von Eiwei&szlig; im Organismus. Dies kann auf Ern&auml;hrungsfehler oder
   Organschw&auml;chen hinweisen. Eine br&auml;unlich verf&auml;rbte Sklera bedeutet immer eine
   Erkrankung der Leber.
<p>   
   WEITERE ZEICHEN:<br>
   Hier werden eine Vielzahl weiterer Iriszeichen aufgef&uuml;hrt. So zum Beispiel der
   sogenannte Arcus senilis. Das ist ein Bogen (Kranz), der den gesamten &auml;u&szlig;eren
   Rand der Iris mit einer milchig-tr&uuml;ben oder wei&szlig;en F&auml;rbung beziehen kann. Der
   Arcus senilis kennzeichnet eine Arteriosklerose (Verkalkung der Arterien). Ist
   nur der obere Teil der Iris davon betroffen, so ist eine Verkalkung der Arterien
   im Gehirn eingetreten, was vor allem zu Ged&auml;chtnisst&ouml;rungen f&uuml;hren kann. Ein
   Arcus senilis im unteren Irisbereich kennzeichnet eine Verkalkung der
   Beingef&auml;&szlig;e. Hier k&ouml;nnen starke Krampfadern und Durchblutungsst&ouml;rungen die Folge
   sein. Ein Arcus senilis links und rechts der Irismitte kennzeichnet vor allem
   eine Verkalkung der zuf&uuml;hrenden Gef&auml;&szlig;e des Herzens (Herzkranzgef&auml;&szlig;e).
<p>   
   Allgemeines zur Augendiagnose
<p>   
   Die Augendiagnose (auch Irisdiagnose genannt) ist keine alternative
   Diagnosemethode, sondern ein ganz und gar eigenst&auml;ndiges Beobachtungssystem, mit
   dessen Hilfe sich der Ursachenkomplex einer Erkrankung ergr&uuml;nden l&auml;&szlig;t. Die
   Augendiagnose erf&uuml;llt somit die Anspr&uuml;che einer ganzheitlichen
   Untersuchungsmethode, denn jedes Organ und jeder Teil des menschlichen K&ouml;rpers
   wiederspiegelt sich im Krankheitsfall in einem bestimmten Teil der Iris, hat
   also sein spezielles Projektionsfeld (Sektor). Bei einem gesunden K&ouml;rper weist
   die Iris eine regelm&auml;&szlig;ige, gesunde Struktur auf; ist ein K&ouml;rperteil oder Organ
   aber geschw&auml;cht oder erkrankt, dann finden sich im entsprechenden Feld zum
   Beispiel eine Verf&auml;rbung, ein heller oder dunkler Fleck, eine Zerfaserung, oder
   eine Bew&ouml;lkung. Je nach Art, Gr&ouml;&szlig;e und Auspr&auml;gung bestimmter Zeichen auf den
   Organsektoren der Iris k&ouml;nnen Schw&auml;chen und Krankheiten der Organe also sicher
   festgestellt werden. Und dies gilt sowohl f&uuml;r angeborene als auch f&uuml;r erworbene
   Anlagen von Krankheiten und chronischen Leiden - eine &auml;u&szlig;erst bedeutsame
   Tatsache, denn mit Hilfe einer entsprechenden Therapie k&ouml;nnen somit viele
   Krankheiten bereits pr&auml;ventiv (vorbeugend) behandelt werden.
<p>   
   Um die Vielzahl der durch die Augendiagnose erhaltenen Information ausreichend
   und sicher bewerten zu k&ouml;nnen, werden von den Augen mit Hilfe eines f&uuml;r diesen
   Zweck konstruierten Stereomikroskops Dias aufgenommen. Der Befundbericht gibt
   Aufschlu&szlig; &uuml;ber die wichtigsten und f&uuml;r die Gesundheit entscheidenden
   Krankheitsbefunde. Dabei werden nur diejenigen Befunde genannt, die mit der
   Fachliteratur ber&uuml;hmter Irisdiagnostiker (zum Beispiel Josef Angerer)
   &uuml;bereinstimmen und wirklich sicher zutreffen.Weniger entscheidende Befunde wie
   etwa eine erfolgte Operation der Mandeln werden wegen der sonst zu umfangreichen
   Interpretation bewu&szlig;t ausgelassen. Die zus&auml;tzlich erstellten Augenfotos
   veranschaulichen dem Patienten die einzelnen Befunde. Diese Fotos sind wertvoll,
   wenn nach einiger Zeit eine weitere Augendiagnose erfolgen sollte. So k&ouml;nnen die
   einzelnen Zeichen der Iris (zum Beispiel Pigmente) mit der vorherigen
   Fotoaufnahme verglichen werden.Damit ist es m&ouml;glich, eine Prognose &uuml;ber eine
   Erkrankung zu stellen.
<p>   
   <b>Wie l&auml;&szlig;t sich der Befund der Haar-Mineral-Analyse therapeutisch verwerten?</b>
<p>   
   Die Patientin sollte die zus&auml;tzliche Zufuhr von Magnesium und Kalzium in
   Tablettenform aufgrund der nachgewiesenen erh&ouml;hten Werte beenden, da das
   K&ouml;rperdepot (Speicherplatz von Mineralien in Organen und im Gewebe) mit diesen
   Mineralien ausreichend ges&auml;ttigt ist. Ein erh&ouml;hter Magnesiumspiegel kann
   durchaus zu M&uuml;digkeitserscheinungen f&uuml;hren. Kalzium kann ab einer bestimmten
   Menge zu gef&auml;hrlichen Ablagerungen im K&ouml;rper (z.B. in den Nieren und dadurch zu
   einer Behinderung der Durchblutung der Nieren) f&uuml;hren.
<p>   
   Der erh&ouml;hte Kupferspiegel ist bedenklich und mu&szlig; gesenkt werden. Die nat&uuml;rlichen
   Gegenspieler von Kupfer sind die Mineralien Eisen, Mangan und Zink. Diese sind
   in der Lage, Kupfer im Organismus zu verdr&auml;ngen und so den Kupferspiegel zu
   senken.Eine erh&ouml;hte Zufuhr dieser Mineralien ist folglich empfehlenswert.
<p>   
   Der niedrige Phosphorspiegel vermag in der vorliegenden Konzentration kaum
   Krankheitserscheinungen auszul&ouml;sen. Ein niedriger Phosphorspiegel weist in der
   Regel auf einen erh&ouml;hten Bedarf an mehrfach unges&auml;ttigten Fetts&auml;uren hin. Es
   sollte bei der Ern&auml;hrung auf eine erh&ouml;hte Zufuhr von mehrfach unges&auml;ttigten
   Fetts&auml;uren geachtet werden (z.B. in Form von Distel&ouml;l, Fisch&ouml;l-Kapseln oder
   hochdosierten Borretsch&ouml;l-Kapseln).
<p>   
   Die zus&auml;tzliche Einnahme von Chrom-Tabletten ist der Patientin zu empfehlen.
   Chrom wird als sogenannter Glukose-Toleranzfaktor f&uuml;r die Funktionsf&auml;higkeit der
   Bauchspeicheldr&uuml;se (z.B. f&uuml;r die Produktion von Insulin) ben&ouml;tigt. Neben seiner
   regulierenden Einflu&szlig;nahme auf den Blut-Zuckerhaushalt vermag Chrom im &uuml;brigen
   auch Fettdepots im K&ouml;rper abzubauen und die Muskulatur zu st&auml;rken. Daher ist
   Chrom oft auch Bestandteil mancher Aufbaugetr&auml;nke f&uuml;r Kraftsportler und
   Bodybuilder.
<p>   
   Zink mu&szlig; aufgrund des gro&szlig;en Mangels im Organismus in hohen Mengen &uuml;ber einen
   entsprechend langen Zeitraum verabreicht werden. Wichtig: Da sich viele
   Mineralien bei einer gleichzeitigen Einnahme schlecht vertragen (durch den
   sogenannten Verdr&auml;ngungsproze&szlig; der Mineralien untereinander) und sich bei der
   Resorption (Aufnahme durch den Darm) behindern k&ouml;nnen, ist die Einnahme der
   entsprechenden Mineralien zeitversetzt und in Einzelform zu bevorzugen.
<p>   
   &Uuml;ber die H&ouml;he der einzunehmenden Dosierungen (Tabletten) sowie &uuml;ber die
   Therapiedauer bestehen seit &uuml;ber 30 Jahren gesicherte Erfahrungswerte. Bei den
   vorliegenden Haar-Mineral-Werten der Patientin wird das erw&uuml;nschte Therapieziel
   (Ausgleich des Mineralhaushaltes) erfahrungsgem&auml;&szlig; nach ca. 4 Monaten erreicht
   sein - bei konsequenter t&auml;glicher Einnahme der Mineralien entsprechend den
   Vorgaben des ausgearbeiteten Therapieplanes.
<p>   
   <b>Wie l&auml;&szlig;t sich der Befund der Augendiagnose therapeutisch verwerten?</b>
<p>   
   ZUSAMMENFASSUNG DER WICHTIGSTEN BEFUNDE:
<ul>   
    <li> Mangel an Gallensaft (zu geringe Gallensaftproduktion durch   die Leber)
    <li> Mangel an Enzymen (zu geringe Produktion durch die   Bauchspeicheldr&uuml;se)
    <li> Mangel an Basen (dadurch eine bestehende   &Uuml;bers&auml;uerung des K&ouml;rpers)
    <li> hoher Blutdruck (vor allem durch Fettspeicherung in Organen   und Arterien)
    <li> eine bereits geringf&uuml;gig eingetretene Sch&auml;digung der   Herzmuskulatur</ul>
<p>   
   ZUSAMMENFASSUNG DER NOTWENDIGEN BEHANDLUNGSMA&szlig;NAHMEN:
<ul>   
    <li> Anregung von Gallensaft- und Enzymproduktion, insbesondere   durch
      pflanzliche Bitterstoffe
    <li> vermehrte Zufuhr von basenhaltigen Lebensmitteln (Obst und   Gem&uuml;se) , zu-
      s&auml;tzlich die Einnahme von Basenpulver   (z.B. Hydrogencarbonat) zur
      Neutralisation der S&auml;uren im   K&ouml;rper (unter regelm&auml;&szlig;iger Kontrolle durch Messen
      des morgendlichen Urin-PH-Wert)
    <li> Einnahme von pflanzlichen Kombinationspr&auml;paraten zur   Senkung der hohen
      Blutdruckwerte, eine schulmedizinische   Behandlung der hohen Blutdruckwerte ist
      zu erw&auml;gen
    <li> ein EKG sollte erstellt werden
    <li> notwendig ist auch eine geeignete Therapie zur Senkung des  
      Cholesterinspiegels, zum Beispiel in Form einer Eigenbluttherapie
    <li> die Mineraltherapie (nach Auswertung der Haar-Mineral-Analyse)   kann
      zeitgleich durchgef&uuml;hrt werden.</ul>
<p>   
   An dieser Stelle m&ouml;chte ich darauf hinweisen, da&szlig; erg&auml;nzend zur Augendiagnose
   und zur Haar-Mineral-Analyse der S&auml;ure-Basen-Haushalt des K&ouml;rpers (mittels
   Urin-Teststreifen) kontrolliert werden sollte. Neben dieser Kontrolle ist eine
   Betrachtung der Zunge (sogenannten Zungendiagnose) immer Bestandteil einer
   ganzheitlichen Untersuchung. So ergeben sich hierbei oft Verdachtsmomente f&uuml;r
   St&ouml;rungen in der Darmflora durch Bakterienbefall oder durch Pilze.
<p>   
   Im &uuml;brigen erhalten die Patienten von mir zus&auml;tzlich zum Labor-Befund der
   Haar-Mineral-Analyse einen ausf&uuml;hrlichen, individuell erstellten schriftlichen
   Therapieplan, sowie ein Rezept &uuml;ber wirksame und entsprechend hoch dosierte
   Mineralien.Au&szlig;erdem f&uuml;ge ich den jeweiligen Befundberichten leicht verst&auml;ndliche
   Fachinformation bei. So k&ouml;nnen die Patienten zuhause in aller Ruhe die
   Ergebnisse nachvollziehen.
<p>   
   BEISPIELE UND KONZEPTE F&Uuml;R BEHANDLUNGSMA&szlig;NAHMEN NACH GR&Uuml;NDLICHER UND
   GANZHEITLICHER BEFUNDERHEBUNG BEI DER PATIENTIN
<p>   
   Pflanzliche Kombinationspr&auml;parate zur Anregung der k&ouml;rpereigenen Gallensaft- und
   Enzymproduktion:<br>
   Viele Therapeuten behandeln einen Enzymmangel mit der Verordnung von
   Enzymkapseln. Diese bewirken eine schnelle Besserung vieler k&ouml;rperlicher
   Beschwerden. Nachteilig ist jedoch, da&szlig; dadurch die wichtige k&ouml;rpereigene
   Enzymproduktion (durch die Bauchspeicheldr&uuml;se) nach einiger Zeit reduziert und
   eingeschr&auml;nkt wird. (Der gleiche Effekt ist im &uuml;brigen auch bei der Einnahme von
   Schilddr&uuml;senhormonen oder Kortison bekannt; dort f&uuml;hrt eine langfristige
   Einnahme oft zu einer Abh&auml;ngigkeit). Es ist daher therapeutisch sinnvoller und
   effektiver, die k&ouml;rpereigene Enzymproduktion durch pflanzliche
   Bitterstoffpr&auml;parate zu st&auml;rken und anzuregen. Ein solches Pr&auml;parat ist z.B.
   Pankreaticum-Hevert (Tropfen). Hier haben wir eine wirksame Kombination
   pflanzlicher Einzelmittel, die sowohl die Enzymproduktion als auch die
   Produktion von Gallensaft deutlich erh&ouml;hen kann.
<p>   
   Therapie der &Uuml;bers&auml;uerung durch Zufuhr von Basen:
   Viele Erkrankungen haben ihren Ursprung in einer St&ouml;rung des
   S&auml;ure-Basen-Haushaltes des Organismus oder k&ouml;nnen nur durch eine langfristige
   Regulierung des S&auml;ure-Basen-Haushaltes erfolgreich behandelt werden. So besteht
   bei den meisten Patienten eine Azidose (&Uuml;bers&auml;uerung). Diese zeigt sich vor
   allem in einer Ver&auml;nderung des Urin-PH-Wertes (l&auml;&szlig;t sich leicht durch einen
   Teststreifen ermitteln). Der erste morgendliche Urin sollte einen PH-Wert von
   6,5 bis 7,5 aufweisen. Niedrigere PH-Werte zeigen eine &Uuml;bers&auml;uerung des
   Organismus auf.Tags&uuml;ber darf der Urin einen PH-Wert bis 8 erreichen. Bei l&auml;nger
   bestehender &Uuml;bers&auml;uerung gibt auch die Augendiagnose entscheidene Hinweise (wie
   in unserem konkreten Fall).
<p>   
   Hier ist eine Liste der m&ouml;glichen Ursachen einer &Uuml;bers&auml;uerung:
<ul>   
    <li> Bildung gro&szlig;er S&auml;uremengen durch eine chronische   Darmg&auml;rung aufgrund von
      F&auml;ulnisbakterien (erfordert   therapeutisch eine Darmsanierung).
    <li> Bildung gro&szlig;er S&auml;uremengen durch Fehlleistung von   Hormondr&uuml;sen (z.B. bei
      Diabetes mellitus)
    <li> Unterfunktion gesunder oder kranker Nieren
    <li> Unterfunktion der Belegzellen des Magens (Produzent von   Magens&auml;ure und
      Basen)
    <li> basenarme Ern&auml;hrung
    <li> Eiwei&szlig;&uuml;berern&auml;hrung</ul>
<p>   
   Eine wirksame Therapie der &Uuml;bers&auml;uerung seitens der Naturheilkunde besteht in
   der zus&auml;tzlichen Verordnung von Basenpr&auml;paraten. Alkala N (Pulver) enth&auml;lt vor
   allem die Base Natriumhydrogencarbonat (ein Bestandteil vieler Heilwasser wie
   z.B. Staatl. Fachingen oder Heppinger). &Uuml;bersch&uuml;ssige S&auml;uren k&ouml;nnen durch die
   zus&auml;tzliche Zufuhr von Basen neutralisiert und der S&auml;ure-Basen-Haushalt wieder
   ausgeglichen werden. Mit Hilfe von Urin-Teststreifen kann die Basentherapie
   sicher &uuml;berpr&uuml;ft und ein &Uuml;berdosieren vermieden werden.
<p>   
   Pflanzliche Kombinationspr&auml;parate zur Senkung hoher Blutdruckwerte:<br>
   Entscheidend f&uuml;r den Einsatz geeigneter pflanzlicher Medikamente ist die
   Ergr&uuml;ndung der genauen Ursachen f&uuml;r die hohen Blutdruckwerte. Oft liegt die
   Ursache au&szlig;erhalb des Herzens (das Herz ist also gesund, aber durch
   Arteriosklerose [Verkalkung] der zuf&uuml;hrenden Nierengef&auml;&szlig;e kommt es zu einem
   Blutstau vor den Nieren, was den Blutdruck erheblich erh&ouml;hen kann). Oder es
   haben sich, wie in unserem konkreten Fall, Fette (z.B.Cholesterin) in den
   Arterien abgelagert und behindern so den Blutfluss. Sch&auml;digungen des Herzens
   (z.B. defekte Klappen oder krankhafte Vergr&ouml;&szlig;erungen der Muskulatur) sind sicher
   durch ein EKG erkennbar. Die durch ein EKG nachgewiesen Ver&auml;nderungen bed&uuml;rfen
   in der Regel einer schulmedizinischen Behandlung; hier kann die Hom&ouml;opathie nur
   Zus&auml;tzliches leisten. Ist der Blutdruck nicht wesentlich erh&ouml;ht (besteht also
   noch keine zwingende Notwendigkeit zum Einsatz von schulmedizinischen
   Blutdruckmitteln wie z.B.Betablockern), kommen wirksame pflanzliche Medikamente
   in Betracht.Sie werden langfristig eingesetzt, haben aber im Gegensatz zu den
   schulmedizinischen Medikamenten kaum Nebenwirkungen und machen zudem nicht
   abh&auml;ngig. Ein solches Pr&auml;parat ist z.B. Viscum Pentarkan. Seine
   Hauptbestandteile sind der blutdrucksenkende Mistelextrakt sowie das
   herzsch&uuml;tzende Wei&szlig;dorn (durch seine erweiternde Wirkung auf die
   Herzkranzgef&auml;&szlig;e).
<p>   
   Senkung erh&ouml;hter Blutfettwerte durch geeignete Medikamente:<br>
   Hier kommen unter anderem insbesondere Fisch&ouml;le (diese enthalten sogenannte
   Omega-3-Fetts&auml;uren), B&auml;rlauch-Frischblatt-Granulat (wilder Knoblauch),
   Chromtabletten sowie Lezithin-Pr&auml;parate zum Einsatz. Bei erh&ouml;hten Blutfettwerten
   sollte grunds&auml;tzlich die Schilddr&uuml;se auf eine eventuelle Unterfunktion
   untersucht werden. Eine weitere wirksame Therapie zur Senkung erh&ouml;hter Fettwerte
   ist die Eigenbluttherapie. Durch die intramuskul&auml;re Injektion von aufbereitetem
   und mit UV-Licht bestrahltem Eigenblut erkennt der Organismus die erh&ouml;hten
   Fettwerte und reagiert entsprechend regulierend (sogenannter Umstimmungseffekt).
   Ganzheitliche Therapien wie die Eigenbluttherapie f&uuml;hren erfahrungsgem&auml;&szlig; oft
   erst nach 1 bis 2 Monaten zu einem sp&uuml;rbaren Therapieerfolg.Daf&uuml;r h&auml;lt die
   Wirkung (Umstimmung) im Durchschnitt etwa ein Jahr an. Manchmal ist auch eine
   Kombination mit schulmedizinischen Medikamenten notwendig. Hierbei wirken die
   naturheilkundlichen Ma&szlig;nahmen st&auml;rkend und erg&auml;nzend.So k&ouml;nnen eventuelle
   Nebenwirkungen der schulmedizinischen Medikamente abgefangen bzw. vermindert
   werden.
<p>   
   Erh&ouml;hung des Sauerstoffspiegels im Blut mit Hilfe der
   Sauerstoff-Mehrschritt-Therapie zur Behandlung der Migr&auml;ne:<br>
   Vereinfacht gesehen ist Migr&auml;ne eine Verkrampfung von Arterien im Gehirn,
   wodurch weniger Blut und damit auch weniger Sauerstoff zirkuliert. Also ein
   Sauerstoff-Mangel-Schmerz. Die Sauerstoff-Mehrschritt-Therapie vermag den
   Sauerstoffspiegel im Blut zu erh&ouml;hen. Wieviel Sauerstoff sich im Blut befindet,
   l&auml;&szlig;t sich ganz einfach feststellen, und zwar anhand der Farbe des ven&ouml;sen
   Blutes. Je heller das ven&ouml;se Blut ist, desto mehr Sauerstoff zirkuliert auch im
   Blut. Bei unserer Patientin war die Blutfarbe bei der Blutentnahme eher sehr
   dunkel, und so besteht eine gute Chance, da&szlig; die Sauerstoff-Therapie nachhaltig
   erfolgreich wirkt.
<p>   
   <b>...und nun zum weiteren therapeutischen Verlauf im Falle unserer Patientin:</b>
<p>   
   Die schmerzhaften Bl&auml;hungen der Patientin klangen nach regelm&auml;&szlig;iger Einnahme des
   pflanzlichen Medikamentes zur Stimulation der k&ouml;rpereigenen Enzymproduktion
   innerhalb kurzer Zeit ab. Es kann als sogenanntes Konstitutionsmittel &uuml;ber einen
   langen Zeitraum unbedenklich weiter eingenommen werden.
<p>   
   Aus den Mineralwerten der Patientin ist ersichtlich, da&szlig; der Haarausfall und die
   Infektanf&auml;lligkeit in dem hohen Kupfer- sowie in dem niedrigen Zinkspiegel
   begr&uuml;ndet sind. Die Mineraltherapie ben&ouml;tigt erfahrungsgem&auml;&szlig; bis zu einer
   eintretenden Besserung der k&ouml;rperlichen Beschwerden einige Monate. Schlie&szlig;lich
   sollen die K&ouml;rperdepots (die Organe und das Gewebe) mit Mineralien aufgef&uuml;llt
   werden und diese f&uuml;r lange Zeit speichern. Auch N&auml;gel und Haare ben&ouml;tigen
   entsprechend viel Zeit zum Nachwachsen.
<p>   
   Aufgrund ihrer Migr&auml;ne entschied sich die Patientin au&szlig;erdem f&uuml;r den Einsatz der
   Sauerstoff-Mehrschritt-Therapie. Entsprechend Ihres Alters und Ihrer
   k&ouml;rperlichen Belastbarkeit gen&uuml;gten in diesem Fall 5 Sitzungen a 15 Minuten
   (sogenannter Sauerstoff-Schnellproze&szlig;) unter leichter k&ouml;rperlicher Belastung mit
   Hilfe eines Fahrradergometer (Heimtrainer mit Belastungsanzeige in Watt), um
   eine langanhaltende Erh&ouml;hung des Sauerstoffspiegels im Blut zu erzielen und
   somit effektiv Einflu&szlig; auf den Migr&auml;ne-Schmerz zu nehmen.
<p>   
   Nachtrag: Eine Wiederholung der Augendiagnose ist nach etwa einem Jahr sinnvoll.
   So k&ouml;nnen die einzelnen Zeichen der Iris (z.B.Pigmente) mit der vorherigen
   Fotoaufnahme verglichen werden. Damit ist es m&ouml;glich, eine Prognose &uuml;ber die
   Erkrankung zu stellen (z.B. ob sich eine bestehende Fett-Stoffwechselst&ouml;rung
   durch Zunahme des Lipoidh&uuml;gels verst&auml;rkt hat). Eine Haar-Mineral-Analyse l&auml;&szlig;t
   sich im &uuml;brigen drei Monate nach Abschlu&szlig; der Mineraltherapie (im allgemeinen
   also erst neun Monate nach der letzten Analyse) wiederholen.
<p>   
   <b>Literaturhinweis:</b>
<p>   
   Wer mehr &uuml;ber die Therapie mit Mineralien wissen m&ouml;chten, dem empfehle ich
   folgendes Buch:
<p>   
   <i>Lothar Burgerstein, Heilwirkung von N&auml;hrstoffen (Heidelberg: Haug Verlag, 1994).</i>

<p align="right"><em>-rs- </em></p>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="mineral.html">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="talk03.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="talk04.htm">
</MAP>
</center><hr>

</body>
</html>
