<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Editorial</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>

<center><h1>Happy Birthday Amiga Times</h1></center>


Wer h&auml;tte das gedacht... 1 Jahr ist es nun her, seit dem die erste Ausgabe
der Amiga Times erschien. Es war genauergesagt der 10.8 an dem zum ersten
mal die Amiga Times ins Aminet geschickt wurde und am 23.8 kam dann eine
&Uuml;berarbeitete Version dort hin, welche auch heute noch im Aminet verf&uuml;gbar
ist. Ja... ein Jahr Amiga Times, da&szlig; m&uuml;ssen wir doch richtig feiern, und
zwar mit einem gro&szlig;en Gewinnspiel. Und das gibt es in dieser Ausgabe, mit
Preisen im Wert von 500 DM k&ouml;nnen wir diesmal dienen. Und auch so haben wir
uns einiges vorgenommen, so ist die HTML Version &uuml;berarbeitet worden und auch
unsere Homepage wird bald im neuen Glanze erstrahlen. Weiterhin gibt es ab
dieser Ausgabe den Amiga Times Award, mit dem wir besonders gute Software
oder Hardware auszeichnen! Und so sieht er aus ... 
<br>
<center><img src="../pic/atawart.gif" width= height=></center>
<p>
Ansonsten haben wir uns ganz sch&ouml;n ins Zeug gelegt um diese Ausgabe so interessant wie m&ouml;glich zu machen und ich glaube, da&szlig; haben wir auch geschafft.
MakeCD3.2 oder aber auch clickBOOM`s neuster Streich, alles haben wir uns angesehen. 
Die Data Disk #2 f&uuml;r Flyin'High wartete sehns&uuml;chtig auf die Originaldaten, um endlich benutzt zu werden, au&szlig;erdem haben wir nun endlich die Test`s
zu ADM und AWebII-3.1. Ich hoffe das es uns beide Programmierer nicht &uuml;bel
nehmen, aber in der letzten Ausgabe, hatten wir ja das kleine Datenverlustproblem. 
<p>
Diese Ausgabe ist im Vergleich ja sehr gro&szlig; geworden, wir haben mehr Bilder
beigef&uuml;gt, denn ich pers&ouml;nlich bin davon &uuml;berzeugt, da&szlig; ein Test mit Bildern
immer besser r&uuml;ber kommt, zumahl man sieht, von was geschrieben wird. Das
hat allerdings auch den Nachteil, da&szlig; die Zeitung gr&ouml;&szlig;er wird... also stellt
Euch darauf ein. Unsere n&auml;chsten Ausgaben werden ebenfalls &uuml;ber 1 MB (lha)
sein.
<p>
Unsere CD ist fast fertig, leider war Eure Beteiligung gleich null, was ich
garnicht verstehe, denn dies war eine kostenlose M&ouml;glichkeit Eure eigene
Software bzw. Produkte auf CD zu ver&ouml;ffentlichen. Nun ja, vielleicht ergibt
sich diese M&ouml;glichkeit nocheinmal.Ende Oktober (in unserer n&auml;chsten Ausgabe)
werden wir auch die Vollversion die wir auf die CD gepackt haben, bekannt
geben, bis dahin m&uuml;sst Ihr noch etwas r&auml;tseln. 
<p>
Okay, also viel Spa&szlig; bei unser aktuellen Ausgabe!
<p>
Euer Mario
<p><center>
<IMG SRC="../pic/next1.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="../start.htm" target="_top">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="newsfr.htm" target="main">
</MAP>
</center><hr>


</body>
</html>
