<html>
<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 -AT - Spieleteil</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">

<center><h1>onEscapee</h1></center>

Wer kennt sie nicht, die Action Adventure Flashback oder Another World? Beide
sind schon Kult, denn in keinem anderen Actionspiel hat man sich soviel M&uuml;he
mit der Animation der Hauptfigur gegeben. Ob springen, rollen, laufen, gehen
oder in die verschiedensten Richtungen schauen, alles wurde detailgetreu animiert und 
so menschlich wie nur m&ouml;glich &quot;gemacht&quot;. Mit onEscapee gibt es erneut so 
ein Spiel. Verantwortlich ist dasf&uuml;r Sadeness Software, die ja in
Zusammenarbeit mit Paul Berkey schon Foundation f&uuml;r den Amiga auf den Markt
brachten. On Escapee wird auf einer CD ausgeliefert, die ca. 170 MN umfasst.
Neben einem Foundation Demo, gibt es noch die Anleitung (Guide) in &uuml;ber 10
Sprachen. Bevor wir das Spiel starten k&ouml;nnen, mu&szlig; noch der Screenmode 
ausgew&auml;hlt werden. Hierbei mu&szlig; man aber f&uuml;r das Intro/Menu und das Spiel selbst
einen Screenmode w&auml;hlen, warum das so ist wie&szlig; ich leider nict, ich finde es
aber etwas umst&auml;ndlich. Egal, nach dem ich das erledigt hatte, klickte ich
doppelt auf das onEscappe Logo und der Spa&szlig; konnte beginnen.
<p>
Das Intro<br>
Eingeleitet wird onescappe mit einem 5 1/2 min&uuml;tigen Intro. Anfangs wird
(leider nur in englisch) mit Sprachausgabe ein kurzer Text erz&auml;hlt, der 
ungef&auml;hr das Flair einer X-Akte hat. Danach bekommt man die Story des Spieles
als Animation geboten, gezeigt wird hier die Entf&uuml;hrung von Daniel White.
Dieser w&auml;hrt sich aber, t&ouml;tet die Geiselnehmer und rettet sich in letzter
Sekunde vor dem Tod, da der Entf&uuml;hrerwagen eine Br&uuml;cke hinabst&uuml;rzt und Daniel
gerade noch so den Transoramtionsvorgang einschalten kann und das Auto sich
ich ein Raumschiff verwandelt. Unterlegt wird das alles durch einen Song, der
sogar richtig gesungen wird - h&ouml;rt sich nichtmal schlecht an.
<p>
Die Geschichte ansich<br>
Du sitzt gerade vor dem Fernseher, als jemand Deine T&uuml;r einschl&auml;gt und Dich
entf&uuml;hrt. Wir waren schon lange nicht mehr allein im Universum, und Du wei&szlig;t
das sie Dich irgendwann holen w&uuml;rden, wie sie es schon mit vielen anderen 
gemacht hatten. Obwohl Du die gew&auml;hrt hast, Du hattest keine Chance und so schleppten 
sie Dich in ihr Auto. Im Auto t&ouml;test Du dann deine Entf&uuml;hrer, der 
Fahrer verliert die Kontrolle &uuml;ber das Auto und es st&uuml;rzt ein Br&uuml;cke hinunter.
Du kannst das Auto gerade noch Transformieren und mit ihm - als Raumschiff -
Dein Leben retten. Das Schiff mu&szlig;te notlanden und Du verkrochst Dich in einem
M&uuml;lleimer. Wahrscheinlich dachten sie, Du bist tot, da das Raumschiff einfach
irgendwo abgeworfen wurde. Doch jetzt bist Du auf der Flucht!
<p>
Das Men&uuml;<br>
Nach dem intro kommt das Men&uuml;. Dort kann man entweder ein Spiel starten, ein
altes laden, die Hilfeoption nutzen (dort zeigt man dir via Animation, wie
man springt, rennt, rollt usw. - als eine animierte Tastenbelegungs Beschreibung 
(wieder ein neues Wort entworfen - wow!)), da&szlig; Intro erneut ansehen oder
onEscapee wieder verlassen.
<p> 
Das Spiel:
<p>
Grafik &amp; Sound<br>
Die Grafik ist nicht schlecht geraten, es sieht sehr echt aus, wenn Daniel
l&auml;uft, oder rennt oder einfach nur mal in die luft guckt. Die Backgroundgrafik 
ist im Grunde d&uuml;ster, ab und zu gelangt durch einen Spalt etwas Licht
oder eine Deckenbeleuchtung sorgt f&uuml;r (einigerma&szlig;en) klare Sicht. Die Animationen 
sich flie&szlig;end und da es knapp 1000 M&ouml;glichkeiten (leicht &uuml;bertrieben)
gibt, zu sterben... hat sich Invictus Team (Programmierer) auch allerlei
einfallen lassen. Tritt man zum Bsp. in eine Ranke, so saugt diese einem
das Blut aus, oder st&uuml;rzt man eine Schlucht hinunter, klatscht man immer etwas
unsanft auf einen Stein. Oder wie w&auml;re es mit einem Angriff von einer Riesenspinne 
- nix problem... hier gibt es alles. Das ist Invictus Team gut gelungen,
aber wenn man 4-5 mal an der gleichen Stelle &quot;hops&quot; geht und immer die gleiche
Todessequenz sieht, dr&uuml;ckt man schnell genervt die ESC Taste um weiterzuspielen 
- oder es wenigstens zu versuchen. Wie ihr jetzt sicher zwischen den
Zeilen erfahren habt, onEscappe ist recht schwer, der Schwierigkeitsgrad ist
etwas hoch gegriffen und das ist oft ein Grund einfach den Rechner neu zu 
starten und was anderes zu zocken.
Der Sound ist wunderbar. Tolle St&uuml;cke kann man hier vernehmen, die gut zum
Spiel passen und von einer exelennten Ger&auml;uschkulisse unterst&uuml;zt werden.
Also hier kann man nicht meckern.
<p>
Sicher macht onEscapee eine Menge Spa&szlig;, aber manchmal bin ich mit meinen
Nerven echt am Ende, da die Puzzles teilweise sehr knifflig ist, da tr&ouml;stet
die M&ouml;glichkeit des ladens &amp; Speicherns wenig hinweg. Das hilft zwar, aber
gerade wenn man ein H&uuml;rde endlich einmal &uuml;berwunden hat und sich denkt, dort
mu&szlig; ich nicht nochmal hin, wird man oft entt&auml;uscht. onEscapee k&ouml;nnte man
auch in einem Hochaus handeln lassen, wo man von einem Stock in den anderen
mu&szlig; und wieder zur&uuml;ck, denn sehr oft mu&szlig; man mehr als nur zweimal in der 
gleichen Situation bestehen. Also Tip meinerseits... immer h&uuml;bsch abspeichern.
<p>
Und hier jetzt ein paar Bilder:<br>
<center><table><tr><td><img src="../pic/level1.gif" width="200" height="124"></td><td><img src="../pic/level3.gif" width="200" height="124"></td></tr>
<tr><td><img src="../pic/level4.gif" width="200" height="124"></td><td><img src="../pic/level5.gif" width="200" height="124"></td></tr>
<tr><td><img src="../pic/level6.gif" width="200" height="124"></td><td> </td></tr></table></center>
<p>
onEscapee ben&ouml;tigt einen AGA Amiga mit 4 MB Fast Ram und 1 MB Chip Ram, sowie
nat&uuml;rlich ein CD Laufwerk und mindestens ein 020 Prozessor.
Es ist f&uuml;r knapp 70,- DM im handel erh&auml;ltlich.
<p>
Fazit:<br> onEscapee ist im Genre Action Adventure das beste seid Another World
       oder Flashback. Grafik und Animationen sind sehr gelungen und musikalisch 
bekommt man auch einiges geboten. Jedoch ist der sehr hohe 
       Schwierigkeitsgrad und die gew&ouml;hnungsbed&uuml;rftige Steuerung nicht gerade
       Motivationsf&ouml;rdernd. Wenn man erstmal bei der gleichen Stelle 4 - 5
       mal umgekommen ist, wird man das Spiel schnell wieder bei seite legen,
       denn da helfen auch die beigelegten Tips wenig, es ist n&auml;mlich eine
       Frage des Timings und das stimmt eben nicht immer. Wem das Demo gefallen 
hat, der wird mit dem Original zufrieden sein, wer sich aber
       &uuml;ber die genannten M&auml;ngel ebenfalls aufregen k&ouml;nnte, sollte die Finger
       davon lassen. Also Demo antesten und dann entscheiden. <b><i>- Gut - </b></i>
       

<p><center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Gameplay:</td><td><img src="../pic/85.gif" width=201 height=11></td><td>85 %</td></tr>
<tr><td>Grafik:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>92 %</td></tr>
<tr><td>Sound:</td><td><img src="../pic/95.gif" width=201 height=11></td><td>95 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/70.gif" width=201 height=11></td><td>70 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/85.gif" width=201 height=11></td><td><b>84 %</b></td></tr>
</table></td></tr></table></center>
<p align="right"><em>-mn-</em></p>
<p>
Quelle:<br>
Thomas Ferst Amiga Hard &amp; Software<br>
K&ouml;penicker Stra&szlig;e 11<br>
15537 Gosen<br>
Tel.: 03362/820097<br>
Fax.: 03362/882988<br>
eMail: <a href="mailto:ferst@t-online.de">ferst@t-online.de</a><br> 
telefonische Bestellung: 18.00 - 21.00 Uhr<br>
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="games03.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="games01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="games05.htm">
</MAP>
</center><hr>

</body>
</html>
