<html>
<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 -AT - Spieleteil</title>
</head>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">


<center><img src="../pic/found-logo.gif" alt="foundation" width="400" height="82"></center>

<p>
Wer h&auml;tte das gedacht, nach vielen Ank&uuml;ndigungen und Terminverschiebungen
ist Foundation nun doch noch erschienen. Zwar haben wir erst etwas sp&auml;ter
ein Testmuster erhalten, aber was lange wehrt, wird endlich gut!
<p>
Da es keine Anleitung gibt (keine gedruckte) lese ich mir zuerst das Online
Guide durch, welches komplett in HTML ist, weshalb die Bezeichnug &quot;Guide&quot;
eigentlich falsch ist. Die sehr umfangreiche Anleitung ist mit vielen Bildern
versehen und erkl&auml;rt Dir alles wissenswerte, zwar vermisse ich einige Dinge,
und zwar die direkte Nutzung von Geb&auml;uden, welche fast garnicht erw&auml;hnt wird.
Schlie&szlig;lich will ich ja nicht nur ein Haus hinsetzten, sondern es auch nutzen
und eventuell in den Herstellungsproze&szlig; eingreifen. Ansonsten findet man alles,
ob Figuren-, Rohstoff- oder eben die Geb&auml;udebeschreibung, &uuml;ber die Installation,
Spielzeil usw. . Sehr viel M&uuml;he hat man sich bei der Geschichte zu Foundation
gegeben, die kanpp 40 KB gro&szlig;e HTML Datei erz&auml;hlt die Geschichte &uuml;ber einen alten
Mann und seinem Helfer Gibbons. Als ein junger Mann den Raum betritt und mit dem
alten ein gespr&auml;ch beginnt, fragt der Alte ihn, ob er gerne tr&auml;umt und ob er diesen
Traum leben m&ouml;chte. Also der Mann darauf mit &quot;Ja&quot; antwortete, sollte dies auch Geschehen.... die Geschicht ist sehr lang und sollte weniger als Kurzgeschichte be-
zeichnet werden, meine Sch&auml;tzung liegt bei weit &uuml;ber 1000 W&ouml;rter und es nimmt einige
Zeit in Anspruc, bis man das alles gelesen hat. Da die jeweiligen Aufgaben vor beginn der Mission erkl&auml;rt werden, gehe ich jetzt nicht n&auml;her darauf ein - w&uuml;rde viel
zu viel Platz wegnehmen.
<p>
Spielt man Foundation von CD, so beginnt es mit einem kleinen Intro, in dem der
Sonnenaufgang gezeigt wird und der anschlie&szlig;ende &quot;Kameraflug&quot; &uuml;ber ein Haus bzw.
ein Fort bis hin zur Flagge auf der steht:FOUNDATION.
Installiert man Foundation (immerhin 113 MB), so bekommt man kein Intro zusehen.
Nach dem Intro folgt auch gleich das Men&uuml;. Hier steht die Wahl frei, ob Eroberungsspiel, Sonderspiel, Optionen, Spiel laden oder Verlassen.
<p>
Eroberungspiel:<br>
Das Spiel wird hier ganz normal begonnen, mit dem ersten Level. Hat man eine
Mission beendet beginnt die n&auml;chste, es steigt der Schwierigkeitsgrad, wie auch
der erungene Technologie Grad.
<p>
Sonderspiel:<br>
Beim Sonderspiel kann man erstmal vieles einstellen. Ob Allein oder gegen 1 - 3
CPU Gegner kann man antreten, wobei auch das Spielziel nicht festgelegt ist.
M&ouml;glich sind &quot;80% des Landes&quot;, &quot;Feind ausl&ouml;schen&quot; oder &quot;Torch Enemy&quot;. Weiterhin
kann man den Technoligielevel festlegegen, den Terrain Typ und die Anfangsre-
sourcen. Hat man dies alle erledigt, kann man entweder eine Karte ausw&auml;hlen oder
den Zufallsgenerator w&auml;hlen lassen. Klick man auf &quot;Karte ausw&auml;hlen&quot; so erscheint
ein neues Men&uuml;, in welchem die Karte gew&auml;hlt werden kann, sowie auch die Basisstation und der Standort der Gegnerischen Basis entschieden werden kann.
Danach kann es auch gleich beginnen - auf das Ihr siegen m&ouml;get!!!!
<p>
Die Bewohner<br>
In Foundation gibt es laut Online Handbuch ca. 1 Million Charaktere, die mit
ca. 1000 eingescannten Pa&szlig;bildern unterlegt sind. Nachgez&auml;hlt habe ich nicht,
aber wenn man sich mal die Verzeichnisse ansieht, k&ouml;nnte es sogar stimmen. Diese
gro&szlig;e Anzahl von verschiedenen Leuten l&auml;&szlig;t das Spiel etwas realistischer wirken
und Ereignisse wie der Tod sorgen nicht daf&uuml;r, da&szlig; man einen Menschen sp&auml;ter
wieder nicht wieder trifft.
<p>
Gameplay:<br>
Die Steuerung funktioniert sehr einfach. Klickt man auf ein Feld der Landkarte
erscheint ein kleines Icon mit einem Haus darin. Unter dem Haus befindet sich
dann ein Haken oder ein Kreuz, also bei einem Haken kann man ein Haus bauen und
bei einem Kreus nicht - logisch! Wenn man ein Platz gefunden hat und nun sein
Haus darauf bauen will, kann man sich aus der linken Men&uuml;seite das jeweilige 
Geb&auml;ude aussuchen und dann errichten, wenn man zuwenig Rohstoffe hat oder der 
Platz nicht ausreicht, wird einem dies angezeigt und man mu&szlig; sich entweder einen
neuen Platz suchen oder f&uuml;r gen&uuml;gend Rohstoff sorgen. L&auml;uft aber alles zu Deiner
zufriedenheit, wird das Haus gebaut. Anstatt Bauleuten, kommt hier ein kleiner
Zauberer und zaubert praktisch das Geb&auml;ude hin - sehr n&uuml;tzlich, somit kann man
das Haus gleich nutzen, ohne ewig warten zu m&uuml;ssen. Folgend zeige ich Euch mal
ein paar  Geb&auml;ude .
<br><center><table><tr><td><img src="../pic/bld1.gif"  width="96" height="96"></td><td><img src="../pic/bld2.gif" width="95" height="95"></td><td><img src="../pic/bld3.gif" width="86" height="89"></td></tr>
<tr><td><img src="../pic/bld4.gif"  width="96" height="91"></td><td><img src="../pic/bld5.gif" width="96" height="91"></td><td><img src="../pic/bld6.gif" width="80" height="83"></td></tr></table></center><p>
Die erste Mission ist noch recht leicht, man mu&szlig; einfach nur in den n&auml;chsten
Technologielevel gelangen. Von denen gibt es insgesamt 4 St&uuml;ck. Dazu mu&szlig; man
ein paar Geb&auml;ude &quot;erfinden&quot; und auch eine gute Lebenssituation (sprich gro&szlig;e
Bev&ouml;lkerung) schaffen. Diese will aber mit allem versorgt werden, also mu&szlig; 
man sich um Wasser, Nahrung, Holz, Gold und vieles viels mehr k&uuml;mmern. Abhilfe schaffen da die vielen Geb&auml;ude, von denen man aber nicht gleich alle
nutzen kann.
<p>
Grafik:<br>
Sicherlich nicht der entscheidenste Aspekt ist die Grafik. Spielziel und
Spielstory gehen da ja etwas vor, doch bei Foundation bekommt man hier
einiges zu sehen. Gerenderte Zwischenbilder oder ein Intro (leider sehr
kurz und sagt auch kaum etwas &uuml;ber das Spiel aus, die knapp 100 MB h&auml;tte man
sparen k&ouml;nnen!), man hat sich viel M&uuml;he gegeben. Das Spiel selbst wird aus
einer <u> ISO - 3d Ansicht </u> betrachtet, wie man es aus Die Siedler oder Syndicate
kennt. Die Figuren sind gut animiert worden, wie auch die Geb&auml;ude und die
Landschaft, da&szlig; aber nur bei dem richtig eingestellten Screenmode. Da fuscht
einem Foundation aber dazwischen. DoublePAL Hires Flimmerfrei, wie auch der
DBPal Hires Screenmode werden zwar angegeben, vom Spiel aber nicht unterst&uuml;tzt,
hier kommt es zu einem regelm&auml;&szlig;igen Absturz. Also VGA Besitzer, entweder
ScanDoubler zulegen oder den g&uuml;nstigeren Weg gehen und den Screenmode &auml;ndern.
In DBPal LowRes sieht es zwar nicht ganz so gut aus, klappt daf&uuml;r aber!
F&uuml;r ein Spiel von `98 ist dies eigentlich ein Witz, aber was will man machen?
Hier m&uuml;ssen zuk&uuml;nftig auch andere Hersteller mal etwas mehr auf die jeweiligen
Screenmodes eingegehen, viele User haben n&auml;mlich einen VGA Monitor zu hause und
gucken meist verdutzt, wenn der Screenmode nicht akzeptiert wird.
<br><img src="../pic/found_1.gif" alt="Screen" width="640" height="400"> 
<p>
Musik:<br>
Der Sound von Foundation ist wirklich fantastisch, ob die Audiotracks,
welche teilweise sogar wie orchestrale Meisterwerke klingen, oder die Mods
im Spiel, alle sind wunderbar gelungen und untermalen das Flair des Spieles.
Man wird in eine Traumwelt versetzt, die man aber schnell als das Mittelalter
bezeichnet. Eine solche Musik gab es schon lange nicht mehr, und verdient
somit eine hohe Wertung, und ist - das kann man ruhig so sagen - im Genre
Strategie ungeschlagen. Die Effeckte kann man vergleichen, mit denen aus &quot;Die
Siedler&quot;, ob Holzhacken, ausgesto&szlig;ener Qualm (leichtes puffen zu vernehmen,
Zauberkl&auml;nge oder menschliche Ger&auml;usche (von &quot;Hello&quot; bis &quot;Yes, Sir&quot; ist alles
dabei). Also eine wirkliche Glanzleistung!
<pre>
Systemvoraussetzungen: AGA oder GFX 
                       020 Prozessor und 2 MB Ram
                       2x CD Laufwerk
                       
                       Ich empfehle: AGA oder GFX
                                     030 Prozesser mit mindstens 8 MB
                                     4x CD Laufwerk oder HD Installation
</pre>
<br>
<b>Fazit:</b><br> Foundation - f&uuml;r viele der indirekte Nachfolger von &quot;Die Siedler&quot; -
       ist sein Geld mehr als wert. Ob Grafik, Sound oder Gameplay... es ist
       rundum gut gelungen. So ein Spiel ist mir seit &quot;Die Siedler&quot; und &quot;Colonization&quot; nicht mehr in mein Laufwerk gekommen und wird dieses so schnell
       nicht mehr verlassen. Ein Mu&szlig; f&uuml;r jeden Strategen und f&uuml;r alle, die mal
       welche werden wollen!!! <i><b>- Empfehlenswert - </b></i> 

<p><center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Gameplay:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>90 %</td></tr>
<tr><td>Grafik:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>89 %</td></tr>
<tr><td>Sound:</td><td><img src="../pic/100.gif" width=201 height=11></td><td>97 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/95.gif" width=201 height=11></td><td>96 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/95.gif" width=201 height=11></td><td><b>95 %</b></td></tr>
</table></td><td><img src="../pic/atawart.gif" width=111 height=111></td></tr></table></center>
<p align="right"><em>-mn-</em></p>

<p>
Quelle:<br>
Thomas Ferst Amiga Hard &amp; Soft<br> 
K&ouml;penicker Str. 11<br>
15537 Gosen b. Berlin<br>
Tel: 03362/820097<br>
Fax: 03362/882988<br>
eMail: <a href="mailto:ferst@t-online.de">ferst@t-online.de</a><br>
telefonische Bestellung 18.00 - 21.00 Uhr
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="games02.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="games01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="games04.htm">
</MAP>
</center><hr>

</body>
</html>
