<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - AT - Spieleteil</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>




<center><h1> Samba World Cup </h1>

<img src="../pic/Samba1.jpg" width=320 height=256></center><p>
Ich glaube es ist schon der dritte Teil der Samba Reihe, aber gena wei&szlig;
ich da&szlig; auch. Nun, Samba World Cup ist in erster Linie ein Manager Game,
was etwas an Bundesliga Manager Hattrick erinnert. Ob es genau so gut ist,
da&szlig; ist jedoch die Frage. Die CD Version enth&auml;lt einmal das Game in gepackter Form 
(lha = 10 MB) und in entpackter Form zum installieren. Wenn
man das Game installiert (etwa 2 MB) wird weiterhin die CD Rom ben&ouml;tigt.
Ich habe es vorgezogen, da&szlig; Spiel zu entpacken und dann von der HD aus
zu spielen, da es um einiges schneller von statten geht, als von CD -
obwohl... das h&auml;ngt ja auch von der Laufwerksgeschwindigkeit ab, als mit
einem 4fach Speed CD Laufwerk ist es nicht zu empfehlen, dann nehmt Euch
lieber etwas Platz auf der Festplatte.
<p>
Nach dem Start erscheint das erste von 3 Auswahlmen&uuml;`s. Anfangs wird die
Sprache festgelegt, als Vorgabe gibt es Deutsch und Engslich. Danach kann
man sich den Schwierigkeitsgrad aussuchen, hierbei stehen Anf&auml;nger, Profi
und Worldclass zur Auswahl. Und zuletzt wird noch entschieden, ob man im
WM/EM Modus oder im Liga Modus spielen m&ouml;chte. Im WM/EM Modus stehen insgesamt
 24 Mannschaften zur freien Wahl. Nun legt man f&uuml;r Spieler 1 die
Manschaft fest, nimmt eventuell schon ein paar &Auml;nderungen vor oder legt
gleich los. Auch zu zweit kann man Samba World Cup spielen, man mu&szlig; nur f&uuml;r
seinen Gegenspieler auch eine Mannschaft ausw&auml;hlen. Hat man nun noch seinen
Namen eingetragen, erscheint endlich das eigentliche Men&uuml; von Samba World
Cup. Hier kann man wie auch bei BMH die Statistiken betrachten, Kredite aufnehmen, 
Sponsoren suchen bzw. verpflichten, Aufstellungen &auml;ndern, Trainingseinheiten 
verordnen und vieles mehr tun. Hat man seine Mannschaft dann richtig
in Schwung gebracht, kann es auch gleich losgehen. das erste Spiel beginnt.
Ein neuer Screen erscheint und verschiedene Mannschaften werden angezeigt,
also praktisch die Spiele. Vor jedem &quot;Duell-Namen&quot; ist ein Ball, klickt man
diesen an, bekommt er einen gr&uuml;nen Rahmen. Der bewirkt folgendes: Alle Spiele
bei den der Ball nicht angeklickt wird finden sofort statt, da&szlig; heit&szlig; das die
90 Minuten ablaufen und die erziehlten Tore angezeigt werden, bei den Mannschaften, 
bei den der Ball angeklickt wurde, diese m&uuml;ssen das Spiel erst austragen, 
was einen in den Action Modus des Spieles bringt, jedoch konnte ich
diesen nicht testen. Warum nicht? Nun das Spiel lief bei mir im Manager Modus
auf einem VGA Monitor, der Action Part stellt allerdings auf den normalen Pal
Modus um, den ein VGA Monitor nicht darstellen kann. Auch das anschlie&szlig;en eines
TV Ger&auml;tes brachte nichts, im Gegenteil... der Manager Modus lief garnicht, da
dieser wiederum nur im DB:Pal Modus ansprechbar ist. Puh, ganz sch&ouml;n komisch,
selbst eine Neuinstallation half nichts, also das fand ich schon kurios, ich
lasse ihn somit aus dem Test und dem Testergebnis raus - ber&uuml;cksichtig dies
bitte!
<p>
Fazit:<br> Samba World Cup ist eine gute Idee gewesen, an der Umsetzung hat es 
       allerdings etwas gehappert. Der Sound nervt mit der Zeit und bringt
       keine Abwechslung, obwohl man sich grafisch M&uuml;he gegeben hat, wirken
       die Men&uuml;`s etwas trostlos. Bundesliga Manager Hattrick bleibt somit
       weiterhin ungeschlagen und z&uuml;ckt die Spitze der Amiga Soccer Simulationen! 
Ich finde es etwas schade, denn ein Manager Spiel, bei dem
       man selbst auf dem Rasen aktiv werden kann, ist wirklich genial, aber
       irgendwie bekommt das keine Firma so richtig hin. Auch ein Modus bei,
       der man seine Mannschaft spielen sieht fehlt, so da&szlig; ich BMH weiterhin
       vorziehe. Wie ich schon sagte, den Action Teil konnte ich nicht testen,
       ich mich mit Sayonara Software in Verbindung setzen und hoffe das Problem 
zu l&ouml;sen, wenn es geht erfahrt Ihr es in unserer n&auml;chsten Ausgabe. <b><i>- Gut - </b></i>



<p><center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Gameplay:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>87 %</td></tr>
<tr><td>Grafik:</td><td><img src="../pic/85.gif" width=201 height=11></td><td>83 %</td></tr>
<tr><td>Sound:</td><td><img src="../pic/75.gif" width=201 height=11></td><td>75 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/85.gif" width=201 height=11></td><td>83 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/80.gif" width=201 height=11></td><td><b>82 %</b></td></tr>
</table></table></center>
<p align="right"><em>-mn-</em></p>

Quelle:
Sayonara Software
Altenst&auml;dter Stra&szlig;e 14
61194 Niddatal
Tel/Fax: 06187-26498
<a href="http://privat.freepage.de/sayonara/">http://privat.freepage.de/sayonara/</a>


<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="games07.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="games01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="lforumfr.htm" target="main">
</MAP>
</center><hr>

</body>
</html>
