<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - AT - Spieleteil</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>
<b>
achtung: dieses spiel ist f&uuml;r  jugendliche unter 18 jahren in deutschland
verboten. erwerben kann man es nur gegen vorzeigen des personalausweises.
ich bitte auch sie als eltern  (es gibt auch &auml;lter user),  nicht   dieses
spiel f&uuml;r ihre kinder zu erwerben.das ist verboten! bitte ber&uuml;cksichtigen
sie dies! als magazin steht es uns frei, dieses produkt zu testen, jedoch
zeigen wir ihnen keine screenshots oder einen hinweis, wo sie es erwerben
k&ouml;nnen. fragen sie hierzu bitte ihren h&auml;ndler. danke.                    
</b>
<center><h1>Q***e</h1></center>

Es ging ja alles ziemlich schnell. Nur wenige Monate hat es gedauert
bis Q***e f&uuml;r den Amiga erschien und unsere Herzen erobern wollte.
Sicherlich brauche ich weder zu clickBOOM noch zu PXL/Computers ein
Wort verlieren, denn sie m&uuml;&szlig;ten je jedem User sp&auml;testens seit MYST ein
Begriff sein.
<p>
Q***e - Was ist das eigentlich?<br>
Auch diese Frage ist &uuml;berfl&uuml;ssig, aber f&uuml;r alle die es nicht wissen sollten,
Q***e ist ein 3d-Ego-Shooter im Stile von Genetic Species, oder Alien Breed.
Jedoch ist Q***e sehr brutal, Blut spritz &uuml;berall und wenn man Gegner mit
ein paar Sch&uuml;ssen eine Freude gemacht hat, bleibt von diesen sehr wenig
&uuml;brig! Aus diesem Grund ist Q***e - wie auch sein Genre Vetter D**m - in
deutschen Landen auf dem Index. F&uuml;r alle ab 18 ist es aber gegen vorzeigen
des Personalausweises erh&auml;ltlich.
<p>
Die Geschichte:<br>
Um 4.30 bekommst Du einen Anruf, knapp eine Stunde sp&auml;ter bist Du schon im
der Zentrale bzw. im Geheimen Raum. Der Commander erkl&auml;rt dir nerv&ouml;s: Es ist
wegen dem Slipgate Laufwerk. Wir nutzen es um Menschen zu transportieren und
Fracht von einem Ort zum anderen zu schaffen.&quot;
<p>
Ein Feind mit dem Codenamen Q***e benutzt sein eigenes slipgate um seine
Todestruppen in unsere Basis zu bringen, um dort zu t&ouml;ten, stellen und zu
kidknappen.
<p>
Das schlimmste ist, wir haben keine Ahnung, von wo er oder es ist! Unser Forscher
glauben, da&szlig; Q***e nicht von der Erde ist, sondern von einer anderen Dimension. 
Sie sagen Q***e breitet sich vor um seine Armee auf uns loszulassen, was immer das
sein mag.
<p>
Du bist unser bester Mann. Deine Aufgabe ist es Q***e zu finden und aufzuhalten.
<p>
Im Grunde eine unwichtige Geschichte, denn f&uuml;r den Spieler hei&szlig;t es ja sowieso
nur:&quot;Alles was Du siehst t&ouml;ten, um zu &uuml;berleben!&quot; So ist das Spiel ja auch auf-
gebaut. Bevor wir jetzt zum dirketen Spielgeschehen kommen, verrate ich Euch noch,
was &uuml;berhaupt f&uuml;r eine Konfig ben&ouml;tigt wird. Also getestet wurde Q***e auf einem
A1200 mit Blizzard 1230/4 mit 50 Mhz und 40 Mhz FPU, dazu noch 20 MB Fast Ram.
Dies ist aber in keinster weise ausreichend. Wir empfehlen einen 68060 mit mindestens 32 MB Ram und FPU! Diese hohe Hardwareanforderung hat mich sehr entt&auml;uscht,
denn von MYST (min. 68020/8 MB/HD) zu Q***e (min. 68060/16MB/HD) ist ein enormer
Sprung gemacht worden, den sich nicht jeder leisten kann.
<p>
Nachdem Q***e nun komplett installiert wurde, konnte ich nach einem Neustart sofort
loslegen. Q***e initialisiert die Konfig, stellte den Screenmode ein und startete
danach automatisch. Im Men&uuml; hat man die M&ouml;glichkeit den Screenmode zu &auml;ndern, alle
Soundeinstellungen zu t&auml;tigen und Q***e seinem Rechner und seinen W&uuml;nschen anzupassen. Ist alles so, wie man es haben will, sollte man keine Zeit mehr verlieren,
sondern das Spiel beginnen. Nach einer kurzen Ladepause, erscheint die &uuml;bliche 3d 
Ansicht und wer glaubt jetzt loszulaufen und alles zu t&ouml;ten was einem in die Quere
kommt, so wird man sehr sehr schnell auf den Boden der Realit&auml;t zur&uuml;ckgeholt.
Q***e gleicht stellenweise eher einer Slideshow , also keinem guten und somit auch
schnellen 3d-Ego-Shooter. Zwar sieht die Grafik im 1x1  Pixel Format wirklich super
aus, aber die Spielgeschwindigkeit l&auml;&szlig;t einiges zu w&uuml;nschen &uuml;brig.
<p>
Der Sound ist sehr d&uuml;ster, CDDA Tracks sind auch vorhanden und passen sich ideal dem
Spiel an. Die Animation sind - trotz der Geschwindigkeit- recht gut gelungen, es sieht
einfach gut aus, wenn von einem Vorsprung ein Rottweiler auf Dich hinabst&uuml;rtzt, um dir
den Gar aus zu machen. Auch wenn die ersten menschlichen Gegner oder sagen wir mal
&quot;Wesen&quot; ankommen und die erste Kugel im Leib sp&uuml;ren, wurde dies akustisch und grafisch
sehr gut in Szene gesetzt.
<p>
Q***e ist sicher nicht das ultimative, bietet aber doch einige gelunge Features. Vergleichsweise &quot;Genetic Species&quot; begn&uuml;gt sich hier mit 020 und 8 MB und ist sehr schnell,
grafisch d&uuml;ster und musikalisch gut ausgelegt, so da&szlig; ich dieses Spiel langsameren
Amiga`s vorziehe. Ist sicherlich eine Ansichtssache, aber wer nun mal nur 020 und 8
MB hat, wird die Ausgabe von knapp 100 DM f&uuml;r das Spiel sicher bereuen. Also &uuml;berlegt es Euch!
<p>
<b>Fazit:</b><br> Q***e ist wirklich gut gelungen und f&uuml;r alle High End Amigas auf jeden
       Fall zu empfehlen. Allen anderen Usern rate ich dringendst aufzur&uuml;sten,
       das clickBOOM diese Schiene weiterf&auml;hrt, ihr neustes Spiel Napalm ben&ouml;tigt
       ja auch wieder mindestens 16 MB und einen h&ouml;heren Prozessor. Q***e habe
       ich nicht so ausgiebig zocken k&ouml;nnen, wie ich es mir gew&uuml;nscht habe, da
       mein Rechner nicht die n&ouml;tige Hardware hat (060 Prozessor), aber Freunde
       waren voll zu frieden.
       Aufgrund der hohen Anforderungen f&auml;llt auch die Bewertung aus, d.h. auf
       High End Rechner w&auml;ren die Prozente jeweils h&ouml;her.<i><b>- Gut -</i></b>
       

<center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Gameplay:</td><td><img src="../pic/60.gif" width=201 height=11></td><td>60 %</td></tr>
<tr><td>Grafik:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>90 %</td></tr>
<tr><td>Sound:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>88 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/70.gif" width=201 height=11></td><td>70 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/80.gif" width=201 height=11></td><td><b>78 %</b></td></tr>
</table></td></tr></table></center>
<p align="right"><em>-mn-</em></p>
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="games04.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="games01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="games06.htm">
</MAP>
</center><hr>


</body>
</html>
