<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - AT - Spieleteil</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>




<center><h1>Forest Dumb Forever</h1></center>


Es sind viele Jahre vergangen, als ich das letzte mal in einem Wald voller
interessanter Geheimnisse war. Es ist also an der Zeit , da&szlig; ich wieder mal
einen Ausflug in dieses wundervolle Land mache.
<p>
So kurz und aussagekr&auml;ftig ist die Story des Jump'n'run Games Forest Dumb
Forever. Ziel des Spiele ist es in sechs Leveln sein k&ouml;nnen zu beweisen und
so viele Punkte einzusammeln, wie es nur geht. Man hat eine bestimmte Anzahl 
von Coins zu sammeln, damit das Tor in eine neue Welt bzw. Level aufgeht. 
Sowas kennt man ja schon von dem Game Kid Chaos. Weiterhin hat man
eine Zeitbrenzung und nur eine bestimmte Anzahl von Leben und wenn man bedenkt 
das man nach dreimaligem Kontakt mit einem Gegner schon tot geht, 
sind 10 Leben nicht gerade viel. 
<p>
Als kleiner ... ich w&uuml;rde sagen Urmensch oder Waldmensch geht es also durch
6 gro&szlig;e und frabenfrohe ECS Welten. Die Grafik ist wahrscheinlich im Jahre
1993 stehengeblieben, denn sie hat nichts neues zu bieten und da das Game
ab A500 aufw&auml;rts nutzbar ist, d&uuml;rfte ja jedem klar sein, wie die Grafik ausf&auml;llt. 
Doch hier mal ein <u> Bild! </u>
<p>
<img src="../pic/dumb_1.gif" width=320 height=309>
<p>
Die Musik und der SoundFX sind - das mu&szlig; ich so sagen - schlecht. Men man 
einen Gegner t&ouml;tet, da&szlig; hei&szlig;t einfach auf ihn draufspringt, gibt es nur
einen kleinen Knall, der einem Boxschlag &auml;hnelt und nach kurzer Spielzeit
sehr nerven kann. Ansonsten gibt es kaum Musik.
<p>
Gesteuert wird das Spiel &uuml;ber den Joystick, was recht einfach geht, aber
oftmals auch zum Tode f&uuml;hrt. L&auml;uft man n&auml;hmlich ein mal zu scnell und springt
danach, hat man M&uuml;he die Figur unter Kontrolle zu kriegen. 
<p>
<img src="../pic/dumb_2.jpg" width=320 height=309>
<p>
Auch wenn sich dies alles sehr negativ anh&ouml;rt, mu&szlig; man fairerweise sagen,
da&szlig; das Spiel kurze Zeit fesseln kann und gerade f&uuml;r sehr junge User da&szlig;
richtige ist, da es keinerlei brutale Gewalt gibt.
<p>
Fazit:<br> Forest Dumb Forever ist technisch sehr veraltet und somit f&uuml;r
       den Preis von 29,95 DM etwas teuer. Aber wie ich schon sagte,
       kann das Game f&uuml;r kurze Zeit gute Unterhaltung bieten und da es
       seit langem das erste Jump'n'run wieder ist, sollte sich so mancher
       Fan eventuell doch zum Kauf entscheiden. <i><b>- Befriedigend - </i></b>
       

<center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Gameplay:</td><td><img src="../pic/80.gif" width=201 height=11></td><td>80 %</td></tr>
<tr><td>Grafik:</td><td><img src="../pic/75.gif" width=201 height=11></td><td>74 %</td></tr>
<tr><td>Sound:</td><td><img src="../pic/60.gif" width=201 height=11></td><td>60 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/75.gif" width=201 height=11></td><td>75 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/70.gif" width=201 height=11></td><td><b>72 %</b></td></tr>
</table></td></tr></table></center>
<p align="right"><em>-mn- </em></p>

Quelle:<br>
APC &amp; TCP, Andreas Magerl<br>
Dorfstra&szlig;e 17<br>
D-83236 &Uuml;bersee<br>
<a href="http://www.chiemgau.de/apc&tcp">http://www.chiemgau.de/apc&tcp</a><br>
Tel.: 08642/899953

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="games06.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="games01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="games08.htm">
</MAP>
</center><hr>
</body>
</html>
