<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Aktuell</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>




<center><h1>diverse news</h1></center>

<b>APC &amp; TCP mit neuem Shot em Up</b><br>
GunBee F-99<br>
GunBee ist da! Schl&uuml;pfen Sie in die Rolle der schwerbewaffneten
kleinen Biene und befreien Sie die holde Lady Akiko aus den F&auml;ngen
des b&ouml;sen Lords Khenmir. Dazu m&uuml;ssen Sie f&uuml;nf spannende, im
Japano-Comic-Stil gestaltete Welten durchfliegen um sich im Finale
dem Obermotz pers&ouml;nlich zu stellen! 
<br><img src="../pic/gun_1.jpg" width=224 height=210><img src="../pic/gun_2.jpg" width=224 height=210><br>
Systemanforderungen: AGA Amiga, HD, 4 MByte Fast-RAM
<p>
<b>Aminet 26 jetzt verf&uuml;gbar</b><br>
Die Aminet CD 26 - August 1998 - beinhaltet &uuml;ber ein Gigabyte (ungepackt) an
Software in Tausenden von Archiven. Seit der Aminet 25 CD sind mehr als 500 MB
an Neuheiten hinzugekommen. Alle Programme sind Deutsch beschrieben; viele
verf&uuml;gen &uuml;ber eine deutsche Dokumentation. Als kommerzielles Highlight ist auf der Aminet 26 die uneingeschr&auml;nkte Vollversion von XiPaint 4.0, dem popul&auml;ren 24-bit Mal- und Zeichenprogramm enthalten.
<p>
Inhalt der Aminet 26 CD
<p><table>
<tr><td>Verzeichnis</td><td>  Umfang</td><td>          Archive</td><td>       Inhalt</td></tr>
<tr><td>biz        </td><td>   36MB </td><td>         109     </td><td>      Gesch&auml;ftssoftware</td></tr>
<tr><td>comm       </td><td>   37MB </td><td>         147     </td><td>      Kommunikationssoftware</td></tr>
<tr><td>demo       </td><td>  115MB </td><td>          81     </td><td>      Demos</td></tr>
<tr><td>dev        </td><td>   30MB </td><td>         101     </td><td>      Entwicklungssoftware</td></tr>
<tr><td>disk       </td><td>   10MB </td><td>          29     </td><td>      Harddisk Tools</td></tr>
<tr><td>docs       </td><td>   55MB </td><td>          75     </td><td>      Dokumente</td></tr>
<tr><td>game       </td><td>  129MB </td><td>         178     </td><td>      Spiele</td></tr>
<tr><td>gfx        </td><td>   36MB </td><td>          74     </td><td>      Grafiksoftware</td></tr>
<tr><td>hard       </td><td>    3MB </td><td>          19     </td><td>      Rund um Hardware</td></tr>
<tr><td>misc       </td><td>   43MB </td><td>          60     </td><td>      Verschiedenes</td></tr>
<tr><td>mods       </td><td>  266MB </td><td>         347     </td><td>      Musikmodule</td></tr>
<tr><td>mus        </td><td>   21MB </td><td>          65     </td><td>      Musik Software</td></tr>
<tr><td>pix        </td><td>  104MB </td><td>         147     </td><td>      Bilder</td></tr>
<tr><td>text       </td><td>    9MB </td><td>          59     </td><td>      Texte</td></tr>
<tr><td>util       </td><td>   28MB </td><td>         225     </td><td>      Utilities</td></tr>
</table>
<p>
<b>&quot;Amiga Survivor&quot; - neues Amiga-Magazin aus England</b>
<p>
In England ist die erste Ausgabe des neuen Amiga-Spielemagazins &quot;Amiga Survivor&quot;
erschienen. Es wird zum Preis von &pound;2,95 pro Ausgabe angeboten und kann per
Kreditkarte auch von au&szlig;erhalb Englands bezogen werden. F&uuml;r weitere Information
besuchen Sie bitte die Amiga Survivor Website oder wenden Sie sich an Robert 
Iveson Managing Director, Amiga Publishing Department, Crystal Software 
International Amiga Survivor 41 Wellstone Garth Swinnow, Leeds West Yorks LS13
4EJ England <img src="../pic/surno1.jpg"> (Quelle: AI)
<p>
<b>Neues AMIGA Mauspad</b>
<p>
Ein brandneues AMIGA-Mauspad ist da! Das kreisrunde BoingPad kann &uuml;ber den 
Amiga-Fachhandel bezogen werden. Und so sieht es aus <img src="../pic/pad.gif">
(Quelle: AI)

<p>
<b>CU AMIGA wird eingestellt</b>
<p>
Wie wir erfahren haben, wird die Oktober Ausgabe des englischen CU Amiga
Magazins die letzte sein. Angeblich sei das Magazin nicht mehr frofitabel
genug, was allerdings etwas kurios ist, zumahl es das meistverkaufte Amiga
Magzin in der Welt ist! Auch in Deutschland hat man dieses Magazin kaufen
k&ouml;nnen, aber mit der n&auml;chsten Ausgabe ist Schlu&szlig; damit. Dies ist ein erneuter 
Schlag mitten ins gesicht aller AMIGA User. Wenn das so weiter geht,
sind die Online Magazine wohl noch die einzigen die &Uuml;berleben werden, aber
das kann doch nicht der Sinn sein. Hoffen wir nur da&szlig; das neue Englische
Mag &quot;Amiga Survivor&quot; ein Weilchen durchh&auml;lt!!! Mehr Info`s auf der CU-AMIGA
-Homepage: <a href="http://www.cu-amiga.co.uk">http://www.cu-amiga.co.uk</a>
<p>
<b>Fischer Hard &amp; Software:</b>
<p>
In letzter Zeit gingen einige Ger&uuml;chte herum, da&szlig; die Firma Fischer Hard
&amp; Software sich aus dem Amiga Bereich verabschiedet hat. Diese Aussage
ist falsch. Wir machen weiterhin Amiga Verkauf Service und Reparaturen.
Wir verf&uuml;gen noch &uuml;ber ein sehr gro&szlig;es Lager und bem&uuml;hen uns f&uuml;r die
Kunden alle Ware die sie noch ben&ouml;tigen zu besorgen. Selbst Artikel die
bei einige H&auml;ndlern vergriffen sind sind bei uns oft noch zu erhalten.
Auch auf unserer Internetseite <a href="http://www.fischer-hs.de">http://www.fischer-hs.de</a> arbeiten wir
st&auml;ndig weiter und bringen immer aktuelle Preise und Infos. F&uuml;r Fragen
k&ouml;nnen sich alle Kunden an uns wenden. Tel. 0511 - 572358, FAX
0511-572373. EMAIL <a href="mailto:info@fischer.hs.de">info@fischer.hs.de</a> Vielen Dank und frohe Amiga Zeiten
w&uuml;nscht Ihnen allen Christian Fischer. Fischer Hard &amp; Software.
<p>
<b>Geek Gagdet May`98 ist jetzt verf&uuml;gbar bei der Schatztruhe</b>
<p>
Die 412 MB gro&szlig;e CD enth&auml;lt wieder viele Entwickler Tools, unteranderem C/C++ Compiler, GNU, Fortran, Ada, GNU Emacs, TeX, Perl
und vieles mehr. Die Daten sind jeweils mit vollst&auml;ndigem Source
Code verf&uuml;gbar. F&uuml;r 19,95 DM ist diese CD bei Stefan Ossowski`s
Schatzruhe erh&auml;ltlich <br>(<a href="http://www.schatztruhe.de">www.schatztruhe.de</a>)(Tel.:02 01/78 87 78)
<p>
<b>Gateway 3 CD bei der Schatztruhe zum Superpreis!</b>
<p>
Die Gateway 3 Doppel CD kostest nur 19,95 DM und enth&auml;lt NetBSD 1.3.2
im vollem Umfang. Diese CD ist ein Mu&szlig; f&uuml;r jeden UNIX Kenner und f&uuml;r
jeden der mehr als nur eine Plattform sein eigen nennt; richtet sich
aber auch f&uuml;r fortgeschrittene Benutzer. Als Extra, kann man diese
CD direkt booten und installieren.
<p>
<b>Schlechte Neuigkeiten von Vulcan Soft. </b>
<p>
Vulcans, D.S.P. Development Team, verantwortlich f&uuml;r den Amiga CDRom Titel
'Almagica Scions of a Forgotten World' haben sich entschlossen, die Entwicklung
des Spieles zu beenden. Auch Black Flag Development Team verantwortlich f&uuml;r
das CDRom Spiel 'Caveman Species', werden alle Arbeiten an diesem Titel beenden.

<p align="right"><em>-mn- </em></p>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="news02.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="news01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="news04.htm">
</MAP>
</center><hr>

</body>
</html>
