<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Sauerstoff</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



 <center>  Sauerstoff-Mehrschritt-Therapie</center>
<p>   
   (nach Professor Manfred von Ardenne)
<p>   
   Viel h&auml;ufiger, als fr&uuml;her angenommen wurde, ist ein schlechter
   Sauerstoff- bzw. Energiestatus die prim&auml;re oder indirekte Ursache von
   Krankheiten, Leiden und Beschwerden des Menschen. Deshalb geh&ouml;rt die
   Sauerstoff-Mehrschritt-Therapie, bzw. Immunstimulation...zu den wichtigsten
   Methoden der Pr&auml;ventivmedizin&quot;.
<p>   
   (Prof. von Ardenne)
<p>   
   <b>Sauerstoff ist Leben</b>
<p>   
   Mit zunehmendem Alter, durch Stre&szlig;, Bewegungsmangel und die zunehmeden
   Umweltbelastungen sinkt die nat&uuml;rliche Sauerstoffaufnahme und damit die auch
   Energieversorgung des menschlichen Organismus. Die Konsequenzen sind absehbar
   und die Symptome sind bekannt. Auf einen Sauerstoffmangel zur&uuml;ckf&uuml;hren lassen
   sich zum Beispiel h&auml;ufige M&uuml;digkeit, andauernde Konzentrationsschw&auml;che,
   Migr&auml;ne und andere Beschwerden. Weit interessanter - und leider noch immer
   weitgehend unbekannt, sind die positiven Konsequenzen einer gesteigerten
   Zufuhr von Sauerstoff, besonders von reinem Sauerstoff (100% O&sup2;).
<p>   
   <b>Sauerstoff in der medizinischen Anwendung</b>
<p>   
   Die Anwendung des Sauerstoffes in der Notfallmedizin geh&ouml;rt schon seit
   langem zur Routine. Die Notwendigkeit dieser Anwendung und die unmittelbaren
   Erfolge in diesem Zusammenhang sind unbestritten. Wie aber kann die Zufuhr von
   Sauerstoff, oder genauer, dessen Inhalation, weitergehend nutzbringend in der
   Heilbehandlung eingesetzt werden? Eine Verbesserung des Sauerstoff- bzw.
   Energiestatus des Patienten ist ja bekannterma&szlig;en in der &uuml;blichen  Art
   der Anwendung im wesentlichen nur w&auml;hrend der Zuf&uuml;hrung dieses lebenswichtigen
   Elementes gegeben. Um dieser Frage auf den Grund zu gehen, hat der weltweit
   anerkannte Wissenschaftler Professor Manfred von Ardenne mit seinen Mitarbeitern
   umfassende Forschungsarbeit geleistet und die Erkenntnisse 1982 in einer
   bedeutenden Ver&ouml;ffentlichung auch einem breiterem Publikum zug&auml;nglich gemacht.
<p>   
   Das Hauptergebnis seiner Forschung auf diesem Gebiet l&auml;&szlig;t sich leicht
   zusammenfassen. So wurde festgestellt, da&szlig; bei 100% reinen Sauerstoffapplikationen
   mit bestimmter Flu&szlig;dosierung in Kombination mit der Einnahme von Vitaminen und
   unter Zurhilfenahme einer sinnvoll angewandten k&ouml;rperlichen Belastung
   (z.B. mittels eines Fahrradergometers) eine langanhaltende Statusverbesserung
   erreicht wird.<br>
   Das hei&szlig;t im Klartext:<br>
   Anders als bei sonst angewandten Methoden der Sauerstoffzuf&uuml;hrung ist bei
   Anwendung der von ihm dargestellten und eingef&uuml;hrten Therapievariante eine
   langanhaltende Verbesserung des Sauerstoff- bzw. Energie-status im menschlichen
   Organismus nachweisbar. Von Ardenne benannte seine Methode
<p>   
                        <center>  Sauerstoff-Mehrschritt-Therapie</center>
<p>   
   denn sie l&auml;uft in drei aufeinanderfolgenden Schritten ab.
<p>   
   Die drei Grundschritte:
<ul>   
    <li> 30 Minuten vor Therapiebeginn Gabe von Vitaminen (C+B) und Magnesium, um die
      Sauerstoffaufnahme im Gewebe zu erh&ouml;hen.
     <li> Inhalation von reinem (100%) Sauerstoff durch einen speziellen
      Maskenapplikator mit Speicherblase, damit wirklich nur purer Sauerstoff
      eingeatmet wird.
     <li> Sicherung guter Durchblutung durch leichte k&ouml;rperliche Belastung (zum
      Beispiel mit einem Fahrradergometer mit Belastungsanzeige und
      Puls&uuml;berwachung).</ul>
<p>   
   <b>Worauf kommt es an?</b>
<p>   
   Entscheidend ist der von Professor Ardenne entdeckte sogenannte &quot;Schalteffekt&quot;.
   Wenn man nur ausreichend lange eine ausreichende Menge von reinem Sauerstoff
   inhaliert, so bewirkt diess nach einer bestimmten Zeit ein Abschwellen der
   Zellauskleidung der Innenw&auml;nde der Blutgef&auml;&szlig;e. Ergebnis: das Blut -
   und mit ihm der Sauerstoff - kann besser in das Gewebe und zu den einzelnen
   Organen gelangen. Die Zellen werden also verst&auml;rkt mit Energie versorgt.
   Diese f&uuml;r den K&ouml;rper au&szlig;ergew&ouml;hnliche Zufuhr von Sauerstoff f&uuml;hrt aber nicht
   nur zu diesem scheinbar kurzfristigen Effekt, sondern konditioniert den
   K&ouml;rper auch dahingehend, da&szlig; er auch noch lange nach Abschlu&szlig; der Therapie
   nach mehr Sauerstoff &quot;verlangt&quot;. Der Organismus hat sozusagen aus dieser
   Erfahrung gelernt, und wird sich nun auch ohne eine &quot;erzwungene&quot; Zufuhr den
   Sauerstoff aus der Luft holen und in die Zellen schicken.
   Der Organismus ist jetzt auch viel besser in der Lage, den Sauerstoff aus der
   Atemluft zu verwerten. Das Blut wird wieder leuchtend rot - nachdem es bei
   einem geschw&auml;chten, sauerstoffarmen Patienten vor der Therapie dunkelrot bis
   schwarz erschienen ist.
<p>   
   Die Liste der m&ouml;glichen Einsatzgebiete ist beeindruckend:
<ul>   
     <li>  Beschleunigung von Rehabilitation und Wundheilung
     <li>  Lungeninsuffizienz und Bronchialasthma
     <li>  Durchblutungsst&ouml;rungen des Gehirns
     <li>  Kreislaufst&ouml;rungen und Dauerschwindel
     <li>  Bluthochdruck (Hypertonie)
     <li>  Ohrger&auml;usche (Tinnitus)
     <li>  Migr&auml;ne
     <li>  Stre&szlig;
     <li>  und bei einer Vielzahl anderer Beschwerden und Krankheiten</ul>
<p>   
   <b>Fazit</b>
<p>   
   Die Sauerstoff-Mehrschritt-Therapie ist ein nat&uuml;rliches Heilverfahren mit
   universaler Einsatzm&ouml;glichkeit
<p>   
   <b>Literaturhinweis:</b>
<p>   
   Manfred von Ardenne. Wo hilft Sauerstoff-Mehrschritt-Therapie?<br>
   (Mannheim/Wien/Z&uuml;rich: BI-Wissenschaftsverlag, 1989).
   
 <p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="talk03.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="mineral.html">
</MAP>
</center><hr>  
   
   
   
</body>
</html>
