<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



<center><h1>STFax 3.2</h1></center>

Seit einiger Zeit ist nun die neueste Version des Faxprogramm STFax zu
beziehen. Zum Lieferumfang geh&ouml;ren unter anderem eine Diskette auf der
sich STFax befindet und auf der anderen MUI (Magic User Interface).
Die Installation geht schnell von statten. STFax belegt ca. 1,5 MB
Festplatten speicher. Zum begin der Installation mu&szlig;ten wir einen
20 stelligen Code eingeben. Das Programm lag uns in der englischen 
Version vor und wir besorgten uns den deutsch Katalog von Haage und 
Partner. Den deutschen Katalog bekommen nur registrierte Benutzer.
<p>
Das Programm 
<br>
<img src="../pic/stfax.gif" width=720 height=564>
<br>
Zum Start von STFax wird die Konfiguration automatisch erledigt, so das
man sich un&ouml;tige Konfigurationen erspart. Schon von der Userfreundlichen
Bedienung &uuml;berzeugt das Programm sehr und die optische Gestaltung ist 
wirklich gelungen. Dank MUI. Das Programm wird von Hilfesprechblasen be-
gleitet, womit man dann eigentlich keine Schwierigkeiten haben sollte.
Mit STFax lassen sich Faxe verschicken, zu bestimmten Zeiten, empfangen
und Faxe abrufen.
<p>
Voice-Calling
Dabei handelt es sich um ein Voice-Calling System. Das bedeutet, das ihr
Amiga zum Anrufbeantworter werden kann. Sie tun per Telefon oder
Mikrofon ihre Begr&uuml;&szlig;ung auf die Platte sprechen. Wenn dann der Anrufer
bnicht sofort auflegt, wird seine Nachricht als Wave Datei gespeichert.
Und Qualit&auml;t ist wirklich gut. Sie k&ouml;nnen noch ein automatisches Service
System einrichten, das es dem Anrufer erlaubt, eine Fax &Uuml;bertragung zu 
starten, was mir den Telefontasten geschieht.
<p>
Mini-BBS<br>
Dies klinkt ungew&ouml;hnlich, ist aber sehr n&uuml;tzlich. Dadurch k&ouml;nnen sie ihren
Amiga in einen Server verwandeln. Sie benutzen eine Schublade von ihrer
Festplatte hierf&uuml;r, das Daten zum herunterladen enth&auml;lt. Dies erm&ouml;glicht
dem Anwender per Modem die Daten herunter zu Laden zu jeder belibiegen Zeit.
Doch sie m&uuml;&szlig;en noch einen Secure-Doors einrichten. Dann kann sich jeder
User mit dem Passwort und dem Usernamen, die Daten downloaden auf ihre 
eigene Festplatte. Au&szlig;erdem erlaubt es STFax, das man &uuml;ber das Modem einen
Freund oder Verwandten anruft, w&auml;rend man Arbeiten tut.
<p>
Das erstellen von Faxe
Dies ist eigentlich sehr sinnvoll. Sie benutzen entweder das normale STFax
Programm daf&uuml;r oder erstellen sich per Wordworth ihr Fax und schicken es
als Druckerausgabe an ihren Amiga. Dazu benutzt man am besten Turbo Print,
und gibt dort die Drucker Device `STFaxPrt` ein und geht auf Workbench
Treiber. Dann fragt STFax nach dem Fpad und dem Namen der Datei. Somit ist
es auch m&ouml;glich Grafiken direkt einzubinden.
<p>
Fazit:<br>   STFax ist ein mu&szlig; Amiga User, die h&auml;ufig das Fax System verwenden.
         Seine User freundliche Bediener Oberfl&auml;che und die optische
         Gestalltung machen es sehr komfortabel und es l&auml;st andere Faxprogramme 
hinter sich. Alles in allem gab es bei dem Test keine M&auml;ngel.
         Zumindest konnte ich keine M&auml;ngel feststellen. Ohne Zweifel ist dies
         das derzeit beste Fax Programm auf dem Amiga Markt.


<center>
<table>
<tr><td valign="top"><b>Wertung:</b></td><td>
<table bgcolor=#FFFFFF>
<tr><td>Bedienung</td><td><img src="../pic/100.gif" width=201 height=11></td><td>98 %</td></tr>
<tr><td>Gestaltung:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>90 %</td></tr>
<tr><td>Motivation:</td><td><img src="../pic/90.gif" width=201 height=11></td><td>92 %</td></tr>
<tr><td>Gesamt:</td><td><img src="../pic/90.gif" width=201 height=11></td><td><b>92 %</b></td></tr>
</table></td></tr></table></center>
<p>
Systemvoraussetzung<br>
68000, OS 2.0, 1 MB Chip Ram, 2 MB Fast Ram, MUI, Modem
<p>
Empfehlung<br>
68030, OS 3.x, 2 MB Chip, 6 MB Fast oder mehr, MUI, Modem

<p align="right"><em>-sbh- </em></p>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="softw02.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="softw04.htm">
</MAP>
</center><hr>

</body>
</html>
