<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



<center><h1>MakeCD v3.2</h1></center>


Sicherungskopien (oder einfach BackUp`s genannt) sind glaube ich f&uuml;r jeden
User das wichtigste. Auf dem Amiga hat man da auch verschiedene M&ouml;glichkeiten,
ob Zip Medien, Disketten oder CD, es gibt eigentlich f&uuml;r jeden eine L&ouml;sung.
Ich habe mich da f&uuml;r einen CD Brenner entschieden, da einerseits die Medien
daf&uuml;r billig sind (zwischen 1,50 DM und 4,00 DM (wiederbeschreibare CD-R
Rohlinge sind teurer) und mit einer Kapazit&auml;t von 650 MB doch eine Menge
Daten untergebracht werden k&ouml;nnen. Doch der beste Brenner n&uuml;tzt nichts, wenn
man keine richtige Software daf&uuml;r hat. Auf dem Amiga gibt es da BurnIt!, 
MasterISO, CD Creator und MakeCD. Ich habe mich f&uuml;r MakeCD entschieden, warum
das werdet ihr gleich erfahren.
<p>
Im Internet findet man unter <a href="http://makecd.core.de">http://makecd.core.de</a> ein Demo von MakeCD, dies
ist aber eigentlich kein Demo, sondern das volle Programm, dass einzige was
da noch fehlt sind die Registrienummern, um alle Optionen nutzen zu k&ouml;nnen.
<hr>

Zur Erkl&auml;rung: Was ist DAO, Was ist TAO?????<br>
<b>DAO</b><br>
... hei&szlig;t Disc-at-Once und bedeutet soviel, da&szlig; die CD komplett geschrieben
wird und man danach nicht mehr die M&ouml;glichkeit hat, neue Tracks (Audio oder
Daten) einzuf&uuml;gen. Im DAO Modus m&uuml;ssen alle Daten fertig vorliegen, damit
die CD von Anfang bis Ende geschrieben werden kann. DAO ist besonders f&uuml;r
Audio Daten zuempfehlen, damit es zwischen den Tracks kein Knacken gibt.<br>
<b>TAO</b><br>
... hei&szlig;t Track-at-Once und bedeutet soviel, wie einzelne Tracks brennen.
Man kann in diesem Modus zum Beispiel jede Image-datei die man in MakeCD
erstellt hat einzeln brennen und so, in den Brennmodus eingreifen und einen
Track herausnehmen oder hinzuf&uuml;gen, da&szlig; hei&szlig;t, die CD kann theoretisch vor
ihrem fixieren mehrmals mit Daten gef&uuml;ttert werden. F&uuml;r Audio daten ist dieser
Modus sehr ungeeignet!
<hr>
Wie ist MakeCD aufgebaut, seht Euch hierzu folgendes Bild an  
<br>
<img src="../pic/makecd_1.gif" width=640 height=480>
<br>
MakeCD ist mit einer QuickHelp Funtkion ausgestattet, die sofort einen Info
Text aufruft, wenn man mit der Maus &uuml;ber ein Button ist, z.B.: wenn man nicht
wei&szlig; was die Funktion &quot;CD-R Inhalt&quot; hei&szlig;t, bzw. anstellt, f&uuml;hrt man den Pointer
auf diesen Button, wartet kurz und schon kommt ein kleiner Infotext - nette
Idee die einem das lesen des handbuches erspart. Jedoch sollte man das Handbuch,
oder bessergesagt die Online Beschreibung nicht ganz links liegen lassen, denn
sie f&uuml;hrt einen richtig in das Brennen von CD`s ein, erkl&auml;rt viele Funktionen
und gibt auch Tips.
<p>
Brennen die Erste!<br>
Man will nat&uuml;rlich sofort loslegen und nachdem ich alle <u> Einstellungen </u> erledigt
hatte und meinen Brenner MakeCD &quot;zug&auml;nglich gemacht&quot; hatte, sollte es losgehen.
Achja... ein Problem gab es da noch. Version 3.1 DAO die ich f&uuml;r knapp 120 DM
erstanden hatte, wollte im DAO Modus nicht funktionieren. Als ich dann nachschaute, 
fand ich auch die L&ouml;sung des Problems, der Treiber f&uuml;r meinen Brenner
unterst&uuml;tzte den DAO Modus nicht, na super... wem es da &auml;hnlich ging, dem kann
ich nur raten, im Internet die neue Version 3.2 downzuloaden, dort sind neue
bzw. erweiterte Treiber enthalten, so da&szlig; ich nun auch im DAO Modus brennen
konnte.
<br>
<img src="../pic/makecd_2.gif" width=640 height=480>  
<p>
Im Hauptfenster kann man ersteinmal alle Tracks festlegen, entweder man legt
hier ein Dateisystem fest (Schublade oder Partition auf der HD) oder nimmt
einen Track von einer CD. Ist dies erledigt, kann man die Image-Datei(en) er-
stellen, die den Sinn haben, da&szlig; der Puffer immer gef&uuml;llt ist. Das anlegen
solcher Dateien empfiehlt sich, damit nicht mitten im Brennen abgebrochen 
wird, weil der Puffer zu klein ist. Am besten Ihr seht Euch hierzu noch ein
paar Bilder an. 
<br>
<img src="../pic/makecd_3.gif" width=640 height=480>
<br>
<img src="../pic/makecd_4.gif" width=640 height=480>
<br>
Das Brennen geht mit MakeCD einerseits recht flott und auch sehr komfortabel,
obwohl andere Zeitschriften die Aufmachung von MakeCD (nur Fenster) als nicht
sehr gut empfanden, mu&szlig; ich dagegen dies sehr loben, so kann man n&auml;mlich auch
noch andere Programme benutzen und da die Fenster ver&auml;nderbar sind, kann man
sich alles sehr gut auf der WB einrichten. MakeCD in der DAO Version (die TAO
Version ist inklusive) ist ein sehr lohnenswerte Produkt und f&uuml;r jeden User
mit Brenner anzuraten.
<p>
<u>Testkonfiguration:</u>
A1200, Blizzard 1230/IV 50 Mhz, 40 Mhz FPU, 20 MB, 2.1 GB HD,
SCSI 2 Controller, Teac CD-R55s SCSI Brenner 4x Schreiben - 12x Lesen
<p>
Fazit:<br> MakeCD in der Version 3.2 ist sicherlich das beste, was der Amiga an
       Brennersoftware zu bieten hat. Die Men&uuml;`s sind alle verst&auml;ndlich, die
       Quikhelp Option erkl&auml;rt fast jeden Button und sagt was er bewirkt.
       Das anlegen von Image Dateien geht sehr flott und so kann man in 
       relativ kurzer Zeit seine CD`s brennen. BurniT! und MasterISO konn-
       ten mich nicht &uuml;berzeugen und so werde ich weiterhin MakeCD benutzen,
       obwohl der Preis von 120 DM (DAO &amp; TAO) oder 79 DM (TAO) etwas teuer
       ist. Na gut im Vergleich zu BurnIt! (200 DM) oder MasterISO (300 DM)
       ist MakeCD noch g&uuml;nstig, die Preise sind eben allgemein etwas hoch. 
       Doch MakeCD ist es wert. Hervorragende Ergebnisse beim Audio-Track
       und Daten-Track brennen haben mich voll &uuml;berzeugt und MakeCD zu meinem
       Favoriten gemacht. <i><b>- Empfehlenswert - </i></b>  
<center><img src="../pic/atawart.gif" width=111 height=111></center>
<p align="right"><em>-mn- </em></p>

Quelle:<br>
Katrin Schmidt<br>
Finkenweg 26<br>
89233 Neu-Ulm<br>
Tel.: 0731/712316

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="softw03.htm">
</MAP>
</center><hr>

</body>
</html>
