<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



<center><h1>FFNews 2.38</h1></center>


Wer tr&auml;umt nicht davon, alles zu wissen und das meist noch bevor es
die Mehrheit wei&szlig;??? Mit dem Newsreader FFNews k&ouml;nnte schonmal ein An-
fang gemacht sein. Unser Testmuster lag in der Version (2.38) vor und
mal sehn was er so alles drauf hat?! &Uuml;brigens ist jetzt schon Version
2.39 auf dem Markt!
<p>
Was ist eigentlich ein Newsreader? Es gibt im Web viele Gruppen die
sich &uuml;ber bestimmte Themen unterhalten und auch News bekannt geben.
Es ist aber als Otto-Normal-User schwer an diese Infos zu kommen,
bzw. bei Themen die eigene Meinung abzulassen. Das liegt einfach daran
das man ja gar nicht wei&szlig;, wie man diese Briefe der einzelnen Gruppen
&uuml;berhaupt bekommt. FFNews sorgt daf&uuml;r, da&szlig; nach einer korrekten Installation, 
da&szlig; Du diese Briefe erh&auml;lst und Dich eventuell an den Diskussionen 
beteiligen kannst. FFNews gibt schon einige Gruppen vor, so
da&szlig; es kein Problem sein sollte, die richtige Gruppe zu treffen.

F&uuml;r FFNews wird MUI ben&ouml;tigt, nach der Installation sollte man sich
der richtigen Konfiguration witmen. Und da gibt es eine gro&szlig;e Auswahl. 
<br>
<img src="../pic/ff_einst.gif" width=640 height=480>
<p>
Positiverweise liegt dem Programm eine gedruckte Anleitung bei, was
ja heute schon zur Seltenheit geworden ist. Diese Anleitung bringt
einen schnell zum gew&uuml;nschten Ziel und nach ein paar Minuten ist
die Konfiguration abgeschlossen.
<p>
Um FFNews nutzen zu k&ouml;nnen mu&szlig; man nat&uuml;rlich ins Internet gehen
und wer sich dort einige Strapazen ersparen m&ouml;chte (Adressen
werden nicht erkannt u.a.) dem rate ich, sich wirklich mit der
Anleitung zu besch&auml;ftigen, um unn&ouml;tige Kosten zu vermeiden.
<p>
Wie ist FFNews aufgebaut? 
<br>
<img src="../pic/ff_menu.gif" width=640 height=480>
<p>
Auf der einen Seite befinden sich die Gruppen und auf der anderen
Seite die Menu`s, wie unschwer zu erkennen ist, kann man eMails
schreiben, Post holen und so weiter, im Grunde k&ouml;nnte man es auch
als Mailprogramm nutzen, apropos Mailprogramm. Wer YAM benutzt, 
kann sein Adressbuch bei FFNews importieren und die Adressen dort
weiter verwenden. FFNews erlaubt zwei Arten des lesen, einerseits
das &quot;Online&quot; lesen, bei dem man keinen Speicher auf der Platte f&uuml;r
die Mails braucht, Vorraussetzung ist aber eine st&auml;ndige Verbindung
mit dem Newsserver. Die andere und in meinen Augen billigere Methode
ist die, des &quot;Offline&quot; lesens. Hier wird, wie auch bei einem Mail
Programm, die Post vom Server geladen und anschlie&szlig;end auf der Platte
gespeichert. Also die paar MB hat man ja wohl &uuml;brig, daf&uuml;r kann man
sich mehr Zeit f&uuml;rs intensive Lesen nehmen, ohne ewig auf die Uhr
sehen zu m&uuml;ssen, da man sich ja nicht finanziell ruinieren m&ouml;chte.
Beide Varianten funktionieren gut, aber wie gesagt, da&szlig; &quot;Offline&quot;
lesen ziehe ich dem &quot;Online&quot; lesen vor. Der Download der Mails
geht bei einem guten Anbieter auch gut und schnell von statten,
wer aber so schon manchmal Probleme mit einer korrekten Verbindung
zu seinem Provider hat, wird hier ebenfalls etwas Geduld aufbringen
m&uuml;ssen. Bei T-Online geht es rat`s bat`s, also wirklich gut. Hat
man die Mails erstmal runtergeladen, geht der gleiche Proze&szlig; von
statten, wie bei einem normalen Mailprogramm - Mail lesen, verstehen oder nicht, Mail beantworten... oder nicht!
<p>
Fazit:<br> FFNews ist guter Newsreader, ich habe im Aminet auch kein
       vergleichbares Programm gefunden, weshalb FFNews mein
       Favorit ist. Also wer immer sch&ouml;n diskutieren m&ouml;chte oder
       das neuste aus dem Web erfahren will, sollte sich FFNews
       zulegen und f&uuml;r den Preis 59,- DM kann man schon einiges
       erwarten.<i><b>- Empfehlenswert - </b></i>

<p align="right"><em>-mn- </em></p>

Quelle:<br>
RBM Computertechnik<br>
Bernd Rudolf<br>
Kleinenberger Weg 2a<br>
33100 Paderborn<br>
Tel:        05251/16191-9<br>
Fax:        05251/640655<br>
Support:    <a href="mailto:support@rbm.de">support@rbm.de</a><br>
Bestellung: <a href="mailto:order@rbm.de">order@rbm.de</a><br>
WWW:        <a href="http://www.rbm.de">http://www.rbm.de</a><br>
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="softw03.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="softw05.htm">
</MAP>
</center><hr>


</body>
</html>
