<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Software</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>




<center><h1>adm - adress master</h1></center>


Das Problem mit dem richtigen Verwalten von Adressen kennt ja jeder.
Nat&uuml;rlich kann man das ja ganz einfach l&ouml;sen, man nimmt sich ein Adressbuch 
und schreibt sich alles auf, aber warum so kompliziert? Man kann doch
auch Computerprogramme nutzen, die alles schon vorgetragen haben und man
nur noch die daten einsetzen mu&szlig;. Jan Gei&szlig;ler hat sich hier etwas einfallen
lassen, und zwar hat er eine Programm namens &quot;ADM - Adress Master&quot; geschrieben. 
Mit diesem kann man ganz einfach Daten und Adressen richtig verwalten, 
seht Euch hierzu folgendes Bild an, um einen besseren Eindruck zu
erhalten... <br><img src="../pic/adm_1.gif"  width=640 height=480>
<p>
Der Aufbau ist sehr gut, man kann in diverse Themen unterscheiden (z.B.
Computer oder Privat) und je nach Wunsch den Eintrag &auml;ndern oder erweitern,
auch hierzu gibt es ein Bild, also nach den gt&auml;tigten Eingaben und einem
Doppelklick auf den jeweiligen Namen im Hauptmen&uuml;, bekommt man folgendes
Fenster zu sehen... <br><img src="../pic/adm_2.gif"  width=640 height=480>
<p>
ADM vef&uuml;gt &uuml;ber sehr viele Funktionen und man kann die Adressen wirklich
gut verwalten, so kann man wie oben erw&auml;hnt auch die Themenbereiche angeben, 
zum Beispiel bestimmte Adressen in &quot;Gesch&auml;ftliches&quot; oder &quot;Privates&quot;
eintragen oder neue Themenbereiche vorgeben. Auch einstellen kann man so
einiges, wie auch eine Modem anw&auml;hlen. ADM bietet worklich sehr viel
M&ouml;glichkeiten f&uuml;r den Nutzer. Und wieder habe ich ein Bild f&uuml;r Euch vorbereitet, 
seht selbst... <br><img src="../pic/adm_3.gif"  width=640 height=480>

<p>
ADM ist Shareware und kostet 25,- DM. Ein Demo gibt es im Aminet. F&uuml;r 
diesen Preis bekommt man ein gutes und ausgefreiftes Programm, mit dem
das Verwalten jeglicher Adressen (eMail, Post, Telefon...) ein Kinderspiel wird. 
Dem Programm liegen au&szlig;erdem noch ein paar Tools bei.
Da ist &quot;Datenumwandlung&quot;, dies erlaubt, die ADM Files in andere Formate
zu konvertieren und sie so anderen Datenbanken oder Adress Programmen
zug&auml;nglich zu machen. Bisher unterst&uuml;tzt er DFA (Version 1.0, 1.1, 1.5
und 2.x), sowie MasterAdress oder Adresser. TerminTool ist dazu da, da&szlig;
Leute die &ouml;fter mal ein wichtiges Datum vergessen, vom Computer daran
erinnert werden.
<p>
Fazit:<br> ADM ist ein wunderbares Programm, da&szlig; leicht zu bedienen ist und
       schnell zum gew&uuml;nschten Ziel bringt - dem richtigen Verwalten von
       Adressen. F&uuml;r den Preis von gerade mal 25,- DM ist es au&szlig;erdem noch
       sehr g&uuml;nstig - wer solch ein Programm sucht, sollte zu schlagen.
       <i><b>- Empfehlenswert - </i></b> 

<p align="right"><em>-mn- </em></p>

Quelle:<br>
Jan Gei&szlig;ler<br>
Hermann-Rombach-Str. 17<br>
D-74321 Bietigheim-Bissingen<br>
Tel: 07142/44740<br>
eMail: <a href="mailto:jan@digit.franken.de">jan@digit.franken.de</a><br>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="softw06.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="softw01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="softw08.htm">
</MAP>
</center><hr>


</body>
</html>
