<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Fun &amp; Talk</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



<center><h1>Kopfschmerzen - was ist das eigentlich?</h1></center>

   Migr&auml;ne - Kopfschmerzen
<p>   
   Migr&auml;ne ist rein technisch gesehen eine Verkrampfung der Arterien im Gehirn, so da&szlig;
   durch diese Verengung weniger Sauerstoff durchflie&szlig;en kann. Genau genommen also ein
   Sauerstoffmangelschmerz. Und genau hier setzt eine der besten ganzheitlichen Therapien
   an, die<a href="sauerstoff.html"> Sauerstoff-Mehrschritt-Therapie </a>nach Professor Manfred von Ardenne.
   Durch eine langfristige Hebung des Sauerstoffspiegels im Blut flie&szlig;t nun auch
   durch die verengten Arterien des Gehirns mehr Sauerstoff.
   Diese vermehrte Zufuhr ist im allgemeinen ausreichend, den Sauerstoffmangelschmerz zu
   beheben. Gleiches gilt auch f&uuml;r Tinnituspatienten (Ohrger&auml;usche).
<p>   
   Nach Auffassung der Akupunkturlehre ist die Migr&auml;ne vorwiegend durch folgende
   Organsystemst&ouml;rungen bedingt:
<ul>   
    <li> Leber-Gallensystem: Migr&auml;neschmerz vorwiegend rechts,
      bei Milzbeteiligung links
   
    <li> Urogenitalsystem (vor allem Regelbedingter Kopfschmerz,
      Menstruationsst&ouml;rungen): einseitiger bzw. doppelseitiger
      Stirnschl&auml;fenkopfschmerz bei Adnexbeteiligung, Hinterkopfschmerz
      bei Uterusbeteiligung
   
    <li> Magen: Stirnkopfschmerz
   
    <li> Niere: Kopfdeckenschmerz
</ul><p>   
   Allgemein kann festgestellt werden, da&szlig; es sich als hilfreich erwiesen hat, das
   &quot;schuldige&quot; Organ bzw. Organsystem zu st&auml;rken. Allerdings kommt in einigen F&auml;llen auch
   lediglich eine St&ouml;rung im Bereich der Halswirbels&auml;ule als m&ouml;gliche Ursache in Frage.
<p>   
   Fehlt es an wichtigen Mineralien wie zum Beispiel Magnesium und Zink, oder liegt
   eine Belastung mit Schwermetallen vor, ist h&auml;ufig die Migr&auml;ne erst durch einen
   Ausgleich des Mineralhaushaltes zu beseitigen. Voraussetztung hierf&uuml;r ist eine
   vorherige<a href="mineral.html"> Haar-Mineral-Analyse </a>, die einen sehr guten &Uuml;berblick &uuml;ber den
   gesamten Mineral-und Schwermetallhaushalt gibt.
<p>   
   Wer mehr &uuml;ber komplement&auml;re Methoden der Diagnostik und Therapie wissen
   m&ouml;chten, sollte sich doch einmal dieses<a href="beispiel.html"> Beispiel </a>ansehen.




<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="talk02.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="sauerstoff.html">
</MAP>
</center><hr>
</body>
</html>
