<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Fun &amp; Talk</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>




<center><h1>Vorsicht Bill, wird scharf geschossen!</h1></center>

Bei einer Computermesse letztens (auf der ComDex) verglich Bill Gates
die Computerindustrie mit der Autoindustrie und machte folgendes
Statement:
<p>
&quot;Wenn General Motors (GM) mit der Technologie so mitgehalten h&auml;tte, wie
die Computerindustrie, dann w&uuml;rden wir heute alle 25-Dollar-Autos
fahren, die mit einer Gallone Sprit 1000 Meilen fahren w&uuml;rden.&quot;
<p>
Als Antwort darauf ver&ouml;ffentlichte General Motors (von Mr. Welch selbst)
eine Presseerkl&auml;rung mit folgendem Inhalt:
<p>
Wenn General Motors eine Technologie wie Microsoft entwickelt h&auml;tte,
dann w&uuml;rden wir heute alle Autos mit folgenden Eigenschaften fahren:
<p>
1. Ihr Auto w&uuml;rde ohne erkennbaren Grund zweimal am Tag einen Unfall
haben.
<p>
2. Jedesmal, wenn die Linien auf der Stra&szlig;e neu gezeichnet werden
w&uuml;rden, m&uuml;&szlig;te man ein neues Auto kaufen.
<p>
3. Gelegentlich w&uuml;rde ein Auto ohne erkennbaren Grund auf der Autobahn
einfach ausgehen, und man w&uuml;rde das einfach akzeptieren, neu starten und
weiterfahren.
<p>
4. Wenn man bestimmte Man&ouml;ver durchf&uuml;hrte, wie z. B. eine Linkskurve,
w&uuml;rde das Auto einfach ausgehen und sich weigern, neu zu starten. Man
m&uuml;&szlig;te dann den Motor erneut installieren.
<p>
5. Man k&ouml;nnte nur allein im Auto sitzen, es sei denn, man kauft &quot;Car95&quot;
oder &quot;CarNT&quot;; aber dann m&uuml;&szlig;te man jeden Sitz einzeln bezahlen.
<p>
6. Macintosh w&uuml;rde Autos herstellen, die mit Sonnenenergie fahren,
zuverl&auml;ssig laufen, f&uuml;nfmal so schnell und zweimal so leicht zu fahren
sind, aber sie w&uuml;rden nur auf 5% der Stra&szlig;en laufen.
<p>
7. Die &Ouml;l-Kontrollleuchte und die Warnlampen f&uuml;r Temperatur und Batterie
w&uuml;rden durch eine &quot;Genereller Auto-Fehler&quot;-Warnlampe ersetzt.
<p>
8. Neue Sitze w&uuml;rden erfordern, da&szlig; alle die selbe Ges&auml;&szlig;gr&ouml;&szlig;e haben.
<p>
9. Das Airbag-System w&uuml;rde fragen &quot;Sind sie sicher?&quot;, bevor es ausl&ouml;st.
<p>
10. Gelegentlich w&uuml;rde das Auto Sie ohne jeden erkennbaren Grund
aussperren. Sie k&ouml;nnten nur wieder mit einem Trick aufschlie&szlig;en, und
zwar m&uuml;&szlig;te man gleichzeitig den T&uuml;rgriff ziehen, den Schl&uuml;ssel drehen
und mit einer Hand an die Radioantenne fassen.
<p>
11. General Motors w&uuml;rde Sie zwingen, mit jedem Auto einen
Deluxe-Kartensatz der Firma Rand McNally (seit neuestem eine GM-Tochter)
mit zu kaufen, auch wenn Sie diesen Kartensatz nicht brauchen oder
m&ouml;chten. Wenn Sie diese Option nicht wahrnehmen, w&uuml;rde das Auto sofort
50% langsamer werden (oder schlimmer). Dar&uuml;berhinaus w&uuml;rde GM deswegen
ein Ziel von Untersuchungen der Justiz.
<p>
12. Immer dann, wenn ein neues Auto von GM vorgestellt w&uuml;rde, m&uuml;&szlig;ten
alle Autofahrer das Autofahren neu erlenen, weil keiner der Bedienhebel
genau so funktionieren w&uuml;rde, wie in den alten Autos.
<p>
13. Man m&uuml;&szlig;te den &quot;Start&quot;-Knopf dr&uuml;cken, um den Motor auszuschalten.
<p>
Leider ist der Autor dieser genialen Glosse unbekannt. Wenn irgendjemand wei&szlig;,
woher das stammt, denn bitte ich um eine kurze Meldung - danke!<br>
&copy; 1998 HAAGE &amp; PARTNER Computer - <a href="http://haage-partner.com">http://haage-partner.com</a>

<p align="right"><em>-sbh- </em></p>

<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="talk03.htm">
</MAP>
</center><hr>

</body>
</html>
