<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="GENERATOR" content="CygnusEd 4.2">
<title>AMIGA TIMES 04/98 - Fun &amp; Talk</title>
<body background="../pic/bg.gif" bgcolor="#C0C0C0" link="#0000FF" vlink="#800080" alink="#FF0000" bgproperties="fixed">
</head>



<center><h1>Knackpunk Computer`98</h1></center>


Wer sich unseren Aktuell-Teil mal angeschaut hat und eventuell sich auch
mal die Liste der Anwesenden Firmen auf der Computer`98, der wird feststellen, 
da&szlig; dieses Jahr etwas weniger AMIGA Beteiligung vorhanden ist,
als im letzten Jahr. F&uuml;r viele ist dieser Abbruch auch zu erkl&auml;ren, weil
der ICP Verlag sich diesmal fernh&auml;lt. Auch haben wichtige Firmen wie
&quot;Haage &amp; Partner&quot; oder &quot;phase5&quot; lange auf sich warten lassen. Die Lage ist
eben in den letzten Tagen ernster den je geworden und wir m&uuml;ssen zeigen
was wir k&ouml;nnen. Denn wenn wir noch lange warten, k&ouml;nnte es passieren das
es zu sp&auml;t ist und unser Zug abgefahren ist (nur Sinnbildlich gesprochen!)
<p>
Wir sollen wir uns aber als User vehalten? Die wichtige neue Technik fehlt
leider ganz, &uuml;ber Werbung brauchen wir erst gar kein Wort verlieren. Sicherlich 
werden alle Anwesenden bei der Computer`98 auch die Amiga Hymne vernehmen 
(das solle wir jedenfalls annehmen, denn wo sonst h&ouml;ren es auch andere
Leute, au&szlig;er den Amiganern????), aber im Grunde ist das nur Nebensache. Da 
selbst Gateway2000 im ihrem vielen Geld noch immer nicht zu einem neuen
AMIGA verhelfen konnten, beginne auch ich langsam ein wenig zu zweifeln. Zwar
steht f&uuml;r mich ein Wechsel au&szlig;er Frage, aber gerade wenn man ans Aufr&uuml;sten
denkt, kommen einem doch berechtigte Zweifel, wer wei&szlig; schon ob es sich noch
lohnt, da ja auch in diesem Jahr noch niemand wei&szlig;, welcher CPU das Rennen
machen wird oder wie das Innenleben der neuen AMIGA Generation - wenn es eine
geben sollte - &uuml;berhaupt aussieht. K&ouml;nnte somit die Computer`98 zum Knackpunkt
werden? Vielleicht erfahren wir dort endlich etwas von der Wahrheit, oder
werden wir von der Realit&auml;t vor den Kopf gesto&szlig;en, wie es schon in den letzten
Monaten so war?????
<p>
Vir ein paar Wochen hatte ich Besuch von einem PC User, der fr&uuml;her aber auch
mal einen AMIGA hatte. Da er &uuml;berhaupt keinen Kontakt mehr zu Amiganern (au&szlig;er
mir) hat, war er schon erstaun was der AMIGA noch alles drauf hat, aber in einem
waren wir uns beide einig. Die derzeitigen Preise, welche sich aus dem geringen
Absatz der Produzenten ergeben, locken nicht gerade vom PC zum AMIGA zu wechslen.
Der Markt ist eben noch zu klein, er war der Meinung, da&szlig; der AMIGA der ideale
Computer f&uuml;r Anf&auml;nger w&auml;re, d.h. wenn man als Computerneuling in diese &quot;Welt&quot;
einsteigen will, so sollte man mit einem AMIGA beginnen, da man dort besser in
dem System zurecht kommt, selbstt&auml;ndig viele Sachen erledigen mu&szlig; und nicht wie
beim PC sich vor einen vorinstallierten Computer setzt und loslegt und bei der
geringsten Ver&auml;nderung (z.B.:Absturz mit anschlie&szlig;ender Bootunf&auml;higkeit des 
Rechners) sofort einen Spezialisten holen mu&szlig;, da man selber &uuml;berhaupt keine
Ahnung hat... und im Endeffekt ist nur was in eine exe-Datei geschrieben worden,
was nicht reingeh&ouml;rt - solche Probleme d&uuml;rften f&uuml;r AMIGA User ruck zuck erledigt
sein. War jetzt ein schwere und lange Umschreibung, aber ich denke Ihr wi&szlig;t wie
ich bzw. mein Kumpel das gemeint hat. Zwar bin ich auch nicht daf&uuml;r, da&szlig; man den
AMIGA als Spielecomputer oder Anfangscomputer bezeichnet, aber stimmen tut es
einwenig und wenn man mehr machen m&ouml;chte, kann man ja getrost aufr&uuml;sten. Das
m&uuml;&szlig;te vielen Leuten klar sein, da w&uuml;rde sicher viele erstmal mit dem AMIGA anfangen 
bevor es in die komplizierte PC Welt geht und wer unzufrieden ist, kann
immer noch wechseln.
<p>
Wenn uns aber auf der Computer`98 indirekt klargemacht wird, da&szlig; wir eben doch
nur einen Spielcomputer ohne Fan`s oder Freaks haben und es sich eh nur noch um
Wochen handelt, bis wir vom Markt sind, dann ist es vorbei... also la&szlig;t Euch
nichts einreden, egal von wem... Skeptiker und Kritiker sind oft die Leute die
zuerst ihre Meinung zur&uuml;ckziehen, wenn sich der Wind dreht.

<p align="right"><em>-mn- </em></p>
<p><center>
<IMG SRC="../pic/next.gif"  border="0" width="271" height="41"USEMAP="#next">
<MAP NAME="next">
<AREA SHAPE="rect" ALT="back" COORDS="0,0,41,41" HREF="talk03.htm">
<AREA SHAPE="rect" ALT="inhalt" COORDS="116,0,153,41" HREF="talk01.htm">
<AREA SHAPE="rect" ALT="next" COORDS="230,0,270,41" HREF="talk05.htm">
</MAP>
</center><hr>

</body>
</html>
