<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Editorial der NoCover</TITLE>
  </HEAD>

  <BODY background="int_bg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD width="70">&nbsp;</TD>

        <TD>
          <BR>

          <CENTER>
            <IMG src="edito.gif" width="275" height="85" alt="Titelbild"><BR>

            <H1><B>zur NoCover #110 (01.05.2003)</B></H1>
          </CENTER>

          <P>Liebe Leser(Innen) !</P>

          <P><img src="sanduhr.jpg" alt="Sanduhr" align=left hspace=6> Schaut euch
          mal diese Uhr genau an. Wenn der Sand durch ist, ist auch meine Motivation
          zu Ende. Und wie ganz unschwer zu erkennen ist, ist schon &uuml;ber die H&auml;lfte
          des Sandes im unteren Beh&auml;lter. Wenn ihr spa&szlig;eshalber die Liste der Autoren
          anschaut, dann wird wohl nun jeder wissen, was ich eigentlich schreiben
          sollte. Aber ihr m&uuml;sst wissen, was ihr tut, es ist schlie&szlig;lich auch eure
          NoCover und nicht nur meine. </p>

          <P>Heute nacht kamen doch sage und schreibe noch <b>f&uuml;nf</b> Beitr&auml;ge und
          mein erster Absatz sollte nun wieder gel&ouml;scht werden, ich tue es aber nicht,
          auch wenn sich meine Stirnfalten wieder etwas gegl&auml;ttet haben. In diesem
          Zusammenhang muss ich aber ganz klipp und klar sagen, dass ihr mir keine
          Zeit gebt, eure selbstlayouteten Werke auf Funktionalit&auml;t zu &uuml;berpr&uuml;fen
          und auch nachzuschauen, ob bei Linkangaben hundertprozentig auf Klein-/
          Gro&szlig;schreibung geachtet und diese auch eingehalten wurden. Ihr m&uuml;sst
          wissen, dass die Adresse <b>www.nc-mag.de </b> auf einem LINUX-Server liegt
          und dieser verzeiht keinen Fehler, auch wenn er noch so klein ist, besonders bei
          der Klein-/ Gro&szlig;schreibung kennt er kein Pardon. Amigaverw&ouml;hnte
          User m&uuml;ssen hier besonders aufpassen. Ich habe es mir zur Gewohnheit
          werden lassen alle Links generell in Kleinbuchstaben zu schreiben und auch
          darauf zu achten, dass nur die erlaubten Sonderzeichen und vor Allem keine
          Blanks zur Anwendung kommen. </p>

          <P>Jetzt noch ein paar S&auml;tze zum Remake der NC-3. Wie schon bei den beiden
          Vorg&auml;ngern (NC-1 und NC-2) geschieht die Seiten- und Artikelsteuerung nur
          &uuml;ber die Schaltfl&auml;chen. INHALT verzweigt immer zum Gesamtinhaltsverzeichnis
          und von hier aus geht es mit einem Klick am unteren Bildschirmrand
          innerhalb des Inhaltbildes, aber unterhalb der sichtbaren Schaltfl&auml;chen
          zur&uuml;ck zur aktuellen NoCover. Neu gegen&uuml;ber der beiden ersten Remakes gibt
          es auch hier eine Schaltfl&auml;che: INHALT und diese hat die gleiche Aufgabe,
          wie die unsichtbare Schaltfl&auml;che. <br clear=all></p>

          <P>Eine erfreuliche Mitteilung: Die Homepage <b>"www.nc-mag.de"</b> ist
          seit dem 25sten ins neue Kleid gesetzt worden. Zwar noch nicht fehlerfrei,
          dies wird aber sukzessive berichtigt. In diesem Zusammenhang: Ich freue
          mich &uuml;ber jede Zuschrift, die mir Mut macht, Verbesserungsvorschl&auml;ge
          beinhaltet, auch wenn ich damit nicht einverstanden sein sollte oder auch
          Angebote zur aktiven Mithilfe. Ich habe aber auch schon zwei Mails mit dem
          Tenor bekommen, "das war aber man nicht viel, das h&auml;tte ich viel besser
          gemacht". Hat er aber nicht und vorher Hilfe angeboten auch nicht, noch
          nicht einmal in einem Nebensatz. Diese beiden Mails sind im Trashcan
          gelandet und ich verschwende keine weiteren Gedanken daran. </P>

          <P>Nun etwas in eigener Sache:<br>

          Am 29.04. erhielt ich eine geharnischte Ma&szlig;regelung von der Verbraucher
          Zentrale NRW und das mit vollem Recht. In der NC-108 brachte ich den
          Artikel: Gewicht im Griff mit Abbildung der offiziellen Brosch&uuml;re. Ich
          hatte zwei Vorworte geschrieben und zwei verschiedene Artikel. Auch hatte
          ich um eine Freigabeerlaubnis in D&uuml;sseldorf schriftlich ersucht. Den
          Artikel, den ich in der NC ver&ouml;ffentlichte, war der fast w&ouml;rtliche Auszug
          der entsprechenden Passagen aus der abgebildeten Brosch&uuml;re. Das
          dazugeh&ouml;rige Vorwort mit dem Verweis auf die Textquellen verga&szlig; ich aber
          einzuf&uuml;gen. Auch hatte ich leider nicht mehr bedacht, dass keine Antwort
          von der Verbraucherzentrale gekommen war. Ich hatte dies vollkommen
          &uuml;bersehen. An dieser Stelle m&ouml;chte ich feststellen, dass der Text besagten
          Artikels gr&ouml;&szlig;tenteils urheberrechtlich bei der Verbraucherzentrale
          Nordrhein-Westfalens (Autorin Frau Velte) liegt und ich entschuldige mich
          auch euch gegen&uuml;ber, dass mir dieser Fauxpas unterlaufen ist. In diesem
          Zusammenhang m&ouml;chte ich darauf hinweisen, dass die Brosch&uuml;re "Gewicht im
          Griff" von der Verbraucherzentrale NRW herausgegeben wurde und in jeder
          Verbraucher Beratungsstelle f&uuml;r 7,16 Euro erworben werden kann. </p>

          <P>Nun viel Spa&szlig; mit der neuen  und der alten NoCover<BR>
          Wolf.<BR>
          <FONT color="#0000ff">wolf@wozim.de</FONT></P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>
