<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Interview Nr 2</TITLE>
  </HEAD>

  <BODY background="nc_bg2.jpg" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="">
      <TR>
        <TD>
          <CENTER>
            <P><FONT color="#000080" size="7"><B>Amiga Arena
            Interview</B></FONT></P>

            <TABLE width="60%" cellpadding="0" cellspacing="0"
            summary="">
              <TR>
                <TD valign="top">Entwickler:</TD>

                <TD><B>Steffen Schiller</B> </TD>
              </TR>

              <TR>
                <TD valign="top">Software:</TD>

                <TD>Fahrschule99</TD>
              </TR>

              <TR>
                <TD valign="top">Homepage:</TD>

                <TD>amiga-oberlausitz.bei.t-online.de</TD>
              </TR>

              <TR>
                <TD valign="top">Email:</TD>

                <TD>steffenschiller@web.de</TD>
              </TR>
            </TABLE>
          </CENTER>

          <P><FONT color="#006000"><B>Hallo Steffen, kannst Du
          bitte etwas &uuml;ber Dich und Deinem Amiga Werdegang
          erz&auml;hlen?</B></FONT><BR>
           Soviel gibt es &uuml;ber mich nicht zu erz&auml;hlen,ich
          bin seit 1992 Amiga-User. Mein erster Amiga war ein 600er
          mit 40 MB Festplatte, dem ich dann eine Turbokarte,
          CD-ROM usw. spendierte. Im Laufe der Zeit kamen dann noch
          ein A 1200, ein A 500 und ein paar Dosen hinzu.</P>

          <P><FONT color="#006000"><B>Du hast vor kurzem Dein
          Programm "Fahrschule99" zum freien download
          ver&ouml;ffentlicht,f&uuml;r diejenigen die das Programm
          nicht kennen, um was handelt es sich bei
          "Fahrschule99"?</B></FONT><BR>
           Mit Fahrschule99 kann man theoretische
          F&uuml;hrerscheinpr&uuml;fungen der Klassen B und A
          simulieren. Da die Auswertung der angekreuzten Fragen
          sofort beim Weiterklicken zur n&auml;chsten Frage
          erfolgt, kann man gleich sehen, was man eventuell falsch
          gemacht hat. Am Ende werden die Fehlerpunkte der Fragen
          addiert und das Pr&uuml;fergebnis bekanntgegeben. Es sind
          10 Einzelpr&uuml;fungen mit insgesamt knapp 400 Fragen
          und etwa 70 farbigen Bildern.</P>

          <P><FONT color="#006000"><B>Unterscheiden sich die Fragen
          von "Fahrschule99" zu den heutigen offiziellen
          Frageb&ouml;gen oder kann man sich diese dadurch sparen,
          bez. w&uuml;rde man die theoretische Pr&uuml;fung alleine
          durch "Fahrschule99" schaffen?</B></FONT><BR>
           Die Fragen unterscheiden sich unerheblich, sie sind
          nicht 100%ig identisch vom Wortlaut, vom Inhalt treffen
          sie aber genau den Kern der Sache und sind auf dem
          neuesten Stand. Die theoretische Pr&uuml;fung alleine
          durch "Fahrschule99" schaffen? Eine ordentliche
          Ausbildung vorausgesetzt, sollte man sich auch die
          amtlichen Pr&uuml;fungsb&ouml;gen wenigstens einmal
          ansehen, schon um ein Gef&uuml;hl f&uuml;r den richtigen
          Pr&uuml;fungsbogen zu bekommen. Das Programm war und ist
          eher als Erg&auml;nzung gedacht.</P>

          <P><FONT color="#006000"><B>Wann und wie kamst Du auf die
          Idee "Fahrschule99" zu entwickeln?</B></FONT><BR>
           Ich hatte mir die Entwicklungsumgebung "BlitzBasic" in
          deutsch gekauft und wollte mal anfangen, etwas zu
          programmieren. Es gab auf dem Amiga ja schon
          &auml;hnliche Sachen, nur waren die sp&auml;testens dann
          nicht mehr aktuell, als 99 die neuen Regeln zum
          EU-F&uuml;hrerschein eingef&uuml;hrt wurden. Da ich an
          der Quelle sitze, was das Fachliche angeht, konnte ich
          das erste Programm schon relativ zeitig, also im Winter
          98/99 erstellen. Es ging nat&uuml;rlich nicht ohne meine
          Frau, die fast alle Texte geschrieben hat.</P>

          <P><FONT color="#006000"><B>Da Du ja selber eine
          Fahrschule hast,liegt es nahe das Du Dein Programm auch
          dort einsetzt bez. dient der Amiga dort zu
          Pr&auml;sentationszwecken?</B></FONT><BR>
           Ja, das hatte ich gemacht und die Erfahrungen sind
          nat&uuml;rlich in die Entwicklung des Programm's
          eingeflossen. Jedem hat das Programm auf Anhieb gefallen.
          Es gibt ja auch die sogenannten "Computerhasser", selbst
          die waren vom Amiga nicht wegzubekommen.</P>

          <P><FONT color="#006000"><B>W&auml;re "Fahrschule99"
          nicht geradedazu geeignet den Amiga mit preiswerter
          Hardware an weitere Fahrschulen zu vermitteln oder gibt
          es auf dem PC Leistungsst&auml;rkere
          Software?</B></FONT><BR>
           Sicher kann der eine oder andere sich einen gebrauchten
          Amiga hinstellen und meinetwegen in seiner Fahrschule
          auch "Fahrschule99" nutzen. Ich m&ouml;chte allerdings
          keine Garantie daf&uuml;r &uuml;bernehmen, dass ich
          dieses Programm auch auf dem neuesten Stand halten kann.
          Ob die PC-Software leistungsst&auml;rker ist?<BR>
           Ich habe schon einige Progamme gesehen,die mir mehr oder
          weniger gut gefallen haben. Oft sind die Programme etwas
          un&uuml;bersichtlich, aber PC's sind fast &uuml;berall
          verf&uuml;gbar, auch in einer Fahrschule.</P>

          <P><FONT color="#006000"><B>"Fahrschule99" ist Fachlich
          auf dem neuesten Stand, w&auml;re es nicht an der Zeit
          auch das Programm selbst aufzupepen,da "Fahrschule99"
          sich im Grunde mit einem A500 Kick 1.4 und Pal zufrieden
          gibt,eine Systemvorraussetzung die wohl heute kaum noch
          jemand ernsthaft anwenden d&uuml;rfte?</B></FONT><BR>
           Das glaube ich auch, aber ich will nicht auf das
          Fundament einer Gartenlaube ein Hochhaus stellen.</P>

          <P><FONT color="#006000"><B>"Fahrschule99" wurde anfangs
          Kommerziell von Dir vertrieben, wie kam es jetzt zur
          Freigabe,bez. kann man es auf Deiner Hompage (Fahrschule
          "Schiller") immer noch kaufen zu 19,95DM
          ;-)?</B></FONT><BR>
           Wie man an dem Preis 19,95DM schon sieht, ist diese
          Seite wohl an den letzten Aktualisierungen vorbei
          gegangen. Demn&auml;chst wird sie von der HP
          verschwinden. Das Projekt liegt schon lange auf Eis und
          ich schlie&szlig;e mit der Freigabe das alte Kapitel
          ab.</P>

          <P><FONT color="#006000"><B>Wie sieht die Zukunft von
          "Fahrschule99" aus, ich denke gerade solch eine Software
          zeigt das der Amiga heute noch in manchen Sparten "up to
          date" ist und somit in Zukunft auch Interessant sein
          d&uuml;rfte f&uuml;r Amiga Neukunden. Programme wie
          "Fahrschule99","AmiATLAS" oder "Digital Almanc" sind
          meiner Meinung nach sehr wichtig um dem "Normal Anwender"
          auch zu zeigen das der Amiga Alltagstaugllich ist in
          solchen Anwendungen oder?</B></FONT><BR>
           Ich danke dir, dass du auch mein Programm f&uuml;r
          strategisch wichtig h&auml;ltst ;-)! Ein Amiga war und
          ist etwas besonderes, wir wissen alle, dass er seiner
          Zeit weit voraus war. Nur d&uuml;rfen wir nicht
          vergessen, dass die anderen Systeme in der Entwicklung
          nicht stehengeblieben sind und nicht stehenbleiben. Wenn
          sich dieses Jahr nichts wesentliches am Amigamarkt
          bewegt, ich schlie&szlig;e da die kompatiblen nicht aus,
          werden wir wohl nichts als eine sch&ouml;ne Erinnerung
          haben! Und das erste Viertel vom Jahr ist schon wieder
          weg! Die Hoffnung habe ich aber noch nicht verloren.</P>

          <P><FONT color="#006000"><B>Wirst Du weiterhin
          "Fahrschule99" betreuen bez. mit aktuellen Daten
          versorgen?</B></FONT><BR>
           Ich werde dieses Programm, wie es jetzt besteht, nicht
          mehr weiterentwickeln. Schon die Bilder w&uuml;rden sich
          f&uuml;r h&ouml;here Aufl&ouml;sungen nicht eignen, die
          sind speziell f&uuml;r 640x256 in 16 Farben gemacht. Eben
          f&uuml;r schnelles Arbeiten mit einem Standard-Amiga auch
          nur mit Diskettenlaufwerk ohne HD. Das fertig compilierte
          Programm wird also nicht mehr ver&auml;ndert. Das ist ja
          schon seit langer Zeit unver&auml;ndert. Die externen
          Textdateien kann ich nach belieben ab&auml;ndern, das
          hatte ich ja erst gemacht. Wenn etwas kommt, dann ist es
          etwas v&ouml;llig neues, nur im Ank&uuml;ndigen allein
          bin ich nicht so gut! Ich habe noch nicht angefangen,
          etwas neues zu machen.</P>

          <P><FONT color="#006000"><B>Sind Dir schon download
          Zahlen bekannt,nach der Freigabe, wenn ja bist Du
          zufrieden mit dem Feedback bez. in welchem
          verh&auml;ltniss steht es zu den
          Verkaufszahlen?</B></FONT><BR>
           Ich bin sehr angenehm &uuml;berrascht vom Feedback, es
          waren am Wochenende der Ver&ouml;ffentlichung &uuml;ber
          300 Besucher auf der Seite, ich kann aber nicht sagen, ob
          sich jeder das Programm gezogen hat. Die Verkaufszahlen
          lagen weit darunter, obwohl ich da auch angenehm
          &uuml;berrascht war, danke an dieser Stelle nochmal an
          alle, die mich mit dem Kauf unterst&uuml;tzt haben und
          besonderen Dank an Alfred Kn&ouml;tig, der das Programm
          f&uuml;r mich vertrieben hat.</P>

          <P><FONT color="#006000"><B>Was w&uuml;nscht Du Dir
          f&uuml;r die Zukunft des AmigaOS bzw. des
          Amiga-Sektors/-Markts?</B></FONT><BR>
           Oh ja, endlich kann ich mir etwas w&uuml;nschen!<BR>
           Auf alle F&auml;lle w&uuml;nsche ich mir, dass es
          irgendwie weiter geht. Au&szlig;erdem w&uuml;nsche ich
          mir, dass AmigaOS auf m&ouml;glichst vielen Plattformen
          l&auml;uft. Es soll so schnell sein, dass es einem
          schwindelig wird und au&szlig;erdem dabei gut aussehen.
          Die letzten Screenshots vom MorphOS waren f&uuml;r mich
          schon eine Augenweide, sowas sollte beim OS4 auch
          hinzukriegen sein! Wie gesagt, es sind W&uuml;nsche!</P>

          <P><FONT color="#006000"><B>Glaubst Du an ein Comeback
          vom Amiga?</B></FONT><BR>
           Ja, auf alle F&auml;lle vom Betriebssystem. F&uuml;r
          mich stirbt der gute alte Amiga mit der alten Hardware,
          das hei&szlig;t nicht automatisch, dass eine neue
          Hardware und ein neues Betriebssystem Abstriche vom
          Feeling bedeuteten. Im Gegenteil, von mir aus kann es auf
          s&auml;mtlicher Hardware laufen, egal. Aber es m&ouml;ge
          bald geschehen!</P>

          <P><FONT color="#006000"><B>Deine letzten Worte an die
          Leser?</B></FONT><BR>
           Lasst den Kopf nicht h&auml;ngen und unterst&uuml;tzt
          die Leute,die etwas f&uuml;r unsere Maschinen schaffen!
          Auch wenn in verschiedene Richtungen entwickelt wird. Es
          muss nicht immer geradeaus gehen, der gerade Weg ist
          nicht immer auch der beste,oft ist er steil und steinig!
          Ich danke allen, die mit ihrer Leistung den Geist des
          Amiga's am Leben erhalten und w&uuml;nsche uns allen das
          Beste f&uuml;r die Zukunft!</P>

          <P align="center">-- &copy; Amiga Arena 03/2003 --</P>

          <P align="center"><FONT color="#000080"><B>aMIGA aRENA -
          fOR tHOSE wHO lOVE tHE cOMMODORE aMIGA</B></FONT></P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

