<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="author" content=
    "Johannes Weidner und Michael M&ouml;ller">

    <TITLE>Stunde des Pan</TITLE>
  </HEAD>
  <BODY bgcolor="#000000" text="#ffff99">
  
    <TABLE border="0" cellspacing="0" cellpadding="10" width="100%" summary="">
      <TR>
        <TD>
          <H3 align="center">Hanno Erdwein</H3>

          <H1 align="center">Stunde des Pan</H1>

          <P align="justify">Hangabw&auml;rts durch's dichte
          Unterholz schl&uuml;pft lautlos eine Gestalt. Die Arme
          eng an den K&ouml;rper gepre&szlig;t, windet sie sich mal
          hierhin, mal dorthin, um den Dornen der Schlingpflanzen
          auszuweichen. Mit der rechten Hand umklammert sie den
          Griff einer Keule. Die Linke h&auml;lt den Bogen. Vom
          R&uuml;cken herab, jede Bewegung des schlanken,
          muskul&ouml;sen K&ouml;rpers mitschwingend, h&auml;ngt
          der K&ouml;cher mit den gefiederten Pfeilen. Die
          Steinspitzen sind scharf und mit Widerhaken versehen.
          Auch das Messer im G&uuml;rtel ist kunstvoll aus einem
          Stein herausgeschlagen. Es ist ein junger Mann, der hier
          den nachtdunklen Bergwald durchquert, um noch vor
          Tagesgrauen drunten im Grasland die Spur eines Bison
          aufnehmen zu k&ouml;nnen. Am Vorabend hatte er sich
          bereits von seiner Familie getrennt und sie in sicherer
          Obhut der H&ouml;hle zur&uuml;ckgelassen. Die
          gro&szlig;en Augen seiner hungrigen Kinder waren kaum
          noch zu ertragen. Ebenso qu&auml;lend war der Anblick des
          J&uuml;ngsten in den Armen seines Weibes, der an den
          milchleeren Br&uuml;sten saugte. Obwohl die Zeit der
          gro&szlig;en Wanderung f&uuml;r Bisonherden erst
          bevorstand, zog er die vage Hoffnung auf Beute dem
          tr&uuml;bseligen Abwarten in dumpfer H&ouml;hlenluft
          vor.</P>

          <P align="justify">Da, leises Pl&auml;tschern voraus. Er
          bleibt stehen und h&auml;lt den Atem an. Schwach nimmt er
          die Bewegung von Hufen wahr, die fern einer Wasserstelle
          zustreben. Noch dringt kein Streifen Licht durch die
          Bl&auml;tter. Kein Vogellaut meldet den nahen Tag.
          Dennoch wei&szlig; der J&auml;ger ebenso wie das Wild,
          da&szlig; dicht am Horizont bereits eine blasse Andeutung
          von Licht heraufsteigt und der Kampf ums &Uuml;berleben
          von neuem beginnt. Es ist Vorsicht geboten. Deshalb
          pr&uuml;ft er, bevor er weitergeht, die Richtung des
          Luftstroms. Zufrieden macht er sich wieder auf den Weg.
          Noch behutsamer und ger&auml;uschloser als bisher
          schl&auml;ngelt er sich von Baum zu Baum und durch
          Strauchwerk hindurch, setzt seine F&uuml;&szlig;e nur
          dorthin, wo kein knackender Zweig die Bewegung verraten
          k&ouml;nnte. Er wird zum Phantom, das ann&auml;hernd
          lautlos und um ein weniges dunkler als die Nacht
          dahinhuscht. So erreicht er den Waldrand. Fest an einen
          Stamm gepre&szlig;t sp&auml;ht er ins Freie. Vor ihm
          liegt sein Ziel, das wellige Grasland, die
          Weidegr&uuml;nde der Bisons. Von links ist das
          Gr&auml;usch des Wassers nun deutlicher wahrnehmbar, der
          schmale Flu&szlig;. Grau liegt die D&auml;mmerung auf dem
          Land von einem bla&szlig;roten Streifen tief am Horizont
          ges&auml;umt. Stark h&auml;ngt der Geruch nach Erde und
          Feuchtigkeit in der Luft. Das Herz des J&auml;gers
          verdoppelt seine Schl&auml;ge. Er duckt sich zu Boden und
          schleicht vorw&auml;rts, den Schutz der hohen Halme
          nutzend. Am Rand der Uferb&ouml;schung h&auml;lt er an
          und schaut hinab. Wie erwartet sieht er dort eine
          Bison-Familie, Kuh und zwei K&auml;lbchen mit den
          Vorderhufen im seichten Flu&szlig;bett stehen und
          trinken. Nicht weit davon der Bulle. Wache haltend geht
          er hin und her und zieht schnaubend die Luft durch die
          N&uuml;stern. Behutsam legt der J&auml;ger die Keule ins
          Gras und holt einen Pfeil aus dem K&ouml;cher. In Deckung
          des Grases l&auml;&szlig;t er sich auf ein Knie nieder.
          Halm um Halm schneidet er mit dem Messer einen
          Schu&szlig;kanal, der auf die trinkende Gruppe zielt.
          Dann bringt er den Pfeil an den Bogen und visiert das
          linke, &auml;ltere K&auml;lbchen an. Es wird eine
          herrliche Zeit bedeuten, mit dem Fleisch des Tieres
          heimzukommen. Er w&uuml;rde das Tier zerlegen und die
          Frau die St&uuml;cke &uuml;ber dem Feuer zubereiten. Alle
          w&uuml;rden satt werden, endlich einmal wieder satt
          f&uuml;r mehrere Tage! Aber was ist das?! Vom jenseitigen
          Uferrand l&ouml;st sich ein Schatten. Der Bulle
          br&uuml;llt auf. Die Kuh macht einen Satz
          r&uuml;ckw&auml;rts und treibt das j&uuml;ngere Kalb vor
          sich her. Alle drei preschen dicht an dem J&auml;ger
          vorbei ins Grasland. F&uuml;r das &auml;ltere Kalb ist es
          zu sp&auml;t. Die Raubkatze beugt sich &uuml;ber den
          aufgerissenen Hals des Tieres und saugt sein Blut.</P>

          <P align="justify">Viel hat der Feind nicht &uuml;brig
          gelassen. Der J&auml;ger steht entt&auml;uscht vor den
          Resten. Nun wird es wieder nichts mit vollen M&auml;gen
          und zufriedenen Gesichtern daheim. Sein Fu&szlig;
          w&auml;lzt die blutigen Knochen auseinander. Nein, nichts
          Brauchbares dabei! Traurig hockt er sich hin und blickt
          aufs Wasser. Bla&szlig; steigt der Tag herauf und nistet
          graublau in den Baumkronen. Der Flu&szlig; zeigt ein
          flackerndes, waberndes Abbild. Schaumkronen senden die
          Stromschnellen, Zweige und Laub der Windbruch. Die Hand
          des J&auml;gers tastet ziellos am Boden, sein Auge
          schweift hierhin und dorthin, sein Herz zieht tr&uuml;be
          mit der Flut. Jetzt greift die Hand einen Gegenstand und
          rollt ihn spielerisch zwischen den Fingern. Der Tag
          bekommt Farbe. Rot gl&uuml;ht es unter den B&auml;umen.
          Licht und Blau streben auf zum Zenith. Die Kelche der
          Bl&uuml;ten &ouml;ffnen sich und entfalten ihr
          tauglitzerndes Farbspiel. Vogelkehlen begr&uuml;&szlig;en
          schon lange den jungen Tag in vielen Tonarten. Das Ohr
          des J&auml;gers ist taub; denn aus allem klingt ihm das
          Klagen und Weinen seiner hungrigen Kinder entgegen. Die
          Nase ist unempfindlich f&uuml;r die unterschiedlichen
          D&uuml;fte, die der schwache Luftstrom von allen Seiten
          herantr&auml;gt. Sie wird den Modergeruch der H&ouml;hle
          nicht los, den Gestank wochenlanger Entbehrung. Die Hand
          hebt den glatten, k&uuml;hlen, l&auml;nglichen Gegenstand
          hoch und f&uuml;hrt ihn wie selbstverst&auml;ndlich zum
          Mund. Die Brust des J&auml;gers entspannt sich und sein
          Mund entl&auml;&szlig;t einen Seufzer. Der Atem geht
          durch die H&ouml;hlung des Rohrs und verwandelt sich zum
          klagenden Ton. Jetzt erst wird der J&auml;ger aufmerksam
          und betrachtet das, was er in seiner Hand h&auml;lt. Es
          ist ein hohler R&ouml;hrenknochen, hier und dort schon
          ein wenig schadhaft und l&ouml;chrig. Nun bl&auml;st er
          bewu&szlig;t in die &Ouml;ffnung. Die Klangerscheinung
          wiederholt sich. Tief und voll schwebt der Ton in der
          Morgenluft. Verwundert h&auml;lt sich der J&auml;ger den
          singenden Knochen vor's Auge und schaut hindurch. Er
          fragt sich, wo wohl die Stimme herkommen mag, die er
          durch seinen Atem aufgeweckt hat. Nichts
          Au&szlig;ergew&ouml;hnliches ist zu sehen. Innen ist der
          Knochen glatt und gl&auml;nzend. Erneut nimmt er das Rohr
          an die Lippen und legt zuf&auml;llig den Daumen auf eines
          der L&ouml;cher. Fast h&auml;tte er vor Staunen den
          Knochen fallen lassen. Ein ganz anderer, wesentlich
          hellerer Klang ist nun zu h&ouml;ren. Stirnrunzelnd dreht
          er das klingende Wunder hin und her. Dann beginnt er,
          einer Laune folgend, mit weiteren Fingern L&ouml;cher zu
          bedecken. Das Ergebnis ist verbl&uuml;ffend. Immer neue
          Arten, mal zart und hell wie eine Vogelstimme, mal
          r&ouml;hrend tief wie der Schrei des Rothirschs entlockt
          er dem Knochen.</P>

          <P align="justify">W&auml;rend die Sonne stetig steigend
          hinter dem Wald an H&ouml;he gewinnt und sich ihr Rotgold
          mehr und mehr in ein glei&szlig;endes Wei&szlig;gold
          wandelt, w&auml;hrend das Leben am Flu&szlig; und im
          schattigen Bergwald an Gesch&auml;ftigkeit zunimmt und
          der Wind in den Halmen des Graslandes sein Morgenlied
          singt, h&auml;lt der J&auml;ger ein l&ouml;chriges Rohr
          an den Mund und zaubert wohlklingende T&ouml;ne hervor.
          Vergessen sind Trauer und Entt&auml;uschung, vergessen
          das Kalb und die Raubkatze, vergessen auch - ein ganz
          klein wenig vielleicht - die dumpfe H&ouml;hle daheim
          voller Sorgen. Staunen erf&uuml;llt die Natur &uuml;ber
          den neuen Klang, der sich laut und immer vielseitiger
          breitmacht. Der Wind legt zu und bl&auml;st um die Wette
          mit. V&ouml;gel flattern herbei und muntern den Spieler
          durch Triller und Kadenzen zu immer gewagteren
          Spielweisen auf, bis sie merken, da&szlig; sie sich einen
          Meister heranbilden und mutlos davonfliegen. Igel und
          Eichhorn machen blanke Augen. Dergleichen ist neu
          f&uuml;r ihre Ohren. Und aus dem Wasser erhebt sich hie
          und da ein schuppiger Kopf. Selbst unter Forellen hat man
          dergleichen noch nicht geh&ouml;rt. Nun springt der
          J&auml;ger auf und bewegt zu seinen Tonfolgen zuerst den
          Oberk&ouml;rper hin und her. Das steigert die Lust, die
          er beim Hervorrufen der Kl&auml;nge empfindet.
          Allm&auml;hlich geht die Bewegung auf den ganzen
          K&ouml;rper &uuml;ber. Er wiegt und dreht sich, macht
          kleine, gr&ouml;&szlig;ere Spr&uuml;nge und
          l&auml;&szlig;t immer wildere Melodien h&ouml;ren.</P>

          <P align="justify">Ersch&ouml;pft l&auml;&szlig;t er sich
          ins Gras fallen. Sein Leib gl&uuml;ht und ist wohlig
          ermattet, der letzte Rest von Traurigkeit einem
          Gef&uuml;hl satter Zufriedenheit gewichen. Ihm ist, als
          h&auml;tte er bei seinem Weib gelegen. Er schlie&szlig;t
          die Augen und genie&szlig;t die ersten w&auml;rmenden
          Sonnenstrahlen, die &uuml;ber die Baumkronen hinweg das
          Flu&szlig;tal erreichen. Der Wind streicht mit sanftem
          Finger durchs Halmenmeer. Vom Flu&szlig; kommt
          gleichm&auml;&szlig;iges Raunen. Fern br&uuml;llt ein
          Rind. Ein Rind? Hellwach springt der J&auml;ger auf,
          schiebt das singende Rohr in den K&ouml;cher und eilt zum
          Grasland hinauf. Er sp&auml;ht, mit der Hand die Augen
          beschattend, hinaus. Richtig! Weit hinten am Horizont ist
          Bewegung und kommt n&auml;her. Der gro&szlig;e Zug der
          Bisons! Jetzt beginnt die Jagd und die Seinen werden doch
          noch satt. &Uuml;berm&uuml;tig greift er in den
          K&ouml;cher und zieht das Rohr heraus. Er spielt. Er
          macht Musik. Sie ist von nun an sein Trost.</P>

          <P align="justify">(c) Bonn 1991<BR>
          </P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

