<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content=
    "text/html; charset=iso-8859-1">
    <META name="author" content=
    "Johannes Weidner und Michael M&ouml;ller">

    <TITLE>Rezensionen - Buchfink empfiehlt</TITLE>
  </HEAD>

  <BODY bgcolor="#FFFFFF" text="#333333" link="#0033CC" vlink=
  "#333366" leftmargin="10" topmargin="10" marginwidth="10"
  marginheight="10" background="nc_bg4.gif">
    <TABLE border="0" cellspacing="0" cellpadding="10" width=
    "100%">
      <TR>
        <TD>
          <H3 align=center><B>Felix Dahn</B></H3>

          <H1 align=center><B>Ein Kampf um Rom</B></H1>

          <H5 align=center>wieder gelesen von Hanno Erdwein</H5>

          <P>"Och, so ein oller Schinken", wird nun manch einer
          entt&auml;uscht seufzen. Sicher ist dieses Buch recht
          betagt und in einer Sprache verfa&szlig;t, wie sie unsere
          Urgro&szlig;v&auml;ter noch in ihrem hochdeutschen Munde
          f&uuml;hrten. Dennoch hat solch ein Buch auch seinen
          besonderen Reiz. Der liegt schwerpunktm&auml;&szlig;ig in
          der Fabulierkunst des Autors.</P>

          <P>"Ein Kampf um Rom" ist kein Geschichtswerk. Wer
          parallel dazu den Ploetz aufschl&auml;gt, um den
          Wahrheitsgehalt zu pr&uuml;fen, wird entt&auml;uscht
          sein. Sicher sind Personen wie Kaiser Justinian und
          Theodora, der Feldherr Belisar, Gotenk&ouml;nig Totila
          und noch eine Menge anderer Gestalten geschichtlich
          belegt. Doch Felix Dahn mischt darunter recht eifrig die
          Sagengestalten germanischer V&ouml;lker. Es ist
          r&uuml;hrend, wenn als einer der wackersten
          Gotenf&uuml;hrer Theoderichs Waffenmeister Hildebrand mit
          grauem Bart und wuchtig dreinschlagender Streitaxt
          daherkommt. Auch Markgraf R&uuml;diger von Bechelaren,
          den wir aus dem Nibelungenlied kennen, darf nicht fehlen.
          Und &uuml;berhaupt - die meisten K&auml;mpen sind so
          trefflich holzgeschnitzt, da&szlig; sie sich uns wie aus
          der Ilias, der Aeneis oder dem schon erw&auml;hnten
          Nibelungenlied pr&auml;sentieren. Das hat schon was. Und
          es ist auf seine kernige Art unterhaltsam.</P>

          <P>Die Handlung folgt in groben Z&uuml;gen dem Niedergang
          des Ostgotenreichs in Italien. Nach dem Tode Theoderichs
          des Gro&szlig;en, so die Romanhandlung, sammelten sich
          die Gotenf&uuml;hrer unter dem Vorsitz Meister
          Hildebrands und schworen, das r&ouml;mische Reich alsbald
          frei von byzantinischem Einflu&szlig; wieder unter einem
          Gotenk&ouml;nig erstarken zu lassen. Wacker geschworen,
          aber nicht so rasch durchgef&uuml;hrt. Vorerst sind die
          Goten untereinander uneins. Einige H&auml;nde greifen
          nach der K&ouml;nigskrone. Hier m&uuml;ssen auch wieder
          die Gotenf&uuml;hrer zusammenkommen und fast schon mit
          Gewalt Witichis (Witigis) zum K&ouml;nig machen.</P>

          <P>Bei den K&auml;mpfen geht es blutig zur Sache. Felix
          Dahn l&auml;&szlig;t da nichts aus an drastischer
          Schilderung. Aber das sollte man bereits aus den
          Sagenepen Homers und dem Nibelungenlied gew&ouml;hnt
          sein. In diesen Werken wird auch nicht zimperlich
          gefochten. Einige St&auml;dte fallen. Andere leisten
          heftig Widerstand. Dazu z&auml;hlen Ravenna und Rom.<BR>
          </P>

          <P>In Rom sitzt eine der schillerndsten Gestalten, die
          das Buch aufzuweisen hat: der Pr&auml;fekt Cethegus. Das
          ist eine Type: Verschlagen und listig wie Odysseus.
          Machtgeil. L&uuml;gen und Verrat geh&ouml;ren zu seinem
          t&auml;glichen Handwerk. Und sein Traum ist, Goten und
          Byzantiner gegeneinander ausspielend aufzureiben, um sich
          selbst als wiedererstandener Imperator C&auml;sar auf den
          Thron zu schwingen. Da&szlig; und wie es ihm auch beinah
          gelingt, macht die Spannung des Romans aus.</P>

          <P>Witichis, ein zwar sympatischer aber
          ungl&uuml;cklicher K&ouml;nig, scheitert, obschon er eine
          Zweckheirat mit Mataswintha, der Enkelin Theodrichs
          eingeht. Die Belagerung Roms mu&szlig; er aufgeben.
          Ravenna f&auml;llt zwar in seine Hand. Aber Belisar und
          Cethegus &uuml;berw&auml;ltigen ihn und nehmen ihn
          gefangen. Er stirbt bei einem Ausbruchsversuch.</P>

          <P>Totila, der nun die K&ouml;nigsw&uuml;rde tr&auml;gt,
          hat mehr Waffengl&uuml;ck. Jung-Siegfried gleich
          &uuml;berrennt er alle Hindernisse und erobert auch das
          hartn&auml;ckig verteidigte Rom. Wie ihm das gelingt und
          welche Rolle dabei Cethegus spielt, z&auml;hlt zu den
          H&ouml;hepunkten des Romans.</P>

          <P>Sicher mu&szlig; Felix Dahn sein Buch mit dem
          endg&uuml;ltigen Niedergang der Goten auf italienischem
          Boden schlie&szlig;en lassen. Narsis hat eine bessere
          Hand bei der R&uuml;ckeroberung als Belisar. Das sind
          Geschichtsfakten, die auch selbst die eifrigste
          Fabulierlust nicht hinwegdichten kann.</P>

          <P>Der W&auml;lzer verspricht - wenn man sich einmal auf
          den nicht gerade flott zu lesenden Sprachflu&szlig;
          eingelassen hat - eine Menge Lesespa&szlig;. Das ist
          etwas f&uuml;r erholsame Urlaubstage, f&uuml;r einen
          l&auml;ngeren Krankenhausaufenthalt (was niemandem zu
          w&uuml;nschen w&auml;re), oder auch f&uuml;r
          Winterabende, wenn die Flimmerkiste mal wieder nur
          Hirnplattheiten ausspuckt.</P>

          <P>Mit Augenzwinkern m&ouml;chte ich das Buch empfehlen.
          Es ist entweder im modernen Antiquariat zu haben. Auf der
          Gutenberg-CD beim Projekt Gutenberg liegt es auch als
          HTMLDatei vor.</P>

          <P>(c) Juli 2002</P>
          <BR>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

