<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <META name="description" content="LITERAPUR - Lesestoff und Schreibanregung">
    <META name="author" content="Johannes Weidner und Michael M&ouml;ller">

    <TITLE>Erdwein: Der Mann im Mond (SF)</TITLE>
  </HEAD>

  <BODY bgcolor="#000000" text="#ffff99">
    <TABLE border="0" cellspacing="0" cellpadding="10" width="100%" summary="">
      <TR>
        <TD valign="top">
          <BR>
          <H3 align=center> Hanno Erdwein </H3>

          <H1 align=center><B>Der Mann im Mond</B></H1>

          <P>Es war nicht seine Absicht, auf dem Mond zur&uuml;ck
          zu bleiben. Was ist schon der Mond? Ein toter Dreckhaufen
          aus Staub, Sand und Gestein. Lebensraum musste man
          mitbringen. Vorhanden war hier nichts, was in irgendeiner
          Weise &Uuml;berleben h&auml;tte sichern k&ouml;nnen. Und
          doch blieb er zur&uuml;ck aus Pech, purem Zufall oder
          Gedankenlosigkeit seiner Kameraden.</P>

          <P>Das war die letzte von zwanzig Missionen, den Mond auf
          eine komerzielle Nutzung hin gr&uuml;ndlich zu
          untersuchen. Die ausgesandten Teams verbrachten immer
          l&auml;ngere Zeiten, sogar mehrere Monate auf dem
          Erdtrabanten. Zu diesem Zweck hatte man aus Containern
          eine kleine Station errichtet, die die Basis der
          geplanten Siedlung bilden sollte. Wasserstoff und
          Sauerstoff war genug im Mondgestein enthalten, daraus das
          &uuml;berlebensnotwendige Wasser zu synthetisieren. Zwar
          schmeckte es brrrr. Ohne Zus&auml;tze mochte es niemand
          schlucken. Aber das und die regelm&auml;&szlig;ige
          Wiederkehr des Sonnenlichts sicherten die Grundversorgung
          mit Luft, Wasser und Energie. Das schien Spekulanten und
          Abenteurern genug, ihre H&auml;nde nach dem Mond
          auszustrecken. Aber es kam alles anders, als sich die
          wohlhabenden Staaten das gedacht hatten. Krieg in
          Ostasien expandierte weltbrandartig gegen die westliche
          Welt. Die Mondmission wurde hektisch abgebrochen.
          Fluchtartig startete man die F&auml;hre und verga&szlig;,
          dass er noch drau&szlig;en herumlief.</P>

          <P>Er trat aus der H&ouml;hle, als das Schiff bereits der
          Erde entgegenraste. Auf Funkruf reagierten weder der
          Kommandant noch die Bodenstation. Er sa&szlig; fest. Und
          es blieb ihm nichts anders &uuml;brig, die Vorr&auml;te
          zu &uuml;berpr&uuml;fen. Es reichte mal gerade f&uuml;r
          drei Monate, wenn er sparsam wirtschaftete. Drei Monate?
          Und was dann? Sollte er sich dann den Blaster an die
          Schl&auml;fe halten und abdr&uuml;cken? Vorerst
          begn&uuml;gte er sich damit, das Treiben dort dr&uuml;ben
          zu verfolgen. Aus dieser Distanz schien es ihm, als
          w&auml;re man dort verr&uuml;ckt geworden. Der Krieg
          eskalierte zur totalen Vernichtung. Die gro&szlig;en
          St&auml;dte hatte man bereits in radioatkive W&uuml;sten
          verwandelt. Jetzt jagte man sich mit kleineren atomaren
          Waffen quer &uuml;ber die Kontinente. Im Verlauf von drei
          Wochen war das Steinzeitalter auf Terra
          zur&uuml;ckgekehrt. Er sa&szlig; am lunaren Teleskop und
          sah den Grad der Verw&uuml;stung. Dann lie&szlig; er
          seinen Tr&auml;nen freien Lauf.</P>

          <P>Am Ende des zweiten Monats teilte er sich die
          verbliebenen Vorr&auml;te nochmals ein und rechnete sich
          aus, dass er damit noch einige Wochen hinausschinden
          konnte. Trotz der Hoffnungslosigkeit, trotz des
          Leichenplaneten vor seiner Haust&uuml;r klammerte er sich
          an das bisschen Leben, das ihm verblieb. Er trieb
          astrononische Studien. Der Mond, dem jegliche flimmernde
          Lufth&uuml;lle fehlte, war hierzu der ideale Standort
          schlechthin. Und im Verlauf eines Monats durchlief er
          einmal den Tierkreis, einmal den kompletten
          Sternenhimmel. Stunde um Stunde verbrachte er am
          Teleskop. Sternkarten und Computerbilder nahm er zu
          Hilfe, Erscheinungen zu identifizieren. Und er fand
          weitere Objekte, die in keiner Karte bisher verzeichnet
          waren. Die Frage, wem das jetzt noch n&uuml;tzen sollte,
          unterdr&uuml;ckte er. Lebte absolut dem Augenblick und
          verbiss sich in Beobachtungen. In der Mitte des
          f&uuml;nften Monats schn&uuml;rte er den G&uuml;rtel noch
          enger und a&szlig; nur alle zwei Tage. Daf&uuml;r trank
          er Unmengen Wasser. Seine Augen bekamen einen fiebrigen
          Glanz. Die Hand zitterte, die das Okular einstellte. Aber
          er blieb und rang dem Leben weitere Tage ab.</P>

          <P>Als nur mehr eine Handvoll kostbarer Nahrung
          &uuml;brig war, geschah das Unbegreifliche. Zuerst
          glaubte er, Hungerphantasien zu erliegen. Auf einer der
          Rundumkameras bewegte sich was. Was konnte sich auf dem
          toten Mond au&szlig;er ihm bewegen? Nicht einmal der
          kleinste Wind wirbelte Staub auf. Doch da kam etwas auf
          die Station zu, etwas, das Arme, Beine und einen Kopf
          besa&szlig;. Ein Mensch? Au&szlig;er ihm gab es keinen
          Menschen auf Luna. Und dass seine Kameraden alle fort
          waren, daf&uuml;r mochte er sich verb&uuml;rgen. Seine
          Kameraden ... ob sie dort dr&uuml;ben noch lebten? Er
          sch&uuml;ttelte heftig diesen depremierenden Gedanken ab,
          den er bei seiner jetzigen Schw&auml;chung nicht
          gebrauchen konnte. Und die unglaubliche Erscheinung dort
          drau&szlig;en kam immer n&auml;her, wurde in ihren
          Details deutlicher. Jetzt sah er, dass sie unter ihrem
          Raumhelm ein menschliches Gesicht hatte. Und welch ein
          Gesicht! Es war das Gesicht einer Frau. Eine Frau auf
          Luna. Das war aber nun was ganz Neues. Nie wurde
          geh&ouml;rt, dass eine Mission eine Frau an Bord hatte.
          Das war erst nach Vollendung der komfortablen Raumstation
          geplant. Aber dort drau&szlig;en nahte - nun schon bis
          auf wenige Schritte - ein verdammt h&uuml;bsches Weib der
          Basis. Er sank zur&uuml;ck und grub das Gesicht in die
          H&auml;nde. Dann meldete sich die Sprechanlage.</P>

          <P>"Ich bringe Nahrung", l&auml;chelte die Frau und
          stellte merkw&uuml;rdig geformte Beh&auml;lter auf den
          Tisch.</P>

          <P>"Woher wussten Sie ... und wer sind ..."</P>

          <P>"sp&auml;ter. Erst essen Sie mal, damit Ihr Kopf
          keinen Schaden leidet."</P>

          <P>Wie ein Wolf machte er sich &uuml;ber die Mitbringsel
          her. Er a&szlig; nicht, er fra&szlig;. Es schmeckte zwar
          ungewohnt, aber es war durchaus genie&szlig;bar. Sie
          zapfte derweil Wasser, r&uuml;hrte ein Pulver hinein und
          stellte ihm den Becher hin. Dann trank er. Und was er
          trank, h&auml;tte das bestgebrauteste Bier sein
          k&ouml;nnen, wenn sie nicht zuf&auml;llig auf dem Mond
          w&auml;ren und die Frau es aus Wasser und einem seltsamen
          Pulver erzeugt h&auml;tte.</P>

          <P>Und jetzt, wo er ges&auml;ttigt war, betrachtete er
          sich diese Frau eingehender. Ohne Zweifel war sie ein
          Mensch, hatte humanoide Formen, Benehmen und Stimme. Auch
          sprach sie zu ihm in durchaus sauberem Englisch.</P>

          <P>"Hmmm, entschuldigen Sie meine Neugier. Aber darf ich
          erfahren, woher Sie kommen?"</P>

          <P>Sie zeigte blendend wei&szlig;e Z&auml;hne und
          l&auml;chelte:</P>

          <P>"Sp&auml;ter. Ich muss erst daf&uuml;r sorgen, dass
          ihr &Uuml;berleben f&uuml;r die n&auml;chste Zeit
          gesichert ist."</P>

          <P>Damit klappte sie den Helm zu, huschte in die Schleuse
          und erschien gleich darauf auf dem Monitor. Dann - ach du
          liebe Zeit - hob sie mehrere Meter vom Mondboden ab und
          jagte in einem irren Tempo davon. Es verging keine halbe
          Stunde, bis sie am Horizont wieder erschien. Sie flog in
          gleicher Weise auf ihn zu, wie sie davongeschossen war.
          Aber sie hatte einen gro&szlig;en Beh&auml;lter im
          Schlepp. Den parkte sie vor der Schleuse, verlud den
          Inhalt und forderte ihn auf, ihr beim Beladen des
          Vorratsraums zu helfen.</P>

          <P>"Lebensmittel f&uuml;r mehr als ein Jahr", strahlte
          sie.</P>

          <P>Er begriff es nicht. Er begriff &uuml;berhaupt nichts
          mehr und kniff sich heimlich ins Fleisch, um endlich aus
          diesem allzu sch&ouml;nen Traum zu erwachen.</P>

          <P>Br&ouml;ckchenweise lie&szlig; sie sich dar&uuml;ber
          aus, wer sie war. So unglaublich es klingen mochte, ihre
          Abstammung war humanoid, wenn auch nicht irdisch.</P>

          <P>"Haben denn Menschen vor uns bereits den Weltraum
          besiedelt?", fragte er erstaunt.</P>

          <P>"Umgekehrt wird ein Schuh draus", schmunzelte sie.
          "Unsere Spezies hat bei der Menschwerdung ein wenig
          mitgeholfen."</P>

          <P>"Ach ja", winkte er ab. "Die alte Leier von den
          hyperintelligenten Wesen aus dem All, die den Affen von
          den B&auml;umen halfen. So ein verr&uuml;ckter Schweizer,
          ich glaub D&auml;niken hie&szlig; er, faselte B&uuml;cher
          lang von der Theorie, die sogenannten G&ouml;tter
          k&auml;men aus dem Weltraum."</P>

          <P>"So? Schrieb er das?"</P>

          <P>Mit flinken H&auml;nden r&auml;umte sie die leeren
          Beh&auml;lter in den Recycle-Tank.</P>

          <P>"Wei&szlig;t du, manchmal sind Verr&uuml;ckte
          wunderbar hellsichtig. Unsere Vorfahren wurden
          tats&auml;chlich damals wie G&ouml;tter verehrt. Und
          steht nicht in einem Eurer religi&ouml;sen Werke, dass
          sich die G&ouml;tters&ouml;hne irdische T&ouml;chter zur
          Frau nahmen?"</P>

          <P>"Nichtssagende Mythen", tat er das ab. "Es steht viel
          in der Bibel, was heute keiner mehr glaubt."</P>

          <P>Wei&szlig;zahniges L&auml;cheln von ihr:</P>

          <P>"Und das gerade h&auml;ttet Ihr w&ouml;rtlich nehmen
          sollen."</P>

          <P>Hierauf erz&auml;hlte sie ihm von einer
          aus&szlig;erirdischen Siedlung auf der Landbr&uuml;cke
          zwischen Europa und Amerika.</P>

          <P>"Guck durchs Teleskop", forderte er sie auf. "Da ist
          keine Verbindung."</P>

          <P>"Heute nicht mehr", gab sie zu. "Sie bestand aber.
          Ging bei einer kosmischen Katastrophe unter. Was Ihr
          Azoren nennt, sind die &Uuml;berreste von damals."</P>

          <P>"Deine Leute gingen unter?"</P>

          <P>"Die meisten. Aber wir hatten uns bereits so sehr mit
          Euch vermischt, dass wir indirekt weiterlebten."</P>

          <P>Er stand auf und ging sinnend auf und ab:</P>

          <P>"Aber Euer enormes Wissen. Wo blieb das? Unsere
          heutigen Kenntnisse haben wir uns m&uuml;hsam erarbeiten
          m&uuml;ssen."</P>

          <P>"Das Wissen verlor sich", gab sie zur Antwort. "Eine
          Weile noch wurde es als Geheimwissenschaft tradiert. Aber
          da es keine praktische Anwendung mehr fand, wussten immer
          weniger was damit anzufangen."</P>

          <P>"Ja", brummte er nachdenklich. "So ist das zu
          erkl&auml;ren. Aber du? Wo kommst du denn auf einmal
          her?"</P>

          <P>Ihr erd&auml;hnlicher Planet lag in einer Sonne nahe
          dem Polarstern Polaris. Es war ein bescheidener Stern,
          j&uuml;nger als die Sonne. Aber die Bewohner dieses
          blauen Planeten waren bereits vor einigen Millionen
          Jahren im Besitz enormen Wissens. Sie entwickelten und
          perfektionierten die Raumfahrt. Ihre Schiffe mit
          &uuml;berlichtschnellem Antrieb erkundeten den
          galaktischen Sektor und stie&szlig;en auch bald auf das
          Sol-System. Sie freuten sich, einen Planeten ausfindig
          gemacht zu haben, der dem ihren &auml;hnelte. Und sie
          beschlossen, auch hier den Keim des Bewusstseins zu
          pflanzen. Auf dem Trabant dieses Planeten errichteten sie
          eine Forschungsstation. Sie platzierten sie auf der dem
          Planeten abgewandten Seite und behielten Terra im
          Auge.</P>

          <P>"Und diese Station existiert noch?"</P>

          <P>"Erraten", gab sie lachend zu. "Ich bin ihre
          derzeitige Besatzung."</P>

          <P>Kopfsch&uuml;tteln.</P>

          <P>"Man l&auml;&szlig;t eine Frau jahrelang allein auf
          einer Station."</P>

          <P>"Du denkst in irdischen Vorstellungen. Bei uns sind
          Frauen weit h&ouml;her geachtet als bei Euch. Ich hab
          Zeit gehabt, Euch zu studieren. Euer Fernsehen gab
          Zeugnis von Eurer abgrundtiefen Barbarei."</P>

          <P>"So? Schade, dass ich nicht Eure Fernsehprogramme
          betrachten kann."</P>

          <P>Er stapfte unzufrieden umher. Einerseits mochte er
          diese Fremde, der er sein Weiterleben verdankte.
          Andererseits ging ihm ihre &Uuml;berrheblichkeit
          f&uuml;rchterlich auf den Keks.</P>

          <P>"Wielange studierst du uns den schon?", wollte er
          wissen.</P>

          <P>"Mehr als drei irdische Jahrhunderte."</P>

          <P>"Wie bitte?"</P>

          <P>Er schlug sich vor die Stirn.</P>

          <P>"Dann bist du ja steinalt."</P>

          <P>"Wenn du das so sehen willst."</P>

          <P>"Moment", fiel ihm ein, "wenn ich dich richtig
          verstanden hab, unterscheidet Ihr Euch genetisch nur
          unwesentlich von uns. Wieso habt Ihr denn ein so
          unendlich l&auml;ngeres Leben als wir?"</P>

          <P>"Ach - du stellst Fragen", seufzte sie. "Unsere
          Wissenwschaften sind doch nicht stehengeblieben. Wir
          haben das Langlebigkeits-Gen entdeckt und wenden es mit
          Erfolg an. Das ist alles."</P>

          <P>"Und so was mir", jammerte er, "der den Untergang
          seiner Spezies geradewegs vor Augen hat."</P>

          <P>"Tja", meinte sie lakonisch. "Das ist nun mal die
          Strafe f&uuml;r bodenlose Dummheit."</P>

          <P>Damit verschwand sie und lie&szlig; sich einige Wochen
          nicht blicken.</P>

          <P>Sie r&auml;kelte sich neben ihm auf dem Lager und er
          streichelte ihren Vier-Zehen-Fu&szlig;.</P>

          <P>"Den kleinen Zeh hat die Evolution verschlampt, weil
          wir Jahrtausende hindurch nur schwebten statt liefen",
          erkl&auml;rte sie. "Noch ein paar Jahrtausende weiter und
          wir haben keine F&uuml;&szlig;e mehr."</P>

          <P>Er dr&uuml;ckte ihr einen Kuss darauf:</P>

          <P>"Um Himmels Willen! Nur das nicht. Nie hab ich so
          h&uuml;bsche Frauenf&uuml;&szlig;e gesehen."</P>

          <P>Sie lachte:</P>

          <P>"Noch sind sie ja da und werden dir bleiben."</P>

          <P>Sie streckte sich nach ihm und dr&uuml;ckte ihn an
          sich:</P>

          <P>"Wollen wir nicht in meine Station umziehen. Dort
          haben wir mehr Platz und Bequemlichkeit."</P>

          <P>Tr&uuml;b sch&uuml;ttelte er den Kopf:</P>

          <P>"Ich will den Blick auf meinen Heimatplaneten nicht
          verlieren.</P>

          <P>"So sehr liegt dir daran?"</P>

          <P>"Ja. Und ich w&uuml;nschte, ich k&ouml;nnte dort
          hinauf, um dort zu wohnen."</P>

          <P>"Aber die Radioaktivit&auml;t. Sie wird dich
          umbringen."</P>

          <P>Seine Augen wurden feucht:</P>

          <P>"Das w&auml;r mir egal."</P>

          <P>Wie ein Kind nahm sie ihn in ihre Arme und gab sich
          ihm hin wie eine Frau. Dann richtete sie sich auf:</P>

          <P>"Wenn dir so viel daran liegt, will ich etwas f&uuml;r
          dich tun."</P>

          <P>Sie blieb l&auml;nger als einen Monat fort. Dann sah
          er pl&ouml;tzlich ein Raumschiff von der R&uuml;ckseite
          des Mondes kommend der Erde entgegenrasen. In immer
          engeren Spiralen umrundete das Schiff den Planeten von
          Pol zu Pol. Das dauerte &uuml;ber eine Woche. Durch
          Teleskop verfolgte er den Flug. Wurde aber nicht klug
          daraus, was das zu bedeuten hatte. Dann kehrte das Schiff
          zur&uuml;ck und landete auf der Plattform nahe seiner
          Station. Sie stieg aus und schwebte ihm eilig
          entgegen.</P>

          <P>"Hab noch ein paar Monate Geduld, dann kannst du auf
          die Erde zur&uuml;ckkehren."</P>

          <P>Er verstand gar nichts, was sie zu ignorieren
          schien.</P>

          <P>"Ich bin schwanger", fl&uuml;sterte sie ihm eines
          nachts ins Ohr. "Wir bekommen ein Mondkind."</P>

          <P>Er geriet vor Entz&uuml;cken total aus dem
          H&auml;uschen.</P>

          <P>"Ein neuer Erdenb&uuml;rger", jubelte er. "Oder kehren
          wir nicht auf die Erde zur&uuml;ck?"</P>

          <P>"Doch Liebster. Wir kehren zur&uuml;ck, die Menschheit
          neu und besser aufzubauen. Du - Adam und ich - Eva."</P>

          <P>(c) HE 20 Juli 1999</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
    <BR>
  </BODY>
</HTML>

