<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Thomas Nawroth">
<META NAME="DESCRIPTION" CONTENT="Ein Computer-Magazin von 1984">
<TITLE>Happy Computer</TITLE>
</HEAD>
<BODY bgcolor="#fffff4" background="mm_hc07b.gif">
<TABLE border="0" cellpadding="8">
      <TR>
        <TD>
         <CENTER><IMG SRC="mm_hc07a.gif">
         <BR><I>Folge 7</I></CENTER><BR>
Allen, denen dieser Artikel zu lange erscheint, empfehle ich, wenigstens den vorletzten und letzten Absatz :-)<BR>
<HR>

<P>Mit dem Laser 2001 stellt Sanyo Video seinem Spiele-Computer CreatiVision ein Ger&auml;t  zur Seite, das die Spielesoftware seines kleinen Bruder nutzen kann. Wird der neue Heimcomputer seine 
Konkurrenz in den Schatten stellen?</P>

<H1 ALIGN="CENTER">Laser mit Schatten</H1>

<P>Mit dem CreatiVision begr&uuml;ndete Sanyo Video Anfang dieses Jahres eine zweite Heimcomputer-
Produktlinie. Der Laser 2001 mit seinem 6502A als CPU z&auml;hlt zu dieser neuen Linie. Deutliches &auml;u&szlig;eres Merkmal hierf&uuml;r ist der Modulstecker an der rechten Seite des Ger&auml;ts. Die Spiele des CreatiVision, wie zum Beispiel der Computer-Flipper &quot;Astro Pinball&quot;, lassen sich hier ohne Probleme anstecken. Somit handelt es sich auch bei dem Laser 2001 um einen Zwitter zwischen Heimcomputer und Videospiel. Allerdings macht die Hardware einen bedeutend besseren Eindruck als bei CreatiVision (Test in Happy Computer Ausgabe 5/84).</P>

<CENTER><IMG SRC="mm_hc07c.gif"></CENTER>

<P>Die Folien-, beziehungsweise Gummitastatur, ist einer richtigen Schreibmaschinentastatur 
gewichen. Der deutlich sp&uuml;rbare Druckpunkt und ein &quot;Plop&quot; aus dem Fernsehlautsprecher bilden eine gute Eingabekontrolle. Die Tasten f&uuml;hlen sich leider etwas schwammig an und sind gew&ouml;hnungsbed&uuml;rftig.</P>

<P>Umst&auml;ndlich ist die Cursorsteuerung mit nur zwei Tasten und der SHIFT-Taste. Die Repeat-Funktion setzt mit zirka einer Sekunde Verz&ouml;gerung ein. Auffallend ist, da&szlig; die 
Wiederholungsgeschwindigkeit vom jeweils eingegebenen Zeichen abh&auml;ngig ist. Als absoluter 
Rekordhalter erwies sich das &quot;X&quot;, da&szlig; sich mindestens doppelt so schnell reproduzierte wie beispielsweise das &quot;N&quot; oder das &quot;B&quot;.</P>

<P>Oberhalb des Tastenfeldes findet man die Reset-Taste des Laser 2001. Ihr Platz ist g&uuml;nstig, denn zum einen ist sie weit genug von der Tastatur entfernt, um nicht versehentlich gedr&uuml;ckt zu werden, zum anderen mu&szlig; man sie nicht irgendwo an der R&uuml;ckseite suchen. Die Reset-Taste &uuml;bernimmt auch die BREAK-Funktion. Mit ihr erfolgt kein Kaltstart. Sie unterbricht nur den Programmablauf ohne das Basic-Programm zu l&ouml;schen. In manchen Situationen hilft aber auch diese Taste nicht mehr weiter. In so einem Fall mu&szlig; man die Stromversorgung abschalten, um den Computer wieder klar zu bekommen. Dann geht das Programm nat&uuml;rlich verloren.</P>

<P>Nach dem Einschalten meldet sich der Laser 2001 mit der Nachricht &quot;BASIC VERSION 1.0 &copy; 1983 VTL&quot;. Dieses Basic gleicht in vielerlei Hinsicht dem bekannten Basic der anderen Sanyo-Computer. Wieder handelt es sich um eine Version des Microsoft-Basic mit einigen abweichenden Befehlen. So kennt der Laser 2001 den Befehl CLS nicht, an dieser Stelle wird HOME zum L&ouml;schen des Bildschirms verwendet. Der Befehl CIRCLE produziert Ellipsen. Hier hat man wohl eine Anpassung bei der Bildschirmausgabe vergessen. Der Befehl RECT zeichnet Rechtecke, die durch die Koordinaten der oberen linken und unteren rechten Ecke festgelegt werden. Zeitsparend mit einem Tastendruck k&ouml;nnen 26 verschiedene, leider nur wenig benutzte, Befehle eingegeben 
werden. Warum der Hersteller sich hier f&uuml;r diese seltenen Befehle entschieden hat, bleibt unklar. Die Zeilennummern der Basic-Programme d&uuml;rfen zwischen 0 und 63999 liegen, eine Zeile darf bis zu 255 Zeichen lang sein.</P>

<P>Der Laser 2001 kennt zwei Arten des Bildschirmaufbaus. Im Textmodus k&ouml;nnte er in 24 Zeilen jeweils 40 Zeichen darstellen. Tats&auml;chlich genutzt werden aber nur 36 Spalten. Die beiden 
Randspalten werden f&uuml;r den Bildschirmaufbau im Textmodus nicht verwendet. In den beiden 
untersten Zeilen werden Systemmeldungen ausgegeben, so da&szlig; effektiv nur 792 Zeichen auf dem 
Bildschirm dargestellt werden. Im Grafikmodus (umschaltbar mit &quot;GR&quot;) betr&auml;gt das 
Aufl&ouml;sungsverm&ouml;gen 192 x 256 Punkte. Die schon erw&auml;hnten Befehle CIRCLE und RECT lassen sich - genau wie PLOT - nur im Grafikmodus verwenden. Die PLOT-Anweisung erwies sich als 
stark. Kann man doch zwei Punkte mit dem Befehl &quot;PLOT...TO&quot; zu einer Geraden einfach 
verbinden. Die oft verwendete Befehlsfolge &quot;PLOT....DRAWTO ...&quot; wird somit verk&uuml;rzt.</P>

<CENTER><IMG SRC="mm_hc07d.gif"></CENTER>

<P>Der neue Laser verarbeitet Zahlen zwischen -10<SUP>38</SUP> und 10<SUP>38</SUP>. Die kleinste verwendbare Zahl ist 
10<SUP>-38</SUP>. Variablennamen d&uuml;rfen zwar beliebig lang sein, es werden aber nur die ersten beiden Zeichen zur Identifizierung herangezogen. String- und Integervariable m&uuml;ssen gesondert gekennzeichnet werden, was noch einmal zur Einschr&auml;nkung der Benennungsm&ouml;glichkeiten f&uuml;hrt. Die Stringverarbeitung erfolgt mit den &uuml;blichen Microsoft-Basic-Befehlen.</P>

<P>Als Massenspeicher verwendet der Laser 2001 einen Kassettenrecorder. Mit den Befehlen CSAVE 
und CLOAD werden Programme abgespeichert beziehungsweise geladen - ohne weiteren Programmnamen. Beim Arbeiten mit dem Kassettenrecorder hat man deshalb keine Kontrolle was der Computer eigentlich gerade tut. Das Abspeichern erfolgt schnell, aber beim Laden gibt es oft Schwierigkeiten. So wird auf dem Bildschirm die Meldung &quot;PROGRAMM LOADING&quot; selbst dann 
ausgegeben, wenn noch gar kein Signal &uuml;ber den Eingang kommt.</P>

<P>Ersetzt man in den Ladebefehlen den Buchstaben &quot;C&quot; durch ein &quot;B&quot;, so werden bin&auml;re Datenfelder gespeichert, beziehungsweise geladen. Die Befehle STORE und RECALL geben Daten aus einem Basic-Programm auf den Kassettenrecorder aus.</P>

<P>Da die Arbeit mit dem Kassettenrecorder recht umst&auml;ndlich und st&ouml;ranf&auml;llig ist, werden viele auf das Diskettenlaufwerk FD 100 zur&uuml;ckgreifen. Der Controller f&uuml;r diese Laser-Diskettenstation wird einfach auf den Datenbus aufgesteckt. Angesprochen wird er mit den Befehlen LOAD und SAVE, die jetzt mit Programmnamen verwendet werden m&uuml;ssen. Der Zugriff erfolgt mit lautem Get&ouml;se. Man merkt sofort, da&szlig; es sich bei dem Diskettenlaufwerk um ein Ger&auml;t der Billigklasse handelt. Auch das Betriebssystem, das beim Formatieren automatisch mit auf die neue Diskette geschrieben wird, ist nicht besonders leistungsf&auml;hig. Einen Befehl zum Kopieren von Disketten gibt es nicht, obwohl auch im Handbuch empfohlen wird, Sicherheitskopien anzulegen.</P>

<P>Besonders erw&auml;hnenswert sind die Handb&uuml;cher. Im Ausland geschrieben scheint sie kein deutscher Korrektor jemals in der Hand gehabt zu haben. Einige Abs&auml;tze rufen beim Lesen Heiterkeit hervor, so zum Beispiel, wenn man aufgefordert wird, beim Anstecken des Druckerkabels den Netzstecker zu ziehen, da man sonst &quot;elektrisiert&quot; wird und dann &quot;nicht mehr sehen kann, wie sein Laser 2001 mit einem Drucker funktioniert&quot;. Meist lassen sich dennoch die wichtigsten Informationen aus dem Text herausholen. Aber an einigen Stellen kann man auch mit gutem Willen nicht mehr erkennen, was der Autor eigentlich ausdr&uuml;cken wollte.</P>

<CENTER><IMG SRC="mm_hc07e.gif"></CENTER>

<P>In der Produktlinie, die Sanyo Video mit dem CreatiVision begonnen hat, stellt der Laser 2001 
dennoch eine deutliche Verbesserung dar. Der vorget&auml;uschte professionelle &quot;Touch&quot; ist jedoch schnell vergessen, wenn man mit dem Ger&auml;t wirklich professionell arbeiten will. L&auml;uft der Laser beispielsweise l&auml;nger als eine Stunde, so kann man auch in der kalten Jahreszeit an dem Computer keine kalten H&auml;nde bekommen. So stark ist die W&auml;rmeentwicklung. W&auml;hrend Sanyo Video mit den anderen Laser-Computern jeweils ansprechende Ger&auml;te auf den Markt gebracht hat, kann der neue Computer h&ouml;chstens den Einsteiger befriedigen. Positiv ist eigentlich nur, da&szlig; der Computer zu einem relativ g&uuml;nstigen Preis schon mit allen Anschlu&szlig;m&ouml;glichkeiten (sogar f&uuml;r den Drucker ist kein eigenes Interface n&ouml;tig) geliefert wird. Es bleibt die Frage offen, warum Sanyo 
Video neben dem guten Laser 310 einen zweiten Computer auf den Markt brachte, der in die 
gleiche Zielrichtung geht, jedoch einen schlechteren Eindruck macht. (hg)</P>
<HR><BR>
In der n&auml;chsten NoCover gibt es ein Spielelisting für den Spectrum.
         </TD>
        </TR>
</TABLE>
<BR><BR>
<TABLE ALIGN="CENTER" border="3">
<TR bgcolor="#ffffff">
<TD><A HREF=mailto:"thomasnawroth@web.de">Thomas Nawroth</A></TD>
</TR>
</TABLE>
</BODY>
</HTML>
