<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="st_einnoch.jpg" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>
           Unterhalten sich zwei M&auml;nner.<BR>
           Sagt der eine: "Frauen erobere ich im Sturm!"<BR>
           Der andere: "Sehr interessasant! Und was machst du, wenn das Wetter gut ist?".<BR>
           <BR>


          <HR width="100%" size="3">
          <BR>

          <P>
            Was ist der Unterschied zwischen einem altmodischen Schl&uuml;pfer und einem modernem Schl&uuml;pfer?<BR>
             Mit dem altmodischen Schl&uuml;pfer konnte man noch ein Fahrrad putzen, mit dem modernen Schl&uuml;pfer nur den St&auml;nder!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Was ist beim Sex der unterschied zwischen einem Orgasmus und einem Herzinfarkt?<BR>
             Beim Orgasmus f&auml;sst man der Frau an die Brust.<BR>
             Beim Herzinfarkt f&auml;sst man sich selbst an die Brust.
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Reitet ein Mann mit seinem Kamel durch die W&uuml;ste.<BR>
             Pl&ouml;tzlich &uuml;berholt ihn ein Radfahrer. Ruft der Kamelreiter dem Radfahrer hinterher: "He, warten sie! Sie fahren wie ein Irrer durch die W&uuml;ste und schwitzen nicht ein
            bisschen. Wie machen sie das nur?"<BR>
             Sagt der Radfahrer:"Ich fahre so schnell, das der Fahrtwind mich k&uuml;hlt und ich nicht zu schwitzen brauche!"<BR>
             "Toll!", sagt der Kameltreiber, "das werde ich auch gleich ausprobieren.", und treibt sein Kamel an.<BR>
             Nach zehn Minuten bricht das Kamel tot zusammen.<BR>
             Der Kameltreiber:" Mist! Totgefroren!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Wollen zwei Irre ausbrechen.<BR>
             Sie knoten zwei Bettlaken zusammen und lassen es aus dem Fenster.<BR>
             Der erste klettert aus dem Fenster, ist aber gleich wieder oben. "Zu kurz!".<BR>
             Also knoten sie noch zwei Hosen und ein Handtuch dran. Wieder klettert einer runter, kommt aber nach kurzer Zeit wieder hoch: "Zu lang!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>
          <P>
            Hase und B&auml;r streiten, &auml;rgern und jagen sich st&auml;ndig.<BR>
             Irgendwann taucht bei einem Streit eine Fee auf und schreit: "Ich habe es langsam satt, euch dauert streiten zu sehen. Wenn ihr mir versprecht, mit dem Streiten aufzuh&ouml;ren, hat
            jeder von euch drei W&uuml;nsche frei!"<BR>
             "Versprochen!!!" rufen Hase und B&auml;r wie im Chor.<BR>
             "Der B&auml;r hat den ersten Wunsch!" sagt die Fee.<BR>
             "Ich w&uuml;nsche mir" sagt der B&auml;r, "das alle B&auml;ren auser mir hier im Wald M&auml;dchen werden."<BR>
             Der Hase: "Ich w&uuml;nsche mir einen Motorradhelm!"<BR>
             "Mein zweiter Wunsch" sagt der B&auml;r; "ist, das alle B&auml;ren im Nachbarwald M&auml;dchen werden!"<BR>
             "Mein zweiter Wunsch" sagt der Hase, " ist ein Motorrad!"<BR>
             Die Fee: "Nun euer letzter Wunsch."<BR>
             Der B&auml;r: "Ich w&uuml;nsche mir, das alle B&auml;ren auf der Welt auser mir M&auml;dchen werden!"<BR>
             Der Hase setzt den Helm auf, setzt sich auf das Motorrad, startet den Motor und sagt: "Ich w&uuml;nsche mir das der B&auml;r schwul ist!!!"
          </P>
          <BR>
          <HR width="100%" size="3">
          <BR>

          <P>
            Was ist der Unterschied zwischen einem Pinguin und einem Schornsteinfeger?<BR>
             Der Pinguin hat eine wei&szlig;e Weste und einen schwarzen Schwanz, der Schornsteinfeger eine lange Leiter.
          </P>
          <BR>
           <HR width="100%" size="3">
          <P>
          <BR>
            Ein Frau schaut sich in einer Galerie einen Bilderzyklus mit drei Bildern an.<BR>
             Auf dem ersten Bild ist ein verkohltes Brot zu sehen. Auf dem zweiten Bild liegt ein Toter am Strand, und auf dem dritten Bild h&auml;lt eine junge Frau ein Baby auf dem Arm.<BR>
             Da sie mit der Deutung dieser drei Bilder nicht weiter kommt, fragt sie den Galeriebesitzter, wie sich dieser Bilderzyklus denn nennt.<BR>
             Der &uuml;berlegt kurz und antwortet: "Zu sp&auml;t heraus gezogen!".
          </P>
          <HR width="100%" size="3">
          <BR>
          <P>"Hanna, du bist intelligen und sehr sch&ouml;n, willst du meine Frau werden?" <BR>
          "Nein!"<BR>
          "Aber warum denn nicht?"<BR>
          "Weil ich intelligent und sehr sch&ouml;n bin!"
          </P>
          <BR>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <CENTER>
            <BR>

            <TABLE border summary="">
              <TR>
                <TH bgcolor="#CCCCCC" align="left">
                  <CENTER>
                    <FONT color="#f3300CC">JoJo</FONT> &nbsp; J&uuml;rgen Sperling
                  </CENTER>
                </TH>
              </TR>
              <TR>
                <TH bgcolor="#FFFFCC" align="left">
                  sperlingbergen@freenet.de
                </TH>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

