<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>Leveldesign 2</TITLE>
    <META name="author" content="Rainer Wrieden">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>

  <BODY background="comp005.gif" text="Black">
    <DIV align="CENTER">
      <TABLE width="640" border="0" cellspacing="0" cellpadding="8"
      background="comp005_trans.gif" summary="">
        <TR>
          <TD>
            <P><A href="javascript:history.back()"><FONT size="+1">
            <B>zur&uuml;ck</B></FONT></A></P>

            <H1 align="center"><FONT face="" color="Green">Leveldesign 2</FONT></H1>

            <P title="" align="JUSTIFY"><FONT face="" size="+2"
            color="Red">Vorwort:</FONT><BR><BR>
            Ich hoffe Ihr seit mit meinen Ausf&uuml;hrungen des 1. Teils klargekommen.
		    F&uuml;r alle, die den Level aus Teil 1 noch nicht konstruiert haben aber nun einsteigen wollen, f&uuml;ge ich diesen hier ein <a href="TEST1.WAD">Test1.WAD</a> . Nun wollen wir aber gleich zum n&ouml;chsten Abschnitt dieses Workshops gehen.</P><br>
            <FONT face="" size="+2" color="Red">Wir erstellen unsere erste
            T&uuml;r:</FONT><BR><BR>
            Zuerst starten wir DEU &uuml;ber die Workbench.<br>
			Dann lesen wir mit r test.wad unseren Level ein, den wir im 1. Teil des Wokshops konstruiert hatten.<br>
Nun geben wir e 1 1 ein um diesen Level zu ver&auml;ndern.<br>
Nun sind wir im DEU mit unserem alten Level.<br>
Wie wir es auch schon vom 1. Teil her kennen, scalieren wir erstmal die Anzeige.<br>
Solange die &szlig;-Taste dr&uuml;cken bis Scale 1/2 erscheint.<br>
Danach solange die G-Taste dr&uuml;cken bis Grid=64 erscheint.<br>

            <BR>
            Als erstes sollten wir die Anzeige skalieren.<BR>
            Wir dr&uuml;cken einmal auf die <font face="" color="Blue">G</font> Taste und es erscheint ein
            Rasterfeld.<BR>
            Nun wiederholen wir dieses bis unten rechts G=64 erscheint.<BR>
            Da die mei&szlig;ten Wandtexturen, die wir benutzen eine Breite von 64
            Pixel haben ist dies ein guter Wert zur Einstellung des Rasterfeldes.<BR>
            Dann dr&uuml;cken wir die <font face="" color="Blue">\</font> Taste so lange bis S=1/2 unten rechts
            erscheint.<BR>
            Das ist der Zoomfaktor der Zeichenoberfl&auml;che.<BR><BR>
            Wir erinnern uns, dass der Editor vier verschiedene Zeichenebenen hat:<BR><BR>
            <font face="" color="Blue">Things</font> f&uuml;r das ganze Inventar, die Gegner und Startpunkte der
            Spieler. Mit Taste <font face="" color="Blue">T</font> zu aktivieren.<BR>
            <font face="" color="Blue">Vertecs</font> f&uuml;r die Koordinatenpunkte mit Taste <font face="" color="Blue">V</font> zu aktivieren.<BR>
            <font face="" color="Blue">Linedefs</font> f&uuml;r die Linien und W&auml;nde mit Taste <font face="" color="Blue">L</font> zu aktivieren.<BR>
            <font face="" color="Blue">Sectors</font> f&uuml;r die einzelnen Sektoren mit Taste <font face="" color="Blue">S</font> zu aktivieren.<BR><BR>
Wie man sieht habe ich die zu dr&uuml;ckenden Tasten in blau geschrieben, dieses werde ich auch so f&uuml;r den folgenden Text beibehalten, damit man genau weiss, welche Taste gemeint ist. Wenn ich also nun z. B. im fortlaufenden Text schreibe "In den Vertex-Mode gehen" bedeutet das halt nur Taste <font face="" color="Blue">V</font> dr&uuml;cken. Es gibt auch noch ein paar andere wichtige Tastaturk&uuml;rzel nachstehend aufgelistet:<br><br>
Mit der Taste <font face="" color="Blue">D</font> kann man ein Vertex oder LineDef an den Mauscursor binden um ihn dann zu verschieben. Nochmaliges dr&uuml;cken auf die Taste <font face="" color="Blue">D</font> hebt die Bindung wieder auf.<br>
Mit der Taste <font face="" color="Blue">M</font> kann man ein Objekt markieren, welches sich gerade unter dem Mauscursor befindet. Nochmaliges dr&uuml;cken auf Taste <font face="" color="Blue">M</font> hebt die Markierung wieder auf.<br>
Mit der Taste INS werden Objekte unter dem Mauscursor eingef&uuml;gt.<br>
Mit der Taste DEL werden Objekte unter dem Mauscursor gel&ouml;scht.<br><br>
Wir f&uuml;gen nun 4 Vertices laut folgendem Bildes ein.<br><br>
			
            
            <DIV align="center">
              <IMG src="ld2a.png" width=447 height=286 border=0 alt="">
            </DIV>
            <BR>
            <BR>
            Nun markieren wir die vier neunen Vertices und dr&uuml;cken Taste <font face="" color="Blue">INS</font> um dort mehrere LineDefs einzuf&uuml;gen. Eine LineDef wird aber nicht gezeichnet. Dehalb gehen wir nochmal in den Vertex-Mode und markieren die beiden Vertices, die noch nicht mit einer Linie verbunden sind und dr&uuml;cken nochmals INS um auch diese LineDef einzuf&uuml;gen. Nun sind wir ja schon im LineDef-Modus. Nun sollte unser Levelausschnitt wie im folgenden Bild aussehen. 
			<BR><BR>
             

            <DIV align="center">
              <IMG src="ld2b.png" width=128 height=96 border=0 alt="">
            </DIV>
            <BR>
            <BR>
			Wir markieren die vier neuen LineDefs und dr&uuml;cken <font face="" color="Blue">INS</font> um sie einen Sektor zuzuweisen. Siehe folgendes Bild.
            <BR><BR>
             
            <DIV align="center">
              <IMG src="ld2d.png" width=128 height=96 border=0 alt=""><BR>
            </DIV>
            <BR><BR>
             Nun erstellen wir noch einen Raum. Daf&uuml;r setzen wir wieder 4 Vertices laut unten stehendem Bild. Wir markieren diese neuen Vertices im Uhrzeigersinn inklusiv der alten unteren beiden Vertices. Dann dr&uuml;cken wir wieder <font face="" color="Blue">INS</font> um die LineDefs eizuf&uuml;gen. Und wieder bleibt eine Strecke offen.<br><br>
            <DIV align="center">
              <IMG src="ld2e.png" width=224 height=246 border=0 alt=""><BR>
              <BR>
            </DIV>
            <BR>Wir zuvor gehen wir in den Vertex-Mode und markieren die beiden Vertices, um danach mit <font face="" color="Blue">INS</font> eine LineDef einzusetzen um das Rechteck zu schliessen.<br><br>
             
            <DIV align="center">
              <IMG src="ld2f.png" width=218 height=246 border=0 alt=""></DIV><BR>
              <BR>
			  Nun markieren alle LineDefs die das obere Rechteck beinhalten und dr&uuml;cken INS um sie einen neuen Sektor zuzuordnen. Da der darunterliegende Sektor, der sp&auml;ter unsere T&uuml;r sein soll, mit 64 Pixel viel zu breit f&uuml;r eine T&uuml;r w&auml;re, werden wir ihn nun einmal teilen. Wir setzten Scale auf 1/1 und Grid auf Grid=16. Nun hat der kleine mittlere Sektor eine h&ouml;he von vier K&auml;stchen, die jeweils 16 Pixel hoch sind. Wir wechseln in den Vertex-Mode und gehen mit unserem Mauscursor auf eine der verticalen Linien und zwar ein K&auml;stchen &uuml;ber der anderen Linie des kleinen Sektors. Nun f&uuml;gen wir dort einen Vertex ein und sagen OK zum Split LineDef. Dieses machen wir auch auf der anderen vertikalen Linie.<br><br>
<DIV align="center">
<IMG src="ld2j.png" width=190 height=126 border=0 alt="">
</DIV>
<br><br>
Nun markieren wir die beiden neuen Vertices und rufen <font face="" color="Blue">MISC</font> im Pulldownmen&uuml; auf. Dort w&auml;hlen wir <font face="" color="Blue">Add LineDef and split sector</font>. Nun haben wir dort zwei Sektoren. Um einen Sektor als T&uuml;r zu definieren gibt es in DEU eine vorhandene Funktion. Wir gehen mit S in den Sector-Mode und markieren den kleineren Sektor. Nun gehen wir wieder bei <font face="" color="Blue">MISC</font> in Pulldownmen&uuml; und w&auml;hlen <font face="" color="Blue">Make door from sector</font>. Nun ist unsere T&uuml;r eigentlich schon fertig. Wir wir unsere T&uuml;r noch versch&ouml;nern k&ouml;nnen und unseren Level mit einem Fenster erweitern k&ouml;nnen zeige ich dann im dritten Teil dieses Workshop.<br><br>
			   Wie auch schon im 1. Teil des Workshop kommt nun der spannende Teil. Funktioniert meine T&uuml;r auch wirklich so, wie ich es mir vorstelle? Wir k&ouml;nnen dies nun wieder anhand von DoomAttack testen. Bitte dazu nun unseren Level test.wad in den
            Ordner von DoomAttack kopieren.<BR>
            Dann das Icon DoomAttack_Clickme anw&auml;hlen.<BR>
            Danach im CLI in den Ordner von DoomAttack.<BR>
            Einen Stack von 100000 einrichten.<BR>
            Nun wird DoomAttack im CLI wie folgt aufgerufen: doomattack -file
            test.wad<BR>
            Dann ein neues Spiel mit Episode 1 starten und wenn alles geklappt hat
            sollten wir uns in unserem gerade erstellten Raum befinden. Eine Drehung von 90 Grad nach links und wir stehen vor unserer gerade eingesetzten T&uuml;r. Wen wir nun knapp davor stehen dr&uuml;cken wir die Space-Taste. Wenn uns nun kein Fehler unterlaufen ist, sollte sie sich &ouml;ffnen. Wir k&ouml;nnen nun hindurch gehen und uns umdrehen. Und nun beobachten wir wie sie sich gerade wieder schliesst. Hier ist der Fertige Level <a href="TEST2.WAD">Test2.WAD</a> .<BR><BR>
             

            <TABLE align="CENTER" cellspacing="0" cellpadding="0"
            summary="">
              <TR>
                <TD><IMG src="ld2g.png" width=320 height=200 border=1 alt="" style="border-color: Red;"></TD>

                <TD><IMG src="ld2h.png" width=320 height=200 border=1 alt="" style="border-color: Red;"></TD>
              </TR>
            </TABLE>
            <BR>
             <FONT face="" size="+2" color="Red">Schlusswort:</FONT><BR>
            <BR>
            Ich hoffe ich habe mich auch diesmal verst&auml;ndlich ausgedr&uuml;ckt.<BR>
            F&uuml;r Anregungen und Fragen bin ich unter meiner E-Mail Adresse
            <a href="mailto:spezis@terra.es">spezis@terra.es</a> erreichbar.<BR><BR>
            DEU sowie auch DoomAttack gibt es im Aminet.<BR><BR>
            
             Euer Spezi<BR><BR>

            <TABLE border="5" cellspacing="1" cellpadding="5" align="CENTER" summary="">
              <TR>
                <TD>Rainer Wrieden</TD>

                <TD>E-Mail: <A href="mailto:spezis@terra.es">spezis@terra.es</A></TD>
              </TR>
            </TABLE>
            <A href="javascript:history.back()"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A> 
          </TD>
        </TR>
      </TABLE>
    </DIV>
    <BR>
  </BODY>
</HTML>

