<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA8.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA10.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>9. Kurzmeldungen</H2>
<UL>
<LI> In der M&auml;rz-Ausgabe der Zeitschrift Com-Digit hat der Software-Hersteller
  Corel offenbar angek&uuml;ndigt, das Programmpaket Corel Office in einer
  Version f&uuml;r den Amiga der n&auml;chsten Generation auf den Markt zu bringen.
</LI>
<BR><LI> Im Moment ist nicht ganz klar, ob AMIGA das geplante Entwicklersystem
  weiterhin mit einem &quot;Amiga auf einer Karte&quot; f&uuml;r den PCI-Steckplatz
  ausliefern wird. AMIGA-Pr&auml;sident Jim Collas hat angedeutet, dass Amiga-
  PCI nicht definitiv gestrichen worden sei. Zuvor verlautete aus Kreisen
  des in das Projekt involvierten Siamese Systems Limited, dass AMIGA das
  PCI-Projekt aufgegeben habe.
</LI>
<BR><LI> AMIGAs Internet-Homepages <A HREF="http://www.amiga.de" TARGET="_TOP">http://www.amiga.de</A> und <A HREF="http://www.amiga.com" TARGET="_TOP">http://www.amiga.com</A>
  sind neuerdings inhaltlich identisch. Gestaltet wird das Angebot von
  Matthias Grohmann, einem Mitarbeiter der deutschen AMIGA-Niederlassung.
</LI>
<BR><LI> Die AMIGA-Offiziellen sind unterschiedlicher Auffassung dar&uuml;ber, wer die
  Schuld am bisherigen Stillstand tr&auml;gt. W&auml;hrend Petro Tyschtschenko, der
  Leiter der deutschen AMIGA-Niederlassung, in einem Interview indirekt die
  ehemalige F&uuml;hrung der amerikanischen Entwicklungsabteilung mit daf&uuml;r
  verantwortlich machte, die etwa gegen die Entwicklung des Amiga OS 3.5
  gewesen sei, sieht AMIGA-Pr&auml;sident Jim Collas im Mutterkonzern Gateway
  den Schuldigen, der den Amiga nicht genug unterst&uuml;tzt h&auml;tte. Jeff
  Schindler, ehemals Chef von AMIGA, Inc., tr&auml;fe keine Schuld.
</LI>
<BR><LI> In demselben Interview hat Petro Tyschtschenko bekannt gegeben, dass
  Jim Collas noch in diesem Monat nach Deutschland kommen wird.
</LI>
<BR><LI> Es ist die Rede davon, dass eine inoffizielle Alpha-Version des Amiga OS
  3.5 bereits in diesem Monat erscheinen soll, f&uuml;r Mai sei eine erste Beta-
  Version geplant. Die Auslieferung des Amiga OS 3.5 an Endkunden soll im
  August starten.
</LI>
<BR><LI> Laut der 'Frequently asked questions' (FAQ) von AMIGA zum Amiga OS 3.5
  ist f&uuml;r das Betriebssystemupgrade ein Verkaufspreis von 49,95 US-Dollar
  bzw. 98 Mark vorgesehen. Wer jetzt einmal umrechnet, wird bemerken, dass
  in diesem Fall die amerikanischen K&auml;ufer das Amiga OS 3.5 deutlich
  g&uuml;nstiger erwerben k&ouml;nnten als die deutschen bzw. europ&auml;ischen Anwender,
  die ca. zehn bis f&uuml;nfzehn Mark mehr zahlen m&uuml;ssten. Sollten die Pl&auml;ne
  tats&auml;chlich so umgesetzt werden, stellte dies eine sehr fragw&uuml;rdige
  Preispolitik dar, da kaum damit zu rechnen ist, dass sich bis August ein
  Wechselkurs von 2 Mark pro US-Dollar ergibt.
</LI>
<BR><LI> Auf <A HREF="http://ugn.amiga.org/events/audio/amiga99/" TARGET="_TOP">http://ugn.amiga.org/events/audio/amiga99/</A> l&auml;sst sich nun die von
  Jim Collas auf der Amiga 99 gehaltene Rede in den Formaten MP3 und ADPCM3
  herunterladen.
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="AMIGA8.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA10.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
