<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Diverse Neuigkeiten</H1>
<H2>1. Kostenloses Java2-Paket angek&uuml;ndigt</H2>
<P>
Nordic Global, der Hersteller des TCP/IP-Stacks Miami, hat f&uuml;r den Sommer
dieses Jahres ein komplettes und in der Standardversion kostenloses Java-
Paket f&uuml;r den Amiga angek&uuml;ndigt. Hier die Presseerkl&auml;rung:
</P>
<P>
&raquo;DaytonaTM ist ein komplettes JavaTM 2-Laufzeitsystem f&uuml;r AmigaOS,
basierend auf der &quot;Java 2 Platform&quot; von Sun Microsystems, Inc. Es besteht
aus den folgenden Teilen:
</P>
<P>
DaytonaTM-Hauptpacket, welches ohne Geb&uuml;hren frei erh&auml;ltlich ist. Neben
anderen Dingen unterst&uuml;tzt Daytona im einzelnen:
</P>
<UL>
<LI> Die komplette Java 2 API und deren Klassen, direkt aus Sun's
  Implementation abgeleitet und deshalb zu 100% kompatibel zu den
  offiziellen Java-Spezifikationen und Versionen (im Gegensatz zu einigen
  anderen Java-Interpretern f&uuml;r das AmigaOS).
</LI>
<BR><LI> Multithreading, unter Verwendung einer native Amiga Implementation. Keine
  Unix-Code-Emulation oder sonstige Bibliotheken erforderlich.
</LI>
<BR><LI> Datei und socket I/O (multithreaded) inklusive multicasting, URL
  Abwicklung und Unterst&uuml;tzung diverser Internetprotokolle
</LI>
<BR><LI> AWT(Abstract Windows Toolkit): Das Grundpacket Daytona enth&auml;lt AWT
  Laufzeitklassen, allerdings ohne direkte Unterst&uuml;tzung von amigaOS-
  Screens. AWT-Verbindungen f&uuml;r amigaOS-Screens sind im DaytonaPLUS-Paket
  enthalten.
</LI>
<BR><LI> JFC (Java Foundation Class): Swing,Java2D.
</LI>
<BR><LI> COBRA
</LI>
</UL>
<P>
Das DaytonaDEVTM-Paket, ebenfalls ohne Geb&uuml;hr erh&auml;ltlich. DaytonaDEV ist
f&uuml;r Entwickler gedacht, die ihre eigenen Javascripts schreiben und diese in
Java-bytecode kompilieren wollen. DaytonaDEV enth&auml;lt folgende Einzelheiten:
</P>
<UL>
<LI> Java-bytecode-compiler: Startup-Routinen und alle ben&ouml;tigten Klassen.
</LI>
<BR><LI> Verschiedene Tools (Bytecode-Disassembler, Dokumentationsgenerator,
  Archiv-Management-Tools usw.)
</LI>
</UL>
<P>
Das DaytonaPLUS-Paket wird als Shareware ver&ouml;ffentlicht. Der genaue Preis
wird zu einem sp&auml;teren Zeitpunkt bekannt gegeben. DaytonaPLUS ist ein
unabh&auml;ngig von Daytona entwickeltes Add-on, welches zus&auml;tzliche
amigaspezifische Leistungen bietet:
</P>
<UL>
<LI> AWT bindings f&uuml;r direkte AmigaOS-Screens inkl. Unterst&uuml;tzung f&uuml;r
  CyberGraphX und Picasso96 high/true-color Screens.
</LI>
<BR><LI> BOOPSI &quot;Look-and-feel&quot; f&uuml;r Swing
</LI>
<BR><LI> Applet API und Laufzeitsystem mit eigenem Applet Viewer, und eine
  dokumentierte Applet API Bibliothek, welche es erlaubt, mittels Daytona
  AmigasOS Web-Browsern mit Applet API Unterst&uuml;tzung auszustatten.
</LI>
<BR><LI> PowerPC-Unterst&uuml;tzung, f&uuml;r PowerUP und WarpUP (noch nicht v&ouml;llig
  entschieden)
</LI>
<BR><LI> JIT (Just-In-Time) Compiler f&uuml;r 68K und PPC
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r vorcompilierte native (68k und PPC) Versionen aller
  Standard Java Klassen. Daytona und DaytonaDEV enthalten eine komplette
  Bibliothek mit 68K/PPC-vorkompilierten Klassen f&uuml;r die Benutzung unter
  DaytonaPLUS.
</LI>
</UL>
<P>
Alle Leistungsmerkmale sind noch eventuellen &Auml;nderungen unterworfen, nicht
alle Features m&uuml;ssen in der ersten Version realisiert sein.
</P>
<P>
Daytona, DaytonaDEV und DaytonaPLUS sind Warenzeichen von Nordic Global
Inc. Java und alle Java-basierenden Zeichen sind Warenzeichen oder
eingetragene Warenzeichen von Sun Microsystems, Inc. in den USA und anderen
L&auml;ndern. Nordic Global Inc., Daytona, DaytonaDEV und DaytonaPLUS sind von
Sun Microsystems, Inc. unabh&auml;ngige Produkte.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Sven Dr&ouml;ge.
(Quelle: Nordic Global)
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
