<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Vorwort</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Main.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Intern.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Vorwort
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Vorwort</H1>
<P>
Willkommen zur neuen Ausgabe von AMIGA aktuell.
</P>
<P>
Der Monat M&auml;rz verlief genauso spannend, wie der Februar geendet hatte. Mag
es nun am neuen Amiga-Chef Jim Collas liegen oder nicht: Innerhalb weniger
Tage hat sich soviel &Ouml;ffentlichkeitswirksames ereignet, wie bei Amiga (bzw.
dessen Vorg&auml;ngerfirmen) schon lange nicht mehr.
</P>
<P>
Die eher langweiligen und tristen Monate der letzten Zeit scheinen also
vorbei zu sein...
</P>
<P>
Aber auch Phase 5, von vielen schon mitten im Absprung vom AMIGA gesehen,
hat sich zur&uuml;ckgemeldet und eine PowerPC-G3/G4-Karte angek&uuml;ndigt - unter
der Voraussetzung, dass es mindestens 100 Vorbestellungen gibt. Ob die
jedoch bei einem Verkaufspreis von knapp 2000 Mark zusammenkommen werden,
erscheint zumindest fraglich.
</P>
<P>
Im M&auml;rz gab es Zuwachs bei den Amiga-Hardwareherstellern zu vermelden: Das
bislang nicht im Amiga-Markt engagierte Hildesheimer Unternehmen Metabox,
ehemals gegr&uuml;ndet unter dem Namen Pios, hat PowerPC-G3-Karten f&uuml;r die
Amiga-Rechner A1200, 2000, 3000 und 4000 angek&uuml;ndigt.
</P>
<P>
Im vergangenen Monat fand aber noch ein weiteres wichtiges Ereignis statt,
jedoch, wie schon seit einigen Jahren, ohne AMIGA-Beteiligung (und deshalb
ohne Berichterstattung in AMIGA aktuell): Die weltgr&ouml;&szlig;te Computermesse
CeBIT. So wie es im Moment aussieht, wird sich das aber im n&auml;chsten Jahr
&auml;ndern - zumindest dann, wenn AMIGA bis dahin ein funktionsf&auml;higes Modell
des Amigas der n&auml;chsten Generation pr&auml;sentieren kann. Denn in diesem Fall
wird das Unternehmen zweifellos nicht um diese Messe herumkommen - und
AMIGA aktuell als Berichterstatter auch nicht...
</P>
<P>
Die Interna der heutigen Ausgabe:
</P>
<UL>
<LI> Karl-Heinz Bader hat das 'Hannoversche Amiga Magazin' (HAM), in dem jeden
  Monat eine Textversion von AMIGA aktuell enthalten war, eingestellt.
</LI>
<BR><LI> Im Archiv auf <A HREF="http://www.mediaspace.net/amigaaktuell" TARGET="_TOP">http://www.mediaspace.net/amigaaktuell</A> lassen sich nun alle
  &auml;lteren AMIGA-aktuell-Ausgaben ab Januar 1997 herunterladen bzw. online
  betrachten.
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Zu den regelm&auml;&szlig;igen Aufrufen:&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Wir suchen jemanden, der eine eigenst&auml;ndige AMIGA-aktuell-Rubrik f&uuml;hren
  will, in der &uuml;ber Software-Updates informiert wird. Monat f&uuml;r Monat
  erscheinen bekanntlich unz&auml;hlige FD- und kommerzielle AMIGA-Programme in
  neuen Versionen. Ziel dieser neuen Rubrik ist es, die wichtigsten
  Verbesserungen von neuen Software-Updates aufzulisten.
  Wer hat Interesse, sich darum zu k&uuml;mmern?
</LI>
<BR><LI> Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden
  Test-Vorschl&auml;ge, ist aber zu nichts verpflichtet.
<P>
  Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests kommerzieller
  Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener FD-Software.
  Schreibt an <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A> .
</P>
</LI>
</UL>
<P>
Viel Spa&szlig; jetzt bei dieser Ausgabe,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Main.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Intern.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
