<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. AMIGA ver&ouml;ffentlicht Informationen zum AmigaNG</H2>
<P>
AMIGA hat Mitte Oktober eine Sammlung von Informationen, haupts&auml;chlich zum
AmigaNG, herausgegeben:
</P>
<P>
&raquo;Was alles geschieht bei AMIGA?
</P>
<UL>
<LI> Die n&auml;chste Computer-Revolution
</LI>
<BR><LI> Der Beginn der Zukunft
</LI>
<BR><LI> Der Neue Amiga
</LI>
<BR><LI> Eigenschaften des Amiga Digital Environment
     (des digitalen Amiga-Umfelds)
</LI>
<BR><LI> Unterst&uuml;tzung der Originalger&auml;tehersteller (OEMs)
</LI>
<BR><LI> Die Amiga-Gemeinschaft
</LI>
<BR><LI> Programme, die z.Zt. f&uuml;r AMIGA entwickelt werden
</LI>
<BR><LI> Der AmigaOne
</LI>
</UL>
<P><B>Die n&auml;chste Computer-Revolution</B></P>
<P>
In der Welt laufen dramatische Umw&auml;lzungen ab. Firmen f&uuml;r
Verbraucherelektronik f&uuml;gen ihren Erzeugnissen traditionelle
Computereigenschaften hinzu und Computerfirmen statten ihre Erzeugnisse mit
traditionellen Eigenschaften der Verbraucherelektronik aus. Diese
chaotische Kluft muss &uuml;berwunden werden und Amiga ist die Br&uuml;cke, die
hin&uuml;ber leitet und Verbraucher, Firmen f&uuml;r Verbraucherelektronik und
traditionelle Computerfirmen in die richtige Richtung zusammen f&uuml;hrt.
</P>
<P>
<B>Amiga - Der Beginn der Zukunft</B>
</P>
<P>
Im Jahre 1985 wurde der Amiga A1000 der Welt vorgestellt, die so etwas nie
zuvor gesehen hatte. Die Menschen staunten! W&auml;hrend der n&auml;chsten 15 Jahre
kauften Einzelpersonen, Familien und Firmen Millionen von Amigas und
lernten eine ganz neue Welt der Computerei kennen. Seit damals haben die
Amiga-Anwender die Computertechnik f&uuml;r Alle mit revolution&auml;ren Ideen,
sch&ouml;pferischen Realisierungen und innovativen Vorst&ouml;&szlig;en ver&auml;ndert und alles
das war nur m&ouml;glich durch die Eleganz und Unkompliziertheit des Amiga-
Computers.
</P>
<P>
Die &uuml;brige Industrie hatte 15 Jahre lang versucht, mit dem Amiga gleich zu
ziehen. Nun werden sie es nie mehr schaffen.
</P>
<P><B>Der neue Amiga</B></P>
<P>
Heute sollte die Computertechnik nicht an eine bestimmte Hardware gebunden,
sondern inhaltsorientiert sein. Ein Computer sollte so arbeiten, wie wir es
wollen und nicht anders herum. Er sollte einfach zu verwenden sein, seine
Eigenschaften sollten anpassbar sein und die Bed&uuml;rfnisse eines Jeden
erf&uuml;llen. Der Anwender sollte einfachen Zugang zu allem Wichtigen haben,
ohne dass er sich um Notwendigkeiten oder Kompatibilit&auml;ten des
Betriebssystems k&uuml;mmern muss.
</P>
<P>
Die heute ge&uuml;bte Strategie, f&uuml;r verschiedene Ger&auml;te verschiedene
Betriebssysteme zu bieten, ist mangelhaft und kann nicht zum Erfolg f&uuml;hren.
Es muss ein sinnvoll zusammenh&auml;ngendes, anpassbares Betriebssystem
geschaffen werden, das brillianten Multimedia-Betrieb auf allen
unterst&uuml;tzten Erzeugnissen bietet, vom mobilen Telefon (Handy) bis zum
Multiprozessor-Server.
</P>
<P>
Wir bei AMIGA, Inc. mit unserem Partner The Tao Group, Inc. entwickeln eine
neue Art von Betriebssystem, das so gr&uuml;ndlich anders und umw&auml;lzend neu ist,
dass daf&uuml;r ein neuer Name angemessen ist: The Digital Environment (DE)
(digitale Umgebung, digitales Umfeld).
</P>
<P>
Es ist endlich Zeit f&uuml;r ein anpassungsf&auml;higes, leicht verwendbares Digital
Environment, welches die Entwicklung von neuer Programmideen f&ouml;rdert und
komfortable, intuitive Eigenschaften und Funktionen bietet.
</P>
<P>
<B>Eigenschaften des Amiga Digital Environment</B>
</P>
<UL>
<LI> &quot;Write Once - Run Everywhere&quot; -- &quot;Einmal schreiben, &uuml;berall
     laufen&quot; -- Diese Aussage gibt die Sehnsucht aller m&uuml;den und
     verdrossenen Entwickler wieder . Der neue Amiga wurde entworfen,
     um diese Hoffnungen zu erf&uuml;llen und den Entwicklern nie zuvor
     erreichbare M&ouml;glichkeiten und Flexibilit&auml;t zu bieten.
</LI>
<BR><LI> Anpassbarkeit -- Weil das neue Amiga DE nicht einmal 5 Megabytes
     gro&szlig; ist, ist es leicht anzupassen und kann in einem Handy oder
     umfangreich erweitert in einem Multiprozessor-Server eingesetzt
     werden. Jede Anwendungsm&ouml;glichkeit, die f&uuml;r den Amiga geschaffen
     wurde, ist 100% bin&auml;rkompatibel. Das hei&szlig;t, dass Entwickler ihre
     Programmgruppen und Anwendungen schaffen und auf genau den Markt
     bringen k&ouml;nnen, den sie bevorzugen.
</LI>
<BR><LI> Systemanpassung durch Software-Entwicklung -- F&uuml;r den Entwickler
     ist der neue Amiga 100% bin&auml;rkompatibel &uuml;ber alle unterst&uuml;tzten
     Plattformen hinweg. Das bedeutet, dass eine Anwendung tats&auml;chlich
     nur einmal geschrieben werden mu&szlig;, um danach in aufgesetzten
     Umgebungen arbeiten zu k&ouml;nnen (sie l&auml;uft aufgesetzt auf einem OS
     oder mit Hilfe eines anderen), wie z.B. Windows, Windows NT, Linux,
     Windows, CE, Palm, Epoc, OS/9, iTron, QNX, VXWorks und anderen.
     Allein diese Tatsache birgt die F&auml;higkeit in sich, die Entwicklung
     von Computerspielen neu zu definieren. Amiga kann auch sein
     gesamtes System mit nativen Versionen des DE f&uuml;r PPC, x.86,
     StrongARM, ARM, Hitachi SH, NEC 85x, M*Core, Mips und anderen
     betreiben.
</LI>
<BR><LI> Amigaentwickler k&ouml;nnen Java, C, C++ oder Amiga VP Assembler bei
     der Schaffung ihrer Programme einsetzen. Diese Flexibilit&auml;t
     erreicht schon eine neue Akzeptanz auf dem Markt, denn &uuml;ber
     1000 Amiga Software Development Kits (echt!) wurden verkauft
     und mit den neuen Erg&auml;nzungen f&uuml;r 3D, Tonverarbeitung und von
     Anwendern bereitgestellten APIs wird das SDK immer mehr zur
     Entwicklerplattform der ersten Wahl.
</LI>
</UL>
<P><B>Unterst&uuml;tzung der Originalger&auml;tehersteller (OEMs)</B></P>
<P>
F&uuml;r die Hardware-OEMs ist Amiga ein Operationssystem, das eine anpassbare
L&ouml;sung und die F&auml;higkeit bietet, die von ihnen gew&uuml;nschte Hardware zu
w&auml;hlen und anzuwenden. Diese Auswahl ist m&ouml;glich aus mindestens 25
verschiedenen CPU-Architekturen, die in wenigstens 10 verschiedenen
Betriebssystem-Umgebungen arbeiten. Und nat&uuml;rlich werden auch
Multiprozessor-Systeme unterst&uuml;tzt.
</P>
<P>
Dazu kann das Amiga DE in nicht mehr als 2 bis 3 Monaten auf neue CPU-
Architecturen &uuml;bertragen werden, im Gegensatz zu den 6 bis 18 Monaten, die
bei traditionellen Betriebssystemen zur &Uuml;bertragung auf eine neue CPU-
Architektur notwendig sind. Das ergibt deutliche Kosteneinsparungen und
hohe Flexibilit&auml;t f&uuml;r die Hardware-OEMs.
</P>
<P>
Ein weiterer Vorteil f&uuml;r die Hardware-OEMs ist die Verwirklichung neuer
Programmideen. Wenn sich neue M&auml;rkte entwickeln, und diese Entwicklung
findet zur Zeit statt, dann erfolgt das im Bereich neuer Programmformen,
bei denen der Amiga wirklich die Angebots-Palette der OEMs erweitern kann.
Durch die Anwendung des Amiga DE kann ein Hardware-Hersteller Produkte mit
einem viel gr&ouml;&szlig;erem Leistungsumfang bereitstellen, als ein anderer, der das
Amiga DE nicht einsetzt. Stellen Sie Sich nur den Hersteller einer Set-Top-
Box vor, der mit seinem System nicht nur vollen Internet-Zugang und
Unterst&uuml;tzung der heimischen Unterhaltungsger&auml;te bietet, sondern auch noch
spannende Spiele, Java-Anwendungen, F&auml;higkeiten zur Video-Bearbeitung und
die M&ouml;glichkeit zum Programmieren.
</P>
<P>
Das Amiga DE erlaubt es dem OEM, alle diese Dinge in einem umfassenden,
anpassbaren Betriebs-Umfeld zu erledigen, das nicht nur die Kommunikation
im eigenen Bereich &uuml;bernimmt, sondern auch mit jedem anderen mit dem System
verbundenen Ger&auml;t, das das Amiga DE benutzt.
</P>
<P><B>Die Amiga-Gemeinschaft</B></P>
<P>
AMIGA, Inc. ist nicht die typische junge, aufstrebende Firma: Sie f&uuml;hrt
schon ein weltweit bekanntes Markenzeichen, das gleichbedeutend ist mit
Einfachheit bei Anwendung und Multimedia. Die Entwicklergemeinschaft des
Amiga z&auml;hlt nach Zehntausenden und ver&ouml;ffentlicht fast t&auml;glich neue Soft-
und Hardware.
</P>
<P>
Viele der heute bekannten AAA-Spielegesellschaften, wie Psygnosis, Sierra,
Westwood, Lucas Arts, Team 17 und andere begannen auf der Amiga-Plattform
und freuen sich sehr auf die Perspektiven mit dem neuen Amiga. Entwickler
erinnern sich gern an die Bl&uuml;tezeit des klassischen Amigas und k&ouml;nnen kaum
den Tag erwarten, wenn die Software-Entwicklung wieder so einfach und
elegant wie damals sein wird. Viele Anwender erinnern sich daran, dass ihr
Amiga kaum abst&uuml;rzte, schnell bootete, nahtlos Animationen darstellte und
sein M&ouml;glichkeiten wirkungsvoll ausn&uuml;tzte. Der neue Amiga wird alles dieses
wieder zu uns bringen.
</P>
<P>
Mit der Ver&ouml;ffentlichung des Amiga SDK fingen Entwickler in der ganzen Welt
an, neue Anwendungen zu erschaffen. Zu den mehr als 45 000 Titeln, die f&uuml;r
den Amiga zur Verf&uuml;gung stehen - viele davon sind gute Kandidaten f&uuml;r die
Portierung zum Neuen Amiga -, werden die im folgenden aufgez&auml;hlten Produkte
zur Zeit direkt zum neuen Amiga Digital Environment &uuml;bertragen.
</P>
<P>
Amiga DE - Programme, die &uuml;bertragen werden. Stand 14.9.2000
</P>
<P><B>Video / Bildbearbeitung</B></P>
<P>
Art Effect<BR>
Motion Studio<BR>
Candy Factory<BR>
Fantastic Dreams<BR>
Taifun<BR>
Art Studio NG<BR>
</P>
<P><B>Verwaltungs- und Schreib-Programme</B></P>
<P>
Burn It Pro<BR>
Amiga Writer<BR>
Espial Assistant<BR>
Papyrus<BR>
Star Office<BR>
</P>
<P><B>Desktop Publishing</B></P>
<P>
Pagestream<BR>
Repro Studio NG<BR>
</P>
<P>
Internet / IM / E-mail
</P>
<P>
Messenger Force<BR>
Ebox<BR>
IMAP Force<BR>
Escape<BR>
</P>
<P><B>Entwicklungshilfen</B></P>
<P>
Storm C<BR>
Rebol<BR>
</P>
<P><B>Datenverwaltungsprogramme</B></P>
<P>
Pointbase Embedded Database<BR>
ThinAccess Realtime DB Access<BR>
</P>
<P><B>Spiele</B></P>
Soldier of Fortune<BR>
Sin<BR>
Heretic 2<BR>
Freespace<BR>
Alien Nations<BR>
Alien Nations Mission<BR>
Shogo<BR>
Worms Armageddon<BR>
Battle for the 3rd Moon<BR>
Evils Doom<BR>
Exodus: the Last War<BR>
The Feeble Files<BR>
Earth 2140<BR>
Simon the Sorcerer<BR>
Gorky 17<BR>
Foundations Edge<BR>
Operation Counterstrike<BR>
Magick<BR>
Dweebs<BR>
Die Volkor<BR>
Gilbert Goodmate<BR>
Bubble Heroes<BR>
Earth 2150<BR>
Dafel: Bloodline<BR>
Tales of Tamar<BR>
Aqua<BR>
Alien Nations 2<BR>
Majesty<BR>
Pacific Wars<BR>
Air Kit Dogfight Sudden Strike<BR>
Jagged Alliance 2<BR>
Jagged Alliance Mission<BR>
Nomads<BR>
Wizzardy<BR>
Echelon: The Storm<BR>
Claws of the Devil<BR>
Blood 2<BR>
Descent: Freespace<BR>
Homeland<BR>
Payback<BR>
Wipeout 2097<BR>
Dark Soul<BR>
Last Patriot<BR>
Scavengers<BR>
Hell Squad<BR>
Escape Towards Unknown<BR>
Virtual Ball Fighters<BR>
Eat the Whistle<BR>
Command and Conquer<BR>
Great Nations<BR>
Lambda Sector<BR>
Moonbases<BR>
Salvage<BR>
Phoenix<BR>
Mario 64<BR>
Dead Walk<BR>
Foundation: Directors Cut<BR>
Holy Trinity<BR>
Final Fantasy 5<BR>
Recovery 2190<BR>
Grand Theft Auto<BR>
<P><B>Der AmigaOne</B></P>
<P>
Sehr bald wird die Welt den n&auml;chsten Amiga (den AmigaOne) kennen lernen und
die Anwender werden staunen &uuml;ber die einfache Handhabung und seine
Leistung. Endlich wird die Welt wieder ein Betriebssystem (oder Digital
Environment) zur Verf&uuml;gung haben, dass der weltweiten digitalen Revolution
die Mittel bietet, um alle Benutzer anzusprechen.
</P>
<P>
Software-Entwickler werden ihre Programme nur einmal schreiben m&uuml;ssen und
sie auf Dutzenden verschiedener Betriebssystemen laufen lassen k&ouml;nnen. Das
Amiga DE kann genau an die Bed&uuml;rfnisse eines jeden Ger&auml;tes angepasst
werden, gleichg&uuml;ltig ob es auf dem Mitteilungssystem eines Handys oder der
ausgewachsenen Datenbasis eines Universit&auml;tsrechner l&auml;uft.
</P>
<P>
Anwender und Entwickler m&uuml;ssen sich nur noch an ein Betriebssystem
gew&ouml;hnen, das auf allem arbeitet, vom Informations-Zentrum ihres Autos &uuml;ber
den Tischcomputer an ihrem Arbeitsplatz bis hin zu den heimischen
Unterhaltungsger&auml;ten. Keine l&auml;stige Software-Umstellung, keine
widerspr&uuml;chlichen Standards, keine Kompatibilit&auml;tsprobleme! Es geht auf
Ihrem Heim-Computer, Ihrem Computer am Arbeitsplatz, Ihrem Computer in der
Schule und auf Ihrem Handcomputer, es spielt keine Rolle, welches OS das
Ger&auml;t gerade benutzt.
</P>
<P>
Der Amiga legt die Leistung des Silizium-Chips in die H&auml;nde der Massen,
weil er leicht und schmerzlos zu bedienen ist. Er wird etwas sein, mit dem
sogar Technikfeinde umgehen k&ouml;nnen. Er bietet einfache Bedienung und gibt
das Kommando an den Benutzer zur&uuml;ck, der m&uuml;de ist wie ein Computer denken
zu m&uuml;ssen, um in ben&uuml;tzen zu k&ouml;nnen. Amiga wird den Computer dazu bringen
so zu denken und zu handeln wie wir - m&uuml;helos - und aus der Computerei und
den Computeranwendungen eine leichte, verst&auml;ndliche und erfreuliche
T&auml;tigkeit machen.
</P>
<P>
Wir hoffen, Sie begleiten und auf diesem Weg.
</P>
<P>
Bill McEwen und das &uuml;brige AMIGA-Team&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
