<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues zum AmigaNG</H1>
<H2>1. Erstes neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P><B>&raquo;28. September 2000</B></P>
<P><B>Executive Update</B></P>
<P>
Meine Gr&uuml;&szlig;e an Sie alle.
</P>
<P>
Ich wei&szlig;, dass es schon lange her ist, dass ich die Gelegenheit hatte
Ihnen allen zu schreiben.
</P>
<P>
Wir hatten sehr, sehr viel zu tun, wir erlebten einige gro&szlig;e Erfolge und
einige Entt&auml;uschungen. Ich bin nicht etwa eingeschlafen, im Gegenteil, in
der letzten Zeit bekam ich nicht zu viel Schlaf! Es ereignet sich so viel
und die Zeit ist so knapp, dass ich meistens in anderen Bereichen zu tun
hatte und Sie nicht jederzeit auf dem Stand der Dinge halten konnte.
</P>
<P>
Ich entschuldige mich bei meinen Freunden in Italien, dass ich nicht an
der Ausstellung teilnehmen konnte. F&uuml;r mich pers&ouml;nlich war es eine gro&szlig;e
Entt&auml;uschung, denn ich wollte jeden einzelnen von Ihnen begr&uuml;&szlig;en. Der
Grund ist nicht, dass wir Pleite sind oder kein Geld &uuml;brig haben, wie
ger&uuml;chtweise zu h&ouml;ren sein k&ouml;nnte.
</P>
<P>
Es geschah einfach deshalb, weil zwei Gesellschaften aus Kalifornien, mit
denen ich zusammen gearbeitet habe, ein Treffen w&uuml;nschten, das ausgerechnet
zur gleichen Zeit stattfand. Durch die Arbeit mit diesen OEMs werden wir
einige Millionen weitere Amiga-Freunde gewinnen. Die Besprechungen, die
zus&auml;tzlich zu den in Punkt 3 genannten stattfanden, verliefen g&uuml;nstig und
wir machen gute Fortschritte.
</P>
<P><B>Nun zu den Einzelheiten:</B></P>
<H3>1. Das SDK f&uuml;r Amiga DE (Digital Environment)</H3>
<P>
Die Entwicklung ist erstaunlich und wir freuen uns &uuml;ber die Menge der
Anwendungen und die Zahl der Entwickler, die das Produkt ben&uuml;tzen, um
gro&szlig;artige Sachen zu erschaffen.
</P>
<P>
Die n&auml;chste Version des SDK wird in den n&auml;chsten paar Wochen herauskommen.
Zus&auml;tzlich zur Linux-Version gibt es dann eine Version f&uuml;r Windows. Ja,
es stimmt, Sie k&ouml;nnen nun sowohl auf Linux wie auch auf Windows f&uuml;r den
neuen Amiga entwickeln.
</P>
<P>
Es wird sowohl neue Multimedia- (Mesa, die SSEYO-Koan-Audio-Engine,
Streaming) als auch verbesserte Entwicklungstools, eine umfangreichere
Audio-Video-Engine sowie gesteigerte Performance bieten.
</P>
<H3>2. Amiga OS 3.5 und dar&uuml;ber hinaus</H3>
<P>
Wir behalten weiterhin den derzeitigen Amiga intensiv im Auge und
&uuml;berlegen, wie wir diese Plattform am Besten weiter entwickeln k&ouml;nnen.
Wir diskutieren &uuml;ber neue M&ouml;glichkeiten und werden in allern&auml;chster Zeit
dar&uuml;ber berichten k&ouml;nnen.
</P>
<H3>3. Gesch&auml;ftliche M&ouml;glichkeiten f&uuml;r Amiga DE</H3>
<P>
Toll, das ist ein Bereich, der f&ouml;rmlich explodiert. Das sind gute
Nachrichten f&uuml;r Entwickler! Die Programme, an denen Sie arbeiten, werden
nicht nur von den Mitgliedern der Amiga-Gemeinschaft verwendet werden.
Mit den Vertr&auml;gen, die entweder abgeschlossen sind oder &uuml;ber die noch
verhandelt wird, kommen Millionen Anwender zur Amiga-Familie hinzu.
</P>
<P>
Nun haben viele von Ihnen angefangen zu spekulieren, was an der MeterNet-
Ank&uuml;ndigung dran ist. MeterNet bietet - auch der Amiga-Gemeinschaft - ein
ausgezeichnetes Erzeugnis, aber es ist nicht der AmigaOne.
</P>
<H3>4. Der AmigaOne</H3>
<P>
Wir haben von Ihnen viele Kommentare, Anregungen, Gesch&auml;ftsideen und
technische Vorschl&auml;ge bekommen. Dean Brown war eine gro&szlig;e Hilfe, vor
allem, weil er nun hier in Snoqualmie mit bei der Mannschaft ist.
</P>
<P>
Auf Grund dieser Hinweise haben wir uns auf einen vollkommen neuen Entwurf
geeinigt. Die meisten Einzelheiten sind erarbeitet und ich hoffe, die
endg&uuml;ltige Bekanntgabe bis Mitte Oktober fertig zu haben. Ich glaube
sicher, dass Sie alle sich dar&uuml;ber sehr freuen und staunen werden.
</P>
<H3>5. H&auml;ndler/Distributoren, und unsere Freunde von der Presse:</H3>
<P>
Die Quelle an Informationen f&uuml;r Sie alle war zu d&uuml;rftig und inkonsequent.
Um alle und jeden von Ihnen besser mit Informationen zu versorgen, hat
AMIGA zwei neue Mailinglisten eingerichtet. Bitte rufen Sie
<A HREF="http://www.amigadev.net/index.php?sid=" TARGET="_top">http://www.amigadev.net/index.php?sid=</A>&amp;subpage=home&amp;function=showmaillists
auf oder gehen Sie zu <A HREF="http://www.amigadev.com" TARGET="_top">http://www.amigadev.com</A> und w&auml;hlen Sie dort &quot;Mailing
Lists&quot; auf der rechten Seite des Bildschirms. W&auml;hlen Sie entweder &quot;Press&quot;
(Presse) oder &quot;Dealer&quot; (H&auml;ndler) und geben Sie Ihre Daten ein. Wir werden
w&ouml;chentlich Meldungen an diese Listen richten, um unsere Presse und
H&auml;ndler besser zu unterst&uuml;tzen.
</P>
<P>
Ich wei&szlig;, dass viele von Ihnen diesen Brief so interpretieren werden,
dass er gar nichts aussagt und dass gar nichts passiert.
</P>
<P>
Nun, damit liegen Sie sehr falsch! Wir verhandeln direkt mit den K&ouml;pfen
einiger der gr&ouml;&szlig;ten Firmen f&uuml;r Computer und Verbraucher-Elektronik der
Welt, und sie erkennen nicht nur die Qualit&auml;t unserer Angebote, sondern
auch, dass Sie, die Amiga-Gemeinschaft, den wahren Wert darstellen.
</P>
<P>
Nun haben wir immer noch ein gutes St&uuml;ck Weg vor uns, aber wir bewegen
uns sehr schnell und ich wei&szlig;, dass Sie alle sehr stolz auf AMIGA sein
werden, w&auml;hrend wir die Dinge vorantreiben.
</P>
<P>
Die gr&ouml;&szlig;te Herausforderung ist f&uuml;r AMIGA jetzt, dass wir uns auf unsere
eigentlichen St&auml;rken konzentrieren und nicht die Fehler wiederholen,
die unsere Vorg&auml;nger machten.
</P>
<P>
Die M&ouml;glichkeiten f&uuml;r AMIGA sind immens und manchmal &uuml;berw&auml;ltigend.
Dadurch gibt es sehr viele sich widersprechende Berichte, aber ich kann
leider dar&uuml;ber mit Ihnen allen nicht so sprechen, wie ich es gern
w&uuml;rde.
</P>
<P>
Wir kommen unserem Ziel jeden Tag viel n&auml;her, und jeder von Ihnen hat
einen bedeutenden Anteil am Erfolg der Amiga-Familie.
</P>
<P>
Bill McEwen und die ganze AMIGA-Mannschaft&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
