<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. &Uuml;bersicht: Der neue AmigaOne und das AmigaDE (von Stefan Czinczoll)</H2>
<P>
Das Amiga Digital Environment soll mehr bieten als herk&ouml;mmliche
Betriebssysteme. Es zielt in eine Richtung, der in Fachkreisen immer mehr
Bedeutung einger&auml;umt wird f&uuml;r die Zukunft von Rechneranwendungen: N&auml;mlich
die Nutzung verteilter Ressourcen innerhalb eines Systems. Dementsprechend
finden sich auf der untersten Ebene des AmigaDE, n&auml;mlich der physikalischen
Schicht, s&auml;mtliche Hardware-Ger&auml;te: Festplattenspeicher, Prozessor(en),
Sound- und Grafikkarten, Drucker, etc.
</P>
<P>
Auf der n&auml;chsten Ebene finden sich die Komponenten, welche aktuell von der
TAO-Gruppe entwickelt werden: Das Elate REAL-Time OS, das AVE (Audio Visual
Environment) und das von SUN zertifizierte Java Runtime Environment. Dazu
kommen weitere von Amiga entwickelte Komponenten, wie das Amiga Object
Model und eine Portierung der bekannten Mesa-3D Grafik-Bibliotheken. Diese
Schicht bildet die Amiga Foundation Layer.
</P>
<P>
Zus&auml;tzlich wird an einer neuen Programmiersprache gearbeitet, welche das
Arbeiten in der Kommandozeile direkt (aka Shell), den Einsatz als
Skriptsprache, zur Proze&szlig;kontrolle und Anwendungsentwicklung erm&ouml;glichen
soll. Der vorl&auml;ufige Name dieser Eigenentwicklung lautet &quot;Sheep&quot;. Zudem ist
auf der Webseite von REBOL eine experimentelle Version dieser Sprache f&uuml;r
Elate zu finden.
</P>
<P>
Die n&auml;chste Schicht bietet mit dem Amiverse eine echte qualitative
technische Neuerung: Das Amiverse ist ein digitaler Datenraum, welcher sich
auf eine einzelne Maschine oder &uuml;ber beliebig viele Rechner erstrecken
kann. Hierin kann der Benutzer alles tun, was man sich innerhalb von
Computern vorstellen kann: Ausf&uuml;hrung von Anwendungen, Import/Export von
Datenobjekten, Produktion und Konsumierung digitaler Inhalte, etc.
</P>
<P>
Diese Entwicklung zusammengenommen mit dem Konzept des Virtuellen
Prozessors von TAOs Elate kann man sicher ohne &Uuml;bertreibung als kleine
technische Revolution bezeichnen. Amiga sollte sich diesmal nicht scheuen,
eine offensive Werbestrategie zu fahren, sobald das System steht und
pr&auml;sentabel ist. Ist dies doch einer der wenigen Aspekte, wo der neue Amiga
dann noch Schw&auml;chen gegen&uuml;ber der gro&szlig;en Konkurrenz hat.
</P>
<P>
Zu sch&ouml;n um wahr zu sein? Gut, hier kommen die unangenehmen Nachrichten:
Laut Eytech ist die Benutzung eines G3/G4-Prozessors fast unabdingbar, um
in den Genuss des Amiverse zu kommen. Immerhin sollen bei Other World
Computing noch G3-Prozessoren mit 266Mhz f&uuml;r 35$ erh&auml;ltlich sein
(www.macsales.com).
</P>
<P>
Sowohl f&uuml;r die Emulation des Classic-AmigaOS wie f&uuml;r den Einstieg in das
AmigaDE ist erstmal ein G3/G4-Board als Voraussetzung anzusehen. Als
Alternative soll es m&ouml;glich sein, das AmigaDE auf ein Linux-System
aufzusetzen. Dies ist aber sicher nur ein schwacher Trost f&uuml;r alle User,
die sich f&uuml;r viel Geld eine Blizzard/CyberstormPPC-Karte unterhalb von G3
zugelegt haben, zumal es noch keine Linux-Variante gibt, die z.B. den SCSI-
Controller der Cyberstorm vern&uuml;nftig unterst&uuml;tzt.
</P>
<P>
F&uuml;r alle, die eh vorhaben, sich einen neuen Rechner zuzulegen, ist der
AmigaOne aber auf jeden Fall eine gute Wahl.
</P>
<P>
Bei Amiga selbst finden sich unter dem Namen &quot;Zico&quot; folgende
Spezifikationen:
</P>
<UL>
<LI> AmigaDE kompatibler Host-Prozessor (PPC, x86, Arm, SH4, MIPS)
</LI>
<BR><LI> 64 MB Hauptspeicher
</LI>
<BR><LI> Matrox Grafikkarte der n&auml;chsten Generation
</LI>
<BR><LI> Creative EMU10K1 PCI Soundkarte
</LI>
<BR><LI> 10 GB Festplatte
</LI>
<BR><LI> CD/DVD Laufwerk
</LI>
<BR><LI> PCI USB 1.0 Karte f&uuml;r Drucker, Scanner, Tastatur, Maus, ...
</LI>
<BR><LI> Firewire (IEEE1394) f&uuml;r Videobearbeitung
</LI>
<BR><LI> 10/100 MBit Ethernet Netzwerkkarte
</LI>
<BR><LI> 56k Modem
</LI>
<BR><LI> 2 freie PCI-Slots
</LI>
</UL>
<P>
Wie es aussieht, wird es den AmigaOne als Erweiterung f&uuml;r den 1200 und
A4000 und zus&auml;tzlich als eigenst&auml;ndigen Rechner geben.
</P>
<P>
F&uuml;r das AmigaDE bleibt nur zu hoffen, da&szlig; die Benutzung der
Blizzard/Cyberstorm-Hardware und bestehender SCSI-Komponenten nochmals
&uuml;berdacht wird oder eine entsprechend gute Einbindung z.B. in APUS-Linux
erfolgt.
</P>
<P>
Insgesamt bleibt das AmigaDE sicher eine der spannendsten aktuellen
Entwicklungen auf dem sich rasch entwickelnden Rechnermarkt.
</P>
<P><B>Links:</B></P>
<P>
<A HREF="http://www.rebol.com/xpers/xpers.html" TARGET="_top">http://www.rebol.com/xpers/xpers.html</A>
</P>
<P>
<A HREF="http://www.macsales.com/" TARGET="_top">http://www.macsales.com/</A>
</P>
<P>
<A HREF="http://www.amiga.com/products/one/specs.shtml" TARGET="_top">http://www.amiga.com/products/one/specs.shtml</A>
</P>
<P>
<A HREF="http://www.amiga.com/products/one/faq.shtml" TARGET="_top">http://www.amiga.com/products/one/faq.shtml</A>
</P>
<P>
<A HREF="http://www.amiga.com/press/zine/8-1-00/AmigaDE/" TARGET="_top">http://www.amiga.com/press/zine/8-1-00/AmigaDE/</A>
</P>
<P>
<A HREF="http://www.eyetech.co.uk/NEWS/AMIGA001.HTM" TARGET="_top">http://www.eyetech.co.uk/NEWS/AMIGA001.HTM</A>
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
