<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Petro Tyschtschenko geht in den Ruhestand</H2>
<P>
&raquo;Liebe Freunde, Kollegen und Amiganer-Gef&auml;hrten
</P>
<P>
Traurig und schweren Herzens gebe ich mein baldiges Ausscheiden aus der
Amiga-Gemeinde in den Ruhestand bekannt. Wie Sie alle unzweifelhaft wissen,
war ich &uuml;ber fast zwanzig Jahre ein treuer F&ouml;rderer der Amiga-Plattform,
seit diese in den fr&uuml;hen 80er Jahren das erste Mal &ouml;ffentlich von Commodore
vorgestellt worden war. Sp&auml;ter, in den schwierigen Zeiten mit Commdore und
Escom, arbeitete ich mit vielen von Ihnen ohne Rast, um 'den Traum am Leben
zu erhalten'. Nun, da das neue Jahrtausend d&auml;mmert, ist es Zeit f&uuml;r einige
von uns &auml;lteren Amiganern die Fackel an die zu &uuml;berreichen, die noch die
Energie haben den Amiga vorw&auml;rts zu bringen.
</P>
<P>
Auch wenn diese liebevollen Erinnerungen in meinen Gedanken an erster
Stelle stehen, so ist dennoch f&uuml;r mich die Zeit gekommen von der B&uuml;hne
abzutreten. Mit Wirkung zum Ende diesen Jahres werden wir alle T&auml;tigkeiten
in Deutschland einstellen und alle B&uuml;ros in Deutschland schlie&szlig;en. Ich
erwarte, dass bis dahin alle Lagerbest&auml;nde an fertigen Produkten fast
ausverkauft sein werden. Bis Ende M&auml;rz n&auml;chsten Jahres werde ich mich um
die Einzelheiten der Schlie&szlig;ung k&uuml;mmern. Ich werde mich auch weiterhin um
Ihre Anstrengungen sorgen, so gut ich eben kann und es sich mit meinem
Ruhestand in Einklang bringen l&auml;&szlig;t. Ich hoffe, Sie alle k&ouml;nnen mir von
Herzen alles Gute w&uuml;nschen.
</P>
<P>
Bitte richten Sie sich in der Zwischenzeit mit allen Fragen und in allen
Belangen an Bill McEwen und seine Mitarbeiter in Amerika. Ich werde diesen
vertrauensvoll verbunden bleiben, um das weitere Streben der Amiganer
&uuml;berall Wirklichkeit werden zu lassen.
</P>
Petro Tyschtschenko<BR>
D-63225 Langen, Germany<BR>
23 October 2000&laquo;<BR>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs/AIDA
(<A HREF="http://www.amiga-club.de/aida/" TARGET="_top">http://www.amiga-club.de/aida/</A>) und wurde uns freundlicherweise f&uuml;r eine
Ver&ouml;ffentlichung in AMIGA aktuell zur Verf&uuml;gung gestellt.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P>
Nun noch ein paar pers&ouml;nliche Worte von AMIGA aktuell: Petro Tyschtschenko
hat sich jahrelang um den Amiga bem&uuml;ht und war f&uuml;r die Anwender ein
st&auml;ndiger Ansprechpartner. Er hat sich deshalb seinen Ruhestand redlich
verdient. Petro, wir w&uuml;nschen Ihnen f&uuml;r die Zukunft alles Gute.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
