<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Zweites neues Executive Update von AMIGA-Pr&auml;sident Bill McEwen</H2>
<P><B>&raquo;21 Oktober 2000</B></P>
<P><B>Liebe Amiga-Familie:</B></P>
<P>
W&auml;hrend ich dies schreibe befinde ich mich auf dem R&uuml;ckflug von der ACE
2000 Amiga-Show in Melbourne in Australien, wo ich zwei wundervolle Tage
verbracht habe. Es war wirklich ein gro&szlig;es Vergn&uuml;gen und eine Freude all
diese wunderbaren Mitglieder der Amiga-Familie in diesem Land zu treffen
und ich freue mich sehr auf die n&auml;chste Gelegenheit Australien zu
besuchen.
</P>
<P>
Ganz besonders m&ouml;chte ich mich bedanken bei den H&auml;ndlern, Entwicklern und
Endanwendern, die an den Seminaren teilnahmen und den hunderten von ihnen,
die beim Bankett waren. Amiga ist wahrhaftig eine globale Familie, ein
Ph&auml;nomen das viel zu wenig bekannt ist. Es ist die Amiga-Familie, die
dieses erstaunliche System am Leben erhalten hat und wachsen lie&szlig;.
</P>
<P>
Ich m&ouml;chte mir einen Moment Zeit nehmen den Anstrengungen der Leute
Annerkennung zu gew&auml;hren, die meinen Aufenthalt in Australien ganz
besonders zu einer erfreulichen und lehrreichen Erfahrung werden lie&szlig;en.
Jeff Rose von Unitech, dem Lieferanten f&uuml;r d'Amiga in Australien, und
Basil Flinter, dem Sekret&auml;r der Amiga Down Under Group, oder ADUG. Ich
m&ouml;chte ihnen daf&uuml;r danken, dass sie sich die zus&auml;tzliche Zeit genommen
haben, mir dabei zu helfen wirklich zu verstehen, was Australien und Neu
Seeland f&uuml;r Amiga bedeuten und was Amiga tun kann, unserer, seiner Familie
dort zu helfen. Ich kann sicher sagen, dass ich mir auf meiner n&auml;chsten
Reise Zeit f&uuml;r einen Besuch und ein pers&ouml;nliches Hallo in Neu Seeland
nehmen werde.
</P>
<P><B>Kommende Produtke</B></P>
<P>
Es geschehen viele aufregende Dinge mit Amiga und ich wollte der ganzen
Amiga-Gemeinde erz&auml;hlen, was die Teilnehmer der ACE 2000 auf der Show
erfahren haben.
</P>
<P>
Amiga wird ein Upgrade f&uuml;r das Classic AmigaOS herausbringen! Version 3.9
des AmigaOS wird zur Wheinachtszeit fertig sein und ausgeliefert werden.
AmigaOS 3.9 wird zusammen mit der Haage und Partner GmbH entwickelt. Eine
neue Webseite speziell f&uuml;r OS3.9 wird in k&uuml;rze online sein, die eine
Feature-Liste des OS und andere n&uuml;tzliche Informationen enthalten wird. OS
3.9 wird f&uuml;r die Anwender von Classic-Amigas zum erschwinglichen Preis von
unter 40 US-Dollar erh&auml;ltlich sein. Beobachten sie unsere Haupt-Webseite
www.amiga.com f&uuml;r weitere Einzelheiten zu OS 3.9 und der neuen Webseite
dazu.
</P>
<P>
Da Amiga noch immer eine Wohlwollende Diktatur darstellt und keine
Demokratie oder sogar Republik, achten wir sehr auf R&uuml;ckmeldungen und
Eingaben aus der Gemeinde. Basierend auf diese R&uuml;ckmeldungen bem&uuml;hen wir
uns, Produkte zu schaffen die Sie haben m&ouml;chten, die Sie brauchen und die
Sie erfreuen.
</P>
<P>
Wir freuen uns der Gemeinde die Erste aus einer Reihe neuer Hardware
anzuk&uuml;ndigen, die von Amiga gestaltet und bald von Amiga-OEM-Partner
hergestellt werden wird. Die ersten Produkte aus unserer AmigaONE-Reihe
werden die AmigaONE PPC 1200 und das AmigaONE PPC 4000 Karten von Eyetech
sein. Diese Produkte werden f&uuml;r Entwickler im Dezember verf&uuml;gbar sein und
sind f&uuml;r die speziellen Bed&uuml;rfnisse der Amiga-Gemeinde gestaltet worden.
Wir haben auch noch einen anderen Partner angek&uuml;ndigt, die bPlan GmbH,
welche dabei ist einen neuen, auf AmigaONE PPC basierenden
Desktop-Computer zu erstellen.
</P>
<P>
Mehr Einzelheiten &uuml;ber bPlan, Eyetech und die neuen AmigaONE-Produkte
werden in K&uuml;rze erscheinen. Besuchen Sie also die AmigaONE Webseite unter
www.amiga.com/products/one/pr.shtml um auf dem Laufenden zu bleiben.
</P>
<P>
Ich m&ouml;chte auch neue Versionen des Amiga SDK ank&uuml;ndigen. AmigaSDK Version
1.1 wird ab dem 24. Oktober 2000 ausgeliefert werden. Wir freuen uns
zus&auml;tzlich zu einem Upgrade f&uuml;r die Linux-Version, ebenfalls eine Version
des Amiga SDK f&uuml;r Windows herauszugeben.
</P>
<P>
Im Executive Update vom 28. September war ein Fehler enthalten. Amiga SDK
1.1 wird nicht Teile f&uuml;r Sound, UI bzw. 3D enthalten, wie f&auml;lschlich in
dem Update geschrieben stand. Diese werden in Version 1.2 zu finden sein,
welche in K&uuml;rze herauskommen wird. Dieser Fehler tut mir leid, aber es
beruhigt mich die Tatsache, dass Erwerber eines Amiga SDK &uuml;ber einen
Zeitraum von 12 Monaten ab Kaufdatum kostenlose Updates und Upgrades
erhalten.
</P>
<P><B>M&ouml;gliche Investitonsbeteiligung der Amiga-Gemeinde:</B></P>
<P>
Die M&ouml;glichkeit einer Beteiligung an Amiga war eine weitere Ank&uuml;ndigung in
Melbourne. Seit der Ank&uuml;ndigungen der Pl&auml;nde und der Strategie von Amiga
Inc. erreichten uns kontinuierlich Anfragen und Angebote zu Investitionen
in Amiga.
</P>
<P>
Wir bei Amiga haben versucht Wege zu finden, Ihnen f&uuml;r all ihre
Anstrengungen und Ihren fortdauernden Glauben an das was wir tun, etwas
zur&uuml;ck zu geben. Wir untersuchen derzeit eine Methode, mit der wir der
Gemeinde 10% von Amiga &uuml;ber eine Beteiligung (Registration A filing)
anbieten k&ouml;nnen. Wir haben nicht dar&uuml;ber entschieden, ob wir dies tun
werden oder nicht, doch bis jetzt haben wir uns viele M&ouml;glichkeiten genau
angesehen und dies scheint eine gro&szlig;artige Wahl zu sein.
</P>
<P>
Wir untersuchen dies ernsthaft, doch bevor wir diesen Weg noch weiter
verfolgen, m&ouml;chten wir sehen was die Gemeinde von dieser Idee h&auml;lt. Wir
haben eine E-Mail-Adresse eingerichtet an die uns Mitglieder der
Amiga-Gemeinde ihr Interesse schreiben k&ouml;nnen: <A HREF="mailto:investor@amiga.com.">investor@amiga.com.</A> Wir
halten Ausschau nach Investitionen von nicht weniger als 250 US-Dollar.
Wenn Sie daran interessiert sind, schicken Sie uns bitte eine
E-Mail-Nachricht in der Sie uns den Betrag mitteilen, den Sie investieren
m&ouml;chten.
</P>
<P>
Jedes Land hat seine eigenen Gesetze f&uuml;r Beteiligungen. Sie sollten sich
also mit lokalen Fachleuten in Verbindung setzen, um zu erfahren welche
Vorschriften f&uuml;r Sie gelten. Da jede Investition ein Risiko beinhaltet,
ermutigen wir jeden den Plan, den Werbeprospekt und eigene Risiken dieses
Angebots - falls vorhanden - zu lesen, bevor sich jemand f&uuml;r eine
Investition entscheidet.
</P>
<P><B>Schlu&szlig;wort</B></P>
<P>
Seit wir Amiga Incorporated gegr&uuml;ndet haben sind 10 erfreuliche Monate
vergangen. Die Gemeinde hat die Auslieferung des Amiga SDK gesehen, ein
Upgrade des SDK, ein Upgrade des Classic AmigaOS und jetzt die Ank&uuml;ndigung
von drei auf PPC basierenden AmigaONE-Produkten. Noch immer haben wir einen
weiten Weg zu gehen und noch viele Schlachten sind zu schlagen, aber ich
bin &uuml;berzeugt, dass der Amiga, mit der Gemeinde hinter uns, und wenn die
Verbesserungen an der Produktlinie weitergehen, eine lange und aufregende
Zukunft vor sich hat.
</P>
<P>
F&uuml;r die Mitglieder der User-Gruppen auf der ganzen Welt ist dies die Zeit
damit zu beginnen, die Mitglieder, die abgetrieben wurden, zu rufen und
sie wissen zu lassen was mit dem neuen Amiga passiert. Wir m&ouml;chten, dass
sie erfahren, dass sie wieder Teil der Weiterf&uuml;hrung des Verm&auml;chtnises
Amiga sein k&ouml;nnen.
</P>
<P>
Noch einmal Dank an Greg und Michael und die Tausende von Amiganern in
Australien, die die ACE 2000 zu einem so gro&szlig;artigen Ergeignis haben
werden lassen.
</P>
<P>
Get Boinged! [Anm. d. &Uuml;bersetzers: Ich w&uuml;rde das mit &quot;Hab't amigam&auml;&szlig;ig viel
Spa&szlig;! &uuml;bersetzen. ;-)]
</P>
<P>
Bill McEwen und der Rest des Amiga-Teams&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs/AIDA
(<A HREF="http://www.amiga-club.de/aida/" TARGET="_top">http://www.amiga-club.de/aida/</A>) und wurde uns freundlicherweise f&uuml;r eine
Ver&ouml;ffentlichung in AMIGA aktuell zur Verf&uuml;gung gestellt.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
