<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Beitrag: &raquo;Betriebssystem? - Mir doch egal!&laquo; (von Dirk Wenk)</H2>
<P>
So oder so &auml;hnlich antworten es die meisten Web-User, wenn man sie auf
andere Betriebsysteme hin anspricht und fragt, warum diese denn nicht mal
ausprobiert bzw. benutzt worden sind.
</P>
<P>
Na, man mu&szlig; die Leute ja auch verstehen.
</P>
<P>
Was brauche ich f&uuml;rs Web? Einen Browser, der alles versteht, ein E-Mail-
Programm und etwas zum Chatten!
</P>
<P>
Das alles findet man unter Windel, MacOS und Linux.
</P>
<P>
Die Browser anderer Betriebsysteme sind nicht sooo gut zu gebrauchen - das
gilt leider auch f&uuml;r unseren Amiga.
</P>
<P>
Im Grunde w&uuml;rde den meisten dann ja eine Dreamcast reichen! Konsole,
Tastatur und Maus gibt's zusammen f&uuml;r unter 500 DM.
</P>
<P>
Doch die Software ist alles andere als geeignet zum Surfen (gemeint ist der
1.0 Browser, mit 2.0 soll es ja besser werden). Also bleibt nur noch ein
PC, Mac oder ein Rechner mit Linux drauf. Warum Linux? Weil es daf&uuml;r auch
gute Browser gibt!
</P>
<P>
Aber so ganz unwichtig ist das Betriebssystem nat&uuml;rlich nicht! Jeder, der
mit seinem Amiga surft, d&uuml;rfte den Unterschied zum Win PC merken. OK, man
hat nicht alle Funktionen, die das Web bietet und man st&ouml;&szlig;t immer &ouml;fter auf
Websites, die absolut nicht zu lesen sind mit ihrem Javascript &amp; Co.! Aber
daf&uuml;r kann man auf seinem 060 schneller und bequemer surfen als auf einer
500Mhz-Intel-Kr&uuml;cke!
</P>
<P>
Und genau da k&ouml;nnte der neue Amiga einschlagen! Eine tolle Software, die so
gut ist, dass, wenn sie z.B. auf einer Dreamcast, PSX2, X-Box (he he he)
oder dem Game Cube installiert ist, man damit surfen usw. kann, ohne
neidisch auf die M&ouml;glichkeiten der gro&szlig;en PCs zu schauen!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Und Spiele gibt's ja auch dort genug.&nbsp;</TD><TD VALIGN="TOP">;)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Und die Zukunft?</B></P>
<P>
Die geht in Richtung &quot;Mobile Computing&quot;! Keiner wird mehr einen Rechner
unter oder auf dem Tisch haben wollen, wo ein Prozessor drin werkelt, der
gro&szlig; ist, viel Strom fri&szlig;t und gleichzeitig die Heizung ersetzt!
</P>
<P>
In nicht allzu ferner Zeit werden wir mit mobilen Webpads unterwegs sein,
mit denen man &uuml;berall und jederzeit ins Web kommt und man braucht auch
keinen gro&szlig;en PC mehr, weil das kleine Ding einfach alles kann!
</P>
<P>
Die neuesten Programme, Spiele und Tools kommen direkt aus dem Netz.
Nat&uuml;rlich mu&szlig; man auch einen guten Zugang haben - im Moment sind wir aber
genau auf dem falschem Weg. Immer mehr Flatrates sterben aus...
Soviel zur Internet-Zukunft Deutschlands ... :-\
</P>
<P>
Aber wir leben in dieser Zeit, und so bleibt mir wohl nix anderes &uuml;brig,
als auf meinem Amiga Linux zu installieren, um gescheit surfen zu k&ouml;nnen.
Zum Gl&uuml;ck hab ich noch einen 2. Amiga im Netzwerk, sonst g&auml;be das eine
Katastrophe! ;)
</P>
<P>
Was meint ihr dazu? Wie werden die Computer der Zukunft aussehen? Mehr dazu
auch in meinem n&auml;chsten Artikel. ;)
</P>
<P><B>Dirk Wenk &lt;<A HREF="mailto:dw@teleservice.com">dw@teleservice.com</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
