<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Am letzten Gewinnspiel haben 36 Leser teilgenommen.
</P>
<P>
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr
bereits mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Welcher deutsche Amiga-Softwarehersteller hat vor kurzem&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">die Rechte an den Programmen STFax und Genesis &uuml;bernommen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
Antwort: Gesucht war die Firma Haage &amp; Partner.
<BR>
<BR>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Die oben gesuchte Firma hat ihren Sitz heute in Glash&uuml;tten.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Bis vor circa zwei Jahren befand er sich jedoch in einem&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">anderen Ort. In welchem?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Fr&uuml;her befand sich der Firmensitz von Haage &amp; Partner in 61191&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Rosbach v.d.H.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">AMIGA-Vizepr&auml;sident Petro Tyschtschenko hat vor kurzem ein&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">eigenes Unternehmen gegr&uuml;ndet. H&auml;ltst du es f&uuml;r richtig,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">dass er nun bei zwei Firmen in leitender Position t&auml;tig ist&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">oder sollte er sich aus einem der Unternehmen zur&uuml;ckziehen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<B>Die Auswertung:</B>
<BR>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Ja.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">24&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Nein.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">11&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ein Teilnehmer konnte sich nicht entscheiden.
</P>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Uwe Eichhorn hat nichts gegen Petro Tyschtschenkos zweiten Job einzuwenden:
&raquo;Petro steht das &quot;Recht&quot; zu, sich f&uuml;r die Zeit nach dem Verkauf des letzten
Amiga Classic bzw. f&uuml;r den (x.) Fall des Scheiterns des AMIGA-ONE-Projektes
(Aufkauf der Geldgeber des Projektes durch Microsoft) sich ein 2. Standbein
zu schaffen. Sorry, ich w&auml;re traurig.&laquo;
</P>
<P>
Ralph Moser macht eine Einschr&auml;nkung: &raquo;Er soll ruhig bei zwei Firmen in
leitender Position t&auml;tig sein, sofern sein Job bei Amiga nicht darunter
leidet.&laquo;
</P>
<P>
Dirk Wachtel sieht bei dieser Sache kein Problem: &raquo;Man kann zwar nicht
Diener zweier Herren (=Firmen) sein, aber in diesem Fall gehe ich davon
aus, dass Petro sich seiner Aufgabe und Verantwortung bei AMIGA bewusst ist
und er sich sicher den zuk&uuml;nftigen Erfolg (hoffentlich!) nicht nehmen
l&auml;sst. Denn das sinkende Schiff kann er ja nicht verlassen, schlie&szlig;lich
liegt es ja schon im Mariannengraben....&laquo;
</P>
<P>
Christian Busse differenziert: &raquo;1, falls es sich (seiner Aussage
entsprechend) so verh&auml;lt, da&szlig; er lediglich stiller Teilhaber ist. 2, falls
er in dieser Firma tats&auml;chlich aktiv engagiert sein sollte und hierdurch
seinen vertraglichen Verpflichtungen Amiga, Inc. gegen&uuml;ber nicht im n&ouml;tigen
Ma&szlig;e nachkommen kann.&laquo;
</P>
<P>
Wolf Zimmer hat keine Bedenken: &raquo;Warum sollte Petro nicht auf Nummer Sicher
gehen? Seit sechs Jahren gibt es von Amiga nur offizielle L&uuml;gen und
Hinhaltungen. Und wenn sogar unser derzeitiger Bundeskanzler seine
Aufsichtsratsposten bei einem gro&szlig;en nieders&auml;chsischen Automobilkonzern und
bei einem Versorgungsunternehmen, Abteilung Kernkraft, weiterf&uuml;hren darf,
weil angeblich keine Interessenkollisionen vorhanden sind, warum sollte
nicht auch Petro in die Zukunft schauen d&uuml;rfen?&laquo;
</P>
<P>
Fritz Trampnau stimmte mit Antwort 2 und schreibt ferner: &raquo;Schwer zu sagen,
wie derzeit &uuml;berhaupt die aktuelle AMIGA-Lage einzusch&auml;tzen ist! Was
erwartet uns? Wieder mal eine lange Wartezeit, im Krankenhaus &quot;AMIGA&quot;. Der
&quot;Patient&quot; liegt immer noch auf der Intensivstation. Zustand: Weiterhin
kritisch. Immerhin ist eine neue Herz-Lungen-Maschine angeschafft worden,
und eine neue &Auml;rzte-Crew versucht verzeifelt, das Leben des
daniederliegenden Genies zu erhalten! Gefahr droht vor allem von au&szlig;en: Das
&quot;Imperium($)&quot; und seine &quot;Verb&uuml;ndeten&quot;, haben nat&uuml;rlicherweise keinerlei
Interesse am einer Genesung des Schwerkranken, w&uuml;rde doch dann die Welt
erfahren, wie einfach und gut Computer sein k&ouml;nnen - und wie leicht sie zu
bedienen sind! Aber warten wir's ab - der Moloch lebt schlie&szlig;lich nicht
ewig!&laquo;
</P>
<P>
Dirk Neubauer sieht die Sache gelassen: &raquo;Jeder muss schlie&szlig;lich selbst
wissen, wo und wieviel er arbeiten m&ouml;chte. Wenn Petro T. eine eigene Firma
gr&uuml;ndet, ist das seine pers&ouml;nliche Sache. Er tr&auml;gt das Risiko. Wenn er der
Meinung ist, er sei mit der Stellung bei Amiga nicht ausgelastet und k&ouml;nne
mehr leisten, dann wird er schon seine Gr&uuml;nde haben. Vielleicht will er ja
auch nur ein zweites Standbein haben...&laquo;
</P>
<P>
&Auml;hnlich beurteilt das Guido Bruns: &raquo;Jedem seinen Weg, wenn Petro etwas
meint tun zu m&uuml;ssen, wer von uns hat das Recht, ihm das zu verbieten.&laquo;
</P>
<P>
Denis Zwornarz ist die Frage gleichg&uuml;ltig: &raquo;Ist mir eigentlich egal. Oder
war da etwas in letzter Zeit, da&szlig; er 'f&uuml;r' den AMIGA gemacht hat? Mir
fallen da nur sehr viele Worte von ihm ein, aber nur sehr wenige
Umsetzungen.&laquo;
</P>
<P>
Andreas Wolf sieht den Zweitjob als konsequent an: &raquo;Jeder wei&szlig; ja, wie
Petro zu den Pl&auml;nen von Amiga Inc. steht. Daher ist es nur logisch, da&szlig; er
sich nach einer Alternative umsieht, denn was passiert, wenn die
Restbest&auml;nde an alter AMIGA-Hardware aufgebraucht sind, ist ebenfalls
logisch.&laquo;
</P>
<P>
Martin Henke ist gegen die Doppelbesch&auml;ftigung: &raquo;Es spricht IMHO nichts
dagegen, da&szlig; P.T. eine eigene Firma gr&uuml;ndet. Nur ist es so, da&szlig; man nicht
in zwei Firmen leitende Positionen innehaben kann, ohne da&szlig; es fr&uuml;her oder
sp&auml;ter zu Interessenkonflikten kommt. Daher sollte P.T. sich &uuml;berlegen, f&uuml;r
welche der beiden Firmen er weiterhin t&auml;tig sein will.&laquo;
</P>
<P>
Gernod Schomberg stellt folgende Frage: &raquo;Ist er bei AMIGA wirklich
&quot;leitend&quot;?
Seine Verdienste um das System &quot;Amiga&quot; sind nicht zu bestreiten. Vielleicht
h&auml;tten wir alle ohne ihn die &Uuml;berg&auml;nge von einer Pleite-Firma zur anderen
nicht geschafft. Irgendwie hat er immer irgendwelche Verm&ouml;genswerte
zusammengehalten, die es dem n&auml;chsten Interessenten w&uuml;nschenswert
erscheinen lie&szlig;, sich da einzukaufen.
</P>
<P>
Aber war er wirklich mehr als ein Nachlassverwalter? Ist er jetzt, bei der
verst&auml;rkten Zuwanderung von Informationstechnikern, dabei, sich eine
Zukunft aufzubauen? Vielleicht kann er bei diesen Pl&auml;nen f&uuml;r unser System
auch ein gutes Wort einlegen!&laquo;
</P>
<P>
Oliver Tacke stimmte mit Antwort 2, f&uuml;gt aber hinzu: &raquo;Also, eigentlich
h&auml;tte ich bei 3) lieber 1,5 geantwortet, weil es mir ehrlich gesagt
schnuppe w&auml;re, wenn er bei dieser &quot;Power Service&quot;-Agentur wirklich nur
stiller Teilhaber ist, bei Amiga aber weiterhin uneingeschr&auml;nkt
Gesch&auml;ftsf&uuml;hrer bliebe.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Eine deutliche Mehrheit der Teilnehmer hat nichts dagegen einzuwenden, dass
AMIGA-Vizepr&auml;sident Petro Tyschtschenko gleichzeitig bei zwei Firmen
arbeitet. Einige Leser sehen dagegen die Gefahr eines Interessenkonflikts.
Allerdings hat sich das Problem, wenn es eines war, mittlerweile sowieso
erledigt, da Petro Tyschtschenko ja in K&uuml;rze bei AMIGA in den Ruhestand
geht.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &raquo;AFiloFaxPro&laquo;: Fritz Trampnau&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &raquo;ArtEffect 4&laquo;: Henning Schlautmann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x CD-ROM &raquo;Digital Almanac III&laquo;: Christopher Nelling&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x CD-ROM &raquo;Amiga Arena&laquo;: Dirk Neubauer&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
