<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Nightlong ist da!
</LI>
</UL>
<P>
Vor wenigen Tagen war es soweit: Das wohl erste Amiga-Spiel auf
3 CD-ROMs wurde ausgeliefert. Nightlong ist ein Highend Adventure
Spiel und wird voraussichtlich in der n&auml;chsten AMIGA aktuell
Ausgabe ausgiebig unter die Lupe genommen. Mittlerweile wurde auch
schon das erste Update ver&ouml;ffentlicht, welches einige Fehler
beheben soll.
</P>
<UL>
<LI> ACSYS-Demoversion ver&ouml;ffentlicht
</LI>
</UL>
<P>
Diesen Monat wurde endlich eine spielbare Demoversion des Turrican
Klons ACSYS ver&ouml;ffentlicht. Und man kann sagen, dass sich das
Warten auf die Demoversion gelohnt hat. Dazu lest bitte das Preview
in dieser Ausgabe.
</P>
<UL>
<LI> Foundation Gold - Umsonst?
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Das ist in dieser Ausgabe von der AMIGA aktuell m&ouml;glich. Schaut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">einfach mal ins Gewinnspiel. Dort gibt es n&auml;mlich Foundation Gold&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">zu gewinnen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<UL>
<LI> Letzte Worte von CS&amp;E
</LI>
</UL>
<P>
Nachdem schon vor zwei Monaten bekannt wurde, dass sich CS&amp;E
aus dem Amiga-Markt zur&uuml;ckziehen, gab David Connolly jetzt eine
Abschlusserkl&auml;rung ab. Darin erkl&auml;rt er, dass es sich einfach
nicht mehr lohne, kommerziell f&uuml;r den Amiga zu produzieren.
Auch vom neuen Amiga distanziert er sich. Ab sofort werde
CS&amp;E nur noch f&uuml;r den PC produzieren. Wie sich allerdings jetzt
herausstellte, werden die Amiga-Spiele von CS&amp;E doch noch
in Deutschland erscheinen. Dazu wurde ein Vertrag mit Dirk
Harlaar geschlossen, der den Vertrieb &uuml;bernehmen soll.
</P>
<UL>
<LI> Fubar
</LI>
</UL>
<P>
Es gibt seit langem mal wieder etwas neues &uuml;ber Fubar zu
berichten. Das Entwicklungsteam, welches sich nun Bartman
Software nennt, stellte auf ihrer Homepage eine Beta-Version
zum Download bereit. Man muss sich allerdings vor dem Download
registrieren lassen.
</P>
<UL>
<LI> Europa Universalis
</LI>
</UL>
<P>
Die kanadische Firma TribSoft Inc. hat von Paradox Entertainment
die Lizenz erworben, ihr Spiel auf Linux, Mac und Amiga zu
portieren. TribSoft Inc. sind Experten auf dem Gebiet der Linux/Mac
Portierung. Die Amiga-Version wird deswegen Hyperion Software
portieren.
</P>
<UL>
<LI> Earth 2140 Demoversion
</LI>
</UL>
<P>
Eine spielbare Demoversion des langerwarteten Command &amp; Conquer
Klons Earth 2140 ist endlich diesen Monat erschienen. Sie umfasst
lockere 20 Megabyte und ben&ouml;tigt mindestens einen 68040/25mhz
sowie eine Grafikkarte und 24 MB Ram. Ihr k&ouml;nnt in dieser Ausgabe
ein Preview zu der Demoversion lesen.
</P>
<UL>
<LI> Majesty f&uuml;r den AmigaNG
</LI>
</UL>
<P>
Titan Computer hat eine Lizenz zur Umsetzung des Strategiespiels
Majesty auf den AmigaNG erworben. Die technische Umsetzung wird
dabei Hyperion Software &uuml;bernehmen. Majesty soll im Jahr 2001
erscheinen.
</P>
<UL>
<LI> Hellcoders k&uuml;ndigt neues Spiel an
</LI>
</UL>
<P>
Das holl&auml;ndische Entwicklungsteam Hellcoders hat ein neues
Shoot'em'Up mit dem Namen HellFight angek&uuml;ndigt. Das Spiel soll
ein klassisches Shoot'em'Up mit einigen spannenden Zusatzaufgaben
werden. Momentan arbeitet man an der Umsetzung der Grafik und
Zwischensequenzen.
</P>
<UL>
<LI> Exodus
</LI>
</UL>
<P>
Diesen Monat wurde eine spielbare Demoversion des Command &amp; Conquer
Klons Exodus - The Last War ver&ouml;ffentlicht. Die Demoversion
umfasst 14 Megabyte im gepackten Zustand und ich h&auml;tte euch gerne
ein Preview hier pr&auml;sentiert, was allerdings nicht m&ouml;glich war,
da der Server st&auml;ndig &uuml;berlastet war. Den Vertrieb dieses Echtzeit
Strategiespiels wird &uuml;brigens das Unternehmen Blittersoft &uuml;bernehmen.
</P>
<UL>
<LI> The World Foundry
</LI>
</UL>
<P>
The World Foundry scheint sich vom Amiga-Markt abzuwenden, bzw.
allgemein die Foren zu schlie&szlig;en. So meldete die Amiga Future
diesen Monat, dass die Spiele Maim &amp; Mangle und Explorer 2260
jetzt in Eigenregie vom Programmierer Chris Page weiterentwickelt
werden und The World Foundry nicht mehr daf&uuml;r verantwortlich
ist. Desweiteren verschwand dann auch die Website
<A HREF="http://www.worldfoundry.com/" TARGET="_top">http://www.worldfoundry.com/</A>.
</P>
<P>
Es scheint also offensichtlich, dass The World Foundry sich
aufl&ouml;st bzw. das schon getan hat.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
