<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Previews</H2>
<H3>ACSYS</H3>
<P>
Seit l&auml;ngerem arbeiten die Hobbyprogrammierer von Unique schon an
dem Turrican-Clone ACSYS. Das Spiel mit dem seltsamen Namen konnte
die Aufmerksamkeit durch die ver&ouml;ffentlichten Screenshots immer
wieder auf sich lenken. Diesen Monat wurde endlich eine spielbare
Demoversion ver&ouml;ffentlicht. Ich habe diese Demoversion gleich
mal angespielt und war wirklich begeistert. ACSYS wurde einwandfrei
programmiert; die Technik des Spiels steht dem Original-Turrican
wirklich in nichts nach. ACSYS spielt sich sehr fl&uuml;ssig, der
Titelheld kann viele Sonderaktionen, wie einst Turrican. Auch
die Grafik ist durchaus sehenswert und l&auml;uft sehr fl&uuml;ssig. In
einer einzigen Sache wird ACSYS aber voraussichtlich nie mit dem
Original-Turrican mithalten k&ouml;nnen: Die Musik. Meiner Meinung
nach gibt es n&auml;mlich keine genialere Titelmusik als Chris H&uuml;lsbeck's
Turrican-Soundtrack. Aber die Musik ist ja nicht das wichtigste.
</P>
<P>
<A HREF="img/ACSYS1.jpg"><IMG SRC="thumb/ACSYS1.jpg" WIDTH="120" HEIGHT="92" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/ACSYS2.jpg"><IMG SRC="thumb/ACSYS2.jpg" WIDTH="120" HEIGHT="92" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/ACSYS3.jpg"><IMG SRC="thumb/ACSYS3.jpg" WIDTH="120" HEIGHT="92" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Leider ist das Erscheinen von ACSYS alles andere als sicher:
Da die Entwickler sich versichern wollen, dass das fertige
Spiel auch gekauft wird, m&uuml;ssen mindestens 500 Vorbesteller
vorhanden sein, die bereit sind, das Spiel f&uuml;r 59,- DM zu
kaufen. Man kann also nur hoffen, dass diese Zahl erreicht
wird. Eine Bereicherung f&uuml;r den Amiga-Markt w&auml;re das Spiel
auf jeden Fall.
</P>
<H3>Gegen&uuml;berstellung: Exodus &lt;=&gt; Earth 2140 (von Robert Schwandner)</H3>
<H3>Exodus - The Last War</H3>
<P>
Ich hatte schon die erste Demo gespielt und mir fiel daran die
&uuml;berragende Intelligenz (?) der Gegner sowie meiner eigenen
Einheiten auf. Sobald eine gegnerischer Angriff stattfand und
sich die unterlegenen Einheiten zur&uuml;ckzogen, marschierten meine
Einheiten ohne Befehl brav hinterher ins Feuer der danach
anr&uuml;ckenden Einheiten oder der Abwehrt&uuml;rme. Auch stehen sich
die Einheiten des &ouml;fteren selbst im Wege. Beim neuen Demo gibt
es viele neue Einheiten zu bestaunen, z.B. den Br&uuml;ckenleger. Ist
aber die Br&uuml;cke einmal gelegt, ist sie nicht mehr abzubauen oder
zu vernichten. Man merkt das in diesem Spiel, besonders in den
Grafiken zwar sehr viel Liebe und Energie steckt, aber dabei ist
man bei manchen Dingen &uuml;ber das Ziel hinausgeschossen. Das die
Grafiken sehr bunt sind, ist zwar relativ (Ansichtssache)
sch&ouml;n, aber im Spiel selbst erschwert dies ungemein die &Uuml;berischt.
Die Einheiten des Gegners und die eigenen sind im Gefecht nicht
leicht auseinanderzuhalten. Auch die Landschaft ist mir pers&ouml;nlich
etwas zu bunt geraten. Auch die in einigen Dingen umgedrehte
Mausbedienung tr&auml;gt nicht gerade zu meiner Begeisterung bei.
</P>
<P>
So, dies war der erste Streich. Der zweite folgt zugleich:
</P>
<H3>Earth 2140</H3>
<P>
Nachdem ich die kpl. 4 Demolevel durchgespielt habe, was ja keine
Kunst ist, komme ich zu folgendem Urteil. Die Gegner von Exodus
gaben sich wenigstens M&uuml;he aktiv anzugreifen. Bei Earth warten
sie meistens bis sie angegriffen werden. Bei einem Level waren
sogar 3 gegnerische Hauptquartiere vorhanden. Ganz gem&uuml;tlich konnte
ich eins nach dem anderen zermalmen oder wie die Aufgabe war
einnehmen. Anders kann man es nicht ausdr&uuml;cken. Auch der Nebel
(beschr&auml;nkte Sicht &uuml;ber das Spielfeld) ist von der Theorie besser
umgesetzt wie bei Napalm. Vorher erkundetes Gebiet ist bei Abzug
nur noch beschr&auml;nkt einsehbar. D.h. das man nach Abzug der eigenen
Einheiten keine neuen gegnerischen Einheiten mehr sieht. Was aber
seltsam ist, das man au&szlig;erhalb dieses beschr&auml;nkten Sichtkreises von
gegenerischen Einheiten angegriffen wird und die eigenen Einheiten
zur&uuml;ckschie&szlig;en, ohne das man selbst die Gegner sieht. Wie soll man
da strategisch handeln?
Hier ist die Grafik im Prinzip sehr gut gelungen. Klar und
&uuml;bersichtlich, soweit man sich an Gr&uuml;ne Einheiten auf Gr&uuml;ner Wiese
gew&ouml;hnt hat. Die Grafik-Effekte bei den Explosionen und Laser- und
Raketenbeschu&szlig; legen gegen&uuml;ber Napalm nochmal zu. Was mir aber
pers&ouml;nlich immer noch nicht den Bedarf einer Grafikkarte erkl&auml;rt.
Bei der sichtlich vorhandenen Farbanzahl, h&auml;tte dieses Spiel locker
in 8-Bit laufen k&ouml;nnen. Napalm lief auf meinen Amiga (Konfiguration
unten) in NTSC-Highres-Interlace problemlos. Halt ich habe ja was
vergessen, dieses Spiel wurde ja von Windooofs r&uuml;bergezogen. Dies
d&uuml;rfte einiges erkl&auml;ren.
</P>
<P>
Da meine Zeit f&uuml;r solche Tests sehr begrenzt ist (Familie, Sport,
usw) kann ich leider keine Screenshots in meinem Test einbauen.
Aber f&uuml;r diejenigen Amiga-User, die die Hardwarevorraussetzungen
f&uuml;r diese Spiele erf&uuml;llen d&uuml;rfte dies ja kein Problem. Auf der
Seite eines Kollegen (<A HREF="http://home.t-online.de/home/r_team/" TARGET="_top">http://home.t-online.de/home/r_team/</A>) ist
ebenfalls ein Test &uuml;ber diese Spiele mit Screenshots zu sehen.
Diese Tests sind aber unabh&auml;ngig voneinander entstanden.
</P>
<P>
Sollten sich bei den Spielen diese Punkte zum Erscheinen der
Vollversion nicht ge&auml;ndert haben, sehe ich keinen Grund diese
mir zuzulegen. Obwohl ich ein Fan dieses Genres bin, werde ich
mein Geld nicht zum Fenster rausschmeissen. Ich warte dann
lieber auf den Nachfolger des amtierenden Echtzeitstrategiek&ouml;nigs.
</P>
<P>
Come on, Napalm 2.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
