<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>7.2. PD-Tests (von Malte Mende)</H1>
<H2>Persons in History</H2>
<P>
Alle Welt glaubt immer, dass es das einfachste f&uuml;r einen Programmierer
ist, einen Tetris oder PacMan Clone zu programmieren. Viel einfacher ist
jedoch ein Quiz, da dieses keinerlei k&uuml;nstliche Intelligenz, ja nicht mal
Grafik oder Sound braucht. Das hat sich wohl auch der werte Herr Lee
Hesselden gedacht. Bei diesem simplen Spielchen muss man erraten, welche
Erfindung welcher Erfinder in welchem Jahr gemacht hat. Dies wird ziemlich
schnell langweilig, egal ob man die Antworten kennt oder nicht. F&uuml;r
Wissensdurstige gibt es praktischerweise eine kleine Datenbank &uuml;ber
Erfinder und Erfindungen. Diese ist allerdings wirklich klein und auch
auf Englisch. Bei der Grafik war ebenfalls Schmalhans K&uuml;chenmeister,
auf Sound muss man ganz verzichten.
</P>
<P>
Netterweise l&auml;uft das ganze auch noch auf einem Interlace Screen, eure
Augen werden euch dankbar sein, wenn ihr den 'Quit' Knopf dr&uuml;ckt ;-)
Es sei denn, ihr habt einen Flickerfixer...
</P>
<P>
Ich h&auml;tte nie gedacht, dass ich sowas mal sagen w&uuml;rde, aber der Download
ist verschwendete/s Zeit/Geld.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">PiH&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Lee Hesselden&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">4 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">kein Sound&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">2 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Subjektiver Gesamteindruck vom Redakteur: 2 von 10 Punkten
</P>
<H2>Detris</H2>
<P>
Dies ist wohl eine der besten Tetrisvarianten f&uuml;r den Amiga. Es gibt,
im Gegenteil zu anderen Clones, viele Optionen, die nur darauf warten,
von euch verstellt zu werden. So gibt es unter anderem gr&ouml;&szlig;ere und
kleinere Kl&ouml;tze als bei dem Original, man kann die Gr&ouml;&szlig;e des Spielfeldes
einstellen, sowie den Schwierigkeitsgrad.
</P>
<P>
Dieser steigt aber w&auml;hrend des Spielens (das ist nicht gerade Standard
bei Tetris-Clones...).
</P>
<P>
Ein Feature, dass nur wenige Clones haben: Man kann in dem, von mir sehr
gehassten, B-Mode spielen, in dem vorher schon Steine liegen, die man dann
verschwinden lassen muss. Hier l&auml;sst sich nat&uuml;rlich auch einstellen,
wieviele Reihen vorgef&uuml;llt sein sollen, und wie viele Steine in einer Reihe
liegen sollen.
</P>
<P>
Die grafische Umsetzung ist auch ziemlich gut gelungen, sch&ouml;n bunt und
komplett skallierbar, je nachdem, wieviel Platz man auf dem WB-Screen
opfern will.
</P>
<P>
Sound gibt es nicht, aber was nicht ist, kann ja noch werden ;-)
</P>
<P>
Dies ist wohl der beste Tetris Clone, den es f&uuml;r den Amiga gibt, es fehlen
nurnoch Sound und ein Zweispielermodus. Ansonsten ist es einfach perfekt.
Download it!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Detris&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Daniel Westerberg&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">kein Sound&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>Anmerkung: E-Mailware, kostenlose Registrierung</P>
<P>
Subjektiver Gesamteindruck vom Redakteur: 8 von 10 Punkten
</P>
<H2>Bruce Lee</H2>
<P>
Bruce Lee ist ein altes C64 Spiel, dass nun f&uuml;r den Amiga umgesetzt wurde.
Das Spielprinzip besteht darin, Amiga-B&auml;lle in Jump 'n' Run Level
einzusammmeln, w&auml;hrend man dicke Sumoringer verpr&uuml;gelt (oder verpr&uuml;gelt
wird, je nachdem...).
</P>
<P>
Das ist nicht unbedingt die intelligenteste Spielidee, und auch der Spa&szlig;
bleibt dabei irgendwie auf der Strecke...
</P>
<P>
Es gibt aber einen 2-4 Spieler Modus, der recht lustig sein kann. Vor
allem, wenn man sich einfach gegenseitig verpr&uuml;gelt, k&ouml;nnte das DER
Partyspa&szlig; der Saison werden. ;-)
Grafisch und Sondtechnisch ist das Spiel sehr an sein Vorbild gehalten,
also C64 Qualit&auml;t...
</P>
<P>
Das Spiel ist nicht gerade gut, aber wer mal wieder sein Hirn ausschalten
will, kann es sich gern runterladen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Bruce Lee&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor: HellCoder und HellHound&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">3 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">4 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">5 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Subjektiver Gesamteindruck vom Redakteuer: 5 von 10 Punkten
</P>
<H2>WBsteroids</H2>
<P>
Also, w&uuml;rde es einen Oscar f&uuml;r die beste Grafik eines WBGames geben, h&auml;tte
WBsteroids ihn locker gewonnen. Dieses kleine Asteroids-Spielchen f&uuml;r die
Workbench r&auml;umt auf mit dem Vorurteil, dass WB Spiele keine gute Grafik
haben k&ouml;nnen.
</P>
<P>
Nun, okay, die Grafik besteht auch nicht aus den typischen WB Elementen,
aber alle l&auml;uft systemfreundlich ab, und ist frei skallierbar. Naja,
skallierbar nur in Ma&szlig;en, denn bei mir st&uuml;rzte das Programm ab, beim
Versuch, das Fenster zu verkleinern...
</P>
<P>
Das Asteroiods-Spielprinzip kennt ja jeder, man muss Asteroiden abballern,
die bei jedem Treffer kleiner werden, bis sie ganz in den weiten des Alls
verschwinden. Das gibt dann Punkte, und man kann sich nach einiger Zeit in
der Highscore-Tabelle verewigen, was ja der Kindheitstraum von uns allen
ist.
</P>
<P>
Die Grafik besteht aus &quot;simplen&quot; Vektoren, was dem Spiel ein cooles Feeling
verleiht. Bei Explosionen fliegen viele kleine Punkte durch die Lust, in
Richtung des Schusses, der getroffen hat. Sieht sehr gut aus.
Gesteuert wird nach dem altbekannten Weltraumprinzip (es gibt keine
Reibungskr&auml;fte, also haltet ihr nicht von allein an) Recht kompliziert,
aber man gew&ouml;hnt sich ja dran...
</P>
<P>
Sound gibt es (ausnahmsweise) auch, und zwar ein paar sch&ouml;ne Explosions-
samples sowie Schusssamples und eine coole Ansage, wenn man das Spiel
startet.
</P>
<P>
Also, die Pr&auml;sentation ist absolut gelungen.
</P>
<P>
Spielerisch ist es ebenfalls sehr motivierend, aber nach langer Spielzeit
wird es einfach eint&ouml;nig. Da k&ouml;nnen auch die Extras, wie Superbomben und
Mehrfachschuss nicht helfen...
</P>
<P>
Dies ist sicher eines der besten WB-Games, der Download lohnt sich absolut.
Darf in keiner Sammlung fehlen...!
</P>
<P>
Im &Uuml;brigen: Ihr solltet einen schnellen Rechner haben, bei meinen 030/50 er
kommt es in den h&ouml;heren Levels zu argem Ruckeln...
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">WBsteroids&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">RelaySoft&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Subjektiver Gesamteindruck vom Redakteur: 8 von 10 Punkten
</P>
<H2>Schlachtfeld2</H2>
<P>
In einer entfernten Zukunft k&auml;mpfen Streitm&auml;chte diverser Kolonien um
Rohstoffe. Diese K&auml;mpfe tragen sie auf dem Planeten Sonorhc aus. Keine
aussergew&ouml;hnliche Story f&uuml;r ein aussergew&ouml;hnlich(gut)es Spiel.
</P>
<P>
Schlachtfeld2 ist so ziemlich das beste rundenbasierende Strategiespiel,
dass es zur Zeit auf dem PD Markt gibt.
</P>
<P>
Beim K&auml;mpfen kommen haupts&auml;chlich Panzer und Lufteinheiten zum Einsatz,
sowie Reparatur und Auftankeinheiten. Jede Einheit kann sich gleichzeitig
bewegen und k&auml;mpfen. Jedoch ist die Munition nicht unbegrenzt und muss
nachgeladen werden. Dies dauert ein bisschen.
</P>
<P>
Jede Einheit hat eine eigene Bewaffnung, die sich durch Reichweite sowie
St&auml;rke unterscheidet. Wird ein Gegner getroffen, sieht man genau
aufgelistet, was genau man getroffen hat. Und das ist eine interessante
Sache am Spiel, es gibt mehrere Arten, wie der Panzer zerst&ouml;rt wird. So
kann zum Beispiel das Cockpit zerst&ouml;rt werden, und die Einheit ist
unbrauchbar, oder der Tank explodiert, was meist zum kompletten Tod der
Einheit f&uuml;hrt. Jedoch ist ist es eher Zufall, wie ihr Einheit zerst&ouml;rt.
Auch k&ouml;nnen durch die Detonation eines zerst&ouml;rten Panzers die umliegenden
Einheiten besch&auml;digt werden.
</P>
<P>
Ist euch ein Panzer erstmal abhanden gekommen, m&uuml;sst ihr euch einen (oder
mehr) neuen kaufen. Daf&uuml;r steht euch vor Beginn jeder Schlacht ein gewisses
Budget zur Verf&uuml;gung. Dieses sollte man gut einplanen.
</P>
<P>
Auch wenn das Spiel grafisch vielleicht nicht mit Kommerziellen Varianten
dieses Genres konkurrieren kann, es ist zwar alles sehr &uuml;bersichtlich und
gut erkennbar dargestellt, aber ziemlich schlicht, &uuml;berzeugt einen der
Sound absolut. So viele und gute Musikst&uuml;cke hat man selten in einen PD-
Spiel gesehen. Soundeffekte sind hingegen recht sp&auml;rlich gehalten, es gibt
nur die genre&uuml;blichen milit&auml;rischen Biep und T&uuml;&uuml;&uuml;t Sounds, ein Highlight
ist da der Sprachsample beim Verlassen des Spiels...
</P>
<P>
Alles in allem ist das Spiel eines der wenigen, bei denen sich eine
Registrierung wirklich lohnt, wenn man es &ouml;fter spielt. Jeder Hobbygeneral
sollte sich dieses Spiel runterladen, es lohnt wirklich!
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD VALIGN="TOP">Schlachtfeld2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Peter Weigoldt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Hinweis:&nbsp;</TD><TD VALIGN="TOP">SHAREWARE! 20 DM!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">9 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Subjektiver Gesamteindruck vom Redakteur: 9 von 10 Punkten
</P>
<H2>BubbleStones</H2>
<P>
Nachdem f&uuml;r diverse Spielkonsolen nun schon der 4-6 Teil von Bust-a-Move
erschienen sind, hat sich ein findiger Programmierer auch an dieses Spiel-
prinzip gemacht, und eine Amiga-Version gemacht. Nicht, dass das neu w&auml;re,
aber er hat es doch recht ordentlich umgesetzt, muss man sagen.
Zum Spielprinzip: Man muss immer mindestens 3 gleichfarbige Kugeln
zusammenbringen. Am oberen Rand des Spielfeldes befinden sich bereits
einige Kugeln, und ihr m&uuml;sst neue nach oben schiessen. Den Winkel, in dem
ihr nach oben schiesst, k&ouml;nnt ihr frei bestimmen, die Ausgangsposition ist
aber immer in der Mitte der unteren Spielfeldbegrenzung. St&ouml;&szlig;t die Kugel
beim Schiessen an die linke oder rechte Begrenzung, prallt sie nach dem
altbekannten Gesetz Einfallswinkel=Ausfallswinkel ab. Geschafft ist das
Level, wenn keine Kugeln mehr auf dem Spielfeld sind.
</P>
<P>
Je l&auml;nger ihr daf&uuml;r braucht, desto weniger Punkte bekommt ihr. Wenn ihr zu
lange braucht, bekommt ihr Minuspunkte. Es ist also keine leichte
Angelegenheit, in den Highscore zu kommen.
</P>
<P>
Die technische Umsetzung des Games ist ziemlich gut gelungen, die Grafik
ist -f&uuml;r ein Geschicklichkeitsspiel- gut, die lustigen Soundeffekte tragen
zum Spielspa&szlig; bei, nur Musik vermisst man...
</P>
<P>
Zum Steuern d&uuml;rft ihr mal wieder euren Joystick rauskramen. Das Schiessen
im richtigen Winkel ist dadurch aber auch nicht einfacher...
Im &uuml;brigen ist die Anleitung komplett auf Franz&ouml;sisch. Zut, alors...
</P>
<P>
Ein netter Zeitvertreib, w&auml;r das Spiel nicht so schwer...
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Name:&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">BubbleStones&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Autor: Maysonnave Guy&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Grafik:&nbsp;</TD><TD VALIGN="TOP">8 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sound:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Steuerung:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Spielspa&szlig;:&nbsp;</TD><TD VALIGN="TOP">7 von 10 Punkten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Subjektiver Gesamteindruck vom Redakteur: 7 von 10 Punkten
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
