<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Der Zwischenruf
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Zeitsprung in die Gegenwart</B></P>
<P>
Was haben der Herbst und das Fr&uuml;hjahr gemeinsam? Richtig: Die Uhren werden
umgestellt. Dummerweise passiert ausgerechnet mir es immer, dass ich just
zu diesen Gelegenheiten weder Radio noch Fernsehen noch Internet
konsumiere.
</P>
<P>
So kommt es auch, dass ich schon des &ouml;fteren erst am Montag morgen auf dem
Weg zur Arbeit ganz erstaunt auf eine Uhr im U-Bahnhof blicke und nicht
recht glauben kann, was da passiert ist. Besonders wenn ich nur eine Tasse
Kaffee (und der auch noch ohne Liebe aufgebr&uuml;ht) am Morgen hinunterst&uuml;rze,
bin ich unausstehlich. Da kann eine solche &quot;chronologische&quot; Konfrontation
schon mal mit einer ganzt&auml;gigen schlechten Laune einhergehen.
</P>
<P>
Da kommt mir gleich der folgende Gedanke: Wie oft mu&szlig; ich mich mit Sachen
auseinander setzen, an die eigentlich auch ein St&uuml;ck Silizium denken
k&ouml;nnte?! Mein Pass ist abgelaufen ... verflixt, das h&auml;tte er mir aber auch
sagen k&ouml;nnen. Kein Kaffee mehr in der B&uuml;chse .... wer will ernsthaft von
mir erwarten, dass ich um 6 Uhr morgens zwischen der D&auml;mmerung und dem
schwarzen Schatten in der Dose unterscheide?! Die Schuhe sind nicht geputzt
... mu&szlig; man sich denn um alles k&uuml;mmern?!
</P>
<P>
Man k&ouml;nnte diese Liste endlos fortf&uuml;hren. Um den geneigten Leser nicht zu
langweilen und um mir noch mehr Depressionen ob der vergessenen Dinge zu
ersparen, wagen wir einen kleinen Blick auf den Computermarkt.
</P>
<P>
Computertechnik wird immer kleiner, billiger und portabler. Sogenannte PDAs
(Personal Digital Assistant) sind gro&szlig; in Mode. Die kleinen Merker und
Meckerer sind einfach genial. Man kann mit Ihnen E-Mails verschicken,
Briefe schreiben, Notizen vermerken, Termine speichern, und, und, und ...
</P>
<P>
So ein Ding wollte ich schon immer haben. Nur war bis jetzt kein Boing-Ball
drauf. Und als Kleinweich-Fenster-Gegner hat man's ja eh nicht leicht auf
diesem Planeten. Wie furchtbar penibel man auf die Fehler anderer
Betriebssysteme als dem AmigaOS blicken mu&szlig;. Man hat ja schlie&szlig;lich seinen
Stolz.
</P>
<P>
Aber habe ich mich gerade bei etwas Schlimmen ertappt? Nun, AmigaOS 3.5 ist
zwar relativ neu. Und Weihnachten kommt AOS 3.9 ... aber einen PDA gibt's
noch immer nicht als Boing-Schnitte. Nach 15 Jahren Amiga-Geschichte.
</P>
<P>
Bleibt also nur der gute alte Notizblock und der Kalender, um sich an
kleinere und gr&ouml;&szlig;ere Ereignisse zu erinnern.  Und ab und zu der Mut, seinen
Kollegen gnadenlos ins Gesicht zu l&uuml;gen, wenn diese besorgt fragen, warum
man schon so fr&uuml;h in der Arbeit sei. Meine diesbez&uuml;gliche Antwort:
&quot;&Auml;&auml;&auml;&auml;hhhh ja, ich hatte da noch so einen speziellen Fall zu erledigen und
wollte deshalb mal fr&uuml;her mit der Arbeit anfangen.&quot;
</P>
<P>
Und an Amiga meine kleine Bitte: &quot;BITTE L&Ouml;ST MEIN GROSSES PROBLEM GANZ
SCHNELL!!&quot;
</P>
<P>
Lebt lang und erfolgreich ...
</P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="PowerPC3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
