<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Zweiter offener Brief von AMIGA-Pr&auml;sident Tom Schmidt an die Anwender

»EXECUTIVE UPDATE
 ----------------
17.09.1999


Offener Brief an die Amiga-Gemeinde

W&auml;hrend der vergangenen Wochen wurde in den Newsgroups und per Email jede
Menge Verwirrung und Frustration zum Ausdruck gebracht. Ich entschuldige
mich daf&uuml;r, da&szlig; wir nicht deutlicher in unseren Mitteilungen waren, und ich
m&ouml;chte das Mi&szlig;verst&auml;ndnis bereinigen.

Erstens, das habe ich bereits in vorherigen Mitteilungen zum Ausdruck
gebracht, bin ich weiterhin beeindruckt von der Anteilnahme und der
Leidenschaft dieser Gemeinde. Sie sind w&auml;hrend zahlreicher Umw&auml;lzungen und
w&auml;hrend mehrerer falscher Anf&auml;nge zur Next-Generation-Plattform
"drangeblieben". Sie verdienen besseres! Ich habe in den letzten 2 Wochen
viele, viele Emails erhalten, die Ihre Meinungen und Ihren Frust
ausdr&uuml;cken. Lassen Sie mich versuchen, zusammenzufassen, was ich geh&ouml;rt
habe.

Viele von Ihnen erkennen die Tatsache an, da&szlig; wir uns auf die Software f&uuml;r
die kommende Generation von "Internet Appliances" konzentrieren. Wir sind
sehr begeistert vom neuen Amiga Operating Environment, der Arbeit, die wir
mit Linux (und anderen Betriebssystemen, die JAVA unterst&uuml;tzen) tun, und
der gewaltigen Wachstumskurve bei den Internet Appliances, auf der wir
mitfahren werden. Sie haben uns h&ouml;flichst alles Gute bei diesen Bem&uuml;hungen
gew&uuml;nscht; daf&uuml;r danken wir Ihnen. Wie Sie wissen, haben wir im Juli
angek&uuml;ndigt, da&szlig; wir die Entwicklung eines "Multimedia Convergence
Computers" verfolgen, der als Desktop-Variante des NG-Amiga dienen sollte.
Nach dem Wechsel im Management bei Amiga haben wir all unsere Produktpl&auml;ne
&uuml;berpr&uuml;ft. Um ehrlich zu sein, es erschien uns unrealistisch, einen MCC
liefern zu k&ouml;nnen. Weiterhin habe ich die fundamentale Entscheidung
getroffen, da&szlig; es besser w&auml;re, mit einer gro&szlig;en Vielzahl von
Hardware-Partnern zu kooperieren, anstatt mit Ihnen mit einem eigenen
Produkt zu konkurrieren.

Aus Ihrer Perspektive gibt es ein gro&szlig;es Problem. Klingt toll, aber was hat
diese neue Richtung mit dem originalen Amiga zu tun? Ganz ehrlich, nichts!
Wir wissen, da&szlig; das nicht die W&uuml;nsche der Amiga-Gemeinde nach einem
NG-Amiga befriedigt. Ich bleibe allerdings weiterhin auf der Suche nach
Partnern, die an der Entwicklung eines NG-Amiga-Computers und
-Betriebssystems interessiert sind. Wir haben die Diskussionen um das neu
gegr&uuml;ndete "Phoenix Platform Consortium" verfolgt und f&uuml;hren Gespr&auml;che mit
Firmen, die daran interessiert sind, den NG-Amiga zu liefern. Wir stehen
der M&ouml;glichkeit, der Lizenzierung der MCC-Spezifikationen, die nun
ausrangiert wurden, an Firmen, die daran Interesse haben, die
Amiga-Computer-Produktlinie weiterzuentwickeln, offen gegen&uuml;ber. Wir
glauben, da&szlig; dies eine attraktive Gesch&auml;ftsidee f&uuml;r eine andere Firma sein
kann.

Zusammengefa&szlig;t f&uuml;hren wir unsere Anstrengungen fort, Softwarestandards f&uuml;r
die kommende Generation von Internet Appliances zu setzen. Wir planen nicht
den Bau von Hardware, aber wir werden mit Hardwareherstellern
zusammenarbeiten, die unsere Technologie lizenzieren m&ouml;chten. Was das
Angebot an NG-Amiga-Systemen betrifft, sind wir offen f&uuml;r Gespr&auml;che mit
Firmen, die ein solches Produkt anbieten m&ouml;chten. Diejenigen unter Ihnen,
die von einem Amiga Operating Environment begeistert sind, das auf einer
gro&szlig;en Zahl von zuk&uuml;nftigen Internet Appliances l&auml;uft, laden wir herzlich
ein, unsere Fortschritte und Aktivit&auml;ten in den kommenden Monaten
weiterzuverfolgen. Das Software-Modell f&uuml;r die Internet Appliances, das wir
zusammenstellen, wird eine aufregende neue &Auml;ra der Softwarentwicklung
einl&auml;uten, von der wir denken, da&szlig; sie f&uuml;r diejenigen innovativen Denker
&auml;u&szlig;erst interessant werden wird, die in den vergangenen Jahren schon vom
Amiga angezogen wurden.

Beste Gr&uuml;&szlig;e,
Thomas J. Schmidt
President and CEO
Amiga, Inc.

Vielen Dank an R&uuml;diger Engel (Ruediger.Engel@gmx.de) f&uuml;r die &Uuml;bersetzung.«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
