<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. APC&TCP k&uuml;ndigt CD-ROM 'The Best of Airsoft Softwair' an

»The Best of Airsoft Softwair CD-ROM
 -----------------------------------

P&uuml;nktlich zur Home Electronics World `99 in K&ouml;ln wird die 'The Best of 
Airsoft Softwair' CD-ROM erscheinen. Diese CD-ROM ist eine Kollektion von 
fast allen Programmen, die jeweils von der Usergruppe Airsoft Softwair 
ver&ouml;ffentlicht wurden. Alle Shareware Ver&ouml;ffentlichungen von Airsoft 
Softwair sind selbstverst&auml;ndlich als uneingeschr&auml;nkte Vollversionen auf
der CD-ROM enthalten. Auch viele der &uuml;brigen Programme wurden nochmals 
&uuml;berarbeitet und sind in brandneuen Version auf der CD-ROM vorhanden.

Folgende exklusive Vollversionen sind auf der 'The Best of Airsoft 
Softwair' CD-ROM vorhanden:

- CD32 Games Install Kit v3.1NG
- Da Cool Installer
- NewInstaller
- Rainboot Pro
- Rainboot Configuration Creator (RCC)

Zus&auml;tzlich sind viele, teilweise noch nicht ver&ouml;ffentlichte, Programme auf 
der CD-ROM vorhanden, wie z.B.:

- AHelp
- alle Rainboot Konfigurationen (&uuml;ber 80!)
- Bilder
- Cheater und Trainer zu vielen Spielen (&uuml;ber 30!)
- Da Cool Booter
- Da Cool Patcher
- Da Cool Quiz
- DMS2HD
- Entwicklersektion mit vielen Quelltexten und Dokumentationen
- File2Disk
- Flip Da Scrip
- Geschichtssektion mit den legend&auml;ren '1.0-Versionen' vieler Programme
- HD Installer f&uuml;r viele Spiele
- kompletter Soundtrack des Adventures 'The 3 Islands'
- kompletter Spiegel der Airsoft Softwair Homepage inklusiv allen Dateien
- kompletter Spiegel der CBM Fan Page inklusiv allen Dateien
- LaunchHTML
- Module
- Needin' Speed
- PianoPlayer
- Piktogramme zu vielen Anwendungen und Spielen
- PlayMOD
- RandomStartup
- SNES9xGUI
- Sounds
- The 3 Islands Giga Preview (&uuml;ber 130MB!) mit Videos und mehr
- The 3 Islands spielbares Preview
- TUP
- XTreme Mod

und noch vieles mehr!

Das CD32 Games Install Kit v3.1 Next Generation ist das Ergebnis einer fast 
kompletten Neuprogrammierung des beliebten CD32 Games Install Kits, welches 
CD32 Spiele auf Festplatte installiert und diese von dort aus auch 
lauff&auml;hig macht. Momentan werden &uuml;ber 170 CD32 Spiele unterst&uuml;tzt, von 
denen auch viele auf Amigas ohne den AGA Chipsatz mittels des CD32 Games 
Install Kit lauff&auml;hig sind. Diese Version besitzt viele neue Features wie 
z.B. einen direkt integrierten CD32 Emulator, einem komplett neuen viel 
stabileren Bootsystem (Install2001NG) und au&szlig;erdem bietet das CD32 Games 
Install Kit jetzt erstmals die M&ouml;glichkeit, auch nicht vordefinierte CD32
Spiele zu installieren. Damit besteht also die M&ouml;glichkeit fast jedes CD32 
Spiel zu installieren (!!).

Der bekannte Da Cool Installer ist ebenfalls in einer neuen, vielmals 
&uuml;berarbeiteten Version auf der CD-ROM vorhanden. Da Cool Installer erlaubt 
es dem Benutzer mittels einer einfachen Prozedur viele Sorten von Spielen 
auf der Festplatte zu installieren. Der Vorteil von Da Cool Installer liegt 
darin, dass eine generelle Methode benutzt wird, um die Spiele zu 
installieren. So l&auml;sst sich fast jedes Spiel ohne weitere Probleme 
installieren. Da Cool Installer unterst&uuml;tzt dabei eine trackdisk.device 
Emulation, Spiele &uuml;ber mehrere Disketten, Degrade2ECS Unterst&uuml;tzung, 
Installation von DMS gepackten Disketten sowie vieles mehr.

NewInstaller ist das ultimative Multimedia Addon zu dem veralteten 
Commodore Installer. Mittels NewInstaller ist es jetzt erstmals m&ouml;glich, 
Installation mit Sounds, Bildern und vielen anderen Multimedia Elementen 
auszustatten. So kann NewInstaller auch Online Registrationen verwalten,
Homepages zum Besuch anbieten, UnInstall Skripte erzeugen und viel mehr. 
Dazu kommt die M&ouml;glichkeit, Commodore Installer Skripte vom NewInstaller 
einfach automatisch erstellen zu lassen, d.h. es wird einfach das 
Verzeichnis des zu installierenden Programms angegeben und sofort generiert
NewInstaller ein Installationsskript f&uuml;r das Programm, welches genau an 
dessen Bed&uuml;rfnisse angepasst ist. NewInstaller ist ein Muss f&uuml;r jeden Amiga 
Besitzer!

Auch das ultimative Bootprogramm Rainboot f&uuml;r den Amiga ist auf der CD-ROM 
in einer vielfach erweiterten und verbesserten Pro-Version vorhanden. 
Rainboot erm&ouml;glicht es dem Benutzer, komplette Multimedia Shows w&auml;hrend dem 
Bootvorgang anzuzeigen. Die Palette der Features reicht dabei von der 
Unterst&uuml;tzung von Animationen, Sounds, Copper Regenb&ouml;gen, Passwortschutz,
Pinseln, verschiedenen Schriften, Modulen, Fades, CyberGraphX und 
Picasso96, Boot Fortschrittsanzeigen, Auslesen der Daten des Amiga Systems 
bis hin zu grafischen Effekten und dem Scrollen von Bildern. In der Pro-
Version ist es jetzt erstmals m&ouml;glich mehrere Animationen einzubinden, eine 
Steuerung zu den Konfigurationen hinzuzuf&uuml;gen und vieles mehr. Rainboot ist
ein einzigartiges Programm, was in Leistungsumfang und Effektivit&auml;t bisher 
weder auf dem Amiga noch auf dem PC &uuml;bertroffen wurde.

Damit auch jeder seine Rainboot Konfigurationen auf eine einfache Art und 
Weise erstellen kann, wird auf der CD-ROM auch noch eine exklusive 
Vollversion vom Rainboot Configuration Creator, RCC genannt, mitgeliefert. 
Dieses Programm erm&ouml;glicht es mittels einer grafischen Benutzeroberfl&auml;che 
kinderleicht Konfigurationen f&uuml;r Rainboot zu erstellen. Der RCC unterst&uuml;tzt
fast alle Rainboot Funktionen und erm&ouml;glicht auch eine Weiterbearbeitung 
von schon vorhandenen Rainboot Konfigurationen. Dazu bietet er eine 
umfangreiche Online Hilfe, die direkt aus der Oberfl&auml;che heraus 
angesprochen wird. F&uuml;r jeden Rainboot Benutzer ist der RCC praktisch ein 
Muss.

Auf der 'The Best of Airsoft Softwair' CD-ROM ist also f&uuml;r jeden Geschmack 
einiges dabei. Sowohl f&uuml;r den ernsthaften Anwender als auch f&uuml;r den Zocker. 
Die CD-ROM ist das Ergebnis jahrelanger Arbeit am Amiga und sollte in 
keiner Sammlung fehlen. Au&szlig;erdem steht sie in einem einfach unschlagbaren
Preis/Leistungs-Verh&auml;ltnis. Obwohl eine Registration der in Vollversionen 
auf der CD-ROM enthaltenen Shareware Programme schon &uuml;ber 60 DM kosten 
w&uuml;rde, ist die CD-ROM f&uuml;r nur 29.95 DM zu haben. Und da man noch viel mehr
auf der CD-ROM bekommt als 'nur' die Vollversionen, ist der Preis nahezu 
unschlagbar.

Die 'The Best of Airsoft Softwair' CD-ROM erscheint p&uuml;nktlich zur Messe in 
K&ouml;ln beim APC&TCP zu einem empfohlenen Verkaufspreis von 29.95 DM.


Weitere Informationen erhalten Sie bei:

APC&TCP
Postfach 83
D-83236 &Uuml;bersee
Tel: 08642/89995
Fax: 08642/895004
Andreas@chiemgau.baynet.de
http://www.chiemgau.com/apc&tcp«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
