<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
9. Kurzmeldungen

* Eine Info in eigener Sache: Von mir gibt es ab sofort auch tagesaktuelle  
  Amiga-News. Dies ist keinesfalls als Konkurrenzservice zu den bekannten   
  Newsdiensten zu verstehen, sondern soll vom Umfang her einen Mittelweg    
  zwischen diesen und den AMIGA-aktuell-Special-News darstellen.
  Zu meinen News gelangt ihr, wenn ihr auf der AMIGA-aktuell-Homepage       
  (http://www.aakt.de) in der deutschsprachigen Sektion die 'letzten         
  Meldungen' aufruft und dann dem obersten Link folgt.

* Der Aminet-Hauptserver der Uni Paderborn wurde gehackt und ist derzeit    
  au&szlig;er Betrieb.

* Der Classic-Amiga-Clone BoXeR scheint endlich erh&auml;ltlich zu sein.
  Distributor Blittersoft nimmt bereits Bestellungen an. N&auml;here Infos zum
  BoXeR sind auf http://www.blittersoft.com/cgi-                            
  bin/2/webc.cgi/~bsoft/st_main.html?catid=21&sid=9XNHV6OCIJrf3Mr
  zu finden. 

* Bei VaporWare ist das dritte PreRelease des WWW-Browsers Voyager 3        
  f&uuml;r registrierte Nutzer erschienen. Download ist auf http://v3.vapor.com  
  m&ouml;glich. Als wichtigste neue Features werden HTTP/1.1- und
  FTP-Resume-Support, OpenSSL-0.9.4-Unterst&uuml;tzung, ein Site-Passwort-Manager
  und ein Cookie-Browser genannt. Desweiteren seien Bugfixes und kleinere
  Verbesserungen vorgenommen worden.

* Nach monatelangem Warten ist nun endlich die neue Version 2 des
  WWW-Browsers IBrowse erschienen. Wichtigstes neues Feature ist            
  JavaScript-Support. Interessierte k&ouml;nnen auf                              
  http://www.hisoft.co.uk/amigashop/ibrowse.html eine 30 Tage lauff&auml;hige
  Testversion herunterladen. Nach Bezahlung des Kauf- bzw. Updatepreises
  (34,95 bzw. 12,95 britische Pfund) erhalten sie ein Keyfile, das die
  Zeitbeschr&auml;nkung aufhebt.
  Eine Demoversion f&uuml;r jedermann ist unter der URL                          
  http://www.ibrowse2.freeserve.co.uk/periman.lha zu finden.

* Nova Design hat Version 4 der bekannten Grafiksoftware ImageFX            
  angek&uuml;ndigt. Als wichtigste Neuerung ist nun eine umfangreiche            
  Animationsunterst&uuml;tzung enthalten, so der Hersteller. ImageFX 4 wird      
  standardm&auml;&szlig;ig auf CD-ROM ausgeliefert, eine Disketten-Distribution ist    
  aber auch verf&uuml;gbar. Mehr zu ImageFX und den Upgrade-Modalit&auml;ten auf
  http://www.novadesign.com/pr23.htm

* Die Bildbearbeitung Photogenics ist in Version 4.2 erschienen. Auf        
  http://www.paulnolan.com l&auml;sst sich ein kostenloses Update herunterladen.

* Der Softwarehersteller Virtual Worlds Productions hat aufgrund der        
  aktuellen Lage alle Amiga-Softwareprojekte mit Ausnahme von WaveTracer DS
  eingestellt.

* Auf http://www.brandeins.de/magazin/realitaet/artikel2.php3 l&auml;sst sich    
  ein sehr interessanter ausf&uuml;hrlicher Artikel &uuml;ber die Geschichte des      
  Amigas sowie die j&uuml;ngsten Ereignisse finden, der auch einige bislang      
  nicht bekannte Details enth&auml;lt (deren Wahrheitsgehalt deshalb nat&uuml;rlich   
  auch nicht hundertprozentig bestimmt werden kann).
  Der Artikel existiert &uuml;brigens auch 'schwarz auf wei&szlig;', wie M. Tobias     
  Zecha herausgefunden hat: 
  »Ich habe heute im Zeitschriftenladen ein neues Wirtschaftsmagazin        
  entdeckt, "brand eins". 
  Aufgefallen ist es mir durch das etwas andere Design, und beim zweiten     
  Blick vor allem durch einen Artikel &uuml;ber den Amiga und seine Firma [ein    
  Titelthema(!!!) unter dem Motto: //restart].
  In dieser Zeitschrift, die ich mir dann selbstverst&auml;ndlich gekauft habe, 
  wird ein sehr gut recherchierter Artikel dargeboten (sechs Seiten reiner   
  Text!!), der den Werdegang der Amiga-Firma und vor allem objektiv seine   
  zuk&uuml;nftigen Aussichten darstellt.
  Diesen Artikel kann man nur empfehlen, da er einen objektiven Einblick    
  widergibt. 
  Au&szlig;erdem war ich &uuml;berrascht, dass sich ein Wirtschaftsmagazin, welches    
  wohl nur von dementsprechenden Leuten gelesen wird, dieses Thema          
  vornimmt.
  Zudem wird am Ende des Artikel geschrieben: "Es gibt Firmen, die          
  ver&auml;ndern sich schneller, als Artikel geschrieben werden k&ouml;nnen. Dann ist  
  der Text zu Ende, die Geschichte aber nicht. Amiga ist so ein Fall.       
  Deshalb erfahren Sie auf http://www.brandeins.net, wie es weitergeht. 
  Revolutionen haben keinen Redaktionsschlu&szlig;."«

* Die deutsche Amiga-Spielezeitschrift Amiga Future ist jetzt auch mit      
  einer Homepage im Internet vertreten. Die URL lautet                      
  http://www.amigafuture.de.

* Unter dem Titel 'A Tribute To Jim Collas' hat Amigart ein Forum           
  eingerichtet, in dem man pers&ouml;nliche Worte an den ehemaligen Pr&auml;sidenten  
  und CEO von AMIGA, Jim Collas, richten kann. Das Forum ist unter der URL  
  http://www.amigart.com/forums/jcollas.html erreichbar.

* Die Zeitschrift Amiga Plus hat ihre w&ouml;chentlich aktualisierten Amiga-     
  News-Seiten im Videotext des Fernsehsenders VIVA eingestellt.

* Die Aktion 'We are the Amiga', welche AMIGA zu einer besseren              
  Informationspolitik bewegen sollte, wurde bereits wenige Wochen vor dem   
  R&uuml;cktritt von Jim Collas auf Eis gelegt. - Schade, denn momentan          
  erscheint ein solches Projekt aus meiner Sicht dringlicher als je         
  zuvor. Ob es tats&auml;chlich Erfolg h&auml;tte, ist nat&uuml;rlich eine ganz andere     
  Frage.
 
* Andreas Kleinert, PerSuaSiVe SoftWorX, schreibt: »This is just a short    
  release note about akMPEG2 V3.00, that's now available on my homepage.
  It's not only extremely fast now, but also quite compact: the 8 players   
  (4x68k, 4xPPC) have been merged into now only 2 remaining executeables,   
  which brings the archive size down to only ~120 KB. Looping now is        
  possible as well.
  There also shouldn't be (m)any bugs left ;)«

* Desweiteren hat sich die Anschrift ge&auml;ndert. Die neue lautet: PerSuaSiVe  
  SoftWorX, Andreas R. Kleinert, Am Kornberg 48, 57076 Siegen

* Andreas Magerl vom APC&TCP schreibt: »Auch dieses Jahr bekommen           
  Clubmitglieder von APC & TCP wieder eine Erm&auml;&szlig;igung auf die               
  Eintrittskarten bei der Home Electronics World'99 (ehemals Computer 98)in  
  K&ouml;ln. Die Erm&auml;&szlig;igten Karten f&uuml;r Clubmitglieder (ca. DM 5,- Erm&auml;&szlig;igung)    
  gibt es nur direkt bei APC&TCP im Vorverkauf. Jeder der Karten ben&ouml;tigt,  
  sollte diese so schnell wie m&ouml;glich bestellen, da nur Karten im           
  begrenzten Umfang vorhanden sind. Detalierte Informationen gibt es bei    
  APC & TCP, Postfach 83, D-83236 &Uuml;bersee, Andreas@chiemgau.baynet.de,      
  http://www.chiemgau.com/apc&tcp.«

* Und noch eine Information vom APC&TCP: »APC&TCP wird, wenn nicht alles     
  schief geht, mehrere neue Amiga-Produkte auf der Messe in K&ouml;ln            
  pr&auml;sentieren. Detaliertere Informationen werden in K&uuml;rze ver&ouml;ffentlicht.  
  Updates sind auf der Messe ohne vorherige Absprache nicht (!!) 
  m&ouml;glich. Unter anderen d&uuml;rfte das neue Spiel SeaSide verkaufsfertig sein  
  und eventuell das langersehnte Spiel Ph&ouml;nix.«

* Nico Barbat schreibt: »Eremation Entertainment sucht h&auml;nderingend         
  Mitarbeiter f&uuml;r ein kommerzielles Amiga-Spiel, insbesondere Programmierer  
  und Grafiker. Informationen: Nico Barbat, 0221-4304656, 0179-4932913,     
  nico@barbat.de«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
