<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6.5. Reviews
------------

Discworld (Vorstellung)
-----------------------

Name des Spiels : Discworld
Hersteller      : Psygnosis

Grundlage       : ( ) Vollversion      ( ) Demo     (X) Andere: MacUP


Einleitung :

Wer den Scheibenwelt-Zyklus von Terry Pratchett, auf den dieses Spiels
basiert, kennt, der weiss bereits, was auf ihn zu kommt. Ein
Point&Click-Adventure im Fantasy-Genre, gew&uuml;rzt mit einer ordentlichen
Portion Humor und witziger Sprachausgabe.


Spielbeschreibung :

Der Spieler schl&uuml;pft in die Rolle von Rincewind, ein trotteliger
Zauberadept der Unsichtbaren Universit&auml;t, der zusammen mit einer Truhe auf
Beinen (endlich mal eine Erkl&auml;rung f&uuml;r unbegrenzte Tragekapazit&auml;t!) durch
die Stadt Ankh-Morpork streift, um dort gezwungenerma&szlig;en einen Drachen zur
Strecke zu bringen, an den er nicht glaubt (der aber nichts destotrotz
existiert). Das alles spielt sich auf der Scheibenwelt ab, eine
phantastische Welt, die auf vier Elefanten ruht, welche wiederum auf der
&uuml;berdimensionalen Schildkr&ouml;te Gro&szlig;-A´Tuin stehen.
Verwirklicht wird die verr&uuml;ckte Hatz mit dem klassischen Point&Click-
Interface, jede Aktion wird also mit zwei oder drei Mausklicks
ausgef&uuml;hrt. Die Grafik ist Cartoon-&auml;hnlich und sehr gut, die Sprecher
entstammen beispielsweise der englischen Komikertruppe Monty-Python.
Neben den komischen Gespr&auml;chen sind vor allem die knackigen R&auml;tsel ein
Markenzeichen von Discworld. Allein deswegen kann man sich lange Zeit mit
dem Spiel besch&auml;ftigen. 


Spielgeschwindigkeit :

"L&auml;uft ohne Probleme und sehr schnell" - Ein Zitat aus der Mac-Compliste,
allerdings von einem Besitzer eines A4000 mit 060er und Grafikkarte. Geht
man davon aus, d&uuml;rfte allerdings auch die Geschwindigkeit mit kleineren
Konfigurationen angemessen sein.


Fazit :

"Wer sowohl britischen Humor als auch komplizierten Adventures etwas
abgewinnen kann , ist mit Discwordl bestens bedient" - Zitat MacUp

Wertung: 6 von 6 Punkten

Tats&auml;chlich habe ich selbst Discworld auf der Playstation gespielt und war
als Scheibenwelt-Fan begeistert. Allerdings sind die R&auml;tsel tats&auml;chlich
&auml;usserst anspruchsvoll, und es ist schon eine geh&ouml;rige Portion Geduld
n&ouml;tig, um ans Ende zu kommen. Trotzdem w&uuml;rde ich das Spiel jedem empfehlen.




Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de 



Rebel Assault (Test)
--------------------

Name des Spiels : Rebel Assault
Hersteller      : Lucas Arts
Voraussetzungen : System 7.0
erh&auml;ltlich bei  :

Grundlage       : (X) Vollversion      ( ) Demo     ( ) Andere:
 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
           



Einleitung :

Auch wer nie einen Pc oder Mac besessen hat, wird wahrscheinlich wissen, 
dass sich hinter dem Namen Rebel Assault ein Space-Shooter mit 
Star-Wars-Hintergrund verbirgt, der durch seine film&auml;hnlichen Sequenzen
zu Bekanntheit kam. Mit Hilfe eines Emulators kann man nun auch auf dem
Amiga die Rebellenuniform anlegen und dem Imperator pers&ouml;nlich in den
Hintern treten (bildlich gesprochen!).


Spielbeschreibung :

Rebel Assault ist kein Weltraum-Shooter im klassischen Sinne, sondern eher
eine Abfolge von mehreren unterschiedlichen Spielsequenzen, in denen man
Geschicklichkeit oder schnelle Reflexe beweisen muss.
Dabei fliegt man als Rekrut der Rebellenarmee zumeist mit einem Raumschiff
auf vorgegebenen Kurs, kann sich nur sehr wenig zwecks Ausweichen bewegen
und muss gelegentlich noch mit Hilfe seines Lasers diverse Ziele erledigen. 
Am Spielprinzip scheiden sich dann auch die Geister - einerseits sind die 
Parkurse sehr h&uuml;bsch designed und prachtvoll anzusehen, andererseits ist 
die Handlungsfreiheit recht stark eingeschr&auml;nkt.
Zweifellos beeindruckend, und auch als Highlight des Spiels anzusehen, sind
aber die teils minutenlangen Zwischenfilme, die es nach geschaffter Mission
zu sehen gibt. Sie vermitteln einem wirklich den Eindruck, inmittes
des interstellaren Krieges zu sein.
Ein weiters Highlight ist die exzellente Ger&auml;uschkulisse, mit der das Spiel
aufwarten kann, angefangen bei der Filmmusik des London Symphony Orchestra
bis hin zu den Soundeffekten.
Ein kleiner Kritikpunkt ist allerdings die Steuerung - wohl dem, der
einen analogen Joystick sein eigen nennen kann...


Spielgeschwindigkeit :

Wen sollte es bei der exzellenten Grafik und dem Hintergrund wundern,
bleibt die Geschwindigkeit bei beschr&auml;nkter Rechenpower auf der Strecke.
Obwohl die Parkurse durchaus auch auf meinem Rechner spielbar sind, steigt
der sowieso recht hohe Schwierigkeitsgrad bei ruckeliger Umgebung
zus&auml;tzlich und l&auml;sst das Spielen zur Qual werden.
Einzig die Zwischenfilme lassen sich im kleinen Fenster noch in
ertr&auml;glicher Geschwindigkeit ansehen. 


Fazit :

Rebel Assault ist haupts&auml;chlich ein Spiel zum anschauen. Nur auf einem
schnellen Rechner kann auch Spa&szlig; bei den Parkursen selbst aufkommen.
Ansonsten ist es immer noch m&ouml;glich, mit Hilfe eines Cheats (der bestimmt
existiert) durch die Level springen, um zumindest in den Genuss der
exzellenten Filme zu kommen.




Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de



Shine (Test)
------------

Name des Spiels : Shine
Hersteller      : BMG Interactive
Voraussetzungen : 8MB Ram     System 7.1+     256 Farben
erh&auml;ltlich bei  : Arktis

Grundlage       : (X) Vollversion      ( ) Demo     ( ) Andere:
 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
           



Einleitung :

Wohl keine andere Spielegattung ist auf dem Mac so häufig zu finden, wie
die der Myst-&auml;hnlichen Spiele. Zu eben dieser Gattung geh&ouml;rt auch Shine,
welches auf zwei CDs in einem schlichten Jewel-Case ausgeliefert wird.


Spielbeschreibung :

Wie bei anderen Spielen dieser Art bewegt man sich in Shine durch eine
gerenderte Landschaft. Die Bewegung erfolgt &uuml;ber einen Mausklick in die
gew&uuml;nschte Richtung, wobei jeweils zu den neuen Bildern, die den Blick vom
Standpunkt des Spielercharakters wiedergeben, &uuml;bergeblendet wird. Innerhalb
dieser Einzelbilder kann man Dinge bet&auml;tigen, Gegenst&auml;nde mitnehmen, mit
Personen sprechen oder andere Aktionen ausf&uuml;hren, wozu ein einfacher Click
auf das gew&uuml;nschte Objekt ausreicht.
Interessant und atmosph&auml;risch sind vor allem die Zwischenfilme, die gezeigt
werden, wenn man sich mit Personen unterh&auml;lt oder beispielsweise eine
Videoleinwand betrachtet. Hier agieren echte Schauspieler, die dem Spiel
mit sehr guter (deutscher) Sprachausgabe Leben einhauchen.
Die Geschichte von Shine ist genre-typisch skurril. Ort der Handlung ist
die Stadt Twilight City, ehemals Sun City. Sie wurde umbenant, nachdem alle
Einwohner an ein gemeinsames neurales Netzwerk angeschlossen wurden, 
wodurch
alles d&uuml;sterer wurde. Der Spieler, in Gestalt des Tontechnikers Shine, muss
nun das "d&uuml;stere Geheimnis" der Stadt l&uuml;ften, das irgendwie mit der eigenen
Geschichte verwoben ist. Dabei trifft man auf einige sehr aussergew&ouml;hnliche
Figuren, wie die obskure Cozmilla, eine Produzentin sogenannter "Clones",
oder die beiden Cops, die leicht verr&uuml;ckt und genauso depressiv und
melancholisch sind.
Grafik und Charaktere geben dem Spiel eine wunderbar d&uuml;stere und
unwirkliche Atmosph&auml;re. Getr&uuml;bt wird diese durch eine gew&ouml;hnungsbed&uuml;rftige
Steuerung, zumal der Cursor nicht immer die m&ouml;gliche Richtung anzeigt.
Ausserdem kann man Gegenst&auml;nde (meines Wissens nach) nicht wirklich
untersuchen oder betrachten kann. Ein weiterer Kritikpunkt ist die sehr
sp&auml;rliche Anleitung in Form eines Booklets in der CD-H&uuml;lle, die nur
&auml;usserst wenige Informationen enth&auml;lt, so dass die unwirkliche Welt so
vollkommen ohne Hintergrund doch sehr befremdlich wirkt.



Spielgeschwindigkeit :

Da das Spiel absolut grafiklastig ist, darf man nat&uuml;rlich keine Wunder bei
der Emulation erwarten. Die &Uuml;berblendung zwischen zwei Bildern dauert auf
meinem System etwa 4-5 Sekunden, eine 90 oder 180 Grad Drehung geht etwas
schneller von der Hand.
Die Videos laufen, auf kleinem Bildschirm, in aktzeptabler Geschwindigkeit,
nur selten gibt es kleine H&auml;nger oder verschluckten Sound.


Fazit :

Wer das Genre mag und vor einer vollkommen skurrilen Handlung nicht
zur&uuml;ckschreckt, f&uuml;r den mag Shine eine nette Anschaffung sein. Wieder
einmal w&auml;re es interessant zu wissen, wie schnell das Spiel auf einem, mit
einer Grafikkarte best&uuml;ckten Amiga l&auml;uft, da schnellere &Uuml;berblendungen
die Motivation erheblich steigern w&uuml;rden.




Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de



Superspy (Test)
---------------

Name des Spiels : Superspy
Hersteller      : Navigo
erh&auml;ltlich bei  : Arktis (4 Top-Spiele...)

Grundlage       : (X) Vollversion      ( ) Demo     ( ) Andere:
 
Getestet auf    : ( ) 020/__   ( ) 030/__   (X) 040/40   ( ) 060/__
Grafikkarte     : ( ) Ja       (X) Nein     Welche:________________

Emulator        : (X) Fusion   ( ) ShaShi   ( ) mit Emplant  ( ) echter Mac
Mac-System      : ( ) 6._      ( ) 7._      (X) 8.0
Mac-Rom         : ( ) 128k     ( ) 256k     ( ) 512k     (X) 1MB            
           



Spielbeschreibung :

Bei diesem Spiel handelt es sich um ein, im Zeichentrick-Stil gehaltenes
point&click-Adventure, bei dem der Spieler in die Rolle eines
Geheimagenten schl&uuml;pt, der mal wieder die Welt vor dem Untergang retten
muss.
Hintergrund der Geschichte ist das Omega-Projekt, ein biologischer
Kampfstoff, der von einem miesen Terroristen und Oberschurken in einem
genialen Coup gestohlen und skrupellos gegen Menschen eingesetzt wird,
mit dem Ziel, die Weltherrschaft zu erlangen.
Gesteuert wird mit Hilfe der Maus, jedoch ohne die bekannte Befehlszeile am
unteren Rand des Bildschirms, sondern durch einfaches Klicken auf ein
Objekt. Ein weiterer Klick f&uuml;hrt eine logische Aktion durch.
Obwohl das Spiel recht einfach und schnell durchgespielt ist, sorgen die
verschieden Szenarien f&uuml;r Abwechslungen und echtes Agentenfeeling. Schon
das Entsch&auml;rfen einer Bombe zu Beginn des Spiels  unter Zeitdruck und mit
Hilfe einer kompletten Entsch&auml;rfungsausr&uuml;stung ist eine Klasse f&uuml;r sich.
Auch ansonsten stehen einem viele nette Dinge wie beispielsweise eine
Abh&ouml;rvorrichtung, die obligatorische Waffe, ein vollausger&uuml;stetes Laptop
und sogar eine Warpvorrichtung(!) zur Verf&uuml;gung.
Grafik und Sound sind gut gelungen, Zwischenanimationen im Zeichentrick-
Stil sind reichlich vorhanden und eine gute Sprachausgabe rundet das ganze
Spiel ab.


Spielgeschwindigkeit :

Superspy ist durchweg fl&uuml;ssig spielbar, auch wenn beim &Ouml;ffnen der
Agententasche oder des Computers kleine Pausen entstehen k&ouml;nnen. Ansonsten
d&uuml;rfte es auch auf kleineren Konfigurationen spielbar sein.


Fazit :

Superspy sorgt trotz seines irreleitenden Namen f&uuml;r allerlei Kurzweil und
versetzt den Spieler wirklich in die Rolle eines Agenten, der sich durch
die schurkischen Reihen schlagen muss, um die Welt zu retten. Da das
Spiel im Bundle mit drei anderen (Jewels of the Oracle, Rave Shuttle, Total
Distortion) nur 30DM kostet, kann man durchaus zuschlagen.




Autor  : Andreas Koch
E-Mail : andreas.koch@rz-online.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
