<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Technik & Net NEWS: Technik

Hallo und willkommen zur Oktober Ausgabe der Technik & Net NEWS - Technik:

Wie schon im INTRO erw&auml;hnt, bin ich mir &uuml;ber das Konzept immer noch nicht
im Klaren. Auch habe ich keine Lust, 2000 Tote und die daraus f&uuml;r den
Computermarkt resultierende Konsequenzen als Meldung des Monats zu k&uuml;ren.
Als weit besseren Ersatz finde ich, es mal mit einem "Thema des Monats" zu
versuchen. Diesmal "Netzwerke der gr&ouml;&szlig;eren, schnelleren oder besonderen
Art!"

In wie weit das Erdbeben in Taiwan wirklich greifbaren Einfluss auf die
Computerindustrie haben wird und nicht nur als Argument f&uuml;r Preiserh&ouml;hungen
vorgeschoben wird, (was bereits eingetreten ist),  wird mal wieder erst die
Gechichte zeigen - oder immer nur Vermutung bleiben. Dabei sollte man sich
vor Augen halten, dass Taiwan einer der gr&ouml;&szlig;ten Exporteure von
elektronischen Bauteile ist. Festplatten, Massenspeicher allgemein, kommen
demgegen&uuml;ber eher aus Malaysien, Philippinen, Thailand oder China.
Allerdings sind auf einer Festplatte auch Chips - allerdings gibt es auch
anderswo Hersteller von elektronischen Bauelemente. Auch gab es schon vor
dem Bumms, aus anderen Gr&uuml;nden einen starken Preisanstieg bei
Speicherbausteinen. Oder die Tatsache, dass der erste  Nachfrageschub des
Jahres langsam abklingt und das Weihnachtgesch&auml;ft vor der T&uuml;r steht.  Hier
ein kleines Preisbeispiel, 64 MBit DRAM Type: 8M  X 8 PC 100

Mai 99                   6.7 $
September 99             8 $
10. September           14 $
20 September            19.50 $
27 September            21.45 $

Demgegen&uuml;ber ging der Preisverfall bei Festplatten munter weiter. Der Preis
f&uuml;r eine 15 GB IDE Platte hat die Grenze von 300 DM Endverbraucherpreis
l&auml;ngst nach unten durchbrochen.

Dazu eine aktuelle Meldung die zeigt, dass man kein Bumms braucht und
Schrott zu produzieren:

 "Intel ruft 820er Chipsatz zur&uuml;ck"

500.000 neue PCs m&uuml;ssen umkonfiguriert werden
Mit einer spektakul&auml;ren Last-Minute-Aktion hat Intel die Auslieferung
seines neuen 820er-Chipsatzes gestoppt und auf unbestimmte Zeit verschoben.
Die amerikanischen Hersteller, deren Umgang mit Intel ohnehin nicht nur von
gegenseitiger Verehrung gepr&auml;gt ist, m&uuml;ssen nun bis zu 500.000  Ger&auml;te, die
bereits fertig konfiguriert nur noch auf den neuen Chipsatz warten, umbauen
- oder k&ouml;nnen sie gleich in die Schrottpresse geben.

Schei&szlig; Spiel, der Verbraucher ist mal wieder der Dumme. Oder Beispiel
Apple. Da kommt der Kurs der Apple Aktie u.a. dadurch unter Druck, dass man
verk&uuml;nden musste, dass es Auslieferungsprobleme, (d.h. R&uuml;ckgang bei Umsatz
und Gewinn), mit vorbestellten Ger&auml;te gibt, da z.B. Motorola die
Hauptprozessoren nicht in ausreichender St&uuml;ckzahl liefern kann. Motorola
kam selbst unter Druck, da deren wesentlich breiter gestreute
Produktpalette wesentlich st&auml;rker betroffen sein soll. Kann ja sein, dass
man mit den CPUs nicht nachkommt. Nicht umsonst kam AMD&acute;s neuer
Produktionsstandort Dresden f&uuml;r Motorola ins Gespr&auml;ch, da zwischen Beiden
seit einiger Zeit eine Kooperation besteht. Kann aber auch sein, dass
Motorola wegen dem PPC Konkurrenzkampf mit IBM die Schnautze h&auml;lt und es
vielleicht auch ein Problem von Apple selbst ist. Ob im Hinblick auf die
dreckige Arroganz die sich Apple und Jobs mit dem neuen Sawtooth
Motherboard in den Maschinen gr&ouml;&szlig;er 450 MHz leistet, oder, der Gedanke kam
mir nach der G 4 Pr&auml;sentation, als ich Analystenberichte gelesen habe,
welche die Frage aufwarfen, was wohl mit den G3 Lagerbest&auml;nden passiert, da
der Preisunterschied zwischen blau- wei&szlig; G3 und neuen G4, nach Preisliste,
nur noch eher "gering" ist. Das dann noch in Verbindung mit dem dreckigen
Spiel von Apple mit dem Apple ROM Update auf die Version 1.1 und den Probs
mit den G4 Erweiterungskarten in G3 Rechner.

Klar, eben kam meine liebensw&uuml;rdige, dunkle Seele zum Vorschein. Aber
zur&uuml;ck zum Thema Erdbeben -- und Apple.
Ist nat&uuml;rlich schwer sich auf die Entfernung ein Bild zu machen. Ganz
aktuell (28.09, Minuten vor meinem Redaktionsschluss), verdichten sich die
Anzeichen, dass viele Gro&szlig;h&auml;ndler nun doch Kasse machen wollen. Trotzdem
hat ganz b&ouml;s bum mach und es ist auch von Problemen zu lesen. Selbst wenn
die Arbeiter da sind und die Geb&auml;ude noch stehen, m&uuml;ssen die
Produktionsanlagen auch in Ordnung sein, das gleiche bei den
Zulieferfirmen, auch muss die Infrastruktur funktionieren. Ein gro&szlig;es
Problem in Taiwan muss die Stromversorgung sein und da scheint es auch zu
hapern. Allerdings und das darf man nicht vergessen, ist Taiwan ein straff
durchorganisierter Milit&auml;rstaat, wo durchaus auch mal einem Wohnviertel der
Saft abgedreht wird, damit die Industrie Strom hat.

Zur&uuml;ck zu Apple, da sich viele der Leser evtl. in diese Richtung bewegen
k&ouml;nnten. Auch hier, kurz vor Schluss, eine interessante Entwicklung. Da
lese ich heute mal wieder verst&auml;rkt von "in K&uuml;rze" bevorstehende
Vorstellung neuer iMac Modelle, die man schon vor zwei Wochen in Paris
erwartet hat.
Sch&ouml;n und gut. Dann h&ouml;re ich heute, 28.September 22.20, vom nicht ganz
unbekannten Markus Koch eine kurze Erkl&auml;rung zur neuerlichen Schw&auml;che der
Apple Aktie, obwohl sich der Gesamtmarkt, auch die HighTech Werte im
Tagesverlauf gut erholt hatten. Angeblich bekamen bereits Analysten
(gesetzlich vorgeschriebene ) Gewinnwarnungen &uuml;ber Telefon, da es im
Bereich iMacs und Powerbooks, nicht etwa zu Engp&auml;ssen, sondern zu
regelrechten Auslieferungsstopps kommen wird. Das in Verbindung mit den
Lieferproblemen der G4 Reihe, die letzte Woche ver&ouml;ffentlicht wurden. Nach
dem AllTimeHigh letzte Woche bei 80 1/8 $, gab der Kurs die letzten Tage
leicht nach und schloss heute bei 59.62 $.

Man wird sehen.
--------
Und weil ich nichts besseres zu tun habe und so sch&ouml;n an tippen bin und
obwohl ich es schon kurz im INTRO angeschnitten habe, eine Antwort auf ZWEI
Leseranfragen bez&uuml;glich meiner Einsch&auml;tzung als Au&szlig;enstehender zu der
Geschichte um Amiga und Transmeta und dem Ditzel (Transmeta CEO) Interview,
auch mit der Frage: "Hat er irgendwo gesagt, dass nie eine Verbindung
bestand, oder nur, dass [im Moment] keine besteht?"

Frage: What's the Amiga connection?
Antwort: False alarm, says Ditzel. It was just a publicity shot of Torvalds
supporting Amiga's use of Linux-the Transmeta sign happened to be in the
background. "It's even more off-base than some of the other stuff that's
out there ... I'm just bemused by the whole thing," Ditzel says.

Mein Kommentar:
Udo Lattek &uuml;ber Otto Rehhagel in der Bild-Zeitung:  "Ich habe weder ein
gutes Verh&auml;ltnis zu ihm, noch habe ich ein schlechtes Verh&auml;ltnis zu ihm.
Ich habe &uuml;berhaupt kein Verh&auml;ltnis zu ihm!

Das ist nun auch schon wieder ein paar Tage her, aber hat man im Spritzen
Sport oder in der Computerindustrie jemals ehrliche Antworten bekommen? Auf
der anderen Seite, rein gef&uuml;hlsm&auml;&szlig;ig, glaube ich der Aussage. Da gab es nie
eine wirkliche Verbindung. Auf der anderen Seite, sollte es wirklich mal
eine "im Handel erh&auml;ltliche CPU" geben, kann jeder damit machen was er
will. Ob ein super intelligenter Vibrator im Beate Uhse Sortiment, oder
Dietrich von P-5 in einer A - B - T- oder was wei&szlig; ich, Schachtel. - Oder
als CPU von Billys neuer Spielkonsole. Dass man mittlerweile was bieten
muss, siehe unten bei dem PSX 2 Abschnitt.

Angeblich sollen Mitte Oktober erste Details ver&ouml;ffentlicht werden, bzw.
Daten, wann vielleicht mal etwas dar&uuml;ber gesagt wird. Als Venture Capital
Firma, die Transmeta ist, selbst wenn P.Allen mit drin steckt, sollte es
langsam auch mal Zeit werden. Ich denke aber, dass es sich, wenn es ein
Hauptprozessor, auch ein Programmierbarer, sein sollte, er auf die x86
Kompatibilit&auml;t getrimmt ist. Noch nicht mal unmittelbar um den Consumer,
sondern eher um den lukrativen Server Bereich abzudecken. Als Alternative
zur aufkommenden 64 Bit Architektur, gerade von Intels IA-64 Serie. Als
aktuelle Entwicklung besser bekannt unter dem Namen "Merced". In wie weit
da aufgestaute Antipathien zwischen Intel und MS eine Rolle spielen, was
wei&szlig; ich. Obwohl MS eine der ersten Firmen war, noch vor wichtigen
Grafikchip Hersteller, die ank&uuml;ndigten, AMD s Athlon zu unterst&uuml;tzen, nimmt
man die noch nicht sehr ernst. Das ist nicht b&ouml;s gemeint sondern nur
realistische Einsch&auml;tzung. AMD ist unsicherer denn je. Der Athlon muss so
schnell wie m&ouml;glich in St&uuml;ckzahlen verf&uuml;gbar sein. Dann wird man sehen,
welche Spezifikationen der K 8 haben wird. Eine weiter mittelschwere Panne
und AMD bekommt vom Teufel den Dreizack in&acute;Arsch gerammt. Das alte
Spiel mit den Gl&auml;ubigern und der Kreditlinie... .

Transmeta Mitarbeiter Thorwalds und Linux? Kann irgendwo auch Zufall sein.
Oder geht er damit auf Nummer sicher dass der Kernel sofort mit der CPU
klarkommt und ist sich des Verh&auml;ltnisses der Installationen bewusst. Es
gibt n&auml;mlich ein mehrfaches an Linux und Windows Installationen wie es
Linux allone oder Linux mit sonst-einem-OS Installationen gibt. Immer mehr
Tools von immer mehr Firmen werden ver&ouml;ffentlicht, die nach dem Motto
laufen, "the best of both worlds". Also das beste aus der Verbindung
Windows Linux.

Auf das momentan sehr beliebte Spielchen welche Gro&szlig;-CPU l&auml;uft mit welchem
neuen OS (Alpha, Win2000, Unix-Versionen.... ) und wie Intel und MS da
rumr&uuml;hren, will ich gar nicht mehr weiter eingehen.


Wie gesagt, Redaktionsschluss, 28 09. und das alles ist nur ein Gef&uuml;hl von
mir. Und eigentlich will ich gar nicht so viel schreiben.
The Devil makes his Game! -  altes deutsches Sprichwort.

---------------------------------------------------------------------------

1.) Hab ich erw&auml;hnt, dass am 05. Oktober das neue Album von Sabrina Setlur,
"aus der Sicht und mit den Worten von.... " erscheint? 14 neue Titel. Wer
Lust hat: http://www.sabrina-setlur.de
Klar, das hat nix mit Amiga oder Internet zu tun, ich mag sie eben!  Aber
das, hatte ich schon :)

---------------------------------------------------------------------------

2.) Anfang September fand in Palm Springs, Kalifornien, das Intel
Developers Forum statt. Dabei teilte die f&uuml;r die Weiterentwicklung
zust&auml;ndige USB 2.0 Promoter Group mit, dass die Entwicklungsarbeiten an der
Version 2.0 in die Schlussphase geht. Dreimal schneller als urspr&uuml;nglich
geplant und bis 40mal schneller als die bisherige Version 1.1. USB 2.0 wird
demnach &uuml;ber eine &Uuml;bertragungskapazit&auml;t von 360 bis 480 MBit/s verf&uuml;gen. An
der maximalen Anzahl anzuschlie&szlig;ender Ger&auml;te von 127, wird sich vermutlich
nix &auml;ndern. Obwohl Hardwarekompatibilit&auml;t gewahrt bleiben soll, muss sich
nach Ver&ouml;ffentlichung genauerer Spezifikationen erst noch rausstellen, wie
die Erh&ouml;hung im Praxiseinsatz vonstatten geht. Der Vorsitzende der USB
Promoter-Group, die aus Compaq,  Hewlett-Packard, Intel, Lucent
Technologies, Microsoft, NEC Philips Electronics besteht, erkl&auml;rte, dass
allerdings erst im zweiten Quartal 2000 mit den ersten Ger&auml;ten zu rechnen
ist.

Ein Amiga-aktuell Leser konnte meine USB Euphorie in meinem September BIZ
Artikel nicht verstehen, oder besser gesagt hat sie falsch verstanden. Mit
max. 480 MBit/s von USB 2.0, wird die momentane Firewire Version etwas
&uuml;bertroffen, was durchaus zu einer ironischen Bemerkung, verleiten k&ouml;nnte.
Es ist allerdings so, dass ich USB nicht auf Teufel komm raus bevorzuge
oder verteidige. Ich schrieb z.B. sowohl von einer internen USB, wie auch
Firewire- Schnittstellenreihe. Je nachdem was sich durchsetzt. "Besser" als
das bisherige Geschmaddel wären beide. Dass meine Vorstellungen der
internen Schnittstellenreihe nicht so abwegig war, kann man daran erkennen,
dass es in der neuen G4 Reihe von Apple bereits einen  interne Firewire
Steckplatz gibt. Was fehlt sind Massenspeicher im Consumerbereich in
Gro&szlig;serien, mit reinrassigen USB 2 oder Firewire Schnittstellen.

Als wirklich entscheidend in diesem multimilliarden Dollar Gesch&auml;ft der
Computerindustrie, in dem aber jeder Cent z&auml;hlt, empfinde ich eine andere
sehr banale Tatsache. Besonders wenn man sich vor Augen h&auml;lt, dass sich
nicht immer das Beste durchsetzt. F&uuml;r Firewire muss ein Hersteller
Lizenzgeb&uuml;hren an Apple zahlen!!!

---------------------------------------------------------------------------

3.)   40,9 GByte Festplatte von Maxtor

Der amerikanische Festplattenhersteller Maxtor, k&uuml;ndigt mit der DiamondMax
40 eine Festplattenserie an, die auf vier Magnetscheiben insgesamt bis zu
40,9 GByte unterbringt. Zudem kommt mit der  DiamondMax VL 20 eine
preiswerte 20 GByte Platte auf den  Markt.
DiamondMax 40 Laufwerke werden mit Kapazit&auml;ten von 20,4  bis 40,9 GByte
erscheinen und erreichen eine durchschnittliche Zugriffszeit von 9.0 ms.
Der Cachespeicher ist mit 2 MB 100 MHz SDRAM Speicher best&uuml;ckt. Die Daten
werden &uuml;ber eine Ultra DMA 66 Schnittstelle verschickt.  Die DiamondMax VL
20 Platten gibt es mit 1 bzw. 4 Scheiben und sich daraus ergebenden
Kapazit&auml;ten von 10,2 bis 20,4 GByte. Sie besitzen ebenfalls ein Ultra DMA
66 Interface und nur 512 KByte Cache. Die mittleren Zugriffszeiten liegen
bei 9,5 ms.

Die Platten sollen ab Oktober in gro&szlig;en St&uuml;ckzahlen gefertigt werden und
kommen zun&auml;chst in Nordamerika auf den Markt. Der Preis f&uuml;r die 40.9 GByte
DiamondMax wird mit 349 US-Dollar, der der 20.4 GByte DiamondMax VL mit 229
US-Dollar angegeben.

Quelle: http://www.heise.de

---------------------------------------------------------------------------

4.)  970 Cxi: HP bringt Megapixel-Tintenstrahldrucker
Mit dem 970 Cxi st&ouml;&szlig;t Hewlett Packard vor dem Erzrivalen Epson im
Consumerbereich in den Bereich von 2400 dpi von. Bislang lag die Grenze bei
1440 dpi. Die Ausgabe solcher hochaufgel&ouml;ster Drucke ist allerdings nur auf
speziellen Fotopapier m&ouml;glich - herk&ouml;mmliches w&uuml;rde durchweichen. Dem
Druckkopf stehen f&uuml;r den Farbdruck 408 D&uuml;sen zur Verf&uuml;gung, welche die
Farbtropfen mit einer Frequenz von maximal 18 kHz rausschleudern. F&uuml;r den
Schwarzwei&szlig;druck sind es noch 300 D&uuml;sen.
Das Drucktempo soll nach Herstellerangaben bei 12 Seiten pro Minute im
monochromen Druck bei 600 dpi und 2,9 Seiten pro Farbseite liegen. Der
Drucker ist mit HP eigenen PhotoREt III Farbmanagement  ausger&uuml;stet und
verf&uuml;gt sowohl &uuml;ber den typischen Parallelport-PC Anschluss als auch &uuml;ber
einen USB-Port. Der Preis war noch nicht zu erfahren.

---------------------------------------------------------------------------

5a) Grosse Netze Teil 1:  L&auml;ngstes Seekabel der Welt geht in Betrieb

Anfang September ging das l&auml;ngste Seekabel der Welt in Betrieb. Das mit dem
K&uuml;rzel SEA-ME-WE3  (South-East-Asia / Middle-East / Western-Europe)
bezeichnete Kabel mit seiner Gesamtl&auml;nge von 38.000 Kilometern, verbindet
Europa, Fernost und Australien. Genauer gesagt verbindet das Kabel 33
L&auml;nder und hat zwischen dem Europaeischen Ende bei der Telekom in Norden
(Ostfriesland) und Singapur, Australien, China und Japan 39 Anlandepunkte.
Von Deutschland aus verl&auml;uft die Route des Kabels durch den &Auml;rmelkanal, um
Europa herum ins Mittelmeer und folgt ab &Auml;gypten der alten
Meeres-Seidenstra&szlig;e an Indien vorbei nach Singapur. Dort teilt es sich in
einen Japan- und einen Australienzweig.
Das Projekt, bei dem 93 Telekommunikations- Unternehmen, aus 52 L&auml;ndern
beteiligt war, verschlang nach zweieinhalbj&auml;hriger Planungs- und Bauzeit
etwa 2 Milliarden Mark. Die Deutsche Telekom ist mit 100 Millionen Mark
gr&ouml;&szlig;ter Investor in diesem Projekt.
Mit der Inbetriebnahme der &Uuml;bertragungskapazit&auml;t von 20 Gigabit pro Sekunde
- das entspricht 300.000 Telefonaten gleichzeitig - soll dem stark
anwachsenden Telekommunikationsverkehr zwischen Westeuropa, Fernost und
Australien Rechnung getragen werden.


5b) Grosse Netze Teil 2: Global Crossing verdoppelt Kapazit&auml;t seines
Glasfaserkabels

Global Crossing Ltd. (Nasdaq: GLBX) hat die Leitungskapazit&auml;t seines
glasfasergest&uuml;tzten transatlantischen Kabelsystems Atlantic Crossing (AC-1)
erheblich erweitert. Jetzt kann die Glasfaserleitung, die Europa und die
USA verbindet, ein Datenvolumen von 80 Gigabit pro Sekunde (Gbps)
transportieren - eine Verdoppelung der bisherigen Kapazit&auml;t. Die Aufr&uuml;stung
erfolgte 18 Monate fr&uuml;her als geplant. Grund hierf&uuml;r ist die stetig
wachsende Nachfrage nach Leitungskapazit&auml;t im transatlantischen
Datenverkehr. Doch der Trend nach oben geht noch weiter: Erst k&uuml;rzlich hat
sich Global Crossing f&uuml;r den Ausbau von AC-1 um mindestens weitere 60 Gbps
auf dann 140 Gbps bis zum M&auml;rz 2000 entschieden. J&auml;hrlich w&auml;chst der
Kapazit&auml;tsbedarf bei den Verbindungen zwischen USA und Europa um rund 80
Prozent. Dies h&auml;ngt in erster Linie mit der wachsenden Bedeutung des
Internets in seiner Funktion als Informations-, Gesch&auml;fts- und
Kommunikationsmedium in Europa zusammen.

Mit einer L&auml;nge von 14.000 Kilometern verbindet das Glasfaserkabel AC-1 die
USA mit England, den Niederlanden und Deutschland. AC-1 ist
ein redundanter SDH-Ring (Synchronous Digital Hierarchy), der ein
H&ouml;chstmass an Ausfallsicherheit bietet. Dank modernster DWDM-Technik
(Dense Wavelength Division Multiplexing) k&ouml;nnen die optischen Signale &uuml;ber
unterschiedliche Wellenl&auml;ngen transportiert werden. Dies erh&ouml;ht
die Leitungskapazit&auml;t enorm, und Global Crossing kann so die gro&szlig;e und
schnell weiter wachsende Nachfrage nach transatlantischen
Verbindungen befriedigen.

AC-1 ist aber nur ein Teil des von Global Crossing als Erbauer, Betreiber
und Besitzer initiierten internationalen etwa 6,4 Milliarden Dollar teuren
Netzwerks, das Fertigstellung erst mal das gr&ouml;&szlig;te aufgebauten Gleichzeitig
IP-basierte Glasfasernetz der Welt sein wird. Ab seinem im September
eingeweihten Kontrollzentrum in London, verbindet es auf seiner Gesamtl&auml;nge
von 140000 km 170 St&auml;dte in 24 L&auml;ndern. Die voraussichtlich bis Ende
September abgeschlossene Fusion mit dem US-Unternehmen Frontier Corporation
wird weitere St&auml;dte und 32.000 zus&auml;tzliche Netzkilometer einbringen.

Die Phase 1 des europ&auml;ischen Netzwerks geht Ende 1999 in Betrieb und
verbindet dann St&auml;dte in Deutschland, Gro&szlig;britannien, Frankreich, den
Niederlanden, Belgien und D&auml;nemark. Der irische Ring erweitert das Netz von
Land's End in Gro&szlig;britannien aus nach Dublin. Die Phase zwei
bringt weitere St&auml;dte in Deutschland, Frankreich und Italien ans Netz und
bereitet die weitere Expansion nach Spanien, Skandinavien und in
weitere europ&auml;ische L&auml;nder vor. Gemeinsam werden die Netzwerke von Global
Crossing und Frontier mehr als 200 der gr&ouml;&szlig;ten Gesch&auml;ftszentren weltweit
verbinden. In den Bereichen Webhosting, IP- Anwendungen und
Datendienstleistungen mit dem ersten durchg&auml;ngigen weltweiten Netz auf
IP-Basis sollen neue Ma&szlig;st&auml;be in der Branche gesetzt werden.


5c) Grosse Netze Teil 3:

Die regionalen Telefongesellschaften der Arbeitsgemeinschaft RegioNet haben
am ersten September ihre Netze zusammengeschaltet. Mit einer
Gesamtl&auml;nge von rund 35.000 km entsteht damit das gr&ouml;&szlig;te zusammenh&auml;ngende
Netz von Teilnehmeranschl&uuml;ssen neben der Deutschen Telekom AG.

Zu den Telekommunikationsanbietern der Arbeitsgemeinschaft RegioNet geh&ouml;ren
EWE TEL (Oldenburg), HanseNet (Hamburg), ISIS (D&uuml;sseldorf), NetCologne
(K&ouml;ln), tesion (Stuttgart) und VEW TELNET (Dortmund). RegioNet betreibt
rund 90 Prozent aller Teilnehmeranschl&uuml;sse der neuen Carrier und wickelt
t&auml;glich etwa 14 Mio. Gespr&auml;chsminuten ab. Mit der Netzzusammenschaltung
will man Synergien im wirtschaftlichen, technischen und politischen Bereich
nutzen, von denen letztendlich auch der Verbraucher profitieren soll.

Ein starkes Plus des neuen Netzwerks sei, dass jeder der sechs Carrier &uuml;ber
ein eigenes Telekommunikationsnetz verf&uuml;gt. Mit der
Zusammenschaltung ist es m&ouml;glich, auf Grund der eigenen Infrastruktur
Verbindungen von Hamburg bis Stuttgart zu realisieren. Die Systeme
verf&uuml;gen &uuml;ber eine Kapazit&auml;t von 2,5 GBits/s.


5d) Grosse Netze Teil 4:

Telekom-Tochter baut Gigabit- Wissenschaftsnetz

Nach einer europaweiten Ausschreibung hat die Telekom-Tochter DeTeSystem
den Zuschlag f&uuml;r den Aufbau des fl&auml;chendeckenden Gigabit -
Wissenschaftsnetzes (G-WiN) erhalten. Dies gab der Verein zur F&ouml;rderung des
Deutschen Forschungsnetzes (DFN-Verein) auf einer Pressekonferenz im Rahmen
der Internationalen Funkausstellung 1999 in Berlin bekannt. Das G-WiN soll
im Fr&uuml;hjahr 2000 fl&auml;chendeckend in Betrieb gehen. Der Auftrag hat ein
Volumen von etwa 140 Millionen Mark.

Das Hochgeschwindigkeitsnetz basiert auf der Wellenl&auml;ngen-Multiplex-Technik
(WDM). Unter paralleler Nutzung unterschiedlicher Lichtfrequenzen in der
Glasfaser k&ouml;nnen die Teilnehmer des G-WiN in der Startphase auf zun&auml;chst
2,5 Gbit/s, sp&auml;ter auf eine Vielzahl von 2,5 Gbit/s-Kan&auml;len zur&uuml;ckgreifen.
Die 29 Kernnetzstandorte des DFN-Vereins sind mit dem Kernnetz der
Deutschen Telekom jeweils &uuml;ber zwei voneinander unabh&auml;ngige Leitungswege
verbunden. Selbst bei Totalausfall einer Leitung, beispielsweise durch
einen Baggerschaden bei Bauarbeiten, soll so ein zuverl&auml;ssiger Betrieb
gew&auml;hrleistet werden.

Das G-WiN soll durch die DeTeSystem sukzessive ausgebaut werden. Bereits
f&uuml;r das Jahr 2001 sind an einzelnen Kernnetzknoten Datenaufkommen von &uuml;ber
25 Gigabit pro Sekunde geplant. F&uuml;r das Jahr 2002 rechnet die DeTeSystem
mit einem Bandbreitenbedarf von bis zu 80 Gigabit pro Sekunde und im Jahr
2003 sollen die Knoten bis zu 120 Gigabit pro Sekunde bew&auml;ltigen k&ouml;nnen.


5e) Grosse Netze Teil 5:

Japanische Spezialisten entwickeln Terabit-Netze

Wie das iX- Magazin in der aktuellen Ausgabe 10/99 berichtet, haben
japanische Wissenschaftler mit der sogenannten Soliton- Technologie ein
Verfahren entwickelt, das langfristig die &Uuml;bertragung von 5 Terrabit /s,
also 5 000 Gigabit pro Sekunde, erm&ouml;glichen soll.

Seit 1995 f&ouml;rdert das japanische Ministerium f&uuml;r Handel und Industrie
(MITI) das ehrgeizige "Femtosecond Project", an dem neben verschiedenen
Hochschulen auch bekannte Namen wie Fujitsu, Hitachi und Toshiba beteiligt
sind. Ziel ist, durch den Einsatz spezieller Lichtleitertechnik, der
Soliton -Wellen, die &Uuml;bertragung auf optischen Netzen in den
Terabit/s-Bereich zu hieven. Dazu ist die Beherrschung von Prozessen n&ouml;tig,
die im Bereich einer Femtosekunde (10-15 Sekunden) ablaufen - in dieser
Zeit legt ein Lichtstrahl 0,3 Mikrometer (0,0003 Millimeter) zur&uuml;ck.

Mit der verlustfreien &Uuml;bertragung von 40 Gigabit/s &uuml;ber 10.000 Kilometer
h&auml;lt Projektteilnehmer KDD, ein japanischer Elektronikkonzern, derzeit den
Weltrekord in Netz-Performance. Zum Vergleich: In Pilotprojekten f&uuml;r das
neue deutsche Wissenschaftsnetz wird derzeit mit 2,5 Gigabit/s &uuml;ber 110
Kilometer gearbeitet. Das Problem der japanischen Leitungen war bislang
allerdings deren Anbindung an lokale Rechnernetze. Hier gelang Ende Juni
1999 der Durchbruch durch den Einsatz einer speziellen
Komprimierungstechnik.

"Zu Beginn des kommenden Jahrtausends ist mit dem ersten kommerziellen
Einsatz der Soliton-Technik zu rechnen", prophezeit Bert Ungerer,
Netzwerkspezialist bei iX. "Vor allem  japanische Unternehmen d&uuml;rften davon
profitieren."

Quelle: http://www.heise.de


5f) Grosse Netze Teil 6:              Na ja. Nicht sehr gro&szlig;, daf&uuml;r ein
"Blick in die Zukunft"

Primacom bietet in Leipzig Internet &uuml;ber Kabel

Preis: unter 100 DM pro Monat

Die PrimaCom AG (WKN:625910 ) hat ihren Signal-&Uuml;bergabepunkt zur Deutschen
Telekom abgeschaltet und startet jetzt ihre eigene
Internet-Server-Plattform.
PrimaCom ist nun in der Lage den Nutzern in Leipzig vollen TV und
Video-Service anzubieten. Das neue System ist Teil einer
Multi-Service-Plattform die f&auml;hig ist analoge und digitale interaktive
TV-Services mit High-Speed-Internet zu kombinieren. Der Internet-Zugang
wird f&uuml;r "24h immer online" mit unter 100 DM im Monat angeboten. Die ersten
Nutzer des Angebots seien &uuml;berw&auml;ltigt von dem Geschwindigkeits-Vorteil.

PrimaCom widmet sich jetzt dem schnellen Erweitern bzw. Verbessern der
existierenden Netzwerke hin zum Hybrid-Fiber-Coax (HFC) Standard. Zum
Ende diesen Jahres werden 50000 Haushalte mit der neuen Technik von
PrimaCom am Netz sein. Im n&auml;chsten Jahr sollen noch einmal 100000 Haushalte
folgen. Die jetzt angeschlossenen Nutzer k&ouml;nnen im Breitband-Netzwerk mehr
als 50 TV-Kan&auml;le genie&szlig;en. Die Kanalanzahl soll mit neuen Angeboten
inklusive interaktivem Pay-Per-View schnellst m&ouml;glichst verdoppelt werden.
Die meisten Programm-Anbieter reagieren enthusiastisch auf die neue
PrimaCom- Initiative, da sie damit ihre
Programme und Services einer breiteren &Ouml;ffentlichkeit nutzbar machen
k&ouml;nnen.

Ver&auml;nderung zum Telekommunikationsunternehmen

Die Verbesserung des PrimaCom-Kabel-Systems in Leipzig ist f&uuml;r PrimaCom der
Start f&uuml;r einen Wandel vom reinen Kabel-Anbieter hin zum multimedialen
Telekommunikationsanbieter. Wie in den USA und anderen L&auml;ndern, sind
breitbandige TV-Kabel die Basis-Infrastruktur f&uuml;r alle zuk&uuml;nftigen
Kommunikations - Services. PrimaCom will dar&uuml;ber hinaus auch in anderen
St&auml;dten das neue Angebot in den n&auml;chsten Jahren einf&uuml;hren. Ausgew&auml;hlte
St&auml;dte sind Magdeburg, Chemnitz und Mainz.

F&uuml;r die HFC Plattform-Komponenten hat PrimaCom Philips ausgew&auml;hlt. SUN
wurde als Lieferant des Kernst&uuml;cks der Internet-Plattform ausgew&auml;hlt. Die
Internet - Router sind von Cisco. F&uuml;r die Modems konnte man Terayon
gewinnen. Die System-Integration wird von der ICG Berlin gehandelt.
Gestartet wird das PrimaCom "24h immer online" &uuml;ber Kabel sofern alles nach
Plan l&auml;uft, im September.

---------------------------------------------------------------------------

6.) Jetzt 19 Millionen Handy-Besitzer

Die Zahl der Handybesitzer in Deutschland ist seit Jahresbeginn um 40
Prozent auf 19 Millionen gestiegen. Laut Teilnehmer-Statistik der
Mobilfunkunternehmen bleibt Mannesmann-D2 mit acht Millionen Teilnehmern
Marktf&uuml;hrer, gefolgt von Telekom-T-Mobil mit 7,6 Millionen. Platz drei h&auml;lt
E-Plus mit mehr als drei Millionen Kunden. Viag Interkom mit ca. 100000
Kunden. Tendenz aller  Netze: Weiterhin stark steigend.

Der starke Kundenzuwachs machte aber wieder ein anderes Problemchen
deutlich. In den D1 und D2 Netzen werden die Nummern wieder knapp, sodass
neue Rufnummern vonn&ouml;ten werden und neue Zuweisungen n&ouml;tig wurden:
Der 0171 und der 0170 wurde nun auch die 0175 dem D1-Netz zugewiesen.
Der 0172 und der 0173 wurde nun auch die 0174 dem D2-Netz zugewiesen.

---------------------------------------------------------------------------

7.) Telekom - Telefonkarten l&auml;nger g&uuml;ltig

Die Deutsche Telekom verl&auml;ngert die G&uuml;ltigkeitsdauer von Telefonkarten der
ersten Generationen. Im Rahmen der f&uuml;r die Euro-Einf&uuml;hrung notwendigen
Umstellungsarbeiten wird die G&uuml;ltigkeitsdauer von 99 Monaten ausgesetzt und
um rund zwei ein halb Jahre bis zum 1. Januar 2002 verl&auml;ngert.

Alle Karten ohne aufgedrucktes G&uuml;ltigkeitsdatum verlieren nunmehr zum 1.
Januar 2002 ihre G&uuml;ltigkeit. Ausgenommen von dieser Neuregelung bleiben die
Telefonkarten mit einem aufgedruckten G&uuml;ltigkeitsdatum. Diese Telefonkarten
verf&uuml;gen &uuml;ber eine G&uuml;ltigkeitsdauer von 36 Monaten und befinden sich seit
Oktober 1998 im Markt.

Die Deutsche Telekom will ihre rund 95 000 &ouml;ffentlichen Kartentelefone
Anfang 2000 schrittweise mit einer Display-Anzeige ausstatten. Diese
Anzeige wird alle Kunden &uuml;ber die Restlaufzeit der genutzten Telefonkarte
informieren.

---------------------------------------------------------------------------

8.) Terratecs CD-Player mit MP3 Funktionen

Die Terratec Electronic GmbH, bekannt mit Soundkarten und Systeme f&uuml;r
Computer mit ISA und PCI Steckpl&auml;tzen bringt ab November mit dem "TerraTec
m3po" das erste digitale Abspielger&auml;t in den Handel, das sowohl
herk&ouml;mmliche Audio-CDs als auch MP3-CDs (MPEG-1 Audio  Layer 3) direkt
abspielen kann. Der zirka 43 Zentimeter breite, normales HiFi Rack Format,
(und damit nicht portable!) Player l&auml;sst sich problemlos an die heimische
HiFi-Anlage anschlie&szlig;en. Neben den Funktionen eines normalen CD-Players
bietet das Ger&auml;t einen Einbauplatz f&uuml;r eine 30 GB Festplatte. Damit lassen
sich komprimierte Audiodateien downloaden und zugeh&ouml;rige Playlisten
&uuml;bertragen. Die maximale Spielzeit liegt damit bei mehr als 546 Stunden
(oder 22 Tage) am St&uuml;ck. Der  m3po wird laut Hersteller 800 bis 900 Mark
kosten.

---------------------------------------------------------------------------

9.) Sony k&uuml;ndigt "unechten" MP3-Walkman an

Trotz der Kopierschutzproblematik und der Urheberrechtsverletzungen, die
mit mp 3 so richtig in den Vordergrund r&uuml;ckten, h&auml;ngt sich nun auch Sony an
den Boom der portablen MP3 Player an. Zum 20-j&auml;hrigen Jubil&auml;um des Walkmans
k&uuml;ndigte Sony &uuml;berraschend einen portablen MP3-Player an, der sich nicht
nur in seiner geringen Gr&ouml;&szlig;e und technischen Features  von der Konkurrenz
abheben soll, sondern auch dadurch, dass
er MP3-Dateien eigentlich gar nicht abspielen kann.

Der neue volldigitale Walkman spielt Musik an Stelle von  Flash-Cards
direkt von einem Memory Stick ab, den es beim  Erscheinen des Ger&auml;ts auch
in 32 und 64 MByte Kapazit&auml;t geben soll. W&auml;hrend Microsofts MS-Audio-Format
 voraussichtlich direkt unterst&uuml;tzt wird, werden direkt im MP3-Format
vorliegende Audiodaten in Sonys von der MiniDisc bekannten und mit
Kopierschutzmechanismen versehenen ATRAC3-Format
gewandelt und entweder per VAIO Notebook auf den Memory  Stick oder &uuml;ber
ILink (Firewire) direkt in den neuen Walkman  bzw. den eingestecktem Memory
Stick kopiert. Einen Firewire Anschluss haben bis jetzt jedoch die
wenigsten PCs, mit  Ausnahme von Sonys VAIO Notebooks...

Ein Grund f&uuml;r diese Vorgehensweise ist sicherlich Sonys eigenes
Plattenlabel und die damit verbundene Mitgliedschaft  in der RIAA und der
SDMI, die seit langem einen Kreuzzug  gegen das umsatzsch&auml;digende
MP3-Format f&uuml;hren.

Der "Memory Stick Walkman" wird ab Dezember 1999 in Japan und ab Januar
n&auml;chsten Jahres auch in den USA erh&auml;ltlich sein. Der Preis betr&auml;gt mit 400
US-Dollar weit mehr als f&uuml;r Sonys aufnahmef&auml;hige MiniDisc-Ger&auml;te.

---------------------------------------------------------------------------

10.) Palmcam von Panasonic speichert 1500 Bilder

Panasonic stellt mit der "PV-SD4090 Palmcam" erstmals eine digitale Kamera 
  vor, die als Speichermedium "Superdisk"-Disketten mit 120 MB Kapazit&auml;t
verwendet. Mit dieser Technik lassen sich bis zu 1500 Bilder auf einem
Medium ablegen. Herk&ouml;mmliche 1,44-MB-Floppies vertr&auml;gt die Palmcam
ebenfalls,  allerdings passen darauf nur 17 Schnappsch&uuml;sse. Die Kamera
bietet eine Aufl&ouml;sung von bis zu 1,3 Millionen Pixeln  pro Bild und verf&uuml;gt
&uuml;ber ein 2,5-Zoll-LC-Display. Bildausschnitte lassen sich &uuml;ber einen
dreifachen optischen Zoom und zweifach digital ver&auml;ndern. Die PV-SD4090
soll ab Oktober erh&auml;ltlich sein und rund 1700 Mark kosten. Um die
Superdisks in einem PC verarbeiten zu k&ouml;nnen, muss dieser &uuml;ber ein
entsprechendes Laufwerk verf&uuml;gen. Solche Ger&auml;te sind als interne und
externe Drives erh&auml;ltlich, kosten rund 400 Mark und eignen sich auch f&uuml;r
1,44-MB-Medien

---------------------------------------------------------------------------

11.) CDs mit achtfacher Geschwindigkeit brennen

Mit einem neuen CD-ReWriter stellt Acer den derzeit schnellsten CD-Brenner
mit E-IDE/ATAPI- Schnittstelle vor.
Der CRW 8432A brennt einmal beschreibbare CD-Recordables (CD-Rs) mit
achtfacher Geschwindigkeit, wiederbeschreibbare CD - Rewriteables (CD-RWs)
werden mit vierfacher Geschwindigkeit beschrieben; gelesen werden die
Scheiben  mit 32-facher Geschwindigkeit.
Für eine extrem hohe Zuverl&auml;ssigkeit beim Brennen sollen acht MByte
Pufferspeicher sorgen. Firmware-Updates k&ouml;nnen von der Acer Website
heruntergeladen und in den Flash-Speicher des Ger&auml;tes kopiert werden. Der
CRW 8432A wird mit umfangreicher Brenn-Software, Handbuch, Einbauzubeh&ouml;r,
einem CD-RW- und zwei CD-R-Rohlingen ausgeliefert und soll ab Mitte Oktober
f&uuml;r 599,- DM verf&uuml;gbar sein.

---------------------------------------------------------------------------

12.) Anl&auml;sslich der IFA in Berlin gab Sony Deutschland die Verkaufszahlen
der Playstation bekannt.

Die Sony Computer Entertainment Deutschland (SCED) GmbH hat seit der
Markteinf&uuml;hrung von PlayStation am 29. September 1995 3,2 Millionen
St&uuml;ck Hardware und 7,5 Millionen Zubeh&ouml;rprodukte verkauft. Im gleichen
Zeitraum wurden einschlie&szlig;lich Lizenznehmer 16,5 Millionen Spiele-CDs
abgesetzt. Mit 76,2 Prozent Marktanteil Hardware (GfK 1/99 bis 6/99)
festigt PlayStation mit Abstand die Marktf&uuml;hrerschaft.

12a) Mittlerweile wurden weiter Details zur Playstation 2 bekannt gegeben.

Sony hat auf der Mitte September in Japanstattfindenden Tokyo-Game-Show die
technischen Daten sowie die Pl&auml;ne f&uuml;r die weltweite Markteinf&uuml;hrung bekannt
gegeben. Ab dem 4. M&auml;rz 2000 soll die Konsole in Japan f&uuml;r 39.800 Yen
verf&uuml;gbar sein. Gleich eine Million St&uuml;ck will Sony zum Verkaufsstart an
den Handel ausgeliefert haben. Zum Herbst 2000 soll die Playstation 2 dann
auch zeitgleich in Europa und den USA erh&auml;ltlich sein.

Neben den Details zur Markteinf&uuml;hrung hat Sony auch einige Informationen
zur technischen Ausstattung freigegeben, die recht beeindruckend klingen.
Die Playstation 2 soll nicht nur zur alten Playstation kompatibel sein,
sondern nun definitiv auch DVD-Videos wiedergeben k&ouml;nnen, ein Feature, das
teureren DVD-Playern den Todessto&szlig; versetzen k&ouml;nnte.

Die Konsole wird mit einem "Dual Shock 2 Gamepad, einer 8MB Memory Card,
einem Verbindungskabel zum Fernseher und einer PlayStation2 Demo DVD
ausgeliefert. In ihrem Innern werkelt neben einem 4-fach DVD-ROM eine
Emotion Engine genannte 128-Bit CPU mit 294,912 MHz Taktfrequenz, einen
Grafik-Synthesizer mit 4 MByte integriertem VRAM und einer Taktfrequenz von
147 MHz und insgesamt 32 MByte schnelles Direct RDRAM als Hauptspeicher.
F&uuml;r den guten Klang sorgt die Sound SPU2, die 48 Stimmen in Hardware bietet
und mit 2 MByte Speicher aufwartet. F&uuml;r den Datenaustausch sorgt der IOP
I/O Prozessor, der mit 33,9 MHz oder wahlweise 36,8 MHz getaktet wird. Was
die Playstation 2 an Anschlussm&ouml;glichkeiten mit sich bringt, l&auml;sst selbst
PCs mit USB alt aussehen: Neben dem von der Playstation 1 bekannten Memory
Card Schacht gibt es einen optischen Digitalausgang f&uuml;r optimalen Klang,
einen USB-Port, einen i.Link (Firewire, IEEE1394) Port und sogar einen Typ
III  PCMCIA Card (PC Card) Schacht. Das l&auml;sst auf zahlreiche Erweiterungen
wie beispielsweise Festplatten, Modems oder &Auml;hnliches hoffen. Eine
Netzwerkkarte f&uuml;r den PC Card Schacht hat Sony f&uuml;r 2001 angek&uuml;ndigt.

Neben den mittlerweile &uuml;ber 600 alten Playstation Softwaretiteln soll zur
Markeinf&uuml;hrung der Playstation 2  zahlreiche Titel verf&uuml;gbar sein. Zwar
nennt Sony noch keine  Zahlen, doch haben schon 89 Publisher in Japan, 46
US- Publisher  und 27 europ&auml;ische Publisher zumindest Absichtserkl&auml;rungen
unterzeichnet, um Software f&uuml;r Sonys Traumkonsole zu  entwickeln.

Besonders interessant ist nat&uuml;rlich die Frage, wie Sony denn nun gedenkt,
die Playstation 2 Internet-tauglich zu machen. Hier scheinen hochgesteckte
Pl&auml;ne zu existieren, die eine Verbindung der Playstation 2 mit Highspeed
Netzwerken z.B. per Breitband-Kabel vorsehen. PlayStation2 Nutzer sollen so
die M&ouml;glichkeit haben, selbst datenintensive Inhalte auf von Sony
angebotene Festplatten zu sichern. Ein von Sony entwickeltes elektronisches
Transaktionssystem mit Authentifizierungs- und Verschl&uuml;sselungstechnologie
soll dabei die Abrechnung erm&ouml;glichen. Ein "E-Distribution Server" soll
dabei mit der bereits erw&auml;hnten Netzwerkkarte ab 2001 zur Verf&uuml;gung stehen
und der Schl&uuml;ssel f&uuml;r einen ertr&auml;glichen
Markt der Zukunft sein.

Eine ganze Ausgabe h&auml;tte es f&uuml;llen k&ouml;nnen: Nintendos aufgebohrter "Gameboy
Advance" eine weiterentwickelte Version mit Internet-Anbindung (via
Mobiltelefon), der trotz peinlichen Pannen unglaublich erfolgreicher
Dreamcast Verkaufsstart in den USA, Dolphin Pl&auml;ne, die Sache mit Billys
Spielkonsole und eben ausf&uuml;hrlicher &uuml;ber die PSK 2.
Alleine was Sony mit der PSX 2 ank&uuml;ndigt, macht nicht nur Hersteller von
PC-Grafikchips neidisch, sondern d&uuml;rfte vor allem die Konsolen Konkurrenz,
Anbieter von Settop-Boxen und die Hersteller von DVD-Playern zum Zittern
bringen. Mit der PSX k&ouml;nnte Sony als bisher einziger Hersteller eine 
"all-in-one" Hardware liefern, die den Einstieg in ein neues,
hochqualitatives vernetztes Unterhaltungszeitalter erm&ouml;glicht und
gleichzeitig einen weiteren milliardenschweren (hey, ein neues
Lieblingswort von mir) lukrativen Markt f&uuml;r  Unterhaltungsanbieter
schaffen. Macht aber im Hinblick auf die Phantasien vieler Amiga Optimisten
deutlich, dass es l&auml;ngst nicht mehr ausreicht eine Kiste rauszubringen, die
eine momentan schnelle CPU hat und einfach nur ein Desktop Computer ist.

Da kann man noch so viele offene Briefe schreiben und einen "Computer"
fordern.  Meine Meinung.

---------------------------------------------------------------------------

13.) In der Telekommunikation bricht mit EMPRISE mediascape ein neues
Zeitalter an:

510mal schneller ins Internet als per ISDN

Hamburg, 21. September 1999 - Der Zugang zum Internet wird jetzt noch
einfacher und schneller: Erstmals in Deutschland ist Richtfunk mit 34
Megabits pro Sekunde im produktiven Betrieb. Die Hamburger  mediascape
communications GmbH, die zur Emprise Unternehmensgruppe geh&ouml;rt, erm&ouml;glicht
jetzt in Hamburg die &Uuml;berbr&uuml;ckung der "letzten Meile" mit 510-facher
ISDN-Geschwindigkeit.

Die enorme Leistungsf&auml;higkeit der Richtfunktechnik mit 34 Megabit
erm&ouml;glicht neben dem Express-Zugang ins Web auch den problemlosen und
schnellen Transport besonders gro&szlig;er Datenmengen, wie sie f&uuml;r e-commerce
Dienste und e-business L&ouml;sungen ben&ouml;tigt werden. Die Integration von
Sprache und umfangreichen Datenmengen in hoher Qualit&auml;t ist die Grundlage
f&uuml;r leistungsf&auml;hige L&ouml;sungen, mit denen die Anwender das Internet in alle
Gesch&auml;ftsprozesse integrieren k&ouml;nnen. Nach Hamburg, das bereits mit der
Richtfunktechnik von mediascape fl&auml;chendeckend erschlossen ist, werden bis
zum Jahresende neun weitere St&auml;dte vernetzt: Berlin, Dortmund. D&uuml;sseldorf,
Duisburg, Essen, Frankfurt am Main, Hannover, M&uuml;nchen und Stuttgart. Zur
Nutzung der innovativen Telekommunikations&uuml;bertragung ben&ouml;tigen Kunden
lediglich eine Miniantenne mit dem Durchmesser einer Literflasche, die an
den Computer oder das Netzwerk angeschlossen wird.

Die einmaligen Installationskosten beginnen ab 2.500 Mark. Die laufenden
Geb&uuml;hren sind wettbewerbsf&auml;hige Konditionen und sind nicht h&ouml;her als die
der Carrier, die normale ISDN- Geschwindigkeiten anbieten. Ganz besonders
wichtig: Innerhalb des Richtfunknetzes sind Telefongespr&auml;che kostenlos!

Genutzt werden High-speed-wireless-connectivity-L&ouml;sungen bereits von
Baum&auml;rkten und Lebensmittelketten, die mehrere Filialen mit diesem System
ausgestattet haben, um intern Daten auszutauschen und schneller als jemals
zuvor in die globalen Datennetze zu kommen. Auch Agenturen und
Medienunternehmen nutzen die gro&szlig;e Bandbreite f&uuml;r den Transport gro&szlig;er
Datenmengen. Gro&szlig;unternehmen bauen sich mit Richtfunk ein kabelloses
Intranet oder Extranet auf. 34 Megabit pro Sekunde erlauben zudem das
&Uuml;berspielen von Unternehmensvideos und Live- &Uuml;bertragungen etwa von
Hauptversammlungen ebenso wie Video-on- demand, also das kabellose Abrufen
von Spielfilmen. Diese Anwendung ist interessant f&uuml;r Hotels, aber auch f&uuml;r
den privaten Nutzer.

Ob und wie weit es f&uuml;r den privaten Nutzer einsetzbar sein wird, muss die
Zukunft zeigen. Zumal endlich auch wirklich schnelle HighSpeed Alternativen
auf den Markt dr&auml;ngen. Ob T-DSL, &uuml;bers Kabel, mit oder ohne R&uuml;ckkanal und
neuerdings &uuml;ber Satteliten mit Sky-DSL MIT R&uuml;ckkanal.

Thomas Hasemann &lt;1145-87@onlinehome.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
