<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Technik & Net NEWS: Internet

Hallo zur Oktober Ausgabe der Technik und Netz News:    Internet & Co

1.)  Erste IPv6-Adressen in Deutschland vergeben

Neues Internet-Adresssystem / In 10 Jahren fl&auml;chendeckend verbreitet
Als erster deutscher Internet-Anbieter arbeitet die SpaceNet GmbH in
M&uuml;nchen mit IP-Adressen aus dem neuen  IPv6-System. Die zentrale
europ&auml;ische Beh&ouml;rde RIPE teilte dem Unternehmen jetzt ein erstes Kontingent
zu. IPv6 l&ouml;st als Nachfolger des Bestehenden Internet Protocol Version 4
(IPv4) das Problem mit der zunehmenden Verknappung von Adressbereichen im
Netz, das sich durch die gro&szlig;e Zahl neuer Anbieter in den letzten Jahren
zunehmend versch&auml;rft hat.

IPv6 bietet neben erh&ouml;hter Sicherheit Trilliarden m&ouml;glicher IP-Adressen, so
dass es theoretisch m&ouml;glich sei, jedem Stern im Universum eine individuelle
Zahlenkombination zuzuordnen. Eine andere Studie will errechnet haben, dass
jeder Quadratmeter der Erde theoretisch mit 1.500 eigenen IP Adressen
versorgt werden k&ouml;nne. Genug Expansionsraum also f&uuml;r ein System, das nach
Einsch&auml;tzung von Experten innerhalb der n&auml;chsten zehn Jahre fl&auml;chendeckend
Verbreitung finden wird.
 Quelle: http://www.Stern.de/ Edupage NL

Naja, wenn man bedenkt, dass allein im Zuge der IFA 99 in Berlin einige
neue Planungsstudien ver&ouml;ffentlicht wurden, nach denen wir in den n&auml;chsten
Jahren mit einer Ausbreitung des Internets in der &Ouml;ffentlichkeit zu rechnen
habe, ist das auch bitter n&ouml;tig. Jedes Auto, jede Zapfs&auml;ule, jeder
Telefonzelle, jeder gr&ouml;&szlig;ere Aufzug ans Internet mit eigener IP. Jeder
Mensch mit implantierten Mini-Webserver eine eigene IP!!

2.)   Der kleinste Web-Server der Welt

Web- Anschluss im Stecknadel-Format / Weltrekorde auf minimalem Raum

Das Internet dringt langsam aber stetig in alle Lebensbereiche vor, auch
die dazu n&ouml;tige Hardware wird immer kleiner. Der von einem Informatik
-Studenten an der Universit&auml;t von Massachusetts entwickelte Web-Server
unterbietet alles, was auf diesem Gebiet bisher bekannt war. Der 31-j&auml;hrige
H. Shrikumar hat einen Web-Server auf einem Microchip untergebracht, der
einen l&auml;ppischen US-Dollar wert ist und kaum gr&ouml;&szlig;er als ein Stecknadelkopf
ist.

IPic, der auf einem 1024 Byte fassenden EEPROM Platz hat, ist nicht nur von
den &auml;u&szlig;eren Abmessungen her winzig. Absolut minimalistisch ist auch die
Software, die wohl einige Weltrekorde f&uuml;r sich beanspruchen kann. So
umfasst der TCP/IP-Stack lediglich 256 Byte (!), wenige zus&auml;tzliche Bytes
werden vom HTTP-(Web)-Server, einem Telnet-Daemon, einem SLIP
Verbindungsprotokoll und einem Mini-Dateisystem belegt. Damit ist sogar
noch Platz f&uuml;r 32 Dateien verschiedenen Typs, von HTML bis zum Java-Applet.

Der Chip ist direkt an einen Router angeschlossen und kann so &uuml;ber das
Internet erreicht werden. Neben den geringen Kosten k&ouml;nnte vor allem die
Einfachheit dieser Entwicklung eine gro&szlig;e Zukunft bescheren. W&auml;hrend andere
Hersteller komplexe Hardware und Protokolle f&uuml;r vernetzte Kleinger&auml;te
entwickeln, baut diese L&ouml;sung auf etablierte Standards auf - vielleicht ist
bald schon jede Gl&uuml;hbirne &uuml;ber HTTP erreichbar...

Quelle www.interworld.de

Was hei&szlig;t hier Gl&uuml;hbirne. Sobald das unbedeutende Problem der drahtlosen
&Uuml;bertagung kosteng&uuml;nstig gel&ouml;st ist,.... jeder Herzschrittmacher. Oder
besser, mit ein wenig mehr Elektronik, das ganze in der N&auml;he des Ohres
eingepflanzt und nach au&szlig;en gef&uuml;hrt, haben wir dann im Prinzip das, wie in
den diversen StarTrek NG Serien, die Sache mit dem Universal &Uuml;bersetzer
gel&ouml;st ist. Wer sich noch dran erinnern kann, demn&auml;chst in einer Deep Space
9 Wiederholung, wenn Quark mit seinem Bruder per Shuttle Unfall auf die
Erde des Jahres 1946 kommt. Nach Rosswell !

3.)  Dell plant PC-Winzling f&uuml;rs Internet

Meiner Meinung nach, hatten sich Amiga Anh&auml;nger in der Entwicklung der
letzten Wochen zu sehr auf die Ger&uuml;chte oder Pl&auml;ne von Microsoft versteift,
eine Spielkonsole rauszubringen. Stein des Ansto&szlig;es war wohl die Bemerkung
mit der Zusammenarbeit mit Dell oder GTW. Das k&ouml;nnte die Hardwareseite
sein. Sch&ouml;n, aber beide lassen, selbst wenn es Firmen sind, die Dell oder
GTW geh&ouml;ren, nur zusammenpfuschen. Die Entwicklungen kommen von anderen.
Die Softwareseite, die ist fest belegt mit Windows CE. Nat&uuml;rlich nicht
ausgeschlossen, dass MS ein paar zus&auml;tzliche kleine Tools braucht. Aber
anzunehmen, MS k&ouml;nnte GTW wegen den Amiga/Linux Pl&auml;ne erpressen oder MCC OS
Teile verlangen, halte ich gelinde gesagt f&uuml;r aberwitzig gr&ouml;&szlig;enwahnsinnigen
Schwachsinn. Das auch, wenn nicht im Moment im Rahmen des Kartellprozesses
in den USA, Microsoft gerade froh w&auml;re, wenn kurzfristig ein paar
"Konkurrenten" auftauchen w&uuml;rden. Dell, die gerade Compaq bei den
Verkaufszahlen bei Consumer PCs als Nummero Uno abgel&ouml;st haben, hat auch
weiter Intentet Pl&auml;ne.

PC-Hersteller Dell will ab Herbst einen abgestrippten Klein-PC vermarkten,
der vor allem dem einfachen Internet-Zugang dienen soll. Firmenchef Michael
Dell habe den Winzling mit dem Codenamen "Webster" auf einer
Firmenkonferenz in Austin gezeigt, meldet der US-Onlinedienst News.com. Dem
Bericht zufolge wird der Webster weder Floppy- noch CD-ROM-Laufwerk
aufweisen, der einzige Kontakt zur Au&szlig;enwelt soll in USB-Ports bestehen.
ISA-Slots werde es ebenfalls nicht geben. Das rundliche Geh&auml;use &auml;hnele dem
einer Kaffeemaschine, wird ein Konferenzteilnehmer zitiert. Damit trage
Dell dem aktuellen Design-Trend Rechnung, der sich in der Nachfrage nach
Apples popul&auml;ren iMac zeige. Bunt ist es freilich nicht -- zumindest der
gezeigte Prototyp trug schlichtes Schwarz

Ein weiterer Beweis wie armselig l&auml;cherlich und engstirnig gewisse
&Auml;u&szlig;erungen diverser Amiga Koryph&auml;en sind.

---------------------------------------------------------------------------

4.) Wie gro&szlig; war nach dem Somm Urteil das Geschrei - "Ein weiterer Sagnagel
f&uuml;r den Standort Deutschland im Internet Bereich," und was wei&szlig; ich noch
alles. Im Vergleich dazu sind die Tendenzen aus den USA, die ich letzten
Monat schon angerissen habe, nur ein harmloses Sandkastenspiel. Ein
weiterer Sargnagel, diesmal aus England. Das Internet wird mal wieder als
Verursacher aller Taschentuchflecken, vergewaltigter Kinder und Ursache
aller Verklemmten-Probleme hingestellt. Oder der Irrsinn gewisser
Begr&uuml;ndungen: Da wird der oben genannte Schaden des Standorts Deutschland
nach dem Somm Urteil damit begr&uuml;ndet, dass alle Server und damit
qualifizierte Arbeitspl&auml;tze in die USA auswandern und bei folgendem Urteil
wird einer verknackt, obwohl die Server in den USA stehen.

Verurteilt f&uuml;r "grenzenloses" Porno-Angebot

In einem Strafprozess wegen illegaler Verbreitung von Pornographie in
Gro&szlig;britannien ist der 28-j&auml;hrige Gesch&auml;ftsmann Graham Waddon aus Sutton zu
einer Freiheitsstrafe von 18 Monaten verurteilt worden. Die Strafe wurde
gestern auf zwei Jahre zur Bew&auml;hrung ausgesetzt.

Der Strafaussetzung war bereits im Juli ein wegweisendes Grundsatzurteil
des britischen Richters Christopher Hardy zu illegalen Internet-Aktivit&auml;ten
vorausgegangen, das nach Auffassung von Beobachtern international Einfluss
auf die k&uuml;nftige Rechtsprechung haben k&ouml;nnte. Sutton betrieb mehrere
Pornographie-Websites auf einem Server in den USA. Dort gelten harte
Porno-Angebote an Erwachsene nicht als illegal, sofern eine oberfl&auml;chliche
Alterspr&uuml;fung stattfindet. Richter Hardy sah jedoch den Tatbestand der
Ver&ouml;ffentlichung in Gro&szlig;britannien, wo h&auml;rtere Gesetze gelten, als erwiesen
an, weil die Inhalte auch dort &uuml;ber das Internet abzurufen waren.

Quelle http://www.heise.de

---------------------------------------------------------------------------

Ohne weiteren Kommentar: Ich hab doch noch Hoffnung was den gesunden
Menschenverstand bei Juristen angeht!

5.) Musikindustrie scheitert mit Urheberrechts-Klage

17j&auml;hriger Schwede freigesprochen / Link allein nicht strafbar
Die europ&auml;ische Musikindustrie ist mit ihrem ersten Versuch gescheitert,
vor Gericht ein Exempel gegen die illegale Verbreitung von Musik im
Internet zu statuieren . Wie "Svenska Dagbladet" heute meldete, sprach das
Amtsgericht in Sk&ouml;vde den 17-j&auml;hrigen Angeklagten vom Vorwurf frei, auf
seiner Homepage durch Auslegung von illegalen Kopien im MP3- Format das
Urheberrecht der Musiker und ihrer Plattengesellschaften verletzt zu haben.
Das Gericht begr&uuml;ndete den Freispruch damit, dass der 17-j&auml;hrige niemals
selbst Musik ins Netz gestellt, sondern nur Verbindungen zu anderen Links
mit Musik angegeben habe.

Die europ&auml;ische Branchenorganisation IFPI der Musikindustrie hatte mit dem
Prozess in Schweden erstmals einen Anlauf genommen, per Anzeige und danach
geplanten Schadensersatzforderungen die galoppierend um sich greifende
Verbreitung von Musik-Piraterie im Internet zu stoppen. Juristische
Experten in Schweden hatten eine Verurteilung von Johan wegen Verletzung
des Urheberrechts mit einem verh&auml;ltnism&auml;&szlig;ig niedrigen Bu&szlig;geld erwartet,
weil der Angeklagte noch zur Schule geht und kein Einkommen hat.
Anschlie&szlig;end w&auml;re aber ein zivilrechtliches Verfahren mit
Schadensersatzforderungen in Millionenh&ouml;he auf ihn zugekommen.

Der 17-j&auml;hrige hatte selbst berichtet, dass er die Links zu MP3-Dateien nur
auf seine Homepage gesetzt habe, weil sie damit sehr hohe Besucherzahlen
erreichte. "Ich dachte, damit w&uuml;rde meine Popularit&auml;t steigen", meinte
Johan. Er hatte keinerlei kommerziellen Interessen und betrachtete das
Laden von Musik in MP3-Dateien als "v&ouml;llig normal, weil ja alle es tun".

Sein Vater, auf dessen PC der Jugendliche seine Homepage anlegte, erkl&auml;rte,
f&uuml;r ihn seien die Aktivit&auml;ten des Sohnes dasselbe wie fr&uuml;her das Kopieren
von Musik auf Tonband. Die schwedische Abteilung von IFPI begr&uuml;ndete ihre
Klage damit, dass Johan mehrere Mahnungen zum Stopp mit den MP3- Links
unbeachtet gelassen habe. "Wir wollten zeigen, dass es uns ernst ist mit
dem Kampf gegen die Piraten", meinte IFPI-Jurist Magnus Martensson.

---------------------------------------------------------------------------

6.) 30. Geburtstag des Internet erst im Oktober

Neue Recherchen belegen die tats&auml;chlichen Ereignisse
In unz&auml;hligen Artikeln und News Meldungen wurde k&uuml;rzlich der 30. Geburtstag
des Internet abgefeiert. Einen Beleg f&uuml;r das bisher angenommene Datum der
ersten gegl&uuml;ckten Internet-Verbindung am 8.9.1969 hat es bisher allerdings
nicht gegeben. Jetzt liegen Beweise f&uuml;r das tats&auml;chliche Datum vor.

Charley Kline, ehemals Student an der University of California L.A. (UCLA)
und nun Senior Technologist bei Cisco, hat bei neuen Recherchen in einem
alten Logbuch das definitive Datum herausgefunden. Es war der 29. Oktober
1969, an dem ihm die erste Daten&uuml;bertragung zwischen UCLA und dem Labor von
Douglas Engelbart am Stanford Research Institute (SRI) in Menlo Park
gegl&uuml;ckt ist. Das bisher angegebene Datum beruht auf einer Meldung von der
UCLA, der zufolge am Institut von Professor Leonard Kleinrock intern eine
erstmalige Verbindung zwischen zwei Rechnern zustande kam.

Bei der Versuchsanordnung handelte es sich um einen "Interface Message
Processor" (IMP) Honeywell 516 Minicomputer (in der Gr&ouml;&szlig;e einer
Gefriertruhe) und dem Mainframe des Labors, eines Scientific Data Systems
Sigma-7. Am 2. September gelang es erstmals, Daten zwischen Sigma-7 und dem
IMP auszutauschen, die etwa 5 Meter auseinander standen. Die erste echte
Internetverbindung zwischen UCLA und SRI wurde &uuml;ber eine
50-KBit/s-Telefonleitung realisiert.

Weshalb das Datum in Vergessenheit geraten war, lag daran, dass man die
historische Bedeutung des Vorgangs nicht erkannte, erinnert sich Douglas
Englebart: "Es war f&uuml;r uns so etwas wie 'Prima, den Motor haben sie jetzt
eingebaut, also k&ouml;nnen wir das Auto allm&auml;hlich zum Laufen bringen'".

Ins Rollen kamen die neuesten Recherchen im Rahmen einiger
Gedenkveranstaltungen, die nach dem Tod des Internet- und
Domain-Name-Pioniers Jon Postel im letzten Jahr abgehalten wurden. Nachdem
Kleinrock seine Lobrede zusammen mit einigen Bildern per eMail an die
Beteiligten verschickte, erkannte Kline auf einem Bild eine Logbuchseite
des IMP. Handschriftlich hatte er damals eingetragen "29OCT69" und die
kurze Bemerkung: "10:30 p.m. ... talked to SRI host to host".

---------------------------------------------------------------------------


7.) Mal abgesehen davon, dass Stefan Raab bessere Quoten hat wie Harald
Schmidt..... .

Nach der aktuellen Studie des Marktforschungsunternehmens Media Metrix
(MMXT) f&uuml;r den Monat August 1999, konnten die Internet-Seiten der f&uuml;hrenden
Suchmaschine Yahoo.com das lange Zeit f&uuml;hrende Internet-Portal AOL.com von
der Spitzenposition verdr&auml;ngen. Yahoo.com verzeichnete danach 33,4
Millionen Visitors, w&auml;hrend AOL.com 29,3 Millionen Seitenbesucher
verzeichnen konnte. Auf den weiteren Pl&auml;tzen folgen MSN.com mit 28,1
Millionen Besucher, sowie Geocities.com mit 21,4 Millionen Visitors und
Netscape.com mit 19,8 Millionen Seitenbesucher.

CBS Marketwatch.com

---------------------------------------------------------------------------

8.) Jedem sein eigenes Spam-Register

Die EU-Kommission hat dem EU-Ministerrat einen Entwurf zur Abstimmung
vorgelegt, dem zufolge jeder der 15 Mitgliedsstaaten eine eigenes Register
f&uuml;r Internet-Nutzer einrichten soll, die keine unerw&uuml;nschten Werbe-E-Mails
("Spam") erhalten wollen. Bis man sich aber wirklich in eine solche
"digitale"  Robinson-Liste" eintragen kann, wird wohl noch einige Zeit ins
Land gehen: Eine erste Entscheidung des Ministerrats    ist nicht vor
Dezember zu erwarten. Diese h&auml;tte eine formelle Anerkennung der Richtlinie
Mitte 2000 zur Folge, die eigentliche Umsetzung des Beschlusses w&uuml;rde
weitere 18 Monate dauern. Und basieren soll das ganze dann auf einer
freiwilligen nicht durch noch weiter Gesetze, geregelte Ansichtserkl&auml;rung
der Industrie.

Aber wie die Erfahrungen mit "Freiwilligkeit" und "Industrie" aus den USA
zeigt, solch ein Gesetz ist ein weiteres Argument gegen das vereinte Europa
und mit Steuergelder bezahlten Beamten.
Da hilft nur das konsequente einhalten einer "Free - eMail -Adressen-
Strategie". Es muss nicht jeder so wie ich aktuell alleine 4 dieser
Adressen haben, eine reicht dann, die man bei allem was nicht privat,
dienstlich oder gesch&auml;ftlich ist, angibt. Wobei man da auch nicht immer
sicher sein kann. Sonst die Free-Mail Adresse angeben. Sollten die
Werbemails &uuml;berhand nehmen. Die Free-Mail entsorgen und sich eine neue
besorgen. Eine Sache von max. 20 Minuten, wenn &uuml;berhaupt.

---------------------------------------------------------------------------

9.) Bald eine Million deutsche Domain-Namen

Die Zahl der auf ".de" registrierten Internet-Adressen n&auml;hert sich rasant
der  Eine-Million-Marke. Bereits jetzt sind 915 000 deutsche Domains bei
der Zentralstelle Denic in Frankfurt gelistet, Anfang des Jahres waren es
lediglich 325 000. Der Grund f&uuml;r den rapiden Anstieg der Anmeldungen liegt
nach Ansicht der Denic in den gesunkenen Geb&uuml;hren f&uuml;r die Domain-Vergabe.
Bei der Verwaltungs- und Betriebsgesellschaft Denic m&uuml;ssen f&uuml;r die direkte
Anmeldung im ersten Jahr 232 Mark berappt werden. Internet-Service
-Provider bieten den gleichen Dienst noch g&uuml;nstiger an - teilweise f&uuml;r
lediglich 50 Mark. Durch die niedrigeren Preise dr&auml;ngen sich neben den
Unternehmen zunehmend Privatleute um die begehrte "Top Level Domain" 
(TLD). Denic-Vorstand Michael Merz hofft, dass bis zum Jahreswechsel
weitere Endungen zur Verf&uuml;gung stehen werden. Denkbar w&auml;ren beispielsweise
die Endung ".shop" f&uuml;r Online-Shopping, ".firm" f&uuml;r Unternehmen und ".priv"
f&uuml;r den privaten Anwender.

---------------------------------------------------------------------------

10.) Bundesverfassungsgericht ist online

Prof. Dr. Jutta Limbach (SPD) Initiatorin des Internetauftritts

Das Bundesverfassungsgericht aus Karlsruhe ist seit Montag, 20 September
online. Neben den Informationen zu den einzelnen Richtern gibt es s&auml;mtliche
Verfassungsgerichtsurteile ab dem 1. Januar diesen Jahres an online, als
Volltext nachzulesen.

Neben den allgemeinen Informationen und den Kurzbiografien der einzelnen
Richter gibt es ab sofort auch s&auml;mtliche Entscheidungen, die das Gericht ab
in den Jahren 1998 und 1999 getroffen hat, im Internet als .pdf File. Neue
Urteile will die Justizbeh&ouml;rde innerhalb von ein bis zwei Tagen auf dem
Server zur Verf&uuml;gung stellen.

Die Pr&auml;sentation ist in Zusammenarbeit mit dem Institut f&uuml;r
Rechtsinformatik der Universit&auml;t des Saarlandes erstellt worden. Mit der
Pr&auml;senz im Internet will das Bundesverfassungsgericht einen weiteren
Schritt in Richtung B&uuml;rgerservice machen. Grund war auch, die Beh&ouml;rde zu
entlasten, da je nach Entscheidungen in einer Woche schon mal bis zu 2000
spezifische Anfragen an die Mitarbeiter gestellt wurden.

Eine der Initiatorinnen war Bundesverfassungsgerichtspr&auml;sidentin Prof. Dr.
Jutta Limbach (SPD), die gerade im Ausland, immer wieder auf eine
Internetpr&auml;senz angesprochen worden. Vor allem in den osteurop&auml;ischen
Staaten sollen angeblich deutschsprachige Juristen gerne auf die Urteile
des Gerichts zur&uuml;ckgreifen.

---------------------------------------------------------------------------

11.) Der Themenabend: Internet Auktionen eBay (NASDAQ: EBAY)

Bei b&ouml;rsennotierten Firmen wie eBay, die eine derart exorbitante Bewertung
aufweisen, achtet man ganz besonders auf Nachrichten, die Einfluss auf die
Einnahmen mache. Ebay kam daher auch erst mal nur in Schlagzeilen, als vor
Wochen technische Problem mit den Servern auftraten und dadurch auch keine
Auktionen und daher auch keine Ums&auml;tze generiert werden konnten.
Mittlerweile hat sich daran einiges ge&auml;ndert. Die Nachrichten gehen nun
mehr ans eingemachte.

Eine kleine Zusammenfassung:
1995: eBay wird von Pierre Omidyar gegr&uuml;ndet Das Unternehmen hat heute &uuml;ber
6 Millionen registrierte Mitglieder, die an mehr als 2,5 Millionen
Auktionen in weit &uuml;ber 1.600 Kategorien teilnehmen.

Ende 1998: eBay untersagt das Handeln mit lebenden Tiere und
jugendgef&auml;hrdende Schriften sowie die Darstellung von Bildern, die gegen
die guten Sittenversto&szlig;en.

Anfang 1999: Ebay untersagt die Versteigerung von Feuerwaffen

Mai 1999: eBay &uuml;bernimmt das erst Anfang 99 gegr&uuml;ndete deutsche
Onlineauktionshaus alando.de AG, woraus eBay Deutschland entsteht.

03.09.99 Ebay Deutschland startet B-2-B-Auktionen
Ebay Deutschland hat als erster europ&auml;ische Anbieter mit
Business-to-business-Auktionen begonnen. In einem eigens eingerichteten
Auktionskanal  "Handel, Industrie und Handwerk" k&ouml;nnen sich Unternehmen
gegenseitig ihre Produkte anbieten. Zum Start sind bereits &uuml;ber 500
gewerbliche Waren von Baumaschinen &uuml;ber Gastronomieeinrichtungen bis hin zu
Textilien im Angebot. Nach Ansicht von Ebay eignen sich vor allem
Restposten und &Uuml;berschussware (ein Markt von 30 Milliarden Mark j&auml;hrlich
allein in Deutschland) besonders gut f&uuml;r den Verkauf &uuml;ber den virtuellen
Auktionsraum.

05.09.99 5,7 Millionen Dollar f&uuml;r menschliche Niere
Das amerikanische Internet-Auktionshaus musste harsche Kritik einstecken,
als bekannt wurde, dass auf eBay f&uuml;r eine  menschliche Niere Gebote
angenommen wurden. Insgesamt boten die Besucher mehr als 5,7 Millionen
Dollar f&uuml;r die Niere. Bei bekannt werden wurde die Auktion von eBay sofort
abgebrochen. Das Angebot dieser laut Werbetext  "voll funktionierende
Niere" stand bereits eine Woche im Netz und hatte ein Startgebot von 25.000
Dollar.

06.09.1999 Raubkopien &uuml;berschwemmen Online-Auktionen; Erhebung in den USA:
60 Prozent der Software illegal
Software-Piraten nutzen verst&auml;rkt Internet-Auktionen zum Verkauf ihrer
"Produkte". Das ist das Ergebnis einer Untersuchung in den USA.
Ann&auml;hernd 60 Prozent der Software, die auf den Seiten der drei gro&szlig;en
US-Online-Auktionsh&auml;user Ebay, ZDNet Auction und Excite
Auction unter den Hammer kommt, besteht aus Raubkopien. Diese
Schlussfolgerung trifft die Software and Information Industry Assiociation
(SIIA), nachdem sie eine Woche lang konzentriert das Angebot im Netz unter
die Lupe genommen hatte. Von 181 Auktions-Offerten stellten sich
109 als Raubkopien heraus.

14.9.1999 Auktionshaus eBay stellt Versteigerungen von Alkohol,
Tabakwaren und Tabak-Accessoires ein.
Das Internet-Auktionshaus eBay k&uuml;ndigte an, ab dem 13. Oktober, auf seiner
amerikanischen Web-Site keine Versteigerungen von Alkohol und Tabakwaren
mehr auszurichten. Grund hierf&uuml;r seien die von Staat zu Staat
unterschiedlichen Gesetzesrichtlinien, wobei vor allem die zahlreichen
Sonderregelungen f&uuml;r den Handel zwischen einzelnen Staaten die
Angelegenheit derart komplizierten, da&szlig; eBay nicht keine legale Abwicklung
der Verk&auml;ufe garantieren kann. Da die Rechtslage in Deutschland eindeutig
ist, trifft diese Einschr&auml;nkung auf die deutschen Seiten nicht zu.

16.09.99 eBay versteigert Rembrandt ab 29 Millionen DM
Mit der Versteigerung eines echten Rembrandt-Gem&auml;ldes will eBay das
Gesch&auml;ft der Traditionsauktionsh&auml;user wie Christies und Sothebys angreifen,
so das Unternehmen in einer Pressemittelung. Den Anfang macht die eBay
Deutschland alando.de AG in Berlin, die f&uuml;r ein Mindestgebot von 29
Millionen DM erstmals in Deutschland einen Rembrandt online unter den
Hammer bringen wird.
Das &Ouml;lgem&auml;lde mit dem Titel "Die Beschneidung Christi"  stammte aus dem
Besitz des Prinzen Friedrich Heinrich von Oranien.

20.09.99 F&uuml;hrende Technologie-Unternehmen wollen der Nummer eins im
Online-Auktionsgesch&auml;ft E-Bay mit einem gemeinsamen Auktionsnetzwerk
Konkurrenz machen. Zu den Firmen  z&auml;hlen Microsoft, Dell, Lycos sowie
Excite At Home. Die Kooperation sieht vor, dass alle Artikel, die auf einer
Homepage der Mitglieder zur Versteigerung angeboten werden, automatisch
auch auf den Sites der anderen erscheint. Der genaue Aktionsplan soll noch
ver&ouml;ffentlicht werden.

21.09.99 Fast w&auml;re es drei M&auml;nnern gelungen, 500 Pfund Marihuana &uuml;ber
den Internet-Auktionsdienst Ebay zu versteigern. Nachdem das Trio um kurz
vor neun Uhr morgens sein Gebot platziert hatte, vergingen fast 21 Stunden,
ehe Ebay Wind von der illegalen Auktion bekam und diese vom Netz nahm. Zu
diesem Zeitpunkt lagen bereits sieben Gebote f&uuml;r die Drogen vor, das
h&ouml;chste lag bei zehn Millionen Dollar.

22.09.99 Weiterhin menschliche Nieren im Angebot // Weiterhin deutlich
sichtbare Probleme durch unterschiedliche Rechtslage
Schon seit einiger Zeit verbietet eBay den Handel mit menschlichen Organen.
Dennoch fungiert es immer noch als Kontaktplattform f&uuml;r Organh&auml;ndler.
Anbieter der dubiosen Ware nutzen den Umstand aus, dass Verbotenes im
Auktionsangebot aufgelistet bleibt, und ver&ouml;ffentlichen auf diesem Weg ihre
E-Mail-Adressen.So kann der Handel unschwer an der Auktion vorbei
abgewickelt werden.

Waffen- und Organhandel ist in den USA nicht prinzipiell verboten, und was
legal gehandelt wird, darf nicht einfach aus dem Auktionsangebot gel&ouml;scht
werden. Hintergrund ist eine US- Gerichtsentscheidung aufgrund einer Klage
von zwei Auktionsteilnehmern, die Waffen versteigern wollten. Danach habe
eBay zwar die Waffenversteigerung sperren, nicht aber das Angebot l&ouml;schen
d&uuml;rfen.
In Deutschland gelten andere Regeln und da k&ouml;nnen die Angebote gel&ouml;scht
werden.

25.09.99  Manipulation bei Internet-Auktionen
Die Preise bei Internet-Auktionen werden nach Angaben des ZDF und der
Zeitschrift Computerbild oft k&uuml;nstlich in die H&ouml;he getrieben. Vor allem
kleinere Computerh&auml;ndler bieten bei den Versteigerungen heimlich mit, um so
die Preise zu manipulieren, hei&szlig;t es in einem Bericht des ZDF-Magazins
WISO.
Das Magazin beruft sich auf den ehemaligen Mitarbeiter eines H&auml;ndlers, der
die Praktiken best&auml;tigt habe. Die Betr&uuml;gereien blieben deshalb unentdeckt,
weil die Auktionsh&auml;user auf eine gr&uuml;ndliche Kontrolle der Identit&auml;t
verzichteten. Mit anonymen E-Mail-Adressen kostenloser Anbieter und
falschen, aber existenten Postadressen k&ouml;nne jeder f&uuml;r eigene Produkte
mitbieten. Die Preistreiber verf&uuml;gten teilweise &uuml;ber 50 verschiedene
Nutzernamen.
Computerbild hat eine Woche lang 400 Versteigerungen von Neuwaren bei den
Auktionsh&auml;usern Ricardo, eBay, Hardware.de und IEZ-Auktionen beobachtet.
Dabei h&auml;tte man mehr als ein Drittel der versteigerten Produkte zu einem
vergleichbaren Preis auch im Handel erwerben k&ouml;nnen, hei&szlig;t es in der
Mitteilung. Zehn Prozent der Produkte seien teurer als im Kaufhaus gewesen.

Viel Spa&szlig; beim mitsteigern.

Thomas Hasemann &lt;1145-87@onlinehome.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
