<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Technik & Net NEWS
------------------

1. Vorwort

Hallo und willkommen zur Oktober Ausgabe der Technik und Net News

"Redaktionsschluss" ist f&uuml;r einen Menschen der eine Terminarbeit abliefern
muss, in zweifacher Hinsicht ein sehr verhasstes Wort. Zum einen der
Termindruck an sich und wegen der "Geschwindigkeit der technischen
Entwicklungen." Die Magazin Ausgabe von Amiga Aktuell kann es zwar kaum mit
den z. T. st&uuml;ndlich aktualisierten News Seiten die es im Internet gibt
mithalten, aktueller und flexibler als jedes gedruckte Magazin ist es aber
allemal.

Das sch&uuml;tzte mich dann aber nicht davor, dass ich letztes mal voll
reintrat, ... ins Fettn&auml;pfchen der Geschichte, als ich ein paar mal Jim
Collas mit seinen MCC "Hardware" Pl&auml;ne erw&auml;hnte. Dazu muss man dann wissen,
dass mein Redaktionsschluss der sp&auml;te 27. August war und der R&uuml;cktritt erst
am 01. September so richtig bekannt wurde. Was ich nun aber so mitbekommen
habe, hat sich bis auf ein paar wesentliche Faktoren kaum etwas ge&auml;ndert,
die Lage ist wie immer hoffnungslos und niemand wei&szlig; mal wieder wie es mit
dem Amiga als Desktop System weitergehen soll. Das wird sicher ein Spa&szlig;!

Im Gegensatz zu Commodore, hat Amiga nun aber die historische Chance zwar
auch als Aktenvernichter aufzusteigen, daf&uuml;r mit Internetanschluss. DAS
empfinde ich als Definition der neuen Gateway Pl&auml;ne. DIE erhoffen sich
damit ein St&uuml;ck vom multimilliarden Dollar Kuchen, den es in den n&auml;chsten
Jahren zu verteilen gibt und unterscheiden sich damit auch nicht besonders
von den Pl&auml;nen unter Collas. Allerdings mit Unterschieden und damit meine
ich noch nicht mal so sehr, die fehlende Hardware.

Mir kann es eigentlich ja egal sein. Meine letzte Investition speziell f&uuml;rn
Amiga war die Aminet CD 18 und das ist etwa zwei Jahre her. Auch fand ich
es aus der Sicht eines Au&szlig;enstehenden lustig, den Wandel zu beobachten, den
Collas  in der Meinung der Amiga User im laufe von ein paar Wochen machte.
Vom Buh-Mann als er die Linux Entscheidung bekannt gab, bis hin zum
M&auml;rtyhrer, als er gegangen wurde.

Es waren aber ausgerechnet Collas Amiga MCC Pl&auml;ne, die mein neuerliches
Interesse weckten, nachdem ich ein paar Infos dar&uuml;ber bekam. Allerdings nur
untere bestimmten VORRAUSSETZUNGEN und das war, ich wiederhole mich, nicht
mal so sehr die Hardware. Noch nicht mal die CPU. Glaubt man dem Transmeta
CEO, Dave Ditzel, war das ganze Ges&uuml;lze von der neuen Amiga-CPU von Anfang
an eh nur ein gigantisches Fake!

Was meine erw&auml;hnten Vorraussetzungen angeht, erkl&auml;re ich das am besten mal
kurz mit Micosoft! Lassen wir mal beiseite, dass es im Vergleich zu allen
bisher verkauften Amigas, immer noch ein Mehrfaches an reinen DOS und Win
3.11 Installationen gibt. Aktuell h&auml;tten wie die Win 95/98 Reihe, dann NT
4. Beide sollen in n&auml;chster Zeit in Stufen und diversen Variationen zu
einem System verschmelzen (oder mutieren). Und Gott hat als weiteres
Milliarden Gesch&auml;ft mit Windows CE als Betriebssystem f&uuml;r Handhelds und
allen weiteren Arten von Kleincomputern.
Nur, was ist davon kompatibel, bzw. problemlos miteinander zu verbinden,
oder untereinander auszutauschen? Sehr wenig.
Aber, was kostet die Umstellung oder das aufr&uuml;sten oder das Verbinden und
Datenaustauschen? Sehr viel.

In dem Zusammenhang noch eine Anmerkung zum Milliardengesch&auml;ft f&uuml;r MS, ohne
jemals selbst Hardware daf&uuml;r vertrieben zu haben. In wie weit die Hardware
&uuml;ber Erfolg oder Misserfolg entscheidet, kann sowieso niemand sagen.
Windows, Be, Linux haben nix spezielles, Apple hat die eigene Hardware, die
diversen Unix Variationen mal ohne, mal mit spezieller Hardware und wenn es
nur spezielle CPUs sind, usw. Die Reihe l&auml;sst sich noch fortsetzen und
erweitern. Unerw&auml;hnt auch noch die Vermutungen, von MS kommt doch eine
Konsole, auf der auf jeden Fall wieder eine spezielle Version von Win CE
l&auml;uft, SUNs neuerlicher Netzcomputer Versuch, die zus&auml;tzlich zu Win CE
konkurrierenden Handheld Betriebssysteme, oder auch nicht zu vergessen, die
"Betriebssysteme" der reichlich vorhandenen Spielkonsolen, die auch immer
mehr zus&auml;tzliche Funktionen erhalten. Modem f&uuml;r Internet, DVD, MP3 Zus&auml;tze
usw.

W&auml;re nun ein neues Amiga OS von Begin dazu konzipiert worden, auch ganz
gleich mit welcher Betriebssystembasis man ein neues System aufgebaut
h&auml;tte, w&auml;re es das erste mal in der Geschichte gewesen, dass man ein
Betriebssystem in H&auml;nden gehalten h&auml;tte, dessen Basis in vielen
verschiedenen Ger&auml;ten zur Anwendung gekommen w&auml;re. Vom Handheld &uuml;ber den
Desktop zum Server. Auch ganz gleich in welcher Form es verkauft worden
w&auml;re, in einer typischen Ladenverkaufspackung wie MacOS oder Win98, oder
als einfache CD mit Lizenzen als OEM Version f&uuml;r Ger&auml;tehersteller oder,
oder, oder... . z.B. auch in einer SetTopBox.

&Uuml;berhaupt SetTopBox. Mir steht im Moment von einem leider viel zu sehr
entfernt verwandten Onkel, f&uuml;r fast f&uuml;nf Monate die funkelnagelneue
Premiere d-Box zur Verf&uuml;gung, inkl. unbegrenztem PPV Kredit :)). Ich
beschreib mal die R&uuml;ckseite: Netzanschluss, Buchse zum Anschluss der SAT-ZF
Weiche, Anschluss zur VCR Steuerung, Stereo Chinch f&uuml;r Audio, 3x Scart,
RJ-45 Buchse f&uuml;r das eingebaute Modem, RS-232 Sub Buchse und einfache aber
immerhin vorhandene SCSI Schnittstelle f&uuml;r externe CD oder DVD Player!

Mir pers&ouml;nlich w&auml;re es doch schei&szlig;egal wenn so eine Box AUCH mit dem Amiga
OS laufen w&uuml;rde. Da es mittlerweile etwa zwei duzend Boxen oder feste
Ank&uuml;ndigungen daf&uuml;r gibt, w&auml;re doch damit endlich ein Teilschritt von dem
erreicht, wor&uuml;ber alle Amiga User immer geheult haben. Dass es keine
Treiber oder Verbindungen f&uuml;r andere popul&auml;re Ger&auml;te gibt. Wenn man etwas
weiter ging, wenn mit einer, z.B. mit USB, Firewire oder vollst&auml;ndiger SCSI
Schnittstelle etwas erweiterten Box mit AmigaMMC OS die problemlose
Verbindung zu einem AmigaNG oder Classic Amiga mit AmigaMMC System
hergestellt werden k&ouml;nnte, um zum Beispiel selbst ohne R&uuml;ckkanal, bestimmte
Internet Inhalte und seien es nur gro&szlig;e Programmpakete in den Desktop
Rechner zu bekommen oder Videoinhalte zu &uuml;berspielen, usw, usf.. Oder das
gleiche dann mit einer Internetverbindung eines neuen Desktop Amigas &uuml;ber
Adapter zu einem Handy mit MMC System.

Mit den anstehenden &Auml;nderungen und neuen Standards, wird das Handy als
reiner Daten&uuml;bertr&auml;ger sowieso immer interessanter und k&ouml;nnte elegant, das
trotz Funkwellen Entscheidung, Problem letzte Meile vergessen lassen. Egal
ob mit High Speed Circuit Switches Data (HSCSD), General
Packet Radio Service (GPRS) oder Universal Mobile Telecommunications System
(UMTS). Das werfe ich hier nur mal so rein, das ist ein Kapitel f&uuml;r sich.

Dutzende weitere Kategorien und Verbindungen  w&auml;ren denkbar gewesen, wobei
alles auf einem Betriebssystem basiert und ohne dass Amiga Inc. selbst 
Hardware entwickeln w&uuml;rde. Von der Mikrowelle &uuml;ber den ach so geliebten
Desktop zur Grafik Workstation. Wenn dann noch das auf Amiga MCC basierende
Hausnetz installiert w&auml;re, und der K&uuml;hlschrank, die Mikrowelle,  &uuml;ber
Handpad der Vorratsraum und die Garage und mit Airport auch noch das Auto,
auf denen alle eine Version des Amiga MCC laufen w&uuml;rde, mit eingebunden und
verbunden und zu steuern w&auml;re, und sei es &uuml;ber Handy vom Urlaubsort mit den
Webcams die man am Haus hat dann noch das Licht und die Rolll&auml;den zu
steuern,  warum nicht!?!? Eine Entwicklung, die sowieso nicht aufzuhalten
ist und vielleicht erahnen l&auml;sst, warum einige so scharf drauf sind.

Ich war sowieso von Anfang an der Meinung, dass es so geplant war, dass man
die "Desktop  und gr&ouml;&szlig;er" Systeme, aktuellen oder ehemals im Amiga Bereich
etablierten Hardware Herstellern &uuml;berlassen wollte, zumal die von GTW ja
selbst wissen, was f&uuml;r ein schei&szlig; auf und ab Gesch&auml;ft die Hardware
Geschichte ist. Diese Amiga-erfahrenen Hersteller h&auml;tten sowieso den
engeren Kontakt zum Amiga Fu&szlig;volk und k&ouml;nnten sich mit denen rumeiern.

Ob im nachhinein berechtigt oder nicht, war es am Anfang ja In, erstmal
gro&szlig; dumm aufzuschreien und alles was nicht mit Zorro IV, WB 1.3 kompatibel
und OS 3.1 zu tun hatte zu verfluchen. Hauptsache man konnte sich &uuml;ber
SetTopBoxen oder Linux lustig machen ohne zu merken, wie l&auml;cherlich
armselig begrenzt man sich und sein System wieder hinstellt. Was anderes
hab ich von den "nur der Amiga ist mein Horizontern" auch nicht erwartet.
Mir fallen in dem Zusammenhang noch Bezeichnungen wie Hornochsen und
"Wagenladungen Bretter vorm Kopf" ein. Das k&ouml;nnte aber den Eindruck
entstehen lassen, das Dummges&uuml;lze w&auml;re am GTW Richtungswechsel schuld und
zudem ist das nicht mein Magazin. Zudem, kann es mir ja egal sein. Nun hat
man m&ouml;glicherweise gar nichts mehr au&szlig;er ein paar Erinnerungen.

Ob Gateway mit der jetzigen L&ouml;sung  Erfolg haben wird, muss sich noch
rausstellen. Zu Gespr&auml;chen sind sie ja angeblich bereit. Eine parallele
Entwicklung mit z.B. diesem Albatross oder wie das hei&szlig;t w&auml;re auch
vorstellbar. Allerdings frage ich mich dann, welche Verbindung oder
Gemeinsamkeiten wird das Betriebssystem haben, -  haben m&uuml;ssen. Den Namen,
das wichtigste, hat Gateway.

Auch die Konkurrenz schl&auml;ft nicht, wie man nicht nur auf der IFA gesehen
hat. Die Java L&ouml;sungen sind auch nicht neu. Ob Mobilcom mit der Kombination
aus Box und Telekommunikationsl&ouml;sung, oder Philips mit Java-Box f&uuml;r
digitales TV oder mittelst&auml;ndige Firmen wie Sony oder Motorola die mit
Milliarden Investitionen ins SetTopBoxen Gesch&auml;ft einsteigen.  Ob die
gerade auf Gateway warten?? Selbst die beiden gr&ouml;&szlig;ten Konkurrenten, Dell
und Compaq planen einen &auml;hnlichen Weg der Verbindung von Consumer Computer,
Internet Telekommunikation und Medien.
Sch&ouml;nes und sehr viel weiter fortgeschrittenes Beispiel ist die JNT
Surfstation von der am Frankfurter NeuenMarkt notierten Firma Informatec.
Die konnten bereits mehrere millionenschwere Auftr&auml;ge f&uuml;r ihre auch auf
Java basierte und im Prinzip erstmal vollst&auml;ndige Box an Land ziehen.

Beispiele aller Art gibt es noch genug. Auch Vermutungen und Hoffnungen was
die Zukunft bringt. Noch tiefer gehende Beschreibungen und Erkl&auml;rungen
behalte ich mal f&uuml;r ein "Blick in die Zukunft" Artikel auf.  Warten wir es
mal ab. Oder um es mit den Worten des wohl gr&ouml;&szlig;ten deutschen Dichters der
Vergangenheit und Gegenwart zu sagen:



Tragts mit Humor  Das soll heute unser Motto sein
Regen und Graupel, die wechseln sich ab
Mal gehts beschissen und mal gehts ins Grab
Dem einen fehlt ein Arm, dem anderen ein Ohr
Mir fault das Bein ab
Doch ich nehms mit Humor
Mit lachen ertr&auml;gt sich eben alles besser
Sogar die Aussichten des Amigas


------------------------------------------------------------------

Davon abgesehen, noch kurz zum TNN Teil. Ein vern&uuml;nftiges Konzept ist mir
immer noch nicht eingefallen. Obwohl es manchmal sehr schwer ist zu
trennen, hab ich es diesmal aufgeteilt in Technik und Internet.

Leider hatte ich auch massive zeitliche Probleme, sodass Blick in die
Zukunft ausf&auml;llt. Ich wurde mit dem geplanten Vorhaben leide nicht richtig
fertig. Allerdings war die Vorauswahl durch die bekannte Situation sowieso
nicht leicht. Am "unverf&auml;nglichsten" erschien uns urspr&uuml;nglich noch das
Thema "Speicher".

Obwohl ich nicht zuletzt durch eine Kaufabsicht, geneigt war, den G 4 bzw.
die ganze Familie (ob nun den G4 als Chip oder eben die Mac Rechner is
egal), n&auml;her zu beschreiben. Wie bereits letztes Mal erw&auml;hnt, sind auch
Themenvorschl&auml;ge willkommen und werden ernstgenommen. Auch kurzfristig, da
ich eben nur noch "Amiga Au&szlig;enstehender" bin.

Noch viel Spa&szlig; beim lesen und bis zum n&auml;chsten Monat.

Thomas Hasemann &lt;1145-87@onlinehome.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
