<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)
-------------------------------------------------

+++ AMIGA gibt Pl&auml;ne zur Schaffung eines Amigas der n&auml;chsten Generation und 
eines neuen Betriebssystems auf +++ Statt dessen Entwicklung von 
Betriebssoftware f&uuml;r Internet Appliances +++ Amiga-User reagieren ver&auml;rgert 
bis schockiert +++ Entwickler und Anwender organisieren sich +++

Soweit die alles andere als positiven Meldungen des vergangenen Monats. 
Willkommen damit zur neuen Ausgabe von AMIGA aktuell.

Der Oktober glich anfangs einem Wechselbad der Gef&uuml;hle. Gegen Mitte des 
Monats wurde dann klar: AMIGA hat unter der F&uuml;hrung von Tom Schmidt seine 
Pl&auml;ne zur Entwicklung eines Amigas der n&auml;chsten Generation und eines neuen 
Betriebssystems aufgegeben.
Das Unternehmen plant nun, eine Betriebsumgebung f&uuml;r sogenannte Information 
Appliances, die f&uuml;r den Zugang zum Internet gedacht sind, zu entwickeln. 
Der von Jim Collas geplante AmigaNG ist ganz offensichtlich tot, und das 
Vertrauen in die Firmen AMIGA und Gateway bei den allermeisten Usern 
g&auml;nzlich verschwunden.

Ein ganz schwacher Trost und einziger kleiner Lichtblick in den &Auml;u&szlig;erungen 
Tom Schmidts ist die angebliche Bereitschaft des Unternehmens, das Design 
und die Spezifikationen des Amiga MCC sowie die geplante Amiga-Software zu 
lizensieren, und damit anderen Unternehmen die M&ouml;glichkeit zu geben, einen 
Amiga der n&auml;chsten Generation auf den Markt zu bringen - diese m&uuml;ssten 
jedoch selbst f&uuml;r ein AmigaNG-Betriebssystem sorgen, dieses also entweder 
neu entwickeln oder ein bestehendes OS verwenden.

Mehr zu diesen bitteren Neuigkeiten in dieser Ausgabe von AMIGA aktuell.


Die Interna der heutigen Ausgabe:

* Martin Henke hat sich leider aus Zeitgr&uuml;nden dazu entschlossen, die       
  englische Version von AMIGA aktuell, AMIGA aktuell International,         
  einzustellen. Dennoch gebe ich das Projekt noch nicht verloren: Ich suche  
  Freiwillige, die bereit sind, jeden Monat (nur) ein bis zwei AMIGA-       
  aktuell-Rubriken ins Englische zu &uuml;bersetzen. Sowie sich eine gen&uuml;gend     
  gro&szlig;e Anzahl von Mitarbeitern dazu bereit erkl&auml;rt hat, wird AMIGA aktuell  
  International wieder erscheinen - bis dahin gibt es nur die Specials.

* Allm&auml;hlich gehen mir die Preise f&uuml;r das AMIGA-aktuell-Gewinnspiel aus.    
  Wer also einen Preis zur Verf&uuml;gung stellen m&ouml;chte bzw. jemanden kennt,    
  der dazu bereit ist, sollte sich bei mir melden. Danke!

* Von mir gibt es ab sofort auch tagesaktuelle Amiga-News. Dies ist         
  keinesfalls als Konkurrenzservice zu den bekannten Newsdiensten zu        
  verstehen, sondern soll vom Umfang her einen Mittelweg zwischen diesen    
  und den AMIGA-aktuell-Special-News darstellen.
  Zu meinen News gelangt ihr, wenn ihr auf der AMIGA-aktuell-Homepage       
  (http://www.aakt.de) in der deutschsprachigen Sektion die 'letzten         
  Meldungen' aufruft und dann dem obersten Link folgt.

* Die AMIGA-aktuell-Specials werden jetzt in aller Regel bereits am         
  Versandtag auf die Homepage (http://www.aakt.de) gestellt, oftmals sogar  
  zur selben Zeit.

* Die Rubrik 'Blick in die Zukunft' muss diesmal leider ausfallen.


Zu den regelm&auml;&szlig;igen Aufrufen:
    
* Weiterhin gesucht werden Tester von frei kopierbarer Software. Jeder, der  
  sich f&uuml;r diese Aufgabe bereit erkl&auml;rt, wird in eine spezielle             
  Verteilerliste eingetragen und erh&auml;lt dann in unregelm&auml;&szlig;igen Abst&auml;nden    
  Test-Vorschl&auml;ge. Nat&uuml;rlich freuen wir uns aber genauso &uuml;ber Tests         
  kommerzieller Produkte und nicht &uuml;ber die Verteilerliste vorgeschlagener  
  FD-Software. Schreibt an aakt@gmx.de .


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
