<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Wolf Zimmer">

    <TITLE>paranormal</TITLE>
  </HEAD>

  <BODY background="xbg.gif" text="black" link="blue" alink="red" bgcolor="#ffffcc">
    <A name="top"></A> 

    <CENTER>
      <FONT color="#000080" size="7"><B>PARANORMAL</B></FONT>
    </CENTER>
    <BR>
    Hinweis: Diese Besprechung wurde in der NoCover-47 ver&ouml;ffentlicht.

    <P><A href="../Bilder/xt1a.jpg" target="_top"><IMG src= "xt1ak.jpg"
    width="256" height="205" alt="" align="left" hspace="6"></A> <FONT
    size="+1">The Epic interactive Encyclopedia of the PARANORMAL</FONT></P>

    <P>ist der vollst&auml;ndige Titel der heute vorgestellten CD. Wie es die
    &Uuml;berschrift schon verr&auml;t, die CD ist vollst&auml;ndig in Englisch
    und kostet so um die 49,- bis 66.DM je Anbieter. Die Vorbereitungen
    f&uuml;r die deutsche Umsetzung laufen auf vollen Touren, der
    Erscheinungstermin und der Preis ist aber leider noch nicht bekannt.</P>

    <P>Diese CD ist vordergr&uuml;ndig mit 574 MB belegt (mehrere MB
    Archivdaten liegen als .LHA und .LZX Dateien vor, soda&szlig; eine genaue
    Zahl adhoc nicht angegeben werden kann. Es werden AGA , ein 2x CD-ROM und
    mindestens 4 MB RAM ben&ouml;tigt, besser ist 6 MB und 4x CD-ROM. Auch wird
    darauf hingewiesen, da&szlig; vieles nur mit 030-040-060 Processor
    lauff&auml;hig ist. Der voreingestellte Bildschirm ist PAL/Hires Interlaced
    (640*512).</P>

    <P>Nach dem &Ouml;ffnen des CD-Icons erscheinen 3 Icons:</P>

    <UL>
      <LI>Important</LI>

      <LI>Start</LI>

      <LI>AmiCDFS-Install.</LI>
    </UL>
    Beim ersten Mal gibt es keinen Zweifel, Important ist zuerst zu lesen. Die
    sogenannte Readme-Datei rollt nun Zeile f&uuml;r Zeile &uuml;ber das
    CD-Cover Bild. Es bleibt ausreichend Zeit, auch als etwas unge&uuml;bter
    Englisch Leser den Text zu lesen. Nur wer Texte geistig &uuml;bersetzend
    liest, f&uuml;r den wird die Zeit sehr knapp. Aber f&uuml;r den ist diese
    CD sowieso nicht ganz das Richtige.<BR> <BR>
         

    <P>AmiCDFS. Dieses AmiCDFileSystem (Version 37.5 vom 2.10.94) von Nicola
    Salmoria basiert auf dem AmiCDROM 1.9 von Frank Munkert. Es liest ISO-9660
    (w/RockRidge extensions) und Macintosh HFS CD-ROMs. Wer es braucht, kann es
    ruhig installieren (scsi.device).</P>

    <P><BR>
    <BR>
    Start:......</P>
    <A href="../Bilder/xt1b.jpg" target="_top"></A><IMG src="xt1bk.jpg" width="256"
    height="205" alt="" align="left" hspace="6">Wie zu sehen, sind auf dem Titelbild<BR>

    <TABLE border="0">
      <TR>
        <TH>drei Kn&ouml;pfe:</TH>
        <TH>&nbsp; &nbsp; &nbsp; &nbsp;</TH>
        <TH>und sieben Schaltfl&auml;chen:</TH>
      </TR>

      <TR>
        <TD>- Run Demo,</TD>     
        <TD></TD>
        <TD>- UFOs &amp; Aliens</TD>
      </TR>

      <TR>
        <TD>- Slideshow und</TD>
        <TD></TD>
        <TD>- Mind over Matter</TD>
      </TR>

      <TR>
        <TD>- Credits</TD>
        <TD></TD>
        <TD>- hosts &amp; Spirits</TD>
      </TR>

      <TR>
        <TD></TD>
        <TD></TD>
        <TD>- Mysticism</TD>
      </TR>

      <TR>
        <TD></TD>
        <TD></TD>
        <TD>- Myths &amp; Legends</TD>
      </TR>

      <TR>
        <TD></TD>
        <TD></TD>
        <TD>- Strange Life</TD>
      </TR>

      <TR>
        <TD></TD>
        <TD></TD>
        <TD>- The Unexplained.</TD>
      </TR>
    </TABLE>

    <P>Run Demo l&auml;uft unter Benutzung von 6 MB RAM genau 6 Minuten,
    besteht aus 50 Bilder, 13 Animationen und einer Backgroundmusik, die einem
    nicht auf den Geist geht und deren Wiederholungen man anfangs gar nicht
    bemerkt. 22 der 50 Bilder sind mit einem gesprochenen Text (eine angenehme
    weibliche Stimme) hinterlegt. Dieses Demo ist unterhaltend und
    abwechslungsreich aufgebaut, hat sich aber mehrere kleinere Schwerpunkte,
    wie Uri Geller, Bigfoot und Loch Ness gesetzt. Der Ein- und
    Ausblendmechanismus der Standbilder ist verschieden, teilweise verspielt
    aber so gew&auml;hlt, da&szlig; er nicht eint&ouml;nig oder erm&uuml;dend
    wirkt. Manche Bilder sind nur kurz, teilweise sehr kurz zu sehen, wie z.B
    ein Ufo, das verflixte &Auml;hnlichkeiten mit einer schlecht fotografierten
    Stra&szlig;enlaterne aufzeigt. Andere Standbilder stehen l&auml;nger, damit
    eine intensivere Betrachtung m&ouml;glich wird und die Faszination des
    &Uuml;bersinnlichen besser unterstrichen werden soll.</P>

    <P>Manche Bilder sind bekannt - Internet, B&uuml;cher, CD Hidden Truth
    -manche hat man bisher noch nicht gesehen, wenigstens mir geht es so.</P>

    <P>Slideshow ist genau das Gegenteil. Eine unm&ouml;gliche Musik, und die
    Bilderfolge aller &uuml;ber 1000 Bilder im 3 Sekunden Takt. Eine Systematik
    der Bilderanordnung war nicht erkennbar. Bei 140 habe ich die Segel
    gestrichen und die ESC-Taste gedr&uuml;ckt. Auch Tester haben Nerven.</P>

    <P>Credits zeigt die Verantwortlichen und Autoren im interaktiven Modus
    auf. Ein bi&szlig;chen verspielt, aber abwechslungsreich.</P>

    <P>Wie eingangs erw&auml;hnt sind neben den 3 schon beschriebenen
    Kn&ouml;pfen sieben Schaltfl&auml;chen vohanden. Nach Anklicken eines
    Themas erscheint ein Themenbild mit 2 Schaltfl&auml;chen:</P>

    <CENTER>
      <FONT size="+1">The Information &nbsp; &nbsp; &nbsp; &nbsp;
      &nbsp; &nbsp; &nbsp; &nbsp; The Experience</FONT>
    </CENTER>
    
    <P><A href="../Bilder/xt1c.jpg" target="_top"><IMG src= "xt1ck.jpg"
    width="256" height="205" alt="" align="left" hspace="6"></A> The Experience
    ist eine Slideshow von durchschnittlich 10 Bilder mit einer thematisch
    entsprechenden Musik unterlegt.</P>

    <P>"The Information" &ouml;ffnet eine typische EPIK Lexikon Seite. Auf
    einem Backgroundbild sind 2 Fenster. In dem einen werden die Bilder
    angezeigt, in dem anderen ist der Text. Selbstverst&auml;ndlich sind auch
    die notwendigen Schalter f&uuml;r das interaktive Erlebnis vorhanden. Die
    Schalter Sample, Images und Film k&ouml;nnen durch leuchtende Symbole eines
    Lautsprechers, eines Fotoapparates oder einer Filmkamera erkannt werden.
    Die Lupe vergr&ouml;&szlig;ert die Fenster auf Screengr&ouml;&szlig;e.
    Synopsis spricht den Text.</P>
        
    <P><A href="../Bilder/xt1d.jpg" target="_top"><IMG src= "xt1dk.jpg"
    width="256" height="205" alt="" align="right" hspace="6"></A> Nun alle
    sieben Themengebiete ausgiebig vorzustellen, ist hier nicht angebracht.
    Schlie&szlig;lich m&ouml;chte ich kein Verkaufsgespr&auml;ch mit Anpreisung
    f&uuml;hren, sondern diese CD ein wenig beleuchten, damit jeder wei&szlig;,
    worum es sich hier im Einzelnen handelt. Als ich mir &uuml;berlegte, welche
    Themen besprochen weden sollen, dachte ich zuerst an Geister. Dieses ist
    doch mal etwas Neues in unserer Medienlandschaft. Beim Betrachten der
    Bilder kam ich mich in die 50er Jahre versetzt vor, als ich mit dem
    Fotografieren begann. Damals hatte ich eine Box 6X9. Nach jeder Aufnahme
    mu&szlig;te der Film manuell weitergekurbelt werden. Ein automatischer
    Filmtransport gab es in den einfachen Kameras nicht. So kam es des
    &ouml;fteren vor, da&szlig; z.B. meine Mutter als Schatten &uuml;ber den
    See lief und so weiter. Aus diesem Grunde ist es f&uuml;r mich nicht
    m&ouml;glich, &uuml;berzeugend von Schattenfiguren auf Treppen oder in der
    Stadt als Geistererscheinungen zu schreiben.</P>

    <P>Das Thema UFO wurde in letzter Zeit &ouml;fter behandelt und auch
    abgehandelt. Trotzdem ist es f&uuml;r Ufo Freaks immer wieder faszinierend,
    die Fotos und Filme zu betrachten. Dabei darf aber das geschriebene bzw.
    das gesprochene Wort nicht vergessen werden. Bestimmt ist wieder etwas
    neues mit dabei. Manche Textpassagen sind mit bis zu acht Bilder
    best&uuml;ckt. Die genaue Anzahl ist anhand roter Leuchtdioden links neben
    dem Bildfenster erkennbar.</P>

    <P>Wie schon gesagt, der Text kann mittels Schalter "Synopsis" vorgelesen
    und mit dem kleinen Pfeil rechts neben diesem Schalter nach einer
    Sicherheitsabfrage auch gedruckt werden. &Uuml;ber ein Copyright der Texte
    bin ich bisher noch nicht gestolpert, was nicht besagt, da&szlig; keines
    vorhanden ist.</P>

    <P>Wer innerhalb der Encyclopediaseiten nicht weiter wei&szlig;, kann sich
    die einzelnen Schalter und Anzeigefelder mittels Sprachausgabe &uuml;ber
    die Help-Taste erkl&auml;ren lassen. Mit einer weiteren Bet&auml;tigung von
    Help wird die Erkl&auml;rung abgeschaltet und der Mauszeiger &auml;ndert
    sich wieder vom Fragezeichen zum Pfeil oder Lupe, je nachdem wo er gerade
    positioniert ist.</P>

    <CENTER>
      <A href="../Bilder/xt1e.jpg" target="_top"></A><IMG src=
      "xt1ek.jpg" width="256" height="205" alt=""><A href=
      "../Bilder/" target="_top"><IMG src="xt1fk.jpg" width="256"
      height="205" alt=""></A><BR>

       <A href="../Bilder/xt1g.jpg" target="_top"><IMG src=
      "xt1gk.jpg" width="256" height="205" alt=""></A> <A href=
      "../Bilder/xt1h.jpg" target="_top"><IMG src="xt1hk.jpg"
      width="256" height="205" alt=""></A>
    </CENTER>

    <P>Regelrecht spannend und wirklich informativ sind die Themen Mystik und
    Mythos und Geschichten. Mind over Matter berichtet ausf&uuml;hrlich
    &uuml;ber schwebende Menschen und Dinge. Strange Life ist nicht ganz mein
    Geschmack. Weinende Madonnen und blutende Kruzifixe stimmen mich immer so
    traurig. Aber ein anderer Schwerpunkt ist das Ungeheuer von Loch Ness, was
    wieder sehr interessant ist.</P>

    <P>Mit am besten gef&auml;llt mir die Rubrik "The Unexplained". Ob es die
    Figuren sind, wie z.B. der Cerne Abbas Giant, der wie mit einem
    Riesenrasenm&auml;her erstellt aussieht, oder ob es die Sphinx und die
    Pyramiden sind, die mal mit extraterrestrischen Augen betrachtet werden.
    Die Ph&auml;nomene Bermuda Dreieck und auch Stone Henge bekommen neue
    Erkl&auml;rungen.</P>

    <P>Wer also f&uuml;r &Uuml;bersinnliches empf&auml;nglich ist, f&uuml;r den
    ist diese CD ein absolutes Muss und ein Gewinn. Verge&szlig;t aber nicht
    vorher noch aufzur&uuml;sten, wer noch nicht hat.</P>

    <CENTER>
      <A href="../Bilder/xt1i.jpg" target="_top"></A><IMG src=
      "xt1ik.jpg" width="256" height="205" alt=""><A href=
      "../Bilder/xt1j.jpg" target="_top"><IMG src="xt1jk.jpg"
      width="256" height="205" alt=""></A><BR>
       <A href="../Bilder/xt1k.jpg" target="_top"><IMG src=
      "xt1kk.jpg" width="256" height="205" alt=""></A> <A href=
      "../Bilder/xt1l.jpg" target="_top"><IMG src="xt1lk.jpg"
      width="256" height="205" alt=""></A>
    </CENTER>

    <P align="right">Wolf Zimmer</P>
    <HR>
    <BR>
    <A href="javascript:history.back()"><FONT size=
    "+1"><B>zur&uuml;ck</B></FONT></A> <BR>
  </BODY>
</HTML>

