<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="author" content="Wolf Zimmer">

    <TITLE>EPIC Multimedia Lexikon</TITLE>
  </HEAD>

  <BODY background="xbg.gif" text="black" link="blue" alink="red" bgcolor="#ffffcc">
    <A name="top"></A> 

    <CENTER>
      <FONT color="#000080" size="7"><B>EPIC Multimedia
      Lexikon</B></FONT>
    </CENTER>
    
    <P>Hinweis: Diese Besprechung wurde in der NoCover-44 ver&ouml;ffentlicht. </P>

    <P>Auszug aus der ReadMe-Datei:</P>

    <P><IMG src="xt5t.jpg" width="160" height="160" align="left" hspace="6"
    vspace="3" alt="CD-Cover"> Willkommen beim "Interaktiven EPIC Multimedia
    Lexikon". Dieses Lexikon ist das erste Multimedialexikon f&uuml;r den AMIGA
    in deutscher Sprache! Seit 1994, als der Amiga CD-Rom Markt zu wachsen
    begann, arbeitete EPIC an dieser Lexikon CD.</P>

    <P>Diese Lexikon CD ist erst der Anfang einer Reihe von Multimediaprodukten
    aus dem Hause EPIC f&uuml;r den AMIGA. F&uuml;r die nahe Zukunft ist ein
    Lexikon des Paranormalen geplant. usw. usw.</P>

    <P>Das Lexikon l&auml;uft auch auf einem einfachen parnet/sernet
    Netzwerk.</P>

    <P>Systemvoraussetzungen: AGA Amiga mit 4MB freiem Speicher, Festplatte und
    CD-Rom. Empfohlen wird ein AGA Amiga mit 030er Prozessor, 6 MB freier
    Speicher und Quadspeed CD sowie 440 KB freiem Speicherplatz auf ihrer
    Systempartition.</P> Soweit der Auszug. <HR>

    <P>Multimedia klingt hervorragend und das alles auf einer Scheibe mit ca.
    237 MB Daten. Legen wir also die CD auf und schalten die Lautsprecher
    an.</P>

    <P>Nach dem &Ouml;ffnen des Icons, erscheint ein Fenster mit vier weiteren
    Icons: ReadMe, SetUp, Lexikon und Also_Available. In der ReadMe steht
    nat&uuml;rlich die Begr&uuml;&szlig;ung, die o.a. S&auml;tze etwas
    ausf&uuml;hrlicher gehalten, wie die Einbindung innerhalb eines Netzwerkes
    durchgef&uuml;hrt werden kann, nat&uuml;rlich die Freude &uuml;ber den Kauf
    und nicht zu vergessen, die obligatorischen Gru&szlig;worte.</P>

    <P>Bevor jetzt ein Blick in das Lexikon geworfen werden kann, ist es
    notwendig, erst das Setup durchzuf&uuml;hren. Auf der Partition System wird
    ein Verzeichnis namens EPIC mit 835 KB (und nicht 440 KB wie
    angek&uuml;ndigt) eingerichtet. Hier sind alle Tools, Assigns, Indices und
    Platz f&uuml;r eigene Speicherungen vorhanden. Wenn dies nun geschehen ist,
    kann jetzt das Lexikon aufgerufen werden. In der ReadMe stand, dass die
    Aufl&ouml;sung PAL/Hires am sinnvollsten w&auml;re. F&uuml;r die User mit
    einem 17" oder 21" Monitor schlage ich des klareren Bildes wegen einen
    Modus in 640*512 vor. Bei anderen Aufl&ouml;sungen besteht die Gefahr, dass
    der untere Rand des Bildes abgeschnitten wird.</P>

    <P><A href="../Bilder/xt5a.jpg" target="_top"><IMG src= "xt5ak.jpg"
    width="160" height="128" alt="" align="left" hspace="10"></A> Nachdem nach
    dem Er&ouml;ffnungsscreen der Titelscreen aufgeschlagen ist, wei&szlig;
    man, warum auf der CD-H&uuml;lle soviele Kieselsteine abgebildet sind. Die
    Buttons f&uuml;r das weitere Einsteigen haben die Form von gro&szlig;en
    beschrifteten Kieselsteinen.</P>

    <P>Die "Kieselsteine" lauten: Guided Tour, Lexikon, EUROpedia, Explorapedia
    und Credits.</P>

    <P><A href="../Bilder/xt5h.jpg" target="_top"><IMG src= "xt5hk.jpg"
    width="160" height="128" alt="" align="right" hspace="10"></A> Bevor man
    ein Programm aufruft, sollte man schon wissen, was man will beziehungsweise
    was einen erwartet. Also ist als erstes der Kieselstein "Guided Tour" dran.
    Angeklickt - eine Bretterwand mit Kieselsteinbuttons erscheint und eine
    angenehme Frauenstimme empf&auml;ngt uns mit einer Begr&uuml;&szlig;ung und
    der Erkl&auml;rung, dass sie alle Buttons auf diesen Seiten nach dem
    Anklicken ausgiebig erkl&auml;ren wird. Da auch hier ein Stein "Guided
    Tour" liegt, kann es sein, dass hier wohl die Hilfe zur Hilfe steht. Die
    Frauenstimme s&auml;uselt emp&ouml;rt: "Vielleicht habe ich irgendetwas
    nicht richtig mitbekommen, aber hier sind wir schon". Eine Bemerkung am
    Rande, doppelklicken bringt nichts, die Dame sagt dann nur alles
    zweimal.</P>

    <P>Nachdem wir uns ausgiebig informiert haben, schauen wir uns in Ruhe die
    Originale an.</P>

    <P><A href="../Bilder/xt5b.jpg" target="_top"><IMG src= "xt5bk.jpg"
    width="160" height="128" alt="" align="left" hspace="10"></A> Beginnen wir
    mit dem Lexikon. Das Titelbild gliedert sich in vier Teile. Links oben die
    Auswahlliste mit zus&auml;tzlicher Anzeige des gew&auml;hlten Begriffes,
    darunter der Erl&auml;uterungstext in einem Scrollfenster, kann aber
    bildschirmf&uuml;llend gelesen werden (Zoom-taste) und ein Kontrollfenster
    &uuml;ber der zur Verf&uuml;gung stehenden Multimedias. Rechts oben ein
    Fenster f&uuml;r Bilddarstellungen und darunter ein Fenster f&uuml;r
    Animationen. Auch diese beiden Fenster k&ouml;nnen in
    Bildschirmgr&ouml;&szlig;e betrachtet werden. Zwischen diesen vier Teilen
    gibt es noch eine ganze Reihe kleiner Kn&ouml;pfchen, die in der Guide Tour
    die Dame beim Anklicken freudig erl&auml;utert hatte. Hier kann man die
    Auswahl, die Suche, die Darstellung, das Abspielen von Animationen, das
    Vor- und R&uuml;ckw&auml;rtsbl&auml;ttern von Bildtafeln, das Einschalten
    von Samples, Ger&auml;uschen oder Musikst&uuml;cken (z.B. Nationalhymnen)
    vornehmen. Oder man geht einfach zum n&auml;chsten Begriff weiter.</P>

    <P>Bevor wir nun weitergehen, noch ein paar Zahlen. Insgesamt sind es 4.123
    Begriffe von Aachen bis Z&uuml;rich. Alle Begriffe sind nochmals in
    Hotlists aufgeteilt. Es sind genau 15 Listen von B&auml;ume&amp;Pflanzen
    (von Adlerfarn bis &Ouml;lpflanze = 108 Begriffe), Dinosaurier,
    Elektroger&auml;te (von Compact_Disc bis Videorekorder = 17 Begriffe), usw
    usw bis hin zu Werkzeuge. Die gr&ouml;&szlig;te Liste ist aber Multimedia.
    Hier sind 1263 Begriffe (von Aachen bis Z&uuml;ndkerze). Das hei&szlig;t,
    alle anderen W&ouml;rter haben nur einen erl&auml;uternden Text, aber keine
    Bilder, Animationen, Ger&auml;usche oder Musik. Ich m&ouml;chte mit diesen
    Worten keinesfalls die bisher erbrachte Leistung einschr&auml;nken oder
    schm&auml;lern. Es ist halt kein Brockhaus, daf&uuml;r sind die Bilder in
    256 Farben vorliegend und es k&ouml;nnen bis zu 8 Bilder pro Begriff
    vorhanden sein. Die gesamte Zahl habe ich nicht ermittelt, auch habe ich
    die Animationen nicht gez&auml;hlt. Diese sind &uuml;brigens nicht farbig,
    sondern in Graustufen vorhanden. Aber sie reichen vom Adlerflug &uuml;ber
    Fliegen, eine Trapeznummer bis zu Zweiter Weltkrieg.</P>

    <P><A href="../Bilder/xt5c.jpg" target="_top"><IMG src= "xt5ck.jpg"
    width="160" height="128" alt="" align="right" hspace="10"></A> Verlassen
    wir mal das Lexikon und schauen uns den sch&ouml;nen Kieselstein
    "EUROpedia" an. Der Ausgangsscreen ist eine Europakarte mit politischen
    Grenzen. In einem Kontrollfenster erscheint der jeweilige Staatenname (in
    deutsch), das der Mauszeiger gerade ber&uuml;hrt. Nach Anklicken erscheint
    ein dreigeteiltes Fenster und ein Mann nennt den Namen des
    ausgew&auml;hlten Staates. Im unteren Drittel des Schirmes steht die
    Geschichte in einem Scrollfeld. In dem oberen linken Restschirm ist die
    Nationalflagge und ein Statistikfeld. Im rechts verbleibenden Feld ist eine
    gezoomte Europakarte mit Anzeige der Landesgrenzen. In dieser Karte ist
    ganz oben rechts nochmals eine kleine Europa&uuml;bersichtskarte mit der
    Lagedarstellung. Das ausgew&auml;hlte Land erscheint blau. Die politischen
    Grenzen der europ&auml;ischen Staaten entsprechen der Jetztzeit, siehe
    Bosnien, Kroatien usw. Beim Anklicken der Nationalflagge (nicht bei allen
    Staaten) ert&ouml;nt die Hymne auf einem gezupften Saiteninstrument
    gespielt.</P>

    <P><A href="../Bilder/xt5d.jpg" target="_top"><IMG src= "xt5dk.jpg"
    width="160" height="128" alt="" align="left" hspace="10"></A> Explorapedia.
    Dieser Ausdruck ist wohl von Exploration = Erkundigung, Erforschung,
    Befragung, Untersuchung und pedia (keine Ahnung, wird doch wohl nicht von
    pedes = zu Fu&szlig; abgeleitet sein) entstanden. Schauen wir also rein.
    Gleich im Eingangsschirm steht zwar klein, aber es steht da: F&uuml;r
    Kid's. Es sind 8 Bilder zu sehen, die einzeln angeklickt werden
    k&ouml;nnen. Die jeweiligen Titel hatte ich vorhin von der freundlichen
    Dame erfahren und gemerkt. Sie sind n&auml;mlich nicht angeschrieben. Es
    sind die Themen Transport, Dinosaurier, Fernsehen, Werkzeug, Raumfahrt,
    Computer, Spielzeug und Musikinstrumente. Die folgenden Bilder werden nur
    in der Gr&ouml;&szlig;e 640*256 richtig angezeigt. Alle anderen Modi
    verf&auml;lschen die Perspektive und die Gr&ouml;&szlig;endarstellung.</P>

    <P><A href="../Bilder/xt5da.jpg" target="_top"><IMG src= "xt5dak.jpg"
    width="160" height="128" alt="" align="right" hspace="10"></A> Greifen wir
    zwei Beispiele heraus, Transport und Musikinstrumente. Bei Transport werden
    ein Panzer, zwei Flugzeuge und zwei Pkw dargestellt. Alle sind animiert,
    der Panzer dreht seinen Turm und gibt Motorenger&auml;usche von sich. Der
    eine Pkw f&auml;hrt vorw&auml;rts und r&uuml;ckw&auml;rts und erzeugt
    Bremsger&auml;usche, wogegen der andere Pkw nur Hupen kann. Das eine
    Flugzeug ist ein Senkrechtstarter und das andere ein station&auml;rer
    Hubschrauber.</P>

    <P><A href="../Bilder/xt5db.jpg" target="_top"><IMG src= "xt5dbk.jpg"
    width="160" height="128" alt="" align="left" hspace="10"></A> Im anderen
    Bild sind verschiedene Musikinstrumente, wie Fl&uuml;gel, E-Gitarre,
    Geigen, Trommel, Metronom u.a. Alle Instrumente spielen einen Song wie z.B.
    die Geigen den Anfang von Mozarts Kleiner Nachtmusik, die E-Gitarre ein
    verh&auml;ltnism&auml;&szlig;ig langes St&uuml;ck (den Namen kenne ich aber
    nicht) und das Metronom schl&auml;gt den Takt.</P>

    <P>Abschlie&szlig;end m&ouml;chte ich sagen, dass dieses Werk mir rundherum
    sehr gut gefallen hat, sowohl in der Aufmachung, der Detailtreue und der
    Bedienung. Eines hat dieses Programm nicht, es kann weder mit Maus noch mit
    Shortcuts in den Hintergrund gelegt werden, aber daf&uuml;r kann vieles
    gespeichert und anschlie&szlig;end weiter verarbeitet werden.</P>

    <P>Wer braucht diese CD. Ja....... Eines steht fest, wer will, kann eine
    ganze Menge in sehr kurzer Zeit lernen, z.B. wie die einzelnen Z&auml;hne
    heissen und wie sie aussehen (sollten), oder dass z.B. Aboriginalkunst die
    Kunst der Aborigines ist.</P>

    <P>Was kostet diese CD? Andreas hat es nicht dazugeschrieben und in
    Anzeigen habe ich nur eine "Epic interaktive Encyclopedia" gefunden, die
    bei Vesalia 66.- DM und bei KHD in Horb 49,- DM kostet (AmigaPlus 9/97). Ob
    es sich um diese CD handelt, wei&szlig; ich nicht. Diese hei&szlig;t "Das
    Epic Multimedia Lexikon".</P>

    <P>Jetzt habe ich doch ganz das letzte Icon des Eingangsschirmes vergessen,
    das Also_Available. Hier stellt die Firma EPIC alle seine Produkte vor.
    Werbung muss halt sein.</P>

    <P align="right">Wolf Zimmer</P>
    <HR>
    <BR>
    <A href="javascript:history.back()"><FONT size=
    "+1"><B>zur&uuml;ck</B></FONT></A> <BR>
    <HR>
    <BR>
  </BODY>
</HTML>

