<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Tests: DriverZ</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">DriverZ</font></center></h1></P>

<p>Mit &quot;DriverZ&quot; liefern uns Epic UK eine - der Name sagt es eigentlich schon - Treiber CD, die mit 20 MB aber eher sp&#228;rlich gef&#252;llt ist (um es mal vorsichtig auszudr&#252;cken). Aber es z&#228;hlt bekanntlich nicht nur Quantit&#228;t (man schaue sich nur die Amiga Plus CD`s &#228;lteren Datum`s an), sondern auch Qualit&#228;t. In wie weit &quot;DriverZ&quot; damit Boden gut machen kann, wird dieser Testbericht zeigen.</P>

<p><h2><center><font color="yellow">Treiber - sch&#246;n und gut! Aber wof&#252;r?</Font></center></h2></P>
<p>Wenn man das Wort <b>Treiber</B> h&#246;rt, denkt man unweigerlich ersteinmal an die zahlreichen Windows PC`s mit ihren sch&#246;nen und netten Treiberkonflikten. Der Amiga ging da immer den wesentlich einfacheren Weg und verlangte nicht f&#252;r alles - wie z.B. f&#252;r die Maus - einen Treiber. Und falls doch Treiber n&#246;tig waren, wurden diese doch recht h&#228;ufig sehr transparent in das System engebunden und Probleme hatte ich pers&#246;nlich erst in den wenigsten F&#228;llen. Als Paradebeispiel sei an dieser Stelle das Grafikkartensystem &quot;Picasso96&quot; (wobei hier mal eine Namens&#228;nderung dringenst n&#246;tig w&#228;re) angef&#252;hrt, welches nicht nur tadellos seinen Dienst verrichtet, sondern auch total transparent in das OS eingef&#252;gt wurde.</P>

<p>Aber ich will ja hier keinen Bericht &#252;ber &quot;Picasso96&quot; sowie Grafikkarten Treibern im allgemeinen schreibern, sondern die vorliegende CD mal genauer unter die Lupe nehmen. Das erste kleinere Manko l&#228;sst - mal abgesehen von dem minimalen Platzbedarf, den die Daten auf der Silberscheibe einnehmen - auch nicht lange auf sich warten: So erstrahlen die Icon`s doch glatt im alten OS 3.1 Stil, was den Verfasser dieser Zeilen erstmal sprachlos macht. Selbst wenn man die mit OS 3.5 eingef&#252;hrten &quot;Glow Icon`s&quot; noch nicht als Standard anerkennt, so h&#228;tte man doch zumindest auf die schon seit langen gebr&#228;uchlichen NewIcon`s setzen k&#246;nnen. Auch dieser Aspekt tr&#228;gt nicht gerade zu einem positiven ersten Einruck meinerseits bei, wenngleich die Icon`s sicherlich noch weniger mit der Qualit&#228;t einer CD zu tun haben.</P>

<p>Widmen wir uns nun dem Inhalt der CD. Als erstes f&#228;llt dem User, nach dem gewohnten Doppelclick auf das &quot;Assign&quot; Icon, das grelle &quot;Install Printer Driver&quot; auf, mit dem man sich die aktuellen Drucker Treiber installieren lassen kann. Wer das nicht will, kann nat&#252;rlich auch per Hand alles kopieren, aber mittels Filerequester geht es wesentlich einfacher. Zur Auswahl stehen neben einer ganzen Palette an &#228;lteren Modellen auch neuere Drucker aus dem Hause &quot;Canon&quot;, &quot;Epson&quot; und &quot;HP&quot;. H&#246;rt sich zwar alles gar nichtmal so schlecht an, aber in der Regel ist es nunmal so, da&#223; Amiga User zu 99 % schon eine der bekannten kommerziellen L&#246;sungen wie etwa &quot;Studio Pro.&quot; oder &quot;Turbo Print&quot; (mit dessen Hilfe man PC User vor Neid erblassen lassen kann) einsetzen bzw. auf einen der freien Treiber aus dem Aminet zur&#252;ckgreifen. Denn in der Praxis sieht es nunmal so aus: Man kauft sich einen Drucker, installiert einen der Treiber (Turbo Print gab es auch schon als kostenlose Vollversion auf der AmigaPlus Disk) und alles l&#228;uft - warum zum Henker sollte man sich dann noch eine Treiber CD zulegen, die mit 50 M&#228;rkern auch noch hoffnungslos &#252;berteuert ist ?</P>
<p><center><img src="driverz.jpg"></P>
<p><i>Tolle Gestaltung, oder?</I></P></Center>

<p>Na ja, gehen wir &#252;ber zum weiteren Inhalt der CD:</P>

<p><u>Digital Drivers:</U><BR>
Digitale Kamera`s erfreuen sich auch auf dem Amiga Markt immer gr&#246;&#223;erer Beliebtheit - nicht anders ist es zu erkl&#228;ren, da&#223; auf dieser CD auch zu diesem Thema etwas zu finden ist. Neben dem Tool &quot;Spymaster&quot; (bei dem sich mir der Eindruck aufzw&#228;ngt, da&#223; es sich um eine gecrackte Version handelt...), ist auch noch &quot;DC210Wizard&quot; f&#252;r die Kodak DC210 Kamera sowie der Beta Treiber f&#252;r die Connectix Quickam hier zu finden. Das &quot;Spymaster&quot; aus dem Jahre 1997 stammt und die beiden letzteren Programme auch im Aminet zu finden sind, sei der Vollst&#228;ndigkeit halber erw&#228;hnt.</P>

<p><u>SoundDrivers:</U><BR>
Hier ist nat&#252;rlich der Audio Standard &quot;AHI&quot; zu finden - leider haben es die Zusammensteller vers&#228;umt, eine aktuelle Version mitzuliefern, denn die hier zu findende Version ist auf das Jahr 1997 datiert - auch wenn 1997 sicherlich ein guter Jahrgang war (...), ist es eigentlich eine Frechheit, soetwas heute nochmal zu ver&#246;ffentlichen. Additional gibt`s bei Sound Driver`s noch einen (Aminet) Treiber f&#252;r die &quot;Melody&quot; Soundkarte sowie das &quot;True Sound Device&quot; f&#252;r MPEG Dateien.</P> 

<p><u>IDE-Drivers:</U><BR>
Neben ZIP Mount - einer Guide und einer Mountlist f&#252;r ZIP Laufwerke aus dem Aminet (auch f&#252;r PC ZIP`s) -macht hier auch noch das phantastische Paket &quot;IDE-Fix&quot; auf sich aufmerksam. Allerdings ist auch diese Version wieder hoffnungslos veraltet und l&#228;sst sich ebenfalls auf den Jahrgang 1997 datieren. 
Einen weiteren Kommentar erspaare ich mir an dieser Stelle ersteinmal...</P>

<p><u>MiscDrivers:</U><BR>
Die Bezeichnung &quot;Misc&quot; (&quot;Verschiedenes&quot;) kaschiert den Inhalt dieser Schublade sehr sch&#246;n: Alte Treiber aus dem Aminet, die mitunter auch aus dem Jahre 1996 stammen und heutzutage so gut wie keinen Nutzen mehr haben, da in den meisten F&#228;llen leistungsf&#228;higerer Ersatz vorhanden ist. Na ja, ein Tastaturtreiber f&#252;r &quot;Windows 95 Tastature&quot; sowie ein veralteter &quot;Wacom&quot; Treiber von 1995 lassen immerhin so etwas wie Nostalgie r&#252;berkommen, auch wenn das sicherlich nicht im Sinne der Zusammensteller war. Aber mal im Ernst: Wer diese Treiber braucht, hat diese - oder besser derren &#196;quvivalente in aktuellen Versionen - ohnehin schon im Einsatz und hat garantiert nicht auf diese CD gewartet. Ich kann mir jedenfalls nicht vorstellen, da&#223; jemand sich vor 5 Jahren ein &quot;Wacom&quot; Tablett geholt hat und bis jetzt auf einen passenden Treiber gewartet hat.</P>

<p><u>Port Drivers:</U><BR>
Oh, so ein Zufall. Noch mehr Aminet Software von anno duzemal! Hat noch jemand PCMCIA Modems im Einsatz? Wenn ja, findet er hier einen Treiber daf&#252;r um sein so lange vernachl&#228;ssigtes Modem mit beeindruckender Geschwindkeit mal wieder zu entstauben und anzuschlie&#223;en. Auch einen Ethernet Treiber gibt es hier, der - wie k&#246;nnte es auch anders sein - auch dem Aminet entstammt. Bin ich hier gerade in einem Paralleluniversum, in dem es kein Aminet gibt und ich mich im Jahre 1998 befinde? Hilfe!!!</P>

<p><u>ScannerDrivers:</U><BR>
Es kann ja nur besser werden; zumindest hatte ich das bis gerade gedacht! Hier sind die Pakete &quot;ArtecScan&quot;, &quot;ScanTek&quot;, &quot;ScanTrax&quot; und &quot;StScan&quot; zu finden. Und auch hier lege ich meine Hand daf&#252;r in`s Feuer, wenn ich behaupte, da&#223; es l&#228;ngst aktuellere Versionen als die von 1998 gibt. Mal abgesehen davon, da&#223; mit &quot;ScanQuix&quot; und &quot;FX Scan&quot; auch kommerzielle Scanner Treibersoftware verf&#252;gbar ist, finde ich es doch sehr verwunderlich, da&#223; Epic UK noch an das Programm &quot;St Scan&quot; geraten sind. Warum? Es stammt aus dem Jahr 1992. Wenigstens habe ich dadurch herausgekriegt, welchen Nutzen diese CD hat: Sicherheitskopien von antiquierter Software, damit diese nicht versehentlich verloren geht. Aber mal im Ernst: Erschlie&#223;t sich irgendeinem Leser der Sinn von Scanner Software von 1992 (!) auf einer aktuellen CD? Wenn ja: Bitte melden!!
</P>

<p><u>SCSI Drivers:</U><BR>
Muss ich wirklich auch diese Schublade noch auseinandernehmen? Hilfe!!! Auch hier offenbaart sich leider kein neues Bild, denn das SCSI Zeugs, was hier abgelegt wurde, entstammt ebenfalls &#228;lteren Jahrg&#228;ngen (hatte ich mich oben beschwerrt, da&#223; Software im Jahr 1997 entwickelt wurde? Das ist im Vergleich zu 1995 ja richtig modern!!) und d&#252;rfte auch im Aminet zu finden sein, sofern heutzutage noch Interesse an Streamern und A1000 SCSI Kontrollern (!!!!) besteht (kein Witz!!).</P>

<p><u>Mouse Drivers:</U><BR>
Neben Treibern f&#252;r bestimmte M&#228;use (unaktuell... blablabla..... auch im Aminet..... blablablabla) gibt`s noch einige Preset`s f&#252;r den Mauszeiger. Toll, oder? Darauf habe ich sehns&#252;chtig gewartet und sicherlich auch noch tausende an anderen Amiga Usern. Jetzt bin ich sprachlos....</P>

<p><h1><center><font color="blue">Fazit</font></center></h1></P>
<p>Kurz und schmerzlos? Wass soll dieser Dreck? Ersteinmal ist eine CD mit 20 MB eine Frechheit an sich, dann stimmt das &#196;u&#223;ere nicht (keine vern&#252;nftigen Icons, keine Guide etc.) und schlussendlich sind die Daten hoffnungslos veraltet, unvollst&#228;ndig und von keinerlei Nutzen mehr. Also nochmal: Was soll
dieser Dreck, Epic UK? Ich erkenne, so sehr ich es auch versucht habe, in diesem Produkt keinen Nutzen und raate allen ab, diese CD auch nur anzugucken. Aber der gr&#246;&#223;te Scherz kommt noch: Diese CD wird f&#252;r 50 M&#228;rker bei z.B. Vesalia vertickt! Vesalia mache ich da keinen Vorwurf - die k&#246;nnen ja nix daf&#252;r, da&#223; so ein Schrott auf CD gebrannt wird. Aber als Ersatz geht ein Vorwurf an die Addy von Epic UK! Also, lasst die Finger davon, damit Epic UK (das UK ist wichtig!) nicht noch den Eindruck bekommt, da&#223; soetwas auf dem Amiga Markt gebraucht wird. Ich f&#252;r meinen Teil w&#252;rde die CD gerade mal geschenkt nehmen - und das nur, weil man so eine neue CD H&#252;lle sein eigen nennt...</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
