<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>MSX Nostalgia</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=green alink=red>
<table width=95%>
<p><center><img src="kmsx1.gif"></P></center>

<p>Emulationen erfreuen sich auf dem Amiga gro&#223;er Beliebtheit, was sicherlich nicht nur an dem qualitativ hochwertigen Angebot an Emulatoren f&#252;r verschiedenen System liegt (ich sage nur: Den beeindruckenden MacOS Emulator &quot;Shapeshifter&quot;) sondern auch auf die allgemeine Nostalgiefreude von Amiga Usern zur&#252;ckzuf&#252;hren ist. Eines der relativ einfach zu emulierenden System ist das MSX System. Diesem System widmet sich auch die vorliegende <b>MSX Nostalgia</B> CD aus dem Hause Epic UK. Ob man damit wehm&#252;tig in alten Erinerrungen schwelgen kann, soll sich im folgenden herausstellen.</P>

<p><h2><center><font color="yellow">MSX? Was ist das &#252;berhaupt?</Font></center></h2></P>
<p>Wenn man Namen wie Atari, Gameboy oder Macintosh in Bezug auf Emulatoren h&#246;rt, wei&#223; der normale Amiga User in der Regel, um was f&#252;r ein System es sich handelt. Das MSX System sagt vielleicht nicht mehr jedem Leser etwas, so da&#223; ich ersteinmal kurz zusammenfasse, um was es sich bei dem MSX &#252;berhaupt handelt:</P>

<p>Das MSX kam urspr&#252;nglich im Jahre 1983 - also gar nichtmal so lange vor dem ersten Amiga - heraus und zielte auf den Massenmarkt mit einem vergleichsweise geringen Preis. Die Abk&#252;rzung steht &#252;brigens f&#252;r <b>M</B>icro<b>s</B>oft e<b>X</B>tended und l&#228;sst sich daraus ableiten, als das dieses System kompatibel zu vielen anderen Rechnern sein sollte. Es war praktisch eine erweiterte Version von Basic und Dos und so gesehen einer der fr&#252;hen Vorreiter f&#252;r die Idee, die hinter dem AmigaOne steht - die Klassifizierung eines Standards, der von anderen Herrstellern zum Bau eines Computers verwendet werden kann (auch wenn ich f&#252;r diesen Vergleich jetzt sicherlich Pr&#252;gel einstecken werde :-)).</P>

<p>Der erste Standard - MSX 1 - besagte unter anderem, da&#223; die Maschine als Minimum einen Z80 mit 3.5. Mhz, 16 KB Ram, 16 KB Video Ram und das MSX Rom besitzen muss. Diese Mindestanforderrungen wurden eigentlich selten eingehalten, so da&#223; die mei&#223;ten Maschinen mit etwas mehr Speicher daherkamen, was ja nicht weiter tragisch ist. Die Grafik war f&#252;r die damalige Zeit mit Aufl&#246;sungen von maximal 256 X 192 Pixeln bei 16 Farben zwar nicht sehr innovativ, aber sicherlich zwecksm&#228;&#223;ig, wobei diese Aufl&#246;sung auch nur mit Limitierungen benutzt werden konnte.</P>

<p>Die zweite Version des Standards - logischerweise als MSX 2 bezeichnet - kam im Jahre 1985 heraus und erweiterte das System insbesondere in Sachen Grafik. Es waren h&#246;here Aufl&#246;sungen (bis hin zu 512 X 212 Pixeln) sowie 256 Farben m&#246;glich. Hinzu kamen weitere Verbesserrungen, wie Unterst&#252;tzung f&#252;r Genlock`s und Videodigitizer sowie ein Amiga &#228;hnlicher Blitter. Mitlerweile verf&#252;gte das System auch &#252;ber mehr Speicher - sowohl im Video Ram Bereich (128 KB) als auch im normalen Ram Bereich (128 bzw. 256 KB). Ein 3.5&quot; Laufwerk war mitlerweile auch an Bord und bot zusammen mit dem Cartridge System ein vielseitig nutzbares System. Das System, welches zwischenzeitlich von mehr als 40 Herrstellern gefertigt wurde (eine Zahl, &#252;ber die sich der AmigaOne freuen k&#246;nnte), erfreute sich insbesondere in Japan gro&#223;er Beliebtheit und wude sogar noch 1994 gefertigt. Ach ja, eine kleine Anmerkung noch zum Schluss dieses kleinen Abrisses &#252;ber das MSX: Da das MSX 
exact die selbe Diskettenstruktur verwendet wie MS-DOS, kann man mittels CrossDos auch MSX Disketten auf dem Amiga lesen bzw. beschreiben. Zudem kann CrossDos auch einseitig beschriebene MSX Disketten handhaben - ein Feature, das moderne PC`s nicht mehr beherrschen. Only Amiga makes it possible!</P>
<p><center><img src="kmsx2.jpg"></center></P>

<p><h1><center><font color="blue">Kann die MSX Nostalgia das Feeling wieder aufleben lassen?</font></center></h1></P>
<p>Auch bei diesem Produkt aus dem Hause Epic UK springen mir zun&#228;chst einige negative Dinge in`s Auge: Mit rund 63 MB ist auch diese CD nicht gerade mit Daten &#252;berf&#252;llt. Jetzt mag es sicherlich noch Leute geben, die damit argumentieren wollen, da&#223; MSX Software aufgrund des Alters ohnehin wenig Platz wegnimmt. Okay, das ist sicherlich ein Argument, wobei man im Falle von <b>MSX Nostalgia</B> noch hinzuf&#252;gen muss, da&#223; auch mal wieder viel Windows Software mit an Bord ist, die locker die H&#228;lfte des Platzes wegnimmt. Zudem war man im Hause Epic UK so dreist und hat noch einige Windows95 Games mit auf die CD kopiert - das ganze dann als Amiga CD anzupreisen ist somit mehr als unversch&#228;hmt. Na ja, an MSX Software sind insgesamt gut 25 MB auf der CD vorhanden, wenngleich es sich nur um Spiele handelt, die zudem in den Ordnern &quot;Games&quot;, &quot;Games2&quot; und &quot;Games2 - Real Names&quot; teilweise noch doppelt vertreten sind.</P> 

<p>Die Ersteller wollten diese System wohl f&#252;r mehrere Betriebssysteme interessant machen, so da&#223; nicht nur Versionen f&#252;r den Amiga &amp; PC mit dabei sind, sondern es auch Emulatoren f&#252;r Systeme wie Macintosh, OS2 oder Unix gibt. F&#252;r den Amiga ist der Emulator fMSX in der Version 2.0 beigelegt worden, der in Sachen Geschwindigkeit das Original erwartunsgem&#228;&#223; locker in die Tasche steckt, aber auch im Vergleich zu Emulationen auf anderen Systemen eine gute Figur macht. Es sei an dieser Stelle der Einschub gestattet, da&#223; es mitlerweile schon eine neue Version von fMSX, n&#228;mlich 2.2., gibt, die u.a. auf dem Aminet Set 9 zu finden ist. Wer also an einer Emulation des MSX interessiert ist, der sollte sich tunlichst auch die aktuelle Version installieren, mit der man aber daf&#252;r auch die komplette Software dieser CD zum laufen kriegt und der sich in der Praxis nicht nur als &#228;u&#223;erst flink, sondern auch sehr stabil und benutzerfreundlich erweist - also alles Eigenschaften, 
die Amiga Software seit jeher auszeichnet.</P> 

<p>Die Spiele, die auf dieser CD zu finden sind, decken im Grunde alles ab, was Rang und Namen auf dem MSX hatte: So machen Spiele wie &quot;Arkanoid&quot;, &quot;Crazy Car&quot;, &quot;Pacman&quot; oder &quot;Zoom909&quot; auch heute noch, trotz der nat&#252;rlich nicht mehr zeitgem&#228;&#223;en Grafik, totalen Spa&#223; und konnten zumindest mich stundenlag vor dem heimischen Amiga - bzw. MSX - fesseln. Es ist schon interessant, da&#223; auch in der heutigen Zeit, in der die CPU`s immer schneller werden, die Grafikkarten mit 64 MB oder mehr ausgestattet werden, Spiele l&#228;ngst nur noch auf CD bzw. sogar schon auf DVD erscheinen, Spiele, die gerade mal 16 KB belegen, noch derma&#223;en viel Charme verspr&#252;hen k&#246;nnen und zudem noch &#228;u&#223;erst mitrei&#223;end sind - mitunter sogar mitrei&#223;ender als so manches hochgez&#252;chtetes 3D Game mit noch so toller 3D Engine. Okay, das ist vielleicht nicht jedermann`s Sache, aber ich woltle Euch auch ja nur meinen pers&#246;nlichen Eindruck 
schildern, den ich von diesem System hatte, auch wenn ich 1983 noch zu jung war, um es damals &quot;live&quot; mitzuerleben. Na 
ja, daf&#252;r hat mich heute - im Jahre 2001 (!!) - noch einmal das MSX Fieber gepackt, womit ich eigentlich nicht gerechnet hatte. Das gilt jetzt aber nur f&#252;r die mitgelieferten Spiele (m&#252;ssten abz&#252;glich der doppelten so um die 500 St&#252;ck sein), denn Anwendungen habe ich nicht testen k&#246;nnen, da diese nicht beilagen. W&#228;re sicherlich auch mal ganz interessant gewesen, eine Tabellenkalkulation auf so einem Dinosaurier zu sehen :-))) Allerdings gibt es im Internet noch einige Page`s, auf denen man MSX Software legal runterladen kann. Zwei davon habe ich hier mal verlinkt:</P>

<p><a href="http://grelb.src.gla.ac.uk:8000/~webster/msx" target="_blank">http://grelb.src.gla.ac.uk:8000/~webster/msx</A><BR>
<a href="http://www.cs.umd.edu/users/fms/" target="_blank">http://www.cs.umd.edu/users/fms/</A></P>

<p>Vielleicht konnte ich ja jetzt jemanden f&#252;r das MSX begeistern? Wenn ja, w&#252;rde ich mich &#252;ber Meinungen dazu nat&#252;rlich via NC freuen :-)))</P>
<p><center><img src="fkmsx3.gif"></P></center><br>
<p><center><img src="kmsx4.gif"></P></center><br>
<p><h1><center><font color="red">The Final Solution</font></center></h1></P>
<p>Meine Begeisterrung, die ich oben geschildert habe, kommt nicht etwa von dieser CD, sondern von der Faszination des MSX Ger&#228;tes. Man muss klipp und klar sagen, da&#223; sich die Zusammensteller auch in diesem Fall nicht alzu viel M&#252;he gegeben haben, was zugebenerma&#223;en durch die interessante Thematik kaschiert wird. Somit ist dieses Produkt das sicherlich &quot;beste&quot; in dieser NC aus dem Hause Epic UK getestete, welches sich auf ein schwaches &quot;ausreichend&quot; retten konnte. Leider konnte ich den Preis dieser CD - die mir der Andreas freundlicherweise zur Verf&#252;gung gestellt hatte - nicht ermitteln. Sollte dieser nicht zu hoch sein, k&#246;nnt ihr Euch den Kauf ja bei Interesse an Emulationen ja mal &#252;berlegen - wer einen Netzugang hat, kann sich die Software aber auch so laden. Da diese f&#252;r das MSX nicht so gro&#223; ist, d&#252;rfte das in Verbindung mit dem Freeware Emulator fMSX aus dem Aminet sogar die bessere Alternative sein...</P>



   



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
