<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Test: Total Tetris</TITLE>
</HEAD>
<BODY TEXT=white background="ktest.gif" link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Total Tetris</font></center></h1></P>
<p>Wer kennt den Spieleklassiker &quot;Tetris&quot; nicht, der sich schon seit Anbeginn der Homecomputer gro&#223;er Beliebtheit erfreut? Auch heutzutage ist dieses Spielchen - entsprechende Variationen nat&#252;rlich eingeschlossen - nicht aus der Computerwelt hinwegzudenken. Egal auf welcher Plattform: Tetris ist ein simples Spiel, das schnell s&#252;chtig macht und dessen Bann man eigentlich nicht entkommen kann. Grund genug f&#252;r Epic UK, eine entsprechende CD mit Tetris Clones zusammenzustellen. Ob diese CD genauso s&#252;chtig macht, wie das Original Tetris, soll im folgenden festgestellt werden.</P>

<p><h2><center><font color="yellow">Steinchen auf Steinchen...</Font></center></h2></P>
<p>Wenn man denkt, da&#223; man mit &quot;Total Tetris&quot; eine randvolle CD mit ausschlie&#223;lich f&#252;r den Amiga bestimmter Software bekommt, muss sich schnell eines besseren belehren lassen. Denn eigentlich sind es gleich zwei Dinge, die den unbedarften K&#228;ufer der CD nach dem einlegen etwas sauer aufsto&#223;en: Da w&#228;re zum einen die f&#252;r eine CD recht geringe Datenmenge von nicht einmal 200 MB. Somit ist die CD noch nichtmal zu einem Drittel gef&#252;llt. Das w&#228;re an sich noch nichtmal so schlimm, sind doch Amiga Programme von Haus aus recht klein und weniger Platz fressend. Allerdings handelt es sich bei den vorliegenden 200 MB auch nicht ausschlie&#223;lich um Amiga Programme, denn die H&#228;lfte der CD belegen irgendwelche PC Versionen von Tetris, die f&#252;r den normalen Amiga User wohl eher uninteressant sind - oder wer kauft sich eine Amiga CD, um diese mittels eines PC`s zu benutzen? Auf dem PC Sektor sind sicherlich noch massig Alternativen zu finden...</P>

<p>Wer allerdings einen schnellen Amiga sein eigen nennt - sprich: eine 68060 CPU mit viel Ram und Grafikkarte - und auch noch den PC Emulator &quot;PC Task&quot; einsetzt, kann ja mal versuchen, das eine oder andere Game zu emulieren. Nicht alle PC Spiele auf dieser CD wurden f&#252;r Windows geschrieben, sondern es gibt auch einige Vertreter die sich mit MS DOS zufrieden geben. &#220;ber die Qualit&#228;t dieser Games m&#246;chte ich an dieser Stelle nichts sagen, denn ich habe diese weder auf einem Original PC noch unter Emulation getestet. Allerdings stimmt es mich etwas nachdenklich, wenn ich in den jeweiligen Textdateien der Games nachlesen muss, da&#223; es sich um Shareware handelt, die man erst noch registrieren muss. Auf Spiele Compilation`s finde ich pers&#246;nlich eingeschr&#228;nkte Spiele ein wenig nervig...</P>

<p><h2><center><font color="red">Der Amiga Teil</Font></center></h2></P>
<p>Begr&#252;&#223;t wird man im Amiga Teil der CD von MagicWB Icon`s, die zwar nicht meinen pers&#246;nlichen Geschmack treffen, aber allemal mehr hermachen, als Standard OS 3.1 Icons wie sie etwa auf Produkten wie &quot;DriverZ&quot; aus dem gleichen Hause (Epic UK) zu finden waren. Eine Begr&#252;&#223;ungsguide bzw. selbst eine schn&#246;de Textdatei, die einen den Einstieg etwas einfacher macht, sucht man auch hier vergebens, was den bisherigen eher negativen Eindruck nicht unbedingt verbessert. Na ja, wie auch immer: Nach dem ordnungsgem&#228;&#223;en &quot;Assign CD&quot;, kann man sich den Spielen hingeben, die intelligenterweise in 4 Schubladen namens &quot;Games 1&quot; bis &quot;Games 4&quot; alphabetisch sortiert wurden.</P> 
<p><center><img src="tt1.jpg"></P></center>
<p>Die Tetris Clones - es sind insgesamt 89 St&#252;ck f&#252;r den Amiga - stammen aus den unterschiedlichsten Jahrg&#228;ngen. So findet man mitunter auch Games, die schon 10 Jahre alt sind, wobei das kein Kritikpunkt sein soll. Es wird heutzutage halt nicht mehr so viel f&#252;r den Amiga programmiert, wie Anfang der `90er Jahre, wobei es aber auffallend ist, da&#223; man aktuelle Tetris Clones eigentlich gar nicht findet. Nichtsdestotrotz haben auch die alten Games einen gewissen Charme - sofern man diese auf seinem System zu laufen kriegt, denn nicht alles, was man so anklickt, startet auch sofort. Deswegen sollte man immer einen Degrader zur Hand haben, damit man das eine oder andere Spiel doch noch zum laufen &#252;berreden kann. Oftmals reicht es schon aus, den Cache der CPU abzustellen oder den Chipsatz auf ECS zur&#252;ckzustellen. Was allerdings auff&#228;llig ist, ist die Tatsache, da&#223; viele der Games auch im Aminet zu finden sind. Besitzer der Aminet Set`s k&#246;nnen ja mal vergleichen, 
wieviele der 89 Spiele auch im Aminet zu finden sind. Ich bin auf jeden Fall auf eine Quote jenseits der 75 % gekommen. Aber kommen wir nun zur Qualit&#228;t der Clones, die - sicherlich haben es sich schon einige gedacht - sehr schwankend ist. So gibt es gut gemachte Clones wie etwa &quot;Hexagons&quot; oder &quot;GemZ&quot;, aber erwartunsgem&#228;&#223; befinden sich auch qualitativ minderwertige Spiele auf der CD, die einfach keinen Spielspa&#223; aufkommen lassen wollen. Nicht unwesentlichen Anteil daran d&#252;rfte auch das teilweise hohe Alter haben, denn wenn man erst rumkonfigurieren muss, nur um dann festzustellen, da&#223; das Spiel keinen Spa&#223; macht und auch grafisch eher angestaubt daherkommt, macht sich schnell Ern&#252;chterrung breit.</P> 

<p>Als kleine Zugabe gibt es noch einige (Tetris) Module, die man sich mit dem beigelegten Abspieler am Amiga auch sofort anh&#246;ren kann. Wer sich daf&#252;r begeistern kann, der sollte auch unbedingt mal im versteckten &quot;System&quot; Ordner unter &quot;Module&quot; nachgucken - hier finden sich einige weitere, wobei ich das Gef&#252;hl habe, da&#223; diese eher zuf&#228;llig auf die CD gekommen sind und eigentlich nicht dazu gedacht waren, auf &quot;Total Tetris&quot; ihr dasein zu fristen. Das d&#252;rfte die Fans von Computermusik aber eigentlich auch nicht weiter st&#246;ren :-)))</P>
<p><center><img src="tt2.jpg"></P><p><i>Einer der besseren Clones: WB Tetris</I></Center></P>
<p><h2><center><font color="blue">Alles in allem: Nur ein laufer Aufguss?</Font></center></h2></P>
<p>Tja, leider habe ich den Eindruck, da&#223; die Entwickler nicht sehr viel Herzblut in diese CD gesteckt haben. So muss man nicht nur die Datenmenge bem&#228;ngeln, sondern auch die lieblose Aufmachung: Keine Begr&#252;&#223;ungsguide, schlampiges Kategoriesystem und zu viel alte Software. Hinzu kommt, da&#223; man als regelm&#228;&#223;iger K&#228;ufer der Aminet CD`s ohnehin schon einen Gro&#223;teil der Software hat und ich hinzuf&#252;gen m&#246;chte, da&#223; es ohnehin keinen Spa&#223; macht, st&#228;ndig das
gleiche Spielprinzip zu verfolgen - der Reiz, der einstmals mit dem Wort &quot;Tetris&quot; einherging, ist so n&#228;mlich schnell verflogen. Insgesamt kann ich guten Gewissens vom Kauf dieser 25 DM teuren CD abraten - das Geld kann man in Bezug auf den Amiga allemal sinnvoller investieren. Tja, schade Epic UK, aber auch das war wohl nix!</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
