<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=red alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P><ul>
<li><a href="#yonder.html">An Yonder</A><BR></LI>
<li><a href="#wolf.html">An Wolf Zimmer</A><BR></LI>
<li><a href="#andreas.html">An Andreas Guldner</A><BR></LI>
<li><a href="#top.html">Top 5</A></UL></LI></P>
<hr>
<a name="yonder.html">

<p><b><u>Hi Yonder!</B></U><BR>
Fasching ist also nicht Dein Ding? Okay, meines vielleicht auch nicht, aber zu dem Zeitpunkt, an dem Du den letzten Brief an meine Wenigkeit in den Rechner getippt hast, war ich in D&#252;sseldorf - Karneval feiern (aber nur wegen einiger netter M&#228;dels :-))).</P>

<p>Das Problem, da&#223; wir frische &amp; junge User in der NC br&#228;uchten, ist eigentlich schon l&#228;nger bekannt. Der momentane Zustand ist auf jeden Fall sehr unbefriedigend und f&#252;r den gr&#246;&#223;ten Amiga Club in Deutschland eher lachhaft. Die Qualit&#228;t sehe ich dabei weniger als Problem, sondern eher die Quantit&#228;t, was sich auch in Bereichen wie Leserbriefen oder Diskussionsbeitr&#228;gen schmerzhaft bemerkbar macht. Wenn jeder mal wieder den einen oder anderen Beitrag schreiben w&#252;rde, w&#228;re der NC schon geholfen.</P>

<p>Ich hoffe doch auch mal, da&#223; es ein Treffen 2001 gibt, auch wenn ich leider keine Verbessrungsvorschl&#228;ge f&#252;r Sascha habe (sorry). Mir hat 2000 im gro&#223;en und ganzen recht gut gefallen und ich bin mir sicher, da&#223; ich da nicht der einzigste war. Also, abwarten und Tee trinken :-)))</P>

<p>Thema: Neues Outfit der NoCover! Das die Bilder nicht alle einheitlich sind und aus verschiedenen Quellen entnommen wurden, ist auch mir aufgefallen. Mich st&#246;rt das zwar nicht ganz so erheblich, aber f&#252;r den Au&#223;enstehenden ergibt sich somit ein sehr unheitliches Bild der NC, was f&#252;r &quot;unser&quot; Image auch nicht unbedingt f&#246;rderlich ist. Bleibt abzuwarten, ob der Andreas daran noch was &#228;ndern wird. Ich habe mir jedenfalls auch vorgenommen, in Zukunft meine Artikel weniger monoton zu gestalaten und hoffe auf Anregungen Eurerseits.</P> 

<p>Ach ja, von der Heavy Metal Guide ist doch nochmal eine neue Version in AmigaGuide erschienen, die aber im Grunde mit der alten nix mehr zu tun hat. Kannst ja mal im Aminet unter docs / hyper schauen und mir - sofern Du Zeit &amp; Bock hast - per NC was dazu sagen. Aber bitte nicht entt&#228;uscht sein: Es hat sich einiges ge&#228;ndert!</P>

<p>Thanx f&#252;r das W&#252;nschen von Erfolg f&#252;r die Radiosendung - ich bin mit der momentanen Entwicklung eigentlich ziemlich zufrieden, zumal es mitlerweile drei Sendungen geworden sind und auch die Homepage sich langsam entwickelt und zunehmend interessanter wird (ist zumindest meine Meinung). &#220;ber das Aussehen der HP gibt es zwar getrennte Meinungen, aber ich finde sie gar nichtmal so &#252;bel. Kannst bei Interesse ja mal reinschauen <a href="http://in.germany.com/powerplant" target="_blank">(http://in.germany.com/powerplant)</A>....</P>

<p>Nightwish kann ich Dir - bei Interesse - nat&#252;rlich auch gerne auf Tape kopieren. Einfach Tape (`s) an meine Addy und ih kopiere Dir was drauf.</P>

<p>So, da&#223; war es auch schon wieder von meiner Seite aus. See ya!</P>
<hr>
<a name="wolf.html">
<p><b><u>Hallo Wolf!</B></U><BR>
Bald ist es soweit: Am 10.April bekommen wir hier endlich ISDN und ich kann endlich auch im Internet surfen und die E-Mails auch endlich schneller beantworten. Das macht auf jeden Fall einiges sehr viel einfacher und ich hoffe, da&#223; alles so klappt, wie ich mir das vorstelle. Vielleicht bekomme ich dann ja auch wieder interessante Themen f&#252;r die NC? Wer wei&#223;....</P>

<p>Deine Java Script Spielereien in der letzten Wolf Info fand ich echt gelungen. Interessiert mich nur, wieviele das auch gemerkt haben. Wer es noch nicht wei&#223;: Einfach mal mit AWeb vom OS 3.9 Paket mit dem Mauszeiger &#252;ber das Wolf Info Bild gehen - schwups, wie von Geisterhand erscheint ein neues Bild :-))))</P>

<p>&#220;ber Berlin werde ich in der NoCover wohl kaum referrieren, was nicht zuletzt an akutem Zeitmangel meinerseits liegt, da das Abi jetzt unaufh&#246;rlich n&#228;her r&#252;ckt und ich mit &#252;berm&#228;&#223;ig viel Zeit im Moment nun wirklich nicht gesegnet bin. Ich bin schon froh, wenn ich all die Standarddinge - NC &amp; Fireball Artikel, MetalCorner &amp; Homepage - irgendwie unter einen Hut kriege und dann noch etwas Zeit &#252;brig habe. Zumal ich mich momentan auch noch nach einer Zivildienststelle umsehen muss und ganz gerne eine Stelle h&#228;tte, die mir auch gef&#228;llt. Du siehst: Momentan stecke ich etwas im Stress und ich bitte es mir nachzusehen, wenn in den n&#228;chsten Ausgaben von mir nicht ganz so viel zu lesen ist.</P>

<p>Wie hat Dir eigentlich mein Test zur Aminet CD gefallen? Da Du die Tests nicht mehr weitermachen wolltest, werde ich diese wohl nun &#252;bernehmen und weiterf&#252;hren. Der Andreas hatte mich durch die Zusendung der Aminet CD 41 quasi zwangsverpflichtet - na ja, da sich kein anderer daf&#252;r findet, werde ich es wohl auch weitermachen. Aus meiner Sicht geh&#246;ren n&#228;mlich die zweimonatigen Aminet CD Tests zur Pflicht eines jeden Online Magazins und sollten deswegen auch in der NC nicht fehlen.</P>

<p>So, bis bald mal!</P>  
<hr>
<a name="andreas.html">
<p><b><u>Hi Andreas!</B></U><BR>
Du stehst OS 3.9 also auch eher kritisch gegen&#252;ber? Ich pers&#246;nlich kann all die Kritik am OS 3.9 nicht wirklich verstehen, denn wie ich schon in meinem Testbericht bzw. Nachtrag in der letzten Ausgabe geschrieben habe, finde ich, da&#223; OS 3.9 ein gelungenes Update Paket darstellt und OS 3.5 w&#252;rdig erg&#228;nzt. Sicherlich gibt es jetzt Leute, die nach wie vor etwas zu n&#246;rgeln haben - aber das wird es wohl in allen Bereichen geben.</P>

<p>Du selber setzt noch OS 3.1 ein, oder? Tja, also dann w&#252;rde ich Dir empfehlen OS 3.9 direkt zu kaufen, da es alle &#196;nderrungen seit 3.1 enth&#228;lt. Ich fande seinerzeit OS 3.5 schon als einen wichtigen Schritt in die richtige Richtung, auch wenn sich der wahre Wert von OS 3.5 / 3.9 erst bei der t&#228;glichen Arbeit bemerkbar macht. Ich jedenfalls habe nicht das Gef&#252;hl &quot;eine &#252;berteuerte Sharewaresammlung&quot; oder &#228;hnliches gekauft zu haben - vielmehr erh&#228;lt man f&#252;r sein Geld einen reelen Gegenwert, der sich in der Praxis auszahlt. Wie sehr Meinungen doch differieren k&#246;nnen, zeigt auch die neue AmigaAktuell, in der gleich zwei Meinungen f&#252;r OS 3.9 vertreten waren. Also, OS 3.9 ist eine aus meiner Sicht lohnende Investition, die ich nicht missen will. Kann ich Dir wirklich w&#228;rmstens empfehlen!</P>

<p>See ya!</P>
<hr>
<a name="top.html">

<p><h2><font color="green">Top 5</font></center></h2></P>

<p>1. Workshops von Martin Voepel (steckt viel Arbeit hinter!!)<br>
2. Flatrate von Wolf Zimmer (viele Info`s)<br>
3. FX Scan von Martin Voepel (guter Test)<br>
4. Wolf Info von Wolf Zimmer (interessant wie immer!)<br>
5. Feedback von Sascha van Wahnem (yup!)</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
