<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
<script language="JavaScript"> 
function Test()
 {
  alert("Folgende Formulardaten wuerden beim Absenden uebertragen:\n"+ document.Feedback.UserName.name + "=" + document.Feedback.UserName.value + "\n" + document.Feedback.UserBrowser.name + "=" + document.Feedback.UserBrowser.value);
 }
</script>   
</head>
<body background="wolf1.jpg" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a2"><b>f&uuml;r Martin Voepel</a></b></li>
<li><a href="#a3"><b>f&uuml;r Rolf N&uuml;nninghoff</a></b></li>
<li><a href="#a4"><b>f&uuml;r Sascha van Wahnem</a></b></li>
</ul>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Kilian!</h3>

<p>Dein klitzekleiner versteckter Vorwurf, ich h&auml;tte doch einen
Messeartikel schreiben sollen, besteht ja vollkommen zu Recht. Aber ganz
ehrlich, mir fehlte die entsprechende Motivation und ich hatte leichte
Bef&uuml;rchtungen, dass sich in meinen Schreibstil wieder zu viele
negative Formulierungen einschleichen k&ouml;nnten. Eine Information ist
zwischenzeitlich schon Realit&auml;t geworden (Schatztruhe ·/· GTI) und die
andere l&auml;sst auch nicht mehr lange auf sich warten. Aus diesem Grunde
war ich froh, dass ich mich raushalten konnte. </p>

<p>Schade, dass du dir den Eternity nicht angeschaut hast. Die
Amigaemulation war echt etwas schneller als mein 4000/040. Ich habe ihn
zwar nicht rechnen gesehen, aber die screengro&szlig;en Bilder bauten sich
deutlich schneller auf, als ich es gewohnt bin. Mir wurde auch gesagt, die
Leistung entspricht einem 060er. Auch habe ich keine
Fehleranf&auml;lligkeit gesehen, aber das hat nichts zu sagen. Denn wenn
ich etwas vorf&uuml;hren w&uuml;rde, w&uuml;rde ich auch versuchen,
erkannte Unzul&auml;nglichkeiten keinesfalls zu pr&auml;sentieren. Den
vordergr&uuml;ndigen Vorteil, den ich bei dem Eternity sehe, ist, dass
sowohl Amiga- wie PC-Laufwerke eingebaut sind. </p>

<p>Die Frage nach dem Layout ist ein ganz klein wenig unfair. Du
wei&szlig;t, dass ich nie jemandem meinen Geschmack aufzwingen m&ouml;chte
und immer sage, dass jeder so verfahren m&ouml;ge, wie er es selbst als
sch&ouml;n empfindet. Schaue mal, monoton (also einfarbig/eint&ouml;nig)
kann es doch gar nicht sein, du benutzt eine Okerschrift auf schwarz, was
auch auf einem 16-Farbenschirm kr&auml;ftig angezeigt wird und streust
gr&uuml;n und rot, also Komplement&auml;rfarben ein, die auf einem
16-Farbenschirm dunkler sind als bei einer h&ouml;heren Aufl&ouml;sung,
aber auch hier noch sehr deutlich hervortreten. Zugegeben, der schwarze
Hintergrund wirkt bei l&auml;ngeren Artikeln anstrengender, als eine dunkle
Schrift auf einem leicht get&ouml;nten hellem Hintergrund. Nur was mich
ganz ehrlich wundert, ist dass die Browser die falsche Schreibweise
akzeptieren: TEXT=ffaa00. Richtig m&uuml;sste es n&auml;mlich heissen:
TEXT=#ffaa00 oder TEXT=&quot;#ffaa00&quot;. Wenn du Gelb verwendest, dann
nur f&uuml;r &Uuml;berschriften. Bei Text mit einem gelben Font in
Standardgr&ouml;&szlig;e auf schwarzem Untergrund fangen die Augen sehr
schnell an zu tr&auml;nen, wenigsten bei mir im 16-bit Betrieb. </p>

<p>Wenn du sagst, dass dein Layout eint&ouml;nig sei, dann ist es meines
auch, Alle Artikel haben bei mir standardm&auml;&szlig;ig den gleichen
Hintergrund und die Form des Seitenaufbaus ist fast auch immer gleich. Aber
solange keiner mosert, &auml;ndere ich es auch nicht ab. Und damit basta.
</p>

<p>In punkto NoCover hast du heute etwas zu fr&uuml;h gejubelt. Die Ausgabe
NC-84 ist ja mal wieder etwas d&uuml;nn ausgefallen. Man sollte ruhig schon
sagen: sehr mager ausgefallen. Langsam aber sicher manifestet sich bei mir
die &Uuml;berzeugung, die wollen alle nicht mehr. Dass nichts mehr f&uuml;r
die NoCover geschrieben wird, hat nichts mit fehlender Zeit zu tun, sondern
mit Frust gegen den eigenen Amiga. Sobald man heute ins Netz geht und sich
eine Website anschauen will, erscheint doch mit gro&szlig;er
Regelm&auml;&szlig;igkeit ein Requester, der auffordert eine neue Version
des Browsers zu ziehen, um diese Seite anschauen zu k&ouml;nnen. IBrowse
sagt von sich er sei ein Netscape und verweist sogar stolz auf seine
Version 2.2, nur das Netz sagt, ohne Version 5 l&auml;uft nichts mehr. Ein
fataler Irrtum, der durch die Programmierung der Javascripts an den Tag
gelegt wird, weil hier nur zwischen Netscape und Explorer unterschieden
wird und auf Opera und alle anderen keine R&uuml;cksicht genommen wird. Die
jungen Webdesigner interessiert eine 4%ige Randgruppe eben nicht. Alle
neueren Websites werden mit HTML-Standard 4.0 unter gnadenloser Ausnutzung
von Javascript, CSS und Quicktime erstellt. Ich kenne das neue AWeb 3.4
nicht, aber wahrscheinlich ist man auch damit genauso verloren, wie mit dem
IBrowse 2.2 und ob der neue Voyager Abhilfe verschafft, hat noch keiner
gesagt. Und dieser Frust hat sich auf die Motivation als Autor zu fungieren
niedergeschlagen. So sehe ich dieses Manko. So jetzt habe ich aber genug
polemisiert. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Martin!</h3>

<p>Der Zusatz &raquo;und schreibe frohen Herzens&laquo; ist keinesfalls
ironisch gemeint. Ich will mich jetzt nicht dar&uuml;ber auslassen, wann
und wie ich manches ironisch beschreibe. Wenn ich eine schriftliche Ironie
von mir gebe, dann geschieht dieses aber so, dass es auch jeder merkt. In
deinem Falle sollte es eine Aufmunterung sein, dich nicht durch negative
&Auml;u&szlig;erungen davon abhalten zu lassen, weiterhin zu schreiben. Die
NoCoverleser sind schon ein seltsames Volk. Keiner will selber etwas
schreiben, aber alle wollen etwas lesen und am liebsten dann noch
dar&uuml;ber mosern, was andere schreiben. Daran wirst du dich hoffentlich
gew&ouml;hnen und dich nicht abschrecken lassen. </p>

<p>Dass du meinen Artikel &uuml;ber die Webpr&auml;senz des ehemaligen
Regierungsbunkers als &quot;alter Hut&quot; bezeichnest, pikierte mich
schon ein wenig. Erstens habe ich nur eine neue Website angef&uuml;hrt,
zweitens habe ich etwas &uuml;ber die Publikation zum restlos
&uuml;berteuerten Bildband gesagt und drittens habe ich nur einen
offiziellen Artikel in Ausz&uuml;gen gebracht, woraus aber eine ganze Menge
zu ersehen ist, warum ein solches Bauwerk ben&ouml;tigt wird und welche
immense Infrastruktur dahinter steckt. Selbstverst&auml;ndlich gibt es auch
heute noch Einzelheiten, die Vertraulich (Nato Confidential) bis Streng
Geheim sind. Wenn ein Bericht im Stern und auch im Spiegel etwas
geheimdienstlich Relevantes beinhaltete, wurde immer gerichtlich
(nicht&ouml;ffentlich) dagegen angegangen. Manche Journalisten und auch
Abgeordetnete haben Haftstrafen abgesessen, die einem Serienm&ouml;rder
gleichkamen. </p>

<p>Deinen Workshop &quot;ws_screenshot&quot; finde ich gut. Pers&ouml;nlich
nutze ich aber die Funktion &uuml;ber TurboPrint, den Bildschirm als IFF
abzuspeichern (CTRL &brvbar; ALT &amp; S) oder einen Ausschnitt als IFF zu
erstellen (CTRL &brvbar; ALT &amp; A) und anschlie&szlig;end werden die
Screenshots mit ADPro aufbereitet und abgespeichert. Da TurboPrint bei mir
im Hintergrund schon l&auml;uft, brauche ich kein zweites Programm laufen
zu lassen. Damit es bei TurboPrint auch funktioniert, muss die Funktion
&quot;Hardcopy&quot; eingeschaltet sein. </p>

<p>Zum heutigen Abschluss m&ouml;chte ich dir ein gro&szlig;es Lob zukommen
lassen. Deine Beitr&auml;ge (FxScan, beide Workshops, der Multimediabeitrag
WWV) haben mir durch die Bank weg gefallen. Beim R&auml;tsel muss man halt
nur etwas warten, bis in der Help-Blase angezeigt wird, auf welche Seite
verzweigt wird oder ein Blick in die Statuszeile sagt es sofort. Das
solltest du etwas kaschieren, sonst ist es zu leicht und dein ganzer
Arbeitsaufwand steht in keiner Relation zur Pr&auml;sentation. Beim
Durchlesen wurde ich sofort animiert, auch einmal eine Wissensabfrage zu
starten. Begonnen hatte ich damit, die Antworten mittels Javascript in
einem Fenster anzuzeigen. Dann fragte ich mich, wieviele der Leser haben
&uuml;berhaupt einen javascriptf&auml;higen Browser. So kam ich halt
darauf, die Antworten einfach auf einer zweiten Seite aufzuzeigen. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a3">Gr&uuml;&szlig; dich Rolf!</h3>

<p><font color="#008000"><i><b>Das Netz, der Netze macht sicher viele
&quot;Surfer&quot; sehr s&uuml;chtig. </font></b></i><br> Mit dieser These
gehe ich nicht ganz konform. Diesen Satz hast du als ersten Grund f&uuml;r
die Abstinenz der NoCover-Schreiber herangezogen. Bisher wurde noch nie
festgestellt, wie gro&szlig; der prozentuale Anteil der
&quot;Netzangeschlossenen&quot; innerhalb der APCler-Gruppe ist, damit
meine ich den Anschluss zu Hause und nicht die Nutzung der
Internetcaf&eacute;s oder vergleichbarer Institutionen. </p>

<p>In meiner NoCover-Guide ist eine Rubrik &quot;eMail &amp;
Homepages&quot; vorhanden. Hier habe ich alle diesbez&uuml;gliche
Informationen von Usern gesammelt, die mal f&uuml;r die NoCover geschrieben
hatten und zu einem sehr kleinen Anteil es heute auch noch tun. Wenn du da
reinschaust, dann werden dir viele Namen begegnen, die schon lange nicht
mehr aktiv und h&ouml;chstwahrscheinlich auch kein Clubmitglied mehr sind.
Und nun rechne mal hoch auf die tats&auml;chliche Anzahl von
Clubmitglieder. Damit meine ich aber keinesfalls die sogenannte
Mitgliederliste in der NoCover. Die ist doch so veraltet wie ein Mercedes
170D im heutigen Stra&szlig;enverkehr. </p>

<p>Um auf das Surfen zur&uuml;ckzukommen sollte wirklich mal festgestellt
werden, wieviele der sogenannten jungen Leute einen eigenen
(selbstbezahlten) Anschluss haben und auch das n&ouml;tige Geld ausgeben.
Dieser Kreis surft nicht, sondern h&auml;lt sich vermehrt in Chatrooms auf.
Reine Surfer finden eine ganze Menge interessanter Seiten und erz&auml;hlen
dann auch gerne dar&uuml;ber - im Mailingverkehr. Und dieser Anteil ist
leider sehr klein. Wenn dieser Anteil etwas gr&ouml;&szlig;er w&auml;re,
dann w&auml;ren bestimmt schon mehrere Artikel erschien, um dar&uuml;ber zu
berichten. </p>

<p>Einen Minuspunkt, den ich vollkommen akzeptiere, ist <font
color="#008000"> <i><b> da&szlig; die Erstellung einer HTML-Seite vielen
jungen Leuten einfach keinen Spa&szlig; macht,.......... </font></b></i>
Diese Aussage kann ich nur best&auml;tigen. Aber so chizophren wie es
klingt, diese User haben keinen Netzanschluss oder wenn doch, dann nur
Testversionen von Miami und Voyager. Aber dazu m&ouml;chte ich mich nicht
weiter auslassen. </p>

<p><font color="#008000"><i><b> Jetzt kommt noch hinzu, da&szlig; die NC
nur einmal im Monat erscheint und der Feedback erst in der
&uuml;bern&auml;chsten NC erscheint. </font></b></i><br> Das ist allen
bekannt und ich glaube auch, dass sich jeder danach richtet. Nimm doch nur
mal diesen Leserbrief. Heute schreiben wir den 06.M&auml;rz und es dauert
nun vier Wochen, bis du diese Zeilen liest. Und solltest du gewillt sein
hierauf in der NC zu antworten, dann lese ich deine Zeilen am 04. Mai.
W&auml;re dieser Brief nun f&uuml;r dich ganz alleine bestimmt, dann
h&auml;ttest du noch heute (06.M&auml;rz) die Mail auf deinem Rechner
vorliegen. Und in der NoCover w&auml;re wieder ein Loch mehr vorhanden.
Aber so bist du zwar der Angesprochene, die Zeilen sind aber an alle
gerichtet. Und das ist der Casus knacktus. Viele glauben einfach, sie
h&auml;tten nichts f&uuml;r die Allgemeinheit zu sagen, weil sich eh keiner
daf&uuml;r interessiert. Und so fehlen halt die Beitr&auml;ge. Ist leider
eine Fehleinsch&auml;tzung, aber das wissen die meisten halt leider nicht
oder wollen es nicht sehen. Vielleicht annimiert irgend jemanden mein
Beitrag &uuml;ber den Heiligen Isidor. F&uuml;r die NC-84 war es leider ein
Tag zu sp&auml;t, als ich die Information erhielt. So m&uuml;ssen nun alle
Leser auch wie du vier lange Wochen warten, bis sie die WolfINFO lesen und
vielleicht ist es dann sowieso nicht mehr aktuell, weil zwischenzeitig viel
geschrieben wird, was ich aber eher nicht glaube. </p>

<p>Es tut mir leid, dass ich dir bei dem Funny Javascript nicht helfen
konnte, hier hast du mal etwas ganz anderes. Wenn du z.B. in einem
Formblatt deine Computer-Daten eingeben willst und m&ouml;chtest aber
vorher sehen, was &uuml;berhaupt &uuml;bernommen wird. Das Script steht auf
dieser Seite vor &lt;/head&gt;


<p>Du tr&auml;gst deinen Namen ein und klickst auf den Test-Button. </p>

<form name="Feedback">
<p>Dein Name: <input name="UserName">
<input type=hidden name="UserBrowser" value="">
<input type=button value="Testen" onClick="Test()"></p>
</form>
<script language="JavaScript">
 document.Feedback.UserBrowser.value = navigator.userAgent;
</script>

Na wie gef&auml;llt dir dies?


<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a4">Gr&uuml;&szlig; dich Sascha!</h3>

<p>Endlich habe ich mal ein Thema getroffen, das Resonanz abwarf. Ganz
ehrlich, manchmal war ich schon am Verzweifeln und redete mir schon ein, an
den Interessenlagen der Leser vorbeizuschreiben. Diesmal
&auml;u&szlig;erten sich sogar zwei, n&auml;mlich du mit deinem Artikel
Frust2 und Rolf Nue aus Wue mit seinem Leserbrief. Zus&auml;tzlich erhielt
ich zwei Mails: &quot;Auch du wirst den Griffel bald in die Ecke
schmei&szlig;en&quot; und &quot;Um Gottes Willen h&ouml;re blo&szlig; nicht
auf zu schreiben&quot;. Wie du siehst zwei Extreme. </p>

<p>Und wenn man deinen Text liest, da schreit der Frust auch ganz
sch&ouml;n heraus. Du hast ja Recht, nur in punkto Treffen k&ouml;nnen wir
etwas Au&szlig;enstehende nur dann unseren Senf dazugeben, wenn eurerseits
mehr Details bekannt gegeben werden. Z.B. der neue Ort, da der bisherige
wohl entfallen ist. Bleiben wir in Vellmar oder kommt ihr auf das Angebot
von Annemie zur&uuml;ck, in Wiebaden oder Umgebung etwas zu suchen? Vor
zwei Jahren hatte der Betreiber des B&uuml;rgerhauses Obervellmar indirekt
angeboten, zu ihm zu kommen. Vielleicht fasst ihr dieses wieder ins Auge.
</p>

<p>Artikel &uuml;ber Hardware werden gelesen, von den meisten aber erst
einmal beiseite gelegt, da die wenigsten mit Umr&uuml;stgedanken schwanger
gehen. Aber wenn es einmal doch soweit sein sollte, dann wei&szlig; man ja
wo man nachlesen kann. Wenigstens mir geht es so. Sieh mal, dann
m&uuml;sste ich auch traurig sein, weil meine Javascript Spielereien fast
&uuml;berhaupt nicht gew&uuml;rdigt wurden. Kilian hat es im Nebensatz
erw&auml;hnt und Rolf hat es wohl auch festgestellt. Dabei wollte ich nur
Henning Schlautmann dazu annimieren, seine Workshop Reihe wieder
aufzunehmen. Wahrscheinlich vergebliche Liebesm&uuml;he. Aber ganz ehrlich,
ich habe nirgendwo nur ein Wort gelesen, dass der Workshop fehlt oder gar
vermisst wird. Nat&uuml;rlich merken alle User mit Voyager 2.95
&uuml;berhaupt nicht, dass es soetwas wie Javascript gibt. Und die
Interpretation von IBrowse 2.2 und AWeb 3.3 ist teilweise ganz verschieden.
Man muss n&auml;mlich wissen, dass Netscape und Explorer zwei verschiedene
Wege gegangen sind und jeder noch an seiner Methode festh&auml;lt. IBrowse
tendiert zu Netscape und AWeb zum Explorer. Es dauert aber nicht mehr lange
und beide Kontrahenten einigen sich auf eine Marschrichtung. Nur wenn die
Amigabrowser nicht modernisiert werden, nutzt uns das alles herzlich wenig.
</p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<hr size=4></p>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<
<br>
</body>
</html>
