<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat noch etwas im Netz gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000" vlink="#0000ff"
bgcolor="#808080">
<br>
<p align=center><font color="#000080" size="7"><b> Kaffeeklatsch </b></font></p>
<table width=100% border=0 cellpadding=8>
<tr><td>

<p>Mein heutiges Thema ist der Kaffee, richtiger gesagt der Espresso und
der Cappuccino. In diesem Zusammenhang habe ich mir f&uuml;nf Adressen angeschaut
und m&ouml;chte nun davon zwei Adressen vorstellen. </p>
<p><img src="onl_kaffee1.gif" width=320  heigth=240  alt="auf 40% verkleinert" hspace=6
align=left><b>www.ilcaffe.de</b><br>
<font size=+1 color="#FF8000"><b>Es sind die kleinen Dinge...</b></font><br>
im Leben, die einem die größte Freude machen. Das Erlebnis beginnt mit den
verwöhnenden Duft der aromatischen Espressobohnen beim Zermahlen in der
Mühle. Unter der chrom-glänzenden, Espressomaschine füllt sich die kleine,
warme Tasse mit dem cremigen, wohlriechenden Caffè. Das ganze wird von
einer haselnussbraunen, marmorierten "Crema" bedeckt.</p>

<p>Schon beim ersten Schluck entfaltet sich das wohltuende Aroma; ein fein
bitterer, süß-sündiger, körperreicher Tropfen.<br clear=all>
- Espresso, der Kaffee in seiner Vollendung. <br>
- Frisch zubereitet für höchste Ansprüche.<br> 
- Inbegriff der italienischen Vitalität und Lebenskunst. <br>
- Jeden Tag. </p>

<p><font size=+1 color="#ff8000"><b>Warum Espresso so gut schmeckt wie er duftet.</b></font><br>
Viele glauben, Espresso sei einfach starker Kaffee, doch es handelt sich um
eine komplexe Flüssigkeit, die zugleich Lösung, Emulsion und Suspension
ist. <br><br>Espresso wird Tasse für Tasse zubereitet, wobei schnell,
heißes Wasser unter hohem Druck durch die fein gemahlenen,
dunkel-gerösteten Bohnen gepresst wird. Durch den hohen Druck werden bis zu
10% der im Kaffee enthaltenen Öle emulgiert, die für den "samtigen"
Geschmack und "Körper" verantwortlich sind. Zugleich hemmen sie unsere
Geschmacksrezeptoren für die Bitterkeit. So schmeckt der Espresso trotz
seines starken Aromas nicht zu bitter. </p>

<p>Das ist doch schön gesagt. Auf der Startseite (siehe oben) verzweigt man auf
folgende Seiten:
<table width="390" cellspacing="2" cellpadding="2">
<tr><td><a href="espresso.html">Il Caff&egrave; - Die Welt des Espressos...</a></td></tr>
<tr><td><a href="forum.html" target=_parent>Das Espresso Forum - Colloquio...</a></td></tr>
<tr><td><a href="e_gesch.html">Storia - Geschichte der Espresso Maschine...</a></td></tr>
<tr><td><a href="e_museum.html">Storia - Das Museum...</a></td></tr>
<tr><td><a href="e_zub.html">Preparazione - Die Zubereitung, Aufsch&auml;umen...</a></td></tr>
<tr><td><a href="e_variationen.html">Variazioni - Rezepte...</a></td></tr>
<tr><td><a href="ccc.html">Cup Collectors Club - F&uuml;r Tassensammler... </a></td></tr>
</table>
<br>
Sehr interessant sind die beiden Seiten "Geschichte der Espresso Maschine" und "Das Museum".
Trotzdem sollte man die anderen Seiten nicht vergessen. Alle Seiten sind informativ
und mit reichlich Bildmaterial bestückt. <hr></p>

<p><img src="onl_kaffee2.gif" width=320  heigth=240  alt="auf 40% verkleinert" hspace=6
align=left><b>www.bazzar.de</b><br>
<b><font size="3" color="#663300">Sch&ouml;n, da&szlig; Sie Zeit f&uuml;r
eine Caff&egrave;pause gefunden haben.</font></b> </p>

<p>In unserem Online-Angebot
finden Sie alles, was das Espressionistenherz begehrt: <br>
Unter <font color="#663300"><b>PRODUKTE</b> </font>erfahren Sie ausf&uuml;hrlich,
welche Modelle bzw. Sorten es gibt und was eine gute 
Maschine bzw. einen guten Caff&egrave; ausmacht. </p>

<p>Danach k&ouml;nnen Sie in unserem neuen <font color="#663300"><b>SHOP</b></font>
diese Produkte bequem online bestellen und sich nach 
Hause liefern lassen. Dort sind auch alle Informationen 
&uuml;ber die verschiedenen Produkte noch einmal aufgef&uuml;hrt.</p>

<p>Unter <font color="#663300"><b>INFORMATIONEN</b> <font
color="#000000">haben wir f&uuml;r Sie unter der Rubrik <font
color="#663300"><b>ARABICA oder ROBUSTA</b></font> Wissenswertes &uuml;ber
die Kaffeepflanze und die Vorz&uuml;ge des Espressocaff&egrave;s
zusammengetragen. </p>

<p>Unser Angebot wird st&auml;ndig aktualisiert und erweitert - &Ouml;fter
Vorbeischauen lohnt sich also. </p>

<p><b>Viel Spa&szlig; beim Caff&egrave;trinken w&uuml;nscht<br>
Ihr BAZZAR CAFF&Egrave; - Team D&uuml;sseldorf.</b><hr size=4></p>

<p>Also schauen wir einfach mal auf der Seite <font color="#663300"><b>
ARABICA oder ROBUSTA</b></font> nach. </p>
<p align=center><img src="onl_kaffee2a.jpg" width=261 heigt=105></p>

<p><font size="5" color="#663300">H</font>ier erfahren Sie alles, was Sie
schon immer &uuml;ber Kaffee wissen wollten: von der Kaffeepflanze,
&uuml;ber die verschiedenen Sorten Arabica und Robusta, bis hin zu den
Besonderheiten des Espressokaffees. </p>

<p>Koffein- sch&auml;dlich oder nicht? Hier erfahren Sie die Fakten. </p>

<p>Damit aus dem wertvollen Rohstoff Kaffee ein richtig guter
Espressokaffee wird, bedarf es langj&auml;hriger Erfahrung, K&ouml;nnen und
Liebe zum Kaffee. </p>

<p>Unter der Rubrik &quot;Espressocaff&egrave;s&quot;
erhalten Sie eine genaue Beschreibung der einzelnen Caff&egrave;s in unserem
Angebot.</p>

<p>In unserem Shop k&ouml;nnen Sie bequem bestellen, und sich Ihren
Lieblingskaffee nach Hause liefern lassen. </p>
    
<p><img src="onl_kaffee2b.jpg" width="250" height="366" align="left" hspace=6>
<b><font color="#663300">DIE KAFFEEPFLANZE</font></b><br>
Der Kaffeestrauch geh&ouml;rt zur Familie der Rubiacee - Pflanzen, genauer
zu denen der Coffea. Hiervon gibt es Dutzende von Arten, doch nur zwei
haben in wirtschaftlicher Hinsicht an Bedeutung gewonnen: die Coffea
arabica und die Coffea canephora, die in Plantagen angebaut werden. Von
diesen zwei gibt es wiederum verschiedene Sorten, die einerseits durch
nat&uuml;rliche und andererseits durch genetische Entwicklungen entstanden
sind. </p>

<p>Die Kaffeepflanze besteht aus einem oder mehreren St&auml;mmen, aus
denen die gr&ouml;&szlig;eren &Auml;ste und aus diesen wiederum die
kleineren &Auml;ste wachsen: Nur die kleinen &Auml;ste k&ouml;nnen im Falle
von Besch&auml;digungen nachwachsen. Eine wild aufwachsende Pflanze kann
eine H&ouml;he von 8 - 10 Metern erreichen, w&auml;hrend sie in den
Plantagen auf 2 - 2,5 Metern gehalten wird; auf diese Weise werden Pflege
und Ernte erleichtert. <br clear=all></p>
      
<p><img src="onl_kaffee2c.jpg" width="200" height="252" hspace=6 align=right>
<font color="#663300" size="5">D</font>ie Bl&auml;tter wachsen gepaart
einander gegen&uuml;ber, sind 10 - 15 cm lang, oval oder lanzenf&ouml;rmig.
Sie haben eine tiefdunkelgr&uuml;ne Farbe, ihre Oberfl&auml;che ist
gl&auml;nzend und fleischig; mit ihrem leicht gewelltem Rand &auml;hneln
sie einem Lorbeerblatt. Die wei&szlig;en Bl&uuml;ten wachsen je zwei bis
drei in einem B&uuml;schel; bei voller Bl&uuml;te erreichen sie einen
Durchmesser von etwa zwei Zentimetern. Sie verbl&uuml;hen in wenigen Tagen,
doch w&auml;hrend der Bl&uuml;te verbreiten sie einen intensiven,
angenehmen Duft: ein wahres Fest f&uuml;r die Nektar suchenden Insekten.
Die Best&auml;ubung ist nur bei der Coffea canephora erforderlich,
w&auml;hrend sich die Bl&uuml;ten der Coffea arabica selbst befruchten.
<br clear=all></p>

<p><img src="onl_kaffee2d.jpg" width="177" height="200" hspce=6 align=left>
<b><font color="#663300">DIE SORTEN ARABICA UND ROBUSTA</font></b></p>
      
<p>Die zwei Sorten Coffea arabica und Coffea canephora, die in
wirtschaftlicher Hinsicht eine gro&szlig;e Bedeutung erreicht haben, werden
gew&ouml;hnlich als Arabica <font color="#663300">(2)</font> und Robusta
<font color="#663300">(1)</font> bezeichnet. Auf Weltebene werden
vorwiegend diese Sorten angebaut, seltener zwei weitere, die Coffea
liberica und Coffea excelsa. Dreiviertel der Weltproduktion wird von der
Arabica bestritten. Auch wenn sich die Bohnen dieser Zwei Kaffeesorten sehr
&auml;hnlich sind, sind die Unterschiede zwischen den beiden Pflanzen und
deren Samen erheblich, angefangen von den genetischen: Die Arabica besitzt
44 Chromosomen und die Robusta nur die H&auml;lfte davon. Auch die Pflanzen
unterscheiden sich leicht in Form und Farbe der Bl&auml;tter und
Fr&uuml;chte, vor allem aber in der H&ouml;he der Str&auml;ucher, wenn sie
nicht gestutzt werden: die Arabica erreicht 6 - 8 Meter, die Robusta 8 -
10. <br clear=all></p>

<p><img src="onl_kaffee2e.jpg" width="266" height="181" hspace=6 align=right>
<font size="5" color="#663300">E</font>ine Tasse Espresso, die mit Arabica
Sorten zubereitet wurde <font color="#663300">(1)</font>, weist eine
haselnu&szlig;braune Crema mit r&ouml;tlichen Schattierungen auf. Das
Ergebnis aus Bohnen von Robusta- Caff&egrave; <font
color="#663300">(2)</font> unterscheidet sich davon betr&auml;chtlich: die
Crema ist dunkler, braun mit gr&auml;ulichen Reflexen, sie ist dicker und
hat gr&ouml;&szlig;ere Bl&auml;schen, l&ouml;st sich aber schneller auf.
Neben den Tassen sehen Sie eine gr&uuml;ne und eine ger&ouml;stete Bohne
beider Arten. <br clear=all></p>

<p><font size="5" color="#663300">D</font>ie Kaffeearten lassen sich
nochmals in drei Gruppen unterteilen: nat&uuml;rlicher Arabica, gewaschener
Arabica und Robusta-Caff&egrave;. Robusta-Caff&egrave; hat au&szlig;er dem
niedrigen Preis einen weiteren Vorzug: er gibt dem Espresso viel
K&ouml;rper. Dieser Vorteil wird jedoch durch zahlreiche Nachteile zunichte
gemacht, wie h&ouml;herer Koffeingehalt, st&auml;rkerer Bittergeschmack,
oftmals adstringierende Wirkung und Mangel an Aromen (meist holzartig und
erdig), soda&szlig; von seiner Verwendung abgeraten wird. </p>

<p><font color="#663300" size="5">D</font>ie ideale Mischung besteht
deshalb aus nat&uuml;rlichen und gewaschenen Arabica Sorten. Erstere haben
einen ausgeglichenen Geschmack und ein mittelstarkes, weitgef&auml;chertes
Aroma. Die gewaschenen Sorten hingegen sind im allgemeinen weniger bitter
und enthalten mehr S&auml;ure, sie haben ein sehr intensives, weniger breit
gef&auml;chertes Aroma und ein blumiges, fruchtiges Bukett, das manchmal
angenehm an den Geschmack von getoastetem Brot erinnert.</p>

<p><b><font color="#663300">DAS KOFFEIN</font></b> <br>
Koffein ist ein in
der Kaffeebohne enthaltenes Alkaloid, das anregend auf das zentrale Nervensystem
wirkt; in der richtigen Dosierung sorgt es f&uuml;r die Freisetzung von
Adrenalin und steigert damit die Herzt&auml;tigkeit. Es herrscht die gel&auml;ufige
Meinung, da&szlig; der cremige, dickfl&uuml;ssige, aromareiche Espresso
einen h&ouml;heren Koffeingehalt besitzt als etwa Filterkaffee, aber das
Gegenteil ist der Fall. </p>

<p>Denn der Kaffee von der Arabicapflanze hat einen Koffeingehalt von 0,9%
bis 1,5%, also deutlich unter dem Koffeinwert von Robustakaffee, der
zwischen 2% und 3,5% schwankt. </p>

<p><b><font color="#663300">Daraus folgt eindeutig, da&szlig; ein Espresso,
der mit billigen, minderwertigen Robustamischungen hergestellt wird, nicht
gesundheitsf&ouml;rdernd ist, da der hohe Koffeingehalt vom menschlichen
K&ouml;rper nicht assimiliert wird. <br><br>

Man darf daraus schlie&szlig;en, da&szlig; Koffein in der richtigen
Dosierung f&uuml;r die Gesundheit des Menschen, f&uuml;r seine
intellektuellen und auch sexuellen Bed&uuml;rfnisse gut ist und auch seinen
Organismus sch&uuml;tzt.</b></font></p>

<p>Und hier sei ein f&uuml;r alle mal festgestellt, da&szlig; die
vern&uuml;nftige H&ouml;chstgrenze bei 5 - 6 T&auml;&szlig;chen pro Tag
liegt, wenn gute Kaffeemischungen verwendet werden (etwa reine Arabica);
etwas weniger, wenn der mit preisg&uuml;nstigeren Mischungen zubereitete
Kaffee zu Hause oder in Bars getrunken wird, die minderwertige
Qualit&auml;ten verwenden. </p>

<p>An dieser Stelle sollte auch mit einem anderen weitverbreiteten Irrtum
aufger&auml;umt werden: die Leute sind allgemein davon &uuml;berzeugt,
da&szlig;, wenn sie einen st&auml;rker verd&uuml;nnten Kaffee (sog. Caffe
alto) trinken, dieser weniger gesundheitssch&auml;dlich ist. Das ist
keineswegs der Fall, weil die gr&ouml;&szlig;ere Wassermenge, die auf den
gemahlenen Caff&egrave; reagiert, dem Getr&auml;nk eine gr&ouml;&szlig;ere
Menge Gerbs&auml;ure &uuml;bertr&auml;gt, die im Holzanteil des Kaffeemehls
enthalten ist. Richtig w&uuml;rde man es so machen: Ein Espresso mit Zugabe
einer beliebigen Menge hei&szlig;en Wasser. </p>

<p><b><font color="#663300">DER ESPRESSO</font></b><br>
Neben Wein, vielleicht aber noch viel mehr als der Wein, gilt der Espresso
als das typischste italienische Getr&auml;nk, obgleich die Erfindung der
Maschine, mit der diese K&ouml;stlichkeit gebraut wird, noch nicht weit
zur&uuml;ck liegt. 1903 patentierte ein Ingenieur namens Bezzera die erste
Maschine f&uuml;r Espressokaffee, der bald viele Generationen folgen
sollten. Die Notwendigkeit, f&uuml;r den verw&ouml;hnten Gaumen des Kunden
jede Tasse einzeln zuzubereiten und zu servieren, aber auch die
augenblickliche Ver&auml;nderung der organoleptischen Eigenschaften von
nicht sofort getrunkenem Kaffee waren der Grund f&uuml;r diese neue
Zubereitungsart, die eine schnelle Ausgabe der jeweils erforderlichen
Anzahl Tassen erlaubte. Diese Vitaminspritze f&uuml;r den Geist, diesen
energiespendenden Nektar, dieses belebende Konzentrat, dieses
dickfl&uuml;ssige, cremine Meisterwerk und Kondensat von Aromastoffen, das
die Bezeichnung Espresso all' Italiana tr&auml;gt, erh&auml;lt man nur mit
einer qualitativ hervorragenden Kaffemischung, mit leistungsf&auml;higen
Maschinen sowie mit der Sorgfalt eines qualifizierten Bedieners. Immer
h&auml;ufiger ist man heute auf der Suche nach einer Bar, in der man einen
anst&auml;ndigen Kaffee serviert bekommt, meist mit wenig Erfolg. </p>

<p><font face="Arial, Helvetica, sans-serif" size="2">Dies ist sicher auch
ein Grund, weshalb viele Verbraucher inzwischen auf den Kaffee in der Bar
verzichten. Viele Familien haben sich kleine Kaffeemaschinen angeschafft
und machen sich ihren Espresso zuhause selbst, oft mit besserem Ergebnis
und zu niedrigen Kosten.</font></p>

<p>Um einen guten, konzentrierten, cremigen Kaffee zu bereiten, der auch
das Auge anspricht, einen Kaffee, der neue Freunde gewinnt und alte Kenner
wieder an die Bar lockt, mu&szlig; die Kaffeebereitung unter Bedingungen
erfolgen, bei denen ein optimales Gleichgewicht zwischen drei grundlegenden
variablen Faktoren besteht: </p>

<p>Kaffeemischung, Technische Ger&auml;te (Maschine und
M&uuml;hle/Dosisvorrichtung), Bedienung der Maschine.</p>

<p>Das BAZZAR CAFF&Egrave; hat sich den Bed&uuml;rfnissen anspruchsvoller
Kaffeegourmets verschrieben. </p>

<p>Das Wissen um erstklassige Espressozubereitung zu demonstrieren und
weiterzugeben ist das Ziel. <hr size=4></p>

<p>Wer nun auf den Geschmack gekommen ist und weitere Seiten kennenlernen
m&ouml;chte, sollte sich auch folgende Seiten anschauen:</p>

<p><b>"www.tuttocaffe.de"</b>, eine sch&ouml;ne Site über ialienischen Kaffee
und Kaffeeautomaten. </p>

<p><b>"www.raven.to/kaffee"</b>, Infos vom Strauch bis zur Tasse. </p>

<p><b>"www.netzkaffee.de"</b>, eine virtuelle Kaffeemaschine. </p>
    
</td></tr>
</table>

<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
</center>
<br>
</body>
</html>
