<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
    <HEAD>
        <TITLE>AmiOS, die richtige WB</TITLE>
        <META NAME="generator" CONTENT="MetalWEB Designer 4.0 Prerelease 2, Multitaskers ©1997-1999">
    </HEAD>
    <BODY BGCOLOR=#009600 TEXT=#000000 VLINK=#CC0000 LINK=#0000CC ALINK=#FFFF00>
        <FORM ACTION="" METHOD="GET">
            <P><B><FONT SIZE="+4"><FONT SIZE="+4"><FONT SIZE="+2"><FONT SIZE="+2">  Heute m&ouml;chte ich mal ein sch&ouml;nes Tool vorstellen, welches  sich momentan noch in der Betatestphase befindet, aber f&uuml;r alle  Interessant sein k&ouml;nnte. Es heisst "AmiOS".</FONT></FONT></FONT>  </FONT> </B> <BR>
            Wie der Name schon sagt, handelt es sich um ein Betriebssystemtool,  welches unsere Workbench verbessert, wenn nicht gar ein neues OS ist  , aber dazu sp&auml;ter. <BR>
            <BR>
            <B>Erstmal zu den technischen Daten: </B> <BR>
            Getestete Version: 0.58 Beta <BR>
            Gr&ouml;sse: Komplette volle Betaversion ca. 250 MB auf CD-ROM <BR>
            Autor: Jakob Amidog <BR>
            Status: Shareware (vorraussichtliche Sharewaregeb&uuml;hr 65 DM) <BR>
            <BR>
            Als ich als erstes von den Tool geh&ouml;rt habe, war ich erst skept  isch: "Ein Sharewarebetriebssystemersatz f&uuml;r fast alle Amiga&acute;  s?!" Das wollte ich genauer wissen und habe mich als Betatester bewo  rden. <BR>
            <BR>
            Nach einigen Tagen bekam ich ein kleines P&auml;ckchen mit einen kle  inen Rohling. Kaum war der Rohling im CD-Romlaufwerk verschwunden be  gr&uuml;sste mich ein ganz sch&ouml;nes Icon der CD. <BR>
            Ein Doppelklick sp&auml;ter &ouml;ffnete sich ein Fenster mit mehrer  en Anleitungen. <BR>
            <BR>
            Als ich einige Stunden sp&auml;ter alles gelesen hatte, machte ich m  ich ans Installieren der Software. Dies geschah sehr konfortabel via  Installer. W&auml;hrend des Installierens wurden noch einige Inform  ationen und Tips angezeigt. <BR>
            <BR>
            Ausserdem wird die Installation genau den vorhandenden System angepa  sst. <BR>
            <BR>
            Nach der etwa 10 min&uuml;tigen Installation musste der Recher neu g  estartet werden. Erstmal viel mir auf, dass mein System um einiges s  chneller war. Als sich die Workbench &ouml;ffnete, kam mir ein ganz  neues Design unter die Augen. Als ich mich so auf meiner Festplatte  durchklickte, vielen mir sehr viele Tools auf. Darunter einen MPEG-V  ideoprogramm, einen neuen Browser f&uuml;rs Internet mit dem es dank  Java auch m&ouml;glich ist, alle Seiten im Netz zu betrachten (chat  ten klappte auch auf anhieb!!!), einer Zugangssoftware, die mich an  DF&Uuml;-Netzwerk von Windoof erinnert und diversen anderen Tools. <BR>
            <BR>
            Meine ganze alte Software lief Problemlos weiter, ich musste bei ein  igen Programmen nur einstellen, dass sie anders gestartet werden und  nicht &uuml;ber die WB, aber dies will der Autor auch noch &auml;nd  ern. <BR>
            <BR>
            Leider darf ich in diesen Test nicht so genau ins Detail gehen, dies  werde ich aber dann nachholen, wenn dieses Programm f&uuml;r alle z  ug&auml;nglich ist. <BR>
            <BR>
            Aber hier hab ich erstmal einen Screenshot von mir: <BR>
            <IMG SRC="amios.jpg" ALT="AmiOS, so siehts aus!" BORDER="0"><BR>
            <BR>
            Bei der Leistung des Tools scheint es ja klar zu sein, dass hier kei  n Steinzeit A500 reicht um es zum laufen zu bringen. <BR>
            Man braucht mindestens einen 68010 Prozessor, ein neueres Betriebssy  stem (min. Amiga OS 1.3), 1 MB RAM (um die Tools zu benutzen sollten  es schon etwas mehr sein, um die 3 MB), 6 MB Festplattenspeicher (w  enn die Tools mit installiert werden 20 MB). Ausserdem sind noch div  erse Hintergr&uuml;nde auf der CD enthalten, aber um die vern&uuml;n  ftig darstellen zu k&ouml;nnen, muss man wenigstens des ECS-Grafikch  ip sein eigen nennen. <BR>
            (Hier m&ouml;chte ich nochmal erw&auml;hnen, dass MPEG-Files nahezu  ruckelfrei auf meinen 030 Prozessor ausgegeben wurde.) <BR>
            <BR>
            <B>Nachtrag:</B><BR>
            Jetzt gibt es auch offizielle Infos &uuml;ber den Programm auf der Entwicklerhomepage:<BR>
            <A HREF="http://www.fortunecity.de/wolkenkratzer/future/351/amios.html">(http:&#47;&#47;www.fortuncity.de&#47;wolkenkratzer&#47;future&#47;351&#47;amios.html)</A> <BR>
            <BR>
            Soviel erstmal von mir, ein richtiger Testbericht folgt! <BR>
            <BR>
            <A HREF="mailto:RStell@web.de">Ren&eacute; "TheButcher" Stelljes </A><BR>
            </P>
        </FORM>
    </BODY>
</HTML>
