<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
    <HEAD>
        <TITLE>Emulatoren auf den Amiga</TITLE>
        <META NAME="generator" CONTENT="MetalWEB Designer 4.0 Prerelease 2, Multitaskers ©1997-1999">
    </HEAD>
    <BODY BGCOLOR=#000000 TEXT=#7BDC00 VLINK=#CC0000 LINK=#0000CC ALINK=#FFFF00>
        <FORM ACTION="" METHOD="GET">
            <H1 align=center><B><FONT SIZE="+3"><FONT COLOR=#0000FF><B><I><BIG>Butcher&acute;s Emu-Workshop Teil1</I></B></BIG></FONT></FONT> </H1>
            <BR>
            Wer kennt es nicht? Man sieht bei einen Freund irgentein neues Programm f&uuml;r den MAC oder den PC und man &auml;rgert sich mal wieder, dass es sowas nicht auf den Amiga gibt... <BR>
            Aber dieses Problem ist nicht l&auml;nger ein Problem, denn der Amiga hat genug Emulatoren, um Software f&uuml;r andere Rechnersysteme zum laufen zu bringen... <BR>
            <BR>
            <FONT SIZE="+2"><FONT SIZE="+2"><U><B>Heute:</B> Der IBM-kompatible PC (&uuml;ber PCx) </U></FONT></FONT> <BR>
            <BR>
            <B>Zu PCx:</B> <BR>
            PCx ist ein kommernzieller Emulator, der im Bundle mit Fusion ausgeliefert wird. Der Verkaufspreis liegt um die 89 DM. Er kann einen Pentium 1 mit 90 Megahertz emulieren. <BR>
            <BR>
            <B>Was man braucht:</B> <BR>
            - den Emulator PCx <BR>
            - einen Amiga mit mindestens einen 68020 CPU <BR>
            - AmigaOS 2.04 oder h&ouml;her <BR>
            - Mindestens 3 MB Fast-Ram (ab 6 MB l&auml;uft Windows) <BR>
            - 3 MB Platz auf der Festplatte f&uuml;r die Software, sowie Platz f&uuml;r ein Hardfile bzw. eine eigene Partition der Festplatte <BR>
            - Ein Betriebssystem f&uuml;r 80x86 CPU&acute;s auf Diskette (ich empfehle MS-DOS 6.2(2) und Windows 3.1) <BR>
            <BR>
            Leider l&auml;uft Windows for Workgroups, OS&#47;2 und Windows NT sowie Novell nicht &uuml;ber den Emulator. <BR>
            <BR>
            <B>Worauf es getestet wurde: </B> <BR>
            - Emulator PCx <BR>
            - Amiga 1200 mit Winner 1240&#47;40 <BR>
            - AmigaOS 3.9 <BR>
            - 64 MB Fast-Ram <BR>
            - Genug Platz auf der Festplatte sowie 500 MB Partition und 100 MB Hardfile <BR>
            - MS-DOS 6.2 und Windows 3.1 <BR>
            <BR>
            <B>Zur Installation von PCx: <BR>
            </B>Die Installation erfolgt bequem via Installer. <BR>
            <BR>
            <B>Zur Configuration von PCx: <BR>
            </B> Als erstes muss PCx gestartet werden. Danach erscheint ein Fenster (siehe Screenshot). Als erstes muss man den PC Arbeitspeicher zur verf&uuml;gung stellen. Ich gebe ihn einfach mal das Maximum von 16 MB. </P>
            <P align=center><IMG SRC="PCx1.gif" ALT="PCx Config 1" BORDER="0"></P>
            <P>Danach klicke ich auf Configure Option und lande in einem Men&uuml;, welchen Video heisst. In diesem Men&uuml; gibt man an, worauf die Grafik des PC&acute;s dargestellt werden soll. Ich stelle einfach mal auf VGA_AGA. </P>
            <P align=center><IMG SRC="PCX2.gif" ALT="PCx Config 2" BORDER="0"></P>
            <P>Ein weiterer Klick auf Configure Option bringt uns in einem Men&uuml;, welches sich Floppy schimpft. Hier k&ouml;nnen 2 Diskettenlaufwerke angew&auml;hlt werden. Ich nehme einfach mal DF1, da dies mein HD-Diskettenlaufwerk ist, welches ich in der PC-Emulation als sehr n&uuml;tzlich erweisst, da es kaum DD-Disketten im PC-Bereich gibt. </P>
            <P align=center><IMG SRC="PCX3.gif" ALT="PCx Config 3" BORDER="0"></P>
            <P>Der n&auml;chste Klick auf Configure Option bringt mich ins Men&uuml; Devices. Hier kann die Festplattenpartition bzw. das Hardfile angew&auml;hlt werden, was man auch machen sollte, da der PC so gut wie nichts ohne Festplatte machen kann. Meine Festplattenpartition heisst IDH1. </P>
            <P align=center><IMG SRC="PCX4.gif" ALT="PCX Config 4" BORDER="0"></P>
            <P>Ports heisst das n&auml;chste Men&uuml;, welches man durch einen kurzen Klick auf Configure Options &auml;ndern kann. Hier sollten die Adressen f&uuml;r die COM und LPT-Schnittstellen eingetragen werden. dies ist in Prinzip ganz einfach, da es von Anfang an schon eingestellt ist. Ich musste nur das Silversurfer.device einstellen, welches aber ganz einfach von statten geht. </P>
            <P align=center><IMG SRC="PCX5.gif" ALT="PCx Config 5" BORDER="0"></P>
            <P>Ein n&auml;chster Klick auf Configure Option bringt mich ins Men&uuml; BIOS. Hier kann man die BIOS-Datei ausw&auml;hlen, falls man eine andere Besitzt. Ich nehme den Standart PCxBIOS. </P>
            <P align=center><IMG SRC="PCX6.gif" ALT="PCx Config 6" BORDER="0"></P>
            <P>Jetzt musste ich wieder auf Configure Option klicken, um ins Men&uuml; Sound zu kommen. Ich gebe ihn in alles ausw&auml;hlbare die volle Power ;) </P>
            <P align=center><IMG SRC="PCX7.gif" ALT="PCx Config 7" BORDER="0"></P>
            <P>Weiter geht es, wenn man wieder auf Configure Option klickt. Dann kommt man ins Men&uuml; Peripherals, wo man die Joystick und die Mouse Emulation einstellen sollte. Ich gebe ihn f&uuml;r die Maus mal die Port Mouse. </P>
            <P align=center><IMG SRC="PCX8.gif" ALT="PCx Config 8" BORDER="0"></P>
            <P>Der n&auml;chste Klick auf Configure Option bringt mich ins Men&uuml; Advanced, wo man noch einige Einstellungen f&uuml;r den Compi machen kann. Ich gebe ihn man voll Gas auf Turbo Level. </P>
            <P align=center><IMG SRC="PCX9.gif" ALT="PCX Config 9" BORDER="0"></P>
            <P>Einen Klick muss ich aber noch auf Configure Option machen, damit ich ins Men&uuml; Configuration lande. Hier kann und sollte man die Configuration speichern. Ausserdem kann man auch laden... ;) </P>
            <P align=center><IMG SRC="PCX10.gif" ALT="PCX Config 10" BORDER="0"></P>
            <BR>
            <B>Zur Installation des PC&acute;s: </B><BR>
            Nachdem PCx jetzt nun so eingestellt hat, dass es nun laufen sollte, muss man die 1. Diskette der drei MS-DOS Disketten in das angegebene Laufwerk (in meinem Fall DF1:) einlegen und auf Start Emulator klicken. Wenn alles richtig eingestellt wurde, sollte sich der Bildschirm jetzt Schwarz f&auml;rben, wenn nicht, gibt es eine Fehlermeldung. Leider ist es mir ab hier nicht mehr m&ouml;glich Screenshots abzubilden, da ab jetzt mein Screenshotprog nicht mehr arbeitet, obwohl PCx im Multitasking l&auml;uft (Ich hatte schon gleichzeitig PCx und die Demo von Payback laufen ;). <BR>
            Nachdem man den ersten Anweisngen der Installation von MS-DOS befolgt, sollte man mal gucken, ob man nicht noch etwas zum knabbern in K&uuml;hlschrank hat und wenn man sowieso schon in der K&uuml;che ist, Kaffee aufsetzen, da es lange dauert, bis MS-DOS installiert ist. <BR>
            Irgentwann wird sich der Compi mit einen piepsen melden und die n&auml;chste Diskette verlangen. Dies tuhe man und danach kann man ja mal gucken gehen, ob der Kaffee fertig ist... <BR>
            Etwas sp&auml;ter piepst der Compi nochmal und verlangt dei dritte Diskette. Falls der Kaffee noch nicht fertig war, sollte er jetzt schon fertig sein, wenn nicht, ist die Kaffeemaschiene wohl aus der Steinzeit. Irgentwann bekommt man, begleitet von einem piepsen, eine Meldung, das Man den Computer jetzt neustarten soll. Es w&auml;re Ratsam, wenn man auf Neustart klickt und nicht gleich den Affengriff benutzt, da nur die Emulation neugestartet werden muss. <BR>
            Wenn der PC wieder hochgefahren ist, und es kommt eine Fehlermeldung mit keine kompatibele Bootdisk, sollte man die Diskette aus dem Laufwerk nehmen und die "Enykel-Taste" (x-belibege Taste) dr&uuml;cken und dann sollte der PC MS-DOS von Festplatte starten. Wenn dies geschehen ist, sollte man die 1. von den 7 Windowsdisketten einlegen und den PC folgenden Befehl geben: a:setup <BR>
            Jetzt heisst es Bildschirmanweisungen folgen, warten, warten, Disketten wechseln und wieder warten... Nachdem Windows nun installiert wurde, kann man den Rechner bedienen, wie jeden PC. Allerdings sollte man beim starten von Windows (ja, windows 3.1 muss von der MS-DOS manuell gestartet werden) statt einfach nur win besser <B>win &#47;s</B> eeingeben, da es sonst zu massiven Problemen kommt... <BR>
             <BR>
            <B>Weitere Tips f&uuml;r diesen Emulator: </B><BR>
            - Diese Anleitung geht f&uuml;r den Betrieb mit der Festplatte geschrieben und nicht f&uuml;r ein Hardfile. Das Kreieren eines Hardfiles erkl&auml;rt sich in diesem Programm von selbst. In der Stelle, wo man die Festplattenpartition w&auml;hlt, muss man anstelle einer Partition das Hardfile anw&auml;hlen. <BR>
             <BR>
            - Das Betreiben mit einer Hardfile kann ich nicht empfehlen, da es zu langsam ist. Eine Festplattenpartition arbeitet in Originalgeschwindigkeit. <BR>
             <BR>
            - Es ist m&ouml;glich, ein CD-ROM Laufwerk mit PCx zu bedienen, n&auml;heres werde ich demn&auml;chst in einem Nachtrag ver&ouml;ffentlichen (habe monemtan damit selber Probleme, hat es aber schonmal am laufen...). <BR>
             <FONT SIZE="+1"></FONT><FONT SIZE="+1"></FONT><BR>
            - Wer kein HD-Diskettenlaufwerk besitzt, sollte besser die Finger von der PCx lassen, da es so gut wie keine Chance gibt, Software f&uuml;r den PC auf DD-Disketten zu bekommen. <FONT SIZE="+1"></FONT><FONT SIZE="+1"></FONT><BR>
             <FONT SIZE="+1"></FONT><FONT SIZE="+1"></FONT><BR>
             <FONT SIZE="+1"></FONT><FONT SIZE="+1"></FONT><BR>
            So, dies soll es denn schon f&uuml;r den ersten Teil gewesen sein... Ich hoffe, der ein oder anderere etwas mit den Workshop anfangen kann. In der n&auml;chsten Ausgabe werde ich wohl den Emulator Fusion vorstellen, aber mal sehen, was kommt ;) <FONT SIZE="+1"></FONT><BR>
             <FONT SIZE="+1"></FONT><FONT SIZE="+1"></FONT><BR>
            <A HREF="mailto:RStell@web.de"><I><FONT SIZE="-1"><FONT SIZE="-1"><FONT SIZE="+1"><FONT SIZE="+1">Ren&eacute; "TheButcher" Stelljes </FONT></FONT></FONT></FONT></I></A><BR>
            <BR>
            </P>
        </FORM>
    </BODY>
</HTML>
