<HTML>

<!-- Questa pagina e' stata realizzata da Riccardo Lanzidei.
Per qualsiasi informazione: lanzidei@tin.it -->

<HEAD>

<TITLE>I racconti di DADAm@g</TITLE>

</HEAD>
<BODY BACKGROUND="stuccoblu.gif" TEXT="#ffffff" LINK="#ffffff" VLINK="#ffffff" ALINK="#ffffff">

<TABLE WIDTH=560 CELLPADDING=10>
<TD>
<FONT SIZE=+0 FACE="comic sans ms">
<P ALIGN="JUSTIFY">Una volta Lu voleva entrare a tutti i costi in un cinema e non aveva in tasca neanche una lira. Cos&igrave; si mise in testa un cappello ed entr&ograve; dirigendosi direttamente in sala. L'uomo-che-strappa-i-biglietti gli si fece incontro ma Lu lo ferm&ograve; con un gesto. Poi, dopo qualche istante gli chiese: "E' gi&agrave; cominciato il film?". L'uomo-che-strappa-i-biglietti un po' indispettito rispose "da cinque minuti". Al primo sguardo gi&agrave; non avevano simpatia l'uno per l'altro, era chiaro. Ma Lu non voleva perdere neanche un altro istante del film cos&igrave; si diresse alla biglietteria. Dietro allo sportello c'era una donna grossa a cui gentilmente chiese: "un biglietto per favore". Ma prima che potesse muoversi Lu infil&ograve; la mano sotto al vetro e con grande stupore della donna afferr&ograve; i due blocchetti di biglietti. L'uomo aveva seguito tutta la scena ma non fece in tempo ad avvicinarsi che Lu gett&ograve; entrambi i blocchi appena rubati in strada. I due impiegati si gettarono sull'uscio alla ricerca dei due preziosi bottini. L'uomo-che-strappa-i-biglietti ne vide subito uno, ma non ebbe nemmeno il tempo di realizzare che si trovava sulle rotaie, perch&eacute; proprio in quel momento un tram con le sue ruote ferrate lo ridusse in due tronconi. Corse a recuperare l'altro e si precipit&ograve; in sala ma ormai era troppo tardi. Lu si era gi&agrave; dileguato nel buio e seduto in uno dei pochi posti liberi tra una giovane coppia e una ragazza sola. La bigliettaia e l'uomo-che-strappa-i-biglietti entrarono lasciando incustodito l'ingresso, ma si resero ben presto conto che non c'era alcuna possibilit&agrave; di trovare il giovane che cercavano tra quella folla. Decisero di aspettare la fine del primo tempo per una pi&ugrave; facile ricerca. Chiamarono la polizia, e cos&igrave; nell'intervallo entrarono in sala l'uomo-che-strappa-i-biglietti insieme a due loschi uomini in divisa. Nel momento i cui i tre fecero il loro ingresso Lu usc&igrave; dal bagno e riprese il suo posto. I tre controllavano tutti gli spettatori, uno ad uno, e l'uomo-che-strappa-i-biglietti continuava a fare di no con il capo. Quando furono arrivati anche alle prime file senza aver visto nessun sospetto, i poliziotti cominciarono a fare domande agli spettatori, ma non ci fu tempo per portare avanti questa procedura, perch&eacute; il film riprese e i tre dovettero uscire. Lu nel frattempo si faceva raccontare i primi cinque minuti del film dalla coppia di ragazzi che gli era seduta accanto. </P>
<P ALIGN="JUSTIFY">Appena entrato in sala si era tolto il capello e sciolto i lunghi capelli. Per sicurezza si era anche levato la giacca e tolto la barba finta. Poco prima della fine del primo tempo era andato in bagno. L&igrave; aveva estratto dal suo zaino una nuova borsa, che aveva riempito con tutti gli oggetti che avrebbero potuto metterlo in imbarazzo in un ipotetico incontro con la polizia: la giacca, il cappello, la barba e lo stesso zaino. Cosicch&eacute; quando usc&igrave; dal bagno e vide entrare i tre che lo cercavano non ebbe il minimo timore di essere riconosciuto. </P>
<P ALIGN="JUSTIFY">Alla fine del film usc&igrave; dal cinema chiacchierando insieme ai due ragazzi che aveva conosciuto nell'intervallo. I due poliziotti e l'uomo-che-strappa-i-biglietti erano sempre l&igrave; a squadrare tutti gli spettatori, uno ad uno ad uno, senza dire nulla. Un uomo che si mise un cappello fu fermato prima dell'uscita, ma prima che l'uomo-che-strappa-i-biglietti potesse farsi incontro per dare il suo dissenso era gi&agrave; scoppiata una piccola rissa tra il gruppo dell'uomo con il cappello e i due poliziotti, che evidentemente non aspettavano altro che menare un po' le mani. Dopotutto erano l&igrave; per quello.</P>
<P ALIGN="JUSTIFY">Lu e i due ragazzi si chiesero cosa stesse succedendo, poi uscirono senza una risposta. </P>
<P ALIGN="JUSTIFY">Andarono in un pub e passarono una bella serata a parlare di cinema, la vera passione dei due. Per Lu il cinema non significava molto, per&ograve; gli piaceva andare a vedere i film, e anche discuterne, cos&igrave; le ore passarono velocemente, fino a che alla fine della serata Lu dovette andare in bagno. Aspett&ograve; qualche minuto prima che si liberasse, poi finalmente entr&ograve;. Fece ancora uno scambio di borse, tir&ograve; fuori la giacca, la indoss&ograve;, tolse la lunga parrucca e usc&igrave; lasciando scoperta la testa completamente rasata.</P>
<P ALIGN="JUSTIFY">Pass&ograve; davanti ai due ragazzi, che guardavano in direzione del bagno aspettando il suo ritorno. Usc&igrave; dal pub e and&ograve; a casa. In bagno davanti allo specchio non si guardava ma solo si lavava i denti e pensava alla bella serata che aveva trascorso. Poi alz&ograve; lo sguardo e si fiss&ograve; negli occhi. Si tolse le lenti a contatto, e and&ograve; a dormire. </P>
<P ALIGN="RIGHT"></P></TD></TABLE>

</BODY>
</HTML>
