
<HTML>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Dream Theater: Metropolis Part II - Scenes From A Memory</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">


<h1><CENTER><FONT COLOR="GREEN">Dream Theater: Scenes From A Memory - Metropolis Pt.II
</FONT></H1></CENTER></P>
Jahrelang haben die Fans der Progressive Kings auf den zweiten Teil von
&quot;Metropolis&quot; (der erste Teil befindet sich auf der G&#246;ttergabe &quot;Images And
Words&quot;). Nun, hier ist er und das ganze Album stellt alles bisher
erschienene im Progressive Bereich der letzten Jahre (und Jahrzehnte) in den Schatten. Auf
der 77 min&#252;tigen CD, auf der eine tiefgr&#252;ndige &amp; absolut fesselnde
Story erz&#228;hlt wird, wird ein derma&#223;en hohes musikalisches Niveau geboten,
da&#223; selbst begnadete andere Musiker dagegen wie Anf&#228;nger aussehen. Alleine
schon der Einsteig in die CD &quot;Regression&quot; und &quot;Overture 1928&quot; zeugen von dem
hohen Niveau, das die Band auszeichnet und das die komplette CD gehalten
wird. Recht heftig f&#228;llt demenstprechend auch der erste Song mit Vocals aus:
&quot;Strange Deja Vu&quot; ist eine recht harte Nummer, die von James La Brie
hervorragend intoniert wird und den Zuh&#246;rer endg&#252;ltig in seinen Bann zieht.
Sp&#228;testens hier wird man sich von der CD nicht mehr l&#246;sen k&#246;nnen.
Auch die Keybordpassagen sind, dank des neuen Keyborders, auf einem ganz
anderen Level, als noch beim (gew&#246;hnungsbed&#252;rftigen) Vorg&#228;nger &quot;Falling Into
Infinity&quot;. Es ist somit auch nicht weiter verwunderlich, da&#223; alle
nachfolgenden Songs, insbesondere w&#228;ren da das ruhigere &quot;Through Her Eyes&quot;
und das epische &quot;Home&quot; zu nennen, &#228;hnlich aussergew&#246;hnlich ausgefallen sind
und jeden Dream Theater Fan n&#228;chtelang fesseln werden. Das alles ist aber
nur die aussergew&#246;hnliche Basis f&#252;r den mitrei&#223;enden Abschluss der CD
&quot;Finally Free&quot;: Hier nimmt die Handlung mehrere interessante &amp; schockierende
Richtungs&#228;nderrungen und das ganze wurde auch musikalisch einzigartig
umgesetzt. Mit Metal hat das ganze nat&#252;rlich immer noch was zu tun, aber
diese CD kann wirklich jedem empfohlen werden, der ein klein bi&#223;chen
Verst&#228;ndniss f&#252;r Musik hat (Prog. Fans werden &quot;Metropolis Pt.II&quot;
verschlingen). F&#252;r 30 M&#228;rker bekommt man einen Meilenstein in der
Musikgeschichte geboten und Dream Theater sind auf dem besten Wege sp&#228;ter
mal in einer Reihe mit &quot;Queen&quot;, &quot;The Beatles&quot; und &quot;Beethoven&quot; als beste
Komponisten des Jahrtausends gennant zu werden. Kauft Euch die CD noch heute
und ich verspreche Euch eines: Ihr werdet wochenlang keine andere CD in
Eurem CD Player rotieren sehen!</P>

Fazit: 15 von 10 Punkten (!!)</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov1.jpg"></P>
<img src="kit.gif"></P><CENTER>







</body>
</html>
