
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Konzertbericht</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">

<h1><CENTER><FONT COLOR="RED">Konzertbericht: Rage &amp; Nightwish &amp; Valley`s Eve (Zeche, Bochum)
</FONT></CENTER></h1></P>
Eine Band, &#252;ber die seit Monaten geredet &amp; ger&#252;chtet wird, ist Rage. Nachdem
, bis auf Gr&#252;nder Peavy Wagner, alle anderen Bandmitglieder ausgestiegen
sind (was nat&#252;rlich das &#252;bliche Gerede heraufbeschwor), musste schnell
Ersatz her. In Form von Victor Smolski (Gitarre; Mind Odysee) und Mike
Terrana (Drums; ex-Metalium, Roland Grapow Band etc.) fand Peavy Wagner auch
erstaunlich schnell Ersatz und konnte das neue Album &quot;Ghosts&quot; (Review in
dieser Ausgabe) pr&#228;sentieren, das viele Kritiker vestummen lie&#223;. Und
mitlerweile ist auch die Tour angelaufen; u.a. nat&#252;rlich mit einem Gig in
der Bochumer Zeche (praktisch ein Heimspiel f&#252;r Peavy Wagner, der ja
bekanntlich aus Herne kommt).</P>

Das das Konzert ausverkauft werden w&#252;rde, war schon im Vorfeld abzusehen und
<img src="karte.jpg" align=left>so ist es nicht verwunderlich, da&#223; der Andrang schon lange vor dem Konzert
riesig war. Das es aber so voll werden w&#252;rde, da&#223; noch nichtmal
Sicherheitsbarrieren vor der B&#252;hne aufgebaut werden konnten, h&#228;tte nichtmal
ich erwartet. Durch etwas Gl&#252;ck gelangte ich dann auch in die erste Reihe
und konnte somit den Konzertverlauf hervorragend verfolgen. Recht p&#252;nktlich
bretterten dann &quot;Valleys Eve&quot;, eine der Vorbands, auf die B&#252;hne und spielten
ein nettes 30 min&#252;tiges Set. Zwar fehlten echte Highlights und das
musikalische Material geh&#246;rt auch noch nicht in die erste Liga des deutschen
Power Metals, aber trotzdem hatte jeder Spa&#223; an dieser Band, was nicht
zuletzt an der gelungenen B&#252;hnenshow lag. Besonders der Frontman ist hier
lobenswert zu erw&#228;hnen. Wenn man noch etwas an der musikalischen Seite
arbeitet, wird aus denen sicherlich mal eine gro&#223;e Band.</P>

Nach einer l&#228;ngeren Umbaupause (wobei es der Trottel an der Nebelanlage
offenbar f&#252;r n&#246;tig hielt, die kompletten ersten Reihen mehrmals mit
Trockeneisnebel vollzuspr&#252;hen - danke auch!) kam endlich, zumindest f&#252;r mich, der
langersehnte Auftritt von den finnischen Chartst&#252;rmern Nightwish. Und ich
muss sagen: Die haben wirklich was auf dem Kasten und haben ihr excellentes
Material (insbesondere nat&#252;trlich vom aktuellen Power Metal Highlight
&quot;Oceanborn&quot;) auch live hervorragend in Szene gesetzt. Im Mittelpunkt stand
nat&#252;rlich die attraktive Frontfrau, die nur vor Charisma strotzte und die
Menge recht schnell vollkommen in der Hand hatte. Nightwish Fans wird es
freuen, da&#223; sie auch Live ihre Stimme volkommen im Griff hatte (ist ja auch
nicht weiter verwunderlich, wenn man eine klassische Ausbildung genossen
hatte) und auch die hohen T&#246;ne perfekt traf.
Das Stimmungsbarometer
explodierte f&#246;rmlich und die komplette Meute ging mehr als hervorragend mit.
Es verwundert also nicht weiter, da&#223; das komplette Nightwish Set ein voller
Erfolg wurde und sich viele, ich eingeschlossen, schon auf weitere Werke der
Finnen freuen.</P>

Und dann war es (nach der obligatorischen Umbaupause) endlich so weit: Die
zum Trio geschrumpften Rage betraten, angef&#252;hrt von Peavy Wagner, die B&#252;hne
und er&#246;ffneten ihr Set zur &#220;berraschung vieler mit &quot;From The Cradle To The
Grave&quot;. Der Sound kam schon hier glasklar aus den Boxen, was nat&#252;rlich der
guten Stimmung in der Halle nur zutr&#228;glich war. Im weiteren Verlauf z&#252;ndete
die Band dann s&#228;mtliche Register ihres K&#246;nnens und lie&#223; mit &quot;Solitary Man&quot;
und &quot;Refuge&quot; recht schnell die ersten Klassiker r&#252;berkommen, die die Fans
dankbar aufnahmen und nat&#252;rlich mit aller Kraft mitsangen. Verwunderlich war
schon hier, da&#223; die Band schon jetzt derma&#223;en gut aufeinander eingespielt
war, da&#223; diese Live Versionen fast besser klangen, als die Originale.
Besonders Ausnahmegitarrist Victor Smolski beeindruckte durch seine pr&#228;zise
Gitarrenarbeit; erstaunlich ist, da&#223; sich das Fehlen einer zweiten Gitarre
niemals negativ bemerkbar machte. Ganz im Gegenteil: Die neuen Rage klangen
wesentlich powernder mit nur einer Gitarre, als andere Bands mit derren
zwei. Aber nat&#252;rlich blieb es nicht bei &#228;lterem Material: Auch die Songs vom
neuen Album rockten ordentlich und trieben die Stimmung auf den Siedepunkt.
Besonders Ohrw&#252;rmer wie &quot;Back In Time&quot;, &quot;Love And Fear Unite&quot; und &quot;Wash My
Sins Away&quot; konnten allgemein begeistern, auch wenn das Lingua Mortis
Orchester selbstredent nicht mit von der Partie war (machte aber auch
nichts, da die Songs so wesentlich h&#228;rter klangen). Nat&#252;rlich fehlten auch
die wichtigsten Vertreter von &quot;Black Ind Mind&quot; und &quot;End Of All Days&quot; nicht,
so da&#223; wirklich ausnahmelos jeder auf seine Kosten gekommen sein d&#252;rfte.
Ein weiteres Highlight der Show d&#252;rfte das gnadenlos geniale Drum Solo von
Mike Terrana gewesen sein, der eindrucksvoll unter Beweis stellte, da&#223; er zu
den besten seines Genres z&#228;hlt. 
Negativ anzumerken ist lediglich die Tatsache, da&#223; es B&#252;hnentechnsich kaum
etwas f&#252;r die Fans gab (keine Pyros etc.). Machte aber auch nichts, denn der
Gig war der &#220;berhammer und bewie&#223; eindrucksvoll, da&#223; Rage `99 in besserer
Verfassung als jemals zuvor sind. Somit gibt`s nun schon zwei Gr&#252;nde, warum
Kritiker mitlerweile verstummt sind: Das neue Album &quot;Ghosts&quot; und die darauf
folgende Tournee, die ein Erfolg zu werden scheint. </P>

<u>Tracklist (falsche Reihenfolge):</U></P>

1. From The Cradle To The Grave<BR>

2. Days Of December<BR>

3. Back In Time<BR>

4. Immortal Sin<BR>

5. Wash My Sins Away<BR>

6. Love And Fear Unite<BR>

7. Beginning Of The End<BR>

8. Drumsolo<BR>

9. Vanished In Haze<BR>

10. Spiritual Awakening<BR>

11. Alive But Dead<BR>

12. Sent By The Devil<BR>

13. Shadow Out Of Time<BR>

14. Firestorm <BR>

15. Refuge <BR>

16. Solitary Man<BR>

17. Under Control<BR>

18. Higher Than The Sky<BR>

19. Don`t Fear The Winter</P>






</body>
</html>
