
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>News</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">


<h1><CENTER><FONT COLOR="YELLOW">News</FONT></h1></CENTER></P>
<UL>

<li> Rob Halford (ex-<b>Judas Priest</B>) will es wohl nochmal wissen. Wie schon in
einer der letzten Ausgaben verk&#252;ndet, arbeitet der Brite an klassischen
Metal f&#252;r sein neues Studioalbum und will seine Industrial Phase damit wohl
endg&#252;ltig an den Nagel h&#228;ngen. Ihm zur Seite steht dabei nun auch <B>Bruce
Dickinson</B> Kumpel <B>Roy Z</B>, der ja schon Bruce`s Solokarriere nach 2 etwas
gew&#246;hnungsbed&#252;rftigen CD`s wieder auf den klassischen Metal Pfad bewegte.
Das Album ist f&#252;r Fr&#252;hjahr `00 geplant und wird sicherlich ein Highlight des
n&#228;chsten Jahres.</P><BR>

<li> &#220;berraschenderweise haben sich die Power Metaller <B>Iced Earth</B> von Ihrem
Schlagzeuger getrennt. Ein neuer Drummer ist bis jetzt noch nicht gefunden,
aber man kann davon ausgehen, da&#223; sich die Band vor Zuschriften kaum retten
kann.</P><BR>

<li> Bei <B>Testament</B> hat man offenbar einen neuen Gitarristen gefunden: Alex
Skolnick, der schon bis `92 bei Testamnet an der Klampfe stand und danach
u.a. auf der <B>Savatage</B> Scheibe &quot;Handful Of Rain&quot; zu h&#246;ren war, scheint
Heimweh bekommen zu haben; eine offizielle Best&#228;tigung gibt`s aber noch
nicht.</P><BR>

<li> Bedingt durch Probleme mit der Plattenfirma haben sich die schwedischen
Space Rocker <B>Lake Of Tears</B> aufgel&#246;st. Bandkopf Daniel Brennare erkl&#228;rte
aber, da&#223; die Band vertraglich noch an den Label gebunden sei und deswegen
noch ein Album rausbringen muss. Auch danach will er, in welcher Form auch
immer, weitermachen.</P><BR>

<li> Die schwedischen D&#252;ster Metaller <B>Sundown</B> haben sich ebenfalls aufgel&#246;st;
S&#228;nger Mathias Lomalm wird in Zukunft wieder bei <B>Cemetary</B> (die sich jetzt
Cemetary 1213 nennen) spielen.</P><BR>

<li> Die Karlsruher <B>Payne`s Gray</B> haben sich ebenfalls aufgel&#246;st; n&#228;here Info`s
sollen demn&#228;chst folgen.</P><BR>

<li> Auch bei der Holl&#228;ndischen Combo <B>Sinister</B> hat es gekracht. S&#228;nger Erik
geh&#246;rt demnach nicht mehr zum Line-up. Einen Ersatz Shouter konnte bis jetzt
auch noch nicht pr&#228;sentiert werden.</P><BR>

<li> Bei den (verkaufsgeilen) Black Metallern <B>Cradle Of Filth</B> geht es nach wie
vor drunter und dr&#252;ber: Frontman Dani hat sowohl Gitarrist Stuart Anstis als
auch Keyborder Les Smith in die W&#252;ste geschickt und als Ersatz die beiden
ehemaligen Mitglieder, mit denen es damals ebenfalls kr&#228;ftig gekracht hat,
Paul Allender und Gian Pyres in die Band zur&#252;ckgeholt. Wie lange das halten
wird, kann sich jeder ausrechnen....</P><BR>

<li> Erneut verschoben wurde <B>Savatage`s</B> neues Album &quot;Poets And Madmen&quot;. Nun
soll das Ding im M&#228;rz / April erscheinen. Wer aber das Arbeitstempo der
Herren kennt, wei&#223;, da&#223; damit wahrscheinlich erst zu Weihnachten 2000 zu
rechnen ist. Demhingegen soll das neue <B>Trans Siberian Orchestra</B> Album schon
Januar erhältlich sein.</P><BR>

<li> Das neue <b>Stratovarius</B> Output soll am 28. Februar, vertrieben &#252;brigens vom
derren neuem Label
Nuclear Blast (!!), in den L&#228;den stehen. Derweil gibt`s noch eine Best Of
(Review in der aktuellen Ausgabe) k&#228;uflich zu erstehen.</P><BR>

<li> Das neue Album der Power Metaller <B>Custard</B> &quot;Up To The Sky&quot; sollte bei
erscheinen dieser Ausgabe endlich erh&#228;ltlich sein. Wir sind schon jetzt
gespannt.</P>





</body>
</html>
