<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. KDH Datentechnik &uuml;bernimmt Vertrieb von &raquo;Wildfire&laquo;-Nachfolger &raquo;Taifun&laquo;</H2>
<P>
&raquo;So the world may know! - Die ganze Welt soll es wissen!
</P>
<P>
&quot;Taifun&quot; wird f&uuml;r das neue Amiverse, f&uuml;r den AmigaOne und alle Amiga-
f&auml;higen (Amigable) Computer entwickelt.
</P>
<P>
Horb/Nordhorn, 1. September 2000 - WK Artworks und KDH Datentechnik geben
heute bekannt, dass sie die Entwicklung von &quot;Taifun&quot; f&uuml;r das neue Amiverse,
f&uuml;r AmigaOne und alle Amiga-f&auml;higen Computer begonnen haben.
&quot;Taifun&quot; ist der Nachfolger der preisgekr&ouml;nten Software f&uuml;r besondere
Effekte f&uuml;r Video und Animationen &quot;Wildfire 7PPC&quot;. Das neue Software-
Erzeugnis wir zur Zeit mit Hilfe des Amiga Software Development Kit (SDK)
entwickelt, die Arbeit macht sehr gute Fortschritte.
</P>
<P>
Andreas K&uuml;ssner von WK Artworks und G&uuml;nter Horbach von KDH-Datentechnik
sind begeistert von den M&ouml;glichkeiten, die das neue Amiga OS den Programmen
bietet, die auf dem AmigaOne und anderen Amiga-f&auml;higen Computern und
Ger&auml;ten lauff&auml;hig sind.
</P>
<P>
&quot;'Taifun' ist ein fantastisches Beispiel des Geistes in der Amiga-
Gemeinschaft, die immer Neuerungen zug&auml;nglich ist. Wir sind stolz darauf,
dass wir 'Taifun', Andreas und G&uuml;nter unterst&uuml;tzen k&ouml;nnen. Und wieder
erkennen wir die Leistungsf&auml;higkeit eines unvergleichlichen
Betriebssystems, auf dem nicht zu &uuml;bertreffende Anwendungen aufgesetzt
werden,&quot; sagte Randy Hughes, Vizepr&auml;sident f&uuml;r Verkauf und Strategische
Verbindungen bei AMIGA Inc.
</P>
<P>
&quot;Wir vertrauen fest darauf, dass sich 'Taifun' zu einer 'Killer-
Applikation' f&uuml;r den neuen AmigaOne entwickeln wird. Wir f&uuml;hlen uns der
Zukunft des Amiga verpflichtet und sind sicher, dass viele andere
Gesellschaften die Entwicklung und &Uuml;bertragung klassischer Amiga-Programme
in Angriff nehmen werden. Dazu empfehlen wir allen Entwicklern dringend das
Software Development Kit in Verbindung mit der Unterst&uuml;tzung durch AMIGA-
Inc.,&quot; sagt Andreas K&uuml;ssner von WK Artworks.
</P>
<P>
Das Datum der offiziellen Freigabe von &quot;Taifun&quot; wird mit dem Datum der
allgemeinen Verf&uuml;gbarkeit des neuen Computers AmigaOne von AMIGA Inc.
zusammentreffen. Viele Bildschirm-Ansichten von Effekten, die in der Alpha-
Version von &quot;Taifun&quot; enthalten sind, stehen auf der Web-Site von WK
Artworks zur Verf&uuml;gung. &quot;Taifun Light&quot; wird als Erstes herauskommen, der
Verkaufspreis wird etwa DM 199.00, EUR 100.00 oder USD 99.00 betragen.
Eine professionelle Version wird folgen; deren Preis kann bis jetzt noch
nicht genannt werden. Updates von &quot;Taifun Light&quot; auf die professionelle
Version werden m&ouml;glich sein. Der exklusive Vertrieb von &quot;Taifun&quot; wird in
den H&auml;nden von KDH Datentechnik liegen.
</P>
<P>
Weitere Informationen &uuml;ber &quot;Taifun&quot; erhalten Sie bei einem Besuch bei
www.wk-artworks.de oder wenn Sie Sich mit Andreas Kuessner &uuml;ber
<A HREF="mailto:ak@wk-artworks.de">ak@wk-artworks.de</A> in Verbindung setzen. &Uuml;ber den Verkauf von &quot;Taifun&quot;
unterrichtet Sie KDH Datentechnik auf www.kdh-datentechnik.com oder ein
Kontakt mit KDH &uuml;ber <A HREF="mailto:taifun@kdh-datentechnik.com.">taifun@kdh-datentechnik.com.</A>&laquo;
</P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)<BR>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
