<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Haage &amp; Partner &uuml;bernimmt Rechte an STFax und Genesis</H2>
<P>
Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:
</P>
<P>
&raquo;Active Technologies &uuml;bergibt die Rechte an STFax und Genesis an die
HAAGE&amp;PARTNER Computer GmbH
</P>
<P>
Darlington UK 28. September 2000
</P>
<P>
Active Technologies und HAAGE&amp;PARTNER Computer GmbH (H&amp;P) trafen eine
Vereinbarung zur &Uuml;bernahme der weltweiten Vertriebsrechte an der
Fax/Sprachausgabe Software STFax Professional und den Vertriebs- und
Urheberrechten am TCP/IP-Stack Genesis durch die H&amp;P Computer GmbH. Active
Technologies ist der Meinung, das die Zukunft von STFax
Professional und Genesis sicherer und vielversprechender in den H&auml;nden von
H&amp;P ist. Die Vereinbarung hat sofortige Wirkung weshalb alle Anfragen von
Endkunden und Handelspartnern nun von H&amp;P bearbeitet werden.
</P>
<P>
J&uuml;rgen Haage zur &Uuml;bernahme der beiden Produkte: Genesis und STFax sind
strategisch wichtig Produkte f&uuml;r die Zukunft von H&amp;P und wir sind froh
dar&uuml;ber, die Verantwortung zur Weiterentwicklung und Portierung beider
Produkte zu haben. Der Beleg f&uuml;r unsere aktive Entwicklungst&auml;tigkeit ist
ein ab der kommenden Woche verf&uuml;gbares Update von STFax. Auch Genesis wird
in K&uuml;rze im neuen Gewand erscheinen. Lassen Sie sich &uuml;berraschen.
</P>
<P>
Active Technologies ist Hersteller von Internet- und
Kommunikations-Software f&uuml;r Amiga-Computer und hat bekannte und mehrfach
ausgezeichnete Titel wie NetConnect, Genesis und STFax Professional
entwickelt.
</P>
<P>
H&amp;P ist der f&uuml;hrende Hersteller von Entwicklungssystemen und Anwendungen
f&uuml;r Amiga Computer und entwickelt derzeit Programm der n&auml;chsten Generation
f&uuml;r den existierenden und zuk&uuml;nftigen AMIGA-Markt. Ziel ist es, dem
Amiga-Markt die leistungsf&auml;higsten Werkzeuge und Anwendungen zur Verf&uuml;gung
zu stellen. Kontakt unter HAAGE&amp;PARTNER Computer GmbH, Schlossborner Weg 7,
61479 Glashuetten, Germany, Tel: +49-6174-966100, Fax: +49-6174-966101,
www.haage-partner.com.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
