<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Innovative informiert &uuml;ber die Zukunftspl&auml;ne des Unternehmens</H2>
<P><B>Innovative (<A HREF="http://www.innovative-web.de" TARGET="_top">http://www.innovative-web.de</A>) informiert:</B></P>
<P>
&raquo;11.9.2000 Innovative gibt zuk&uuml;nftige Pl&auml;ne bekannt
(Wir bitten um Entschulding f&uuml;r die Erkl&auml;rung in voller L&auml;nge, aber der
Inhalt l&auml;&szlig;t sich schlecht zusammenfassen. Wir werden in Zukunft wieder
k&uuml;rzere Newsletter verschicken)
</P>
<P>
Innovative, u.a. bekannt durch popul&auml;re AMIGA®-Titel wie fxPAINT, fxSCAN,
VHI Studio und Ultraconv gab heute die zuk&uuml;nftigen Pl&auml;ne des Unternehmens
bekannt.
</P>
<P>
fxSCAN 3.0 mit lernf&auml;higer Texterkennung
In K&uuml;rze wird Version 3.0 von fxSCAN erscheinen. Die neue Version wird ein
Major-Update darstellen und sich vor allem durch folgende neue Features
auszeichnen:
</P>
<UL>
<LI> Lernf&auml;hige Texterkennung
</LI>
<BR><LI> Unterst&uuml;tzung f&uuml;r kostenlose BetaScan-Treiber
</LI>
<BR><LI> komfortable Kopierer-Funktion
</LI>
<BR><LI> &Uuml;berarbeitete Oberfl&auml;che
</LI>
<BR><LI> JPEG-Grafiken werden nun via PPC geladen
</LI>
<BR><LI> viele kleinere Verbesserungen
</LI>
</UL>
<P>
Der Preis wird bei 69.- DM liegen. Ein Update von V1.0/V2.0 wird 59.- DM
kosten. Updates von V1.0 SE (ScanQuix-Spezialversion) sind nicht
vorgesehen.
</P>
<P>
fxSCAN 3.0 kann ab sofort im Online-Shop von Innovative
(<A HREF="http://www.innovative-web.de/" TARGET="_top">http://www.innovative-web.de/</A>) bestellt werden und wird dann bei
Fertigstellung umgehend ausgeliefert. Eine von Grund auf neu erstellte
fxSCAN-Website wird es mit der Einf&uuml;hrung der neuen Version geben.
</P>
<P><B>Die Gegenwart</B></P>
<P>
Innovative sieht den AMIGA®-Markt als zu klein an, um nur aus Einnahmen aus
diesem Markt bestehen zu k&ouml;nnen. Das Unternehmen sieht keine Tendenz zur
Besserung der Lage, da Schl&uuml;sselunternehmen dem &quot;Classic-AMIGA®&quot; den R&uuml;cken
zugekehrt haben oder Konkurs anmelden mu&szlig;ten und wichtige Hardware-Produkte
nur noch verf&uuml;gbar sind, bis die Lager leer sind. Schnellere, aktuellere
oder komplett neue Hardware scheint nicht in greifbarer N&auml;he zu sein und
grundlegende Verbesserungen am aktuellen Classic-AmigaOS® sind in naher
Zukunft nicht zu erwarten. Das AMIGA® SDK ist ein Lichtblick, aber leider
noch lange kein Garant f&uuml;r die zuk&uuml;nftige Existenz und Pflege eines neuen
AMIGA®-Betriebs-/Computersystems mit hohem Verbreitungsgrad.
</P>
<P>
Die aktuelle Marktsituation zwingt Innovative dazu, sich neue M&auml;rkte zu
erschlie&szlig;en und nicht mehr *nur* auf dem AMIGA®-Markt t&auml;tig zu sein.
</P>
<P><B>Die Zukunft</B></P>
<P>
Nach der Ver&ouml;ffentlichung von fxSCAN V3.0 wird Innovative verst&auml;rkt an
einer neuen Technologie (deren Details hier aus Gr&uuml;nden der Sicherung des
geistigen Eigentums von Innovative nicht n&auml;her erl&auml;utert werden k&ouml;nnen)
arbeiten. Die mit Hilfe dieser neuen Technologie (Codename &quot;InNT&quot;)
entwickelten Programme werden weiter gesteigerten Bedienkomfort bieten,
eine noch spektakul&auml;rere Optik haben und innerhalb k&uuml;rzester Zeit auf
andere Plattformen und Prozessoren portierbar sein, was die
Entwicklungszeiten und -kosten erheblich verk&uuml;rzt/senkt. Sobald die
Entwicklung der ersten Version dieser Technologie abgeschlossen ist, werden
bereits bekannte Innovative-Titel darauf portiert und dann in Versionen f&uuml;r
verschiedene Plattformen verf&uuml;gbar gemacht werden. Neben der AMIGA®-
Plattform wird zuk&uuml;nftig u.a. auch der Windows®- und Linux®-Markt Ziel der
Entwicklungen des Unternehmens sein. Es ist auch geplant, Lizenzen f&uuml;r die
Technologie zu vergeben, was aber zu diesem Zeitpunkt noch nicht definitiv
feststeht. Der Ausgang dieser Entscheidung wird in einer sp&auml;teren,
separaten Erkl&auml;rung ver&ouml;ffentlicht.
</P>
<P><B>Die AMIGA®-Umsetzungen</B></P>
<P>
Leider ist davon auszugehen, dass ein 68K-PPC-Dual-Prozessor-System wie es
aktuell in einigen AMIGA®s zum Einsatz kommt, nicht als Basis f&uuml;r die neue
Technologie geeignet sein wird, da die Oberfl&auml;che und das Programm nur
bedingt trennbar sein werden und aller Vorraussicht nach selbst ein 68060
definitiv zu langsam sein wird, um ein fl&uuml;ssiges und komfortables Arbeiten
zu erm&ouml;glichen.
</P>
<P>
Innovative wird allerdings zur Zeit der Fertigstellung der ersten Version
der neuen Technologie die M&ouml;glichkeiten zur Umsetzung auf MorphOS und APUS
Linux ausgiebig pr&uuml;fen und strebt zu diesem Zeitpunkt eine Portierung auf
diese Plattformen an. Das auf Tao®'s Elate® basierende neue AmigaOS® wird
von Innovative unterst&uuml;tzt werden, sofern es verf&uuml;gbar sein sollte. AMIGA®-
User werden also auch zuk&uuml;nftig in den Genuss von hochwertiger und
hochinnovativer Software aus dem Hause Innovative kommen.
</P>
<P><B>Die aktuellen Produkte</B></P>
<P>
Die zuk&uuml;nftigen Pl&auml;ne von Innovative stehen in einer gewissen Konkurrenz
zur Weiterentwicklung der aktuellen Produkpalette f&uuml;r AMIGA®-Rechner.
Dennoch werden die bestehenden Produkte weiter gepflegt und regelm&auml;&szlig;ige
Updates erscheinen, wenn auch in gr&ouml;&szlig;eren Abst&auml;nden als bisher. Wer also
heute ein Innovative-Produkt erwirbt, kauft ein Produkt, das auch in
Zukunft weiterentwickelt werden wird. Sobald die neue Technologie
fertiggestellt ist, wird der Kunde auch ein entsprechendes Update-Angebot
erhalten und die Applikation selbst bei einem Systemwechsel auf Windows®,
Linux® oder &quot;AMIGA® NG&quot; ohne gr&ouml;&szlig;ere Umgew&ouml;hnung weiternutzen k&ouml;nnen.
</P>
<P><B>Die Webservices</B></P>
<P>
Wir werden keine Webservices mehr anbieten, da der Zeitaufwand und die
Kosten nicht im Verh&auml;ltnis zum erzielten Gewinn stehen. Die laufenden
Vertr&auml;ge werden allerdings noch auf unbestimmte Zeit weiterbestehen. Neue
Vertr&auml;ge werden wir nicht mehr abschliessen, sondern k&uuml;nftig nur noch
Speziall&ouml;sungen f&uuml;r Unternehmen anbieten. Das &quot;Amiga Link Directory&quot; wird
von uns nat&uuml;rlich auch in Zukunft weiterentwickelt und gepflegt.
</P>
<P><B>H&auml;ufig gestellte Fragen</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Hei&szlig;t das, das Sie die Entwicklung f&uuml;r den AMIGA einstellen ?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Nein. Lesen Sie hierzu die Abs&auml;tze &quot;Die AMIGA-Umsetzungen&quot; und&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&quot;Die aktuellen Produkte&quot;.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Sie reden st&auml;ndig von einer &quot;neuen Technologie&quot;, stellen aber&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">keine Konzepte vor. Was verbirgt sich dahinter ?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die Konzepte dahinter sind unser geistiges Eigentum und daher&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">nicht f&uuml;r die &Ouml;ffentlichkeit bestimmt. Wenn wir weitere&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Informationen herausgeben wollen, tun wir dies nicht auf Nachfrage&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">sondern ausschlie&szlig;lich&nbsp;</TD><TD VALIGN="TOP">aus eigener Initiative heraus via&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Presseerkl&auml;rung. Alles was Sie nicht auf unserer Website gelesen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">haben, sind falsche Informationen. Bitte fragen Sie uns diese&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Frage nicht via EMail, Telefon, Fax oder Brief, da wir sie nicht&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">beantworten werden.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Wann werden die Arbeiten an der neuen Technologie abgeschlossen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">sein ?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Da wir uns bei dieser strategisch wichtigen Entwicklung nicht&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">selbst unter Druck setzen wollen, werden wir vorerst keinen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Zeitplan bekanntgeben.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Welche neuen Produkte planen Sie ?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Unsere Informationspolitik sieht die Ank&uuml;ndigung von neuen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Produkten zu diesem Zeitpunkt nicht vor.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Ich w&uuml;rde gerne die neue Technologie lizensieren. Was kostet mich&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">eine Lizenz ?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Wir denken &uuml;ber die Vergabe von Lizenzen nach, haben aber noch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">keinen entsprechenden Beschluss gefasst und k&ouml;nnen daher auch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">keine Preise nennen..&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Frage:&nbsp;</TD><TD VALIGN="TOP">Ich w&uuml;rde gerne betatesten. Schickt mir doch einmal eine Beta!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Wir versenden keine Betas.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Disclaimer: AMIGA® ist ein eingetragenes Markenzeichen von Amiga, Inc.
Windows® ist ein eingetragenes Markenzeichen von Microsoft. Linux® ist ein
eingetragenes Markenzeichen von Linus Torvalds. Elate® ist ein
eingetragenes Markenzeichen der Tao Group.
</P>
<P>
Wir behalten uns das Recht vor, die Informationen ohne Benachrichtigung zu
&auml;ndern. Aus den hier gegebenen Informationen k&ouml;nnen keine Anspr&uuml;che
abgeleitet werden.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
