<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P>
Wenn Ihr einen Beitrag habt, schreibt bitte an:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Hintergrundinfos zum Special vom 18.09.2000 (von Gernod Schomberg)</H2>
<P>
Ein Freund von mir sammelte seit Jahren Computer, die er &uuml;berholte, ggf.
reparierte und dann an Kinder, Schulen und wen auch immer verschenkte. Ich
hatte ihm dabei geholfen. Wir beschafften die Ger&auml;te aus den
verschiedensten Quellen, wo sie wegen Modernisierung, was ja bei PCs sehr
h&auml;ufig notwendig war, gern abgegeben wurden. Manchmal waren da auch Exoten,
wie C64, CBM XXXX, HP XXX, Amiga usw. dabei, eben Rechner, mit denen der
normale B&uuml;romensch zu Hause nichts anfangen kann. Wir hatten uns damit ein
richtiges kleines Museum eingerichtet.
</P>
<P>
Aus pers&ouml;nlichen Gr&uuml;nden (Tod seiner Frau) verkauft mein Freund sein
H&auml;uschen. Er ist Ostpreu&szlig;e und verbringt den gr&ouml;&szlig;ten Teil des Jahres in
seiner Heimat, wo er u.a. Schulspeisungen und Patenschaften organisiert und
Deutschunterricht erteilt. Da er bis Ende diesen Monats sein Haus verlassen
haben muss, war sehr daran interessiert, die historischen Rechner in gute
H&auml;nde abgeben zu k&ouml;nnen.
</P>
<P>
Ich wei&szlig;, dass so eine Kleinanzeige kein Grund ist, ein Amiga-aktuell-
Special herauszugeben. Um so dankbarer bin ich Carsten Schr&ouml;der, dass er
wegen des dr&auml;ngenden Termins &uuml;ber seinen Schatten gesprungen ist und das
Angebot ver&ouml;ffentlichte. Das Interesse war verbl&uuml;ffend, bevor ich selbst
die Mitteilung gelesen hatte, waren schon vier eMails von drei CBM-Freunden
in meinem Postfach, einer der Absender rief mich in dem Moment an, als ich
nach mehrst&uuml;ndiger Abwesenheit meine Wohnung betrat, um unbedingt bei der
Verteilung bedacht werden zu k&ouml;nnen. Da alle drei Interessenten alles haben
wollten, bat ich sie, die Verteilung selbst untereinander vor zu nehmen,
was ganz schnell klappte. Innerhalb einer Woche waren alle Ger&auml;te bei ihren
neuen Besitzern.
</P>
<P>
Ich m&ouml;chte mich bei all denen entschuldigen, die sich bei mir meldeten, die
aber leer ausgingen. Ich hatte wie schon im Fr&uuml;hjahr bei den Amigas, die
aus der gleichen Quelle stammten, nur die M&ouml;glichkeit, nach Eingang der
Anfragen zu entscheiden. Dass ich nicht sagte: &quot;Pro Mann ein Ger&auml;t!&quot; ist
sicherlich verst&auml;ndlich, denn wegen eines CBM-Rechners, wenn es nicht
gerade der PET 2001 ist, durch Deutschland zu fahren, kann man niemandem
zumuten.  Und den Versandaufwand hatte ich bei den drei Amigas erlebt und
wollte ihn mir nicht noch ein Mal antun.
</P>
<P>
Ich habe versucht, jedem die Absage per E-Mail zu erkl&auml;ren. Sollte ich
einen vergessen haben, bitte ich um Entschuldigung, es war keine Absicht.
</P>
<P><B>Gernod Schomberg &lt;<A HREF="mailto:g.schomberg@t-online.de">g.schomberg@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
