<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Das darf doch nicht wahr sein - nur 15 Leser, die am letzten Gewinnspiel
teilnahmen? Hoffentlich ist das nur ein vor&uuml;bergehender Durchh&auml;nger, es
w&auml;re ja nicht das erste Mal.
</P>
<P>
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr
bereits mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">AMIGA hat vor kurzem ein Abkommen mit einem amerikanischen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Hardwarehersteller geschlossen, der das neue AmigaOS f&uuml;r&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">seine Produkte nutzen m&ouml;chte. Wie hei&szlig;t das Unternehmen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Das gesuchte Unternehmen hei&szlig;t Infomedia Network, Inc.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Vor kurzem wurde der Hardwareentwickler Dean Brown von AMIGA&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">eingestellt. Seit wann (gesucht ist der Monat) geh&ouml;rt er zu&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Bill McEwens Mannschaft?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Seit Juni geh&ouml;rt Dean Brown zu AMIGA, konkret seit dem 05.06.2000.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Die Antwort war in der Zusammenfassung von AMIGA World in AMIGA&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">aktuell 09/00 zu finden.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">AMIGA hat angek&uuml;ndigt, dass der geplante Desktop-Rechner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&raquo;Amiga One&laquo; auch Nicht-Standard-PC-Komponenten beinhalten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">wird. Sollte dies deiner Meinung nach auch den Prozessor&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">betreffen, das hei&szlig;t eine Nicht-x86-CPU zum Einsatz kommen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Ja.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">13&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Nein.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Denis Zwornarz h&auml;lt nichts von der Verwendung eines x86-Prozessors: &raquo;Ich
sehe keinen besonders gro&szlig;en Vorteil darin, x86-CPUs zu nutzen (au&szlig;er im
Winter, wenn die Heizung ausgefallen ist). Einen G3 bzw. G4 w&uuml;rde ich in
jedem Fall bevorzugen. Vielleicht nicht die g&uuml;nstigste Alternative, aber,
wie ich denke, die bessere L&ouml;sung.&laquo;
</P>
<P>
Steffen Jahn favorisiert dagegen den x86: &raquo;Die Entwicklung eines neuen
Prozessors bzw. Benutzung eines nur in wenigen St&uuml;ckzahlen produzierten
Prozessors ist nicht gut. Man sollte eine x86-CPU verwenden, da sie zum
einen in gro&szlig;en St&uuml;ckzahlen produziert wird und zum zweiten der st&auml;ndige
Preiskampf von AMD und Intel die Preise in den Keller dr&uuml;ckt. Ein weiterer
Grund ist meines Erachtens die Verbreitung solcher Prozessoren und somit
die M&ouml;glichkeit, auch f&uuml;r Standard PC-User die M&ouml;glichkeiten des AmigaOS zu
nutzen. Wenn das AmigaOS auf einer x86-CPU so l&auml;uft wie auf einem 680x0,
dann kann dies nur zu einem Umbruch in der Computerbrache f&uuml;hren.
Alle Vorz&uuml;ge des AmigaOS sollten auch auf diesem Prozessor umsetzbar sein,
und wenn dies funktioniert, wird der Amiga wieder eine Zukunft haben. Das
AmigaOS sollte aber auch auf anderen Prozessoren, wie dem G4, laufen, um
alle Computeruser der Erde in den Genu&szlig; dieses (unseres) OS kommen zu
lassen.&laquo;
</P>
<P>
Dirk Wenk ist anderer Auffassung: &raquo;Die Architektur der x86-CPU ist einfach
zu altbacken. Der Prozessor ist einfach schlecht! Der einzige Grund, warum
es diese CPU in dieser Form noch gibt, ist, weil Windows darauf l&auml;uft und
sie durch die Massenproduktion sehr g&uuml;nstig ist, mehr aber auch nicht.
Idealerweise l&auml;uft das AmigaOS/OE auf einem Prozessor, der den VP-Code
direkt versteht. Man kann sich also eine CPU wie die von Transmeta
vorstellen, die aber statt eine X86 Architektur nachzubilden, eine VP-CPU
nachbildet!
[W&auml;re das tats&auml;chlich sinnvoll? Einer der Vorteile des neuen AmigaOS ist
ja, dass es den virtuellen Prozessor beinhaltet und sich somit ohne
gr&ouml;&szlig;eren Geschwindigkeitsverlust auf vielerlei CPUs verwenden l&auml;sst. Aus
meiner Sicht macht gerade diese Technologie einen Prozessor wie den Crusoe
von Transmeta, der ja einen ganz &auml;hnlichen Weg - nur auf Hardwareebene -
geht, in einem AmigaNG-Rechner nicht erforderlich; Anm. d. leit. Red.]
Und f&uuml;r den Zwischenschritt, also als &Uuml;bergang dazu, sollte der VP auf
einem Prozessor laufen, der 1. weiterentwickelt wird, 2. schnell ist und 3.
geringe Abmessungen und einen geringen Verbrauch hat. Denkbar w&auml;re hier der
StrongARM oder der PowerPC.
</P>
<P>
Aber auch Multiprozessorsysteme sind sehr reizvoll. Dadurch br&auml;uchte man
nicht einen schnellen hochgetakteten Prozessor, der wie ein Weihnachtsbaum
im Funkbereich strahlt, sondern viele mittlere Prozessoren, die dadurch
auch effektiver arbeiten k&ouml;nnten, als es ein einziger kann. Denkbar ist
auch eine Integration von Phantomprozessoren (siehe Amiga-Patent), d.h. die
Waschmaschine rechnet mit, usw. ;) Aber das dauert bestimmt noch 5 Jahre
oder l&auml;nger (leider).&laquo;
</P>
<P>
Andreas Guldner h&auml;lt ebenfalls nichts vom x86: &raquo;x86-Heizger&auml;te stehen
technisch kurz vor dem Ende ihrer M&ouml;glichkeiten, sie sind nicht mehr
entwicklungsf&auml;hig und werden nur noch auf Teufel komm raus hochgetaktet.
Alle Chiphersteller werkeln sicher schon an Nachfolgern, und deshalb sind
multiprozessorf&auml;hige Risc-CPUs die einzige gute Wahl f&uuml;r ein modernes
System, dessen Leistung sich aus der Zusammenarbeit aller im Rechner
vorhandenen Main-, Grafik- und Sound-Prozessoren ergibt. Eine
Softwarel&ouml;sung f&uuml;r Windows-Benutzer als Anreiz zum Kauf eines reinen Amiga-
Systems ist sicher ausreichend, um x86-Benutzer davon zu &uuml;berzeugen, sich
nach dem schnell erreichten Verfalldatum ihres PCs einen Amiga zu kaufen!
Nur ein extrem geringer Teil der Computerbesitzer verwendet diese x86er,
weil er/sie es will, und sicher w&uuml;rden viele ihr Standardsystem gegen ein
besseres eintauschen, darum sollte ein Beispielrechner f&uuml;r ein neues OE aus
modernen und weiterentwicklungsf&auml;higen Bausteinen bestehen und nicht die
typische PC-08/15-Technik verwenden, deren Leistungsgrenzen innerhalb von
ein bis zwei Jahren erreicht sind. Warum auf einen Zug aufspringen, der zum
Verschrotten f&auml;hrt??&laquo; [Bitte sende deinen Kommentar zur Meinungsfrage in
Zukunft auf Diskette oder per E-Mail, danke; Anm. d. Red.]
</P>
<P>
F&uuml;r Gernod Schomberg spielt die CPU eine untergeordnete Rolle: &raquo;Ich bin
kein Computertechniker, nicht einmal besonders erfahren in Dingen der
Informatik. Deshalb kann ich nicht beurteilen, ob wirklich nur ein
Prozessor der 68k-Reihe von Motorola dazu geeignet ist, das intuitive
Gef&uuml;hl her&uuml;ber zu bringen, das wir am Amiga lieben. Ich glaube das
jedenfalls nicht! Offenbar ist das den PPC- und UAE-Benutzern auch
gleichg&uuml;ltig!
Nicht nur das Gef&uuml;hl ist wichtig, ich verstehe unter &quot;Amiga&quot; auch anderes:
Z.B. die seit Beginn des Amiga gepflegte Methode der Hardware-Erweiterung,
die 10 Jahre sp&auml;ter bei einem anderen System als &quot;Plug'n Play&quot; neu erfunden
wurde; z.B. die M&ouml;glichkeit, auch Datentr&auml;ger anderer Systeme zu lesen;
z.B. die seit einigen Jahren eingef&uuml;hrten Datatypes. Und manches mehr.
Da der Amiga der Neuen Generation sowieso auf einem Virtuellen Prozessor
aufbaut, sollten die F&auml;higkeiten, die wir sch&auml;tzen, in der Amiga-
Basisschicht (Amiga Foundation Layer/AFL) und dem Amiverse eingebaut sein.
Der Prozessor (die Prozessoren) der Hardware-Schicht muss (m&uuml;ssen) nur
schnell genug sein. Was da vor sich hin arbeiten wird, ist f&uuml;r mich
vollkommen egal.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Klare Sache - die gro&szlig;e Mehrheit der Teilnehmer h&auml;lt nichts von einem x86-
Prozessor im Amiga One. Offenbar wird ihr Wunsch erh&ouml;rt: Auf der Internet-
Website des Hardwareherstellers MeterNet, der die AmigaNG-Technologie in
seinen Produkten verwenden will, ist innerhalb einer Auflistung h&auml;ufig
gestellter Fragen davon die Rede, dass AMIGA einen Desktop-Rechner auf
RISC-Basis plane - gemeint ist zweifellos der Amiga One -, was die Nutzung
einer x86-CPU als Hauptprozessor ausschlie&szlig;t.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Dirk Wenk&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AmigaOS 3.5&quot;: Steffen Jahn&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Maxon Cinema 4D v4&quot;: André K&ouml;hler&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
