<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Darf er oder darf er nicht?
</P>
<P>
Wie Mitte September bekannt wurde, hat AMIGA-Vizepr&auml;sident Petro
Tyschtschenko zusammen mit einem Partner eine eigene Firma gegr&uuml;ndet.
Bei einem Manager nichts allzu Ungew&ouml;hnliches, sollte man meinen, und doch
hat die Meldung aus mehreren Gr&uuml;nden in der Amiga-Gemeinde Schlagzeilen
gemacht.
</P>
<P>
Ein Grund ist, dass Petro Tyschtschenko sein Vorhaben offenbar nicht mit
AMIGA-Pr&auml;sident Bill McEwen abgesprochen hatte. - &quot;Muss er das denn?&quot;
werden vielleicht einige von euch jetzt fragen. Vermutlich ja. Selbst in
den Arbeitsvertr&auml;gen der sogenannten &quot;kleinen Leute&quot; gibt es oftmals eine
Klausel, wonach der Arbeitnehmer den Arbeitgeber &uuml;ber den Beginn einer
Zweitbesch&auml;ftigung unterrichten muss, und bei Manager-Vertr&auml;gen wird eine
solche Bestimmung zum Standard geh&ouml;ren - aus gutem Grund: Um den Erfolg
eines Unternehmens zu gew&auml;hrleisten, ist es unverzichtbar, dass sich deren
Top-Manager absolut loyal zu ihm verhalten, allein dieser Firma m&uuml;ssen ihre
Bem&uuml;hungen gelten. Die Gr&uuml;ndung einer eigenen Gesellschaft birgt jedoch in
dem Fall die nicht zu untersch&auml;tzende Gefahr eines Interessenkonflikts,
insbesondere wenn die beiden Unternehmen in derselben Branche t&auml;tig sind.
</P>
<P>
Aber es stellen sich noch einige andere Fragen: Wollte Petro Tyschtschenko
die Aktion geheim halten? Daf&uuml;r spricht, dass er nach Bekanntwerden
zun&auml;chst abwiegelte: Er sei nur Stillhalter, habe also mit dem eigentlichen
Unternehmensgesch&auml;ft gar nichts zu tun. Dies jedoch wird mit dem
ver&ouml;ffentlichten Auszug aus dem Handelsregister eindeutig widerlegt: Petro
Tyschtschenko ist Gesch&auml;ftsf&uuml;hrer mit Alleinvertretungsrecht, d.h. er darf
ohne R&uuml;cksprache mit seinem Partner Beschl&uuml;sse hinsichtlich des
Tagesgesch&auml;fts fassen.
</P>
<P>
Und hat der AMIGA-Vizepr&auml;sident tats&auml;chlich seine von AMIGA bezahlten
Indien-Reisen zur Kontaktaufnahme zwecks Aufbau seiner Firma genutzt, was
Bill McEwen seinen Worten nach zu urteilen offenbar f&uuml;r nicht
ausgeschlossen h&auml;lt? Das werden wir vermutlich nie erfahren.
</P>
<P>
Dies alles f&uuml;hrt schlie&szlig;lich jedoch zu folgender Frage: Welche Zukunft hat
Petro Tyschtschenko bei AMIGA? Wird er auf absehbare Zeit im Unternehmen
bleiben oder es von sich aus bzw. auf Druck der amerikanischen AMIGA-
F&uuml;hrung verlassen? Wir d&uuml;rfen gespannt sein, ob, und wenn ja wie, sich die
Sache weiter entwickelt. F&uuml;r bemerkenswert halte ich jedoch, dass eine
solch brisante Angelegenheit bereits jetzt, zwei Wochen nach Bekanntwerden,
schon wieder aus den Schlagzeilen verschwunden ist. Momentan herrscht
(zumindest in der &Ouml;ffentlichkeit) Ruhe - aber ist es vielleicht nur die
Ruhe vor dem Sturm?
</P>
<P><B>Bis n&auml;chsten Monat,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
