<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Epic Marketing Deutschland wird umstrukturiert
</LI>
</UL>
<P>
Epic Marketing gr&uuml;ndet zwei neue Unternehmen, Epic Interactive
und Epic Multimedia, wobei sich Epic Interactive um die
Entwicklung von Spielen konzentrieren wird w&auml;hrend sich Epic
Multimedia um die Distribution von Produkten k&uuml;mmern wird.
Der Classic-Amiga Bereich wird dagegen nach der Ver&ouml;ffentlichung
von Simon the Sorcerer 2, Dafel Bloodline und Earth 2140
nicht mehr unterst&uuml;tzt (es sei denn die Spiele w&uuml;rden sich
revolution&auml;r gut verkaufen, was aber eher unwahrscheinlich
ist). Epic Marketing Deutschland wird dagegen komplett
geschlossen und so der komplette Support eingestellt.
</P>
<UL>
<LI> Nightlong im Presswerk
</LI>
</UL>
<P>
Der Tag X r&uuml;ckt in greifbare Entfernung: Mitte September hat clickBOOM
verk&uuml;ndet, dass sich Nightlong im Presswerk befindet. Sofort nach
Erscheinen k&ouml;nnt ihr dann hier nat&uuml;rlich ein ausf&uuml;hrliches Review
lesen.
</P>
<UL>
<LI> Earth 2140
</LI>
</UL>
<P>
Epic Interactive hat einige Details &uuml;ber die Umsetzung des PC
Strategiehits Earth 2140 bekanntgegeben. Das Spiel l&auml;uft komplett
in 16bit und ben&ouml;tigt deshalb eine Grafikkarte. Als Prozessor
wird mindestens ein 68040 vorrausgesetzt. PPC wird nat&uuml;rlich
unterst&uuml;tzt. Als Erscheinungstermin wurde November 2000 angegeben.
</P>
<UL>
<LI> Gilbert Goodmate auch f&uuml;r PPC
</LI>
</UL>
<P>
Crystal Interactive Software sucht einen PPC Programmierer f&uuml;r
die Umsetzung von Gilbert Goodmate and the Mushroom Phrygmania.
Damit ist wohl klar, dass es auch f&uuml;r PPC erscheinen wird.
Gilbert Goodmate soll noch dieses Jahr ausgeliefert werden.
</P>
<UL>
<LI> Aminet Games erschienen
</LI>
</UL>
<P>
Bei Schatztruhe ist eine neue Aminet CD-ROM erschienen, die
sich speziell mit Spielen besch&auml;ftigt. Ein Testbericht k&ouml;nnt
ihr in dieser Ausgabe lesen.
</P>
<UL>
<LI> Crystal Software
</LI>
</UL>
<P>
Crystal Interactive Software hat bekanntgegeben, dass Blittersoft den
weltweiten Vertrieb ihrer Amiga-Produkte &uuml;bernehmen wird.
</P>
<UL>
<LI> Lambda
</LI>
</UL>
<P>
Es gibt mal wieder etwas neues vom Weltraum 3D-Spektakel Lambda:
Nachdem die Neuigkeiten &uuml;ber die letzten Monate immer d&uuml;nner wurden,
steht jetzt auf der Homepage &quot;Status: Pausiert&quot;. Ob das das Ende
der Entwicklung bedeutet ist zwar nicht klar, jedoch r&uuml;ckt sie
damit in immer weitere Ferne.
</P>
<UL>
<LI> Bubble Heroes erschienen
</LI>
</UL>
<P>
Diesen Monat ist endlich Bubble Heroes von Crystal Interactive Software
erschienen. Vertrieben wird das Spiel von Blittersoft. Bubble Heroes
ist ein Puzzlespiel im klassischen Stil und wird hoffentlich in der
n&auml;chsten AMIGA aktuell Ausgabe getestet.
</P>
<UL>
<LI> Neues von Exodus - The Last War
</LI>
</UL>
<P>
Die Entwickler von Exodus - The Last War, einem Command &amp; Conquer
Klon, haben sich zu Wort gemeldet und bekanntgegeben, dass das
Spiel sehr bald fertig sei. Insgesamt kann Exodus mit 64 Missionen
in 20 verschiedenen Szenarien aufwarten, wobei alle K&auml;mpfe in
der Luft, im Wasser und zu Lande ausgef&uuml;hrt werden k&ouml;nnen. Das
Spiel ben&ouml;tigt mindestens einen 68030, 16 MB Fast RAM sowie AGA
oder Grafikkarte. Die CD soll noch einige Bonusprogramme enthalten.
Man darf also gespannt sein.
</P>
<UL>
<LI> Virtual Ball Fighters erschienen
</LI>
</UL>
<P>
Epic Marketing (zuk&uuml;nftig Epic Interactive) hat diesen Monat endlich
Virtual Ball Fighters ver&ouml;ffentlicht. Leider kann ich euch hier zu
keinen Testbericht pr&auml;sentieren, da Epic Marketing keine Testexemplare
an Online Magazine verteilt.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
