<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Story/Erfahrungsbericht: Der Traum vom A500... (von Dirk Wenk)</H2>
<P>
Wir schreiben das Jahr 3217. Dies sind die Abenteuer der U.S.S
Ent.....upsi... falscher Film...
</P>
<P>
Wir schreiben das Jahr 1987. Es ist Weihnachten und ich freue mich riesig,
denn ich habe einen Amiga 500 geschenkt bekommen :) Juchu!
</P>
<P>
Alles ist super, beeindruckend und schnell. Aber es vergeht die Zeit wie im
Fluge und schon haben wird 1992/93 ... In der Zwischenzeit reichte die
Grundausstattung nicht mehr und eine 2. Floppy, Kick 2.05 und eine
Speichererweiterung von satten 2MB mu&szlig;ten her. Neidisch schaut man auch mal
in die eine oder andere Zeitschrift, wo von Turbokarten und sogar von
Festplatten berichtet wird und man denkt sich: So was will ich auch mal
haben ... =)
</P>
<P>
Jetzt schreiben wird das Jahr 2000 ... Wow, was f&uuml;r ein Sprung! ;)
Inzwischen steht der A500 im Schrank und auf dem Tisch bzw. darunter steht
ein A4000 mit allem Drum und Dran im Tower, daneben noch ein A1200, der als
Server dient.
</P>
<P>
Nun sitzt man da und denkt an die guten alten Zeiten. Was gab es denn so
vor 5-10 Jahren eigentlich noch mal? Also ab ins Zeitschriften-Archive (ich
kann doch nix wegschmei&szlig;en!). Dort unten im Dunklen stehen die alten Kisten
voll mit guten alten Amiga-Magazinen (hust, staub). Beim Aufbrechen der
ersten Schatzkis..., &auml;&auml;&auml;h, Archivkiste f&auml;llt schon mal der erste Blick
auf´s Datum..9/92. Mann, ich erinnere mich an diese Ausgabe als w&auml;re es
gestern :). Ist es den schon sooo lange her?
</P>
<P>
Und beim Durchbl&auml;ttern der alten Ausgaben sto&szlig;e ich auf einen Artikel, der
rot markiert ist. Es ist ein Testbericht von der &quot;Blizzard Turbo Memory
Board&quot;-Turbo-Karte. Eine Karte die einen MC68000 mit 14 MHz und bis zu 8 MB
Speicher beherbergt und dazu auch noch einen so genannten Shadow-Speicher
hat, in den man ein Kickstart-Image reinladen kann.
</P>
<P>
Ja, jetzt erinnere ich mich wieder. So was wollte ich damals haben. Ein
Blick auf den damaligen Preis und mir wird schlecht ;) &quot;DAS&quot; konnte ich mir
damals nicht leisten!...
</P>
<P>
Also zur&uuml;ck an den A4000 und im Internet ein bi&szlig;chen hier und da nach
Erweiterungen gesucht, die meinen A500 zu neuem Leben erwecken sollen!
So, meine &Uuml;berlegung, k&ouml;nnte ich die ganzen alten guten Spiele wieder
rauskramen und zocken :). Und siehe da, eine Blizzard wird angeboten, sogar
mit 3MB RAM! Und der Preis? Nur ein Bruchteil von damals! Die 50 DM sind
schnell &uuml;berwiesen und schon ist die Karte bei mir!
</P>
<P>
Den Rechner auf und ..., &auml;&auml;&auml;h, Moment, was ist denn das? Eine
Kickstartumschaltplatine ist im Weg. Mann, die habe ich total vergessen!
Was nun? Welches Rom lasse ich drin? Es sind Kick 1.2 und Kick 2.05.
Mmmh... Am besten Kick 1.2 f&uuml;r die alten Games, f&uuml;r den Rest k&ouml;nnte ich ja
den Shadow-Speicher benutzen! Halt mal, den mu&szlig; man ja erst mal best&uuml;cken!
Was mu&szlig; denn da rein? Aha, 4 IC´s die zusammen 512 KB ergeben. Die Conrad-
und B&uuml;rklin-Kataloge sind recht ern&uuml;chternd, was die Preise angeht.
</P>
<P>
War da nicht doch mal was mit 512 KB? Ja, die alte 512-KB-
Speichererweiterung des A500, bevor die 2-MB-Karte dazu kam! Nur, wo ist
die olle Karte??? Nachdem ich mein Zimmer auf den Kopf gestellt hatte, kam
die Karte endlich zum Vorschein. Nur muss ich jetzt erst mal wieder
aufr&auml;umen (schon wieder ;). Die 4 Speicherchips sind schnell ausgehebelt
und auf die Blizzard gesetzt.
</P>
<P>
So, der erste Testlauf kann losgehen! Rechner an! L&auml;uft! Juchu! :)
Schnell wird Kick 2.05, das ich vorher ausgelesen habe, mit dem
mitgelieferten Tool ins Shadow-RAM geladen. Schwupdiwup, Kick 2.05 ist drin
und l&auml;uft wunderbar! Der Speed ist erstaunlich. 1.48 Mips bringt die Karte
und ist damit um den Faktor 2.67-mal schneller als der Standard-A500! Aber
das Beste ist, man kann es auch abschalten!
</P>
<P>
Schnell surfe ich wieder im Internet und da f&auml;llt mir noch was ein!
Ja, ein 1-MB-Chipram-Agnus mu&szlig; her! Ein &quot;72a&quot; ist auch schnell aufgetrieben
und da die 2-MB-RAM-Erweiterung doch die Option bietet 512 KB als Chip-RAM
zu adressieren, wird der Agnus auch gleich eingebaut! Von der Gary-
Adapterplatine ein Jumper ins Geh&auml;use geschraubt, und schon kann ich von
512 KB auf 1024 KB Chip-RAM umschalten.
</P>
<P>
Gleich mal ein paar Spiele zocken... :( Oh je, bei Monkey Island 2 macht's
keinen Spa&szlig;, selbst mit 4 Floppys sind 11 Disketten einfach zuviel.
</P>
<P>
Aber Moment mal! Es gibt doch auch Festplattencontroller f&uuml;r den A500!
Also ins Netz und suchen! Schnell ist eine interne Karte gefunden, eine M-
Tec AT-500. Aber ob die noch reinpasst? Wie sieht die &uuml;berhaupt aus? Also
ab ins Archive. Ja, ein Testbericht ist auch schnell gefunden, allerdings
ohne Bild. Nur die Empfehlung der Redaktion usw. Eine Spitzenkarte, aber
kein Bild! Also weitergesucht, irgendwo mu&szlig; die doch auch beworben worden
sein :(. Ja, und endlich ein Bild :). Die Platine ist klein und sehr flach,
ob das wohl pa&szlig;t? Ich wage es und bestelle mir die Karte, denn bei 37 DM
kann man nicht viel falsch machen (Karte ist nat&uuml;rlich eine gebrauchte)!
Fr&uuml;her war die viel teurer!
</P>
<P>
Und ganz schnell ist die Karte da, aber wie &uuml;blich habe ich keine Zeit,
also vergeht noch eine Weile, bis das gro&szlig;e Krabbeln ...&auml;&auml;&auml;h Basteln
anf&auml;ngt. ;)
</P>
<P>
Es ist Samstag morgen. Ein perfekter Tag zum Basteln :) A500 raus und
aufgeschraubt! Wie baue ich das Teil jetzt ein? Auf oder unter die
Blizzard? Ich versuche es zuerst auf der Blizzard, da es besser aussieht.
Was sich leider als Fehler herausstellt! Nicht alles, was auf den ersten
Blick gut aussieht, funktioniert auch! Meine erste Bef&uuml;rchtung war, dass
durch den Takt von 14Mhz, der von der Blizzard kommt, der Controller nicht
mehr funktioniert, aber das ist nicht der Fall. Statt dessen funktioniert
der Speicher auf der Blizzard nicht mehr! Argh...! Also erstmal beiseite
damit, denn es ist noch ein Problem aufgetreten! Mit Kick 1.2 laufen weder
1MB-Chip-RAM noch die Festplatte. Und Kick 2.05 einzubauen ist auch nicht
der Hit, denn dann w&uuml;rden die ganz alten Spiele nicht mehr laufen! Also mu&szlig;
Kick 1.3 her. Bei dieser Gelegenheit f&auml;llt mein Blick im Internet auch auf
eine Umschaltplatine mit Flachbandkabel!
</P>
<P>
Mit Hilfe des Flachbandkabels sollte die Umschaltplatine weit genug weg
sein, um nicht mehr zu st&ouml;ren. Also wird die gleich bestellt. 18 DM mit
Kick 1.3 ist ein noch annehmbarer Preis. Das n&auml;chste Wochenende naht und
der A500 wird wieder zum Basteln rausgeholt. Umschaltplatine rein, Kick
2.05 noch mit drauf. Was angesichts der Kabel, die am Kick 2.05 baumeln,
nicht ganz so einfach ist, das ist so ein Adressen-Problem, soweit ich
wei&szlig;. Also alles eingebaut und diesmal erst den Controller und darauf die
Blizzard montiert. STROM EIN! Nix.. :( Na klar! Das Netzteil heult so
komisch... Zum Gl&uuml;ck hat ich noch eins vom A1200 &uuml;brig! Also rangest&ouml;pselt
und los!
</P>
<P>
Guru! H&auml;&auml;&auml;? Guru? Wie? Was? Wo? Wieso? Also auf Kick 2.05 geschaltet.
Wieder Guru! M***, was kann das sein? Inkompatibel, geht durch meinen Kopf.
Nein, das darf nicht sein! Nicht jetzt, wo ich schon soweit bin! Also
wieder alles raus und einzeln noch mal getestet. Aha! Der IDE-Controller
baut diesen M***! Ja, und da f&auml;llt es mir wie Schuppen von den Augen! Denn
auf der angeschlossenen Festplatte, die fr&uuml;her einmal im A1200 war (2.5&quot;
170MB), ist als Dateisystem SFS installiert und dazu noch die 020-Version,
glaube ich. Kann ja nicht gehen! Also noch mal alles einbauen, mit Kick
2.05 starten, ins Boot-Men&uuml; und Festplatte abschalten. Aaah, er bootet von
Disk! Gut, also Festplatte formatieren, OFS als Dateisystem installieren
und noch mal testen. L&Auml;UFT!!! Juchu! :) So was hat man gerne! Jetzt hab ich
14 MHz Power und Festplatte und 1 MB Chip-RAM und das alles voll schaltbar!
So kann ich auch die superalten Spiele wieder spielen. Das nenne ich 100%
kompatibel!
</P>
<P>
Doch Moment mal! Das Abschirmblech pa&szlig;t nicht mehr drauf! Ach egal dann
eben ohne, doch die Tastatur pa&szlig;t auch nicht mehr. Ist einfach zu hoch
geworden bei diesem Sandwich-Bau! Aber es sind doch nur ein paar
Millimeter! Wie bekomme ich das runter? Ich wei&szlig;, den Abstandssockel
entfernen und noch mal versuchen! Pa&szlig;t immer noch nicht, da sind ein paar
Kondensatoren im Weg. Aber man ist ja inzwischen gebildet und hat einen
L&ouml;tkolben im Haus. Ausgel&ouml;tet und flach wieder rein! M***, pa&szlig;t immer noch
nicht, denn jetzt h&auml;ngt er sich auf dem Flachbandkabel von der
Umschaltplatine auf. Genau gesagt auf dem Stecker, der im ROM-Sockel sitzt!
He, den brauch ich doch sowieso nicht! Also den ROM-Sockel ausgel&ouml;tet und
den Sockel vom Flachbandkabel eingel&ouml;tet. So, jetzt mu&szlig; es aber passen! Und
tats&auml;chlich, der Deckel geht zu. Ob auch das Abschirmblech pa&szlig;t? Also
versuche ich es drauf zu schrauben und es pa&szlig;t tats&auml;chlich gerade noch.
Zus&auml;tzlich h&auml;lt es dieses Sandwich sogar fest im Sockel. Und auf dem
Abschirmblech wird jetzt auch noch fix per doppelseitigem Klebeband die
Festplatte aufgeklebt! Zugeschraubt und wow: Alles drin und l&auml;uft!
</P>
<P>
Ach, da fehlt doch immer noch etwas! Ja, genau, die Festplatten-LED! Also
Bohrmaschine raus und ein Loch gebohrt. LED eingeklebt und mit dem IDE-
Controller verbunden. Erst leuchtet nix...! Klar, weil falsch rum! So,
jetzt geht's aber! Jetzt bin ich gl&uuml;cklich. :) Es hat zwar lange gedauert,
bis ich mir das Alles leisten konnte und es ist nicht gerade top-aktuell
oder so was, aber es ist mein! Noch mal zur &Uuml;bersicht: Amiga 500 rev. 5 mit
&quot;Blizzard Turbo Memory Board&quot; 68000/14 MHz + 3 MB Fast-Ram + 512 KB Shadow-
RAM, M-Tec AT-500 IDE-Controller mit einer 2.5&quot; 170 MB Festplatte, einen
&quot;Fatter Agnus 72a&quot;, der per Schalter zwischen 512 KB und 1024 KB
umgeschaltet werden kann, eine Kickstart Umschaltplatine mit Flachbandkabel
best&uuml;ckt mit Kick 1.3 und 2.05, eine 2 MB Slow-RAM-
Speichererweiterungskarte, nat&uuml;rlich auch abschaltbar.
</P>
<P>
Jetzt fehlt eigentlich nur noch eine interne Flicker-Fixer Karte. Denn die
w&uuml;rde gerade noch reinpassen! Dann ist aber Schlu&szlig;! ;) Ach ja, der
Controller bringt an der Festplatte reichlich 1.4 MB/s, was doch recht gut
sein d&uuml;rfte. Mit einer guten Cache-Einstellung sind bestimmt noch ein paar
Kilobyte mehr rauszuholen. Das Einzige was mich noch st&ouml;rt ist, dass das
externe &quot;Action Replay MK3&quot;-Modul sich ab Adresse 400.0000 einbindet. Wenn
man jetzt sieht, dass der Speicher auf der Blizzard den Adressbereich von
200.0000 bis 4ff.ffff belegt, kann man sich schon vorstellen was passiert,
wenn man dieses Modul aktiviert! Guru-Guru-Guru! Aber man kann den Speicher
ja zum Gl&uuml;ck auf der Blizzard abschalten. Dann l&auml;uft auch dieses Modul
wieder. :)
</P>
<P>
Happy Hacking! Auf dieser Maschine schafft man mit den rc5 des Clients
locker 1000 keys/s.
</P>
<P>
Ich hoffe diese kleine Story hat euch gefallen. Sollte jemand versuchen es
nachzumachen und an einer Stelle nicht wissen, wie es weiter geht, dann
melde er sich bei mir ;) Und sollte mir jemand nicht glauben, dem schicke
ich ihm gerne einen SysInfo-Ausdruck. =)
</P>
<P><B>Dirk Wenk &lt;<A HREF="mailto:dw@teleservice.com">dw@teleservice.com</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
