<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>BLINDzeln - Infomail</TITLE>
  </HEAD>

  <BODY background="bga.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size= "7"><B>BLINDzeln -
          Infomail</B></FONT></P>

          <P>Huhu und Willkommen mal wieder zu einem reich gef&uuml;llten Newsletter
          von BLINDzeln.</P>

          <P>Es gibt wieder viel Neues, von dem wir Euch berichten m&ouml;chten und
          auch m&uuml;ssen - nehmt Euch also bitte etwas Zeit f&uuml;r diesen Text
          und eine gute Tasse Kaffee, Tee oder Cappuchino....</P>

          <A name="top"></A>

          <H3>Inhalt:</H3>

          <UL>

          <LI><A href="#a01">1.0 BLINDzeln Statistiken</A></LI>

          <LI><A href="#a02">2.0 Neue BLINDzeln-Foren im September</A></LI>

          <LI><A href="#a03">2.1 Politikforum bei BLINDzeln</A></LI>

          <LI><A href="#a04">3.0 Neue Homepage nimmt Gestalt an</A></LI>

          <LI><A href="#a05">3.1 Kleinanzeigen bei BLINDzeln</A></LI>

          <LI><A href="#a06">3.2 Neue Loginbereiche f&uuml;r die
          Kurzvorstellungen</A></LI>

          <LI><A href="#a07">4.0 Neue BLINDzeln Chat-R&auml;ume</A></LI>

          <LI><A href="#a08">4.1 Unsere Themenchats</A></LI>

          <LI><A href="#a09">4.2 Chat allgemein</A></LI>

          <LI><A href="#a10">5.0 Jobs bei BLINDzeln</A></LI>

          <LI><A href="#a11">6.0 AS-NEWS erschienen</A></LI>

          <LI><A href="#a12">6.1 Werbung f&uuml;r fremde Mailinglisten</A></LI>

          <LI><A href="#a13">7.0 Unser kostenloses Online-Magazin, die
          NoCover</A></LI>

          <LI><A href="#a14">8.0 Flyeraktion</A></LI>

          <LI><A href="#a15">9.0 Wichtiges zum Urheberrecht</A></LI>

          <LI><A href="#a16">9.9 Verabschiedung</A></LI>
          </UL>
          <HR>
          <A name="a01"></A> 

          <H3>1.0 BLINDzeln Statistiken</H3>

          <P>Unser Server AS2-Detroit steuert stramm auf die 1500 EMailaccounts zu,
          die durch unser Mailinglistensystem beliefert werden. Aktuell sind es....
          "User insgesammt: 1475" - da nat&uuml;rlich Manch einer in mehreren Listen
          vertreten ist, ist die Anzahl an Empf&auml;ngern: 733</P>

          <P>Unsere Homepage www.BLINDzeln.de wurde 4308 mal besucht, was nach
          unserer fertigen &Uuml;berarbeitung sich sicher schnell steigern wird. Am
          h&auml;ufigsten finden uns die Besucher unserer Homepage &uuml;ber die
          Suchmaschine Google. Der deutlich gr&ouml;&szlig;te Teil unserer Besucher
          ist mit WindowsXP und dem InternetExplorer 6.0 unterwegs.</P>

          <P>Es gibt derzeit 19 Foren bei BLINDzeln. Im September sind
          hinzugekommen:</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a02"></A> 

          <H3>2.0 Neue BLINDzeln-Foren im September</H3>

          <P><B>Forum 017 [OHP]</B> gestartet am 04. September 2003 Die offene
          Hilfsmittelplattform [OHP] ist die offene Hilfsmittelplattform bei
          BLINDzeln und richtet sich an Anwender von Hilfsmitteln f&uuml;r Blinde,
          Sehbehinderte und andere BLINDzler. Auch Hilfsmittelfirmen,
          Kostentr&auml;ger und alle Interessenten sind herzlich zum
          Gedankenaustausch in [OHP] eingeladen. Inhaltliche Moderation: Christine
          Kahlert Direkte Homepage: http://ohp.blindzeln.de Anmeldung an [OHP]:
          ohp-subscribe@blindzeln.net</P>

          <P><B>Forum 018 [BITMASCHINE]</B> gestartet am 10. September 2003 Das Forum
          f&uuml;r Programmierer und fortgeschrittene Anwender Hier wird diskutiert,
          wie man verwirrte Bits und Bytes wieder auf den richtigen Weg bringt.
          Fragen zu Programmiersprachen, Datenbanken, Internetprogrammierung und
          sonstigen Problemquellen werden in der [BITMASCHINE] besprochen, bis der
          Sourcecode wieder stimmt. Dieses Forum wendet sich an fortgeschrittene
          Anwender und Programmierer. Inhaltliche Moderation: Andreas Alexander,
          Michael Ziegler und Dirk Zemisch Direkte Homepage:
          http://bitmaschine.blindzeln.de Anmeldung an [BITMASCHINE]:
          bitmaschine-subscribe@blindzeln.net</P>

          <P><B>Forum 019 [SCHATTENWELT]</B> gestartet am 20. September 2003 Die
          andere Seite ist dunkel, bist Du es auch? Komm zu uns in die
          [SCHATTENWELT], - eine Welt f&uuml;r Menschen, die es gern d&uuml;ster
          m&ouml;gen. Hier treffen sich Gothicfreunde, um sich &uuml;ber alles zu
          unterhalten, was irgendwie "schwarz" ist. Ob Musik, Klamotten, Schmuck bis
          hin zur kompletten Lebenseinstellung. Du bist anders? Dann geh&ouml;rst
          auch Du in die [SCHATTENWELT].... Inhaltliche Moderation: Michael Ziegler
          Direkte Homepage: http://schattenwelt.blindzeln.de Anmeldung an
          [SCHATTENWELT]: schattenwelt-subscribe@blindzeln.net</P>

          <P>Die n&auml;chsten Foren sind bereits in Arbeit und werden wahrscheinlich
          in den kommenden Tagen zur Verf&uuml;gung stehen und auf Euch warten. Wenn
          Euch eines der obigen neuen Foren interessiert, freuen sich die Moderatoren
          auf Eure Anmeldung.</P>

          <P>Holt Euch hin und wieder auch mal einen aktuellen Forenindex, - der wird
          st&auml;ndig aktualisiert und ist per EMail jederzeit abrufbar. Einfach
          eine leere EMail schicken an:<BR>
          <B>forenindex@blindzeln.de</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a03"></A> 

          <H3>2.1 Politikforum bei BLINDzeln</H3>

          <P>Wir planen sehr kurzfristig ein neues Forum zum Thema
          Politik. Hierf&uuml;r suchen wir noch einen pfiffigen
          Namen, - wer Vorschl&auml;ge hat, m&ouml;ge sie uns bitte
          mitteilen. Auch Moderatoren werden hierf&uuml;r noch
          gesucht, - dazu erfahrt Ihr aber mehr im Punkt 5.0 dieses
          Newsletters.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a04"></A> 

          <H3>3.0 Neue Homepage nimmt Gestalt an</H3>

          <P>Wer regelm&auml;&szlig;ig unsere Homepage www.BLINDzeln.de besucht, wird
          es sicherlich schon bemerkt haben, - wir basteln nahezu t&auml;glich an
          unserer neuen Homepage herum. Viel haben wir geplant und &uuml;berlegt und
          ein komplett eigenes Grundger&uuml;st gebaut, das recht schnell mit neuen
          Inhalten zu f&uuml;llen ist. Wir verf&uuml;gen &uuml;ber ein eigenes
          Redaktionssystem, um sehr schnell Artikel online stellen zu k&ouml;nnen und
          auch jederzeit abzu&auml;ndern. Auch das Design der kompletten Homepage ist
          sofort durch wenige Eintr&auml;ge &auml;nderbar.</P>

          <P>Ein dickes Dankesch&ouml;n geht hierbei an Michael Ziegler (den Meisten
          als Ziegel bekannt) der sich in den letzten Wochen viel von mir gefallen
          lassen musste, bis BLINDzeln etwa so aussah, wie ich das schon seit Monaten
          im Kopf habe. :-) - Schaut Euch die noch nicht fertige Homepage ruhig
          schonmal an. Anhand der Links k&ouml;nnt Ihr teilweise schon erahnen, was
          wir dort alles geplant haben.</P>

          <P>&Uuml;berseht dabei bitte noch die Schreibfehler in den Texten und
          einige unfertige Seiten. Das wird sich alles in n&auml;chster Zeit erledigt
          haben und dann k&ouml;nnen wir auch auf unsere Homepage etwas stolzer
          sein.</P>

          <P>Ich erkl&auml;re Euch kurz die einzelnen Links unserer Homepage....</P>

          <P><B>[Start]</B> - egal, wo Ihr Euch auf der Homepage befindet, - hier
          kommt Ihr immer sofort zur&uuml;ck auf die Startseite. Hier findet Ihr auch
          einen Webring, der Euch auf andere interessante Internetseiten schicken
          kann</P>

          <P><B>[Informationen]</B> - in diesem Bereich werden wir fremden Besuchern
          versuchen zu erkl&auml;ren, was BLINDzeln ist und was unsere Ziele
          sind.</P>

          <P><B>[Chat]</B> - Hier geht es &uuml;ber unsere Homepage zum
          BLINDzeln-Chat. Es wird dazu ein Java-VM ben&ouml;tigt, das im Normalfall
          automatisch geladen wird, wenn man den Chatraum betreten m&ouml;chte.
          Eventuell kommt noch eine Definitionswarnung, die man noch best&auml;tigen
          muss - ein beherzter Druck auf die Entertaste gen&uuml;gt. Die meisten
          Screenreader k&ouml;nnen diese Meldung leider nicht auslesen, also einfach
          die Entertaste dr&uuml;cken. Modemnutzer mit 56kbit in der Sekunde
          m&uuml;ssen sich zudem etwas gedulden, bis das Java-VM vollst&auml;ndig
          geladen wurde. Der Chat selbst ben&ouml;tigt keine schnellen Modems, -da
          reicht selbst das &auml;lteste Modem noch, welches Ihr auf dem Dachboden
          finden k&ouml;nnt. Wir empfehlen aber ganz klar das von uns
          vorkonfigurierte Programm "MIRC", mit dem es sich deutlich bequehmer
          chatten l&auml;sst. Zum Chat findet Ihr in diesem Newsletter noch weitere
          Infos.</P>

          <P><B>[News]</B> - Hier findet Ihr s&auml;mtliche Neuigkeiten von und
          &uuml;ber BLINDzeln und andere Themen. Auch die per EMail versendeten
          Newsletter k&ouml;nnen dort jederzeit nachgelesen werden.
          Dar&uuml;berhinaus findet Ihr dort weitere Neuigkeiten, die Ihr nicht per
          EMail bekommt.</P>

          <P><B>[Forenindex]</B> - Unseren stets aktuellen Forenindex, den Ihr Euch
          zu jedem Zeitpunkt per EMail schicken lassen k&ouml;nnt, kennt Ihr ja
          schon. Aber auch auf unserer Homepage k&ouml;nnt Ihr Euch jetzt schnell und
          einfach &uuml;ber alle verf&uuml;gbare Foren informieren und von dort zur
          Forenhomepage gelangen.</P>

          <P><B>[Download]</B> - Unsere Downloadbereiche sind vorerst komplett offen,
          also auch ohne Passwort sofort nutzbar. Jedes Forum beinhaltet ja auch
          einen eigenen Downloadbereich. Es wird sicherlich erst nach und nach eine
          interessante Sammlung entstehen.</P>

          <P><B>[Faq]</B> - Fragen und Antworten gibt es nat&uuml;rlich auch bei
          BLINDzeln. Hier findet Ihr sie....</P>

          <P><B>[Links]</B> - Unsere Linksammlung soll thematisch sehr strukturiert
          und selektiert sein. Hier brauchen wir auch Eure Hilfe, damit wir
          interessante Internetseiten empfehlen k&ouml;nnen.</P>

          <P><B>[Kleinanzeigen]</B> - Hier k&ouml;nnt Ihr Kleinanzeigen selbst
          eintragen. Haltet Euch aber bitte an Gesetze und gute Sitten.
          Selbstverst&auml;ndlich ist der Kleinanzeigenmarkt kostenlos.</P>

          <P><B>[Kurzvorstellungen]</B> - Die Kurzvorstellungen der BLINDzler
          erm&ouml;glichen ein erstes Kennenlernen der Anderen. Dieser Bereich ist
          passwortgesch&uuml;tzt und Zugang erhalten nur solche BLINDzler, die sich
          selbst hier vorstellen.</P>

          <P><B>[G&auml;stebuch]</B> - Vorerst werden wir es mit einem G&auml;stebuch
          auf unserer Homepage versuchen. Wird dieses aber wie sooft f&uuml;r Werbung
          und Beleidigungen missbraucht, wird es sicherlich auch schnell wieder
          verschwunden sein. Ansonsten freuen wir uns &uuml;ber Eintr&auml;ge.</P>

          <P><B>[Jobs]</B> - Es gibt jederzeit und st&auml;ndig so viel zutun bei
          BLINDzeln - ohne Hilfe vieler Menschen geht es nicht. Wenn Du uns gern
          aktiv helfen m&ouml;chtest, findest Du hier erste Informationen, wo wir am
          dringensten Hilfe gebrauchen k&ouml;nnen.</P>

          <P><B>[Presse]</B> - sowohl die wichtigsten Daten f&uuml;r Redakteure, als
          auch ver&ouml;ffentlichte Artikel &uuml;ber BLINDzeln finden hier
          Ver&ouml;ffentlichung auf der Homepage.</P>

          <P><B>[Haftungsausschluss]</B> - Rechtlich wichtige Hinweise zu
          BLINDzeln.</P>

          <P><B>[Impressum]</B> - Unsere Kontaktadresse und wer ist wof&uuml;r
          verantwortlich?</P>

          <P><B>[Admin]</B> - &uuml;ber den Adminbereich bearbeiten wir unsere
          Homepage und f&uuml;llen sie hoffentlich bald mit vielen interessanten
          Informationen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a05"></A> 

          <H3>3.1 Kleinanzeigen bei BLINDzeln</H3>

          <P>Ab sofort steht Euch der Kleinanzeigenmarkt auf unserer Homepage
          kostenlos zur Verf&uuml;gung. Ihr k&ouml;nnt dort beliebig Euer Hab und Gut
          anbieten, oder auch Gesuche eintragen. Blindzeln &uuml;bernimmt
          selbstverst&auml;ndlich keine Verantwortung f&uuml;r die angebotene Ware,
          Bilder Text und Links. Die IP-Nummern werden &uuml;brigens mit
          aufgezeichnet, wer also meint, sich mit dem Service einen
          vergn&uuml;glichen Abend machen zu m&uuml;ssen, sollte zumindest mit
          &Auml;rger rechnen, wenn es uns zu dumm wird. Nutzt also bitte den
          Kleinanzeigenservice t&uuml;chtig - aber macht ihn nicht kaputt, indem Ihr
          absichtlich Artikel anbietet, die nicht verkauft werden d&uuml;rfen. Das
          ist alles, was gegen Gesetze verst&ouml;&szlig;t. Eure gro&szlig;artige
          MP3-Sammlung oder sonstige Sicherheitskopien solltet Ihr zu Eurer eigenen
          Sicherheit dort also lieber nicht anbieten.</P>

          <P>Gewerbliche Kleinanzeigen d&uuml;rfen ausschliesslich mit schriftlicher
          Genehmigung von BLINDzeln / C. Hagen hier ver&ouml;ffentlicht werden!</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a06"></A> 

          <H3>3.2 Neue Loginbereiche f&uuml;r die Kurzvorstellungen</H3>

          <P>Aus Sicherheitsgr&uuml;nden haben wir den Zugang zum Bereich der
          Kurzvorstellungen ge&auml;ndert. Bislang war dies ja ein einheitlicher, um
          die Arbeit so gering wie m&ouml;glich zu halten. Allerdings sind uns in
          letzter Zeit Zweifel gekommen, ob dieser allgemeing&uuml;ltige Zugang
          f&uuml;r Eure Sicherheit noch gen&uuml;gt. Deshalb ist die Art der
          Zug&auml;nge nun von allgemein zu separat ge&auml;ndert worden.</P>

          <P>Da das Anlegen der Zug&auml;nge sehr zeitaufwendig war, haben darunter
          einige von Euch insofern leiden m&uuml;ssen, dass sie noch immer keine
          Zugangsdaten bekommen haben, obgleich sie teilweise schon einige Zeit in
          den Kurzvorstellungen erfasst sind. Daf&uuml;r bitten wir vielmals um
          Entschuldigung!</P>

          <P>Mit der n&auml;chsten Mail bekommt jeder von Euch eine individuelle
          Nachricht mit seinen Zugangsdaten von Nathalie zugeschickt. Diese gelten ab
          sofort, k&ouml;nnen von Euch jedoch N U R f&uuml;r den Bereich der
          Kurzvorstellungen benutzt werden.</P>

          <P>Wir bitten Euch, falls Ihr Euch als BLINDzler komplett abgemeldet habt,
          Nathalie dies mitzuteilen. Der Bereich der Kurzvorstellungen w&auml;re
          sonst irgendwann schutzlos trotz Passwortschutz, da auch Ehemalige
          ansonsten noch Zugriff h&auml;tten. Diese Bitte erfolgt im Namen aller
          BLINDzler, um ihre Privatsph&auml;re vor Missbrauch zu sch&uuml;tzen!</P>

          <P>Wir danken Euch f&uuml;r Euer Verst&auml;ndnis! (Nathalie Sorichter,
          Verwaltung des Bereiches Kurzvorstellungen)</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a07"></A> 

          <H3>4.0 BLINDzeln Chat-R&auml;ume</H3>

          <P>Wir haben unseren Chat erweitert, damit Ihr Euch noch
          gezielter zu bestimmten Themen zur&uuml;ckziehen
          k&ouml;nnt. Nachdem Ihr Euch erfolgreich &uuml;ber "MIRC"
          oder unsere Homepage eingeloggt habt, k&ouml;nnt Ihr mit
          dem Befehl /join #raumname in die unterschiedlichen
          Chatr&auml;ume wechseln.</P>

          <P>Derzeit haben wir bei BLINDzeln die R&auml;ume:

          <DL>
            <DT><B>#orakel</B></DT>

            <DD>- allgemeine Fragen rund um PC, Internet und Co.</DD>

            <DD><BR></DD>

            <DT><B>#waschweib</B></DT>

            <DD>- Tratsch und Klatsch - jetzt wird auch hier schmutzige W&auml;sche
            gewaschen.</DD>

            <DD><BR> </DD>

            <DT><B>#gothic</B></DT>

            <DD>- passend zu unserem neuen Forum [SCHATTENWELT] trifft sich hier alles
            D&uuml;stere.</DD>

            <DD><BR> </DD>

            <DT><B>#bitmaschine</B></DT>

            <DD>- hier treffen sich Programmierer, Entwickler und fortgeschrittene
            Anwender zum Fachsimpeln.</DD>
          </DL>
          </P>
          
          <P>Weitere Chatr&auml;ume befinden sich in Planung....</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a08"></A> 

          <H3>4.1 Unsere Themenchats</H3>

          <P>Neben dem &uuml;blichen drauflos Chatten bieten wir jeden Donnerstag ab
          20 Uhr und jeden Sonntag ab 16 Uhr Themenchats an. Das Thema f&uuml;r den
          jeweiligen Tag entnehmt Ihr bitte der Tabelle auf unserer Homepage im
          Bereich [Chat]. Zudem werden wir auch kurz zuvor in den betreffenden
          Mailinglisten noch an den aktuellen Themenchat erinnern. Wir suchen
          hierf&uuml;r auch dringend noch flei&szlig;ige Helfer, - dazu im
          n&auml;chsten Punkt unseres Newsletters mehr....</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a09"></A> 

          <H3>4.2 Chat allgemein</H3>

          <P>Bitte kommt uns doch ruhig alle mal im Chat besuchen. Es gibt ehrlich
          keinen Grund, sich hier&uuml;ber Gedanken &uuml;ber n&ouml;tige Technik
          oder Fachkenntnisse zu machen. Am Chat kann wirklich Jeder sehr einfach
          teilnehmen und Spa&szlig; macht es au&szlig;erdem. Wir haben unseren
          BLINDzelnchat basierend auf das IRC-System aufgebaut. IRC gibt es schon
          &uuml;ber ein Jahrzehnt und entsprechend geringe Hardwareanforderung setzt
          es voraus! Selbst mit Euren &auml;ltesten und langsamsten Modems k&ouml;nnt
          Ihr v&ouml;llig problemlos am Chat teilnehmen. Alles was Ihr dazu
          ben&ouml;tigt, ist ein beliebiges Modem und das Programm MIRC, welches wir
          &uuml;ber unsere Homepage im Bereich "Chat" zum Download vorkonfiguriert
          bereit stellen. Dieses von uns fertig konfigurierte Programm braucht Ihr
          nicht einmal installieren und es l&auml;uft auf jeder Windows-Version.
          Einfach die heruntergeladene Datei ausf&uuml;hren, die sich dadurch selbst
          entpackt. Dann im entpackten Verzeichnis nur noch MIRC.EXE starten und
          wenige Sekunden sp&auml;ter seit Ihr bereits mitten bei uns im Chatraum.
          Eine detailierte Anleitung findet Ihr ebenfalls auf der Homepage.</P>

          <P>Solltet Ihr dennoch Hilfe ben&ouml;tigen, schreibt einfach eine EMail
          an:<BR>
          <B>chathilfe@blindzeln.de</B><BR>
          und wir helfen Euch schnell und leichtverst&auml;ndlich.</P>

          <P>Wir w&uuml;rden Euch gern im Chat kennenlernen und freuen uns daher
          wirklich sehr &uuml;ber jedes neue virtuelle Gesicht. Seit also ehrlich
          ganz Herzlich Willkommen.</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a10"></A> 

          <H3>5.0 Jobs bei BLINDzeln</H3>

          <P>Wir brauchen dringend Verst&auml;rkung - Jawoll, wir brauchen Dich!
          BLINDzeln w&auml;chst und w&auml;chst und so muss auch unser Team
          ausreichend mitwachsen.</P>

          <P>Wir suchen dringend.... </P>

          <H3>F&uuml;r unser Onlinemagazin NoCover:</H3>

          <P><B>- Redakteur / in</B><BR>
          Freie Redakteure, die einfach gerne themenfrei Artikel schreiben
          m&ouml;chten. Ihr k&ouml;nnt Euch selbst aussuchen, wor&uuml;ber Ihr
          schreiben m&ouml;chtet und wir erwarten auch keine Profis. Wer Lust hat
          einfach zu schreiben und an einem Magazin mitzuwirken, das viele Sehende
          und blinde Menschen monatlich per Abo direkt in Ihre Emailpostf&auml;cher
          geliefert bekommen, ist uns sehr willkommen. Die NoCover gibt es schon seit
          rund 115 Ausgaben. Wer kurz rechnet, wird feststellen, dass es die NoCover
          somit schon beinahe seit einem ganzen Jahrzehnt gibt. Viele Redakteure
          haben in der NoCover aus einem Hobby heraus angefangen zu schreiben und
          arbeiten mittlerweile bei kleinen Verlagen. Wer also Lust und ein Kribbeln
          in seinen Fingern versp&uuml;rt, m&ouml;ge sich bitte an unsere Redaktion
          der NoCover wenden. Per EMail erreicht Ihr den Wolf Zimmer -
          Hauptverantwortlicher der NoCover unter:<BR>
          <B>wolf@blindzeln.de</B></P>

          <P><B>- Redaktions-Assistent / in</B><BR>
          Ebenfalls f&uuml;r die NoCover ben&ouml;tigen wir noch Hilfe bei der
          Selektion der eingehenden Artikel. Uns erreicht oft sehr viel Material, das
          dann nach Tauglichkeit zur Ver&ouml;ffentlichung im Magazin selektiert
          werden muss. Man sollte alle Texte schnell durchlesen k&ouml;nnen und
          besonders sch&ouml;n w&auml;re es, wenn man offensichtliche und grobe
          Schreibfehler dabei bereits korrigiert.</P>

          <P>Auch bei Interesse hieran wendet Ihr Euch bitte gleich gezielt an Wolf
          Zimmer....<BR>
          <B>wolf@blindzeln.de</B></P>

          <P><B>- OPs f&uuml;r Themenchats</B><BR>
          F&uuml;r unsere Themenchats suchen wir Operators. Ihr solltet schon etwas
          Kenntnisse im Umgang mit dem Chat und insbesondere dem IRC mitbringen, da
          Ihr als Systemoperatoren in den Chatr&auml;umen arbeitet. So bereitet Ihr
          zun&auml;chst ein Thema vor, infomiert dann &uuml;ber Thema und Chattermin
          kurz in den betreffenden BLINDzel-Foren und erinnert auch am Tag des
          Chattermins nocheinmal daran. Dann &uuml;bernehmt Ihr die Aufsicht der
          betreffenden Chatr&auml;ume, helft den BLINDzlern bei eventuellen
          Schwierigkeiten im Chat und greift bei Streitigkeiten ein.
          Selbstverst&auml;ndlich weisen wir Euch in Alles nachvollziehbar ein. Je
          mehr Kenntnisse Ihr aber bereits mitbringt, desto besser. Wir
          ben&ouml;tigen f&uuml;r jeden Themenchat mehrere OPs, so dass es
          sp&auml;ter auch kein Problem sein soll, wenn Ihr mal selbst einen Termin
          nicht einhalten k&ouml;nnt.</P>

          <P>Meldet Euch bitte bei Interesse mit einer EMail an:<BR>
          <B>op@blindzeln.de</B></P>

          <P><B>- Moderator / in</B><BR>
          Wie immer suchen wir weitere Verst&auml;rkung f&uuml;r unser
          Moderatorenteam. So brauchen wir zus&auml;tzliche Moderatoren f&uuml;r
          unsere Foren:

          <UL>
            <LI>ECHO</LI>

            <LI>PINGUIN</LI>

            <LI>BRANDMAUER</LI>

            <LI>GAMEPORT</LI>

            <LI>SCHATTENWELT</LI>
          </UL>
          </P>

          <P>Und mindestens eine Moderatorin oder einen Moderator f&uuml;r unser
          geplantes politisches Forum (siehe hierzu auch Punkt 2.1 dieses
          Newsletters).</P>

          <P>Auch wenn Euch die Themen dieser Foren noch nicht so sehr interessieren,
          so meldet Euch dennoch schonmal, wenn Ihr gern ein Forum moderieren
          w&uuml;rdet, - wir haben noch weitere zehn neue Foren in Planung und suchen
          st&auml;ndig neue Helfer.</P>

          <P>Die Aufgaben einer inhaltlichen Moderation bei BLINDzeln bestehen darin,
          ein Forum lebendig zu halten. Wenn sich also l&auml;ngere Zeit in einem
          BLINDzelforum nichts tut, sollte ein iMOD (inhaltlicher Moderator)
          versuchen, das Forum wieder in Gang zu bringen. So kann man beispielsweise
          neue Themen zur Diskussion vorschlagen oder zum Forenthema passende
          Beitr&auml;ge aus dem Internet suchen und in das Forum einstellen. Sollten
          sich Streitereien in einem Forum anbahnen, sollte man als iMOD dem sensibel
          entgegenwirken. Dar&uuml;berhinaus sollten iMODs von BLINDzeln Material zum
          Thema sammeln, damit wir f&uuml;r jedes Forum auch eine eigene kleine und
          interessante Homepage erstellen k&ouml;nnen. Diese Aufgaben kann man sich
          mit weiteren inhaltlichen Moderatoren auch gerne teilen. Unterst&uuml;tzt
          wird man zus&auml;tzlich durch die tMODs (technische Moderatoren), die die
          eigentliche Moderation und Bedienung unseres Mailinglistensystems
          &uuml;bernehmen. So k&ouml;nnen sich iMODs komplett auf ihre inhaltlichen
          Aufgaben konzentrieren. Mit diesen Aufgaben wird bei uns niemals jemand
          alleine gelassen - wir arbeiten Alle zusammen als einheitliches Team und
          planen auch zusammen am Gesamtprojekt BLINDzeln.</P>

          <P>Wenn Du auch gerne aktiv bei BLINDzeln helfen m&ouml;chtest und eine
          Moderation &uuml;bernehmen m&ouml;chtest, dann melde Dich bitte bei
          uns....<BR>
          <B>job@blindzeln.de</B></P>

          <P><B>- Link-Administrator / in</B><BR>
          Zur Unterst&uuml;tzung von Haralds Linksammlung f&uuml;r unsere Homepage
          suchen wir ganz dringend noch BLINDzler, die mithelfen m&ouml;chten,
          interessante Internetseiten zu katalogisieren. Wir haben hierzu ein
          Redaktionssystem, in das man die Kategorie w&auml;hlt, und Namen,
          Internetadresse und Kurzbeschreibung eintr&auml;gt. Wir m&ouml;chten eine
          recht umfangreiche Sammlung empfehlenswerter Internetseiten
          zusammenstellen. Auch hierf&uuml;r k&ouml;nnt Ihr Euch an die
          Adresse....<BR>
          <B>job@blindzeln.de</B><BR>
          ....wenden.</P>

          <P><B>- Text-Translator / in</B><BR>
          da wir mittlerweile BLINDzler wirklich aus aller Welt haben, m&ouml;chten
          wir unsere Homepage gern mehrsprachig planen. Hier liegt uns zun&auml;chst
          nat&uuml;rlich eine englische Version im Sinn, aber auch andere Sprachen
          werden wir gern mit anbieten. Daf&uuml;r suchen wir noch BLINDzler, die
          unsere deutschen Texte in andere Sprachen &uuml;bersetzen m&ouml;chten. Es
          geht lediglich um die generellen Informationen zu BLINDzeln, - also nicht
          um alle Texte. Bitte wende Dich bei Hilfsbereitschaft an....<BR>
          <B>job@blindzeln.de</B></P>

          <P>Wir werden st&auml;ndig weitere Hilfe brauchen. Wenn Du uns generell
          gerne helfen m&ouml;chtest, - hier aber noch nicht das Passende f&uuml;r
          Dich dabei war, dann besuche bitte regelm&auml;&szlig;ig unsere Homepage
          www.BLINDzeln.de im Bereich [Jobs].... wr freuen uns &uuml;ber Deine
          Hilfe!</P>

          <P>Es sei noch angemerkt, dass BLINDzeln nat&uuml;rlich ein nicht
          kommerzielles Projekt ist und man bei uns vielleicht Ruhm, jedoch ganz
          sicher kein Reichtum erwarten kann. Alle aktiven BLINDzler arbeiten
          selbstverst&auml;ndlich ehrenamtlich und einfach, weil es Spass macht!</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a11"></A> 

          <H3>6.0 AS-NEWS erschienen</H3>

          <P>Damit wir nichtkommerziell bleiben k&ouml;nnen, muss jemand anderes
          unsere Technik finanzieren und daf&uuml;r arbeiten wir mit Sponsoren
          unseres Vertrauens zusammen, die auch direkt die Technik f&uuml;r BLINDzeln
          bereitstellen.</P>

          <P>Wir informieren dar&uuml;ber, dass die neuen AS-NEWS k&uuml;rzlich
          erschienen sind mit unz&auml;hligen Angeboten aus den unterschiedlichsten
          Bereichen....</P>

          <P>Mit diesem Newsletter versendet ALL SYSTEMS in unregelm&auml;&szlig;igen
          Abst&auml;nden aktuelle Trends, tolle Angebote und g&uuml;nstige
          Schn&auml;ppchen aus einem Sortiment von &uuml;ber 25.000 Artikeln zu Euch
          nach Hause. Die AS-Unternehmensgruppe bietet ein umfangreiche Sortiment in
          den Bereichen....

          <UL>
            <LI>Informations- &amp; Medientechnologien</LI>

            <LI>IT/TK-Peripherie &amp; Zubeh&ouml;r</LI>

            <LI>Software-Entwicklung &amp; Vertrieb</LI>

            <LI>Telekommunikation &amp; Mobilfunk</LI>

            <LI>Security- &amp; &Uuml;berwachungssysteme</LI>

            <LI>Stempel, Marketing &amp; Offset-Druck</LI>

            <LI>Show- &amp; B&uuml;hnentechnik</LI>

            <LI>Office-Internet-Services</LI>

            <LI>Webseitendesign &amp; Shopsysteme</LI>

            <LI>Webspace &amp; Domainregistrierung</LI>

            <LI>Webserver &amp; Mailinglistensysteme</LI>
          </UL>
          </P>
          

          <P>Kompetent + Preiswert + Schnell + Zuverl&auml;ssig</P>

          <P>Komplett-PCs f&uuml;r deutlich unter 350,00 Euro aus einem Angebot von
          &uuml;ber 2500 PC-Systemen sind genauso dabei, wie Sonderanfertigungen.
          Jedes Computersystem wird erst nach Bestellung kundenspezifisch in
          Deutschland gefertigt und durchl&auml;uft dabei mehrere
          Qualit&auml;tskontrollen. Man erh&auml;lt also keine Ladenh&uuml;ter aus
          dem Lager sondern kundenspezifisch aus modernsten Komponenten gefertigte
          Computersysteme zu Preisen vom Discounter und Service vom Fachhandel.</P>

          <P>Der Newsletter erscheint unregelm&auml;&szlig;ig etwa monatlich und ist
          selbstverst&auml;ndlich kostenlos. Versendet wird er per EMail im
          Textformat. Es ist also ein v&ouml;llig barrierefreier Katalog.</P>

          <P>Wer den Newsletter gern erhalten m&ouml;chte, sende bitte eine EMail
          an:<BR>
          <B>as-news@blindzeln.de</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a12"></A> 

          <H3>6.1 Werbung f&uuml;r fremde Mailinglisten</H3>

          <P>Da scheinbar Einige wirklich der Meinung sind, dass wir anderen
          Mailinglistenbetreibern das Leben schwerer machen m&ouml;chten, bieten wir
          allen Mailinglistenbetreibern hier im Newsletter gern die M&ouml;glichkeit
          an, etwas Werbung f&uuml;r Mailinglisten zu machen, die eben nicht von
          BLINDzeln bereit gestellt werden. Wir m&ouml;chten mit BLINDzeln das
          Angebot interessanter Mailinglisten erweitern und nicht reduzieren!!!</P>

          <P>So m&ouml;chten wir heute auf einige interessante Mailinglisten
          aufmerksam machen, die ebenfalls auf dem Server AS2-Detroit laufen....</P>

          <P>Liste / Beschreibung / Anmeldung</P>

          <UL>
            <LI><B>Allsexual</B><BR>
            Alles rund um Sexualit&auml;t, Liebe und Beziehungen<BR>
            allsexual-subscribe@as-2.de</LI>

            <LI><B>Blinde-Freunde</B><BR>
            Blinde Freunde aus aller Welt, deutschsprachig!<BR>
            blinde-freunde-subscribe@as-2.de</LI>

            <LI><B>Blisex</B><BR>
            Blinde und Sexualit&auml;t<BR>
            blisex-subscribe@as-2.de</LI>

            <LI><B>Bueffels-Ebayclub</B><BR>
            Auktionsh&auml;user im Internet und alles was damit zu tun hat<BR>
            bueffels-ebayclub-subscribe@as-2.de</LI>

            <LI><B>Entsetzliche-Welt</B><BR>
            Die Welt ist nicht immer gut! Hier darf abgekotzt werden! Pers&ouml;nliche
            Beleidigungen und rechtlich Bedenkliches ausgeschlossen<BR>
            entsetzliche-welt-subscribe@as-2.de</LI>

            <LI><B>Filesharing</B><BR>
            Alles rund um das Thema Filesharing, Diskussionen &uuml;ber Software,
            Bedienerfragen, aber keine Fragen zu urheberrechtlich gesch&uuml;tzten
            Treffern<BR>
            filesharing-subscribe@as-2.de</LI>

            <LI><B>Fussballzeit</B><BR>
            Bei uns dreht sich nicht nur der Ball<BR>
            fussballzeit-subscribe@as-2.de</LI>

            <LI><B>ISCB</B><BR>
            Die Mailingliste des ISCB<BR>
            iscb-subscribe@as-2.de</LI>

            <LI><B>Radioforum</B><BR>
            Radiointeressierte unterhalten sich &uuml;ber alles was irgendwie mit Radio
            zu tun hat. Dudelfunk und seine Aktionen sollten nur kurz und knapp
            behandelt werden<BR>
            radioforum-subscribe@as-2.de</LI>

            <LI><B>Schnellfressen</B><BR>
            Schnell zu bereitende Rezepte, Aktionen deines Fastfoodrestaurants,
            Aktionen von Pizzadiensten, Tipps und Tricks, auch Diskussionen &uuml;bers
            Essen<BR>
            schnellfressen-subscribe@as-2.de</LI>

            <LI><B>Slackware</B><BR>
            Deutsche Slackware Mailingliste<BR>
            slackware-subscribe@as-2.de</LI>
          </UL>

          <P>Hast Du selbst eine Mailingliste oder kennst Eine, die unbedingt hier
          genannt werden sollte? Schreib uns, wir berichten gern dar&uuml;ber.<BR>
           <B>listenempfehlung@blindzeln.de</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a13"></A> 

          <H3>7.0 Unser Online-Magazin, die NoCover</H3>

          <P>Einige von Euch wissen es vielleicht noch gar nicht, aber BLINDzeln hat
          auch ein eigenes monatlich erscheinendes Online-Magazin, - unsere
          "NoCover". Die NoCover kommt urspr&uuml;nglich als ehemaliges
          Computermagazin zu BLINDzeln als Themenfreies Boulevard-Magazin. Sie wird
          aus Artikeln von Lesern f&uuml;r Leser zusammengestellt. Wir sind daher
          st&auml;ndig auf der Suche nach regelm&auml;&szlig;igen Schreibern, um die
          NoCover stets interessant und vielf&auml;ltig gef&uuml;llt an jedem Ersten
          eines Monates per EMail versenden zu k&ouml;nnen. Das Magazin wird von
          vielen verschiedenen Menschen gelesen, wobei es nicht allein auf Themen
          begrenzt ist, die sich um blinde und sehschwache Menschen drehen.</P>

          <P>Wer die NoCover gern monatlich kostenlos im EMailabonnement bekommen
          m&ouml;chte, kann einfach eine EMail an:<BR>
           <B>nocover@blindzeln.de</B><BR>
           senden.</P>

          <P>Online k&ouml;nnt Ihr jede Ausgabe auf der
          Homepage:<BR>
          <B>http://nocover.blindzeln.de</B><BR>
          oder<BR>
          <B>http://www.nc-mag.de</B><BR>
          lesen.</P>

          <P>Wolf als Redaktionsleiter und f&uuml;r die Zusammenstellung und
          Gestaltung der NoCover zust&auml;ndig hat sich nun extra die gro&szlig;e
          M&uuml;he gemacht, eine rein textbasierte Ausgabe allein f&uuml;r die
          Nutzung mit Screenreadern und Braillezeilen zusammenzustellen. Jede
          NoCover-Ausgabe wird also in zwei verschiedenen Versionen verf&uuml;gbar
          sein. Einmal mit grafischer Gestaltung und viel Bildmaterial und
          zus&auml;tzlich komplett Textbasiert.</P>

          <P>Jetzt ben&ouml;tigen wir Eure Hilfe, denn wir m&ouml;chten die NoCover
          Euren W&uuml;nschen entsprechende gestalten! Schaut Euch bitte die erste
          Testversion der NoCover-Textausgabe an unter....<BR>
          <B>http://www.nc-mag.de/text/</B></P>

          <P>Wir brauchen bitte ganz viel Feedback von Euch, da wir wissen
          m&ouml;chten, wie Euch die NoCover gef&auml;llt und ob wir etwas verbessern
          k&ouml;nnen. Bitte habt auch etwas Verst&auml;ndnis, dass Wolf viel Zeit
          und Arbeit in die NoCover steckt. Ich denke, etwas Feedback sollte doch da
          das Mindeste sein, was wir tun k&ouml;nnen. Ein paar lobende Worte, wenn
          Euch die NoCover gut gef&auml;llt kosten wenig Zeit und kein Geld - also
          lasst bitte mal etwas von Euch h&ouml;ren. Es ist etwas deprimierend,
          soviel Arbeit in ein Magazin zu stecken und dann nicht mal zu erfahren, ob
          sich dieser Einsatz lohnt und andere Menschen sich dar&uuml;ber freuen.</P>

          <P>&Uuml;berschwemmt den Wolf bitte mit EMails zur NoCover - er freut sich
          &uuml;ber Euer Feedback. Schreibt ihm per EMail an....<BR>
          <B>wolf@blindzeln.de</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a14"></A> 

          <H3>8.0 Flyeraktion</H3>

          <P>Wir planen eine Flyeraktion, in der wir auf BLINDzeln auch ausserhalb
          unserer bisherigen Kreise aufmerksam machen k&ouml;nnen. Hierzu werden etwa
          10000 Handzettel gedruckt und sollen dann zus&auml;tzlich nocheinmal mit
          Punktschriftdruckern bedruckt werden. So bekommen Sehende bzw. Menschen auf
          dem Wege zur Erblindung unsere Infos in die Hand und k&ouml;nnen das
          Gedruckte lesen - werden aber gleichfalls mit Punktschrift konfrontiert.
          Zur Verteilung m&ouml;chten wir verschiedene Verlage anschreiben, die
          unsere Seiten dann Fachmagazinen und Zeitschriften beilegen.</P>

          <P>Wahrscheinlich haben wir bereits eine Druckerei und Material gefunden.
          W&uuml;rden aber sehr gern auch weitere Hilfe und Unterst&uuml;tzung
          annehmen. So suchen wir finanzielle Unterst&uuml;tzung oder weitere
          Druckereien, die uns kostenlos unterst&uuml;tzen m&ouml;chten. Namentliche
          Nennung ist dabei selbstverst&auml;ndlich. Auch w&uuml;rden wir gerne die
          Bedruckung in Punktschrift entweder von einer entsprechend ausgestatteten
          Druckerei machen lassen oder den gro&szlig;en Batzen an mehrere private
          BLINDzler aufteilen, die uns mit Punktschriftdruckern helfen k&ouml;nnten
          und auch wollen.</P>

          <P>Meldet Euch dann bitte an....<BR>
          <B>flyer@blindzeln.de</B></P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a15"></A> 

          <H3>9.0 Wichtiges zum Urheberrecht</H3>

          <P>Leider kommt es immer wieder vor, dass Foren bei BLINDzeln scheinbar
          falsch als Tauschb&ouml;rse f&uuml;r urheberrechtlich gesch&uuml;tztes
          Material verstanden werden.</P>

          <P>BLINDzeln und alle daf&uuml;r verantwortliche Personen distanzieren sich
          ganz ausdr&uuml;cklich und deutlich von jeglicher Verletzung des
          Urheberrechts und m&ouml;chte hiermit Euch alle sehr deutlich bitten, nicht
          &uuml;ber die Servicedienste von BLINDzeln zur Verletzung von
          Urheberrechten aufzufordern bzw. daf&uuml;r BLINDzeln zu missbrauchen. Ihr
          begebt Euch da selbst auf sehr d&uuml;nnes Eis, wenn Ihr &ouml;ffentlich in
          einer Mailingliste urheberrechtlich gesch&uuml;tztes Material anbietet.
          Schnell liest jemand Euer Tauschangebot mit, der das Urheberrecht streng
          bewahrt wissen m&ouml;chte und es kann zu einer Anzeige kommen. Auch
          BLINDzeln als Gesamtprojekt wird dadurch in ein Licht ger&uuml;ckt, wo wir
          auf gar keinen Fall stehen m&ouml;chten.</P>

          <P>Es ist nat&uuml;rlich gar kein Problem Originale zum Tausch oder zum
          Verkauf anzubieten - wir haben Euch mehrere Werkzeuge hierf&uuml;r
          eingerichtet und es sind noch Weitere geplant, aber seit bitte in Eurem
          eigenen Interesse so vern&uuml;nftig und bietet nicht offensichtlich und
          &ouml;ffentlich Eure Kopien an - Ihr k&ouml;nnt mit solchen Aktionen
          wirklich in Teufels K&uuml;che kommen. Mailinglisten und andere Services
          sind &ouml;ffentlich zug&auml;ngliche Einrichtungen! Denkt daran!</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>
          <A name="a16"></A> 

          <H3>9.9 Verabschiedung</H3>

          <P>Wieder ist der Newsletter furchtbar lang geworden, weil es soviele
          Neuigkeiten zu berichten gibt und bestimmt haben wir noch gar nicht an
          alles gedacht.</P>

          <P>Wir hoffen dennoch, Euch &uuml;ber alles Wichtige informiert zu haben
          und das wenigstens Einige den kompletten Newsletter bis hier unten hin
          verfolgt haben ;-)</P>

          <P>Diesen Newsletter und alle Sonstigen k&ouml;nnt Ihr jederzeit auch
          &uuml;ber den Bereich [News] auf unserer Homepage http://www.BLINDzeln.de
          nachlesen.</P>

          <P>Wir haben noch sehr viele weitere Pl&auml;ne mit BLINDzeln und freuen
          uns schon darauf, wenn wir Euch hoffentlich bald schon davon berichten
          k&ouml;nnen.</P>

          <P>Euer Team von BLINDzeln w&uuml;nscht Euch einen wundersch&ouml;nen
          Herbstbeginn und viel viel Spass mit BLINDzeln.</P>

          <P>Herzliche Gr&uuml;&szlig;e<BR>
          Cord Hagen und das komplette Team von BLINDzeln</P>
          <A href="#top">zum Inhaltsverzeichnis</A> 
          <HR>

          <P>www.BLINDzeln.de - Die Welt mit anderen Augen sehen<BR>
          Specken 3 D-27308 Kirchlinteln Germany<BR>
          Phone and Fax +49 (0) 42 36 - 16 57<BR>
          Fax +49 (0) 72 1 - 15 15 76 12 0 SMS +49 (0) 17 2 - 58 05 61 9</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>
