<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>BLINDzeln - Infomail</TITLE>
  </HEAD>

  <BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="Textformatierung mit Rand">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>BLINDzeln Chat - Informationen
          </B></FONT></H1>
          03. September 03 

          <H3>Liebe BLINDzlerinnen und BLINDzler,</H3>

          <P>t&auml;glich kommen neue weitere BLINDzler zu uns in den Chat und mit
          jedem neuen Gesicht im Chat macht das Ganze umso mehr Spass. Wir haben
          hierzu aber einige Informationen f&uuml;r Euch zusammengestellt, die bei
          uns im Chat g&uuml;ltig sind:</P>

          <P>1. Jeder Chatraum wird von drei sogenannten "bots" &uuml;berwacht. bot
          Nummer 1 arbeitet als Administrator im Chatraum. Er setzt alle
          Chatmitglieder raus, die aufgrund vorangegangenen Verhaltens im Chatraum
          unerw&uuml;nscht sind und setzt Chatter vor die T&uuml;r, die Unfug dort
          treiben. Wer beispielsweise andere BLINDzler im Chat beleidigt oder
          bestimmte Schimpfworte schreibt, wird sofort rausgeworfen. Dieser bot
          vergibt auch die jeweiligen Rechte an unsere Systemoperatoren (OPs) im
          Chat. Der zweite bot ist f&uuml;r diverse Spielereien und zur
          &Uuml;berwachung des ersten bots zust&auml;ndig. Der dritte bot ist
          ebenfalls f&uuml;r Spielereien und um im Notfall das Autoban
          weiterzuf&uuml;hren eingerichtet. Mit Spielereien sind gemeint, dass man
          beispielsweise den Befehl eingibt "wirf cord" und der bot schmeisst "cord"
          virtuell quer durch den Raum und der Rest freut sich dar&uuml;ber.</P>

          <P>2. Teilweise gehen einige BLINDzler im Chat recht ruppig miteinander um.
          Das ist nat&uuml;rlich gegen alles, was wir uns f&uuml;r BLINDzeln
          w&uuml;nschen. Werden im Chat Schimpfw&ouml;rter benutzt oder sonst andere
          Chat-Teilnehmer in irgend einer Form pers&ouml;nlich angegriffen,
          beschimpft oder beleidigt, werden diese Teilnehmer mit einem "kick"
          geahndet, also vor die T&uuml;r bef&ouml;rdert. Man kann dann aber
          selbstverst&auml;ndlich den Raum gleich wieder betreten. Passiert ein
          weiteres mal eine Beleidigung, so wird erneut ge"kickt". Beim dritten mal
          setzt der bot einen sogenannten "ban" was zum Ausschluss aus dem Chat
          f&uuml;hrt. Alle Chatoperatoren sind im &uuml;brigen ebenfalls dazu
          angehalten, sehr streng sofort alles vor die T&uuml;r zu setzen, was sich
          nicht benehmen kann und meint, sich mehrfach im "Ton" vergreifen zu
          m&uuml;ssen. Wir werden bei BLINDzeln keinerlei Beleidigungen,
          Beschimpfungen oder pers&ouml;nliche Angriffe dulden -nicht einmal
          ansatzweise! Es wird zudem in jedem Chatraum ein Protokoll mit angelegt und
          archiviert. Missbrauch des Chatsystems wird konsequent verfolgt. Wir werden
          alles erdenkliche tun, um den netten und freundschaftlichen Umgangston, der
          von BLINDzeln bekannt ist auch in unser Chatsystem zu &uuml;bertragen. Das
          Chatten soll bei BLINDzeln vor allem Spass machen. Nette Kontakte und ein
          freundlicher Umgangston ist sicherlich jedem BLINDzler sehr viel lieber,
          als im Chat von einem anderen Chat-Teilnehmer beleidigt zu werden.
          &Uuml;brigens werden wir auch Beschwerden von BLINDzlern nachgehen und
          gegebenenfalls St&ouml;renfriede vom Chatsystem ausschliessen.</P>

          <P>3. Kritik ist wichtig und uns ehrlich willkommen, allerdings w&uuml;rden
          contraproduktive Dauern&ouml;rgler lediglich unseren Chat gewaltig
          st&ouml;ren. Wenn Euch etwas st&ouml;rt oder nervt, dann sagt uns das. Oft
          sind es nur einfache Bedienungsfehler - wir helfen jedem und immer sehr
          gern, -jederzeit. Aber wenn es nur darumgeht, unser Chatsystem mies zu
          machen oder daran herum zu n&ouml;rgeln, dann erledigt das bitte per EMail
          an uns und verschont die anderen BLINDzler damit, die sich einfach nur
          dar&uuml;ber freuen, bei BLINDzeln miteinander chatten zu k&ouml;nnen.</P>

          <P>4. Haltet Euch bitte an die Nettiquette - dann seit Ihr in jedem Fall
          auf der sicheren Seite, dass Euch auch die anderen BLINDzler im Chat
          m&ouml;gen werden und sich auch mit Euch unterhalten werden. Seit einfach
          "lieb" zueinander - dann macht das ganze Chatsystem auch allen Spass
          ;-)</P>

          <P>5. Zu den sogenannten bots werden die R&auml;ume selbstverst&auml;ndlich
          auch noch durch "Menschen" verwaltet. Diese werden "OPs" genannt. Derzeit
          sind folgende BLINDzler OPs unter den Nicknamen erkennbar: Cord, Megafatih,
          Dracon, Ziegel, Rothaut, Morgaine. Wir stehen Euch jederzeit zur
          Verf&uuml;gung, wenn wir anwesend sind im Chat und helfen Euch sofort! Auch
          die anderen BLINDzler sind aber sicherlich BLINDzeln-typisch gern
          hilfsbereit, wo sie helfen k&ouml;nnen. Bitte bedenkt aber, dass im
          Gegensatz zu den bots die OPs wirklich auch nur Menschen sind! Auch wir
          k&ouml;nnen einfach mal einen schlechten Tag haben und im Gegensatz zu den
          bots kann man uns sicherlich auch mal auf die Palme bringen. Wenn man
          mehrere Stunden im Chat den BLINDzlern hilft und beantwortet zum hundersten
          mal die gleiche Frage, kann man schon mal etwas "abgek&auml;mpft" reagieren
          - nehmt uns das dann bitte nicht &uuml;bel ;-) &Uuml;brigens auch OPs
          ausser Ziegel und Dracon sind vor den bots nicht sicher - geschimpft wird
          also nicht!</P>

          <P>6. "Lauscher" und "Protokollierer" sind bei uns im Chat
          unerw&uuml;nscht. Es gibt Menschen, die morgens sich im Chat einloggen -
          nat&uuml;rlich m&ouml;glichst anonym - und dann den Rechner einfach rund um
          die Uhr eingeloggt lassen, ohne chatten zu wollen. Irgendwann abends wird
          dann nachgelesen, was sich andere so im Chat den Tag &uuml;ber erz&auml;hlt
          haben. Dem werden wir einen Riegel vorschieben. Unsere OPs sind wie folgt
          angewiesen. Ist ein Chatnutzer eingeloggt und zudem auch noch anonym wird
          er nach einiger Zeit seiner Unt&auml;tigkeit angesprochen, dass er sich
          bitte am Chat beteiligen m&ouml;ge. R&uuml;hrt sich nichts, wird er
          verwarnt und wenn sich weiterhin nichts tut, wird er ge"kickt". Ist dieser
          Chatnutzer per Autoconnect gleich wieder im Chat, wird er schliesslich dann
          ge"ban"t. Also entg&uuml;ltig rausgeworfen und muss sich neu anmelden. Im
          Prinzip nichts Schlimmes also - nur das er eben nicht die virtuellen
          Gespr&auml;che im Chat mitschneiden kann.</P>

          <P>7. Unsere Raumliste umfasst zur Zeit folgende
          BLINDzeln-Chatr&auml;ume:<BR>
          #eingangshalle<BR>
          #waschweib<BR>
          #orakel<BR>
          #nocover<BR>
          Unsere Eingangshalle ist allerdings nicht zum Chatten vorgesehen. Dort
          sollen vor allem zun&auml;chst neue Chatnutzer die wichtigsten Befehle
          angezeigt bekommen und erste Einstellungen erledigen k&ouml;nnen, um
          beispielsweise den Nickname zu registrieren. Die Eingangshalle wird von
          einem sogenannten "doc bot" verwaltet, der die ersten Infos mitteilt und
          andere Aufgaben erledigt.</P>

          <P>8. Eine recht gut verst&auml;ndliche &Uuml;bersicht der Chatbefehle
          k&ouml;nnt Ihr Euch im Internet durchlesen auf der URL:
          http://www.blindzeln.de/chat/befehle.html Oder Ihr lasst Sie Euch einfach
          per EMail zuschicken. Sendet dazu einfach eine EMail an:
          chatbefehle@BLINDzeln.de</P>

          <P>9. Weitere Hilfestellung: Hilfe zum Chat und seinen Befehlen:<BR>
          chathilfe@BLINDzeln.de<BR>
          Technischer Support und Verbesserungsvorschl&auml;ge an<BR>
          Ziegel: chat@BLINDzeln.de</P>
          <HR>

          <H1 align="center"><FONT color="#ffff00"><B>BLINDzeln -
          Infomail</B></FONT></H1>
          06.September 03 

          <H2>Euer Wunsch ist unser Ziel!</H2>

          <H3>Huhu liebe BLINDzlerinnen und BLINDzler,</H3>

          <P>nachdem wir erfolgreich unseren Chat bei BLINDzeln in Betrieb nehmen
          konnten und jeden Tag neue BLINDzler uns dort besuchen, geht es nun mit
          weiteren Ideen weiter.</P>

          <P>Zuerst noch eine Info zu unserem Chat. Wir haben jetzt auch die
          M&ouml;glichkeit, &uuml;ber unseren Onlinechat auf der Homepage mit
          Screenreadern zu plaudern. Ihr erreicht uns &uuml;ber www.BINDzeln.de und
          dann &uuml;ber den Link "Chat". Kommt am besten in den virtuellen Raum
          #orakel, dort ist immer am meisten los. Zumindest unsere Tests mit diversen
          Screenreadern waren erfolgreich. Allerdings m&ouml;chte ich mal dazu gesagt
          haben, dass erst ein Java-Paket geladen wird. Das passiert zwar im
          Normalfall automatisch, jedoch ist das mit einem Analogmodem mit 56kbit
          leider eine zeitintensive Angelegenheit von mehreren Minuten. Richtig
          genie&szlig;bar ist das erst mit ISDN oder DSL. Ist das Java-Paket aber
          erst einmal installiert, sollte es beim n&auml;chsten Besuch nat&uuml;rlich
          sofort zur Verf&uuml;gung stehen.</P>

          <P>Wir empfehlen Euch nach wie vor das von uns vorkonfigurierte Programm
          "MIRC", mit dem es deutlich bequehmer durch den Chat geht. Auch hierzu
          findet Ihr alles N&ouml;tige auf unserer Homepage im Bereich "Chat".</P>
          <HR width="60%">

          <H3>Jetzt aber zu unseren n&auml;chsten Schritten....</H3>

          <P>Wir sind jetzt damit besch&auml;ftigt, unsere Homepage endlich zu
          &uuml;berarbeiten. Zahlreiche Angebote kommen damit auf Euch zu. Es
          geh&ouml;ren Counter, G&auml;stebuch, Formulare, ein BLINDzeln-Shop,
          Anzeigenmarkt, Downloadbereiche und andere nette Dinge dazu. Dazu planen
          wir aber noch etwas ganz anderes, wozu wir aber erst Euer Feedback
          brauchen....</P>

          <P>Besteht bei den BLINDzlern Interesse an einem Kontaktund
          Singleforum?</P>

          <P>Dieses Angebot bietet den BLINDzlern dann ein komplettes Singleforum, um
          Andere kennenlernen zu k&ouml;nnen, ob nun f&uuml;r Flirt, Partnerschaft,
          Freundschaft, gemeinsames Hobby oder nur einer EMailfreundschaft.
          Nat&uuml;rlich kann man sich dort m&ouml;glichst neutral eintragen - ein
          Name und ein abgefragtes Profil gen&uuml;gen bereits. Das System bietet
          dar&uuml;ber hinaus einen Services, um sich neutral zu einem Abendessen
          treffen zu k&ouml;nnen. F&uuml;r einen geringen Preis (um die 30,- Euro pro
          Person) werden Hotelzimmer reserviert und ein Abendessen ist auch schon
          dabei. So l&auml;sst sich eine erste Verabredung in neutraler und sicherer
          Umgebung abwickeln. Eventuell w&uuml;rden wir unser Kontaktsystem mit zB.
          einem Fleuropdienst koppeln, so dass man dem Partner oder der Partnerin
          seiner Vorstellungen aus unserem System heraus gleich einen Blumenstrauss
          zukommen lassen kann. Und wer einfach nur Kontakt zu Gleichaltrigen sucht
          zwecks EMailfreundschaft - kein Problem, auch das geht nat&uuml;rlich.</P>

          <P>Unsere Frage nun an Euch liebe BLINDzler -m&ouml;chtet Ihr soetwas
          haben? Oder sollen wir uns diese Arbeit sparen? Wenn solche Angebote bei
          Euch auf Interesse sto&szlig;en, werden wir daran arbeiten, aber es sollte
          auch etwas Feedback von Euch kommen.</P>

          <P>Was m&ouml;chtet Ihr noch gern &uuml;ber unsere Homepage erreichen
          k&ouml;nnen? Erz&auml;hlt uns von Euren Ideen und W&uuml;nschen! BLINDzeln
          ist f&uuml;r EUCH und darum m&ouml;chten wir wissen, was noch
          gew&uuml;nscht wird.</P>
          <HR width="60%">

          <P>Unser Forenindex wurde vor zwei Tagen abermals aktualisiert, weil die
          Mailingliste [OHP] bei BLINDzeln ein neues Zuhause gefunden hat.
          N&auml;here Informationen zu diesem neuen Forum bei BLINDzeln und zu allen
          anderen k&ouml;nnt Ihr Euch wie immer per EMail zusenden lassen. Schickt
          einfach eine leere EMail an: forenindex@blindzeln.de</P>

          <P>BLINDzeln beliefert mittlerweile rund 1121 BLINDzler mit EMails aus
          derzeit 17 Foren.</P>

          <P>An dieser Stelle begr&uuml;&szlig;en wir auch wieder die vielen neuen
          BLINDzler ganz herzlich bei uns. F&uuml;hlt Euch wohl bei BLINDzeln. Ihr
          d&uuml;rft Euch sehr gerne bei BLINDzeln ein wenig vorstellen. Sendet
          hierzu einfach eine leere EMail an: kurzvorstellung@blindzeln.de</P>

          <P>Ihr bekommt daraufhin ein Textformular per EMail zur&uuml;ck, welches
          Ihr einfach mit der Antwortfunktion Eures EMailprogramms ausf&uuml;llen
          k&ouml;nnt. Klickt also auf "Antworten" und schreibt Eure Antworten ganz
          einfach unter die Fragen. Wenn Ihr fertig seit, klickt auf "Senden" und
          schon haben wir Eure Kurzvorstellung. Diese wird dann in unsere Homepage in
          einem Passwort-gesch&uuml;tztem Bereich eingebaut. Nur die BLINDzler, die
          sich selbst kurz auf diese Weise vorstellen, bekommen auch die Zugangsdaten
          zu diesem Bereich und k&ouml;nnen nur dann die Kurzvorstellungen der
          anderen BLINDzler lesen.</P>
          <HR width="60%">

          <H3>Noch einige Informationen &uuml;ber unseren Infoverteiler.</H3>

          <P>Wir hatten Euch sonst bei BLINDzeln ja immer direkt &uuml;ber die
          Mailinglisten &uuml;ber Neuerungen etc. informiert. Das hatte den
          gro&szlig;en Nachteil, dass je nachdem, bei welchen BLINDzelforen man
          angemeldet war, diese Nachrichten dann nat&uuml;rlich mehrfach bekam. Das
          wollten wir abstellen. Wir haben deshalb ein System entwickelt, welches
          einmal n&auml;chtlich einfach die EMailadressen aller BLINDzler in allen
          Foren sammelt und in einen Infoverteiler importiert. Dadurch bekommt Ihr
          immer nur jede Informationsnachricht ein einziges mal. Auch eventuelle
          Werbung unserer Sponsoren verteilen wir ausschliesslich &uuml;ber dieses
          System. So k&ouml;nnen sich die beiden BLINDzler, die sich tats&auml;chlich
          noch dar&uuml;ber aufregen, dass wir bislang einmal im Monat einen
          F&uuml;nfzeiler mit Werbung versendet haben, einfach den Verteiler in ihrem
          EMailprogramm filtern und erhalten damit ein v&ouml;llig werbefreies, aber
          auch Infofreies BLINDzeln. Damit werden wir hoffentlich endlich sogar
          einzelnen W&uuml;nschen gerecht.</P>
          <HR width="60%">

          <H3>Kostenloses Online-Magazin</H3>

          <P>Den neuen BLINDzlern m&ouml;chte ich an dieser Stelle wieder gerne unser
          kostenloses Online-Magazin "No Cover" empfehlen. Es wurde am 1.9. in seiner
          114. Ausgabe an alle EMailabonnenten verschickt. Die NoCover kommt
          p&uuml;nktlich zu jedem Ersten eines Monats per EMail. Online kann es auch
          gelesen werden &uuml;ber die Internetadresse:
          http://nocover.blindzeln.de</P>

          <P>Ein kostenloses Abo bekommt Ihr, indem Ihr einfach eine EMail an:
          nocover@blindzeln.de sendet.</P>

          <P>Wir suchen immer noch nach aktiven Helfern bei BLINDzeln. Ob nun
          redaktionelle Arbeiten f&uuml;r die NoCover oder zur Co-Moderation unserer
          Mailinglisten -wer helfen m&ouml;chte, meldet sich bitte bei uns unter:
          info@blindzeln.de</P>
          <HR width="60%">

          <P>So liebe BLINDzler - wieder viele Neuigkeiten auf einen Schlag. Und wir
          haben noch viele weitere Pl&auml;ne im Kopf. Lasst Euch
          &uuml;berraschen.</P>

          <P>Jetzt warten und hoffen wir erstmal auf Eure W&uuml;nsche und Ideen, um
          unser Internetangebot auf Eure Bed&uuml;rfnisse besser anpassen zu
          k&ouml;nnen.</P>

          <P>Schreibt uns bitte hierzu per EMail an: idee@blindzeln.de</P>

          <P>Ganz herzliche Gr&uuml;&szlig;e und weiterhin richtig viel Spass mit
          BLINDzeln w&uuml;nschen Euch<BR>
          Fatih, Cord und das ganze Team von BLINDzeln.</P>
          <HR>

          <P>Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

