<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Mathias Klingner -->

    <TITLE>Internationale Funkausstellung</TITLE>
  </HEAD>

  <BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>

          <P align="center"><FONT color="#000080" size="+2"><B>Die
          Internationale Funkausstellung vom 29.08.-03.09.2003<BR>
           Ein Fotobericht von Mathias Klingner</B></FONT></P>

          <DIV align="center">

            <TABLE border="0" width="740" summary="">
              <TR>
                <TD width="370" align="center">
                <IMG src="mm_ifa37.jpg" width="360" height="239" alt="Eingang S&uuml;d"><BR>
                Eingang S&uuml;d zur IFA-2003</TD>

                <TD valign="top">Am Sonntag den 31.08.2003 fuhr ich schon morgens kurz nach
                9 Uhr mit dem Bus zur Internationalen Funkausstellung. Ich war also
                p&uuml;nktlich zur &Ouml;ffnung um 10 Uhr am Eingang, wo sich schon einige
                Messebesuchern versammelt hatten. Am Haupteingang jedoch war um diese Zeit
                schon ein wesentlich gr&ouml;&szlig;erer Andrang.</TD></TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa16.jpg" width="360" height="237"
                alt="Vieta Demo Car"></TD>
                <TD align="center"><IMG src="mm_ifa10.jpg" width="360" height="237"
                alt="Video-Einbausystem"></TD>
              </TR>

              <TR>
                <TD align="center">Vieta Demo Car - kein D&uuml;sentriebwerk - es sind
                nur Lautsprecher</TD>

                <TD align="center">Grundig Car Video-Einbausysteme</TD>
              </TR>

              <TR>
                <TD colspan="2"><BR>
                Als erstes besuchte ich die Car und Audio-Ausstellungen. Von Grundig wurde
                ein ganzes System von Car Hifi, Digital Radio und mobilen
                Video-Unterhaltungssystemen gezeigt. Das zweite Bild zeigt Car Cine. Ein
                kleiner, kompakter DVD-Player und ein flacher TFT-Monitor integriert in
                einer funktionellen, robusten Transporttasche mit versteckter intelligenter
                Kabelf&uuml;hrung (auch mehrere Monitore sind anschlie&szlig;bar). So sind
                die leichten CarCine DVDEinheiten komfortabel zu transportieren und dank
                einfachem Plug and Play jederzeit schnell einsetzbar. So sind dadurch jetzt
                auch im Auto das Anschauen von Kinofilmen von DVD m&ouml;glich geworden.
                Von der Firma Vieta wurde ein Auto mit eingebauten Lautsprechern gezeigt,
                welches mit seiner Musiklautst&auml;rke bestimmt jeden
                Stra&szlig;enl&auml;rm &uuml;bert&ouml;nen kann. Wenn der Schall nach
                hinten abstrahlt, dann k&ouml;nnte es vielleicht auch noch etwas an Tempo
                gewinnen.</TD>
              </TR>

              <TR>
                <TD colspan="2">
                  <HR>
                </TD>
              </TR>

              <TR>
                <TD colspan="2">Etwas weniger laut, aber daf&uuml;r umso musikalischer ging
                es in der n&auml;chsten Halle zu. Dort spielte Claudia Hirschfeld auf einer
                Wersi Louvre GS1000 Orgel. Sie beherrscht fast jede Art von Musik. So
                spielt sie von popul&auml;rer Klassik, Musicalmelodien, Evergreens,
                Schlager, Unterhaltungs- und Tanzmusik bis zur modernen Popmusik sowie
                eigene Kompositionen auf einer gro&szlig;en WersiShoworgel. Zu einem
                Markenzeichen hat sich dabei auch ihr einzigartiges Pedalspiel mit beiden
                F&uuml;ssen entwickelt. Die internationale Presse bezeichnet sie als "Prima
                Ballerina", "First Lady" und "Quenn of The Organ". Sie ver&ouml;ffentlichte
                bis jetzt 15 eigenst&auml;ndige Tontr&auml;ger und ein Video. Da mir die
                von ihr dargebotene Musik recht gut gefiel kaufte ich auf der Messe ihre
                neueste CD "Meilensteine" mit vielen interessanten und recht flotten und
                modernen Musikst&uuml;cken.</TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa12.jpg" width= "360" height="239"
                alt="Wersi Louvre GS1000"></TD>

                <TD align="center"><IMG src="mm_ifa15.jpg" width="360" height="240"
                alt="MP-F75"> </TD>
              </TR>

              <TR>
                <TD align="center">Claudia Hirschfeld an der dreimanualigen Wersi Louvre
                GS1000</TD>
                <TD align="center">So klein kann ein Musikplayer sein - MP-F75 von mpman.
                </TD>
              </TR>

              <TR>
                <TD colspan="2">Doch Musik kann auch aus ganz kleinen Ger&auml;ten kommen.
                Das zeigte die Firma mpman an einem Stand. Dort war unter anderem ein
                winziger MP3-Spieler mit noch zus&auml;tzlich eingebauten FM-Radio zu
                sehen, von dessen musikalischen Leistungen man sich auch selbst
                &uuml;berzeugen konnte. Das Ger&auml;t hatte eine Gr&ouml;&szlig;e von
                43x70x18 mm, ein Gewicht von 42g (ohne Batterien), spielte MP3 und WMA,
                besa&szlig; einen 7 Band Equalizer und man konnte es auch als
                Diktierger&auml;t verwenden. Es kann mit 128/256/512MB Flash Memory
                ausgestattet werden und soll so ca. 150 EUR kosten.</TD>
              </TR>

              <TR>
                <TD colspan="2"><HR></TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa17.jpg" width= "360" height="239"
                alt="Flach-TV"></TD>

                <TD align="center"><IMG src="mm_ifa20.jpg" width="360" height="240"
                alt="LC-37HV4E"> </TD>
              </TR>

              <TR>
                <TD align="center">Flach-TVs von JVC</TD>

                <TD align="center">Sharps neue AQUOS-Serie, der LCD-TV LC-37HV4E</TD>
              </TR>

              <TR>
                <TD colspan="2">
                <P>In der n&auml;chsten Halle wurden Flach-TVs von JVC gezeigt. Die
                diesj&auml;hrigen Funkausstellung markierte den Durchbruch f&uuml;r
                Flachbildschirme. Ob in LCD-oder Plasma-Technik -die eleganten und
                angesichts ihrer Gr&ouml;&szlig;e leichten Display verwirklichen den Traum
                von der Mattscheibe, die wie ein Bild an der Wand h&auml;ngt. Die
                derzeitigen TV-Ger&auml;te werden allerdings wegen ihres enorm
                g&uuml;nstigeren Preises noch lange nicht vom Markt verschwinden.</P>

                <P>Auch bei Sharp wurden Flachbildschirme gezeigt. Die neue Serie
                hei&szlig;t dort AQUOS. Es gibt sie in Gr&ouml;&szlig;en von 94 cm, 75 cm
                und 55 cm. Wobei die beiden gr&ouml;&szlig;eren Bildschirme den TV-Tuner in
                einem externen Geh&auml;use haben. Die Bildschirme haben ein
                Kontrastverh&auml;ltnis von 800:1 und einen Betrachtungswinkel von bis zu
                170 Grad. Die extrem lange Betriebsdauer von bis zu 60.000 Stunden und ihr
                geringer Energieverbrauch setzten neue Standards.</P>
                </TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa23.jpg" width="360" height="240"
                alt="Aquos Mobile"><BR>
                Der transportable, stromunabh&auml;ngige, Funk-TV-Empf&auml;nger "Aquos
                Mobile" von Sharp</TD>

                <TD valign="top">
                <P>Auch von Sharp, der AQUOS LC-15 L 1E. Dieser LCD-TV mit einer
                Bildschirmdiagonale von 38 Zentimetern ist mit einem Lithium-Ionen-Akku
                ausger&uuml;stet, der bei Tageslicht zwei Stunden lang f&uuml;rs
                Fernsehvergn&uuml;gen sorgen soll. Im "Dark Environment"-Modus h&auml;lt
                der Akku noch eine Stunde l&auml;nger. Dieser transportable Empf&auml;nger
                empf&auml;ngt das TV-Signal vom Smart-Link-Transmitter durch ein im 2,4
                GHz-Bereich arbeitendes Spread-Spectrum-System. Der Smart-Link-Transmitter
                muss dazu mit einem Videorecorder oder DVD-Player gekoppelt werden. Ab
                November soll das Ger&auml;t f&uuml;r 1.800 EUR in die L&auml;den
                kommen.</P>
                </TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa36.jpg" width= "239" height="360" alt=
                "Hauptmann von K&ouml;penick"><BR>
                Begegnung der besonderen Art - Der Hauptmann von K&ouml;penick beim
                Messebesuch</TD>

                <TD valign="top">Eine au&szlig;ergew&ouml;hnliche Begegnung auf der IFA
                hatte ich, als ich pl&ouml;tzlich den Hauptmann von K&ouml;penick mit
                seiner charmanten Begleiterin auf mich zukommen sah. Der Berliner Stadtteil
                K&ouml;penick ist bestimmt manchen Lesern der NoCover von meinem Bericht
                &uuml;ber die 100 Jahr-Feier des Stra&szlig;enbahnhofes K&ouml;penick noch
                bekannt.<BR><BR>
                <IMG src="mm_ifa24.jpg" width="360" height="237" alt="Nikon Coolpix-Serie"><BR>
                Von der Nikon Coolpix-Serie bis zur modernen digitalen Spiegelreflex<BR><BR>
                In Halle 03.2 war Nikon mit einem Stand vertreten. Mit einer
                Nikon-Spiegelreflex (analog auf Film) entstanden auch, bis auf die letzten
                drei, alle Aufnahmen f&uuml;r diesen Fotobericht. Doch nicht die analogen
                Modelle wurde hier gezeigt. Es wurden alle neuen Digitalkameras von Nikon
                pr&auml;sentiert. So wurden besonders die neuen Nikon Coolpix 5000 und 5400
                gezeigt sowie die digitalen Spiegelreflexkameras Nikon D1X, Nikon D1H und
                Nikon D100.</TD>
              </TR>

              <TR>
                <TD colspan="2"><HR></TD>
              </TR>

              <TR>
                <TD valign="top"> Auf dem Freigel&auml;nde, im Sommergarten stand der
                KODAK-Truck. Dort wurde gezeigt, wie die digitalen Fotos auf die KODAK-CD
                oder aufs Fotopapier kommen. Bis auf die letzten drei Fotos sind alle Fotos
                so vom Negativ digitalisiert und auf Foto-CD gebrannt wurden um f&uuml;r
                diesen Fotobericht verwendet werden zu k&ouml;nnen.<BR><BR>
                   

                <CENTER>
                <IMG src="mm_ifa26.jpg" width="240" height= "360" alt="KODAK-Truck"><BR>
                Der KODAK-Truck auf dem Freigel&auml;nde
                </CENTER>
                </TD>

                <TD valign="top">
                <CENTER>
                <IMG src="mm_ifa01.jpg" width="261" height="360" alt="ich auf der Titelseite">
                </CENTER>
                <BR>
                Einmal auf der Titelseite - die Zeitschrift COLOR Foto machte es
                m&ouml;glich.<BR> Am Stand der Fotozeitschrift "COLOR FOTO" konnte man sich
                unentgeltlich auf einer B&uuml;hne von einer Profifotografin mit einem
                digitalen Fotoapparat fotografieren lassen. Anschlie&szlig;end wurde das
                beste Foto dann mit Hilfe eines Bildbearbeitungsprogramms in eine extra
                daf&uuml;r pr&auml;parierte originale Titelseite des Heftes Nr. 9/2003 der
                "COLOR FOTO" einkopiert und mit einem Epson-Drucker im Format A4, randlos,
                in h&ouml;chster Qualit&auml;t auf Fotopapier ausgedruckt. Ich nutzte die
                Gelegenheit und lies mich fotografieren. Nach einer Stunde konnte ich das
                Ergebnis am Stand der Fotozeitschrift abholen. Das Ergebnis ist im Bild zu
                sehen. </TD>
              </TR>

              <TR>
                <TD colspan="2"><HR></TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa33.jpg" width=360" height="240"
                alt="DVD-RAM"></TD>

                <TD align="center"><IMG src="mm_ifa35.jpg" width="360" height="240"
                alt="ARD-Morgenmagazin"> </TD>
              </TR>

              <TR>
                <TD align="center">DVD-RAM - bietet besonders komfortable
                Aufnahmefunktionen</TD>

                <TD align="center">Das ARD-Morgenmagazin live</TD>
              </TR>

              <TR>
                <TD colspan="2">In einer der letzten Hallen die ich besuchte wurde f&uuml;r
                die DVD-RAM geworben. Drei Disc-Familien verwirren die K&auml;ufer von
                DVD-Recordern immer wieder. So gibt es die DVD-RAM, die DVD+R/+RW und die
                DVD-R/-RW. Die DVD-RAM-Disc bietet besonders komfortable
                Aufnahmefunktionen, l&auml;uft daf&uuml;r aber nur in wenigen Playern. Die
                so genannten Plus und Minus-Formate gibt es jeweils als einfach und
                mehrfach bespielbare Variante (R/RW). Die Unterschiede zwischen Plusund
                Minus-Scheiben sind gering. Vor allem die einmal beschreibbaren Typen
                (+R/-R) laufen auf den meisten Playern.<BR><BR>
                Zum Schluss f&uuml;hrte mein Rundgang &uuml;ber die IFA noch zur ARD. Dort
                wurde gerade die Sendung "Das ARD Morgenmagazin" live von der IFA
                gezeigt.</TD>
              </TR>

              <TR>
                <TD colspan="2">
                  <HR>
                </TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa38.jpg" width="360" height="240"
                alt="Canon-Zelt"></TD>

                <TD align="center"><IMG src="mm_ifa39.jpg" width="360" height="239"
                alt="Druckerzubeh&ouml;rstand">
                </TD>
              </TR>

              <TR>
                <TD align="center">Eingang zum Canon-Zelt auf dem Potsdamer Platz</TD>

                <TD align="center">Druckerzubeh&ouml;rstand von Canon</TD>
              </TR>

              <TR>
                <TD colspan="2"> <P>Eine Besonderheit der diesj&auml;hrigen IFA war, das
                einer der Marktf&uuml;hrer bei digitalen Kameras nicht in den Messehallen
                zu finden war. Canon hatte auf dem Potsdamer Platz ein 1400 qm gro&szlig;es
                Zelt aufgebaut und pr&auml;sentierte dort seine neuen Produkte. Canon
                begr&uuml;ndete diesen Schritt wie folgt: "Wir wollen mit unserem
                speziellen Produktprogramm an Imaging-L&ouml;sungen abseits des
                gew&ouml;hnlichen Messetrubels, aber doch im Zentrum des Geschehens
                stehen".</P>

                <P>F&uuml;r mich bedeutete dies, das ich an einem Tage an zwei
                verschiedenen Orten die IFA besuchen musste. Da der Film in den Messehallen
                schon bis zum letzten Bild belichtet war, nahm ich f&uuml;r die drei bis
                vier geplanten Fotos vom Canon-Zelt die digitale Kamera der Marke "MEDION"
                (ALDI) mit ihren 4 Mio.Pixel mit und fotografierte die letzten drei Fotos
                dem Trend entsprechend digital.</P>

                <P>Am Potsdamer Platz empfing Canon die Besucher mit einem luftigen Zelt
                und zeigte seine gesamte Produktpalette von digitalen und analogen Kameras
                und Objektiven &uuml;ber Ferngl&auml;ser bis hin zu den neuesten Druckern
                und Druckerzubeh&ouml;r sowie Druckerverbrauchsmaterialien.</P>

                <P>Doch ein besonderes Exponat von Canon war die Canon EOS 300D mit sechs
                Millionen Pixeln in einem SLR-Geh&auml;use f&uuml;r wenig mehr als 1000 Euro. Diese
                Kamera soll der Renner im Markt der digitalen Kameras werden. F&uuml;r 100 Euro
                mehr gibt's ein neues Standardzoom gleich dazu. Damit r&uuml;ckt diese digitale
                Spiegelreflexkamera f&uuml;r viele in die N&auml;he des vom Preis her machbaren.
                Canon hofft mit dieser Kamera im Weihnachtsgesch&auml;ft gute Abs&auml;tze zu
                erzielen. </P></TD>
              </TR>

              <TR>
                <TD align="center"><IMG src="mm_ifa40.jpg" width="360" height="238"
                alt="Superteleobjektive"><BR>
                Canons Superteleobjektive zum anfassen</TD>

                <TD valign="top">Im Zelt bekam man jede Menge Prospektmaterial sowie als
                besonderes Geschenk f&uuml;r alle analogen Fotografen einen Kleinbildfilm
                f&uuml;r 24 Aufnahmen mit Werbeaufdruck der Vorz&uuml;ge der neuen Canon
                EOS 300V-Kleinbildkamera. Man konnte die neuesten und teuersten digitalen
                Spiegelreflexkameras mit angeschraubten Superteleobjektiven in die Hand
                nehmen und fotografieren. Davon wurde auch ausgiebig Gebrauch gemacht, wie
                das letzte Bild hier neben zeigt.</TD>
              </TR>

              <TR>
                <TD colspan="2">Ich bin damit nun am Ende meines R&uuml;ckblicks auf die
                IFA 2003. Ich hoffe mal der Foto-Bericht hat einige Leser des
                NoCover-Magazins interessiert und war informativ genug.<BR> <BR>
                In zwei Jahren werde ich dann von der n&auml;chsten IFA berichten und ich
                bin schon jetzt gespannt, was es dann an Neuheiten gibt.<BR> <BR>
                Mathias Klingner<BR>
                e-mail: Tschandru.Shing@berlin.de</TD>
              </TR>
            </TABLE>
          </DIV>
          <HR>
          <A href="mm_mmx.html"><FONT size="+1"><B>zur&uuml;ck</B></FONT></A>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>
