<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>Stilbl&uuml;ten</TITLE>
  </HEAD>

  <BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <H1 align="center"><FONT color="#ffff00"><B>aus
          Aufs&auml;tzen</B></FONT></H1>

          <UL>
            <LI>Die Bibel der Moslems hei&szlig;t Kodak.</LI>

            <LI>Der Papst lebt im Vakuum.</LI>

            <LI>In Frankreich hat man die Verbrecher fr&uuml;her mit der Gelatine
            hingerichtet.</LI>

            <LI>Mein Papa ist ein Spekulatius. Der verdient ganz viel Geld an der
            B&ouml;rse.</LI>

            <LI>Bei uns d&uuml;rfen M&auml;nner nur eine Frau heiraten. Das nennt man
            Monotonie.</LI>

            <LI>Bei uns hat jeder sein eigenes Zimmer. Nur Papi nicht, der muss immer
            bei Mami schlafen.</LI>

            <LI>Die Fische legen Leichen ab, um sich zu vermehren.</LI>

            <LI>Gartenzwerge haben rote M&uuml;tzen, damit sie beim Rasenm&auml;hen
            nicht &uuml;berfahren werden.</LI>

            <LI>M&auml;nner k&ouml;nnen keine M&auml;nner heiraten, weil dann keiner
            das Brautkleid anziehen kann.</LI>

            <LI>Eine Lebensversicherung ist das Geld das man bekommt, wenn man einen
            t&ouml;dlichen Unfall &uuml;berlebt.</LI>

            <LI>Am Wochenende ist Papa Sieger bei der Kaninchenschau geworden.</LI>

            <LI>Meine Eltern kaufen nur das graue Klopapier, weil das schon mal benutzt
            wurde und gut f&uuml;r die Umwelt ist.</LI>

            <LI>Eigentlich ist adoptieren besser. Da k&ouml;nnen sich die Eltern ihre
            Kinder aussuchen und m&uuml;ssen nicht nehmen, was sie bekommen.</LI>

            <LI>Adam und Eva lebten in Paris.</LI>

            <LI>Unter der Woche wohnt Gott im Himmel. Nur Sonntag kommt er in die
            Kirche.</LI>

            <LI>Mein Bruder ist vom Baum gefallen und hatte eine
            Gehirnversch&uuml;ttung.</LI>

            <LI>Die Nordhalbkugel dreht sich entgegengesetzt zur
            S&uuml;dhalbkugel.</LI>

            <LI>Wenn man Kinder haben will, muss man entweder Sex machen oder
            heiraten.</LI>

            <LI>Heiraten ist gar nicht so schlimm. Ein bisschen Sex, aber sonst geht
            es.</LI>

            <LI>Wenn ein Mann und eine Frau sich verlieben, l&uuml;gen sie sich zuerst
            ein bisschen an, damit sie sich auch f&uuml;reinander interessieren.</LI>

            <LI>Die Liebe findet einen immer, egal wie gut man sich versteckt.</LI>

            <LI>Wenn Frauen zuviel M&auml;nnersamen abbekommen, wachsen Ihnen kleine
            B&auml;rte.</LI>

            <LI>K&uuml;he d&uuml;rfen nicht schnell laufen, damit sie ihre Milch nicht
            versch&uuml;tten.</LI>

            <LI>Regenw&uuml;rmer k&ouml;nnen nicht bei&szlig;en, weil sie vorne und
            hinten nur Schwanz haben.</LI>

            <LI>Ein Pfirsich ist wie ein Apfel mit Teppich drauf.</LI>

            <LI>Wenn man kranke K&uuml;he isst, kriegt man ISDN.</LI>

            <LI>Die Fischst&auml;bchen sind schon lange tot. Die k&ouml;nnen nicht mehr
            schwimmen.</LI>

            <LI>Ich bin zwar nicht getauft, daf&uuml;r aber geimpft.</LI>

            <LI>Nachdem die Menschen aufgeh&ouml;rt haben, Affen zu sein, wurden sie
            &Auml;gypter.</LI>

            <LI>In Leipzig haben viele Komponisten und K&uuml;nstler gelebt und
            gew&uuml;rgt.</LI>

            <LI>Der Zug hielt mit kreischenden Bremsen und die Fahrg&auml;ste
            entleerten sich auf den Bahnsteig.</LI>

            <LI>Neben Prunks&auml;len hatten die Ritter auch heizbare
            Frauenzimmer.</LI>

            <LI>Alle Welt horchte auf, als Luther 1642 seine 95 Prothesen an die
            Schlosskirche zu Wittenberg schlug.</LI>

            <LI>Caesar machte das Lager voll und jeder stand stramm bei seinem
            Haufen.</LI>

            <LI>Graf Zeppelin war der erste, der nach verschiedenen Richtungen
            schiffte.</LI>

            <LI>Die Alm liegt hoch im Gebirge. Dort ist der Senner und die Sennerin. Im
            Fr&uuml;hjahr wird aufgetrieben, im Herbst abgetrieben.</LI>

            <LI>Unsere Schule war fr&uuml;her ein Waisenhaus. Daran erinnert &uuml;ber
            dem Eingang eine eingehauene Frau, die vorne einen Knaben und hinten ein
            M&auml;dchen empf&auml;ngt.</LI>

            <LI>Eine katholische Schwester kann nicht austreten, da sie zeitlebens im
            Kloster leben muss.</LI>

            <LI>Die Macht des Wassers ist so gewaltig, dass selbst der st&auml;rkste
            Mann es nicht halten kann.</LI>

            <LI>Wir gingen in den Zoo. Es war ein gro&szlig;er Affe im K&auml;fig. Mein
            Onkel war auch dabei.</LI>

            <LI>Der leichtsinnige Viehbrigadier hatte mit seinem Karren den ganzen Zaun
            umgefahren. Das Schwein konnte erst sp&auml;ter eingefangen werden.</LI>

            <LI>Mit starkem, gro&szlig;en Strahl geben die Feuerwehrleute ihr Wasser
            ab.</LI>

            <LI>Der Landwirtschaftsminister lie&szlig; die Bauern zusammenkommen, denn
            die Schweine fra&szlig;en zuviel.</LI>

            <LI>Beim Roten Kreuz widmen sich M&auml;nner und Frauen der Liebe. Manche
            tun es umsonst, andere bekommen es bezahlt.</LI>

            <LI>Dort wo jetzt die Tr&uuml;mmer ragen, standen einst stolze
            Burgfr&auml;uleins und warteten auf ihre ausgezogenen Ritter.</LI>

            <LI>Es war eine machtvolle Demonstration. Der Marktplatz war voller
            Menschen. In den Nebenstra&szlig;en pflanzten sich M&auml;nner und Frauen
            fort.</LI>

            <LI>In Lappland wohnen 2 Sorten Menschen. Die reichen Lappen fahren im
            Rentiergespann, die armen Lappen gehen zu Fu&szlig;. Daher der Name
            Fu&szlig;lappen.</LI>

            <LI>Auch wohnen dort die Menschen sehr dicht zusammen. Daher das
            Sprichwort: Es l&auml;ppert sich zusammen.</LI>

            <LI>Die Streichh&ouml;lzer m&uuml;ssen gut versteckt werden, damit sie
            keine kleinen Kinder bekommen.</LI>

            <LI>Meine Tante schenkte mir eine Sparb&uuml;chse. Sie war ein Schwein. Sie
            hatte 2 Schlitze. Hinten einen f&uuml;rs Papier, und vorne f&uuml;rs
            Harte.</LI>

            <LI>.....und wir gingen mit unserer Lehrerin im Park spazieren.
            Gegen&uuml;ber dem Park war ein Haus, wo die M&uuml;tter ihre Kinder
            geb&auml;ren. Eine Geb&auml;rmutter schaute aus dem Fenster und winkte uns
            freudig zu.</LI>

            <LI>Der Fr&uuml;hling ist der erste der 4 Jahreszeiten. Im Fr&uuml;hjahr
            legen die H&uuml;hner Eier und die Bauern Kartoffeln.</LI>

            <LI>Vom Onkel wurde das Schwein in die Scheune gebracht und dort kurzerhand
            mit dem Gro&szlig;vater geschlachtet.</LI>

            <LI>Vor 8 Tagen setzte sich meinem Vater ein zahmer Distelfink auf den
            Kopf. Dieser befand sich gerade auf dem Weg zur Arbeitsstelle.</LI>

            <LI>Als unser Hund nachts zu bellen anfing, ging meine Mutter hinaus und
            stillte ihn. Die Nachbarn h&auml;tten sich sonst aufgeregt.</LI>

            <LI>Vor 14 Tagen gab es in der Wirtschaft meiner Tante eine Schl&auml;gerei
            wegen einer Kellnerin, die sich auf der Stra&szlig;e fortpflanzte.</LI>

            <LI>Meine Tante hatte so starke Gelenkschmerzen, dass sie die Arme kaum
            &uuml;ber den Kopf heben konnte. Mit den Beinen ging es ihr ebenso.</LI>

            <LI>Vorigen Sonntag kam mein Vater sehr sp&auml;t nach Haus. Er hatte sich
            im Stadtpark vergangen.</LI>

            <LI>Die Eiskunstl&auml;uferin drehte ihre Pirouetten, dabei hob sich ihr
            R&ouml;ckchen im eigenen Wind.</LI>

            <LI>Die Gleichberechtigung der Frau wurde verwirklicht. Dies gilt auch
            f&uuml;r den Verkehr. Auch hier nimmt sie die gleiche Stellung ein.</LI>

            <LI>Die Menschen wurden fr&uuml;her nicht so alt, obwohl sie weniger
            Verkehr hatten.</LI>

            <LI>Jetzt barg sich Tell hinter einem Busch, dr&uuml;ckte los und das Werk
            der Befreiung war getan.</LI>

            <LI>Am Teich sa&szlig; eine Magd und melkte eine Kuh. Im Wasser war es
            umgekehrt.</LI>

            <LI>Die Pferde trugen Rosetten in den Landesfarben am Kopf, am Geschirr und
            an den Schw&auml;nzen. Jeder Mann war &auml;hnlich geschm&uuml;ckt.</LI>
          </UL>

          <P>Internetfundst&uuml;ck per EMail<BR>
          Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

