<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Fatih Büyüknarci -->

    <TITLE>Internetportal</TITLE>
  </HEAD>

  <BODY background="bgc.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size= "7"><B>Internetportal
          f&uuml;r junge Menschen, die es nach "Europa" .....</B></FONT></P>

          <P>Bonn/Hannover (ots) - Wer sich f&uuml;r europ&auml;ische Jugendarbeit
          interessiert, wird ab Montag, 29. September 2003, im Internet schnell
          f&uuml;ndig. Im Rahmen des 1. Forums zu Perspektiven Europ&auml;ischer
          Jugendarbeit stellt JUGEND f&uuml;r Europa den &uuml;berarbeiteten
          Webauftritt www.webforum-jugend.de in Hannover erstmals vor. Das
          Internetportal der deutschen Agentur des EU-Aktionsprogramms JUGEND
          informiert auf sechs eigenst&auml;ndigen Onlineseiten &uuml;ber die Welt
          der Macher, Praktiker und Teilnehmer europ&auml;ischer Jugendarbeit.</P>

          <H3>JUGEND f&uuml;r Europa - internationale Bildung in Deutschland</H3>

          <P>JUGEND f&uuml;r Europa ist als deutsche Nationalagentur des
          jugendpolitischen Aktionsprogramms der EU seit 15 Jahren Motor f&uuml;r die
          Entwicklung europ&auml;ischer, jugendpolitischer Zusammenarbeit in
          Deutschland. Die in Bonn sitzende Organisation fungiert als Anlaufstelle
          f&uuml;r Jugendarbeiter, die Projekte auf internationaler Ebene umsetzen
          wollen. Mit einem F&ouml;rdervolumen von zehn Millionen Euro j&auml;hrlich
          gew&auml;hrleistet sie eines der gr&ouml;&szlig;ten Bildungsangebote
          internationaler Jugendarbeit in Deutschland.</P>

          <H3>1. Forum zu Perspektiven Europ&auml;ischer Jugendpolitik</H3>

          <P>Auf dem 1. Forum zu Perspektiven Europ&auml;ischer Jugendarbeit
          diskutieren vom 29. September bis 1. Oktober 2003 auf Einladung von JUGEND
          f&uuml;r Europa rund 150 Praktiker &uuml;ber Methoden, Chancen und Probleme
          internationaler und europ&auml;ischer Jugendarbeit. Die von der Parl
          Staatssekret&auml;rin im BMFSFJ, Frau Christel Riemann-Hanewinckel, MdB,
          er&ouml;ffnete Veranstaltung in Hannover startet zeitgleich mit der
          European Youth Week, die von der EU-Kommission und dem EU-Parlament
          europaweit lanciert und in Br&uuml;ssel er&ouml;ffnet wird.</P>

          <P>Die deutsche Nationalagentur st&ouml;&szlig;t mit dem Treffen in
          Hannover eine neue Veranstaltungsreihe an, die sich in
          regelm&auml;&szlig;igen Abst&auml;nden verschiedenen Anl&auml;ssen und
          Themen widmen soll. Ziel ist es, Aktive in der europ&auml;ischen
          Jugendarbeit mit dem Programm JUGEND vertraut zu machen, sie zu vernetzen,
          Ideen zu entwickeln sowie Politik und Praxis des EU-Aktionsprogramms JUGEND
          zu er&ouml;rtern.</P>

          www.webforum-jugend.de - F&uuml;r jeden ist etwas dabei

          <UL>
            <LI>Unter www.jugendfuereuropa.de informiert die Nationalagentur &uuml;ber
            gef&ouml;rderte Projekte und Termine in der europ&auml;ischen
            Jugendarbeit.</LI>

            <LI>Unter www.go4europe.de finden junge Menschen Wissenswertes rund um den
            Europ&auml;ischen Freiwilligen Dienst (EFD).</LI>

            <LI>Unter www.youth-reporter.de schreiben Jugendliche Berichte, Geschichten
            und Tageb&uuml;cher aus aller Welt.</LI>

            <LI>Unter www.machwasdraus.de tauschen sich Jugendliche &uuml;ber
            Initiativen und so genannte Future Capitals aus.</LI>

            <LI>Unter www.salto-youth.net finden Praktiker alles rund um Fort- und
            Weiterbildung.</LI>

            <LI>Unter www.eu-jugendpolitik.de k&ouml;nnen sich User auf den neuesten
            Wissensstand in der Europ&auml;ischen Jugendpolitik bringen.</LI>
          </UL>

          <P>ots Originaltext: JUGEND f&uuml;r Europa<BR>
          Digitale Pressemappe:
          http://presseportal.de/story.htx?firmaid=43464</P>

          <P>Eingesandt: Fatih B&uuml;y&uuml;knarci
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

