<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Fatih Büyüknarci  -->

    <TITLE>Regierung pr&uuml;ft Recht auf Privatkopien</TITLE>
  </HEAD>

  <BODY background="bge.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size="5"><B>Regierung pr&uuml;ft
          Recht auf Privatkopien</B></FONT></P>

          <P>Das neue Urheberrechtsgesetz ist am vergangenen Samstag in Kraft
          getreten. Das Bundesjustizministerium (http://www.bmj.bund.de/ ) hat
          bereits damit begonnen, die &Auml;nderungen f&uuml;r den zweiten Teil der
          Urheberrechtsreform zu planen. Aus diesem Grund hatte Bundesjustizminsterin
          Brigitte Zypris in Zusammenarbeit mit dem Institut f&uuml;r Urheber- und
          Medienrecht am Dienstag zu einem Symposium mit dem Titel "Urheberrecht in
          der Informationsgesellschaft - Auftakt zum zweiten Korb" in M&uuml;nchen
          geladen. Der zweite Teil der Reform wird sich unter anderem dem Thema
          "Privatkopie" widmen. Auch nach dem neuen Urheberrechtsgesetz besteht
          weiterhin das Recht eine Kopie von urheberrechtlichen gesch&uuml;tzten
          Werken f&uuml;r private Zwecke herzustellen. Allerdings darf dabei kein
          Kopierschutz umgangen werden. Daher "muss gepr&uuml;ft werden, ob und wie
          k&uuml;nftig Privatkopien m&ouml;glich sind", hei&szlig;t es in einer
          Mitteilung
          (http://www.bmj.bund.de/ger/service/pressemitteilungen/10000790/)
          Bundesjustizministeriums und weiter: "Hier ist ein Ausgleich zwischen
          geistigem Eigentum, Verbraucherschutz sowie der Informationsfreiheit zu
          suchen."</P>

          <P>Urheberrechts-Verg&uuml;tungssystem soll reformiert werden "Mit der
          ersten Novelle hat die Bundesregierung f&uuml;r ein wirksames Urheberrecht
          in der Informationsgesellschaft gesorgt. Das jetzt geltende Recht ist
          Ergebnis eines breiten Konsenses. Das w&uuml;nsche ich mir auch f&uuml;r
          die nun anstehende Reform", sagte Bundesjustizministerin Brigitte Zypris.
          Jetzt wolle sich der Bund den Themen zuwenden, f&uuml;r die es keine
          zwingenden Vorgaben in der EU-Richtlinie "Urheberrecht in der
          Informationsgesellschaft" g&auml;be. Zypries k&uuml;ndigte an: "Vor allem
          soll das urheberrechtliche Verg&uuml;tungssystem reformiert werden." Nach
          geltendem Recht werden die urheberrechtlichen Verg&uuml;tungen auf
          bespielbare Bild- und Tontr&auml;ger sowie auf Kopier- und auf
          Aufzeichnungsger&auml;te erhoben. Durch diese Verg&uuml;tung erhalten die
          Inhaber der Urheber- und Leistungsschutzrechte einen finanziellen Ausgleich
          daf&uuml;r, dass Vervielf&auml;ltigungen ohne ihre Genehmigungen erlaubt
          sind. Das als Grundlage dienende Konzept der Legalisierung der Privatkopie
          f&uuml;r den Preis der Ger&auml;teabgabe wurde 1965 beschlossen. Die
          Ger&auml;tehersteller h&auml;tten aber bereits darauf hingewiesen, dass es
          inzwischen technische M&ouml;glichkeiten g&auml;be, um Inhalte zu
          sch&uuml;tzen und kontrolliert abrufen zu lassen. "Deshalb liege ein
          Wechsel von der kollektiven Wahrnehmung der Rechte zur individuellen
          Verwertung etwa im Wege des Digital Rights Management nahe", hei&szlig;t es
          in der Mitteilung des Bundesjustizministeriums.</P>

          <P>Quelle:<BR>
          http://www.pcwelt.de/news/recht/34036/<BR>
          http://www.pcwelt.de/news/recht/34036/2.html</P>

          <P>Eingesandt von: Fatih B&uuml;y&uuml;knarci</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

