<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Fatih Büyüknarci -->

    <TITLE>Sparma&szlig;nahmen gef&auml;hrden die IT-Sicherheit</TITLE>
  </HEAD>

  <BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary="Seitenlayout mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size= "5"><B>Sparma&szlig;nahmen
          gef&auml;hrden die IT-Sicherheit deutscher Unternehmen</B></FONT></P>

          <P>Hamburg (ots) - Trotz der j&uuml;ngsten Viren-Attacken stocken deutsche
          Unternehmen ihre IT-Sicherheitsbudgets nicht auf. Im Gegenteil: Sieben von
          zehn Firmen (68 Prozent) wollen ihre Ausgaben einfrieren oder gar senken -
          zehn Prozent mehr als noch 2002. Ein gef&auml;hrlicher Spartrend, denn
          mangelnde Sicherheit kommt die Unternehmen teuer zu stehen. Insgesamt
          stiegen die finanziellen Verluste pro Sicherheitsversto&szlig; im
          vergangenen Jahr an. Das ist ein Ergebnis der Studie "IT-Security 2003" der
          Informationweek. Sie wurde f&uuml;r Deutschland von Mummert Consulting mit
          ausgewertet.</P>

          <P>Das Hauptproblem in Deutschland sind Angriffe durch Computerviren und
          W&uuml;rmer. Auf Platz zwei bei den Sicherheitsverst&ouml;&szlig;en: So
          genannte Denial-of-Service-Attacken, die zum Ziel haben, die angegriffenen
          Systeme lahm zu legen. Die Mehrzahl der Unternehmen ermittelt inzwischen,
          welche finanziellen Sch&auml;den die Sicherheitsverst&ouml;&szlig;e
          anrichten. Der Anteil der Firmen, die nicht wissen, welche Verluste ein
          Angriff bringt, hat sich auf 18 Prozent halbiert. Der Gro&szlig;teil der
          Angriffe geht dabei f&uuml;r die Unternehmen glimpflich ab: 44 Prozent
          bleiben ohne finanzielle Folgen. Weitere 29 Prozent kosten umgerechnet
          weniger als 9.000 Euro. Daher sch&auml;tzen Firmen die finanziellen
          Verluste bei Angriffen auch als weniger gravierend ein. Sie stehen auf der
          Liste der schlimmsten Auswirkungen nur an f&uuml;nfter Stelle.</P>

          <P>An erster Stelle der Auswirkungen steht der Ausfall von
          Gesch&auml;ftsanwendungen. Top zwei ist der Ausfall des Netzwerks. Trotz
          der zunehmenden Attacken verst&auml;rken die Unternehmen ihre
          Sicherheitsma&szlig;nahmen nicht. Gaben im Jahr 2002 noch 27 Prozent der
          Unternehmen an, mehr in die IT-Sicherheit investieren zu wollen, sind es
          jetzt nur 24 Prozent. Gleichzeitig stieg die Zahl der Firmen, die weniger
          oder gleich viel ausgeben werden, von 58 auf 68 Prozent. Hintergrund: Die
          Unternehmen treten allgemein auf die Kostenbremse, sparen somit auch bei
          vorbeugenden Sicherheitsma&szlig;nahmen.</P>

          <P>Der Grad der IT-Sicherheit wird von der H&ouml;he der Investitionen
          bestimmt -und diese schrumpfen. Nur 15 Prozent der Unternehmen gehen davon
          aus, dass sich Sicherheit auch wirtschaftlich rechnet. Sie rechtfertigen
          ihre Sicherheitsinvestitionen &uuml;ber den Return on Investment. Die
          Praxis bei den Budgetberechnungen der meisten Unternehmen sieht jedoch
          anders aus: Das erste Ziel der Sicherheitsma&szlig;nahmen ist f&uuml;r rund
          drei Viertel der Befragten Risikobegrenzung. Sie sehen bei
          Sicherheitsinvestitionen eher die Kosten als den Nutzen. Die Folge: Von
          Vorsorge kann bei der IT-Sicherheit kaum gesprochen werden. Deutsche Firmen
          betreiben eher Schadensbegrenzung.</P>

          <P>Ein weiteres Problem f&uuml;r die Unternehmen: IT-Sicherheit wird
          h&auml;ufig nur als Chefsache gesehen. Der einzelne Mitarbeiter f&uuml;hlt
          sich nicht verantwortlich f&uuml;r die Sicherheit seiner Daten. 27 Prozent
          der Unternehmen beklagen einen Mangel an generellem Problembewusstsein bei
          ihren Mitarbeitern, wenn es um die IT-Sicherheit geht. Die Folge: Drei
          F&uuml;nftel der befragten Firmen wollen innerhalb der n&auml;chsten 12
          Monate das Sicherheitsbewusstsein durch Richtlinien und Verfahren bei ihren
          Mitarbeitern verbessern.</P>

          <P>ots Originaltext: Mummert Consulting AG<BR>
          Digitale Pressemappe:
          http://presseportal.de/story.htx?firmaid=50272</P>

          <P>Eingesandt von: Fatih B&uuml;y&uuml;knarci</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

