<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Miniatur Wunderland
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Text mit Bildern">
      <TR>
        <TD>
          <FONT size="+1"><B><A href="st_stx.html">zur&uuml;ck</A>&nbsp; zum Frame</B></FONT>
          <H2 align="center">
            <B>Miniatur Wunderland</B>
          </H2>
          <P>
            <B>Hinweis:</B> Die Landschaftsbilder lassen sich vergr&ouml;&szlig;ern
          </P>
          <P>
            <A href="st_strasse.jpg" target="_parent"><IMG src="st_strasse_mini.jpg" alt="Nr.1: Der Hamburger Michel in klein" width="200" height="200" align="left" hspace="12"></A> Wer schon einmal
            in der Hansestadt Hamburg war, dem ist die Speicherstadt bestimmt ein Begriff: gro&szlig;e Backsteinh&auml;user, die von einer Seite vom Wasser zu erreichen sind und zum lagern von Waren
            genutzt wurden und noch werden. Nun werden aber l&auml;ngst nicht mehr so viele Waren in der Speicherstadt zwischengelagert, und so stehen ettliche von diesen Speichern leer. Das hat aber
            auch sein gutes, hat doch eine so sinnvolle Einrichtungen wie das <A href="http://www.miniatur-wunderland.de/html/framepage.htm">Miniatur Wunderland</A> seit Mitte 2000 hier seine Heimat
            gefunden.<BR>
             <IMG src="st_cola-lkw.jpg" alt="Nr.2: Coka Cola Truck in Aktion" width="200" height="150" align="right" hspace="12"> Das Miniatur Wunderland liegt im vierten Stock eines Speichers, ist
            aber auch &uuml;ber einen Fahrstuhl zu erreichen. Was hat es nun mit diesem Wunderland auf sich?<BR>
             Wie der Name schon sagt, handelt es sich hier um ein Wunderland, aber nicht in Form eines Vergn&uuml;gungspark`s, sondern es handelt sich um eine Darstellung von Deutschland mit "einer"
            Modelleisenbahnanlage.<BR>
             Man mu&szlig; sich das nun nicht so vorstellen wie eine Landkarte, sondern es werden hier Landschaften nachgebildet. So sehen wir hier eine K&uuml;stenlandschaft, dort den Harz und in
            einem extra Raum, mit unter- und &uuml;berirdischen Gleisen verbunden, die Alpen.<IMG src="st_feuerwehr.jpg" alt="Nr.3: zwei Feuerwehrfahrzeuge" width="200" height="150" align="left"
            hspace="12"> Das sind zusammen ca. 5000 m Gleise und eine Fl&auml;che der Anlage von 540 m&sup2;. Die Z&uuml;ge rollen &uuml;berwiegend auf K-Gleis von M&auml;rklin, aber auch
            Fleischmann- und Roccogleise werden genutzt. Die Landschaften sind sehr realistisch und mit Szenen aus dem t&auml;glichen Leben dargestellt.<A href="st_bruecke_seitlich.jpg" target=
            "_parent"><IMG src="st_bruecke_seitlich_mini.jpg" alt="Nr.4: Die K&ouml;hlbrandbr&uuml;cke von der Seite" width="200" height="150" align="right" hspace="12"></A><BR>
            <BR>
             Beispiel Hamburg:<BR>
             Hier wurde die St. Michaelis-Kirche (Hamburger Michel) mitsamt H&auml;usern und Strassen nach gebildet. Der Verkehr flie&szlig;t (oder auch nicht), es gibt Ampeln, Kreuzungen und
            Bahn&uuml;berg&auml;nge mit all ihren Auswirkungen auf den Strassenverkehr. Es existiert eine teilnachbildung des Hafen`s und der K&ouml;hlbrandbr&uuml;cke. Die Fahrzeuge stehen an
            Kreuzungen, warten mit eingeschalteten Blinkern und Licht. Z&uuml;ge rattern durch die Landschaften. <A href="st_bruecke_vorn.jpg" target="_parent"><IMG src="st_bruecke_vorn_mimi.jpg"
            alt="Nr.5: Die K&ouml;hlbrandbr&uuml;cke von oben" width="200" height="150" align="left" hspace="12"></A> Viermal in der Stunde wird es Nacht. Langsam wird das Licht ged&auml;mpft, in den
            H&auml;user gehen nach und nach Lichter an und die Auto`s suchen sich mit kleinen Scheinwerfer ihren Weg. Hat man Gl&uuml;ck, sieht man auch einen roten Coka Cola-Truck durch die Strassen
            fahren,<A href="st_deich.jpg" target="_parent"><IMG src="st_deich_mini.jpg" alt="Nr.6: Besucher am Deich" width="133" height="200" align="right" hspace="12"></A> &uuml;ber und &uuml;ber
            mit kleinen L&auml;mpchen (LED`s) dekoriert.
          </P>
          <P>
            Fahren die Auto`s "selbstst&auml;ndig" wie von Geisterhand bewegt auf ihren Wegen, so ist das Schauspiel aber erst perfekt, wenn sich ein (gestellter) Unfall ereignet. Brennt
            beispielsweise ein Lkw, das Feuer simmulieren dutzende kleiner LED`s, auf einer Br&uuml;cke, r&uuml;ckt nun die Feuerwehr aus. Voraus ein Leitfahrzeug, dahinter mehrere
            Feuerl&ouml;sch-Lkw`s und wieder ein Leitfahrzeug. Die Leitfahrzeuge stellen sich quer und sperren die Strasse ab, dann kreisen die Feuerl&ouml;schfahrzeuge den brennenden Lkw ein.<A
            href="st_harz.jpg" target="_parent"><IMG src="st_harz_mini.jpg" alt="Nr.7: Der Harz" width="200" height="150" align="left" hspace="12"></A> Alles mit viel Tat&uuml;tatta, eben wie im
            richtigen Leben. Nach der Brandbek&auml;mpfung zieht sich der ganze L&ouml;schzug wieder in die Feuerwache zur&uuml;ck.<BR>
             &Auml;hnliches Specktakel bei einem Schlossbrand auf einem H&uuml;gel: Fahrzeug f&uuml;r Fahrzeug arbeitet sich auf einer Einspurigen Strasse zu dem brennenden Schloss vor. Man hat das
            Gef&uuml;hl, die Fahrzeuge werden von kleinen Menschen gelenkt.<BR>
             <A href="st_kirmes.jpg" target="_parent"><IMG src="st_kirmes_mini.jpg" alt="Nr.8: Volksfest bei Nacht" width="200" height="150" align="right" hspace="12"></A> Aber da gibt es auch ein
            Leben neben der Strasse.<BR>
             Die Darsteller dieses Lebens sind tausende kleine handbemalte Plastikfiguren, die in Szenen stehen, die das Leben schrieb.<BR>
             Da gibt es einen Wohnmobil-Park, an dem an einem Wohnmobil M&auml;nner Schlange stehen (warum, weiss ich nicht). Hier wird demonstriert, da eine Grube ausgehoben oder in einer
            Autowerkstatt an einem Fahrzeug geschwei&szlig;t <A href="st_ice.jpg" target="_parent"><IMG src="st_ice_mini.jpg" alt="Nr.9: Auch das ist im Harz" width="200" height="150" align="left"
            hspace="12"></A> (mit flackerndem blauen Licht). Da gibt es einen Zirkus, dort ein Sch&uuml;tzenfest. Es gibt so viel zu entdecken, soviel zu sehen, man glaubt es kaum.<BR>
             Selbst die AOL-Arena, das Hamburger Fussballstadion, wurde nachgebaut. Neben funktionierenden Video-W&auml;nden sitzen ca. 12000 der kleinen Leute, schauen Fussball und fotografieren. In
            der Welt der Berge liegt alles voller Schnee, es fahren Sessellift und Seilbahn.<A href="st_weide_detail.jpg" target="_parent"><IMG src="st_weide_detail_mini.jpg" alt=
            "Nr.10: Achtern Diek (Hinterm Deich)" width="200" height="150" align="right" hspace="12"></A><BR>
             Hier wie dort gibt es alle paar Meter einen Schalter, mit dem sich Teile der Anlage durch den Besucher in Bewegung setzten lassen. Auch an die kleinen Eisenbahner wurde gedacht, haben
            die doch eine kleine Modellbahn in "gro&szlig;" f&uuml;r sich alleine.<BR>
             In den gleichen R&auml;umlichkeiten befindet sich auch eine Cafeteria.<A href="st_windraeder.jpg" target="_parent"><IMG src="st_windraeder_mini.jpg" alt="Nr.11: Die Windmaschinen" width=
            "200" height="200" align="left" hspace="12"></A><BR>
             Ich schlage vor, fahrt hin und geniesst diese Anlage, aber nehmt Zeit mit, denn so schnell kann man sich nicht los rei&szlig;en...<BR>
             Ach ja, fast vergessen zu erw&auml;hnen: das Wunderland wird gerade vergr&ouml;ssert.<BR>
             Zuwachs erh&auml;lt es durch Amerika mit seinem Grand Canyon und typischen Amerikanischen Z&uuml;gen. <IMG src="st_polizei.jpg" alt="Nr.12: Auch f&uuml;r Sicherheit wurde gesorgt" width=
            "200" height="150" align="right" hspace="12"><BR>
          </P>
          <P>
            <BR>
            <BR>
            <BR>
            <BR>
            <BR>
            <BR>
             <B>Die &Ouml;ffnungszeiten:</B> t&auml;glich von 10.00 - 18.00 Uhr
          </P>
          <P>
            <B>Zu den Eintrittspreisen:</B><BR>
             Kinder unter 1 Meter.... Frei<BR>
             Kinder unter 16 ............. 5 &curren;<BR>
             Erwachsene .................... 8&curren;<BR>
             Es gibt auch g&uuml;nstigere Gruppenpreise.
          </P>
          <P>
            <B>Adresse:</B><BR>
             Miniatur Wunderland Hamburg im Kultur &amp; Gewerbespeicher / Speicherstadt<BR>
             Kehrwieder 2 Block D, 20457 Hamburg
          </P>
          <P>
            Ein Besuch der Homepage <A href="http://www.miniatur-wunderland.de/html/framepage.htm">Miniatur Wunderland</A> lohnt sich allemal, sind hier doch ausf&uuml;hrlich bebilderte
            Wegbeschreibungen aus allen Himmelsrichtungen vorhanden.
          </P>
          <H6>
            <B>Bildnachweis:</B><BR>
             Bilder 2, 3, 7, 8, 12 (c) Miniatur Wunderland<BR>
             Bilder 1, 4, 5, 6, 9, 10, 11 (c) J. Sperling
          </H6>
          <BR>

          <HR>
          <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="213" height="50">
          </CENTER>
          <FONT size="+1"><B><A href="st_stx.html">zur&uuml;ck</A>&nbsp; zum Frame</B></FONT>
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

