<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="Eine Seite mit Witzen">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="st_einnoch.jpg" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>
           <BR>

          <P>
            Am Badeteich. Der ganze Tag war ein Kampf gegen die M&uuml;cken.<BR>
             Mit der D&auml;mmerung tauchen pl&ouml;tzlich Gl&uuml;hw&uuml;rmchen auf. - Sagt ein Badegast zum anderen: "Ich hau jetzt ab. Die Viecher bringen jetzt schon Taschenlampen mit!"<BR>
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Eine Blondine zur anderen: "Ich habe mir gestern einen Deoroller gekauft!" - "Und, wie schnell ist der?"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Der Kunde steht unentschlossen in der Zoohandlung und betrachtet die Papageien.<BR>
             Mischt sich der Verk&auml;ufer ein: "Ich empfehle ihnen diesen Papagai, der ist sehr gut erzogen. An jedem Bein hat er ein kleines Kettchen. Wenn sie am linken Bein ziehen, sagte er
            `guten Tag`. Ziehen sie am rechten Bein, sagt er `Guten Abend`.<BR>
             Der Kunde: "Und wenn ich an beiden ziehe?" - Kreischt der Papagai: "Dann fall ich auf die Schnauze, du Vollidiot!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Du siehst aber schlecht aus Harald! Geht`s dir nicht gut?" - "Ach Max, ich war gerade in der Stadt und hab meine Erbtante besucht."<BR>
             "Und deshalb siehst du so schlecht aus. Sie hat dich enterbt!" - "Noch schlimmer: Angepummt hat sie mich!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Verona Feldbusch fliegt jetzt immer nach Indien wenn sie auf die Toilette muss. Der Grund: Als sie nach einem WC fragte, sagte man ihr, das es am Ende des Ganges liegt.
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Sagt der Vorarbeiter zu seinem Chef: "Ich bin mir ganz sicher, das unsere Handwerker durch Arbeit gl&uuml;cklich werden!"<BR>
             "Warum denn?" - "Na ja, morgens kommen die mit einem m&uuml;rrischen Gesicht in die Werkstatt und am Feierabend l&auml;cheln sie immer...!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <P>
            Gehen zwei Penner durch einen Wald. Pl&ouml;tzlich sieht der einer eine Brieftasche auf dem Weg liegen, schaut rein und schmei&szlig;t sie gleich wieder weg.<BR>
             Fragt der andere: "Na, war kein Geld drin?" - "Ja schon, aber nur Falschgeld. Oder hast du schon mal `nen F&uuml;nfziger mit zwei Nullen gesehen!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Kommt ein Unternehmer in eine Bank in der Schweiz und fl&uuml;stert zum Bankangestellten: "Ich m&ouml;chte eine Million Euro einzahlen." - Darauf der Angesprochene: "Sie k&ouml;nnen ruhig
            laut sprechen, Armut ist doch keine Schande!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Wann sagst du denn deiner Frau endlich die Meinung?" - "Hab ich schon! Willst du die Narben seh`n?"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Gestern fuhr ich mit dem Zug nach Hause. Kurz nach der Abfahrt eine Durchsage: "Meine Damen und Herren. Fangen sie bitte jetzt an nach ihren Fahrkarten zu suchen. Ich beginne in einer
            viertel Stunde mit der Kontrolle. Ihr Schaffner."
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Hey Willy, kannst du mir eine gute Unfallversicherung empfehlen?" - "Na klar, meine. Die hab ich schon seit f&uuml;nfzehn Jahre und hatte noch nicht einen Unfall!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            In der Kirche predigt der Pastor &uuml;ber das Alkoholtrinken: "Wenn ich sehe, das ein Betrunkener aus der Kneipe schwankt, w&uuml;rde ich ihm am liebsten zurufen: Du bist auf dem
            falschen Weg, kehre um!"
          </P>
          <BR>
           <BR>

          <HR width="100%" size="3">
          <P>
            Der Einheimische zum Urlauber: "Dieses alte Geb&auml;ude ist seit fast dreihundert Jahren nicht mehr ver&auml;ndert worden!"<BR>
             Darauf der Urlauber: "Kenn ich, so einen Vermieter habe ich auch!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            In der H&ouml;lle geht ein Unterteufel zu einem Oberteufel und sagt: "Ich habe eine neue H&ouml;llenqual erfunden: Ein Zimmer, eine Frau, tausend H&uuml;te aber keinen Spiegel!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Eine Freundin zur anderen: "Mensch, siehst du gut aus B&auml;rbel. Warst du im Urlaub?" - "N&ouml;, ich nicht. Aber mein Chef!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Sitzt ein Kannibale im Flugzeug. Die Stewardess will das Essen servieren: "Was darf ich
            ihnen zu essen bringen?" - Darauf der Kannibale: "Dazu muss ich mal in die
            Passagierliste schauen!" </P> <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Angestellte zum Chef: "Unsere Aktenschr&auml;nke sind proppevoll. Soll ich die Akten, die &auml;lter als zehn Jahre alt sind, vernichten?" - "Gute Idee. Aber bevor sie die Akten
            vernichten, machen sie unbedingt Kopieen davon!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>
          <P>
            Warum verhalten sich Katzen anders als Hunde bei uns Menschen?<BR>
            Der Hund denkt: "Sie f&uuml;ttern mich, sie geben mir zu trinken und eine H&uuml;tte - das m&uuml;&szlig;en G&ouml;tter sein!"<BR>
            Die Katze denkt: "Sie f&uuml;ttern mich, sie geben mir zu trinken und ein Katzenklo - f&uuml;r die Menschen mu&szlig; ich ein Gott sein!"
          </P>
          <BR>
          <HR width="100%" size="3">
          <BR>

          <P>
            Zuhause, in meiner Heimatstadt, haben sie die Sparkasse renoviert. Mein Konto ist dabei gleich mitgestrichen worden!
          </P>
          <BR>

          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>
           <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50">
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

