<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Textgestaltung</h2>

<p>Die grundlegenden Regeln f&uuml;r
die &Uuml;bermittlung von Emails sind standardisiert, es gibt aber eine
Reihe von unterschiedlichen Programmen, mit denen man Emails erstellen
kann. Es ist daher m&ouml;glich, da&szlig; die Nachricht, die Sie versandt
haben, beim Empf&auml;nger ganz anders aussieht. Sie sollten daher sehr gut
&uuml;berlegen, wie Ihr Text aussehen soll. Dieser Abschnitt wird die
erkl&auml;ren, warum Texte unterschiedlich aussehen k&ouml;nnen und wie man
dies vermeiden kann. </p>

<h3>Kreativ gestaltete Texte</h3>

<p>Einige Email-Programme k&ouml;nnen nur schlichte Texte darstellen.
Kursive Buchstaben, Fettschrift oder Farben werden durch Befehlszeichen
dargestellt. Sie haben z.B. so etwas versendet:</p>

<p><tt>Hallihallo! Ich fand Euer Lied bei der Party <i>super</i>! <b>Gute
Arbeit!!</b></tt></p>

<p>wenn die Software des Empf&auml;ngers solche Formatierungen aber nicht
interpretieren kann, wird er folgendes sehen:</p>

<p><tt>Hallihallo! Ich fand Euer Lied bei der Party
&lt;i&gt;super&lt;/i&gt;! &lt;b&gt;Gute Arbeit!!&lt;b&gt;</tt></p>

<p>Formatierte Emails und Internet-Seiten kann
man mit einigen Email-Programmen nur schwer lesen. Wenn Sie die Wahl haben,
diese als einfachen Text oder im HTML-Code zu versenden, sollten Sie
bedenken, welche M&ouml;glichkeiten Ihr Partner hat.</p>

<h3>Erweiterte Zeichens&auml;tze</h3>

<p>Als um 1982 die Email-Spezifizierungen erstellt wurden, wurde
entschieden, da&szlig; nur 128 verschiedene Zeichen (die Buchstaben,
Zahlen, Satzzeichen etc.) in Emails verwendet werden d&uuml;rfen. Dies
lie&szlig; Platz f&uuml;r Fehlerkorrekturen - sehr wichtig, wenn Computer
&uuml;ber Modem miteinander kommunizieren. </p>

<p>Heute sieht es im Netz aber anders aus. Buchstaben wie &auml;, &ccedil;,
und &Oslash; sind f&uuml;r viele Internet-Nutzer wichtig geworden. Daher
gibt es heute eine M&ouml;glichkeit, 256 verschiedene Buchstaben in Emails
darzustellen, die &quot;quoted-printable&quot; (Sonderzeichen bzw. Umlaute
darstellen) genannt wird.</p>

<p>Ungl&uuml;cklicherweise ist die &Uuml;bermittlung von Emails technisch
immer noch auf 128 Zeichen begrenzt. Daher wird die Email zun&auml;chst in
den &quot;begrenzten&quot; Zeichensatz konvertiert, &uuml;bermittelt und
dann beim Empf&auml;nger (hoffentlich) zur&uuml;ck&uuml;bersetzt. Wenn nun
die Empf&auml;nger-Software die Darstellung von Sonderzeichen nicht
unterst&uuml;tzt, werden die zus&auml;tzlichen Buchstaben durch ein
Gleichheitszeichen und einem Buchstaben/Zahlen-Code oder durch andere (an
diesen Stellen) unpassende Zeichen dargestellt:</p>

<p><tt>Heute sieht es im Netz aber anders aus als 1982. Buchstaben wie =E4,
=E7 und =D8= sind f=FCr viele Internet-Nutzer wichtig geworden. Daher gibt
es heute eineM=F6glichkeit, 256 verschiedene Buchstaben in Emails
darzustellen, die"quoted-printable" (Sonderzeichen bzw. Umlaute darstellen)
genannt wird.</tt></p>

<p> Warum sollte Sie das interessieren? Sie m&uuml;ssen sich leider
daf&uuml;r interessieren, weil es spezielle Zeichen gibt, die Sie
m&ouml;glicherweise benutzen und die NICHT Teil des Standard-Zeichensatzes
sind, die aber von einigen Programmen eingesetzt werden. Auch wenn die
Software des Empf&auml;nger Ihrer Nachricht solche erweiterten
Zeichens&auml;tze konvertieren kann, verwenden leider verschiedene Computer
verschiedene Symbole f&uuml;r denselben Code.</p>

<p>Ein Beispiel: das Trademark-Symbol, Aufz&auml;hlungspunkte und
typographische Anf&uuml;hrungszeichen sind erlaubte Zeichen bei Windows95
und MacOS, werden aber an verschieden Pl&auml;tzen des Codes gef&uuml;hrt.
W&auml;hrend Windows95 &uuml;berzeugt ist, da&szlig; das Zeichen mit der
Nummer 241 das &ntilde; ist, meint das MacOS, da&szlig; das Zeichen
&Ograve; an dieser Stelle ist. Dies ist ein weiterer Grund, sich Gedanken
&uuml;ber die Email-Software Ihres Gegen&uuml;bers Gedanken zu machen.</p>

<h3>Web Links</h3>

<p>Einige Email-Programme erkennen URLs (<i>Uniform Resource Locators</i>:
Web-Adressen) innerhalb eines Textes und erm&ouml;glichen, diese
&quot;anzuklicken&quot;. Solche Programme gehen davon aus, da&szlig; alles
hinter http:// eine Web-Adresse ist. Achten Sie daher darauf, immer http://
zu schreiben, um eine Web-Adresse einzubauen. Ich kenne z.B. kein Programm
das www.webfoot.com als URL erkennt.</p>

<p>Sie sollten aber vorsichtig mit Satzzeichen unmittelbar hinter der URL
sein - insbesondere mit Punkten. Sehen Sie sich z.B. diese Nachricht
an:</p>

<p><tt>Hi - Die URL ist http://www.webfoot.com/writings.html. Schau, ob es
Dir gef&auml;llt.</tt></p>

<p>Das Programm des Empf&auml;ngers k&ouml;nnte denken, da&szlig; der Punkt
am Ende der URL noch zur URL geh&ouml;rt. Oder der Empf&auml;nger
k&ouml;nnte, wenn das Programm keine URLs erkennt, zuviel kopieren. In
beiden F&auml;llen f&uuml;hrt die (zwangsl&auml;ufig folgende)
Fehlermeldung des Internet-Browser dazu, da&szlig; der Empf&auml;nger
denkt, da&szlig; die Seite nicht exisitiert, Sie aber das Gegenteil
behaupten. Ich gebe zu, es sieht nicht sch&ouml;n aus, wenn man nach der
URL eine zus&auml;tzliche Leerstelle einf&uuml;gt, es vermeidet aber solche
Probleme.</p>

<p><tt>Hi - Die URL ist http://www.webfoot.com/writings.html . Schau, ob es
Dir gef&auml;llt.</tt></p>

<p>Menschen, die gern Ausschneiden und Kopieren, w&auml;hlen manchmal auch
zuwenig aus. Da HTML-Dokumente sowohl das Suffix .html als auch .htm haben
k&ouml;nnen, kann es also auch hier zu einen schweren Fehler kommen. Um das
ausschneiden und kopieren zu vereinfachen sollte Sie daher URL immer in
eigene Zeilen setzen:</p>

<p><tt>Hi - Die URL ist </tt></p>

<p><tt>http://www.webfoot.com/writings.html </tt></p>

<p><tt>Schau, ob es Dir gef&auml;llt.</tt></p>

<p>Richtig beobachtet - der Punkt nach der URL fehlt jetzt v&ouml;llig!
Sicher ist dies nicht grammatikalisch korrekt, aber ich bin der Meinung,
da&szlig; Grammatik zugunsten eines besseren und sicheren Ausschneiden und
Kopierens zur&uuml;ckstehen kann.<br> </p>

<h3>Interpunktion und Anf&uuml;hrungszeichen</h3>

<p>Eine andere grammatikalische Regel, die ich regelm&auml;&szlig;ig
breche, ist die Platzierung der Interpunktion. Grammatikrichtlinien sagen,
da&szlig; die Interpunktion innerhalb der Anf&uuml;hrungszeichen stehen
m&uuml;ssen, z.B. der Punkt im folgenden Satz:</p>

<p><tt>Bob sagte, &quot; Ich liebe sie so sehr.&quot;</tt></p>

<p>Das ist ok, solange der Text innerhalb der Anf&uuml;hrungsstriche
normale Rede ist, aber es kann Probleme verursachen, wenn z.B.
Computereingaben (Passwords etc.) behandelt werden. Betrachten Sie:</p>

<p><tt>Wenn Sie aufgefordert werden, ein Password einzugeben, schreiben Sie
&quot;smiley.&quot;</tt></p>

<p>Ist der Punkt etwas, das zum Password geh&ouml;rt oder nicht? Ich ziehe
es vor, hier dies zu schreiben:</p>

<p><tt>Wenn Sie aufgefordert werden, ein Password einzugeben, schreiben Sie
&quot;smiley&quot;.</tt></p>

<p>Damit ist klar, da&szlig; der Punkt nicht zum Password geh&ouml;rt. Sie
k&ouml;nnen nun, je nach Anla&szlig; die Satzzeichen in die
Anf&uuml;hrungsstriche nehmen oder nicht - ich denke aber, da&szlig; es
besser ist, hier einheitlich zu handeln.</p>

<p>Wenn Sie solche und &auml;hnliche &quot;Verst&ouml;&szlig;e&quot; nicht
dulden k&ouml;nnen oder wollen, ver&auml;ndern Sie einfach den Satz, damit
es solche Probleme nicht gibt:</p>

<p><tt>Wenn Sie aufgefordert werden, ein Password einzugeben, schreiben Sie
&quot;smiley&quot; und dr&uuml;cken Sie dann die Return-Taste.</tt></p>

<p>oder wenn Sie es ganz sicher machen wollen:</p>

<p><tt>Wenn Sie aufgefordert werden, ein Password einzugeben, schreiben Sie
smiley und dr&uuml;cken Sie dann die Return-Taste.</tt></p>

<h3>Anh&auml;nge (Attachments)</h3>

<p>Einige Mail-Programme unterst&uuml;tzen &quot;Anh&auml;nge&quot;, um
Dokumente per Email zu senden. Dies erlaubt, jede m&ouml;gliche Datei in
irgendeinem Format an andere zu senden. GIF- und JPEG-Bilder,
Word-Dokumente, WordPerfect-Dokument und Photoshop-Dateien sind ein kleiner
Ausschnitt dessen, was Sie auf diese Art und Weise versenden k&ouml;nnen.
Wenn der Empf&auml;nger ein Programm hat, das mit Anh&auml;ngen umgehen
kann, ist dies ein &auml;u&szlig;erst praktisches Instrument. Wenn die
Software aber nicht mit Anh&auml;ngen umgehen kann, ist das Ergebnis bei
ihm ein Haufen Datenm&uuml;ll.</p>

<p>Doch selbst, wenn die &Uuml;bermittlung klappt kann es noch eine Reihe
anderer Probleme geben: ein Macintosh-Programm l&auml;uft z.B. nicht auf
einem Windows-Rechner und Windows95-Programme laufen wiederum nicht auf
Rechner mit DOS.</p>

<p>Und selbst wenn all diese Klippen umschifft sind, wissen Sie in der
Regel nichts &uuml;ber die Hardware Voraussetzungen Ihres Partners - wenn
er z.B. von zuhause seine Emails abruft, wird er sich wenig &uuml;ber ein
200MB-Video freuen - egal wie lustig es ist.</p>

<p>Es ist fast immer besser, z.B. einfach die URL der Datei per Email
weiterzugeben. Man kann dann selbst entscheiden, ob man sich die
entsprechende Datei herunterladen will. Wenn es aber nicht anders geht,
fragen Sie den Empf&auml;nger am besten vorher, ob er gro&szlig;e Dokumente
empfangen kann - und will!</p>

<hr>

<h3>Zusammenfassung</h3>

<p>Wenn Sie nichts &uuml;ber das Email-Programm Ihres Partners wissen -
seien Sie vorsichtig!<ul>
<li>Verwenden Sie keinen formatierten Text!
<li>Verwenden Sie keine Sonderzeichen!
<li>Versenden Sie Web-Seiten als einfache Textdatei!
<li>Seien Sie vorsichtig mit Anh&auml;ngen! </ul></p>

<p>Passen Sie im &uuml;brigen beim Einsatz von Interpunktion darauf auf,
da&szlig; diese URLS oder Zitate nicht verf&auml;lschen.</p>

<hr>

<p>Weiter zum Thema <a href="onl_email03.html">Seiten-Layout</a><br>
zur&uuml;ck zum Thema <a href="onl_email01.html">inhaltlichen Zusammenhang</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>

<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;
</body>
 </html>

