<!-- saved from url=(0022)http://internet.e-mail -->
<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.75 [de]C-CCK-MCD QXW0325g  (Win95; U) [Netscape]">
   <title>Par Net</title>
</head>
<body text="#333300" bgcolor="#FFFFCC" link="#666600" vlink="#FFCC00" alink="#999900">
<font face="Arial,Helvetica"><b>Parnet - die billige Verbindung
zwei Amigas</b> Test Dezember 1994</font>
<p><font face="Arial,Helvetica">Sp&auml;testens seit dem Erscheinen der
aktuellen AA-Amigas Al200 und A4000 ist es sicherlich keine Seltenheit
mehr, da&szlig; so mancher Amiga User &uuml;ber zwei "Freundinnen" verf&uuml;gt.
Nichts liegt n&auml;her, als diese beiden miteinander zu verbinden, um
Dateien oder Programme vom einen auf den anderen Rechner zu &uuml;bertragen,
beziehungsweise gegenseitig auf vorhandene Datentr&auml;ger wie Festplatten"
Disketten. oder CDROM-Laufwerke zugreifen zu k&ouml;nnen.</font>
<p><b><font face="Arial,Helvetica">Serielle Verbindung</font></b>
<br><font face="Arial,Helvetica">Eine M&ouml;glichkeit hierf&uuml;r besteht
durch die Verbindung beider Amigas mittels eines sogenannten Nullmodem-Kabel
&uuml;ber die serielle Schnittstelle (RS232). Dieses Kabel mu&szlig; unbedingt
auf die Pinbelegung des Amiga zugeschnitten sein. Falls Sie ein solches
Amiga-kompatibles Kabel nirgends finden, k&ouml;nnen Sie es sich auch selbst
zusammenbasteln. Sie ben&ouml;tigen hierzu im einfachsten Fall ein dreipoliges,
besser aber ein f&uuml;nfpoliges abgeschirmtes Kabel, zwei 25polige Sub-DStecker
("weibliche" Buchsenstecker), einen Elektronik-L&ouml;tkolben und geeignetes
L&ouml;tzinn.</font>
<br>&nbsp;
<center><table BORDER COLS=1 WIDTH="9%" >
<tr>
<td>
<center><img SRC="parnet_1.jpg" ALT="Abb. 1" height=276 width=378></center>
</td>
</tr>

<tr>
<td>
<center><font face="Arial,Helvetica">Belegungsschema f&uuml;r die serielle
Verbindung</font></center>
</td>
</tr>
</table></center>

<p><font face="Arial,Helvetica">In Bild 1 sehen Sie den Belegungsplan f&uuml;r
das serielle Verbindungskabel. Pin 2 (Transmit Data) des einen Steckers
wird mit Pin 3 (Receive Data) des zweiten Steckers verbunden, sowie Pin
3 (Receive Data) des ersten mit Pin 2 (Transmit Data) des zweiten Steckers
verl&ouml;tet. Pin 7 (Ground)beider Stecker werden direkt verbunden, um
die gemeinsame Masseverbindung zu gew&auml;hrleisten. Falls Sie beabsichtigen
ein &Uuml;bertragungsprotokoll (z. B. RTS/CTS) zu aktivieren, ist es erforderlich,
auch die Pins 4 und 5 &uuml;ber Kreuz miteinander zu verbinden, wie bei
Pin 2 und 3. Die Verwendung eines solchen Protokolls ist aber f&uuml;r
diesen Zweck nicht unbedingt notwendig, da es kaum wahrscheinlich ist,
da&szlig; Obertragungsfehler wie bei der Daten&uuml;bertragung per Telefonleitung
auftreten werden.</font>
<p><font face="Arial,Helvetica">Vermeiden Sie es tunlichst die Pins 9 und
10 miteinander zu verbinden, da an diesen auf der Computerseite eine Spannung
von 12Volt anliegt, sie zur Zerst&ouml;rung der CIA-Chips Ihrer Amigas
f&uuml;hren w&uuml;rde. Wollen Sie ein herk&ouml;mmliches Modemkabel verwenden,
so m&uuml;ssen Sie dieses zuerst entsprechend modifizieren. &Uuml;berpr&uuml;fen
Sie die Pinbelegung genauestens, bevor Sie Ihre beiden Amigas miteinander
'verkabeln".</font>
<p><font face="Arial,Helvetica">Mit Hilfe eines Terminalprogrammes wie
"Term" oder 'NComm", das auf beiden Rechnern mit den selben Parametern
installiert und a.ufgerufen wird, k&ouml;nnen diese dann miteinander kommunizieren.
Dabei m&uuml;ssen alle &Uuml;bertragungsparameter &uuml;bereinstimmen,
also die Baud-Rate, die Parit&auml;t, die Wortl&auml;nge (Bits/Zeichen),
die Stopbits und das &Uuml;bertragungsprotokoll. Sobald die Verbindung
zustandekommt, ist es m&ouml;glich, Daten zwischen den Amigas auszutauschen,
genauso wie bei der Daten&uuml;bertragung per Modern.</font>
<p><font face="Arial,Helvetica">Diese Vorgehensweise birgt allerdings gewisse
Nachteile. Zum einen sind die m&ouml;glichen Ubertragungsraten &uuml;ber
die serielle Schnittstelle nicht gerade berauschend, zum anderen ist der
Datenaustausch eben nur &uuml;ber das Terminalprogramm m&ouml;glich, wobei
man auf den Komfort der Workbench oder eines DirectoryUtility wie DirOpus
verzichten mu&szlig;.</font>
<p><font face="Arial,Helvetica">Shell-Freaks haben jedoch die M&ouml;glichkeit,
das logische Ger&auml;t AUX: anzumelden (mount AUX:). Hierzu &ouml;ffnet'man
auf dem einen Amiga am besten eine Shell, und wenn AUX: angemeldet wurde,
gibt man den Befehl "newshell AUX:&raquo; ein. Auf dem zweiten Amiga wird
dadurch ebenfalls eine Shell gestartet. Nun k&ouml;nnen Dateien und Programme
&uuml;ber die g&auml;ngigen Shellbefehle (z.B. dir, cd, copy usw.) ausgetauscht
und bearbeitet werden.</font>
<p><b><font face="Arial,Helvetica">Parallele Verbindung</font></b>
<br><font face="Arial,Helvetica">G&auml;nzlich anders verh&auml;lt es sich
mit der parallelen Schnittstelle. Dank des hervorragenden Freeware-Programmpaketes
"ParNet" l&auml;&szlig;t sich n&auml;mlich ein kleines aber feines Netzwerk
f&uuml;r zwei Amigas installieren.</font>
<p><font face="Arial,Helvetica">ParNet stammt von Doug Walker und John
Toebes, die auch unter dem Namen 'The Software Distillery" bekannt sind.
Das Herzst&uuml;ck von ParNet, das "parnet.device", wurde von der allseits
bekannten Amiga-Pers&ouml;nlichkeit Matt Dillon (DICE) geschaffen. Zu finden
ist dieses Paket zum Beispiel auf der Fish-Disk 400, der SaarAG 569, der
Aminet-CD-ROM oder auf den CDPD-CD-ROMs von Almathera. Im letzteren Fall
ist das ParNetSystem bereits fertig installiert, um auf Amiga-CDTV oder
A500 mit A570 CD-ROM Laufwerk nach dem Booten eingesetzt werden zu k&ouml;nnen.
Au&auml;erdem befindet sich hier die neueste Version des "parnet.device&raquo;,
sowie einige andere Hilfsprogramme (siehe weiter unten).</font>
<p><font face="Arial,Helvetica">Bevor das Netz installiert werden kann,
ben&ouml;tigen Sie aber ein geeignetes Kabel f&uuml;r die parallele Schnittstelle
Ihrer beiden Amigas. Manche Anbieter verkaufen bereits entsprechend modifizierte
Kabel inklusive der erforderlichen Software. F&uuml;r diejenigen unter
Ihnen, die keinerlei Erfahrung im Umgang mit einem L&ouml;tkolben haben,
ist das wohl die sinnvollste L&ouml;sung. Mehr als 25 bis 30 DM sollte
der Spa&szlig; allerdings nicht kosten ...</font>
<p><font face="Arial,Helvetica">Den Bastlern unter Ihnen empfehle ich,
ein solches Kabel selbst herzustellen. Sie ben&ouml;tigen hierzu neben
den L&ouml;tutensilien ein gut abgeschirmtes, mindestens 13poliges Computerkabel
(max. 10 Meter L&auml;nge) und zwei 25polige Sub-D-Stecker ("m&auml;nnlich").
Bild 2 zeigt den Anschlu&szlig;plan zur Herstellung des ParNet-Kabels.
Von den 25 Pins der Sub-D-Stecker m&uuml;ssen dann die Pins 2 - 9 (DO D7)
und die Pins 11 - 13 (BUSY, POUT und SEL) direkt verbunden werden. Der
Pin 10 (ACK) beider Stecker wird nicht durchgef&uuml;hrt, sondern an Pin
13 (SEL) angekoppelt. Schlie&szlig;lich mu&szlig; mindestens noch eine
Masseleitung existieren, besser mehrere, so da&szlig; Sie die Pins 18 -
22 (GND) ebenfalls direkt verbinden m&uuml;ssen. Alle anderen Pins bleiben
unbelegt.</font>
<br>&nbsp;
<center><table BORDER COLS=1 WIDTH="14%" >
<tr>
<td>
<center><img SRC="parnet_2.jpg" ALT="Abb.2" height=276 width=378></center>
</td>
</tr>

<tr>
<td>
<center><font face="Arial,Helvetica">Belegungsschema des ParNet-Kabels</font></center>
</td>
</tr>
</table></center>

<p><font face="Arial,Helvetica">Verwenden Sie ein fertiges, volk belegtes
Kabel (25polig) aus dem Elektronik-Laden, so mu&szlig; dieses unbedingt
entsprechend obiger Beschreibung modifiziert werden, da ein Verbinden Ihrer
Amigas mit solch einem Kabel zumindest die Zerst&ouml;rung der CIA-Chips
zur Folge hat (Pin 14 der parallelen Schnittstelle f&uuml;hrt eine Spannung
von 5 Volt!).</font>
<p><font face="Arial,Helvetica">Bevor Sie Ihre Amigas &uuml;ber das "selbstgestrickte"
Kabel verbinden, sollten Sie die Pinbelegung nochmals eindringlich &uuml;berpr&uuml;fenl
Wie Sie sich sicherlich schon denken werden, wird diese, nach dem Verkabeln
der parallelen Schnittstellen der Amigas, f&uuml;r einen eventuell vorhandenen
Drucker, einen Sounddigitizer oder sonstige Hardware, f&uuml;r den Parallel-Port
blockiert. Eine Umschaftbox hilft auch nur begrenzt weiter, denn ist das
Netz erst einmal installiert mu&szlig; zuerst ein Neustart (Reset) durchgef&uuml;hrt
werden, bevor beispielsweise ein Drucker wieder angesprochen werden kann.
Das einzige Manko dieser sonst idealen Netzl&ouml;sung.</font>
<p><b><font face="Arial,Helvetica">ParNet - die Software</font></b>
<br><font face="Arial,Helvetica">Kommen wir nun zur Installation unseres
Netzwerkes. Das ParNetPaket besteht aus mehreren Einzelprogrammen, die
in verschiedene Verzeichnisse kopiert werden m&uuml;ssen. Da w&auml;re
zun&auml;chst einmal das eben schon erw&auml;hnte [parnet.device], das,
wie alle Devices, im [Devs:] Verzeichnis der Bootdisketten (Bootpartition,
bei Festplatten) beider Amigas seinen Platz findet. Der [netpnet-handler]
kommt ins [l:] Verzeichnis und das Programm [netpnet-server] wird ins jeweilige
[C:] Verzeichnis kopiert.</font>
<p><font face="Arial,Helvetica">Da es sich bei ParNet eigentlich um ein
Filesystern handelt, ist es erforderlich, den beigef&uuml;gten Mountlisteintrag
an die bereits bestehende Mountlist anzuh&auml;ngen. Besitzer der aktuellen
Betriebsysteme OS 2.1/OS 3.0 kopieren diesen alternativ in das Verzeichnis
[Devs:dosdrivers]. Nun ist es noch erforderlich, da&szlig; die Eintr&auml;ge
unter "Unit" innerhalb der ParNet-Mountlist angepa&szlig;t werden. Der
eine Amiga erh&auml;lt die Nummer Unit=O, der zweite dann Unit=1. Welche
Unitnummer Sie an welchen Amiga vergeben ist eigentlich gleichg&uuml;ltig,
denn letztlich sind beide gleichberechtigt.</font>
<p><font face="Arial,Helvetica">Eine Ausnahme haben wir allerdings, wenn
Sie zum Beispiel ein Amiga CDTV oder einen A500 mit A570-CD-ROM Laufwerk
mit einem anderen Amiga verbinden. Booten Sie in solch einem Fall etwa
von der "CDPDIII"&nbsp; von Almathera und starten ParNet von dort aus,
dann mu&szlig; Ihr zweiter Amiga die Unitnummer 1 bekommen, da auf der
CD Unit=0 fest voreingestellt ist (was bekannterma&szlig;en bei CD-ROMs
ja nicht ge&auml;ndert werden kann).</font>
<p><font face="Arial,Helvetica">Um das Netz zu aktivieren, mu&szlig; es
zun&auml;chst einmal angemeldet werden. Sinnvoller Weise erstellt man sich
hierzu ein Skript, was uns die wiederholte Eingabe der einzelnen Befehle
erspart. Dieses Skript sieht in seiner einfachsten Form folgenderma&szlig;en
aus (f&uuml;r den Amiga mit Unit=0) :</font>
<blockquote><font face="Arial,Helvetica">netpnet-server unit 1</font>
<br><font face="Arial,Helvetica">mount net:</font></blockquote>
<font face="Arial,Helvetica">Bei dem Amiga, dessen Mountlisteintrag Unit=1
enth&auml;lt, sieht es dann so aus:</font>
<blockquote><font face="Arial,Helvetica">netpnet-server unit 0</font>
<br><font face="Arial,Helvetica">mount net:</font></blockquote>
<font face="Arial,Helvetica">Diese Skripts werden unter einem aussagekr&auml;ftigen
Namen (z.B. ParNet-Start) am sinnvollsten im Verzeichnis [S:] der beiden
Amigas abgespeichert. Durch den Aufruf "execute S:ParNet_Start" aus einer
Shell oder &uuml;ber die Befehlszelle des Workbench-Men&uuml;s, wird das
Skript abgearbeitet und das Netz auf beiden Seiten angemeldet. Gleich darauf
erscheint ein Disk-Icon auf Ihrer Workbench mit dem Namen "Network".</font>
<p><font face="Arial,Helvetica">Sie k&ouml;nnen das Netz aber auch &uuml;ber
ein Project-Icon gleichen Namens mit dem Default-Tool (Standartprogramm)
IconX per Doppelklick von der Workbench aus starten, wobei sich das Skript
im gleichen Verzeichnis wie das dazugeh&ouml;rige Icon befinden mu&szlig;
(etwa im Hauptverzeichnis Ihrer Bootdiskette/Bootpartition).</font>
<p><font face="Arial,Helvetica">Der Zugriff auf das Netz gestaltet sich
recht einfach, wenn Sie &uuml;ber etwas Erfahrung im Umgang mit der Amiga-Sheil
verf&uuml;gen. Hier einige Beispiele:</font>
<blockquote><font face="Arial,Helvetica">dir net:cd0</font></blockquote>
<font face="Arial,Helvetica">Der "dir"-Befehl listet das Verzeichnis der
CD-ROM "CD0" des anderen Amigas auf (z.B. bei CDTV, A570 oder ein CD-ROM
Laufwerk an einem Ihrer Amigas).</font>
<blockquote><font face="Arial,Helvetica">cd net:dh0</font></blockquote>
<font face="Arial,Helvetica">Hier wird in das Verzeichnis "DH0" des anderen
Amiga gewechselt, der nat&uuml;rlich &uuml;ber ein Laufwerk mit diesem
Namen verf&uuml;gen mu&szlig;.</font>
<blockquote><font face="Arial,Helvetica">copy net:cd0/2.1/locale dto:all</font></blockquote>
<font face="Arial,Helvetica">Der "copy"-Befehl kopiert das gesamte (all)
Locale-Verzeichnis aus dem Unterverzeichnis "2.1" der CD-ROM "CD0" des
einen Amiga auf eine Diskette, die sich im Laufwerk DF0: desjenigen Amigas
befindet, von dem aus der Befehl aufgerufen wurde.</font>
<p><font face="Arial,Helvetica">Wichtig beim Zugriff auf das Netz ist,
da&szlig; das gew&uuml;nschte Laufwerk ohne (!) anschlie&szlig;enden Doppelpunkt,
wie sonst &uuml;blich, angesprochen wird, da dieses ja als Unterverzeichnis
von "Net:" existiert. Auf diese Weise kann man alle ShellBefehle, wie beim
gewohnten Arbeiten mit Disketten und Festplatten, eben auch auf das Netz
anwenden. Der wichtigste ist der "cd"-Befehl. Damit wird dem Netz "Network"
das gew&uuml;nschte Laufwerk, beziehungsweise Verzeichnis mittgeteift:</font>
<blockquote><font face="Arial,Helvetica">cd Net:dh0</font></blockquote>
<font face="Arial,Helvetica">Von nun an kann jederzeit auf die Festplatte
"DH0" des anderen Amiga zugegriffen werden, und zwar auch von einem Directory-Utility
wie DirOpus oder BrowserlI aus. Besonders praktisch ist es, wenn man die
gew&uuml;nschten Laufwerke des anderen Amigas bereits beim Starten des
Netzes in das "Parnet-Start"-Skript einbindet:</font>
<blockquote><font face="Arial,Helvetica">netpnet-server unit (0/1)</font>
<br><font face="Arial,Helvetica">mount net: ; das Netz wird angemeldet</font>
<br><font face="Arial,Helvetica">cd net:dh0 ; bindet dh0: ein</font>
<br><font face="Arial,Helvetica">cd net:dh1 ; bindet dh1: ein</font>
<br><font face="Arial,Helvetica">cd net:ram ; bindet RAM: ein</font>
<br><font face="Arial,Helvetica">assign Fonts: net:dh0/fonts; erm&ouml;glicht
dir Nutzung der Zeichens&auml;ze des anderen Amigas</font></blockquote>
<font face="Arial,Helvetica">Wollen Sie das Netz auch &uuml;ber die Workbench
ansprechen, so ist es unter Umst&auml;nden notwendig (bei OS1.3), da&szlig;
Sie dem gew&uuml;nschten Laufwerk ein Icon zuordnen. Nehmen wir an, Sie
wollen regelm&auml;&szlig;ig auf die Festplatte DH0: Ihres anderen Rechners
zugreifen, dann kann ein Icon auf folgende Weise definiert werden:</font>
<blockquote><font face="Arial,Helvetica">cd net:dh0 ; dh0: wird eingebunden</font>
<br><font face="Arial,Helvetica">copy net:dh0/Systein.info net:dh0.info</font>
<p><font face="Arial,Helvetica">oder aber.</font>
<p><font face="Arial,Helvetica">copy df00:Tools.info net:dh0.info</font></blockquote>
<font face="Arial,Helvetica">Im ersten Fall verwenden wir das Schubladen-lcon
des System-Verzeichnisses der ins Netz eingebundenen Festplatte DH0:, im
zweiten Fall wird das Icon des Tools-Verzeichnisses von der Diskette im
Laufwerk DF0: herangezogen. Welches Icon Sie verwenden, h&auml;ngt von
Ihrer individuellen Hardware-Konfiguration ab; hauptsache Sie nehmen ein
Verzeichnis-Icon. Ein einmal auf diese Art definiertes Icon wird von ParNet
in der Datei "node.info" im Hauptverzeichtlis der entsprechenden Festplatte
(hier DH0:) abgelegt und zuk&uuml;nftig bei Einbinden &uuml;ber "cd net:dhO"
automatisch aufgerufen.</font>
<p><font face="Arial,Helvetica">Dies funktioniert allerdings nur bei beschreibbaren
Datentr&auml;gern. Wollen Sie ein Icon f&uuml;r ein CDROM Laufwerk erstellen,
so ist es erforderlich, das Icon nach jedem Reset erneut zu definieren,
da auf der CD nichts gespeichert werden kann. Das Gleiche gilt nat&uuml;rlich
auch f&uuml;r die RAM-Disk, deren Inhalt nach einem Reset verloren geht.
In diesen F&auml;llen kann die Zuordnung eines Icons bereits in dem "ParNet-Start"-Skript
erfolgen:</font>
<blockquote><font face="Arial,Helvetica">netpnet-server unit (0/ 1)</font>
<br><font face="Arial,Helvetica">mount net:</font>
<br><font face="Arial,Helvetica">Copy dh0:system.info net:cd0.info</font>
<br><font face="Arial,Helvetica">Copy dho:system.into net:ram.info</font>
<br><font face="Arial,Helvetica">cd net:cd0</font>
<br><font face="Arial,Helvetica">cd net:ram</font>
<p><font face="Arial,Helvetica">ect.</font></blockquote>
<font face="Arial,Helvetica">Wie Sie sehen, k&ouml;nnen Sie Ihre ParNet-Startskripts
ganz nach Ihren per&ouml;nlichen Gegebenheiten und W&uuml;nschen erweitern
bzw. einrichten. Mit den Betriebsystemen ab OS 2.0 kann aber auf die Definition
von Icons durchaus verzichtet werden, da es hier ja den Men&uuml;punkt
"Window =>Show =>All Files" (Fenster >Inhalt anzeigen &raquo;alle Dateien)
gibt, der ein Standard-Icon zur Verf&uuml;gung stellt.</font>
<p><font face="Arial,Helvetica">Wie bereits erw&auml;hnt, sind mit ParNet
beide Amigas gleichberechtigt. Zu Problemen kann es eigentlich nur dann
kommen, wenn beispielsweise bei einem Amiga ein Reset durchgef&uuml;hrt
wurde und von dem anderen Amiga anschlie&szlig;end auf das Netz zugegriffen
wird, ohne da&szlig; ParNet erneut gestartet wurde. In diesem Fall "h&auml;ngt
sich das System auf", und ein Neustart ist unumg&auml;nglich,</font>
<p><font face="Arial,Helvetica">Zur &Uuml;berwachung des Netzes gibt es
nun noch ein Programm namens [Netstat], weiches nach dem Aufruf mit [run
netstat net:] aus einer Shell ein Fenster &ouml;ffnet, in dem man Informationen
&uuml;ber den Zustand und die &Uuml;bertragungsleistung des Netzes erh&auml;lt.</font>
<p><b><font face="Arial,Helvetica">Erweiterungen zu ParNet</font></b>
<br><font face="Arial,Helvetica">Findige Programmierer haben sich ebenfalls
einiges zu ParNet einfallen lassen. So findet sich auf der PD-Diskette
SaarAG 579 ein verbessertes Update des parnet.device, das f&uuml;r OS2.0
oder h&ouml;her optimiert wurde, aber dennoch zum alten Device kompatibel
ist. So kann man z.B. auf einem AmigaCDTV das alte und auf einem A1200/A4000
das neue [parnet.device] installieren und mit beiden Rechnern ein funktionst&uuml;chtiges
Netzwerk aufbauen. Zudem liegt hier auch eine spezielle Version f&uuml;r
68020+ Prozessoren vor.</font>
<p><font face="Arial,Helvetica">Von Mathias Scheler stammt das Programm
NetPatch, das kleinere M&auml;ngel an ParNet behebt und &Uuml;ber "NetPatch
net:", nach dem Anmelden von Net:, aufgerufen wird, Man kann den Befehl
gleich nach dem "mounten" des Netzes in das Startskript einbauen und bekommt
nach dem Aufruf die Meldung "NetPatch installed". Mit ParNet alleine war
es leider nicht m&ouml;glich, nach einem "cd"-Befehl anschlie&szlig;end
den "dir"-Befehl auf das entsprechende Laufwerk auszuf&uuml;hren, was zu
der Fehlermeldung "Object not found" f&uuml;hrte. Au&szlig;erdem beseitigt
NetPatch einen nervigen Requester, der bei manchen Programmen auftauchte,
wenn diese &uuml;ber Net: aufgerufen wurden. NetPatch befindet sich z.B.
auf der SaarAG 461, der Am!net-CD und ist bei der CDPDIII ebenfalls fertig
installiert.</font>
<p><font face="Arial,Helvetica">Schlie&szlig;lich gibt es noch die NetUtilities,
die genau wie ParNet und NetPatch von David Griff iths und Neal Verheyde
als Freeware ver&ouml;ffentlicht wurden. Sie erm&ouml;glichen es, da&szlig;
sich die User der beiden mit ParNet verbundenen Amigas &uuml;ber Dialogfenster
'&laquo;unterhalten" k&ouml;nnen. Hierzu stehen drei ShellKommandos zur
Verf&uuml;gung, die auf beiden Amigas In einer bestimmten Reihenfolge aufgerufen
werden m&uuml;ssen. Auch hier bietet es sich an, Skripte anzulegen, um
sich die Tipperei in einer Shell zu ersparen.</font>
<p><b><font face="Arial,Helvetica">Inform</font></b>
<br><font face="Arial,Helvetica">Dieses Programm kontrolliert die Nachrichten&uuml;bertragung,
bzw. das Programm "NetCmd"-(siehe weiter unten).</font>
<p><b><font face="Arial,Helvetica">send</font></b>
<br><font face="Arial,Helvetica">Hierdurch &ouml;ffnet sich ein einfaches
CLI-Fenster, in dem die Nachricht eingetippt und durch Bet&auml;tigen der
Return-Taste abgeschickt werden kann.</font>
<p><b><font face="Arial,Helvetica">receive</font></b>
<br><font face="Arial,Helvetica">Es wird ein weiteres CLI-Fenster ge&ouml;ffnet,
in welchem eine gesendete Nachricht empfangen wird..</font>
<p><font face="Arial,Helvetica">Wichtig dabei ist, da&szlig; alle Befehle
in obiger Reihenfolge auf beiden Amigas aufgerufen werden, nachdem (!)
ParNet gestartet wurde. Nat&uuml;rlich k&ouml;nnen Sie diese Art der Nachrichten&uuml;bertragung
auch an das Pamet - Start Skript anh&auml;ngen, um auf einen Streich alle
M&ouml;glichkeiten von ParNet zu aktivieren. Doch die NetUtilities enthalten
zus&auml;tzlich zwei weitere interessante Programme:</font>
<p><b><font face="Arial,Helvetica">NetCmd</font></b>
<br><font face="Arial,Helvetica">Mit dem Shell-Befehl NetCmd ist es m&ouml;glich,
ein Programm von dem einen Amiga aus auf dem anderen zu starten. Dem aufgerufenen
Programm mu&szlig; aber der Verzeichnispfad auf dem anderen Amiga vorangestellt
werden. Wollen Sie beispielsweise einen Reset auf dem anderen Amiga ausf&uuml;hren,
so bedienen Sie sich am besten des ebenfalls beigef&uuml;gten Programmes
"Reboot":</font>
<p><b><font face="Arial,Helvetica">netcmd Reboot</font></b>
<br><font face="Arial,Helvetica">Befindet sich "Reboot" im C: Verzeichnis
der Bootdiskette/partition des anderen Rechners, so wird auf diesem ein
Resei (Warmstart) ausgef&uuml;hrt, ansonsten mu&szlig; der komplette Pfad
mit &uuml;bergeben werden.</font>
<p><b><font face="Arial,Helvetica">Reboot</font></b>
<br><font face="Arial,Helvetica">Dieses kleine Programm l&ouml;st nach
dem Aufruf aus einer Shell einen Reset (Neustart des Amiga) aus. (sk)</font>
</body>
</html>
