<html>
<head>
<title>Interview10</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Costel Mincea</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> AmiDynDNS</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.remedysystems.de</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> costel.mincea@remedysystems.de
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
 
Ich hei&szlig;e Costel Mincea, bin 23 Jahre alt und wohne in Landshut. Ich
bin jetzt im 6. Semester Informatik-Student und habe die Firma Remedy
Systems zusammen mit zwei Kommilitonen in Sommer letzten Jahres
gegr&uuml;ndet. </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

Hmm... gute Frage.. Ich w&uuml;rde sagen, so zwischen 1989 und 1990 habe
ich angefangen, meinen Amiga auch "vern&uuml;nftig" zu nutzen. Allerdings
hat mich die Programmierung damals noch nicht wirklich interessiert.. dazu
kam ich erst sp&auml;ter. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

Im Moment einen A4000 im Mikronik Tower mit einer CyberstormPPC,
CVisionPPC, Netzwerkkarte, Soundkarte, und so weiter.. Daneben besitze ich
noch einen A4000 Desktop, einen A1200 Desktop, ein CD32, ein CDTV und
meinen guten alten A500. Alle mehr oder weniger mit Erweiterungen
vollgestopft. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

OS3.9 auf den 4000ern, OS3.1 auf dem 1200er, der Rest ist noch original...
also 3.0 und 1.3. </p>

<p><b>Welche Software entwickelst Du? </b><br>

Im Moment bin ich am fertigstellen von AmiDynDNS. Danach kommt
wahrscheinlich noch ein FTP-Client und andere n&uuml;tzliche Tools.
Gr&ouml;&szlig;ere Anwendungen sind auch geplant, aber da ist noch nichts
Genaues entschieden. </p>

<p><b>Kannst Du uns erz&auml;hlen, worum es bei Deiner Software geht?
</b><br>

AmiDynDNS ist ein CLI Client f&uuml;r die Services von DynDNS.org. Man kann
damit seine aktuelle IP einem Hostnamen zuweisen, den man kostenlos
einrichten kann. Zum FTP-Client mu&szlig; ich wohl nicht viel sagen ;-)
</p>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>

Naja, ich brauchte eben so ein Tool, um meinen DynDNS-Host updaten zu
k&ouml;nnen, ohne auf die Website von DynDNS gehen zu m&uuml;ssen. Nachdem
ich alle m&ouml;glichen Tools ausprobiert hatte, mu&szlig;te ich
feststellen, da&szlig; viele (wenn nicht sogar die meisten) nicht mehr mit
dem DynDNSProtokoll kompatibel sind. Das einzige, was ich fand, war ein
ARexx-Skript. ARexx ist zwar eine gute Skript-Sprache, aber ich mag
richtige Programme ganz einfach lieber. Also hab ich begonnen, AmiDynDNS zu
programmieren. </p>

<p><b>Wie lang hat die Entwicklung bisher gebraucht? </b><br>

Schwer zu sagen, da ich meistens in der Freizeit daran programmiert habe.
Ich w&uuml;rde sagen, insgesammt vielleicht 1 1/2 Wochen.. ist ja nur ein
kleines Programm. </p>

<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

StormC 4, CygnusEd und - das wichtigste - die Shell ;) </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

Derzeit nur AmigaOS. </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

Wir werden sehr wahrscheinlich nur das AmigaOS unterst&uuml;tzen.
Schlie&szlig;lich ist es die Mutter aller Dinge auf dem Amiga und was man
so &uuml;ber AmigaOS4 geh&ouml;rt hat, wird es wohl auch nicht n&ouml;tig
sein, auf ein anderes System umzuschwenken. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Zuerstmal Bugfixes ;) Es ist zwar nur ein kleines Programm, aber einige
schlaflose N&auml;chte vor dem Computer fordern nunmal ihren Tribut. Ich
denke zwar, da&szlig; die jetzige Version 0.9 schon recht stabil
l&auml;uft, aber wer wei&szlig;, Fehler k&ouml;nnen immer passieren. Zum
anderen m&ouml;chte ich AmiDynDNS bis zur Version 1.0 gerne in ein
Commodity verwandeln, soda&szlig; man sich nicht mehr um das Update selbst
k&uuml;mmern oder sich ein Skript bauen mu&szlig;. Es soll dann
eigenst&auml;ndig im Hintergrund pr&uuml;fen, ob sich die IP ver&auml;ndert
hat und wenn ja, den Host updaten. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst? </b><br>

Eigentlich nicht. Es macht mir Spa&szlig; zu programmieren - und wenn
au&szlig;er mir meine Tools auch niemand gebrauchen kann, ICH kann sie auf
jeden Fall gebrauchen ;) </p>

<p><b>Erh&auml;ltst Du gen&uuml;gend Resonanz auf Deine Software? </b><br>

Es k&ouml;nnte, wie immer, mehr sein. Aber bis jetzt war das Feedback
durchweg positiv, was die geringe Menge wieder relativiert. </p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

Heute. Und sollte mir die Frage irgendwann wieder gestellt werden, wird die
Antwort die gleiche sein ;-) </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

Frogger und SoftCinema. </p>

<p><b>Welche Software verwendest Du noch? </b><br>

Haupts&auml;chlich MiamiDx, AmiTCP, IBrowse, AWeb und YAM. Und ganz
wichtig: EaglePlayer. Mit einem guten Mod im Hintergrund l&auml;&szlig;t
sich einfach besser programmieren. </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Mein Tower bekommt auf jeden Fall eine Highway USB Karte. Und dann mal
sehen, wie sich Pegasos und AmigaOne bew&auml;hren. Interessiert w&auml;re
ich daran sehr. </p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

Wieso?? War er jemals weg? Im Ernst, f&uuml;r mich war und ist der Amiga
der beste Rechner mit dem besten Betriebssystem aller Zeiten. Die
derzeitige Entwicklung in Richtung PowerPC halte ich f&uuml;r sehr positiv.
Allerdings w&auml;re das schon vor Jahren m&ouml;glich und n&ouml;tig
gewesen. Jetzt ist es aber ersteinmal wichtig, da&szlig; die neue Hardware
und das neue OS f&uuml;r die Enduser verf&uuml;gbar werden, weil wir alle
schon lange genug darauf gewartet haben. Und wenn es soweit ist und die
Verantwortlichen keine Dummheiten machen, k&ouml;nnte der Amiga wieder
einen festen Platz in der Computerwelt bekommen. </p>

<p><b>Deine abschlie&szlig;enden Worte an die Leser? </b><br>

Was soll ich Euch gro&szlig;artig sagen? Ich denke, die Menschen, die das
hier lesen und denen immer noch etwas am Amiga liegt, der harte Kern der
&uuml;bergebliebenen Amiga-Gemeinde ist und sie deswegen nicht viele Worte,
sondern Taten brauchen - egal ob von Amiga, Inc., von uns oder von den
Usern selbst. </p>

<p> © Amiga Arena 3/2002 </p>

</td></tr></table>
<br>
</body>
</html>




