<html>
<head>
<title>Interview3</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Gareth Griffiths</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> MP3-2-HTML </td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.gazchap.com</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> -
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
       
Hi, mein Name ist Gareth Griffiths, auch bekannt als GazChap. Ich bin ein
18 Jahre alter Kerl aus dem Vereinigten K&ouml;nigreich, und ich bin ein
bisschen ein Computerbesessener :) </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

1994 bekam ich zuerst einen Amiga. Er ist in etwa derselbe den ich heute
habe, aber ich habe &uuml;ber die Jahre die Hauptplatine und alle
m&ouml;glichen Teile hin und her getauscht um ihn zu verbessern. </p>

<p>Ich programmiere den Amiga seit 1995, als ich AMOS entdeckte. Ich bin
jetzt aber von AMOS abgegangen! </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

Ich habe einen Commodore A1200, den ich seither in einen Tower gesteckt
habe. Ich habe ihn im Laufe der Jahre verdammt viel aufger&uuml;stet, und
jetzt wird er von einem '060/50MHz mit 64MB RAM und einer
Mediator/Voodoo3-Kombination angetrieben. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

OS3.9, ich bin gern auf dem neuesten Stand :) </p>

<p><b>Welche Software entwickelst Du? </b><br>

Momentan entwickle ich zwei Sachen auf dem Amiga, MP3-2-HTML und Shoot Out.
Ich scheibe auch Software f&uuml;r den PC, einschlie&szlig;lich
(irgendwann) einer Windows-Version von MP3-2-HTML. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

Also, MP3-2-HTML ist wirklich ein Werkzeug f&uuml;r Musik-Enthusiasten. Was
es tut ist, dass es die gesamte ID3-Information aus deiner MP3-Sammlung
nimmt und aus allen eine HTML-Liste macht! Gro&szlig;artig, um vor deinen
Freunden mit deiner MP3-Sammlung anzugeben :) </p>

<p>Shoot Out ist eine aktualisierte Version eines Spieles von mir mit
demselben Namen. Gleichzeitig zur Amiga-Version wird eine PC-Version
entwickelt, und es ist im Grunde eine Art Katz-und-Maus-Spiel, in dem du
das Schiff deines Gegners in die Luft jagen musst, w&auml;hrend du
versuchst, selbst seinen Sch&uuml;ssen auszuweichen! </p>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>

Die Entwicklung von MP3-2-HTML habe ich nur wegen der R&uuml;ckmeldungen
von denjenigen, die es verwenden, fortgesetzt. Ich habe ein paar gute Ideen
von den Benutzern des Programms erhalten, von denen es ein paar in die
letzten Versionen geschafft haben. Manche der anderen Idee werden es
wahrscheinlich nie schaffen (jemand hatte vorgeschlagen, einen
vollausgestattetetn MP3Player aus dem Programm zu machen, aber das liefe
der Idee des Programms entgegen), und manche der anderen werden in
zuk&uuml;nftigen Versionen implementiert werden! </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert? </b><br>

MP3-2-HTML ist nun seit &uuml;ber anderthalb Jahren in Entwicklung, obwohl
es eine lange Pause zwischendurch gab, um mich auf mein Studium und mein
pers&ouml;nliches Leben zu konzentrieren! </p>

<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

BlitzBasic 2.1 von ACID Software sowie AmiBlitz2, die aktualisierte Version
von Blitz Basic von Bern Roesch. </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

Ich habe mir AmigaDE oder MorphOS noch nicht angeschaut (obwohl ich die
AmigaDE Player-Software habe, die Amiga, Inc. vor einer Weile
ver&ouml;ffentlicht hat. Sieht gut aus), also entwickle ich nur f&uuml;r
das einfache AmigaOS. </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

Das Geld ist knapp, also ist es unwahrscheinlich, dass mir jemals eine
AmigaDE Umgebung leisten k&ouml;nnen werde, oder einen PPC, um mir MorphOS
zu er&ouml;ffnen. Also wird es f&uuml;r die absehbare Zukunft nur die
Amiga- und die WindowsPlattform bleiben. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Zuk&uuml;nftige Versionen von MP3-2-HTML werden mehrere
Verzeichnisst&auml;mme unterst&uuml;tzen, ausgiebige
Playlist-Export-Plugins und jede Menge andere coole Sachen, die ich noch
untersuche. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren
wenn Du die geringe Resonanz siehst, die aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Bizarrerweise nein. Ich verliere schon den Spa&szlig; und das Interesse am
Programmieren, aber das hat nichts mit dem Zustand des Amiga-Marktes zu
tun, ich war immer so. Es gab eine Pause von einem Jahr zwischen Version
2.93 und Version 2.96 von MP3-2-HTML weil ich die Motivation weiter zu
machen nicht aufbringen konnte. Das habe ich dann aber doch irgendwie
geschafft :) </p>

<p><b>Erh&auml;ltst Du genug R&uuml;ckmeldungen f&uuml;r Deine Software?
</b><br>

Nicht wirklich :( Ich wei&szlig;, dass es &uuml;ber 100 Leute gibt, die
MP3-2-HTML benutzen, aber nur ein kleiner Teil davon hat tats&auml;chlich
mit R&uuml;ckmeldungen Kontakt mit mir aufgenommen. Also, falls
irgendwelche von Euch die das hier lesen MP3-2-HTML benutzen und mir noch
nicht gemailt haben, bitte tut es! Es hilft blo&szlig;, zuk&uuml;nftige
Versionen besser zu machen, und es braucht blo&szlig; ein paar Minuten
eurer Zeit!

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

Gestern - ich testete ein neues Design f&uuml;r meine Website in Voyager 3.
</p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

OS3.9 - wie ich bereits oben sagte ist das Geld knapp, so dass ich nicht zu
viel Zeug kaufen kann. </p>

<p><b>Welche Software verwendest Du noch? </b><br>

Ooh, jede Menge. Directory Opus Magellan II ist etwas, ohne das ich nicht
auskommen k&ouml;nnte, Blitz Basic 2 (und die neue aktualisierte Version
davon namens AmiBlitz2, erh&auml;ltlich im Aminet) ebenso, und Personal
Paint ist auch etwas, das ich ebenfalls ziemlich oft benutze. </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Ich brenne darauf, eine TV-Tuner-Karte f&uuml;r meinen Mediator zu kriegen
damit ich &auml;ltere Spiele in einem Fenster auf meiner Workbench spielen
kann :) Ich sollte mir auch die Mediator Multimedia CD holen, damit ich die
Treiber daf&uuml;r habe! </p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

Ehrlich gesagt, ich tat es, aber nun schwindet der Glaube. Es w&auml;re
toll wenn Amiga ein riesiges Comback machen w&uuml;rde, aber wenn nicht
bald etwas geschieht, kann ich nicht sehen, dass das passiert. Im PC-Markt
herrscht jetzt schon genug Wettbewerb, und Amiga haben alle H&auml;nde voll
zu tun ein lebensf&auml;higes Produkt auf den Markt zu bringen und
tats&auml;chlich den Umsatz zu erzielen. Um fair zu bleiben, ich hatte
nicht einmal erwartet, dass sie es so weit schaffen w&uuml;rden wie sie es
geschafft haben, also wer wei&szlig;? </p>

<p><b>Deine letzten Worte an die Leser? </b><br>

Falls ihr es noch nicht getan habt, geht hin und ladet MP3-2-HTML von
http://mp32html.gazchap.com herunter. Es macht alles, was auch immer ihr
wollen k&ouml;nntet - es macht sogar euren Tee! :) </p>

<p> © Amiga Arena 2/2002 <br>

(aus dem Englischen von Christian Busse) </p>

</td></tr></table>
<br>
</body>
</html>




