<html>
<head>
<title>Interview5</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Georg H&ouml;rmann</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> VirusZ, xvs.library </td></tr>
<tr><td valign=top> Homepage: </td>
<td> </td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> ghoermann@gmx.de
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor! </b><br>

Also gut, mein Name ist Georg H&ouml;rmann, ich bin mittlerweile 28 Jahre
alt, wohne in Garmisch-Partenkirchen unter der sch&ouml;nen Zugspitze
(h&ouml;chster Berg Deutschlands) und nutze dies f&uuml;r alle anderen
Hobbies au&szlig;er Computer auch sehr gut aus (Mountainbike, Bergsteigen,
Langlauf, Rennrad usw.). Im richtigen Leben arbeite ich f&uuml;r Vater
Staat, nicht aus =DCberzeugung, aber aus Bequemlichkeit... </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

Das war bereits 1986, auf dem A1000 eines Freundes, bevor ich mir 1988
einen eigenen leisten konnte (nat&uuml;rlich auch A1000, den einzig wahren
Amiga!) </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

A1000 (zu Nostalgie- und Testzwecken) und A3000 (damit arbeite ich immer
noch), 68030/68882 25MHz, 10MB RAM, 2GB HD, Picasso 96 usw. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

AmigaOS 3.9 </p>

<p><b>Welche Software entwickelst Du? </b><br>

VirusZ, den altbekannten Virenkiller und xvs.library, die alle
Virenkennungen enth&auml;lt. xfdmaster.library (Entpacker-Standard) war
auch von mir, macht aber jetzt Dirk St&ouml;cker, weil mir einfach die Zeit
fehlt. </p>

<p>Au&szlig;erdem noch ein paar kleinere Sachen, die z.T. auch nie released
wurden. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

Eigentlich immer um das Thema Computerviren und deren Bek&auml;mpfung. </p>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>

Als ich 1991 damit begonnen habe, gab es keinen Virenkiller, der mir
gefallen hat oder alles konnte, was ich f&uuml;r wichtig hielt. Und dann
wird es halt ein Selbstl&auml;ufer, man hat ja auch eine gewisse
Verantwortung. </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert? </b><br>

1991-2002, mit Unterbrechung von 1999-2001, weil ich keine Zeit hatte. </p>

<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

Recht altmodisch, aber immer noch gut: OMA Assembler 3.0, HiTex Editor.
Au&szlig;erdem einige Debug-Tools, z.T. auch selbstentwickelt, und
nat&uuml;rlich ReSource, den genialsten Disassembler der Welt (wenn auch
leider nicht mehr auf dem neuesten Stand). </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

AmigaOS </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

AmigaOS </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

z.Zt. fehlende Funktionen erg&auml;nzen, und was mir/Euch noch so
einf&auml;llt. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren
wenn Du die geringe Resonanz siehst, die aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Deshalb habe ich eine ziemlich lange Pause gemacht, aber 68k-Assembler ist
nun mal die sch&ouml;nste Maschinensprache, und irgendwann packt es einen
dann wieder... ich mu&szlig; ja nicht davon leben, es ist ein Hobby. </p>

<p><b>Erh&auml;ltst Du genug R&uuml;ckmeldungen f&uuml;r Deine Software?
</b><br>

Ja, es gibt immer noch einige engagierte User und Programmierer-Kollegen,
die sich da ziemlich reinh&auml;ngen. </p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

Gerade eben l&auml;uft er! </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

AmigaOS 3.9 </p>

<p><b>Welche Software verwendest Du noch? </b><br>

Alle meine Entwickler-Programme und auch viele andere sind nat&uuml;rlich
Originale, und die verwende ich auch regelm&auml;&szlig;ig. </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Momentan nichts. </p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

In irgendeiner Form sicherlich, aber wohl leider nicht mehr als
eigenst&auml;ndige Plattform, der Zug der fr&uuml;hen 90er Jahre ist leider
abgefahren... </p>

<p><b>Deine letzten Worte an die Leser? </b><br>

 Danke f&uuml;rs Durchhalten ohne einzuschlafen :-)
</p>

<p> © Amiga Arena 3/2002 </p>

</td></tr></table>
<br>
</body>
</html>
