<html>
<head>
<title>Interview8</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Paul Heams</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> Sid4Amiga, MemIcon und anderer Schnickschnack..</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.heams.freeserve.co.uk </td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> ph@heams.freeserve.co.uk
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Tja, ich bin ein 27 Jahre alter Vollzeitprogrammierer, der f&uuml;r eine
kleine Firma kurz au&szlig;erhalb Londons (Vereinigtes K&ouml;nigreich)
arbeitet. Ich schreibe haupts&auml;chlich Datenbanken und
selbstst&auml;ndige Pakete f&uuml;r gr&ouml;&szlig;ere Gesch&auml;fte rund
um London. </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

Ich habe damals mit einem Amiga 500 angefangen, als ich etwa 14 war oder
so, davor hatte ich einen Commodore 64. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

A1200-68040 PPC240 BVision, Mediator. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

OS3.9 BB2 </p>

<p><b>Welche Software entwickelst Du? </b><ul>

<li> Sid4Amiga (Ja, es ist wieder in Entwicklung) </li>

<li> MemIcon </li>

<li> PlaySid Emulations-Library </li>

<li> Diversen anderen Schnickschnack. </li></ul></p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

Also, Sid4Amiga ist ein Commodore 64 Sound-Abspieler, zusammen mit der
Emulations-Library, die den alternden Standard, die 'playsid.library'
ersetzt. </p>

<p>MemIcon ist eine Speicher, Uhrzeit, Screen-Info Anzeige f&uuml;r OS3.5 und
h&ouml;her. </p>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>

Kurz und b&uuml;ndig gesagt, kann ich, wie viel auch immer ich meinen PC
bei der Arbeit benutze, mich nie von meinem Amiga l&ouml;sen. Ich denke,
da&szlig; das Betriebssystem, obwohl ihm manche Leistungsmerkmale fehlen,
eines der nettesten ist, die je entwickelt wurden. Da ich die Maschine
immer noch benutze, habe ich auch immer noch den Drang, weiter zu
entwickeln. </p>

<p><b>Wie lang hat die Entwicklung bislang gedauert? </b><br>

Ich habe seit dem Anfang Sachen entwickelt. Sid4Amiga hat 1999/2000
wirklich begonnen. MemIcon nach der K&ouml;lner Messe 2000. Heutzutage habe
ich nicht viel Zeit, darum ist die Entwicklung viel langsamer als ich es
gern h&auml;tte. </p>

<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

StormC V3 (PPC/68K) - das beste St&uuml;ck Softawre, das ich f&uuml;r meine
Maschine gekauft habe. </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

AmigaOS und AmigaDE. (VP-Code im AmigaDE ist gro&szlig;artig). </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

Also, jetzt ist OS4 am wahrscheinlichsten. Ich habe einen Amiga One SE
bestellt, um weiter entwickeln zu k&ouml;nnen. Also, Daumen dr&uuml;cken,
die Dinge werden jetzt anfangen richtig zu laufen im Amiga-Markt(?!). </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

F&uuml;r Sid4Amiga sind ein paar toole Sachen bereits da - ich brauche nur
ein paar Betatester, um das neue Paket zu debuggen (bitte mailt mich an).
Eine neue Version von MemIcon sollte auch bald verf&uuml;gbar sein. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Nicht wirklich. Ich kriege einen Kick daraus, was ich aus meinem Amiga
herausholen kann, selbst wenn das sonst niemand zu w&uuml;rdigen
wei&szlig;! </p>

<p><b>Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software? </b><br>

Ja, urspr&uuml;nglich schon - obwohl R&uuml;ckmeldungen in letzter Zeit
selten geworden sind. </p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

Ich benutze ihn jetzt! </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

Hmmmm... schwierig, das war wahrscheinlich Shogo oder Miami DX. </p>

 <p><b>Welche Software verwendest Du noch? </b><br>

Storm C, YAM, IBrowse, Voyager, eine Menge Zeug. </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Also, ich habe gerade erst einen neuen Amiga One SE bestelt - z&auml;hlt
das? Software - hoffentlich OS4 dazu!!! </p>

<p><b>Glaubst an ein Comeback von Amiga? </b><br>

Ich denka nach all der Zeit mu&szlig; ich 'ja' sagen. Ich denke aber, das
Comeback wird doch langsam sein. Amiga, Eyetech und Hyperion haben sowohl
im Classic- als auch dem DE-Markt noch viel zu tun. </p>

<p><b>Deine letzten Worte an die Leser? </b><br>

Unterst&uuml;tzt Eure Entwickler, genie&szlig;t das Leben und l&auml;chelt!
:) Tsch&uuml;&szlig;! </p>

<p> © Amiga Arena 2/2002 <br>

(aus dem Englischen von Christian Busse)

</p>

</td></tr></table>
<br>
</body>
</html>
