<html>
<head>
<title>Interview1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Mehrere</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> OpenOffice</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.openoffice.vgrabbe.de</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> openoffice@vgrabbe.de
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor! </b><br>

Tja, also, mein Name ist Volker Grabbe, 30 Jahre jung, verheiratet 2
Kinder, ehemaliger VOBIS Filialleiter, nun im Vertrieb von PC Hardware im
Gro&szlig;handel. </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

Irgendwann so um 1989 rum. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

Also, einen A1200, einen A3000 im Tower umgebaut, einen A3000T original
(mom. leider defekt), einen A4K im selbstgebautem Tower mit PPC sowie einen
A1000. Nunja, und Amithlon ;) </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>

OS 3.9 auf dem 4000er, 3.5 auf dem 3000er, 1.3 auf dem 1000er ;) </p>

<p><b>Welche Software entwickelst Du? </b><br>

Zusammen mit einigen anderen: <br>

(bisher Jens K&ouml;cke, Mafred Rauer, Peter Kaltstein, Patrik Jung,
Stephane SARAGAGLIA, Jens Begeschke, Emm Vasilakis, Stefan Kleinheinrich,
SixK). </p>

<p>Ich habe alle angegeben, die mir helfen wollen oder es bereits tun.
Sollte ich jemanden vergessen haben, Entschuldigung ;) Unterst&uuml;tzend
kommen der API Entwickler von SUN sowie Hans-J&ouml;rg Frieden dazu, wenn
es um Umsetzungsprobleme geht. </p>

<p><b>Kannst Du uns erz&auml;hlen, worum es bei Open Office geht? </b><br>

OpenOffice ist die Open Source Variante von Suns StarOffice 6, nicht wie
f&auml;lschlicherweise von einigen vermutet von der Version 5.2 . Da dieses
allerdings lizensierte und patentierte Teile beinhaltet wurden diese Teile
bei OpenOffice einfach weggelassen (Rechtschreib&uuml;berpr&uuml;fung,
Adabas Datenbank, etc.). Alles in allem ist OpenOffice ein All in One
Produkt. </p>

<p>Es beinhaltet nicht nur eine Textverarbeitung und eine
Tabellenkalkulation, sondern auch eine Pr&auml;sentationssoftware sowie
rudiment&auml;re Zeichenm&ouml;glichkeiten. Auch arbeiten die OpenOffice
Programmierer an einer Neuentwicklung des ehemaligen Terminplaners aus
Staoffice 5.2. Alles in allem, w&auml;re der Amiga mit dieser Software auch
in B&uuml;ros einsetzbar, oder man k&ouml;nnte, wegen der sehr guten Import
und Exportfilter Arbeit mit nach hause nehmen. </p>


<p><b>Was hat Dich auf die Idee gebracht, Open Office zu entwickeln?
</b><br>

Die Tatsache, dass es von Digita keine Amigaprogramme mehr geben wird und
mit Amigawriter gerade mal EINE Textverarbeitung, zu wenig f&uuml;r meinen
Geschmack. </p>

<p>Turbocalc wird nicht mehr weiterentwickelt und eine vern&uuml;nftige
Pr&auml;sentationssoftware haben wir seit Scala nicht mehr gehabt. </p>

<p>Des weiteren haben wir hier die Verwendung von Standart-Dateiformaten
(XML) mit der Kombination von MS-Importfiltern. </p>


<p><b>Wie lang hat die Entwicklung bisher gebraucht? </b><br>

Wir sind noch in der Koordinierungsphase, zuerst bauen wir alles um
OpenOffice drum herum, damit wir ein sogenanntes OpenOffice Development Kit
zusammenbauen k&ouml;nnen. </p>

<p>Wenn also noch jemand mitmachen will, immer her damit. Je
gr&ouml;&szlig;er das Team, desto schneller die Umsetzung. </p>


<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

Wir werden aus Kompatiblit&auml;tsgr&uuml;nden wohl auf GCC
zur&uuml;ckgreifen, da StormC 4 auch darauf basiert und OpenOffice
haupts&auml;chlich damit weiterentwickelt wird (zumindest die Linux Version
die wir umsetzen). </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

OpenOffice wird von uns f&uuml;r das AmigaOS4 geschrieben, da HJ-Frieden
schrieb das man durch relativ einfache M&ouml;glichkeiten aus einen 68k
Programm ein AOS4 PPC Programm machen kann. </p>

<p>Ev. Anpassungen an andere CPUs als PPC und 68k (f&uuml;r Emulationen)
wird sich herausstellen. Sollte es durch einfache Kompilierung m&ouml;glich
sein x86 direkt zu unterst&uuml;tzen, werden wir dies tun. </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

Definitiv OS4 und OS3.9, letzteres wegen Amithlon, auf dem ich auch
entwickle. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Sobald es eine Version lauff&auml;hig gibt, Verbesserungen die von der
OpenOFfice Gemeinde geschrieben wurden zu implementieren. Besondere Amiga
Features zu unterst&uuml;tzen und &auml;hnliches. Zuerst aber wollen wir
das ganze erst einmal lauff&auml;hig haben. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst? </b><br>

Es erschreckt mich, wie viele Leute in den Foren schreiben, Das klappt ja
eh nicht, lass es gleich sein, etc. Einer hat sogar geschrieben, dass er
eine Kiste Bier spendiert, wenn in 1-2 Monaten dennoch etwas zu sehen sein
sollte. Das ganze motiviert nat&uuml;rlich sehr stark. </p>

<p>Zumal man auch auf meine VOBIS Vergangenheit anspielt. Ich werde mich
davon aber nicht entmutigen lassen. F&uuml;r solche Personen habe ich nur
ein m&uuml;des L&auml;cheln &uuml;brig. Statt nur zu n&ouml;rgeln, macht
selber was Vern&uuml;nftiges. </p>

<p><b>Erh&auml;ltst Du gen&uuml;gend Resonanz auf Deine Software? </b><br>

Nunja, die gute &uuml;berwiegt, allerdings gibt es auch b&ouml;se. Heute
schrieb mir einer, ich h&auml;tte eine Mail mit komischem inhalt an Ihn
geschickt. Wie sich herausstellte war es ein Windows Virus, meine
Absenderadresse stand auch drin, Absender war aber, wie der Header beweist,
eine russische Adresse. Wie das gemeint sein kann, dar&uuml;ber kann man
nur spekulieren. Nur bei sowas, finde ich, h&ouml;rt der Spa&szlig; auf.
</p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

vor ca. 4 Monaten, seither fast nur noch Amithlon. </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

OS3.9, davor Heretic2, davor 3.5, davor ....... </p>

<p><b>Welche Software verwendest Du noch? </b><br>

Nunja, Amithlon, Turboprint, Golded-Studio 6, Amigawriter 2.2 weil bei
Amithlon dabei. Ansonsten OpenOffice unter Windwos XP. </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Da warte ich die Entwiclung im Bereich PPC-Boards ab. </p>

<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>

So wie es mom. gehandhabt wird, nein. MS ist einfach zu gro&szlig;, der
Amiga wird immer ein Nischenprodukt bleiben. Nur wie gro&szlig; diese sein
wird, liegt an uns Usern und Programmierern. Dass eine Nische auch
gro&szlig; sein kann, beweist Apple seit Jahren. MS vom Thron sto&szlig;en
werden wir sicher nicht. </p>

<p><b>Deine abschlie&szlig;enden Worte an die Leser?</b><br>

Die meisten belagern sich gegenseitig. Es wird viel &uuml;ber noch nicht
Vorhandenes diskutiert, manchmal auf extrem niedrigem Niveau. Ich
wei&szlig;, dass es eine schweigende Mehrheit gibt, aber dennoch. Was in
unserer Mitte fehlt, ist Zusammenarbeit. MOS gegen OS4, Amithlon gegen PPC,
VMC gegen Friedens. Leute denkt mal nach, macht es wie Phil Collins in
seinem Lied "Both sides of the Story", h&ouml;rt euch beide Seiten an und
dann vergesst die Streitigkeiten und zieht gemeinsam an einem Strang. </p>

<p>Volker Grabbe</p>

<p> © Amiga Arena 3/2002 </p>

</td></tr></table>
<br>
</body>
</html>

                           
