<html>
<head>
<title>Interview2</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Dennis Gronewold</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> SoftCinemaRA-GUI</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://home.arcor.de/dgronewold</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> buzzy@smartvia.de
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor! </b><br>

Also, mein Name ist Dennis Gronewold, ich bin 20 Jahre alt und studiere
Wirtschafts- und Sozialwissenschaften in Dortmund. </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

Seit knapp neun Jahren. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

Einen A1200 im Infinitiv I Tower mit Blizzard603e+25/210Mhz, BVisionPPC, 96
MB Ram, Silversurfer, 10GB HD. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</b><br>

AmigaOS 3.9 </p>

<p><b>Welche Software entwickelst Du? </b><br>

Zur Zeit eine ReActionGUI f&uuml;r den Movieplayer SoftCinema. </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

s.o. </p>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln? </b><br>

Ich fands immer ziemlich umst&auml;ndlich die Tooltypes von SoftCinema im
Icon zu &auml;ndern. Die Argue-GUI die es f&uuml;r SoftCinema gab fand ich
auch recht unansehnlich und hab sie deshalb nie benutzt. Da hab mir
gedacht, ich wende mal meine frisch erworbenen Programmierkenntnisse an und
machs besser :-) </p>

<p><b>Wie lange hat die Entwicklung bisher gedauert? </b><br>

Schwer zu sagen. Ich hab im Dezember angefangen, hatte dazwischen aber hin
und wieder l&auml;ngere Pausen, wo ich gar nichts daran getan habe. </p>

<p><b>Welche Software verwendest Du zum Entwickeln? </b><br>

StormC V3.0 von der DeveloperCD V2.1 </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?
</b><br>

AmigaOS. </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?
</b><br>

Nat&uuml;rlich auch AmigaOS. Aber dann hoffentlich OS4.0. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Just wait and see :-) </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren
wenn Du die geringe Resonanz siehst, die aus dem kleinen Amiga-Markt
erh&auml;ltst? </b><br>

Den Spa? am Programmieren auf gar keinen Fall. Auch meine Motivation die
GUI fortzuf&uuml;hren ist zur Zeit noch sehr gro&szlig;. </p>

<p><b>Erh&auml;ltst Du genug R&uuml;ckmeldungen f&uuml;r Deine Software?
</b><br>

Wie mans nimmt. E-Mails habe ich bis jetzt erst drei erhalten, inklusive
dieser Interviewanfrage. Aber wenn ich die Hits meiner Homepage betrachte,
bin ich mehr als zufrieden. Innerhalb der ersten drei Tage 500 Hits zu
haben ist schon cool :-) </p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt? </b><br>

Jetzt, um dieses Interview zu tippen :-) </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

Oh. Das ist schon l&auml;nger her. Ich glaub` das war Shogo. </p>

<p><b>Welche Software verwendest Du noch? </b><br>

Soll ich die alle aufz&auml;hlen!? Na gut, ein kleiner Auszug: Voyager,
Yam, SoftCinema, AMP, AmigaAMP, AmigaAIM und noch viel mehr... </p>

<p><b>Welche Hard-/Software hast Du vor zu kaufen? </b><br>

Auf jeden Fall OS4.0 und die passende Hardware dazu. Also entweder den
AmigaOne von Eyetech oder das Pegasos-Board. </p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

Kommt drauf an was man unter Comeback versteht. Windows werden wir wohl
nicht verdr&auml;ngen. In n&auml;chster Zeit jedenfalls nicht ;-) Ich
denke, wenn Amiga es schafft jemals die Stellung zu erreichen die Apple
jetzt inne hat, k&ouml;nnen wir sehr zufrieden sein. Aber auch das ist z.
Zt. leider sehr unrealistisch. Ich w&auml;re jedenfalls zufrieden, wenn die
OS-Entwicklung kontinuierlich fortgef&uuml;hrt wird und wieder mehr
zeitgem&auml;&szlig;e Software verf&uuml;gbar ist. </p>

<p><b>Deine letzten Worte an die Leser? </b><br>

Vertragt Euch :-) </p>

<p> © Amiga Arena 3/2002 </p>

</td></tr></table>
<br>
</body>
</html>
