<html>
<head>
<title>Interview6</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Mathias Roslund</b> </td></tr>
<tr><td valign=top>Software: </td>
<td> AMP</td></tr>
<tr><td valign=top> Homepage: </td>
<td> </td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> amp@amidog.com
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Ich bin ein 24 Jahre alter Softwareingenieur aus Schweden. </p>

<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten? </b><br>

1994 kaufte ich meinen ersten Amiga, einen A1200, aber es dauerte bis ich
meine PPC-Karte bekam, bevor ich mit ernsthafter Programmierung anfing, dem
AMP-Projekt. </p>

<p><b>Welches Amiga-Modell besitzt Du? </b><br>

A1200T mit BPPC (603e'200, 040'25, 128MB) und BVisionPPC. Er hat unter
anderem eine 30GB-Festplatte, DVD-ROM, 17"-Monitor und ZIP-Laufwerk. Ich
habe auch einen Desktop-A1200 mit einer B1220 und 720MB-Festplatte, den ich
benutze, um alte Spiele darauf zu spielen und so. </p>

<p><b>Welches Betriebssystem l&auml;uft auf Deinem Computer? </b><br>

OS3.5. Tats&auml;chlich habe ich OS3.9 gekauft, aber noch nicht die Zeit
gefunden, es zu installieren. Ich glaube das ist ein verbreitetes Problem
unter Codern, man hat nie genug Zeit. </p>

<p><b>Welche Software entwickelst Du? </b><br>

AMP ist mein gr&ouml;&szlig;tes und mehr oder weniger das einzige
pers&ouml;nliche Projekt. Alle Emulatoren sind blo&szlig; Portierungen,
obwohl ich manchmal helfe, Bugs zu jagen und Features hinzuzuf&uuml;gen,
aber alle Emulatoren werden von jemand anderem programmiert und von mir
blo&szlig; portiert. </p>

Einige der Emulatoren beinhalten: <ul>

<li>FPSE/Amiga - Playstation-Emulator </li>

<li> AmiGenerator - Sega MegaDrive/Genesis-Emulator </li>

<li> DarcNES/Amiga - Multi-Konsolen-Emulator, unterst&uuml;tzt unter
anderem das Sega Master System, Sega GameGear, das Nintendo Entertainment
System und PC-Engine (alias TurboGraphX 16). </li></ul> </p>

<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht? </b><br>

AMP ist ein Multimedia-Abspieler, der momentan MPEG, AVI, Quicktime und
RealMovie mehr oder weniger unterst&uuml;tzt. Unter den unterst&uuml;tzen
AVI- und Quicktime-Codecs sind Radius CinePak, DivX, OpenDivX und JPEG. Es
ist auch m&ouml;glich, (S)VCD- und CD-i-Filme sowie DVDs abzuspielen,
obwohl die DVD-Unterst&uuml;tzung momentan noch ziemlich eingeschr&auml;nkt
ist. </p>

<p><b>Was brachte Dich auf die Idee, Deine Software (weiter) zu entwickeln?
</b><br>

Ich liebe es einfach, zu programmieren. So einfach ist das. Falls ich eines
Tages aufwache und Programmieren langweilig finde, werde ich definitiv
damit aufh&ouml;ren. Nat&uuml;rlich ist auch nett, etwas positive Resonanz
zu bekommen :) </p>

<p><b>Wie lange hat die Entwicklung bisher gebraucht? </b><br>

AMP wird seit November 1998 entwickelt, das sind &uuml;ber 3 Jahre. </p>

<p><b>Welche Software verwendest Du? </b><br>

GCC-WarpUP (2.95.3) und einen einfachen Texteditor. </p>

<p><b>F&uuml;r welches System entwickelst Du? </b><br>

Momentan nur AmigaOS 3.x. Hin und wieder hacke ich etwas f&uuml;r Linux
oder Windows zusammen, um ein paar einfache Aufgaben zu erledigen, aber das
ist es auch schon. </p>

<p><b>W&uuml;rdest Du das "AmigaOS 4.0" oder "MorphOS" unterst&uuml;tzen?
</b><br>

Definitiv. MorphOS-Unterst&uuml;tzung wird es aber nicht geben, bevor ich
eine Version ohne Zeitbegrenzung bekomme, da diese ernsthaftes Entwickeln
sehr erschwert. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten? </b><br>

Unterst&uuml;tzung f&uuml;r mehr Codecs und nat&uuml;rlich bessere
Geschwindigkeit. Danach kommt es darauf an, was f&uuml;r Anforderungen ich
erhalte oder was ich pers&ouml;nlich gern an Features h&auml;tte. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst? </b><br>

Manchmal, aber ich entwickle Amiga-Software haupts&auml;chlich, weil ich
selbst ein Interesse daran habe. Ich h&auml;tte AMP wahrscheinlich auch
entwickelt wenn es niemand verwenden w&uuml;rde, aber R&uuml;ckmeldungen
sind nat&uuml;rlich hilfreich f&uuml;r die Motivation. </p>

<p><b>Bekommst Du genug R&uuml;ckmeldungen f&uuml;r Deine Software?
</b><br>

Nicht wirklich. Es ist sehr schwer zu raten, welche Probleme die Leute
haben k&ouml;nnten, oder welche zus&auml;tzlichen Features sie gern
h&auml;tten. </p>

<p><b>Wann hast Du Deinen Amiga zuletzt verwendet? </b><br>

Beim Schreiben dieser Antwort mit YAM :) </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?
</b><br>

Das muss Payback gewesen sein, gro&szlig;artiges Spiel &uuml;brigens.
</p>

<p><b>Welche Software bentutzt Du heute noch? </b><br>

Die Software, die ich (au&szlig;er den Entwicklungswerkzeugen) am meisten
benutze, muss YAM sein, gefolgt von IBrowse. Ich spiele auch Die
Siedler, wenn ich die Zeit finden kann. Das muss eines des besten
Spiele aller Zeiten sein. </p>

<p><b>Welche Soft-/Hardware hast Du vor zu kaufen? </b><br>

AmigaOne und/oder Pegasos und nat&uuml;rlich AmigaOS 4.</p>

<p><b>Glaubst Du an ein Comeback von Amiga? </b><br>

Wenn Du mit Amiga des Desktop-Computer meinst dann f&uuml;rchte ich, die
Chancen sind sehr gering. Es ist nicht leicht, die Leute dazu zu bringen,
von etwas zu wechseln, an das sie sich gew&ouml;hnt haben. Aber Amiga war
immer seiner Zeit voraus, und AmigaDE k&ouml;nnte gerade eine dieser Sachen
sein, die es tats&auml;chlich schaffen. </p>

<p><b>Deine letzten Worte an die Leser? </b><br>

Denkt immer dran, mit Eurem Computer Spa&szlig; zu haben. Oh, und falls Ihr
etwas habt, das Ihr mir gern mitteilen w&uuml;rdet, wie einen guten Witz,
eine BugMeldung oder eine Feature-Anfrage, schickt mir einfach ein Email :)
</p>

<p>Viele Gr&uuml;&szlig;e Mathias Roslund </p>

<p> © Amiga Arena 3/2002 <br>

(aus dem Englischen von Christian Busse)

</p>

</td></tr></table>
<br>
</body>
</html>
