<html>
<head>
<title> CSD Frankfurt - Politik und Party</title>
</head>
<body background="bg2.jpg">
<center><font color="blue"><big><b>C</b></big>hristopher <big><b>S</b></big>treet <big><b>D</b></big>ay <big><b>Frankfurt</b></big></font></center>
<br>
<br>
<table bgcolor="aqua" align="left" border="7" bordercolor="deepskyblue" cellpadding="2" cellspacing="5" width="60%" font size="-2">
<th bgcolor="yellow">Termin</th>
<tr>
<td>
<font face="XEN" size="-1" color="black"><u><br>CSD Frankfurt vom <b>19.07 - 21.07.2002</b> auf der Konstabler
Wache</u></font><br><br>
<font color="#000000" size="-1">Die CSD-Demo findet am Samstag, den 21.07. statt.<br>Anmeldeformulare für
CSD-Info-St&auml;nde sowie die Parade gibt's im Internet unter <font color="blue"><a href="http://www.csd-frankfurt.de">www.CSD-Frankfurt.de</a></font> oder beim<br><br> CSD
Organisationsb&uuml;ro<br> Rainer G&uuml;tlich Eventmanagment<br><br><u><font color="blue">069 - 46 999 475</font>
</td>
</tr>
</table>
<big>D</big>er Fr&#252;hling beginnt erst gerade, aber die Frankfurter CSD-Vorbereitungen
laufen bereits auf Hochtouren: nicht nur die Anmeldungen f&#252;r Info-St&#228;nde
und die Parade sind gestartet (siehe Tablelle), auch CSD Organisator
Rainer G&#252;tlich arbeitet hart am pers&#246;nlichen B&#252;hnenauftritt. Im Gegensatz
zum letztj&#228;hrigen Auftritt im Tr&#252;mmer-Trash-Kost&#252;m zum Abschluss des
dreit&#228;gigen Festes m&#246;chte G&#252;tlich zu diesem Jahr gl&#228;nzen: Steptanzstunden
stehen auf seinem Terminplan f&#252;r die B&#252;hne 2002 - &quot;Und er macht sich
ziemlich gut&quot; meinte sein Tanzlehrer R&#228;ppi La Belle. W&#228;hrend G&#252;tlich &#252;ber
die Hauptb&#252;hne auf der Konstablerwache steppt, k&#246;nnen sich andere T&#228;nzer
auf der Discob&#252;hne profilieren: denn auch die wird es, in leicht
abgewandter Form, geben. Genau wie das Politzelt, das in den letzten
beiden Jahren nicht stattfand. Es soll Raum f&#252;r Informationen und
Diskussion bieten: Im Vorfeld der im September stattfindenden
Bundestagswahlen werden sich die politischen Parteien bestimmt nicht
nehmen lassen, Rede und Antwort zu stehen.
<br><br>
<b><center><font color="blue">Demonstration oder Volksbelustigung? - Die &quot;Love Parade&quot;-Frage auch f&#252;r den
CSD?<br><br></font></center></b>
<big>D</big>ie letztj&#228;hrige Entscheidung des Berliner Oberverwaltungsgerichts, die
der &quot;Love Parade&quot; den Status einer Demonstration aberkannte, hat auch
Frankfurter Beh&#246;rden aufhorchen lassen: die hiesige Stadtverwaltung
meldete in diesem Jahr erstmals Bedenken an, den j&#228;hrlichen
CSD-Demonstrationszug durch die Frankfurter Innenstadt nicht als solchen
anzuerkennen. Demonstration oder blo&#223;e Volksbelustigung ohne Botschaft?
Schon das Frankfurter CSD-Motto &quot;Wir haben unsere Geschichte nicht
vergessen&quot; zeigt, dass die CSD-Parade mehr zu bieten hat als Federboas und
gepiercte Brustwarzen. Auch - oder gerade durch die Einf&#252;hrung der
Homo-Ehe im Sommer letzten Jahres sind politische Forderungen nicht
verstummt. Die Parade bietet die M&#246;glichkeit, Meinungen zu &#228;u&#223;ern, die
Vielfalt lesbischer-schwulen Lebens auch auf Plakaten, Bannern und
Spruchb&#228;ndern zur Schau zu stellen. Die Entscheidung, die Botschaft der
lesbisch-schwulen Demonstration nicht im Bass-Gewummer untergehen zu
lassen, liegt in der Community.<br><br><big> Lassen wir sie uns nicht nehmen.</big>
<br><br>
<table border="0" cellpadding="0" cellspacing="0">
<tr>
<td align="center">
<img src="img/Silvio_neu.jpg" alt="Der Autor"><a href="mailto:silvio.k@gmx.ch"><br>Sylvester &quot;Silvio&quot; Beck</a>
</td>
<td valign="bottom">
<img valign="bottom" src="img/moa.gif" alt="Made on Amiga" valign="top">
</td>
</tr>
</table>
</body>
</html>
