<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><img src="st_klima.gif"></p>

<h2>Gro&szlig;e Eisberge vom Schelfeis gel&ouml;st</h2>

<p><img src="st_klima1.jpg" align="left" alt="" width=150 height=100
hspace=6>Gro&szlig;e Eismassen l&ouml;sen sich vom antarktischen Schelfeis.
(Foto: NSIDC) </p>

<p>Gro&szlig;e Eismassen sind in den letzten Tagen vom Schelfeis der
antarktischen Halbinsel abgebrochen. Forscher machen eine lokale
Klima&auml;nderung daf&uuml;r verantwortlich. </p>

<p>Eisberge mit einer Gesamtfl&auml;che von 2600 Quadratkilometern (etwa so
gro&szlig; wie das Saarland) sind vor einigen Tagen vom n&ouml;rdlichen
Larsen-Schelfeis der antarktischen Halbinsel abgebrochen. Dies berichtet
das Alfred-Wegener-Institut (AWI) f&uuml;r Polar- und Meeresforschung unter
Hinweis auf aktuelle Satellitendaten. Nach Angaben der Polarforscher
beg&uuml;nstigt eine Klima&auml;nderung im Bereich der antarktischen
Halbinsel den Eisbruch. </p>

<h3>Gest&ouml;rtes Gleichgewicht</h3>

<p>Schelfeise sind auf dem Meer schwimmende Eisplatten, die vom Inlandeis
gespeist werden. Sie sind zwischen 200 und 1000 Meter dick und fest mit dem
Inlandeis verbunden. Gew&ouml;hnlich flie&szlig;t genauso viel Eis von der
Landseite her nach wie durch das Abbrechen (Kalben) von Eisbergen auf der
Seeseite verloren geht.<P>Doch das Larsen-Schelfeis, das sich in einer
Bucht auf der Ostseite der antarktischen Halbinsel befindet, wird seit
Jahren immer kleiner. Seit 1986 ging die Gesamtfl&auml;che von 15.500
Quadratkilometer auf nunmehr 4500 Quadratkilometer zur&uuml;ck. Um diesen
Verlust auszugleichen, w&auml;re eine K&auml;lte-Periode von mindestens 500
Jahren notwendig.</p>

<h3>Lokale Klima&auml;nderung</h3>

<p>Verantwortlich f&uuml;r den drastischen R&uuml;ckzug ist eine
Klima&auml;nderung im Bereich der antarktischen Halbinsel. Die mittlere
Sommertemperatur in diesem Gebiet liegt nahe null Grad Celsius. Ein
regionaler Temperaturanstieg um etwa zwei Grad lie&szlig; w&auml;hrend der
letzten drei&szlig;ig Jahre gro&szlig;e Mengen Schnee schmelzen. Durch das
Schmelzwasser entstehen Risse im Schelfeis, die im Laufe der Jahre wachsen.
Die starken Westwinde in dieser Gegend l&ouml;sen schlie&szlig;lich das
Kalben der Eisberge aus. </p>

<p>Das Larsen-Schelfeis ist f&uuml;r die Forschung besonders interessant,
weil an ihm erstmals das Schwinden eines Schelfeises detailliert studiert
werden kann. So haben Untersuchungen in den letzten Jahren gezeigt, dass
die dahinter fest aufliegenden Gletscher ohne vorgelagertes Schelfeis
schneller abflie&szlig;en und so zum Anstieg des Meeresspiegels beitragen
k&ouml;nnen. Die Eisberge aus dem Schelfeis hingegen lassen den
Meeresspiegel nicht steigen, weil schon das Schelfeis im Wasser schwimmt.
</p>

<h3>Sauerstoff-Mangel im S&uuml;dlichen Ozean</h3>

<p>Mehr als die H&auml;lfte des Tiefenwassers der Weltmeere wird im
s&uuml;dlichen Polarmeer aufgefrischt. Doch der ozeanischen «Lunge» droht
der Sauerstoff auszugehen. In den Tiefen des S&uuml;dlichen Ozeans
schwindet der Sauerstoff. Das folgern australische Forscher aus
Klimasimulationen und Daten zweier Forschungsexpeditionen. Damit droht
ausgerechnet der «Lunge» der Weltmeere die Luft auszugehen.</p>

<p>55 Prozent des Tiefenwassers, das die Weltmeere regeneriert, stammt aus
dem S&uuml;dlichen Ozean. Grund genug f&uuml;r die Forschung, dem
Meeresgebiet rund um die Antarktis besondere Aufmerksamkeit zu widmen. Bei
zwei Expeditionen des australischen CSIRO (Commonwealth Scientific &
Industrial Research Organisation) konnten in den Jahren 1995 und 2001 Daten
gesammelt werden, die die Simulationen der Meeresforscher
best&auml;tigten.</p>

<p>«Nach unseren Klimasimulationen nimmt der Sauerstoffgehalt in Tiefen
zwischen 500 und 2500 Metern kontinuierlich ab», so Richard Matear vom
CSIRO. «Die Ergebnisse der beiden Expeditionen untermauern diese
Vorhersage.» Nach Ansicht der Wissenschaftler schwindet der Sauerstoff,
weil immer weniger sauerstoffreiches Wasser in den Ozean gelangt. </P>

<p>&Uuml;ber die Auswirkungen des Sauerstoffschwunds auf die maritime Tier-
und Pflanzenwelt k&ouml;nnen die Forscher noch keine Aussagen machen.
Entsprechende Untersuchungen stehen noch aus. </p>

<h3">Ozonloch durch Vulkanausbr&uuml;che</h3>

<p><img src="st_klima2.jpg" align="left" alt="" width=150 height=100
hspace=6> Neue Computer-Berechnungen lassen bef&uuml;rchten, dass auch
&uuml;ber dem Nordpol ein Ozonloch entsteht. Forscher machen vor allem
Vulkanausbr&uuml;che daf&uuml;r verantwortlich.</p>

<p>Vulkanausbr&uuml;che k&ouml;nnten in naher Zukunft ein Ozonloch
&uuml;ber dem Nordpol verursachen. Das ist das Ergebnis einer Studie von
US-Wissenschaftlern in der aktuellen Ausgabe der Zeitschrift «Proceedings
of the National Academy of Science». Die Forscher bef&uuml;rchten, dass das
Ozonloch &uuml;ber der Arktis in sp&auml;testens drei&szlig;ig Jahren
&auml;hnlich gro&szlig; sein k&ouml;nnte wie &uuml;ber dem S&uuml;dpol.
</p>

<h3>Wolken aus Schwefels&auml;ure</h3>

<p>Seit 1980 beobachten Wissenschaftler eine je nach Jahreszeit
unterschiedlich stark ausgepr&auml;gte Sch&auml;digung der Ozonschicht
&uuml;ber dem S&uuml;dpol. Ein vergleichbares Ozonloch &uuml;ber dem
Nordpol wurde bislang noch nicht gemessen. Bei der Auswertung von
Satellitendaten und Luftaufnahmen vom Nordpol stie&szlig;en Azadeh
Tabazadeh und seine Kollegen vom «Nasa Ames Research Center» jetzt auf
Hinweise, die eine &auml;hnliche Entwicklung auch f&uuml;r die arktische
Ozonschicht bef&uuml;rchten lassen.<P>«Innerhalb der n&auml;chsten
drei&szlig;ig Jahre wird es wahrscheinlich ein 'vulkanisches Ozonloch'
&uuml;ber der Arktis geben», so Tabazadeh. Schuld daran sind
Schwefelteilchen, die bei Vulkanausbr&uuml;chen in die Atmosph&auml;re
geschleudert werden. In gro&szlig;er H&ouml;he formieren sie sich zu Wolken
aus Schwefels&auml;ure, die an der Ozonschicht nagen. Unterst&uuml;tzt
werden sie in ihrem Zerst&ouml;rungswerk durch so genannte «Polare
Stratosph&auml;rische Wolken» aus Salpeters&auml;ure und Wasser, die sich
bei besonderer K&auml;lte in der Atmosph&auml;re bilden.

<p>«Wenn starke vulkanische Aktivit&auml;t und besonders kalte arktische
Winter zusammenkommen, m&uuml;ssen wir mit einem arktischen Ozonloch
rechnen», so Tabazadeh. Besonders schwefelreiche Eruptionen wie der
Ausbruch des philippinischen Vulkans Pinatubo 1991 haben die Ozonschicht
&uuml;ber beiden Polen bereits in der Vergangenheit gesch&auml;digt. </p>

<p>«Das Material aus einem Vulkanausbruch verbreitet sich weltweit»,
erl&auml;utert der Wissenschaftler. «Bei Computersimulationen der
Pinatubo-Eruption verteilten sich die Emissionen innerhalb weniger Monate
bis in die Stratosph&auml;re &uuml;ber dem Nordpol.» Nach der
Pinatubo-Explosion verzeichneten Nasa-Satelliten steigenden Ozonverlust
auch &uuml;ber der Arktis.<P>Auch das schnelle Anwachsen des antarktischen
Ozonlochs in den fr&uuml;hen achtziger Jahren wurde durch
Vulkanausbr&uuml;che beg&uuml;nstigt. Bis zu 70 Prozent des Ozonverlustes
f&uuml;hren die Forscher auf vulkanische Emissionen zur&uuml;ck. Womit der
Einfluss des Menschen auf die Sch&auml;digung der Ozonschicht jedoch nicht
unbedingt kleingerechnet werden soll. «Der steigende Ozonverlust &uuml;ber
beiden Polen beruht auf einer Kombination von Vulkanausbr&uuml;chen und
klimatischen Ver&auml;nderungen», so Tabazadeh. Und letztere, darauf deuten
viele Daten der letzten Jahre hin, werden entscheidend vom Menschen
beeinflusst. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
