<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1a.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>Maya</b></font></p>

<p><b><i>Forscher entdeckt &auml;ltestes Maya-Wandbild </i></b><br> Diese
kleine Bemerkung (ich wei&szlig; nicht mehr in welchem Zusammenhang)
lie&szlig; mich neugierig werden und der Sache etwas nachgehen. </p>

<p>Auf der Flucht vor dr&uuml;ckender Tropenhitze hat ein Arch&auml;ologe
einen spektakul&auml;ren Fund gemacht: das &auml;lteste vollst&auml;ndige
Wandgem&auml;lde der Maya-Kultur. Durch Zufall hat ein Arch&auml;ologe in
Guatemala ein Meisterwerk der Maya-Kultur entdeckt. Im Inneren einer
Pyramide der Ruinenstadt San Bartolo stie&szlig; der Forscher auf ein
vollst&auml;ndig erhaltenes Wandgem&auml;lde. Mit rund 2000 Jahren ist es
das &auml;lteste Maya-Zeugnis dieser Art. </p>

<p>&Uuml;ber die Entdeckung, die schon im M&auml;rz vergangenen Jahres
gemacht wurde, berichtet das Magazin &laquo;National Geographic&raquo; in
seiner Aprilausgabe. Danach war der Arch&auml;ologe William Saturno vor der
dr&uuml;ckenden Hitze in einen unterirdischen Tunnel gefl&uuml;chtet, den
Grabr&auml;uber als Zugang zu einer Pyramide der Ruinenstadt San Bartolo
gegraben hatten. Dort stie&szlig; er auf das von den Dieben bereits
teilweise freigelegte Gem&auml;lde. </p>

<p>Das Bild zeigt eine Szene mit neun Personen, eine davon wahrscheinlich
ein Maisgott. Die Figuren sind von geometrischen Mustern umgeben.
Vermutlich sind erst etwa zehn Prozent des Gem&auml;ldes freigelegt.
Experten datieren den Fund, der von seinem Entdecker zu den
&laquo;wichtigsten Fundst&uuml;cken der Maya-Kultur&raquo; gerechnet wird,
in die pr&auml;klassische Periode der Maya.

<p>Wandgem&auml;lde aus dieser Zeit (etwa 2000 vor bis 250 nach Christus)
wurden bislang nur in der guatemaltekischen Ruinenstadt Tikal entdeckt. Die
dortigen Bilder sind jedoch kleiner und weniger gut erhalten als der neue
Fund. Mehr Informationen &uuml;ber das Gem&auml;lde und die bislang wenig
bekannte Fundst&auml;tte San Bartolo soll jetzt ein auf f&uuml;nf Jahre
angelegtes Forschungsprojekt liefern. </p>

<p>Und nun noch ein bisschen Hintergrundwissen zur Mayakultur:<br> Die
Mayawelt kann man in 3 verschiedene Zonen unterteilen, die sich
geographisch folgenderma&szlig;en verteilen: <ol>

<img src="st_maya1.gif" alt="Mayagebiet" width="150" height="193" align=right
hspace=6> 

<li>Die Zentralzone enth&auml;lt im wesentlichen das Pet&eacute;n samt
Belize. Es ist ein flaches, vom Tropenwald bedecktes Land. Dort haben sich
die &auml;ltesten der gro&szlig;en Mayast&auml;dte wie <b>Tikal</b> und
Uaxactun gebildet. Au&szlig;erdem z&auml;hlt zum Zentralgebiet auch das
Becken des Rio Usumacinta im Westen, das von Bonampak, Yaxchilan, Piedras
Negras und <b>Palenque</b> abgesteckt wird und sich bis Jonuta und
Comalcalco an der Golfk&uuml;ste im fernsten Westen der Mayawelt fortsetzt,
weniger als 100 km vom olmekischen Platz La Venta entfernt.</li>

<li>Die Nordzone, die den gr&ouml;&szlig;ten Teil der Halbinsel
Yucat&aacute;n umfa&szlig;t, mit den St&auml;dten des sogenannten
Puuc-Stils: <b>Uxm&aacute;l</b>, <b>Kabah</b>, Labn&aacute; und
<b>Chich&eacute;n Itz&aacute;</b> und den St&auml;dten im Rio Bec-Stil:
Xpuhil, Chicanna und Kohunlich.</li>

<li>Schlie&szlig;lich die S&uuml;dzone mit dem Bergland S&uuml;dguatemalas,
dessen Vulkanketten den Pazifik s&auml;umen.</li> </ol><br clear=all>

<p>Es gab kein einheitliches Maya-Reich. Das Maya-Tiefland war in eine
Reihe unabh&auml;ngiger politischer Einheiten aufgeteilt, die den
Stadtstaaten der Sumerer und Griechen &auml;hnelten. Anscheinend befanden
sich diese Zentren in dauernden Kriegszustand, wobei bis zum 3. Jahrhundert
anscheinend nicht territoriale Vergr&ouml;&szlig;erungen, sondern die
Gefangennahme hochrangiger Pers&ouml;nlichkeiten das Hauptziel der
Kampfhandlungen war. Kriegf&uuml;hren und Gefangennehmen von Gegnern war
f&uuml;r Maya-K&ouml;nige enorm wichtig. Damit vergr&ouml;&szlig;erten sie
ihr Prestige. Je wichtiger der Gefangene war, desto gr&ouml;&szlig;er war
der Prestigegewinn. Die Gefangenen wurden dann in einem Opferritual
gefoltert und get&ouml;tet.</p>

<table border="0" width="100%">
<tr>
<td width="33%">
<p align="center">
<img border="0" src="st_maya2.jpg" alt="Gef&auml;&szlig;" width="127"
height="138"></td>
<td width="33%">
<p align="center">
<img border="0" src="st_maya3.jpg" alt="Maya" width="60" height="138"></td>
<td width="34%">
<p align="center">
<img border="0" src="st_maya4.jpg" alt="Gef&auml;&szlig;" width="132"
height="138"></td>
</tr>
</table>

<p>Trotzdem entwickelten die Maya eine gemeinsame Kultur. Dieses Volk einte
dieselben Mythen, dieselbe Sch&ouml;pfungsgeschichte, die Religion und
dieselben Vorstellungen von dem Leben nach dem Tode. </p>

<p>Sp&auml;testens nach dem 1. Jahrhundert nach Christi gab es zwischen dem
Tiefland der Mayas und Teotihuac&aacute;n Kontakte. Man fand
Gegenst&auml;nde von Teotihuac&aacute;n-Machart in Tikal und anderen
Tieflandorten und Gegenst&auml;nde im Maya-Stil in Teotihuac&aacute;n. Es
wurden nicht nur materielle G&uuml;ter ausgetauscht, sondern auch Ideen,
wie man am Tlaloc-Venus-Krieg sieht.</p>

<p>Die sp&auml;tklassische Maya-Kultur erreichte ihren H&ouml;hepunkt im
s&uuml;dlichen Tiefland Ende des 7. Jahrhundert und w&auml;hrend des 8.
Jahrhundert. Etwa 800 n.Chr. begann in den s&uuml;dlichen Mayast&auml;dten
dann ein weitreichender und unerkl&auml;rlicher Verfall sp&uuml;rbar zu
werden. Das ganze Jahrhundert hindurch stellte Stadt auf Stadt die
Steinmetzarbeiten ein, h&ouml;rte auf, Steinmonumente zu errichten. Die
Baut&auml;tigkeit kam an den meisten Orten v&ouml;llig zum Stillstand. Die
St&auml;dte wurden von ihren Bewohnern aufgegeben und vom Tropenwald
&uuml;berwuchert.</p>

<table border="1" cellspacing="2" bordercolor="#000000" cellpadding="5"
width="100%">
<tr>
<td width="48%"><b>Merkmale des Zeitabschnitts</b></td>
<td width="52%"><b>Chronologie</b></td>
</tr>
<tr>
<td width="48%"><u><b>Fr&uuml;he Vorklassik</b></u><br>
Erste dauerhafte Dorfsiedlungen an Fl&uuml;ssen und Seen. Landwirtschaft.
Entstehen hierarchisch strukturierter Dorfgemeinschaften</td>
<td width="52%"><u><b>2000-900 v. Chr.</b></u><p><br>
1100 Erste Siedler im <b>Cop&aacute;n-Tal</b></td>
</tr>
<tr>
<td width="48%"><u><b>Mittlere Vorklassik</b></u><br>
Durchgehende Besiedlung der gesamten Mayaregion. Weitere &ouml;konomische
und soziale Differenzierung. St&auml;dte entstehen. Verdichtung der
Handelsbeziehungen. Fernhandel.</td>
<td width="52%"><u><b>900-400 v. Chr.</b></u><p>&nbsp;</p>
<p>600 &Auml;lteste Siedlung im Gebiet von Tikal</td>
</tr>
<tr>
<td width="48%"><u><b>Sp&auml;te Vorklassik</b></u><br>
Starkes Bev&ouml;lkerungswachstum und Neugr&uuml;ndungen vieler
St&auml;dte. Gro&szlig;e Bev&ouml;lkerungszentren. Das K&ouml;nigtum
entsteht. Verwendung der Hieroglyphenschrift. Einf&uuml;hrung von
Bew&auml;sserungssystemen, Terrassierung und Hoch&auml;cker-Wirtschaft.
Regional Krisenerscheinungen.</td>
<td width="52%"><b><u>400 v. Chr.-250 n. Chr.</u></b><br>
300 v.Chr. Miraflores-Anfang in Kaminaljuyú <br>
50 n. Chr. Aufgabe von Zentren wie El Mirador und Cerros.<br>
197 &Auml;lteste datierte Stele<br>
219 Dynastiegr&uuml;ndung in Tikal</td>
</tr>
<tr>
<td width="48%"><u><b>Fr&uuml;he Klassik</b></u><br>
Die politische Struktur des Staates entwickelt und verbreitet sich.
Selbst&auml;ndige Stadtstaaten. Stark geschichtete, spezialisierte
Gesellschaft. Im 6. Jh. allgemeine Schw&auml;cheperiode
(&quot;Hiatus&quot;)</td>
<td width="52%"><u><b>250-600 n. Chr.</b></u><br>
292 Erste datierte Mayastele in Tikal<br>
426 Yax K`uk`Mo` gr&uuml;ndet die Dynastie von Cop&aacute;n<br>
541 Beginn des Baus der Akropolis von Cop&aacute;n<br>
553 Inthronisation von K&ouml;nig Wasser (Yahaw Te) in Caracol<br>
562 Caracol f&uuml;hrt Krieg gegen Tikal <br>
5-6. Jh. Wanderungen von V&ouml;lkern aus dem Hochland und Einflu&szlig;
von Teotihuac&aacute;n </td>
</tr>
<tr>
<td width="48%"><u><b>Sp&auml;te Klassik</b></u><br>
Aufstieg neuer, m&auml;chtiger Herrschaftszentren. H&ouml;hepunkt der
demographischen und kulturellen Entwicklung. Im 9. Jh. Niedergang des
s&uuml;dlichen Tieflands. Ursachen: Zunahme und Intensivierung von Kriegen,
&ouml;konomische und &ouml;kologische Krise. Politische Destabilisierung.
Aufgabe der Zentren. Aufstieg und Bl&uuml;te des n&ouml;rdlichen
Tieflands.</td>
<td width="52%"><u><b>600-900 n. Chr.</b></u><br>
615 Pakal K&ouml;nig von Palenque<br>
642 Sonnentempel in Palenque<br>
681 Schild-Jaguar K&ouml;nig von Yaxchilan<br>
683 Tod Pakals von Palenque<br>
695 18-Kaninchen K&ouml;nig von Cop&aacute;n<br>
Platte der Krypta von Palenque<br>
um 700 Grab des Tempels I in Tikal<br>
746-810 Stelen im F&uuml;nfjahresrhythmus in <b>Quirigu&aacute;</b><br>
752 Vogel-Jaguar K&ouml;nig von Yaxchilan<br>
763 Yax Pak K&ouml;nig von Cop&aacute;n<br>
820 Yax Pak stirbt<br>
822 Letztes Steinmonument in Cop&aacute;n<br>
867 Fr&uuml;hestes Inschriften-Datum in Chich&eacute;n Itz&aacute;</td>
</tr>
<tr>
<td width="48%"><u><b>Nachklassik</b></u><br>
Die Institution der zentralen Herrschaft verliert endg&uuml;ltig an
Bedeutung. Regierung durch Gruppen. Bis zur Mitte des 15. Jh. Niedergang
aller dominierender Zentren. Yucat&aacute;n wird in eine Reihe
unabh&auml;ngiger Provinzen aufgeteilt. Zustand, den die Spanier
vorfinden.</td>
<td width="52%"><u><b>900-1500</b></u><br>
9. Jh. Aufgabe von Tikal, Quirigu&aacute;<br>
909 Letztes Datum in Langer Z&auml;hlung<br>
967 Quetzalcoatl zieht von Tula nach Chich&eacute;n Itz&aacute;<br>
11.-13. Jh. Wiederbesiedlung von Tikal<br>
1200 Cop&aacute;n vollst&auml;ndig verlassen<br>
Chich&eacute;n Itz&aacute; wird aufgegeben<br>
1224 Ende der toltekischen Herrschaft in Yucat&aacute;n; Invasion der
Itz&aacute;<br>
1250 Gr&uuml;ndung Mayap&aacute;ns<br>
1263 Itz&aacute; sind in Mayap&aacute;n<br>
1283 B&uuml;rgerkrieg mit den Cocom<br>
1441 Ende der Liga von Mayap&aacute;n <br>
1451 Untergang Mayap&aacute;ns</td>
</tr>
<tr>
<td width="48%"><u><b>Kolonialzeit</b></u><br>
Eroberung und Missionierung durch die Spanier, Unterwerfung. Hispanisierung
indianischer Kultur und Lebensweise. Wiederholt Mayaaufst&auml;nde.
Isolierte Gruppen k&ouml;nnen sich dem Kontakt noch entziehen.</td>
<td width="52%"><u><b>1500-1821</b> (in Belize bis 1981)</u><br>
1524 Quiche-Hauptstadt erobert<br>
1542 Spanier gr&uuml;nden Merid&aacute;<br>
1697 Letztes unabh&auml;ngiges Mayareich unterworfen (Tayasal)<br>
1712 Tzeltal-Aufstand in Cancún<br>
1820 Quiche-Aufstand von Totonicapan</td>
</tr>
<tr>
<td width="48%"><u><b>Unabh&auml;ngigkeit von Spanien</b></u><br>
Weitere Rebellionen. Marginalisierung, Unterdr&uuml;ckung und Verfolgung
indianischer Ethnien: R&uuml;ckbesinnung auf eigenst&auml;ndige indianische
Kultur (&quot;Maya-Renaissance&quot;) in j&uuml;ngster Zeit.</td>
<td width="52%"><u><b>seit 1821</b> (in Belize seit 1981)</u><br>
1847-1901 &quot;Kastenkrieg&quot; der Maya in Yucat&aacute;n<br>
1867-1870 Tzotzil-Rebellion in Chamula<br>
1992 Proteste indianischer Organisationen gegen die Kolumbus-Feiern</td>
</tr>
</table>
<p>Das sollte nun reichen. </p>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
