<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Kalenderspr&uuml;che</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>
Wussten Sie .......</b></font></p>

<center><table border=0 width=80%><tr><td bgcolor="#ffffee"> <p>Wussten
Sie, dass im alten China Messbecher f&uuml;r Getreide und Wein, wenn sie
vorschriftsm&auml;&szlig;ig hergestellt waren, einen ganz bestimmten Klang
erzeugen mussten? <br>

Statt exakte Ma&szlig;e f&uuml;r die Gef&auml;&szlig;e anzugeben, diktierte
man den T&ouml;pfern Form, Gewicht und den Ton, in dem sie klingen sollten,
wenn man sie anschlug. Jede Abweichung vom richtigen Ton entlarvte damit
ein falsches Volumen und somit eine ungenaue Arbeit. </p>
</td></tr></table></center>

<p>Diese Kalenderbl&auml;tter - was da doch an reichhaltigen Informationen
enthalten sind. <i><b>Im alten China </b></i>, ja wann war denn dies
&uuml;berhaupt? War das zur Zeit der Yangshao-Kultur, also 3000 v.Chr.?
Oder sollte man diese Zeit unter einer der verschiedenen Dynastien
ansiedeln, wie Longshan, Shan oder Zhou? Oder doch schon zur Zeit von
Konfuzius oder in die Zeit der Teilung, als der Buddismus sich verbreitete
und die Han-Dynastie in viele kleine Dynastien aufgespalten wurde? Ein
bisschen ungenau ist also die Aussage schon. Man sagt ja auch nicht: im
alten Deutschland. Gut gut, ein hinkender Vergleich, denn die Geschichte
von Deutschland beginnt eigentlich erst mit der Zeit von Karl des
Gro&szlig;en (800 n.Chr.). Wenn wir von der alten Zeit sprechen, sagen wir
gerne <b>Alte Welt</b> und teilen dann in die Zeitepochen ein, wie
Steinzeit, Bronzezeit und so weiter. Oder wir sprechen von den sogenannten
Hochkulturen, wie Euphrat-Tigris-Gebiet, Niltal, Industal und Huang-He-Tal.
Bei Angaben wie z.B. in der Zeit von C&auml;sar oder in der Zeit von
Alexander dem Gro&szlig;en werden zu enge Zeitr&auml;ume vorgegeben. Im
alten China sagt man doch nur, wenn man etwas mystifizieren m&ouml;chte und
dann eine Zeit angeben m&ouml;chte, die nicht existent oder eigentlich nur
fiktiv war. <br>

So auch die Aussage <i><b>und Wein</b></i>. Da gibt es meines Wissens nur
der K&uuml;stenstreifen der s&uuml;dlichen Mandschurei und &ouml;stlich von
Peking. Aber das ist wirklich f&uuml;r unsere Begriffe unbedeutend, denkt
man. Dabei macht man sich &uuml;berhaupt keine Gedanken, dass dieses
Anbaugebiet beinahe doppelt so gro&szlig; wie dies in S&uuml;dafrika ist
und den s&uuml;dafrikanischen Wein kennt man und kann ihn in fast jeder
gr&ouml;&szlig;eren Lebensmittelhandelskette kaufen. Oder ist etwa der
Pflaumenwein damit gemeint? Dies ist mehr oder weniger der leider einzige
chinesische Wein, der auf hiesigen chinesischen Speisekarten steht, aber
sehr gut schmeckt. </p>

<p>Und dabei bin ich noch nicht einmal auf den vorgeschriebenen Klang der
Gef&auml;&szlig;e eingegangen. <hr></p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
