<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Computer`98</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Computer `98</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>

<P>Vom 13. bis 15. November war es wieder soweit: Die gr&ouml;ﬂte deutsche Amiga-
Messe, die Computer 98 in K&ouml;ln, wurde zelebriert. Bereits am Freitag
Vormittag war der Zulauf recht kr&auml;ftig, einige Parkdecks waren fast voll
besetzt. Vorbildlich war die Beschilderung und das Bodenpersonal, das
beim Einflug in die Parkl&uuml;cken mit einwinken half. 8 DM Parkgeb&uuml;hren f&uuml;r
den ganzen Tag ist vergleichsweise wenig f&uuml;r diesen Service. Den hatte
ich auch n&ouml;tig, nach 5 Stunden Autofahrt erst im Dunkeln und dann bei
Nieselregen.</P>

<P>Die Tageskarte kostete 20 DM, zusammen mit Parkgeb&uuml;hr und Sprit waren
also schon mal 100 DM futsch, nur um &uuml;berhaupt die Messehalle betreten
zu k&ouml;nnen. Die erste Entt&auml;uschung gab es dann auch schon mit der
Eintrittskarte: Der auf der Messe-Homepage versprochene Ausstellerkatalog
war nicht vorhanden. Wie es schien, war er auch nie geplant, denn auﬂer
ein paar Werbeflugbl&auml;tter war an der Kasse nichts zu bekommen. Daf&uuml;r
entsch&auml;digten dann die netten M&auml;dels am Einlaﬂ.</P>

<P>Drinnen wurde man gleich am Eingang erst mal von verschiedenen Leuten mit
Flugbl&auml;ttern eingedeckt, Werbung von Schatztruhe, einem Spieleversand und
einem Aktionsblatt der DAUG. Die DAUG (Dachverband deutscher Amiga User
Groups) ist eine Interessengemeinschaft der Amiga Clubs, die auf Amiga
Inc. im Sinne der User einwirken will. Wenn man die Miﬂverst&auml;ndnisse und
Fehlentscheidungen sieht, die bis jetzt schon passiert sind, sicher eine
gute Sache. Wer sich weiter daf&uuml;r interessiert:</P>

WWW:   <A HREF="http://www.HP.Europe.de/DAUG">http://www.HP.Europe.de/DAUG</A><br>
EMail: <A HREF="mailto:DAUG@Europe.de">DAUG@Europe.de</A><br>
SMail: DAUG<br>
       Postfach 59<br>
       D-83236 &Uuml;bersee<br>

<P>Nachdem ich den ersten Papierstapel aus Werbematerial dann im n&auml;chsten
M&uuml;lleimer versenkt hatte, versuchte ich der ersten groﬂen L&auml;rmquelle,
der Vorf&uuml;hrung eines PC-Autorennsimulators, aus dem Weg zu gehen und
landete in einer ruhigen Ecke, beim StormRexx-Seminar. Die etwa siebzig
St&uuml;hle waren zu drei Vierteln besetzt, f&uuml;r 11:45 Uhr ganz gut, es wurden
im Laufe des Tages aber nicht mehr. Der Seminarleiter von Haage &amp; Partner
rackerte sich redlich ab, aber die Resonanz aus dem Publikum war,
vorsichtig ausgedr&uuml;ckt, verhalten. Irgendwie hatte er Schwierigkeiten,
die Vorz&uuml;ge von StormRexx an den Mann und die Frau zu bringen. Ob es an
ihm, oder dem Produkt lag?</P>

<P>&Uuml;berhaupt war &uuml;berraschend, wie viele Frauen und auch &auml;ltere Semester
anwesend waren, nicht nur hinter den Verkaufsst&auml;nden, auch im Publikum.
Die Publikumsmagneten hingegen waren fast nur von M&auml;nnern besucht:
Torwandschieﬂen und &quot;Human Table Soccer&quot;, ein riesiges Tischfuﬂballfeld
mit echten Menschen an den Stangen. </P>

<P>Eigentlich war ich ja wegen der Computer und im speziellen wegen dem
Amiga zur Messe gekommen, also habe ich mich erstmal quer durch die
St&auml;nde gek&auml;mpft. Gut die H&auml;lfte der Aussteller waren Amiga-Firmen, fast
alle namhaften Hersteller waren vertreten, wer fehlte, war eigentlich
nur Phase 5.</P>

<P>Die einzelnen Austeller hatten verschiedene Methoden, das Publikum
anzulocken. Die meisten protzten mit einer &uuml;bervollen Auslage an Billig-
CDs, die zwar nicht unbedingt ihr Geld wert waren, aber trotzdem die
Leute anlockten. Wieder andere, und hier vor allem Amiga Int./Inc.,
versuchten mit &uuml;berlauter Technomusik die Massen anzuziehen. Und sie
kamen auch. Anscheinend ist Kopfschmerz unverzichtbarer Teil des
heutigen Lifestyles.</P>

<P>Genau gegen&uuml;ber vom Amiga-Stand gab es die dritte Form der Attraktion:
Oberland Computer zeigte die neueste Version 7 der Bildbearbeitungssoftware
Wildfire. Zwar verstand man kaum sein eigenes Wort im L&auml;rm des Amiga-Stands,
aber was die Software an Effekten zeigte, war rein optisch ein Kracher. So
war die Vorf&uuml;hrung eigentlich immer von einigen faszinierten Leuten
umstellt.</P>

<P>Der Gegenpol war die sogenannte Edutainment-Software. An den St&auml;nden war
nur tote Hose, einige wenige Bildungshungrige waren aber auch hier am
st&ouml;bern. Mittlerweile war es ein Uhr, und der Durst machte sich bemerkbar.
5 DM f&uuml;r eine Tasse Kaffee. Daf&uuml;r war er heiﬂ.</P>

<P>Die Kaufrenner waren eindeutig CDs, gefolgt von Scannern und CD-Brennern.
Besonders verlockend war ein Stand mit Billigst-Festplatten, 50 DM f&uuml;r das
Gigabyte. Nat&uuml;rlich aus Konkursbest&auml;nden und Hochwassersch&auml;den, ohne
Garantie... Der PC-Markt lockte mit g&uuml;nstigen Prozessoren und &auml;lteren
Motherboards, auﬂerdem mit Kleinteilen f&uuml;r Rechner.</P>

<P>Am wenigsten Betrieb war ganz offensichtlich am Stand der Bundeswehr, was
aber genauso offensichtlich am nicht konkurrenzf&auml;higen Angebot an
Computern lag.</P>

<P>Den Amiga-User erfreuten die wenigen Neuheiten, die es gab: Zum einen
wurde zur Messe die Erstausgabe einer neuen Amigazeitschrift verteilt, die
&quot;amigaOS&quot;, die ab Neujahr monatlich erh&auml;ltlich ist. Zum andern waren bei
VillageTronic die Picasso IV und die Ariadne 2 der Renner. Die Ariadne 2
ist eine abgespeckte Version der Ariadne-Netzwerkkarte f&uuml;r 199 DM. Und ein
paar Schritte weiter erh&auml;lt man eine PC-Netzwerkkarte f&uuml;r 25 DM...</P>

<P>Da wir gerade bei VillageTronic sind: Sie haben eine Umfrage gestartet,
wie die Amiga-User zu einer Grafikkarte mit 3Dfx-Chipsatz stehen. N&auml;heres
auf der Homepage unter: <A HREF="http://www.villagetronic.com/amiga/">http://www.villagetronic.com/amiga/</A></P>

<P>Nach &uuml;ber vier Stunden Messe habe ich mich dann wieder auf die Heimfahrt
gemacht. Zur&uuml;ck bleibt ein dumpfes Gef&uuml;hl im Ohr, vom L&auml;rm, und die
Gewiﬂheit, daﬂ ich n&auml;chstes Jahr wieder dabeisein werde. Nur mit mehr
Geld in der Tasche.</P>

<P>[Weitere Informationen zur Messe finden Sie bei <A HREF="../amz1298/news.htm">Am Puls</A>, d. Chefred.]</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="intern.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
