<HTML><HEAD>
    <TITLE>AmZeiger 12/98 - Benotung und HTML-Hinweis</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1>Hinweise</H1></CENTER>
<U>Anmerkung zur Benotung:</U>
Unser Benotung erfolgt beinahe nach dem Schulsystem von 1 (sehr gut) bis 6 (sehr
schlecht).<BR>

Unsere AmZeigerchen-Galerie:<BR>
<P><CENTER><IMG SRC="../images/noten.gif" WIDTH="224" HEIGHT="100" ALT="Galerie"></CENTER></P><BR>

<U>Anmerkung zur HTML-Version:</U><BR>

Ich habe Wert darauf gelegt, da&szlig; die HTML-Version m&ouml;glichst auch mit &auml;lteren, einfacheren
Browsern gut lesbar ist und verzichtete daher auch auf diverse &quot;Spielereien&quot;
wie z.B. Frames. Desweiteren herrscht bei uns die Meinung vor, da&szlig; auch zu viele
Bilder, Screenshots und sonstige Ausschm&uuml;ckungen eher zu Ablenkung f&uuml;hren, als wirklich
dem Inhalt dienlich zu sein. Daher werden auf gro&szlig;artige &quot;Bildergalerien&quot; verzichtet,
was auch den positiven Nebeneffekt hat, da&szlig; sich die Gr&ouml;&szlig;e der AmigaGuide-Version und die der
HTML-Version nicht um eine Zehnerpotenz unterscheidet und &auml;hnlich bleibt.<P>

Und noch ein Wort zur Verzeichnisstruktur: Alle HTML-Archive werden das Verzeichnis
&quot;AmZeiger&quot; anlegen und dort hinein die Daten entpacken. Hierbei ist
zu beachten (<B>WICHTIG!</B>), da&szlig; alle vorhandenen Dateien durch die einer
neueren Ausgabe ersetzt werden! Es kann sonst zu herrlichen Problemen kommen.
Jede Ausgabe legt ein eigenes Unterverzeichnis an, dessen Name sich aus AmZ und
der Nummer der Ausgabe zusammensetzt (f&uuml;r Ausgabe 06/97 hei&szlig;t das Verzeichnis
AmZ0697). In dieses Verzeichnis werden dann alle Dateien entpackt, die auf Grund
von sp&auml;terer Veraltung, Ausgabenabh&auml;ngigkeit oder &auml;hnlichem nur f&uuml;r diese Ausgabe gebraucht
werden. Die Artikel selber landen (sortiert nach Bereichen) in eigenen
Verzeichnissen. Wer sich also z.B. die Hardware&amp;Software-Tests/Berichte
aufheben will, kann alle Verzeichnisse au&szlig;er das Verzeichnis &quot;HW&quot; und
&quot;SW&quot; l&ouml;schen und die Artikel dann &uuml;ber den Index.htm immer noch erreichen.<P>

Falls sie nicht alle Ausgaben besitzen oder &auml;ltere gel&ouml;scht haben, k&ouml;nnen
Sie auch &uuml;ber das globale Artikelverzeichnis, das alle erschienenen Artikel
abdeckt, direkt auf den Server zugreifen, um Sie zu lesen.<BR>

Ihr<BR>
<A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A><BR>
Redakteur HTML-Ausgabe

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

