<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><B>Interna allgemein</B></H3>

<P>Da wir keinen Kontakt zu unserer <B>Supportbox</B> CCS in Seeshaupt herstellen
konnten, haben wir sie jetzt vorl&auml;ufig aus unserer Bezugsliste genommen.
Hallo Robert?</P>

<P>Der Support bei der Box <B>BBrandes</B> in Berlin ist ab Ende 1998 ausgelaufen,
da sie keine &ouml;ffentliche Box mehr ist. Bernd: danke nochmal f&uuml;r die
wirklich wichtige Unterst&uuml;tzung gerade in unserer Anfangszeit!</P>

<P>Gibt es eigentlich noch <B>Bedarf</B> f&uuml;r Supportboxen? Schreibt es uns!</P>

<HR WIDTH="50%">

<P>Wieder gibt es einige Mitglieder der <A HREF="../ml.htm">Mailingliste</a>, deren eMail-Adressen
nicht mehr korrekt sind. Nachfolgend sind sie aufgef&uuml;hrt. Wenn jemand
also doch mitliest und sich entdeckt: Bitte melden!</P>

<P>Hier die Adressen:</P>

<UL>
<LI>sogol@ibm.net</LI>
<LI>EMPTY@PEOPLE-X.PROMETHEUS.DE</LI>
<LI>Heinz@lava.east.de</LI>
<LI>WMeierINT@gmx.net</LI>
<LI>L.A.L.O.@rz.online.de</LI>
<LI>nilgen@enconet.de</LI>
</UL>

<H3><B>Hinweise zu dieser Ausgabe #7</B></H3>

<P>In dieser Ausgabe habe ich als Chefredakteur wegen tempor&auml;rer Auslastung
von Carsten Jahn f&uuml;r ein Mal die &Uuml;berwachung der <a href="../cc/9812bas.htm">Coder's Corner</a> &uuml;bernommen,
wodurch sie nat&uuml;rgem&auml;ﬂ etwas d&uuml;nner als sonst ausgefallen ist.</P>

<HR WIDTH="50%">

<P><B>Zu in der letzten Ausgabe versprochenen Artikeln:</B></P>

<P><B>Wasted Dreams</B> ist immer noch nicht eingetroffen, was einen Test bisher
unm&ouml;glich machte ;). Auf der Vulcan-Website steht der Status im Moment
auf &quot;angehalten&quot;.</P>

<P>Der Artikel zum <B>Paloma-Modul</B> f&uuml;r die PicassoIV-Grafikkarte hat sich
wegen Nichtverf&uuml;gbarkeit zerschlagen. Ob es noch dazu kommen wird,
ist ungewiﬂ.</P>

<P>Der bzw. die <B>Monitortests</B> haben sich auf die n&auml;chste Ausgabe verschoben
(s. Vorschau unten).</P>

<HR WIDTH="50%">

<P>Als Ausgleich sind wieder einige <B>interessante Artikel</B> zusammengekommen,
die zum gr&ouml;ﬂten Teil nicht angek&uuml;ndigt waren. Hinweisen m&ouml;chte ich noch
kurz darauf, daﬂ sich bei <A HREF="uhl.htm">Frau Gisela's Rubrik</A> dieses Mal ein Artikel mit
Praxistips zur Anwendung von Zip-Laufwerken am Amiga versteckt und auch
auf die sehr interessanten <A HREF="../hw/9812ill.htm">Ausf&uuml;hrungen</A> zu der Gesundheit am Computer-Arbeitsplatz.</P>

<HR WIDTH="50%">

<P>Bitte nicht vergessen, daﬂ wir eine <A HREF="../cc/9812pb.htm">Projektb&ouml;rse</A> eingerichtet haben, in der
Grafiker, Musiker, Programmierer oder was auch immer, von Entwicklerteams/
Firmen gesucht werden k&ouml;nnen oder selbst welche suchen k&ouml;nnen.</P>


<H3><B>Hinweise zur letzten Ausgabe #6</B></H3>
<P><B>Nachtr&auml;ge zur - HTML-Ausgabe:</B></P>

<P>Der an dieser Stelle zur letzten Ausgabe versprochene neue Eintrag,
unter dem auf der ersten Hauptseite (Ausgaben-Auswahl) auch die bisher
verliehenen <B>Awards</B> zu finden sein sollte, war aus Zeitgr&uuml;nden dort
nicht mehr hineingenommen worden. Ich hoffe, dies ist nun behoben.
Schlimmstenfalls wird er (zuerst in der Online-Version) nachgereicht.</P>

<HR WIDTH="50%">

<P>Leider ist fatalerweise (allerdings hat sich niemand beschwert) wieder
ein <B>Fehler</B> aufgetreten, der sich vor mehreren Ausgaben schon einmal
eingeschlichen hatte: Eine unkorrekte erste Startseite war enthalten.
Es handelte sich um die der Onlinevariante (bzw. einer davon), die zum
Upload ins WWW gedacht war. Dadurch war es nicht m&ouml;glich, einige der
&auml;lteren Ausgaben direkt von dieser Seite von der Festplatte zu laden.</P>

<P>Mit der Installation der aktuellen Ausgabe ist das Problem behoben.</P>

<P>Ab dieser Ausgabe werden wir die Fehlerkontrolle pro Ausgabe noch mehr
erweitern, so daﬂ alle Redaktionsmitglieder, wenn m&ouml;glich, involviert
sind, was bisher aus Zeitmangel nur unzureichend erfolgte.</P>

<HR WIDTH="50%">

<P>Bei dem Artikel zu dem Spiel <A HREF="../sw/9809ssi.htm">Sixth Sense Investigation</A> hatte sich aus
unerfindlichen Gr&uuml;nden eine falsche &Uuml;berschrift eingemogelt. Als
Autor war aber Thomas Heinrich korrekt angegeben. </P>


<H3><B>Hinweise zur n&auml;chsten Ausgabe #8</B></H3>

<P>Aller Wahrscheinlichkeit nach (denn Planen bleibt immer schwierig) wird
es in der n&auml;chsten Ausgabe u.a. Tests von einem preiswerten 17-und 19-
Zoll-Monitor geben, sowie einen Artikel zur Einbindung von Amigas in
Netzwerke. Auﬂerdem Tests des Spiels `Wasted Dreams` (wenn es denn
erscheinen sollte), von Marblelous II und den CD`s &quot;The Scene Archive&quot;,
DEKUBI, AmigaTimes und GameAttack. Die Fortsetzung des Installer- und Blitz-Basic-Kurses d&uuml;rfen nat&uuml;rlich
nicht fehlen.</P>

<P>Die Nr. 8 wird voraussichtlich Ende M&auml;rz oder Anfang April erscheinen.</P>


<P>Mit W&uuml;nschen, Hinweisen oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!</P>

<P>In diesem Sinne <B>alles Gute im neuen Jahr!</B> von der gesamten Redaktion.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="news.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="com98.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


