<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Interview: Oliver Kastl</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR>Oliver Kastl</P>

<P>Dieses Mal stand mir Oliver Kastl, der Macher von <B>Elaborate Bytes</B>, Rede und Antwort.
Er ist verantwortlich f&uuml;r so einige wichtige Produkte der Amiga-Vergangenheit und im Moment insbesondere
bekannt durch IDE-fix.</P>

<P>
AmZ: Gregor Franz<BR>
OK : Oliver Kastl
</P>

<HR WIDTH="50%">
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Zur Einf&uuml;hrung: Kannst Du Deine Firma Elaborate Bytes etwas
     vorstellen? Was ist die Zielsetzung, welche Produkte sind im
     Moment im Angebot und wieviele Mitarbeiter/Entwickler hast Du?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Elaborate Bytes gibt es jetzt schon &uuml;ber 10 Jahre. Wir haben uns
     auf Software f&uuml;r Massenspeicher (IDE/SCSI/Festplatten/CD-Roms/DVD,
     etc.) spezialisiert. Fr&uuml;her wurde auch eigene Hardware entwickelt.</P><P>
     Bis heute wurden nur Produkte f&uuml;r Amiga Computer vorgestellt, doch
     das wird sich bald &auml;ndern. Naja, ganz stimmt das nicht: Vor den
     Amiga-Controllern gab es zwei Produkte f&uuml;r den Sinclair QL:
     &quot;Elaborate Tools&quot; und &quot;Q-Pede&quot;. In der Vergangenheit haben wir
     Produkte wie ALF, ALF-II, ALF-III, Oktagon SCSI, TandemCD, Arriba,
     CD1200, CD1200 plus, EasyCD, Buddha, Catweasel (mit)entwickelt.</P><P>
     Aktuell ist zur Zeit nur IDE-fix '97. Oktapussy - eine neue Software
     f&uuml;r alte Controller wie Oktagon &amp; Co. - wurde mangels Nachfrage
     eingestellt und ist kostenlos erh&auml;ltlich. Als &quot;Add-on&quot; f&uuml;r IDE-fix,
     Oktapussy, Buddha &amp; Co. gibt es noch einige frei erh&auml;ltliche Tools
     wie &quot;HDInstTool&quot;. IDE-fix '97 ist an diverse Hardwarehersteller
     lizensiert worden.</P><P>
     Die einzigen festen Mitarbeiter sind meine Frau Frauke und ich
     selbst. Weiterhin gibt es noch je nach Bedarf 1-3 freie Mitarbeiter.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD> Wie kam es zur Gr&uuml;ndung von Elaborate Bytes? Womit hat alles
     angefangen und wie bist Du auf den Namen gekommen ;) ?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD>Zur Gr&uuml;ndung kam es ganz einfach: Ich hatte einen Amiga und merkte
     schnell, daﬂ der Amiga ohne Festplatte nicht viel Spaﬂ macht! Den
     Namen &quot;Elaborate Bytes&quot; hat sich ein Mitarbeiter ausgedacht.
     Vielleicht keine gl&uuml;ckliche Wahl, denn der Name ist zu lang -
     niemand kann ihn aussprechen! :-)</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>E.B. hat f&uuml;r einige Hardwarefirmen die  Softwareentwicklung
     &uuml;bernommen. War das ganze unterm Strich, finanziell und von den
     Beziehungen zwischen den Gesch&auml;ftspartnern gesehen, erfolgreich?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD>Ja. Allerdings gab es auch einige R&uuml;ckschl&auml;ge, z.B. ist Gigatron
     in Konkurs gegangen, bevor alle Rechnungen f&uuml;r die Arriba bezahlt
     wurden. Das gleiche passierte mit bsc und dem CD1200plus. Davon
     abgesehen bin ich mit der Zusammenarbeit mit Hardwareherstellern
     sehr zufrieden.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Warum ist E.B. ganz von der Hardwareentwicklung abgesprungen?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Das hatte mehrere Gr&uuml;nde. Um professionell Hardware entwickeln und
     verkaufen zu k&ouml;nnen, muﬂ man einen erheblichen organisatorischen
     Aufwand betreiben und auch mehrere Mitarbeiter besch&auml;ftigen und
     dieses Risiko wollte ich nicht eingehen. Auﬂerdem kann ich nicht
     so gut Hardware entwickeln, wie Software.</P><P>
     Weiterhin macht es keinen Sinn als Hardwarehersteller Software f&uuml;r
     die eigene Konkurrenz zu schreiben, oder? Ich sehe es lieber, wenn
     meine Software zusammen mit der Hardware von vielen Herstellen
     verkauft wird. Egal wer das &quot;bessere&quot; Produkt hat - ich kann immer
     irgendwie partizipieren.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Welche Produkte waren/sind am erfolgreichsten? Was plant Ihr f&uuml;r
     die Zukunft.</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Am erfolgreichsten war IDE-fix '97. Der schlug ein wie eine Bombe.
     Sehr erfolgreich war nat&uuml;rlich auch der Oktagon, nur da hatte ich
     leider keine St&uuml;ckzahl-Lizenz :-)</P><P>
     Die Zukunft:<BR>
     Es wird einige Tools geben, die UAE aufwerten und vielleicht zu
     einer echten Alternative werden lassen, z.B. ein Tool, daﬂ die
     Amiga-Protection Bits/ Date/ FileComments auch auf WIN32-PCs
     abbilden kann, ein SCSI-Layer f&uuml;r UAE - dann k&ouml;nnen Produkte wie
     CacheCDFS oder Diavolo direkt die PC-Hardware benutzen, etc.</P><P>
     CloneCD f&uuml;r WIN32 & BeOS ist eine CD-Replikator-Software die JEDE
     CD kopiert, allerdings funktioniert es noch nicht so wie es soll.</P><P>
     In der &quot;Bier und Pizza&quot;-Phase sind Produkte wie &quot;VirtualCD&quot; und
     &quot;VirtualTape&quot; f&uuml;r WIN32 &amp; BeOS.</P><P>
     Wie Du siehst, gibt es keine &quot;reinen&quot; Amiga Produkte mehr, nur
     Produkte f&uuml;r andere Plattformen, sowie Amiga Produkte, die die
     Verbindung und Kommunikation zu anderen Plattformen erh&ouml;ht.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Speziell bei IDEfix gab es Probleme, da sich OEM-Hersteller nicht
     an die Lizenzbedingungen gehalten haben. Wie hast Du bzw. E.B.
     reagiert, sind rechtliche Schritte angedacht?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD>Die Staatsanwaltschaft ermittelt und es l&auml;uft auch ein Zivilprozess.
     Mehr kann ich dazu leider nicht sagen.</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie bist Du pers&ouml;nlich zum &quot;Computern&quot; gekommen? Mit welchen
     'Maschinen' hat es begonnen?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Mein erster Computer war ein Selbstbauprojekt der Zeitschrift
     &quot;Elektor&quot; - der &quot;Elektor TV Spielcomputer&quot;. Danach kam ein TI99-4/A,
     der aber keinen Spaﬂ machte. Dann ein Sinclair Spectrum, ein
     Sinclair QL, ein ATARI 800XL (zum Spielen), ein Osborne-I, ein
     Triumph-Adler PC8, ein Amiga 500 (zum Spielen), 1000, 2000, 4000,
     CD32, 1200. Irgendwann hatte ich auch mal einen Atari ST, doch der
     war im Vergleich zum Amiga langweilig.</P>
     <P>Im &quot;aktiven Dienst&quot; sind nur noch ein A4000/40 und (zum Testen) ein
     A1200 und A500 sowie diverse PCs.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie siehst Du die Entwicklung des Amiga-Marktes?  Sind die Maﬂnahmen
     der derzeitigen Amiga-Firmen richtig oder was w&uuml;rdest Du anders
     machen?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Der Markt ist so tod wie ein T&uuml;rnagel. Wenn Du mit &quot;derzeitige Amiga
     Firmen&quot; Amiga Inc. und Amiga Int., Inc. meinst, l&ouml;st Du bei mir schon
     fast einen Blutrausch aus. Amiga (ich lasse das &quot;Inc.&quot; und &quot;Int.&quot; mal
     weg) hat sich seit der mit Hoffnungen verbundenen &Uuml;bernahme durch
     Gateway nicht gerade durch professionelles Auftreten ausgezeichnet.
     Ein paar Beispiele gef&auml;llig?</P>

         <P>&quot;Die Entscheidung ist gefallen! Der PPC ist DEFINITIV der n&auml;chste
         Prozessor!&quot;</P><P>

        ... etwas sp&auml;ter ...</P><P>

         &quot;Der PPC ist definitiv NICHT der Prozessor der Zukunft, sondern
         der MMC (aber wir sagen nicht was es ist)&quot;</P><P>

        ... etwas sp&auml;ter ...</P><P>

         &quot;Es wird vielleicht nicht der MMC (und wir sagen immer noch
         nicht, was es ist - oder war?) sondern etwas anderes (aber was,
         sagen wir auch nicht)&quot;</P><P>

     Anderes Beispiel?</P><P>

         &quot;Es wird zur Computer 98 ein OS 3.5 geben!&quot;</P><P>

        ... etwas sp&auml;ter ...</P><P>

         &quot;OS 3.5 wurde eingestellt!&quot;</P><P>

        ... etwas sp&auml;ter ... </P><P>

         &quot;OS 3.5 kommt doch!&quot;</P><P>

        ... etwas sp&auml;ter wude dann Fleecy Moss entlassen, der die
            Entwicklung geleitet hat ... </P><P>

         &quot;OS3.5 wird von Haage & Partner entwickelt&quot;</P><P>

        ... bis jetzt ein Ger&uuml;cht - auf eine Stellungnahme von Amiga
            warten wir noch immer.</P><P>

     Irgendwann wurde vollmundig das OS5 (aber nicht f&uuml;r PPC) angek&uuml;ndigt.
     Allein diese Ank&uuml;ndigung war eine riesen Lachnummer. Ein Jahr sp&auml;ter
     die Zusammenarbeit mit QNX. Toll. Was hat Amiga in dem Jahr getan,
     auﬂer Musik-CDs und signierte Uhren zu verkaufen? Ein neues OS
     entwickelt? Ohne die Basis (QNX) zu kennen? Ja klar, und ich glaube
     auch an den Weihnachtsmann. Sie haben durch eine lausige Pressearbeit
     und Informationspolitik dem Amiga-Markt den Todesstoss gegeben.
     Danke!</P><P>

     Was bleibt? Der Amiga ist offensichtlich in den H&auml;nden von Leuten,
     die unprofessionell sind und Aussagen machen die dann revidiert
     werden, um dann nochmal revidiert zu werden. Das schafft kein
     Vertrauen, und gerade Amiga h&auml;tte das bitter n&ouml;tig. </P><P>

     Amiga ist eine junge Firma die NICHTS hat, auﬂer aufblasbaren Boing-
     B&auml;llen, Uhren, Musik-CDs und singenden Techno-Hupfdolls. Wenn Amiga
     schon jetzt ihre Versprechungen nicht h&auml;lt, ein Projekt startet,
     einstellt, startet, ... kann ich als Entwickler Zeit und Geld in
     diese Plattform investieren?</P><P>

     Die Antwort lautet ganz klar NEIN. Jemand, der sich als nicht
     vertrauensw&uuml;rdig gezeigt hat, dem vertraue ich nicht. Wenn OS5
     kommt, und WENN es Rechner daf&uuml;r gibt, und WENN es K&auml;ufer f&uuml;r
     diese Rechner gibt, dann erst werde ich mich damit besch&auml;ftigen.</P><P>

     Was w&uuml;rde ich anders machen?</P>

     <OL>
     <LI>Ein professionelles Auftreten</LI>
     <LI>Bessere Pressearbeit
     <LI>Vielleicht mal was entwickeln?
     </OL>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>H&auml;ltst Du die PPC-Entwicklungen f&uuml;r den Amiga f&uuml;r eine praktikable
     Alternative oder ger&auml;t man als User damit nicht zwangsl&auml;ufig auf's
     Abstellgleis, wenn sich der PPC nicht zus&auml;tzlich zu der von Amiga
     favorisierten L&ouml;sung durchsetzt?</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P> Bis heute weiﬂ niemand so genau, was denn nun die von &quot;Amiga
     favorisierte L&ouml;sung&quot; ist, geschweige denn ob/wann sie denn zu
     kaufen sein wird.</P><P>
     Ich pers&ouml;nlich w&uuml;rde auch nicht in einen PPC investieren, denn auch
     hier ist die Zukunft mehr als ungewiﬂ - was wir mit Amiga zu
     verdanken haben. Wegen dem hin- und her mit Amiga w&uuml;rde ich den
     Usern, die mehr Rechenleistung brauchen, einen Umstieg auf eine
     andere Rechnerplattform raten, den jetzigen Amiga danebenstellen
     oder UAE benutzen.</P><P>
     Ich weiﬂ, das will sicher keiner h&ouml;ren, aber leider kann ich mit
     gutem Gewissen keine andere Aussage f&auml;llen. Und wenn man das Risiko
     eingehen will, OS5 zu verwenden - warum nicht schon jetzt BeOS (auch
     ein &quot;Multimedia-OS&quot;)?</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Warst Du auf der Computer 98 und wenn ja, was hattest Du f&uuml;r
     einen Eindruck von der Messe?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Ich war nicht da, und ich glaube, ich habe auch nichts verpaﬂt.</P>
     /SARKASMUS ON
     Die Fotos von dem Amiga-Messestand waren sehr sch&ouml;n. Besonders haben
     mir die vielen aufblasbaren Boing-B&auml;lle gefallen. Auch die Annex-
     Hupfdolls waren sehr nett.
     /SARKASMUS OFF</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was machst Du sonst so - auch privat? Was sind Deine Hobbys abseits des Computers?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
    <TD><P>Gibt es etwas anderes als Computer? Ja, meine Familie! Meine Tochter
     ist gerade neun Monate alt geworden und mein sch&ouml;nstes Hobby - und
     sie h&auml;lt mich erfolgreich davon ab, ins Kino, in Cafes und auf
     Konzerte zu gehen (was mal ein groﬂes Hobby von mir war).<P></P>
     Vielleicht meldet sich jemand freiwillig zum Babysitten, damit ich
     mir mit meiner Frau zusammen den neuen Star Trek Film anschauen kann?</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wohin m&uuml;ﬂte man denn zum Babysitten kommen? </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
	<TD>Nach Lochhofen. Das kennt nat&uuml;rlich keiner. Lochhofen ist etwa 4 km
     s&uuml;dlich von Sauerlach. Und da Sauerlach vermutlich auch kaum jemand
     kennt - Sauerlach ist ca. 30 km s&uuml;dlich von M&uuml;nchen. Und wenn jemand
     M&uuml;nchen nicht kennt - naja, dem kann ich nicht helfen.

     (Die genaue Adresse ist auf meiner Homepage
     <A HREF="http://www.elaborate-bytes.com">http://www.elaborate-bytes.com</A>)
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Dein wievieltes Interview war dies eigentlich und die unvermeidliche
     Standardfrage: Kanntest Du den AmZeiger vor meiner Kontaktaufnahme
     und wie findest Du ihn?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
	<TD>Mein viertes (es war mein zweites E-Mail-Interview). Ja, den Amiga
     Zeiger kannte ich schon vorher, aber ehrlich gesagt nur deshalb,
     weil ihr einen IDE-fix '97 Test gemacht habt. Der Test war &uuml;brigens
     sehr gut und ihr habt v&ouml;llig Recht - die Dokumentation ist
     tats&auml;chlich nicht so toll. :-)
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>(Wir heiﬂen &uuml;brigens wirklich AmZeiger, auch wenn man es so
     interpretieren kann :) Danke f&uuml;r das Interview.
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>OK:</TH>
	<TD>Es war mir ein Vergn&uuml;gen!</TD>
</TR>
</TABLE>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9812wf7.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
