<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A> <A HREF="#Sonstiges">Sonstiges</A></P>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Auf der Computer 98-Messe in K&ouml;ln gab <A HREF="http://www.amiga.de">Amiga</A> den Partner f&uuml;r das zuk&uuml;nftige
OS des sogenannten &quot;NG-Amiga`s&quot; bekannt. Es handelt sich um die Firma <A HREF="http://www.qnx.com">QNX
Software Systems Ltd.</A>. Ihr Echtzeitbetriebssystem <B>RTOS</B> (RealTime Operating
System) wird als Kern des neuen OS dienen.</P>

<P>Nat&uuml;rlich sollen alle m&ouml;glichen Standards unterst&uuml;tzt, alle m&ouml;glichen
Features geboten werden. Bei den Informationen handelt es sich bisher
aber lediglich um Allgemeinpl&auml;tze. Das neue OS ist nicht mehr kompatibel
zu alten Amiga-OS-Versionen.</P>

<HR WIDTH="50%">

<P>Auf der Messe gab Petro Tyschtschenko von Amiga Int. bekannt, da&szlig; nun
das Okay des Konkursverwalters Hembach vorl&auml;ge, um die Teile des amerik.
Herstellers Quikpak zum Bau von neuen <B>A4000T</B>`s zu verwenden, was nun
in K&uuml;rze auch geschehen w&uuml;rde.</P>

<HR WIDTH="50%">
<P> Neben <A HREF="http://www.amigaos.de">amigaOS</A> ist mit <A HREF="http://www.amigafever.com">AmigaFever</A> ein weiterer Newcomer im
Zeitschriftensektor auf der Computer 98 erh&auml;ltlich gewesen. Wegen
Vertriebsproblemen ist die &quot;amigaOS&quot; aber erst ab Januar im normalen
Handel erh&auml;ltlich, w&auml;hrend die &quot;AmigaFever&quot; bereits im Dezember
k&auml;uflich zu erwerben war.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>
<P><B>DOpus Magellan II</B> ist erschienen. Zahlreiche Erweiterungen und
Verbesserungen soll der Workbench-Ersatz bieten - s. dazu unseren
<A HREF="../sw/9812do.htm">Test</A> in dieser Ausgabe. Auf einer zus&auml;tzlich erh&auml;ltlichen
<B>Plus-CD</B> sind neben weiteren Anleitungen und Tutorials u.a. Windows-
Desktop-Themes enthalten, die nach einer Konvertierung jetzt auch unter
DOpus eingesetzt werden k&ouml;nnen.</P>

<HR WIDTH="25%">

<P><A HREF="http://www.vgr.com">CyberGraphX</A> in der <B>Version 4</B> bietet f&uuml;r einen Preis von 49,- DM (Update
29,- DM) neben der Funktionalit&auml;t der vorherigen Versionen u.a. ein
verbessertes Speicher-Management, ein erweitertes CGXMode-Programm,
das nun z.B. auch VESA-Modi unterst&uuml;tzt, ein Commodity und direkte
Unterst&uuml;tzung der V43-picture.datatypes.</P>
<HR WIDTH="25%">
<P><B>Amiga Envoy V3</B> wurde als Netzwerksoftware speziell f&uuml;r den Amiga
entwickelt. Neben hoher Leistungsf&auml;higkeit soll vor allem die
Benutzeroberfl&auml;che einfach benutz- und konfigurierbar sein. Wenn
Einstellungen ver&auml;ndert wurden ist kein Neustart erforderlich. Im Preis
von 69,- DM (Update 59,- DM) ist allerdings nur eine Nutzungslizenz f&uuml;r
zwei verbundene Amigas enthalten, f&uuml;r mehr mu&szlig; zus&auml;tzlich gezahlt werden.
Voraussetzung OS2.04+, 1MB RAM und Netzwerkhardware die SANA-II entspricht.</P>
<HR WIDTH="25%">
<P>Zum Preis von 39,- DM bietet <A HREF="http://www.schatztruhe.de">Schatztruhe</A> eine <B>Linux5.1-CD</B> feil. Dabei
handelt es sich um die &quot;unoffizielle RedHat 5.1-Version&quot;, die von
Jes Sorensen portiert wurde. Englischkenntnisse sind zwingend
erforderlich.</P>
<HR WIDTH="25%">
<P>Das bekannte SuperView-Bildbearbeitungs-, Anzeige- und Grafikformat-
Konvertierprogramm ist in seiner Version II als &quot;<B>Superview Productivity
Suit</B>&quot; inklusive der PPC-Module und optimierter Datatypes f&uuml;r einen Preis
von 59,- DM bei Schatztruhe erh&auml;ltlich.</P>
<HR WIDTH="25%">
<P>Das Speicherschutzsystem &quot;<B>Amiga Bodyguard</B>&quot; ist wegen technischer Probleme
offiziell auf Eis gelegt. Der Autor Martin Bernd arbeitet aber weiter, um
vielleicht doch noch zu einem befriedigenden Ergebnis zu kommen.</P>
<HR WIDTH="25%">
<P>Das <B>Aminet Set 7</B> bietet f&uuml;r 59,- DM fast 4 Gigabyte Software, davon
sind &uuml;ber 400 MByte neuer als die Aminet 27. Als Vollversionen sind
IBrowse 1.2 SE, XiPaint 4.0, KangFu SE und Picture Manager 4 SE
enthalten.</P>

<A HREF="http://www.schatztruhe.de">http://www.schatztruhe.de</A>

<HR WIDTH="50%">
<P><B>Cloanto</B> bringt die <A HREF="http://cloanto.com/amiga/forever/online.html/">Amiga Forever-Online Edition</A> heraus. Somit k&ouml;nnen
zu einem g&uuml;nstigeren Preis die wichtigsten Teile der Amiga Forever-CD,
wie z.B. die OS-ROMs, aus dem Internet gezogen werden. Ab 1999 betr&auml;gt
der Spezialpreis 19,99 US-Dollar.</P>
<HR WIDTH="50%">
<P>Die <A HREF="http://online-club.de/~ARENA/">Amiga Arena</A>, eine Website, bietet spezielle Shareware-Programme
zeitlich begrenzt zu Sonderpreisen an, die in ihr auch zu bestellen
sind. GeoWorld, CyberShow, FIASCO und PrintManager sind nur einige
der Angebote. Kaufinteressierte sollten hier &ouml;fter mal vorbeischauen.</P>

<HR WIDTH="50%">
<P>Ende Januar 1999 soll <B>ArtEffect 3.0</B> erscheinen.</P>

<P>Von <B>FontMachine</B> kann auf der <A HREF="http://www.haage-partner.de">H&amp;P-Website</A> ein Update auf die Version
3.20 heruntergeladen werden.</P>
<HR WIDTH="25%">

<P>Mit <B>Warp3D</B> will H&P ein Treibersystem f&uuml;r 3D-Hardware &auml;hnlich Picasso96
oder CyberGraphX schaffen (mit denen es jeweils funktioniert), das den
Usern kostenlos zur Verf&uuml;gung gestellt werden soll. Es wird eine 68k und
eine PPC-Implementation geben.</P>

<HR WIDTH="50%">
<P>Die Firma <A HREF="http://www.softpartners.com/">SoftPartners</A> hat von Softwood die Rechte an den Final-
Produkten erworben, an denen die Weiterentwicklung eingestellt wurde.
Sie beabsichtigen ein Office-Paket (<B>Final Office 1.0</B>) herauszubringen, das
neben Final Writer 97, Final Copy, Final Calc und Final Data enthalten und
bei Verkaufserfolg eine Weiterentwicklung erm&ouml;glichen soll.</P>

<HR WIDTH="50%">
<P> <A HREF="http://www.xipaint.co.at">XiPaint 3.2</A> ist auf der Homepage kostenlos erh&auml;ltlich, da bald die neue
<B>Version 4.1</B> u.a. mit Datenbank- und Lasso-Grab-Funktionen erh&auml;ltlich sein
soll.</P>
<HR WIDTH="50%">
<P><A HREF="http://software.freepages.de/iss/">I.S.S.</A> gibt <B>AmiAtlas 5</B> heraus. Der Routenplaner und St&auml;dtef&uuml;hrer, der
mit Hotel- und Freizeitparkf&uuml;hrer kombiniert ist, erscheint auf CD.</P>

<HR WIDTH="50%">
<P><A HREF="http://www.vapor.com/amirc/">AmIRC 2.2</A> ist erschienen. Eine Menge neuer Features und Bugfixes sind in
diese Version eingegangen.</P>

<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>

<P>F&uuml;r das <B>CDTV</B> gibt es von der Amiga of Minnesota Interest Groups Alliance
(A.M.I.G.A.) zwei selbstentwickelte PROMS, die, in Verbindung mit dem
original 3.1-ROM-Chip (500/2000er Version), das CDTV zu einem normalen
Amiga mit CD-ROM machen. Gebootet kann per CD oder Diskette vom Floppy-
Laufwerk. Diese L&ouml;sung wurde exklusiv von Amiga Int. lizensiert.</P>

<P>Wer Interesse hat, bitte bei folgender eMail-Adresse melden:
thedoctor@wavetech.net; oder per Post bei: A.M.I.G.A.,
c/o Ben Deemer, 14501 Sunfish Lake Blvd., Ramsey, MN., U.S.A. 55303-4578 </P>
<HR WIDTH="50%">
<P><A HREF="http://www.villagetronic.com/amiga/">Village Tronic</A> hatten auf ihrer Website eine Umfrage gestartet, ob bei
den Amiga-Usern Bedarf f&uuml;r eine <B>Voodoo 3DFX-AddOn-Karte</B> zur PicassoIV-
Grafikkarte besteht. Nun haben sie bekanntgegeben, da&szlig; die Beteiligung
gut war und mit 520 Vorbestellungen die Entscheidung daf&uuml;r feststeht.
Da nur eine begrentze Anzahl zum Preis von 299,- DM produziert werden,
k&ouml;nnen weitere Vorbestellungen abgegeben werden.  </P>

eMail: <A HREF="mailto:amigasupport@village.de">amigasupport@village.de</A><br>
Betreff: 3dfx_order
<HR WIDTH="50%">
<P>Die <A HREF="http://www.ateo-concepts.com">AteoBus</A>-Extension-Boards sind nun erh&auml;ltlich.</P>

<P>Dabei handelt es sich um:</P>

<UL>
<LI>AteoPar I : 1 x ECP Parallel-Port</LI>
<LI>AteoSer I : 1 x RS232C Seriell (bis zu 462KB)</LI>
<LI>AteoSer II: 2 x RS232C Seriell (bis zu 462KB)</LI>
<LI>AteoSer II mini: 2 x RS232C Seriell (bis zu 462KB) mit 9 Pin-Anschl&uuml;ssen</LI>
<LI>AteoIO I: 1 x ECP Parallelport und 2 x RS232C Ser.Port (bis zu 462KB)</LI>
</UL>

<P>Weitherhin wird weiterhin an einer Ethernet-Karte, einer Soundkarte,
einem Pixel 64 Scandoubler- und TV-Modul gearbeitet.</P>

<HR WIDTH="50%">
<P><B>A.C.T.</B> produziert mit der <B>PRELUDE1200</B> eine hochwertige Soundkarte,
die zu ihrem Zorro-II-Schwesternmodell zu 95% hard- und zu 100%
softwarekompatibel ist. Sie belegt den Uhren-Steckplatz und den
Einschub unter dem Diskettenlaufwerk.</P>

<HR WIDTH="50%">
<P> <B>ESCENA</B> will mit dem Projekt &quot;<B>Brainstormer</B>&quot; G3-PPC-Karten f&uuml;r den
(Zorro-)Amiga entwickeln. Prototypen existieren bereits, Hardware-
Partner wird DCE und Software-Partner Haage und Partner sein.</P>

<P>Erste Endversionen sollen ab dem Ende des ersten Quartals 99
erh&auml;ltlich sein, zu einem anvisierten Preis von 748,- DM ohne
Speicher und Prozessormodul.</P>
<HR WIDTH="50%">
<P><A HREF="mailto:katodev@usa.net">Kato Development</A> plant mit <B>Twister 1200</B> eine neue serielle Schnittstellen-
Karte f&uuml;r den Amiga 1200, der mit der Melody 1200 kombinierbar ist und
300 bis 460.800 Bps, sowie u.a. 2x32 Byte Puffer bietet.</P>

<HR WIDTH="50%">
<P>Und noch eine Soundkarte f&uuml;r den 1200er Uhrenport ist angek&uuml;ndigt: Die
<B>Delfina 1200</B>, basierend auf der bekannten Zorro-II-Karte Delfina Light,
soll zu einem vorgesehenen Preis von 299 US-Dollar eine hochwertige
Verarbeitung und einen 37 MHz-Motorolla DSP 56002 f&uuml;r Echtzeiteffekte
bieten.</P>

<A HREF="http://www.sci.fi/~petsoff/">http://www.sci.fi/~petsoff/</A>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
<P><A HREF="http://www.vulcan.co.uk">Vulcan</A>, einer der verbliebenen gr&ouml;&szlig;eren Amiga-Spiele-Produzenten, gab
bekannt, die Amiga-Spieleentwicklung einzustellen, da sie sich finanziell
nicht mehr trage. Eine Distribution von Spielen externer Entwickler w&auml;re
weiter denkbar.</P>

<P>Die CD-ROM-Spiele &quot;<B>Wasted Dreams</B>&quot; und &quot;<B>Explorer 2260</B>&quot; sollen trotzdem
erscheinen.</P>

<HR WIDTH="50%">

<P>Die (angeblich) erotische Wirtschaftssimulation &quot;Wet&quot; ist von
<A HREF="http://www.newgsoft.com">New
Generation Software</A> zum Preis von 79,- DM erh&auml;ltlich. Es l&auml;uft ab 020,
2 MB Chip- und 8 MB FastRAM, sowie 40 MB Festplattenspeicher, 8fach
CD-ROM und OS 3.0.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.clickboom.com">clickBOOM!</A> verzichtet auf die PPC-Umsetzung von <B>Quake</B>. Grund sollen die
existierenden Umsetzungen im Aminet sein.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.titancomputer.de">Titan Computer</A> will &quot;<B>Siedler II</B>&quot; auf den Amiga umsetzen. Nach eigenen
Angaben haben sie ein Lizenzabkommen mit Blue Byte abgeschlossen.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Sonstiges">Sonstiges</A></H2>
<P><A HREF="http://www.nordicglobal.com">Nordic Global</A>, Produzent u.a. von Miami, hat dar&uuml;ber informiert, das
eine Liste mit &uuml;ber 700 gestohlenen Pa&szlig;w&ouml;rtern in der &quot;Szene&quot; und
verschiedenen Orten, wie dem Usenet, gepostet wurde, mit denen es
m&ouml;glich ist, unter fremden Accounts sein Unwesen zu treiben. Neben
PC-Usern sind auch viele Amiga-Benutzer betroffen.</P>

<P>Grund daf&uuml;r ist, laut Nordic Global, kein Fehler in Miami, wie es
b&ouml;swillig von Crackergruppen verbreitet worden ist, sondern ein
<B>Trojanisches Pferd</B>, das, als normale <B>datatypes.library</B> getarnt,
die erforderlichen Angaben auf der Festplatte ersp&auml;ht und &uuml;ber das
Internet versendet hat. Selbst mit z.B. SnoopDos sind die Aktivit&auml;ten
nicht erkennbar, da es am System &quot;vorbeiprogrammiert&quot; wurde.</P>

<P>Diese &quot;datatypes.library&quot; identifiziert sich, je nach Art und Weise
des &Uuml;berpr&uuml;fens, als Version 45.4 oder 45.5 und hat eine Filegr&ouml;&szlig;e
von 32.748 Bytes. Sie sollten sie l&ouml;schen und eine der folgenden
installieren:</P>

<UL>
<LI>39.11 oder 40.6 von den Workbench-Disketten.</LI>
<LI>45.3 oder 45.4 aus dem Aminet, wobei letztere eine Gr&ouml;&szlig;e von
27.780 Bytes aufweisen mu&szlig;.</LI>
</UL>

<P>Schalten Sie den Computer danach f&uuml;r eine halbe Minute aus und
&auml;ndern Sie so schnell wie m&ouml;glich das Pa&szlig;wort bei Ihrem Provider.</P>

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="intern.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
