<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Fr. Gisela's Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<TABLE BORDER=0 WIDTH="100%">
<TR>
<TD><H1>Frau Gisela`s Problemecke</H1></TD><TD ALIGN="RIGHT"><IMAGE SRC="../images/frg.gif"></TD>
</TR></TABLE>

<P><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.
</P><HR>
<B>Drei wichtige Anmerkungen:</B>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR><PRE>
Zuerst eine Frage von <A HREF="mailto:wolfbonk@cityweb.de">Wolfgang Bonk</A> (wolfbonk@cityweb.de)zu <B>AmiTCP</B>:

WB&gt; Ich h&auml;tte da mal eine Frage bzgl. AmiTCP. Gibt es eine
WB&gt; deutschsprachige Anleitung f&uuml;r AmiTCP, zwecks Gebrauch und
WB&gt; Installation und wenn ja, wo kann man sie bekommen?</PRE>

<P>Wenn jemand Antwort weiﬂ, dann bitte Antwort direkt an Wolfgang oder
an uns. Wir leiten sie dann weiter.</P>

<HR>

<a href="mailto:t.heinrich@t-online.de">Thomas Heinrich</a> gibt nun Praxistips zum Umgang mit ZIP-Laufwerken
am Amiga:

                       <P><H3><B>Tips zum ZIP-Laufwerk</B></H3></P>

<P>SCSI-ZIP-Laufwerke sind auch unter Amiga-Usern recht beliebt, doch fr&uuml;her
oder sp&auml;ter stellt sich ein Partitions-Chaos ein. Dummerweise sind die
Medien nur Mac- oder PC-formatiert, so daﬂ man sie auf dem Amiga mittels
HDToolBox neu einrichten muﬂ.</P>

<P>Wer nun statt dessen SCSIConfig von Phase5 benutzt, wird feststellen
m&uuml;ssen, daﬂ es ganz andere Werte eintr&auml;gt, als HDToolBox und somit jedes
ZIP-Medium als neues Laufwerk gemounted wird. Schlimmer noch, die neueste
Version von SCSIConfig versucht, die ZIP-Medien m&ouml;glicht effektiv zu
beschreiben (nur 3 Bl&ouml;cke ungenutzt) und unterscheidet sich dadurch von
den vorherigen Versionen.</P>

<P>Die Werte, die dabei herauskommen, sind etwas eigensinnig; so wird z.B.
ein Zylinder mit 257 Bl&ouml;cken angelegt, was 128,5 KByte entspricht. Da
der erste Zylinder f&uuml;r den (einen!) RigidDiskBlock reserviert wird, hat
man einen Verlust von 128 KByte auf dem Medium. Wenn man ein anderes
Filesystem als das FastFileSystem benutzt, kann der Platz dazu genutzt
werden, eben dieses Filesystem in den RDB zu schreiben, z.B. wenn man
SmartFileSystem verwenden will. Trotzdem sind dann noch knapp 80 KByte
ungenutzt. </P>

<P>Was kann man tun? Zuerst sollte man eine vern&uuml;nftige Geometrie aust&uuml;fteln.
Ich benutze die Werte &quot;Cylinder: 3171&quot;, &quot;Heads: 2&quot; und &quot;Blocks per Track:
31&quot;. Damit l&auml;ﬂt man zwar 5 Bl&ouml;cke (2,5 KByte) des Mediums ungenutzt, liegt
aber immer noch besser als HDToolBox, das nochmals 14 Bl&ouml;cke mehr ungenutzt
l&auml;ﬂt. HDToolBox besteht auﬂerdem darauf, ZWEI Zylinder am Anfang des
Mediums zu reservieren, verschenkt also noch mehr Platz.</P>

<P>Die Variante mit 2 K&ouml;pfen liegt auﬂerdem n&auml;her an der physikalischen
Wahrheit, da ein ZIP-Laufwerk die Medien beidseitig beschreibt.</P>

<P>Hat man also die Geometrie eingestellt, steht man vor dem Problem, alle
ZIP-Medien identisch einzurichten. Das heiﬂt jedoch, man muﬂ die Daten von
bereits benutzten Medien irgendwo sichern, denn sie gehen beim &Auml;ndern der
Geometrie, bzw. beim danach n&ouml;tigen Formatieren verloren.</P>

<P>Benutzt man SCSIConfig, kann man nach der Sicherung ein Medium wie
gew&uuml;nscht einstellen, am besten gleich mit einer Partition &uuml;ber das
gesamte Medium, und mittels &quot;Save Changes&quot; speichern. Dann entfernt man
einfach die ZIP-Disk und legt eine neue ein, ohne SCSIConfig zu verlassen.
Jetzt kann man wieder &quot;Save Changes&quot; anw&auml;hlen und damit ganz einfach und
komfortabel einen ganzen Satz Medien auf den gleichen Nenner bringen.</P>

<P>Ganz wichtig: Vergewissern Sie sich ganz genau und am besten mehrmals,
daﬂ Sie auch das ZIP-Laufwerk angew&auml;hlt haben, sonst zerpfl&uuml;cken Sie
wom&ouml;glich Ihre Festplatte!</P>

<P>Nach einem Neustart kann man die Medien dann formatieren und benutzen,
ohne daﬂ jede ZIP-Disk eine eigene Laufwerksbezeichnung erh&auml;lt.</P>

<P>Sie k&ouml;nnen sich die Geometrie- und Partitionseinstellungen notieren und
alle ZIP-Medien vor der ersten Benutzung so einrichten. Damit ersparen
Sie sich viel &Auml;rger und behalten die &Uuml;bersicht.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../mmx/9812stor.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
