<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>A 1 2 0 0 : s t a &nbsp; A 3 0 0 0 : e e n</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teemu Pohjanlehto &lt;<a href="mailto:rebb@amigascne.org">rebb@amigascne.org</a>&gt;</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Olin jo pitk&auml;&auml;n suunnitellut A1200:sta luopumista, sen laajentaminen kun on sen verran kallista puuhaa, etteiv&auml;t omat rahavarani riitt&auml;neet edes tornin hankkimiseen, saati v&auml;yl&auml;korttiin. Olihan mieless&auml; py&ouml;rinyt jo pitk&auml;&auml;n oma tornitusprojekti, jonka esteeksi muodostui l&auml;hinn&auml; n&auml;ppisadapteri, sit&auml; kun ei tahdo koto-Suomesta l&ouml;yt&auml;&auml; j&auml;rkev&auml;&auml;n hintaan. Halvin l&ouml;yt&auml;m&auml;ni maksoi 290 mk, Englannista olisi vastaavan saanut 140 markalla. Kun en saanut s&auml;hk&ouml;postitse l&auml;hett&auml;m&auml;&auml;ni tiedusteluun mink&auml;&auml;nlaista vastausta, luovutin.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Haaveena desktop</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Homma unohtui muutamaksi viikoksi, kunnes selailin er&auml;st&auml; ilmoituslehte&auml;. Totesin A4000:n hinnan houkuttelevaksi mutta himpun verran liian korkeaksi. Olin asettanut itselleni tavoitteeksi olla kuluttamatta ylim&auml;&auml;r&auml;ist&auml; rahaa koneen vaihtoon, joten homman pit&auml;isi toimia vaihtoperiaatteella: sill&auml; rahalla, jonka A1200:sta saan, pit&auml;&auml; saada desktop-Amiga. P&auml;&auml;dyin A3000:een tai viriteltyyn A2000:een. Vakio-A2000:ta tuntui olevan mukavasti liikenteess&auml;, turboja yms. taas ei. A3000:ta taas n&auml;kyi tosi harvoin.<br>
					<br>
					Er&auml;&auml;ss&auml; lehdess&auml; oli kuitenkin myynniss&auml; A3000 (68030/25 MHz, 1,2 Gt, 2 Mt Chip, 1 Mt Fast), jolla hintaa oli kohtuulliset 1500 mk. Harmikseni en mitenk&auml;&auml;n olisi onnistunut saamaan A1200:stani (68030, KS 3.0, 120 Mt HD, 8 Mt Fast) vastaavaa summaa, joten j&auml;in harmittelemaan asiaa. Muutaman viikon kuluttua l&ouml;ytyi toinen ehdokas, vastaavanlainen kokoonpano ilman kiintolevy&auml; hintaan 850 mk. "Sikahalpa", ajattelin ja tilasin koneen sen kummempia ihmettelem&auml;tt&auml;. Mielt&auml; kuitenkin painoi ajatus: ent&auml; jos en saakaan myyty&auml; konettani ajoissa? Pieni neuvottelu "hallituksen" kanssa auttoi, ja pikalaina j&auml;rjestyi.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Pakettia auki</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Omasta mielest&auml;ni pitk&auml;n ajan kuluttua (melkein viikko, itsen&auml;isyysp&auml;iv&auml; sotki postin kulkua) kilahti postiluukusta pakettikortti, jonka tulon olinkin mukavan intuitiivisesti arvannut ja poikennut ruokatunnilla kotiin. Videokoteloon pakattu Amiga oli j&auml;m&auml;k&auml;n painoinen, ja voin sanoa tunteneeni koneen voiman k&auml;siss&auml;ni - ainakin k&auml;velty&auml;ni kilometrin tai pari kone kainalossa. Kone oli pakattu trendikk&auml;&auml;sti mustaan j&auml;tes&auml;kkiin. Onneksi koneen omistaja oli ollut sen verran viitseli&auml;s, ett&auml; oli suojannut kaikki ulkoiset liittimet pahvilla, joten kone oli kuin pakasta rep&auml;isty.<br>
					<br>
					Heti ensimm&auml;iseksi tuli mieleen, ett&auml; koneessa on VGA-liitin ja minulla vain videomonitori... Onneksi &auml;lysin katsoa koneen taakse, ja l&ouml;ytyih&auml;n sielt&auml; my&ouml;s RGB-liitin. (Taas t&auml;t&auml; puskaradiotietoa!) Eih&auml;n monitorini mik&auml;&auml;n loistava ole, mutta eip&auml; tarvitse kiinnitt&auml;&auml; rahaakaan. Monitori saa luvan ajaa asiansa, kunnes budjettini tasapainottuu ja saan ensin muut koneen osat ajan tasalle.<br>
					<br>
					Koneessa ei siis ollut kiintolevy&auml;, joten tein vain pikaisen testauksen, ett&auml; kone yleens&auml; her&auml;&auml; henkiin. Sitten ruuvimeisseli k&auml;teen ja kone p&auml;reiksi. Muutaman kirosanan ja ahaa-el&auml;myksen j&auml;lkeen kone oli auki, laiteteline irti, emolevy kokonaan n&auml;kyviss&auml; ja uudet SCSI-levyt ruuvattu kiinni - kuvaannollisesti, koneessa kun ei ollut asennuskelkkoja, eik&auml; kiinnitys muuten onnistu. Onnistuin saamaan kaksi SCSI-levy&auml; ilmaiseksi, toinen oli liian pieni (80 Mt) ja toisesta oli mennyt 0-ura rikki. Ajattelin, ett&auml; ainakin 80-megaisen saan toimimaan, mutta yll&auml;tyin, kun 1,2 Gt Seagate hurahti toimintaan kertaheitolla, HDToolBox kun antaa vaihtaa levyn aloituskohtaa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Konetta laajentamaan</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Koneen vaihdon huonoja puolia olivat sek&auml; uuden koneen tehottomuus ett&auml; v&auml;h&auml;inen muistim&auml;&auml;r&auml;kin, joten mieless&auml; k&auml;v&auml;isi ajatus turbosta ja lis&auml;muistista. Katsaus koneen sisuksiin osoitti ik&auml;v&auml;n tosiasian: Fast-muistia saa vain ZIP-kannoille ja vain megan verran DIP-kannoille. Pieni tutkimus osoitti, ett&auml; ZIP-muistia on todella vaikea l&ouml;yt&auml;&auml; ja se on &auml;&auml;rimm&auml;isen kallista, noin 190 mk per megatavu. Onpa Gentle Eyen Boogie joutunut aikanaan maksamaan muisteista 390 mk megalta. Boogie kyll&auml; tarjosi nelj&auml;&auml; megaa 600 markalla, joten olisi siin&auml; hiukan s&auml;&auml;st&auml;nyt, mutta ik&auml;v&auml; kyll&auml; budjettini ei antanut my&ouml;ten moiseen sijoitukseen. P&auml;&auml;tin odotella.<br>
					<br>
					Samasta lehdest&auml; l&ouml;ysin ilmoituksen A2000:n 4 Mt:n muistikortista hintaan 200 mk, joten luuri k&auml;teen ja soittoa ilmoille. Kyselin mahdollisesta sopivuudesta A3000:een, ja kaveri ilmoitti kortin sopivan ja kyseli viel&auml;, koska olin koneeni ostanut ja mist&auml; p&auml;in. Selvisi, ett&auml; kyseess&auml; oli sama myyj&auml; ja ett&auml; kortti oli ollut juuri t&auml;ss&auml; koneessa kiinni, joten kaupat tehtiin heti. Olisipa myynniss&auml; ollut viel&auml; Picasso IV, Delfina Lite, CyberVision, GVP:n 040-turbo ynn&auml; muuta mukavaa. Rahatilanteeni pakottamana jouduin harmikseni kielt&auml;ytym&auml;&auml;n tarjouksista. Ehk&auml; saan viel&auml; jostain kasattua lis&auml;&auml; rahaa. GVP:n hinnaksi olisi tullut 600 mk, joka on mielest&auml;ni kohtuullinen. Itselleni kyll&auml; riitt&auml;isi aluksi 030/50 MHz, joten jos jollakin on sellaista tarjota sopivaan rahaan, niin minulle kyll&auml; kelpaa!
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Display enhancer testiin</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Kun koneessa nyt sattuu olemaan sis&auml;inen scan doubler ja flicker fixer, niin pitih&auml;n niit&auml;kin p&auml;&auml;st&auml; kokeilemaan, joten aamulla kone isoon laukkuun ja mukaan t&ouml;ihin. P&ouml;yd&auml;ll&auml;ni lojui juuri mukavasti 17" Sonyn putki, joten johdot kiinni ja menoksi. Ruutu pysyi itsepintaisesti mustana. "Ahaa, koneen takana oleva ihmekytkin on siis varmaan t&auml;t&auml; varten." Nyt toimi hienosti, ja kuva ilmestyi ihmetyksekseni ruutuun. Palikkamaiseltahan se n&auml;ytti, joten n&auml;ytt&ouml;tilaa s&auml;&auml;t&auml;m&auml;&auml;n. Totta kai Monitors-hakemistossa oli vain PAL, joten p&auml;&auml;sin testaamaan vain normaalit PAL Laced -tilat, mutta kyll&auml; 640x512 oli riitt&auml;v&auml;n n&auml;ytt&auml;v&auml; videomonitorin kanssa el&auml;neelle Amigistille.<br>
					<br>
					A3000:n flicker fixer on yll&auml;tt&auml;v&auml;n hyv&auml;. Pient&auml; raidoitusta ilmenee ainoastaan Workbenchin valikoiden kanssa, ikkunoiden skaalauksen ja siirron aikana kuva ei v&auml;r&auml;hd&auml;k&auml;&auml;n. V&auml;rej&auml; on tietysti olemattoman v&auml;h&auml;n, mutta pit&auml;&auml; muistaa, ett&auml; kone on julkistettu vuonna 1990 ja piirit ovat vuosilta 1989 tai vanhempia, joten ei t&auml;m&auml; mik&auml;&auml;n n&auml;ytt&ouml;kortin korvaajaksi tarkoitettu toiminne olekaan. Monitorivalinta on ehdottomasti SVGA-putki, kuvanlaatua ei voi edes vertailla samana p&auml;iv&auml;n&auml;k&auml;&auml;n videomonitorin kanssa. Itsell&auml;ni kun on krooninen rahapula, niin tyydyn wanhaan 1084S-videomonitoriin ainakin toistaiseksi.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>N&auml;it&auml; kaivattaisiin</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Jos jollakin sattuu olemaan koneeseen manuaalit tai muuta s&auml;l&auml;&auml;, vaikka vain valokopiot, niin olisin niist&auml; kiitollinen. Kiinnostusta olisi my&ouml;s Bridgeboard-korttiin, omani kun meni siivousintoisen silloisen perheenj&auml;senen matkassa kaatopaikalle. Ja jos jollakin on oman A3000:n kanssa ongelmia, niin olen valmis auttamaan niiss&auml; asioissa joissa vain voin. S&auml;hk&ouml;postiosoitteeni on t&auml;m&auml;n artikkelin lopussa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Yhteenveto</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Olen uuteen koneeseeni enemm&auml;n kuin tyytyv&auml;inen. Irton&auml;ppis on todella mukava (vaikkakin A2000:n), kiintolevytilaa on riitt&auml;v&auml;sti, laajennustila ei helposti lopu kesken, SCSI-levyj&auml; ja muuta tilpeh&ouml;&ouml;ri&auml; saa kiinni viel&auml; viiden laitteen verran ja Zorro III -laajennuspaikat ovat hyv&auml; lis&auml;, ne kun maksavat A1200:aan aika kivasti.<br>
					<br>
					Huonojakin puolia on: Kotelossa ei ole 5,25" laajennuspaikkoja yht&auml;&auml;n, mik&auml; tarkoittaa esim. ulkoista CD-asemaa. Muistin lis&auml;ys on kallista (ellei tyydy A2000:n muistikortteihin, jotka ovat hitaampia, mutta haitanneeko tuo k&auml;yt&auml;nn&ouml;ss&auml; mit&auml;&auml;n, j&auml;&auml; n&auml;ht&auml;v&auml;ksi!) ja esim. A4000:n prosessorikorttien ja ilmeisesti 040-korttien sopivuus yleens&auml; on ihan tuurista kiinni. Omani pit&auml;isi olla t&auml;t&auml; sopivaa mallia, koska GVP:n 040 kuulemma on toiminut ongelmitta. Kannattaa kysy&auml; t&auml;t&auml;kin, jos on ostamassa itselleen A3000:a.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

