<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>A m i g a &nbsp; D e v e l o p e r &nbsp; C D &nbsp; 2 . 1</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">"Tohtori AivoTurmio"</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				Amiga Developer CD on Amiga-yhti&ouml;n julkaisema CD, jossa on kaikkea tarpeellista Amigalle ohjelmia tuottaville (developer). Uusi Amiga Developer CD 2.1 on julkaistu juuri nyt todenn&auml;k&ouml;isesti siksi, ett&auml; uusi AmigaOS 3.5 n&auml;ki juuri p&auml;iv&auml;nvalon. Uudelta Developer CD:lt&auml; nimitt&auml;in l&ouml;ytyy uusi ajantasaistettu Native Developer Kit 3.5 dokumentteineen, kirjastoineen ja esimerkkikoodeineen.<br>
				<br>
				CD:lt&auml; l&ouml;ytyy kaikki tarpeellinen esimerkiksi pelin tekemiseen. Suurin hy&ouml;ty Developer CD:st&auml; kuitenkin on varmastikin C/C++ ja assembler-ohjelmoijille, koska CD sis&auml;lt&auml;&auml; ROM Kernel Manualin, Native Developer Kitit yms., joiden avulla siis kyseisten kielten ohjelmoijat kykenev&auml;t toteuttamaan ohjelmallaan muitakin kuin perusk&auml;skyj&auml;, kuten tuottamaan grafiikkaa ruudulle.<br>
				<br>
				Mit&auml; kaikkea CD sitten sis&auml;lt&auml;&auml;? T&auml;ss&auml; muutamia poimintoja: CD32 developer kit, CDTV developer kit, MakeCD 3.2B, Envoy 3.0, INet 225 developer kit v2, MiamiSDK 2.1, Picasso96 developer kit, CyberGraphX V4 developer kit, The Amiga Guru Book.guide, MMULib, Camd v37.1 MIDI Developer Kit, Native Developer Kit 1.3-3.5, WarpUp (PowerPC) Developer Documentation ja esimerkkej&auml;, DevCon (1998-1993), AmigaGuide Volume 1 (1987-1989) ja AmigaGuide Volume 2 (1990-1993) - ja paljon muuta.<br>
				<br>
				Levyll&auml; oleva Personal Paint 6.4 SE on luultavasti sama versio, joka on tullut A1200 Magic Bundlen mukana, eli muuten t&auml;ydellinen Personal Paint 6.4, paitsi ettei esimerkiksi GIF- ja JPEG-formaattiin tallentaminen onnistu (niit&auml; pystyy kyll&auml; katsomaan). StormC 3.0 Lite taas on tiet&auml;&auml;kseni muuten sama kuin koko versio, mutta sill&auml; saa tehd&auml; ohjelmia vain omaan k&auml;ytt&ouml;&ouml;n. En tied&auml;, onko freewaren teko sallittua vai ei, mutta kaupallisten ohjelmien teko ainakin on kielletty.<br>
				<br>
				Developer info -hakemistossa on esimerkiksi koodaustyylistandardit. Kaikkein t&auml;rkeimp&auml;n&auml; on Reference-hakemisto, josta siis l&ouml;ytyy ROM Kernel Manualit yms. ja iso kasa esimerkkiohjelmia. Kopioidessani CD:n kiintolevylle ilmoitti DirOpus Reference-hakemistossa olevan muistaakseni noin 15 000 tiedostoa, eli sielt&auml; todella l&ouml;ytyy vaikka mit&auml;. Osa referencest&auml; on Guidena, osa HTML-muodossa ja osa ihan vain tekstin&auml;, ja varsin monet kaikissa kolmessa formaatissa.<br>
				<br>
				Amiga Developer CD 2.1 on ehdottomasti joka markan arvoinen ainakin niille, jotka v&auml;h&auml;nkin vakavammin ohjelmointia harrastavat. Monien ohjelmien, kuten Personal Paint 6.4:n takia on t&auml;m&auml; rahansa arvoinen my&ouml;s monille muille.<br>
			</td></tr>
		</table>
		</p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Amiga Developer CD 2.1</font></td>
				<td width="50%" bgcolor="#d8ecfd">Creative Labs<br><font size="2"><a href="http://www.haage-partner.com/aos35/aos35-devcd21-e.htm" target="_top">http://www.haage-partner.com/aos35/aos35-devcd21-e.htm</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Myyj&auml;:</font></td>
				<td width="50%" bgcolor="#d8ecfd">Gentle Eye Ky, puh. (03) 363 0048, <font size="2"><a href="mailto:ge@vip.fi">ge@vip.fi</a>, <a href="http://www.ge.vip.fi/" target="_top">http://www.ge.vip.fi/</a></font></td>
			</tr>
			<tr>
				<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
				<td width="50%" bgcolor="#d8ecfd">220 mk</td>
			</tr>
		</table>
		</p>
		<p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>
</html>

