<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>K o n e e n &nbsp; C o o p e r &nbsp; k e i k k a</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Petri Keckman &lt;<a href="mailto:petri.keckman@mbnet.fi">petri.keckman@mbnet.fi</a>&gt;</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					<center><img src="kuvat/cooper.jpg" width="394" height="157" alt=""></center>
					<br>
					Paistinlastat olisivat muuten taipuneet alasp&auml;in, mutta viisauskoneet olivat tanakat ja 25 metri&auml; korkeat. Ne olivat l&auml;ht&ouml;isin pyyheliinoista, jotka olivat p&auml;&auml;tyneet eri asennoissa olevien ihmisten verkkokalvoille. Kukaan ei ollut varsinaisesti vastannut l&auml;hetyksest&auml;, mutta kaikki vastaanottivat. &Auml;mp&auml;reiden ruuduitukset oli nostettu hyllylle. Kaikki, kuten my&ouml;s pikkukipitt&auml;j&auml;t, joutuivat jonottamaan useisiin kassoihin monta kertaa. Er&auml;&auml;ss&auml; vaiheessa pelleily loppui, mutta tuloksena ei ollut muuta kuin vihert&auml;v&auml;n s&auml;vyinen kokonaan punainen pallo, jossa oli mustia t&auml;pli&auml;.<br>
					<br>
					Ei kukaan osannut viittaa huonommassa nopeudessa kuin Panne. Sit&auml; paitsi aikataulut olivat muutenkin h&auml;vinneet loppuottelun - miksi olisi kannattanut edes k&auml;ynnist&auml;&auml; konetta? Semminkin kun h&auml;n oli juuri edellisen&auml; p&auml;iv&auml;n&auml; k&auml;vellyt portaita alasp&auml;in kuin mik&auml;kin Euroopan omistaja.<br>
					<br>
					"Ei kuitenkaan tasoitu", oli ainoa vastaus jonka mies oli saannut e-mailitse. Se oli kuitenkin jo liian my&ouml;h&auml;ist&auml; siin&auml; vaiheessa kun konekoodi oli lajiteltu humaaneille. "Konekoodia hummaaneille!" vastasivat tarrat kuorossa ja laskeutuivat oudosti - liian oudosti - n&auml;pp&auml;imist&ouml;n taakse. Vasta sinne p&auml;&auml;sty&auml;&auml;n he n&auml;kiv&auml;t mist&auml; todellisuudessa oli ollut kyse.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

