<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Haastattelussa: Litti</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kysymykset: Anu Seilonen ja Janne Sir&eacute;n</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					<center><img src="kuvat/litpetro.jpg" width="397" height="391" alt="Litti ja Petro"></center>
					<br>
					Suomalaisella #amigafin-IRC-kanavalla vieraillessaan saattaa t&ouml;rm&auml;t&auml; mielenkiintoiseen tuttavuuteen: t&auml;m&auml; nyky&auml;&auml;n kanavan vakioasukkaaksi laskettava espanjalainen k&auml;ytt&auml;&auml; lempinime&auml; Litti, juttelee silloin t&auml;ll&ouml;in sanan tai pari suomeksi ja julistautuu suureksi Suomi-faniksi! Mist&auml; oikein tarkalleen on kyse? Iskuryhm&auml; Sir&eacute;n & Seilonen p&auml;&auml;tti ottaa asiasta selv&auml;&auml;. Haastattelun toteutti Anu Seilonen s&auml;hk&ouml;postitse ja osittain IRC:ss&auml;. Kiitokset Janne Sir&eacute;nille kysymyksist&auml;.
				</td></tr>
				<tr><td width="50%" bgcolor="#d8ecfd">
					<b>Kysymys:</b> Kertoisitko v&auml;h&auml;n perheest&auml;si ja taustastasi. Mik&auml; on oikea nimesi, kuinka vanha olet ja miss&auml; asut?<br>
					<br>
					<b>Vastaus:</b> Nimeni on David Gonz&aacute;lez Barrag&aacute;n, IRC:ss&auml; k&auml;yt&auml;n nime&auml; Litti. T&auml;yt&auml;n helmikuussa 24 vuotta. Olen perheeni nuorin, minulla on yksi isoveli. Asun Alcobendas-nimisess&auml; kaupungissa Madridista pohjoiseen.<br>
					<br>
					<b>K:</b> Opiskeletko vai onko sinulla ty&ouml;paikka?<br>
					<br>
					<b>V:</b> En opiskele juuri nyt. Minulla on elektroniikka-alan koulutus, mutta t&auml;ll&auml; hetkell&auml; olen ty&ouml;t&ouml;n.<br>
					<br>
					<b>K:</b> Milloin ja miten sinusta tuli amigisti? Onko Espanjassa Amiga-k&auml;ytt&auml;j&auml;ryhmi&auml;?<br>
					<br>
					<b>V:</b> Ostin ensimm&auml;isen Amigani, A500:n, vuonna 1990. N&auml;in sellaisen kaverillani ja my&ouml;s joissakin kaupoissa. Espanjassa on k&auml;ytt&auml;j&auml;ryhm&auml;, mutta en tied&auml; siit&auml; enemp&auml;&auml; - ainakaan se ei ole teid&auml;n veroisenne! (=<br>
					<br>
					<b>K:</b> Mik&auml; on nykyinen Amiga-kokoonpanosi? Onko Espanjasta helppo l&ouml;yt&auml;&auml; Amiga-tuotteita ja ovatko ne kalliita?<br>
					<br>
					<b>V:</b> Nykyinen kokoonpanoni: Amiga 1200T, Blizzard PPC 603e+/240 MHz, 68040, 64 Mt Fast, 2,3 Gt + 1 Gt IDE-kiintolevyt, 9 Gt SCSI-kiintolevy, 40x SCSI-CD-ROM, SCSI-CD-R-asema ja Delfina 1200.<br>
					<br>
					Espanjassa on ainakin pari kolme Amiga-kauppaa, mutta niill&auml; on huonot varastot, ja toimitusajat venyv&auml;t pitkiksi. Hinnat ovat suurinpiirtein samaa luokkaa kuin Suomessa. Itse ostan Amiga-ohjelmani ja -laitteeni Suomesta, tamperelaiselta Gentle Eyelt&auml; (terveisi&auml; Boogielle!).<br>
					<br>
					<b>K:</b> Milloin ja miten sinusta oikein tuli Suomi-fani?<br>
					<br>
					<b>V:</b> Heheheh, hyv&auml; kysymys... Joskus vuonna 1993 n&auml;in levykkeellisen 40 kt Amiga-introja Assembly 93:lta, ja ne kaikki oli tehty Suomessa! Suosikkijalkapalloilijani on suomalainen, samoin rallikuski... mit&auml; tapahtui? Sen j&auml;lkeen olen ollut kiinnostunut Suomesta, ja nyky&auml;&auml;n pid&auml;n Suomesta paljon.<br>
					<br>
					<b>K:</b> Oletko koskaan k&auml;ynyt Suomessa? Jos et, suunnitteletko vierailua?<br>
					<br>
					<b>V:</b> En ole koskaan k&auml;ynyt Suomessa, mutta suunnitelmissani on k&auml;yd&auml; tutustumassa Suomeen ja tapaamassa suomalaisia yst&auml;vi&auml;ni.<br>
					<br>
					<b>K:</b> #amigafin-kanavalla on hyvin v&auml;h&auml;n ulkomaalaisia, sinun lis&auml;ksesi ei oikeastaan ket&auml;&auml;n vakituisia k&auml;vij&ouml;it&auml;. Milloin ja miten l&ouml;ysit kanavalle?<br>
					<br>
					<b>V:</b> Kun minulla ei viel&auml; ollut Internet-yhteytt&auml;, n&auml;in jossain moduulissa l&auml;hetett&auml;v&auml;n terveisi&auml; #amigafin:lle, suomalaiselle Amiga-kanavalle. Liityin kanavalle heti kun sain Internet-yhteyden, ja nyky&auml;&auml;n olen kanavalla aina kun olen Internetiss&auml;.<br>
					<br>
					<b>K:</b> Onko teill&auml; espanjalaista Amiga-kanavaa, ja millainen se on?<br>
					<br>
					<b>V:</b> Kyll&auml; on, mutta... Siell&auml; on l&auml;hinn&auml; vain kaveriporukoita samoista kaupungeista, ja siell&auml; vain kritisoidaan jatkuvasti Amigaa (PC-k&auml;ytt&auml;ji&auml;, luulisin). Siell&auml; ei ole mink&auml;&auml;nlaista yhteishenke&auml; eik&auml; kaveruutta. #amigafin:ll&auml; on hyv&auml; olla.<br>
					<br>
					<b>K:</b> Mik&auml; on ollut muistettavin hetki #amigafin-kanavalla?<br>
					<br>
					<b>V:</b> Jonkin aikaa sitten luulin, ett&auml; minua pidettiin kanavan h&auml;irikk&ouml;n&auml;, mutta kaikki sanoivat p&auml;invastaista ja kertoivat, ett&auml; olen aina tervetullut kanavalle. Liikuttavia hetki&auml;. (=  Toinen hieno muisto on tuoreelta uudenvuodenaatolta, juttelimme yst&auml;vien kesken mukavia.<br>
					<br>
					<b>K:</b> Onko #amigafin mill&auml;&auml;n tavalla muuttanut k&auml;sityst&auml;si Suomesta ja suomalaisista?<br>
					<br>
					<b>V:</b> Eip&auml; oikeastaan. Keskustelen muidenkin suomalaisten kanssa, ja minulla on oma k&auml;sitykseni suomalaisista, mutta sit&auml; on vaikea selitt&auml;&auml;.<br>
					<br>
					<b>K:</b> Oletko saanut kanavalla uusia yst&auml;vi&auml;?<br>
					<br>
					<b>V:</b> Olen! Minulla on joitakin yst&auml;vi&auml; kanavalla (terveiset kaikille), mutta erityisesti Wizor! Pid&auml;n kyll&auml; kaikkia kanavalaisia yst&auml;vin&auml;ni.<br>
					<br>
					<b>K:</b> Paljonko puhut suomea ja mist&auml; olet oppinut sit&auml;?<br>
					<br>
					<b>V:</b> Puhun jonkin verran suomea, mutta huonosti. Olen opetellut sit&auml; kirjoista ja sanakirjoista, ja minulla on Espoossa hyv&auml; yst&auml;v&auml; nimelt&auml; Marja, joka on selitt&auml;nyt minulle hieman asioita t&auml;st&auml; vaikeasta kielest&auml;.<br>
					<br>
					<b>K:</b> T&auml;ss&auml; jutussa on kuva sinusta Petro Tyschtschenkon kanssa. Milloin ja miss&auml; se on otettu? Mit&auml; pid&auml;t Petrosta noin yleens&auml;?<br>
					<br>
					<b>V:</b> Kuva otettiin joulukuussa 1998 Radykal Amiga Partyilla Granadassa etel&auml;-Espanjassa. Petro on mukava ihminen, h&auml;nell&auml; on aina aikaa jutella ihmisten kanssa ja h&auml;n on hyv&auml; siin&auml;.<br>
					<br>
					<b>K:</b> Amiga on hetki sitten myyty j&auml;lleen, t&auml;ll&auml; kertaa Aminolle. Mit&auml; mielt&auml; olet Amigan tilanteesta t&auml;ll&auml; hetkell&auml;?<br>
					<br>
					<b>V:</b> Myyty j&auml;lleen... no, meid&auml;n t&auml;ytyy j&auml;lleen odottaa jonkin aikaa. T&auml;ll&auml; kertaa vaikuttaa v&auml;h&auml;n paremmalta mielest&auml;ni, mutta aika n&auml;ytt&auml;&auml;... Todelliset amigistit ovat vahvoja loppuun saakka!<br>
					<br>
					<b>K:</b> N&auml;emmek&ouml; sinua jatkossakin #amigafin-kanavalla? Sano jotain suomeksi kaikille lukijoillemme!<br>
					<br>
					<b>V:</b> Totta kai n&auml;ette! Olen kanavalla aina kun olen linjoilla. Kirjoittakaa vain /whois Litti tai kosh seen Litti, niin l&ouml;yd&auml;tte minut. (=<br>
					<br>
					Terveiset kaikille ja hyv&auml;&auml; uutta vuotta Suomen Amiga-k&auml;ytt&auml;jille!<br>
					<br>
					Litin kotisivut l&ouml;ytyv&auml;t osoitteesta <a href="http://www.arrakis.es/~kuu" target="_top">www.arrakis.es/~kuu</a>.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

