<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Kun amigisti polttiksen osti</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Timo Kemppaala &lt;<a href="mailto:apache@mbnet.fi">apache@mbnet.fi</a>&gt;</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Mit&auml; RC-harrastaminen oikeastaan on? Se on monialainen laji, jossa on nelj&auml; p&auml;&auml;lajia: RC-autot, RC-veneet, RC-lentokoneet ja RC-helikopterit. N&auml;m&auml; sitten jakautuvat useisiin alalajeihin.<br>
					<br>
					Aloitin RC-harrastukseni 8 vuotta sitten. Silloin olin kiinnostunut l&auml;hinn&auml; s&auml;hkis-crossareista. Ensimm&auml;inen hankintani oli Tamiyan valmistama Ford F-150 -s&auml;hk&ouml;monsteri, joita ei en&auml;&auml; l&ouml;yd&auml; mist&auml;&auml;n. Monsterin ostin raskaan ty&ouml;p&auml;iv&auml;n ja kes&auml;duunin p&auml;&auml;ttymisen j&auml;lkeen. Auton kokoaminen ei kuitenkaan k&auml;delliselt&auml; onnistunut, ja niin jouduin kaverien kanssa yhdess&auml; tuumin miettim&auml;&auml;n, mik&auml; olisi paras ratkaisu. Yritimme viel&auml; yhdess&auml; kasata autoa, mutta turhaan: kun ei osaa, niin ei osaa. Lopulta j&auml;tin auton rauhaan nurkkaan lojumaan.<br>
					<br>
					Seuraavana viikkona kerroin toiselle, tiet&auml;v&auml;mm&auml;lle kaverille, mit&auml; oli tapahtunut, ja h&auml;n suostui tekniikkanerona auttamaan raasua. T&auml;llaisella sopimuksella jatkoimme pari p&auml;iv&auml;&auml; viikossa puolen vuoden ajan, ja er&auml;&auml;n&auml; p&auml;iv&auml;n&auml; auto saatiin liikkumaan. Tosin siin&auml;kin meni hermot moneen kertaan, kun auto ei v&auml;lill&auml; toiminut kunnolla, mutta se todella liikkui. Ajelin t&auml;ll&auml; s&auml;hk&auml;rill&auml; puolisen vuotta, kunnes se meni niin rikki, ettei sit&auml;voinut en&auml;&auml; korjata.<br>
					<br>
					Ostin toisen s&auml;hk&auml;rin (4WD Ninja Marui), ja koska kokemus oli karttunut aloituksesta yli 2000%:lla, koottiin uusi s&auml;hk&auml;ri kahdeksassa tunnissa ja viel&auml; ehdittiin ajamaankin samana p&auml;iv&auml;n&auml; oston j&auml;lkeen. T&auml;m&auml; vehje olikin varsinainen haaste, sill&auml; sille automerkille ei l&ouml;ytynyt pahemmin osia tuntemistani paikoista, joten osien hajottua jouduin juoksemaan tuon tuostakin liikkeeseen, josta saisi osia entisten tilalle.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Siirtyminen polttiksiin</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Lopulta vuoden k&auml;yt&ouml;n j&auml;lkeen rupesin hinkumaan parempaa crossaria. Er&auml;&auml;n&auml; p&auml;iv&auml;n&auml; duunin j&auml;lkeen menin ja ostin .10-tyypin polttomoottorilla (1,5 cc) varustetun Kyoshon Peugeot 205 -korilla 2200 markalla. Pakettiin kuului radio-ohjain, auto ja muut tarpeelliset osat. Auton kasaaminen k&auml;vi 5-6 tunnissa. Auto ei kuitenkaan ohjeiden mukaisesti k&auml;ynnistettyn&auml; halunnut k&auml;ynnisty&auml; saati luvata mit&auml;&auml;n sensuuntaistakaan. Autoa revittiin, nyittiin ja viimeisen&auml; keinona viel&auml; hinattiinkin toisen s&auml;hk&auml;rin per&auml;ss&auml; normaaleista autoista tutulla tavalla, mutta ei.<br>
					<br>
					Niin unohdin t&auml;m&auml;nkin auton nurkkaan, ja viel&auml; viikkojen kuluttua yritin k&auml;ynnist&auml;&auml; sit&auml;, mutta turhaan. Lopulta purin auton alkutekij&ouml;ihins&auml;, ja osat levisiv&auml;t ymp&auml;ri huonetta... Noin vuoden kuluttua siskon poikakaveri l&ouml;ysi puretun auton jostain p&auml;in huonetta ja halusi sill&auml; p&auml;&auml;st&auml; surraamaan. Parin vaikean tunnin j&auml;lkeen p&auml;&auml;tettiin vied&auml; auto siskon k&auml;mpille. Osia etsittiin pari kuukautta ja vihdoin saatiin sille l&auml;hes alkuper&auml;inen muoto takaisin. Osia ostettiin ja pariin otteeseen tehtiin itsekin, ellei kaupasta heti sopivaa l&ouml;ytynyt.<br>
					<br>
					Valmiina auto n&auml;ytti nyt crossarilta ja viel&auml; todella upealta sellaiselta. K&auml;ynnistysyritykset p&auml;&auml;ttyiv&auml;t t&auml;ysin samoin tuloksin kuin ensimm&auml;isiss&auml;kin k&auml;ynnistyksiss&auml; kotona. Lopulta p&auml;&auml;timme irrottaa tulpan ja katsoa, josko siin&auml; olisi jotain h&auml;ikk&auml;&auml;, kun kone ei kerran suostunut k&auml;ynnistym&auml;&auml;n. Parin minuutin katselun j&auml;lkeen veimme tulpan kauppaan n&auml;ytille. Tulppamme n&auml;hty&auml;&auml;n myyj&auml; nauroi hillitt&ouml;m&auml;sti: "T&auml;m&auml;h&auml;n on palanut!" Uuden tulpan saimme 15 markalla, ja niin jatkoimme matkaa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ensikokemukset polttarilla ajosta</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Tulppa laitettiin kiinni, l&ouml;p&ouml;&auml; tankkiin ja nyk&auml;isy, toinen... vasta kolmannella kerralla moottori l&auml;hti k&auml;ym&auml;&auml;n n. 5-7 sekunnin ajaksi. Siihen l&ouml;ytyi heti ratkaisu: muutimme polttoaineen ja ilman sekoitussuhdetta (s&auml;&auml;dimme neulaa). Nyt sill&auml; p&auml;&auml;stiin ulos astikin ajelemaan, mutta vuoden k&auml;ytt&auml;m&auml;tt&ouml;m&auml;n&auml; olleessa autossa oli polttoaineletkukin p&auml;&auml;ssyt murtumaan. Ostimme lis&auml;&auml; letkua ja yritimme uudelleen. Se toimi, ja p&auml;&auml;simme nyt ajamaan kunnolla. Auto oli todella &auml;rh&auml;kk&auml; niin pieneksi.<br>
					<br>
					Auto meni talvella, kes&auml;ll&auml;, oli keli mik&auml; tahansa. Kerrankin talvella rupesin sill&auml; ajamaan lumihangessa. Pienen reitin tekemisen j&auml;lkeen auto kulki v&auml;kisin lumessa. Ajon loputtua oli painoakin tullut lumen my&ouml;t&auml; lis&auml;&auml; viisi kiloa. Auto oli toiminut siit&auml; l&auml;htien, kun se k&auml;ynnistettiin ensimm&auml;ist&auml; kertaa. M&auml;nt&auml;kin ehdittiin vaihtaa. Sekin oli kivuton operaatio ja vaikein tekem&auml;ni muutos. Auto ehdittiin myyd&auml; er&auml;&auml;lle Amiga-skeness&auml;kin tunnetulle henkil&ouml;lle, mutta kyseinen henkil&ouml; ei osannut autoa oikein k&auml;ytt&auml;&auml;, joten se ostettiin takaisin. Nyt siit&auml;kin on muisto vain...
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Uusi kes&auml; ja uudet koneet</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Jo perinteisesti kes&auml;duunin j&auml;lkeen perjantaina p&auml;&auml;tin ostaa toisen auton (Kyosho 2WD Rampage) Peugeotin j&auml;lkeen. Auton kokoaminen k&auml;vi nyt todella helposti ja vaivattomasti. Osiakin oli todella v&auml;h&auml;n verrattuna Peugeotiin - niin v&auml;h&auml;n, ett&auml; kokoamisen j&auml;lkeen testauksessa kone huusi t&auml;ysill&auml;, vaikka kyseess&auml; oli tyhj&auml;k&auml;ynti. Siihen l&ouml;ysin nopeasti ratkaisun v&auml;h&auml;n aikaa ajeltuani: soitin liikkeeseen, josta oli auton ostanut ja vaadin saada puuttuneen tiivisteen kaasuttimeen. Tiiviste saatiin samana p&auml;iv&auml;n&auml;, ja auto toimi hyvin sen j&auml;lkeen.<br>
					<br>
					2WD-autolla oli vaikeuksia ajaa, kun puolentoista vuoden kokemukset 4WD-autoilla olivat ihan jotain muuta. Ajeluun kuitenkin tottui, ja ajoin autolla l&auml;hes kaksi vuotta, kunnes myin sen Peugeotin kanssa auttaneelle kaverilleni. Mies vuorostaan kunnosteli auton uutta vastaavaan kuntoon parin kuukauden aikana, min&auml; taas suunnittelin viel&auml; kovempaa crossaria.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>1/8-skaalan polttis jyr&auml;&auml;</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Myynnin j&auml;lkeen menin Rampagen myyneeseen liikkeeseen mieless&auml;ni kovaakin kovempi crossari. Se onnistuikin hyvin, sill&auml; olin n&auml;hnyt ikkunassa hyv&auml;n auton, joka my&ouml;s n&auml;ytti hyv&auml;lt&auml; mutta jota ei saanut kosketella ja katsella, ellei ostaisi sit&auml;. Menin siis ostamaan sian s&auml;kiss&auml; (Kyosho 4WD Burns), enk&auml; voinut edes palauttaa k&auml;ytettyn&auml; ostettua autoa. Auto maksoi 3100 markkaa ilman radiota, mutta hinta-laatu-suhde oli sit&auml;kin huonompi. Kotona rupesin hetimiten tutkimaan autoa tarkemmin.<br>
					<br>
					Auto osoittautui huonoksi vitsiksi, sill&auml; se oli ollut luultavasti kisapelin&auml;, niin pahasti se oli vammautunut. Pari kuukautta kirosin huonoa onneani, kunnes er&auml;s kaveri ilmoitti myyv&auml;ns&auml; huippuautoa halvalla. Menin seuraavana p&auml;iv&auml;n&auml; katsomaan, mit&auml; olisi myyt&auml;v&auml;n&auml;, ja auto olikin sit&auml; mit&auml; luvattiin. Sit&auml; oli viritelty useiden tuhansien hintaisilla systeemeill&auml; ja se oli todella kire&auml;n n&auml;k&ouml;inen peli. Annoin asian hautua pari p&auml;iv&auml;&auml; p&auml;&auml;ss&auml;ni, ja lopulta ostin auton itselleni 1900 markalla.<br>
					<br>
					Kotona piti autoa heti p&auml;&auml;st&auml; testaamaan. L&ouml;p&ouml;&auml; tankkiin ja k&auml;ynnistimell&auml; py&ouml;ritt&auml;m&auml;&auml;n. Auto k&auml;ynnistyi ensiyritt&auml;m&auml;ll&auml;, ja ihmettelin t&auml;t&auml; reaktiota, sill&auml; autohan oli ollut vuoden k&auml;ytt&auml;m&auml;tt&ouml;m&auml;n&auml;. L&auml;hdin heti baanalle ja pistin hanat pohjaan. Ajo oli todella vaikeata, sill&auml; min&auml;h&auml;n olin ajellut vain 1/10-skaalan autoilla, eik&auml; minulla ollut mit&auml;&auml;n kokemuksia t&auml;m&auml;n kokoluokan autoista saati sitten niiden tehoista, k&auml;ytt&auml;ytymisest&auml; ja muusta sellaisesta. Autossa oli nopea "OS MAX 21" -moottori, joka on jo lopetettu malli. Auto kiihtyi 0-50 km/h 0,9-1,2 sekunnissa j&auml;tt&auml;en mustaa vanaa asfaltille metrin verran. V&auml;&auml;nt&ouml;&auml; moottorilla oli v&auml;hint&auml;&auml;n 7 kertaa enemm&auml;n.<br>
					<br>
					T&auml;m&auml; auto on Kyoshon Turbo Inferno, ja se on huippukuntoinen yh&auml; t&auml;n&auml;kin p&auml;iv&auml;n&auml;. Nykyisell&auml; moottorilla saan nopeamman kiihtyvyyden ja vauhdin kuin aikaisemmin, ja lis&auml;ksi olen ottanut 4WD Burnsista erilaisia osia parantaakseni sit&auml; viel&auml;kin paremmaksi. Nyt se on huippunopea, ja jos joku uskaltaa tulla ottamaan mittaa koneestani, niin siit&auml; vain... Nyky&auml;&auml;n ajaminen on j&auml;&auml;nyt v&auml;hemm&auml;lle, kun on kaikenlaisia muita menoja, mutta ajamista en lopeta, niin kivaa se on...
 				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Moottorit</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Radio-ohjattavat mallit voidaan motorisoida monilla eri tavoilla mukaanlukien s&auml;hk&ouml;moottorit, jotka ovat viime vuosina saavuttaneet my&ouml;s lentokoneet ja helikopterit, kun niit&auml; ennen oli vain autoissa. Kaksitahtipolttomoottorit (nitrometaaniseos), nelitahtipolttomoottorit ja bensiinimoottorit ovat k&auml;yt&ouml;ss&auml; melkeinp&auml; kaikissa malleissa.<br>
					<br>
					Erityisesti isot raskaat mallikoneet, helikopterit ja veneet k&auml;ytt&auml;v&auml;t nelitahtikoneita ja bensiinimoottoreita paremman voiman takia. Nopeat veneet ja autot k&auml;ytt&auml;v&auml;t enemm&auml;n kaksitahtikoneita, koska niill&auml; saadaan kyll&auml; tarpeeksi voimaakin, mutta ennen kaikkea kierroslukuja. Tietysti on poikkeuksia autoissakin.
 				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Polttomoottori</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Polttomoottoreita on kahta mallia: kaksi- ja nelitahtikoneita. Molemmat konetyypit k&auml;ytt&auml;v&auml;t "hehkubensaa", joka on metanolia, etanolia ja synteettist&auml;/risiini&ouml;ljyseosta sek&auml; nitrometaania k&auml;ynnistyst&auml; helpottamaan. Isompi ero n&auml;ill&auml; moottoreilla on se, miten bensa tuodaan koneelle ja pakokaasut poistetaan koneen k&auml;ydess&auml;.<br>
					<br>
					Kaksitahtimoottorin polttoaineen ja ilman sekoitus (sekoitetaan kaasuttimessa) pakotetaan palokammioon m&auml;nn&auml;n ollessa alhaalla. M&auml;nn&auml;n ollessa ylh&auml;&auml;ll&auml; sekoitus puristetaan, ja kun m&auml;nt&auml; on saavuttanut yl&auml;p&auml;&auml;n, hehkutulppa sytytt&auml;&auml; polttoaineen (r&auml;j&auml;hdys). Palava kaasuseos pakottaa m&auml;nn&auml;n alas, ja matkalla alas tulee uusi polttoainery&ouml;ppy palokammioon. Koko voimajakso ottaa kaksi m&auml;nn&auml;n iskua.<br>
					<br>
					Nelitahtikoneen polttoaineen ja ilman sekoitus (sekoitetaan kaasuttimessa) tuodaan palokammioon m&auml;nn&auml;n ollessa alhaalla l&auml;pi venttiilin, joka toimii kiertokangen ohjaamana. M&auml;nn&auml;n tullessa yl&ouml;s venttiili sulkeutuu ja sekoitusta puristetaan. Kun m&auml;nt&auml; saavuttaa yl&auml;osan, hehkutulppa syttyy ja r&auml;j&auml;ytt&auml;&auml; polttoaineseoksen, joka taas pakottaa m&auml;nt&auml;&auml; alas. Seuraavalla m&auml;nn&auml;n nousulla toinen venttiili avautuu ja p&auml;&auml;st&auml;&auml; pakokaasut pois, ja m&auml;nn&auml;n ollessa alhaalla polttoaine p&auml;&auml;see palokammioon ja sama reaktio alkaa alusta. Koko voimajakso ottaa nelj&auml; m&auml;nn&auml;n iskua.<br>
					<br>
					Hehkutulppa on yleinen sek&auml; kaksi- ett&auml; nelitahtimoottoreissa. Hehkutulppa on tehty pienest&auml; platinalangasta spiraaliksi hehkutulpan sis&auml;&auml;n. Moottorin k&auml;ynnist&auml;miseen tarvitaan s&auml;hk&ouml;virtaa, jonka ei tarvitse olla suurempi kuin 1,5-2V ja ampeereita n. 2-3, jotta saadaan potkua sytytykseen. Normaali 1,5V paristo kelpaa mainiosti, mutta niit&auml; tarvitaan yleens&auml; kaksi, jotta virtaa on riitt&auml;v&auml;sti. Lis&auml;ksi ne tyhjenev&auml;t hyvin nopeasti jatkuvan l&auml;mmitt&auml;misen vuoksi.<br>
					<br>
					S&auml;hk&ouml;n t&auml;ytyy menn&auml; hehkutulpan l&auml;pi kuumentaakseen sen sopivaksi. Moottorin kampiakselin t&auml;ytyy py&ouml;ri&auml;, jotta kone l&auml;htisi k&auml;ym&auml;&auml;n omillaan. Heti kun m&auml;nt&auml; alkaa liikkua itse, otetaan hehkutin pois sylinterist&auml; ja tulpasta. Hehkutulppa jatkaa reaktiota itsekseen, eik&auml; se tarvitse hehkutusta. Polttoainesekoitus molemmissa moottoreissa yleens&auml; s&auml;&auml;det&auml;&auml;n kahdesta neulasta kaasuttimessa. Yksi venttiili s&auml;&auml;telee sekoitusta tyhj&auml;- ja hitaalle k&auml;ynnille, kun taas toinen s&auml;&auml;t&auml;&auml; huippunopeutta ja polttoaineen m&auml;&auml;r&auml;&auml;, joka moottorille annetaan.<br>
					<br>
					Moottoreissa, jotka ovat siimaohjattaville malleille, ei yleens&auml; ole kaasutinta ja ne toimivat aina t&auml;ydell&auml; kaasulla. Venttiili on asennettu ilmanottoon ja se mahdollistaa sekoituksen vain suuremmalle/tasoitukselle. Kaasutuksen ohjailuun moottoreissa on yleens&auml; laitettu py&ouml;riv&auml; neula kaasuttimeen. T&auml;m&auml; neula ohjailee, kuinka paljon polttoaineen ja ilman sekoitusta p&auml;&auml;stet&auml;&auml;n palokammioon. Ruuvi sijaitsee kaasuttimen kyljess&auml; vasemmalla puolella, joskus my&ouml;s oikealla.<br>
					<br>
					Kaksitahtimoottorit ovat yleisimpi&auml; lennokkien ja 1/8-autojen voimanl&auml;hteit&auml;. Ne ovat yksinkertaisia, kevyit&auml; ja helppoja huoltaa. Niit&auml; joutuukin huoltamaan suhteellisen paljon, jotta moottori toimisi kunnolla. Moottorin k&auml;ydess&auml; ne toimivat hyvin nopeilla kierroksilla kirkuvalla p&ouml;rin&auml;ll&auml;, joka johtuu nopeuden tuplaantumisesta: kaikki osat k&auml;yv&auml;t tuplanopeudella verrattuna isoihin kaksitahtikoneisiin. Kaksitahtikoneet ovat my&ouml;s suhteellisen halpoja, keskim&auml;&auml;r&auml;inen hinta on n. 900 mk.<br>
					<br>
					Nelitahtimoottorit ovat kasvattaneet suosiotaan, ja ne tuottavat my&ouml;s hiljaisempaa, aidontuntuista &auml;&auml;nt&auml;. Ne tuottavat my&ouml;s voimansa v&auml;hemmill&auml; kierrosluvuilla kuin kaksitahtimoottorit. Kierroslukuja on v&auml;hemm&auml;n, koska niiss&auml; on venttiilit ja ne my&ouml;s painavat hieman enemm&auml;n ja ovat kalliimpia kuin kaksitahtiomoottorit. Nelitahtikoneet vaativat my&ouml;s pikkuisen enemm&auml;n huoltoa kuin pienemm&auml;t serkkunsa, mutta ne eiv&auml;t miss&auml;&auml;n tapauksessa ole vaikeampia k&auml;ytt&auml;&auml;. Ja ne todella kuulostavat hyv&auml;lt&auml;...<br>
					<br>
					Normaalisti kaksitahtikone kiert&auml;&auml; minuutissa n. 32 000 kierrosta, ja "turbotetuilla" moottoreilla saavutetaan viel&auml;kin korkeampia lukuja, kuten oman mallini kaksitahtikone. Kaksitahtipolttomoottoria voidaan "turbottaa" ostamalla siihen parempi "pilli" (pakoputkisarja), jossa kaasu puristetaan tihe&auml;mm&auml;ksi ja paineistus menee my&ouml;s polttoainetankkiin, josta voidaan nopeuttaa polttoaineen kulkua polttokammioon. My&ouml;s pakokaasujen k&auml;ytt&ouml; on mahdollista, sill&auml; paremmalla pillill&auml; koneesta saadaan nopeammin kierrokset maksimiin, jolloin tehoa on tietenkin my&ouml;s enemm&auml;n k&auml;yt&ouml;ss&auml;.<br>
					<br>
					Pilli toiminee er&auml;&auml;nlaisena kaasuturbiinina RC-malleille. Sille ei l&ouml;ydy viel&auml; voittajaa, sill&auml; olen testannut kahta eri pillisarjaa, joista toinen on EFRA-pilli (kisaluokitus) ja antoi mallilleni yli 10 000 rpm lis&auml;&auml; kierroksia kuin normaalilla pillill&auml;. Laskettuna saavutettu nopeus + kisapilliturbotus oli kierroksia koneessani siis 48 000 rpm. Nykyinen koneeni antaa 54 000 rpm sopivalla nitroseoksella, mutta olen tyytynyt v&auml;hem&auml;&auml;n s&auml;&auml;st&auml;&auml;kseni m&auml;nt&auml;&auml; ja sylinteriholkkia (49 000 rpm). Kisapillit ovat yleens&auml; mustia kauttaaltaan ja n&auml;ttej&auml; muutenkin. Ainoa syy niiden k&auml;ytt&auml;miseen on hinta, sill&auml; ne maksavat 250-700 mk, joten harrastaja ei tarvinne kaikkein nopeinta pilli&auml;, jos tarkoituksena on ajaa jossain hiekkamontuilla l&auml;hist&ouml;ll&auml;.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Bensamoottorit</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Bensatoimiset moottorit ovat tuleet isojen malliautojen, veneiden ja lent&auml;vien mallien voimanl&auml;hteiksi. Ne eiv&auml;t tule yleens&auml; pienin&auml;, kuten kaksi- ja nelitahtikoneet, jotka sopivat "pienempiin ja keskikokoisiin" malleihin, vaan todellakin isoille malleille. Ne antavat tehokkaan moottorin j&auml;rkeenk&auml;yv&auml;ll&auml; hinnalla ja helppok&auml;ytt&ouml;isin&auml;. Sytytystulppa ja ulkoinen virtal&auml;hde tarvitaan k&auml;ynnist&auml;miseen, polttoaine on yleens&auml; bensaa ja &ouml;ljysekoitusta. Autot ja veneet on asennettu vetok&auml;ynnistimell&auml; helppoa k&auml;ynnistyst&auml; varten.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>S&auml;hk&ouml;moottorit</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					S&auml;hk&ouml;moottorit ovat uusinta uutta RC-helikoptereissa ja lentokoneissa, mutta ovat olleet jo k&auml;yt&ouml;ss&auml; hyvin suosittuina RC-autoissa. Ne ovat my&ouml;s ideaalisia nopeisiin veneisiin ja pienoismalliveneiden tehonl&auml;hteeksi kaikissa kokoluokissa. Uusilla nopeatoimisilla NiCd-akuilla (nikkeli-kadmium) saadaan tehoa vaativaankin moottoriin (pienentynyt koko ja parempi kapasiteetti). Menneen kahdeksan vuoden aikana s&auml;hk&ouml;moottorit ovat tulleet suosituksi kaikissa RC-lajeissa.<br>
					<br>
					S&auml;hk&ouml;moottorit ovat yleistyneet tehonl&auml;hteeksi pienille lentokoneille, 1/12- ja 1/10-kokoluokan rata- ja crossiautoihin, kuten my&ouml;s pienille ja nopeille veneille. T&auml;m&auml; s&auml;hk&ouml;moottori on tehokas ja kevyt. Moottorityyppi&auml; kutsutaan rautasyd&auml;nmoottoriksi, alan termi&auml; k&auml;ytt&auml;en "s&auml;hkis". Mabuchi-540 on suosittu ja eritt&auml;in hyv&auml; esimerkki t&auml;ll&auml;isest&auml; voimanl&auml;hteest&auml;. Monet valmistajat tekev&auml;t my&ouml;s omia muunnelmiaan t&auml;st&auml; moottorityypist&auml;.<br>
					<br>
					Mallikoneet k&auml;ytt&auml;v&auml;t polttomoottorien lis&auml;ksi my&ouml;s s&auml;hk&ouml;moottorin parempaa versiota, joka tunnetaan paremmin "Cobolt-Magnet"-moottorina (koboltti-magneetti). T&auml;llainen moottori antaa paremmat tehosuhteet k&auml;ytett&auml;v&auml;&auml;n malliin, mutta on n&auml;ill&auml; er&auml;&auml;t huonotkin puolensa. Ne ovat kalliita ja huomattavasti tehokkaampia ja painavampia kuin rautasyd&auml;nmoottori. Mallinnetut veneet k&auml;ytt&auml;v&auml;t paljon useammin painavampia, voimakkaampia ja pienemm&auml;ll&auml; kierrosluvulla toimivia moottoreita antaakseen voimaa n&auml;ille hienoille ja isoille veneille.<br>
					<br>
					Voimanl&auml;hteen&auml; s&auml;hk&ouml;moottoreille k&auml;ytet&auml;&auml;n NiCd-kennoja, jotka on pakattu pitkulaiseen muotoon sarjakytkenn&auml;ll&auml;. 6-7 kennon akut ovat yleisi&auml;, mutta isommat kobolttikoneet voivat vaatia jopa 28 tai viel&auml;kin enemm&auml;n! N&auml;m&auml; akut ovat kevyit&auml; ja ladattavissa nopeasti 15-30 minuutissa. Niiden ajoaika j&auml;&auml; kuitenkin suhteellisen lyhyeksi, 4-10 minuuttiin, ja siksi kannattaa mietti&auml;, millaisen mallin haluaa rakentaa, polttomoottorit kun antavat 30 minuuttia vauhdikasta ajoa laitteella kuin laitteella, ja polttomoottorit voidaan tankata my&ouml;s ajon ollessa kesken.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mist&auml; pit&auml;isi aloittaa?</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Suoraan sanoen, yksikertaiseen, helppohuoltoiseen, kokonaissuoritukseen, v&auml;h&auml;iseen hintaan suosittelen, ett&auml; aloittelija valitsee kaksitahtimoottorin malliinsa. Toki muitakin kannattaa harkita, mutta mielest&auml;ni kaksitahti on moottori, joka on paremmalla moottorilla korvattavissa, ja voit aina pit&auml;&auml; ylim&auml;&auml;r&auml;ist&auml; voimaa s&auml;&auml;st&ouml;ss&auml; koneessasi ja ottaa sen k&auml;ytt&ouml;&ouml;n tiukassa paikassa.<br>
					<br>
					Kokeneet kuljettajat/lent&auml;j&auml;t valitsevat my&ouml;s kaksitahtikoneet, ne kun kiihdytt&auml;v&auml;t nopeammin isotkin autot ja helikopterit, mutta kokorajoituksia niiss&auml;kin on. Esimerkiksi 1/8 vaatii kaksitahtikoneen, joka voi olla ja yleens&auml; onkin 3,5 cc. Olen my&ouml;s n&auml;hnyt yli kymppitonnin maksavia 1/4-suhteen autoja, joissa on bensamoottori ja ketjuvedolla varustettu voimansiirto, Kaikki osat olivat siin&auml; my&ouml;s tuplasti kest&auml;v&auml;mpi&auml; ja hintavampia kuin 1/8-autoissa. N&auml;iden autojen maksiminopeus on siin&auml; 30-40 km/h, koska jos ne osuvat johonkin sit&auml; suuremmalla vauhdilla, on t&auml;ysi rikkoontuminen edess&auml;.<br>
					<br>
					Myynniss&auml; on moottoreita, jossa on kuula- tai liukulaakerituetut kiertokanget. Kuulalaakerituetulla moottorilla on parempi suorituskyky, toimintavarmuus ja se kest&auml;&auml; my&ouml;s pitemp&auml;&auml;n kuin liukulaakerimoottori. Kuulalaakerimoottorit ovat my&ouml;s hitusen kalliimpia kuin liukulaakeriset. Toisaalta, eih&auml;n mik&auml;&auml;n est&auml; sinua ostamasta erikseen kuulalaakeria koneeseesi, mik&auml; t&auml;ytyykin tehd&auml; aika ajoin... Liukulaakerimoottoreita ei en&auml;&auml; pahemmin l&ouml;ydy, koska ne ovat l&auml;hes samanhintaisia kuin kuulalaakeriset, joten sellaisen ostaminen ei kannata pidemm&auml;n p&auml;&auml;lle.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Termist&ouml;&auml;</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Seuraavassa on muutama termi, jotka yhdistet&auml;&auml;n moottoreihin ja joihin et ole mahdollisesti p&auml;&auml;ssyt tutustumaan:<br>
					<br>
					<ul>
						<li>Monikurkkuinen<br>
						Tavallinen kaksitahtimoottori sis&auml;lt&auml;&auml; yhden polttoaineen sis&auml;&auml;nmenoaukon pakokaasuaukon toisella puolen kaasuttimessa. Monikurkkuinen moottori sis&auml;lt&auml;&auml; eri puolilla sylinteri&auml; useita (yleens&auml; 3-4) sis&auml;&auml;nmenoaukkoja, jotka mahdollistavat polttoaineen menon palokammioon. T&auml;m&auml; puolestaan mahdollistaa enemm&auml;n voimaa kuin normaalikurkkuinen kaksitahtimoottori. Monikurkkuinen moottori on hiukkasen kalliimpi korkeampien valmistuskustannuksien takia.</li>
						<li>Kylm&auml; vai kuuma hehkutulppa?<br>
						On saatavilla kahdenlaista asteikkoa olevia hehkutulppamallistoa. Kylm&auml; on yleens&auml; k&auml;ytetty .15 ja pienemm&auml;n kuutiotuuman moottoreissa, kun taas kuumaa hehkutulppaa k&auml;ytet&auml;&auml;n kaikissa yli .15 kuutiotuuman moottoreissa. Seuraa valmistajan ohjeita.</li>
						<li>Suojahehkutulppa<br>
						Suojahehkutulpassa on metallinen tanko hehkutulpan halki pohjassa, mik&auml; est&auml;&auml; raa'an polttoaineen p&auml;&auml;syn hehkutulpan sis&auml;&auml;n ja v&auml;hent&auml;&auml; hehkutulpan viilenemist&auml; tyhj&auml;k&auml;ynnin aikana.</li>
						<li>Pitk&auml;iskuinen<br>
						Moottorin isku viittaa et&auml;isyyteen, jonka m&auml;nt&auml; kulkee ylh&auml;&auml;lt&auml; alas. Pitk&auml;iskuisessa moottorissa t&auml;m&auml; et&auml;isyys on hiukan pidempi kuin normaali-iskuisessa, ja se tekee moottorin jonkin verran vahvemmaksi v&auml;&auml;nt&auml;&auml; v&auml;hemmill&auml; kierroksilla. Aika usein moottori on "pitk&auml;iskuinen", jos iskun et&auml;isyys on suurempi kuin m&auml;nn&auml;n pituus.</li>
					</ul>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Toimintavinkkej&auml;</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Pid&auml; kaasuttimeen menev&auml; polttoaine puhtaana erillisell&auml; suodattimella. Pist&auml; suodatin polttoainepullosi p&auml;&auml;h&auml;n, kun t&auml;yt&auml;t tankkia, ja toinen polttoaines&auml;ili&ouml;n ja kaasuttimen v&auml;liin. Jos lenn&auml;t alueella, joka on p&ouml;lyinen, suosittelen k&auml;ytt&auml;m&auml;&auml;n ilmansuodatinta kaasuttimesi ilmanottoon pit&auml;&auml;ksesi moottorin ehj&auml;n&auml;. Autoihin tuleviin hehkumoottoreihin suodatin on pakollinen.<br>
					<br>
					Kun olet ajanut/lenn&auml;tt&auml;nyt malliasi tarpeeksi, aja moottori kuivaksi sammuttamalla polttoaineen tulo ennen kuin sammutat koneesi. T&auml;m&auml; varmistaa sen, ettei kiertokangessa ole polttoainetta, jonka metanoli ja nitrometanoli on erityisen altis kosteuden ker&auml;&auml;miseen, ja se taas ruostuttaa eri osia koneesta. Erityisess&auml; vaarassa ovat kuulalaakerit. Kun olet ajanut moottorisi kuivaksi, k&auml;yt&auml; j&auml;lki&ouml;ljy&auml; antaaksesi moottorillesi entist&auml; paremman suojan korroosiota vastaan.<br>
					<br>
					Potkurikonetta k&auml;ynnist&auml;ess&auml;si k&auml;yt&auml; nk. pelkuritikkua, koska k&auml;tesi ja sormesi ovat erityisess&auml; vaarassa, kun kone l&auml;htee k&auml;yntiin. Kun asetat venttiilin nopealle, k&auml;yt&auml; aina rikasta sekoitusta. Moottori, joka toimii laihalla sekoituksella, on altis vioittumiselle - erityisesti rengastetut moottorit. K&auml;yt&auml; vain valmistajan suosittelemaa polttoainetta ja propellia. Jos jokin osa toimii huonosti, vaihda se uuteen. Pahimmassa tapauksessa auto/vene/lentokone karkaa ja voi aiheuttaa turhaa huolta joko sinussa tai naapureissa, jos vahinkoja sattuu...<br>
					<br>
					Muista! Lennokkimoottorit ovat voimakkaita ja toimivat nopeilla kierroksilla. Ne pystyv&auml;t repim&auml;&auml;n sormesi irti, jos ne ovat v&auml;&auml;r&auml;ss&auml; paikassa v&auml;&auml;r&auml;&auml;n aikaan. Yleisesti moottorit tulevat hyvin kuumiksi k&auml;ynnin aikana.<br>
					<br>
					Ole varovainen!
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Valmistaminen kokeiluun</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Ensimm&auml;ist&auml; kertaa RC-mallia kokeileva on varmaakin sen kokoamisen j&auml;lkeen pelonomaisissa tunnelmissa, sill&auml; malli maksaa varusteineen kaikkineen yli 1000 markkaa mallista ja valmistajasta riippuen, joten omistaja on syyst&auml;kin peloissaan sen rikkoontumisesta. &Auml;&auml;rimm&auml;isen t&auml;rke&auml;&auml; siksi onkin, ett&auml; mallin rakentanut tutustuu ennalta mallin toimintaan seuraamalla ohjeita, jotka ovat mallin mukana tulleet. Kun ohjeet on todettu ja useaan kertaan varmistettu, ett&auml; ne ovat j&auml;&auml;neet p&auml;&auml;koppaan, voidaan siirty&auml; eteenp&auml;in.<br>
					<br>
					Ennen ulos l&auml;htemist&auml; kannattaa tarkistaa kaikki mutterit, nivelet, renkaat, moottorin kiinnitys, vaihteisto ym. S&auml;hk&ouml;malleissa on akun kiinnitt&auml;minen ja liittimien tarkistaminen kannattavaa. Muista yht&auml; t&auml;rkeist&auml; paikoista neuvotaan mallin ohjeessa. Kun tarkistukset on tehty, voit siirty&auml; ulos malleinesi. Mallin tunteminen on erityisen t&auml;rke&auml;&auml;, ja mit&auml; enemm&auml;n tied&auml;t mallistasi, sit&auml; paremmin sit&auml; k&auml;yt&auml;t.<br>
					<br>
					Vikatilanteiden hallinta kuuluu my&ouml;s harrastukseen. RC-malleissa t&auml;ytyy tiet&auml;&auml;, miten mik&auml;kin osa toimii ja miten se kiinnitet&auml;&auml;n. Esim. helikopterit ovat eritt&auml;in teknisi&auml; laitteita, joiden t&auml;ydellinen tunteminen on vaadittavaa ja ne my&ouml;s tarvitsevat jatkuvaa huoltoa ollakseen kunnossa. Autot ja veneet eiv&auml;t nyt sent&auml;&auml;n ole helikoptereita, mutta niit&auml;kin pit&auml;&auml; huoltaa - t&auml;m&auml; p&auml;tee kaikkiin kotonakin... :) Jos olet tutkinut malliasi tarpeeksi, niin nyt viimeist&auml;&auml;n olisi aika l&auml;hte&auml; sinne ulos sit&auml; testaamaan.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mallin k&auml;ynnist&auml;minen</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Auto/malli k&auml;ynnistyy yleens&auml; helposti, etenkin jos kyseess&auml; on s&auml;hkis (s&auml;hk&ouml;malli). S&auml;hk&auml;riss&auml; tarvitsee vain kiinnitt&auml;&auml; akun johto vastaanottimeen ja laittaa virta p&auml;&auml;lle. On kuitenkin parempi, ett&auml; k&auml;ynnist&auml;t l&auml;hettimen ensimm&auml;isen&auml;, sill&auml; jos malli p&auml;&auml;see karkaamaan, on jo melkeinp&auml; my&ouml;h&auml;ist&auml; yritt&auml;&auml; korjata tilanne k&auml;ynnist&auml;m&auml;ll&auml; radio - malli voi olla jo siihen menness&auml; tuhoutunut.<br>
					<br>
					Kun olet laittanut radion, akun ja muut tarvittavat johtimet kiinni, voit kokeilla malliasi. Aloita kuitenkin varovaisesti, ettei laite p&auml;&auml;se k&auml;sist&auml;. T&auml;m&auml; karkailu on etenkin polttomoottoristen autojen luonne, sill&auml; polttomoottorin ansiosta auto l&auml;htee liikkeelle hyvin nopeasti, jos kaasua annetaan tarpeeksi. Polttomoottoriauto kiihtyy asfaltilla yhdess&auml; sekunnissa 50 km/h vauhtiin, ja se saavuttaa 80 km/h hyvinkin nopeasti.<br>
					<br>
					T&auml;st&auml; sain kerran karvaan, mutta turvallisesti p&auml;&auml;ttyneen opetuksen parvekkeeni alla kokeillessani polttistani. Matkaa oli sein&auml;&auml;n n. 10 metri&auml; sateista, liukasta nurmikkoa. Auto l&auml;hti kulkemaan kaasu pohjassa 40 km/h alle sekunnissa kohti talon sein&auml;&auml;. Onneksi ei muuta s&auml;rkynyt kuin polttoaines&auml;ili&ouml;, jonka aineet jatkoivat viel&auml; matkaansa kun auto meni sein&auml;&auml;n... Auto ei olisi halunnut pys&auml;hty&auml; siihenk&auml;&auml;n, vaan jatkaa matkaa muualle. Onneksi polttoaine p&auml;&auml;si ulos, jolloin siit&auml; vaaratilanteesta s&auml;&auml;styttiin.<br>
					<br>
					T&auml;rke&auml;&auml; on my&ouml;s kriittisten kohtien kunnollinen kiinnitt&auml;minen polttiksessa. Moottorin k&auml;ydess&auml; ruuvit l&ouml;ystyv&auml;t ja jopa voivat irrota kokonaan, mik&auml; on jo katastrofi auton kannalta. T&auml;m&auml;n vuoksi kannattaa kriittisiin paikkoihin liimata ruuvi kiinni, eli pieni ripaus liimaa auttaa ruuvia pysym&auml;&auml;n paikallaan. My&ouml;s lukkomutterit tekev&auml;t saman, mutta niit&auml; ei voi joka paikkaan heitell&auml;. Ajon loputtuakin kannattaa auton kokonaisuuden tarkistaminen ja kaikkien ruuvien kirist&auml;minen.<br>
					<br>
					Nyt kun kaikki on kiinni, voit yritt&auml;&auml; k&auml;ynnistyst&auml;. Polttomoottorin k&auml;ynnist&auml;minen on yleens&auml; helppoa ja vaivatonta, mutta &auml;l&auml; h&auml;tik&ouml;i p&auml;&auml;st&auml; ajamaan. Vaikka olisitkin omistanut s&auml;hk&ouml;mallin ja rapatellut sill&auml;, on polttomoottoriauto huomattavasti suuremman tehonsa ansiosta nopeammin kiihtyv&auml; ja vaikeampi hallita. (Voin olla v&auml;&auml;r&auml;ss&auml;kin, mutta oman kokemukseni mukaan t&auml;m&auml; p&auml;tee.)<br>
					<br>
					K&auml;ynnist&auml;miseen tarvitaan 3,5 cc:n (luokan .21 moottori) 2V:n j&auml;nnite ja starttipy&ouml;r&auml;. Startterissa on helpointa k&auml;ytt&auml;&auml; normaalia auton akkua virran tuomiseksi k&auml;ynnistimelle, muitakin kannattaa kokeilla. Startteri ostetaan erikseen, ellei se ole paketin mukana. Joissakin moottoreissa tulee vetonaru mukana, mutta se on jo harvinaisuus t&auml;m&auml;nkokoisissa moottoreissa.<br>
					<br>
					T&auml;yt&auml; tankki sopivalla polttoaineella (ohje mallin mukana) ja paina pari kertaa tankin pumpusta (riippuen tankista ja autosta, onko pumppua) sy&ouml;tt&auml;&auml;ksesi moottorille polttoainetta. Kun n&auml;et polttoaineen menev&auml;n moottoriin asti, lopeta pumppaaminen ja kiinnit&auml; hehkutin tulppaan ja toinen p&auml;&auml; hehkuttimesta kanteen (hattu). Odota muutama sekunti, jotta tulppa ehtii l&auml;mmet&auml; tarpeeksi, ja sitten vasta k&auml;ynnist&auml;.<br>
					<br>
					Yrit&auml; nyt k&auml;ynnist&auml;&auml; moottori vet&auml;m&auml;ll&auml; narusta. Jos sit&auml; ei ole, k&auml;yt&auml; k&auml;ynnistint&auml;, jonka kuminen py&ouml;r&auml; laitetaan moottorin vauhtipy&ouml;r&auml;n alle ja painetaan kierroksia k&auml;ynnistimelle. Py&ouml;rit&auml; k&auml;ynnistimell&auml; niin kauan, ett&auml; moottori alkaa k&auml;yd&auml; "omillaan". Kun moottori on k&auml;ynnistynyt, s&auml;&auml;d&auml; moottorin tyhj&auml;k&auml;ynti&auml; sopivaksi - t&auml;m&auml; vaatii yleens&auml; useamman k&auml;ynnist&auml;misen. Kun kaikki tuntuisi olevan kunnossa ja kone on s&auml;&auml;detty sopivasti, voit kokeilla liikkeellel&auml;ht&ouml;&auml;.<br>
					<br>
					Kun kerran olet n&auml;inkin pitk&auml;lle p&auml;&auml;ssyt, niin otat radio-ohjaimen k&auml;teen. Hana pohjaan ja baanalle!<br>
					<br>
					Hauskoja hetki&auml;...
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

