<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Sekalaiset</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p><font color="#191970">
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>S &auml; h k &ouml; h &auml; i r i &ouml; i l t &auml; &nbsp; s u o j a u t u m i n e n</b></font>
				</td></tr>
				<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
					<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Esa Heikkinen</font>
				</td></tr>
			</table>
			</font></p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Kenties monellekin lukijalle on sattunut tilanteita, ett&auml; kesken t&auml;rke&auml;n tietokonety&ouml;n tulee sekunnin s&auml;hk&ouml;katko, joka juuri ja juuri riitt&auml;&auml; resetoimaan koneen. Mahdollisesti monenkin tunnin ty&ouml; on hukassa. Tai ehk&auml;p&auml; menossa oli kiintolevyn defragmentointi, ja s&auml;hk&ouml;jen katkeaminen kesken toimenpiteen johtikin siihen, ett&auml; kiintolevy meni sekaisin, eik&auml; sit&auml; voi en&auml;&auml; korjata mill&auml;&auml;n korjausohjelmalla. Yht&auml; hyvin sama voisi sattua ahkeralle pelaajalle; kaikkien aikojen enn&auml;tys menossa flipperiss&auml;, peli&auml; olisi viel&auml; j&auml;ljell&auml;, ja sitten kaikki yll&auml;tt&auml;en sammuukin...<br>
					<br>
					T&auml;llaisia tilanteita ei osaa pel&auml;t&auml;, ennen kuin sellainen sattuu omalle kohdalle. Niin kauan kuin t&auml;t&auml; ei ole itselle sattunut, ei siit&auml; viitsi piitata. Vasta sen keljun tunteen kokeminen, joka tulee sill&auml; hetkell&auml; kun hartaalla keskittymisell&auml; tehty ty&ouml; yll&auml;tt&auml;en katosi, samalla kun valotkin sammuivat koko talosta, saa vastaisuudessa olemaan varovaisempi.<br>
					<br>
					Vanha varma tapa on tallentaa ty&ouml; mahdollisimman usein. T&auml;ss&auml;kin on kuitenkin vaaransa: mit&auml;p&auml; jos s&auml;hk&ouml;t katkeavat juuri tallennushetkell&auml;? Levyll&auml; ollut tiedosto ehdittiin korvata uudella, jonka sis&auml;lt&ouml;&auml; ei ehditty kirjoittaa loppuun. Tilanne on t&auml;ll&ouml;in sama kuin jos tallentaisit vahingossa tekem&auml;si tiedoston p&auml;&auml;lle tyhj&auml;n tiedoston. Se on ottamaton paikka: mik&auml;&auml;n korjausohjelma ei osaa palauttaa sellaista tuhottua tiedostoa, jonka p&auml;&auml;lle on kirjoitettu samalla nimell&auml; jotakin muuta.<br>
					<br>
					No - ainahan on varmuuskopiot, vai onko? Harva jaksaa tehd&auml; niit&auml; p&auml;ivitt&auml;in, ja yleens&auml; ilman kunnollisia v&auml;lineit&auml; (nauha-asema yms.) j&auml;&auml; varmuuskopioiden tekeminen muutamaan kertaan vuodessa - n&auml;in my&ouml;s allekirjoittaneella. Koneella on jatkuvasti jonkin verran sellaisia t&ouml;it&auml;, joista ei ole varmuuskopioita.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Yleisimm&auml;t s&auml;hk&ouml;h&auml;iri&ouml;t</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Asuinpaikan ymp&auml;rist&ouml; ratkaisee, millaisia s&auml;hk&ouml;h&auml;iri&ouml;it&auml; verkossa voi olla. Yleisin ja kaikkialla ainakin silloin t&auml;ll&ouml;in esiintyv&auml; h&auml;iri&ouml; on s&auml;hk&ouml;katko (blackout). S&auml;hk&ouml;katkon aikana s&auml;hk&ouml; katoaa pistorasioista kokonaan. S&auml;hk&ouml;katkot voisi jaotella karkeasti kolmeen ryhm&auml;&auml;n. Lyhimm&auml;t, noin sekunnin tai alle kest&auml;v&auml;t ovat nk. pikaj&auml;lleenkytkent&ouml;j&auml;, jotka kuuluvat tavallaan normaaliin s&auml;hk&ouml;njakeluun. Jo t&auml;llainen katko voi resetoida tietokoneen. Seuraavana tulevat muutaman minuutin katkot, joiden yleisin aiheuttaja on ukkonen. Salaman iskiess&auml; sopivaan kohtaan s&auml;hk&ouml;njakeluverkkoa aiheutuu oikosulku, ja s&auml;hk&ouml;njakelu lakkaa muutamaksi minuutiksi.<br>
					<br>
					Kolmannen ryhm&auml;n muodostavat pitk&auml;t s&auml;hk&ouml;katkot, vartista useisiin tunteihin. N&auml;m&auml; ovat poikkeuksetta jonkin suuremman &auml;killisen vian aiheuttamia, ja sellaista vikaa voi joutua etsim&auml;&auml;n pitk&auml;&auml;nkin. Yleisin syy ainakin t&auml;&auml;ll&auml; p&auml;in on myrskyn voimalinjalle kaatama puu, joka aiheuttaa oikosulun. Yleens&auml; t&auml;llaiset pitk&auml;t katkot alkavat siten, ett&auml; s&auml;hk&ouml;n katkettua tulee hetken kuluttua useita yrityksi&auml; k&auml;ynnist&auml;&auml; s&auml;hk&ouml;verkko, mutta oikosulun vuoksi s&auml;hk&ouml;njakelu lakkaa aina muutamassa sekunnissa.<br>
					<br>
					T&auml;ss&auml; jonkin aikaa sitten oli y&ouml;ll&auml; reilun tunnin mittainen katko, joka johtui kaatuneesta puusta. Muistan hyvin, kun katkon alettua tuli n&auml;it&auml; lyhyit&auml; testej&auml;, ja samanaikaisesti loisti ulkoa kirkas sinert&auml;v&auml; loimu. Seuraavana p&auml;iv&auml;n&auml; kuulin, ett&auml; puu oli kaatunut linjalle t&auml;ss&auml; ihan l&auml;hitienoolla, ja tuo todella kirkas valo loisti puun ja voimalinjan v&auml;lille syntyneest&auml; valokaaresta! Kuivana aikana t&auml;llaisesta voi aivan hyvin sytty&auml; mets&auml;palo.<br>
					<br>
					Toinen s&auml;hk&ouml;h&auml;iri&ouml;tyyppi, joka on ainakin t&auml;&auml;ll&auml; yleinen talvisin, on lyhytaikainen alij&auml;nnite (brownout). T&auml;m&auml;n n&auml;kee mm. valaistuksen hetkellisin&auml;, yleens&auml; alle sekunnin mittaisina "himmentymin&auml;". Talvisin tietyll&auml; kelill&auml; ker&auml;&auml;ntyy voimalinjoihin lumikerros, joka aiheuttaa l&auml;pily&ouml;ntej&auml;. N&auml;m&auml; l&auml;pily&ouml;nnit eiv&auml;t kuitenkaan muodosta oikosulkua, vaan kuormittavat verkkoa juuri sen verran, ett&auml; s&auml;hk&ouml;verkon suojaukset eiv&auml;t laukea, mutta ilmi&ouml; n&auml;kyy alij&auml;nnitteen&auml; s&auml;hk&ouml;njakelussa.<br>
					<br>
					My&ouml;s ukkosella salaman iskiess&auml; voimalinjoihin tai niiden l&auml;heisyyteen n&auml;kyy se t&auml;ll&auml; tavoin s&auml;hk&ouml;verkossa. Salamahan on tasavirtaa, joten se ei p&auml;&auml;se l&auml;pi muuntajista, ja siksi se n&auml;kyy kotitalouksissa alij&auml;nnitteen&auml; eik&auml; p&auml;invastoin, kuten nopeasti voisi luulla. T&auml;&auml;ll&auml; p&auml;in ukkosen saapumisen n&auml;kee s&auml;hk&ouml;h&auml;iri&ouml;in&auml; jo kauan ennen kuin alkaa jyrist&auml;. Muutaman alij&auml;nniteh&auml;iri&ouml;n j&auml;lkeen s&auml;hk&ouml;t monesti katkeavat kokonaan, ja samalla alkaakin jo jyrist&auml;...<br>
					<br>
					S&auml;hk&ouml;katkoja harvinaisempia s&auml;hk&ouml;njakelun h&auml;iri&ouml;it&auml; ovat yli- tai alij&auml;nnitteet. T&auml;llaiset voivat johtua esimerkiksi siit&auml;, ett&auml; jokin todella suurikulutuksinen laite esimerkiksi teollisuudessa kytket&auml;&auml;n verkkoon, ja j&auml;nnite t&auml;st&auml; syyst&auml; laskee. Ylij&auml;nnite voi taas synty&auml;, kun t&auml;llainen laite kytket&auml;&auml;n irti verkosta. T&auml;llaiset ovat kuitenkin varsin harvinaisia, l&auml;hinn&auml; suurien tehtaiden l&auml;heisyydess&auml; t&auml;t&auml; h&auml;iri&ouml;tyyppi&auml; saattaa esiinty&auml;.<br>
					<br>
					T&auml;st&auml; on kuitenkin olemassa er&auml;s merkitt&auml;v&auml; poikkeus, eli maaseudulla k&auml;ytett&auml;v&auml;t ilmalinjat, jotka kuljettavat normaalia valovirtaa suoraan m&ouml;kkeihin (ts. linjojen ja talouksien v&auml;liss&auml; ei ole muuntajaa). T&auml;llaiset ilmalinjat toimivat er&auml;&auml;nlaisina antenneina, ja ukkosella salaman iskiess&auml; linjan l&auml;heisyyteenkin muodostuu niihin varsin voimakas j&auml;nnitepiikki. T&auml;llaiselta j&auml;nnitepiikilt&auml; ei voi k&auml;yt&auml;nn&ouml;ss&auml; suojautua muuten kuin ottamalla t&ouml;pselit irti ukkosen ajaksi.<br>
					<br>
					Nelj&auml;nnen h&auml;iri&ouml;ryhm&auml;n muodostavat ep&auml;puhtaudet kuten esimerkiksi harmoninen s&auml;r&ouml;. Mm. hakkurivirtal&auml;hteet, loisteputket, tyristoriohjatut laitteet ja moottorit kuormittavat s&auml;hk&ouml;verkkoa ep&auml;tasaisesti, ja samalla ne ik&auml;&auml;n kuin l&auml;hett&auml;v&auml;t h&auml;iri&ouml;it&auml; s&auml;hk&ouml;verkkoon. N&auml;ist&auml; ei yleens&auml; ole harmia, mik&auml;li laitteessa on kunnolliset verkkosuotimet, mutta kuitenkin toisinaan syntyy tilanne, jossa arka laite taikka suurempi laitekokonaisuus alkaa oirehtia esimerkiksi siten, ett&auml; jonkin audiolaitteen kautta alkaa kuulua pesukoneen moottorin k&auml;ydess&auml; hiljaista pirin&auml;&auml;.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Vaarat</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					S&auml;hk&ouml;katkon aiheuttama vaara tietokoneille lienee kaikille selv&auml;. Sen sijaan muut h&auml;iri&ouml;tyypit voivat tapauksesta ja laitteista riippuen joko aiheuttaa tai olla aiheuttamatta h&auml;iri&ouml;it&auml;. Lyhytaikaiset alij&auml;nnitteet (brownout) aiheuttavat harvemmin h&auml;iri&ouml;it&auml; tietokoneille. Nykyaikaiset tietokoneet ja monet muutkin laitteet k&auml;ytt&auml;v&auml;t hakkurivirtal&auml;hteit&auml;, jotka osaavat mukautua alij&auml;nnitteisiin. Hakkurivirtal&auml;hde saattaa toimia aivan t&auml;ydellisesti, vaikka j&auml;nnite olisi vain 50% normaalista! Jotkut hakkurivirtal&auml;hteet on jopa suunniteltu "universaaleiksi" eli ne toimivat suoraan kaikilla k&auml;yt&ouml;ss&auml; olevilla verkkoj&auml;nnitteill&auml;.<br>
					<br>
					Koska hakkurivirtal&auml;hteen on kuitenkin tuotettava kaikissa tilanteissa kuorman kuluttama teho, tiet&auml;&auml; j&auml;nnitteen laskeminen virran kasvua. (Tehon laki: teho (P) on yht&auml; kuin j&auml;nnite (U) kertaa virta (I). T&auml;m&auml;n takia pitk&auml;aikainen alij&auml;nnite voikin ylikuormittaa s&auml;hk&ouml;verkkoa, mik&auml;li kuormana on runsaasti hakkurivirtal&auml;hteill&auml; varustettuja laitteita. Virran noustua kylliksi s&auml;hk&ouml;verkko pett&auml;&auml; jostain paikkaa - yleens&auml; sulake palaa. &Auml;kki&auml; ajateltuna voi kuulostaa omituiselta, ett&auml; alij&auml;nnite voisi polttaa sulakkeen, mutta t&auml;ll&auml; tavalla se on mahdollista.<br>
					<br>
					Ylij&auml;nnitteen aiheuttamat vaarat ovat helpommin ymm&auml;rrett&auml;vi&auml;. Laitteiden komponentit (esimerkiksi virtal&auml;hteiden kondensaattorit) on mitoitettu tietylle j&auml;nnitteelle, jota ei saa ylitt&auml;&auml;. Mik&auml;li t&auml;m&auml; arvo ylitet&auml;&auml;n, syntyy esimerkiksi kondensaattorin sis&auml;ll&auml; l&auml;pily&ouml;nti, joka johtaa tavallisimmin kondensaattorin r&auml;j&auml;ht&auml;miseen. Virtal&auml;hteen tyypist&auml; riippumatta se vaurioituu saadessaan liikaa j&auml;nnitett&auml;. Ylij&auml;nnitteen suuruudesta riippuen vauriot syntyv&auml;t joko v&auml;litt&ouml;m&auml;sti tai ajan kanssa. Pitk&auml;aikainen liev&auml; ylij&auml;nnite ei riko laitetta heti, mutta aiheuttaa ylikuumenemista ja sit&auml; kautta ik&auml;&auml;ntymist&auml; ja ennenaikaisen vikaantumisen. Ukkosen aiheuttamat lyhytaikaiset mutta voimakkaat ylij&auml;nnitteet ovat vaarallisimpia - niiden kautta syttyy vuosittain useita tulipalojakin.<br>
					<br>
					Harmoniseen s&auml;r&ouml;&ouml;n perustuvat h&auml;iri&ouml;t ovat mutkikkaampia. Ne voivat oireilla esimerkiksi tietokonej&auml;rjestelmien selitt&auml;m&auml;tt&ouml;min&auml; lukkiintumisina, l&auml;hiverkon toimimattomuutena, nopeuden laskuna tai muina lievempin&auml; ilmi&ouml;in&auml;, joita on mahdoton paikantaa mihink&auml;&auml;n tiettyyn laitteeseen. N&auml;iden syntyper&auml; voi olla mielenkiintoinen selvitett&auml;v&auml;, ja ne voivat esiinty&auml; mm. maadoitush&auml;iri&ouml;n&auml; (ground noise), yhteismuotoisena (common mode noise) tai yleismuotoisena h&auml;iri&ouml;n&auml;.<br>
					<br>
					H&auml;iri&ouml;n muoto ratkaisee, miten se esiintyy voimakkaimmillaan: maadoituksen ja s&auml;hk&ouml;nsy&ouml;t&ouml;n v&auml;lill&auml;, s&auml;hk&ouml;nsy&ouml;t&ouml;n napojen v&auml;lill&auml; vai esimerkiksi eri puolilla taloa sijaitsevien pistorasioiden maadoitusten v&auml;lill&auml;. Kunkin laitteen sis&auml;iset kytkenn&auml;t ratkaisevat, mille h&auml;iri&ouml;tyypille ne ovat herkimpi&auml;. Pahimmassa asemassa ovat laitteet, jotka liittyv&auml;t s&auml;hk&ouml;verkon lis&auml;ksi johonkin toiseen verkkoon. Jommassa kummassa verkossa esiintyv&auml; yhteismuotoinen h&auml;iri&ouml; kytkeytyy verkkoja yhdist&auml;v&auml;&auml;n laitteeseen, esimerkiksi l&auml;hiverkossa olevaan tietokoneeseen, modeemiin tai ISDN-p&auml;&auml;tteeseen.<br>
					<br>
					Helppona esimerkkin&auml; yhteismuotoisesta (common mode) ylij&auml;nnitepiikist&auml; voidaan esitt&auml;&auml; tyypillinen ukkosen aiheuttama tietokonevika kaupunkiymp&auml;rist&ouml;ss&auml;. Talossa on maakaapelointi. S&auml;hk&ouml;nsy&ouml;tt&ouml;kaapelointi ja puhelinkaapelointi tulevat taloon eri pisteist&auml;. Puhelinlinjaan on liitetty puhelin sek&auml; tietokone, jossa on modeemi. Salama iskee talon l&auml;hell&auml; olevaan puuhun (ei suoraan s&auml;hk&ouml;- eik&auml; puhelinverkkoon). Modeemi ja tietokone rikkoutuvat (esimerkiksi er&auml;&auml;ss&auml; tapauksessa modeemin linjaelektroniikka oli sulaneena &auml;&auml;nikortin kyljess&auml;), mutta puhelin s&auml;ilyi ehj&auml;n&auml;. Mik&auml;&auml;n s&auml;hk&ouml;verkkoon kytketty laitekaan ei rikkoontunut. Mihin t&auml;m&auml; perustuu?<br>
					<br>
					Vastaus: Salaman aiheuttama ylij&auml;nnitepiikki n&auml;kyi yhteismuotoisena puhelinverkossa. Sit&auml; ei havaita yksist&auml;&auml;n s&auml;hk&ouml;verkon sy&ouml;tt&ouml;napojen v&auml;lilt&auml; eik&auml; puhelinverkossa. Mutta jos tarkastellaan asiaa niin, ett&auml; unohdetaan s&auml;hk&ouml;- ja puhelinverkon kytkent&auml;napojen v&auml;liset potentiaalit ja ajatellaan tavallaan kumpaakin vain yhten&auml; "napana", esiintyi n&auml;iden v&auml;lill&auml; salaman iskemishetkell&auml; jopa kymmenien kilovolttien j&auml;nnitepiikki. Homma perustuu siihen, ett&auml; kun salama iskee talon l&auml;hell&auml; olevaan puuhun, muodostuu maahan sek&auml; ymp&auml;r&ouml;iv&auml;&auml;n ilmaan j&auml;nnitett&auml;, jota voi esiinty&auml; jopa satoja voltteja per metri. Kun puhelin- ja s&auml;hk&ouml;kaapeloinnit kulkevat eri suuntiin talosta, muodostuu niiden v&auml;lille j&auml;nnitepiikki, vaikka esimerkiksi puhelinverkossa ei esiinny ylij&auml;nnitett&auml;. Jos modeemi olisi irrotettu puhelinverkosta, olisi se ja tietokone s&auml;ilynyt ehjin&auml;, vaikka niiss&auml; olisi ollut jopa virtakin p&auml;&auml;ll&auml;.<br>
					<br>
					Yhteismuotoiselta ylij&auml;nnitepiikilt&auml; suojautuminen on k&auml;yt&auml;nn&ouml;ss&auml; todella vaikeaa, ja varminta onkin irrottaa ukkosen yll&auml;tt&auml;ess&auml; kaikki sellaiset laitteet, joista on yhteys kahteen eri verkkoon (modeemi, l&auml;hiverkko mik&auml;li se menee toiseen rakennukseen, televisio yms.). T&auml;m&auml;n lis&auml;ksi maaseudulla tulee muistaa, ett&auml; ilmalinjat aiheuttavat my&ouml;s yleismuotoisia h&auml;iri&ouml;it&auml;, joissa ylij&auml;nnitepiikki tulee suoraan rasiasta sellaisenaan. Maaseudulla onkin hyv&auml; irrottaa kaikki laitteet s&auml;hk&ouml;- sek&auml; puhelinverkosta ukkosella.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Ylij&auml;nnitesuojat</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Sek&auml; s&auml;hk&ouml;- ett&auml; puhelinverkkoihin on saatavana ylij&auml;nnite- tai ukkossuojia (surge protector), jotka suojaavat laitteita yleismuotoisilta h&auml;iri&ouml;ilt&auml;. Ne suojaavat esimerkiksi s&auml;hk&ouml;verkon ylij&auml;nnitteelt&auml; polttamalla sulakkeet tai tuhoutumalla itse. Jotkut suojat voivat kest&auml;&auml; hyvin lyhytaikaisen, jopa tuhansien ampeerien virran oikosulkiessaan ylij&auml;nnitepiikki&auml;. Yhteismuotoisiin h&auml;iri&ouml;ihin n&auml;m&auml; eiv&auml;t tehoa, joten edellisen esimerkin kaltaisessa tapauksessa ne eiv&auml;t tarjoa mit&auml;&auml;n suojaa. Joiltakin laitevalmistajilta on my&ouml;s saatavilla jatkojohtoja ja haaroitinrasioita, joissa on ylij&auml;nnitesuoja samassa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Verkkosuodin</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Yleens&auml; kaikissa hyvin suunnitelluissa laitteissa ja varsinkin hakkurivirtal&auml;hteiss&auml; pakollisena on jonkinlainen verkkosuodin. T&auml;m&auml; on kondensaattoreista ja keloista rakennettu kytkent&auml;, jonka tarkoitus on suodattaa verkkos&auml;hk&ouml;ss&auml; mahdollisesti olevia harmonisia h&auml;iri&ouml;it&auml;. Hakkurivirtal&auml;hteess&auml; verkkosuotimella on suuri merkitys, sill&auml; hakkurin ensi&ouml;ss&auml; toimiva kytkintransistori katkoo muuntajalle/kelalle menev&auml;&auml; virtaa muutaman kymmenen kilohertsin taajuudella ja synnytt&auml;&auml; samalla eritt&auml;in voimakkaan h&auml;iri&ouml;n. T&auml;m&auml; h&auml;iri&ouml; on suodatettava pois, jottei se p&auml;&auml;sisi s&auml;hk&ouml;verkkoon h&auml;iritsem&auml;&auml;n muita laitteita. Moni on saattanut havaita, ett&auml; kytkett&auml;ess&auml; verkkojohtoa kiinni tietokoneeseen, jonka virta ei ole p&auml;&auml;ll&auml;, saattaa kytkent&auml;hetkell&auml; kuulua pieni napsaus tai n&auml;ky&auml; pieni kipin&auml;. T&auml;m&auml; on normaalia ja kertoo siit&auml;, ett&auml; verkkosuodin toimii. Kipin&ouml;inti johtuu verkkosuotimessa olevien kondensaattorien &auml;killisest&auml; latautumisesta kytkent&auml;hetkell&auml;.<br>
					<br>
					Hyvin yleisesti verkkosuotimessa on kytketty kondensaattorit my&ouml;s suojamaahan kummastakin navasta. N&auml;iden kondensaattorien on tarkoitus suodattaa yhteismuotoisia h&auml;iri&ouml;it&auml;. N&auml;iden kondensaattorien vuoksi ei tietokonetta saa koskaan kytke&auml; maadoittamattomaan pistorasiaan. Jos n&auml;in tehd&auml;&auml;n, j&auml;&auml; suojamaa "kellumaan" ja siihen (ja samalla laitteen runkoon) muodostuu potentiaali, joka on puolet verkkoj&auml;nnitteen suuruudesta (115 Vac). Kytkett&auml;ess&auml; muita laitteita koneeseen on vaarana, ett&auml; jokin IO-portti tai kytkett&auml;v&auml; laite vioittuu tuon j&auml;nnitteen vuoksi. Lis&auml;ksi siit&auml; saa ep&auml;mukavia s&auml;hk&ouml;iskuja. Liikuttamalla kevyesti sormea t&auml;llaisen laitteen pinnalla voi tuntea verkkotaajuista "v&auml;rin&auml;&auml;". T&auml;m&auml; on selv&auml; merkki siit&auml;, ett&auml; laitteen maadoitus ei ole kunnossa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Stabilisaattorit</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Olemassa on my&ouml;s verkkoj&auml;nnitestabilisaattoreita, jotka korjaavat pitk&auml;aikaisia yli- tai alij&auml;nnitteit&auml;. Stabilisaattoriin kytketyt laitteet saavat aina vakioj&auml;nnitett&auml;. Stabilisaattorissa voi olla mukana my&ouml;s verkkosuodin ja ylij&auml;nnitesuoja. Stabilisaattorit eiv&auml;t suojaa s&auml;hk&ouml;katkoilta. Suomessa n&auml;m&auml; ovat todella harvinaisia, itse en ole n&auml;hnyt "liven&auml;" t&auml;llaista koskaan.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>UPS</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Uninterruptible Power Source (UPS) tarjoaa yhdess&auml; paketissa laajimman suojan erilaisia s&auml;hk&ouml;h&auml;iri&ouml;it&auml; vastaan. UPSin tyyppi (ja k&auml;yt&auml;nn&ouml;ss&auml; hinta) ratkaisee sen, miten laajamittaisen suojan laite tarjoaa. UPSeja on markkinoilla runsaasti erilaisia, halvimpia saa jo alle tuhannella markalla, kalleimmat maksavat kymmeni&auml; tuhansia. Kaikki UPSit toimivat samalla p&auml;&auml;periaatteella, mutta teknisess&auml; toteutuksessa on eroja. UPSin yleisimmin k&auml;sitetty p&auml;&auml;teht&auml;v&auml; on suojata s&auml;hk&ouml;katkoilta. S&auml;hk&ouml;njakelun toimiessa normaalisti se lataa akkujaan, ja s&auml;hk&ouml;katkon sattuessa se tuottaa verkkos&auml;hk&ouml;n korvaavaa vaihtos&auml;hk&ouml;&auml; siihen kytketyille laitteille. Laitteet pysyv&auml;t s&auml;hk&ouml;katkon yli k&auml;ynniss&auml;, mik&auml;li UPSin akustossa vain riitt&auml;&auml; virtaa.<br>
					<br>
					UPS rakentuu v&auml;hint&auml;&auml;n kolmesta p&auml;&auml;osasta: akkulaturi/tasasuuntaaja, akusto ja invertteri (vaihtosuuntaaja). Akkulaturi lataa akustoa silloin kun s&auml;hk&ouml;njakelu toimii normaalisti. Invertteri tekee akuston tasas&auml;hk&ouml;st&auml; verkkos&auml;hk&ouml;n kaltaista vaihtos&auml;hk&ouml;&auml;. N&auml;iden p&auml;&auml;osien tekninen toteutus ja keskin&auml;iset kytkenn&auml;t ratkaisevat sen, miten hyv&auml;n suojan erilaisia s&auml;hk&ouml;h&auml;iri&ouml;it&auml; vastaan UPS tuottaa, ja vaikuttavat samalla my&ouml;s laitteen hintaan.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Aaltomuodot</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Er&auml;s UPSin hinnan kanssa rinnan kulkeva p&auml;&auml;ominaisuus on aaltomuoto, jota invertteri tuottaa. S&auml;hk&ouml;verkosta saatava j&auml;nnite on sinimuotoista. Sinimuotoisen s&auml;hk&ouml;n tuottaminen akkujen tasas&auml;hk&ouml;st&auml; on kuitenkin hyvin mutkikasta ja aiheuttaa tehoh&auml;vi&ouml;it&auml;. Siksi pieniss&auml;, yhdelle tai kahdelle tietokoneelle tarkoitetuissa UPSeissa k&auml;ytet&auml;&auml;n yleisesti kanttiaaltoa tai porrasaaltoa. Hakkurivirtal&auml;hteille s&auml;hk&ouml;n aaltomuodolla ei ole merkityst&auml;, koska niiss&auml; sis&auml;&auml;ntuleva s&auml;hk&ouml; tasasuunnataan heti ensimm&auml;isen&auml;, joten ne toimivat vaikka kanttiaallolla. Puhdas kanttiaalto voi kuitenkin ylikuormittaa tasasuuntausdiodeita, jolloin on vaarana virtal&auml;hteen vikaantuminen. Siksi uudemmissa pikku-UPSeissa k&auml;ytet&auml;&auml;nkin porrasaaltoa. Se vastaa l&auml;hemmin aitoa siniaaltoa tehoarvoiltaan ja on siksi turvallisempi vaihtoehto kanttiaallolle, mutta silti helposti ja hyv&auml;ll&auml; hy&ouml;tysuhteella tuotettavissa.<br>
					<br>
					<center><img src="kuvat/aaltomuodot.jpg" width="430" height="196" alt="Aaltomuodot"></center>
					<br>
					Suuritehoiset UPSit tekev&auml;t poikkeuksetta puhdasta siniaaltoa. Niiss&auml; olevat suuret akustot takaavat sen, ett&auml; virta riitt&auml;&auml; huonommasta hy&ouml;tysuhteesta huolimatta. Sinimuotoinen j&auml;nnite takaa yhteensopivuuden kaikentyyppisten kuormien kanssa, joten t&auml;llaiseen UPSiin voi huoletta liitt&auml;&auml; kaikentyyppisi&auml; laitteita.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Online-UPS</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Yksinkertaisin, mutta ei halvin, on perinteinen online-UPS. Vanhat ja suurikokoiset UPSit toimivat t&auml;ll&auml; periaatteella. Online-UPS saa nimens&auml; siit&auml;, ett&auml; sen invertteri on jatkuvasti p&auml;&auml;ll&auml;. Per&auml;&auml;n kytketyt kuormat saavat jatkuvasti vain UPSin tuottamaa s&auml;hk&ouml;&auml;. Sis&auml;&auml;n tuleva verkkos&auml;hk&ouml; vied&auml;&auml;n suoraan suuritehoiselle DC-virtal&auml;hteelle, jolta saatavalla virralla ladataan samanaikaisesti akkuja ja sy&ouml;tet&auml;&auml;n invertteri&auml;. Online-UPS tekee verkkos&auml;hk&ouml;n kokonaan uusiksi.<br>
					<br>
					<center><img src="kuvat/online.jpg" width="377" height="59" alt="Online"></center>
					<br>
					Online-UPS tarjoaa parhaimman suojan kaikenlaisia verkkoh&auml;iri&ouml;it&auml; vastaan. Harmoniset h&auml;iri&ouml;t, yli- tai alij&auml;nnitepiikit tai s&auml;hk&ouml;katko eiv&auml;t aiheuta mink&auml;&auml;nlaisia muutoksia ulostulevaan j&auml;nnitteeseen niin kauan kuin akustossa riitt&auml;&auml; virtaa. Ylij&auml;nnitesuojaus on ehdoton, pahimmissakin tapauksissa UPS suojaa kuormiaan, mutta voi rikkoutua itse. Online-UPS tarjoaa my&ouml;s t&auml;ydellisen suojan pitk&auml;aikaisia ali- tai ylij&auml;nnitteit&auml; vastaan, sill&auml; se antaa aina samaa j&auml;nnitett&auml; ulos. Siten se tarjoaa samalla my&ouml;s stabilisaattorin tuomat ominaisuudet.<br>
					<br>
					Perinteisess&auml; online-UPSissa on kuitenkin huonojakin puolia. Ensinn&auml;kin tarvitaan kaksi hyvin suurikokoista ja painavaa muuntajaa, toinen DC-virtal&auml;hdett&auml; ja toinen invertteri&auml; varten. N&auml;m&auml; tekev&auml;t laitteesta helposti isokokoisen. Toiseksi, kun kaikki kuormien kuluttama teho kulkee t&auml;llaisen j&auml;rjestelm&auml;n l&auml;pi, tulee UPSin hy&ouml;tysuhde n&auml;kyviin. Perinteisen online-UPSin hy&ouml;tysuhde voi olla esimerkiksi 60%, jolloin kuormien viem&auml; teho kertaantuu yli 1,6-kertaiseksi. Laite nostaa s&auml;hk&ouml;laskua siin&auml; m&auml;&auml;rin, ett&auml; sill&auml; voidaan katsoa olevan merkitt&auml;v&auml;sti k&auml;ytt&ouml;kustannuksia. Hukkateho muuttuu tietenkin l&auml;mm&ouml;ksi, joka voi olla ongelmallista.<br>
					<br>
					Kolmas huono puoli on kuormille n&auml;kyv&auml;n s&auml;hk&ouml;nsy&ouml;t&ouml;n impedanssin, varsinkin sen reaktiivisen osan, kohoaminen verrattuna aitoon s&auml;hk&ouml;verkkoon. T&auml;m&auml; n&auml;kyy k&auml;yt&auml;nn&ouml;ss&auml; mm. siten, ett&auml; monitorin yms. laitteen k&auml;ynnistys, joka rep&auml;isee suuren hetkellisen virtapiikin, pudottaa UPSin ulostuloj&auml;nnitteen alas hetkellisesti. UPS ei kerta kaikkiaan jaksa sy&ouml;tt&auml;&auml; virtaa t&auml;llaisessa tilanteessa, ja syntyy lyhyt s&auml;hk&ouml;katko - UPSin l&auml;ht&ouml; "notkuu". T&auml;m&auml; voi johtaa esimerkiksi tietokoneen resetoitumiseen. Silloin alkuper&auml;inen k&auml;ytt&ouml;tarkoitus sy&ouml; merkityksens&auml;. Nelj&auml;nten&auml; miinuksena voidaan laskea my&ouml;s se, ett&auml; vanhojen online-UPSien taajuustarkkuus on huono: niiden tuottama s&auml;hk&ouml; ei v&auml;ltt&auml;m&auml;tt&auml; ole 50 Hz:n taajuista. T&auml;st&auml; on harmia etenkin silloin, jos UPSin per&auml;ss&auml; on jokin ajastin tai kello: se ei pysy ajassa.<br>
					<br>
					Uudemmissa online-UPSeissa on kuitenkin ratkaistu monia perinteisen online-UPSin puutteita. Er&auml;s varhaisimmista parannuksista on ns. ohituskytkent&auml;, joka korjaa notkumisen. Hetkellisen ylikuormituksen sattuessa ottaa UPS virtaa suoraan verkosta, ja n&auml;in ollen notkahdusta kuormien sy&ouml;t&ouml;ss&auml; ei p&auml;&auml;se tapahtumaan. Taajuustarkkuus voidaan saavuttaa helposti k&auml;ytt&auml;m&auml;ll&auml; mikroprosessoripohjaista toteutusta taikka kiteeseen tahdistettua invertteri&auml;. Isot muuntajat voidaan korvata hakkuritekniikalla. T&auml;m&auml; tekniikka my&ouml;s pienent&auml;&auml; sy&ouml;t&ouml;n impedanssia. Kuormien kannalta se n&auml;ytt&auml;&auml; yh&auml; enemm&auml;n aidolta s&auml;hk&ouml;verkolta.<br>
					<br>
					T&auml;ll&auml; asialla on merkityst&auml; l&auml;hinn&auml; silloin, jos per&auml;ss&auml; on hankala sekakuorma, joka kuormittaa hyvin ep&auml;tasaisesti (loistehoa tuottavat kuormat). Ei-toivottu reaktanssi johtaisi t&auml;ll&ouml;in tehoh&auml;vi&ouml;ihin. Hakkuritekniikalla toteutetun online-UPSin hy&ouml;tysuhde on hyvin korkea, tyypillisesti yli 90% - siksi se ei my&ouml;sk&auml;&auml;n tuota l&auml;mp&ouml;&auml; merkitt&auml;v&auml;sti. Ainoa huono puoli hakkuritekniikalla toteutetussa online-UPSissa on sen korkeahko hinta, joka liikkuu kymmenen kilomarkan pahemmalla puolella.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Offline-UPS</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Klassinen offline-UPS (standby UPS) on hieman mutkikkaampi kuin online, mutta halvempi toteuttaa. Siksi t&auml;t&auml; periaatetta k&auml;ytet&auml;&auml;nkin pieniss&auml; UPSeissa. Nimens&auml; mukaisesti t&auml;ll&auml; periaatteella toimiva UPS on normaalitilanteen vallitessa "nukkumassa". Se lataa akkujaan pienitehoisella akkulaturilla, ja invertteri on kytketty pois p&auml;&auml;lt&auml;. Verkkos&auml;hk&ouml;&auml; sy&ouml;tet&auml;&auml;n sellaisenaan laitteen l&auml;pi.<br>
					<br>
					S&auml;hk&ouml;katkon sattuessa laitteessa oleva elektroniikka tunnistaa tilanteen ja kytkee nopeasti invertterin p&auml;&auml;lle ja per&auml;ss&auml; olevat laitteet releell&auml; (transfer switch) s&auml;hk&ouml;verkosta invertterin ulostuloon. S&auml;hk&ouml;jen palauduttua laite tahdistaa invertterin ulostulon s&auml;hk&ouml;verkon taajuuteen ja vaiheeseen, mink&auml; j&auml;lkeen se kytkee kuormat takaisin verkkos&auml;hk&ouml;lle. J&auml;nniterajat, joilla akkuk&auml;ytt&ouml;&ouml;n siirryt&auml;&auml;n, voivat olla k&auml;ytt&auml;j&auml;n aseteltavissa.<br>
					<br>
					<center><img src="kuvat/offline.jpg" width="423" height="109" alt="Offline"></center>
					<br>
					Kytkent&auml;hetkill&auml; aiheutuu luonnollisesti lyhyit&auml; (alle 20 millisekuntia) katkoja. N&auml;ist&auml; ei kuitenkaan aiheudu mit&auml;&auml;n haittaa tietokoneille, koska virtal&auml;hteiden kondensaattoreihin varautunut s&auml;hk&ouml; kykenee k&auml;ytt&auml;m&auml;&auml;n konetta tuon ajan.<br>
					<br>
					Offline-UPSin huono puoli on sen heikommat suodatusominaisuudet. Koska verkkos&auml;hk&ouml; menee laitteesta l&auml;pi sellaisenaan, ei laite tarjoa vastaavaa suojaa kuormalle kuin online-UPS. Nykyaikaisessa offline-UPSissa on kuitenkin tehokas verkkosuodin, jonka avulla harmoniset h&auml;iri&ouml;t saadaan varsin hyvin kuriin. Lis&auml;ksi laitteessa voi olla ylij&auml;nnitesuoja, joka est&auml;&auml; hetkellisten piikkien p&auml;&auml;syn kuormaan, ja viimek&auml;dess&auml; UPS rikkoontuu itse ennen kuin kuormalle tapahtuu mit&auml;&auml;n. Nykyaikainen offline-UPS tunnistaa my&ouml;s ali- tai ylij&auml;nnitteen ja kytkee kuormat akkuk&auml;yt&ouml;lle suojatakseen niit&auml;. Mik&auml;li h&auml;iri&ouml; on kuitenkin pitk&auml;kestoinen, on vaarana akkujen tyhjentyminen.<br>
					<br>
					Offline-UPSin hy&ouml;tysuhde on toimintaperiaatteen takia korkea. Normaalitilanteessahan laite ei lis&auml;&auml; s&auml;hk&ouml;nkulutusta muuta kuin sen verran, mit&auml; sen pieni akkulaturi ja ohjauselektroniikka vaativat (muutama watti). Olemattomat k&auml;ytt&ouml;kustannukset yhdistettyn&auml; laitteiden pieneen kokoon (mahtuu jopa p&ouml;yd&auml;lle) ja edullisuuteen ovatkin tehneet niist&auml; suosittuja. My&ouml;s offline-UPS voidaan toteuttaa hakkuritekniikalla.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Line-interactive-UPS</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					T&auml;m&auml; periaate on yleistym&auml;ss&auml; uudemmissa UPSeissa. Toteutus muistuttaa hieman offline-UPSia, mutta eroaa silti varsin merkitt&auml;v&auml;sti. Erikoisuus on, ett&auml; invertteri on aina kytkettyn&auml; ulostuloon aivan kuin online-UPSissa, mutta normaalitilanteessa se ei ole k&auml;ynniss&auml;. Invertteri on rakennettu sellaiseksi, ett&auml; se toimii normaalitilanteessa ik&auml;&auml;n kuin p&auml;invastoin, akkuja ladaten. Kytkent&auml;rele on verkkoj&auml;nnitesy&ouml;t&ouml;ss&auml; eik&auml; invertterin j&auml;lkeen, kuten offline-UPSissa. Normaalitilanteessa verkkos&auml;hk&ouml; menee sellaisenaan laitteen l&auml;pi.<br>
					<br>
					S&auml;hk&ouml;katkon yll&auml;tt&auml;ess&auml; laitteessa oleva elektroniikka tunnistaa tilanteen, k&auml;ynnist&auml;&auml; invertterin ja samalla avaa kytkent&auml;releen, jottei invertterin ulostulo oikosulkeutuisi s&auml;hk&ouml;verkkoon. S&auml;hk&ouml;jen palauduttua tahdistetaan invertterin ulostulo s&auml;hk&ouml;verkon taajuuteen ja vaiheeseen, mink&auml; j&auml;lkeen s&auml;hk&ouml;verkko kytket&auml;&auml;n takaisin ulostuloon ja invertteri k&auml;&auml;nnet&auml;&auml;n akkulaturiksi. Koska laturitarkoitukseen on k&auml;ytett&auml;viss&auml; sama suuritehoinen muuntaja kuin invertteriss&auml;kin, akut latautuvat nopeasti (verrattavissa online-UPSiin). J&auml;nniterajat akkuk&auml;ytt&ouml;&ouml;n siirtymiselle voivat olla k&auml;ytt&auml;j&auml;n asetettavissa.<br>
					<br>
					<center><img src="kuvat/lineinteractive.jpg" width="455" height="107" alt="Line-interactive"></center>
					<br>
					Line-interactive-toteutus tarjoaa pienemm&auml;t kytkent&auml;ajat kuin offline. Esimerkiksi siirrytt&auml;ess&auml; takaisin s&auml;hk&ouml;verkon sy&ouml;tt&ouml;&ouml;n s&auml;hk&ouml;katkon loputtua ei l&auml;hd&ouml;ss&auml; ilmene mink&auml;&auml;nlaista kytkent&auml;viiveit&auml;. Nopeus perustuu mm. siihen, ett&auml; invertterin suuritehoinen muuntaja on jatkuvasti "k&auml;ynniss&auml;", s&auml;hk&ouml;verkon vaiheessa. T&auml;llainen iso muuntaja on normaalisti raskas "k&auml;ynnistett&auml;v&auml;"; se imaisee jopa satojen ampeerien virtapiikin ensimm&auml;isen magnetoinnin aikana - se on kuin iso vauhtipy&ouml;r&auml;. Ehk&auml;p&auml; osa lukijoista on pannut merkille jotakin isompaa laitetta k&auml;ynnist&auml;ess&auml;&auml;n valaistuksen hetkellisen himmenemisen - t&auml;ss&auml; on kyse samasta asiasta. Koska line-interactive-UPSissa muuntaja on jo valmiiksi k&auml;ynniss&auml;, ei t&auml;t&auml; virtapiikki&auml; tule, ja invertteri on k&auml;ynniss&auml; viimeist&auml;&auml;n 5 millisekunnin kuluttua katkon alkamisesta.<br>
					<br>
					Lis&auml;ksi line-interactive-UPS tarjoaa stabilisaattorin. Se kykenee korjaamaan v&auml;hint&auml;&auml;n alij&auml;nnitteet nostamalla ulostulon j&auml;nnitteen sopivaksi, kuitenkaan kuluttamatta akkuja. Jotkut mallit kykenev&auml;t korjaamaan my&ouml;s ylij&auml;nnitteit&auml; tiettyyn rajaan asti, t&auml;m&auml;kin ilman akkujen kuluttamista. Invertterin ison muuntajan jatkuva kytkent&auml; ulostuloon parantaa my&ouml;s suodatusta. Koska verkkos&auml;hk&ouml; menee suoraan laitteesta l&auml;pi, on suodatuksella t&auml;ss&auml;kin keskeinen merkitys, aivan kuten offline-UPSissa. Ylij&auml;nnitesuojaus on vastaava kuin offline-UPSissa, joskin invertterin mukanaolo lis&auml;&auml; sen tehokkutta.<br>
					<br>
					Line-interactive-UPSin hy&ouml;tysuhde on offlinen tapaan hyvin korkea. Se kuluttaa s&auml;hk&ouml;&auml; l&auml;hinn&auml; vain silloin, kun akusto on tyhjill&auml;&auml;n katkon j&auml;ljilt&auml; ja sit&auml; ladataan takaisin toimintavalmiuteen. Normaalitilanteessa s&auml;hk&ouml;nkulutus on pienehk&ouml;&auml; (muutama kymmenen wattia), joskin enemm&auml;n kuin offline-UPSissa. Line-interactive-UPS voidaan sekin toteuttaa hakkuritekniikalla.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Lis&auml;toiminnot</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Uudenaikaisissa UPSeissa on runsaasti lis&auml;toimintoja. Er&auml;s hy&ouml;dyllisimmist&auml; on tietokoneliit&auml;nt&auml;. Liit&auml;nt&ouml;j&auml; on erityyppisi&auml;, sellaisia joissa saadaan vain yksinkertainen reletieto s&auml;hk&ouml;katkosta, akkujen tilasta yms. asioista, sek&auml; "&auml;lykk&auml;it&auml;", RS-232-pohjaisia liit&auml;nt&ouml;j&auml;. N&auml;iden kautta voidaan sopivalla sovellusohjelmalla kommunikoida UPSin sis&auml;isen tietokoneen kanssa. Tietokoneliit&auml;nn&auml;n avulla on mahdollista rakentaa esimerkiksi j&auml;rjestelm&auml;, joka alasajaa sovellukset automaattisesti s&auml;hk&ouml;katkon jatkuttua niin kauan ett&auml; akustot alkavat tyhjenty&auml;. Verkkoymp&auml;rist&ouml;ss&auml; t&auml;llainen toiminto on hyvin t&auml;rke&auml;.<br>
					<br>
					Jotkut UPSit kykenev&auml;t raportoimaan hyvin monenlaisia asioita tilastaan: esimerkiksi sis&auml;&auml;ntulevan j&auml;nnitteen, ulosl&auml;htev&auml;n j&auml;nnitteen, akuston j&auml;nnitteen ja varaustilan, kuormitustason prosentteina, arvioidun j&auml;ljell&auml; olevan varak&auml;yntiajan - jopa ilman l&auml;mp&ouml;tilan sek&auml; kosteuden voi saada ulos joistakin malleista. Sopivilla sovellusohjelmilla n&auml;it&auml; tietoja voi tilastoida ja kirjata yl&ouml;s mahdolliset s&auml;hk&ouml;h&auml;iri&ouml;t sekunnin tarkkuudella. My&ouml;s UPSin asetuksia (mm. j&auml;nniterajat) voi muutella tietokoneliit&auml;nn&auml;n kautta. Joissakin malleissa on my&ouml;s etupaneelissa merkkivaloja tai LCD- n&auml;ytt&ouml;, josta n&auml;kee ainakin kuormitustason. &Auml;lykk&auml;&auml;t mallit pit&auml;v&auml;t my&ouml;s huolta akuistaan, ne voivat mm. suorittaa akustolle testin vaikkapa kerran viikossa ja ilmoittaa k&auml;ytt&auml;j&auml;lle, mik&auml;li akusto vaatii uusimisen.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mitoitus</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					UPSin teho ratkaisee sen, kuinka paljon ja mink&auml;tehoisia laitteita siihen voi kytke&auml;. Maksimitehoa ei saa ylitt&auml;&auml;, muutoin on vaarana, ett&auml; UPSin sis&auml;iset suojapiirit katkaisevat virran. Offline-UPSin tapauksessa ylikuorma ei v&auml;ltt&auml;m&auml;tt&auml; ilmene kuin vasta s&auml;hk&ouml;katkon sattuessa, UPSin invertterin ollessa k&auml;ynniss&auml;. T&auml;st&auml; voi synty&auml; virheellinen johtop&auml;&auml;t&ouml;s, ett&auml; UPSiin voi kytke&auml; laitteita vaikka kuinka, eik&auml; s&auml;hk&ouml; katkea.<br>
					<br>
					Kuormitustaso ratkaisee my&ouml;s maksimissaan saavutettavan varak&auml;yntiajan. Maksimikuormalla UPSit antavat tyypillisesti noin 5 minuuttia varak&auml;yntiaikaa, t&auml;m&auml;n j&auml;lkeen akut ovat tyhjin&auml; ja virta katkeaa. Kuormitustason pienentyess&auml; kasvaa varak&auml;yntiaika kuitenkin ep&auml;lineaarisesti, esimerkiksi 50% kuormituksella saa tyypillisesti jo yli 20 minuutin varak&auml;yntiajan. Mik&auml;li mielii pitki&auml; varak&auml;yntiaikoja, kannattaa hankkia reilusti ylimitoitettu UPS, jos vain rahavarat sallivat. Tehokkaita malleja kannattaa etsi&auml; my&ouml;s k&auml;ytettyn&auml;, uutena ne saattavat olla turhan kalliita kotik&auml;ytt&ouml;&ouml;n.<br>
					<br>
					<center><img src="kuvat/mge.jpg" width="384" height="288" alt="MGE"><br>
					T&auml;st&auml; 2000 VA tehoisesta UPSista riitt&auml;&auml; varavoimaa koko talouden elektroniikkalaitteille. Siihen on kytketty mm. kolme tietokonetta monitoreineen, r&auml;killinen erikoislaitteita ja kotiteatterij&auml;rjestelm&auml;; AV-vahvistin, 2 videonauhuria, TV, satelliittilaitteisto yms., kaiken kaikkiaan noin 30 laitetta. Kuormitus kaikkien laitteiden p&auml;&auml;ll&auml;ollessa on noin 800 W, UPSin maksimiantoteho on 1400 W. Varak&auml;yntiaikaa maksimikuormalla saa yli puoli tuntia, normaalikuormalla useita tunteja! UPSissa on 48 V akusto, jota voi laajentaa. Painoa on 56 kg, ja k&auml;ytettyn&auml; t&auml;llainen irtoaa muutamalla tonnilla.</center>
					<br>
					S&auml;hk&ouml;laitokselta saa lainaan mittareita, joilla voi mitata laitteiden tehonkulutuksen watteina. Rakentamalla erilaisia kokonaisuuksia, joita on ajatellut kytke&auml; UPSiin, voi merkit&auml; muutamia lukemia muistiin eri kuormitustilanteissa. N&auml;ist&auml; muistiinpanoista on my&ouml;hemminkin hy&ouml;ty&auml; arvioitaessa hankitun UPSin varak&auml;yntiaikaa eri kuormitustilanteissa.<br>
					<br>
					UPSien tehot ilmoitetaan yleens&auml; volttiampeereina (VA), joka on vaihtos&auml;hk&ouml;n n&auml;enn&auml;istehon yksikk&ouml;. Kuormittavien laitteiden tehot ilmoitetaan taasen watteina (W). T&auml;m&auml; asia saa monen ymm&auml;lleen siit&auml;, mink&auml;tehoinen UPS pit&auml;isi valita tietynlaiselle kuormalle. Er&auml;s, mutta virheellinen k&auml;sitys on olettaa, ett&auml; volttiampeeri on yht&auml; kuin watti. Watti tarkoittaa kuorman p&auml;t&ouml;tehoa. Mutta t&auml;m&auml;n tehon lis&auml;ksi kuorman impedanssin reaktiivinen osuus aiheuttaa nk. loistehoa, joka liikkuu kytkenn&auml;ss&auml; "edestakaisin". K&auml;yt&auml;nn&ouml;ss&auml; kaikki laitteet lukuunottamatta puhtaasti resistiivisi&auml; kuormia (l&auml;mp&ouml;vastus, s&auml;hk&ouml;lamppu ym.) aiheuttavat jossain m&auml;&auml;rin loistehoa. Loistehon ja p&auml;t&ouml;tehon suhdetta kutsutaan tehosuhteeksi ja sen arvo on 0:n ja 1:n v&auml;lill&auml;.<br>
					<br>
					K&auml;yt&auml;nn&ouml;ss&auml; p&auml;t&ouml;teho ja loisteho voitaisiin mitata sopivalla tehomittarilla ja laskea tehosuhde, mutta t&auml;m&auml; ei ole v&auml;ltt&auml;m&auml;t&ouml;nt&auml; UPSia mitoitettaessa. Elektroniikkalaitteiden tyypillinen tehosuhde on 0,6:n, 0,7:n luokkaa, joten aivan hyvin voi k&auml;ytt&auml;&auml; oletuksena esimerkiksi arvoa 0,7 - t&auml;m&auml;n mukaan my&ouml;s monet UPS-valmistajat ilmoittavat UPSiensa tehon watteina. UPSin teho watteina saadaan, kun kerrotaan VA-lukema tehosuhteella. N&auml;in ollen esimerkiksi 600 VA tehoinen UPS jaksaa sy&ouml;t&auml;&auml; noin 400 watin verran kuormia.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mit&auml; kytke&auml; UPSiin?</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					UPSiin ei kannata kytke&auml; kaikkea mahdollista. Jo k&auml;ytt&ouml;ohjeissa kiellet&auml;&auml;n liitt&auml;m&auml;st&auml; kotitalouskoneita, esimerkiksi p&ouml;lynimuria, keitti&ouml;koneita tai l&auml;mmittimi&auml; kuten hiustenkuivaajaa. Mik&auml;li haluaa liitt&auml;&auml; ty&ouml;valaistuksen UPSiin, on lamppujen oltava mieluiten hehkulamppuja, koska loistelamput tuottavat helposti h&auml;iri&ouml;it&auml;. Ainakaan tehokkaita moottoreita sis&auml;lt&auml;vi&auml; laitteita ei saa kytke&auml;. P&auml;&auml;periaate on, ett&auml; mit&auml;&auml;n sellaisia laitteita, joiden aiheuttamilta harmonisilta h&auml;iri&ouml;ilt&auml; verkkos&auml;hk&ouml; on UPSilla puhdistettu, ei kannata kytke&auml; UPSiin, ellei sitten kyseisen laitteen ole aivan v&auml;ltt&auml;m&auml;t&ouml;nt&auml; toimia s&auml;hk&ouml;katkon aikana.<br>
					<br>
					Lasertulostimet ovat er&auml;s laiteryhn&auml;, joita ei tulisi kytke&auml; UPSiin. Lasertulostimessa oleva kiinnitin l&auml;mmitet&auml;&auml;n yleens&auml; useiden satojen wattien tehoisella l&auml;mp&ouml;lampulla, ja t&auml;m&auml; kuormittaa UPSia melkoisesti. Tehokkaampi UPS jaksaa kyll&auml; sy&ouml;tt&auml;&auml; virtaa, mutta akkuja kuluu ja varak&auml;yntiaika lyhenee tarpeettomasti. Tulostusta voi jatkaa s&auml;hk&ouml;katkon j&auml;lkeenkin. Jokin aika sitten joku tuttu kummasteli, kun h&auml;nen vastik&auml;&auml;n hankkimansa UPS ei toiminut kunnolla, vaan s&auml;hk&ouml;t katkesivat kaikesta huolimatta heti. Syyksi paljastui UPSiin kytketty lasertulostin, joka ylikuormitti UPSin l&auml;hd&ouml;n ja virta katkesi. Joissakin UPSeissa on lasertulostinta varten oma l&auml;ht&ouml;liit&auml;nt&auml;. T&auml;m&auml; liit&auml;nt&auml; sis&auml;lt&auml;&auml; ainoastaan suodatettua ja ylij&auml;nnitesuojattua verkkos&auml;hk&ouml;&auml;, joka kuitenkin katkeaa s&auml;hk&ouml;katkon sattuessa.
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="100%" bgcolor="navy" align="center">
					<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Varautuminen s&auml;hk&ouml;katkoihin</b></font>
				</td></tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr><td width="50%" bgcolor="#d8ecfd">
					Kun UPS on sitten hankittu, kannattaa harjoitella tositilannetta varten. Er&auml;s hyv&auml; testi, joka jokaisen UPSin omistajan tulisi tehd&auml; ennen tositilannetta on se, pystyyk&ouml; esimerkiksi monitorin kytkem&auml;&auml;n p&auml;&auml;lle s&auml;hk&ouml;katkon aikana. Monitorihan imaisee k&auml;ynnistyshetkell&auml; demagnetointia varten melkolailla suuren virtapiikin. Aivan pienitehoisimmat UPSit eiv&auml;t selvi&auml; t&auml;st&auml;, vaan niiden ulostulo notkahtaa niin pahasti, ett&auml; tietokone voi resetoitua. Siksi kannattaa testata, onko monitorin k&auml;ynnist&auml;minen mahdollista. Monesti tositilanteessa monitori ei v&auml;ltt&auml;m&auml;tt&auml; ole p&auml;&auml;ll&auml; s&auml;hk&ouml;katkon alkaessa, vaikka kone olisikin. N&auml;in varsinkin, jos konetta pidet&auml;&auml;n ymp&auml;rivuorokautisesti kytkettyn&auml;. Pidemm&auml;n s&auml;hk&ouml;katkon sattuessa on kuvan n&auml;kemisest&auml; kuitenkin verraton apu konetta alasajettaessa...<br>
					<br>
					Testi on helppo tehd&auml;. Monitori laitetaan pois p&auml;&auml;lt&auml; p&auml;&auml;kytkimest&auml; ja annetaan sen olla vartista puoleen tuntiin, niin ett&auml; demagnetointikelan kanssa sarjassa oleva PTC-vastus ehtii j&auml;&auml;hty&auml; (muutoin demagnetointia ei tapahdu). T&auml;m&auml;n j&auml;lkeen tehd&auml;&auml;n s&auml;hk&ouml;katkosimulaatio vaikkapa irroittamalla UPSin verkkos&auml;hk&ouml;n sy&ouml;tt&ouml; pistorasiasta. Anna akun purkautua muutama minuutti (sen aikaa, kun normaalistikin odottelisit s&auml;hk&ouml;jen palautumista ennen alasajoa), ja sitten vain monitori p&auml;&auml;lle. Ainakin UPSista kuuluu yleens&auml; t&auml;ss&auml; vaiheessa mielenkiintoisia &auml;&auml;ni&auml;, kun se saa hieman kuormitusta. Mutta kestik&ouml; virta p&auml;&auml;ll&auml; tai resetoituiko tietokone?<br>
					<br>
					Suuritehoiset UPSit kest&auml;v&auml;t kyll&auml; t&auml;llaisia k&auml;ynnistyksi&auml; mukisematta, joten mik&auml;li per&auml;ss&auml; on laajempi laitteisto useine monitoreineen ja on tyypillist&auml;, ettei monitoreja pidet&auml; jatkuvasti p&auml;&auml;ll&auml;, on reilu ylimitoitus suotavaa. Valitettavasti se vain tekee melkoisen loven kukkaroon.
				</td></tr>
			</table>
			</p>
			<p>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Sekalaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<br>
		</center>
	</body>

</html>

