<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Interview: Andreas Kleinert</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR><B>Andreas Kleinert</B></P>
<P>
Diesmal stand mir Andreas R. Kleinert Rede und Antwort. Er ist
einer der bekanntesten Softwareentwickler f&uuml;r den Amiga, und
zeichnet inbesondere f&uuml;r zahlreiche Grafik-Datatypes, sowie das
Anzeige-/Konvertierpaket <B>SuperView</B> verantwortlich.</P>
<B>AmZ: Gregor Franz<BR>
AK : Andreas Kleinert</B>
<BR>
<HR WIDTH="50%">
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>SuperView und diverse Datatypes sind nur einige Deiner langj&auml;hrigen
     Projekte, die Du auch regelm&auml;&szlig;ig weiterpflegst.</P>
     <P>Das klingt schon fast nach einem Fulltime-Job. Wie schaffst
     Du das? Was machst Du neben dem &quot;Computern&quot;?</P>
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD><P>Also, seit ich f&uuml;r mich pers&ouml;nlich den 48-Stunden-Tag eingef&uuml;hrt
     habe, lassen sich mein Informatik-Studium und mein &quot;Berufshobby&quot;
     Programmierung eigentlich ganz gut miteinander verbinden...</P>
     <P>
     Nein im Ernst - auch als Sch&uuml;ler, Abiturient, Wehrpflichtiger
     und Datenverarbeitungskaufmann mu&szlig;te ich nat&uuml;rlich darauf achten,
     nicht einen 24-Stundenjob daraus zu machen. Es ist sozusagen alles
     eine Frage der Organisation, und das klappt eigentlich auch recht
     gut.</P></TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Seit wann besch&auml;ftigst Du Dich mit Computern? Welche Ger&auml;te wurden
     seitdem von Dir &quot;gequ&auml;lt&quot; und was war Dein erstes Programm?</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD><P>Es mu&szlig; so etwa 13-14 Jahre her gewesen sein, als ich mit einem
     C-16 anfing, danach folgten dann eine Reihe Rechner, darunter
     auch ein C64 und ein Amiga 500, bis hin zu meinen heutigen
     Computern (A4000 und PC).</P>
     Das erste echte Programm wird eine Art Strategiespiel gewesen
     sein - leider wurde es nie wirklich fertig. </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Stehen demn&auml;chst gr&ouml;&szlig;ere Updates Deiner Programme an? Bist Du mit
     dem Entwicklungsstand Deiner Programme zufrieden oder hast Du noch
     wichtige Etappenziele?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Ich glaube nicht, da&szlig; ein Programm jemals wirklich fertig sein
     kann - jedenfalls nicht, solange das zugehoerige Rechnersystem
     noch in Ver&auml;nderung begriffen ist.<BR><BR>
     Was die Zufriedenheit und Etappenziele angeht, bestimmen dies
     nat&uuml;rlich in erster Linie die Anwender der Programme - die Liste
     von Verbesserungsw&uuml;nschen ist nicht gerade klein.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Du hast vor kurzem in SuperView ein neues, eigenes Grafikformat
     (RGFX) vorgestellt. Was ist der Vorteil gegen&uuml;ber den etablierten
     Formaten? Wie kamst Du auf die Idee?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Es gab bereits zwei Vorgaenger, die keine IFF-Formate waren.
     Dieses (und weitere) Mankos wollte ich beseitigen, und einen etwas
     offeneren "Standard" festlegen. Auf bestimmten Systemen ergeben
     sich au&szlig;erdem gravierende Vorteile, was die Ladegeschwindigkeit
     angeht - es handelt sich hier gewisserma&szlig;en um eine L&uuml;cke, die
     alle anderen Formate bisher unbesetzt gelassen haben. Last not
     least, ist es das erste Grafikformat, das Xpk unterst&uuml;tzt, und
     somit f&uuml;r alle m&ouml;glichen Komprimierungsverfahren offen ist.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie sch&auml;tzt Du die Chancen auf Akzeptanz und Verbreitung am Markt
     ein? Es wird, soweit ich wei&szlig;, au&szlig;er in SView nur durch einen
     Datatype (eines anderen Programmierers) unterst&uuml;tzt. Sind Dir
     noch andere Projekte bekannt?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Der Datatype und das zugeh&ouml;rige "Nach-RGFX"-Konvertierungsprogramm
     sind eigentlich bereits zwei sehr wichtige Faktoren f&uuml;r Akzeptanz
     und Verbreitung. Der Autor hat desweiteren vor (oder bereits
     fertig ?) RGFX-Unterstuetzung in sein Programm "Digital Almanach"
     einzubauen, weil er von den M&ouml;glichkeiten des Formates begeistert
     ist.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Nicht durchgesetzt bis jetzt hat sich ja auch PNG, welches als
     Ersatz f&uuml;r das Copyright-belastete GIF eingef&uuml;hrt wurde. Gibst Du
     PNG eine ernsthafte Chance, trotz der gegenw&auml;rtigen Lage?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Alle gro&szlig;en Browser unterst&uuml;tzen es bereits (auch Netscape und der
     Internet Explorer), au&szlig;erdem ist es neben GIF und JPEG eines der
     drei offiziellen WWW-Grafikformate, die vom W3C festgelegt wurden.
     Was mit &quot;Frames&quot; m&ouml;glich war, und sich mit &quot;Style Sheets&quot; bald
     wiederholen wird, kann PNG hinsichtlich der Akzeptanz sicherlich
     ebenfalls bald erreichen. Auch au&szlig;erhalb des WWW ist es bereits
     fast &uuml;berall vertreten, insbesondere auch in den gro&szlig;en Office-
     Paketen.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Deine Programme nutzen eine relativ bodenst&auml;ndige
     Benutzeroberfl&auml;che, f&uuml;r die Datatypes sind aber teilweise
     MUI-Oberfl&auml;chen  von Fremdprogrammierern geschaffen worden.</P>
     <P>Hast Du Vorbehalte gegen MUI? Welche Entwicklungswerkzeuge
     verwendest Du?</P>
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD><P>MUI hat ein sehr sch&ouml;nes objektorientiertes Konzept, ist allerdings
     auch sehr umfangreich. Ich nutze MUI-Programme eigentlich recht
     gerne, m&ouml;chte allerdings meine eigenen nicht unbedingt &uuml;berfrachten,
     wenn es nicht n&ouml;tig ist bzw. keinen gro&szlig;en Vorteil bringt.</P>
     Mein wichtigstes Entwicklungswerkzeug ist sicherlich SAS/C.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Du bist ein Vertreter des Sharewarekonzepts. Hast Du Erfolg damit?
     Gibt es eine Tendenz in den Registrierungen?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD><P>Tendenziell kann man sagen, da&szlig; seit Jahren &quot;zu wenig&quot;
     Registrierungen eingehen - von Erfolg k&ouml;nnte man wahrscheinlich
     erst reden, wenn es um Gr&ouml;&szlig;enordnungen wie bei &quot;Shapeshifter&quot;
     oder &quot;MUI&quot; ginge. Das ist allerdings nicht der Fall.</P>
     Das ist - f&uuml;r einen Studenten - sehr bedauerlich, und es f&uuml;hrt
     auf die Dauer dazu, da&szlig; man sich nach Alternativen umsieht.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>SView war eines der ersten Programme, das umfangreichen PPC-
     Support bot. Wie siehst Du als Besitzer (davon gehe ich mal aus)
     und als Programmierer diese Beschleunigerkarten? K&ouml;nnen Amigas
     mit ihnen den Rechenleistungsvorsprung zum PC aufholen, ohne ein
     speziell angepa&szlig;tes Betriebssystem?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD><P>Eine PPC-native Version des AmigaOS w&auml;re zum derzeitigen Zeitpunkt
     ein nicht zu untersch&auml;tzender Vorteil - auch wenn nat&uuml;rlich eine
     einfache PPC-Portierung nicht reichen w&uuml;rde, denn es sind eben auch
     eine Menge Fehler zu korrigieren und Features hinzuzuf&uuml;gen.</P>
     <P>Der reine Rechenleistungsvorsprung zu modernen PCs l&auml;&szlig;t sich auf
     diese Art - bzw. mit der kommenden pre/box von phase5 - sicherlich
     aufholen. Allerdings sind hier die verbliebenen Amiga-Programmierer
     gefragt, ihre rechenintensive 68k-Software f&uuml;r den PowerPC
     umzusetzen, um zu erm&ouml;glichen, diese Rechenleistung auch wirklich
     zu nutzen - und nicht zuviel Zeit auf der 68k-Seite bzw. in einer
     68k-Emulation zu verbringen.</P>
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Die ersten Wogen zum Konflikt der PPC-Softwareumgebungen von phase5
     und Haage&Partner haben sich gelegt - die Konkurrenzsituation bleibt!
     Bietet WarpUp aus Deiner Sicht tats&auml;chlich die versprochene, bessere
     Leistung oder tendierst Du eher zur Auffassung von phase5?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Das ist nat&uuml;rlich ein sehr schwieriges Thema.
     <P>Ich m&ouml;chte jetzt nicht unbedingt die eine oder andere L&ouml;sung
     vertreten - wie man leider immer wieder feststellen mu&szlig;, kommt es
     in Newsgroups h&auml;ufiger zu Auseinandersetzungen zwischen Vertretern
     des einen oder anderen Lagers, die mal sachlich, mal weniger
     sachlich gef&uuml;hrt werden.</P>
     <P>Mit meinen Programmen unterst&uuml;tze ich jedoch in erster Linie die
     Zukunft des Amiga als PPC-Plattform - f&uuml;r eine solche ist es
     allerdings eher ung&uuml;nstig, wenn die Entwickler sich selbst in
     zwei Fraktionen auseinanderdividieren und damit womoeglich andere
     Programmierer abschrecken.</P>
     <P>Ich denke, da&szlig; die Hauptfrage jene nach der einzuschlagenden
     Richtung f&uuml;r Amiga ist (und die Antwort ist eindeutig PowerPC, was
     die CPU angeht), und da&szlig; man in der Frage der Zukunftssicherheit der
     beiden PPC-Kernel als Anwender auf die beiden Hersteller vertrauen
     sollte. Hier sind sich auch nahezu alle Entwickler einig und
     vertreten diese Meinung auch geschlossen.</P>
     <P>Aus Gr&uuml;nden, die ich hier im einzelnen nicht erl&auml;utern m&ouml;chte,
     verwende ich pers&ouml;nlich jetzt und zuk&uuml;nftig allerdings den
     PPC-Kernel von phase5.</P>
     <P>Eigentlich w&auml;re der Kernel, ginge es nur um powerUP, eher
     zweitrangig, allerdings ist es einfach so, da&szlig; man die
     entsprechende Richtlinienkompetenz dem Hardwarehersteller
     zusprechen mu&szlig; - auch und gerade im Hinblick auf kommende
     Entwicklungen wie pre/box und A/Box.</P>
     <P>Sollten die WarpUp-Entwickler die f&uuml;r ihren Kernel entwickelten
     Programme auch auf einem solchen System lauff&auml;hig halten k&ouml;nnen - es
     hat schon schwierigere Aufgaben gegeben - dann w&auml;re auch diese Frage
     hoffentlich kein Thema mehr.</P>
     <P>Mit anderen Worten: wer einen PPC-Amiga haben m&ouml;chte, sollte sich
     ihn jetzt zulegen - die PPC/WarpUp-Diskussion ist kein Argument
     dagegen. In erster Linie bestimmt die Hardware die Geschwindigkeit,
     nicht die Kernel-Software...</P>
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Kann es mit Amiga Int. einen zweiten Fr&uuml;hling f&uuml;r den Amiga geben?
     H&auml;ltst Du das generell noch fuer m&ouml;glich?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Nichts ist unm&ouml;glich. Man k&ouml;nnte allerdings den Eindruck gewinnen,
     da&szlig; die Abstimmung zwischen Amiga International und Amiga Inc. nur
     mangelhaft funktioniert, und man sich generell zuviel Zeit l&auml;&szlig;t -
     aber das w&auml;re nat&uuml;rlich eine h&ouml;chst subjektive Einsch&auml;tzung...
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie alt bist Du eigentlich, aus welcher Gegend kommst Du und wof&uuml;r
     interessierst bzw. womit entspannst Du Dich abseits des Computers?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>24 und aus dem Siegerland - mit allen m&ouml;glichen Dingen, vorzugsweise
     mit Unterst&uuml;tzung von guten Freunden und Freundin. Man soll mich
     auch schon in diversen Siegener Studentenkneipen und Discos gesehen
     haben.
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Zum Abschluss die Standardfrage: Kanntest Du den AmZeiger vor meiner
     Anfrage? Und wenn ja: Wie findest Du ihn?
    </TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>AK:</TH>
    <TD>Ich kannte ihn schon - es ist schlie&szlig;lich ein entsprechender Link
     auf meiner Homepage - aber ich habe bisher noch keine Ausgabe so
     gr&uuml;ndlich studiert, da&szlig; ich mir eine fundierte Meinung h&auml;tte bilden
     k&ouml;nnen...
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Vielen Dank f&uuml;r das Interview!
    </TD>
</TR>
</TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="radio.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9803tp6.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
