<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER">Editorial</H1>
<BR>
<P><B>Skandale und Sensationen</B> haben wir zwar nicht zu bieten. Lediglich
die vierte Ausgabe des AmZeigers.</P>
<P>
Vor fast genau einem Jahr wurde die Idee geboren, als ich in einer
eMail unseren jetzigen HTML-Redakteur Andreas Schlick zaghaft fragte:
</P><P>
&quot;Was hieltest Du eigentlich von einer Amiga-Guide-Zeitschrift fuer
 den Amiga ? Waere eine Alternative zum AMag, das ja nur noch ein
 Witzblatt ist. Nur so eine Idee.&quot;
</P><P>
Das ist der Anla&szlig; f&uuml;r ein Jubil&auml;ums-Preisausschreiben in der n&auml;chsten
Ausgabe, in der sich das Herauskommen unseres Magazins dann offiziell
j&auml;hrt.
</P><P>
F&uuml;r <B>Interna</B>, sowie Nachtr&auml;ge, Berichtigungen usw. wurde in dieser Ausgabe
erstmals ein eigener <A HREF="intern.htm">Eintrag</A> geschaffen, in den ich aktuelle Hinweise, die
bis jetzt vielfach im Editorial erfolgten, umleiten werde.
</P><P>
Somit wird an dieser Stelle und haupts&auml;chlich an dieser Stelle (denn ich
bin dagegen, an tausend Ecken im Text und bei den Nachrichten eigenen Senf
unterzumuscheln), <B>kommentiert</B> werden, wenn es denn etwas zu kommentieren
gibt. Der Klammerinhalt war ja auch schonmal ein Anfang. ;)
</P><P>
Was gibt es also f&uuml;r <B>das letzte Quartal</B> gro&szlig;artiges zu berichten?
</P><P>
Hin und her in Sachen <B>Amiga International</B> und deren amerikanischer
Entwicklungstochter (oder sollte man besser schreiben &quot;Schwester&quot;?)
Amiga Inc.. Mal hei&szlig;t es von Seiten Petro Tyschtschenko`s , die
Entscheidung f&uuml;r den PPC als zuk&uuml;nftigen Amiga-Prozessor sei definitiv
gefallen, dann gibt es von amerikanischer Seite wieder ein Dementi -
es sei noch gar nichts definitiv.
</P><P>
Au&szlig;erdem gibt es auch noch <B>keine Klarheit</B> dar&uuml;ber, ob Amiga denn noch
jemals eigene Rechner produzieren wird oder nicht. Den wechselnden
Aussagen &uuml;ber den Sachverhalt an sich bzw. &uuml;ber die vermutlichen
Liefertermine, ist sicher nur mit Skepsis zu begegnen.
</P><P>
Die Situation zwischen <B>Haage&amp;Partner</B>, sowie <B>phase5</B> in Bezug auf den
WarpUP vs. PowerUP-Konflikt scheint sich entspannt, wenn auch nicht
grundlegend ge&auml;ndert zu haben. Der Umstand der Konkurrenz, im Moment
noch vornehmlich von meist kleineren Applikationen im Aminet, bleibt
gegeben.
</P><P>
F&uuml;r ein besseres Verh&auml;ltnis scheint auch die Meldung zu sprechen, da&szlig;
u.a. diese beiden Firmen, sowie auch der bekannte Entwickler Olaf
Barthel (Interview in der letzten Ausgabe) unter den Fittichen von
Amiga Inc. an dem <B>Update des Amiga-OS</B> auf Version 3.5 arbeiten w&uuml;rden.
Mit dem Sommer als Termin sei wohl nicht mehr zu rechnen, hei&szlig;t es.
Aber wer hatte schon ernsthaft darauf spekuliert?
</P><P>
Olaf Barthel best&auml;tigte uns auf Anfrage seine Mitwirkung an dem Projekt,
wurde aber durch Unterzeichnung eines NDA`s daran gehindert n&auml;here
Angaben zu machen.
</P><P>
Um wieder auf die <B>PowerPC`s</B> zur&uuml;ckzukommen: Eine echte sogenannte
Killerapplikation oder ein gr&ouml;&szlig;eres kommerzielles Projekt wurde auf
den PowerUP-Beschleunigerkarten bis jetzt, nach sehr vollmundigen
Ank&uuml;ndigungen, noch nicht gesichtet. Ob diese L&uuml;cke durch ein Spiel,
wie z.B. <B>Quake</B>, ausgef&uuml;llt werden kann, dem sich jetzt die kanadischen
Entwickler von ClickBOOM! widmen wollen? Ich wage es zu bezweifeln,
nicht nur angesichts dessen, da&szlig; dieses Spiel auf dem PC ein
vergleichsweise alter Hut ist.
</P><P>
Trotzdem legt PowerUP langsam zu, denn phase5 startete die Produktion
der mit PPC ausger&uuml;steten 1200er Blizzard-Karten. Mit der <B>pre\box</B>
wollen sie offenbar die doch etwas l&auml;nger werdende Wartezeit auf die
A\Box verk&uuml;rzen. Ein echter PPC-Amiga mit guter Ausstattung und
generell mehreren parallelen CPU`s? Klingt nicht schlecht. Doch
woher kommen nur diese einfallslosen Namen? Letzlich sind Computer
zwar tats&auml;chlich irgendwie nur Kisten oder K&auml;sten...
</P><P>
Nebenbei bemerkt sind die <B>Quellcodes</B> verschiedener bekannter PC-
Programme freigegeben worden, so z.B. von Doom, Descent, (von
denen im Aminet auch schon eine Unmenge der unterschiedlichsten
Engines herumgeistern) und auch von Netscape.
</P><P>
<B>Die Zukunft</B> bleibt wie immer spannend. Und wir sind mittendrin.
</P>
Bis zur n&auml;chsten Ausgabe,
<BR> <BR>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
