<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - WWW Browser</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Browser-Situation PC vs. Amiga</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>

<B>oder: Nichts ist umsonst</B><BR><BR>

In mancher Beziehung ist der Amiga-Markt gar nicht so sehr vom PC-Markt
verschieden: Hier wie dort gibt es haupts&auml;chlich drei WWW-Browser, aus
denen man w&auml;hlen kann. Auf dem Amiga sind das AWeb, IBrowse und Voyager
NG. Auf dem PC der MS Internet Explorer, Netscape Navigator und Opera.
</P><P>
<B>Wo liegt der gro&szlig;e Unterschied ?</B>
</P><P>
Explorer und Navigator sind f&uuml;r PCs kostenlos erh&auml;ltlich. Opera kostet
in etwa so viel, wie ein Amiga-Browser. Alle Amiga-Browser sind aber
mindestens Shareware, kosten also alle etwas. Warum bekommt der PC-
Nutzer etwas geschenkt ?
</P><P>
<B>Die PC-Situation</B>
</P><P>
Bis vor kurzem war nur der <B>Explorer</B> kostenlos. Microsoft hatte das
Internet schlichtweg falsch eingesch&auml;tzt und den Anfang des Booms total
verschlafen.
</P><P>
So hatte Netscapes <B>Navigator</B> durch sein Sharewarekonzept und seine fr&uuml;he
Verf&uuml;gbarkeit den Microsofties die Marktanteile fr&uuml;hzeitig weggenommen.
Kein klar denkender User h&auml;tte f&uuml;r den Explorer bezahlt, wenn der
Navigator (oder Communicator, wie er jetzt hei&szlig;t) so billig ist. Denn
definitiv haben die wenigsten ihre Sharewaregeb&uuml;hr bezahlt, und
eingeschr&auml;nkt war am Navigator auch nichts.
</P><P>
Die Browser waren also nur noch Instrument zum Erhaschen von Marktanteilen,
die dann letztlich durch Zusatzprodukte Profit bringen sollten. Der
Explorer hat in der letzten Zeit erheblich Boden gut gemacht, so da&szlig;
Netscape nun den Quellcode seines Navigators freigegeben hat. In der
Konsequenz bedeutet das, da&szlig; auch f&uuml;r den Amiga bald ein Navigator zur
Verf&uuml;gung stehen k&ouml;nnte, mehr dazu sp&auml;ter.
</P><P>
Sowohl Explorer, wie auch Navigator, sind in ihren neuesten Versionen
recht beh&auml;bige Speicherfresser. Viele User haben jedoch noch ihre "alten"
486er, und so kam eine dritte Firma ins Spiel, Opera Software, mit ihrem
<B>Opera</B> Browser. Diese Firma legt bei ihrem Browser Wert auf Geschwindigkeit
und Gen&uuml;gsamkeit, auf optimierte Software. Der Nachteil den anderen
Mitbewerbern gegen&uuml;ber ist jedoch der Preis: Opera kostet etwas, n&auml;mlich
ca. 60 DM (35 Dollar).
</P><P>
Alsbald hat deswegen wohl auch Opera bemerkt, da&szlig; der PC-Markt keine
satten Gewinne bringt, und ein Projekt ins Leben gerufen, das "Project
Magic". Sinn des Projekts ist es, Opera auch auf anderen Plattformen als
Konkurrenz zu Navigator (Linux, Mac, OS2) und Explorer (Mac, OS2) zu
etablieren. Urspr&uuml;nglich war "<B>Project Magic</B>" auf Linux, Macintosh und
OS/2 beschr&auml;nkt, durch die geh&auml;uften Anfragen wurde aber auch der Amiga
mit ins Projekt aufgenommen.
</P><P>
<B>Die Amiga-Situation</B>
</P><P>
Durch Netscapes und Operas Initiativen k&ouml;nnten dem Amiga-User bald f&uuml;nf
Browser zur Auswahl stehen. Das h&ouml;rt sich jedoch besser an, als es in
Wirklichkeit ist.
</P><P>
Der Netscape Navigator krankt an seinen Lizenzen von Drittfirmen. Vor
allem die Programmiersprache <B>Java</B>, die auf dem Amiga in der ben&ouml;tigten
Form noch nicht verf&uuml;gbar ist, wird es durch die Rechte der Herstellerfirma
Sun wohl nicht bis zu einer Portierung auf den Amiga schaffen.
Damit bleibt dem Amiga eine im Internet immens wichtige Programmiersprache
bis auf weiteres verschlossen.
</P><P>
Wichtig ist hierbei nicht die Sprache selbst, die gibt es schon f&uuml;r den
Amiga, sondern die Funktionsbibliotheken, die die Hauptfunktionalit&auml;t
der im Internet verf&uuml;gbaren Java-Applets ausmacht. Ohne diese ist Java
nur eingeschr&auml;nkt nutzbar. Sollte es also einen Navigator f&uuml;r den Amiga
geben, dann wohl in sehr abgespeckter Fassung, die sich nur durch ihre
Tr&auml;gheit von den anderen Amiga-Browsern abheben wird.
</P><P>
Opera Software indes hat nichts zu bieten, das ein Amiga-Browser nicht
auch beherrscht. Einzig der Support und die N&auml;he zum &uuml;berm&auml;chtigen
PC-Markt bieten Chancen f&uuml;r dieses Produkt. Es bleibt auch abzuwarten,
wie sich ein Programmierteam, das bisher nur auf anderen Betriebssystemen
zu Hause ist, sich mit der effizienten Natur des AmigaOS arrangiert. Viele
Portierungen auf den Amiga sind an den Bedienungsgewohnheiten des Amiga-
Users vorbeiprogrammiert, oder einfach nur langsam.</P><P>
Somit bleiben noch die existierenden Amiga-Browser. Aber gerade die haben
es schwer, denn durch das Beispiel PC-Markt, auf dem doch anscheinend jede
Software kostenlos ist, will nat&uuml;rlich auch hier niemand zahlen. Noch dazu
f&uuml;r eine Technik, die dem PC-Sektor um mindestens ein Jahr hinterherhinkt.
</P><P>
<B>War also alles umsonst?</B>
</P><P>
Im <B>Krieg der Browser</B> gibt es, egal auf welcher Seite, eigentlich nur
Verlierer - eben wie im richtigen Leben. Dem Amiga bringt die Zuwanderung
von PC-Produkten nur eine gr&ouml;&szlig;ere Auswahl; oder die Notwendigkeit, die
Hardware aufzur&uuml;sten. Also in jedem Fall Kosten. Der PC-Markt wird sowieso
von Microsoft dominiert, so da&szlig; eine Entscheidung f&uuml;r Produkte von anderen
Firmen ein gewisses Zukunftsrisiko enth&auml;lt. Trotzdem ist Microsoft nicht
der lachende Gewinner. Tatsache ist, da&szlig; MS vor allem durch Zukauf von
Fremdtechnologien, deren Firmen durch MS selbst ausgehungert wurden, so
gro&szlig; geworden ist. Eine echte Eigenentwicklung ist von MS noch nie
ausgegangen, selbst Windows NT enth&auml;lt zugekaufte Technologien.
</P><P>
Der Amiga hat mit noch mehr Schwierigkeiten zu k&auml;mpfen. Hier ist es
gerade die umgekehrte Situation: Dem Amiga fehlt eine Hauptfirma, die als
Schrittmacher die grobe Marschrichtung vorgibt. Die lange Zeit ohne einen
Eigent&uuml;mer des Markenzeichns Amiga, hat zwar den Wettbewerb zwischen den
Firmen, die dem Amiga treu geblieben sind, belebt; jedoch ohne
Zukunftsperspektive f&uuml;r die Firma sind dies nur wenige.
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="radio.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
