<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><U>Interna allgemein</U></H3>
<P>Die Redaktion besteht nun aus f&uuml;nf Personen, denn Thomas Heinrich
verst&auml;rkt ab dieser Ausgabe unser Team. Willkommen!</P><P>
In Seeshaupt ist eine weitere <B>Supportbox</B> hinzugekommen, die alle unsere
Ausgaben zum Download bereith&auml;lt. Danke an Robert Sterff, den Sysop der
CCS-BASE!</P><P>
Es gibt ab dieser Ausgabe eine weitere Neuigkeit. In der HTML- und
Online-Ausgabe ist jeweils eine <B>Seite mit Links</B> enthalten, die direkt
auf bekannte Amiga-Webadressen oder auf die Seiten von uns getesteter
Produkte f&uuml;hren.
</P><P>Das ganze basiert auf dem sogenannten Friendship-System. Wer auf seiner
Homepage einen Link auf uns plaziert, auf den verweisen auch wir. Bei
Interesse bitte bei <A HREF="../kontakt.htm">uns</A> melden.
</P><P>
In Sachen HTML-Pattern siehe die nachfolgenden Hinweise zur Ausgabe #4!
</P><P>
Wer <B>Gewinne f&uuml;r unser Preisausschreiben</B> stiften m&ouml;chte (siehe unten,
Hinweise zu Ausgabe #5), dem wird nicht nur eine lobende Erw&auml;hnung,
sondern auch unser ewiger Dank sicher sein. :)</P>

<H3><U>Hinweise zu dieser Ausgabe #4</U></H3>
<P><B>Zu den Beitr&auml;gen</B> nur ein paar Worte: Neben dem in dieser Ausgabe neu
hinzugekommenen Abschnitt f&uuml;r Interna (hier! :), startet diesmal auch
der <A HREF="../kw/9803inst.htm">Installer-Kurs</A>, sowie eine dreiteilige Serie
zu <A HREF="../hw/9803hw.htm">Hardware-Grundlagen</A>.
<P>Wer sich auch f&uuml;r Dinge neben dem Computer interessiert und sich mal
von diesem Hobby erholen will, sei auf den `<A HREF="../mmx/9803mmx.htm">Media Mal X</A>`-Bereich
verwiesen, der eine Menge interessanten Lesestoff bietet.
</P><P>
<B>Zur AmigaGuide-Ausgabe:</B><BR>
Im Bilder-Verzeichnis ist diesmal auch ein Bild mit den Bewertungsnoten
von 1-6, inklusive unserem Maskottchen, dem AmZeigerchen enthalten, sowie
auch ein Foto ;) unserer <A HREF="uhl.htm">Frau Gisela</A>.
</P><P>
<B>Zum Hintergrundmuster der HTML-Ausgabe:</B><BR>
Das Pattern, das wir in der letzten Ausgabe auf Grund der berechtigten
Kritik, es w&uuml;rde bei wenigen Farben die Lesbarkeit reduzieren, ge&auml;ndert
hatten, liefert Stoff zur weiteren Diskussion (s. auch den <A HREF="postsack.htm">Postsack</A>).
</P><P>
Wie sich herausgestellt hat, ist das Thema komplizierter, als angenommen.
Was bei dem einen, auch bei wenigen Farben gut aussehen kann, das mu&szlig;
beim anderen noch lange nicht so sein. Das erkl&auml;rt sich unter anderem
aus unterschiedlichen Screenpaletten - gerade bei unterschiedlichen
Browsern (VoyagerNG, IBrowse und AWeb) kann das Aussehen trotz gleicher
Farbtiefe sehr unterschiedlich ausfallen.
</P><P>
Wir hoffen, da&szlig; der diesmal mitgelieferte Hintergrund auf breiterer
Basis den Anforderungen gerecht wird. Haltet uns auf dem laufenden.
(Notl&ouml;sung ist &uuml;brigens das Ausschalten des Patterns im jeweiligen
Browser.)
</P>
<U><H3>Hinweise zur letzten Ausgabe #3</H3></U>
<P><B>Nachtrag zu - Am Puls/Software/MagicWB:</B><BR>
Leider stellte sich heraus, da&szlig; trotz gegenteiliger Behauptung der
SASG-Pressemitteilung doch nicht die Vollversion von MagicWB 2.1 zum
Download freigegeben wurde. Es handelt sich um eine eingeschr&auml;nkte
Version, in der einige Icons durch spezielle Schrift verunziert werden.
</P><P>
<B>Korrektur zu - Am Puls/Software:</B><BR>
Die Webadresse der Firma Oberland endet nicht auf &quot;.de&quot;, sondern lautet
komplett: <A HREF="http://www.oberland.com">http://www.oberland.com/</A>
</P><P>
<B>Nachtrag zu - Spiderman`s Webabenteuer:</B><BR>
Die vor einiger Zeit beschriebene Site der Telekom-Auskunft hat sich
auf Grund ihrer ver&auml;nderten Telefonnummer, die vorher in der Adresse
integriert war, ver&auml;ndert. Sie lautet jetzt: <A HREF="http://www.teleauskunft.de">http://www.teleauskunft.de</A>
</P><P>
<B>Warnung/Hinweis zu - WB-Tuning Teil 3:</B><BR>
Das Multi-OS.device, das Diskettenzugriffe unter CrossDOS teilweise
erheblich beschleunigt, hat einen Makel. Es kann beim Formatieren
abst&uuml;rzen! Also <B>Vorsicht!</B>
</P><P>
<B>Hinweis zu - HTML-Ausgabe/ml.htm:</B><BR>
Durch ein Versehen hat diese Datei mit Hinweisen zum Bezug per
Mailingliste gefehlt. Es f&auml;llt nur auf, wenn lediglich diese
Ausgabe installiert wurde.
</P>
<U><H3>Hinweise zur n&auml;chsten Ausgabe #5</H3></U>
<P>In der n&auml;chsten Ausgabe j&auml;hrt sich die Herausgabe des AmZeigers offiziell.
Aus Anla&szlig; dieses kleinen Jubil&auml;ums werden wir ein <B>Preisausschreiben</B>
ver&ouml;ffentlichen. Ich kann schon jetzt attraktive Gewinne in Aussicht
stellen.
</P><P>
Sonst l&auml;&szlig;t sich &uuml;ber den Inhalt der n&auml;chsten Ausgabe naturgem&auml;&szlig; noch
nicht viel sagen, au&szlig;er, da&szlig; es selbstverst&auml;ndlich Fortsetzungen des
Installer- und WB-Tuning-Kurses, den zweiten Teil der Hardware-Grundlagen
und weitere MUI-Einblicke (in der Coder's Corner) geben wird.
</P><P>
Mit W&uuml;nschen, Hinweisen oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</A> melden!
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
