<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> <A HREF="#Hardware">Hardware</A> <A HREF="#Spiele">Spiele</A> <A HREF="#Sonstiges">Sonstiges</A></P>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>
<P>Offenbar favorisiert <A HREF="http://www.amiga.de/">Amiga Inc.</A> vorerst eine <B>PPC/68k-Hybridl&ouml;sung</B> f&uuml;r
zuk&uuml;nftige Amigas. Ob eine endg&uuml;ltige Entscheidung getroffen wurde, bleibt
nach widerspr&uuml;chlichen Statements unklar.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.micronik.de/">Micronik</A> hat f&uuml;r seine <B>Scandoubler</B> von Amiga International die Lizenz zur
Verwendung des Labels &quot;Powered by AMIGA&quot; erhalten. Sie gilt vorl&auml;ufig bis
zum 30.Juni 1998.
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>
<P><B>LZX</B>, das bekannte effiziente Packprogramm, dessen Entwicklung vor
geraumer Zeit eingestellt wurde, ist jetzt <B>Freeware</B>. Das Archiv ist im
Aminet unter util/arc zu finden.</P>
<HR WIDTH="50%">
<P>F&uuml;r PowerUP-Kartenbesitzer ohne Grafikkarte aber mit AGA, ist ein Treiber
f&uuml;r <A HREF="http://www.vgr.com">CyberGraphX</A> in Entwicklung, mit denen sie CGFX-Programme in 8 Bit-Modi,
also mit 256 Farben, betreiben k&ouml;nnen.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.schatztruhe.de">Schatztruhe</A> plant mit <B>Amiga Bodyguard</B> ein Memory-Protection-System f&uuml;r
den Amiga. Es soll kompatibel zu bestehender Software sein und setzt
Amiga-OS 3.X und einen 68030/040/060 mit MMU, sowie 4 MByte RAM voraus.</P>
<HR WIDTH="50%">
<P>
<A HREF="http://www.amitrix.com">AWeb-II V3.1</A> bietet als erster Browser auf dem Amiga eine JavaScript-
Implementation. Weitere Features sind der interne Mailer und Newsreader.</P>
<HR WIDTH="50%">
<P>Das Faxprogramm <B>STFax</B> ist ab Version 3.0 kommerziell und wird von
<A HREF="http://www.haage-partner.com">Haage & Partner</A> zum Preis von 98 DM
vertrieben.</P>
<P>Die Firma vertreibt au&szlig;erdem den Videoeffektgenerator <B>X-DVE 3.0</B> und den
Colorfont-Editor <B>FontMachine 3.0</B>. Beides sind Produkte der italienischen
Firma ClassX.</P>
<HR WIDTH="50%">
<P>Von <A HREF="http://www.hisoft.co.uk">IBrowse</A> ist ein kostenloses Update auf <B>Version 1.20</B> erh&auml;ltlich.
Das Imagedecoding wird jetzt vollst&auml;ndig im FastRAM erledigt, au&szlig;erdem
gibt es u.a. eine Unterst&uuml;tzung der Grafikformate PNG und XBM. Die
Geschwindigkeit des Cachebrowsers wurde um &uuml;ber 500 Prozent gesteigert.
<HR WIDTH="50%">
<P>Von <B>AmIRC</B> ist die stark erweiterte Version <B>2.0</B> erschienen. F&uuml;r
registrierte Anwender ist das Update kostenlos, f&uuml;r Neu-User erh&ouml;ht
sich die Geb&uuml;hr von 35 auf 40 DM.</P><P>
Au&szlig;erdem bringt Vapor die <B>Version 2.95 von <A HREF="http://www.vapor.com">VoyagerNG</A></B> heraus. Als
erster Amiga-Browser unterst&uuml;tzt er HTTP/1.1-Verbindungen. Neben
einem neuen Cache-Browser gibt es zahlreiche weitere Verbesserungen.</P>
<HR WIDTH="50%">
<P>
Der TCP/IP-Stack <A HREF="http://www.nordicglobal.com">Miami 3.0</A> ist fertig. Neben MUI kann man jetzt auch
eine GadTools-Oberfl&auml;che nutzen. Au&szlig;erdem werden jetzt SOCKS V4/V5-
Proxy- Server, DHCP, K56Flex/X2-Modems, sowie ISDN-Anlagen und lokale
Netzwerke unterst&uuml;tzt. Auch das Konfigurationsprogramm MiamiInit
hat sich tiefgreifend ver&auml;ndert.</P>
<HR WIDTH="50%">
<P>
Von dem kostenlosen Mailprogramm <A HREF="http://www.yam.ch">YAM</A> ist eine Version <B>2.0</B> (Betastadium)
herausgekommen. Der Sprung von 1.3.5 auf 2.0 bewirkte zahlreiche
&Auml;nderungen und Verbesserungen.</P>
<HR WIDTH="50%">
<P>
<A HREF="http://www.novadesign.com">Nova Design Inc.</A> liefert jetzt <B>ImageFX 3.0</B> aus. Der Preis betr&auml;gt
ca. 350 US-Dollar. Updates sind wieder m&ouml;glich.</P>
<HR WIDTH="50%">
<P>
Die <A HREF="http://www.schatztruhe.de">Aminet Set 6</A>-CD`s enthalten beinahe 4 Gigabyte Daten. Au&szlig;erdem sind
die Vollversionen von Wordworth5SE, TurboCalc 3.5, PPaint 6.4 und
Wildfire 3.38 enthalten.</P>
<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>
<P><B>DCE</B> wird seine geplanten AMIGA-kompatiblen Rechner <B>A5000 und A6000</B> doch
wesentlich A4000-&auml;hnlicher gestalten, als anfangs geplant. So sollen sie
jetzt vollst&auml;ngig hardwarekompatibel zum A4000T werden, inklusive aller
Schnittstellen. Der Scandoubler wird im Videoslot sitzen und die CPU
auf einer Tochterplatine, wodurch die Notwendigkeit f&uuml;r eine PowerPC-
Schnittstelle entf&auml;llt. Der A5000 soll mit 68040, der A6000 mit 68060
ausgeliefert werden.
<HR WIDTH="50%">
<P>
<A HREF="http://www.phase5.de">phase5</A> hat das Amiga-OS 3.1 lizensiert und will es auf ihrem geplanten
zuk&uuml;nftigen Computersystem <B>pre\box</B> einsetzen. Dieses soll in die Preis-/
Leistungsregionen der mittleren und h&ouml;heren PC- und Workstations
vorsto&szlig;en und generell mit 4 PowerPC-CPU`s ausgestattet sein.</P><P>
Das Motherboard wird ATX-Standardgr&ouml;&szlig;e besitzen. Das Speicher-Subsystem
und der Prozessorbus werden mit bis zu 100 MHz getaktet. Enthalten
wird ein 3D-Grafik-Subsystem sein, das mit einem 66 MHz-PCI 2.1-Bus
verbunden ist und optional durch Voodoo2-3D-Grafik verst&auml;rkt werden
kann.
</P><P>
Ein UltraWide-SCSI2-Controller wird ebenso serienm&auml;&szlig;ig enthalten sein,
wie EIDE, PCI, USB und alle altbekannten Standardanschl&uuml;sse.
</P><P>
Ob es einen Sockel f&uuml;r eine optionale 68k-CPU geben wird, ist noch nicht
entschieden. Die Preise sollen bei etwa 4.000 DM f&uuml;r ein System mit vier
PPC 604e/200 MHz beginnen und gehen bis zu 9.000 DM f&uuml;r eines mit vier
PPC 750-300 MHz. F&uuml;r eine zus&auml;tzliche Ausstattung mit 32 MB RAM, 4 GB-
Festplatte und 24-fach CD-ROM-Laufwerk sind 750 DM extra anzusetzen.
</P><P>
Die Entwicklung der <B>A\Box</B> l&auml;uft mit angepa&szlig;ter Zielstellung davon
unbeschadet weiter.</P>
<HR WIDTH="25%">
<P>phase5 hat jetzt mit der Serienfertigung der PowerUP-Beschleunigerkarten
<B>Blizzard 603e</B> f&uuml;r den A1200 begonnen. Sie werden mit 160, 200 und 250 MHz
erh&auml;ltlich. Die geplante Version mit 68030 als &quot;Koprozessor&quot; entf&auml;llt,
lediglich der 68040 und 680060 werden eingesetzt. Die Version mit einem
<B>&quot;+&quot;</B> hinter dem 603e wird einen SCSI-Controller enthalten, Versionen ohne
werden zwar billiger, aber daf&uuml;r nicht nachr&uuml;stbar sein.</p><P>
Die Preise starten bei etwa 650 DM (603e-160 MHz/LC040-25MHz ohne FPU).</P>
<HR WIDTH="50%">
<P>
<A HREF="http://www.phase5.de">phase5</A>, Index Information Ltd. und <A HREF="http://www.cix.co.uk/~index/">Blittersoft</A> werden in Sachen PPC-
Technologie kooperieren. Das von Index entwickelte Amiga-kompatible
<B>BoXeR</B>-System wird einen PowerUP-, sowie einen PPC-Grafikkarten-
Steckplatz erhalten.</P>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>
<P><A HREF="http://www.clickboom.com/">clickBOOM</A> arbeitet an einer Umsetzung des bekannten Ballerspiels <B>Quake</B>.
Mindestvoraussetzung sollen AGA und ein 68020, sowie 8MByte FastRAM sein.
Empfohlen wird aber mindestens ein 68040 und FPU. Eine PPC-Version ist
ebenfalls geplant. Das Spiel ist in Deutschland indiziert.
</P>
<HR WIDTH="50%">
<P>
Die <B>Sourcecodes</B> diverser auf dem PC bekannter Spiele, namentlich von
<B>Doom und Descent</B>, wurden freigegeben. Seitdem sind im Aminet die
unterschiedlichsten Versionen von Spiel-Engines herausgekommen, die
st&auml;ndig aktualisiert werden. Sie ben&ouml;tigen die Daten der Originalspiele.
</P>
<HR WIDTH="50%">
<P>
Mit <B>Claws of the Devil</B> plant <A HREF="http://www.vossnet.de/titanhb/">Titan Computer</A> einen Tombraider-Klone.
Die aufwendige 3D-Engine soll einen 68040 voraussetzen. Eine PPC-Version
ist geplant.
</P>
<HR WIDTH="50%">
<P>
Der Doom-Klone <B>Genetic Species</B> von <A HREF="http://www.vulcan.co.uk/">Vulcan Software</A> ist jetzt erschienen.
Es ist ab AGA und 030 lauff&auml;hig, CybergrapX und Picasso96 werden
unterst&uuml;tzt.
</P>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Sonstiges">Sonstiges</A></H2>
 Die konkurrierenden <B>56K-Modem-Standards</B> sind geeint. In der ITU
(International Telecommication Union) wurde <B>V.90</B> beschlossen. Viele
bereits ausgelieferte Modems alten Standards werden updatebar sein.
</P>
<HR WIDTH="50%">
<P>
<A HREF="http://home.netscape.com/">Netscape</A> hat den Sourcecode ihres Navigators freigegeben. Theoretisch
kann er also von dritter Seite weiterentwickelt oder auf andere Systeme
umgesetzt werden.
</P>
<HR WIDTH="50%">
<P>
<A HREF="http://www.operasoftware.com">Opera</A>, ein relativ neuer Web-Browser aus dem PC-Sektor, der mit im
Vergleich geringen Ressourcen auskommt, daf&uuml;r aber etwas kostet, soll
auch auf andere Systeme umgesetzt werden. Opera Software hatten auf
ihrer Homepage eine Umfrage gestartet und nach zahlreichen eMails von
Amiga-Anwendern auch den Amiga in die Liste der m&ouml;glichen Systeme
aufgenommen. Dazu und zur Situation der Browser allgemein siehe auch
den Beitrag &quot;<A HREF="browser.htm">Der Browser-Krieg</A>&quot;.

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="intern.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
