<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Packet Radio - News</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Packet Radio-News</H1>von<BR><A HREF="mailto:R.Franke@gmx.de">Rene Franke</A></DIV>

<P>Nachdem ich die Leser des AmZeigers mit einem Artikel &uuml;ber Packet Radio
[in der letzten Ausgabe; d.Red.] auf CB-Funk bel&auml;stigt habe :-), m&ouml;chte
ich nun noch ein paar <B>wichtige Informationen</B> dazu loswerden.
</P><P>
Jeder der sich noch nicht dazu entschlossen hat, sollte meine Ausf&uuml;hrungen
sorgf&auml;ltig lesen.
</P><P>
Im Amtsblatt 32/97 des Bundesamtes f&uuml;r Post und Telekommunikation (BAPT),
seit dem 01.01.98 die Regulierungsbeh&ouml;rde f&uuml;r Telekommunikation und Post,
(RegTP), sind die Verf&uuml;gungen 288/97 und 289/97 erschienen. In diesen
Verf&uuml;gungen werden die Bestimmungen f&uuml;r digitale Betriebsarten wie z.B.
das Packet Radio neu geregelt.
</P><P>
Unter anderem wird dort eine <B>Rufzeichenpflicht</B> zwingend vorgeschrieben.
Diese daf&uuml;r international f&uuml;r Deutschland zugewiesenen Rufzeichen kann
man an folgenden Stellen beantragen:</P>
<PRE><B>Regulierungsbeh&ouml;rde f&uuml;r        bzw.    Regulierungsbeh&ouml;rde f&uuml;r
Telekommunikation und Post             Telekommunikation und Post
Referat 317                            Referat 317
Postfach 8001                          Canisiusstra&szlig;e 21

65122 Mainz                            55003 Mainz</B></PRE><BR><BR>

Bis zum 31.12.1998 k&ouml;nnen Rufzeichen auslaufend auch beim DAKfCBNF, dem:
<P>
<ADDRESS>Deutschen Arbeitskreis f&uuml;r
CB- und Notfunk e.V.,
Postfach 10 13 09,

40004 Duesseldorf</ADDRESS>

beantragt werden.
</P><P>
Dieser Verein hat auf diese Reglungen gedr&auml;ngt.
</P><P>
Der Buschfunk spricht von 50,-DM f&uuml;r die Zuteilung eines solchen
Rufzeichens, allerdings steht in der Verf&uuml;gung nur, da&szlig; die Rufzeichen
gegen eine entsprechende Geb&uuml;hr zugeteil werden. Der DAKfCBNF hat schon
gegen eine solch hohe Geb&uuml;hr Einspruch bei der Regulierungsbeh&ouml;rde
erhoben. (Info aus dem CB-Funk-PR-Netz in Deutschland)
</P><P>
Auf Grund dieser Rufzeichenpflicht ist auf Packet Radio eine heftige
Diskussion entbrannt. Manches artet total aus und mu&szlig; einfach nicht sein.
</P><P>
Ich will mich hier nicht &uuml;ber das "F&uuml;r und Wieder" auslassen, es gibt
nunmal bei jeder Sache Bef&uuml;rworter und Gegner. Ich pers&ouml;nlich halte mich
erstmal an die Vorschriften und besitze schon solch ein Rufzeichen.
Dieses kostete bis zum 31.12.97 nur 15,- DM, war aber noch keine Pflicht.
Ob starker Protest diese Regelung r&uuml;ckg&auml;ngig machen kann, bezweifle ich.
</P><P>
1994 wurde Packet Radio auf CB-Funk zugelassen, immer nur befristet
f&uuml;r ein Jahr, nun wurde praktisch bei der letzten Verl&auml;ngerung die
Rufzeichenpflicht mit eingef&uuml;hrt. Ich bin selber mal gespannt wie es
sich im Laufe des Jahres 1998 entwickeln wird und ob man massiv gegen
&quot;Querulanten&quot; vorgehen wird oder nicht. Ich k&ouml;nnte es mir aber vorstellen,
da heute jede Beh&ouml;rde &uuml;ber Geldmangel klagt, und dort er&ouml;ffnet sich wieder
ein neue Geldquelle.
</P><P>
Viele sind gegen diese Rufzeichenpflicht und wollen sie kippen! Bei
solchen Preisen ist das auch keine Wunder. Zur Zeit fehlt eine
Rechtsverordnung zur Geb&uuml;hrenfestlegung.
</P><P>
Einige Stimmen im PR-Netz meinen, da&szlig;, wenn die Rufzeichenplicht f&auml;llt,
das das Aus f&uuml;r PR auf CB-Funk sein k&ouml;nnte, da sich die Zulassung auf
die oben genannten Verf&uuml;gungen st&uuml;tzt, die dann nicht mehr g&uuml;ltig sind.
</P><P>
Laut Informationen aus dem CB-Funk-PR-Netz hat ein User aus Hessen auf
Nachfrage bei der juristischen Fakult&auml;t G&ouml;ttingen zur Callpflicht die
Antwort bekommen, da&szlig; die Callpflicht rechtlich per einstweiliger
Verf&uuml;gung des BMPT verankert ist! :-(
</P><P>
Ich kann euch f&uuml;r den CB-Funk folgende Internetadresse empfehlen:
</P><P>
<A HREF="http://www.forengruppe.de/HyperNews/get/cb.html">http://www.forengruppe.de/HyperNews/get/cb.html</A>
</P><P>
Weitere Interessante Info's zu diesem Thema gibts auch unter:
</P><P>
<A HREF="http://home.t-online.de/home/funkmagazin/">http://home.t-online.de/home/funkmagazin/</A>
</P><P>
sowie unter der URL:
</P><P>
<A HREF="http://www.cb-funk.org/">http://www.cb-funk.org/</A>
</P><P>
Dort bekommt man die neusten Info's &uuml;ber CB-Funk und vor allem &uuml;ber PR.
Rufzeichenantr&auml;ge werden bis zur Geb&uuml;hrenfestlegung zwar von der RegTP
entgegengenommen aber nicht bearbeitet. Die Rufzeichenstelle des
DAKfCBNF dagegen gibt weiterhin die Rufzeichen aus.
</P><P>
Meine neue PR-Adresse ist nun DAB538 @DBX953.#BLF.BRB.DEU.EU
</P><P>
Mfg<BR>
Rene
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="browser.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9803iv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
