<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Review: Aqua</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Review: Aqua</font></center></h1></P>
<p><center><img src="aqua1.jpg"></center></P><br>
<p>Adventures haben auf dem Amiga eine lange Tradition, auch wenn bei weitem nicht mehr so viele Games aus diesem Genre erscheinen, wie noch vor einigen Jahren. Mit &quot;Aqua&quot; aus dem Hause Emerald Images ist nun ein neues Game erschienen. Mal sehen, ob Adventure s&#252;chtige Amiganer damit ordentlichen Nachschub f&#252;r ihren geliebten Rechner bekommen.</P>

<p><h2><center><font color="yellow">Obligatorisches</font></center></h2></P>

<p>Wie so viele aktuelle Games auf dem Amiga kommt auch Aqua auf einer selbstgebrannten, mit knapp 170 MB belegten CD Rom daher - unn&#246;tig zu erw&#228;hnen, dass sowohl das Cover als auch der Backdrop lediglich ausgedruckt wurden. Na ja, auch wenn professionelle Spiele anders aussehen, wollen wir uns hier nicht mit Nebens&#228;chtlichkeiten aufhalten und gehen somit gleich zu den Anforderrungen &#252;ber:</P><ul>

<p><li>68020</LI><BR>
<li>AGA</LI><BR>
<li>8 MB Ram</LI><BR>
<li>OS 3.X</LI><BR>
<li>CD Rom Laufwerk</LI><BR>
<li>Festplatte</UL></P>

<p>Grafikkarten werden via Picasso96 / CyberGFX nat&#252;rlich auch unterst&#252;tzt, auch wenn das Spiel keinen direkten Gebrauch davon macht. Es l&#228;uft zwar, aber 16-bit Screens und &#228;hnliche Spielereien bleiben leider aussen vor. Somit sollten diese Anforderrungen eigentlich keinen User davon abhalten, Aqua zum laufen zu bewegen. Eine Installation auf Festplatte ist zwar machbar, aber nicht zwingend n&#246;tig.</P>

<p><h2><center><font color="blue">Die Story</font></center></h2></P>
<p>Eigentlich ist die Story ziemlich - na ja - einfach konstruiert und dient nur als Mittel zum Zweck: So verschwindet bei schwerem Unwetter eine &#214;lstation auf mysteri&#246;se Art und Weise. Die Hauptfigur - der Spieler - h&#246;rt von diesem Unfall und macht sich v&#246;llig uneigenn&#252;tzig auf die Suche nach wertvollen &#220;berresten der &#214;lstation und mietet sich daf&#252;r ein entsprechendes Unterseebot an. Tja, und damit darf der Spieler dann seine Reise in die Tiefen des
Meeres beginnen. Eigentlich ziemlich langweilig, oder? Insofern kann man sich auch den &quot;Genuss&quot; des kurzen Intro`s spaaren, welches diese Story wiedergibt. Die grafische Qualit&#228;t ist dabei recht schwach ausgefallen (Vergleiche mit anderen Plattformen verbieten sich von alleine) und auch die Aufl&#246;sung ist viel zu gering - ganz zu schweigen von der pixeligen Darstellung....</P>

<p><h2><center><font color="white">Die Technik</font></center></h2></P>
<p>Gesteuert wird Aqua bequem per Maus. Der Spieler verfolgt das Spielgeschehen aus der Ich-Perspektive und sieht damit immer genau das, was die Hauptfigur sieht. Dabei wird - &#228;hnlich wie bei Myst - st&#228;ndig zwischen den verschiedenen Bildschirmen umgeschaltet und Aktionen k&#246;nnen mittels einem Click auf den Mauszeiger einfach ausgef&#252;hrt werden. Eine Liste mit Verben wie bei den alten Lucasfilm Adventures gibt es bei Aqua nicht, was den Schwierigkeitsgrad ein wenig vereinfacht. Alles in allem eine praktische L&#246;sung f&#252;r ein Adventure.</P>

<p>&#220;berhaupt nicht zufrieden bin ich hingegen mit der grafischen Qualit&#228;t dieses Spiels. So wirkt die Grafik - die man am besten in einem High Res-&#228;hnlichem Modus bestaunt - im gesamten Spiel einfach zu detaillos und farbenarm und erinnert mich eher an das eine oder andere gehobenere Sharewarespiel als ein kommerzielles Adventure. Mir ist zwar durchaus bewusst, dass man nicht jedes Spiel auf dem Amiga heutzutage mit PC Spielen vergleichen kann, aber dennoch sollten auch Amiga Spiele im Jahre 2001 ein gewisses Mass an grafischer Qualit&#228;t zu bieten haben. Vergleiche mit &quot;Myst&quot; verbieten sich ebenso wie mit den detallierten Grafiken des Klassikers &quot;Hexuma&quot; (kennt den noch jemand??). &#196;hnliche Tatsachen lassen sich auch beim Sound feststellen: Nette Ans&#228;tze, aber insgesamt alles etwas zu unausgereift bzw. unprofessionell f&#252;r ein kommerzielles Spiel. Das mag aber alles auch daran liegen, dass es sich bei Aqua um ein 2-Mann Projekt gehandelt hat und dadurch 
zwangsweise nicht alles so elegant aussehen kann, wie bei Games auf anderen Plattformen.</P>


<p>Der Schwierigkeitsgrad ist an sich recht angemessen und wenn man sich von den grafischen Schwachstellen nicht abhalten l&#228;sst, Aqua zu spielen, kann man durchaus in diese Welt abtauchen. Die R&#228;tsel sind allesamt auf jeden Fall zu knacken, auch wenn einige schwierige Kopfn&#252;sse dabei sind. Anyway, erfahrene Adventure Fans werden die R&#228;tsel wohl eher nebenbei l&#246;sen und die Handlung als &quot;nett, aber eher unspektakul&#228;r&quot; bezeichnen. Da der Schwierigkeitsgrad aber immer fair ist, kommt sogar soetwas wie Langzeitmotivation auf, was insbesondere bei Adventures vom klaren Vorteil ist.</P><p><center><img src="aqua2.jpg"></Center></P><br>

<p><h2><center><font color="red">Fazit</font></center></h2></P>
<p>Wie bei so vielen neueren Amiga Spielen merkt man auch &quot;Aqua&quot; zu deutlich an, dass es sich um ein Projekt einer Hobby Softwareschmiede und keinesfalls um das Ergebniss eines gro&#223;en Softwarehauses handelt. Das ist zwar schade, aber leider nicht &#228;ndern. Wer die daraus resultierenden M&#228;ngel - hier sei insbesondere die Grafik genannt - &#252;bersehen kann und dem Adventure Genre ansonsten auch nicht abgeneigt gegen&#252;bersteht, kann der Demoversion (Aminet) ja mal einen Testdurchlauf unterziehen. Blind zugreifen w&#252;rde ich bei Aqua jedenfalls nicht, auch wenn der Verkaufspreis mit 39 DM dann doch wieder sehr human angesetzt wurde und das Spiel somit nur ein wenig teurer geworden ist als einige Sharewarespiele..... </P>





<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
