<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Andreas Guldner</a></b></li>
<li><a href="#a2"><b>f&uuml;r Martin Voepel</a></b></li>
<li><a href="#a3"><b>f&uuml;r Rainer Thieke</a></b></li>
</ul>
<table width=100% border=0 cellpadding=6><tr><td>
<hr size=4>
<h3><a name="a1">Gr&uuml;&szlig; dich Andreas!</h3>

<p><font color="#006000"><b>Mit zukunftsweisenden Produkten und innovativen
Dienstleistungen auf Basis von Powerline Communication und anderer
Technologien bahnen wir Wege in die Zukunft der Kommunikation.
</font></b></p>

<p>Mit diesen Worten hatte ich meine Artikelreihe eingeleitet. Eine Aussage
von RWE selbst. Dabei hatte ich die Dreiteilung von <b>Powerline</b>
aufgezeigt und auch gesagt, dass eHome das j&uuml;ngste Glied in dieser
Reihe ist. Nat&uuml;rlich kenne ich den Aktualit&auml;tsstand bei RWE
nicht, nehme aber an, dass jetzt erst einmal das PowerNet forciert wird und
wenn ausreichend Erfahrungen vorliegen, dass erst dann an das "Eingemachte"
bei eHome gegangen wird. </p>

<p>Einen eigenen Erfahrungsbericht &uuml;ber eHome werde ich wohl nicht
erstellen, denn bisher verlasse ich mich noch auf meinen Verstand, mein
Ged&auml;chtnis und meine H&auml;nde. Und ein wenig Eigeninitiative
bez&uuml;glich meines Haushaltes m&ouml;chte ich schon selber aus&uuml;ben.
Aber wo ich wirklich eine Chance sehe, ist PowerNet. Da werde ich wohl
gezielter am Ball bleiben und mir auch eher als DSL in Verbindung mit ISDN
zulegen. Und wenn der Strom einmal bedingt durch Gewitter ausfallen sollte,
in dieser Zeit bin ich auch &uuml;ber Telefonleitung <b>nie</b> im Netz.
</p>

<p>Solltest du dich wirklich daf&uuml;r interessieren, dann gehe auf die
Homepage von RWE und lade dir die PDF-Dateien herunter und schaue sie dir
dann in Ruhe an. Solltest du auch nur Amiga (wie ich) nutzen, dann kann ich
dir bei dem Programm APDF und den notwendigen Zus&auml;tze helfen. Mir
wurde beim G&ouml;ttinger Treffen hier vorz&uuml;glich geholfen. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf. <br>
<a href="#top"><b>zum Anfang</b></a>
<hr size=4></p>
<h3><a name="a2">Gr&uuml;&szlig; dich Martin!</h3>

<p>Vielen Dank f&uuml;r deine M&uuml;he, ein neues Banner f&uuml;r die
Wolf-INFO zu entwerfen und zu verwirklichen. Wenn ich wieder sinnvollen
Stoff habe, werde ich es gerne benutzen. </p>

<p>Die Fehlfunktion von Voyager 2.95 bei Verwendung von align innerhalb von
Tags ist mir bewusst, nur ging ich von der Annahme aus, dass dieser Browser
&uuml;berhaupt nicht mehr genommen wird, da u.a. die Javasript
Unterst&uuml;tzung fehlt und ein Besuch im Internet keine Freude mit diesem
Browser ist. Alle User, die auf Voyager schw&ouml;ren, haben eine aktuelle
Dreier-Version. Nur da ich keine habe, kann ich die Auswirkungen auf die
Darstellung nicht nachvollziehen. Einen Einwand, dass man mit Voyager nicht
ins Netz gehen will, kann ich nicht nachvollziehen, da f&uuml;r den reinen
Localbetrieb AWeb3.3-LocalDemo ohne Zeitbegrenzung und nach Angleichung der
PlugIns ein einwandfreier Betrieb auf dem Amiga gew&auml;hrleistet ist.
</p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf. <br>
<a href="#top"><b>zum Anfang</b></a>
<hr size=4></p>

<h3><a name="a3">Gr&uuml;&szlig; dich Rainer!</h3>

<p>Im letzten Brief sagte ich schon, dass ich alle Aminet-CD's bis
einschlie&szlig;lich Nr. 40 habe und da gibt es unter dem Stichwort
"Fireball"f&uuml;nf Vorkommen
<table border=0><tr><td width=10>&nbsp; </td>
<td>Fireball.lha </td><td> pix/trace </td> <td> CD-2 </td> <td> ein
gerendertes HAM-8 Bild von Chris Green </td></tr>
<tr><td>&nbsp; </td>
<td>Fireballs.lha </td><td> mods/misc </td><td> CD-4 </td><td> mod.fireballs
von Martin Wall (9.9.90)</td></tr>
<tr><td>&nbsp; </td>
<td>Fireball.lha </td><td> game/misc </td><td> CD-5 </td>
<td>Ein 3-Level Demo des Arkanoid type games </td></tr>
<tr><td>&nbsp; </td>
<td>Fireball.txt </td><td> docs/review </td><td> CD-12 </td>
<td>Ein Bericht &uuml;ber die Quantum Fireball 1280A (IDE-Harddrive)
</td></tr>
<tr><td>&nbsp; </td>
<td>Fireball.lha </td><td> mods/xceed </td><td> CD-21 </td>
<td> fast and melodic synthesizer module einer polnischen Gruppe
</td></tr></table>

Daten, die nach dem 01.12.2000 ins Netz gestellt wurden, habe ich
dementsprechend nicht auf CD vorliegen. </p>

<p>Es freut mich immer, wenn meine NC-Guide Zuspruch erh&auml;lt, und
insbesondere, wenn man sich dann im Updatedienst per E-Mail aufnehmen
l&auml;sst. Dann wei&szlig; ich, dass ich die ganze Arbeit nicht nur
f&uuml;r mich alleine mache. Deiner Bitte, die Gesamtdatei per E-Mail
zuzusenden, habe ich nicht entsprochen, sondern dich per E-Mail gebeten,
die Datei von meiner Homepage zu ziehen, respektive habe ich dich nochmals
gefragt, ob du wirklich eine Anlage von fast 1 MB ohne Ank&uuml;ndigung
bekommen m&ouml;chtest. Eine Antwort habe ich nicht bekommen und auch keine
auf Grund einer weiteren Nachfrage. Du kannst dir wohl mein Erstaunen
vorstellen ?! </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf. <br>
<a href="#top"><b>zum Anfang</b></a>
<hr size=4></p>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<
<br>
</body>
</html> 
