<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><h1><center><font color="green">Leserbrief von Kilian Servais</font></center></h1></P>

<p><b>Hi Rainer!</B><BR>
Tja, wie Du unschwer am Editorial dieser Ausgabe festgestellt haben d&#252;rfest, habe ich das &quot;sinkende Schiff NC&quot; &#252;bernommen und hoffe, diese wieder attraktiver machen zu k&#246;nnen und will mich - vertriebstechnisch - am Beispiel der 4ever / Fireball orientieren. Ob es klappt, kann ich noch nicht sagen, aber ich bin optimistisch was das angeht. Hoffe auch, dass Du uns nun doch noch l&#228;nger erhalten bleibst :-)))</P>

<p>Nachdem ich die siebte Ausgabe der Fireball erhalten habe, war ich auch ein wenig entt&#228;uscht &#252;ber die Beteiligung. Nicht nur aus diesem Grunde habe ich Gucky vor einigen Tagen auch angeschrieben, ob er Interesse daran h&#228;tte, die Fireball in der NC &quot;aufgehen&quot; zu lassen. Immerhin h&#228;tten wir dann wieder ein starkes Online / Freeware Mag auf dem Amiga und nicht zwei Mags, die verzweifelt nach Miatarbeitern rufen. Leider habe ich bisher noch keine Antwort erhalten, aber wenn das klappen w&#252;rde, w&#228;re das doch die Chance, auch wieder alle anderen alten Members an Bord zu holen. Und die NC w&#252;rde in eine positive Zukunft blicken, die vielleicht etwas anders aussieht, als bisher geplant, aber dennoch interessant werden k&#246;nnte. Kannst ja mal sagen, was Du davon h&#228;lst :-)))</P>

<p>Aber weg von dem Online Mag Krams hin zum (immer gegenw&#228;rtigen Thema) Metal: Na, an die neue Priest ist wirklich mie&#223; und ich kenne bisher niemanden, der diesem neuen Machwerk der Jungs positiv gegen&#252;bersteht. Selbst die Rock Hard &#228;u&#223;erste sich massiv kritisch (und vergab dann doch 7.5 Punkte!!) und meine subjektive Meinung kannst Du in der aktuellen Metal Corner nachlesen. Da war Halford`s Sologeschoss doch noch von einem ganz anderen Kaliber und auch mit &quot;Painkiller&quot; kann man diese Chose nicht vergleichen. Sorrym aber im momentanen Zustand sind Priest einfach mausetot. Und auf dem BYH Festival haben die mir auhc nicht unbedingt Anlass zu Freudenst&#252;rmen gegeben....</P>

<p>Ein A.R.Pell Special? Du wirst lachen, aber an einer History arbeite ich schon f&#252;r die HMG. Leider wird meine Zeit immer begrenzter (NC, AmigaPlus, Radio Stuff und nun auch noch Zivildienst) und insofern kann ich noch nicht sagen, wann das ganze fertig wird. Pell gef&#228;llt mir - um ehrlich zu sein - um einiges besser als Malmsteen, da er es versteht, Song dienlicher zu schreiben. Was soll ich mit 30 min&#252;tigen Frickelorgien der Extraklasse? Ist ja mal ganz interessant, aber der gute Yngwie &#252;bertreibt es auch manchmal etwas. Pell hat es einfach drauf: Kantige Metal Songs (&quot;Talk Of The Guns&quot;, &quot;Earls Of Black&quot; etc.), epische Nummern mit &#220;berl&#228;nge (&quot;Black Moon Pyramid&quot;, &quot;Masquerade Ball&quot; etc.) und wundersch&#246;ne Balladen (&quot;Silent Angel&quot;). Auch wenn die Alben nicht gerade eine massive Entwicklung aufweisen, mag ich die Band doch sehr und hoffe, dass es in Zukunft ohne gr&#246;&#223;ere Line-up Wechsel weitergeht. Bei den Frontm&#228;nnern war das immer so eine Sache: Im Grunde hat es sich immer um &quot;Hired Guns&quot; gehandelt und mit Gitarren Heroes ohne Probleme auszukommen, scheint auch nicht so einfach zu sein. Na ja, solange die Alben konstant so gut bleiben, ist mir eigentlich egal wer singt.</P> 

<p>BTW: Hast Du eigentlich jemals die offizielle Iron Maiden Bio &quot;Run To The Hills&quot; von Mick Wall gelesen? Ein Kollege hat mir das Teil ausgeliehen und ist schon echt interessant - zumindest die Anfangszeit der Band bis ca. 1982 wird ausf&#252;hrlich beleuchtet. Danacht scheint dem Autor etwas die Lust vergangen zu sein, werden die kommenden Jahre f&#252;r meinen Geschmack doch etwas stiefm&#252;tterlich behandelt. Trotzdem recht cool und sehr am&#252;sant, wenn man sich so manche Aussage der Herren Harris, Dickinson &amp; Co. im Jahre 2001 nochmal so vor Augen h&#228;lt...</P>

<p>Mit Zivildienst fange ich am 3.9 (meinem Birthday) an und bin also gerade dabei, wenn Du diese Zeilen lie&#223;t. Bin auch T2 geworden, aber mich hat der Staat leider nicht mal eben so &#252;bersehen. Noch besser war es bei einem Kollegen: Wegen eines kleinen Herzfehlers wurde er ausgemustert, hat aber das Abitur in Sport gemacht. Da sieht man es mal wieder - alles ungerechtigkeit.</P> 

<p>Hey, du spielst auch Fu&#223;ball? Vielleicht sollten wir mal ein Amiga Fu&#223;ball Team zusammen stellen und dann alle anderen Plattformen abzocken. Ich spiele auch in einer Hobby Fu&#223;ballmannschaft in der BKV Liga (jeden Samstag geht es ran...) - l&#228;uft zwar momentan nicht ganz so gut, aber es geht schon. F&#252;r RWE  l&#228;uft es ja auch nicht mehr so dolle :-)))</P>

<p>See ya!</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
