<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">
<HTML>
<HEAD>
<META NAME="AUTHOR" CONTENT="Martin Voepel">
<TITLE>Grafikformate und ihre Konvertierung auf dem Amiga für die NoCover, im Internet und sonstwo Teil:1</TITLE>
</HEAD>
<BODY BACKGROUND="mv_bp_ring.gif" BGCOLOR="#EE9900" TEXT="#000000" LINK="#000000" ALINK="#000000" VLINK="#000000">
<a name="top">
    <TABLE WIDTH="100%">
      <TR>
            <TD WIDTH="50"></TD>
      <TD>
    <BR>
    <H1>Grafikformate und ihre Konvertierung auf dem Amiga für die NoCover, im Internet und sonstwo</H1>
    <BR>
    <a href="#a0"><IMG SRC="mv_runter.gif"></A>&#160;Einleitung<BR>
    <a href="#a1"><IMG SRC="mv_runter.gif"></A>&#160;Beschreibung der Grafikformate und Anmerkungen von mir<BR>
    <UL>
    <a href="#a2"><IMG SRC="mv_runter.gif"></A>&#160;GIF<BR>
    <a href="#a3"><IMG SRC="mv_runter.gif"></A>&#160;JPEG<BR>
    <a href="#a4"><IMG SRC="mv_runter.gif"></A>&#160;PNG<BR>
    </UL>
    <A HREF="ws_grafikformate_2.html"><IMG SRC="mv_rechts.gif"></A>&#160;Bilder und Grafiken um die unterscheide deutlich zu machen<BR>
    <a href="#a5"><IMG SRC="mv_runter.gif"></A>&#160;Programme zum erstellen und Konvertieren von Grafiken<BR>
    <a href="#a6"><IMG SRC="mv_runter.gif"></A>&#160;Noch ein Tipp:<BR>
    <BR>
    <HR><a name="a0">
    <H3>Einleitung</H3>
    <BR>
    In den letzten Tagen habe ich mich mit den verschiedenen Grafikformaten f&uuml;r Internet-Seiten besch&auml;ftigt, weil ich eigentlich nicht genau wusste welches Vormat ich f&uuml;r welche Grafik, Bild, Foto usw. benutzen soll. Da ich mir gedacht habe, es geht anderen genauso, habe ich nun diese Seite erstellt. Die Texte stammen aus <B>SELFHTML 7.0</B> und sind dann von mir noch erg&auml;nzt worden<BR>
    <P ALIGN="RIGHT"><a href="#a1"><IMG SRC="mv_runter.gif""><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR><a name="a1">
    <H3>Beschreibung der Grafikformate und Anmerkungen von mir</H3>
    <BR>
    <BLOCKQUOTE>Im WWW haben sich zwei Dateiformate f&uuml;r Grafiken durchgesetzt, die von allen modernen Browsern &quot;inline&quot;, also im eigenen Fenster angezeigt werden k&ouml;nnen: die Formate GIF und JPEG. Bei beiden Formaten handelt es sich um pixelorientierte Formate. Die St&auml;rken beider Formate liegen jedoch auf unterschiedlichen Gebieten. Dazu kommt ein neues, vielversprechendes Format, das noch in der Entwicklung ist, aber die Vorteile von GIF und JPEG in sich vereint: das PNG-Format.</BLOCKQUOTE>
    <H5 ALIGN="RIGHT">Text aus: SELFHTML 7.0<BR>
    WWW-Adresse: http://www.teamone.de/selfhtml/<BR>
    &copy; 1998, <a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></H5>
    <BR>
    <HR WIDTH="60%">
    <B>IBrowse</B> und <B>Voyager</B> haben mit allen drei Formaten beim anzeigen keine Schwierigkeiten.<BR>
    <B>AWeb</B> hat mit den Formaten GIF und JPEG keine Schwierigkeiten, aber mit Animirten GIF-Grafiken und mit "durchsichtigen"-Farben (Farbe 1) bei PNG-Bildern (was aber wohl <I>Data Typ</I> und Einstellungsabhängig ist).<BR>
    Anderen Amiga-Programmen sind diese Formate meistens &uuml;ber die <I>Data Typs</I> zug&auml;nglich zu machen.<BR>
    <P ALIGN="RIGHT"><a href="#a2"><IMG SRC="mv_runter.gif"><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR><a name="a2">
    <H3>Das GIF-Format</H3>
    <BR>
    <BLOCKQUOTE>Das GIF-Format gilt als das &quot;Haus-&quot;Format von CompuServe und wurde speziell f&uuml;r den Online-Einsatz entwickelt. Es zeichnet sich durch eine hohe Komprimierungsdichte aus (zum Vergleich: Bitmap-Dateien im BMP-Format sind bei gleichem Inhalt durchschnittlich zehnmal bis drei&szlig;ig mal so umfangreich wie GIF-Dateien).<BR>
    <BR>
    Der jetzt g&uuml;ltige Standard des GIF-Formats ist das sogenannte &quot;89er-Format&quot;. Dieses Format bietet drei M&ouml;glichkeiten an, die das GIF-Format f&uuml;r den Einsatz im WWW besonders interessant machen:<BR>
    <BR>
    <ul>
    <li>Die M&ouml;glichkeit, eine Datei &quot;interlaced&quot; abzuspeichern. Eine Grafik, die so abgespeichert ist, wird beim Laden nicht zeilenweise eingelesen und aufgebaut, sondern schichtweise. Gerade bei der Online-&uuml;bertragung ist das sehr hilfreich. Denn so erscheint die Grundstruktur der Grafik sehr schnell am Bildschirm des Anwenders. Beim weiteren Einlesevorgang wird die Grafik dann immer deutlicher und feiner aufgel&ouml;st am Bildschirm angezeigt.</li>
    <li>Die M&ouml;glichkeit, mehrere Grafiken in einer einzigen Grafikdatei zu speichern, verbunden mit Optionen zur Steuerung der Einzelgrafiken. Mit Hilfe dieses Features des GIF-Formats sind animierte Grafiken realisierbar.</li>
    <P ALIGN="CENTER"><IMG SRC="ws_g_allopen.gif" ALT="Anim GIF" WIDTH="254" HEIGHT="39" HSPACE="5" VSPACE="5"></P>
    <li>Die M&ouml;glichkeit, eine Farbe, die in der Grafik vorkommt, als &quot;transparent&quot; zu definieren. Mit Hilfe dieses Features lassen sich transparente Hintergr&uuml;nde bei Grafiken definieren, wodurch Sie auf WWW-Seiten sehr reizvolle Effekte erzielen k&ouml;nnen.</li>
    </ul>
    <BR>
    Ein Nachteil des GIF-Formats ist, da&szlig; es maximal 256 Farben pro Datei speichern kann. Ein Pluspunkt ist dagegen, da&szlig; GIF-Grafiken verlustfrei komprimieren. Aufgrund seiner Charakteristik ist das GIF-Format f&uuml;r hochaufl&ouml;sende Grafiken wie Fotos oder fein strukturierte Wallpaper-Hintergr&uuml;nde nicht so sehr geeignet. Ideal ist das GIF-Format f&uuml;r Buttons, Dots, Bars, Symbole und Cliparts</BLOCKQUOTE>
    <H5 ALIGN="RIGHT">Text aus: SELFHTML 7.0<BR>
    WWW-Adresse: http://www.teamone.de/selfhtml/<BR>
    &copy; 1998, <a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></H5>
    <BR>
    <HR WIDTH="60%">
    Zum schnelleren laden ist h&auml;ufig die ausnutzung von 256 Farben oft gar nicht erforderlich und man kann sich mit wesentlich weniger Farben zufriden geben.<BR>
    Eine Abstufung von 2, 4, 8, 16, 32, 64, 128 und 256 Farben sollte aber eingehalten werden.<BR> 
    Als Indizes (Index) hat sich <B>xyz<I>.gif</I></B> durchges&auml;tzt.<BR>
    <P ALIGN="RIGHT"><a href="#a3"><IMG SRC="mv_runter.gif""><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR><a name="a3">
    <H3>Das JPEG-Format</H3>
    <BR>
    <BLOCKQUOTE>Bei JPEG, entwickelt von der <b>J</b>oint <b>P</b>hotographic <b>E</b>xpert <b>G</b>roup, handelt es sich um ein Grafikformat, das auf dem Komprimierungsalgorithmus DCT (Diskrete Cosinus Transformation) in Verbindung mit der Huffman-Kodierung basiert. Da dieses Verfahren zun&auml;chst nur f&uuml;r statische Grafiken von Bedeutung war, entstand das gleichnamige Dateiformat f&uuml;r Bilder. Mittlerweile wird der JPEG-Algorithmus auch auf Videos angewendet und hat das zukunftsweisende Video-Format MPEG hervorgebracht.<BR>
    <BR>
    Das JPEG-Grafikformat komprimiert ebenfalls sehr gut und hat gegen&uuml;ber dem GIF-Format den Vorteil, da&szlig; es pro Bild bis zu 16,7 Millionen Farben speichern kann. Der Nachteil ist, da&szlig; JPEG mit Verlust komprimiert, d.h. je h&ouml;her der Komprimierfaktor, desto schlechter die Qualit&auml;t der Grafik. Aufgrund seiner Charakteristik eignet sich das JPEG-Format vor allem zum WWW-gerechten Abspeichern von eingescannten Fotos, aber auch f&uuml;r andere Grafiken, in denen sehr feine Farbverl&auml;ufe vorkommen.<BR>
    <BR>
    Beim JPEG-Format k&ouml;nnen Sie bei besseren Grafikprogrammen zwei Parameter selbst bestimmen:<BR>
    <ul>
    <li><b>Die DPI-Dichte:</b> Das ist die Punktdichte (dpi = dots per inch). Bei JPEG-Dateien, die Sie f&uuml;r die Anzeige in WWW-Seiten ben&ouml;tigen, reicht ein Wert zwischen 70 und 100 dpi.</li>
    <li><b>Den Kompressionsfaktor:</b> Je h&ouml;her der Kompressionsfaktor, desto schlechter die Bildqualit&auml;t. Ein Komprimierungsfaktor von 5 bis 10 ist f&uuml;r eine gute Bildqualit&auml;t ein sinnvoller Wert.</li>
    </ul>
    <BR>
    Es gibt eine Variante von JPEG-Grafiken, sogenannte &quot;progressive JPEG-Grafiken&quot;. Dabei wird, &auml;hnlich wie beim GIF-Format in der Variante &quot;interlaced&quot;, zuerst eine vollst&auml;ndige, aber noch undeutliche Fassung der Grafik am Bildschirm aufgebaut. Das erste, noch nicht ganz deutliche Bild kann bereits am Bildschirm angezeigt werden, nachdem etwa 15% der Grafikdatei an den aufrufenden WWW-Browser &uuml;bertragen wurden.<br>
    Netscape kann in neueren Versionen progressive JPEG-Dateien korrekt anzeigen.</BLOCKQUOTE>
    <H5 ALIGN="RIGHT">Text aus: SELFHTML 7.0<BR>
    WWW-Adresse: http://www.teamone.de/selfhtml/<BR>
    &copy; 1998, <a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></H5>
    <BR>
    <HR WIDTH="60%">
    Das JPEG-Format eignet sich besonders gut f&uuml;r eingescannte Fotos, aber auch f&uuml;r sehr fein strucktruirte Hintergr&uuml;nde (BACKGROUND=xyz.jpg).<BR>
    Je gr&ouml;sser die Kompressionsrate desto mehr Bildinvormation geht aber verloren und die Bilder sehen leicht verschwommen aus aber die Datei-grosse ist noch annehmbar. In der NC ist eine Kompressionsrate von ca. 75% empfelenswert, bei 72 - 100 dpi. <BR>
    Als Indizes (Index) hat sich <B>xyz<I>.jpg</I></B> durchges&auml;tzt.<BR>
    <P ALIGN="RIGHT"><a href="#a4"><IMG SRC="mv_runter.gif""><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR><a name="a4">
    <H3>Das PNG-Format</H3>
    <BR>
    <BLOCKQUOTE>PNG bedeutet <b>P</b>ortable <b>N</b>etwork <b>G</b>raphic (ausgesprochen: PING). Es handelt sich um ein Grafikformat, das eigens f&uuml;r den Einsatz im WWW konzipiert wurde. PNG soll alle Vorteile von GIF und JPEG in sich vereinen:<BR>
    <ul>
    <li>PNG komprimiert verlustfrei wie das GIF-Format</li>
    <li>PNG unterst&uuml;tzt 16,7 Mio. Farben wie das JPEG-Format</li>
    <li>PNG ist wie GIF und JPEG plattformunabh&auml;ngig</li>
    <li>PNG unterst&uuml;tzt transparente Hintergrundfarben wie das GIF-Format</li>
    <li>PNG erlaubt das Abspeichern zus&auml;tzlicher Information in der Grafikdatei, z.B. Autor- und Copyrighthinweise</li>
    </ul></BLOCKQUOTE>
    <H5 ALIGN="RIGHT">Text aus: SELFHTML 7.0<BR>
    WWW-Adresse: http://www.teamone.de/selfhtml/<BR>
    &copy; 1998, <a href="mailto:muenz@csi.com">Stefan M&uuml;nz, muenz@csi.com</a></H5>
    <BR>
    <HR WIDTH="60%">
    Ich pers&ouml;nlich finde das PNG-Format f&uuml;r Grafiken (nicht f&uuml;r Fotos) recht gut geeignet. Es kann wie das GIF-Format behandelt werden. Es sind Farbanzhlabstufungen von 2 bis 16,7 Mio. Farben m&ouml;glich.<BR>
    Als Indizes (Index) hat sich <B>xyz<I>.png</I></B> durchges&auml;tzt.<BR>
    <P ALIGN="RIGHT"><a href="#a5"><IMG SRC="mv_runter.gif""><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR>
<!-- Bilder -->
<A HREF="ws_grafikformate_2.html"><IMG SRC="mv_rechts.gif"></A>&#160;Bilder und Grafiken um die unterscheide deutlich zu machen<BR>
    <P ALIGN="RIGHT"><a href="#a5"><IMG SRC="mv_runter.gif"><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR><a name="a5">
    <H3>Programme zum erstellen und Konvertieren von Grafiken</H3>
    <BR>
    Die folgende Liste ist nur eine kleine Auswahl von Programmen die ich benutze.<BR>
    <UL>
    <LI><B>PPaint</B> zum bearbeiten von Bildern und zum Speichern in den Formaten PNG und IFF.
        <UL>
        <LI>Das IFF-Format w&auml;hle ich, weil es auf dem Amiga in alle anderen Bildverarbeitenden Programmen ohne grosse Probleme einf&uuml;gen l&auml;sst.</UL>
    <LI><B>GfxCon</B> von Dirk Farin zum Konvertieren und Bearbeiten.
    <LI><B>ScreenMugShot</B> von Mark Ritter f&uuml;r ScreenShot's.
    <LI>Von <B>TurboPrint</B> <I>Hardcopy</I> f&uuml;r ScreenShot's
    <LI><B>Scan Quix v5</B> zum Scannen und zum nachbearbeiten.
    <LI><B>fxSCAN v3.0</B> zum Scannen und zum nachbearbeiten.
    <LI>Das <B>ICS</B>-System zum nachbearbeiten von Scanns.
    </UL>
    <P ALIGN="RIGHT"><a href="#a6"><IMG SRC="mv_runter.gif"><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR WIDTH="60%"><a name="a6">
    <H3>Noch ein Tipp:</H3>
    <A HREF="ws_g_scsh2.gif" TARGET="_top"><IMG SRC="ws_g_scsh1.gif" ALT="ScreenShot von PhotoFolio (MINI)" BORDER="2" WIDTH="88" HEIGHT="80" HSPACE="10" VSPACE="10" ALIGN="LEFT"></A>
    <BR>
    Mit Programmen wie <B>PhotoFolio</B> sind recht gut sogennante Thumbnails (Vorschau-Grafiken) zu erstellen. In dem man die Original-Bilder aufruft und dann die kleinen Bildchen wieder ausschneidet.<BR CLEAR="LEFT">
    <P ALIGN="RIGHT"><A HREF="#top"><IMG SRC="mv_rauf.gif"></A></P>
    <HR>
    <P ALIGN="CENTER"><A HREF="mitglieder/voepel.html"><IMG SRC="mv_p.gif" BORDER="0" WIDTH="315" HEIGHT="47"></A></P>
    <HR>
<A HREF="ws_grafikformate_2.html"><IMG SRC="mv_rechts.gif"></A>&#160;Bilder und Grafiken um die unterscheide deutlich zu machen<BR>
    </TD>
      </TR>
    </TABLE>
</BODY>
</HTML>