<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="Gentle Eye Ky">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Uusi alku: AmigaOS 3.9:n asennus, osa 1</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kimmo Kannala &lt;<a href="mailto:aboxb@nic.fi">aboxb@nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tein tuossa sellaisen havainnon, ett&auml; jos Tony Halme aikoo kirjoittaa treenikirjan, niin uskaltaa kai sit&auml; itsekin alkaa kirjoittaa artikkeleita Saku-lehteen. Ehk&auml;p&auml; pitemm&auml;ll&auml; t&auml;ht&auml;imell&auml; jonkinlaisen Amiga-k&auml;ytt&auml;j&auml;n k&auml;sikirjan, mutta aika n&auml;ytt&auml;&auml;, saanko niin paljon aikaiseksi. Alkuverryttelyksi t&auml;ss&auml; on tarinaa ja niksej&auml; AmigaOS 3.9:n asennuksen tiimoilta.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Taustaa</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Minulla on kotik&auml;yt&ouml;ss&auml; p&auml;&auml;koneena Amiga (jo 15 vuotta) ja toissijaisina pelleilykoneina PC:t, joista yksi toimittaa vaimon opiskelukoneen virkaa. Pitk&auml;t ty&ouml;p&auml;iv&auml;t, PC-koneiden yll&auml;pitohommat kotona yms. ajanhukka on aihettanut sen, ettei Amigalla ole paljoa tullut puuhailtua. Amigan tarjoamat mahdollisuudet ovat kuitenkin se syy, joka sai minut aikanaan kiinnostumaan tietotekniikasta. Amigan emoyhti&ouml; ajautui konkurssiin ja k&auml;ytt&auml;j&auml;kunta j&auml;i heitteille, ja n&auml;in ollen Amiga ei ole ollut minulle varteenotettava vaihtoehto ty&ouml;el&auml;m&auml;ss&auml;.<br>
								<br>
								Nyt alkoi kuitenkin taas tehd&auml; mieli mielek&auml;st&auml;, mukavaa tietotekniikkaharrastusta. &quot;Uudelleen alusta&quot; -ilmaisu on paikallaan siksi, ett&auml; monet Amigan k&auml;yt&ouml;n hienoudet ja niksit ovat unohtuneet viimeisen kymmenen vuoden aikana, ja olen suorastaan tipahtanut kehityksen kelkasta. Joudun alkamaan alusta, Amigan perusteista. Samaisesta syyst&auml; ajattelin my&ouml;s aloittaa Amigan ohjelmiston asentelun ihan alkutekij&ouml;ist&auml;, puhtaalta p&ouml;yd&auml;lt&auml;, uudelta tyhj&auml;lt&auml; kovalevylt&auml;, aivan kuin aikanaan 80-luvulla.<br>
								<br>
								Minulle Amiga on ollut esimerkki siit&auml;, miten tietokoneen ja tietotekniikan tulisi toimia; palvella k&auml;ytt&auml;j&auml;&auml; n&ouml;yr&auml;sti ja ripe&auml;sti, loogisesti ja luotettavasti. En ole viel&auml; n&auml;hnyt mit&auml;&auml;n toista tietokonelaitetta, joka tuntuisi yht&auml; miellytt&auml;v&auml;lt&auml; k&auml;ytt&auml;&auml; kuin Amiga. Kun p&auml;iv&auml;t ty&ouml;paikalla menev&auml;t Windowsia odotellessa, on miellytt&auml;v&auml;&auml; p&auml;&auml;st&auml; kotona k&auml;ytt&auml;m&auml;&auml;n Amigaa ja palauttaa mieleen, mit&auml; tietotekniikka parhaimmillaan voi olla.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>L&auml;ht&ouml;viivalla: vanhat tiedot talteen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amigani on Amiga 4000D, 50 MHz:n 68060-keskussuorittimella, 40 megatavun keskusmuistilla, 20 gigatavun kovalevyll&auml;, kirjoittavalla ja lukevalla CD-asemalla sek&auml; lis&auml;n&auml;yt&ouml;nohjaimella varustettuna. Koneessa on paljon muutakin, mutta ne ovat v&auml;hemm&auml;n olennaisia t&auml;ss&auml; yhteydess&auml;. Kone on lis&auml;ksi on rakennettu omatekoiseen torniin. <br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">OS 3.9:n minimivaatimuksena on CD-asema, kovalevyasema, 68020 tai parempi prosessori, 3.1 kickstart ROM sek&auml; v&auml;hint&auml;&auml;n kuusi megaa keskusmuistia. Suosittelen kuitenkin, ett&auml; jos Amiga-harrastuksen aikoo ottaa tosissaan, kannattaa keskussuoritin olla v&auml;hint&auml;&auml;n 50 MHz:n 68030, keskusmuistia v&auml;hint&auml;&auml;n 32 megaa, kovalevytilaa v&auml;hint&auml;&auml;n gigatavu, lis&auml;n&auml;yt&ouml;nohjain sek&auml; v&auml;ltt&auml;m&auml;t&ouml;n CD-asema (my&ouml;s CD-RW-asema k&auml;y).<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yleens&auml;kin varmuuskopiointi on eritt&auml;in suositeltavaa, ei ainoastaan koneen p&auml;ivitt&auml;misen yhteydess&auml;. T&auml;ll&auml; kertaa p&auml;&auml;tin kokeilla Aminetista l&ouml;ytyv&auml;&auml; ABackup-ohjelmaa. Se tuntui toimivan luotettavasti ja oli kohtalaisen helppo k&auml;ytt&auml;&auml;. Pakkailin kovalevyn sis&auml;lt&ouml;&auml;, kunnes huomasin, ett&auml; aivan yht&auml; hyvin min&auml; saatoin polttaa tiedostot osioilta sellaisenaan CD:lle MakeCD-ohjelmalla. Nooh, tulipahan testattua, se ABackup. ABackupin tyylinen ohjelma on tarpeen etenkin jos varmuuskopion joutuu tekem&auml;&auml;n levykkeille tai siirt&auml;m&auml;&auml;n vaikkapa verkon yli PC:ll&auml; rompulle poltettavaksi. (Olen mm. havainnut Windowsin kaatuvan sen yritt&auml;ess&auml; automaattisesti avata joitain Amigan tiedostoja, ja siksi tiedostot on turvallisempaa siirt&auml;&auml; pakettina.).<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mielest&auml;ni mahdollisesti PC:lle siirrettyj&auml; Amigan tiedostoja ei kannata miss&auml;&auml;n tapauksessa varmuuskopioida levykkeelle Windowsin kovalevyn varmuuskopiointiohjelmalla, vaikkakin Aminetista l&ouml;ytyy ty&ouml;kalut, joilla moisten levykkeiden sis&auml;lt&ouml; voidaan palauttaa takaisin Amigalla. Amigan varmuuskopiointiohjelmat ovat nimitt&auml;in levykkeille kirjoitettaessa ylivertaisen hyvi&auml;. Lis&auml;ksi on muistettava se, ett&auml; levykkeet ovat eritt&auml;in vikaherkki&auml;.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">K&auml;ytt&ouml;j&auml;rjestelm&auml;osiosta tein spesiaalivirityksen, joka ei huutele muiden osioiden per&auml;&auml;n ja k&auml;ynnist&auml;&auml; mahdollisimman v&auml;h&auml;n vanhoja patcheja ja apuohjelmia. T&auml;ll&ouml;in sen ehk&auml; jonain p&auml;iv&auml;n&auml; voisi saada kohtalaisen kivuttomasti buuttaamaan heti varmuuskopiosta palauttamisen j&auml;lkeen tai jopa rompulta, oli koneen muu osiointi mik&auml; tahansa. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jos polttelee tiedostoistaan varmuuskopion CD-RW-levylle, on huomioitava, ettei niit&auml; levyj&auml; v&auml;ltt&auml;m&auml;tt&auml; pysty lukemaan muilla kuin uudehkoilla &quot;multiread&quot;-CD-asemilla tai CD-RW-asemilla.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Kovalevy kuntoon</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Koska aloitin alusta tyhj&auml;lt&auml; osiolta, saatoin vapaasti valita, mink&auml; tiedostoj&auml;rjestelm&auml;n otin k&auml;ytt&ouml;&ouml;n. Amigan vanha FFS on nykymittapuun mukaan hidas ja aiheuttaa koneen kaatuessa toisinaan validointioperaation, joka hidastaa seuraavaa koneen k&auml;ynnistyst&auml; (v&auml;h&auml;n kuten scandisk PC:ll&auml;, sill&auml; erolla ett&auml; Amiga validoi moniajossa). Merkitt&auml;vimpin&auml; vaihtoehtoina ovat kaupallinen Professional Filing System 3 (PFS3) tai Smart File System (SFS).<br>
								<br>
								
								Valitsin SFS:n, koska se on ilmainen, nopea ja kokeiluni perusteella luotettava. Pit&auml;&auml; olla tarkkana, ett&auml; valitsee SFS:st&auml; sellaisen version, joka ei ole kovin buginen (esimerkiksi marraskuussa 2001 tarjolla ollut uusin paketti on kuulemma buginen). SFS osaa tehokkaasti ajoittaa levyjen luku- ja kirjoitustapahtumia siten ett&auml; moniajo nopeutuu. Lis&auml;ksi SFS mm. hallitsee FFS:&auml;&auml; tehokkaamman levypuskureiden k&auml;yt&ouml;n (cache), sekunnin murto-osassa tapahtuvan levyn validoinnin ja osaa jopa kaatumisen j&auml;lkeen kirjoittaa puskuriin j&auml;&auml;neen datan levylle.<br>
								<br>
								
								Tiedostoj&auml;rjestelm&auml;n p&auml;ivitt&auml;minen onnistuu WorkBenchin omalla HDToolbox-ohjelmalla tai HDInstTool-ohjelmalla, jonka voi ladata <a href="http://ftp.sunet.se/pub/aminet/disk/misc/hdinst.lha" target="_blank">Aminetist&auml;</a> (88 kt). P&auml;ivitys kannattaa tehd&auml; tyhj&auml;lle kovalevylle, ennen kuin aloittaa OS3.9 asennuksen, ettei vahingossa tietoja menisi hukkaan. Tarkemmat ohjeet l&ouml;ytyy SFS:n levityspaketeista. P&auml;ivitys onnistui mutkattomasti, tarkempi selostus SFS:st&auml; pit&auml;nee kirjoittaa joku toinen kerta.<br>
								<br>
								
								Kovalevy yleens&auml; kannattaa osioida, jos se on esimerkiksi 20 Gt:n kokoinen, niin kuin minulla. Amigalla eri osioille voi antaa osionnimet, ei mit&auml;&auml;n C, D, E... hirvityksi&auml; (jos ei halua), vaan nimiksi voi laittaa jotain j&auml;rkev&auml;&auml;, esimerkiksi PELI, DATA jne. OS 3.9 osaa k&auml;sitell&auml; mink&auml;kokoisia osioita tahansa, mutta jotkin vanhat ohjelmat eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; ymm&auml;rr&auml; yli 4 Gt:n osiota, ja joillekin ikivanhoille peleille saattaa 2 Gt olla yl&auml;raja. Osioiden koko kannattaa mietti&auml; sen mukaan, mihin tarkoitukseen kunkin osion aikoo k&auml;ytt&auml;&auml;.<br>
								<br>
								
								Varausyksik&ouml;n koko kannattaa Amigassa pit&auml;&auml; pienen&auml;, itsell&auml;ni se on 1 kilotavu. Eri kokoisilla varausyksik&ouml;ill&auml; en ole havainnut merkitt&auml;v&auml;&auml; nopeutumista tai hidastumista (isompi varausyksikk&ouml; voi olla nopeampi, mutta 4 kt suurempaa ei kannattane koskaan k&auml;ytt&auml;&auml;), joten t&auml;rkeimm&auml;ksi varausyksik&ouml;n valinnan kriteeriksi j&auml;&auml;nee se, mink&auml;kokoisia tiedostoja levylle aikoo tallentaa (pienille tiedostoille pieni varausyksikk&ouml;). Varausyksik&ouml;n kokoa kasvatettaessa on huomioitava, ett&auml; bufferien vaatima muistintarve kasvaa samassa suhteessa. SFS tarvitsee paljon buffereita toimiakseen nopeasti, suosittelen v&auml;hint&auml;&auml;n 512 bufferia (512 * 1 kt varausyksikk&ouml; = 512 kt) yleisimmin k&auml;ytetyille osioille, mieluummin 1000 tai jopa enemm&auml;n. 256 on ehdoton minimi.<br>
								<br>
								Ennen kuin uskaltaa heitt&auml;&auml; menem&auml;&auml;n vanhan k&auml;ynnistysosion, on syyt&auml; tehd&auml; k&auml;ynnistyslevyke. K&auml;ynnistyslevyke tarvitaan, koska Amigan boot ROM ei sis&auml;ll&auml; CD-ROM-aseman eik&auml; n&auml;yt&ouml;nohjaimien ajureita (paitsi emolevyll&auml; olevien OCS-, ECS- tai AGA-piirien tuen). Formatoin k&auml;ynnistyslevykett&auml; varten puolenkymment&auml; k&auml;ytetty&auml; levykett&auml;, kunnes viimein sain kaksi niist&auml; toimimaan. Ensimm&auml;inen k&auml;ynnistyslevykkeen tekemisyritys ep&auml;onnistui. Kokeiluvaiheessa ruutu j&auml;i mustaksi, ja vasen Amiga + M -n&auml;pp&auml;imien painaminen paljasti virheilmoituksen, joka kertoi n&auml;yt&ouml;nohjainajurin kaatuneen. Ilmeisesti CyberGraphX3-ajuri ei toimi OS 3.9:n kanssa. Buuttasin uudestaan vanhalla kovalevyll&auml; ja muutin n&auml;ytt&ouml;tilaksi AGA NTSC 640x200 -resoluution 32 v&auml;rill&auml;, sill&auml; olen todennut sen toimivan parhaiten monitorista riippumatta. (My&ouml;hemmin totesin, ett&auml; viel&auml; isompi v&auml;rim&auml;&auml;r&auml; voisi olla parempi, koska silloin OS 3.9:n taustakuva ei h&auml;iritse niin paljoa ikonitekstien lukemista.)<br>
								<br>
								Tallensin asetukset ja tein uuden k&auml;ynnistyslevykkeen, joka t&auml;ll&auml; kertaa toimi t&auml;ydellisesti. My&ouml;hemmin huomasin, ett&auml; se toimi vain sen vuoksi, ett&auml; levykkeelle oli tullut vika, jonka takia CVision3D (CGX3-ajuri lis&auml;n&auml;yt&ouml;nohjaimelle, CyberVision 64/3D:lle) ei ollut latautunut ollenkaan! Kokeilin tehd&auml; viel&auml; uuden k&auml;ynnistyslevyn, jolta varmistin, ett&auml; kaikki tiedostot toimivat kopioimalla ne RAM-levylle ja siirsin CVision3D-ikonin pois levykkeen devs/monitors-hakemistosta. (Sen saa n&auml;kyviin avaamalla levykkeen ikkunan ja valitsemalla yl&auml;valikosta Window -&gt; Show -&gt; All files.) Temppu n&auml;ytti toimivan.<br>
								<br>
								My&ouml;s CD-ROM-asema toimi, kun koneen k&auml;ynnisti k&auml;ynnistyslevykkeell&auml;, mutta CD-RW-aseman ajuri/dosdriver pit&auml;isi varmaan kopioida manuaalisesti. En todenn&auml;k&ouml;isesti tarvitse sit&auml;, koska my&ouml;s uuden CD-ROM-asemani pit&auml;isi pysty&auml; lukemaan CD-RW-levyj&auml;. Jos kuitenkin haluaa saada kaikki asemat toimimaan, niiden ikonit voinee itse raahata (siirt&auml;&auml; hiirell&auml;) k&auml;ynnistyslevykkeen devs/dosdrivers-hakemistoon sek&auml; lis&auml;ksi mahdollisen ajuritiedoston L-hakemistoon. CGX4-ajuri pit&auml;&auml; asentaa aikanaan tulevalle uudelle osiolle OS 3.9:n p&auml;&auml;lle, jotta voin k&auml;ytt&auml;&auml; j&auml;lleen n&auml;yt&ouml;nohjainta.<br>
								<br>
								T&auml;ss&auml; v&auml;liss&auml; ajattelin poistaa vanhan 3 gigatavun kovalevyn. Vanhan k&auml;ynnistysosion 3-gigaisella kovalevyll&auml; olin muuttanut kuten jo aiemmin kuvailin (k&auml;ynnistyslevykett&auml; ja varmuuskopiota varten) eli sellaiseksi, ettei siell&auml; ei en&auml;&auml; ole linkkej&auml; muihin osioihin (etenk&auml;&auml;n startup-sequencessa tai user-startupissa), jotta h&auml;t&auml;tilanteessa sen pit&auml;isi buutata kohtalaisen varmasti. Kopioin koko osion sis&auml;ll&ouml;n talteen pienelle piilotetulle osiolle uudelle kovalevylle. Kokeilin uutta &quot;h&auml;t&auml;tilanteen&quot; osiota ja se toimi, kunhan oli tarkkana boottivalikon kanssa, ett&auml; boottaus ohjautuu oikealle osiolle. Nyt minulla pit&auml;isi olla kaksi tapaa k&auml;ynnist&auml;&auml; kone, jos uusi k&auml;ytt&ouml;j&auml;rjestelm&auml;osio sattuu menem&auml;&auml;n rikki tms.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun kone kerran sattui olemaan auki, asensin 50x-CD-ROM-aseman vanhan 4x-aseman tilalle ja vaihdoin yhden 8 Mt:n simmin 32 Mt:n simmiin, jolloin Fast-muistin m&auml;&auml;r&auml; kasvoi 72 megaan. (My&ouml;hemmin jatkoin 128 megaan, upeasti toimii ja nyt voi jo alkaa surutta k&auml;ytt&auml;&auml; levycachea yms.) </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jostain syyst&auml; OS 3.5:n HDToolBox luulee uuden 50x-romputtimen olevan kovalevy, yritt&auml;&auml; hakea silt&auml; osiotietoja ja menee jumiin moisessa yrityksess&auml;. Pit&auml;nee selvitt&auml;&auml; joku toinen kerta miten tuon saa toimimaan.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b> 1. v&auml;liraportti</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuten edellisist&auml; kappaleista huomaa, n&auml;in todella paljon vaivaa sen varmistamiseksi, ettei tietoja joudu hukkaan ja ett&auml; h&auml;t&auml;tilanteessa saan koneeni elvytetty&auml; takaisin toimintakuntoon. Varsinainen k&auml;ytt&ouml;j&auml;rjestelm&auml;n asennus onnistui paljon helpommin kuin esimerkiksi OS 3.5:n aikana, l&auml;hinn&auml; siksi, ett&auml; 3.5 oli vain p&auml;ivitys, kun taas 3.9 on t&auml;ydellinen k&auml;yttispaketti.<br>
								<br>
								Pettymyksen&auml; huomasin, ett&auml; my&ouml;sk&auml;&auml;n OS 3.9:n HDToolBox ei ymm&auml;rt&auml;nyt uutta CD-asemaa, vaan jouduin tekem&auml;&auml;n viime silauksen osion nimen asettamiseksi buuttaamalla vanhalla kovalevyll&auml; ilman CD-asemaa. Jostain syyst&auml; my&ouml;s CDPlayer menee useimmiten jumiin yritt&auml;ess&auml;ni soittaa sen avulla musiikki-CD:t&auml;. Muilta osin OS 3.9 vaikuttaa hyv&auml;lt&auml;, asiat toimivat niin kuin pit&auml;&auml;kin.<br>
								<br>
								Saadakseni vauhtia n&auml;yt&ouml;nk&auml;sittelyyn halusin mahdollisimman nopeasti asentaa n&auml;yt&ouml;nohjainajurin uudestaan. Operaatio oli sen verran monimutkainen, ett&auml; kirjoitan siit&auml; jutun my&ouml;hemmin, samoin juttua OS 3.9:n mukana tulevien internet-ohjelmien asennuksesta...<br>
								<br>
								Saldona voin sanoa, ett&auml; olen positiivisesti yll&auml;ttynyt OS 3.9:st&auml;. Mukana on kaikenlaisia mukavia uudistuksia, ja ensikokemuksen perusteella k&auml;ytt&ouml;j&auml;rjestelm&auml; on my&ouml;s eritt&auml;in vakaa. Usean p&auml;iv&auml;n virittelyn j&auml;lkeen olen saanut koneen jumittumaan vain kerran asetettuani uuden VinCED-shellin parametrit v&auml;&auml;rin. Uudestaan alusta aloittaminen on osoittautunut kovemmaksi hommaksi kuin mihin osasin varautua, uudelleen opittavaa on ihan tolkuttomasti ja kaikenlaisia kirjastoja joutunen haalimaan pitkin mualimaa, ennen kuin kaikki on viritettyn&auml; huippukuntoon. Mielek&auml;st&auml; ja hauskaa homma kuitenkin on, kuten ennen vanhaan... Kone tottelee eik&auml; Winduile.<br>
								<br>
								JATKUU joskus... ehk&auml;p&auml; jo seuraavassa Sakussa.<br>
								<br>
								<b>Linkkej&auml;:</b><br>
								<a href="http://www.amiga.com/3.9/" target="_blank">Amiga Inc.:n OS 3.9 -sivusto</a></font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
								<a href="http://www.ge.vip.fi" target="_blank">Gentle Eye Ky</a>, s</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">uomalainen Amiga-j&auml;lleenmyyj&auml;, OS3.9, CGX4.<br>
								<a href="http://ftp.sunet.se/pub/aminet/disk/bakup/abackup.lha" target="_blank">ABackup-varmuuskopiointiohjelma</a> (Aminet, 314 kt)<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://home.wtal.de/js/" target="_blank">SFS-tiedostoj&auml;rjestelm&auml;</a>, <a href="http://www.xs4all.nl/~hjohn/SFS/" target="_blank">vanhalta sivustolta</a> l&ouml;ytyy <a href="http://www.xs4all.nl/~hjohn/" target="_blank">vanhempia versioita</a>.<br>
								<a href="http://ftp.sunet.se/aminetbin/find?sfs" target="_blank">Aminetiss&auml;</a> on my&ouml;s SFS-ty&ouml;kaluja sek&auml; asennuspaketteja.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Testit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>