<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA4.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. AMIGA-CTO Dr. Richard LeFaivre wendet sich an die Amiga-Gemeinde</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;26.05.1999&nbsp;</TD><TD VALIGN="TOP">Brief von Amiga's neuem CTO, Dr. Rick LeFaivre&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
<A HREF="img/LeFaivre.jpg"><IMG SRC="thumb/LeFaivre.jpg" WIDTH="120" HEIGHT="95" ALT="Bild"  BORDER="0"></A>
</P>
<P>
Liebe Amiganer,
</P>
<P>
Ich dachte, es w&auml;re angemessen, mich der Amiga-Gemeinde vorzustellen,
nachdem ich im April als Chief Technology Officer und Senior Vice President
der Forschungs- und Entwicklungsabteilung (R&amp;D) bei Amiga angefangen habe.
So wie Jim Collas als unser neuer CEO neue Kommunikationswege bahnt,
versuche ich, so offen wie ich nur kann, &uuml;ber Amiga's Technologie-Visionen
und -Wege zu kommunizieren.
</P>
<P>
Zuerst ein wenig &uuml;ber meinen Werdegang und warum ich bei Amiga bin. 1966
schrieb ich mein erstes Computerprogramm (auf einer IBM 1620) und im Jahre
1967 bekam ich meinen ersten Job als Programmierer. In den vergangenen 32
Jahren war ich privilegiert, an der Computer-Evolution vom Mainframe &uuml;ber
Minicomputer &uuml;ber PCs bis hin zum Internet teilzunehmen. Ich begann meine
Karriere als Professor f&uuml;r Computerwissenschaft, forschte in den Bereichen
K&uuml;nstliche Intelligenz und Advanced Programming Environments (LISP,
SmallTalk und eine KI-Sprache namens &quot;FUZZY&quot;, die ich in den fr&uuml;hen 70ern
entwickelte). 1978 begab ich mich in den Bereich industrieller Forschung
und Entwicklung und leitete R&amp;D Abteilungen bei Firmen wie Tektronix, Sun
Microsystems, Apple Computer, Silicon Graphics und Borland International
(nun Inprise). Bei Apple, wo ich f&uuml;r die &Uuml;berwachung der Advanced
Technology R&amp;D zust&auml;ndig war, entwickelten wir Technologien wie QuickTime,
PlainTalk, QuickTime-VR und eine ganze Reihe weiterer Innovationen, die
anschlie&szlig;end von unseren Freunden eines gro&szlig;en Software-Unternehmens aus
dem Nordwesten der USA kopiert wurden (seufz). Au&szlig;erdem finanzierten wir
den ersten Internet-Browser der Welt und erschufen Apple's erste Website.
</P>
<P>
Die meiste Zeit meiner Laufbahn war ich UNIX- und sp&auml;ter Macintosh-User.
Ich vermied erfolgreich, Microsoft DOS oder Windows nutzen zu m&uuml;ssen, hatte
dann aber in den letzten Jahren das, &auml;h, &quot;Vergn&uuml;gen&quot;, ein Windows95/98 User
zu sein. Ich mu&szlig; zugeben, da&szlig; ich nie ein Amiga-User war, jedoch wu&szlig;te ich
sehr wohl, was in der Amiga-Gemeinde vor sich ging, seit Amiga und Video
Toaster Multimedia f&uuml;r die breite Masse zug&auml;nglich machten. Die Leute bei
Apple hatten gro&szlig;en Respekt f&uuml;r den Amiga und die Amiga- und
Apple-Gemeinden schienen mir stets &auml;hnlich. Ich lerne schnell mehr &uuml;ber den
Geist der Innovation, der seit der Einf&uuml;hrung des ersten Amigas Mitte der
80er im Herzen der Amiga-Gemeinde ist.
</P>
<P>
Nun befinden wir uns im Jahre 1999, an der Schwelle eines neuen
Jahrtausends und an der Schwelle des Informationszeitalters. Der PC,
repr&auml;sentiert von Windows-Maschinen und Macintoshs, ist inzwischen eine
ausgewachsene Produktkategorie mit wenigen, wirklichen Neuerungen in der
Computer-Industrie. Was kommt als n&auml;chstes? Nun, da sich die PC-Industrie
in ihrem dritten Jahrzehnt befindet - was wird die n&auml;chste gro&szlig;e &quot;S-Kurve&quot;,
die die n&auml;chsten 20 Jahre im Computerbereich dominieren wird? Ganz sicher
wird die aufkommende globale Informations-Infrastruktur mit einbezogen
sein, welche eine fundamentale Ver&auml;nderung von Business, Kommunikation und
auch Kultur mit sich bringen wird. In vielerlei Hinsicht befinden wir uns
im &Uuml;bergang von der reinen Computer-&Auml;ra, in der immer schnellere Computer
gebaut werden, zur &Auml;ra der Kommunikation mit m&auml;chtigen und allgegenw&auml;rtigen
Kommunikationsnetzwerken, welche eine Vielzahl von computergesteuerten
Ger&auml;ten verbinden.
</P>
<P>
Wir bei Amiga sp&uuml;ren, da&szlig; die volle Entfaltung der Power, die in dieser
aufkommenden Informations-Infrastruktur steckt, weit mehr erfordert als nur
einen PC mit einem Browser. Ben&ouml;tigt wird vielmehr eine komplette
Homecomputer-Umgebung, die m&auml;chtige Multimedia-F&auml;higkeiten mit einfach zu
handhabenden Informationsger&auml;ten verbindet, welche Zugang zu den Inhalten
und Diensten des Internets haben. Wie Jim euch gesagt hat, ist es unsere
Vision und Mission, Computer mittels einer Industrie-Starndard
Systemarchitektur und eines Operating Environments zu einem nat&uuml;rlichen
Teil des Alltags zu machen. Haupts&auml;chlich wollen wir das
Homecomputing-Erlebnis f&uuml;r das 21. Jahrhundert durch die Kombination von
faszinierender Multimedia, transparenter Netzwerktechnik und eines
Internetzzugangs neu definieren, sowie dem User ein Erlebnis bieten, das
die Nutzung eines Computers oder eines anderen Informationsger&auml;tes so
einfach macht wie den Gebrauch... eines Toasters!
</P>
<P>
Das erneute Wachsen des Amiga-Geistes ist eine sehr aufregende Zeit. Ich
pers&ouml;nlich bin begeistert, ein Teil des neuen Amiga-Teams zu sein und mit
Jim, Petro, Jeff Schindler, Allan Havemose und den anderen Top-Leuten
zusammenarbeiten zu k&ouml;nnen. Ich freue mich darauf, in den kommenden Monaten
mehr &uuml;ber unsere Visionen, Technologien und Produkte mitteilen zu k&ouml;nnen.
Stay tuned...
</P>
<P>
Rick LeFaivre<BR>
CTO and SVP, R&amp;D<BR>
Amiga, Inc.&laquo;<BR>
</P>
<P>
(Quelle: AMIGA)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA4.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA6.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
