<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA8.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. AMIGA beantwortet h&auml;ufig gestellte Fragen</H2>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&raquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<H3>1. Wann wird 3.5 ausgeliefert?</H3>
<P>
A. Wegen Fragen &uuml;ber 3.5 besuchen Sie bitte die Web-Seite von 3.5 direkt
bei: <A HREF="http://www.amiga.com/amigaos35/index.html" TARGET="_TOP">http://www.amiga.com/amigaos35/index.html</A>
</P>
<H3>2. Wie werden die Betas f&uuml;r 3.5 ausgew&auml;hlt?</H3>
<P>
A. Haage &amp; Partner w&auml;hlt die Beta-Tester f&uuml;r 3.5 selbst aus. Beta-Tester
werden von Haage &amp; Partner verst&auml;ndigt, sobald die Auswahl erfolgt ist.
</P>
<H3>3. Wie wird die Basis-Konfiguration f&uuml;r 3.5 bei der Lieferung aussehen?</H3>
<P>
A. Auch wegen dieser Fragen &uuml;ber 3.5 besuchen Sie bitte die Web-Seite von
3.5 direkt bei: <A HREF="http://www.amiga.com/amigaos35/index.html" TARGET="_TOP">http://www.amiga.com/amigaos35/index.html</A>
</P>
<H3>4. Wann ist die Auslieferung des Entwicklungssystems vorgesehen?</H3>
<P>
A. Wir streben an, die Entwicklungs-Produkte im 4. Quartal des Jahres
freizugeben. Wir planen die Herausgabe weiterer Einzelheiten &uuml;ber das
Entwicklungssystem im Juli.
</P>
<H3>5. Wie sieht die System-Spezifikation f&uuml;r das Entwicklungssystem aus?</H3>
<P>
A. Wir werden Daten &uuml;ber &uuml;ber die vollst&auml;ndige Amiga-Betriebsumgebung
(Amiga Operating Environment) und das unterst&uuml;tzende Entwicklungssystem
freigeben, wie sie uns mit Ann&auml;herung an das 4. Quartal zur Verf&uuml;gung
stehen.
</P>
<H3>6. Welcher Prozessor ist f&uuml;r das Entwicklungssystem vorgesehen?</H3>
<P>
A. Um die Zeit bis zur Freigabe kurz zu halten, erwarten wir die Herausgabe
der ersten Entwicklungs-Umgebung mit der X.86-Architektur. Wir werden
sicherstellen, dass wir alle Entwicklungswerkzeuge, Libraries usw., die
zum Kennenlernen und dem Beginn der Entwicklung f&uuml;r die neuen Amigas n&ouml;tig
sind, vollst&auml;ndig bereit haben werden. Bitte verstehen sie, dass die
Verwendung des X.86 als Entwicklungssystem nicht bedeutet, dass wir eine
X.86-Architekture f&uuml;r den neuen Amiga vorgesehen haben.
</P>
<H3>7. Welche Entwicklungs-Werkzeuge werden f&uuml;r das Entwicklungssystem zur Verf&uuml;gung stehen?</H3>
<P>
A. C++ und Java sind die prim&auml;ren Sprachen, die einen umfangreichen Satz
von Amiga-Objekten unterst&uuml;tzen. Weitergehende Einzelheiten werden im Juli
bekanntgegeben.
</P>
<H3>8. Ist Java2 Teil des OS5?</H3>
<P>
A. Ja, wir glauben, dass Java2 deutliche Vorteile f&uuml;r portable Anwendungen
bietet.
</P>
<H3>9. Werden die existierenden Amiga-H&auml;ndler das Entwicklungssystem vertreiben?</H3>
<P>
A. Wir werden mit den Amiga-Vertriebskan&auml;len zusammenarbeiten, damit sie
sich auf die Auslieferung der neuen Amiga-Produkte einrichten k&ouml;nnen.
</P>
<H3>10. Ist die Auslieferung des Amiga der n&auml;chsten Generation immer noch f&uuml;r Weihnachten 1999 vorgesehen?</H3>
<P>
A. Ja, wir zielen immer noch auf ein Auslieferungsdatum im 4. Quartal
diesen Jahres hin. Wir bearbeiten die genauen Pl&auml;ne der Produktvorstellung,
und wir planen die weltweite Auslieferung.
</P>
<H3>11. Welcher Prozessor ist f&uuml;r den Amiga der n&auml;chsten Generation vorgesehen?</H3>
<P>
A. Die endg&uuml;ltige Entscheidung &uuml;ber den Amiga der n&auml;chsten Generation
ist noch nicht gefallen. Es stehen mehrere zur Wahl und wir betreiben
unsere Entscheidungsprozesse der Bewertung und des Vergleichs der
Eigenschaften.
</P>
<H3>12. Wann werden wir die ersten Werbeanzeigen f&uuml;r den Amiga der n&auml;chsten Generation sehen?</H3>
<P>
A. Wir wollen keine offene Werbung f&uuml;r den neuen Amiga machen, ehe nicht
die Produkte durch unsere Vertriebskan&auml;le zur Verf&uuml;gung gestellt werden
k&ouml;nnen. Wir liegen immer noch einige Monate vor dieser Zeit, es bestehen
also noch keine genauen Pl&auml;ne f&uuml;r das Anzeigen-Programm. Wir wollen die
Verf&uuml;gbarkeit der Produkte und andere Aktivit&auml;ten der Gesellschaft durch
die bestehenden Amiga-Kan&auml;le bekanntgeben, ehe wir auf den allgemeinen
Markt gehen.
</P>
<H3>13. Wird Amiga sich dieses Jahr auf der Comdex pr&auml;sentieren?</H3>
<P>
A. Wir planen Aktivit&auml;ten auf einigen der Amiga-Austellungen und denen
der allgemeinen Industrie. Die erfolgreiche Teilnahme an einer Verkaufs-
Ausstellung wie der Comdex im Herbst erfordert eine umfangreiche Planung
im Vorfeld und ben&ouml;tigt die richtige Aussage zur richtigen Zeit, um &uuml;ber
dem L&auml;rmpegel dieser Show h&ouml;rbar zu werden. Wenn die Comdex n&auml;herkommt,
werden wir unsere Pl&auml;ne f&uuml;r die Beteiligung bekanntgeben.
</P>
<H3>14. Wie k&ouml;nnen wir Betatester des Amigas der n&auml;chsten Generation werden?</H3>
<P>
A. Das Beta-Program f&uuml;r die Produkte der n&auml;chsten Generation ist noch nicht
festgelegt. Wir erwarten, diese Informationen im Sp&auml;tsommer bekanntgeben
zu k&ouml;nnen.&laquo;
</P>
<P>
(Quelle: AMIGA)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA8.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
