<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. AMIGA k&uuml;ndigt Gr&uuml;ndung des Amiga Advisory Council an</H2>
<P>
&raquo;San Diego, Kalifornien, 19. Mai 1999.
</P>
<P>
Amiga k&uuml;ndigt die Gr&uuml;ndung des Amiga Advisory Council (Amiga Beratungs-
beirat) an.
</P>
<P>
&quot;Um Amiga zu einer gro&szlig;en Gesellschaft zu machen, die genau die Arten
von innovativen Produkten liefert, die von den Anwendern gew&uuml;nscht werden,
muss der Geist des Amiga durch unsere Produkte flie&szlig;en, und dieser Geist
ist die Gemeinschaft.&quot; Das sagte Jim Collas, Pr&auml;sident von Amiga.
</P>
<P>
So, wie die Gesellschaft voranschreitet, wird der Beratungsbeirat Einfluss
nehmen und helfen, die zuk&uuml;nftige Richtung zu bestimmen, die Amiga
einschlagen wird, und dabei ein besonderes Augenmerk auf die Erfordernisse
und W&uuml;nsche der bestehenden Amiga-Gemeinschaft richten.
</P>
<P>
&quot;Die Amiga-Gemeinschaft ist eine der wertvollsten Gemeinschaften in der
Computer-Industrie. Sie bietet einen umfangreichen Erfahrungsschatz, den
wir ben&uuml;tzen m&uuml;ssen, w&auml;hrend wir die g&auml;ngigen Produkte ausliefern und uns
in neue Regionen und Richtungen f&uuml;r den Amiga bewegen. In der Gemeinschaft
sind gro&szlig;artige Leute mit wunderbaren Ideen, ein Talent-Pool ohnegleichen.
Nur durch die F&uuml;hrer und Mitglieder dieser Gemeinschaft lebt der Amiga noch
heute,&quot; sagt Jim Collas, Pr&auml;sident von Amiga.
</P>
<P>
Der Amiga-Beratungsbeirat wird aus Mitgliedern der Gemeinschaft und der
F&uuml;hrungsriege von Amiga bestehen. Kandidaten werden w&auml;hrend der n&auml;chsten
30 Tage aus Vorschl&auml;gen ausgew&auml;hlt, die an Amiga &uuml;bermittelt werden. Amiga
wird die Kandidaten nach folgenden Kriterien bewerten und ausw&auml;hlen.
</P>
<UL>
<LI> Erfahrungen mit klassischen Amiga-Produkten.
</LI>
<BR><LI> Erfahrungen mit Amiga-Anwendergruppen oder &auml;hnlichen Organisationen der
  Amiga-Gemeinschaft (wie z.B. ICOA, Brainiac, UGN, Team Amiga, Jay Miner
  Society, AmigaSOC, D.A.U.G.)
</LI>
<BR><LI> Amiga-Gro&szlig;- und Kleinh&auml;ndler
</LI>
<BR><LI> Amiga-Entwickler
</LI>
<BR><LI> Kommunikationen mit dem Beratungsbeirat werden in englischer Sprache
  und haupts&auml;chlich &uuml;ber das Internet gef&uuml;hrt.
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">In den kommenden Wochen sind Vorschlags-Formulare auf der Web-Seite von&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Amiga zu finden. Es wird erwartet, dass die Mitglieder des Amiga-Beratungs-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">beirats bis Ende Juni bestellt sind.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Bitte besuchen sie die Web-Seiten www.amiga.com und www.amiga.de, um ihr
Beirats-Mitglied zu nominieren.&laquo;
</P>
<P>
(Quelle: AMIGA)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
