<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses10.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses12.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>11. Messeank&uuml;ndigung: 'Swiss Computer Fun 2000'</H2>
<P>
&raquo;Sehr geehrte registrierte Kundschaft, lieber Fachh&auml;ndler, wehrte
Gesch&auml;ftspartner,
</P>
<P>
ich m&ouml;chte Ihnen die Swiss Computer Fun '2000 pr&auml;sentieren:
</P>
<P>
Swiss Computer Fun 2000
</P>
Vorwort:
<P>
Die Swiss Computer Fun (Name kann sich noch &auml;ndern) wird ein grosses
Computer Meeting im Raum Biel/Bern/Solothurn sein! Sie wird im April (
letzte Woche April?) '2000 stattfinden! Dieses Meeting f&uuml;hrt alle Computer-
rassen (AMIGA, Windows, Linux, Mac, etc.) zusammen, um gemeinsam an einem
Samstag &uuml;ber das Neueste, Beste und Schnellste zu reden, um zu gamen, um an
tollen Wettbewerben teilzunehmen, um die versch. Seminare zu verfolgen,
etc!!! Es wird bestimmt super werden! PS: Nehmen Sie doch Ihren Liebling
gleich mit!
Nat&uuml;rlich wird der ganze Anlass untermalen mit diversen Showeinlagen,
Wettbewerben, Demos, Musik und einem kleinen Imbiss -und Getr&auml;nkestand!
</P>
<P>
Mit etwas Gl&uuml;ck werden wir eine Videowand (geleitet von einem AMIGA 4000)
zusehen bekommen, und ev. kommen auch weitere Pers&ouml;nlichkeiten aus der
Computerbranche! Programmierer stellen ihre neuesten Werke vor; und...
lassen Sie sich &uuml;berraschen!!! Und das Beste: mit etwas Gl&uuml;ck steht dann
auch ein Netzwerk mit Anbindung ins Netz
der Netze, dem World Wide Web (kurz: www) zur allgemeinen freien Verf&uuml;gung!
Also, einfach Computer zusammen mit ner Netzwerkkarte und Kabel mitnehmen,
oder sich an einen der gratis zur Verf&uuml;gung gestellten Surfcompis
setzen...und los gehts!
</P>
<P>
Was haben Sie damit zu tun?
</P>
<P>
Nun, eigentlich recht viel! Da ThomaSOFT der Hauptorganisator ist, suchen
wir noch f&auml;hige Mitarbeiter f&uuml;r die Leitung des Meetings. Es muss noch viel
getan werden bis im April '2000! Und es soll ja auch wirklich toll werden!
</P>
<P>
Wir suchen also noch Leute, die uns helfen, alles zu planen, zu
organisieren, etc! Als Entsch&auml;digung werden Sie entl&ouml;hnt und haben freien
Eintritt (wird so um die 5.-- liegen) zum Meeting!!!
</P>
<P>
Wenn Sie mithelfen m&ouml;chten, was auf die Beine zu stellen, so melden Sie
sich doch: <A HREF="mailto:thomasoft@evard.ch">thomasoft@evard.ch</A>
</P>
<P>
Sponsoren gesucht:
</P>
<P>
Weiter ist die Meetingsleitung noch auf der Suche nach Sponsoren! Der Raum
muss ja gemietet werden, Personal angeheuert, Stromkosten gedeckt werden!
Und es fallen jede Menge weitere Ausgaben an!
</P>
<P>
Was erhalten Sie als Sponsor als Gegenleistung? Sehr viel: Sie erhalten zum
Einen freien Eintritt und zum Andern haben Sie die M&ouml;glichkeit (als z. Bsp:
Provider, Computerh&auml;ndler) f&uuml;r Ihre Produkte zu werben und diese auch an
eigenen St&auml;nden zu vertreiben!!! F&uuml;r Sponsoren&uuml;berweisungen bsten Dank im
Voraus! Bitte melden Sie sich pers&ouml;nlich unter: <A HREF="mailto:thomasoft@evard.ch">thomasoft@evard.ch</A> oder
Tel: 032 331 59 21
</P>
<P>
Also, dann bis n&auml;chstes Jahr! Sollten Sie Fragen haben, oder Vorschl&auml;ge,
W&uuml;nsche etc., so nehmen Sie doch bitte Kontakt mit uns auf, recht
herzlichen Dank!
</P>
<P>
Die Meetingsleitung, ThomaSOFT, Thoma Marco
</P>
<P>
bye...
</P>
<P>
ThomaSOFT, Thoma Marco, Mattenstr. 14b, 2562 Port, Schweiz
</P>
<P>
eMail: <A HREF="mailto:thomasoft@evard.ch">thomasoft@evard.ch</A> <A HREF="http://www.thomasoft.webland.ch" TARGET="_TOP">http://www.thomasoft.webland.ch</A>
</P>
<P>
Telefon: 032 331 59 21 Fax: 032 331 59 21
</P>
<P>
Au revoir...&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses10.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses12.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
