<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P>
Wenn Ihr einen Beitrag habt, schreibt bitte an:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
E-Mail: <A HREF="mailto:aakt@gmx.de">aakt@gmx.de</A>
</P>
<H2>1. Erfahrungsbericht zu verschiedenen H&auml;ndlern (von Wolfgang W. Wolber)</H2>
<P>
&raquo;Nachdem in letzter Zeit immer wieder Berichte &uuml;ber negative Erfahrungen
mit manchen (insbesondere einer ;-) ) Firmen im Amiga-Bereich zu lesen
waren, m&ouml;chte ich hier auch meinen Senf dazu abgeben.
</P>
<P>
Zun&auml;chst leider auch etwas Negatives:
</P>
<P>
Haage &amp; Partner (deren sonstiges Engagement ich durchaus zu sch&auml;tzen wei&szlig;):
</P>
<P>
Am 27.01.1999 per Internet PCX/Fusion_Bundle beatellt, bereits am
30.01.1999 Lieferung von...PCX plus einer Diskette mit deutsche Guides zu
PCX und Fusion, Fusion aber weit und breit nicht zu sehen (nein, es war
auch nicht auf der Disk mit PCX enthalten).
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Ich also das Ganze sofort per E-Mail (vom automatischen server an diverse&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Adressen verwiesen) reklamiert (ein Versehen kann ja mal passieren :)), ca.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 Tage sp&auml;ter auch schriftlich angemahnt.&nbsp;</TD></TR>
</TABLE>
<P>
Bis heute keine Reaktion (ich habe sp&auml;ter noch mal zwei E-Mails, eine davon
an J&uuml;rgen Haage, geschrieben)
</P>
<P>
Aufgrund des relativ niedrigen Streitwerts (enweder die Differenz zwischen
dem Bundlepreis und dem Einzelpreis von PCX oder eben der separate
Kaufpreis von Fusion) habe ich von der Androhung rechtlicher Schritte
abgesehen und mir Fusion eben bei KDH (zu denen sp&auml;ter mehr) bestellt.
</P>
<P>
Da&szlig; auf die Mail an Herrn Haage keine Antwort kam, kann ich aufgrund seiner
derzeitigen Anstrengungen mit OS3.5 etc. ja verstehen, aber da&szlig; die
Versand- bzw. Reklamationsabteilung nicht zumindest mit einer
Eingangsbest&auml;tigung meiner Schreiben bzw. Mails reagiert hat, spricht nicht
gerade f&uuml;r Kundenn&auml;he. :-(
</P>
<P>
Aber jetzt zu Positiverem:
</P>
<P>
Da w&auml;re zun&auml;chst die (leider schon l&auml;ngere Zeit nicht mehr exiatierende)
Fa. Donau-Soft zu nennen.
</P>
<P>
Dort habe ich anno 1995 ein sog. &quot;Turbo-Memory-Board&quot; (i.e. eine
Speichererweiterung mit &uuml;bertaktetem 68020) plus 4 MB Speicher (SIMM) f&uuml;r
meinen A1200 bestellt. Lamer, der ich damals war, erkannte ich nicht, da&szlig;
das SIMM-Modul bei der Lieferung bereits eingebaut war und habe dessen
Fehlen nat&uuml;rlich prompt reklamiert.
</P>
<P>
Herr Hauer, der Firmeninhaber hat mich dann angerufen und mich (sehr
h&ouml;flich !) auf meinen Fehler hingewiesen und mir auch sonst noch ein paar
Tips gegeben.
</P>
<P>
Tja, wie gesagt, leider gibt's die Firma nicht mehr..
</P>
<P>
Als n&auml;chstes h&auml;tte ich die bereits angesprochenen KDH-Datentechnik und da
ganz besonders Herrn G&uuml;nter Horbach.
</P>
<P>
Dort bat ich im Oktober 1998 per E-Mail um ein Angebot f&uuml;r einen Infinitiv
1500 mit CyberstormPPC und PicassoIV.
</P>
<P>
Zwei Tage sp&auml;ter war das schrifliche Angebot da, woraufhin ich die Kiste
auch gleich bestellte. Bei der Auftragsbest&auml;tigung wurde ich dann gleich
darauf hingewiesen, da&szlig; sich die Auslieferung wegen der Computer98 und
damit verbundenen Lieferengp&auml;ssen bei Micronik verz&ouml;gern kann.
</P>
<P>
Als Mitte November 1998 noch kein A1500 bei mir stand, bekam ich (abends
gegen 21.00 Uhr !) einen Anruf von KDH, da&szlig; P5 derzeit keine <A HREF="mailto:604@233">604@233</A> h&auml;tte
und ob ich mit einem 200er PPC einverstanden sei.
</P>
<P>
Als ich 14 Tage sp&auml;ter per E-Mail nach dem Verbleib meines Ger&auml;ts fragte,
antwortete Herr Horbach prompt, da&szlig; es technische Probleme g&auml;be, d.h., die
Kiste bootete nicht bei jedem Einschalten; man werde sie mir aber trotzdem
liefern, ich k&ouml;nnte sie aufgrund der Probleme aber jederzeit
zur&uuml;ckschicken.
</P>
<P>
So geschah's dann auch, wie sich sp&auml;ter herausstellte, gab/gibt es Probleme
im Zusammenspiel des Micronik Z3-Boards mit dem 1200er- Motherboard.
In den 3 Monaten (von Januar 1999 bis April 1999), in denen der Tower dann
zur &Uuml;berpr&uuml;fung bei KDH war, habe ich unz&auml;hlige E-Mails dorthin
geschrieben, die Herr Horbach jedes Mal (oft sofort, teilweise sogar am
Wochenende oder sp&auml;t abends) aufs H&ouml;flichste beantwortete.
</P>
<P>
Als sich herausstellte, wo das Problem lag, wurde mir schlie&szlig;lich anstelle
des Infinitiv ein A4000T (mit der CSPPC und PIV) geliefert, der seither
seinen Dienst weitgehend problemlos versieht (bei einem Problem, da&szlig; kurz
nach der Lieferung auftrat, hat mir G&uuml;nter H. auch einige Tips gegeben).
Als (Zitat Herr Horbach) &quot;Entsch&auml;digung f&uuml;r die lange Wartezeit&quot; wurden
sogar die urpr&uuml;nglich im Infinitiv eingebauten IDE-Ger&auml;te (Festplatte und
CD-ROM) gegen SCSI-Ger&auml;te ausgetauscht.
</P>
<P>
Lange Rede, kurzer Sinn: Wenn jemand den Begriff &quot;Kundenfreundlichkeit&quot;
begriffen hat, dann Herr Horbach und KDH und deshalb werde ich k&uuml;nftig,
wenn ich irgendwas f&uuml;r meine Lady brauche selbiges bei KDH kaufen, selbst
wenn manch andere Firma dieses evtl. ein paar Mark billiger anbietet.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">P.S.:&nbsp;</TD><TD VALIGN="TOP">Ich bin weder bei KDH besch&auml;ftigt noch mit einem Mitarbeiter verwandt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">o.&auml;. und werde f&uuml;r diese Zeilen auch nicht von dort bezahlt ;-)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Mit freundlichem Gru&szlig;
</P>
<P>
Wolfgang W. Wolber &lt;<A HREF="mailto:wolfgang.wolber@okay.net">wolfgang.wolber@okay.net</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
