<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Vor kurzem hat AMIGA eine erste Konzeptzeichnung zum AmigaNG ver&ouml;ffentlicht
(sie ist in dieser Ausgabe enthalten). Zwar ist an dieser Stelle zu
betonen, dass es sich lediglich um einen Entwurf handelt und die Ger&auml;te der
n&auml;chsten Generation so - oder auch v&ouml;llig anders - aussehen werden, aber
die Zielrichtung ist schon deutlich erkennbar. Letztendlich soll der
AmigaNG nicht blo&szlig; ein Computer sein, sondern quasi als Br&uuml;cke zwischen der
Informationswelt und dem A/V-Bereich fungieren, wenn nicht noch mehr.
Ich pers&ouml;nlich bin jedoch skeptisch, ob der Markt f&uuml;r eine solche
Produktlinie &uuml;berhaupt schon existiert bzw. auf kurze oder mittlere Sicht
geschaffen werden kann, betrachten wir einmal ein Beispiel aus dem Audio-
Bereich: F&uuml;r viele, vielleicht die Mehrzahl der Konsumenten, ist es
momentan noch unvorstellbar, sich Musik im Internet zu kaufen - und damit
ist nicht etwa der Online-Einkauf von CDs gemeint, sondern das
kostenpflichtige Herunterladen von Audio-Datenfiles. Ihnen wird es sehr
schwer zu vermitteln sein, warum ihre Musik nun nicht mehr auf einem sicht-
und greifbaren Datentr&auml;ger mit Original-Label vorhanden sein soll, sondern
von Festplatte abgespielt werden soll.
</P>
<P>
Die 'digitale Konvergenz', also die Zusammenf&uuml;hrung der diversen
audiovisuellen und multimedialen Ger&auml;te, ist zwar durchaus eine
faszinierende Vorstellung, ich pers&ouml;nlich glaube jedoch nicht, dass sich
diese technische Revolution innerhalb von nur ein paar Jahren durchsetzen
k&ouml;nnen wird.
</P>
<P>
Zumindest in Deutschland hat sich in den letzten Jahren gezeigt, dass die
Konsumenten eben (noch?) _kein_ multifunktionelles Ger&auml;t f&uuml;r viele Aufgaben
haben m&ouml;chten. So sind beispielsweise Experimente einiger Hersteller,
Internet-taugliche Fernseher anzubieten, zu Flops avanciert - und das
sicher nicht nur wegen der oftmals ungen&uuml;genden Bedienung. F&Uuml;r viele Kunden
bleibt der Fernseher ein Ger&auml;t f&uuml;rs Wohnzimmer, der Computer geh&ouml;rt dagegen
(bestenfalls) ins B&uuml;ro. Dass sich diese Auffassung in den n&auml;chsten Jahren
rasch &auml;ndern wird, ist aus meiner Sicht kaum zu erwarten - selbst nicht mit
einem riesigen Marketingaufwand von Seiten AMIGAs oder anderer Firmen.
</P>
<P>
Mein Rat an AMIGA, der gleichzeitig eine Bitte darstellt, ist deshalb, im
Hinblick auf diese angestrebte technische Revolution nicht den Computer 'an
sich' zu vergessen. Der AmigaNG als multifunktionelle und -mediale
Steuerungs- und Informationszentrale mag vielleicht im Jahr 2005
hochaktuell sein, aber die Anwender des Jahres 2000 erwarten 'nur' einen
(m&ouml;glichst alle anderen Systeme) &uuml;berragenden Computer, mit dem sie ihre
Arbeit erledigen und im Internet surfen k&ouml;nnen, etc. Wenn der AmigaNG in
diesem Punkt versagt, dann d&uuml;rfte er auch im Hinblick auf die digitale
Konvergenz bzw. 'Information Appliance', AMIGAs neuestes Schlagwort,
scheitern.
</P>
<P>
Und wie seht ihr das? Schickt uns eure Meinungen und Vorstellungen zu den
Amigas der n&auml;chsten Generation! Wir ver&ouml;ffentlichen sie gern in der
n&auml;chsten Ausgabe.
</P>
<P>
Bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
