<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Hyperion Software bringt Shogo f&uuml;r Amiga
</LI>
</UL>
<P>
Wer in den letzten Monaten auch ein wenig den PC Spielemarkt
im Auge behalten hat, dem ist bestimmt der neue 3D Shooter
Shogo von Monolith aufgefallen. Nun, genau der wird jetzt
f&uuml;r den Amiga umgesetzt. Portiert wird das ganze in deutsch/
belgischer Zusammenarbeit von der Gruppe Hyperion, in der
u.a. Thomas und Hans-J&ouml;rg Frieden (ADescent, Warp3D...)
sowie Christian Sauer (Descent, Heretic...). Grafisch ist
Shogo sogar Quake 2 &uuml;berlegen. Kein Wunder, dass f&uuml;r die
Amiga Version ein PowerPC ben&ouml;tigt. Shogo soll Mitte/Ende
1999 ver&ouml;ffentlicht werden.
</P>
<UL>
<LI> N&auml;chste Monolith Konvertierung angek&uuml;ndigt: Rages of Mages
</LI>
</UL>
<P>
Sanios Software hat sich die Rechte gesichert, das Echtzeit
Strategiespektakel Rages of Mages auf den Amiga zu konvertieren.
Das HighEnd Strategiespiel hat umwerfende Features und war
auch am PC ein Hit. Ein Ver&ouml;ffentlichungstermin wurde noch
nicht bekanntgegeben.
</P>
<UL>
<LI> Space Station 3000 Demo ver&ouml;ffentlicht
</LI>
</UL>
<P>
Digital Images hat das langerwartete Demo von Space Station
3000 ver&ouml;ffentlicht. Da es auf der Website Probleme mit der
Bandbreite gab, will man das Demo bald ins Aminet stellen.
</P>
<UL>
<LI> Wasted Dreams sehr bald erh&auml;ltlich
</LI>
</UL>
<P>
Laut Digital Images wurde die Endversion von Wasted Dreams
schon zum Pressen auf CD verschickt, d.h. es kann sich
nur noch Tage bis zur endg&uuml;ltigen Ver&ouml;ffentlichung handeln.
Wasted Dreams hie&szlig; fr&uuml;her Distant Dreams, da es aber vom
Originalentwickler aufgegeben wurde, &uuml;bernahm Digital Images
das Spiel und nannte es Wasted Dreams.
</P>
<UL>
<LI> Digital Images ist wieder kr&auml;ftig am verhandeln
</LI>
</UL>
<P>
Bei Digital Images verhandelt man momentan mit Binary
Asylum, um Zeewolf 3 f&uuml;r den Amiga bringen zu d&uuml;rfen.
Au&szlig;erdem m&ouml;chte man noch folgende PC Spiele konvertieren:
Heretic 2, Quake 2 und F22: Air Dominance Fighter.
</P>
<UL>
<LI> Alive Mediasoft ver&ouml;ffentlicht Moonbases
</LI>
</UL>
<P>
Nachdem Verkosoft nun doch nicht Moonbases ver&ouml;ffentlicht,
hat sich ein neuer Publisher gefunden: Alive Mediasoft.
Mittlerweile ist Moonbases auch schon ver&ouml;ffentlicht und in
der Alive Mediasoft Produktpalette.
</P>
<UL>
<LI> Islona Entertainment ver&ouml;ffentlicht Gremlin Klassiker
</LI>
</UL>
<P>
Die CD-ROM mit dem Titel &quot;The Best of Gremlin&quot; enth&auml;lt
die folgenden Gremlin Klassiker: Hero, Harlequin, HATE,
Impossamole, K240, Litil Divil, Premier Manager, Premier
Manager 2, Premier Manager 3, Editor Shadow Fighter,
Super Cars 2, Switchblade 2, Techno Cop, Top Gear 2,
VenusFlyTrap, Zool und Zool 2. Der Preis betr&auml;gt etwa
60 DM.
</P>
<UL>
<LI> Alive Mediasoft bringt Goal 2000
</LI>
</UL>
<P>
Alive Mediasoft will den Fu&szlig;ball Klassiker Goal neu auflegen
und Goal 2000 ver&ouml;ffentlichen. Gro&szlig;e Ver&auml;nderungen plant man
jedoch nicht, deshalb darf man skeptisch sein, ob die
Neuauflage auf jedem Amiga l&auml;uft, denn das alte Goal hatte
Probleme mit schnelleren Prozessoren.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
