<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Willkommen zu einer Mini-Ausgabe des AMIGA aktuell Spieleteils. Dies
liegt zum einen daran, dass es nicht viele Neuigkeiten gab, zum anderen,
dass ich momentan total besch&auml;ftigt bin. Die bahnbrechenden News diesen
Monat sind wohl die angek&uuml;ndigten Portierungen von den Monolith Spielen
Shogo und Rages of Mages. Hier muss ich eingestehen, dass Shogo schon
im letzten Monat angek&uuml;ndigt wurde, und ich das leider &uuml;bersehen habe.
Danke an Steffen H&auml;user, der mich darauf aufmerksam machte! Wer Shogo
noch nicht gesehen hat, der sollte dies schleunigst nachholen, denn es
ist grafisch wirklich der absolute Knaller, sogar Quake 2 ist es &uuml;berlegen.
Die Amiga Version wird dann selbstverst&auml;ndlich nur auf Rechnern
ausgestattet mit einem PowerPC Prozessor laufen. In dem Portierungsteam
arbeiten namhafte Amiga Pers&ouml;nlichkeiten wie Thomas und Hans-J&ouml;rg Frieden
sowie Christian Sauer. Man darf also wirklich gespannt sein, was daraus
wird. Auf jeden Fall ist die Ank&uuml;ndigung seri&ouml;s, denn die oben genannten
Leute w&uuml;rden ihren Namen nicht f&uuml;r irgendein 'vielleicht wird`s ja was'-
Projekt hergeben.
</P>
<P>
Obwohl es im Spielebereich nicht gerade aufw&auml;rts geht, muss ich sagen,
dass man die letzte Zeit immer &ouml;fter etwas &uuml;ber Amiga h&ouml;rt. Das liegt
wahrscheinlich an den Ank&uuml;ndigungen von Gateway/Amiga Inc. So hat informiert
z.B. jetzt DIE PC-Emulator Seite Zophars Domain (<A HREF="http://www.zophar.net" TARGET="_TOP">http://www.zophar.net</A>)
auch &uuml;ber neue Emulatoren am Amiga. Au&szlig;erdem erschien vor etwa 2 Wochen
dort ein interessanter Bericht &uuml;ber das Comeback des Amigas, worin das
Team schreibt, dass es wirklich hofft, dass das Comeback gelingt, weil
&quot;der Amiga einer der besten Computer gewesen sei&quot;. Tja, da sieht man
es mal wieder, wo die Wurzeln liegen ;-)
</P>
<P>
Au&szlig;erdem habe ich neulich in unserem regionalen Fernsehsender,
Hessen-Fernsehen - HR,  einen Bericht &uuml;ber Computerspiele gesehen,
in dem ein Ausschnitt aus einer Spielhalle in Frankfurt gezeigt
wurde. Und da stand ein Amiga 1200 und es lief Deluxe Galaga! Der
Typ, der gerade spielte wurde gefragt, was er von &quot;Gewalt in Computer-
spielen&quot; halte, und er meint, dass dieses Spiel (Deluxe Galaga) ja
nicht so realistisch sei :-)
</P>
<P>
Den Bericht in der c-t &uuml;ber den Rechtsfall mit dem Amiga Programm
IdeFix habt ihr hoffentlich auch gelesen, denn da wurde auch ein paar
mal der Amiga erw&auml;hnt, logisch!
</P>
<P>
So, dann viel Spa&szlig; mit dieser Ausgabe,
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">P.S.:&nbsp;</TD><TD VALIGN="TOP">Sorry, f&uuml;r die relative kurze Ausgabe! Es gab zwar nicht viel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">mehr News, aber ich h&auml;tte wenigstens noch ein oder zwei Previews&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">schreiben k&ouml;nnen. N&auml;chste Ausgabe, versprochen!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
