<HTML>
<HEAD>
<TITLE>REFLECTOR 041</TITLE>
</HEAD>
<BODY BACKGROUND="../Pix/Back.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../Pix/Reflecto.GIF" ALT="[REFLECTOR]"></A><P>
A R T - G A L E R I E</H1></CENTER>
<HR SIZE=5><P>

<B>Akira Kale</B><P>

In den tiefen unserer Festplatte haben wir noch einige Interessante Bilder entdeckt,
die wir Euch nat&uuml;rlich nicht vorenthalten wollen. Wir endschuldigen uns beim Autor,
das er so lange auf eine Ver&ouml;ffentlichung hat warten m&uuml;&szlig;en. Aber lassen wir Akira
zu Wort kommen.<PRE><B><P>

        So nun zu den Bildern in der Artgalerie ....

1. Bild = 2_White_Stars - Back to Home -
   Ist mit Reflections entstanden. Es hat eine Aufl&ouml;sung von 640x480 
   und ist in Jpg Format. Den Planeten Links im Bild habe ich mit einer Mathematischen 
   Textur versehen. Das ergebnis ist durchaus Akzeptabel :-)

2. Bild = Narn_Fly -  Attack the Shadow Fighter, Mayday, -
   Dies ist meine Version und die Vorstellung von dem Fighter in den weiten der Galaxie.
   Es hat eine Ausl&ouml;sung von 800x600 und ist wie immer in JPG Format. Ein Dank geht an Uwe f&uuml;r 
   die genialen Objekte die er immer wieder zum vorschein Bringt. Danke ;-).

3. Bild = D.I.G zeigt unseren Logo. Es steht f&uuml;r D&uuml;ren Independent Graphics. Momentan
   besteht es aus 4. Personen. Ike, Simon, Steffen, Thomas. Wir kennen uns seit mehr als
   einem halben Jahrzehnt und kommen alle aus D&uuml;ren (und Umgebung). Und haben uns Entschlossen
   eine Gruppe zu Bilden die mit Grafik Erstellung sich befast. Dabei ist es egal mit welchen
   Program sich der einzelne befasst. Zei es Reflections, 3D Studio, Photoshop, oder Bryce2.
   All dies wird benutzt.

4. Bild = MadCat_3019 - Entscheidung am Thunder Rift - 
   die Inspiration hatte ich von PC Game MechWarrior2. Nach ich mir das Intro
   (wei&szlig; nicht wie oft gesehen hatte) wollten ich Thomas und Simon sowas &auml;hnliches in die 
   Szene setzen. Die Idee und Vorstellung hat man inerhalb von einem Bruchteil einer Sekunde, 
   nur das in die Realit&auml;t umzusetzen braucht seine Zeit und vor allen dingen Ruhe und Gelassenheit.

   Erst einmal ein gro&szlig;es Danke sch&ouml;n an Simon f&uuml;r die Texturen, und Thomas f&uuml;r den Gedanken-
   austausch und Verbesserungsvorschl&auml;ge. Ohne die hilfe von beiden w&auml;re wohl das ganze Project
   nicht zum vorschein gekommen. 

   Mit diesem Bild habe ich auch beim Animago Award 1998 mitgemacht. Wenn ich den Hauptpreis 
   Gewinne Teilen wir uns den SGI O2. Thomas nimmt den Monitor, Ich den den Prozzessor, und Simon
   den Rest. Thomas w&uuml;rde jetzt sagen: "Lach nich, Lach ich, Lach ich oder wat ;-)" Okey es ist
   nur ein Scherz. Wir und gewinnen...... Mitmachen Spa&szlig; haben und dabei sein ist alles an dem 
   Wettbewerb das einmal im Jahr stattfindet, den Gewinnen ist nicht alles.
   Ach ja fast h&auml;tte ich es vergessen diese Version vom Bild ist in 800x600 Aufl&ouml;sung.

5. Bild = The Evil - Army of Darkness - 
   Frei nach motte: Das Best zum Schlu&szlig; !!!
   Das Bild ist von Thomas. Er hat es mit 3D - Studio ;-) erstellt. 
   Es hat eine Aufl&ouml;sung von 800x600 in Jpg Format.
   Die Inspiration kam von dem Film Armee der Finsterniss (Tanz der Teufel 3) Der coolste Teil 
   &uuml;berhaupt. Ich finde es ist Ihm sehr gut gelungen, und in die Szene gesetzt. Einfach Fantastisch.
   K&ouml;nnen diese Leuchtaugen L&uuml;gen ;-) ???. Dieses Bild hat er zum Animago 3D-Award 1998 eingereicht.
   Es war schon ganz Abenteurlich. Wir er zwei Tage vor dem Einsendeschlu&szlig;
   n&auml;hmlich am Sonntag Fertig wurde. Und in den Briefkasten wanterte. 
   Hoffentlich kommt es Rechtzeitig an. Was meint Ihr zu seinem Bild ???.</PRE></B><P>

Akira hat uns im Januar 1998 auch einen Leserbrief zukommen lassen. Leider sind einige Daten
nicht mehr aktuell und wir behalten uns vor diesen zu k&uuml;rzen.<P>

<PRE><B>
Hallo Dr.Reflectus                              Januar 1998

Ein neues Jahr beginnt und jede menge Interesante Themen erwarten uns.
Ich werde diesmal mein Leserbrief "Relativ" kurz fassen ;-).

Zuzm ersten CGI_X in Amsterdam
Zum zweiten WWW.Kostenlos.de und 
Zum dritten mache ich Schleich Werbung 
f&uuml;r meine Homepage und E-Mail Adresse.


Okey fangen wir an.

----------------------------CGI_X in Amsterdam--------------------------

Vom 21-24.Januar fand in Amsterdam (RAI Zentrum) zum ersten mal die CGI_X 
statt. Am Samstag waren wir dann auch da. Die ganze D.I.G Gruppe Ike, Phillip
Simon, Steffen, und Thomas, Thomas nahm auch seine Camera mit und alles 
wurde aufgenommen.

Es war eine Mittelgro&szlig;e Messe nur &uuml;ber 3D Software
Render und Raytracing Proramme. Nach dem Parken machten wir uns auf dem
Weg dahin. Erste Possetive &Uuml;berraschung der Eintritt war umsonst Geil :-).
Auf einem Blatt f&uuml;llte jeder seine Anschrift aus, und bekamm direkt ein 
Eintritts Auswei&szlig; ausgedruckt mit einem ScannCode Cool ;-). 

Anschlie&szlig;end gings hinein. Jeder Internationalen 3D-Software RIESE
hatte einen Stand. Beim Alias Wavefront stand wurde die neue Version von 
dem Poweranimator genannt = MAYA vorgef&uuml;hrt. Auf echt Geilen SGI Rechnern.
War mann nur noch Sprachlos und konnte nicht mehr weg.
Anschlie&szlig;end wurden VHS-Kassetten Verteilt und die Prospekte d&uuml;rften 
nicht fehlen. Eine Windows NT Version soll Bald auch auf dem Markt kommen.
Aber f&uuml;r uns Otto Normal Hobbyy Renderer ist es doch ein paar stufen 
zu hoch, ich meine den Preis von dem Programm.

Danach ging es zum Softimage Stand von Microsoft. Es war total Arm 
Microsoft kann nichts vorf&uuml;hren. Nicht gegen SoftImage einer der Besten
Programme &uuml;berhaupt. Entwickelt wurde es 1986 und bis heute hat sich einiges
getann. Viele Film Effecte wurden damit Realisiert. z.B: Dragonheart.
Auch viele Spiele Firmen benutzen diesen Programm. Ich fand die Vorstellung
und die Pr&auml;sentation echt Bullshit. Und der verr&uuml;ckte DJ an dem SGI hatte
kein Plan, lies einfach ohne grund arme SCHWEINE (als Objekt) einfach so
Explodieren. Hauptsache es macht kein Sinn. Und Verbal unterst&uuml;zt er auch
noch das ganze mit einem kapuffff. Schnell weg hier dachten wir nur noch...

Und waren beim Kinetix Stand, Die f&uuml;hrten die neue Version von dem Autodesk
3D-Studio MaX V2 vor. Auf ca.200 Pentium II Rechnern mit Windows NT4.0 
durfte jeder ein Workshop mitmachen (Wenn er ein Platz bekam ;-). 
Wir waren alle sehr positiv von der neuen MaX Version &uuml;berrascht. 
Anbeglich soll es &uuml;ber 1000 (richtig eintausend) neue Funktionen beinhalten. 
Auf dem ersten Anschein war die Oberfl&auml;che wie die Vorg&auml;nger Versionen auch. 
Leider gibt es immer noch keine Sch&uuml;ler oder Studenten Version. Das 
Programm ist immer noch so Extrem Teuer, lockere 7,Tausend mu&szlig; mann schon
daf&uuml;r ausgeben f&uuml;r eine Original Version. Nichts f&uuml;r Ungut.

Siehe da ein Maxon Stand Cool, die neue Cinema 4D XL Version wurde auf PCs 
und Macs vorgef&uuml;hrt. Interesante neue Funktionen waren zu sehen. Eine
SGI Version soll auch demn&auml;chst erh&auml;ltlich sein. Warum nicht !!!!.

Zu guter letzt ging es zum Digital Production Stand. Hier hat sich das
MesseAngebot auf jeden fall gelohnt. F&uuml;r die, die es noch nicht kennen
Digital Production ist ein Magazin mit mehr als 240 Seiten, und kommt
alle 3.Monate auf dem Markt. Meistens ist es beim Bahnhofs_zeitschriften
zu finden, und kostet 24.-DM. 
Mann findet Inhaltlich sehr 
Informative Software, Hardware Tests, und Making ofs von Produkten
die in der Werbung vorkommen. z.B: Eisb&auml;ren die Coca Cola trinken
Es ist seit einem Jahr auf dem Markt und es gibt 4.Ausgaben bis jetzt.
Die n&auml;chte Ausgabe 1/98 erscheint am 3.3.98. 

Digital Production ist auch der Veranstallter von dem einmal j&auml;hrlich statt
findendem ANIMAGO 3D-AWARD. Als Hauptpreise gibt es ein SGI O2 zu gewinnen.
Ein Intergraph TD-225 und ein Digital DPW Alpha 500Mhz,
und Jede menge Software Pakete. Es gibt sehr Viele Sponsoren z.B: Kinetix
Alias Wavefront, SGI, digital, Fast, Matrox, Maxon Computer, und 
nat&uuml;rlich auch Oberland Computer sind vertreten. Dieses Jahr wird es zwichen
Profi und Amateuer arbeiten unterschieden. Der Einsendeschlu&szlig; ist 
der 20.Januar 1998. Wer diesen Termin verpasst, nur keine bange 
n&auml;chstes Jahr wird es ganz bestimmt auch einen ANIMGO 3D-Award geben,
und da kann man anschlie&szlig;end Teilnehmen.

Ich kann dieses Magazin jedem weiter Empfehlen. 
Zur&uuml;ck zum Messe Angebot zwei Ausgaben gab es dort UMSONST f&uuml;r 
ein Jahres ABO cool. Da ich mir sowieso den Abo zulegen
wollte kamm das wie gerufen. Steffen hat auch die VHS Video Kassette
von dem Animago 3D-Award 1997 mitgenommen. Der 4.Stunden dauert. Geil ;-).
Nach 4.Stunden Render und Raytacing Bilder und Animationen sind war dann
Wahrscheinlich Tot aber wir werden sehr viel Spa&szlig; dabei haben.

Tja so ging ein Samstag in Januar 98 bei uns zuende. Es hat sich auf
jeden Fall gelohnt. Ich kann nur hoffen das n&auml;chstes Jahr auch eine
weitere CGI_X Veranstalltung geben wird.



------------------------ Kostenlos.de ----------------------------------

Kommen wir zum 2.Thema wer einen Internet Anschlu&szlig; hat
darf sich auf die Seite Http://www.kostenlos.de freuen. Hier findet man
alles was man umsonst bekommt. Ist ja logisch. Nein was wirklich 
Interessant ist das Men&uuml; INTERNET auf der Seite, 
hier hat man 4.Untergruppen, 

1.Das Erste ist Kostenloses Internet ZUGANG, z.B: Germany.NET
  hat diesen Service. Momentan leider nur 26.Einwahlkonoten in 
  ganz Deutschland. Also nur in Gro&szlig;st&auml;tten. Aber dieses Jahr soll es
  auf 50.Erweitert werden. Ist doch cool oder ;-)

2.Kostonlose WEB Speicherplatz = Hei&szlig;t wenn mann seine Homepage im Internet
  ver&ouml;ffentlichen m&ouml;chte findet hier den Service von Nationalen und
  Internationelen Anbietern. (F&uuml;r Private Homepages)
  Vor Internationalen Anbietern sollte man sich vergewissern das die
  Leitung einiger massen Relativ Stabil ist. z.B: Crosswind macht sehr
  sch&ouml;n werbung unentlich viel Platz hat man. Doch die &Uuml;bertragung ist
  misserabelle egal zu welcher Uhrzeit, So macht das Surfen auch keinen
  Spa&szlig;, auch f&uuml;r Besucher.

  Nationale sprich Deutsche Anbieter sind u.a Schlund & Partner 
  Man hat 5.MB Free f&uuml;r seine private Homepage, und die &Uuml;bertragungsraten
  sind sehr Gut. Leider nur 5.MB.

  Kommen wir zum FairPlay.net 
  wo ich auch meine Homepage habe. Dort hat man sogar 10.MB Free.
  Und die &Uuml;bertagung ist fast immer Konstant Stabill. Beim FairPlay.net
  war es so das man ein E-Mail sendet mit seinem Wunsch Verzeichniss 
  Namen und den Passwort dazu. Wenn mann ein O.K zeichen von den Bekommt
  kann man seine Homepage per FTP Programm Downloaden (entpackt). 
  Ist ganz einfach. N&auml;heres findet Ihr auf der FairPlay Homepage hier die
  Adresse: Http://www.FairPlay.net

  Wenn diese beiden Anbieter voll belegt sein sollten. Keine Bange
  es kommen immer wieder neue Anbieter mit solchen Anbeboten.
  Auf der Kostenlos.de Homepage wird man auf jeden Fall etwas finden.

3.Kostenlose E_Mail Adressen. F&uuml;r die, die noch keine E-Mail Adresse
  haben ist es Interesesant. Anbieter National & International.

4.Kostenlose Counter & Guestbook und Tools
  Wenn die Homepage einiger massen steht kann meine diesen Service 
  in Anspruch nehmen. Seine Homepage mit Counter (Z&auml;hlwerk) versehen.
  G&auml;steb&uuml;cher einbinden, oder in Suchmaschienen seine Homepage anmelden.

Na ist das nicht ein grund f&uuml;r die Erstellung seiner Homepage f&uuml;rs Internet.
Reflector Mitglieder macht alle mit erstellt eure Homepages, 
dies ist meine Aufforderung an euch alle.



---------------------------MY_Homepage-------------------------------------

Nun mache ich Werbung f&uuml;r Mein Homepage im Internet :-) Wer ein Modem und 
Internet Anschlu&szlig; hat kann meine Homepage besuchen. Man findet dort coole
Mod,S3M Files. Eine Trace & Pixel Gallery und nat&uuml;rlich Objekte. 
Ich werde es auch in Zukunft weiterhin Aktualisieren, und verbessern.

Meine Aussortierten LINKS kann ich nur weiterempfehlen. 

1.Alle die Intresse an Raytraceden Bildern haben. z.B: die 3D-Artists Homepage.
  mit &uuml;ber 300. Bildern und 100.Artist (Teilnehmern) ist das die International 
  Gro&szlig;te Page &uuml;berhaupt. Mann findet nur die besten Bilder. Nat&uuml;rlich sind dort auch 
  Bilder von The Light Works und von Taron zu finden, mit Interviews.

2.Alle die Intresse an Malern haben wie Boris Vallejo, oder Luis Royo. Echte Ober GURUS.
  Jim Warren den anderen Maler ohnes gleichen. Oder Larry Elmore
  der Drachen und Ritter malt AD&D und DSA freunde wird es freuen.

3.Alle die Intresse an Music Files haben, Mod, S3M, XM, oder an Musik Playern.
  Wie den WinAMP MPeg Audio Player, der Beste Player f&uuml;r Mpeg Files f&uuml;r Win95.

4.Alle die Intresse an der Demo Scene haben z.B: die Homepages von Razor 1911,
  Scoopex, u.a. Nat&uuml;rlich findet man auch Links zu Pixel Grafiken vom aller feinstem.

Ein besuch auf diesen Seiten wohnt sich auf jeden fall.

Hier nun meine Homepage Adresse: Http://www.FairPlay.net/Akira/Index.html
Und anschlie&szlig;end meine E-Mail Adresse: A.Kale@Dialup.Soco.de

So das war es wieder einmal von mir.

Ein Dank geht an Andreas Schmidt aus R&ouml;dermark, f&uuml;r die nette Gru&szlig;karte. 
Frage an Andreas has Du eine E-Mail Adresse ???

Danke f&uuml;rs Lesen ;-)

Ich w&uuml;nsche dem Reflector Team und den Reflector Lesern alles Gute und 
ein Erfolgreiches Jahr 1998. </PRE></B><P>

Dank an Akira, nachfolgend noch seine Adresse:


<B><PRE>
        Akira Kale
        Dresdener Str. 8        
        52358 D&uuml;ren
        
</B></PRE></FONT><P> 

<IMG WIDTH=128 HEIGHT=102 SRC="../Galerie/AKALE/2White.GIF" ALT="[BILD]"></A> 2 White Stars
<IMG WIDTH=128 HEIGHT=102 SRC="../Galerie/AKALE/DIGLOGO.GIF" ALT="[BILD]"></A> DIG Logo
<IMG WIDTH=128 HEIGHT=102 SRC="../Galerie/AKALE/MadCat.GIF" ALT="[BILD]"></A> Mad Cat
<IMG WIDTH=128 HEIGHT=102 SRC="../Galerie/AKALE/NarnFly.GIF" ALT="[BILD]"></A>Narrn Fly
<IMG WIDTH=128 HEIGHT=102 SRC="../Galerie/AKALE/Theevil.GIF" ALT="[BILD]"></A> The Evil<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<A HREF="../Galerie.HTM"><IMG WIDTH=69 HEIGHT=49 SRC="../Pix/Pfeilz.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../Hauptmen.HTM"><IMG WIDTH=69 HEIGHT=49 SRC="../Pix/Pfeil.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
