<HTML>
<HEAD>
<TITLE>REFLECTOR 041</TITLE>
</HEAD>
<BODY BACKGROUND="../Pix/Back.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../Pix/Reflecto.GIF" ALT="[REFLECTOR]"></A><P>
Service</H1></CENTER>
<HR SIZE=5><P>

Nicht jedes Mitglied des <B>REFLECTIONS-Club</B> verf&uuml;gt &uuml;ber jede nur erdenkliche
Hardware. Aus diesem Grunde werden wir in Zukunft unter 'Service' Angebote unserer
Mitglieder vorstellen, die genau diese L&uuml;cke zu schlie&szlig;en versuchen. Wer also einen
Farb-Scanner, einen Diabelichter, einen Farblaserdrucker, einen Videoprinter oder
vielleicht zwanzig 4000er sein eigen nennt, der kann hier seine Service-Leistungen
vorstellen, die er allen Mitgliedern zug&auml;nglich machen m&ouml;chte.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
<HR><P>

<A NAME="GernotTrippen"></A>
<B>Gernot Trippen</B><P>

besitzt einen Farbscanner Epson GT-6500 und bietet einen Scann-Service
an. Wer also Fotos, Vorlagen, Texturen oder Hundertmarkscheine gescannt
haben  m&ouml;chte, der wende sich an Gernot. Der Scann-Service ist f&uuml;r
<B>REFLECTIONS-Clubmitglieder</B> kostenlos. Allerdings sind Disk's und ein
frankierter, adressierter R&uuml;ckumschlag f&auml;llig. Es kann durchaus sein,da&szlig; es
ein bis zwei Wochen dauert bis das gew&uuml;nschte Material retour kommt, da
Gernot auch noch nebenbei ein wenig  Zaster verdienen mu&szlig;. Nachfolgend
noch Gernot's Anschrift:<P>

<PRE><FONT Size=4><B>
        Gernot Trippen
        Jagdweg 10

        65207 Wiesbaden-He&szlig;loch
        Tel.: 0611-541504
</PRE></B></FONT><P>
<HR><P>

<A NAME="ViktorGridling"></A>
<B>Viktor Gridling</B><P>

nennt einen Polaroid-Diabelichter sein eigen und bietet allen Interessierten
einen Belichtungsservice auf Dia und/oder Negativ an.Die Qualit&auml;t der Belichtung
ist hervorragend, davon konnten wir uns anhand einiger Demo-Dias und -Fotos
&uuml;berzeugen. Um bestm&ouml;gliche Ergebnisse zu erzielen ist es n&ouml;tig, da&szlig; die
Bilddaten in m&ouml;glichst hoher Aufl&ouml;sung vorliegen, bzw. an Viktor gesandt
werden. Als Datentr&auml;ger sind DD- oder HD-Disketten zu verwenden. Das Bildmaterial
kann prinzipiell in beliebigem Format vorliegen, da Viktor &uuml;ber AdPro verf&uuml;gt.
Wegen des vergleichsweise geringen Platzbedarfes bei JPEG-Kompression ist dieses
Format besonders empfehlenswert. Die Bilder k&ouml;nnen bis zu 2048 x 1356 Pixel gro&szlig;
sein. Nun noch zu den Kosten der Belichtung:<P>

<PRE><Font Size=4>
                bis 20 Belichtungen  -  30 DM oder 200 ATS
</PRE></Font><P>

Die Preise beinhalten die Belichtung und die Versand- und Portokosten der
Dias oder Negative. Ein &auml;u&szlig;erst g&uuml;nstiges und attraktives Angebot wie wir
bemerken m&uuml;ssen.<BR>
Desweiteren verf&uuml;gt Viktor &uuml;ber einen Epson-GT8000 - Flachbrettscanner. Das
interessierte Clubmitglied hat die M&ouml;glichkeit seine Lieblings - Fotos oder
-vorlagen von Viktor scannen zu lassen. Nachfolgend die Adresse von
Viktor:<P>

<PRE><Font Size=4><B>
        Viktor Gridling
        Kopalgasse 66-68/3/6

        1110 Wien
        &Ouml;sterreich
</PRE></B></Font><P>
<HR><P>

<A NAME="UweSauder"></A>
<B>Uwe Sauder</B><P>

aus Duisburg bietet einen Service in Bezug auf die Konvertierung von Objekten
ins <B>REFLECTIONS</B>-Format. Es gibt ja inzwischen eine Vielzahl von diversen
Objekten auf dem PD-Markt. Hinzu kommen noch die kommerziellen Objektsammlungen.
Quellen f&uuml;r qualitativ hochwertiges Material gibt es also reichlich, nur liegen
diese meistens in verschiedenen Formaten vor (Real3D, Imagine, Lightwave um nur
ein paar zu nennen). Erstaunlicherweise kocht hier jeder Anbieter von Raytracing -
Programmen sein eigenes S&uuml;ppchen, zum Leidwesen des Anwenders. W&auml;re eventuell mal
Zeit f&uuml;r ein von allen unterst&uuml;tztes Austauschformat f&uuml;r 3D-Objekte.<P>

Genau in diese L&uuml;cke springen dann Tools wie z. B. MagicLink, die diese H&uuml;rde
nehmen. Uwe besitzt dieses Programm und bietet einen Konvertier-Service f&uuml;r die
Mitglieder. Da dieses Unterfangen ein wenig Arbeit mit sich bringt, k&ouml;nnte es
schon mal ein Weilchen dauern, bis Ihr die fertigen Objekte wiederbekommt.
Allerdings werden nur die Objekte konvertiert, die Texturen und Materialien
m&uuml;&szlig;t Ihr dann schon selbst an die Objekten vergeben. Wobei gesagt werden mu&szlig;,
da&szlig; in der Regel die vergebenen Texturen und Materialien der Objekte mit ins
<B>REF</B>-Format &uuml;bernommen werden.<P>

Besonders interessant d&uuml;rfte dieser Service f&uuml;r PC-User sein, da es f&uuml;r dieses
System kaum Tools zur Objektkonvertierung gibt. Es mu&szlig; wohl nicht erw&auml;hnt
werden, da&szlig; Eurer Zusendung ausreichend R&uuml;ckporto beiliegt.<P>

<PRE><Font Size=4><B>
        Uwe Sauder
        Aakerf&auml;hrstr. 104

        47058 Duisburg
        Tel.: 0203-338557
</PRE></B></Font><P>

<HR SIZE=5>
<A HREF="../Hauptmen.HTM"><IMG WIDTH=69 HEIGHT=49 SRC="../Pix/Pfeilz.GIF" ALT="[ZURUECK]"></A> ZURUECK
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
