<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Editorial</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER">Editorial</H1>
<BR>

<P>Dies ist augenscheinlich nicht nur f&uuml;r Amiga die Zeit eines Umbruchs
(dazu siehe weiter unten), sondern auch f&uuml;r den AmZeiger. Mehrere
wichtige &Auml;nderungen haben sich ergeben, die ich in <A HREF="intern.htm">Interna</A> detailliert
erl&auml;utere. <B>Eine Menge Neuigkeiten</B>, die jeden Leser interessieren d&uuml;rften.</P>

<P><B>Amiga im Umbruch</B></P>

<P>Keine Frage, die einschneidendste Meldung des letzten Quartals war Ende
Februar die Umstrukturierung der Amiga-Firmengruppe, wie man jetzt schon
sagen mu&szlig;. Eine sachliche Nennung der Sachverhalte finden Sie bei <A HREF="news.htm">Am Puls</A>.</P>

<P>Der neue Chef Jim Collas, aus der F&uuml;hrungsetage der Konzernmutter Gateway,
lie&szlig; schon einige <B>markige Spr&uuml;che</B> h&ouml;ren, wie z.B. das Gateway es `versaut`
und die Amiga-Usergemeinde untersch&auml;tzt h&auml;tte. Wenn sie noch etwas bewegen
wollten, m&uuml;&szlig;ten Sie es sofort tun (sinngem&auml;&szlig;).</P>

<P>Es wird offensichtlich, da&szlig;, nach einer langen Zeit der Versprechungen,
der widerspr&uuml;chlichen Entscheidungen und vor allen Dingen dessen, da&szlig;
Netto fast nichts dabei herausgekommen ist, etwas ver&auml;ndert werden soll
- und zwar tiefgreifend.</P>

<P>Ob es sich bei vollmundigen Aussagen dar&uuml;ber, da&szlig; tats&auml;chlich schon dieses
Jahr erste Ergebnisse in Sachen AmigaNG zu sehen sein und zig Millionen
St&uuml;ck verkauft werden sollen, wieder nur um leere oder &uuml;bertriebene
Versprechungen handelt, wird die Zukunft zeigen - erfreulicherweise aber
schon bald.</P>

<P>Erste greifbare Ma&szlig;nahmen, wie die Verlegung des Hauptquartiers, die
Einrichtung einer separaten Entwicklungsabteilung, sowie klarer
Entscheidungen zu der Zukunft des Betriebssystems, das viele tausend
Anwender jetzt in diesem Moment zum Lesen dieser Ausgabe verwenden,
sind aber positive Anzeichen.</P>

<P>Solange es keinen AmigaNG gibt, der erst beweisen mu&szlig;, ob er dem
Namen auch wirklich gerecht wird, solange gibt es auch keine Classic-
Amigas, sondern es gibt nur DEN Amiga und eine Fata Morgana.</P>

<P>Jedenfalls lassen diese ersten signifikanten Einschnitte die Vermutung zu,
da&szlig; es sich bei Jim Collas wirklich um einen tatkr&auml;ftigen Manager handelt,
der meint, was er sagt und der Ergebnisse durchsetzen will.</P>

<P>Wer aber ist dieser <B>Jim Collas</B> eigentlich?</P>

<P>Bevor er zu Gateway 2000 kam, war er Pr&auml;sident von Anigma (eventuelle
&Auml;hnlichkeiten sind rein zuf&auml;llig! ;), einer PC-Board-Entwicklungsfirma,
die er selbst 1987 gegr&uuml;ndet hatte. Im Juni 1992 wurde er bei Gateway 2000
zust&auml;ndig f&uuml;r die Produktentwicklungsabteilung. Im Dezember desselben
Jahres stieg er zum Vizepr&auml;sidenten dieses Bereiches auf. 1994 &uuml;bernahm
er den Bereich `Technischen Service und Support`, bevor er schlie&szlig;lich
als Senior Vice President zust&auml;ndig f&uuml;r globale Produkte wurde. Nun ist
er Chef von Amiga.</P>

<P><B>Doch ein AmigaOS 3.5!</B></P>

<P>Handfestere Auswirkungen, zumindest kurzfristiger Natur, wird die
Entscheidung haben, AmigaOS 3.5 nun doch herauszubringen. Allerdings h&auml;ngt
auch sie mit der neuen Gesamtsituation zusammen, da Petro Tyschtschenko
nun gr&uuml;nes Licht bekommen hat, dieses Projekt selbst voranzutreiben. Ein
Vertrag mit Haage&Partner war so schnell unterzeichnet.</P>

<P>Die ersten <B>Screenshots</B> k&ouml;nnen einen nicht unbedingt vom Hocker rei&szlig;en. Das
neue BOOPSI-Gadget-Design, da&szlig; z.B. viele neue Einsteller beeinflu&szlig;en wird,
wirkt irgendwie doch ein wenig wie St&uuml;ckwerk und zumindest nicht den
modernen geschmacklichen Anspr&uuml;chen gen&uuml;gend, soweit man dies zu diesem
Zeitpunkt sagen kann und bis zum August, wo es fertig sein soll, ist ja
auch nicht mehr so viel Zeit. Bleibt zu hoffen, da&szlig; das Design also
konfigurierbar sein wird.</P>

<P>Den Gedanken eventuell doch <B>MUI</B> zu integrieren, f&uuml;r das schon sehr viele
Applikationen existieren, das anerkannterma&szlig;en leistungsf&auml;hig und dabei
f&uuml;r den Programmierer relativ einfach einzusetzen ist und wodurch die
gesamte Oberfl&auml;che wie aus einem Gu&szlig; wirken k&ouml;nnte, dabei aber trotzdem
konkurrenzlos gut konfigurierbar w&auml;re, will ich also lieber nicht
aufbringen. ;)</P>

<P>Ebenso wichtig sind sicher viele andere Dinge, die nun eingebracht werden,
wie TCP/IP, CD-Rom-Unterst&uuml;tzung, neue Druckertreiber usw., usw.. Alles
beachtlich - aber wenn man sich die Features (s. <A HREF="news.htm">Am Puls</A>) genauer anschaut,
f&auml;llt auf: Fast jeder User, der einen Amiga als `Hauptrechner` gegenw&auml;rtig
ernsthaft einsetzt, hat schon zumindest einige dieser Bestandteile entweder
als Freeware oder vor allen Dingen als Shareware bzw. kommerzielle L&ouml;sung
mit Geld bezahlt, das er nun bei einem Griff zu OS 3.5 umsonst ausgegeben
h&auml;tte.</P>

<P>Man kann es sicher nicht jedem Recht machen, aber die Punkte <B>RTA
(ReTargetable Audio) und RTG (ReTargetable Graphic)</B>, also ein einheitlicher
Standard zur Einbindung von Grafik- und Soundkarten ins System, so da&szlig; sie
generell und problemlos von jeder Software unterst&uuml;tzt w&uuml;rden, w&auml;ren f&uuml;r
mich elementare Bestandteile eines wahrhaften OS 3.5 nach so vielen Jahren!</P>

<P>Im Sommer sehen wir klar, wenn AmigaOS 3.5 dann erh&auml;ltlich sein wird.</P>


<P>
Wie immer mit der Bitte um <A HREF="support.htm">Unterst&uuml;tzung</A> und Lesermeinungen verbleibt,</P>
<BR> <BR>
Ihr<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A><BR>
Chefredakteur<BR>

<DIV ALIGN="CENTER">...und unser <A HREF="danke.htm">DANK</A> geht an...<DIV ALIGN="CENTER">

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="main.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="news.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
