<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Indzierung</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Indizierungen von Computerspielen in der Praxis</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Viele Legenden, Halbwahrheiten und Ungenauigkeiten ranken sich um den
Begriff der Indizierung: den Vorgang, seine Auswirkungen und die Beh&ouml;rde,
die dahintersteht. <B>Dieser Artikel</B> versucht die wesentlichen Fakten zu
erhellen und sich kontrovers mit dem Aspekt seines Sinns und seiner
Praktikabilit&auml;t auseinanderzusetzen.</P>

<P><B>Indizierung allgemein</B></P>

<P>Indizierung: das bedeutet, da&szlig; die zust&auml;ndige Beh&ouml;rde, die <B>Bundespr&uuml;fstelle
f&uuml;r jugendgef&auml;hrdende Schriften (BPjS)</B>, B&uuml;cher, Filme und auch Video- sowie
Computerspiele auf ihren Inhalt untersucht und sie, wenn sie f&uuml;ndig in der
Hinsicht wird, da&szlig; eine sittliche Gef&auml;hrdung von Kindern und Jugendlichen
vorliegt, auf den Index setzt - denn daf&uuml;r steht das, aus dem lateinischen
stammende, 'Indizieren'.</P>

<P><B>Wer ist verantwortlich f&uuml;r die Entscheidung?</B></P>

<P>Die Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften, nachfolgend mit dem
K&uuml;rzel BPjS bezeichnet, sitzt in Bonn. Das Recht Antr&auml;ge auf Indizierung
einzureichen, haben die Obersten Jugendbeh&ouml;rden der L&auml;nder, die
Landesjugend&auml;mter, die Jugend&auml;mter und der Bundesminister f&uuml;r Frauen und
Jugend.</P>

<P>Fr&uuml;her durfte die BPjS nur auf einen solchen Antrag hin t&auml;tig werden.
Seit der Neuregelung des Paragraphen 18 im Gesetz zur Verbreitung
jugendgef&auml;hrdender Schriften aber, kann sie es auch dann, wenn das
Computerspiel ganz oder weitgehend inhaltsgleich zu einem bereits
indizierten ist oder wenn ein Gericht pornographischen Inhalt
festgestellt hat. &quot;Ganz und weitgehend gleich&quot; bezieht sich in der
momentanen Praxis haupts&auml;chlich auf das Erscheinen desselben Spiels
auf unterschiedlichen Plattformen, was bisher eine separate Indizierung
notwendig machte.</P>

<P>Ob dann tats&auml;chlich eine Indizierung vorgenommen werden soll, entscheidet
ein Gremium bei der BPjS. Wenn die Beh&ouml;rde von den obigen Instanzen einen
Antrag und ein Belegexemplar erhalten hat, wird beides zuerst in einem
'vereinfachten Verfahren' an eine Dreier-Kommission geleitet, die sich aus
dem Vorsitzenden der BPjS, einem Beisitzer aus dem Bereich Kunst/Literatur/
Buchhandel/Verleger und einem weiteren Beisitzer zusammensetzt. Wenn diese
drei nicht zu einer einstimmigen Entscheidung gelangen, wird das Material
an ein Zw&ouml;lfer-Gremium weitergeleitet.</P>

<P>Das Zw&ouml;lfer-Gremium besteht aus dem Vorsitzenden, acht Gruppenbeisitzern,
sowie drei L&auml;nderbeisitzern mit Zweidrittelmehrheit. Die Gruppenbeisitzer
entstammen den Bereichen Kunst/Literatur/Buchhandel/Verleger/Jugendverb&auml;nde/
Jugendwohlfahrt/Lehrerschaft sowie den Kirchen und werden von den
entsprechenden Verb&auml;nden ernannt.</P>

<P>Zitat aus einer Brosch&uuml;re der BPjS zu diesem Thema: &quot;Die BPjS ist eine
Bundesbeh&ouml;rde mit gerichts&auml;hnlicher Funktion. Ihre Mitglieder, d.h. die
Beisitzer einschlie&szlig;lich der Vorsitzenden, sind im Rahmen der
Indizierungsverfahren nicht an Weisungen gebunden.&quot;</P>

<P><B>Nach welchen Kriterien entscheidet die BPjS?</B></P>

<P>Die gesetzlichen Regelungen, auf die sich die Entscheidenden beziehen,
entstammen dem &quot;<B>Gesetz zur Verbreitung jugendgef&auml;hrdender Schriften (GjS)</B>&quot;:</P>

<P>&quot;Par. 1</P>

<OL>
<LI>Schriften, die geeignet sind, Kinder oder Jugendliche sittlich zu
    gef&auml;hrden, sind in eine Liste aufzunehmen. Dazu z&auml;hlen vor allem
    unsittliche, verrohend wirkende, zu Gewaltt&auml;tigkeit, Verbrechen oder
    Rassenha&szlig; anreizende sowie den Krieg verherrlichende Schriften. [...]
</LI><LI>Eine Schrift darf nicht aufgenommen werden
<OL>
<LI>allein wegen eines politischen, sozialen, religi&ouml;sen oder weltanschaulichen Inhalts;</LI>
<LI>wenn sie der Kunst oder der Wissenschaft, der Forschung oder der Lehre dient;</LI>
<LI>wenn sie im &ouml;ffentlichen Interesse liegt, es sei denn, da&szlig; die Art der Darstellung
    zu beanstanden ist.</LI>
<LI>Den Schriften stehen Ton- und Bildtr&auml;ger, Abbildungen und andere Darstellungen gleich.&quot;</LI>
</OL>
</OL>

<P>Paragraph (3) bedeutet also auch eine Zust&auml;ndigkeit f&uuml;r Spiele bzw.
Computerspiele. Mit FSK-Freigaben f&uuml;r Kino- und Videofilme hat die BPjS
allerdings nichts zu tun, wie auch Fernsehproduktionen nicht zu ihrer
Einflu&szlig;sph&auml;re geh&ouml;ren. </P>

<P><B>Vor allen Dingen folgende Kriterien sind f&uuml;r die BPjS ausschlaggebend:</B></P>

<UL>
<LI>exzessive Gewaltdarstellungen </LI>
<LI>Verherrlichung von Nazi-Ideologie und Rassenha&szlig;  </LI>
<LI>Verherrlichung oder Verharmlosung von Krieg            </LI>
<LI>Pornographie, die ,sexualethisch desorientierend' wirkt</LI>
<LI>Verherrlichung oder Verharmlosung von Drogenkonsum     </LI>
</UL>

<P><B>Wie erf&auml;hrt man &uuml;berhaupt von Indizierungen?</B></P>

<P>Bekanntgemacht werden die Indizierungen im Bundesanzeiger, einem Blatt,
in das sicherlich ein Gro&szlig;teil der betroffenen Personengruppen keinen
Einblick hat. Auf der Website der BPjS gibt es keinerlei Liste und im
Internet sind an anderen Stellen allenfalls unvollst&auml;ndige und inaktuelle
Listen zu finden, die auf Wunsch der Beh&ouml;rde auch nicht weitergepflegt
werden. Dazu sp&auml;ter mehr.</P>

<P>Verleger, Zwischenh&auml;ndler und Importeure sind allerdings nach Paragraph
4 GjS verpflichtet, ihre Abnehmer von der Indizierung zu informieren.</P>

<P><B>Was aber hat eine Indizierung eigentlich f&uuml;r Konsequenzen?</B></P>

<P>Dies ist im GjS Paragraph 3-5 geregelt. Verst&ouml;sse dagegen werden mit Geld-
oder Freiheitsstrafen bis zu einem Jahr geahndet. Erziehungsberechtigte
(in der Regel die Eltern) geniessen erh&ouml;hten Schutz. (Paragraph 21 GjS)</P>

<P>Paragraph 5 beinhaltet, da&szlig; indizierte Medien Kindern und Jugendlichen in
keiner Form zug&auml;nglich gemacht werden d&uuml;rfen. Das hei&szlig;t, sie d&uuml;rfen ihnen
nicht nur nicht verkauft oder geschenkt werden, sondern auch weder gezeigt
noch in ihrem Beisein genutzt werden.</P>

<P>F&uuml;r Gewerbetreibende bedeutet dies, da&szlig; indizierte Objekte nicht an Orten
ausgestellt und angeboten werden d&uuml;rfen, die Kindern und Jugendlichen
zug&auml;nglich sind. Nur ein Verkauf &quot;unter dem Ladentisch&quot; ist erlaubt und
nur, wenn der (vollj&auml;hrige) Kunde von selbst danach fragt.</P>

<P>Lt. Paragraph 4 d&uuml;rfen der `Einzelhandel au&szlig;erhalb von Gesch&auml;ftsr&auml;umen`,
Kioske und der Versandhandel (da dort die Alters&uuml;berpr&uuml;fung problematisch
ist) keinerlei indizierte Medien anbieten, verkaufen, verleihen oder
vorr&auml;tig halten.</P>

<P>Interessant auch der Inhalt des Paragraphen 5. Hier geht es um
<B>Werbeverbote</B>. F&uuml;r indizierte Medien darf nicht mehr in der &Ouml;ffentlichkeit
geworben werden, nur noch in lediglich Erwachsenen zug&auml;nglichen R&auml;umen.
In keinem Fall darf mit der Indizierung &quot;geworben&quot; werden bzw. damit, da&szlig;
ein Indizierungsverfahren anh&auml;ngig ist oder war, auch wenn ein Medium dann
nicht indiziert wurde.</P>

<P>Originaltext BPjS: &quot;Verboten ist jede Form der Werbung, auch die Werbung,
die selbst nicht jugendgef&auml;hrdend ist. Die Nennung auch nur des Titels
eines indizierten Mediums ist verboten (sogenannte gegenstandsneutrale
Werbung).&quot;</P>

<P><B>Die Frage nach dem Sinn dieser Ma&szlig;nahmen</B></P>

<P>Zweifellos wird unsere Gesellschaft mit einer Flut von teilweise &auml;u&szlig;erst
gewaltt&auml;tigen und pornographischen Medien eingedeckt. Leider gibt es auch
einzelne rassistische Dinge, gegen die zweifellos vorgegangen werden mu&szlig;.
Den Begriff der 'Zensur' der im Zusammenhang mit der BPjS auch schon fiel,
wird von ihr vehement zur&uuml;ckgewiesen, denn es gehe ja nicht um ein
komplettes Verbot der Objekte, sondern lediglich um das Verhindern
des Zugriffs von Kindern und Jugendlichen darauf.</P>

<P>Das ist ein l&ouml;bliches Ziel und bei manchem Schund kann man da auch
bedenkenlos zustimmen. Die Gefahr des gelegentlichen Mi&szlig;brauchs der
Kompetenzen der Entscheider aus Geschmacksgr&uuml;nden und die, bei den oben
genannten Ma&szlig;nahmen doch faktisch einem Verbot bzw. einer Demontage jeder
wirtschaftlichen Erfolgsm&ouml;glichkeit nahekommende Realit&auml;t (da vielfach
keinerlei Pr&auml;senz im Handel bzw. keinerlei Werbung oder auch nur Nennung),
l&auml;&szlig;t aber doch gelegentlich Fragen am Sinn der praktizierten Handhabung
aufkommen. Daf&uuml;r ist auch vor allen Dingen der folgende Abschnitt von
Bedeutung.</P>

<P><B>Die Frage nach der Wirkung der Ma&szlig;nahmen</B></P>

<P>Viele Ger&uuml;chte ranken sich ja um die 'verbotenen' Computerspiele. Manchmal
ist gar nicht konkret bekannt, ob dieses oder jenes nun indiziert ist oder
nicht, was auch von der Informationspolitik der BPjS herr&uuml;hrt. Das
Interesse ist aber auf jeden Fall geweckt, getreu dem Motto: &quot;Was
verboten ist, &uuml;bt einen besonderen Reiz aus&quot;.</P>

<P>Bei einer nicht repr&auml;sentativen, aber doch den Trend aufzeigenden Umfrage
des Landesinstituts f&uuml;r Schule und Weiterbildung Soest, der Klassen 5, 6
und 7 an einer K&ouml;lner Gesamtschule im Herbst 1996 zum Thema Video/
Computerspiele, gab die H&auml;lfte der Jungen (aber nur wenige  M&auml;dchen) an,
schon einmal verbotene Spiele ausprobiert zu haben. 43% gaben an, da&szlig; sie
gerne (noch) eins ausprobieren wollen.</P>

<P>Sicherlich ist dies ein Mitgrund daf&uuml;r, da&szlig; die BPjS, wie oben angesprochen,
m&ouml;glichst jede Erw&auml;hnung der konkreten Titel z.B. im Internet vermeiden
will, um gar nicht erst neugierig zu machen, selbst wenn es dort um
Aufkl&auml;rung geht.</P>

<P>Trotzdem hat fast jeder schon von den bekanntesten Spielen geh&ouml;rt und sehr
viele haben sie auch selbst bereits gespielt. Zumindest die rigide
Informationspolitik scheint da wenig zu fruchten.</P>

<P><B>Die Frage der Verh&auml;ltnism&auml;&szlig;igkeit am konkreten Fall von Computerspielen</B></P>

<P>Kritiker, darunter hochrangige Experten f&uuml;r Neue Medien, bem&auml;ngeln, da&szlig; in
aller Welt bekannte und beliebte topmoderne Mainstreamprodukte hier in
Deutschland durch Indizierung mit pornographischen und rassistischen
Machwerken in einen Topf geworfen werden oder das in Filmen, wie Braveheart
und Predator, eine ganze Menge sehr echt wirkender Menschen durch Gewalt
ums Leben kommen, ohne solchen Restriktionen unterworfen zu sein.</P>

<P>&quot;Indizierungen in diesem extrem dynamischen und un&uuml;berschaubaren Markt,
der sich zum Teil auch unkontrollierbarer Vertriebswege (z.B. Internet,
Schwarzmarkt) bedient, greifen jedoch viel zu sp&auml;t und erreichen bei den
Kids eher das Gegenteil. F&uuml;r Jugendliche, die sich in der Spieler-
'Subkultur' bewegen, werden diese Spiele dadurch 'k&uuml;nstlich' interessant
gemacht. Indizierungen unterstreichen die vermeintliche 'Qualtit&auml;t' eines
Spiels, das man auf jeden Fall haben mu&szlig;. ...&quot;</P>

<P>(Friedemann Schindler / Jens Wiemken, zitiert aus: &quot;Wer hat Angst vor
Super Mario? - Computerspiele und p&auml;dagogische Praxis&quot; in: W. Faulstich,
Gerhard Lippert (Hrsg.), &quot;Medien in der Schule&quot;, S.246)</P>

<P><B>Gegenw&auml;rtig</B> gelangen Produkte dieses Segments erst einmal ungepr&uuml;ft auf
den Markt. Da die BPjS nur auf Antrag aktiv wird und dann irgendwann
entscheidet, haben sich die Spiele schon unkontrollierbar verbreitet und
das Interesse wird dann tats&auml;chlich nur noch angefacht, da auch ein
Behindern der Nennung dieser Spiele (ab diesem Zeitpunkt) den Wirbel,
den das Entfernen vom Markt verursacht, nicht vertuschen kann.</P>

<P>Dies l&auml;&szlig;t dann doch am Sinn der Aktion an sich zweifeln. Das angeblich
verdammenswerte Produkt hat gerade in der Klientel, von der es ferngehalten
werden sollte, einen besonderen Schub bekommen - und das mit Hilfe der
Bundesbeh&ouml;rde, diametral zu ihrer eigentlichen Intention!</P>

<P>Sehr lesenswert ist &uuml;brigens die vom Mai 1994 stammende <B>Begr&uuml;ndung der
Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften zur Indizierung von Doom</B>,
einem Spiel, das wohl nicht nur durch seine technischen und spielerischen
Merkmale derart bekannt wurde, sondern auch durch den Vorgang der
Indizierung selbst:</P>

<P>&quot;Wesentlicher Inhalt des Spiels ist die bedenkenlose, realistisch
inszenierte T&ouml;tung, unter anderem von Gegnern in Menschengestalt, was f&uuml;r
jeden Zuschauer klar und zweifelsfrei erkennbar ist. Die sozial-ethische
Desorientierung r&uuml;hrt hier aus der Ein&uuml;bung des gezielten T&ouml;tens. Die
programmimmanente Logik bindet den Spieler an ein automatisiertes Befehls-
und Gehorsamsverh&auml;ltnis, dessen wesentlicher Kern das reaktionsschnelle
T&ouml;ten menschen-, beziehungsweise tier&auml;hnlicher Gegen&uuml;ber ausmacht.
M&ouml;glichkeiten des Ausweichens oder &auml;hnlicher nonaggressiver
Konfliktl&ouml;sungen existieren nicht. Da sich der Spieler im stetigen Kampf
um das eigene &Uuml;berleben befindet, wird er gef&uuml;hlsm&auml;&szlig;ig intensiv in das
Spielgeschehen einbezogen. Die Art der Steuerung verlangt stetige
Konzentration, schnelle und zuverl&auml;ssige Reizaufnahme sowie mittelm&auml;&szlig;ig
bis hohe Leistungen im Bereich der Feinmotorik. Eine kritische Bewertung
des aggressiven Spielinhalts ist dem Spieler aufgrund einer derart hohen
psycho-physischen Beanspruchung nicht m&ouml;glich. Das T&ouml;ten wird, der hohen
Leistungsmotivation insbesondere m&auml;nnlicher Heranwachsender entgegenkommend,
spielerisch einge&uuml;bt und zum sportlichen Vergn&uuml;gen verniedlicht.&quot;</P>

<P>(Auszug, zitiert nach: Computerspiele-T&Uuml;V, Hrsg. F&ouml;rderverein f&uuml;r Jugend-
und -sozialarbeit e.V.)</P>

<P>Zu einer der <B>zentralen Kriterien</B> der BPjS in der Beurteilung von
Computerspielen, ist mittlerweile insbesondere die Verwendung menschlicher
oder menschen&auml;hnlicher Gegner geworden. Viele Spiele erscheinen speziell
in Deutschland mit leicht ver&auml;nderten Versionen, in denen diese Gegner als
Tiere, Mutanten oder, besonders beliebt, als Androiden bzw. Roboter
auftreten. F&uuml;r manche Spiele, wie z.B. Quake 2 hat der BPjS dieses
allerdings nicht gen&uuml;gt und, nachdem sie es am 20.12.1997 vorl&auml;ufig
indizierte, Strafantrag bei der Staatsanwaltschaft Stuttgart gestellt.</P>

<P>Der Staatsanwalt konnte sich dann allerdings nicht der Auffassung
anschlie&szlig;en, da&szlig; Quake 2 unter den Paragraphen 131 StGB falle, weil die
dort pr&auml;sentierten Wesen nicht als &quot;Mensch&quot; einzustufen w&auml;ren. Diese
Einsch&auml;tzung des Staatsanwalts beruht auf einem Urteil des
Bundesverfassungsgerichts zum Videofilm &quot;Tanz der Teufel&quot;. Er kam aber
zu der Auffassung, da&szlig; der Vertrieb des Computerspiels trotzdem
strafrechtlich relevant sei und zwar da es unter den Paragraphen 6 Nr.3
GjS einzustufen sei.</P>

<P>Was f&uuml;r <B>Bl&uuml;ten</B> die Handhabung durch das BPjS teilweise treiben kann, zeigt
meiner Meinung nach, das Beispiel des ebenfalls &auml;u&szlig;erst bekannten Spiels
&quot;<B>Command & Conquer</B>&quot;, das zum Wegbereiter f&uuml;r eine ganze Armada von diversen
Klons geworden ist. Die kleinen Soldaten, die unter anderem auf der
Landschaft dirigiert werden m&uuml;ssen, sind in den Standardversionen
nat&uuml;rlich Menschen, in der deutschen sehen sie zwar identisch aus, aber
die Samples wurden ausgetauscht. Befehlsbest&auml;tigungen erklingen nun
'robotisch' und wenn ein Panzer &uuml;ber sie hinwegrollt, ert&ouml;nt ein Ger&auml;usch,
das an eine zerdr&uuml;ckte Bierdose erinnert. So gen&uuml;gte es dann also den
Vorschriften - Realsatire pur.</P>

<P><B>Fazit zur gegenw&auml;rtigen Praxis</B></P>

<P>Es bleibt zu konstatieren, da&szlig; der derzeit praktizierte Umgang mit
potentiell problematischen Computerspielen zwar von hehren Zielen
getragen ist und teilweise auch von den Produkten her eine Berechtigung
hat, da&szlig; aber, neben einigen zweifelhaften Entscheidungen und einer
zensur&auml;hnlichen Wirkung in manchen Bereichen (da die Programme auch f&uuml;r
Erwachsene nur sehr schwer zu beziehen sind), insbesondere nicht die
gew&uuml;nschte Wirkung erzielt wird.</P>

<P>Die Intention war, Kinder und Jugendliche nicht mit f&uuml;r sie ungeeigneten
Inhalten in Ber&uuml;hrung kommen zu lassen, was leider, wie beschrieben, durch
ein versp&auml;tetes Verfahren in der heutigen Zeit, mit den M&ouml;glichkeiten zur
schnellen Verbreitung der Medien, nicht zu erreichen ist. Dagegen wird
eine vermehrte Aufmerksamkeit gerade der zu sch&uuml;tzenden Gruppe auf diese
Objekte gezogen.</P>

<P><B>Gibt es Alternativen?</B></P>

<P>Um nicht mi&szlig;verstanden zu werden: Viele der von der BPjS indizierten Spiele
sind unzweifelhaft nicht f&uuml;r Kinder und Jugendliche geeignet - harmlos
ausgedr&uuml;ckt - und sollten ihnen wirklich  nicht zug&auml;nglich gemacht werden.
Nur die Wirkung, bzw. das, was bisher vielmehr nicht bewirkt wurde, ist es,
was meine Kritik weckt. Dieser Weg hat sich in vielen wichtigen F&auml;llen
offensichtlich als nicht praktikabel erwiesen.</P>

<P>Eine Alternative stellt vielleicht die Initiative der Unterhaltungssoftwareindustrie
dar. Der Verband der Unterhaltungssoftware Deutschland (VUD) und der
F&ouml;rderverein f&uuml;r Jugend- und Sozialarbeit (fjs) haben im Herbst 1994 die
<B>Unterhaltungssoftware-Selbstkontrolle (USK)</B> gegr&uuml;ndet. Auch hier begutachten
Gremien die Spiele und vergeben  zur Orientierung f&uuml;nf Alterseinstufungen,
mit denen die Software gekennzeichnet wird, BEVOR sie auf dem Markt
erscheint:</P>

<UL>
<LI>Geeignet ohne Altersbeschr&auml;nkung </LI>
<LI>Geeignet ab 6 Jahren                  </LI>
<LI>Geeignet ab 12 Jahren                 </LI>
<LI>Geeignet ab 16 Jahren                 </LI>
<LI>Nicht geeignet unter 18 Jahren        </LI>
</UL>

<P>Ein pragmatischer, den realen Bedingungen angepa&szlig;ter, unb&uuml;rokratischer
Kompromi&szlig; zwischen den L&ouml;sungen und Vorgehensweisen der BPjS und USK, also
zwischen Beh&ouml;rde und Industrie, k&ouml;nnte einen Mittelweg darstellen, der die
gew&uuml;nschte Wirkung nach sich zieht. </P>

<hr width=50%>

<br>
<B>Quellen und Adressen:</B><br><br>

<A HREF="http://www.bmfsfj.de/bpjs/">Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften</A>,
Postfach 26 01 21, 53153 Bonn<br>

<HR>

Das Indizierungs-FAQ von Marc Aurel (<A HREF="mailto:4-tea-2@bong.saar.de">4-tea-2@bong.saar.de</A>),
<A HREF="http://www.saar.de/~bong/archiv/faq/indexfaq.html">http://www.saar.de/~bong/archiv/faq/indexfaq.html</A>
<br>
<br>sowie dortige Zitate aus der offiziellen BPjS-Brosch&uuml;re &quot;Die
Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften informiert:
Gesetzlicher Jugendschutz&quot;.<br>

<hr>

Landesinstitut f&uuml;r Schule und Weiterbildung, Soest
<A HREF="http://www.lsw.nrw.de/lswhome/">http://www.lsw.nrw.de/lswhome/</A>
bzw. zu diesem Thema:
<A HREF="http://www.learn-line.nrw.de/Themen/Computerspiele/umgang1.htm">http://www.learn-line.nrw.de/Themen/Computerspiele/umgang1.htm</A>
<br>

<HR>

Unterhaltungssoftware-Selbstkontrolle (USK)
<A HREF="http://www.usk.de">http://www.usk.de</A><br>

<HR>

<br>Weitere Stellungnahmen zum Thema &quot;Indizierung&quot; sind unter folgender
Adresse zu finden:
<A HREF="http://www.educat.hu-berlin.de/~frerk/spiele/diskuss.html">http://www.educat.hu-berlin.de/~frerk/spiele/diskuss.html</A>

<P>Einen interessanten Text zum Thema: &quot;Ist die BRAVO jugendgef&auml;hrdend?&quot;
finden Sie unter:
<A HREF="http://www.nordzeit.de/Storchennest/bravog.htm">http://www.nordzeit.de/Storchennest/bravog.htm</A>
 </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="intern.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


