<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Interna Infernale</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H1>Interna Infernale</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<H3><B>Interna allgemein</B></H3>

<P><B>Carsten Jahn</B> ist nicht mehr fester Redakteur des AmZeigers. Er war
f&uuml;r die <A HREF="../cc/9903bas.htm">Coder's Corner</A> zust&auml;ndig und kann sich dieser Aufgabe leider
nicht mehr widmen. Wer sich dazu berufen f&uuml;hlt, diese L&uuml;cke zu
schlie&szlig;en, <B>der melde sich bitte!</B></P><P>
Ein Danke an Carsten f&uuml;r die gute Zusammenarbeit!</P>

<HR WIDTH="50%">

<P>Aber auch viel <B>Positives</B> gibt es zu vermelden:</P>

<P><B>Peter Fischer</B> ist Redakteur auf Probe geworden. Ein Status, den alle
neuen Redakteure eine Ausgabe lang inne haben. Er ist f&uuml;r <a href="../pd/9903box.htm">Public Domain</a>
zust&auml;ndig, informiert &uuml;ber Neuigkeiten in diesem Sektor und testet einzelne
PD-Programme. Ich denke, das Deb&uuml;t kann &uuml;berzeugen!</P>

<HR WIDTH="50%">

<P>Der AmZeiger hat jetzt eine <B>eigene Domain!</B> Sie lautet nat&uuml;rlich:
<A HREF="http://www.AmZeiger.de">http://www.AmZeiger.de/</A></P>

<P>Die Umleitadresse <A HREF="http://amzeiger.home.pages.de">http://AmZeiger.home.pages.de/</A> bleibt nach wie
vor g&uuml;ltig und wird auch in Zukunft auf die prim&auml;re Site verweisen.</P>

<HR WIDTH="50%">

<P>Dort (alle anderen Sites und die Offline-Ausgabe verweisen darauf)
ist auch eine weitere Neuerung zu finden, die nur den Online-Lesern
zur Verf&uuml;gung steht:</P>

<P><a href="http://home.ecore.net/amzeiger/alf.htm">A L F</a><B> - Das AmZeiger-LeserForum!</B></P>

<P>Auf dieser Seite gibt es, neben ausgew&auml;hlten aktuellen Meldungen, die
teilweise von den Redakteuren direkt kommentiert werden; Umfragen und
Diskussionsthemen. Die Surfer k&ouml;nnen sich ihren Frust von der Seele
reden und selbst kommentieren, wie sie wollen.</P>

<P>Es handelt sich NICHT um eine ausgesprochene Newsseite - daf&uuml;r gibt
es sehr gute spezialisierte Quellen. Ein Update wird regelm&auml;&szlig;ig,
voraussichtlich w&ouml;chentlich, erfolgen.</P>

<P>Informationen, wie sie mit ALF Kontakt aufnehmen k&ouml;nnen, finden Sie
in der HTML-Ausgabe.</P>

<HR WIDTH="50%">

<P>Die Redakteure sind untereinander mit einer Mailingliste verbunden.
Warum aber nicht auch in dieser Form Kontakt zum Leser und Amiga-User
schaffen? Da spricht eigentlich nichts dagegen, daher haben wir eine
solche Mailingliste eingerichtet!</P>

<P>Das <A HREF="../infml2.htm">AmZeiger-InfoNetz</A> stellt den direkten Kontakt zwischen Redakteuren
und Lesern, sowie zwischen letzteren nat&uuml;rlich auch untereinander, her.
Wer mehr Einflu&szlig; auf die Gestaltung des AmZeigers nehmen, Erfahrungen
und Probleme besprechen m&ouml;chte, der ist hier gut aufgehoben.</P>

<P>(Da wir sonst immer die Abonnement-M&ouml;glichkeit als Mailingliste
bezeichneten, &auml;ndern wir jetzt den Sprachgebrauch in <A HREF="">Abo-ML</A>.)</P>

<HR WIDTH="50%">

<P>Der Kontakt mit unserer <A HREF="../bbs.htm">Supportbox CCS</A> in Seeshaupt ist wieder hergestellt.
Man kann uns wie immer von dort bequem beziehen.</P>

<HR WIDTH="50%">

<P>Wieder gibt es einige Mitglieder der <A HREF="../ml.htm">Abo-Mailingliste</a>, deren eMail-Adressen
nicht mehr korrekt sind. Nachfolgend sind sie aufgef&uuml;hrt. Wenn jemand also
doch mitliest und sich entdeckt: Bitte melden!</P>

<P>Hier die Adressen:</P>

L.A.L.O.@zr.onlinde.de<br>
hardy@airline.fido.de<br>
frank.bischof@herten.netsurf.de<br>
MICHI@HIGHVOLT.GUN.DE<br>
Sogol@ibm.net<br>
GrafikArtStudio@t-online.de<br>
101.1650@germanynet.de<br>
Empty@PEOPLE-X.PROMETHEUS.DE<br>
Heinz@lava.east.de<br>


<H2><B>Hinweise zu dieser Ausgabe #8</B></H2>

<P>Eine ganze Menge k&ouml;nnte ich diesmal wieder empfehlen. So will ich mich
aber doch auf die Erw&auml;hnung ein paar speziellerer Dinge beschr&auml;nken:</P>

<P>Da w&auml;re der neue, umfangreiche <a href="../pd/9903box.htm">PD-Bereich</a>, dann ein Artikel, der sich
eingehend mit <a href="../amz0399/derindex.htm">Indizierungen</a> von Computerspielen auseinandersetzt, ein
Ratgeber zur <a href="../kw/9903prov.htm">Providerwahl</a> und ein neu begonnener Grundlagenkurs zum
Thema <a href="../kw/9903nw.htm">Netzwerke</a> auf dem Amiga.</P>

<P><B>Bemerkung zur HTML-Ausgabe:</B></P>

<P>Wie sicher schon bemerkt, haben wir die <B>Mainseite umgestaltet</B>, von der aus
auch alle alten Ausgaben zu erreichen sind. Durch die Anzahl der Ausgaben,
die sich ja erfreulicherweise immer mehr erh&ouml;ht, sowie einiger weiterer
Links, war das alte Design den Erfordernissen nicht mehr ganz entsprechend.</P>

<HR WIDTH="50%">

<P>Das <B>Artikelverzeichnis</B> ist jetzt auf einzelne Seiten, den Rubriken
entsprechend, aufgesplittet. Neben einer gr&ouml;&szlig;eren &Uuml;bersichtlichkeit,
verringern sich die Ladezeiten.</P>

<P>Mehrere Bereiche und einige weitere Eintr&auml;ge aus &auml;lteren Ausgaben
sind hinzugekommen, so da&szlig; von hier aus nun auch z.B. Interviews
und Messeberichte eingesehen werden k&ouml;nnen.</P>

<HR WIDTH="50%">

<P>Ab der zweiten Ausgabe haben wir ein neues Benennungsformat f&uuml;r die HTML-
Seiten eingef&uuml;hrt. Die geplante Anpassung der ersten Ausgabe erfolgte nur
teilweise, so da&szlig; ein paar <B>Altlasten</B> blieben. So konnten ein paar Artikel
der ersten Ausgabe nicht vom Artikelverzeichnis erreicht werden.</P>

<P>Dies ist mit der Installation dieser Ausgabe behoben. Einige weitere
kleinere Fehler wurden ausgemerzt und Verbesserungen, wie die Einbindung
des AmZeigerchens in die Bewertungsk&auml;sten, durchgef&uuml;hrt. Die Bewertungen
sind nun also in allen Ausgaben einheitlich.</P>

<HR WIDTH="50%">

<P>Die <B>Awards-Seite</B>, auf der alle bisher ausgezeichneten Produkte verzeichnet
sind, ist nun in dieser Ausgabe enthalten.</P>


<H2><B>Hinweise zur letzten Ausgabe #7</B></H2>

<P>Ein <A HREF="postsack.htm">Leser</A> hat uns darauf aufmerksam gemacht, da&szlig; sich in den Test von
<B>DOpus Magellan II</B> ein kleiner Schreibfehler hineingemogelt hat. Es wird
im Fazit von einer Differenz von 30,- DM zwischen Update und Vollversion
gesprochen - in Wirklichkeit betr&auml;gt sie aber nur 20,- DM!</P>

<HR WIDTH="50%">

<P>Der Link im Editorial zur <B>Rechtschreibreform-Seite</B> im Internet war
leider nicht v&ouml;llig korrekt. Das &quot;l&quot; von &quot;.html&quot; war ein &quot;l&quot; zuviel!
Der korrekte Link lautet also:</P>

<P><A HREF="http://home.t-online.de/home/j.langhans/reform.htm">http://home.t-online.de/home/j.langhans/reform.htm</A></P>

<HR WIDTH="50%">

<P><B>Nachtr&auml;ge zur - HTML-Ausgabe:</B></P>

<P>Die <B>Awards-Seite</B> hat es wieder, wie an dieser Stelle in der letzten
Ausgabe vermutet, nicht in die Ausgabe geschafft gehabt. Wurde aber
online kurzfristig nachgeliefert und ist jetzt nat&uuml;rlich mit dabei.</P>

<HR WIDTH="50%">

<P>Hineingeschafft hatte es versehentlich nur eine fr&uuml;he <B>Betaversion</B> mit
dem Namen award.htm (statt awards.htm). Deren Gr&ouml;&szlig;e ist mit der aktuellen
Ausgabe dann auf Null gesetzt</P>.

<HR WIDTH="50%">

<P>Ein paar weitere <B>Kleinigkeiten</B> sind im Nachhinein aufgefallen und nun
behoben: im Inhaltsverzeichnis stand &quot;Titenstrahler&quot; statt &quot;Tintenstrahler&quot;
und <a href="../splink.htm">Spiderman`s Linkssammlung</a> hatte kein Hintergrundmuster. </P>

<P>Der oben angesprochene Link zur Rechtschreibreform-Seite wies auch in
der Linksammlung den beschriebenen Fehler auf.</P>


<H2><B>Hinweise zur n&auml;chsten Ausgabe #9</B></H2>

<P>Wie immer ist es <B>schwierig</B> zu sagen, was genau kommen wird, bis auf die
Fortsetzungen zu den jeweiligen Kursteilen.</P>

<P>Aber <B>wann</B> der AmZeiger erscheint, kann ich absch&auml;tzen: das wird
voraussichtlich Ende Juni/Anfang Juli sein.</P>

<P>Mit <B>W&uuml;nschen, Hinweisen</B> oder sogar eigenen Artikeln, einfach <A HREF="../kontakt.htm">hier</a> melden!</P>
            

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="pdnews.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="derindex.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


