<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Interview: Petra Struck</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Interview</U></H1><P ALIGN="CENTER">mit<BR><b>Petra Struck</b></P>

<P>Zu DER deutschsprachigen Quelle f&uuml;r Amiga-News im Intenet hat sich
die ehemalige &quot;<B>Amiga-Tagesschau</B>&quot; (nun <a href="web_adv.htm#anews">Amiga-News.de</a>) entwickelt,
die auch spielend dem internationalen Vergleich standh&auml;lt.</P>

<P>Zu den Beweggr&uuml;nden, den Planungen und einigem mehr befragte ich
Petra Struck, die diesen Service betreibt.</P>

<P>
AmZ: Gregor Franz<BR>
PSt: Petra Struck</P>

<HR WIDTH="50%">
<P>
<TABLE BORDER="1">
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Hallo Petra! Du betreibst eine der aktuellsten Newsquellen f&uuml;r den
     Amiga im Internet. Seit wann machst Du das und was hat Dich zur
     Einrichtung der &quot;Amiga-News&quot; bewogen?
	</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ich bin schon lange viel im Netz &quot;unterwegs&quot; und habe dadurch einen
     guten &Uuml;berblick, wo ich welche Neuigkeiten finden kann. Dabei ist
     mir irgendwann aufgefallen, da&szlig; es zwar viele sehr gute internationale
     News-Dienste gibt, aber keinen in deutscher Sprache.</P>

     <P>Im August 98 hatte ich dann die Idee, einen Newsdienst in deutscher
     Sprache aufzubauen, und da ich ein spontaner Mensch bin, habe ich
     diesen Einfall gleich umgesetzt und einfach angefangen.</P>
    </TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Man kann wirklich sagen, da&szlig; die Updates auf Deiner Site fast t&auml;glich
     erfolgen. Wieviel Zeit wendest Du daf&uuml;r auf, erh&auml;ltst Du auch gen&uuml;gend
     Anerkennung? :)
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Die Updates erfolgen in der Tat t&auml;glich. Am Anfang war ich t&auml;glich
     sage und schreibe 4 - 5 Stunden mit den News besch&auml;ftigt, aber
     mittlerweile habe ich Routine, und schaffe es in ca. zwei Stunden.</P>

     <P>Und ja, ich bekomme sehr viel positive Mail und das G&auml;stebuch ist
     auch voller Lob :-).</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Du hast gro&szlig;en Erfolg mit Deinem Projekt, viele 'Insider' wenden sich
     direkt an Dich, wenn es Neues zu vermelden gibt. Mit Martin Baute hast
     Du noch einen Mitstreiter gewonnen, der die Amiga-News ins Englische
     und ausgew&auml;hlte Beitr&auml;ge auch vom Englischen ins Deutsche &uuml;bersetzt.</P>

     <P>Wie kam es zu der Zusammenarbeit?</P>
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ich staune jeden Tag aufs Neue &uuml;ber die Zugriffszahlen. Das haut mich
     absolut um. Ich habe mir zwar vorgestellt, da&szlig; sich einige Leute &uuml;ber
     so einen Amiga-News-Dienst freuen, aber da&szlig; es so viele sein w&uuml;rden,
     h&auml;tte ich mir in meinen k&uuml;hnsten Tr&auml;umen nicht ausgemalt :-).</P>

     <P>Mittlerweile bekomme ich viele Informationen per eMail, ich habe
     aufschlu&szlig;reiche Gespr&auml;che mit &quot;Insidern&quot; gef&uuml;hrt, die mir so manchen
     Zusammenhang klarmachten. Trotzdem w&uuml;rde ich mir nat&uuml;rlich w&uuml;nschen,
     da&szlig; noch mehr Programmierer mir mitteilten, wenn es Updates gibt. Das
     Abklappern der Webseiten ist sehr zeitaufwendig und nat&uuml;rlich auch
     kostentr&auml;chtig.</P>

     <P>Martin hat mich im Februar angesprochen und wir haben &uuml;berlegt, wie
     wir eine Zusammenarbeit gestalten k&ouml;nnen. In Martin habe ich einen
     Partner bekommen, der die News nochmals attraktiver macht, da er zum
     einen meine recherchierten News zum gr&ouml;&szlig;ten Teil ins Englische
     &uuml;bersetzt und damit auch den internationalen Lesern zur Verf&uuml;gung
     stellt, und mir zum anderen hilft, engl. Texte ins Deutsche zu
     &uuml;bersetzen. Mein Englisch ist sehr bescheiden, ich verstehe zwar
     meistens, um was es geht, aber das war es auch schon.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Nach dem Wechsel auf die leicht zu merkende Domain, gab es eine Menge
     anderer Erweiterungen. Sind noch mehr Ver&auml;nderungen zu erwarten?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ja, z.B. ist Martina Jacobs gerade damit besch&auml;ftigt, die kompletten
     News in Untergruppen (Software, Hardware, PPC, Interviews usw. und
     so fort) zu archivieren, was eine Wahnsinnsarbeit ist, da ich bis
     jetzt ohne jede Datenbank auskommen mu&szlig;. Es kann also noch eine Weile
     dauern, bis diese Sisyphus-Arbeit online gehen kann.</P>

     <P>Jedenfalls wird es dann viel einfacher sein, alte News wiederzufinden.
     Zur Zeit kann man &auml;ltere News &uuml;ber eine interne Suchmaschine
     wiederfinden. Bestimmt werden nach und nach noch andere Ideen in
     die Website einflie&szlig;en, die aber jetzt noch nicht spruchreif sind.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Wie bist Du zum `Computern` gekommen und schlie&szlig;lich zum Amiga?
     Hast Du auch andere Rechner vorher verwendet?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Nicht schlie&szlig;lich Amiga, gleich Amiga :-).</P>

     <P>Meinen ersten Amiga, einen 500er habe ich 1993 gekauft, bin also ein
     sp&auml;ter Einsteiger. Der Grund war simpel: Einige Freunde hatten eben
     diesen Amiga und ich wollte endlich auch zuhause Adventures spielen,
     was ich die n&auml;chsten zwei Jahre auch ausgiebig machte. Erst danach
     kam die erste Festplatte und damit das Interesse an der Workbench
     und dem AmigaOS. Nat&uuml;rlich folgte kurze Zeit sp&auml;ter ein A1200 und
     mit ihm begann 1996 meine &quot;Online-Zeit&quot;. Inzwischen bin ich mit
     einem gut ausgestatteten A4000 &quot;unterwegs&quot;.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Sind die Amiga-News Dein erstes 'Computer-Projekt' oder gab es da
     schon anderes vorher?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD>Nein, andere Projekte im eigentlichen Sinne habe ich nicht gemacht.
     Ich bin seit 1997 Webmaster des Amiga-Clubs im BTX und Internet,
     pflege dort (mittlerweile nicht mehr alleine) die Webseiten.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Seit Jahren gibt es ein Hickhack um die Weiterentwicklung des Amiga.
     Einerseits darum, ob es &uuml;berhaupt eine geben wird, andererseits, &uuml;ber
     die Richtung, die sie nehmen soll.</P>

     <P>Was versprichst Du Dir von den Ank&uuml;ndigungen zum NG-Amiga? Ist die
     Strategie richtig, oder werden die letzten loyalen User dann vollends
     im Regen stehen?</P></TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Im Gegensatz zu vielen anderen bin ich der Meinung, da&szlig; die Richtung,
     einen komplett neuen &quot;Amiga&quot; zu entwickeln, richtig ist, auch wenn es
     seine Zeit braucht. Immer wieder abw&auml;rtskompatibel weiterzuentwickeln
     kann nicht gut sein. Lieber einen harten Break und ein v&ouml;llig neues
     Konzept. Nur so kann man neue User dazu bewegen, sich einen Amiga zu
     kaufen. Ich bin jedenfalls die erste, die sich den neuen &quot;Amiga&quot;
     kauft.</P>

     <P>Au&szlig;erdem scheint das &quot;Hickhack&quot; zwischen Amiga Inc. und Amiga
     International ein Ende gefunden zu haben, es wird Einigkeit
     signalisiert. Mit Jim Collas ist ein kompetenter Manager in die
     Runde gekommen, der daf&uuml;r bekannt ist, da&szlig; er die Dinge vorantreibt.
     Wenn AMIGA (so hei&szlig;t die Firma ja jetzt) es nun noch versteht,
     Kontakt zu den Entwicklern zu suchen, zu pflegen, und sie zu
     unterst&uuml;tzen, sollte es aufw&auml;rts gehen.</P>

     <P>Mit dem Upgrade AmigaOS 3.5 werden auch die Amiga-Classic-User nicht
     im Regen stehen, obgleich ich es &auml;rgerlich finde, da&szlig; so gute Features
     wie ARTAS gestrichen wurden.</P>

     <P>[Bei ARTAS handelt es sich um ein neues Soundtreiberkonzept, das
      die Einbindung von Soundkarten in das AmigaOS erm&ouml;glicht, d.Red.]</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Auch um die Entwicklung des OS 3.5 gab es ja einige Querelen (wir
     berichteten). Meinst Du, es wird ein voller Erfolg oder k&ouml;nnte es
     sich in der Form nicht eher um eine Mogelpackung handeln?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Nein, eine Mogelpackung wird das nicht, wenn auch b&ouml;se Zungen
     behaupten k&ouml;nnten, da&szlig; es viele der &quot;neuen&quot; Features als Third-
     Party-Produkte sowieso schon gibt.</P>

     <P>Meiner Meinung nach ist dieses Update dennoch sehr wichtig, denn es
     merzt viele Fehler aus, zwingt einen Neueinsteiger nicht mehr, sich
     jede Menge Tools und Utilities m&uuml;hsam zusammensuchen zu m&uuml;ssen und
     letztendlich hat es auch Signalwirkung: Es passiert etwas!</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Du hast Dich auf Deiner Homepage auch f&uuml;r die Anti-Spam-Aktion stark
     gemacht. Bist Du selbst stark betroffen? Wie siehst Du die Entwicklung
     des Internet - werden solche Ausw&uuml;chse &uuml;berhand nehmen, braucht es
     bessere Regelungen oder Sicherheitsmechanismen?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P> Bei mir pers&ouml;nlich h&auml;lt es sich in Grenzen, aber es wird immer mehr.
     Ich bin f&uuml;r ein generelles Verbot von ungebetener eMail-Werbung, da
     sie mein Geld kostet. Ich m&ouml;chte selbst bestimmen k&ouml;nnen, von wem
     ich Werbung bekomme.</P>

     <P>Da das Internet im Grunde genommen erst in den Kinderschuhen steckt,
     bef&uuml;rchte ich, wenn jetzt nichts gegen Spammer unternommen wird, da&szlig;
     es in absehbarer Zeit Ausw&uuml;chse annehmen wird. Daher brauchen wir
     klare Regelungen, alleine schon, um im Ernstfall etwas gegen Spammer
     unternehmen zu k&ouml;nnen.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Manche Zukunftsforscher meinen, da&szlig; angeblich mittelfristig das
     gesamte gewohnte Leben durch das Internet umgekrempelt wird. Eink&auml;ufe
     w&uuml;rden haupts&auml;chlich dar&uuml;ber abgewickelt werden, Kommunikation und
     Information vorwiegend &uuml;ber dieses Medium laufen. Bist Du da positiv
     oder negativ zu eingestellt oder eher skeptisch, ob das &uuml;berhaupt in
     dieser prophezeiten Form eintrifft?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD>Absolut positiv, warum sollten wir den Fortschritt aufhalten? Ich
     vermute tats&auml;chlich, da&szlig; in absehbarer Zeit ann&auml;hernd jeder Haushalt
     &quot;online&quot; sein wird, so wie mittlerweile fast jeder Haushalt &uuml;ber ein
     Telefon verf&uuml;gt.
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Was machst Du eigentlich am liebsten mit Deinem Amiga, neben den
     Amiga-News nat&uuml;rlich? Welche Hard- und Software benutzt Du vorrangig?
     Spielst Du auch mal gerne und wenn ja, was besonders? (Fragen &uuml;ber
     Fragen :)
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ich fange mal hinten an, ich spiele nach wie vor sehr gerne. Zur Zeit
     ist Foundation mein Favorit und zwischendurch spiele ich sehr gerne
     DiamondCaves2. Au&szlig;erdem spiele ich leidenschaftlich gerne jede Art
     von Adventurespielen.</P>

     <P>Meine Hardware ist schnell aufgez&auml;hlt: A4000 im RBM-Tower mit ZorroIII,
     CyberSCSI, Cyberstorm 68060, PicassoIV, 64 MB FastRAM, CD-ROM und
     einen 17&quot;-Monitor.</P>

     <P>Software, die ich t&auml;glich nutze: RO, GoldED, Miami, YAM, MicroDot II,
     AWeb, MFTP, ADM, MagicMenu, MUI, NewIcons, GlowIcons ...., nein
     lassen wir das, die Liste ist unendlich lang. Gerade gestern ist
     ArtEffect 3.0 angekommen, was mich wohl die n&auml;chsten Tage besch&auml;ftigen
     wird, da ich von Bildbearbeitung noch keinen Plan habe.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Zu Dir selbst: Wie alt bist Du (falls die Frage gestattet ist), was
     machst Du beruflich und vor allen Dingen, was f&uuml;r Hobbys hast Du
     sonst so?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ich bin 42, hauptberuflich Mutter und Hausfrau (woher sonst sollte
     ich die ganze Zeit haben ;-)) und au&szlig;erdem bin ich eine Leseratte.</P>

     <P>Ich bin viel mit Freunden zusammen und wenn dann noch Zeit bleibt,
     besch&auml;ftige ich mich mit dem Entwerfen von ausgefallener Mode, die
     eine Freundin dann n&auml;ht.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Welches Genre in Bezug auf B&uuml;cher bevorzugst Du denn? Hat Dir in
     letzter Zeit ein Buch besonders gut gefallen, so da&szlig; Du es vielleicht
     empfehlen kannst? Und tr&auml;gst Du Deine Mode dann auch selbst? :)
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Ja, nat&uuml;rlich trage ich die Sachen selbst, die sehen klasse aus :).</P>

     <P>Leseratten haben die Angewohnheit, alles zu lesen, was ihnen zwischen
     die Finger kommt; mit anderen Worten: ich kann nicht sagen, ich lese
     gerne Krimis oder Biographien. Ich lese B&uuml;cher aus v&ouml;llig
     unterschiedlichen Bereichen.</P>

     <P>Hier mal die letzten vier Titel, die ich gelesen habe:</P>
     <UL>
     <LI>&quot;Sofies Welt&quot; von Jostein Gaardner</LI>
     <LI>&quot;Der Graf von Monte Cristo&quot; von Alexandre Dumas (las ich schon zum zweiten Mal)
     </LI><LI>&quot;Killer Web Sites&quot; von David Siegel
     </LI><LI>&quot;Per Anhalter durch die Galaxis&quot; von Douglas Adams.
     </LI></UL>

     <P>Zur Zeit liegt &quot;Der Unterh&auml;ndler&quot; von Frederick Forsyth neben meinem
     Kopfkissen. In meinem B&uuml;cherregal befinden sich ca. 800 B&uuml;cher, wovon
     ich mindestens 90% gelesen habe.</P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Da ich die Antwort auf die abschlie&szlig;ende Standardfrage schon kenne
     (der AmZeiger war Dir nat&uuml;rlich vorher schon bekannt), variiere ich
     einfach mal: Hast Du das Gef&uuml;hl, da&szlig; es in Deutschland wieder einen
     Ruck nach vorne gibt/aufw&auml;rts geht?
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD><P>Eine Antwort auf die Standardfrage w&auml;re mir leichter gefallen,
     denn AmZeiger war mir, wie Du aus meiner Hotlist unschwer erkennen
     kannst, vorher bekannt ;-).</P>

     <P>Ich verstehe die zweite Frage nicht eindeutig, meinst Du politisch
     oder wirtschaftlich? Spielst Du auf den R&uuml;cktritt von Oskar
     Lafontaine an? </P>
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD><P>Der ist mir jetzt so dazwischengekommen. Eine ziemliche &Uuml;berraschung.</P>

     <P>Nein, ich meine eher auf etwas l&auml;ngere Sicht gesehen, nach dem
     Politikwechsel. Politik und Wirtschaft h&auml;ngen in der Frage der
     Tendenz f&uuml;r Deutschland ja sehr eng zusammen. Die Frage war also
     eher allgemein gemeint.</P>
</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD>Na, dann will ich die Frage auch allgemein beantworten. Nein, ich
     habe nicht das Gef&uuml;hl, da&szlig; es in Deutschland wieder einen Ruck nach
     vorne gibt. Ich habe andererseits aber auch nicht das Gef&uuml;hl, da&szlig; es
     r&uuml;ckw&auml;rts geht ;).
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Danke f&uuml;r das Interview!</TD>
</TR>
<TR BGCOLOR="#DADADA">
    <TH>PSt:</TH>
    <TD>Ich danke Dir f&uuml;r Dein Interesse, hat Spa&szlig; gemacht :-). Werde ich
     jetzt ber&uuml;hmt?
</TD>
</TR>
<TR BGCOLOR="#FFFFFF">
    <TH>AmZ:</TH>
    <TD>Klar - alle die wir bis jetzt interviewt haben, sind in gewissen
     Kreisen ber&uuml;hmt geworden! Oder waren sie es vielleicht schon? ;)
</TD>
</TR>
</TABLE>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="web_adv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../sw/9903dbp.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
