<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - AmPuls</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U><A NAME="Top">Am Puls - Kurzmeldungen:</A></U></H1><P ALIGN="CENTER">
<A HREF="#Software">Software</A> / <A HREF="#Hardware">Hardware</A> / <A HREF="#Spiele">Spiele</A> / <A HREF="#Sonstiges">Sonstiges</A><br>
Weitere News: <a href="pdnews.htm">PD-News-Box</a></p>

<H2 ALIGN="CENTER">Amiga-Allgemein</H2>

<P>Ende Februar wurden <B>neue Weichen bei Amiga bzw. Gateway</B> gestellt.</P>

<P>Das neue Hauptquartier wird von South Dakota nach San Diego verlegt und
mit Jim Collas, vordem Senior Vice President f&uuml;r Produktentwicklung und
Management bei Gateway, hat Amiga nun auch einen neuen Chef, der der
F&uuml;hrungsetage des Mutterkonzerns entstammt.</P>

<P>Amiga soll, als unabh&auml;ngige Tochter von Gateway, seinerseits Amiga Inc.
und Amiga International als separate Einheiten unter seinem Dach bergen.
Eine Software-Entwicklungsabteilung in San Jose soll auf- und ausgebaut
werden, schnelle Ergebnisse werden angestrebt. Aussagen, die nach der
ersten Pressemitteilung gefallen sind, sprechen davon, da&szlig; das erste
<B>AmigaNG</B>-System das Entwicklersystem sein soll, das zweite ein Multimedia-
Computer, der zum Preis von 500 US-Dollar die Leistung einer 3000-Dollar-
Maschine bieten w&uuml;rde, was einen Gesamtabsatz von 20-30 Millionen
Ger&auml;ten erm&ouml;glichen solle.</P>

<P>Name des neuen Amiga-OS soll <B>AmigaSoft</B> sein. Die erste AmigaSoft 4.0-
Version f&uuml;r Entwickler ist f&uuml;r September geplant, die endg&uuml;ltige f&uuml;r Ende
des Jahres und AmigaSoft 5.0 soll schlie&szlig;lich im zweiten Quartal 2000
erscheinen. </P>

<P>L&auml;nder, in denen der Amiga traditionell am st&auml;rksten vertreten ist, also
Gro&szlig;britannien, Deutschland und die USA, sollen den Schwerpunkt der
Aktivit&auml;ten bilden, zu denen auch eine gro&szlig; angelegte Marketingkampagne
geh&ouml;ren soll.</P>

<P>Jeff Schindler ist verantwortlich f&uuml;r die Produktstrategie, Petro
Tyschtschenko bleibt weiterhin Pr&auml;sident von Amiga International.</P>

<P>Die Inhalte der beiden Websites sind nun neuerdings identisch.</P>

<A HREF="http://www.amiga.com">http://www.amiga.com</A><BR>
<A HREF="http://www.amiga.de">http://www.amiga.de</A>

<HR WIDTH="50%">

<P><B>AmigaOS 3.5</B> wird nun doch Wirklichkeit. Tats&auml;chlich wurde
<A HREF="http://www.haage-partner.com">Haage&amp;Partner</A>
federf&uuml;hrend mit der Entwicklung betraut. Neben neuem Icon-Design (doch
GlowIcons) und neuem Icon-Handling, gibt es neue BOOPSI-Gadgets, die in
vielen &uuml;berarbeiten Einstellern zum Einsatz kommen, ein neues
Druckertreibersystem, das auf Turboprint basieren soll, sowie einen
TCP/IP-Client, einen Browser und ein einfaches eMail-Programm.</P>

<P>PPC-Prozessoren werden durch Integration von H&amp;P`s WarpUp-System
unterst&uuml;tzt. Festplatten gr&ouml;&szlig;er 4 GByte k&ouml;nnen verwendet werden, CD-
Treiber sind eingebaut und eine neue HTML-Dokumentation wird mitgeliefert.</P>

<P>Eine Integration von hardwareunabh&auml;ngigen Grafik- und Soundkarten-
Treibersystemen wird nicht zum Lieferumfang geh&ouml;ren. </P>

<P>Der Preis soll 99,50 DM betragen. Bei H&amp;P scheinen vorsichtige Planungen
bereits auf m&ouml;gliche weitere OS-Versionen f&uuml;r bestehende Amigas
abzuzielen.</P>

<A HREF="http://www.amiga.de">http://www.amiga.de</A>

<HR WIDTH="50%">

<P>Von der Praxis des bisherigen Gesch&auml;ftsgebahrens von Amiga, inklusive
nicht eingehaltener Vereinbarungen, entt&auml;uscht, hat <A HREF="http://www.act-net.com/">A.C.T.</A>
angek&uuml;ndigt, OS 3.5 mit keinem seiner gegenw&auml;rtigen und zuk&uuml;nftigen Produkte (inklusive
ARTAS) zu unterst&uuml;tzen, wenn nicht verbindliche Lizenzvereinbarungen
abgeschlossen werden.</P>


<HR WIDTH="100%">
<A NAME="Hardware"><H2 ALIGN=CENTER>Hardware</H2></A>

<P><A HREF="http://www.phase5.de">Phase5</A> hat vor, eine neue Generation von Beschleunigerkarten zu entwickeln.
Die Bezeichnung des Projektes, das nur durch 1.000 Vorbestellungen
angeschoben wird, dann aber sehr schnell bereits nach vier Monaten an die
Kunden ausgeliefert werden soll (da viele Teilentwicklungen schon fertig
in der Schublade l&auml;gen), lautet <B>Cyberstorm G3/G4</B>.</P>

<P>Diese Karten sollen im CPU-Slot des A3000 und 4000 (und kompatibel)
betrieben werden, einen der neuen G3/G4-PowerPC-Prozessoren und 100 MHz-
SDRAMs (2 DIMM-Sockel, bis 1 GByte RAM), aber keinen 680XX-Prozessor
verwenden und ein 512 KB-FlashROM, sowie ein PCI 2.1-Interface enthalten,
das Drittherstellern diverse Erweiterungen erlauben soll.</P>

<P>Eigene Entwicklungen daf&uuml;r, sowie spezielle Softwareunterst&uuml;tzung, sind
nicht geplant, Fremdherstellern wird aber jede Unterst&uuml;tzung zuteil.
Au&szlig;erdem sei durch Amiga &amp; H&amp;P die Softwareplattform gesichert.</P>

<P>Die Vorbesteller m&uuml;ssen eine Vorauszahlung von 250,- DM auf ein
Notarkonto leisten, die, sollte es bis zu einem festgelegten Zeitpunkt
keine Auslieferung geben, zur&uuml;ckgezahlt wird oder andernfalls erst bei
Auslieferung an Phase5 geht.</P>

<P>Der Preis inklusive G3 CPU-Modul mit PPC 750 (400 MHz) und 1 MByte
Backside-Cache mit 200 MHz soll inkl. Umsatzsteuer 2.299,- DM betragen.
Preissenkungen einzelner Komponenten werden an den Kunden weitergegeben.
Vorbesteller erhalten einen Nachla&szlig; und m&uuml;ssen 2.030,- DM zahlen,
Preissenkungen werden auf diesen Sonderpreis ebenso weitergegeben.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.villagetronic.com">VillageTronic</A> hat nach einer Umfrage entschieden, eine <B>3DFX-AddOn-Karte</B>
f&uuml;r seine PicassoIV-Grafikkarte zu entwickeln. Voraussetzung zum Betrieb
wird die PicassoIV und ein mit Zorro-III ausgestatteter Amiga sein. Der
Preis mit 8 MByte Speicher soll 299,- DM betragen.</P>

<HR WIDTH="50%">

<P>Mit <B>Netax 1200</B> bietet <A HREF="http://www.haage-partner.com">Haage&amp;Partner</A> eine
PCMCIA-Netzwerkarte des Ethernet-
Standards f&uuml;r den Amiga 600 und 1200 an, die mit SANA-II-Treibern
ausgestattet ist. Sie ist mit den g&auml;ngigen TCP/IP-Stacks und -Anwendungen
kompatibel. F&uuml;r gute Leistungen wird ein 68030-Prozessor empfohlen. Der
Preis betr&auml;gt 198,- DM.</P>

<HR WIDTH="50%">

<P>Die Produkte des franz&ouml;sichen Herstellers <A HREF="http://ateo-concepts.com">Ateo Concepts</A> werden jetzt in
Deutschland vom <A HREF="http://www.seidel-online.de">Software-Service Seidel</A> vertrieben. Zu den Ateo-Produkten
z&auml;hlt die Grafikkarte Pixel 64 f&uuml;r den Amiga 1200, die einen
Erweiterungsport besitzt, der neuerdings u.a. mit einer Ethernet-
Netzwerkkarte ausgestattet werden kann. An einer Voodoo-3D-Erweiterung,
sowie einer Pixel64-Version f&uuml;r Zorro-III-Amigas wird gearbeitet.</P>

<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Software">Software</A></H2>

<P><B>Holger Kruse</B> nimmt die Entwicklung eines <B>JAVA 2-Runtime-Systems</B> jetzt
selbst in die Hand und will mit <B>Daytona</B> eine 100 prozentig kompatible
Implementation kostenlos auf den Markt bringen.</P>

<P>Das Entwickler-Paket DaytonaDEV wird ebenfalls kostenlos erh&auml;ltlich sein,
nur DaytonaLPLUS mit einer erweiterten Anpassung an Amiga-Erfordernisse
wird als Shareware ver&ouml;ffentlicht.</P>

<A HREF="http://www.nordicglobal.com">http://www.nordicglobal.com/</A>

<HR WIDTH="50%">

<P>Das n&auml;chste Update der Software <A HREF="http://www.oberland.com/amiga/wildfire/">Wildfire 7\PPC</A> wird unter anderem eine
MovieShop-Anbindung besitzen. Au&szlig;erdem gibt es leichter zu verstehende
Transition-Maker, die Previews im nichtlinearen Modus sind nun abschaltbar,
die Online-Hilfe wurde verbessert, uvm..</P>
<HR WIDTH="50%">
<P>Mit <B>Genesis</B> bringt <A HREF="http://www.active-net.co.uk">Active Technologies</A>
einen Nachfolger f&uuml;r AmiTCP heraus,
der neben der bekannterma&szlig;en hohen und weiterentwickelten Leistung auch
eine verbesserte Benutzeroberfl&auml;che und vor allen Dingen einfachere
Einrichtung erm&ouml;glicht. MUI ab Version 3.8 ist Voraussetzung.</P>

<A HREF="http://www.vapor.com">http://www.vapor.com</A>

<HR WIDTH="50%">

<P>Eine &uuml;berarbeitet Version des <B>Steuerprofi 98</B> bietet <A HREF="http://www.schatztruhe.de">Schatztruhe</A> auf CD
an. Sie enth&auml;lt neben Gesetzestexten zum Nachschlagen auch Scans der
&uuml;blichen Formulare und das Programm Haushaltsbuch V3.0 zur Verwaltung
der privaten Ein- und Ausgaben. Der Preis betr&auml;gt 99,- DM neu und 49,-
DM f&uuml;r das Update.</P>

<HR WIDTH="25%">

<P><B>Electronic Teacher 5</B> ist ein Programm zum Erlernen der englischen Sprache.
Bei Vokabeln, Grammatik, Rechtschreibung und der Ausprache wird
Hilfestellung geboten, inkl. Sprachausgabe. Grafikkarten werden
unterst&uuml;tzt, OS 2.04 und CD-Laufwerk sind Voraussetzung. Der Preis
betr&auml;gt 119,- DM.</P>

<HR WIDTH="50%">

<P>Mit <B>Warp3D</B> hat <A HREF="http://www.haage-partner.com">Haage&amp;Partner</A> ein hardwareunabh&auml;ngiges Treibersystem f&uuml;r
3D-Grafikhardware entwickelt. Zusammen mit StormMESA, einer MesaGL-
Portierung, soll eine neue Leistungssteigerung und einfache Unterst&uuml;tzung
der Grafikkarten-Spezialchips auf dem Amiga erm&ouml;glicht werden. Seit dem
Erscheinen der Version 2 unterst&uuml;tzt Warp3D auch die Permedia-Prozessoren
der CyberVisionPPC und BVisionPPC-Karten. Der Download von der Homepage
ist kostenlos.</P>

<HR WIDTH="25%">

<P>F&uuml;r den Raytracer <B>Tornado</B> ist auf der Homepage ein kostenloses Update auf
die Version 2.1 erh&auml;ltlich.</P>

<HR WIDTH="50%">

<P>Die <A HREF="http://online.club.de/~ARENA/">Amiga-Arena</A> hat wieder Shareware zu Sonderpreisen zu bieten:</P>

<P>WHD-Load mit &uuml;ber 100 Installer f&uuml;r Spiele gibt es f&uuml;r 20,- DM. Die
Verwaltungssoftware MT-Rechnung III gibt es exklusiv f&uuml;r 12 Euro und
das Katalogisierprogramm CDCat 3 mit PPC-Support gibt es f&uuml;r 30 DM.</P>
<HR WIDTH="50%">
<P>Die Entwicklung des bekannten Web-Browsers <A HREF="http://www.operasoftware.com">Opera</A> f&uuml;r den Amiga liegt
im Moment auf Eis, da das ausf&uuml;hrende Entwicklerteam aufgegeben hat.
Gespr&auml;che mit anderen Programmierern laufen.</P>
<HR WIDTH="50%">
<P>Mit <A HREF="http://amozilla.force9.co.uk/">aMozilla</A> wird eine Amiga-Version
des <B>Netscape Communicator 5</B>, dessen
Sourcecodes freigegeben wurden, entwickelt. Laut den Ank&uuml;ndigungen soll
sie alle wesentlichen Eigenschaften bieten, so auch Javaskript- und Java-
Unterst&uuml;tzung und, wie es die Lizenzbestimmungen verlangen, kostenlos
erh&auml;ltlich werden. Ein gut ausgestatteter Amiga (ab 68030) wird
Voraussetzung sein.</P>
<HR WIDTH="50%">
<P><A HREF="http://www.cadtech.demon.co.uk">CAD-Technologies</A> &uuml;bernimmt den Vertrieb des Raytracers <B>Imagine</B> von Impulse,
au&szlig;er f&uuml;r Amerika und Japan. Ein spezieller Support-Bereich wird unter der
Site eingerichtet.</P>
<HR WIDTH="50%">
<P>Der <B>Sourcecode</B> der beliebten Amiga-Basicvariante <b>AMOS</b> ist freigegeben
worden. Er kann unter der folgenden Adresse heruntergeladen werden.</P>

<A HREF="http://www.clickteam.com/web/amos/amos.htm">http://www.clickteam.com/web/amos/amos.htm</a>
<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Spiele">Spiele</A></H2>

Von dem Mario3D nachempfundenen Jump`n`Run <A HREF="http://home.sol.no/~evunder/anutta/tfhdemo.html">Tales of Heaven</A> gibt es ein
Preview, das man sich herunterladen kann.

<HR WIDTH="50%">

<P><B>Haage&amp;Partner</B> haben auf ihrer Website ein kostenloses Shoot`Em`Up mit
Namen <A HREF="http://www.haage-partner.com/starbirds/">Starbirds</A> ver&ouml;ffentlicht.</P>

<HR WIDTH="50%">

<P>Das Spiel <B>Virtual Grand Prix</B> (vorher durch eine Demo als Alien F1 bekannt
geworden) scheint der Fertigstellung entgegenzugehen und eine Demo ist
erh&auml;ltlich, unter:</P>

<A HREF="http://www.grid9.net/~wobble/AF1new.lzx">http://www.grid9.net/~wobble/AF1new.lzx</A>

<HR WIDTH="50%">

<p><A HREF="http://www.clickboom.com">clickBOOM!</A> hat den Command&amp;Conquer-Klon <B>Napalm</B> nun herausgebracht.</p>

<HR WIDTH="25%">

<P>Das Shoot-Em-Up <B>T-Zero</B> (ex-TraumaZero) soll auch bei <A HREF="http://www.clickboom.com">clickBOOM!</A> erscheinen.</P>

<HR WIDTH="50%">

<P>Das aufwendig gestaltete Adventure <B>Gilbert Goodmate</B> soll jetzt im Sommer
99 erscheinen.</P>

<A HREF="http://www.crystal-software.com/">http://www.crystal-software.com</A>

<HR WIDTH="50%">

<P><B>Vulcan Software</B> hat die Einstellung jeglichen Amiga-Engagements
angek&uuml;ndigt.</P>

<HR WIDTH="25%">

<P>Hin und her gibt und gab es zu <B>Wasted Dreams</B>, da&szlig; zeitweise in Distant
Dreams umbenannt wurde, aber jetzt anscheinend doch den alten Namen
behalten soll. <A HREF="http://www.vulcan.co.uk">Vulcan</A>, die ja dem Amiga abgeschworen hat, trennte sich
von den Entwicklern, will aber nach letzten Meldungen nun wohl doch den
Vertrieb f&uuml;r das angeblich fast fertige Spiel &uuml;bernehmen.</P>

<HR WIDTH="50%">

<P><A HREF="http://www.titancomputer.de">Titan Computer</A> hat die Entwicklung der Titel Total Combustion und SOTTM 2
eingestellt. Als Grund wird die Raubkopiererei auf dem Amiga angegeben.</P>


<HR WIDTH="100%">
<H2 ALIGN="CENTER"><A NAME="Sonstiges">Sonstiges</A></H2>

<P>In Sachen <B>clickBOOM!</B> sind <B>Ger&uuml;chte</B> im Internet aufgetaucht. Ein
Programmierer aus Jugoslawien (wo auch der clickBOOM!-Chef &uuml;rspr&uuml;nglich
herstammt), sowie sp&auml;ter auch weitere Personen, behaupten, den
Einstandstitel `Capital Punishment` erstellt zu haben, ohne genannt zu
werden oder die entsprechende fianzielle Entsch&auml;digung erhalten zu haben.
Auch der Code von der Myst-Amigaversion soll zum gro&szlig;en Teil aus dieser
Quelle stammen, bevor clickBOOM! das Projekt selbst zu Ende f&uuml;hrte. </P>

<P>Verschiedene Indizien sprechen f&uuml;r die Behauptung, andere dagegen.
Nichts genaues wei&szlig; man nicht, bevor keine Seite entscheidende
Beweise pr&auml;sentiert.</P>

<P>Fakt ist jedenfalls, da&szlig; clickBOOM! sehr scharf reagiert hat. Sie haben
nicht nur angek&uuml;ndigt, gegen die Behauptungen gerichtlich vorgehen zu
wollen, sondern auch versucht, mit <B>Drohungen</B> verschiedene Newsquellen
im Internet, die &uuml;ber den Sachverhalt informierten bzw. die Vorw&uuml;rfe
ver&ouml;ffentlichten, mundtot zu machen.</P>

<P>Eine seltsame Art mit diesem Sachverhalt umzugehen, die sicher mehr
Staub aufgewirbelt hat, als n&ouml;tig.</P>

<HR WIDTH="50%">

<P>Die Amiga User Group Switzerland (AUGS) veranstaltet am 17. und 18.
April 99 das offizielle <B>AUGS-Meeting</B>.</P>

N&auml;here Informationen finden Sie auf einer separaten <A HREF="augs.htm">Seite</A>.

<P><CENTER><A HREF="#Top">Zur&uuml;ck zum Anfang</A></CENTER></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="about.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="pdnews.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

