<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Der alte Postsack</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN=CENTER><U>Der alte Postsack</U></H1>

<PRE>

   <B>&gt;&gt; Absender : <A HREF="mailto:C1.Schreiber@von.ulm.de">C1.Schreiber@von.ulm.de</A> (Christian Schreiber) &lt;&lt;</B>

C&gt; Hallo,
C&gt;
C&gt; ich wollte mir eigentlich die CD demn&auml;chst noch bestellen, aber jetzt
C&gt; wo ich das mit den kaputten Verzeichnissen gelesen habe, warte ich
C&gt; erst mal ab.
C&gt;
C&gt; Du schriebst von einem wahren Geheimnis, dem Eliza-Clon im DOpus-CLI,
C&gt; was ist das genau? Wo hast du davon erfahren?

Dieser Leserbrief bezieht sich auf den DOpus Magellan II-Test der
letzten Ausgabe. Er ging an die allgemeine AmZeiger-Adresse und
wurde dann auch an den Autor des Artikels, Andreas Schlick,
weitergeleitet.

Ich kenne nicht die Antwort auf diese Fragen, aber ich gehe davon
aus, da&szlig; Andreas sie pers&ouml;nlich beantwortet hat.

C&gt; BTW, du hast da einen Druckfehler: du schriebst, da&szlig; das Update
C&gt; aufgrund seiner geringen Preisdifferenz von *30,- DM* nicht
C&gt; empfehlenswert ist, unten schriebst du aber folgende Preise:
C&gt;
C&gt; Update: 69,- DM
C&gt; Vollversion: 89,- DM
C&gt;
C&gt; Also ich komme da auf 20,- DM Differenz (89 - 69 = 20).

Du hast Recht!!!

Noch schlechterer Gegenwert!

[Zitat aus dem Artikel]
AS&gt;
AS&gt; Das inzwischen die Tips & Tricks-Ecke als eigene CD vertrieben wird,
AS&gt; finde ich irgendwo traurig.

C&gt; Welche Tips & Tricks-Ecke (im Internet irgendwo - URL?)?

Ich meine, da&szlig; sich das wohl auf die zus&auml;tzlich von Schatztruhe
f&uuml;r 55,- DM vertriebene CD &quot;DOplus&quot; beziehen wird.

C&gt; BTW, ich las heute den AmZeiger zum ersten Mal und werde ihn bei mir

...und das sehr aufmerksam!

C&gt; offline linken, um ihn regelm&auml;&szlig;ig zu lesen.

Bleib so aufmerksam! :)

<HR>

        <B>&gt;&gt; Absender: Mario_Gr&uuml;nwald (<A HREF="mailto:grueni@IOS.ml.org">grueni@IOS.ml.org</A>) &lt;&lt;</B>

M&gt; Hallo
M&gt;
M&gt; Habe wieder einmal den AmZeiger gelesen, und obwohl ich nur kurz
M&gt; schauen wollte, ueber was Ihr so schreibt, haben mich einige Artikel
M&gt; so gefesselt, dass es 2 Stunden gedauert hat.

Das sch&ouml;nste Lob, was wir kriegen k&ouml;nnen!

M&gt; Besonders loben moechte ich das Ihr Geruechte nicht als Tatsachen
M&gt; hinstellt.

Das kommt gleich danach. ;)

M&gt; Ueber diese URL hat sich mein Browser nicht sehr gefreut:
M&gt; http://home.t-online.de/home/j.langhans/reform.html

Das ist wahr. Sehr &auml;rgerlich, denn lediglich das &quot;l&quot; bei &quot;.html&quot;
ist zuviel.

M&gt; Macht weiter so
M&gt;
M&gt; ciao Mario

Wenn wir solch motivierende Mail bekommen, m&uuml;ssen wir wohl. :)

<HR>

     <B>&gt;&gt; Absender: <A HREF="mailto:WSchnee@t-online.de">WSchnee@t-online.de</A> (Werner Schneemelcher &lt;&lt;)</B>

W&gt; Habe heute zum ersten Mal den AmZeiger gelesen.
W&gt;
W&gt; Hat mir so gut gefallen, da&szlig; ich ihn auch in Zukunft lesen m&ouml;chte.
W&gt; Sehr informativ und vielseitig. W&uuml;rde ihn gern in der AmigaGuide-
W&gt; Version erhalten.

Das ist in die Wege geleitet.

W&gt; Ist es noch m&ouml;glich die Ausgabe 6 zu erhalten?

Aber klar. Entweder aus dem Aminet, von unserer Website oder direkt
von uns ist jede Ausgabe erh&auml;ltlich.

W&gt; Mit freundlichen Gr&uuml;ssen
W&gt;
W&gt; Werner

<HR>

       <B>&gt;&gt; Absender: <A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A> (Uwe Pannecke) &lt;&lt;</B>

U&gt; Hallo Gregor & Co.,
U&gt;
U&gt; zwischenzeitlich habe ich Eure siebente Ausgabe auf meinem Rechner
U&gt; und &uuml;ber s&auml;mtliche Ausgaben eine gute Qualit&auml;t vorgefunden.
U&gt;
U&gt; Da ist es nur logisch, Euch zu bitten, mir den AmZeiger als
U&gt; AmigaGuide-Version in Zukunft per email zu schicken.

Null Problemo! Danke f&uuml;r die aufmunternden Worte!

U&gt; Mit freundlichen Gr&uuml;ssen
U&gt;
U&gt; Uwe

<HR>

    <B>&gt;&gt; Absender: <A HREF="mailto:brischkofski@beulen.com">brischkofski@beulen.com</A> (Thomas Brischkofski) &lt;&lt;</B>

T&gt; Hallo,

AmZ&gt; Darf ich fragen seit wann und woher Du uns kennst?

T&gt; Ich kenne Euch seit ca. einem viertel Jahr aus dem Aminet. Zu meiner
T&gt; Schande mu&szlig; ich aber gestehen, da&szlig; ich &uuml;ber einen Amiga seit 1988
T&gt; verf&uuml;ge und das Internet auch schon seit zwei Jahren nutze. Naja,
T&gt; manche merkens sp&auml;t.

Besser sp&auml;t als nie. Ein bi&szlig;chen Schade ist es schon.

Also: Bitte mehr Mundpropaganda! :)

T&gt; Mit bestem Gru&szlig;
T&gt;
T&gt; Thomas Brischkofski
</pre>
<HR>

<P>Wieder ein Danke an alle, die uns geschrieben haben.</P>

<P>Wir freuen uns immer &uuml;ber Hinweise, Kritik und Lob! Das motiviert uns!</P>

Euer<BR>
<A HREF="mailto:AmZeiger@gmx.de">Alter Postsack</A>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="uhl.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0399/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="wanted.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

