<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/99 - Fr. Gisela's Problemecke</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<TABLE BORDER=0 WIDTH="100%">
<TR>
<TD><H1>Frau Gisela`s Problemecke</H1></TD><TD ALIGN="RIGHT"><IMAGE SRC="../images/frg.gif"></TD>
</TR></TABLE>

<P><B>Dies ist eine Rubrik</B>, in der diverse Fragen gestellt oder Probleme
geschildert werden k&ouml;nnen. Da Frau Gisela in dieser Ausgabe (wie immer)
gerade bei einer bekannten deutschen Frauenzeitschrift unabk&ouml;mmlich ist,
werden gezwungenerma&szlig;en wir versuchen zu helfen bzw. den Sachverhalt
hier ver&ouml;ffentlichen, um jemanden zu finden, der dies kann.
</P><HR>
<B>Drei wichtige Anmerkungen:</B>
<UL>
<LI>Wir weisen noch einmal daraufhin (s. <A HREF="impres.htm">IMPRESSUM</A>), da&szlig; f&uuml;r die
Richtigkeit von Angaben, in diesem Fall f&uuml;r Tips, Hinweise, Scripte
o.&auml;., <B>keine Gew&auml;hr bzw. Haftung</B> f&uuml;r eventuelle Folgen &uuml;bernommen
werden kann.</LI>
<LI>Sollten jemandem Fehler, Bugs oder sonstige Ungereimtheiten auffallen,
oder er selbst praktische Tips oder Probleml&ouml;sungen kennen, so w&uuml;rden
wir uns &uuml;ber eine Nachricht sehr freuen.</LI>
<LI>Und wer Probleme hat, sollte sich nicht scheuen, Sie uns zu schildern,
weil ihm drei Monate Wartezeit zu lang sind. Die Redaktion versucht
selbstverst&auml;ndlich sofort zu helfen.</LI>
</UL>
<HR>

<P>Heute pack ich es mal selbst an [der Chefredakteur, d. Chefred.], wenn
sich niemand anders findet. Es handelt sich zwar nicht um einen echten
Trick, aber zumindest ist es ein Hinweis, denn gerade ist mir ein nettes
Tool `&uuml;ber den Weg gelaufen`, das sicher vielen von Nutzen sein kann.</p>

<P>Es geht um <B>HTMLview</B> von Allan Odgaard aus D&auml;nemark - nicht zu verwechseln
mit diversen anderen HTML-Viewern, die wie dieses MUI voraussetzen, z.B.
moreHTML.</P><P>
Hierbei handelt es sich n&auml;mlich um einen beinahe vollwertigen <B>Offline-
Browser</B> in einer fr&uuml;hen Version. Bereits jetzt kann er aber u.a. Frames,
Tabellen und Grafiken in erstaunlich hoher Qualit&auml;t darstellen, aber vor
allen Dingen: HTMLview ist schnell!
</P><p>
Nur etwas &uuml;ber 300 KByte ben&ouml;tigt das Programm im Moment f&uuml;r diese Leistung
und, wie erw&auml;hnt, MUI. HTMLview ist als Nebenprodukt bei der Entwicklung
des Web-Browsers IProbe abgefallen (der also Anla&szlig; zu Hoffnungen gibt) und
kostenlos auf folgender Site erh&auml;ltlich:</P>
<P>
<A HREF="htp://www.DIKU.dk/students/duff/">htp://www.DIKU.dk/students/duff/</A></P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9903mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="postsack.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
