<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x10 - FUBAR Interview</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x012C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x012C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x012B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x012D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x012C.html">FUBAR Interview</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0125.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0126.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0127.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0128.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0129.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x012A.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x012B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x012C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x012D.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x012E.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x012F.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>FUBAR Interview - The Game Of War</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Interview mit Ross Liversidge / Marketing/PR Direkto of
RosandeLTD Rosande LTD. entwickelt derzeit das Strategiespiel
`FUBAR`</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>SK = Stefan Keilwert / AmigaScene<BR> RL = Ross Liversidge / Rosande
Ltd.<BR>

<BR><B>SK:</B> Hi Ross !!<BR>

<BR><B>RL:</B> Hallo :)<BR>

<BR><B>SK:</B> Sei so nett und erz&auml;hle uns etwas zu Deiner Person...
(wie alt bist Du, wo lebst Du, Dein Job,...)<BR>

<BR><B>RL:</B> Ich? Nun, ich bin 20, lebe im United Kingdom (Harrogate,
North Yorkshire um genau zu sein) und bin der PR und Marketing Direktor
hier bei ROSANDE LTD, obwohl die meiste Zeit verbringe ich mit unseren
Firmenangelegenheiten. Ebenso helfe ich beim Gameplay Design, entwerfe die
Vertr&auml;ge und regle finanzielle Dinge...<BR>

<BR><B>SK:</B> Was waren Deine ersten Kontakte mit dem Amiga? Warst Du
jemals ein aktives Mitglied der &quot;Szene&quot;? Erz&auml;hl mal...<BR>

<BR><B>RL:</B> Ich bin nicht wirklich ein aktives Mitglied der Amiga Szene
- naja, es w&auml;re auch schwierig, da ich keinen besitze... wie auch
immer, ich hatte seit meinem siebten Lebensjahr Kontakte in der Amiga
Industrie, der Wichtigste war ein Typ namens Bill Donald - er hatte einige
B&uuml;cher auf dem Amiga geschrieben und war einer der ersten, der einen
A500 besa&szlig;, der hatte noch nicht mal das Amiga-Logo auf dem
Geh&auml;use.<BR>

<BR><B>SK:</B> Aha. Wie ich bereits wei&szlig;, bist Du der Marketing/PR
Direktor. Bist Du ein Gr&uuml;ndungsmitglied von &quot;ROSANDE LTD.&quot;,
oder bist Du sp&auml;ter eingestiegen?<BR>

<BR><B>RL:</B> Ich bin eines der zwei Gr&uuml;ndungsmitglieder von ROSANDE
LTD (das andere ist Andrew &quot;Oondy&quot; King). ROSANDE LTD wurde erst
im November letzten Jahres offiziell gegr&uuml;ndet.<BR>

<BR><B>SK:</B> Wann hat ROSANDE LTD mit der Entwicklung begonnen? (und
f&uuml;r welche Plattformen)<BR>

<BR><B>RL:</B> Wie gesagt, ROSANDE LTD startete im November, aber wir
arbeiten jetzt seit 3 Jahren ernsthaft an FUBAR. Vorher nannten wir uns
&quot;Q-Group Software&quot; und arbeiteten am Projekt
teilzeitm&auml;&szlig;ig. Unser Hauptprogrammierer - Oondy, hatte etliche
Teilst&uuml;ckchen erledigt und war au&szlig;erdem mitwirkend bei
Foundation. Jetzt arbeiten wir beide, Andrew und ich, hauptberuflich am
Projekt - das ist ein eigenes Kapitel f&uuml;r sich...<BR>

<BR><B>SK:</B> Wer sonst ist bei ROSANDE LTD?<BR>

<BR><B>RL:</B> Tja, die meisten Leute sind freie Mitarbeiter. Wir holen uns
die Talente, wie wir sie ben&ouml;tigen. Wir hatten eine Menge Beteiligte,
die Wichtigsten dabei sind Andy Kinsella, unser gestandener Grafiker und
Will Morton&acute;s Q-Labs, der sich f&uuml;r den Soundtrack verantwortlich
zeichnet. Wir haben auch freie Mitarbeiter wie Jean-Pierre Rossouw, der
Spezialgrafiken und Animationen beitr&auml;gt.<BR>

<BR><B>SK:</B> Momentan entickelt Ihr das Spiel &quot;FUBAR&quot;. Wieviel
kannst Du uns &uuml;ber das Spiel, das Genre, die H&ouml;hepunkte, etc.
bereits erz&auml;hlen?<BR>

<BR><B>RL:</B> FUBAR ist ein Strategiespiel, bestehend aus vielen
unterschiedlichen Ideen, aus verschiedenen Genres, zusammengesetzt ergibt
das etwas ganz Eigenes.<BR>

<BR>Einer der H&ouml;hepunkte w&auml;re die Art und Weise, wie man
Fahrzeuge und Waffen kreieren kann - basierend auf drei unterschiedlichen
Technolgien: Nukleartechnik, Elektronik und Biochemie! Andere tolle Sachen
sind die Grafik, die Musik und das nette ROSANDE Logo ;)<BR>

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Logo]" SRC="../images_10/rotatestill.jpeg"></CENTER>&nbsp;

<BR><B>SK:</B> Das klingt ja alles sehr interessant, erz&auml;hl uns mehr
davon...<BR>

<BR><B>RL:</B> Gerne. Das Spiel besteht aus drei Bereichen. Der erste ist
der Weltkarten-Bildschirm, wo man die Truppen positionieren und ein Auge
auf seine St&auml;dte haben kann. In diesem Bereich ist das Spiel
Civilization sehr &auml;hnlich.<BR>

<BR>Dann haben wir den Stadt-Bildschirm, wo man die Bev&ouml;lkerungsrate,
den Fahrzeugbau und das Einheitentraining kontrolliert, und so weiter. Man
mu&szlig; schon gut planen und managen, bevor man andere angreifen
kann.<BR>

<BR>Schlu&szlig;endlich gibt&acute;s da noch den Kampfbildschirm. Das ist
eine Echtzeit-Strategie Sache, &auml;hnlich wie Command&amp;Conquer. Hier
findet die ganze Action statt und man kann seine Waffen
&quot;testen&quot;...<BR>

<BR>Aber - FUBAR ist viel mehr als nur die Summe seine Teile, wie man so
sagt...<BR>

<BR><B>SK:</B> Wann und warum habt Ihr mit der Idee zu so einem Spiel
begonnen? Und wer hatte die Idee?<BR>

<BR><B>RL:</B> Zuerst hatte Andrew die Idee einen PD Klon von
North&amp;South zu ver&ouml;ffentlichen, mit aufgemotzter Grafik und
verbessertem Spielspa&szlig;. Das Projekt war auf die lange Bank geschoben
worden; als ich ihn traf, &uuml;berarbeiteten wir es und heraus kamen die
Grundz&uuml;ge von FUBAR.<BR>

<BR><B>SK:</B> Wie weit seid Ihr? Gibt es bereits eine Demoversion?<BR>

<BR><B>RL:</B> Das bisher erh&auml;ltliche Demo ist so alt, da&szlig; es
das Spiel in keinster Weise mehr repr&auml;sentiert! Circa 40-50% des
Programms sind fertig, aber wir haben daf&uuml;r gesorgt, da&szlig; der
Rest relativ schnell fertig werden wird. Die GUI kommt ins Endstadium und
die Spiel-Engine l&auml;uft auch schon. Haupts&auml;chlich ist es eine
Frage des Zusammensetzens der Einzelkomponenten. &Uuml;brigens verwenden
wir unsere eigene Programmiersprache!<BR>

<BR><B>SK:</B> Wann wird man das Spiel dann kaufen k&ouml;nnen?<BR>

<BR><B>RL:</B> Wenn alles nach Plan l&auml;uft, sollte es im August fertig
sein - die Ver&ouml;ffentlichung ist also im September.<BR>

<BR><B>SK:</B> Wenigstens hast Du mir schon mal einige nette Screenshots
geschickt ;)<BR>

<BR><CENTER><IMG WIDTH=240 HEIGHT=240 ALT="[Air Combat]" SRC="../images_10/fubar_1.jpeg"></CENTER>&nbsp;

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Rocket Tank]" SRC="../images_10/fubar_2.jpeg"></CENTER>&nbsp;

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Scene 1]" SRC="../images_10/fubar_3.jpeg"></CENTER>&nbsp;

<BR><B>SK:</B> Heutzutage mu&szlig; es sehr schwierig sein von
Entwicklungen NUR f&uuml;r den Amiga zu leben (obwohl die Situation besser
wird). Wie profitabel ist das wirklich?<BR>

<BR><B>RL:</B> Der Amiga ist nicht mehr wirklich rentabel,
haupts&auml;chlich wegen der Software-Piraterie! Jemand der Hardware kauft
und glaubt er sei berechtigt die Software von irgendwelchen
&quot;Warez-Sites&quot; runterzuladen, der verarscht sich selbst. Wenn wir
mit dem Amiga kein Geld verdienen k&ouml;nnen, m&uuml;ssen wir uns auf den
PC konzentrieren - obwohl wir wirklich gerne bei der Amiga Plattform
bleiben m&ouml;chten!<BR>

<BR><B>SK:</B> Ein L&ouml;sung ist, ein Spiel auch f&uuml;r andere
M&auml;rkte zu entwickeln. Werdet Ihr das machen?<BR>

<BR><B>RL:</B> FUBAR&acute;s Quell-Code ist bereits f&uuml;r die
Konvertierung auf den PC und die Playstation optimiert. Dort werden wir
auch unser Geld verdienen. Wir haben schon DirectX und 3DFX Programierer
gefunden (soweit ich informiert bin...); eine PC Version wird also dicht
hinter der Amiga Version ver&ouml;ffentlich.<BR>

<BR><B>SK:</B> Mich w&uuml;rden die Profit-Relationen zwischen den
Verk&auml;ufen der Amiga Version und der PC Version interessieren - falls
Du Vorkalkulationen gemacht hast.<BR>

<BR><B>RL:</B> &Auml;hmm. Multipliziere die Amiga-Einnahmen mit 100 und
bekommst eine Ahnung davon. Der PC Markt ist um ein Vielfaches
gr&ouml;&szlig;er...<BR>

<BR><B>SK:</B> Ich glaube es wird Zeit unseren Lesern noch ein paar
Screenshots zu zeigen... und los geht&acute;s...<BR>

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Title]" SRC="../images_10/fubar_6.jpeg"></CENTER>&nbsp;

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Tank]" SRC="../images_10/fubar_5.jpeg"></CENTER>&nbsp;

<BR><B>SK:</B> Sprechen wir nochmals &uuml;ber FUBAR - wie Du wei&szlig;t,
sind viele andere gute Spiele (und Klones) erh&auml;ltich. Wenn Ihr nun
einen Bestseller produzieren wollt, m&uuml;&szlig;t Ihr Euch von den
anderen unterscheiden, genaugenommen m&uuml;&szlig;t Ihr besser sein als
der Rest! Wie wollt Ihr dieses Ziel mit FUBAR erreichen?<BR>

<BR><B>RL:</B> Nun, FUBAR hebt sich durch die vielen M&ouml;glichkeiten und
Ideen hervor, die in keinem anderen Spiel dieser Art vorkommen. Wenn wir
gerade &uuml;ber Klones sprechen, das Problem ist, die Leute m&ouml;gen
sie, warum w&uuml;rden sie sich sonst verkaufen? Wieviele Doom/Quake
Varianten gibt es zum Beispiel? Schau Dir Half Life verglichen mit Quake II
an - praktisch dasselbe Format, aber unterschiedlich implementiert - Half
Life ist strategisch optimiert und bietet hochintelligente Gegner
verglichen mit Quake II&acute;s &quot;abmurksen und laufen&quot;
Spielverlauf. FUBAR wird der intelligente und st&auml;rker variierte
Verwandte einer Masse anderer Spiele.<BR>

<BR><B>SK:</B> Um zum Ende zu kommen, was wird uns die Zukunft bringen? Was
ist Deine Meinung &uuml;ber die Classic-Amiga versus NG-Amiga Diskussion?
(G3-Karten, OS3.5, OS5.0, QNX,...)<BR>

<BR><B>RL:</B> Um ehrlich zu sein, auf diese Diskussionen lasse ich mich
nicht ein.<BR>

<BR><B>SK:</B> Unterst&uuml;tzen ROSANDE LTD Spiele den PPC? (PowerUp oder
WarpOS, Warp3D, Rave3D...)<BR>

<BR><B>RL:</B> Blittersoft hat uns danach gefragt und wir werden auch,
sofern es sich auszahlt. Das Problem ist die nicht vorhandene
Unterst&uuml;tzung beim Entwickeln f&uuml;r den PPC, daher h&auml;ngt es
sehr davon ab, wie arbeitsintensiv das wird.<BR>

<BR><B>SK:</B> Wird ROSANDE LTD die neuen NG-Amigas unterst&uuml;tzen
(falls sie jemals kommen)?<BR>

<BR><B>RL:</B> Wenn es sich finanziell rentiert, sicher. Wir
unterst&uuml;tzen gerne den Amiga, aber m&uuml;ssen doch zuallerst auf uns
schauen. Wir warten schon ungeduldig auf die Specs, welche f&uuml;r die
London&acute;s World of Amiga Show heuer versprochen wurden!<BR>

<BR><B>SK:</B> Wie sehen die Zukunftspl&auml;ne von ROSANDE LTD aus? Gibt
es Pl&auml;ne f&uuml;r ein neues Spiel?<BR>

<BR><B>RL:</B> Ich habe bereits ein Team in Wartestellung f&uuml;r das
n&auml;chste Projekt, mit dem Arbeitstitel &quot;Silver Falls&quot;,
welches startet, sobald FUBAR unter Dach und Fach ist. Eine Band wartet
schon darauf ein paar nette Songs beizusteuern und ich habe auch schon eine
sehr talentierte Grafikerin namens Vanessa Wells f&uuml;r die Charakter
Designs und Poster. Q-Labs wird wieder den Soundtrack machen und dann ist
da noch Technoarts cc f&uuml;r die Animationen.<BR>

<BR><CENTER><IMG WIDTH=240 HEIGHT=180 ALT="[Soldiers]" SRC="../images_10/fubar_4.jpeg"></CENTER>&nbsp;

<BR><B>SK:</B> M&ouml;chtest Du unseren Lesern noch irgendwas auf den Weg
mitgeben?<BR>

<BR><B>RL:</B> Hmm, das Wichtigste: unterst&uuml;tzt den Amiga indem Ihr
Software kauft, sogar wenn sie nicht von uns ist - ein Ger&auml;t lebt oder
stirbt damit, egal wie gut die Hardware ist. Nehmt als Beispiel den Mangel
an Spielen auf dem N64... es gab mehr Gebraucht-N64 in den ersten sechs
Monaten in Japan als Neuger&auml;te, als Squaresoft zu Sony
&uuml;berwechselte :)<BR>

<BR><B>SK:</B> OK, ich glaube wir sind am Ende angelangt. Vielen Dank,
da&szlig; Du Dir die Zeit genommen hast und viel Erfolgt mit FUBAR!<BR>

<BR><B>RL:</B> Danke ebenfalls :)<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#derrel">Stefan Keilwert</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x012C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#robert"><I>Robert Niessner</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x012C.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x012B.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x012D.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
