<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x10 - MP3</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x012D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x012D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x012C.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x012E.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x012D.html">MP3</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x0125.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0126.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0127.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0128.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0129.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x012A.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x012B.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x012C.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x012D.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x012E.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x012F.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>MP3 - Grundlagen</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">MP3 hat sich als Kompressionsstandard f&uuml;r Musik
auf so ziemlich jeder Plattform durchgesetzt, aber die wenigsten wissen,
welch ungeheurer Aufwand und dahintersteckt - es ist wie mit dem Telefon,
jeder benutzt es, kaum einer wei&szlig;, wie es funktioniert.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ziel dieses Artikels ist es, das Geheimnis um MP3 ein wenig zu
l&uuml;ften.<BR>

<BR>Zuallerst, MP3 hei&szlig;t eigentlich MPEG 1 Layer 3, aber da die
PC-Fritzen immer noch ihre Probleme mit langen Dateianh&auml;ngseln haben,
wurde daraus *.MP3 (Windows erkennt Dateien nur an ihrer Endung, eine .doc
ist ergo eine Word-Datei eine .xls ein Excel und eine .w&uuml;rg eine
W&uuml;rg-Datei :-) )<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wer steckt dahinter?</B></H3>&nbsp;

<BR>Entwickelt wurde MP3 am Fraunhofer-Institut in Erlangen in Kooperation
mit der TU-Erlangen f&uuml;r das sogenannte EUREKA-Projekt seit 1987 (so
neu ist es also auch wieder nicht, wie mancher glauben m&ouml;chte). Als
Vater des Verfahrens gilt Dr. Ing. Karlheinz Brandenburg, derzeit
Abteilungsleiter des Bereichs Audio- technik und Multimedia beim
Fraunhofer IIS ( <A HREF="http://www.iis.fhg.de/amm/">http://www.iis.fhg.de/amm</A> ).<BR>

<BR>Ziel von EUREKA war unter anderem die relativ hohe Datenrate eines
Audio-PCM-Signals wie z.B. einer CD mit mehr als 180 kByte/s drastisch zu
reduzieren. Mit den bisherigen, nicht verlustbehafteten Algorithmen war
dies nicht mehr zu verwirklichen, daher wurde der Schwerpunkt auf ein
Verfahren gerichtet mit dem Ziel einen hohen, verlustbehafteten
Kompressionsgrad mit m&ouml;glichst geringer Qualit&auml;tseinbu&szlig;e zu
entwickeln. Aus diesem Denkansatz heraus wurde das MPEG-Codier-Verfahren
f&uuml;r Audio und Video entwickelt, welches im Audiobereich als MPEG 1
Layer 1 bekannt wurde.<BR>

<BR>Eine der kommerziellen Anwendung war die digitale Kompaktkassette (DCC)
von Philips, die dank MP1 mit einem Viertel der urspr&uuml;nglichen
Datenmenge auskam. Die MiniDisc von Sony verwendet &uuml;brigens ein
&auml;hnliches nicht MPEG-konformes Verfahren mit einem Faktor von ca.
1:5.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die weitere Entwicklung</B></H3>&nbsp;

<BR>Bald darauf wurde der Standard MPEG 1 Layer 2 verabschiedet, der mit
besserer Kompression auftrumpfte, nur um anschlie&szlig;end von MPEG 1
Layer 3 in Pension geschickt zu werden. Das neue an MP3 war, da&szlig; hier
nicht die verf&uuml;gbare Rechenleistung, sondern der erreichbare
Kompressionsfaktor entscheidender Entwicklungsschwerpunkt war.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Layer und Datenraten
<BR>
<BR>CD&nbsp;&nbsp;1:1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;180 kB/s&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Stereo, 16 Bit, 44.1 kHz)
<BR>L1&nbsp;&nbsp;1:4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;48 kB/s&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Stereo, 16 Bit, 44.1 kHz)
<BR>L2&nbsp;&nbsp;1:6 - 1:8&nbsp;&nbsp;&nbsp;&nbsp;32 kB/s - 24 kB/s&nbsp;&nbsp;(Stereo, 16 Bit, 44.1 kHz)
<BR>L3&nbsp;&nbsp;1:10 - 1:12&nbsp;&nbsp;16 kB/s - 14 kB/s&nbsp;&nbsp;(Stereo, 16 Bit, 44.1 kHz)
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Die neueste Technolgie ist MPEG-2 AAC (Advanced Audio Encoding) und
wird eine konsequente Weiterentwicklung von MP3 sein. AAC bietet neben
wesentlich verbesserter Kodiereffizienz (gleiche Audioqualit&auml;t bei
h&ouml;herer Kompressions- rate) zus&auml;tzliche
Funktionalit&auml;tsmerkmale, wie Unterst&uuml;tzung von mehreren
Programmen mit bis zu 48 Kan&auml;len oder Abtastraten von 8 bis 96 kHz und
vieles mehr. Im Gegensatz zu MP3 sollen auch keine freien, unlizenzierten
AAC Decoder toleriert werden, womit das Verfahren woll f&uuml;r den Amiga
nicht besonders interessant sein wird (au&szlig;er Amiga Inc. lizenziert
das Verfahren und baut es direkt in das NG AmigaOS ein).<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Wie funktioniert MPEG denn nun?</B></H3>&nbsp;

<BR>Die Grundlage f&uuml;r alle Arten der Audiokodierung bildet die
Psychoakustik. Diese Wissenschaft besch&auml;ftigt sich mit allem, was mit
physikalischen Me&szlig;methoden nicht ohne weiteres erfa&szlig;bar ist.
Ma&szlig;geblich ausgenutzt wird der sogenannte Verdeckungseffekt, der
prinzipiell in zwei Formen auftritt. Dem Menschen ist es nicht
m&ouml;glich, zwei frequenzm&auml;&szlig;ig benachbarte T&ouml;ne mit einem
gewissen Pegelunterschied aufzul&ouml;sen, wobei der leisere Ton nicht
wahrgenommen wird und somit nicht explizit mit &uuml;bertragen werden
mu&szlig;.<BR>

<BR><CENTER><A HREF="../images_10/mp3-simul_mask-small.png"><IMG WIDTH=320 HEIGHT=238 ALT="[MP3 Simul Mask]" SRC="../images_10/mp3-simul_mask-smalltn.gif"></A></CENTER>&nbsp;

<BR>Die unterste, gr&uuml;ne Kurve zeigt, welcher Schalldruck (SPL)
erforderlich ist, um eine bestimmte Frequenz noch h&ouml;ren zu k&ouml;nnen
(H&ouml;rschwelle). Ein Ton von 1 kHz und 80 dB ver&auml;ndert die
H&ouml;rschwelle drastisch. Der Kurvenverlauf 80 entspricht dem
&quot;maskierten&quot; Bereich. Bei etwa 2 kHz ist schon ein Schallpegel
von 50 dB (statt 10 dB) n&ouml;tig, damit dieser Ton neben dem lauteren
1-kHz-Signal &uuml;berhaupt wahrnehmbar ist. Ein leiser Ton mit
&auml;hnlicher Frequenz wie ein lauteres Signal ist ab einer bestimmten
Grenze verdeckt, weshalb man ihn ganz weglassen kann. Genau dies macht ein
MPEG-Encoder.<BR>

<BR>Die Aufl&ouml;sung (der Rauschabstand) wird dynamisch an die sich
&auml;ndernden Signale angepa&szlig;t d.h. im f&uuml;r das Geh&ouml;r nicht
wahrnehmbaren Bereich verringert. Die F&auml;higkeit der Anpassung beruht
auf einer Aufsplittung des gesamten Frequenzbereichs in 32
Frequenzb&auml;nder (Layer 1 und 2), welche bei Layer 3 ihrerseits in
weitere 18 Teilbereiche pro Frequenzband unterteilt sind. Der Encoder
reduziert erst dann, wenn sich der Informationsgehalt mit der vorgegebenen
Bitrate nicht mehr &uuml;bertragen l&auml;&szlig;t. Ein 1-kHz-Sinus bei 128
kBit/s zeigt sich dementsprechend unver&auml;ndert, da eine solche einfache
Information problemlos in den Bitstrom pa&szlig;t. Erh&ouml;ht man die
Frequenzanteile, steigt der Informationsgehalt und damit das Ma&szlig; der
erforderlichen Reduktion. Abh&auml;ngig von der Qualit&auml;t des
verwendeten Algorithmus kann nun ein Encoder mit entsprechendem
Rechenaufwand die Signale auswerten und manipulieren. Die h&ouml;chste
Qualit&auml;t liefert nat&uuml;rlich der Fraunhofer Encoder, der bis zu
einer Frequenz von 20 kHz arbeitet, w&auml;hrend der popul&auml;re Xing
Encoder schon bei 16 kHz begrenzt und in den restlichen Frequenzbereichen
weniger sauber arbeitet - daf&uuml;r ist er auch ca. um den Faktor 2
schneller!<BR>

<BR>Ferner existiert noch ein zeitlicher Verdeckungseffekt was zur Folge
hat, da&szlig; unmittelbar vor und hinter einem &uuml;berdurchschnittlich
lautem Ton die leiseren Passsagen nicht wahrgenommen werden. Das Geh&ouml;r
ben&ouml;tigt sowohl bei lauten als auch leisen Ger&auml;uschen eine
&quot;Erholungszeit&quot; (Recovery Time), bis es wieder voll
funktionst&uuml;chtig ist.<BR>

<BR>Damit stehen den Encodern f&uuml;r dynamische Signale zwei wichtige
Funktionsprinzipien zur Verf&uuml;gung, um auf digitaler Ebene zwischen
unh&ouml;rbaren und h&ouml;rbaren Signalen unterscheiden zu
k&ouml;nnen.<BR>

<BR>Die bisher beschriebenen Prinzipien der Maskierung reichen aus, um die
Bitrate auf 32 kByte/s zu dr&uuml;cken. Daraus ergibt sich ein
Verh&auml;ltnis von 1:5 mit CD-Klang. F&uuml;r eine noch st&auml;rkere
Veringerung der Datenrate auf 16 kByte/s sind weitere Verfahren notwendig.
Da man diese Bitrate normalerweise mit Stereomaterial anwendet, ergibt sich
der n&auml;chste Ansatzpunkt von selbst: eine (unh&ouml;rbare) Reduzierung
der Stereoinformationen. Prinzipiell ergibt sich der Stereoeindruck durch
Phasen- und Pegeldifferenzen zwischem linkem und rechtem Kanal. Der Mensch
bestimmt die Richtung eines Schallereignisses je nach Frequenz
unterschiedlich. Tiefe T&ouml;ne sind nicht ortbar (Subwoofer-Prinzip),
mittlere T&ouml;ne werden durch eine Kombination aus
Lautst&auml;rkeunterschied und Zeitpunkt des Eintreffens am linken und
rechten Ohr geortet, hohe Frequenzen dagegen nur noch &uuml;ber den
Lautst&auml;rkeunterschied.<BR>

<BR>Unter dem Begriff &quot;Joint Stereo Coding&quot; benutzt der
Fraunhofer Encoder unterhalb von 32 kByte/s zun&auml;chst eine der
grundlegendsten Funktionen der Stereotechnik, die Mitte/Seite-Kodierung.
Das Stereo-Signal wird dabei in ein Mitten- (L+R) und ein Seitensignal
(L-R) zerlegt. Da das Seitensignal sehr viel weniger Information
enth&auml;lt, ergibt sich verglichen mit zwei vollwertig zu verarbeitenden
Stereo-Kan&auml;len eine reduzierte Datenmenge. Zusammen mit der
Reduzierung der r&auml;umlichen Abbildung um irrelevante Informationen
lassen sich so reichlich Daten sparen.<BR>

<BR>Bei noch geringeren Datenraten unter 8 kByte/s kommt schlie&szlig;lich
zus&auml;tzlich das &quot;Intensity Stereo Coding&quot; zum Einsatz. Hier
werden ab einer bestimmten Frequenz nur noch ein Summenkanal und
Richtungsinformationen (pro Frequenzband) &uuml;bertragen. Das bringt
angesichts der geringen Datenraten ein qualitativ gutes Ergebnis, bewirkt
jedoch schon deutliche Differenzen zum Original.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Was l&auml;uft nun im Encoder ab</B></H3>&nbsp;

<BR>Die Audiodaten durchlaufen zuerst die Filterb&auml;nke. Die dadurch
enstehenden Teildatenstr&ouml;me werden im Quantisierer (mit quantisieren
meint man das je nach Anforderung unterschiedlich genau Aufl&ouml;sen des
Frequenzbandes) und Coder den zur Verf&uuml;gung stehenden Bits zugewiesen.
Die Aufl&ouml;sung betr&auml;gt damit dynamisch zwischen 2 und 15 Bit (von
urspr&uuml;nglich 16 Bit). Die Steuerung dieser Zuweisung erfolgt &uuml;ber
eine Art Maskierungsdatenbank, welche s&auml;mtliche vorhandenen
M&ouml;glichkeiten der Maskierung kennt.<BR>

<BR>Diese Datenbank wird durch aufwendigste Testverfahren mit Testperson
mit ausgezeichnetem Geh&ouml;r angelegt. Bisher war es unm&ouml;glich das
menschliche Geh&ouml;r und seine Wahrnehmung klassisch-me&szlig;technisch
zu erfassen. Aufgrund der Fortschritte in der Digitaltechnik und den DSPs
existieren inzwischen erste vielversprechende Ans&auml;tze, die
unterst&uuml;tzend bei der Entwicklung und Verbesserung der Encoder
wirken.<BR>

<BR>Die Suche nach der bestm&ouml;glichen Maskierungsart f&uuml;r das
anliegende Signal ist sehr zeitaufwendig und haupts&auml;chlich f&uuml;r
die Dauer einer Kodierung verantwortlich. In einer schrittweisen
Ann&auml;herung (Iteration) versucht die Erkennungslogik diese Suche zu
optimieren.<BR>

<BR>Zu guter Letzt sorgt eine Huffman-Kodierung, wie sie beispielsweise bei
Packprogrammen verwendet wird, f&uuml;r eine Unterdr&uuml;ckung redundanter
Bits (z.B. Bits ohne oder gleichen Informationsgehalts) im Datenstrom.<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Der Decoder hat&acute;s leicht...</B></H3>&nbsp;

<BR>Dekodieren ist dagegen vergleichsweise einfach. Obwohl die Filterung
des urspr&uuml;nglichen Signals r&uuml;ckg&auml;ngig gemacht werden
mu&szlig;, entf&auml;llt eine Suche nach der passenden Maskierungsmethode
komplett. Auf heutigen Rechnern l&auml;uft das Dekodieren ohne sonderliche
CPU-Belastung im Hintergrund ab (au&szlig;er man hat einen lahmen 68k
Prozessor). Au&szlig;erdem ist der Decoder fest definiert, Verbesserungen
des Verfahrens finden somit nur auf Encoderseite statt.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Encodieren schnell wie der Wind...</B></H3>&nbsp;

<BR>Auf dem PC l&auml;&szlig;t die Auswahl von verschiedenen Anbietern
keine W&uuml;nsche offen, auf dem Amiga sieht es schon etwas bescheidener
aus. Momentan sind mir nur 3 brauchbare Encoder bekannt, unter anderem
Lamer und Encode. Letzerer ist kommerziell bei Titan-Software
erh&auml;ltlich und sollte daher auch entsprechende Qualit&auml;t (dem
Fraunhofer Encoder vergleichbar) bieten. Diese Aufz&auml;hlung erhebt
keinesfalls den Anspruch auf Vollst&auml;ndigkeit und ist auch nicht
Gegenstand dieses Artikels. Sobald die ersten kommerziellen Encoder
lieferbar sind, werden wir einen Testbericht dazu abliefern.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Konkurrenz - MS Audio</B></H3>&nbsp;

<BR>Wie immer versucht Micro$oft auch diesen Markt f&uuml;r sich zu erobern
und in ein von ihnen angef&uuml;hrtes Monopol zu &uuml;berantworten.
Kr&auml;ftig die Werbetrommel klopfend und die Marketingmaschinerie
anwerfend kommt der fu&szlig;lahme Riese aus Redmond auf den erschreckten
User zugestapft und droht mit erhobenem Finger: &quot;Unser Audiostandard
ist vieeel besser als MP3 und schneller sind wir auch, beim
codieren!&quot;<BR>

<BR>Da stellt sich nat&uuml;rlich die Frage, wie machen die das in dieser
kurzen Zeit? Wie schon fr&uuml;her erw&auml;hnt, ist die Optimierung des
Codierverfahrens eine sehr aufwendige Sache und da kommt man schon ins
Gr&uuml;beln, ob die Patente...<BR>

<BR>Die Ergebnisse vom Fraunhofer Institut sind &uuml;berall bestens
dokumentiert und ver&ouml;ffentlicht - hier l&auml;&szlig;t sich fremdes
Know-how wunderbar ausschlachten. Interessant ist auch, da&szlig; Micro$oft
bisher keinerlei Patente angemeldet hat.<BR>

<BR>Wie von verschiedenen Seiten zu h&ouml;ren war, konnte MS Audio von der
Qualit&auml;t her gegen&uuml;ber MP3 nicht wirklich &uuml;berzeugen, die
Geschwindigkeit liegt in etwa bei der des Xing Encoders, bei allerdings
schlechteren Ergebnissen.<BR>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Das Ende</B></H3>&nbsp;

<BR>Auf dem Amiga brauchen wir vor diesen Dingen jedenfalls keine Angst zu
haben, es steht nicht zu erwarten, da&szlig; M$ sein MS Audio auf den Amiga
umsetzt... MP3 hat jedenfalls seine Berechtigung und wird vielen Usern
lange Freude bereiten (immerhin bekommt man 10 Stunden Musik auf eine
CD).<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#robert">Robert Niessner</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x012D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#tlively"><I>Tom Lively</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x012D.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.mp3.de/">http://www.mp3.de/</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.mp3.com/faq/">http://www.mp3.com/faq/</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.mp3-online.de/">http://www.mp3-online.de/</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://mp3.free-web.de/mp3/technik.html">http://mp3.free-web.de/mp3/technik.html</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.iis.fhg.de/amm/index.html">http://www.iis.fhg.de/amm/index.html</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x012C.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x012E.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
