<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #93 (6.11.2001)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>
<p>Erstmal sorry f&#252;r die Versp&#228;tung der NoCover, aber da ich die Amiga Aktuell erst ziemlich sp&#228;t erhielt, musste auch die NoCover warten. Insbesondere die Disk Abo`s kontnen dadurch erst ziemlich sp&#228;t zugestellt werden, aber in meiner Macht lag es diesesmal wirklich nicht....</P>

<p>Tja, nach einem wetter-technisch zwar tr&#252;ben, aber dennoch recht warmen November habt ihr nun endlich wieder die neue NoCover vor Euch liegen. Nat&#252;rlich kommt ihr nicht darum herum, Euch zun&#228;chst mein Geschreibsel anzutun, aber danach k&#246;nnt ihr auch schon direkt mit dem Lesen loslegen.</P>

<p>Als erstes steht nat&#252;rlich das Thema Beteiligung auf dem Programm und diese war diesen Monat zwar eigentlich recht zufriedenstellend. Zwar gab es sicherlich schon besser gef&#252;llte Ausgaben der NoCover, aber insgesamt k&#246;nnte es bisher auch schlechter laufen. Richtig happy w&#228;re ich allerdings, wenn sich auch noch andere Members als die bekannten Gesichter mal zu Worte melden w&#252;rde - so wie es Nightshade in dieser Ausgabe mit seinen ersten Beitr&#228;gen, die mir pers&#246;nlich ziemlich gut gefallen haben, getan hat. Man braucht wirklich kein Sprachexperte oder begabter Rhetoriker zu sein, um Beitr&#228;ge einzureichen. Schreibt einfach drauf los und ihr werdet merken, dass es eigentlich gar nicht so schwer ist. Insbesondere w&#252;rde ich mich freuen, wenn mal wieder einige Amiga Themen mehr eintrudeln w&#252;rden. Welche Software benutzt ihr? Welche Tipps kennt ihr? Wie fandet ihr die Amiga Messe? Das alles sind 
Themen &#252;ber die man sofort schreiben k&#246;nnte....</P>

<p>In Sachen Interviews habe ich auch gute News zu vermelden: Die Amiga Arena / Olaf K&#246;bnik (Hail brother!) stellt uns fortan ihre Interviews f&#252;r die NoCover zur Verf&#252;gung. Die gut gemachten Interviews sind im NoCover Talk zu finden. Besucht aber auf jeden Fall auch die Webseite der Amiga Arena (http://online-club.de/~arena), die immer wieder Sonderangebote, Aktionen, Keyfiles und viele weitere Dinge f&#252;r Euch bereith&#228;lt.</P>

<p>Einige User haben mich nach einem Fazit der ersten Monate als NoCover Herausgeber gefragt. Nun, neben einer Menge Stress (vieles, was rund um die NoCover passiert, bekommen viele gar nicht mit) bin ich eigentlich ganz zufrieden mit der Entwicklung. Die NoCover ist inzwischen ein Freeware Mag, der E-Mail Verteiler w&#228;chst kontinuierlich, das Disk Abo konnte gesichert werden und auch die Beitr&#228;ge trudeln wieder vermehrt ein. Insofern bin ich eigentlich ganz optimistisch, was die Zukunft der NoCover angeht. Lediglich das Thema Homepage m&#252;sste noch gekl&#228;rt werden - hat denn wirklich niemand Interesse daran, das zu &#252;bernehmen?</P>

Gefragt wurde ich auch, wie man mir helfen kann: Neben Beitr&#228;gen vor allem dadurch, dass man ander User auf die NoCover aufmerksam macht. Sprich: Wer 
potenzielle User kennt, die daran Interesse haben k&#246;nnten, die NC frei per E-Mail zu bekommen, einfach mal anschreiben. 

So, bleibt von mir nur noch zu sagen, dass ich auch im Dezember auf Eure Unterst&#252;tzung in Form von Beitr&#228;gen hoffe und es eine prallgef&#252;llte Januar Au
sgabe geben wird. Ein angenehmes Weihnachtsfest w&#252;nsche ich Euch allen da drau&#223;en,

<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der
aktuellen NC. See ya,<br>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</b></p>

</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
