<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neues Executive Update von AMIGA-CEO Bill McEwen</H2>
<P>
Martina Jacobs hat f&uuml;r unseren Partner amiga-news.de das vor kurzem
erschienene neue Executive Update von AMIGA-CEO Bill McEwen &uuml;bersetzt:
</P>
<P><B>&raquo;Executive Update - 23. Dezember 2001</B></P>
<P><B>Frohes Fest!</B></P>
<P>
Ich bin mir bewusst, dass Sie seit Monaten nichts mehr von mir und den
anderen Mitgliedern des Amiga-Teams gelesen haben. Das lag bei Weitem nicht
an mangelnder Aktivit&auml;t. Ob es sich um die Beschaffung von Geld in den USA
handelt, gemeinsamen Entwicklungen mit Partnern im fernen Osten oder die
Entwicklung von Ami2D in Schweden und Neuseeland, Amiga ist wirklich eine
globale 24-Stunden-t&auml;glich-Firma.
</P>
<P>
Zun&auml;chst m&ouml;chte ich Ihnen Allen f&uuml;r Ihre dauerhafte Unterst&uuml;tzung danken.
Dies war ein Jahr der Herausforderungen und wir werden weiterhin unsere
Schlachten schlagen, in diesem schwierigen Technologie-Markt. Doch selbst
in diesen harten Zeiten konnte sich der wahre Geist des Amiga und dessen
Gemeinschaft behaupten. Wir hatten sehr viel Gl&uuml;ck bei der Wahl unserer
Partner und freuen uns auf eine gro&szlig;artige, gemeinsame Zukunft im kommenden
Jahr.
</P>
<P>
&Uuml;ber die Zukunft des Amiga kam es zu Verwirrungen, durch die Ger&uuml;chte, die
einige Mitglieder der Gemeinschaft verbreiteten. Dies ging sogar so weit,
dass Webseiten gehackt wurden, um falsche Informationen zu verbreiten.
Bedenken Sie, wenn Sie etwas nicht auf den offizielle Seiten www.amiga.com
oder www.amigadev.net, der Entwickler-Seite, lesen, dann betrachten Sie es
als Ger&uuml;cht und behandeln sie es mit Vorsicht. Sollten Sie irgendeinen
Verdacht haben, dann nehmen Sie mit dem Team oder mir pers&ouml;nlich Kontakt
auf und lassen Sie uns &uuml;ber jeden m&ouml;glichen Fall sprechen. Wir werden
antworten. Vielleicht wird es nicht das sein, was Sie h&ouml;ren wollen, aber
wir werden uns um Ihre Anliegen k&uuml;mmern.
</P>
<P>
Wir sind da, um zu gewinnen! Und wir werden auf ganzer Linie gewinnen,
indem wir die Marktsegmente angreifen, in denen es f&uuml;r uns eine deutliche
Gelegenheit gibt, in bedeutender Weise Einfluss zu nehmen und einen
Gesch&auml;ftsbereich zu erlangen, der sich auch verteidigen l&auml;sst. Die
Gelegenheit f&uuml;r Amiga ist gr&ouml;&szlig;er, als je zu vor. Mit unserer doppelten
Strategie mit AmigaDE als universellem System f&uuml;r Inhalte und dem AmigaOS
als unser Desktop, Workstation und Server, sind wir in der Lage, eine
vollst&auml;ndige L&ouml;sung f&uuml;r Heim, B&uuml;ro, Schule und allen anderen digitalen
Bed&uuml;rfnissen anzubieten.
</P>
<P>
Das Amiga-Team und ich sind auf lange Sicht an dieser Sache dran, denn wir
wissen, dass Amiga Erfolg haben kann. Alle unsere Vermarktungs-Kontakte,
Gesch&auml;ftskontakte, und Entwicklungs-Kontakte zeigen uns, dass dies die Zeit
f&uuml;r Amiga ist. Wir haben potentielle Partner, Entwickler, und sogar Firmen
in unserem eigenen Gesch&auml;ftsbereich verschwinden sehen, doch Amiga ist
immer noch im Gesch&auml;ft. Jetzt, wo die amerikanische Wirtschaft beginnt sich
zu erholen, sind wir schlanker und st&auml;rker, als jemals zuvor.
</P>
<P>
Eine der St&auml;rken von Amiga ist die Tatsache, dass das Amiga-Team sich
wirklich weit &uuml;ber die Welt ausbreitet, durch die Anwender, Entwickler und
H&auml;ndler. Erfolg f&uuml;r Amiga ist ebenso Erfolg f&uuml;r Sie Alle. Viel zu lange
hatte die Amiga-Gemeinschaft nichts, auf das sie h&auml;tte stolz sein k&ouml;nnen.
Aber mit dem Start unseres ersten, auf AmigaDE basierenden Produktes, ist
f&uuml;r das gesamte Amiga-Team die Zeit gekommen, wieder zusammen zu arbeiten.
Am Ende dieses Updates werde ich Alle um Hilfe bitte, denn Amiga kann nur
vorw&auml;rts kommen, wenn wir zusammen arbeiten.
</P>
<P>
F&uuml;r diejenigen von Ihnen, die nach bestimmten Nachrichten hungern, hier
einige aktuelle Informationen:
</P>
<P><B>Amiga Digital Environment TM:</B></P>
<P>
Der Amiga DE PlayerTM 1.0 f&uuml;r Windows und Linux ist nun fertig gestellt und
wird ausgeliefert! Wir haben eine neue Webseite namens <A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>,
die f&uuml;r Anwender zu einem Brennpunkt f&uuml;r alles rund um AmigaDE werden wird,
und wir ermutigen Sie dazu, diese Seite zu besuchen, daran Anteil zu nehmen
und sie auf der Welt zu verbreiten.
</P>
<P>
Der AmigaDE TM Player bildet den ersten Schritt in Richtung unserer Vision
vom Digital Habitat TM (digitaler Lebensraum), denn er ist das Startprodukt
f&uuml;r das AmigaDE (Digital Environment - digitale Umgebung), ein Satz von
Technologien, der die Anwender und ihre Inhalte einander n&auml;her bringen
wird, unabh&auml;ngig davon, welches digitale Ger&auml;t sie verwenden. Das The
AmigaDETM zielt unmittelbar auf den Anwender, der in der Lage sein m&ouml;chte,
die Inhalte jedes seiner digitalen Ger&auml;te zu erfahren, ohne sich dabei
darum sorgen zu m&uuml;ssen, welches dieser Ger&auml;te mit jenem Inhalt
funktioniert. Ganz gleich um welchen Inhalt es sich handelt - eine
Anwendung, ein Spiel, Musik, Video, E-Mail oder was auch immer - mit dem
AmigaDE TM Player lautet die Antwort, dass das alles funktioniert.
</P>
<P>
In den kommenden Wochen werden viele weitere Applikationen erscheinen.
Ausw&auml;rtige Entwickler arbeiten zurzeit an Produkten, die den Umfang von
Desktop-F&auml;higkeiten erreichen und diese auch erwarten. Bittersweet,
Edivision, e.p.i.c. interactive entertainment, Kaliko, Matay, Pagan Games,
Ruksun Software, Technomages, Titan Computer, VecTrace, Zeoneo, plus einige
Firmen, die noch genannt werden, und ebenso viele Einzelpersonen; alle
arbeiten hart, um die Gelegenheit, die das DE bietet, zu ergreifen und
davon zu profitieren.
</P>
<P>
Wir freuen uns darauf, zu sehen, wie noch mehr Leute den Reihen aus &uuml;ber
3000 Entwicklern beitreten, die bereits f&uuml;r Amiga und unsere Partner
arbeiten und mit dem Aufbau der Bewegung werden wir in den n&auml;chsten paar
Wochen Pressemitteilungen herausgeben, in denen wir diese neuen und auch
bereits bestehende Firmen bekannt geben werden. F&uuml;r weitere Informationen
siehe <A HREF="http://www.amigadev.net" TARGET="_top">http://www.amigadev.net</A>.
</P>
<P>
Was bedeutet das eigentlich? Viele von Ihnen stellen die wirklich wichtige
Frage ,,Wann kann ich eines dieser neuen, AmigaDE-f&auml;higen Ger&auml;te, kaufen?&quot;.
Ich kann Ihnen sagen, dass Sharp bald seine Ger&auml;te ausliefern wird und die
Tao Group, zusammen mit Sharp, haben Amiga f&uuml;r die komplette
Entwickler-Unterst&uuml;tzung f&uuml;r intentTM auf dem Sharp SL5000D gew&auml;hlt. F&uuml;r
weitere Informationen dazu, wie Sharp, Tao und Amiga zusammen arbeiten,
siehe <A HREF="http://intent-sharp.amigadev.net" TARGET="_top">http://intent-sharp.amigadev.net</A>.
</P>
<P>
Ich habe gerade eben einen Vertrag mit einer der Welt gr&ouml;&szlig;ten Firmen f&uuml;r
Set-Top-Boxen unterzeichnet. Ich kann den Namen bis zur zweiten
Januar-Woche nicht nennen, Sie werden aber erfreut sein.
</P>
<P>
Das AmigaDE l&auml;uft nun auf zahlreichen anderen Ger&auml;ten und viele dieser
H&auml;ndler arbeiten mit uns zusammen, um diese Produkte im ersten Quartal 2002
Realit&auml;t werden zu lassen. Hier einige Beispiel-Videos von nur einigen
dieser Produkte, auf denen das AmigaDE l&auml;uft. Klicken Sie auf ein
Bildschirmfoto, um das MPEG-Video auf Ihren Rechner zu laden, bzw.
anzusehen.
</P>
<P>
AmigaDE SDK 1.1 Das AmigaDE bewegt sich voran und der AmigaDE Player ist
erschienen. Nun k&ouml;nnen wir uns darauf konzentrieren, die gesamte
Entwicklungs-Technologie ins neue SDK ein zu bringen. Viele dieser
Technologien sind bereits im Beta-Stadium und werden von Mitgliedern des
Amiga Developer Network getestet.
</P>
<P>
Zum Beispiel ist unser neues Ami2D nun seit zwei Monaten f&uuml;r einige
Auserw&auml;hlte verf&uuml;gbar. Tats&auml;chlich wurde das neue AmigaDE-Spiel Gobbler von
Pulsar Interacive mit Hilfe dieser Technologie entwickelt. Ami2D ist eine
sehr aufregende Entwicklung und ich glaube, dass DE-Entwickler damit einen
sicheren Vorteil gegen&uuml;ber dem erhalten, was andere Produkte bieten k&ouml;nnen.
</P>
<P>
Noch aufregender ist die enge Zusammenarbeit mit unseren Partnern bei
Hyperion, Ami3D schreitet fort in Richtung Ver&ouml;ffentlichung. Ich habe
Bildschirmfotos vom neuen Ami3D in Aktion gesehen und staunte &uuml;ber
Bildschirme, auf denen feste Gegenst&auml;nde herum flogen und von W&auml;nden
abprallten. Das sind gro&szlig;artige Neuigkeiten, denn durch die Portierbarkeit
von DE-Applikationen und den neuen 2D und 3D Diensten, werden
AmigaDE-Entwickler in der Lage sein, ihre Kreativit&auml;t zu zeigen.
</P>
<P>
Hier herrscht gro&szlig;e Aufregung &uuml;ber unsere neuen, normgebenden Technologien,
die Amiga-Applikationen mit mehr Flexibilit&auml;t und F&auml;higkeiten, als jemals
zuvor liefern wird.
</P>
<P>
Ich wei&szlig;, dass viele von Ihnen &uuml;ber das Fortschreiten von SHEEP gelesen
haben, unserer Programmier-Sprache der n&auml;chsten Generation. Ja, es ist
eine Skript-Sprache, doch es ist gleichzeitig sehr viel mehr als das, und
kann f&uuml;r alles, vom Schreiben kleiner Skripte und Makros, bis hin zur
Erschaffung ausgewachsener Applikationen verwendet werden. Es wird eine
gro&szlig;artige Erg&auml;nzung nicht nur f&uuml;r das DE sein, sondern auch f&uuml;r die
Entwicklung von Applikationen im Allgemeinen und wird sind stolz darauf.
</P>
<P>
F&uuml;gen Sie Dem nun eine Oberfl&auml;che mit neuem Aussehen, intelligente Icons,
neue Entwicklerumgebungen, einen aufregenden und anschaulichen
Oberfl&auml;chen-Dienst genannt PrismTM und eine Masse weiterer Sachen hinzu
und das neue SDK wird den Entwicklern den wahren Vorgeschmack auf die
Zukunft liefern.
</P>
<P>
Obwohl Vertragsverhandlungen immer unter Schweigepflicht (Non Disclosure
Agreements) stehen, kann ich doch sagen, dass es mit den OEMs, mit denen
wir arbeiten, und den bald erscheinenden Ger&auml;ten, welche die
DE-Technologie und dessen Inhalt verwenden werden, es durchaus zu einer
frohen AmigaDE-Weihnacht kommen kann.
</P>
<P><B>Amiga Desktop Fortschritt und eine neue &Uuml;berraschung:</B></P>
<P><B>AmigaOS</B></P>
<P>
Das AmigaOS ist ein &auml;u&szlig;erst wichtiger Punkt in unserer Zukunft. Ich habe
diesen Satz fett gedruckt, weil ich m&ouml;chte, dass die Amiga-Gemeinde ihn
immer wieder liest und in ihre Herzen brennt. Leidenschaftlich und
energisch werden wir das AmigaOS zu einem die Welt erobernden Produkt
entwickeln. Zudem werden wir es leidenschaftlich und energisch gegen jeden
verteidigen, der versucht dem AmigaOS Schaden zuzuf&uuml;gen, es nieder zu
machen oder unrechtm&auml;&szlig;ig pers&ouml;nliche Vorteile daraus zu ziehen.
</P>
<P>
Ich m&ouml;chte mich daf&uuml;r entschuldigen, dass in St. Louis angek&uuml;ndigt wurde,
dass neue AmigaOS-Produkte am 1. November verf&uuml;gbar w&auml;ren. Ich tat dies
mit den besten Vors&auml;tzen, doch viele Faktoren haben zu diesem Ausrutscher
beigetragen, einige schlechte darunter, wie der finanzielle Druck,
verst&auml;rkt durch die Schreckenstat vom 11. September. Einige unerwartete,
wie die Ank&uuml;ndigung des G5, und einige gute Faktoren, wie die Fortschritte
in der Entwicklung der n&auml;chsten Generation, die uns zum erneuten &Uuml;berdenken
unserer &Uuml;berleitung anregten.
</P>
<P>
Die &Uuml;berleitung vom AmigaOne und der erfolgreichen Generation der Plattform
erfordert ein vorsichtiges Vorgehen. Wir haben die &Uuml;berleitungen anderer
Plattformen untersucht, um sicher zu gehen, dass wir versuchen, was andere
richtig gemacht haben und nicht, was andere falsch machten. Der &Uuml;bergang
erfordert tiefgreifende Kenntnisse der Software des AmigaOS3.x und der
Hardware des Classic-Amiga. Wir vertrauen sehr stark auf unsere Partner,
wie sie im Folgenden erkennen werden.
</P>
<P>
Ein weiteres Team entwickelt zurzeit komplett die n&auml;chsten Generation des
Amigas, dessen Design und Daten geheim gehalten werden. Dies geschieht, um
die Ger&uuml;chte gering zu halten und damit sich die Teams ganz darauf
konzentrieren k&ouml;nnen, das AmigaOS 4.0, den AmigaOne und das AmigaDE zum
ersten Vertrieb bzw. zur n&auml;chsten Version zu bringen.
</P>
<P>
Hyperion, Eyetech und die anderen Teams in dieser Partnerschaft sind sehr
besch&auml;ftigt und es gibt viel zu tun f&uuml;r uns alle. Glauben Sie mir, es gibt
kein engagierteres Team auf der Welt, das all das tun k&ouml;nnte. Vor diesem
Hintergrund, und um die langen Zeitr&auml;ume des Schweigens zu verringern, die
daraus resultieren k&ouml;nnen, werden die Executive-Updates in Zukunft
monatlich erscheinen, damit wir mit Ihnen teilen k&ouml;nnen, was wir mit Ihnen
teilen d&uuml;rfen.
</P>
<P>
Dennoch, damit Sie sehen, dass dies alles nicht nur blo&szlig;es Gerede ist, hat
Amiga eine Partner-Firma von au&szlig;erhalb engagiert, die uns eine
unglaubliche Tiefe liefert und &uuml;ber eine lange Geschichte der Erschaffung
allerbester Designs verf&uuml;gt. Diese Firma ist Design Genetix und deren Team
hat uns bereits bewiesen, dass sie f&uuml;r unsere Designs der n&auml;chsten
Generation von Hardware gro&szlig;artig passen. Sie werden uns auch bez&uuml;glich
der Herstellung durch Dritt-Firmen zur Seite stehen.
</P>
<P>
Design Genetix hat mit der Ver&ouml;ffentlichung von Hunderten von Produkten,
transportable Ger&auml;te, Desktops und Server, mehr als 400 Preise gesammelt.
Sie verf&uuml;gen &uuml;ber die Erfahrungen aus wachsenden Produkt-Linien im Wert
von 2,4 bis &uuml;ber 17 Milliarden US-Dollar im Zeitraum von f&uuml;nf Jahren.
AmigaOne:
</P>
<P>
Eyetech und deren Team machen gro&szlig;artige Fortschritte beim AmigaOne-Board.
Wir haben fertige Arbeiten in Sachen Geh&auml;use-Design f&uuml;r einen AmigaOne und
einen A1200 gesehen. Dieses Projekt kommt derzeit in seine letzte Phase und
es ist uns eine Freude, dabei Teilnehmer zu sein. Ja, es war ein langes
Warten auf die n&auml;chste Generation von Amiga-f&auml;higer Hardware, doch
zweifeln Sie nicht, dass der AmigaOne sehr real ist und ein Produkt sein
wird, das Sie werden kaufen k&ouml;nnen und aus dem Amiga etwas entwickeln
wird, auf das wir alle stolz sein k&ouml;nnen. F&uuml;r Informationen zum AmigaOne
siehe <A HREF="http://www.eyetech.co.uk/news.php" TARGET="_top">http://www.eyetech.co.uk/news.php</A>.
</P>
<P><B>AmigaOS 4.0:</B></P>
<P>
Das AmigaOS4.0 wird Zeuge werden, wie die Software-Umgebung auf den
AmigaOne verlegt wird, wo sie verbessert werden wird, um aus den neuen
F&auml;higkeiten der Hardware alle Vorteile ziehen zu k&ouml;nnen. Das AmigaOS4.0
wird au&szlig;ergew&ouml;hnliche Verbesserungen in der Leistung bieten, weil ein
gro&szlig;e Zahl der physikalischen Abh&auml;ngigkeiten auf dem A1200/A4000 wegfallen
werden. Die Stabilit&auml;t wird verbessert, weil die Hardware von Grund auf neu
entwickelt wird, und es wird gro&szlig;artige, neue Features bieten, durch die
Entwickler mit den angebotenen Applikationen gro&szlig;e Fortschritte werden
erreichen k&ouml;nnen.
</P>
<P>
Damit sich Amiga Inc. auf die n&auml;chste Generation, auf das AmigaDE
konzentrieren kann, und wegen der engen Integration des AmigaOS4.0 mit dem
AmigaOne von Eyetech, haben wir das Produkt-Management von AmigaOS4.0 nach
Hyperion Entertainment ausgelagert, eine der angesehensten
Software-Entwickler in der Amiga-Gemeinschaft. F&uuml;r Informationen zu OS4.0
siehe <A HREF="http://www.hyperion" TARGET="_top">http://www.hyperion</A> entertainment.com/_amiga/index.html.
</P>
<P>
Sie werden eng mit Eyetech, Haage &amp; Partner und all unseren
AmigaOS-Partnern in dem Projekt zusammen arbeiten und dabei sicher
stellen, dass die Kombination aus AmigaOne und AmigaOS4.0 zeitig und als
Qualit&auml;tsprodukt den Markt erreichen wird. F&uuml;r Informationen zu Haage &amp;
Partner siehe <A HREF="http://www.haage-partner.com/support-d.htm" TARGET="_top">http://www.haage-partner.com/support-d.htm</A>.
</P>
<P><B>Fazit:</B></P>
<P>
Neulinge in der Software-Industrie sind sich h&auml;ufig nicht bewusst, welchen
Einfluss Amiga auf die Computer-Industrie hatte. Doch mit dem Erscheinen
des DE Players und mit Sicht auf den neuen Inhalt, sowie auf den AmigaOne
und OS4.0, beginnt sich das zu &auml;ndern. Wir arbeiten hart, um diesen
Prozess zu beschleunigen und jeder von Ihnen kann seine Rolle dabei
spielen, um den Erfolg Ihres Computers und Ihrer Gemeinschaft
sicherzustellen.
</P>
<P>
Ich sage Ihnen das, weil ich Ihre Hilfe brauche. Ich brauche jeden von
Ihnen, um die Leute daran zu erinnern, zu den Treffen zu kommen. Ich
brauch Sie, um die Leute in Ihren B&uuml;ros oder in Ihrer Nachbarschaft zu
erinnern, die Windows oder Linux laufen haben. Ich brauche Sie, um in
Ihren lokalen Zeitungen nachzusehen, wer die Wirtschaftsseiten und wer die
Technikseiten schreibt, und diesen Leuten dann vom AmigaDE zu erz&auml;hlen.
</P>
<P>
Ich brauche Sie, um diesen Leuten von einer Technologie zu erz&auml;hlen, die es
erlaubt, dieselben Inhalte ohne &Auml;nderungen auf zahlreichen Ger&auml;ten zu
starten. Ich brauche Sie, um diesen Leuten zu sagen, wie sie Linux oder
Windows einsetzen und Amiga-Inhalte auf jeder Maschine starten k&ouml;nnen. Ich
brauche Sie, um diese Leute daran zu erinnern, dass das Meiste der
derzeitigen Inhalte f&uuml;r PDAs gemacht sind, und um sie zu bitten, das, was
sie auf PDAs oder anderen Handheld-Spielesystemen gesehen haben, mit dem
zu vergleichen, was die Amiga-Gemeinschaft zurzeit aufbaut. Ich brauche
Sie, um die Entwickler zu unterst&uuml;tzen, die Inhalte f&uuml;r den Amiga auf jede
m&ouml;gliche Weise erschaffen.
</P>
<P>
Ich wei&szlig;, es gibt Tausende in der Amiga-Gemeinschaft, die helfen wollen.
Ich bekomme t&auml;glich E-Mails, in denen ich gefragt werde, wie man helfen
kann. Nun, der AmigaDE Player ist ein gro&szlig;er Schritt f&uuml;r uns und f&uuml;r die
vielen Entwickler, die Inhalte daf&uuml;r erschaffen haben. Weitere Tausende
arbeiten zurzeit an neuen Inhalten! An die, die den DE Player haben ...,
kaufen Sie ein Spiel und geben Sie uns dann R&uuml;ckmeldung. Das ist er erste
Schritt in unserer Reise nach Vorn und unser erster Schritt gemeinsam in
diese Zukunft.
</P>
<P>
Es passieren viele aufregende Dinge bei Amiga und in den n&auml;chsten sechs
Monaten wird all unsere harte Arbeit langsam beginnen, in der Welt
aufzutauchen. Ich w&uuml;rde es Ihnen so gerne sagen, doch aus vielen Gr&uuml;nden
kann ich ihnen den Gro&szlig;teil, von dem was vorgeht, einfach nicht erz&auml;hlen.
Seien Sie sicher, dass mein Team und ich unser Leben und unsere Seele in
Amiga investieren, und dass unsere Geduld und Loyalit&auml;t belohnt werden
wird.
</P>
<P>
Jetzt brauche ich Ihre Hilfe, um die guten Nachrichten &uuml;ber den AmigaDE
Player zu verbreiten. Seine Einfachheit macht ihn ideal f&uuml;r Senioren,
Eltern und Kinder, f&uuml;r Leute die einen Computer haben, Spiele genie&szlig;en,
aber die Technology f&uuml;rchten. Seine Portierbarkeit macht ihn perfekt f&uuml;r
Entwickler, die so viele M&auml;rkte wie m&ouml;glich, bzw. ein m&ouml;glichst gro&szlig;es
Publikum erreichen wollen.
</P>
<P>
Gehen sie zu <A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>, kaufen Sie ein paar der Spiele und
erz&auml;hlen Sie dann jedem den Sie kennen, wie portierbar und skalierbar
Amiga ist, dass es m&ouml;glich ist, dieselben Inhalte auf zahlreichen,
unterschiedlichen Ger&auml;ten und Produkten zu liefern. Es gibt keinen
anderen, der ein Produkt so darstellen kann. Seien Sie stolz und zeigen
Sie es.
</P>
<P>
Ich verspreche, dass es nicht noch einmal 6 Monate dauern wird, bis Sie
wieder von mir h&ouml;ren. Es lag nur daran, dass der Tag nur 24 Stunden hat
und wir bisher daraus immer 36 Stunden gemacht haben, damit das Alles
geschehen kann.
</P>
<P>
Fr&ouml;hliche Weihnacht, Gottes Segen, und weiter so in 2002!
</P>
Bill McEwen und der Rest das Amiga-Teams<BR>
<A HREF="http://www.amiga.com" TARGET="_top">http://www.amiga.com</A><BR>
<A HREF="http://www.amigadev.net" TARGET="_top">http://www.amigadev.net</A><BR>
<A HREF="http://www.de.amiga.com" TARGET="_top">http://www.de.amiga.com</A><BR>
<A HREF="http://intent-sharp.amigadev.net" TARGET="_top">http://intent-sharp.amigadev.net</A>&laquo;<BR>
<P>
Das Original des Executive Updates mit den im Text erw&auml;hnten Screenshots
ist &uuml;brigens auf <A HREF="http://www.amiga.com/corporate/231201-mcewen.shtml" TARGET="_top">http://www.amiga.com/corporate/231201-mcewen.shtml</A> zu
finden, und die deutsche Version des Artikels ist auch unter der URL
<A HREF="http://www.amiga-news.de/exup231201_d.shtml" TARGET="_top">http://www.amiga-news.de/exup231201_d.shtml</A> verf&uuml;gbar.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
