<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Review: Earth 2140 Mission Pack</H2>
<P><B>Der Krieg geht weiter</B></P>
<P>
Mit Earth 2140 haben epic-interactive den Thron der RTS-Spiele am Amiga
erobert. Nun gilt es diesen zu best&auml;tigen.
</P>
<P>
Direkt nach dem Erscheinen wurde Earth von allen getestet. Aufgrund des
durchdachten Gameplays, der hervorragenden Grafik und der hohen
Spielgeschwindigkeit durch konsequente Nutzung von Grafikkarten und des PPC
spielte sich Earth direkt auf Platz 1 der Echtzeitstrategiespiele.
Lediglich eine Sache stie&szlig; mir damals extrem auf und das war die fehlende
Netzwerkf&auml;higkeit. Nun, seitdem sind einige Monate ins Land gegangen und
mein Gem&uuml;t (ich war echt stocksauer damals) hat sich wieder etwas gelegt.
So habe ich halt die Einzelspielermodi durchgezockt.
</P>
<P>
Und nun ist von Epic ein Mission Pack erschienen. Er hei&szlig;t &quot;Final
Conflict&quot;, enth&auml;lt die PC Mission Packs 1 &amp; 2 (also 80 neue Einzel- und 30
neue Mehrspielerlevel) sowie ENDLICH die Netzwerkunterst&uuml;tzung.
</P>
<P>
Der erste Eindruck ist ja bekanntlich der wichtigste und dieser ist bei dem
Mission Pack etwas zweischneidig.
</P>
<P>
Zum einen kommt das Spiel in einem optisch anspruchsvollen Jewel-Case mit
professionellem Druck daher. Schaut schon mal gut aus.
</P>
<P>
Leider fehlt ein Booklet, welches ein bisschen in die weitere Story
einf&uuml;hrt. War bei Earth noch eine komplexe Story zu lesen, ersch&ouml;pfen sich
die Infos hier auf einen kurzen Introtext (&quot;Du hast zahlreiche Schlachten
gewonnen, aber der Krieg ist noch l&auml;ngst nicht vorbei. Wieder werden
tapfere Feldherren gesucht, um die beiden Armeen von Sieg zu Sieg zu
f&uuml;hren. F&uuml;hlst du dich der Herausforderung gewachsen?&quot;) und der
Installationsanleitung. Ach, apropos Installation. Die CD liegt im Joliet-
Format vor. Das habe ich doch schon mal irgendwo geh&ouml;rt? Genau: Mit diesem
Format gab es schon bei Nightlong Schwierigkeiten, da nicht alle Amiga-
Filesysteme dieses lesen k&ouml;nnen.
</P>
<P>
Ich habe diese Probleme (seit Nightlong) nicht und klicke auf den Installer.
Es wird nach dem vorhandenen Earth-Ordner und der zu installierenden
Sprache gefragt. Wei&szlig; ich doch alles: Spiele:Earth2140 und Deutsch.
Denkste! Der Ordner war nat&uuml;rlich richtig, aber bei der Sprache ist nicht
nach meiner gefragt, sondern nach der installierten - wenn jemand z.B. die
deutschen Files auf seinem System hat. Es soll zwar auch der deutsche
Mission Pack auf dem englischen Originalprogramm laufen, aber dies tat es
(zumindest bei mir) nicht. Es scheint wohl ein Problem bei der Installation
zu sein. Aber es trat noch ein kleiner (Fl&uuml;chtigkeits)fehler auf:
Bei den Starterprogrammen hat sich ein kleiner Irrtum eingeschlichen. Wenn
ich dort doppelklicke, erscheint eine Fehlermeldung. Ziehe ich das Programm
in meinen Editor, sehe ich dort folgendes: stack65536earth2140.wos.exe x800
Hier fehlt ein Absatz. Richtig m&uuml;&szlig;te es hei&szlig;en: stack65536 <RETURN>
earth2140.wos.exe x800. Ihr braucht dies einfach in eurem Editor zu &auml;ndern
oder ihr zieht die Icons von der Original-CD in den Spieleordner. Und bevor
es losgeht, noch ein kleiner Hinweis: Nach der Installation der Mission
Packs nicht mehr den Voodoo-Patch installieren. Dieser l&ouml;scht dann wieder
die Packs (es geht nun auch ohne).
</P>
<P><B>Das Intro begeistert mich immer wieder!</B></P>
<P>
Sp&auml;testens nachdem ich das Intro wieder gesehen habe, wei&szlig; ich, weshalb
Earth so gut ist. Es stimmt einfach alles hier. Die Grafik wei&szlig;
wirklich zu &uuml;berzeugen, und der Sound.....
</P>
<P>
Stimmt, dar&uuml;ber habe ich mich ja schon mal ausgelassen. Ich werde hier
nat&uuml;rlich nicht noch einmal auf die technische Seite des Spiels eingehen.
Die zus&auml;tzlichen Missionen haben denselben grafischen Standard wie die
Vorg&auml;nger. Der Schwierigkeitsgrad ist meiner Meinung nach ein bisschen
gewachsen (aber nat&uuml;rlich nach wie vor variabel), aber das sollte meiner
Meinung nach bei einem Mission Pack auch so sein.
</P>
<P>
Es stehen sechs neue Einheiten und zwei neue Geb&auml;ude zur Verf&uuml;gung, aber
leider habe ich weder auf der CD noch auf der Homepage N&auml;heres hierzu
gefunden. Auch ist die Atmosph&auml;re zumindest am Anfang ein bisschen d&uuml;rftig,
da ja diesmal keine Hintergrundstory ins Geschehen einstimmt.
</P>
<P>
Aber sp&auml;testens nach der ersten Schlacht (Piece of Cake im Mission Pack 1
auf Seite der Eurasian Dynasty ist hier zu empfehlen) wei&szlig; man wieder, wo
man ist: im besten Realtime-Strategy-Spiel auf dem Amiga.
</P>
<P>
 <A HREF="img/earth1.jpg"><IMG SRC="thumb/earth1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
 <A HREF="img/earth2.jpg"><IMG SRC="thumb/earth2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
 <A HREF="img/earth3.jpg"><IMG SRC="thumb/earth3.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P><B>Das Fazit</B></P>
<P>
Was soll ich hierzu sagen? Da man f&uuml;r das Spiel die Originalversion von
Earth ben&ouml;tigt, richtet sich dieses Fazit an die Besitzer dieser CD. Wer
Earth 2140 also nicht gut fand, weil er das Genre nicht mag oder einen zu
lahmen Rechner hat, der wird auch an dem Mission Pack keine Freude haben.
Es hat sich weder im Gameplay noch grafisch Gravierendes getan. Wer
allerdings Earth liebt und schon alle Missionen durchgezockt hat oder sich
(wie ich) ge&auml;rgert hatte, da&szlig; er nie gegen einen Freund zocken konnte, f&uuml;r
den ist der Mission Pack eine Freude.
</P>
<P>
Der Preis geht in Ordnung, da sich ja nicht nur das Mehrspielerupdate auf
der CD befindet, sondern auch beide f&uuml;r den PC erschienene Erweiterungen.
Und achtzig Level m&uuml;ssen erst einmal bew&auml;ltigt werden.
</P>
<P>
Auf die kleinen Fehler bei der Installation m&ouml;chte ich nur noch am Rande
hinweisen. Sie konnten schnell behoben werden, und das nicht zuletzt dank
des gro&szlig;artigen und schnellen Supports von epic-interactive.
</P>
<P><B>Der Krieg geht weiter!</B></P>
<P><B>J&uuml;rgen Theiner &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
