<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Der Zwischenruf
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P><B>Der Herr der (Boing-)B&auml;lle</B></P>
<P>
Selten kommen am Jahresanfang so viele &Auml;nderungen auf uns zu wie im Jahr
2002. In Teilen Europas h&auml;lt der EURO und der Cent Einzug in die monet&auml;re
Gesellschaft. Durch die bessere Vergleichbarkeit der Preise werden sich f&uuml;r
den Konsumenten sicher geldwerte Vorteile ergeben.
</P>
<P>
Aber auch im angestammten Amiga-Sektor werden diverse interessante
Neuerungen Einzug halten. Wie k&uuml;rzlich in einem Interview zu lesen war,
wird bplan ihr Pegasos-Board u.a. mit MorphOS ausliefern. Die Entwickler
sind sich sicher, dass MorphOS ein legitimer Nachfolger des AmigaOS ist.
</P>
<P>
Bei Amiga dagegen schmei&szlig;t man sich - nach Aussage von Bill McEwen - bei
der Entwicklung des &quot;wirklich einzig&quot; wahren AmigaOS in die Vollen.
</P>
<P>
Haage &amp; Partner hat bereits letztes Jahr einen evolution&auml;ren Schritt in die
Richtung des wahren AmigaOS getan.
</P>
<P>
Von (bisher) drei Richtungen werden wir nun also mit Reinkarnationen des
einzig Wahren beworfen. Auch wenn u.a. der Hinduismus von solchen Wundern
spricht.....im Amiga-Markt ist er unangebracht.
</P>
<P>
In einem Interview der &quot;Amiga-topcool&quot; war zu lesen, dass es offensichtlich
bewusste Ausbremsungen zwischen den einzelnen Firmen gab und gibt.
</P>
<P>
Bei allem (teils auch blindem) Aktionismus der Beteiligten darf der
Konsument aber eines nicht vergessen: Er zahlt. Auch Fehlentwicklungen
werden in die Bilanzen der Firmen einflie&szlig;en. Und da diese Kosten ja nicht
einfach auf wundersame Weise in den Weltraum entschwinden und als Kometen
ihre endlosen Bahnen im Sonnensystem drehen, werden wir uns wohl auch an
entsprechende Preiskalkulationen gew&ouml;hnen m&uuml;ssen.
</P>
<P>
Scheinbar ist's mit der betriebswirtschaftlich notwendigen Vernunft nicht
weit her. Erinnerungen an den Film &quot;Star Trek II - Der Zorn des Kahn&quot;
werden da wach. Pers&ouml;nliche Rachegef&uuml;hle der Akteure scheinen da mehr
vorzuherrschen als eine objektive Betrachtung der Situation. Gek&auml;mpft wird
bis zum letzten.
</P>
<P>
Die/der eine oder andere Amiga-User wird die Konsequenz ziehen, allen
Firmen endg&uuml;ltig den R&uuml;cken zuzukehren. Und der verbliebene Rest, der
ber&uuml;hmte Tropfen auf dem hei&szlig;en Stein, wird sich bis zum letzten Funkenflug
seines Amigas mit dieser l&auml;cherlichen Situation rum&auml;rgern m&uuml;ssen.
</P>
<P>
Es sei denn, eine unabh&auml;ngige Instanz wird f&uuml;r die Entwicklung des AmigaOS
benannt. Als sogenanntes &quot;Open-Source&quot;-Betriebssystem k&ouml;nnte Amiga
tats&auml;chlich wieder frei zappeln. Hierf&uuml;r k&ouml;nnten vorhandene Strukturen wie
AROS (strukturell angepasst und ausgebaut) genutzt werden.
</P>
<P>
Und wo liegt nun die Gemeinsamkeit mit dem EURO? Nun ja, etwas weit
hergeholt zwar, aber: Das neue Geld schaut sehr schick aus. Vielleicht
gef&auml;llt mir ein frei entwickelter Desktop ja besser als ein System, das aus
Gez&auml;nk und Streit der Akteure entstanden ist.
</P>
<P><B>Lebt lang und erfolgreich</B></P>
<P><B>Euer</B></P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
