<html>
 <head>
  <title>ICQ</title>
  <meta name="author" CONTENT="David Brunet obligement@free.fr">
 </head>

<body bgcolor="#000000" text="#cccccc" link="#cccc33" vlink="#aaaa22" alink="#cccccc" marginheight="0" marginwidth="0" topmargin="5" leftmargin="0">

<a name="top">

<map name="ObMap">
  <area shape="rect" coords="0,0,760,82" href="http://obligement.free.fr">
  <area shape="rect" coords="8,87,62,104" href="../index.html" alt="Intro">
  <area shape="rect" coords="80,87,168,104" href="edito.html" alt="Editorial">
  <area shape="rect" coords="186,87,278,104" href="apropos.html" alt="A Propos">
  <area shape="rect" coords="296,87,399,104" href="sommaire.html" alt="Sommaire">
  <area shape="rect" coords="414,87,473,104" href="quizz.html" alt="Quizz">
  <area shape="rect" coords="491,87,589,104" href="musiques.html" alt="Musiques">
  <area shape="rect" coords="607,87,648,104" href="pub.html" alt="Pub">
  <area shape="rect" coords="666,87,756,104" href="archives.html" alt="Archives">
</map>

<table align="center" valign="top" width="760" height="100%" background="../gfx/fondsommaire.jpg" bgcolor="#112233" cellspacing="0" cellpadding="0">
 <tr>
  <td align="center">
   <img src="../gfx/oblogo.jpg" ismap usemap="#ObMap" border="0" height="108" width="760" alt="Obligement">

   <br><br><br>
   <table align="center" width="75%">
    <tr>
     <td>

<div align="center"><font size="+3">Dossier&nbsp;: l'ICQ </font>par&nbsp;<a href="mailto:niffo@free.fr">Nicolas&nbsp;Gressard</a></div><br><br><br>

<div align="center">
<img height="414" width="173" alt="ICQ" src="../gfx/icq_mirabilis.gif"><br><br>
</div>

<font size="+1" color="#ccbb33">ICQ ou la messagerie instantann&eacute;e</font><br><br>

"ICQ" se prononce "I seek you", ce qui signifie "je te cherche" en
traduction litt&eacute;rale. ICQ est un syst&egrave;me de messagerie
instantan&eacute;e sur Internet cr&eacute;&eacute; en
d&eacute;cembre 1996 par la soci&eacute;t&eacute; Isra&eacute;lienne
Mirabilis, elle m&ecirc;me fond&eacute;e 4 mois auparavant.<br>

Le principe de fonctionnement est simple&nbsp;: un petit programme tourne en
t&acirc;che de fond sur votre ordinateur et se r&eacute;veille lorsque
quelqu'un cherche &agrave; vous joindre. Il vous est alors possible de
communiquer avec le correspondant &agrave; la mani&egrave;re des
dialogues en ligne &eacute;galement appel&eacute;s "chats" (prononcez
"tchate"). Inversement, il vous est possible de "voir" lesquels de vos
contacts sont en ligne &agrave; l'instant "t" et de les appeler ou de
leur envoyer un message qu'ils recevront lorsqu'ils seront en ligne.<br><br>

ICQ fut le premier protocole &agrave; offrir ce type de service et
resta largement leader pendant 3 ou 4 ans avec plus de 12 millions
d'utilisateurs. La soci&eacute;t&eacute; AOL, qui venait de lancer son
propre programme de messagerie instantan&eacute;e (AOL Instant
Messenger), racheta Mirabilis en juin 1998 pour 287 millions de
dollars. AOL
n'enterra pas le syst&egrave;me et continue aujourd'hui encore &agrave;
le d&eacute;velopper. La page officielle du logiciel se trouve ici&nbsp;:
<a href="http://www.icq.com" target="_blank">www.icq.com</a>.<br><br>

Il est important de ne pas confondre ICQ et IRC. En effet, IRC est un
protocole bien plus ancien et si celui-ci repose
&eacute;galement sur un syst&egrave;me de "chat", son principe n'est
pas le m&ecirc;me. IRC permet de se connecter &agrave; des salons
virtuels de discution ou plusieurs intervenant sont en ligne. Il est
donc n&eacute;cessaire de faire la d&eacute;marche de se connecter
&agrave; un salon pr&eacute;cis &agrave; une heure pr&eacute;cise. La
diff&eacute;rence entre ICQ et IRC est environ la m&ecirc;me qu'entre
le t&eacute;l&eacute;phone et une salle de r&eacute;union&nbsp;;).<br><br>

Les autres protocoles de messagerie instantan&eacute;e actuellement
les plus utilis&eacute;s son&nbsp;:<br>

<ul>
<li>AIM&nbsp;: AOL Instant Messenger</li>
<li>MSN Messenger&nbsp;: logiciel de Microsoft</li>
<li>Jabber&nbsp;: protocole libre de messagerie instantan&eacute;e relativement r&eacute;cent comportant des
passerelles vers les autres protocoles</li>
</ul>
<br>

<font size="+1" color="#ccbb33">L'ICQ, comment &ccedil;a marche&nbsp;?</font><br><br>

Une base de donn&eacute;e gigantesque pr&eacute;sente sur les serveurs
de Mirabilis (aujourd'hui AOL) centralise les millions de comptes
utilisateurs. Toutes les informations pr&eacute;sentes dans cette base
de donn&eacute;es sont facultatives &agrave; l'exception du
num&eacute;ro ICQ. Il vous est cependant possible de renseigner vos
nom, pr&eacute;nom, pseudonyme, adresse, etc. afin que d'autres
utilisateurs puissent trouver votre num&eacute;ro ICQ en faisant une
recherche sur ces crit&egrave;res. Autrement dit, c'est un annuaire. En
l'absence de ces informations dans votre compte ICQ, un interlocuteur
ne pourra vous joindre qu'en connaissant directement votre
num&eacute;ro ICQ (quand je vous disais que &ccedil;a ressemblait au
t&eacute;l&eacute;phone&nbsp;;).<br><br>

Alors que pendant longtemps, le seul moyen de converser avec d'autres
personnes reli&eacute;es au r&eacute;seau ICQ &eacute;tait d'installer
le logiciel de Mirabilis (photo en d&eacute;but d'article), il y a
aujourd'hui plusieurs logiciels-client impl&eacute;mentant le protocole de fa&ccedil;on plus
ou moins compl&egrave;te.<br><br>

Avant de pouvoir utiliser ce protocole de messagerie, il vous est
donc n&eacute;cessaire de cr&eacute;er un compte. Cette d&eacute;marche
aura pour effet de vous affecter un num&eacute;ro ICQ (#UIN).<br><br>

Il y a au moins deux mani&egrave;res de vous cr&eacute;er un compte&nbsp;:<br>

<ul>
<li>En passant par le site de ICQ.</li>
<li>Directement &agrave; partir de votre client ICQ si ce dernier le permet.</li>
</ul>
<br>

(Il y a &eacute;galement au moins deux mani&egrave;re de rechercher
quelqu'un dans l'annuaire ICQ et ce sont les m&ecirc;mes)<br><br>

Une fois que votre compte est cr&eacute;&eacute;, il faut informer
votre client ICQ de votre num&eacute;ro ICQ et de votre mot de passe (ben
oui, sinon n'importe qui peut se faire passer pour vous, allons&nbsp;!).
Votre client ICQ restera ensuite en t&acirc;che de fond et informera
r&eacute;guli&egrave;rement le serveur situ&eacute; chez AOL de votre
pr&eacute;sence en ligne ou non. Les autres utilisateurs pourront alors
voir si vous &ecirc;tes actuellement joignable ou non.<br><br>

Un des gros attraits de ce type de protocole (dialoguant avec un
serveur) est qu'il n'est pas g&ecirc;n&eacute; par les routeurs,
passerelles et autre firewalls (sauf trop bien configur&eacute;s)
puisque la connexion est toujours initi&eacute;e par le client.<br><br>

<font size="+1" color="#ccbb33">Les clients ICQ sur Amiga</font><br><br>

Il n'existe malheureusement pas de bons clients ICQ sur Amiga et de
surcro&icirc;t, plus aucun d'entre eux n'est maintenu &agrave; ce jour.
Voici ceux qui ont exist&eacute;&nbsp;:<br><br>

- DICQ (Digitalis ICQ)&nbsp;: client abandonn&eacute; depuis longtemps et
introuvable &agrave; ce jour.<br><br>

- DCICQ&nbsp;: ce client est difficile &agrave; trouver. On peut
n&eacute;anmoins encore le r&eacute;cup&eacute;rer ici&nbsp;:
<a href="http://members.tripod.com/%7Eamigaicq/ftp/dc-gticq.lha" target="_blank">members.tripod.com/~amigaicq/ftp/dc-gticq.lha</a>.<br><br>

<div align="center">
<img src="../gfx/icq_dcicq.gif" alt="DCICQ" width="82" height="202"><br><br>
</div>

- ICQ Pager&nbsp;: client ICQ en ligne de commande extr&ecirc;mement difficile &agrave; trouver.<br><br>

<div align="center">
<img src="../gfx/icq_pager.gif" alt="ICQPager" width="254" height="151"><br><br>
</div>

- MICQ&nbsp;: client ICQ en mode texte trouvable sur Aminet.<br><br>

<div align="center">
<img height="96" width="287" alt="MICQ" src="../gfx/icq_micq.gif"><br><br>
</div>

- StrICQ&nbsp;: le dernier client ICQ qui a &eacute;t&eacute; maintenu.
Avec son interface sous MUI, c'est &eacute;galement certainement le
plus abouti. Son d&eacute;veloppement a &eacute;t&eacute; d&eacute;finitivement
arr&ecirc;t&eacute; en mars 2002 et il souffre encore de probl&egrave;mes qui rendent son
utilisation tr&egrave;s "sportive". Son site officiel se trouve ici&nbsp;:
<a href="http://www.stricq.com/" target="_blank">www.stricq.com/</a>.<br><br>

<div align="center">
<img height="183" width="150" alt="StrICQ" src="../gfx/icq_stricq.gif"><br><br>
</div>

Voil&agrave;, nous avons fait le tour&nbsp;:(. Vous allez me dire "et on fait
comment alors pour se connecter depuis un Amiga dans de bonnes
conditions&nbsp;?". L'alternative est d'utiliser un client Jabber et de
mettre en oeuvre la formidable capacit&eacute; de ce syst&egrave;me &agrave;
dialoguer avec les autres protocoles. Cela tombe bien puisque nous avons
justement un excellent client Jabber sur Amiga nomm&eacute; JabberWocky.<br><br>

<font size="+1" color="#ccbb33">Utiliser JabberWocky pour acc&eacute;der au r&eacute;seau ICQ</font><br><br>

JabberWocky est un client Jabber MUI open-source disponible sous la licence GPL.
Vous pouvez r&eacute;cup&eacute;rer la derni&egrave;re version de ce programme sur son site officiel&nbsp;:
<a href="http://jabberwocky.amigaworld.de/" target="_blank">jabberwocky.amigaworld.de/</a>.<br><br>

JabberWocky ne n&eacute;cessite pas d'installation et est fourni en standard
avec le support de 8 langues dont le Fran&ccedil;ais (merci l'Ours&nbsp;:).
Attention cependant &agrave; bien avoir install&eacute; les classes MUI
dont il a besoin (NList, TextInput, MailText, TextEditor) sinon vous
aurez des surprises lors de son utilisation. Apr&egrave;s
d&eacute;compactage de l'archive Lha, double cliquez
simplement sur l'ic&ocirc;ne "JabberWocky" pour lancer le programme. La
fen&ecirc;tre ci-dessous s'ouvre alors&nbsp;:<br><br>

<div align="center">
<img height="221" width="294" alt="Jabber_Login" src="../gfx/icq_jabber1.gif"><br><br>
</div>

Cette fen&ecirc;tre sert &agrave; la fois &agrave; cr&eacute;er un
compte Jabber sur un serveur et &agrave; s'authentifier. La
premi&egrave;re chose &agrave; faire est donc de se cr&eacute;er un
compte. Pour cela, vous allez devoir choisir un serveur &agrave;
utiliser dans la liste se trouvant ici (attention &agrave; bien choisir
un serveur supportant le transport ICQ)&nbsp;:
<a href="http://www.jabber.org/user/publicservers.php" target="_blank">www.jabber.org/user/publicservers.php</a>.
Votre ID Jabber sera de la forme "pseudo_de_votre_choix@nom_du_serveur". Entrez votre ID dans le champ
pr&eacute;vu &agrave; cet effet et choisissez un mot de passe que vous
entrerez dans le champ du dessous. Cliquez ensuite sur le bouton
"S'enregistrer" afin de vous cr&eacute;er un compte sur le serveur.
Pour les utilisateurs de MorphOS, il est impossible de voir ce que l'on
tape dans le champ "mot de passe"&nbsp;: il faut donc op&eacute;rer en
aveugle. Il est &eacute;galement possible d'&eacute;diter et de
modifier directement le fichier de configuration XML nomm&eacute;
"account.xml" puisque le mot de passe s'y trouve en clair&nbsp;;).<br>
Vous &ecirc;tes normalement maintenant connect&eacute; au serveur
Jabber, et JabberWocky a d&ucirc; pousser un petit cri accompagnant un
message de bienvenue.<br><br>

<div align="center">
<img height="361" width="298" alt="Jabber_Main" src="../gfx/icq_jabber2.gif"><br><br>
</div>

Passons maintenant aux choses s&eacute;rieuses en param&eacute;trant le
"transport" ICQ. Si vous ne disposez pas d&eacute;j&agrave; d'un compte ICQ, vous pouvez
en cr&eacute;er un ici&nbsp;: <a href="http://go.icq.com/register" target="_blank">go.icq.com/register</a>.
Ouvrez ensuite le menu "Fen&ecirc;tre/Agents".<br><br>

<div align="center">
<img height="307" width="405" alt="Jabber_Agent" src="../gfx/icq_jabber3.gif"><br><br>
</div>

S&eacute;lectionnez le transport ICQ et cliquez sur "S'enregistrer".
Une fen&ecirc;tre s'ouvre alors vous invitant &agrave; entrer vos
num&eacute;ro et mot de passe ICQ (n'oubliez pas le "enter"
apr&egrave;s le mot de passe). Pour finir, vous allez recevoir une demande
d'enregistrement pour le transport de la part du serveur, qu'il faut
accepter. Si vous aviez d&eacute;j&agrave; un compte ICQ, vous allez
voir appara&icirc;tre comme par magie vos contacts dans la
fen&ecirc;tre principale de JabberWocky. En effet, ces derniers sont stock&eacute;s
sur le serveur Mirabilis et JabberWocky se fait un plaisir de les
r&eacute;cup&eacute;rer.<br><br>

<div align="center">
<img height="367" width="296" alt="Jabber_Main" src="../gfx/icq_jabber4.gif"><br><br>
</div>

Vous &ecirc;tes maintenant en mesure de voir le statut de vos contacts.
La petite lampe allum&eacute;e signifie "en ligne", la petite lampe
&eacute;teinte signifie "hors ligne", une petite enveloppe signifie que
vous avez au moins un message en attente, etc.<br><br>

Toutes les actions sur les contacts se font &agrave; partir du menu
"Liste". Pour ajouter un contact ICQ, il faut aller &agrave; "Liste/Ajouter un contact".
Une fen&ecirc;tre vous invite alors
&agrave; entrer l'ID Jabber ainsi que le nom que vous voulez voir
appara&icirc;tre dans la liste. Pour un contact ICQ, l'ID Jabber est de
la
forme&nbsp;: "num&eacute;ro_ICQ@icq.nom_du_serveur". Il est &eacute;galement
possible de lancer une recherche sur la base de donn&eacute;e
ICQ depuis la fen&ecirc;tre "Liste des agents" en utilisant le bouton
"Rechercher". L'ajout en tant que contact est alors directement
propos&eacute; dans la fen&ecirc;tre pr&eacute;sentant les
r&eacute;sultats de la recherche.<br><br>

Pour envoyer un message ponctuel, double-cliquez simplement sur le
contact. Lorsque le contact n'est pas en ligne, le message est
stock&eacute; sur le serveur Mirabilis et lui est d&eacute;livr&eacute;
d&egrave;s qu'il est &agrave; nouveau en ligne. Pour engager une
conversation de type chat avec un contact, il faut le
s&eacute;lectionner et aller dans le menu "Liste/Discuter".<br><br>

<font size="+1" color="#ccbb33">Liens</font><br><br>

Site ICQ officiel&nbsp;: <a href="http://web.icq.com/" target="_blank">web.icq.com</a>.<br>
Ancienne page Amiga ICQ&nbsp;: <a href="http://members.tripod.com/%7Eamigaicq/download.html" target="_blank">members.tripod.com/~amigaicq/download.html</a>.<br>
Site de StrICQ&nbsp;: <a href="http://www.stricq.com/" target="_blank">www.stricq.com/</a>.<br>
Site officiel de JabberWocky&nbsp;: <a href="http://jabberwocky.amigaworld.de/index.php" target="_blank">jabberwocky.amigaworld.de/index.php</a>.<br>
Page SourceForge de JabberWocky&nbsp;: <a href="http://sourceforge.net/projects/ajabberwocky" target="_blank">sourceforge.net/projects/ajabberwocky</a>.<br>
Site de Jabber&nbsp;: <a href="http://www.jabber.org/" target="_blank">www.jabber.org/</a>.<br><br>

<font size="+1" color="#ccbb33">Conclusion</font><br><br>

Une fois de plus, je vais pouvoir conclure cet article en disant que
dans le domaine du r&eacute;seau nous avons tout ce qu'il nous faut sur
Amiga. Cependant, heureusement que JabberWocky a pris depuis peu la
rel&egrave;ve car il y a deux ans nous avons bien failli devoir parler
au pass&eacute; de la messagerie instantan&eacute;e sur notre plate-forme.<br><br>

<b>Note&nbsp;: cet article est &eacute;galement disponible sur le site <a href="http://amigaenreseau.free.fr" target="_blank">amigaenreseau.free.fr</a></b>.<br><br><br>

<div align="center"><a href="#top">Retour en haut</a> | <a href="sommaire.html">Retour au sommaire</a></div><br><br> 


     </td>
    </tr>
   </table>
  </td>
 </tr>
</table>


</body>
</html>
