<HTML><HEAD>
<TITLE>Amiga Aktuell 08/97 - Gewinnspiel</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 08/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>
<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">
<TABLE>
<TR>
<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>
<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" ALT="Auswahl - dies Bild bitte laden"WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=TOP>
</TD>
<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Das AMIGA-aktuell-Gewinnspiel</H2>
<H3>Endlich! Der Durchbruch scheint geschafft. Nachdem die Zahl der Teilnehmer
in den letzten Monaten regelm&auml;&szlig;ig sehr gering war, wurde diesmal mit 34
Einsendungen eine akzeptable Beteiligung erreicht.
Ich hoffe, da&szlig; dieser positive Trend auch in Zukunft anh&auml;lt.<P>
<BR>
<B>Zun&auml;chst zur Aufl&ouml;sung des letzten Gewinnspiels:</B><P>
<U>Frage 1:</U> Nenne drei Firmen oder Programmierer, die beabsichtigen, Software
f&uuml;r die PowerUp-Karten zu schreiben bzw. dies schon getan haben.<P>
<U>Antwort:</U> Der einfachste Weg war, sich drei Firmen aus der Tabelle der
PowerUp-Umsetzungen in AMIGA aktuell 7/97 herauszusuchen, beispielsweise
Phase 5, Cloanto und Haage &amp; Partner.<P><BR>
<U>Frage 2:</U> In welcher Stadt hat AMIGA International seinen Sitz?<P>
<U>Antwort:</U> Hier erwartete ich eigentlich als Antwort "Langen". Da AMIGA
International jedoch zus&auml;tzlich ein Service-Center in Braunschweig
unterh&auml;lt, habe ich diese Stadt als Antwort auch gelten lassen.<P><BR>
<U>Frage 3:</U> Welche - auf anderen Plattformen l&auml;ngst erh&auml;ltliche -
Computersprache, die insbesondere im Internet Verwendung findet, wird
derzeit von zwei Firmen unabh&auml;ngig voneinander f&uuml;r den AMIGA umgesetzt?<P>
<U>Antwort:</U> Die gesuchte Sprache ist "Java". Sie wird von Haage &amp; Partner und
Finale Development unabh&auml;ngig voneinander f&uuml;r den AMIGA umgesetzt, was
allerdings nicht unbedingt angegeben werden mu&szlig;te.<P><BR>
<A NAME="gewinn"></A>
<B>Gewonnen haben:</B>
<UL>
<LI>Achim Akkermann  - Vollversion von CDCat
<LI>Cengiz Topuzoglu - Fujitsu-/IBM-Rucksack
<LI>Mark Mackeen     - AMIGA-Plus CD-ROM 5/6-95
</UL>
Herzlichen Gl&uuml;ckwunsch!<P>
<P><BR><BR><BR>
<A NAME="neu"></A>
<B>Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:</B>
<P>
<B>Frank Weber</B> hat sein neues Programm <B>CDCat</B> f&uuml;r das Gewinnspiel zur Verf&uuml;gung
gestellt:<P>
&#171;CDCat (MUI) ist DER CD-ROM-Katalogisierer. Es eignet sich auch besonders
f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-Beschreibungen mitber&uuml;cksichtigt
werden. Im Browser k&ouml;nnen CDs durchst&ouml;bert werden, ohne eingelegt zu sein.
Auch ist Entpacken, Texte anzeigen etc. aus CDCat heraus m&ouml;glich.&#187;<P>
Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.<P>
Der Autor von CDCat ist unter folgender Adresse erreichbar:
<ADDRESS>
Frank Weber<BR>
Schlizstra&szlig;e 53<BR>
74076 Heilbronn<BR>
Deutschland<BR>
</ADDRESS>
<P><BR><BR>
<B>Patrick Bernau</B> hat sein Programm <B>Vokabi 2</B> f&uuml;r das Gewinnspiel zur Verf&uuml;gung
gestellt:<P>
&#171;Vokabi 2 ist der erste Shareware-Amiga-Vokabeltrainer, mit dem man seine
W&ouml;rter wirklich so lernen kann, da&szlig; man sie auch ein halbes Jahr sp&auml;ter
noch kann und beim Abfragen nicht daran verzweifelt, da&szlig; man eben "klauen"
statt "stehlen" eingegeben hat.&#187;
<P>
Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.
<P>
Der Autor von Vokabi 2 ist unter folgender Adresse erreichbar:
<ADDRESS>
Patrick Bernau<BR>
Daimlerweg 3<BR>
71032 B&ouml;blingen<BR>
Deutschland<BR>
</ADDRESS>
<P>
Desweiteren hat mir <B>Patrick Peters</B> ein Halbjahresabo seines
Diskettenmagazins <B>Phase 6</B> zur Verf&uuml;gung gestellt:<P>
&#171;PHASE6 ist ein neues, deutschsprachiges DiskMag, das auf jedem Amiga
l&auml;uft. Schnelle Bedienbarkeit, eine hohe &Uuml;bersichtlichkeit und viel Grafik
heben PHASE6 vom Gro&szlig;teil der deutschsprachigen Magazine ab. Die Oberfl&auml;che
beinhaltet einige grafische Effekte, und eine Begleitmusik ist auch
vorhanden. Das Magazin l&auml;uft (auf eigenem Screen) im Multitasking.<P>
PHASE6 gibt es:
<P>
...im Aminet docs/mags, "Phase6_03.lha" ist die letzte Ausgabe
<P>
...frei downloadbar in der Iceberg BBS (04330/854 * V.34 * 18-6 Uhr)&#187;</H3>
<P><BR><BR>
<H2>Aufruf an alle innovativen Programmierer und AMIGA-Firmen:</H2>
<H3>Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
News-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?<BR>
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt.
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser
bekanntzumachen.</H3><P><BR>
<H2>Die neuen Fragen stehen ganz im Zeichen von AMIGA-Unternehmen:</H2>
<FORM ACTION="mailto:CSchroe@stud.uni-goettingen.de" METHOD=POST>
<H3><B>Frage 1:</B> Nenne zwei Firmen, die von AMIGA International eine Lizenz zur
Herstellung oder Distribution AMIGA-kompatibler Computer erhalten haben.<P>
<INPUT TYPE=text NAME="LizenFirmen" VALUE="" MAXLENGTH=40 SIZE=40><P><BR>
<B>Frage 2:</B> Bei welchem sehr bekannten AMIGA-Unternehmen ist Wolf Dietrich als
Gesch&auml;ftsf&uuml;hrer t&auml;tig?<P>
<INPUT TYPE=text NAME="LizenFirmen" VALUE="" MAXLENGTH=40 SIZE=40><P><BR>
<B>Frage 3:</B> Nenne zwei Firmen, die Tower-Umbaus&auml;tze f&uuml;r AMIGA-Computer herstellen.<P>
<INPUT TYPE=text NAME="LizenFirmen" VALUE="" MAXLENGTH=40 SIZE=40>
<P>
Bitte die Adresse angeben:<BR>
<TEXTAREA NAME="Adresse" ROWS=5 COLS=40></TEXTAREA><P><BR><BR>
<INPUT TYPE="SUBMIT" VALUE="    Absenden    "> <INPUT TYPE="RESET" VALUE="L&ouml;schen"></H3>
</FORM>
<H3>Unter allen Teilnehmern, die diese drei Fragen bis zum 20. August
(Einsendeschlu&szlig;) richtig beantworten, werden die folgenden Gewinne verlost:<P>
1 x Vollversion von "CDCat"<BR>
1 x Vollversion von "Vokabi 2"<BR>
1 x Halbjahresabonnement des Diskettenmagazins "Phase 6"<P>
Schickt Eure (hoffentlich richtigen) L&ouml;sungen bitte bis zum 20. August an
folgende Adresse:<P>
<ADDRESS>
Carsten Schr&ouml;der<BR>
Helmoltstra&szlig;e 10<BR>
37081 G&ouml;ttingen<BR>
Deutschland<BR><BR>
oder per E-Mail an:<P>
</ADDRESS>
<A HREF="mailto:cschroe@stud.uni-goettingen.de">cschroe@stud.uni-goettingen.de</A><P>
Bitte verge&szlig;t nicht, Eure Post-Anschrift anzugeben, und ggf. den
bevorzugten Preis. Eine Garantie, da&szlig; Ihr im Gewinnfall dann auch genau
diesen Preis erhaltet, kann ich allerdings nicht geben.<P>
<CENTER><BR><A HREF="news001.html">[zur&uuml;ck]</A>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<A HREF="news003.html">[weiter]</A></H3><P></CENTER>
<P><BR><BR>
</TD>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
