<HTML><HEAD>
<TITLE>Amiga Aktuell 08/97 - Ger&uuml;chtek&uuml;che</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 08/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" ALT="Auswahl - dies Bild bitte laden"WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
<BR><BR>
<A HREF="#spiel">Mehr Spiele?</A>
<BR><BR>
<A HREF="#maxon">Maxon Software</A>
<BR><BR>
<A HREF="#amigamag">Wird Amiga Magazin eingestellt?</A>
<BR><BR>
<A HREF="#nasa">Nasa mit Amigas?</A>
</TD>

<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Ger&uuml;chtek&uuml;che</H2>
<H3><B>Ger&uuml;cht: Steht Blue Byte kurz vor der R&uuml;ckkehr zum AMIGA?</B><P>
Nachdem der Spiele-Hersteller Blue Byte vor kurzem die Dungeon-Routine des
anfangs auf dem AMIGA programmierten "Albion", das sp&auml;ter aber nur f&uuml;r den
Standard-PC erschien, zur freien Nutzung ver&ouml;ffentlichte, und seit letzten
Monat Werbeanzeigen f&uuml;r das PC-Spiel "Extreme Assault" in der AMIGA Plus
schaltet, wird &uuml;ber eine R&uuml;ckkehr von Blue Byte zum AMIGA spekuliert.
M&ouml;glicherweise wolle Blue Byte mit diesen Schritten testen, ob es einen
gen&uuml;gend gro&szlig;en Markt f&uuml;r AMIGA-Konvertierungen gebe.<P>
Blue Byte hatte sich vor wenigen Jahren kurz nach der Ver&ouml;ffentlichung von
"Die Siedler", einem der beliebtesten AMIGA-Spiele aller Zeiten, von
unserem System zur&uuml;ckgezogen.<P>
<B>Fazit:</B><P>
In der Tat sprechen einige Zeichen f&uuml;r die Vermutung, da&szlig; Blue Byte eine
R&uuml;ckkehr zum AMIGA zumindest erw&auml;gt. Es br&auml;uchten sich ja nicht unbedingt
die eigenen Programmiererteams um die Entwicklung von AMIGA-Software
k&uuml;mmern, viel n&auml;her liegt es, da&szlig; Blue Byte externe Teams mit der
Konvertierung erfolgreicher Blue Byte-Spiele beauftragt und dann die Rolle
des Distributors &uuml;bernimmt. Wohl kaum umsonst wird in der ReadMe-Datei zur
oben angesprochenen Albion-Routine im Aminet erw&auml;hnt, da&szlig; Blue Byte Leute
suche, die seine Titel f&uuml;r den AMIGA konvertieren.<P>
Zwar hat der Hersteller unser System bereits verlassen, als es, verglichen
mit heute, noch wesentlich mehr AMIGA-Spiele-Freaks gab.
Allerdings ist es nicht unm&ouml;glich, da&szlig; sich Blue Byte angesichts der
bevorstehenden Ver&ouml;ffentlichung mehrerer "Mammut-Projekte", wie z.B. Myst,
mittlerweile selbst eingesteht, den AMIGA-Markt falsch eingesch&auml;tzt zu
haben. Zudem k&ouml;nnte das Unternehmen auf einen Erfolg des PowerUp-Projekts
hoffen. Dieser w&uuml;rde eine R&uuml;ckkehr Blue Bytes zum AMIGA zwar noch nicht
wahrscheinlich, aber immerhin denkbar machen.<P>
Jedoch wurde meine Anfrage bei Blue Byte prompt mit folgendem Satz
beantwortet:<P>
&#171;Wir werden mit an Sicherheit grenzender Wahrscheinlichkeit keine Spiele
f&uuml;r den Amiga mehr entwickeln, da der Markt daf&uuml;r nicht mehr sehr gro&szlig; ist
und leider auch immer kleiner wird.&#187;<P>
Das k&ouml;nnte darauf hindeuten, da&szlig; es bei den Blue Byte-Mitarbeitern sehr
unterschiedliche Auffassungen in dieser Frage gibt, was auch von einer
Aussage, die ich auf der Blue Byte-Homepage gefunden habe, gest&uuml;tzt wird:
<P>
&#171;Jurie Horneman<P>
"Wenn man bedenkt, da&szlig; die Entwicklung Albions auf AGA - Amigas begann...
damals noch vollst&auml;ndig in Assembler. Wir hatten im Fr&uuml;hjahr &#180;94 mit Hilfe
Michael Bittners, eines befreundeten Programmierers, sogar schon das
komplette 3D-Dungeonsystem in 256 Farben auf dem Amiga lauff&auml;hig, aber
trotz aller M&uuml;he blieb es zu langsam.<BR>
Die Entscheidung, das Projekt auf der PC fortzusetzen, kam da gerade
rechtzeitig, obwohl ich es gerade geschafft hatte, &uuml;bergro&szlig;e
Hardwaresprites und eigene Copper-Listen unter dem Betriebssystem zu
implementieren (schn&uuml;ff).<BR>
Die Umstellung auf PC und C war zwar nicht einfach, aber gl&uuml;cklicherweise
konnte ich die 64K Speichersegmente (schauder) sofort hinter mir
lassen. Die M&ouml;glichkeiten, die eine Sprache wie C und die Leistung eines
PCs boten, haben daf&uuml;r gesorgt, da&szlig; wir uns ohne gro&szlig;e Trauer von den
Amiga verabschiedet haben (auch wenn das anderen offensichtlich nicht so
leicht gefallen ist)."&#187;<P>
Auf alle F&auml;lle kann es nicht schaden, sich bei Blue Byte f&uuml;r eine
Wiederaufnahme der AMIGA-Spiele-Entwicklung einzusetzen. Selbst wenn dies
keinen Erfolg haben sollte, mu&szlig; Blue Byte sp&auml;testens dann erkennen: Wir
AMIGA-User sind noch da!<P>
Kontaktadresse: Blue Byte Software, Eppinghofer Stra&szlig;e 150, 45468 M&uuml;lheim
an der Ruhr, Deutschland; Internet: <A HREF="http://www.bluebyte.de">www.bluebyte.de</A>; E-Mail:
<A HREF="mailto:hotline@bluebyte.de">hotline@bluebyte.de</A><P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="spiel"></A>
<B>Ger&uuml;cht: Verst&auml;rken Spiele-Hersteller wieder ihr AMIGA-Engagement?</B><P>
Neben Blue Byte sollen auch andere Spiele-Hersteller drauf und dran bzw.
bereits dabei sein, wieder verst&auml;rkt f&uuml;r den AMIGA zu entwickeln. Zu nennen
w&auml;ren hier vor allem Electronic Arts, Renegade und Origin.<P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="maxon"></A>
<B>Ger&uuml;cht: Zieht sich Maxon allm&auml;hlich vom AMIGA zur&uuml;ck?</B><P>
Als vor einigen Monaten - angeblich versehentlich - eine Werbeanzeige f&uuml;r
die PC-Version von Maxon Cinema 4D im deutschen AMIGA Magazin
ver&ouml;ffentlicht wurde, f&uuml;hrte dies bei vielen Usern zu Bef&uuml;rchtungen &uuml;ber
einen m&ouml;glichen R&uuml;ckzug Maxons vom AMIGA.<BR>
Allerdings folgte kurz darauf ein Dementi von Maxon - interessanterweise
etwa zeitgleich mit der AMIGA-&Uuml;bernahme durch Gateway 2000. Dieser
Zeitpunkt l&auml;&szlig;t Raum f&uuml;r Spekulationen: Hat Maxon nach dem AMIGA-Aufkauf
noch einmal Hoffnung gesch&ouml;pft und eine m&ouml;glicherweise zuvor gefallene
Entscheidung &uuml;ber ein Verlassen des AMIGA-Marktes noch einmal korrigiert,
zumindest vorl&auml;ufig?<P>
Kein Geheimnis mehr ist, da&szlig; Maxon die Weiterentwicklung bekannter AMIGA-
Programme, z.B. Maxon Tools und Maxon Twist aufgegeben haben soll. Zudem
klagen Anwender &uuml;ber einen schlechter werdenden AMIGA-Support.<P>
Zumindest am Raytracer Cinema 4D wird offenbar noch gearbeitet. F&uuml;r das
vierte Quartal 1997 ist ein Update mit PowerUp-Unterst&uuml;tzung angek&uuml;ndigt.
<P>
<B>Fazit:</B>
Es ist aus meiner Sicht nicht auszuschlie&szlig;en, da&szlig; Maxon sich &uuml;ber kurz oder
lang vom AMIGA verabschiedet. Da&szlig; mehrere recht erfolgreiche Programme
nicht mehr weiterentwickelt werden, ist ein ernstes Zeichen. Eine Anfrage
dazu bei Maxon blieb &uuml;brigens bislang unbeantwortet.<P>
Kontaktadresse: Maxon Computer GmbH, Max-Planck-Str. 20, 61381
Friedrichsdorf, Deutschland; Tel. 06172/5906-0; Fax 06172/5906-30;
Internet: <A HREF="http://www.maxon-computer.com">http://www.maxon-computer.com</A>; E-Mail: <A HREF="mailto:info@maxon-computer.com">info@maxon-computer.com</A>
<P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="amigamag"></A>
<B>Ger&uuml;cht: Weiterhin Spekulationen &uuml;ber Einstellung des AMIGA Magazins</B><P>
Nachdem der in der Aufl&ouml;sung befindliche MagnaMedia-Verlag (AMIGA aktuell
berichtete in Ausgabe 3/97) vor kurzem die beiden Zeitschriften Power Play
und Video Games an den DMV-Verlag verkauft hat, verdichten sich die
Spekulationen &uuml;ber eine baldige Einstellung des AMIGA-Magazins.<P>
Die WEKA-Firmengruppe, zu der der MagnaMedia-Verlag geh&ouml;rt, wird derzeit
umstrukturiert. Die meisten T&ouml;chterfirmen sollen in Zukunft die Bezeichnung
"WEKA" im Namen f&uuml;hren. Dann wird es u.a. die "WEKA Computerzeitschriften-
Verlag GmbH" und "WEKA Fachzeitschriften-Verlag GmbH" geben. Die
Zeitschriften-Titel werden unter den Verlagen neu aufgeteilt.<P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="nasa"></A>
<B>Ger&uuml;cht: NASA benutzt AMIGAs</B><P>
Laut Hal Greenle, einem fr&uuml;heren Angestellten der US-Weltraumorganisation,
benutzt die NASA auf Cape Canaveral mit Warp engines ausgestattete A 4000-
Motherboards in Micronik-Tower. Fr&uuml;her habe die Nasa A 2000 und A 1000
verwendet.<P>
<CENTER><BR><A HREF="news009.html">[zur&uuml;ck]</A>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<A HREF="schluss.html">[weiter]</A></H3>
<P></CENTER>
</TD>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
