<HTML><HEAD>
<TITLE>Amiga Aktuell 08/97 - Spiele-News</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 08/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" ALT="Auswahl - dies Bild bitte laden"WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
<BR><BR>
<A HREF="#tfx">TFX kommt</A>
<BR><BR>
<A HREF="#flyhigh">Flyin' High ist da</A>
</TD>

<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Spiele-News</H2>
<H3><B>Aus Direct Software wird Alive MediaSoft</B><P>
Aufgrund finanzieller Schwierigkeiten hat der bekannte AMIGA-Spiele-
Hersteller und -Lieferant Direct Software die Gesch&auml;ftst&auml;tigkeit
eingestellt.<P>
Einige Mitarbeiter haben daraufhin die neue Firma Alive MediaSoft
gegr&uuml;ndet, die insbesondere die Entwicklung von "The Haunted" und die
Portierung des Adventures "Phantasmagoria" auf den AMIGA weiterf&uuml;hren wird.<P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="tfx"></A>
<B>TFX kommt mit mehrj&auml;hriger Versp&auml;tung - f&uuml;r ca. 25 DM</B><P>
Spiele-Fans werden sich erinnern: Vor wenigen Jahren k&uuml;ndigte der Spiele-
Hersteller DID eine AMIGA-Version des Flugsimulators TFX an, die jedoch nie
erschien. Obwohl die Entwicklung so gut wie abgeschlossen war, entschlo&szlig;
sich der Hersteller, das Projekt einzustellen - damals sah man keinen Markt
f&uuml;r ein Spiel, das einen AGA-AMIGA, Fast-RAM sowie eine Festplatte
ben&ouml;tigt...<P>
Mit mehrj&auml;hriger Versp&auml;tung erscheint TFX jetzt aber doch - und zwar auf
der CoverCD-ROM der Oktoberausgabe der bekannten englischen AMIGA-
Zeitschrift CU AMIGA. Zum Spielen von TFX wird ein AGA-AMIGA mit 2 MB Fast-
RAM und Festplatte ben&ouml;tigt. Nach oben hin sind nat&uuml;rlich keine Grenzen
gesetzt. &Uuml;brigens werden sich auf der CD auch Versionen f&uuml;r schnellere
Prozessoren (FPU, 68040 usw.) befinden.<P>
Wie kommt man an die CU AMIGA? Wer das Magazin abonnieren m&ouml;chte, kann sich
direkt &uuml;ber die WWW-Seite der CU AMIGA (<A HREF="http://www.cu-amiga.co.uk">http://www.cu-amiga.co.uk</A>)
anmelden. Allerdings ist ein Abo in das europ&auml;ische Ausland nicht ganz
billig: Zw&ouml;lf Ausgaben mit Cover-CD-ROM kosten &#163;87, das sind etwa 250 DM.
Mit Cover-Disk (darauf wird TFX u.v.a. aus Platzmangel allerdings nicht
erscheinen) kostet der Spa&szlig; immerhin noch &#163;70, also etwa 200 DM.<P>
F&uuml;r alle, die jedoch nur ab und zu die eine oder andere Ausgabe erwerben
m&ouml;chten, gibt es eine bessere M&ouml;glichkeit: Viele Presse-Gro&szlig;handlungen in
gr&ouml;&szlig;eren St&auml;dten f&uuml;hren zumindest einige ausl&auml;ndische
Computerzeitschriften. Selbst wenn die CU AMIGA nicht darunter sein sollte,
schadet es nichts, einmal beim Personal nachzufragen, ob nicht jeden Monat
ein oder zwei Exemplare bestellt werden k&ouml;nnten. In meinem Wohnort
G&ouml;ttingen z.B. hat das ohne Probleme geklappt. Der Presse-Grossist Tonollo
f&uuml;hrt ab sofort jeden Monat zwei Exemplare der CU AMIGA mit CD-ROM zum
Preis von 25 DM.<P>
<CENTER><BR>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<P></CENTER><BR>
<A NAME="flyhigh"></A>
<B>Flyin'High - das neue 3D-Rennspiel wird ausgeliefert</B><P>
Igor Vucinic von PURE-Design informiert &uuml;ber Flyin'High:<P>
&#171;Nach &uuml;ber 18 Monaten Entwicklungszeit ist es endlich geschafft:
FLYIN'HIGH ist da! Es ist das bisher einzige, texturierte
3D-Rennspiel seiner Art. DER Rennspielklassiker, die "Lotus"-
Trilogie bot ein fantastisches Gameplay aber relativ simple
Grafik.<P> Seit dem Erfolg von Spielen &agrave; la "Daytona" oder "Mario
Kart" eifern auch die Amiga-User solchen Spielen nach. Bisher
hielt man so etwas auf dem Amiga f&uuml;r unm&ouml;glich. Erste Versuche
m&uuml;ndeten in Ergebnissen wie "Virtual Karting", da&szlig; von der Idee
her nicht mal so schlecht war, allerdings in puncto Grafik bei
vielen Spielefans nicht viel Begeisterung stie&szlig;.<P> Vor einiger
Zeit beeindruckte Silltunna Software mit dem tollen und rasanten
"XTreme Racing" die Amiga-Besitzer. Einziger Wermutstropfen: Die
Strecken waren so flach und eben wie niederl&auml;ndische Highways.
Doch die Entwickler von PURE-Design - "the dudes with attitudes"
begannen, der Rennspielmisere auf dem Amiga ein Ende zu setzen;
sie schufen "FLYIN'HIGH", das eine ganze Menge zu bieten hat:
<UL>
<LI>Minimalkonfiguration: A1200 mit Festplatte (oder CD-Laufwerk) und
4 MByte FastRAM. Empfohlen: mind. 030er - fuer erstklassige Performance
ein 68060er Prozessor.
<LI>Unterst&uuml;tzt 68020, 68030, 68040 und 68060
<LI>Ausgefeilte 3D-Texturemapping-Routinen
<LI>Schatteneffekte
<LI>Dynamische Frame-Rate
<LI>2x2- und 1x1-Chunky-to-Planar Grafikengine mit
w&auml;hlbarer Screengr&ouml;&szlig;e
<LI>Gerenderte Intro-, Zwischen- und Endanimationen
<LI>Kleines Feature zwischendurch: Der Buggy wurde mit funktionierenden
Bremslichtern ausgestattet...
<LI>Fesselnder Soundtrack mit "Tunnel-SpecialFX"
<LI>Vier unterschiedliche Welten (Stadt, Dschungel, Wald und
Schnee) mit jeweils f&uuml;nf Levels.
<LI>Herumliegende Extras k&ouml;nnen aufgesammelt und eingesetzt bzw.
Geldbetr&auml;ge im Shop gegen Tuningartikel (Waffen, besserer
Motor, Reifen, etc.) getauscht werden.
<LI>1 bis zu 4 Spieler gleichzeitig (via 4-Spieler-Adapter am
Parallelport)
<LI>Das Spiel erkennt selbst&auml;ndig, ob es auf einer deutschen
Workbench gestartet wurde und stellt sich entsprechend darauf
mit komplett deutschen Texten ein.
<LI>Bei der Entwicklung wurde so systemkonform wie m&ouml;glich programmiert.
Es ist also z.B. problemlos eine R&uuml;ckkehr zum AmigaDOS m&ouml;glich,
ohne den Rechner neu starten zu m&uuml;ssen. Das Multitasking bleibt
aktiviert (nur im 1x1-Modus) und auf Wunsch l&auml;&szlig;t sich das Spiel
auch im DBLPAL-Modus betreiben.
<LI>Alle Einstellungen werden automatisch gespeichert. Das Verzeichnis,
in dem Spielst&auml;nde, Preferences und Highscores abgelegt werden
sollen, kann vom Benutzer definiert werden.
<LI>Die Workbench kann auf Wunsch geschlossen werden.
<LI>FLYIN'HIGH ist auf CD erh&auml;ltlich. Es gibt aber auch eine
identische Diskettenversion.
</UL>
Bestellungen gehen bitte an:<P>
APC&amp;TCP<BR>
FLYIN'HIGH-Bestellung<BR>
Dorfstr. 17<BR>
83236 Uebersee<BR>
Tel. 08642/899953<P>
Preis: 69,95 DM zzgl. Porto&amp;Verpackung<P>
APC&amp;TCP-Clubmitglieder erhalten natuerlich
den ueblichen Rabatt.&#187;<P>
<CENTER><BR><A HREF="news005.html">[zur&uuml;ck]</A>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<A HREF="news007.html">[weiter]</A></H3>
<P></CENTER>
</TD>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
