<HTML>
<HEAD><TITLE>Amiga Aktuell 08/96 - Vorwort</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 08/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Vorwort, August, Informationen, News, deutsch">
</HEAD>
<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>
<TR>
<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>

<TD WIDTH=496 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav002.gif" USEMAP="#nav001" WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
</TD>
<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<CENTER>
<H2>Willkommen zur neuesten Ausgabe von</H2><BR>
<H1>AMIGA aktuell</H1>
</CENTER><BR><BR>
<H3>Seltsame Dinge haben sich in den letzten Tagen um unseren AMIGA abgespielt.
Da gibt ein amerikanisches Unternehmen namens Lotus Pacific, Inc. am 17.
Juli eine Presseerkl&auml;rung heraus, nach der Lotus soeben von der (ebenfalls
amerikanischen) Rightiming Electronics Corp., auch bekannt unter dem Namen
NewStar, alle AMIGA-Patente, -Lizenzen, -Warenzeichen und -Copyrights f&uuml;r
die Staaten China (einschl. Hong Kong), Taiwan, Macao und die zwischen
China und der ehemaligen Sowjetunion gelegenen L&auml;nder erworben habe.
Mit anderen Worten: In diesen Staaten sei nicht Gateway 2000 Inhaber der
AMIGA-Rechte, sondern Lotus Pacific, Inc. bzw. vormals NewStar.<P>
Letzteres Unternehmen hat nach der AMIGA-&Uuml;bernahme durch die damalige Escom
AG angek&uuml;ndigt, einen AMIGA f&uuml;r den chinesischen Markt zu entwickeln (AMIGA
aktuell berichtete in Ausgabe 9/96). Aber schlossen NewStar und Escom
damals einen Vertrag, der die Aufgabe von Escoms AMIGA-Rechten in den oben
genannten L&auml;ndern vorsah? Ich zumindest konnte mich an ein solches Abkommen
in keinster Weise erinnern und sah in meinen Unterlagen nach - ohne Erfolg.
In den folgenden Tagen erfuhr ich dann, da&szlig; ich nicht der einzige war...
Selbst die sonst immer recht gut informierte Champaign-Urbana Computer
Users Group (CUCUG) hatte "keinen blassen Schimmer".<P>
Nachdem die AMIGA-Gemeinde weder ein noch aus wu&szlig;te, geschweige denn, wer
&uuml;berhaupt wo welche AMIGA-Rechte besitzt, meldete sich am 24. Juli Dr. Jim
Taylor von Gateway 2000 zu Wort und wies die Anspr&uuml;che der Lotus Pacific,
Inc. scharf zur&uuml;ck: Gateway 2000 bes&auml;&szlig;e weltweit alle AMIGA-Patente,
-Copyrights und -Markennamen. Er bestritt, da&szlig; Lotus Pacific bzw. NewStar
irgendwelche AMIGA-Lizenzrechte oder -Anspr&uuml;che h&auml;tten.<P>
Die originalen Presseerkl&auml;rungen dazu sind in der Rubrik "Diverse
Neuigkeiten" zu finden.<P>
Der letzte Stand der Dinge: Sowohl NewStar/Lotus Pacific auf der einen
Seite als auch Gateway 2000 auf der anderen beharren auf ihre Anspr&uuml;che.
AMIGA International und Gateway 2000 pr&uuml;fen derzeit, ob beim von NewStar
entwickelten "Wonder TV A6000" (siehe Presseerkl&auml;rung unter "Diverse
Neuigkeiten") die AMIGA-Technologie legal genutzt werden durfte.
Wir d&uuml;rfen gespannt sein, ob es zu einer gerichtlichen Auseinandersetzung
zwischen "David" NewStar/Lotus  und "Goliath" Gateway 2000 kommen wird. Auf
jeden Fall war dieser Sommer bislang alles andere als langweilig,
vielleicht bleibt er ja so spannend...<P>
In eigener Sache: Wie bereits in der letzten Ausgabe angek&uuml;ndigt, m&ouml;chte
ich AMIGA aktuell noch mehr auf Eure W&uuml;nsche ausrichten. Zu diesem Zweck
sollte m&ouml;glichst jeder von Euch den im Hauptteil enthaltenen Fragebogen
ausf&uuml;llen und an mich zur&uuml;ckschicken.<P>
Damit die M&uuml;he nicht ganz umsonst ist, habe ich die Umfrage mit dem
aktuellen Gewinnspiel gekoppelt: Jeder, der sich an einer der beiden
Aktionen beteiligt, nimmt mit einer Stimme an der Preisverlosung teil. Wer
jedoch sowohl die drei Fragen des Gewinnspiels richtig beantwortet als auch
an der Umfrage teilnimmt, hat sogar zwei Stimmen bei der Verlosung und
somit die doppelte Chance auf einen Preis!<P>
Jetzt w&uuml;nsche ich noch viel Spa&szlig; bei AMIGA aktuell!<P>
<CENTER><BR><A HREF="index.html">[zur&uuml;ck]</A>
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
<A HREF="intern.html">[weiter]</A></H3><P></CENTER>
<P><BR><BR>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
