<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Alternative Party 2003</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teksti: Sami Yl&ouml;nen, Joanna Kurki &lt;<a href="mailto:jkurki@iti.fi">jkurki@iti.fi</a>&gt;<br>
							
							Kuvat:&nbsp;<a href="http://www.belymt.com/~jkurki/Alt2003/index.htm" target="_blank">Joanna Kurki</a></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><b><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. <a href="http://batman.jypoly.fi/~saku/yhdistys/tapahtumat/altparty2003/index.html" target="_blank">osallistui</a> 10.-12. tammikuuta Helsingiss&auml; Suomen toiseksi suurimpaan tietekonejuhlaan, <a href="http://www.altparty.org" target="_blank">Alternative Party 2003</a>:een. Esittelylaitteiston toimitti <a href="http://www.thendic-france.com/" target="_blank">Genesi</a>, tehokaksikkona paikalla olivat Sami&nbsp;Yl&ouml;nen ja Joanna Kurki ja koneen toimintakuntoon saamisessa auttoi Ilkka Lehtoranta.</font></b></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Sami tarinoi...</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Alun perin hyv&auml; suunnitelma (j&auml;lkeenp&auml;in ajatellen erinomainen!) sai alkunsa pime&auml;n&auml; syysilt... itse asiassa kyseess&auml; taisi olla aurinkoinen talvip&auml;iv&auml;. Joka tapauksessa idea reissuun sai alkunsa irkiss&auml; Joanna Kurjelta, ja asiaa aikamme tuumailtuamme totesimme, ettei kysyminen mit&auml;&auml;n maksa. Niin l&auml;hti Genesille s&auml;hk&ouml;posti, josko heruisi Pegasos lainaan n&auml;lk&auml;iselle partykansalle ihmetelt&auml;v&auml;ksi.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0008_JPG.htm" target="_blank"><img src="kuvat/altparty_1.jpg" alt="Lainakone loistossaan" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Aikataulu meni hieman tiukaksi mutta toimi, kone saatiin p&auml;iv&auml;&auml; ennen itse tapahtuman alkua asentamattomana. Ilkka Lehtorannan ja Joannan viett&auml;m&auml;n unettoman y&ouml;n j&auml;lkeen systeemi oli suurimmaksi osaksi toimiva, ja niin l&auml;hdettiin kimpsujen ja kampsujen kanssa etel&auml;&auml;n. Ilkka ei mukaan p&auml;&auml;ssyt, mutta sijaiseksi haettiin allekirjoittanut matkan varrelta.<br>
							<br>
							Tapahtumapaikalle Helsinkiin saavuttiin tuntia alkuper&auml;isest&auml; suunnitellusta aikataulusta my&ouml;h&auml;ss&auml; ja missattiin kuuleman mukaan hieno avajaistilaisuus. Kone kuitenkin saatiin tulille suhteellisen nopeasti ja p&auml;&auml;stiin mukaan tunnelmiin. Paikalla tuntui olevan suhteellisen monta Amigaakin, joten tulisimme varmasti her&auml;tt&auml;m&auml;&auml;n mielenkiintoa.<br>
							<br>
							Luonnollisesti ensimm&auml;inen asia, joka kokoonpanon toimimiseen saattamisen j&auml;lkeen tehd&auml;&auml;n, on aloittaa nettiyhteys ja irc sek&auml; ilmoittaa tutuille, ett&auml; olemme saapuneet onnellisesti perille. Koskapa yhdistyksen puolesta oli ilmoiteltu Internetin foorumeihin, ett&auml; Pegasos vierailee Alt Partyill&auml;, k&auml;v&auml;isin parissa foorumissa kirjoittamassa muutaman rivin tilanteesta, &quot;paikalla ollaan ja valmiudessa&quot;.<br>
							<br>
							Ainakin itse tunsin oloni hieman ulkopuoliseksi, kun kiertelin katselemassa, mit&auml; kaikkia koneita tapahtumassa oli. Ehk&auml;p&auml; juuri t&auml;st&auml; syyst&auml; linnoittauduin Pegasoksen &auml;&auml;reen sit&auml; tutkiskelemaan, edellinen tutustuminen Sakun vuosikokouksen yhteydess&auml; j&auml;i ik&auml;v&auml;n lyhyeksi. Ty&ouml;p&ouml;yd&auml;lt&auml; bongasin mielenkiintoisen ikonin nimelt&auml;&auml;n Birdieshoot, joten sit&auml;h&auml;n piti heti tuplaklikkailla. My&ouml;nnett&auml;k&ouml;&ouml;n jo t&auml;ss&auml; vaiheessa, ett&auml; ajan olisi voinut k&auml;ytt&auml;&auml; hy&ouml;dyllisemminkin, mutta kyseinen peli on eritt&auml;in addiktiivinen (vaikkakin j&auml;in kaipaamaan isompaa asearsenaalia yms. :). Suosittelen l&auml;mpim&auml;sti. En luonnollisestikaan &quot;ominut&quot; konetta itselleni vaan (pelist&auml; havahtuessani) annoin ihmisten tulla tutustumaan koneeseen - ja kiinnostusta riitti mukavasti.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0062_JPG.htm" target="_blank"><img src="kuvat/altparty_2.jpg" alt="Sami koneen &auml;&auml;rell&auml;" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ranskalaiselta kehitt&auml;j&auml;lt&auml; lainaan saamamme Pegasos saapui varsin muikein puittein, oli hienoa koteloa sek&auml; hassua Daewin-merkkist&auml; TFT-n&auml;ytt&ouml;&auml; sek&auml; t&auml;ysin omituinen - vaikkakin pieni ja s&ouml;p&ouml; - ranskalainen n&auml;pp&auml;imist&ouml;. Eik&ouml; niille fransmanneille mik&auml;&auml;n kelpaa sellaisenaan... Kotelosta muuten sen verran, ett&auml; sen n&auml;hneille ja asiasta kiinnostuneille suosittelen ottamaan yhteytt&auml; Triosoftin Toni Caveniin - h&auml;n sattui olemaan paikan p&auml;&auml;ll&auml; viereisess&auml; p&ouml;yd&auml;ss&auml; ja tuli puheeksi, ett&auml; he tuovat maahan kyseisen valmistajan koteloita.<br>
							<br>
							Pegasoksen emolevy sin&auml;ll&auml;&auml;n on kyll&auml; n&auml;tti kuin sika pienen&auml;, eik&auml; Ambient n&auml;yt&auml; hassummalta sek&auml;&auml;n. AmigaOnea en ole kokeilemaan viel&auml; p&auml;&auml;ssyt, mutta mit&auml; Internet aiheesta kertoo, ovat koneiden ja k&auml;ytt&ouml;j&auml;rjestelmien ominaisuudet suhteellisen l&auml;hell&auml; toisiaan. Aika n&auml;ytt&auml;&auml;, ovatko kyseess&auml; pelk&auml;st&auml;&auml;n makuasiat, vai onko jompi kumpi j&auml;rjestelm&auml; selke&auml;sti toista parempi. En turinoi laitteesta tai k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; sen enemp&auml;&auml;, vaan annan jokaisen muodostaa oman mielipiteens&auml;. Onko kertomatta j&auml;tt&auml;minen hyv&auml; vai huono ratkaisu, senkin aika n&auml;ytt&auml;&auml;. En kuitenkaan halua asettaa lukijoille mielikuvia, joita j&auml;rjestelm&auml; mahdollisesti ei pysty t&auml;ytt&auml;m&auml;&auml;n.<br>
							<br>
							Tuttuihinkin naamoihin t&ouml;rm&auml;ttiin, ja moni ehti kokeilla lempiohjelmiansa MorphOS:n alla - enemm&auml;n sun v&auml;hemm&auml;n menestyksekk&auml;&auml;sti. Suurin osa ohjelmista kuitenkin toimii heitt&auml;m&auml;ll&auml;, ongelmia esiintyy l&auml;hinn&auml; ohjelmissa, jotka k&auml;ytt&auml;v&auml;t jotain alkuper&auml;isen alustan raudan ominaisuuksista.<br>
							<br>
							Allekirjoittaneen mielipide MorphOS:sta j&auml;i positiiviseksi. Vaikka kyseess&auml; oli suhteellisen aikainen versio ja kaatumatautia esiintyi, k&auml;ytt&ouml;j&auml;rjestelm&auml; tuntuu eritt&auml;in kotoisalta - kaikki vain tapahtuu julmetun paljon nopeammin. Ihmek&ouml;s tuo, kyseess&auml; on kuitenkin 600 MHz:n G3-prosessori - vertauskohteena kotona oleva Amiga 4000, 060/50 MHz, 200 MHz PPC ja OS3.9 - ja onhan luvassa viel&auml;kin nopsempaa prosessoria viel&auml; t&auml;m&auml;n vuoden puolella. J&auml;&auml;k&ouml;&ouml;n hehkuttamiset sikseen - seuratkaa netist&auml;, itse odotan uutta mielenkiinnolla, joskin hommat tuntuvat olevan hyvin, hyvin sekavia.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0038_JPG.htm" target="_blank"><img src="kuvat/altparty_6.jpg" alt="Pegasos kiinnostaa" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Y&ouml;n tunteina paikalle saapui yh&auml; enemm&auml;n ja enemm&auml;n tuttua porukkaa kikkailemaan koneella ja muuten vaan jutustelemaan. Itse vaivuin toukkakotelooni (vihre&auml; makuupussi), josta havahduin pari kertaa vain kuullakseni parin tutun &auml;&auml;nen v&auml;ittelev&auml;n jostain t&auml;ysin k&auml;sitt&auml;m&auml;tt&ouml;m&auml;st&auml; aiheesta. Y&ouml;pyminen sujui muuten mainiosti, paksumpi patja (hmm.. tai siis, patja ylip&auml;&auml;t&auml;&auml;n) olisi ehk&auml; ollut tarpeen.<br>
							<br>
							Itse paikasta pit&auml;&auml; sanoa sen verran, ett&auml; puitteet ovat kyll&auml; kielt&auml;m&auml;tt&auml; upeat vaikka mihin, mutta lieneek&ouml; sitten johtunut liiallisesta ovien auki pidosta vai mist&auml;, ett&auml; Gloriassa oli aivan himputin kylm&auml; koko tapahtuman ajan.<br>
							<br>
							Siin&auml; onnellisesti turistessamme tuttavallisten amigistien kanssa k&auml;vi my&ouml;s sellainen onnellinen (??) tapahtuma, ett&auml; AssyTV:n toimitus saapui paikan p&auml;&auml;lle ja luonnollisesti tahtoi tehd&auml; jutun my&ouml;s Pegasoksesta. N&auml;in ollen minulle, allekirjoittaneelle, jo AssyTV:st&auml; tutuksi tulleelle, tarjoutui j&auml;lleen mahdollisuus skarpata lontoonmurrettani ja h&ouml;p&ouml;tt&auml;&auml; niit&auml; n&auml;it&auml; s&ouml;p&ouml;lle juontajatytt&ouml;selle. Valitettavasti moni mainitsemisen arvoinen asia unohtui pieness&auml; paniikissa selvitt&auml;&auml;, viimeksi kun englantia v&auml;&auml;nsin Michael Battilanan kanssa Saku 2001 -tapahtumassa. <i>[Toim.huom.: Onko n&auml;in - hollantiako sitten puhuit Sharwinin ja Rakeshin kanssa vuosikokouksessa?-) ]</i><br>
							<br>
							Kuten mahdollisesti huomasitte, skippasin onnellisesti l&auml;hes kaikki muut tapahtumassa olleet koneet. T&auml;m&auml; tapahtui tarkoituksella, koska suoraan sanoen wanhan muisti ei ole entisens&auml;, enk&auml; suinkaan halua v&auml;h&auml;tell&auml; tapahtumassa olleita vekottimia varsinkaan n&auml;in julkisessa foorumissa. N&auml;in paljon mielenkiintoisia laitteita, ja suosittelenkin tapahtumaa 80-luvun &quot;atk-laitteista&quot; kiinnostuneille henkil&ouml;ille oikein l&auml;mpim&auml;sti. </font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">...ja Joanna s&auml;est&auml;&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Koska Sami ehtikin jo kirjottaa Pegasoksesta, j&auml;&auml;nee minun teht&auml;v&auml;kseni poimia sitten niit&auml; muita sivujuonia jonkinlaiseen kokoelmaan. Aikataulusta t&auml;ytyy viel&auml; sen verran lis&auml;t&auml;, ett&auml; kun samaan viikonloppuun sattui Yhdysvalloissa semmoinen pikkutapahtuma kuin <a href="http://www.cesweb.org/" target="_blank">CES 2003</a>, niin kaikki Genesin v&auml;ki ja laitteet olivat tietenkin sinne menossa. Saman viikon maanantaina sain tiedon, ett&auml; meille l&auml;hetet&auml;&auml;n yhden ty&ouml;ntekij&auml;n oma kone (sarjanumero #00005), johon oli vain kiintolevy vaihdettu. Sen j&auml;lkeen alkoikin odotus, ja torstaina kone sitten saapui Jyv&auml;skyl&auml;&auml;n. Edelleenkin kiitokset Ilkalle koneen asennuksesta parempaan kuntoon.<br>
							<br>
							Perjantaina olikin sitten suomalaisittain kiva keli, rapiat parikymment&auml; astetta pakkasta, mutta eih&auml;n se ole ennek&auml;&auml;n automatkailua est&auml;nyt. Ik&auml;vint&auml; oli pakastekylmien tavaroiden kantaminen autosta sis&auml;lle ja laittaminen toimintaan - siin&auml; monen tunnin pakastamisen j&auml;lkeen tuli semmoinen pelko, ett&auml; ent&auml;s jos laitteet eiv&auml;t toimikaan. Mukana oli minulla sent&auml;&auml;n Pegasoksen lis&auml;ksi my&ouml;s Mattel Intellivision (vuoden 1979 kotivideopeli + ohjelmontimoduuli) tarpeineen. Kyll&auml; ne laitteet tokenivat toimintaan, kun antoi tarpeeksi aikaa ja l&auml;mp&ouml;&auml;.<br>
							<br>
							Pegasoksen esittelyn j&auml;tin suosiolla enemm&auml;n Samin haltuun. Itsell&auml;ni on niin monta vuotta siit&auml;, kun olen viimeksi mit&auml;&auml;n Amigan tapaista k&auml;ytt&auml;nyt, ettei sujuvasta demoamisesta tulisi mit&auml;&auml;n. Teknisest&auml; puolesta sent&auml;&auml;n tuli juteltua useammankin k&auml;vij&auml;n kanssa. Toivottavasti joku ainakin niist&auml; jutuista sai jotain uutta ideaa siit&auml;, miss&auml; tuon laitteen kanssa ollaan ja mit&auml; on mahdollisesti tulossa.<br>
							<br>
							Kiertelin katselemassa kaikenlaisia laiteita. Yksi huomioni kiinnitt&auml;nyt vempain oli ranskalaisen harrastajan mukanaan tuoma kyrillisill&auml; kirjaimilla varustettu kone, joka oli kuulemma Oric-1:n it&auml;eurooppalainen klooni. Lis&auml;ksi yksi vanhimmasta p&auml;&auml;st&auml; on Timo Rossin Vectrex, hassu kotipelikonsoli, jossa on vektorigrafiikka. Sille ei demoa viel&auml; Timolla ole, mutta kunhan saa sen ROM-emulaattorikorttinsa kuntoon, niin sitten varmaan. Lis&auml;ksi paikalla oli turbotettuja kuusnelosia, Atareita ja tietty useampikin Amiga. Niin ja PC:it&auml;, mutta kuka niit&auml; jaksaa laskea. :)<br>
							<br>
							Osa ajastani meni my&ouml;s tuon oman Mattelin kanssa, sill&auml; pitih&auml;n sit&auml;kin hieman esitell&auml; laitetta tuntemattomille. Oli kiva katsella nuoremman v&auml;en ilmeit&auml;, kun he huomasivat pelien copyrightien olevan ajalta ennen heid&auml;n syntym&auml;&auml;ns&auml;. Minulla oli muutamia alkuper&auml;isi&auml; pelioduleita mukana, sek&auml; l&auml;pp&auml;ri ja Mattel-ROM-emulaattori, jolla latasin ne pelit koneelle. Oli hauska kokemus laittaa laite videotykkiin kiinni ja pelata yli 20 vuotta vanhoja pelej&auml; isolla screenill&auml;... Muun muassa Burgertime oli edelleen ihmisille kokemus, samoin kuin BiPlanes ja AutoRacing. </font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0048_JPG.htm" target="_blank"><img src="kuvat/altparty_3.jpg" alt="Retropelaamista isolla screenill&auml;" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ehk&auml; mielenkiintoisimpia Alt Partyill&auml; tapaamiani henkil&ouml;it&auml; on Jeff Minter, tuo <a href="http://www.llamasoft.co.uk/" target="_blank">Llamasoftin</a> perustaja, jonka tuotteista on hyvin monella kokemuksia. Toisin kuin yleens&auml; luullaan, Llamasoft ei ole kokonaan kadonnut markkinoilta. Heill&auml; on sivuillaan esill&auml; pelej&auml; PocketPC-laitteille ja my&ouml;s isolle Windowsille. Lis&auml;ksi h&auml;n mainitsi, ett&auml; l&auml;hiaikoina heill&auml; on tarkoitus aloittaa pelien teko jollekin pelikonsolille. Tarkempaa tietoa h&auml;n ei voinut viel&auml; sanoa asiasta, mutta voi hyvinkin olla, ett&auml; asia selvi&auml;&auml; piakkoin. H&auml;n k&auml;vi katselemassa mukanani tuomiani Mattel-demoja ja ihmetteli Mattelia tuntevana ihmisen&auml;, miten siit&auml;kin saadaan niin paljon irti. Lis&auml;ksi ylipuhuin h&auml;net katsomaan my&ouml;s Pegasosta.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0045_JPG.htm" target="_blank"><img src="kuvat/altparty_4.jpg" alt="Jeff Minter ja Pegasos" height="300" width="400" border="1"></a></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="left">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Jeff Minter, Llamasoftin perustaja, Pegasoksen &auml;&auml;rell&auml;.</font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pit&auml;&auml;kin mainita my&ouml;s ne compot. Sanotaan, ett&auml; musiikkikomposta j&auml;i hetkitt&auml;in olo, ett&auml; joku r&auml;&auml;kk&auml;&auml; kissaa, mutta toisaalta siell&auml; oli ihan mielenkiintoisiakin suorituksia. Vallankin mieleen j&auml;i Galway Replay by Pihti, todella taitava yksil&ouml;suoritus, joka tuli omassa sarjassaan (Live vocal) toiseksi. Ohjelmointity&ouml;n ihmeen&auml; voi pit&auml;&auml; Viznutin Robotic Warrior -demoa, joka on tungettu laajentamattomaan VIC-20:een ja sis&auml;lt&auml;&auml; todella uskomattoman m&auml;&auml;r&auml;n grafiikkaa, &auml;&auml;nt&auml; ja jopa jonkinlaisen puhesynteesirutiininkin! Eip&auml; ihme, ett&auml; palkintojen jaon j&auml;ljilt&auml; Viznutilla oli ongelma p&auml;&auml;st&auml; kaikkien kamojen kanssa junaan!</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://www.belymt.com/~jkurki/Alt2003/pages/PICT0070_JPG.htm" target="_blank"><img src="kuvat/altparty_5.jpg" alt="Viznut ja palkintokasa" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tapahtumapaikka oli mukavan tilava tuollaiseen tapahtumaan. Tosin hieman keskell&auml; Helsinki&auml; (= paikoituspulmia) ja hirvitt&auml;v&auml;n kylm&auml; ainakin talviaikaan. Ilmeisesti paikan ulko-ovet on suunniteltu ennen energiakriisej&auml;, sen verran hyvin siell&auml; tuulettui koko paikka aina kun joku kulki niist&auml; - ja tuollaisessa tapahtumassa aina joku oli joko tulossa tai menossa. No, onneksi tuli makuupussi mukaan, sen kanssa tarkeni y&ouml;n hiljaisten tuntien yli.<br>
							<br>
							Jeff Minterist&auml; viel&auml; v&auml;h&auml;n lis&auml;&auml;. T&auml;ss&auml; on linkki <a href="http://www.llamasoft.co.uk/announcement.txt" target="_blank">IRC-logiin</a>, jossa kerrotaan, mist&auml; projektista h&auml;n Alt Partyjen aikaan puhui. Nyt alkaa GameCube kiinnostaa enemm&auml;n. :) Lis&auml;&auml; tietoa, juttuja tapahtuneesta yms. l&ouml;ytyy Alt Partyn kotisivujen <a href="http://www.altparty.org/?p=archive" target="_blank">arkistosta</a>. Sielt&auml; l&ouml;ytyy linkkej&auml; muihin kirjoitelmiin, lis&auml;&auml; kuvia ja compojen tulokset.</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>