<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Amiga-maailma - kärsi ja kestä</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Terho Henriksson &lt;<a href="mailto:terho.henriksson@kopteri.net">terho.henriksson@kopteri.net</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>En kestänyt otsikkoa pitemmälle. Ostin tuliterän kannettavan tietokoneen. Pulitin rahaa noin 1400 euroa, osamaksulla kätevästi Hobby Hallista. Merkkinä Compaq ja käyttöjärjestelmänä Windows XP Home Edition. Melkoinen saavutus henkilöltä, joka vuosia sitten oli vain amigisti henkeen ja vereen. Tarkoittaako tämä sitten Amiga-ympyröiden totaalista unohtamista? Missään nimessä ei. Enemmänkin monimutkaiseen yhtälöön on tullut uusi tekijä lisää.</b></font></p>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mit&auml; Amiga sitten on minulle merkinnyt vuosien saatossa? Ent&auml; mit&auml; se on merkinnyt sinulle, hyv&auml; lukija? &quot;Joka menneit&auml; muistelee, sit&auml; tikulla silm&auml;&auml;n&quot;, sanotaan, mutta silti &quot;syyllistyn&quot; John Lennonin Imaginen lailla unelmoiman maailmasta, jossa kaikki tietokoneet olisivat vain Amigoita. Amiga kotona ja Amiga t&ouml;iss&auml;, ei en&auml;&auml; perusharmaita laatikkoon kyh&auml;ttyj&auml; PC:t&auml;. Custom-pohjalta rakennetut erikoispiirit ja kaikki. El&auml;m&auml;&auml;, jolloin melkein joka TV-ohjelmassa olisi juttua Amiga-k&auml;ytt&auml;j&auml;st&auml;, joka k&auml;ytti arkip&auml;iv&auml;iseen ongelmanratkaisuun mielititetokonettaan. Ripaus sit&auml; harrastelijan ylpeytt&auml;.<br>
								<br>
								
							Muistan hyvin el&auml;v&auml;sti sen p&auml;iv&auml;n, kun astuin vuonna 1985 Infoon laukussa paljon k&auml;ytetty ja pelattu Commodore 64 ja kasettiasema. Halusin siirty&auml; uuteen aikaan. Minulla oli tiedossa hyvin vahvasti, mit&auml; tulisin hankkimaan. Sit&auml; asennetta ei olisi horjuttanut edes joukkomielenosoitus. Minua j&auml;nnitti niin, ett&auml; aivan varmasti t&auml;risin. Ajattelin: Ei en&auml;&auml; kasettiasemia tai aseman lukup&auml;&auml;n ruuvin kieputtelua. Tilalle tulisi uusi Amiga 500, kone joka osasi puhua syntetisaattoriohjelman kautta, py&ouml;ritt&auml;&auml; useita ohjelmia samanaikaisesti ja ohjelmistot, jolla p&auml;&auml;sin toteuttamaan visioitani. Sivuntaitto-ohjelma PageSetter veikin mukanaan aivan t&auml;ysin Delux Paint -piirto-ohjelman kera, ja pian ostin my&ouml;s matriisikirjoittimen, jonka mukana olisi ollut kiva saada korvatulpat. Innostuin my&ouml;s koodauksesta AMOS PROn malliin, joka paljosta parjauksestaan huolimatta on yksi ammattimaisimmista sovelluspaketeista, mit&auml;</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"> Amigalla on n&auml;hty. MEDill&auml; (Music EDitor) tutustuin tietokonemusiikin maailmaan.<br>
								<br>
								
							
Teknisesti Amiga-maailma on minulle merkinnyt aina hyviä ohjelmointitapoja
ja kykyä mahduttaa pieneen tilaan paljon. Koodi optimoitua ja koodia vain
siksi, että saadaan toteutettua jokin ohjelman toiminnallisuuden kannalta
tärkeä toiminto. Amiga-maailma on tukenut luovuuttani vahvasti - Amigan
ansiosta olisin tuskin koskaan kiinnostunut piirto-ohjelmista ja
yksittäisistä pikseleistä, taittamisesta tai web-grafiikasta.
Laitteistollisesti Amiga 500 oli varsinainen helmi aikanaan. Ja tuhannet
värit saivat kenen tahansa PC-ihmisen kateelliseksi. Niillä ominaisuuksilla
brassailtiinkin täysillä.<br>
								<br>
								
							
Näissä mietteissä voisi viettää tuntikausia. Voisi muistella lapsuudenajan
kavereita ja niitä hetkiä kun Beach Volleyssä voitti sen vika-matsin. Kun
Sim Cityssä sai aikaan metropolin ja graafisissa Indy-seikkailuissa löysi
tien graalin maljalle. Ne ovat fiiliksiä ja muistoja, jotka ovat niin
syvällä mielessä että niitä haluaa vaalia ja hyvä niin. Mutta kuten aina,
jossain vaiheessa on pakko kohdata nykyisyys ja elää tätä päivää.<br>
								<br>
								Faktat ovat varsin selv&auml;t ja rankat. En voi ostaa nyky&auml;&auml;n Amigaa Infosta enk&auml; saada k&auml;ytt&auml;j&auml;tukea soittamalla sille varattuun spesiaalinumeroon. Lis&auml;ksi minulle melkein nauretaan p&auml;in naamaa, kun kerron AmigaOS:ta ja Amigan uudesta tulemisesta. Ennen niin itsest&auml;&auml;nselv&auml;st&auml; asiasta on tullut v&auml;ittelyiden ja huhujen tyyssija. Nimi johon on assosioitunut jatkuva jos-ja-kun ajattelu. Ollaan kaukana niist&auml; (kyll&auml;kin v&auml;h&auml;isist&auml;) Commodore-ajan <a href="http://www.commodorebillboard.com" target="_blank">mainosteksteist&auml;</a>, joissa luki sanomalehden jakajallekin selke&auml; viesti: &quot;Amiga-k&auml;ytt&auml;j&auml;n&auml; olet askeleen edell&auml; muita&quot;.<br>
								<br>
								
							
En voi kritisoida Amiga Inc.:n toimintaa. Jos minulla olisi sama  raha ja
tieto-omaisuus - en tiedä voisinko tehdä asiat yhtään  paremmin. Kova
tosiasia on, että Amiga Inc. on menettänyt järjestään kaikki kaupalliset
yhteistyökumppanit, joiden kanssa olisi pitänyt tehdä bisnestä. Nykyään on
mahdotonta nousta maailman valloittajaksi ilman hyviä yhteistyökumppaneita.
Ok, Microsoft on Amigaa auttanut Amiga DE -pelipaketin jakelussa,  mutta
missä se näkyy minulle suomalaisena kuluttajana? Ja "to be honest" ketä se
kiinnostaa? Ei ainakaan minua, amigisteista puhumattakaan.<br>
								<br>
								
							
Palaan tietokoneen äärelle, se ei muutu Amigaksi unelmoimalla. Taistelen
käyttöjärjestelmän ongelmien kanssa. On normaalia puhua, että kymppitonnin
sijoitus tökkii ja jökkii. Menoon ei ole tulossa muutoksia lähiaikoina -
mutta ehkä sittenkin. Amigistina olen oppinut optimistiseksi. Ehkä uusi
AmigaOS 4 räjäyttää pankin ja saa minut ostamaan AmigaOnen. Silti tulen
tekemään työni PC:llä ja niillä erinomaisilla ohjelmilla, joista
Amiga-maailmassa on  korkeintaan uneksittu. Tekisin varmasti toisin jos
voisin. Yksi asia minkä vuoksi olen ollut Amiga-menossa mukana on Suomen
Amiga-käyttäjät ry. On ollut hienoa osoittaa maailmalle, että kaatuilevalle
käyttöjärjestelmälle on olemassa vaihtoehto. Se on sitä tosiharrastajan
ylpeyttä.<br>
								<br>
								<i>&quot;You may say I'm a dreamer<br>
									
								
								But I'm not the only one<br>
									
								
								I hope someday you'll join us<br>
									
								
								And the world will be as one&quot;<br>
								</i><br>
								
							
							-- John Lennon: Imagine</font></p>
					</td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>