<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Haastattelussa Genesin Bill Buck ja Raquel Velasco</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:janne.siren@helsinki.fi">janne.siren@helsinki.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/th000028.jpg" alt="Bill Buck, Raquel Velasco, Petro Tyschtschenko" height="150" width="200" border="1"></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="left">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Bill, Raquel ja Petro.<br>
											Kuva &copy; <a href="http://www.amiga-news.de" target="_blank">amiga-news.de</a>. </font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<b><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Saksalaisen bPlanin ja ranskalaisen Thendic France -yhti&ouml;n fuusiossa hiljattain syntyneen Genesi-yhti&ouml;n vetovastuun jakavat William H. Buck, tutummin Bill Buck, ja Raquel Velasco. T&auml;m&auml; aisapari tuli tutuksi Amiga-k&auml;ytt&auml;jille jo vuonna 1996 VIScorpin kamppailtua Amigan omistuksesta (ks. esim. Saku #19). Nyt Genesi kisaa amigistien syd&auml;mist&auml; ja euroista Amiga-yhteensopivalla MorphOS-k&auml;ytt&ouml;j&auml;rjestelm&auml;ll&auml; ja sille suunnitellulla PowerPC-pohjaisella Pegasos-emolevyll&auml;.<br>
								<br>
								Bill ja Raquel ovat olleet runsaasti &auml;&auml;ness&auml; Amiga-uutisryhmiss&auml; ja -saiteilla viime kuukausina. Kommunikaatio on ollut paikoin jopa ylitsevuotavaisen runsasta ja moni kysymys on varmasti j&auml;&auml;nyt askarruttamaan aktiivisemmankin surffailijan mielt&auml;, satunnaisista lukijoista nyt puhumattakaan. Ker&auml;simme t&auml;&auml;ll&auml; Sakussa oman kysymyslistamme ja l&auml;hetimme sen Billin ja Raquelin ihmetelt&auml;v&auml;ksi Pariisiin, jossa he pit&auml;v&auml;t majapaikkaansa. T&auml;m&auml; haastattelu on suomennos maaliskuun puoliv&auml;liss&auml; k&auml;ydyst&auml; s&auml;hk&ouml;postinvaihdosta.</font></b></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuka, mit&auml;, miss&auml;, h&auml;h?</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Saku:</b> Voisitteko molemmat kertoa hieman itsest&auml;nne ja taustastanne? Kaikki eiv&auml;t varmastikaan tunne teit&auml;. Ja miksi vastaatte aina yhdess&auml;? :-)<br>
							<br>
						</font><b><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Bill Buck ja Raquel Velasco: </font></b><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Parasta olisi lukea haastattelu viime vuodelta t&auml;&auml;lt&auml;:<br>
							<br>
							<a href="http://www.amiga-news.de/archiv02/020417_interview_bb_pt.shtml" target="_blank">
							http://www.amiga-news.de/archiv02/020417_interview_bb_pt.shtml</a><br>
							<br>
							Siell&auml; on my&ouml;s kuva meist&auml;... ;-)<br>
							<br>
							Joka tapauksessa, olemme aina yhdess&auml;. Olemme naimisissa ja ty&ouml;skentelemme yhdess&auml;. Joskus s&auml;hk&ouml;postit ovat minulta ja joskus Raquelilta.<br>
							<br>
							<b>Saku:</b> Ennen kuin menemme yksityiskohtiin jotka kenties kiinnostavat suomalaista yleis&ouml;&auml;mme, voisitteko antaa pienen tilannekatsauksen? Mit&auml; Genesi tekee parhaillaan, ja mit&auml; meid&auml;n tulisi odottaa l&auml;hiviikoilta ja kuukausilta? Mik&auml; on kev&auml;&auml;n tapahtumaohjelmanne?<br>
							<br>
							<b>BBRV:</b>&nbsp;Olemme k&auml;ytt&auml;neet viimeiset kolme kuukautta tuodaksemme Crossbeen tiimin mukaan kuvioihin. Voitte vierailla heid&auml;n kotisivuillaan t&auml;&auml;ll&auml;: <a href="http://www.crossbee.com" target="_blank">www.crossbee.com</a>. Saamme Crossbeelt&auml; paitsi kokeneen liikkeenjohtotiimin, my&ouml;s sovellusohjelman. T&auml;m&auml; integroidaan MorphOS:iin ja tarjoamme t&auml;t&auml; ratkaisua suurille yhteis&ouml;asiakkaille - laitteisto, k&auml;ytt&ouml;j&auml;rjestelm&auml;, sovellukset ja kaikki kytkeytyneen&auml; &auml;lykortteihin. Esimerkiksi, jos tarkastelette niit&auml; asioita, joita olemme tehneet langattomien kameroiden ja PDA-laitteiden kanssa Thendic-Francessa ja yhdist&auml;tte t&auml;m&auml;n niiden asioiden kanssa jotka l&ouml;ytyv&auml;t osoitteesta <a href="http://www.ceolia.com" target="_blank">www.ceolia.com</a>, ymm&auml;rr&auml;tte paremmin pitk&auml;n t&auml;ht&auml;imen suunnitelmaamme. Itse asiassa, Ceolia tulee liittym&auml;&auml;n Genesiin my&ouml;s... ;-)<br>
							<br>
							Itse Pegasos-kehitys tulee liittym&auml;&auml;n kahteen avainsuuntaan:<br>
							<br>
							1. Maanp&auml;&auml;llist&auml; digitaalista televisiota varten STB, joka py&ouml;rii PPC:ll&auml; ja MorphOS:ll&auml;.<br>
							<br>
							2. Pegasos II Marvellin north bridge -piirill&auml;.<br>
							<br>
							Meill&auml; on kuuden kerroksen Pegasos II -prototyyppiemolevyt valmiina sis&auml;isiin testeihimme alle kolmessa kuukaudessa. Jos asiat menev&auml;t hyvin, saatamme toimittaa Pegasos II:ta jo paljon aikaisemmin kuin syyskuussa, mutta pit&auml;ydymme siin&auml; p&auml;iv&auml;m&auml;&auml;r&auml;ss&auml; toistaiseksi.<br>
							<br>
							
							MorphOS:&auml;&auml; laajennetaan ja hiotaan entist&auml; vakaammaksi sill&auml; aikaa kun Pegasos II valmistuu. Lisensoimme monia mielenkiintoisia asioita MorphOS:&auml;&auml;n. Esimerkiksi ProStation Audio tullaan toimittamaan k&auml;ytt&ouml;j&auml;rjestelm&auml;n mukana.</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="kuvat/psylent_iso.jpg" target="_blank"><img src="kuvat/psylent_pieni.jpg" alt="Psylent CeBIT-messuilla" height="300" width="400" border="1"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Saku:</b> Useimmat meist&auml; ovat lukeneet Pegasoksesta ja MorphOS:st&auml;. Tunnemme n&auml;m&auml; tuotteet ja ne ovat n&auml;ht&auml;vill&auml;mme. Mutta suunnitelmissanne on my&ouml;s muita MorphOS-pohjaisia tuotteita. Katsotaanpa saanko ne oikein: 1) eclipsis, k&auml;mmenmikro, 2) Psylent, standardi-Pegasos hiljaisessa kotelossa, 3) salaper&auml;inen set-top-boksi joka teilt&auml; on tilattu, sek&auml; tietenkin 4) Pegasos 2. Mik&auml; on n&auml;iden tilanne? J&auml;ik&ouml; joku mainitsematta?<br>
							<br>
							<b>BBRV:</b> Psylent on kokolailla valmis ja uusi kotelo n&auml;ytt&auml;&auml; hyv&auml;lt&auml;. N&auml;ette kuvia osoitteessa <a href="http://www.genesi-support.com" target="_blank">www.genesi-support.com</a>. Suuri STB-projektimme on viiv&auml;st&auml;nyt eclipsis-kehityst&auml; hieman, mutta jatkamme sit&auml; edelleen. Pegasos II:ta jo k&auml;sittelimmekin.<br>
							<br>
							<b>Saku:</b> Teill&auml; on my&ouml;s joitakin muita tuotteita, kuten Cashboy ja Eyecam. Voisitteko kertoa niist&auml; lyhyesti? Mit&auml;, jos mit&auml;&auml;n, tekemist&auml; niill&auml; on p&auml;&auml;suunnitelmanne kanssa?<br>
							<br>
							<b>BBRV:</b> Cashboy on vain Point of Sale -laite. Opimme sen kautta &auml;lykorteista. ComCamia k&auml;ytimme samaan kokemukseen. Meilt&auml; on itse asiassa tulossa kuun lopulla uusi tuote, joka liittyy yll&auml; olevaan Crossbee-keskusteluun ja joka k&auml;ytt&auml;&auml; uutta ComCamia. &Auml;lykortit tulevat kuvioihin seuraavassa vaiheessa.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Pegasosta odotellessa</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Saku:</b> Mai Logicin Articia S ja G4 ovat her&auml;tt&auml;neet paljon keskustelua. Mit&auml; tarkoititte kun sanoitte, ett&auml; nykyinen 600 MHz:n G3-Pegasos suoriutuu paremmin sen kanssa kuin 800 MHz:n G4? Viittasitteko yleiseen suorituskykyyn (kenties keskiarvoon) vai joihinkin erityisiin toimintoihin? Mit&auml; mielt&auml; olette vastav&auml;itteist&auml;, ett&auml; Teron-emolevyt G4:ll&auml; ovat py&ouml;ritt&auml;neet joitakin Linux-pelej&auml; selv&auml;sti G3-vastineitaan nopeammin - mik&auml; kuulostaa varsin loogiselta maallikolle?<br>
							<br>
							<b>BBRV:</b> Tietenkin tarkoitimme sovellusten ajamista. Kaikki sovellukset ovat itse asiassa hyvi&auml; - mit&auml; enemm&auml;n sen parempi ja kaikki k&auml;ynniss&auml; samanaikaisesti. Jonkun muun t&auml;ytyisi m&auml;&auml;ritell&auml; t&auml;m&auml; testi. Me osallistumme mielell&auml;mme odotetulla/tarvitulla/halutulla tavalla.<br>
							<br>
							Olemme testanneet kaikki Main kehitt&auml;m&auml;t laitteistoalustat, koska autoimme heit&auml;. Tied&auml;mme mit&auml; sanomme... ;-)<br>
							<br>
							<b>Saku:</b> Ent&auml; nopeammat G3-prosessorimoduulit Pegasokselle?<br>
							<br>
							<b>BBRV:</b>&nbsp;Ei, enp&auml; usko&#133;<br>
							<br>
							<b>Saku:</b> Mitk&auml; ovat mahdollisuutemme n&auml;hd&auml; lis&auml;&auml; Pegasos-emolevyj&auml; ennen Pegasos 2:ta? Mit&auml;&auml;n mahdollisesta Plexuscom-diilist&auml;?<br>
							<br>
							<b>BBRV:</b>&nbsp;:-) En voi sanoa, mutta Plexuscomin porukat tulevat Pariisiin CeBITin j&auml;lkeen.<br>
							<br>
							<b>Saku:</b> Mik&auml; on MorphOS:n tilanne ja tulevaisuus 1) Teron-emolevyill&auml; (mukaan lukien AmigaOne) ja 2) Phase 5:n PowerPC-korteilla. V&auml;litt&ouml;mi&auml; suunnitelmia MorphOS-myyntipakkaukselle? Eik&ouml; erillinen versio n&auml;ille alustoille kannattaisi nyt kun Pegasos on hetkellisesti myyty loppuun? N&auml;in saataisiin lis&auml;kehitt&auml;jien ja -k&auml;ytt&auml;jien huomio?<br>
							<br>
							<b>BBRV:</b> Ensimm&auml;ist&auml; asiaa olemme yritt&auml;neet edist&auml;&auml; julkisesti ja yksityisesti. Se on kohdannut aivan liikaa ep&auml;harmoniaa ja tarpeetonta negatiivisuutta. Emme koske t&auml;h&auml;n asiaan pariin kuukauteen... Sitten yrit&auml;mme uudelleen.<br>
							<br>
							Toinen idea on hyv&auml;. Ty&ouml;skentelemme parhaillaan uuden, Phase 5:n tuotteille tarkoitetun MorphOS-paketin parissa. Se julkaistaan l&auml;hikuukausien aikana. Emme tule veloittamaan t&auml;st&auml; tuotteesta. </font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Se paljon puhuttu yhteis&ouml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Saku:</b> Mik&auml; on mielipiteenne Amigan ja UNIXin vertailusta k&auml;ytt&ouml;j&auml;rjestelmin&auml;, jotka molemmat on kloonattu? Pit&auml;isittek&ouml; MorphOS:&auml;&auml; ja AmigaOS:&auml;&auml; hieman samanlaisena tapauksena kuin BSD:t&auml; ja UNIX:ia? Mik&auml; on mielest&auml;nne MorphOS:n ja Genesin perustelu paikalleen Amiga-yhteis&ouml;ss&auml;?<br>
							<br>
							<b>BBRV:</b> MorphOS on osa yhteis&ouml;&auml;. Muut kysymykset soveltuvat paremmin aurinkoiseen viikonloppuiltap&auml;iv&auml;&auml;n oluen tai kahvin &auml;&auml;relle... ;-)<br>
							<br>
							<b>Saku</b>: Olette tukeneet demoscene&auml; aktiivisesti monin tavoin. L&auml;hetitte meille t&auml;nne Suomeen n&auml;ht&auml;v&auml;&auml; Alternative Party 2003:een, ja ymm&auml;rt&auml;&auml;kseni olette maininneet Helsingiss&auml; j&auml;rjestett&auml;v&auml;n Assembly 2003 -tapahtuman joissakin viesteiss&auml;nne. Oletteko olleet jo yhteydess&auml; tapahtumaj&auml;rjest&auml;jiin? Mitk&auml; ovat suunnitelmanne siell&auml;? Tiesittek&ouml;, ett&auml; Assemblyss&auml; on j&auml;rjestetty sponsoroituja kompoja? Viime vuonna Nokia sponsoroi Nokia 7650 -Java-ohjelmointikilpailun.<br>
							<br>
							<b>BBRV:</b> Kyll&auml;, meill&auml; on hyv&auml;t yhteydet Mikko Virtaseen. Meid&auml;n tulisi tehd&auml; sama juttu kuin Nokia!<br>
							<br>
							<b>Saku:</b> Okei, tied&auml;n ett&auml; tied&auml;tte t&auml;m&auml;n - kaikki eiv&auml;t pid&auml; teist&auml;. Kommunikaatiotyylinne on melko ep&auml;tavallinen. Kommentteja?<br>
							<br>
							:-)<br>
							<br>
							<b>Saku:</b> Viimeisen&auml; kysymyksen&auml;ni en kysy sit&auml; tavallista, vaan pohdiskelen hieman mennytt&auml; ennen kuin katsomme eteenp&auml;in. Suomen Amiga-k&auml;ytt&auml;j&auml;t t&auml;ytt&auml;&auml; kymmenen vuotta t&auml;n&auml; kev&auml;&auml;n&auml;. Kun aloitimme, Commodore oli viel&auml; maisemissa. Kuluneen kymmenen vuoden aikana maailma on mennyt menojaan, mutta kehitys Amiga-yhteis&ouml;ss&auml; on antanut odottaa itse&auml;&auml;n. Jopa te yrititte kertaalleen VIScorpin kanssa. Nyt, viimeinkin, edistyst&auml; tapahtuu, mutta ei varmastikaan siihen yhteiseen suuntaan, jonne kymmenen vuotta sitten kuvittelimme kulkevamme. Yhteis&ouml; on en&auml;&auml; kinasteleva varjo entisest&auml;. Loppukommentti aiheesta?<br>
							<br>
							<b>BBRV:</b>&nbsp;T&auml;m&auml; on vuosi 2003. Se mit&auml; on tapahtunut, on tapahtunut, ja mit&auml; nopeammin saamme kaikki keskittym&auml;&auml;n siihen mit&auml; on t&auml;&auml;ll&auml; NYT ja mit&auml; voidaan tehd&auml;, voimme kenties luoda jotain UUTTA ja PAREMPAA.<br>
							<br>
							<b>Saku:</b> Kiitos vastauksistanne!<br>
							<br>
							<hr>
							<br>
							Lis&auml;tietoja Genesist&auml; ja heid&auml;n tuotteistaan l&ouml;ytyy osoitteesta <a href="http://www.genesi.lu" target="_blank">www.genesi.lu</a> ja <a href="http://www.pegasosppc.com" target="_blank">www.pegasosppc.com</a>. Pegasosta kannattaa tulevaisuudessa kysell&auml; Suomessa esimerkiksi Gentle Eye Ky:lta, <a href="http://www.ge.vip.fi" target="_blank">www.ge.vip.fi</a>. Suomessa Pegasosta on esitellyt Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. vuosikokouksessa 2002 ja Alt Party 2003:ssa. Kuvia n&auml;ist&auml; tapahtumista on yhdistyksen kotisivuilla osoitteessa <a href="http://saku.amigafin.org" target="_blank">saku.amigafin.org</a>.</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>