<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Aminet33</title>
</head>
<body background="cd_aminet33.gif" text=black link=blue alink=red bgcolor=gray><br>
<font color="#800000" size="7">
<center><b>WILLKOMMEN ZUR AMINET CD 33</b></font></center><br>
Wenn Frame noch vorhanden, dann bitte hier <a href="cd_aminet33.html" target="_top">
<b> klicken </a></b>.<br><br>
<table border=0 width=100% cellspacing=0 cellpadding=5>
<tr><td colspan=2>

Wie seit langer Zeit eingespielt wird man in der &quot;LiesMich&quot; mit der allgemeinen &Uuml;bersicht
begr&uuml;&szlig;t:<br><br>

Diese CD enth&auml;lt die Dateien, die seit CD 32 hinzugekommen sind sowie
 die momentan beliebtesten Archive. Der Inhalt (nach Dekompression): </td></tr>

<tr><td align=right> 750<br>  160<br>  12<br> 2</td>
    <td> MB neue Software erschienen zwischen Aminet32 und dem 5. September<br>
         MB popul&auml;re Software vom Aminet<br>
         MB Amiga-News im HTML-Format<br>
         MB kommerzielle Software: Das Denkspiel Marblelous 2
</td></tr>
<tr><td colspan=2> usw. usw. usw. </td></tr>
<tr><td colspan=2> <hr> </td></tr>
<tr><td colspan=2>
<p>
<img hspace=10 vspace=4 src="cd_aminet33.jpg" alt="[ CDROM Cover ]"
width=237 height=232 align=right> 
Aminet-CD Kenner haben sofort gesehen, dass die vier
Eingangsschaltfl&auml;chen etwas umstrukturiert wurden. <b>Neue
Software</b>, das kennen wir, wird aber auch immer weniger.
<b>Popul&auml;re Software</b>: Das klingt so wie, das muss ich haben.
<b>Amiga-News</b>, den Ausdruck haben wir doch schon &ouml;fter
geh&ouml;rt. <b>Kommerzielle Software</b>, das geh&ouml;rt doch schon
l&auml;ngst zur st&auml;ndigen Einrichtung. </p>

<p>Bevor ich nun diese CD vorstelle, seien mir ein paar Worte in eigener
Sache gestattet. Diese Besprechung von Aminet-33 ist meine letzte dieser
Reihe. Es sind nun &uuml;ber zwei Jahre ins Land gegangen, als ich mit
Aminet-21 begonnen hatte. Nun ist es wirklich an der Zeit, dass ein neuer
Stil und auch mehr Sachverstand in diese Testreihe eingebracht wird. Dies
wurde mir augenf&auml;llig bewusst, als ich mir den ersten Titel unter
popul&auml;rer Software anschaute <ul>
<li> mui38usr.lha </li></ul>
und feststellen durfte, dass dieses Programm (MUI 3.8) in dieser Form und
Zusammenstellung erstmals auf einer Aminet-CD (Einzel-CD, bei Sets
wei&szlig; ich es nicht) enthalten ist und das komplette Programm
enth&auml;lt, das aus der Zeit zwischen dem 13. Juli 1996 und dem 13.
Februar 1997 resultiert. Da ich registrierter User bin, kann ich leider
nicht feststellen, ob diese Ver&ouml;ffentlichung nur eingeschr&auml;nkt
nutzbar ist und sich erst selbstst&auml;ndig nach Erhalt eines Keys sich
freigibt oder ob es jetzt schon voll ohne Einschr&auml;nkung arbeitet. Aber
ich gehe davon aus, dass es immer noch keine Freeware ist, denn das
Programm (Stand 13.Feb 97) ist ohne einem neuen Text oder Readme
ver&ouml;ffentlicht. </p>

<p>Nach Betrachtung anderer Programme stellte sich bei mir ein agressiver
und leider ein wirklich negativer Schreibstil ein, so dass ich
erschrockenerma&szlig;en diese zwei oder drei Stunden Schreibarbeit sofort
l&ouml;schte. Aber einen Lichtblick hatte ich doch. Die dritte
Schaltfl&auml;che beinhaltet die Homepage von Petra Struck. Im vorliegenden
Falle wird sie durch Bet&auml;tigen der obigen Schaltfl&auml;che &uuml;ber
ein Programm Tools/RunVoyager aufgerufen. Der verwendete Browser ist
Voyager V 2.92Beta (ohne Online-Bef&auml;higung) und wird im RAM
installiert. Wer aber seinen eigenen Browser verwenden m&ouml;chte ruft
dann &uuml;ber Lokale Datei &ouml;ffnen das File Aminet33:News.html auf.
Die Homepage liegt als Guides/HTML vor. Wer sich nun diese Homepage in Ruhe
betrachten will, sollte sie auf seine Festplatte laden und verschiedene
Links berichtigen. Wie es n&auml;mlich aussieht wurden die ersten
Vorbereitungen f&uuml;r Aminet32 getroffen oder es liegt ganz einfach nur
ein Schreibfehler vor. Auch die archivierten News sind nicht in einem
Directory "Test", wie die Links aussagen, sondern in ihren richtigen
Ordnern. Aber auch von der CD betrachtet ersieht man den immensen
pers&ouml;nlichen Aufwand, den Petra Struck mit ihrer Homepage betreibt,
den man bei einem Surf-Besuch gar nicht so &uuml;berblicken kann. Es lohnt
sich wirklich, mal ein Weilchen zu verweilen. Etwas hat sie aber leider
wohl &uuml;bersehen, das ist die Sucht nach Profilneurosen mancher User.
Sie hat n&auml;mlich die M&ouml;glichkeit er&ouml;ffnet, einen Link durch
den Besucher zu dessen Homepage einzubringen. Zwischenzeitig sind es schon
so viele, dass obwohl in Kategorien eingeteilt die &Uuml;bersichtlichkeit
verloren geht. Abschlie&szlig;end kann ich nur sagen, schaut euch diese
Homepage an. Und wenn man bedenkt, dass dies alles "handmade" ist, sollte
man mit dem n&ouml;tigen Respekt nicht geizen. </p>
<hr width=90%>

<p>Das Geschicklichkeits- und vor allem Denkspiel Marblelous 2 kennen die
meisten wahrscheinlich schon, mindestens die Version 1 aber bestimmt.
Dieses Spiel stammt von, ach was - ich setze einfach den ersten Teil der
Anleitung hier ein und schon wei&szlig; auch der Bescheid, der dieses Spiel
noch nicht kennt. </p>

<p align=center> Marblelous 2 <br>
Copyright © 1998/99 APC&TCP, Andreas Magerl & Frank Otto </p>


<p>

<img src="cd_aminet33a.jpg" alt="Titelbild" hspace=10 vspace=4
width=320 height=256 align=left>
<b>System</b><br>
Marblelous 2 ben&ouml;tigt 1 MByte Ram, und funktioniert damit auf jedem
Amiga, unterst&uuml;tzt jedes Grafik Chipset (OCS/ECS/AGA)* und
nat&uuml;rlich Grafikkarten. </p>

<p>Die PAL-Version (OCS/ECS/AGA) l&auml;uft mit 50 Bildern pro Sekunde, die
RTG-Version* l&auml;uft auf einer Grafikkarte ebenfalls mit dieser
Geschwindigkeit, jedoch h&auml;ngt dies von der verwendeten Konfiguration
ab. Eine schnelle Grafikkarte bzw. Bussystem (Zorro) ist die Voraussetzung.
Ein schneller Prozessor wirkt sich hierbei ebenfalls positiv aus. </p>

<p>Besitzen Sie eine Cybervision64-3D-Grafikkarte sollten Sie die
ENV-Variable CPU2C auf 0 setzen (wie das geht, steht in der Anleitung).
F&uuml;r Marblelous 2 sollten Sie einen Bildschirmmodus mit 256 vertikalen
Pixeln ausw&auml;hlen. H&ouml;here Aufl&ouml;sung verlangsamen das Spiel
blo&szlig;. Wenn Sie keinen Bildschirmmodus mit 256 Pixeln vertikal haben,
k&ouml;nnen Sie sich selber einen erstellen (auch dazu mehr in der
Anleitung ihrer Grafikkarte). </p>

<p>Eine Cybervision64/3D mit Zorro3-Bus und 68040-Prozessor l&auml;uft mit
ungef&auml;hrer Original-Geschwindigkeit. Ein 68030-Prozessor ist das
Minimum f&uuml;r eine spielbare RTG-Version von Marblelous 2. Mit einer
Zorro-2-Grafikkarte ist das Spiel aber auch noch gerade spielbar (ca. 25
Bilder/Sekunde). </p>


<p>* OCS, ECS und AGA bezeichnen die Grafik-Chips des Amiga. OCS (Original
Chip Set) kam in den ersten Amigas (A500, A1000, A2000) zum Einsatz, ECS
(Enhanced Chip Set) in etwas neueren (A600, A3000). OCS und ECS sind
f&uuml;r Marblelous 2 bedeutungsgleich, sie k&ouml;nnen n&auml;mlich
h&ouml;chstens 32 Farben darstellen. <br> Der neueste Grafik-Chip, AGA
(Advanced Graphics Architecture), vorhanden in den neuesten Modellen
(A1200/A4000), wird ben&ouml;tigt f&uuml;r die 256-farbigen Grafiken. RTG
(Retargetable Graphics) erm&ouml;glicht, beliebige Bildschirmmodi
anzuw&auml;hlen und ist daher eher f&uuml;r Grafikkarten geeignet. </p>


<p><b>Installation</b><br>

Die AGA/Grafikkarten-Version k&ouml;nnen Sie von der CD spielen. Mit dem
Install-Skript l&auml;&szlig;t sich das Spiel allerdings auch einfach auf
die Festplatte installieren. </p>

<p>Wenn Sie nicht &uuml;ber das AGA-Chipset verf&uuml;gen, m&uuml;ssen Sie
die ECS-Version auf Ihre Festplatte installieren. </p>

<p>Auf der CD oder nach Festplatten-Installation haben Sie drei Icons zur
Auswahl: <ul>
<li> Marblelous2 (OCS/ECS/AGA-Version),</li>
<li> Marblelous2RTG (f&uuml;r Grafikkarten)</li>
<li> und den Editor. </li></ul>
    
HINWEIS: Um einige der Icons in der richtigen Farbpalette darzustellen,
mu&szlig; die Workbench auf 256 Farben eingestellt sein! </p>


<p><b>Entwicklung</b><br>

Mit der Programmierung von Marblelous 2 wurde Mitte '96 begonnen. Damals
war geplant, das Spiel gegen Ende '96 zu ver&ouml;ffentlichen. Schnell
wurde jedoch erkannt, da&szlig; es unm&ouml;glich ist, ein Spiel innerhalb
eines halben Jahres fertig zu stellen und so wurde der
Ver&ouml;ffentlichungstermin kurzerhand auf Ende '97 verschoben. </p>

<p>Eigentlich h&auml;tte Marblelous 2 bis dahin fertig werden k&ouml;nnen,
was mit den urspr&uuml;nglich geplanten Eigenschaften auch m&ouml;glich
gewesen w&auml;re. Geplant war n&auml;mlich: <ul> 
<li> OCS/ECS-Grafik (32 Farben) </li>
<li> 100% identisches Gameplay mit Marblelous 1 </li>
<li> einzige Neuerung: Der Editor </li></ul></p>

<p>Gegen Ende '97 habe ich mir jedoch eine Grafikkarte zugelegt und
gemerkt, wie umst&auml;ndlich es ist, wenn man immer auf das Amiga-Display
zur&uuml;ckschalten mu&szlig;, um Spiele zu spielen. Das war bei so gut wie
allen Spielen der Fall. Marblelous 2 sollte nicht dazu geh&ouml;ren und
daher wurde der Erscheinungstermin wieder verschoben. </p>

<p>Nach einigem Kennenlernen der Eigenschaften einer Grafikkarte und
Erkundigen nach deren Programmierung sowie einigen Programmierpausen (ich
mu&szlig;te mich ja auch noch um den Gro&szlig;teil der Grafik und Musik
k&uuml;mmern), hatten wir schon '98 und der Grafikkarten-Support wurde
endlich in den Editor eingebaut und eine neue Grafikkarten-taugliche
Version des Spiels geschrieben. Letzteres hat 2 Tage gedauert (t&auml;glich
vielleicht 2-3 Stunden) und beim Editor war es eine Sache von wenigen
Minuten. </p>

<p>Viele Programmierer klagen dar&uuml;ber, da&szlig; es so schwierig und
umst&auml;ndlich sei, AmigaSpiele auf einem Grafikkarten-Bildschirmmodus
lauff&auml;hig zu machen. Alles, was man machen mu&szlig;, wenn das Spiel
nicht 100% aus Assembler-Code besteht (wer macht das schon?), sind ein paar
simple Anpassungen wie s&auml;mtliche Copper- (die so sch&ouml;ne
Farbverl&auml;ufe erzeugen) und Sprite-Befehle zu entfernen. </p>

<p>Ihnen ist bestimmt schon aufgefallen, da&szlig; in der RTG-Version keine
Farbverl&auml;ufe sind (z.B. bei der Stoppzeit). </p>

<p>Also als Aufruf an alle Amiga-Spiele-Programmierer: Unterst&uuml;tzt
endlich Grafikkarten! </p>

<p>Kurz vor dem geplanten Ver&ouml;ffentlichungstermin wurden noch die
Grafiken &uuml;berarbeitet und liegen nun in 32 und 256 Farben vor. 1998
ist wirklich viel zu sp&auml;t f&uuml;r ein 32-Farben-Spiel.</p>
      

<p>Und nun: Viel Spa&szlig; mit Marblelous 2 !<br><br>

Frank Otto<br><br>

Produzent: APC&TCP, Andreas Magerl
</p>
</td></tr></table>
<hr size="4">
 
<table border=0 width=100% cellspacing=3 cellpadding=3>
<tr><td>
Es folgen einige Highlights dieser CD. Mods, Spiele, Bilder und Demos
werden hier nicht mit aufgelistet.<br>
Dieser Vorschlag ist aus der CD &uuml;bernommen.
</td></tr></table>
<pre>
 &quot;amirc.lha&quot;          comm/irc    958K  &quot;GUI-IRC-Client (v3.1)&quot;
 &quot;YAM20.lha&quot;          comm/mail   658K  &quot;MUI EMailprogramm V2.0 (Grundistallation)&quot;
 &quot;CManager.lha&quot;       comm/misc   498K  &quot;Systemweite Verwaltung von Internetadressen&quot;
 &quot;newscoaster.lha&quot;    comm/news   243K  &quot;Offline Newsleser Version 1.14 (MUI)&quot;
 &quot;SimpleFTP.lha&quot;      comm/tcp     74K  &quot;SimpleFTP - Neuer und einfach zu nutzender FTP-Klient&quot;
 &quot;AWebResume.lha&quot;     comm/www     53K  &quot;Integriert HTTP-Wiederaufnahme in AWeb&quot;
 &quot;PPC680x0Final.lha&quot;  dev/asm      73K  &quot;Nutze Deinen PPC als den ultimativen 68k! Endgueltige Version&quot;
 &quot;DTypeGuide.lha&quot;     docs/lists   28K  &quot;Hilfe zu 254 Amiga-Datatypes -25-&quot;
 &quot;DevGuide.lha&quot;       docs/lists   31K  &quot;Hilfe zu 343 Amiga-Devices   -23-&quot;
 &quot;LDDcheck.lha&quot;       docs/lists   91K  &quot;Systempruefer (Libs, DTs, Devs)   - 4-&quot;
 &quot;LibGuide.lha&quot;       docs/lists  181K  &quot;Hilfe zu 2475 Amiga Libraries -39-&quot;
 &quot;amiuserlist.lha&quot;    docs/lists   44K  &quot;Welt-Weite Amiga User Liste V5.27&quot;
 &quot;JpegTool.lha&quot;       gfx/conv     17K  &quot;Datatypes <-> jpeg Umwandler (1.8)&quot;
 &quot;DMandel.lha&quot;        gfx/fract    95K  &quot;Mandel & Julia-Generator mit ARexx, RTG&quot;
 &quot;RiVA.lha&quot;           gfx/show     26K  &quot;MPEG-Abspieler (v0.20), sehr schnell!!!&quot;
 &quot;akMPEG2.lha&quot;        gfx/show    353K  &quot;MPEG-Abspieler fuer CyberGfx/AGA V2.52 (68k/PPC)&quot;
 &quot;AROS-lx86-bin.tgz&quot;  misc/emu    1.9M  &quot;AROS - Amiga Research OS (Beta-Veroeffentlichung)&quot;
 &quot;AROS-source.tgz&quot;    misc/emu    3.4M  &quot;AROS - Amiga Research OS (Beta-Veroeffentlichung)&quot;
 &quot;8svxtoxxx.lha&quot;      mus/misc     16K  &quot;IFF-8SVX nach 8SVX, RAW, AIFF, WAV, VOC co&quot;
 &quot;Pegase.lha&quot;         mus/misc    250K  &quot;Hochwertiger mp2 Audio-Komprimierer (68k/PPC)&quot;
 &quot;vocoder-m68k.lha&quot;   mus/misc     68K  &quot;Shellgesteuerter Stimmenverzerrer&quot;
 &quot;prtman39.lha&quot;       text/print  164K  &quot;Druckauftragsmanager f&uuml;r AmigaOS3 (39.27)&quot;
 &quot;VersCheck.lha&quot;      util/cli    418K  &quot;Teste deine libs,MUI,devs,dtypes,classes,handler&quot;
 &quot;simplefind3.lha&quot;    util/dir    226K  &quot;V1.0 des erneuerten File Finders&quot;
 &quot;FastFontList.lha&quot;   util/misc     9K  &quot;Beschleunigt das Auflisten von Zeichensaetzen&quot;
 &quot;ReqAttack.lha&quot;      util/misc   490K  &quot;V1.0 Tolle neue Verbesserung fuer Dateiwaehler&quot;
</pre>

<hr size="4">
<table border=0 width=100% cellspacing=5 cellpadding=0> <tr><td>
<p>Was schauen wir uns heute einmal an? <br><br>
Wie sagte weiland mein Physiklehrer:<br> Liebe Sch&uuml;ler, ihr seht, dass
ihr nichts seht, so das habt ihr gesehen.</p>

<p>Genau so geht es mir heute. YAM2.0 kennt ihr alle und zu den anderen
sogenannten Highlights f&auml;llt mir leider nicht sehr viel ein. In
misc/sci gibt es eine Sternedatenbank "DAlmanac_Extra.lha" von 12 MB, die
leider nur nutzbar ist, wenn man registrierter User ist. Diese Datei soll
&uuml;ber 1 Million Sterne beheimaten. </p>
</td></tr></table>

<hr size="4">

<a name=a1>Hier eine globale &Uuml;bersicht &uuml;ber Aminet33:</a><br><center>
<table border="2" cellpadding="3" cellspacing="2" width="90%">
<tr><td> <a href=cd_aminet33a.html#a1> &quot; biz  &quot; </a></td>
<td> Business software </td><td align="right"> 14,0 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a2> &quot; comm &quot; </a></td>
<td> Communications </td><td align="right"> 22,0 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; demo &quot; </td>
<td> Gfx and sound demos </td><td align="right"> 65,0 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet33a.html#a3> &quot; dev  &quot; </a></td>
<td> Development software </td><td align="right"> 14,2 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a4> &quot; disk &quot; </a></td>
<td> Disk/Harddisk tools </td><td align="right">  1,3 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a5> &quot; docs &quot; </a></td>
<td> Text documents </td><td align="right"> 55,7 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; game &quot; </td>
<td> Games </td><td align="right"> 49,3 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet33a.html#a6> &quot; gfx  &quot; </a></td>
<td> Graphics </td><td align="right"> 15,9 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a7> &quot; hard &quot; </a></td>
<td> Hardware </td><td align="right"> 7,4 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a8> &quot; misc &quot; </a></td>
<td> Miscellaneous </td><td align="right"> 33,9 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; mods &quot; </td>
<td> Music modules </td><td align="right"> 169,1 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet33a.html#a9> &quot; mus  &quot; </a></td>
<td> Musical software </td><td align="right"> 15,9 MB </td><td>&nbsp;</td></tr>
<tr><td> &quot; pix  &quot; </td>
<td> Pictures </td><td align="right"> 42,2 MB </td><td> weggelassen </td></tr>
<tr><td> <a href=cd_aminet33a.html#a10> &quot; text &quot; </a></td>
<td> Text related </td><td align="right"> 2,0 MB </td><td>&nbsp;</td></tr>
<tr><td> <a href=cd_aminet33a.html#a11> &quot; util &quot; </a></td>
<td> Utilities </td><td align="right"> 24,9 MB </td><td>&nbsp;</td></tr>
</table></center>
</p>

<br><br><center>
<table border="6" width=90%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
<center><font size="+1">
<a href="NoCover.html" target="_top"> Zur&uuml;ck zur NoCover </a></font>
</center></table></center></center><br>
</body>
</htlm>
