
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Test: C 64 ClassiX</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="WHITE">CD Test: C 64
ClassiX</FONT></h1></CENTER></P>
Viele Amiga User werden schonmal einen C 64 benutzt haben bzw. haben ihren
&quot;Brotkasten&quot;
noch heute in Betrieb, um ab und an einfach mal die guten, alten Klassiker
zu zocken. Epic Marketing hat nun mal wieder eine Compilation auf den
Markt geworfen, die sich ganz dem Themenkomplex der C 64 Spiele widmet, um
das alte Feeling nochmals r&#252;ber kommen zu lassen. Ob es gelungen ist, wird
dieser Test zeigen.</P> 

<h2><CENTER><FONT COLOR="GREEN">Obligatorisches</FONT></CENTER></h2></P>
Um einen C 64 zu emulieren braucht man erstmal einen Emulator. Und Epic
kamen mal wieder auf die Idee, die CD nicht nur Amiga- sondern auch
PC-tauglich zu machen, in dem sie auch noch PC Emulatoren draufpackten.
Darauf will ich aber auch nicht weiter eingehen. An Emulatoren f&#252;r den Amiga
liegen Frodo, A64 (!!!), AXF 64 und Magic64 bei. Alle Emulatoren sind nicht
mehr die neusten ihres Genres und deswegen sollte man st&#228;ndig einen Blick
ins Aminet riskieren und evtl. eine neuere Version runterladen. 
Um die optimale Performance
zu erreichen, sollte man mal alle Emulatoren ausprobiert haben, aber auf den
meisten Systemen ist MagicC64 sicherlich die richtige Wahl. Nachdem man alles richtig
installiert &amp; konfiguriert hat, kann es endlich losgehen. Auf der CD
befinden sich insgesamt &#252;brigens 520 MB - eine recht staatliche Menge, wenn
man bedenkt, wie klein ein Spiel damals lediglich war.</P>

<h2><CENTER><FONT COLOR="YELLOW">Was gibt`s
inhaltlich?</FONT></h2></CENTER></P>
Inhaltlich dreht sich auf der CD nat&#252;rlich alles um Spiele. Laut
<img src="c64_1.png" align=left>Herrstellerangabe sollen sich auf der CD &#252;ber 2.500 verschiedene C 64 Games
befinden, was ganz gut hinkommt. Einige existieren zwar auch in Amiga
Versionen, aber es ist doch ganz interessant, mal die Originale zu sehen. Die
Games sind alphabetisch geordnet, was die Suche nach einem bestimmten Titel
kr&#228;ftig erleichtert. Unter den Spielen selber befinden sich zahlreiche
Klassiker, wie z.B. &quot;Buggy Boy&quot;, &quot;Paperboy&quot;, &quot;Rodland&quot;, &quot;Frogger&quot;,
&quot;Parallax&quot; oder auch &quot;Robin Hood&quot;. Der C 64 Fan wird auf jeden Fall einiges
an passenden Games finden. Was allerdings bedenklich ist, ist die Tatsache,
da&#223; die Games einfach aus dem Internet geladen wurden und ohne Absprache mit den
Copyrightinhabern auf die CD kopiert wurden. Das es sich mitunter auch um gecrackte Versionen handelt,
muss wohl nicht noch explizit erw&#228;hnt werden.</P>

Wenn man davon mal absieht, kann man mit den Spielen sehr viel Spa&#223; haben.
Die Grafik ist nat&#252;rlich nicht mehr das Ma&#223; der Dinge, aber das soll sie ja auch
nicht sein. Im Gegensatz zur heutigen Zeit, stand damals ja auch ein hoher
Spa&#223;faktor an erster Stelle (und kaum Rechenpower) und der wird auch von einer Vielzahl der Spiele
erreicht. Es ist teilweise sogar schon erstaunlich, wiviel Fun es machen
kann, so banale Games wie &quot;Pacman&quot; oder &quot;Frogger&quot; in grafisch armseligen
Versionen zu spielen - und das n&#228;chtelang. Ein hoher Suchtfaktor ist also
garantiert und wenn ihr erstmal losgelegt habt, werdet ihr nur noch schwer
zu bremsen sein (dies gilt nat&#252;rlich nur f&#252;r User, f&#252;r die superfl&#252;ssige 3D
Grafik nicht das einzig wichtige an einem guten Game ist!). Auch der Sound
kann emuliert werden und stellenweise hatte ich das Gef&#252;hl, da&#223; ich in einer
Spielhallen bin.</P>

Neben den Spielen befinden sich auch noch &#252;ber 10.000 (!!) Sid Tunes
(Musikdateien), die aus Spielen &amp; Demos stammen samt Abspieler (Play Sid 3),
auf der Silberscheibe. 
Auch hier kann man nochmal in nostalgische Augenblicke absinken und die
Musik richtig genie&#223;en. Zwar ist es nahezu unm&#246;glich, sich mal alles davon
angeh&#246;rt zu haben, aber die bekannteren Sachen startet man doch immer mal
wieder gerne. Eine nette Zugabe stellen die Sid Tunes allemal da.</P> 

<h2><CENTER><FONT COLOR="RED">Systemanforderungen?</FONT></CENTER></h2></P>
&quot;Einen total veralteten Rechner nachzubilden d&#252;rfte kein alzu gro&#223;es Problem
sein&quot;, werden sich jetzt viele sagen. Ok, ich denke mal, da&#223; die
Systemanforderungen f&#252;r alle, die die NC lesen, wirklich kein Problem
darstellen sollten. Von Emulator zu Emulator ist dies nat&#252;rlich
unterschiedlich, aber wenn folgende Punkte erf&#252;llt sind, sollte dem
Spielvergn&#252;gen nichts mehr im Weg stehen:</P><UL>

<li>68030 / 50 MhZ</P>

<li>8 MB Ram</P>

<li>OS 3.0</P></UL>

Additional ist eine Grafikkarte (z.B. f&#252;r Frodo) sowie ein schnellerer
Prozessor nat&#252;rlich von Vorteil. Auf einem Rechner mit 68060 und einer Cybervision Grafikkarte
erreicht man mit Frodo bei allen eingestellten Details ca. 140-160 % der
originalen C 64 Geschwindigkeit. Sollte der eigene Rechner zu langsam sein,
kann man ja immer noch Frames &quot;skippen&quot; (&#252;berspringen) und der Spielspa&#223;
wird dadurch auch nicht merklich getr&#252;bt. Probieren geht &#252;ber studieren!</P>
<CENTER><img src="c64_2.png"></P><img src="c64_3.png"></P></CENTER>
<h2><CENTER><FONT COLOR="GRAY">Fazit</FONT></h2></CENTER></P>
Die CD ist sicherlich mehr als gelungen: Der Inhalt stimmt absolut und gibt
keinen Grund zur Beanstandung. Die Auswahl an Spielen ist sicherlich
erstklassig und garantiert viele schlaflose N&#228;chte. Die zahlreichen Sid
Tunes werten das ganz noch weiter auf. Auf der anderen Seite ist da
nat&#252;rlich der unversch&#228;hmt hohe Preis von 49 DM (bei Epic) zu nennen, der
dem einen oder anderen K&#228;ufer sicherlich &#252;bel aufsto&#223;en wird.
Nichtsdestotrotz ist die CD allemal empfelenswert und f&#252;r jeden (ehemaligen)
C 64 User ein unabdingbares Muss!</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>49 DM (bei Epic)</TD>
</TR>
<TR>
<TD>Inhalt</TD>
<TD>C 64 Spiele & Sid Tunes</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>520</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>80 %</TD>
</TR>
</TABLE></CENTER>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
