

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Gilbert Goodmate Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><B>Gilbert Goodmate Preview</CENTER></h1></B></P><HR>
<CENTER><img src="gg.jpg"></P></CENTER>
<HR>
<FONT SIZE="+1">
Adventures haben auf dem Amiga eine lange Tradition: Indiana Jones, Monkey
Island, Maniac Mansion, Simon The Sorcerer, Erben der Erde oder auch das
neuere Sixth Sense Investigations lassen bei jedem Amiga User wohl
Erinnerungen wach werden. Mit &quot;Gilbert Goodmate and the mushroom of
Phungoria&quot; (im nachfolgenden mit &quot;Gilbert Goodmate&quot; abgek&#252;rzt) befindet
sich nun ein neues Cartoon Adventure in der Mache, das verspricht, das bis
dato beste Adventure auf dem Amiga zu werden.</P>

Wie bei jedem Adventure, gibt`s auch bei Gilbert Goodmate eine
Vorgeschichte: Vor Jahren wurde das Land Phungoria vor der Zerst&#246;rung durch
einen b&#246;sen Zauberer von einem Helden gerettet, wobei dem Helden ein
riesiger Pilz (!) half, der jetzt im Museum von Phungoria steht. Jedes Jahr
wird nun dieses historische Ereigniss gefeiert. Im Verlauf der Feier wird
ein Bewohner von Phungoria dazu auserkoren, ein Jahr lang auf den Pilz
aufzupassen. Diese Aufgabe fiel beim letzten Mal dem Gro&#223;vater des
Hauptprotagonisten Gilbert Goodmate zu, der fast ein Jahr den Pilz h&#252;tette.
Eine Woche vor Ablauf des Jahres wurde der Pilz aber gestohlen und der
Gro&#223;vater wird beschuldigt, diesen entwendet zu haben. Der K&#246;nig verurteilte
ihn daraufhin zu Tode, wobei die Hinrichtung eine Woche sp&#228;ter, also beim
Fest, statfinden sollte. Gilbert Goodmate hat nun die Aufgabe, den Pilz
wiederzufinden und den wahren T&#228;ter zu entlarven, damit sein Gro&#223;vater
&#252;berlebt.</P>

Soweit die (nette ausgedachte) Vorgeschichte zu Gilbert Goodmate.
Aber selbst eine gute Story macht noch lange kein gutes Adventure aus und
somit ist der n&#228;chste erw&#228;hnenswerte Punkt die Grafik. Und diese ist in dem
vorliegenden AVI Trailer mehr als nur beeindruckend (wer &quot;Monkey Island III&quot;
auf dem PC kennt, kann sich daran orientieren), wie man auch dem Screenshot
entnehmen kann. Gezeichnet wurden die Orte &#252;brigens von einem ehemaligen
Disney K&#252;nstler, was wohl die &#252;berragende Qualit&#228;t erkl&#228;ren d&#252;rfte.
Steuerunsgtechnisch scheint man sich &#252;brigens auch an &quot;Monkey Island III&quot;
angelehnt zu haben, denn die Zeiten, in denen man am unteren Bildschrimrand
Verben anklicken musste, sind mit Gilbert Goodmate wohl endg&#252;ltig
Geschichte.</P>

Ferner soll das Spiele &#252;ber Sprachausgabe, animierte Zwischensequenzen und
einen im Stdudio aufgenommenen Soundtrack verf&#252;gen. Es ist also kein Wunder,
da&#223; die Hardwareanforderungen recht hoch ausfallen: Ein AGA Rechner
(Unterst&#252;tzung von GraKa`s ist geplant) mit mind. OS 3.0 sowie einem 020
Prozessor samt 6 MB Fast Ram sowie ausreichend Festplattenspeicher (das Game wird auf CD ausgeliefert)
ist das unterste Minimum. Dar&#252;ber hinaus sollen PPC Bords unterst&#252;tzt
werden, was bei einem so umfangreichen Spiel durchaus sinnvoll ist. Ach ja:
Gilbert Goodmate erscheint auch f&#252;r PC`s!</P>

<U>Fazit:</U></P>
Wenn der vorliegende Trailer auch nur halbwegs representativ f&#252;r &quot;Gilbert
Goodmate&quot; ist und die Infos aus diversen Quellen stimmen, steht uns ein
potentieller Hit ins Haus. Kein Wunder, denn da das Game auch f&#252;r den PC
erscheint, muss eine gewisse Qualit&#228;t erreicht werden, da es ansonsten
gnadenlos verrissen werden w&#252;rde. Wie auch immer: Ich freue mich schon jetzt
drauf!</P><CENTER>
<img src="kit.gif"></CENTER></P>
<PRE>
Name          : Gilbert Goodmate and the mushroom of Phungoria

Pusblisher    : Christal Software

Release       : somewhen 1999

Preis         : ????

Anforderungen : AGA, CD Laufwerk, Festplatte, 6 MB Fast Ram, OS 3.0, 020 CPU

Empfohlen     : PPC Board, GraKa, viel HD Platz, mehr Speicher
</PRE>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
