

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Phönix Fighters-Altes Spielprinzip neu aufgelegt</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Phönix Fighters</FONT></h1></CENTER></P>
<CENTER><img src="pf1.jpg"></CENTER></P>
In Ausgabe 67 hatte ich noch ein Preview zu Ph&#246;nix Fighters geschrieben.
Jetzt halte ich das Endprodukt in den H&#228;nden und bin skeptisch, was ich von
dem Spiel halten soll. Nur alzu sehr ruft sich der Nachgeschmack der v&#246;llig
indiskutablen Demoversion bei mir in Erinnerung. Ob die Vollversion was
taugt, wird dieser Test zeigen.</P>

<h2><CENTER><FONT COLOR="WHITE">Was zuerst gekl&#228;rt werden
sollte....</FONT></h2></CENTER></P>
Geliefert wird Ph&#246;nix Fighters in einer CD Jewel Case auf einer selbstgebrannten CD. Das
Titelbild (Screenshot) sieht auch noch ganz nett aus und macht Lust auf
mehr. Aber schon nach dem Einlegen der CD, &#252;berkommt mich der erste Schauer:
Auf der CD befinden sich noch nichtmal 3 MB an Daten! Sprich: Das
eigentliche
Game h&#228;tte man auch bequem auf Diskette ausliefern k&#246;nnen. Na ja, als ob das
noch nicht genug w&#228;re: Die Systemvorraussetzungen sind ebenfalls eine Witz:
Ein Pal Monitor (l&#228;uft aber auch mit Picasso IV), eine 68000 CPU (bzw. einen
68020 f&#252;r einige Verbesserungen), 1 MB Ram, KS 1.3 und nat&#252;rlich ein CD Laufwerk. Das Spiel
h&#228;tte also auch vor zehn Jahren erscheinen k&#246;nnen (mal abgesehen vom CD
Laufwerk; aber 3 MB kriegt man auch auf Diskette unter) und selbst damals
w&#228;re es wohl gnadenlos zerrissen worden. </P>

<h2><CENTER><FONT COLOR="YELLOW">Das Spiel an sich</FONT></h2></CENTER></P>
Es wird sicherlich einige geben, die mit dem Namen Ph&#246;nix Fighters nicht
viel anfangen k&#246;nnen. Ok, bei Ph&#246;nix Fighters handelt es sich um ein Spiel
im Stil von Gravity Force oder Thrust. Im Spiel ist der Spieler einer der
elit&#228;ren Ph&#246;nix Fighter Piloten, der jede Menge gef&#228;hrliche Missionen mit
Hilfe seines Raumschiffes meistern muss. In der Praxis sieht das so aus,
da&#223; ihr ein Schiff bekommt und damit bestimmte Aufgaben erledigen m&#252;sst
<img src="pf2.png" align=left>(Gegner zerst&#246;ren, Waren von A nach B bringen, bestimmte Strecken fliegen
etc.). Was sich in der Theorie noch recht einfach anh&#246;rt, wird in der Praxis
zu einem unglaublich schwierigen Unterfangen: Dein Raumschiff unterliegt in
Ph&#246;nix Fighters allen Gravitationsgesetzen und ist mehr als nur schwierig zu
steuern; selbst wenn man langsam fliegt. Zwar kommt man nach einer gewissen
Einarbeitungsphase etwas besser mit der Steuerung zurecht, aber das ganze
ist trotzdem immer noch viel zu schwierig bzw. teilweise auch zu schwammig.
Das Problem, da&#223; damit verbunden ist, liegt auf der Hand: Ihr habt zwar
einen Schutzschild, nur ist dieser leider sehr schwach (und damit meine ich
wirklich schwach!). Wenn man mit einer Wand oder sonstigen Gegenst&#228;nden
kollidiert (was h&#228;ufig vorkommt), wird dem Spieler Energie abgezogen und
nicht selten explodiert das Raumschiff dann endg&#252;ltig. Es gibt zwar die
M&#246;glichkeit, sein Raumschiff reparieren zu lassen (oder auch neue zu
kaufen), aber das Geld daf&#252;r will erstmal verdient sein (=&gt; Mission erf&#252;llen
oder die in den Leveln verstreuten M&#252;nzen aufsammeln). Das Spielprinzip
d&#252;rfte also klar sein (hoffe ich mal...).</P>

<h2><CENTER><FONT COLOR="RED">Grafik &amp; Sound</FONT></CENTER></h2></P>
Wow, laut Verpackung sollen 128 Farben auf dem Bildschirm zu sehen sein und das bei
50 FPS. Bei der armseligen Grafik verwundern mich die 50 Frames Per Second
nicht sonderlich, aber das sich 128 auf dem Schirm befinden sollen, halte
ich f&#252;r eine derbe &#220;bertreibung. Die Grafik ist derma&#223;en schlecht, da&#223; man
sich fragt, in welchem Jahr man sich befindet. Zu Zeiten des C 64 w&#228;re die
Grafik als passabel durchgegangen, aber selbst zu A500 Zeiten h&#228;tten sich
die User halb schlapp gelacht. Und heute? Heute kann man dar&#252;ber nicht mal
lachen, da es anscheinend immer noch Firmen gibt, die meinen, solche
&quot;grafischen&quot; Erg&#252;sse auf die Amiga User loszulassen. Es ist schon traurig,
da&#223; es 1999 immer noch solchen Mist auf dem Amiga zu bewundern gibt (kein
Wunder, da&#223; sich PC User kaputt lachen).</P> 

Wer sich jetzt auf einen gelungenen Sound gefreut hat, wird ebenso
entt&#228;uscht werden: Neben einem total banalem Men&#252;sound (den auch ein 2
j&#228;hriges Baby besser hingekriegt h&#228;tte) gibt es im eigentlichen Spiel nur
diverse Ger&#228;usche (Motor, Sch&#252;sse und ein &quot;bing&quot; wenn man einen Gegenstand
einsammelt) zu h&#246;ren. Es liegt somit auf der Hand, da&#223; auch der Sound alles
andere als gut ist und das Spiel in keinster Weise retten kann. Vielmehr
passt sich die Qualit&#228;t des Sounds dem der Grafik an - mehr muss dazu wohl
nicht mehr gesagt werden.</P>

<H2><CENTER><FONT COLOR="GRAY">Optionsvielfalt</FONT></CENTER></h2></P>
Wenigstens wird an Spielmodi einiges geboten:</P><ul>

<li>Ein Spieler Missionen<BR>
<li>Zwei Spieler Missionen<BR>
<li>Gate Races<BR>
<li>Gem Races<BR>
<li>Dog Fights</P></UL>

Das ist an sich lobenswert, wird leider nur durch die total bekloppte
Steuerung und dem herben Schwierigkeitsgrad zunichte gemacht. Bei den Dog
Fights geht es zum Beispiel darum, den Mitspieler mit seinem Raumschiff (und
dessen Schusswaffen) zu zerst&#246;ren. Dazu kommt es leider nur sehr selten, da
meistens einer der Spieler zuvor ohne Gegnereinwirkung das zeitliche segnet.
Und das kann es ja wohl auch nicht sein.
Es ist somit auch nicht weiter verwunderlich, da&#223; &#252;berhaupt kein Spielspa&#223;
aufkommen will; weder alleine noch zu zweit. Da helfen dann auch die 200
Missionen nicht weiter, denn ich kann mir beim besten Willen nicht
vorstellen, da&#223; es derma&#223;en verr&#252;ckte Spieler gibt, die das Game durchzocken
werden.</P>

Das einzigst positive an dem Game ist die Unterst&#252;tzung des Multitaskings,
so da&#223; gepeinigte Tester wenigstens noch auf die schnelle &amp; unkomplizierte
Weise Screenshots von diesem &quot;Folterinstrument&quot; (gemeint ist Ph&#246;nix
Fighters) machen k&#246;nnen.... </P><CENTER>
<img src="pf3.png"></P>
<img src="pf4.png"></P><BR></CENTER>

<u>Extras auf der CD:</U></P>
Neben einem Installer f&#252;r Festplatten (ausser hilflosen Testern wird es
wahrscheinlich niemanden geben, der sich so einen Schrott auf die Platte
kopiert) gibt es noch eine englische AmigaGuide Datei, die &#228;u&#223;erst knapp
gehalten wurde. Zus&#228;tzlich gibt es noch einen Level Editor (der aussieht,
als w&#228;re er unter OS 1.2 programmiert worden), mit dem man sich eigene
Levels schaffen kann. Aber auch das eigene Schaffen von Leveln ist, dank der
Limitierungen durch den Editor, eine Aufgabe, bei der kein Spa&#223; aufkommen
will. Und als kr&#246;nenden Abschluss gibt es noch einen (!) Font, der auf den Namen &quot;MyLowRes Font&quot; h&#246;rt.
Kein weiterer Kommentar....</P>

<h1><CENTER>Fazit</h1></CENTER></P>
Das Game ist der letzte Schrott. Das k&#246;nnte man jetzt so stehen lassen und
es w&#252;rde treffend das auf den Punkt bringen, was ich &#252;ber das Game denke
(und so wird es sicherlich jedem gehen, der Ph&#246;nix Fighters besitzt). Es
gibt daran auch gar nichts sch&#246;nzureden und Alive Mediasoft kann ich
dringend empfehlen, solchen Mist zu unterlassen. Selbst 99 % der PD Spiele
haben ein h&#246;heres Niveau (grafisch &amp; soundtechnisch gesehen) und machen
sogar noch Spass. Mit so einem Dreck (sorry f&#252;r diese Formulierung) schadet
man dem Amiga nur. Wenn sich Alive Mediasoft dann noch &#252;ber geringe
Verkaufszahlen beschwert, wundert mich &#252;berhaupt nichts mehr. Tut mir nur
einen Gefallen: Macht einen weiten Bogen um Ph&#246;nix
Fighters!</P><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Alive Mediasoft</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>40-50 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Action Game</TD>
</TR>
<TR>
<TD>Vergleichbar mit</TD>
<TD>Gravity Force</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>0 %</TD>
</TR>
</TABLE>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
