<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="green" bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf's Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Markus Castro</a></b></li>
<li><a href="#a2"><b>f&uuml;r Markus Thomaschewski</a></b></li>
<li><a href="#a3"><b>f&uuml;r Frank Guder</a></b></li>
</ul>
<br>
<table width=100% border=0 cellspacing=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Markus (The Saint)</h3>
<p>Das Pseudo im Kopf ist deshalb, weil der Vorname heute zweimal vorkommt.
Und da das derzeitige Pseudo nur vor&uuml;bergehend ist und die meisten
sich sowieso damit nicht abgefunden und sich auch nicht daran gew&ouml;hnt
haben, benutze ich dein urspr&uuml;ngliche Pseudonym. Dass du heute einen
Platz in meinem Leserbrief bekommen hast und nicht einfach nur eine Mail,
wirst du dir wohl hoffentlich denken k&ouml;nnen. Es geht um deinen
Standpunkt in deiner Feedback Corner und aus meiner Sicht insbesondere
gleich um das erste Statement bez&uuml;glich deiner Ansicht &uuml;ber den
Workshop Page Design. Es ist wirklich jedem selbst &uuml;berlassen, seine
Gedanken in Worte zu formulieren und allen mitzuteilen. Nur &uuml;ber die
Art der Formulierung sollte man sich schon Gedanken machen. Das hatte ich
Dir schon damals bei deinem Bericht &uuml;ber den Filmbericht versucht zu
erl&auml;utern. Wenn dir etwas nicht zusagt, weil es f&uuml;r dich kein
Interesse darstellt, so ist dies doch kein Grund etwas abzuqualifizieren.
Das gilt auch f&uuml;r deinen Satz &uuml;ber den Raytracing Workshop von
Frank Steinbach. Analysiere mal in Ruhe den Satz:<br> <center><i> Aber
f&uuml;r lernwillige Anf&auml;nger bestimmt gut.</i></center> und
anschlie&szlig;end versuchst du die Analyse zu interpretieren. Die nun
anstehende Quintesenz kann nur negativ ausfallen. Ich glaube jedenfalls,
dass du dies  <b>so nicht</b> bezweckt hast, aber der Eindruck entsteht halt
mal f&uuml;r Aussenstehende.</p>

<p>Kehren wir aber zu meinen Workshops zur&uuml;ck, die dir nichts sagen,
wie du selbst schreibst. Seit dem Sommer habe ich mit mehreren einen
Mailing Verkehr bez&uuml;glich von Homepagegestaltung und so habe ich
f&uuml;nf Beitr&auml;ge f&uuml;r die Allgemeinheit zusammengetragen. Der
letzte &uuml;ber Image Maps ist heute in dieser NC enthalten. Diese
f&uuml;nf Beitr&auml;ge resultieren aus all den Fragen an mich, weil ich
damit den Schwerpunkt der Bed&uuml;rfnisse eruieren konnte. Aber kein
Einziger hat gefragt, wie und aus was bastle ich meine eigene Homepage
zusammen. Alle haben eine Vorstellung, aber fragen nur, wie dies zu
realisieren und was dabei zu ber&uuml;cksichtigen ist. Wenn du dir deine
eigene Homepage mal erstellen wolltest, m&ouml;chtest du bestimmt kein
Okalhaus haben, das vom Flie&szlig;band gekommen und 100-Tausend mal zu
sehen ist. Somit w&auml;re ein Workshop &quot;Man nehme und....&quot;
vollst&auml;ndig fehl am Platze. Die Individualit&auml;t und
Einzigartigkeit w&uuml;rde auf der Strecke bleiben. </p>

<p>Nun eine Anmerkung zu deinem Statement zur Aminet-32. Erstens habe ich
den Artikel noch vor dem Urlaub von Andreas einsenden wollen (und auch
getan) und zweitens habe ich in meiner Wolf-INFO einen Nachsatz gebracht.
Dabei habe ich absichtlich nicht erw&auml;hnt, dass der uns allen
wohlbekannte Freiherr von Gravenreuth wieder zugeschlagen hat. Und wenn man
aus deinen ganzen Bemerkungen in verschiedenen Beitr&auml;gen herausliest,
dass du die Zusammenstellung der AmigaPlus-CD's &uuml;bernommen hast,
w&uuml;rde ich in dieser Richtung ganz besonders gut aufpassen. Wie schnell
hat man ein Copyright ohne es zu wissen verletzt. </p>

<p>Noch einen Satz als Globalres&uuml;mee (das Wort &quot;global&quot; soll
ausdr&uuml;cken, dass ich keine Spezifizierung vornehme) zu deiner
Feedback-Betrachtung. Aus allen deinen S&auml;tzen klingt es leicht negativ
und zwischen den Zeilen k&ouml;nnte man herauslesen, als wenn dir alles
nicht so gefallen h&auml;tte. Weiter ist mir stark aufgefallen, dass du die
gesamte NoCover noch gar nicht gelesen hattest, sonst h&auml;ttest du
bestimmt ein paar wohlwollende Worte f&uuml;r das Interview von Thomas
Weber gefunden. Es hatte mich erstaunt, dass nur ein Einziger dieses
Interview in seinen Top 5 erw&auml;hnt hatte. Bei mir war sie drinnen, nur
ich hatte versehentlich die falsche Ausfertigung meiner Wolf-INFO
komrimiert und weggeschickt. Ich nehme aber zu deinen Gunsten an, dass du
pers&ouml;nlich etwas unter Zeitdruck standest und hattest vielleicht noch
ein kleines Tief dabei, sodass nun dieser Eindruck entstanden ist. Aber
beim n&auml;chsten Mal sieht es bestimmt viel besser aus. </p>

<p>Jetzt noch etwas Ketzerisches:<ul>
<li> Wie kann man nur die Backgroundfarbe fast
schwarz und die Linkfarbe schwarz (im Leserbrief) w&auml;hlen? </li>
<li>ich wäre, es wären schreibt man ohne <b>&quot;h&quot;</b>, da es von
sein kommt und nicht von Währung. Ist ein konstanter Fehler deinerseits,
deshalb dieser Hinweis. </li></ul></p>

<p>
Bis demn&auml;chst, Wolf.
</p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4>
</td></tr></table>
<table width=100% border=0 cellspacing=6><tr><td>
<h3><a name="a2">Gr&uuml;&szlig; dich Markus (Mark Tom)</h3>
<p>Wir haben ja schon l&auml;nger nichts mehr voneinander &uuml;bereinander
(aber auch nicht gegeneinander) gelesen, so dass dieser Zustand mal wieder
ge&auml;ndert werden sollte. Da du mich indirekt direkt angesprochen
hattest, wollte ich an dieser Stelle auch mal wieder &quot;Guten Tag&quot;
sagen. Bevor ich aber beginne, h&auml;tte ich eine Frage. Benutzt du ein
besonders ganz uraltes oder ein ganz neues, noch nicht
ver&ouml;ffentlichtes Komprimierprogramm? Meine Frage deshalb, weil bei der
ersten Online&uuml;bermittlung der neuen NoCover nur Datenm&uuml;ll ankam.
Au&szlig;er deinen und zwei weiteren Artikeln war nach dem Entpacken nichts
lesbar. Nat&uuml;rlich kann dies Zufall sein, aber doch dann ein ganz
seltener, wie du mir bestimmt recht geben wirst. Also ich habe
&uuml;berhaupt keine Erkl&auml;rung daf&uuml;r, noch nicht einmal eine
klitzekleine Ahnung von Erkl&auml;rung ist vorhanden. Und Wunder gibt es
nicht. </p>

<p>Deine Bemerkung, dass du nicht Online bist, denke ich irgendwo in einem
deiner Artikel gelesen zu haben. Das erkl&auml;rt auch, dass Mails an deine
in der Mitgliederliste stehenden Adresse postwendend (m&uuml;sste es nicht
jetzt serverwendent hei&szlig;en?) wieder in der Mailbox auftauchen. Eines
verwundert mich aber, dass du seinerzeit mit keiner Silbe auf meinen
damaligen Hinweis eingegangen warst. Und ich kann mir gar nicht vorstellen,
dass du ein fanatischer Gegner von Online bist. Anfangs war ich auch
Skeptiker, du erinnerst dich bestimmt noch an meinen diesbez&uuml;glichen
Artikel in der NC-33, aber meine Skepsis bez&uuml;glich von Versand
gesch&uuml;tzter Daten und auch von Viren ist bisher noch nicht
ausger&auml;umt. Trotzdem m&ouml;chte ich das Netz nicht mehr missen. Aber
alles was mit Bank direkt oder indirekt wie Kreditkarten usw.
zusammenh&auml;ngt wird von mir kategorisch abgelehnt. Auch alle festen
Beteuerungen, dass der SSL-Schl&uuml;ssel mit 128 Bit nicht knackbar sei,
kann ich &uuml;berhaupt nicht glauben, insbesondere wenn er per E-Mail
zugesandt wird. Da bleibe ich weiterhin Skeptiker. In diesem Zusammenhang
f&auml;llt mir ein, wie leichtgl&auml;ubig doch viele Leute sind. Bietet
doch ein Unternehmen an, alle Datenbanken und Programme per Online mit
einem Virensuchprogramm &uuml;berpr&uuml;fen zu wollen und gefundene Viren
gleich zu eliminieren. Weiter brauche ich wohl nichts dazu zu sagen. </p>

<p>Nun habe ich eine ganze Menge geredet (geschrieben) und der eigentliche
Grund war doch eigentlich der, dass ich dir meinen Dank ausdr&uuml;cken
wollte, weil du dich auch &auml;u&szlig;erst, wenn dir etwas gefallen hat
und dies auch sehr deutlich sagst und dazu stehst. Es tut mir noch im
Nachherein leid, dass ich nicht auf deinen Artikel &quot;der blanke
Horror&quot; in der NC-66 eingegangen war, sondern nur auf den Beitrag von
Thomas Windecker, &uuml;ber den ich mich ganz ehrlich gesagt ge&auml;rgert
hatte. Du siehst, Negatives reizt viel mehr zu Provokationen und
Meinungs&auml;u&szlig;erungen wie umgekehrt. W&uuml;rde der positive Aspekt
einmal ganz alleine &uuml;berwiegen, die NoCover w&auml;re sehr sehr
d&uuml;nn. </p>

<p>Und der zweite Grund ist der, dass ich versuchen m&ouml;chte, dir
zuzureden dein FASTFOOD nicht aufzugeben, sondern dass du es wenn auch mit
Co-Autoren unter deiner Feder weiterf&uuml;hrst. Denke daran, es ist dein
Markenzeichen, deine Handschrift, deine Intuition, dein Kind. Und das
willst du einfach so mir nichts dir nichts an andere weitergeben? Wenn du
keine Zeit, keine Lust, kein Interesse, keine was wei&szlig; ich nicht mehr
hast, dann kannst du sagen, ich muss leider meine st&auml;ndige
Pr&auml;senz aufgeben, aber wenn einer diese Idee weiterf&uuml;hren will,
kann er es unter anderem Namen, anderem Outfit und anderer Wortwahl tun.
Fastfood von einem anderen w&auml;re nie mehr das Fastfood das wir alle
auch von fr&uuml;her kennen. Und nun noch ein Wort zu Co-Autoren. Ich
m&ouml;chte hier an dieser Stelle keinen Stab brechen, aber du siehst, dass
<b>fast alle</b> Versuche sehr schnell gescheitert waren. Und wenn du
einmal gezwungenerma&szlig;en einstellst, kannst du nur auf einen
Ph&ouml;nix warten und hoffen, dass dies dann kein kleiner Zaunk&ouml;nig
wird. <br><br>
Alles Gute bis ein andermal, Wolf.
</p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4>
</td></tr></table>
<table width=100% border=0 cellspacing=6><tr><td>
<h3><a name="a3">Gr&uuml;&szlig; dich Frank</h3>
<p>Vielen Dank f&uuml;r deine positiven und aufmunternde Sätze an mich in
deinem Leserbrief. Sich als HTML Neueinsteiger zu betitulieren ist doch
keine Schande. Ich werde dir gerne per E-Mail helfen, sogut es in meiner
Macht steht. Eines musst du wissen, es ist noch kein Meister vom Himmel
gefallen. Jeder von uns hat lernen m&uuml;ssen und manche m&uuml;ssen noch
immer lernen. Aber du musst auch wissen, man kann immer nur Antworten auf
Fragen erhalten, die man auch gestellt hat und nicht f&uuml;r diese, die
sich bei einem auft&uuml;rmen. Ich will damit nur zum Ausdruck bringen, es
gibt keine dummen Fragen, h&ouml;chstens nur dumme Antworten. 

<br><br>
Bis demn&auml;chst, Wolf.
</p>
<br>
<a href="#top">zum Anfang</a>
<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



