

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=red bgcolor=black link=green alink=red>
<CENTER>
<img src="metalcorner.png"></P>
<P><H1><FONT COLOR="YELLOW">Metal Corner 11/99</FONT></H1></P>
 <a href ="#Vorwort.html">Vorwort</A><BR>
 <a href ="#News.html">News</a><BR>
 <a href ="#CDReviews.html">CD Reviews</A><BR>
 <a href ="#konzert.html">Konzertbericht</A><BR>
 <a href ="#lyrics.html">Interessante Lyrics</A><BR>
 <a href ="#tour.html">Tourdaten</A><BR>
 <a href ="#Top10.html">Top 10</A><BR>
 <a href ="#Outro.html">Abschlieﬂend</A></P>
<hr>
<a name="Vorwort.html"></CENTER>
<h1><CENTER><FONT COLOR="WHITE">Vorwort</FONT></CENTER></h1><p>

<u>Greetings!</u></P>

Mein Gott, da&#223; war wirklich ein stressiger Monat. Zuerst kam mir eine Fahrt
nach Rom (wen es interessiert: Es war echt toll dort!) dazwischen und
diverse Pannen zuhause machten die ganze Angelegenheit auch nicht einfacher.
Trotz all dieser wiedrigen Umst&#228;nde gibt`s auch diesen Monat wieder eine
volle Metal Corner, die Euch hoffentlich gefallen wird. Viel Spa&#223; beim
Lesen,</P><CENTER>

                                                Kilian &quot;The Bruce&quot; Servais</CENTER>
<hr>
<a name="News.html">
<h1><CENTER><FONT COLOR="YELLOW">News</FONT></H1></CENTER><p><ul>


<li><b>Michael Kiske</B> (ex-Helloween) hat seinen Japan Deal verloren, weil seine
letzte Scheibe &quot;Readiness To Sacrifice&quot; (Review in der vorletzten Ausgabe)
floppte. Nun hat er sich mit einem Statement an die Metal Community gewandt,
in dem er sich &#252;ber all jene aufregt, die mit seinem neuen Verst&#228;ndnis von
Musik nicht klarkommen. Wer ihm eine aufmunternde E-Mail schicken will, kann
sich an &quot;tw@en.com&quot; mit dem Vermerk Michael Kiske wenden.</P><BR>

<li>Die Prog. Metaller <b>Sieges Even</B> haben sich leider aufgel&#246;st. &#220;ber die
genauen Gr&#252;nde ist leider nichts zu erfahren, aber man kann davon ausgehen,
da&#223; es innerhalb der Band Probleme gab.</P><BR>

<li>Auch <b>3 Colours Red</B> haben sich, nach ihrem Auftritt beim Reading Festival,
aufgrund musikalischer Differenzen getrennt.</P><BR>

<li>Und alle guten Dinge sind drei: <b>Iron Monkey</B> haben sihc ebenfalls getrennt;
Gr&#252;nde haben die Jungs bisher noch nicht genannt.</P><BR>

<li>Das geplante Projekt<B> &quot;Demons &amp; Wizards&quot;</B> von Hansi K&#252;rsch <B>
(Blind Guardian)</B>
und Jon Schaffer <B>(Iced Earth)</B> soll evtl. noch vor Weihnachten erscheinen.
Mit von der Partie ist auch Richard Sternquist <B>(Jag Panzer</B> Drummer) und
Studiobesitzer Jim Morris (Gitarre). Wir warten schon jetzt....</P><BR>

<li><B>Edguy</B> S&#228;nger Tobias Sammet will eine Rock Oper schreiben, bei der auch
Mitglieder von <B>Gamma Ray, Angra und Stratovarius</B> beteiligt sein sollen.
Angeblich soll auch<B> Michael Kiske (ex-Helloween)</B> mitmischen. Wenn das ganze
Realit&#228;t wird, steht uns eine ganz fettes Ereigniss ins Haus!</P><BR>

<li><B>The Prodigy</B> haben sich von ihrem Gitarristen Gizz Butt getrennt, der sich
mehr auf seine Hauptband <B>Janus Stark</B> konzentrieren will. Beide Bands
arbeiten z.Zt. &#252;brigends an neuen Songs.</P><BR>

<li>Die K&#252;rbisk&#246;pfe von <B>Helloween</B> sind offenbar zu unterbsch&#228;ftigt: Neben dem
aktuellen Helloween Output &quot;Metal Jukebox&quot;, stehen noch zwei Solo CD`s an:
<B>Andi Deris</B> bringt sein zweites Soloalbum &quot;Done With Mirrors&quot; im Januar raus
und <B>Michael Weikath</B> bastelt ebenfalls an Material f&#252;r eine Soloscheibe (u.a.
mit Ferdy Doernberg und Uli Kusch).</P><BR>

<li>Die neue <b>AC / DC</B> Langrille ist endlich fertig und soll schon im November
das Licht der Welt erblicken.</P><BR>

<li>Bei den Black Metallern <B>Cradle Of Filth</B> geht`s drunter und dr&#252;ber: Vor
kurzem musste erst der Drummer ersetzt werden und nun hat auch noch
Gitarrist Gian Pyres das Handtuch geworfen. Bis ein neuer Mann gefunden ist,
wird er durch einen Session Gitarristen ersetzt.</P><BR>

<li>Den Kommerz Rockern <B>Kiss</B> geht`s gar nicht gut: Derren neuer Film
&quot;Detroit Rock City&quot; ist n&#228;mlich gnadenlos in Amerika gefloppt, was nicht
zuletzt an den ziemlich herben Kritiken liegen d&#252;rfte. Mal sehen, was der
Film in Deutschland so einspielt....</P><BR></UL>


<hr>
<a name="CDReviews.html">
<h1><CENTER><FONT COLOR="GREEN">CD Reviews</FONT></H1></CENTER><p>
<h2><CENTER>Grave Digger: Excalibur</h2></CENTER></P>
Nachdem das letzte Grave Digger Output &quot;Knights Of The Cross&quot; nicht ganz die
(hochgesteckten) Erwartungen, die nach &quot;Tunes Of War&quot; aufgekommen waren,
erf&#252;llen konnte, steht mit &quot;Excalibur&quot; das neueste Output der True Metaller
in den Verkaufsregalen, das wieder wesentlich st&#228;rker ausf&#228;llt als &quot;Knights
Of The Cross&quot;. Wie schon gewohnt, ist auch &quot;Excalibur&quot; ein Konzeptalbum und
zwar &#252;ber den Mythos der Arturssage. Musikalisch wurde das ganze sehr
ansprechend gemeistert und Grave Digger lassen einige wirkliche Granaten auf
die Menschehit los: Neben dem schleppenden &quot;The Round Table&quot; und dem
speedigen &quot;Tristan`s Fate&quot; kann vor allem das sehr melodische &quot;Morgana Le
Fay&quot; &#252;berzeugen. Aber auch Tracks wie &quot;Excalibur&quot; und &quot;The Spell&quot; haben gute
Chancen, in die Klasse der Grave Digger Classics vorzudringen. Stilistisch
hat sich nat&#252;rlich nichts ge&#228;ndert: Immer noch thront Chris Boltendahl`s
wahnsinnige Stimme &#252;ber dem superben Gitarren- und Bassound und auch die
Drums dr&#246;hnen fett &amp; kraftvoll aus den Boxen. Zwar gibt`s mit &quot;Avalon&quot; auch
den einzig nennenswerten Aussetzer des Albums, aber das f&#252;gt dem guten
Gesamtbild keinen gro&#223;en Schaden zu. True Metaller und Grave Digger Fans
k&#246;nnen blind zugreifen - allen anderen Power Metal Fans sei ein kurzes
reinh&#246;ren empfohlen, den Grave Digger ist nicht jederman s Sache. Es bleibt
trotzdem festzuhalten: Grave Digger zeigen den vielen jungen Bands
eindrucksvoll, wo es langgeht!</P>
Fazit: 9 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov1.jpg"></P>
<img src="kit.gif"></P></CENTER>

<h2><CENTER>Helloween: Metal Jukebox</h2></CENTER></P>

Seitdem Metallica mit &quot;Garage Inc.&quot; ein reines Coveralbum vorgelegt haben,
will alle Welt das gleiche machen. Und auch Helloween haben mit &quot;Metal
Jukebox&quot; ein reines Coveralbum, das gleichzeitig das Ende ihres Vertrages
mit Castle Communications darstellt, abgeliefert. Das gecoverte Material
stammt aus den 60er und 70er Jahren und featured so prominente Bands wie
Scorpions, Abba, Jethro Tull, David Bowie und sogar die Beatles. Insgesamt
hat man sich 11 St&#252;cke anegnommen und diese versucht, Helloween tauglich zu
machen. Dies ist aber leider nur teilweise gelungen: Viele der Songs klingen
einfach zu banal bzw. haben nicht den typischen Helloween Touch. Sicherlich,
h&#228;rtetechnisch wird einiges geboten, aber ich kann nur schwer
nachvollziehen, da&#223; &quot;Metal Jukebox&quot; in vielen Publikationen gute bis sehr
gute Noten erhalten hat. Mit &quot;He`s A Woman - She`s A man&quot; (Scorpions), &quot;Lay
All Your Love On Me&quot; (Abba) und &quot;White Room&quot; (Cream) sind gerade mal drei
Nummern &#252;ber dem Durchschnitt; allen anderen Nummern fehlt das gewisse
etwas, was besonders bei Helloween nur schwer zu glauben ist. De facto
bleibt unter dem Strich nur eine Scheibe &#252;brig, die lediglich f&#252;r Sammler
und
Helloween Fans (damit die Sammlung auch komplett ist...) interessant ist.
Alle anderen Metal Fans k&#246;nnen diese Scheibe getro&#223;t &#252;bergehen, denn etwas
wirklich besonderes findet man hier nicht. Traurig, aber leider wahr!</P>

Fazit: 3 von 10 Punkten</P><CENTER> 
<img src="kit.gif"></P>
<img src="mccov2.jpg"></P>
<img src="kit.gif"></P></CENTER>

<hr>
<a name="konzert.html">
<h1><CENTER><FONT COLOR="BLUE">Konzertbericht: Iron Maiden &
Megadeth</FONT></h1></CENTER></P>
Schon vor Monaten kaufte ich mir das Ticket f&#252;r dieses Konzert und am
20.9.99 war es endlich so weit: Iron Maiden kommen nach Essen. Und das
Konzert sollte es in sich haben: Nach der gegl&#252;ckten Anreise und der
obligatorischen Warterei war dann endlich irgendwann Einlass und ich konnte
<img src="konzert.jpg" align=left>zur B&#252;hne st&#252;rmen. Wie das Schicksal es wollte, konnte ich einen Platz in
der ersten Reihe ergattern und hatte somit einen perfekten Blick auf die
B&#252;hne. Zuerst betraten allerdings Megadeth die B&#252;hne, die eine knappe
dreiviertelstunde ihr K&#246;nnen unter Beweis stellten. Sicherlich ist das
Material nicht schlecht und die Band hat sich auch m&#228;chtig ins Zeugs gelegt,
aber mehr als ein H&#246;flichkeitsapplaus war nicht drin. Und dann war es
endlich soweit: Nach der l&#228;ngeren Umbauphase klappte eine Videoleinwand
runter und es wurden Sequenzren aus dem aktuellen Iron Maiden Computerspiel
Ed Hunter gezeigt; musikalisch unterlegt von dem Instrumentalst&#252;ck
&quot;Transsylvania&quot;. Und als alles dann dunkel wurde und &quot;Churchill`s Speech&quot;
aus den Boxen dr&#246;hnte, &#252;berkam mich soetwas wie eine G&#228;nsehaut. Und dann war
es endlich soweit: Die Band st&#252;rmte zu Aces High, untermalt mit Pyros, auf
die B&#252;hne und die Masse tobte. Als dann einige Sekunden sp&#228;ter auch noch
Bruce Dickinson auftrat hielt es keinen mehr in der Halle und es kam
Stimmung auf, die besser nicht sein konnte. Mit &quot;Wrathchild&quot; und &quot;The
Trooper&quot; haute die Band gleich kr&#228;ftig weiter rein und auch die nunmehr drei
Gitarristen rockten mehr als ordentlich. Kein Wunder, denn der Sound knallte
sauber aus den Boxen und die Meute war hellauf begeistert. Schwierig wurde es erst bei
den Songs aus der Bayley &#196;ra: Neben &quot;Man On The Edge&quot; und &quot;Futureal&quot;, die
beide von Bruce Dickinson wesentlich besser eingesungen wurden, als die
Originalversionen, sorgte vor allem &quot;The Clansman&quot; f&#252;r Furore: Mit Bruce`s
Theatralik und seiner hervorragenden Stimme (mit leicht ver&#228;ndertem Text)
kam das ganze mindestens doppelt so gut an, wie die Originalversion.
Die kritischen Stellen waren jetzt also gemeistert und die Band konnte sich
ganz auf unsterbliche Klassiker (siehe Traklist) verlassen. Unterlegt durch
zahlreiche Gimmick`s (z.B. Eddie auf der B&#252;hne, Pyros oder auch Bruce`s
Kommentare) wurde das Konzert &#228;u&#223;erst kurzweilig und richtig geil. Die
Reunion hat sich also gelohnt und auch die Band schien richtig Spa&#223; zu
haben; so aktiv habe ich die komplette Band seit 1988 nicht mehr gesehen und
das will was hei&#223;en. Einfach nur g&#246;ttlich!!</P>

Anmerkung: Das Foto stammt von der offiziellen Iron Maiden Webseite und
wurde in Essen geschossen!</P>

<u>Tracklist (falsche Reihenfolge):</U></P>

1. Sequenzen aus Ed Hunter mit Transsylvania Intro<BR>

2. Churchill`s Speech<BR>

3. Aces High<BR>

4. Wrathchild<BR>

5. The Trooper<BR>

6. Powerslave<BR>

7. Phantom Of The Opera<BR>

8. 2 Minutes To Midnight<BR>

9. The Clansman<BR>

10. Futureal<BR>

11. Man On The Edge<BR>

12. Run To The Hills<BR>

13. Hallowed Be Thy Name<BR>

14. The Number Of The Beast<BR>

15. Fear Of The Dark<BR>

16. Iron Maiden<BR>

17. The Evil That Men Do<BR>

18. Wasted Years<BR>

19. Killers</P>


<HR>
<a name="lyrics.html">
<h1><CENTER><FONT COLOR="WHITE">Interessante Lyrics</FONT></CENTER></h1><P>
<h2><CENTER>Savatage: The Answer You Seek</h2></CENTER<</P>

F¸r diesen Monat habe ich mal einen Songs einer der besten Hard Rock / Metal
Bands ausgesucht, die alleine vom Image her schon bestens in diese Kategorie passen. Die Rede ist von
Savatage, die im Laufe ihrer Karriere schon viele Zust‰nde angeprangert
haben und lupenreine Konzeptalben vorlegen. Der Song heiﬂt "The Answer You
Seek" und stammt vom `95er Album "Dead Winter Dead", das sich thematisch mit
den Konflikten im Kosovo auseinandersetzt.</P><CENTER>

I See A Little Man<BR>
Sitting And He`s Wondering<BR>
If Over His Little Plot<BR>
He Might Be King<BR>
And He Finds His Present World<BR>
A Little Boring</P>

There`s No<BR>
Land That Is So Small<BR>
That It Can Not Divide<BR>
So Come, I`ll Draw The Line<BR>
And You Just Pick Your Side<BR>
Ignoring Anyone Who Gives<BR>
A Warning</P>

<u>Chorus:</U></P>
For I Am <BR>
The Answer You Seek<BR>
The Dream In Your Sleep<BR>
You Never Wanted To Awaken <BR>
I Have The Plan That Won`t Fail<BR>
The Crime Without Trail<BR>
And All I Really Need Right Now Is You</P>

I See A Little Man Thinking<BR>
That He Might Need More<BR>
And So His Eyes Are Drifting<BR>
To The House Next Door<Br>
And He Wonders If His Neighbours<BR>
Might Be Leaving</P>

So He Makes A Little Offer<BR>
That They`ll Understand<BR>
There Is No Point In Letting<BR>
Things Get Out Of Hand<BR>
For No One Wants To See<BR>
Their Widows Grieving</P>

<u>Chorus</U></P>

For I Am The Word Without Deeds<BR>
The Lie That Exceeds<BR>
For Lies Are Always Impatient</P>

I Am The Guide For The Lost<br>
Who Never Counts Cost<br>
And All I Really Need Right Now Is You</P>

I See A Little Man Sitting<br>
And He`s Wondering<br>
I See A Little Man Sitting<BR>
And He`s Wondering</P>

All I Really Need Right Now Is You<BR>
All I Really Need Right Now Is You<BR>
All I Really Need Right Now Is You<BR>
</CENTER>
<hr>
<a name="tour.html">
<h1><CENTER>Tourdaten</h1></CENTER></P>
<CENTER>
<B><h2>Saxon &amp; Skew Siskin</h2></B></P>

16.11. Rostok, Mau<br>
17.11. Hamburg, Docks <BR>
19.11. Leipzig, Anker<BR>
20.11. Worms, Stadthalle<br>
21.11. K&#246;ln, E-Werk<br>
22.11. M&#252;nchen, Nachtwerk<BR>
24.11. NL-Tiburg, 013<BR>
25.11. Arnsberg, Cult    <BR>
26.11. Osnabr&#252;ck, Hyde-Park<BR>
27.11. Freiburg, Tivoli<BR>
28.11. N&#252;rnberg, Forum<BR>
29.11. Stuttgart, Longhorn<BR>
30.11. CH-Pratteln, Z7<BR>
2.12. Saarbr&#252;cken, Garage<BR>
5.12. Bremen, Aladin<BR>
7.12. A-Wien, Pmaet Music</P>

<b><h2>Grave Digger</h2></B></P>

6.1. Hamburg, Markthalle<BR>
7.1. Braunschweig, FBZ<BR>
8.1. Glauchau, Alte Spinnerei<BR>
9.1. Frankfurt, Batschkapp<BR>
10.1. Bochum, Zeche<BR>
11.1. Berlin, Kasselhaus<BR>
12.1. Ludwigsburg, Rockfabrik<BR>
13.1. CH-Pratteln, Z7<BR>
14.1. Lichtenfels, Stadthalle<BR>
15.1. Kaufbeuren, Zeppelinhalle</P>

<b><h2>Bloodhound Gang</h2></B></P>

5.11. M&#252;nster, Jovel<BR>
6.11. Hamburg, Gro&#223;e Freiheit<BR>
16.11. Berlin, Columbiahalle<BR>
17.11. Neu-Isenburg, Hugenottenhalle<BR>
19.11. M&#252;nchen, Babylon<BR>
20.11. K&#246;ln, Live Music Hall<BR>
22.11. Stuttgart, Longhorn<BR>
23.11. CH-Z&#252;rich, Abart</P></CENTER>
<hr>
<a name="Top10.html">
<h1><CENTER>Top 10</CENTER></H1><p>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="white">
</TR><TR>
<TD>Iced Earth</TD>
<TD>Alive In Athens</TD>
</TR>
<TR>
<TD>Gamma Ray</TD>
<TD>Powerplant</TD>
</TR>
<TR>
<TD>Blind Guardian</TD>
<TD>Nightfall In Middle-Earth</TD>
</TR>
<TR>
<TD>Nightwish</TD>
<TD>Oceanborn</TD>
</TR>
<TR>
<TD>Iced Earth</TD>
<TD>Something Wicked This Way Comes</TD>
</TR>
<TR>
<TD>Testament</TD>
<TD>The Gathering</TD>
</TR>
<TD>Six Feet Under</TD>
<TD>Maximum Violence</TD>
</TR>
<TR>
<TD>In Flames</TD>
<TD>Colny</TD>
</TR>
<TR>
<TD>Kreator</TD>
<TD>Endorama</TD>
</TR>
<TR>
<TD>Anathema</TD>
<TD>Judgement</TD>
</TR>
</TABLE></P>
Quelle: RockHard</P></CENTER>
<hr>
<a name="Outro.html">
<H1><CENTER><FONT COLOR="GRAY">Abschlieﬂend</FONT></h1></CENTER><p>

Puh, endlich ist auch diese Ausgabe der Metal Corner fertiggestellt und ich
bin jetzt erstmal fertig mit der Welt. Jetzt sind erstmal Herbstferien
angesagt, in denen uns einige hochkar&#228;tige Releases erfreuen werden. F&#252;r die
n&#228;chste Ausgabe habe ich z.B. Reviews zur neuen Luca Turilli &amp; Virgin Steele
CD fest eingeplant. .Aber auch Bruce Dickinson`s neues Live Album &quot;Scream
For me&quot; k&#246;nnte in der n&#228;chsten Ausgabe evtl. schon einem Test unterzogen
werden. Was es sonst noch gibt, wei&#223; ich leider selber noch nicht; lasst
Euch mal &#252;berraschen. Stay Hard!</P>


<HR>
<CENTER>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><P></A>
</CENTER>
</P>
</BODY>
</HTML>
