


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>PFS 3 - Ein Zeitgemäßes Filesystem?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="WHITE">Test: Professional File
System 3</FONT></H1></CENTER></P>
<CENTER><img src="pfslogo.jpg"></CENTER></P><BR>
Das Amiga Filesystem setzte seinerzeit Ma&#223;st&#228;be, ist aber &#252;ber die Jahre
hinweg nicht erweitert worden und gen&#252;gt heute kaum noch den Anspr&#252;chen.
Auch wenn OS 3.5 zumindest etwas Verbesserung in dieser Hinsicht mitbringt
(Unterst&#252;tzung von Festplatten &#252;ber 4 GB), kann nicht erwartet werden, da&#223;
das Filesystem wieder auf dem aktuellesten Stand der Technik ist. Eine
Alternative zum Amiga Filesystem stellt das <b>P</B>rofessional <B>F</B>ile </B>S</B>ystem 3 (kurz:
PFS3) von Great Effects Development dar. Ob sich der Kauf lohnt, wird sich
zeigen m&#252;ssen.</P>

<h2><CENTER><FONT COLOR="GREEN">Ein bi&#223;chen Theorie
vorweg</FONT></CENTER></h2></P>
Ein Filesystem ist f&#252;r alle Zugriffe (Dateien schreiben, l&#246;schen etc.)
auf jedes Speichermedium (z.B. Festplatten, Disketten, Zip Medien etc.)
verantwortlich. Dem Amiga OS lag ab Version 1.3 das sog. Fast File System
(FFS) bei, das damals allen Anforderungen gen&#252;gte. Aber der Zahn der Zeit
nagte auch am Filesystem und es wurden die Rufe immer lauter, da&#223; FFS
schneller zu machen. Commodore arbeitete dann auch noch daran und das
Resultat war das Fast File System mit Directory Caching (FFS-DC), welches
der WB 3.1 beilag. Ausgereift war das ganze aber bei weitem immer noch nicht
und da, wir wie alle wissen, Commdore Konkurs ging (=&gt; keine
Weiterentwicklung) blieb es auch dabei. Es war somit nur eine Frage der
Zeit, bis sich eine Softwarefirma dazu aufraffen w&#252;rde, einen neuen Standard
zu setzen. Und das Resultat PFS 3 kann heute erworben werden.</P>

<h2><CENTER><FONT COLOR="YELLOW">Featureliste</FONT></h2></CENTER></P>
Das PFS 3 bringt von Haus aus jede Menge Verbesserungen mit, die ich hier
einmal kurz erw&#228;hnen m&#246;chte:</P><ul>

<li>schneller als das Original Amiga Filesystem<br>
<li>Volle AmigaDOS Kompatibilit&#228;t<br>
<li>besseres Fehlerhandling<br>
<li>Theoretische Obergrenze von Festplatten liegt bei 2000 GB <BR>
<li>Kein l&#228;stiges Validieren mehr n&#246;tig (=&gt; kein
Datenverlust)</P></UL>
 

Das w&#228;ren die wichtigsten Features, die das PFS 3 zu offenbaren h&#228;tte. Im
folgenden m&#246;chte ich noch genauer auf die einzelnen Punkte
eingehen:</P>

<u>Geschwindigkeit:</U></P>
Das Geschwindigkeitsargument ist sicherlich f&#252;r einen Gro&#223;teil der User der
wichtigste. Genaue Angaben zur Geschwindigkeit zu machen ist nicht m&#246;glich,
da&#223; kein System identisch aufgebaut ist und es zu viele wechselnde Variablen
(hat das jetzt einer verstanden) gibt. So kommt es z.B. darauf an, wieviel
Ram der Rechner hat, welche CPU verwendet wird, welcher Controller (SCSI
oder IDE) verwendet wird und nicht zuletzt auf die Festplatte selber. Es
gibt aber trotzdem keinen Zweifel: Das PFS 3 ist subjektiv gesehen
wesentlich schneller, als das alte Fas File System mit Directory Caching.
Auch durch eine objektive Betrachtung wird dies deutlich:</P><BR><CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Vergleich: FFS gegen PFS2</B></H2></CAPTION><TR>
</TR><TR>
<TD></TD>
<TD><b>Kopieren</B></TD>
<TD><b>Löschen</B></TD>
</TR>
<TR>
<TD>FFS</TD>
<TD>607</TD>
<TD>60</TD>
</TR>
<TR>
<TD>PFS2</TD>
<TD>127</TD>
<TD>19</TD>
</TR>
</TABLE>

</CENTER></P><BR>
Diese Daten habe ich einer (unabh&#228;ngigen) FAQ Datei zum PFS3 System
entnommen. Der Test wurde auf einem A4000/40 mit einer IDE Quantum
Festplatte gemacht. Da der Test mehrfach durchgef&#252;hrt wurde, kann man den
Daten (alle Angaben &#252;brigens in Sekunden), denke ich mal, ruhigen Gewissens
glauben.</P> 


<u>Kompatibilit&#228;t:</U></P>
Das PFS 3 ist nahezu zu 100 % kompatibel zum Original Amiga Filesystem. Auf
meinem System gab es (fast) keine Anwendung, Tool oder Spiel, da&#223; aufgrund des PFS 3
seinen Dienst verweigert h&#228;tte. Lediglich DiskSalv (Recover Tool) und ReORG
(Defragmentierer) funktionieren mit PFS 3 nicht mehr. Dies ist aber auch
kein alzu gro&#223;es Problem, da man zumindest f&#252;r DiskSlav eine Alternative mit
auf die CD gepackt hat: Den PFS Doctor. Dieser ist zwar nicht ganz so
komfortabel und umfangreich wie DiskSalv, aber erf&#252;llt seinen Zweck voll und
ganz und kann somit als vollwertiger Ersatz angesehen werden. Und auch f&#252;r
ReORG ist ein Ersatz geplant, der in naher Zukunft erh&#228;ltlich sein soll. In der Anleitung
werden zus&#228;tzlich noch die Programme Disk Expander, Diskspare, Virocop,
Excelsior BBS und DOpus 5 als nicht 100%ig kompatibel zu PFS 3 angegeben.
Aus eigener Erfahrung kann ich sagen, da&#223; zumindest DOpus 5.5 problemlos mit
PFS 3 l&#228;uft; f&#252;r &#228;ltere Versionen existiert im Aminet ein Patch, so da&#223; auch
Opus Anwender in den Genuss des PFS 3 kommen k&#246;nnen.</P><BR><CENTER>
<img src="pfs1.jpg"></CENTER></P><BR>


<u>Besseres Fehlerhandling &amp; Validieren von Festplatten:</U></P>
Unter dem normalen Amiga Filesystem kann es zu Problemen kommen, die jeder
Anwender kennt: Man schreibt gerade eine Datei auf die Festplatte und will
dabei noch ein Program ausprobieren (Multitaskings ei dank) und dabei st&#252;rzt
der Rechner ab. Ein Neustart ist die Folge und auf einmal ist die Festplatte
viel lauter und auch der Bootvorgang dauert merklich l&#228;nger. Das liegt
daran, da&#223; man den Rechner bei einem Schreibzugriff unterbrochen hat und die
Datei nicht ordnungsgem&#228;&#223; geschrieben werden konnte. Das OS kann mit der
halbfertigen Datei nichts anfangen und versucht nun noch zu retten, was zu
retten ist; Datenverluste sind die Folge. Mit PFS 3 geh&#246;rt dieses Problem
der Vergangenheit an, da die Festplatte immer valdiert (was soviel wie
&quot;g&#252;ltig&quot; bedeutet) ist. Wer es nicht glaubt, soll es selber ausprobieren.
Mehrere Tests meinerseits untermauern diese Aussage eindrucksvoll. Somit wird nicht nur
Zeit gespart sondern auch Datenverlusten vorgebeugt.</P>

<U>Theoretische Obergrenzen von Massenspeichern:</U></P>
Beim Amiga Filesystem liegt die Obergrenze f&#252;r Festplatten bei 4 GB (was
sich aber mit OS 3.5 &#228;ndern soll), was eine nicht unerhebliche Limitierung
darstellt. Mit dem PFS 3 hat man die M&#246;glichkeit, Festplatten mit bis zu
2000 GB (!!) anzusprechen. Die Partitionsgr&#246;&#223;e darf mit dem PFS 3 nicht mehr
als 104 GB betragen. 
Als Vergleich: Die gr&#246;&#223;te Festplatte, die ich in den
Anzeigen finden konnte, war &quot;nur&quot; 50 GB gro&#223;, was selbst f&#252;r den
ambitionierten Anwender immer noch zwei Nummern zu viel ist (es sei denn man betreibt proffessionele
Videobearbeitung). Worauf ich hinaus will: Die &quot;Limitierungen&quot; des PFS 3
sind in den n&#228;chsten 5 Jahren f&#252;r den Amiga User nicht relevant.</P> 

<u>Sonstiges:</U></P>
Daneben gibt es nat&#252;rlich noch einige weitere Eigenschaften, die das PFS 3
noch attraktiver machen. So werden z.B. auch Zip Laufwerke vom PFS 3 direkt
unterst&#252;tzt. Nat&#252;rlich treffen auch hierauf alle Vorteile zu, auch wenn ich
dazu keine weiteren Angaben machen kann, da ich kein Zip Laufwerk besitze.
Nat&#252;rlich k&#246;nnen auch Disketten (HD und DD) mit dem PFS 3 formatiert werden,
was einen merklichen Geschwindigkeitsvorteil mit sich bringt und somit nur
empfohlen werden kann.<BR> 
Auch die Installation gestaltet sich (mit dem Commodore Installer) denkbar
einfach und ist auch von unerfahrenen Benutzern zu schaffen; dies war in der
Vergangenheit ja nicht immer so....
Quasi als Bonus liegt der CD noch die Vollversion des Jump And Run Games
&quot;Kung Fu&quot; (erschienen 1996) bei, das sicherlich eine nette Zugabe darstellt.
</P>
<h2><CENTER><FONT COLOR="GRAY">Anforderungen</FONT></h2></CENTER></P>
Das PFS 3 l&#228;uft auf jedem Amiga ab Kickstart 2.04. F&#252;r die Installation wird
zus&#228;tzlich noch die aktuelle Version des Installers (43.3) ben&#246;tigt, der
entweder im Aminet oder auf vielen PD Compilations zu finden ist. Eine
Festplatte sollte nat&#252;rlich vorhanden sein, da das PFS 3 prim&#228;r f&#252;r
Festplatten entwickelt worden ist. F&#252;r jede CPU existieren speziell
angepasste Versionen des PFS 3 und es l&#228;uft auch auf PPC Rechnern (eine
spezielle Version f&#252;r PPC Rechner ist z.Zt. in Entwicklung). Was den
Speicherausbau angeht,  hier gilt mal wieder der Spruch: &quot;Je mehr, desto
besser&quot;. Aber selsbt mit 4 MB l&#228;&#223;t sich ordentlich mit dem PFS 3 arbeiten;
und das ist ja wohl heute die absolute Untergrenze.</P>

<h2><CENTER><FONT COLOR="RED">Fazit</FONT></h2></CENTER></P>
Das PFS 3 ist ein Muss f&#252;r jeden Amiga User, der sein System nicht nur zum
Zocken nutzt. Der Geschwindigkeitsvorteil ist enorm und f&#228;llt bei der
t&#228;glichen Arbeit angenehm auf. Hinzu kommt noch, da&#223; das PFS 3 mitlerweile
soweit ausgereift ist, da&#223; man es fast schon als Standard ansehen kann und
es somit auch zu keinen nennenswerten fehlerhaften Anwendungen kommt. Der
Preis von 99 DM (Update: 49 DM) ist vollkommen gerechtfertigt. Tip: Noch
heute kaufen!</P>
<CENTER>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Schatztruhe</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>99 DM (Update: 49 DM)</TD>
</TR>
<TR>
<TD>Typ</TD>
<TD>Alternatives Filesystem für den Amiga</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>90 %</TD>
</TR>
</TABLE>






<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
