<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td>
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> GEMA </a></li>
<li> <a href="#a2"> Viren </a></li>
<li> <a href="#a3"> E-Mail Terror</a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table><br clear=all>
<hr>
<table border=0 width=100% cellpadding=6><tr><td>

<p align=center><a name="a1"><font color="800000" size="5">
<b>GEMA will Geb&uuml;hr f&uuml;r CD-Brenner erheben</font></b></a></p>
<p>
<img src="st_wolfinfov9.jpg" align="right" width="100" height="100" hspace="6">

Die Tatsache, dass sich mit Hilfe von CD-Brennern Musik auf CDs kopieren
l&auml;sst, hat zu einem Eingreifen der Gema gef&uuml;hrt. Einem Bericht der
Zeitschrift »Computer Partner« zufolge will die Gema jetzt auch eine Geb&uuml;hr
f&uuml;r CD-Brenner erheben. Eine entsprechende Klage gegen den Hersteller
Hewlett-Packard ist bereits eingereicht und wird im November verhandelt.
Die Gema betont, dass man die Urheberrechte der K&uuml;nstler vor dem
massenhaften privaten Kopieren geistigen Eigentums sch&uuml;tzen muss. </p>

<p>Derzeit wird bei CD-Brennern f&uuml;r PCs, die mit normalen CD-Rohlingen
arbeiten, noch keine Gemageb&uuml;hr f&auml;llig. Nur auf die speziellen
Audio-Rohlinge, die f&uuml;r den Betrieb in Stand-Alone-Ger&auml;ten f&uuml;r Audiodaten
erforderlich sind, ist die Abgabe in H&ouml;he von zw&ouml;lf Pfennig pro Spielstunde
schon aufgeschlagen. Auch die Verkaufspreise f&uuml;r diese Ger&auml;te werden
bereits inklusive Aufschlag (2,50 Mark pro Ger&auml;t) kalkuliert. Jetzt fordert
die Gema 20,50 Mark pro Standard-CD-Brenner von Hewlett-Packard ein
-r&uuml;ckwirkend zum 1. Januar 1998. Bei einer gesch&auml;tzen Verkaufszahl von
einer Million Brennern in den letzten zwei Jahren in Europa summieren sich
dabei die Nachzahlungen auf rund 20,5 Millionen Mark. Ein Erfolg der Klage
ist jedoch nicht absehbar, berichtet die Zeitschrift. Die meisten
CD-Brenner w&uuml;rden nicht zum Kopieren von Musikdaten, sondern vielmehr zur
Sicherung und zum Transport eigener Daten eingesetzt. Sollte die Klage aber
Erfolg haben, ist mit einer Prozesswelle gegen alle Hersteller von
CD-Brennern zu rechnen.</p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a2"><font color="800000" size="5">
<b>Der Online Virenscanner</font></b></a></p>
<center><img src="st_wolfinfov1.jpg" width="450" height="60"></center>

<p>Virenalarm im Cyberspace! Doch das Netz birgt nicht nur Gefahr, sondern
auch Abhilfe gegen virtuellen Parasitenbefall.</p>
              
<p>Mit [eine Zeitschrift] und dem Virenspezialisten Trend Micro k&ouml;nnen
Windows-Benutzer direkt aus dem Internet heraus zur&uuml;ckschlagen! Der
Online Virenscanner macht's m&ouml;glich. Gratis, ohne einen Pfennig zu
bezahlen. </p>

<p>Da unser Scanner immer die aktuellste Virendefinition verwendet, stellt
er eine ideale Erg&auml;nzung zu fest installierten Virenscannern wie
Norton Antivirus, McAfee Virus Scan oder Dr. Solomon Antivirus dar.</p>

<p>Bei Verdacht auf einen Virenbefall erhalten Sie hier Gewi&szlig;heit -
und einen ges&auml;uberten Computer. </p>

<center><table border=0><tr><td align=center>
powerd by:<br>
<img src="st_wolfinfov3.gif" width="133" height="47" border="0"></td>
<td align=center>
<img src="st_wolfinfov2.gif" width="82" height="87" border="0"><br>
<b><font size="1"><a href="habichnicht.html">Ja, ich will jetzt scannen!</a></font></b>
</td></tr></table></center>
<center><table border=0><tr>
<td align=center>
<img src="st_wolfinfov4.gif" width="80" height="80" border="0"><br>
<font size="1">Bootviren</font></td>
<td align=center>
<img src="st_wolfinfov5.gif" width="80" height="80" border="0"><br>
<font size="1">Macroviren</font></td>
<td align=center>
<img src="st_wolfinfov6.gif" width="80" height="80" border="0"><br>
<font size="1">Javaviren</font></td>
<td align=center>
<img src="st_wolfinfov7.gif" width="80" height="80" border="0"><br>
<font size="1">Dateiviren</font></td>
<td align=center>
<img src="st_wolfinfov8.gif" width="80" height="80" border="0"><br>
<font size="1">Trojanische Pferde</font></td></tr></table></center>
<p><font size=+1>FAQ's zum Virenscannen</font></p>
<ol>
<li><b>&quot;Ich klicke auf das Logo, um die Suche zu starten, aber nichts
passiert. Was stimmt nicht?&quot;</b>
<br>
<b>Antwort</b>: Es dauert etwas, bis der Online-Virenscanner die
Komponenten auf Ihren Rechner &uuml;bertragen hat. Dies h&auml;ngt mit der
Geschwindigkeit Ihres Netzwerkes zusammen. Beim n&auml;chsten Aufruf des
Scanners ist die Zeit wesentlich k&uuml;rzer, da sich Teile des
Antivirenprogrammes bereits in dem lokalen Cache befinden. Es ist
allerdings auch m&ouml;glich, dass der Scanner Ihren Browser nicht
unterst&uuml;tzt. Sie ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her.
Ebenso m&ouml;glich ist Netscape 3.01 oder h&ouml;her. Der
Online-Virenscanner arbeitet besser mit den vom Internet Explorer
unterst&uuml;tzten Active-X-Komponenten, da dort eine Installation ohne
Warnmeldungen m&ouml;glich ist.</li>

<li><b>&quot;Wie sicher ist der Online-Virenscanner? Werden irgendwelche
Daten zu Trend Micro &uuml;bertragen?&quot;</b><br>
<b>Antwort</b>: Es werden keine Daten zu Trend Micro &uuml;bertragen. 
Wir verwenden auch keine &quot;Cookies&quot; um Informationen &uuml;ber 
die Online-Virenscanner-Anwender zu sammeln.</li>

<li><b>&quot;Der Online-Virenscanner hat ein Virus gefunden. Was ist
jetzt zu tun?&quot;</b><br>
<b>Antwort</b>: Nach einem Virenfund haben Sie die M&ouml;glichkeit, 
den Virus aus der infizierten Datei zu entfernen (S&auml;ubern - 
Clean) oder die infizierte Datei zu l&ouml;schen (L&ouml;schen - 
Delete).</li>

<li><b>&quot;Ich habe gelesen, dass der Online-Virenscanner keinen
Echtzeitschutz bietet. Was hei&szlig;t das?&quot;</b><br>
<b>Antwort:</b> Der Online-Virenscanner bietet nur eine Momentaufnahme des
Infektionsstatus. Dieser Scanner ist demzufolge kein permanenter
Virenschutz, da er nicht st&auml;ndig das System &uuml;berwachen kann.
Einen optimalen Virenschutz erreichen Sie, indem Sie den Computer auf
eventuellen Virenbefall durchsuchen (genau dies macht der
Online-Virenscanner!) und im Anschlu&szlig; daran eine Anti-Viren-Software
installieren, die st&auml;ndig den Rechner &uuml;berwacht. Der
Online-Virenscanner bietet eine schnelle und einfache
Viren&uuml;berpr&uuml;fung. </li></ol>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a3"><font color="800000" size="5"><b>E-Mail
Terror</font></b></a></p> <p><img src="st_wolfinfov10.jpg" align="right"
width="100" height="100" hspace="6"> Ein Gericht in London hat erstmals
einen Briten verurteilt, der eine Frau per E-mail terrorisiert hatte. Der
24-J&auml;hrige muss f&uuml;r drei Monate ins Gef&auml;ngnis. Er hatte
seine Ex-Freundin mit E-mails bombardiert, in denen er sie unter anderem an
den Horrorfilm »Shining« mit Jack Nicholson erinnert hatte. In dem Streifen
versucht ein Mann, seine Frau und seine Kinder zu ermorden. Au&szlig;erdem
verfolgte der Verurteilte seine Ex-Freundin auf der Stra&szlig;e,
&uuml;berschwemmte sie mit Briefen und Postkarten und rief sie mit
verstellter Stimme an. </p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p align=center><a name="a4"><font color="800000" size="5"><b>Feedback </font></b></a></p>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b>AstroCorner</b> von Lars Philips </li>
<li> <b>CD-Tests</b> von Kilian Servais </li>
<li> <b>Fastfood</b> von Markus Thomaschewski </li>
<li> <b>Gamesberichte</b> von Andreas Guldner </li>
<li> <b>Textpage</b> von Frank Guder </li>
</ul>

<hr size=4>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
