<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Etusivu</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P &auml; &auml; k i r j o i t u s</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/thoriel.jpg" align="center" width="187" height="193" alt="Anu"></center>
				<br>
				Myyd&auml;&auml;n: Amiga<br>
				<br>
				Amiga myytiin j&auml;lleen. Kyseess&auml; on j&auml;rjestyksess&auml; jo viides varsinainen omistaja viimeisen kahden vuosikymmenen aikana. Amigan, Commodoren, Escomin, melkein-VIScorpin ja viimein Gatewayn j&auml;lkeen on palattu j&auml;lleen alkuun: Amigan vuodenvaihteessa Gatewaylta ostanut Amino Development Corporation muutti nimens&auml; Amiga Incorporatediksi. Amiga omistaa Amigan. Lohdullistako? Ehk&auml;. Toivottavasti.<br>
				<br>
				Commodoren merkityst&auml; Amigan historiassa tuskin kiist&auml;&auml; kukaan. 10 vuoden aikana yhti&ouml; valmisti kymmenkunta erilaista Amiga-tietokonetta ja p&auml;ivitti Amigan k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; aina kolmosversioon saakka. Kaikki nykyisetkin Amiga-kokoonpanot pohjautuvat n&auml;ihin koneisiin, sill&auml; pieni&auml; kosmeettisia emolevymuutoksia lukuunottamatta my&ouml;hemm&auml;t omistajat eiv&auml;t ole malleja muuttaneet tai uusineet. A500 ja A3000 olivat aikansa lippulaivoja ja A1200/A4000-koneissakin oli ainesta, vaikka kaikkien ominaisuuksia karsittiin alkusuunnitelmiin verrattuna lopulta rajusti ennen lopullista julkistamista.<br>
				<br>
				Commodore teki my&ouml;s virheit&auml;. Markkinointi oli surkeaa, eik&auml; yrityksen johdossakaan aina ollut kehumista. CDTV:n ajatus oli hyv&auml; (ja ehk&auml; my&ouml;s aikaansa edell&auml;), mutta markkinoinnin ja myyntilukujen valossa se oli t&auml;ydellinen floppi. Samaa tiet&auml; meniv&auml;t my&ouml;s A500+ ja A600. A4000 oli ilmestyess&auml;&auml;n liian kallis suurimmalle osalle kuluttajista, mutta A1200 myi kohtuullisesti. Ylihypetetty CD32 ei myynyt tarpeeksi, ja pitk&auml;&auml;n jatkunut kuilun reunalla taiteilu p&auml;&auml;tyi viimein rotkon pohjalle, kun ylihinnoiteltujen ja alivarusteltujen PC-koneidensa surkean myynnin vuoksi jatkuvaa tappiota tehnyt Commodore ajautui konkurssiin huhtikuussa 1994.<br>
				<br>
				Commodoren tuotemerkki&auml; ja logoa omille PC-koneilleen himoinnut Escom osti Commodoren j&auml;&auml;mist&ouml;n pitk&auml;n ja mutkikkaan oikeusprosessin j&auml;lkeen yli vuotta my&ouml;hemmin, hein&auml;kuussa 1995. Kauan tyhj&auml;n p&auml;&auml;ll&auml; roikkuneet amigistit saivat hieman balsamia haavoilleen: Escom perusti Amiga Technologiesin ja alkoi valmistaa uudelleen A1200- ja A4000T-koneita, jotka varustettiin k&auml;ytt&ouml;j&auml;rjestelm&auml;versiolla 3.1 ja uudella ohjelmistopaketilla. Suuriakin suunnitelmia oli, kuten PowerPC-pohjaiset uudet Power Amigat.<br>
				<br>
				Ja sitten: historia toisti itse&auml;&auml;n. Escom joutui taloudellisiin vaikeuksiin ylihinnoiteltujen PC-koneidensa huonon menekin ja samoihin aikoihin ostamansa tietokonekauppaketjun kustannusten vuoksi. Interaktiivista televisiotekniikkaa kehitellyt VIScorp tarjoutui ostamaan Amiga Technologiesin Escomilta. Kauppaa ei kuitenkaan koskaan ehditty vied&auml; loppuun saakka, sill&auml; Escom teki konkurssin loppuvuonna 1996.<br>
				<br>
				J&auml;lleen taikinoitiin puolisen vuotta, kunnes konkurssituomioistuin vahvisti toukokuussa 1997 Amiga Technologiesin myynnin Gateway 2000:lle (nyky&auml;&auml;n pelkk&auml; Gateway). Gatewaylla oli rahaa ja visioita. Uutta henkil&ouml;st&ouml;&auml; palkattiin ja lisenssej&auml; jaettiin. Messuilla kierrettiin promotuotteita jaellen ja julkistettiin yhteisty&ouml;kumppaneita, joiden nimet saivat leuat loksahtelemaan. Suunniteltiinpa siin&auml; sivussa my&ouml;s uuden sukupolven Amiga-laitteistoa, ja uutta k&auml;ytt&ouml;j&auml;rjestelm&auml;p&auml;ivityst&auml;kin lupailtiin. Pitk&auml;st&auml; aikaa Amigan tulevaisuus n&auml;ytti hyv&auml;lt&auml;.<br>
				<br>
				Viime vuoden lopulla Saku 99:n aikoihin myllersi taas. Jim Collas erosi Amigan johdosta, ja vanavedess&auml; l&auml;hti muitakin johtohenkil&ouml;it&auml;. Uusi Amiga, multimediakone MCC, hyllytettiin ja my&ouml;hemmin ilmoitettiin, ettei Gateway aiokaan tehd&auml; uutta Amiga-konetta, vaan voisi antaa sen kolmannen osapuolen teht&auml;v&auml;ksi. K&auml;ytt&ouml;j&auml;rjestelm&auml;p&auml;ivitys AmigaOS 3.5 sent&auml;&auml;n saatiin tuutista ulos lokakuussa. Gatewayn omistuksessa uuden Amiga-malliston kehitys muuntui siis lopulta uuden sukupolven Internet-laitteiden ja niiden k&auml;ytt&ouml;j&auml;rjestelm&auml;n ja sovellusten kehitykseksi.<br>
				<br>
				Onneksi Gatewayll&auml; sent&auml;&auml;n oli j&auml;rke&auml; tehd&auml; jotain toisin edellisiin omistajiin verrattuna. Amiga-nimell&auml; ei ollut sille en&auml;&auml; k&auml;ytt&ouml;&auml;, joten miksip&auml; sit&auml; ei voisi myyd&auml;? T&auml;m&auml;n vuoden alussa Amiga ja sen tavaramerkit myytiin Amino Development Corporationille, jossa vaikuttavat mm. Amiga-veteraanit Bill McEwen ja Fleecy Moss. Ensimm&auml;inen uuden Amigan yhteisty&ouml;kumppani on Tao Group (lue lis&auml;&auml; uutisista!).<br>
				<br>
				<center>* * *</center>
				<br>
				Perjantaille p&auml;iv&auml;tyss&auml; postituslistaviestiss&auml;&auml;n Fleecy Moss kertoi lis&auml;&auml; uuden Amigan jatkosuunnitelmista. P&auml;&auml;teemana on digitaalinen tulevaisuus kaikessa laajuudessaan: laitteistot, sovellukset, video, audio, pelit, s&auml;hk&ouml;postit, mit&auml; tahansa. Moss kertoo samaan hengenvetoon, ett&auml; my&ouml;s uuden sukupolven Amiga on tulossa. Vanhojen Amigoiden kehitysty&ouml;t&auml; tuetaan (esim. uusien AmigaOS-julkaisujen muodossa, jos niin on tarve), sill&auml; siirtyminen aikanaan uusiin koneisiin on teht&auml;v&auml; mahdollisimman helpoksi. Yritys pyrkii kaikin tavoin varmistamaan, ett&auml; vanhat ohjelmat toimivat uusissa koneissa tavalla tai toisella.<br>
				<br>
				Amiga keskittyy kahteen p&auml;&auml;alueeseen, markkinaryhm&auml;&auml;n. "Pathfinder"-ryhm&auml;ksi Moss mainitsee "digitaaliseikkailijat", tehok&auml;ytt&auml;j&auml;t, pelaajat, suunnittelijat, taiteilijat, videoty&ouml;l&auml;iset jne. Ensimm&auml;iset Pathfinder-tuotteet suunnataan x86:lle ja PPC:lle. Toinen p&auml;&auml;alue on "Domestic Digital Habitat", DDH, josta Moss ei kerro enemp&auml;&auml; mutta jonka nimest&auml; voi jotain p&auml;&auml;tell&auml;. N&auml;m&auml; kaksi markkina-aluetta pidet&auml;&auml;n erill&auml;&auml;n, mutta niiden tuotteet toimivat my&ouml;s kesken&auml;&auml;n, jos k&auml;ytt&auml;j&auml; niin haluaa.<br>
				<br>
				My&ouml;s uudet kotisivut ovat tulossa l&auml;hiaikoina. Sivustoa on testattu kaikilla (tietenkin my&ouml;s Amigan) selaimilla mahdollisimman hyv&auml;n toimivuuden varmistamiseksi, ja avaamisen j&auml;lkeen sivustoa pyrit&auml;&auml;n laajentamaan mahdollisimman nopeasti. Moss toivoo, ett&auml; sivustosta tulee amigistien kokoontumispaikka, jossa he voivat ilmaista mielipiteens&auml; tai vaikka vain jutella kesken&auml;&auml;n.<br>
				<br>
				Kehitysty&ouml; on my&ouml;s k&auml;ynnistym&auml;ss&auml;. Vastuuhenkil&ouml;t ja suurin osa kehitysty&ouml;ryhm&auml;st&auml; on valittu, ja kehityslaitteisto- sek&auml; ohjelmistopuoli on ty&ouml;n alla. Jotain Amigakin on menneest&auml; oppinut: p&auml;iv&auml;m&auml;&auml;ri&auml; ei julkisteta, ennen kuin tuote todella on valmis. Suunnitelmistaan Amiga kyll&auml; tiedottaa, mutta ilman kiinteit&auml; p&auml;iv&auml;m&auml;&auml;ri&auml;. "Tarpeeksi vahinkoa on jo tehty", Moss sanoo viitaten t&auml;ll&auml; mit&auml; ilmeisimmin aiempiin Gatewayn aikaisiin julkistuksiin, joista yksik&auml;&auml;n ei toteutunut m&auml;&auml;r&auml;ajassa.<br>
				<br>
				<center>* * *</center>
				<br>
				Onko Amigan vihdoinkin ostanut joku, joka todella saa jotain uutta ja konkreettista aikaiseksi? Ainakin yrityksen riveiss&auml; on paljon Amiga-veteraaneja, joille Amiga on aina ollut syd&auml;men asia - aivan kuten meille "tavallisille" k&auml;ytt&auml;jillekin. 1980-luvun alussa Hi-Toro-yhti&ouml;n Lorraine-koneenr&auml;&auml;p&auml;leest&auml; alkunsa saanut uskomaton tarina ansaitsisi jo saada kunnon juonenk&auml;&auml;nteen - t&auml;ll&auml; kertaa mieluummin vaikka sen pelastavan ritarin valkoisessa haarniskassaan niiden i&auml;nikuisten kurpitsavaunujen sijasta.<br>
				<br>
				Anu Seilonen
			</td></tr>
		</table>
		</p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

