<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Etusivu</title>
	</head>

	<body bgcolor="white" link="#000033" alink="red" vlink="#003366"><center>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
		<p><font color="#191970">
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="100%" bgcolor="navy" align="center">
				<font color="#f0f8ff" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P &auml; &auml; k i r j o i t u s</b></font>
			</td></tr>
			<tr><td width="100%" height="15" bgcolor="#d8ecfd" align="center">
				<font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font>
			</td></tr>
		</table>
		</font></p>
		<p>
		<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
			<tr><td width="50%" bgcolor="#d8ecfd">
				<center><img src="kuvat/janne.jpg" align="center" width="150" height="150" alt="Janne"></center>
				<br>
				Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on ollut viime Sakun j&auml;lkeen melkoisessa muutoksen tilassa, kun uusi hallitus on siirtynyt vet&auml;m&auml;&auml;n jo varsin vakiintuneeseen tilaan ehtinytt&auml; kelkkaa. Itse hallituksesta vet&auml;ytyneen&auml; olen seurannut tilannetta sivusta ja avustanut aikaisemmin vastuullani olleiden toimintojen siirt&auml;misess&auml; uusiin k&auml;siin. Kulissien takana tapahtuva toiminta j&auml;&auml; helposti julkista kiitosta vaille, joten haluan k&auml;ytt&auml;&auml; t&auml;m&auml;n tilaisuuden ja kiitt&auml;&auml; omasta puolestani erityisen roolin ottaneita uuden hallituksen j&auml;seni&auml; (aakkosj&auml;rjestyksess&auml;).<br>
				<br>
				Terho Henriksson: Saku 99:n mediayhteyksist&auml; vastannut Terho l&auml;hti terhakkaasti viem&auml;&auml;n eteenp&auml;in keskustelua Saku-lehden uusista vaatteista. Paitsi ett&auml; keskustelun pohjalta tehtiin hallituksen kesken p&auml;&auml;t&ouml;ksi&auml; lehden tulevista formaateista, Terho suunnitteli ja toteutti uuden upean ilmeen HTML-pohjaiselle Saku-lehdelle. Loistava esimerkki siit&auml;, miten yksi henkil&ouml; saa paljon aikaan kun oma-aloitteisuutta ja pitk&auml;j&auml;nteisyytt&auml; riitt&auml;&auml;.<br>
				<br>
				Timo Kemppaala: Timo, joka tunnetaan Saku-lehden sivuilta ja Amiga-postituslistalta loppumattomasta kiinnostuksestaan teknisiin yksityiskohtiin, otti oma-aloitteisesti loppuvuodesta ty&ouml;stett&auml;v&auml;kseen yhdistyksen pikkujoulut hallituksen postituslistalla k&auml;ydyn keskustelun pohjalta. Juttelimme marras-joulukuussa Timon kanssa useamman tovin puhelimessa kaikesta t&auml;llaisen kerhoillan j&auml;rjest&auml;miseen liittyv&auml;st&auml; ja toivoa sopii, ett&auml; Timo hy&ouml;dynt&auml;&auml; ker&auml;&auml;m&auml;&auml;ns&auml; kokemusta jatkossakin.<br>
				<br>
				Jarmo Piippo: Viimekev&auml;isen Saku-rompun postimyyntikampanjan toimitukset toteuttanut Jarmo on tuonut arvokkaan lis&auml;n hallituksen postituslistan keskusteluun. Jarmo on ollut aidosti kiinnostunut yhdistyksen toiminnan periaatteista, tehdyist&auml; virheist&auml; ja opituista asioista, mik&auml; on auttanut merkitt&auml;v&auml;sti vanhan tietotaidon siirt&auml;mist&auml; uudelle hallitukselle.<br>
				<br>
				Janne Pikkarainen: Aikaisemmin mm. tapahtumaj&auml;rjestelyiss&auml; avustanut yhdistyksen nykyinen varapuheenjohtaja otti yll&auml;pidett&auml;v&auml;kseen yhdistyksen kotisivut. Kirjoitin Jannelle kotisivujen yll&auml;pito-ohjeet ja toimitin sivukokonaisuuden yll&auml;pito-ohjelmineen h&auml;nelle rompulla. Toistaiseksi sivuille ei ole ehditty tehd&auml; kuin muutamia ehdottamiani perusp&auml;ivityksi&auml;, mutta Janne on alustanut hallituksen listalla keskustelua tietokantapohjaisten palveluiden hy&ouml;dynt&auml;misest&auml;. Webmasterointi on siis siirtynyt hitaasti, mutta varmasti uusiin k&auml;siin - t&auml;st&auml; on hyv&auml; jatkaa.<br>
				<br>
				Anu Seilonen: Kiitoslista ei varmasti olisi t&auml;ydellinen ilman Anua, joka on paitsi ahkerasti p&auml;&auml;toimittanut Saku-lehte&auml;, ollut my&ouml;s kiinnostunut yhdistyksen yhteyksist&auml; ulkomaille. Anu k&auml;&auml;nsi ja muokkasi esimerkiksi Saku-lehteen kirjoittamani artikkelin Saku 99 -tapahtumasta saksalaiselle Amiga-lehdelle julkaistavaksi, ja Anu on muutenkin vastaillut tarmokkaasti ulkomailta tuleviin yhdistyst&auml; koskeviin tiedusteluihin.<br>
				<br>
				Kiitos my&ouml;s Risto M&auml;ki-Pet&auml;ykselle jatkuneesta ty&ouml;st&auml; HTML-Sakun toimittamisessa, Veli-Matti Vuorensyrj&auml;lle Saku-postitusten hoitamisesta ja Tomi Jaskarille kirjanpitoty&ouml;st&auml;.<br>
				<br>
				Haluan samalla kiitt&auml;&auml; kaikkia lukijoita ja yhdistyksen parissa puuhastelleita kuluneista vuosista. Kiitos! Vaikka Amigan tilanne on koetellut meit&auml; jatkuvasti, hauskoja hetki&auml; on silti takana lukemattomia. Toivottavasti polkumme kohtaavat jatkossakin.<br>
				<br>
				Hyv&auml;&auml; uutta vuosituhatta!<br>
				<br>
				Janne Sir&eacute;n
			</td></tr>
		</table>
		</p>
		<br>
		<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		<br>
	</center></body>

</html>

