<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Espial er&ouml;ffnet Java-Entwicklerportal f&uuml;r Internetger&auml;te</H2>
<P>
&raquo;Espial verbindet sich mit innovativen Technologie- und Medien-Firmen, um
eines der ersten Java(TM)-Entwicklerportale f&uuml;r intelligente Internet-
Ger&auml;te zu starten.
</P>
<P>
Devicetop.com, unterst&uuml;tzt von Sun, Intel, Motorola, Amiga, Tao Group, IAN,
Pointbase, Dr. Dobb's, Java Report und JavaWorld.com(tm), gibt die Portal-
Er&ouml;ffnung bekannt.
</P>
<H3>5. Juni 2000, JavaOne(SM)-Konferenz, San Francisco</H3>
<P>
Espial, ein Marktf&uuml;hrer Im Bereich der Infrastruktur-Software f&uuml;r das sich
ausbreitende Internet, stellte heute Devicetop.com vor, ein Internet-
Portal, das den Entwicklern mit Java(TM)-Technologie f&uuml;r Web-Inhalte und
Anwendungsdiensten f&uuml;r intelligente Internet-Vorrichtungen gewidmet ist.
Devicetop.com ist darauf ausgerichtet, ein herausragendes Internet-Ziel f&uuml;r
Entwickler zu werden, die ihre Programmierf&auml;higkeiten vom PC-Tischger&auml;t zu
den Nach-PC-Ger&auml;ten erweitern wollen.
</P>
<P>
Devicetop.com ist eine Initiative von Espial, die von Sun, Intel, Motorola,
Amiga, Tao Group, Internet Appliance Network (IAN), Pointbase, Java Report,
Dr. Dobb's und JavaWorld.com (tm) unterst&uuml;tzt wird, um eine interessierte
Gemeinschaft von Entwicklern der dritten Seite zu begr&uuml;nden, die sich auf
die Herstellung von Diensten f&uuml;r intelligente Ger&auml;te konzentrieren. Das
Devicetop.com Portal wird im Zusammenhang mit der JavaOne(SM) 2000
Developer Conference in San Francisco gestartet, dem in der Welt
herausragenden Ereignis f&uuml;r Entwickler der Java-Technologie.
</P>
<P>
Nach einem k&uuml;rzlich erschienenen Bericht der International Data Corporation
(IDC) steht der Markt f&uuml;r Internet-Ger&auml;ten vor einer Explosion w&auml;hrend der
n&auml;chsten Jahre. Es wird erwartet, dass dieser Markt allein in den USA im
Jahr 2001 55 Millionen Einheiten f&uuml;r 15 Milliarden Dollar aufnehmen wird.
Im Jahr 2002 wird die Zahl der Liefereinheiten f&uuml;r Internet-
Verbraucherger&auml;te die der PC-Einheiten &uuml;bersteigen. Der Mark f&uuml;r Internet-
Ger&auml;te schlie&szlig;t Hand-PDAs, drahtlose intelligente Telefone, Internet-
Bildschirm-Telefone, Web-Tablets, Spiel-Konsolen, Fahrzeug-Computer und
interaktive TV-Set-Top-Boxen ein. Sieht man die vorausgesagte Explosion des
Marktes f&uuml;r Informationsger&auml;te und die Java-Plattform als de-facto-Standard
f&uuml;r die Gr&uuml;ndung einer Gemeinschaft freier Entwickler und Erschaffung der
Ger&auml;te an, wird ein Portal wie Devicetop.com als Katalysator f&uuml;r den
wachsenden Markt der Anwendungen im Bereich der Informationstechnik dienen.
</P>
<P>
&quot;Der Markt f&uuml;r intelligente Ger&auml;te w&auml;chst schnell und bringt Entwicklungen
mit sich, die versprechen, die Art und Weise unserer t&auml;glichen Arbeit und
Kommunikation zu revolutionieren,&quot; stellt Mal Raddalgoda, Leitender
Direktor f&uuml;r Strategische Marktwirtschaft bei Espial, fest. &quot;Die
M&ouml;glichkeiten, Dienste f&uuml;r intelligente Ger&auml;te zu erzeugen und zu
entwickeln, sind grenzenlos und wir wollen den Entwicklern helfen, sie
schnell vom Arbeitstisch ins Ger&auml;t zu bringen. Das Devicetop.com Portal ist
der n&auml;chste Schritt, um Espials Vision der universellen Dienstleistung f&uuml;r
intelligente Ger&auml;te zu verwirklichen, wobei die Kombination von
dienstleistungsf&auml;higen Ger&auml;ten, dem Internet und einem breit gef&auml;cherten
Angebot an Diensten den Einsatz einer neuen Generation von
Fernmeldediensten vorantreiben wird.&quot;
</P>
<P><B>&Uuml;ber Devicetop.com</B></P>
<P>
Devicetop.com ist ein herausragendes Web-Portal f&uuml;r Entwickler von Diensten
f&uuml;r intelligente Ger&auml;te. Devicetop.com bietet einen Umschlagplatz f&uuml;r
Nachrichten, Industrie-Informationen, Diskussions-Foren, technische
Anleitungen und auch Werkzeuge f&uuml;r Software-Entwickler, um damit zu lernen,
zu kommunizieren und um Web-Inhalte und Anwendungsdienste zu erzeugen.
Devicetop.com bietet Entwicklern einen umfassenden Pr&auml;sentationsmarkt, um
ihre Dienste f&uuml;hrenden Herstellern von Verbraucher-Elektronik, ISPs und
Netzbetreibern vorzustellen.
</P>
<P><B>Der Devicetop.com BMW-Z3-Pr&auml;mien-Wettbewerb</B></P>
<P>
Devicetop.com schenkt einen BMW-Z3-Roadster dem Entwickler, der die beste
auf Java-Technologie basierende Anwendung f&uuml;r intelligente Ger&auml;te zum
Devicetop.com Portal l&auml;dt. Der Finalist des Wettbewerbs wird durch eine
Wahl der Mitglieder des Devicetop.com Portals bestimmt.
</P>
<P><B>Partner von Devicetop.com</B></P>
<P>
Das Devicetop.com-Partner-Programm ist ein Zentrierungspunkt f&uuml;r in der
Industrie f&uuml;hrende Firmen, die sich auf die Entwicklung von L&ouml;sungen f&uuml;r
die Nach-PC-Welt konzentrieren. Sponsoren dieser Initiative sind unter
anderen Sun Microsystems, Intel, Motorola, Amiga, Tao, Pointbase und IAN.
</P>
<P>
&quot;Jeden Tag erh&ouml;hen immer mehr Produkte die Kraft des Internet und f&uuml;hren
uns weiter zu einer Welt von Millionen von angeschlossenen, intelligenten
drahtlosen Ger&auml;ten,&quot; bemerkt Farooq Butt, Manager f&uuml;r Strategische
Gesch&auml;ftsentwicklung von Motorola SPS. &quot;Motorolas DigitalDNAÔ Hard- und
Software-L&ouml;sungen f&uuml;r drahtlose Anwendungen in Verbindung mit Espials
innovativer Strategie f&uuml;r das Entwickler-Portal bietet einen gro&szlig;en Antrieb
f&uuml;r Entwickler wo auch immer, die den explodierenden Markt f&uuml;r intelligente
Ger&auml;te mit Java-Technologie im Auge haben.&quot;
</P>
<P>
&quot;Wir freuen uns sehr, zu den Gr&uuml;ndungsmitgliedern von Devicetop.com zu
geh&ouml;ren,&quot; sagt Francis Charig, Vorsitzender der Tao-Gruppe. &quot;Wir glauben,
dass diese k&uuml;hne Initiative einen kennzeichnenden Beitrag zur Gemeinschaft
f&uuml;r Informations-Anwendungen leisten wird. Mit der Gr&uuml;ndung des
Devicetop.com Portals haben Espial, Amiga und die Tao-Gruppe einen
wesentlichen Beitrag geleistet, um die Entwicklung des interaktiven und
Multimedia-Gehalts, von Anwendungen und L&ouml;sungen f&uuml;r intelligente Ger&auml;te zu
f&ouml;rdern.&quot;
</P>
<P>
&quot;Amiga, Inc. und die Amiga-Gemeinschaft sind begeistert, an Devicetop.com
teilhaben zu k&ouml;nnen. In Zusammenarbeit mit Espial und der Tao-Gruppe wollen
wir die Entwicklungs-Gemeinschaften von Amiga und Java vereinigen und die
gro&szlig;e talentierte Gruppe der Entwickler f&uuml;r Java-Technologie verst&auml;rken,
die auch weiterhin auf dem Wege zu kreativen Software-Produkten f&uuml;hrend
sein wird,&quot; merkt Bill McEwen, Pr&auml;sident und CEO, Amiga, Inc., an. &quot;Die
Einbeziehung von Amiga in diese Initiative verst&auml;rkt den reichen Inhalt und
wird zu neu geschaffenen, h&ouml;chst innovativen Anwendungen f&uuml;r die Amiga-
Plattform der N&auml;chsten Generation f&uuml;hren.&quot;
</P>
<P>
&quot;Unsere Partnerschaft mit Espial f&uuml;r Devicetop.com kennzeichnet die
Gr&uuml;ndung einer erstaunlichen neuen virtuellen Gemeinschaft f&uuml;r diejenigen,
die Anwendungen und Dienste f&uuml;r intelligente Ger&auml;te schaffen,&quot; sagt Audrey
Parma, Pr&auml;sident von IAN. &quot;Java-Technologie ist ein Schl&uuml;sselelement zur
Entwicklung wahrhaft innovativer intelligenter Ger&auml;te, die es IANs
Plattform f&uuml;r Vertriebsl&ouml;sungen erlauben, Ger&auml;te-unabh&auml;ngig zu bleiben. Wir
freuen uns sehr, Teil dieser Initiative zu sein, die das Potential f&uuml;r die
Entwicklung von vielversprechenden Ger&auml;tediensten f&uuml;r den Internet-
Anwendungsmarkt bietet.&quot;
</P>
<P>
&quot;Es besteht ein wachsendes Interesse bei den Unternehmen, Anwendungen zum
Internet und zu mobilen, nicht drahtgebundenen Ger&auml;ten zu verlagern,&quot; sagt
Bruce Scott, Pr&auml;sident und CEO, Pointbase. &quot;Alle diese Anwendungen werden
fortschrittliches Datenmanagement und Synchonisationstechnologie ben&ouml;tigen,
um die Bed&uuml;rfnisse der Anwender in einem globalen Ma&szlig;stab zu erf&uuml;llen. Das
Ergebnis unsere Zusammenarbeit mit Espial und Devicetop.com in dieser
Initiative wird die Unterst&uuml;tzung der Entwickler bei der Schaffung und der
Einf&uuml;hrung der M&ouml;glichkeiten f&uuml;r ger&auml;teunabh&auml;ngiges Datenmanagement sein,
wie es f&uuml;r die Menge der verteilten mobilen Anwendungen gebraucht wird, die
wir in den n&auml;chsten Jahren auf uns zukommen sehen werden.&quot;
</P>
<P><B>Devicetop.com Medien-Partner</B></P>
<P>
Das Programm der Devicetop.com Medien-Partners besteht aus bestentwickelten
Verlagen in guter Position mit hochqualifizierten Beitr&auml;gen, um in diese
neue &Auml;ra von Internet-Anwendungen einzuf&uuml;hren. Medien-Sponsoren in dieser
Initiative erlauben uns abzuw&auml;gen, was wir bei unser Hilfe, eingebettete
Produkte (einschlie&szlig;lich Internet-Anwendungen) zu erzeugen, gelernt haben
und dieses Wissen bei der Entwicklung herausragender und wertvoller Java-
Technologie und anwendungsfreundlichen Kundenger&auml;ten einzubringen.
</P>
<P>
&quot;Als erstes Magazin, das die Java-Sprache in ihrem ganzen Umfang abgedeckt
hat und als langzeitiger F&uuml;rsprecher der eingebetten Technologie und den
Erwartungen der intelligenten Ger&auml;tschaften freut sich DJC ganz besonders,
an dem Programm teilhaben zu k&ouml;nnen, das zur Entwicklung zwischen diesen
beiden Welten ermutigt.&quot;
</P>
<P>
&quot;Als Mitglied dieser Gemeinschaft f&uuml;r Dienste mit intelligenten Ger&auml;ten
widmet Java Report zusammen mit Espial seine Anstrengungen der Hilfe zur
F&ouml;rderung dieses Forums als ein Ort, wo Entwickler lernen, kommunizieren,
entwickeln und Anwendungsdienste f&uuml;r die Internet-Anwendergemeinschaft zur
Verf&uuml;gung stellen werden,&quot; sagte Dwight Deugo, Chefredakteur von Java
Report. &quot;Die Teilnahme an dieser Initiative zeigt den Willen von Java
Report, zur Entwicklung und der Einf&uuml;hrung verbesserter intelligenter
Ger&auml;te beizutragen.&quot;
</P>
<P>
&quot;Espial &uuml;bernahm eine missionarische Rolle bei der Schaffung einer
Langzeit-Freundschaft mit der Gemeinde der Java-Technologie-Entwickler. Die
Gemeinde bl&uuml;ht und gedeiht am Besten, wenn sie Zugang zu den genauesten
technischen Informationen bekommt,&quot; sagte Carolyn Wong, Chefredakteur von
JavaWorld.com. &quot;Die Bereitstellung von Lehrmitteln, wie man etwas tut, ist
das, was wir am Besten k&ouml;nnen und es deshalb stellen wir diese Werte zum
Wachstum der auf Java-Technologie basierenden Ger&auml;teanwendungen zur
Verf&uuml;gung.&quot;
</P>
<P>
Weitere Hinweise, wie man Mitglied der Strategischen Partner oder des
Medien-Partner-Programms werden kann, erhalten Sie &uuml;ber Jill Meloche,
Manager f&uuml;r Web Marketing f&uuml;r Devicetop.com, bei <A HREF="mailto:jmeloche@espial.com">jmeloche@espial.com</A> oder
unter 613.230.4770 x141.
</P>
<P><B>Espial</B></P>
<P>
Als ein Marktf&uuml;hrer bei der Infrastruktur-Software f&uuml;r den intensiven
Internet-Einsatz bietet Espial universelle Punkt-zu-Punkt-L&ouml;sungen f&uuml;r den
Betriebsdienst mit intelligenten Ger&auml;ten. Das schlie&szlig;t Kern-Anwendungen und
Entwicklungswerkzeuge f&uuml;r Ger&auml;tehersteller ein, wie Espial Devicetop(tm),
eine dienstf&auml;hige Plattform und Espial Escape(TM), den am weitesten
fortgeschrittenen Web-Browser der Welt. Enthalten ist auch Espial
DeviceServer(TM), eine Dienst-Verwaltungsplattform, die dem Service-
Provider erlaubt, Inhalte zu verwalten und an einen weiten Bereich von
intelligenten Ger&auml;ten zu verteilen, z.B. an Set-Top-Boxen, Bildschirm-
Telefone, Spielkonsolen, intelligente Fahrzeuge und Handger&auml;te. Besuchen
Sie www.espial.com.
</P>
<P>
Produkte von Espial werden auf f&uuml;hrenden Operationssystemen f&uuml;r Ger&auml;te und
Einrichtungen f&uuml;r virtuelle Java-Maschinen unterst&uuml;tzt von Firmen wie
Microsoft (NASDAQ: MSFT) - WinCE, Linux - Redhat (NASDAQ: RHAT), Symbian -
EPOC32, Wind River (NASDAQ: WIND) - VxWorks und pSOS, QNX - QNX 4 und
Neutrino, Microware (NASDAQ: MWAR) - OS9, Be - (NASDAQ: BEOS) - BEOS, Sun
Microsystems (NASDAQ: SUNW) - Java platform, Tao Group - intent (tm) und
Insignia (NASDAQ: INSGY) - Jeode.
</P>
<P><B>Anmerkung f&uuml;r Redakteure:</B></P>
<P>
Espial, Espial Escape, Espial Espresso, Espial DeviceTop und Espial
DeviceServer sind Warenzeichen der Espial Group Inc. Java und alle anderen
auf Java basierenden Warenzeichen sind eingetragene Warenzeichen von Sun
Microsystems.
</P>
<P>
Alle anderen Warenzeichen geh&ouml;ren ihren jeweiligen Eigent&uuml;mern.
</P>
<P>
Sun, Sun Microsystems, das Sun Logo, Java, JavaWorld and JavaOne sind
Warenzeichen oder eingetragene Warenzeichen von Sun Microsystems, Inc. in
den Vereinigten Staaten und anderen L&auml;ndern.
</P>
<P>
Amiga, das Amiga-Rauten-Logo und das Amiga-Boing-Ball-Logo sind
Warenzeichen von Amiga, Inc.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
