<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG7.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG9.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>8. Kurzmeldungen</H2>
<UL>
<LI> Nach Angaben von AMIGA-Pr&auml;sident Bill McEwen will das Unternehmen das
  AmigaNG-Betriebssystem entgegen anderslautenden Behauptungen doch mit
  Memory Protection ausstatten. G&ouml;tz Ohnesorge vom Entwickler-Support sagte
  zudem, dass die meisten Mitglieder der Entwicklungsabteilung daf&uuml;r seien,
  dieses Feature auf eine herk&ouml;mmliche Art und Weise zu implementieren.
</LI>
<BR><LI> Vor wenigen Tagen wurde von dem US-Fernsehsender CNNfn ein Liveinterview
  mit AMIGA-Pr&auml;sident Bill McEwen ausgestrahlt. Ein Transkript ist auf
  <A HREF="http://cnnfntech.yellowbrix.com/pages/cnnfntech/Story.nsp?story_id=11680" TARGET="_top">http://cnnfntech.yellowbrix.com/pages/cnnfntech/Story.nsp?story_id=11680</A>
  911&amp;ID=cnnfntech&amp;scategory=Computers zu finden.
</LI>
<BR><LI> In einem Interview mit dem Internet-Dienst GamersDepot.com
  (<A HREF="http://www.gamersdepot.com/interviews/amiga/001.htm" TARGET="_top">http://www.gamersdepot.com/interviews/amiga/001.htm</A>) hat AMIGA-Pr&auml;sident
  Bill McEwen in Zusammenhang mit dem AmigaNG erkl&auml;rt, dass der DEC Alpha
  der von ihm pers&ouml;nlich bevorzugte Prozessor sei und er ihn verwenden
  w&uuml;rde, wenn er k&ouml;nnte. Momentan bem&uuml;hten sich zwei Chiphersteller um
  AMIGA. Gegen Ende des Jahres werde es eine Ank&uuml;ndigung geben. - Es
  scheint also durchaus m&ouml;glich, dass tats&auml;chlich ein Alpha-Prozessor f&uuml;r
  den &raquo;Amiga One&laquo; verwendet wird.
</LI>
<BR><LI> In demselben Interview hat Bill McEwen nochmals erkl&auml;rt, dass
  &quot;selbstverst&auml;ndlich&quot; ein B&ouml;rsengang geplant sei.
</LI>
<BR><LI> Nach Angaben von Gary Peake, AMIGAs &raquo;Director for Developer Support&laquo;,
  wird es vier unterschiedliche Support-Stufen f&uuml;r Entwickler geben (in
  aufsteigender Reihenfolge):
<UL>
<LI> Scout: Level f&uuml;r Freeware-, Giftware- und OpenSource-Entwickler
</LI>
<BR><LI> Trailblazers: Level f&uuml;r kleine Shareware- / kommerzielle Entwickler
</LI>
<BR><LI> Pathfinders: Level f&uuml;r gr&ouml;&szlig;ere kommerzielle Entwickler
</LI>
<BR><LI> Premier Partners: engere Partnerschafts-Beziehung mit AMIGA
</LI>
</UL>
</LI>
<BR><LI> Laut Gary Peake darf die AmigaNG-Entwicklersoftware - im Unterschied zu
  den meisten anderen Computerprogrammen - pro Exemplar auf mehreren
  Rechnern installiert werden. Das Unternehmen wolle Entwicklern, die
  beispielsweise sowohl zuhause als auch auf der Arbeitsstelle Zugang zu
  einem Computer haben, keine Beschr&auml;nkungen dieser Art auferlegen.
</LI>
<BR><LI> Zum Betrieb des Amiga SDK muss eine Netzwerkkarte installiert sein. Deren
  Nutzung ist aber nicht unbedingt erforderlich. Die Version der
  verwendeten Soundblaster-Soundkarte ist &uuml;brigens laut Gary Peake nicht
  relevant.
</LI>
<BR><LI> AMIGA hat seiner Website eine funktionellere Men&uuml;leiste spendiert, &uuml;ber
  die sich nun u.a. auch ein Bereich f&uuml;r Investoren anw&auml;hlen l&auml;sst. Dort
  wird auch der Grafikkartenhersteller Matrox als AMIGA-Partner erw&auml;hnt.
</LI>
<BR><LI> Wenige Wochen nach der HTML-Version ist nun auch die PDF-Variante von
  AMIGAs Online-Magazin Amiga World 05/00(!) erschienen. Sie kann &uuml;ber
  <A HREF="http://www.amiga.com/press/zine/6-3-00/AW2.pdf" TARGET="_top">http://www.amiga.com/press/zine/6-3-00/AW2.pdf</A> heruntergeladen werden.
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG9.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
