<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. AMIGA und Software Hut schlie&szlig;en strategische Vertriebsvereinbarung ab</H2>
<P>
&raquo;Snoqualmie, Wa. USA - Am 17. Juni 2000 gab Amiga seine Partnerschaft mit
Software Hut, Inc. in West Chester, Pennsylvania, zum Vertrieb des neuen
Amiga, des SDK (Software Developer Kit) und der klassischen Amiga-Produkte
bekannt. Software Hut, der f&uuml;hrende Vertrieb f&uuml;r klassische Amiga-Produkte
in Nord-Amerika, wird nun ebenso wie die existierenden klassischen Amiga-
Produkte auch das SDK der neuen Generation f&uuml;r alle Amiga-H&auml;ndler,
Endverbraucher und Entwickler zur Verf&uuml;gung halten.
</P>
<P>
&quot;Wir freuen uns, dass wir &uuml;ber Software Hut einfachen Zugriff auf alle
unsere Produkte, sowohl klassische wie auch die der N&auml;chsten Generation,
bieten k&ouml;nnen. Software Hut hat in den vergangenen 12 Jahren die Amiga-
Gemeinschaft sehr wirksam unterst&uuml;tzt und hat in Nord-Amerika die gr&ouml;&szlig;te
Auswahl an Amiga-Produkten am Lager,&quot; sagte Randy Hughes, Vize-Pr&auml;sident
f&uuml;r Verkauf und strategische Verbindungen bei Amiga Inc. &quot;Ihr Einsatz und
ihre Erfahrung werden in den n&auml;chsten Jahren eine gro&szlig;e Hilfe bei der
Versorgung unseres klassischen Marktes mit Produkten sein, aber auch bei
der Entwicklung und der Erweiterung unserer M&ouml;glichkeiten, unsere Produkte
der N&auml;chsten Generation zu vertreiben. Gemeinsam mit der Gemeinschaft
begr&uuml;&szlig;en wir Software Hut in unserer Zukunft.&quot;
</P>
<P>
Gary Peake, Direktor f&uuml;r Kunden-Unterst&uuml;tzung bei Amiga Inc., sagte: &quot;Ich
freue mich sehr, dass wir Software Hut als einen der Regionalvertriebe f&uuml;r
Nord-Amerika mit an Bord haben! Joe und Trish habe die letzten elf Jahre
ihres Lebens der Unterst&uuml;tzung der Amiga-Gemeinschaft durch freundliche und
kenntnisreiche Dienstleistungen, angenehme Preisgestaltung und ethische
Standards gewidmet, durch die Gesch&auml;fte mit ihnen eine reine Freude waren.&quot;
</P>
<P>
Software Hut, Inc., ein wohlbekannter Name in der weltweiten Amiga-
Gemeinschaft von heute, freut sich, den Vertrieb der neuen Amiga-Linie
&uuml;bernehmen zu k&ouml;nnen. Joseph Muoio, Pr&auml;sident von Software Hut,
kommentierte: &quot;Wir wir sind begeistert, der ganzen Gemeinschaft die Amiga-
Erzeugnisse anbieten zu k&ouml;nnen. Wir haben gute Verbindungen zu unseren
Lieferanten und Endverbrauchern weltweit und wir hoffen, diese Verbindungen
ausbauen zu k&ouml;nnen. Wir danken allen, die die unsere Bem&uuml;hungen in der
Vergangenheit, Amiga-spezifisch zu bleiben, unterst&uuml;tzt haben und bitten um
ihre weitere Mithilfe, da wir uns jetzt mit Amiga Inc. verbinden, um einen
erfolgreichen, revolution&auml;ren neuen Amiga zu liefern, der die Welt im Sturm
nehmen wird.&quot;
</P>
<P>
Software Hut, Inc. begann 1982 als kleiner Familienbetrieb spezalisiert auf
Apple-Produkte. Nach dem Erscheinen des AMIGA 1000 erkannte Software Hut
das Marktpotential dieses &uuml;berlegenen grafischen Systems und widmete seine
letzten 12 Jahre der F&ouml;rderung und dem Verkauf der Produktlinie des Amiga.
Die Beliebtheit des Amiga und seine unglaublichen grafischen Anwendungen
haben Software Hut aus seinen einfachen Anf&auml;ngen heraus zu einem der
gr&ouml;&szlig;ten Amiga-Vertriebe der Welt geformt.
</P>
<P>
Weitere Informationen zu Software Hut erfahren Sie &uuml;ber:
</P>
Randall P. Hughes, Vize-Pr&auml;sident f&uuml;r Verkauf und strategische Verbindungen<BR>
Amiga Inc.<BR>
<A HREF="mailto:randy@amiga.com">randy@amiga.com</A><BR><BR>
Joseph Muoio, Pr&auml;sident<BR>
Software Hut, Inc.<BR>
991 S. Bolmar Street Units F&amp;G<BR>
West Chester, Pa 19382<BR>
Phone: 610-701-6301<BR>
Fax: 610-701-6306<BR>
<A HREF="mailto:amiga@softhut.com">amiga@softhut.com</A>&laquo;<BR><BR>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)<BR>
<P ALIGN="RIGHT">
<A HREF="AMIGANG5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
