<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG8.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Neues zum AmigaNG
</font>
</TD></tr>
</TABLE>
<BR>
<H2>7. AMIGA und Compuquick schlie&szlig;en strategische Vertriebsvereinbarung ab</H2>
<P>
&raquo;28. Juni 2000 - AMIGA INC. UND COMPUQUICK MEDIA CENTER GEBEN
STRATEGISCHE VERTRIEBS-VEREINBARUNG BEKANNT
</P>
<P><B>Snoqualmie, Washington, USA -</B></P>
<P>
Amiga Inc. freut sich, ihre Vereinbarung mit Compuquick Media Center in
Columbus, Ohio, USA, bekannt geben zu k&ouml;nnen, dass dieses das neue AMIGA
SDK (Software Developer Kit) ebenso wie die klassischen Amiga-Produkte
vertreiben wird.
</P>
<P>
&quot;Wir sind gl&uuml;cklich, die hohe Verf&uuml;gbarkeit unserer klassischen und die
Produkte der N&auml;chsten Generation durch Compuquick gew&auml;hrleisten zu k&ouml;nnen.
Mr. Jesrani war der Gemeinschaft wohlbekannt und auch ein hoch geachtetes
Mitglied seit 1987. Es ist uns eine Ehre und ein besonderer Vorzug, dass
wir uns mit Compuquick verbinden konnten. Wir erkennen ihren weiteren
Einsatz und ihre Erfahrungen und wissen, dass die Gemeinschaft gut bedient
sein wird. Mit Ihnen zusammen begr&uuml;&szlig;en wir Compuquick in der Zukunft des
Amiga,&quot; sagte Randy Hughes, Vize-Pr&auml;sident f&uuml;r Verkauf und Strategische
Verbindungen bei Amiga Inc.
</P>
<P>
Compuquick Media Center, ein in der AMIGA-Gemeinschaft wohlbekannter Name,
freut sich sehr, in den Zukunftspl&auml;nen von Amiga Inc. eine Rolle zu
spielen. Sie erwarten einen andauernden Erfolg beim Vertrieb des neuen
AMIGA SDK ebenso wie aller weiterer Produkte, die von Amiga in Betracht
gezogen werden.
</P>
<P>
Randhir Jesrani, Pr&auml;sident von Compuquick Media Center f&uuml;gt hinzu:
&quot;Wirfreuen uns sehr, Amiga-Produkte der Gemeinschaft anbieten zu k&ouml;nnen und
erwarten, beim ihrem Wachstum mithelfen zu k&ouml;nnen. Wir haben ausgezeichnete
Verbindungen zu unseren Amiga-Freunden in der ganzen Welt und k&ouml;nnen es
kaum erwarten wieder von ihnen zu h&ouml;ren, wenn sie zum Amiga zur&uuml;ckgekehrt
sind. Einmal ein Amiga-Fan, immer ein Amiga-Fan.&quot;
</P>
<P>
Compuquick Media Center blickt auf 10 Jahre mit zufriedener Kundschaft
zur&uuml;ck und ist eine st&auml;ndige Einrichtung bei allen Amiga-Handelsmessen.
Compuquick richtet sein Augenmerk auf den Verkauf und den Service von
Amiga-Systemen, -Software und -Peripherie und ist au&szlig;erdem der f&uuml;hrende
Lieferant f&uuml;r Video-Toaster- und -Flyer-Systeme. Compuquick hat seine
Erfahrung bewiesen und ist f&uuml;hrend beim Verkauf von Amiga-Produkten an
Ausbildungseinrichtungen, an die Gruppe der grafischen K&uuml;nstler, an die
Animatoren bei Disney und die Lieferanten der Streitkr&auml;fte, um nur einige
seiner vielen Kunden zu nennen.
</P>
<P>
Weitere Informationen &uuml;ber Compuquick Media Center erhalten Sie &uuml;ber:
</P>
Randall P. Hughes<BR>
Vize-Pr&auml;sident f&uuml;r  Einkauf und Strategische Verbindungen<BR>
Amiga Inc.<BR>
<A HREF="mailto:randy@amiga.com">randy@amiga.com</A><BR><BR>
Randhir Jesrani<BR>
Pr&auml;sident<BR>
Compuquick Media Center<BR>
3758 Town and Country Road<BR>
Columbus, OH 43213<BR>
Phone/Fax: 614-235-1180<BR>
Phone: 614-235-3601<BR>
<A HREF="mailto:sales@compuquick-amigadirect.com">sales@compuquick-amigadirect.com</A><BR>
www.compuquick-amigadirect.com&laquo;<BR><BR>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.<BR>
(Quelle des Originals: AMIGA, Inc.)<BR>
<P ALIGN="RIGHT">
<A HREF="AMIGANG6.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG8.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
