<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Neuigkeiten von Innovative</H2>
<P><B>Innovative (<A HREF="http://www.innovative-web.de" TARGET="_top">http://www.innovative-web.de</A>) informiert:</B></P>
<P>
Updates zu Programmen des Herstellers:
</P>
<P>
&raquo; fxPAINT 1.5<BR>
Die neuen Features im &Uuml;berblick:
<UL>
<LI> beinhaltet alle &Auml;nderungen des EK 1 und EK 2 (alleine schon 60 neue Features)
<LI> Tutorien (Video &amp; HTML) auf der CD
<LI> stark verbessertes fxALBUM mit Pr&auml;sentations- und professionellen HTML-&Uuml;bersichtfunktionen
<LI> verbesserte Palette mit HTML-Farbcode-Export und &quot;Colorchooser&quot;
<LI> ARexx-Launcher
<LI> Effekt zum Reduzieren oder Entfernen von JPEG Frakturen
<LI> Digitalkamera-Unterst&uuml;tzung
<LI> viele kleinere Detailverbesserungen
</UL>
</P>
<P>
VHI Studio 5.2
Neu ist hier vor allem der beschleunigte MPEG-Export und die M&ouml;glichkeit,
nun wahlweise MPEG-1 oder MPEG-2-Dateien zu erzeugen.
</P>
<P>
fxSCAN 2.0
Neue Effekte (u.a Scharfzeichnen und qualitativ hochwertige
Skalierungsroutine wie von fxPAINT bekannt), eine direkte Anbindung an
fxPAINT und Bugfixes kennzeichnen dieses Update.&laquo;
</P>
<P>
&raquo;Gef&uuml;hrte Tour f&uuml;r fxPAINT online
Ab sofort k&ouml;nnen Sie auf der fxPAINT-Homepage eine gef&uuml;hrte Tour machen!&laquo;
</P>
<P>
&raquo;Innovative bringt Digita(TM)-power auf den AMIGA!
Innovative hat einen Treiber f&uuml;r Digitalkameras entwickelt, die mit dem
Digita(TM) Operating Environment laufen. &quot;Digita(TM)-enabled&quot;
Digitalkameras leisten weit mehr als alles andere, was es derzeit auf dem
Markt gibt. Nicht nur, dass Digita(TM) auf den Kameras mehrerer Hersteller
zum Einsatz kommt, sondern auch, dass diese Kameras mit Coldfire- oder
PowerPC-Prozessoren laufen und es erm&ouml;glichen, Skripte, Programme und
Spiele (incl. MAME!!) laufen zu lassen, macht diese Kameras besonders
interessant. Der Hersteller von Digita(TM), Flashpoint(TM)
(<A HREF="http://www.flashpoint.com/" TARGET="_top">http://www.flashpoint.com/</A>) hat es sich zum Ziel gesetzt, Digita(TM) zu
dem Standard f&uuml;r Digitalkameras zu machen und setzt daher auch auf ein
standardisiertes Kommunkations-Protokoll zwischen Computer und Kamera. Mit
dem nun verf&uuml;gbaren VHI-Treiber bekommen auch AMIGA-User endlich Zugang zu
diesen faszinierenden Kameras und k&ouml;nnen mit VHI Studio geschossene Bilder
komfortabel herunterladen und weiterverarbeiten. Derzeit verf&uuml;gbare
&quot;Digita(TM)-enabled&quot; Digitalkameras sind
</P>
<UL>
<LI> Kodak DC 220, DC 260, DC 265, DC 290
</LI>
<BR><LI> Minolta Dimage 1500 EX, Dimage 1500 3D
</LI>
<BR><LI> HP PhotoSmart C500, C619, C912
</LI>
<BR><LI> Pentax EI-200, EI-2000
</LI>
</UL>
<P>
P.S.: Digita(TM) hat in diesem Falle nichts mit den Wordworth-Entwicklern
zu tun, sondern ist eine Produktbezeichnung f&uuml;r ein Produkt von
Flashpoint(TM).
</P>
<P>
Neue Kauf- und Verkaufsb&ouml;rse f&uuml;r VHI-Karten und -Digitalkameras
Auf vielfache Nachfrage haben wir uns nun dazu entschlossen, ein Forum f&uuml;r
den An- und Verkauf von VHI-Karten und Digitalkameras zu schaffen. Dieses
ist auf der VHI Studio-Homepage unter Support zu erreichen. Dort findet
sich nun auch wieder das beliebte VHI-Forum.
</P>
<P>
Neuer fxPAINT-Workshop online
Und wieder ist ein neuer Workshop online. Diesmal dreht sich alles um die
Bildkomposition und die Benutzung des Zauberstabes. Ein Muss f&uuml;r alle
fxPAINT-Besitzer! Der Workshop findet sich von der fxPAINT-Seite aus im
Bereich &quot;Support&quot;.
</P>
<P>
VHI-Beispieltreiber-Sourcecode online
Der VHI-Standard wurde erst k&uuml;rzlich um die Unterst&uuml;tzung f&uuml;r
Digitalkameras erweitert und bereits jetzt sind drei Treiber verf&uuml;gbar. Die
Erweiterungen zum VHI-Standard sind bisher noch nicht dokumentiert und
deshalb bieten wir nun den kompletten Sourcecode zum CamEx-Treiber zum
Download an, um die Entwicklung weiterer Treiber zu f&ouml;rdern. Der Sourcecode
l&auml;&szlig;t sich auch problemlos als Ausgangspunkt f&uuml;r die Entwicklung von
Treibern f&uuml;r Videokarten benutzen.
</P>
<P>
VHI Studio 5.2 verf&uuml;gbar
Da vor der World of Alternatives leider keine Zeit mehr war, ist das neue
Archiv erst jetzt verf&uuml;gbar. Die neue Version bietet vor allem schnelleres
MPEG-Encoding sowie Unterst&uuml;tzung f&uuml;r MPEG 2.
</P>
<P>
Franz&ouml;sische &Uuml;bersetzung von fxPAINT
Réléc Hard- &amp; Software haben eine vollst&auml;ndige &Uuml;bersetzung der fxPAINT-
Kataloge und einem Teil unserer Homepage-Seiten ins Franz&ouml;sische
vorgenommen. Wenn Sie also eine franz&ouml;sische GUI vorziehen oder unsere
Produktinformationen auf Franz&ouml;sisch abrufen wollen, schauen Sie auch
einmal auf der Website von Réléc vorbei.
</P>
<P>
--<BR>
Innovative<BR>
c/o Felix Schwarz<BR>
Am Gr&uuml;ndla 3<BR>
D-91074 Herzogenaurach<BR>
Germany<BR>
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">EMail:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:info@innovative-web.de">info@innovative-web.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">WWW:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.innovative-web.de/" TARGET="_top">http://www.innovative-web.de/</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Phone:&nbsp;</TD><TD VALIGN="TOP">+(0)049 (0)9132/3400&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Fax:&nbsp;</TD><TD VALIGN="TOP">+(0)049 (0)69/791247970&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses7.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
