<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses8.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>9. Kurzmeldungen</H2>
<UL>
<LI> Zun&auml;chst eine Anfrage in eigener Sache: Hat jemand Interesse, die Rubrik
  &raquo;Kurzmeldungen&laquo; zu betreuen und vom Umfang her auszuweiten? Meldet euch
  bitte bei <A HREF="mailto:aakt@gmx.de.">aakt@gmx.de.</A>
</LI>
<BR><LI> Vor wenigen Tagen ist die neue Version 3.5 des Chat-Programms AmIRC
  erschienen. Seit v3.4 wurde laut VaporWare vor allem die
  Prozessorbelastung deutlich gesenkt, desweiteren gibt es kleinere
  Verbesserungen und Bugfixes. Download ist auf <A HREF="http://www.vapor.com" TARGET="_top">http://www.vapor.com</A>
  m&ouml;glich.
</LI>
<BR><LI> Ebenfalls bei VaporWare ver&ouml;ffentlicht worden ist die neue Version 2.4
  des Telnet-Clients AmTelnet. Insbesondere die Output-Geschwindigkeit beim
  Scrollen gro&szlig;er Mengen von Text soll deutlich gestiegen sein.
  Herunterladen l&auml;sst sich das Update auf <A HREF="http://www.vapor.com" TARGET="_top">http://www.vapor.com</A>.
</LI>
<BR><LI> Auf <A HREF="http://www.yam.ch" TARGET="_top">http://www.yam.ch</A> l&auml;sst sich jetzt die beliebte E-Mail-Software YAM
  in der neuen Version 2.1 herunterladen. Es handelt sich allerdings nur um
  ein kleineres Update. Neben einer Vielzahl von Bugfixes wurden aber auch
  neue Features implementiert.
</LI>
<BR><LI> Schon wieder gibt es eine neue Betaversion des bekannten FTP-Clients
  AmiTradeCenter. Der Download ist auf der ATC-Homepage
  (<A HREF="http://amitradecenter.net" TARGET="_top">http://amitradecenter.net</A>) m&ouml;glich.
</LI>
<BR><LI> Auf <A HREF="http://www.paulnolan.com/Amiga/download.html" TARGET="_top">http://www.paulnolan.com/Amiga/download.html</A> l&auml;sst sich v4.5 Release
  83a der Bildbearbeitungssoftware Photogenics herunterladen. Achtung:
  Momentan wird noch kein AGA unterst&uuml;tzt, in K&uuml;rze soll aber ein
  entsprechender Fix erscheinen.
</LI>
<BR><LI> Der Soundeditor SoundFX ist in der Version 4.00 erschienen. N&auml;here
  Informationen zu den Verbesserungen und Erwerbsm&ouml;glichkeiten der Software
  sind auf <A HREF="http://www.imn.htwk-leipzig.de/~kost/soundfx.html" TARGET="_top">http://www.imn.htwk-leipzig.de/~kost/soundfx.html</A> zu finden.
</LI>
<BR><LI> Bei Schatztruhe l&auml;sst sich nun ein Update zu der Piktogramm-Sammlung
  GlowIcons Collection herunterladen, das 200 neue Icons beinhaltet und als
  Vorschau auf eine m&ouml;glicherweise geplante n&auml;chste Ausgabe der GlowIcons
  Collection angesehen werden kann. Download ist mit
  <A HREF="http://www.schatztruhe.de/files/GlowIcons_Update.lha" TARGET="_top">http://www.schatztruhe.de/files/GlowIcons_Update.lha</A> m&ouml;glich.
</LI>
<BR><LI> Von CDWriter, einer neuen Shareware-CD-Brenner-Software, ist eine erste
  &ouml;ffentliche Betaversion erschienen. Download ist &uuml;ber
  die URL <A HREF="http://www.students.cs.uu.nl/~wmestrom/files/CDWriter.lha" TARGET="_top">http://www.students.cs.uu.nl/~wmestrom/files/CDWriter.lha</A>
  m&ouml;glich.
</LI>
<BR><LI> Thomas Dellert, Gesch&auml;ftsf&uuml;hrer des Oberhausener Hardwareherstellers DCE,
  hat bekannt gegeben, dass das Unternehmen seit dem 1. Juli keine Amiga-
  Reparaturen mehr durchf&uuml;hrt. Telefonischer Support entf&auml;llt ebenfalls.
  DCE wolle sich vollst&auml;ndig auf die Produktion konzentrieren, hie&szlig; es zur
  Begr&uuml;ndung. Nicht davon betroffen sind Produkte von DCE und Phase 5,
  diese werden weiterhin repariert.
</LI>
<BR><LI> Der britische Amiga-Zubeh&ouml;ranbieter Eyetech hat mit Eye-Play einen
  Gesch&auml;ftszweig gegr&uuml;ndet, der sich der Ver&ouml;ffentlichung und Distribution
  von Spielen f&uuml;r AmigaNG und Amiga Classic widmet. Die zugeh&ouml;rige Homepage
  (<A HREF="http://www.eye-play.com" TARGET="_top">http://www.eye-play.com</A>) ist bereits online. Unter
  <A HREF="http://www.eyetech.co.uk/eyeplay/news.html" TARGET="_top">http://www.eyetech.co.uk/eyeplay/news.html</A> sind weitere Informationen zu
  dem Angebot nachzulesen.
</LI>
<BR><LI> Rainer Benda (<A HREF="mailto:Rainer_Benda@Dell.com">Rainer_Benda@Dell.com</A>) schreibt: &raquo;Gesucht ist ein
  Nachfolger, der Interesse hat das Ladengesch&auml;ft in R&uuml;sselsheim zu
  &uuml;bernehmen (Verkauf). Sollte in den n&auml;chsten 2-3 Monaten kein Interessent
  gefunden werden, wird das Gesch&auml;ft geschlossen.&laquo;
</LI>
<BR><LI> Martin Merz schreibt: &raquo;MI News: AppMI
<P>
  AppMI ist eine gro&szlig;e Sammlung von Images f&uuml;r Toolbars im GlowIcons
  Design, die vielleicht ein Standart f&uuml;r das ClassicAmiga System werden
  k&ouml;nnte.
</P>
<P>
  Die Sammlung ist frei erh&auml;ltlich f&uuml;r Programmierer und alle
  Interessierten, aber um das Archiv zu erhalten ist eine Registrierung
  n&ouml;tig und jeder, der ein Produkt, das AppMI benutzt, ver&ouml;ffentlicht,
  sollte mir eine Kopie der Vollversion des Programms zukommen lassen.
</P>
<P>
  Aus diesem Grund erhalten nur registrierte Benutzer das Archiv.
</P>
<P>
  Die Registrierungsseite f&uuml;r AppMI ist jetzt online und die
  Ver&ouml;ffentlichung ist f&uuml;r Ende Juli 2000 geplant.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Autor:&nbsp;</TD><TD VALIGN="TOP">Martin &quot;Mason&quot; Merz&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">E-Mail:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:mason.home@t-online.de">mason.home@t-online.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Homepage:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://home.t-online.de/home/mason.home/homepage.htm" TARGET="_top">http://home.t-online.de/home/mason.home/homepage.htm</A>&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Schluss.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
