<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Beim letzten Gewinnspiel haben 45 Leser mitgemacht, dies ist
erfreulicherweise eine deutliche Steigerung im Vergleich zum Vormonat.
Bitte denkt auch diesmal wieder an die Teilnahme. Ihr wisst ja, dass man
auch schon mit zwei Antworten gewinnen kann.
</P>
<P><B>Jetzt aber zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">In diesen Tagen liefert AMIGA ein neues Produkt aus. Worum&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">handelt es sich?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: Gesucht war die AmigaNG-Entwicklungsumgebung, das Amiga SDK.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Das neue Amiga-Betriebssystem wird sich wahlweise stand-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">alone, oder &quot;gehosted&quot; unter einem anderen OS nutzen lassen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Nenne drei Betriebssysteme, die von AMIGA unterst&uuml;tzt werden.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Hier waren mehrere Antwortkombinationen m&ouml;glich, beispielsweise&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Linux, Windows 95 und Windows NT.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wie beurteilst du die von AMIGA in den letzten sechs Monaten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">geleistete Arbeit?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Die Auswertung:</B></P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Sehr positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">16&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Eher positiv.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">29&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Eher negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Sehr negativ.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Christian Rosentreter ist im Gro&szlig;en und Ganzen einverstanden: &raquo;Das
Erscheinen des SDK ist immerhin ein Lichtblick am Ende des Tunnels. Obwohl
ich eine Weiterentwicklung des &quot;Classic&quot;-AmigaOS, z.B. komplette native
PPC-Portierung (von Amiga selbst) bevorzugt h&auml;tte.
</P>
<P>
Ich hoffe nur, dass bei diesen ganzen - doch zu begr&uuml;&szlig;enden - Entwicklungen
das Feeling des aktuellen AmigaOS nicht verloren geht. Die ElateOS-
Pr&auml;sentation auf 3sat hat mich diesbzgl. noch nicht &uuml;berzeugt. Und
abgesehen von der Software sollte man nicht vergessen, dass auch die
Hardware den Amiga ausmacht(e). So geh&ouml;rt in einen Amiga eine Motorola-CPU.
Meine Meinung! :)&laquo;
</P>
<P>
Klaus Moddemann ist ebenfalls zufrieden, h&auml;tte sich aber durchaus mehr
Ergebnisse vorstellen k&ouml;nnen: &raquo;Ich finde Amiga hat in den letzten sechs
Monaten gute Arbeit geleistet, doch in dieser Zeit h&auml;tte ich eigentlich
etwas mehr erwartet als nur ein SDK, welches nun erscheint. Naja,
wenigstens kommt schon mehr als nur ein paar Designstudien und
Ank&uuml;ndigungen, was f&uuml;r mich bedeutet, es wird an wichtigeren Dingen
gearbeitet als an Nebens&auml;chlichkeiten, wie z.B. dem Aussehen eines neuen
Systems.&laquo;
</P>
<P>
Christian Britz ist sich nicht ganz sicher: &raquo;Es ist sehr schwierig, die
Arbeit von Amiga, Inc. zu beurteilen, tolle Versprechen haben die Vorg&auml;nger
auch gemacht. Aber die j&uuml;ngsten Neuigkeiten klingen doch recht positiv!&laquo;
</P>
<P>
&Auml;hnlich &auml;u&szlig;ert sich auch Michael Seibt: &raquo;Ich wei&szlig; nicht, was ich von AMIGAs
Ank&uuml;ndigungen halten soll. Das letzte Executive Update las sich wie von
Collas gemei&szlig;elt. [Kein Wunder - die damaligen Executive Updates von Jim
Collas stammten aus Bill McEwens Feder; Anm. d. Red.] Ich f&uuml;r meinen Teil
glaube dem Geschreibsel von Billi-Boy nicht, erst wenn etwas Greifbares auf
dem Markt ist, fang ich wieder an, an die Zukunft des Ami's zu glauben.&laquo;
</P>
<P>
Thomas Mitzschke sieht die Zukunft optimistisch: &raquo;Ich glaube, es geht
wieder bergauf, und die M&ouml;glichkeiten, sich sein Rechnersystem aussuchen zu
k&ouml;nnen, kann man nur begr&uuml;&szlig;en. Je besser die Umsetzung auf den
verschiedenen Systemen vollzogen wird, um so schneller werden wir auch
wieder neue Software auf unseren Rechnern nutzen k&ouml;nnen.&laquo;
</P>
<P>
Andreas Wolf will eines loswerden: &raquo;Ich vermisse immer noch ein PPC-
AmigaOS!&laquo;
</P>
<P>
Fritz Trampnau reagiert zur&uuml;ckhaltend: &raquo;&quot;Was&quot; am &quot;Ende&quot;, wenn die neuen
AMIGAs da sind, tats&auml;chlich sein wird - lassen wir uns &uuml;berraschen. Die
Hardware ist bei mir auf jeden Fall schon mal vorhanden (Blizzard PPC
603e+); wenn's nicht reicht, muss halt 'ne &quot;Dosenkiste&quot; her (Schauder),
entweder mit AMD (nochmals Schauder), oder gar mit &quot;Wintel-Prozi (doppelt
Schauder!) - also schau'n 'mer 'mal - wie's kommt, wie's ausgeht!&laquo;
</P>
<P>
Axel Knabe kritisiert die Abwicklung der SDK-Pr&auml;sentation auf der &raquo;World of
Alternatives&laquo;: &raquo;Ich finde es gut, dass sich &uuml;berhaupt noch etwas tut. Nicht
richtig finde ich, da&szlig; die Vorstellungen in Neuss von Bill nur einem
kleinem Kreis von Leuten gezeigt wurde. Ich finde, alle geht es was an. Und
man h&auml;tte es auf einer gro&szlig;en Leinwand allen Besuchern zeigen sollen. So
kommt man sich &raquo;verarscht&laquo; vor. Man war auf der Messe - hat nichts
gesehen - man kommt nach Hause und liest im Internet, dass es eine
Vorf&uuml;hrung gab..., schade. Hier sollte AMIGA wissen, dass es wichtig ist,
jede Neuigkeit allen zu zu zeigen!&laquo;
</P>
<P>
Martin Steigerwald ist sich nicht ganz schl&uuml;ssig: &raquo;Es ist ein wenig
schwierig zu beurteilen. F&uuml;r mich ist das eher ein auf und ab... manchmal
h&ouml;re ich gute News, dann aber auch mal wieder etwas, was mir als nicht so
gut erscheint. Ich denke, es kommt jetzt stark darauf an, was Amiga, Inc.
f&uuml;r das AmigaSDK an Updates nachliefert und welche Pressreleases anderer
Firmen auftauchen.&laquo;
</P>
<P>
Martin Cornelius betrachtet die geleistete Arbeit als sehr positiv: &raquo;Es
scheint diesmal wirklich etwas zu kommen. Die Idee, die dahinter steckt,
ist hervorragend. Auf der Messe in Neuss konnte man sich, sofern man den
Vortrag von Bill McEwen mitbekommen hat, davon &uuml;berzeugen. Diesmal wurde
nicht, wie schon zu oft, etwas angek&uuml;ndigt, was dann wieder gecancelt
wurde, sondern das gezeigt, was fertig ist. Der Weg ist m.E. richtig.
Bleibt zu hoffen, dass damit die potentiellen Kunden erreicht werden, um
Amiga wieder in &quot;aller Munde&quot; zu bringen. Es ist wohl die wirklich
allerletzte Chance.&laquo;
</P>
<P>
Ein weiterer Martin, mit Nachnamen Henke, ist ebenfalls zuversichtlich:
&raquo;Ich denke, AMIGA ist auf dem richtigen Weg. Der Plan, das neue AmigaOS
hardwareunabh&auml;ngig zu machen, ist die einzige Chance, um Windows vom Markt
zu fegen, falls das &uuml;berhaupt m&ouml;glich ist. Aber AMIGA darf nicht vergessen,
eine gute Marketingabteilung aufzubauen, denn mit gutem Marketing l&auml;sst
sich beinahe alles verkaufen (wie es Microsoft mit Windows geschafft hat).
AMIGA, viel Gl&uuml;ck!&laquo;
</P>
<P>
Christian Aichinger betrachtet die Lage von der wirtschaftlichen Seite:
&raquo;F&uuml;r Amiga war die geleistete Arbeit sehr gut. Neue Partner gefunden, SDK
zusammengestellt, eine neue Mannschaft auf die Beine gestellt, neue
Alianzen gekn&uuml;pft. Was will man als Startup-Unternehmen in 6 Monaten noch
schaffen? Sofort die dicke Knete einfahren ist in diesem Gesch&auml;ft sehr
unwahrscheinlich.&laquo;
</P>
<P>
&Auml;hnlich sieht es auch Gernod Schomberg: &raquo;Es musste eine neue Firma
einschlie&szlig;lich kaufm&auml;nnischer und Personal-Verwaltung aufgebaut werden,
auch wenn bei Amino m&ouml;glicherweise Grundstrukturen schon vorhanden waren.
Die sicher schon vorher vorhandenen Kontakte zu Partnern und Kunden mussten
auf eine gesch&auml;ftsm&auml;&szlig;ige Basis gestellt werden. Ein handelbares Produkt
(nicht etwas, was ein paar tausend Amiga-Besitzer kaufen, sondern was im
Computerbereich gefragt ist) musste spezifiziert und die Entwicklung in
Gang gebracht werden.
</P>
<P>
Das ist mit soviel Kleinarbeit verbunden, dass es wirklich erstaunlich ist,
jetzt schon mit einer Ware auf den Markt zu kommen.
</P>
<P>
Sicher wird es Kritikpunkte geben, die ersten (gekoppeltes Soft/Hardware-
Paket, eigene Hardware) wurden von Amiga sofort &uuml;berwunden.
</P>
<P>
Und auch die Schnelligkeit, mit der der ungl&uuml;ckliche Fehler, die Amiga-
World-Ausgabe vom Mai auf der Amiga-Website mit Windows-spezifischen
Befehlen auszustatten, die nicht von den bei Amiga &uuml;blichen Browsern
vollst&auml;ndig dekodiert werden k&ouml;nnen, ausgemerzt wurde, spricht f&uuml;r die
Mannschaft.
</P>
<P>
Alles in allem, ich erwarte noch viel Gutes!&laquo;
</P>
<P>
Markus Castro meint nur: &raquo;Bisschen seltsame Entscheidungen, aber zum ersten
Mal etwas.&laquo;
</P>
<P>
Fazit: Das Ergebnis ist eindeutig - alle Einsender sehen die seit Anfang
des Jahres von AMIGA geleistete Arbeit positiv, mehr als ein Drittel davon
ist sogar au&szlig;erordentlich zufrieden.
</P>
<P>
Wir werden diese Frage von Zeit zu Zeit immer wieder stellen, um m&ouml;gliche
&Auml;nderungen bei der Zufriedenheit mit der AMIGA-F&Uuml;hrung zu ermitteln.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;AFiloFaxPro&quot;: Michael Seibt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Future Drive Accelerator&quot;: Marc Gutzwiller&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x sechs Amiga-CD-ROMs: Oliver Hummel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
