<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P><B>Hallo, liebe Leser!</B></P>
<P>
Vor euch liegt der Spieleteil des Monats Juli 2000. Wenn man bedenkt, dass
jetzt eigentlich das gro&szlig;e Sommerloch beginnen sollte, verlief dieser
Monat doch relativ aufregend. Zuerst der gro&szlig;e Skandal um Alive Mediasoft,
dann Amiga-Ver&ouml;ffentlichung des PC-Knallers Heretic II sowie
Ver&ouml;ffentlichungen von Apano Sin, Foundation Gold und Foundation - The
Undiscovered Land. Um so mehr tut es mir leid, dass es von diesen Spielen
in dieser Ausgabe kein einziges im Test zu lesen gibt. Dabei war ein Test
zu Heretic II eigentlich 100%ig sicher. Ich werde mich aber diesen Monat
intensiv um Testexemplare bem&uuml;hen, um euch im August mit einigen Tests
bereichern zu k&ouml;nnen. Allerdings sind solche Versuche meinerseits schon
oft gescheitert (aber nicht an mir!). Wir werden sehen.
</P>
<P>
Nun folgen erstmal traurige Nachrichten: Andreas Koch hat nicht mehr
gen&uuml;gend Zeit bzw. Spiele, sich um die Mac-Ecke zu k&uuml;mmern. Wenn sich hier
kein freiwilliger Redakteur findet, muss die Mac-Ecke k&uuml;nftig eingestellt
werden. Gleiches gilt f&uuml;r die Rubrik &quot;PD-Tests aus dem Aminet&quot;. Auch Heiko
Garrelts mangelt es zunehmend an Zeit, um PD-Spiele aus dem Aminet f&uuml;r
euch zu testen. M&ouml;glicherweise wurde aber schon jemand gefunden, der diese
Rubrik weiterf&uuml;hrt.
</P>
<P>
In dieser Ausgabe gibt es also nichts spektakul&auml;res. Daf&uuml;r aber einiges an
Neuigkeiten und immerhin zwei Previews von den Spielen Joyride und
Silencer. Auch ein Blick in die Release-Liste d&uuml;rfte sich diesen Monat
lohnen, da dort nach der Alive Mediasoft-Pleite erstmal kr&auml;ftig aufger&auml;umt
wurde.
</P>
<P>
So, jetzt w&uuml;nsche ich euch viel Spa&szlig; mit dem Spieleteil und einen sch&ouml;nen
Urlaub, falls dieser denn angetreten wird. Ich pers&ouml;nlich werde die zweite
Juliwoche komplett abwesend sein (das sollte euch aber nicht abhalten,
Feedback zum Spieleteil abzugeben!).
</P>
<P><B>Viel Spa&szlig;!</B></P>
<P><B>Euer</B></P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
