<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Previews</H2>
<H3>Silencer</H3>
<P>
Diesen Monat ist eine - man mag es kaum glauben - hochinteressante
Demoversion eines neuen Spieles namens Silencer erschienen. Leider
kann man in der Demoversion nur ein bi&szlig;chen herumlaufen, nicht
irgendwelche Handlungen ausf&uuml;hren. Aber wie das jugoslawische
Entwicklungsteam mitteilte, handelt es sich bei der Demo nur um
eine Pr&auml;sentation der Spielengine. Ich w&uuml;rde es anders formulieren:
Um eine Pr&auml;sentation der Spielgrafik - und die ist wirklich
beeindruckend. Gerenderte Spielgrafiken in voller Farbenpracht,
das sieht einfach beeindruckend aus. Um so mehr erfreut es, wenn
man in der ReadMe-Datei liest, dass die Vollversion PowerPC, AHI
und auch Grafikkarten unterst&uuml;tzen soll. Das Entwicklungsteam
ist au&szlig;erdem auf der Suche nach einem Ver&ouml;ffentlicher des fertigen
Spiels; dieser wird sich aber bald gefunden haben, da bin ich mir
sicher. Wer sich die Demoversion anschauen m&ouml;chte, kann sie sich
unter <A HREF="http://afrodita.rcub.bg.ac.yu/~afront/SILENCER.lha" TARGET="_top">http://afrodita.rcub.bg.ac.yu/~afront/SILENCER.lha</A> herunterladen.
F&uuml;r alle anderen gibt es noch ein paar Screenshots mit dieser
AMIGA aktuell Ausgabe. Wenn das Entwicklungsteam das h&auml;lt, was
es mit der Demoversion verspricht, sehe ich in Silencer schon
einen echten Hit.
</P>
<P>
<A HREF="img/Silencer1.jpg"><IMG SRC="thumb/Silencer1.jpg" WIDTH="120" HEIGHT="48" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Silencer2.jpg"><IMG SRC="thumb/Silencer2.jpg" WIDTH="120" HEIGHT="48" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Silencer3.jpg"><IMG SRC="thumb/Silencer3.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<H3>Joyride</H3>
<P>
Seit langem wurde mal wieder eine Demoversion eines 3D-Autorennens
ver&ouml;ffentlicht. Bei Joyride handelt es sich um ein 3D-Autorennen,
in dem alle Grafiken fein s&auml;uberlich gerendet wurden und auch
dementsprechend gut aussehen. In der Demoversion kann man noch nicht
viele Optionen einstellen, aber schon mal den Landkurs kr&auml;ftig
auf Probe fahren. Diese endg&uuml;ltige Demoversion von Joyride macht
technisch schon einen recht perfekten Eindruck, auch wenn man
sich an die Steuerung erst gew&ouml;hnen muss. Grafisch sieht Joyride
auch gut aus und l&auml;uft auf meinem 68040 mit AGA sehr fl&uuml;ssig.
Die Sounds passen ebenfalls zum Spielgeschehen. Die Demoversion
gibt es in zwei verschiedenen Archiven: Einmal eine AGA-Version
und einmal die Grafikkarten-Version. Mittlerweile ist die Demoversion
auch im Aminet erh&auml;ltich (allerdings mit rund 3.5MB recht umfangreich).
Abschlie&szlig;end macht die endg&uuml;ltige Joyride-Demoversion einen
recht passablen Eindruck und das Spiel k&ouml;nnte in der guten
Mittelklasse Platz einnehmen.
</P>
<P>
<A HREF="img/Joyride1.jpg"><IMG SRC="thumb/Joyride1.jpg" WIDTH="116" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Joyride2.jpg"><IMG SRC="thumb/Joyride2.jpg" WIDTH="120" HEIGHT="94" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Joyride3.jpg"><IMG SRC="thumb/Joyride3.jpg" WIDTH="116" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
