<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Alive Mediasoft
</LI>
</UL>
<P>
Diesen Monat gab es endlich Reaktionen auf die beinahe grosteken
Vorw&uuml;rfe, die sich Alive Mediasoft anh&ouml;ren musste. Leider nahm
Steven Flowers von Alive Mediasoft keinerlei Stellung zu den
Raubkopien-Vorw&uuml;rfen, sondern gab nur bekannt, dass Alive Mediasoft
keine Spiele mehr anbieten und sein Vertriebsgesch&auml;ft schlie&szlig;en w&uuml;rde.
F&uuml;r mich ist das allerdings ein definitives Schuldeingest&auml;ndniss.
Desweiteren wurden diesen Monat dann noch Gegen&uuml;berstellungsfotos
von Original und Raubkopie, die durch Alive Mediasoft vertrieben
wurde, ver&ouml;ffentlicht. Au&szlig;erdem meldeten einige Personen, darunter
Alfred Kn&ouml;tig und Dietmar Eilert (GoldED), dass Alive Mediasoft
&quot;unlizenzierte Kopien&quot;, also Raubkopien, vertreibe. Der Skandal
ist also perfekt und Alive Mediasoft schlie&szlig;t einfach sein
Gesch&auml;ft, scheinbar ohne jegliche Konsequenzen.
</P>
<UL>
<LI> Elite 3
</LI>
</UL>
<P>
Da durch den R&uuml;ckzug von Alive Mediasoft auch praktisch alle
Projekte dieser Firma gestorben sind, zu denen auch Elite 3
geh&ouml;rte, soll dieses nun von einer dritten Firma weiter
umgesetzt werden. Deshalb bleibt auch Elite 3 als einziges
Ex-Alive Mediasoft Spiel in der Release-Liste bestehen, w&auml;hrend
alle anderen mit &quot;eingestellt&quot; versehen wurden.
</P>
<UL>
<LI> Hyperion Software
</LI>
</UL>
<P>
Diesen Monat passierte endlich das, worauf Amiga-Benutzer mit
Highend-Rechnern monatelang warteten: Heretic II wurde auf der
World of Alternatives-Messe in Neuss ver&ouml;ffentlicht. Leider kann
ich euch in dieser Ausgabe keinen Test pr&auml;sentieren, da ich
&uuml;ber keine PowerPC-Karte verf&uuml;ge. Es hatten sich auch zwei User
gemeldet, die bereit waren, das Spiel f&uuml;r AMIGA aktuell zu testen,
leider ist daraus nichts geworden. Etwa 3 Wochen nach der Messe
wurde dann von Hyperion Software bekanntgegeben, dass erst
l&auml;cherliche 400 Exemplare von Heretic II verkauft wurden und
dass, wenn sich diese Zahl nicht gewaltig &auml;ndere, alle anderen
Amiga-Spiele eingestellt werden m&uuml;sse. Hier kann man nur hoffen,
dass noch viel mehr Spiele verkauft werden, damit Hyperion noch
andere hoch qualitative Spiele f&uuml;r den Amiga portieren kann.
Die Entwicklung von Shogo geht desweilen gut voran und man kann
auf der Hyperion Software Homepage einen neuen Status-Report
einsehen. Au&szlig;erdem &uuml;berlegt man bei der Firma noch, ob es sich
&uuml;berhaupt lohnt, von Shogo eine AGA-Version anzufertigen oder
ob es nur auf Grafikkarten laufen soll. Desweiteren hat Hyperion
die Umsetzung von Soldier of Fortune, welches auf einer
ver&auml;nderten Quake2-Engine basiert, f&uuml;r Amiga und Macintosh
angek&uuml;ndigt.
</P>
<UL>
<LI> Codename Hellsquad ist fertig
</LI>
</UL>
<P>
Digital Dreams Entertainment hat bekanntgegeben, dass das
Actionspiel Codename Hellsquad fertiggestellt ist. Das Spiel
sollte demnach bald im Handler erh&auml;ltlich sein. Eine Demoversion
wurde schon in einer vergangenen AMIGA aktuell vorgestellt
und l&auml;sst sich von der Digital Dreams Entertainment Webseite
laden.
</P>
<UL>
<LI> Silencer
</LI>
</UL>
<P>
<A HREF="img/Silencer1.jpg"><IMG SRC="thumb/Silencer1.jpg" WIDTH="120" HEIGHT="48" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Silencer2.jpg"><IMG SRC="thumb/Silencer2.jpg" WIDTH="120" HEIGHT="48" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Silencer3.jpg"><IMG SRC="thumb/Silencer3.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Eine Demoversion mit beeindruckender Grafik von Silencer wurde
diesen Monat ver&ouml;ffentlicht. Auch wenn die Demoversion blo&szlig; eine
kleine Demo der Spielengine darstellt, habe ich sie trotzdem
vorgestellt, da Silencer ein ganz gro&szlig;er Hit werden k&ouml;nnte.
</P>
<UL>
<LI> Epic Marketing
</LI>
</UL>
<P>
Epic Marketing hat diesen Monat bekanntgegeben, dass die
erweiterte Foundation-Version Foundation Gold jetzt lieferbar
ist. Foundation Gold ist ein Mix aus dem alten Foundation
und dem Addon The Undiscovered Land. Allerdings wurde
das Spiel nochmals gr&uuml;ndlich &uuml;berarbeitet (inkl. alle Grafiken)
und es wurde auch ein neuer Spielmodus hinzugef&uuml;gt, in dem
der Computer wesentlich intelligenter handelt. Auch Foundation
The Undiscovered Land ist nun separat erh&auml;ltlich. Interessant
ist, dass beide Spiele auch bei Weltbild erh&auml;ltlich sind.
Desweiteren hat Epic Marketing ein neues Spiel namens Earth
2140 angek&uuml;ndigt, welches ein Echtzeit-Strategiespiel ist
und schon bald erh&auml;ltlich sein soll.
</P>
<UL>
<LI> Joyride endg&uuml;ltige Demoversion erschienen
</LI>
</UL>
<P>
<A HREF="img/Joyride1.jpg"><IMG SRC="thumb/Joyride1.jpg" WIDTH="116" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Joyride2.jpg"><IMG SRC="thumb/Joyride2.jpg" WIDTH="120" HEIGHT="94" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Joyride3.jpg"><IMG SRC="thumb/Joyride3.jpg" WIDTH="116" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Bei Titan Computer ist anfang des Monats die endg&uuml;ltige
Demoversion des Autorennens Joyride erschienen. Allerdings
wurden die Joyride-Seiten (inkl. der Demoversion) auf dem
Titan-Server vom Netz genommen. Warum dies geschah, ist
noch unklar. Alle anderen Supportseiten von Titan-Produkten
sind noch online. Ein Preview zu Joyride k&ouml;nnt ihr aber
trotzdem in dieser Ausgabe lesen.
</P>
<UL>
<LI> Apano Sin erschienen
</LI>
</UL>
<P>
Bei Alf's Corner ist diesen Monat das Shoot'em'Up Apano
Sin erschienen. Im Spiel gilt es 6 Welten von b&ouml;sen Aliens zu
s&auml;ubern, um danach auf dem Hauptplaneten Apano Sin zu landen,
auf dem es zum Endkampf kommen soll. Das Spiel ist ab sofort
bei allen H&auml;ndlern erh&auml;ltlich und kann auch online unter
<A HREF="http://www.alfs-corner.de/" TARGET="_top">http://www.alfs-corner.de/</A> bestellt werden.
</P>
<UL>
<LI> Crystal Software startet Offensive
</LI>
</UL>
<P>
Mit 1000 britischen Pfund als Vorauszahlung (das sind etwa
3200 Mark) will Crystal Software Spiele-Entwickler anlocken.
Wer vor dem 31. August 2000 ein fertiges Spiel oder auch
eine Demoversion an Crystal Software schickt, hat die Chance
einen Vertrag sowie 1000 Pfund als Vorauszahlung zu erhalten.
In jedem Fall erh&auml;lt jeder angenommene Teilnehmer einen
Vertrag sowie 100 Pfund als Anerkennung.
</P>
<UL>
<LI> Crossfire II kommt voran
</LI>
</UL>
<P>
Bei Dreamworlds Development gab es Zuwachs: Ein neuer Grafiker
unterst&uuml;tzt jetzt das Entwicklungsteam bei der Fertigstellung
des Spieles. Au&szlig;erdem wurde die Homepage &uuml;berarbeitet und neue
Screenshots zur Verf&uuml;gung gestellt. Die Dreamworlds Development
Homepage ist unter <A HREF="http://www.dreamworlds.de/" TARGET="_top">http://www.dreamworlds.de/</A> zu erreichen.
</P>
<UL>
<LI> 'Der Clou' zum freien Download
</LI>
</UL>
<P>
Neo Software hat die AGA-Version ihres Spiels &quot;Der Clou&quot;
auf ihrer Webseite zum freien Download zur Verf&uuml;gung gestellt.
Von <A HREF="http://www.neo.at/" TARGET="_top">http://www.neo.at/</A> l&auml;sst sich das Spiel in Form von
DMS-Archiven herunterladen. Eine Passwortliste soll bald
folgen.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
