<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Rund um das Internet: Die besten Internetseiten (von Numen Stahl)</H2>
<P>
In dieser Rubrik werde ich von nun an jeden Monat einige Internetseiten zu
einem bestimmten Thema vorstellen. F&uuml;r diese Ausgabe habe ich mir vier
Amiga-News-Seiten rausgesucht. Die Bewertung setzt sich aus &quot;Aussehen&quot;,
&quot;&Uuml;bersicht&quot; und &quot;Inhalt&quot; zusammen.
</P>
<P>
<B>amiga.topcool</B>
</P>
<P>
Webmaster dieser Newsseite ist Daniel Orth. Auf dieser Seite findet man
die interessantesten News, kleinere Updates wird man hier vergebens suchen.
Daf&uuml;r sind viele Artikel mit Bildern und Kommentaren verziert, so dass man
sich &uuml;ber mangelnde Information nicht beklagen muss. Gelegentliche
Interviews sind ebenfalls hier zu finden. Ein Forum und ein Chat runden das
recht positive Gesamtbild noch ab.
</P>
<P>
Momentan d&uuml;rfte diese ansonsten eher wenig aufsehenerregende Seite vor
allem interessant sein, weil Daniel Orth aus seiner Newsseite ein neues
Printmag machen will. Die erste Ausgabe d&uuml;rfte bereits erschienen und bei
einigen Amigah&auml;ndlern erh&auml;ltlich sein. Wer also vorzeitig &uuml;ber den Inhalt
der n&auml;chsten Ausgabe informiert sein und evtl. sogar ein paar
Verbesserungsvorschl&auml;ge im Forum an die Redakteure richten m&ouml;chte, ist hier
genau richtig.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">URL:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://amiga.topcool.de" TARGET="_top">http://amiga.topcool.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sprache:&nbsp;</TD><TD VALIGN="TOP">Deutsch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Aussehen:&nbsp;</TD><TD VALIGN="TOP">Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&Uuml;bersicht:&nbsp;</TD><TD VALIGN="TOP">Befriedigend - Ausreichend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Inhalt:&nbsp;</TD><TD VALIGN="TOP">Befriedigend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamt:&nbsp;</TD><TD VALIGN="TOP">Befriedigend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Amiga-News.de</B></P>
<P>
Diese bekannte Newsseite von Petra Struck d&uuml;rfte jedem vernetzten Amiga-
User aus deutschsprachigen Gefilden ein Begriff sein. Falls es tats&auml;chlich
jemanden geben sollte, der diese Seite noch nicht kennt, hier eine kurze
Beschreibung:
</P>
<P>
Auf dieser Seite werden s&auml;mtliche Amiga News eingetragen, die man sich
vorstellen kann...vom Update eines drittklassigen Freeware-Games bis hin zu
detaillierten Infos &uuml;ber geplante Amiga-Generationen wird man hier &uuml;ber
alles informiert! &Uuml;ber das Amiga News Forum kann man auch selbst News
eintragen, die garantiert eine gro&szlig;e Zielgruppe erreichen. Zus&auml;tzlich zum
eigentlichen Newsdienst bietet Petra Strucks Seite auch noch einiges mehr,
z.B. eine riesige und sehr &uuml;bersichtlich aufgebaute Linkliste, in die jeder
seine amigaspezifische Seite eintragen kann. Ebenfalls erw&auml;hnenswert ist
die Rubrik &quot;Free Amiga Jobs&quot;, in der Stellenanzeigen f&uuml;r amigaspezifische
Berufe zu finden sind.
</P>
<P>
Insgesamt eine tolle Seite, um die kein deutscher Amiga-User herumkommt!
Mit dem Newsticker kann man zudem auch noch per E-Mail in den Genuss der
neuesten News kommen, ohne extra die Seite besuchen zu m&uuml;ssen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">URL:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.amiga-news.de" TARGET="_top">http://www.amiga-news.de</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sprache:&nbsp;</TD><TD VALIGN="TOP">Deutsch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Aussehen:&nbsp;</TD><TD VALIGN="TOP">Gut-Befriedigend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&Uuml;bersicht:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Inhalt:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamt:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Amiga Network News</B></P>
<P>
Diese Newsseite ist auf Englisch, aber da die meisten Amiganer dieser
Sprache m&auml;chtig sind, d&uuml;rften die Amiga Network News nichtsdestotrotz recht
interessant f&uuml;r viele sein. Grafisch ist diese Seite zwar eher schlicht
gehalten, das gleicht sie aber problemlos durch die hervorragende
&Uuml;bersichtlichkeit wieder aus. Hier findet man die wichtigsten News, die
allesamt sehr professionell zusammengefasst und mit Links versehen sind. Es
besteht auch die M&ouml;glichkeit, die Kommentare anderer User zu einem
bestimmten Newseintrag durchzulesen, oder sogar selbst einen zu schreiben.
Eine sehr gute Idee, die aus der Newsseite gleichzeitig ein gro&szlig;es Forum
macht.
</P>
<P>
Auch eine sch&ouml;ne Seite vor allem f&uuml;r diejenigen, die selbst mal ein
bisschen mitreden wollen. Ordentliche Englischkenntnisse sind aber Pflicht.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">URL:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.ann.lu" TARGET="_top">http://www.ann.lu</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sprache:&nbsp;</TD><TD VALIGN="TOP">Englisch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Aussehen:&nbsp;</TD><TD VALIGN="TOP">Ausreichend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&Uuml;bersicht:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Inhalt:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamt:&nbsp;</TD><TD VALIGN="TOP">Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Amiga Future</B></P>
<P>
Obwohl es sich bei dieser Seite eigentlich um die eines Spielemagazins
handelt, h&auml;lt sie auch f&uuml;r den News-Suchenden einiges bereit. Schwerpunkt
sind nat&uuml;rlich trotzdem noch Spiele und das Magazin an sich, und so kann
man hier des&ouml;fteren mal interessante Interviews mit Spieleentwicklern sowie
eine Liste aller in der Amiga Future bereits getesteten Spiele entdecken.
</P>
<P>
Im Bereich News findet man dann allerdings auch eine Liste mit den
interessantesten Amiga-News, die, &auml;hnlich wie bei Amiga-News.de, direkt
online eingetragen werden k&ouml;nnen. Wer sich prim&auml;r f&uuml;r Spiele interessiert,
sollte also auf jeden Fall mal diese Seite besuchen, f&uuml;r reine News sollte
man eher auf Petra Strucks Seite zur&uuml;ckgreifen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">URL:&nbsp;</TD><TD VALIGN="TOP"><A HREF="http://www.amigafuture.de/" TARGET="_top">http://www.amigafuture.de/</A>&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Sprache:&nbsp;</TD><TD VALIGN="TOP">Deutsch&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Aussehen:&nbsp;</TD><TD VALIGN="TOP">Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&Uuml;bersicht:&nbsp;</TD><TD VALIGN="TOP">Sehr Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Inhalt:&nbsp;</TD><TD VALIGN="TOP">Befriedigend&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gesamt:&nbsp;</TD><TD VALIGN="TOP">Gut&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>Numen Stahl &lt;<A HREF="mailto:Numen@freenet.de">Numen@freenet.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
