<html>
<head>
<title> USER-TALK - Murmel an Crazy Kilrathi - </title>
</head>
<body background="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">
<p align=left>
Hei Crazy Kilrathi !<br><br>
Nett das Dir mein Cheatbuch für die Playstation gefallen hat, oder
etwa nicht ? Auch sch&ouml;n das Du deswegen bei mir anfragst, bist damit
immerhin der Erste.Es w&auml;re nat&uuml;rlich sch&ouml;ner gewesen eine Postkarte zu
erhalten, mit Anregungungen und Kritik oder ein paar Cheats. Leider war
die Beteiligung bis jetzt gleich null, obwohl es &uuml;ber 30 mal aus
Mailboxen downgeloadet wurde, und auch auf der AmigaFuture zu finden ist.</p>
<p align=left>
Die Leute wollen anscheinend nichts mehr machen, wenn`s kein Geld
bringt. Falls Du selber Spiele durchgespielt hast, wie w&auml;re es mal
selber Komplettl&ouml;sungen zu schreiben, und an mich zu schicken ? - Dein
Name und Dein Copyright (und von jedem anderen auch) auf den Text,
w&uuml;rde dann nat&uuml;rlich erw&auml;hnt werden. Ich habe n&auml;mlich kein Bock
irgendwelche Komplettl&ouml;sungen aus Magazinen abzuschreiben. Und solange
das so ist, wird es wohl keine Komplettl&ouml;sungen geben. Bei
den normalen Cheats ist das was anderes, weil die Magazine sich zum
gr&ouml;&szlig;ten Teil aus dem Internet, oder aus anderen Magazinen bedienen.</p>
<p align=left>
Deswegen geht die Entwicklung (sch&ouml;nes Wort) dieses Cheatbuchs nur
schleichend weiter, obwohl V1.6 schon in Mailboxen wie CCS Base,
Bluebird zum Download bereitliegt. Oder schreib an mich dann bekommste
die neuste Version zugeschickt. Ich arbeite nat&uuml;rlich schon an
Version V1.7 und an eine eventuelle HTML-Version.
Aber wann die erscheinen wei&szlig; der Himmel.</p>
<br>
SoSo Baphomets Fluch 2 also.<br>
<p align=left>
Schau mal in die Schreibtischschublade (in Qubiers Haus) dort findest
Du einen Topf, und dort ist der Schl&uuml;ssel drin. Am Fenster liegt
Nico`s Handtasche, und dort liegt dann, neben einigen anderen Sachen
einen Brief in dem die Telefonnummer von Lobineau steht. Den kann man
dann anrufen.</p>
<p align=left>
Da ich das Spiel aber selbst schon gespielt haben kann ich Dir nur
raten Dich mit allen Personen zu unterhalten, und alle Gegenst&auml;nde
zu untersuchen. Dann solltest Du auch ohne Komplettl&ouml;sung ziemlich
weit kommen. Macht dann auch mehr Spa&szlig;.</p>
<p align=left> Gru&szlig;</p>
</font><font size=5 color="ff0000"><p align=center> Murmel </p></font>
<br><br><br>
<table border=0 width=100%>
<tr><td align=left width=7%></td><td align=left width=93%></td></tr>
<tr><td align=left valign=top> PS: </td>
<td align=left> Version 1.7 ist drau&szlig;en und in einigen Mailboxen, und wenn alles
 Gut geht auch im Aminet zu finden. Wenn Du`s Dir da nicht holen
 kannst, schreib mir und ich schick Dir die Version 1.7 zu.</td></tr>
</table>
</body>
</html>

