<html>
<head>
<title> USER-TALK - Murmel an Kilian und an Alle - </title>
</head>
<body background="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">
<p align=left>
Servus Killian !<br>
<br>
Dein Spruch &quot;Du h&ouml;rst auch Metal.....Das ist Gut so&quot; war echt Witzig.
He, ich h&ouml;r l&auml;nger Hardrock als......... &Auml;hm, Gut lassen wir das.
Ich selber besitzte &uuml;ber 600 CD`s von Rock - Trash (ja ,Jugends&uuml;nden).
Also Band`s wie &quot;Accept, U.D.O, Whitesnake, Dream Theater, Metal Church,
Steelheart, Krokus, White Lion, Dokken, Toto, Helloween, Savatage,
Dio, Garry Moore, Europe, Chastain, Blue Öyster Cult, Yngwie Malmsteen,
Armored Saint (Cool !) , Ted Nugent, Van Halen&quot; und noch viele mehr.
Und das &auml;ndert sich auch nicht mehr !</p>
<p align=left>
Nun zu Deiner Frage:<br><br>
Listen haben die keine soweit ich wei&szlig;, m&uuml;&szlig;ten ja auch T&auml;glich
aktualisiert werden. Nur Not k&ouml;nnte man ja anrufen, und fragen ob sie`s
auf Lager haben.</p>
<p align=left>
DIESES GILT &quot;NUR&quot; F&Uuml;R ALLE MITGLIEDER DER AMIGA4EVER:<br>
<br>
Ich bin gerne bereit f&uuml;r jedes registriertes Mitglied der
Amiga4ever-Gemeinde CD`s zu besorgen, oder nachzuschauen ob erh&auml;ltlich
+ Preis. Am besten w&auml;re nat&uuml;rlich die Sache &uuml;ber E-Mails abzuwickeln
(erh&auml;ltlich + Preis) , aber zur Not auch &uuml;ber die Post. Dies gilt aber
nur f&uuml;r den Rock-Trash-Bereich da ich mich hier auskenne.</p>
<p align=left>
Aber niemand sollte Wunderdinge von mir erwarten. Es gibt zwei L&auml;den
hier in M&uuml;nchen wo ich h&ouml;chstens 1-2 mal pro Woche vorbeischauen kann.
Also ein bi&szlig;chen Geduld sollte man schon mitbringen.  Auch die
Bezahlung macht mir sorgen. Ich kann verstehen wenn sich jemand die
Nachnahme-Geb&uuml;hren sparen will. Aber jeder der vorhat mir Geld in
einem Brief zu schicken sollte dies unterlassen, oder zumindestens
per Einschreiben. Wenn jemand eine besser Zahlungsm&ouml;glichtkeit ein-
f&auml;llt sollte er diese mir mitteilen.<br>
Auch BITTE keine telefonischen Bestellungen. Nur Brief oder E-Mail,
was anderes wird nicht bearbeitet.<br>
Am Anfang w&uuml;rde ich sagen f&uuml;r jeden nicht mehr als 2 CD`s, wenn alles
klappt kann man die Sache ja steigern. Auch werde ich falls die Sache
nicht klappen sollte alles wieder abblasen. Aber versuchen wir es
erst mal.</p>
<p align=left>
Also Killian kein Problem, schreib halt was Du suchst und ich kann
Dir dann falls erh&auml;ltlich den Preis miteilen, und Du sagst halt dann
ob Du`s willst oder nicht.</p>
<p align=left>Tschau !</p>
<font size=4 color="ff0000"><p align=center> Murmel </p></font>
<br>
<p align=left>
PS: Ja BITTE (lechz) schreib nur weiter Deine Metal-Test
in der Amiga4ever.</p>
</body>
</html>
