<html>
<head>
<title> USER-TALK - Numen an Alle - </title>
</head>
<body background="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">
<p align=left>  By NUMEN <br><br>
So Leute, jetzt will ich hier erstmal was klarstellen!<br><br>
Wie ihr vielleicht schon mitbekommen habt,habe ich in meinem
Fragebogen meinen Geburtstag nicht angegeben.Nun besa&szlig; ein gewisser
Chefredakteur, dem ich hier, um ihn nicht blo&szlig;zustellen, mal einfach
das Pseudonym...&auml;h.. Rainer Thieke geben werde,die grenzenlose
Unversch&auml;mtheit, die geradezu ungekannte Dreistigkeit, ja,die
verleumdungsvolle Boshaftigkeit, diesen glorreichen Tag f&uuml;r die Menschheit
so mir nichts dir nichts in diesem Jahrtausend, ja sogar in diesem
Jahrhundert anzusiedeln.Wem jetzt vor Staunen die Kinnlade runterf&auml;llt
kann das im Personal Stuff nachlesen.Aber bevor ihr jetzt allesamt,
von dieser bodenlosen Frechheit animiert, der Amiga 4ever den
R&uuml;cken zudreht, lasst es lieber bei einem sanften Tadel in Form von
ein paar Peitschenhieben.Ich bin sicher, dass Rainer diese 
Verleumdung und Diskriminierung alter Menschen bereits in dieser
Ausgabe entfernt hat,<p>
<p align=center> NICHT WAHR , RAINER  ?!!</p>
<p align=left>
Tja, das h&auml;tten wir.Aber nun werdet ihr sicherlich haareraufend vor
dem Monitor sitzen und euch verzweiflt fragen:&quot;Wer ist dieser Typ
eigentlich, und wann ist er denn nun eigentlich geboren ???&quot; (Nicht?...
egal, lies trotzdem weiter).Tja,da ich euch bisher ohnehin nur mit
meinen ultimativen Oldietests begl&uuml;ckt habe,denke ich mal, dass ich
einige Minuten f&uuml;r euch primitive sterbliche Gesch&ouml;pfe
entbehren kann.Hier ist meine Lebensgeschichte....</p>
<p align=left>
Nun, zu Anfang erstmal ein Gest&auml;ndnis: Mein wahrer Name ist nicht Numen
(Denkt euch hier jetzt bitte eine dramatische Pause).Und mein wahrer
Name ist auch nicht Hendrik Stahl (wieder dramatische Pause).Nein,
mein Name ist Duncan McClaud, und ich wurde vor vielen Jahrhunderten
in den schottischen Highlands geboren.(Ihr wisst schon...Pause)
Also, das war so: Damals war immer eine Menge Krieg in Britannien,
und, wer kennt das nicht, eines Tages wurde ich in einem solchen mal
t&ouml;dlich verwundet.Nachdem meine Exkameraden nun aber schon mein ganzes
Erbe untereinander aufgeteilt hatten, geschah mir ein kleines Mal&ouml;r,
und zwar erwachte ich wieder zum Leben.Seitdem wei&szlig; ich, dass ich
unsterblich bin.Das nahm mir mein Klan, der schon extra einen Sarg und
alles gebaut hat, dann aber ziemlich &uuml;bel.Ich musste den Sarg also
bezahlen, und da mein Geld bereits unwiederruflich in den H&auml;nden
meiner Nachkommen war, gestaltete sich das als schwierig, um nicht zu
sagen unm&ouml;glich.Also wurde ich mit nichts als meinem Schwert, und, weil
dieses Magazin ja keine Altersbegrenzung hat, meinetwegen auch mit
meiner Kleidung, aus dem Dorf gejagt.Jetzt denkt ihr vielleicht, dass
einem mit nichts als einer Waffe schnell langweilig wird.Das stimmt
aber nicht, besonders dann nicht, wenn man unsterblich ist.Und so kam
ich auf die Idee, Leute zu k&ouml;pfen.Es war toll: &quot;Wer seid ihr, edler
Reisender?&quot;-&quot;Ich bin Duncan McClaud vom Stamm der McClauds, und
es kann nur einen geben!&quot; und zack, da lag das
verst&auml;ndnislosmitleidvolle L&auml;cheln mitsamt dem Kopf drumherum
auf der Erde.Und so hatte ich dann viele viele Jahre lang einen
Mordsspa&szlig; mit meinem neuem Hobby,
f&uuml;r das ich heute leider kaum noch Zeit finde.</p>
<p align=left>
Das hatte jedoch ein abruptes Ende als ich mal wieder auf ein
potentielles Opfer stie&szlig;. Ich hatte n&auml;mlich die kleine Marotte, dass
ich für jeden Enthaupteten eine Kerbe in mein Schwert ritzte (auf
solche Sachen fliegen die Frauen nunmal).Ich habe also auch diesen
Typen fachgerecht gek&ouml;pft, und nachdem die ganzen Spezialeffekte
verklungen waren (Explosionen,Blitze,etc.,ihr wisst schon was
ich meine) ritzte ich wie &uml;blich eine Kerbe in meine Klinge.Wie ihr
euch aber sicherlich vorstellen k&ouml;nnt sammeln sich im Laufe der
Jahrhunderte ziemlich viele Kerben an, und mein Schwert sah bereits
aus, als ob eine Horde mutierter Killernagetiere dar&uuml;ber hergefallen
wäre.Tja, und diese Kerbe war eben eine zu viel, und mein
einziger Besitz zerbr&ouml;selte zwischen meinen Fingern.Leider waren
ausgerechnet zu dieser Zeit die Waffenbesitzrechte besonders streng,
und ein Schwert gab es erst ab achtzehn.Ich war jedoch nur einer, und
siebzehn Freunde hatte ich nicht.Dumm gelaufen, aber zum Gl&uuml;ck war
der britische K&ouml;nig zu diesem Zeitpunkt ein gewisser Arthur, und
der brauchte noch einen tapferen Ritter.Ich schlich mich also un-
ter einem Pseudonym in die Tafelrunde ein und bekam, wie in einer
Annonce versprochen, zur Begr&uuml;&szlig;ung ein Gratisschwert.
Und so focht ich einige Jahre an der Seite meines K&ouml;nigs in vielen
Kriegen.Irgendwann hat er mich dann aber versto&szlig;en,
weil da was zwischen mir und seiner Frau lief.</p>
<p align=left>
Ich beschloss die Inseln mal für ein Weilchen zu verlassen und zog
in eine kleine H&uuml;tte in den Alpen ein.Meine Enkelin Heidi zog auch ein,
aber als sie mich dann verlie&szlig; um in die Stadt zu gehen wurde es
wieder ein wenig langweilig.Ich wanderte also in Richtung Tal um ein
paar Leute zu k&ouml;pfen.Unterwegs passierte aber etwas seltsames: Meine
Umgebung begann zu verschwimmen und pl&ouml;tzlich stand ich inmitten eines
seltsamen Raumes, der nur aus Stahl zu bestehen schien.Einige mehr
oder weniger seltsam aussehende Wesen in bunten Strampelanz&uuml;gen
standen um mich herum, und einer begann mit feierlicher Stimme zu
reden: &quot; Wir begr&uuml;&szlig;en sie auf der Enterprise,
gro&szlig;er...&auml;h Captain, sind sie sicher,dass das der
Klingonenadmiral ist ?!?&quot;.Ein &auml;lterer Herr
mit Halbglatze antwortete: &quot;Verdammt Worph, sie haben den falschen
hochgebeamt!&quot;.Ob außerirdisch oder nicht, sie hatten alle K&ouml;pfe, und
ich gab mir denn auch eine Menge M&uuml;he um das bei einem Gro&szlig;teil von
ihnen zu &auml;ndern.Ich will ganz ehrlich sein: Ich hatte keine
Chance.Die Typen hatten Phaser und waren in der &Uuml;berzahl.Am meisten
Sorgen bereitete mir ein Typ in schwarzer R&uuml;stung, der offenh&ouml;rlich
Atemprobleme hatte und mit einem leuchtenden Schwert auf mich
eindrosch.Nachdem ich immer weiter zur&uuml;ckgedr&auml;ngt wurde , stolperte ich
&uuml;ber ein Kabel und landete auf einem Pult voller bunter Kn&ouml;pfe.Der
Effekt war verheerend: Ein gro&szlig;es Loch &ouml;ffnete sich vor dem Raumschiff
und es wurde hineingesogen.Als wieder Ruhe eingekehrt war begann
der Kapitän zu mosern: &quot;Dieser Idiot hat uns &uuml;ber 10.000 Jahre in die
Vergangenheit katapultiert! Mr.Data, beheben sie das Problem, aber
schaffen sie mir diesen Psychopathen vorher vom Hals.Ein Typ mit
wei&szlig;geschminktem Gesicht f&uuml;hrte mich mit eisernem Griff zum
Teleporter.Ich hatte Gl&uuml;ck: Er bestrafte mich nicht,
sondern beamte mich eionfach nur an exakt denselben Standpunkt zur&uuml;ck,
an dem ich vorher auch war.Er konnte ja nicht wissen, dass
gerade Eiszeit war...</p>
<p align=left>
Und so lag ich also viele Jahrtausende unter einer 500 Meter dicken
Eisschicht.Es gibt nichts f&uuml;rchterlicheres als so lange dasitzen und
warten zu m&uuml;ssen, nur wer regelm&auml;&szlig;ig beim Zahnarzt ins Wartezinner muss
kann diese Grausamkeit wirklich nachvollziehen.Naja, die Jahrtausende
vergingen und der Schnee schmolz.Irgendwann fanden mich endlich
einige Herren und ich war vor K&auml;lte vollkommen erstarrt.&quot;Schaut mal,
eine Leiche, toll!&quot;, rief einer.Andere Zeiten andere Sitten dachte ich
mir, aber anstatt &quot;Ruf einen Krankenwagen, schnell!&quot; oder zumindest
&quot;Los, hol einen Leichenwagen f&uuml;r den armen Kerl.&quot; waren die n&auml;chsten
Worte dieser Barbaren:&quot;Klasse, den alten Knacker bringen wir in ein
Museum, die zahlen bestimmt ein Verm&ouml;gen!",und anschlie&szlig;end
verspotteten sie mich noch indem sie mir den l&auml;cherlichen Namen
"&Ouml;tzi" gaben - der Gipfel der Grausamkeit.Aber ich konnte dem Museum
entfliehen und nun bin ich hier.Meine Attraktivit&auml;t hat zwar
im Laufe der Jahre unterm Eis ein wenig gelitten (wer mal ein Foto
vom &quot;&Ouml;tzi&quot; gesehen hat weis, was ich meine) aber eine &quot;Freundin&quot;
habe ich trotzdem noch gefunden.   =:-) </p>
<br><p align=center> THE END </p>
<font size=4 color="ff0000"><p align=center> NUMEN </p></font>
<br>
<p align=left>
PS: &Uuml;brigens noch ein Gest&auml;ndnis: Manche werden es vielleicht
    schon beim Lesen bemerkt haben, die obige Geschichte ist nicht
    ganz wahr, in Wirklichkeit hei&szlig;t meine Enkelin n&auml;mlich nicht Heidi
    sondern Margarethe, aber das nur nebenbei.Ich will euch ja
    schlie&szlig;lich keine L&uuml;gen verbreiten...</p>
</body>
</html>
