<html>
<head>
<title> USER-TALK - Numen am Mr.Tilt - </title>
</head>
<body background="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink=ff00ff" alink="00ffff">
<p align=left> VON NUMEN AN MR.TILT</p>
<p align=left> Tach Marco !<br><br>
 Erstmal will ich mich dir vorstellen, da wir uns ja noch gar nichts ge-
schrieben haben: Also ich bin Hendrik (Allerdings besser bekannt als
Numen) und erst seit wenigen Monaten mit im Team.Haupts&auml;chlich wird man
von mir wohl Oldie-und PD-Tests lesen k&ouml;nnen, gelegentlich auch mal
was anderes.Bin &uuml;brigens auch regelm&auml;&szlig;iger Pinballspieler, auch wenn
ich mich sicherlich nicht als Freak bezeichnen w&uuml;rde (meine
Slamtiltsitzungen enden in der Regel fr&uuml;her oder sp&auml;ter
mit verzweifelten Wutschreien und einigen beherzten Schl&auml;gen gegen die
Tastatur. Naja, der Amiga ist ja bekanntlich in vielerlei Hinsicht
hart im Nehmen ;).</p>
<p align=left>
 Sooooo, du hast nun also den wahren Weg ins geheiligte Internet
gefunden, mein Gl&uuml;ckwunsch !Ich muss gestehen ich bin bisher noch
Offline, habe aber schon oft dar&uuml;ber nachgedacht mir einen Anschluss
zuzulegen.Dummerweise habe ich keinen in meiner Umgebung, der mich ein
bisschen aufkl&auml;ren kann, und ich selbst bin absoluter Laie.Deshalb wende
ich mich mit meinen Fragen vertrauensvoll an dich.</p>
<p align=left>
 Erstmal, was kostet eigentlich INet, also gutes Modem (50K sollten es
schon mindestens sein), Telefonrechnung und Server sowie die n&ouml;tige
Software ? Wieviele Stunden verbringt man monatlich denn so im Netz
(Ich glaube ich w&uuml;rde mit zehn auskommen, wei&szlig; aber nicht, ob das
illusion&auml;r ist), und k&ouml;nnte ich als Hammer (Genau, Hamm ist die Stadt mit
den geldgeilen Usergroups.Gru&szlig; an Herrn &quot; Helmut &quot; Kandler) von dem
kostenlosen GermanyNet profitieren ?Da ich noch in der Ausbildung bin
ist Geld bei mir n&auml;mlich das Hauptproblem.Au&szlig;erdem w&uuml;sste ich
gerne wie man so ein Modem ans Telefonnetz anschlie&szlig;t, muss man mehrere
Anschl&uuml;sse haben wenn man gleichzeitig internetten und telefonieren
will ? Und zu guter Letzt: Lohnt es sich bei einem A1200 mit 030er und
40Mhz überhaupt ins Internet zu gehen oder w&uuml;rde ich die meiste Zeit
damit verbringen den Seiten beim Aufbauen zuzusehen ?</p>
<p align=left>
 Tja, das war`s auch schon, ich bitte um Antwort entweder telefonisch
(Nummer im Personal Stuff) oder einfach per UserTalk.Ich danke dir
schonmal f&uuml;r`s Zuhören (falls du das hier &uuml;berhaupt liest, aber wenn
nicht dann hast du ja auch nichts von meinem Dank mitbekommen :),
vielleicht bin ich ja dann auch bald im INet.</p>
<p align=left> Ciao, man liest sich. </p>
<font size=4 color="ff0000"><p align=center> NUMEN </p></font>
</body>
</html>
