<html>
<head>
<title> USER-TALK - Poldi an Alle - </title>
</head>
<body backgrund="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">
<p align=left>
An Alle zu den Themen:
1. Gewinnspiel (An The Machine)<br>
2. Magazine<br>
3. QNX<br>
4. Neuigkeiten und Ger&uuml;chte<br>
5. Tip f&uuml;r Manga-Fans<br>
6. Werbung-(Nachtrag)<br>
7. Geburtstags-Ecke<br>
</p>
<table border=0 width=100%>
<tr><td align=left width=10%></td><td align=left width=90%></td></tr>
<tr><td align=left valign=top> 1.) </td>
<tr><td align=left> Zum Gewinnspiel m&ouml;chte ich &quot; The Machine &quot;
 mal fragen wie er herausbekommen will ob jemand mit dem Cheat spielt oder ohne.
 Schlie&szlig;lich k&ouml;nnte man so lange spielen bis der Highscore hoch genug ist, aber
 nicht so hoch das es auffallen w&uuml;rde. Also, wie sch&uuml;tzt Du Dich
 davor? (Die Antwort: &quot; Mit Pariser &quot;, gilt nicht!)</td></tr>
<tr><td align=right valign=top> ( </td>
<td align=left> Ich pers&ouml;nlich habe erst vor kurzem diesen Patch entdeckt,und ich
 bin mir ziemlich sicher das der Leiter des Gewinnspiels (Adrian)
 ebenfalls nichts von diesem &quot; Trainer &quot; wusste.
 Dumm gelaufen ! Aber nichts desto trotz sollte das Gewinnspiel
 wie bisher weiterlaufen,schliesslich gibt es auch &quot; ehrliche &quot; Amiganer
 unter den Galaga-Freaks. Anm.v.RT ) </td></tr>
<br>
<tr><td align=left valign=top> 2.) </td>
<td align=left> Das unser 4ever Mag. eigentlich gut l&auml;uft und auch viel
 geschrieben wird ist ja bekannt, aber leider sieht es nicht &uuml;berall so
 gut aus. Innerhalb k&uuml;rzester Zeit wurden 2 Disketten-Magazine eingestellt,
 das waren die Amiga-Times und die Fun-Time, beide waren gute
 Magazine und trotzdem wurden sie aufgegeben. L&auml;uft es vielleicht
 doch nicht so gut wie es manchmal geglaubt wird? Gut, es gibt eben
 nicht so viel wor&uuml;ber geschrieben werden kann, aber wir m&uuml;ssen
 eben aufpassen das die 4ever nicht auch eingestellt wird nur weil
 jeder denkt es wird schon jemand etwas schreiben und dann schreibt
 keiner! Bis jetzt schreiben wir noch genug,(Bei der NC fing es
 auch gut an und der User-Talk war riesig gro&szlig;.)<br>
 aber ich bitte Euch nicht locker zu lassen und weiterhin so viel zu
 schreiben, auch die &quot; nur &quot;-Leser k&ouml;nnten mal etwas von sich lesen
 lassen. Schaut Euch mein Gekrackel an, am Anfang &uuml;berlegte ich
 lange ob ich mal den Versuch starte zu schreiben und die Angst vor
 negativen Reaktionen war bei mir auch vorhanden, aber schon die
 n&auml;chste Ausgabe beruhigte mich wieder und ich freute mich &uuml;ber
 die 3 Briefe die an mich gerichtet waren.<br>
 (Mein Dank geht an Adrian, Murmel und Yoshimitsu.) Nun, ich wei&szlig;
 das ich viel M&uuml;ll schreibe und auch provokativ, einige werden auch
 denken ich sei zu negativ, (hat man mir schon geschrieben) doch
 das soll egal sein und Euch nicht davon abhalten es auch
 einmal zu probieren.  VIEL GL&Uuml;CK !!!</td></tr>
<br>
<tr><td align=left valign=top> 3.) </td>
<td align=left> Ein Satz mit X, da&szlig; mit QNX wird wohl nix!
 Was haltet Ihr davon das man sich jetzt doch lieber f&uuml;r Linux
 entschied? Es sollen sich schon viele Amiga-User beschwert haben,
 aber mit welcher Begr&uuml;ndung, weil Linux schlechter als QNX sein
 soll oder weil so lange schon QNX angek&uuml;ndigt wurde? Wei&szlig; jemand
 von Euch n&auml;heres über die Gr&uuml;nde der Beschwerden? Warum sich
 umentschieden wurde wei&szlig; ich schon.</td></tr>
<br>
<tr><td align=left valign=top> 4.) </td>
<td align=left> Der Computerhersteller Compaq hat in den USA einen Laptop
 patentieren lassen, der sich durch das Tippen auf der Tastatur
 aufl&auml;dt. Winzige Magneten mit Drahtspiralen, die an den Tasten
 angebracht sind, erzeugen einen minimalen Stromsto&szlig;, berichtete
 das Wissenschaftsmagazin &quot; New Scientist &quot;.<br>
 (Info aus dem ZDF Videotext.)<br>
 Von Amiga soll es jetzt auch schon Shorts geben, aber gesehen
 habe ich noch keine.
 Petro soll gesagt haben das Amiga im Jahre 2000 versucht sich
 von Gateway zu l&ouml;sen und auch an die B&ouml;rse will.</td></tr>
<br>
<tr><td align=left valign=top> 5.) </td>
<td align=left> Hallo Ihr Fans von Manga-Bildern!
 Falls Ihr ein paar Mangabilder auf CD-ROM haben wollt,
 dann wendet Euch an den Orion Versand, die
 haben eine CD mit 150 Erotik-Mangas. Diese CD ist zwar wieder f&uuml;r
 PC + Mag. aber mit den passenden Datatypes sollte es keine Probleme
 geben.
 Leider habe ich den Preis vergessen, fragen kostet ja nichts, au&szlig;er
 die Telefonkosten. Das ist schon die zweite Manga CD die es bei
 denen gibt! Die Tel.Nr.: 0461/50 40 141.</td></tr>
<br>
<tr><td align=left valign=top> 6.) </td>
<td align=left> Letztes mal hatte ich noch einiges vergessen zum Thema Werbung:<br>
 Also ich glaube das Amiga schon vor einem Jahr Werbung f&uuml;r den
 Classic Amiga h&auml;tte machen m&uuml;ssen! Die Angst der PC-User vor dem
 Jahr 2000 h&auml;tte man f&uuml;r den Amiga gut nutzen k&ouml;nnen. Viele kleinere
 Firmen haben nicht das Geld um sich Programmierer ins Haus zu holen
 die dieses Jahr 2000 Problem beseitigen und genau bei denen k&ouml;nnte
 man Amigas in Massen verkaufen. Vielleicht habt Ihr eine Ahnung
 was es kostet die PC´s von jemanden Jahr 2000 tauglich zu machen,
 es ist f&uuml;r die meisten kleinen Firmen unerschwinglich, neue Amigas
 mit der passenden Software w&auml;re viel billiger.  Das Amiga jetzt
 Werbung in den Amiga-Magazinen macht ist gut f&uuml;r die Magazine,
 aber was bringt es sonst? Bei uns brauchen die keine
 Werbung machen, alle die diese Magazine lesen haben schon einen
 Amiga und wissen das es das O.S.3.5 bald geben wird! Soweit ich
 wei&szlig; will Amiga sogar Werbung f&uuml;r´s O.S.3.5  in regionale
 Fernsehsender starten, das ist es was ich sehen will, hoffentlich
 machen die das wirklich!!!<br>
 Auf jeden Fall mu&szlig; der Classic-Amiga beworben werden, sonst k&ouml;nnen
 wir unsere teueren, zusammen-geschmachteten Amigas wegwerfen, nur
 weil es immer weniger Classic-User geben wird.<br>
 Tsch&uuml;&szlig;ikowski.</td></tr>
<br>
<tr><td align=left valign=top> 7.) </td>
<td align=left> Jubel, Trubel, Heiterkeit!!!<br>
----------------------------<br>
 Alles Gute nachtr&auml;glich zum Geburtstag geht diesmal an:<br>
<br>
 Gucky und Crazy Kilrathi<br>
<br>Viel Spa&szlig; und Gl&uuml;ck w&uuml;nscht Euch: Poldi<br>
 Na, Roger H., bei Dir dauert es ja nicht mehr lange, aber da
 ich nicht vorher Kratulieren will (Ungl&uuml;ck), erw&auml;hne ich Dich bei
 der n&auml;chsten 4ever. </td></tr>
</table>
</body>
</html>
