<html>
<head>
<title> USER-TALK - Poldi an Yoshimitsu - </title>
</head>
<body backgrund="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">

<p align=center> Guten Tag Yoshimitsu </p>
<p align=left>
  Das die Siedler abst&uuml;rzten war nur im Demo passiert, in der Vollversion
  ging das bis jetzt nur einmal, weil ich an vielen Stellen zur gleichen
  Zeit Angriffe durchf&uuml;hren lie&szlig; und noch eigene H&uuml;tten abfackelte.
  Ich glaube nicht das der Programmierer das mit Absicht machte und in der
  Readme Datei steht auch nichts &uuml;ber diese Abst&uuml;rze, eine zeitliche
  Begrenzung kann es auch nicht sein, da ich immer verschieden lang spielte.
  Sowas aber auch, eben schaffte ich es wieder das das Spiel abst&uuml;rzte,
  diesmal hatte ich die gr&ouml;&szlig;te Welt (8) und 4 Angriffe durchgef&uuml;hrt und zur
  gleichen Zeit wollte ich eine eigene gro&szlig;e Burg vernichten, genau als ich
  die Best&auml;tigung zum Abriss anklickte blieb das Bild stehen und nichts
  ging mehr. Das war wohl zu viel f&uuml;r das Spiel?!</p>
<p align=left>
  Hoffentlich kannst Du jetzt wieder spielen, so ein gutes Spiel nicht
  spielen zu k&ouml;nnen ist echt eine Strafe!  Den Trick mit dem Spezialklick
  am Weg der Feinde ist Dir doch bekannt? Aber ich gebe Dir auch noch
  einen Tip: Wenn Du diesen Weg &uuml;ber Wasser f&uuml;hrst laufen Dir nicht
  dauernd die Leute weg und Du mu&szlig;t nicht so viel aufpassen, Du kannst
  nat&uuml;rlich auch versuchen die feindliche Burg einzunehmen, wenn dann
  noch Geb&auml;ude vom Feind stehen und Du kannst einen &quot;Blutsaugerweg&quot;
  anschlie&szlig;en, geh&ouml;rt alles was der Feind herstellt Dir und Du mu&szlig;t
  Dich dort um nichts mehr k&uuml;mmern. Hast Du es mal erlebt das der
  Nachschub von Brettern nicht in die G&auml;nge kam, nur weil der F&ouml;rster
  nicht genug B&auml;ume pflanzt? Dann gehe zum Platz wo der F&ouml;rster die
  B&auml;ume aus dem Hut zaubert und setze auf die Baumst&uuml;mpfe Fahnen und
  mach dann die Fahnen wieder weg, schon ist der Stumpf weg und der
  F&ouml;rster kann pflanzen.</p>
<p align=left>
  Das Spiel ist wirklich gut und macht sehr lange Spa&szlig;, nur eine
  Sache nervt:<br>
  Dauernd dieser &quot;Extrem Wegebauing&quot;, in Foundation ist das besser.
  Wenn ich vorher geahnt h&auml;tte das das Spiel so gut ist h&auml;tte ich es
  mir schon vor viel l&auml;ngerer Zeit gekauft.<br>
  Letztens viel mir ein, das Titan das Spiel &quot; Die Siedler 2 &quot; doch noch
  etwas ver&auml;ndern k&ouml;nnten, am besten mit Hilfe von Paul Burkey, dann
  br&auml;uchten sie es nur noch Foundation 2 zu nennen und schon h&auml;tten wir
  doch wieder ein sehr gutes Spiel. (Ob das machbar w&auml;re?)</p>
<p align=center> Mach es gut und la&szlig; mal wieder was von Dir lesen.<br>
<font size=4 color=ff0000"> By Poldi </font></p>
</body>
</html>
