<html>
<head>
<title> USER-TALK - Poldi an Alle - </title>
</head>
<body backgrund="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">

<p align=center> Hallo Ihr </p>
<p align=left>
  Jetzt mu&szlig; ich mich auch noch entschuldigen, weil ich vor 2 monaten
  f&uuml;r HAUG Werbung machte. Bitte glaubt mir das ich nichts davon wu&szlig;te
  und es bedauere das ich auf den Kandler reingefallen bin. Was habe ich
  mich blamiert und &uuml;ber mich selbst noch lange ge&auml;rgert!!! Gern w&uuml;rde
  ich mal wissen warum andere &uuml;ber ihn Bescheid wu&szlig;ten und ich nicht.
  Mir w&auml;re es auch lieber gewesen wenn &quot; The Machine &quot; diesen Text
  gestrichen h&auml;tte, aber vielleicht sollte gerade dieser Text als
  abschreckendes Beispiel dienen. Den Rat von &quot; The Machine &quot; befolgte ich
  und k&uuml;ndigte die Mitgliedschaft beim Kandler und bat um schriftliche
  Best&auml;tigung, was meint Ihr wieviele Briefe ich von ihm bekam? Genau,
  nach langem z&auml;hlen und zusammenrechnen, 0 St&uuml;ck. Die Disketten habe
  ich auch formatiert und werde sie noch eine Weile aufheben, man wei&szlig;
  ja nie was noch passiert.<br>
  &Uuml;ber meinen geilen Gewinn freue ich mich fast jeden Tag, so was sch&ouml;nes
  findet man nicht alle Tage, leider ist das Zeug unsichtbar und ich habe 
  bald keine Lust mehr zu suchen, aber andere sind noch mehr gestraft weil
  sie einen Freund haben den nur sie sehen, nicht wahr Herr K. ???
  Es war ja schon merkw&uuml;rdig mit so viel Software f&uuml;r so wenig Geld, aber
  ich dachte das man Amiganern trauen kann (jeder hilft jedem und so.) und
  das werde ich weiterhin glauben und auch so handeln! Von einem der eine
  Sache testet nur um sie schlecht zu machen (Infinitiv) werde ich
  mich nicht vom Amiga und der 4ever abbringen lassen!!! Es wunderte
  auch das einer den Infinitiv anz&uuml;ndet um herauszufinden welche Gifte
  sich entwickeln und wie man am besten l&ouml;scht! Welche Gifte entstehen
  eigentlich wenn man ihm sein Sack anfackelt?<br>
  Zu diesem Thema m&ouml;chte ich dann weiterhin nichts mehr schreiben,
  au&szlig;er ich mu&szlig; mal wieder antworten.</p>
<p align=center> Lacht mal wieder!!! </p>
<p align=left>
  Na Machine, ich weis das Du eigentlich nichts mehr zu diesem Thema
  lesen wolltest, aber ich hoffe Du verstehst das ich zu dieser Sache
  noch was schreiben mu&szlig;te, schlie&szlig;lich stehe ich jetzt ziemlich dumm
  da, nicht war?</p>
<p align=center><font size=4 color="ff0000"> By Poldi </font></p>
</body>
</html>
