<html>
<head>
<title> USER-TALK - Yoshi an The Bruce - </title>
</head>
<body backgrund="../gif/hintergrund.gif" text="ffffff" link="00ff00" vlink="ff00ff" alink="00ffff">
<p align=left> An The Bruce <br> ------------ </p>
<br>
<p align=left> Hello Kilian !<br><br>
 Es geht um Heavy Metal. Ich bin vor kurzem auf den Geschmack gekommen,
 als ich mal so im Media Markt (bin ich nicht bl&ouml;d !?) einige CDs
 anh&ouml;ren wollte - und sehe zuf&auml;llig so eine &uuml;belste &quot;Beast&quot; CD von
 Iron Maiden da ganz allein rumstehen - dachte ich mir, h&ouml;r ich mir die
 doch mal an (das Titelbild hat mir total gefallen !). Die CD hei&szlig;t
 &quot;BEST OF THE BEAST&quot; - und es gef&auml;llt mir fast jedes Lied da drauf
 (&quot;The Number of the Beast&quot; gef&auml;llt mir am besten). Nun ja, ich m&ouml;chte
 gern etwas &uuml;ber diese Gruppe erfahren - und da ich hier so mitbekommen
 habe, da&szlig; du dich f&uuml;r Heavy Metal interessierst, frage ich dich, ob
 du nicht irgendwas &uuml;ber Iron Maiden hast und mal in der Amiga 4 ever
 ausstellen kannst - w&auml;re echt Heavy !<br>
 Mit den 5 Kunden da hinten auf der CD drauf kann ich n&auml;mlich wenig
 anfangen (wei&szlig; nicht mal ihre Namen).<br>
 Die CD habe ich mir nat&uuml;rlich gekauft. Sag mal, wie findest du denn
 eigentlich Iron Maiden (und die CD) ?<br>
 Kannst du mir noch andere gute Heavy Metal Gruppen empfehlen ??
 Ich habe mir noch einige andere, wie z.B. &quot;AC/DC&quot;, &quot;WARDOG&quot;, &quot;AEROSMITH&quot;
 &quot;RAMMSTEIN&quot; angeh&ouml;rt, aber die gefallen mir &uuml;berhaupt nicht (au&szlig;er
 ein Lied von Rammstein - Sehnsucht hie&szlig; es glaub ich !).</p>
<p align=left>
 &Uuml;brigens - ich wei&szlig; nicht ob du den Film
 &quot;Bill und Teds verr&uuml;ckte Reise durch die Zeit&quot; kennst (ist einer meiner
 Lieblingsfilme), mit Keanu Reeves und Alex Winter.
 Da f&auml;llt irgendwo im Film der Name Iron Maiden !
 An der Stelle, wo Bill und Ted die ganzen Geschichts-Hoschis aus dem
 Knast holen wollen, und mit dem Kassetten-Recorder Teds Vater ablenken
 wollen, um ungesehen alle rausuholen.</p>
<br><br><p align=left>
 And every time you think you`re safe<br>
 And when you go to turn away<br>
 You know they`re sharpening all their paper knives.</p>
<br><br>
<p align=center><font size=4 color="ff0000"> !  k e e p   h e a v y  !<br>
 Y O S H I M I T S U </font></p>
</body>
</html>
