<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Kolumni: Mik&auml; saa amigistin tikitt&auml;m&auml;&auml;n?</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:janne.siren@helsinki.fi">janne.siren@helsinki.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><img src="kuvat/janne2.jpg" alt="" height="140" width="130" align="left" border="1">Amigan ymp&auml;rill&auml; hy&ouml;rii t&auml;t&auml; nyky&auml; monenkirjavaa v&auml;ke&auml;. Vaikka j&auml;ljell&auml; ovat en&auml;&auml; kenties fanaattisimmat amigistit, ovat heid&auml;n mielenkiinnonkohteensa ja tietokonetottumuksensa kovin erilaisia. On niit&auml;, jotka edelleen k&auml;ytt&auml;v&auml;t Amigaa ja on niit&auml; jotka eiv&auml;t. Itse lukeudun j&auml;lkimm&auml;isiin, ja haluan seuraavassa jakaa muutaman siihen liittyv&auml;n oivallukseni. En tee yleistyksi&auml; muihin ihmisiin, mutta olen vakuuttunut siit&auml;, etten ole tarinani kanssa aivan yksin.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">K&auml;ytt&auml;j&auml;st&auml; amigistiksi</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Katsoisin muuttuneeni Amiga-k&auml;ytt&auml;j&auml;st&auml; todelliseksi amigistiksi joskus 90-luvun alussa, jotakuinkin AGA-koneiden maihinnousun aikoihin. T&auml;t&auml; ennen k&auml;ytin Amigaa ilolla siin&auml; miss&auml; muutkin, mutta vasta 90-luvun alkuvuosien j&auml;lkeen alkoi massapaine vied&auml; muualle ja todellinen merkkiuskollisuus nostaa p&auml;&auml;t&auml;&auml;n. Pysyin Amigassa, kun kaikki vanhat kaverit valitsivat puhtaasti PC:n.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Muistan ker&auml;&auml;neeni tuolloin Epsilon Indi -nimell&auml; kulkeneeseen purkkiini kaikki mahdolliset vapaassa jakelussa olevat AGA-ohjelmat, joita vain saatoin jostain l&ouml;yt&auml;&auml;, ja perustinpa niit&auml; varten oman alueenkin. Ei sik&auml;li ihmeellist&auml; tai ainutlaatuista aikaansa n&auml;hden, mutta muistan motivaationi silti olleen selke&auml;sti edist&auml;&auml; asialla AGA-laitteiden yleistymist&auml;. Jos AGA-piirist&ouml; n&auml;ytt&auml;isi purkkini tiedostolistassa houkuttelevalta, seh&auml;n ajaisi Amigan asiaa...<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Commodoren konkurssi tuli ja meni, ostin PC:nkin Amigan rinnalle, mutta Commodoren huutokauppa-aikojen mielenkiintoisuus ja ESCOMin ajan muutamat pienet edistysaskeleet pitiv&auml;t minut amigistina ja tuolloin my&ouml;s t&auml;ysip&auml;iv&auml;isen&auml; Amiga-tietokoneen k&auml;ytt&auml;j&auml;n&auml;. N&auml;in uuden tilaisuuden ajaa Amigan asiaa Suomen Amiga-k&auml;ytt&auml;jien unionissa, joka perustettiin vuonna 1993. Saku tavoitti paljon ihmisi&auml;, ja sellaisena se oli oivallinen v&auml;line Amiga-asian edist&auml;miseen. Ei sill&auml; ett&auml; ket&auml;&auml;n huijaamassa oltiin, mutta motivaatio oli selv&auml;sti markkinointihenkinen. Amigan asiaa oltiin ajamassa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Viel&auml;kin merkitt&auml;v&auml;mm&auml;n tilaisuuden ajaa Amigan asiaa sain MikroBitti-pestin my&ouml;t&auml;. Paitsi ett&auml; sain uusia kontakteja, joiden kautta tuoda Amigaa esiin artikkeleissa, p&auml;&auml;sin my&ouml;s kirjoittamaan viel&auml; Sakuakin suuremmalle yleis&ouml;lle Amigasta - ja vaikka journalistisiin ihanteisiin tuli yh&auml; tiukemmin tukeuduttua homman muututtua harrastuksesta ty&ouml;ksi, oli edelleen vakaasti taustalla ilo ajaa Amigan asiaa. Kaikki julkisuus olisi konemerkin tulevaisuudelle hyv&auml;st&auml;, tai n&auml;in siis ajattelin edelleen viime vuosikymmenen k&auml;&auml;nnytty&auml; j&auml;lkipuoliskolleen.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hyvi&auml; esimerkkej&auml; t&auml;st&auml; mielialasta l&ouml;ytyy erityisesti Saku-lehden sivuilta lukuisissa Amigan emoyhti&ouml;n toimia yksityiskohtaisesti ja usein positiivisesti painotetussa valossa tarkastelevissa kirjoituksissani. MikroBitti-lehden puolelta taas erityisest&auml; halustani edist&auml;&auml; Amiga-asiaa kertoivat mm. MBnet-purkkiin tekem&auml;ni laajat jatkotiedostot moneen artikkeliin, esimerkiksi Infinitiv-tornin testiin. Liikuttiin selv&auml;sti syd&auml;men asialla, ja se n&auml;kyi ty&ouml;motivaatiossa aivan erilaisella tavalla kuin muuten.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">J&auml;lkiviisaasti haluaisin uskoa, ett&auml; t&auml;m&auml; usko omaan asiaan - tai omaan kykyyn edist&auml;&auml; sit&auml; - n&auml;kyi ty&ouml;ss&auml;ni erityisesti postiiviisesti. Mieluinen ty&ouml;teht&auml;v&auml; toivottavasti poiki hyvi&auml; tuloksia, eik&auml; sin&auml;ns&auml; ole lainkaan paha asia, mutta j&auml;t&auml;n sen arvioimisen muille.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tunsin edelleen erityisen suurta iloa p&auml;&auml;stess&auml;ni kirjoittamaan Amigasta artikkelin er&auml;&auml;seen keskisuomalaiseen aikakausilehtiliitteeseen Gateway-vuosina. Olihan toki uuteen lehteen kirjoittaminen mukavaa, mutta erityisen mielt&auml;l&auml;mmitt&auml;v&auml;&auml; asiasta teki se, ett&auml; sill&auml; edistettiin taas pienell&auml; tavalla Amigan asiaa. Sama fiilis oli p&auml;&auml;llimm&auml;isen&auml; p&auml;&auml;stess&auml;ni asian tiimoilta televisioonkin. Ei sill&auml;, etteik&ouml; telkkarissa ollut kiva muutenkin piipahtaa, mutta erityisen hienoa oli se, ett&auml; tuhannet suomalaiset katsoivat ohjelmaa Amigasta.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Jotain itse&auml; suurempaa</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Useimmilla ihmisill&auml; on halu kuulua johonkin, olla osa jotain suurempaa. Kaikilla meill&auml; on my&ouml;s erilaisia mielenkiinnonkohteita ja henkil&ouml;kohtaisia toiveita, jotka voivat nivoutua niiden osaksi ja joita sitten ajamme vaihtelevalla aktiivisuudella ja motivaatiolla. Ne ovat harrastuksia, t&ouml;it&auml;, el&auml;m&auml;&auml;, mit&auml; milloinkin. On ilmeist&auml;, ett&auml; minun kasvuvuosiini on liittynyt olennaisena osana halu edist&auml;&auml; jotain asiaa. N&auml;in j&auml;lkiviisaasti voin tunnistaa sen vain joksikin geneeriseksi kl&ouml;ntiksi, jonka p&auml;&auml;lle voidaan l&auml;isk&auml;ist&auml; tavaramerkki &quot;Amiga&quot;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">90-luvun alussa olin jossain yl&auml;-asteen ja lukion v&auml;limaastossa, kun latailin AGA-ohjelmia purkkiini. Nyt on takana l&auml;hes t&auml;ysi m&auml;&auml;r&auml; yliopisto-opintoja, paljon t&ouml;it&auml; ja muuta kasvua - ja tietysti l&auml;hes kymmenen vuotta Commodoren konkurssin j&auml;lkeist&auml; huopaamista ja soutamista. Ik&auml;&auml;kin on sen verran, ett&auml; mummotkin jo kohtelevat t&auml;ysi-ik&auml;isen&auml;. En aivan tarkalleen tied&auml; tai muista, miss&auml; vaiheessa mieleni muuttui, miss&auml; vaiheessa aloin n&auml;hd&auml; asiat toisin. Amiga-laitteistostani ik&auml; j&auml;tti jo ajat sitten, enk&auml; en&auml;&auml; edes aja Amigan asiaa itsetarkoituksena. Silti olen edelleen t&auml;ss&auml; - miksi ihmeess&auml;?<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ajatus l&auml;hti purkautumaan, kun yhdistyksemme tapahtumavastaava Terho Henriksson totesi er&auml;&auml;ss&auml; s&auml;hk&ouml;postissaan, ett&auml; Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on tapa p&auml;&auml;st&auml; toteuttamaan itse&auml;&auml;n. Se oli hyvin sanottu, ja kiitos siit&auml;, Terho. Sit&auml;h&auml;n se yhdistys on paljolti ollut minullekin. Olen vuosien saatossa p&auml;&auml;ssyt toteuttamaan itse&auml;ni journalistinia, tapahtumaj&auml;rjest&auml;j&auml;n&auml;, kirjanpit&auml;j&auml;n&auml;, hallitusvastuullisena, PR-miehen&auml; ja ties kuinka monessa muussa roolissa. L&auml;hes kaikkea t&auml;t&auml; olen sittemmin p&auml;&auml;ssyt hy&ouml;dynt&auml;m&auml;&auml;n my&ouml;s palkallisissa t&ouml;iss&auml;. Se on siis paitsi ollut hauskaa, my&ouml;s kehitt&auml;v&auml;&auml; ja hy&ouml;dyllist&auml;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. on ajanut monessa samaa asiaa kuin vaikkapa opiskelijaj&auml;rjest&ouml;t, joihin yliopisto-opiskelijoita kehotetaan mukaan oppimaan jotain yhteisty&ouml;st&auml; ja vastuunkantamisesta opintojen ohella. Noh, yhteisty&ouml;st&auml; ja vastuunkantamisesta on tosiaan tullut opittua yht&auml; sun toista.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;m&auml; on yksi olennainen syy siihen, miksi olen t&auml;ss&auml; edelleen. Ei kuitenkaan ainoa, enk&auml; oikeastaan usko ett&auml; edes se t&auml;rkein. Toinen syy ovat tietysti ne ihmiset, joita asia ker&auml;&auml; ymp&auml;rilleen. Amiga-piireiss&auml; on paljon kavereita, jotka tekev&auml;t l&auml;htemisest&auml; vastenmielisen ajatuksen. Kukapa nyt yst&auml;vi&auml;&auml;n haluaisikaan hyl&auml;t&auml;. T&auml;m&auml; alkaa olla jo kokolailla t&auml;rke&auml; syy pysytell&auml; kuvioissa, ja sellainen jota olen usein lainannut yhdeksi yhdistyksen kantavista tekij&ouml;ist&auml;. Uskon, ett&auml; sit&auml; se onkin. Mutta muitakin syit&auml; l&ouml;ytyy.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Totuuden l&auml;hteill&auml;</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Raadollisesti voisi kai sanoa, etten min&auml; osaa muutakaan. Tarkoitan, ett&auml; vaikka el&auml;m&auml; tarjoaa nykyisell&auml;&auml;n paljon muitakin haasteita, on vanhaa tapaa vaikea rikkoa. Olen toki v&auml;hent&auml;nyt merkitt&auml;v&auml;sti yhdistykseen liittyvi&auml; velvoitteitani, mutta paljon tulee silti edelleen tehty&auml;. Osa lienee siis vanhaa totuttumusta. Mutta mik&auml; oikeasti, pohjimmiltaan, saa ihmisen, joka ei oikeasti n&auml;e en&auml;&auml; samaa henkil&ouml;kohtaista motivaatiota asiaan (ei k&auml;yt&auml; konemerkki&auml; eik&auml; n&auml;e k&auml;ytt&auml;v&auml;ns&auml; sit&auml; tulevaisuudessa eik&auml; omaa vankkumatonta uskoa asian erinomaisuuteen, tekniikan paremmuuteen), n&auml;enn&auml;isesti ajamaan tuota asiaa?<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Oman asian ajaminen. T&auml;ss&auml; mieless&auml; ympyr&auml; lienee sulkeutunut. Uskoisin, ett&auml; koko muutokseni pelk&auml;st&auml; Amiga-k&auml;ytt&auml;j&auml;st&auml; amigistiksi tapahtui itsekk&auml;ist&auml; syist&auml; - halusta edist&auml;&auml; omaa lempikonemerkki&auml;&auml;n, ja kasvoi siit&auml; edelleen kenties jossain m&auml;&auml;rin ep&auml;itsekk&auml;&auml;ksi arvoksi (joka sai korkeampiakin vivahteita, milloin valinnanvapauden ja milloin korkeamman teknologian tms. edist&auml;miseksi) ja kenties jopa itseisarvoksi. T&auml;m&auml; sai ajamaan asiaa viel&auml; siin&auml;kin vaiheessa, kun itse Amigan k&auml;ytt&ouml; j&auml;i taka-alalle ja loppui lopulta tyystin.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Samalla kun usko asiaan on hiipunut maailman myllerryksess&auml;, ovat tilalle palanneet itsekk&auml;&auml;mm&auml;t l&auml;ht&ouml;kohdat - tai en tied&auml; ovatko ne itsekk&auml;&auml;mpi&auml;, mutta sanotaan kuitenkin arvot, jotka osuvat l&auml;hemm&auml;ksi kotia. Ajaessani Amigan asiaa olen osallistunut merkitt&auml;v&auml;ll&auml; panoksella, pit&auml;isik&ouml; sanoa sivutuotteena, Saku-nimell&auml; kulkevan asian luomiseen. Siin&auml; miss&auml; usko Amigaan on hiipunut, usko t&auml;h&auml;n omaan (minun ja moneen muun, my&ouml;s sinun, arvoisa lukija, yhteiseen) luomukseen on korostunut entisest&auml;&auml;n.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">K&auml;rjist&auml;en ajatuksieni kehitys: Alussa tehtiin Sakua Amigan t&auml;hden. Nyt Amigasta viis, min&auml; teen Sakua - ja Amiga nyt sattuu vain olemaan se &quot;v&auml;ltt&auml;m&auml;t&ouml;n paha&quot;, jonka ymp&auml;rill&auml; asia p&ouml;rr&auml;&auml;. Halu ja toive Amigan s&auml;ilytt&auml;misest&auml; on muovautunut p&auml;&auml;kopassani haluksi s&auml;ilytt&auml;&auml; Saku. Se on kuitenkin se oma luomus, se joka on vain ja ainoastaan meid&auml;n k&auml;siss&auml;mme ja johon lopulta vain me voimme vaikuttaa. En pist&auml;isi lainkaan pahakseni, jos Amiga saisi uutta tuulta purjeisiinsa - mutta en erityisesti Amigan (mit&auml; se sitten nyky&auml;&auml;n en&auml;&auml; tarkoittakaan) t&auml;hden, vaan siksi ett&auml; se edist&auml;isi Sakun asiaa.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Nurinkurista, mutta uskoakseni se t&auml;rkein syy siihen, miksi min&auml; viel&auml; olen seurassanne. Samalla t&auml;m&auml; on my&ouml;s se syy, jonka takia uskon, ett&auml; Sakulla on mahdollisuus olla t&auml;&auml;ll&auml; seurassamme viel&auml; kauan sen j&auml;lkeen, kun Amiga-harrastus on kaikille kaukainen muisto vain. Aika n&auml;ytt&auml;&auml;, millaiseksi Saku muovautuu vuosien saatossa vai muovautuuko miksik&auml;&auml;n, mutta minua ainakin l&auml;mmitt&auml;&auml; ajatus siit&auml; ett&auml; potentiaalia on. Niin kauan kuin sen ymp&auml;rill&auml; parveilee harrastelevia ihmisi&auml;, Sakusta riitt&auml;nee meille tietokonekerhoa, kunnes emme en&auml;&auml; sellaista halua tai jaksa yll&auml;pit&auml;&auml;.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Extrapolointia</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Haluaako joku esitt&auml;&auml; arvauksia, kuinka monella muulla amigistilla tai ex-amigistilla on joku oma &quot;Sakunsa&quot;, jonka takia he viel&auml; roikkuvat mukana? Olen ollut havaitsevinani vastaavia fiiliksi&auml; mm. muutamien Amiga-web-palveluiden yll&auml;pit&auml;jiss&auml;. Palveluita on aikoinaan perustettu Amiga-asian edist&auml;miseen ja tietysti mielenkiintoisena harrastuksena, mutta nykyisin niit&auml; usein yll&auml;pidet&auml;&auml;n vain tottumuksesta ja ennen kaikkea siksi, ett&auml; &quot;lapsi on rakas&quot;.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Se on se halu suojella omaa sijoitusta.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mit&auml; tehd&auml;, kun syyt sijoituksen tekemiseen ovat kadonneet, mutta sijoitus on silti merkitt&auml;v&auml;? Mit&auml; tehd&auml;, kun Amiga ei en&auml;&auml; kiinnosta kuten ennen tai jos usko sen tulevaisuuteen on mennyt, mutta on silti sijoittanut lukuisia satoja tunteja aikaa, kenties tuhansia ja taas tuhansia rahaa ja ennen kaikkea pienen palan syd&auml;nt&auml;&auml;n johonkin asiaan, harrastukseen... harrastukseen, johon ei en&auml;&auml; usko kuten ennen? Pit&auml;isik&ouml; ihmisen vain unohtaa koko juttu ja siirty&auml; uusiin haasteisiin? En tied&auml;, mutta minua ei ainakaan huvita heitt&auml;&auml; omaa &quot;sijoitustani&quot; hukkaan vain siksi, ett&auml; asia jonka takia se on aikanaan tehty on k&auml;rsinyt inflaation. Pist&auml;n mieluummin sijoituksen poikimaan tavalla tai toisella.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">T&auml;rkeint&auml; ei en&auml;&auml; ole Amiga, vaan se oma luomus.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ehk&auml; t&auml;st&auml; pit&auml;isi olla iloinen. Sen sijaan, ett&auml; sokea lammaslauma ajaa jonkin kaukaisen yrityksen asiaa ilman korvausta, se luokin itselleen jotain merkitt&auml;v&auml;&auml;, jotain juuri sille arvokasta, kehitt&auml;v&auml;&auml; ja ennen kaikkea omaa. Siin&auml; on t&auml;m&auml;n kaiken hulluuden keskell&auml; jotain...<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">...tervett&auml;.<br>
							<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Janne Sir&eacute;n<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n perustajaj&auml;sen, entinen varapuheenjohtaja</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Sekalaiset</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>