<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Neues zum AmigaNG</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGANG.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGANG4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Neues zum AmigaNG
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Eyetech ver&ouml;ffentlicht neue Informationen zum AmigaOne</H2>
<P>
Alan Redhouse, Chef des britischen Hardwareherstellers Eyetech, hat vor
kurzem in der AmigaOne-Mailingliste einen neuen Statusbericht zu dem in
Entwicklung befindlichen PPC-Mainboard AmigaOne ver&ouml;ffentlicht:
</P>
<P>
&raquo;Viele K&auml;ufer des Development-Boards wurden eher motiviert vom 10%-Nachlass
als von ihrer F&auml;higkeit, wertvolle Beitr&auml;ge zum Entwicklungsprozess zu
leisten. Die ersten Boards wurden deshalb an Leute ausgeliefert, von denen
wirklich ein Beitrag bei der Entwicklung von Treibern usw. und zur
Portierung der Linux/UAE-Ver&ouml;ffentlichungen zu erwarten war. Ihre Leistung
ist meiner Meinung nach erstaunlich, es wurden innerhalb weniger Wochen
nicht weniger als f&uuml;nf verschiedene Linux-Distributionen (SuSE, Debian,
Mandrake, Yellow Dog and TurboLinux) angepasst.
</P>
<P>
Jedoch weist die freie Firmware Softex, die wir urspr&uuml;nglich mit den
Development-Boards ausgeliefert hatten (man kann sie auch im Pegasos-Video
sehen), einige M&auml;ngel auf (obwohl sie zum Booten der f&uuml;nf Linux-
Distributionen und des OS4-Kernels verwendet werden konnte), und wir
entwickeln/erweitern zur Zeit die alternative freie PPCBoot-Firmware, die
wir bei der Produktion der AmigaOne-Boards verwenden werden. Damit werden
wir Amiga-spezifische Boot- und weitere Optionen einbauen k&ouml;nnen ebenso wie
eine noch umfassendere Multi-Boot-Einrichtung.
</P>
<P>
Wir liefern die &uuml;brigen Development-Boards (oder erste User-Boards) nicht
aus, bevor dieser Code fertig ist, um die Kosten f&uuml;r die Nachlieferung der
Update-ROMs und der Chip-Auswechselwerkzeuge zu sparen. Wir erwarten, dass
das bis Ende August so weit sein wird.
</P>
<P>
Diese Korrektur des Boot-ROM wird von Hyperion als Teil der notwendigen
Arbeiten zum Booten des OS 4 auf dem A1 erledigt.
</P>
<P>
Inzwischen erkennen wir an der Initiative von AMIGA, Inc. f&uuml;r den Club-
Beitritt/Coupon-Erwerb (verbunden mit unseren eigenen Markt-Auswertungen),
dass f&uuml;r die Zukunft des AmigaOne absolut keine Zweifel bestehen.
</P>
<P>
Schlie&szlig;lich m&ouml;chte ich noch auf die Fragen einiger Leute eingehen, die
wissen wollten, warum wir das A1-Board nicht vor der Ver&ouml;ffentlichung von
OS 4 an Linux-Anwender ausliefern. Nun, daf&uuml;r gibt es zwei Hauptgr&uuml;nde:
</P>
<P>
1 - Es handelt sich um ein Produkt, das f&uuml;r den Amiga-Markt gebaut wird,
und meiner Meinung nach geh&ouml;rt es sich, dass die Amiga-Gemeinschaft es
zuerst in die Hand bekommt.
</P>
<P>
2 - Ich kann &uuml;berhaupt nicht erkennen, dass ein bedeutender Markt f&uuml;r Linux
auf dem A1 bestehen k&ouml;nnte, wenn ber&uuml;cksichtigt wird, dass die Haupt-
Zielrichtung von Linux die x86-Plattform ist, welche - allein durch die
H&ouml;he ihrer Verkaufszahlen - immer um eine Gr&ouml;&szlig;enordnung billiger sein wird
als ein Produkt, das auf PPC aufbaut.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="AMIGANG4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
