<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<B>Der Sommer ist &raquo;gegessen&laquo; - das Warten geht weiter (von Carsten Schr&ouml;der)</B>
</P>
<P>
Waren einige Anwender bislang noch zuversichtlich, dass ihre favorisierten
Amiga-Nachfolgeprojekte AmigaOne &amp; AmigaOS 4.0 bzw. Pegasos &amp; MorphOS in
den n&auml;chsten Wochen endlich erscheinen werden, so hat sich diese Hoffnung
vor kurzem einmal mehr zerschlagen. Nun hei&szlig;t es offiziell: Entwicklung
A(miga) soll zu Weihnachten verf&uuml;gbar sein, Entwicklung B(plan) im
September - man beachte aber das W&ouml;rtchen &quot;soll&quot;. Denn nachdem die beiden
Projekte in der Vergangenheit schon etliche Male angeblich &quot;kurz vor ihrem
Erscheinen&quot; standen und doch nie erschienen sind, ist es keineswegs sicher,
dass die neuen Termine nun endlich eingehalten werden. Ich zumindest gehe
davon aus, dass es auch auf der Aachener Amiga-Messe im Dezember lediglich
&quot;Anschauungsobjekte&quot;, aber keinen erwerbbaren PPC-Rechner inklusive
(partiell) PPC-natives Betriebssystem geben wird. Ich bin gespannt, ob sich
mein Pessimismus bewahrheitet...
</P>
<P>
Apropos Aachen: Jedes Jahr, wenn der Standort der kommenden Amiga-Messe
bekannt gegeben wird, sehe ich mich aufs Neue gezwungen, ihn zu
kritisieren - so auch diesmal. Schon K&ouml;ln und Neuss hielt ich f&uuml;r alles
andere als optimal, was die Austragung der einzigen deutschen Amiga-Messe
betrifft. Aachen setzt dem Ganzen die sprichw&ouml;rtliche Krone auf: Diese
geschichtstr&auml;chtige Stadt liegt im westlichsten Bereich Deutschlands, so
dass wesentliche Teile der Amiga-Anwender, insbesondere in den &ouml;stlichen
Bundesl&auml;ndern inklusive der 4-Millionen-Einwohner-Stadt Berlin und auch in
Polen, wo der relative Anteil an Amiga-Anwendern verh&auml;ltnism&auml;&szlig;ig gro&szlig; ist,
quasi von vornherein von der Messe ausgeschlossen werden. Denn man kann es
nun wirklich niemandem zumuten, zweimal eine Sechs-Stunden- oder gar
l&auml;ngere Fahrt zu unternehmen, wom&ouml;glich noch am selben Tag hin und zur&uuml;ck -
zumal es ja auch anders ginge: Frankfurt oder Hannover w&auml;ren keine
schlechte Wahl, und geradezu optimal w&auml;re Kassel, eine Stadt in der Mitte
Deutschlands mit einer sehr guten Verkehrsanbindung und vielen geeigneten
R&auml;umlichkeiten, die auch f&uuml;r Nordlichter und &quot;Bazis&quot; in akzeptabler Zeit
erreichbar ist. Auch ein Messeveranstalter m&uuml;sste einsehen, dass der Erfolg
seines Events (also die Besucherzahl), an dem ja gerade er interessiert
sein muss, ma&szlig;geblich von dessen Austragungsort abh&auml;ngt.
<BR>
Der von einigen Usern jedes Jahr gern verwendete Slogan &quot;Seid froh, dass es
&uuml;berhaupt wieder eine Messe gibt!&quot; kann auch nicht als Argument herhalten,
denn je erfolgreicher eine Messe ist, desto wahrscheinlicher ist es, dass
auch im darauffolgenden Jahr wieder eine abgehalten wird, so dass &uuml;berhaupt
nichts dagegen spricht, einen ung&uuml;nstigen Veranstaltungsort zu kritisieren -
im Gegenteil.
<BR>
Aber was soll's, die Entscheidung f&uuml;r Aachen ist nun mal gefallen - bleibt
nur meine (allerdings nicht allzu gro&szlig;e) Hoffnung, dass im n&auml;chsten Jahr -
endlich mal - ein f&uuml;r alle in Deutschland lebenden Amiga-User akzeptabler
Austragungsort gew&auml;hlt wird.
</P>
<P><B>Bis zum n&auml;chsten Mal,</B></P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
