<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Spieleteil (von Wolfgang Hosemann und J&uuml;rgen Theiner)</H1>
<H2>1. Vorwort</H2>
<P>
Tja, scheinbar gibt es das &quot;Sommerloch&quot; nicht nur f&uuml;r die herk&ouml;mmlichen
Medien. Auch der Amiga ist davon betroffen, denn diesen Monat gab es nur
sehr wenige Neuigkeiten in Bezug auf Spiele.
</P>
<P>
Als (G)Oldie haben wir diesmal &quot;Pirates!&quot; von Microprose gew&auml;hlt, ein sehr
ausbauf&auml;higes Spiel und Konzept. Wie ich feststellen konnte, gibt es auch
hier im Internet eine rege Fangemeinde, und es hat sogar jemand ein
inoffizielles Remake namens &quot;Pirates II&quot; (sehr origineller Titel, g&auml;hn ;) )
auf die Beine gestellt. Das hat mich auf folgenden Gedanken gebracht: Seit
AmiBlitz (Blitz Basic) frei verf&uuml;gbar ist, ist doch eigentlich f&uuml;r
jedermann (so er denn ein bisschen programmieren kann) die M&ouml;glichkeit
gegeben, Spiele dieser Art auf die Beine zu stellen. Nat&uuml;rlich ist das kaum
machbar, wenn man Einzelk&auml;mpfer ist. Ein Team sollte es aber hinkriegen,
und je mehr &Uuml;bung so ein Team hat, desto schneller sind neue Spiele
fertiggestellt. Jetzt fehlen also nur noch teamf&auml;hige Leute...
</P>
<P>
Das bringt mich auf den zweiten Gedanken: Wo ist der Teamgeist unter den
Amiga-Fans geblieben? Sicher, er ist noch da, aber er versteckt sich. Meine
Erfahrung ist bisher, dass kaum jemand Lust hat, mit mehreren Leuten ein
Spiel f&uuml;r den Amiga in guter bis sehr guter Qualit&auml;t zu produzieren. Das
liegt haupts&auml;chlich an den (scheinbar) fehlenden M&ouml;glichkeiten, damit Geld
zu verdienen. Seien wir aber mal ehrlich: Sehen die M&ouml;glichkeiten im
Windows-Bereich wirklich so viel besser aus? Wimmelt es da nicht von
professionellen Teams, die den Markt quasi vollst&auml;ndig in der Hand haben?
Bleibt den allermeisten Beginner-Teams letztendlich noch etwas anderes
&uuml;brig als ein Freeware-Release? Ist es nicht so, dass man mit Spielen f&uuml;r
den Amiga wenigstens ein paar Euro einnehmen kann? Sicher, _verdienen_ kann
man kaum etwas, aber das ist nicht das Hauptthema meiner Anregung.
</P>
<P>
Mir geht es darum, die Anzahl der Spiele-Neuerscheinungen zu steigern, um
wenigstens etwas Attraktivit&auml;t zu gewinnen. Die Gegenargumente sind mir
bekannt, sie zielen haupts&auml;chlich auf die technische Seite eines Spiels.
Aus Erfahrung kann ich aber sagen, dass es nicht immer 3D sein muss, um ein
spa&szlig;iges Spiel zu bekommen...
</P>
<P>
Also, sucht euch Gleichgesinnte, probiert es, macht es, ver&ouml;ffentlicht es!
Es wird Zeit, dass man mit dem Amiga wieder Spielspa&szlig; erleben kann.
</P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
