<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>4. Oldies but Goldies: &raquo;Pirates!&laquo;</H2>
<P><B> <A HREF="img/pirates1.png"><IMG SRC="thumb/pirates1.jpg" WIDTH="120" HEIGHT="67" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
&quot;Piraten!&quot; war im 17. Jahrhundert in der karibischen See ein Ausruf, der
Schwierigkeiten der &uuml;belsten Art ank&uuml;ndigte. Kein Handelsschiff war sicher
vor den blut- und profitd&uuml;rstenden Gesellen, die halbnackt, Enterbeile und
Messer schwingend, enterten.
</P>
<P>
Zu dieser Zeit stand die Karibik zum gr&ouml;&szlig;ten Teil unter spanischem
Einfluss, und die Silber- und Goldvorkommen in S&uuml;damerika waren ein
st&auml;ndiger Zankapfel f&uuml;r die Seefahrernationen Europas. Neben den Spaniern
hatten sich Engl&auml;nder, Franzosen und die Niederl&auml;nder in der Karibik
festgesetzt. Im Gefolge der &quot;offiziellen&quot; Truppen kamen jede Menge
heruntergekommene Gestalten, Verbrecher, Verfolgte und abenteuerlustige
Leute in die Karibik.
</P>
<P><B> <A HREF="img/pirates2.png"><IMG SRC="thumb/pirates2.jpg" WIDTH="120" HEIGHT="67" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
&quot;Pirates!&quot; von Microprose nimmt sich dieses Themas an und bringt ein
bisschen Karibik in Form eines Strategiespiels auf unseren Amiga.
</P>
<P>
Zu Beginn des Spiels ist der Spieler noch ein mittelloser Europa-Fl&uuml;chtling
auf der Suche nach seinem pers&ouml;nlichen Gl&uuml;ck. Er kann unter den vier
haupts&auml;chlich vertretenen Nationalit&auml;ten w&auml;hlen. Diese Wahl macht sich
nat&uuml;rlich auch im Spiel bemerkbar, je nach gew&auml;hlter Nationalit&auml;t f&auml;llt es
leichter, Matrosen anzuwerben, Kaperbriefe zu bekommen, die Beute teuer zu
verkaufen und noch einiges mehr.
</P>
<P>
Hat man erst mal ein Schiff und ein paar Leute als Mannschaft, kann es
prinzipiell losgehen. Allerdings sollte man nicht vergessen, dass die
Mannschaft nicht nur von Luft und Liebe lebt, sondern nat&uuml;rlich futtern und
trinken muss und hin und wieder auch gern mal ein Gelage feiert. Wein, Weib
und Gesang ist die Devise des &quot;ordentlichen&quot; Piraten. Vergisst man diese
Tatsache, kann es schnell dazu kommen, dass die Mannschaft meutert und Ihre
Abl&ouml;sung als Kapit&auml;n fordert. Auch fehlende Beute und monatelange
ereignislose Reisen k&ouml;nnen Meuterei f&ouml;rdern. Ein paar Mal k&ouml;nnen Sie das
Abl&ouml;se-Gesuch der Mannschaft mit Hilfe des Degens vielleicht ablehnen, aber
st&auml;ndig geht das nicht gut...
</P>
<P><B> <A HREF="img/pirates3.png"><IMG SRC="thumb/pirates3.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
Man begibt sich also auf die Reise und trifft auf das erste Schiff. Was
tun? Nun, als professioneller Schiffspl&uuml;nderer sollte man zusehen, diesem
Schiff den Weg abzuschneiden und es zu entern. Nat&uuml;rlich wehrt sich der
Gegner, man sollte also erst mal mit Hilfe der Bordkanonen die gegnerische
Besatzung sturmreif schie&szlig;en und schlie&szlig;lich entern. Es kann passieren,
dass sich der Kapit&auml;n des generischen Schiffs nicht kampflos ergeben will,
und so sind Sie als Kapit&auml;n gefordert, den Gegner mit dem Degen zur
Vernunft zu bringen. Ist das geschafft, kann es ans Sichten der Beute
gehen.
</P>
<P><B> <A HREF="img/pirates4.png"><IMG SRC="thumb/pirates4.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
Es ist kaum zu glauben, aber bei den Piraten ging es schon ziemlich
demokratisch zu. Die Beute wurde (meistens) gerecht geteilt, daher muss
nat&uuml;rlich erst einmal festgestellt werden, was der Meute denn so an
Wertsachen ins Netz gegangen ist. Ist das erledigt, geht die Suche nach
Beute weiter.
</P>
<P>
Man fragt sich jetzt vielleicht, weshalb man sich zu Beginn eine
Nationalit&auml;t aussuchen musste. Es gibt in diesem Spiel neben der
praktischen auch eine politische Seite. Man kann ab und an einen Gouverneur
besuchen und versuchen, Kaperbriefe zu bekommen, die einem einen
halblegalen Status und politischen Ruf verschaffen k&ouml;nnen. Man bekommt
meist den Auftrag, die Schiffe einer verfeindeten Nation anzugreifen und
dem &quot;Feind&quot; (meist war das Spanien) m&ouml;glichst viel Schaden zuzuf&uuml;gen. Ist
man hierbei recht erfolgreich, steigt das Ansehen der eigenen Person in der
&quot;Heimat&quot;. Irgendwann bekommt man die M&ouml;glichkeit, die Tochter des
Gouverneurs zu ehelichen und den eigenen Stand noch weiter zu erh&ouml;hen. Das
hat ganz nebenbei auch Vorz&uuml;ge im monet&auml;ren Bereich. Man ist ja schlie&szlig;lich
in die Karibik gekommen, um Reichtum und Ansehen zu erwerben...
</P>
<P><B> <A HREF="img/pirates5.png"><IMG SRC="thumb/pirates5.jpg" WIDTH="120" HEIGHT="75" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
Apropos Reichtum und Ansehen: Ganz in der Manier eines Francis Drake kann
man auch die St&auml;dte an der K&uuml;ste und im Hinterland pl&uuml;ndern, sofern die
eigene Mannschaft gro&szlig; genug und halbwegs guter Laune ist. Sollte man dies
im Auftrag (s)einer Majest&auml;t tun, wachsen nat&uuml;rlich auch Ansehen und
Reichtum um einiges mehr.
</P>
<P>
Der Spieler hat aber ebenso die M&ouml;glichkeit, auf Nationalit&auml;t und
politisches Ansehen zu pfeifen und seinen eigenen Verein aufzumachen. Man
kann auf eigene Rechnung operieren, was manchmal von Vorteil sein kann.
Viele Gouverneure sind nicht besonders ehrlich zu Piraten und kochen hin
und wieder ihr eigenes S&uuml;ppchen. Manchmal landet der Spieler als Einlage in
diesem, sprich: wird festgenommen und gehenkt.
</P>
<P>
&quot;Pirates!&quot; ist als Strategiespiel mit offenem Ende und h&ouml;chster Spieltiefe
bekannt geworden, das auch heute noch seine Fans hat. Ein Blick in diverse
Suchmaschinen des Internets sagt alles. Jede Menge Seiten, die &quot;Pirates!&quot;
zum Thema haben. Wer Interesse an diesem Klassiker der Strategiespiele hat,
sollte sich diese Seiten einmal ansehen. Nat&uuml;rlich ist &quot;Pirates!&quot; auch in
den bekannten Download-Archiven zu finden, so dass man sich diesen
Klassiker auch erspielen kann. Also, den &quot;Jolly Roger&quot; (die Totenkopf-
Flagge, aber die kennt eigentlich jeder, oder?) gehisst und frohen Mutes
auf Beutefang gegangen!
</P>
<P><B>Wolfgang Hosemann &lt;<A HREF="mailto:whose@gmx.de">whose@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
