<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Workshop: Ein Fall f&uuml;r den Hobby-Elektr(on)iker (von Uwe Pannecke)</H2>
<P><B>Ruhig gestellte L&uuml;fter</B></P>
<H3>1. Krachmacher im Amiga</H3>
<P>
Die L&uuml;fter der Amiga-2000/3000/4000-Netzteile laufen standardm&auml;&szlig;ig mit
maximaler Drehzahl. Dies sorgt zwar f&uuml;r eine in fast allen F&auml;llen mehr als
ausreichende K&uuml;hlung, verursacht aber oftmals relativ viel L&auml;rm durch
intensiv rauschende L&uuml;fterr&auml;der. Die Strombelastung der Netzteile und eine
damit verbundene W&auml;rmeentwicklung d&uuml;rfte in vielen Systemkonfigurationen so
gering sein, das der L&uuml;fter auch mit einer wesentlich niedrigeren Drehzahl
eine ausreichende K&uuml;hlung aller betreffenden Baugruppen sicherstellen
w&uuml;rde.
</P>
<P><B>Dies ist der Ansatzpunkt f&uuml;r die nachfolgende Hardwarebastelei:</B></P>
<H3>2. Gegenmittel</H3>
<P>
Mit Hilfe einer temperaturgef&uuml;hrten elektronischen L&uuml;ftersteuerung kann
das beschriebene akustische Problem relativ kosteng&uuml;nstig, effektiv und
h&ouml;rbar entsch&auml;rft werden. Und neben der ungleich geringeren L&auml;rmbelastung
wird nebenbei eine Schonung des L&uuml;fters (geringerer Verschlei&szlig; der bewegten
Teile) erreicht.
</P>
<P>
Verursachen sp&auml;ter hinzugef&uuml;gte Systemerweiterungen eine h&ouml;here
Stromentnahme und damit h&ouml;here W&auml;rmeentwicklung im Netzteil, wird dies von
der L&uuml;ftersteuerung automatisch ber&uuml;cksichtigt.
</P>
<P>
Zwei in den Netzteilen eines Amiga 2000 und eines externen SCSI-Geh&auml;uses
einer Syquest-Wechselplatte verbaute L&uuml;ftersteuerungen haben sich &uuml;ber
Monate bew&auml;hrt und als zuverl&auml;ssig erwiesen.
</P>
<H3>3. Beschreibung der elektronischen Baugruppe</H3>
<P>
Um den Aufwand so gering wie m&ouml;glich zu halten, wurde eine fertige
Baugruppe aus dem vielen Elektronik-Bastlern Deutschlands wohlbekannten
ELV-Angebot [1] ausgew&auml;hlt und in das jeweilige Netzteil eingesetzt. Die
ELV Elektronik AG liefert mit dem Bausatz &quot;Elektronische L&uuml;ftersteuerung&quot;
neben Leiterplatte und Elektronikteilen eine
</P>
<P><B> <A HREF="img/platine.jpg"><IMG SRC="thumb/platine.jpg" WIDTH="91" HEIGHT="96" ALT="Bild"  BORDER="0"></A></B></P>
<P>
detaillierte Funktionsbeschreibung, einschlie&szlig;lich Abbildungen zum
Stromlauf- und Best&uuml;ckungsplan der Platine und zur fertig aufgebauten
Schaltung, sowie eine St&uuml;ckliste mit. Die verwendete Platine besitzt eine
Gr&ouml;&szlig;e von lediglich 41 * 32 mm und l&auml;sst sich so auch unter beengten
Verh&auml;ltnissen in das Netzteil integrieren.
</P>
<P>
Kurz zur Funktionsweise der Schaltung:
Im Einschaltmoment ist der Widerstandswert des Temperaturf&uuml;hlers so gering,
dass das L&uuml;fterrad steht. Steigt die Temperatur am F&uuml;hler auf ca. 45 - 50
Grad Celsius, l&auml;uft das L&uuml;fterrad an und erreicht bei etwa 60 - 65 Grad
Celsius seine maximale Drehzahl.
</P>
<P><B> <A HREF="img/schaltplan.jpg"><IMG SRC="thumb/schaltplan.jpg" WIDTH="120" HEIGHT="87" ALT="Bild"  BORDER="0"></A></B></P>
<P>
Meist reduziert sich die Drehzahl des L&uuml;fterrades nach Anlauf auf Grund der
vorhandenen Anlaufschwelle und der einsetzenden K&uuml;hlung sogar wieder.
Durch eine gleitende Charakteristik des Nachregelvorgangs wird eine optimal
auf den K&uuml;hlungsbedarf abgestimmte L&uuml;fterdrehzahl erreicht.
</P>
<P>
Soweit zum grunds&auml;tzlichen Verst&auml;ndnis, f&uuml;r ausf&uuml;hrlichere Beschreibungen
siehe auch die dem Bausatz beigelegten Unterlagen.
</P>
<H3>4. Einbau der Baugruppe am Beispiel eines A2000-Netzteils</H3>
<P>
Ist die Platine best&uuml;ckt und verl&ouml;tet, kann der Einbau erfolgen. Durch die
sehr geringen Platinen-Abmessungen der Baugruppe wird die Platine direkt in
das Netzteil integriert.
</P>
<P>
ACHTUNG:
Bei Eingriff in das Netzteil erlischt eine eventuell vorhandene Garantie.
</P>
<P>
Und ein zweites, noch energischeres ACHTUNG:
Einige Kontakte im Netzteil f&uuml;hren 230V, also w&auml;hrend der Bastelarbeiten
das Netzteil unbedingt stromlos machen!
</P>
<P>
Deutlich sei auf den (makaberen) Spruch verwiesen:
Was ist schwarz und liegt in der Ecke? Ein Hobby-Elektriker!
Also nochmals: Vorsicht!
</P>
<P>
F&uuml;r die Befestigung der Platine wurde die rechte Abschirmwand des A2000-
Netzteils (von den Laufwerken aus gesehen) genutzt.
</P>
<P>
Der Temperaturf&uuml;hler wird am K&uuml;hlk&ouml;rper des 5V-Spannungsreglers auf der dem
L&uuml;fter abgewandten Seite angebracht. So ist einerseits das Element der
intensivsten W&auml;rmeentwicklung &uuml;berwacht und andererseits der
Temperaturf&uuml;hler nicht dem direkten Luftstrom ausgesetzt. Letzteres
verhindert so eine Verf&auml;lschung des Messergebnisses.
</P>
<P>
Die thermische Kopplung von K&uuml;hlk&ouml;rper und Temperaturf&uuml;hler stellt ein
Befestigungsblech sicher, welches mit Hilfe einer M3-Schraube in der runden
Aussparung des K&uuml;hlk&ouml;rpers verankert wird und damit den F&uuml;hler an den
K&uuml;hlk&ouml;rper presst. Wer dieser Art der Befestigung mit Misstrauen
gegen&uuml;bersteht, kann auch auf Nummer Sicher gehen und mit ein paar Tropfen
geeignetem Kleber zus&auml;tzlich den Temperaturf&uuml;hler befestigen.
</P>
<P>
F&uuml;r die elektrische Verbindung der L&uuml;ftersteuerung mit dem L&uuml;fter selbst
werden nun die L&uuml;fterzuleitungen aufgetrennt und das vom L&uuml;fter kommende
rote Leitungsende (der positive Anschluss) mit dem Anschluss &quot;ST3&quot; der
Steuerungs-Platine sowie das vom L&uuml;fter kommende blaue Leitungsende (der
negative Anschluss) mit dem Anschluss ST4 auf der Platine verbunden.
</P>
<P><B> <A HREF="img/schaltplan.jpg"><IMG SRC="thumb/schaltplan.jpg" WIDTH="120" HEIGHT="87" ALT="Screenshot"  BORDER="0"></A></B></P>
<P>
Das vom Netzteil zum L&uuml;fter f&uuml;hrende rote Leitungsende ist mit dem
Anschluss &quot;ST1&quot; und das vom Netzteil zum L&uuml;fter f&uuml;hrende blaue Leitungsende
mit dem Anschluss &quot;ST2&quot; auf der Steuerungsplatine zu verbinden.
</P>
<P>
Damit ist die Integration der elektronischen L&uuml;ftersteuerung abgeschlossen.
Mit einem anschlie&szlig;enden Probelauf nach Komplettierung des Rechners sollte
die Funktion der Steuerung &uuml;berpr&uuml;ft werden.
</P>
<H3>5. Bezugsm&ouml;glichkeiten</H3>
<P>
Der Komplettbausatz ist bei ELV mit der Artikel-Nr. 68-085-49 und der
Bezeichnung &quot;Elektronische L&uuml;ftersteuerung' f&uuml;r 7,65 Euro online [1] (in
der Sektion &quot;SHOP&quot; mit dem Suchbegriff '68-085-49' gar nicht zu verfehlen)
oder per Post [2] erh&auml;ltlich.
</P>
<H3>6. Wichtiger Hinweis</H3>
<P>
Ein Nachbau und Einsatz der vorgestellten L&uuml;fter-Drehzahlsteuerung erfolgt
auf eigene Gefahr. Sollten im Zusammenhang mit dem Nachbau oder Einsatz der
oben vorgestellten Drehzahlsteuerung eines L&uuml;fters Sch&auml;den an Personen oder
Ger&auml;ten entstehen, lehnt der Autor dieses Beitrags daf&uuml;r jede Haftung ab.
</P>
[1] <A HREF="http://www.elv.de" TARGET="_top">http://www.elv.de</A><BR>
[2] ELV Elektronik AG, Postfach, 26787 Leer<BR>
<P><B>Uwe Pannecke &lt;<A HREF="mailto:Uwe.Pannecke@t-online.de">Uwe.Pannecke@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
