<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Workshops
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Workshop: PageStream 4.1 im Einsatz (von Michael Christoph)</H2>
<P>
Nachdem die neuen Funktionen von PageStream 4.1 noch nirgends nachzulesen
sind (auch das englische Handbuch hat immer noch den Stand 4.0), wollen wir
uns die Funktionen etwas genauer betrachten. Aufgrund der fehlenden
Anleitung beruhen die folgenden Zeilen auf meinen pers&ouml;nlichen Erfahrungen.
</P>
<H3>* Was gibt es Neues?</H3>
<P>
Auf eine Vorstellung der neuen Funktionen von PageStream 4.1 und des
Programms selbst werde ich hier verzichten. Sie sind in den verschiedenen
Amiga-Printmedien zu finden. Nur kurz eine Liste der Neuerungen:
</P>
<UL>
<LI> vielf&auml;ltiger Tabelleneditor
</LI>
<BR><LI> eingebaute Serienbrieffunktion
</LI>
<BR><LI> PDF-Export mit Einstellung von Kompression und Kodierung
</LI>
<BR><LI> Textrahmen mit w&auml;hlbaren Ecken
</LI>
<BR><LI> w&auml;hlbare Spaltenbreite und Innenabstand
</LI>
<BR><LI> Textauswahl mit Shift+Cursor
</LI>
<BR><LI> Bewegen von Seiten &uuml;ber Kapitelgrenzen
</LI>
<BR><LI> Verschieben und Kopieren von Objekten &uuml;ber Seitengrenzen
</LI>
<BR><LI> Verbesserung der Geschwindigkeit
</LI>
<BR><LI> und einiges mehr
</LI>
</UL>
<H3>* Der Tabelleneditor</H3>
<P>
(Pseudo-)Tabellen konnten bisher auch schon in PageStream erzeugt werden.
Sie setzen sich aber aus einzelnen Linien und den Texten zusammen und waren
dadurch starr und erlaubten keinerlei nachtr&auml;gliche &Auml;nderung (ohne gr&ouml;&szlig;erem
Aufwand). Der neue Tabelleneditor kann hierbei nat&uuml;rlich gl&auml;nzen. Er kann
praktisch jede Art von gew&uuml;nschter Tabelle darstellen.
</P>
<P><B> <A HREF="img/ps41_tabellenicon.png"><IMG SRC="thumb/ps41_tabellenicon.jpg" WIDTH="120" HEIGHT="96" ALT="Icon für neue Tabelle erstellen"  BORDER="0"></A></B></P>
<P>
Nach der Auswahl des zutreffenden Icons aus der Toolleiste wird ein Rahmen
aufgezogen, der die Gr&ouml;&szlig;e der Tabelle festlegt. Standardm&auml;&szlig;ig mit vier
Spalten und vier Zeilen erzeugt, k&ouml;nnen beliebig Spalten und Zeilen
hinzugef&uuml;gt oder entfernt werden. Die Gr&ouml;&szlig;e der Tabelle &auml;ndert sich hierbei
nicht. Nur die Breite bzw. H&ouml;he der Spalten und Zeilen wird angepasst.
Benachtbarte Felder lassen sich verbinden, so dass sie zu einem gr&ouml;&szlig;eren
Feld werden (z.B. alle Felder der ersten Zeile zu einer langen
&Uuml;berschriftzeile). Jedes Feld f&uuml;r sich ist ein kleiner Textrahmen, der alle
gewohnten Funktionen zur Verf&uuml;gung stellt: Schriftart, -gr&ouml;&szlig;e, Ausrichtung,
Farbe, etc. Des weiteren k&ouml;nnen auch die Rahmenlinien jedes einzelnen
Feldes unabh&auml;ngig voneinander gestaltet werden. Vor allem Rahmenst&auml;rke,
Muster und Farbe seien hier beispielhaft aufgef&uuml;hrt.
</P>
<H3>* Mehr als ein Tabelleneditor</H3>
<P>
Mit der reinen tabellarischen Visualisierung ist das Ende des
Tabelleneditors erreicht, und es beginnen die weiteren M&ouml;glichkeiten als
Tabellenkalkulation. Dadurch werden die Tabellen noch flexibler einsetzbar.
Die meisten kennen sicher den Begriff der Tabellenkalkulation von Excel
oder auch TurboCalc am Amiga. PageStream m&ouml;chte hier keinesfalls in
Konkurrenz zu diesen Produkten treten. Aber die grundlegenden Funktionen
bietet PageStream trotzdem an: Felder adressieren und dynamisch berechnete
Feldinhalte.
</P>
<P><B> <A HREF="img/ps41_tabelle.png"><IMG SRC="thumb/ps41_tabelle.jpg" WIDTH="93" HEIGHT="96" ALT="Mehr als ein Tabelleneditor"  BORDER="0"></A></B></P>
<P>
Die Spalten werden von links beginnend mit A, B, C... benannt, w&auml;hrend die
Zeilen von oben beginnend mit 1, 2, 3... gekennzeichnet sind. Das erste
Feld links oben ist also &quot;A1&quot;, das Feld rechts davon &quot;B1&quot; und das Feld
unterhalb &quot;A2&quot;. Die Summe aus den ersten drei Feldern der ersten Zeile
k&ouml;nnte somit mittels &quot;=A1+B1+C1&quot; gebildet werden. Die Grundrechenarten
stehen hierbei zur Verf&uuml;gung. Ob es weitere Operatoren und Funktionen gibt,
ist nicht bekannt.
</P>
<P><B> <A HREF="img/ps41_tabellenwert.png"><IMG SRC="thumb/ps41_tabellenwert.jpg" WIDTH="120" HEIGHT="24" ALT="Zahleneingabe nur im Wert-Feld"  BORDER="0"></A></B></P>
<P>
Beachtet werden muss, dass auch die Zahlenwerte der Felder nicht direkt in
die Tabelle eingetragen werden d&uuml;rfen, sondern im Feld &quot;Wert&quot; des
Einstellfensters. Die Eingaben werden dann automatisch auch in der Tabelle
angezeigt, und gleichzeitig werden ggf. die anderen Felder aktualisiert.
Die so erfassten Zahlen k&ouml;nnen beliebig in der Tabelle bearbeitet und
formatiert werden. Sp&auml;testens nach einer Neuberechnung oder
Werteneueingabe, gehen die Formatierungen wieder verloren, und es steht nur
die &quot;nackte&quot; Zahl im Feld. Hier sind noch Verbesserungen f&uuml;r zuk&uuml;nftige
Versionen in Aussicht gestellt worden.
</P>
<H3>* Serienbrief an alle</H3>
<P>
Die M&ouml;glichkeiten des Serienbriefes sollen anhand einer Einladungskarte
vorgestellt werden. Diese Funktion erm&ouml;glicht es sehr flexibel, dass die
Einladung nur noch einmal verfasst werden muss und an viele verschiedene
Personen geschickt werden kann. Das geht jetzt nat&uuml;rlich auch schon, wenn
die Einladung allgemeing&uuml;ltig verfasst wird und die Anschrift nur auf dem
Kuvert steht. Wir wollen allerdings pers&ouml;nlicher werden. Die Vorgehensweise
l&auml;sst sich in drei Schritte aufteilen:
</P>
<UL>
<LI> Erster Schritt: Erstellen der Einladung
</LI>
<BR><LI> Zweiter Schritt: Erfassen der Empf&auml;nger
</LI>
<BR><LI> Dritter Schritt: Drucken der Einladungen
</LI>
</UL>
<P>
Der erste Schritt stellt nichts Neues f&uuml;r Benutzer von PageStream dar, bis
auf einen Punkt: Es d&uuml;rfen keine pers&ouml;nlichen Anreden enthalten sein und
auch keine Adressen. Allerdings sind Platzhalter f&uuml;r diese Teile
vorzusehen, in die PageStream beim Druck dann selbst&auml;ndig die Texte
einf&uuml;gt. Platzhalter sind zuerst mittels &quot;Typographie/Einf&uuml;gen/Variabler
Text&quot; zu definieren.
</P>
<P><B> <A HREF="img/ps41_platzhalter.png"><IMG SRC="thumb/ps41_platzhalter.jpg" WIDTH="120" HEIGHT="49" ALT="Platzhalter definieren"  BORDER="0"></A></B></P>
<P>
&Uuml;ber dieses Fenster kann auch ein Eintrag ausgew&auml;hlt werden, der im Text
eingesetzt wird. Beim Definieren des Platzhalters ist diesem ein Name zu
verpassen (der nat&uuml;rlich eindeutig sein muss und selbsterkl&auml;rend sein
sollte), und zus&auml;tzlich kann auch gleich ein Pseudotext hinterlegt werden,
der dann am Bildschirm angezeigt wird. Ich empfehle hier die Notation
&quot;{feldbezeichner}&quot;. Also wenn das Feld den Namen des Empf&auml;ngers enthalten
soll und mit &quot;name&quot; bezeichnet wird, ist der Text &quot;{name}&quot;. Am Bildschirm
wird dann an der entsprechenden Stelle &quot;{name}&quot; angezeigt. Beim sp&auml;teren
Druck setzt hier PageStream den tats&auml;chlichen Namen aus der
Serienbriefdatei ein und layoutet ggf. neu.
</P>
<P><B> <A HREF="img/ps41_einladung.png"><IMG SRC="thumb/ps41_einladung.jpg" WIDTH="120" HEIGHT="87" ALT="Die Einladungskarte am Bildschirm"  BORDER="0"></A></B></P>
<P>
Nehmen wir jetzt an, die Einladung enth&auml;lt folgende Platzhalter:
</P>
<UL>
<LI> Name
</LI>
<BR><LI> Anschrift
</LI>
<BR><LI> PLZ und Wohnort
</LI>
<BR><LI> Pers&ouml;nliche Anrede
</LI>
</UL>
<P>
Dann muss unsere Datei auch diese vier Informationen zu jeder Person
enthalten. Dabei spielt es keine Rolle, in welcher Reihenfolge diese Daten
eingetragen sind. Sie m&uuml;ssen nur in der gesamten Datei einheitlich sein.
Die vier Teiltexte sind mittels &lt;TAB&gt; voneinander abzugrenzen, die
einzelnen Personen durch &lt;RETURN&gt;, also je Person eine neue Zeile.
</P>
<P><B>Der Dateiinhalt k&ouml;nnte f&uuml;r zwei Personen so aussehen:</B></P>
<PRE>
Michael Christoph&lt;TAB&gt;Irring, Passauer Stra&szlig;e 8&lt;TAB&gt;94113
Tiefenbach&lt;TAB&gt;Hallo Michael&lt;RETURN&gt;
Carsten Schr&ouml;der&lt;TAB&gt;Helmoltstra&szlig;e 10&lt;TAB&gt;37081 G&ouml;ttingen&lt;TAB&gt;Hi
Carsten&lt;RETURN&gt;
</PRE>
<P>
Wer diese Daten bereits in einem Adressbuch (nat&uuml;rlich im Computer) stehen
hat, kann diese oft auch direkt exportieren. Dabei spielt es keine Rolle,
wenn mehr Daten exportiert werden. Wichtig ist nur, dass die Felder mit
&lt;TAB&gt; getrennt werden und je Person nur eine Zeile geschrieben wird.
</P>
<P>
 <A HREF="img/ps41_adressen.png"><IMG SRC="thumb/ps41_adressen.jpg" WIDTH="120" HEIGHT="22" ALT="Die Felder sind mit TAB zu trennen"  BORDER="0"></A>
</P>
<P>
Nach diesem Schritt kommen wir auch schon zum Letzten, dem Drucken. Im
neuen Druckerdialog gibt es jetzt eine vierte Karteikarte, die alle
Einstellungen bez&uuml;glich des Serienbriefes enth&auml;lt.
</P>
<P><B> <A HREF="img/ps41_drucken.png"><IMG SRC="thumb/ps41_drucken.jpg" WIDTH="120" HEIGHT="56" ALT="Druckeinstellungen für den Serienbrief"  BORDER="0"></A></B></P>
<P>
Zuerst muss das gleichnamige K&auml;stchen abgehakt werden. Dann erst kann
rechts daneben die vorher erstellte Datei mit den Namen und Anschriften
ausgew&auml;hlt werden. Daraufhin wird der Scroller mit mehreren Zeilen gef&uuml;llt
werden. Je Zeile ist ein Feld der Datei vorhanden (die komplette erste
Zeile der Datei). Nun muss nur noch aus dem unteren Listenfeld der passende
Platzhalter zugeordnet werden. Enth&auml;lt die Datei auch Felder, die nicht
gedruckt werden sollen, sind diese mit &quot;<skip>&quot; zu versehen. Falls nur eine
einzige Zeile angezeigt wird, wurden die Felder in der Datei vermutlich
nicht mit &lt;TAB&gt; getrennt. Zu beachten ist, dass einige Editoren die Tabs
sofort in Leerzeichen umwandeln (ggf. mittels &quot;type <dateiname> opt h&quot; oder
einem Hexeditor kontrollieren, ob die Zwischenr&auml;ume der einzelnen Felder
mit dem Wert 0x09 belegt ist). Ein 0x20 hingegen steht f&uuml;r das normale
Leerzeichen und w&auml;re falsch!
</P>
<P>
Damit w&auml;ren dann auch schon alle Einstellungen getroffen, und der Druck
kann erfolgen. Der Vollst&auml;ndigkeit halber sei aber auch noch erw&auml;hnt, dass
nicht alle Einladungen auf einmal gedruckt werden m&uuml;ssen. PageStream
erlaubt einen frei w&auml;hlbaren Bereich, z.B. die ersten zehn Einladungen.
Dazu ist unter Datens&auml;tze bei &quot;erster&quot; 1 und bei &quot;letzter&quot; 10 einzutragen.
Sollen in einem zweiten Durchgang dann alle restlichen Einladungen gedruckt
werden, ist &quot;erster&quot; auf 11 zu setzen und &quot;letzter&quot; ganz einfach
freizulassen.
</P>
<P><B> <A HREF="img/ps41_ergebnis.png"><IMG SRC="thumb/ps41_ergebnis.jpg" WIDTH="120" HEIGHT="95" ALT="Das fertige Druckergebnis in MultiView"  BORDER="0"></A></B></P>
<P>
Mit diesen Worten w&uuml;nsche ich allen Lesern freudiges Probieren.
</P>
<P><B>Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
