<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. MeterNet verwendet AmigaNG-Technologie f&uuml;r Internet-Devices

»MeterNet&#174; schlie&szlig;t Kooperation mit Amiga&#174; zur Entwicklung von SimpleBox 
Internet Devices f&uuml;r Breitband

Neue einfach anzuwendende Internetger&auml;te auf Festk&ouml;rperbasis betrieben mit 
Amiga-Technologie der N&auml;chsten Generation enthalten Java&#174; und Unterst&uuml;tzung 
f&uuml;r kontinuierlichen Media-Betrieb.

Snoqualmie, Washington - Reno, Nevada - 20. September 2000 - Gesch&auml;ftliche
Mitteilung

Im Hinblick auf die Millionen von computerlosen Verbrauchern in der ganzen 
Welt ohne Netzverbindung, die bald Zugang zu einem Breitbandanschluss haben 
werden, haben sich AMIGA und MeterNet zusammengetan, um eine Reihe von 
SimpleBox Internet Devices f&uuml;r Breitband zu entwickeln und zu liefern, die 
mit Amiga der N&auml;chsten Generation betrieben werden.

Das SimpleBox-Programm von MeterNet bem&uuml;ht sich, die bestentwickelten 
L&ouml;sungen auf ihre eingebetteten Plattformen und zu den angestrebten M&auml;rkten 
zu bringen. Jedes Ger&auml;t enth&auml;lt eine ma&szlig;geschneiderte SimpleBox 
Benutzerschnittstelle (User Interface = UI) auf einer stabilen Festk&ouml;rper-
Hardware ohne bewegliche Teile. Gemeinsam mit der Bereitstellung einfacher 
Navigation und Operation bietet die SimpleBox UI erg&auml;nzend dazu integrierte 
eMail im Netz mit vielen M&ouml;glichkeiten, die f&uuml;r die Darstellung auf TV- 
oder VGA-Bildschirmen optimiert ist.

Das erste Produkt der Mittelklasse, das mit Amiga als Betriebssystem 
herauskommen wird, ist das SimpleBox Java Internet Device (JID) Modell 
wb8616JID. Das SimpleBox wb8616JID enth&auml;lt zus&auml;tzlich einen robusten v4.-
Browser, Audio- und Video-Abspielm&ouml;glichkeiten und eine schnelle Ethernet-
Schnittstelle f&uuml;r einfachen Breitbandzugang zu Kabel, DSL, Satelliten und 
Local Area Networks (LAN).

Anders als sonstige derzeit erh&auml;ltliche Ger&auml;te von America Online (AOL), 
Microsoft (MSFT), Ravisent (RVST), Web-2U (MUCP) und anderen enth&auml;lt die 
mit Amiga betriebene SimpleBoxJID eine von Sun anerkannte Virtuelle 
Maschine, die eine L&ouml;sung mit sehr hoher Leistungsf&auml;higkeit und effizientem 
Speicherverbrauch darstellt, um auf JavaTM-Technologie basierende Media-
Inhalte zu betreiben.

MeterNet und AMIGA entwickeln auch ein Niedrig-Preis Internet-Radioger&auml;t 
f&uuml;r den weltweiten Verbrauchermarkt. Es soll im Fr&uuml;hjahr 2001 am Markt 
erscheinen.

AMIGA Incorporated ist der aufstrebende F&uuml;hrer bei Multiplattform-
Multimedia-Betriebssystemen. Das Amiverse bietet eine digitale Einrichtung 
f&uuml;r Multimedia, die den Entwicklern eine echte M&ouml;glichkeit bietet, ein 
Programm einmal zu schreiben und es &uuml;berall laufen zu lassen (write once 
run anywhere). AMIGA hat auf seiner reichen 15-j&auml;hrigen Geschichte der 
Industrief&uuml;hrung bei der Entwicklung dessen, was wir als Multimedia kennen, 
aufgebaut und hat diese nun erweitert.

MeterNet Corporation entwickelt und vertreibt Breitband-Internetger&auml;te, 
schl&uuml;sselfertige Dienstleistungen und angepasste integrierte Programme. 
Sehr zufriedene Kunden der Vergangenheit sind Ziff-Davis, America Online, 
Alta Vista, Shopping.com und IBM. Seit Dezember 1999 liefern wir unsere 
Serie SimpleBox Entry Level wb6400 weltweit aus. Die Produktion von Phase 
One SimpleBox wb8616JID ist vorgesehen f&uuml;r eine Zahl von 10 000 Einheiten 
und die Lieferung soll Anfang Dezember beginnen.

Weiter Informationen &uuml;ber das Programm der SimpleBox JID erhalten Sie bei 
einem Besuch bei http://world.simplebox.com. Dort k&ouml;nnen Sie auch eine 
eMail-Bestell-Reservierung hinterlassen.

Alle Warenzeichen sind Eigentum ihrer jeweiligen Inhaber.
Alle Rechte vorbehalten«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc. / MeterNet)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
