<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
8. Kurzmeldungen (von Oliver Tacke)

---------------------------------------------------------------------------
 Software
---------------------------------------------------------------------------
 Angek&uuml;ndigt wurde von Haage&Partner Version 4 des Entwicklerpakets StormC.
 Die G&auml;ste, die anl&auml;&szlig;lich eines Sommerfestes bereits einige Einblicke
 bekamen, waren laut Aussage der Hersteller begeistert. Mittlerweile
 befindet sich das Projekt in der Betaphase.
 [http://www.haage-partner.com/news/news_20000828_d.htm]

 DreamCDGuide V0.96 ist erschienen. Das Programm bietet eine Oberfl&auml;che zum
 Navigieren durch Aminet CD-ROMs, die es auch automatisch erkennt.
 [http://www.trogsoft.uklinux.net/site/products/downloads/dreamcdguide.lha]

 Von DataM II, einer neuen Tabellenkalkulation, ist Version 0.8 beta 
 erschienen und darf ausgiebig getestet werden.
 [http://www.amclust-net.de/software/Kirsch.html]

 OpusMI, eine Iconsammlung f&uuml;r DOpus 5.82 im GlowIcon Design, ist in der
 finalen Version erschienen.
 [http://home.t-online.de/home/mason.home/zhomepag.htm]

 Das B&ouml;rsenprogramm Bonds wurde in Version 1.78 beta herausgegeben.
 [http://www.programmed-excelence.de/]

 Das Programm Diskmaster von Rudolph Riedel ist in Beta-Version 2.5b7
 erschienen.
 [http://home.t-online.de/home/rudolph-riedel/]

 Der Virenkiller VirusExecutor ist als Version 2.04 Beta verf&uuml;gbar.
 [http://home4.inet.tele.dk/vht-dk/amiga/ve/VirusExecutor.lha]

 Die XFDmaster.library hat den Versionssprung auf V11.34 vollzogen.
 [http://www.vht-dk.dk]

 Jacek Rzeuski hat sich des SourceCodes von DirOpus 4, der freigegeben
 wurde, angenommen und weiterentwickelt. Die aktuelle Version ist V4.15.
 [http://viper.pl/~opus/DOpus415JRbin.lha]

 Der Filer DiskMaster von Rudolph Riedel ist als Version 2.5 Beta 8
 erh&auml;ltlich.
 [http://home.t-online.de/home/rudolph-riedel/]

 Der Nachfolger des MPEG-Players Amp, logischerweise AMP2, ist als
 Demoversion verf&uuml;gbar, mittlerweile sogar als Preversion 5.
 [ftp://ftp.amidog.com/pub/amp/AMP2pre5.lha]

 Frogger ist in Version 1.62 Beta ver&ouml;ffentlicht worden.
 [http://frogger.rules.pl/downloads.html]

 Das Programm Rainboot, das bisher nur den Bootvorgang versch&ouml;nerte, ist
 in Version 3 erschienen und kann nun auch zum Erstellen von kompletten
 Demos verwendet werden.
 [http://phobos.spaceports.com/~sfa/downloads.html]

 Vom MPEG Encoder Pegase ist Version 1.8d fertig gestellt worden.
 [http://perso.pacwan.fr/kakace/pegase/]

 Die Druckersoftware Turboprint hat den Sprung auf Version 7.13 beta
 vollzogen.
 [http://www.irseesoft.de/tp_faqs.html#beta]

 Wieder gibt es ein Update f&uuml;r das Zeichenprogramm PerfectPaint, das nun
 die Versionsnummer 2.2 tr&auml;gt.
 [http://gothic.fr.free.fr/amiga/index.html]

 Von Innovative wurde fxScan 3.0 angek&uuml;ndigt, das unter anderem
 Schrifterkennung beherrschen soll.
 [http://www.innovative-web.de]

 Die Brennersoftware MakeCD ist als V3.2d Beta 3 erschienen.
 [http://makecd.core.de/ftp/MakeCD32d_public_beta_3.lha]

 Thomas Wenzel hat seinen beliebten mp3-Player AmigaAMP zu Version 2.8
 beta 8 weiterentwickelt.
 [http://amigaamp.amiga-software.com/Binaries/AmigaAMP28b8.lha]

 Die neueste Weiterentwicklung zu DirOpus 4, dessen Quellcode freigegeben
 wurde, unterst&uuml;tzt nun als V4.15a beta u.A. auch New- und GlowIcons.
 [http://viper.pl/~opus/DOpus4beta.lzx]

 Wer die Windows-Taskbar mag, sollte sich Workbench2000 in Version 1.6
 ansehen.
 [http://memory.overdrive.free.fr/Download/WB2000.lha]

 Das unkomplizierte SMS-Programm TaskiSMS ist in Version 2.0 erschienen und
 kann jetzt &auml;hnlich YAM SMS verwalten.
 [http://taski.com.pl/pub/taski/programs/TaskiSMS.lha]

 VirusExecutor ist nun als Version 2.05 downloadbar.
 [http://home4.inet.tele.dk/vht-dk/amiga/ve/ve.htm]

 Der AOL Messenger AmigAIM, ist als V0.9392 beta verf&uuml;gbar.
 [http://www.missingpiece.com/AmigAIM/index.html]

 Der ADF (Ent-)Packer ADFBlitzer ist in einer optisch verbesserten Version
 2.0 ver&ouml;ffentlicht worden.
 [http://www.sharksoft.de/adfblitzer.lha

---------------------------------------------------------------------------
 Hardware
---------------------------------------------------------------------------
 Seit wenigen Tagen ist das PCI-Board "Mediator" erh&auml;ltlich.
 [http://www.elbox.com/]

 In der britische Zeitschrift "Amiga Active" war zu lesen, dass f&uuml;r die
 Cyberstorm/Blizzard PPC Boards ein PCI AddOn namens "Predator" entwickelt
 werden soll.
 [www.amigaactive.co.uk/]

 DCE gab bekannt, an einem PCI-Board namens G-Rex zu arbeiten. Weiterhin
 solle auch eine Voodoo3-Karte in Arbeit sein.
 [http://www.dcecom.de/pub/g-rex.pdf]

 Die Firma Merlancia Industries k&uuml;ndigt einen Mausadapter an, der PS/2-
 M&auml;use auch am Amiga betreibbar macht. Ein Treiber, der bis zu vier
 Maustasten und auch Scrollr&auml;dchen unterst&uuml;tzt, geh&ouml;rt zum Lieferumfang.
 [http://www.merlancia.com/amiga/new.html]

 F&uuml;r den Ateo-Bus ist ein SCSI-Controller erschienen.
 [http://www.ateo-concepts.com/amiga/eframe.html]

 Findige Bastler k&ouml;nnen mit gerade einmal acht Bauteilen ihrer Melody1200
 einen digitalen Ausgang spendieren.
 [http://www.katodev.de/deutsch/ctdigio.html]

 Wie man Aussagen auf Blittersofts Website entnehmen konnte, sollte das
 Paraglide-Modul f&uuml;r die PicassoIV bald verf&uuml;gbar sein.
 [http://www.blittersoft.com]

---------------------------------------------------------------------------
 Verschiedenes
---------------------------------------------------------------------------
 Wie www.amiga-news.de berichtete, hat sich in das Aminetarchiv
 "MWI-Overview02.lha", das sich auch auf der Aminet CD-ROM #38 befindet,
 der 8x8-Motaba Virus eingeschlichen. Die infizierte Datei hei&szlig;t:
 mwi-ove2.exe.
 [http://www.amiga-news.de]

 Die Amiga2001-Show in St.Louis wird vom 31. M&auml;rz bis zum 1. April
 stattfinden.
 [http://www.amiga-news.de/archiv/000829.shtml]

 Das Handbuch zu ImageFX wird in K&uuml;rze in deutscher Sprache verf&uuml;gbar
 sein und &uuml;ber 400 Seiten umfassen.
 [http://www.haage-partner.com]

 APC&TCP suchen einen Programmierer, der den Hauptprogrammierer von Phoenix
 bei der Arbeit unterst&uuml;tzt.
 [http://www.apc-tcp.de]

 AsimWare hat den Support f&uuml;r alle Amiga-Produkte eingestellt und wird sich
 von nun an auf Windows konzentrieren.
 [http://amiga.asimware.com]

---------------------------------------------------------------------------
 Ger&uuml;chte
---------------------------------------------------------------------------
 Wie auf den Seiten von Funtime World am 27.09.2000 zu lesen war, k&ouml;nnte
 der iMac-Emulator FusionPPC zu Weihnachten erscheinen.
 [http://www.funtime-world.de]

Oliver Tacke &lt;O.Tacke@surfway.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
