<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Neuigkeiten von Haage & Partner

Haage & Partner (http://www.haage-partner.com) informiert:

»06. September 2000: H&P stockt Personal auf

Schon seit dem Oktober letzten Jahres haben wir mit Markus P&ouml;llmann einen 
neuen Programmierer besch&auml;ftigt. Er k&uuml;mmert sich vorwiegend um StormC und 
arbeitet auch an AmigaWriter. Anfang 2000 kam mit Ute Gottschalk eine 
weitere Mitarbeiterin hinzu, die sich um die Buchhaltung und Datenerfassung 
k&uuml;mmert. Stefan Robl hat gerade ein Praktikum f&uuml;r sein Informatik-Studium 
beendet, in dem er eine neue und portable Version von StormRexx erstellte. 
Anfang September haben mit Alexander Bramm und Simon Neumann zwei weitere 
Mitarbeiter ihre Arbeit aufgenommen. Sie k&uuml;mmern sich vorwiegend um den 
Support und die Betreuung neuer Projekte.


06. September 2000: Weitere Mitarbeiter gesucht

F&uuml;r bestimmte Supportaufgaben und verschiedene kleinere bis mittlere 
Projekte suchen wir noch erfahrene Mitarbeiter f&uuml;r die Bereiche 
Genesis-Support, Webprogrammierung, AmigaWriter-Support, 
PageStream-Support, Programmierer und English Native Speaker.
http://haage-partner.com/wanted_d.htm


08. September 2000: Deutsches ImageFX-Handbuch in K&uuml;rze verf&uuml;gbar

Endlich ist es soweit: Der Poweruser Gunnar Gertzen hat das 
ImageFX-Handbuch vollst&auml;ndig ins Deutsche &uuml;bersetzt. Das Buch umfa&szlig;t sowohl 
das schwarze Originalhandbuch, als auch alle Erg&auml;nzungen bis zur Version 
4.0. Es ist ein richtig dicker W&auml;lzer mit insgesamt &uuml;ber 400 Seiten 
geworden. Auch das Layout ist bereits fertig, so da&szlig; das Buch in den 
n&auml;chsten Tagen in den Druck gehen kann.


14. September 2000: ArtEffect Workshop &uuml;berarbeitet

Durch die Weiterentwicklung von ArtEffect hatte es kleine Unstimmigkeiten 
im alten Workshop gegeben, die nun bereinigt sind. Zudem haben wir den 
Aufbau komplett umgestellt. In 12 Kapiteln wird interessante Funktionen und 
Effekt von ArtEffect vorgestellt.
http://haage-partner.com/arteffect/workshop/index.htm


27. September 2000: Homepage & Supportbereich &uuml;berarbeitet

In den letzten Tagen haben wir einige Umstellen an der Homepage 
vorgenommen. Impressum, Copyright, Datenschutz sind neue Bereiche, die man 
&uuml;ber die Textlinks in der Fu&szlig;zeile aufrufen kann. Viele weitere Seiten 
wurden &uuml;berarbeitet und aktualisiert, so z.B. die meisten FAQ-Seiten, die 
Antworten auf h&auml;ufig gestellte Fragen geben. 
http://www.haage-partner.com/support-d.htm


27. September 2000: Wir sind wieder online!

Bei Arbeiten an unserem Firmengeb&auml;ude wurde die Telefonleitung besch&auml;digt. 
Von Donnerstag bis Montag waren wir daher nur eingeschr&auml;nkt erreichbar und 
konnten vor allem keine E-Mails empfangen. Jetzt funktioniert alles wieder 
und wir haben jetzt auch eine DSL-Anbindung.

 
27. September 2000: Angebot der Woche

Das aktuelle "Angebot" der Woche findet man ab sofort auf der Startseite 
unseres Online-Shops.
http://www.amiga-shop.de«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
