<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(03.09.2000)

Amiga Arena - The Fire comes out!

  SHARKS (ECS) Vollversion!
  In zusammenarbeit mit Christian Steiner Pr&auml;sentiert die 
  Amiga Arena Exklusiv  - SHARKS 1.3 als Registrierte Vollversion!
  Sharks - ist ein Geschicklichkeitsspiel!
  Bergen Sie Sch&auml;tze vom Meeresboden, doch aufgepasst Haie machen Ihnen das
  Leben schwer!
  Viel Spass mit Sharks w&uuml;nscht Euch die Amiga Arena - The Fire still       
  burns!
  
  Amiga Arena - Burning Business!
  In zusammenarbeit mit Christian Steiner erm&ouml;glicht die  Amiga Arena einen
  Sonderpreis f&uuml;r die SHARKS AGA und CD32 Version!
  
  Sharks AGA - 5 DM  /  Sharks CD32 Version - 20 DM 
  
  Amiga Arena Interview Aktion!
  Neue Interviews mit Stefan B. (OnyxBase) und  Thorsten P. (StartAmPlan)
  Online!
  
  Amiga Arena - Burning Business!
  Das PhotoAlbum/Cybershow Paket ist nur noch bis zum 10.09.00 
  zum Sonderpreis in der Amiga Arena erh&auml;ltlich!


틻miga Arena News
(07.09.2000)

YOU THOUGHT IT WAS GONE
BUT THE FIRE GOES ON
  
Amiga Arena - The Fire still burns!
Liebe Amiga Freunde, 
ich freue mich nach langen Versuchen 
das JST f&uuml;r die h&auml;lfte des normalen
Registrations Preises in der Arena erh&auml;ltlich ist.
Es ist nicht immer einfach an Sonderpreise zu
gelangen dennoch verl&auml;uft die zusammenarbeit mit den
Entwicklern sehr gut! 
(Das mag ich pers&ouml;hnlich an der "Amiga Gemeinde"! :-) )
Ohne die Entwickler w&uuml;rde die Amiga Arena nicht das
sein was sie ist, eine aktive Amiga Homepage die
versucht Impulse zu setzten und Entwickler wie
Anwender zu Motivieren!
So freue ich mich &uuml;ber die steigende Besucheranzahl
meiner Homepage und freue mich von den Entwicklern
zu h&ouml;ren das neue  User die Sonderpreise in Anspruch
genommen haben!
Dies ist meine Motivation die Amiga Arena zu pflegen!
Ich erhalte weder Geld noch Geschenke f&uuml;r die
Sonderaktionen. (Ich nutze Sie selber! ;-) )
Ich hoffe das Ihr Impulse setzt und die Entwickler
unterst&uuml;zt!
Denn das Verh&auml;ltniss Besucherzahlen meiner Seite
zu den neuen Registrationen der Sonderpreise ist
mehr als traurig! :-(
Amiga Arena - The Fire comes Out!

Amiga Arena - Burning Business!
In zusammenarbeit mit Jean-Francois Fabre 
erm&ouml;glicht die Amiga Arena einen Sonderpreis f&uuml;r JST!
JST der Patch f&uuml;r alle Spiele Freaks!
JST erm&ouml;glicht fast alle Spiele von HD zu starten
Spielst&auml;nde zu speichern u.v.m.!

Amiga Arena Interview Aktion!
Neue Interviews mit Damir Ahr (Ballmaster) und 
Felix Schwarz (FXPaint) Online!


틻miga Arena News
(16.09.2000)

Amiga Arena - E.N.D.!
(E.vil N.ever D.ies)
Es ist mehr als traurig das die wenigen Amiga User immer noch damit zu
K&auml;mpfen
haben das  Raubkopien,Fake Keys ect. den Spass an der Sache nehmen!
Jeder Anwender tr&auml;gt dazu bei das Weiterentwicklungen eingestellt werden!
Es nervt auch das man sich immer wieder mit dieser Thematik auf dem Amiga
besch&auml;ftigen muss!
(Zwangsweise) 
Dies steigert nicht gerade die Motivation!
Who Cares? :-(

Matrix Hunter - Amiga Arena Version!
In zusammenarbeit mit Christian Steiner steht die   Registrierte Version 
von
Matrix Hunter zum Download bereit!
Matrix Hunter ist ein Shooter und ist eines der ersten Spiele
von Christian Steiner dem Entwickler von Sharks!
 
Amiga Arena Interview Aktion!
Neue Interviews mit Manfred T. (MT Rechnung) und  Dennis P. (Virtual
Dimensions) Online!

Amiga Arena - Burning Business!
Der Sonderpreis f&uuml;r PhotoAlbum/Cybershow ist  bis zum 31.10.2000 verl&auml;ngert
worden!


틻miga Arena News
(18.09.2000)

Amiga Arena - Burning Business!
Die Amiga Arena pr&auml;sentiert MusicMan III!
(Amiga Arena Version)
In zusammenarbeit mit Andreas Mair erm&ouml;glicht die
Amiga Arena sich f&uuml;r MusicMan III KOSTENLOS zu
Registrieren!
(Musicman III ist Shareware und kostet normal 30 DM)
MusicMan III ist die Software zum Verwalten Ihrer 
LP,CD,MC und Singel Sammlung!

Amiga Arena - E.N.D. Part II
(E.vil N.ever D.ies)
Marko Sepp&auml;nen Entwickler von ImageEngineer verl&auml;sst den Amiga!
Damit verlieren wir wieder einen Entwickler!

http://www.amigaworld.com/support/imageengineer


틻miga Arena News
(24.09.2000)

Amiga Arena Interview Aktion!
Neue Interviews mit Peter Arman (Legend of the Elves) 
und  Elmar Plischke (Klotz) Online!

Amiga Arena - Burning Business! 

Folgende Shareware Programme sind zur Zeit noch zu einem
Sonderpreis erh&auml;ltlich!

Der Sonderpreis g&uuml;ltig bis 30.09.2000
Software: JST
Entwickler: Jean-Francois Fabre
Preis: 10 DM

Der Sonderpreis ist g&uuml;ltig bis 31.10.2000
Software: PhotoAlbum/Cybershow Paket
Entwickler: Helmut Hoffmann
Preis: 35 DM

Der Sonderpreis ist g&uuml;ltig bis 28.02.2001
Software: AmiATLAS
Preis: 79 DM

Der Sonderpreis ist unbegrenzt g&uuml;ltig!
Software: SHARKS AGA und Multi
Entwickler: Christian Steiner
Preis: 5 DM

Software: SHARKS CD32 Version
Preis: 20 DM

Der Sonderpreis ist unbegrenzt g&uuml;ltig!
Software: Boulderd&auml;sh
Entwickler: Guido Meresmann
Preis: 10 DM
 
Die Amiga Arena erh&auml;lt kein Honorar von den Entwicklern ect.!
Only for You - Amiga Arena NON Profit Shareware Support!

Neue Aktionen folgen!


틻miga Arena News
(28.09.2000)

Amiga Arena - Burning Business!

Exklusiv pr&auml;sentiert die Amiga Arena 
zwei weitere Sonderpreis Angebote!

Beide Tools sind eigentlich f&uuml;r jeden
Amiga User unentbehrlich!
Bitte unterst&uuml;zt die Entwickler!

xadmaster.library zum Sonderpreis!
In Zusammenarbeit mit Dirk Stoecker, erm&ouml;glicht die Amiga Arena  einen
Sonderpreis f&uuml;r xadmaster.library bis zum 31.10.2000
Mit der xadmaster.library k&ouml;nnen sie alle m&ouml;glichen File und Disk Archive
entpacken.  Mit einer Oberfl&auml;che wie z.b. Vodoo-X ist die xadmaster.library
unentbehrlich f&uuml;r den  t&auml;glichen gebrauch von Archiven.

VisualPrefs zum Sonderpreis!
In Zusammenarbeit mit Massimo Tantignone
erm&ouml;glicht die Amiga Arena einen Sonderpreis f&uuml;r VisualPrefs.
VPrefs ist das Systemtool um die WB Optisch zu versch&ouml;nern!
Unz&auml;hlige m&ouml;glichkeiten um Fenster,Kn&ouml;pfe ect. zu gestalten.
Ohne dieses Tool erscheint die WB "altbackend"!
  

Amiga Arena Interview Aktion!
Neues Interview mit Massimo Tantignone (VisualPrefs) Online!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
