<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6.2. PD-Tests (von Malte Mende)
-------------------------------

SameGame
--------

Anfangen will ich mit SameGame, dass mich ehrlich gesagt recht beeindruckt 
hat. Anfangs dachte ich: Woah, noch son bl&ouml;des WB Billig Spiel...
Aber es ist echt spa&szlig;ig!

Auf dem Bildschirm sieht man ein Spielbrett, das vollkommen mit farbigen
Kugeln ausgef&uuml;llt ist.
Nun muss man die Kugeln entfernen. Dies tut man, indem man auf sie
draufklickt. Aber: Man kann die Kugeln nur entfernen, wenn mindestens
2 mit der gleichen Farbe vertikal oder horizontal nebeneinander liegen. 
Je mehr Kugeln man auf einen Klick entfernt, desto mehr Punkte bekommt man. 
Entfernt man Kugeln aus der Mitte des Brettes, oder von unten, fallen die
Kugeln von oben nach, Entfernt man sie am Rand, r&uuml;cken sie nach links oder
rechts auf.
Wer es schafft, alle Kugeln vom Spielfeld zu entfernen (was absolut nicht
einfach ist!), bekommt 1000 Extrapunkte.
Bei vollendetem Spiel kann man sich in die Highscore-Liste eintragen, was
fr&ouml;hliches Vergleichen mit Freunden (und Feinden) erlaubt.

Es gibt zwar &uuml;ber 65000 Spielfelder, allerdings wird das Spiel auf die
Dauer ein wenig eint&ouml;nig. 

Die Grafik ist zwar schlicht gehalten, aber gut gelungen. Gespielt wird 
wahlweise in einem Fenster auf der WB oder auf einem Cusom-Screen.
Sound gibt es leider &uuml;berhaupt nicht...

Fazit: F&uuml;r zwischendurch absolut geeignet, wenn das Hirn mal wieder &uuml;ber zu
wenig Belastung klagt...!

Name: SameGame
Autor: Crew92

Grafik: 6 von 10 Punkten
Sound: kein Sound
Steuerung: 9 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck vom Redakteur: 7 von 10 Punkten


SpaceBall2000
-------------

Das nenn ich Freeware! Jepp, dieses Spiel ist eines dieser, die jeder auf
seiner Platte haben sollte.
Ihr steuert einen Roboter (oder ists ein Mensch in einer R&uuml;stung?), und
spielt eine Art Pong gegen den Computer oder einen Freund.
Nun, das Spiel ist kein astreines Pong, es ist eher eine Shufflepuck-Cafe
Variante aus der Vogelperspektive.
Ihr m&uuml;sst einen Ball in das gegnerische Tor schiessen (welches sich fast
&uuml;ber den gesamten oberen Bildschirm erstreckt), und aufpassen, dass er 
keins in eures schie&szlig;t. Dabei schlagt ihr den Ball nach dem Gesetz:
Einfallswinkel ist gleich Ausfallswinkel. Ausserdem sind in der Mitte des
Feldes noch zwei sich bewegende Balken, an denen der Ball abprallen kann
und ein Magnetfeld, das manchmal aktiviert wird, und den Ball in eine 
andere Richtung (aber immernoch in Richtung von dem, der grade KEINEN Ball-
kontakt hatte) schiesst.
Klingt kompliziert, ist es aber nicht.
Wenn ihr 5 mal ins gegnerische Tor geschossen habt, kommt ihr weiter und
spielt gegen den n&auml;chsten Gegner.
Hat der Gegner euch hingegen 5 mal ins Tor geschossen, ist das Spiel 
vorbei.

Zus&auml;tzlich zum typischen Gegen-den-Computer-Spiel k&ouml;nnt ihr noch gegen 
einen Freund/Freundin spielen (das ist sicher DER Knaller auf langweiligen 
Partys!) oder im Trainingsmodus gegen einen fast unm&ouml;glichen Gegner...

Die Grafik ist absolut gelungen, und sie erf&uuml;llt ihren Zweck perfekt.

Die Soundeffekte sind immer passend (auch wenn ich schw&ouml;ren k&ouml;nnte, die
Samples schonmal irgendwo geh&ouml;rt zu haben...) und die Musik ist im sch&ouml;nen,
unaufdringlichen Stil gehalten. Nicht bombastisch, aber gut.

Irgendwie macht das Spiel s&uuml;chtig...

Fazit: Unbedingt downloaden, ihr werdets nicht bereuen!

Name: SpaceBall2000 v2.0
Author: DawnBringer

Grafik: 8 von 10 Punkten
Sound: 8  von 10 Punkten
Steuerung: 8 von 10 Punkten
Spielspa&szlig;: 9 von 10 Punkten

Subjektiver Gesamteindruck des Redakteuers: 9 von 10 Punkten


WBArmy
------

Jeder Amiga User, der gerne spielt, kennt sicher auch Scorched Tanks. Dies 
ist eine abgespeckte Version f&uuml;r die WB.
Abgespeckt hei&szlig;t: Weniger Grafik, weniger Waffen, weniger Gegner.

Nun, leider kann man das Spiel nur auf einem 640*512 oder h&ouml;her Screen 
spielen, was meine kaputten Augen doch garnicht sooo lustig finden...

Aber was ein richtiger Amiga-Freak ist, hat nat&uuml;rlich einen augenschonenden
Monitor, also rechne ich das nicht als Negativpunkt ;-)

Nun, das Spielprinzip von WBArmy (und auch von ST) ist, dass man einen
gegnerischen Panzer abschiessen muss.
Hierbei bestimmt man Abschusswinkel, St&auml;rke und Munitionsgr&ouml;&szlig;e. H&auml;rtere 
Muni kann man sich im Shop kaufen (auch w&auml;hrend des Spiels)
Ausserdem kann man seinen Panzer fahren (hierf&uuml;r muss man sich Benzin 
holen) und man kann sich zus&auml;tzliche Energie holen.

Bei Schiessen muss man dann auch noch den Wind mitberechnen, der sich 
leider st&auml;ndig (sprich: Pro Runde) &auml;ndert, in St&auml;rke und Richtung.

Also: Garnicht sooo einfach, wie es anfangs klingt.

Wem der Computergegner auf die Dauer zu leicht (oder zu schwer) wird, kann 
die K&uuml;nstliche Intelligenz (oder Bl&ouml;dheit, wie man das halt sieht...) 
verstellen.
Au&szlig;erdem kann man verstellen, wieviel Bonus Kisten runterfallen, welche 
Farbe der Untergrund haben soll, wieviel Energie man maximal haben kann, ob 
es Wind gibt und so weiter...

Die Grafik ist, wie anfangs schon erw&auml;hnt, recht schlicht gehalten, ein WB 
Game halt. Soundm&auml;&szlig;ig hat das Spiel auch nicht viel drauf, gro&szlig;e Ausnahme 
ist der Sample, wenn ihr aus das Fenster rausschiesst...!

Fazit: Von der Grafik und dem Sound abgesehen, ist das Spiel eine gute 
Alternative zum altbekannten Scorched Tanks. Allerdings ist das Original 
wesentlich besser.
Wer richtig Action braucht, sollte sich vielleicht eher f&uuml;r die Kommerz-
Version Worms DC entscheiden.

Name: WBArmy
Autor: LukySoft

Grafik: 5 von 10 Punkten
Sound: 6 von 10 Punkten
Steuerung: 8 von 10 Punkten
Spielspa&szlig;: 6 von 10 Punkten

Subjektiver Gesamteindruck des Redakteuers: 6 von 10 Punkten


SimplePac
---------

Also, man kann es auch &uuml;bertreiben, mit den WB-Freundlichen Spielen. Bei
diesem PacMan Clone wurde komplett aus den einzelnen grafischen Bestand-
teilen des OS 2.1+ zusammengebastelt. Schon allein f&uuml;r diesen Anblick lohnt
sich der Download.
Das Prinzip von PacMan kennt sicherlich jeder, Erkl&auml;rungen w&auml;ren unn&ouml;tig.
Das Original wurde ein wenig abgespeckt, es gibt aber keine Bonuspunkte.

Wie die sehr...interessanten Grafik ist der Sound auch lustig, einige 
coole, geklaute Samples sorgen f&uuml;r die Unterhaltung der Ohren. Trotzdem 
sollte man lieber das Radio laufen lassen.

Die Steuerung ist simpel, man kann entweder die Pfeiltasten oder einen
Joystick via LowLevel.lib benutzen. Leider ist die Kollisionsabfrage recht
ungenau geraten, was einen manchmal das Leben rettet, manchmal aber auch
unn&ouml;tig in den Tod st&uuml;rzt.

Auf die Dauer bringt das Spiel leider nicht allzu viel Spa&szlig;.

Ein interessantes Feature: Man kann das Spielfeld frei skalieren. Aber bei
mir bricht der Rechner dabei ab und an ab.

Fazit: F&uuml;r ein Spielchen zwischendurch schon geeignet, aber auf l&auml;ngere
Zeit fehlt irgendwie die Motivation.

Name: SimplePac
Autor: Sebastian Bauer

Grafik: 7 von 10 Punkten
Sound: 7 von 10 Punkten
Steuerung: 7 von 10 Punkten
Spielspa&szlig;: 6 von 10 Punkten

Subjektiver Gesamteindruck des Redakteuers: 6 von 10 Punkten


Fnurr2000
---------

Simple Spielprinzipe sind meist die Besten. Das ist eine altbekannte Volks-
weisheit. Nun hat sich der liebe Richard Fhager diesen Spruch zu Herzen
genommen und ein wirklich einfaches Spiel kreirt:
Man steuert einen Punkt, der von 25 weiteren Punkten verfolgt wird. Alle
Punkte sind gleichschnell. Treffen sich jedoch zwei Punkte, explodieren 
sie.
Befindet sich der Punkt des Spielers in dieser Explosion, oder ist einer
der kollidierenden Punkte, hat man verloren. Befindet sich ein anderer 
Punkt innerhalb der Explosion, explodiert dieser auch, und so weiter.
Um die Punkte zum explodieren zu kriegen, muss man sich geschickt jagen
lassen.
Je nachdem, wieviel Punkte gleichzeitig explodieren, bekommt ihr Punkte.
Die Rechnung ist: Anzahl der gleichzeitig explodierenden Punkte hoch drei
Ausserdem bekommt ihr 1 Punkt f&uuml;r jede Sekunde, die ihr am Leben seid.
Das klingt jetzt zwar nicht gerade simpel, aber man kapiert es schon beim
ersten Mal spielen.
F&uuml;r besonders gute Spieler gibt es noch den Spezi-Modus, den man mit F1 
aktivieren kann. Hierbei gibt es ein paar mehr Punkte, die einen jagen.

Grafisch wurde das Spiel recht simpel umgesetzt, die Punkt sind wirklich 
NUR Punkte, der Hintergrund ist recht billig. Was den Rechner trotzdem 
nicht daran hindert, herzhaft zu ruckeln, wenn man den Spezi-Modus 
einschaltet.

Die Musik in dem Spiel selbst ist sehr, sehr hektisch und hilft nicht 
gerade in schwierigen Situationen...
Die Musik beim Titelbild ist hingegen ziemlich gut gelungen (wobei die 
andere auch gelungen ist, aber ebend halt nervig ;-))

In der Kurzbeschreibung f&uuml;r das Spiel steht, dass es f&uuml;r 5 min Spielspa&szlig; 
ist. Dieser Angabe kann man Glauben schenken, allerdings bringt es immer 
wieder Spa&szlig;, die Pixel &uuml;ber den Bildschirm zu jagen. Also: Absolut 
Kaffeepausen-tauglich.

Fazit: Download lohnt sich, es bringt ne Menge Spa&szlig;, aber man sollte es
nicht &uuml;bertreiben, sonst wird das Spiel langweilig.

Name: Fnurr2000
Autor: DawnBringer

Grafik: 6 von 10 Punkten
Sound: 8 von 10 Punkten
Steuerung: 9 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck des Redakteuers: 7 von 10 Punkten


Lord of Alcandria 3
-------------------

Dieses Spiel habe ich absichtlich ganz an den Schluss gesetzt, da es ein
Adventure ist, und ich leider nicht allzuviel Zeit habe, es ausf&uuml;hrlich zu
Spielen. Deswegen will ich es auch nicht werten, nur vorstellen.

Lord of Alcandria ist ein Point&Click Adventure im altbekannten Stile von
Maniac Mansion, Loom oder Monkey Island.
Die Story ist folgende:

Ihr spielt Krilok Rainwood, der irgenwie in die Lordschaft Lotharia ger&auml;t.
Diese wurde regiert von Lord Hellock. Sein Bruder Krislow regiert die
Nachbarlordschaft Alcandria. Hellock wollte jedoch beide besitzen, und in 
einen harten Kampf starb er. Kurz darauf starb auch sein Bruder.
Seitdem Krislow tot ist, ist der neue Lord von Lotharia b&ouml;se geworden, und
wird von Hellock aus einer anderen Dimension gesteuert. Von da an wurden
viele Kinder entf&uuml;hrt.

Was man schon sagen kann, bevor man &uuml;berhaupt einen Mausklick gemacht hat:
Das Spiel ist Grafisch und Soundm&auml;&szlig;ig absolute Spitze. Es ist von der
Qualit&auml;t ungef&auml;hr vergleichbar mit Monkey Island 3 oder Simon the Sorcerer.
Die In-Game Grafiken wie auch die sch&ouml;ne Animation am anfang.

Wie gesagt, ich bin leider noch nicht allzu weit gekommen, deswegen m&ouml;chte
ich hier jetzt nichts Falsches erz&auml;hlen.

Heute gibt's keine Wertung.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
