<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort (mit R&uuml;ckblick auf den vergangenen Monat)
-------------------------------------------------

+++ MeterNet verwendet AmigaNG-Technologie f&uuml;r Internet-Devices +++ Petro 
Tyschtschenko gr&uuml;ndet eigenes Unternehmen +++

Willkommen damit zur neuen Ausgabe von AMIGA aktuell.

Leider war die Nachrichtenlage im vergangenen Monat wenig interessant.
Zudem sind zwei Redaktionsmitglieder krank geworden - gute Besserung an
dieser Stelle, Christian und Ralf -, und auch die Zahl an Softwaretests,
die mich erreicht haben, war diesmal relativ gering. Und das, obwohl vor
kurzem folgende Regelung eingef&uuml;hrt wurde:

Die drei aktivsten AMIGA-aktuell-Tester (inklusive Workshop-Schreibern) 
werden beginnend mit der Januarausgabe f&uuml;r zun&auml;chst ein halbes Jahr in die 
Stamm-Redaktion aufgenommen werden. Als Kriterien hierf&uuml;r gelten Anzahl und 
Umfang der Artikel sowie deren Qualit&auml;t. Gewertet werden alle Beitr&auml;ge in 
den Ausgaben Oktober bis Dezember.
Dies ist als eine (nur gerechte) Belohnung f&uuml;r diejenigen gedacht, die 
besonders stark an AMIGA aktuell mitwirken, aber nicht die Betreuung einer 
kompletten Rubrik &uuml;bernehmen m&ouml;chten.
 
Aber auch an anderer Stelle k&ouml;nnte die Beteiligung besser sein:

In Ausgabe 06/2000 veranstaltete AMIGA aktuell eine Umfrage, deren 
Auswertung ergab, dass unsere Leser vermehrt Interviews und Kommentare 
nachfragen. Deshalb suchen wir zur Verst&auml;rkung unseres Redaktionsteams
engagierte Amiga-User, die bereit sind, jeden Monat ein oder mehrere
Interviews mit bekannten Pers&ouml;nlichkeiten der Amiga-Welt zu f&uuml;hren
und/oder einen interessanten Kommentar zu einem aktuellen Amiga-Thema zu
schreiben.
Zudem streben wir an, auch in Zukunft mehrteilige Stories mit Amiga-Bezug
zu ver&ouml;ffentlichen, nachdem Rainer Bendas Reihe »Der Commodore-Untergang
aus meiner Sicht« mit der letzten Ausgabe ausgelaufen ist. Wer verf&uuml;gt
&uuml;ber entsprechendes Material oder ist bereit und in der Lage, eine
interessante Serie zu schreiben?
Desweiteren ist Numen Stahl leider aus privaten Gr&uuml;nden aus unserer
Redaktion ausgeschieden, so dass wir f&uuml;r seine Internet-Rubriken
(Vorstellung von Amiga-Websites beziehungsweise Internet-Tarifen) einen
Nachfolger suchen.
Falls ihr an einer T&auml;tigkeit als Redaktionsmitglied oder freier Mitarbeiter
von AMIGA aktuell (gern auch in einem anderen Aufgabenbereich, z.B. als
Softwaretester) Interesse habt, schreibt bitte an aakt@aakt.de. Danke!


Zu den regelm&auml;&szlig;igen Aufrufen:
    
* An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber       
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.    
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen  
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber  
  an AMIGA aktuell (aakt@aakt.de).

* Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder         
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind     
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich      
  an aakt@aakt.de wenden.

* Wei&szlig; jemand, ob die Essener Mailbox Empire noch existiert?


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
