<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Hintergrundbericht: Wenn ein Computer alt wird... (von Dirk Wenk)

Oder:  Mit der Zeit kommt unweigerlich das Ende der Soft- und Hardware...
 
Tja. das ist etwas, was man im PeeCee-Sektor nicht kennt: Ein alter 
Computer und die Probleme, die er machen kann. Das f&auml;ngt an bei einer 
auslaufenden Uhrenbatterie und geht hin bis zum totalen Stillstand!
Zum Gl&uuml;ck ist der Amiga noch nicht so weit, dass der totale Stillstand 
erreicht ist, trotzdem gibt's schon die ersten Altersschw&auml;chen. Und damit 
meine ich nicht die Leistung des Systems! Immer wieder h&ouml;rt man die 
Hilferufe in den Foren und Mailinglisten, dass die Uhrzeit nicht mehr 
gehalten wird. Oft wird auch berichtet, dass die Batterie ausgelaufen ist, 
besonders h&auml;ufig beim A4000. Ein Ersatz ist zwar schnell beschafft, doch 
oft ist man schon damit &uuml;berfordert, den neuen Akku einzul&ouml;ten. Und keiner 
will den Rechner zu einer teuren Reparatur schicken nur wegen der Uhrzeit! 
... oder doch? 

Auch nicht selten wird &uuml;ber Ausf&auml;lle des Systems durch Oxidation berichtet 
oder weil ein Bauteil sich mit der Zeit gelockert hat. OK, ein lockeres 
Bauteil ist leicht wieder festgedr&uuml;ckt, aber was macht man bei Oxidation? 
Oder andersherum, wie merkt man, dass es an Oxidation liegt und nicht an 
einer defekten Karte oder &auml;hnlichem? Erscheint pl&ouml;tzlich Grafikm&uuml;ll auf dem 
Bildschirm ohne Guru oder schl&auml;gt der Enforcer Alarm? Dann ist was beim 
Datentransfer zur Grafikkarte schiefgegangen! 

So ist es z.B. mir passiert. Unerkl&auml;rliche Grafikfehler und ganze 
Bildausf&auml;lle lie&szlig;en mich an eine sterbende Grafikkarte denken. Doch zum 
Gl&uuml;ck Fehlalarm! Nachdem ich die ganze Konfiguration meines Rechners 
durchw&uuml;hlt habe, ob irgendein Patch oder Programm oder gar eine falsche 
Einstellung beim Grafiktreiber daf&uuml;r verantwortlich zu machen ist, blieb 
eigentlich nur noch eine Ursache, n&auml;mlich eine defekte Grafikkarte.

Doch als ich schon dabei war die Karte auszubauen, um sie zur Reparatur zu 
schicken (leider war die Garantie l&auml;ngst abgelaufen), fiel mir auf, dass 
die Kontakte der Karte (in meinem Fall eine Picasso 4) nicht mehr silbern, 
sondern eher grau-gr&uuml;nlich waren. Ein schlechtes Zeichen, aber ein 
Hoffnungsschimmer! Nach dem Reinigen der Kontakte mit Kontaktspray und dem 
anschlie&szlig;enden Einbauen dieser Karte lief das System wieder ohne 
irgendwelche Grafikfehler. Gl&uuml;ck gehabt!

Aber wievielen Anderen ist so was schon passiert und sie haben dann die 
Grafikkarte oder den SCSI-Kontroller oder irgendeine andere Erweiterung 
weggeschmissen oder zur Reparatur geschickt, weil irgendwelche Fehler 
auftraten, die man sich einfach nicht erkl&auml;ren konnte? Bestimmt kommt da 
eine Menge zusammen.

Es kommt aber vor, dass ein Teil des Rechner wirklich defekt wird. Leider 
ist auch das mir schon passiert, zwei Mal sogar. Und zwar schmierte der 
Rechner einfach ab oder brachte Fehlermeldungen wie "Ramlib Error" oder 
"Freeing Memory Error" usw. Ein Testlauf mit einem Speichertestprogramm 
best&auml;tigte die schlimme Erwartung. Eine Adresse auf einem Speicherbauteil 
war defekt. Zum Gl&uuml;ck gibt es Programme auf dem Amiga, die solche defekten 
Speicheradressen sperren k&ouml;nnen, damit kein Programm seine wertvollen Daten 
dorthin ablegt. Das T&uuml;ckische an solchen RAM-Fehlern ist aber, dass sie 
erst mit der Betriebsdauer und der damit verbundenen Erw&auml;rmung auftreten. 
Das hei&szlig;t, dass man jetzt zwar wei&szlig;, welche Speicheradresse defekt ist, 
aber nicht, auf welchem IC oder Speichermodul! Das bedeutet Testen! Rechner 
auf und jeweils einzeln die Module durchtesten. Das ist nicht so einfach, 
da

1. der Speicher warm werden mu&szlig;, was wiederum bedeutet, dass auch das
   Geh&auml;use des Computers zu sein mu&szlig;, und
2. es schon mal 2-3 Stunden dauern kann, bis das RAM ausf&auml;llt.

So habe auch ich den Speicher zwar schnell getestet gehabt, aber keinen 
Fehler gefunden! Erst mehrst&uuml;ndiges Suchen hatte zum gew&uuml;nschten Ergebnis 
gef&uuml;hrt. Leider hatte ich beim anschlie&szlig;enden Speicherkauf auch wieder 
Pech, da eines der neuen Module auch defekt war. ARGH!

OK, aber kann es noch schlimmer kommen? Ja, es kann! Denn was ist wohl 
schlimmer als ein Datenverlust? Das ist den meisten bestimmt schon 
passiert. Man hat auf seiner Festplatte wertvolle Daten, z.B. 
selbstgeschriebene Programme, Grafiken, Texte usw. und was passiert?
Im ungl&uuml;cklichsten Moment st&uuml;rzt der Rechner ab und die Festplatte rei&szlig;t er 
gleich mit sich! Nach dem Reboot werden wir dann von einer s&uuml;&szlig;en Meldung 
wie "Disk invalid", "Checksumme error" oder, noch schlimmer, "No DOS disk" 
begr&uuml;&szlig;t! Meistens geschieht das dann, wen das letzte Backup schon lange her 
ist. Das Programm zur Rettung einer Festplatte war nat&uuml;rlich auch auf der 
Festplatte gespeichert. Aber selbst wenn man ein Rettungsprogramm auf 
Diskette hat, hei&szlig;t das noch lange nicht, dass es die Daten retten kann. 
Zum Gl&uuml;ck hat sich diese Situation dank Dateisystemen wie AFS, PFS, SFS und 
anderen ge&auml;ndert. Doch die Gefahr bleibt!

OK, aber was hat das mit alten Computern zu tun, werdet ihr euch jetzt 
fragen. Nun ja...Festplatten gehen auch schnell mal kaputt, aber darauf 
will ich nicht hinaus, da das ja bekannt sein d&uuml;rfte. Ich wollte nur 
klarmachen wie schmerzlich ein Datenverlust ist! Und doch ... wie lange 
sollen noch mal die 3.5"-DD-Disketten die Daten halten k&ouml;nnen? Mmmmh? Keine 
Ahnung? Ich werd's euch verraten, es sind so ca. 10 Jahre, die die Daten 
halten sollen und es scheint zuzutreffen, denn auch am Amiga gibt es 
Disketten, die bereits &auml;lter sind als 10 Jahre. Vornehmlich werden es wohl 
Spiele-Disketten sein deren Daten sich im wahrsten Sinne des Wortes 
verfl&uuml;chtigen! Auch das h&ouml;rt man immer wieder: "Brauche Diskette Nummer 3 
von Spiel xyz, da defekt!". Und wer seine wertvollen Spiele nicht alle 10 
Jahre neu auf eine Sicherungsdiskette speichert, wird irgendwann nur noch 
eine leere Diskette mit einem h&uuml;bschen Etikett drauf haben. OK, immer mehr 
von den alten Spielen werden legal zug&auml;nglich &uuml;bers Internet, aber leider 
handelt es sich dann meisten um gecrackte Versionen. Und wie sieht denn das 
aus: eine Originaldiskette bespielt mit einer gecrackten Version, wo man 
von einem Cracker-Intro begr&uuml;&szlig;t wird.... :(.

Besser sieht es da mit CD-ROMs aus. Diese Daten auf einer CD-ROM gehen 
theoretisch nie weg. Aber CD ist nicht gleich CD! Denn gebrannte CDs k&ouml;nnen 
ihre Daten verlieren. Zuviel Sonnenlicht soll bei den empfindlichen 12-fach 
Wieder-Beschreibbaren schon reichen.

Und die Zukunft? Die sieht nicht besser aus. Biologische Displays, die zwar 
superleicht sind und ganz wenig Strom brauchen, also ideal f&uuml;r tragbare 
Ger&auml;te sind, haben z.B. nur eine Lebensdauer von ca. 5 Jahren. 
Computerprozessoren werden vermehrt schon standardm&auml;&szlig;ig &uuml;bertaktet oder 
sogar so gebaut das sie nicht lange halten, ok, wozu auch, wenn man 
bedenkt, dass alle 6 Monate die Me&szlig;latte noch h&ouml;her gesteckt wird. Doch 
sind Prozessoren, die mit mehr als 1 GHz arbeiten und bereits im 
Radiobereich richtig stark senden, noch sinvoll? Ich denke nicht... man mu&szlig; 
zwangsl&auml;ufig weg vom Hochtakten und hin zum Multiprozessor. Oder gar zum 
Quantenrechner! Am besten sollten Positronenrechner sein, die Berechnungen 
in Minuszeit erledigen...aber l&ouml;sen wir damit nicht auch eine Singularit&auml;t 
aus?!? Na, mal sehen, was die Zukunft noch so bringt ;)

Bleibt mir abschlie&szlig;end nur zu sagen: "Haut nicht so stark in eure Tasten 
des Keyboard´s, denn mit der Zeit verdampfen die Weichmacher und die Tasten 
werden spr&ouml;de und brechen leichter ab..." ;).

Dirk (Wax) Wenk &lt;dw@teleservice.com&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
