<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>


<p><li>  Und es gibt mal wieder neues von der <b>Stratovarius</B> Front: Das sowohl Gitarrist Timo Tolkki als auch S&#228;nger Timo Kotipelto an Soloalben basteln, war ja bereits bekannt. Nun gibt es erste Info`s &#252;ber die jeweiligen Alben: Timo Tolkki`s Soloalbum wird &quot;Hymn To Life&quot; hei&#223;en und wird im Januar 2002 ver&#246;ffentlicht. Mit von der Partie wird auch Stratovarius Urmitglied Mika Ervakari (Keyboards) sein. Was das Soloalbum von Herrn Kotipelto angeht ist zwar weder ein Name noch ein Releasedatum bekannt, aber daf&#252;r gibt es schonmal eine ganze Liste an hochkar&#228;tigen Gastmusikern, die auf dem Album zu h&#246;ren sein werden. Beispiele gef&#228;llig? Mike Romeo (Symphony X), Roland Grapow (Helloween), Arjen Lucassen (Ayreon), Jari Kainulainen (Stratovarius), Janne Warman (Children of Bodom), Mikko Harkin (Sonata Arctica) und viele weitere....</LI></P>

<p><li>  Die Newcomer <b>Edenbridge</B>, die im letzten Jahr mit &quot;Sunrise In Eden&quot; ein gutes Debutalbum hinlegten, haben mit den Arbeiten zum zweiten Longplayer begonnen, der den Titel &quot;Arcana&quot; tragen wird. Ver&#246;ffentlicht wird die Scheibe allerdings erst im November - ihr m&#252;sst Euch also noch etwas gedulden!</LI></P>

<p><li> Hoch her geht es momentan im Camp von <b>Grave Digger</B>. Der Grund daf&#252;r ist nicht etwa das neue Line-up, sondern vielmehr der abtr&#252;nnige Gitarrist Uwe Lulis. Dieser hat n&#228;mlich -zusammen mit ex-Grave Digger Basser Tomi G&#246;ttlich - eine neue Band gegr&#252;ndet. Soweit nix schlimmes, w&#228;re der gute Mensch nicht auf die Idee gekommen, seine neue Combo - in Anlehnung an das bisher st&#228;rkste Grave Digger Album &quot;Tunes Of War&quot; - &quot;Grave Digger`s Tunes Of War II&quot; zu nennen. Zwar war Uwe Lulis an diesem Album beteiligt, aber erwartunsggem&#228;&#223; haben die richtigen Grave Digger etwas gegen den Namen und wollen dagegen vorgehen. Da ist &#196;rger wohl schonmal vorprogrammiert.

<p><li>  Einen kleinen Line-up Wechsel gibt es mal wieder im <b>Annihilator</B> Camp: Drummer Ray Hartmann musste aus famil&#228;ren Gr&#252;nden seine Segel bei der kanadischen Metal Combo streichen und wird durch Randy Black ersetzt, der von 1993 bis 1996 schonmal hinter der Schie&#223;bude bei Annihilator sa&#223;. Ray Hartmann`s zweites Projekt Speed wird aber weiterhin Platten ver&#246;ffentlichen.

<p><li>  News gibt es auch endlich von <b>Angra</B>: Im Herbst soll der erste Longplayer mit der fast komplett umgekrempelten Besetzung erscheinen. Die ausgestiegenen Members Andre Matos, Luis Mariutti und Ricardo Confessori haben unterdesen ihre neue Band Shaman betitelt und wollen im Oktober das Debutalbum auf 
die Fans loslassen. Wird sicherlich ein interessantes Wetrennen.

<p><li>  Egozentriker <b>Malmsteen</B> hat mal wieder zugeschlagen: Auf der Tour zu seinem aktuellen Album &quot;War To End All Wars&quot; hat er sich mit seinem neuen S&#228;nger Jorn Lade derma&#223;en in den Haaren gelegen, da&#223; die Security schon die Polizei gerufen hatte. Jorn Lade und sein Bandkollege und Freund John Macaluso packten daraufhin die Koffer und der verdutzte Malmsteen musste daraufhin die nachfolgenden Dates canceln, nachdem es ihm nicht gelungen war seinen langj&#228;hrigen S&#228;nger Jeff Scot Soto (u.a. auch Axel Rudi Pell, Talisman) in`s Boot zu holen. Verst&#228;ndlich, wenn man sich so &#252;berlegt, was der gute Yngwie manchmal so f&#252;r Launen hat.... 

<p><li> Nach dem meiner Meinung nach sehr starken, aber leider nur auf dem japanischen Markt erschienenem Soloalbum &quot;Readiness To Sacrifice&quot; von ex-Helloween Frontmann <b>Michael Kiske</B> wird der n&#228;chste Longplayer nicht nur deutlich h&#228;rter ausfallen, sondern auch wieder in Europa regul&#228;r erh&#228;ltlich sein. Ob das ganze aber in die Helloween Richtung gehen wird, darf bezweifelt werden. Ver&#246;ffentlicht wird die Scheibe im September.

<p><li>  Nun ist es amtlich: Die Pl&#252;schkapelle House Of Lords hat sich reformiert und will bis Ende des Jahres das Comebackalbum eingerockt haben. Ob man damit aber an alte Glanztaten ankn&#252;pfen kann, sei vorerst dahingestellt.

<p><li>  Die Rarit&#228;ten Compilation mit dem Projektnamen &quot;Catacombs&quot; aus dem Hause <b>Bruce Dickinson</B> wurde ja schon vor einiger Zeit angek&#252;ndigt, hat aber bis heute nicht das Licht der Welt erblickt. Aus der Welt ist die Scheibe aber noch nicht und erscheinen soll das Teil auf jeden Fall noch - w&#228;re ja auch eine absolute Frechheit, das noch nicht ver&#246;ffentlichte Material vom &quot;Lost Keith Olsen Album&quot; den Fans vorzuenthalten. Einen konkreten Termin gibt es aber nach wie vor noch nicht f&#252;r eine Ver&#246;ffentlichung. 

<p><li>  Herber Schlag f&#252;r alle <b>Skyclad</B> Fans: S&#228;nger Martin Walkyier hat die Band aus finanziellen Gr&#252;nden verlassen. Skyclad werden aber mit dem bisherigen Line-up weitermachen, wobei Kevin Ridley ab sofort die Vocals &#252;bernehmen wird. Martin Walkyier widmet sich fortan seinem neuen Projekt Return To The Sabbat, in dem er - der Name sagt es eigentlich schon - quasi seine pre-Skycald Band Sabbat, die mit &quot;History Of A Time To Come&quot; und &quot;Dreamweaver&quot; zwei absolut perfekt CD`s abgeliefert haben, wieder aufleben l&#228;sst. 

<p><li>  Ganz aufgel&#246;st haben sich gleich die britischen Rocker <b>Skunk Anansie</B>, die bisher drei Platten ver&#246;ffentlicht hatten. Die einzelnen Bandmembers wollen ab sofort die eigenen Solokarrieren in`s Rollen bringen, betonen aber, da&#223; es unter den ehemaligen Bandmembers kein B&#246;ses Blut gegebn hat. 

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
