<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Drakkar: Gemini</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><center><font color="green">Drakkar: Gemini</Font></Center></h1></P>

Die italiniesche Metal Szene lebt offenbar, wie es zuletzt Bands wie
Rhapsody, Labyrinth oder auch die viel diskutierten White Skull gezeigt
haben. Mit &quot;Gemini&quot; meldet sich eine weitere Band aus dem sonnigen Italien
auf der Bildfl&#228;che zur&#252;ck - die Rede ist von Drakkar, die Ende `98 bereits
mit ihrem Debut &quot;Quest For Glory&quot; (welches f&#252;r ein Debut Album recht stark
ausgefallen ist und an dieser Stelle empfohlen werden kann) positive
Resonanzen ernten konnten. Ich pers&#246;nlich war sehr gespannt auf den
Nachfolger, der ohne gro&#223;e Ank&#252;ndigungen quasi aus dem nichts erschienen ist
und ebenfalls recht gut ausgefallen ist. An der Marschrichtung der Band hat
sich erwartunsgem&#228;&#223; nichts ge&#228;ndert: Immer noch spielt die Band melodischen
Power Metal mit leichter teutonischer Pr&#228;gung der Marke Helloween (fr&#252;he
Werke dieser Band), Gamma Ray oder auch Running Wild - wenngleich man es, im
Gegensatz zum Debut, geschafft hat, den Songs noch mehr Eigenst&#228;ndigkeit
mitzugeben, womit der Band ein Gro&#223;teil des plagitativen Charakters genommen
wird. Neue Impulse werden Drakkar sicherlich im Bereich des Power Metals
nicht setzen k&#246;nnen, aber sie machen die Musik auf ihre eigene Art und
solange sie damit so gelungene Werke wie den genialen Opener &quot;Eridian Falls&quot;
(dem das &#252;bliche Intro vorangestellt ist), die Midtempokeule &quot;Pure Of Heart&quot;
oder auch Ohrw&#252;rmer wie &quot;Soldiers Of Death&quot; und &quot;The Voice Of The Wind&quot; (bei
dem Helloween Klampfer Roland Grapow &#252;brigens zwei Soli beisteuerte)
fabrizieren, ist dagegen auch &#252;berhaupt nichts einzuwenden. Hinzu kommen noch
lupenreine Power Metal Kompositionen der Marke &quot;The Climb&quot; oder &quot;The
Secret&quot;, die neben den teutonischen Einfl&#252;ssen ein wenig an Iron Maiden
erinnern, aber dennoch voll begeistern k&#246;nnen. Gekr&#246;nt wird das Konzeptalbum
(mit einer recht netten Fantasy Story, die sehr klischeehaft daherkommt)
noch von einer lupenreinen Ballade mit dem Titel &quot;The Price For Victory&quot;, die
auch gleichzeitig das Ende der fast einst&#252;ndigen CD darstellt. Bleibt unter
dem Strich also ein gutes Power Metal Album, das sich auf der einen Seite
zwar an bekannte Muster anlehnt, daf&#252;r aber insbesondere durch den sehr aktzentreichen
Gesang von Luca Cappellari (wobei dieser weniger extrem ausgefallen ist als
auf dem Debut) der Marke Michael Kiske (ex-Helloween) deutlich von anderen
08/15 Alben dieses Genres abhebt. Da zudem die Produktion auch recht amtlich ausgefallen ist, was beim Vorg&#228;nger ja leider nicht immer der Fall war, kann ich allen Fans des melodischen deutschen Power Metals (Helloween &amp; Co.) sowie Fans von True Metal Combos der Marke HammerFall &quot;Gemini&quot; ans Herz legen. Von Drakkar wird man sicherlich in Zukunft noch h&#246;ren!</P>

Fazit: 8.5 von 10 Punkten</P><center>
<img src="kit.gif"></P>
<img src="cd2.jpg"></P>
<img src="kit.gif"></P></Center>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
