<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Lefay: S.O.S.</title>
</head>

<h1><center><font color="Green">Lefay: S.O.S.</Font></center></h1></P>

Eine Band, die in den letzten Monaten und Jahren wirklich nicht vom Gl&#252;ck
verfolgt war (um es mal milde auszudr&#252;cken), ist Lefay. Die ehemaligen Morgana Lefay, die
vor gerade mal
einem Jahr das superbe Album &quot;The Seventh Seal&quot; herausgebracht haben und uns
zwischenzeitig noch mit einer Neuaufnahme der mitlerweile vergriffenen
ersten Morgana Lefay CD &quot;Symphony Of The Damned&quot; erfreut haben, haben mit
&quot;S.O.S.&quot; nun ein weiteres Album am Start, das mit dem hohen
Qualit&#228;tsstandard der Vorg&#228;ngeralben m&#252;helos mithalten kann und das, obwohl
die komplette CD unter einem enormen Zeitdruck entstanden ist. Das merkt man
der hervorragend produzierten CD freilich zu keinem Zeitpunkt an und schon
beim ersten Durchlauf der CD wird sehr deutlich, da&#223; die Jungs ihr Handwerk
verstehen. Das gilt zwar zweifellos auch f&#252;r ein Gro&#223;teil der diversen weiteren
Power / True Metal Bands, aber ich habe in den letzten Monaten doch sehr wenige
Power Metal CD`s geh&#246;rt, die zum einen absolut klischeefrei und zum anderen
mit derma&#223;en abwechselungsreichen, weil nicht st&#228;ndig nach bekannten
Schemata aufgebaut, Songs
daherkommen. Aber
nicht das ich hier falsch verstanden werden: Auf irgendwelche kommerziellen
Experimente verzichten die Jungs von Lefay erwartungsgem&#228;&#223; auch auf S.O.S., aber es finden
sich sowohl epische St&#252;cke wie etwa &quot;The Choice&quot; als auch trashig
angehauchte Kompositionen der Marke &quot;Quest For Reality&quot; auf dem neuen Opus. Hinzu kommt mit dem
Titeltrack noch ein wahrer Nackenbrecher und mit der etwas Queensryche-lastigen Hymne &quot;What Dreams
Forbode&quot; haben Lefay tats&#228;chlich einen Ohrwurm der Extraklasse geschrieben,
der sicherlich zu den besten der Bandgeschichte geh&#246;rt und sich garantiert
zu einer festen Institution bei Livegigs mausern wird. Schwachpunkte muss
man bei &quot;S.O.S.&quot; mit der Lupe suchen und wird sich selbst dann noch schwer
tun, welche zu finden. Jeder Track vermag von der ersten Sekunde an voll zu
&#252;berzeugen, was sicherlich eindrucksvoll f&#252;r die klasse Leistung der Jungs
spricht.
Insofern ist &quot;S.O.S.&quot; ein gnadenlos geniales Metal
Album der klassischen Pr&#228;gung geworden und ist f&#252;r Fans dieses Bereichs ein
unabdingabres Muss. Eine klare Kaufempfehlung! </P>

Fazit: 10 von 10 Punkten </P><center>
<img src="kit.gif"></P>
<img src="cd4.jpg"></P>
<img src="kit.gif"></P></Center>
<a href="lefay.jpg">Bandphoto</A></P>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
