<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<h1><center><font color="RED">Newsflash</font></Center></h1></P>
<ul>
<li> Anscheinend ist S&#228;nger Joacim Cans aus dem Hause <b>HammerFall</B> in den letzten Monaten arg unterbesch&#228;ftigt gewesen. Denn nicht anders kann man das Release des Debutalbums &quot;Lotus&quot; von <b>Mrs.Hippie</B> deuten, bei denen Joacim Cans hinterm Mikro steht. Das ganze hat zwar mit True Metal weniger zu tun und wird von der Plattenfirma als eine Mischung von Kyuss und Iron Maiden bezeichnet, aber vermarkten l&#228;&#223;t es sich offenbar dennoch gut.</P><br>

<li> Ordentlich gekracht hat es bei den New York Metallern <b>Riot</B>: Nachdem man nach dem guten letzten Album eigentlich <b>Dio</B> auf dessen US Tour supporten sollte, hat es sich Chefdenker Mark Reale offenbar anders &#252;berlegt und die Tour aus angeblich finanziellen Gr&#252;nden gecancelt. Das er in der freigewordenen Zeit die zweite <b>Westworld</B> Scheibe in Angriff genommen hat , fanden seine Bankollegen wohl weniger lustig und haben angeblich allesamt die K&#252;ndigung eingereicht, so da&#223; Reale momentan alleine f&#252;r Riot verantwortlich ist.</P><br>

<li><b> Iced Earth</B> sind auf der Suche nach einem neuen Drummer endlich f&#252;ndig geworden: Niemand geringeres als Richard Christy (<B>Death / Control Denied</B>) sitzt fortan hinter der Schie&#223;bude. Ferner ist er auch noch f&#252;r die Gigs von <b>Demons &amp; Wizards</B> (ein Iced Earth Nebenprojekt mit Hansi K&#252;rsch) im Sommer eingeplant. Inwiefern davon seine T&#228;tigkeit bei <b>Death / Control Denied</B> beeintr&#228;chtigt sein wird, kann zum jetztigen Zeitpunkt noch nicht gesagt werden und wird sich wohl erst herausstellen, wenn <b>Iced Earth</B> im August zur Kernphase der Produktion des neuen Albums &#252;bergehen.</P><br>

<li> Nachdem schon vor einigen Monaten eine <b>Samson</B> Reunion angek&#252;ndigt wurde, ist es jetzt endlich offiziell: Paul Samson, Chris Aylmer, Barry Purkis (besser bekannt unter seinem Pseudonym &quot;Thunderstick&quot;) und Nicky Moore haben sich wieder zusammengetan und wollen im Sommer ein neues Album am Start haben. Wenn man mal von den halbgaren Reunions absieht, die uns bisher so &quot;erfreut&quot; haben, und man zudem bedenkt, da&#223; <b>Samson</B> nach <b>Bruce Dickinson`s</B> Ausstieg (ihn zog es bekannterma&#223;en zu <b>Iron Maiden</B>) kaum noch etwas vern&#252;nftiges auf die Reihe bekommen haben, kann man das ganze aber erstmal gen&#252;&#223;lich abwarten anstatt sofort in grenzenlose Hysterie zu verfallen. Interessanter w&#228;re es da schon, wenn man <b>Bruce Dickinson</B> als Gast Musiker gewinnen k&#246;nnte und man so vielleicht an Heldentaten wie &quot;Head On&quot; oder &quot;Shock Tactics&quot; ankn&#252;pfen k&#246;nnte - aber davon ist wohl nicht auszugehen...</P><br>

<li> Zumindest etwas mehr Klarheit hat man nun im <B>Savatage</B> Lager: Gitarrist Al Pitrelli scheint nun endg&#252;ltig bei <b>Savatage</B> aus- und bei Megadeth eingestiegen zu sein. Eine offizielle Best&#228;tigung liegt zwar nach wie vor nicht vor, d&#252;rfte aber nicht mehr lange auf sich warten lassen. Einen Nachfolger hat man bei <b>Savatage</B> zwar noch nicht pr&#228;sentieren k&#246;nnen, aber daf&#252;r sind die Songwriting Arbeiten am neuen Album &quot;Poets &amp; Madman&quot;, welches schon mehrfach verschoben wurde, wohl endlich abgeschlossen und nach ersten Informationen zufolge soll das neue Album wieder deutlich h&#228;rter ausfallen als die letzten beiden (wohlgemerkt grandiosen!) Konzeptalben. Einziger W&#228;rmutstropfen: Ein Releasetermin wurde nach wie vor nicht bekannt gegeben...</P><br>

<li> Und da wir gerade bei <b>Savatage</B> sind: Das Rockoper Sideprojekt <b>Trans-Siberian Orchestra</B> der beiden Vordenker Jon Olivia und Paul O`Neill geht nunmehr in die dritte Runde und besch&#228;ftigt sich zum ersten mal nicht mit Weihnachtsgeschichten wie die beiden Vorg&#228;nger, sondern mit Beethovens 10. Symphonie, die niemals erschienen ist. Die erstklassige Handlung des Konzeptalbums, betitelt mit &quot;Beethoven`s Last Night&quot; kann man schon im Internet nachlesen und in Amerika ist das Album bereits ver&#246;ffentlicht. Ob es jemals in Europa erh&#228;ltlich sein wird, ist derzeit noch unklar.</P><br>

<li> Nicht mehr unklar ist hingegen das Releasedatum von <b>Andi Deris</B> (<B>Helloween</B> S&#228;nger) zweiter Soloscheibe: Nachdem &quot;Done By Mirrors&quot; in Japan bereits letztes Jahr ver&#246;ffentlicht wurde, ist es in Deutschland im Mai auch soweit. Somit kann die Scheibe als &#220;bergangs CD zum n&#228;chsten <b>Helloween</B> Album gesehen werden, dessen Release zwar noch nicht feststeht, aber an der bereits unter Aufsicht von <b>Roy Z</B> (u.a. Bruce Dickinson, Rob Halford) gearbeitet wird.</P><br>

<li> Nachdem man jetzt schon seit Monaten von der italienischen Prog. / Power Metal Combo <b>Athena</B> (auf derren Debut Album &quot;A New Religion?&quot; seinerzeit<b> Fabio Lione</B> von <b>Rhapsody / Vision Divine</B> zu h&#246;ren war) nix mehr geh&#246;rt hat, so sollen diese laut Infos von Fabio Lione momentan mit einem neuen S&#228;nger arbeiten und das Material soll deutlicher in die Power Metal Ecke der Marke Blind Guardian gehen. Wann die Jungs aber mit einem neuen Langeisen r&#252;berkommen, ist zum jetztigen Zeitpunkt nicht ersichtlich.</P><br>

<li> Der &quot;Reaper&quot;, alias <b<Chris Boltendahl</B> von <B>Grave Digger</B>, kennt wohl keine Verschnaufspause: Zusammen mit Totengr&#228;ber Uwe Lullis arbeitet er an Material f&#252;r sein erstes Soloalbum, welches auf griechischen Sagenelementen basiert und sehr Folk-lastig klingen soll. Wir lassen uns mal &#252;berraschen...</P><br>

<li> Auch <b>Paul Di`Anno</B>, seines Zeichens ehemaliger S&#228;nger bei <B>Iron Maiden</B> und anschlie&#223;end aufgrund von Drogenproblemen etwas in der Versenkung verschwunden, lebt noch: So hat der sympatische Frontman in Sao Paulo jetzt ein neues Album mit ausschlie&#223;lich brasilianischen Musikern aufgenommen und selbiges mit &quot;Nomad&quot; betitelt. Bleibt ihm nur zu w&#252;nschen, da&#223; er damit mehr Erfolg hat als mit all seinen Projekten in den letzten Jahren - zu g&#246;nnen ist es ihm allemal!</P><br>

<li> Im Hause <B>Steel Prophet</B> steht wohl nix mehr still: Nachdem man gerade mit dem superben Album &quot;Messiah&quot; bewiesen hatte, da&#223; man nach wie vor zu Gro&#223;taten f&#228;hig ist (und dies nach jahrelanger Existenz als Underground Combo auch endlich einem gr&#246;&#223;eren Publikum zug&#228;nglich machen konnte), hat Chef Steve Kachinsky bereits 14 neue Nummern am Start, von denen aber nur einige auf der n&#228;chsten <B>Steel Prophet</B> Scheibe zu finden sein werden. Die anderen werden 
f&#252;r ein Sideprojekt mit <b>Dreams Of Sanity</B> S&#228;ngerin Sandra Schelert verwendet, auf der der typische <B>Steel Prophet</B> Sound mit Elementen aus dem Gothic Bereich vermengt wird. <B>Steel Prophet</B> selber planen f&#252;r dieses Jahr (Herbst) noch eine Doppel CD, die zum einen das l&#228;ngst vergriffene Demo &quot;Inner Ascendence&quot; und zum anderen eine CD mit s&#228;mtlichen Coverversionen beinhalten soll.</P><br></UL>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
