<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<AUTHOR: Kilian Servais On Amiga Computer>
<title>Oldie Review: Virgin Steele`s "Noble Savage"</title>
</head>

<body background="mcback.gif" text="ffffff" link="ffffff" alink="ff00ff" vlink="ffff00">
<H1><Center>Oldie Review: Virgin Steele`s "Noble Savage"</H1></Center></P>

Virgin Steele geh&#246;ren seit jeher zu den festen Gr&#246;&#223;en im Bereich Power Metal und haben durch die Bank hinweg gute Alben abgeliefert (auch wenn man ein Rock Album wie &quot;Life Among The Ruins&quot; nicht unbedingt erwartet h&#228;tte), aber nie den angemessenen Erfolg daf&#252;r bekommen. Eine CD, die hervorragend verdeutlicht, wie zeitlos Heavy Metal sein kann, stammt von eben dieser Band und wird von vielen Fans der Band als ihr bestes Werk angesehen. Die Rede ist nat&#252;rlich von dem 1986 ver&#246;ffentlichten Album &quot;Noble Savage&quot;, wie Insider evtl. schon erkannt haben.</P>

&quot;Noble Savage&quot; zeichnet sich vor allem durch seine Vielschichtigkeit und Abwechselung aus, was bei vielen modernen Alben schlicht und einfach fehlt. So sind Kompositionen wie der Opener &quot;We Rule The Night&quot; oder das aggressive &quot;Figh Tooth And Nail&quot; einfach nur zeitlose und sehr direkte Heavy Metal Granaten wohingegen Kompositionen wie &quot;Angel Of Light&quot;, &quot;Thy Kingdom Come&quot; oder der &#220;berhammer &quot;Noble Savage&quot; (die vielleicht beste Komposition, die die Band je geschrieben hat) sehr epische und pomp&#246;se Kompositionen mit einer geh&#246;rigen Portion Bombast. Hinzu kommen mit &quot;I`m On Fire&quot; und &quot;Rock Me&quot; zwei solide Hard Rock St&#252;cke und mit &quot;Don`t Close Your Eyes&quot; gibt`s obendrein noch eine superbe Ballade, die wirklich unter die Haut geht. Das alles ist versehen mit einigen instrumentalen Zwischenpassagen, die das ganze zu einem wahren Klangerlebniss machen und zudem f&#252;r einen &quot;weichen&quot; &#220;bergang zwischen den einzelnen Tracks sorgen. 
Merkmal der ganzen CD ist nat&#252;rlich der markante Gesang von David DeFeis, der auf der einen Seite sehr aggressiv r&#252;berkommen kann, aber auf der anderen Seite auch perfekt zu einer Ballade passt. Teilweise &#252;bertreibt er es zwar mit den hohen T&#246;nen liefert aber trotzdem eine hervorragende Performance ab und geh&#246;rt zu einer der herausragenden Pers&#246;nlichkeiten in diesem Genre. </P>

Die musikalische Mischung ist also sicherlich excellent und zudem ist das ganze noch in eine ordentliche Produktion gepackt worden, die auch heute noch richtig knallt. Das Album wurde &#252;brigens 1997, angereichert mit 6 Bonus Tracks und Liner Notes von David DeFeis, erneut auf den Markt gebracht und geh&#246;rt sicherlich zu den Perlen des US Power Metals und kann, wie auch die weiteren Virgin Steele Alben (wenn man mal vom sehr Whitesnake-lastigen und daher untypischen &quot;Life Among The Ruins&quot; absieht) bedenkenlos empfohlen werden. Zeitloser Power Metal ohne Einschr&#228;nkungen!</P>


Fazit: 10 von 10 Punkten</P><center>
<img src="kit.gif"></P>
<img src="oldie.jpg"></P>
<img src="kit.gif"></P></CEnter>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
