<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - GoldED 6 (Update)</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>GoldED 6.0.5-Update</H1>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A>
</DIV>

<p>Etwas Zeit ist ins Land gegangen und so sind diverse GoldED-Updates seit
dem <a href="../sw/9812ged.htm">letzten Test</a> in Ausgabe #7 erschienen. Inzwischen ist die Version
6.0.5 aktuell. <b>Auf der neuen CD</b> sind, so weit ich wei&szlig;, s&auml;mtliche alten
Ungereimtheiten beseitigt (ich hatte eine der erste Brennungen erwischt),
des weiteren gibt es eine Vielzahl von kleineren und gr&ouml;&szlig;eren &Auml;nderungen.</p>

<p>Das Update ist <b>erfreulicherweise</b> kostenlos erh&auml;ltlich. Jedoch brachten
bereits die sp&auml;teren 5er Versionen noch einiges an Neuigkeiten und
Bugfixes. F&uuml;r eine vollst&auml;ndige Liste mu&szlig; man sich die History-Datei
durchlesen. Ich werde in diesem Updatebericht nur <b>die wichtigsten Punkte</b>
beschreiben.</p>

<p>Mit der Version 6 wurden die <b>Konfigurationsfenster</b> endlich
gr&ouml;&szlig;enver&auml;nderbar. Was sich f&uuml;r den Enduser vielleicht als nicht so gro&szlig;e
&Auml;nderung darstellt, ist programmiertechnisch jedoch eine Menge Arbeit
(wenn so etwas nicht, wie bei MUI, von der GUI-Engine bereits miterledigt
wird).</p>

<p>Gr&ouml;&szlig;ter <b>Wehrmutstropfen</b> bleibt aber immer noch, da&szlig; GoldED6 den Eindruck
eines Fremdk&ouml;rpers auf dem Amiga macht. Das `Look &amp; Feel` hat sich zwar
durch die gr&ouml;&szlig;enver&auml;nderbaren Fenster (die sich &uuml;brigens ihre Gr&ouml;&szlig;e auch
merken k&ouml;nnen), teilweise neuen Gadgets und einem optionalen &quot;Classic&quot;-
Look f&uuml;r String-Felder schon verbessert, jedoch bleibt der Eindruck
bestehen, ein Win-Programm vor sich zu haben.</p>

<p>Ansonsten besticht GoldED weiterhin durch seine <b>Vielseitigkeit</b> und
Konfigurierbarkeit. Die einzelnen zus&auml;tzlichen Umgebungen werden auch
intensiv weiterentwickelt, um von den neuen Funktionen Gebrauch zu machen.</p>

<p>Die Erweiterungen k&ouml;nnen nun, durch eine Verbesserung der API, in dem
Editorfenster sogenannte <b>Container</b> &ouml;ffnen. Damit ist es den Erweiterungen
m&ouml;glich, diese Container zu benutzen, um selber GUI-Elemente darzustellen
und damit direkter mit dem Anwender Informationen auszutauchen.</p>

<p>Die vielen zus&auml;tzlichen Umgebungen f&uuml;r GoldED nutzen diese M&ouml;glichkeit
auch und so stellt z.B. die C/C++ -Umgebung die vorhandenen Sourcecode-
und Headerdateien in einem Container dar, wodurch man schnell eine
ben&ouml;tigte Datei - einen gro&szlig;en Monitor voraus gesetzt, da der Container
einen guten Teil des Fensters in Anspruch nimmt :) - laden kann. Als
kleinen Gag bietet GoldED auch ein Minen-Spiel f&uuml;r zwischendurch.</p>

<p>Einige Funktionen, sowohl von GoldED direkt, als auch von den Env-
Erweiterungen, sind <b>beschleunigt</b> worden, zum Beispiel ist der HTML-Parser
schneller und auch das Erstellen von Backups erfordert wesentlich weniger
Zeit.</p>

<p><b>Hinweis</b> zum letzten Testbericht: Wichtig zu erw&auml;hnen ist noch, da&szlig; die 
einzelnen Datentypen-Konfigurationen separat aufgebaut sind, d.h. man kann z.B. f&uuml;r 
AmigaGuide-Dateien ein eigenes Men&uuml; zusammenstellen, das dann dem normalen 
hinzugef&uuml;gt und bei einer betreffenden Datei automatisch angeboten wird. 
Dadurch braucht man auch nicht jedes Mal die Men&uuml;s f&uuml;r alle Dateitypen einzeln 
&auml;ndern, sondern kann dies zentral an einer Stelle tun.</p>

<p>Au&szlig;erdem k&ouml;nnen die im <a href="../sw/9812ged.htm">letzten Test</a> angesprochenen Font-Probleme (bereits in 
Version 5) durch ein entsprechendes Setzen der Requester-Skalierung in der Konfiguration 
behoben werden. (Vielen Dank an Dietmar Eilert f&uuml;r die Erg&auml;nzungen.)

<p>[Somit f&uuml;hrten die Erweiterungen gegen&uuml;ber Version 5 zu einer besseren
 Bewertung der Kriterien 'Benutzerfreundlichkeit' und 'Preis-/Leistung'.
 Das Gesamturteil hat sich nicht ver&auml;ndert; d. Chefred.]</p>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>GoldED</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://members.tripod.com/golded/golded.htm">Dietmar Eilert</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Texteditor</TD>
    <TD><B>Version:</B></TD>
    <TD>6.0.5</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>89,90 DM/Upd.:49,90&sup1;DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Autor</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2&sup2;</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<p>&sup1;) Der Updatepreis bezieht sich auf Versionen vor GoldED 5, da das
   Update von dieser Version auf V 6 kostenlos ist.</p>

<p>&sup2;) Das GUI bleibt durch das inkonsequente `Look &amp; Feel`
   verbesserungsw&uuml;rdig.</p>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906afc.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906etw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

