<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Amiga Tools 8</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Amiga Tools 8</H1>von<BR>
<A HREF=mailto:G.Franz@gmx.de>Gregor Franz</A></DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma <a href="../amz0699/ferstad.htm">&quot;Ferst Computer&quot;</a>, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
 <a href="../amz0699/ferstad.htm">&lt;Information&gt;</a>
</TD></TR></TABLE>

<P>Diese CD ist bereits die Nummer 8 der Amiga Tools-Serie der Firma TGV
Haupt aus G&uuml;tersloh und wirbt auf ihrem durchschnittlichen, aber durchaus
nicht unansehnlichen Cover damit, auch eine Radarfallen-Datenbank
Deutschlands, sowie eine gro&szlig;e Web-Clipart-Sammlung zu beinhalten.</P>

<P>Im zweibl&auml;ttrigen <B>Booklet</B> gibt es auf Deutsch und Englisch ausf&uuml;hrliche
Hinweise zum rechtlichen Status der enthaltenen PD-Software, die den
L&ouml;wenanteil der enthaltenen Daten stellt. Die zweite Seite kann man
einsenden, um sich registrieren zu lassen.</P>

<P>Im CD-Rom-Laufwerk (4-fach von Mitsubishi) erwies sich die CD als
unangenehm <B>ger&auml;uschvoll</B>. Das ungesunde Rattern schr&auml;nkte Zugriffe auf
Daten allerdings nicht ein. Die Ursache des Problems kl&auml;rte sich nach
dem Test in einem zweiten Laufwerk (32-fach von Mitsumi), in dem die
Drehger&auml;usche eine be&auml;ngstigende Lautst&auml;rke annahmen und stark an eine
Kreiss&auml;ge erinnerten. Nach dem Auswurf fiel auf, da&szlig; sich die CD-
Beschichtung an den R&auml;ndern abzul&ouml;sen anfing - offensichtlich ist hier
eine unzureichende Heiml&ouml;sung zum Aufbringen der Beschichtung verwendet
worden. Nachdem man um das Problem wei&szlig;, sollte es keine gr&ouml;&szlig;eren
Schwierigkeiten bereiten, dies selbst zu verkleben oder die CD gegen
ein solideres Exemplar austauschen zu lassen.</P>

<P>Ein erster Blick in den Inhalt offenbart ein `<B>Assign-CD</B>`-Icon, das
einige wichtige Assigns erstellt, sowie ein `Kill-Asssign-CD`-Icon,
das dieselben wieder r&uuml;ckg&auml;ngig macht.</P>

<P>Unter &quot;<B>TGV-offline</B>&quot; kann man sich auch die Homepage der Firma anschauen,
allerdings mit dem Stand vom 19.04.1998.</P>

<P><B>Inhaltlich</B> bietet die Amiga Tools 8 ansonstem eine breite Mischung
entpackter Programme aus vielen Bereichen, wie es typisch f&uuml;r die
meisten Tool-CD`s ist. Zuerst wende ich mich den versprochenen
Bonus-Daten zu.</P>

<P>Die &quot;<B>Web-Cliparts</B>&quot; (ca. 146 MB) enthalten eine ganze Menge
unterschiedlicher Grafiken, Kn&ouml;pfe, Zeichens&auml;tze und &auml;hnlicher
Elemente in meist zumindest ordentlicher Qualit&auml;t. Ansehen soll man
sich das Ganze &uuml;ber vorbereitete HTML-Files auf seinem Browser (oder
Viewer). Allerdings erwies sich dies als nicht sehr komfortabel, da
es keine Vorschaubilder gibt und man sich langwierig durch
Unterverzeichnisse klicken mu&szlig;, ohne zu ahnen, welcher Stil sich
dahinter wohl verbergen wird. Au&szlig;erdem fiel negativ auf, da&szlig; die
HTML-Seiten mit dem Editor `Microsoft Frontpage 3.0` erstellt worden
sind - nicht die Tatsache der Benutzung eines Editors an sich ist
negativ, sondern die Verwendung von JavaScript-Code in den Seiten,
da die meisten Amiga-Browser damit nichts anfangen k&ouml;nnen.</P>

<P>Lange Rede, kurzer Sinn: Man sollte sich die Bilder m&ouml;glichst mit einem
schnellen, guten Viewer direkt auf der CD anschauen.</P>

<P>Die <B>Radarfallen-Datenbank</B>, eine Datei, die mit einer DataBase-Demo
angezeigt wird, &uuml;berzeugte mich nicht. Negativ fiel schon im ersten
Moment der Schreibfehler im Feld `Komentar` auf, welches ja permanent
angezeigt wird und so bereits auf wenig Sorgfalt schlie&szlig;en l&auml;&szlig;t. Es gibt
nirgendwo Angaben &uuml;ber die Herkunft der Datenbank oder ihrer Daten und
die Eintr&auml;ge erschienen mir au&szlig;erdem sehr ausgesucht und auch nicht
up-to-date. Beim Beenden des Programms gab es zus&auml;tzlich noch ein paar
recoverable Alerts, so da&szlig; der Rechner immerhin nicht ganz abst&uuml;rzte.</P>

<P>Doch das, was diese CD ausmacht, sind sicherlich die Tools und Utilities
auf ihr. Das Hauptverzeichnis &quot;<B>Disk-Tools</B>&quot; ist unterteilt in &quot;<B>Backup</B>&quot;
(z. B. ezBackup); &quot;<B>CD-ROM</B>&quot;, das haupts&auml;chlich mehrere CD-Player (z.B.
ACDPlay) und Filesysteme (AmiCDFS) enth&auml;lt.</P>

<P>Im Unterverzeichis &quot;<B>Verschiedenes</B>&quot; findet man u.a. `Autostart`, welches,
&auml;hnlich Windows 95, beim Einlegen von Medien in Laufwerke, definierte
Skripte ausf&uuml;hren kann. `Etiketti` ist zum Erzeugen von Etiketten f&uuml;r
3,5 Zoll-Disketten gedacht und  mit `DeluxeCopy` ist auch ein
systemkonformes Kopierprogramm enthalten. Dann gibt es hier auch noch
Programme zum Bootblock-Editieren, zum Datenaustausch mit Macintosh-
Computern und mit `WorseFormat` kann man Disketten oder Festplatten,
die besch&auml;digt sind, formatieren. Ein spezielles File, das die
besch&auml;digten Sektoren kennzeichnet, wird zus&auml;tzlich abgespeichert, so
da&szlig; nur die unbesch&auml;digten Teile genutzt werden.</P>

<P>&quot;<B>DOpusTools</B>&quot; enth&auml;lt zahlreiche Hilfsprogramme, Skripte und Kn&ouml;pfe
f&uuml;r den bekannten Dateimanager DirectoryOpus.</P>

<P>&quot;<B>Boot-Tools</B>&quot; enth&auml;lt z.B. Uhren-Checkprogramme (falls die HW-Uhr nicht
mehr richtig l&auml;uft), `AnyMem` (l&auml;&szlig;t automatisch zuerst FastRAM belegen
und nur bei Mangel an diesem wird das langsamere ChipRAM verwendet),
`FastRAD` (RAD im FastRAM) und einiges n&uuml;tzliche mehr.</P>

<P>Nat&uuml;rlich gibt es auf der CD auch &quot;<B>Commodities</B>&quot; und zwar &Uuml;ber 20
verschiedene. Darunter ein Aktivit&auml;ts-Monitorprogramm, das Maus- und
Tastaturoperationen des Users z&auml;hlt. `AHElp` und `HandBook` erm&ouml;glichen
durch Druck auf die Help-Taste ein einfaches Ansprechen der Guides
im Help:-Verzeichnis der Workbench. `AvailMem` ist ein guter
Speicheranzeiger, `ClipHistory` dagegen leider nur ein Catalog-Update
des Tools gleichen Namens. `Docket` dient zum Ausf&uuml;hren eingestellter
Programme zu bestimmten Zeiten. `DTInfo` gibt als AppIcon Informationen
(z.B. Gr&ouml;&szlig;en) diverser Datentypen an, die auf ihm fallengelassen werden.
`VesaDPMSpro` erm&ouml;glicht Monitoren, die PowerManagement beherrschen,
auch auf dem Amiga ihre Stromsparmodi zu aktivieren.</P>

<P>&quot;<B>Datenbanken</B>&quot; enth&auml;lt etwa 20 verschiedene Programme, von
Sammlungsmanagern (CD`s, Videos usw.), bis zu Adressen-Datenbanken,
Planern oder ganz allgemeinen und flexibleren L&ouml;sungen (Fiasco).</P>

<P>&quot;<B>Demo-Versionen</B>&quot; enth&auml;lt ca. ein Dutzend eingeschr&auml;nkte Versionen
kommerzieller Programme, wie Wildfire, AWeb 3.0, PictureManager Pro
oder CD-Brennsoftware (BurnIt, MasterISO).</P>

<P>&quot;<B>Grafik</B>&quot; ist wieder unterteilt, in &quot;<B>Anzeigeprogramme</B>&quot; finden sich einigen
ausgew&auml;hlte, u.a. auch AmiPeg f&uuml;r MPEG-Animationen, in &quot;<B>Konverter</B>&quot; z.B.
ArtPro, GifAnim und UltraConv, &quot;<B>Malprogramme</B>&quot; enth&auml;lt CartoonStudio f&uuml;r
Animationen, sowie einige Morph- und kleinere CAD-Programme.
&quot;Verschiedenes&quot; birgt diverse Hilfsprogramme, wie Photoalbum,
Bildersortierer und Jpeg-Optimierer.</P>

<P>&quot;<B>Grafikkartentools</B>&quot; enth&auml;lt, neben Picasso 96 und RTG-Master (f&uuml;r diverse
Spiele), auch Tools zu CGX und z.B. `addCV3Dmem`, welches Teile des
Speichers dieser Grafikkarte zum Arbeitsspeicher hinzuf&uuml;gt.</P>

<P>&quot;<B>Hardware</B>&quot; ist unterteilt in &quot;<B>Bauanleitung</B>&quot;. Hier gibt es ein paar
diverse, wie z.B. f&uuml;r einen 4-fach-IDE-Anschlu&szlig;, eine Funkuhr usw..
&quot;<B>Treiberprogramme</B>&quot; enth&auml;lt u.a. ein paar Treiber f&uuml;r den PCMCIA-Anschlu&szlig;
des A 1200.</P>

<P>&quot;<B>Kommunikation</B>&quot; ist unterteilt in &quot;<B>Mail</B>&quot;, das diverse Mail- und
Hilfsprogramme, aber z.B. nicht YAM (!) enth&auml;lt. Bei &quot;<B>TCP</B>&quot; gibt es
haupts&auml;chlich Hilfsskripte, auch das bekannte DwarfX f&uuml;r AmIRC. In
&quot;<B>WWW</B>&quot; finden sich Hilfsprogramme, wie URL-Manager oder der Editor
`MetalWeb`.</P>

<P>&quot;<B>Spiele</B>&quot; sind auch relativ zahlreich enthalten. Das Verzeichnis ist
unterteilt in &quot;<B>2 Player</B>&quot; z.B. `5inRow` oder das Quiz `Awakening`.
&quot;<B>Action</B>&quot; enth&auml;lt eine handvoll mittelpr&auml;chtiger Vertreter des Genres.
&quot;<B>Brettspiele</B>&quot; birgt u.a. Schach, Risiko und Backgammon. Puzzles und
Kartenspiele finden sich unter &quot;<B>Denkspiele</B>&quot;. &quot;<B>Schiessspiele</B>&quot; enth&auml;lt
u.a. `ADoom`, `Assimilation` und `DeluxeGalaga`. Bemerkenswert fand
ich hier auch das grottenschlechte `BumBum`, bei dem man im
SpaceInvaders-Stil mit einer sowjetrussischen Kanone am unteren
Bildschirmrand neben salutierenden Soldaten ein paar imperialistische
Flugzeuge abballern darf. Wahrscheinlich ist das tschechische AMOS-
Spiel nicht vor der Wende im Ostblock entstanden, technisch und grafisch
w&uuml;rde man es ihm zutrauen.</P>

<P>&quot;<B>HD-Installer</B>&quot; gibt es auch - 131 sind es an der Zahl. In &quot;<B>Tips&Tricks</B>&quot;
finden sich neben dem AB3D-Editor, AmiCheats und dem PSX-Cheater auch
ein paar kleinere Hilfen. Ein paar &quot;<B>Workbench-Spiele</B>&quot; gibt es auch,
z.B. `AmiGotchi`.</P>

<P>Was &quot;<B>Uhren</B>&quot; enth&auml;lt ist teilweise klar, zus&auml;tzlich gibt es hier noch
ein DCF77-Funkuhrprogramm und diverse Wecker- und Erinnerungstools.</P>

<P>Sieben Viruschecker finden sich bei &quot;Virus&quot;. </P>

<P>&quot;<B>Workbenchtools</B>&quot; ist mit 81 Tools recht prall gef&uuml;llt und enth&auml;lt
Utilities, wie MagicMenu, NewIcons oder Printmanager. </P>

<P>&quot;<B>WWW</B>&quot; ist unterteilt in &quot;<B>HTML-Converter</B>&quot; mit Umwandlern z.B. in Tex, in
Text oder in AmigaGuide. 9 &quot;<B>HTML-Editoren</B>&quot; sind enthalten, sowie
&quot;<B>HTML-Tools</B>&quot; (Viewer, Checker usw.).</P>

<P>Das war es im Gro&szlig;en und Ganzen. Nat&uuml;rlich stehen die Beispiele nur
exemplarisch f&uuml;r oftmals wesentlich mehr unterschiedliche Programme. </P>

<P><B>Fazit</B></P>

<P>Was ist mein <B>Gesamteindruck?</B> Die angepriesenen Bonus-Bestandteile
hinterlassen einen eher zwiesp&auml;ltigen Eindruck. Die Radarfallen-
Datenbank hat in der Form sicher kaum praktischen Nutzwert und die
Web-Clipart-Sammlung ist schlecht pr&auml;sentiert, dabei aber qualitativ
nicht schlecht.</P>

<P><B>Entscheidend</B> ist letztlich doch der Kern, da&szlig;, was der CD den Namen
gegeben hat, n&auml;mlich die Tools. Und hier kann man sich durchaus
eine Weile im St&ouml;bern verlieren, die Zusammenstellung erscheint
sorgf&auml;ltig, viel N&uuml;tzliches wurde zusammengetragen.</P>

<P>Doch trotzdem f&auml;llt es schwer die CD einzuordnen: <B>Einerseits</B> ist
sie nicht sonderlich aktuell (im Gegensatz zu den Aminet-CDs),
<B>andererseits</B> ist sie trotzdem keine Referenz-CD, kein echtes
Archiv, da sie zu gro&szlig;e L&uuml;cken offenbart. Viele wichtige `Klassiker`
sind nicht enthalten, das Mailprogramm `YAM`, Marktf&uuml;hrer auf dem
Amiga, sei nur als Beispiel genannt. Wenn das zuungunsten der Gimmicks
anders w&auml;re, k&ouml;nnte diese CD ein Volltreffer sein.</P>

<P>Wer nur einzelne Aminet-CDs besitzt und kaum weitere Tool-CDs, der
kann hier einige gut zusammengestellte, wertvolle Hilfen entdecken.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Amiga Tools 8</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.tgv-haupt.de">TGV Haupt</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Edutainment-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>27,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=1 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=1 ALIGN=CENTER>3</TD><TD COLSPAN=2 ALIGN="CENTER"><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE>

<p>Adresse: Michael Haupt, Dalkestr. 10, D-33330 G&uuml;tersloh<br>
eMail : <A HREF="mailto:michael@tgv-haupt.de">michael@tgv-haupt.de</A><br>
</P>
<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cfp.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906afc.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


