<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - CandyFactory Pro</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>CandyFactory Pro</H1>von<BR><A HREF="mailto:uridium@t-online.de">Peter Fischer</A>
</DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma <a href="../amz0699/ferstad.htm">&quot;Ferst Computer&quot;</a>, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
 <a href="../amz0699/ferstad.htm">&lt;Information&gt;</a>
</TD></TR></TABLE>

<P><B>Na Logo!</B></P>

<P>Wer durch das Internet surft, sieht des &ouml;fteren h&uuml;bsch designte Logos auf
vielen Internetseiten. Und schnell kommt dann der Wunsch auf, solche auch
f&uuml;r die eigene Internetseite zu gestalten.</P>

<P>Bisher f&uuml;hrte dieser Weg meist &uuml;ber kostspielige Raytracingprogramme
deren Bedienung h&auml;ufig recht kompliziert ist.</P>

<P>Nun bietet &quot;Candy Factory Pro&quot; von Motion Studios hierf&uuml;r die
entsprechende Alternative. Dieses Programm, welches schon als Beta-Version
0.54 im Aminet f&uuml;r Aufsehen sorgte, verspricht, auf einfache und schnelle
Weise effektvolle Logos f&uuml;r Internetseiten, Demo-Programmierer oder f&uuml;r
Video-Produktionen zu kreieren.</P>

<P><B>Die technischen Voraussetzungen</B></P>

<P>Als Minimalanforderung sollten ein Amiga mit einem 68030, dem AGA-Chipsatz
und 16 MB RAM ausreichen, schnellere Rechner werden durch optimierte
Programmversionen von Candy Factory Pro ausgenutzt.</P>

<P>Laut des Aufdrucks auf der Updatediskette sollen auch die Draco-Rechner
&quot;Candy Factory Pro&quot; nutzen k&ouml;nnen, leider fanden sich dar&uuml;ber nirgendwo
weitere Informationen.</P>

<P><B>Die Installation</B></P>

<P>&quot;Candy Factory Pro&quot; wird auf einer CD ausgeliefert, der gleichzeitig eine
Diskette mit dem aktuellsten Update beigef&uuml;gt ist, von der aus auch die
Installation auf die Festplatte vorgenommen wird. Ein direkter Start von
der CD aus ist nicht m&ouml;glich. </P>

<P>Die CD enth&auml;lt neben dem Hauptprogramm noch 300 MB Daten. Da&szlig; meiste
davon sind weitere Demoversionen (z.B. &quot;Elastic Dreams&quot; und &quot;Fantastic
Dreams&quot;) der vertreibenden Softwarefirma &quot;Titan Computer&quot;.</P>

<P>Die Installation von &quot;Candy Factory Pro&quot; erfolgt problemlos mit dem Amiga-
Installer. Hierbei w&auml;hlt man die gew&uuml;nschte Version f&uuml;r seinen vorhandenen
Prozessor aus. 68020/030 ohne FPU, 68030 mit FPU, 68040, 68060 und PPC
stehen zur Verf&uuml;gung.</P>

<P><B>Die Anleitung</B></P>

<P>Diese ist in Deutsch und Englisch als Amiga-Guide vorhanden, ein
gedrucktes Handbuch wird nicht mitgeliefert. Die Anleitung ist in meinen
Augen sehr gelungen und &uuml;bersichtlich und vor allem nicht zu sehr mit
Informationen &uuml;berladen, so da&szlig; man danach sofort mit dem Arbeiten an
&quot;Candy Factory Pro&quot; beginnen kann.</P>

<P>Im Programm selbst ist leider keine Online-Hilfe vorhanden, aber da
&quot;CFP&quot; multitaskingf&auml;hig ist, kann man den Guide dadurch separat z.B.
auf einem anderen Screen aufrufen.</P>

<P><B>Das Programm</B></P>

<P>Nach dem Programmstart erfragt &quot;Candy Factory Pro&quot; die gew&uuml;nschte
Aufl&ouml;sung, wobei neben dem AGA-Modus vor allem Grafikkarten optimal
ausgenutzt werden k&ouml;nnen, denn hier stehen im 16- oder 24 Bit-Modus
die True-Color-Effekte zur Verf&uuml;gung, die in den 8 Bit-AGA-Modus
heruntergerechnet werden.</P>
<P>
Danach erscheint die <B>Programmoberfl&auml;che</B>, die zuerst nur ein leeres
Fenster namens &quot;Canvas&quot; bietet. &quot;Candy Factory Pro&quot; wird komplett
&uuml;ber englischsprachige Men&uuml;s bedient.</P>

<P>Hier vermisse ich pers&ouml;nlich eine Steuerung &uuml;ber eine Iconleiste, durch
die sich die Bedienung noch schneller und bequemer handhaben l&auml;&szlig;t, sowie
eine deutsche Lokalisierung.</P>

<P>Immerhin kan man aber alle Fenster, die die Bildverarbeitung vornehmen,
ge&ouml;ffnet lassen und fixiert sichern, so da&szlig; sie sich beim n&auml;chsten
Programmstart sogleich &ouml;ffnen.</P>

<P>Bevor man die Bildverarbeitung beginnen kann, l&auml;dt man zuerst eine
Graustufenmaske oder erstellt diese. Dafuer schreibt man den gew&uuml;nschten
Text direkt in &quot;Candy Factory Pro&quot;, wobei man diesen dann beliebig drehen,
kippen und plazieren kann. Die beste Qualit&auml;t hierbei erreicht man durch
die Nutzung von Vektorfonts, die l&ouml;blicherweise direkt unterst&uuml;tzt werden.</P>

<P>Leider steht bei dieser Methode nur eine einzigen Textzeile zur Verf&uuml;gung.
M&ouml;chte man mehrzeilige Texte erstellen, so bleibt einem nur der R&uuml;ckgriff
auf externe Grafik- oder Textprogramme &uuml;brig.</P>

<P>Nun gibt es im <B>Fenster-Men&uuml;</B> folgende M&ouml;glichkeiten, die Maske zu
bearbeiten:</P>
<UL>
<LI><B>Material</B>           - &auml;ndert Materialeinstellung (dem Programm liegen 39
                     verschiedene Texturen bei, die gen&uuml;gend M&ouml;glichkeiten
                     zum Experimentieren offenlassen)

<LI><B>Lichtquelle</B>        - &auml;ndert Lichtquelleneinstellung

<LI><B>Innere Abschr&auml;gung</B> - f&uuml;gt dem Objekt abgerundete Ecken hinzu

<LI><B>Schattenwurf</B>       - f&uuml;gt dem Objekt einen Schattenwurf hinzu

<LI><B>Gl&uuml;hen</B>             - f&uuml;gt dem Objekt einen Gl&uuml;heffekt hinzu

<LI><B>Bumpmap</B>            - f&uuml;gt eine Bumpmap hinzu

<LI><B>Farb-Texture</B>       - f&uuml;gt farbige Texturen hinzu
</UL>

<P>Alle diese Men&uuml;s sind mit weiteren Unterfunktionen versehen, die eine
sehr gro&szlig;e Auswahl der Bildbearbeitung zulassen.</P>

<P>Und hier spielt &quot;Candy Factory Pro&quot; seine gro&szlig;e St&auml;rke aus: Auf allen von
mir getesteten Rechnerkonfigurationen (68030/50, 68040/25 und PPC200) geht
die Bildbearbeitung schnellstm&ouml;glich, den Prozessoren angepa&szlig;t, vonstatten
und l&auml;&szlig;t jedes mir bekannte Raytracing-Programm locker hinter sich. Gerade
auf den PPC-Rechnern l&auml;uft die Bearbeitung in Echzeit ab (Beispiel:
Rendern eines Bildes in 0,28 Sekunden!) und macht wirklich sehr viel
Spa&szlig;.</P>

<P>Durch die mannigfaltigen Bearbeitungsm&ouml;glichkeiten ist es auch f&uuml;r
Grafikbearbeitungs-Laien problemlos m&ouml;glich, binnen kurzer Zeit
effektvolle Logos zu gestalten.</P>

<P>In den <B>weiteren Men&uuml;s</B> kann man die obligatorischen Aktionen, wie z.B.
Laden und Speichern, Invertieren, Rendern oder L&ouml;schen des Bildes und
einiges mehr durchf&uuml;hren. </P>

<P>Zum Speichern der entworfenen Bilder mu&szlig; ich ein gro&szlig;es Manko von &quot;CFP&quot;
ansprechen: alle Grafiken werden ausschlie&szlig;lich im IFF-Format gesichert.</P>

<P>Da das Programm u.a. damit f&uuml;r sich wirbt, f&uuml;r professionelle
Internetpr&auml;sentation zu sorgen, was es zweifelsohne auch tut, w&auml;ren hier
weitere Speicherformate, wie z.B. &quot;GIF&quot; oder &quot;PNG&quot; sehr w&uuml;nschenswert.
Das letztendliche Konvertieren des IFF-Bildes durch ein externes
Grafikprogramm empfinde ich pers&ouml;nlich als etwas st&ouml;rend.</P>
<P>
<B>Zur&uuml;ck zum Programm</B></P>

<P>W&auml;hrend meiner ausf&uuml;hrlichen Testsitzungen traten keinerlei Fehler auf,
was in den vorherigen Versionen (vor allem der Beta-Version 0.54b) doch
sehr das Arbeiten beintr&auml;chtigte. Allerdings verabschiedete sich mein
Rechner nach dem Beenden der PPC-Version grunds&auml;tzlich fr&uuml;her oder sp&auml;ter
mit Gurus. Daher empfehle ich, direkt nach Beendigung des Programms einen
Neustart durchzuf&uuml;hren, ehe man von dieser unangenehmen Nachwirkung
&uuml;berrascht wird.</P>

<P><B>Fazit</B></P>

<P>&quot;Candy Factory Pro&quot; ist ein Programm, das den gestellen Anforderungen
gerecht wird und auf jeden Fall empfehlenswert ist. Auch Besitzer der
Beta-Version sollten einen Kauf in Erw&auml;gung ziehen, denn gegen&uuml;ber dieser
Version ist &quot;CFP&quot; im Funktionsumfang um ein vielf&auml;ltiges erweitert worden
und l&auml;uft neben der nochmals drastisch erh&ouml;hten Arbeitsgeschwindigkeit
jetzt stabil.</P>

<P>Die Bearbeitung - gerade bei vorhandenem PPC-Prozessor - macht wirklich
viel Spa&szlig; und binnen weniger Minuten hat man sich auch ohne besonderes
grafisches Talent wirklich ein imposantes Logo, Bild oder einen Titel
erstellt.</P>

<P>Einzigst die im Text erw&auml;hnten kleinen Sch&ouml;nheitsfehler, wie z.B. die
englischsprachige Textgestaltung, das Fehlen einer Iconleiste, sowie das
ausschlie&szlig;liche Speichern im IFF-Format, schm&auml;lern den ansonsten sehr
gelungenen Gesamteindruck doch ein wenig.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>CandyFactory Pro</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.TitanComputer.de/motionstudios/">MOTION STUDIOS</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Bildbearbeitung</TD>
    <TD><B>Version:</B></TD>
    <TD>1.02</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>99 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
Adresse : Titan Computer, Mahndorfer Heerstr. 80 a, 28307 Bremen<BR>
EMail   : <A HREF="mailto:MotionStudios@mail.netwave.de">MotionStudios@mail.netwave.de</A>
<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz0699/iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906at8.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

