<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Foundation / Update V1.24</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Foundation / Update V1.24</H1>von<BR>
<A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A>
</DIV>

<P>In Ausgabe 7 des AmZeigers testete ich das Strategie-Spiel <a href="../sw/9812foun.htm">Foundation</a>
und wies auf den umfangreichen Support hin. Dank diesem ist es nun an
der Zeit, einen Update-Bericht zur nunmehr aktuellen Verion 1.24 zu
schreiben.</P>

<P>Neben vielen kleineren &Auml;nderungen, die den Spielablauf betreffen, sind vor
allem die &Uuml;berarbeitung der <B>Grafikroutinen</B>, sowie die <B>Optimierung</B> des
gesamten Programmcodes als wichtigste Neuerungen zu nennen.</P>

<P>W&auml;hrend letzteres vor allem daf&uuml;r sorgt, da&szlig; das Spiel nun etwas fl&uuml;ssiger
l&auml;uft, verdankt man ersterem, da&szlig; es nicht nur viel besser aussieht,
sondern auch noch mal ein wenig kompatibler wurde.</P>

<P>Grafikkarten-Besitzer werden sich freuen, da&szlig; sie Foundation nun auch <B>im
Fenster</B> auf der Workbench laufen lassen k&ouml;nnen. Besitzer von AGA-Amigas
kommen nun ebenfalls in den Genu&szlig; derselben Chunky-Grafik-Routinen, wie
Grafikkarten-Besitzer, die Konvertierung erfolgt mittels einer schnellen
Chunky-to-Planar-Routine, allerdings wird hier nat&uuml;rlich weiterhin ein
separater Screen ge&ouml;ffnet. Durch diese &Auml;nderung wird nun nur noch ein
Hauptprogramm ben&ouml;tigt, die spezielle AGA-Version entf&auml;llt.</P>

<P>Des weiteren macht die Grafik aber auch wesentlich mehr her, denn statt
der alten gek&auml;stelten Bodenstrukturen sieht man nun weiche &Uuml;berg&auml;nge in
den Landschaften, der Rand des Strandes geht in einer geschwungenen Linie
in Wiese &uuml;ber, statt in rechten Winkeln davon abgetrennt zu sein.</P>

<P>Dar&uuml;ber hinaus f&auml;llt nun ein leichtes Sonnenlicht auf die s&uuml;dlichen H&auml;nge,
H&auml;user, Menschen, B&auml;ume und F&auml;hnchen werfen Schatten und durch das Wasser
sieht man den abfallenden Meeresboden schimmern. Jetzt fehlen eigentlich
nur noch ein paar Tiere und man w&uuml;rde sich am liebsten zu den kleinen
M&auml;nnlein und Jungfr&auml;ulein in Foundation gesellen (z.B. in einem
Bauernhaus ;-) ...&auml;hemm). </P>

<P>Bei soviel Neuerungen neigt man ja schnell dazu, zu glauben, das ganze
m&uuml;&szlig;te jetzt beim <B>Scrollen</B> ganz f&uuml;rchterlich ruckeln und man k&ouml;nne die
Inselv&ouml;lker nun mit Schneckenscharen verwechseln. Aber nein, alles l&auml;uft
stattdessen sogar noch subjektiv schneller und weicher.</P>

<P>Auch das <B>Intro</B> l&auml;uft auf AGA-Rechnern nun schneller. Das Rewrite der
Grafikroutinen hat sich also wirklich gelohnt.</P>

<P><B>Probleme</B> machten auf meinem A1200 allerdings immer noch h&ouml;here Aufl&ouml;sungen,
wie beispielsweise `DBLPal:HiRes flimmerfrei`, also 640x512 Bildpunkte,
das Einstellen dieses Modus f&uuml;hrte bei Programmstart zum Absturz.</P>

<P>Ebenfalls komplett &uuml;berarbeitet wurde der <B>Voreinsteller</B> samt Installations-
Routinen. Es lassen sich nun nochmal ein Schwung mehr Einstellungen
vornehmen, vor allem um den neuen grafischen M&ouml;glichkeiten gerecht zu
werden. Die <B>Installation</B> wurde etwas umstrukturiert und so werden nun
mindestens 32 MB Festplattenplatz ben&ouml;tigt, maximal 68 MB. Au&szlig;erdem l&auml;&szlig;t
sich nun einstellen, da&szlig; ASL-Filerequester benutzt werden sollen, so da&szlig;
diverse Patches (REQTools, MUI-ASL) nun auch greifen k&ouml;nnen.</P>

<P>Die letzte gr&ouml;&szlig;ere Neuerung besteht in der M&ouml;glichkeit, <B>eigene Samples</B>
einzubinden. Ein entprechendes Beispiel-Paket liegt auf der Supportpage
zum Download bereit.</P>

<P>Alle weiteren &Auml;nderungen betreffen vor allem den Spielablauf und sind
eher kleineren Ausma&szlig;es. So erh&auml;lt man nun einen Anteil der zum Aufbau
ben&ouml;tigten Materialien zur&uuml;ck, wenn man ein Geb&auml;ude abrei&szlig;t und bei guter
Moral haben die Fischer auch mal zwei statt nur eines Fisches an der Angel.
Au&szlig;erdem wurden einige Bedienungstafeln &uuml;berarbeitet. Das Panel zum Bauen
eines neuen Hauses h&auml;lt beispielsweise nun auch Informationen &uuml;ber die
sp&auml;ter von diesem Haus ben&ouml;tigten Rohstoffe und seine Produkte bereit.</P>

<P>Mittels der Tasten `L` und `S` hat man nun einen schnellen Zugang zu den
Lade-und Speicher-Funktionen und mit der `*`-Taste des Ziffern-Blocks
lassen sich Gouraud-Shading und Blending ab- bzw. zuschalten.</P>

<P>Eine weitere kommerzielle Version des Spiels wird es laut Paul Burkey
nicht geben, aber er will in seiner Freizeit an weiteren freien Updates
arbeiten. Offen steht ja noch der Zwei-Spieler-Modus via Modem.</P>

<P>[Die Wertung &auml;ndert sich nicht gegen&uuml;ber der Version 1.2b, die im
 AmZeiger #7 getestet wurde, d. Chefred.]</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906etw.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../pd/9906tbox.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

