
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Amiga Format-CD 39+40</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Amiga Format-CD 39+40</H1>von<BR>
<A HREF=mailto:uridium@t-online.de>Peter Fischer</A></DIV>


<P><B>Was ist denn &quot;Amiga Format?</B></P>

<P>1989 erschien die erste Ausgabe dieses Magazins, welches zu den
Glanzzeiten des Amiga (Anfang der 90'er Jahre) eine Seitenanzahl von
&uuml;ber 200 Seiten hatte! Heute ist das Magazin nur noch ca. 100 Seiten
stark, aber es ist immer noch eines der herausragenden Mags, welches
man sich wirklich mal anschauen sollte.</P>

<P>Leider ist mir keine deutsche Bezugsadresse bekannt, so da&szlig; man sich
direkt an den Verlag im englischen K&ouml;nigreich wenden und am besten
eine Kreditkarte zur Bezahlung des Magazins (ca. 20,- DM inklusive
Versandkosten) besitzen sollte.</P>

<P>Aber auch mehrere deutsche Amiga-H&auml;ndler f&uuml;hren die einzelnen CD's der
&quot;Amiga Format&quot; (warum aber nicht die Magazine?) zu einem Preis von
14,95 DM und diese monatlichen seit 1995 erscheinenden CD's m&ouml;chte
ich Ihnen mal n&auml;her vorstellen.</P>

<P><B>Was bieten die CD's?</B></P>

<P>Jede CD ist immer bis zum Rand gef&uuml;llt (ca. 650 MB) und jeden Monat gibt
es einen Softwareschwerpunkt. Auf der CD-Nr. 39 (Mai 1999) beinhaltete er
eine Zusammenstellung der besten Internetprogramme und jede Menge neuer
Level und Add-Ons f&uuml;r alle auf dem Amiga erschienenen Konvertierungen
bekannter 3D-Spiele aus dem Hause `ID-Software`. Auf der CD 40 (Juni 1999)
ist der Linux-Kernel &quot;Linux APUS&quot; f&uuml;r PPC-Amiga und zahlreiche Linux-
Programme mit &uuml;ber 300 MB an Daten vertreten.</P>

<P>Hieran kann man erkennen, da&szlig; diese CD's ihre (meist ungepackten)
Programme nicht nur aus dem Aminet beziehen und daher eine sehr gute
Alternative zu den gleichnamigen CD's darstellen. An und wann befinden
sich auch Audio-St&uuml;cke auf der CD. Auf der CD 40 ist u.a. ein St&uuml;ck der
Amiga-inspirierten Gruppe &quot;Annex&quot; vertreten!</P>

<P>Der Verzeichnisaufbau der CD's ist immer gleich und sollten sich f&uuml;r ein
Verzeichnis - z.B. das kommerzieller Spieledemos - mal keine Daten finden,
so bleibt das Verzeichnis einfach leer.</P>

<P>Die vorhandenen 7 <B>Hauptverzeichnisse</B> untergliedern sich wie folgt:</P>

<UL>
<LI>CoverDisks: 3 Cover-Disketten des aktuellen Magazins sind hier vertreten,
2 davon sind frei nutzbar, w&auml;hrend die 3. nur f&uuml;r Abonnenten duch Eingabe
eines speziellen Codes zug&auml;nglich ist.</LI>
<LI>Screenplay: Hier befinden sich Programme und Tools f&uuml;r die Spielnaturen,
wie z.B. Sharewarespiele, Demos oder HD-Installer.</LI>
<LI>In the Mag: Die Software, welche im Heft vorgestellt wurde, liegt hier
zum direkten Anwenden vor.</LI>
<LI>Reader Stuff: Allerlei eingesandte Software der Leser der &quot;Amiga Format&quot;
wird hier untergebracht.</LI>
<LI>Serioulsy Amiga: In 13 weiteren Schubladen sind hier jede Menge an
Anwenderprogrammen, Utilities und Tools zu finden. Es ist tats&auml;chlich
so, da&szlig; man sich aufgrund der Auswahl der Daten, eine komplette und
komfortable Workbench installieren kann, ohne sich vorher alles m&uuml;hsam
zusammensuchen zu m&uuml;ssen.</LI>
<LI>+System+: Auch hier befinden sich weitere existenzielle Tools, die
man auf keinem Amiga missen sollte und weitere Utilities, z.B. ein
Suchprogramm f&uuml;r das schnelle Auffinden der Daten auf der CD.</LI>
</UL>

<P>Durch die hochwertige <B>Auswahl</B> der Programme kommmt es dazu, da&szlig; immer
ben&ouml;tigte Software, MUI oder Demos bekannter Web-Browser, auf jeder CD
vertreten sind, aber das l&auml;&szlig;t sich verkraften und man kann mit jeder CD
in die Serie einsteigen, ohne da&szlig; man unbedingt vorherige aus
irgendwelchen Gr&uuml;nden besitzen mu&szlig;.</P>

<P>Ein weiterer <B>Schwerpunkt</B> auf jeder CD sind Amiga-spezifische Web-Sites,
die zum kosteng&uuml;nstigen Offline-Browsen vorliegen, daf&uuml;r allerdings sind
diese auch ca. 2 bis 3 Monate alt. Hier ein kleiner Tip: Wenn man die
M&ouml;glichkeit hat, sollte man ruhig mal die Download-Seiten der Web-Sites
anklicken, denn hier sind des &ouml;fteren auch Archive zum Offline-Lesen
vorhanden.</P>

<P>Auch die <B>Aktualit&auml;t</B> der anderen Daten betr&auml;gt in der Regel 2 bis 3 Monate,
unter Umst&auml;nden erh&auml;lt man einige Programme aber auch, ehe Sie auf den
Aminet-CD's erscheinen. Allerdings ist erstaunlich, da&szlig; sich zwischen den
Programmen auf einmal ein Programm aus dem Jahre 1995 anfindet, das dort
aber seine Berechtigung hat, da es halt ein Klassiker ist.</P>

<P>Die Qu&auml;lit&auml;t der zusammengetragenen Programme und Daten ist
&uuml;berdurchschnittlich hoch und Ausf&auml;lle sind so gut wie nie vorhanden.</P>

<P><B>Wirklich alles toll?</B></P>

<P>Ein kleines Manko gibt es bei den CD's der &quot;Amiga Format&quot;-Serie aber doch:
Trotz des Suchprogramms fehlt ein bequemer und &uuml;bersichtlicher Index, wie
er auf den Aminet-CD's vorhanden ist. Stattdessen mu&szlig; man sich doch mal
durch die einzelnen Schubladen 'w&uuml;hlen', um wirklich alles zu ersp&auml;hen,
was sich auf der CD befindet.</P>

<P><B>Fazit</B></P>

<P>Dieses f&auml;llt sehr gut aus, denn f&uuml;r den g&uuml;nstigen Preis (14,90 DM) erh&auml;lt
man Monat f&uuml;r Monat eine CD, die hochwertige Software bietet und die
woanders nicht erh&auml;ltlich ist - abgesehen vom kostspieligen Download,
aber wer w&uuml;rde schon 300 MB an Daten f&uuml;r das Linux-Paket der CD 40
runterladen? ;-)</P>

<P>Und wer die M&ouml;glichkeit besitzt, das Magazin zusammen mit der CD zu
erhalten, bekommt praktisch das Heft f&uuml;r nur ca. 5,- DM dazu! ;-). Ein
Jahresabonnement kostet zusammen mit der CD umgerechnet ca. 160,- DM.</P>

<P>Abschlie&szlig;end bleibt nur zu hoffen, das dieses Magazin noch lange besteht
und nicht den gleichen Weg, wie dessen langj&auml;hriger Konkurrent &quot;CU Amiga&quot;
nimmt, der vor etwa 1 Jahr eingestellt wurde.</P>

<P>Da wir keine Pauschalurteile f&uuml;r Serien abgeben, weil sich u.a. die
Qualit&auml;t in Zukunft &auml;ndern k&ouml;nnte, bezieht sich die Wertung auf die
beiden zur Begutachtung herangezogenen Ausgaben.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>AmigaFormat-CD 39</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.futurenet.co.uk/amigaformat.html">Future Publishing</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Daten-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>14.95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=1 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=1 ALIGN=CENTER>1</TD><TD COLSPAN=2 ALIGN="CENTER"><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE>
</P>
<BR>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>AmigaFormat-CD 40</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.futurenet.co.uk/amigaformat.html">Future Publishing</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Daten-CD</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>14.95 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=1 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=1 ALIGN=CENTER>2</TD><TD COLSPAN=2 ALIGN="CENTER"><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
</TABLE>
</P>
Adresse: Future Publishing, Somerton, Somerset, TA11 6BR, UK<br>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906at8.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906ged.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

