<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Eat the Whistle</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Eat the Whistle</H1>von<BR>
<A HREF="mailto:uridium@t-online.de">Peter Fischer</A></DIV>

<BR><TABLE BGCOLOR="#DADADA" ALIGN="CENTER" BORDER="1">
<TR><TD>
Das nachfolgend getestete Produkt wurde uns freundlicherweise von
der Firma <a href="../amz0699/ferstad.htm">&quot;Ferst Computer&quot;</a>, K&ouml;penicker Stra&szlig;e 11, 15537 Gosen,
(<A HREF="http://www.ferst.de">http://www.ferst.de</A>/<A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A>) leihweise zur Verf&uuml;gung gestellt.
 <a href="../amz0699/ferstad.htm">&lt;Information&gt;</a>
</TD></TR></TABLE>

<P><B>Vorspiel</B></P>

<P>Nachdem der Amiga in all seinen Jahren immer von erstklassigen Fu&szlig;ball-
Arcarde-Simulationen begleitet wurde - als Beispiele hierf&uuml;r seien nur
&quot;Kick Off 1 +2&quot; / &quot;Goal&quot; und die Reihe der &quot;Sensible World of Soccer&quot;-
Serie genannt - versucht nun `Islona / Hurricane Studios`, an die
Erfolge dieser Klassiker anzukn&uuml;pfen und bringt &quot;Eat the Whistle&quot; auf
den Markt.</P>

<P>Ob &quot;Eat the Whistle&quot; (im folgenden &quot;ETW&quot; genannt) sich in dieser
`Champions League` qualifizieren kann, wird dieser Test beweisen.</P>

<P><B>Anpfiff</B></P>

<P>Von &quot;ETW&quot; existieren zwei Versionen, jeweils auf Diskette und CD, wovon
mir letztere vorliegt. Im Gegensatz zur Disketten-Version besitzt die CD-
Version Sprachkommentare eines digitalen Reporters, der sich des &ouml;fteren
w&auml;hrend des Spiels zu Wort meldet, dazu aber sp&auml;ter mehr.</P>

<P>Auf der Verpackung wird ein Foto eines packenden Zweikampfes zwischen
Fu&szlig;ballspielern gezeigt, wovon einer eine Sonnenbrille tr&auml;gt! Das l&auml;&szlig;t
schon darauf schlie&szlig;en, da&szlig; einige Spielelemente nicht ganz so ernst und
trocken gemeint sein werden.</P>

<P><B>Einwurf</B></P>

<P>Um &quot;ETW&quot; spielen zu k&ouml;nnen, wird als minimale Voraussetzung ein Amiga mit
68020-Prozessor, OS 2.0, das AHI-Device und die reqtools-Library ben&ouml;tigt.</P>

<P><B>1. Foul</B></P>

<P>Bei der mir vorliegenden Version 1.0 war leider keinerlei Anleitung in
irgendeiner Form vorhanden. Das ist ein Manko, das sich aber durch den
Bezug des ETW-Patches im Aminet beheben l&auml;&szlig;t. Die Bezugsquelle lautet:</P>

<P><A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/patch/ETW-CD20p.lha">http://ftp.uni-paderborn.de/pub/aminet/game/patch/ETW-CD20p.lha</A></P>

<P>Dies ist ein Patch auf die Version 1.2, au&szlig;erdem gibt es noch einen
weiteren auf die Version 2.0 unter:</P>

<P><A HREF="http://ftp.uni-paderborn.de/pub/aminet/game/patch/ETW-20-201p.lha">http://ftp.uni-paderborn.de/pub/aminet/game/patch/ETW-20-201p.lha</A></P>

<P>Aber dazu komme ich etwas sp&auml;ter. In dem erstgenannten Update ist eine
kurze englische Anleitung im ASCII-Format vorhanden, die auf die
wichtigsten Dinge eingeht. Aber grunds&auml;tzlich ben&ouml;tigt man diese
Anleitung nicht, denn man kann einfach Drauflosspielen und findet
sich bei &quot;ETW&quot; schnell zurecht.</P>

<P><B>Freisto&szlig;</B></P>

<P>Mit 20 MB ist die CD lediglich durch die Spiel-Daten belegt und man
kann das Spiel direkt von ihr starten. Allerdings sollte man auf einer
Festplatte ein Verzeichnis f&uuml;r die Spielst&auml;nde anlegen. Eine
Festplatteninstallation existiert nicht, kann aber durch einfaches
Kopieren des gesamten CD-Inhalts praktiziert werden.</P>

<P><B>Abseits</B></P>

<P>Nebst dem Programm befindet sich noch ein Developers-Verzeichnis auf
der CD, in dem man drei Programme zum Editieren der Daten, Eigenkreationen
der Sprachsamples (!) und einen Taktikeditor findet. Aber diese Programme
sind recht anwenderunfreundlich, denn der Dateneditor ist nur in
italienischer Sprache verf&uuml;gbar, w&auml;hrend die beiden anderen Programme
eigentlich keine Programme im herk&ouml;mmlichen Sinne sind, sondern CLI-
Befehle. Hier sollte man lieber auf weitere Updates von &quot;ETW&quot; warten,
bei denen diese Programme, gerade  f&uuml;r Anf&auml;nger, benutzerfreundlicher
sein sollten.</P>

<P><B>Absto&szlig;</B></P>

<P>Nachdem man das Spiel startet, bekommt man eine kleine Intro in Cartoon-
Grafik geboten, die nicht weiter erw&auml;hnenswert ist. Erfreulicherweise
erwartet einen dann ein lokalisiertes deutschsprachiges Men&uuml;, in dem man
&auml;u&szlig;erst viele Einstellungen vornehmen kann, wie z.B. die Dauer des Spiels, die Anzahl der
Spieler (bis zu 4 gleichzeitig!), die Platzverh&auml;ltnisse, den Spielmodus
und vieles mehr.</P>

<P>&quot;ETW&quot; bietet insgesamt <B>4 Spielmodi</B>, von den aber nur 3 anw&auml;hlbar waren:</P>

<UL>
<LI><B>Arcarde</B>: Die Verpackung verhei&szlig;t hier einen packenden Spielmodus der dem
  Klassiker &quot;Speedball 2&quot; von den &quot;Bitmap Brothers&quot; &auml;hneln soll. Na ja,
  neben vier aufsammelbaren Extra-Gegenst&auml;nden, dem Wegfall des Foulspiels
  und der M&ouml;glichkeit, Fantasy-Teams auf das Spielfeld zu schicken, wird
  &quot;Speedball 2&quot; in keinster Weise das Wasser gereicht und man sollte sich
  dann doch lieber die `echte` Rasensimulation anschauen.</LI>
<LI><P><B>Simulation</B>: Hier gibt es nun die M&ouml;glichkeit, die Weltmeisterschaft 1998
  nachzuspielen, sowie sich eigene Ligen oder Pokalspiele zu kreieren oder
  Freundschaftsspiele abzuhalten.</P>

  <P>In dieser Version liegen ausschlie&szlig;lich Nationalmannschaften vor, die
  aus Lizengr&uuml;nden nicht die Orginalspielernamen beinhalten. Aber das
  Kr&auml;fteverh&auml;ltnis der einzelnen Nationen ist gut angeglichen, schon bei
  meinem ersten Spiel gewann ich mit der deutschen Mannschaft gegen
  Jamaika, w&auml;hrend ich gegen Brasilien verlor, deren Spieler ungleich
  schneller und cleverer als die der Jamaikaner waren.</P></LI>
<LI><P><B>Karriere</B>: Als ich diesen Men&uuml;punkt ausw&auml;hlte, bekam ich den Hinweis, das
  diese erst in &quot;ETW 98/99&quot; verf&uuml;gbar sei.</P></LI>

<LI><B>Training</B>: Hier kann man ohne gegnerische Mannschaft das Handling der
  Spieler (Passen, Schie&szlig;en, usw.), sowie Elfmeter und Freist&ouml;&szlig;e &uuml;ben.</LI>
</UL>

<P><B>Tor!</B></P>

<P>Nun gehts endlich zum ersten Spiel. Nachdem man seinen Spielmodus gew&auml;hlt
hat, wird die Aufstellung beider Mannschaften gezeigt. Dann dauert es ein
Weilchen, bis das Spielfeld erscheint.</P>

<P>Die Grafik ist zwar nicht auf dem neuesten Stand der Technik, reicht aber
f&uuml;r eine Fu&szlig;ballsimulation vollkommen aus.</P>

<P>Die Perspektive erscheint in erh&ouml;hter seitlicher Ansicht, in der man einen
guten &Uuml;berblick auf etwa 1/3 des Spielfeldes hat. Wenn gew&uuml;nscht, kann man
noch zus&auml;tzlich ein &quot;Spielfeldradar&quot; einschalten. &Uuml;ber die Leertaste ist
es m&ouml;glich, die Perspektive zu &auml;ndern, was man aber lieber sein lassen
sollte, denn bis man zur Orginalansicht zur&uuml;ckkehrt, dauert es ein
Weilchen. Man verliert in dieser Zeit komplett den &Uuml;berblick, da es zu
schweren Grafikfehlern, z.B. 'Kleben' des Balles am linken Bildschirmrand
oder einem total verwackelten Bild kommt.</P>

<P>Im Spiel selbst tritt ab und zu ein kleineres Bildruckeln auf, was noch
in in einem zuk&uuml;nftigen Update korrigiert werden sollte.</P>

<P>Die Steuerung der Spieler kann &uuml;ber einen normalen Joystick, einen 2-
Button-Joystick, sowie ein Joypad erfolgen. Der f&uuml;r eine Fu&szlig;ballsimulation
entscheidende Punkt - die Steuerung - ist gelungen, und man findet sich
auf Anhieb zurecht. Im &Uuml;brigen sollte man die im Men&uuml; ausw&auml;hlbaren
M&ouml;glichkeiten &quot;Schu&szlig;&quot; und &quot;gezielter Pa&szlig;&quot; mal vergleichen, denn dies
f&uuml;hrt zu einem deutlichen Unterschied des Spielverhaltens.</P>

<P>Das Verhalten der computergesteuerten Mitspieler ist ebenfalls in Ordnung
und sie laufen sich in aussichtsreichen Situationen frei anstatt weg.</P>

<P>Die auf der CD enthaltenen Samples werden h&auml;ufig eingesetzt und passen bis
auf einige Ausnahmen auch meistens zum Spielgeschehen. Die Sprachausgabe
erfolgt in deutscher Sprache und bietet eine (gewollte?) Besonderheit: In
jedem Satz wird immer ein bestimmtes Wort ganz besonders betont. So wird
zum Beispiel beim Satz &quot;Oh, Oh, b&ouml;ses Foul!&quot; das Wort &quot;b&ouml;ses&quot; betont, was
irgendwie recht am&uuml;sant klingt, ohne zu nerven.</P>

<P>Alternativ kann auch der Sprecher ausgeschaltet und stattdessen Fanges&auml;nge
angeschaltet werden. Musikst&uuml;cke gibt es, bis auf eine Ausnahme (im Men&uuml;
des Arcarde-Modus) nicht im Programm.</P>

<P>Durch die eben genannten Punkte kann ich sagen, da&szlig; das Spielen wirklich
enormen Spa&szlig; macht und &quot;ETW&quot; f&uuml;r jeden Spieler (Anf&auml;nger oder Profi) eine
faire Herausforderung ist.</P>

<P>Allerdings gibt es einige schwerwiegende Patzer, auf die ich jetzt
eingehe.</P>

<P><B>Rote Karte!</B></P>

<P>Neben den schon erw&auml;hnten Schnitzern bei der Sichtumschaltung durch die
Leertaste, kam es im Verlaufe meiner Spiele zu einem weiteren Fehler, der
schwerwiegender Natur war:</P>

<P>In der Halbzeitpause wird man gefragt, ob man sich eine Wiederholung der
ersten Halbzeit anschauen m&ouml;chte. Dreimal bejahte ich dies, zweimal kam
es dabei zu Abst&uuml;rzen des Rechners!</P>

<P>Also besorgte ich mir die oben genannten Patches aus dem Aminet, welche
neben der Anleitung noch 500 internationale Vereinsmannschaften, sowie
eine PPC-Version (PowerUP von Phase5) beinhalten. Die Installation
funktionierte auch problemlos, allerdings lie&szlig; sich &quot;ETW&quot; nicht mehr
starten und es wurde der Datentr&auml;ger &quot;ETW-EXEC&quot; verlangt. Auch ein
Nachforschen per &quot;SnoopDos&quot; und mit anderen Methoden (z.B. Start &uuml;ber
das CLI) brachten keinen Erfolg.</P>

<P>Hier besteht noch gro&szlig;er Handlungsbedarf und ich hoffe, da&szlig; diese
Probleme zuk&uuml;nftig (bei weiteren Updates) nicht auftreten werden.</P>

<P><B>Schlu&szlig;pfiff</B></P>

<P>Das Spielen macht wirklich sehr viel Spa&szlig; und man versp&uuml;rt immer mal
wieder Lust auf eine neue Partie. W&auml;hrend des Spiels kommt es zu keinen
Problemen, man sollte aber nicht die Sonderfunktionen (Umschalten der
Perspektive oder das Replay in der Halbzeitpause) bet&auml;tigen.</P>

<P>Hier habe ich den Eindruck, da&szlig; das Spiel nicht einem gen&uuml;gendem
Betatesting ausgesetzt und daher zu fr&uuml;h auf den Markt gebracht wurde.</P>

<P>Und aufgrund des hohen Spielspa&szlig;es - darauf kommt es bei einen Spiel ja
immer noch an - verdient sich &quot;Eat the Whistle&quot; trotz der etwas veralteten
Technik und der zum Teil schwerwiegenden, aber grunds&auml;tzlich nicht
spielbeeinflu&szlig;enden Fehler, trotzdem noch ein &quot;befriedigend&quot;.</P>

<P>F&uuml;r alle Fu&szlig;ball-Fans bietet &quot;ETW&quot; eine erfrischende Abwechslung zum wohl
beliebtesten Amiga-Fu&szlig;ballspiel &quot;Sensible World of Soccer&quot;, ohne aber an
dessen Klasse heranzukommen. Sollten zuk&uuml;nftige lauff&auml;hige Patches die
oben genannten Probleme beheben, wird sich &quot;ETW&quot; sicherlich noch eine
bessere Bewertung verdienen k&ouml;nnen.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Eat the Whistle</TD>
    <TD><B>Hersteller:</B></TD>
    <TD>Hurricane Studios</TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Fu&szlig;ball-Simulation</TD>
    <TD><B>Version:</B></TD>
    <TD>1.0</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>39.95DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Festplattenspielbar?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Exit zur Workbench?</B></TD><TD COLSPAN=2 ALIGN=CENTER>JA</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Grafik:</B></TD><TD ALIGN=CENTER>3</TD><TD ALIGN="CENTER" ROWSPAN=6><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>SoundFX:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Musik:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielbarkeit:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Spielspa&szlig;:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
</TABLE></P>
Epic Marketing (<A HREF="mailto:epic@swol.de">epic@swol.de</A>)<BR>
<A HREF="http://www.epicmarketing.ltd.net">http://www.epicmarketing.ltd.net</A>
<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906ged.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906foun.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

