<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0C - WET</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00E7.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00E6.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00E8.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00E6.html">SixthSense</A> | <A HREF="0x00E7.html">WET</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00DD.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00DE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00DF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00E0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00E1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00E2.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00E5.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00E6.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00E8.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00EA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00EB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>WET - ganz sch&ouml;n hot!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Kalt ist die Winterzeit f&uuml;rwahr, aber es gibt eine
sehr effiziente M&ouml;glichkeit, die horrenden Heizkosten zu sparen und
sich dabei auch noch mit h&ouml;chst erfreulichen Dingen zu befassen. Man
besorge sich einfach ein Spiel namens <B>WET - The Sexy Empire</B> und
f&uuml;ttere damit sein CD-Laufwerk. Nicht nur diesem wird dabei ganz
sch&ouml;n eingeheizt, soviel ist sicher! :-)</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Wenn man eine Bank zu dritt &uuml;berf&auml;llt, dann kann es schon mal
vorkommen, da&szlig; die beiden Kumpanen mitten auf der Flucht
beschlie&szlig;en, eine Beuteteilung durch zwei sei weitaus effizienter und
ertragreicher als durch drei - und den armen Dritten dann mitten in der
W&uuml;ste stehen lassen. Ganz sch&ouml;n viel Pech, m&ouml;chte man
meinen, doch damit nicht genug! Wenn das einzige Kaff in der Umgebung
praktisch nur aus Sexshops, Video- &amp; Fotofachh&auml;ndlern, Bars und
Motels besteht, wie wohl wird man sich dann sein Brot verdienen, um eine
neue Identit&auml;t zu erkaufen, noch bevor einen das FBI aufgest&ouml;bert
und eingebuchtet hat?<BR>

<BR>Das Zauberwort hei&szlig;t &quot;Lula&quot;. Die Dame, die jedem Mann
das Wasser im Munde zusammenlaufen l&auml;&szlig;t, wollte eigentlich ganz
gro&szlig; im Filmbusiness rauskommen, blieb aber immer nur an
Produzentenbetten h&auml;ngen. Der h&ouml;chst erfreuliche Zufall dieser
Bekanntschaft (im Intro ausf&uuml;hrlich zu sehen!) gipfelt also
schlie&szlig;lich in einer fruchtbaren Zusammenarbeit. Schlie&szlig;lich
ziehen ja beide am selben Strang, die Sch&ouml;ne und der Spieler: sie will
gro&szlig; raus, er will... aus dem Kaff raus, beide wollen reich und
ber&uuml;hmt werden und tun, was einem sonst noch bei vernebelten Sinnen so
durch den Kopf geht. Besser k&ouml;nnte es ja fast nicht sein!<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der erste Teil des Spiels, welches vom Aufbau her sehr an Mad TV, Mag!
oder Biiing! erinnert (nur da&szlig; die Grafiken und Animationen
animierender sind), stellt eine recht simple Aufgabe: genug Geld zu
verdienen. Und das geht so: man schie&szlig;t ein paar Fotosessions mit
Lula oder dreht kleine Videos, um diese dann beim Verleiher zu verleihen
oder direkt in bare M&uuml;nze zu verwandeln. Aber es fallen auch Ausgaben
an: Foto- und Filmeqipment, Foto-Entwicklung, Motelzimmermiete,
Sexspielzeug und Partnerinnen f&uuml;r Lula... au&szlig;erdem braucht sie
auch ihre wohlverdienten Pausen, also gehen sich h&ouml;chstens 3 Sessions
pro Tag aus. Auch die falschen P&auml;sse werden Geld kosten! Um die Sache
zu erleichtern, erpre&szlig;t man zwischendurch G&auml;ste der Bar mit
angeblichen Nacktfotos oder l&auml;&szlig;t Leute von Rockern
verm&ouml;beln. F&uuml;r am&uuml;sante Abwechslung und nicht n&auml;her
verratene Gags ist also bereits hier gesorgt!<BR>

<BR>Aber das alles ist ja noch gar nix gegen Teil 2. Der Spieler mutiert
n&auml;mlich zum Filmproduzenten! Erstmal wollen ein paar Geb&auml;ude
gemietet werden, dann gehts wild los mit Casting, Requisite, Lagerhaltung,
Schnitt, Vervielf&auml;ltigung, Synchronisation, Filmplanung und vielen
anderen Dingen. Darsteller k&ouml;nnen auf Trainingslager geschickt oder
vom Chirurgen &quot;versch&ouml;nert&quot; werden lassen. (Bei dessen
Anblick w&auml;r` ich eher skeptisch ;-)) Die Gegner geh&ouml;ren genauso
sabotiert, wie auch diese dasselbe Spielchen mit dem Spieler treiben, und
auch Skandale braucht das Volk. Bei all diesen Aktionen und Handlungen darf
man aber keinesfalls die Finanzen au&szlig;er Augen lassen, denn wenn die
sich erstmal in Form von roten Zahlen selbst&auml;ndig machen, wird es
kritisch, da eine &Uuml;berschreitung des Kreditrahmens zum unverhofften
Spielende f&uuml;hrt. (Lula erkl&auml;rt uns dann, sich nun einen richtigen
Kerl zu suchen - wie jammerschade.)<BR>

<BR>Die Produktion eines Filmes ist also keine einfache Sache, da der
erwartungsvolle Spieler an viele Sachen zugleich denken mu&szlig;. Und ganz
schlampig produzierte Billigstreifen werden den Weg in die Charts nie
finden. Es ist also viel zu tun! Und nebenbei rennt auch noch die Zeit
buchst&auml;blich davon, n&auml;mlich kontinuierlich-automatisch wie schon
zu Zeiten von Mad-TV. Gottseidank kann man in den Optionen die
Geschwindigkeit einstellen, mit der sie verstreicht. Apropos Optionen:
neben den obligaten &quot;Speichern&quot;, &quot;Laden&quot; und
&quot;Beenden&quot; steht uns auch noch zur Auswahl, alle
Zwischenanimationen sehen und Musik h&ouml;ren zu wollen oder nicht. Wie
dem auch sei, ich kann allen, die sich an den Grafiken erg&ouml;tzen
wollen, nur empfehlen, einen Screengrabber zu verwenden, weil es keine
richtige Pausefunktion gibt. Allerdings haben auch die ganzen kleinen
Animationen ihren Reiz...<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das Spiel strotzt nat&uuml;rlich vor kleinen Gags. Wann immer ein
Monitor zu sehen ist, f&uuml;hrt ein Klick darauf zum Abspielen einer
kleinen (winzigen) Animationssequenz. Das alleine ist ja noch nicht
wirklich lustig. Aber wenn manchesmal der Verleiher den Spieler zum Ziehen
der Leine auffordert, weil er gerade deutlich sichtbare
&quot;Reitstunden&quot; nimmt (&auml;hem), die Polizistin sich als
waschechte und gnadenlose (!) S&amp;M-Herrin entpuppt und diverse andere
weibliche Figuren per Mausklick zum Wackeln oder Strippen beginnen, dann
ist oft ein Schmunzeln das Mindeste. Dabei sind die Grafiken ja an sich
schon witzig...<BR>

<BR>Der optische Blickfang Nummer eins ist vom Intro weg unsere liebe Lula,
die im zweiten Spielabschnitt sogar ihr eigenes Zimmer bekommt, aber leider
recht b&ouml;se dreinschaut. Teure Geschenke und beruflicher Erfolg
k&ouml;nnen sie aber sch&ouml;n langsam umstimmen. Und schlie&szlig;lich,
nach langer Zeit (ich war bisher noch nicht soweit), tritt dann <I>Phase
3</I> in Aktion: die zweite Spielstufe wird noch um einige Features
erweitert (Sendestationen, Satelliten etcetera) und erweitert das gesamte
Konzept um ein weiteres Quentchen an Komplexit&auml;t. Der besondere
Anreiz, solange durchzuhalten und das Spiel erfolgreich zu beenden, liegt
neben Spielwitz und optischen Freuden gewi&szlig; auch im Outro, welches
ich zwar noch nicht erblicken durfte, aber wer erst einmal das Intro
gesehen hat... ;-)<BR>

<BR>Und damit w&auml;re das Wesen des Spieles eigentlich bereits
ausf&uuml;hrlich erl&auml;utert; lassen wir also die technische Seite zum
Zuge kommen! Bei <B>WET</B> ist eines (leider) von Beginn an klar: es
handelt sich um eine PC-Konvertierung. Wer &uuml;ber einen besonders
schnellen Rechner verf&uuml;gt, dem f&auml;llt das vielleicht nicht so sehr
auf, aber ich mit meinem ber&uuml;chtigten 1200er mit Blizzard 1230/IV
(68030er mit 50 MHz) komme tats&auml;chlich st&auml;ndig in den
zweifelhaften Genu&szlig; ruckelnder Animationen, wie man sie nur selten am
Amiga sieht. An dieser Stelle ist wohl ein bi&szlig;chen Kritik an den
Programmierern erlaubt: wenn ich vor einem Amiga sitze, m&ouml;chte ich
auch das Gef&uuml;hl haben, da&szlig; ich dies tue. Bei der Konvertierung
h&auml;tten die werten Herren ruhig auch die technische Seite in punkto
Animation oder Grafikwechsel etwas besser in Szene setzen k&ouml;nnen, so
schwer kann das doch auch wieder nicht sein. Es ist ja kein butterweiches
100-Wege-Scrolling vonn&ouml;ten, aber jedesmal, wenn ein Bildchen einem
v&ouml;llig neuen Platz machen soll, passiert folgendes: ... 1. das Bild
verschwindet von oben nach unten sch&ouml;n langsam, statt einfach komplett
ausgeblendet zu werden. (Den Schmarrn hab ich seinerzeit im AMOS auch
gel&ouml;st, und es hat bestens funktioniert, dabei w&uuml;rde ich mich
h&ouml;chstens als blutigen Programmier-Anf&auml;nger einstufen.) ... 2.
Das Bild erscheint wieder (Zeile f&uuml;r Zeile von oben nach unten, sowas
dauert auf meiner Maschine etwa 0.5 Sekunden) ... 3. Die Farben
ver&auml;ndern sich alle, weil die Palette auf das neue Bild umgestellt
wird (dies ist deutlich sichtbar und wirkt nicht so professionell) ... 4.
Das neue Bild wird &uuml;ber das alte geblendet - fertig. Na, begeistert?
Mitnichten, w&uuml;rde ich sagen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Aber es gibt auch gute Seiten, und die kommen nicht zu kurz! Die
Grafiken sind wirklich erste Sahne (schaut Euch einfach die Screenshots an
;-), beinhalten wie bereits erw&auml;hnt eine Menge an Gags und Details und
sind durch lustige kleine Animationen verfeinert. Durch den Main-Screen im
Kaff der ersten Stufe fliegt zuweilen ein gefl&uuml;gelter Schniedelwutz,
und wenn der Mauszeiger ihn &quot;ber&uuml;hrt&quot;, verwandelt er sich in
ein Fadenkreuz - ein gezielter Klick und der Flug-Wutz st&uuml;rzt ab. Aber
ich will nicht alle Scherze und &Uuml;berraschungen verraten, entdeckt
diese lieber selbst! Apropos Mauszeiger: dieser sieht aus wie eine kleine
Lula, und sobald man &uuml;ber einen Bereich f&auml;hrt, welcher
&quot;anklickbar&quot; ist, l&auml;&szlig;t sie ihre H&uuml;llen fallen.
Normalerweise erscheint dann zus&auml;tzlich ein Text &uuml;ber ihr, damit
man wei&szlig;, was man hier anklicken kann. Soweit, so fein - und wie
gesagt, die Grafiken tun ihr Bestes, um des Spielers Herz zu
erw&auml;rmen!<BR>

<BR>Der Sound ist auch durchaus okay, wobei im Spiel selbst eher
Soundeffekte zum Tragen kommen. Der Spielspa&szlig; ist aus bereits
zehnfach erw&auml;hnten Gr&uuml;nden auf alle F&auml;lle gew&auml;hrt. Die
Handhabung ist recht einfach und simpel (alle Handlungen, f&uuml;r welche
auch ein eigenes Fensterchen ge&ouml;ffnet wird, kann man zuletzt per Klick
auf den Daumen nach oben best&auml;tigen oder per Klick auf die Klomuschel
wieder verwerfen), lediglich st&ouml;rt vielleicht auf langsamen Rechnern,
kleiner Festplatte und langsamem CD-Rom, da&szlig; zwischen den einzelnen
Bildern eine gewisse Zeit verstreicht, und oft mu&szlig; man sich durch
einige Orte durchbewegen, um ans gew&uuml;nschte Ziel zu kommen. Um das
Spiel zu installieren, was eigentlich recht einfach geht, braucht man
wahlweise 40 (kleine) oder 160 (gro&szlig;e Installation) Megabeisser frei.
Die Qualit&auml;t der Soundsamples und die Verwendung von AGA-, besten vom
Programm gew&auml;hlten oder Picasso/...-Screens steht dem Benutzer
ebenfalls frei. Nur eines mu&szlig; ich noch bemerken: auf dem Rechner
meines Bruders gelang es mir nicht, das Game zu installieren, da es sich
gemeinerweise noch vor Beginn des Installierens aufh&auml;ngte. Es handelt
sich dabei um einen A4000 mit WarpEngine 040/40 und Picasso96.<BR>

<BR>Mindestkonfiguration ist ein 86020er, 8 MB Fast- und 2 MB Chip-Ram und
40 MB frei auf der Harddisk, ein 8-fach-CD-Rom (bei mir tat es auch das
4-fach-Ding) und Kickstart 3.0. Empfohlen werden aber optimalerweise ein
68060er (huch!) mit 50 MHz, 10 MB Fast- und 2 MB Chip-Ram und 100 MB auf
der Festplatte frei (nicht 160? Komisch...).<BR>

<BR>Abschlie&szlig;ende Worte vor der Beewertungsbox: die Hersteller dieses
erfreulichen Spieles sind <I>Interactive Strip / New Generation
Software</I> (sie freuen sich gewi&szlig; &uuml;ber Fanpost ;-)). Zigarren
gibt es in diesem Spiel leider keine zu kaufen, obwohl die Sexshops mit
Dutzenden von netten Artikeln und Spielzeug aufwarten k&ouml;nnen. Und last
but not least finde ich, da&szlig; es auch ein WET f&uuml;r Frauen geben
sollte, in dem haufenweise (halb-)nackte M&auml;nner in allen Variationen
vorkommen, zumeist pr&auml;chtig muskelbepackt und in der H&uuml;ftgegend
gut ausgestattet - dann w&auml;re die letzte gro&szlig;e Marktl&uuml;cke
auf dem Spielesektor endlich geschlossen! :-)<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=96 HEIGHT=10 ALT="[96]"><IMG SRC="../images/_box_black.gif" WIDTH=4 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=89 HEIGHT=10 ALT="[89]"><IMG SRC="../images/_box_black.gif" WIDTH=11 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=82 HEIGHT=10 ALT="[82]"><IMG SRC="../images/_box_black.gif" WIDTH=18 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=89 HEIGHT=10 ALT="[89]"><IMG SRC="../images/_box_black.gif" WIDTH=11 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=92 HEIGHT=10 ALT="[92]"><IMG SRC="../images/_box_black.gif" WIDTH=8 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00E7.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x00E8.html">WET (1) - The Screenshots</A> - die sch&ouml;nen Bilder...<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="0x00E9.html">WET (2) - The Making Of &quot;The Screenshots&quot;</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00E6.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00E8.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
