<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0C - infinitiv II</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00E1.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00E0.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00E2.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00E1.html">infinitiv II</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00DD.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00DE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00DF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00E0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00E1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00E2.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00E5.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00E6.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00E8.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00EA.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00EB.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>infinitiv II - Towerumbau f&uuml;r A1200</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Seit 1992 habe ich meine A1200 und damals war
&quot;sie&quot; eigentlich nur als eine &Uuml;bergangsl&ouml;sung bis zur
n&auml;chsten Generation geplant, da ich mit dem A500 nicht mehr zufrieden
war, aber f&uuml;r eine A4000 nicht genug Geld hatte. Wie sich
herausgestellt hat, war das ein Fehler. Doch mittlerweile habe ich mir
meinen A1200 schon ordentlich aufger&uuml;stet, und f&uuml;r das letzte
i-T&uuml;pfelchen fehlt mir nur noch eine Grafikkarte. Doch wie baue ich
mir eine Grafikkarte in meinen lieblichen A1200 ein? Viel Platz scheint es
ja nicht zu geben. Nach nun mehr zwei Jahren Bedenkzeit habe ich mich also
entschlossen, meine A1200 in ein Towergeh&auml;use (gut Ding braucht Weile
:) ) umzubauen. Und um das Praktische mit dem N&uuml;tzlichen zu verbinden,
schreibe ich auch gleich einen Erfahrungsbericht dar&uuml;ber f&uuml;r
meine hei&szlig;geliebte AmigaScene.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Der Weg zum Turm</B></H3>&nbsp;

<BR>Die n&auml;chsten beiden Abs&auml;tze k&ouml;nnen getrost
&uuml;bersprungen werden. Sie dienen nur meinem Ego :-)<BR>

<BR><B>Donnerstag, 26.11.1998:</B><BR>

<BR>Ich entschlie&szlig;e mich bei der letzten Redaktionssitzung meinen
A1200 in einen Tower umzubauen. Unser netter Chefredakteur teilt mich
gleich f&uuml;r eine Artikel dazu ein. Da noch nicht einmal mein alter
Artikel fertig ist, bin ich hellauf begeistert.<BR>

<BR><B>Samstag, 05.12.1998:</B><BR>

<BR>Es ist soweit. Heute kaufe ich mir meinen infinitiv II. Vor lauter
Aufregung stehe ich schon um 09:30 Uhr auf. Beim Fr&uuml;hst&uuml;ck frage
ich ganz dezent meinen Vater, ob er wohl sein Auto f&uuml;r eine kleine
Weile entbehren k&ouml;nnte. Meine Mutter stimmt gleich mit ein und
verk&uuml;ndet ebenfalls nach Graz zu fahren. Um 11:30 ist es dann endlich
soweit (meine Mutter mu&szlig;te noch staubsaugen), wir fahren nach Graz.
Punkt 12:00 Uhr stehen wir vor dem Grazer Amiga-Gesch&auml;ft und nach
einer kurzen Diskussion beschlie&szlig;en wir, da&szlig; meine Mutter das
Auto behalten kann, und ich mit dem Zug nach Hause fahren werde, nachdem
der Tower im Auto verstaut ist. Was ich nicht bedacht habe ist der
&Ouml;BB-Fahrplan am Samstag, und daher komme ich erst um 16:20 Uhr daheim
an. Dort sagt mir mein Magen, da&szlig; ich erst mal was essen mu&szlig;,
bevor ich mich dem Umbau stellen kann. Dann jedoch ist es soweit, der Umbau
kann beginnen.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Der Umbau beginnt</B></H3>&nbsp;

<BR><B>16:50 Uhr</B><BR>

<BR>Nichts kann mich nun mehr vom Umbau abhalten. Als erstes wird gleich
alles von seiner Verpackung getrennt. Das ist nicht viel, da ich mir nur
den Tower, ein internes Netzteil und den Tastaturumbau (eine PC Tastatur
kommt mir nicht ins Haus, und die 4000-Tastatur funktioniert laut
Fachh&auml;ndler leider nicht am Tower) [Anm.d.Red: grunds&auml;tzlich
funktioniert jede Amiga-Tastatur an jedem Amiga, man mu&szlig; nur ein
wenig basteln, um den richtigen Stecker an das Kabel zu bringen. Die auch
f&uuml;r PC-Tastaturen geeigneten Adapter der Umbau-Tower machen da aber
eigene Sachen...] gekauft habe. Die Zorro-Busplatinen vom alten Tower
funktionieren leider nicht, und die neuen gibt es noch nicht (zum
Zeitpunkt, als der Artikel entstanden ist). Als Erstes f&auml;llt gleich
einmal auf, das dem Tower zwei Anleitungen beigelegt sind. Einmal ein
kleines A5-B&uuml;chlein. auf dessen Vorderseite der alte Tower prangt, und
einmal ein paar zusammengeheftete A4-Bl&auml;tter. Ein Durchlesen der
ersten A4-Seite verr&auml;t einem, da&szlig; die alte Beschreibung nur
wegen der Bilder beigelegt wurde, und f&uuml;r den Umbau die kopierten
Schmierzettel verwendet werden sollen.<BR>

<BR>Ein Durchlesen der St&uuml;ckliste ergibt, da&szlig; eigentlich viel zu
viele Schrauben beigelegt wurden, was aber kein Problem sein sollte. Nur
der ben&ouml;tigte 5mm Steckschl&uuml;ssel/Sechskantschl&uuml;ssel bereitet
mir ein Problem, welches aber durch eine intensive Suche im Werkzeuglager
meines Vaters behoben werden kann.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="../images_0C/invinitivii.gif"><IMG WIDTH=150 HEIGHT=272 ALT="[Infinitiv II Tower]" SRC="../images_0C/invinitiviitn.gif" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=150>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Der infinitiv II Tower nach dem Auspacken.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>17:10 Uhr</B><BR>

<BR>Punkt 2 der Anleitung (Auspacken des Towers) ist erledigt. Besonders
gut gef&auml;llt mir der Absatz:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Entfernen Sie zun&auml;chst die Styropor&reg;-Verkleidung und nehmen Sie den
infinitiv II Tower aus der Kunststofffolie heraus.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Beim Zerlegen des Towers f&auml;llt einem gleich auf, da&szlig; das
Geh&auml;use eigendlich nur durch Steckverbindungen zusammengebaut ist.
Nach dem L&ouml;sen von vier Befestigunsschrauben und dem Entfernen der
beiden Kunststoffleisten an der R&uuml;ckwand des Towers k&ouml;nnen die
beiden Seitenw&auml;nde, die Topabdeckung und die Frontabdeckung einfach
abgenommen werden. Zu diesem Zeitpunkt habe ich bereits beschlossen, die
beiden Kunststoffleisten, welche das Abnehmen der Seitenw&auml;nde
verhindern, nicht mehr zu montieren, damit bei einem weiteren
Aufr&uuml;sten meines Computers keine Schrauben mehr im Weg sind.<BR>

<BR>Als ich vorher meinte, nichts k&ouml;nnte mich mehr von meinem
Towerumbau abhalten, hatte ich nicht bedacht, da&szlig; <B>Babylon 5</B>
ist :-)<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>18:10 Uhr</B><BR>

<BR>Aber ab jetzt kann mich wirklich nichts mehr bremsen. Weiter geht es
also mit Punkt 3, dem<BR>

<BR><B>Zerlegen des AMIGA 1200</B>.<BR>

<BR>F&uuml;r einen ge&uuml;bten Amiga-Bastler d&uuml;rfte das Zerlegen
nicht allzu schwer sein, wobei nat&uuml;rlich ab sofort eine etwaige noch
g&uuml;ltige Garantie erlischt. Wichtig ist, da&szlig; man sich die
Polarit&auml;t von den zu entfernenden Kabeln merkt, ansonsten k&ouml;nnte
es sp&auml;ter zu Problemen kommen. Besondere Beachtung w&uuml;rde ich auch
dem Absatz<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Vorsicht! Achten Sie bitte darauf, da&szlig; Sie sich nicht an den recht scharfen
Kanten des Abschirmbleches und der Laschen verletzen.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>schenken, denn um 18:15 Uhr habe ich mich n&auml;mlich geschnitten. Man
glaubt gar nicht, wieviel Blut aus so einem kleinen Schnitt herauskommen
kann. Ich habe es erst bemerkt, als schon das halbe Geh&auml;use meines
A1200 rot war. Nach einer kurzen Verarztung meines linken Zeigefingers geht
es weiter. Einziges Problem beim Ausbau d&uuml;rften die 12
Sechskantschrauben der Anschl&uuml;sse darstellen. Wer keinen 5mm
Steckschl&uuml;ssel/Sechskantschl&uuml;ssel zur Verf&uuml;gung hat, und
statt dessen die als Alternative vorgeschlagene Flachzange verwendet, wird
zum Schwammerl. Nachdem ich (bzw. mein Vater) aber stolzer Besitzer eines
solchen Schl&uuml;ssels bin, st&uuml;rzte ich mich auf Teil 4, der da
ist:<BR>

<BR><B>Einbau der Hauptplatine</B><BR>

<BR>Der Einbau ist denkbar einfach: Platine hineinlegen - anschrauben -
fertig. Eventuell vorhandene interne Steckkarten sollten dabei schon
angeschlossen sein, da ein nachtr&auml;glicher Einbau etwas sperrig ist
(was aber nicht hei&szlig;en soll, da&szlig; er unm&ouml;glich w&auml;re).
Leider habe ich aber trotz Warnhinweis zwei der Sechskantschrauben
&uuml;berdreht, soll hei&szlig;en, zu fest angezogen und abgerissen. Diese
Schrauben sind anscheinend wirklich sehr empfindlich, denn fest angezogen
habe ich wirklich nicht.<BR>

<BR>F&uuml;r den Anschlu&szlig; der externen Tastatur mu&szlig; auch noch
eine Platine auf einen SMD-Chip gesteckt werden, welche f&uuml;r meinen
Geschmack etwas locker auf den Chip sitzt. Ich brauchte nur an einem Eck
mit dem Finger ansto&szlig;en und schon war die Platine wieder herunten.
Nach einem aber mittlerweile mehrw&ouml;chigen Gebrauch konnte ich noch
keine Probleme mit der Tastatur feststellen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>18:55 Uhr</B><BR>

<BR>Jetzt noch das Diskettenlaufwerk eingebaut, was auch ohne Probleme von
statten geht. Komischerweise kommen wir nun zu Punkt 7 (wo wohl Punkt 5 und
6 geblieben sind? Ach ja, die Busplatinen gibt es ja noch nicht).<BR>

<BR><B>Disk-Laufwerk, LED-Anzeige, L&uuml;fter-Anschlu&szlig;</B><BR>

<BR>Jetzt zeigt es sich, ob man sich gedacht hatte: &quot;Die
Polarit&auml;t merke ich mir, auch ohne das ich sie mir extra aufschreiben
m&uuml;&szlig;te.&quot;, und nun zu dem Schlu&szlig; kommt, das dem doch
nicht so war (verletzer Finger ...). Zum Gl&uuml;ck ist das alte
Diskettenkabel 6 Jahre lang in der gleichen Position gewesen, soda&szlig;
ein kurzer Blick darauf einem die Polarit&auml;t wieder preis gibt. Mit dem
mitgelieferten ca. 35cm langen Diskettenkabel, welches &uuml;brigens ruhig
ca. 40cm haben k&ouml;nnte, verbindet man nun das Laufwerk mit der
Hauptplatine. Der Anschlu&szlig; der LEDs ist auch einfach, wobei jedoch
bem&auml;ngelt werden mu&szlig;, da&szlig; nur die Power- und die
Festplatten-LED verwendet werden, und obwohl eine dritte LED im Tower
vorhanden ist, wird diese nicht f&uuml;r die Floppy verwendet. Vielleicht
mache ich das noch selber. Wer einen Reset-Anschlu&szlig; hat (gibt es
sowas &uuml;berhaupt am A1200?) kann diesen auch noch anschlie&szlig;en.
Danach kommen wir bereits zu Punkt 8:<BR>

<BR><B>Einbau eines internen Netzteils</B><BR>

<BR>Das interne Netzteil hat mir kein Kopzerbrechen bereitet, anders jedoch
die Montage des Power-Schalters. Dazu mu&szlig; zun&auml;chst der bereits
im Geh&auml;use befestigte Schalter ausgebaut (kein Problem) und danach der
Schalter vom Netzteil eingebaut werden. Allerdings waren mir beim Einbau
des Schalters die F&uuml;hrungsschienen f&uuml;r die Steckkarten im Weg,
bis ich auf die glorreiche Idee kam, diese auszubauen (sind nur
angeschraubt). Auch hier zeigt es sich, das ein Durchlesen der Anleitung
vielleicht doch n&uuml;tzlich sein kann, denn genau das steht dort:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Entfernen Sie dazu zun&auml;chst die schwarze Zorro-Karten Halterung, indem
Sie die beiden Schrauben von der Towerunterseite her l&ouml;sen.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Auch den n&auml;chsten Absatz h&auml;tte ich gleich lesen sollen,<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>Befindet sich am Netzschalter ein gelb-gr&uuml;nes Kabel, so schrauben Sie
dieses mit dem Schalter an die Towerfront.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>dann w&auml;re mir der zweimalige Aus- und Einbau des Kartenhalters
erspart geblieben. Doch auch diese H&uuml;rde wurde von mir genommen, und
die Tastatur harrte schon auf ihren Zusammenbau, Punkt 9:<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>19:45 Uhr</B><BR>

<BR><B>Zusammenbau der Tastatur / AMIGA-Version</B><BR>

<BR>Die Beschreibung daf&uuml;r ist sehr ausf&uuml;hrlich und sollte
niemanden Probleme bereiten. Nur einen kleinen Sch&ouml;nheitsfehler hatte
die Sache f&uuml;r mich. Die Anleitung meinte:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>L&ouml;sen Sie die Schrauben im Geh&auml;useboden.
<BR>...
<BR>Nun drehen Sie die infinitiv Tastatur um und verschrauben die beiden
Geh&auml;useh&auml;lften mit den 3 zuvor ausgebauten Schrauben.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Leider konnte ich dabei nicht ganz der Anleitung folgen, da das neue
Geh&auml;use gar nicht zusammengeschraubt war. Auch keine der
mitgelieferten Schrauben wollte in die 3 Schraubenl&ouml;cher am
Tastaturgeh&auml;useboden passen. Mein einziger Ausweg waren die alten
Geh&auml;useschrauben von meinem A1200, welche somit auch noch einer
sinnvollen Verwendung zugef&uuml;hrt werden konnten.<BR>

<BR>Damit w&auml;re der Umbau f&uuml;r all jene abgeschlossen, die
&uuml;ber keine interne Festplatte verf&uuml;gen, und einem ersten Test
st&uuml;nde nichts mehr im Wege. Ich jedoch habe eine 2.5&quot; 120MB
Harddisk, und mu&szlig; diese noch mit einem extra gekauften Flachbandkabel
(das alte vom A1200 ist etwas zu kurz) anschlie&szlig;en. Auf einen
3.5&quot; Einbaurahmen f&uuml;r meine 2.5&quot; Platte warte ich noch, und
so steht diese eben in der Zwischenzeit gem&uuml;tlich im Tower und erfreut
sich eines gro&szlig;en Platzangebotes. Damit bin auch ich mit meinen
Arbeiten fertig und es erfolgt der mit Spannung erwartete Test.<BR>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>20:00 Uhr</B><BR>

<BR><B>Test</B><BR>

<BR>Stecker rein, Tastatur, Maus und Monitor anschlie&szlig;en, einschalten
- funktioniert. Mit Freuden konnte ich feststellen, das gleich am Anfang
alles reibungslos funktioniert hat. Der Rechner bootet ohne Probleme, die
Tastatur nimmt alle Tastendrucke entgegen und auch das Diskettenlaufwerk
versieht seinen Dienst wie &uuml;blich (nur ohne LED).<BR>

<BR>Da ich aber auch noch Besitzer einer Blizzard 1260 mit SCSI-Modul bin
(war bei dem obigen Test bereits eingebaut), und leider noch keinen Adapter
von Sub-25 auf 50-poliges Flachbandkabel habe, mu&szlig;te ich den
derzeitigen Stecker durch das an der Geh&auml;useoberseite befindliche,
aufschraubbare Loch nach au&szlig;en legen. Aber ein daran angeschlossener
SCSI-Tower funktioniert, ohne mir Schwierigkeiten zu machen. Ein freier
&quot;Slot&quot;, wie vom A1200 her bekannt, gibt es beim infinitiv II
Tower nicht.<BR>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER WIDTH="60%">
<TR VALIGN=TOP><TD ALIGN=CENTER><FONT SIZE="-1">
Mir gef&auml;llt der neue invinitiv II Tower recht gut. Der Umbau ist von einem
ge&uuml;bten Bastler recht einfach zu bewerkstelligen und die mitgelieferte
Umbauanleitung hat, bei mir jedenfalls, keine Fragen offen gelassen. In
manchen Teilen ist sie soger &uuml;bergenau, was jedoch nur positiv gewertet
werden kann. Leider sind die neuen Busplatinen noch nicht (zum Zeitpunkt,
als ich diesen Artikel geschrieben habe, 08.12.1998) zu haben. Laut
Mitteilung von Micronik ist damit aber aller Voraussicht nach am Anfang
des n&auml;chsten Jahres zu rechnen (vielleicht gibt's sie mittlerweile schon).
<BR></FONT>
</TD></TR></TABLE>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR>
  <TD COLSPAN=2><B>Preisliste (in ATS):</B>
</TR>
<TR>
  <TD>infinitiv II Tower (inkl. Netztzeil)</TD>
  <TD ALIGN=RIGHT>2.599,00
</TR>
<TR>
  <TD>Tastaturumbausatz A1200</TD>
  <TD ALIGN=RIGHT>649,00
</TR>
<TR>
  <TD>IDE Kabel, 44pol, 2.5&quot;, 70cm</TD>
  <TD ALIGN=RIGHT>199,00
</TR>
</TABLE>&nbsp;

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=80 HEIGHT=10 ALT="[80]"><IMG SRC="../images/_box_black.gif" WIDTH=20 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=87 HEIGHT=10 ALT="[87]"><IMG SRC="../images/_box_black.gif" WIDTH=13 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#bernd">Bernd Gollesch</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00E1.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.micronik.de/">Micronik</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0C/invinitivii.gif">Infinitiv II Tower</A> (GIF; 101K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00E0.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00E2.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
