<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Game Guide - Eine zweite Meinung</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">The Amiga Game Guide - Eine zweite Meinung</Font></center></h1></P>

<p>Der gute Yonder hatte diese CD in der NoCover 78 ja schon ausf&#252;hrlich vorgestellt, so da&#223; ich an dieser Stelle, &#228;hnlich wie schon bei der &quot;Digital Make Up&quot; CD, hier nur meinen ganz pers&#246;nlichen Eindruck der CD wiedergeben werde und den Inhalt nicht nocheinmal auflisten werde. </P>

<p><h2><center><font color="yellow">Flop oder Top?</Font></center></h2></P>
Vorweg kann ich schoneinmal sagen, da&#223; ich Yonder in vielen Punkten zustimme - insbesondere der angepriesene Online Support ist schlicht und ergreifend einfach nicht vorhanden. Sicherlich ist so ein Angebot arbeitsintensiv und ich kann auch gut verstehen, da&#223; bei den geringen Mengen, die man im Amiga Markt noch absetzt, so eine Angebot recht wenig Sinn macht, aber dann preise ich soetwas erst gar nicht an. Das nur so nebenbei...</P>

<p>Was mich aber vielmehr st&#246;rte, ist die Tasache, da&#223; man zu vielen Spielen &#252;berhaupt keine Screenshots bekommt und teilweise nur sehr wenige Fakten vorhanden sind. Es ist sicherlich lobenswert, Cheats &amp; Testberichte (u.a. aus der NoCover) zu einigen Spielen herauszusuchen, aber diese Games sind klar in der Minderheit. Es ist mir durchaus bewusst, da&#223; es eine Schweinearbeit sein muss, so viele Informationen zusammenzustellen, aber von einem kommerziellen Nachschlagewerk erwarte ich, da&#223; ich auch Screenshots zu vielen Spielen bekomme - zumindest k&#246;nnte man diese ja in ein evtl. Update integrieren. Ich kann mich gut an das &quot;Action Replay&quot; erinnern, mit dem man von vielen alten A500 Games qualitativ hochwertige Screenshots machen konnte - ansonsten existieren auch im Aminet noch einige gute Screen Grabber. </P>

<p>Aber ich will nicht nur meckern: So hat es mich extrem &#252;berrascht, da&#223; das Nachschlagewerk, welches nach eigenen Angaben rund 1650 Games enth&#228;lt, recht komplett zu sein scheint und auch total alte Klamotten wie Metal Masters, Bubble Bobble oder Rainbow Island enth&#228;lt. Es d&#252;rfte wohl nur sehr wenige Spiele geben, die in dieser Guide nicht aufgef&#252;hrt werden, womit die Zusammensteller ihr Prim&#228;rziel wohl erreicht haben. Insofern sollte man evtl. Updates auch so gestalten, da&#223; mehr Informationen zu den einzelnen Games geboten werden. Auch das HTML Layout ist nicht von Pappe, wenngleich es nat&#252;rlich nicht besonders anspruchsvoll ausgefallen ist (was aber auch nicht n&#246;tig ist). Hier trifft der Term &quot;funktionell&quot; mal wieder volkommen zu. Die zahlreichen Zugaben (Icon`s, Spielst&#228;nde, Demos, Patches etc.) runden diese CD sinnvoll ab, wenngleich dieser Bereich, zugunsten der Game Guide, nat&#252;rlich vernachl&#228;ssigt wurde (was aber nicht als 
Kritik aufzufassen ist!). </P>

<p>Insgesamt w&#252;rde ich sagen, da&#223; die erste Version des AGG zwar nicht der Wei&#223;heit letzter Schluss ist, aber als Basis f&#252;r weitere (umfangreichere) Versionen ein sehr guter Ausgangspunkt ist. Wer einen gut aufgemachten und liebvoll zusammengestellten &#220;berblick &#252;ber s&#228;mtliche Amiga Spiele haben m&#246;chte, der ist schon jetzt mit dem AGG gut beraten und sollte, auch zum Preis von rund 30 DM, zugreifen. Allerdings bleibt zu hoffen, da&#223; die Zusammensteller bald Updates (zweite Auflage der CD etc.) ver&#246;ffentlichen, die das vorhandene Material optimal erg&#228;nzen. Sollte dies der Fall sein und die AGG wachsen, st&#252;nde der Bewertung &quot;sehr gut&quot; sicherlich nichts im Wege - die vorliegende Version 1.0 ist leider noch etwas schwachbr&#252;nstig und schwankt so zwischen einem &quot;gut minus&quot; und einem &quot;befriedigend plus&quot;. 
<p><center><img src="agg1.jpg"></P>
<p><img src="agg2.jpg"></P>


<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
