<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Virtual Ball Fighters</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Virtual Ball Fighters</Font></Center></h1></P>
<p><center><img src="vbf1.jpg"></P>
<p><img src="vbf2.jpg"></Center></P>

<p>Mit Virtual Ball Fighters legen XTeam in Verbindung mit Epic Marketing ein neues Action-Knobelspiel, welches auf dem Uralt Klassiker Tetris basiert, vor und wollen damit einmal mehr die Amiga User vor dem Bildschirm fesseln. Ob dies gelingt, soll dieser Test zeigen.</P>

<p><h2><center><font color="yellow">Ein paar einleitende Worte</Font></Center></h2></P>
<p>Virtual Ball Fighters (im folgenden &quot;VBF&quot;) kommt ausschlie&#223;lich auf CD daher, die mit rund 350 MB an Daten auch recht gut gef&#252;llt ist. Schon hier wird klar, da&#223; es sich bei VBF mitnichten um einen simplen Tetris Clone handelt. Auch die Anforderungen an die Hardware lassen schnell aufhorchen:</P>

<p><u>Minimum:</U><BR>
AGA<BR>
4 MB Fast Ram<BR>
68030<BR>
AHI 4.0<BR>
CD Rom (4 X Speed)</P>

<p><u>Empfohlen:</U><BR>
Amiga OS 3.x<BR>
68040 oder 68060<BR>
8 MB Fast Ram<BR>
CD Rom (8 X Speed)<BR>
Grafikkarte </P>

<p>Noch schnell einige Worte zum Thema Grafikkarte: Da die Entwickler leider keine Grafikkarte im Einsatz haben, waren die Entwickler auf Tests mittels WimUAE beschr&#228;nkt. Aus eigener Erfahrung kann ich sagen, da&#223; VBF sowohl unter WinUAE als auch Picasso96 Standard Amiga`s l&#228;uft. Ob das Game auch unter CyberGFX lauff&#228;hig ist, kann ich an dieser Stelle leider nicht beurteilen. Und falls gar nichts mehr klappt, kann man immer noch auf die HighRes Aufl&#246;sung zur&#252;ckgreifen, die zusammen mit der PicassoIV auch recht gut funktionierte.</P>

<p>Bevor wir uns dem Spiel widmen, sei noch erw&#228;hnt, da&#223; sich auf der CD auch noch 13 qualitativ hochwertige Audio Tracks befinden, die die aufgebaute Atmosph&#228;re des Spiels perfekt unterst&#252;tzen und VBF zudem in einem positivn Licht erscheinen lassen - welcher simple Tetris Clone hat schon sotwas zu bieten? Der einzigste Kritikpunkt, der an dieser Stelle ebenfalls erw&#228;hnt werden sollte, ist die Anleitung die sowohl in AmigaGuide als auch HTML in drei verschiedenen Sprachen vorliegt (Deutsch, Englisch &amp; Italienisch). Allerdings kann man mit der AmigaGuide Datei aufgrund eines absolut schlechtem Layout &#252;berhaupt nichts anfangen und sollte somit auf die (optisch ohnehin bessere) HTML Version zur&#252;ckgreifen. Allerdings waren die Entwickler der deutschen Sprache wohl nicht m&#228;chtig genug und somit finden sich einige interessante Stilbl&#252;ten in dem deutschen HTML Text wie etwa &quot;um ganztags der Verteididgung der Gerechtigkeit zu weihen&quot; oder &quot;Die Tatse 
des Feuers&quot; (Feuerknopf!!!). Wer der englischen Sprache m&#228;chtig ist, sollte diese in der HTML Version w&#228;hlen...</P>

<p><h2><center><font color="white">Das Spiel</Font></center></h2></P>
<p>Wie oben bereits erw&#228;hnt, handelt es sich bei VBF prinzipiell um einen Tetris Clone. Ein Blick auf die gut gef&#252;llte CD sowie die Anforderungen an die Hardware lassen aber schnell erahnen, da&#223; weitaus mehr hinter VBF steckt - und das tut es auch: Zun&#228;chst einmal wird man von einem sehr sehenswerten Intro begr&#252;&#223;t, das man sich unbedingt mal anschauen sollte - immerhin wird hier kurz die Rahmenhandlung, in der VBF spielt, angerissen: Der Rockstar Siggy (ein headbangendes Skelett - das gibt gleich einen Bonus Punkt von meiner Seite aus :-)))) hat den Preis von einer Million Dollar f&#252;r denjenigen ausgerufen, der sich im virteullen Murmeldrehen als der versierteste auszeichnet. Allerdings geht das Ger&#252;cht um, da&#223; Siggy diesen Wettbewerb nur als Promotiongag f&#252;r sein neues Video nutzen will. Soviel also zur Handlung...</P>

<p>Jetzt kann man sich voll dem Spielgeschehen zuwenden: Jeweils drei Murmel fallen von oben in verschiedenen Farben herunter, die der Spieler durch Dr&#252;cken des Feuerknopfes tauschen kann. Ziel dabei ist es, drei  oder mehr gleichfarbige Kugel horizontal, vertikal oder diagonal anzuordnen, die dann alsbald vom Spielfeld verschwinden - das klassische Tetris Prinzip also. Dieses Spiel hat schon in dieser Form tausende von Computer Usern s&#252;chtig gemacht, aber VBF geht einen Schritt weiter und hat diesem zugegebenerma&#223;en etwas angestaubten Prinzip noch einige Features hinzugef&#252;gt: Man spielt immer zu zweit - also wahlweise gegen den Computer oder einen menschlichen Spieler, sofern dieser vorhanden ist. Aus eigener Erfahrung kann ich sagen, da&#223; das Spiel gegen einen Menschen weitaus mehr Spa&#223; macht und f&#252;r die eine oder andere durchgezockte Nacht sorgen kann. Jedesmal, wenn man drei oder mehr Kugeln vom eigenen Spielfeld verbannt, wird beim Gegner Lebensenergie abgezogen - wer 

also schnell spielt, ist hier klar im Vorteil. Zudem gibt es noch viele Boni, die im Spiel durch einen Buchstaben in der Kugel markiert sind und verschiedene Wirkungen, wie z.B. mehr Lebensenergie, vertauschen der Steuerungsbefehle beim Gegner oder das schnellere Fallen von Kugeln, haben.</P>

<p>Die wohl wichtigste Neuerung bei VBF ist wohl die Einf&#252;hrung von verschiedenen Spielfiguren, die &#252;ber verschiedene Eigenschaften verf&#252;gen. Eine Auflistung aller Spielfiguren findet ihr in der Nachfolgenden Tabelle</P>
<p><center><TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>Charaktäre</B></H2></CAPTION><TR>
</TR><TR>
<TD>Alice</TD>
<TD>24 Jahre alte Chemiekantin</TD>
</TR>
<TR>
<TD>Cortez</TD>
<TD>Ein über 1000 Jahre alter Baum...</TD>
</TR>
<TR>
<TD>Kappa</TD>
<TD>Ein Goblin</TD>
</TR>
<TR>
<TD>Little Iron</TD>
<TD>Ein taiwanischer Roboter, der weggelaufen ist...</TD>
</TR>
<TR>
<TD>Pedro</TD>
<TD>Ein Pinguin, der einen Nuclearkrieg anzetteln will </TD>
</TR>
<TR>
<TD>Siggy</TD>
<TD>Ein headbangendes Skelett</TD>
</TR><TR>
<TD>Tako</TD>
<TD>???</TD>
</TR><TR>
<TD>Wing Chun</TD>
<TD>17 jährige Kampfsportlerin </TD>
</TR>
</TABLE></P></Center><BR>
<p>Jede dieser Spielfiguren hat bestimmte Eigenschaften. So ist Cortez zum Bleistift gegen alle Extras imun, wohingegen Alice &#252;ber ein hohes Ma&#223; an Lebensenergie verf&#252;gt. Die Wahl der Spielfigur zu Anfang wirkt sich also auch direkt auf das nachfolgende Spiel aus und da jeder Gegner unterschiedlich ist, sollte man seine Taktik dementsprechend anpassen. Gegen eine Lebensenergieschwachen Gegner sollte man also alles daran setzen, m&#246;glichst schnell Punkte zu machen, wohingegen man sich gegen einen im Spiel langsamen Gegner (weniger Intelligenz) auch etwas Zeit lassen kann, um dann auf einen Schlag direkt mehrere Kugeln zu vernichten. </P>

<p>Das alles w&#252;rde bisher ein gutes Spiel ergeben, welches aber aufgrund seiner Eindimensionalit&#228;t auch recht schnell langweilig werden w&#252;rde. Aus diesem Grund haben XTeam auch mehrere Spielmodi (insgesamt 6) integriert, die vom simplen  Spieler gegen Spieler &#252;ber den Story Mode bis hin zum Battle Mode f&#252;hren und eine insgesamt hohe Langzeitmotivation versprechen. Diese Langzeitmotivation wird zudem dadurch erh&#246;ht, da&#223; man im Spiel selber Passw&#246;rter erh&#228;lt, welche neue K&#228;mpfer aktivieren, die man dann nat&#252;rlich auch als eigene Spielfigur verwenden kann. Zudem hatten die Programmierer gl&#252;cklicherweise Einsicht mit den Spielern und so kann man nach jedem Match das Spiel auf Festplatte speichern. Gespielt wird VBF &#252;brigens direkt von CD - eine Installation auf Festplatte ist nicht vorgesehen und macht auch recht wenig Sinn.</P>
<p><center><img src="vbf3.jpg"></Center></P>
<p>Das komplette Spiel ist also schonmal rundherum gelungen und auch die Technik hinter VBF ist alles andere als schwachbr&#252;nstig. Neben den oben bereits erw&#228;hnten Soundtracks werden auch die Spielfiguren w&#228;hrend des Spiel bei ausreichender Rechenpower gelungen animiert. Zudem gibt`s vor jedem Spiel gelungene Renderbilder des jeweiligen Spielortes, die eindrucksvoll beweisen, da&#223; die Jungs von XTeam einiges auf dem Kasten haben. Unn&#246;tig zu erw&#228;hnen, da&#223; sich auch das Hintergrundbild bei jedem Austragungsort ver&#228;ndert und somit Abwechselung garantiert ist. Lediglich die Einstellungsmen&#252;s wirken dagegen etwas spartanisch, was den geneigten Zocker aber auch nicht weiter st&#246;ren sollte.</P>

<p><h2><center><font color="red">Fazit</Font></Center></h2></P>
<p>Mit VBF ist XTeam ein potentieller Hit gelungen, der mich auf Anhieb in den Bann gezogen hat und mal wieder beweist, da&#223; der Amiga Spielemarkt noch lange nicht tot ist. Zudem ist der Preis von 49 DM konkurrenzlos niedrig und sollte Fans dieses Genres unbedingt zum Kauf animieren - die kleinen M&#228;ngel in der Anleitung kann man somit getrost vergessen und das Spiel einem jeden Amiga User, der &#252;ber die n&#246;tige Ausstattung verf&#252;gt, empfehlen. Aber Vorsicht: Suchtgefahr!</P>
<p><center>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>ca.49 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Stark erweiterter Tetris Clone mit hoher Suchtgefahr</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD></TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE></P><br>
 

<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
