<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
    <HEAD>
        <TITLE>Leserbrief von Martin</TITLE>
        <META NAME="GENERATOR" CONTENT="MetalWEB 4.0.1 (18.04.2000) ©1997-2000 Multitaskers, Alle Rechte vorbehalten">
        <META NAME="AUTHOR" CONTENT="Martin Voepel">
    </HEAD>
    <BODY BACKGROUND="l_bg.gif" BGCOLOR="#FFFFFF" TEXT="#000000" VLINK="#CC0000" LINK="#0000CC" ALINK="#FFFF00">
<BLOCKQUOTE><a name="top">
            <BR>
            <H1 ALIGN="CENTER">Brief von Martin</H1><BR>
            <HR>
            <BR>
            <UL>
                <li><a href="#a0"><b>an Alle</a></b>
                <li><a href="#a1"><b>an Andreas</a></b>
                <li><a href="#a2"><b>an Charly</a></b>
                <li><a href="#a3"><b>an Charly / Wolf</a></b>
                <li><a href="#a4"><b>an Wolf</a></b>
            </UL>
            <BR>
            <a name="a0"><br>
            <H2>An Alle!</H2>
            <HR>
            <BR>
            <BR>
            <TABLE>
              <TR VALIGN="TOP">
              <TD><H2 ALIGN="RIGHT">Ich w&uuml;nsche Allen sch&ouml;ne Weihnachten und alles gute im Jahr 2001!<BR>
              <BR>
              <BR>
              <BR>
              <BR>
              <BR>
              Martin</H2>
              </TD>
              <TD><IMG SRC="mv_rm.jpg" ALT="R&auml;chermann von der Firma PEWO" WIDTH="154" HEIGHT="217"></TD>
              </TR>
             </TABLE>
            <H4 ALIGN="RIGHT"><a href="#top">zum Anfang</a></H4><BR>
            <BR>
            <HR>
            <a name="a1"><br>
            <H2>Hallo Andreas!</H2>
            <HR>
            <BR>
            <BR>
            Du lieferst mir die NC normalerweise auf HD-Diskette, aber die NC 80 habe ich gleich zweimal bekommen! Undzwar einmal auf HD &raquo; normal und dann nochmal auf DD-Disk, auf beiden fehlte editorial.html!?<BR>
            Absicht, zufall, vergessen?<BR>
            <BR><H4 ALIGN="RIGHT"><a href="#top">zum Anfang</a></H4>
            <HR>
            <a name="a2"><br>
            <H2>Hallo Charly! </H2>
            <HR>
            <BR>
            <BR>
            <FONT SIZE="+2">V O E P E L </FONT><BR>
            <BR>
            Als erstes muss ich Dir schreiben, das mein Nachname nicht Voelpel sonder <B>V O E P E L</B> heisst! Gesprochen wird mein Name dann allerdings V&ouml;pel. <BR>
            Frag mich nun aber nicht woher der stammt oder was das genau heisst, den das wei&szlig; keiner so ganz genau. In unserer Familie gehen manche davon aus das es bei dem Namen sich um eine Ableitung von &raquo;dem aus dem Volk&laquo; handeln k&ouml;nnte, aber das ist nur eine Vermutung. <BR>
            <BR>
            <HR WIDTH="30%">
            <FONT SIZE="+2">Mitglieder - Liste</FONT><BR>
            <BR>
            Die Umgestaltung der Mitglieder - Liste gef&auml;llt mir auch noch nicht soganz und ich werde auch noch daran arbeiten, aber <BR>
            1. Das h&auml;ngt nicht von mir alleine ab, sondern von Sascha der f&uuml;r den Inhalt, also auch f&uuml;r die Personen zust&auml;ndig ist, die darin erscheinen oder auch nicht. <BR>
            2. Bei Benutzung von nur einem Frame, also nicht Frame - Mitglieder - Frame sondern Frame - Mitglieder ist Andreas zust&auml;ndig. Die Zuordnung kann n&auml;mlich lauten <BR>
            &lt;li&gt;&lt;a href=&quot;mitglieder/mitglieder.html&quot; target=&quot;_top&quot;&gt;Mitglieder&lt;/a&gt;&lt;/li&gt;<BR>
            und dann ist das Platzproblem gel&ouml;st. <BR>
            Aber ich werde beide nochmal anschreiben, was aber Offline Zeit braucht! <BR>
            <HR WIDTH="10%">
            <BR>
            Als ich die oberen Zeilen schrieb, wusste noch nicht das ich mir ein Erk&auml;ltung einfangen w&uuml;rde (Krankschreibung) und dadurch Zeit hatte die Mitglieder - Liste neu zu Layouten. Ich hoffe sehr das dass neue Layout schon in der NC81 ist. Und Dier gefällt?!<BR>
            <BR><H4 ALIGN="RIGHT"><a href="#top">zum Anfang</a></H4>
            <HR>
            <a name="a3"><br>
            <H2>An Charly und Wolf!</H2>
            <HR>
            <BR>
            <BR>
            Nat&uuml;rlich ist mit einem normalen Editor auch ein HTML-Dokument zu schreiben aber f&uuml;r mich ist es so einfacher. Man k&ouml;nte auch Final Writer benutzen (Speichern als... HTML), aber webPlug ist frei, ziemlich ausgereift und leicht zu bedienen. Warum also dann nicht?<BR>
            Zu GoldED kann ich nichts sagen, war mir immer zu teuer.<BR>
            <BR>
            Wie vielleicht schon aufgefallen ist, sind meine HTML-Seiten in dieser NC neu gesetzt, das liegt an &lt;BLOCKQUOTE&gt; - - Text - - &lt;/BLOCKQUOTE&gt;!<BR>
            Vor webPlug hatte ich eigentlich keine Ahnung von HTML und aus B&uuml;chern sowas zu Lernen ist nicht mein <I>Ding</I>.<BR>
            <BR><H4 ALIGN="RIGHT"><a href="#top">zum Anfang</a></H4>
            <HR>
            <a name="a4"><br>
            <H2>Hallo Wolf!</H2>
            <HR>
            <BR>
            <BR>
            <FONT SIZE="+2">Zu webPlug:</FONT><BR>
            <BR>
            Wie Du gesehen hast, oder auch noch nicht, habe ich deinen Vorschlag befolgt und einen Workshop zu webPlug geschrien. <A HREF="ws_webplug/ws_webplug.html" TARGET="_self">Siehe: webPlug Workshop</A>! Ich hoffe er ist zu Deiner zufriedenheit ausgefallen? Es ist recht schwer nicht HTML zu erkl&auml;ren aber trotzdem auf webPlug fern&uuml;ftig einzugehen. Ich habe fast ausschlie&szlig;lich die Version 1.45 beschriben weil ich mit ihr arbeite und sie auf deutsch ist.<BR> 
            Auch mein englisch ist in zwischen eingerostet und englische Anleitungen sind f&uuml;r mich auch nicht immer der absolute "bringer"!<BR>
            <HR WIDTH="30%"> 
            <BR>
            <FONT SIZE="+2">Zu MetalWEB:</FONT><BR>
            <BR>
            Nat&uuml;rlich ist es nicht n&ouml;tig HTML-Texte nochmahl mit MetalWEB nachzubearbeiten, aber kann f&uuml;r manche HTML-aufgaben recht n&uuml;tzlich sein. Nur ein paar Seiten vom  Workshop haben &uuml;berhaupt MetalWEB "gesehen", dieser Text zum Beispiel gar nicht. Er ist mit webPlug v1.45 geschrieben worden.<BR>
            <HR WIDTH="30%">
            <BR>
            <FONT SIZE="+2">Was anderes:</FONT><BR>
            <BR>
            Wie kommt ein <I>alter</I> EDV-Spezialist zum Amiga? Lochkarten waren doch die "Spezialit&auml;t" von IBM (bei Einf&uuml;gung schon veraltet), und dann ein Amiga? Dass muss doch ein Quantensprung um Lichtjahre gewesen sein, oder?<BR>
            <HR WIDTH="30%">
            <BR>
            <FONT SIZE="+2">Zum Tipp:</FONT><BR>
            <BR>
            Ja, nagut, aber auch ein nein, den, wer im APC & TPC - Computerclub ist m&uuml;&szlig;te sich mit einem Browser auskennen und nicht noch an "die Hand" genommen werden. Ich glaube n&auml;mlich das die Mitglieder sich inzwischen gans gut mit ihrer Maschine auskennen und nicht erst seit "gestern" einen Amiga haben sondern schon recht lange. Mit alter hat das alles nichts zu tun, sondern nur mit Erfahrung.<BR>
            <BR>
            <H4 ALIGN="RIGHT"><a href="#top">zum Anfang</a></H4><BR> 
            </BLOCKQUOTE>
            <HR>
            <BR>
            <P ALIGN="CENTER"><A HREF="mitglieder/voepel.html"><IMG SRC="mv_g.png" ALT="Martin Voepel" BORDER="0"></A><BR>
            <BR>
    </BODY>
</HTML>
