<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>
<table width=100% border=0 cellpadding=6><tr><td>
<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>an alle</a></b></li>
<li><a href="#a2"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a3"><b>f&uuml;r Karl-Heinz Bader</a></b></li>
<li><a href="#a4"><b>f&uuml;r Carsten Schr&ouml;der</a></b></li>
</ul>
<hr size=4>
<br>
<h3><a name="a1">Liebe Leser!</h3>
<p>Es ist die Zeit gekommen, dass ich allen ein beschauliches
Weihnachtsfest und einen guten Rutsch ins n&auml;chste Jahr <a
href="leser_wolfz1.html"> <b> w&uuml;nsche</b></a>. Denn dies ist wohl die
letzte NoCover in der 00-Runde. Ein weiteres Jahr mit dieser Zahlenkombination
werden wir naturgem&auml;&szlig; alle nicht mehr erleben. Quintesenz: Es
kann nur besser werden. Es hat zwar keiner gefragt, aber ich w&uuml;nsche
uns f&uuml;r das kommende Jahr mehr Engagement der Mitglieder f&uuml;r die
NoCover und mehr ........... ach ihr wisst schon, was ich meine. </p>

<p>Also bis zum n&auml;chsten Jahr alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Kilian!</h3>
<p>Du brauchst dich doch nicht entschuldigen, wenn du mir aus Zeitmangel
nicht schreibst bzw. nicht schreiben kannst. Du wei&szlig;t genau, dass ich f&uuml;r
Sch&uuml;ler im Stress vollstes Verst&auml;ndnis entgegenbringe. </p>

<p>Und wenn du feststellst, dass auch von dir einmal ein Artikel ohne
Schaltfl&auml;che in der NoCover vorhanden ist, dann gib doch einfach den
Rat, die Schaltfl&auml;che selbst in die wie hier im vorliegenden Fall in
NoCover_multimedia.html als <br>

<center><b> &lt;li&gt;&lt;a href=&quot;mcoktober/metalcorner.html&quot;
target=&quot;rechts&quot;&gt;Metalcorner &lt;/a&gt;&lt;/li&gt;
</b></center><br>

einzutragen. Du willst doch bestimmt es auch gerne sehen, wenn diese Rubrik
intensiver gelesen wird und nicht nur einmal so auf die Schnelle. Du kannst
aber auch den Rat geben, in meiner NC-Guide in der entsprechenden Rubrik
nachzuschauen, denn da habe ich meist die Querverweise eingebracht. </p>

<p>Den Honigtopf h&auml;ttest du gerne in der Ecke stehen lassen
k&ouml;nnen. Ich bin doch l&auml;ngst nicht der Einzigste, der die NoCover
"am Leben erh&auml;lt". Das sind wir doch alle gemeinsam. Nur da manche
halt eine Denkpause einlegen, springe ich hier, wenn ich es vermag, etwas
in die Bresche. Eines habe ich aber wirklich aufgegeben und das ist die
Besprechung der Aminetreihe. Letztens hat mich ein Nachbar gefragt, nachdem
er bei mir die Aminet-CD's gesehen hat und ich ihm erkl&auml;rte, was sich
dahinter verbirgt, ob ich nicht seine Urlaubsfotos einbringen k&ouml;nnte.
Meine gro&szlig;en Augen. die ich darob bekam, kannst du dir bestimmt gut
vorstellen. Als ich ihm dann versicherte, dass ich wirklich keine Ahnung
habe, wie dies vonstatten geht, glaubte er es. Ich glaube, es war wirklich
h&ouml;chste Zeit, dass ich mein Abo gek&uuml;ndigt habe. </p>

<p>Deine Frage, ob ich eine regelm&auml;&szlig;ige Serie auflege, muss ich
entschieden mit NEIN beantworten. Es ist nichts so t&ouml;tlich, wie eine
Serie, die dann irgendwann mit Gewalt am Leben erhalten werden soll. Ich
werde weiterhin kleine Artikel aller Schattierungen platzieren, nur meine
Wolf-INFO bleibt bestehen, aber auch weiterhin ohne eine feste
Themenrichtung. </p>

<p>Dass es mit der NoCover wieder bergauf geht, siehst du doch auch daran,
dass auch die Spalte "Leserbriefe" sich langsam aber stetig wieder
f&uuml;llt. Tools bleibt leider weiterhin ziemlich leer, aber irgendwann
wird man auch f&uuml;r diese Sparte wieder f&uuml;ndig und es gibt dann
Neues zu berichten. Ich sehe das alles nicht so schwarz, auch wenn viele
Interpretationen verschiederner Publikationen gar nichts rosiges mehr
versprechen. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a3">Gr&uuml;&szlig; dich Karl-Heinz!</h3>
<p>So kurz bei uns und schon bekommst du meinen zweiten Leserbrief. ;-)<br>
Du ziehst meinen Artikel (Auf)gelesen heran. Er ist eigentlich dreigeteilt.
Einmal die Aussage eines "Unwissenden", der aber unbedingt etwas "Schlaues"
sagen wollte, zum Zweiten das Essay &uuml;ber die Gefahrenm&ouml;glichkeit und zum
Dritten unausgereifte Fantasien, die sich zwar gut anh&ouml;ren, aber irgendwie
nicht ganz durchdacht sind. Die Artikel habe ich bewusst unkommentiert
gelassen, jeder soll sich selbst seinen Reim darauf machen. H&auml;tte ich
meinen Senf dazu gegeben und wahrscheinlich dann noch in meinem etwas derb
bissigen und ironischen Schreibstil, dann kommt ja keiner mehr zum
selbstst&auml;ndigen Denken und glaubt auch noch alles, was er liest. </p>

<p>Darf ich dir einen kleinen Tip geben? Das &lt;p&gt; nach &lt;/li&gt;
bewirkt <b>zwei</b> Leerzeilen zum n&auml;chsten &lt;li&gt;. Ein &lt;br&gt;
nach &lt;/li&gt; bewirkt gar nichts, dagegen ein zweites &lt;br&gt; erzielt
<b>eine</b> Leerzeile. </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a4">Gr&uuml;&szlig; dich Carsten!</h3>
<p>Es ist wirklich lange her, dass du einen Leserbrief in der NoCover
geschrieben hast oder auch nur einen bekommen hast. Und ich stelle mit
Stolz fest, dass du auch die NoCover liest, denn viele sagen: Ich habe
keine Zeit, bin im Stress, die Schule frisst mich auf und einmal in der
Woche m&ouml;chte ich schlie&szlig;lich mal in die Disco gehen usw usw.
Wenn <b>du</b> sagen w&uuml;rdest, f&uuml;r die NoCover habe ich leider
aber wenig Zeit, da gibt es bestimmt keinen, der dies nicht nachvollziehen
und verstehen k&ouml;nnte. Umso erstaunlicher ist es, dass du auch Artikel
bis zum Ende liest. Sonst w&auml;re dein Leserbrief in der NC-80 nicht
entstanden. </p>

<p>Du wei&szlig;t, wenn f&uuml;r mich ein Anlass zur Kommunikation
vorliegt, schicke ich dir stets eine Mail. Diesen Brief schreibe ich aber
so, dass ihn andere mitlesen k&ouml;nnen. Es betrifft n&auml;mlich das
Kriterium "Feedback". Leider kann ich nicht mehr nachvollziehen, wie es
einmal zur Aussage kam: "AmigaAktuell geh&ouml;rt sowieso zum Nonplusultra
und bedarf deshalb keiner besonderen W&uuml;rdigung." In diesem Punkt gibst
du mir wohl Recht, dass es so peu &agrave; peu dazu &uuml;berging, die
AmigaAktuell aus den W&uuml;rdigungen (genannt Feedback) herauszulassen.
Dass du nun als Redakteur der AmigaAktuell diesbez&uuml;glich ziemlich im
Dunkeln stehst, hat dabei wohl keiner bedacht. Ehrlich, auch ich hatte mir
keine Gedanken dar&uuml;ber gemacht, da AmigaAktuell eigentlich ein
selbstst&auml;ndiges Magazin ist und du einen viel gr&ouml;&szlig;eren
Leserkreis als nur die APCler ansprichst. Und es ist noch gar nicht so
lange her, dass du eine Erhebung &uuml;ber Plus und Minus &uuml;ber die AA
gemacht und auch ausgewertet hast. </p>

<p>Feedback in der NoCover ist eigentlich ganz ehrlich mehr ein
psychologisches Element f&uuml;r die "Wenigschreiber", denn wenn diese sich
da wiederfinden, kann es auch als Ansporn dienen und vielleicht gibt es
demn&auml;chst mal wieder mehrere Artikel zu lesen. Und Andreas braucht
kein F&uuml;llmaterial aus dem Netz mehr ziehen. Das soll beileibe keine
Kritik an dem Inhalt der Beitr&auml;ge gewesen sein, aber die NoCover ist
doch ein Magazin von Mitglieder f&uuml;r Mitglieder. Und da liegt der "Hase
im Pfeffer". Alle wollen etwas zu lesen und zu schauen haben, keiner hat
aber Zeit etwas selbst beizutragen, aber schimpfen, das macht Spa&szlig;.
Damit meine ich aber nicht dich, denn du hast ja nicht geschimpft. </p>

<p>Mit meinen Ausf&uuml;hrungen wollte ich eigentlich dich nur ganz ganz
leise bitten, keine Feedbacks in der NoCover f&uuml;r die AA einzufordern.
Aber es ist bestimmt eine gute, eine sehr gute Idee, zus&auml;tzlich zu den
NoCoverfeedbacks auch eine kleine Unterrubrik f&uuml;r die AA mit
einzur&auml;umen. W&uuml;rde dir das etwas helfen? </p>

<p>Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
