<html>
<head>
<!-- author = "Wolf Zimmer"   -->
<title>WOA2000</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>WOA2000</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr><td>
Auf der Website von Haage und Partner fand ich folgendes:
<center>
<table border=1 width=90% bgcolor="#a0a0a0"><tr><td>

<p>05. November 2000:<BR> <B>WOA 2000 - WORLD OF AMIGA-Messe in
K&ouml;ln</B><BR> Jetzt ist es soweit -die erste reine AMIGA-Messe seit
vielen Jahren findet wieder in K&ouml;ln statt. Vom 9.-10. Dezember ist
dann der moderne MediaPark im Herzen von K&ouml;ln das Ziel der
AMIGA-Fans.</p>

<p>Highlight der Messe ist nat&uuml;rlich die erste &ouml;ffentliche
Pr&auml;sentation des neuen AmigaOS 3.9 und auch der Verkaufsstart. In
einem gro&szlig;en Seminarsaal wird es st&uuml;ndlich Vortr&auml;ge zu AmigaOS
3.9 und interessanter AMIGA-Software und Hardware geben.</p>

<p>H&auml;ndler und Hersteller haben schon Ihr Kommen zugesagt.
Nat&uuml;rlich wird auch Bill McEwen anwesend sein, um den Amiga-Fans seine
Vision von der AMIGA-Zukunft zu pr&auml;sentieren. </p>
</td></tr></table></center>

<p>Etwas detaillierter sind dann die Aussagen, wenn man tiefer in diese
Meldung einsteigt, glaubt man. Mitnichten. Es ist immer der gleiche Text, nur
mit Bilder des Mediaparks angereichert. </p>

<p>
Dies ist der Standplan und bei Anklicken des Bildes k&ouml;nnt ihr ihn auch
in gro&szlig; (500×600) sehen. Das ist der Stand vom 12.11., denn da habe ich
mir die Seite von Haage und Partner angeschaut und auch dieses Bild gezogen.
Als ich in der H&auml;ndlerliste nachschaute, fand ich zwar keine
Wahnsinnsaufz&auml;ung, sondern nur diese "vorl&auml;ufige" Ausstellerliste: <br>
<a href="st_woa2000d.gif">
<img src="st_woa2000c.gif" width=200 heigth=259 align=left hspace=8></a> <ul>
<li> Amiga Inc. </li>
<li> AmigActive </li>
<li> AmigaClub </li>
<li> Amiga Future </li>
<li> APC/TCP  </li>
<li> CoolBits </li>
<li> DreiEinHalb Computer </li>
<li> Elbox </li>
<li> epic interactive </li>
<li> Eternity </li>
<li> Falke-Verlag </li>
<li> Haage&amp;Partner Computer </li>
<li> Hyperion </li>
<li> individual computers </li>
<li> Schatztruhe </li>
<li> Verkosoft </li>
</ul><br clear=all></p>

<p><img src="st_woa2000a.gif" width=350 heigth=329 align=left hspace=6>Da
die meisten Nichtk&ouml;lner (trifft auch f&uuml;r viele K&ouml;lner zu) mit dem
Mediapark in K&ouml;ln nichts anfangen k&ouml;nnen, versuche ich eine kleine globale
&Uuml;bersicht zu geben. Die beiden Ausschnitte aus dem Stadtplan sollen die
Lage etwas mehr veranschaulichen. Seht ihr, wo der Pfeil hinzeigt? Das ist das
Gel&auml;nde des alten G&uuml;terbahnhofs. Auf dem zweiten Kartenausschnitt ist die
Lage der Geb&auml;ude 6 und 7 schon zu sehen und auch wie weit es bis zum n&auml;chsten
U-Bahn-Anschluss ist. Wie es mit Bus oder Stra&szlig;enbahn aussieht, fragt mich
nicht, ich wei&szlig; es nicht. Eines wei&szlig; ich aber mit Gewissheit, mit dem Auto
fahre ich nicht rein. Der Ring ist immer &uuml;berlastet und wenn man sich einmal
verkehrt eingeordnet hatte, dann ist guter Rat teuer und sehr zeitaufwendig. Auf
der HP von Haage&amp;Partner ist ein gutes und detailliertes Bild für alle
Anreisenden. Druckt es euch aus und euch wird geholfen. Meine Ausschnitte sollen
nur eine Global&uuml;bersicht vermitteln.

<br clear=all></p>

<p><img src="st_woa2000b.gif" width=350 heigth=329 align=left hspace=6>
<b>Vom G&uuml;terbahnhof zum Medienstandort </b><br>
(Text stammt aus www.mediapark.de) <br>
Wohnen, Arbeiten, Entspannen - in einem &ouml;ffentlichen Park, mitten in K&ouml;ln.
Mit dieser Vision kauften Stadt und Land 1987 den G&uuml;terbahnhof Gereon. Ein
Jahrzehnt sp&auml;ter ist auf dem Gel&auml;nde in unmittelbarer Cityn&auml;he der
MediaPark entstanden. Zahlreiche Unternehmen und Bildungstr&auml;ger aus der
Medien- und Telematikbranche mit fast 3000 Besch&auml;ftigten haben sich hier
angesiedelt. Es gibt ein Multiplex-Kino, Gastronomie, 250 Wohnungen, ein
eigenes Umspannwerk - eingebettet in eine gr&uuml;ne und wasserreiche
Parklandschaft. </p>

<p>Anfang der 80er Jahre gehen in K&ouml;ln Tausende Arbeitspl&auml;tze
verloren. Vor allem der Maschinenbau und die Chemieindustrie leiden unter
starken Struktureinbr&uuml;chen. Die Stadt sucht nach neuen Standbeinen.
Schnell ist klar: Medien- und technologieorientierte Unternehmen
k&ouml;nnten K&ouml;ln den Aufschwung bringen. In dieser Situation bietet
die Deutsche Bundesbahn ihren Gereon-G&uuml;terbahnhof zum Verkauf an - ein
200.000 Quadratmeter gro&szlig;es Grundst&uuml;ck in bester Lage. Als der
Stadtrat im Dezember 1985 ein Konzept zum Ausbau der Medienstadt K&ouml;ln
beschlie&szlig;t, ist der sp&auml;tere MediaPark auf dem
Gereon-Gel&auml;nde bereits fester Bestandteil. Zwei Monate sp&auml;ter
beginnen die Kaufverhandlungen mit der Deutschen Bundesbahn. </p>

<p>Gutachten best&auml;tigen, dass das Gereon-Grundst&uuml;ck ein idealer
Standort f&uuml;r Unternehmen aus den Bereichen Medien und Telematik sei
und auch Tr&auml;ger von Ausund Weiterbildung sowie Forschung und
Entwicklung beste Voraussetzungen f&auml;nden. Am 11.5.1986 entscheidet
sich die Stadt per Beschluss endg&uuml;ltig daf&uuml;r, den MediaPark zu
bauen. Eine Entwicklungsgesellschaft soll die Umsetzung des gesamten
Projektes &uuml;berwachen, ihr wird das Gel&auml;nde 1989 &uuml;bertragen.
Anteilseigner der Gesellschaft sind die Stadt K&ouml;ln, das Land
Nordrhein-Westfalen und ein privater Investor. </p>

<p>Bereits zuvor, im Februar 1987, schreibt die Stadt K&ouml;ln einen
st&auml;dtebaulichen Ideenwettbewerb aus. Gesucht wird ein r&auml;umliches
Konzept f&uuml;r den MediaPark, das die vorhandenen Nutzungsvorstellungen
-Gr&uuml;nfl&auml;chen, B&uuml;rogeb&auml;ude, Wohnh&auml;user und
Infrastruktur - umsetzt. Im April 1988 entscheidet sich der Rat der Stadt
K&ouml;ln aus &uuml;ber 100 Architektenentw&uuml;rfen f&uuml;r den
Vorschlag von Prof. Eberhard Zeidler aus Toronto. Kern seiner Idee ist die
sternf&ouml;rmige Anlage von Geb&auml;uden um einen zentralen Platz. Dieses
Konzept schreibt die Stadt im Bebauungsplan fest. </p>

<p>Die MediaPark K&ouml;ln Entwicklungsgesellschaft (MPK) bem&uuml;ht sich
nun intensiv, die insgesamt 13 Einzelgrundst&uuml;cke im MediaPark zu
verkaufen. Bereits im November 1989 ist der erste Vertrag perfekt. Weitere
Abschl&uuml;sse folgen. </p><p> W&auml;hrend die Vermarktung der
Grundst&uuml;cke im vollen Gange ist, erschlie&szlig;t die MPK zwischen
1990 und 1992 den MediaPark in eigener Regie. Zentralplatz, See,
Br&uuml;cke, Gr&uuml;nufer sowie Tunnel mit unterirdischer Ringstra&szlig;e
und Zentralgarage entstehen. </p>

<p>Als erstes Geb&auml;ude er&ouml;ffnet der Cinedom im Dezember 1991. Das
Umspannwerk im MediaPark stellt die GEW im Juni 1992 fertig. Rund 16 Monate
sp&auml;ter k&ouml;nnen die ersten Mieter die Geb&auml;ude am Gr&uuml;nufer
beziehen - die von der Nordstern-Versicherung errichtete "Wohnschlange". Im
M&auml;rz 1994 wird das AGFA-Haus eingeweiht. </p>

<p>Mitte der 90er Jahre beginnt eine Zeit des Stillstandes und Abwartens -
im MediaPark tut sich nur wenig. Verschiedene Investoren ziehen sich aus
finanziellen Gr&uuml;nden aus dem Projekt zur&uuml;ck. </p>

<p>Mit der &Uuml;bergabe des KOMED-Hauses Anfang 1997 geht es mit dem MediaPark
wieder voran. Auch die Victoria-Versicherung beginnt jetzt mit dem Bau
ihres Geb&auml;udes, das im Sommer 1999 fertiggestellt wird. Ein paar Monate
zuvor werden bereits die Arbeiten am MediaPark-Hotel von einem neuen
Investor wieder aufgenommen. </p> <p> Und auch andere Baul&uuml;cken schlie&szlig;en
sich nun: An der Maybachstra&szlig;e entsteht 1999 ein Wohnund B&uuml;rogeb&auml;ude, und
direkt neben dem Cinedom wird im Fr&uuml;hjahr 2000 der Musictower eingeweiht.
Kurz darauf beginnen auf dem Nachbargrundst&uuml;ck an der Maybachstra&szlig;e die
Bauarbeiten zur MediaPark Klinik. </p>

<p>Im August 2000 &ouml;ffnet das Jolly-Hotel im MediaPark, das benachbarte
B&uuml;rogeb&auml;ude wird zur gleichen Zeit bezogen. Ebenfalls im Sommer 2000 feiert
das neue Wahrzeichen des MediaParks Richtfest: der 148 Meter hohe K&ouml;lnTurm,
der 2001 bezugsfertig sein wird. </p>

<p>Das letzte freie Grundst&uuml;ck im MediaPark ist Ende 1999 an eine
K&ouml;lner Investorengruppe verkauft worden. Der Baubeginn hier ist Anfang
2001. Somit werden 2002/2003 alle Bauarbeiten im MediaPark abgeschlossen
sein. K&ouml;lns modernstes Viertel schreitet seiner Vollendung entgegen.
</p>

<hr size=4>
</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
