<HTML>
<HEAD>
<TITLE>Mroocheck Test by TriMa</TITLE>
</HEAD>
<BODY BGCOLOR="WHITE">
<CENTER><IMG SRC="mroocheck.gif" ALT="MrooCheck Adapter" BORDER="0">
<H1>Mroocheck</H1></CENTER>
<BR>
Wenn man Amigam&auml;use mit den heute g&auml;ngigen PC M&auml;usen vergleicht, f&auml;llt einen sofort der Komfort und die Ergonomie der PC M&auml;use auf, man findet dort selten nochM&auml;use mit nur 2 Tasten, 3 Tasten sind dort das absolute Minimum, und die meisten M&auml;use kommen gleich mit Wheels oder als Trackball daher, sch&ouml;n und gut, warum hat der Amiga nicht solche M&auml;use? Nun gut, 3 Tasten M&auml;use und optische M&auml;use gibts auch auf dem Amiga, aber wenn man sich eine neue kaufen will, hat man eigendlich nur noch die original Amigamaus zur Auswahl.<P><img src=mroodir.jpg><p>
Aber Halt! Es gibt noch eine Einfache, aber sehr wirkungsvolle Alternative, Mroocheck! Mroocheck ist ein Adapter, welcher zwischen dem normalen Amiga Mausport und einer PC Maus! gesteckt wird. Ja, mit Mroocheck kann man nun PCM&auml;use an seinem Amiga anschliessen, nun das ist derweil nicht allzu neu, es gibt ja noch den Topolino Mauskonverter, aber Mroocheck besticht durch seine Einfachheit, einfach Mroocheck Adapter an den Mausport angeschlossen und die PCMaus 
hinten ran, schon kann man die PCMaus<IMG SRC="mrootest.jpg" align=left>(eingeschr&auml;nkt) benutzen. Um die ganze Maus voll benutzen zu k&ouml;nnen, muss man nur das auf der mitgelieferten Diskette(ne HD Disk, im DD Format, bei Elbox &uuml;blich) befindliche Installscript ausf&uuml;hren. Dieses Installiert unter anderem den Mroocheck.driver nach C: und f&uuml;gt diesen in die User-Startup ein. Dieser Treiber macht aber leider einige Schwierigkeiten, man sollte diesen bei Spielen wie Payback, Quark oder HereticII besser ausschalten(mroocheck.driver STOP), da man sonst nicht spielen kann. Leider macht der Treiber auch bei manchen WB Programmen &auml;rger, wie zum Beispiel in Dynamite bei mir, wenn ich Dynamite starte und dort chatten will, dann wird der Cursor alle 3 Sekunden um eins nach links versetzt, was dann zu undefinierbaren Buchstabenm&uuml;ll f&uuml;hrt. Leider kam von Seiten Elbox schon lange kein Treiberupdate mehr, ist nur zu hoffen, dass diese Bugs bald 
behoben werden.<P><img src=freewheel1.jpg><p>

Nebst Mroocheck.driver werden aber noch ein Calibrierungsprogramm(MroocheckCal) mit Installiert, sowie ein TestProgramm(MroocheckTest), welches zum Testen der Wheels da ist, wo wir auchschon bei Freewheel sind. Dieses beinhaltet ein Prefsprogramm zur Kontrolle der Mauswheels, welches aber nicht ver&auml;ndert werden sollte. Im Alltagsgebrauch lassen sich die Wheels fast &uuml;berall benutzen. In diversen Mui Applikationen, wie IBrowse, Voyager, AmIRC oder StrICQ, in stinknormalen Workbenchfenstern oder in Multiview auch. Alles in allem ist der Mroocheck Adapter aber eine sehr gute und Empfehlenswerte Anschaffung, da durch den Mroocheck Adapter wirklich alles ins Amiga-Maus-Format umgewandelt wird, h&ouml;here Aufl&ouml;sungen, Wheels oder Trackballs, am besten kauft man sich Mroocheck gleich zusammen mit einer PC Maus(ich habe es mir zusammen mit der A4Tech Maus WWW25 gekauft welche 3 Tasten und 2 Wheels hat)!<P>

by TriMa

</BODY>
</HTML>
