<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - EagleLinux</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>EagleLinux M68K</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>

<B>Linux?</B>

<P>Eigentlich sollte jeder schon einmal etwas von Linux geh&ouml;rt haben. Aber
f&uuml;r die, die es noch nicht wissen: Linux ist ein <B>Betriebssystem</B> f&uuml;r so
ziemlich alle Rechnertypen, sogar f&uuml;r Amiga und Atari. Linux enth&auml;lt
alles, was ein modernes Betriebssystem braucht, Multitasking,
Speicherschutz, Netzwerkf&auml;higkeiten, und das alles zum Nulltarif! Linux
ist kostenlos und unterliegt der GPL (Gnu Public License), was bedeutet,
daﬂ der Quellcode frei verf&uuml;gbar ist. Jeder darf sich &quot;sein&quot; Linux
zusammenstricken, also auch auf andere Rechner portieren, solange er
den Quellcode dazu offenlegt.</P>

<P>Linux ist ein Unix-Abk&ouml;mmling, also pr&auml;destiniert f&uuml;r Netzwerke, aber
auch gut auf Einzelplatzrechnern zu verwenden. Die integrierte Multi-
User-Funktionalit&auml;t macht das System sicher, wenn man die T&uuml;ren nicht
selbst sperrangelweit offenstehen l&auml;ﬂt (auch das geht nat&uuml;rlich unter
Linux).</P>

<P>Wenn Sie jetzt denken, Linux w&auml;re ein Universit&auml;tsbetriebssystem f&uuml;r
Studierte, und f&uuml;r Alltagsdinge unbrauchbar, liegen Sie schief. Man
stolpert manchmal &uuml;ber Linux, wo man es am wenigsten erwartet. Sicher
haben Sie auch den Kinokn&uuml;ller &quot;Titanic&quot; gesehen, und sich &uuml;ber die
Effekte gewundert. Nein, es war kein Amiga, auch keine SGI-Workstation,
schn&ouml;de Inteldosen unter Linux waren hier am Werk.</P>

<P>Linux ist aber auch kein Einsteigerbetriebssystem, wie Sie noch bemerken
werden.</P>

<P>Einen wirklich umfassenden &Uuml;berblick &uuml;ber Linux findet man in der Ausgabe
7/98 der Zeitschrift c't. Vielleicht kennen Sie jemanden, der jemanden
kennt, der c't regelm&auml;ﬂig liest. Oder Sie wohnen in meiner N&auml;he... </P>

<P><B>Die eierlegende Wollmilchsau</B></P>

<P>Warum verwendet dann nicht jeder Linux, wenn es so toll und g&uuml;nstig ist?
Der erste Hauptgrund liegt wohl an den <B>Systemanforderungen</B>. W&auml;hrend man
einen mathematischen Koprozessor noch durch Softwareroutinen problemlos
ersetzen kann, ben&ouml;tigt man f&uuml;r virtuellen Speicher eine MMU (Memory
Management Unit). Es fallen also alle Amiga aus, die einen Prozessor ohne
vollwertige MMU haben. Geeignet sind nur der MC68030 (nicht 68EC030 !),
der MC68040 (nicht 68EC040 !) und MC68060. Das heiﬂt, die groﬂe Masse der
Amigas ist aus dem Rennen. Wenn man die grafische Benutzeroberfl&auml;che X11
benutzen will, ist eine Grafikkarte unbedingt Pflicht. Es l&auml;uft zwar auch
ohne, aber man braucht eine Eselsgeduld, da man dann jedem Displayelement
beim Aufbau zusehen kann.</P>

<P>Obwohl Linux durchaus mit 4 MB Speicher l&auml;uft, f&auml;ngt eine
ordentliche Ausstattung bei 16 MB Speicher an; wenn man eine grafische
Benutzeroberfl&auml;che m&ouml;chte, bei 32 MB. Der Prozessor ist relativ egal, Spaﬂ
macht es erst ab MC68040 mit 40 MHz. Die Festplatte sollte mindestens 150
MB frei haben; wenn man noch andere als die Systemprogramme nutzen will,
ist 500 MB die untere Grenze.</P>

<P>Wem jetzt noch nicht die Lust vergangen ist, dem sei der Spruch zur
Installation aus dem Eagle Linux Handbuch nahegelegt: &quot;1.Schritt: Bevor
Sie die Installations-CD einlegen, seien Sie sich sicher, auch schwere
Schicksalsschl&auml;ge verkraften zu k&ouml;nnen.&quot; </P>

<P><B>Distributionen</B></P>

<P>Die Warnung ist berechtigt. Denn Linux (und Unix allgemein) ist zwar ein
extrem konfigurierbares System, mit Einstellungsdateien, die im Klartext,
also ASCII vorliegen, aber genau das ist auch die groﬂe Schwierigkeit.
Dies ist der zweite Grund, warum Linux so wenig verbreitet ist - das
Konfigurationslabyrinth.</P>

<P>Es gibt praktisch keine zwei Distributionen, die die gleiche Startprozedur
verwenden. Abgesehen davon, gibt es f&uuml;r den Amiga z.Zt. nur eine, n&auml;mlich
die Debian-Distribution. Eagle hat es sich leicht gemacht, und diese (lang
erprobte und stabile) Distribution aufgepeppt und dem Amiga-User bequem
zug&auml;nglich gemacht.</P>

<P>Was heiﬂt bequem? Normalerweise liegen die Installationsdateien nur im
Internet. Eagle, bzw. Dragon Internet Design, eine Tochterfirma von Eagle,
hat die Dateien auf CD gebrannt und eine Installationsroutine dazugegeben.
Bei gut 400 MB Daten eine g&uuml;nstige Alternative zur Telefonrechnung...</P>

<P>Eine Distribution ersch&ouml;pft sich aber nicht darin, die Installation zu
managen, sie hilft auch bei der Systemverwaltung. Eagle Linux tut dies
durch ein Skript namens &quot;Dragon&quot;. Vom hier aus kann man Programmpakete
installieren und entfernen, neue User anlegen, sich einen eigenen Kernel
kompilieren, das Netzwerk konfigurieren, usw.. Zumindest sollte man das
k&ouml;nnen, doch die Version 1.02.33 vom Februar 98, die ich getestet habe,
hat noch so ihre Probleme. Aber der Reihe nach.</P>

<P><B>Vor der Flut - die Amiga-Seite</B></P>

<P>Bevor man Eagle Linux installieren kann, braucht man Platz auf der
Festplatte - das ist auch der Grund, warum dieser Test relativ sp&auml;t kommt.
Ich habe probiert, Linux auf ein ZIP-Medium (100 MB) zu installieren, aber
das ist zu klein. Vorsicht, bei zu wenig Platz auf der Platte kommt keine
Warnung, daﬂ die Installation fehlgeschlagen ist. Man hat nachher nur ein
unvollst&auml;ndiges System und wundert sich, warum manche Dinge nicht
funktionieren. Vielleicht habe ich die Fehlermeldung auch nur &uuml;bersehen,
denn Linux ist sehr geschw&auml;tzig, Status- und Fehlermeldungen gibt es
massenhaft, und viele sind nur ganz kurz zu sehen, weil der Bildschirm
&uuml;berquillt.</P>

<P>Hat man also genug (mindestens 150 MB f&uuml;r eine Testinstallation) Platz,
muﬂ man mittels HDToolBox oder &auml;hnlichem die Linuxpartitionen einrichten.
Vom Linux-eigenen &quot;fdisk&quot; r&auml;t Eagle ab, ich habe es auch nicht probiert,
da mir meine anderen Partitionen auf der Platte zu schade waren. Bei PC-
Distributionen ist das Linux-&quot;fdisk&quot; dem Microsoft-&quot;fdisk&quot; allerdings
in Funktionalit&auml;t und Bedienung weit &uuml;berlegen. Der PC kennt aber weder
unter Windows noch unter Linux so etwas komfortables wie die HDToolBox. </P>

<P>Ein weiteres Problem ist, daﬂ man auf dem Amiga aus dem Amiga-OS heraus
auf Linux umschalten muﬂ. Beides vertr&auml;gt sich nicht, denn Linux schnappt
sich alle Resourcen, egal, ob sie vom Amiga benutzt sind, oder nicht.
Es ist schlieﬂlich keine Emulation wie Shapeshifter, sondern ein
eigenst&auml;ndiges Betriebssystem. Um dieses zu starten, benutzt man
ein kleines Programm namens &quot;amiboot&quot;, das den Linux-Kernel l&auml;dt,
das Amiga-OS killt und die Kontrolle an den Linux-Kernel weitergibt.</P>

<P>Wegen kleiner Hardwareunterschiede gibt es f&uuml;r alle Amigamodelle einen
eigenen Kernel, den man auf der CD in der &quot;Amiga&quot;-Schublade ausw&auml;hlen
kann. Unterst&uuml;tzt werden hier A1200 und A2/3/4000 mit verschiedenen
Screenmodi. </P>

<P>Nochmal einmal die Warnung, daﬂ das Amiga-Modell allein noch nicht
aussagt, ob Linux auch l&auml;uft. Einen A1200 m&uuml;ssen Sie erst kr&auml;ftig
aufr&uuml;sten, bevor Sie etwas anderes als einen Guru zu sehen bekommen! </P>

<P>Mit Grafikkartenunterst&uuml;tzung sieht es schlecht aus. Zwar funktioniert
es mit meiner Cybervision64 (die alte Version), aber nur die Amiga-Modi
werden uneingeschr&auml;nkt unterst&uuml;tzt. Will man einen Modus f&uuml;r Linux
benutzen, so muﬂ man ihn auch f&uuml;r die Workbench einstellen. Beim Versuch,
&quot;amiboot&quot; ohne &quot;Modus &uuml;bernehmen&quot;-Option zu starten, gab es keine Anzeige.</P>

<P>Die Amiga-Modi taugen f&uuml;r ein reines Kommandozeilen-Linux, aber nicht f&uuml;r
mehr. Die grafische Benutzeroberfl&auml;che X11 braucht von allem sehr viel:
Viel Speicher, viel Rechenpower, viel Grafikleistung. Und f&uuml;r die
Konfiguration viel Geduld, allerdings nicht auf dem Amiga, hier gibt es
nur den &quot;Framebuffer&quot;-Server, der einfach den vor dem Starten auf dem
Amiga eingestellten Grafikmodus auch f&uuml;r X11 benutzt. Einfach, aber
unflexibel und deswegen gar nicht Linux-like.</P>

<P><B>Der Eiertanz</B> </P>

<P>L&auml;uft das Installations-Linux von CD dann schlieﬂlich, sollte man seine
heile Amigawelt vergessen und schon mal den <B>Rettungsring</B> bereitlegen.</P>

<P>Da Linux so flexibel ist, muﬂ man genau wissen, was man tut. Viele
Einstellungen sind mit einem unbedacht gew&auml;hlten Men&uuml;punkt des
Installationsskripts zunichte gemacht, und man kann von vorne
anfangen. Es ist zum Beispiel m&ouml;glich, durch wiederholtes anw&auml;hlen
der Auslagerungspartition sp&auml;ter mehrere gleiche Eintr&auml;ge in der
Filesystem-Datei &quot;/etc/fstab&quot; zu finden. Ob Linux dann noch
funktioniert, habe ich lieber nicht ausprobiert.</P>

<P>Fehlerlos klappte die Filesystem-K&uuml;r: Mittels &quot;dragon&quot; kann man problemlos
mehrere Partitionen in den Linux-Verzeichnisbaum einh&auml;ngen. Unter Unix
funktioniert das so, daﬂ man ein Verzeichnis erstellt und eine Partition
darauf &quot;mounted&quot; (das hat nichts mit dem Amiga-Mount zu tun). Man erh&auml;lt
dabei EIN Dateisystem mit der Wurzel &quot;/&quot; (root), und darauf aufbauend
alle Verzeichnisse und Partitionen. Es macht unter Linux dabei keinen
Unterschied, daﬂ &quot;/etc&quot; und &quot;/bin&quot; Verzeichnisse sind, &quot;/usr&quot; und &quot;/home&quot;
dagegen ganze Partitionen, die unter Umst&auml;nden sogar auf einer anderen
Festplatte liegen. Der Nachteil ist, daﬂ man Wechselmedien wie Disketten
und CDROMs erst wieder unmounten muﬂ, bevor man eine neue einlegt.
Vergiﬂt man dies, hat man eine Diskette geliefert und muﬂ sie neu
formatieren.</P>

<P>Der gr&ouml;bste <B>Fehler</B>, der Eagle unterlaufen ist, ist die vergessene
Einbindung des CDROM-Laufwerks in das Installationsskript. Versucht man,
die Softwarepakete zu installieren, fragt das Packettool &quot;dselect&quot; nach
der Installationsquelle. Gibt man CDROM an, geht gar nichts, nimmt man
die Stelle im Dateisystem, an der das CDROM normalerweise sitzt, &quot;/cdrom&quot;,
geht auch nichts, obwohl der Vorgabepfad genauso eingestellt ist.
Sp&auml;testens hier muﬂ man seine Registrierkarte einschicken und die
Hotline bem&uuml;hen. Ab jetzt laufen dann auch die 30 Tage kostenloser
Support...</P>

<P>Dabei ist die L&ouml;sung ganz einfach: Die Installationsroutine &quot;Dragon&quot;
beenden, das CDROM mounten, &quot;Dragon&quot; wieder starten und &quot;dselect&quot; erneut
aufrufen. Nein, so einfach ist es doch nicht, denn es ist ein Fehler im
Handbuch: Das erste SCSI-CDROM ist nicht unter &quot;/dev/scd0&quot; zu finden, wie
auch die Installationsroutine glaubt, sondern unter &quot;/dev/scd1&quot;. Mit einem
IDE-CDROM funktioniert es wahrscheinlich, das konnte ich aber nicht testen.</P>

<P>Das Tool &quot;dselect&quot;, das die Softwarepakete installiert, ist &uuml;brigens
genau dasselbe wie auch auf den PC-Distributionen. Wenn man es schon
kennt, ist alles kein Problem, kennt man es noch nicht, hat man noch
viel Lehrgeld zu zahlen. Bedienungskomfort ist hier n&auml;mlich sehr klein
geschrieben, es z&auml;hlt die Funktionalit&auml;t, die aber ist daf&uuml;r sehr groﬂ.
Abh&auml;ngigkeiten unter den Paketen werden angezeigt, man kann praktisch
kein n&ouml;tiges Zubeh&ouml;r vergessen, alles ist narrensicher. Nur zu dumm, daﬂ
der Editor &quot;ae&quot; sich auf ein anderes Paket st&uuml;tzt, das offensichtlich
nicht vorhanden ist. Er l&auml;uft aber trotzdem. &quot;ae&quot; (Anthony's Editor)
ist &uuml;brigens ein sehr guter Editor f&uuml;r den Anfang, denn er zeigt seine
Tastaturbelegung auf dem Bildschirm an. Wer Emacs oder Vi kennt, der
weiﬂ das zu sch&auml;tzen.</P>

<P><B>Kompatibilit&auml;t</B></P>

<P>Das ist ein heikles Thema. Positiv ist, daﬂ ein SCSI-ZIP-Laufwerk voll
unterst&uuml;tzt wird. Wenn man die Ger&auml;tedatei dazu findet - bei mir war es
&quot;/dev/sdb&quot;, bzw. &quot;/dev/sdb1&quot;, also die erste Partition auf dem Ger&auml;t. Es
ist ganz praktisch, eine FFS-formatierte ZIP-Disk zum Datenaustausch zu
verwenden, denn Linux unterst&uuml;tzt das FFS-Filesystem des Amiga. Aber
Achtung, NUR das FFS (DOS1), nicht FFS-Intl (DOS3).</P>

<P>Lange Gesichter bei den ISDN-Einsteckkarten: Keine wird unterst&uuml;tzt, nur
die externen Adapter, die sowieso wie ein normales Modem anzusprechen
sind. Netzwerkkarten habe ich leider keine, aber es existieren Treiber
daf&uuml;r.</P>

<P>Ein interessantes Erlebnis auch, als ich den Kernel neu &uuml;bersetzen wollte,
was f&uuml;r ein Unix-System eine &uuml;bliche Prozedur f&uuml;r jeden einzelnen Rechner
ist. Ich habe also die Kernelquellen installiert, und wie auf dem PC
&quot;make config&quot; aufgerufen und nicht schlecht gestaunt, als mir nur PC-
Treiber zur Auswahl angeboten wurden und ich schlieﬂlich das System
wahlweise auf 386er, 486er oder Pentium optimieren durfte. Bei
vergleichbaren PC-Distributionen, und damit muﬂ sich auch das Eagle
Linux messen lassen, ist die Kernelerstellung kein Thema.</P>

<P>Immerhin, der Rest der Systemadministration klappt doch recht gut, mal
abgesehen von der Endlosschleife in der Netzwerkkonfiguration. Will man
die immer wiederkehrenden Fragen verlassen, muﬂ man wohl oder &uuml;ber
Control-C dr&uuml;cken (jawohl, das funktioniert auch unter Unix, schlieﬂlich
hat sich der Amiga das dort abgeschaut).</P>

<P><B>Offroad-Abenteuer</B></P>

<P>Wenn man f&uuml;r einen Survivaltrip zu bequem ist, kann man sich zum Ausgleich
gut einmal intensiver mit Linux und dessen Installation befassen. Je &ouml;fter
man installiert, desto mehr bekommt man ein Gesp&uuml;r f&uuml;r Gefahren, und umso
gest&auml;rkter geht man aus einem Desaster hervor.</P>

<P>Die Schuld an den Fehlern kann man selten dem Autor der Distribution geben,
Linux ist eben doch Unix, und viel macht man einfach aus Unkenntnis falsch.
Es hat einige Jahre gebraucht, bis die Distributionen auf dem PC heute f&uuml;r
einen fortgeschrittenen PC-User recht brauchbar sind. F&uuml;r Anf&auml;nger ist ein
Unix aber noch lange nicht zu empfehlen, auch nicht das popul&auml;re Linux.</P>

<P>Durch die extremen Konfigurationsm&ouml;glichkeiten ist jede Installation auf
jedem Rechner praktisch ein Einzelst&uuml;ck. Wenn jemand dabei durchblickt,
dann allerh&ouml;chstens derjenige, der es installiert hat. Eine Distribution
wie Eagle Linux versucht hierbei, durch Standardisierung von einzelnen
Vorg&auml;ngen etwas System in das Chaos zu bringen. Mit annehmbarem Erfolg,
das kann ich ruhigen Gewissens sagen, mit dem Wissen der S.u.S.E.- und
Debian-Distributionen des PC im Hinterkopf. Ohne die Trocken&uuml;bungen mit
den PC-Distributionen und der dazugeh&ouml;rigen, sehr guten Handb&uuml;cher, h&auml;tte
ich zwar l&auml;nger vor dem Amiga gesessen, aber irgendwann h&auml;tte es wohl
schon geklappt.</P>

<P>Wenn es eine Software gibt, bei der das <B>Handbuch</B> wichtiger ist, als die
Software selbst, dann ist es Linux. Das Eagle Linux-Handbuch ist zwar
wesentlich d&uuml;nner, als z.B. der S.u.S.E.-W&auml;lzer mit 498 Seiten, aber man
bekommt einen &Uuml;berblick, der einem klarmacht, daﬂ es ohne weiterf&uuml;hrende
Literatur nicht geht. Unix kommt aus der Wissenschaft und es ist selbst
eine.</P>

<P>Bevor Sie sich eine Linux-Distribution kaufen, egal f&uuml;r welchen Rechner,
reden Sie vorher mit jemandem, der behauptet, Linux erfolgreich
installiert zu haben. Und lassen Sie sich von demjenigen Unterst&uuml;tzung
zusichern.</P>

<P>Hinweis: Bewertet wird nicht Linux, sondern die Eagle-Distribution!</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Eagle Linux M68K</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.eagle-cp.com">Eagle Computer</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Betriebssystem</TD>
    <TD><B>Version:</B></TD>
    <TD>1.02.33</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>69,- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Oberland Computer</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>2</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>3 (Amigaseite 2, Linuxseite 4)</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

<br>eagle computer products GmbH, Altenbergerstr. 7, 71549 Auenwald<BR>
eMail: <A HREF="mailto:linux@eagle-cp.com">linux@eagle-cp.com</A><BR>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812aw.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812do.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

