<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - DOpus Magellan II</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>DOpus Magellan II</H1>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A></DIV>

<P>Nach mal wieder 12 Monaten Entwicklungszeit ist die n&auml;chste Version des
bekannten Dateimanagers erh&auml;ltlich. Die <B>Version 5.7</B>, auch MagellanII
genannt, ist seit der Computer'98-Messe in K&ouml;ln &uuml;ber Schatztruhe zu
beziehen. [Der Test von V 5.6 bzw. <A HREF="9709dom.htm">Magellan I</A> ist in Ausgabe #2
nachzulesen, d. Chefred.]</P>

<P><B>Ausgeliefert</B> wird das Programm wieder auf einer CD ohne Handbuch. Der
Neupreis betr&auml;gt 89,- DM, das Update von 5.x auf 5.7 schl&auml;gt mit 69,- DM
zu. Zus&auml;tzlich gibt es jetzt noch eine neue CD &quot;DOplus&quot; f&uuml;r 55,- DM
(allerdings nur in Englisch). Die Preise beziehen sich auf die
Computer`98.</P>

<P>Als ich nach einigen Stunden m&uuml;de von der Messe wieder zu Hause eintraf,
mu&szlig;te ich trotz sp&auml;ter Stunde noch schnell sehen, was die neue DOpus-
Version so bringt. Als ich w&auml;hrend der Messe die R&uuml;ckseite der CD-H&uuml;lle
las, hatte ich bereits das Gef&uuml;hl, da&szlig; es sich um kein weltbewegendes
Update handelt. Leider stellte sich das nach nur kurzem Anschauen auch
als korrekt heraus.</P>

<P>Als neues Feature k&ouml;nnen jetzt <B>DOpus-Themes</B> erstellt werden, sogar das
Konvertieren von Windows95/98-Themes funktioniert. Ein &quot;Theme&quot; ist eine
Datei, die, wenn sie geladen wird, eine Reihe von Einstellungen vornimmt.
Man kann sich damit bestimmte Konfigurationen zu bestimmten Themen
zusammenstellen. Z.B. das AOD-Theme (zu finden auf der DOplus-CD) l&auml;dt
automatisch einen AOD-Screenshot als Hintergrundbild, stellt andere Farben
ein und konfiguriert die Soundeinstellungen so, da&szlig; bei bestimmten Aktionen
Ashs Stimme ert&ouml;nt.</P>

<P>Das f&uuml;hrt uns zu dem n&auml;chsten &quot;Feature&quot;: die <B>Sound-Ereignisse</B>. Von Win
abgekupfert, ist die Idee trotzdem schon &auml;lter und wer sowas mag, hat
sich vielleicht fr&uuml;her MaxonMagic installiert. Ob sich diese Spielerei
wirklich lohnt, ist sicherlich Geschmacksache, insbesondere da sich schon
in fr&uuml;heren Versionen mit Hilfe der &quot;<B>Skripte</B>&quot; die gleichen Funktionen
einstellen liessen. Die Sound-Ereignisse sind damit nur eine spezielle
Anwendung der Skripte. Ich pers&ouml;nlich empfinde es jedoch nur als
Ressourcen- und Entwicklerzeitverschwendung. </P>

<P>Eine nette Erweiterung ist die M&ouml;glichkeit <B>Wildcards</B> f&uuml;r die
Hintergrundbilder zu verwenden, dadurch lassen sich zuf&auml;llig jeweils
andere Bilder laden.</P>

<P>Erweitert wurden auch die <B>Start-Men&uuml;-Buttons</B>. Es lassen sich jetzt bis zu
zwei Unterleisten &ouml;ffnen, desweiteren kann man den Start-Men&uuml;s auch ein
Hintergrundbild zuordnen. Leider ist nach zwei Ebenen auch wieder Schlu&szlig;
und ein eingebautest &quot;ScanDir&quot; gibt es leider auch nicht.</P>

<P>Kommen wir zum n&auml;chsten Feature: ein <B>neues FTP-Modul</B> gibt es. Es lassen
sich jetzt auch fortgeschrittene Einstellungen vornehmen, z.B. wie oft
versucht werden soll, die Verbindung aufzubauen oder es k&ouml;nnen Skripte
konfiguriert werden, die bei bestimmten FTP-Ereignissen gestartet werden.
Durch die zus&auml;tzlichen Einstellungen l&auml;&szlig;t sich das FTP-Modul als guter
FTP-Client verwenden.</P>

<P>Als <B>weitere Neuerung</B> kann im IconAction-Modus durch Dr&uuml;cken der CTRL-Taste
das &Ouml;ffnen eines weiteren Listers verhindert werden, stattdessen wird der
gleiche Lister verwendet (wie im Textmodus). Leider habe ich keine Option
gefunden, die dies zum Standardverhalten macht. (Allerdings motiviert mich
die Anleitung auch nicht zum gr&uuml;ndlichen Durchlesen) Wenn jemand diese
Information hat, w&auml;re es nett sich beim AmZeiger zu melden und uns das
mitzuteilen.</P>

<P><B>Die Neuerungen hier als &Uuml;bersichtsliste:</B></P>

<UL>
<LI>Themes</LI>
<LI>verbessertes Lister-Layout</LI>
<LI>Zusammenfassung des Options- und Umgebungseditors</LI>
<LI>Hintergrundbilder f&uuml;r Knopfb&auml;nke und Startmen&uuml;s</LI>
<LI>zuf&auml;llige Hintergrundbilder</LI>
<LI>konfigurierbarer Screentitel (inkl. Mondphase - wof&uuml;r auch immer)</LI>
<LI>neues Soundsystem</LI>
<LI>neue DOpus-Pfadlisten-Settings erlauben das Setzen f&uuml;r Systembefehle</LI>
<LI>Unterst&uuml;zung f&uuml;r Filesysteme mit Dateinamen bis zu 107 Buchstaben</LI>
<LI>revidierte interne Befehle - viele nun ersetzbar durch
    benutzerdefinierte Skripte</LI>
<LI>erweiterte &quot;Ebene&quot; f&uuml;r die Startmen&uuml;s</LI>
<LI>verbessertes Dateityp-Identifikationssystem</LI>
<LI>erweiterte Icon- und Lister-Popupmen&uuml;s.</LI>
<LI>verbessertes Snapshot f&uuml;r Lister, Iconmodus und Gruppen.</LI>
<LI>ausgebauterter Icon-Informationsrequester</LI>
<LI>verbessertes Drag &amp; Drop</LI>
<LI>verbesserte Icon-Unterst&uuml;tzung mit schnellerer Anzeige</LI>
</UL>

<P><B>RTFM - Die Anleitung</B></P>

<P>Das gr&ouml;&szlig;te &Auml;rgernis (zumindest der deutschen Version) ist die Anleitung.
Trotz &quot;12monatiger Entwicklungszeit&quot; (plus den 12 Monaten des Magellan-
Updates) war Schatztruhe au&szlig;er Stande, eine gute Online-Dokumentation
mitzuliefern.</P>

<P>Die <B>Hauptanleitung</B>, die die allgemeinen Features beschreibt, stammt noch
von Version 5.1 (beginnend mit dem Kapitel "Was ist neu in DOpus 5.5").
Als nächstes kommt dann das LastMinute-Readme der 5.5. Dann das Readme
von V 5.6 (Magellan) und die Datei `Erg&auml;nzung`, die nun die neuen Features
der V 5.7 beschreibt. Zum gr&uuml;ndlichen Lesen regt diese Anleitung mich
jedenfalls nicht an. </P>

<P>Wird w&auml;hrend der Benutzung von DOpus die <B>Help</B>-Taste gedr&uuml;ckt, tut sich
noch eine andere Anleitung auf. Diese kurze Erkl&auml;rung der Fenster ist
meistens aktuell (im Gegensatz zu Magellan).</P>

<P>Leider wei&szlig; ich auch nicht, ob die ganzen Readme-Dateien der 5.6x-Updates
wenigstens eingearbeitet wurden (V5.62, V5.65, V5.66). Da sie allerdings
auch nicht auf der CD zu finden sind, hoffe ich mal das Beste. :)</P>

<P><B>DOplus-CD</B></P>

<P>In dem Bericht mu&szlig; auch die zus&auml;tzlich erh&auml;ltliche CD erw&auml;hnt werden.
Die nur in Englisch erh&auml;ltliche CD beinhaltet eine Einf&uuml;hrung in DOpus,
eine Sammlung von ARexx-Scripten und zus&auml;tzlichen Dateien. Die CD ist mit
ca. 390 MByte Daten gef&uuml;llt, da ich nun aber auch angeben wollte, wieviel
MByte auf die einzelnen Verzeichnisse fallen, probierte ich DOpus
Magellan IIs &quot;Gr&ouml;&szlig;e ermitteln&quot;-Funktion aus..</P>

<P>Was ich mit einer Verzeichnisgr&ouml;&szlig;e von -439MB (NEGATIV!) und einem
h&auml;ngenden Lister quitiert bekam. Beim zweiten Versuch lie&szlig; sich der Befehl
wenigstens mit einem Klick auf Abbruch beenden, zeigte daf&uuml;r aber auch
&quot;nur&quot; -430MB Daten an. Ein Blick in die Verzeichnisse brachte auch
schnell zu Tage, da&szlig; es nicht unbedingt ein buggy DOpus ist, sondern die
CD nicht sauber gebrannt wurde und kaputte Verzeichnisse enth&auml;lt. Ich
hoffe, da&szlig; ich ein Einzelfall bin und die anderen CDs nicht besch&auml;digt
sind. </P>

<P>Die <B>Einf&uuml;hrung</B> ist ganz nett, allerdings enth&auml;lt sie auch nicht die
&quot;wahren&quot; Geheimnisse von DOpus, wie z.B. den Eliza-Clon in dem DOpus-CLI.
Das Verzeichnis Aminet enth&auml;lt diverse Archive aus dem Aminet und k&ouml;nnte
wohl von dort auch einfach bezogen werden. Dann kommt noch ein Verzeichnis
mit Bildern, von denen ich die meisten nicht anzeigen konnte. Die Bilder
sind neben Hintergr&uuml;nden von einigen bekannten Personen und weiterhin noch
diversen Icon-Sammlungen, dem DOpus-SDK und einigen konvertierten und
nicht konvertierten Win-Themes enthalten. Alles in allem eine nette
Sammlung, aber nichts essentiell wichtiges.</P>

<P><B>Fazit:</B></P>

<P>Das Fazit hat sich demgem&auml;&szlig; nicht seit dem letzten Update ge&auml;ndert. Wer
DOpus 5.x noch nicht kennt, sollte sich die Zeit nehmen, es sich mal sehr
genau anzuschauen und versuchen sich daran zu gew&ouml;hnen. Hat man sich denn
erst einmal mit dem neuen Konzept von DOpus 5 vertraut gemacht, will man
es nicht mehr missen.</P>

<P><B>Das Update</B> ist jedoch meiner Meinung nach im Vergleich zur Vollversion
leider sein Geld nicht wert. Bei einer Preisdifferenz von nur 30,- DM zur
Vollversion erwarte ich mehr. Vor allem w&uuml;rde mal eine vollst&auml;ndige,
einheitliche Anleitung DOpus gut zu Gesicht stehen. Das inzwischen die
Tips &amp; Tricks-Ecke als eigene CD vertrieben wird, finde ich irgendwo
traurig.</P>

<P>Wer eine alte Version 5 hat, sollte sich die Neuerungen angucken, ob
sie f&uuml;r ihn das Geld wert sind. Garantieren kann man das aber nicht.</P>

<P><B>Neukauf:</B></P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>DOpus Magellan II</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.gpsoft.au">Jonathan Potter/GPSoft</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Dateimanager (WB-Ersatz)</TD>
    <TD><B>Version:</B></TD>
    <TD>5.7</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>89DM zzgl. Versandk.</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.schatztruhe.de">Schatztruhe GmbH</a></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
 <P><B>Update:</B></P>
<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>DOpus Magellan II</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.gpsoft.au">Jonathan Potter/GPSoft</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Dateimanager</TD>
    <TD><B>Version:</B></TD>
    <TD>5.7</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>69DM (Update von 5.x)</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.schatztruhe.de">Schatztruhe GmbH</a></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note3.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>3</TD></TR>
</TABLE></P>

Stefan Ossowskis Schatztruhe GmbH, Veronikastr. 33, 45131 Essen<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812linx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812gb.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

