<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Wildfire7 PPC</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Wildfire - Version 7 PPC</H1>von<BR><A HREF="mailto:T.Heinrich@t-online.de">Thomas Heinrich</A></DIV>

<P><B>Gleich vorweg</B>, der Zusatz PPC bedeutet zwar, daﬂ der PowerPC unterst&uuml;tzt
wird, zwingend notwendig ist er aber nicht.</P>

<P><H3><B>Was ist Wildfire eigentlich?</B></H3></P>

<P>Bei der Recherche zu diesem Artikel ist aufgefallen, daﬂ der Name Wildfire
recht beliebt ist. Es gibt z.B. eine 68060-Turbokarte von DKB namens
Wildfire, genauso wie ein paar Musikmodule und Grafiken im Aminet. Dieses
Wildfire ist jedoch die wahrscheinlich beste Grafikbearbeitungssoftware f&uuml;r
den Amiga. Sie k&ouml;nnen Bilder oder ganze Animationen mit Effekten bearbeiten
und als Bilder oder Animation wieder speichern. Und alles das mit einer
intuitiven Bedienung, die man bei vielen anderen Amigaprogrammen
schmerzlich vermiﬂt.</P>

<P><H3><B>Systemvoraussetzungen</B></H3></P>

<P>Zu Anfang gleich die Dinge, die Sie zum Betrieb von Wildfire 7 mindestens
brauchen:</P>

<UL>
<LI>CDROM (keine Diskettenversion erh&auml;ltlich)</LI>
<LI>MC68030 Prozessor</LI>
<LI>FPU (MC68881/2)</LI>
<LI>AGA Chipset</LI>
<LI>Bildschirm mit mindestens 600 x 420 Punkte Gr&ouml;ﬂe
<LI>8 MB freies (!) RAM</LI>
<LI>30 MB freien Festplattenplatz</LI>
<LI>Kickstart 3.0 (V39)</LI>
<LI>MUI V3.8 (Demo auf der CD)</LI>
</UL>

<P>Viel anfangen k&ouml;nnen Sie damit nat&uuml;rlich noch nicht. F&uuml;r einfache
Bildbearbeitung mag es ausreichen, aber allein eine YAFA-Animation mit
60 Echtfarb-Bildern geringerer Aufl&ouml;sung produziert gleich einige Megabyte
Daten. Nat&uuml;rlich k&ouml;nnen Sie auch MPEG-Animationen erzeugen, die wesentlich
kompakter sind - wenn Ihre Hardware die Rechenzeit hergibt.</P>

<P>Auf meinem System hatte Wildfire eine Geschwindigkeit, mit der man
arbeiten konnte, wenngleich ein PPC einen enormen Geschwindigkeitszuwachs
bringt. Sie sollten also haben:</P>

<UL>
<LI> MC68060 Prozessor mit FPU</LI>
<LI>Grafikkarte</LI>
<LI>32 MB RAM</LI>
</UL>

<P>oder, wenn Sie damit nicht dienen k&ouml;nnen:</P>

<UL>
<LI>viel Geduld</LI>
</UL>

<P><H3><B>Harte Fakten</B></H3></P>

<P>Was bekommen Sie f&uuml;r Ihr Geld? Die <B>CD-ROM</B> ist mit 450 MB angenehm voll,
wenngleich das eigentliche Programm installiert &quot;nur&quot; ca. 25 MB
Festplattenplatz braucht. Der Rest der CD sind einige Tools und vor
allem Animationen im <B>YAFA</B>-Format.</P>

<P>Dieses Format, das urspr&uuml;nglich aus der Amiga-Demo-Szene kommt, ist ein
relativ schnelles, daf&uuml;r aber schlecht komprimierendes Animationsformat.
Der Clou dabei ist, daﬂ die Sessions, mit der diese Animationen erzeugt
wurden, auch mitgeliefert werden, so daﬂ Sie eine Menge Beispiele f&uuml;r
die verschiedenen Filter und Effekte haben.</P>

<P>Die <B>Installation</B> l&auml;uft nat&uuml;rlich mittels Installer, also problemlos und
flexibel. Die Demoanimationen werden nicht mitkopiert, hier verlangt das
Programm nach der CD, wenn Sie eine der Demo-Sessions ansehen wollen. Die
Sessions selber werden installiert.</P>

<P>Besitzen Sie einen PowerPC, so wird dieser vom Programm automatisch
unterst&uuml;tzt, allerdings nur unter der PowerUp-Software von Phase 5.
Wie allgemein bekannt sein sollte, k&ouml;nnen Sie dann mit Wildfire kein
Programm starten, das Warp-Up von Haage&Partner benutzt, auch keine auf
Warp-Up optimierten Datatypes.</P>

<P>Ein <B>Handbuch</B> gibt es nicht. Statt dessen findet sich eine HTML-
Dokumentation an, mit der man eine erste Einf&uuml;hrung in die sehr
reichhaltigen Effekte von Wildfire bekommt. Wer noch nie mit Wildfire
gearbeitet hat, wie z.B. ich, der kommt nicht darum herum, hier zumindest
einmal einen Blick hineinzuwerfen. Trotz der einfachen Bedienung des
Programms ist nat&uuml;rlich eine solide Grundlage in Bildbearbeitungswissen
vonn&ouml;ten, um &uuml;berhaupt Resultate zu erzielen. Eine IBrowse-Demoversion
zur Anzeige der Dokumentation liegt &uuml;brigens bei.</P>

<P>Eine weitere unsch&auml;tzbare Hilfe sind die <B>MUI-Bubbles</B>, die sozusagen vor
Ort ganz genau die Bedienungselemente des Programms erkl&auml;ren.</P>

<P>Wenn Sie Wildfire dann starten, was bei mir ca. 8 Sekunden dauerte, haben
Sie etwa 5 MB RAM weniger frei, je nach Bildschirm, den Sie verwenden.
Seien Sie auf jeden Fall groﬂz&uuml;gig mit dem <B>Stack</B>, Wildfire st&uuml;rzt zwar
nicht ab, wenn Sie zuwenig benutzen, aber es startet auch nicht.
Problematisch ist dies im Zusammenhang mit den &auml;lteren Versionen von
&quot;ToolManager&quot;, die den Stack nicht immer richtig setzen. Starten Sie
normal von der Workbench, und verwenden Sie kein selbstgestricktes Icon,
gibt es keine Probleme.</P>

<P>Die <B>Stabilit&auml;t</B> des Programms ist sehr hoch. Zwar zeigten sich auf meinem
Rechner einige wenige Abst&uuml;rze, aber die waren nicht eindeutig Wildfire
zuzuordnen, eher schon den Anzeigeprogrammen f&uuml;r die Animationen. Genauso
blieb das Programm einmal w&auml;hrend der Berechnung einer MPEG-Animation
h&auml;ngen, aber das lieﬂ sich nicht reproduzieren. Es gilt sowieso
grunds&auml;tzlich immer: Erst speichern, dann rechnen.</P>

<P><H3><B>Arbeitsweise</B></H3></P>

<P>Wildfire bezeichnet seine Projekte als <B>Sessions</B>. Solch eine Session
besteht aus den Eingaben, wie Ausgangsbilder und -Animationen, den
Effekten, die darauf angewendet werden, und der Ausgabe, also ob ein
Bild, eine Bildfolge, oder eine Animation erzeugt wird, oder ob das
Ergebnis nur angezeigt, aber nicht gespeichert wird.</P>

<P><B>Projekte:</B><BR>
Wildfire arbeitet mit drei Einstellungsseiten f&uuml;r eine Session. Auf der
Projektseite k&ouml;nnen Sie die Eingabedatei bestimmen, Einzelbilder oder
Animationen, und wie und als was das Ergebnis ausgegeben wird, also z.B.
als Einzelbild, wenn Sie nur ein Bild bearbeiten, oder als MPEG-Animation,
etc..</P>

<P>Weiterhin k&ouml;nnen Sie hier die Art der Effekte bestimmen. Wildfire
unterst&uuml;tzt hier &quot;keine Effekte&quot;, wenn Sie z.B. nur ein Animationsformat
&auml;ndern wollen, z.B. ANIM nach YAFA, &quot;lineare Effekte&quot;, die nacheinander
auf ein Eingabeobjekt (Stream) angewendet werden, und &quot;nichtlineare
Effekte&quot;. Vor allem diese sind das interessanteste Detail an Wildfire.</P>

<P><B>Effekte:</B><BR>
Lineare Effekte werden in einer Liste dargestellt, und mit Parametern
versorgt. Dies sieht einfach aus, ist aber etwas un&uuml;bersichtlich, da
nicht f&uuml;r jeden Effekt Vorschaubilder angezeigt werden, sondern nur
das Endprodukt.</P>

<P>Bei den nichtlinearen Effekten kann man in einer optisch ansprechenden
Weise aus den Operatoren (Effekten) die Gew&uuml;nschten w&auml;hlen, und per Drag
and Drop die verschiedenen Ein- und Ausgaben verbinden. Als Beispiel kann
man mit einem Ladeoperator ein Bild dazuladen, mit einem Hintergrund
verkn&uuml;pfen (Compose), das Ergebnis etwas verzerren (z.B. mit Twirl), und
als Eingabe f&uuml;r einen neuen Hintergrund nehmen. Die Arbeitsweise hierbei
ist tats&auml;chlich &auml;uﬂerst intuitiv, man zieht die Eingabebilder auf die
Eingabefl&auml;chen der Effekte, die Ausgaben auf die Eingabe des n&auml;chsten
Effektes, usw. Die Problematik liegt wohl darin, daﬂ man irgendwann den
Faden verliert, und nicht mehr weiﬂ, welcher Effekt eigentlich wann
verarbeitet werden soll. Aber das Verketten macht unheimlichen Spaﬂ...</P>

<P><B>Einstellungen:</B> <BR>
In den Einstellungen kann zum Schluﬂ noch die Gr&ouml;ﬂe, Farbtiefe und
eventuelles Dithering f&uuml;r das Projekt eingestellt werden.</P>

<P><H3><B>Professionell</B></H3> </P>

<P>Eigentlich h&ouml;rt sich das alles gar nicht so kompliziert an. Das Programm
an sich ist auch nicht schwierig zu bedienen, die Schwierigkeit liegt in
der Bedienung der Effekte. Es ist absolut n&ouml;tig, daﬂ man weiﬂ, welcher
Effekt was bewirkt, um die Eingaben und Variablen richtig zu setzen. Das
Problem liegt darin, daﬂ man eigentlich schon zuvor wissen muﬂ, welcher
Effekt welche Ausgabe erzeugt, um sie sinnvoll zu verketten. Um wirklich
professionell mit Wildfire arbeiten zu k&ouml;nnen, muﬂ man viel Zeit in die
Einarbeitung investieren, aber es lohnt sich.</P>

<P>Besondere Aufmerksamkeit verdienen auch die Variablen des Programms.
Will man z.B. zwei Bilder &uuml;bereinander blenden und daraus eine Animation
erzeugen, rechnet Wildfire nicht nur einfach die Zwischenstufen vom ersten
zum zweiten Bild aus. Vielmehr kann man mittels einer Kurve festlegen, ob
die &Uuml;berblendung z.B. anfangs schneller geht, oder immer zwischen dem
einen und dem anderen Bild hin- und herschwankt, oder das zweite Bild
vielleicht nur zu 50 Prozent eingeblendet wird, also das erste nicht ganz
verdr&auml;ngt.</P>

<P>Mittels der <B>Variablen</B> kann aus den sowieso schon vielen Effekten eine
un&uuml;berschaubare Auswahl kombiniert werden, die jeden Profi
zufriedenstellen muﬂ.</P>

<P>Die Art der Effekte reicht dabei von einfachen Puffern, die zur
&Uuml;berblendung u.&auml;. verwendet werden, &uuml;ber 2D- und 3D-Effekte,
Farbmanipulatoren und Partikeleffekte, bis zu speziellen, wie dem
GhostScript-Import.</P>

<P>Nat&uuml;rlich fehlt auch der <B>ARexx-Port</B> nicht, der sogar als eigener Effekt
eingesetzt werden kann.</P>

<P><H3><B>Fazit</B></H3></P>

<P>Wildfire 7 bietet eine groﬂe Auswahl an Effekten, eine enorme Flexibilit&auml;t
und das zu einem vergleichsweise g&uuml;nstigen Preis. Die Bedienung ist
einfach, die Verwendung der Effekte l&auml;ﬂt sich aufgrund der Online-Hilfe
gut erlernen. Der Grafikbearbeitungseinsteiger wird sich ob der F&uuml;lle der
M&ouml;glichkeiten schwer tun, aber wer die M&ouml;glichkeiten von Wildfire erst
einmal entdeckt hat, der wird es nicht mehr hergeben. Den Profis bietet
Wildfire alles, von dem man, zumindest auf dem Amiga, schon immer getr&auml;umt
hat.</P>

<P>Wer einmal in Wildfire hineinschnuppern m&ouml;chte: Es gibt eine <B>Demoversion</B>
im Aminet unter &quot;biz/demo&quot;. Die &auml;ltere Version 5 f&uuml;r PPC ist auﬂerdem f&uuml;r
99 DM, ohne PPC-Support f&uuml;r 79 DM zu haben. Das Update von Version 5 auf
Version 7 ist f&uuml;r 299 DM minus 40% vom Kaufpreis der alten Version zu
haben. </P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Wildfire 7 PPC</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="mailto:eksec@eure.de">WK-Artworks</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Grafikbearbeitung</TD>
    <TD><B>Version:</B></TD>
    <TD>7</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>299 DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD><A HREF="http://www.oberland.com">Oberland Computer</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note1.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>1</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>1</TD></TR>
</TABLE></P>
<BR>Support:<BR>
Andreas K&uuml;ssner, Marrinksweg 5, 48531 Nordhorn
<p>Bez. Quelle: Oberland Computer, In der Schneithohl 5, 61476 Kronberg, Tel.: 06173 6080</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../amz1298/iv.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812ged.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


