<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Foundation</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Foundation</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>

<P>Bei der <B>Konkurrenz</B>, die durch Klassiker wie &quot;Populus&quot;, &quot;Die Siedler&quot;,
&quot;Colonisation&quot; und vielen anderen Weltengr&uuml;nder-Strategie-Spielen
herrscht, will es scheinen, daﬂ dieses Genre langsam aber sicher
ausgereizt ist. Doch w&auml;hrend Blue Byte an &quot;Die Siedler 3&quot; (f&uuml;r PC)
stricken, kann sich der Amigianer mit einem weiteren Exemplar derartiger
Spiele vergn&uuml;gen: &quot;Foundation&quot;.</P>

<P>Dabei versucht &quot;Foundation&quot; der Konkurrenz vor allem durch seine
<B>technische Umsetzung</B> beizukommen. Das Spiel ist vollst&auml;ndig Multitasking-
kompatibel und systemkonform geschrieben, unterst&uuml;tzt neben AGA auch
Grafikkarten, l&auml;ﬂt Bildschirmmodi frei w&auml;hlen, besitzt eine AHI-
Soundkartenunterst&uuml;tzung, erm&ouml;glicht die Wahl der Sprache f&uuml;r die
Bildschirmtexte und vieles mehr. Die Konfigurationsm&ouml;glichkeiten sind
umfassend. An Grundvorraussetzung verlangt es daf&uuml;r einen AGA-Amiga oder
eine Grafikkarte, mind. 2MB Ram, einen 68020er Prozessor oder h&ouml;her und
nat&uuml;rlich einen CD-R&ouml;mer.</P>

<P>&quot;Foundation&quot; ist das erste Spiel, bei dem ich solche Systemkompatiblit&auml;t
erlebt habe, ein Arbeiten auf der Workbench, w&auml;hrend im Hintergrund die
kleinen Inselbewohner ihren T&auml;tigkeiten nachgehen, ist problemlos m&ouml;glich
und machte bei mir bisher keine Probleme. Diesen Testbericht schreibe ich
auf diese Weise. Einziges feststellbares Manko waren bei mir Probleme
mit AGA-Aufl&ouml;sungen gr&ouml;ﬂer HiRes. Diese f&uuml;hrten entweder zum Absturz oder
zum Fehlen grafischer Elemente und damit zur Unbedienbarkeit des Spiels.
Daﬂ selbiges dadurch auch unheimlich langsam wurde, lieﬂ sich gerade noch
feststellen.</P>

<P>Hat man die im <B>Konfigurationsprogramm</B> des Spiels integrierte, in ihrem
Grad sehr flexible Installation der CD auf Festplatte abgeschlossen und
startet das Spiel, so wird man von einem zwar h&uuml;bsch gerenderten, aber
nicht gerade interessanten oder inhaltsreichen <B>Intro</B> begr&uuml;ﬂt.</P>

<P>Danach pr&auml;sentiert sich das <B>Hauptmen&uuml;</B>, von dem aus noch einmal
spielinterne Einstellungen getroffen, ein altes Spiel geladen, einer
der beiden Spielmodi gew&auml;hlt  und andere Dinge getan werden k&ouml;nnen.
S&auml;mtliche Men&uuml;- oder folgende Auswahlscreens sind mit gerenderten
Landschaften hinterlegt, was bei langsamen CD-Rom-Laufwerken zu etwas
l&auml;ngeren Ladezeiten f&uuml;hren kann, sofern die Grafiken nicht auf Festplatte
installiert wurden.</P>

<P>Hat man sich durch sie hindurchgeklickt, kann das eigentliche Spiel
beginnen. Zun&auml;chst einmal erinnert tats&auml;chlich alles an &quot;Die Siedler&quot;,
zwar sehen die Geb&auml;ude in &quot;Foundation&quot; wesentlich phantastischer aus,
wirkt alles etwas mittelalterlicher, aber das Grundprinzip ist dasselbe.
Es gibt verschiedene Geb&auml;udetypen, zwischen denen die B&uuml;rger unseres
Staates hin- und herpendeln, um so den Produktionsprozeﬂ aufrecht zu
erhalten. Statt einer langwierigen Aufbauphase werden die H&auml;user jedoch
einfach aus dem Boden gezaubert, sofern gen&uuml;gend Rohstoffe daf&uuml;r vorhanden
sind. Aber auch die Statistiken und Randwertekontrollen erinnern stark
an das Siedler-Konzept, z.B. das Festlegen der Transport- und
Produktionspriorit&auml;ten.</P>

<P>Jedoch, obwohl Foundation zun&auml;chst einfacher wirkt, als der BlueByte-
Klassiker, entpuppt sich w&auml;hrend der - aufgrund der zahlreichen kleinen,
rein ikonischen Anzeigen und Buttons, recht langanhaltenden -
<B>Eingew&ouml;hnungsphase</B>, eine unheimlich detaillierte Komplexit&auml;t. Gleich
zu Beginn ist man verbl&uuml;fft, daﬂ jeder Bewohner der Insel, auf der die
jeweilige Mission ausgef&uuml;hrt wird, nicht nur &uuml;ber einen Namen und ein
Gesicht verf&uuml;gt, sondern dar&uuml;ber hinaus auch noch seine &quot;Lebensdaten&quot;
(Gesundheit + Alter) verwaltet werden. Sp&auml;ter stellt man dann fest, daﬂ
auch die gesamte Produktion und der Transport in gleicher Detailliebe
organisiert sind. So l&auml;ﬂt sich f&uuml;r jede Mine einzeln einstellen, wieviel
Anteil ihres Produktionsverm&ouml;gens in Erz, Kohle, Stein oder &Ouml;l investiert
werden soll. Ebenso verh&auml;lt es sich nat&uuml;rlich auch mit den anderen
Geb&auml;uden.</P>

<P>Diese &quot;<B>Entdeckungsreise</B>&quot; ist durch die sehr gelungene Steuerung bedingt,
die es sowohl erm&ouml;glicht, &quot;makroskopisch&quot; mit dem langen Hebel Einfluﬂ
auf das Geschehen zu nehmen, als auch einfach und schnell im Detail zu
operieren. Wie schon erw&auml;hnt, muﬂ man sich lediglich erst einmal
gr&uuml;ndlich mit den Bedeutungen der vielen kleinen Symbole, &uuml;ber die
das Spiel gesteuert wird, vertraut machen.</P>

<P>Hier k&ouml;nnte die in HTML passend gestaltete <B>Anleitung</B> ein wenig
umfangreicher ausfallen. Diesbez&uuml;glich ist auch etwas merkw&uuml;rdig, daﬂ
das HTML-Verzeichnis auf der CD-Rom, in welchem sich selbige befindet,
kein Icon hat. Vorbildlich ist wiederum, daﬂ eine AWeb-Version zum Lesen
der Doku mitgeliefert wird.</P>

<P>Aber kommen wir endlich zum <B>Gameplay</B> selbst. Vor dem Spiel wird dem
Spieler seine Mission mitgeteilt. Dabei steigert sich freilich der
Anspruch mit jeder weiteren Insel, zu welcher man nat&uuml;rlich wiederum
nur durch das Erf&uuml;llen einer Mission gelangt. Ist man auf der ersten
Insel noch allein, steigern sich Anzahl und Intelligenz der Computergegner
schnell. Damit aber auch w&auml;hrend einer Mission f&uuml;r Abwechslung gesorgt ist,
kann man Forscher damit beauftragen, neue H&auml;user, Waffen usw. erfinden zu
lassen. Sollten einmal die Rohstoff-Vorr&auml;te zur Neige gehen, hilft Handeln
oder ein teurerer Soforttausch, sofern man sich nicht dazu entscheidet,
seine Bauern loszuschicken, um die ben&ouml;tigte Ware beim Nachbarn zu
stibitzen. Trotz dieser und zahlreicher anderer Besch&auml;ftigungsm&ouml;glichkeiten
bleibt Foundation ein Spaﬂ f&uuml;r Geduldige.</P>

<P>Vielleicht sind es gerade die von den Siedlern bekannten Bauwettrennen, um
dem Nachbarn ein beanspruchtes Gebiet wegzuschnappen, die Foundation zum
Fesseln des Spielers vor dem Monitor fehlen. Hier verbringt man doch
einige Zeit damit, nur darauf zu warten, bis wieder gen&uuml;gend Rohstoffe
vorhanden sind. Zwar kann man die Spielgeschwindigkeit dreistufig erh&ouml;hen,
jedoch kann das nicht dar&uuml;ber hinwegt&auml;uschen, daﬂ die eigenen Figuren da
eine Weile ohne das Zutun ihres Oberhauptes klarkommen m&uuml;ssen. Und da
schaltet man dann eben doch wieder auf den WB-Screen zur&uuml;ck und schreibt
inzwischen einen Testbericht oder beantwortet eine EMail.</P>

<P>Und damit sind wir beim Stichwort <B>Support</B>. Die Supportseite im WWW macht
einen sehr guten Eindruck, zeugt vor allem von der Begeisterung des Autors
f&uuml;r sein Projekt, f&uuml;r die auch die st&auml;ndige Weiterentwicklung ein starkes
Indiz ist. Neben aktuellen Updates und Demoversionen findet man hier die
komplette Anleitung, Tips&Tricks, verschiedenste .catalog-Dateien zur
Anpassung an die eigene Sprache, und andere Informationen. Neuerdings
wurde sogar ein eigener IRC-Channel eingerichtet, auf dem sich freilich
&uuml;ber das Spiel ausgetauscht werden kann und sich der Programmierer selbst
regelm&auml;ﬂig blicken l&auml;ﬂt.</P>

<P>F&uuml;r die <B>Zukunft</B> sind ein Zweispielermodus, eine Modem-Option und eine
komplette &Uuml;berarbeitung der Grafikroutinen geplant. Angesichts der
bisherigen Entwicklung des Projektes darf man gespannt sein, was da
noch kommt.</P>

<P>Auf dem aktuellen Stand ist Foundation das wohl technisch beste Spiel
seiner Art, leider k&ouml;nnte das Gameplay etwas spannender sein. Ein
Kompliment m&ouml;chte ich vor allem f&uuml;r die bei dieser Komplexit&auml;t recht
gut gelungene Bewahrung der &Uuml;bersichtlichkeit, und - fast h&auml;tte ich es
vergessen - f&uuml;r die sehr sch&ouml;ne musikalische Begleitung loswerden.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>Foundation</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.sadeness.demon.co.uk">Sadeness Softw.</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Wirtschafts-Simulation</TD>
    <TD><B>Version:</B></TD>
    <TD>1.2b</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>49DM zzgl. Versandk.</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>GTI</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>2</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>1</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>2</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=4><A HREF="http://www.sneech.demon.co.uk/FoundSupport.html">Foundation-Support</A></TD></TR>
</TABLE></P><BR>

Vertrieb: Grenville Trading International GmbH (GTI),<BR>
Carl-Zeiss-Str. 9,<BR>79761 Waldshut-Tiengen, <BR>Deutschland <br>
<A HREF="http://www.grentrade.com/homeami.htm">http://www.grentrade.com/homeami.htm</A><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812gb.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812olo.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


