<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - Olofight</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Olofight</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P>Dieses &quot;<B>Beat`Em`up</B>&quot; wird in einer ansehnlichen, hochwertigen Hochglanz-
Pappbox ausgeliefert, in der sich neben der gedruckten (!) Anleitung
mehrere kleine Poster, Aufkleber, die Registrierkarte, sowie nicht
zuletzt 10 DD-Disketten befinden. Kein Zweifel: Olofight`s <B>Verpackung</B>
und diesbez&uuml;gliche Pr&auml;sentation ist das Beste, was mir zu Testzeiten
bei einem Spiel auf den Tisch gekommen ist und braucht sich auch vor
manchem PC-Titel nicht zu verstecken! (Team Ologram hat jetzt auch eine
CD-Version, einen Grafikkarten-Patch und Aminet-Demos angek&uuml;ndigt.)</P>

<P>Von den Disketten wird das Spiel dann auch problemlos per <B>Installer</B>
auf die Festplatte kopiert, auf der es dann etwas mehr als 9 MByte
einnimmt. Beim Readme zum Installer f&auml;llt auf, daﬂ auf das Copyright
der Firma Escom hingewiesen wird. Das d&uuml;rfte nicht mehr ganz aktuell
sein.</P>

<P><B>Voraussetzung</B> f&uuml;r Olofight sind ein AGA-Amiga mit 0,7 (!) MByte ChipRAM
und 1.8 MByte FastRAM (lt. der offiziellen Angaben). Ein Patch f&uuml;r
Grafikkarten soll in K&uuml;rze erscheinen.</P>

<P><B>Programmiert</B> wurde Olofight von &quot;The Real Ologram&quot; in Italien. Die
<B>Anleitung</B> beschreibt das Spiel daher, neben Englisch und Deutsch, auch
auf Italienisch. Sie ist ebenso professionell gemacht, wie die Verpackung
und beschreibt ausf&uuml;hrlich Handhabung und Spielmodi.</P>

<P>Die <B>Hintergrundgeschichte</B> mutet wieder mal relativ unterbelichtet an,
weshalb man wohl besser ganz darauf verzichtet h&auml;tte, denn am Ende l&auml;uft
es halt doch nur darauf hinaus, daﬂ acht verschiedenartige Gesch&ouml;pfe
gegeneinander ihre Kampfsport-(respektive Mord-)techniken erproben.</P>

<P>Nachdem man das Spiel startet, erscheint erst einmal eine
<B>Handbuchabfrage</B> (sehr tr&auml;ge, also bitte nicht zu schnell tippen),
und das jedes Mal! Ziemlich nervig, da w&uuml;rde auch eine einmalige
Authentifizierung gen&uuml;gen. Auﬂerdem sind die Angaben oft unterschiedlich
zu interpretieren - werden Leerzeilen, sowie &Uuml;berschriften mitgez&auml;hlt?
Man kommt immer wieder zu erstaunlichen Ergebnissen und ist &uuml;berrascht,
wenn es denn mal geklappt hat, da bei einem Fehlversuch generell ein
Neustart des Spiels notwendig war.</P>

<P>Danach muﬂ man noch seinen Namen und die Registriernummer angeben, damit
man sp&auml;ter per eMail seine Zugangsberechtigung zum Highscore-System des
Webservers erhalten kann, die es erm&ouml;glicht, sich mit Spielern aus aller
Welt zu messen. Ob sich die Angabe wenigstens dann er&uuml;brigt, habe ich
nicht ausprobiert.</P>

<P>Erst dann geht es also los...</P>

<P>Der <B>Vorspann</B> zeigt bei guter Musik in kleine Bildausschnitten
mittelpr&auml;chtig gerenderte Sequenzen von den diversen K&auml;mpfern. Danach
erscheint das <B>Hauptmen&uuml;</B>, dessen inaktive Men&uuml;punkte sich in einem
(scheinbar absichtlich) verwaschenen Zeichensatz darstellen, der
trotz Gr&ouml;ﬂe sehr schwer zu lesen ist.</P>

<P>Hier kann man, neben dem Abspeichern von Spielst&auml;nden und dem Ansehen
von Spielst&auml;nden und der Credits, die Optionen einstellen, sowie die
Spielmodi ausw&auml;hlen. Dazu komme ich gleich.</P>

<P>Zuerst aber beginne ich mit den <B>Optionen</B>. Diese bieten die M&ouml;glichkeit
Autosave einzustellen, Sound auszuw&auml;hlen (Music, Ger&auml;usche oder Aus),
sowie das Schwierigkeitsniveau, die Detailstufen (Hoch und Niedrig),
eine begrenzte Zeit, sowie FAM einzustellen. FAM steht f&uuml;r Fighting
Adaptive Music bzw. f&uuml;r eine sich dem Spielgeschehen anpassende Musik.</P>

<P>Nun also zu den <B>Spielmodi</B> aus dem Hauptmen&uuml;:</P>

<P>Beim <B>Storymode</B> hat man die Aufgabe seinen K&auml;mpen hintereinander
gegen alle Feinde zum Sieg zu f&uuml;hren. Sollte man dies mit der
Schwierigkeitsstufe &quot;Hard&quot; oder &quot;Super&quot; schaffen, so kann man
einen neuen K&auml;mpfer aussuchen.</P>

<P>Im <B>Survival Mode</B> kann man endlos hintereinander die Computergegner
besiegen, solange es einem nur gelingt. Pro gewonnener Runde bekommt
man eine kleine Menge Energie als Bonus f&uuml;r die n&auml;chste.</P>

<P>Im <B>Time Attack Mode</B> l&auml;uft die Zeit unerbittlich ab, bei <B>Single Battle</B>
muﬂ man einen Einzelkampf bestehen und bei <B>vs Battle</B> kann man gegen
einen menschlichen Gegner k&auml;mpfen (auf dem Bildschirm! ;).</P>

<P>Das klingt ja alles schon mal recht interessant. Auch und gerade, wenn
man sich die &quot;<B>Featureliste</B>&quot; durchliest, die das Spiel bewirbt. Da wird
von 10 unterschiedlichen K&auml;mpfern gesprochen, von denen jeder &uuml;ber 400
Animationsbilder beinhaltet, 25 Bilder pro Sekunde schell sollen die
K&auml;mpfe sein, 10 Spezialbewegungen f&uuml;r jeden der K&auml;mpfer soll es geben,
sie sollen ihre F&auml;higkeiten im Laufe ihrer K&auml;mpfe verbessern, mehr als
3.000 Farben gleichzeitig sollen auf dem Bildschirm erscheinen, alles
w&auml;re 100prozentig gerendert, Schatten reflektierten sich w&auml;hrend der
Bewegungen auf den K&auml;mpfern usw. usf..</P>

<P>Nicht schlecht, aber was bleibt davon beim Spiel wirklich?</P>

<P>Bevor man loslegen kann, ist es, je nach eingestelltem Modus, m&ouml;glich
einen K&auml;mpfer auszuw&auml;hlen und die Spezialbewegungen, die man verwenden
will, zu definieren. Nat&uuml;rlich kann man nur eine begrenzte Anzahl von
ihnen verwenden. </P>

<P>Jetzt beginnt <B>der Kampf selbst</B>. Vor einem meist recht gut aussehenden,
bunten, wenn auch oft br&ouml;selig groben Hintergrund, vor dem ein paar
Objekte auch parallax gescrollt werden, stehen die beiden wackeren
Streiter. &Uuml;ber ihnen befinden sich zwei farbige Balken, die ihre
Lebensenergie anzeigen.</P>

<P><B>Doch was ist das?</B> Ich will jetzt (um beim Thema zu bleiben ;) lieber
keine Tiefschl&auml;ge unter die G&uuml;rtellinie austeilen, aber vorsichtig
ausgedr&uuml;ckt sind die K&auml;mpfer (wie auch schon bei ihrer Auswahl zu
bef&uuml;rchten) ausgesprochen h&auml;ﬂlich, seltsam aussehend, schlecht gemalt
(bzw. gerendert)! Noch dazu sind sie sehr grob gerastert und
marionettenhaft in den oft recht langsamen Bewegungsabl&auml;ufen. Als
positiven, wenn auch in dem Fall beinahe vernachl&auml;ssigbaren Punkt, kann
man lediglich anf&uuml;hren, daﬂ sie groﬂ sind. Von dem Gerenderten ist, wohl
wegen der Br&ouml;seligkeit, nicht viel &uuml;briggeblieben und das dies sowieso
nicht unbedingt eine Garantie f&uuml;r Qualit&auml;t ist, versteht sich von selbst.
Auch ihr Design an sich erscheint seltsam, aber das liegt vielleicht
wirklich nur an der k&uuml;nstlerischen Umsetzung.</P>

<P>Weiterhin ist es vom <B>Technischen</B> her gesehen nicht schlecht, wenn auch
nur durchschnittlich. Das Scrolling hakelt manchmal etwas und die 25
Bilder/Sekunde d&uuml;rfen bezweifelt werden. Der Sound ist okay, die Musik
sogar recht gut.</P>

<P>Im <B>Hintergrund</B> erscheinen gelegentlich und manchmal auch permanent
animierte Objekte, wie rotierende Monde, Sternschuppen, UFOs usw..</P>

<P>Der <B>Spielspaﬂ</B> geht nach diesen wirklich wichtigen Negativpunkten
nat&uuml;rlich in den Keller und da nutzen dann auch Schatten auf den Figuren
und auch nicht die Verbesserung ihrer F&auml;higkeiten, die Austauschbarkeit
der Spielst&auml;nde per Server und andere positive Ans&auml;tze und Aspekte nur
herzlich wenig.</P>

<P>Die Ambitionen und die M&uuml;he die in Olofight stecken, sind zu erkennen,
aber die Ausf&uuml;hrung des letztendlich Wichtigsten, des Spieles selbst,
kann man leider nicht als gelungen bezeichnen. Olofight kann keinem
seiner Vorg&auml;nger auf dem Amiga das Wasser reichen, auch nicht den
technisch und grafisch ebenfalls nicht umwerfenden Konsolen-
Konvertierungen, die es vor einiger Zeit gab. <B>Fazit</B>: Schade!</P>


<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Spiel:</B></TD>
    <TD>Olofight</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.ologram.com/">The Real Ologram</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Beat`Em`Up</TD>
    <TD><B>Version:</B></TD>
    <TD>-</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ca. 89.- DM</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</A></TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Festplattenspielbar?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Exit zur Workbench?</TH><TH COLSPAN="2">JA</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Grafik:</TH><TD ALIGN=CENTER>5</TD><TD ALIGN=CENTER ROWSPAN=6><IMG SRC="../images/note4.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">SoundFX:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Musik:</TH><TD ALIGN=CENTER>2</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielbarkeit:</TH><TD ALIGN=CENTER>3</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Spielspa&szlig;:</TH><TD ALIGN=CENTER>5</TD></TR>
<TR><TH COLSPAN=2 ALIGN="CENTER">Preis-/Leistung:</TH><TD ALIGN=CENTER>4</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TH COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TH><TH COLSPAN=2 ALIGN=CENTER>4</TH></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=4>Kontakt/Support: <A HREF="mailto:ologram@ologram.com">ologram@ologram.com</A></TD></TR>
</TABLE></P><BR>
<P>
Vertrieb:<BR>
Grenville Trading International GmbH (GTI),<BR>
Carl-Zeiss-Str. 9,<Br>
79761 Waldshut-Tiengen,<BR>
Deutschland<BR>
<A HREF="http://www.grentrade.com/homeami.htm">http://www.grentrade.com/homeami.htm</A>
</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812foun.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../hw/9812ill.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
