<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - AmigaWriter Upd.</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>AmigaWriter / Update 1.2</H1>von<BR><A HREF="mailto:A.Schlck@gmx.de">Andreas Schlick</A></DIV>

<P>Nachdem die <A HREF="9809aw.htm">Version 1.0</A> endlich auf dem Markt war, kamen einige Zeit
sp&auml;ter auch schon die ersten Updates raus. Das erste &quot;Update&quot; auf die
V1.02 war nur als Demo-Version zu haben. Erst erhebliche Zeit sp&auml;ter gab
es das Update dann auch f&uuml;r die Verkaufsexemplare, allerdings dann gleich
auf die <B>Version 1.10</B>. Groﬂartige Ver&auml;nderungen merkte ich erstmal nicht,
aber das kann auch daran gelegen haben, daﬂ das Update bei meiner Version
erst gar nicht funktionierte. Einige Tage sp&auml;ter gab es dann ein Update
f&uuml;r die ersten deutschen Auslieferungen von AmigaWriter, die zwar die
gleiche Versionsnummer hatten, aber Ver&auml;nderungen aufwiesen.</P>

<P>Nun zu den &Auml;nderungen:</P>

<UL>
<LI><P><B>bessere Druckqualit&auml;t</B></P>

  <P>Mag sein, da aber mein Nadeldrucker sowieso &auml;lterer Bauart ist, habe
  ich nicht viel gemerkt (mir fehlt leider momentan auch ein 4-Farben-
  Farbband).</P>

<LI><P><B>Fontersetzungstabelle</B></P>
  <P>Wird ein Dokument mit einem Font geladen, der nicht im System gefunden
  wird, kann in dieser Tabelle angegeben werden, durch welchen anderen
  Font er beim Anzeigen ersetzt werden soll.</P>
  <P>Sicherlich sehr praktisch, wenn man viele Dokumente ohne die
  entsprechenden Fonts hat. Ein Requester, der beim Laden erscheint
  und ggfs. dann per Dateirequester nach dem neuen Font fragt, h&auml;tte es
  sicherlich auch getan und w&auml;re komfortabler gewesen, da standardm&auml;ﬂig
  jeder nicht vorhandene Font durch CGTriumvirate ersetzt wird. Irgendwo
  w&uuml;rde mich das auch interessieren, ob ein Font nicht vorhanden ist,
  allerdings wird das ja stillschweigend &uuml;bergangen...</P>

<LI><P><B>Multi-Assign f&uuml;r Fontverzeichnisse</B></P>

  <P>Eine wirklich gute Idee, auch die anderen Verzeichnisse f&uuml;r &quot;Fonts:&quot; zu
  durchsuchen. Da ich jedoch alle Fonts zusammen habe, konnte ich nicht
  ausprobieren, ob's klappt.</P>

<LI><P><B>BubbleHelp-Kontrolle</B></P>
  <P>Ganz toll: Ich kann jetzt BubbleHelp aus- und anschalten. Es sind zwar
  noch nicht alle Buttons mit BubbleHelp ausgestattet, aber wen's st&ouml;rt...
  (na ja, mich st&ouml;rt die nicht gut funktionierende Silbentrennung mehr,
  aber die bleibt immer an. Und das Einstellen der Zeit f&uuml;r die
  BubbleHelp, wie bei MUI, w&auml;re mir auch lieber gewesen.)</P>

<LI><P><B>vollst&auml;ndige Lokalisierung</B></P>

  <P>AmigaWriter kann jetzt vollst&auml;ndig lokalisiert werden.</P>

<LI><P><B>verbesserte Anbindung an StormScreenManager</B></P><P>
  Wenigstens kann AmigaWriter auch die nicht ge&ouml;ffneten Screens des SSM
  erkennen und anw&auml;hlen. Zum Screen-Wechseln muﬂ er aber immer noch neu
  gestartet werden. Und SSM ist immer noch meiner Meinung nach total
  nutzlos.</P>

<LI><P><B>diverse Bugfixes und kleine Verbesserungen</B></P>
<P> Darunter f&auml;llt u.a. die neue Speicherverwaltung (soll jetzt bei
  Dokumenten mit mehr als 500 Seiten sehr stark bemerkbar sein, aber
  wer benutzt AW f&uuml;r sowas?!? :) .</P>
</UL>

<P>Wenn das Programm jetzt <B>stabiler</B> l&auml;uft, war es den doppelten Download des
Updatearchives wert, aber ansonsten hat es mich nicht von Hocker gehauen.</P>

<P>Aber die Zeit vergeht und es gibt auch schon das n&auml;chste Update (5 Tage
nachdem die aktuelle Demoversion drauﬂen war). <B>AmigaWriter V1.20</B> bringt
nun mal wirklich was Neues und zwar eine <B>Rechtschreibkorrektur</B>. Die
Rechtschreibkorrektur basiert auf dem UNIX-Programm ISpell, das auch
schon f&uuml;r GoldEDs Rechtschreibkorrektur verwendet wird (dort aber schon
seit Ewigkeit :).</P>

<P>Das Update kommt mit zwei W&ouml;rterb&uuml;chern: eins f&uuml;r Deutsch (~1MB) und eins
f&uuml;r Englisch (~700KB). Durch die Verwendung des ISpell-Codes sind eine
Vielzahl von Sprachbibliotheken theoretisch erh&auml;ltlich. Leider gibt die
Anleitung nur Auskunft, wohin die W&ouml;rterb&uuml;cher kopiert werden sollen.
Zum Ausprobieren kopierte ich dann die Bibliotheken von GoldEDs ISpell
(Deutsch/Englisch - jeweils ca. 3MB) zu AmigaWriter. Jedoch schien
AmigaWriter das stillschweigend zu ignorieren und die
Rechtschreibkorrektur funktionierte nicht.</P>

<P>Da &uuml;berhaupt keine Fehlermeldung kommt (wie z.B. 'zu wenig Speicher'
oder 'defekte Bibliothek'), habe ich den Fehler nicht weiter verfolgt.</P>

<P>Die Sprachauswahl erfolgt per Locale-Prefs. Meiner Meinung recht unsch&ouml;n,
es gibt als Alternative nat&uuml;rlich noch das Umbenennen der Bibliothek,
aber ich habe keine Lust jedes Mal die Bibliotheken umzubenennen und
AmigaWriter neuzustarten, bloﬂ weil ich einen andere Text lade. Die
Rechtschreibkorrektur l&auml;ﬂt sich leider auch nicht auf Dauerkorrektur
einstellen und muﬂ jedes Mal per Hand gestartet werden. Wird ein falsch
geschriebenes Wort gefunden, kann es nat&uuml;rlich ersetzt werden. Leider sind
die Vorschl&auml;ge unter einem PopUp-Button versteckt, so daﬂ man erst mal gar
nicht sieht, was als 'Korrektur' angeboten wird. Desweiteren gibt es zwar
die Funktion ein unbekanntes Wort zu &uuml;berspringen, jedoch merkt sich
AmigaWriter das nicht und meldet beim n&auml;chsten Mal das Wort gleich
wieder. Wenigstens l&auml;ﬂt sich hier ein Benutzerw&ouml;rterbuch einrichten.</P>

<P>W&auml;hrend der Rechtschreibkorrektur ist das Fenster mit dem Dokument
jedoch noch editierbar. Da aber AmigaWriter das zu ersetzene Wort an der
Markierung erkennt, muﬂ man aufpassen, daﬂ man nicht ausversehen mit der
Maus im Text klickt und damit pl&ouml;tzlich ein v&ouml;llig anderes Wort ersetzt
:-( . Auﬂerdem empfand ich die Rechtschreibkorrektur im Vergleich zu
GoldED als relativ langsam (und GoldED benutzte dazu noch das 3MB-
W&ouml;rterbuch). Hier l&auml;ﬂt sich also noch einiges verbessern.</P>

<P>Als weitere Neuerung gibt es <B>Dokumentvorlagen</B>, d.h. man kann ein Dokument
mit einem Text und Texteinstellungen als Vorlage abspeichern und wenn man
ein neues Dokument erstellt, werden die entsprechenden Einstellung
geladen. Durch das Anlegen von Unterverzeichnissen lassen sich die
Vorlagen auch leicht thematisch sortieren. Wenn man viele &auml;hnliche Briefe
schreibt, kann man so sich einiges an Arbeit sparen. Ein Ersatz f&uuml;r die
fehlende Serienbrief-Funktion ist es leider jedoch nicht.</P>

<P>Inzwichen kann man ich von H&P auch eine neue <B>AmigaGuide-Dokumentation</B>
requesten. Warum es allerdings so umst&auml;ndlich gemacht wird, daﬂ man erst
eine eMail zu H&amp;P mit seiner Adresse schicken muﬂ und dann erst ein paar
Tage sp&auml;ter ein Reply bekommt, weiﬂ nicht. So wertvoll kann die reine
Dokummentation ja nicht sein.</P>

<P>Durch die Rechtschreibkontrolle gewinnt AmigaWriter an Punkten. Es sind
noch viele Funktionen nicht ausgereift und AmigaWriter wird noch einige
Zeit ben&ouml;tigen, um wirklich gut zu werden, aber es hat doch bereits sehr
gute Ans&auml;tze. Da aber auch die Rechtschreibkorrektur nicht perfekt ist
(soweit das f&uuml;r eine Rechtschreibkorrektur &uuml;berhaupt m&ouml;glich ist),
m&ouml;chte ich AmigaWriter noch keine 3 als Gesamtnote geben.</P>

<P>[Die Wertung &auml;ndert sich folglich nicht gegen&uuml;ber der <A HREF="9809aw.htm">Version 1.0</A>, die
 im AmZeiger #6 getestet wurde, d.Chefred.]</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812ged.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812linx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


