<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - GunBee F99</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>GunBee F99</U></H1><P ALIGN="CENTER">von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></P>

<P><B>Von diesem Spiel (knapp 50,- DM, APC&amp;TCP) war eigentlich ein Volltest
geplant.</B> Allerdings machten ihn zahlreiche unerkl&auml;rliche Abst&uuml;rze
unm&ouml;glich, die wahrscheinlich den Datentr&auml;gern anzulasten sind,
denn zum Schluﬂ lieﬂ sich das Spiel sogar &uuml;berhaupt nicht mehr starten.
Nachfolgend daher ein Kurztest ohne Testurteil der sich auf das bezieht,
was ich gesehen habe,  womit das eigentliche Spiel eingeschlossen ist.</P>

<P>GunBee F99 wird zwar in einem <B>CD-Geh&auml;use</B> ausgeliefert. In diesem
verbergen sich allerdings zwei <B>DD-Disketten</B>. Das Titelbild (ein
vergr&ouml;ﬂerter Screenshot) ist durch die zwangsl&auml;ufige Br&ouml;seligkeit erst
einmal abschreckend. Auf der Innenseite verbirgt sich Werbung f&uuml;r die
anderen APC&amp;TCP-Spiele <A HREF="9803mb.htm">MegaBlast</A>, <A HREF="9712pbbd.htm">Pinball Brain Damage</A>, <A HREF="9712fh.htm">Flyin' High</A>
(s. die jeweiligen Tests im AmZeiger) sowie f&uuml;r den kommenden Shooter
Pulsator.</P>

<P><B>Voraussetzung</B> f&uuml;r das Spiel (entwickelt &uuml;brigens in Peru) ist ein AGA-
Amiga mit Festplatte und 4 MByte FastRAM. Die <B>Installation</B> von den
Disketten verl&auml;uft dank des Commodore-Installers glatt, ein simples
Kopieren gen&uuml;gt allerdings ebenfalls. Ca. 1,9 MByte sind danach auf
der HD belegt.</P>

<P>Als kleine <B>Beigabe</B> findet sich ein Tool, das mehrere F99-Spielst&auml;nde
zu einem umformen kann, in dem sie gemischt werden. Dem Wettstreit mit
Freunden, so sie auch F99 geordert haben, steht also nichts im Wege
(auﬂer einer Zwei-Spieler-Option ;). Auﬂerdem findet man als Anleitung
einen englischen und deutschen AmigaGuide im Spielverzeichnis.</P>

<P>Doch zum Spiel selbst: Gerade im <B>Vorspann</B>, der von der Entf&uuml;hrung einer
holden Maid und dem Diebstahl ihrer f&uuml;nf magischen Kristalle durch einen
b&ouml;sen Wicht erz&auml;hlt, sowie von dem Helden im Bienenkampfanzug, der
ausfliegt, sie zu befreien, kann GunBee sein Vorbild, das legend&auml;re
`Apidya` nicht verleugnen. Japanischer Comic-Stil also hier, der recht
stimmig ist und nur von der C64-artigen Musik getr&uuml;bt wird (dabei:
nichts gegen den C64 :). Auﬂerdem sieht der Held genauso aus wie die
Lady Akiko selbst (die sich &uuml;brigens ihren Namen mit dem Spezialchip
aus dem Amiga-CD32 teilt).</P>

<P>Auch sind sich CD-R&uuml;ckseite, Anleitung und Vorspann auch &uuml;ber die Biene
nicht ganz einig: Die H&uuml;lle meint, es handele sich um eine kleine
Kampfbiene, der Guide spricht von einem Kampfanzug und bei der Intro
muﬂ man eher auf ein Flugzeug schlieﬂen. Aber wie dem auch sei...
schlieﬂlich soll (bzw. muﬂ) dies ja ein Kurztest werden. :)</P>

<P>Trotzdem verzichte ich nicht auf die Auflistung der einzelnen
<B>Einstellm&ouml;glichkeiten</B>, namentlich kann man auf dem, nach dem Vorspann
folgenden Screen, einen PAL- oder NTSC-Schirm einstellen, Joystick
(2-Buttons werden unterst&uuml;tzt) oder Keyboard ausw&auml;hlen, sowie die
Sprache (Englisch, Deutsch, Spanisch).</P>

<P>Danach folgt ein Bildschirm mit dem eigentlichen Men&uuml;, in dem man noch
den Modus (Story, mit erh&ouml;hter Schwierigkeit oder Honey, eine Art Arcade-
Modus), sowie neben Musik An/Aus den Level f&uuml;r den Honey-Mode einstellen
kann.</P>

<P><B>Nun beginnt es also:</B> Nach dem zwar nicht umwerfenden, aber auch nicht
abschreckenden Beginn, folgt doch eine ziemliche Entt&auml;uschung. Leider
kann hier Gunbee keinerlei Vorbild in diesem Spielesektor wirklich
nahekommen. Ein seltsames Gef&auml;hrt am unteren Bildschirmrand schieﬂt
auf alles, was sich an ulkigen Sprites von oben nach unten bewegt,
w&auml;hrend der Schirm ebenfalls vertikal scrollt.</P>

<P>Teilweise kann auf feindliche Objekte auf dem &quot;Boden&quot; auch eine Bombe
geworfen werden, Bonus-Items zum Verbessern der F&auml;higkeiten gibt es
und Endgegner.</P>

<P>Doch leider hat das CD-Cover schon richtig angedroht: Die Grafik ist
br&ouml;selig, scrollt langsam aber relativ ruckfrei, sie ist nicht besonders
sch&ouml;n gezeichnet, oft ziemlich primitiv, wenngleich noch am Rande der
Durchschnittlichkeit. Der Sound geht in Richtung fr&uuml;her Amiga-Musik, was
nicht unbedingt schlecht sein muﬂ.</P>

<P>Wirkliches <B>Spielfieber</B> kommt da nicht auf. Leider kann ich aus diesem
Grunde auch keine direkte Kaufempfehlung geben. Der Hardcore-Shooterfan
sollte es mal antesten, ansonsten heiﬂt es weiterhin auf neue Spiele aus
diesem Bereich zu warten, die Hoffnungen sch&uuml;ren oder in Budget-Kisten
nach guten alten, etablierten Genre-Titeln zu kramen.</P>
<P>
Kontakt/Vertrieb:<BR>
APC&TCP, Postfach 59, 83236 &Uuml;bersee<BR>
<A HREF="http://www.chiemgau.com/apc&tcp/">http://www.chiemgau.com/apc&amp;tcp/</A>
</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812do.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812foun.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
