<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/98 - GoldED5</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>GoldED 5</H1>von<BR><A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A></DIV>

<P>Nun ist die f&uuml;nfte Version des <B>legend&auml;ren</B> Texteditors erh&auml;ltlich. Nach
Version 4 fragt man sich aber, was noch grundlegend besser werden kann.
GoldED5 &uuml;berrascht vor allem durch eine neue Auslieferungsmethode und
zwar wird das komplette Paket auf CD-ROM ausgeliefert, was sich bei ca.
30MB Daten auch anbietet.</P>

<P>Die <B>Mindestanforderungen</B> stiegen auf 68020+, OS 3 und CD-ROM-Laufwerk.
Leider stieg der Preis auch mit und zwar schl&auml;gt der Neukauf mit 89.90DM
+ 10DM f&uuml;r Porto & Verpackung zu Buche und das Update von V4 auf V5
kostet 49.90DM + 10DM. Nervig fand ich dabei, daﬂ ich als registrierter
User und Direkt-Besteller vom Autor die Registrierkarte nochmals extra
hinschicken muﬂte, d.h. einmal den Brief mit Scheck und Updatebestellung
raus, dann von Dietmar Eilert das P&auml;ckchen mit der CD und nun nochmal
die Registrierkarte (oder besser der Brief) zur&uuml;ck. Die Post freut sich
unn&ouml;tig.</P>

<P>GoldED ist ein sehr guter Texteditor, der sich in fast allen Funktionen
konfigurieren l&auml;ﬂt. Leider l&auml;ﬂt sich &uuml;ber das GUI streiten. Auf diesen
Punkt gehe ich jedoch unten nochmal getrennt ein.</P>

<P><B>Installation:</B></P>

<P>Anstelle eines Installer-Icons findet sich ein Icon &quot;Setup&quot; an. Das erste
Anzeichen einer Win****-Manie des Autors. Im Hauptfenster der CD befindet
sich auch gleich die Anleitung (dt./eng.), die jedoch &uuml;berraschenderweise
zur Version 4 geh&ouml;rt (warum auch immer). Die aktuelle Anleitung wird erst
bei der Installation installiert. Wird das Setup-Programm gestartet, &ouml;ffnet
sich ein Screen mit einem bekannten blauen Farbverlauf. Als n&auml;chstes gab es
zwei Fehlermeldungen, wegen nicht korrekter Bilder. Dieses Problem trat
auch bei einer frisch installierten WB3.1 auf und lieﬂ sich von mir nicht
beheben.</P>

<P>Das mitgelieferte <B>FAQ</B> sagt dazu, daﬂ die Fehlermeldungen nicht weiter
schlimm seien und man einfach mit der Installation fortfahren k&ouml;nne.
Alternativ kann beim Starten des Setup Programms auch die Shift-Taste
gedr&uuml;ckt gehalten werden, wodurch der Screen und das Laden der Bilder
unterbunden werden kann.</P>

<P>Das probierte ich dann aus und jetzt lief alles ohne Fehlermeldung ab.
Gl&uuml;cklicherweise geht es danach trotzdem mit dem Commo-Installer weiter
und es kommt kein v&ouml;llig selbst geschriebenes Installationsprogramm zum
tragen. Warum aber extra ein Programm geschrieben wurde, daﬂ die Win-
Installation nachmacht, verstehe ich nicht (dabei l&auml;uft es nicht mal
immer sauber). Die weitere Installation lief problemlos ab. Man wird
nach verschieden Gr&ouml;ﬂen des zu installierenden Pakets gefragt, bzw. man
kann jedes einzelne Modul zum Installieren getrennt ausw&auml;hlen, was bei
einer gesamt Gr&ouml;ﬂe von ca. 20-30MB auch ratsam ist. :-)</P>

<P>Hat man die Entwickler &quot;Add-Ons&quot; f&uuml;r z.B. SAS/C installiert, wird beim
erstmaligen Starten von GoldED eine Reference-Datei der Includes angelegt.
Auf die Add-Ons gehe ich sp&auml;ter noch ein. Jedenfalls kam es bei der
Erstellung dieser Datei h&auml;ufig zu Abst&uuml;rzen und damit zu &quot;not validated&quot;
Partitionen und auch vor zwei richtigen Festplattenfehlern blieb ich
nicht verschont. Erst bei der Benutzung einer frisch installierten WB
lief alles ohne Probleme. Auch die weitere Verwendung der so erstellten
Dateien brachten keine weiteren Probleme mit sich.</P>

<P>Insgesamt hat die Installation keinen guten Eindruck hinterlassen. Aber
vielleicht lag es ja auch an meinem verkorksten System (ich hatte es aber
auch ohne MCP versucht! :).</P>

<P><B>Grundkonzept</B></P>

<P>Das Grundkonzept entspricht noch dem von GoldED 4. Von den Men&uuml;s
angefangen, bis zur Tastatur, l&auml;ﬂt sich (fast) alles einstellen (bis auf
das GUI :-( Wieder gibt es verschiedene Umgebungseinstellungen, die
abh&auml;ngig von der Endung des Dateinamens geladen werden, bzw. durch Setzen
einer bestimmten GoldED-Variable ge&auml;ndert werden k&ouml;nnen. Dadurch lassen
sich den verschiedenen Dateien v&ouml;llig andere Einstellungen zuordnen (bzw.
umgekehrt), so k&ouml;nnen C-Dateien gleich ein Men&uuml; zur Steuerung des
Compilers bekommen und bei einer MicroDot-eMail werden die Quotes
automatisch verschiedenfarbig eingef&auml;rbt.</P>

<P>Interessant ist, daﬂ GoldED kein Standardverhalten hat. Es l&auml;ﬂt sich auch
einstellen, was passiert, wenn die 'a'-Taste gedr&uuml;ckt wird. Das reicht
vom Speichern der Datei, &uuml;ber das Ausf&uuml;hren eines ARexx-Scriptes, bis zum
simplen Einf&uuml;gen des Buchstabens &quot;a&quot; in den Text. Diese Vielzahl von
Konfigurationsm&ouml;glichkeiten verwirrt am Anfang sehr leicht und man muﬂ
auch sp&auml;ter noch manchmal sehr gut nachdenken, wo sich die eine oder
andere Funktion befindet. Hat man sich jedoch mal mit der Konfiguration
zurecht gefunden, will man sie nicht mehr missen.</P>

<P><B>&quot;Add-Ons&quot;</B></P>

<P>Die fr&uuml;her als &quot;envxxx&quot;-Archive erh&auml;ltlichen Enviroment-Settings sind nun
zu &quot;Add-Ons&quot; mutiert. Auf der CD befinden sich folgende Add-Ons: </P>

<P>Joyce (Rechtschreibkontrolle mit ISpell), SAS/C, StormC, MicroDot,
AmigaGuide, RCS, STFax, WebWorld, Assembler, C++, Script, PCL Drucker,
Roget's Thesaurus und Thor.</P>

<P>Die Add-Ons werden aus der Hauptinstallation heraus installiert, lassen
sich jedoch auch noch nachtr&auml;glich installieren.</P>

<P>Die Rechtschreibkontrolle ISpell wird mit verschieden groﬂen Bibliotheken
f&uuml;r Deutsch und Englisch mitgeliefert, die Gr&ouml;ﬂen gehen bis zu 3MB. Auf
eine kleine Eigenheit sei noch hingewiesen: Kann die Bibliothek aufgrund
ihrer Gr&ouml;ﬂe oder eines langsamen Mediums/Rechner nicht schnell genug
geladen werden, meldet GoldED eine Fehler beim Laden von ISpell.</P>

<P>Manchmal hilft ein kurz darauf folgendes zweite Starten der
Rechtschreibkontrolle. Ansonsten sollte eine kleinere Bibliothek
installiert und/oder sie auf eine schnellere HD kopiert werden (bei mir
half z.B. die Umstellung auf das SmartFileSystem). Die anderen Add-Ons
bieten vorkonfigurierte Men&uuml;s etc., damit die entsprechen Programme
direkt von GoldED aus gestartet/gesteuert werden k&ouml;nnen. Desweiteren
werden meistens die Schl&uuml;sselbegriffe farblich hervor gehoben, woran
man dann auch schnell erkennt, ob man sich verschrieben hat (als
Beispiel).</P>

<P><B>Das GUI</B></P>

<P>Wichtig ist bei Version 5 zu erw&auml;hnen, daﬂ sich das GUI ge&auml;ndert hat.
Leider kam der Autor nicht auf die Idee, ein bereits bestehendes GUI-
Konzept, wie z.B. MUI oder ClassAct, zu verwenden, was sehr zu bedauern
ist.</P>

<P>Der Autor scheint sehr in ein bekanntest und (leider) verbreites
Betriebssystem vernarrt zu sein. So verzichet er auf viele Amiga-Termina.
So wird zum Beispiel aus den Prefs die Registry, aus dem Installer ein
Setup, aus der CTRL-Taste eine String-Taste etc. etc.. Dadurch geht
eigentlich schon genug Amiga-Feeling verloren, jedoch muﬂte auch noch
das GUI nachgeahmt werden? Insbesondere die neuen S/W-Checkmarks sehen
meiner Meinung nach nicht sehr sch&ouml;n aus. Aber auch die Stringfelder
und Scrollbalken muﬂten dran glauben.</P>
<P>
Leider wurde nicht nur das &Auml;uﬂere ver&auml;ndert, sondern auch auf
Standardverhalten, wie es im Amiga User Interface Style Guide beschrieben
ist, verzichtet. So l&auml;ﬂt sich z.B. das Stringfeld nicht mehr mit Amiga+x
l&ouml;schen. Aus der Anleitung geht hervor, daﬂ dazu die STRG-Taste (STRG+x)
verwendet wird, wobei STRG der CTRL-Taste entspricht. Schon von den
&auml;sthetischen Aspekten abgesehen, spricht auch sonst nichts f&uuml;r so ein
GUI-System, da es sich nicht konfigurieren l&auml;ﬂt, nicht &ouml;ffentlich
zug&auml;nglich f&uuml;r andere Programmierer ist (zum Gl&uuml;ck auch :), einfach
unn&ouml;tig Entwicklungszeit verschlingt und nur eine neue Quelle f&uuml;r Bugs
ist.</P>

<P>Das GUI System bietet ja nicht einmal gr&ouml;ﬂenver&auml;nderbare Fenster. Dies
macht sich sehr stark bemerkbar, wenn man viel mit der Prefs (oder muﬂ
ich Registry sagen?) arbeitet. Es lassen sich ja einfache Scripte schon
innerhalb von GoldEDs Konfiguration erledigen, was h&auml;ufig bei GoldED 4
passierte. Das sich jedoch in dem kleinem Prefs-Fenster schwer arbeitet
l&auml;ﬂt, empfand wohl auch der Programmierer und packte die meisten dieser
Funktionen jetzt in eigene ARexx-Scripte. </P>

<P>Durch h&auml;ufige Benutzung von Listtrees wird meist nur ein kleiner Teil
der anzuzeigenden Information dargestellt und hier nutzt auch die tollste
Grafikkarte nichts, wenn das Fenster sich nicht vergr&ouml;ﬂern l&auml;ﬂt. Vor allem
geht auch die &Uuml;bersicht sehr leicht verloren. Das das GUI weiterhin nicht
ausgereift ist, merkt man, wenn man einen neuen Font einstellt. Da das
Fenster ja auch auf keinem Fall etwas gr&ouml;ﬂer werden &quot;darf&quot;, gehen die
Beschriftungen manchmal &uuml;ber den Rand des Fensters hinaus und verloren.
;-( </P>

<P>All die Punkte h&auml;tten sehr leicht vermieden werden k&ouml;nnen, wenn z.B. MUI
benutzt worden w&auml;re. Dort sind die meisten Bugs inzwischen bekannt und
wirken sich meist auch (f&uuml;r den Anwender) nicht so schwerwiegend aus. Um
trotzdem den Look zu behalten, h&auml;tten ja nur ein paar entsprechende Images
gemalt werden m&uuml;ssen. Einzigster Trost ist, daﬂ das GUI haupts&auml;chlich bei
den Prefs Verwendung findet und w&auml;hrend der allgemeinen Benutzung nicht
st&ouml;rt. </P>

<P><B>Update</B></P>

<P>Eine der vielleicht wichtigsten Neuerungen ist die echte Unterst&uuml;tzung
von Tabulatoren. Damit lassen sich nun endlich auch leicht Makefiles und
&auml;hnliches erstellen. Die weiteren Neuerungen betreffen haupts&auml;chlich die
Prefs-Einstellungen.</P>

<P>Desweiteren haben die meisten Fenster jetzt ein Fragezeichen-Gadget mit
einer Art Bubble-Help, die, wenn sie aufgerufen wird, eine kurze Erkl&auml;rung
zum dem Gadget abgibt. Auﬂer kleineren Features und Bugfixes l&auml;ﬂt sich
nicht viel mehr zum Update sagen. Wer GoldED 4 kennt, weiﬂ schon recht
gut wie GoldED 5 funktioniert.</P>

<P><B>Fazit:</B></P>

<P>Ein allgemeines Fazit zu finden, f&auml;llt mir schwer. GoldED 3 und 4 sind
kostenlos erh&auml;ltlich, was den Druck des Preis-/Leistungsverh&auml;ltnisses
auf GoldED 5 erheblich verst&auml;rkt. Durch den erh&ouml;hten Preis lohnt sich die
Anschaffung von GoldED 5 f&uuml;r den durchschnittlichen Anwender kaum - f&uuml;r
den, der wom&ouml;glich bloﬂ hin- und wieder mal die User-Startup editieren
will, ist der Funktionsumfang sicherlich viel zu groﬂ.</P>

<P>Auf jeden Fall sollte man sich GoldED vorher anschauen, vor allem da die
kostenlosen Vorg&auml;ngerversionen sehr gut sind. Wer Programmierer ist oder
auch ansonsten h&auml;ufig einen Texteditor ben&ouml;tigt, sollte sich sehr genau
&uuml;berlegen, ob er sich die Version 5 nicht doch holt. Auch wer GoldED mag
und die Weiterentwicklung f&ouml;rdern will, sollte sich wohl trotzdem die
Version 5 kaufen, da sie es von den Leistungen her allemal wert ist.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>GoldED 5 Studio</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://members.tripod.com/golded/">Dietmar Eilert</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Texteditor</TD>
    <TD><B>Version:</B></TD>
    <TD>5</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>89.90DM/Upd.:49.90</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Programmautor</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>3&#185;</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>3</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>

Erkl&auml;rung:<BR>
&#185; - Prefs-/Registry-GUI f&uuml;hrte zur Abwertung.<BR><BR>

Adresse : Dietmar Eilert, Mies-v-d-Rohe-Str. 31, 52074 Aachen<BR>
eMail   : <A HREF="mailto:dietmar@tomate.tng.oche.de">dietmar@tomate.tng.oche.de</A><BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9812wf7.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1298/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9812aw.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


