<HTML>
<HEAD>
<TITLE>REFLECTOR 045</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
Leserbriefe</H1></CENTER>
<HR SIZE=5><P>

Dem<B> REFLECTOR-Team</B> liegt viel an Eurer Meinung zu unserem Magazin, zu<B> REFLECTIONS</B> und jeden
anderen Thema. In der Abteilung Leserbriefe kann der Leser des<B> REFLECTOR</B>-Magazins sein
Statement zur Diskussion stellen.<P>

<B>Bevor es nun losgeht, etwas in eigener Sache: Wir bitten Euch uns Eure Zusendungen bzw.
Leserbriefe als ASCII - Text auf Disk zukommen zu lassen. Es ist eine &auml;u&szlig;erst undankbare
Aufgabe, seitenlange Briefe abzutippen. Hinzu kommt, da&szlig; diese meistens sowieso auf einem
Rechner geschrieben und anschlie&szlig;end ausgedruckt wurden. In Zukunft werden wir Leserbriefe,
die nicht  als ASCII-File vorliegen zwar zur Kenntnis nehmen, aber nicht ver&ouml;ffentlichen.</B><P>
<HR><P>
<TABLE width=100%><TR><TD bgcolor=#FFFFCC>
<A NAME="D. Siebert"></A>
<B>D. Siebert</B> macht heute den Anfang:<P>
Hallo Reflector !<P>

Erstmal Gl&uuml;ckwunsch das ihr den Club noch retten konntet. Ohne ihn w&auml;r das monzoomen nur halb so sch&ouml;n.

Bin ja zur Zeit bei der Bundeswehr, aber mir geht es da viel zu GUT, aber das Ende naht schon. 
Hab meinen Compi mitgenommen und mache erstmal einen ausf&uuml;hrlichen monzoom Test und verbrate 
nebenbei Eure Steuergelder, aber nur f&uuml;r Strom, Internet is nich . Apropo monzoom; ich pers&ouml;nlich 
finde diesen Namen absolut genial, da k&ouml;nnen andere meckern wie sie wollen.
Viele Neuigkeiten sind dabei: endlich gibt es Volumenlicht, womit man tolle Effekte zaubern kann. 
Damit hab ich mich auch ein bischen auseinandergesetzt. Kann man ja auf meinen Bildern begutachten 
(ist auch mal was irdisches bei). 
Aber nat&uuml;rlich hab ich auch schon wieder ein paar Ideen f&uuml;r die n&auml;chste Version.<P>
<PRE><B>
- Textur wird flach an die Kamera vergeben. Warum kann man die Textur durch transparente Materialien 
  nicht sehen ? Hab bald keine Lust mehr Schachbretter im Hintergrund zu platzieren.
- Lichtquellen: Warum so viele Arten im Men&uuml; ? Man k&ouml;nnte doch viel besser die Lichtart im Parameterfenster 
  einstellen. So kann man auch nachtr&auml;glich eine Eigenschaft &auml;ndern (lokal in global um&auml;ndern).
- Eine Aufsetzfunktion (Bryce). Stell ich mir so vor: Objekt ist selektiert. Multi Operation mit 
  gew&uuml;nschtem Objekt. Men&uuml; wird ge&ouml;ffnet in der man w&auml;hlen kann in welcher Achse dies geschehen soll. 
  Bei Bryce funktioniert das ganz einfach: bei dem selektierten Objekt auf den Pfeil der nach unten 
  zeigt klicken und das Objekt wird automatisch auf das darunterliegende Objekt aufgesetzt.
- Bei der n&auml;chsten Version w&uuml;nsche ich mir eine anst&auml;ndige Verpackung (wie Ref 4.0, Ringbuch im Schuber). 
  Die monzoom Packung hat zwar ein tolles Design, aber wie soll man denn in das Handbuch die Zus&auml;tze f&uuml;r 
  sp&auml;tere Versionen einheften.<P>
</PRE></B>

Jetzt mu&szlig; ich erstmal ordentlich l&auml;stern ( aber nicht &uuml;ber euch, keine Angst)<P>

Da ist mir doch glatt so ein Anf&auml;ngerblatt aus dem Axel Springer Verlag in die H&auml;nde gefallen. 
Also von dem Verlag h&auml;tte ich doch echt mehr erwartet. Naja Bild bleibt Bild, ob da nu Sport, Auto 
oder Computer davorsteht ist wohl doch egal.Also in der CompiBild 20/98 war ein Test &uuml;ber Raytracer bis 400 DM drin. Das war so ziemlich der 
l&auml;cherlichste Test den ich jemals gelesen hab. Und dadurch best&auml;tigt sich bei mir wieder da&szlig; in der 
Redaktion scheinbar nur Vorsch&uuml;ler sitzen die ab und zu mal an Papis Computer spielen d&uuml;rfen. Die Programme 
werden dort z.B. als Trickfilmprogramme bezeichnet. In die Wertung werden dann auch noch total unwichtige 
Dinge einbezogen. Z.B. ob es bei der Installation Probleme gibt. Ich dachte schon ich spinne als ich das 
gelesen hatte, so bl&ouml;d kann doch ein User nicht sein das er kein Programm installieren kann. Wenn doch sollte 
er doch mal &uuml;berlegen ob er denn solche doch nicht ganz einfach zu bedienenden Programme &uuml;berhaupt bew&auml;ltigen 
kann. Sowas ist nur etwas f&uuml;r Profis, stimmt`s?
Platzbedarf auf der Festplatte (weniger wurde besser bewertet): Wer etwas Ahnung hat wei&szlig; da&szlig; man mit 100 MB 
freien Speicher einfach nicht auskommt. Wenn man einige Animationen berechnet hat, kommt man doch auf ein 
vielfaches. Wer sich mit Raytracing besch&auml;ftigen will sollte nicht mit Gigabytes geitzen. Am besten ist es 
sowieso den ganzen Rechner nur f&uuml;r eine bestimmte Sache zu benutzen ( monzoom eben ) und nicht noch Spiele 
f&uuml;r die G&ouml;ren darauf zu spielen.
Am wenigsten kann ich dann noch verstehen das das Programm Cinema 4D GO gewinnt, obwohl es ein Riesiges und 
nicht zu untersch&auml;tzendes Manko mit der H&ouml;chstaufl&ouml;sung ( 768 x 576 Pixel) hat. Naja, monzoom hat es wenigstens 
auf den 4. Platz geschafft. 
Aber ich kann euch tr&ouml;sten, in der 3D Life hat monzoom doch etwas besser abgeschnitten und noch ein Lob f&uuml;r das 
aussergew&ouml;hnliche Partikelsystem in dieser Preisklasse bekommen.<P>

Von all dem mal abgesehen gleicht der Informationsgehalt der CompiBild einer Waschmittelpackung. Ich will ja keine 
Arbeitspl&auml;tze gef&auml;hrden, aber mit so einer Zeitung kann man sich nur den A.... abwischen. Diese Zeitung ist 
eigentlich nur was f&uuml;r Idioten und solche die es werden wollen.  Was man da alles Lesen kann ist verr&uuml;ckt. 
Z.B. Haben die mal einen Workshop gemacht, wo man mit Corel Draw sich ein Euro Zeichen selber bauen kann. Und den 
Hammer findet man immer am Seitenrand: dort werden dann Hochkomplizierte, englische Worte eingedeutscht. Damit 
man auch  immer " App tuh D&auml;it" ist. 
Und damit ich auch keinen &Auml;rger bekomme, wenn jemand sich auf den Schlips getreten f&uuml;hlt, will ich nur erinnern 
das es in Deutschland ja das Recht auf freie Meinungs&auml;u&szlig;erung gibt.
Ich bleib lieber bei digital production und 3D Life, die wissen wenigstens was sie schreiben.<P>

Beim Reflector beobachte ich schon seit geraumer Zeit da&szlig; die Bildqualit&auml;t bei einigen Bildern doch stark zu w&uuml;nschen 
&uuml;brig l&auml;&szlig;t. Die Bilder wirken immer so verwaschen. Was ist da los ? O.K. beim JPG Format m&uuml;ssen Abstriche gemacht 
werden, aber so doll ?. Auf der monzoom Programm CD kann man doch sehen das es Funktioniert. Ich mache es immer so: 
das Bild wird berechnet und im TIF Format gespeichert. Eventuelle Nachbearbeitungen und Texte k&ouml;nnen jetzt eingef&uuml;gt 
werden. Erst wenn sicher ist das dieses Bild an den Reflector geschickt wird, wird es in JPG umgewandelt. Auf keinen 
Fall sollte man den Fehler machen, und nur im JPG Format zu arbeiten. Dann sinkt die Qualit&auml;t n&auml;mlich mit jeden 
abspeichern. Auf meiner Festplatte befindet sich kein einziges JPG Bild, weil bei mir Qualit&auml;t eine gr&ouml;&szlig;ere Rolle 
spielt als der verbrauchte Speicherplatz. Wie macht ihr das in der Redaktion wenn ihr Bilder auf Diskette bekommt ?Ihr ladet die Bilder mit einem Malprogramm von der Diskette ein, und speichert es auf der Reflector Diskette ? 
Vielleicht wird das Bild auch noch auf der Festplatte "zwischengeparkt" ? Das ist die schlechte Methode.
Die gute Methode ist, das Bild einem Dateimanager (Explorer) auf den neuen Datentr&auml;ger zu kopieren, weil dort keine 
verluste auftreten.Nat&uuml;rlich kann es sein da&szlig; ihr aus Platzgr&uuml;nden das Bild noch st&auml;rker komprimieren m&uuml;&szlig;t. Dann w&auml;re es doch besser 
wenn ihr die Bilder in einem verlustfreiem Format bekommt, und ihr sie denn nach bedarf umwandelt. Wenn man die 
Bilder zip`t, passen auch mehrere auf eine Diskette. Ich w&uuml;rde euch lieber TIF Bilder schicken. Eure Meinung w&uuml;rde 
mich da mal interessieren. <P>

Was mu&szlig;te ich im Reflector 43 lesen ? Es gibt Rabatt f&uuml;r Klubmitglieder auf Ref / monzoom Updates ?Bin ja schon &uuml;ber ein Jahr Mitglied, habe aber bis jetzt immer mehr bezahlt.<P>

Bis zum n&auml;chsten Mal<P>
<PRE></B>
Dennis Siebert
Rieckweg 3b
21502 Geesthacht
Tel: 04152/73415
Email: Dsie550376@aol.com

<P></B>

</TR><TR><TD BGCOLOR=#CCFFFF>
Dr. Reflectus: Klar bekommen Clubmitglieder bei Oberland Rabatt, das ist aber schon l&auml;nger
so. Warum zum Teufel wird den Texten in <B>Reflector</B> so wenig Beachtung geschenkt. Wer
dann mehr bezahlt ist selber schuld. Zu den JPEG Bildern. Wir bem&uuml;hen uns immer die beste
Qualit&auml;t hin zu bekommen. Aber manchmal kommen die Bilder bei uns nun mal so an und da 
k&ouml;nnen wir dann auch nichts mehr retten. Die Verbesserungen werden hoffentlich von uns
Oberland gelesen. Oberland hat immer ein offenes Ohr f&uuml;r so etwas.<P>
</TR></TD></TABLE>
<P>



Damit w&auml;ren wir am Ende der Leserbriefe angelangt. Nat&uuml;rlich harren wir
der weiteren Post, die da auf uns zukommen wird. Also ran an die Tasten
und her mit Euren Statements.<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
