<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
8. AMIGA-Pr&auml;sident Jim Collas wendet sich erneut an die Gemeinde

»Liebe Amiga-Freunde,

ich habe viele der Kommentare der Amiga-Gemeinde &uuml;ber unsere
Linux-Entscheidung gelesen. Mein Schl&uuml;sseleindruck &uuml;ber die Reaktionen,
die ich erhielt, ist der, dass einige Leute unsere Pl&auml;ne f&uuml;r den Amiga der
n&auml;chsten Generation nicht richtig verstanden haben. Die Schuld daran trage
ich und wir arbeiten daran, das Missverst&auml;ndnis in unserem n&auml;chsten
Technologie-Papier aufzukl&auml;ren.
BITTE, BITTE, BITTE urteilen Sie nicht &uuml;ber die Linux-Entscheidung, bis Sie
dieses Papier lesen konnten! Das grundlegende OS ist nur eine Komponente
unserer Betriebs-Umgebung (operating environment). Zus&auml;tzlich zum OS gibt
es noch viele Komponenten der Hard- und Software-Technologie, die im
endg&uuml;ltigen Produkt integriert sind. Das zu Grunde liegende OS ist nicht
das, was den Amiga der n&auml;chsten Generation so revolution&auml;r macht. Sie
werden das noch klarer erkennen, sobald wir das "Technische Papier" in den
n&auml;chsten Tagen ver&ouml;ffentlicht haben werden. Ob wir nun QNX oder Linux
verwenden, der neue Amiga wird aufregend, elegant, leicht bedienbar,
unglaublich effizient und ja, wirklich revolution&auml;r sein!

Ich m&ouml;chte anmerken, dass ich strikt gegen Linux war, als es zum ersten Mal
im M&auml;rz vorgeschlagen wurde. Es bedurfte einer mehrere Monate langen
intensiven Untersuchung, um mich zu &uuml;berzeugen, dass die Entscheidung
richtig war. Ich versichere Ihnen, dass diese Entscheidung nicht ohne
tiefgehende &Uuml;berlegungen getroffen wurde. Ich h&auml;tte mich nicht f&uuml;r Linux
entschieden, wenn ich nicht glauben w&uuml;rde, es biete uns eine bessere
Gesamtl&ouml;sung mit einer deutlich h&ouml;heren Erfolgserwartung.

Ich m&ouml;chte auf die Linux-Enscheidung noch tiefer eingehen und mit dem
Begriff "revolution&auml;r" beginnen:

rev·o·lu·tion·ary ("re-v&-'l&uuml;-sh&-"ner-E): adjective; 1 c: constituting or
bringing about a major or fundamental change in the way of thinking about
or visualizing something: a change of paradigm

(Anm.d.&Uuml;.: J.C. zitiert aus einem W&ouml;rterbuch. Bedeutung etwa:)

revolution&auml;r (Ausprachebeschreibung): Eigenschaftswort;  eine wichtige oder
grundlegende &Auml;nderung der Denkweise oder der Ansicht &uuml;ber etwas festlegend
oder zustandebringend: ein Wechsel der Anschauungsweise

Der Schl&uuml;sselimpuls hinter unseren Pl&auml;nen ist der, dass wir mit einem echt
revolution&auml;ren Produkt herauskommen wollen, welches die n&auml;chste
Computer-Revolution antreiben kann. Gem&auml;&szlig; der Definition sind
revolution&auml;re Ideen nicht leicht zu erkennen und schwierig zu verbreiten.
Der in K&uuml;rze zu erwartende technologische Bericht wird Ihnen helfen zu
verstehen, warum der Amiga der n&auml;chsten Generation revolution&auml;r ist. Sie
m&uuml;ssen Ihre Gedanken &ouml;ffnen, weil revolution&auml;re Produkte IMMER &uuml;ber das
Normale hinausgehen, w&auml;hrend die meisten Menschen im Sinne des Normalen
denken. Sobald Sie verstanden haben, was den Amiga der n&auml;chsten Generation
einmalig und revolution&auml;r macht, werden Sie auch verstehen, warum die
Auswahl von Linux anstatt QNX keine kritische technologische Entscheidung
ist.

Unser Entwicklungsphilosophie war es, eine gute L&ouml;sung f&uuml;r die
hergebrachten Teile des OS zu finden und darauf unsere revolution&auml;ren
Teile aufzubauen. So einfach ist das! QNX ist eine gute technische L&ouml;sung
f&uuml;r die OS-Komponenten, aber es stellt deutliche Anforderungen an den
Markt und die Industrie. Linux hat die Ideen und Hilfsmittel der meisten
wichtigen Teile-Hersteller und Technologie-Anbieter absorbiert. Ich kann
einfach nicht glauben, dass wir genug Schwung bekommen, wenn wir nicht die
Kraftquellen von Linux anzapfen.
Bei Linux haben wir st&auml;ndig Zugang zu neuer Technologie und neuen
Komponenten, so wie sie auf den Markt kommen. Mit QNX h&auml;tten wir eine neue
Plattform herausbringen k&ouml;nnen, aber ich glaube nicht, dass wir mit der
schnellen Entwicklung der Technologie in der Computer-Industrie mithalten
k&ouml;nnten.
Bei Gateway war ich f&uuml;hrend in der Produktion dieser Industrie t&auml;tig und
habe tiefgreifende Erfahrungen auf dem Gebiet. ES WAR MEINE &Uuml;BERZEUGUNG,
DASS WIR AUF DIESEM WEGE SCHEITERN W&Uuml;RDEN. Bitte nehmen Sie diese
Feststellung zur Kenntnis! Wie h&auml;tte ich mich gegen Linux entscheiden
k&ouml;nnen, wenn ich fest daran glaube? Wie h&auml;tten wir auf einem Weg
weitergehen k&ouml;nnen, von dem ich glaube, dass er uns in die Irre f&uuml;hrt? Wem
n&uuml;tzt es, wenn wir versagen?

Wir sollten nun &uuml;ber die Linux-Technologie selbst sprechen. Viel Leute
sehen Linux als stabiles, aber gro&szlig;es und wenig wirksames OS an. Auch ich
hatte diese Meinung, als Linux zum erstenmal vorgeschlagen wurde. Also
verbrachten wir betr&auml;chtliche Zeit, um Linux mit seinen St&auml;rken und
Schw&auml;chen zu verstehen.
Wir haben unsere Linux-Auswertungen sogar intensiv mit Linus Torwalds
besprochen, um die F&uuml;r und Wider besser zu verstehen. Linux entwickelt
sich sehr rasch weiter und ich war sehr zufrieden, dass es ganz bequem
unsere technologischen Anforderungen erf&uuml;llen kann. Zum Teil ist die Gr&ouml;&szlig;e
und Ineffizienz von Linux darin zu suchen, dass es so viele M&ouml;glichkeiten
und verschiedene Konfigurationen bietet. Amiga wird eine saubere und
wirkungsvolle Konfiguration als Standardteil unserer Betriebs-Umgebung
festlegen.

Ein weiterer Vorteil von Linux besteht darin, dass Gesellschaften daran
arbeiten, die Hardware-Komponenten f&uuml;r den Linux-Kernel zu optimieren.
Damit gewinnen wir Effizienz und verbesserte Leistung f&uuml;r den MCC durch
enge Anbindung der Hardware- und Software-Komponenten. Die MCC-Harware
wird sehr stark sowohl f&uuml;r den Linux-Kernel wie auch f&uuml;r Java optimiert
sein. Zus&auml;tzlich zum einmaligen Amiga OE wird der MCC Linux und Java
besser unterst&uuml;tzen als jeder andere Computer auf der Welt. Dadurch
gewinnen wir Kraft am Markt und erh&ouml;hen unsere Erfolgsausichten. Wir
k&ouml;nnen erwarten, viele Amiga-Computer in die Linux-Gemeinde zu verkaufen
und das ist eine gute Sache. Um Erfolg zu haben, m&uuml;ssen wir die
Amiga-Gemeinschaft vergr&ouml;&szlig;ern.

Ich kann die Vorsicht verstehen, mit der viele von Ihnen dieser Ank&uuml;ndigung
begegnen und ich werde mich intensiv darum bem&uuml;hen, Ihre Sorgen
wegzur&auml;umen.
Ich m&ouml;chte ausdr&uuml;cklich betonen, dass es nicht meine Absicht war die
Amiga-Gemeinde in irgend einer Weise in die Irre zu f&uuml;hren. Ich habe hart
daran gearbeitet, die bestm&ouml;gliche Planung aufzubauen, um mit dem Amiga
die n&auml;chste Computer-Revolution zu betreiben. Ich glaube fest daran, dass
die Linux-Entscheidung zu diesem Ziel passt. Vielleicht h&auml;tte ich diese
Entscheidung &ouml;ffentlich machen sollen, als sie vor einigen Wochen
getroffen wurde, aber ich habe gehofft, zun&auml;chst mehr &uuml;ber die allgemeine
Architektur bekannt geben zu k&ouml;nnen. Ich bitte um Entschuldigung, die
Kommunikation &uuml;ber dieses Problem nicht besser geplant zu haben. Ich muss
jeden Tag Dutzende wichtiger Entscheidungen treffen und manche von ihnen
sind nicht ideal. Es gibt sicher Leute, die die durch diese Situation
hervorgerufene Verwirrung dazu benutzen werden, um eine negative Reaktion
der Gemeinde anzuheizen und die sie zu spalten versuchen werden. Es ist
wichtig, dass wir als Gemeinschaft zusammenstehen, oder wir verlieren
alles. Bitte haben Sie Geduld, versuchen Sie zu verstehen und haben Sie
Vertrauen. Es war eine lange und turbulente Reise, aber ich verspreche
Ihnen, dass das Warten sich gelohnt haben wird.

Sincerely,
Jim Collas
President, Amiga«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
