<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
7. Offener Brief von Jim Collas zur Linux-Entscheidung

»OFFENER BRIEF AN DIE GEMEINSCHAFT
----------------------------------

Linux-Ank&uuml;ndigung

Liebe Amigianer,

Nach Monaten der Forschung und tiefgehenden Diskussionen mit all unseren
Technologiepartnern haben wir uns entschieden, Linux als den prim&auml;ren
OS-Kernel f&uuml;r das neue Amiga Operating Enviroment (OE) zu benutzen. Ich
wei&szlig;, da&szlig; diese Entscheidung angesichts der fr&uuml;heren Ank&uuml;ndigungen und
Aktivit&auml;ten in Verbindung mit QNX ein Schock f&uuml;r viele von Ihnen ist. Dies
war eine sehr komplizierte und schwierige Entscheidung f&uuml;r uns, und ich
versichere Ihnen, da&szlig; ich diese Entscheidung nicht ohne erhebliche
Nachforschungen und &Uuml;berlegung getroffen habe. Wir haben Linux seit
Februar untersucht, aber haben unsere entg&uuml;ltige Entscheidung erst vor
wenigen Wochen getroffen. Wir hatten geplant, diese Entscheidung in
unserer Technologie-Einf&uuml;hrung, die in den n&auml;chsten Tagen erscheinen
sollte, der Amiga-Gemeinde mitzuteilen.

Ich bin gezwungen, die Entscheidung f&uuml;r Linux vor der
Technologie-Einf&uuml;hrung mitzuteilen, aufgrund der in den letzten Tagen von
QNX ausgegebenen Information. [Die Texte von QNX lassen sich unter 'Diverse 
News' nachlesen; Anm. d. Red.] Diese Information war nicht von Amiga 
&uuml;berpr&uuml;ft oder abgesegnet. Im Licht unserer Entscheidung f&uuml;r Linux
betrachtet, ist diese Information verwirrend und irref&uuml;hrend, und deshalb
m&ouml;chte ich mir die Zeit nehmen, die Situation zu kl&auml;ren. Ich kann keine
Details der Diskussion zwischen Amiga und QNX nennen, da wir rechtlich
verbindliche Stillschweigensabkommen geschlossen haben, aber ich kann mit
Ihnen &uuml;ber unsere Entscheidung f&uuml;r den Linux-Kernel sprechen. Ich denke,
da&szlig; Sie zustimmen werden, da&szlig; dies die richtige Entscheidung ist, sobald
Sie die Gr&uuml;nde f&uuml;r diese Entscheidung verstehen.

Bevor ich fortfahre, sollte ich erw&auml;hnen, da&szlig; unsere technologische
Entscheidung nicht negativ auf QNX zur&uuml;ckfallen soll. Ich glaube, da&szlig; QNX
eine gute Firma mit einer gro&szlig;artigen Technologie ist. Ich glaube nur, da&szlig;
Linux uns eine bessere Chance gibt, unsere Pl&auml;ne erfolgreich durchzuf&uuml;hren.

Die Entscheidung, QNX als unseren OS-Partner f&uuml;r den Multimedia Convergence
Computer der n&auml;chsten Generation zu benutzen, wurde Ende letzten Jahres
gef&auml;llt. Als ich im Februar die Stelle des Pr&auml;sidenten von Amiga &uuml;bernahm,
startete ich eine tiefgehende &Uuml;berpr&uuml;fung existierender Pl&auml;ne und
Entscheidungen von Amiga. Als Pr&auml;sident von Amiga mu&szlig;te ich sichergehen,
da&szlig; wir eine Strategie und einen Ausf&uuml;hrungsplan definieren, der es Amiga
und der Amiga-Gemeinde erlaubt, erfolgreich zu sein. Wir &uuml;berpr&uuml;ften
unsere Strategie, Architektur-Entscheidungen, Technologiepartner und
Durchf&uuml;hrungspl&auml;ne. W&auml;hrend dieser &Uuml;berpr&uuml;fungsphase haben wir auch eine
Anzahl sehr talentierter und erfahrener Personen eingestellt, die uns
helfen sollen, unsere technologischen und Produkt-Entscheidungen
fertigzustellen. Ich bin zuversichtlich, da&szlig; wir jetzt einen soliden und
aufregenden Plan haben, in den die Leute Vertrauen haben k&ouml;nnen.

Linux hat als rentable, offene OS-Alternative am Markt im vergangenen Jahr
signifikant an Schwung gewonnen. Dieser Schwung, die wachsende
Bereitschaft zu Linux-Anwendungen durch eine breite Vielzahl von
Software-Herstellern, und die wachsende Verf&uuml;gbarkeit von
Linux-Ger&auml;tetreibern durch Hardware-Hersteller, machten es zu einem
verf&uuml;hrerischen Kandidaten. Zus&auml;tzlich zu den Ressourcen, die alle
nennenswerten Teilehersteller in die Entwicklung von Linux-Treibern
investierten, war es schwierig, diese zu einer Portierung zu noch einem
weiteren Betriebssystem zu &uuml;berzeugen. Das Linux OS als Grundlage f&uuml;r
unser Amiga OE zu verwenden, erlaubt es uns, auf eine gro&szlig;e Zahl
verf&uuml;gbarer Software, Treiber und Utilities zur&uuml;ckzugreifen. Das erlaubt
es uns, schnell verschiedene Grafikkarten und andere Peripherie zu
unterst&uuml;tzen.

Angesichts der oben genannten Vorteile haben wir entschieden, eine
tiefgehende technische Analyse von Linux durchzuf&uuml;hren, um zu entscheiden,
ob es ein sinnvoller OS-Kernel f&uuml;r unser neue Amiga-Betriebsumgebung (OE)
sein k&ouml;nnte. Als wir Higher-Level Teile unserer Betriebsumgebung und
AmigaObjectTM-Architektur auf Linux portierten, entdeckten wir einige
signifikante Performance-Vorteile des Linux-Kernel in Bereichen wir
verteiltes Objekt-Messaging &uuml;ber Netzwerk (bis zu 10X schneller als
WindowsNT). Obwohl Linux-Konfigurationen sehr umfangreich sein k&ouml;nnen,
sind die Kernteile des Linux-Kernel in der Tat sehr klein und effizient.
Bei der Beurteilung der Hardware-Anforderungen entdeckten wir auch Firmen,
die an Linux-optimierten Hardware-Komponenten arbeiten. Zus&auml;tzlich ist
Linux das wahrscheinlich stabilste Betriebssystem, das am Markt erh&auml;ltlich
ist. Nach Monaten tiefgehender Untersuchungen sind wir &uuml;berzeugt, da&szlig; wir
einen sehr aufregenden Amiga der n&auml;chsten Generation bauen k&ouml;nnen,
basierend auf dem Linux OS-Kernel.

Bedeutet das, da&szlig; der Amiga der n&auml;chsten Generation nicht einzigartig sein
wird? Absolut nicht! Bedenken Sie, da&szlig; der OS-Kernel nur eine Komponente
des neuen Amiga OE ist, und da&szlig; die Hardware einzigartig ist. Die
revolution&auml;re Natur des Amiga OE liegt in der Art, wie das traditionelle
Betriebssystem erweitert wird, um eine Host-Umgebung f&uuml;r eine neue Klasse
von protierbaren Anwendungen bereitstellt; Applikationen, die in einer
umfassenden Computer-Netzwerk-Umgebung existieren. Wir werden verschiedene
Technologien integrieren, inklusive einer effizienten Windowing-Umgebung
und einem einzigartigen Benutzerinterface.

Auf den Punkt gebracht haben wir uns f&uuml;r die Verwendung von Linux
entschieden aufgrund des unbeschreiblichen Schwungs und der Tatsache, da&szlig;
es solide Technologie und eine gute Grundlage f&uuml;r unser neues Amiga OE
ist. Zus&auml;tlich ist die Linux-Gemeinde eine beeindruckende Kraft, an der
wir uns ausrichten sollten. Wir teilen viele gemeinsame Werte und Ziele
mit der Linux-Gemeinde. Linux als OS-Kernel zu benutzen, erlaubt uns, ein
einzigartige und revolution&auml;re Betriebsumgebung zu bauen, w&auml;hrend wir den
enormen Schwung von Linux ausnutzen.

Die bald ver&ouml;ffentlichte Technologieeinf&uuml;hrung wird unsere Architektur
weiter erkl&auml;ren, sowie die Pl&auml;ne, wie all die ausgew&auml;hlte Technologie
integriert werden soll. Sobald Sie dies lesen, da bin ich sicher, werden
Sie die revolution&auml;re Natur des Next Generation Amiga verstehen. Ich
versichere Ihnen, da&szlig; Amiga und die Amiga-Gemeinschaft eine treibende
Kraft der n&auml;chsten Computerrevolution sein werden.

Sincerely,
Jim Collas
President, Amiga«

Die deutsche &Uuml;bersetzung stammt von Martin Baute, der sie uns 
freundlicherweise zur Verf&uuml;gung gestellt hat.
(Quelle des Originals: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
