<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
9. Newsgroup-Statement von Jim Collas mit weiteren Erkl&auml;rungen

»Wie Sie sich sicher vorstellen k&ouml;nnen, habe ich die Newsgroups genau
verfolgt, wie in diesen die Linux-Entscheidung diskutiert wird. Die
pers&ouml;nlichen Angriffe auf mich sind entmutigend, doch ich kann einigen
Leuten nicht verdenken, dass sie sehr ver&auml;rgert sind. Angesichsts dessen,
was die Amiga-Gemeinde in den letzten paar Jahren durchgemacht hat und wie
sich diese Situation offenbarte, ist das verst&auml;ndlich. Ich w&uuml;nschte, ich
h&auml;tte diese Situation besser gehandhabt, doch ich bin sehr viel gereist und
QNX hat uns mit deren Ank&uuml;ndigung &uuml;berrascht. Wie ich schon in einem
fr&uuml;heren Schreiben bemerkte, planten wir, die Linux-Entscheidung zusammen
mit dem Technologie-Brief zu nennen. Ich m&ouml;chte die Linux-Entscheidung hier
nicht er&ouml;rtern, denn Sie m&uuml;ssen zuerst das ganze Bild verstehen und der
Technologie-Brief sollte dabei helfen. Ich w&uuml;rde gerne einige
Mi&szlig;verst&auml;ndnisse ansprechen, die ich in den Postings sehe. Ob Sie der
Linux-Entscheidung zustimmen, oder nicht, Fehlinformation und ungenaue
Spekulationen werden die Situation nur verwirren. Ich m&ouml;chte gerne, dass
Folgendes verstanden wird:

  1. Es gab mehrere Kommentare dar&uuml;ber, wie Amiga ONX zum Narren gehalten
     und dann weggeworfen h&auml;tte. Ein paar dieser Kommentare unterstellen
     uns mangende Ethik. Diese Kommentare geben die Situation nicht
     richtig wieder. Ich bin sehr ethisch und w&uuml;rde unethisches Verhalten
     bei Amiga nicht tolerieren. Wir haben QNX anst&auml;ndig und ehrlich
     behandelt. Die Leute sollten nicht annehmen, dass das
     Amiga/QNX-Gesch&auml;ft ausschlie&szlig;lich an Amiga gescheitert ist. Es gab
     unterschiedliche Meinungen bez&uuml;glich der Strategie, der
     Implementierung und der Lizenzbedingungen, die wir &uuml;ber Monate zu
     verhandeln versuchten. Ich kam da mitten hinein und war bei den
     Verhandlungen &uuml;ber vier Monate pers&ouml;nlich dabei. Linux begann als
     unser Back-up-Plan, nur f&uuml;r den Fall, dass wir keine Einigung
     erreichen w&uuml;rden, und endete als unsere bevorzugete Wahl. Ich kann
     nicht ins Detail gehen, bedenken Sie aber, dass die Dinge nicht immer
     so einfach sind, wie es von au&szlig;en aussieht.

  2. Die Kommentare, die mich am meisten plagen, sind die, die meine Ethik
     und Motiviation in Frage stellen. Mit dem Eintritt bei Amiga kam ich
     in eine Situation, die &uuml;ber Jahre hinweg fehlgeleitet worden war und
     in eine Gemeinde, die berechtigter Weise ihre Geduld verloren hatte.
     Es ist frustrierend, dass mich die Leute mit all den Fehlern und
     Vers&auml;umnissen der Vergangenheit in Verbindung bringen. Das l&auml;&szlig;t mir
     sehr wenig Platz f&uuml;r Fehler und Korrekturen. Ich bin seit f&uuml;nf
     Monaten Pr&auml;sident von Amiga und die Linux-Entscheidung ist die
     einzige gro&szlig;e &Auml;nderung, die ich gemacht habe. Im Nachhinein h&auml;tte ich
     die Kommunikation in dieser Situation besser regeln k&ouml;nnen, doch es
     geschehen unglaublich viele Dinge und ich bin nur ein Mensch. Ich
     werde einige Dinge in Ordnung bringen. Die &Uuml;berraschung von QNX hat
     uns nicht geholfen. Ich war in jeder Situtation offen und ehrlich mit
     der Gemeinde. Amiga hat in den letzten f&uuml;nf Monaten mehr Fortschritte
     gemacht, als in den vergangenen f&uuml;nf Jahren. Bedenke, wir entwickeln
     nicht nur ein Produkt. Wir bauen eine substantielle Firma auf, die
     sich dieser aggresiven Industrie stellen mu&szlig;. Das ist ansich schon
     keine kleine Aufgabe. Alles in allem, gew&auml;hrt mir bitte eine
     Ruhepause.

  3. Es gibt viele falsche Vorstellungen &uuml;ber die Gr&ouml;&szlig;e, Stabilit&auml;t und
     Leistung des Linux OS. Aus dem gleichen Grund habe auch ich anfangs
     Linux abgelehnt. Es gibt so viele Optionen und Konfigurationen bei
     Linux, das es f&uuml;r die Leute schwierig ist, es zu handhaben. Darum
     haben wir Monate damit verbracht, es zu bewerten, bevor wir
     irgendeine Entscheidung trafen. Der Kern des Linux OS ist bessser,
     als die Leute denken. QNX ist in ein paar Sachen besser, Linux ist in
     anderen Sachen besser. Versuchen Sie nicht, ohne Einzelheiten,
     Vermutungen &uuml;ber den aktuellen Stand von Linux anzustellen. Ich habe
     Allan Havemose gebeten, unsere Bewertung von Linux f&uuml;r Sie zusammen
     zu stellen.

Ich hoffe, dies wird helfen, ein paar der falschen Statements aufzukl&auml;ren.
Ich rechne damit, dass einige Leute fortfahren werden, auf mich und unsere
Entscheidung einzuschlagen. Ich verstehe, dass diese Form der Frustration
nicht &uuml;ber Nacht verschwindet. Alles, um das ich die Leute bitte ist, sich
die Zeit zu nehmen, unseren Technologie-Brief zu lesen und zu verstehen,
wenn dieser erscheint.

Sincerely,
Jim«

Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs, wurde f&uuml;r das 
Projekt AIDA (http://www.amiga-club.de/aida/0046.html) vorgenommen und uns 
freundlicherweise zur Verf&uuml;gung gestellt.
(Quelle des Originals: Newsgroup comp.sys.amiga.misc)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
