<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
14. &Uuml;ber Heiligt&uuml;mer, die Revolution und einem Kerl namens Collas

Der folgende Artikel eines Amiga-Anwenders ist im englischen Original im 
AMIGA-BulletinBoard erschienen und wurde von AMIGA auf der World of Amiga 
in London in schriftlicher Form verteilt. AMIGA-Pr&auml;sident Jim Collas soll 
gesagt haben, dass dies seine Vision sei und er sie nicht besser ausdr&uuml;cken 
k&ouml;nnte:

»[WARNUNG! Es folgt das lange, wirre Gefasel eines phantasierenden
Traumt&auml;nzers. :-) ]


Wenden Sie Ihre Augen f&uuml;r einen Moment vom Bildschirm und schauen Sie sich
um. Was sehen Sie? Ich kann mir ziemlich gut vorstellen, was Sie sehen. Sie
sitzen vor einem Schreibtisch der von Monitor, Tastatur und Maus bestimmt
wird. Ein Computer steht eher unter dem Schreibtisch auf dem Boden. Wenn
der auf dem Tisch steht, liegt das mehr an physikalischen Beschr&auml;nkungen
(maximale Kabell&auml;nge, Zugriff), als dass es Ihre Wahl gewesen w&auml;re. In der
unmittelbaren Umgebung t&uuml;rmen sich Papier, B&uuml;cher, Magazine auf dem
Schreibtisch und in nahen Regalen. Eine gro&szlig;e Menge davon ist da, um Ihnen
den Umgang mit dem Computer und der Sofware zu erleichtern.

Lassen wir den Blick etwas weiter schweifen, sehen wir, dass der Raum nach
den Anforderungen von Schreibtisch und Computer eingerichtet wurde. Als Sie
in diesen Raum hinein kamen, haben Sie zuerst entschieden, wo der Computer
hin sollte. Stromleitungen wurden verlegt, Telefonleitungen verl&auml;ngert -
gerade so, dass Ihr Computer dort stehen konnte, wo Sie ihn hinhaben
wollten. Wo er stehen mu&szlig;te. Dieser Raum ist Ihre physische Umgebung f&uuml;r
die Besch&auml;ftigung mit dem Computer. Ob Sie im Web browsen, Ihre Emails
lesen, ein Programm schreiben, Ihre elektronische Finanzbuchhaltung machen
wollen, egal was; Sie gehen dazu in diesen Raum. Hier werden Rituale
vollzogen. Mit den richtigen Zauberspr&uuml;chen und ausreichenden Opfern k&ouml;nnen
Sie St&auml;rke, Macht und Wissen erreichen. Dieser Raum ist ein heiliger Platz,
mit dem Computer als Altar.

In f&uuml;heren Zeiten waren die heiligen Pl&auml;tze gr&ouml;&szlig;er. Es gab weniger davon.
Priester durchschritten schweigend die heiligen Pl&auml;tze, empfingen die
Gebete von einer auserw&auml;hlten Schar, beschafften Segen f&uuml;r den Gott,
leiteten die Bestrafung auf die S&uuml;nder herab. Nat&uuml;rlich sind die heiligen
Pl&auml;tze von denen ich spreche die Daten- und Computerzentren. Sie wollten
nicht l&auml;nger &uuml;ber Nacht auf Segen oder Bestrafung warten. Und die G&ouml;tter
erh&ouml;rten sie. Und die Revolution kam.

"Sehet! Der pers&ouml;nliche Altar! (auch als Bausatz zu haben)" Die erw&auml;hlte
Schar mu&szlig;te nicht l&auml;nger erw&auml;hlt werden. Die Schar wuchs zu den Massen
heran. Und die Massen konstruierten ihre eigenen Heiligt&uuml;mer in denen sie
ihre eigenen Altare errichteten. Die Priester wurden verbannt. F&uuml;hrung und
Wissen war f&uuml;r jeden in seinem eigenen Heim verf&uuml;gbar. Geheimnisvolle
Gebete wurden von simplen Phrasen abgel&ouml;st. Und die Massen sahen, dass es
gut war.

Einige jedoch wurden unzufrieden. Von der eigentlichen, auserw&auml;hlten Schar
gelehrt oder selbst dazugeh&ouml;rend, hatten sie m&auml;chtige Visionen. Sie sind
die Weisen.

Als die Massen wuchsen, wurden die Altare ein immer gr&ouml;&szlig;erer Teil des
t&auml;glichen Lebens. Einige der Massen werden Stunden, sogar Tage in einsamer
Vertrautheit mit ihren Heligt&uuml;mern verbracht haben, um Wissen und
Zufriedenheit zu erlangen. Dies sind religi&ouml;se Fundamentalisten. Sehr oft
in Zeiten, da andere Familienmitglieder das Heiligtum im Heim mieden, bis
hin zu dem Punkt, an dem manche mehrere Heiligt&uuml;mer in ihrem Haus
errichteten - jeder davon mit seinem eigenen Altar.

Den Weisen bereitete das gro&szlig;e Probleme. Sie beteten lange, oft in der
Stille. Dann kam die Vision und die Antwort war gefunden: Alt&auml;re sollten
nicht l&auml;nger auf Heiligt&uuml;mer beschr&auml;nkt sein! La&szlig;t die Leute zu jedem Altar
beten, ungeachtet Ihrer Religion! Die Betenden sollen immer und &uuml;berall
erh&ouml;rt werden! Rei&szlig;t die Grenzen nieder, vereint die Welt, Revolution!
REVOLUTION!!!

"Sehet! Der Informationsger&auml;te-Altar! (auch als Einzelkomponente zu
erhalten)." Die T&uuml;ren der Heiligt&uuml;mer brachen auf. Strahlen aus Licht
bohrten sich in die schwerm&uuml;tige Dunkelheit. Die Massen schauten auf.
Geblendet vom Licht traten sie in die Welt hinaus und freuten sich, denn
sie waren befreit.

Doch einige der Fundamentalisten schauten auf die neuen Alt&auml;re und
urteilten diese als unheilig, denn sie f&uuml;rchteten sich davor, ihre
Heiligt&uuml;mer zu verlassen. "Diese neuen Alt&auml;re sind nicht heilig. Wie sollen
wir es erlauben, dass diese unsere alten, heiligen Alt&auml;re ersetzen? Das ist
keine Erl&ouml;sung, das ist Wahnsinn!", riefen sie aus. Aber im Geheimen
f&uuml;rchteten sie nicht die Alt&auml;re, sondern die Freiheit. Die Verwandlung
ihrer Heiligt&uuml;mer in lauter R&auml;ume der Dunkelheit, Gargoyles und Staub
erf&uuml;llte sie mit Schrecken. "Was ist ein Altar ohne Heiligtum?", fragten
sie. "Freiheit und Harmonie", riefen die Massen aus. Jedoch glaubte man
ihnen nicht.

Und so blieben die Heiligt&uuml;mer zur&uuml;ck. Mit dem Laufe der Zeit begannen die
Heiligt&uuml;mer langsam zu Staub zu zerfallen. Manchmal kommen die erleuchteten
Massen mit ihren Kindern zu den Heiligt&uuml;mern, wie Eltern ihren Kindern im
Museum Werkzeuge l&auml;ngst vergangener Zivilisationen zeigen. Sie finden dort
einen alten, schmutzigen Mann, der ihnen etwas &uuml;ber S&uuml;nder, Heiden und
einem Kerl namens Collas zuknurrt. Niemand wei&szlig;, was der Einsiedler in
seinem Lager macht. Niemand kann sich denken, warum er dieses
selbstauferlegte Exil w&auml;hlte, dieses Gef&auml;ngnis.

Niemand hat bemerkt, wie das letzte der Heiligt&uuml;mer in sich zusammenfiel.

Was ich damit sagen will ist: Die n&auml;chste Computerrevolution dreht sich
nicht um coole Hardware. Es geht darum, von wo aus Sie auf Computerdienste
zugreifen k&ouml;nnen. So wie PCs diese Dienste aus den Datenzentren
herausgeholt und auf die Schreibtische der Leute gebracht haben, wird diese
Revolution Computerdienste aus den ihnen gewidmeten, pers&ouml;nlichen
Heiligt&uuml;mern herausholen und sie allgegew&auml;rtig verf&uuml;gbar machen, &uuml;berall im
Heim und sp&auml;ter ziemlich wahrscheinlich &uuml;berall auf der Welt.

Die Computerhardware wird sich in Form von Komponenten irgenwo in Ihrer
Stereoanlage oder Ihrem Heimunterhaltungszentrum befinden. Der Zugriff wird
&uuml;ber Informationsger&auml;te (Pads, TV, die T&uuml;r des K&uuml;hlschrankes) erfolgen. Der
Computer wird nicht l&auml;nger etwas sein, vor dem Sie sitzen m&uuml;ssen. Das
k&ouml;nnen sie nat&uuml;rlich tun, wenn Sie das wollen, aber sie m&uuml;ssen nicht.
Liegen Sie auf der Coutch und surfen Sie im Web, lesen Sie ihre Emails im
Garten. Doch das k&ouml;nnen sie schon mit einem Laptop oder einem PDA. Was ist
also anders? Der Unterschied ist, dass dies alles sich in einer einzigen,
einheitlichen Umgebung befinden wird. Ein Laptop ist ein stand-alone
System. Um Informationen von Ihrem Laptop auf Ihren PC zu bekommen, bedarf
es bedeutender physischer Anstrengung (den Laptop neben den Computer
stellen, Kabel einstecken oder ein Schleichnetz verwenden). Um
Informationen vom PC auf den Laptop zur&uuml;ck zu bekomme, mu&szlig; der ganze
Prozess wiederholt werden. Nach der Revolution wird Heimcomputer, Ihr
Laptop, Ihr PDA f&auml;hig sein, von &uuml;berall in der realen Welt auf Ihr eigenes
St&uuml;ck Informationsraum in der virtuellen Welt zuzugreifen.

Wie also bringt sich Amiga selbst in Position f&uuml;r diese Revolution? Die
Ann&auml;herung geschieht zweifach: Hardwareinfrastruktur und
Softwareinfrastruktur.

Auf der Hardwareseite werden Heimzentren (oder wie auch immer diese hei&szlig;en
werden) ein gro&szlig;es Gesch&auml;ft sein. Vom Verkauf her mit Stereo und Video zu
vergleichen. Die Umwandlung von Altar im Heiligtum in ein St&uuml;ck Metall und
Plastik, das irgendwo in einer Ecke steht, wird nicht pl&ouml;tzlich erfolgen.
Die Einstellung der Leute mu&szlig; sich &auml;ndern. Amiga positioniert sich selbst
als F&uuml;hrer in diesem Markt mit der Vorstellung vom Begr&uuml;nder und durch dem
Erschaffen von Hardware. Um den Wechsel in den Gedanken der Menschen zu
erleichtern, wird die Hardware als normales Computersystem erscheinen,
gleichzeitig aber die F&auml;higkeit besitzen, zum Informationsger&auml;t zu werden.
Oder zumindest der Weg dorthin sein, indem sie die Basis f&uuml;r zuk&uuml;nftige,
echt Die Hardwareinfrastruktur ist nichts ohne die Softwareinfrastruktur
(und umgekehrt). Diese ganze Kommunikation und R&auml;umlichkeit mu&szlig; durch
Software erleichtert werden. Auch in diesem Markt versucht Amiga zu f&uuml;hren,
indem durch die Integration existierender und neuer Softwaretechnologien
ein H&ouml;chstma&szlig; an Verbindungsf&auml;higkeit, Portierbarkeit und
Zugriffsm&ouml;glichkeit in einer einheitlichen Umgebung geschaffen werden. Das
ist Amga OE und AmigaObjects. Auch das ist als allein nicht die Revolution.

Hardware und Software zusammenzubringen ist nicht die Revolution. Die
Revolution ist eine fundamentale &Auml;nderung in der Weise, wie wir &uuml;ber die
Arbeit mit Computern und Computer selbst denken. Amiga versorgt uns und den
Rest der Welt mit den Werkzeugen, die diese &Auml;nderung erlauben. Die
Revolution ist das, was die Leute mit diesen Werkzeugen machen werden. Sie,
ich, Collas, jeder Andere bei Amiga. Wir sind Revolution&auml;re. &Ouml;ffnen Sie die
T&uuml;ren, rei&szlig;en Sie die Grenzen nieder, l&ouml;sen Sie die Ketten, betreten Sie
die Welt. Computern wird nicht l&auml;nger eine geweihte Pilgerst&auml;tte, nicht
l&auml;nger ein heiliger Altar, verschlossen in einem Heiligtum, sein. Es wird
immer da sein, wo Sie gerade sind. Das ist die Revolution.


---JvdL---

(Wer, der bis hier gelesen hat, ist verbl&uuml;fft!)«


Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs, wurde f&uuml;r das 
Projekt AIDA (http://www.amiga-club.de/aida/0053.html) vorgenommen und uns 
freundlicherweise zur Verf&uuml;gung gestellt.
(Quelle des Originals: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
