<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. AMIGA gibt weitere Konzeptzeichnungen frei - eure Meinung

Anfang Juli hat AMIGA weitere Konzeptzeichnungen zum AmigaNG f&uuml;r die 
Ver&ouml;ffentlichung freigegeben. Die Abonnenten der AMIGA-aktuell-Grafiken 
haben sie postwendend als Special erhalten, mit der Bitte um eine 
Stellungnahme.
Die Entw&uuml;rfe sind von den Lesern &auml;u&szlig;erst verschieden aufgenommen worden, 
wie das jedoch nicht anders zu erwarten war:


Oliver Schmidt ist nicht begeistert:

»Die Idee, das Keyboard wie beim 1000er wieder unter der Zentraleinheit 
verschwinden zu lassen, ist an sich ganz ergonomisch. Dennoch finde ich, 
dass die Entwuerfe zu sehr in die Richtung des iMac gehen - nett anzusehen, 
aber zu verspielt und wenig erweiterungsfreudig. Denkt man denn nicht auch 
an ein erweiterungsfreudiges Towermodell? Oder soll die Anwenderschaft mal 
wieder 300-600 M&auml;rker extra ausgeben m&uuml;ssen, um den Rechner auch anst&auml;ndig 
nutzen zu k&ouml;nnen?«


Gernod Schomberg h&auml;lt die Skizzen f&uuml;r wenig aussagekr&auml;ftig:

»Nun, diese Handskizzen besagen noch nicht soviel, dass man dar&uuml;ber ins 
Schw&auml;rmen kommen kann. Es sind offenbar Ergebnisse des Brainstormings, aber 
ich denke, als Arbeitsumgebung, Home-Appliance oder wie immer der neue 
Amiga bezeichnet wird, soll so etwas auch ins Wohnzimmer passen.
F&uuml;r mich ist der alte viereckige Kasten, der platzsparend unter dem 
Computer-Arbeitstisch verschwinden kann, das richtige. Auf dem Tisch sind 
neben dem Monitor soviele Sachen, die zug&auml;nglich sein m&uuml;ssen (ZIP-Laufwerk, 
Genlock, Videorecorder - manchmal zwei -, Fernseher, Nadeldrucker, 
Farbdrucker, Stiftplotter, Druckerumschalter + kleiner PehZeh), dass ich da 
nichts gestiltes brauchen kann.

Was aber mein tiefes Bedauern ausl&ouml;st, ist der letzte Collas- + Amiga-
Bericht. Bedauern dar&uuml;ber, dass ich zu den Uralt-Amiga-Fans geh&ouml;re (ich bin 
73!) und ich den neuen Amiga nicht mehr so richtig genie&szlig;en k&ouml;nnen werde. 
Mit dem Alter l&auml;sst leider so manche F&auml;higkeit, k&ouml;rperlich wie auch - in 
diesem Falle wichtig - geistig, nach. Wenn der AmigaNG nur halb so gut wird 
wie versprochen, ist es ein Hammer! Ich erinnere mich noch, wie mich vor 
einem Dutzend Jahren der erste Amiga begeistert hat und ich werde nat&uuml;rlich 
auch auf den Neuen umsteigen.
Ich hoffe, dass J&uuml;ngere als ich mit dem AmigaNG die gleiche Freude erleben 
werden, wenn er ihnen die (hoffentlich) besseren M&ouml;glichkeiten als andere 
Plattformen zur kreativen Gestaltung ihrer Ideen bietet, wie der Uralt-
Amiga es zu seiner Zeit tat.«


Andreas Frank ist von den Designs geradezu hingerissen:

»Die Konzepte von Amiga finde ich eigentlich alle saustark. Aber Konzepte 
sind halt immer stark, das mu&szlig; ja f&uuml;r das Produkt sp&auml;ter nix hei&szlig;en. 
Trotzdem, besonders gut haben mir die Designs von Bild 1 und Bild 9 
gefallen. Ein bi&szlig;chen eckig sollte die Geschichte schon bleiben, aus 
praktischen Gr&uuml;nden. Man sollte schon (zumindest theoretisch) einen Monitor 
draufstellen k&ouml;nnen. Ehrlich gesagt, sind mir ja Big Towers eh lieber, aber 
wenn das Geh&auml;use echt so genial aussieht, wie auf den Zeichnungen, mache 
ich gerne ein bi&szlig;chen Platz auf dem Schreibtisch daf&uuml;r.«

Was mir v&ouml;llig mi&szlig;fallen hat, war der 15" Monitor auf einer Zeichnung. Soll 
das Multimedia sein? Nein. Bestimmt nicht. Unter 17" sollte man nix mehr 
anfangen. (Noch besser: LCD w&auml;re halt heutzutage f&uuml;r einen modernen 
Multimedia-Computer schon angebracht, trotzdem: TVout sollte nicht 
vergessen werden!)« (Anm.d.Red.: Wurde auch nicht, siehe Technologiepapier 
zum AmigaNG in dieser Ausgabe.)


&Uuml;berhaupt nichts von den Konzeptzeichnungen h&auml;lt Mark Buonfrate:

»Einfach schlimm - soll nun der NG-Amiga eine Gameconsole werden, oder eine 
aufr&uuml;stbare ansehnliche Workstation? Eine halbwegs normale Tower-Version 
w&auml;re mir lieber - mit diesen Desktop-Console-Designstudien kann ich mich 
nicht anfreunden - auch nicht mit der Pseudo-iMac-Variante...

M&uuml;ssen die immer wieder mit solch Schwachsinnigem antreten? Haben wir nicht 
genug zum Lachen gehabt, als der "Staubsauger" den Markt "revolutionieren" 
sollte?«


Thomas Franziskowski ist von den Entw&uuml;rfen sehr angetan:

»Heute habe ich mir die neuen Konzeptzeichnungen f&uuml;r den Amiga NG 
angeschaut und ich muss sagen: Sie gefallen mir alle sehr gut (die letzte 
Zeichnung "frame" allerdings etwas weniger). Ein solch sch&ouml;nes Design w&auml;re 
f&uuml;r mich ein zus&auml;tzliches Kaufargument f&uuml;r diesen Computer.
Sehr attraktiv f&auml;nde ich ein kabellos abgesetztes Keyboard (Verbindung per 
Infrarot), wie es die Zeichnungen bereits andeuten.
Neben den Formen sind auch die Farben und die Frontplatte aus Metall sehr
sch&ouml;n.
Bei den Handhelds w&auml;ren griffige Seitenfl&auml;chen, die hier bereits durch 
Farben angedeutet sind, sehr w&uuml;nschenswert. Gerade hier sollte der 
Ergonomie eine hohe Beachtung geschenkt werden.
Beim Bild "jetson" frage ich mich allerdings, wie hierbei ein Monitor 
daraufgestellt werden soll (wegen der unebenen Fl&auml;che). Nur wenige werden 
aus Platzgr&uuml;nden das Ger&auml;t daneben stellen wollen. Auf der anderen Seite: 
Vielleicht denke ich da jetzt etwas zu unflexibel...?
Die Zeichnung "techtonica" erinnert an das Geh&auml;use der Sony Playstation. 
Sehr interessant ist hier auch die Bemerkung "DVD" unten!
Die Idee, das Keyboard unter das Desktopgeh&auml;use schieben zu k&ouml;nnen, ist 
auch sehr praktisch und damit begr&uuml;&szlig;enswert!
Mein Favorit ist &uuml;brigens das "kyoto"-Geh&auml;use! Wirklich ein Schmuckst&uuml;ck!«


Martin Henke sieht &Auml;hnlichkeiten zu zwei existierenden Rechnern:

»Mich erinnern die neuen Konzeptskizzen an zwei verschiedene Computer:
a) den Amiga 1000 (n&auml;mlich 01_kyoto.jpg, 02_frame.jpg, 03_audi_tt.jpg,
11_jetson.jpg, 05_techtonica.jpg)
b) den iMac (n&auml;mlich 02_kyoto.jpg, 06_techtonica.jpg, 16_starck.jpg,
17_starck.jpg).

Warum? Nun, a) erinnert mich an den A1000, da er ebenfalls flach war und 
man ebenfalls die Tastatur unter ihn schieben konnte. Leider konnte man ihn 
nicht gro&szlig;artig erweitern.

b) erinnert mich an den iMac, weil alles (incl. Monitor) in ein einziges 
Ger&auml;t integriert ist.

Ob beide Konzepte den K&auml;ufer ansprechen, lasse ich mal dahingestellt, denn 
das ist Geschmackssache. Aber ich vermute mal, da&szlig; beide sich nicht 
besonders gut erweitern lassen werden. Ich hoffe, da&szlig; es auch einen Tower 
geben wird. Wenn dieser auch in die gegenw&auml;rtige Design-Linie pa&szlig;t - gut. 
Wenn nicht - auch gut, jedenfalls kann man den Computer erweitern.

Aber ich vermute mal, da&szlig; ein Tower nicht gro&szlig;artig geplant werden mu&szlig; und 
da&szlig; daher nur die "designten" Geh&auml;usekonzepte gezeigt werden.«


Uwe Mann sieht die Gefahr von W&auml;rmeproblemen:

»Am meisten w&uuml;rde mir pers&ouml;nlich Bild 05_techtonica und 28_frame zusagen, 
weil: Es wurde ja angedeutet, dass das Rad nicht zweimal erfunden werden 
solle. Das hei&szlig;t, wo sollen denn die ganzen Erweiterungen, die ja eventuell 
aus dem Wintel PC-Bereich kommen k&ouml;nnten, hineingesteckt werden? Die neuen 
Hochleistungs-Grafikkarten erzeugen eine Menge W&auml;rme, wo soll die denn 
abgeleitet werden? Da haben selbst Maxi-Tower im Wintel-PC-Bereich 
Probleme.... In den anderen Geh&auml;useformen d&uuml;rfte das ziemlich unm&ouml;glich 
sein. Oder hat ein NG-Amiga keine n&ouml;tig??
Die Konzepte sehen ja alle gut aus aber einige haben &Auml;hnlichkeit mit dem 
iMAC. Das sollte unter allen Umst&auml;nden vermieden werden. Ein NG-Amiga 
sollte sofort einwandfrei identifiziert werden, genauso wenn man den iMac 
sieht, wei&szlig; man sofort: Aha, das ist ein iMac.
Es zeichnet sich immer mehr ab, dass das, was am Ende der neue Amiga sein 
wird, nichts, aber auch gar nichts, mit dem heutigen Amiga zu tun hat. 
Einzig die Idee, dass 'Computer nicht gleich Windows' ist, bleibt &uuml;ber.«


Klaus Lehberger fasst seine Meinung in einem Satz zusammen:

»Mir ist so ziemlich jeder Entwurf willkommen, wenn nur die "Innereien" ;-) 
stimmen...«


Rainer Lunge glaubt nicht, dass die Geh&auml;use der AmigaNG-Rechner auch 
tats&auml;chlich so aussehen werden:

»Ich halte recht wenig von den Konzeptzeichnungen. Sie zeigen zwar sehr 
futuristische Geh&auml;use, aber ob diese in Serie gehen ist doch die Frage. 
Vergleichbar sind diese Zeichnungen mit den Konzept-Cars der 
Automobilindustrie. Dies sind auch sehr futuristische Design-Studien.
Nur gibt es auch nur ein Konzept-Car, welches komplett in die 
Serienproduktion &uuml;berf&uuml;hrt wurde? Ich w&uuml;&szlig;te keines.
Au&szlig;erdem ist meiner Meinung das Geh&auml;use nicht das Entscheidende des 
AmigaNG. Viel wichtiger ist ein revolution&auml;res Innenleben und 
Betriebssystem.«


Mark Nickel hat einen Favoriten:

»11-Jetson finde ich als Geh&auml;use-Entwurf am besten, wenn auch in einer 
anderen Farbe (vielleicht sollte man welche zum W&auml;hlen vorgeben wie beim 
iMac). Das Gute an dem Entwurf ist die M&ouml;glichkeit die Tastatur unterm 
Rechner verschwinden lassen zu k&ouml;nnen; eine nette Anspielung an den A1000.«


Christian Kess ist f&uuml;r ein konventionelleres Design:

»Jo, sch&ouml;n. Erinnert mich irgendwie an den iMac... ob so was bei den Leuten
zieht? Also ich pers&ouml;nlich h&auml;tte doch lieber was im Stil eines Infinitiv-
Towers... die Entw&uuml;rfe sehen etwas teuer aus. :)«


Gar nicht gut zu sprechen auf die Entw&uuml;rfe ist Markus Castro:

»Ich finde diese Entw&uuml;rfe teilweise echt grauenhaft! Nicht, dass sie 
schlecht gezeichnet worden w&auml;ren oder &auml;hnliches (was ja auch schon einige 
Leute bem&auml;ngelten...), nein: Das Design - das erinnert mich vielleicht an 
die Playstation oder den iMac. Wenn AMIGA tats&auml;chlich so einen Rechner 
rausbringt, so werden ihn die meisten Leute wohl nur als Konsole 
anerkennen, und schon hat der Amiga wieder das Image als Daddelkiste weg.
Wenn AMIGA tats&auml;chlich eine revolution&auml;re Kiste rausbringt, dann sollten 
sie diese auch als Profimaschine verkaufen, und nicht als Set-Top-Box oder 
Konsole.«


Klaus G. Schmitt gibt einen nicht uninteressanten Denkansto&szlig;: 

»Ich finde die Entw&uuml;rfe "etwas futuristisch", aber ich glaube schon, da&szlig; 
sie gut ankommen werden. Was mich mehr interessiert und nicht aus den 
Zeichnungen hervorgeht, ist die Frage, ob da noch "Individualit&auml;t" 
gew&auml;hrleistet ist? Wenn wir heute 100 Classic-Amigas "ausstellen" ist fast 
jeder AMIGA ein Einzelst&uuml;ck aufgrund der individuellen Zusammenstellung der 
Hardware-Komponenten. Das kann nat&uuml;rlich auch eine "Behinderung" sein, wenn 
ein Programm durchaus nicht auf allen AMIGAs lauff&auml;hig ist. Diese 
Behinderung sollte mit dieser neuen AMIGA-Generation auf jeden Fall 
ausgeschlossen sein!«


Peter Drexler findet einen Teil der Entw&uuml;rfe gelungen, den anderen nicht:

»Manche Bilder schockieren, die Mehrzahl erfreut. Jetzt mu&szlig; nur bald mal 
was passieren, denn sonst ist jeder Zug abgefahren f&uuml;r AmigaNG.«


Ausf&uuml;hrlich &auml;u&szlig;ert sich Rene Wunderlich:

»Oh, die sehen alle sehr gut aus, aber einige erinnern mich leider an 
andere Hersteller, was ich nicht so gut finde. ;(

MAC hat es geschafft durch eine eigene Linie, und ich w&uuml;rde sagen, dass 
sollte AMIGA auch so versuchen.

01_kyoto.jpg, 03_audi_tt.jpg w&uuml;rde ich bevorzugen, ABER

02_kyoto.jpg, 06_techtonica.jpg, 17_starck.jpg
haben wahrscheinlich f&uuml;r AMIGA-Einsteiger einen gr&ouml;&szlig;eren Anreiz, weil es 
sich da um Komplettl&ouml;sungen handelt.

11_jetson.jpg, 05_techtonica.jpg, 28_frame.jpg
sehen sehr stark nach einem PSX-&auml;hnlichen Ger&auml;t aus, und das hei&szlig;t GAME 
console. ;(

Ich rechne damit, dass AMIGA im Spielebereich keinen Einfluss mehr hat und 
diesen Bereich nicht mit allen mitteln zu erobern versuchen sollte, sondern 
die Gewichtung mehr auf andere Gebiete legen sollte.
Denn s0ny und n1ntend0 sind "glaube ich" nicht mehr zu schlagen, mit der 
Power, die diese Ger&auml;te haben und haben werden. Wahrscheinlich wird in den 
n&auml;chsten Jahren kein Computer so schnell sein, geschweige denn das Angebot 
an Games, und so wie auf dem PC, dass man sich alle 2 Monate einen neuen 
Rechner kaufen m&uuml;sste, soll es ja auch nicht werden, ODER?
NEIN BLOSS NICHT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

Die Handhabung einfach, bunt, und praktich muss es sein, erweiterbar f&uuml;r 
bis zu 4 Jahre. ;)

Dann kommen auch neue USER und damit mehr Kaufkraft und mehr Geld, und mit 
Geld Werbung, daraufhin neue User, und dann so weiter.

Wenn es blo&szlig; so einfach w&auml;re, hahahahaha ;), aber IBM und microdoof zeigen 
es immer wieder, Werbung ist alles.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
