<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Neuester Stand der AMIGA-Hauptaktivit&auml;ten, dt. Version (Juni/Juli)

»Neuester Stand der Hauptaktivit&auml;ten
------------------------------------

Juni/Juli 1999

Aktivit&auml;ten/Pl&auml;ne:
Wir haben bereits ein neues B&uuml;rogeb&auml;ude f&uuml;r uns in San Diego gefunden und
werden aus dem Gateway Geb&auml;ude in ein separates Geb&auml;ude ziehen, um den
Zuwachs an Neueinstellungen unterbringen zu k&ouml;nnen.

Neue Mitarbeiter im Management
1. Wir haben Dave Curtis als Leiter f&uuml;r Objekttechnologie und
Dienstleistungen auf dem Gebiet der Transaktionen eingestellt. Dave war
einer der ersten Architekten von CORBA und hat schon bei Inprise (Borland),
der Object Management Group (OMG) und anderen Unternehmen gearbeitet, die
auf objektbezogene Technologie spezialisiert waren. Dave's Erfahrungen
werden uns sehr hilfreich bei der Einf&uuml;hrung transaktionaler
Objekttechnologie in das Amiga Betriebssystem sein.
2. Wir haben Dr. Jim Miller als Leiter der User Experience eingestellt. Jim
wird f&uuml;r alle User Interface Designs und Software Development
verantwortlich sein. Jim hat bereits Erfahrungen in Human Interaction
Groups bei Hewlett Packard un Apple Computers gemacht. Er ist eine
hochangesehene Pers&ouml;nlichkeit und in der nationalen und internationalen
User Interaction Gemeinde (UI) sehr bekannt.

Hauptentwicklungsprogramme:
1. OS3.5 - Das angestrebte Ver&ouml;ffentlichungsdatum ist der 21. August 99 bei
der Amiga Downunder Show in Australien. Wir werden mit
Amiga-Hardware-Entwicklerfirmen sprechen, um geeignete Hardware-Produkte
zur Zeit der Ver&ouml;ffentlichung des OS3.5 zu finden. Wir haben vor, mit einer
empfehlenswerten Hardware-Konfiguration herauszukommen sowie einer Liste
von qualifizierten Amiga Hardware Produkten f&uuml;r die Ver&ouml;ffentlichung des OS
3.5.
2. Amiga Soft Betriebsumfeld (Operating Enviroment - OE) Wir entwickeln
unser NG Betriebsumfeld inklusive Betriebssystem, User Interface und
einiges an revolution&auml;rer Softwarestruktur, auf die allerdings erst sp&auml;ter
detailliert eingegangen werden kann. Wir versuchen, die Betaversion im 3.
Quartal 99 herauszubringen, mit Abschlu&szlig; im 4. Quartal in diesem Jahr. Wir
ziehen auch die M&ouml;glichkeit in Betracht, Amiga Soft f&uuml;r die OS 3.5
empfohlenen Hardware Konfigurationen zu portieren. Wenn wir dies
verwirklichen k&ouml;nnen, wird es den Benutzern erm&ouml;glicht, das neue OE auf
Amiga-Konfigurationen mit PowerPC-Boards laufen zu lassen.
3. AmigaSoft Entwicklungssystem Die Ver&ouml;ffentlichung ist zusammen mit der
Betaversion des AmigaSoft Operation Enviroments Ver&ouml;ffentlichung geplant,
f&uuml;r das 3. Quartal 99
4. Amiga Multimedia Convergence Computer (MCC) Wir haben das
Industriedesign fertig und haben Kunststoff-Modelle angefertigt "Hard
Models" werden bereits auf der WOA und der AmiWest vorgestellt wir haben
erste Schaltpl&auml;ne des Systemboard-Designs fertig

Veranstaltungen und Gemeindeaktivit&auml;ten:
1. Wir hielten eine Telefonkonferenz mit Amiga-Presseleuten, um sie f&uuml;r
unsere Pl&auml;ne vorzubereiten
2. Wir haben alle Nominationen f&uuml;r die AAC Mitglieder bekommen. Wir werden
die top-nominierten Mitglieder zur Abstimmung n&auml;chste Woche bekanntgeben.
Die erste AAC Telefonkonferenz sollte in den n&auml;chsten 2 Wochen stattfinden.
3. Wir haben auf unserer Website verschiedene Amiga-Foren eingerichtet
4. Wir werden die World of Amiga in London Ende Juli sponsorn und auch
daran teilnehmen
5. Wir haben ebenfalls vor, die AmiWest Show Ende Juli zu unterst&uuml;tzen.
F&uuml;r planen bereits f&uuml;r die K&ouml;lner Messe und die Las Vegas Show im 
November.«

(Quelle: AMIGA)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
