<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Diverse Neuigkeiten
-------------------

1. Innovative k&uuml;ndigt neue Bildbearbeitung 'fxPAINT' an

****** PRESSRELEASE *******
PRESSRELEASE, 7.7.1999
FOR IMMEDIATE RELEASE

WAS IST FXPAINT ?
 fxPAINT ist eine neue, revolution&auml;re Bildbearbeitung f&uuml;r den AMIGA,
 die die neueste Technik (PPC, Grafikkarten) nutzen und ausreizen wird
 (mehr Informationen weiter unten). Eine erste vollst&auml;ndige                  
 Ver&ouml;ffentlichung auf CD ist noch f&uuml;r dieses Jahr (1999) vorgesehen. Wenn   
 Sie Geld sparen wollen, k&ouml;nnen Sie auch zum einmalig g&uuml;nstigen Preis eine  
 Vorbestellung machen.

F&Auml;HIGKEITEN - ALLGEMEIN
 fxPAINT ist eine stark erweiterte Bildbearbeitung f&uuml;r den AMIGA. Es        
 beherbergt die &uuml;blichen Malwerkzeuge, bietet aber noch eine ganze Menge    
 mehr. So k&ouml;nnen ganze Bereiche per Mausklick markiert werden, oder auch    
 Farbverl&auml;ufe eingef&uuml;gt werden. Dabei kann mit mehreren, nat&uuml;rlichen        
 Stiften gemalt werden, wie etwa Kreide, Filzstift, K&uuml;nstlerstifte, aber    
 auch einfach nur mit ausgeschnittenen Grafiken. Wie der Name schon sagt,   
 beschr&auml;nkt sich fxPAINT nicht auf das Zeichnen mit Farben oder             
 ausgeschnittenen Pinseln, sondern bietet auch eine ganze Reihe             
 hochqualitativeer Effekte. Dazu z&auml;hlen Standard-Effekte wie das &Auml;ndern von  
 Helligkeit, Kontrast oder der Gamma-Kurve genauso, wie Lichtquellen,
 Oberfl&auml;chen mit Lichtquellen, Gl&uuml;h- und Schatteneffekten, Verzerrungen,
 explosionsartige Supernovas, Wellen, usw. Auch Profi-Tools wie etwa        
 Gradations-Kurven und Matrizen fehlen nicht und er&ouml;ffnen eine Vielzahl an  
 M&ouml;glichkeiten.
 Eine weitere Besonderheit von fxPAINT ist der Realtime-Modus, in dem alle
 &Auml;nderungen an den Effekteinstellungen sofort wirksam und angezeigt werden.
 Lichtquellen etwa lassen sich direkt im Bild verschieben - in Echtzeit!    
 fxPAINT ist einem Layer-basierenden Malprogramm wohl am &Auml;hnlichsten,       
 entspricht einem solchen aber nicht direkt. Es wird direkt mit den         
 Effekten gezeichnet, wobei der Alpha-Channel (der volle 24Bit-Farbtiefe    
 haben kann) gleich ber&uuml;cksichtigt wird. Fehler k&ouml;nnen via mehrfachem Undo  
 und Redo ausgebessert werden. Nat&uuml;rlich eignet sich fxPAINT nicht nur zum  
 Bearbeiten bereits vorhandener Bilder, sondern auch zum Erstellen von      
 neuen Bildern. Feuer- und Fraktalgrafiken sind in wenigen Mausklicks       
 erstellt und Screens k&ouml;nnen (inkl. Vorschau) ebenfalls mit wenigen         
 Mausklicks "gegrabbt" werden.

EXTERNE GER&Auml;TE UND MODULE
 Die Unterst&uuml;tzung von Scannern und Digitizern sowie eine offene,           
 dokumentierte Plugin-Schnittstelle machen externe Programme &uuml;berfl&uuml;ssig.   
 F&uuml;r brilliante Ausdrucke stehen optimierte Routinen bereit, die sowohl das  
 printer.device als auch TurboPrint ansprechen k&ouml;nnen. fxPAINT beh&auml;lt dabei  
 voll das interne Multitasking ein, und auch w&auml;hrend dem Scannen kann       
 prinzipiell weitergearbeitet werden (obwohl die in der Regel CPU nicht     
 viel Zeit daf&uuml;r &uuml;ber hat).

INTERNE MODULE
 Wer viel mit Grafiken zu tun hat, und sich diese schon auf der Festplatte  
 stapeln, der wird sicherlich schnell den &Uuml;berblick verlieren. Auch hier    
 schafft fxPAINT Abhilfe, denn eine Bilddatenbank namens fxALBUM ist        
 bereits integriert. Ein &Uuml;bersichts-Ausdruck oder der direkte Import von    
 Bildern &uuml;ber diese Datenbank in fxPAINT ist m&ouml;glich. F&uuml;r das schnelle      
 Umwandeln zwischen Dateiformaten steht das Modul fxCONV bereit, da&szlig;        
 mehrere Verzeichnisse und/oder Dateien automatisiert konvertiert. Wenn Sie  
 f&uuml;r das WWW Grafiken erstellen wollen, und dann auf HTML-Imagemaps         
 zur&uuml;ckgreifen wollen, steht Ihnen fxIMAGEMAP zur Seite und binnen von      
 wenigen Minuten haben Sie auch anspruchsvollste ImageMaps erstellt.

DAS OBERFL&Auml;CHENSYSTEM
 fxPAINT verf&uuml;gt &uuml;ber eigene, interne BOOPSI-Klassen, die sich der          
 vorhandenen Hardware optimal anpassen. In jedem Fall ist die Oberfl&auml;che    
 von fxPAINT sehr "bebildert", d.h. durch kleine Bilder wird die Oberfl&auml;che  
 optisch aufgelockert und die Bedienung vereinheitlicht und vor allem       
 vereinfacht, was schneller zu Resultaten f&uuml;hrt. Auf Grafikkarten ist die
 Oberfl&auml;che sicher am Beeindruckensten, denn hier werden die Meisten        
 Oberfl&auml;chenelemente in 24Bit-Farbtiefe gezeichnet. Obwohl Sie sich         
 vermutlich sehr schnell in fxPAINT einarbeiten werden, sind die wichtigen  
 Schaltfl&auml;chen mit Bubble-Help versehen, die die Funktion kurz
 erkl&auml;ren bzw. bezeichnen. Kein heiteres Berufseraten mehr also! fxPAINT    
 pa&szlig;t sich zudem Ihrem Kentnissstand an, und bietet unterschiedliche Modi   
 f&uuml;r Anf&auml;nger, Fortgeschrittene und Experten.

FEATURES
 Geplante (und zum gro&szlig;en Teil bereits realisierte) Features sind:
   - Unterst&uuml;tzung von vorhandener Hardware
      Scanner (&uuml;ber ScanQuix)
      VLab und evtl. auch andere Video-Digitizer

   - Erzeugung neuer Bilder und Texturen als Grundfunktion
      Fraktale
      Feuer
      Screengrabber

   - Volle PPC-Unterst&uuml;tzung
      PPC-Unterst&uuml;tzung wurde von Anfang an ber&uuml;cksichtigt
      Unterst&uuml;tzung von WarpUP und PowerUP (ppc.lib)
      Offene PPC-Unterst&uuml;tzung erm&ouml;glicht theorethisch Unterst&uuml;tzung jedes
       (auch evtl. neuer) PPC-Treibersystems

   - Optimierte Druckfunktionen
      Unterst&uuml;tzung von TurboPrint
      Unterst&uuml;tzung der gew&ouml;hnlichen OS3.0-Treiber
      Unterst&uuml;tzung der neuen API von AmigaOS 3.5

   - 24 Bit-Alpha-Kanal
      Einfache Zuschaltung und Auswahl
      Volle Kontrolle &uuml;ber Transparenzeffekte
      getrennte Manipulation der Rot-, Gr&uuml;n- und Blau-Anteile

   - Offene und &ouml;ffentlich dokumentierte Plugin-Schnittstelle fxPLUGIN f&uuml;r
      Lade-Module
      Speicher-Module
      Effekt-Module
      Module f&uuml;r zus&auml;tzliche Funktionalit&auml;t

   - Umfangreiche Effekte und Spezialeffekte (EIN AUSZUG DARAUS!)
      Effekte werden in Echtzeit berechnet und angezeigt
      Effekte sind in Kategorien geordnet (-&gt; Schnelles Finden m&ouml;glich)
      Mosaik (ein Bild durch mehrere andere Bilder ersetzen)
      Bumpmapper mit umfangreichen Optionen (f&uuml;r Effekte wie in 'Candy     
       Factory')
      Lichteffekte (Lensflares, Explosionen, Supernovas)
      Verzerrungen (Seite knicken, Lightspeed, Erdbeben, Wellen)
      Durchrubbeln von Bildern
      Zeichnen auf Oberfl&auml;chen
      Gl&uuml;h- und Schatteneffekte
      umfangreiche M&ouml;glichkeiten zur Bildretouche
      umfangreiche Funktionen zur Nachbearbeitung von gescannten Bildern
      &Ouml;l-Gem&auml;lde, Button-Rand (f&uuml;r 3D-Buttons)
      Matrix-Operationen (Konvolution, Emboss)
      Gradationskurven zur optimalen Regelung von Helligkeits-Verteilungen
      MinMax - verwandeln Sie blasse Bilder in Bilder mit leuchtenden      
       Farben
      Posterisieren, Farbe ersetzen (auch graduell), RGB-Verschiebungen
      Einf&auml;rben, Explosionseffekt
      Collage-Funktion mit Maskierung und Gl&uuml;h- und Schatteneffekten
      Interlace und Deinterlace zur Videonachbearbeitung
      Invertieren und logische Funktionen
      Spiegelungen, Pixelise, Zerstreuen, Zerspr&uuml;hen, Rauschen, isolierte  
       Pixel entfernen
      Weichzeichnen, Median, Zoom-Weichzeichner
      selektiver Gauss-Weichzeichner (zur professionellen Nachbearbeitung  
       von digitalisierten Videobildern)
      Anti "rote Augen", Antik, Schwarzwei&szlig;
      Kontrast-, Helligkeits, Gamma-, Rot-, Gr&uuml;n-, Blau-Korrektur
      14 unterschiedliche Dithering- und Farbreduktions-Verfahren f&uuml;r alle  
       Lebenslagen
      ..

   - umfangreiche Zeichenwerkzeuge
      Zauberstab(Magic Stick/Pantograph)-Funktion
      Farbverl&auml;ufe als Grundzeichenwerkzeug
      Verschmierungs- und Verwischungs-Werkzeug
      &uuml;bliche Grundwerkzeuge

   - integrierte Bildverwaltung fxALBUM
      Schnelle Katalogisierung von Bildbest&auml;nden
      direkte Verwebung mit fxPAINT und somit optimale                     
       Bearbeitungsm&ouml;glichkeiten
      Drucken von &Uuml;bersichten
      Organisation in Katalogen

   - integrierter Miniconvert fxCONV
      Konvertierung von mehreren Verzeichnissen voll von Bildern m&ouml;glich
      Konvertierung von einem zu einem beliebigen Format, da&szlig; von fxPAINT  
       unterst&uuml;tzt wird

   - Komplett neue Bibliothek von Lade- und Speichermodulen
      hochoptimiert
      lesen/schreiben von Formaten, wie etwa ILBM, PCX, BMP, TARGA, JPEG,   
       YUVN, PCD, LJPG, PNM, RGB8, ...

   - PhotoCD(tm)-kompatibel
      Verwalten, ansehen, katalogisieren von PhotoCDs via fxALBUM
      hochoptimierter, schneller Loader

   - Eigenes Oberfl&auml;chen-System
      Realisierung als systemkonforme BOOPSI-Objekte
      24Bit Oberfl&auml;chen-Elemente und Farbverl&auml;ufe
      Oberfl&auml;che durchgehend "bebildert"
      Bubble-Help f&uuml;r einfache Erlernung
      Drei unterschiedliche Erfahrungsgrade, nach denen sich fxPAINT       
       richtet
      Automatisches Fixieren von Fensterpositionen
      Keine Hacks, Patches, etc.

   - ARexx-Unterst&uuml;tzung
      Verbinden Sie fxPAINT mit allen Ihren Programmen!

   - Systemanforderungen
      Minimal
       + AmigaOS 3.x
       + CPU: 68020
       + RAM: 6 MB
       + 10 MB Festplatte

      Empfohlen
       + AmigaOS 3.x
       + CPU: 68040/060
       + RAM: 16 MB
       + 10 MB Festplatte

      Perfekt
       + AmigaOS 3.x
       + CPU: 68040/060 und PPC
       + RAM: 32 MB oder mehr
       + 20 MB Festplatte

   - Preis und Vertrieb
      Endpreis bei Ver&ouml;ffentlichung: 139 DM/70 EURO
       (JETZT VORBESTELLEN UND 40 DM SPAREN!!)
      Innovative wird den Vertrieb von fxPAINT selbst &uuml;bernehmen. Die
       Auslieferung erfolgt aller Vorraussicht nach auf CD-ROM.
      H&auml;ndleranfragen sind erw&uuml;nscht (Anfragen bitte an: sales@innovative-  
       web.de)
      Vorbestellungen m&ouml;glich (siehe auch weiter unten)

VORBESTELLUNGEN
 Wer heute vorbestellt, spart bares Geld und erh&auml;lt eine Menge von          
 Vorteilen:
  - Vorbestellpreis: 99 DM/50 EURO
    (SIE SPAREN 40 DM/20 EURO!!)
  - inkl. ein kostenloses Update via Internet
  - Sie kommen als erste(r) in den Genu&szlig; von PPC-Power und Spezialeffekten!
  - Sie motivieren uns, die Entwicklung noch mehr voranzutreiben, und die   
    Leistung noch weiter zu erh&ouml;hen!

WEITERE INFORMATIONEN UND SCREENSHOTS
 .. finden Sie auf unserer komplett neugestalteten Website
    unter http://www.innovative-web.de/

--
Innovative
c/o Felix Schwarz
Am Gr&uuml;ndla 3
D-91074 Herzogenaurach
Germany

EMail: info@innovative-web.de
WWW: http://www.innovative-web.de/
Phone: +(0)049 (0)9132/3400


------ PRESSEERKL&Auml;RUNG ------
PRESSRELASE, 14.7.1999
FOR IMMEDIATE RELEASE

INNOVATIVE GIBT WEITERE fxPAINT-DETAILS BEKANNT
Nach der Flut an Anfragen und Fragen bzgl. fxPAINT haben wir uns dazu 
entschlossen, eine Liste der am H&auml;ufigsten gestellten Fragen (FAQ) 
zusammenzustellen. Sollten noch Fragen offen bleiben, scheuen Sie sich 
nicht, uns eine EMail an info@innovative-web.de zu schicken. Wir brauchen 
Ihr Feedback!

Frage:   Wann wird fxPAINT verf&uuml;gbar sein ?
Antwort: Der Zeitplan f&uuml;r fxPAINT sieht eine Ver&ouml;ffentlichung sp&auml;testens    
         auf der K&ouml;lner Messe im November 1999 vor.

Frage:   Wieviel von fxPAINT ist bereits fertiggestellt ?
Antwort: Alle in der Ank&uuml;ndigung zu fxPAINT genannten Features sind bereits  
         vollst&auml;ndig implementiert. Einzig und allein die                   
         Druckerunterst&uuml;tzung f&uuml;r OS 3.5 ist noch in Arbeit. Die Features   
         von fxPAINT werden sich allerdings bis zur Ver&ouml;ffentlichung im     
         November noch erheblich mehren. Der gr&ouml;&szlig;te Teil der Arbeit ist     
         allerdings bereits abgeschlossen.

Frage:   Kann ich eine Beta-Version erhalten ?
Antwort: Wir verf&uuml;gen bereits &uuml;ber eine Reihe an hochqualifizierten         
         Betatestern, die beruflich professionell Grafiken anfertigen und   
         sich daher sehr gut als Betatester eignen und sehr zur             
         Professionalit&auml;t von fxPAINT beitragen.

Frage:   Ich habe fxPAINT zwar schon bestellt, aber noch keine              
         Best&auml;tigungsemail erhalten.
Antwort: Bitte wenden Sie sich in diesem Fall direkt an 
         order@innovative-web.de und geben Sie Ihre vollst&auml;ndige Anschrift  
         durch.

Frage:   Wie lange kann ich noch zum Vorbestellungspreis bestellen ?
Antwort: Der Vorbestellungspreis gilt vorraussichtlich f&uuml;r Bestellungen bis
         1. November 1999. Sollte fxPAINT fr&uuml;her fertiggestellt werden,     
         kann die Frist allerdings durchaus herabgesetzt werden. Bedenken   
         Sie auch, da&szlig; die Bestellungen bei uns nach der Reihenfolge des    
         Eingangs abgewickelt werden, Sie also schneller zu der Vollversion  
         kommen, umso fr&uuml;her Sie bestellen.

Frage:   Wie genau wird WarpUP unterst&uuml;tzt ? Etwa &uuml;ber die ppc.lib-         
         Emulation ?
Antwort: Nein. fxPAINT erkennt von selbst, ob es unter WarpUP oder der      
         ppc.lib l&auml;uft und startet einen entsprechenden Servertask, der     
         nativ, also ohne Emulation, unter dem jeweiligen Treibersystem     
         l&auml;uft.

Frage:   Ist eine Windows-Version geplant ?
Antwort: Nein.

Frage:   Ist fxPAINT ein Ersatz f&uuml;r Ultraconv ? Wird Ultraconv eingestellt?
Antwort: Nein. fxPAINT ist ein eigenst&auml;ndiges Produkt, da&szlig; quasi keinen     
         Sourcecode mit Ultraconv teilt. Es handelt sich um eine komplette  
         Neuentwicklung. Ultraconv wird auch in Zukunft weiterentwickelt    
         werden.

Frage:   Werden auch Histogramme unterst&uuml;tzt werden ?
Antwort: Ja.

Frage:   Wird es eine Demo-Version von fxPAINT geben ?
Antwort: Dar&uuml;ber wurde noch keine Entscheidung gef&auml;llt. Sollte es eine      
         geben, wird sie auf unserer Website zum Download bereitstehen.

--
Innovative
c/o Felix Schwarz
Am Gr&uuml;ndla 3
D-91074 Herzogenaurach
Germany

EMail: info@innovative-web.de
WWW: http://www.innovative-web.de/
Phone: +(0)049 (0)9132/3400

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
