<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Beim letzten Mal hatten 56 Teilnehmer mitgemacht, damit ist die Zahl im 
Vergleich zum Gewinnspiel der Juni-Ausgabe konstant geblieben.

Bevor wir zur Aufl&ouml;sung kommen, noch ein Hinweis: In dieser Ausgabe von 
AMIGA aktuell gibt es ausnahmsweise noch eine zweite Verlosung! Im 
Spieleteil werden zwei Vollversionen des Weltraum-Action-Strategiespiels 
Phoenix vergeben!


Jetzt aber zur Aufl&ouml;sung:


Standard-Frage: Wann soll die Version 1.0 des in Entwicklung befindlichen   
                WWW-Browsers aMozillaX erscheinen?

Antwort: Sie sollte zur World of Amiga, die am 24. und 25. Juli in London   
         stattfand, erscheinen, ist es aber leider nicht.


Master-Frage: Ist geplant, bereits die Version 1.0 von aMozillaX mit        
              JavaScript-Support auszustatten?

Antwort: Das war offenbar eine besonders knifflige Masterfrage, denn nicht  
         viele von euch wussten die richtige Antwort. Nein, 'nein' war eben  
         nicht korrekt! Denn die immer noch weit verbreitete These, 'Java'  
         sei dasselbe wie 'JavaScript', ist nicht wahr, es handelt sich um  
         zwei vollkommen unterschiedliche Sprachen.
         Dagegen ist das in den aMozillaX-Spezifikationen aufgef&uuml;hrte       
         'ECMAScript' eine abw&auml;rtskompatible JavaScript-Weiterentwicklung,  
         so da&szlig; die Masterfrage mit 'ja' zu beantworten war.


Meinungsfrage: Sollte es aus deiner Sicht nach Erscheinen des AmigaOS 3.5   
               noch weitere Updates des Classic-Amiga-Betriebssystems       
               geben?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
1 (Ja.)                                                                  43  
2 (Nein.)                                                                12  
                                               
Einer der Teilnehmer konnte sich nicht entscheiden.


Einige Einsender haben zu ihrer Beantwortung der Masterfrage Stellung 
genommen:

Andreas Garthof meint: »Ein PPC-natives AmigaOS w&auml;r was Feines...!«

André Greif begr&uuml;ndet seine ablehnende Haltung wie folgt: »Wenn schon 
Neuanfang, dann Neuanfang mit Schwung, denn den werden wir brauchen. Wenn 
die neue Technologie wirklich so revolution&auml;r wird wie angek&uuml;ndigt, wird es 
wohl kaum einen Amiga-Fan geben, der sie nicht haben will. :-)«

Kilian Servais spricht sich f&uuml;r weitere Updates aus: »Alles andere w&auml;re 
verdammt t&ouml;dlich; alternativ w&auml;re es gut, wenn man das neue OS an den PPC 
anpassen w&uuml;rde...«

Andreas Falkenhahn ist zwar f&uuml;r weitere Updates, aber skeptisch: »Ja auf 
jeden Fall (aber es wird wohl keine mehr geben, da sich so was kaum 
finanzieren l&auml;sst, bei der geringen Anzahl der K&auml;ufer! Ich w&uuml;rde mir mal 
ein richtiges Update w&uuml;nschen (neues ROM!!!). Das OS3.5 wird imho eh nur 
ein Pack mit bekannter Software unter neuem Namen...)

Marko Koscak &auml;u&szlig;ert sich wie folgt: »Ja, denn ich glaube, dass die n&auml;chste 
Amiga-Generation noch auf sich warten lassen wird. Aber ich glaube, dass 
sie kommen wird!«

Von Wolf Zimmer kommt ein 'Nein' mit folgender Begr&uuml;ndung: »In ganz kurzer 
Zeit gibt es nur noch PD-Software von Jugendlichen, die veraltete Maschinen 
betreiben. Warum also mit einem Rolls Royce zum Br&ouml;tchenholen fahren? Die 
Profis steigen doch alle auf die NG-Amigas um, sollten sie kommen.«

F&uuml;r Michael Alzheimer ist der Fall klar: »In jedem Fall sollen weitere 
Updates erfolgen, soweit es die Performance der einzelnen Prozessoren 
zul&auml;sst. In jedem Falle sollte es weitere Updates f&uuml;r m68k + PPC geben.«

Marcus Castro konnte sich nicht entscheiden: »Kommt darauf an, wie gut der 
neue Amiga wird. Wenn das wieder eine HighEnd-DaddelKiste wie der A500 
wird, dann bleib ich nat&uuml;rlich beim Classic Amiga - dann m&ouml;glichst mit 
einem aktuellen OS. Wenn das Teil allerdings so gut wird wie angegeben, und 
immer noch eine leicht durchschaubare und programmierbare (Scripts) 
Workbench hat, dann sollten die Energien auf diesen gesetzt werden, und der 
Classic Amiga den Freaks &uuml;berlassen werden.«


Fazit:
------

Das Ergebnis ist eindeutig. Eine &uuml;berw&auml;ltigende Mehrheit w&uuml;nscht sich 
weitere Versionen des Classic-Amiga-Betriebssystems. Interessant fand ich 
im Nachhinein nur die Gruppierung der Einsendungen: Denn die ersten sieben 
Teilnehmer sprachen sich mit 5 zu 2 Stimmen gegen weitere Updates aus.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Schnittstellenkarte "Hypercom 3+": Daniel Stein
1 x Wildfire 5 PPC (engl. Handbuch): Johannes Geiss
1 x Wildfire 5 (engl. Handbuch): Andreas Koch
1 x Vollversion von "AFiloFaxPro": Stefan Klein
1 x Vollversion von "Diamond Caves II": Stephan Manske
1 x Vollversion von "Sharks!": Peter Schleier


Herzlichen Gl&uuml;ckwunsch!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
