<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Amiga PowerPC & AmigaNG-Konkurrenzsysteme
-----------------------------------------

1. Beta-Tester f&uuml;r QNX-Umsetzung gesucht

Als QNX am 8. Juli einen Aufruf an potentielle Beta-Tester ver&ouml;ffentlichte, 
sah es noch ganz so aus, als ob sich das Betriebssystem des AmigaNG seiner 
Fertigstellung n&auml;here. An jenem Tag hatte wohl niemand in der Amiga-
Gemeinde geahnt, dass dies keine mit AMIGA abgestimmte Aktion gewesen ist, 
sondern sich das Unternehmen bereits f&uuml;r einen Linux-Kernel als Basis f&uuml;r 
die neue Amiga-Betriebsumgebung entschieden hat.

»Einhaltung unseres Versprechens an die Amiga&#174; Gemeinde

Dan Dodge
CTO und Gr&uuml;nder von QNX Software Systems

Letztes Jahr im November auf der Computer '98 Show in K&ouml;ln versprach ich,
da&szlig; QNX ein fortschrittliches Betriebssystem ausliefern w&uuml;rde, welches
Amiga wieder an die Technologiespitze heben w&uuml;rde. In den letzten sieben
Monaten hatten wir ein Team von &uuml;ber 40 Entwicklern damit besch&auml;ftigt
dieses Versprechen einzuhalten und die Vision zur Realit&auml;t werden zu
lassen. Nun sind wir mit unserer Entwicklung im Endstadium und somit in
der Lage, diese neue Technologie in die H&auml;nde von Tausenden von
ernsthaften, enthusiastischen Entwicklern zu legen.

QNX wird oft mit UNIX, LINUX und BSD verglichen. Wir benutzen die gleichen
POSIX API's und der meiste Quellcode, der f&uuml;r diese Systeme geschrieben
wird, kann recht einfach nach QNX portiert werden - aber hier ended auch
schon die &Auml;hnlichkeit. Basierend auf einer 20j&auml;hrigen Erfahrung mit
Betriebssystemen hat QNX eine von Grund auf andere Architektur. QNX ist
ein extrem skalierbares, multi-threaded, fehlertolerantes
Echtzeitbetriebssystem, das f&uuml;r Ger&auml;te und Computer jeder Gr&ouml;&szlig;e und jeden
Types entwickelt wurde. QNX besitzt eine einzigartige Netzwerkarchitektur,
bei der nicht auf jedem Rechner gro&szlig;e, umfassende Protokollstacks ben&ouml;tigt
werden. Neu an das Netzwerk angeschlossene Ger&auml;te, werden einfach
automatisch von anderen Ger&auml;ten im Netzwerk "erkannt" und alle Dienste und
Peripherien dieser neuen Komponete k&ouml;nnen von jedem anderen Ger&auml;t im
Netzwerk genutzt werden. Weiterhin ist QNX das einzige Self-hosted
Echtzeitbetriebssystem, auf dem die Entwicklungsumgebung und die
Target-Umgebung zur Laufzeit ein und dieselbe ist. Und obwohl QNX nicht
Open-Source ist, haben wir eine "Open-Source"-Police f&uuml;r
hardware-spezifische Treiber. Dieses erlaubt uns einen kontinuierlichen
Support der neuesten Hardware bei gleichzeitiger Pflege unserer
Kernel-Technologie. Eine noch wichtigere Eigenschaft dabei ist, da&szlig; QNX
seinen Focus garantiert auf zuk&uuml;nftige Perspektiven konzentriert.

Wenn Sie sich bisher noch nicht unsere Webseiten angesehen haben, laden wir
Sie hiermit ein mehr &uuml;ber das QNX Echtzeitbetriebssystem und Photon
microGUI&#174; zu erfahren. F&uuml;r den Fall, da&szlig; Sie etwas tiefer in die Materie
einsteigen m&ouml;chten, k&ouml;nnen Sie sich einige Screenshots der neuen,
atemberaubenden lock-and-feel Oberfl&auml;che f&uuml;r Photon ansehen (f&uuml;r einen
gr&ouml;&szlig;eren Bildausschnitt klicken Sie unten bitte auf das jeweilige Image).
Weiterhin finden Sie das neue QNX Neutrino System Architektur Handbuch
online auf unserem Server.

Kurz zusammengefa&szlig;t, QNX ist der Kernel und Photon die grafische Oberfl&auml;che
f&uuml;r unsere neue Betriebssystembasis:

QNX - Unterst&uuml;tzt POSIX Threads, MMU-gesch&uuml;tzten Speicherbereich f&uuml;r alle
Applikationen und Treiber, viele verschiedene Filesysteme (QNX, Flash,
DOS, CD/DVD-ROM, etc.), TCP/IP, transparent verteiltes Netzwerk und
Entwicklungsbibliotheken.

Photon microGUI - Komplettes Windowing System mit voller
Unicode-Unterst&uuml;tzung f&uuml;r intergrierte Internationalisierung. Weiterhin
enthalten ist ein visueller Application Builder (PhAB), eine
leistungsstarke Entwicklungsumgebung (verschiedene Bibliotheken, &uuml;ber 50
Widgets, integrierter Image-Support, Online Dokumentation, etc.), Web
Browser, Multimedia Player, 3D Grafik und Unterst&uuml;tzung f&uuml;r Spiele.

Obwohl Photon eine einzigartige neue grafische Oberfl&auml;che repr&auml;sentiert,
arbeitet es nahtlos mit bereits existierenden Windowing Systemen zusammen.
Sie k&ouml;nnen z.B. von einem Windows Desktop eine Verbindung zu einem Photon
Desktop aufbauen oder umgekehrt von einem Photon Desktop auf einen Windows
Desktop zugreifen. Und weil eine gro&szlig;e Anzahl existierender Sourcen das
X-Window System nutzen, erm&ouml;glichen wir Entwicklern Ihre Applikation f&uuml;r
X-Window zu kompilieren und anschlie&szlig;end diese Applikation unter Photon
laufen zu lassen.

QNX Developers Network f&uuml;r Amiga-Benutzer

Um diese Technologie an Amiga-Entwickler weiterzugeben, haben wir die QNX
Developers Network for Amigans ins Leben gerufen. Qualifizierte
Amiga-Entwickler werden - kostenlos - ein komplettes
Beta-Entwicklungspaket erhalten, welches das QNX Echtzeitbetriebssystem,
eine Reihe von neuesten Multimedia Technologien, die einzigartige
netzwerk-transparente Photon microGUI und eine Self-hosted
Entwicklungsumgebung enth&auml;lt. Wir werden au&szlig;erdem eine engagierte Online
Newsgroup sowie eine eigene Webseite einrichten, um die jeweils neuesten
technologischen Updates bereit zu stellen und Vorschauen zu
ver&ouml;ffentlichen.

Anf&auml;nglich suchen wir interessierte Beta-Tester, die vorhandene
Applikationen portieren oder neue Appliaktionen entwickeln. Firmen oder
einzelne Entwickler sind herzlich eingeladen an unserem Programm
teilzunehmen - die einzige Bedingung ist Engagement. Wir wollen aktive
Beta-Tester - keine m&uuml;den Mitl&auml;ufer - die uns ein aktives und wertvolles
Feedback versprechen.

Sicherlich mu&szlig; Engagement aus beiden Richtungen kommen. So wollen wir
zus&auml;tzlich zu unserem Programm ab jetzt aktiv und stimmhaft in allen
angemessenen Newsgroups und Magazinen vertreten sein. Wir freuen uns als
ein aktives Mitglied in der Amiga-Gemeinde mitwirken zu k&ouml;nnen und eng
verbunden mit Amiga-Mitgliedern zusammen zu arbeiten, um die n&auml;chste
Revolution in der Multimedia Branche zu initieren.

Anf&auml;ngliches Release

Unser anf&auml;ngliches Beta-Release wird f&uuml;r x86-Rechner sein. Viellleicht mag
die Entscheidung f&uuml;r diese Hardware-Plattform f&uuml;r einige zuerst
unerw&uuml;nscht klingen, geben wir doch zu bedenken, da&szlig; die meisten QNX
Applikationen und Treiber identischen Quellcode f&uuml;r alle CPU's und
Mainboards besitzen. Jede Applikation und jeder Treiber die f&uuml;r x86er
entwickelt werden, k&ouml;nnen jedoch sehr einfach auf andere unterst&uuml;tzte
Plattformen gebracht werden. Wir haben die x86-Plattform auch einfach
deshalb gew&auml;hlt, weil es zur Zeit die am weitesten verbreitete
Hardware-L&ouml;sung mit geringen Kosten ist und wir die erste Beta-Version
ver&ouml;ffentlichen wollen - im Herbst.

Sind Sie interessiert?

Wenn Sie interessiert sind und an unserem Programm QNX Developers Network
for Amigans teilnehmen m&ouml;chten, klicken Sie bitte hier, um das
Anmeldeformular auszuf&uuml;llen. Sollten Sie noch weitere Fragen haben,
schicken Sie uns eine
Email: amiga@qnx.com

Wenn Sie oder Ihre Firma gegenw&auml;rtig schon Applikationen haben, die
portiert werden sollen, sind Sie gerne eingeladen sich direkt mit der
Abteilung f&uuml;r Strategische Allianzen der QNX Software Systems Ltd. in
Verbindung zu setzen.
Email: amiga-ports@qnx.com, Tel.: +1 613 591-0931.«

(Quelle: QNX)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
