<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

&Uuml;ber den Erfolg eines Produkts entscheidet nicht nur dessen Technologie

Auf der K&ouml;lner Messe im November letzten Jahres, drei Monate vor Abl&ouml;sung 
Jeff Schindlers als Chef der Amiga-Entwicklungsabteilung, hat das 
Unternehmen eine Kooperation mit dem damals f&uuml;r die Amiga-Anwender noch 
vollkommen unbekannten QNX Software Systems Ltd. geschlossen, die die 
Schaffung eines neuen Betriebssystems f&uuml;r den geplanten 'Amiga der n&auml;chsten 
Generation' vorsah. Nach Bekanntgabe der Entscheidung tauchten Ger&uuml;chte 
auf, QNX sei nur eine notgedrungene Alternative gewesen, Amiga, Inc. h&auml;tte 
sich vielmehr zu einer Kooperation mit BeOS entschlossen, die jedoch in 
letzter Minute gescheitert sei. Wieder andere Spekulationen gingen in die 
Richtung, dass die Entwicklungsabteilung nur deshalb eine Zusammenarbeit 
mit QNX vereinbart hatte, weil die Kritik &uuml;ber den offensichtlichen 
Stillstand der damaligen Zeit in der Amiga-Gemeinde immer lauter wurde.

Sei es, wie es ist, QNX wurde ausgew&auml;hlt und die Amiga-Gemeinde jubelte - 
scheinbar zurecht: Die Spezifikationen lasen sich hervorragend, ein 
Echtzeit-Betriebssystem dieses Herstellers schien ideal zur Amiga-
Philosophie zu passen - das dachte sich vermutlich auch Jeff Schindler.
Damals hatte jeder von uns die Technologie, niemand jedoch die - im 
Computergewerbe extrem wichtige - Marktlage ber&uuml;cksichtigt, auch der 
damalige Chef der Entwicklungsabteilung offensichtlich nicht.

Der jetzige AMIGA-Pr&auml;sident Jim Collas war zuvor Senior Vice President bei 
Gateway und hatte damit eine sehr hochrangige Position inne, bei der es 
nicht allein auf technisches Wissen ankam: Jim Collas f&uuml;hrte eine wichtige 
Abteilung eines gro&szlig;en Computerunternehmens, musste daf&uuml;r somit auch 
Manager-, sprich betriebswirtschaftliche, Qualit&auml;ten besitzen. 
Wie wir jetzt wissen, ist sich der AMIGA-Pr&auml;sident einer grundlegenden 
Tatsache bewusst: Ob sich ein Produkt durchsetzt, h&auml;ngt nicht nur - 
vielleicht sogar am wenigsten - von dessen Qualit&auml;t, sondern von einer 
Vielzahl weiterer Faktoren ab. Im Prinzip sollte dies jedermann, der in der 
Computerbranche Verantwortung tr&auml;gt, klar sein - das beste Beispiel ist 
doch das Unternehmen eines gewissen Bill G., der auf dem Markt f&uuml;r 
Computersoftware nahezu ein Monopol besitzt, obwohl dessen Programme nach 
&uuml;berwiegender Einsch&auml;tzung im Allgemeinen kaum das Mittelma&szlig; &uuml;berschreiten.

Jim Collas hatte zwei Alternativen:

a) AMIGA bleibt bei der winzigen Firma QNX mit dem m&ouml;glicherweise besseren 
Kernel bzw. Betriebssystem, f&uuml;r das es jedoch so gut wie keine 
Softwareunterst&uuml;tzung gibt, so dass erst ein Markt daf&uuml;r geschaffen werden 
m&uuml;sste. Wie schwierig ein solches Unterfangen jedoch ist, kann jeder Amiga-
Anwender am Beispiel Amiga-PowerPC nachvollziehen: Die PowerUp-Karten haben 
sich (neben anderen Gr&uuml;nden) deshalb so schlecht verkauft, weil es kaum 
Umsetzungen qualitativ hochwertiger Programme gab - und die gab es nicht, 
weil sich die PowerUp-Karten so schlecht verkauften.
W&auml;re AMIGA bei QNX geblieben, h&auml;tte es gewaltige Anstrengungen unternehmen 
m&uuml;ssen, um eine ausreichende Anzahl von bekannten Softwareherstellern zu 
&uuml;berzeugen, ihre Programme f&uuml;r das neue Amiga-Betriebssystem umzusetzen. In 
Zeiten aber, wo die meisten Hersteller schon drei, f&uuml;nf oder mehr 
Betriebssysteme unterst&uuml;tzen, w&auml;re der &uuml;berwiegenden Anzahl von Firmen der 
Support f&uuml;r ein weiteres Nischensystem, um das es sich zumindest anfangs ja 
gehandelt h&auml;tte, kaum zu vermitteln gewesen.
Ohne eine ausreichende Softwarebasis wiederum w&auml;re zwar eventuell die 
Mehrzahl der Amiga-Anwender zum AmigaNG &uuml;bergewechselt, vielleicht auch 
einige User anderer alternativer Plattformen, aber kaum eine gr&ouml;&szlig;ere Masse 
von Linux-, Mac- und unzufriedenen Windows-Anwendern - selbst nicht bei 
deutlicher &Uuml;berlegenheit der Hard- und Software des AmigaNG.

b) AMIGA wechselt zu einem Linux-Kernel, obwohl dies m&ouml;glicherweise eine 
etwas weniger individuelle und revolution&auml;re Betriebsumgebung zur Folge 
h&auml;tte (was sich ja erst noch herausstellen muss). Daf&uuml;r jedoch steht dem 
Computersystem die gro&szlig;e Welt an Linux-Programmen und - vielleicht noch 
wichtiger - Hardwaretreibern zur Verf&uuml;gung, die sich ohne gro&szlig;en Aufwand an 
den AmigaNG anpassen lassen - vom riesigen Potential an Linux-Entwicklern 
ganz zu schweigen.
Damit f&auml;llt es den Softwareherstellern wesentlich leichter, sich zu einer 
Unterst&uuml;tzung des AmigaNG durchzuringen, als dies bei Verwendung des QNX-
Kernels der Fall w&auml;re - ein erster Hinweis darauf ist die Bekanntgabe der 
Zusammenarbeit zwischen AMIGA und Corel, die bei Nutzung von QNX sicherlich 
nicht zustande gekommen w&auml;re.


Beide Alternativen auf einen Punkt gebracht: 

a) AmigaNG &lt;=&gt; ein Computersystem mit starker Individualit&auml;t, aber nur 
geringen Marktchancen

b) AmigaNG &lt;=&gt; ein Computersystem mit (m&ouml;glicherweise) weniger 
Individualit&auml;t, aber deutlich besseren Marktchancen

Der AMIGA-Pr&auml;sident hat sich f&uuml;r letzteres entschieden, und das kann ich 
pers&ouml;nlich sehr gut nachvollziehen. Sicherlich gibt es auch Amiga-Anwender, 
die die geringeren Erfolgschancen eines QNX-Amigas wegen dessen st&auml;rkerer 
Individualit&auml;t in Kauf genommen h&auml;tten - diese k&ouml;nnen sich ja f&uuml;r das von 
Phase 5 angestrebte Konkurrenz-Computersystem entscheiden (sollte es auf 
den Markt kommen), sollten sich jedoch sp&auml;ter nicht beklagen, wenn es ein 
Nischen-Dasein f&uuml;hrt wie heute der Classic-Amiga, ohne ein breites Angebot 
an attraktiver Hard- und Software.


Damit bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
