<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Vorwort
----------

Hi!

Herzlich willkommen zum AMIGA aktuell Spieleteil mitten im Sommerloch,
auch wenn von diesem keine Spur zu sehen ist, denn diese Ausgabe haben
wir Reviews von Wasted Dreams, Moonbases, Superfrog, Civilization II,
Pirates Gold, Exile III und Doktor 1.1. Au&szlig;erdem gibt es ein Interview
mit Jens Neubauer, dem Programmierer von Seaside. Doch das soll nicht
alles gewesen sein: Diesen Monat gibt es au&szlig;erdem noch eine Mac-Ecke
von Andreas Koch, einen Kommentar zum Napalm Spieletest von Ioannis
Nikitopoulos, ein Preview zu The last Seal, ein Gewinnspiel und nat&uuml;rlich
die restlichen News.

Wer sich gewundert hat, dass im Spieleteil Sachen wie Civilization II
getestet werden, welches es ja gar nicht f&uuml;r den Amiga gibt, dem sei
gesagt, dass Andreas Koch nun im AMIGA aktuell Spiele die Mac-Ecke
pr&auml;sentiert. Da dies auch Arbeit macht, sucht er noch nach einigen
Leuten, die ihm dabei helfen. Lest deshalb auch seinen Aufruf in der
Mac-Ecke. 

Nun haben wir sogar unser eigenes Gewinnspiel im Spieleteil. Der APC&TCP
hat zwei Exemplare seines Spieles Phoenix zur Verf&uuml;gung gestellt
und bittet um rege Teilnahme. Also, macht mit!
 
Diesen Monat gibt es versp&auml;tet noch einen Napalm-Test Kommentar
von Ioannis Nikitopoulos, der eigentlich schon fr&uuml;her h&auml;tte ver&ouml;ffentlicht
werden sollen. Entschuldigung nochmal, Ioannis!

Au&szlig;erdem hat mich Crusaderluechow gebeten, zu ver&ouml;ffentlichen, dass
er noch die Codeabfragen f&uuml;r folgende Spiele sucht (aus welchem
Grund auch immer): Das schwarze Auge, Der Clou, Burntime, Erben des
Throns und PGA Tour Golf. Wer dazu was da hat, kann sich direkt
an ihn &lt;Crusaderluechow@t-online.de&gt; oder an mich wenden.

Nach meinem Aufruf in der letzten AMIGA aktuell kamen tats&auml;chlich
ein paar E-Mails herein. Es war zwar nicht der Renner, aber etwas
Feedback war schon da. Viele baten mich, doch mal die Release Liste
zu entstauben. Dies habe ich gemacht. Das ganze wurde neu gegliedert
und alle Spiele, von denen man nichts mehr h&ouml;rt, stehen jetzt in einer
Extra Rubrik. Au&szlig;erdem stehen auch alle AmigaNG Spiele jetzt in
einer Rubrik. 

Eigentlich wollte ich diese Ausgabe auch noch Reviews zu Wet, 
Speccy 99 und The Prophet bringen. Leider hat mir die Zeit mal wieder
einen Strich durch die Rechnung gemacht, so dass ihr die Reviews
erst n&auml;chste Ausgabe lesen k&ouml;nnt. Aber ich denke, diese Ausgabe
gibt`s gen&uuml;gend Stoff zum Lesen. Die Charts konnten diesen Monat
nicht aktualisiert werden, da keine neuen bekanntgegeben wurden.
Auch die Neuheiten im Aminet sind nicht ganz komplett, da mal
wieder die Mailingliste ausgefallen ist.

So, dann viel Spa&szlig; mit dieser Ausgabe,
 
Andreas
(Andreas.Falkenhahn@gmx.de)

(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)

P.S.: Vergesst nicht euch den Aufruf in der Mac-Ecke durchzulesen
und Andreas Koch &lt;Andreas.Koch@rz-online.de&gt; Feedback zu schicken,
denn er hat sich wirklich viel Arbeit gemacht. 

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
