<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Review: Superfrog
--------------------

"Superfrog? Ist das ein neues Spiel?", werden jetzt garantiert sich
einige Amiga Benutzer fragen. Diese Frage l&auml;sst sich klar mit nein
beantworten, denn Superfrog ist schlicht einfach ein Spiel, welches
von Team 17 schon 1994 mit relativ gro&szlig;em Erfolg ver&ouml;ffentlicht wurde
und nun von Islona Entertainment nochmal neu auf CD-ROM ver&ouml;ffentlicht
wurde. Das Wort 'neu' kann man aber eigentich streichen, denn im Grunde
genommen ist die Ver&ouml;ffentlichung fast exakt dieselbe. Ich besitze
zuf&auml;llig auch noch die Original Team 17 Ver&ouml;ffentlichung (damals f&uuml;r
CD-32) und war mal so frei, beide Versionen zu vergleichen. Also hier
die Unterschiede zwischen beiden Versionen in der Zusammenfassung: Die
neue Version hat eine auf das Inlay der CD-H&uuml;lle gequetschte Anleitung
und die CD-ROM ist jetzt schwarz. Au&szlig;erdem gibt es jetzt ein kleines
Skript namens 'Assign CD', welches es einem erm&ouml;glicht, diese Version
auch auf Nicht-CD32 Systemen zu spielen. Und zu guter letzt liegt die
Anleitung auch nochmal als Textdatei vor. Die Levelcodes wurden als
PowerPacker gepackte Textdatei verschl&uuml;sselt auf die CD gebrannt.
Das Spiel ist letztendlich exakt dasselbe wie damals die CD32 Version.

Die Geschichte, ja fast ein M&auml;rchen, handelt von einem Prinzen und
seiner geliebten Prinzessin, die in aller Ruhe und Zufriedenheit
lebten, bis die b&ouml;se Hexe die Prinzessin entf&uuml;hrte. Aber nicht genug:
Den Prinzen verwandelte, wie k&ouml;nnte es auch anders sein, in einen
armen kleinen Frosch. Am Flussufer, seiner neuen Heimat, kam dann
aber doch eine rettende Flasche mit Lucozade verbeigeschwommen aus
der der Frosch trank, und dann zum Superfrosch (Englisch: Superfrog)
wurde. Nun macht er sich auf seine Prinzessin zur&uuml;ckzugewinnen.

Auf der CD-ROM findet man verschiedene Piktogramme: Man kann zwischen
Quickstart, Superfrog, AssignCD, Manual und Superfrog.doc ausw&auml;hlen.
Zuerst sollte man jedoch AssignCD w&auml;hlen, da dieses Skript die CD
auf die Benutzung vorbereitet. Manual ist die Originalanleitung von
Team 17, die &uuml;ber eine grafische Oberfl&auml;che verf&uuml;gt. Da diese aber
nicht auf jedem Amiga l&auml;uft, hat Islona Entertainment die ganze
Anleitung nochmal als Text konvertiert unter dem Namen Superfrog.doc
auf die CD gespeichert. Quickstart startet direkt das Spiel Superfrog
ohne das Intro zu zeigen, doch dies sollte man auf keinen Fall
verpassen, denn das komplett von Eric Schwartz gezeichnete 3-min&uuml;tige
Intro ist wirklich cool. Nachdem das Intro fertig ist, findet
man sich im Hauptmen&uuml; wieder, und auch hier f&auml;llt einem wieder die
tolle Musik und Grafik auf. Es lassen sich einige Einstellungen
wie die Anzahl der Leben, die Schwierigkeitsstufe oder den Levelcode
festlegen. Nun nur noch auf 'Start Game' klicken und los geht`s!

Insgesamt gibt es 5 Welten (Wald, Schloss, Zirkus, Pyramdiden und
Nordpol) mit je 3 Level. Da ich das Spiel schon durchgespielt
habe, kann ich euch an dieser Stelle aber verraten, dass es noch
einige coole Extra-Level (z.B. ProjectX-Frog) gibt, die man auf
keinen Fall verpassen sollte. Es geht los im Wald: Superfrog spielt
sich solide mit Joystick oder Joypad. In jeder Runde muss man 
eine bestimmte Zahl von M&uuml;nzen einsammeln, damit sich das Ziel
&ouml;ffnet. Danach kann man die eingesammelten M&uuml;nzen wieder am
Spielautomaten verspielen, wobei man hier nat&uuml;rlich auch seine
Utensilien aufbessern kann. Die Gegner erledigt man entweder durch
Aufspringen oder mit einem kleinen Zusatzhelfer, den man aber
zuerst einsammeln muss.
  
Screenshot:
<IMG SRC="../extra/Superfrog.png" ALT="Screenshot">  
  
Fazit: Superfrog ist ein altes, aber sehr gutes, Jump`n`Run Spiel.
Die Comicgrafik ist fr&ouml;hlich und mit viel Liebe zum Detail
gestaltet worden. Genauso gut h&ouml;rt sich die Musik an, f&uuml;r
die der bekannte Musiker Allister Brimble verantwortlich ist.
Superfrog wird auch nach 5 Jahren nicht langweilig, da es viel
zu entdecken gibt. Team 17 hat viele Extras in Superfrog
eingebracht, die es zu einem echten Abenteuer machen. Wer
Jump`n`Runs mag und Superfrog noch nicht kennt, dem kann man
es nur empfehlen. Hier die Wertung:

+-------------------------------------------------------------------------+
|  Name:          Superfrog                                               |
|  Hersteller:    Team 17, neuver&ouml;ffentlicht von Islona Entertainment,    |
|                 vertrieben von Epic Marketing, Paul-Lechler-Strasse 4,  |
|                 72076 T&uuml;bingen, Te.07071 63525, epicmarketing@dialin.net|
|  Preis:         49 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Jump`n`Run             | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: deutsch             |
|  System:        AGA, CD-ROM                                             |
|                                                                         |
|  Fazit:         Ein Jump`n`Run Klassiker, den jeder Jump`n`Run Fan in   |
|                 seiner Sammlung haben sollte.                           |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     7/10                            |
|                             Sound:      9/10                            |
|                             Handhabung: 8/10                            |
|                             Spielspa&szlig;:  9/10                            |
|                             GESAMT:      75%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
