<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Review: Moonbases
-----------------

Auch Moonbases hatte mit einigen Pannen zu k&auml;mpfen: So wollte z.B.
als das Spiel fertig war, der Publisher Verkosoft es nicht mehr
ver&ouml;ffentlichen. Danach lag Moonbases ein paar Monate fertig auf Eis,
bis sich Alive Mediasoft dazu bereiterkl&auml;rte, es zu ver&ouml;ffentlichen.
Und so fand ich es letztendlich in meinem Briefkasten, frisch aus
England geschickt. Die erste &Uuml;berraschung kam gleich nach &Ouml;ffnen
der CD-H&uuml;lle: Moonbases wird auf einem Rohling geliefert. Zwar wurde
ein Cover auf die CD-ROM geklebt, aber dies wurde auch (nur) mittels
einem Tintenstrahldrucker angefertigt. Dies macht nat&uuml;rlich einen
etwas amateurhaften Eindruck, aber erstmal abwarten, wie das Spiel
denn so ist. Die Story des Spiels findet man, obwohl das Spiel 
Englisch und Deutsch unterst&uuml;tzt, nur in Englisch auf der R&uuml;ckseite
der CD-H&uuml;lle. In der Anleitung auf der CD-ROM steht sie nicht.

Im Spiel geht es um zwei Firmen, die Sigma Corporation und die
Omicron Incorporated. Beide Firmen nehmen sozusagen den Mond aus:
Man baut Mineralien und andere Sachen ab und transportiert sie
zur&uuml;ck zur Erde. Wie sollte es auch anders sein, kommen sich diese
beiden Firmen letztendlich in die Quere. Der Benutzer kann w&auml;hlen
welche der beiden Firmen er spielen m&ouml;chte. In jedem Fall muss
er die Zukunft seiner Firma sichern, in dem er die andere Firma
mit eigenen Waffen und strategischen Pl&auml;nen besiegt. 

Nachdem &Ouml;ffnen der CD-ROM auf der Workbench m&ouml;gen manche Benutzer
erstmal ein bisschen verwirrt sein. So findet man hier n&auml;mlich
9 verschiedene Startm&ouml;glichkeiten f&uuml;r Moonbases: Moonbases Standard,
Moonbases Serial, Moonbases RTG, Moonbases Prefs Standard,
Moonbases Prefs Serial, Moonbases Prefs RTG, MapEditor, Moonbases
Serial RTG und ein Uninstaller f&uuml;r Moonbases, der allerdings nur
einige Umgebungsvariablen in ENV: bzw. ENVARC: l&ouml;scht. Auf 
Festplatte braucht Moonbases nicht installiert werden, es l&auml;uft
auch so von CD-ROM. Ein Installer liegt ebenfalls nicht vor,
obwohl auf der R&uuml;ckseite der CD-ROM unter Systemanforderungen
'10 MB HD Space' steht. Also nun nur noch die Standard Version
(AGA) starten und los geht`s! Hmm, das Spiel ist in Englisch.
Also nochmal raus und das Prefs Programm starten. Hier wird
schnell 'Deutsch' eingestellt und auf 'Save' geklickt, doch:
Der Datentr&auml;ger Moonbases ist schreibgesch&uuml;tzt. Aha, also das
ganze auf Festplatte kopieren (einfach Drag & Drop, da kein
Installer vorhanden ist). Jetzt klappt es mit dem Speichern
und auch das Spiel ist jetzt teilweise in deutsch. 

Nachdem Start findet man sich im Hauptmen&uuml; wieder, wo man
entweder ein altes Spiel laden oder ein Neues beginnen kann.
Jetzt wird einem die zu erledigende Mission nahegebracht: 'Auch
K&auml;mpfe k&ouml;nnen nicht ausgeschlossen werden', heisst es hier
unter anderem. Ja, ca. 10 Sekunden nach Spielbeginn wird dann
auch pl&ouml;tzlich von den Gegnern geschossen. V&ouml;llig &uuml;berrascht
beginnt man wild auf den Kn&ouml;pfen der Toolbar rumzuklicken, um
irgendwie zur&uuml;ckschie&szlig;en zu k&ouml;nnen. Doch hat man es endlich
rausbekommen, ist die Hauptbasis schon erledigt. Also nochmal
probieren! Auch hier agiert der Gegner wieder sehr aggressiv
und f&auml;ngt schon bei der kleinsten Begegnung wie wild an zu
schie&szlig;en. Die Verteidigung f&auml;llt selbst in der 1. Mission
nicht leicht aus. Durch die etwas schwerf&auml;llige Steuerung
wird das Ganze noch problematischer. Ansonsten scheint Moonbases
ein einigerma&szlig;en Spiel zu sein, dessen Grafik aber noch besser
ausfallen h&auml;tte k&ouml;nnen.

Screenshot:
<IMG SRC="../extra/Moonbases.png" ALT="Screenshot">

Fazit: Liest man die Features von Moonbases auf der R&uuml;ckseite
m&uuml;sste man eigentlich sofort zuschlagen: Hier ist von super
Musik und Sprachausgabe die Rede sowie geraytraceter Ingame
Grafik. Das einzige was ich an Musik zu h&ouml;ren bekam, war ein
kleines St&uuml;ck im Hauptmen&uuml;. Die Sprachausgabe scheint sich
auf die Bewegungen eines Fahrzeug zu begrenzen (north, west,
east...) und ist auch noch in Englisch. Geraytracet sind nur
die Fahrzeuge und Stationen, nicht die komplette Grafik. Die
Grafik haut einen zwar nicht vom Hocker, ist aber auch nicht
unterste Schublade. Aber vor allem die Terrain Grafik h&auml;tte
besser ausfallen k&ouml;nnen. Die Steuerung ist ebenfalls etwas
verwirrend. Daf&uuml;r besitzt Moonbases aber einen 2 Spieler Modus
via Nullmodemkabel oder Modem. Auch Grafikkarten werden
unterst&uuml;tzt, allerdings ist fraglich, ob hier im Spiel
&uuml;berhaupt 256 Farben-Grafik vorliegt. Eigentlich sieht es
eher aus wie ECS. Zur Wertung:

+-------------------------------------------------------------------------+
|  Name:          Moonbases                                               |
|  Hersteller:    Homegrown Software, ver&ouml;ffentlicht von Alive Mediasoft, |
|                 PO Box 940, Kirkby-In-Ashfield, Nottingham, NG17 7FA,   |
|                 England, Telefon oder Fax: +44 (0)1623 467579,          |
|                 E-Mail: jenniealive@innotts.co.uk                       |
|  Preis:         45 DM                                                   |
|  Datentr&auml;ger:   1 CD-Rohling                                            |
|  Genre:         Strategie 'n' Action   | Spieler: 1 oder 2 via Netzwerk |
|  Sprache:       englisch, deutsch      | Anleitung: englisch, deutsch   |
|  System:        AGA oder Grafikkarte, 1 MB Fast RAM, CD-ROM, Festplatte |
|                                                                         |
|  Fazit:         Mittelm&auml;&szlig;iges Spiel, welches auf der Verpackung         |
|                 eindeutig zu gut wegkommt.                              |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     5/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 6/10                            |
|                             Spielspa&szlig;:  6/10                            |
|                             GESAMT:      56%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
