<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Review: Wasted Dreams
---------------------

Fast kein anderes Amiga-Spiel wurde so erwartet wie Wasted Dreams,
dessen Pannen ihr ja alle in den letzten AMIGA aktuell Ausgaben
mitverfolgen konntet. Umso mehr freute ich mich, als Wasted Dreams
endlich in meinem Briefkasten lag. Wie sollte es auch anders sein,
kommt auch Wasted Dreams in der Standard CD-H&uuml;lle daher. Au&szlig;er der
CD-ROM findet man allerdings noch ein kleines Heft im Inlay der
CD-H&uuml;lle, welches in Englisch das Spiel erkl&auml;rt. Anleitungen in
anderen Sprachen findet man als Text auf der CD-ROM. Insgesamt
werden 16 Sprachen unterst&uuml;tzt, selbstverst&auml;ndlich auch deutsch.

Die Geschichte des Spiels ist sehr umfangreich ausgefallen und
kann auf der CD-ROM in allen unterst&uuml;tzten Sprachen gelesen 
werden. Ich fasse sie jetzt mal kurz zusammen: Die beiden Soldaten
Johanson (die Hauptfigur) und Harper nehmen an der ExplorerFX2
Mission teil, die in die Wege geleitet wurde, um einen Ersatz
f&uuml;r die 'sterbende' Erde zu finden. Nach einiger Zeit findet
man einen geeigneten Planet: Agillera. Der Planet stellte sich
als ideal heraus, es gab auch keinerlei Formen intelligenten
Lebens, nur Beweise f&uuml;r die Existenz dessen vor langer Zeit.
Da zwischen Erde und Agillera kein Kontakt besteht, beschlie&szlig;en
80% der Crew, darunter auch die beiden Helden, zur Erde 
zur&uuml;ckzufliegen und die tolle Nachricht zu verk&uuml;ndigen. Nachdem
Start wird fast die gesamte Besatzung durch einen mysteri&ouml;sen
Unfall get&ouml;tet. Der Held Johanson &uuml;berlebt die Explosionen
allerdings und findet sich neben dem zerst&ouml;rten Raumschiff
auf Agillera wieder. Sein Kollege Harper &uuml;berlebt den Unfall
nur im 2 Spieler Modus :-)

Wasted Dreams muss nicht auf Festplatte installiert werden, es
ist direkt von CD-ROM spielbar. Auf der CD-ROM gibt es zwei
verschiedene Startm&ouml;glichkeiten: Wasted Dreams mit und ohne
Intro. Au&szlig;erdem sind auch noch die Anleitungen in allen Sprachen
in einem Extra Verzeichnis enthalten. Allerdings ist es mir
noch nicht gelungen, das Intro zu sehen bekommen. Die Entwickler
verweisen darauf, dass gen&uuml;gen Chip Speicher vorhanden sein
muss, um das Intro zu sehen. Dieser sollte aber vorhanden 
sein, da ich wirklich eine Minimal Workbench gefahren habe
und ca. 1,95MB von 2MB frei waren. Auch f&uuml;r die Sprachausgabe
ist angeblich nicht gen&uuml;gend Speicher frei. Ich gelange also
egal auf welches Piktogramm ich klicke, immer direkt ins Spiel.

Das Spiel l&auml;sst sich sowohl zu zweit, als auch allein spielen.
Im Zwei-Spieler Modus kann man dazu noch gegen- oder miteinander
spielen. Gesteuert werden kann mit Joystick oder Tastatur,
wobei auch mit ausgew&auml;hlter Joystick-Steuerung ab und zu die
Tastatur ran muss. Im Optionsmen&uuml; kann man u.a die zu benutzende
Sprache einstellen sowie verschiedene andere Sachen konfigurieren.
Die Animation der Charaktere ist relativ fl&uuml;ssig und mit
vielen einzelnen Frames ausgestattet. Auch die Grafik ist
durchaus gut, daf&uuml;r, dass sie nur ECS ben&ouml;tigt. Wasted Dreams
spielt sich gut, wenn man sich ein bisschen an die doch etwas
komplizierte Steuerung gew&ouml;hnt hat. Das Spiel macht es einem
einfach: So wird z.B. automatisch ein Bildchen angezeigt, wenn
man sich &uuml;ber einem Objekt befindet, welches aufgehoben werden
kann. Man muss dann nur noch den Feuerknopf bzw. RETURN dr&uuml;cken.
Auch wenn man ein Objekt mit etwas anderem benutzen m&ouml;chte,
wird einem gleich angezeigt, ob es damit benutzt werden kann.
Dies erh&ouml;ht die Freude am Spiel. Schlie&szlig;lich ist Wasted Dreams
ja kein Adventure im klassischen Stil. Ist die Laserwaffe
leer, kann man auch seine F&auml;uste verwenden, um sich zu
verteidigen.

Screenshot:
<IMG SRC="../extra/WastedDreams1.jpg" ALT="Screenshot">
Screenshot:
<IMG SRC="../extra/WastedDreams2.jpg" ALT="Screenshot">

Fazit: Die Entwickler haben mit Wasted Dreams das gehalten,
was sie versprochen haben. Wasted Dreams spielt sich relativ
solide und macht auch nach einigen Wochen noch Spass. Man
hat sich sichtlich bem&uuml;ht, die Steuerung sowie Handhabung
so einfach wie m&ouml;glich zu gestalten, was den Spielspa&szlig;
deutlich erh&ouml;ht. Ansonsten ist Wasted Dreams ein gutes Spiel,
welches mit Sprachausgabe und Videosequenzen noch ein Extra
Schmankerl bereith&auml;lt (wenn sie bei mir blo&szlig; laufen w&uuml;rden). 
Das macht insgesamt:

+-------------------------------------------------------------------------+
|  Name:          Wasted Dreams                                           |
|  Hersteller:    Digital Dreams Entertainment, C/O Chris Seward,         |
|                 10 Scafell Close, Eastham, Merseyside, L62 9EU, England |
|                 Tel: 0044 7887 664915, E-Mail: chris@dd-ent.com         |
|  Preis:         79 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Genre-Mix (&auml;hnlich Chaos Engine) | Spieler: 1 oder 2    |
|  Sprache:       deutsch u.v.a          | Anleitung: deutsch u.v.a       |
|  System:        2 MB Chip RAM & 1 MB Fast RAM, CD-ROM                   |
|                                                                         |
|  Fazit:         Endlich mal wieder ein gutes neues Spiel! Erste Wahl    |
|                 f&uuml;r Leute, die endlich mal wieder ein ordentliches      |
|                 Spiel am Amiga haben m&ouml;chten.                           |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     8/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 9/10                            |
|                             Spielspa&szlig;:  7/10                            |
|                             GESAMT:      79%                            |
+-------------------------------------------------------------------------+

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
