<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Informationen zur AmigaDE-Skriptsprache »Sheep« (von Stefan Czinczoll)

Talking SHEEP

F&uuml;r das neue Amiga Digital Environment hat der durch AmigaE ber&uuml;hmt 
gewordene Autor Wouter van Oortmerssen eine entsprechend innovative 
Skriptsprache entwickelt.

Unter dem vorl&auml;ufigen Projektnamen SHEEP arbeitet er nun hauptberuflich f&uuml;r 
Amiga Inc. an einer neuen Ausdrucksform f&uuml;r Programmierer mit Allzweck-
F&auml;higkeiten. Diese soll deutlich mehr erlauben als das bisherige Pendant 
ARexx. In naher Zukunft soll es zu dem Klebstoff werden, der die Basis f&uuml;r 
das AmiVerse zusammenh&auml;lt.

&Auml;hnlich wie ARexx ist SHEEP auf den ersten Blick eine recht normale 
Interpreter-Sprache, die u.a. zur Interprozess-Kommunikation eingesetzt 
werden kann. Dar&uuml;berhinaus kann SHEEP f&uuml;r Datenbankabfragen und die 
flexible Erstellung und &Auml;nderung von Benutzeroberfl&auml;chen genutzt werden.

Wo liegen nun die Unterschiede?

Zun&auml;chst mal ist SHEEP an der Oberfl&auml;che zwar imperativ, geht jedoch im 
Kern von einem funktionalen Ansatz aus.
In der Amiga-World Nummer Vier findet sich folgendes einfache Beispiel:

type tree = branch(left:tree, right:tree) | leaf(data)

Hiermit wird eine einfache Datenstruktur "Baum" erzeugt, deren &Auml;ste 
entweder wieder baumartig sein k&ouml;nnen, oder als Bl&auml;tter dann (fixe) Daten 
oder Datens&auml;tze enthalten. In dieser Weise ist es m&ouml;glich, ganz frei eigene 
Datentypen zu erstellen, Supertypen zu bilden und sich damit ganz der 
gegebenen Problemstellung anzupassen.

Damit stellt SHEEP eine Sprache dar, mit welcher sehr schnell Prototypen-
L&ouml;sungen gefunden werden k&ouml;nnen. Die Programme werden zu Testzwecken mit 
einem Interpreter f&uuml;r die Maschine umgesetzt. Mit einer Compiler-Version 
&uuml;bersetzt mensch die Sch&auml;fchen in Code f&uuml;r den Virtuellen Prozessor. Die
Geschwindigkeit &uuml;bertrifft die Java, ARexx und Basic dabei deutlich und 
liegt insgesamt in der Gr&ouml;&szlig;enordnung von C/C++.

Die Hinwendung zum Ansatz objektorientierter Programmierung ist ganz 
offenkundig und entspricht dem modularen Aufbau des AmigaDE. Die 
Speicherverwaltung erfolgt ohne die traditionelle "garbage collection" 
anderer Sprachen f&uuml;r dynamische Objekte. Daf&uuml;r gibt es aber 
Schutzmechanismen, so da&szlig; nicht versehentlich Inhalte &uuml;berschrieben werden 
k&ouml;nnen, die schon mit Daten belegt sind. Damit wird SHEEP auch f&uuml;r 
Neueinsteiger beim Programmieren interessant.

Eindrucksvoll war f&uuml;r mich vor allem das Beispiel des Quicksort-Programmes. 
In Sheep wird daraus ein (allerdings schon recht komplexer) Vierzeiler, der 
keine R&uuml;cksicht mehr nimmt auf den Typ der zu sortierenden Daten. Dies 
geschieht jedoch nicht aus Nachl&auml;ssigkeit, sondern ist vielmehr voll 
beabsichtigt. So k&ouml;nnen mit dem gleichen St&uuml;ck Code Textst&uuml;cke, ganze 
Zahlen oder v&ouml;llig beliebige Arten von ordinal vergleichbarer Information 
sortiert werden.

Ebenfalls neu ist das Vektor-Konzept:

Daten, die sonst in statischen Arrays oder mit dynamischen Listen verwaltet 
werden, werden hierin abgelegt. Mit einfachen Operationen k&ouml;nnen dann diese 
manipuliert werden, z.B. in folgender Weise mit "a" als Vektor:

a = [1,2,3]
a = a+[4,5,6]

ergibt dann [1,2,3,4,5,6] als Ergebnisvektor f&uuml;r a. In &auml;hnlicher Weise kann 
der "+"-Operator zur Aufteilung von Vektoren in ihre Bestandteile genutzt 
werden.

Modularisierung und integrierte Fehlerroutinen runden die Sprache zu einer 
Einheit ab, die sich sehen lassen kann.

Ohne die anderen Beispiele hier besprechen zu m&uuml;ssen, kann man insgesamt 
sagen, da&szlig; SHEEP wirklich eine anf&auml;ngerfreundliche und sehr moderne 
Alternative zu E darstellt, die viele gute Eigenschaften von Sprachen wie 
ARexx, Prolog, BASIC, Perl, Python und Java in sich vereint. 
Fortgeschrittene Programmierer werden mit SHEEP Ausdrucksm&ouml;glichkeiten 
finden, die es ihnen erlauben, mindestens Projekte bis zu mittlerer Gr&ouml;&szlig;e 
darin verwirklichen zu k&ouml;nnen.

Aufgrund der Einfachheit und enormen F&auml;higkeiten habe ich den Autor nach 
Sicherheitsrisiken (Viren, Trojaner, etc.) in Bezug auf SHEEP gefragt. 
&Auml;hnlich wie bei Javascript-Programmen, die i.d.R. auch keine Dateien auf 
der Festplatte l&ouml;schen k&ouml;nnen, soll es Schutzmechanismen geben, die eine 
Sperre zwischen dem Code aus Emails oder Webseiten gegen&uuml;ber der 
unterliegenden Ebene des OS bilden.

SHEEP befindet sich zur Zeit allerdings noch in einem privaten Beta-
Stadium. Deshalb konnte noch kein Erfahrungsbericht von dritter Seite in 
diese Darstellung integriert werden. Der Erfolg von AmigaE l&auml;&szlig;t jedoch 
hoffen, da&szlig; sich mit SHEEP noch mehr User und Entwickler f&uuml;r den Amiga 
begeistern lassen werden.


Link:

http://www.amiga.com/press/zine/11-1-00/sheep

Stefan Czinczoll &lt;sczinczoll@max.uni-duisburg.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
