<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. AMIGA und Elbox vereinbaren Kooperation

»Zur sofortigen Ver&ouml;ffentlichung:

11. April 2001, Snoqualmie, Washington, USA. Amiga Inc und Elbox arbeiten
gemeinsam f&uuml;r das AmigaOS 4.0 und auch weiterhin zusammen.

AMIGA Inc. freut sich, eine langfristige Verbindung mit Elbox Computer Ltd.
in Krakau in Polen bekannt geben zu k&ouml;nnen. AMIGA Inc. k&uuml;ndete auf der
Handels- und Verbrauchermesse in St. Louis am 31. M&auml;rz 2001 die Entwicklung
des AmigaOS4 an, der neusten Version des h&ouml;chst leistungsf&auml;higen, benutzer-
freundlichen Betriebssystems, welches Multimedia in die Welt einf&uuml;hrte, Um
AmigaOS4 zu unterst&uuml;tzen, hat AMIGA Inc. auch die Zico-Richtlinien f&uuml;r
Hardware mit besondere Ber&uuml;cksichtigung des PowerPC-Prozessors heraus
gegeben. Elbox Computer Ltd. arbeitet eng mit AMIGA Inc. zusammen um sicher
zu stellen, dass ihre jetzigen und zuk&uuml;nftigen Produkte die Zico-Zulassung
erhalten werden und dadurch eine perfekte Plattform f&uuml;r das AmigaOS4 bieten
werden.

"St. Louis kennzeichnete den Beginn der Zukunft," sagte Bill McEwen, 
Pr&auml;sident und CEO von AMIGA Inc. "Der Schl&uuml;ssel dazu ist das gemeinsame und 
entschlossene Voranstreben der Amiga-Gemeinschaft in die richtige Richtung. 
Mit Elbox als Partner hat eine weitere wichtige Amiga-Gesellschaft den Weg 
zum Erfolg beschritten."

"Unser langzeitiger Einsatz in der Computer-Technologie zeigt nun sp&uuml;rbare
Ergebnisse auf dem Amiga-Markt," sagte Maciek Binek, CEO von Elbox. "Nun
k&ouml;nnen wir in der Initiative von AMIGA Inc. ein klares Zeichen von 
zukunftsorientiertem Denken und zukunftsorientierter Strategie erkennen, 
einen Durchbruch f&uuml;r diesen Computer. Wir hoffen, dass der Name »Amiga« 
bald wieder in aller Munde sein wird."

"Elbox hat eine f&uuml;hrende Rolle dadurch &uuml;bernommen, das es nicht nur den
bestehenden Amiga-Markt mit seinen zahlreichen Produkten unterst&uuml;tzt, 
sondern auch damit, dass es einen Weg in die Zukunft weist," sagte Fleecy 
Moss, CTO von Amiga Inc. "Unsere Verbindung mit ihnen wird sicher stellen, 
das die jetzigen Kunden ihre Vorteile aus dem AmigaOS4 ziehen werden, 
w&auml;hrend neue Anwender, die zum Amiga sto&szlig;en, eine ausgezeichnete Auswahl an 
Hardware vorfinden, die sie kaufen k&ouml;nnen."

AmigaOS4 wird zur Zeit entwickelt und im Sommer 2001 ausgeliefert werden.
Elbox-Produkte k&ouml;nnen heute schon bei allen wichtigen Amiga-H&auml;ndlern 
erworben werden. Ihr n&auml;chstes Produkt, die SharkPPC+, wird gleichzeitig mit 
der Premiere des AmigaOS4-Systems zur Verf&uuml;gung stehen.


&Uuml;ber Amiga:
AMIGA Inc. bietet den Entwicklern die Technologie zum Schreiben und 
Portieren von Anwendungsprogrammen auf ein neues Betriebssystem mit 
Multimedia-Eigenschaften, welches unabh&auml;ngig von der Hardware ist. AmigaDE 
ist eine gemeinsame Entwicklungs-Leistung der Tao Group in Reading, 
England, und AMIGA Incorporated. Auf AmigaDE basierende Anwendungen k&ouml;nnen 
ohne &Auml;nderung auf Prozessoren x86, PowerPC, M Core, ARM, StrongARM, MIPS 
R3000, R4000, R5000, SH 3, SH4 und NEC V850 laufen. Das Amiga OS kann auf 
Linux, Embedded Linux, Windows 95, 98, 2000, NT, CE und QNX4 aufgesetzt 
arbeiten. Der Standort von AMIGA ist in Snoqualmie, Washington (USA), 28 
Meilen &ouml;stlich von Seattle und hat B&uuml;ros weltweit. AMIGA kann &uuml;ber (425) 
396-5660 erreicht werden, oder besuchen Sie uns im Netz bei 
http://www.amiga.com


&Uuml;ber Elbox:
Elbox Computer Ltd. in Krakau, Polen, ist eine Gesellschaft in privater 
Hand, die seit 1982 im Gesch&auml;ft und schnell aus ihren Wurzeln f&uuml;r 
Industrie-Systeme gewachsen ist, um nun deutlich am Markt f&uuml;r 
Peripherieger&auml;te, Multimedia-Systeme, Hochleistungs-Mutterplatinen, 
Geh&auml;usen, Anwendungs-Software und allgemeinen Computer-Subsystemen 
vertreten zu sein. Ihre Erzeugnisse werden in der ganzen Welt verwendet und 
haben ein neuen Standard f&uuml;r Preise, Leistung und Kundenfreundlichkeit 
gesetzt. Weitere Informationen erhalten Sie gern per eMail von 
info@elbox.com oder finden Sie bei einem Besuch auf der Elbox-Website 
http://www.elbox.com«


Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
