<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Executive Update von AMIGA-Pr&auml;sident Bill McEwen

Martina Jacobs von AIDA (http://www.amiga-club.de/aida/) hat uns 
freundlicherweise das j&uuml;ngste Executive Update von AMIGA-Pr&auml;sident Bill 
McEwen in einer deutschen &Uuml;bersetzung zur Verf&uuml;gung gestellt:

»Executive Update

Bill McEwen - 12. April 2001

Ich gr&uuml;&szlig;e Sie Alle:

Was war das doch f&uuml;r eine wundervolle Zeit f&uuml;r uns in St. Louis. Ich muss
unseren Gastgebern Bob und Diana Scharp und allen Mitgliedern des Gateway
Amiga Clubs danken. Wieder einmal haben sie sich &uuml;bertroffen und die Dinge
am Laufen gehalten.

Ich m&ouml;chte verdeutlichen, was die Ank&uuml;ndigungen waren und was sie f&uuml;r Amiga
und den Rest der Amiga-Familie bedeuten.

  1. Amiga hat die Strategie f&uuml;r das AmigaDE NICHT ge&auml;ndert. Die Dinge
     laufen sehr gut - wie erwartet - und wir haben einige beeindruckende,
     neue Kunden; Sharp ist der Erste davon.
  2. Amiga OS 4.0 und weitere Versionen wurden angek&uuml;ndigt. Dabei handelt
     es sich um eine Folge von Versionen, die einen nativen Port von
     AmigaOS auf den PPC bringen werden. Das hat NICHTS mit WarpOS gegen
     irgendwen zu tun. Es handelt sich um einen Amiga Inc.-Port des OS. Da
     gibt es nichts weiter draus zu folgern.
  3. AmigaOne A1200 ist die erste neue Hardware f&uuml;r den Amiga und wir
     planen noch immer ein eigenst&auml;ndiges ATX-Board, und andere neue
     Hardware. AmigaOne f&uuml;r den A1200 wird diesen Sommer herauskommen.
     Danach werden wir uns sp&auml;ter im Jahr Erscheinungen f&uuml;r die neuen,
     eigenst&auml;ndigen Designs ansehen.

Zusammenfassung:

   o Mit AmigaDE l&auml;uft es gut und wir werden die Entwicklungsanstrengungen
     mit den gleichen Zielen weiterf&uuml;hren.
   o AmigaOS 4.0 kommt diesen Sommer heraus, zusammen mit den ersten
     AmigaOne-Machinen gem&auml;&szlig; Zico-Spezifikation.
   o Sharp ist ein neuer Partner von Amiga Incorporated. Mehr &uuml;ber diese
     Verbindung wird sp&auml;ter bekannt gegeben werden.
   o Bald wird es noch mehr Partner und Ank&uuml;ndigungen geben.
   o Das ist eine tolle Zeit, um Teil der Amiga-Familie sein.
   o F&uuml;r genauere Informationen wird sp&auml;ter am Tag ein neues, technisches
     Update ver&ouml;ffentlicht werden.

Ich danke Ihnen Allen f&uuml;r Ihre Unterst&uuml;tzung und freuen uns auf ein sehr
aufregendes Jahr, das vor uns liegt!

Mit freundlichem Gru&szlig;,

Bill McEwen, und der Rest des Teams von Amiga, Inc.«


Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs                
                                                    &lt;Maja@popmail.oche.de&gt;.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
