<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. AMIGA gibt technisches Update heraus

AMIGA hat Mitte April ein technisches Update zu den aktuellen Entwicklungen 
ver&ouml;ffentlicht, das Martina Jacobs von AIDA uns freundlicherweise in einer 
deutschen &Uuml;bersetzung zur Verf&uuml;gung gestellt hat:


»Technisches Update Teil 1 - 12. April 2001

Am 31. M&auml;rz 2001 enth&uuml;llte der Leiter und CEO von Amiga, Mr. Bill McEwen,
die ganze Amiga-Strategie. W&auml;hrend im vergangenen Jahr nur Teile davon
bekannt geworden waren, wurde sie diesesmal vollst&auml;ndig und in
Einzelheiten erkl&auml;rt.

Diese Pr&auml;sentation war eine private Angelegenheit, nur f&uuml;r die wenigen
hundert Teilnehmer des Messe-Banketts. Dieses Update greift nun die
Informationen, welche auf dem Bankett pr&auml;sentiert worden sind, auf und
macht diese der Welt komplett verf&uuml;gbar.

Die Zukunft ist eine Zukunft der Inhalte. Informationen und Vorg&auml;nge
wandeln sich langsam vom physikalisch Analogen, hin zum Digitalen.
Unterhaltung, Forschung, Arbeit, Einkauf, Konversation, Bildung; all das
ver&auml;ndert sich, um vom digitalen Universum zu provitieren.

Der Zugriff auf dieses digitale Universum geschieht mittels jedem Ger&auml;t,
das einen Mikroprozessor besitzt, die digitale Sprache versteht und sich
mit diesem digitalen Universum verbinden kann. In der Vergangenheit war
das auf Millionen-Dollar teure Gro&szlig;rechner beschr&auml;nkt. Mit
vortschreitender Entwicklung wurde dieses Universum f&uuml;r
2000-Dollar-Desktops verf&uuml;gbar. Heute ist die Technologie so weit
vortgeschritten, dass auf das digitale Universum schon mit
300-Dollar-Spielkonsolen und 100-Dollar-Handys zugegriffen werden kann.

Der Anwender hat jetzt eine riesige Auswahl, wenn es um den Zugriff auf die
eine Konstante geht; das digitale Universum. Es gibt Workstations, den
Desktop, die Set-Tob-Box, Spielekonsolen, das PDA und Handys. Welche Wahl
er trifft, h&auml;ngt von vielen Dingen ab - wo er sich befindet, was er tun
m&ouml;chte, wieviel Uhr es ist. F&uuml;r Amiga ist das die neue Herausforderung,
neues Grenzland, das neue WWW. Was auch immer, wann auch immer, wo auch
immer.

Alle diese Ger&auml;te k&ouml;nnen auf das digitale Universum zugreifen, doch jedes
davon kommt mit einer Reihe von F&auml;higkeiten, abh&auml;ngig von Preis, Markt und
Formfaktor. Jedes f&uuml;gt sich in eine Rolle, die in der Vergangenheit den
m&ouml;glichen Vorgang festlegte, heute aber nur noch ein Profil beschreibt.
Der Desktop z.B. war ein Synonym f&uuml;r Textverarbeitung, Bildbearbeitung und
Surfen im Internet. Nun haben diese Vorg&auml;nge sich von der reinen Hardware
befreit, um selbst zu Vorg&auml;ngen auf vielen anderen Ger&auml;ten zu werden.

Diese Vorg&auml;nge setzen eine Reihe von Dingen voraus; Dienste, die sie
brauchen, um stattfinden zu k&ouml;nnen. Vergleichbar dazu haben Ger&auml;te ein
Reihe von F&auml;higkeiten; Dienste, die sie anbieten k&ouml;nnen, um Vorg&auml;nge
stattfinden zu lassen. Zuk&uuml;nftige digitale Umgebungen werden Vorg&auml;nge
einfach nur an Ger&auml;te anpassen, basierend auf den Anforderungen und
F&auml;higkeiten die Vorg&auml;nge auf ein Ma&szlig; skalieren, das den F&auml;higkeiten des
verwendeten Ger&auml;tes gerecht wird. Vorg&auml;nge werden unabh&auml;ngig von einer
bestimmten Art von Hardware sein und das wird den Anwender von den
Beschr&auml;nkungen durch diese Hardware befreien.

In wachsendem Ma&szlig;e wird der digitale Inhalt und der digitale Vorgang selbst
zum einzigen Anliegen werden. Dies ist ein traditionelles Zeichen daf&uuml;r,
dass eine Technologie reift, wenn die darunter liegende Technologie f&uuml;r
den Anwender unsichtbar wird. Das digitale Leben wird endlich seine
Versprechen von was auch immer, wann auch immer, wo auch immer erf&uuml;llen.

Amiga beabsichtigt diesen &Uuml;bergang durch die Erschaffung eines
revolution&auml;ren Produktes voran zu treiben, dem Amiga Digital Environment -
dem AmigaDE. Das AmigaDE wird einen universellen Layer f&uuml;r Inhalte
bereitstellen, der auf jedem digitalen Ger&auml;t Platz nehmen kann, ungeachtet
der Art von Hardware oder Bauteilen, und wird Anwendern wie auch
Entwicklern (Inhatlskonsumenten und Inhalsthersteller) einen gemeinsamen
Platz geben, in dem sie digitale Vorg&auml;nge durchf&uuml;hren k&ouml;nnen.

Das AmigaDE bittet die einzigartige F&auml;higkeit sich selbst zu entfalten,
entweder dirket auf der Hardware, kooperativ auf einem Host-System
(einfach wie eine weitere Applikation auf einem vorhandenen
Betriebssystem) oder einzeln auf einem Host-System, wobei der Anwender nur
das AmigaDE sieht, aber von den Eigenschaften des Host-Systems profitiert.

Dem Anwender stellt das AmigaDE eine nagelneue Quelle f&uuml;r unwiderstehliche
Inhalte bereit; Alles, von Spielen &uuml;ber Internet-Abenteuer, bis hin zur
Produktivit&auml;t, Inhaltserzeugung und ernsthaftem Arbeiten. All Das
verf&uuml;gbar auf jedem Ger&auml;t oder Computer. Der Anwender erh&auml;lt die freie
Auswahl zur&uuml;ck. Wenn er das AmigaDE auf seinem vorhandenen Computer haben
m&ouml;chte, so kann er das. Wenn er nur das AmigaDE verwenden m&ouml;chte, so kann
er das.

Der Andwender w&auml;hlt den Vorgang und das Ger&auml;t, auf dem er diesen Vorgang
ausf&uuml;hren m&ouml;chte. Das AmigaDE sorgt daf&uuml;r, dass die Anforderungen des
Vorgangs den F&auml;higkeiten des Ger&auml;tes entsprechen und liefert ihm das
optimale Erlebnis.

Dem Hersteller von Inhalten bietet das AmigaDE eine wirklich universelle
L&ouml;sung: Inhalte k&ouml;nnen nur einmal erzeugt und dann an jeden
AmigaDE-Anwender geliefert werden, ungeachtet des Ger&auml;tes, das der
Einzelne benutzt. So lange das Ger&auml;t die F&auml;higkeiten besitzt, den Inhalt
zu unterst&uuml;tzen, wird es funktionieren. Nie mehr m&uuml;ssen unterschiedliche
Versionen vom gleichen Inhalt f&uuml;r Windows, Macintosh und Linux erzeugt
werden. Nie mehr wird ein Produkt von den neuen M&auml;rkten f&uuml;r Set-Top-Boxen
und PDAs ausgeschlossen sein. Das AmigaDE bietet ein vern&uuml;nftiges
Spielfeld und vereint eine Vielzahl kleinerer Einzelm&auml;rkte in einen
gemeinsamen Markt, mit all den darin enthaltenen gesch&auml;ftlichen Vorteilen
und M&ouml;glichkeiten.

Das AmigaDE ist eine wahre Umgebung f&uuml;r Inhalte, die es dem Anwender
erlaubt, gro&szlig;artige Inhalte &uuml;berall, auf jeder Plattform und jedem Ger&auml;t
zu genie&szlig;en. Zu Hause k&ouml;nnen Familien Inhalte sammeln (alles, von Spielen
und Arbeitsanwendungen, bis hin zu digitalen Filmen, Bildern, Musik und
Dokumentationen) und mit jedem Ger&auml;t zu Hause, und schlu&szlig;endlich mit jedem
Ger&auml;t auf dem Planeten auf diese Inhalte zugreifen.

Diese Inhalte werden vom Internet, &uuml;ber Satellit und Kabelk&auml;nle oder von
den guten alten CDs und DVDs in den eigenen Ger&auml;ten heruntergeladen
werden. Wie auch immer, wenn die gesammelten digitalen Inhalte der Familie
immer mehr werden, werden sie diese vielleicht gern alle zusammen an einem
lokalen Aufbewahrungsort sammeln wollen, wo diese Katalogisiert, gesch&uuml;tzt
und von wo aus sie von allen ihren digitalen Ger&auml;ten verwendet werden
k&ouml;nnen, ohne CDs oder DVDs hin und her tragen zu m&uuml;ssen und in Streit zu
geraten, weil der &auml;lteste Sohn am Familien-Computer sitzt und Mutter nur
die Spielekonsole hat.

Amiga beabsichtigt dieses Problem zu l&ouml;sen und bietet sogar durch noch ein
weiteres Produkt eine vollst&auml;ndige L&ouml;sung f&uuml;r das digitale Leben an: Das
AmigaOS. Dabei handelt es sich um ein vom AmigaDE komplett gesondertes
Produkt und wird zum Genu&szlig; der wunderbaren Vorteile des AmigaDE nicht
ben&ouml;tigt.

Zusammen mit der passenden Hardware wird das AmigaOS ein Produkt
darstellen, das im Herzen des digitalen zu Hause sitzen wird. Als
Sammelstelle wird es der Familie erlauben, jede Art von digitalen Inhalten
ihrer Wahl zu speichern, f&uuml;r sicheren und einfachen Zugriff. Als Server
wird es der Familie erlauben, diese Inhalte zu jedem Ger&auml;t innerhalb des
digitalen Heims zu bewegen, und wenn gew&uuml;nscht auch dar&uuml;ber hinaus. Dabei
ist eine optimale Qualit&auml;t zu jeder Zeit garantiert. Als Gateway wird das
AmigaOS eine einzige Quelle f&uuml;r digitale Inhalte von au&szlig;en bieten, mit dem
Schutz vor Angriffen und Einbr&uuml;chen. Es wird Eltern erlauben, den Zugriff
auf externe Inhalte zu kontrollieren und alle digtialen Pfade
zusammenzulegen.

Bei der Mehrheit der digitalen Familien wird das AmigaOS-Ger&auml;t am Rande
stehen, dabei ein Minimum an Wartung ben&ouml;tigen, w&auml;hrend es still und
wirkungsvoll ihre digitales Erlebnis verbessert. Wer sich jedoch f&uuml;r eine
neue Stufe der multimedialen Erfahrung interessiert, der kann das
AmigaOS-Ger&auml;t selbst auch als m&auml;chtigen Computer verwenden, und es kommt
mit dem zus&auml;tzlichen Vorteil des AmigaDE, das kooperativ darauf l&auml;uft und
direkten Zugriff auf die Inhalte bietet und ebenso damit besch&auml;ftigt ist,
anderen AmigaDE-f&auml;higen Ger&auml;ten im Heim zu dienen.

Die Welt ver&auml;ndert sich. Die Art, wie die Menschen arbeiten, spielen,
kommunizieren, einkaufen, produzieren und konsumieren. Das Leben als
solches bewegt sich hin zu einem neuen Zeitalter. Amiga hat diese
Ver&auml;nderung verstanden; tats&auml;chlich war der Amiga dabei in der Vorhut seit
1984, als er der Welt zum ersten Mal Multimedia vorstellte.

Mit seinen beiden neuen Produkten, dem AmigaDE und dem AmigaOS, m&uuml;ssen sich
die Leute nicht l&auml;nger durch inkompatible Produkte und entt&auml;uschende
Inhalte hangeln. Jedes dieser beiden Proukte f&uuml;r sich bietet &uuml;berragende
Leistung und Nutzen f&uuml;rs Geld. Zusammen bezeichnen sie den Beginn des
digitalen Lebens.

Wer sich daf&uuml;r interessiert, ein AmigaOS-Ger&auml;t als Computer zu verwenden
oder mehr technisch orientierte Erkl&auml;rungen der Amiga-Strategie w&uuml;nscht,
m&ouml;chte bitte Teil 2 dieses technischen Updates lesen.«


»Technisches Update Teil 2 - 12. April 2001

Das AmigaDE&#174; und das AmigaOS sind die beiden Produkte von Amiga zur
Realisierung des Traumes vom digitalen Leben. Beide k&ouml;nnen sehr gut
unabh&auml;ngig vom jeweils Anderen existieren, doch zusammen bieten sie eine
unschlagbare Kombination von Kraft, Leistung und Eleganz.

AmigaDE & AmigaOS

Das AmigaDE ist eine universelle Umgebung f&uuml;r Inhalte, die nativ auf
Ger&auml;ten mit kleinen bis mittleren Recourcen oder gehosted, als Software,
auf mittleren bis Highend-Ger&auml;ten laufen kann. Sein Ziel ist es, eine
einheitliche, interaktive Umgebung f&uuml;r Anwedner vieler verschiedener
Ger&auml;te und ein einheitliches Entwicklungsmodel f&uuml;r Entwickler f&uuml;r die
gleichen Ger&auml;te anzubieten.

Das AmigaDE nutzt das Produktpaket intent#174; von der Tao-Group zur
sauberen Abstaktion von Diensten, was es dem AmigaDE erlaubt, auf
Hardware- und Software-Umgebungen zu laufen. In diesem Zusammenhang sollte
das ganze Ger&auml;t selbst als ein Layer-Set betrachtet werden, mit der
Hardware am einen und das Erlebnis des Andwenders am anderen Ende. Einzeln
betrachtet, hat man ein Layer-Set, das die F&auml;higkeiten der Hardware nimmt,
diese abstrahiert und b&uuml;ndelt, und dann dem System und Applikationen
Dritter verf&uuml;gbar macht, welche im Gegenzug vom Anwender &uuml;ber eine
Umgebung f&uuml;r Inhalte erfahren und manipuliert werden.

Aus Sicht des Anwenders definieren so statische Begriffe, wie 'Desktop' und
'Workstation', nicht l&auml;nger unbedingt das digitale Erlebnis. Das AmigaDE
ist eine digitale Umgebung in der jeder Inhalt ausgef&uuml;hrt werden kann,
gem&auml;&szlig; seiner Anforderungen und den F&auml;higkeiten des Host-Systems, auf dem
das AmigaDE l&auml;uft. Wenn das AmigaDE auf einem physikalischen Ger&auml;t mit
einer Geforce 2 Grafikkarte, einem 1 GHz Athlon und 256 MB SDRAM gehostet
wird, dann wird es in der Lage sein, diese Leistung jedem Inhalt
bereitzustellen, der auf ihm l&auml;uft. Wenn es auf einem PDA mit einem 100
MHz Prozessor, 8 MB SDRAM und keinerlei Hardwarebeschleunigung l&auml;uft, dann
wird es nur die Inhalte starten, die unter den Einschr&auml;nkungen dieses
Ger&auml;tes laufen k&ouml;nnen.

Aus Sicht des Entwicklers erfordert ein so bewegtes Gesch&auml;ft entweder, dass
sie Inhalte f&uuml;r eine bestimmte Stufe erzeugen, wissend dass diese auf Allem
dar&uuml;ber hinaus laufen werden, oder sie k&ouml;nnen einen besonderen Vorteil aus
dem Anpassungs-System ziehen und dem AmigaDE erlauben, die Leistung und
Pr&auml;sentation der Inhalte dynamisch an das Profil des Ger&auml;te anzupassen.
Somit kann er zwischen den kleineren Unterm&auml;rkten oder dem gr&ouml;&szlig;eren Markt
und mehr Umsatz entscheiden.

Wenn man das Ger&auml;t als Ganzes betrachtet, so beginnt das AmigaDE beim User
und w&auml;chst hinab bis zur Hardware. Da jedes Ger&auml;t seine eigenen
besonderen, physikalischen Abstufungen hat, setzt das AmigaDE seine
saubere Leistungsabstraktion ein, wo immer dies m&ouml;glich ist, um von
anderen Betriebssystemen zu profitieren, die die harte Arbeit der
Hardware-Abstraktion bereits erledigt haben. Das erlaubt es dem AmigaDE,
sich bei minimaler Anstrengung rasch auf eine maximale Anzahl von Ger&auml;ten
zu verbreiten und bietet dabei den Ger&auml;tebauern (und damit dem Anwender)
die Wahl, wie sie das AmigaDE pr&auml;sentieren und erfahren m&ouml;chten.

Einige Anwender k&ouml;nnen es kooperativ gehosted auf ein vorhandenes und wohl
bekanntes Betriebssystem starten, wie Windows oder Linux, w&auml;hrend Andere
es allein f&uuml;r sich verwenden und dabei ein darunter liegendes Host-System
w&auml;hlen k&ouml;nnen, das ihren Bed&uuml;rnissen am Besten gerecht wird - vielleicht
ein kleines Echtzeit-Betriebssystem. In diesem Master-Modus bleibt das
Host-System unter dem AmigaDE verborgen und der Anwender entscheidet sich
nur f&uuml;r die Interaktion und Zusammenarbeit dessen innerhalb der
AmigaDE-Umgebung. Die Betonung liegt bei dieser Vorgehensweise auf dem
Wort 'Entscheidung', etwas das kein anderes Betriebssystem in einer so
umfassenden Weise wie das AmigaDE bietet.

Amiga arbeitet derzeit hart an der n&auml;chsten Version des Software Developer
Kit (SDK), welche dem Entwickler einen Einblick auf weitere F&auml;higkeiten
des AmigaDE bietet und zum ersten Mal die Multimedia-Dienste vorstellt.
Das wird beim ersten Erscheinen das AmigaDE im Konsumentenmarkt ein F&uuml;lle
von Inhalten gew&auml;hrleisten.

Das AmigaOS, Amigas anderes neues Produkt, soll der Server-Kern des
digitalen Lebens werden. Dieses wird auf die vorhandene Basis im AmigaOS
3.9 aufgebaut werden, der neuesten Version des beachtenswerten, jedoch
vernachl&auml;ssigten AmigaOS, das 1984 seinen Anfgang nahm.

Das aktuelle AmigaOS, Version 3.9, l&auml;uft auf der alten AA-Hardware, die f&uuml;r
ihre Zeit damals zwar fortschrittlich war, welche nun aber ihr Alter
offenbart. Nach vielen Diskussionen mit der existierenden
Amiga-Gemeinschaft brachte Amiga die Zico-Spezifikation heraus. Zico ist
eine offene Beschreibung f&uuml;r Hardware, zu deren Verwendung Amiga IHVs
ermutigt und welche die Anforderungen zum Starten der ersten Version von
AmigaOS4, OS4.0 darstellt. Sie enth&auml;lt Merkmale wie einen PPC-Prozessor,
PCI, AGP, USB, Firewire und weitere Standardmerkmale anderer Computer,
sind aber neu f&uuml;r das AmigaOS.

Der PPC wurde gew&auml;hlt, weil er die Beziehung des Amiga zur Motorola
Prozessor-Familie weiter f&uuml;hrt, und weil die PPC-Famlie mit den
Book-E-Spezifikationen jetzt einen sehr einfachen &Uuml;bergang von 32 Bit auf
64 Bit Prozessoren bietet.

Alle diese Hardware-Hilfsmittel sind notwendig, um einen ersten Schritt hin
zu den physikalischen Anforderungen zu machen, die das neue AmigaOS in
seiner Rolle eines digtialen Servers der n&auml;chsten Generation stellen wird.
Eine saubere Implementierung, ohne Leistungseinbu&szlig;en durch das Gebundensein
an die &auml;lteren AA-Systeme, bedeutet vollen Zugriff auf das, wof&uuml;r der
Anwender bezahlt und eine weitaus bessere Leistung &uuml;berhaupt.

Amiga ist sich ebenso bewu&szlig;t, dass Drittfirmen in den vergangenen f&uuml;nf
Jahren mit PPC-Beschleunigerkarten in erfinderischen Implementierungen zur
Erweiterung der Amiga-AA-Plattform beigetragen haben, um die Prozessorkraft
&uuml;ber die eingestellte 68k-Serie hinaus zu erh&ouml;hen. Unter Ber&uuml;cksichtigung
es Designs von OS4 wurde sehr viel dar&uuml;ber nachgedacht, ob es auch auf
diesen Karten laufen k&ouml;nnen soll. Obwohl Amiga sehr dazu bereit war, die
Besitzer solcher Karten f&uuml;r ihre sichtbare Loyalit&auml;t mit dem Amiga zu
belohnen, so war es doch auch schmerzlich offenbar, dass die meisten
dieser Imlementierungen auf eine Weise erfolgt waren, dass zwar den
AA-Amigas mehr Leistung gebracht worden war, deren Einzelteile aber von
der Leistung einer neuen OS-Version nichts mitbekommen, diese verlangsamen
und in manchen F&auml;llen l&auml;hmen w&uuml;rden.

Vor der Tatsache, dass AmigaOS4 der erste Schritt auf dem Weg zu einem
Produkt ist, in dem Leistung von h&ouml;chster Bedeutung sein wird, wurde
entschieden, dass ein sauberer Schnitt gemacht werden muss. Dies geschah
durch die Zico-Spezifikation. Und auf Grund der Klarheit dieser
Spezifikation wurde das erste Ger&auml;t gem&auml;&szlig; Zico in Rekordzeit entwickelt -
der AmigaOne von Eyetech - der ersten neuen, von Amiga zertifizierten
Hardware seit &uuml;ber f&uuml;nf Jahren - und er wird bald ausgeliefert werden.

Dennoch, Amiga denkt noch sehr an die Tausende von loyalen Anwendern und
Entwicklern, die Bedeutendes in die PPC-Erweiterungen investiert haben.
Amiga sucht nach M&ouml;glichkeiten, Drittfirmen ein Gelegenheit zu bieten,
einen Kompatiblit&auml;tslayer auf Sofwarebasis zu schaffen, welcher das reine
OS4 auf diese PPC-Erweiterungen &uuml;bertragen kann.

AmigaOS4 selbst wird das vorhandene, auf dem 68k basierende OS3.9 zu einer
PPC-Implementierung f&uuml;hren. Wegen der Bedeutung f&uuml;r die Erfahrungen des
Anwenders, wird jede Library und jedes Modul untersucht und auf eine Weise
neu implementiert, dass der maximale Vorteil aus den neuen Mutterplatinen
nach Zico-Standard und deren Sub-System-Karten gezogen werden kann. Das
ist ein schrittweiser Vorgang und wird &uuml;ber ein paar Ver&ouml;ffentlichungen
des Betriebssystems verteilt werden. Daraus folgt, dass die erste Version
(OS4.0) eine Mischung aus nativem PPC- und 68k-Code enthalten wird, der
&uuml;ber einen Hochgeschwindigkeits-PPC-68k-Emulator laufen wird. Mit den
folgenden Versionen wird der Anteil an PPC-Code zunehmen, bis das OS
keinen emulierten Code in sich selbst mehr ben&ouml;tigt.

Zus&auml;tzlich wird AmigaOS4 auch die F&auml;higkeiten des Zico-Standard freigeben
und USB, Firewire und vollen Zugriff auf die Welt der
Plug-in-System-Karten f&uuml;r PCI und AGP bieten. Amiga-Anwender werden in der
Lage sein, vollen Vorteil aus den allerneuesten Grafik-, Audio- und
Netzwerktechnologien zu ziehen.

Am aller Wichtigsten ist, AmigaOS4 wird die erste Einf&uuml;hrung des AmigaDE
f&uuml;r existierende Amiganer erleben, indem dieses kooperativ auf dem
Betriebssystem l&auml;uft, und dann langsam darin integriert werden wird, bis,
beim Erscheinen des AmigaOS5, beide auf wirksame Weise verschmelzen, um
Eins zu werden.

AmigaOS4 wird nicht nur in der Lage sein, vorhandene AmigaOS-Applikationen
zu starten (dazu bedarf es eines AmigaOne von Eyetech mit einem damit
verbundenen AA-System, um den AA-Chipsatz bereitzustellen), sondern auch
neue AmigaOS4-Applikationen. Zus&auml;tzlich bedeutet die Pr&auml;senz des AmigaDE,
dass AmigaOS-Anwender auch Zugriff auf die wachsende Zahl der
AmigaDE-Applikationen und dabei alle Vorteile von dessen Host-System haben
werden (eine der Vorteile von Amiga, ein eigenes Host-System zu besitzen).
Und als positiven Nebeneffekt werden sie auch auf eine gro&szlig;e Zahl von
Java-Applikationen zurgreien k&ouml;nnen, weil das AmigaDE auch eine
hocheffektive Java-L&ouml;sung bietet.

Auf einen Steich werden Amiga-Anwender und -Entwickler von einer kleinen,
isolierten Plattform zu einer Plattform gehen, die die Welten des AmigaOS,
AmigaDE und Java &uuml;berspannt. Die einen &Uuml;berfluss an Inhalten und ein
gewaltig wachsendes Marktpotential f&uuml;r Entwickler bietet. Sie k&ouml;nnen
entweder f&uuml;r das AmigaDE entwickeln, wobei sie gro&szlig;e M&ouml;glichkeiten im
Markt haben, die weit &uuml;ber die Zahl der AmigaOS-Anwender hinaus gehen,
oder sie k&ouml;nnen sich auf das AmigaOS konzentrieren und maxmialen Vorteil
aus den fortschrittichen Merkmalen der neuen Hardware und des neuen OS
ziehen. Und wieder liegt die Betonung auf Entscheidung.

Das endg&uuml;ltige Ziel des AmigaOS-Produktes ist es, AmigaOS5 zu erreichen,
worin alle die Dienste, die ein digitales Kernprodukt ben&ouml;tigt,
implementiert sein werden. Dies schlie&szlig;t brandneue und, in machen F&auml;llen
revolution&auml;re Dienste ein, die das AmigaOS wieder fest in den Vordergund
bringen werden. Diese werden intern von Amiga, parallel zur
AmigaOS4-Produktserie, entwickelt und sp&auml;ter im Jahre 2002 verf&uuml;gbar sein.
Weiter Einzelheiten werden bei Fortschreiten der Arbeiten ver&ouml;ffentlicht
werden.

F&uuml;r die, die einen kleinen Appetithappen w&uuml;nschen, folgt nun eine
vorl&auml;ufige Feature- und Versions-Liste. Alles kann noch ge&auml;ndert werden.
Die erste Ver&ouml;ffentlichung von AmigaOS4 wird f&uuml;r den Sommer angestrebt (in
der n&ouml;rdlichen Hemisphere), mit weiteren Ver&ouml;ffenlichungen alle sechs
Monate.

AmigaOS 4

AmigaOS4 zeigt, dass Amiga die Kontrolle &uuml;ber das AmigaOS &uuml;bernimmt und es
neu belebt, indem sie es als integralen Teil des Amiga Digital Environment
vorantreiben.

Das Ziel der Familie der AmigaOS4-Erscheinungen ist es:

  1. Das 68k-OS3.9 zu einem nativen PPC-OS zu f&uuml;hren, es zu verbessern und
     wo n&ouml;tig das OS zu reimplementieren, um Vorteil von der PPC-CPU zu
     haben.
  2. Neue Funktionalit&auml;t hinzuzuf&uuml;gen, um diese und die Leistung des
     AmigaOS zu erh&ouml;hen.
  3. Volle Abw&auml;rtskompatiblit&auml;t &uuml;ber den AmigaOne von Eyetech zu erlauben
     (mit eingebautem Classic-Amiga) oder &uuml;ber jeden AmigaOne.
  4. Die Gemeinschaft zu neuer, State-of-the-Art Hardware zu bringen.
  5. Eine attraktive Computer-Umgebung f&uuml;r nicht-Amiganer zu bieten, um so
     ein Wachsen der Amiga-Gemeinschaft zu unterst&uuml;tzen.
  6. Das AmigaDE ins AmigaOS zu integrieren.
  7. Eine Grundlage f&uuml;r die Entwicklung des AmigaOS5 zu bieten.

Diese Projekt wird von einer gestaffelten Reihe von Ver&ouml;ffentlichungen
begleitet weren, die es Amiga erlauben werden, von Grund auf aufzubauen.
Das gibt den Entwicklern maximales Wachstum der Leistung &uuml;ber die
Versionen hinweg und stellt sicher, dass die Anwender sich regelm&auml;&szlig;ig auf
bessere Produkte freuen k&ouml;nnen, statt &uuml;ber eine lange und frustrierende
Zeitspanne warten zu m&uuml;ssen, bis sie etwas in der Hand haben.

AmigaOS 4.0

AmigaOS4.0 ist in der ersten Ver&ouml;ffentlichung von AmigaOS4. Es stellt den
ersten Schritt auf dem Weg zu einem PPC-AmigaOS dar, enwickelt um aus dem
Potential der auf Zico basierenden Computer vollen Vorteil zu ziehen, die
sich in der Entwicklung befinden.

Es ist so gestaltet, dass es die Schl&uuml;sselelemente des aktuellen AmigaOS
herausnimmt und als natives Systeme reimplementiert, um die gr&ouml;&szlig;te
Leistungssteigerung zu bieten. Die verbleibenden Elemente werden in dieser
Version als 68k-Code verbleiben und &uuml;ber einen PPC-68k-Emulator ausgef&uuml;hrt
werden, der ebenfalls f&uuml;r das Ausf&uuml;hren von Applikationen verwendet werden
wird, die auf dem 68k basieren. Zus&auml;tzlich wird es neue Features
hinzuf&uuml;gen, die noch nie zuvor im AmigaOS verf&uuml;gbar waren.

Die Reihe der Features des OS4 wird Folgendes umfassen:

   o ExecPPC erlaubt das weitere Ausf&uuml;hren von PPC-, 68k- und
     Mixed-Executables (PPC+68k). Dies wird nativ PPC sein.
   o Ein PPC-68k-Emulator - ExecPPC wird in der Lage sein, 68k-Code
     auszuf&uuml;hren, jedoch wird dies &uuml;ber den nativen PPC-68k-Emulator
     geschehen. Es wird zu keiner Zeit ein echter 68k-Prozessor verwendet
     werden.
   o Virtual Memory System - OS4.0 wird es Entwicklern zum ersten Mal
     erlauben, neue Applikationen zu erzeugen, die echte Vorteile aus den
     MMU-F&auml;higkeiten des PPC ziehen und den virtuellen Speicher verwenden
     k&ouml;nnen. Besonders wichtig bei den neuen Spielen und Applikationen,
     die sich in der Entwicklung befinden. Dies wird nativ PPC sein.
   o Grafiksystem - Alles naitv PPC
      o AmiRTG - Retargetabel Graphics System der Hochleistungsklasse, das
        vollen Zugriff auf die Hardwarebeschleunigung modernen
        Grafikkarten bietet.
      o Treiber - Voodoo3 und Matrox G450.
      o Ami2D - Low-Level-Zugriff f&uuml;r hochleistungsf&auml;hige
        2D-Funktionalit&auml;t.
      o Ami3D - Low-Level-Zugriff f&uuml;r hochleistungsf&auml;higie
        3D-Funktionalit&auml;t.
      o Vollst&auml;ndige Implementierung von Mesa 3.4 f&uuml;r die 3D-Entwicklung.
   o Audio-System
      o Integration von AHI f&uuml;r Samples und Streaming
      o Integration von CAMD f&uuml;r MIDI
   o FileSystem - nativ PPC.
      o AmiFFS2 - brandneue Reimplementierung von AmiFFS, die eine viel
        h&ouml;here Leistung und Zuverl&auml;ssigkeit bietet.
   o Verbindungen - nativ PPC.
      o AmiNetStack - brandneuer, hochleistungsf&auml;higer TCP/IP-Stack,
        optimiert f&uuml;r PPC, Multiplayer-Spiele und Inhaltsbetreuung.

Alle weiteren AmigaOS-Libraries werden als 68k-Executables verbleiben und
&uuml;ber ExecPPC mittels des 68k-Emulators ausgef&uuml;hrt.

AmigaOS 4.2

AmigaOS4.2 wird auf die Grundlage des AmigaOS4 aufbauen. Es ist gestaltet,
um:

   o Das Amiga Digital Environment (AmigaDE) in das AmigaOS zu integrieren.
   o Das OS4 v&ouml;llig Device-Retargetable zu machen, was es allen
     Applikationen erlaubt, auch ohne das Vorhandensein &auml;lterer
     Amiga-Harware zu funktionieren.
   o Den Zugriff auf die neuen Hardware-Merkmale der Zico-Spezifikation zu
     &ouml;ffnen.
   o Mehr vom 68k-Code im AmigaOS4.0 nach PPC zu konvertieren,
     reimplementieren.

Die Reihe der Features des AmigaOS4.2 umfasst:

   o Integration des AmigaDE.
      o AmigaDE direkt im AmigaOS gehosted.
      o Voller Zugriff auf alle Inhalte und Entwicklungen.
      o Personal Java
      o SHEEP Script-Sprache
   o Audio-System - nativ PPC.
      o Retargetable Audio System (RTA)
      o AHI/CAMD Treiber f&uuml;r EMU10K1 PCI Karten
      o Multiple Audio Contexts.
      o Fortschrittlicher MIDI Support.
   o USB - nativ PPC.
      o USB2.0 OHCP Stack
      o System-Ger&auml;te-Treiber - Mause, Tastatur, Hub
   o Amiga Device Retargeting - nativ PPC.
      o Amiga.devices reimplementiert als retargetable, wodurch alte
        Amiga-Hardware nicht mehr vorhanden sein muss.
   o Weitere Konvertierung von 68k-Code zu nativ PPC - dies wird zur
     Steigerung der Geschwindigkeit geschehen, um Entwicklern und
     Anwendern die gr&ouml;&szlig;tm&ouml;gliche Verbesserung zu bieten.

AmigaOS 4.5

AmigaOS4.5 stellt die letzte Stufe zu einem nativen PPC-OS dar. Seine
Aufgabe umfa&szlig;t:

   o Allen verbliebenen 68k-OS-Code nach nativ PPC konvertieren.
   o Alle Hardware-Features der Zico-Spezifikation den Entwicklern
     verf&uuml;gbar machen.
   o Neue Anwender-Umgebung

AmigaOS 5

AmigaOS5 stellt eine Revolution in der Entwicklung von 'anderen'
Betriebssystemen dar und die Weiterentwicklung des AmigaOS, die danach
strebt, Anwendern und Entwicklern den besten Weg nach vorn zu bieten. Die
Reihe der Features umfa&szlig;t:

   o Bieten eines brandneuen Service-Models.
      o Virteller Speicher
      o Speicherschutz
      o Symetrische and asymetrische Modis
      o Contract QoS
      o 64 Bit
      o Vollst&auml;ndig dezentralisiet.
   o AmigaOS4 Sandbox
   o PDP-sensorisches Verarbeitungssystem - PDP steht f&uuml;r Pysikalisch zu
     Digital zu Physikalisch und liefert ein skalierbares System, das die
     Erfassung, Konvertierung, Darstellung, Manipulation und Pr&auml;sentation
     von auf die Wahrnehmung begrenzter Beobachtung und Interakton bietet.
   o Orthogonal Persistence - alle Inhalte sind dauerhaft, au&szlig;er sie m&uuml;ssen
     auf einem Speichermedium gespeichert oder von diesem geladen werden.
   o Sichere und unsichere Umgebungen - gesonderte Speicherbereiche, in
     denen Entwickler weiterhin unsichere Sprachen verwenden oder mit der
     neuen Sprache SafeC und dessen Umgebung programmieren k&ouml;nnen.
   o Semantic Context - eine Umgebung, in der der Anwender jede Anzahl von
     Assoziationen, Beziehungen und Bedeutungen f&uuml;r ihre Umgebung und
     Inhalte ablegen und diese semantische Information zur Organisation
     und Abfrage verwenden k&ouml;nnen.«


Die &Uuml;bersetzung aus dem Englischen stammt von Martina Jacobs                
                                                    &lt;Maja@popmail.oche.de&gt;.
(Quelle des Originals: AMIGA, Inc.)

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
