<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(05.04.2001)

Amiga Arena Vollversion!
Mit der Genehmigung von Thomas Dorn liegt TruePaint HD Version, das 24 Bit
Malprogramm zum Download bereit!
TruePaint ist der Vorg&auml;nger von XiPaint!


틻miga Arena News 
(06.04.2001)

Amiga Arena Sonderpreis Aktion!
In Zusammenarbeit mit Pablo F. erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r TaskiSMS!
TaskiSMS ist ein leicht zu bedienener SMS Sender f&uuml;r den Amiga!
Der Sonderpreis betr&auml;gt 50% weniger als normal und ist nur bis
zum 10.05.2001 erh&auml;ltlich.
Die Registration erfolgt &uuml;ber Reg.net!


틻miga Arena News
(09.04.2001)

Amiga Arena Vorver&ouml;ffentlichung!
F&uuml;r alle "Break Out" Freunde liegt ArTKnoid ein Arkanoid
Clone f&uuml;r die WB zum Download bereit!
Dies ist die Erstver&ouml;ffentlichung bevor Aminet von
Thilo K&ouml;hler (Toadies Entwickler)!
Viel Spass beim Spielen!

Amiga Arena TaskiSMS Nachtrag!
Die Registration f&uuml;r die Sonderpreis Aktion TaskiSMS ist
jetzt auch &uuml;ber den Postweg m&ouml;glich!


틻miga Arena News
(14.04.2001)

Amiga Arena Oster &Uuml;berraschung!
F&uuml;r das RPG Spiel Blade von Mark S. liegt die Deutsche &Uuml;bersetzung der
Amiga Arena  exclusiv zum freien Download bereit!
1143 Zeilen wurden in 3*8 Stunden im August 2000 &Uuml;bersetzt!
Viel Spass mit Blade in der Deutschen Version und ein frohes Oserfest
w&uuml;nscht Euch die Amiga Arena!


틻miga Arena News
(17.04.2001)

Amiga Arena Vollversion!
In Zusammenarbeit mit Marcio Esper erm&ouml;glicht die Amiga Arena
die Uneingeschr&auml;nkte Vollversion 1.26 von KidHTML!
Mit KidHTML lassen sich ohne grosse Vorkenntnisse HTML Dokumente erstellen!
Hinweis:
KidHTML ist weiterhin SHAREWARE und kann &uuml;ber die Amiga Arena in
Zusammenarbeit mit der Fun Time World Registriert werden!
Weitere Angaben und Infos finden sich im Downloadbereich unter
"Vollversionen"!

   
틻miga Arena News
(21.04.2001)

Amiga Arena Vollversion!
In zusammenarbeit mit Guido Mersmann erm&ouml;glicht die Amiga Arena
die Registrierte Vollversion f&uuml;r AFind!
AFind ist ein Tool das die Datensuche auf Aminet CDs erleichtert und
vereinfacht!

Amiga Arena Sonderpreis Aktion 
Die Software Frogger/Softcinema sind nur noch bis
zum 22.04.2001 zum Sonderpreis erh&auml;ltlich!

TaskiSMS kann noch bis zum 10.05.2001 zum
Sonderpreis Registriert werden!


틻miga Arena News
(23.04.2001)

Amiga Arena goes Amiga Future!

In Zusammenarbeit mit der Amiga Future
wird sich ab Ausgabe 30 die Amiga Arena
auf der Leser CD Rom befinden.
Die Amiga Arena erm&ouml;glicht auf der
Leser CD Rom Sonderpreise f&uuml;r Shareware,
Vollversionen,Interviews und die ausgew&auml;hlte Linksammlung
der Amiga Arena.
Die CD Rom Ausgabe der Amiga Arena wird stetig
erweitert und wird nicht identisch sein mit dem
Online Angebot!

Amiga Arena - Amiga Future Sonderabo Pr&auml;mie!

Die Amiga Arena erm&ouml;glicht In Zusammenarbeit
mit dem APC&TCP eine extra Pr&auml;mie f&uuml;r ein Abo
der Amiga Future!
Zu der kostenlose Pr&auml;mie nach abschluss eines
Abos erh&auml;lt jeder der &uuml;ber die Amiga Arena
ein Abo bestellt die Amiga Arena CD Rom Edition
V1.0 als Bonus kostenlos dazu!
Das Abo ist automatisch nach 6 Ausgaben beendet!

Das Formular befindet sich in der Amiga Arena
unter der Rubrik "Aktionen" oder unter
http://www.amigafuture.de/extra/amigaarenaabo.html

Kontakt:
Amiga Arena:
http://www.online-club.de/~ARENA/

Amiga Future:
http://www.amigafuture.de


틻miga Arena News
(24.04.2001)

Amiga Arena Sonderpreis Aktion!
In Zusammenarbeit mit Christian Effenberger erm&ouml;glicht die
Amiga Arena einen Sonderpreis f&uuml;r Siteway.
Dieses Programmpaket befindet sich noch im Entwicklungsstadium.
Siteway besch&auml;ftigt sich mit integriertem Site- und
Content-Managment.
Infos zu Siteway:

SiteWay soll folgende Eigenschaften besitzen:
Datenbankbasiertes Layout- und Content-Managment.
Automatische Erzeugung von WebSites nach zu bestimmenden Regeln und
Inhalten.
Automatische Erzeugung der Navigationen nach zu bestimmenden Regeln.
Automatische Konvertierung f&uuml;r Webgerechte Datei-Formate.
Globale und Lokale Formate, Regeln und Inhalte.
Templates (Vorlagen) f&uuml;r alle relevanten Bereiche.
Vorgefertigte Templates und Default-Klassen.
Komplexer Template-Editor.
Zentrale oder Dezentrale Verwaltung aller Resourcen.
Erhaltung der Originale aller Resourcen.
Vollst&auml;ndige Projektverwaltung.
Intuitiv zu bedienende GUI.
Funktionserweiterungen mittels externer Programme per DOS und/oder ARexx.

Weitere Infos zu Siteway finden Sie im Bereich "Aktionen" in der Amiga
Arena.


틻miga Arena News
(25.04.2001)

Image/Visuel Engineer CD Rom Sonderpreis Aktion!
In Zusammenarbeit mit der Fun Time World und Marco Sepp&auml;nen kann die Amiga
Arena einen Sonderpreis f&uuml;r die Software Image Engineer/Visuell Engineer 
als CD Rom Edition erm&ouml;glichen. Image Engineer ist wohl die mit abstand 
erfolgreichste und beste Bildbearbeitungs Software im Sharewarebereich die 
sich hinter Kommerzieller Software nicht "verstecken" braucht!
Image Engineer bietet eine vielzahl von m&ouml;glichkeiten um Ihre Bilder zu
bearbeiten.Bitte besuchen Sie die Homepage von Image Engineer f&uuml;r weitere
Informationen und einzelheiten unter:
Image Engineer - http://personal.inet.fi/taide/smarko/ImageEngineer/

Die Image Engineer CD Rom erstellt exklusiv von der Fun Time World w&uuml;rde
s&auml;mtliche zusatzprogramme wie Visuell Engineer,Arexx Scripte,
Anleitungen,Homepage,Tutorials u.v.m. beinhalten!

Der Sonderpreis f&uuml;r die CD Rom Edition von 49,- DM w&auml;re f&uuml;r erstmals 2
Monate m&ouml;glich!

Um Ihnen diese Special Edition zu erm&ouml;glichen setzt Marko Sepp&auml;nen eine
mindest Bestellung von 30 Einheiten vorraus!

Wenn Sie diese CD Rom erwerben m&ouml;chten so f&uuml;llen Sie bitte die verbindliche
Vorbestellung auf der Seite
http://www.funtime-world.de/shop/produkte/ar0002.shtml -  Image Engineer
Bestellung aus!

Kontakt:

Image Engineer:
Mail:Marko Sepp&auml;nen - smarko@quicknet.inet.fi
Homepage: http://personal.inet.fi/taide/smarko/ImageEngineer/

Amiga Arena:
Mail:Olaf K&ouml;bnik - olaf.koebnik@online-club.de
Homepage: http://www.online-club.de/~ARENA/

Fun Time World:
Mail:Sebastian Brylka - FunTime@t-online.de
Homepage:http://www.funtime-world.de


틻miga Arena News
(28.04.2001)

Amiga Arena Sonderpreis Aktion!
In Zusammenarbeit mit Andreas Kleinert erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r SViewIV und akMPEG.
Das Bundle ist nur bis zum 31.05.2001 zum einmaligen Sonderpreis 
erh&auml;ltlich!
Weitere Informationen zur Registration befinden sich in der Amiga Arena
unter der Rubrik "Aktionen".

TaskiSMS Sonderpreis!
Der SMS Sender f&uuml;r den Amiga ist nur noch bis zum 10.05.2001 zum
Sonderpreis erh&auml;ltlich!


틻miga Arena News
(01.05.01)

Amiga Arena Interview Aktion!
Schlachtfeld2 das runden basierende Strategiespiel wurde
von Peter Weigoldt in Amos entwickelt und als Sharware vertrieben.
Schlachtfeld2 machte spielerrich schon Spass doch verlor Ich pers&ouml;hnlich
das Interesse aufgrund der weniger ansprechenden Grafik und der etwas
un&uuml;bersichtlichen Handhabung was die Steuerung der Einheiten betrift!
Seit einiger Zeit hat ein neues Team die Entwicklung aufgenommen und es
scheint anhand der ersten Previews das Schlachtfeld ein wirklich gutes
Strategiespiel werden k&ouml;nnte!
Die Amiga Arena nahm dies zum Anlass und befragte Horst Diebel 
von Amiga Society zu weitern Einzelheiten!
Lesen Sie das sehr ausf&uuml;rhliche Interview in der Rubrik "Aktionen"!

Nachtrag: Amiga Arena meint!

Das Team  um Horst D. ist sehr daran Interressiert das
Ihr euch an der Entwicklung in Form von Vorschl&auml;gen,Grafiken etc. 
beteiligt!
Ihr k&ouml;nnt so Einfluss auf das Spiel nehmen!
Seid Kreativ und unterst&uuml;zt aktiv die Amiga Entwickler es kommt
uns allen nur zu gute!


틻miga Arena News
(01.05.2001)

Amiga Arena Sonderpreis Aktion!
In Zusammenarbeit mit Dirk St&ouml;cker erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r die xadmaster.library.
Die xadmaster.library dient zum entpacken aller Art von Archiven.
Weitere informationen &uuml;ber xadmaster.library finden Sie unter:
http://www.dstoecker.de/xadmaster.html 

Desweiteren besteht die m&ouml;glichkeit eine AmigaOS 3.9 CD 
von Dirk S. Gratis zu erhalten!
Informationen dazu in der Rubrik "Aktionen".


틻miga Arena News
(03.05.2001)

Amiga Arena - F-Base V2.4 Vollversion

Mit der Genehmigung von Frederic Laboureur 
(Entwickler von "PureBasic) erm&ouml;glicht
die Amiga Arena die Uneingeschr&auml;nkte und Registrierte
Version von F-Base V2.4!

F-Base ist eine leicht zu bedienende Datenbank!

Einige Features:

  * System friendly. User configurational.
  * Up to 255 data fields. Up to 9999 records.
  * ECS/OCS and AGA support. Selectable screen modes.
  * Handsome interface (designed for 8 colors).
  * All functions on a single screen. No pull-down menus.
  * Interface 4x faster than standard intuition. 10x faster than MUI.
  * Fully multitasking. System compliant.
  * Can associate a picture and sound to each record. The very first
      MULTIMEDIA database??
  * User configurational record associations for utilities and tools.
  * Selectable print (bold, italics and underlined) for record fields
    and data.
  * Asynchronous multitasking.
  * Fully configurable: fonts, screen mode, options, palette and
    language.
  
Weitere Infos zu F-Base entnehmen Sie bitte der
Englischen Guide!

X-tra Bonus - Deutsche Version!
----------------------------
Die Amiga Arena erm&ouml;glicht in Zusammenarbeit
mit Richard Kapp (GFXDatabase)
die aktuelle Deutsche Locale!

Besonderen Dank an Frederic L. f&uuml;r die Freigabe und Richard K.
f&uuml;r die &Uuml;bersetzung der Locale.

Aufruf!
Wer eine Kuzanleitung oder Preview zu F-Base oder KidHTML schreiben m&ouml;chte
bitte mail an: olaf.koebnik@online-club.de
Um Ihre mithilfe w&uuml;rde ich mich sehr freuen!

Kontakt:

F-Base:
Frederic Laboureur - alphasnd@free.fr

Deutsche Locale:
Richard Kapp - narr.cybersdorf@gmx.net

Homepage:
GFX Database - www.gfxbase.de.vu

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
