<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt 
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke" 
zusammengefasst. 

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@aakt.de


1. In eigener Sache: Einladung zur AMIGA-aktuell-Diskussions-Mailingliste

Hiermit m&ouml;chte ich alle Leserinnen und Leser herzlich dazu einladen, sich 
in der neuer&ouml;ffneten E-Mail-Verteilerliste, rund um Amiga und AMIGA 
aktuell, einzutragen und sich rege, an hoffentlich interessanten, 
Diskussionen zu beteiligen. Wer sich eintragen m&ouml;chte schickt bitte eine E-
Mail an:

aaktdiskussionen-subscribe@egroups.de

Das Subject/Betreff-Feld kann leer bleiben und in der E-Mail braucht auch 
kein weiterer Text stehen.

&Uuml;ber Verhaltensweisen in einer E-Mail-Verteilerliste m&ouml;chte ich mich nicht 
gro&szlig; auslassen. Es gelten die Regeln des "gesunden Menschenverstandes" ;) 
und es gibt gen&uuml;gend Informationen dazu im Netz. Kleinere "Anf&auml;ngerfehler" 
werden von "alten Hasen" aber immer toleriert und diese weisen den 
entsprechenden Teilnehmer auch h&ouml;flich auf eventuelle Fehler hin.

Jeder kann posten "was" und "wieviel" er will, solange die Postings 
irgendetwas mit Amiga oder AMIGAaktuell zu tun haben. Ich m&ouml;chte nicht, da&szlig; 
in der Liste &uuml;ber "Rechts/Linksextreme politische Ansichten", 
"Pornographie" und andere Sachverhalte diskutiert wird, die nichts mit den 
oben genannten Themen zu tun haben. Wer sich rigoros nicht an diese Regeln 
h&auml;lt, bekommt von mir, als Moderator der Mailingliste, bzw. Carsten 
Schr&ouml;der einen auf den "Deckel". Wer sich nach dieser Verwarnung weiterhin 
"daneben" verh&auml;lt, kann auch zeitweise oder endg&uuml;ltig von der 
Verteilerliste ausgeschlossen werden. Ich glaube und hoffe aber nicht, da&szlig; 
dieser Fall wirklich jemals eintreffen wird.

Es ist nicht m&ouml;glich, in diese Liste sogenannte Attachments (angeh&auml;ngte
Dateien) zu schicken. Verwendet dazu bitte den extra daf&uuml;r gedachten 
Filebereich von eGroups. Es stehen allen Teilnehmern insgesamt 20MB 
Webspace zur Verf&uuml;gung. Normalerweise reicht diese Gr&ouml;&szlig;e f&uuml;r alle Zwecke 
aus.

Die von Yahoo bzw. eGroups, am Ende eines Postings, angef&uuml;gte Werbung, hat
nichts mit AMIGA aktuell zutun. Die Redaktion von AMIGA aktuell bedient 
sich einem kostenlosen - leider auch werbefinanzierten - Internet-Dienst.

Denjenigen, die sich n&auml;her &uuml;ber diese Verteilerliste informieren m&ouml;chten, 
kann ich folgende Internet-Links ans Herz legen:

http://www.egroups.de
http://www.egroups.de/group/aaktdiskussionen

Wer noch Fragen oder Probleme hat, schickt eine E-Mail vorzugsweise an 
mich(!) und nicht an Carsten. Ich m&ouml;chte Carsten mit diesem Mailinglisten-
Projekt keine weitere Arbeit aufhalsen.

Hier nochmal alle Adressen in Kurzform:

Abonnieren          : aaktdiskussionen-subscribe@egroups.de
Abonnement k&uuml;ndigen : aaktdiskussionen-unsubscribe@egroups.de
Nachricht absenden  : aaktdiskussionen@egroups.de
Listeninhaber       : aaktdiskussionen-owner@egroups.de
eGroups-Seite       : http://www.egroups.de/group/aaktdiskussionen

Ich w&uuml;nsche allen Lesern viel Spa&szlig; beim Diskutieren!

Christian Aichinger &lt;christian@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
