<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Das AMIGA-aktuell-Gewinnspiel
-----------------------------

1. Ergebnisse des letzten Gewinnspiels

Beim letzten Gewinnspiel haben 27 Leser mitgemacht.
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr bereits 
mit zwei Antworten gewinnen k&ouml;nnt.


Jetzt zur Aufl&ouml;sung:


Standard-Frage: Vor wenigen Tagen ist ein Update zum AmigaOS 3.9            
                erschienen. Wie lautet dessen Bezeichnung?

Antwort: Richtig ist »Boing Bag 1« oder auch »Boing Bag 3.9.1«.


Master-Frage: Nenne drei im AmigaOS 3.9 enthaltene Programme, die mit dem   
              Update in verbesserten Versionen ausgeliefert worden sind.

Antwort: Hier gab es verschiedene Antwortm&ouml;glichkeiten, wie etwa            
         »AMPlifier, UnArc und ViNCEd«.


Meinungsfrage: Hat die Messe »Amiga 2001« deine Erwartungen erf&uuml;llt?

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
1 (Meine Erwartungen wurden erf&uuml;llt.)                                     1
2 (Meine Erwartungen wurden nur zum Teil erf&uuml;llt.)                       14
3 (Meine Erwartungen wurden kaum/nicht erf&uuml;llt.)                         12


Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung 
bezogen:

Andreas Wolf meint: »Meine Erwartung, da&szlig; Amiga Inc. nichts von Bedeutung 
vorzeigen bzw. ank&uuml;ndigen wird, wurde erfreulicherweise nicht erf&uuml;llt. 
Endlich tut man das einzig Richtige und portiert das AmigaOS auf den PPC. 
Man sollte allerdings bedenken, da&szlig; dies schon lange h&auml;tte vollbracht sein 
k&ouml;nnen, h&auml;tte ein gewisser Mr. McEwen damals nicht interveniert...«

Kai Stegemann favorisiert Antwort 2 und f&uuml;gt hinzu: »Denn eigentlich sollte 
es sich ja um einen richtigen Knaller gehandelt haben. Aber Sharp kann ja 
auch weiterhelfen, nur wie lange?«

Volker Grabbe sieht die Ank&uuml;ndigungen sehr positiv: »Die Entscheidung von 
Amiga Inc. ist eine wirkliche &Uuml;berraschung. Ich kann sie verstehen, 
nebenbei, endlich hat es ein Ende mit der ganzen Shareware-Flickerei. 
Endlich ist ein Grundstandard da!!!!!
Jeder kann mit seinen Sachen machen, was er will. Und das wurde getan!
Ich kann die Entscheidung nur begr&uuml;&szlig;en. Endlich mal eine klare Aussage.«

Stellan Pistoor schreibt: »Wenn Amiga Inc. nicht im voraus angek&uuml;ndigt 
h&auml;tte, sie werden eine Sensation verk&uuml;nden, dann h&auml;tte ich Nr. 2 gew&auml;hlt. 
Da das aber nicht der Fall war, w&auml;hle ich Nr. 3. Denn von einer Sensation 
kann man nicht sprechen.«


Fazit:

Ein klares Ergebnis: Die Erwartungen der allermeisten Einsender wurden nur 
zum Teil oder &uuml;berhaupt nicht erf&uuml;llt. Wirklich begeistert von der Messe 
und den dort gemachten Ank&uuml;ndigungen scheinen nur wenige zu sein.


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:

1 x Vollversion von "AFiloFaxPro": Klaus Lindholm
1 x Vollversion von "Amiga Writer 2.0": Thomas Masuch
1 x 3-Ausgaben-Abo der Amiga Future; mit CD, ohne Pr&auml;mie: Kai Stegemann

Herzlichen Gl&uuml;ckwunsch!

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
