<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Preview: Grafikadventure »Aqua«

Besser als Myst? Nat&uuml;rlich mu&szlig; sich jedes Grafikadventure in diesem Stil an
Myst messen. Und dies ist keine einfache Probe, denn immerhin ist Myst das
meistverkaufteste Computerspiel aller Zeiten und feierte (wenn auch
versp&auml;tet) auch am Amiga einen beachtlichen Erfolg. Aber bei Crystal
f&uuml;rchtet man anscheinend den gro&szlig;en Bruder nicht, ganz im Gegenteil, man
sucht diese Herausforderung geradezu. Denn bald wird auch Land of Genesis,
ein Turrican-Clone erscheinen. Und &auml;hnlich wie Myst im Bereich der
Grafikadventure hat Turrican ja wohl die Jump-and-Run-Action-Shooter
beeinflu&szlig;t! Nachdem man die 2.7 MByte gro&szlig;e Datei heruntergeladen hat, gilt
es nun sie irgendwohin auf die Festplatte zu entpacken, wo sie dann ca. 3.3
MByte Platz in Anspruch nimmt. In dem nun entstandenen Ordner AquaDemo
befinden sich neben einem Programm zum Festlegen des Screenmodus noch
Starter f&uuml;r GraKa und AGA sowie eine (englische) Anleitung. Dieser
entnehmen wir dann auch die Hintergrundstory:

Screenshot:
<IMG SRC="../extra/aqua1.jpg" ALT="Screenshot">

Kapitel 1
Irgendwo im Atlantik... Ein dunkler Sturm zieht herauf... Der Himmel ist in
Aufruhr, immer schneller ziehen die grauen Wolken vorbei. Die Wellen
schlagen erbarmungslos um sich, als ob das Meer in tiefster H&ouml;llenqual aus
seinem innersten alles auspucken will. Eine einsame Gestalt zeichnet sich
in diesem Wirbelwind aus Wind und Wellen ab. Es ist eine von der K&uuml;ste
entfernte Bohrinsel, welche sich trotzig gegen die heraufziehende Wand
stellt. Pl&ouml;tzlich, wie aus dem Nichts f&auml;hrt ein Blitz hernieder, gefolgt
von einem Donner - so laut, da&szlig; alles im Umkreis f&uuml;r einen Moment
stillzustehen scheint. Aber langsam erholen sich auch der Wind und die
Wellen wieder und setzten ihren eigenen Angriff auf die Plattform fort. Was
nun geschieht, wird sp&auml;ter nicht ganz rekonstruiert werde k&ouml;nnen: ein
weiterer Blitz, T&ouml;ne, Nebelschleier und eine sich bewegende, unsichtbare
Macht. Der Wind wird langsamer, die See beruhigt sich. Wo einst die solide
&Ouml;lplattform aus Metal stand, befindet sich nichts mehr. Nur die ruhige See.
Der Wind pfeift. Der n&auml;chste Tag...

Screenshot:
<IMG SRC="../extra/aqua2.jpg" ALT="Screenshot">

Du h&ouml;rtest nat&uuml;rlich auch von dem mysteri&ouml;sen Sinken der Plattform.
Optimist wie du nuneinmal bist, glaubtest du, da&szlig; dort noch etwas zu bergen
sei. Etwas, was verdammt viel wert sein k&ouml;nnte. Du mu&szlig;test eine M&ouml;glichkeit
finden, da&szlig; verlassene Wrack zu bergen. Mit einer Tauchausr&uuml;stung w&uuml;rde es
wohl kaum gehen, daf&uuml;r lag das Wrack vermutlich zu tief. Aber es mu&szlig;te
einen Weg geben! Schlu&szlig;endlich liehst du dir ein MiniU-Boot bei einem
Forscher, der das Geld brauchte um seine Arbeit fortzusetzten. Wie immer
ein Optimist.

Nicht viel sp&auml;ter...
Nun stehst du am Dock, wo dein Schiff anliegt, bereit deine gro&szlig;e
Schatzsuche zu beginnen. Dir unbekannt verbirgt sich ein Geheimniss tief
unten im Meer. Ein Geheimniss, welches dich auf die Reise deines Lebens
schicken wird. Eine Reise in eine Welt, der unseren g&auml;nzlich unbekannt.
Eine Welt voll mit Magie, Sch&ouml;nheit, Wunder, R&auml;tsel und einer
zerst&ouml;rerischen Macht, welche &uuml;ber jedes K&ouml;nigreich hersscht. Not und
Elend, aber auch gro&szlig;e Belohnungen erwarten denjenigen, welcher mutig genug
ist die Herausforderung anzunehmen. Wirst du es sein?
Nun ist es dir, die fehlenden Kapitel zu erg&auml;nzen. Kapitel, die sich aus
den Ereignissen auf deinem Weg ergeben.

Screenshot:
<IMG SRC="../extra/aqua3.jpg" ALT="Screenshot">

Auf geht's! Soweit so gut. Die Story h&ouml;rt sich ja ganz interessant an.
Leider ist diese Demoversion nur ein Screenshot-Demo, so da&szlig; ich &uuml;ber die
Steuerung und das Gameplay wenig sagen kann. Da es sich aber um ein
Myst-Clone handelt und auch die Screenshots darauf hindeuten, sieht es wohl
so aus, da&szlig; man nicht wie bei den Point´and´Click-Adventures a´la Monkey
Island eine Figur sieht, welche man &uuml;ber den Bildschirm steuert, sondern
alles aus der Vogelperspektive betrachtet. (Was f&uuml;r ein Satz!). Es wird
immer Bild f&uuml;r Bild betrachtet. Leider machen mir die bisherigen
Screenshots nicht gerade den Eindruck, als k&ouml;nnten sie Myst schlagen. Aber
es sieht auch nicht gerade nach einem MegaFlop aus. Ich denke mal, es liegt
daran ob es eine deutsche Version geben wird, wenn sich Aqua als
Verkaufsschlager in unseren Landen erweisen soll. Es lohnt sich wirklich
nur f&uuml;r Besitzter einer Flatrate, sich die fast 3 MB herunterzuladen, denn
die Screenshots sind wirklich wenig aussagekr&auml;ftig und die Begleitmusik
nervt eher, als da&szlig; sie etwas Stimmung schafft. Zudem gibt es beim Wechseln
der einzelnen Bilder (bei meiner CGX-Version) kleinere Grafikfehler. Wer
aber gerne Myst gespielt hat, kann auf den bald folgenden Test gespannt
sein. Hier wird sich dann herausstellen ob, und wenn ja f&uuml;r wen sich der
Kauf von Aqua lohnt.

J&uuml;rgen Theiner

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
