<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
6. Review: HereticII-AddOn »Abode of Golgotha«

Ein Test zu einem Spiel, das nichts kostet? Ist das wieder so ein omin&ouml;ser
Aufruf zur Raubkopiererei? - Mitnichten. Bei Abode of Golgotha handelt es
sich um ein Add-On zu Heretic II. Aber durch die kostenlos aus dem Aminet
erh&auml;ltlichen 4MByte wird aus Heretic II Abode of Golgotha: Part1. Das
wollte ich genauer wissen und habe mir dieses "Spiel" einmal n&auml;her zu
Gem&uuml;te gef&uuml;hrt. Nat&uuml;rlich setzte ich immer voraus, da&szlig; jeder der dies hier
liest Heretic II installiert hat, deshalb lasse ich die technischen
Vorraussetzungen und dergleichen weg. Auch die Seite Bewertung entf&auml;llt,
weil sie sich im gro&szlig;en und ganzen ja &auml;hneln w&uuml;rde mit der des gro&szlig;en
Bruders. Ich werde also nur auf die Unterschiede eingehen. Zuersteinmal
hei&szlig;t es die Dateien herunterzuladen. Vier MB sind ja nicht gerade die
Welt, nach einer halben Stunde bin ich fertig. Nachdem Entpacken erhalte
ich einen Ordner "Golgotha" sowie einige Dateien. Diese kann ich l&ouml;schen,
den Ordner ziehe ich in meinen Heretic II Ordner. Nun starte ich H2 wie
gehabt, au&szlig;er da&szlig; ich bei "Run Add On" nun Golgotha eingebe. Sobald das
Programm gestartet ist wechsele ich in die Konsole (ESC) und tippe ein: map
golgotha/golgotha und schon kann es losgehen: The Abode of Golgotha ist
kein Sequal zu Heretic II und hat somit seine ganz eigene Hintergrundstory:

Screenshot:
<IMG SRC="../extra/abode1.jpg" ALT="Screenshot">

Er entdeckte es, halb im Schmutz verborgen. Diese goldene Ecke lugte gerade
so hervor, als sei es eine Art von Schatz, der nur darauf warete gefunden
zu werden. Kurien b&uuml;ckte sich und hob es auf: ein Tagebuch. Er blies den
Staub herunter und fand einen ziemlich flachen Baumstumpf; obwohl es es
Suraea immer versprochen hatte, tat er es: er las das Buch. Nat&uuml;rlich haben
ihn Umst&auml;nde dazu getrieben, denn die privatesten Sachen von Suraea zu
lesen gibt Kurien vielleicht einen Tip, was aus ihm geworden ist.

15. Januar
Nun haben Kurien und ich doch noch das Ziel unserer Reise erreicht. Wir
kamen am Tempel meines Gro&szlig;vaters an und ich bekam den Schatz, dies war
mein Geburtsrecht. Wir haben fast ein Jahr gebraucht, aber endlich ist es
unser! Es ist ein in Leder eingebundener W&auml;lzer, welcher alles Wissen
meines Gro&szlig;vaters enth&auml;lt. Ich bin ein bisschen skeptisch, was ich damit
anfangen kann, aber Kurien glaubt, da&szlig; es mehr enth&auml;lt als blo&szlig; W&ouml;rter. Wir
haben immer noch eine verdammt lange Reise vor uns, aber ich zittere schon
jetzt vor Aufregung an den Gedanken der Wiederkehr zu meiner geliebten
Rachel und meinem Sohn David.

10. Februar
Diesen Morgen sa&szlig;en wir wir an unserem Lagerfeuer als ich bemerkte, da&szlig;
Kurien intensiv auf seine H&auml;nde starrte. Er rief mich her&uuml;ber und da sah
ich es: eine unwirklich erscheinende gr&uuml;ne Flame tanzte aus Kurien´s
Fingerspitzen. Ich hatte keine Ahnung, da&szlig; Kurien magische F&auml;higkeiten hat.

15. Februar
Gerade als wir heute &uuml;ber den Markt gingen, stahl ein Dieb die Geldb&ouml;rse
eines der Stallbesitzer. Kurien nahm die Verfolgung auf, fing ihn aber
nicht. Er beweghte seinen Arm, als ob er etwas schmei&szlig;en wollte und warf
einen Ball gr&uuml;nen Feuers aus seiner Hand, dem Dieb an den Hinterkopf. Er
brach zusammen und wir konnten das Geld zur&uuml;ckbringen. Als Dank wurden wir
zum Essen eingeladen. Sp&auml;ter versuchte Kurien das Feuer noch einmal zu
erzeugen, aber es klappte nicht.

20. April
Kurien kann nun die Feuerb&auml;lle erscheinen lassen, wann er es will! Seine
magischen Kr&auml;fte wachsen unglaublich schnell.

27. Juli
Da der Canyon, den wir eigentlich &uuml;berqueren wollten um zu unserer
Heimatstadt, Phire, zu gelangen unpassierbar ist, haben wir uns
entschlossen die n&auml;chstgelegenste Route zu nehmen: durch die W&auml;lder von
Sanchel.

3. August
Alle unsere Sachen wurden gestohlen. Gl&uuml;cklicherweise hatten wir das Buch
bei uns. Nun, wie es aussieht werden wir in Sanchel &uuml;bernachten m&uuml;ssen, bis
wir genug Nahrung gesammelt haben um die Reise fortzusetzten. W&auml;hrend
Kurien auf die Sachen aufpasst, mache ich mich auf den Weg um Essen zu
jagen. Ich mache nun eine Pause, morgen geht es weiter.

4. August
Merkw&uuml;rdigerweise kann ich kein Essen oder Tier finden. In der Hoffnung,
den kleinen Pilz wieder zu finden, den ich vor kurzem sah, traf ich einen
alten Mann, der mir erz&auml;lte, das es hier in der N&auml;he ein Anwesen gibt. Und
wenn ich nichts zu Essen finden w&uuml;rde, wird mir des Bestitzer dort bestimmt
weiterhelfen. Ich werde dort wohl morgen fr&uuml;h einmal hingehen.

Das war der letzte Eintrag. Kurien rieb sich die augen und schaute auf. Der
vierte August. Wie lange war das her? Wochen? Kurien entschied, das der
beste Ort seine Suche nach Suraea zu beginnen dieses Anwesen sei. Nach
nichteinmal einer halben Stunde hatte Kurien es gefunden. Seine grauen
Mauern erstreckten sich bedrohlich &uuml;ber ihn. Kurien trat zur T&uuml;r und
klopfte laut und deutlich... Keine Antwort. Seinen ganzen Mut
zusammennehmend, schwang kurien die T&uuml;r auf und betrat den dunkelen
Flur......

Screenshot:
<IMG SRC="../extra/abode2.jpg" ALT="Screenshot">

Nat&uuml;rlich l&auml;sst sich die Verwandschaft mit Heretic II nicht verleugnen.
sieht genauso aus wie Corvus und auch alle Gegner wurden &uuml;bernommen.
Trotzdem strahlt dieses Add-On einen ganz eigenen Flair aus. Und auch die
R&auml;tsel sind nicht von Pappe. So habe ich gleich in der ersten Szene
minutenlang nach einem Ausgang gesucht, bis ich merkte, da&szlig; man eine der
T&uuml;ren zerst&ouml;ren kann. Und die n&auml;chste &uuml;berraschung wartete direkt danach:
Es gibt auch neue Zwischensequenzen! Zwar gibt es hier keine Sprachausgabe,
sondern nur Untertitel, aber man wird sofort von der packenden Story
gefangen. Sie schickt einen von einem Ort zum n&auml;chsten, bis hin zum
packenden Finale. Schon nach wenigen Minuten war ich von Golgotha
begeistert. Es vermischt den Flair von Heretic II mit neuen Texturen und
einer wunderbaren Story. Denn die R&auml;me sind komplett neu, vom Speisesal f&uuml;r
die Angestellten bis hin zum Badezimmer mit Handtuchhalter. Hier wurde
wircklich auf Details geachtet. Aber nicht nur die R&auml;tsel und die
Geschichte begeistern: es gibt auch einiges zu k&auml;mpfen. Nach und nach
taucht alles an Monstern auf, was bei H2 Rang und Namen hat. Da hei&szlig;t es
schon mal des&ouml;fteren - abspeichern bitte. Aber leider ist es diese
Verwandschaft mit H2, die einen etwas schalen Beigeschmack hinterl&auml;&szlig;t. Denn
dadurch, da&szlig; es eine komplett neue Handlung sein soll, st&ouml;rt das Auftauchen
der "alten" Charaktere. Man braucht wirklich lange, bis man sich daran
gew&ouml;hnt hat, da&szlig; man nicht Corvus vor sich hat, sondern Kurien. Und
somit verbla&szlig;t die M&uuml;he, die in die neue Umgebung gesteckt wurde ein
bisschen. Aber halt nicht viel. Denn dieses Add-On bietet nach wie vor
besten Spielspa&szlig;, wie wir ihn von Heretic II gewohnt sind. Wer also H2
komplett durchhat oder gerade irgendwo h&auml;ngt, f&uuml;r den ist die Abode of
Golgotha Sage genau richtig. Aber halt, Saga? Richtig: es sind mehrere
Teile geplant und ein Test des Sequals wird nicht mehr lange auf sich
warten lassen. Ich wei&szlig; noch nicht viel, nur da&szlig; ich diesmal statt 4MByte
satte 30 MB heruntergeladen habe. Das l&auml;&szlig;t ja auf einiges hoffen, oder?
Aber bevor wir uns auf einen zweiten Teil freuen, st&uuml;rzen wir uns
ersteinmal in dieses Abenteuer. Es gibt viel zu entdecken (cool ist der
Garten) und zu bestaunen. Um so erfreulicher, da&szlig; alle alten Cheats
funktionieren und es auch noch einen kompletten Walkthrough auf der
offiziellen Homepage gibt. Somit sollte ja wohl wirklich jeder durchkommen,
oder? ;-) Was f&uuml;r ein Fazit kann man schon ziehen, bei einem kostenlosen
Spiel mit dem Gameplay von Heretic II, dessen Technik, einer komplett neuen
Story mit neuen Cutscenes und vielen K&auml;mpfen? HERUNTERLADEN!!! Zumal, wo
dieses Add-On so klein ist, sollte sich jeder daranwagen. Und es spielt
sich wirklich genauso fl&uuml;ssig (ich glaube, in manchen Szenen sogar ein Tick
besser) als der gro&szlig;e Bruder. Jungs, hier ist euch wirklich etwas gelungen!
Hut ab. Einzig die Tatsache, da&szlig; die Figuren immer noch gleich aussehen,
st&ouml;rt das Gesamtbild ein wenig, aber etwas mu&szlig; ich ja auch zu meckern
haben.

J&uuml;rgen Theiner

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
