<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
7. Review: DYNAMITE - Bomben legen deluxe! (von R&uuml;diger Gr&uuml;newald)

Wie wir alle wissen, war es schon immer ein riesiger Spa&szlig;, den N&auml;chsten mit 
Bomben, Tretminen oder gar nen Flammenwerfer um die Ecke zu bringen.

Leider wacht das Auge des Gesetztes &uuml;ber uns und zeigt uns den "DuDu darfst 
das nicht"-Finger schon bei der Planung irgenwelcher Bomben-Hinterhalte.

Aber zum Gl&uuml;ck hat der Hobby-Bombenleger einen Computer zu hause und somit 
-Dynamite sei dank- jetzt die M&ouml;glichkeit, sich im Cyberspace gegenseitich 
Bomben unter den Allerwertesten zu schieben. Ohne da&szlig; einer der Beteiligten 
k&ouml;rperlichen Schaden nehmen kann!

DYNAMITE ist ein Clone des beliebten und bekannten Bomberman-
Spielprinzips. Bomberman wurde Mitte der 80´er entwicklelt und mauserte 
sich nach kurzer Zeit zu einem richtigen Kult-Game, welches einen &auml;hnlichen 
Suchtfaktor wie Pac-Man, Tetris oder die Spiele der Super Mario-Reihe 
aufweist. 1989 erschien auch eine offizielle Amiga-Umsetzung, die den Namen 
"Dynablasters" trug. Als weiterer bekannter Amiga-Bomberman-Clone ist 
sp&auml;ter noch "BlitzBombers" als Shareware-Programm erschienen.

Das Spielprinzip von Dynamite und seinen Artverwanden ist recht simpel: In 
einen Labyrinth ist es das Ziel, seinen Gegner mit hochexplosiven Bomben 
ins Jenseits zu bef&ouml;rdern. Das Labyrinth besteht aus festen Mauern, die 
jeder Detonation standhalten und weniger festen, die sich einfach in sich 
zusammenbrechen, sobald sie einer Explosion ausgesetzt werden. Hinter 
letzteren verbergen sich gelegentlich Extras. Der Spieler darf mehr Bomben 
legen oder kann den Wirkungsradius seiner Bombenattacken erh&ouml;hen, er kann 
schneller laufen, sich an einen anderen Ort teleportieren lassen oder 
seinen Kontrahenten mit einem ferngesteuerten Sprengsatz in die Enge 
treiben. Auch ein Flammenwerfer zum r&ouml;sten der Gegner ist im riesigen 
Dynamite-Waffenschrank enthalten. Nat&uuml;rlich gibt es auch "negative" 
Extras, eines kehrt beispielsweise die Steuerung um. 

Viele &auml;ltere Bomberman-Clones haben einen ziemlich biederen 
Einspielermodus, bei dem langweilig rechnergesteuerte Sprites durchs 
Labyrinth gescheucht werden m&uuml;ssen. Darauf verzichtet Dynamite voll und 
ganz und setzt auf das Multiplayer-Erlebnis via Internet. Gerade mit 
menschlichen Gegnern entwickelt sich Dynamite zu einem hecktichen 
Geschicklichkeitsspiel, welches dem Spieler auch noch strategisches Denken 
abverlangt.

Das Dynamite-Download-Archiv l&auml;&szlig;t sich problemlos auf die gew&uuml;scchte 
Fetplatten-Partition endpacken, bringt aber nicht alle ben&ouml;tigten 
Programmdaten mit. Aus dem Aminet mu&szlig; sich der angehende Sprengstoffexperte 
sich noch die "armarquee.library" und die "indentify.library" besorgen. 

Beim erstem Start von Dynamite pr&auml;sentiert sich das Game erstmal auf dem 
normalen Workbench-Screen. Bei einer hohen Bildschirmaufl&ouml;sung wirkt die 
Grafik erstmal "futzelig", erscheint aber im bekannten Bomberman-
Outlook.Dank MUI l&auml;&szlig;t sich Dynamite auf einen kleineren Screenmode bringen.
Es darf zwischen verschiedenen Grafik-Sets gew&auml;hlt werden. Wem die 
Original-Bomberman-Grafik zu ausgelutscht vorkommt, darf sich auch mit der 
Simpsons-Familie oder gar als Boing!-bombenlegender Bill McEvan versuchen.
 
Vorm Spielbeginn ist es Pflicht, sich ins Internet einzuloggen. Nur wer 
online ist darf bei dem explosive Spielgeschehen mitmischen. 
Alle aktuellen Dynamite-Server werden automatisch aus dem Netz 
gefischt. Nun steht dem bombastischen und s&uuml;chtigmachenden Vergn&uuml;gen nichts 
mehr im Wege. Online-Kosten-Gucker sollten jetzt auf der Hut sein!

Als Bonus bringt Dynamite auch noch eine Chat-Option mit. In den kleinen 
Verschnauffspausen zwischen den Matches darf mit den Mitspielern aus aller 
Herren L&auml;nder geplauscht werden. 

Und wenn man noch eine Standleitung ins Internet hat, kann man problemlos 
seinen Amiga als Dynamite-Server per MUI-Oberfl&auml;che ins Netz stellen.

F&uuml;r Dynamite wird kein Hi-End Amiga ben&ouml;tigt. Es reicht schon ein Rechner 
mit 68020-Prozessor und AGA, aber um richtig loszubomben sollte mindestens 
ein 68030 und eine Grafikkarte unter der Amiga-Haube stecken. Es werden 2MB 
Chip- und 4MB Fastram f&uuml;r das krachende Dynamite-Feeling vorrausgesetzt.

Minuspunkte sind in Dynamite wirklich schwer zu endecken. Naja, der Sound 
ist ein wenig mager. Aber da Dynamite ein Freeware-Game (kostet nix=riesen 
Spa&szlig;) ist, wird das zu verschmerzen sein.

Vielleicht treffen wir uns ja demn&auml;cht zu einem Wettbewerb im Netz...

R&uuml;diger Gr&uuml;newald &lt;rudi.g@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
