<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MMX: Bleibt alles anders</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Bleibt alles anders&quot; / Herbert Gr&ouml;nemeyer</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P>Da&szlig; bei Herrn Gr&ouml;nemeyer alles anders bleibt, wei&szlig; man sp&auml;testens seit
Ver&ouml;ffentlichung der Vorab-Single seines gleichnamigen neuen Albums.</P><P>
Diese Erkenntnis macht freilich die Frage danach, was geblieben und was
anders ist &uuml;berfl&uuml;ssig, denn geblieben ist Gr&ouml;nemeyer und selbiger ist
wiedermal ganz anders als der Mann, der f&uuml;r die unz&auml;hligen vorigen Alben
bis &quot;Chaos&quot; verantwortlich war.</P><P>
Hatten wir doch gerade voll Freude registriert, die f&uuml;nf Jahre
Schaffenspause erfolgreich damit zugebracht zu haben, uns an sein
letztes Werk zu gew&ouml;hnen, verwirrt der Ex-Bochumer unsere Ohren nun
wiederum mit einer neuen musikalischen Gangart und unsere K&ouml;pfe mit
r&auml;tselhaften Texten.</P><P>
Das dekodieren dieser wird uns allerdings durch den Umstand vers&uuml;&szlig;t, da&szlig;
die neuen Kl&auml;nge nach kurzer Einh&ouml;rphase sehr melodisch wirken, sich tief
in unsere Geh&ouml;rg&auml;nge einschleichen und dort h&auml;uslich einrichten. Somit
wird den wundervollen Worten, die das Spiel begleiten, ein wohldosiertes
Cocktail zeitgem&auml;&szlig;er Stile gleichsam als samtener Teppich zu F&uuml;&szlig;en gelegt,
&uuml;ber den sie w&uuml;rdevoll den Weg ihrer Bestimmung entgegen gehen k&ouml;nnen.</P><P>
W&auml;hrend sie dies denn tun, stellt man fest, da&szlig; der Meister
stichpunktartigen Textens die Gesellschaftskritik ein wenig beiseite
stellt und sich stattdessen dem Studium des Menschen zuwendet. Mit viel
Herz, Phantasie und vor allem Poesie konkretisiert er den abstrakten
Menschen in satzlosen Kompositionen bedeutungstr&auml;chtiger Gedankenfetzen.</P><P>
Damit auch wirklich jedes Wort der Texte verstanden werden kann, sind
diese allesamt in einem mit Gr&ouml;nemeyer-Portraits bebilderten Booklet
abgedruckt.</P><P>
Die wie immer zum Preis von ca. 30,- DM erh&auml;ltliche CD scheint es mir
das gelungenste aller Gr&ouml;nemeyer-Alben zu sein.</P><P>
&copy; 1998 EMI Electrola</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
