<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MMX: Mezzanine</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Mezzanine&quot; / Massive Attack</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P>Massive Attack - das ist &quot;die Band mit dem Song mit dem Video, wo die
Frau die Stra&szlig;e langl&auml;uft.&quot; So h&ouml;rte man es bei einem bekannten Berliner
Radiosender, als diese vor etwa einem Jahr die Tour der Truppe umwarben.
</P><P>
Ein Jahr mu&szlig;ten jene warten, die die drei damals live erleben durften,
bis das bereits damals vorgestellte neue Album erh&auml;ltlich war. Nun ist
es soweit, die dritte Scheibe aus der Fabrik massiv-grooviger Beats
kursiert nicht nur in den Haushalten der TripHop-Fans.
</P><P>
"Mezzanine" schm&uuml;ckt sich mit respekteinfl&ouml;&szlig;enden Fotos eines
Hirschk&auml;fers - oder ist es vielleicht ein Roboter? Songtexte gibt es
freilich nicht, da von solchen ja auch wenig zu h&ouml;ren ist. Worauf es
hier ankommt, das ist vor allem die Musik, ob die Jungs von Liebe, von
Schmerz oder einfach vom Nachbarn erz&auml;hlen, bleibt sich dabei relativ
gleich.</P><P>
Langsam und grummelig beginnt der erste Track, gerade so, wie man es
erwartet h&auml;tte. Allm&auml;hlich wird der Sound angereichert und verdichtet,
eine m&auml;nnliche Stimme setzt ein, bis das ganze schlie&szlig;lich durch dichte
Gitarrenkl&auml;nge gekr&ouml;nt wird.</P><P>
&Auml;hnlich geht es weiter, dann erklingt der bereits wohlvertraute Rhythmus
der ersten Single &quot;<B>Teardrop</B>&quot;. Etwas kr&auml;ftiger f&auml;llt noch einmal &quot;<B>Inertia</B>
<B>Creeps</B>&quot; aus, dann folgen eher ruhige Titel bis zu &quot;<B>Man next door</B>&quot;, der
recht schnell ins Ohr geht und wohl am meisten an die beiden
Vorg&auml;ngeralben erinnert.</P><P>
Mit &quot;<B>Black Milk</B>&quot; schlie&szlig;t sich ein sehr sch&ouml;ner, sanfter Titel an,
gefolgt vom Titeltrack. Die 10 Titel werden letztlich durch &quot;<B>Group Four</B>&quot;
abgerundet, einem 8:13 Minuten langen St&uuml;ck, das g&auml;nzlich anders endet,
als es beginnt und gerade dieses Ende ist eine der sch&ouml;nsten Stellen der
CD. Auf dieser fand allerdings noch eine ge&auml;nderte Version von &quot;<B>Exchange</B>&quot;
Platz, der bereits an f&uuml;nfter Stelle vertreten war.</P><P>
Dies bringt die Gesamtspielzeit des Albums auf 63 Minuten, 42 Sekunden.
F&uuml;r einen &uuml;blichen Preis von etwa 30,-DM ist hier also eine CD zu haben,
die freilich ein klares Mu&szlig; f&uuml;r Massive-Attack-Fans ist, aber auch bei
Freunden beseelten groovigen TripHops ein angenehmes Baumeln der Seele
verursacht.</P><P>
&copy; 1998 Circa Records Ltd.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
