<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MMX: Kundun</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Kundun&quot;</H1>von<BR><A HREF="mailto:A.Wyrwa@gmx.de">Andr&#233; Wyrwa</A></DIV>
<P>Irgendwo weit ab von der westlichen Zivilisation, ihren Ma&szlig;st&auml;ben und
Werten, liegt fern im Osten, eingebettet in riesige Gebirgsketten, ein
Land, das gerade in letzter Zeit in das Licht unserer Aufmerksamkeit
ger&uuml;ckt wird: Tibet.</P><P>
In der allgemeinen Glaubenskrise der gro&szlig;en wirtschaftlichen Systeme
scheint der nach Alternativen suchend um sich schweifende Blick
fasziniert an diesem kleinen, bescheidenen Land und seiner Religion,
seinen Werten zu verweilen, um anhand dieses Kontrastes &uuml;ber das eigene
Dasein zu reflektieren.</P><P>
Martin Scorsese, bekannt f&uuml;r die eigenwillig trockene N&uuml;chternheit seiner
Werke (&quot;Taxi Driver&quot;, &quot;Die Farbe des Geldes&quot; ...), widmete seine Zeit
ebenfalls diesem Volk und schuf eine portr&auml;tierende Studie seines
gegenw&auml;rtigen geistigen F&uuml;hrers, des 14. Dalai Lama. Grundlage hierf&uuml;r
bildet die Autobiographie desselbigen.</P><P>
&quot;Kundun&quot; ist sehr dokumentarisch gehalten, Scorsese legt es nicht darauf
an, den Zuschauer in seinen Bann zu ziehen, ihm irgendeine Stimmung
aufzudr&auml;ngeln. Er erz&auml;hlt in sachlichem Ton, was er zu sagen hat, l&auml;&szlig;t
sich daf&uuml;r hier und da sehr viel Zeit, zeigt Szenen, die er nie erkl&auml;rt,
baut geradezu beil&auml;ufig symbolische Momente ein, die den Geschehnissen
Bedeutung geben.</P><P>
Hier und da bietet der Anblick sich von Geisterhand aufbauender
Sandbilder den Gedanken des Betrachters Zeit, bei den j&uuml;ngst vergangenen
Szenen zu verweilen, als w&uuml;rde Onkel Scorsese eine eine Seite in seinem
dicken, alten M&auml;rchenbuch umbl&auml;ttern. Die Symbolik dieser offenbart sich
nur denen, die ihre Bedeutung kennen.</P><P>
All diese Bilder erscheinen nicht einfach aneinander geschnitten auf der
Leinwand, oft werden sie durch weiches &Uuml;berblenden miteinander verbunden,
vereinzelt durch etappenweises Zoomen oder raffinierte Bildausschnitte
und Lichtverh&auml;ltnisse unauff&auml;llig betont.</P><P>
Das Werk bleibt trotz all dieser Raffinessen schwer verdaulich, es ist
lang, etliche unkommentierte Bilder mu&szlig; der Zuschauer aufnehmen, die erst
sp&auml;ter eine Bedeutung erhalten, wenn &uuml;berhaupt.</P><P>
&quot;Kundun&quot; will nicht verf&uuml;hren, wie es &quot;Sieben Jahre in Tibet&quot; tat, es ist
eine Studie, wenn auch eine liebevolle. So verzichtet Scorsese denn auch
auf einen gro&szlig;artigen Soundtrack und l&auml;&szlig;t stattdessen die Ger&auml;usche jenes
Landes sprechen, die nur von zur&uuml;ckhaltenden Kompositionen begleitet
werden.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806cd4.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0698/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
