<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MMX: Anthology</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Anthology&quot; / Asia</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P><B>Anthology</B> ist Asia`s neueste CD. Kein Album, sondern ein Compilation mit
einer Anzahl Songs aus ihren vergangenen Werken. Seit den Tagen, in denen
die Gruppe mit dem Deb&uuml;talbum "Asia" und Titeln wie &quot;<B>Heat Of The Moment</B>&quot;
Musikgeschichte schrieb, Anfang der achtziger Jahre, hat sich einiges
ver&auml;ndert. Nach und nach, zwei nicht mehr so erfolgreiche Alben sp&auml;ter
(<B>Alpha</B> und <B>Astra</B>) sind die einzelnen Mitglieder fortgegangen, meist um
sich auf ihre Solokarrieren zu konzentrieren. So auch John Wetton, der
S&auml;nger.</P><P>
Nur Geoff Downes, der Keyboarder, verantwortlich auch f&uuml;r einen guten
Teil der Songs, war verblieben und fand schlie&szlig;lich in John Payne einen
markanten und sehr f&auml;higen `Ersatz`, der nun schon l&auml;nger dabei ist,
als sein Vorg&auml;nger. Ansonsten wird auf wechselnde, aber generell
hochkar&auml;tige Musiker gesetzt, die auch in anderen bekannten Gruppen
wie `Alice Cooper` und `Simply Red` musizierten.</P><P>
Auf dieser CD wurden einige Titel aus den Alben mit dem zweiten S&auml;nger,
ausgew&auml;hlt, so aus &quot;<B>Aqua</B>&quot;, &quot;<B>Aria</B>&quot; und &quot;<B>Arena</B>&quot; und den gemischten und
sehr interessanten &quot;<B>Archiva 1</B>&quot;, sowie &quot;<B>Archiva 2</B>&quot;. Aber auch einige der
bekanntesten Songs aus der `Vor-Payne-Periode` wurden 1997 neu eingespielt
und sind hier zusammen mit zwei vorher unver&ouml;ffentlichten Bonus-St&uuml;cken
enthalten.</P><P>
Um das Erscheinen von Anthology gab es &uuml;brigens einigen Trouble, denn
zuerst kam die CD in Japan heraus, mit anderem Cover und etwas ge&auml;nderter
Titelauswahl. Auf dieser Version waren ein paar der Titel, die zuerst
von John Wetton gesungen wurden, in der Originalversion enthalten, so
da&szlig; auch ein direkter Vergleich m&ouml;glich war. Rechtliche Probleme haben
das in Europa aber verhindert.</P><P>
Bei den neu eingespielten Titeln handelt es sich um &quot;<B>Only Time Will Tell</B>&quot;,
&quot;<B>Don`t Cry</B>&quot; (einer meiner Favoriten), &quot;<B>The Heat Goes On</B>&quot;,
&quot;<B>Go</B>&quot; und nat&uuml;rlich &quot;<B>Heat Of The Moment</B>&quot;. Sie sind allesamt sehr gut gelungen
und halten sich ausgesprochen eng an die urspr&uuml;ngliche Instrumentierung.
Welchen S&auml;nger man bevorzugt, bleibt Geschmackssache. Viele schw&ouml;ren
auf den ehemaligen, aber meiner Meinung nach hat John Wetton eine
wesentlich eingeschr&auml;nktere stimmliche Bandbreite, was bei Songs, die
in seinem `Bereich` liegen, aber nicht so sehr auff&auml;llt.</P><P>
Obwohl ich die alten Titel nicht missen m&ouml;chte, sp&uuml;rt man bei den neueren
doch den Generationssprung. Ob es sich um den phantastischen Titelsong
gleichen Namens von &quot;<B>Arena</B>&quot; handelt, der eine gro&szlig;e melodische
Vielschichtigkeit offenbart und dem John Paynes Stimme so viel Gef&uuml;hl
und Kraft verleiht oder um das mitrei&szlig;ende &quot;<B>Who Will Stop The Rain</B>&quot;,
so erscheint der Klang voller und die Kompositionen aufwendiger als bei
sonst h&auml;ufig im Radio geduddelter Musik.</P><P>
Interessante Anf&auml;nge und ausgefeilte Instrumental-Sequenzen sind sehr
h&auml;ufig Bestandteil der Titel, die oft vor Energie spr&uuml;hen (z.B. &quot;<B>Anytime</B>&quot;,
&quot;<B>Someday</B>&quot;), einem aber auch einen ruhigen Gegenpol zur stressigen Umwelt
bieten k&ouml;nnen (&quot;<B>Feels Like Love</B>&quot;, wunderbarer Tempowechsel!).</P><P>
Mit &quot;<B>Aqua Part 1</B>&quot; ist ein Beispiel f&uuml;r eines von Asia`s gelungen reinen
Instrumentals enthalten, die qualitativ ganz sicher mit ber&uuml;hmten St&uuml;cken
von Jean Michel Jarre oder Alan Parsons mithalten k&ouml;nnen.</P><P>
Auch die Texte sind nicht 08/15, &quot;<B>Reality</B>&quot; erinnert mich jedenfalls
immer an mein Computerhobby :) </P><BR>
<DIV ALIGN="CENTER"><B>&quot;It`s down your wire, it`s on your screen<BR>
Pirate satellite, next to MTV<BR>
Insert your hand, subscription free<BR>
It`s reality&quot;</B></DIV>
<P>&quot;<B>Different Worlds</B>&quot;, einer der beiden Bonustitel, geh&ouml;rt mit Sicherheit
zu den besonderen Glanzst&uuml;cken auf dieser CD. Ein langsamer, aber
nicht ausnahmslos softer, dabei Emotionen weckender Titel, der von der
Erkenntnis handelt, mit jemandem nicht zusammenkommen zu k&ouml;nnen. Es gibt
unsichtbare, un&uuml;berwindliche Grenzen, als ob man in &quot;unterschiedlichen
Welten&quot; lebt.</P><P>
Das Cover bietet, anders als die letzten Alben, kein aufwendiges Motiv,
sondern zeigt gro&szlig; das Logo auf wei&szlig;em Grund, was auch ziemlich auff&auml;llig
wirkt. Innen sind gut lesbar alle Texte und ein paar Aufnahmen der
Bandmitglieder w&auml;hrend ihrer Live-Auftritte enthalten, sowie eine Skizze
mit einem kompletten geschichtlichen Abri&szlig; &uuml;ber die Wurzeln der Gruppe,
woher die Mitglieder kamen, wann welche Alben erschienen usw.. Sehr
originell und eine gelungene Beigabe.</P><P>
<B>Anthology</B> ist eine gut abgestimmte Mischung des bisherigen Asia-Werkes.
Hier sind nicht nur ein paar Sahnest&uuml;ckchen versammelt, sondern ein
paar einzelne Titel aus einer ganzen Auswahl hochklassiger. Der ideale
Einstieg, um mit der Gruppe bekannt zu werden. Wenn man als Fan bereits
einige Alben hat, mu&szlig; man entscheiden, ob die neu eingespielten und die
Bonustitel den Kauf wert sind. In diesem Jahr erscheint &uuml;brigens Asia`s
neues Album.</P><P>(P)+&copy; Snapper Music 1997, Preis ca. 30 DM</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806cd3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
