<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/98 - MMX: The Robe</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;The Robe&quot; / Ten</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>Schon mit dem ersten St&uuml;ck, dem <B>Titelsong</B> des aktuellen (dritten) Albums
der englischen Melodic Rock-Gruppe <B>Ten</B> geht es richtig zur Sache. Als
Einf&uuml;hrung spricht eine tiefe m&auml;nnliche Ba&szlig;stimme ein paar Worte &uuml;ber eine
Suche, die die ganze Welt umfa&szlig;t. Dann setzen schnelle Rhythmen und kurz
darauf der S&auml;nger Gary Hughes ein. Nach einiger Zeit wird der Kehrreim,
bei jetzt im Verh&auml;ltnis zur&uuml;ckhaltender Hintergrundinstrumentierung, von
einem an Kirchengesang erinnernden Chor gesungen (sehr originell!), bis
zusammen mit dem Rest der Instrumente auch die Liedstimme wieder einsetzt.
Zum Schlu&szlig; wird es ruhiger und Gary Hughes beweist, da&szlig; die Melodie des
Refrains auch einen sanften Titel getragen h&auml;tte. Etwa neun kurzweilige
Minuten sind nun vorbei.</P><P>
Die ersten Kl&auml;nge des sich nahtlos anschlie&szlig;enden Titels &quot;<B>Bright on the</B>
<B>Blade</B>&quot; nehmen zuerst die ruhigeren T&ouml;ne auf, bis sich schnell die
hohe Geschwindigkeit des Songs erweist, der einen mitzurei&szlig;en
versteht.</P><P>&quot;<B>Standing on the Edge of Time</B>&quot; ist sicher einer der besten Titel auf der
Scheibe, auch wenn gerade auf ihr die Konkurrenz gro&szlig; ist. Schnell, doch
trotzdem eine Stufe &quot;softer&quot;, als der zweite, wei&szlig; er Emotionen zu
wecken. Der S&auml;nger bleibt in jeder Phase gef&uuml;hlvoll und verf&uuml;hrt einen
beinahe zum mitsingen oder zumindest mitsummen, w&auml;hrend der rockige
Hintergrund begeistert.</P><P>
Als kleinen Ausgleich f&uuml;r die bisher durchweg hohe Geschwindigkeit soll
&quot;<B>Virtual Reality</B>&quot; dienen. Ein in gewisser Weise klassischer Liebessong, nur
das der S&auml;nger in seiner Sehnsucht sich seine Geliebte
herbeiphantasiert:</P><BR><DIV ALIGN="CENTER"><B>&quot;You are,<BR>Lady, you`re
the one<BR>Helping keep my sanity tonight.<BR>You have in a moment become<BR>Virtual reality...
<BR>Tonight...</B>&quot;</DIV>
<P>Sehr intensiv, sehr ruhig - wunderbar, zusammen mit der sich markant
abhebenden Guitarre.</P><P>
&quot;<B>Arcadia</B>&quot; beginnt wieder mit der sehr vollen Ba&szlig;stimme, mit der wir schon
in dem ersten Titel Bekanntschaft machten. Wie zu erwarten, macht dieser
Song nun wesentlich h&auml;rter weiter als sein Vorg&auml;nger, auch wenn er erst
etwas verhalten beginnt. Irgendwie haftet ihm aber etwas besonderes an,
ein ganz besonderer Rhythmus, welcher etwas von der Mystik und Magie der
Vergangenheit sp&uuml;ren l&auml;&szlig;t, von der er k&uuml;ndet.</P><P>
Weiter geht es dann mit &quot;<B>Battlelines</B>&quot;. Wieder schnell, mit gutem Standard,
aber eigentlich nicht so herausragend.</P><P>
Nun ist wieder Zeit f&uuml;r Entspannung. &quot;<B>You`re in my Heart</B>&quot; ist ein
sch&ouml;ner Liebestitel, der erfreulicherweise, wie gewohnt, nie die
Ebene der Schmalzigkeit erreicht.</P><P>
Klavierkl&auml;nge er&ouml;ffnen &quot;<B>Fly like an Eagle</B>&quot;, bis harte Guitarrengriffe
einsetzen und schlie&szlig;lich der Titel `losbricht`, der insgesamt aber dann
doch relativ gem&auml;&szlig;igt wirkt und bei dem man durchaus `abheben` kann, bis
zum Schlu&szlig; wieder das einsame Klavier die Melodie abschlie&szlig;t.</P><P>
&quot;<B>Ten Fathoms Deep</B>&quot; beginnt mit einem Blitzeinschlag, mit Wind, Regen und
Sturm und einem Gesang, der einem im Verlauf des Titels mit der Dramatik
eines Schiffes bekanntmacht, da&szlig; gegen die Elemente k&auml;mpft und schlie&szlig;lich
verliert. Es wird vom Meer verschlungen, wo es zehn Faden tief ruht, ohne
sein Geheimnis jemals zu l&uuml;ften.</P><P>
Der letzte und nat&uuml;rlich zehnte Song der CD &quot;<B>Someday</B>&quot; handelt von einer
einsamen Frau, die aufgrund ihrer entt&auml;uschten Liebe (oder ist `er`
gestorben?) Selbstmordgedanken hegt. Ein langsamer Titel, der sich bei
den Refrains jedesmal aufzub&auml;umen scheint und einen wirklich anspricht.
Und wenn man sich bei seinem Ende wieder daran erinnert, da&szlig; er knapp 8
Minuten gehen soll, kann man es wieder kaum fassen - keine Sekunde
zu wenig, keine zuviel.</P><P>
Das Booklet, in dem neben einem Gruppenfoto auch alle Texte enthalten
sind, macht einen ausgesprochen pr&auml;chtigen Eindruck. Einziger Nachteil:
An verschiedenen Stellen ist der Text durch seine Verschn&ouml;rkelung und
den Hintergrund schwer zu lesen, aber das ist zu verschmerzen. Auf
dem Cover prangt eine Standarte, wie sie die alten R&ouml;mer bei ihren
Triumpfz&uuml;gen und Paraden vor sich hertrugen, nat&uuml;rlich erg&auml;nzt um das
Ten-Logo.</P><P>
Es zeigt sich, da&szlig; <B>Ten</B> sich weiterentwickelt hat, von der eher soft-
dominierten ersten CD (Vergl. Ausgabe 4) &uuml;ber die zweite, &quot;<B>Name of the</B>
<B>Rose</B>&quot;, die das wieder ins Gegenteil verkehrt hat und mir insgesamt, bis
auf ein paar herausragende Titel, nicht so gut gefallen hat.</P><P>
Und nun das dritte Album, mit interessanten Texten, grunds&auml;tzlich
schneller und h&auml;rter als das erste - eine gute Mischung. Wie man an
einer Gesamtspielzeit von 65:37 bei zehn Titeln ersehen kann, haben
eigentlich alle Titel &Uuml;berl&auml;nge oder was als &Uuml;berl&auml;nge gilt. Sie wirken
aber keinesfalls &uuml;berdehnt, sondern die Zeit wird, wie sich auch schon
in dem Deb&uuml;t ank&uuml;ndigte, f&uuml;r gelegentliche spezielle Intros, manchmal
auch Extros genutzt.</P>
<P>(P) &amp; &copy; 1997 Now&Then Records.<BR>
Vertrieb durch MTM Music; Preis ca. 33 DM.</P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9806cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0698/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9806film.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
