<HTML>
<HEAD>
<TITLE>Die 4 Kartenteile</TITLE>
</HEAD>
<BODY bgcolor=#FFEEDD text=#000000 link=#0000FF alink=#FF0000>

<H1><CENTER><FONT COLOR=#FF0000>Teil 2 -Die 4 Kartenteile</FONT></CENTER></H1>
Auf dem Boot nimmst du das Papageienfutter mit, und gehst rein. Als erstes nimmt der Kapit&auml;n direkten Kurs auf Phatt Island.<br>
Gleich nach deiner Ankunft auf der Insel wirst du verhaftet und dem Gouverneur vorgestellt. Nach eurer Unterhaltung landest du im Gef&auml;ngnis und mu&szlig;t einen Weg finden da auszubrechen. Nichts leichter als das, als erstes nimmst
du mal den Stock unter der Matraze weg, und holst dir mit ihm den Knochen von deinem Zellenkumpan. Der Hund kommt auch sofort angetrabt, und gegen den Knochen gibt er dir den Schl&uuml;&szlig;el. Wenn du raus aus der Zelle bist schnappst du dir die beiden
Umschl&auml;ge, und gehst raus. In der Gasse neben dem Gef&auml;ngnis wird gerade Gl&uuml;cksrad gespielt. Da dieser kleine Knirps anscheinend dauernd gewinnt folgst du ihm wenn er verschwindet in die Gasse neben der B&uuml;cherei. Nachdem der Typ wieder weg ist klopfst du
auch mal an, und fragst nach der n&auml;chsten Zahl. Beim Passwort sagst du ihm einfach die Zahl, die er zuerst mit den H&auml;nden gezeigt hat. Mit der Gewinnzahl gehst du dann zum Gl&uuml;cksrad, und holst dir die Einladung. Du kannst dir auch das Geld holen, aber
die Einladung brauchst du unbedingt. Nun gehst du in die B&uuml;cherei, und benutzt das Karteikastensystem. Du brauchst folgende B&uuml;cher:<UL>
<LI>Das Voodoo-Kochbuch
<LI>Ber&uuml;hmte Unterg&auml;nge.
</UL>
Wenn du sie gefunden hast holst du dir einen B&uuml;cherei-Ausweis, und leihst sie aus. Aus dem Leuchturm-Modell nimmst du die Linse mit, und gehst den Weg entlang zum Haus vom Gouverneur.<BR>
Dem W&auml;chter erz&auml;hlst du, er verwechsele dich, und da&szlig; da ein Feuer in der K&uuml;che ist. Oben angekommen schiebst du dem fetten Typen das Buch &uuml;ber Big Whoop zu, und krallst dir gleichzeitig die Auspr&uuml;che bekannter Piraten. Nun gehst du wieder zu<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Scabb Island</FONT></CENTER></BIG><BR>
Da du jetzt ja einen Ausweis hast kannst du in die Kneipe gehen, und dir einen Drink bestellen. Du brauchst einen Dotterbart und einen Blauwal. Aus diesen Drinks mixt du dir dann einen gr&uuml;nen Drink zusammen. Lecker! Und f&uuml;r den Affen haben wir ja noch die Banane. Steck sie
aus das Metronom, und der Affe geh&ouml;rt dir. Nun gehst du zu<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Booty Island</FONT></BIG></CENTER><BR>
Das erste Haus ist ein Gesch&auml;ft, dort kaufst du<UL>
<LI>Das Nebelhorn
<LI>Das Schild neben dem Papagei
<LI>Die alte S&auml;ge
</UL>
Nachdem du dann das Papageienfutter auf den Haken geh&auml;ngt hast kannst du auch den Spiegel kaufen. Wieder drau&szlig;en gehst du zum Kost&uuml;mverleiher, und gibst ihm die Einladung, woraufhin er dir ein Kost&uuml;m &uuml;bereicht. Sehr passend, mu&szlig; ich schon sagen!<BR>
Drau&szlig;en nimmst du auch noch ein Flugblatt mit, und gehst rechts auf den Weg. Beim Spuckwettbewerb gehst du folgenderma&szlig;en vor: Als erstes trinkst du dieses gr&uuml;ne Ges&ouml;ff aus der Bar, dann wartest du bis der Wind nach rechts bl&auml;&szlig;t (das sieht man am Schal der Frau),
und wenn du gespuckt hast bl&auml;&szlig;t du in das Nebelhorn, und vertauscht die Flaggen. Dann spuckst du nochmal, und solltest nun den 1. Platz haben.<BR>
Mit deiner Plakette gehst du in den Laden, und tauscht sie gegen Bares ein. Dann siehst du im Buch nach, bei welchen Koordinaten die MadMonkey versank, und heuerst Kate an. Wenn du das Schiff gefunden hast nimmst du die Galeonsfigur mit, und tauscht sie beim H&auml;ndler gegen die Karte ein.
Nun gehst du zur Partie der Gouverneurin. Bei der Wache zeigst du Kost&uuml;m und Einladung vor, und wirst durchgelassen. Bei Elaines Haus l&auml;ufst du erstmal ums Haus herum, und machst ein wenig Krach mit den M&uuml;lltonnen. Wenn der Koch rauskommt l&auml;ufst du vor ihm davon, immer ums Haus herum. Wieder bei
der K&uuml;che gehst du schnell rein, bevor der Koch kommt, und schnapst dir einen Fisch. Dann gehst du aber endlich auf die Party, und schnapst dir als erstes das 2. Kartenst&uuml;ck. Wieder drau&szlig;en wird unser Held Gaybraff Threekwhool von einem m&auml;chtigen Gegner niedergeschlagen: Dem G&auml;rtner!!!<BR>
Wieder oben mu&szlig;t du Elaine dazu bringen dir zu verzeihen. Nichts leichter als das. Nur leider schmei&szlig;t sie die Karte aus dem Fenster. Das ist nicht gut. Naja, bevor du runtergehst holst du noch das Paddel aus dem Zimmer, und unten nimmst du auch noch den Hund mit. Wenn du noch das Kleid anhast gehst du halt kurz in den Wald, und ziehst
dich um. Mit den Hund einem Affen und einem Fisch in der Tasche gehst du nun zum Gro&szlig;en Baum, und steckst das Paddel in eines der L&ouml;cher. Dann sicherst du lieber ab, oder holst dir was zu schreiben, damit du Guybursch Traum nicht vergi&szlig;t. Ach ja Traum: Einfach auf das Ruder treten, es bricht ab, und du bist im Land der Tr&auml;ume....aufschreiben
nicht verge&szlig;en (Brust an Hand usw.). Nach deinem Traum nimmst du das Ruder, und gehst zu Captain Dread. Von hier aus geht es wieder mal nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Phatt Island</FONT></CENTER></BIG><BR>
Als erstes bewegst du deinen Hintern mal zu dem Angler, und wettest mit ihm du w&uuml;rdest gr&ouml;&szlig;ere Fische fangen als er. Und da du ja bereits einen riesigen Fisch hast, hast du die Wette schon gewonnen. Aber wo wir schon mal hier sind verschleiern wir auch noch unser Fandungsbild. Am besten mit dem sch&ouml;nen Gesicht von Cate Capsize. Wenn du dann die Insel verl&auml;&szlig;t wird Cate
prompt verhaftet. Wieder zur&uuml;ck auf der Insel befreist du sie, und nimmst die den Grogersatz aus ihrem Umschlag. Nun schipperst du nach<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Scabb Island</FONT></BIG></CENTER>
Mit deinem gebrochenen Ruder geht es ab zum Zimmermann, der es dir verbessert wiedergibt. Dann gehst du noch zu den Piraten, und s&auml;gst dem mit dem Holzbein selbiges ab. Wieder beim Zimmermann schnappst du dir nun den Hammer und N&auml;gel, und gehst zur&uuml;ck nach<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Booty Island</FONT></BIG></CENTER><BR>
Als erstes gehst du zu Stans, und l&auml;&szlig;t dir einen billigen Sarg zeigen. Wenn er ihn dir vorf&uuml;hrt (Wie meint er das eigentlich mit diesem Long John Silver???) steigt er in den Sarg, und du kannst ihn zumachen, und mit ein par N&auml;geln versehen. Mit dem Gruftschl&uuml;&szlig;el verziehst du dich dann wieder, und zwar zur Klippe. Mit der Angelrute sollte es nun leicht sein die Karte zu schnappen, oder?
Falsch gedacht, wieder erliegt Guybru&szlig;h einem &uuml;berm&auml;chtigen Feind: Einer M&ouml;ve. Aber wir wissen ja, wo sie sich aufh&auml;lt. Beim Gro&szlig;en Baum steigst du wieder auf das Ruder, und steigst den Baum hoch. Oben angekommen nimmst du das Teleskop vom hinteren Baumhaus, und gehst in die vordere T&uuml;r. Mit dem Hund suchst du die richtige Karte raus, und gehst nach<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Phatt Island</FONT></BIG></CENTER><BR>
Hier gehst du zum Wasserfall, und dort den Weg nach oben. An der Pumpe benutzt du den Affen, um das Wasser abzustellen, und gehst wieder runter. Durch das gro&szlig;e Loch kommst du zu einem weiteren Haus. Im Haus begr&uuml;&szlig;t dich ein &uuml;berfetter S&auml;ufer, der einen Wettstreit anbietet. Gewinnen tut derjenige, der den anderen unter den Tisch s&auml;uft. Easy! Wenn er dir deinen Grog gibt sch&uuml;ttest du das Glas in den Baum hinter dir, und
f&uuml;llst statt dessen deinen Ersats-Grog rein. Na, wer wird hier wohl gewinnen?<BR>
Nachdem er umgekippt ist legst du den Spiegel in den Rahmen an der Wand, und gehst raus. Dort &ouml;ffnest du das linke Fenster, und wirfst der Statue das Fehrnrohr in die Hand. Wieder drinnen dr&uuml;ckst du auf den Stein, auf dem vorher der Lichtschein war, und du hast deine dritte Karte. Gl&uuml;ckwunsch. Jetzt gehst du aber erstmal wieder nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Scabb Island</FONT></CENTER></BIG><BR>
Hier gehst du auf den Friedhof, und &ouml;ffnest mit Stans Schl&uuml;&szlig;el eine der Gruften (Grufts? Gruftes? Gruftie?). In einer der S&auml;rge liegt der Tote den wir brauchen. Welcher Sarg das ist verr&auml;t uns das Buch vom Fetten Gouverneur. Beim richtigen Sarg nimmst du ein wenig Asche, und dann gehst du zur Voodoo Frau. Aus ihrem Regal nimmst du die Asche-zu-Leben Flasche, und sagst ihr, da&szlig; du etwas Asche hast. Und ein Voodoo Kochbuch hast du ja auch!
Also kannst du jetzt zum Friedhof gehen, und ein wenig mit den Toten rumspielen...<BR>
Wenn der Typ wieder lebendig ist, fordert er dich auf zum Strand zu gehen, und nach dem Gas zu sehen. Das machst du nat&uuml;rlich gerne. Wenn du es abgedreht hast gibt er dir auch genauso gerne ds 4. Kartenst&uuml;ck. Mit den ganzen Einzelteilen gehst du jetzt zu Wally, und bittest ihn, da&szlig; er sie dir wieder zusammensetzt. Ein Monokel f&uuml;r ihn hast du auch, n&auml;mlich die Leuchtturm-Linse. Bei der Wahrsagerin holst du die Liebesbombe f&uuml;r ihn ab, und steigst dann in die Kiste die beim Sumpf steht. Es geht ab nach<BR>
<A HREF="-tips_monkey2hard3.html"><CENTER><BIG>Teil 3 -LeChucks Festung</BIG></CENTER></A>
