<HTML>
<HEAD>
<TITLE>Monkey 1</TITLE>
</HEAD>
<BODY bgcolor=#000000 text=#FF0000 link=yellow>
<FONT color=#FFFFFF SIZE=+1>
Tja, Monkey Island 1...alt aber gut!<BR>
Nach all den Jahren immer noch eines meiner Lieblingsadventures.
Bevor ich es vergesse:<BR> Screenshots oder &auml;hnliches konnte ich leider nicht
machen, da die Grafiken in MonkeyIsland zu einem gro&szlig;en Teil vom Copper aufgebaut
werden, und die Demo von HrtMon leider weder speichern erlaubt, noch bei mir
einwandfrei funktionierte.</FONT><P><FONT SIZE=3></FONT>
Aber gut, es gilt Pirat zu werden! Du beginnst dein Abenteuer auf M&ecirc;l&eacute;e Island<SUP>TM</SUP>, und zwar mit<BR>
<BIG><CENTER><FONT COLOR=YELLOW>Die 3 Pr&uuml;fungen</FONT></CENTER></BIG>
Zuallererst besuchen wir mal die Piraten in der Bar.
Die drei Piraten die dort am Tisch sitzen sagen uns, da&szlig; Guybrush Threepwood
zuerst mal 3 Pr&uuml;fungen bestehen mu&szlig;:
<UL>
<A HREF=#Meisterin><LI>Er mu&szlig; den Schwertk&auml;mpfer besiegen.</A>
<A HREF=#Schatz><LI>Er mu&szlig; den Schatz von Meele Island heben.</A>
<A HREF=#Idol><LI>Er mu&szlig; das Idol der Gouverneurin stehlen.</A>
</UL>
<A Name=Schatz>
<CENTER><BIG><FONT COLOR=yellow>Der Schatz</FONT></BIG></CENTER>
Als erstes wartest du hier mal, bis der Koch aus der K&uuml;che verschwunden ist,
dann geht Guybrush rein, klaut Fleisch und Topf, und verl&auml;&szlig;t die K&uuml;che durch
die rechte T&uuml;r, um seinen Mut im Kampf gegen ein Ungeheuer zu beweisen: Eine 
M&ouml;ve! Da er offentsichtlich keinen Mut hat, verscheucht er die M&ouml;ve kurz,
indem er 3X auf das Brett tritt, auf dem sie sitzt, und sich dann schnell
den Fisch schnappt. Aus dem Fisch machen wir Eintopf, und unser neues Ziel
ist es ein wenig Geld aufzutreiben. Wir geleiten ihn also zur&uuml;ck zu den Klippen,
und biegen rechts in einen Pfad ein, der uns auf der Insel herumf&uuml;hrt. Wir gehen
also zur Lichtung, wo sich der Zirkus aufh&auml;lt und beweisen unseren Mut, indem
wir Guybrush abknallen. Nachdem er sich hat herumschie&szlig;en lassen kriegt er auch
die Belohnung daf&uuml;r: 478 Goldst&uuml;cke. Von dem Geld kannst du einkaufen gehen,
und zwar in der Stadt. Daf&uuml;r gehts zur&uuml;ck zur Bar, und von da aus nach rechts
durch den Torbogen. Dem Kartenverk&auml;ufer sagst du einfach, du h&auml;ttest einen
Friseur namens Dominique, und schon dreht er dir so ein wertloses Teil an,
f&uuml;r nur 100 Piepen! Durch den gro&szlig;en Torbogen gelangst du in den anderen Teil
der Stadt, das erste Haus geh&ouml;rt dem Gemischtwarenh&auml;ndler. Dort kaufst du ein
Schwert und den Spaten, und fragst ihn nach der Schwertmeisterin. Wenn er
losdackelt folgst du ihm in den Wald zur Meisterin. Das ist notwendig, weil
sich unser Held nicht allein in Wald traut...<BR>Von der Meisterin wollen wir
aber erstnochmal nix, wir verlassen also den Wald, und f&uuml;hren Guybrush zur
Kreuzung. Hier sammelt er auch gleich noch die gelben Bl&uuml;ten, f&uuml;r sp&auml;ter.
Wenn ihr den Tanzschritten auf der Karte richtig folgt, f&uuml;hrt sie euch zu 
einem gro&szlig;en X unter dem sich der Schatz versteckt, und zwar...ein T-Shirt! Wow!
Aber wenigstens hast du die erste Pr&uuml;fung erf&uuml;llt, wir kommen zu<BR>

<A NAME=Meisterin><BIG><CENTER><FONT color=yellow>Die Schwertmeisterin</FONT></CENTER></BIG>
Du gehst nun zur Br&uuml;cke und schenkst dem Troll deinen Hering, woraufhin du
weiter darfst. Als n&auml;chstes nimmst du Untericht beim Schwertk&auml;mpfer, und dann
mu&szlig;t du erst noch 3-4 Piraten einsch&uuml;chtern, bevor die Meisterin sich mit dir abgibt.
Solltest du bei den <A HREF="-tips_solbeleidigung.html">Beleidigungen</A> mal nicht weiterwissen, auch kein Problem.
Wenn dir einer der Piraten sagt, du k&ouml;nntest die Meisterin besiegen kannst du es ja mal versuchen.
Aber Vorsicht: Die Schwertmeisterin verwendet andere Beleidigungen, du mu&szlig;t versuchen aus deinem
Wortschatz die richtige Antwort auszuw&auml;hlen. Wenn du es geschaft hast sie zu besiegen
mu&szlig;t du deine F&auml;higkeiten als Dieb beweisen, du mu&szlig;t<BR>
<A NAME=Idol><CENTER><BIG><FONT COLOR=yellow>Das Idol stehelen</FONT></BIG></CENTER>
Als n&auml;chstes marschiert Guybrush in die Stadt und dann immer nach links,
den Berg hoch. Die H&uuml;ndchen werden bet&auml;ubt, indem wir ihnen das mit gelben Blumen
vergiftete Fleisch zuwerfen, und wir sind drin.
Von hier aus geht`s in den Wandschrank, und du kannst dich kurz zur&uuml;cklehnen,
und auf die Verbzeile sehen. Wenn er wieder raus kommt m&uuml;&szlig;en wir eine Feile
besorgen. Da der H&auml;ndler keine mehr hat gehen wir...na? Ins Gef&auml;ngni&szlig;. Da wird doch
wohl einer eine Feile haben! Aufgrund des Mundgeruchs des Gefangenen besorgst
du lieber erstmal ein PfefferMinz beim H&auml;ndler. Nachdem du nun mit ihm reden
kannst gibst du ihm das Nagetier-Spray, und er gibt dir einen Kuchen mit einer
Feile drin. Mit der Feile krallen wir uns das Idol und...werden prompt verhaftet.
Nach einem kleinen Gespr&auml;ch wird Guybrush versenkt, und wir m&uuml;&szlig;en sehen, wie
wir ihn da raus kriegen. Wenn Guybrush l&auml;nger als 10 Minuten unter Wasser 
bleibt, stirbt er, und baumelt als gr&uuml;ne Wasserleiche am Seil :).
Er nimmt jetzt also ganz einfach das Idol, schnappt sich noch ein Schwert und geht &uuml;ber Wasser.
Guybrush sieht gerade noch LeChuck abdampfen, dann ist er auch schon weg und
mit ihm Elaine. Mit der Notiz in der Tasche gehst du nun in die Bar, und sammelst
alle 5 Kr&uuml;ge auf. In der K&uuml;che werden diese dann mit Grog gef&uuml;llt, und nun
mu&szlig;t du mit dem Grog schnell ins Gef&auml;ngni&szlig;, die Zelle auf&auml;tzen. Bevor der Krug
weg ist umf&uuml;llen nicht vergessen!<BR>
Nachdem Otis die faule Sau weggelaufen ist, gehen wir erstmal in die zweite
T&uuml;r rechts rein, zur Wahrsagerin. Dort nehmen wir das Gummihuhn mit, und bewegen
unseren Spieler zur Schwertmeisterin. Diese sagt uns nat&uuml;rlich sofort ihre Hilfe
zu, und nun fehlt uns nur noch ein dritter Mann und ein Schiff. Auf der Karte
gehst du nun nach oben-rechts zur Insel, und schwingst dich mit dem Gummihuhn
zum Haus. Nachdem wir ihm den Zettel gezeigt und unseren Mut bewiesen haben,
indem Guybrush den Papagei ber&uuml;hrt macht auch er mit. Fehlt nur noch das Schiff.
Mit dem Huhn geht es zur&uuml;ck, und gehst du auf der Karte zu den Lichtern, zu
Stans Gebraucht Schiff-Basar. Nachdem du dir das billigste Schiff angesehen
hast fragst du nach einem Kredit und machst dich auf den Weg zum Gemischtwarenh&auml;ndler.
Wenn du ihn nach einer B&uuml;rgschaft fragst geht er zum Tresor und &ouml;ffnet ihn.
Du solltest dir gut merken, wie rum er den Hebel dreht. Nachdem er dein Gesuch abgeschmettert
hat fragst du einfach nochmal nach der Schwertmeisterin, und &ouml;ffnest selber den
Tresor. Mit der B&uuml;rgschaft gehts dann wieder zu Stan, und nachdem du alle Extras
abgelehnt hast, sollte er mit dem Preis auf 5800 runter sein. Biete ihm nun die
B&uuml;rgschaft an, und dieses abgetakelte Wrack geh&ouml;rt dir. Wieder am Steg erwartet
dich Stan bereits mit deinem Schiff, und die Manschaft ist auch schon da.
Es kann losgehen auf <BR>
<A HREF="-tips_monkeyreise.html"><BIG><CENTER>Die Reise</CENTER></BIG></A>

