<HTML>
<HEAD>
<TITLE>ZAK MC KRACKEN AND THE ALIEN MINDBENDERS</TITLE>
</HEAD>
<BODY BGCOLOR=#000000 TEXT=#888888 LINK=#000000 alink=#FFFFFF vlink=#FF0000>
<TABLE BORDER=0 align=center>
<TR>
<TD width=600>
<CENTER>
<IMG SRC="zak2.gif" BORDER=0 width=131 height=46>
<IMG SRC="zak1.gif" BORDER=0 width=257 height=61 ALT="Zak Mc Kracken">
<IMG SRC="zak3.gif" BORDER=0 width=196 height=65>
</CENTER>
</TD></TR></TABLE><BR>
Nach deinem mehr als seltsamen Traum wachst du in deinem Zimmer auf. Als erstes nimmst du mal alles an dich, was da so rumliegt:<BR>
Deinen Goldfisch, die Rechung aus der Schublade, mit der Rechnung die Cashcard, den Tapetenfeten, die Tr&ouml;te aus der 2. Schublade, und den Teppich kannst du auch zur&uuml;cklegen, darunter sind ein par lose Bretter.<P>
Im n&auml;chsten Raum sorgst du erstmal f&uuml;r Ordnung: Das Kissen geh&ouml;rt aus Sofa, unter dem anderen Kissen liegt die Fernbedienung, der Stecker geh&ouml;rt in die Steckdose, und es gibt jede Menge Sachen zum Mitgehenlassen:<BR>
Den Schl&uuml;&szlig;el, das Buttermesser, das Ei aus dem K&uuml;hlschrank, und die Buntstiftpackung unter der Sp&uuml;le werden dich nun begleiten. Sushi nicht mehr, aus der machen wir nun Sushi: Ab in den Ausgu&szlig; mit ihr. Vorher noch den M&uuml;llzerkleinerer anmachen!<BR>
Dann geht es auf die Stra&szlig;e, und zum B&auml;cker. Nach 3 mal Klingeln schmei&szlig;t er dir eine Packung frisches Brot runter (Zementweich!). Dann gehst du zur Post, und bezahlst deine Telefonrechnung. Die Bewerbung nimmst du auch noch mit. Bei der Gelegenheit kannst du auch mal am Telefon nach der Nummer sehen. Geh dann nach drau&szlig;en, und f&uuml;ll die Bewerbung und den Tapetenfetzen mit dem Buntstift aus. Dann &ouml;ffnest du deinen Briefkasten mit dem Schl&uuml;&szlig;el, und schmei&szlig;t die Bewerbung rein. Dann geht Zak beim Bu&szlig; vorbei um die Ecke, und in das Gesch&auml;ft rein.<BR>
Hier kaufst du am besten alles, was nicht niet- und nagelfest ist. Dann gehst du raus, und &ouml;ffnest den Werkzeugkasten. Mit der Drahtschere kappst du die Dr&auml;hte von dem Nadel-schild rechts, und steckst es ein. Dann gehst du zum Bus, und spielst auf der Tr&ouml;te, woraufhin der Fahrer aufwacht. Nach der Bezahlung geht es ab zum Flughafen. Dort kaufst du dem Sektenmietglied ein Buch ab, und gehst ins<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Flugzeug</FONT></CENTER></BIG><BR>
Bevor du in Seattle ankommst befindest du dich erstmal im Flugzeug. Unter dem Sitzkissen vor dir liegt ein Feuerzeug, das steckst du ein; das Sitzkissen au&szlig;erdem. Vorher gehst du aber ins Klo, und packst das Papier in die Sp&uuml;le. Nachdem du auf diese Weise eine &uuml;berschwemmung angerichtet hast, rufst du die Stewardess, und machst dich davon. Ganz vorne ist eine Mikrowelle, da legst du das Ei rein, und schaltest sie ein. Mit dieser Bescherung ist die Frau dann erstmal besch&auml;ftigt, und du kannst die Gep&auml;ckf&auml;cher nach einem Sauerstoffger&auml;t absuchen. Dann kannst du auch das Sitzkissen nehmen. Bevor du gehst nimmst du noch das Klopapier mit. Danach landest du in<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Seattle</FONT></CENTER></BIG><BR>
Als erstes brichst du den Ast von dem Baum ab, und gibst dem Eichh&ouml;rnchen die Erdn&uuml;sse. Du k&ouml;nntest es auch mit irgendwas erschlagen (Brot, Gitarre, Schraubenzieher, Ast, Golfschl&auml;ger...) allerdings kommst du dann sp&auml;ter nicht weiter. Um in die H&ouml;hle zu kommen gr&auml;bst du die Erde mit etwas geeignetem weg, z.B. dem Golfschl&auml;ger oder dem Ast. Drinnen suchst du die Feuergrube, und legst den Ast hinein. Solltest du kein Papier haben, kannst du dir auch mit dem Golfschl&auml;ger das alte Vogelnest schnappen, und ebenfalls dareinlegen. Dann z&uuml;ndest du das alles an, und gehst nach rechts. Die Punkte an der Wand kannst du mit dem gelben Buntstift verbinden, und es &ouml;ffnet sich eine Geheimt&uuml;r. Hinter der T&uuml;r befindet sich der erste Kristall, der blaue. Um ihn da rauszubekommen mu&szlig;t du einfach die Fernbedienung mit dem Sensor benutzen. Dann hast du Skynet an den... ach nee, falsche Story! So, dann mu&szlig;t du wieder nach Hause. Du kannst entweder ein Flugzeug nehmen, oder du benutzt den Kristall. Daraufhin wirst du ohnm&auml;chtig, und einer der Au&szlig;erirdischen erscheint, und nimmt dich mit.<BR>
<BIG><CENTER><FONT COLOR=#FF0000>San Francisco</FONT></CENTER></BIG><BR>
Der Typ sperrt dich in eine Zelle, in der du langsam den Verstand verlierst. Um das zu verhinder ziehst du dir schnell folgende Sachen an: Hut, Taucheranzug, Nasenbrille. Dann h&auml;lt dich der Au&szlig;erirdische f&uuml;r einen von ihnen, und l&auml;&szlig;t dich frei. Dein Kristall befindet sich in dem Schrank ganz links. Mit ihm gehst du erstmal in dein Zimmer, und &ouml;ffnest die losen Platten unter dem Teppich mit dem Schraubenschl&uuml;&szlig;el. Dann kannst du das Seil runterlassen, und absofort immer ungest&ouml;rt bei den Au&szlig;erirdischen ein- und ausgehen. Durch diesen Geheimgang gehst du dann nach drau&szlig;en, und wieder in deine Wohnung (damit das Seil an der T&uuml;r bleibt). In deinem Briefkasten sollte inzwischen die The King Fan Club-Karte liegen. In deiner Wohnung benutzt du dann den Schraubenschl&uuml;&szlig;el mit dem Abflu&szlig;, und steckst das Brot in die Sp&uuml;le. Wenn du den Abfallzerkleinerer anwirfst erh&auml;llst du jede Menge Kr&uuml;mel. Dann gehst du wieder in die 14 Stra&szlig;e, und wirfst den Kristall in den Briefkasten. Bei Annie erh&auml;lst du dann einen weiteren Men&uuml;punkt: Wechseln. Damit kannst du zu einem anderen Spieler wechseln. Als erstes wechselst du zu Annie, und nimmst die Cashcard unter der Schreibtischablage mit. Dann m&uuml;&szlig;t ihr beide zum Flughafen gehen. Dazu stellen sich beide vor dem Bus auf, Zak bl&auml;&szlig;t die Tr&ouml;te, und nacheinander steigen beide ein und bezahlen. Dann seid ihr wieder beim Flughafen. Bevor es hier weitergeht wechselst du aber erstmal auf den<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Mars</FONT></CENTER></BIG><BR>
zu Melissa. Als erstes gehst du in den Wagen, und nimmst alles mit was da so rumliegt: Die DAT-Kassette, den Recorder, die Sicherung und die Cashcards. Eine von ihnen gibst du an Leslie. Zwischendurch solltest du am Sauerstoffhahn immer mal wieder nachtanken. Dann gehst du zum Monolithen links, und ziehst dir zwei M&uuml;nzen. Dann gehst du in die Herberge, und schraubst mit den M&uuml;nzen die Sicherungsklappe ab. Nachdem du die alte Sicherung genommen hast steckst du die neue rein, und machst die T&uuml;r zu. Vorher wechselst du aber zu Leslie, und f&uuml;hrst sie ebenfalls in die Herberge. Wenn du die andere T&uuml;r &ouml;ffnest l&auml;&szlig;t du Sauerstoff rein, und kannst nun auch den Helm abnehmen. Melissa nimmt sich dann das Klebeband vom Schrank, und daraus die Taschenlampe. Au&szlig;erdem steckt sie noch die Leiter ein. Leslie nimmt dann den Besen. Danach ziehen beide ihre Helme an, und du gehst mit Leslie nach drau&szlig;en. Dort fegst du dann den ganzen Sand weg, und es kommen Solarzellen zum Vorschein. Dann geleites du beide wieder in die Herberge, und l&auml;&szlig;t Luft rein. Danach nehmenb beide die Helme ab, und du wechselt zum<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Flughafen</FONT></CENTER></BIG>
Zak kauft sich ein Ticket nach Miami.<BR>
Dem Penner gibt er das Buch, und bekommt daf&uuml;r eine Flasche Whyski von ihm. Dann fliegst du &uuml;ber London nach Katmandu/Nepal.<BR>
Dann z&uuml;ndest du ganz rechts den Heuhaufen an, damit der Typ aus dem Gef&auml;ngni&szlig; kommt. Dann holst du dir die Fahnenstange und den Zellenschl&uuml;&szlig;el vom Gef&auml;ngni&szlig;, und gehst zu der Wache. Wenn du ihm das Buch zeigst l&auml;&szlig;t er dich rein. Der Guru erkl&auml;rt dir nun den Gebrauch das blauen Kristalls, und dann gehst du wieder zum Flughafen. Von dort aus fliegt Zak nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Kinshasa</FONT></CENTER></BIG><BR>
Nachdem du einige Zeit durch den Dschungel gelaufen bist solltest du dich entweder komplett verlaufen haben, oder zu einem Dorf gelangt sein. Wenn du dem H&auml;uptling den Golfschl&auml;ger schenkst zeigt er dir einen Tanz. Wenn das Feuer angeht merkst du dir die Reihenfolge der Leute. Dann gehst du wieder zum Flughafen, und von dort aus &uuml;ber Kairo-Miami zum<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Bermuda-Dreieck</FONT></CENTER></BIG><BR>
Du wartest im Flugzeug, bis du von den Au&szlig;erirdischen hochgebeamt wurdest, und merkst dir dann die Kombination, die der Pilot eingibt. Achte darauf, da&szlig; du au&szlig;erhalb des Beambereichs stehst. Danach klingelst du an der T&uuml;r, und wirst zum KING gef&uuml;hrt:<BR>
<CENTER>ELVIS!!!</CENTER><BR>
Nachdem du ihm deine Fanclub-Karte gezeigt hast zeigt dir der Caponier den Code nach Hause, den du dir auch merken solltest. Bevor du dich zur&uuml;ckschicken l&auml;&szlig;t wirfst du noch einen Blick auf den Lott-O-Mat, der die Lottozahlen von Morgen kennt. Diese solltest du dir nat&uuml;rlich auch unbedingt merken. Dann benutzt du den Code des Piloten, und &ouml;ffnest dann schnell den Fallschirm.<BR>Im Wasser benutzt du die Tr&ouml;te, um den Delphin anzulocken. Dann transferierst du deine Seele in den Delphin mittels des Kristals, und tauchst in die Tiefsee. Dort unten suchst du ein leuchtendes Objekt, und bringst es zu Zak. Gerettet wirst du von den Caponiern, die dich in die Verdummungszelle werfen. Aber du bist wenigstens wieder in<BR>
<BIG><CENTER><FONT COLOR=#FF0000>San Franzisco</FONT></CENTER></BIG><BR>
Als erstes holst du dir deine Sachen wieder, und gehst dann zum Laden, wo du dir einen Lottoschein holst. Danach fliegt Zak nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Lima</FONT></CENTER></BIG><BR>
Nachdem du ein wenig durch den Dschungel geirrt bist kommst du zu einem Futterplatz, an dem du deine Brotkrumen loswirst. Wenn der Vogel da ist machst du ein bischen Brainleasing mit ihm, und fliegst dann zur go&szlig;en Schnitzerei. Im linken Auge findest du eine Schriftrolle, die du dann zu Zak bringst. Daraufhin wirst du wieder von den Caponiern festgenommen, und nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>San Franzisco</FONT></CENTER></BIG><BR>
verfrachtet. Wenn du frei bist holst du dir deine Sachen, und gehst zu Lous um dir deinen Gewinn zu holen. Dann gehst du wieder zum Flughafen, und fliegst diesmal nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Mexico</FONT></CENTER></BIG><BR>
Nachdem du aus dem Dschungel gekommen bist, solltest du vor einem gro&szlig;en Tempel stehen. Da drin ist erstmal alles duster, aber die Fackeln kannst du ja mit deinem Feuerzeug anmachen. Du mu&szlig;t dir den Weg nach drinnen bahnen, zur Kammer mit dem gelben Kristall. Wenn du dort angekommen bist wechselst du zum<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Mars</FONT></CENTER></BIG><BR>
Melissa:<BR>
Melissa geht aus der Herberge (Helm nicht vergessen!!!), und nach rechts zum Riesengesicht. Mit der Leiter kommst du an die Kn&ouml;pfe, und dr&uuml;ckst sie in der Reihenfolge, die du beim Tanz des Shamanen gesehen hast. Daraufhin sollte sich eine T&uuml;r &ouml;ffnen. Du nimmst die Leiter mit, und gehst rein. An der zweiten Statue merkst du dir die Zeichen, die ben&ouml;tigst du hinterher bei Zak. Dann gehst du zur hinteren T&uuml;r, und klebst das Klebeband auf die Kassette. Dann legst du die Kassette in den Recorder, und stellst auf Aufnahme. Dann benutzt sie die blaue Kristallkugel, um einen Ton zu erzeugen. Dann den Recorder abstellen, und zur mittleren T&uuml;r gehen. Wenn du nun dein Sample abspielst &ouml;ffnet sich die T&uuml;r. Nach einem kurzen Gang kommst du zu einem Raum, &auml;hnlich dem in Mexico. Hier nimmst du das Ankh mit, und gehst zur hinteren T&uuml;r. In diesem Raum dr&uuml;ckst du das Ankh in die Wandtafel, und das Kraftfeld verschwindet. Dann nimmst du den kleinen goldenen Schl&uuml;&szlig;el, und dr&uuml;ckst den Schalter am Projektor. Nachdem sie sich alles angeh&ouml;rt hat geht sie zur ersten T&uuml;r, die sich genauso &ouml;ffnen l&auml;&szlig;t. Dann befindest du dich wieder in einem Labyrinth.<BR>Im Inneren gehst du durch folgende T&uuml;ren: Blau, links, rosa und dann rechts. Dann solltest du zu einem Raum kommen, in dem eine Sphinx abgebildet ist. Die Zeichnung solltest du dir unbedingt merken. Dann gehst du folgenderma&szlig;en zur&uuml;ck: Lila, gr&uuml;n, gr&uuml;n, links. Dann kannst du zur Herberge zur&uuml;ckgehen.<BR>Anmerkung: Wenn du mit Leslie ins Labyrinth gehst kannst du folgenden Weg nehmen: Blau, links, rechts, rosa. Das f&uuml;hrt dich zu einer Maschine, die Sauerstoff produziert. Wenn du sie anstellst kannst du im Labyrinth deinen Helm abnehmen. Melissa taugt dazu leider nicht, da sie nicht Schwindelfrei ist. Das macht es sp&auml;ter jedoch sehr viel leichter. Zur&uuml;ck geht es dann folgenderma&szlig;en: Gr&uuml;n, gr&uuml;n, gr&uuml;n, links. Dann kannst du sie auch zur Herberge bringen. Drau&szlig;en mu&szlig;t du allerdings wieder deinen Helm anziehen. Wenn sie bei der Herberge ist wechselst du zu<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Mexico</FONT></CENTER></BIG><BR>
Zak:<BR>
In Mexico tr&auml;gst du mit dem Gelben Buntstift die Zeichen vom Mars bei der Statue auf, und du erh&auml;lst die zweite H&auml;lfte des Gelben Kristalls. Dann gehst du raus aus dem Labyrinth, und fliegst nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>London</FONT></CENTER></BIG><BR>
Du gehst aus der T&uuml;r raus, und da der Zaun elektrisch aufgeladen ist holst du erstmal Annie. Ihr gibst du die Whyskey Flasche, und nachdem sie mit der Wache auf Verbr&uuml;derung gesoffen hat, kann sie den Strom abstellen. Zak &ouml;ffnet dann den Zaun mit der Drahtschere, und beide gehen hindurch. Annie kriegt von Zak noch die Schriftrolle, und Zak legt die Scherben auf das Podest. Die Fahnenstange steckst du in die Kerbe, und dann liest Annie die Worte der Macht vor. Daraufhin schwei&szlig;t ein Blitz die beiden H&auml;lften wieder zusammen, und du hast nun auch den zweiten Kristall.<BR> Dann fliegt Zak &uuml;ber Kairo nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Kinshasa</FONT></CENTER></BIG><BR>
Beim Shamanen erf&auml;hrst du, wie du den gelben Kristall einzusetzen hast. Danach gehst du zum Flughafen, und fliegst nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Kairo</FONT></CENTER></BIG><BR>
Du gehst zum Bein der Sphinx, und malst dort die Zeichnung so aus, wie du es auf dem Mars sehen konntest. Daraufhin &ouml;ffnet sich eine T&uuml;r, und du bist wieder in einem Labyrinth. Folge den T&uuml;ren mit der Sonne, bis du an eine dunkel umrahmte T&uuml;r kommst. Hier sicherst du am besten ab, den da drinnen kannst du leicht totgehen. Die drei Kn&ouml;pfe mu&szlig;t du in einer bestimmten Reihenfolge dr&uuml;cken, sonst bist du schon so gut wie tot. Bei mir war die Reihenfolge 3,2,1. Wenn du Annie dabeihast kann sie auch die Hyroglyphen f&uuml;r dich entziffern. Darauf steht die L&ouml;sung =). Bei der richtigen Kombination erscheint ein Bild vom Marsgesicht, und eine kleine Zeichnung. Selbige solltest du dir unbedingt merken, die brauchen wir sp&auml;ter. Dann gehst du aus der T&uuml;r heraus, und folgenderma&szlig;en weiter: 6X Rechts, 2X Links. Dann gehst du in der W&uuml;ste nach links, zur Pyramide. In der Pyramide gehst du durch den Durchgang, und z&uuml;ndest eine Fackel an. Dann benutzt du deinen gelben Kristall, und beamst dich ins rechte Auge der Schnitzerei. Dort nimmst du den Kandelaber mit, und beamst dich dann wieder in die Pyramide. Dann stellst du das Leuchtende Objekt un den Kandelaber auf den Sockel, und holst Annie ebenfalls dorthin. Vorher dr&uuml;ckst du bei Zak noch den Hebel, damit Annie hinterher auch reinkommt.<BR>
Annie:<BR>
Du gehst nach Kairo, dann in die Pyramide und in den Durchgang. Wenn Zak den Hebel gedr&uuml;ckt hat kannst du nun die Treppe hochgehen. Dr&uuml;cke wieder den Hebel, und stelle dich an den linken Schalter. Den dr&uuml;ckst du, und wechselst zu Melissa.<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Mars</FONT></CENTER></BIG><BR>
Melissa:<BR>
Achte darauf, da&szlig; du die Taschenlampe hast, und gehe dann ins Labyrinth. Dort gehst du durch folgende T&uuml;ren: Rechts, Rechts, und dann vor der Gelben warten.
Zak:<BR>
Bevor du dich zum Mars beamst benutzt du den Dichtungsring mit dem Goldfischglas, ziehst die Sauerstofflasche an, und das Goldfischglas. Dan noch den Taucheranzug, und du kannst dich auf den Mars beamen. Wenn du vorher die Maschine aktiviert hast brauchst du diesen ganzen Krempel nicht. Die Zeichnung malst du so aus, wie du es in der Sphinx gesehen hast, und gehst durch den rechten Gang. Dann gehst du durch den einzigen Gang, der da ist, und solltest nun bei Melissa stehen. Dann mu&szlig;t du abwechselnd Melissa spielen, mit der Taschenlampe die T&uuml;r erleuchten, dann mit Zak durchgehen, und so weiter. So geht`s zum Ausgang: Gr&uuml;n, gr&uuml;n, gelb, links. Du kannst auch das Feuerzeug als Aushilfstaschenlampe benutzen. Dann gehst du mit beiden wieder zur Herberge (Helme nicht verge&szlig;en), f&uuml;llst bei Zak vileicht den Sauerstoff wieder auf, und holst Leslie 2 M&uuml;nzen. Melissa hat schon 2, und Zak braucht nur eine. Dann m&uuml;&szlig;en alle gleichzeitig in die Bahn gehen, und &uuml;ber den Mars fahren. Dabei mu&szlig; jeder f&uuml;r sich die M&uuml;nze im Zug einwerfen. Dann gehen alle drei zur Pyramide, und Zak schlie&szlig;t sie mit der Haarnadel auf. Dann gehen alle drei rein, und durch den Durchgang. Leslie dr&uuml;ckt dann die Sarkophag-F&uuml;&szlig;e, und Zak und Melissa gehen durch die Geheimt&uuml;r. Dann l&auml;&szlig;t Leslie die F&uuml;&szlig;e los, und Melissa &ouml;ffnet oben den Kasten mit dem Goldenen Schl&uuml;&szlig;el. Dann dr&uuml;ckt sie den Knopf, und Zak nimmt den Kristal. Zak geht dann in die &auml;giptische Pyramide, Leslie dr&uuml;ckt wieder die F&uuml;&szlig;e, und beide gehen zur Bahn. Da auf dem Mars nichts mehr zu tun ist, gehen beide ins Auto und fliegen nach Hause. Vorher mu&szlig; aber eine noch die Sicherung aus der Herberge holen, und im Handschuhfach einbauen.<BR>In Kairo baut Zak die Kristalle in die Maschine ein, und dr&uuml;ckt den rechten Knopf. Dann kannst du dich entspannt zur&uuml;cklehnen...<BR>
<CENTER>THE END</CENTER></CENTER>
PS: Das Geld l‰ﬂt sich Cheaten!<HR>
<CENTER>
<IMG SRC="heiligenschein.gif" BORDER=0 width=82 height=24><BR>
<BIG><FONT COLOR=#FFFF00>Markus Castro Y Castro -The Saint</FONT></BIG></CENTER>
<HR width=75%>
<A HREF="nocover.html"><IMG SRC="l_hauptinhalt.jpg" width=639 height=99 border=0 alt="Inhalt"></A>
</BODY>
</HTML>