<HTML>
<HEAD>
<TITLE>Der Actionweg</TITLE>
</HEAD>
<BODY bgcolor=#000000 TEXT=#FF0000 link=#FFFF00 alink=#0000FF>

<FONT size=6 color=#00FF00><CENTER>Der Actionweg</CENTER></FONT><BR>
Als erstes gehst du nach Monte Carlo, und mu&szlig;t Trottier finden. Er sieht folgenderma&szlig;en aus:<UL>
<LI>Brauner Anzug
<LI>Rose im Knopfloch
<LI>Graues Haar
<LI>Schwarzes Hemd</UL>
Wenn du ihn gefunden hast sagst du ihm wer du bist, und fragst ihn nach Atlantis. Wenn du
die Antwort auf seine Frage nicht weist guckst du halt noch mal im Dialog nach.
Mit seiner Visitenkarte gehst du dann nach<BR>
<FONT COLOR=#00FF00><CENTER><BIG>Algiers</BIG></CENTER></FONT><BR>
Ganz links ist ein Hinterhof, wo du einen Diener von Jabbar findest. Gib ihm die Visitenkarte
und frag ihn nach Jabbar, und er wird losgehen und ihn fragen, ob er dich sehen will. Die Antwort
ist nat&uuml;rlich nein, also folgst du ihm gleich wenn er zum Haus geht. Auf der Karte
sicherst du ab, und siehst dir an, wo der Diener verschwindet. Dann l&auml;dst du, stellst
Indy direkt vor das Haus, und wartest, bis der Diener auftaucht. Dann gehst du in sein Haus.<BR>
Den Nazi mu&szlig;t du zusammenschlagen (Actionweg :). Danach nimmst du die 2 Statuen und den Stock,
und holst mit dem Stock die Karte von der Leine. Danach sattelst du das Kamel, und es geht
ab in<BR>
<CENTER><BIG><FONT COLOR=#00FF00>Die W&uuml;ste</FONT></BIG></CENTER><BR>
In der W&uuml;ste mu&szlig;t du den deutschen Patroulien ausweichen, sonst gibt es einen Kampf.
Du kannst sie aber auch mit einer der Statuen bestechen. Du mu&szlig;t in eines der Beduinend&ouml;rfer,
und den Mann fragen, was er auf der Karte sieht. Dann folgst du seinen Anweisungen, und gehst zum
n&auml;chsten Dorf. Solange, bis du zum X kommst. Wir kommen zur<BR>
<CENTER><BIG><FONT COLOR=#00FF00>Ausgrabung</FONT></BIG></CENTER><BR>
Gehe die Leiter runter, und schalte den Generator ein (dr&uuml;cke kleines Metallding). Wenn du auf
das kleine runde Objekt im Gem&auml;lde dr&uuml;ckst, findest du eine Steinscheibe. Den Tonkrug
und den Holzstift nimmst du auch gleich mit. Mit der Schiffsrippe kratzt du den Dreck von
der Wand, und steckst Stift und Scheibe rein. Wenn du die Scheibe einstellst, wie im
Dialog beschrieben, &ouml;ffnet sich eine Geheimt&uuml;r. Wenn du in die T&uuml;r gehst, und ans Licht kommst
wirst du von einem Deutschen verhaftet. Nachdem du ihm das Gewehr mit der Peitsche weggenommen hast
kannst du ihn verpr&uuml;geln, und die Leiter zum Ballon hochklettern. Es geht nach<BR>
<BIG><CENTER><FONT COLOR=#00FF00>Kreta</FONT></CENTER></BIG><BR>
Geh den Weg runter, und auf der Br&uuml;cke nach links, wo du das Vermessungsger&auml;t mitnimmst.
Damit im Gep&auml;ck gehst du weiter runter, und schubst 2 der Steinhaufen um. Du stellst
das Ger&auml;t auf den Kopf, und peilst von da aus das linke Horn an, und vom Schwanz aus das rechte.
An der Stelle, wo sich das X befindet gr&auml;bst du mit der Schiffsrippe, und du wirst eine Mondscheibe
finden. Damit gehst du wieder den Weg rauf, und legst beide Scheiben in das Podest. Richtig eingestellt
&ouml;ffnet sich wieder eine Geheimt&uuml;r, und ein Deutscher kommt heraus. Wenn der weg ist kannst du
ins<BR>
<CENTER><BIG><FONT COLOR=#00FF00>Labyrinth</FONT></BIG></CENTER><BR>
Als erstes nimmst du zwei der drei K&ouml;pfe an dich, und gehst in den n&auml;chsten Raum. Nun ben&uuml;tzt du die
Peitsche, um auch den 3. zu holen. Nun geht es so weiter: Oben, Rechts, Links. Der Statuenkopf ist
so wacklig, da&szlig; du ihn mit der Peitsche leicht abhauen kannst. Unten angekommen nimmst du den
Stab mit, und kletterst an der Kette hinter dem Wasserfall wieder hoch. Nun gehst du nach rechts
und dann dr&uuml;ckst du den Brocken weg, der die T&uuml;r versperrt. Im n&auml;chsten Screen kannst du deine Peitsche mit 
dem
Felsvorsprung benutzen, um &uuml;ber das Loch zu kommen. Dann gehst du nach links und hinten, und gehst kurz vor den Gang,
so da&szlig; dich die Deutschen sehen k&ouml;nnen. Verstecke dich hinter dem 2. Felsen, und
warte, bis der Deutsche da ist. Einen kleinen Schubs sp&auml;ter ist er tot :).
Hinten im Gang wartet Franz, den erledigen wir auch. Die Treppe hoch, und dann nach rechts, dort erwartet dich wieder ein deutscher.
2 Schirme weiter rechts hebelst du den Felsen mit dem Stock da weg, und gehst nach unten. Dem fetten Deutschen nennst du irgendein Trinklied,
sonst macht er dich platt. Dann gehst du die Treppe hoch, und hebelst den Felsen da wieder weg, diesmal mit der Schiffsrippe.<BR>
Dann gehst du den ganzen Weg wieder zur&uuml;ck zum Aufzug, von da nach links, und stellst die 3 K&ouml;pfe auf
das Regal. Nun gehst du in die T&uuml;r, und nimmst den oberen Gang, wo du den Stein weghebelst, der den Aufzug blockiert.
Dann nimmst du den unteren Weg, und schiebst den Stab in den Mund der Statue. Schnapp dir die Goldene Kiste, und geh wieder zur&uuml;ck zu Arnold.
Dem nimmst du den Bernsteinfisch ab, packst dein Orichalcum in die Kiste und ben&uuml;tzt den Fisch. Dann rufst du in das Loch, und h&ouml;lst Sophia die Peitsche
hin. Links geht es zum Kartenraum, wo du wieder die Scheiben benutzen mu&szlig;t. Der Wegweiser im n&auml;chsten Raum zeigt dir, wo es hingeht, und zwar nach<BR>
<CENTER><BIG><FONT COLOR=#00FF00>Thera</FONT></BIG></CENTER><BR>
Du gehst den Berg hoch, und durchsuchst die Einbuchtungen im Berg. In einer der Schluchten befindet sich ein verlassenes Lager. Von dort nimmst du das Flickzeug mit,
und gehst wieder zu Sophia. Du fragst den Fischer, ob er dich nach Atlantis bringen kann, und sagst ihm, es sei 35 Meilen S&uuml;d&ouml;stlich von Thera.
Auf dem Meer angekommen &ouml;ffnest du den Lagerschrank, und ben&uuml;tzt das Flickzeug mit dem Taucheranzug. Dann steckst du noch den Schlauch in den Anzug,
und schl&uuml;pfst rein. Als Sophia schaltest du den Kompressor ein, und hievst Indy mit der Winde ins Wasser. Unter Wasser hast du drei Minuten, um die richtige H&ouml;hle zu finden, sonst
bist du Tot. Wenn du sie findest kommst du nach<BR>
<CENTER><BIG><A HREF="-tips_indyatlantis.html">Atlantis,</A></BIG></CENTER><BR>
wenn nicht in den Himmel :)