<HTML>
<HEAD>
<TITLE>Maniac Mansion</TITLE>
</HEAD>
<BODY BGCOLOR=#000000 text=#00FF00 link=pink>


<CENTER><IMG SRC="maniac.gif" BORDER=0 WIDTH=271 height=83></CENTER>
In diesem Spiel &uuml;bernimmst du die Rollen von Dave und zwei seiner Freunde, auf der Suche nach Dave`s Freundin. Seine Freundin wurde von einem ver&uuml;cktem Professor gekidnappt, der sie f&uuml;r seine perversen Expirimente mi&szlig;brauchen will. Nun gut, das m&uuml;&szlig;en wir nat&uuml;rlich verhindern. Ich habe f&uuml;r diese Aufgabe folgende 3 Jugendliche gew&auml;hlt:<BR>
Dave, Bernard und Syd.<BR>Es sollte angeblich auch mit anderen m&ouml;glich sein, allerdings habe ich es ohne Bernard noch nie geschafft. Na gut, fangen wir an.<HR>
Als Dave gehst du zum Haus, und ziehst erstmal die linken B&uuml;sche und die Fu&szlig;matte zur&uuml;ck. Unter der Matte findest du den Haust&uuml;rschl&uuml;&szlig;el. Mit dem Schl&uuml;&szlig;el schlie&szlig;t du die Haust&uuml;r auf, und gehst rein. Als Bernard gehst du ebenfalls rein, gehst durch die rechte T&uuml;r, und baust aus dem Radio die R&ouml;hre aus. Dann geht Syd in die K&uuml;che, und l&auml;&szlig;t sich fangen. Bernard geht dann noch einen Raum weiter nach rechts, und nimmt
die Kassette hinter dem rechten Panel weg. Dave geht dann in die K&uuml;che, nimmt die Taschenlampe mit, und pl&uuml;ndert den K&uuml;hlschrank. Achtung: Wenn die Sequenz mit dem Gr&uuml;nen Typen kommmt, darf sich niemand mehr zwischen Treppe und K&uuml;che befinden. Also geht Dave auch schnell nach rechts aus der K&uuml;che raus. Hier nimmt er den Braten und den Truthahn mit, und geht noch weiter nach rechts. Die ganzen Gl&auml;ser steckt er nat&uuml;rlich auch ein, wartet bis der Typ aus der K&uuml;che raus ist, und geht dann in den Flur. Aus der K&uuml;che kannst du noch die Kettens&auml;ge mitnehmen.
Im Flur dr&uuml;ckst du den rechten Kobold, und gehst mit Bernard die Treppe runter. Nachdem er Licht gemacht hat geht er nach rechts, und nimmt den silbernen Schl&uuml;&szlig;el mit hoch. Dann geht er die Treppe hoch, und nimmt aus dem linken Zimmer alles mit. Im rechten Zimmer nimmt er die Platte, und legt sie auf den Grammophon-Spieler. Dann legt er die Kassette rein, und schaltet auf Aufname. Grammophon einschalten nicht vergessen! Mit Kassette und Schallplatte gehst du dann in den zweiten Stock. An der Sicherheitst&uuml;r mu&szlig;t du die CodeAbfrage benutzen.<P>
Im ersten Raum machst du mit der Tischlampe Licht, und nimmst aus dem Schreibtisch das Manuskript. Wenn du die Lampe nicht findest kannst du auch mit Dave nachkommen, der hat ja Batterien und eine Taschenlampe. Da Bernard Angst vor dem Tentakel im 3. Stock hat gibt er alles bis auf die R&ouml;hre an Dave, und der geht dann in den 3. Stock.<P>
Dem Tentakel gibst du die Plastik-Fr&uuml;chte, und den Fruchtsaft und es verschwindet. Dann gehst du wieder ein Stockwerk h&ouml;her, und in die erste T&uuml;r rein. Auf dem Boden liegen 10 Cents, und Bernard kann das Funkger&auml;t mit der R&ouml;hre reparieren. Oben nimmt Dave die Platte und den gelben Schl&uuml;&szlig;el mit, und geht wieder runter. Mit dem ganzen Krempel geht Dave dann wieder in den Raum mit dem Grammophon, legt die Brunftscrei-Platte und die Kassette ein, schaltet beides ein, und mit der Aufnahme zum Radio. Die Kassette legst du dann in den Spieler, und schnappst dir den Schl&uuml;&szlig;el. Dann kommt Bernard wieder runter, dr&uuml;ckt den Kobold, und Dave geht in den Keller Syd befreien (rostiger Schl&uuml;&szlig;el).
Wenn es zwischendurch klingeln sollte, versteckst du schnell deine Leute, und rennst zum Briefkasten, wo du Paket und Briefmarken nimmst. Dann gehst du mit Dave wieder durch die K&uuml;che nach rechts, schlie&szlig;t die T&uuml;r mit dem silbernen Schl&uuml;&szlig;el auf, und f&uuml;llst am Pool das Glas. Mit dem radioaktiven Wasser gehst du dann wieder nach oben, und in die ganz rechte T&uuml;r. Der Pflanze gibst du dann zuerst das Wasser aus dem Pool, und dann die Pepsi. Wieder drau&szlig;en gehst du in die T&uuml;r davor, und benutzt den Kraft-O-Mat. Dann holst du dir noch den trockenen Schwamm aus der Dusche. So gest&auml;rkt gehst du dann nach drau&szlig;en vors Haus, und &ouml;ffnest die Gitter. Dann stellst du dich vor den Haupthahn, und gehst mit Bernard zum Pool.
Wenn du nun den Haupthahn &ouml;ffnest, wird der Pool leer, und Bernard schnappt sich schnell das Radio und den Schl&uuml;&szlig;el. Aber Vorsicht:<BR>
L&auml;&szlig;t du das Wasser zulange drau&szlig;en, oder dr&uuml;ckst du den roten Knopf, explodiert der Atomreaktor. Mit Dave gehst du dann ebenfalls zum Pool, und nimmst Bernard die Sachen ab. Durch das Tor geht es zur Garage, die du nun gest&auml;rkt auch &ouml;ffnen kannst. Dann nimmt Dave den Wasserhahngriff, und schlie&szlig;t das Auto mit dem gelben Schl&uuml;&szlig;el auf. Werkzeug und Griff gibst du dann an Bernard. Nun gehst du mit Bernard wieder ganz nach oben, in die Dusche. Dort reparierst du den Wasserhahn, und schaltest ihn ein. Notier dir die Nummer, und geh nach unten zum Telefon. Das Telefon repariert er auch noch, dann geht es zu Dave.<BR>
Stell dich oben vor Ednas T&uuml;r (die 2 von Links), und ruf als Bernard Edna an. Dann l&auml;ufst du als Dave schnell in ihr Zimmer, schnappst dir den Schl&uuml;&szlig;el, und gehst die Leiter hoch. Oben schaltest du die Lampe ein, und nimmst das Gem&auml;lde vom Tresor. Dann rufst du wieder bei Edna an, und l&auml;&szlig;t Dave verschwinden. Dann geht Dave in das Zimmer mit der Pflanze, und benutzt den Farbentferner neben der Pflanze. Dann wird es etwas kompliziert, also lies gut zu:
<UL>
<LI>Du nimmst aus dem Radio die Batterien, und tust sie in die Lampe
<LI>Du gibst Bernard die Taschenlampe
<LI>Syd dr&uuml;ckt den Kobold
<LI>Dave geht in den Keller, vor den Sicherungskasten
<LI>Bernard geht nach oben, neben die fleischfressende Pflanze in die T&uuml;r
<LI>Bernard schaltet die Lampe ein, und stellt sich vor die Dr&auml;hte
<LI>Dave schaltet die Sicherungen aus
<LI>Bernard repariert schnell die Kabel mit dem Werkzeug
<LI>Dave schaltet den Strom wieder ein, bevor es zur Kernschmelze kommt
<LI>Geschafft!!!
</UL>
Das Spiel ist zwar nicht vorbei, aber der schwerste Teil liegt hinter dir. Mit Syd gehst du vor die Haust&uuml;r, und klingelst. Dann geht Dave schnell in Ed`s Zimmer, nimmt den Hamster, und &ouml;ffnet das Sparschwein. Nimm nun alle M&uuml;nzen und die Keycard mit.
Dann gehst du mit Dave nach oben zum Teleskop, und wirfst 10 Cent ein. Dann dr&uuml;ckst du den rechten Knopf, und schaust durch das Teleskop. Wirf wieder 10 Cents ein, dr&uuml;ck den Knopf, und schau durch. Mach das solange, bis du eine Nummer siehst. Notier dir die Nummer!
<BR>
Dann geht Bernard wieder ans Telefon, und Dave geht schnell zum Tresor, den du ja jetzt &ouml;ffnen kannst. Nimm den Umschlag, und geh wieder runter (anrufen!). Mit dem Vierteldollar aus dem Umschlag gehst du dann nach unten an den Meteor Mess Automaten. Notier dir die Highscore!<BR>
Mit dem kleinen Schl&uuml;&szlig;el schlie&szlig;t du den Automaten auf, und nimmst dir wieder die M&uuml;nze. Dann gehst du in den Kerker, und &ouml;ffnest die Labor-T&uuml;r. F&uuml;r die Schl&ouml;&szlig;er benutzt du den leuchtenden Schl&uuml;&szlig;el, in das Codefeld gibst du den Highscore ein. Dann gehst du zum Funkger&auml;t, und rufst mit der Nummer vom Plakat die Polizei. Dann gehst du wieder in den Keller, und wartest, bis die Polizei da war.<BR>
Dann nimst du die Polizeimarke, und gehst auch ins Labor. Dem Tentakel zeigst du die Marke, und gehst in den n&auml;chsten Raum. Dort ziehst du dir mit dem ViertelDollar eine Pepsi, und holst dir den Strahlenschutzanzug aus dem Schrank. Die T&uuml;r &ouml;ffnest du mit der Keycard, und schaltest im n&auml;chsten Zimmer den Strom ab. Dann kannst du dich zur&uuml;cklehnen zur Endsequenz...<BR>
Ps.: In diesem Spiel gibt es viele L&ouml;sungswege, und auch unterschiedliche Endsequenzen. Was w&auml;hre zum Beispiel, wenn die Polizei vor verschlo&szlig;ener T&uuml;r st&uuml;nde? Dann m&uuml;&szlig;test du ja den Meteor...<BR>
<A HREF="tips_solutions.html">Back</A>
<CENTER><IMG BORDER=0 align=center SRC="heiligenschein.gif" width=82 height=24><BR>
<BIG><FONT COLOR=#FFFF00>Markus The Saint Castro</FONT></BIG></CENTER>
<HR>
<A HREF="nocover.html"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 ALT="Inhalt" WIDTH=639 height=99></A></CENTER>
</BODY>
</HTML>
