<HTML>
<HEAD>
<TITLE>Der Teamweg</TITLE>
</HEAD>
<BODY bgcolor=#FFFFFF TEXT=#000000 link=#FF0000 alink=#0000FF>



<H1><CENTER><FONT COLOR=#0000FF>Der Teamweg</FONT></CENTER></H1>
Am Anfang hast du zwei St&auml;dte zur Auswahl: Algiers oder Monte Carlo. Wir nehmen
Algier.<BR>
Wenn du den Messerwerfer nach den Messern fragst, sagt er dir, da&szlig; sich keine Frau
ihm freiwillig ausliefern will. Aber da kannst du ja sicher helfen, oder? Sophia
l&auml;&szlig;t sich &uuml;berreden, ihm mal zuzusehen, und nach einem kleinen Schubs, ist sie sogar
freiwillig zu einer Show bereit. Nach der Show haben wir ein neues Messer!
Weiter geht es in den Hinterhof, wo du Jabbar treffen wirst. Indy der alte Dieb schnappt
sich jetzt die Maske, und haut damit ab. Jabbar will sie sowieso nicht haben.
Mit der Maske geht es jetzt auch nach<BR>
<BIG><CENTER><FONT COLOR=#0000FF>Monte Carlo</FONT></CENTER></BIG><BR>
In Monte Carlo mu&szlig;t du als erstes Trottier finden. Er sieht folgenderma&szlig;en aus:<UL>
<LI>Bauner Anzug
<LI>Schwarzes Hemd
<LI>Rose im Knopfloch
<LI>Graues Haar.
</UL>
Er ist eigentlich nicht zu verfehlen. Wenn du ihn gefunden hast, mu&szlig;t du ihn dazu
&uuml;berreden, ins Hotel zu kommen. Wenn du auf seine Frage keine Antwort weist,
guckst du halt nochmal im Dialog nach. Wenn er dann endlich im Hotel ist, hast
du zwei M&ouml;glichkeiten, im die Steinscheibe abzuluchsen. Entweder mit <A>Indy</A> oder Sophia.
<BR>
<BIG><FONT COLOR=#FF00FF>Sophia</FONT></BIG>
<BR>
Du sagst zun&auml;chst Sophia, da&szlig; sie sich um ihn k&uuml;mmern soll. Als Sophia bitest du
ihn dann um ein Zeichen der Macht f&uuml;r Nur-Abfall. Wenn er die Steinscheibe hinlegt,
wird er dir ein par Fragen stellen, die du beantworten mu&szlig;t. Bei der Frage nach den Fingern
mu&szlig;t du tats&auml;chlich raten. Am besten du sicherst vorher dort ab. Mir ist es bisher nicht
gelungen, die richtige Zahl zu nennen, deshalb weis ich auch nicht, was dann passiert.
Aber es bleibt ja immer noch<BR>
<BIG><FONT COLOR=#800000>Indy</FONT></BIG><BR>
Als erstes nimmst du das Laken und die Taschenlampe aus dem Schrank. Dann &ouml;ffnest
du den Sicherungskasten und benutzt den Stromunterbrecher. Dan benutzt du schnelll
Lampe, Laken und Maske, und Trottier macht sich vor Angst in die Hose.<BR>
Anschlie&szlig;end geht es wieder nach <BR>
<BIG><CENTER><FONT COLOR=#0000FF>Algiers</FONT></CENTER></BIG><BR>
Hier geht es gleich wieder in den Hinterhof, und Jabbar bekommt die Steinscheibe
zu sehen. Wenn du von dem "Ausflug" wieder zur&uuml;ck bist solltest du deine Maske wieder
zur&uuml;ckgeben, und etwas daf&uuml;r tauschen. Mit dem Gegenstand gehst du dann zum
Taubenverk&auml;ufer, und bietest ihn ihm im Austausch mit einer Taube an. Wenn
es ihm nicht gef&auml;llt, tauscht du es halt nochmal um, solange, bis du eine Taube hast.
Anstatt die Taube zu essen (Jones hat ja immer noch das Kaugumii...) gibst du sie
dem Bettler, woraufhin du eine Karte f&uuml;r den Ballon bekommst. Also gleich rauf aufs Dach,
und ab in den Ballon. Wenn Indy in die Luft gegangen ist schneidest du einfach das
Seil mit dem Messer durch, und ihr fliegt in<BR>
<BIG><CENTER><FONT COLOR=#0000FF>Die W&uuml;ste</FONT></CENTER></BIG><BR>
Wenn du Gas oder Ballast abl&auml;st, fliegt der Ballon ein St&uuml;ck tiefer/h&ouml;her, und
in eine andere Richtung. Deine Aufgabe ist es nun, eins dieser D&ouml;rfer anzufliegen,
und einem Nomaden die Karte zu zeigen. Dann fliegst du einfach seinen Anweisungen lang,
zum n&auml;chsten Dorf, bis einer dir sagt, du w&auml;hrst sehr nah dran. Dann landest
du einfach auf dem Kreuz, und du bist in der<BR>
<BIG><CENTER><FONT COLOR=#0000FF>Ausgrabungsst&auml;tte</FONT></CENTER></BIG><BR>
So, Sophia is weg. Na und? erstmal die Lage untersuchen. Im gro&szlig;en Loch tastest
du dich erstmal zu folgenden Dingen vor:<UL>
<LI>Tonding
<LI>Langes,r&ouml;hrenf&ouml;rmiges ding
</UL>
Mit Hilfe des Schlauchs und des Kruges saugst du nun ein bischen Benzin aus dem Tank
des Lasters, gehst wieder nach unten, und versuchst ein Metallding zu ertasten.
&uuml;ber dem Ding befindet sich eine Klappe, die du &ouml;ffnest. Darein kommt das Benzin,
und dann dr&uuml;ckst du den kleinen Schalter, und siehe da -es werde Licht!<BR>
Nun kannst du auch den Holzstift und eine Schifsrippe einstecken. Mit der Rippe
erledigst du die por&ouml;se Wand rechts, und zum Vorschein kommt ein Gem&auml;lde.
Darein steckst du nun den Stift und den Sonnenstein, und stellst dsie so ein
wie Plato es beschrieben hat. Dann dr&uuml;ckst du den Stift, und Sophia ist auch mal wieder da.<BR>
Sophia &uuml;bergibt dir nun einen Bernsteinfisch, und eine Verteilerkappe. Nun nimmst
du die Z&uuml;ndkerze aus dem Generator, und reparierst den Lastwagen. Ab geht`s
nach<BR>
<BIG><CENTER><FONT COLOR=#0000FF>Kreta</FONT></CENTER></BIG><BR>
Nach links, und den Weg runter. Wenn du auf die Br&uuml;cke und dann nach links gehst
findest du ein Vermessungsger&auml;t. Damit gehst du dann runter, und schubst diese
kleinen Steinhaufen um, bis du einen Tierkopf und einen Ochsenschwanz findest.
Auf diesen Statuen stellst du dann das Ger&auml;t ab, und peilst vom Kopf das linke Horn
an, vom Schwanz aus das rechte, und das Kreuz zeigt dir dann, wo die 2. Steinscheibe liegt.
Mit der Schiffsrippe ist sie auch schnell ausgebuddelt, und dann geht`s wieder zur&uuml;ck zum
Anfang, zum Sockel. Nachdem du die Scheiben richtig gedreht hast, &ouml;ffnet sich eine geheime
T&uuml;r, und du kommst ins<BR>
<BIG><CENTER><FONT COLOR=#0000FF>Labyrinth</FONT></CENTER></BIG><BR>
Von dem Regal nimmst du 2 der 3 Steink&ouml;pfe mit, und gehst dann in den n&auml;chsten
Raum. Von dort aus benutzt Indy seine Peitsche, um auch an den 3. Kopf ranzukommen.
Mit dem Kopf geht es dann nach oben, dann rechts und dann links.<BR>
Die bewegliche Bodenplatte ist ein Aufzug, wenn Indy da mit Sophia raufgeht, geht es
abw&auml;rts. Damit das auch aleine geht, haut Indy der Statue den Kopf mit der Peitsche ab.
Unten angekommen schnappt sich Indy den Weltstein und den Stab, und benutzt die Kette hinter
dem Wasserfall, um wieder hoch zu kommen. Nun geht er einen Bildschirm nach links,
und legt die K&ouml;pfe auf das Regal. Nun geht er durch die ge&ouml;ffnete T&uuml;r,und dann nach oben.
Mit dem Stock entfernst du den kleinen Keil, um das Gewicht zu befreien. Dann gehst
du ein St&uuml;ck zur&uuml;ck, und nimmst den unteren Weg. Wenn du auf dem Fahrstuhl stehst steckst du den
Stab in den Mund, und schnappst dir die goldene Kiste. Dann geht es wieder zu Sophia, und in den
hinteren Bildschirm. Dann schaust du den Hebel hinter dem Tor an, und &uuml;beredest Sophia
durch das Loch zu steigen (2/2/1/4/1). Auf der anderen Seite packst du dein Orichalcum
in die Goldkiste, und benutzt den Fisch, um weiteres Orichalcum aufzusp&uuml;ren.
Da Sophias Kette den Dedektor ablenkt, mu&szlig; ihre Kette auch in die Kiste(3/3/1/1/1).
Dann gehst du nach rechts, und benutzt nochmal den Fisch. Auf der Wand verwendest du
dann die Schiffsrippe, und es geht weiter in den Kartenraum.<BR>
Nachdem du die drei Steine richtig angewendet hast &ouml;ffnet sich eine T&uuml;r, und dahinter triffst du Kerner.
Da du nat&uuml;rlich kein Idiot bist &uuml;bergibst du ihm die Steine, und buddelst dich
dann mit der Schiffsrippe nach drau&szlig;en. Dein n&auml;chster Gang f&uuml;hrt dich zum<BR>
<BIG><CENTER><FONT COLOR=#0000FF>UBoot</FONT></CENTER></BIG><BR>
Auf dem Boot &ouml;ffnest du die Luke und schl&auml;gst den Kapit&auml;n zusammen, und schon geht die Reise los.
Als erstes brichst du den Hebel ab, und benutzt die Sprechanlage um die Leute in den Bug zu bringen.
Dann geht`s nach unten, und du nimmst die Porzellantasse und Brot+Salami mit. Die Tasse f&uuml;llst du
ein St&uuml;ck weiter unten mit Batteries&auml;ure, und gehst wieder hoch und nach rechts. Rechts neben Kerner
befindet sich eine Fallt&uuml;r, von dort aus kommst du direkt neben sie. Der Safe h&auml;lt der S&auml;ure nicht lange
stand, und du hast die Scheiben wieder. Wenn du links unten neben Sophia stehst kannst du mit
ihr reden, und sie veranlassen die Wache abzulenken. Nun kannst du dich an die Wache ranschleichen, w&auml;hrend
Sophia sie mit einem Eimer erledigt. Mit dem kleinen Schl&uuml;&szlig;el schlie&szlig;t du die Notfall-ruderkontrolle
auf, und benutzt sie erstmal. Von rechts nimmst du noch den P&ouml;mpel mit, und reparierst damit
den kaputten Hebel. Im linken Teil des Bootes gibt es noch einen Hebel und einen Schalter, und
du hast die Kontrolle &uuml;ber das UBoot.<BR>
Irgendwo ist eine Luftschleu&szlig;e, in die du das UBoot steuern mu&szlig;t, dann befindest du dich in<BR>
<BIG><CENTER><A HREF="-tips_indyatlantis.html">Atlantis<BR></A>