<HTML>
<HEAD>
<TITLE>Der Knobelweg</TITLE>
</HEAD>
<BODY bgcolor=#000000 text=#FFFF00 link=#00FF00 alink=#0000FF>

<H1><CENTER><FONT COLOR=#00FF00>Der KnobelWeg</FONT></CENTER></H1>
Nachdem Indy den Flieger nach Monte Carlo genommen hat mu&szlig; er Trottier aufsp&uuml;ren. Er sieht folgenderma&szlig;en aus:<UL>
<LI> Brauner Anzug 
<LI> Rose im Knopfloch
<LI> Schwarzes Hemd
<LI> Graue Haare
</UL>
Wenn du ihn gefunden und die Frage beantwortet hast geht es ab nach<BR>
<FONT COLOR=#FF0000><BIG><CENTER>Algerien</CENTER></BIG></FONT><BR>
Ganz links befindet sich ein Hinterhof, wo ein Diener von Jabbar wartet. Zeig ihm die Karte, und folge ihm. Auf der Strasse sicherst du ab, und passt auf, wo er verschwindet. Dann l&auml;dst du
wieder, stellst dich genau dort hin, und wartest bis er dort auftaucht. Dann gehst du einfach ins Haus, und triffst Jabbar. W&auml;hrend Paul die Polizei
ruft gehst du in den Wandschrank, und wartest bis er ebenfalls dort drin ist. Dann gehst du schnell raus, und machst dicht. Schnapp dir dann die zwei Statuen, und hole mit dem Stock
die Karte von der W&auml;scheleine. Dann sattel das Kamel, und es geht ab in <BR>
<BIG><CENTER><FONT COLOR=#FF0000>Die W&uuml;ste</FONT></CENTER></BIG><BR>
Du mu&szlig;t mit deinem Kamel den Legion&auml;ren ausweichen, und zu den Camps gelangen. Dort zeigst du den Nomaden die Karte, und fragst sie, was sie dort sehen. Dann folgst du einfach ihren Anweisungen,
bis du zu einem X kommst. Dort befindet sich<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Die Ausgrabungsst&auml;tte</FONT></BIG></CENTER><BR>
Geh die Leiter runter, und versuche folgende Dinge zu finden:
<UL>
<LI>Keramikkrug
<LI>Schlauch
</UL>
Damit gehst du dann nach oben, und f&uuml;llst mit dem Schlauch ein bischen Benzin aus dem Truck in den Krug. Dann geht es wieder runter, und d&uuml; f&uuml;llst das Benzin in den Generator. Wenn du das Licht angemacht hast dr&uuml;ckst
du auf das kleine runde Bild, und nimmst die Statue. Die Orichalcum-Kugel packst du jetzt in die Statue, und schaltest den Generator ab. Dann &ouml;ffnest du ihn, nimmst die Z&uuml;ndkerze, und gehst zum Truck, wo du nun beides in
den Motor einbaust. Es Geht ab nach<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Monte Carlo</FONT></BIG></CENTER><BR>
In Monte Carlo suchst du wieder Trottier, und erz&auml;hlst ihm, die Deutschen w&uuml;rden was von ihm wollen. Wenn er gekidnappt wurde f&auml;hrst du ihnen solange hinterher,
bis Indy sie rammt, und Trottier befreit. Danach mu&szlig;t du dich auf die Suche nach dem Stein machen. An der richtigen Stra&szlig;e mu&szlig;t du ihn den Abflu&szlig; sehen, und wir haben ihn! Dann gehst du wieder zum Hotel, und zum Flughafen.
Von da aus fliegst du nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Thera</FONT></CENTER></BIG><BR>
Du nimmst den linken Weg, und gehst in die Berge. Wenn du das verlassene Camp gefunden hast schlie&szlig;t du den Karton, und schnappst dir die Rechnung. Damit gehst du dann in die H&ouml;hle, und schnappst dir im linken Bildschirm
das Milit&auml;rische Verschanzungswerkzeug, kurz: Klappspaten. Schlie&szlig;e die T&uuml;r, und benutze den Sonnenstein aus der Achse. Richtig eingestellt &ouml;ffnest du dann die T&uuml;r, und nimmst das Schild. Wenn die T&uuml;r geschlo&szlig;en ist nimmst du auch wieder den
Sonnenstein, und gehst nach rechts. Dort benutzt du dann den Klappspaten auf der Einsturzstelle, und wanderst zur&uuml;ck zum Hafen. Dem Mann sagst du, du w&uuml;rdest gerne deinen Ballon haben, und zeigst ihm die Rechnung.
Mit der Ballonh&uuml;lle und dem Fischernetz hast du nun schon zwei Teile. Fehlt nur noch...genau! Der Korb. Im Austausch gegen das Schild r&uuml;ckt er ihn gerne heraus, und du hast einen fertigen Ballon. Zur&uuml;ck beim Lager steckst du den Schlauch in den Schornstein,
und pustest damit den Ballon auf. Ab gehts!<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Der Ballon</FONT></BIG></CENTER><BR>
Du mu&szlig;t einfach solange rumfliegen, bis du das UBoot findest, und darauf versuchen zu landen. Wenn der Kapit&auml;n erledigt ist, geht es ab ins<BR>
<CENTER><BIG><FONT COLOR=#FF0000>UBoot</FONT></BIG></CENTER><BR>
Du gehst erstmal unter Deck, und in den hinteren Teil. Dort machst du dir aus Brot und Wurst ein Sandwich, und gehst wieder zur Wache, der du erz&auml;hlst du w&uuml;rdest sie abl&ouml;&szlig;en. Wenn du ihm dein Sandwich anbietest haut er ab, und du kannst an den Schrank.
Im Schrank befinden sich der Mondstein, und eine Anleitung. Rechst im Boot findest du einen &ouml;ligen Lappen, mit dem du nach links gehst. Der &ouml;lige Lappen und die Dr&auml;hte geben ein sch&ouml;nes Feuerchen, wenn du den Starthebel ziehst. Vorher mu&szlig;t das alles nat&uuml;rlich mit der Anleitung
einschalten. Wieder rechts nimmst du die W&auml;scheleine mit, machst den Torpedo feuerbereit und bindest die Leine an den Hebel. Dann gehst du ihn das Rohr, nimmst die W&auml;scheleine und machst dicht. Nach einem kurzen Schu&szlig; geht es ab nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Kreta</FONT></CENTER></BIG><BR>
In das Podest legst du die Steinscheiben, und stellst sie richtig ein, woraufhin sich eine T&uuml;r &ouml;ffnet. Da drin ist<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Das Labyrinth</FONT></CENTER></BIG><BR>
Nimm zun&auml;chst 2 der 3 K&ouml;pfe vom Regal, und begib dich in den n&auml;chsten Raum. Dann benutzt du die Peitsche, um dir auch den 3. Kopf zu holen. Dann gehst du in folgende G&auml;nge: Oben, rechts, links. Beim Aufzug haust du der Statue den Kopf mit der Peitsche ab, und f&auml;hrst abw&auml;rts. Bei
Sternhart nimmst du Schal, Weltstein und Stock, und schaust dir den Wasserfall an. Hinter dem Wasserfall ist eine Kette, daran kommst du wieder hoch. dann l&auml;ufst du nach links, und legst die K&ouml;pfe auf das Regal. Durch die ge&ouml;ffnete T&uuml;r geht es, und dann nach oben. Mit dem Stock
kannst du den Keil vom Gegengewicht entfernen, und dann nimmst du den unteren Weg. Beim Aufzug steckst du der Statue den Stab in den Mund, und oben schnappst du dir die Goldene Kiste. Dann gehst du in den hinteren Gang, und steckst wieder eine Kugel in deine kleine Statue.
Damit reparierst du dann die gro&szlig;e Maschine, und folgst dem Loch in den Kartenraum. Nun legst du die Steine auf die Achse, stellst sie ein, und kommst eine T&uuml;r weiter. Dein Orichalcum steckst du jetzt in die Kiste und bastelst dir aus dem Kamm und der Leine einen
Orichalcum-Dedektor. Den l&auml;dst du mit dem Schaal auf, un gehst in den n&auml;chsten Raum, wo du ihn anwendest. Wenn du das Orichalcum aus den Knochen hast, gehst du wieder einen Schirm zur&uuml;ck, und machst daselbe nochmal. Dann kratzt du mit der Schiffsrippe an der Wand, und gehst durch die T&uuml;r.
Die Perle wird eingesteckt, und in den Mund des Zuges gesteckt. Der bringt dich dann geradewegs nach<BR>
<BIG><CENTER><A HREF="-tips_indyatlantis.html">Atlantis</A></CENTER></BIG>
