<HTML>
<HEAD>
<TITLE>Teil 4, Dinky Island</TITLE>
</HEAD>
<BODY bgcolor=#DF0000 TEXT=#000000 link=#0000FF>

<CENTER><H2><FONT COLOR=#FFFFFF>Teil 4   Dinky Island</FONT></H2></CENTER>
Als erstes fischt du die Flasche aus dem Wasser, und haust sie gegen den Stein. In dem Fa&szlig; rechts ist ein Cracker, den nimmst du auch. Genauso das Brecheisen das am Strand liegt, und das Martini Glas. Das Glas f&uuml;llst du im Ozean, und kippst es in die Destille. Nun gehst du in den Dschungel, und dann nach links, bis
du zu dem Baum mit den Beutel kommst. Den Bautel kannst du mit der Flasche aufritzen, und du erh&auml;lst ein par Instant Cracker. Mit dem Wasser zusammen ergeben sie Cracker. Wenn du den Papagei mit den Crackern f&uuml;tterst wird er gespr&auml;chig, und sagt†dir wie du zum Schatz kommst. Auf dem Weg dorthin nimmst du noch das Seil von der Kiste,
&ouml;ffnest sie mit dem Brecheisen, und schnappst dir auch noch das Dynamit. Die Anweisungen des Papageis sind folgende:<UL>
<LI>Gehe nach Osten, vom Teich zum Dinosaurier
<LI>Gehe nach Norden, vom Dinosaurier zum Steinhaufen
<LI>Gehe nach Osten, von den Steinen zum X
</UL>
Beim X angekommen f&auml;ngst du an zu graben, und wenn das Loch tief genug ist z&uuml;ndest du das Dynamit an, und schmei&szlig;t es rein. Nach der Explosion bindest du die Brechstange an das Seil, und schmei&szlig;t sie gegen die Stahlstreben. Nach dem Absturz findest du dich im Dunkeln wieder, und nachdem du das Licht anmachst triffst du...LeChuck!!!<BR>
Da LeChuck offentsichlich &uuml;berm&auml;chtig mit seiner Puppe ist, brauchst du auch so eine Puppe. Um diese Puppe herzustellen brauchst du folgendes:<UL>
<LI>LeChucks Unterhose (Iiiiiigiiiit!!!!)
<LI>Eine Puppe von LeChuck
<LI>Den Kopf von seinem Vater
<LI>Ein wenig Sabber
<LI>Ein St&uuml;ck von seinem Bart
<LI>Eine Voodoo-T&uuml;te
</UL>
Die Voodoo-T&uuml;te hast du ja schon von der Liebesbombe. Also brauchst du noch die anderen Sachen. Keine Angst wenn du mal LeChuck triffst:<BR>
Seine Puppe schleudert dich IMMER in einen anderen Raum, du hast also genug Zeit. Geh jetzt erstmal ganz nach rechts, in die erste Hilfe. Die Skelette sind deine Eltern! Bei deinem Vater ist der Kopf lose, den kannst du mitnehmen. Und im M&uuml;lleimer liegen ein paar Handschuhe; ach ja, in der Schublade ist eine Spritze.
Eine T&uuml;r weiter links findest du jede Menge Kisten, in denen LeChuck Puppen sind. Jetzt hast du also schon zwei Zutaten.
In der anderen Kiste ist Malzbier, das kannst du auch mitnehmen. Au&szlig;erdem nimmst du noch den Ballon aus der letzten Kiste. Wenn LeChuck auftaucht gibst du ihm schnell das Taschentuch, in das er reinsabbert. 3. Zutat!
In der 3. T&uuml;r von links steht ein Grogautomat, und eine Flasche Helium. An der Buddel kannst du deine Handschuhe und den Ballon aufblasen, und am Grogautomat kannst du die R&uuml;ckgabetaste dr&uuml;cken, damit eine M&uuml;nze rausspringt. Wenn LeChuck dann kommt, und sich b&uuml;ckt ziehst du ihm schnell die Hose raus.
4. Zutat! Fehlt nur noch sein Bart. Mit dem ganzen aufgeblasenen Zeugs gehst du zum Aufzug, und wartest bis LeChuck erscheint. Dann dr&uuml;ckst du schnell den Hebel, und schnapst dir den Bart. Letzte Zutat!<BR>
Jetzt solltest du dir noch schnell Big Whoop holen, bevor du dir die Voodoopuppe machst.
Den ganzen Krempel schmei&szlig;t du dann in die Voodoo-T&uuml;te, und du erh&auml;lst eine Wunderbare Voodoo-Puppe. Wenn dein b&ouml;ser gro&szlig;er Bruder das n&auml;chste Mal kommt rammst du ihm die Spritze rein, und nach ein par Greueltaten kannst du dir die &uuml;beraschende Endsequenz ansehen...<BR>
<BIG><CENTER>ENDE</CENTER></BIG><BR>
PS: Das Geld l‰ﬂt sich Cheaten.
<HR noshade color=#FFFF00>
<CENTER><IMG SRC="heiligenschein.gif" border=0 width=82 height=24></CENTER><BR>
<CENTER><BIG><FONT COLOR=#FFFF00>Markus "The Saint" Castro</FONT></BIG></CENTER>
<A HREF="tips_solutions.html">Back</A>
<A HREF="nocover.html"><IMG SRC="l_hauptinhalt.jpg" border=0 width=639 height=99>


</BODY>
</HTML>
