<HTML>
<HEAD>
<TITLE>Indiana Jones 4</TITLE>
</HEAD>
<BODY bgcolor=#000000 text=#00FF00 link=#FF0000 alink=#0000FF>
<font color=#FF0000>
<CENTER><H1>Indiana Jones IV</H1></CENTER>
</FONT>
Sehr gutes Adventure von Lucas Arts. Teilweise etwas schwierig, aber wozu
sind L&ouml;sungen denn da :=)<P>
Nun gut, nach dem Anfang landest du in<BR>
<CENTER><BIG><FONT COLOR=#FF0000>
New York<BR>
</FONT></BIG></CENTER>
und fragst dich wie du in
das Theater kommen sollst. Als erstes steckst du mal die Zeitung ein, und gehst
ums Haus herum. Wenn du die T&uuml;r &ouml;ffnest kommt Biff (f&uuml;r streifenfreie Fenster...)
heraus, und du kannst ihn nun entweder zusammenpr&uuml;geln, oder ihm erz&auml;hlen was f&uuml;r eine tolle
Frau Miss Hapgood doch ist, woraufhin er dich reinl&auml;&szlig;t. Oder du dr&uuml;ckst alle Kisten
weg, und gehst zur Feuerleiter.<BR>
Im Theater sprichst du den Arbeiter an, und fragst ihn nach seinen Hobbys. Lesen.
Tolles Hobby. Aber mit der Zeitung verzieht er sich ganz schnell, und wir k&ouml;nnen ein
bischen Schaden stiften. Rechter und linker Hebel werden gedr&uuml;ckt, und danach der
Knopf, und siehe da: Nur-Abfall ist lebendig, und Sophia bemerkt dich. Nach eurer
Unterhaltung reisen Indy und Sophia nach<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Island</FONT></CENTER></BIG><BR>
Geh erstmal in die H&ouml;hle, und quetsch den Professor ein bi&szlig;chen aus. Wenn Indy
ihn nach &uuml;bernat&uuml;rlichem fragt spuckt er zwei Namen aus, und wir sind auch schon
weg.<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Tikal</FONT></BIG></CENTER><BR>
Im Dschungel trifft Indy so eine Art &uuml;bergro&szlig;e Ratte, die wird zum 3 Loch von rechts getrieben,
und dann mit der Peitsche erschreckt, woraufhin dieses Viech direkt einer Schlange in die
Armee l&auml;uft. Der weg ist frei! Bei der Schlange besteigt Indy den Baum, und trifft auch
gleich Sophia wieder. Damit Indy ein wenig auf sich aufmerksam macht, l&auml;&szlig;t er
sogleich was mitgehen, und zwar die Petoliumlampe. Wenn der Typ aufkreuzt erz&auml;hltst
du ihm du wolltest in den Tempel und seist Wissentschaftler.<BR>
Da Indy offentsichtlich &uuml;berhaupt keine Ahnung von diesen Dingen, werden wir auch nicht
reingelassen. Prima! Aber zum Gl&uuml;ck gibt es ja einen, der etwas mehr Grips hat als Indy:<BR>
Der Papagei auf dem Baum. Auf die Frage nach dem Titel sagt er uns der Hermocrates, und
du bist im Tempel. Da Indy die Lampe total schar fand, mu&szlig; Sophia mal kurz Sternhart
ablenken, w&auml;hrend er sich die Lampe schnappt. Mit dem Petrolium aus der Lampe wird dann
die kleine Figur ges&auml;ubert, und dann dem Elefanten angesteckt. Wenn du nun daran ziehst,
gibt die Figur einen Geheimgang frei, und Sternhart haut mit der Scheibe ab.
Aber was er &uuml;bersieht ist eine Orichalcum-Kugel am Boden. Von hier aus geht es jetzt
direkt nach<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Island</FONT></BIG></CENTER><BR>
Da der liebe Professor offentsichtlich tot ist, ist das nun wieder unsere Ausgrabung.
Die Perle legst du nun direkt in die Aalstatue rein, woraufhin diese sich aus
dem Eis schmilzt. Mit der Statue im Gep&auml;ck geht`s dann ab zu den<BR>
<BIG><CENTER><FONT COLOR=#FF0000>
Azoren
</FONT></CENTER></BIG>
<BR>
Da der alte Sack nicht mit dir reden will, l&auml;&szlig;t du das mal lieber Sophia regeln.
Als Sophia fragst du ihn dann, ob er Platos Dialog besorgen kann, und wo du ihn
finden kannst. Als Indy bietest du ihm dann die Aalfigur an, und er ver&auml;t dir,
da&szlig; du den Dialog im Barnett College findest. Na Super. Die ganze Reise umsonst!
Aber was solls, jetzt geht`s erstmal ins<BR>
<BIG><CENTER><FONT COLOR=#FF0000>Barnett College</FONT></CENTER></BIG>
<BR>
O.K., du sollst also den Gral finden. Nee,...&auml;hhh...den Dialog, genau. Also,
es gibt 3 verschiedene Orte, wo sich das Ding verstecken kann:<OL>
<LI>In einem B&uuml;cherschrank.
<LI>In einer Wachskatze.
<LI>In einer alten Truhe.</OL>
Du gehst erst mal in dein altes B&uuml;ro, und holst die Mayonaise aus dem K&uuml;hlschrank.
Mit dem Glas geht es dann zur&uuml;ck, und die Stufen hoch. Unter dem Stuhl klebt noch
ein altes Kaugummi, das steckt Indy nat&uuml;rlich sofort ein (f&uuml;r sp&auml;ter). Sportsman Indy erklimmt
daraufhin das Seil, und verschmiert die Mayo am Totenpfahl, und schnappt sich die
Steinspitze aus dem Regal. Nun geht es wieder ein par Etagen tiefer, in den Keller.
<BR>Anstatt das Kaugummi zu essen, steigt er nun mit ihm die Kohlenrutsche hoch.
Oben schnappt sich Indy dann die Wachskatze, um sie im Feuer aufzul&ouml;sen.<BR>
Wenn der Dialog da nicht war, nimmst du den Lappen und wickelst ihn um den Pfeil.
damit bewaffnet geht Indy dann wieder in den ersten Stock, und schraubt jede
der 5 Schrauben im umgest&uuml;rtzten Regal ab.<BR>
Wenn der Dialog auch nicht im Regal ist, gehst du ganz nach oben, den Totenkopf hoch
und &ouml;ffnest die Urne. In der Asche befindet sich ein Schl&uuml;&szlig;el f&uuml;r eine Truhe.
Also wieder ein Stockwerk tiefer, und die gro&szlig;e Kiste wegger&uuml;ckt. Und was finden wir?
Eine Truhe. Wenn der Dialog da auch nicht ist, ist dein Spiel kaputt. Das kommt vom
Cracken, sch&auml;m dich!<BR>Wenn du ins B&uuml;ro gehst stellt dich Sophia vor die Wahl, wie
es weitergehen soll:<UL type="circle">
<A HREF="-tips_indyteam.html"><LI>Du kannst im Team mit ihr losgehen. (Nichts f&uuml;r Frauenhasser)</A>
<A HREF="-tips_indyaction.html"><LI>Du kannst dich durchboxen (nichts f&uuml;r A600 User)</A>
<A HREF="-tips_indyknobel.html"><LI>Du kannst dich durchknobeln (nichts f&uuml;r Idioten)</UL><P></A>
Won deiner Entscheidung h&auml;ngt das Spiel ab, die Wege treffen sich allerdings in
Atlantis.