<HTML>
<HEAD>
<TITLE>Hard -Ich will alles!</TITLE>
</HEAD>
<BODY link=#FF0000 alink=#000000  bgcolor=#800000 TEXT=#FFFFFF>
<BASEFONT SIZE=3>

<CENTER><H2><FONT COLOR=#FFFF00>Der schwere Weg</FONT></H2></CENTER>
Nachdem unser Held seine Freunde mit der am&uuml;santen Geschichte des 1. Teils fast zu Tode gelangweilt h&auml;tte zieht er von dannen, und es beginnt<BR>
<CENTER><FONT COLOR=#FFFF00 size=4>Teil 1 -Das Largo Embargo</FONT></CENTER>
Gleich zu Anfang wird unser mutiger Darsteller ausgeraubt von der 2. Hauptrolle in diesem Spiel: Largo La Grande. Nachdem du so alle deine Reicht&uuml;mer losgeworden bist kann es weiter gehn.
Etwas weiter links befindet sich Wallys (Puppen-)Haus, von da nimmst du ein Blatt Papier mit, und wartest bis er sein Monokel ablegt, das du ebenfalls einsteckst.Von da aus gehst du in die Bar. Nach einer kleinen Plauderei taucht auch schon wieder Largo auf, und nimmt wieder das ganze Geld mit. Aber wo du schon mal da bist nimmst du mit dem
Blatt die Spucke von der Wand. Wieder oben betrittst du die K&uuml;che des Lokals, und zwar durch ein offenes Fenster an der Vorderseite. Dort l&auml;&szlig;t du auch noch das Messer mitgehen, und dann wanderst du zum n&auml;chsten Schiff, einem Hotelschiff. Da der Typ dich nicht zu Largo
lassen will gibst du ihm ein bi&szlig;chen Arbeit, indem du den Aligator befreist. Da Iff-brush heute noch nichts gegessen hat pl&uuml;nderst du auch noch den Napf von dem Viech. Das einzige Zimmer hier im Hotel ist das von Largo, dem stattest du jetzt mal einen Besuch ab.
Sein Toupee ist das einzig interessante, damit verlassen wir den Raum. Beim n&auml;chsten Schiff kannst du den Eimer mitnehmen, und dann gehst du wieder zum Orsteingang. Die Schaufel vom Schild k&ouml;nnte auch n&uuml;tzlich werden, also her damit. Mit all diesen Sachen verl&auml;&szlig;t du diesen Ort,
und begibst erstmal zum Strand. Dort nimmst du den kleinen Stock mit, und verschwindest wieder. Diesmal zum Friedhof, wo du bei den hinteren Gr&auml;bern Largos Grosvater ausbuddelst. Mit dem Knochen gehst du dann zum Sumpf, wo du erstmal den Eimer mit Schlamm f&uuml;llst, und dann den Sarg
besteigst und nach rechts ruderst. Bei der Voodoo Tante angelangt redest du mit &uuml;ber Largo und eine Voodoo Puppe, und sie gibt dir eine Einkaufsliste. 3 der 4 Zutaten hast du ja schon, fehlt nur noch etwas vom Faden. Apropos Faden: Neben dem Sch&auml;del liegt ein wenig Faden, den nimmst du auch mit.
Nun geht`s wieder in Richtung Woodtick, und zwar zu Largos Wohnung. Dort angekommen schlie&szlig;t du die T&uuml;r, und positionierst den Eimer direkt dadr&uuml;ber. Dann versteckst du dich hinter der Garderobe, und siehst zu, wie Largo in sein Ungl&uuml;ck rennt. Und wo wird Largo jetzt wohl
hingehen? Zur W&auml;scherei, genau! Nach ihrer Unterhaltung &ouml;ffnest du den Karton, und legst die K&auml;sereste da rein. Dann bindest du den Faden an den Stock, und h&auml;lst die T&uuml;r damit offen. Wenn die Ratte vom K&auml;se fri&szlig;t kannst du an der Leine ziehen, und sie geh&ouml;rt dir. Jetzt gehst du wieder zu Largos Wohnung,
und nimmst den Zettel hinter der T&uuml;r. Mit dem W&auml;scherei-Zettel gehst du nun zu Mad Marty und holst Largos Sachen ab. Aha...ein BH von ihm ist schon sauber. Ferkel!!! Na gut, dann kannst du ja gleich zur Voodo Tante gehen. Aber vorher gehst du zum Koch, und verfeinerst seine Suppe mit ein wenig pomme de Ratte.
Durchs Fenster geht es zur&uuml;ck und dann fragst du den Barkeeper, wie der Eintopf so ist. Wenn der Koch erstmal weg ist geh&ouml;rt dir sein Job, und au&szlig;erdem 420 Goldst&uuml;cke. Mit dem Geld geht es jetzt aber endlich zur Voodoo-Lady. Nachdem du ihr die Zutat gegeben hast erh&auml;lst du endlich eine Voodoo-Puppe, und kannst wieder zu Largo gehen.
Nachdem Largo weg ist (und LeChuck wiederbeleben wird) kannst du dich auf der Insel endlich frei bewegen. Bei der Halbinsel unten links kannst du ein Schiff chartern und weg von dieser Insel. Daf&uuml;r mu&szlig;t du dem Kapit&auml;n allerdings erstmal Wallys Monokel geben. Von hier schipperst du direkt in Richtung<BR>
<CENTER><BIG><A HREF="-tips_monkey2hard2.html">Teil 2 -Die vier Kartenst&uuml;cke</A></BIG><BR></CENTER>
