<HTML>
<HEAD>
<TITLE>Monkey Island</TITLE>
</HEAD>
<BODY bgcolor=#000000 text=#F00000 link=yellow>

<h2><CENTER><FONT color=yellow>Monkey Island</FONT></CENTER></H2>
Auf der Insel angekommen wird Gulasch-irgendwie sofort begr&uuml;&szlig;t von Herman Tootroth (also mir reichts, ich k&uuml;ndige!).<BR>
Wenn er weg ist nimmst du die Banane, und folgst ihm in den Jungel. Da ich
keine Karte abspeichern konnte, solltest du am besten erstmal selber den Dschungel
erkunden. Also, als erstes gehst du am besten mal einen Screen nach oben-links.
Hier gehst du zum Fort, am Rande des Vulkans. Fehrnrohr und Seil steckst du ein,
die Kananone gibt nach einem kleinen Schubser eine Kugel und Pulver raus.
Hermann Dingsbums verzieht zich auch ganz schnell wieder, und dann geht`s weiter,
einen Bildschirm nach rechts zum Damm. Der Feuerstein wird eingesteckt, und
mit Hilfe des Schie&szlig;pulvers und der Kugel der Damm hochgejagt. Am Teich der sich nun
gebildet hat nimmst du das Seil mit, und dann geht es zur&uuml;ck zum Damm, und den Felsen hoch.<BR>
Das Kuntstwerk zieht und dr&uuml;ckt G.T. jetzt solange, bis es direkt auf ihn zeigt, und
dann geht es noch eine Stufe h&ouml;her, wo du den gro&szlig;en Stein schubsen solltest.
Wenn du dir noch einen Spa&szlig; erlauben willst, kannst du auch das Schiff versenken, Steine
liegen da ja genug. Und wer unseren Helden killen will, kann ihn ja mal ganz nach rechts schicken :)<BR>
Am Strand liegen zwei herrenlose Bananen herum, und mit den zwei Seilen kannst du
dich jetzt in die Schlucht herablassen, und die Paddel aufsammeln. Mit den Rudern
kannst du nun auch das Boot vom Strand wieder flott machen, und um die Insel schippern,
der zweite Strand rechts ist deiner. Von da l&auml;ufst du zum KanibalenDorf, vo du die Bananen
mitnimmst. Nachdem du eingesperrt worden bist, nimmst du den kleinen Totenkopf,
und entfernst die Planke darunter. Du kannst nun an den Strand entkommen,
und nun gehst du wieder auf den ersten Bildschirm, wo du den Affen im Dschungel
mit den Bananen f&uuml;tterst. Lauf nun zu der Lichtung auf der Halbinsel, und wenn
der Affe dir gefolgt ist kannst du den rechten Totenkopf an der Nase dr&uuml;cken, und er
wird es dir nachmachen; et voila, die T&uuml;r ist offen. Schnapp dir die kleine Figur,
und lauf damit zu den Kanibalen.<BR>
Mit dem Bananenpl&uuml;cker gehst du nun aus der H&uuml;tte, und schenkst ihn Herman, woraufhin
er dir ein &uuml;berdimensionales Wattest&auml;bchen aush&auml;ndigt. Mit dem Schl&uuml;&szlig;el gehst du ...na rate
mal! Wenn du den Kopf aufgeschlo&szlig;en hast, kannst du den Kanibalen den Schl&uuml;&szlig;el
geben, und nachdem du mit ihnen geredet hast gibst du ihnen einfach den Prospekt,
und du erh&auml;lst prompt den Kopf!<BR>
So, ab geht`s in den Affen. Einfach den Navigator ben&uuml;tzen, und er sollte dich
bis zu LeChucks Schiff bringen. Nun solltest du den Kopf mit ein wenig Gewalt dazu
&quot;&uuml;berreden&quot; dir die Halskette auszuh&auml;ndigen. So unsichtbar geht es
nun an Bord des Geisterschiffes, die Voodoooo-MalzbierWurzel holen.<BR>
Als erstes Mal nach links, in LeChuck Kaj&uuml;te. Mit Stans Super-Magnet-Kompa&szlig; krallen wir
uns den Schl&uuml;&szlig;el von der Wand, und gehen wieder raus. Nun geht`s mal wieder unter Deck,
und dem Huhn nimmst du am besten eine Feder weg. Mit der Feder kitzelst du nun den
Geister-Piraten, bis er seine Flasche fallen l&auml;&szlig;t. Mit dem Schl&uuml;&szlig;el wird die Luke
aufgeschlo&szlig;en, und da Gruaybreff auch noch Angst vor Ratten hat, werden diese
mit dem Grog bet&auml;ubt. Mit dem Fett aus der Kiste wird dann die quietschige T&uuml;r ge&ouml;lt, und du
kannst eintreten. Das Werkzeug nimmst du mit, dann geht`s wieder unter Deck, zum
leuchtenden Kasten. Der sollte nun mit dem ganzen Werkzeug kein Problem mehr sein, oder?
Mit der Wurzel im Gep&auml;ck geht`s wieder zu den zivilizierten Einwohnern, die uns
daraus einen Soda-MalzTrunk brauen, nat&uuml;rlich magischen.<BR>
Doch was ist das? LeChuck ist weg. Na Bravo!<BR>
Nachdem der Geist uns alles erkl&auml;rt hat, auch noch die versenkten Freunde aufgetaucht sind,
und du mit Sicherheit den Geist weggepustet hast geht`s ab nach Meele Island, zum
<P>
<A HREF="-tips_monkeyfinale.html"><BIG><CENTER>Finale</CENTER></BIG></A>

</BODY>
</HTML>