<HTML>
<HEAD>
<TITLE>ATLANTIS</TITLE>
</HEAD>
<BODY bgcolor=#00FFFF TEXT=#000000 link=blue alink=#FF0000>


<CENTER><H2><FONT COLOR=#FF0000>Atlantis</FONT></H2></CENTER>
Etwas unterhalb von Indy befindet sich eine Leiter, die du rechts an den Steinhaufen stellen solltest. Oben angekommen &ouml;ffnest du das Steinding und nimmst den Metallstab.
Mit etwas Perlenkraft wird der Stab bl&uuml;tenrein. Ach nee, der leuchtet. Wenn es hell ist nimmst du wieder die Leiter, und legst die Scheiben auf die Achse. Wenn sie richtig eingestellt sind drehst du sie nochmal um 180&deg;, und wirfst eine Orichalcumperle in den Mund der Statue.
Wenn sich die T&uuml;r &ouml;ffnet betrittst du Atlantis als der 1. Mensch seit Tausenden von Jahren...lediglich die Deutschen waren schon vor dir da, aber ich sagte ja MENSCHEN...<BR>
In diesem Teil des &auml;useren Ringes befinden sich:<UL>
<LI>Der Maschinenraum
<LI>Ein Raum mit Roboterteilen
<LI>Ein Raum mit Gittern, durch den es zu Sophias Zelle geht
<LI>Eine Deutsche Wache.
</UL>
Im Raum mit den Teilen nimmst du das Bronzene Zahnrad mit, und gehst zu dem Raum mit dem L&uuml;ftungsschacht. Wenn du neben dem Roboter stehst wirfst du ihm eine Orichalcumperle in den Mund, und er killt die Wache.
Die Deutsche Wache solltest du K.O. schlagen, das gibt Punkte und eine Bratwurst. Dann gehst du weiter nach rechts oben. In diesem Teil gibt es:<UL>
<LI>Diverse R&auml;ume mit Verbindungstunneln
<LI>Eine Deutsche Wache
<LI>Einen Raum mit einem Krabbenteich
<LI>Einen Raum mit einer Statue und einem Loch
</UL>
Im Loch-Raum legst du die Leiter &uuml;ber das Loch, und holst dir den Becher. Die Leiter nimmst du auch wieder mit. &uuml;ber den &auml;uﬂersten Gang gehst du nun in den n&auml;chsten Abschnitt, direkt zu einem Unfall. Dem Skellet klaust du den Brustkorb; was solls, er ist tot! Dami l&auml;ufst du nun zur&uuml;ck zum
Krabbenraum, und legst das Kaugummi oder die Bratwurst in den Brustkorb. Wenn du den Korb in den Teich legst, bekommst du eine frische Krabbe daf&uuml;r. Im n&auml;chsten Abschnitt gibt es wieder ein par R&auml;ume:<UL>
<LI>Eine Deutsche Wache
<LI>Einen Raum mit 2 T&uuml;ren und viel Wasser.
</UL>
Wenn die T&uuml;ren offen sind kannst du auch zu Sophias Gef&auml;ngnis, aber noch nicht. Da hier nichts interesanntes ist gehn wir weiter in den n&auml;chsten Abschnitt. Dort gibt es:<UL>
<LI>Einen W&auml;chter
<LI>Einen Raum mit Tunnel, der zu einer Aal-Figur f&uuml;hrt
<LI>Einen Raum mit viel Lava
<LI>Einen Raum mit einer Fischstatue
<LI>Einen Raum mit Tunnel, der zu dem versch&uuml;tten Teil aus dem 2. Abschnitt f&uuml;hrt.
</UL>
Als erstes holst du dir die Aal-Figur, und dann den Kopf der Fischsatue. In dem Teil, wo du vorher nicht hin konntest gehst du in den Raum, und holst dir das Bronzerad. DAnn gehst du in den Lavaraum,
und stellst den Steinbecher auf den Sockel. Dann steckst du den Fischkopf in die Einbuchtung, und gehst mit dem vollem Becher zum Maschinenraum (1. Abschnitt).
Als erstes muﬂt du die Maschine reparieren. Dazu steckst du das Zahnrad mit Speichen auf die freie Achse. Dann gehst du die Treppe hoch, und f&uuml;llst die Lava in die Maschine. Unten erh&auml;llst du dann Orichalcum Perlen. Mit diesen Perlen und dem Zahnrad wanderst du jetzt zum Raum mit den Doppelt&uuml;ren, und legst
eine Perle in die Aal-Figur. Wenn das Wasser verdampft ist legst du auch noch eine Perle in die Fischstatue, und die T&uuml;r &ouml;ffnet sich. Erstmal gehst du ins Geef&auml;ngnis, und nimmst das Statuenteil mit. Dann gehst du zum<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Kanal</FONT></BIG></CENTER><BR>
Den Oktupuss kannst du mit der Krabbe f&uuml;ttern, und dann kannst du auch zum Floﬂ. Ins Maul steckst du eine Perle, und paddelst dann nach links. Um die T&uuml;ren zu &ouml;ffnen benutzt du einfach einen der Steine. Nach zwei Bildschirmen gehst du die Treppe hoch und nimmst das Zahnrad mit. Wieder auf dem Floﬂ geht es weiter nach links, und dann in den Durchgang.
Bei der Statue lehnst du als erstes die Leiter gegen die Brustplatte, und &ouml;ffnest sie. Die Statue reparierst du folgendermaﬂen:<BR>
Das Halbmond-Zahnrad kommt auf die beiden rechten Stifte, das Bronze-Rad und das weiﬂe RoboterTeil in die Mitte. Um den Arm nach Vorne zu bewegen steckst du das letzte Teil auf den oberen Bolzen, und legst eine Perle ein. Dann befestigst du die Kette am Bronzering an der T&uuml;r, und an dem Arm der Statue. Als n&auml;chstes steckst du ihn der Maschine das letzte Teil nach unten, und
wirfst wieder eine Perle ein. Wenn der Roboter die T&uuml;r &ouml;ffnet fliegt eine Gelenkstange runter, mit der du wieder in das Gef&auml;ngnis gehst. Du gibst die Stange an Sophia, und sagst ihr, sie soll sie unterklemmen wenn du die T&uuml;r &ouml;ffnest. Wenn Sophia drauﬂen ist, nimmst du wieder die Stange, und marschierst mit ihr in den<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Mittlerer Ring</FONT></BIG></CENTER><BR>
Im mittleren Ring dreht Sophia durch, und wird von Nur-Ab-fall kontrolliert. Folge ihr, und sieh sie an. Wenn du ihr eine Kugel in das Halsband steckst, wird es heiﬂ und sie h&auml;lt es hoch. Dann kannst du es in die Goldene Kiste stecken. Wenn der Geist tot ist gehst du noch die Treppe hoch, und schnappst dir das Zepter. Dann verl&auml;ﬂt du diesen scheuﬂlichen Raum.
Hinter der n&auml;chsten T&uuml;r befindet sich eine Maschine wie die auf Kreta, nur gr&ouml;ﬂer. Als Hebel nimmst du die Stange und das Zepter, und steckst sie in die &auml;uﬂersten Schlitze. Dr&uuml;cke sie nach oben, und werfe Orichalcum ein. Die Fahrt beginnt! Um anzuhalten ziehst du die Hebel nach unten, steckst den rechten in die Mitte, und ziehst ihn auch nach unten. Du f&auml;hrst direkt in den<BR>
<CENTER><BIG><FONT COLOR=#FF0000>Innerer Ring</FONT></BIG></CENTER><BR>
Wenn du die Br&uuml;cke entlang gehst kommst du zu einer Menge T&uuml;ren. Du muﬂt einen Weg da runter finden. Nimm am besten folgende T&uuml;ren:<BR>
Rechts, Rechts, Mitte, Mitte, Rechts, Links, Rechts oben die erste T&uuml;r. Wenn du bei der Lava angekommen bist muﬂt du da auch noch r&uuml;ber. Wenn du auf ein St&uuml;ck Lava trittst bricht das St&uuml;ck direkt vor dir weg. Das wirst du schon schaffen. Danach geht es weiter in Richtung Atlantis. Bei der Achse muﬂt du die Scheiben so drehen, wie auf dem Bild an der Wand bei dem Lavar&auml;tsel beschrieben. Die
Stadt wird nach rechts gedreht, ebenso der Vollmond, und die Mittagssonne nach schr&auml;g rechts unten. Wenn du es eingeschaltet hast erscheinen die Nazis, und wollen die Maschine ausprobieren. Nach ein bischen Gequatsche f&auml;hrt Kerner zur H&ouml;lle, und der Doktor will es an dir ausprobieren. Wenn er dich auf die Plattform geschickt hast benutzt du die Dialoge 3/2/3/4/3/2/1, und er stellt sich selber auf die Plattform.
Dann kannst du dich zur&uuml;cklehnen, und die Endsequenz ansehen. Es sei denn, du spielst von Disk. Dann mal gute Nacht...<BR>
PS: Die Punkte lassen sich Cheaten!<BR>
<A HREF="tips_solutions.html">Back</A><BR>
<CENTER><IMG SRC="heiligenschein.gif" BORDER=0></CENTER><BR>
<BIG><CENTER><STRONG><FONT COLOR=#FFFF00>The Saint -Markus Castro</FONT></STRONG></CENTER></BIG><BR>
<HR>
<A HREF="nocover.html"><IMG SRC="l_hauptinhalt.jpg" BORDER=0 WIDTH=639 height=99></A>
</BODY>
</HTML>

