<HTML>
<HEAD>
<TITLE>HIGGINS</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#400000">

<FONT COLOR="#ffff00"><P ALIGN="CENTER"><IMG SRC="Higgins.gif" WIDTH=400 HEIGHT=253></P>
<P><IMG SRC="line1.gif" WIDTH=741 HEIGHT=7></P>
</FONT><FONT COLOR="#ffffff"><H1 ALIGN="CENTER">Nur keine Panik</H1>
</FONT><FONT SIZE=4 COLOR="#ffff00"><P>Was ist denn jetzt schon wieder los ? Kaum verk&uuml;ndet Amiga Inc. wieder mal die neusten Gedankeng&auml;nge f&uuml;r die Zukunft des Amigas und schon spielt die Amigaszene wieder einmal verr&uuml;ckt.</P>
<P>Haben wir einen Amiga-Walker ? Haben wir das f&uuml;r Fr&uuml;hjahr 1998 angek&uuml;ndigte AmigaOS3.5 ? Wurde &uuml;berhaupt schon etwas seitens Amiga Inc. getan ? Immerhin - Amiga International hat neue K&ouml;pfe eingestellt, sich um den weiteren Vertrieb gek&uuml;mmert und zahlreiche Lizensvertr&auml;ge verteilt. Doch in den USA kam von Amiga Inc. dem Entwicklungsbereich f&uuml;r das Amigasystem au&szlig;er hei&szlig;er Luft bislang &uuml;berhaupt nichts. Ich wundere mich, da&szlig; man &uuml;berhaupt noch zuh&ouml;rt, wenn von dort aus wieder einmal d&uuml;nne Berichte zu irgendwelchen Zukunftspl&auml;nen gemacht werden.</P>
<P>&nbsp;</P>
<P>Ich finde es lobenswert, da&szlig; man sich dar&uuml;ber Gedanken macht, wie man einen NEUEN Amigamarkt nach der gro&szlig;en Jahrtausendwende aufbauen kann. Da ist es sicherlich richtig, solche Pl&auml;ne nicht mit HEUTE halbwegs aktueller CPU-Technologie zu konzeptionieren. Aber wieder einmal wurden solche Pl&auml;ne v&ouml;llig falsch an die interessierte &Ouml;ffentlichkeit heran getragen und f&uuml;rten dadurch unweigerlich und prompt zu Mi&szlig;verst&auml;ndnissen und sogar einer gewissen Massenhisterie.</P>
<P>Kurz- und mittelfristig haben sich ALLE f&uuml;r den PowerPC-Chip entschieden. Einen Prozessor, der prinzipiell &auml;u&szlig;erst g&uuml;nstig zu produzieren und dennoch enorm leistungsf&auml;hig ist. F&uuml;r einige Zeit wird uns das genug Power bringen, um unbeschadet mit dem Amiga ins n&auml;chste Jahrtausend zu gehen. Aber k&ouml;nnen wir damit Pentium-II-Anwender aufmerksam machen ? - Einen Gro&szlig;teil des Marktes bzw. verlorenen Bodens wieder zur&uuml;ck gewinnen ? Jetzt haben wir sehr vergleichbare Prozessorleistung gegen&uuml;ber der Intel-, AMD-, Cyrix- und IBM-Dom&auml;ne, aber der wichtigste Rest, n&auml;mlich die gen&uuml;gende Software fehlt immer noch. Noch eine Angelegenheit, weshalb ich sogar &uuml;ber Amiga Int. direkt ein wenig stinkig bin. Es ist auch DEREN Aufgabe, sich um gen&uuml;gend professionelle Software zu k&uuml;mmern, oder soll uns das Magic-Paket auch noch in f&uuml;nf Jahren begl&uuml;cken ?</P>
<P>Ganz wichtig ! - Es MU&szlig; schleunigst ein professionelles Officepaket f&uuml;r den PPC her ! Ein gut aufeinander abgestimmtes Office-Softwarepaket geh&ouml;rt heute zu jedem Computer. Da frage ich mich doch, was die beiden Amigafirmen an einem Tag alles unternehmen ???? Laut Tagebuch von Petro wird dort ja scheinbar nur einmal pro Woche gewerkelt, oder aber man ben&ouml;tigt dort mehrere Tage um Dinge zu schaffen, f&uuml;r die leistungsf&auml;hige Unternehmen einen Tag brauchen. Wir haben jetzt den PowerPC ? Wo ist da das gro&szlig;e Problem, gute Software zu portieren ? Den PPC gibt es schon l&auml;ngere Zeit in diversen anderen Rechnern, die reichhaltig &uuml;ber leistungsf&auml;hige Software verf&uuml;gen. So k&ouml;nnte Amiga Int. durchaus mal zB. an die T&uuml;ren von der Firma "Star Devision" klopfen und dort nachfragen, ob die Leute dort nicht ihr wirklich erstklassiges "Star Office"-Paket, welches bereits auf anderen PPC-basierenden Plattformen l&auml;uft, f&uuml;r den Amiga portieren m&ouml;chten. Es ist dabei durchaus nicht abwegig, da&szlig; Star Devision daran interessiert w&auml;re, da sie f&uuml;r das Betriebssystem LINUX ihr Officepaket bereits zur Verf&uuml;gung gestellt haben und auch dieses System eher ein Nischensystem ist. Ich m&ouml;chte keinem Wordworthfan auf den Schlips treten, - prinzipiell k&ouml;nnen wir damit schon sehr vioel machen, aber auf anderen Systemen w&uuml;rde man so etwas &auml;u&szlig;erst m&uuml;de bel&auml;cheln und als netten "Versuch" bezeichnen. Wer FinalWriter97 kennt, wei&szlig; nur zu gut, welch gewaltigen Verlust wir erhalten haben, als "Softwood" deren Weiterentwicklung einstellte....</P>
<P>Auf dem PPC haben wir bislang noch kein wirklich professionelles Textverarbeitungssystem und sofern jetzt Wordworth beim 68k-Prozessor am Ball bleibt w&uuml;rde sich hier niemand ins Gehege kommen. Aber solange Amiga Int. sich entspannt im Sessel rekelt und sich neue Spr&uuml;che &uuml;ber die m&ouml;gliche Amigazukunft ausdenkt, werden andere Firmen sehr wahrscheinlich gar nicht bemerken, da&szlig; der Amiga nun mit einem PPC zusammen arbeitet und den Programmierern erheblich leistungsf&auml;higere Programmierung erm&ouml;glicht.</P>
<P>W&auml;hrend wir nun also einer Softwareschmiede nach der Anderen nachweinen und uns mit Software begn&uuml;gen, die von einem einzigen Programmierer geschaffen wurde, verpennt der gro&szlig;e Amigakonzern jegliche M&ouml;glichkeit, dem Amiga wieder etwas auf die Beine zu helfen.</P>
<P>Schlimmer noch - statt dessen &uuml;berlegt man sich, was man in der Zeit auf den Markt bringen k&ouml;nnte, wenn man l&auml;ngst Konkurs angemeldet hat, weil niemand mehr da ist, der mit dem Amiga noch etwas zu tun haben m&ouml;chte. "Back for the Future" - welche ZUKUNFT ??? K&ouml;nnte man sich da mal langsam einigen ???</P>
<P>Am deprimierensten ist alles f&uuml;r die letzten noch gebliebenen Softwarebastler. Wie sollen sie ihre eigene Zukunft planen ? Auf welche Plattformzusammenstellung sollen sie sich einstellen ? Um morgen ein fertiges Programm zu ver&ouml;ffentlichen mu&szlig; man doch sp&auml;testens heute schon wissen, auf welchem Prozessor das Ganze laufen mu&szlig; ....</P>
<P>Klar, nach dem Jahr 2000 brauchen wir im Amiga m&ouml;glichst einen besseren Prozessor, als ihn die Konkurrenz verwendet, aber wir brauchen daf&uuml;r dann auch bessere Software, als sie die Konkurrenz verwendet. Was soll das geheimnisvolle Gerede &uuml;ber einen Supermegaprozessor, den es noch gar nicht gibt, mit Daten, die demnach noch gar nicht real herauszufinden sind ? Und wie kann man schon wieder Erscheinungstermine vom Podest rufen, ohne auch nur den Funken eines gut ausgearbeiteten Konzepts zu haben ? Ist alles nur die Summe grenzenloser Inkompetenz, oder nur dummes Geschwafel, damit den heute noch verbliebenen Anwendern eingetrichter wird, wir werden bald wieder DIE Nummer 1 sein ! ?</P>
<P>Ehrlich gesagt erwarte ich &uuml;berhaupt gar NICHTS mehr !</P>
<P>Ich habe einen Amiga und der existiert real ! Turbokarten mit leistungsf&auml;higen Prozessoren modernster RISC-Architektur sind lieferbar und real ! Ich wei&szlig;, was es an Software gibt und auch diese Programme sind real ! Es gibt unz&auml;hlige Erweiterungen, wie leistungsstarke Grafikkarten und gute Soundkarten. Eigentlich gibt es schon jetzt f&uuml;r den Amiga ALLES, .... zwar leider meistens sehr viel teurer und leider oft genug nicht ganz so leistungsf&auml;hig, aber das ist nur verst&auml;ndlich, daf&uuml;r ist es ja auch ein ganz besonderes System. Nicht auszudenken, wenn wirklich alles nur noch mit dem Standartbrei des Microsoft-Intel-Imperiums laufen w&uuml;rde.</P>
<P>Nutze ich aber ausschlie&szlig;lich nur das Amigasystem, so gebe ich viel Geld aus und mu&szlig; trotzdem neidisch auf den kompatiblen Markt starren. Ich gehe in ein Kaufhaus und sehe ein erstklassiges Programm, was wie f&uuml;r mich programmiert scheint und es kostet nur wenige M&auml;rker, da es ja bereits ein habes Jahr alt ist. Ich stehe am Kiosk, eine AmigaPlus in der Hand mit einer l&auml;ppischen Diskette in der Hand, worauf sich ein altes Programm befindet, was mich wirklich nicht vom Hocker rei&szlig;t. Und der Rest im Regal geh&ouml;rt f&uuml;nfzig verschiedenen PC-Zeitschriften, alle mit einer CD-ROM - die meisten zu einem unwesentlich h&ouml;heren Preis .... Aha - IBM-Voice-Type - Diktieren &uuml;ber Mikrofon direkt in jede Textverarbeitung f&uuml;r 20,- Mark. "Erben der Erde" f&uuml;r einen Zehner. Ein Autorennspiel, das nicht mal ein Jahr auf dem Buckel hat und jedes noch so tolle Racinggame auf dem Amiga wie ein lumpiges PD-Spiel aussehen l&auml;&szlig;t f&uuml;r 15 Mark. Ich kann nahezu jedes Heft in die Hand nehmen und bekomme eine Vollversion, deren Qualit&auml;t bei einem Amigaprogramm f&uuml;r Schlagzeilen sorgen w&uuml;rde.</P>
<P>Dann die H&auml;ndler und Hersteller auf dem Amigamarkt ..... w&auml;ren die Meisten davon auf dem hartumk&auml;mpften PC-Markt t&auml;tig, w&uuml;rden sie mit ihrer Arbeitsweise keine drei Monate &uuml;berleben. Ich bestelle einen neuen A1200 und warte Monate, - ich bestelle eine Blizzard1260 mit SCSI-Kit und warte Wochen, - ich bestelle eine Hypercom 3 und auch hier passiert gar nichts. Ich bekomme mehrere Auftr&auml;ge von PC-interessierten Kunden. Ich bestelle bei meinem Hauptlieferanten f&uuml;nf Komplett-PCs, drei Monitore und ein Modem nachmittags um drei Uhr und am darauffolgendem Tag steht in der Mittagspause alles bei mir auf dem Hof per UPS !!!</P>
<P>Kann man es einem eingefleischtem Amiganer eigentlich &uuml;berhaupt noch verdenken, wenn er das System wechseln will ?</P>
<P>Was w&auml;re nun aber die Alternative ?</P>
<P>Den teuer zusammengekauften Amiga f&uuml;r ein Taschengeld verscherbeln und einen Intelrechner kaufen ?</P>
<P>Nein, - auch das w&auml;re mehr als unklug ! Beispiele ? Ihr kauft einen PC und dessen Motherboard verf&uuml;gt &uuml;ber EDO-RAM-Sockel .... schon heute bekomme ich KEINE EDO-Simms mehr von den meisten Lieferanten. Vor wenigen Monaten einen PC gekauft und jetzt m&ouml;chte man den Prozessor erneuern, da selbstverst&auml;ndlich die aktuellsten Spiele schon nicht mehr laufen ? Kein Thema, das ging beim Amiga ja sogar beim kompletten Generationswechsel zum PPC ..... Denkste - Pentium II passt nicht mehr in den Sockel des noch nicht alten Motherboards. Gestern die marktf&uuml;hrende Grafikkarte mit 16 MByte Grafikspeicher gekauft - selbstverst&auml;ndlich eine AGP-Karte mit 3D ! Und das neue Spiel, auf das ich mich so gefreut habe l&auml;uft nur mit einer Zusatzkarte, die einen Voodoochip besitzt ? Naja, eine VoodooI-Karte kostet ja nur einen Hunderter, doch im Laden wird mir klar gemacht, da&szlig; mein jetzt neugekaufter PentiumII komplett mit dem Voodoo-I-Chip ausgebremst, statt beschleunigt wird, also brauche ich eine VoodooII-Karte f&uuml;r 550 M&auml;rker .... Mit ICH meine ich nicht mich, sondern "Hans Mustermann", denn ICH mache dieses Schwachsinns-Spektakel nicht mit !</P>
<P>Und das alles nur, weil mein vor sechs Monaten gekauftes System veraltet ist ?</P>
<P>Das kann doch alles nicht mehr die L&ouml;sung sein .... vielleicht doch lieber den Macintosh kaufen ? Doch hier ist das Softwareangebot ja noch kleiner, als auf dem Amiga .... Klar, es gibt unschlagbar leistungsf&auml;hige Software, - vor allem im DTP-Bereich. Aber alles kostet auch professionelles Geld und das PD-Angebot ist absolut j&auml;mmerlich.</P>
<P>Eigentlich gibt es keine Alternativen ..... man k&ouml;nnte h&ouml;chstens seinen Amiga behalten und ihn weiterhin nutzen. Es gibt auf ihm immer noch Software, die so gut auf keinem anderem System umgesetzt wurde. Nichts ist so komfortabel, als sich mittels VT mal eben schnell ein Verzeichnis voller Bilder anzusehen. Kein mir bekanntes Programm erm&ouml;glicht mir ein so einfaches, wie effektives bearbeiten und selbstmalen von Bildern, wie es PersonalPaint, oder selbst das alte DeluxePaint erm&ouml;glicht. Und erste Lichtblicke, wie zB. ElasticDreams zeigen mir ganz klar, da&szlig; selbst in den alten 68k-Prozessoren immer noch Potential steckt um mit PC-Programmen sowohl bei der Oberfl&auml;che, als auch der Leistungsf&auml;higkeit locker mitzuhalten.</P>
<P>W&auml;ren die PPC-Karten doch noch g&uuml;nstiger .... die Produktion nimmt den geringsten Teil des Verkaufserl&ouml;ses ein. Man denke doch nur mal an eine Playstation. Hier steckt ein vollwertiger Computer mit PPC603-CPU, leistungsf&auml;higen Grafik- und auch Soundchips drin. Speicher und CD-ROM sind auch dabei und der ganze Ramsch geht f&uuml;r 300 Mark &uuml;ber den Ladentisch. Was kostet eine vergleichbare PPC-Karte mit NUR dem 603 ??? - Leider war die Entwicklung nicht ganz billig und auch die Verkaufszahlen sind nicht ann&auml;hernd vergleichbar. Und trotzdem hoffe ich, da&szlig; die PPC-Karten bald noch weiter im Preis fallen, damit deren Anschaffung nicht in solch weiter Ferne liegen. Etwas mehr zu bezahlen, ist wohl jeder Amiganer gern bereit, sonst w&auml;re er l&auml;ngst schon kein Amiganer mehr, - aber das Geld nur so zum Fenster hinaus schleudern, da mu&szlig; es schon mehr, als locker sitzen.</P>
<P>Am besten ist also wohl wirklich den Amiga weiter zu nutzen. Wer dann noch nur spielen m&ouml;chte, kommt mit der Playstation am g&uuml;nstigsten weg. Wer hingegen auf die professionellen Anwendungen und &auml;u&szlig;erst interessanten Schn&auml;ppchen der Kompatiblen schielt, kommt um den Kauf eines PCs schwerlich herum. Hier n&uuml;tzt es jedoch wenig, einen uralten 486er der Sparsamkeit halber gebraucht zu kaufen. Es l&auml;uft immer weniger aktuelle Software darauf. Einen Pentium, bzw. dessen Konkurrenzmodelle von AMD, Cyrix und IBM sollte er schon haben und eine Festplatte unterhalb der 2 GBytegrenze macht auch schon wenig Sinn.</P>
<P>Wer nun unbedingt ZUS&Auml;TZLICH einen neuen PC erwerben m&ouml;chte, f&uuml;r den lohnt sich ein Anruf bei mir, da&szlig; k&ouml;nnen Andere bereits best&auml;tigen, da ich oft schon durch g&uuml;nstige Gro&szlig;handelslieferer unter &uuml;blichen Marktpreisen liege. ZB. gehen hier gerade </FONT><FONT SIZE=4 COLOR="#ffffff">Multimedia-komplettrechner mit 200MHz-MMX-Cyrix-CPU, 3D-SVGA mit 4MB-Grafikspeicher, TV-Ausgang, 3D-Dolby-Surroundsound onboard, Gameport, 32 MB-SD-RAM, 2,1 GB-Ultra DMA-HD, 20x-CD-ROM, Towergeh&auml;use, Win95-Tastatur, 3-Tastenmaus</FONT><FONT SIZE=4 COLOR="#ffff00"> f&uuml;r nur </FONT><FONT SIZE=4 COLOR="#ff0000">999,oo DM</FONT><FONT SIZE=4 COLOR="#ffff00"> an den Mann bzw. die Frau (nat&uuml;rlich fehlen alle sonst &uuml;blichen Ausstattungsmerkmale wie Anschl&uuml;sse und Floppy nicht - ich halte sie eben nur f&uuml;r selbstverst&auml;ndlich ) !!! Nat&uuml;rlich inklusive MWSt. und 1 Jahr Garantie. Stand : Juni / Juli 1998.</P>
<P>Und letzten Samstag konnte ich beim shopping bei diversen EDV-H&auml;ndlern wieder mal erleben, da&szlig; ich eigentlich viel zu g&uuml;nstig anbiete, - habe ich doch meine Monitorangebote ganze 150,- DM unter markt&uuml;blichen Preis kalkuliert. Und Gunnar Otte kann sicherlich best&auml;tigen, ein 56k-Modem mit guter Qualit&auml;t f&uuml;r 150 Mark extrem g&uuml;nstig bei mir eingekauft zu haben. Soviel Schleichwerbung mu&szlig;te einfach mal sein, schlie&szlig;lich ist es ja auch f&uuml;r Euch von Interesse, wenn Ihr irgendwo noch ein paar M&auml;rker sparen k&ouml;nnt. Bei Amigaspezifischen Artikeln k&ouml;nnt Ihr Euch jedoch meine Telefonnummer sparen, hier sind die Gewinnspannen weitaus niedriger, als das Porto, um die Ware vom Hersteller zu meiner Adresse zu bewegen - kein Witz !</P>
<P>Ich nehme aber KEINEN AMIGA in Zahlung ! Den sollt Ihr gef&auml;lligst behalten und ich garantiere Euch, da&szlig; Ihr Euch auch neben dem PC noch &uuml;ber den Amiga freuen k&ouml;nnt, denn immer wenn Windows95/98 wieder einmal Bl&ouml;dsinn macht, freut Ihr Euch &uuml;ber Euer stabil laufendes AmigaOS, - wollen wir wetten ? Au&szlig;erdem freue ich mich &uuml;ber jeden Amigauser und m&ouml;chte nicht an der Minimierung der User beitragen. Also zus&auml;tzlich einen PC - kein Problem, - bekommt man gerne und g&uuml;nstig beim HIGGINS. Statt des AMIGAs einen PC, - da m&ouml;chte ich nichts mit zu tun haben !</P>
</FONT><FONT COLOR="#ffff00"><P><IMG SRC="line1.gif" WIDTH=741 HEIGHT=7></P>
</FONT><FONT COLOR="#ffffff"><H2>Fazit :</H2>
</FONT><FONT SIZE=4 COLOR="#ffff00"><P>Ein Fazit f&uuml;r eine solch chaotisch geschriebene Meinung ? Hhhhmmmm..... Leute es lohnt nicht Tr&uuml;bsal zu blasen ! Wer mit dem Amigasystem nicht mehr komplett zufrieden zu stellen ist, kann ruhig mal &uuml;ber ein zweites System nachdenken. Spieler kommen sicherlich sehr gut mit der Playstation weiter. Wer tiefer in die Tasche greifen kann und m&ouml;chte und vor allem nicht nur spielen m&ouml;chte, ist mit dem zus&auml;tzlichen Kauf eines PCs besser bedient. Es n&uuml;tzt dann aber nichts, sich mit einem zu alten Rechner zu begn&uuml;gen, denn da hat jeder halbwegs aktueller Amiga noch mehr auf dem Kasten. Und la&szlig;t das Zukunftsgerede seitens Amiga Inc- &amp; Int. Gerede sein. Was in zwei Jahren angek&uuml;ndigt ist, kommt sowieso h&ouml;chstens mal in drei bis vier Jahren auf den Markt und braucht dann noch mal t&uuml;chtig Zeit, bis es Massenmarktf&auml;hig im Preis und beim Softwareangebot ist. Bis dahin reichen uns die heute aktuellen PPC-Karten doch locker und dann m&uuml;&szlig;te man sowieso wieder aufr&uuml;sten. &Uuml;berlegt doch einfach mal, wie Euer Computer vor vier Jahren ausgestattet war ! - Da war Euer jetziger Amiga doch sicherlich auch noch eine Tr&auml;umerei, oder etwa nicht ?</P>
<P>Also NUR KEINE PANIK ! - Der PPC ist und bleibt unsere JETZT reale Zukunft, egal, was Amiga Inc. da wieder vor sich hinspinnt. Ich verstehe wirklich nicht, wie man solch inkompetente Statements in die Weltgeschichte setzen kann. Warum sagt Jeff Schindler nicht gleich "in f&uuml;nf Jahren wird Bill Gates bei uns um eine Prakltikantenstelle anfragen ....". Da steckt genausowenig &uuml;berlegtes Konzept drin, wie zu den gemachten &Auml;u&szlig;erungen. Peinlich peinlich ....</P>
<P>Kommt jetzt blo&szlig; nicht auf die Idee, nichts mehr ins Amigasystem zu investieren, aus Angst, das morgen bereits ein komplett anderer Amiga angeboten wird. Gebt Amiga Inc. ein gutes Vorbild und bleibt realistisch ....</P>
</FONT><FONT COLOR="#ffff00"><P><IMG SRC="line1.gif" WIDTH=741 HEIGHT=7></P>
<P>In desem Sinne mit tiefgr&uuml;ndigen &Uuml;berlegungen, ob der Amiga tats&auml;chlich noch in guten H&auml;nden ist .....</P></FONT>
<P ALIGN="RIGHT"><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=176 ALIGN="RIGHT" HSPACE=12>
<TR><TD VALIGN="TOP" BGCOLOR="#00ffff" HEIGHT=56>
<FONT COLOR="#ffff00"><P ALIGN="CENTER"></FONT><A HREF="MITGLIEDER/HAGEN.HTML">HIGGINS
<P ALIGN="CENTER">Cord Hagen</A></TD>
</TR>
</TABLE>
</P>

<FONT SIZE=4 COLOR="#ffff00"><P>Euer .....................................................................................................</P>
</FONT><FONT COLOR="#ffff00"><P>PS. Sorry f&uuml;r die dicke Anfangsanimation ! Dieses mal gibt’s kaum Text von mir, da habe ich f&uuml;r den dadurch gesparten Platz kurzerhand mal meine Animation eingef&uuml;gt ;-)</P>
</FONT></BODY>
</HTML>
