<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT=black link=blue alink=red >
<BODY background="l_bg.gif" TEXT=black link=blue alink=red bgcolor="#dddddd">
<CENTER>
</CENTER>



<P>
<IMG SRC="wiedemann.jpg"   width=640 height=120>
Hi ALLE<BR>
Ich h&#228;tte da ein gro&#223;es Problem, aber um dieses Problem genau zu 
beschreiben beginne ich vom Anfang an. Ich hatte einen Amiga 1200, HD 40 Mb , 
2*CDRom und 4 Mb Speichererweiterung. Nun beschlo&#223; ich eine
gr&#246;&#223;ere Festplatte und mehr Ram's zu besorgen. Ich bestellte somit eine 
HD 170 und wollte 8Mb Speichererweiterungkarte, aber wie mir der Verk&#228;ufer 
beim Telefon mitteilte, w&#228;re der Aufpreis f&#252;r eine Turbokarte mit 16 MB 
gering und der Gewinn an Geschwindigkeit enorm . So kaufte ich mir eine Blizzard 
1230 IV, installierte HD und Turbokarte ( Die Speichererweiterung und  alte HD 
bekam der Sohn meiner Schwester ) und was geschah : mein CDRom begann zu
spinnen, d.h. Es klappte beim Ersten mal, aber beim Zweiten mal nicht mehr und
dies ging Monate lang. Bei einem Anruf bei Andreas Magerl ( wegen einer defekten 
NoCover-Diskette, die er mir Prompt mit einer Guten austauschte ) erkl&#228;rte
er mir, es k&#246;nne wegen der Turbokarte sein, da&#223; sich die Turbokarte mit 
dem Kontroller sich nicht vertr&#228;gt und es g&#228;be einen Kontroller speziell 
f&#252;r die Turbokarte. Ich kaufte mit den Kontroller ein neues CdRom ( es 
mu&#223;te ja ein SCSI sein ) und das Alte wandert zu meinem Neffen, wo es jetzt 
ohne Probleme l&#228;uft. Ich baute den Kontroller ein und schlo&#223; das 
CDRom an, installierte das mitgeschickte Programm und ......... es funktioniert nicht. 
Ich mu&#223;te noch per Hand Files in C, L und Libs kopieren aber es klappt nicht. 
Per Telefon gab mir der Verk&#228;ufer noch Anweisungen, was ich eingeben sollte 
und man sah das er den Kontroller erkennt nur das CdRom nicht. So probierte ich es 
mit dem Programm IDEfix, auch da manchmal erkannte es den Kontroller 
mittlerweile Funkstille. Einmal probierte ich eine MusikCD und was h&#246;rten 
meine Ohren aus dem Kopfh&#246;rer   .........Musik, doch blockierte sich das 
Programm, mit klar Text, die Musik lief weiter aber ich konnte keine Funktion mit der
Maus ausf&#252;hren, wie z.B. Stop ecc... . <BR>
Nun oft gab mir das Programm beim installieren des CD0 eine Fehlermeldung und
oft nur das es das 1230scsi.device nicht &#246;ffnen kann . <BR>
So meine speziellen Fragen : <BR>
1.) Beim Start mit einer Cd wie z.B. APC&amp;TCP Volume3 l&#228;uft mein 
CDRom hoch, so das es zu vibrieren beginnt, da&#223; es aber bei einer Musik CD 
nicht tut. <BR>
2.) Beim Programm YACDP gibt es  Unklarheiten, d. H. beim TestCDRom gibt mir
der Rechner:<BR>
ERROR : Can't Open  Device() <BR>
Device     : SCSI.device <BR>
Board      : 0  <BR>
UNIT       :1  <BR>
LUN        :0   <BR>
TestCDRom failed returncode 20 <BR>
<BR>
beim YACDP kommt : <BR>
ERROR  : Can't Open Device () <BR>
Device    : 1230SCSI.device  <BR>
Board     : 0  <BR>
UNIT      : 0   <BR>
LUN       : 0   <BR>
 Nun zur Frage, warum der Unterschied beim Device und UNIT ? <BR> <BR>
3,) Oft ging beim IDEfix das Eject CD, nun nicht mehr, es gibt mir immer ein Fenster
      worin geschrieben steht : CDRom Not FOUND <BR>
Zum Schlu&#223; noch der Inhalt des Files CD0, vielleicht ist hier der Hund 
begraben :<BR>    
/***************************************************************/ <BR>
/*  CacheCDFS mountlist entry &#169; 1993 Elaborate Bytes, O. Kastl */ <BR>
/***************************************************************/ <BR>
	FileSystem     = L:CacheCDFS /* The name of the game */ <BR>
	Device         = &quot;1230scsi.device&quot; /* Name of exec device driver */ 
<BR>
	Unit           = 0 /* exec device unit */ <BR>
	Flags          = 0 /* OpenDevice flags */  <BR>
	BlocksPerTrack = 351000 /* Unused */ <BR>
	BlockSize      = 2048 /* True, but unused */ <BR>
	Mask           = 0x7ffffffe /* Memory mask for direct read */ <BR>
	MaxTransfer    = 0x100000 /* Maximum amount of bytes for direct read */ 
<BR>
	Reserved       = 0 /* Unused */ <BR>
	Interleave     = 0 /* Unused */ <BR>
	LowCyl         = 0 /* Unused */ <BR>
	HighCyl        = 0 /* Unused */ <BR>
	Surfaces       = 1 /* Unused */ <BR>
	Buffers        = 50 /* Number of cache lines */ <BR>
	BufMemType     = 513 /* MEMF_PUBLIC|MEMF_24BITDMA */ <BR>
	GlobVec        = -1 /* Do not change! */ <BR>
	Mount          = 1 /* Mount it immediately */ <BR>
	Priority       = 10 /* Priority of FileSystem task */ <BR>
	DosType        = 0x43443031 /* Currently unused */ <BR>
	StackSize      = 3000 /* Minimum stack required is 3000! */ <BR>
	Control        = &quot;MD=0 LC=1 DC=8 L LV AL LFC=1 S M&quot; <BR>
   /* The Control field is for special adjustments */ <BR>
   /* L/S convert all file/volume names to lowercase */ <BR>
   /* LV/S convert volume names to lowercase */ <BR>
   /* AL/S Auto-Lower converts only non-Amiga CDs */ <BR>
   /* LFC/N start converting at this character */ <BR>
   /* LC/N/A number of blocks per cache line */ <BR>
   /* DC/N/A number of cache lines for the data cache */ <BR>
   /* MD/N/A number of blocks, when starting direct read, not using */<BR>
   /* the cache. 0 will be a reasonable default (LC*DC+1) */  <BR>
   /* S/S Do SCSI direct commands, no Trackdisk like commands! */<BR>
   /* NC/S Do NOT use TD_ADDCHANGEINT, poll for DiskChange! */<BR>
   /* M/S Issue a TD_MOTOR (OFF) command after read */ <BR>

<BR>
Ich habe, nach dem ich dies geschrieben habe, nochmals den Verk&auml;ufer
telefoniert und er schickt mir ein neues Kabel, vielleicht liegt dort der Fehler, aber 
ich bin f&uuml;r jede Hilfe dankbar.<BR> 
So hoffe ich nun ihr k&#246;nnt mir helfen, mit DANK            Euer Ricky-W<BR>
&#220;brigens, die Sonderzeichen wandelte mir ein Hai um, n&#228;hmich der 
HTMLHAI von Andreas ETZRODT.


</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639
height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
