<HTML>
<HEAD>
<TITLE>Leserbrief DOSO</TITLE>
</HEAD>
<BODY background="l_bg.gif"TEXT=black link=blue alink=red bgcolor="#dddddd">
<H1>Doso hat was zu sagen!</H1>
Und zwar an:<P>
<PRE>
Christian Schmidt - INDY
Daniel Stein - NAGASH
Fabina Kruse - dR. Thema:DemoArtikel
Sieglinde Peters Thema: Amiga und die Zukunft = ?
</PRE>
<H4>Hi Christian!</H4>

Ok vergessen.<BR>
Ja wenn ich Stre&#223; habe kann es mit Briefen schon a bisserl dauern :-( Kann ich aber nix f&#252;r es kam halt alles sch&#246;n zusammen :-(<BR>
Hehe B&#214;SES Vesalia!!!! Ich hoffe die tauschen das um!!<BR>
Ja also ich habe mir das auch anders vorgstellt mit der WoA! ( Hat sich wol jeder ). Aber ung gut nun hab ich endlich ne gute Ausrede warum ich mir nen PC kaufe ;-)<BR>
Wie was MODEM , neus Zimmer? ERZ&#196;HL MAL!<BR>

<H4>Hallo Daniel!</H4>

Ich denke es war andersrum: Erst mit dem Denken geschrieben und dann mit dem Kulli nachgedacht... oder? Ach Egaaaal!<BR>
Wie du schon gemerkt hast, ist mir LEIDER ( heul schn&#252;fff ) was dazwischen gekommen :-(( Nun ja ich hoffe mal darauf das das Treffen mal wiederholt wird. Denn dann kann mich eigentlich nix davon abhalten zu kommen... Denke ich :-)

<H4>Hi dR. !</H4>

Heute zur Ausnahme mal dein Pseudo nicht vereppelt ( hab heut meinen sozialen... ) na ja du schreibst da was von nix Demos und so... Nun klares Urteil f&#252;r mich: <BR>
<H3>SCHULDIG wie die H&#246;lle.</H3><BR>
Erkl&#228;rung: Ich schreib ja nun f&#252;r die Amiga Future und... rausred... dummlall...

<H4>Sieglinde Peters</H4>

Tja kurz vorm aufr&#252;sten und dann kommt der WoA Schock. Tja nun hei&#223;t es: Amiga im Tower + Pup Karte oder Aldi PC ?<P>
Das dein momentanter Amiga nicht Upgradef&#228;hig ist, ist eine Sache die eigetlich selbstverst&#228;ndlich ist. Der A1200 hat nu auch schon ein paar J&#228;hrchen auf dem Buckel.<BR>
Auch ich bin schon einige Zeit am Gr&#252;beln WAS ich un mache: Amiga aufr&#252;sten oder PC kaufen? Ich habe mich f&#252;r einen Mittelweg entschlossen: Amiga etwas aufr&#252;sten und PC kaufen. D.H. mein Amiga bekam einen Tower, mehr Ram und demn&#228;chst eine Blizzard 1240/40. Damit bin ich wieder auf dem aktuellen Stand und kann mich AMigam&#228;&#223;ig wieder soweit zur&#252;ckhalten bis sich absch&#228;tzen l&#228;&#223;t WAS nun lo&#223; ist.<BR>
Der PC mu&#223; einfach sein. LEIDER ist er zu m&#228;chtig geworden um um ihn herum zu kommen!<BR>
Ich w&#252;rde dir auch zu einer Mischl&#246;sung raten:<P>
Infinitiv II Tower ( sind ziemlich gut ) und evtl. eine 1240er Karte. Am besten eine BLizzard. Die Pup Karten sind omentan etwas unsicher. Obwohl es schon ziemlich interressante Soft daf&#252;r gibt. Aber mit einer 1240er Karte bist du momentan noch gut im Rennen, und sollte sich Pup durchsetzen kannst du dir ja immer noch eine kaufen. Und wenn du ne Blizzard 1240 nimmst kannst du auch noch Geld sparen, weil ja die CPI weiterverwendet wird und Phase5 Upgrade Angebote bietet!<BR>
War das jetzt das endg&#252;ltige Aus f&#252;r Amiga?<BR>
Nun ich habe 2 Antworten parat:<P>
Die Harte: Amiga hat schon lange keine Chance mehr!<BR>
Dei aufmunternde: Sie es nicht als Ende, sondern als Anfang eines Neuen!
<P>
<a href="mailto:DOSO@HIGVOLT.GUN.DE?subject=Text in NoCover">Christian Wimmer - DOSO</a>
</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>