<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Abakus</title>
</head>
<body background="st_abakus.gif" text=black link=blue alink=red bgcolor="#FFFFF6">
<a name="top"></a><br>
<p align="center"><font color="#000080">
<h5><b>Ein seltsames Rechenger&#228;t:</h5><br>
<h3>der Abakus</h3></font></b></p>

<p>
Der Mensch war immer bem&#252;ht, seine Berechnungen zu beschleunigen. Die
Babylonier waren die ersten, die mit Markierungen in Tont&#228;felchen ihre
Rechenoperationen beschleunigten und pr&#228;zisierten. Der Abakus wurde erst
sp&#228;ter erfunden, vielleicht im alten &#196;gypten, doch das wei&#223; man nicht
genau. Der Abakus war die erste Rechenmaschine des Menschen; die Zahlen
wurden von kleinen Gegenst&#228;nden (Kieselsteinen, Fruchtkernen oder
durchbohrten Muscheln) dargestellt, die auf d&#252;nnen St&#246;ckchen aufgereiht
waren. Sein Name stammt wahrscheinlich von dem griechischen Ausdruck
<i>abax,&#160; abakos</i>, &#160; womit eine &quot;staubbedeckte Tafel&quot; gemeint war, auf der man
Berechnungen und geometrische Figuren zeichnen konnte. Das griechische
Wort l&#228;&#223;t sich m&#246;glicherweise vom hebr&#228;ischen <i>abaq</i>, &#160; das hei&#223;t &quot;Staub&quot;,
ableiten. Der Ausdruck verweist also auf eine Entstehung im Nahen Osten.</p>
<p>
Obwohl die Mathematiker des antiken Griechenland mit den Entdeckungen
der meriterranen V&#246;lker vertraut waren und sie mit eigenen Beitr&#228;gen
fortzuentwickeln wu&#223;ten, fanden ihre Erkenntnisse keinerlei praktische
Auswirkungen auf das soziale und wirtschaftliche Leben der griechischen
Gesellschaft. Vielmehr hielt man solche Gedankeng&#228;nge f&#252;r wenig mehr als
intellektuelle Spielereien. Selbst naturwissenschaftliche und technische
Fortschritte orientierten sich kaum an praktischen Anwendungen, an einer
Steigerung der Arbeitsproduktivit&#228;t oder einer Befreiung von
k&#246;rperlichen Belastungen, sondern wurden vor allem als Ausdruck der
Erfindungsgabe der Intelligenz verstanden. Das selbe Vorurteil
behinderte auch die Entwicklung der griechischen Mathematik, so dass wir
die wichtigsten algebraischen und arithmetischen Entdeckungen den
indischen und arabischen Mathematikern der Zeit zwischen 400 und 1200
n.Chr. verdanken. In unsere Gefilde gelangte dieses Wissen durch die
Kaufleute der Seerepubliken.</p>
<p>
Ihre st&#228;rkste Verbreitung erfuhr die Mathematik nach der
protestantischen Reformation und die Erfindung von Papier und Buchdruck.
Es war Martin Luther, der neben der Vervielf&#228;ltigung der Bibel die
Drucklegung arithmetischer Textb&#252;cher verlangte. Die Inder und nach
ihnen die Araber hatten die Vorteile des positionellen Zahlensystems
erkannt. H&#228;ndler und Kaufleute zogen aus dieser Vereinfachung besonderen
Nutzen, und sie brachten auch den Abakus in die L&#228;nder des Westens. In
manchen Restaurants und Gesch&#228;ften Ru&#223;lands, Chinas und Japans wird er
noch heute benutzt, und auch die bunten K&#252;gelchen best&#252;ckten
Rechenhilfen der Erstkl&#228;&#223;ler stammen davon ab.</p>
<p>
<img src="st_abakus1.jpg" width=325 height=150 align=right>
Die Form des Abakus variiert je nach Volk und Zeitstufe. Die Version mit
Holzperlen auf d&#252;nnen St&#228;bchen stellt einen Typ dar, den wahrscheinlich
die Chinesen erfunden haben. Die Araber entwickelten andere
Konstruktionen, beispielsweise in der Form eines schr&#228;g angeordneten
Gitters. Wir wollen es mit der Multiplikation etwa der Zahlen 3283 und
215 erkl&#228;ren. Das rechteckige Gitter enth&#228;lt so viele K&#228;stchen, wie die
zu multiplizierenden Zahlen Ziffern haben, in unserem Fall also 4x3.
Die Quadrate werden durch senkrechte Diagonale geteilt, die nach unten
auf eine Basislinie gef&#252;hrt werden. Die beiden Zahlen schreibt man an
den Rand und multipliziert sie dann Ziffer f&#252;r Ziffer. Das K&#228;stchen
rechts au&#223;en z.B. enth&#228;lt das Ergebnis der Operation 5x3=15, das
K&#228;stchen ganz links die Operation 2x3=6. Einer stehen rechts der
senkrechten Teilungslinien, Zehner links davon. Wenn das Gitter voll
ist, werden die Zwischenergebnisse auf der Basislinie addiert. Die
Richtigkeit des Ergebnisses 705.845 kann jeder mit dem Calculator in
Tools sofort &#252;berpr&#252;fen.</p>
<p>
Die zweite Abbildung zeigt eine Variation eines Abakus mit &#228;hnlichem
Aufbau. Auch hier wird diagonal addiert, um das Ergebnis zu erhalten.
Ein Schema dieser Art schwebte 400 Jahre sp&#228;ter Pascal und Leibnitz vor,
als sie an die Entwicklung der ersten Rechenmaschine dachten.</p>
<p>
<img src="st_abakus.jpg" width=206 height=218 align=left>
Das Schlu&#223;bild zeigt einen Abakus, wie er heute noch in China in
Gebrauch ist. Dieser eignet sich nur f&#252;r Addition und Subtraktion. Jede
senkrechte Perlenreihe repr&#228;sentiert eine bestimmte Position des
Dezimalsystems, das hei&#223;t von rechts nach links die Einer, Zehner,
Hunderter usw. Jede Perle unter dem Querbalken gilt entsprechend als 1,
10, 100 usw. Eine Perle &#252;ber dem Balken repr&#228;sentiert 5 Einheiten, also
5 Einer, 5 Zehner usw. Auf dem Bild wird die Zahl 173 dargestellt.</p>
<p>
Bei der Addition beginnt man ganz rechts und schiebt die ben&#246;tigten
Perlen zum Querbalken zu dem eingestellten Ausgangswert hinzu. Reichen
die Perlen im Depot nicht mehr aus, dann mu&#223; gegen einen 5er Wert
getauscht werden. Bei der Subtraktion arbeiten wir von links nach
rechts. Das Rechensystem bleibt auch hier das gleiche. Nur hier mu&#223; vom
Mittelbalken weggezogen werden. Detailliertere Beschreibung ist an
dieser Stelle wohl nicht vonn&#246;ten, da in heutiger Zeit alles
elektronisch gerechnet wird und Kopfarbeit nicht mehr gefragt ist. Mit
diesem kleinen Ausflug wissen wir aber etwas eingehender und ausf&#252;hrlicher, was
eigentlich ein Abakus ist, n&#228;mlich der Ur- Ur- Urvorg&#228;nger unserer
Freundin.</p>
<p align="right"><a href="Mitglieder/zimmer.html">
<b>[Wolf Zimmer]</a></b></p>
<hr color="#FF00FF" size=3>
Gehe&#160;<a href="#top">zum Anfang</a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
</body>
</html>
