<html>
<head><title>Linux und die Zukunft des Amiga</title></head>
<body background="marble.jpeg" text=#000000 link=#0000ee vlink=#551a8b alink=#ff0000>
<p><img src="penguin.gif" alt="Linux Pinguin">
<h1><a href="http://www.linux.org/">Linux</a> und die Zukunft des Amiga</h1></p>

<p>Zuerst einmal m&ouml;chte ich mich, auch wenn ich selbst einen PC benutze,
deutlich von den &uuml;blichen PC-Anh&auml;ngern distanzieren. Ich verstehe
Euren Ha&szlig; auf <a href="http://www.intel.com/">Intel</a>, Windoof&nbsp;95 und
<a href="mailto:the-great-emperor@m$.com">Bill&nbsp;Gate$</a> v&ouml;llig und
kann mich Euch absolut anschlie&szlig;en. PC-Hardware ist der totale Murks,
das gebe ich auch zu, aber solange Linux das alles gut im Griff hat, lohnt
sich meiner Meinung nach ein PC weit mehr als ein PowerAmiga. Aber darum soll
es hier nicht gehen.</p>

<p>Viele von Euch werden meine Idee f&uuml;r verr&uuml;ckt halten. Es soll
eigentlich auch eher ein Gedankenspiel als eine ernsthafte Auseinandersetzung
sein - aber wer wei&szlig;, was vielleicht noch daraus wird.</p>

<p><h2>Linux - was ist das &uuml;berhaupt?</h2><br>
Linux ist ein Unix-kompatibles Betriebssystem, das von einem Hacker namens
<strong>Linus Torvalds</strong> vor einigen Jahren urspr&uuml;nglich auf einem
386er entwickelt wurde. Inzwischen hat es sich rasant weiterentwickelt und ist
f&uuml;r viele Systeme, darunter auch 68000er Systeme wie Amiga und Atari
verf&uuml;gbar.<br>
Wie alle Unix-Systeme bietet Linux volle Mehrbenutzer-Unterst&uuml;tzung und
damit eine recht hohe Sicherheit des Systems gegen Angriffe von au&szlig;en,
denn ohne Pa&szlig;wort kann man &uuml;berhaupt nichts machen. Auch das System
in sich ist damit stabiler, denn ein Programm, das abst&uuml;rzt (auch wenn
das nicht allzu oft passiert), kann nicht, wie auf anderen Betriebssystemen,
etwa wichtige Systemdateien zerst&ouml;ren. Auf die hat es n&auml;mlich gar
keinen Zugriff.<br>
Ein weiterer Vorteil von Unix ist die Kompatibilit&auml;t: Ein Programm, das
f&uuml;r Unix geschrieben ist, kann, da Unix-Programme immer als Quellcode
verbreitet werden, auf jedem beliebigen Rechner compiliert und benutzt werden,
v&ouml;llig unabh&auml;ngig von der Hardware, solange auf diesem Rechner Unix
l&auml;uft.<br>
Die unter Euch, die Linux kennen, werden vielleicht sagen, da&szlig; es viel
zu kompliziert ist, um wirklich weit verbreitet zu werden. Aber wie der Titel
schon sagt, geht es hier um die Zukunft, und ich bin zuversichtlich, da&szlig;
sich das &auml;ndern wird.<br>
Aber jetzt habe ich genug drum herumgeredet - auf zur Tat.</p>

<p><h2>Vorteile und Nachteile des AmigaOS</h2><br>
Ihr alle sch&uuml;ttelt nur den Kopf &uuml;ber die Pl&auml;ne von
AI, da&szlig; der Amiga demnext zu Windoof kompatibel sein soll,
weil damit das Look&nbsp;&amp;&nbsp;Feel des
AmigaOS verloren geht. AmigaOS hat eine hervorragende grafische
Benutzeroberfl&auml;che (eigentlich sollte man Bedienoberfl&auml;che
sagen, denn die Benutzeroberfl&auml;che ist ja die Haut&nbsp;:-) und
ist damit auch f&uuml;r &quot;Unwissende&quot; leicht zu benutzen.<br>
Was sich dahinter verbirgt, also der &quot;Kern&quot; des Betriebssystems,
ist beim AmigaOS allerdings gro&szlig;teils nicht so hervorragend: Es gibt
z.B. keinen Speicherschutz, d.h. ein Programm kann ganz einfach den Speicher
eines anderen Programms lesen oder gar &uuml;berschreiben. Ein
abst&uuml;rzendes kann damit auch andere Programme oder gar das ganze System
mit sich &quot;in den Tod rei&szlig;en&quot;. Es k&ouml;nnte durch einen
dummen Zufall sogar die Platte formatieren. Das ist zwar ziemlich
unwahrscheinlich, ist aber schon passiert.<br>
Au&szlig;erdem ist es praktisch unm&ouml;glich, ein gescheites
Multiuser-System in AmigaOS zu implementieren, was verhindert, den Amiga
z.B. als Workstation einzusetzen, aber auch den Rechner des Privatanwenders
macht es mehr oder weniger unsicher. L&auml;&szlig;t man z.B. einen Freund,
der wenig Ahnung von Computern hat, an den Rechner, wenn man nicht dabei ist,
dann kann er problemlos aus versehen Dateien l&ouml;schen, und er kann alle
Dateien lesen, die man auf dem Rechner hat, auch wenn sie ihn absolut nichts
angehen. Hat man ein Mehrbenutzersystem, so richtet man demjenigen einfach
einen neuen Account (Zugang mit eigenem Pa&szlig;wort) ein. Er kann dann weder
Dateien l&ouml;schen, die ihm nicht geh&ouml;ren, noch kann er welche lesen,
die ihn nichts angehen.<br>
Neben diesen beiden gro&szlig;en Sicherheitsl&uuml;cken gibt es noch eine
Menge kleinerer Probleme, z.B. auch da&szlig; jedes Tool, das die Workbench
etwas verbessert, gleich im System rumpatchen mu&szlig;, was manchmal zu
Abst&uuml;rzen f&uuml;hrt, wenn sich mehrere dieser Commodities nicht
vertragen oder sich ein Commodity nicht mit einem anderen Anwendungsprogramm
vertr&auml;gt.</p>

<p><h2>Linux - das Ende allen &Uuml;bels?</h2><br>
Dieser Murks ist es sicherlich nicht, der den typischen Amiga ausmacht,
sondern das ist die leistungsf&auml;hige GUI. Was w&auml;re nun, wenn man
die starke GUI des Amiga mit einem stabilen und sicheren OS-Kern wie etwa
Linux zusammenbringen k&ouml;nnte? Das Ergebnis w&auml;re ein leistungsstarkes
Betriebssystem mit der Einfachheit und dem Look&nbsp;&amp;&nbsp;Feel von
AmigaOS. Wenn man das objektiv betrachtet, w&uuml;rde man meiner Meinung nach
nichts am AmigaOS vermissen. Im Gegenteil, es g&auml;be noch einige Vorteile,
die AmigaOS nicht zu bieten hat.</p>

<p><h2>Die Amiga-Software unter der neuen Umgebung</h2><br>
Freilich w&uuml;rde die Amiga-Software nicht sofort unter der neuen Umgebung
laufen. Eigentlich ist die Entwicklungsumgebung von Unix und
<a href="http://www.x.org/">X</a> (der grafischen Oberfl&auml;che unter Unix)
sogar ziemlich verschieden von der des AmigaOS.<br>
Das ist aber kein allzu gro&szlig;es Problem. Statt an AmigaOS&nbsp;3.5
herumzumurksen und andauernd den Erscheinungstermin zu verschieben,
k&ouml;nnte AI eine Library programmieren, die alle Funktionen des AmigaOS
unter Linux zur Verf&uuml;gung stellt. Alle sauber geschriebenen
Amiga-Programme k&ouml;nnten dann ganz einfach mit sehr wenigen
&Auml;nderungen (die ein einzelner Programmierer wahrscheinlich in einem Tag
erledigen kann) unter Linux neu compiliert werden. Die Hersteller sollten dies
als kostenloses Update an alle Kunden bereitstellen.<br>
F&uuml;r Programme, die noch nicht umgesetzt sind, wird es nat&uuml;rlich auch
weiterhin m&ouml;glich sein, das &quot;alte&quot; AmigaOS zu benutzen.<br>
Nun k&ouml;nnt Ihr sagen, wegen der oben angesprochenen Kompatibilit&auml;t
k&ouml;nnte man ja die Amiga-Programme auf jedem Computer benutzen, und keiner
w&uuml;rde mehr den Amiga brauchen. Aber wie gesagt, daf&uuml;r braucht man
den Quellcode der Programme. Wird der nicht rausgegeben, so kann man das
Programm doch nur auf dem Rechner benutzen, f&uuml;r den es compiliert wurde.
Das w&auml;ren in unserem Fall alle Rechner mit 68000er Prozessor, f&uuml;r
die es Linux gibt, also der Amiga, der Atari und einige &auml;ltere Macs. Die
sind wohl alle keine ernstzunehmende Konkurrenz f&uuml;r den Amiga.</p>

<p><h2>Eigene Software entwickeln unter Linux</h2><br>
G&auml;be es besagte Library, so k&ouml;nnte man seine eigenen Programme
weiterhin genauso entwickeln, wie man das vorher unter AmigaOS getan hat,
nur mit dem kleinen Unterschied, da&szlig; man keinen mehrere hundert Mark
teuren Compiler mehr braucht, sondern den
<a href="http://www.gnu.org/">GNU</a>-Compiler gcc benutzen kann. Der
ist freie Software und damit kostenlos, au&szlig;erdem ist er einer der besten
seiner Art. So guten Code wie gcc wird wohl keiner der momentan f&uuml;r den
Amiga erh&auml;ltlichen Compiler erzeugen.<br>
Wer gcc auf dem Amiga benutzt, der wird jetzt sagen, da&szlig; die von gcc
compilierten Programme doch recht langsam sind. Das ist allerdings nur unter
AmigaOS so, denn gcc ist nun mal ein Unix-Compiler, und unter AmigaOS
mu&szlig; Unix emuliert werden, damit die Programme laufen k&ouml;nnen (das
machen die <tt>ixemul.library</tt> und <tt>ixnet.library</tt>). Wenn gcc aber
erst mal &quot;richtige&quot; Unix-Programme erzeugen kann, dann stellt er
alle anderen Compiler in den Schatten.<br>
Nat&uuml;rlich kann gcc auch PowerPC-Code erzeugen. Wenn es eine
vern&uuml;nftige L&ouml;sung f&uuml;r den PowerPC-Amiga gibt, in der das
Betriebssystem komplett auf dem PowerPC l&auml;uft und ohne den 68000 auskommt
(was bei den derzeitigen PowerUP-Boards ja nicht der Fall ist - da sind die
Programme f&uuml;r OS-Aufrufe auf den 68000 angewiesen), kann der neue Amiga
seine volle Leistung entfalten.</p>

<p><h2>Systemanforderungen</h2><br>
Freilich braucht Linux mindestens einen 68030 (und zwar keinen EC- oder
LC-Chip, sondern einen richtigen 68030 mit MMU), weil es sonst
keinen Speicherschutz oder virtuellen Speicher realisieren k&ouml;nnte. Im
Gegensatz zu Windoof braucht Linux diesen Prozessor nur wegen seiner Features
und nicht, weil es so viel Rechenpower, wie dieser Prozessor bietet, schon
selbst verbraucht. Ich denke, auch ein 68030 ist schon v&ouml;llig veraltet,
und so langsam kann man wirklich erwarten, da&szlig; jeder, der
einigerma&szlig;en auf dem Stand der Zeit sein will, mindestens so etwas in
seinem Rechner drinhat.<br>
Was man f&uuml;r Linux zugegebenerma&szlig;en reichlich braucht, ist RAM.
Wer mit GUI arbeiten will (was die meisten Amiga-User wohl wollen, und
f&uuml;r das eben vorgestellte Konzept mit der Amiga-Library unter Linux ja
auch n&ouml;tig ist), sollte schon mindestens 16, besser 32 MB oder auch mehr
haben. Auch das ist inzwischen Standard, und allzu teuer ist RAM auch nicht
mehr.<br>
Eine SCSI-Platte ist auch ganz sinnvoll, aber nicht n&ouml;tig (habe ich auch
nicht). Im Gegensatz zu PCs ist SCSI auf dem Amiga ja recht weit verbreitet,
so da&szlig; es da keine gro&szlig;en Probleme geben wird.</p>

<p><h2>Fazit</h2><br>
Dieses Konzept erlaubt es, die Amiga&nbsp;Workbench und viele Programme, die
unter AmigaOS laufen, unter einem Betriebssystem zu benutzen, das weitaus
h&ouml;here Sicherheit und Stabilit&auml;t bietet als das momentan aktuelle
AmigaOS (und wahrscheinlich auch als 3.5, denn <strong>so</strong> gro&szlig;
k&ouml;nnen die Neuerungen ja nicht sein, wenn es nicht einmal f&uuml;r einen
Sprung zu 4.0 reicht (auch wenn es eigentlich mal Zeit w&uuml;rde, aber das
ist eben das Problem von kommerzieller Software)). Davon, da&szlig; Unix so
kompliziert ist, merkt man nichts mehr. F&uuml;r den Benutzer
<strong>ist</strong> dies praktisch AmigaOS.<br>
Man kann das nicht mit Kombinationen wie DOSe/Windoof oder AmigaOS/pOS
vergleichen, denn dort wird die untere Ebene von der jeweils h&ouml;heren
Ebene teilweise abgeschaltet und durch eigene Routinen ersetzt, was das System
nicht gerade stabiler macht. Der AmigaOS-Layer &uuml;ber Linux erhebt nicht
den Anspruch, ein Betriebssystem zu sein, und er murkst nicht in dem darunter
gelegenen Layer, dem Linux-Kernel, herum, sondern baut nur darauf auf.<br>
Wie gesagt, es ist nur ein Gedankenspiel, aber ich wei&szlig; im Moment nicht,
was dagegen sprechen sollte. W&auml;hrend die AmigaOS-Entwickler nun alle
Features, die Linux bereits bietet, noch einmal programmieren
m&uuml;&szlig;ten, k&ouml;nnten sie mit der Amiga-Library von der rasanten
Entwicklung von Linux profitieren, das freie Software ist und damit von
hunderten oder gar tausenden von Hackern weltweit immerzu erweitert und
verbessert wird.<br>
<a href="http://www.apple.com/">Apple</a> will mit dem neuen Mac-Betriebssystem
<strong>Rhapsody</strong> einen &auml;hnlichen Weg einschlagen: Das gesamte OS
soll so einfach und unkompliziert sein wie bisher, intern aber auf
&quot;Mach-Kerneln&quot; basieren, die dem Programmierer ein komplettes Unix
bereitstellen, das oft programmiertechnisch viel st&auml;rker
und leistungsf&auml;higer ist als die Schnittstellen anderer
Betriebssysteme.<br>
Au&szlig;erdem kann man auf dem Amiga dann auch Unix-Programme benutzen, die
nicht explizit f&uuml;r AmigaOS geschrieben sind. Das er&ouml;ffnet dem Amiga
ein riesiges Potential an guter Software, die &uuml;brigens fast alle frei
und kostenlos erh&auml;ltlich ist. So etwa der Editor xemacs (den ich auch
gerade benutze) oder auch <a href="http://www.netscape.com/">Netscrap</a>.</p>

<p><h2>Eure Meinung ist gefragt!</h2><br>
Was haltet Ihr von der Idee? Was ist gut, was k&ouml;nnte man besser machen?
Ich diskutiere gerne mit anderen dar&uuml;ber. Antwortet mir am besten per
Email (NoCover dauert immer so lange):
<a href="mailto:jan@lenin.dinet.de"><tt>jan@lenin.dinet.de</tt></a></p>

<hr>

<p><center><a href="NoCover.html">Zur&uuml;ck zum Inhaltsverzeichnis</a></center></p>

</body></html>