<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Magische Quadrate</title>
</head>
<body background="st_magisch.gif" TEXT=black link=blue alink=red bgcolor="#FFFFF6">
<a name="top"></a><br>
<p align="center"><font color="#000080" size="5">
<b>Magische Quadrate -<br>
Geschichte und mathematische Eigenschaften</font></b></p>

<p> 
Ein magisches Quadrat ist eine wiederholungsfreie Anordnung positiver
ganzer Zahlen von 1 bis n&#178;, bei der jede Reihe, Spalte, sowie die beiden
Diagonalen diesselbe Summe bilden. Die Zahl n nennt man Ordnung, Basis,
Modul oder Wurzel des Quadrats.</p>
<p>
Die kleinste M&#246;glichkeit ist ein Quadrat aus neun K&#228;stchen mit den Zahlen
Eins bis Neun, die so aufgeteilt sind, dass jede Reihe, Spalte und
Diagonale die Summe 15 ergibt. Die Chinesen, die es <i>Lo Shu </i>&#160; nannten, haben
zuerst seine faszinierenden Eigenschaften entdeckt.
<img src="st_magisch1.jpg" width=200 height=200 align=right>
Eine Legende berichtet, diese Figur sei den Menschen zum ersten Mal auf dem
Panzer einer Schildkr&#246;te begegnet, die viele Jahrhunderte vor unserer
Zeitrechnung aus dem Flusse Lo gekrochen kam. Historisch ist <i>Lo Shu </i>&#160; nicht
fr&#252;her als im 4. Jahrhundert v.Chr. entdeckt worden. Die Chinesen gaben den
mathematischen Eigenschaften des magischen Quadrats eine mystische Bedeutung und
hielten es f&#252;r ein Symbol, das die Urelemente der Dinge, des Menschen und
des Universums vereinte. Gerade Zahlen repr&#228;sentieren das weibliche Prinzip
Yin, ungerade das m&#228;nnliche Yang. In der Mitte der Reihen, Spalten und
Diagonalen liegt die F&#252;nf, die die Erde symbolisiert. Um sie herum
verteilen sich die vier Urelemente: das Metall, dargestellt durch die Vier und
Neun, das Feuer, repr&#228;sentiert von Zwei und Sieben, das Wasser mit Eins und
Sechs sowie das Holz mit Drei und Acht. Wie man leicht erkennen kann, sind in
jedem Element die beiden gegens&#228;tzlichen Prinzipien Yin und Yang
vertreten.</p>
<p>
Die Renaissance bescherte dem Europa des 15. und 16.Jahrhunderts eine
kulturelle und k&#252;nstlerische Erneuerung, die alle Zweige des Wissens
ber&#252;hrte. Auch Mathematik und Geometrie erfuhren einen gl&#252;cklichen
Aufschwung und wurden zum fruchtbaren Bezugspunkt f&#252;r die bildenden K&#252;nste
und die Architektur. Einer, der die vielf&#228;ltigen Tendenzen in seiner Person
zur Synthese brachte, war der Wissenschaftler, Schriftsteller, Gelehrte,
Ingenieur, Mathematiker und K&#252;nstler Leonardo da Vinci (1452-1519). F&#252;r ihn
waren Mathematik und Geometrie aufs Innigste verkn&#252;pft mit den anderen
k&#252;nstlerischen und kulturellen &#196;u&#223;erungen des Menschen. In seiner - leider
verlorengegangenen - Abhandlung &#252;ber die Malerei <i>De pictura</i> mahnt er den
Leser schon in der Einleitung: &quot;Mich lese niemand, der kein Mathematiker
ist.&quot; Lange vor Leonardo hatte schon der antike Philosoph Platon (428-348
v.Chr.) diesen Zusammenhang erkannt und eine entsprechende Warnung sogar
&#252;ber dem Eingang seine Philosophenschule anbringen lassen: &quot;Niemand soll
eintreten, der die Geometrie nicht beherrscht!&quot;</p>
<p>
<img src="st_magisch3.jpg" width=174 height=199 align=left>
Die enge Verbindung von Mathematik, Geometrie und Kunst pr&#228;gt auch das Werk
des aus N&#252;rnberg stammenden Malers Albrecht D&#252;rer, eines Zeitgenossen
von Leonardo. In seinem ber&#252;hmten Kupferstich <i>Melancholie</i>&#160; hat er an
markanter Stelle ein magisches Quadrat verewigt, das &#252;brigens viele
f&#252;r das erste Beispiel eines solchen Quadrats im Abendland halten. Es ist
so konstruiert, dass jede Reihe, Spalte oder Diagonale die Summe 34 ergibt.
<img src="st_magisch2.jpg" width=100 height=100 align=right>
Selbst die vier K&#228;stchen in der Mitte summieren sich zu 34 und die vier
&#228;u&#223;eren ebenfalls. Dar&#252;ber hinaus enthalten die beiden mittleren
K&#228;stchen der untersten Reihe die Jahreszahl der mutma&#223;lichen Enstehung
des Werkes: <b>1514!</b> Neben der engen Beziehung zwischen Mathematik und
bildender Kunst hatte D&#252;rer vielleicht noch ein anderes Motiv, dieses
Quadrat in eine Darstellung mit dem Thema &quot;Melancholie&quot;
einzuf&#252;gen. Den magischen Quadraten vierter Ordnung wurde damals eine
besondere therapeutische Wirkung zugeschrieben, und Astrologen hielten sie
f&#252;r ein n&#252;tzliches Amulett gegen die Melancholie.
</p>
<p>
Wenn man bei einem Quadrat dritter Ordnung Rotation und Spiegelung ausschlie&#223;t,
gibt es nur eine einzige L&#246;sung. Bei Quadraten h&#246;herer Ordnung w&#228;chst auch die
Zahl m&#246;glicher Anordnungen. Unter Ausschlu&#223; von Rotation und Spiegelung lassen
sich die 16 Zahlen eines Quadrats vierter Ordnung bereits auf stattliche
880 Weisen anordnen, wie als erster der Mathematiker Bernard Fr&#233;nicle de Bessy
im Jahre 1693 entdeckte.</p>
<p>
Es konnte bisher noch nicht gekl&#228;rt werden, nach welchen mathematischen Gesetzen
sich die Zahlen der magischen Quadrate verteilen. Die L&#246;sungen entstanden
immer durch Versuch und Irrtum. Wie viele magische Quadrate f&#252;nfter Ordnung
gibt es? Lange Zeit sch&#228;tzte man die Zahl auf 13.000.000, doch erst 1973 konnte
der Amerikaner Richard Schroeppel (ein Programmierer) mit dem exakten Ergebnis
aufwarten. Ohne Rotation und Spiegelung gibt es f&#252;r das Quadrat f&#252;nfter
Ordnung genau 275.305.224 L&#246;sungen.</p>
<p>
Im Mittelalter gaben die Mohammedaner magischen Quadraten der f&#252;nften Ordnung
mit der Zahl 1 im Zentrum eine besondere mystische Bedeutung. Denn die Zahl 1
repr&#228;sentierte Allah, das einzigartige und h&#246;chste Wesen. Das Problem des
Begriffs und der Darstellung Gottes erscheint in allen Religionen und
Theologien. Die Zahl 1 scheint die Einheit des Seins symbolisch am reinsten
auszudr&#252;cken. Um die Unaussprechlichkeit des h&#246;chsten Wesens anzudeuten, zog
man es darum oft vor, das f&#252;r die 1 bestimmte Zentralfeld des magischen
Quadrats leer zu lassen.</p>
<p align="right"><a href="Mitglieder/zimmer.html">
<b>[Wolf Zimmer]</a></b></p>
<hr color="#FF00FF" size=3>
Gehe&#160;<a href="#top">zum Anfang</a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
</body>
</html>
