<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="st_wolfinfo.gif" TEXT=black link=blue alink=red bgcolor="#FFFFCC">
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" width="100%" bgcolor="#808080"><font
color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td>
</tr>
</table>

<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" bgcolor="#C0C0C0"><font color="#000080"><b>Inhalt</b></font>
<p><a href="#a1"><font size="1" face="arial">Treffen in Vellmar
</font></a></p>
<p><a href="#a2"><font size="1" face="arial">Anliegen
</font></a></p>
    
<p><font color="#000080"><b>Wolf-INFO</b></font><br>
<font size="1">von</font><br>
<a href="Mitglieder/zimmer.html">Wolf Zimmer</a><br>
E-Mail: <a href="mailto:022451486-0001@t-online.de"><font
size="1" face="arial">022451486-0001@t-online.de</font></a></p>
<p><a href="NoCover.html"><font size="1" face="arial">Zurück zum NoCover-Index
</font></a></p>
</td>
<td valign="top"><a name="a1"><font color="800000" size="7"><center>
<b>Treffen in Vellmar</font></b></a></center><br>
<p>
Zur&#252;ck vom &quot;Clubtreffen&quot; in Vellmar habe ich mich entschlossen, auch ein paar
S&#228;tze zu schreiben. Es gibt bestimmt ein paar Statements von verschieden zu
lesen, die kundtun, ob es ihnen gefallen hat und vor allem wie dieses Treffen
bei den Anwesenden angekommen ist.</p>
<p>
Selbstverst&#228;ndlich kann ich nur meine ureigenste subjektive Meinung von mir
geben und nicht f&#252;r alle sprechen. Bevor ich damit anfange, m&#246;chte ich nochmals
meinen Dank an Sascha v.W. und Daniel Stein richten. Das Verwirklichen dieser
Idee und das Umsetzen in die Tat ist global gesehen sehr gut gelungen und sollte
keinesfalls als einmalige Angelegenheit angesehen werden. Meinerseits ist nichts
dagegen einzuwenden, wenn dies zu einer st&#228;ndigen j&#228;hrlichen Einrichtung werden
w&#252;rde. Dass es bei einem ersten Mal immer Schwachpunkte geben kann, ist
selbstredend und deshalb sprechen wir auch nicht dar&#252;ber. Das regelt sich bei
zuk&#252;nftigen Treffen von ganz alleine.</p></td></tr></table>
<p>
An dieser Stelle spreche ich auch meine Anerkennung und Bewunderung an Rolf Nue
aus Wue aus, der trotz seines Geburtstages angereist kam und seine Frau
&#252;berzeugen konnte, dass so ein erstes Treffen von immenser Wichtigkeit sein
kann, so dass ein Geburtstag mal zur&#252;ckstehen sollte. Auch meinen Dank an seine
Frau, dass sie so verst&#228;ndnisvoll war und ihn sogar aufforderte zu fahren.</p>
<p>
Und jetzt sind wir beim Casus knacktus. In der NoCover liest man Artikel und
Ansichten der verschiedensten Schreiber jeden Alters und Coleurs. Manche kennen
sich, weil man kleine Treffen der in der Umgebung Wohnenden gemacht hat. Oder
man hat sich zuf&#228;lligerweise bei einer Messe kennengelernt oder sonstwie. Aber
das Gro&#223; der Clubmitglieder kennt den anderen nicht. Zu diesem Treffen haben
sich aber viele gesagt, dem mu&#223; ich abhelfen und kamen angereist. Und nun
haben wahrscheinlich fast alle feststellen k&#246;nnen, dass die anderen User
auch nur mit Wasser kochen und nicht alles wissen. Und das Sch&#246;nste Erlebnis
eines jeden war bestimmt, dass nicht ein einziger gesagt hat: &quot;Was bist Du
bl&#246;de, das mu&#223; man doch wissen!&quot; Es ist doch klar, der eine hat die Interessen,
der andere ist auf andere Gebieten st&#228;rker bewandert. Wenn dies nun alles
in einen Topf geworfen wird und einer r&#252;hrt kr&#228;ftig um, kommt doch eine starke
Truppe zusammen. Und diese Erkenntnis war f&#252;r alle bestimmt gut.</p>
<p>
Nun m&#246;chte ich allen Gekommenen danken, dass jeder auf den anderen R&#252;cksicht
genommen und seine eigenen Belange zur&#252;ckgestellt hatte. Ich meine in erster
Linie die Raucher. Ich fand es sehr anst&#228;ndig, dass im Saal nicht geraucht
wurde. Ich wei&#223;, wovon ich rede. Denn am 13. M&#228;rz 1995 habe ich von einem auf
den anderen Tag aufgeh&#246;rt zu rauchen. Sechzig Zigaretten waren aber auch zu
viel. Was ich mit diesen S&#228;tzen ausdr&#252;cken will, ist, dass ich aus tiefstem
Herzen nachempfinden kann, wie es in einem Raucher aussieht, der vor dem Monitor
sitzt und nicht rauchen darf. Also nochmals mein Dankesch&#246;n an die
r&#252;cksichtsvollen Raucher.</p>
<p>
Jeder Artikel sollte eine Quintesenz haben, so auch dieser. F&#252;r das n&#228;chste
Treffen w&#252;rde ich mir w&#252;nschen, wenn gegen Ende (oder auch irgendwann zwischen
durch) ein Roundtable-Gesp&#228;ch stattfinden w&#252;rde. Ich verstehe darunter ein
Zusammensetzen aller Beteiligten, sich in einer Runde f&#252;r sagen wir mal eine
Stunde ohne Computer zusammenzufinden und &#252;ber allgemeine Fragen, die uns alle
betreffen, zu reden und diese zu er&#246;rten. In kleineren Gruppen wurde dieses ja
ansatzweise schon gemacht, aber in einer gr&#246;&#223;eren Runde kommt vielleicht etwas
effizienteres dabei heraus.</p>
<p>
Eines der sch&#246;nsten Erlebnisse waren die gro&#223;en Augen, die manche von uns
gemacht haben, als sie ihre NoCover Beitr&#228;ge auf den Bildschirmen der anderen
erblickten und sie fast nicht wieder erkannten. Die lakonische Antwort war: bei
mir sieht es aber ganz anders aus. Ja und das ist ja auch das gr&#246;&#223;te Problem.
Unsere drei g&#228;ngigen Browser arbeiten teilweise nach verschiedenen Methoden und
&#228;ltere Versionen verkraften noch weniger als man sich nur ertr&#228;umen kann. Hinzu
kommen noch die verschiedensten Bildschirmaufl&#246;sungen und Monitorgr&#246;&#223;en, die f&#252;r
eminente Verf&#228;lschungen sorgen k&#246;nnen. Trotzdem gibt es welche unter uns, die
sagen warum soll ich denn, die HTML Ausgaben gefallen mir sowieso nicht. Gerade
diejenigen sollten mal neuere Versionen installieren und schon werden sie ihre
Meinung &#228;ndern. Und das Entscheidende, was die meisten am Wochenende wohl
gelernt haben, ist, dass bei dem Selber-Layouten WENIGER manchmal MEHR ist.</p>

<p><img src="st_wolfinfo.jpg" width=320 height=240 border=0 align=left hspace=5 vspave=0>
Abschlie&#223;end m&#246;chte ich betonen, dass ich viel lernen konnte und auch gerne
manche Anregung aufgenommen habe, wie z.B. auf NewIcons umzusteigen. Dies
war &#252;brigens meine erste Aktion, nachdem ich den Compi wieder aufgestellt
hatte. Dabei habe ich auch festgestellt, warum in Vellmar es zum Absturz kam.
Wir hatten vergessen in der Startup-Sequence den Passus &quot;C:PatchOpenWB&quot;
einzugeben. Alles andere hatten wir richtig gemacht. Um Platz zu sparen, habe
ich meinen Screenshot verkleinert, um ihn hier zeigen zu k&#246;nnen.
Titel dieses Bildes: Charly hat eine Maus gefangen.</p><br>&#160;

<a name="a2"><font color="800000" size="7"><center>
<b>Anliegen an die Autoren</font></b></a></center><br>
<p>
Wie es sich wohl herumgesprochen haben wird, bin ich zur Zeit dabei, einen Index
f&#252;r die NoCover Ausgaben in HTML zu erstellen. Dabei mu&#223; ich leider feststellen,
dass in letzter Zeit &#246;fter ein Artikel oder Test keinem Autor zugeschrieben
werden kann. Dies ist bestimmt keine b&#246;se Absicht. Ich nehme an, dies ist eher
ein unbeabsichtigtes Versehen, als ein vors&#228;tzliches Vergessen. Dies kann aber
sehr leicht gel&#246;st werden. Wenn im Kopf der Dummydatei der Autor sich verewigt
hat, wird dies in all seinen Artikeln mit &#252;bernommen. Ich schlage vor, so wie
im folgenden Beispiel zu verfahren und schon gibt es keinerlei Schwierigkeiten
mehr.</p>
&lt;html&gt;<br>
&lt;head&gt;<br>
&lt;meta name=&quot;description&quot; content=&quot;Wolf-INFO&quot;&gt;<br>
&lt;meta name=&quot;author&quot; content=&quot;Wolf Zimmer&gt;<br>
&lt;titel&gt;Wolf-INFO&lt;/title&gt;<br>
&lt;/head&gt;<br>
&lt;body  und so weiter</p>
<p>
Und der Vollst&#228;ndigkeithalber sollte jeder seine Arbeit dann mit<br>
&lt;/body&gt;<br>
&lt;/html&gt;<br>
abschlie&#223;en. Ob der Test CV64 (Autor = ?????) von &#228;lteren Browsern oder auf
anderen Plattformen richtig dargestellt wird, wei&#223; ich leider nicht. Aber
ich kann es mir gut vorstellen, denn nicht umsonst wird bei den IBM Kompatibeln
davor gewarnt, ja nicht die formatgerechte Beendigung seines Werkes zu vergessen.</p>

  
Gehe&#160;<a href="#top">zum Anfang</a> oder <a href="NoCover.html">
Zum Inhaltsverzeichnis der NoCover</a>.
<hr color="#FF00FF">
</body>
</html>
