<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.05 [de] (Win95; I) [Netscape]">
   <TITLE>R&auml;tsel um Wurml&ouml;cher (Teil 6)</TITLE>
</HEAD>
<BODY TEXT="#000000" BACKGROUND="stein.gif">

<CENTER>
<H1>
<FONT COLOR="#CC0000"><FONT SIZE=+1>Hallo Astrophysikinteressierte!</FONT></FONT></H1></CENTER>

<CENTER><FONT COLOR="#CC0000"><FONT SIZE=+1>Wie ihr vielleicht schon bemerkt
habt, ist bei meiner Wurmloch-Reihe ein kleiner Fehler passiert. In der
Ausgabe Nr. 53 der NC konnte man bereits den 7. Teil lesen, obwohl der
6. noch nicht erschienen war. Dieses kleine Missgeschick b&uuml;gele ich
hiermit wieder glatt. Hier nun der fehlende 6. Teil.</FONT></FONT></CENTER>

<CENTER>
<H1>
<U><FONT SIZE=+1></FONT></U></H1></CENTER>

<CENTER>
<H1>
<U><FONT SIZE=+1>R&auml;tsel um Wurml&ouml;cher (Teil VI)</FONT></U></H1></CENTER>

<HR><FONT SIZE=+1><B>Wurml&ouml;cher aus exotischer Materie</B></FONT>

<P><FONT SIZE=+1>Thorne postulierte eine "exotische" Materie, aus der Wurml&ouml;cher
bestehen m&uuml;&szlig;ten, die er dann Carl zu Ehren "Sagan-Wurml&ouml;cher"
taufte. Dieser mysteri&ouml;se Stoff hat unvorstellbare Eigenschaften:
Nicht Anziehungs- sondern Absto&szlig;ungskr&auml;fte gehen von ihm aus.
Seine Energie und somit auch seine Masse ist negativ. Das bedeutet, da&szlig;
bei einem Wesen aus exotischer Materie die Personenwaage "Minus" Kilogramm
anzeigen w&uuml;rde. Wohlgemerkt, es handelt sich hier nicht um Antimaterie,
wie sie ja inzwischen im Labor erzeugt werden kann, sondern um Materie
aus negativer Energie. Da&szlig; sie theoretisch m&ouml;glich ist, haben
zumindest die Quantenphysiker vorhergesagt.
<HR>Bereits 1948 hat dazu der Niederl&auml;nder Hendrik Casimir ein grundlegendes
Experiment vorgeschlagen: zwei ungeladene Metallplatten, die sich im Vakuum
gegen&uuml;berstehen, &uuml;ben Kr&auml;fte aufeinander aus, die durch
quantenphysikalische Effekte erzeugt werden. Grund: kurzzeitige elektromagnetische
Fluktuationen erzeugen Teilchenpaare, die ihre Entstehungs-Energie quasi
aus dem Vakuum "ausleihen". Da die Gesamtenergie im Vakuum Null ist, m&uuml;ssen
sich positive und negative Energie der beiden Teilchen gerade aufheben.
<HR>Dieser Proze&szlig; findet &uuml;berall statt, jedoch zwischen zwei
Metallplatten kommt eine Besonderheit hinzu: nur bestimmte Teilchenenergien
sind hier erlaubt, und zwar solche, deren entsprechende Wellenl&auml;ngen
genau zwischen die beiden Platten passen. Merke: die Quantenphysiker schreiben
aufgrund des Teilchen-Wellen-Dualismus jeglicher Materie auch eine Wellenl&auml;nge
zu. Alle Teilchen mit unpassenden Wellenl&auml;ngen werden aus dem Raum
zwischen den Metallplatten hinausgedr&auml;ngt. Der Casimir-Effekt besagt
nun, da&szlig; dadurch in diesem Gebiet immer weniger Teilchen sind als
im restlichen Vakuum.
<HR>Es entsteht also ein Teilchen-Unterdruck, und die beiden Platten driften
leicht aufeinander zu. Inzwischen konnte der Casimir-Effekt im Labortest
bewiesen werden. Dieser Proze&szlig; ist nun der Schl&uuml;ssel f&uuml;r
die Gewinnung von exotischer Materie, allerdings mu&szlig; dazu ein Vakuum
gefunden werden, bei dem die Gesamtenergie nicht Null ist, sondern im negativen
Bereich liegt.&nbsp;
<HR><B>In der n&auml;chsten NoCover geht es dann weiter mit dem "Bau der
galaktischen Wurmloch-Metro"</B></FONT><B><FONT SIZE=+1></FONT></B>

<P><FONT COLOR="#CC0000"><FONT SIZE=+1><B><I>Anmerkung:</I></B> Diesen
o.g. 7. Teil konntet ihr bereits in der NC 53 lesen. Weiter geht es ab
nun wieder in der richtigen Reihenfolge, und zwar mit dem nun 8. Teil "STAR
TREK ist unabh&auml;ngig von der 'Wurmloch- Metro' ". Viel Spa&szlig; beim
Lesen!</FONT></FONT>
<BR><FONT SIZE=+1>&nbsp;</FONT>
<CENTER><B><FONT SIZE=+1>Bis dann, Euer</FONT></B></CENTER>

<CENTER><A HREF="mailto:LarsPh@cityweb.de"><IMG SRC="lph.jpg" HEIGHT=70 WIDTH=135></A></CENTER>

</BODY>
</HTML>
