<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 1 / 2001</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>

<p><center><h1><font color="green">Amiga Plus CD 1 / 2001</Font></center></h1></P>
<p>Die Amiga Plus CD Reihe erscheint nat&#252;rlich auch im Jahre 2001 p&#252;nktlich alle 2 Monate. Extra f&#252;r die NoCover habe ich mir mal die Ausgabe 1 / 2001 n&#228;her angeschaut und werde meine Impressionen sowie die eine oder andere Info extra f&#252;r Euch hier niederschreiben.</P>

<p><center><h1><font color="yellow">Changes</Font></center></h1></P>
<p>Schon beim einlegen der CD merkt man, da&#223; sich bei der Amiga Plus CD offensichtlich etwas ge&#228;ndert hat, denn es erscheinen pl&#246;tzlich zwei Icons auf der Workbench: Eines f&#252;r die Amiga Plus CD und eines f&#252;r die Amiga Future. Der Amiga Plus Teil ist nat&#252;rlich genauso gestaltet wie ihn treue K&#228;ufer im letzten Jahr kennen &amp; sch&#228;tzen gelernt haben, wobei sich auch hier einige Neuerungen eingeschlichen haben, auf die ich weiter unten eingehen werde. Beim Amiga Future Teil handelt es sich lediglich um einen kleinen Auszug von der regul&#228;ren Leser CD, die man zusammen mit der Amiga Future direkt beim APC &amp; TCP bestellen kann. Im Amiga Future Teil findet man u.a. Demoversionen zu &quot;Earth 2140&quot;, &quot;Fubar&quot;, &quot;Secret Of My Soul&quot;, &quot;Shadow Of Time&quot;, &quot;Ermentrud&quot; sowie diverse MPEG Trailer. Nat&#252;rlich d&#252;rfen auch die obligatorischen PD Games nicht fehlen, so da&#223; gelegentliche Zocker hier sicherlich das eine oder 
andere finden werden. Spielefreaks besitzen ohnehin ein Abo der Future samt CD....
Aber kommen wir zum Amiga Plus Teil, der sich in den letzten 12 Monaten beachtlich entwickelt hat - Gl&#252;ckwunsch Markus, auch wenn Dir jetzt nur noch 2/3 der CD zur Verf&#252;gung stehen (der Rest geht f&#252;r den oben erw&#228;hnten Future Teil drauf). Ge&#228;ndert hat sich aber auch hier etwas: Um den lieben K&#228;ufern noch mehr zu bieten, befindet sich auf der 1 / 2001 CD ein neuer Ordner mit &quot;System Toolz&quot;, in dem sich logischerweise Tools befinden, die eigentlich auf jedem System installiert sein sollten - egal ob Packer, das GUI System MUI oder RTG, hier ist alles vorhanden, so da&#223; man auf die schnelle die wichtigsten Tools zusammen hat, falls durch einen bl&#246;den Zufall z.B. mal die Platte formatiert werden muss (kommt beim Amiga nat&#252;rlich nicht so h&#228;ufig wie beim PeeZeeh vor :-)) Ach ja: Wer eine wirklich komplette CD mit allen wichtigen Tools sucht, der sei auf die &quot;Digital Make Up&quot; CD aus dem Hause APC &amp; TCP verwiesen.</P>

<p><center><h1><font color="white">Und sonst?</Font></center></h1></P>
<p>Der restliche Inhalt hat es nat&#252;rlich auch in sich, wenngleich der Tools Ordner mit seinen zig-Unterordnern in dieser Ausgabe etwas schwach ausgefallen ist, was sicherlich auch an der geringen Anzahl an Uploads in den letzten Wochen lag. Aber gehen wir chronologisch vor:</P>

<p><h2><B>Scene</H2></B></P>

<p><u>Mags:</U><BR>
<p>Hier hat es nur das Szene Mag &quot;Frozen 37&quot; hin verschlagen...</P>

<p><u>Events:</U><BR>
<p>Neben Demos von der &quot;Spoletium 3&quot; gibt`s hier auch einige MPEG Videos von &amp; mit Bill McEwen sowie zahlreiche Bilder von der &quot;World Of Amiga 2000&quot; aus K&#246;ln. Leider bin ich mal wieder nirgendswo abgelichtet worden :-((((</P>

<p><h2><B>Multimedia</H2></B></P>

<p><u>GFX:</U><BR>
<p>Glow Icons kennt ja jeder, aber hier gibt`s ein Iconset, das elektrisiert - statt des Glow Effekts bietet dieses Sets
elektrische Effekte und wird bestimmt seine Liebhaber finden. Zus&#228;tzlich finden sich hier noch einige Themes f&#252;r DirOpus.</P>

<p><u>Sound:</U><BR>
<p>Hier gibt`s einen wirklich interessanten Mitschnitt einer Radiosendung, in der es um den Amiga ging. Gute Qualit&#228;t, guter Inhalt und alles in MP3. Sollte man zumindest mal geh&#246;rt haben.</P>

<p><u>Homepages:</U><BR>
<p>Mit diesem Ordner gleicht Markus Castro die fehlenden Tools aus, in dem er uns die Homepages von &quot;Nemac IV&quot; (na ja, ich w&#252;rde mich ja eher auf den Real Audio / Shockwave Bereich konzentrieren und versuchen da was zu bewegen, als mit NemacIV, Thorty!), &quot;Airsoft Software&quot; (von Andreas Falkenhahn - gute Page), &quot;Funtime World&quot; (tolle Newsseite, die eine ernsthafte Konkurrenz zu Amiga News.de ist und mit vielen weiteren interessanten Rubriken lockt - jetzt gibt`s sogar ein Versandgesch&#228;ft), &quot;Karikaturen&quot; (nur die Karikaturen von Thorsten Dudai) sowie meinen pers&#246;nlichen Favoriten &quot;No Risc - No Fun&quot; pr&#228;sentiert - letzteres ist eine tolle Page mit interessanten Interviews, Umfragen, einen gro&#223;en Spiele- und Anwendungsbereich sowie viele weitere interessante Dinge rund um den Amiga gibt. Sollte jeder Amiga User mit Netz Anschluss sich unbedingt mal angucken - ich wette ihr werdet die Page sofort
in die Bookmarks mit aufnehmen wollen. </P>  

<p><h2><B>Misc</H2></B></P>

<p><u>Mags:</U><BR>
<p>Unsere allseits beliebte NoCover ist in den Ausgaben 80 &amp; 81 genauso vertreten wie das neu organisierte &quot;Star Mag&quot;, welches nunmehr unter der Leitung von Bernhard Murmann steht und Eure Aufmerksamkeit genauso verdient wie das neue Magazin &quot;Fireball&quot; (von dem die ersten drei Ausgaben auf dieser CD zu finden sind) und die &quot;Amiga Aktuell&quot;.</P>

<p><u>Data:</U><BR>
<p>Hier gibt`s zwei Guides zu &quot;Buffy&quot; - einmal in AmigaGuide und einmal in HTML. Fans der Serie k&#246;nnen diese Guide bestimmt sinnvoll einsetzen, alle anderen (vor allem m&#228;nnliche...) k&#246;nnen zumindest mal einen Blick riskieren.</P>

<p>Wie mitlerweile &#252;blich, sei an dieser Stelle ein Verweis auf die zus&#228;tzlichen &quot;Tools&quot; und &quot;PowerPC&quot; Ordner gestattet, die mit insgesamt gut 110 MB einen keinesfalls geringen Anteil am Gesamtvolumen der AmigaPLus CD haben. Hier gibt`s wie &#252;blich aktuelle Software, Updates und viele weitere interessante Dinge, die ihr am besten selber rausfindet.</P><p><center><img src="ap1.jpg"></center></P><br>

<p><center><h1><font color="white">Lohnt es sich?</Font></center></h1></P>
<p>Tja, durch den Amiga Future Sonderteil muss diese Frage sicherlich neu beantwortet werden, da dadurch zwangsweise weniger Platz f&#252;r den Amiga Plus Teil &#252;brig bleibt. Trotzdem halte ich diese Entscheidung f&#252;r gut, denn so gut wie jeder User wird wohl auch das eine oder andere Spiel auf der Platte haben und es insofern begr&#252;&#223;en, durch die Amiga Plus CD auch auf dem Spielesektor so halbwegs auf dem neuen Stand zu bleiben. Und solange die Mischung so gut bleibt, wie auf der ersten CD des neuen Jahres, kann wohl keiner meckern. Ich jedenfalls bin &#252;berrascht, da&#223; die (neue) Amiga Plus CD auch nach einem Jahr nichts von ihren hochgesteckten Zielen verloren hat und sich so gut entwickelt hat. 19.80 sind auf jeden Fall gerechtfertigt, zumal man auch noch einige gedruckte Seiten mit Spieleteste kostenlos dazubekommt.</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
