<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>CD Test: Aminet Games CD</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><center><h1><font color="green">Aminet Games CD</font></h1></P>
<p><img src="agcd.jpg"></P><BR></center>
<p>Das Aminet mit all seinen wunderbaren Vorz&#252;gen d&#252;rfte wohl jedem ein Begriff sein - es d&#252;rfte wohl keinen Amiga User geben, der nicht zumindest die eine oder andere Aminet CD zu Hause stehen hat (die der Wolf Zimmer bisher immer so toll vorgestellt hat). Vor einigen Monaten, um genauer zu sein Anfang September 2000, ist mit der <b>Aminet Games</B> eine erste Spezial CD bei Stefan Ossowski`s Schatztruhe erschienen, die an sich selbst den Anspruch erhebt, die besten Spiele aus dem Aminet auf sich zu verinigen. Ob sich die Aminet Games lohnt oder nicht, soll nun dieser Test zeigen.</P>


<p><center><h2><font color="yellow">Gute CD oder nur Aufguss alter Kamellen?</font></center></h2></P>
<p>Um die Aminet Games CD dem potentiellen Kunden ein wenig schmackhaft zu machen, hat man einige Vollversionen als kostenlose Zugabe draufgepackt. Dies sind im einzelnen:</P>

<p><b>Max Ralley:</B><BR>
Dieses Autorennspiel, welches nebenbei erw&#228;hnt auch schon auf der Aminet CD 36 und dem Aminet Set 10 (gute Compilation by the way) zu finden war, ist zwar grafisch nicht mehr auf dem neuesten Stand, kann aber dennoch begeistern und f&#252;r einige vergn&#252;gliche Stunden vor dem Rechner sorgen. Gespielt wird Max Ralley aus der Sicht von oben auf die Atutos drauf (a la &quot;Super Cars&quot;) und macht nach einer kurzen Eingew&#246;hnungsphase wirklich h&#246;llischen Spa&#223;, auch wenn die Technik im Jahre 2001 nicht mehr ganz so aktuell ist...</P>

<p><b>XTreme Racing:</B><BR>
Fans von Autorennspielen k&#246;nnen sich &#252;ber einen weiteren, echt guten Vertreter dieses Genres freuen, der eigentlich vielen bekannt sein sollte. Auch dieses Game wurde schonmal auf einer &#228;lteren Aminet CD verbraten (muss irgendetwas im 20er Bereich gewesen sein), ist aber deswegen immer noch nicht schlecht oder Ausschussware, die um jeden Preis unter`s Amiga Volk gebracht werden muss. Ganz im Gegenteil: XTreme Racing ist ein wirkliches Highlight und hat sich in der Vergangenheit bei vielen Usern hoher Beliebtheit erfreut, was sich nicht zuletzt dadurch best&#228;tigen l&#228;sst, da&#223; es im Aminet viele Add-on`s (neue Strecken, Autos etc.) f&#252;r eben dieses Spiel gibt. Unn&#246;tig zu erw&#228;hnen, da&#223; das Game auch heute noch einen hohen Suchtfaktor zu offerieren hat.</P>

<p><b>Gloom 3:</B><BR>
&#220;ber diesen hundsmiserabelen 3D Shooter noch Worte zu verlieren, wollte ich mir eigentlich beim Schreiben dieses Test`s klemmen. Das ich es trotzdem mache liegt aber nicht etwa an der Qualit&#228;t des Games, sondern vielmehr daran, da&#223; diese Vollversion niemanden zum Kauf animieren sollte. Das Game ist 
grafisch eine absolute Zumutung (selbst ein 5-j&#228;hriger h&#228;tte das auf dem Brotkasten besser hingekriegt) und hat noch nichtmal PD Niveau - das jemand es wagt, so einen Schrott kommerziell zu vermarkten kann nur daran liegen, da&#223; die entsprechende Firma Gloom 3 nicht einmal selber gespielt hat (ansonsten h&#228;tten die das Teil sofort aus dem Verkehr gezogen und den entsprechenden Programmierer &amp; Grafiker nach Sibirien verbannt)...</P>

<p><b>Gamers Delight 2:</B><BR>
Erinnert sich noch wer an diese (damals ziemlich gelungene) Compilation (erschienen `95)? Auf dieser befanden sich viele PD Games sowie 70 kommerzielle Low Price Games. Eben diese kommerziellen Games hat man nun &#252;bernommen, auch wenn diese technisch l&#228;ngst veraltet sind und von der Qualit&#228;t eher an 
die Standard Aminet Games, denn an kommerzielle Highlights erinnern. Macht aber nichts, denn eine nette Zugabe sind diese spiele auf jeden Fall und wenn man sich die M&#252;he macht, jedes Spiel zu testen, wird man bestimmt die eine oder andere Perle finden, die den pers&#246;nlichen Geschmack trifft. Den stilistisch sind diese Games recht weit gefechert - egal ob es nun eine Runde &quot;Mau Mau&quot; oder &quot;Poker&quot; sein soll oder man lieber eine actiongeladene Runde Galaga vorzieht.</P>

<p>Die CD ist mit 650 MB bis zum Anschlag gef&#252;llt und enth&#228;lt (lt. eigener Aussage) 1527 Shareware Games - entpackt ergibt das immerhin die stolze Summe von rund 870 MB. Die Spiele sind, wie man es auch von den normalen Aminet CD`s gewohnt ist, nat&#252;rlich wieder nach verschiedenen Kategorien sortiert und auch hier ist erneut f&#252;r jeden Geschmack etwas vertreten. Von dieser Masse an Spielen welche hervorzuheben, finde ich unpassend und werde es an dieser Stelle auch nicht tun. Hinweisen m&#246;chte ich lediglich auf das Verzeichniss &quot;Demo&quot;, in dem sich eine Unmenge an Demoversionen tummeln und da man hier keinen Wert auf Aktualit&#228;t gelegt hat, lassen sich hier auch eine Klassiker als Demoversion bestaunen. Wer also Lust auf eine Reise in die Vergangenheit des Amigas (zumindest ab `94) hat, der sollte hier unbedingt mal einen blick hinein riskieren.</P>

<p><h1><center><font color="red">An wen richtet die CD sich denn?</font></center></h1></P>
Um diese Frage zu beantworten muss man erstmal wissen, da&#223; sich auf der Aminet Games CD keinerlei exclusives Material befindet. Das bedeutet, da&#223; User, die sich regelm&#228;&#223;ig die Einzel CD`s und / oder Set`s besorgen, diese CD indirekt schon zu Hause im Schrank stehen haben. Allerdings ist es mitunter 
doch recht umst&#228;ndlich alle Set`s und Einzel CD`s zur Hand zu haben, insbesondere wenn man auf der Suche nach einem bestimmten Spiel ist. In der Praxis macht sich da die Aminet Games CD mehr als nur n&#252;tzlich, vereint sie doch die besten Spiele auf sich, die man bequem suchen kann, ohne (!) die CD tausendmal wechseln zu m&#252;ssen. Wer also gerne mal eine Runde spielt (auch wenn er im Besitz aller Aminet CD`s ist), sollte diese CD, die mit 29.90 DM zu Buche schl&#228;gt, nicht links liegen lassen - und sei es nur der Bequemlichkeit halber...</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
