<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Codename: Hell Squad</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><center><h1><font color="green">Codename: Hell Squad</font></center></h1></P>
<p>Auch wenn der Amiga Spielemarkt schon l&#228;ngst nicht mehr mit dem des PC`s oder der Konsolen mithalten kann - Lichtblicke gibt es immer wieder. Im letzten Jahr ist ein Spiel namens &quot;Wasted Dreams&quot; erschienen, welches trotz der einfachen Grafik &#252;berall Bestnoten erhielt und somit zu einem &#220;berraschungshit wurde - nat&#252;rlich war schnell ein Nachfolger namens &quot;Wasted Dreams 2&quot; geplant, aber bevor dieser erscheint, schiebt das Entwicklerteam Digital Dreams Entertainment noch ein weiteres Game namens &quot;Codename: Hell Squad&quot; dazwischen. Ob es an die Klasse von &quot;Wasted Dreams&quot; herankommt oder dieses gar &#252;bertrifft, wird sich jetzt herausstellen m&#252;ssen.</P>

<p><center><h1><font color="yellow">In The Beginning...</font></center></h1></P>
<p>Ausgeliefert wird &quot;Codename: Hell Squad&quot; (im folgenden nur noch &quot;Hell Squad&quot;) nat&#252;rlich auf einer CD mit einem vierseitigem Booklett, in dem man alles wichtige &#252;ber das Spiel erf&#228;hrt. Wem diese Kurzanleitung noch zu kurz ist, der findet auf der CD noch eine Textdatei - allerdings, genau wie das gesamte Spiel, nur in Englisch. Wer also der englischen Sprache nicht m&#228;chtig ist, der sollte sein Gl&#252;ck erstmal mit der Demoversion probieren. Als kleinen Bonus hat man auf die CD noch eine Demoversion des Knallers &quot;Wasted Dreams&quot; gepackt, die man unbedingt mal angetestet haben sollte.
Installiert werden muss &quot;Hell Squad&quot; gl&#252;cklicherweise auch nicht, so da&#223; man das Game direkt von CD starten kann. Lediglich f&#252;r das Speichern sollte noch etwas Platz auf der Boot Partition frei sein. Bevor es in`s Spiel geht, sollte man sich unbedingt das gut gemachte Intro angucken, in dem der Story f&#252;r das eigentliche Spiel dargelegt wird - ein Raumschiff von einem weit entfernten Planeten startet in Richtung Erde. Dann folgt ein Wechsel zu einem P&#228;rchen, welches durch einen Wald l&#228;uft, dabei aber von einem Wesen beobachtet wird und pl&#246;tzlich, bedingt durch einen Strahl, verschwindet. Diese konfuse Story hat einen recht am&#252;santen Background: Ein au&#223;erirdisches Kind hat von seinen Eltern ein Raumschiff mit allerlei Equipment geschenkt bekommen und probiert dieses nun auf der Erde aus. Das FBI will nun wissen, was los ist und schickt eine Spezialtruppe namens &quot;Hell Squad&quot; los, um die Au&#223;eridischen zu finden und zu eleminieren... Dreimal 
darf geraten werden, wer diese Aufgabe nun &#252;bernehmen darf....</P>

<p>Zum Intro sei noch gesagt, da&#223; die Szenen, die im Wald spielen, nicht etwa gerendert wurden, sondern real gefilmt wurden, was eine beeindruckende Qualit&#228;t mit sich bringt. Das Intro sollte man sich als unbedingt mal angeguckt haben.  </P>

<p><center><h1><font color="red">Das Spiel</font></center></h1></P>
<p>Nach dem Intro, welches man nat&#252;rlich auch &#252;berspringen kann, so da&#223; man es sich nicht bei jedem Spielstart neu angucken muss (so gut es auch ist), gelangt man direkt in das Game und sp&#228;testens hier sind klare Anleihen an &quot;Wasted Dreams&quot; nicht mehr zu &#252;bersehen: Da &quot;Hell Squad&quot; auch auf 68000 Rechnern mit ECS Chipset l&#228;uft, ist die liebevoll gestaltete Grafik zwar nicht schlecht, aber auch alles andere als auf dem aktuellen Stand der Technik. Wenn man &quot;Hell Squad&quot; f&#252;r AGA / GraKa geschrieben h&#228;tte, w&#228;re grafisch sicherlich noch einiges mehr drin gewesen und sp&#228;testens im Jahre 2001 sollte man nun wirklich auf ECS Kompatibilit&#228;t verzichten - immerhin l&#228;uft das Spiel auf meiner Picasso IV einwandfrei und ich gehe mal davon aus, da&#223; all jene, die schon &quot;Wasted Dreams&quot; zum laufen gekriegt haben, auch &quot;Hell Squad&quot; auf ihrem heimischen amiga bewundern k&#252;nnen, da offensichtlich die selbe Game 
Engine benutzt wurde.</P>
<p><center><img src="hs1.jpg"></center></P>
Aber zur&#252;ck zum Spiel: Der Spieler steuert 4 Charakt&#228;re, die man mittels der F1-F4 Taste wechseln kann und die allesamt mit einem Maschinengewehr (mit unbegrenzter Munition!) sowie einem Rucksack ausgestattet sind. Unterschiede gibt es zwischen den vier Personen &#252;brigens keine - auch was das Inventar betrifft: Sammelt eine Person z.B. einen Stein ein, so ist dieser auch im Inventar aller anderen Figuren zu finden. Ist zwar etwas unlogisch, vermeidet aber einige unn&#246;tige Schwierigkeiten, falls z.B. ein Charakter vorzeitig das zeitliche segnet. Als Figur hat man, &#228;hnlich &quot;Wasted Dreams&quot;, die M&#246;glichkeiten, hin- und herzulaufen, zu schie&#223;en, Gegenst&#228;nde zu untersuchen, einzusammeln und nat&#252;rlich zu benutzen. Somit d&#252;rfte klar sein, da&#223; man in &quot;Hell Squad&quot; zahlreiche R&#228;tsel zu l&#246;sen hat und diese sind teilweise auch wirklich kniffelig. Aber keine Angst: Wer auf knallharte Action steht, der kommt bei &quot;Hell Squad&quot; auch 
keineswegs zu kurz, da sich feindliche Ausserirdische zu Hauf finden und diese, ohne Diplomatie, kalt &#252;ber den Haufen geschossen werden m&#252;ssen. Sein MG sollte der geneigte Spieler also immer im Anschlag haben. Dieses Mix aus Adventure und Action Elementen (wobei letztere im Vergleich zu &quot;Wasted Dreams&quot; etwas in den Vordergrund ger&#252;ckt sind) wird durch viele lustige Spr&#252;che und Kommentare von seiten der Figuren weiter aufgelockert und sorgt f&#252;r den einen oder anderen Lacher beim Spieler - hier sind fast schon Anleihen an alte Lucasfilm Adventures wie etwa &quot;Indiana Jones&quot; oder &quot;Monkey Island&quot; in Sachen Humor auszumachen (auch einigen Anspielungen auf Microsoft und den Amiga haben sich in das Spiel eingeschlichen). Diese tolle Mischung vermag auf Anhieb zu &#252;berzeugen und auch die etwas altbackene Technik kann den Spielspa&#223;, der sp&#228;testens nach dem L&#246;sen der ersten einfachen R&#228;tsel auftritt, keinen Abbruch mehr tun. So begegnet man 
im weiteren Verlauf auch noch einigen Charakt&#228;ren, die 
uns nicht feindliche gesinnt sind und mit denen man sogar sprechen kann. Leider laufen diese, ebenfalls recht am&#252;santen Dialoge, automatisch ab, so da&#223; man keinerlei M&#246;glichkeit hat, einzugreifen. Der Vorteil daran ist nat&#252;rlich, da&#223; man sich nicht, wie etwa bei den alten Lucasfilm Adventures, verzetteln kann.</P>    

<p>Gesteuert wird das komplette Spiel wahlweise per Tastatur oder per Joystick, wobei ich f&#252;r gr&#246;&#223;t m&#246;glichen Spielspa&#223; eigentlich einen Joystick empfehlen w&#252;rde - zwar kommt man auch mit der Tastatur auch gut zurecht, aber insbesondere bei den Action Sequenzen ist ein kurzer Druck auf die Feuertaste und der schnelle Weg aus dem Screen allemal einfacher, als die Tastatur. Aber f&#252;r beide Steurungsarten gilt: Nachdem man sich kurz eingew&#252;nt hat, l&#228;uft die Steuerung praktisch ohne Probleme von der Hand. Ohne Probleme laufen auch die Animationen der einzelnen Charakt&#228;re, die butterweich und absolut fl&#252;ssig, selbst auf ECS Rechnern, ablaufen. Das Problem dabei ist nur, da&#223; die ECS Kompatibilit&#228;t auch hier wieder seinen Tribut fordert und die Animationen teilweise etwas grobpixelig aussehen l&#228;sst - selbiges gilt auch f&#252;r die Zwischensequenzen und die Locations. Der Sound ist als zwecksm&#228;&#223;ig zu bezeichnen, bietet nicht viel neues, 
nervt daf&#252;r auf die Dauer aber nicht - wer einen CD Player neben seinem Amiga stehen hat, der sollte ruhig eine normale Audio CD einlegen; verpassen tut man soundm&#228;&#223;ig eh nichts. An dieser Stelle sei mal wieder ein Vergleich mit &quot;Wasted Dreams&quot; erlaubt: Wer das Spiel kennt, der wei&#223; auf was er sich grafisch und soundm&#228;&#223;ig bei &quot;Hell Squad&quot; einstellen darf.</P>

<p><center><h1><font color="white">Fazit</font></center></h1></P>
<p>Trotz M&#228;ngel im technischen Bereich (Grafik), macht &quot;Hell Squad&quot; tierischen Spa&#223; und vermochte mich von der ersten Sekunde an zu &#252;berzeugen - die richtige Mischung aus Action, R&#228;tseln (die immer nachvollziehbar sind und nicht in nicht zu &#252;berwindenen Schwierigkeiten enden) und einer gro&#223;en Portion Humor sorgt f&#252;r langanhaltene Spielmotivation und jeder Menge Spielspa&#223;. Ich jedenfalls kann &quot;Hell Squad&quot; allen, die auf diese Mischung stehen, nur empfehlen - wer schon &quot;Wasted Dreams&quot; mochte, der muss hier sowieso zugreifen. &quot;Hell Squad&quot; ist aus meiner Sicht wieder ein unerwarteter Hit, der den Verkaufspreis von 89 DM auf jeden Fall wert ist.</P><center><br>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>diverse Amiga Firmen</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>ca.89 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Action Adventure</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>413</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE>

<BR></P>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
