<HTML>
<HEAD>
<TITLE>Leserbrief von Charly</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.jpg" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000" BGCOLOR="#FFFFF4">
<a name="top"></a><br>
<center><font color="#000080" size="4">
<b> Charly &acute;s Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>an Andreas Magerl</a></b></li>
<li><a href="#a2"><b>an Martin Voepel</a></b></li>
</ul>
<table width=100% border=0 cellpadding=6><tr><td>

<P>
Hallo Leserin, Hallo Leser,<br>
</p><p>
der Monat Januar war wie immer f&uuml;r mich total daneben. Zu nichts
hatte ich richtig Lust. Und mein Amiga hat mir auch keine Freude
bereitet.
</p><p>
Nun hatte ich mir im Dezember einen 17" Monitor gekauft und es
machte damit, erstmal &uuml;berhaupt keinen Spa&szlig;. ;(( Einige Programme
und auch Bilder verlangten eine Horizontal-Aufl&ouml;sung von 30 KHz,
die der Monitor nicht kann. ;( Durch die Tasten lAmiga und M konnte
einiges auf hinteren Screens hervorgezaubert werden, aber das ist
nicht besonders sch&ouml;n, wenn man erst immer Tasten dr&uuml;cken muss.
Es fehlt mir wohl eine Grafik-Karte! Und so ein Teil wird zwischen
500 und 1000 DM kosten. Das kann es nicht sein.
</p><p>
Im AmigaAktuell habe ich einen Bericht von Denis Nicolic gelesen.
Er schrieb &uuml;ber die Software-CD <b>AmigaForever</b>. Und nun bin
ich zu den Entschluss gekommen mir einen PC zu kaufen und auch
<b>AmigaForever</b>. Es ist ja leider so, da&szlig; z.b. Amiga-Browser
nicht alles im InterNET k&ouml;nnen. BilderFormate sind TRUE-Color mit
16 Millionen Farben... Amiga und PC sind nur durch &auml;nderungen
Kompatible. Und externe Hardware wird auch immer
mehr &uuml;ber den USB-Port angeschlossen. Dann habe ich zwei Systeme im
Rechner und kann entscheiden, welches Programm auf welchem System
f&uuml;r mich besser ist.
</p><p>
Alles Gute...<br>
Charly<br>
</p><p>
</p>
<hr>
<a name="a1"><p><br>
<h3>Hallo Andreas,</h3>
<p>
ein grosses Lob f&uuml;r Deine Layout-Gestaltung. Sieht prima aus,
und Du hast ja auch noch weitere &auml;nderungen angek&uuml;ndigt. Bei
mir ist ein Multiscan Productivity 640 x 480 Screen eingestellt und
bei den Rubriken links, denke ich, k&ouml;nnte vielleicht z.b. bei
Diskussionen ein kleinerer Font eingestellt werden, denn
irgendwie springt die Rubrik aus der Reihe.<br>
BTW. Braucht man die Rubrik noch?
</p><p>
Wer jetzt nun f&uuml;r das Layout der Rubrik <b>Mitglieder</b> zust&aaul;ndig ist
weiss ich nicht, aber ich w&uuml;rde es begr&uuml;&szlig;en, wenn dort auch die Links
farblich hervorgehoben w&uuml;rden. Zur Zeit hat <b>Link VLink ALink</b>
die gleiche Farbe. Ist das so gew&uuml;nscht?
</p><p>
Vor ein paar Ausgaben hatte immer der Schreiber mit den meisten
Artikeln eine CD oder was bekommen. Warum, weiss ich nicht, aber
das hast Du wohl abgeschafft. Schade eigentlich. Ich denke, man
sollte die Richtlinien mal &uuml;berarbeiten und einen Anreiz schaffen,
das mehr Leute was schreiben.
</p><p>
Sch&ouml;ne Gr&uuml;&szlig;e aus Hannover von<br>
<br>
<H3><i> Charly </i></H3>
</p>
<a href="#top">zum Anfang</a>
<p>
<hr><br>
<a name="a2"><p><br>
<h3>Hallo Martin,</h3>
<p>
oh, da hast Du mich ja kalt erwischt. :) Bei der Gr&ouml;&szlig;enangabe
meines Bildes. Habe ich doch einen Fehler gemacht. :) Wahrscheinlich
habe ich aber als ich die Gr&ouml;&szlig;e eingab, statt 150 - 105 geschrieben.
Ein katastrophaler Fehler! Da werde ich sofort das Bild durch eine
neue UserDatei entfernen. Und ein neues Bild von meiner lieben Frau
und mir einf&uuml;gen.
</p><p>
Der Tip von Dir mit Fat95 war gut. Habe damit ein SyQuest-Medium formatiert.
Funktioniert wunderbar.

</p><p>

Alles Gute...<br>
<H3><i> Charly </i></H3> <br>
</p>
<a href="#top">zum Anfang</a>
<br>
<hr><br>
<center>
<table border="6" width=95%><tr><td>
<center>
Autor:  &nbsp; &nbsp; <a href="Mitglieder/bader.html">Karl-Heinz Bader</a>&nbsp; &nbsp;
E-Mail: <a href="mailto:charly-ham@t-online.de"> charly-ham@t-online.de</a> <br>
</center>
</td></tr></table></center>
<br>
<p>
</font>
</BODY>
</HTML>
