<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=red>
<table width=95%>
<p><center><h1><font color="green">Leserbrief von Kilian "The Bruce" Servais</font></center></h1></P>

<p><a href="#yonder.html">An Yonder</A><br>
<a href="#top.html">Top 5</A></P>
<hr>
<a name="yonder.html">
<b>Hi Yonder!</B><BR>
Alles gute hat wohl ein Ende und so ist es zwar schade, da&#223; es keinen weiteren Harald Schmidt Workshop geben wird, aber 15 Teile sind ja auch trotzdem recht viel. </P>

<p>Na ja, also das ich gar nicht mehr f&#252;r die NC schreibe habe ich niemals so gesagt oder ich habe mich falsch ausgedr&#252;ckt. Momentan bin ich halt nicht mit &#252;berm&#228;&#223;ig viel Zeit gesegnet und da ich neben der NC auch noch an der Fireball mitarbeite und irgendwie auch die Hompage unserer Radio Sendung auf dem laufenden halten muss (nicht zu vergessen den ganzen anderen Papierkram, den eine Radiosendung so mit sich bringt), bleibt f&#252;r die NC halt nur noch ein Bruchteil meiner Freizeit &#252;brig. Die Metal Corner wird aber auf jeden Fall weiterhin erscheinen - sofern niemand was dagegen hat - und auch den einen oder anderen 
Test werde ich noch schreiben. Falls der Markus mir weiterhin die Amiga+ CD zuschickt, komme ich um einen entsprechenden Artikel gar nicht herum. Lange Rede, kurzer Sinn: Ich habe gerade mein Abo verl&#228;ngert und werde auch 2001 weiterhin am Ball - sowohl Amiga als auch NC - bleiben.

<p>Yup, ich habe schon verstanden das das Clubtreffen 1999 offensichtlich besser war, aber weil ich vielleicht nicht so eine gro&#223;e Erwartungshaltung hatte, hat es mir auch 2000 gefallen. Die &#220;bernachtung war doch ganz witzig, oder? Und auch der sonstige Rahmen hat mir super gefallen. Okay, da&#223; bei den 
Wettbewerben nur wenige Leute mitgemacht haben ist zwar schade, kann aber keineswegs den Organisatoren angekreidet werden, zumal dieses Jahr alles unter schwierigeren Umst&#228;nden stattgefunden hat wie Daniel &amp; Sascha geschrieben haben. Mal schauen, was es 2001 so gibt...</P>

<p>Das Debutalbum von Edenbridge hat Dir gefallen? Coole Sache - ich glaube Du bist erst der dritte, der es mir auch mitgeteilt hat, da&#223; er sich ein Album aufgrund meines CD Tips zumindest mal angeh&#246;rt hat. Falls Dir Edenbridge wirklich so gut gefallen, solltest Du unbedingt das Nightwish Album &quot;Oceanborn&quot; mal antesten - auch wenn es nicht ganz das selbe ist (ist etwas h&#228;rter), k&#246;nnte (!) es Dir zumindest gefallen.</P>

<p>Sag mal, was ist das eigentlich f&#252;r eine komische neue E-Mail Addy (@woanders.de)? Ist das nur ein Scherz oder gibt es die Addy tats&#228;chlich? Wollte ich eigentlich schon das letzte mal fragen, habe es dann aber doch irgendwie wieder vergessen.</P>

<p>Toll finde ich auch, da&#223; Du mit Deinen regelm&#228;&#223;igen Rubriken wieder in der NC dabei bist. Ich hoffe, da&#223; es auch in Zukunft so bleibt, zumal ja auch der Andreas die Zeichen der Zeit erkannt hat und der NC eine optische Frischzellenkur unterzogen hat - fehlen eigentlich nur noch einige Artikel mehr. 
Aber auch dieses Problem werden wir wohl irgendwann mal in den Griff kriegen, falls alle an einem Strang ziehen und auch die passiven Mitglieder etwas von sich h&#246;ren lassen.</P>

<p>So, mach`s f&#252;r`s erste mal gut!</P>
<hr>
<a name="top.html">
<p><center><h1><font color="yellow">Top 5:</font></center></h1></P>

<p>1. Brimestone Story von Rainer &quot;The Machine&quot; Thiecke<br>
2. Wolf Info von Wolf<br>
3. Web Plug Workshop von Martin Voepel<br>
4. Treffen 2000 von Sascha<br>
5. Simon The Sorcerer II von Andreas Guldener</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
