<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<center>
							<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/thoriel.jpg" width="200" height="212" alt="Anu" border="1"><br>
									V&auml;sy. Siisp&auml; hetkeksi levolle.</font></i></center>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ajattelin ensin laittaa p&auml;&auml;kirjoitukseksi televisiokanavien ohjelmapolitiikkaa my&ouml;t&auml;illen koko edellisen numeroni p&auml;&auml;kirjoituksen sellaisenaan, varustettuna maininnalla &quot;ohjelma on uusinta viime numerosta&quot;, sill&auml; sen verran hyvin se sopisi t&auml;m&auml;nkin Sakun julkaisutaistelun alkutahdeiksi. Tarkempiin yksityiskohtiin menem&auml;tt&auml; lehden julkaisua viiv&auml;styttiv&auml;t sek&auml; henkil&ouml;kohtaiset ett&auml; toimitukselliset vastoink&auml;ymiset. Kun lehden varsinainen kasaaminen on k&auml;yt&auml;nn&ouml;ss&auml; parin ihmisen harteilla ja muutkin lehden eteen ty&ouml;t&auml; tekev&auml;t joutuvat omassa el&auml;m&auml;ss&auml;&auml;n yll&auml;tt&auml;viin tilanteisiin, on valitettavasti vapaa-aika se joka t&auml;st&auml; kaikesta eniten k&auml;rsii. Vapaa-ajallamme mekin Sakua teemme, mutta se ei tarkoita sit&auml;, ett&auml; suhtautuisimme lehteemme mitenk&auml;&auml;n harrastelijamaisesti. Ei suinkaan; lehden julkaisun siirt&auml;minen on aina yht&auml; ik&auml;v&auml;&auml; ja ep&auml;miellytt&auml;v&auml;&auml;, mutta tosiasioille mek&auml;&auml;n emme mit&auml;&auml;n voi:&nbsp;kun ei ehdi, niin ei ehdi.<br>
								<br>Keskener&auml;ist&auml; tai sis&auml;ll&ouml;lt&auml;&auml;n vajavaista lehte&auml; emme suurin surminkaan halua julkaista, mutta joskus pieni&auml; my&ouml;nnytyksi&auml; on pakko tehd&auml;. T&auml;m&auml;n lehden uutispalsta k&auml;rsi varsinkin ohjelmistouutisten osalta niin, ett&auml; p&auml;ivityspalsta oli pakko j&auml;tt&auml;&auml; resurssipulan vuoksi pois. Ehk&auml;p&auml; p&auml;ivityspalstalle l&ouml;ytyisi joku siihen omistautunut yll&auml;pit&auml;j&auml;? K&auml;yt&auml;nn&ouml;ss&auml;h&auml;n homma vaatisi vain tiivist&auml; Amiga-ohjelmistouutisten seuraamista, varsinkin kun ilmais- ja shareware-ohjelmista ilmestyy p&auml;ivityksi&auml; tuhkatihe&auml;&auml;n. Edellisen numeron my&ouml;t&auml; uutistoimittajan teht&auml;v&auml;st&auml; vet&auml;ytynyt Terho Henriksson uudisti Sakun uutisten ulkoasun ja hengen, nyt vain pit&auml;isi saada sille ty&ouml;lle jatkajia. Ty&ouml;hakemukset voi osoittaa allekirjoittaneelle.<br>
								<br>Takana on yhdistyksen kannalta uskomaton vuosi. Saku-keskustelufoorumin pystytys alkuvuodesta oli vain esin&auml;yt&ouml;s. Koko vuosi aina syyskuulle asti uurastettiin porukalla yht&auml; tavoitetta kohti:&nbsp;Saku 2001, kahden vuoden tauon j&auml;lkeen suurin ja kaunein Amiga-tapahtuma Suomessa - ja ainoa. Odotukset olivat korkealla ja tavoitteet asetettiin vastaavasti. Vaikka pieni&auml; takapakkeja tulikin, tapahtuma onnistui silti erinomaisesti. Kun viel&auml; syyskuun lopulle saatiin j&auml;rjestetty&auml; yhdistyksen historian ensimm&auml;inen tapaaminen p&auml;&auml;kaupunkiseudun ulkopuolella, vuosikokous 2001 Oulussa, oli yhdistysvuosi todella ty&ouml;nt&auml;yteinen ja tapahtumarikas.<br>
								<br>
								Mutta kaikella t&auml;ll&auml; on tietenkin my&ouml;s seurauksensa:&nbsp;vuoden vaihtuessa yhdistyksen puuhamiehill&auml; on hieman takki tyhj&auml;, ja samaa t&auml;ytyy valitettavasti sanoa my&ouml;s yhdistyksen tilist&auml;. Saku 2001:n ja vuosikokouksen j&auml;rjest&auml;minen s&ouml;i koko budjettimme, mutta seh&auml;n toimintamme ydin onkin:&nbsp;yleishy&ouml;dyllisen&auml; yhdistyksen&auml; k&auml;yt&auml;mme varojamme yhdistystoimintaan voittoa tuottamatta. Raskaat palvelumaksut kuitenkin veloittavat piskuista tili&auml;mme joka kuukausi, joten s&auml;&auml;nn&ouml;llisi&auml;kin tuloja pit&auml;isi saada. Asiasta p&ouml;yd&auml;njalkaan: mik&auml;li vuoden 2002 j&auml;senmaksu on maksamatta, voit hoitaa homman kuntoon seuraamalla <a href="http://batman.jypoly.fi/~saku/yhdistys/liittyminen.html" target="_blank">kotisivun ohjeita</a>.<br>
								<br>Kaiken t&auml;m&auml;n ry&ouml;pytyksen, taistelun ja voitokkaiden hetkien j&auml;lkeen olemme p&auml;&auml;tt&auml;neet pit&auml;&auml; pienen paussin lehden osalta. Tavoitteena on, ett&auml; ydinporukkamme saa vet&auml;&auml; hieman henke&auml; ja samalla hoitaa yhdistyksen muita asioita kuntoon. Mietimme my&ouml;s yhdistyksen kehitt&auml;mist&auml; ja uusia suuntia toimintaamme, mit&auml; kuvaa my&ouml;s t&auml;m&auml;n lehden kompassiaiheinen kansikuva. Luovimme toivottavasti kohti selvempi&auml; vesi&auml; ja my&ouml;t&auml;tuulessa.<br>
								<br>
								Saku-foorumin siirto on edess&auml; heti vuoden alkupuolella, joten muistakaapa k&auml;ytt&auml;&auml; foorumin lueskeluun osoitetta <a href="http://foorumi.amigafin.org" target="_blank">foorumi.amigafin.org</a>; se osoittaa aina oikeaan paikkaan riippumatta foorumin todellisesta sijainnista. Lis&auml;ksi tarkoituksena on saada kotisivutilaltamme isoimmat tiedostot, lehtipaketit ja muut m&ouml;hk&ouml;fantit siirretty&auml; toisaalle, jotta rajallinen tilamme ei loppuisi kesken. Mik&auml;li viel&auml; Patentti- ja rekisterihallituskin saisi vuoden vehdattuaan yhdistysrekisterimuutoksemme hyv&auml;ksytty&auml;, saisimme yhdistyksen tilin siirretty&auml; halvempaan pankkiin ja n&auml;in my&ouml;s raha-asioiden pohjat tulevaisuutta varten parempaan kuosiin.<br>
								<br>
								Palaamme siis lihapatojen &auml;&auml;reen j&auml;lleen kes&auml;kuun 9. p&auml;iv&auml;n&auml; Saku #39:n my&ouml;t&auml;. Silloin starttaa lehden kymmenes vuosikerta, ja luvassa on toivon mukaan runsaasti juttuja uusista Amiga-tuotteista (muistakaahan kirjoitella :-), koska  niiden osalta tuleva vuosi n&auml;ytt&auml;&auml; n&auml;in etuk&auml;teen katsottuna todella runsassatoiselta - ehk&auml;p&auml; yhdistyksell&auml;kin on jotain esitelt&auml;v&auml;&auml; mahdollisissa uusissa tapahtumissa ja tapaamisissa. Seuratkaa edelleen yhdistyksen kotisivua, sill&auml; siell&auml; tiedotamme ajankohtaisista asioista my&ouml;s lehden julkaisutauon aikana. Luvassa n&auml;ytt&auml;isi olevan antoisa Amiga-vuosi.<br>
								<br>
								Valossa nukkuen,<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu Seilonen</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>