<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Etusivu</title>
		<meta name="generator" content="Handmade in Finland">
		<meta name="keywords" content="http://saku.amigafin.org">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>P&auml;&auml;kirjoitus</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<br>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i><img src="kuvat/janne.jpg" width="200" height="186" alt="Janne" border="1"><br>
								</i></font></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;t&auml; kirjoittaessani Seikkailu 2001 ottaa viimeisi&auml; askeleitaan yhdess&auml; Suomen markan kanssa. Pian on uusi vuosi ja uusi valuutta, mutta ennen viimeisten markkojen tuhlaamista ehtii viel&auml; luoda katsauksen taaksep&auml;in. Ei nimitt&auml;in mit&auml;&auml;n niin uutta, ettei jotain tuttua ja turvallistakin: ikioma sammakkomme porskuttaa vanhaan malliin, eik&auml; uutta Amigaa ole viel&auml;k&auml;&auml;n ilmestynyt. Hyv&auml;t yst&auml;v&auml;t, olemme el&auml;m&auml;n peruskysymysten &auml;&auml;rell&auml;.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">En tied&auml; ket&auml; on uskominen, sill&auml; joku viisas on joskus v&auml;itt&auml;nyt, ettei mik&auml;&auml;n ole varmaa paitsi muutos - toisaalta Anssi Kelakin on tehnyt hitin toisesta totuudesta: kaikki s&auml;ilyy ennallaan. Amigan tapauksessa olisin taipuvaisempi veisaamaan suomipoppia, mutta j&auml;t&auml;n sen suosiolla laulajille. Itse p&auml;&auml;tyisin todenn&auml;k&ouml;isesti vain suohon. Palataan sen sijaan hetkeksi syyskuun alkuun. Vuoden tauon j&auml;lkeen yhdistys kokosi j&auml;lleen maamme Amiga-vaikuttajat yhteen. Oli Saku 2001.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Toisaalla t&auml;ss&auml; numerossa kerrotaan tarkemmin, mit&auml; siell&auml; tapahtui, ja Sakun kotisivuilta l&ouml;ytyy kaikkea mahdollista multimediaa aiheesta, joten keskityn nyt pelkkiin fiiliksiin. Saku 2001 oli kovempi juttu kuin p&auml;&auml;lt&auml; voisi kuvitella. Ensinn&auml;kin se oli paluu vuoden tauon j&auml;lkeen, ja paluu johon harva - edes min&auml; - jaksoi oikein uskoa Saku 99:n j&auml;lkeen. Toisaalta se oli uuden tiimin taidonn&auml;yte. Vaikka vanhoja partoja oli auttamassa, oli vetovastuu silti uudella polvella tekij&ouml;it&auml;.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">N&auml;m&auml; ihmiset eiv&auml;t p&auml;&auml;asiassa olleet tekem&auml;ss&auml; Saku 97:aa, 98:aa ja 99:ss&auml;kin heit&auml; oli vain muutama pieniss&auml; rooleissa. Silti Saku 2001 oli aivan yht&auml; onnistunut tempaus kuin aikaisemmat, teknisesti eritt&auml;in puhdas suoritus. Paljon j&auml;i parantamisen varaa ja ulkomaiset peruutukset olivat pettymys kaikille, mutta silti hatunnoston arvoinen suoritus. Kiitos teille Terho, Anu, Jarmo, Paula, Risto, Sami ja kumppanit. Ensi kerralla me vanhat voimme toivottavasti j&auml;&auml;d&auml; kokonaan &quot;kotiin&quot;. :-)<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 99:n j&auml;lkeen tunnelma oli hieman vaimea. Ilmassa oli tietty&auml; lopun alkua kaikesta jaetusta kr&auml;&auml;s&auml;st&auml; huolimatta, ja omat j&auml;lkifiilikseni kiteytyiv&auml;t aika hyvin silloisessa Sakun p&auml;&auml;kirjoituksessani, jossa p&auml;&auml;llimm&auml;isen&auml; oli harmi yleis&ouml;n suurista odotuksista. Pumppu oli kasvanut mittoihin, joista alkoi olla vaikea parantaa, vanhoilla ei ollut en&auml;&auml; puhtia ja toisaalta Amiga-markkinat n&auml;yttiv&auml;t toivon hetkeksi taas noustua viimeinkin kuihtuvan pois.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Aivan kuten ESCOMin (1995) ja Gatewayn (1997) astuttua puikkoihin, homma l&auml;hti kuitenkin yll&auml;tt&auml;en rullaamaan uudella tempolla vuoden 2000 alusta, kun uusi Amiga Inc. istui rattiin. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:lle l&ouml;ytyi kuin l&ouml;ytyikin uusia vet&auml;ji&auml; vuoden pakastevirkahallituksen j&auml;lkeen, ja sielt&auml;h&auml;n se vuoden 2001 tapahtuma sitten ponnisti uudistetulla innolla. T&auml;ll&auml; kertaa j&auml;lkitunnelmat ovat realistisen optimistiset.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ei siksi, ett&auml; minulla olisi hirve&auml;sti uskoa nykyiseen Amigan emoyhti&ouml;&ouml;n, vaan l&auml;hinn&auml; siksi, ett&auml; yhdistys on onnistunut siirt&auml;m&auml;&auml;n tietotaitoaan eteenp&auml;in ja tekem&auml;&auml;n Saku-tapahtumista enemm&auml;n kuin vain yhden hallituksen suorituksen. N&auml;ill&auml; ev&auml;ill&auml; ep&auml;ilem&auml;tt&auml; pystymme siihen toistekin, jos vain markkinat antavat my&ouml;ten. Saku 2001 oli my&ouml;s entist&auml; enemm&auml;n tiimisuoritus ja, Amigasta riippumatta, mielet&ouml;n jaettu kokemus. Kaverit sit&auml; parasta antia olivat joka tapauksessa.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Olen siis Saku 2001:n osalta eritt&auml;in tyytyv&auml;inen, toivottavasti my&ouml;s te viihdyitte. On ilmeist&auml;, ett&auml; t&auml;ll&auml;kin kertaa vedettiin tekij&ouml;ilt&auml; hetkeksi puhti pois ja yhdistyksen talous l&auml;htee taas hakemaan vauhtia nollasta, mutta siit&auml; sopii olla ihan hyv&auml;ll&auml; mielell&auml;. Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. ja Saku elelev&auml;t ep&auml;ilem&auml;tt&auml; melko lailla hiljaiseloa alkavan vuoden alkupuoliskolla, mutta en ihmettelisi lainkaan, jos pienen sapatin j&auml;lkeen alkaisi taas tapahtua. Kiitos kaikille!<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Se optimismista. Realismin nimess&auml; on kuitenkin todettava, ett&auml; Saku-tapahtumat sellaisena kuin me ne tunnemme ovat ainakin toistaiseksi tulleet tiens&auml; p&auml;&auml;h&auml;n. Siin&auml; miss&auml; viel&auml; Saku 98:aan oli helppo houkutella viisi kotimaista n&auml;ytteilleasettajaa ja Amigan emoyhti&ouml;n edustaja, oli vuonna 2001 n&auml;ytteilleasettajien m&auml;&auml;r&auml; tippunut kahteen kotimaiseen ja yhteen ulkomaiseen vieraaseen. Suurin osa tapahtuman sis&auml;ll&ouml;st&auml; oli tuotettava itse, mik&auml; teki tapahtumasta todella ty&ouml;l&auml;&auml;n - rajattomasti omien esittelypisteiden m&auml;&auml;r&auml; ei voi kasvaa, kun uusia tekij&ouml;it&auml;k&auml;&auml;n ei kasva puissa, p&auml;invastoin. Asiaa ei helpota lainkaan vanhentuva ja rikkoutuva Amiga-laitekanta.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kotimaisistakin yrityksist&auml; ainoastaan Gentle Eye Ky jatkaa en&auml;&auml; aktiivista Amiga-toimintaa, joten vuonna 2002 tarjolla olisi kenties en&auml;&auml; yksi suomalainen firma ja ne ulkomaiset vieraat, joita paikalle onnistuttaisiin haalimaan. Ulkomailta kysynt&auml;&auml; on tietysti maineemme kasvettua yh&auml; enemm&auml;n, olisihan Saku 2001:ss&auml; teoriassa voinut olla jopa nelj&auml; ulkomaista yrityst&auml; (itse asiassa olihan siell&auml; Cloanton edustajan lis&auml;ksi AmigaPLUS-lehden toimittaja Saksasta, koska h&auml;n sattui olemaan juuri Suomessa), mutta ulkomaalaiset vieraat ovat osoittautuneet hyvin ep&auml;varmoiksi.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ik&auml;v&auml; kyll&auml; my&ouml;s k&auml;vij&auml;m&auml;&auml;r&auml;t olivat selv&auml;sti laskeneet kahden vuoden takaisesta. Kun viel&auml; vuosina 1998 ja 1999 tapahtuma tuntui houkuttelevan sellaiset 500 kiinnostunutta, nyt vieraita oli paikalla noin 300. T&auml;m&auml; oli edelleen rohkaiseva osanotto ja ehdottomasti vaivan arvoinen, mutta mik&auml;li suurta yleis&ouml;&auml; ei saada kiinnostumaan, on suunta n&auml;emm&auml; vain alasp&auml;in. Markkinointiin oli t&auml;ll&auml; kertaa viel&auml;p&auml; satsattu eniten tapahtuman historiassa. T&auml;m&auml; pakottaa my&ouml;s rahoitusmieless&auml; miettim&auml;&auml;n kuviota uudelleen - juuri nyt on sangen ep&auml;selv&auml;&auml;, olisiko ensi vuonna tai viel&auml; sit&auml; seuraavanakaan mahdollista vuokrata edes puolia 2001:n tiloista, ellei tulonhankintaa tehosteta.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hyvi&auml; ideoita otetaankin ilomielin vastaan lehden palauteosoitteiden kautta. On palloteltu ajatuksia mm. tuote-esittelytilaisuudesta seuraavan sukupolven Amigan viimein ilmestyess&auml; (t&auml;llaista harkittiin jo Amiga MCC:lle vuonna 1999), jaettua tapahtumaa vaikka Linux-asian kanssa sek&auml; tietysti erilaisia pienimuotoisempia tapahtumia. Yksi t&auml;llainen olisi ollut Amiga-legendan RJ Micalin tapaaminen vuoden 2001 lopulla, mutta valitettavasti keskusteluista huolimatta emme saaneet asiaa RJ:n kiireiseen kalenteriin. Kenties my&ouml;hemmin. Oulussa taas tempaistiin syyskuussa vuosikokous, jonka laajuista ei ole n&auml;hty sitten vuoden 1998, joten h&auml;ppeninki&auml; kyll&auml; riitt&auml;&auml;. Oulusta on syyt&auml; riemuita muutenkin; oli eritt&auml;in ilahduttavaa laajentaa tapahtumatoimintaa pohjoiseen.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">On my&ouml;s ilmeist&auml;, ett&auml; itse kullakin el&auml;m&auml;ntilanteet vaihtelevat ja nykyiset sek&auml; entiset tekij&auml;t ehtiv&auml;t panostaa Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:hyn vaihtelevin m&auml;&auml;rin. Esimerkiksi itse ep&auml;ilem&auml;tt&auml; pid&auml;n yhteytt&auml; kuvioihin viel&auml; pitk&auml;&auml;n, mutta p&auml;&auml;asiassa olen keskittynyt yhdistyksen hallituksesta kaksi vuotta sitten l&auml;hetty&auml;ni siirt&auml;m&auml;&auml;n tietotaitoani eteenp&auml;in sek&auml; viestim&auml;ll&auml; ett&auml; k&auml;yt&auml;nn&ouml;n ty&ouml;ll&auml;. T&auml;m&auml; teht&auml;v&auml; alkaa hiljalleen olla t&auml;ytetty, joten roolini v&auml;henee entisest&auml;&auml;n. Tarvitaan jatkuvasti uusia ihmisi&auml; viem&auml;&auml;n yhteist&auml; kerhoa eteenp&auml;in.<br><br>
								<a href="http://batman.jypoly.fi/~saku/yhdistys/liittyminen.html" target="_blank"><img src="kuvat/eurot.jpg" width="204" height="204" border="0" align="right" alt=" "></a>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Paljon on siis ilmassa kysymysmerkkej&auml; ja paineita muutokselle, mutta sopii silti olla asioista hyv&auml;ll&auml; mielell&auml;. Saku on melkoinen yhteisty&ouml;n osoitus, josta sopii kaikkien meid&auml;n olla ylpeit&auml;. We made this, ja sillee. Hauskaa pidet&auml;&auml;n varmasti jatkossakin, vaikka aikaa, paikkaa ja sen muotoa en uskallakaan l&auml;hte&auml; ennustelemaan. Jos juuri sin&auml; uskallat, annapa kuulua itsest&auml;si. Sinua tarvitaan.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Erinomaista uutta vuotta! Ja viel&auml; kerran - kiitos.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Janne Sir&eacute;n<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">PS. Oheiseen valokuvaan liittyy pieni p&auml;hkin&auml;. Kuinka monta euroa kuvassa on ja mit&auml; tekemist&auml; niill&auml; on Amigan kanssa? Yksi vastaus l&ouml;ytyy <a href="http://batman.jypoly.fi/~saku/yhdistys/liittyminen.html" target="_blank">t‰‰lt‰</a>.<br>
								<br>
							</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="../etusivu.html" target="_self">Etusivu</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>