<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Alternative Party 2</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Ville &quot;Tripper&quot; Sarell &lt;<a href="mailto:Tripper@vip.fi">Tripper@vip.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Maailma on jo t&auml;ynn&auml; Assemblyj&auml;, Gatheringej&auml; ynn&auml; muita. Nyky&auml;&auml;n monilla pienemmill&auml;kin partyilla tapaa ihmisi&auml;, jotka vain lahtaavat toisiaan verkkopeleiss&auml;. Eih&auml;n sen t&auml;llaista pit&auml;nyt olla?! Nostalgiabuumin iskiess&auml; on t&auml;ytynyt keksi&auml; scenepartyt, jotka ovat vaihtoehtona t&auml;lle yh&auml; kaupallistuvalle kulttuurille. Vastaus ovat <a href="http://www.fishpool.com/alternative-party/info.html" target="_blank">Alternative Partyt</a>, jotka pidettiin nyt toista kertaa. Edellisen&auml; vuonna partyt pidettiin Turussa. Itse en ollut paikalla, mutta luettuani parin Atari-vierailijan partyraportit k&auml;sitin, ett&auml; kyseess&auml; on todella mielenkiintoinen tapahtuma. P&auml;&auml;timme kaverin kanssa roudata sinne Amigamme t&auml;ll&auml; kertaa.
						<p>Vaihtoehtobileet j&auml;rjestettiin 7.-9.7. Domus Academican tiloissa Helsingin ydinkeskustassa. Puitteet olivat mit&auml; parhaimmat, hyvin l&auml;hell&auml; Motorola Insiden tilojen tunnelmaa, joskin t&auml;&auml;ll&auml; oli my&ouml;s iso auditorio compoja varten. L&ouml;ysimme perille todella helposti, karttakuva oli ulkomuistissa, sill&auml; min&auml; ja kaverini olimme molemmat onnistuneet hukkaamaan tulosteet. Pys&auml;k&ouml;intipaikan (lue: vapaan, maksuttoman paikan) l&ouml;yt&auml;misess&auml; oli pienoisia ongelmia, mutta ei se jaksanut juuri huolettaa: pakko p&auml;&auml;st&auml; s&auml;&auml;t&auml;m&auml;&auml;n koneet kuntoon!</p>
						<p>Pistorasiapaikkoja oli juuri sopivasti ja kaikki johdotkin tulivat mukaan, joten ainoa kompastuskivi oli verkon asentaminen minun ja kaverini koneitten v&auml;lille. P&auml;&auml;timme kuitenkin ensimm&auml;isen&auml; tarkastaa saunan kunnon. Sauna sijaitsi parinkymmenen metrin p&auml;&auml;ss&auml; p&auml;&auml;rakennuksesta, mutta tiett&auml;v&auml;sti kuului samaan kompleksiin. Kokemus oli mit&auml; mainioin, en ollut saunonut yli vuoteen, ja kaupan p&auml;&auml;llisin&auml; tiloissa oli viel&auml; uima-allaskin!</p>
						<p>Jouduimme sitten lopulta s&auml;&auml;t&auml;m&auml;&auml;n verkkoa l&auml;hes viisi tuntia er&auml;&auml;n bugin vuoksi! Noh, mit&auml;s pienist&auml;... Partypaikalla oli itse asiassa vain nelj&auml; Amigaa meid&auml;n koneemme mukaan laskettuina. J&auml;rjest&auml;jill&auml; oli SCSI-ohjaimin varustettu A500, josta oli kuitenkin juuri partyp&auml;iv&auml;n&auml; hajonnut levyasema. He eiv&auml;t sitten saaneet kaikkia musiikkikilpailuun osallistuvien kappaleita talteen, joten lupauduimme lainaamaan kaverin levyasemaa.</p>
						<p>Kilpailuja oli kaiken kaikkiaan viisi: table hockey, ST-01 music -compo, obscure music -compo, source code graphics -compo sek&auml; democompo. P&ouml;yt&auml;l&auml;tk&auml; meni ensimm&auml;isen&auml; iltana rattoisasti aikataulun mukaan (ei teknisi&auml; h&auml;iri&ouml;it&auml;, doh), mutta muut kilpailut siirtyiv&auml;t reilusti rikkin&auml;isen levyaseman takia.</p>
						<p>Ennen kuin siirsimme kaverin levarin A500:aan, kokeilimme siirt&auml;&auml; kappaleet viereisest&auml; Amigasta serial-letkun avulla, mutta t&auml;ss&auml; koneessapa ei ollut terminaaliohjelmaa asennettuna. Seuraavaksi viereinen linuks-peecee (mit&auml; se siell&auml; teki?!) sai yritt&auml;&auml;... Ei, mukana olleesta ohjelmasta sitten puuttui jotain olennaista. K&auml;vimme hakemassa kaverin levarin ja yritimme saada sill&auml; pelitt&auml;m&auml;&auml;n, mutta ei sek&auml;&auml;n suostunut tunnistautumaan. Hienoa, ei auttanut kun vied&auml; koko kaverin kone auditorioon soittamaan kahta biisi&auml;, jotka eiv&auml;t A500:lla olleet. :)</p>
						<p>ST-01-compoon tuotoksia saapui kaiken kaikkiaan kahdeksan. Kyseess&auml;h&auml;n oli kilpailu, johon t&auml;ytyi tehd&auml; kappale k&auml;ytt&auml;en vanhan Soundtracker-sampledisketin soittimia. Kappaleiden soitto sujui ongelmitta, vaikka kaverin koneella soitettiinkin niist&auml; kaksi. Obscure music -compossa tarkoituksena oli tehd&auml; kappale esim. samplaamalla jotain elektronisia vempaimia, jotka tuottavat mit&auml; kummallisimpia &auml;&auml;ni&auml;, ja tehd&auml; n&auml;ist&auml; biisi. Puhettakin sai n&auml;emm&auml; mukaan ottaa. En ihan perill&auml; ollut s&auml;&auml;nn&ouml;ist&auml;, joten en jaksanut kappaletta v&auml;&auml;nt&auml;&auml;. Ei ollut kyll&auml; moni muukaan, tuntuivat odottavan jotain aivan toisenlaista kuunteluel&auml;myst&auml;. :) Mielenkiintoinen idea, ei siin&auml; mit&auml;&auml;n. Source code graphics -compossa tarkoituksena oli tehd&auml; taideteos, joka kuitenkin sis&auml;lsi toimivan koodinp&auml;tk&auml;n. Tuotokset eiv&auml;t kovin kummoisia olleet, ja niit&auml; olikin vain nelj&auml; (tai kolme?).</p>
						<p>Demokilpailussa ei ollut juurikaan s&auml;&auml;nt&ouml;j&auml;, ainakaan en itse muista huomanneeni. Demoja oli muistaakseni seitsem&auml;n, joista yksi Amigan. Spedes-ryhm&auml;n Amiga-demo jouduttiin n&auml;ytt&auml;m&auml;&auml;n minun koneellani, koska se tuntui olevan ainoa tehokas (68060) kone koko partyilla. Eip&auml; siin&auml; mit&auml;&auml;n, sainpahan ensimm&auml;isen&auml; demon itselleni heti tekij&ouml;itten j&auml;lkeen. :-) Muita koneita demokilpailussa olivat mm. VIC-20, Atari Falcon ja joku vanha IBM. Pari demoa jouduttiin n&auml;ytt&auml;m&auml;&auml;n videokameran kautta, koska videotykki ei suostunut synkkaamaan kuvaa sein&auml;lle! Toisessa demossa syyn&auml; taisi olla strobo-efekti, joka pisti screenit hieman solmuun. El&auml;v&auml;n n&auml;k&ouml;isilt&auml; demoiltahan ne n&auml;yttiv&auml;t, huojuvine kuvineen kaikkineen. :) Demoja oli puolet v&auml;hemm&auml;n viimevuotiseen Alternative Partyyn verrattuna, mist&auml; lie johtunut. Toivottavasti ensi vuonna n&auml;hd&auml;&auml;n jotain mullistavaa.</p>
						<p>En hirve&auml;sti ehtinyt tiirailemaan muita erikoisia vempeleit&auml;, joita tosiaan oli mukava m&auml;&auml;r&auml;. Oli muutama Atari ST, Atari Falconeita, C-64:ia, VIC-20, vanhoja PC:t&auml;, Spectrumeita, Silicon Graphicsejakin oli pari sek&auml; hyvin monia, joita en tunnistanut tai en muista. Er&auml;s n&auml;ist&auml; oli tietokonemuseosta lainattu kone, jolla esitettiin demokin, harmi vain ett&auml; olen masiinan nimen unohtanut. Yhden erikoisen vempeleen kuitenkin muistan. Se oli Vectrex, ensimm&auml;inen ja tiett&auml;v&auml;sti ainoa pelk&auml;st&auml;&auml;n vektoripohjainen pelikonsoli. T&auml;llaista kummajaista on valmistettu joskus aivan 80-luvun alkupuolella, ja mukana oli erikoisen muotoinen TV, johon pelimoduulit tungettiin, sek&auml; joypad varustettuna nelj&auml;ll&auml; napilla. Kone oli tuotu muitten tarkasteltavaksi ja pelailtavaksi.</p>
						<p>Partyill&auml; oli ihailtavan turvallinen tunnelma, uskalsi j&auml;tt&auml;&auml; koneen vartioimatta sek&auml; l&auml;hte&auml; pelaamaan muitten vempeleit&auml;. Mm. Segan Dreamcastia sai hakata, t&auml;ss&auml; vehkeess&auml; tosin on Windows CE taustalla kummittelemassa... mutta menk&ouml;&ouml;t. ;) Tiesittek&ouml;, ett&auml; Stardustin (tuo klassinen suomalainen Asteroids-klooni) oli joku hemmo k&auml;&auml;nt&auml;nyt Atari ST:lle! Itse tekij&auml; oli paikalla pelailemassa, ja peli n&auml;ytti kyll&auml; todella n&auml;tilt&auml; 16 v&auml;rill&auml;. H&auml;n kertoi k&auml;&auml;nt&auml;neens&auml; sen tosin jo v&auml;h&auml;n Amiga-version julkaisun j&auml;lkeen, mutta kunnioitettava suoritus kuitenkin.</p>
						<p>Ulkomaisia vieraita oli my&ouml;s runsaasti, ainakin Ruotsista, Ven&auml;j&auml;lt&auml; ja Englannista. T&auml;llaisia tapahtumia kun ei tiett&auml;v&auml;sti monia j&auml;rjestet&auml; maailmalla, joten kauempaakin kannattaa tulla. Vaihtoehtopartyt ovat kuitenkin eritt&auml;in suositeltava tilaisuus kaikille Assemblyiss&auml; tuskastuneille, l&auml;hes yht&auml; hyv&auml; fiilis kuin Motorola Insideiss&auml;!</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
