<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Mit&auml; uusi Amiga Inc. oikeastaan tekee?</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Vaikka oma innostukseni Amigan mahdollisuuksiin tulevaisuudessa ottikin jokseenkin fataalin iskun Gatewayn sekoilujen my&ouml;t&auml; - sit&auml; kun jaksaa innostua uudelleen vain niin monta kertaa - olen seurannut toisella silm&auml;ll&auml; Bill McEwenin luotsaaman uuden Amiga Inc.:n puuhia. PR on ollut paikoin aika karmeaa, mutta innostusta heill&auml; jaksaa riitt&auml;&auml;.
						<p>Olen monien muiden lailla lukenut kaikki ne sekalaiset lehdist&ouml;tiedotteet, kuullut Taosta ja n&auml;hnyt sen demokuvia, mutta uskon, etten ole ainoa, jolle on j&auml;&auml;nyt ep&auml;selv&auml;ksi, mit&auml; itse Amiga Inc. oikein tekee. Viime kuukausien aikana palapeli on kuitenkin alkanut saada tunnistettavissa olevaa muotoa, ja my&ouml;s Amigan osuus kuviossa alkaa valjeta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Taas se Operating Environment</b> </font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">K&auml;site &quot;Amiga Operating Environment&quot; lienee useimmille tuttu jo Gatewayn ajoilta, ensinh&auml;n se kuultiin Jim Collasin suusta. Tosin t&auml;ytyy muistaa, ett&auml; Collasin hittipuheet kirjoitti, kas kas, tuolloinen Amigan markkinointimies Bill McEwen. Collasin Amiga OE oli kuitenkin teknisesti eri juttu: se perustui Jeff Schindlerin, Allan Havemosen ja muun silloisen tiimin Javan, Jinin yms. p&auml;&auml;lle rakentamaan Amiga Objects -arkkitehtuuriin. Konsepti taas vastasi tavallaan nykyist&auml;: kaikkien digitaalisten laitteiden saumaton yhteispeli.
						<p>T&auml;h&auml;n t&auml;ht&auml;&auml; my&ouml;s uuden Amigan j&auml;rjestelm&auml;. Olemme kuitenkin kuulleet v&auml;hemm&auml;n laitteiden yhteispelist&auml;, Collasiltahan muistamme ne kuuluisat esimerkit television hallinnasta k&auml;mmenmikrolla tai kotitelkkarin kanavan vaihtamisesta Japanista saakka, ja enemm&auml;n ohjelmistojen skaalautuvuudesta. Uusi Amiga OE on k&auml;ytt&ouml;j&auml;rjestelm&auml; tai k&auml;ytt&ouml;ymp&auml;rist&ouml;. Sit&auml; voidaan ajaa my&ouml;s jonkin toisen k&auml;ytt&ouml;j&auml;rjestelm&auml;n p&auml;&auml;ll&auml;, jolla samoja ohjelmia voidaan ajaa laitteistosta riippumatta.</p>
						<p>Skaalautuvuus ja ohjelmien ajo eri ymp&auml;rist&ouml;iss&auml; muistetaan my&ouml;s Collasin ajoilta, olihan tuolloinkin Java kuvioissa. Silloin ratkaisu nojasi kuitenkin vahvasti Linuxiin, ja muitakin eroja oli havaittavissa. Uuden Amigan j&auml;rjestelm&auml; perustuu englantilaisen Tao Groupin Intent-j&auml;rjestelm&auml;&auml;n, joka on Amiga OE:ss&auml; nimetty Amiga Foundation Layeriksi. Todenn&auml;k&ouml;isesti uuteen suunnitelmaan kuuluu my&ouml;s edell&auml; mainitun kaltaisia digitaalisen yhdentymisen piirteit&auml;, mutta toistaiseksi niist&auml; on kuultu v&auml;h&auml;n.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Uudelleennimetty Intent</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Yksinkertaistaen uusi Amiga aikoo tuoda markkinoille uuden AmigaOS-k&auml;ytt&ouml;j&auml;rjestelm&auml;n tai Amiga OE -k&auml;ytt&ouml;ymp&auml;rist&ouml;n, miten sit&auml; nyt sitten haluaakaan kutsua. T&auml;m&auml; on k&auml;yt&auml;nn&ouml;ss&auml; Taon Intent pakattuna uusiin kuoriin, ja se toimii t&auml;ll&auml; hetkell&auml; noin 14 eri prosessorilla (mm. x86 ja PowerPC, mutta 680x0 ei kuulu n&auml;ihin Motorolan toiveesta, Motorola kun on yksi Taon sijoittajista ja haluaa vanhasta prosessorisarjasta eroon).
						<p>Intent sis&auml;lt&auml;&auml; ns. virtuaaliprosessorin, jolle ohjelmat tehd&auml;&auml;n. &quot;Kaikki&quot; ohjelmat toimivat &quot;kaikilla&quot; laitteilla, matkapuhelimesta palvelimeen. K&auml;yt&auml;nn&ouml;ss&auml; laitteiden erilaiset resurssit asettavat rajoituksia, mutta esimerkiksi matkapuhelinta varten koodattu Tetris toimii hyvin p&ouml;yt&auml;koneellakin, vaikka molemmissa olisi t&auml;ysin eri prosessori. Intent-ratkaisu perustuu Javaan ja sis&auml;lt&auml;&auml; joidenkin raporttien mukaan maailman nopeimman Java-virtuaalikoneen.</p>
						<p>Uusi Amiga OE, jolla siis sin&auml;ns&auml; ei ole mit&auml;&auml;n suoraa tekemist&auml; vanhan Classic AmigaOS:n kanssa, tulee toimimaan itsen&auml;isen&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n&auml; tai sit&auml; voi ajaa ns. hosted-tilassa vaikkapa Windowsin tai Linuxin p&auml;&auml;ll&auml;. J&auml;rjestelm&auml;&auml; on jo kokeiltu Segan Dreamcastissa, Linux-mikroilla ja ilmeisesti k&auml;nnyk&ouml;iss&auml;kin. Tai siis, ainakin Taon Intenti&auml; on - t&auml;h&auml;n saakka on ollut varsin ep&auml;selv&auml;&auml;, mik&auml; on itse Amigan osuus hommassa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Lis&auml;arvoa Amigalta</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Bill McEwen on ker&auml;nnyt tiimiins&auml; useita nykyisi&auml; ja entisi&auml; amigisteja ja nostanut p&auml;&auml;omasijoittajilta miljoonia dollareita projektinsa rahoittamiseksi. H&auml;n on painottanut yrityksen olevan ensisijaisesti ohjelmistoyritys, mit&auml;&auml;n hardwarea he eiv&auml;t aio valmistaa - sen sijaan kolmannet osapuolet voisivat niin tehd&auml;. Noh, t&auml;m&auml; tarinahan on kuultu aiemminkin, mutta mit&auml; uusi Amiga itse asiassa sitten tekee?
						<p>Amigan kev&auml;&auml;ll&auml; julkaiseman Amiga Software Developers Kitin tai lyhyemmin SDK:n my&ouml;t&auml; t&auml;h&auml;n on tullut joitain vastauksia. Intent on ilmeisesti sangen pirtsakka paketti noin tehon kannalta, mutta sellaisenaan siit&auml; ei ole valmiiksi k&auml;ytt&ouml;j&auml;rjestelm&auml;ksi. Sen p&auml;&auml;lle tarvitaan esimerkiksi &auml;&auml;nikirjastoja, 3D-kirjastoja ja Amigan kannalta my&ouml;s emulaatioyhteensopivuutta vanhan Amigan kanssa. T&auml;ss&auml; Amiga Inc. tulee kuvaan.</p>
						<p>Paitsi ett&auml; Amiga tuo Tao Intentin ymp&auml;rille brandiuskottavuutta (kr&ouml;h, tuosta tietysti voidaan olla monta mielt&auml; :-) ja kulttiseurannan, sek&auml; tietysti tukiverkoston, jolla t&auml;m&auml; Amigan ker&auml;&auml;m&auml; suosio saadaan kalastettua uuden j&auml;rjestelm&auml;n l&auml;ht&ouml;energiaksi, tehd&auml;&auml;n Amigalla ihan oikeata ohjelmistokehityst&auml;kin. Amiga Inc. kehitt&auml;&auml; yhteisty&ouml;kumppaniensa kanssa Intentiin, tai siis Amiga OE:hen, niit&auml; osia, joita siit&auml; viel&auml; puuttuu.</p>
						<p>Esimerkiksi Hyperionin, joka juuri julkaisi Heretic II:n Amigalle, kerrotaan olevan tekem&auml;ss&auml; 3D-kirjastoja uudelle Amigalle. Haage &amp; Partner taas puuhastelee emulaatiota Classic Amigalle ja auttaa tuomaan uuden Amiga OE:n PowerPC-kortin omaaville Classic Amigoille.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Uusi Amiga-tietokonekin</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Uusi Amigan omistaja ei tietenk&auml;&auml;n voisi olla uusi Amigan omistaja, ellei se julkistaisi suunnitelmia uudesta Amiga-tietokoneesta. Amiga MCC on viel&auml; tuoreessa muistissa, ja joku ehk&auml; jaksaa kaivaa takaraivostaan kuvia Escomin Amiga Walkerista tai visioita Power Amigasta, mutta Amiga Inc. otti piosmaisen nime&auml;mistavan: AmigaOne. Bill McEwen kertoi heid&auml;n &quot;aloittavan alusta&quot;, siit&auml; tuo &quot;One&quot;. Toivottavasti ei k&auml;y kuten PIOSille (nykyinen met@box), jonka PIOS One ei koskaan ilmestynyt...
						<p>Amiga Inc. ei aio valmistaa AmigaOnea itse, vaan j&auml;tt&auml;&auml; sen teht&auml;v&auml;n yhteisty&ouml;kumppaneilleen. T&auml;m&auml;n tarkempaa tietoa AmigaOnesta ei viel&auml; ole tarjota, mutta se tulee olemaan t&auml;ysverinen p&ouml;yt&auml;kone, joka on rakennettu standardiosista ja ajaa uutta Amiga OE:ta. Bill McEwen aloitti perinteisen rumban esittelem&auml;ll&auml; Disneyll&auml; t&ouml;iss&auml; olevien amigistien tekemi&auml; konseptikuvia Amiga '2k -messuilla kev&auml;&auml;ll&auml;. Ehk&auml;p&auml; joku n&auml;ist&auml; on AmigaOnen pohjana, ja pian p&auml;&auml;semme ihailemaan pahvimalleja. ;-)</p>
						<p>Vakavasti, uusi Amiga on kyll&auml; kertonut oppineensa edelt&auml;jiens&auml; virheist&auml; ja vakuuttanut, ettei julkista mit&auml;&auml;n suunnitelmia, ennen kuin ne ovat valmiita. Aika suuri lupaus, ja varmasti sellainen, jota he eiv&auml;t t&auml;ysin voi pit&auml;&auml; - onhan jo nyt n&auml;hty useita lipsahduksia, kuten developer-koneen julkistaminen ja sitten suunnitelman muuttaminen (sen sijaan ett&auml; Amiga valmistaisi koneet itse, kuten ehti jo julistaa, se lisensoi homman muille ja myy SDK:ta erikseen esim. Amazon.comin kautta). T&auml;ss&auml; Amiga kuitenkin vain kuunteli Amiga-yhteis&ouml;n palautetta, joten syy oli ihan hyv&auml;.</p>
						<p>Vaikea on my&ouml;sk&auml;&auml;n erottaa t&auml;t&auml; AmigaOnesta kertomista aikaisemmista tuotejulkistuksista. Jotenkin taas tulee sellainen tunne, ett&auml; nyt her&auml;tell&auml;&auml;n toiveita, ennen kuin asiat ovat riitt&auml;v&auml;n varmalla pohjalla. Aika n&auml;ytt&auml;&auml;.</p>
						<p>Henkil&ouml;kohtaisesti harkitsin hetken aikaa AmigaOnesta kirjoittamatta j&auml;tt&auml;mist&auml;. Olen nimitt&auml;in pienen &quot;journalistiurani&quot; aikana kirjoittanut lukuisia artikkeleita uusista Amigoista ja Amiga-klooneista, mm. Walkerista, Power Amigasta, BoXeRista, A5000/6000:sta (ne saksalaiset kloonimikrot), Phase 5:n A\Boxista ja PreBoxista, VIScorpin set-top-boxista, Gatewayn developer-koneesta, MCC:st&auml;, WonderTV:st&auml;, QuickPakin klooneista jne., eik&auml; n&auml;ist&auml; ainuttakaan ole julkaistu. AmigaOne saa rikkoa melkoisen kirouksen selvit&auml;kseen. :-)</p>
						<p>Yksik&auml;&auml;n viiden vuoden aikana uutisoimani uusi &quot;Amiga&quot; ei ole ilmestynyt. Yksik&auml;&auml;n (no pun intended).</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Nyt koodataan!</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Uuden Amiga Inc:n eduksi t&auml;ytyy kuitenkin todeta, ett&auml; he ovat ehtineet puolivuotisen olemassaolonsa aikana tehd&auml; jotain, josta Gateway ehti vain esitt&auml;&auml; lukuisia lupauksia, nimitt&auml;in julkistaa uuden Amiga OE:n kehitysymp&auml;rist&ouml;n. Toki t&auml;m&auml; Amiga SDK perustuu paljolti Taon Intentiin, mutta se on alku innokkaille koodaajille, jotka haluavat p&auml;&auml;st&auml; kokeilemaan siipi&auml;&auml;n uudessa Amiga-ymp&auml;rist&ouml;ss&auml; (jota kutsutaan my&ouml;s nimell&auml; Amie). SDK:sta puuttuvat viel&auml; esimerkiksi &auml;&auml;ni- ja 3D-kirjastot, mutta niit&auml; lupaillaan syksymm&auml;ll&auml;.
						<p>Kokonaisuutena Amigan esitys on ollut aika sekava, ja sekalaiselta tuntuu sakkikin. Paljon olisi ty&ouml;t&auml; esimerkiksi PR:n ammattimaisuudessa, mutta Bill McEwenill&auml; on kyll&auml; pointtiakin h&auml;nen sanoessaan, ett&auml; t&auml;ll&auml; kertaa he haluavat tehd&auml; ensin fiksun tuotteen ja vasta sitten palkata ihmisi&auml; myym&auml;&auml;n sit&auml;. Toisaalta on ollut rohkaisevaa n&auml;hd&auml; Amigan nime&auml; esimerkiksi useissa Taon Amigaan liittym&auml;tt&ouml;miss&auml; lehdist&ouml;tiedotteissa tai devicetop.comin etusivulla.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Mit&auml; sopii odottaa?</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tulossa on siis uusi Amigan nimell&auml; kulkeva k&auml;ytt&ouml;j&auml;rjestelm&auml;, jota voidaan ajaa ja jonka ohjelmia voidaan suorittaa muutoksitta hyvin monenlaisissa laitteissa. J&auml;rjestelm&auml; ajaa my&ouml;s vanhoja Amiga-ohjelmia emulaatiolla, mutta muuten yht&auml;l&auml;isyydet vanhaan Amigaan ovat l&auml;hinn&auml; tuotemerkkeihin ja tunnearvoon rajatut (kuten ne olivat Gatewayn suunnitelmissakin).
						<p>T&auml;t&auml; j&auml;rjestelm&auml;&auml; voidaan ajaa olemassaolevilla laitteilla, mutta sit&auml; varten tullaan mahdollisesti kehitt&auml;m&auml;&auml;n my&ouml;s uusia tietokoneita, kuten mainittu AmigaOne. Mik&auml;li Tao ja Amiga onnistuvat valloittamaan maailman, ehk&auml;p&auml; katselemme Boing-demoa seuraavan sukupolven k&auml;nnyk&ouml;iss&auml;kin. En pid&auml;ttele hengityst&auml;ni, mutta toivotan heille onnea!</p>
						<p>Mielenkiintoinen tietol&auml;hde on Amiga.comin Amiga World -lehti, johon kannattaa tutustua, mik&auml;li uusi Amiga kiinnostaa: <a href="http://www.amiga.com/press/zine/" target="_blank">http://www.amiga.com/press/zine/</a></td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
