<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #102 (5.9.2002)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>
<p>Im vergangenen Monat hatte ich mehrfacht Newsletter rausgemailt und mich auch an diverse News Seiten geand, so dass einige Dinge aus diesem Editorial bereits bekannt sein k&#246;nnten - trotzdem wiederhole ich diese hier, so dass alle informiert sind:</P>

<p>Wie man nur unschwer an der Beteiligung der aktuellen Ausgabe erkennen kann, verliert die NC immer mehr an Attraktivit&#228;t. Es fehlen insbesondere Schreiberlinge, die des &#246;fteren mal &#252;ber aktuelle Produkte wie Aminet Programme etc. schreiben, so dass selbst in verwaiste Rubriken wieder Leben kommt. Wie auch immer, trotz Versuche meinerseits neue Schreiber in das NC Boot zu holen, konnte ich als Herausgeber die NC bisher nicht entscheidend nach vorne puschen. Da hilft es auch nicht, dass die NC inzwischen Freeware ist und frei im Aminet erh&#228;tlich ist. Deswegen werde ich jetzt nochmal einen Versuch unternehmen, dass arg angeschlagene NC Boot fit zu machen:</P>

<p>Unter allen Redakteuren der kommenden Ausgabe wird ein drei Ausgaben Abo der Amiga Future verlost - besten Dank an Andreas Magerl, der uns damit tatkr&#228;ftig untert&#252;tzt. Ich hoffe, dass dadurch wieder ein wenig die Motivation steigt, auch wenn solche Aktionen nat&#252;rlich nicht jeden Monat wiederholbar sind.</P>

<p>Desweiteren wird es das Diskettenabo ab dieser Ausgabe nicht mehr geben. Stattdessen erhalten alle Diskabonennten die jeweils aktuelle Ausgabe auf CD, was nicht nur preisg&#252;nstiger ist, sondern vor allem den Aufwand unsererseits minimiert. Das hat nebenbei den Vorteil, dass jeweils die komplette Ausgabe verschickt wird und einzele Files - aufgrund der Datentr&#228;gerbechr&#228;nkung bei Disketten -  nicht gel&#246;scht werden m&#252;ssen. Ich hoffe doch, dass diese Idee auf Eure Zustimmung trifft.</P>

<p>Ich hatte gerade das Zeitproblem meinerseits angesprochen - jede Hilfe ist momentan absolut willkommen, da ich nebenbei noch weitere Projekte am laufen habe und meine Zeit schon jetzt begrenzter ist, als ich es gerne h&#228;tte. Ab Oktober beginnt zudem mein Jura Studium und ich kann im Moment noch nicht absch&#228;tzen, inwiefern ich ab dann noch Zeit habe, mich um die NC zu k&#252;mmern. Falls es soweit kommen sollte steht allerdings schon ein entsprechender Nachfolger in den Startl&#246;chern bereit, der mir versichert hat, sich um die NC in der jetztigen Form zu k&#252;mmern und in hoffentlich ruhigere Gew&#228;sser zu steuern. Allerdings hat auch diese Massnahme nur dann Sinn, wenn die Betiligung entscheidend ansteigt - anhand der Download Zahlen, dem E-Mail Verteiler sowie diversen Mails erkenne ich, dass nach wie vor Bedarf an einem Diskmag besteht. Es w&#228;re also sehr schade, wenn bald auch noch das dienst&#228;lteste Diskmag auf dem Amiga die Tore schlie&#223;en m&#252;sste, nur weil die Beteiligung einfach nicht da ist. Die nach wie vor aktiven Schreiber sowie weitere Leute im Hintergrund tuen schon ihr bestm&#246;gliches um die NC am Leben zu erhalten, aber alleine schaffen wir es im Moment einfach nicht...</P>

<p>Ich kann mich noch genau an meine Euphorie zur 100. Ausgabe der NC erinnern, als ich optimistisch in die Zukunft blickte und davon ausgegangen bin, dass es auch wieder aufw&#228;rts geht. Von diesem Optmismus ist leider nur wenig &#252;brig geblieben, aber ich glaube nach wie vor an eine Zukunft f&#252;r die NC. Wie diese letztendlich aussieht, liegt alleine in Eurer Hand....</P>



<p>Allright, jetzt w&#252;nsche ich Euch viel Spa&#223; beim Lesen der
aktuellen NC. See ya,<br>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais</b></p>

</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
