<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Revolution CD</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><center><img src="rev1.jpg"></P></center>
<p><h1><center><font color=green>Kurzvorstellung: Revolution CD</font></h1></center></P>
<p>&#196;ltere Spiele neu aufzulegen ist grunds&#228;tzlich ein guter Gedanke, w&#228;re da vor einiger Zeit nicht eine Firma namens Alive Mediasoft gewesen, die diesem Gedanken einen massiv negativen Beigeschmack verliehen haben. Trotzdem m&#252;ssen nicht alle Neuauflagen schlecht sein, wie die vorliegende &quot;Revolution Software&quot; CD beweist. Der (oder die?) Hersteller der CD ver&#246;ffentlicht das ganze - mit Eraubniss der Original Firma - als Freeware CD Rom, so dass man schon zu einem geringen Kurs in den Besitz dieser CD gelangen kann.</P>

<p><h1><center><font color=yellow>Der Inhalt</font></h1></center></P>

<p>Auf der Revolution CD, welche anscheinend die erste CD dieser Reihe darstellt (es wird also weitere Freeware CD`s geben!), befinden sich die beiden Adventure Klassiker Lure Of The Temptress und Beneath A Steel Sky. Bevor ich ganz kurz auf diese Klassiker eingehe, m&#246;chte ich aber noch einige weitere 
Worte &#252;ber diese CD verlieren:</P>

<p>Der Herrsteller hat sich anscheinend richtig viel M&#252;he bei der Zusammenstellung gemacht und nicht nur die beiden Spiele lieblos auf die CD gebrannt, sondern das ganze auch gleich noch in Hinsicht auf den UAE zus&#228;tzlich als ADF Files hinterlegt. F&#252;r den Original Amiga sind zudem noch Degrader Tools mit von der Partie, so dass beide Spiele auch auf hochgez&#252;chteten Amigas lauff&#228;hig sind und selbst unter OS 3.9 keinerlei Probleme machen. Ebenso sind L&#246;sungswege f&#252;r die beiden Adventures vorhanden, wenn auch nur in italienischer (Beneath A Steel Sky) und englischer (Lure Of The Temptress) Sprache. Als letzten Bonus gibt es noch einige Screenshots sowie ein Cover zum selber drucken, damit die (gebrannte) CD auch im heimischen Schrank etwas hermacht. Der positive Eindruck der CD wird noch von den eingestzten Glow Icons abgerundet.</P>

<p><u>Lure Of The Temptress (1992):</U><br>
Dieses Point And Click Adventure stellte einen der ersten Versuche von Revolution Software da, im Adeventure Genre Fuss zu fassen. Dabei sind Grafik, Sound und Atmosph&#228;re eigentlich ganz okay, zumal man immer bedenken muss, dass Lure Of The Temptress von 1992 stammt. Mit den gro&#223;artigen Lucasfilm Adventures (Indiana Jones, Monkey Island, Zak McKracken) kann es zwar nicht so wirklich konkurrieren, aber Adventure Fans werden damit selbst im Jahre 1992 immer noch ihren Spa&#223; haben. 

<p><u>Beneath A Steel Sky:</U><br>
&#220;ber dieses Hammeradventure noch gro&#223;artig Worte zu verlieren, ist eigentlich nahezu &#252;berfl&#252;ssig - schon in der damaligen Amiga Fachpresse wurde Beneath A Steel Sky mit Bestnoten &#252;berh&#228;uft, was nicht nur an der excellenten Grafik und dem guten Gameplay lag, sondern sich insbesondere auf die Atmosph&#228;re, die f&#252;r ein Adventure nicht ganz unwichtig ist, zur&#252;ckf&#252;hren l&#228;sst. Mit Worten ist Beneath A Steel Sky eigentlich nur schwer zu beschreiben, zumal es wohl kaum Amiga User geben d&#252;rfte, die diesen Klassiker nicht kennen. Geh&#246;rt sicherlich zu den wegweisenden Spielen im Genre der Adeventures und hat selbst 2001 nichts von seinem Charme verloren.</P>

<p><h1><center><font color=white>Fazit</font></h1></center></P>
<p>Da es sich um eine Freeware CD handelt (der Verkausfpresi d&#252;rfte also so um die 10 DM liegen), gibt es von finanzieller Seite schonmal keine Beanstandungen zu machen. Auch die Sorgfalt, mit der die CD zusammengestellt wurde, sollte hier nochmal erw&#228;hnt werden - davon k&#246;nnte sich die eine oder andere kommerzielle Softwarefirma durchaus eine Scheibe abschneiden. Die beiden Adventures sind auch &#252;ber jede Kritik erhaben und d&#252;rften  Adventure Freunden einige kurzweilige Stunden vor dem Amiga einbringen. Klare Empfehlung meinerseits!</P>

<ü><u>Bezugsquelle (5 DM + Verpackung):</U><BR>
Patrick Henz<br>
Martinstr.15<br>
52062 Aachen<br>
Mail: <a href="mailto:fom@3pyramids.zzn.com">fom@3pyramids.zzn.com<BR>
Web<a href="http://surf.to/fom" target="_blank">http://surf.to/fom</A></P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
