<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat etwas Neues gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Paybox<br>
Die mobile Geldb&ouml;rse</font></b></center>
<br>
<table width=100% border=0 cellpadding=8>
<tr><td>

<p><img src="onl_paybox1.jpg" align="left" width="220" height="200"
hspace=6> Wer kennt das nicht: Im Prinzip w&uuml;rden viele gern online
einkaufen, doch vor dem Bestell-Knopf auf der Shop-Website bleibt
h&auml;ufig der entscheidende Klick aus. Die Sorge, pers&ouml;nliche Daten,
wie Bankverbindung oder Kreditkarten- Nummer, k&ouml;nnten in den Weiten
des Internets in unbefugte H&auml;nde gelangen, wiegt bei vielen Usern
st&auml;rker als die Verlockungen des Kauf-Kicks im Web. </p>

<p> Die neue Methode zur Durchf&uuml;hrung von Zahlungen per Mobiltelefon - <b>
Paybox</b> - k&ouml;nnte sich als kleine Revolution auf dem Gebiet des E- und
M-Commerce entwickeln. </p>

<p> Die vor einem Jahr gegr&uuml;ndete Paybox.net AG vermeldet bislang
&uuml;ber 260.000 registrierte Kunden und rund 5000 H&auml;ndler, die die
bequeme Zahlungsmethode akzeptieren. Mittlerweile wird sogar schon davon
gesprochen, dass die Entwicklung aus Deutschland, die bereits in vier
europ&auml;ischen L&auml;ndern funktioniert, auf dem besten Wege ist, sich
als international anerkannter Industrie-Standard f&uuml;r mobile
Zahlungsmethoden durchzusetzen. Die Vorteile in Sachen Sicherheit liegen
dabei klar auf der Hand:

<ul> <li> Man bezahlt nicht &uuml;ber das Internet, sondern <b>&uuml;ber das
sicherere Mobilfunknetz.</b></li>

<li> Die Transaktionen &uuml;ber Paybox sind unmittelbar mit der
<b>Mobilfunknummer</b> des Kunden verkn&uuml;pft. </li>

<li> Um eine Zahlung zu authorisieren, wird eine <b>PIN</b> f&uuml;r den jeweils
pers&ouml;nlichen Bereich bei Paybox ben&ouml;tigt. </li> </ul>

F&uuml;r den Kunden k&ouml;nnte das Paybox-Verfahren also bedeuten, statt
sich wie bisher im Internet satt zu sehen, aber dann doch zum Essen
&quot;nach Hause zu gehen&quot;, nun mehr ohne Angst vor Datenklau sichere
Eink&auml;ufe im Web zu t&auml;tigen. Drei verschiedene Zahlungsarten
stehen dabei dem Nutzer des Paybox-Services zur Verf&uuml;gung.

<ul> <li><b>Internet-to-paybox:</b> Zur sicheren und unkomplizierten
Zahlung in Online-Shops.</li>

<li><b>Mobile-to-paybox:</b> Zur Bezahlung von mobilen Dienstleistungen wie
zum Beispiel Taxi-Fahrten oder Pizza-Lieferanten.</li>

<li><b>Paybox-to-paybox:</b> Zur Durchf&uuml;hrung von Zahlungen zwischen zwei
Privatpersonen mit eingerichteter Paybox.</li></ul></p>

<h3><b>Und so funktioniert es - Anmelden, Freischalten und Bezahlen</b></h3>

<p><img src="onl_paybox2.jpg" align="right" width="250" height="166"
border="0"> Um den Paybox-Service nutzen zu k&ouml;nnen, ben&ouml;tigst du
eine deutsche Mobilfunknummer, ein deutsches Girokonto und einen Wohnsitz
in Deutschland. Sollte das auf dich nicht zutreffen, findest du unter
<b><u> <font color="#0000ff">www.paybox.net </font></u></b> eine
&Uuml;bersicht der L&auml;nder, in denen Paybox dar&uuml;ber hinaus
verf&uuml;gbar ist.</p>


<p>Die Einrichtung der Paybox verl&auml;uft gleichzeitig &uuml;ber das
Internet und das Mobiltelefon. Auf der Paybox-Website gibst du deine
Handy-Nummer ein, das Mobiltelefon sollte dabei empfangsbereit gehalten
werden. Klicke dann nach der Eingabe auf den &quot;O.K.Call
Me&quot;-Button. Paybox ruft dich dann automatisch an.</p>

<p>

<b>Schritt 1:</b><br>

Du wirst nun aufgefordert, eine selbst gew&auml;hlte PIN in das Handy
einzugeben und diese zu best&auml;tigen. Danach gibst du deinen Namen an.
Du kannst dich nun jederzeit auf der Paybox-Website im pers&ouml;nlichen
Bereich (my paybox) einloggen. F&uuml;r Zahlungen ist die Paybox aber noch
nicht freigeschaltet.</p>

<p>

<b>Schritt 2:</b><br>

Zum Empfangen der Zahlungen per Handy gibst du nun die Adresse und das
Girokonto an. Paybox schreibt zuk&uuml;nftig alle an deine Mobilfunknummer
gesendeten Betr&auml;ge deinem Konto gut. </p>

<p>

<b>Schritt 3:</b><br>

Um per Handy bezahlen zu k&ouml;nnen, ben&ouml;tigt Paybox von dir weitere,
f&uuml;r Finanztransaktionen &uuml;bliche Angaben, die, laut Firmenangaben,
vertraulich behandelt werden. Daf&uuml;r f&uuml;llst du online ein Formular
aus, welches du dann ausdrucken und per Fax oder Post an Paybox senden
kannst. Paybox gew&auml;hrt einen Sofort-Verf&uuml;gungsrahmen in H&ouml;he
von 50 EUR. Du kannst also sofort per Handy bezahlen oder Geld senden. Per
Post erhalten wir nach Eingang des Schreibens von Paybox aus
Sicherheitsgr&uuml;nden eine neue PIN. Diese kann nun jederzeit selbst
ge&auml;ndert werden. &quot;Unsere&quot; Paybox ist nun eingerichtet. Von
jetzt ab kannst du jederzeit mit dem Handy Geld senden, empfangen und
bezahlen.</p>

<p>Der Ablauf einer Zahlung mit Paybox gestaltet sich
folgenderma&szlig;en:
<ul>
<li> <b>Schritt 1:</b><br> Du bestellst die Ware online.</li>

<li> <b>Schritt 2:</b><br> Der Shop-Betreiber ruft bei Paybox an und
l&auml;sst sich deine Mobilrufnummer best&auml;tigen.</li>

<li> <b>Schritt 3:</b><br> Ein Sprachcomputer ruft bei dir an und</li>

<li> <b>Schritt 4:</b><br> l&auml;sst sich Betrag und Empf&auml;nger per
vierstelliger PIN best&auml;tigen.</li>

<li> <b>Schritt 5:</b><br> Der H&auml;ndler verschickt die Ware.</li>

<li> <b>Schritt 6:</b><br> Paybox begleicht die Rechnung und bucht das Geld
von deinem Giro-Konto ab. </li></ul></p>

<h3><b>Sicherheit</b></h3>
    
<p><b>Sicherheitsstufen</b><br>

Das Handy als Geldb&ouml;rse ist mit drei Sicherheitsstufen gegen
Missbrauch gesch&uuml;tzt:

<dl> <dt>Damit ein Unbefugter mit &quot;deiner&quot; Paybox bezahlen kann,
ben&ouml;tigt dieser </dt>

<dd>Stufe 1: dein Handy, denn alle Zahlungen mit Paybox sind an die
Mobilfunknummer gebunden. </dd>

<dd>Stufe 2: Jedes Mobiltelefon ist dar&uuml;ber hinaus mit einer PIN
gesch&uuml;tzt. </dd>

<dd>Stufe 3: Jede Transaktion bei Paybox kann nur autorisiert werden, wenn
eine zweite PIN eingegeben wird. Die Eingabe deiner pers&ouml;nlichen
PIN-Codes erfolgt ausschlie&szlig;lich &uuml;ber das Mobilfunknetz und
nicht &uuml;ber das vergleichsweise &quot;unsichere&quot; Internet.
</dd></dl>

Anhand dieser Sicherheitsvorkehrungen kann ein Missbrauch
&quot;deiner&quot; Paybox mit sehr gro&szlig;er Wahrscheinlichkeit
ausgeschlossen werden.</p>

<p><b>Verlust des Handys</b><br>

F&uuml;r den Fall, dass dein Mobiltelefon abhanden kommt, solltest du
unbedingt deinen Netzanbieter anrufen und die Mobilfunknummer sperren
lassen. Sobald die Mobilfunknummer gesperrt ist, ist auch ein
Paybox-Missbrauch nicht mehr m&ouml;glich. Als zweiten Schritt solltest du
danach deine Paybox direkt sperren. Dies ist m&ouml;glich unter der
Telefonnummer 01805-paybox (01805-729269). </p>

<p><b>Missbrauch der Paybox</b><br>

Bei einer missbr&auml;uchlichen Benutzung der Paybox musst du, sofern du
eine Meldung an die Paybox Deutschland AG gemacht hat, f&uuml;r
Sch&auml;den nicht haften. Dein Konto wird also nicht belastet. F&uuml;r
Sch&auml;den, die vor der Benachrichtigung von Paybox entstehen, haftest du
in H&ouml;he von 50 EUR. Die Haftung entf&auml;llt, sofern du nachweist,
die Sorgfaltspflichten nicht grob fahrl&auml;ssig oder vors&auml;tzlich
verletzt zu haben. </p>

<p><b>Zahlungen autorisieren</b><br>

Jede Zahlung &uuml;ber Paybox wird erst dann freigegeben, wenn du den
Betrag mit deiner PIN best&auml;tigt hast. Die Daten, wie Kontonummer und
Bankleitzahl, oder Paybox-Nummer des Empf&auml;ngers werden von Paybox nach
jeder Eingabe wiederholt, sodass du nochmals in Ruhe die Richtigkeit der
Angaben vor der Best&auml;tigung &uuml;berpr&uuml;fen kannst.</p>

<p><b>Nicht-Zustandekommen einer Zahlung</b><br>

Sollte es einmal vorkommen, dass ein Geldbetrag vom Empf&auml;nger nicht
abgeholt wird, so verf&auml;llt der Auftrag nach 30 Tagen. Du erh&auml;lst
dann per SMS und/oder E-Mail eine Benachrichtigung, dass der
Zahlungsauftrag nicht ausgef&uuml;hrt wurde. </p>

<h3><b>Anwendungen</b></h3>

<img src="onl_paybox3.jpg" align="right" width="200" height="181" border="0">
Folgende Anwendungen stehen dir als Paybox-Kunde zur Verf&uuml;gung:

<ul><li><b>Geld anfordern</b><br>

F&uuml;r diesen Service gibst du die Paybox- bzw. Mobilfunknummer des
&quot;Zahlers&quot; und den gew&uuml;nschten Betrag ein. Wird die Zahlung
durch den Zahler autorisiert, erh&auml;lst du sofort eine Best&auml;tigung
per SMS. Das Geld wird dann automatisch deinem Girokonto gutgeschrieben.
</li>

<li> <b>Geld senden</b><br>

- <b>per Internet</b><ul>

<li> Mobilfunknummer oder Bankverbindung des Empf&auml;ngers eingeben. </li>
<li> Den zu &uuml;berweisenden Betrag eintragen. </li>
<li> Pers&ouml;nliche Paybox-Nummer eingeben. </li>
<li> &quot;O.K. Call me!&quot;-Button anklicken. Paybox ruft dann dein
Handy an und wiederholt Betrag und Empf&auml;nger. </li>

<li> Best&auml;tigen des Auftrags mit deiner Paybox-PIN und der Rautetaste.
</li><br></ul>

- <b>per Handy</b><ul>

<li> FreeCall 0800-6-paybox (0800-6-729269) anrufen. </li>
<li> Mobilfunk- oder Paybox-Nummer des Empf&auml;ngers eingeben, beginnend
mit dem L&auml;ndercode (z.B. 49 170 1234567), Best&auml;tigung der Eingabe
mit der Rautetaste. </li>
<li> Den zu &uuml;berweisenden Betrag eingeben, best&auml;tigen mit der
Rautetaste. </li>
<li> Best&auml;tigen des Auftrags mit deiner Paybox-PIN und der Rautetaste.
</li><br></ul></li>

<li><b>Geld abholen</b><ul>
<li> Gehe auf der Paybox-Website auf &quot;Geld abholen&quot; </li>
<li> Gib dann deine Mobilfunknummer ein. </li>
<li> Klicke auf &quot;O.K. Call me!&quot;. Paybox ruft dann dein Handy an.
</li> 
<li> Best&auml;tige den Anruf mit deiner Paybox-PIN und der Rautetaste.
</li><br></ul></li>

<li><b>Shopping</b><br>

Mit Paybox kannst du flexibel, zum Beispiel Taxi-Fahrten, Hotel-Rechnungen
oder Pizza-Lieferungen bezahlen. Welche H&auml;ndler den Service
unterst&uuml;tzen, entnehme bitte der <b><u><font
color="#0000ff">Partner-Seite von Paybox </font>
</u></b>(www.paybox.de/112.html)</li></ul>

<h3><b>Alternativen zu Paybox</b></h3>

<p><img src="onl_paybox4a.jpg" align="right" width="200" height="141"
border="0"> <b><u><font color="#0000ff">Firstgate</font></u></b>
(www.firstgate.de) <br> &quot;click&amp;buy&quot; ist ein neues
Zahlungs-System im Internet. Mit &quot;click&amp;buy&quot; k&ouml;nnen
Anbieter von Inhalten innerhalb weniger Minuten Bereiche auf ihrer Homepage
bepreisen. F&uuml;r mittelst&auml;ndische und private Internet-Nutzer
bietet Firstgate somit die M&ouml;glichkeit, Teilbereiche und Dokumente
innerhalb einer Homepage / Internetpr&auml;senz in nur wenigen Minuten
kostenpflichtig zu machen und durch Firstgate abrechnen zu lassen. <br
clear=all></p>

<p><img src="onl_paybox4b.jpg" align="right" width="200" height="141"
border="0"> <b><u><font color="#0000ff">MicroMoney</font></u></b>
(www.micromoney.de/b2c/de/_index.html)<br>

Mit MicroMoney kannst du Betr&auml;ge bis 200 DM im Internet bezahlen. Sicher,
anonym und kinderleicht. Du gibst keine pers&ouml;nlichen Daten weiter, denn
die Identifizierung erfolgt nur &uuml;ber eine PAN, den Zugangscode auf deiner
Karte und bezahlen kannst du mit nur 3 Klicks. Die MicroMoney-Card wird es
in 3 Preisklassen geben: zu 20, 50 und 100 Mark. <br clear=all></p>

<p><img src="onl_paybox4c.jpg" align="right" width="200" height="141"
border="0"> <b><u><font color="#0000ff">paysafecard </font></u></b>
(www.paysafecard.com/de/de/m_home.shtml) <br>

paysafecard ist Europas erste Prepaid Card zum Online-Shoppen, mit der du
einfach und ohne Angabe von pers&ouml;nlichen Daten im Internet einkaufen
kannst. Es gibt zwei verschiedene paysafecards:<br>

Die rote &lt; 18 Card f&uuml;r alle Jugendlichen und die Classic Card
(blau) f&uuml;r Erwachsene.<br>

Die rote &lt; 18 Card ist zu 50 Mark (EUR 25,56) und zu 100 Mark (EUR
51,13) erh&auml;ltlich und f&uuml;r den Einsatz auf nicht jugendfreien
Seiten gesperrt.<br>

Die Classic Card (blau) gibt es zu 50 Mark (EUR 25,56), 100 Mark (EUR
51,13) und zu 200 Mark (EUR 102,26). <br clear=all></p>

<p><img src="onl_paybox4d.jpg" align="right" width="200" height="140"
border="0"> <b><u><font color="#0000ff">Payitmobile </font></u></b>
(www.payitmobile.de) <br>

Die Payitmobile AG bietet &auml;hnlich wie Paybox sicheren, einfachen und
mobilen Zahlungsverkehr - ob im Web, mit WAP oder im Laden nebenan. Hinter
dem Projekt Payitmobile stehen, E-Plus, die Materna-Gruppe
(Softwareentwicklung), Accenture (Unternehmensberatung) und die GZS
(Gesellschaft f&uuml;r Zahlungssyteme). <br clear=all></p>

<p><img src="onl_paybox4e.jpg" align="right" width="200" height="141"
border="0"> <b><u><font color="#0000ff">NET900 </font></u></b>
(www.in-medias-res.com) <br>

Mit NET900 k&ouml;nnen digitale Waren und Dienstleistungen sicher und
einfach vermarktet werden. Der Internetkunde entscheidet, wie er bezahlen
will. Ob &uuml;ber Telefonrechnung oder Girokonten, mit NET900 k&ouml;nnen
auch kleinere Ums&auml;tze wirtschaftlich abgerechnet werden. <br
clear=all></p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
