<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#c0c0c0">
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wissen</b></font><br>
<font color="#000080" size="5">wie es nicht im Lexikon steht </font></center>
<table width=100% border=0 cellpadding=8>
<tr><td><hr size=4>

<p><b><font size=+1>Wie k&ouml;nnte ein wirksamer Wecker f&uuml;r
Langschl&auml;fer aussehen? </font></b> </p>

<p>Die japanische Firma Tomy hat einen Wecker patentieren lassen, der an
Raffinement nichts zu w&uuml;nschen &uuml;brig l&auml;sst. Sein Klingeln
setzt einen Mikroprozessor in Gang, der f&uuml;nf St&ouml;psel in
zuf&auml;lliger Folge herausgucken und wieder verschwinden l&auml;sst. Um
den Alarm auszuschalten muss man mit einem H&auml;mmerchen mindestens drei
St&ouml;psel treffen, bevor sie wieder abgetaucht sind. Das
voraussichtliche Ergebnis: Man ist blitzwach und hat den ersten Wutanfall
hinter sich. F&uuml;r den n&auml;chsten Morgen legt man sich vermutlich
einen Vorschlaghammer bereit. </p>

<hr size=4>

<p><b><font size=+1>Warum wird es im Freien immer leiser, w&auml;hrend es
schneit?</font></b> </p>

<p>Es liegt nicht daran, dass weniger Autos unterwegs sind. <br>

Frisch gefallener Schnee bildet viele kleine <b>Zwischenr&auml;ume</b>, in
denen sich der Schall verliert, anstatt wie sonst reflektiert zu werden.
</p>

<hr size=4>

<p><b><font size=+1>Warum gibt es in England Linksverkehr?</font></b> </p>

<p>Im Mittrelalter hielten sich die Reiter im Allgemeinen an die linke
Stra&szlig;enseite um einem eventuell entgegenkommenden Angreifer
gegen&uuml;ber gewappnet zu sein, denn so konnten sie mit der rechten Hand
ein Schwert, eine Lanze oder - in sp&auml;teren Zeiten - eine Pistole
f&uuml;hren. </p>

<p>Das gew&auml;hrleistete &uuml;ber Jahrhunderte hinweg einigerma&szlig;en
die Verkehrssicherheit und die Engl&auml;nder sehen bis heute keinen Anlass
daran etwas zu &auml;ndern. </p>

<hr size=4>

<p><b><font size=+1>Wer bekam die erste Brille, ein Kurz- oder ein
Weitsichtiger? </font></b> </p>

<p><b>Ein Weitsichtiger</b>! Die ersten Linsen, die Weitsichtigkeit
korrigierten, wurden im 13.Jahrhundert geschliffen. Sie waren konvex. </p>

<p>Die Kurzsichtigen mussten noch 200 Jahre warten. Konkave Linsen wurden
erst im 15.Jahrhundert konstruiert. Im Altertum behalfen sich die
Wohlhabenden mit Sehfehler noch anders. Sie benutzten, wie Kaiser Nero
geschliffene Edelsteine. z.B. Smaragde. </p>

<hr size=4>

<p><b><font size=+1>Warum werden unsere Haare im Alter grau? </font></b> </p>

<p>Mit zunehmendem Alter des Menschen produzieren die Zellen an den
Haarwurzeln i,mmer weniger <b>Melanine</b>, das sind die gelblichen bis
braunen oder schwarzen Pigmente. Statt der Pigmente werden winzig kleine
Luftblasen im Haar eingelagert. Sie reflektieren das Licht und lassen das
Haar wei&szlig;, grau oder silbern aussehen. </p>

<hr size=4>

<p><b><font size=+1>Bei Aluminiumfolien ist eine Seite matter als die
andere. Warum ist das so?</font></b> </p>

<p>Beim letzten Produktionsgang laufen bei der Herstellung von
Aluminiumfolie zwei Lagen durch die Walzen. Die Seite, die mit den
hochglanzpolierten Stahlrollen in Ber&uuml;hrung kommt, wird gl&auml;nzend,
die andere bleibt etwas matter. Auf die Frischhaltewirkung hat das keinen
Einfluss. </p>

<hr size=4>

<p><b><font size=+1>Warum gibt es keine singenden Frauen in der Badewanne?
</font></b> </p>

<p>Die Badezimmerkacheln reflektieren Bass- und Baritont&ouml;ne besser als
die Frequenzen von Frauenstimmlagen. Bestimmend ist hier die
<b>Nachhallzeit</b>, d.h. das Zeitintervall, in dessen Verlauf die
Schallenergiedichte im Raum auf den zehnmillionsten Teil abnimmt. Ist die
Nachhallzeit kurz, wie in diesem Fall bei h&ouml;heren Stimmfrequenzen, so
wirkt eine Schalldarbietung leer und flach. Kurz gesagt: M&auml;nnerstimmen
klingen in gekachelten R&auml;umen einfach besser. </p>

<hr size=4>

<p><b><font size=+1>Seit wann werden Eheringe getragen? </font></b> </p>

<p>Der Brauch geht auf eine r&ouml;mische Sitte zur&uuml;ck. Im antiken Rom
trugen nur die Frauen einen Ehe- oder Verlobungsring. Sie steckten ihn auf
den Mittelfinger, da man allgemein glaubte, dass von diesem Finger ein Nerv
direkt zum Herzen f&uuml;hrt. Der meist eiseren Verlobungsring galt als
Zeichen der Bindung, aber auch als Empfangsbest&auml;tigung f&uuml;r die
Mitgift. Seit dem 2.Jahrhundert v. Chr. gab es auch goldene Ringe in Form
zweier ineinander verschr&auml;nkter H&auml;nde. Erst unter
fr&uuml;hchristlichem Einfluss wurde der Ring zum Symbol von Treue und
Unaufl&ouml;slichkeit der Ehe. </p>

<hr size=4>

<p><b><font size=+1>Warum ist gerade am zweiten Sonntag im Mai Muttertag?
</font></b> </p>

<p>Weil 1907 der zweite Todestag der Mutter von Ann Jarvis auf diesen
Sonntag fiel. </p>

<p>Ann Jarvis (1864-1948) war eine amerikanische Methodistenpredigertochter
und propagierte diesen Tag als Ehrentag aller M&uuml;tter. 1914 wurde er
vom amerikanischen Kongress in einer eigenen &quot;Mother's Day Bill&quot;
zum Staatsfeiertag erkl&auml;rt. </p>

<p>In Deutschland wurde der Muttertag erstmals 1923 gefeiert. Satt der
Methodisten fand sich bei uns ein anderer Promoter: der &quot;Verband
Deutscher Blumengesch&auml;ftsinhaber&quot;.

<hr size=4>


</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td>E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td>Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
