<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>&quot;Mimik und Gestik&quot;</h2>
<hr>

<p>Textnachrichten m&uuml;ssen nicht nur auf stimmliche Nuancen verzichten,
sondern auch auf K&ouml;rpersprache. Es gibt kein Augenzwinkern, das
anzeigt, da&szlig; man scherzt, kein Schulterzucken, um Ratlosigkeit
anzuzeigen. </p>

<p>Obgleich man diese Gesten in Texten nicht direkt vermitteln kann, gibt
es einige Zeichen, mit denen man Gesten simulieren kann. </p>

<h3>Smileys</h3>

<p>Mimik kann durch sogenannte "Smileys" oder "Emoticons" vermittelt
werden: dies sind kleine "Zeichnungen", die Gesichtsausdr&uuml;cke
wiedergeben. Dies sind die drei bekanntesten und beliebtesten: </p>

<p><tt>:-) </tt></p>

<p><tt>;-)</tt></p>

<p>und</p>

<p><tt>:-(</tt></p>

<p>(Um diese Zeichen zu verstehen, drehen Sie den Monitor im Uhrzeigersinn:
dann sehen Sie kleine Gesichter.) </p>

<p>Was die beiden oberen Smileys bedeuten, ist nicht ganz einheitlich: ich
verstehe unter dem obersten: "Ich bin fr&ouml;hlich." und dem unteren "Ich
denke, ich bin lustig." Den untersten versteht jeder als: "Ich bin
traurig." (<i>Dieser Interpretation schlie&szlig;e ich mich an, Anm. d.
&Uuml;.</i>) </p>

<p>Hier einige typische Beispiele:</p>

<p><tt>Hey, ich habe die &Uuml;bersetzung vor der Zeit geschafft! :-) Jetzt
werde ich reich und ber&uuml;hmt! ;-)</tt></p>

<p>Der zweite Smiley ;-) deutet an, da&szlig; Sie nicht wirklich daran
glauben, mit dieser &Uuml;bersetzung Geld zu verdienen. Einen
&auml;hnlichen Effekt erzielen Sie mit einer Wendung wie "sch&ouml;n
w&auml;rs" am Ende des Satzes: </p>

<p><tt>Hey, ich habe die &Uuml;bersetzung vor der Zeit geschafft! :-) Jetzt
werde ich reich und ber&uuml;hmt - sch&ouml;n w&auml;rs! </tt></p>

<p>Es gibt eine gro&szlig;e Auswahl von diesen &quot;ASCII-Gesten&quot;,
von krank (%^P) &uuml;ber w&uuml;tend (&gt;:-&lt;) bis erstaunt (:-o),
Ihrer Fantasie sind dabei keine Grenzen gesetzt! Sollte es Ihnen an
Fantasie mangeln, gibt es auch diverse Smiley-W&ouml;rterb&uuml;cher (wobei
es auch hier wieder Unterschiede in der Interpretation gibt). </p>

<h3>Pausen</h3>

<p>Stellen Sie sich vor, da&szlig; Sie jemand auf dem Flur fragen, ob man
nicht den roten Knopf dr&uuml;cken k&ouml;nne. Man sagt darauf Ihnen: "Nun
ja", macht eine Pause, kratzt sich am Kopf, um dann fortzusetzen, "Nun ja,
vielleicht explodiert es nicht." Sie haben jetzt die Information bekommen,
da&szlig; es in der Tat eine sehr schlechte Idee w&auml;re, den
entsprechenden Knopf zu dr&uuml;cken, obgleich der Satz: </p>

<p><tt>Vielleicht explodiert es nicht.</tt></p>

<p>relativ wenig Informationen birgt. Ich nutze gern Leerzeichen und
geschriebenes Gemurmel, das Nachdenken suggeriert, wie im folgenden: </p>

<p><tt>Nuuunnnn.... jaaaa &auml;&auml;&auml;hhh. Nuuuunnnn jaaa, es
explodiert *vielleicht* nicht. </tt></p>

<p>Sie k&ouml;nnen Leerzeichen auch dazu ben&uuml;tzen, um den Zusammenhang
zwischen S&auml;tzen zu verdeutlichen. Das folgende Beispiel verdeutlicht
das Problem: </p>

<p><tt>M&ouml;chten Sie eine Maus f&uuml;r Linksh&auml;nder oder eine
f&uuml;r Rechtsh&auml;nder mit einer Taste oder mit zwei Tasten? </tt></p>

<p>Manche benutzen f&uuml;r solche Situationen eine Aufz&auml;hlung: </p>

<p><tt>M&ouml;chten Sie 1. eine Maus f&uuml;r Linksh&auml;nder oder 2. eine
f&uuml;r Rechtsh&auml;nder a) mit einer Taste b) mit zwei Tasten? </tt></p>

<p>Das einzige Problem, das es dabei gibt, ist, da&szlig; viele Menschen
dies als Einladung sehen, nur einen Code als Antwort zu senden: 2b. </p>

<p>Um dies zu umgehen, k&ouml;nnen Sie diese Struktur benutzen:</p>

<p><tt>M&ouml;chten Sie<br> eine Maus f&uuml;r Linksh&auml;nder
<br>oder<br> eine f&uuml;r Rechtsh&auml;nder mit einer Taste <br>oder<br>
eine f&uuml;r Rechtsh&auml;nder mit zwei Tasten? </tt></p>

<p>Dies l&auml;dt dazu ein, einfach "auszuschneiden und einzusetzen":</p>

<p><tt>&gt;eine f&uuml;r Rechtsh&auml;nder mit zwei Tasten?</tt></p>

<h3>Kreative Interpunktion</h3>

<p>Ich benutze gern viele Satzzeichen in einer Art "Comic-Sprache".
Anstelle von: </p>

<p><tt>Ich bin sehr erstaunt und etwas ver&auml;rgert. Warum hast Du meinen
Artikel R&uuml;diger gegeben und nicht Gesche? </tt> </p>

<p>Schreibe ich:</p>

<p><tt>?!?! Warum hast Du meinen Artikel R&uuml;diger gegeben und nicht
Gesche ?!?! </tt> </p>

<p>Das Fragezeichen ist ein Symbol f&uuml;r eine hochgezogene Augenbraue
oder ein "Hee?". Das Ausrufezeichen zeigt Erstaunen oder auch ein etwas
w&uuml;tendes Gesicht. Zusammen bedeuten diese Zeichen starkes Erstaunen.
</p>

<p>Dar&uuml;ber hinaus gibt es eine lange Tradition der Platzhalter
f&uuml;r Schimpfworte, wie z.B. #%?$(*! Manchmal sieht man auch, da&szlig;
einige Buchstaben durch Sterne ersetzt werden, wie z.B.: A****loch. (Heute
neigt man dazu, entweder das Wort auszusprechen, oder gar nicht zu
verwenden.) </p>

<p></p> <hr>


<p>Weiter zum Thema <a href="onl_email06.html">Status</a><br>
zur&uuml;ck zum Thema <a href="onl_email04.html">Ausdruck</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>

<p>Bitte beachten Sie die <a href="onl_email00.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;
</body>
</html>
