<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x12 - GoldEd 6 Studio</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0148.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x0148.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x0147.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0149.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=136 HEIGHT=25 SRC="../images/_software_.gif" ALT="[Software]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0148.html">GoldEd 6 Studio</A> | <A HREF="0x0149.html">YAM 2.0</A> | <A HREF="0x014A.html">MuiWheel V1.2</A> | <A HREF="0x014B.html">MidToFront V2.1</A> | <A HREF="0x014C.html">FreeMouse V1.0</A> | <A HREF="0x014D.html">DCoMMB V1.5</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x0143.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0144.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0145.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0146.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0147.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0148.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x014E.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x014F.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0150.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0151.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0152.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>GoldEd 6 Studio - Testbericht von Thomas Aglassinger</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Seit etlichen Jahren schon ist GoldEd einer der beliebtesten Texteditoren
f&uuml;r den Amiga. Inzwischen steht uns die sechste Version ins Haus.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Grundlegendes</B></H3>&nbsp;

<BR>GoldEd ist ein Editor zum bearbeiten von reinen Texten in ASCII bzw. ISO Latin-1. Damit eignet
er sich zum Erstellen von Quellcodes in diversen Programmiersprachen, bearbeiten von Befehldateien
und kurzen, unformatierten Texten wie E-Mail, aber auch zum Erstellen von AmigaGuide- und
HTML-Dokumenten.<BR CLEAR=ALL>

<BR>Der Editor stellte &uuml;ber ARexx eine beachtliche Anzahl von Befehlen zur Verf&uuml;gung.
Diese kann man aber nicht nur &uuml;ber ARexx schicken, sondern auch Tasten und Men&uuml;s zuweisen.
Nat&uuml;rlich ist das bei den gelieferten Voreinstellungen schon zur gen&uuml;ge gemacht worden,
soda&szlig; man ohne gro&szlig;es Herumkonfigurieren loslegen kann. Installer sei Dank.<BR
CLEAR=ALL>

<BR>Die Konfiguration geschieht nicht &uuml;ber kryptische Dateien, in die man unreflektiert
abstruse Zeichenketten schreibt, sondern &uuml;ber komfortable Dialoge. Im Unterschied zu
&auml;lteren Versionen ist es m&ouml;glich, Konfigurationen zu kombinieren. So kann man sich z.B.
eine Standardtastaturbelegung machen, um dann zum Bearbeiten von C-Programmen ein paar
zus&auml;tzliche Tasten zu belegen. &Auml;ndert man jetzt in der Standardbelegung eine Taste, so hat
das auch auf die C-Belegung diesielbe Auswirkung. Gleiches gilt nat&uuml;rlich auch f&uuml;r
Men&uuml;s, Toolbars und viele andere Elemente.<BR CLEAR=ALL>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>&quot;Pfui Gack - Fast wie Windows!&quot;</B></H3>&nbsp;

<BR>Eine Sache, die viele Leute zu erschrecken scheint, ist, da&szlig; GoldEd sehr mit Windows
kokettiert. F&uuml;r die meisten Amiganer scheint sowas ideologisch nicht tragbar. Zwar war GoldEd
schon immer eine Ansammlung von Zitaten aus verschiedenen Lagern: von MacOS kam z.B. das Piktogramm
von GoldEd 4, und das &quot;?&quot;-Men&uuml; f&uuml;r die Hilfe gibt es noch immer. Dennoch nimmt
inzwischen Windows ein Gro&szlig; der Anspielung f&uuml;r sich in Kauf.<BR CLEAR=ALL>

<BR>Anscheinend hat der Autor einem m&ouml;glichst einfachen Weg gesucht zu haben, ein Amiga Produkt
in die kommerziell interessanten Windows-Markt zu bringen, ohne die alte Amiga-Benutzerschaft zu
entsorgen. Die L&ouml;sung sieht dann so aus: GoldEd l&auml;uft nur unter AmigaOS, hat aber eine
Oberfl&auml;che, die in vielen Dingen der von Windows &auml;hnelt. Dadurch soll es f&uuml;r
Windows-Benutzer leichter sein, GoldEd unter einem Emulator wie UAE zu verwenden. Letzteres
h&ouml;rt sich vielleicht etwas absurd an. Diverse Features von UAE, wie dem Zugriff des Emulators
auf Windows-Dateien, k&ouml;nnten dieses aber ertr&auml;glich machen. Zumindest mehr als das
Windows-Notepad.<BR CLEAR=ALL>

<BR>Nachdem ich gottlob einen echten Amiga verwende stand letzteres gar nicht zur Debatte. Man
konnte aber kurz nach der Ver&ouml;ffentlichung von GoldEd 5 vieler Orts Gejammer &uuml;ber die
Bastard-GUI h&ouml;ren. Inzwischen hat sich der Autor einiger dieser Probleme angenommen,
insbesondere:<BR CLEAR=ALL>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Ausschalten kann man die omnipr&auml;senten, meist viel zu bunten und Platz fressenden Piktogramme in Listen und Dialogen<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Ausschalten kann man das Context-Menu, das mittels der rechten Maustaste im Editorfenster kommt.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Eine Option l&auml;&szlig;t ein paar Eingabefelder wieder wie die alte GadTools aussehen. Die Hintergr&uuml;nde in Texteingabefeldern kann man auch auf grau statt wei&szlig; stellen.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Die krankhaft knalligen Toolbar-Piktogramme kann man pauschal in Graustufen zeichnen lassen. Oder ganz als Text darstellen.<BR>
</TD></TR></TABLE>&nbsp;

<BR>Die Terminologie wie &quot;Studio&quot;, &quot;Service Pack&quot;, &quot;Registry&quot; etc ist
zwar ungewohnt wenn man sonst &uuml;berall &quot;Magic&quot;, &quot;Update&quot; und
&quot;Preferences&quot; hat, wirkt sich aber auf das praktische Arbeiten kaum aus.<BR CLEAR=ALL>

<BR>Als sehr st&ouml;rend empfand ich nur, da&szlig; der Zwischenspeicher in Texteingabefeldern (wie
in Windows) mittels Control-C und Control-V angesprochen wird. Bekanntlich unterst&uuml;tzt das
GadTools-Feld normalerweise gar keinen Zwischenspeicher. De facto hat aber jeder ernsthafte Amiganer
einen Patch (&quot;EditHook&quot;) laufen, der diese Funktionen Styleguide-konform &uuml;ber Amiga-C
und Amiga-V nachr&uuml;stet. So ein Patch funktioniert in GoldEd aber nicht, da das Eingabefeld
Marke Eigenbau ist. Daher gibt es nur die inkonsistenten Tastaturkurzbefehle mittels Control-Taste.
Und das kann einem leider an dem Rande des Wahnsinns treiben.<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=454 HEIGHT=118 ALT="[replace]" SRC="../images_12/replace.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=454>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Im Vergleich: GadTools-alike und Windows-Emulation
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Manche Dinge hingegen kann man ohne gro&szlig;e Vorbehalte gut hei&szlig;en: das Symbol zum
&auml;ndern der Fenstergr&ouml;&szlig;e in Dialogen ist kleiner und nicht Teil des Rahmens, wodurch
Fenster kompakter und ruhiger wirken. Die Toolbars kann man nach Lust und Laune durch Drag&amp;Drop
neu anordnen. In Fensterleisten finden sich oft zus&auml;tzliche Symbole: Ein &quot;?&quot; erlaubt
es, durch klicken auf ein bestimmtes Feld eine kurze Hilfe zu erhalten (vgl. auch MUI, nur ist
GoldEd hier weniger penetrant) . Ein &quot;x&quot; erm&ouml;glicht, einen Dialog auf den Bildschirm
zu &quot;kleben&quot;, soda&szlig; er beim beenden durch &quot;Ok&quot; nicht geschlossen wird
(Obwohl, f&uuml;r Windioten mu&szlig; das furchtbar sein; die schlie&szlig;en ja normalerweise ein
Fenster mit &quot;x&quot;). Viele GUI-Elemente wie Register und Listenb&auml;ume, die es im AmigaOS
offiziell nicht gibt, werden in GoldEd reichlich verwendet, und erh&ouml;hen in der Regel den
Bedienungskomfort.<BR CLEAR=ALL>

<BR>Endlich kann bei den meisten Fenstern und Dialogen die Gr&ouml;&szlig;e ver&auml;ndert werden.
Wer einmal mit &auml;lteren Versionen gearbeitet hat, kennt das Gef&uuml;hl: Da hat man angenehme
1024 Pixel Platz, und dann &ouml;ffnet der Editor eine Liste auf 300 Pixel, in der man herumrollen
kann wie Sissiphus zu seien besten Zeiten. <LUTZ>Wie schreibt man den komischen Sissiphus
wirklich?</LUTZ> Angenehm auch, da&szlig; sich der Editor die Gr&ouml;&szlig;e der Fenster merken
kann. Weniger sch&ouml;n, da&szlig; er sich die Position nicht merkt, und beim n&auml;chsten mal das
Fenster wider in der Mitte des Bildschirms daherkommt. (Das Problem betrifft nat&uuml;rlich nicht
die Fenster zum bearbeiten des Textes, sondern nur die Dialoge f&uuml;r die Kommunikation mit dem
Benutzer au&szlig;erhalb des Textes.)<BR CLEAR=ALL>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Dateitypen</B></H3>&nbsp;

<BR>Eine der angenehmsten F&auml;higkeiten ist die Unterst&uuml;tzung mehrere Dateitypen. Damit ist
es dem Editor m&ouml;glich, sich in bestimmte Dingen dem Text anzupassen. Dazu geh&ouml;ren das
farbig Darstellen verschiedener Textteile (syntax coloring), Men&uuml;s und Tastaturbelegung,
Toolbars und vieles mehr. Nat&uuml;rlich k&ouml;nnen verschiedene Dateitypen zugleich bearbeitet
werden. Es ist sogar m&ouml;glich, verschiedene Typen auf unterschiedlichen Bildschirmen zu haben.
Praktisch ist es z.B., AmigaDOS-Skripten auf der Workbench zu bearbeiten, w&auml;hrend C-Programme
auf einem eigener Bildschirm erscheinen.<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=400 HEIGHT=280 ALT="[arexx]" SRC="../images_12/arexx.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=400>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Ein Dateityp mit Toolbar und einem &quot;Container&quot; f&uuml;r die Kurzhilfe
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Dateitypen gibt es f&uuml;r alles m&ouml;gliche, z.B.:<BR CLEAR=ALL>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> C/C++. F&uuml;r SAS/c und StormC sind erweiterte Umgebungen vorhanden, die eine bessere Integration mit dem Compiler erlauben.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> ARexx. Die langerwartet Unterst&uuml;tzung wurde k&uuml;rzlich nachgereicht. Da kommt Freude auf.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> AmigaGuide. Erleichtert das Erstellen von Online-Hilfen ungemein. Meiner Meinung nach einer der gelungensten Modi.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Joyce, eine Rechtschreibkontrolle basierend auf dem weit verbreiteten ISpell. Eher nur f&uuml;r gut ausger&uuml;stete Systeme, was aber in der Natur der Sache liegt. Unterst&uuml;tzt sowohl Deutsch als auch Englisch. Andere Sprachen kann man zwar einbinden, arten aber in obkure CLI-Spiele und Manpages aus.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> HTML-Dokumente. Hier fand ich nur die Voreinstellung zu &uuml;berladen und verspielt.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Ein Thesaurus, basierend auf dem Roget's Thesaurus aus dem Projekt Gutenberg. Nachdem das Ding &uuml;ber 100 Jahre alt ist, hat es heute nur mehr beschr&auml;nkten Nutzen. Viele moderne Begriffe fehlen, daf&uuml;r findet man etliche vorgeschlagene W&ouml;rter nicht einmal mehr im Webster's Dictionary.<BR>
</TD></TR></TABLE>&nbsp;

<BR>Bis vor kurzem war die Erkennung von Dateitypen an Dummkonzepte wie MIME und Windows angelehnt:
&quot;Dateiendung rulez!&quot;. F&uuml;r viele Dinge ist das unzureichend. Jetzt gibt es endlich
auch erweiterte Regeln, die eine Datei nach bestimmten Zeilen oder Zeichen untersuchen k&ouml;nnen.
Damit kann man nun endlich ARexx- und CLI-Skripte erkennen.<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=348 HEIGHT=303 ALT="[rules]" SRC="../images_12/rules.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=348>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Eine Regel, um AmigaGuide Dokumente zu erkennen.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Neu ist auch der <TT>generic.parser</TT>. Dabei handelt es sich um einen Syntax Parser, bei dem
man die &quot;Grammatik&quot; einer Programmiersprache &uuml;ber ein paar simple Dialoge einstellen
kann. Das ist zwar nicht so flexible wie ein h&auml;ndisch &quot;ausprogrammierter&quot; Parser in
C, aber daf&uuml;r kinderleicht und f&uuml;r viele Zwecke ausreichend.<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=348 HEIGHT=303 ALT="[parser_setup]" SRC="../images_12/parser_setup.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=348>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Eine neue Syntax ist schnell definiert. Hier die Struktur eines ARexx Programms.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Leider sind einige Features nicht in das Konzept der Dateitypen integriert, obwohl sie es sein
sollten. Die Klammer&uuml;berpr&uuml;fung zieht Escape-Sequence nicht in Betracht. Folgender
C-Befehl z.B. liefert ein &quot;Too many closing brackets&quot;:<BR CLEAR=ALL>

<BR><TT> printf(&quot;\&quot;&quot;); </TT><BR CLEAR=ALL>

<BR>Gleiches gilt f&uuml;r sogenannte Scanner, die verwendet werden, um einen Text nach bestimmten
Dingen zu durchsuchen. In einem C-Quellcode kann das eine Liste der deklarierten Funktionen sein, in
einem Autodoc die einzelnen beschriebenen Seiten, in einem AmigaGuide-Dokument die Knoten.<BR
CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=257 HEIGHT=239 ALT="[scanner]" SRC="../images_12/scanner.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=257>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Eine Funktionsliste, erstellt von einem externe Scanner
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Sch&ouml;n ist, da&szlig; man mittels der Scanner ein Verzeichnis &uuml;ber mehrere Dateien
hinweg anlegen kann (vgl. XRef). Anschlie&szlig;end kann man &uuml;ber Dateigrenzen hinweg
Fundstellen anspringen. Der Editor erlangt damit praktisch Hypertext-F&auml;higkeiten. Leider wird
dabei aber nur ein globaler &quot;Name Space&quot; unterst&uuml;tzt.<BR CLEAR=ALL>

<BR>Zur Verdeutlichung ein Beispiel in Eiffel: wenn eine Klasse <TT>list.e</TT> und eine andere
Klasse <TT>tree.e</TT> beide eine Routine <TT>remove</TT> haben, hat der Editor keine Ahnung, welche
Funktion bei einem Aufruf wie <TT>sepp.remove(...)</TT> gemeint ist. Selbst dann nicht, wenn zwei
Zeilen weiter oben die Deklaration <TT>sepp: LIST;</TT> steht. In Chaos-Sprachen wie C existiert
dieses Problem nat&uuml;rlich nicht, weil sowieso alles in einem Name Space steht (was
nat&uuml;rlich <I>kein</I> Pluspunkt dieser Sprache ist).<BR CLEAR=ALL>

<BR>Weiters sind die Scanner f&uuml;r viele Dinge zu primitiv, weil immer nur genau eine Zeile
sichtbar ist. So ist es unm&ouml;glich, einen gr&ouml;&szlig;eren Zusammenhang aufzubauen. Infolge
erkennt z.B. der Scanner f&uuml;r C-Funktionen nur Deklarationen, die einem bestimmten Stil
entsprechen. Hier hilft manchmal nur das komplette neuformatieren mit einem Indent-Werkzeug (was dem
Aufwand von einem Tastendruck entspricht). F&uuml;r machen Dinge aber ist es schier unm&ouml;glich,
einen Scanner zu schreiben (z.B. eine Eiffel Short Form), obwohl es ansich trivial w&auml;re, einen
kompletten Parser zu machen.<BR CLEAR=ALL>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Blockoperationen</B></H3>&nbsp;

<BR>Blockoperationen sind massig vorhanden. So ist es m&ouml;glich, Bl&ouml;cke zeichen-, zeilen-
oder spaltenweise zu markieren - wahlweise per Tastatur oder Maus. Mit der Maus mu&szlig; nur die
Shift- oder Alt-Taste gedr&uuml;ckt sein, um Zeilen oder Spalten zu w&auml;hlen.<BR CLEAR=ALL>

<BR>Au&szlig;er Standardaufgaben wie L&ouml;schen, Kopieren und Verschieben von Bl&ouml;cken kann
man sie auch formatieren (recht/linksb&uuml;ndig, zentriert oder im Blocksatz), die Einr&uuml;ckung
ver&auml;ndern, Texte in jeder Zeile des Blocks einf&uuml;gen oder anh&auml;ngen und einiges mehr.
Zu guter letzt ist auch m&ouml;glich, Dinge wie Suchen und Ersetzen nur auf den markierten Block
anzuwenden.<BR CLEAR=ALL>

<BR>Zur Verdeutlichung eine kleine Bildfolge, wie man einen Text in ein ARexx-Skript umwandelt, das
ihn ausgibt:<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=383 HEIGHT=76 ALT="[orausch1]" SRC="../images_12/orausch1.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=383>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Der Text, nichts als der reine Text, sowahr mir ISO 8859-1 helfe.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=383 HEIGHT=76 ALT="[orausch2]" SRC="../images_12/orausch2.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=383>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Block zeilenweise markieren (Shift + Linker Mausknopf)
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=383 HEIGHT=76 ALT="[orausch3]" SRC="../images_12/orausch3.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=383>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Text in jeder Spalte des Blocks einf&uuml;gen bzw. am Ende jeder Zeile anh&auml;ngen (Menu &quot;Block/Edit block/Insert text column&quot; und &quot;Block/Edit block/Append text&quot;)
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=383 HEIGHT=77 ALT="[orausch4]" SRC="../images_12/orausch4.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=383>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Schon ganz gut. Aber halt: Gro&szlig;buchstaben sind h&auml;&szlig;lich... Die m&uuml;ssen weg!
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=383 HEIGHT=77 ALT="[orausch6]" SRC="../images_12/orausch6.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=383>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Leicht gemacht: vertikalen Block markieren (Alt + linker Mausknopf) und in Kleinschrift umwandeln (Menu &quot;Block/Convert to lowercase&quot;)
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=382 HEIGHT=89 ALT="[orausch7]" SRC="../images_12/orausch7.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=382>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Kommentar in erste Zeile, Speichern als &quot;.rexx&quot; - Voila!
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Im Unterschied zu fr&uuml;heren Versionen kann GoldEd inzwischen auch mit vertikalen
Bl&ouml;cken so umgehen, wie man es erwartet. Nur beim Einf&uuml;gen mu&szlig; man aufpassen,
da&szlig; man auch wirklich &quot;Block/Clipboard &middot; Paste/As column&quot; anw&auml;hlt.<BR
CLEAR=ALL>

<BR>Gew&ouml;hnungsbed&uuml;rftig ist die Tatsache, da&szlig; es zwei verschiedene Bl&ouml;cke gibt:
einen im Editorfenster, und einem im Zwischenspeicher. Fast alle oben beschriebenen Operationen
arbeiten mit ersterem, was sinnvoll ist, da er sichtbar ist und die Auswirkungen eines Befehls
sofort am Bildschirm erkennbar sind. Letzterer ist in erster Linie f&uuml;r den Austausch von Daten
mit anderen Anwendungen zust&auml;ndig. Leider findet sich in diesem Zusammenhang eine der
schlimmeren Styleguide-Affronts: Amiga-C kopiert nicht den Fensterblock in den Zwischenspeicher,
sondern an die Cursorposition. Eine Kopie im Zwischenspeicher mu&szlig; man stattdessen mit der
hierf&uuml;r obskuren Kombination Amiga-Y erzeugen.<BR CLEAR=ALL>

<BR>L&auml;stig: ein &quot;Undo&quot; l&ouml;scht die Blockmarkierung. Und nach dem Kopieren ist
immer noch der alte Block aktiv, anstatt die Kopie zu markieren. Das ist wenig sinnvoll, denn in der
Regel will man die Kopie gleich weiterbearbeiten (z.B Einr&uuml;ckung &auml;ndern oder ein Wort im
Block ersetzen).<BR CLEAR=ALL>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Tabulatoren</B></H3>&nbsp;

<BR>Eines der gro&szlig;en Dramen rund um GoldEd war das der Tabulatoren. Inzwischen scheint der
letzte Akt vor&uuml;ber, und der Vorhang bleibt hoffentlich geschlo&szlig;en.<BR CLEAR=ALL>

<BR>Zu Zeiten von GoldEd 4 mu&szlig;te sich der Autor wegen der fehlenden Unterst&uuml;tzung von
Tabs des &ouml;fteren W&ouml;rter wie &quot;Stursch&auml;del&quot; gefallen lassen. War es doch
unm&ouml;glich, mit GoldEd Makefiles f&uuml;r &quot;tolle&quot; Werkzeuge wie GNUmake zu schreiben,
die dann die Fehlermeldung<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>*** missing separator.&nbsp;&nbsp;Stop.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>ausgeben, wenn eine Zeile mit einem Leerzeichen beginnt statt mit einem Tab. Am Bildschirm sieht
ein Tab nat&uuml;rlich gleich aus wie ein Leerzeichen. Aber daf&uuml;r sind ja die drei
h&uuml;bschen Sternderl in der Fehlermeldung da: damit man was hat, wor&uuml;ber man sich freuen
kann. Soviel zum Thema Unix-Kultur.<BR CLEAR=ALL>

<BR>Inzwischen unterst&uuml;tzt der Editor Tabs nicht nur laut Dokumentation, sondern auch in der
Praxis. Wer in der Entwicklungsgeschichte (History) nachsieht, der merkt, da&szlig; es eine schwere
Geburt war. Vor allem Parser und Scanner waren auf die Tabs nicht vorbereitet, und etliche
Kleinigkeiten funktionierten auf einmal nicht mehr so wie sie sollten. Jetzt kann man aber endlich
Zeilen eingeben wie:<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 BGCOLOR="#EEEEEE" WIDTH="90%"><TR VALIGN=TOP><TD ALIGN=LEFT><TT>
<BR>[tab][tab]Alles[tab]bleibt wie [tab] es war.
<BR>
<BR></TT></TD></TR></TABLE>&nbsp;

<BR>Einziges Problem ist, da&szlig; die Tabulatoren-Konfiguration stimmen mu&szlig;. GoldEd kann
n&auml;mlich nach wie vor Tabs in Leerzeichen umwandeln und umgekehrt. Au&szlig;erdem kann die
Tab-Taste zum Herumspringen statt zum Einf&uuml;gen von Tabulator verwendet werden. Und zu guter
letzt kann man nicht nur eine fixe Tab-Gr&ouml;&szlig;e einstellen, sondern Tabulatoren an
bestimmten Spalten setzte. Das alles so hinzukriegen, wie man es haben will, ist nicht leicht. Aber
m&ouml;glich.<BR CLEAR=ALL>

<BR>An dieser Stelle sei nur angemerkt, da&szlig; Konzept von Tabulatoren im ASCII-Text ein
idiotisches ist. Das Grundproblem besteht darin, da&szlig; der Text per Definition WYSIWYG ist -
jedes eingegebene Zeichen erscheint genau dort, wo es eingeben wurde. Tabulatoren entsprechen aber
mehreren Zeichen, und es wird nirgends klar definiert, wievielen.<BR CLEAR=ALL>

<BR>Das scheint auf den ersten Blick praktisch, weil sich dann jeder aussuchen kann, wie gro&szlig;
er seine Tabs haben will. Solange man das nur am Zeilenanfang macht, funktioniert es sogar halbwegs.
Dies entspricht dann aber nicht mehr dem &quot;physikalischen&quot; WYSIWYG-Prinzip, sondern einem
logischen Layout, da&szlig; der Benutzer jederzeit &auml;ndern kann. Wobei sich die &Auml;nderung
auf den ganzen Text auswirkt.<BR CLEAR=ALL>

<BR>Au&szlig;erdem gibt es viele schlaue Editoren, die glauben, die Weisheit mit dem L&ouml;ffel
gefressen zu haben, und behaupten: &quot;1 Tab = 8 Leerzeichen&quot;. Dann kommt aber der andere und
sagt &quot;1 Tab = 4 Leerzeichen&quot;. Und bumm, niemand kann mehr was lesen ohne den Text
vollkommen neu zu formatieren.<BR CLEAR=ALL>

<BR>Auf konzeptioneller Ebene ist dieses Problem gar nicht l&ouml;sbar. Der auf lange Sicht einzig
sinnvolle Weg ist, sich vom primitiven ASCII-Editor zu verabschieden, hin zum Strukturierten Editor,
wobei hier nat&uuml;rlich auch die Programmiersprache angepa&szlig;t werden mu&szlig;. Lesestoff
f&uuml;r Interessierte gibt's bei <A HREF="#[1]">[1]</A>.<BR CLEAR=ALL>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Projektverwaltung? Kann man das essen, oder ist es ansteckend?</B></H3>&nbsp;

<BR>Wenn sich ein Editor pl&ouml;tzlich Studio nennt, dann will man meinen, da&szlig; er nicht nur
hilft, einzelnen Texte zu erstellen, sondern auch, selbige zu verwalten. GoldEd hat zwar einige
Features, die es erleichtern, mit mehreren Texten gleichzeitig herumzuwurschteln, von einer echten
Projektverwaltung kann man aber nicht sprechen.<BR CLEAR=ALL>

<BR>Zum einen kann man Sitzungen (&quot;Sessions&quot;) speichern, die sich alle Dateinamen merken,
die zur Zeit im Speicher sind. Beim Start kann man dann den Namen der Session als Parameter angeben,
und alle Dateien werden geladen. &Uuml;ber Inhalt und Funktion der Dateien wird dabei aber nirgends
reflektiert.<BR CLEAR=ALL>

<BR>Einen anderen Weg geht das Explorer-Plugin. Es durchsucht einfach ganze Verzeichnisse nach
Dateien mit bestimmten Namensmustern und f&uuml;hrt sie in einer Liste am Bildschirmrand an. Die
Anname dabei ist, das alle Datei eines Musters wichtig sind, und alle anderen nicht.<BR CLEAR=ALL>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=573 HEIGHT=288 ALT="[explorer]" SRC="../images_12/explorer.png"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=573>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Der Explorer zeigt am rechten Rand alle HTML-Dateien an. Wahlweise kann man sich auch GIF- und JPEG-Bilder auff&uuml;hren lassen.
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Durch Klick auf einen Namen wird der Text ge&ouml;ffnet. Manchmal gibt es noch weitere
Operationen &uuml;ber Alt-Klick. Im HTML-Modus kann man damit z.B. einen Link auf die angeklickte
Datei in den Text einf&uuml;gen. Das ist dann aber auch schon alles. Weniger angenehm: Jedes Fenster
kriegt seinen eigenen Explorer, der dann zig-mal Platz wegnimmt. Der Umstand, da&szlig; ein Iconify
zu einem Toolbar-Knopf m&ouml;glich ist tr&ouml;stet nur bedingt.<BR CLEAR=ALL>

<BR>F&uuml;r's Compilieren u.&Auml;. gibt es in den meisten Dateitypen einen &quot;Make&quot;-Knopf.
Der ist mit dem Befehl <TT>PROJECT MAKE</TT> belegt, den man wiederum in einem eigene Dialog mit
einem Makro belegen kann. Dort kann man auch Dateien angeben, die zum Projekt geh&ouml;ren.<BR
CLEAR=ALL>

<BR>Der Zusammenhang zwischen Session und Projekt ist nicht ganz klar. Beide scheinen eine
&auml;hnliche Funktion anzustreben, ohne sie wirklich zu implementieren. Die Dokumentation
erkl&auml;rt, da&szlig; externe Projektverwaltungs-Werkzeuge die im Projekt enthaltenen Dateien
abfragen k&ouml;nnen. Das manuelle Verwalten dieser Liste und das offensichtliche Fehlen von
externen Werkzeugen zwingen einem aber fast zu Un-Programmen wie <TT>make</TT>, die sich dann um den
ganzen Humbug im Editor erste recht wieder nicht k&uuml;mmern.<BR CLEAR=ALL>

<BR>Zur Verteidigung mu&szlig; aber auch gesagt werden, da&szlig; es nirgendwo etwas
Vern&uuml;nftiges zur Projektverwaltung zu geben scheint. Entweder findet man ein chaotisches Chaos
aus 65432 verschiedene Skripten in mindestens ebenso vielen Skriptsprachen vor, oder man hat
inflexible Werkzeuge, die meist nur mit eine Sprache oder gar nur einem Compiler von einem
Hersteller zusammenarbeiten. So gesehen ist das, was GoldEd hier liefert, nicht schlimmer und
unzufriedenstellender als anderswo.<BR CLEAR=ALL>

<BR><CENTER><A NAME="07" HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Entwicklerspielzeug</B></H3>&nbsp;

<BR>GoldEd bietet etliche &ouml;ffentliche und dokumentierte Schnittstellen, an denen die
Funktionalit&auml;t leicht erweitert werden kann. Im Pakte enthalten sind etliche Beispiele,
Skripten, Includes und Autodocs. Das meiste Material richtet sich an C-Programmierer und verwendet
DICE als Compiler, dessen Vollversion es <A HREF="">wie berichtet</A> als Freeware im Aminet gibt
<LUTZ>Link zu deinem DICE Artikel</LUTZ> .<BR CLEAR=ALL>

<BR>Damit kann man eigene Scanner, Syntaxparser, API-Erweiterungen usw. schreiben. Fortgeschrittene
Kenntnisse zum Thema &quot;ARexx in C&quot; und &quot;Library Programmierung&quot; sind hier aber
praktisch Voraussetzung. Das meiste spielt sich auf einem ziemlich tiefen Level ab, was aber in der
Natur der Sache liegt. F&uuml;r den &quot;Normalverbraucher&quot; gibt es ohnehin Dinge wie den
<TT>generic.parser</TT>, ARexx-Befehle, Templates und Makros, die f&uuml;r viele Zwecke ausreichend
sind.<BR CLEAR=ALL>

<BR>Ein &quot;Wrapper&quot; hilft, das gesammelte Material zu verpacken und zusammen mit einem
Installer Skript als neuen Dateityp f&uuml;r andere zug&auml;nglich zu machen. Die Sache l&auml;uft
zwar nicht vollautomatisch ab, erleichtert den Proze&szlig; aber dennoch.<BR CLEAR=ALL>

<BR>&Uuml;berzeugend ist hier das offene Konzept, da&szlig; dennoch nicht sehr zu Lasten der
Arbeitsgeschwindigkeit geht.<BR CLEAR=ALL>

<BR><CENTER><A NAME="08" HREF="#07"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Motz, raunz, suder</B></H3>&nbsp;

<BR>Manch einer st&ouml;rt sich vielleicht an folgenden Dingen:<BR CLEAR=ALL>

<BR>Es gibt nur eine Ansicht pro Text. Man kann nicht einen Text ein zweites mal laden, und dann an
verschiedenen Stellen bearbeiten, wobei auch die Kopie ge&auml;ndert wird. Das sollte kein
gro&szlig;es Problem sein, weil man Texte falten kann und man Lesezeichen setzen und wieder
anspringen kann. Und das unabsichtliche zweifache Laden wei&szlig; der Editor in der Regel zu
verhindern.<BR CLEAR=ALL>

<BR>Manche Leute glauben, da&szlig; Text- und Hex-Editor ein und dasselbe Programm sein sollen.
Diese werden mit GoldEd nicht gl&uuml;cklich, weil er eine beschr&auml;nkte Zeilenl&auml;nge von 999
Zeichen hat, automatisches Ersetzen von CR/LF in PC-Texten machen kann und Leerzeichen am Ende der
Zeile automatisch wegl&auml;&szlig;t.<BR CLEAR=ALL>

<BR>Oft l&auml;stig sein kann der Umstand, da&szlig; &quot;Undo&quot; nicht zeichenweise
funktioniert, sondern mehr oder weniger die ganze Zeile wieder herstellt.<BR CLEAR=ALL>

<BR>Die Standardtastaturbelegung kann einem leicht zu Schreikr&auml;mpfen reizen. &quot;Undo&quot;
<I>mu&szlig;</I> z.B. auf Amiga-8 liegen. Weil auf Amiga-U liegt bereits &quot;Absatz
linksb&uuml;ndig ausrichten&quot; - wo auch sonst? Und Control-Right bewegt nicht den Cursor
wortweise, sondern will einen Block nach rechts verschieben. Eine der Funktionen, die man sehr
selten braucht. Die Help-Taste darf nat&uuml;rlich nicht die Hilfe zeigen, sondern wird zum Falten
benutzt. Amiga-C wurde ja bereits &quot;gew&uuml;rdigt&quot;, und man k&ouml;nnte hier endlos
weiterlamentieren. Dazu reicht aber der Platz nicht.<BR CLEAR=ALL>

<BR><CENTER><A NAME="09" HREF="#08"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#10"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Vertrieb und Support</B></H3>&nbsp;

<BR>Erh&auml;ltlich ist das Programm beim Autor selbst bzw. neuerdings &uuml;ber einen
Vetriebspartner. In der Regel also &uuml;ber den Postweg. Ein paar Tage nach der Bestellung findet
sich dann ein Kuvert im Briefkasten, das eine selbstgebrannte CD-ROM in einer ziemlich
schn&ouml;rkellosen H&uuml;lle enth&auml;lt. Gedruckte Dokumentation gibt es keine, die Benutzung
wird in einem etwa 250K gro&szlig;en AmigaGuide erl&auml;utert. Sowohl die Dokumentation als auch
die Oberfl&auml;che sind in Deutsch und Englisch vorhanden. Das Manual erkl&auml;rt in kompakter
Form die Bedienung und die einzelnen Men&uuml;s und Dialoge. Weitere Hilfe kriegt man oft &uuml;ber
den &quot;?&quot;-Knopf im Fensterrahmen.<BR CLEAR=ALL>

<BR>Unzureichend finde ich nur die Beschreibung mancher ARexx-Befehle. Worin genau der Unterschied
zwischen <TT>QUERY LINE</TT> und <TT>QUERY ABSLINE</TT> besteht wird nicht wirklich erl&auml;utert.
Verschlimmert wird das ganze noch durch den oft extrem chaotischen Aufbau der Befehlsstruktur. So
gibt es z.B. einen <TT>OPEN</TT> Befehl, der eine neue Datei l&auml;dt. Oft will man aber, das eine
Datei nur dann geladen wird, wenn sie noch nicht im Speicher ist; ansonsten soll einfach das
richtige Fenster aktiviert werden. Das geht mit <TT>WINDOW FORCE USE=dateiname</TT>, wird aber bei
<TT>OPEN</TT> nirgends erw&auml;hnt.<BR CLEAR=ALL>

<BR>Support gibt es per E-Mail, Telefon und FAX. Meiner Erfahrung nach gibt es hier nicht viel zu
bem&auml;ngeln. Fragen werden prompt beantwortet. Bei Bug-Reports, die f&uuml;r den Autor
nachvollziehbar sind, findet sich in der Regel nach ein paar Tagen ein neuer Service Pack im Netz
(Beschreibung des Systems, Anweisung zum Reproduzieren, etwaige Enforcer-Hits usw. sollte man
nat&uuml;rlich mitschicken). Die eine oder andere kleine Feature-Nachfrage geht auch manchmal durch,
Wunder darf man sich nat&uuml;rlich keine Erwarten. Die Weiterentwicklung von GoldEd war seit
Version 5 eher eine stetige - was ja nichts Negatives ist, wenn es um Stabilit&auml;t geht.<BR
CLEAR=ALL>

<BR>Der Preis von DM 100 (90+10 Porto) scheint f&uuml;r einen Editor vergleichsweise hoch. Man
mu&szlig; aber auch in Betracht ziehen, da&szlig; anderen kommerziellen Produkte in dieser Klasse
nur einen Bruchteil der Funktionalit&auml;t offerieren. So gesehen halte ich den Preis f&uuml;r
durchaus akzeptabel.<BR CLEAR=ALL>

<BR>Kopierschutz gibt es keinen, au&szlig;er einem Keyfile auf der CD. Dieses wird beim installieren
eines Service Packs &uuml;berpr&uuml;ft, weshalb der Installer jedesmal um die CD bittet. Da diese
Prozedur selten n&ouml;tig ist, st&ouml;rt das aber nicht wirklich. Witziges Detail: Das Keyfile ist
64MB gro&szlig;, was das Raubkopieren etwas erschweren sollte - zumindest f&uuml;r die
Modem-Wabbler.<BR CLEAR=ALL>

<BR>Neue Versionen des Programms und der Dateitypen des Autors gibt es zum freien Download auf der
<A HREF="http://members.tripod.com/golded/">GoldEd Homepage</A>. Von dort kriegt man auch eine
Demo-Version. Im Aminet finden sich einige Erweiterungen anderer Leute. Hier ist etwas Vorsicht
geboten, weil vieles davon nur mit GoldEd 4 l&auml;uft. Der Installer erkennt solche Probleme in der
Regel aber, und ein Blick in die README wirkt oft auch Wunder.<BR CLEAR=ALL>

<BR><CENTER><A NAME="10" HREF="#09"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Fazit</B></H3>&nbsp;

<BR>GoldEd ist ein feiner Editor, auch wenn das nach meinen Schilderungen vielleicht nicht sofort
erkennbar ist. Viele der kritischen Bemerkungen haben sich auf Details bezogen. Mit kleinen
Problemen l&auml;&szlig;t sich meist besser leben, als wenn die Funktionalit&auml;t gar nicht
vorhanden w&auml;re - wie bei vielen anderen Editoren. Bemerkenswert ist die hohe Flexibilit&auml;t
und Erweiterbarkeit, die dennoch keine gravierenden Auswirkungen auf die Geschwindigkeit und den
Resource-Verbrauch hat. Man nimmt nur das, was man braucht - die Antithese zu EMACS sozusagen.<BR
CLEAR=ALL>

<BR>Ein gr&ouml;&szlig;eres Redesign bietet sich bei den Scannern an. Die in horrender Zahl
vorhandenen Inkonsistenzen (vor allem in der Namensvergabe der ARexx-Befehle und der
Benuteroberfl&auml;che) werden f&uuml;r 68k-Amigas wohl nicht mehr behoben. Hoffentlich aber dann,
wenn GoldEd irgendwann einmal auf einem ganzen anderen System rauskommt (welchem auch immer). Denn
dann gibt es keine Entschuldigung mehr wie die nicht zu ver&auml;rgernde existierende
Benutzerschaft, die langj&auml;hrige, schwer vorauszusagende Weiterentwicklung oder fehlende bzw.
veralterte Styleguides.<BR CLEAR=ALL>

<BR>Alles in allem und in Anbetracht potentieller Alternativen kann man GoldEd f&uuml;r
Amiga-Programmierer ziemlich uneingeschr&auml;nkt empfehlen. Und auch der ernsthafte Anwender sollte
damit seine Freude haben. F&uuml;r's gelegentlich Bearbeiten der <TT>Startup-Sequence</TT> aber
bleibt man besser bei den Bordmittel der Workbench, <TT>ed</TT> und <TT>memacs</TT>. Die kosten
n&auml;mlich nichts.<BR CLEAR=ALL>

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=93 HEIGHT=10 ALT="[93]"><IMG SRC="../images/_box_black.gif" WIDTH=7 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=97 HEIGHT=10 ALT="[97]"><IMG SRC="../images/_box_black.gif" WIDTH=3 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=76 HEIGHT=10 ALT="[76]"><IMG SRC="../images/_box_black.gif" WIDTH=24 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=95 HEIGHT=10 ALT="[95]"><IMG SRC="../images/_box_black.gif" WIDTH=5 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=63 HEIGHT=10 ALT="[63]"><IMG SRC="../images/_box_black.gif" WIDTH=37 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=89 HEIGHT=10 ALT="[89]"><IMG SRC="../images/_box_black.gif" WIDTH=11 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#agi">Thomas Aglassinger</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0148.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html"><I>N/A</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x0148.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://members.tripod.com/golded/">http://members.tripod.com/golded/</A> - GoldEd Homepage; bietet auch eine Demoversion<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_12/sasc.png">SAS/c Dateityp</A> - F&uuml;r das Volk<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_12/arexx.png">ARexx Dateityp</A> - lang hat's gedauert, aber jetzt ist er da<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_12/joyce.png">Joyce</A> - die Rechtschreibkontrolle<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_12/installer.png">Installer Dateityp</A> - &uuml;berpr&uuml;ft automatisch die Schachtelung der Klammern<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_12/eiffel.png">Eiffel Dateityp</A> - was es noch nicht gibt, bastelt man sich selbst<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A NAME="[1]">[1]</A> M&ouml;ssenb&ouml;ck, H. &amp; Koskimies, K. 1996. <I>Active Text for Structuring and Understanding Source Code</I>, Software Practice Experience. Vol. 26, no. 7, 833-850.<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x0147.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0149.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
