<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x12 - JINI</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x0150.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
					<A HREF="../english/0x0150.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x014F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0151.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x0150.html">JINI</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR>
					<A HREF="0x0143.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x0144.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x0145.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x0146.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x0147.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x0148.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x014E.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x014F.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x0150.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x0151.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x0152.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>JINI - Der WindowsCE gesteuerte Wunderhaushalt</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Seit dem JAVA Hype ist nur kurze Zeit vergangen, dennoch steht schon der
n&auml;chste in den Startl&ouml;chern: JINI. Dieses tolle Gebilde soll demn&auml;chst (nach dem
Willen der Industrie) den Haushalt revolutionieren. S&auml;mtliche Ger&auml;te und
Einrichtungsgegenst&auml;nde k&ouml;nnen dank JINI miteinander kommunizieren. Eine praktische Sache
- m&ouml;chte man meinen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Das h&ouml;rt sich dann so an:<BR CLEAR=ALL>

<BR><I>Schuhe an Schuhputzzeug</I><BR> Meldung: Wir sind dreckig - macht sofort den User darauf
aufmerksam, da&szlig; wir geputzt werden m&uuml;ssen.<BR> Aktion: die Kinder putzen die Schuhe vom
Papa<BR CLEAR=ALL>

<BR><I>Seife an Handtuchhalter</I><BR> Meldung: Alle Bakterien auf den H&auml;nden get&ouml;tet,
kuschelweich zum Abtrocknen machen<BR> Aktion: Handtuch l&auml;&szlig;t sich h&auml;ngen<BR
CLEAR=ALL>

<BR><I>Milch an K&uuml;hlschrank</I><BR> Meldung: Schwerer Ausnahmefehler: Bin abgelaufen - Signal
an User<BR> Aktion: Sirene am K&uuml;hlschrank heult auf<BR CLEAR=ALL>

<BR><I>Hemd an B&uuml;geleisen</I><BR> Meldung: Knitterfaktor 0.7 &uuml;berschritten - Aufheizen<BR>
Aktion: B&uuml;geleisen l&auml;uft die ganze Nacht &uuml;ber, weil niemand Zeit zum B&uuml;geln
hat<BR CLEAR=ALL>

<BR><I>Sp&uuml;lbecken an Waschmaschine</I><BR> Meldung: &Auml;hhh, Du kannst das Pumpen abstellen,
Abflu&szlig; ist verstopft<BR> Aktion: User kann den Boden aufwischen<BR CLEAR=ALL>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Apropos Waschmaschine, schaun wir doch einmal, was die dann alles so an Fehlermeldungen liefern
kann, schlie&szlig;lich l&auml;uft hier JINI unter WindowsCE:<BR CLEAR=ALL>

<BR>&quot;Ein schwerer Ausnahmefehler ist aufgetreten! Beenden Sie alle Waschvorg&auml;nge und
starten Sie die Waschmaschine neu.&quot;<BR CLEAR=ALL>

<BR>&quot;Dieses Waschmittel ist mit Ihrer Waschmaschine nicht kompatibel, bitte entfernen Sie das
Mittel aus der Laufwerks&ouml;ffnung und wiederbef&uuml;llen es mit Waschmittel der Firma
Microsoft.&quot;<BR CLEAR=ALL>

<BR>&quot;Bevor Sie diese Waschmaschine in Betrieb nehmen, lesen Sie bitte die Lizenzvereinbarung
durch. Sollten Sie dieser nicht zustimmen k&ouml;nnen, geben Sie bitte die Waschmaschine
originalverpackt an Ihren Microsoft St&uuml;tzpunkt H&auml;ndler zur&uuml;ck.&quot;<BR CLEAR=ALL>

<BR>&quot;Nicht genug Platz in der Trommel, um die Waschmaschine zu &ouml;ffnen. Bitte entfernen Sie
ein oder mehrere Kleidungsst&uuml;cke aus der Trommel um die Waschmaschine &ouml;ffnen zu
k&ouml;nnen.&quot;<BR CLEAR=ALL>

<BR>&quot;Der Waschvorgang konnte nicht gestartet werden. Bitte &ouml;ffnen Sie die Waschmaschine
und entfernen die inkompatiblen Kleidungsst&uuml;cke.&quot;<BR CLEAR=ALL>

<BR>&quot;Der Waschvorgang konnte aufgrund Speichermangels nicht beendet werden. Bitte erh&ouml;hen
Sie den virtuellen Speicher unter &quot;Einstellungen/Speicher&quot; oder kaufen Sie einen
gr&ouml;&szlig;eren W&auml;schekorb.&quot;<BR CLEAR=ALL>

<BR>&quot;Wollen Sie den Waschtag wirklich beenden? Ja / Nein / Neu starten&quot;<BR CLEAR=ALL>

<BR>&quot;Der Waschtask reagiert nicht mehr. Wollen Sie diesen Gang wirklich auswerfen? Ja / Nein /
Neu starten&quot;<BR CLEAR=ALL>

<BR>&quot;Dr. Watson: Der Waschvorgang ist abgest&uuml;rzt. Ein post mortem Abbild wird unter
Wasser/H2O/Abflu&szlig; erstellt.&quot;<BR CLEAR=ALL>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Sehr beruhigend, da&szlig; alles hier so wunderbar l&auml;uft, nicht wahr? Desweiteren stellt
sich nat&uuml;rlich auch die Frage, wozu soll das Buttermesser mit der Butter und dem Brot
kommunizieren? Damit ich nicht zuviel Butter streiche? Oder damit die Butter den richtigen
Weichheitsgrad zum Streichen besitzt? Oder damit sich die Industrie dumm und d&auml;mlich an mir
verdient? Oder weil Papa Billy so ein netter Onkel ist?<BR CLEAR=ALL>

<BR>Das sch&ouml;ne am vernetzten Haushalt sind die Probleme die auf einem zukommen, die man nicht
h&auml;tte, h&auml;tte man nicht den vernetzten Haushalt:<BR CLEAR=ALL>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ein Tag im Leben eines (JINI-)Hausmannes:<BR CLEAR=ALL>

<BR><TT>05:62</TT> Aufgrund eines &quot;Stack Overflows&quot; springt der Wecker zu einer etwas
ungew&ouml;hnlichen Zeit an. Heftiges Ausschalten hilft leider nicht, da der Sleepmode Task
abgest&uuml;rzt ist.<BR CLEAR=ALL>

<BR><TT>06:15</TT> Ich suche meine Hausschuhe, die der Jini-kompatible Robothund von Sony versteckt
hat<BR CLEAR=ALL>

<BR><TT>06:45</TT> Die Zeitung ist heute schon wieder nicht da - der Postkasten hat sie nicht
angenommen - Schreibfehler in meiner Adresse.<BR CLEAR=ALL>

<BR><TT>06:55</TT> Ich versuche vergeblich das Radio einzuschalten - daf&uuml;r l&auml;uft endlich
der Fernseher<BR CLEAR=ALL>

<BR><TT>07:05</TT> Der Radio l&auml;uft, aber irgendwie verstehe ich kein Wort vom d&auml;nischen
Sender und ein anderer l&auml;&szlig;t sich nicht einstellen<BR CLEAR=ALL>

<BR><TT>07:25</TT> Die Kaffeemaschine liefert den Kaffee heute ausnahmweise ohne denselben ein
kleiner Bug der mit der n&auml;chsten Release aber behoben sein wird<BR CLEAR=ALL>

<BR><TT>09:45</TT> Seit 2 Stunden versuche ich die Wohung zu verlassen, die Haust&uuml;re meldet
immer &quot;Der Besitzer ist momentan nicht anwesend. Kommen sie sp&auml;ter wieder!&quot; Ein Anruf
beim Support hilft auch nicht weiter: &quot;Sind Sie sicher, da&szlig; Sie die Haust&uuml;re richtig
installiert haben und keine I/O Konflikte aufgetreten sind?&quot; Der einzige I/O Konflikt besteht
darin, da&szlig; ich nicht rauskomme...<BR CLEAR=ALL>

<BR><TT>10:15</TT> Pl&ouml;tzlich steht das Haustor sperrangelweit offen - ich hechte durch den
T&uuml;rrahmen<BR CLEAR=ALL>

<BR><TT>11:15</TT> Im Supermarkt sind nur 2 Kassen ge&ouml;ffnet, schnell stelle ich mich bei der
kleineren Schlange an. Als ich bezahlen will, meldet meine Kreditkarte: &quot;Firmware veraltet,
laden Sie ein Update herunter&quot;. Ein Supermarkt-Techniker kommt: &quot;Lesen Sie keine
Nachrichten? Das Update gibt es schon seit &uuml;ber einer Woche!&quot; Hinter mir fangen sich die
Leute an zu beschweren: &quot;Der is sogar z&acute;bled zum updaten.&quot;<BR CLEAR=ALL>

<BR><TT>12:55</TT> Meine Mikrowelle l&auml;&szlig;t sich nicht mehr abstellen, seit &uuml;ber einer
Stunde verarbeitet sie die Lasagne zu Kohle, weil der Chip in der Lasagnepackung falsche Daten
liefert. Nie mehr Sonderangebote kaufen!<BR CLEAR=ALL>

<BR><TT>13:20</TT> Der Wecker erinnert mich daran Aufzustehen. Vielen Dank auch, sonst h&auml;tte
ich fast verschlafen. Ich werfe ihn ins Klo - das daraufhin eine Anzeige an die Umweltpolizei
schickt, weil ich Sonderm&uuml;ll runtersp&uuml;le.<BR CLEAR=ALL>

<BR><TT>14:15</TT> Ich versuche die Wohnung zu l&uuml;ften, aber die Fenster lassen sich nicht
&ouml;ffnen JINI meldet: &quot;Server zu 100% ausgelastet oder abgest&uuml;rzt - System wird neu
gestartet&quot;<BR CLEAR=ALL>

<BR><TT>15:30</TT> Formel 1 im Fernsehen! Endlich ein Lichtblick.<BR CLEAR=ALL>

<BR><TT>15:35</TT> Meine neue Nachbarin borgt sich etwas Mehl aus - just in dem Augenblick schaltet
der Fernseher von Formel 1 auf den Pornokanal um. Meine Nachbarin dreht sich um, ohne mich noch
eines Blickes zu w&uuml;rdigen<BR CLEAR=ALL>

<BR><TT>15:37</TT> Die Selbstdiagnose des Fernseheres ergibt, da&szlig; ich beim Surfen einen
Werbe-Virus aktiviert haben mu&szlig;, der automatisch f&uuml;r kurze Zeit zum Adultchannel
schaltet.<BR CLEAR=ALL>

<BR><TT>15:45</TT> Internet Explorer 21.3 ist endlich gestartet, leider ist der Virus dem Hersteller
der Antivirensoftware noch nicht bekannt. Aber sp&auml;testens n&auml;chste Woche wird es dann ein
kostenpflichtiges Update geben.<BR CLEAR=ALL>

<BR><TT>16:00</TT> Ich brauche noch ein Bier! Schon mein viertes, meint der K&uuml;hlschrank und
l&auml;&szlig;t mich einen Alkoholtest machen - zuviel Promille - es gibt kein weiters Bier. Auf
eine philosophische Diskussion &uuml;ber das Biertrinken l&auml;&szlig;t er sich trotz genialster
Formulierungen nicht ein - komisch, bei Capt. Jean-Luc Picard klappt sowas immer.<BR CLEAR=ALL>

<BR><TT>16:15</TT> Jetzt brauche ich einen Kaffee! Die Kaffeemaschine meldet, da&szlig; schon wieder
Chunkmail von Tschibo gekommen ist.<BR CLEAR=ALL>

<BR><TT>16:30</TT> Ich h&ouml;re Internet-Radio, pl&ouml;tzlich meldet die Tiefk&uuml;ltruhe einen
Totalausfall. Offensichtlich vertragen sich die beiden Ger&auml;te nicht gleichzeitig im Netzwerk,
aber ich habe geh&ouml;rt, das mit JINI HouseholdNetwork 4.6 jetzt alles viel einfacher sein wird -
nur leider ist es nicht abw&auml;rtskompatibel. Es unterst&uuml;tzt sogar DirectHousehold-X 12.7,
die Multimedia Schnittstelle f&uuml;r den Haushalt - zumindest alle Funktionen die schon
dokumentiert sind.<BR CLEAR=ALL>

<BR><TT>17:15</TT> Das Telefon klingelt die ganze Zeit, aber wenn ich mich melde, bekomme ich immer
nur Fehlermeldungen.<BR CLEAR=ALL>

<BR><TT>18:05</TT> Das Telefon l&auml;utet noch immer, aber drau&szlig;en am Balkon, 6 Meter
unterhalb.<BR CLEAR=ALL>

<BR><TT>18:30</TT> Ein Freund ist vorbeigekommen. Wir unterhalten uns angeregt durch den
Briefschlitz - die Haust&uuml;re wei&szlig; wieder mal nichts von meiner Anwesenheit.<BR CLEAR=ALL>

<BR><TT>19:30</TT> Musik! - Leider l&auml;&szlig;t sich die Stereoanlage nur auf
Zimmerlaust&auml;rke schalten, ab 19:00 Uhr ist laute Musik gesetzlich verboten.<BR CLEAR=ALL>

<BR><TT>20:00</TT> Ewige Verdammnis! Ich kann nicht einmal Quake 13 spielen, weil der Computer
meinen Altersnachweis nicht anerkennen will. Selbst das Solit&auml;r wird verweigert.<BR CLEAR=ALL>

<BR><TT>20:05</TT> Morgen ist auch noch ein Tag. Ich lege mich in mein JINI inkompatibles Bett.<BR
CLEAR=ALL>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>In einer Wohnung zu leben, wo der Computer selbst das Toilettenpapier vor dem Abwischen auf die
richtige Temperatur w&auml;rmt, ob das wirklich unser Traum sein kann? Die Industrie sagt - ja! Na
klar!<BR CLEAR=ALL>

<BR>Also liebe Leute: kauft Euch das JINI-Kissen, das Euch in den Schlaf singt. Und die T&uuml;re,
die je nach Stimmung anders knarrt.<BR CLEAR=ALL>

<BR>Abschlie&szlig;end bleibt mir nur eines zu sagen: Warum wollen die Menschen diese Dinge?<BR
CLEAR=ALL>

<BR>Vielleicht weil sie in einem urspr&uuml;nglich gebliebenem Instinkt die mystisch angehaucht
Personifizierung der Technik im Computer als Befriedigung des Spieltriebes ansehen?<BR CLEAR=ALL>

<BR>Oder sind sie einfach nur bl&ouml;de, primitive Faultiere?<BR CLEAR=ALL>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#robert">Robert Niessner</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x0150.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>
					<A HREF="as-redax.html#stevebow"><I>Steve Bowman</I></A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../english/0x0150.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__english.gif" ALT="[ english ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x014F.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0151.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
