<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverse Amiga-News
</font>
</TD></tr>
</TABLE>
<BR>
<H2>2. Neuigkeiten von der Amiga Arena</H2>
<P><B>Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_top">http://online-club.de/~ARENA/</A>) informiert:</B></P>
<H3>&raquo;Amiga Arena News<BR>
(05.05.2001)</H3>
<P><B>Amiga Arena Sonderpreis Aktion!</B></P>
<P>
In Zusammenarbeit mit Thomas Richter erm&ouml;glicht die Amiga Arena
einen Sonderpreis f&uuml;r VideoEasel.
</P>
<P>
Der Sonderpreis ist bis zum 31.06.2001 &uuml;ber die Amiga Arena m&ouml;glich!
Sie finden die Sonderpreis Aktion in der Rubrik &quot;Aktionen&quot;!
</P>
<P><B>&Uuml;ber VideoEasel:</B></P>
<P>
A fast and flexible, program-able and expandable cellular automata machine,
including Conway's LIFE plus over 70 (SEVENTY!) other applications of
cellular automata, ready to use and collected from various sources
(Scientific American alias Spektrum der Wissenschaft, Cellular Automata
Machines by Toffoli &amp; Margolus and other..).
</P>
<P>
The program is extremly flexible, own algorithms can be written in CAMRexx
or - even better - in (preferably) Assembler or C.
</P>
<P>
Weitere Infos unter:
<A HREF="http://www.math.tu-berlin.de/~thor/thor/index.html" TARGET="_top">http://www.math.tu-berlin.de/~thor/thor/index.html</A> - Thor Software&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(12.05.01)</H3>
<P><B>Amiga Arena Reviews!</B></P>
<P>
Die Deutsche &Uuml;bersetzung zu den Reviews &quot;Detris 3&quot; und &quot;WBsteroids&quot; sind
unter der Linksammlung &quot;PD Spiele&quot; Online!
Die Reviews wurden mit freundlicher Gehnemigung von Richard Kapp (GFX Base)
der  Amiga Arena zur Verf&uuml;gung gestellt!
Besonderen Dank an Kilian Servais (Metal Corner) f&uuml;r die &Uuml;bersetzung!
Wer Reviews f&uuml;r die Amiga Arena verfassen m&ouml;chte bitte mail an mich!&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(15.05.2001)</H3>
<P><B>Amiga Arena Interview Aktion!</B></P>
<P>
Ein ausf&uuml;hrliches Interview mit Dirk St&ouml;cker
dem Entwickler von XAD ist im Bereich &quot;Aktionen&quot;
online!
</P>
<P>
XAD das Packsystem ist weiterhin zum Sonderpreis
in der Amiga Arena erh&auml;ltlich!
</P>
<P><B>Amiga Arena Review</B></P>
<P>
Die Deutsche &Uuml;bersetzung zu dem Review von &quot;Samegame&quot; ist unter
der Linksammlung &quot;PD Spiele&quot; Online!
Besonderen Dank an Kilian Servas (Metal Corner) f&uuml;r die &Uuml;bersetzung!
Mit Gehnehmigung von Richard Kapp (GFX Base)!&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(17.05.2001)</H3>
<P><B>Amiga Arena Sonderpreis Aktion!</B></P>
<P>
Vor ca. 2 Wochen hat die Amiga Arena in Zusammenarbeit
 mit der <A HREF="http://www.funtime-world.de" TARGET="_top">http://www.funtime-world.de</A> Fun Time World angeboten, das Paket
Image Engineer und  Visual Engineer zu einem Sonderpreis
von nur 49,- DM zu bekommen.
</P>
<P>
Vorausgesetzt es w&uuml;rden mehr als 30 Bestellungen kommen. Leider
konnten wir bisher noch nicht einmal die H&auml;lfte erreichen.
</P>
<P>
Wir lassen das <A HREF="http://www.funtime-world.de/shop/produkte/ar0002.shtml" TARGET="_top">http://www.funtime-world.de/shop/produkte/ar0002.shtml</A>
Bestellformular noch bis Sonntag online und hoffen zumindest auf die
H&auml;lfte zu kommen.
</P>
<P>
So gelingt es uns vielleicht doch noch beim Programmierer den Sonderpreis
zu bekommen.&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(20.05.2001)</H3>
<P><B>Amiga Arena Sonderpreis Aktion!</B></P>
<P>
In Zusammenarbeit mit Michael Wagner erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r Greatkartei.
</P>
<P>
Greatkartei ist eine sehr komplexe aber trotzdem einfach zu bedienende
Dateiverwaltung die fast keine W&uuml;nsche offen l&auml;&szlig;t.
</P>
<P>
Fast jede Art von Datei kann &quot;erzeugt&quot; und verwaltet werden.
Die Vorz&uuml;ge:
Es ist durch seine Flexibilit&auml;t f&uuml;r jede Art der Datenverwaltung zu
gebrauchen.
</P>
<P>
Es ist Styleguide gerecht nach Commodorerichtlinien programmiert.
Es unterst&uuml;tzt die Locale Library.
</P>
<P>
Zu jedem Datensatz kann Text, Sound und Grafik zugeordnet werden.
Jede Datei kann mit einem Passwort gesch&uuml;tzt werden.
</P>
<P>
Jede Datei kann auf einen bestimmten Stand gebracht werden. (nach Zeitpunkt
bezogen)
Jede &Auml;nderung in der Datei kann nachvollzogen werden.
</P>
<P>
Jede wichtige Funktion kann &uuml;ber Tastatur, Men&uuml; und Buttons erreicht
werden.
</P>
<P><B>Amiga Arena Sonderpreis Aktion</B></P>
<P>
Das SViewIV / akMPEG Bundle ist noch bis zum 31.05.02 zum Sonderpreis
erh&auml;ltlich!&laquo;
</P>
<H3>&raquo;AmigaArena News<BR>
(26.05.2001)</H3>
<P><B>Amiga Arena Interview Aktion!</B></P>
<P>
Die Amiga Arena interviewte Markus Pohlmann,Entwickler von dem Spiel
&quot;Projekt Crashsite&quot; ein Science Fiction Rollenspiel,
&uuml;ber den derzeitigen Stand der Entwicklung!
Das Interview zu &quot;Projekt Crashsite&quot; ist im Bereich &quot;Aktionen&quot; online!
Markus Pohlmann sucht dringend User die Ihm beim Rendern unterst&uuml;zen!
Bei Interesse bitte mail an:
<A HREF="mailto:Markus-Pohlmann@t-online.de">Markus-Pohlmann@t-online.de</A>
</P>
<P><B>Amiga Arena Preview / Updates!</B></P>
<P><B>FBase Update</B></P>
<P><B>Eine Deutsche Kurzanleitung ist hinzugef&uuml;gt worden!</B></P>
<P><B>Krsnaked Preview</B></P>
<P>
Die Deutsche &Uuml;bersetung zum Preview dem Snake Clone ist Online!
(Bereich PD Links)
</P>
<P><B>Interview mit Dirk St&ouml;cker</B></P>
<P>
Die Englische &Uuml;bersetung vom Interview ist Online!
(Bereich Aktionen)
</P>
<P>
Besonderen Dank an Kilian Server und Kai Stegemann f&uuml;r die &Uuml;bersetzungen!&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(26.05.2001)</H3>
<P><B>Amiga Arena Vollversion!</B></P>
<P>
Mit der Genehmigung von Markus Pohlmann erm&ouml;glicht
die Amiga Arena die Vollversion von &quot;Pferderennen&quot;!
Pferderennen ist wie der Name schon sagt ein
Wettspiel wobei Sie auf eines von 6 Pferden
wetten k&ouml;nnen, welches zuerst das Ziel erreicht!
Pferderennen bietet:
</P>
<UL>
<LI> Unterhaltung f&uuml;r bis zu 8 Spieler
</LI>
<BR><LI> Detailierte &quot;Pferdest&auml;rken&quot; ;)
</LI>
<BR><LI> bis zu 30 St&auml;lle mit je bis zu 50 Pferden
</LI>
<BR><LI> einen Pferdeeditor
</LI>
<BR><LI> Speicherbare Spielst&auml;nde
  Pferderennen ist im Bereich &quot;Vollversionen&quot; online!&laquo;
</LI>
</UL>
<H3>&raquo;Amiga Arena Vollversion<BR>
(30.05.2001)</H3>
</P>
<P>
Mit der Genehmigung von Horst Spierling erm&ouml;glicht,
die Amiga Arena, die Freigabe des Arcade Spiels &quot;Action Cat&quot;!
Action Cat geht in die Richtung von Spielen wie &quot;Ruf n Tumble&quot;
und &uuml;berzeugt duch nette Levels,Waffenauswahl,Teleporter und R&auml;tseln!
Selten hat mir ein Acade Spiel aus dem Sharewarebereich so gefallen!
Spielbar von HD (l&auml;uft auf 60er) oder Disk ab A1200 2 MB!&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(31.05.2001)</H3>
<P><B>Amiga Arena Sonderpreis Aktion!</B></P>
<P>
In Zusammenarbeit mit Stefan Kost erm&ouml;glicht die Amiga Arena einen
Sonderpreis f&uuml;r SoundFX erh&auml;ltlich vom 01.06.01 bis 01.08.01 in der Amiga
Arena.
</P>
<P>
SoundFX ist ein Editor f&uuml;r digitalisierte Audiodaten (Samples).
SoundFX ist modular aufgebaut und besitzt eine komfortable grafische
Benutzeroberfl&auml;che.
</P>
<P>
Mit SoundFX lassen sich Samples mit digitalen Effekten (welche einzigartig
auf dem Amiga sind) versehen und nachbearbeiten.
Nachfolgend sehen sie eine Liste mit einigen Features.
</P>
<UL>
<LI> mehr als 50 Effekte, mit vielen Parameter und vielf&auml;ltigen M&ouml;glichkeiten
   sie zu modulieren
</LI>
<BR><LI> SoundSynthese (AM,FM,...)
</LI>
<BR><LI> 3D-Cube-Parametermodulation (Mix, Equalize)
</LI>
<BR><LI> Effekte e.g. Hall, Echo, Delay, Chorus/Phaser, Morph, Pitchshift
</LI>
<BR><LI> Operationen e.g. Resample, ZeroPass (FadeIn/FadeOut),
   Middle,plify,Mix,DeCrackle,ConvertChannels
</LI>
<BR><LI> 2D/3D-Spectrumanalysis
</LI>
<BR><LI> sehr gute resonanzf&auml;hige Filter und Booster
</LI>
<BR><LI> arbeitet in Mono, Stereo und Quadro
</LI>
<BR><LI> Sampledaten werden in 16bit im Speicher und auf der Festplatte gehalten
</LI>
<BR><LI> AHI-player (f&uuml;r Soundkartenbesitzer)
</LI>
<BR><LI> systemkonform programmiert (getestet mit cyberguard, wipeout und blowup)
</LI>
<BR><LI> und vieles, vieles mehr
</LI>
</UL>
<P>
Weitere Informationen finden Sie unter: <A HREF="http://www.sonicpulse.de" TARGET="_top">http://www.sonicpulse.de</A> -
SonicPulse&laquo;
</P>
<H3>&raquo;Amiga Arena News<BR>
(03.06.2001)</H3>
<P><B>Amiga Arena Vollversion!</B></P>
<P>
Mit der Genehmigung von Frederic Laboureur erm&ouml;glicht,
die Amiga Arena die Vollversion von &quot;The Boss&quot;!
Bei &quot;The Boss&quot; handelt es sich um einen System Manager,
mit dem man Programme und Applikationen mit einem einfachen Druck
auf einen simplen Button starten kann.
</P>
<P>
Es werden keine nervenden und speicherverbrauchenden Icons,
Men&uuml;s oder Docks f&uuml;r den Start verwendet.
</P>
<P>
Ein einfacher Button reicht f&uuml;r den Start eines Programms v&ouml;llig aus!
&quot;The Boss&quot; ist dabei sehr einfach zu bedienen, fexibel, kompakt,
systemfreundlich und recourcenschonend und l&auml;uft zudem auf jedem m&ouml;glichen
Schirm (Workbench, &Ouml;ffentlich oder sogar einem eigenem)
und richtet sich an all jene, denen Tools wie Toolmanager
oder ToolsDaemon zu aufgebl&auml;ht sind.
Features
</P>
<UL>
<LI> Komplett vom User zu konfigurieren. Es werden keine zus&auml;tzlichen Tools
   ben&ouml;tigt.
</LI>
<BR><LI> Font sensitive GUI. Ausw&auml;hlbare Schirm- und Buttonschriftarten
</LI>
<BR><LI> Volle Unterst&uuml;tzung von OCS ECS AGA. Ausw&auml;lbare Schirmmodi
</LI>
<BR><LI> Alle funktionen auf einem einzigen Schirm. Keine Men&uuml;s, Icons oder
   Docks.
</LI>
<BR><LI> Es wird kein seperates Interface wie MUI oder Classact ben&ouml;tigt
</LI>
<BR><LI> Asynchrones Multitasking und extrem systemfreundlich.
</LI>
<BR><LI> 16 Farben WB Palette, mit der man die Faben des Tools festlegen kann.
</LI>
<BR><LI> Effizienter Umgang mit Speicher - es wird nur wenig Speicher ben&ouml;tigt.
</LI>
<BR><LI> Ausw&auml;hlbare Typen von Buttons f&uuml;r Schubalden, Skripte und ausf&uuml;hrbare
   Dateien.
</LI>
<BR><LI> Unbegrenzte Anzahl an Buttons m&ouml;glich, je nachdem wieviele man braucht.
</LI>
<BR><LI> Kleiner, optimierter schneller Code macht das ganze systemfreundlich.
</LI>
<BR><LI> Sehr einfach zu benutzen und konfigurieren.
</LI>
<BR><LI> Unterst&uuml;tzt Drag &amp; Drop
</LI>
</UL>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Besonderen Dank an Kilian Servais f&uuml;r die Deutsche &quot;Kurzanleitung&quot;!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Wie immer sucht die Amiga Arena User die Lust haben Reviews oder&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Anleitungen zu &Uuml;bersetzen bez. zu schreiben!&laquo;&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
