<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H1>AMIGA-aktuell-Forum</H1>
<P>
In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken &quot;Leserbriefe&quot;, &quot;Kleinanzeigen&quot;, und &quot;Problemecke&quot;
zusammengefasst.
</P>
<P><B>Wenn Ihr einen Beitrag habt, schreibt bitte an:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Carsten Schr&ouml;der&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Helmoltstra&szlig;e 10&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">37081 G&ouml;ttingen&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P><B>E-Mail: <A HREF="mailto:aakt@aakt.de">aakt@aakt.de</A></B></P>
<H2>1. Weitere Kommentare zum BoingBag3.9.1-Review und einige Probleml&ouml;sungen (von Christian Aichinger)</H2>
<P>
So, da habe ich einige AmigaOS-Betatester anscheinend etwas ver&auml;rgert,
obwohl das &uuml;berhaupt nicht von mir beabsichtigt wurde. Der Nachtrag zum
BB1, der in der letzten Ausgabe ver&ouml;ffentlicht wurde, hat vielleicht den
Eindruck beim Leser erweckt, da&szlig; ich nicht viel vom OS3.9-Update halte. Das
ist jedoch nicht der Fall. Ich pers&ouml;nlich bin sehr zufrieden mit OS3.9 und
auch das BB3.9.1 hat meine Erwartungen fast vollends erf&uuml;llt. Was die
Inhalte der ver&ouml;ffentlichten Leserbriefe betrifft, m&ouml;chte ich sagen, da&szlig;
ich Leserbriefe immer ver&ouml;ffentliche (soweit diese nicht unter der
&quot;G&uuml;rtellinie&quot; formuliert wurden und ich au&szlig;erdem die Erlaubnis zur
Ver&ouml;ffentlichung besitze) und diese auch nicht von mir zensiert (h&ouml;chstens
kommentiert) werden. Da&szlig; die im letzten Nachtrag ver&ouml;ffentlichten
Leserbriefe kein gutes Licht auf das BB3.9.1 werfen, lag wahrscheinlich
daran, da&szlig; ich im Review des BB3.9.1 dazu aufgerufen hatte, mir Probleme
mit dem Update zu melden und nach M&ouml;glichkeit entsprechende Probleml&ouml;sungen
zu nennen. Dass sich daraufhin nur 3 Leser bei mir meldeten, spricht wohl
eher f&uuml;r die Qualit&auml;t des BoingBags als dagegen.
</P>
<P>
Michael Christoph &lt;<A HREF="mailto:michael@meicky-soft.de">michael@meicky-soft.de</A>&gt; hat mir eine Mail geschickt, in
der er einige meiner genannten Kritikpunkte anspricht. Meine Kommentare
habe ich in eckige Klammern gesetzt. Hier die Mail:
</P>
&gt; Hallo Christian,<BR>
&gt;<BR>
&gt; Es gibt schon so genug Raubkopien von AmigaOS, da&szlig; man es den<BR>
&gt; Leuten nicht auch noch unn&ouml;tig erleichtern mu&szlig;. Nur aus diesem Grund<BR>
&gt; ist das &quot;AmigaOSUpdate&quot;-File gesch&uuml;tzt und ben&ouml;tigt die<BR>
&gt; Original-AmigaOS CD. Da die wichtigsten Systemkomponenten im<BR>
&gt; Updatearchiv vorhanden sind, k&ouml;nnte dieses sonst &uuml;ber eine<BR>
&gt; 3.1-Installation kopiert werden und auch der letzte w&uuml;rde sich den<BR>
&gt; &quot;korrekten&quot; Erwerb der CD sparen!<BR>
<P>
[Auf der einen Seite hast du recht. Auf der anderen Seite ist der dadurch
gegeben Schutz vor Raubkopien nur minimal. Ein ambitionierter Cracker hat
mit einem passwortgesch&uuml;tzten ZIP-File nur geringe Schwierigkeiten. Zum
Anderen ist es kein Problem, das BoingBag auch mit Hilfe einer
raubkopierten OS3.9-CD zu installieren. Wenn der &quot;normale&quot; OS3.1/OS3.5-
Anwender Teile des 3.9.1-Updates auf seinem System verwendet, ist das noch
l&auml;ngst nicht das selbe, wie eine korrekte Standard-Installation des OS3.9.
Ganz abgesehen von v&ouml;llig fehlerhaften Lokalisierungen legt dieses
&quot;Zwitter-OS&quot; ein mehr als seltsames Verhalten an den Tag.]
</P>
&gt; Zitat: &quot;Auf der anderen Seite mu&szlig; man AMIGA Inc. aber auch die schnelle<BR>
&gt; Reaktion auf Bug-Reports und die Ver&ouml;ffentlichen des Updates zugute<BR>
&gt; halten.&quot;<BR>
&gt;<BR>
&gt; Ich m&ouml;chte auch dem Letzten unter den Lesern nochmals deutlich in<BR>
&gt; Erinnerung rufen, da&szlig; Amiga Inc. lediglich der Auftraggeber ist,<BR>
&gt; aber keine einzige Zeile zu den neuen AmigaOS' beigesteuert hat !<BR>
&gt; Somit ist es Haage &amp; Partner und dessen Kumpanen zugute zu halten,<BR>
&gt; da&szlig; so schnell ein BoingBag erschienen ist, bzw. da&szlig; es &uuml;berhaupt<BR>
&gt; ein AmigaOS 3.9 gibt.<BR>
<P>
[Du hast recht. Ich h&auml;tte hier nat&uuml;rlich auch Haage&amp;Partner sowie die
Mitarbeiter des AmigaOS-Teams erw&auml;hnen sollen. Letzten Endes ist aber Amiga
Inc. f&uuml;r die Ver&ouml;ffentlichung des BB3.9.1 verantwortlich und nicht die, die
mit der Programmierung desselben beauftragt wurden.]
</P>
&gt; P.S: ich glaube nicht, da&szlig; Amiga Inc. Dich jemals anrufen wird, um<BR>
&gt; Dir mitzuteilen, da&szlig; ein neues BB erschienen ist ;-) Leser des<BR>
&gt; Amiga Magazins haben z.B. bereits in der Mai-Ausgabe (02.04.<BR>
&gt; Erscheinungsdatum) einen umfassenden Bericht der Neuerungen ent-<BR>
&gt; halten (alle Nicht-Abonnenten sollen sich an die eigene Nase fassen<BR>
&gt; und jammern, da&szlig; sie von nicht wissen) !<BR>
<P>
[Eine pers&ouml;nliche Mitteilung habe ich von Amiga Inc auch &uuml;berhaupt nicht
verlangt. Ein Hinweis auf der Homepage, da&szlig; das erste ver&ouml;ffentlichte
BB3.9.1 nicht ganz fehlerfrei war und durch eine &uuml;berarbeitete Version
ersetzt wurde, h&auml;tte mir schon gereicht. Das ein &quot;vermasseltes&quot; 1. Release
nicht an die gro&szlig;e Glocke geh&auml;ngt werden sollte, ist mir und sicherlich
auch jedem Leser klar. Allerdings ist so eine Informationspolitik doch
etwas albern. Fehler k&ouml;nnen jedem mal passieren. Schlie&szlig;lich sind wir alle
nur Menschen ;).
</P>
<P>
Da&szlig; das Amiga Magazin direkt durch Mitarbeiter des AmigaOS3.9-Teams mit
Informationen versorgt wird, ist dagegen etwas anderes und in Bezug auf
andere Amiga-Publikationen und im Bezug auf die Leser dieser Publikationen
unfair. Fragen Redakteure eines anderen Magazins bei Beta-Testern oder
Verantwortlichen an, gibt es meist nur die lapidare Auskunft, da&szlig; sie durch
NDAs (Non Disclosure Agreement) gebunden sind und keine Aussage zum
Entwicklungsstand machen d&uuml;rfen. Das Amiga Magazin bekommt solche
Informationen trotzdem, und der Anwender, der &uuml;ber den Stand der Dinge
informiert sein m&ouml;chte, ist gezwungen, sich das Amiga Magazin zu kaufen
(bzw. die Zeitschrift &quot;PCgo&quot; zu abonnieren), um ben&ouml;tigte Informationen zu
erlangen.]
</P>
&gt; Von einfrierenden AsyncWB ist mir nichts bekannt, wobei ich<BR>
&gt; zugebe, nur selten &uuml;ber die Workbench zu kopieren.<BR>
&gt;<BR>
&gt; An Herrn Schomberg noch die Frage, wieso in der user-startup Datei<BR>
&gt; Programme mittels WBRun gestartet werden und nicht einfach mittels<BR>
&gt; run ? Der einzige Unterschied besteht darin, da&szlig; wbrun einen<BR>
&gt; Doppelklick auf das Programmicon &quot;simuliert&quot; und demzufolge die<BR>
&gt; Tooltypes ausgewertet werden. Jedes gute Programm kann aber<BR>
&gt; genausogut per Kommandozeilenoptionen konfiguriert werden.<BR>
<P>
[Bitte lest zu diesem Sachverhalt unten im Text weiter. Gernod Schomberg
&lt;<A HREF="mailto:G.Schomberg@t-online.de">G.Schomberg@t-online.de</A>&gt; und Michael Christoph haben sich zusammen diesem
Problem angenommen.]
</P>
<P>
Einen weiteren Leserbrief zu Verhaltensregeln bei Problemen mit der
Installation eines neuen AmigaOS' bzw Updates habe ich von Wolfgang
Hosemann &lt;<A HREF="mailto:whose@t-online.de">whose@t-online.de</A>&gt; (ebenfalls OS3.9-Betatester) erhalten. Ich
werde (mit Genehmigung von Wolfgang Hosemann) den Leserbrief nur partiell
ver&ouml;ffentlichen, da einige Teile davon nicht in die &Ouml;ffentlichkeit geh&ouml;ren
bzw. ein Missverst&auml;ndnis darstellen. Hier die Mail:
</P>
<P><BR>[Schnipp...]</P>
&gt; Ich m&ouml;chte daher folgende Ratschl&auml;ge loswerden:<BR>
&gt;<BR>
&gt; Wenn ein Boing-Bag eingespielt werden soll, bootet von der<BR>
&gt; Notfall-Diskette! Das ist definiert und sauber, in jedem Fall (sie<BR>
&gt; ist so angelegt, da&szlig; es auf wirklich allen Hardware-Kombinationen<BR>
&gt; laufen sollte. Es gibt zwar Ausnahmen davon, aber die sind sehr,<BR>
&gt; sehr selten). Wenn dann Probleme auftauchen, kann man diese<BR>
&gt; einfacher lokalisieren.<BR>
&gt;<BR>
&gt; Verzichtet auf Patches, auch wenn sie bei Euch ausnahmsweise<BR>
&gt; zusammen mit OS3.9 funktionieren. Es ist schon bei OS3.5<BR>
&gt; ausdr&uuml;cklich erw&auml;hnt, da&szlig; es keine Garantie f&uuml;r die Zusammenarbeit<BR>
&gt; von OS-Updates mit Patches der Systemsoftware gibt. Diese Warnung<BR>
&gt; gab und gibt man nicht zum Spa&szlig; aus!<BR>
&gt;<BR>
&gt; Schlagt nicht sofort auf die Leute ein, die das OS weiterentwickeln.<BR>
&gt; Diese Leute tun ihr Bestes, um Euch wirklich gute und stabile<BR>
&gt; Software zu liefern. Da der Markt 'Amiga' aber geradezu l&auml;cherlich<BR>
&gt; klein ist, geht das nicht auf Anhieb und vor allem nicht in einem<BR>
&gt; Rutsch. Windows ist noch viel st&auml;rker erst beim Benutzer gereift<BR>
&gt; (Stichwort Bananaware!). Als Ausgleich daf&uuml;r stehen die Macher von<BR>
&gt; OS3.9 aber immer gern mit Rat und Tat zur Seite, und das auch noch<BR>
&gt; kostenlos.<BR>
&gt;<BR>
&gt; Die Ratschl&auml;ge solltet Ihr vielleicht mal in Eurem Magazin<BR>
&gt; ver&ouml;ffentlichen, damit auch die Leute es mitkriegen, die sich<BR>
&gt; Anleitungen und ReadMe's grunds&auml;tzlich nicht durchlesen. Nebenbei<BR>
&gt; bemerkt gibt es f&uuml;r diese F&auml;lle immer noch eine zus&auml;tzliche<BR>
&gt; Anlaufstelle, die st&auml;ndig aktualisiert wird.<BR>
&gt;<BR>
&gt; Im Zweifelsfall www.gregdonner.org ansteuern, da steht vielleicht<BR>
&gt; die L&ouml;sung zum Problem oder fragt Greg direkt. Er ist extrem<BR>
&gt; hilfsbereit und versucht sein Bestes, um Probleme zu l&ouml;sen und die<BR>
&gt; L&ouml;sung daf&uuml;r allen zug&auml;nglich zu machen. Soweit mir bekannt ist,<BR>
&gt; steht er auch st&auml;ndig mit dem OS-Team in Verbindung, um bei<BR>
&gt; erkannten Problemen auf Abhilfe oder zumindest einen Workaround zu<BR>
&gt; dr&auml;ngen.<BR>
&gt;<BR>
&gt; Gr&uuml;&szlig;e<BR>
&gt; --<BR>
&gt; Wolfgang Hosemann<BR>
<P>
Wolfgang hatte mir eigentlich zugesagt, einen &uuml;berarbeiteten Kommentar f&uuml;r
die Ver&ouml;ffentlich zur Verf&uuml;gung zu stellen. Leider hat das aus Zeitgr&uuml;nden
nicht geklappt. Er hat mir aber noch einige zus&auml;tzliche Anlaufpunkte und
Hilfestellungen bei Problemen genannt. Diese k&ouml;nnt ihr der n&auml;chsten Mail
entnehmen:
</P>
<P><BR>[Schnipp...]</P>
&gt; Ich w&uuml;rde sagen, wir belassen es dabei. Mit Sicherheit wird sich<BR>
&gt; bald wieder die Gelegenheit finden, meine Ansichten zum Thema OS3.9<BR>
&gt; und Probleml&ouml;sungen daf&uuml;r bei Euch zu ver&ouml;ffentlichen (wenn ich dann<BR>
&gt; noch darf ;o) ).<BR>
<P><BR>[Das darfst du ;)!]</P>
&gt; Als kleine Hilfe f&uuml;r die kommende Zeit k&ouml;nntet Ihr ja nochmal die<BR>
&gt; bekannten Anlaufstellen bei Problemen nennen. Da w&auml;ren der<BR>
&gt; OS3.9-Support bei Haage&amp;Partner. F&uuml;r den Support ist meines Wissens<BR>
&gt; nach Martin Steigerwald zust&auml;ndig. Leider hat der gute Mann so viele<BR>
&gt; andere Aufgaben, da&szlig; f&uuml;r den eigentlichen Support wenig Zeit bleibt<BR>
&gt; (soll hei&szlig;en: Bei bestimmten Problemen hat er nicht genug Zeit, um<BR>
&gt; die Ursache festzustellen. Das betrifft haupts&auml;chlich die Probleme,<BR>
&gt; die beim Betatest nicht in Erscheinung getreten sind, da sie auf<BR>
&gt; bestimmte Hard-/Software-Kombinationen zur&uuml;ckzuf&uuml;hren sind).<BR>
&gt;<BR>
&gt; Falls Euch mal einer Eurer Leser ein Problem mit Wechselplatten<BR>
&gt; meldet, da&szlig; ganz definitiv auf OS3.9 zur&uuml;ckzuf&uuml;hren ist, k&ouml;nnt Ihr<BR>
&gt; ihn an mich verweisen. An sich mache ich zwar den Support f&uuml;r STFax,<BR>
&gt; hatte aber mal mit einem Problem zu tun, da&szlig; mit 3.5 und<BR>
&gt; ZIP-Laufwerken auftrat und bei dem der Support keinen Rat wu&szlig;e.<BR>
&gt; Damit kenne ich mich jetzt aus ;) Das gilt aber auch f&uuml;r Probleme in<BR>
&gt; Verbindung mit PFS3 oder SFS.<BR>
&gt;<BR>
&gt; Allen anderen sei weiterhin die OS3.5/3.9-FAQ von Greg Donner ans<BR>
&gt; Herz gelegt. Da taucht vieles auf, was immer wieder gefragt wird<BR>
&gt; oder f&uuml;r Probleme sorgt. Ich habe aus zuverl&auml;ssiger Quelle geh&ouml;rt,<BR>
&gt; da&szlig; einige Fragen zu WBRun bald dort auftauchen werden und somit<BR>
&gt; nat&uuml;rlich auch die Antworten ;)<BR>
&gt;<BR>
&gt; Apropos: Einer Eurer Leser hat inzwischen festgestellt, wo sein<BR>
&gt; Problem mit WBRun lag und auch einen entsprechenden<BR>
&gt; Verbesserungsvorschlag gemacht, der wohl auch umgesetzt wird.<BR>
&gt;<BR>
&gt; Man sollte nicht versuchen, mittels WBRun Programme zu starten,<BR>
&gt; bevor die workbench.library (resp. die Workbench) ge&ouml;ffnet wurde.<BR>
&gt; Das geht aus verst&auml;ndlichen Gr&uuml;nden nat&uuml;rlich schief. Nur die<BR>
&gt; Fehlermeldung ist etwas unsinnig in dem Zusammenhang und f&uuml;hrt in<BR>
&gt; die Irre. An der passenden Reaktion von WBrun wird aber meines<BR>
&gt; Wissens bereits gearbeitet.<BR>
&gt;<BR>
&gt; So, da&szlig; war's soweit. Man h&ouml;rt (liest) sich!<BR>
&gt;<BR>
&gt; Mit freundlichem Gruss,<BR>
&gt;<BR>
&gt; Wolfgang Hosemann<BR>
<P>
Gernod Schomberg hatte im Nachtrag zum BB3.9.1-Review die Probleme mit dem
neuen WBRun-Kommando bzw. AsyncWB erw&auml;hnt. Wie ich oben schon geschrieben
hatte, f&uuml;hrte dies zu einer gemeinsamen Fehlersuche. Die beiden Mails von
Gernod und Michael m&ouml;chte ich euch nicht vorenthalten. Hier die Mail von
Michael Christoph:
</P>
&gt; Hi Christian,<BR>
&gt;<BR>
&gt; ich habe jetzt beide Fehlerursachen mit Gernold untersucht. Hier die<BR>
&gt; Ergebnisse:<BR>
&gt;<BR>
&gt; wbrun ben&ouml;tigt zum Starten der Programme die workbench.library,<BR>
&gt; welche aber erst aktiviert wird, wenn die Workbench l&auml;uft. Daher ist<BR>
&gt; es prinzipbedingt nicht m&ouml;glich (und war niemals beabsichtigt),<BR>
&gt; mittels wbrun Programme aus der User-Startup zu starten. L&ouml;sung<BR>
&gt; &quot;systemhackendes&quot; wbrun verwenden (z.B. von Fish Disk 757) oder<BR>
&gt; normales run verwenden.<BR>
&gt;<BR>
&gt; AsyncWB arbeitet fehlerfrei - das Problem ist hier ebenfalls die<BR>
&gt; Workbench. Eine L&ouml;sung gibt es noch nicht - Olaf Barthel wird sich<BR>
&gt; die Sache aber sicher noch genauer ansehen. Das Problem ist<BR>
&gt; &uuml;brigens das Duplizieren von Dateien in der selben Partition -<BR>
&gt; partitions&uuml;bergreifend funktioniert auch Multi-Kopieren ohne<BR>
&gt; Problem.<BR>
&gt; L&ouml;sung: Dateien/Schubladen einzeln duplizieren (obwohl es mir nicht<BR>
&gt; klar ist, wieso Kopien von Dateien in der selben Partition erzeugt<BR>
&gt; werden sollen).<BR>
<P><B>Hier noch die Mail von Gernod:</B></P>
&gt; Hallo Christian, (Deine Nachricht vom 12-Mai-01)<BR>
&gt;<BR>
&gt; nach mehreren Nachrichten hin und her hat es nun ein<BR>
&gt; zufriedenstellendes Ende ergeben. Michael Christoph erkannte, woran<BR>
&gt; diese M&auml;ngel, die ich erlebt hatte, lagen und hat auch noch einiges<BR>
&gt; andere gesehen, was mir garnicht auffallen konnte. Z.B. hatte er mir<BR>
&gt; eine neue, noch nicht ver&ouml;ffentlichte Version von &quot;WBRun&quot;<BR>
&gt; zugeschickt, die bei mir regelm&auml;&szlig;ig mit &quot;Datei nicht ausf&uuml;hrbar&quot;<BR>
&gt; abbrach. Nach einigem Fragen und Antworten sandte er mir die Datei,<BR>
&gt; diesmal gepackt zusammen mit &quot;SnoopDOS&quot;, das ich allerdings, in<BR>
&gt; neuerer Version schon hatte, zu, und dieses &quot;WBRun&quot; reagierte<BR>
&gt; einwandfrei.<BR>
&gt;<BR>
&gt; Ich hatte schon eine Nachricht fertig, in der ich beide WBRuns mit<BR>
&gt; unterschiedlichem Namen beigepackt hatte, zur Kontrolle entpackte<BR>
&gt; ich sie noch ein Mal und jetzt funktionierten beide! Darauf hin<BR>
&gt; kontrollierte ich die Originale und merkte, dass sie sich nur durch<BR>
&gt; das Schutzbit &quot;e&quot; unterschieden, das bei einer Version gesetzt und<BR>
&gt; bei der anderen nicht gesetzt war! Die Packer hatten das Schutzbit<BR>
&gt; manipuliert.<BR>
&gt;<BR>
&gt; Michael war sehr verbl&uuml;fft, dass das bei OS3.9 eine Rolle spielt,<BR>
&gt; denn bisher sei die Ausf&uuml;hrbarkeit eines Programms durch die<BR>
&gt; Startbytes im Programm selbst bestimmt worden. Und der Grund, warum<BR>
&gt; das neue &quot;WBRun&quot; nicht aus der &quot;User-Startup&quot; heraus l&auml;uft, liegt<BR>
&gt; offenbar daran, dass die WB noch nicht ge&ouml;ffnet und damit die<BR>
&gt; zust&auml;ndige Library nicht aktiv ist.<BR>
&gt;<BR>
&gt; Auch die Sache mit dem Massen-Kopieren von Dateien in einem<BR>
&gt; Verzeichnis hat er an verschieden Programmierer weiter gegeben.<BR>
&gt;<BR>
&gt; Damit haben die Herren wieder mal etwas zu denken.<BR>
&gt;<BR>
&gt;<BR>
&gt; Mit freundlichem Gruss,<BR>
&gt;<BR>
&gt; Gernod<BR>
<P>
Was die &uuml;berarbeitete Version von WBRun betrifft: Anwender die Probleme mit
diesem neuen Befehl haben, sollten sich bei oben genannten (und am Ende
dieses Textes nochmal zusammengefa&szlig;ten) Support-Adressen melden und wegen
der &uuml;berarbeiteten Version einfach mal nachfragen. Wie ihr den Kommentaren
entnehmen k&ouml;nnt, sind die Mitarbeiter des OS3.9-Teams durchaus bereit bei
Problemen zu helfen. Das Problem zu melden liegt aber immer noch im
Aufgabenbereich des Anwenders. &quot;Hellsehen&quot; k&ouml;nnen die Mitarbeiter vom
OS3.9-Support noch nicht ;).
</P>
<P>
Zum Schlu&szlig; m&ouml;chte ich noch sagen, da&szlig; es gar nicht so einfach war, alle
erhaltenen Leserzuschriften in einem gemeinsamen (Kon-)Text
zusammenzufassen.
</P>
<P>
Ich hoffe aber trotzdem, da&szlig; ich hier zufriedenstellende Antworten
zusammengetragen habe und nicht noch einen Nachtrag schreiben mu&szlig; ;).
</P>
<P><B>Quellen f&uuml;r den OS3.9-Support:</B></P>
AmigaOS3.9-FAQ:<BR>
<A HREF="http://www.gregdonner.org/os39faq/os39faq.html" TARGET="_top">http://www.gregdonner.org/os39faq/os39faq.html</A><BR>
<BR>
AMIGA, Inc. (Auflistung mehrerer Support-Quellen):<BR>
<A HREF="http://www.amiga.com/3.9/support.shtml" TARGET="_top">http://www.amiga.com/3.9/support.shtml</A><BR>
<BR>
Haage&amp;Partner:<BR>
<A HREF="http://www.haage-partner.de/aos39/support-d.html" TARGET="_top">http://www.haage-partner.de/aos39/support-d.html</A> (deutsche Support-Seite)<BR>
<A HREF="http://www.haage-partner.de/aos39/support-e.html" TARGET="_top">http://www.haage-partner.de/aos39/support-e.html</A> (englische Support-Seite)<BR>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Forum.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
