<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Zun&auml;chst einmal m&uuml;ssen wir eine - zumindest f&uuml;r uns - unerfreuliche
Mitteilung machen: Leider sahen wir uns gezwungen, den Gewinner von Amiga
Writer aus der letzten Ausgabe nachtr&auml;glich zu disqualifizieren, da er
versucht hatte, sich durch Mehrfachteilnahmen unter verschiedenen Namen
quasi Preise zu erschleichen, anstatt das Gl&uuml;ck entscheiden zu lassen.
Somit mussten wir Amiga Writer erneut verlosen, der Gewinner hei&szlig;t Stephan
Manske.
</P>
<P>
Nun aber zu den aktuellen Dingen: Beim letzten Gewinnspiel haben 29 Leser
mitgemacht.
</P>
<P>
Bitte denkt diesmal wieder an die Teilnahme. Ihr wisst ja, dass ihr bereits
mit zwei Antworten gewinnen k&ouml;nnt.
</P>
<P><B>Jetzt zur Aufl&ouml;sung:</B></P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Welche Versionsnummer wird laut AMIGA das n&auml;chste Release&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">des AmigaOS tragen (das nur noch f&uuml;r PowerPC-Rechner&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">erscheinen wird)?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Die gesuchte Version ist nat&uuml;rlich 4.0.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Master-Frage:&nbsp;</TD><TD VALIGN="TOP">Wann etwa soll diese AmigaOS-Version heraus kommen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Das AmigaOS 4.0 soll im Sommer dieses Jahres erscheinen.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Meinungsfrage:&nbsp;</TD><TD VALIGN="TOP">Wirst du dir diese AmigaOS-Version zulegen?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Ja, auf jeden Fall.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">5&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Ja, wenn sie meinen Erwartungen entspricht.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">15&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Nein, da ich nicht vorhabe, mir einen PowerPC-Rechner zu kaufen.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">7&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Nein, aus anderen Gr&uuml;nden.)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">2&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Einige Einsender hatten zu ihrer Beantwortung der Meinungsfrage Stellung
bezogen:
</P>
<P>
Albin Konrad ist pessimistisch: &raquo;Da ich so langsam nicht mehr an eine
&quot;gute&quot; Zukunft des Amiga glaube, werde ich diesen Wechsel nicht mehr
mitmachen. Ich bedauere dies sehr, da ich schon seit der Anfangszeit des
Amiga dabei war. Noch immer bin ich mit diesem System zufrieden und werde
es so lange wie m&ouml;glich nutzen.&laquo;
</P>
<P>
René Stelljes hat sich eine &quot;f&uuml;nfte Antwort&quot; einfallen lassen: &raquo;Aus den
m&ouml;glichen Antworten w&uuml;rde ich Nr. 2 favorisieren. Aber pers&ouml;nlich w&uuml;rde ich
Antwort 5 nehmen: 5. Ja, wenn man es sich leisten kann, bis dahin eine PPC-
Karte zu kaufen und das neue Betriebssystem nicht den Preis von Windows
&uuml;bersteigt.&laquo;
</P>
<P>
Steffen Nitz w&uuml;nscht sich eine AmigaOS-Portierung f&uuml;r Standard-Rechner:
&raquo;Ich hoffe auf AmigaOS 4 f&uuml;r x86-Prozessoren mit vollst&auml;ndiger
Kompatibilit&auml;t f&uuml;r Software ab OS 2.0.&laquo;
</P>
<P>
Wolfgang Mai hofft, dass das AmigaOS 4.0 auch mit den PowerUp-Boards
betrieben werden kann: &raquo;Das OS 4.0 w&uuml;rde ich mir gern zulegen, allerdings
zur Zeit nur, wenn es auf meiner derzeitigen Hardware (PPC603e+ mit 96 MB
RAM, BVision) l&auml;uft. Ein komplettes PPC-Board ist mir derzeit zu teuer, und
au&szlig;erdem bin ich noch skeptisch, ob sich diese Investition im Moment schon
lohnt (zu viele Entt&auml;uschungen mitgemacht!!!).&laquo;
</P>
<P>
André Beer sieht das &auml;hnlich: &raquo;Ich werde mir voraussichtlich AmigaOS 4.0
kaufen, wenn es auch auf meiner BlizzardPPC l&auml;uft und einen echten Nutzen
(=Geschwindigkeitsschub) bringt. Ansonsten werde ich weiter warten, bis ein
AmigaDE-Computer mit AmigaOS 5.0 serienreif ist.&laquo;
</P>
<P>
Auch Kai Stegemann wartet erst einmal die weitere Entwicklung ab: &raquo;F&uuml;r das
neue OS sollte erstmal der neue PPC-Rechner dasein, dann kann sich Amiga
wieder etwas weiter aus dem Fenster lehnen. Au&szlig;erdem sollte das SDK fertig
sein, bevor irgendeine Software daf&uuml;r erscheint. Dann kann man weiter
sehen. Was die Amis so im Geheimen treiben, soll uns Normalos erstmal nicht
interessieren.&laquo;
</P>
<P>
Andreas Wolf vertraut eher AMIGAs Konkurrenz: &raquo;Eine Erwartung, die ich an
das AmigaOS 4.0 stelle, ist, da&szlig; es mir zusammen mit dem Escena/Eyetech-
Board attraktiver erscheinen mu&szlig; als MorphOS + Pegasos. Das d&uuml;rfte
schwierig werden, denn zum Einen bietet BPlan die leistungsf&auml;higere
Hardware zum (voraussichtlich) g&uuml;nstigeren Preis, zum Zweiten glaube ich,
da&szlig; sie fr&uuml;her als Amiga Inc. + Eyetech ein fertiges Produkt in die L&auml;den
bringen werden.&laquo;
</P>
<P>
Stephan K&ouml;hler setzt auf das AmigaDE: &raquo;Mein PPC-Board ist mit Phase 5
untergegangen, und da es nicht sicher ist, ob das neue AOS 4.x diese Karten
unterst&uuml;tzt, kaufe ich mir nicht noch mal eine, sondern spare mir das Geld
f&uuml;r das AmigaDE.&laquo;
</P>
<P>
Oliver Hummel &auml;u&szlig;ert seine Meinung ausf&uuml;hrlich: &raquo;Amiga OS 4.0, PPC-
native... Eigentlich das, was sich viele Anwender gew&uuml;nscht hatten. Leider
gibt es nun wieder jede Menge Amiganer, denen dieser Kurs nicht gef&auml;llt...
Es scheint, als ob der Durchschnitts-Amiganer neben seiner unglaublichen
F&auml;higkeit, abzuwarten, was da kommen mag, auch die etwas uns&auml;gliche
Angewohnheit hat, erst mal zu meckern.
</P>
<P>
Sicher, AmigaDE w&auml;re/wird (die Pl&auml;ne f&uuml;r DE laufen ja weiter!!) sicher
nicht ganz verkehrt, aber mal ehrlich, das Amiga OS, wie wir es kennen, neu
aufpoliert UND PPC-native, das w&auml;re doch eine feine Sache!
Bleibt abzuwarten, ob Amiga, Inc ihr Time-Table einhalten k&ouml;nnen und, was
genauso wichtig ist, dass die 3rd-Party-Firmen ihre Hardwareplattformen
anbieten k&ouml;nnen! Wie auch immer, ich hoffe sp&auml;testens zu Weihnachten
endlich wieder neue Hardware und ein neues OS zur Verf&uuml;gung zu haben!&laquo;
</P>
<P>
Bastian Kinne nimmt als Antwort &raquo;am ehesten 3, ich habe nicht vor, mir
einen PPC-Rechner zuzulegen, es sei denn, das Preis/Leistungs-Ratio f&uuml;r
eine solche Hardware &uuml;berzeugt mich - dann ist wohl auch OS 4.0 dabei. :-)&laquo;
</P>
<P>
Harry Fisch hat kaum Hoffnung: &raquo;Mal sehen, ob ich diesen Sommer meinen
Athlon verkaufen kann ;-). Bin aber sehr, sehr skeptisch.&laquo;
</P>
<P>
Claus L&uuml;thje will sich das AmigaOS 4.0 auf jeden Fall kaufen und ist der
Ansicht, dass sich AMIGAs Richtung nicht ge&auml;ndert habe: &raquo;Der sogenannte
'Strategiewechsel' von Amiga, Inc, ist nur f&uuml;r all diejenigen eine
&Auml;nderung, die die urspr&uuml;ngliche Strategie nicht verstanden hatten. (Dass
nun AmigaDE nicht zu einem 100%-OS ausgebaut wird, sondern das bestehende
AmigaOS angepasst wird, ist ja wohl f&uuml;r Benutzer ziemlich unwichtig.)&laquo;
</P>
<P>
Christian Runda will sich kein PowerPC-System zulegen: &raquo;Ich hatte damals
eine G4-Karte von phase 5 vorbestellt, und weder die Karte noch meinen
Vorschuss jemals erhalten. Ich habe nicht die Absicht, nochmals Geld daf&uuml;r
zu investieren.&laquo;
</P>
<P><B>Fazit:</B></P>
<P>
Eine klare Mehrheit der Teilnehmer will sich das AmigaOS 4.0 zumindest dann
zulegen, wenn es den eigenen Erwartungen entspricht. Von denjenigen, die
sich das Betriebssystemupdate nicht kaufen wollen, wird vor allem die
Prozessorwahl kritisiert.
</P>
<P>
Auff&auml;llig ist &uuml;brigens, dass sich haupts&auml;chlich die Kritiker der Pl&auml;ne mit
Kommentaren zu Wort gemeldet haben.
</P>
<P><BR><B>Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:</B></P>
1 x Vollversion von &quot;CDCat&quot;: Wolfgang Bauer<BR>
1 x Vollversion von &quot;ArtEffect 4&quot;: Dirk Neubauer<BR>
1 x 3-Ausgaben-Abo der Amiga Future; mit CD, ohne Pr&auml;mie: Wolf Zimmer<BR>
<P><B>Herzlichen Gl&uuml;ckwunsch!</B></P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
