<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
<b>Auf der Suche nach Beteiligung und konstruktiver Kritik (von Christian Aichinger)</b>
</P>
<P>
&quot;Fini&quot; f&uuml;r diesen Monat. Ich denke, es waren wieder einige interessante
Artikel dabei. Ich m&ouml;chte in diesem Schlu&szlig;wort noch auf etwas hinweisen,
das mir und der gesamten Redaktion sehr am Herzen liegt. Diejenigen unter
den Lesern, die an dieser oder fr&uuml;heren AMIGA-aktuell-Ausgaben etwas zu
bem&auml;ngeln haben, sollten sich die folgenden, letzten Worte dieser Ausgabe
doch bitte etwas genauer durchlesen. Es geht unter Anderem um &quot;konstruktive
Kritik&quot;.
</P>
<P>
&quot;Konstruktive Kritik&quot; ist f&uuml;r das AMIGA-aktuell-Team sehr wichtig. Sie
hilft allen Mitarbeitern, die eigene Arbeit aus einem anderen Blickwinkel
zu sehen und die eingeschr&auml;nkten Mittel (Zeit, Arbeitsaufwand, usw.) so gut
wie m&ouml;glich einzusetzen. Nicht umsonst weist Carsten in jedem Editorial
darauf hin, da&szlig; sich jeder Redakteur &uuml;ber konstruktive Kritik freut. Leider
scheint es so, da&szlig; dieser Aufruf f&uuml;r viele Leser nur noch eine Floskel
darstellt, die blo&szlig; von Wenigen bewu&szlig;t wahr- bzw. ernstgenommen wird.
Deshalb m&ouml;chte ich noch einmal explizit darauf hinweisen: Es gen&uuml;gt, wenn
eine kurze, aussagekr&auml;ftige E-Mail an den entsprechenden Redakteur
geschickt wird. Niemand wird dem Leser aufgrund seiner Kritik den Kopf
abrei&szlig;en, solange es sich bei der Kritik auch um solche handelt. Eine
weitere M&ouml;glichkeit ist die im letzten Monat er&ouml;ffnete E-Mail-
Verteilerliste, in der jeder Leser mit anderen Lesern und einem Gro&szlig;teil
der Redaktion &uuml;ber AMIGA aktuell (und noch einige andere Dinge) diskutieren
kann. Meist wird einem selbst erst nach einem Gespr&auml;ch mit anderen Lesern
klar, wie der Hase l&auml;uft - oder besser gesagt, wie die Interessen unter der
Allgemeinheit der Leser verteilt sind.
</P>
<P>
Leider kommt es auch manchmal vor, da&szlig; jemand &quot;konstruktive Kritik&quot; mit
&quot;Beleidigungen&quot; und &quot;Gemecker&quot; verwechselt oder dies sogar bewusst tut. Es
kann z.B. nicht angehen, da&szlig; ein Leser von der Redaktion fordert, komplette
Rubriken ersatzlos einzustellen, ohne irgendeinen triftigen Grund daf&uuml;r zu
nennen. Es kann ebenfalls nicht sein, da&szlig; sich diese Person anma&szlig;t, das
Magazin zu kritisieren, wenn sie selbst AMIGA aktuell nur in archivierter
Form auf ihrer Festplatte &quot;sammelt&quot;, ohne es &uuml;berhaupt zu lesen. Ich w&uuml;rde
demjenigen doch sehr empfehlen, sich zuerst zu &uuml;berlegen, was er &uuml;berhaupt
kritisieren und wie er es selbst besser machen k&ouml;nnte. Interessiert
jemanden eine komplette Rubrik &uuml;berhaupt nicht, soll er sie doch bitte
dezent &uuml;berlesen und sich anderen Artikeln zuwenden. Niemand kann von den
eigenen Interessen auf die Interessen anderer Leser schlie&szlig;en. Noch besser
w&auml;re es nat&uuml;rlich, wenn sich diejenigen Leser diesem - nach ihrem Empfinden -
Mi&szlig;stand widmen und sich selbst hin und wieder mit Artikeln bei der
Redaktion melden w&uuml;rden.
</P>
<P>
Ich glaube, damit w&auml;re ich auch bei dem Knackpunkt dieses Schlussworts.
Jeder entt&auml;uschte Leser sollte sich &uuml;ber eines im Klaren sein: AMIGA
aktuell ist ein Magazin von Lesern f&uuml;r Leser. Erkl&auml;rt sich niemand bereit,
etwas f&uuml;r AMIGA aktuell zu tun, ist es nur eine Frage der Logik, da&szlig; AMIGA
aktuell langweilig und damit f&uuml;r viele nicht zufriedenstellend ausf&auml;llt.
Alle Mitarbeiter machen ihre Aufgabe f&uuml;r AMIGA aktuell aus reinem Spa&szlig; und
gro&szlig;en Enthusiasmus. Sie werden f&uuml;r ihre Arbeit nicht bezahlt und sind mit
ihren Aufgaben zum Teil schon eher &uuml;ber- als ausgelastet. Niemand kann von
AMIGA aktuell erwarten, teure Hard- und Software zu kaufen, Interviews zu
organisieren oder &uuml;ber Hintergr&uuml;nde und Neuigkeiten zu informieren, wenn
weder Zeit noch Geld f&uuml;r solche Dinge zur Verf&uuml;gung stehen. Wir sind auf
Anwender angewiesen, die sich entsprechende Dinge gekauft haben, Kontakte
zu interessanten Personen besitzen oder &uuml;ber bestimmte technische
F&auml;higkeiten/Kenntnisse verf&uuml;gen. Einen Lohn in Form von Geld gibt es f&uuml;r
die ganze Arbeit zwar nicht, aber doch die Hoffnung, da&szlig; ein anderer Leser
eines Tages einen Text &uuml;ber ein Thema schreibt, das vielleicht den eigenen
Interessen entspricht.
</P>
<P>
Ich m&ouml;chte hiermit alle &quot;stillen&quot; Leser bitten, mir einen Artikelwunsch
(Hardware-Review, Interview, Workshop oder was euch sonst noch so einf&auml;llt)
und dazu einen eigenen Text (das kann von der Vorstellung eines
klitzekleinen Shell-Programms bis zum Workshop eines selbstgebastelten
Amiga-Motherboards so ziemlich alles sein) zuzusenden. Ich werde alle
Leserw&uuml;nsche in einem Text in das AMIGA-aktuell-Forum stellen, in der
Hoffnung, da&szlig; sich andere Leser dazu bereit erkl&auml;ren, sich einem der
aufgef&uuml;hrten Berichte anzunehmen.
</P>
<P>
Mir zugesandte Beitr&auml;ge werden in der n&auml;chsten Ausgabe ver&ouml;ffentlicht.
</P>
<P>
So, jetzt fangt gleich flei&szlig;ig mit dem Schreiben an ;)! Ich bin schon
gespannt auf eure Texte.
</P>
<P><B>Bis zum n&auml;chsten Mal,</B></P>
<P><B>Christian Aichinger &lt;<A HREF="mailto:christian@aakt.de">christian@aakt.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
