<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Amiga 1000 Phoenix, Legende oder Wahrheit? - Teil 1 (von Werner Brennecke)</H2>
<P>
Einleiten m&ouml;chte ich das Ganze in Gedenken an den k&uuml;rzlich
verstorbenen Douglas Adams mit einer meiner Lieblingspassagen aus dem
Buch &quot;Per Anhalter durch die Galaxis&quot;. Viele seiner Figuren und Namen
sind in Amiga Hard- und Software eingeflossen, z.B. in die Zaphod Service
Task der Commodore AT-Br&uuml;ckenkarte oder in den Amiga 1000 Sidecar.
</P>
<P>
&quot;Stre&szlig; und nerv&ouml;se Spannungen sind jetzt in allen Gegenden der Galaxis
ernsthafte soziale Probleme, und damit diese Situation nicht noch weiter
versch&auml;rft wird, sollen die folgenden Tatsachen schon im voraus verraten
werden.&quot;
</P>
<P>
Ja, es gab wirklich ein Ph&ouml;nix-Board f&uuml;r den Amiga 1000, dies war ein
komplettes Tauschboard, das als Ersatz f&uuml;r die orginal eingebaute
Hauptplatine gedacht war. Lediglich Netzteil, Geh&auml;use, Tastatur und Maus
wurden &uuml;bernommen. Der Umbau machte den A1000 dem A3000 sehr &auml;hnlich. Nur
der 68000er Prozessor blieb.
</P>
<P><B>Nun zum ausf&uuml;hrlichen Teil:</B></P>
<P>
Um die Idee zu verstehen, die hinter dem Ph&ouml;nixboard steckt, m&uuml;ssen wir
die Zeit f&uuml;r Amiga-User, die sp&auml;ter eingestiegen sind, mal ein paar Jahre
zur&uuml;ck drehen.
</P>
<P>
1985: Die meisten Homecomputer-User arbeiten mit dem Commodore C64/C128,
Schneider CPC, Atari usw. (Die Reihenfolge soll keine Wertung sein). Ein
PC kostete damals so viel wie ein Mittelklassewagen.
</P>
<P>
In diesem Jahr erschien der Amiga 1000 mit erstaunlichen F&auml;higkeiten
auf der Bildfl&auml;che : 68000er Prozessor mit 7,14 MHz, 256 KByte RAM,
4096 Farben, Multitasking, BASIC-Interpreter usw. Jedem Amiga-User
sind wahrscheinlich die Daten des OCS bekannt.
</P>
<P>
Alleine der Preis war der Wermutstropfen bei seiner Einf&uuml;hrung, gut
7000 DM sollte er kosten.
</P>
<P>
Erst seit Vobis 1986 den Amiga 1000 in sein Programm &uuml;bernahm, fiel
der Preis auf knapp unter 4000 DM. Als gegen Ende 1987 Vobis (und
wahrscheinlich auch andere H&auml;ndler) den Preis auf 1698 DM senkte, war
ein akzeptabler Preis f&uuml;r die breite Masse erreicht und der A1000
startete seinen endg&uuml;ltigen Siegeszug. Dies war auch der Zeitpunkt,
als ich meinen C128 ver&auml;u&szlig;erte, um das System zu wechseln :-)
</P>
<P>
Nach einigen Softwaregenerationen merkte man aber schnell, dass 512 kByte
Chipmem sehr schnell aufgebraucht sind. So war es z.B. in Deluxe Paint
zwar m&ouml;glich ein 16 farbiges Bild mit 640 x 512 Punkten zu bearbeiten,
der Speicher reichte jedoch dann &uuml;berhaupt nicht mehr f&uuml;r gro&szlig;e
Pinsel oder die Undo-Funktion. Festplatten wurden auch mit der Zeit
erschwinglich, nur hatte man keine M&ouml;glichkeit, diese irgendwo
anzuschliessen. Nicht mal ein internes Slotsystem f&uuml;r einen Controller
oder RAM-Erweiterung war vorhanden.
</P>
<P>
Als A1000-Besitzer merkte man dann sehr schnell, das Erweiterungen, die
an den externen Zorro-I-Connector angeschlossen wurden, sehr teuer
waren.
</P>
<P>
Dies war wahrscheinlich die Marktl&uuml;cke, die Ph&ouml;nix Microelectronics
damals sah und deswegen das Ph&ouml;nix Board 1991 vorstellte. Die
technischen Daten waren absolut &quot;up to date&quot; und kein anderer Amiga
bot meiner Meinung nach dieses Preis/Leistungsverh&auml;ltniss.
</P>
<P><B>Besondere Features waren:</B></P>
<UL>
<LI> ECS (Enhanced Chip Set) mit 2 MB Chipmem
</LI>
<BR><LI> Interner SCSI-Festplatten-Autoboot-Controller, der den Commodore RDB
  Standard unterst&uuml;tzt
</LI>
<BR><LI> Sockel f&uuml;r 3 verschiedene Kickstartversionen (umschaltbar)
</LI>
<BR><LI> Einbauschienen f&uuml;r eine interne HD
</LI>
<BR><LI> B2000 kompatibler Video-Slot
</LI>
<BR><LI> B2000 kompatibler Expansion-Slot
</LI>
<BR><LI> Mathematischer 68881/2-Koprozessor
</LI>
<BR><LI> Akku-gepufferte Echtzeituhr
</LI>
<BR><LI> Abschaltbarer Tiefpassfilter
</LI>
<BR><LI> Monochromer Video-Ausgang f&uuml;r hochaufl&ouml;sende Darstellung
</LI>
<BR><LI> Interne RS232-Schnittstelle
</LI>
<BR><LI> Umschalter f&uuml;r Diskettenlaufwerke (Bootselektor)
</LI>
<BR><LI> Alle ICs gesockelt
</LI>
</UL>
<P>
Nach Infos des Vorbesitzers meines A1000 Ph&ouml;nix (an dieser Stelle
vielen Dank an Patrick Werner f&uuml;r das geduldige Beantworten meiner
Fragen) kostete das Board nackt 950.- DM. Der Rechner musste
eingeschickt werden zum Umbau, das Original-Board wurde in Zahlung
genommen. ECS Denise musste noch f&uuml;r DM 65.- dazu gekauft werden,
Kleinmaterial kam nochmals auf DM 60.-.
</P>
<P>
Auf diesem Weg entstand ein akzeptabler Rechner zu einem f&uuml;r damalige
Verh&auml;ltnisse vern&uuml;nftigen Preis und man konnte das A1000-Geh&auml;use, das
ja damals schon Kultststatus hatte, weiter nutzen. (Die Idee, die
Tastatur unter dem Rechner verstauen zu k&ouml;nnen, war einmalig genial)
</P>
<P>
So viel zum Teil 1. Bis zur n&auml;chsten Ausgabe habe ich die M&ouml;glichkeit,
eine digitale Kamera zu nutzen und ein paar Livebilder mit Erkl&auml;rung zu
liefern.
</P>
<P><B>Ich verbleibe bis dahin,</B></P>
<P><B>Euer Werner Brennecke &lt;<A HREF="mailto:wb@pag.mayn.de">wb@pag.mayn.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Workshops4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
