<HTML><HEAD>
<TITLE>Amiga Aktuell Spieleteil  09/97 - Previews</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 09/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105>
<CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER>
</TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP></TD>
<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Previews</H2>
<H3><B>onEscapee (Sadeness Software) - spielbares Demo im Aminet (game/demo)
erh&auml;ltlich   - mind. 68020 4 MB RAM OS 3.0</B><P>
<CENTER><IMG WIDTH=320 HEIGHT=204 SRC="OnEscapee.jpg" ALT="Screenshot"><BR></CENTER>
Nach all dem, was ich &uuml;ber dieses Spiel gelesen hatte, waren meine Erwar-
tungen riesengroﬂ. Als nun ein 5 MB groﬂes, spielbares Demo im Aminet er-
schien, &uuml;bertraf es meine Erwartungen noch bei weitem. Dabei handelt es
sich bei diesem Demo sogar nur um die Mini-Version. Das vollst&auml;ndige Demo
befindet sich zum Beispiel auf der n&auml;chsten Cover-CD der CU AMIGA und ist
50 MB groﬂ (!!!). onEscapee ist ein Action-Adventure im Stile von Flashback
und Another World (Delphine Software).<P>
F&uuml;r all die, die dieses Spiel nicht kennen, hier eine kurze Beschreibung. Bei onEscapee steuert man einen Mann,
der sich in einer Zukunfts-Landschaft rumschlagen muﬂ und dabei Roboter
bek&auml;mpfen muﬂ, kleine R&auml;tsel l&ouml;sen muﬂ und vieles mehr.<P>
Was das Spiel dabei von anderen Spielen absetzt, ist vor allem die hervorragende Grafik. Die
Animation des Hauptcharakters besteht aus 600 Frames, er kann laufen, sich
auf dem Boden rollen, springen und soll sogar schwimmen und bergsteigen
k&ouml;nnen. Die gesamte Grafik mit zahlreichen Licht- und Schatteneffekten
sorgt daf&uuml;r, daﬂ man sich sofort in der Science Fiction-Welt heimisch
f&uuml;hlt. Auch die Musik tut ihr &uuml;briges daf&uuml;r.<P>
Der einzige Kritikpunkt ist vielleicht die etwas schwammige Steuerung, aber die ist zu
verschmerzen, vielleicht wird sie ja bis zur Endversion noch verbessert. Auch wen die
Gr&ouml;ﬂe des Demos abschreckt, es aus dem Aminet herunterzuladen, sollte es
auf jeden Fall tun. Wer es nicht tut, ist selber Schuld. Wer das Demo dann
angespielt hat, wird mit mir kaum die Zeit abwarten k&ouml;nnen, bis die Voll-
version erh&auml;ltlich sein wird. Dies wird wahrscheinlich im September oder
im Oktober soweit sein.<P><BR>
<B>Sword (Titan Computer) - spielbares Demo auf der Homepage erh&auml;ltlich</B><P>
Endlich mal wieder ein gelungenes Jump N Run. Man steuert einen kleinen
Mann durch die Unwegbarkeiten eines Schlosses, in dem gef&auml;hrliche Ritter,
und anderes ihm das Leben schwer machen. Zwar paﬂt die Spielfigur nicht
ganz zu der restlichen Grafik, aber das ist zu verschmerzen. Superweiches
Scrolling und eine gute Steuerung machen Lust auf die Vollversion. Nur
der Schwierigkeitsgrad m&uuml;ﬂte noch etwas verringert werden.
Sword soll im September erscheinen.<P><BR>
<B>Strangers (Vulcan Software) - spielbares Demo im Aminet erh&auml;ltlich</B><P>
Strangers ist das neueste AGA-Spiel aus dem Hause Vulcan Software. Fremd
kommt das Spiel einem aber nicht vor. Es ist ein weiteres in der langen
Liste vieler Beat em Ups. Der Spieler spielt entweder allein gegen diverse
Computergegner, im 2-Spieler-Modus gegeneinander, oder im "Deathmatch"-
Mode, bei dem sechs (menschliche) Spieler gleichzeitig gegeneinander spie-
len. Die Grafik und der Sound wirken recht ansprechend. Beides wurde im
Vergleich zu dieser Demo-Version jedoch scheinbar noch einmal kr&auml;ftig &uuml;ber-
arbeitet. Dies wurde durch die Entscheidung m&ouml;glich, das Spiel nur auf CD
herauszubringen. Wenn die verbesserte Grafik die recht gute Steuerung
nicht beeintr&auml;chtigt, d&uuml;rfen auf jeden Fall Beat-Em-Up-Fans blind zuschla-
gen. Alle anderen sollten sich zumindest, die Demo-Version anschauen, und
dann entscheiden, ob sie das Spiel kaufen. Das Spiel sollte beim Lesen
dieser Ausgabe f&uuml;r 24.99 Pfund (ca. 75 DM) sicherlich auch im deutschen
Versandhandel erh&auml;ltlich sein.</H3>
<CENTER><BR><A HREF="games002.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="games004.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>

</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
