<HTML><HEAD>
<TITLE>Amiga Aktuell 09/97 - Picasso IV</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 09/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105>
<CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER>
</TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP></TD>

<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Hardwaretest: Picasso IV</H2>


<H3><U><B>Hersteller</B></U><P>
Village Tronic<BR>
Wellweg 95<BR>
31157 Sarstedt<P>

Listenpreis: 699 DM<P><BR>


<B><U>Ben&ouml;tigte Hard-/Software</U></B>
<UL>
<LI>AMIGA oder -kompatibler Rechner mit ZorroII(I)- und Video-Slot
<LI>68020-Prozessor
<LI>OS 3.0 (OS 3.1 bei &auml;lteren Versionen von Picasso '96)
</UL><P><BR>
<U><B>Einf&uuml;hrung</B></U><P>
Die ZorroII/III-Grafikkarte Picasso IV von Village Tronic wird in einem
recht stabilen Karton mit Hochglanz-Cover ausgeliefert. Zum Lieferumfang
geh&ouml;ren neben der Grafikkarte auch ein jeweils zur H&auml;lfte deutsch- und
englischsprachiges achtzigseitiges Handbuch, eine Diskette mit der
Grafikkartensoftware Picasso '96 sowie drei Kabel, die f&uuml;r den Betrieb der
Karte am A 2000 ben&ouml;tigt werden, da Zorro- und Video-Slot bei diesem
Rechner nicht nebeneinander liegen.<P>
Besonderheiten der Picasso IV sind der eingebaute Flickerfixer/Scandoubler
sowie die vielf&auml;ltigen Anschlu&szlig;m&ouml;glichkeiten.
Neben der obligatorischen 15-poligen Buchse zum Anschlu&szlig; eines VGA-Monitors
hat die Picasso IV auch Stereo-Audio- und Video-Ein- und Ausg&auml;nge, eine
Antennenbuchse und einen Audio-Eingang zur Einspeisung der Audio-Signale
von CD-ROM-Laufwerken. Ein Teil der Anschl&uuml;sse wird jedoch erst nach
Aufr&uuml;sten der Picasso mit einem oder mehreren Zusatzmodulen ben&ouml;tigt.<P>
Village Tronic hat f&uuml;r die Zukunft folgende Erweiterungen angek&uuml;ndigt:
<UL>
<LI>MPEG-Modul
<LI>3D-Grafikbeschleuniger
<LI>PowerPC-Modul
<LI>16bit-Soundmodul
<LI>Fernseh-Modul mit Videotextf&auml;higkeit
<LI>Videoencoder zur Erzeugung eines S-VHS-/FBAS-Signals
</UL>
Somit k&ouml;nnte die Picasso IV einmal fast das gesamte AMIGA-Motherboard
ersetzen und w&uuml;rde so zu einer wahren Multimedia-Karte, wie Village Tronic
die Picasso IV &uuml;brigens auch bewirbt.<P><BR>
<U><B>Installation</B></U><P>
Vor dem Einsetzen der Karte sollten s&auml;mtliche Monitortreiber - mit Ausnahme
von PAL und NTSC - aus Devs:Monitors entfernt werden, ebenso wie eine
eventuell bereits vorhandene Grafikkartensoftware (z.B. CyberGraphX). Da
der Scandoubler der Picasso IV lediglich die Horizontalfrequenzen von PAL-
und NTSC-Bildschirmmodi verdoppelt (von 15,6 bzw. 15.72 KHz auf 31,2 bzw.
31,44 KHz), und andere AMIGA-Screenmodes nicht durchgef&uuml;hrt werden, sind
diese nicht mit der Picasso IV zu benutzen.<P>
F&uuml;r das Einsetzen der Grafikkarte in den richtigen Steckplatz mu&szlig;te beim
Testrechner (einem A 4000 Desktop) viel Kraft aufgewendet werden. Vor dem
Einbau sollte bei diesem Ger&auml;t &uuml;berpr&uuml;ft werden, ob eventuell auf dem
A4000-Motherboard installiertes PS/2-RAM auch wirklich korrekt in den
Fassungen sitzt, da zwischen der Picasso und dem RAM sp&auml;ter nur sehr wenig
Raum sein wird.<P>
Beim A 2000 mu&szlig; ein Teil der Karte abgetrennt werden, was jedoch im
Handbuch beschrieben ist.<P>
Nach dem Einschalten des Rechners pr&auml;sentiert sich die Workbench in einem
PAL- oder NTSC-Modus mit doppelter Horizontalfrequenz - der Scandoubler
macht's m&ouml;glich. Somit kann man beruhigt zu preiswerten Standard-VGA-
Monitoren greifen, und trotzdem s&auml;mtliche AMIGA-Programme benutzen, die auf
einen PAL- oder NTSC-Modus bestehen.
15KHz-Festfrequenzmonitore, wie z.B. der 1084(S), sind nat&uuml;rlich nicht f&uuml;r
den Betrieb mit der Picasso IV vorgesehen, aber solche "Strahlenkanonen"
sollten auch bei Besitzern von ECS/AGA-AMIGAs ohne Grafikkarte allm&auml;hlich
der Vergangenheit angeh&ouml;ren.<P>
Jetzt sollte die Grafikkartensoftware Picasso '96 installiert werden.
Achtung: Wer lediglich OS 3.0 besitzt, kann mit der mitgelieferten Version
von Picasso '96 nichts anfangen! Erst sp&auml;ter haben sich die Programmierer
dazu entschlossen, nicht mehr OS 3.1 vorauszusetzen. Mit OS 2.x oder gar
1.x l&auml;&szlig;t sich die Software jedoch nicht betreiben.
Da Picasso '96 Freeware ist, sollte ein Upgrade kein allzu gro&szlig;es Problem
darstellen - die aktuelle Version ist im Aminet verf&uuml;gbar.
&Uuml;brigens ist es auch f&uuml;r OS 3.1-Nutzer ratsam, die neueste Software zu
installieren, um eventuelle Bugs in fr&uuml;heren Versionen auszuschlie&szlig;en.<P>
Die Installation von Picasso '96 geschieht sehr komfortabel mit Hilfe des
AMIGA-Installers. Allerdings sollte man schon die Spezifikationen (v.a. die
maximale Horizontalfrequenz) seines Monitors kennen.<P><BR>
<U><B>Der Test</B></U><P>
Der Scandoubler/Flickerfixer der Picasso IV arbeitet in den LowRes- und
HiRes-Bildschirmmodi sowohl bei PAL als auch unter NTSC einwandfrei.
Gleiches gilt f&uuml;r die Interlaced-Varianten, bei denen der Vorteil des
Flickerfixers erst richtig sichtbar wird - das Interlaced-Flimmern ist
verschwunden.<P>
Bei den (allerdings sowieso ungebr&auml;uchlichen) SuperHires-Modi kommt es
jedoch zu Grafikfehlern, so da&szlig; insbesondere bei kleinen Schriften kaum
etwas zu erkennen ist.<P>
Prinzipbedingt verbleibt die Bildwiederholfrequenz jeweils bei 50 Hz (PAL)
bzw. 60 Hz (NTSC), so da&szlig; das Bildwechsel-Flimmern weiterhin vorhanden ist.
Auch deshalb ist es etwas schade, da&szlig; lediglich die Frequenzen von PAL- und
NTSC-Modi von der Picasso IV verdoppelt werden: Man stelle sich einmal
Super72:SuperHires-Interlaced (800*600 Punkte bei etwa 70Hz) ohne
Interlaced-Flimmern vor...<P>
Das Hauptaugenmerk gilt nat&uuml;rlich der eigentlichen Grafikkartenfunktion der
Picasso IV: Die Geschwindigkeit gibt sowohl bei 8 Bit (256 Farben), als
auch bei 16 (65536 Farben) und 24 Bit (16777216 Farben) keinen Anla&szlig; zur
Kritik. Im 24 Bit-Modus ist die Picasso IV um einiges schneller als die
Cybervision 64, w&auml;hrend bei 256 Farben der Kampf um den ersten Platz
zwischen diesen beiden Modellen eher unentschieden ausgeht. Benchmarktests
lassen erkennen, da&szlig; je nach Grafikfunktion mal die eine, mal die andere
Karte die Nase vorn hat. In der Praxis hatte ich jedoch das Gef&uuml;hl, da&szlig; die
Picasso IV auch bei 256 Farben meist etwas schneller als die Cybervision 64
ist.<P>
Leider gibt es bei 16-/24-Bit-Bildschirmmodi eine &auml;rgerliche Beschr&auml;nkung
der Bandbreite auf 85 MHz, was zur Folge hat, da&szlig; beispielsweise bei
1280*1024 Punkten lediglich eine Bildwiederholfrequenz von 47 Hz (bzw. 94
Hz interlaced) erreicht werden kann. Dies ist aber auch schon der
Hauptkritikpunkt der Picasso IV.
Da&szlig; die Karte in der Grundausstattung &uuml;ber keinerlei 3D-Funktionen verf&uuml;gt,
ist derzeit noch nicht von gro&szlig;er Bedeutung, da es bis jetzt keine AMIGA-
Programme gibt, die diese auch ausnutzen. Sicher - die standardm&auml;&szlig;ige
Integration von 3D-Funktionen w&auml;re ein zus&auml;tzlicher Kaufanreiz gewesen,
Village Tronic hat jedoch f&uuml;r die Zukunft eine entsprechende 3D-Erweiterung
angek&uuml;ndigt.<P>
Die noch relativ neue Grafikkartensoftware Picasso '96 macht einen recht
ordentlichen Eindruck. Es fehlt zwar noch die M&ouml;glichkeit des AMIGA-
typischen Screen-Ziehens, das es erm&ouml;glicht, quasi gleichzeitig Programme
auf verschiedenen Screens zu benutzen. Jedoch bietet es mit dem
leistungsf&auml;higen Tool PicassoMode die M&ouml;glichkeit, auf einfache Weise
vorhandene Picasso-Bildschirmmodi zu ver&auml;ndern oder auch neue zu erzeugen.<P>
Etwas kritisch mu&szlig; die Stabilit&auml;t von Picasso '96 (getestet wurde die
Version 1.22a) betrachtet werden: Zwar gibt es mit den allermeisten (auch
CyberGraphX-) Programmen keinerlei Probleme. Allerdings sind in der
Testphase doch einige Applikationen aufgefallen, die nicht oder nicht
stabil mit Picasso '96 zusammenarbeiten. Beispiele daf&uuml;r sind Wordworth 5,
aber auch die neueste Version 2.98 des Anti-Viren-Programms VT. Beim Click
auf "CheckDisk" st&uuml;rzte der Testrechner stets ab.
Schlimmer wird es, wenn man Tools einsetzt, die Betriebssystemroutinen
patchen. Probleme gab es u.a. mit MCP (wen wundert's) und FastIPrefs.<P>
Ich m&ouml;chte an dieser Stelle jedoch betonen, da&szlig; Picasso '96 stetig
weiterentwickelt wird, und die Systemstabilit&auml;t hoffentlich mit jeder neuen
Version steigen wird.<P><BR>
<U><B>Fazit:</B></U><P>
Die Picasso IV ist alles in allem eine gute Grafikkarte. Das Pr&auml;dikat "sehr
gut" hat sie leider knapp verpa&szlig;t, v.a. wegen der Bandbreitenbeschr&auml;nkung
bei 16-/24-Bit-Modi und des etwas hohen Preises, der aufgrund der guten
Leistungen und des integrierten Flickerfixers/Scandoublers jedoch noch
angemessen erscheint. An der Software Picasso '96 mu&szlig; noch etwas gearbeitet
werden, damit die Stabilit&auml;t von CyberGraphX v2 erreicht wird.<P>
<B>Gesamtergebnis: 2 (gut)</B></H3>

<CENTER><BR><A HREF="news003.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="news005.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>

</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
