<HTML><HEAD>
<TITLE>Amiga Aktuell 09/97 - Interview</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 09/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105>
<CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER>
</TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav004.gif" USEMAP="#nav001" WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP></TD>

<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<PRE>
INTERVIEW MIT WOLF DIETRICH, GESCH&Auml;FTSF&Uuml;HRER VON PHASE 5
--------------------------------------------------------

Michael Thaler (E-Mail: <A HREF="mailto:michi@highvolt.gun.de">michi@highvolt.gun.de</A>) hat das folgende Interview
mit Wolf Dietrich, dem Gesch&auml;ftsf&uuml;hrer von phase 5 digital products,
gef&uuml;hrt und es mit freundlicher Genehmigung AMIGA aktuell f&uuml;r eine
Ver&ouml;ffentlichung zur Verf&uuml;gung gestellt:


M.T. (Michael Thaler): Erz&auml;hlen Sie uns erst einmal etwas &uuml;ber Phase5. Wie
ist die Firma entstanden? Wieviele Mitarbeiter hat sie im Moment? Auf was
sind Sie besonders stolz? Und wie sehen Sie die Zukunft von Phase5?

W.D. (Wolf Dietrich): phase 5 digital products wurde erst 1992 gegr&uuml;ndet.
Gerald Carda und ich sind allerdings Amiga-Aktive der ersten Stunde, ebenso
wie viele unserer Mitarbeiter. Gerald Carda war unter anderem
mitbegr&uuml;ndender Redakteur der ersten deutschen Amiga-Zeitschrift, der
KICKSTART; ich kam als freier Autor bei der dritten Ausgabe dazu, wo wir
uns auch kennenlernten.
Nach verschiedenen T&auml;tigkeiten im Amiga-Bereich gr&uuml;ndeten wir 1991 die
Advanced Systems&amp;Software, die US-Produkte in Deutschland vertreiben
sollte. Als wir im Laufe des Jahres 1991 eigene Produktideen - f&uuml;r das
erste Blizzard 500 Turbo Memory Board - entwickelten, beschlossen wir,
die Entwicklung ab 1992 unter phase 5 digital products auszugliedern. Ab
1994 ist phase 5 dann als Hersteller und Vertrieb in den Vordergrund
getreten.

Das Unternehmen besch&auml;ftigt z.Z. 15 Mitarbeiter vor Ort und mehrere
externe Software-Entwickler, dies allerdings nach dem Weggang von drei
Mitarbeitern, die in der nahen Zukunft ersetzt werden. Dar&uuml;ber hinaus
ist eine kurzfristige Erweiterung der ASIC-Entwicklungsabteilung
vorgesehen und bereits in Arbeit. Dar&uuml;ber hinaus besch&auml;ftigt unser Ende
1996 gegr&uuml;ndetes Fertigungsunternehmen weitere 5 Mitarbeiter und einige
Teilzeitkr&auml;fte.

Worauf sind wir besonders stolz? Dies ist eine schwere Frage. Wir sind
sicher stolz darauf, da&szlig; &uuml;ber 100.000 Anwender phase 5-Produkte
verwenden. Wir sind auch stolz auf die verschiedensten Innovationen,
die wir realisiert haben. Wir freuen uns &uuml;ber jeden einzelnen Kunden,
der eins unserer Produkte zu seiner Zufriedenheit einsetzt - und dazu
erhalten wir auch sehr viel positive Resonanz.

Wir sind bestrebt, phase 5 digital products als technologief&uuml;hrendes
Unternehmen auszubauen. Wir investieren die Unternehmensertr&auml;ge nahezu
vollst&auml;ndig zur&uuml;ck in Forschung und Entwicklung. Es ist unser Ziel, das
Unternehmen im Bereich Chip- und System-Design als innovative
High-Tech-Firma zu etablieren. Dabei sehen wir - was die technische
Seite betrifft - den gesamten Prozess von der Idee bis zur Realisierung
(d.h. der Fertigung) eines Produkts als Einheit; insofern besteht
High-Tech f&uuml;r uns auch z.B. aus modernsten Fertigungstechnologien, die
wir hier an unserem Oberurseler Standort aufbauen und durchf&uuml;hren.


M.T.: Bevor wir zum Amiga kommen: Sie haben mit den Maccelerate!-Karten
auch Mac-Hardware entwickelt. Haben sich diese Karten gut verkauft?
Werden Sie auch in Zukunft Mac-Produkte produzieren?

W.D.: Wir haben die Maccelerate!-Karten mittlerweile recht gut am Markt
etabliert, obwohl im Verh&auml;ltnis zur Verbreitung der Systeme wesentlich
weniger Mac-Kunden ihre Rechner mit Turbo-Karten aufr&uuml;sten, dies ist
dort (noch) nicht so g&auml;ngig. Ja, wir werden auch in Zukunft Mac-Produkte
anbieten, wobei wir allerdings Produkte planen, die mit deutlich
geringerem Aufwand entwickelt werden k&ouml;nnen; d.h., solche Produkte sind
lediglich zus&auml;tzliche Umsatztr&auml;ger, aber keine technologischen
Schl&uuml;sselprodukte. Wir k&ouml;nnen dabei allerdings auch Synergien f&uuml;r den
Amiga-Markt nutzen: Dadurch, da&szlig; wir bereits mehrere tausend
PowerPC604e-Karten f&uuml;r den Mac gebaut haben, haben wir a) bessere
Volumenpreise auch f&uuml;r die PowerUp-Karten, b) weitreichende
Design- und Fertigungserfahrung mit den modernen BGA-Prozessoren,
und c) zum Produktionsstart der PowerUps-Boards direkt ausreichende
Lager-Mengen an 604e-Prozessoren verf&uuml;gbar.


M.T.: Was ist der Grund f&uuml;r die Verz&ouml;gerung bei der Auslieferung der
PowerUp-Karten?

W.D.: Nun, es gab leider viele Verz&ouml;gerungsgr&uuml;nde. Zu Beginn des Jahres
hatten wir personelle Umstellungen in der Entwicklungsabteilung, wobei auch
das PowerUp-Konzept noch einmal &uuml;berarbeitet wurde. Die Entwicklung wurde
auf VHDL unter Synopsys und unter Verwendung vollst&auml;ndiger digitaler
Simulationsmodelle umgestellt. Dies hat uns einige zus&auml;tzliche Zeit
gekostet. Sp&auml;ter, Ende Mai und durch den Juni hindurch hatten wir mit
den verschiedensten kleineren Design-Widrigkeiten zu k&auml;mpfen; die
Simulationen haben ab und an noch Fehler gezeigt, und die komplette
Spannungsversorgung mu&szlig;te aufgrund Abweichungen der PPC-Prozessoren zu
den Spezifikationen neu designt werden. Infolge dieser und anderer
kleinerer &Auml;nderungen ver&auml;nderte sich die Teileliste, worauf wir in
Beschaffungsprobleme mit einigen der neuen Komponenten gerieten. Zur
Zeit (31.07.97) unterziehen wir die endg&uuml;ltigen Prototypen im Labor
noch einmal umfangreichen Tests, und werden in wenigen Tagen in die
Produktion gehen. Da diese Woche auch die letzten fehlenden Teile
eintreffen sollen, d&uuml;rften sich die ersten Anwender bereits in K&uuml;rze an
der Leistung der neuen CyberstormPPC begeistern k&ouml;nnen.

Parallel zur Hardware-Entwicklung haben wir &uuml;brigens auch intensiv an
Software-L&ouml;sungen gearbeitet, die die Leistung der PowerUps erh&ouml;hen
und die Erstellung von Software weiter vereinfachen. Ein wesentlicher
Bestandteil hierzu ist das neue Mesage-System, &uuml;ber das Tasks auf 68k
und PPC sehr schnell kommunizieren k&ouml;nnen. Insgesamt steckt in dem
Projekt jede Menge Arbeit, das darf man uns glauben.


M.T.: Um die A\BOX ist es in letzter Zeit ziemlich ruhig geworden. Wird
an der A\BOX noch entwickelt? Wie weit ist das Projekt
vorangeschritten? Gibt es vielleicht sogar schon erste Testmuster von
Caipirinha?

W.D.: Aber nat&uuml;rlich wird an der A\BOX noch entwickelt. Dieses Projekt ist
f&uuml;r uns das absolute Schl&uuml;sselprojekt f&uuml;r die Zukunft des Unternehmens. Es
geht dabei neben den konkreten Produktzielen und der Vision auch um die
grunds&auml;tzliche Orientierung von phase 5. Wir wollen innovative HW-Produkte
entwickeln, und dies wird in der Zukunft nur noch auf Silizium-Ebene
m&ouml;glich sein.

Wir haben weite Teile des Caipirinha-Designs realisiert und in Teilen
simuliert, haben allerdings gegen&uuml;ber unserer Planung durch die
aktuellen PowerUp-Verz&ouml;gerungen und die z.Z. etwas eingeschr&auml;nkten
Ressourcen etwa drei Monate gegen&uuml;ber unserem Zeitplan verloren. Unter
dem Eindruck, da&szlig; ab Mitte 1998 verschiedene neuere Technologien aktuell
werden - darunter eine neue PowerPC-Generation, die kommende
SDRAM-II-Generation und deutlich leistungsf&auml;higere ASIC-Prozesse - haben
wir uns daher entschieden, die Design-Spezifikationen von Caipirinha
noch einmal vollst&auml;ndig zu aktualisieren. Damit erreichen wir, da&szlig; das
Produkt bei Erscheinen technologisch ausreichend fortschrittlich sein
wird, da&szlig; es als Basisprodukt eine Lebensdauer von 2-3 Jahren haben kann
- und seine Anwender f&uuml;r einen mindestens ebenso langen Zeitraum
vollkommen zufriedenstellen wird. Um dieses Ziel zu erreichen, werden
wir die Investitionen in und Ressourcen f&uuml;r das Projekt in der Zukunft
noch wesentlich verst&auml;rken. Es geht hier um die Realisierung von
Zukunftstechnologien.

Testmuster von Caipirinha wird es auch erst 1998 geben. In den n&auml;chsten
sechs Monaten wird der Chip weiterhin "nur" in der Form von
VHDL-Entw&uuml;rfen und -Synthesen und digitaler Simulationen existieren.
Dies ist aber normal; bei Einmalkosten von mehreren hunderttausend Mark
f&uuml;r eine Handvoll Prototypen macht man logischerweise erst dann
Testmuster, wenn der Schaltungsentwurf 100% steht.


M.T.: Phase5 ist von AI als ein m&ouml;glicher Partner f&uuml;r eine Zusammenarbeit
explizit erw&auml;hnt worden. Gibt es hierzu schon konkrete Pl&auml;ne?

W.D.: Wir stehen in recht engem Kontakt mit AI, haben allerdings zur Zeit
(Ende Juli 97) noch keine konkreten Pl&auml;ne zur Zusammenarbeit. Wir haben
f&uuml;r AI und Gateway 2000 im Mai eine Liste von Vorschl&auml;gen erarbeitet und
&uuml;berreicht, wie und auf welchen Gebieten wir eine sinnvolle Kooperation
oder bestehende Technologien anbieten k&ouml;nnen, und m&uuml;ssen nun abwarten,
ob sich AI/Gateway 2000 daf&uuml;r interessieren.


M.T.: Was hat sich f&uuml;r Sie ge&auml;ndert, seit Amiga Technologies von Gateway
2000 gekauft wurde? Planen Sie f&uuml;r das Betriebssystem immer noch eine
Eigenentwicklung, oder setzen sie auf eine Zusammenarbeit mit AI und
ein natives AmigaOS?

W.D.: Wir werden unsere Eigenentwicklung weiter verfolgen. Wir sind der
Auffassung, da&szlig; selbst ein natives AmigaOS in weiten Teilen neu
entwickelt werden mu&szlig;, und haben hierf&uuml;r und f&uuml;r den &Uuml;bergang zu einem
solchen neuen OS klare Konzepte vorgeschlagen; wenn AI und Gateway 2000
diese Konzepte aufgreifen wollen, w&auml;re sicher eine sehr fruchtbare
Zusammenarbeit m&ouml;glich. Wenn man bei AI in der Zukunft ein anderes
Konzept verfolgt, so werden wir dieses mit Interesse beobachten und
sehen, ob diese Entwicklungen in der Zukunft eine zus&auml;tzliche Alternative
darstellen k&ouml;nnen; unsere eigenen Konzepte und Projekte (hardware- und
softwareseitig) werden wir in jedem Fall weiterverfolgen.


M.T.: Welche neuen Features (Speicherschutz, Multiprocessing...) m&uuml;ssen
Ihrer Ansicht nach unbedingt in einem neuen, nativen AmigaOS f&uuml;r die
A\BOX enthalten sein?

W.D.: Ein OS besteht im wesentlichen aus dem Kernel, der Middleware und dem
User Interface. In all diesen Bereichen gibt es unterschiedliche
Anforderungen an Entwicklung und Innovation. Ein neues OS-Kernel
mu&szlig; auf jeden Fall die folgenden wesentlichen Eigenschaften aufweisen:

- Multiprozessorf&auml;higkeit
- Speicherschutz
- Schnelles pr&auml;emptives Multitasking
- Multiuser-F&auml;higkeit
- Hohe Sicherheit und Stabilit&auml;t
- Schnelle Antwortzeiten und niedrigen Ressourcenverbrauch (was nat&uuml;rlich
  relativ ist)
- Virtual Memory
- Loadable Devices und Shared Libraries bzw. vergleichbare Mechanismen

Ich betone hierbei, da&szlig; ein neues OS diese Eigenschaften aufweisen MUSS,
nicht nur SOLLTE. Auch das OS eines innovativen Rechners, der in der
zweiten H&auml;lfte 1998 verf&uuml;gbar werden soll, mu&szlig; sich an den Anforderungen
f&uuml;r das n&auml;chste Jahrtausend orientieren. Wir sehen allerdings, da&szlig;
hierf&uuml;r bereits viel Arbeit getan worden ist, und wir das Rad nicht zum
zweiten oder dritten Mal erfinden m&uuml;ssen. Das Wissen um die
Anforderungen an ein modernes OS und die Wege zur Realisierung ist
mittlerweile so gro&szlig;, da&szlig; es sich bei dessen Realisierung um eine
&uuml;berschaubare Flei&szlig;arbeit handelt, bei der auch bereits in gro&szlig;em Umfang
auf erprobte SW-Technologien zur&uuml;ckgegriffen werden kann. Dies gilt in
weiten Teilen auch f&uuml;r die Middleware, bei der in gro&szlig;en Umfang auf
bestehende SW-Technologie zur&uuml;ckgegriffen werden kann.

Ein weiteres Thema ist das User Interface und die damit verbundenen
Funktionalit&auml;ten. Neben einer modernen und optisch ansprechenden, aber
auch intuitiven Bedieneroberfl&auml;che gibt es in diesem Bereich sicher eine
Vielzahl an M&ouml;glichkeiten, Innovation zu erbringen, die sich an den
Anforderungen kommender Applikationen orientieren.

Wichtig ist vor allem auch, da&szlig; ein System offen und flexibel ist, und
dadurch die M&ouml;glichkeiten der kreativen Anwendbarkeit nicht einschr&auml;nkt.
Auch hier hat sich der Amiga immer hervorgehoben. Wir beabsichtigen in
jedem Fall, ein gleicherma&szlig;en offenes und kreatives System zu
realisieren.


M.T.: Planen Sie eine JAVA-Virtual-Machine f&uuml;r das n&auml;chste AmigaOS? Wie
sehen Sie den Ansatz von JAVA, und die M&ouml;glichkeit, damit
system&uuml;bergreifend Software nutzen zu k&ouml;nnen?

W.D.: Damit besch&auml;ftigen wir uns zur Zeit nicht. Ich denke nicht, da&szlig; wir
Hardware-Unterst&uuml;tzung f&uuml;r Java in die A\BOX integrieren werden (wenn
dies ben&ouml;tigt w&uuml;rde, w&auml;re es immer noch als g&uuml;nstiges Add-on machbar).
Eine Software-Unterst&uuml;tzung ist in unseren Augen eine Applikation, und
daf&uuml;r sind Third Parties zust&auml;ndig.

Grunds&auml;tzlich ist JAVA sicherlich nicht uninteressant, ich meine aber,
da&szlig; es derzeit etwas &uuml;bertrieben hochgejubelt wird. In den
Netz-Anwendungen sehe ich auch einige Problematiken, f&uuml;r die L&ouml;sungen
geboten werden m&uuml;ssen. Ich pers&ouml;nlich finde es befremdlich, wenn z.B.
mein Browser beim Surfen im Netz auf Anweisung fremder Web-Seiten
Java-Applets l&auml;dt und startet, die irgend etwas auf meinem Rechner tun,
ohne da&szlig; ich darauf Einflu&szlig; habe - oder eventuell ohne da&szlig; ich es
bemerke.


M.T.: Planen Sie in Zusammenhang mit JAVA eventuell eine Zusammenarbeit
mit Haage&amp;Partner?

W.D.: Wenn Haage&amp;Partner in der Zukunft interessiert ist, f&uuml;r das kommende
A\BOX OS und den Rechner selbst zu entwickeln, gerne. Aber das wird erst
noch aktuell.


M.T.: Laut Motorola-Datenbank hat Phase5 eine MacOS-Lizenz. Ist eine
Umsetzung von MacOS f&uuml;r PowerUp bzw. die A\BOX geplant?

W.D.: Jetzt bin ich etwas &uuml;berrascht. Wir haben niemals eine Mac-OS-Lizenz
beantragt oder erworben. Zeitweilig war im Gespr&auml;ch, da&szlig; Motorola
eventuell selbst solche Lizenzen - ggfs. auch mit verkauften PowerPC-
Prozessoren - vergeben k&ouml;nnte; diese Angelegenheit wurde aber nicht
weiter verfolgt. Sollten wir automatisch und umsonst eine Mac-OS-Lizenz
erhalten haben, w&auml;re dies wirklich verwunderlich. Ich denke, hier
handelt es sich eher um einen Datenbank-Irrtum.

Wir werden sicherlich die Lauff&auml;higkeit von MacOS unter der A\BOX
f&ouml;rdern. Da wir uns aber mit dem A\BOX-Design nicht den Einschr&auml;nkungen
der CHRP-Richtlinie oder m&ouml;glichen APPLE-Richtlinien unterwerfen werden,
wird dies nicht &uuml;ber Anpassung an diese Specs und Lizensierung des MacOS
erfolgen. Wir erwarten eher, da&szlig; es leistungsf&auml;hige Emulatoren geben
wird, wie es heute schon auf dem Amiga der Fall ist - ohne da&szlig; der Amiga
eine den CHRP- oder Apple-Spezifikationen entsprechende HW-Architektur
ist.


M.T.: Es wurde angek&uuml;ndigt, auch Linux und NetBSD f&uuml;r die A\BOX zu
entwickeln. Werden diese Betriebssysteme noch entwickelt? Und wann
werden sie erh&auml;ltlich sein? Werden sie eventuell auch f&uuml;r PowerUp
erh&auml;ltlich sein?

W.D.: Ob eine NetBSD-Unterst&uuml;tzung f&uuml;r PowerUp in Arbeit ist, kann ich zur
Zeit gar nicht sagen. Linux-Portierungen sind auf jeden Fall in
Arbeit, hier haben wir einigen Entwicklern Unterst&uuml;tzung durch
PowerUp Developer Boards geleistet. Wir gehen davon aus, da&szlig; zumindest
eine Linux-Umsetzung f&uuml;r PowerUp kurzfristig verf&uuml;gbar wird. Damit wird
diese dann automatisch auch f&uuml;r die A\BOX verf&uuml;gbar sein; allerdings
wird das A\BOX OS ja auch auf einem X-Kernel aufbauen, so da&szlig; auf der
A\BOX eine engere Integration m&ouml;glich sein wird.


M.T.: Es ist angek&uuml;ndigt worden, einen Spin-Off der Caipirinha-Technik
auf der CybervisionPPC zu verwenden. Jetzt kommt doch der
Permedia-Chip zum Einsatz. Welchen Grund hat das?

W.D.: Das Produkt auf Basis des Permedia2-Chips ist ein kommerzielles
Produkt, das wir schneller liefern k&ouml;nnen als den Caipirinha-Spin-Off.
Letzteres werden wir sicher sp&auml;ter auch noch realisieren, aber bewu&szlig;t als
Produkt f&uuml;r Entwickler, die bereits im Vorfeld f&uuml;r die A\BOX entwickeln
wollen. Mit der Permedia2-Grafikkarte k&ouml;nnen wir eine der extrem hohen
Leistung der PowerUp-Boards ad&auml;quate Grafikl&ouml;sung anbieten, dies ist
wichtig f&uuml;r die Nutzbarkeit des Produktes. Ein Gro&szlig;teil der kommerziellen
Anwender hat von dieser Karte, die auch ein sehr gutes
Preis/Leistungsverh&auml;ltnis aufweist, einen gr&ouml;&szlig;eren Nutzen in der
praktischen Anwendung.


M.T.: Village-Tronic hat mit Picasso96 ein Konkurrenzprodukt zu
CyberGraphX geschaffen. Wie sehen Sie diese Entwicklung? Was wird sich
als Standard etablieren?

W.D.: Ich denke, da&szlig; sich CyberGraphX sehr gut als Standard etabliert hat.
Wir sehen Picasso96 nicht wirklich als "Konkurrenz", da wir CyberGraphX
nicht l&auml;nger als kommerzielles Produkt anbieten. Ich denke, da&szlig; der
Leistungsumfang und die Produktpflege in der Zukunft entscheiden wird,
und dabei sehe ich ganz klare Vorteile f&uuml;r CyberGraphX. Dies liegt
nat&uuml;rlich auch darin begr&uuml;ndet, da&szlig; wir in verschiedenen
Schl&uuml;sseltechnologien engagiert sind (Prozessorkarten, Grafikkarten,
sowie die Entwicklung der A\BOX-Hardware und -Software) und dadurch auch
viele neue Technologien gut einbringen k&ouml;nnen.


M.T.: Sie haben mit PowerUp, der CybervisionPPC und der A\BOX in n&auml;chster
Zeit eine ganze Menge vor. Planen Sie neben diesen Produkten noch
andere?

W.D.: Nein, au&szlig;er kleineren Projekten f&uuml;r den Apple, die mit geringem
Aufwand bzw. teilweise als Spin-Off der Amiga-Entwicklungen realisiert
werden k&ouml;nnen, haben wir keine weiteren Produktpl&auml;ne. Die PowerUp-
Produktlinie mit all ihren Variationen hat zur Zeit unsere volle
Aufmerksamkeit, danach wird als Schl&uuml;sselprojekt die A\BOX-Entwicklung
intensiviert und vorangetrieben.


M.T.: Apple, ein Mitbegr&uuml;nder von CHRP hat angek&uuml;ndigt, keine
PowerPC-Plattform-Rechner zu entwickeln. Wie sehen Sie die Zukunft
dieses Standards? Warum sind Sie mit der A\BOX von Anfang an einen
eigenen Weg gegangen?

W.D.: CHRP ist ein Standard-Design, das komplett auf Standard-Komponenten
aufbaut. Im Endeffekt sind es Standard-PCs mit einem PowerPC statt einem
Pentium als Prozessor. So etwas zu bauen, ist keine gro&szlig;e Kunst;
Referenzdesigns und alle notwendigen Komponenten sind verf&uuml;gbar. Es ist
aber ein Design, das von Apple und der PowerPC-Allianz gepusht wurde, um
PowerPC-Rechner mit Wintel-Rechnern konkurrenzf&auml;hig zu machen - &uuml;ber den
Preis. Man mu&szlig; sich dar&uuml;ber im klaren sein, da&szlig; die wesentliche
Eigenschaft des CHRP-Konzepts der (vermeintlich) g&uuml;nstige
Herstellungspreis auf Basis der Standard-Komponenten ist, und nicht etwa
ein besonders leistungsstarkes und innovatives Design.

Das Problem dabei ist allerdings, da&szlig; sich dieser Preisvorteil nur
realisieren l&auml;&szlig;t, wenn man als Hersteller mehrere hunderttausend Systeme
im Jahr fabriziert und verkauft - und das auf Kosten der Leistung. Wir
wollten keine Kompromisse bei der Leistung und beim Systemkonzept der
A\BOX machen, und haben daher die Entwicklung eines eigenen Custom-Chips
geplant und mittlerweise begonnen. Bereits fr&uuml;hzeitig w&auml;hrend der
Planung hat sich dabei gezeigt, da&szlig; z.B. bei einer Jahresproduktion
zwischen 25.000 und 50.000 Systemen mit der Custom-Technologie
wesentlich h&ouml;here Leistung zu niedrigerem Preis m&ouml;glich wird als mit
Standard-Technologie.


M.T.: Wieso entwickeln Sie noch immer f&uuml;r den Amiga-Markt? Welchen Weg
wird der Amiga-Markt Ihrer Meinung nach gehen?

W.D.: Weil wir das Konzept des Amiga allen anderen Systemen vorziehen.
Zugegeben, wir sehen, da&szlig; es technisch in die Jahre gekommen ist, und
da&szlig; es in Hardware wie in Software erheblich modernisiert werden mu&szlig;.
Welchen Weg der Amiga selbst geht, h&auml;ngt derzeit wieder von Amiga
International ab. Hier ist offen, ob und wann neue Amigas kommen und wie
diese aussehen. Der Amiga-Markt h&auml;ngt nach meiner Meinung stark von der
Innovation der bestehenden Firmen und dem Angebot ab. Wir sind der
Auffassung, da&szlig; der Markt solange aktiv bleibt, wie dem Amiga-User neue
und interessante Produkte angeboten werden. Und daf&uuml;r werden wir in
jedem Falle mit unseren aktuellen Aufr&uuml;stungsprodukten und mittelfristig
unseren A\BOX-Systemen Sorge tragen.


M.T.: Was wollen Sie den Amiga-Usern noch ganz pers&ouml;nlich mitteilen?

W.D.: Ich freue mich pers&ouml;nlich, da&szlig; es noch immer so viele aktive
Amiga-Anwender gibt, weil dies zeigt, da&szlig; es eine gro&szlig;e Zahl kreativer
User gibt, die das System, das Konzept und die M&ouml;glichkeiten, die man
damit hat, zu sch&auml;tzen wissen. Danken m&ouml;chte ich all den Anwendern,
die uns mit gro&szlig;er positiver Resonanz und vielen tausend emails,
Briefen und Faxen zu unserem A\BOX-Projekt in unserer Vision und
unseren Zielen best&auml;tigt haben. Wir k&ouml;nnen versprechen, da&szlig; wir alles
tun werden, um den hohen Erwartungen in unsere Projekte gerecht zu
werden.
</PRE>

<CENTER><BR><A HREF="news002.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="news004.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>

</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
