<HTML><HEAD>
<TITLE>Amiga Aktuell 08/97 - Abschliessend</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 08/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Informationen, News, deutsch">
</HEAD>


<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">

<TABLE>

<TR>

<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>

<TD WIDTH=497 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav005.gif" USEMAP="#nav001" ALT="Auswahl - dies Bild bitte laden"WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
</TD>

<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<H2>Abschlie&szlig;end</H2>
<H3>Nicht umsonst habe ich in der AMIGA-aktuell-Umfrage im letzten Monat von
Euch wissen wollen, wie Ihr die bisherige Arbeit von AMIGA International
beurteilt, und ob Ihr glaubt, daﬂ die Verbreitung des AMIGAs in Zukunft
wieder zunehmen wird.<P>
Ohne hier bereits die Auswertung der Ergebnisse vorwegzunehmen, kann ich
sagen, daﬂ mich die groﬂe Streuung bei der ersten Frage doch etwas
&uuml;berrascht hat: Es waren alle Noten zwischen einem klaren "sehr gut" und
einem "mangelhaft" vertreten. Lediglich die Note 6 habe ich auf Euren
Frageb&ouml;gen (noch) nicht entdecken k&ouml;nnen.<P>
Besch&auml;ftigen wir uns jedoch zun&auml;chst mit der zweiten Frage, der Verbreitung
des AMIGAs in der Zukunft, und stellen wir uns dazu eine zweite: Sollte die
Verbreitung des AMIGAs in der Zukunft nicht wieder ansteigen, sondern
stagnieren (wohlgemerkt nicht sinken), ist dann das Ende unseres
Computersystem absehbar?<P>
Eine richtige Antwort kann niemand mit Sicherheit geben, aber wie w&auml;re es
mit einer Hypothese anhand eines vergleichbaren Computersystems?<P>
Als Vergleichsobjekt zum AMIGA d&uuml;rften die Rechner des britischen
Herstellers Acorn in Betracht kommen:<P>
Wie fr&uuml;her einmal der AMIGA, waren und sind auch Acorns Computer
zukunftsweisend. Schon Ende der achtziger Jahre begann das Unternehmen, die
RISC-Prozessor-Technologie in seinen Rechnern zu verwenden - knapp zehn
Jahre vor dem AMIGA. Trotzdem tendiert die Verbreitung der Acorn-Rechner
auﬂerhalb der britischen Inseln gegen Null.<P>
Dennoch erscheinen auch heute noch regelm&auml;ﬂig neue Rechner (und das ohne
die Existenz einer Lizensierungspolitik bei Acorn!), ebenso gibt es einen
(wenn auch relativ kleinen) Softwaremarkt.<P>
Damit wird deutlich, daﬂ auch ein sehr wenig verbreitetes Computersystem
langfristig &Uuml;berlebenschancen hat, unter der Voraussetzung, daﬂ sowohl die
Hard- als auch die Software regelm&auml;ﬂig auf den neuesten Stand gebracht
wird. Und das ist es, was Commodore bis 1992 beinahe v&ouml;llig vers&auml;umt hat.<P>
Denn welche Vorteile - mit Ausnahme des Verkaufspreises -  besitzt ein A
600 aus dem Jahr 1992 im Vergleich zu einem A 1000 von 1985?
Den nur sehr unwesentlich weiterentwickelten OCS-Chipsatz, der ECS genannt
wurde? Den geringf&uuml;gig vergr&ouml;ﬂerten Arbeitsspeicher? Die serienm&auml;ﬂige IDE-
Schnittstelle beim A 600? Das an die Zeit angepaﬂte Design? Oder etwa die
Betriebssystem-Version 2.1, die gegen&uuml;ber 1.x zwar einige Verbesserungen
aufwies, aber &uuml;ber die veraltete Hardware auch nicht hinwegt&auml;uschen konnte?
Ist das Ausmaﬂ der Verbesserungen in einem Zeitraum von sieben Jahren nicht
etwas d&uuml;rftig?<P>
Eine Schl&uuml;sselfrage ist, ob der Markt eines bestimmten Computersystems
"gesund" ist oder nicht. Es macht einen riesigen Unterschied, ob die Nutzer
eines bestimmten Systems mit ihren Rechnern sehr zufrieden sind, oder zu
einem groﬂen Teil drauf und dran sind, auf ein anderes umzusteigen.
100.000 User und 100.000 User sind hier nicht zwangsl&auml;ufig das gleiche.<P>
Der AMIGA-Markt l&auml;ﬂt sich derzeit leider nicht als "gesund" bezeichnen:<P>
Langsam, aber stetig, verlassen User unser System, ein Ausgleich erfolgt so
gut wie nicht. Hauptgr&uuml;nde sind in erster Linie die im Vergleich zu anderen
Systemen in der Regel geringere Leistungsf&auml;higkeit, und ein immer kleiner
werdender kommerzieller Softwaremarkt. (Wir haben groﬂes Gl&uuml;ck, daﬂ wir
immer noch &uuml;ber einen qualitativ hochwertigen PD-Pool verf&uuml;gen, sonst w&auml;ren
die Abwanderungstendenzen sehr viel st&auml;rker.) KEIN Hauptgrund ist meiner
Meinung nach das Preis-Leistungsverh&auml;ltnis: Viele Anwender sind bereit,
beim Rechnerkauf 500 oder 1000 DM mehr auszugeben, wenn sie daf&uuml;r einen
AMIGA bekommen, der dem Standard-PC leistungsm&auml;ﬂig ebenb&uuml;rtig oder sogar
&uuml;berlegen ist.<P>
Zwingend notwendig ist also eine Steigerung der Leistungsf&auml;higkeit bei
neuen AMIGAs. Hardwareseitig erleben wir derzeit eine &auml;uﬂerst schwere
Geburt - das Baby "PowerUp" kommt quasi mit Hilfe eines Kaiserschnitts zur
Welt. Es ist jedoch unstrittig, daﬂ sich PowerUp durchsetzen wird - ein
&auml;hnliches Konkurrenzprojekt ist nicht in Sicht.<P>
Softwareseitig sieht das etwas anders aus: Hier scheint der Stein der
Weisen noch nicht gefunden zu sein. Es gibt eine Reihe von Entwickler, v.a.
im PD-Bereich, die mit ihren Programmen versuchen, das AMIGA OS - mehr oder
weniger systemkonform - zu verbessern, sei es durch ein Multifunktionstool
oder gar durch einen Workbenchersatz. Bloﬂ: Das 68K-AMIGA OS bleibt
dasselbe - mitsamt seiner Schw&auml;chen.<P>
Notwendig ist also ein grundlegend verbessertes AMIGA OS. Und das kann auf
gar keinen Fall ein AMIGA OS 3.1 mit MUI, MCP usw. als mitgelieferte Extras
bedeuten. Hier ist das k&uuml;rzlich gegr&uuml;ndete AMIGA, Inc. aufgefordert, mit
der Arbeit zu beginnen, je fr&uuml;her desto besser.<P>
Damit w&auml;ren wir bei der Frage nach der Beurteilung der bisherigen Arbeit
von AMIGA International.<P>
Ich weiﬂ sehr gut, daﬂ sich einige User vom AMIGA-Erwerb durch Gateway 2000
mehr versprochen haben, als das, was in den letzten Monaten geschehen und
f&uuml;r die Zukunft angek&uuml;ndigt ist. Allerdings sollte sich auch jeder die
Situation von Gateway 2000 und den beiden AMIGA-Tochterfirmen
verdeutlichen:<P>
<UL>
<LI>Gateway 2000 ist zwar sehr zahlungskr&auml;ftig, wird aber auch nur in solche
Bereiche investieren, von denen es sich mittel- und langfristig einen
gewissen Nutzen erhofft. Insofern ist es nicht verwunderlich, daﬂ das
Unternehmen bislang eher vorsichtig bei der Finanzierung des AMIGAs ist.
Aber: Je mehr Gateway vom AMIGA profitiert, desto st&auml;rker wird das
Unternehmen bereit sein, gr&ouml;ﬂere Summen in den AMIGA zu investieren.<P>
<LI>AMIGA International, Inc. und AMIGA, Inc.  erhalten von Gateway 2000
jeweils ein bestimmtes Budget, das eingehalten werden muﬂ. Es ist also
sinnlos, eine hundertk&ouml;pfige Entwicklungsabteilung zu verlangen, da dies
f&uuml;r AMIGA, Inc. unfinanzierbar w&auml;re.<P>
</UL>
Einige Anwender haben vielleicht gehoft, daﬂ Gateway 2000 einen Groﬂteil
seiner Ressourcen in den AMIGA investieren wird. Sp&auml;testens jetzt m&uuml;ssen
die letzten erkennen, daﬂ diese Hoffnung illusorisch war.<P>
Trotzdem: Wir haben groﬂes Gl&uuml;ck, daﬂ die AMIGA-Rechte &uuml;berhaupt von einem
so starken Unternehmen erworben worden sind. Ich glaube, mit einiger
Sicherheit behaupten zu k&ouml;nnen, daﬂ es uns in den letzten Monaten
schlechter ergangen w&auml;re, wenn Viscorp die geforderte Summe zum Kauf der
AMIGA-Rechte zusammenbekommen h&auml;tte. Vielleicht h&auml;tte der AMIGA-
Tochterfirma dann sogar ein weiterer Konkurs bevorgestanden - und zumindest
dies ist bei der finanziellen Lage von Gateway 2000 derzeit v&ouml;llig
undenkbar - gl&uuml;cklicherweise.<P><BR>
Damit bis n&auml;chsten Monat,<P>
Euer<P>
Carsten Schr&ouml;der</H3>

<CENTER><BR><A HREF="news025.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<IMG SRC="../gfx/0nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21><P></CENTER>

</TD>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
