<HTML>
<HEAD><TITLE>Amiga Aktuell 09/96 - Vorwort</TITLE>
<META NAME="description" CONTENT="Amiga Aktuell Ausgabe 09/97 - Das deutschsprachige Amiga-News Magazin">
<META NAME="author" CONTENT="Carsten Schr&ouml;der/HTML Version Henning Rowlin">
<META NAME="keywords" CONTENT="Amiga, Aktuell, Vorwort, August, Informationen, News, deutsch">
</HEAD>
<BODY BACKGROUND="../gfx/bg.gif" BGCOLOR="#75baff">
<TABLE>
<TR>
<TD WIDTH=105><CENTER><H2><A HREF="index.html">Amiga Aktuell</A></H2></CENTER></TD>

<TD WIDTH=496 VALIGN=TOP>
<CENTER>
<IMG SRC="../gfx/nav002.gif" USEMAP="#nav001" WIDTH=413 HEIGHT=20 BORDER=0>
<MAP NAME="nav001">
<AREA SHAPE="rect" COORDS="0,0,91,19" HREF="vorwort.html">
<AREA SHAPE="rect" COORDS="108,0,180,19" HREF="intern.html">
<AREA SHAPE="rect" COORDS="196,0,260,19" HREF="news.html">
<AREA SHAPE="rect" COORDS="274,0,412,19" HREF="schluss.html">
</CENTER>
</MAP>
</TD>

</TR>

<TR>

<TD ALIGN=CENTER VALIGN=TOP>
</TD>
<TD WIDTH=496 ROWSPAN=2>
<A NAME="Top"></A>
<CENTER>
<H2>Willkommen zur neuesten Ausgabe von</H2><BR>
<H1>AMIGA aktuell</H1>
</CENTER><BR><BR>
<H3>Ver&auml;nderungen machen auch vor diesem Magazin nicht halt:
Ab sofort &uuml;bernimmt Jens Schr&ouml;der die Leitung des - gleichzeitig stark
erweiterten - Spieleteils. AMIGA aktuell tr&auml;gt damit einer Reihe von Lesern
Rechnung, die sich f&uuml;r eine Ausweitung dieses Bereichs ausgesprochen haben.<P>
Mir ist nicht verborgen geblieben, da&szlig; es unter den Lesern auch Stimmen
gibt, die eine Spiele-Rubrik f&uuml;r &uuml;berfl&uuml;ssig halten. Zu deren Beruhigung
ist zu sagen: Der erweiterte Spieleteil geht selbstverst&auml;ndlich nicht zu
Lasten der &uuml;brigen AMIGA-aktuell-Rubriken. Eher im Gegenteil: Dadurch, da&szlig;
ab sofort ausschlie&szlig;lich Jens Schr&ouml;der f&uuml;r den AMIGA-aktuell-Spieleteil
verantwortlich ist, werde ich m&ouml;glicherweise noch mehr Zeit f&uuml;r die &uuml;brigen
Rubriken aufbringen k&ouml;nnen.<P>
<B>Weitere Anmerkungen in eigener Sache:</B><BR>
<UL>
<LI>Das Verschicken von E-Mails ist bekanntlich nicht die sicherste
Versandform. Es hat sich herausgestellt, da&szlig; immer wieder einmal eine oder
mehrere Mails abhanden kommen, weil irgendwo eine Panne aufgetreten ist.
Deshalb an dieser Stelle von mir ein Hinweis: Wenn ich eine E-Mail zu AMIGA
aktuell bekomme - sei es ein Artikel, Abo-Auftrag, Gewinnspiel-Einsendung,
oder irgend etwas anderes -, dann best&auml;tige ich den Erhalt der Mail AUF
JEDEN FALL, auch wenn die Mail selbst keiner Antwort bedarf. Solltet Ihr
also einmal keine Antwort von mir bekommen, dann k&ouml;nnt Ihr davon ausgehen,
da&szlig; ich Eure Mail nicht erhalten habe.<P>
<LI>Es haben sich einige von Euch dar&uuml;ber gewundert, da&szlig; die letzte AMIGA-
aktuell-Ausgabe erst Mitte August im Aminet erschienen ist.
Zum einen hat sich die Einspeisung wegen des Aminet-Harddisk-Upgrades
verz&ouml;gert, zum anderen gab es anscheinend auch einige Tage danach noch
Upload-Probleme.
In einem solchen Fall lohnt es sich meist, einmal auf der AMIGA-aktuell-
Homepage (<A HREF="http://home.pages.de/~amiga-aktuell">http://home.pages.de/~amiga-aktuell</A>) zu nachzuschauen. Dort
konnte die August-Ausgabe bereits seit Ende Juli abgerufen werden. Die
Abonnenten haben AMIGA aktuell nat&uuml;rlich ebenfalls p&uuml;nktlich erhalten.<P>
<LI>Die HTML-Ausgabe von AMIGA aktuell erscheint immer einige Tage sp&auml;ter als
die AMIGAGuide-Version. Wer AMIGA aktuell also m&ouml;glichst fr&uuml;h lesen will,
sollte die Guide-Ausgabe abonnieren - oder auch beide, das ist auch
problemlos m&ouml;glich.<P>
</UL>

<B>Kurz noch zum Inhalt:</B><BR>
<UL>
<LI>Das Interview mit Wolf Dietrich war bereits in einem AMIGA-aktuell-
Special vom letzten Monat ver&ouml;ffentlicht. Damit es aber auch wirklich jeder
Interessierte zur Kenntnis nehmen kann, ist es in dieser regul&auml;ren Ausgabe
nochmals enthalten.<P>
<LI>Die Auswertung der AMIGA-aktuell-Umfrage vom letzten Mal wird
voraussichtlich in der Oktober-Ausgabe ver&ouml;ffentlicht.
</UL>
Jetzt w&uuml;nsche ich noch viel Spa&szlig; bei AMIGA aktuell,
<BR><BR>
Euer
<BR><BR>
Carsten Schr&ouml;der</H3>
<CENTER><BR><A HREF="index.html"><IMG SRC="../gfx/prev.gif" BORDER=0 WIDTH=11 HEIGHT=21></A>
&nbsp;
<A HREF="#Top"><IMG WIDTH=20 HEIGHT=20 SRC="../gfx/top.gif" ALT="[TOP]" BORDER=0></A>
&nbsp;
<A HREF="intern.html"><IMG SRC="../gfx/nxt.gif" BORDER=0 WIDTH=11 HEIGHT=21></A><P></CENTER>
<P><BR><BR>
</TR>
<TR>
<TD ALIGN=CENTER VALIGN=BOTTOM>
<A HREF="mailto:cschroe@stud.uni-goettingen.de"><IMG WIDTH=100 HEIGHT=51 BORDER=0 SRC="../gfx/e-mail.gif" ALT="e-mail me"></A>
<BR><BR><BR>Powered by <BR><A HREF="http://www.clearlight.com/~dietmar">GoldED</A>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
