<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Pelit</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Tales From Heaven</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tasohyppelyt siirtyv&auml;t vihdoin kolmiulotteiseen aikaan Amigallakin, kun pitk&auml;n odottelun j&auml;lkeen Tales From Heaven on lopultakin valmis ja hyllytavarana kaupasta saatavilla. Mutta millainen yll&auml;tys paketista sitten paljastuu? Hypitk&ouml; riemusta kattoon, vai viek&ouml; kissa kielesi? Laukaise j&auml;nnitys, lue eteenp&auml;in.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Siniset romput tulevat</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tehdasvalmisteisen CD:n sijaan yh&auml; useamman Amiga-pelin jakelumediana toimii CD-tallentimella kirjoitettu CD-R-levy, jolle on tehty tarraetiketti v&auml;ritulostimella. Samaa konstia hy&ouml;dynt&auml;&auml; my&ouml;s Tales From Heaven, mutta se vie omatekoisuuden viel&auml; astetta pidemm&auml;lle, sill&auml; mustesuihkutulostinta on k&auml;ytetty my&ouml;s pelin CD-levykotelon kansilehtien valmistuksessa. Etukansi on jostakin syyst&auml; p&auml;&auml;tetty j&auml;tt&auml;&auml; mustavalkoiseksi, takakansi on sent&auml;&auml;n saanut miellytt&auml;v&auml;n v&auml;rityksen kasvoilleen. Tulostus on tehty kiilt&auml;v&auml;lle paperille, joten kuvanlaadussa ei ole moittimista.
						<p>Tales From Heaven k&auml;ytt&auml;&auml; CD-R:n tarjoamaa erikoista mahdollisuutta pelin suojaamiseen asiattomalta kopioinnilta: jokaiseen levyyn on koodattu mukaan asiakaskohtainen sarjanumero. Asiasta varoittaa levyn teksti &quot;Copy protection: this CD is encrypted with the purchaser's details&quot;. Mielest&auml;ni erinomainen idea, koska t&auml;ll&ouml;in pelin suojauksesta ei aiheudu ostajalle mit&auml;&auml;n ylim&auml;&auml;r&auml;ist&auml; vaivaa sarjanumeroiden k&auml;sin sy&ouml;tt&auml;misen muodossa, ja CD:st&auml; voi halutessaan tehd&auml; varmuuskopion helposti ja hyv&auml;ll&auml; omallatunnolla.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Asentajat, t&ouml;ihin!</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tales From Heaven on tarkoitettu pelattavaksi vain suoraan rompulta, joten mit&auml;&auml;n Installer-skripti&auml; tai edes asennusohjeita pelille ei ole. Asennus on kuitenkin mahdollista, riitt&auml;&auml; kun kaikki pelin tarvitsemat tiedostot kopioidaan kiintolevylle samaan hakemistoon. Kopiointi on helpointa tehd&auml; vaikkapa Directory Opuksella, sill&auml; k&auml;ynnistysskripti&auml; lukuunottamatta tiedostoilla ei ole ikoneita. Asentaa kannattaa vain tarvitsemansa versio pelist&auml;, eli joko CGX-p&auml;&auml;tteell&auml; olevat RTG-n&auml;ytt&ouml;korttiversion tai ilman p&auml;&auml;tett&auml; olevat AGA-version tiedostot. Kiintolevytilaa hupenee noin 32 Mt, mutta sen verran olen ainakin itse mielell&auml;ni valmis uhraamaan, jottei peli&auml; tarvitse k&auml;ytt&auml;&auml; rompulta. Kopioinnin j&auml;lkeen asennus onkin valmis, sill&auml; peli ei tarvitse toimiakseen assigneja eik&auml; mit&auml;&auml;n muitakaan temppuja, ja se on helppo k&auml;ynnist&auml;&auml; suoraan Workbenchist&auml; pelin k&auml;ynnistysskriptin ikonista.
						<p>K&auml;yt&ouml;n helppouden lis&auml;ksi miellytt&auml;v&auml; ominaisuus on my&ouml;s ohjelman toimintavarmuus, sill&auml; Tales From Heaven ei ole kertaakaan kaatunut pelin aikana. Yksi kaatumisen aiheuttava tilanne on peliin kuitenkin p&auml;&auml;ssyt lipsahtamaan, nimitt&auml;in jos kiintolevyn k&auml;ynnistysosio on kirjoitussuojattu lock-komennolla, peli jumittuu ensimm&auml;isen tason latauksen aikana. Itse pid&auml;n k&auml;ynnistysosion yleens&auml; aina kirjoitussuojattuna, koska mielest&auml;ni ohjelmat eiv&auml;t saa muutella k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; kysym&auml;tt&auml; siihen lupaa, joten t&ouml;rm&auml;sin bugiin heti ensimm&auml;isell&auml; kokeilukerralla. Haittaa siit&auml; ei tietenk&auml;&auml;n ole, pit&auml;&auml; vain muistaa aina ennen Tales From Heavenin peluuta purkaa k&auml;ynnistysosion lukitus, jos sellaista k&auml;ytt&auml;&auml;.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Taivaalle seikkailemaan</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Pelin taustatarina kertoo p&auml;&auml;henkil&ouml;n olevan Zaac-niminen poika, joka l&auml;htee pilvien yl&auml;puolella sijaitsevaan maailmaan pelastamaan sinne erehdyksess&auml; kaapattua kissaansa Hairoa. Kyseinen valtakunta vain on sattumoisin joutunut Misties-nime&auml; kantavan vihulaiskoplan hy&ouml;kk&auml;yksen kohteeksi, joten pelastusteht&auml;v&auml;&auml;n tulee runsaasti mutkia matkaan. Zaac joutuu juoksemaan ja hyppim&auml;&auml;n laatoista rakennetussa maailmassa, v&auml;istellen ja tuhoten vihollisia, ker&auml;ten aseita, avaimia ja timantteja ja v&auml;ltellen putoamista reunan yli tyhjyyteen.
						<center>
							<p><img height="200" width="320" src="kuvat/tales_1.jpg" alt=" "></p>
						</center>
						<p>Mistiesit osoittautuvat veikeiksi hy&ouml;nteis- ja el&auml;inmaailman edustajiksi, jotka on toteutettu polygonigrafiikalla. Joukkoihin on v&auml;rv&auml;tty hitaasti lent&auml;vi&auml; ampiaisia ja joitakin hiukan isompiakin herhil&auml;isi&auml;, sek&auml; nopeasti liikkuvia skorpioneja. N&auml;in ainakin muutaman alkutason perusteella, my&ouml;hempi&auml; ratoja en ole viel&auml; ehtinyt pelaamaan. Zaac itsekin on tehty polygoneista. Hankalasti toteutettavan tukan tekeminen on ovelasti v&auml;ltetty nakkaamalla h&auml;nelle suuri lippis p&auml;&auml;h&auml;n. :-)</p>
						<p>Puolustusaseena Zaac k&auml;ytt&auml;&auml; pommeja, joita h&auml;nell&auml; pelin alussa on viisi. Pommeja l&ouml;ytyy varsin niukasti lis&auml;&auml; matkan varrelta, joten hitaasti liikkuviin ja helposti v&auml;istelt&auml;viin vihollisiin niit&auml; ei kannata tuhlata. Siell&auml; t&auml;&auml;ll&auml; maastossa lojuu my&ouml;s ker&auml;&auml;mist&auml;&auml;n odottavia timantteja, joista osa on piilotettu koskettamalla aukeaviin aarrearkkuihin. Kymmenen timanttia ker&auml;tty&auml;&auml;n saa aina yhden lis&auml;el&auml;m&auml;n alussa olevien kolmen henkirievun jatkoksi.</p>
						<center>
							<p><img height="200" width="320" src="kuvat/tales_2.jpg" alt=" "></p>
						</center>
						<p>Pilvivaltakunta sis&auml;lt&auml;&auml; nelj&auml; maailmaa, joista kussakin on nelj&auml; tasoa. Kolme ensimm&auml;ist&auml; tasoa ovat varsin helppoja, mutta nelj&auml;nnen alussa sana &quot;tasohyppely&quot; otetaan hiukan liian kirjaimellisesti, sill&auml; kyseisen kohdan ohittaminen vaatii tarkkaan ajoitettua loikkimista eri suuntiin liikkuvilta laatoilta toisille. Pelin edetess&auml; vastaan tulee seini&auml;, jotka t&auml;ytyy avata hypp&auml;&auml;m&auml;ll&auml; jossakin toisaalla sijaitsevalle painikelaatalle. Joihinkin paikkoihin Zaacin hyppy ei yll&auml;, jolloin l&auml;hist&ouml;lt&auml; pit&auml;&auml; k&auml;yd&auml; hakemassa avuksi laatikko, jonka p&auml;&auml;lt&auml; hyppy kantaa perille. Laatikkoa siirt&auml;ess&auml; on syyt&auml; varoa ty&ouml;nt&auml;m&auml;st&auml; sit&auml; liian l&auml;helle laatan reunaa, tai sit&auml; ei saa en&auml;&auml; takaisin, ja pelin eteneminen loppuu sitten siihen...</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Ohjakset haltuun</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tales From Heavenia voi pelata joko n&auml;pp&auml;imist&ouml;ll&auml;, joystickilla tai joypadilla. N&auml;pp&auml;imist&ouml;ohjaus on eritt&auml;in tarkka ja miellytt&auml;v&auml;, ja ainakin omasta mielest&auml;ni paras vaihtoehto. K&auml;ytett&auml;vi&auml; n&auml;pp&auml;imi&auml; ei valitettavasti voi m&auml;&auml;ritell&auml; itse, vaan on tyydytt&auml;v&auml; vakioasetuksiin. Pommien laukaisu tapahtuu v&auml;lily&ouml;nnist&auml;, hyppy oikeasta shiftist&auml; ja ohjaus nuolin&auml;pp&auml;imist&auml;. Pommituksen olisin itse mieluummin vaihtanut oikeaan alt-n&auml;pp&auml;imeen, mutta mink&auml;s teet.
						<p>Pelin demoversiossa ohjaus onnistuu vain joystickilla tai joypadilla, ja nuolin&auml;pp&auml;imi&auml; k&auml;ytet&auml;&auml;n kameran kuvakulman muuttamiseen portaattomasti, samoin kuin esimerkiksi Jetpilot-lentosimulaattorissa. Pelin t&auml;ydess&auml; versiossa kamerakulma vaihtuilee nykymuodin mukaan automaattisesti ja tarjoaa enimm&auml;kseen n&auml;kymi&auml; takaa yl&auml;viistosta. Hyppiess&auml; kamera siirtyy v&auml;hitellen yl&ouml;sp&auml;in, mik&auml; joissakin tilanteissa on hyv&auml; ja joissakin v&auml;hemm&auml;n hyv&auml; asia. Myyntiversion kamerakulmaa ei ilmeisesti voi en&auml;&auml; mitenk&auml;&auml;n s&auml;&auml;t&auml;&auml; k&auml;sin, joten Zaacin kasvot j&auml;&auml;v&auml;t t&auml;yden version pelaajalta n&auml;kem&auml;tt&auml;.</p>
						<p>Syyst&auml; tai toisesta pelin mukana ei toimiteta lainkaan manuaalia, ei paperimuodossa eik&auml; rompulla. Manuaali pit&auml;&auml; hakea itse Aminetist&auml;, jossa se on tarjolla tekstitiedostona. Manuaali on minimalismin taidonn&auml;yte; varsinaista asiaa siin&auml; on alle 30 rivi&auml;. Loppuosan tiedostosta t&auml;ytt&auml;&auml; pelin tarina, sama joka on luettavissa rompun kansilehdest&auml;kin.</p>
						<p>Tales From Heaven tallettaa pelitilanteen aina pelist&auml; poistuttaessa, joten valitsemalla seuraavalla pelikerralla Load jatkuu peli viimeksi meneill&auml;&auml;n olleen radan alkukohdasta. Peliss&auml; on siis vain yksi tilannetallennus, ja sekin on automaattinen ja tuhoaa samalla aina edellisen tallennuksen. Tilanne tallentuu kiintolevyn k&auml;ynnistysosion Prefs/Env-Archive-hakemistoon, tiedostoon tfh, joten rajoituksen voi kiert&auml;&auml; kopioimalla kyseisen tiedoston jonnekin muualle turvaan ennen seuraavaa pelikertaa.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Tekniikka jyll&auml;&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Odotukset toteutuksen suhteen ovat aina hiukan ristiriitaiset, kun kyse on uudesta 3D-pelist&auml; niinkin vanhalle prosessorisarjalle kuin 680x0. Jokainen on tietoinen konetehon asettamista tiukoista rajoituksista, jotka viel&auml; korostuvat 3D-laskentaa avustavien n&auml;ytt&ouml;piirien puuttuessa suurimmasta osasta koneita t&auml;ydellisesti. Toisaalta kaikki kuitenkin odottavat ihmett&auml;, ett&auml; ohjelmoijat jollain kepulikonstilla sittenkin saisivat pelin toimimaan takkuilematta, vaikkei k&auml;ytett&auml;viss&auml; olekaan sit&auml; uusinta gigahertsin mylly&auml;.
						<p>Tales From Heaven p&auml;&auml;see ilahduttavan l&auml;helle tuota ihmett&auml;, sill&auml; jo 68030 riitt&auml;&auml; jotenkuten pelattavaan nopeuteen matalalla tarkkuudella, ja nopeammat koneet jaksavat pit&auml;&auml; maiseman liikkeess&auml; t&auml;ydell&auml;kin tarkkuudella joka tilanteessa. Pelin kuvantarkkuus on tosin nykymittapuun mukaan vaatimaton, k&auml;yt&ouml;ss&auml; on vain 320x200 pisteen n&auml;ytt&ouml;tila, mutta suurempi resoluutio todenn&auml;k&ouml;isesti tukahduttaisi ainakin AGA-version toiminnan kokonaan Chip-muistin hitauden takia.</p>
						<p>Mainosten mukaan peliss&auml; on 68040/68060-optimoidut rutiinit, joten t&auml;yden ilon irti saamiseksi pelin tekij&auml;t suosittelevat kyseisi&auml; prosessoreita. Maiseman mukana py&ouml;riv&auml;n taustakuvan (taivas ja pilvet) voi kuitenkin kytke&auml; pois ja alentaa resoluution 2x2 -pikseleihin, jolloin nopeus on jokseenkin kelvollinen jo 68030:llakin. Matalaresoluutiotila on tosin sen verran mosaiikkisen n&auml;k&ouml;inen, ettei se kyll&auml; tee oikeutta pelille. Valinnat voi onneksi vaihtaa pelin aikanakin, joten niit&auml; voi muuttaa tilanteen mukaan, milloin vain haluaa.</p>
						<p>Jottei p&auml;ivitysnopeuksien arviointi j&auml;isi t&auml;ysin &quot;musta tuntuu&quot; -asteelle, mittailin pelin demoversion tarjoaman nopeusn&auml;yt&ouml;n avulla muutamia k&auml;yt&auml;nn&ouml;n esimerkkej&auml;. Mittaukset suoritettiin pelin AGA-versiolla, ensimm&auml;isen tason aloituskohdassa. Molempien testikoneiden kellotaajuus oli 50 MHz. Nopeus tietysti laskee jonkin verran pelitilanteissa, joissa on paljon tavaraa ruudulla.</p>
						<div align="left">
							<p>
							<table border="0" cellpadding="0" cellspacing="4">
								<tr>
									<td></td>
									<td>
										<center>
											68030</center>
									</td>
									<td>
										<center>
											68060</center>
									</td>
									<td></td>
								</tr>
								<tr>
									<td>HiRes ja tausta</td>
									<td>
										<center>
											9</center>
									</td>
									<td>
										<center>
											21</center>
									</td>
									<td>FPS</td>
								</tr>
								<tr>
									<td>HiRes, ei taustaa</td>
									<td>
										<center>
											11</center>
									</td>
									<td>
										<center>
											25</center>
									</td>
									<td>FPS</td>
								</tr>
								<tr>
									<td>LoRes, ei taustaa</td>
									<td>
										<center>
											14</center>
									</td>
									<td>
										<center>
											40</center>
									</td>
									<td>FPS</td>
								</tr>
							</table>
							</p>
						</div>
						<p>Tales From Heavenissa on k&auml;yt&ouml;ss&auml; siin&auml; mieless&auml; erikoinen ratkaisu, ett&auml; hitaammissa koneissa pelin kulku tosiaankin hidastuu, sen sijaan ett&auml; se j&auml;tt&auml;isi ruutuja v&auml;list&auml; pois, kuten 3D-pelit yleens&auml; tekev&auml;t. N&auml;in ainakin demoversion perusteella, myyntiversiota en voinut 68030:lla kokeilla, koska pienemm&auml;ss&auml; testikoneessa ei ollut romppuasemaa eik&auml; kiintolevy&auml;. Demon sai siihen siirretty&auml;, sill&auml; sen LHA-paketti mahtuu sopivasti yhdelle levykkeelle, purkuohjelman kera.</p>
						<p>VGA-monitoria k&auml;ytt&auml;vien harmiksi pelin AGA-versio pakottaa v&auml;ng&auml;ll&auml; aina PAL/NTSC-n&auml;ytt&ouml;tilan k&auml;ytt&ouml;&ouml;n, eik&auml; edes ModePro tehoa siihen. Niinp&auml; pelaamista varten joutuu vaihtamaan n&auml;yt&ouml;ksi videomonitorin tai television, ellei omista scandoubleria tai multisync-monitoria. H&auml;mm&auml;stelen kyll&auml; aika tavalla, miksei monissa uusissakaan peleiss&auml; anneta k&auml;ytt&auml;j&auml;n valita AGA:n tarjoamista n&auml;ytt&ouml;tiloista haluamaansa. L&auml;hesk&auml;&auml;n kaikilla kun ei ole ollut mahdollisuutta hankkia koneeseensa n&auml;ytt&ouml;korttia, mutta VGA-monitoreja l&ouml;ytyy jopa muutamalla kympill&auml; k&auml;ytettyn&auml;, joten v&auml;rin&auml;tt&ouml;mien AGA-tilojen k&auml;ytt&ouml; on monille n&auml;ytt&ouml;kortittomille itsest&auml;&auml;nselvyys. Pelin RTG-versiota en n&auml;ytt&ouml;kortin puutteen takia pystynyt testaamaan lainkaan, joten en tied&auml;, antaako sek&auml;&auml;n mahdollisuutta n&auml;ytt&ouml;tilan valintaan vai pakottaako se jonkin RTG-korttien tukemista tiloista k&auml;ytt&ouml;&ouml;n.</p>
						<p>Tales From Heavenin dokumenteista ei l&ouml;ydy mainintaa &auml;&auml;nikorttien tai AHI:n tuesta, joten mit&auml; ilmeisimmin &auml;&auml;net kuuluvat vain Paulan kautta. Vahinko ei onneksi ole suuri, sill&auml; pelin samplet ja musiikit ovat ihan kelvollisesti toteutettuja. Joka radalle on eri taustamusiikki, kappaleet tosin ovat melko lyhyit&auml; mutta varsin kivan kuuloisia ja mainiosti pelin tunnelmaan sopivia. Tehoste&auml;&auml;niss&auml; esiintyy joskus bugeja 68060:lla, &auml;&auml;net joko j&auml;&auml;v&auml;t kuulumatta tai esimerkiksi timantin kilahdukset poimittaessa kuuluvatkin r&auml;j&auml;hdyksen&auml;. 68030:lla pelattaessa &auml;&auml;net toimivat moitteetta.</p>
						<p>Tales From Heaven ei moniaja, mutta siit&auml; p&auml;&auml;see milloin tahansa takaisin Workbenchiin, esc-n&auml;pp&auml;imell&auml; esiin tulevien valikoiden kautta.</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black"><b>Tuomaristo jyr&auml;ht&auml;&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Kokonaisuutena olen oikein tyytyv&auml;inen Tales From Heaveniin. Paitsi ett&auml; sen tekninen toteutus ottaa kaiken irti koneesta ja esitt&auml;&auml; raudan vanhuuden huomioonottaen vaikuttavia tehosteita, se paikkaa my&ouml;s yhden aukon Amigan pelilajien valikoimassa, josta oikea 3D-tasohyppely on t&auml;h&auml;n asti puuttunut. Pienet puutteensa peli saa anteeksi, onhan kyseess&auml; todenn&auml;k&ouml;isesti eritt&auml;in vaatimattomalla budjetilla tuotettu teos, ja hintakin on silti pysynyt mukavan kohtuullisena.
						<p>Pelin varsinaisen kohderyhm&auml;n eli nuoremman polven mielipidett&auml; sai edustaa yhden hengen suuruinen testijoukko, 3D-r&auml;iskint&auml;pelien veteraani Pasi, 12 vuotta. Yll&auml;tt&auml;v&auml;&auml; kyll&auml;, uusimpien megalomaanisten PC-pelien seurassa runsaasti aikaa viett&auml;v&auml; pelimies piti Tales From Heavenin grafiikkaa ja musiikkeja jopa hyvin&auml;. Ensimm&auml;isen tason l&auml;pipeluu ei odotetusti tuottanut mit&auml;&auml;n vaikeuksia, mutta toisella tasolla kimppuun p&ouml;rr&auml;&auml;v&auml; ampiaisparvi ja laatoilla hyppimisen vaatima tarkkuus irrottivat pelin pelattavuudesta kommentin &quot;v&auml;h&auml;n hankala&quot;. Joka tapauksessa positiivinen lopetus positiiviselle arvostelulle. :)</td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Tekij&auml;:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.darkage.it" target="_blank">Darkage Software</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Levitt&auml;j&auml;:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.islona.co.uk/" target="_blank">Islona&nbsp;Entertainment&nbsp;Ltd.</a><br>
						<a href="http://www.epicmarketing.ltd.net/" target="_blank">Epic&nbsp;Marketing</a></td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Demoversio:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://ftp.sunet.se/pub/aminet/biz/dkg/TfH_DemoAGA.lha">AGA-versio</a>&nbsp;(687&nbsp;kt)<br>
						<a href="http://ftp.sunet.se/pub/aminet/biz/dkg/TfH_DemoCGX.lha">CGX-versio</a>&nbsp;(624&nbsp;kt)<br>
						<a href="http://ftp.sunet.se/pub/aminet/biz/dkg/TfH_manual.lha">Puuttuva&nbsp;manuaali</a>&nbsp;(3&nbsp;kt)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Edustaja:</font></td>
					<td bgcolor="#d8ecfd"><a href="http://www.ge.vip.fi" target="_blank">Gentle&nbsp;Eye&nbsp;Ky</a>, <a href="mailto:ge@vip.fi">ge@vip.fi</a>, puh. (03)&nbsp;363&nbsp;0048</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Hinta:</font></td>
					<td bgcolor="#d8ecfd">260 markkaa</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Vaatii:</font></td>
					<td bgcolor="#d8ecfd">Amiga AGA tai RTG, 68030/25 MHz, 8 Mt Fast, CD-ROM</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Suositus:</font></td>
					<td bgcolor="#d8ecfd">68040 tai 68060, 16 Mt Fast</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Testattu:</font></td>
					<td bgcolor="#d8ecfd">- Amiga 1200, 68060/50 MHz, 32 Mt, CD-ROM<br>
						- Amiga 1200, 68030/50 MHz, 8 Mt (vain demoversio)</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelityyppi:</font></td>
					<td bgcolor="#d8ecfd">3D-tasohyppely</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Kieli:</font></td>
					<td bgcolor="#d8ecfd">englanti</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Grafiikka:</font></td>
					<td bgcolor="#d8ecfd">86%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">&Auml;&auml;net:</font></td>
					<td bgcolor="#d8ecfd">70%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Musiikki:</font></td>
					<td bgcolor="#d8ecfd">84%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Pelattavuus:</font></td>
					<td bgcolor="#d8ecfd">90%</td>
				</tr>
				<tr>
					<td width="30%" bgcolor="#d8ecfd"><font size="2">Yleisarvosana:</font></td>
					<td bgcolor="#d8ecfd">89%</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Pelit</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
