<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - ALF: 10.07.99 - Vertrauen ist nicht nur gut, sondern die Grundlage!</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Vertrauen ist nicht nur gut, sondern die Grundlage!</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>

<P>
Vor weit &uuml;ber einem halben Jahr wurde von Amiga zur allgemeinen, dabei
nicht unangenehmen  &Uuml;berraschung, die Firma QNX als strategischer Partner
zur Realisierung des neuen OS f&uuml;r die NG-Amigas bekanntgegeben.
</P><P>
QNX ist als Anbieter eines leistungsf&auml;higen und modernen Echtzeit-
Betriebssystems in Nischen fernab &uuml;blicher Heimanwenderm&auml;rkte vorgesto&szlig;en
und kann auf eine beinahe zwanzigj&auml;hrige Firmenerfahrung zur&uuml;ckblicken.
Die Allianz mit Amiga sollte neue lukrative Gesch&auml;ftsfelder erschlie&szlig;en
und Amiga schnelle, aber gute Ergebnisse bringen.
</P><P>
Lange Zeit h&ouml;rte man nun nichts vom Fortgang der Geschehnisse. Nur das
Hickhack um AmigaOS 3.5 f&uuml;r die real existierenden Amigas war in den
Schlagzeilen und von Amiga wurde lediglich &uuml;ber die Einstellung von
wunderbar fachkundigem F&uuml;hrungspersonal berichtet, das die jeweiligen
Abteilungen leiten soll. Von der Anstellung f&auml;higer Entwickler, den
eigentlichen Machern, erfuhr man dagegen nichts.
</P><P>
Wenn strategische Allianzen bekanntgegeben werden, dann geht man, selbst
als durch zahlreiche Halbwahrheiten, Ank&uuml;ndigungen und darauf folgende
R&uuml;ckzieher mi&szlig;trauisch gewordener und nicht mehr so naiver Amiga-User,
davon aus, da&szlig; in diesem Fall auch Vertr&auml;ge abgeschlossen werden, die den
jeweiligen Parteien Sicherheit bieten und so den Beginn der Entwicklung
erm&ouml;glichen.
</P><P>
Doch auch von dieser Vorstellung mu&szlig; man sich wohl verabschieden.
</P><P>
Vor wenigen Tagen gab <A HREF="http://www.qnx.de/amiga/">QNX</A> auf seiner Homepage
bekannt, da&szlig; seit der Ank&uuml;ndigung auf der Computer98 40 Entwickler hart
daran arbeiten, die Versprechungen wahr zu machen. Auf Basis des
vorhandenen Kernels QNX und des Photon microGUI's soll es bereits
vorzeigbare Ergebnisse geben und im Herbst eine erste Betaversion f&uuml;r
engagierte Amiga-Entwickler erscheinen - zum Nulltarif (Voraussetzung
ist ein X86-Rechner, aber dies war auch von Amiga schon vor der besagten
Kooperationsvereinbarung immer klargemacht worden). Zur Unterst&uuml;tzung soll
bereits jetzt ein 'QNX Developers Network for Amigans' ins Leben gerufen
werden und man will sich von nun an auch in einer speziellen Newsgroup,
sowie Website engagieren.
</P><P>
Einen (!) Tag sp&auml;ter war auf der Amiga-Website eine lakonische, wie immer
vollkommen undetaillierte Pressemitteilung zu lesen, in der kaum mehr
mitgeteilt wird, als der Fakt (obwohl dieses Wort bei Amiga seine
eindeutige Aussagekraft langsam einzub&uuml;ssen droht), da&szlig; Linux von nun
an der Kern des zuk&uuml;nftigen NG-OS sein w&uuml;rde. Von der Firma QNX, den
alten Ank&uuml;ndigungen, usw. ist keine Rede.
</P><P>
Sicher scheint es nun so, da&szlig; es im Hintergrund m&ouml;glicherweise
Grabenk&auml;mpfe gab, und da&szlig; QNX auch aus diesem Grunde eine Offensive
versucht. Tats&auml;chlich erscheint mir deren Aussage aber glaubhaft, da&szlig; 40
Leute an dem neuen Betriebssystem, sprich der Benutzeroberfl&auml;che, f&uuml;r
ihren bestehenden und anerkannterma&szlig;en leistungsf&auml;higen OS-Kern arbeiten -
diese Firma hat im &uuml;brigen auch schon Produkte und somit eingehaltene
Versprechen vorzuweisen.
</P><P>
Ob das OS dann bei Amiga ver&ouml;ffentlicht wird, ist eine andere Sache, bzw.
nunmehr kaum noch glaubhaft. So w&auml;re die Chance da gewesen, da&szlig; mit dem
Amiga-Supportprogramm auch die W&uuml;nsche von Amiga-Usern und -Entwicklern
eingeflossen w&auml;ren, damit etwas vom Amiga-Feeling auf ein modernes
alternatives OS hin&uuml;bergerettet worden w&auml;re.
</P><P>
So aber bleibt Amiga auf seinem 'H&uuml;h und Hott'-Kurs, jeden eventuell
verbliebenen Vertrauenskredit, was die mittelfristige Entwicklung
anbelangt, verspielend. Wo ist das Team, da&szlig; f&uuml;r Amiga das neue OS-Frontend
entwickelt? Warum wurde wieder &uuml;ber ein halbes Jahr mit Erbsenz&auml;hlen, bzw.
angeblich 'den Markt beobachtend' vertan, w&auml;hrend es doch hei&szlig;t, im
Computersegment w&uuml;rde die Technik rapide schneller veralten, als in allen
sonstigen Bereichen? In unserem kleinen Amiga-Universum scheinen die Uhren
aber langsamer zu ticken.
</P><P>
Sicher: OS 3.5 wird, neben einem endlich vorzeigbaren Produkt f&uuml;r Amiga
(abgesehen von den Werbeartikeln), auch noch den Effekt der Unterst&uuml;tzung
loyaler, verbliebener Amiga-User haben. Doch ist dies kein Produkt, da&szlig;
auf l&auml;ngere Sicht etwas bewegen wird, bewegen soll und kann. Ebensowenig
wird es Abwanderungswillige vom Umstieg auf eines der Massensysteme
abhalten k&ouml;nnen.
</P><P>
Die Chance liegt also woanders: bei einem Zukunftsprodukt, da&szlig; man den
Amiga-Usern SCHNELL als Alternative schmackhaft machen mu&szlig; (denn mit dem
sogenannten 'klassischen' Amiga wird das Ganze so oder so leider kaum
etwas zu tun haben). Das Warten der User war und ist kein Selbstzweck.
</P><P>
So wird bei Amiga also wieder einmal bei Null angefangen. Das der, nicht
ohne Grund hochgelobte Linux-Kernel, seit Jahren keine wirkliche
Alternative zu den 'gro&szlig;en' Betriebssystemen f&uuml;r den Heimanwender wurde,
hat ja seinen Grund darin, da&szlig; daf&uuml;r noch einiges mehr dazugeh&ouml;rt, als im
Moment vorhanden ist. Ob ausgerechnet Amiga dies jetzt aus dem &Auml;rmel
sch&uuml;tteln kann, bleibt zumindest abzuwarten.
</P><P>
Worte wie Planungssicherheit, Berechenbarkeit und geregelte
Zukunftsstrategie will ich lieber gar nicht erst anf&uuml;hren.
</P><P>
Was zu sagen bleibt, ist: Offen sein f&uuml;r Alternativen und auch QNX eine
Chance geben, wenn sie beweisen, da&szlig; sie nicht nur hohle Phrasen dreschen,
selbst wenn dies nicht die offizielle Amiga-Linie sein sollte. Messen wir
die Unternehmen lieber an rationell fa&szlig;baren Fakten und schauen wir, was
sie im Herbst vorzuweisen haben!
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../alf/9912alf.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../alf/9912qnx2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
