<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - ALF: 30.08.99 - Linux erw&uuml;rgt den Amiga-Markt?</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Linux erw&uuml;rgt den Amiga-Markt?</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P>
Mal vorausgesetzt, Amiga Inc. zeigt sich diesmal standhaft und bleibt
beim Pro-Linux-Statement: Was hei&szlig;t das eigentlich f&uuml;r den jetzigen
Amiga-Markt?
</P><P>
In dem ganzen Gezeter um die Rechnerhard- und software ist der eigentliche
Motor des Amiga ganz au&szlig;er acht gelassen worden: Die Industrie drumherum!
Viele Amiga-Spezialfirmen sind zugrundegegangen, weil die Nachfrage nicht
gro&szlig; genug f&uuml;r einen &uuml;berlebensf&auml;higen Umsatz war. Die wenigen, die es noch
gibt, fahren zweigleisig mit Amiga/Mac oder Amiga/PC. Typischerweise werden
die bei einer Linux-Maschine den Amiga-Classic-Bereich einfach einstampfen.
Das sieht man jetzt schon mit dem Betteln nach Vorbestellungen.
</P><P>
Sehen wir uns doch mal die Web-Browser an. Wird irgend jemand, der Netscape
umsonst bekommt, noch f&uuml;r eine portierte Version von AWeb, iBrowse oder
Voyager Geld bezahlen? Wer braucht Miami oder Genesis, wenn Linux seinen
TCP-Stack schon eingebaut hat?
</P><P>
Neuentwicklungen sind nicht mehr von einer engagierten Gemeinde zu
erwarten, sondern von gro&szlig;en Firmen mit entsprechend gesalzenen Preisen.
Schlie&szlig;lich entwickelt schon die halbe PC-Software-Industrie f&uuml;r Linux,
warum also nicht schnell mal eine Office-Suite portieren - ist doch ganz
leicht mit Linux. Im Handumdrehen ohne viel Aufwand mehr Geld verdient.
Oder doch nicht?
</P><P>
Sicher, Star Office ist f&uuml;r Privatleute kostenlos, aber wenn es nicht auf
die andere Architektur eines NG-Amigas umgesetzt wird, weil der Officemarkt
dahinter zu klein (n&auml;mlich nicht existent) ist, war's wohl nix mit billig.
&quot;Geschenkt&quot;auf dem PC hei&szlig;t immer, irgend jemand anderes zahlt daf&uuml;r! Das
wird auch die Amiga-Gemeinde bald merken und schlucken m&uuml;ssen.
</P><P>
Die angek&uuml;ndigten NG-Amigas machen gro&szlig;angelegte Neuorientierungen f&uuml;r alle
n&ouml;tig - Hersteller und User. Wie soll da das Amiga-Feeling erhalten
bleiben?
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../alf/9912annx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../amz1299/web_adv.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
