<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
<TITLE>AmZeiger 12/99 - ALF: 27.07.99 - Think pOSitiv!</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">

<DIV ALIGN=CENTER><H1>Think pOSitiv!</H1>von<BR>
<A HREF="mailto:A.Schlick@gmx.de">Andreas Schlick</A></DIV>

<P>
Denkt positiv Amiga-Anwender! Vielleicht bewahrheitet sich der Werbeslogan
von pOS [ein inzwischen eingestelltes OS-Projekt von proDAD; d. Chefred.]
ja doch noch (und &uuml;berlebt damit auch noch pOS selber).
</P><P>
Nehmen wir einmal an, da&szlig; - sagen wir im Jahr 2001 - ein neuer AmigaNG
rauskommt und dieser dann auch auf dem Stand der Dinge ist. Dann haben wir
gegen&uuml;ber den anderen PC-Usern doch nur gewonnen! Wir haben die ganzen
Jahre mit unserem Amiga gelebt und kaufen dann einmal einen neuen Rechner,
w&auml;hrend sich der PC-User vielleicht schon drei neue Rechner gekauft hat.
Da haben wir doch eine Menge Zeit gespart und diese Zeit k&ouml;nnen wir
praktisch nutzen - z.B. zum Sparen, damit wir uns dann den neuen Rechner
&uuml;berhaupt leisten k&ouml;nnen.
</P><P>
Und wie sich der Sprung erst lohnt! Der Unterschied zwischen einem PII
und einem PIII ist nicht besonders gro&szlig;, wenn man ihn mit einem Sprung
von einem 68k auf einen G4-Prozessor vergleicht.
</P><P>
Was sich pl&ouml;tzlich f&uuml;r ganze neue Welten er&ouml;ffnen! Als 68k-Amiga-Anwender
wird einem auf einmal klar, da&szlig; die 3D-Spiele auch fl&uuml;ssig in 800x600
laufen k&ouml;nnen. Und wir kriegen unsere Soap-Opera auch noch frei Haus
dazugeliefert. Da stellen sich H&amp;P und P5 gegenseitig st&auml;ndig Beine und
Amiga Inc. versucht uns derweil zu &uuml;berzeugen, da&szlig; sie innerhalb k&uuml;rzerster
Zeit einen ganzen neuen und vor allem REVOLUTION&Auml;REN (hm..., wie oft hab'
ich dieses Wort schon geh&ouml;rt?!) Amiga aus dem Hut zaubern. Zwischendurch
tauschen wir mal die F&uuml;hrungsspitze aus, wechseln das OS und feuern Fleecy
- erfinden tolle neue Begriffe wie 'AmigaObject' (und hat schon jemand mal
eine genaue technische Beschreibung gelesen, was das nun sein soll? Nein?
Komisch!...), Amiga MCC (huch, warn das MUI's Custom Classes?), usw. usf..
</P><P>
Aber welcher Rechner hat schon so tolle Fan-Artikel wie der Amiga? Die
Amiga-AudioCD, die Amiga-Uhr, die Amiga-Maus, das Amiga-Mauspad, die
Amiga-Streichh&ouml;lzer, die unz&auml;hligen Amiga-T-Shirts, die Amiga-Tassen,
die Amiga-Poster, die Amiga-Aufkleber, die Amiga- Spielkarten... Wird
da nicht jeder PeZe-User neidisch? Am Ende wird &quot;Amiga&quot; auf allen
Haushaltsartikeln stehen und Amiga Inc. ein Gro&szlig;konzern (und trotzdem
m&uuml;ssen wir uns einen PeZe kaufen, da leider auf Grund eines kleinen
technischen Problems die Entwickler-Daten des Amiga-Computers verloren
gegangen sind). Vielleicht verkaufen sie ja auch einen virtuellen Amiga-
Computer.
</P><P>
Aber Hoffnung naht! Erinnert sich denn niemand mehr an P5's A\Box? Wie
toll doch die A\Box sein wird - mit ihrem &quot;PIRANHIA&quot;-Chip (oder hatte
der doch einen anderen Namen?). Schlie&szlig;lich m&uuml;&szlig;te nach der &quot;Roadmap&quot;
schon die Produktion angefangen haben! Also kauft Euch die A\Box oder
vielleicht doch lieber nicht?
</P><P>
Aber nach P5's Aussage lebt die Idee weiter. In diesem Sinne, denkt
pOSitiv!
</P><P>
</P><P><HR>
<TABLE WIDTH=100%>
<TR>
	<TD ALIGN=LEFT><A HREF="../alf/9912qnx2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
	<TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1299/main.htm">Inhaltsverzeichnis</A></FONT></TD>
	<TD ALIGN=RIGHT><A HREF="../alf/9912annx.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
<TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; '99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
