<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Intern / AT CD</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=80%><tr><td>
<center><img src="../pic/atcd.jpg"></center>
<br>
<font size="3">
<P>Zur K&ouml;lner Messe`98 war es endlich soweit, unsere CD, erblickte das Licht
der &Ouml;ffentlichkeit. Obwohl wir &uuml;ber einen noch gr&ouml;&szlig;eren Absatz gl&uuml;cklicher
 w&auml;ren, sind wir &uuml;berzeugt, ein erneutes Projekt mitte n&auml;chsten
Jahres zu starten. Doch wir werden ersteinmal abwarten, wie sich die
erste CD verkauft... wenn auch Ihr noch kein Exemplar habt, so habt
Ihr die M&ouml;glichkeit bei unserem Quiz welche abzustauben oder einfach
im Versandhandel eine zu bestellen :-)</P>

<P>N&auml;here Informationen haben wir ja eigentlich kaum preisgegeben, doch
das &auml;ndert sich jetzt! Damit auch Ihr noch einen Anreiz bekommt, unsere
CD zu erwerben, werden wir Euch genauere Details bekanntgeben. Als erstes 
sollten wir erw&auml;hnen, da&szlig; die CD die Vollversion von AmiAtlas 2
enth&auml;lt und auch ein paar Spezialversionen integriert sind. Neben einigen
 Musikmodulen, die knapp 30 Megabyte einnehmen und von melodischen
Tracks bis Popsongs alles bieten, enth&auml;lt die CD &uuml;ber 350 MB an Spiele-
und Programmdemos, Software f&uuml;r`s Internet und massig Sharewareprodukte
gibt es ebenfalls. Und dazu bekommt Ihr &uuml;ber 120 MB Freeware-Vollspiele.</P>

<P>Und damit auch unsere Zeitung bei der sache nicht zu kurz kommt, befinden 
sich alle Ausgaben bis zum August`98 auf der CD, d.h. von 7 St&uuml;ck
im HTML und Guide Format. Hinzugef&uuml;gt wurden noch zwei Dircetors Cut
Versionen (wenn man das so nennen kann), die keiner kennt, da sie nie
erschienen sind, sowie die Geschichte der Amiga Times f&uuml;r alle Interessierten Leser.</P>

<P>Zusammenfassung:</font>
<PRE>Amiga Times                             ( ca.  15 MB )
Vollversion                             ( ca.   2 MB )
Demos - Spiele und Programme            ( ca. 350 MB )
Internet                                ( ca.  15 MB )
Module                                  ( ca.  20 MB )
Shareware                               ( ca.  30 MB )
Sonstiges - Bilder, Tools, Texte        ( ca.  60 MB )
Spiele                                  ( ca. 130 MB )
</PRE></P>
<br>
<font size="3">
<P>Die Amiga Times CD gibt es im handel oder direkt bei APC &amp; TCP f&uuml;r 
25,- DM! Wie gesagt, wenn die CD gut bei Euch ankommt, steht einem
neuen Projekt nichts im Wege und dann k&ouml;nnt auch Ihr Euch daran beteiligen,
 d.h. mit eigenen Produkten unsere CD unterst&uuml;tzen!</p></font>

<p><b><center><font size="5">Pressestimmen</font></b></center></p>

<font size="3"><P><b>---- Starmag ----</b></P>

<P>&quot;...Sowohl die Spiele, als auch die Demos und Programme scheinen mir 
&quot;liebevoll&quot; ausgew&auml;hlt, es befindet sich nicht jeder zu findende M&uuml;ll 
darauf, sondern -erstrecht f&uuml;r eine CD dieser Art- hohe Qualit&auml;t. Die
meisten Programme sind vorinstalliert und starten auf Anhieb.</P>

<P>Wer nach einer neuen CD mit allem rund um den Amiga sucht, wer nicht
-zufrieden- des Aminet &quot;m&auml;chtig&quot; ist und wer damit leben kann, da&szlig; die CD
nicht unter dem Logo des StarMag steht (haha...), f&uuml;r den ist die Amiga 
Times CD keine schlechte Wahl.&quot; <BR>
<i>Chrism&auml;n </i></P>


<P><b>---- FunTime ----</b></P>

<P>&quot;...Man  merkt  schon das man sich bei der Wahl der Software hier sehr
viel  Gedanken  gemacht  hat.   So ist die Auswahl der Pogramme relativ
gut gelungen. Leider gab man sich nicht mehr soviel M&uuml;he den Inhalt vern&uuml;nftig zu Ordnen. 
 Zu empfehlen ist diese CD-Rom deshalb nur wegen der
Vollversion &quot;AmiAtlas&quot;  oder  der  Ausgaben  des  Magazins.  F&uuml;r regelm&auml;&szlig;ige
 Kunden der  Aminet Serie ist die CD-Rom dagegen nicht geeignet.
Sollte mal eine zweite CD-Rom  erscheinen  so  w&uuml;nsche ich mir endlich 
mal ein Inhaltsverzeichniss sowie mehr Komfort beim Starten der Module.&quot;<BR>

<i>Sebastian Brylka </i></P>


<P><b>---- Amiga Gadget ----</b></P>

<P>&quot;...Obwohl es sich dabei um den ersten Versuch der &quot;Amiga-Times&quot;-Macher
handelt, macht die CD-ROM einen guten Eindruck. Sie bietet eine bunte 
Mischung aus fast allen Programmsparten. Soweit ich es getestet habe, 
lassen sich die Programme direkt von der CD starten, au&szlig;erdem liegen ja
bei vielen Programmen schon von Haus aus Installerscripts bei, so dass 
es auch hier keine Probleme geben d&uuml;rfte. Der einzige wirkliche Schwachpunkt ist 
vielleicht, dass die CD-ROM produktionsbedingt nicht immer auf
dem neuesten Stand ist. Trotzdem kann sie mit der Aktualit&auml;t so mancher
&quot;profesioneller&quot; Produktion durchaus mithalten und f&uuml;r DF&Uuml;-lose Amiganer
kann sie, auch angesichts des Preises, durchaus empfohlen werden.&quot;<BR>

<i>Stephan H&uuml;bner </i></P>


<P><b>---- Amiga Fever ----</b></P>

<P>&quot;...Alles in allem eine CD, die ein solides St&uuml;ck der Sammlung darstellt.
Es ist kein &Uuml;berflieger, aber zu einem Preis von rund 25 DM doch allen
zum Kauf empfohlen, die die Amiga Times m&ouml;gen und nicht zu viele Aminet-
CD`s zuhause haben.&quot; <BR>
<i>Falk L&uuml;ke </i></P></font>
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
