<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: BurnIT v2.65 DAO</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">BurnIt v2.65 DAO</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
 Unser letztes Produkt im Vergleichstest ist BurnIt! von Titan Computer. Es wird
 auf CD-Rom ausgeliefert, die neben dem Programm auch noch einige Demos von
 Titan Computer Produkten und ein Paar Tools enth&auml;lt. Insgesamt beinhaltet BurnIt!
 ein 145 Seiten starkes Handbuch und eine knapp 230 MB volle CD. Die Installation
 bedarf keiner weiteren Erkl&auml;rung, da sie &uuml;ber den Amiga-Installer automatisch
 abl&auml;uft.
 <br><br>
 BurnIt! &ouml;ffnet nach dem Start ein kleines Fenster auf der Workbench, das auch gleich
 die Bedieneroberfl&auml;che darstellt. Hier haben Sie die M&ouml;glichkeit folgende Aktionen
 auszuf&uuml;hren: Convert Audio, Einstellungen, Audio Player, Lese CDD, Iso-Maker, 
 Audio Studio, Make CD DAO, Rette CD und Erstelle CD. Wir wir schon hier bemerkten
 und was sich auch im Verlauf unseres Testes best&auml;tigte, wurde BunrIt! nicht komplett
 eingedeutsch und so erwarten den Nutzer des &ouml;fteren englische Buttons und Optionen.
 Mit einwenig Kenntniss in der englischen Sprache ist es aber kein gro&szlig;es Problem,
 sich mit den Optionen zurecht zu finden.
 <br><br>
 <center><img src="../pic/burnit2.jpg"></center>
 <br><br>
 Befassen wir uns nun mit diesen gerade genannten Optionen: Convert Audio gestattet
 Ihnen die Konvertierung verschiedener CDDA Formate. Die Benutzung erkl&auml;rt sich 
 von allein und d&uuml;rfte f&uuml;r niemanden eine H&uuml;rde darstellen. Wie der Name schon
 verr&auml;t, k&ouml;nnen Sie in den &quot;Einstellungen&quot; &Auml;nderungen vornehmen. Hier melden Sie
 Ihren Brenner an, kontrollieren die Lese- und Schreibgeschwindigkeit, &uuml;berpr&uuml;fen
 die einzelnen Brennmodi (TAO/DAO) und k&ouml;nnen andere Details einstellen. BurnIt! ist
 das einzige Programm was Ihnen erlaubt den genauen Umgang der Iso-Images festzulegen,
 so k&ouml;nnen Sie als beispiel nur die Verzeichnisse scannen lassen oder auf Wunsch den
 kompletten Pfad einer Datei. Wie auch bei MasterISO k&ouml;nnen Sie in BurnIt! bootf&auml;hige
 CD32 und CDTV CD-Roms einrichten. Der Audio Player verweigerte in unserem Test leider
 seinen Dienst. Weshalb ist unklar, wenn man dem Handbuch allerdings Glauben schenken
 darf, so ist es m&ouml;glich - wenn es denn funktioniert - mit dem Player MP3 Dateien und
 andere Audio-Formate abspielen zu lassen. Nicht nur in MakeCD, nein auch mit BurnIt!
 k&ouml;nnen Sie CD-Roms sofort einlesen lassen, eventuell einige Tracks entfernen oder
 sofort Image-Dateien anlegen. Um dies zu realisieren, steht Ihnen die Option &quot;Lese CDD&quot;
 zur Verf&uuml;gung! Der Iso-Maker ist das Zentrum des Programmes - hier stellen Sie Ihre
 eigenen Image-Dateien zusammen, l&ouml;schen einige Bereich die Sie nicht brennen m&ouml;chten
 oder f&uuml;gen welche hinzu. Haben Sie als Beispiel ein Verzeichnis angehangen, werden
 Ihnen ersteinmal nur die Verzeichnisse, nicht aber die enthaltenen Dateien, angezeigt.
 Um die einzelenen Dateien anzuschauen, brauchen Sie nur auf die jeweilige Schublade
 vor dem Verzeichnis klicken und schon wird Ihnen der Inhalt aufgef&uuml;hrt. BurnIt!
 erm&ouml;glicht es Ihnen in diesem Zusammenhang auch vereinzelte unerw&uuml;nschte Dateien
 einfach via Mausklick zu entfernen. &quot;On the fly&quot; Brennen ist diesem Programm auch
 nicht fremd, jedoch sollte mindestens ein 68030/50Mhz Prozessor und eine schnelle
 SCSI Schnittstelle vorhanden sein. Das Audio-Studio dient zum einlesen und bearbeiten
 von Audio-Daten, wobei hier auch PPC Board`s unterst&uuml;tzt werden. Wie Sie schon aus
 den anderen Testberichten erfahren haben, wird im DAO-Modus immer eine komplette
 Image Datei ben&ouml;tigt. Und so haben Sie auch bei &quot;Make CD DAO&quot; relativ wenig Optionen
 zur freien Nutzung. Hier sollten Sie einfach nur die Image-Dateien einladen und
 den Brennvorgang beginnen. Zum L&ouml;schen, reparieren und neu fixieren von CD-Roms 
 wurde &quot;Rette CD&quot; eingef&uuml;gt. Der aktuelle CD Inhalt wird, wenn m&ouml;glich, angezeigt 
 und Sie k&ouml;nnen Ihre Aktionen durchf&uuml;hren. Und zum Schlu&szlig; w&auml;re da noch der 
 &quot;Erstelle CD&quot; Button, der das Brennen im TAO Modus vornimmt. Hier k&ouml;nnen Sie
 sogar einzelne Pausenzeiten zwischen den Tracks einstellen, ansonsten hebt er sich
 von den beiden Konkurrenzprodukten nicht sehr ab. BurnIt! ist ein gutes Programm das
 lediglich in der Benutzeroberfl&auml;che M&auml;ngel aufweist. Die Buttons sehr mit Grafikkarte
 eher nach schlechen MagicWB-Icons aus und auch der Schriftsatz l&auml;&szlig;t sich nicht ver&auml;ndern,
 was zu kleinen Fehlern f&uuml;hren kann - die den Brennvorgang aber nicht beeinflussen!
 <br>Kostenpunkt: ca. 100 DM f&uuml;r TAO und ca. 160 DM,- f&uuml;r DAO
 <br><br>
 </td></tr></table><br>
 <table><tr><td>
 <center><img src="../pic/burnit1.jpg">
 <br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
