<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Spiele / Vorabbericht: Heretic II</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Preview von Heretic 2</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Testconfig: A4000D PPC 604-200Mhz 060 CVPPC 98MB Ram
<br><br>
Endlich ist es soweit, von Heretic 2 ist endlich ein Demo erschienen! Es hat lange 
gedauert bis man endlich was spielbares zu sehen bekommen hat. Ich habe bei 
Hyperion angefragt, ob ich ein Tesmuster bekommen k&ouml;nnte habe, aber zu meinem 
bedauern keine Antwort bekommen. Daher teste ich die Demoversion die man 
entweder vom Hyperion Server als eine Datei (41MB) oder aus dem Aminet zu ca. 
je 10MB saugen kann! 
<br><br>
<b>Zu den Anforderungen</b><br>
Man brauch einen PPC,  64MB Ram (das absolute minimum) und nach angaben der 
Amiga Future 500 MB Festplattenspeicher (f&uuml;r die Endversion). Eine 3D-Grafikkarte 
(BVisonPPC, CVisonPPC oder wenn es doch endlich  kommt ein Paraglide) sollte 
auch in eurem Rechner stecken, wenn ihr kein Pixelige Grafik haben wollt. Zur 
Geschwindigkeitsoptimierung solltet ihr auf jeden Fall im Phase 5 early Startup (ESC 
Taste beim booten gedr&uuml;ckt lassen) bei Ram den Ram auf 60ns stellen, dieses sollte 
Heretic 2 regelrecht befl&uuml;geln!
<br><br>
<center><img src="../pic/h2_1.jpg"></center>
<br><br>
<b>Die Grafik perfekt oder eine schlechte Abspeckung</b><br>
Wer die Grafik bei Heretic 2 mal auf dem PC gesehen hat, wei&szlig; wie &quot;geil&quot; die 
aussieht. Auf dem Amiga mu&szlig; ich sagen habe ich sowas gutes noch nie gesehen, 
supergeile Effekte, wo ich nie gedacht h&auml;tte, da&szlig; der Permedia2 die &uuml;berhaubt 
kann. Heretic 2 ist mit Abstand das beste, was es auf dem Amiga gibt. Die Grafik ist 
schon ein guter Kaufgrund!
<br><br>
Der Sound l&auml;uft in der Demo noch &uuml;ber den Paula, also den internen Soundchip. 
Dort stehen die Soundkartenbesitzer au&szlig;en vor, aber in der Endversion soll auch 
AHI integriert sein. 
Die Sounds sind durchweg sehr gut und auch passend.
<br><br>
<center><img src="../pic/h2_2.jpg"></center>
<br><br>
<b>Zum Spiel</b><br>
Nach dem Start (nich vergessen den stack auf 600000 setzen) kommt man erst mal 
in das Menu, wo man auf jeden Fall die Steuerung einstellen sollte. Eine Maus mit 
m&ouml;glichst vielen Tasten ist w&auml;rmsten empfohlen. Dort gibt es eigentlich 2 
M&ouml;glichkeiten: entwederman nimt die geniale Maus von VMC (mit 4 Tasten und 2 
R&auml;dern) oder man kauft sich ein Mausinterface (z.B. den Mroocheck), den es bei 
KDH-Datentechnik gibt. 
Je nach Computerkonfiguration sollte man die Aufl&ouml;sung einstellen. Auf meinem 
Rechner lief es in 640x480 recht flott (22-35 FPS), aber auf einem 1200 mit 
160Mhz 96MB Ram und einem 040 l&auml;uft es leider nur mit 15FPS. Da sollte man 
wirklich an &uuml;bertaktung denken. 
Was mir besonders gef&auml;llt ist, da&szlig; wenn man Ultraviolant einstellt man die Gegener 
regerecht zerschlagen kann (da ist Quake Kindergarten niveau)! Da macht mir das 
spiel noch mehr Spa&szlig;, aber es gef&auml;llt auch nicht jedem. Mein Grundsatz je Brutaler 
desto besser, aber man kann die Brutali&auml;t auch sehr minimieren! 
<br><br>
<center><img src="../pic/h2_3.jpg"></center>
<br><br>
Fazit:
Also Heretic ist ein gro&szlig;er Stern am Amigahimmel. Endlich kommen die PPC-Spiele 
ein bi&szlig;chen ins Rollen. Nach Wipeout 2097 jetzt Heretic 2. Shogo und SIN sollen 
m&ouml;glichst schnell folgen. Heretic 2 ist ein Spiel, was viele Amiga-User erwarten, 
endlich werden die Netzwerksessions spannender (da Wipeout leider kein 
Netzwerksupport hat :-( ). Wer die n&ouml;tigen Konfigurationen hat sollte es sich auf 
jeden Fall kaufen (bitte nicht brennen, oder wollt ihr solche Spiele nie mehr?). Was 
mich st&ouml;rt ist der hohe Anschaffungspreis, 109DM soll das Spiel kosten, aber noch 
k&ouml;nnte ihr f&uuml;r 89DM vorbestellen, also ihr wisst was ihr machen m&uuml;sst-&#062; KDH etc. 
mit Bestellungen bombadieren!
Ich sage nur Kaufen Kaufen Kaufen!
<br><br>
<center><img src="../pic/h2_4.jpg"></center>
<br><br>
Vergesst nicht das ist nur ein Preview Test!! Der Review Test kommt noch, wenn 
mein vorbestelltes Heretic 2 kommt!
<br><br>
<table width="70%" cellspacing="0" cellpadding="0" border="0" align="center">
 <tr>
  <td colspan="3" bgcolor="#cccccc">
   <table width="100%" border="0">
    <tr>
     <td colspan="3" bgcolor="#ffffff">
      <table width="100%" border="0">
       <tr>
  <td align="left">
   <font size="3">
    <b>Grafik</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/95.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>95 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size="3">
    <b>Gameplay</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>85 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size="3">
    <b>Sound</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/85.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>85 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size="3">
    <b>Preis-/Leistung</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/80.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>80 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size="3">
    <b>Motivation</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/95.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>95 %</b>
   </font>
  </td>
 </tr>
 <tr>
  <td colspan="3" height="15">
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size="3">
    <b>Gesamt</b>
   </font>
  </td>
  <td align="center">
   <img src="../pic/90.gif" border="0">
  </td>
  <td align="center">
   <font size="3">
    <b>89 %</b>
   </font>
  </td>
 </tr>
</table>
 </td>
  </tr>
   </table>
    </td>
     </tr>
      </table>
<br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
