<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: MakeCD 3.2c</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">MakeCD 3.2c im H&auml;rtetest</font>
   <br><br>
  </td>
 </tr>
 <tr>
  <td align="left">
   <font size=3">
 Beginnen wir mit MakeCD, dass von Patrik Ohly und Angela Schmidt programmiert und
 weiterentwickelt wird und im Vertrieb von KDH-Datentechnik erh&auml;ltlich ist. Unser
 Testmuster ist MakeCD in der Version 3.2c DAO (derzeit aktuellste) und wird auf 
 Diskette mit Registriernummer und gedrucktem Handbuch ausgeliefert. Das Programm
 ist schnell installiert und verlangt vor dem ersten Start die Anschrift und 
 Registriernummer des Kunden.
 <br><br>
 Ist das Programm gestartet erscheint auf dem Workbench-Screen die Oberfl&auml;che von
 MakeCD. Zu sehen ist da das Fenster, in dem die Tracks aufgelistet sind, sowie
 einige Optionen. Bevor aber mit MakeCD gearbeitet werden kann, mu&szlig; der CD-Brenner
 eingerichtet werden. Hierzu stehen viele Men&uuml;s zur Verf&uuml;gung und es k&ouml;nnen einzelne
 Geschwindigkeiten f&uuml;r das Lesen und Schreiben festgelegt werden. MakeCD beinhaltet
 eine Hilfe-Funktion, die dem Nutzer (wenn gew&uuml;nscht) jede Option n&auml;her erkl&auml;rt und
 auch auf Folgen hinweist. Sind die Einstellungen f&uuml;r Ihren Brenner get&auml;tigt worden,
 kann der erste Brennvorgang schon fast gestartet werden.
 Grunds&auml;tzlich ist es Ihnen mit MakeCD m&ouml;glich Dateien aus einem Dateisystem zu
 Brennen, angelegte Image-Datei weiterzunutzen, Daten von einem Block-Medium
 weiterzuverwenden oder einen Track von einer vorhandenen CD zu kopieren. Die 
 eben genannten M&ouml;glichkeiten werden hierbei als &quot;Quelle&quot; ausgew&auml;hlt. Als &quot;Ziel&quot;
 Sie den Brenner (&quot;on the fly&quot; Modus), eine Image-Datei oder ein Block-Medium
 angeben. Als fast letzten Arbeitsschritt bleibt Ihnen nur noch die Festlegung 
 des jeweiligen Tracktyp`s. Welche Tracktypen bietet Ihnen MakeCD? Da w&auml;ren:
 Daten (Mode1), Audio (normal), Audio (mit Preemphasize), XA Mode Form 1 
 und 2, Mode 2 (allg. Mode 2 Track). Zum Brennen von Audio CD`s sollten Sie 
 vorrangig &quot;Audio (normal)&quot; nutzen und den &quot;Daten (Mode1)&quot; f&uuml;r BackUps Ihrer 
 Daten. Falls Sie eine Audio CD bzw. Daten CD kopieren m&ouml;chten, brauchen Sie
 diese ganzen Optionen nicht ausf&uuml;llen, lediglich ist es n&ouml;tig die Quell-CD
 einzulesen und die Image-Datei(en) anlegen zu lassen. Sind alle Dinge erledigt,
 klicken Sie auf &quot;Tracks-Schreiben&quot; und k&ouml;nnen im letzten Men&uuml; noch entscheiden,
 ob Sie einen Test durchf&uuml;hren m&ouml;chten und/oder nach diesem gleich mit dem 
 eigentlichen Schreibvorgang fortsetzten wollen, oder ob die CD sofort gebrannt
 werden soll. Die Fixierung der CD kann nach dem kompletten Schreibvorgang, nach
 dem Schreiben der einzelnen Session oder auf Wunsch &uuml;berhaupt nicht (automatisch)
 erfolgen. Nach einer Fixierung ist es nicht mehr m&ouml;glich Daten auf die CD zu 
 schreiben, da sie &quot;abgeschlossen&quot; wurde.
 <br><br>
 Der Umgang mit MakeCD ist sehr einfach und benutzerfreundlich, denn schon mit 
 wenigen Mausklicks und binnen kurzer Zeit ist Ihre CD entstanden und muss
 nur noch gebrannt werden. MakeCD unterst&uuml;tzt eine Vielzahl von CD-Brenner
 Typen und auch CD-RW Rohlinge (wiederbeschreibbare Rohlinge) lassen sich mit 
 diesem Programm formatieren und neu bearbeiten. Was bietet MakeCD sonst noch? 
 MakeCD3.2c unterst&uuml;tzt die Schreibmodi TAO, DAO und SAO, die Dateisystem-Formate
 ISO 9660, Rock Rigde, Multisession, CDTV und CD32. Sie k&ouml;nnen die Audioformate
 AIFF, AIFC, AIFF-CD, MAUD, WAV und MPEG-A Lesen und (bis auf MPEG-A) auch
 Schreiben. Weiterhin k&ouml;nnen Sie AudioCD`s ohne Probleme abspielen und MasterCD`s
 f&uuml;r kommerzielle CD-Rom`s anfertigen, wof&uuml;r aber (!!!) noch eine 
 zus&auml;tzliche Geb&uuml;hr von 300 DM f&auml;llig ist! <br>
 Kostenpunkt: ca. 100,- DM f&uuml;r TAO und ca. 150,- DM f&uuml;r DAO
 <br><br>
 </td></tr></table>
 <br>
 <table><tr><td>
  <center><img src="../pic/makecd_1.jpg"><br><br><img src="../pic/makecd_2.jpg"></center>
  <br><br>
  </td>
 </tr>
</table>

</BODY>
</HTML>
