<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Software / Testbericht: Sample Converter im Aminet</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center>
<table width=99%>
 <tr>
  <td align="center">
   <font size="5">Sample Converter im Aminet</font>
  </td>
 </tr>
 <tr>
  <td>
   <font size="3">
    <br><br>
Nicht nur dem Amiga-Musiker passiert es h&auml;ufig, da&szlig; er
sich in der notgedrungenen Lage sieht, Samples in ein
anderes Format konvertieren zu m&uuml;ssen. Ob man einfach
einen IFF Sample in ein WAVE Format umwandeln m&ouml;chte,
um diesen unter einem anderen Betriebssystem verwenden
zu k&ouml;nnen (dessen Programme sich ja leider meistens
den Amiga Standards verweigern), oder einfach einen
Audio Track einer CD in einem beliebigen Sampleformat
braucht, um ihn bearbeiten zu k&ouml;nnen - man wird fr&uuml;her
oder sp&auml;ter nicht umhin k&ouml;nnen, sich mit einem Sample
Converter befassen zu m&uuml;ssen. Daher habe ich gleich mal
zwei davon f&uuml;r euch unter die Lupe genommen...
<br><br>
<b>8SVXtoXXX</b>
<br><br>
Wie der Name schon vermuten l&auml;&szlig;t, handelt es sich hier
um reine 8SVX Konvertierung. Das bedeutet, da&szlig; man
lediglich diese Format umwandeln kann. Dies kann aber
durchaus praktisch sein, da die meisten AMIGA-typischen
Samples in IFF-8SVX gespeichert werden.
Der gro&szlig;e Vorteil von 8SVXtoXXX ist, da&szlig; man sich eine
Liste mit allen zu konvertierenden Samples erstellen
kann. Diese wird von dem Programm dann einfach nacheinander
abgearbeitet. Das bedeutet: Einfach beliebig viele Files
ausw&auml;hlen, das Format einstellen, in das die Samples
umgewandelt werden sollen, und auf 'Convert' klicken.
<br><br>
Zus&auml;tzlich kann man dabei gleich die Sample Frequenz in
KHZ festlegen und den Sample bei der Gelegenheit auch
gleich 'resamplen'. Schade ist nur, da&szlig; man die Liste
nicht speichern kann, um ein anderes Mal fortzusetzen -
denn es k&ouml;nnen manchmal schon recht viele Eintr&auml;ge werden.
8SVX kann dann die Samples in RAW, AIFF, WAVE, VOX und
8SVX konvertieren, wobei ich den Sinn einer Konvertierung
von 8SVX auf 8SVX nicht ganz verstehe. Praktisch ist
der kleine INFO Knopf, der Informationen &uuml;ber das jeweilige
Format anzeigt und die M&ouml;glichkeit, den Sample auf 12 oder
16 bit zu &auml;ndern.
<br><br>
<center><img src="../pic/sample1.jpg"></center>
<br><br>
Empfehlenswert f&uuml;r Besitzer vieler, alter 8SVX Samples,
die diese auf schnelle und bequeme Art auf g&auml;ngigere
Formate bringen wollen.
<br>
<ul>Positiv
<li>Geschwindigkeit (in Assembler geschrieben)</li>
<li>Konvertierungsliste</li>
</ul><br>
<ul>Negativ
<li>Man kann die Liste nicht speichern</li>
<li>Nur 8SVX Konvertierung m&ouml;glich</li>
</ul><br>
<b>Wertung:</b> Befriedigend
<br><br>
Kontakt:<a href="mailto:deniil@algonet.se">deniil@algonet.se</a>
<br><br>

<b>SOUNDCONVERT</b>
<br><br>
F&uuml;r dieses Tool gibt es auch ein Update, welches man sich
auch runterladen sollte, namens 'SoundConvert_a'. Ist das
Programm einmal installiert, erscheint zuerst einmal eine
ungew&ouml;hnliche graphische Benutzeroberfl&auml;che (GUI), die sich
leider nicht an die Amiga-Norm h&auml;lt. Wer MagicWB Farben
gegen&uuml;ber simpler schwarz-wei&szlig; Darstellung bevorzugt, sollte
hier in den Tooltypes '8colors' eintragen.
<br><br>
Dennoch gew&ouml;hnt man sich schnell an die Bedienung und an das
&auml;u&szlig;ere Erscheinungsbild von Soundconvert, vor allem, weil
es auch hilfreiche Helpbubbles (Hilfetexte) einblendet, wenn
man mit dem Mauszeiger l&auml;nger &uuml;ber einem Knopf verweilt, wobei
man diese auch netterweise deaktivieren kann. Abgesehen von
einer minimalem Konfiguration via Tooltypes, bietet Soundconvert
mit Hilfe von Zusatzprogrammen im Verzeichnis 'BIN' eine
Menge M&ouml;glichkeiten. Bevor man aber ans Werk schreitet, sollte
man dort die Programme Play16 und MPEGA durch aktuelle Versionen
ersetzen. Hat man diese Prozedur hinter sich, kann man mit
Soundconvert nahezu jedes &uuml;bliche Format konvertieren.
<br><br>
Zur Auswahl stehen IFF, MAUD, AIFF, WAVE, ADPCM2 &amp; 3 und auch
MP2/3. Soundconvert akzeptiert als Quelle sogar MOD-Formate,
wie XM, S3M und nat&uuml;rlich MOD. Leider bietet Soundconvert
nicht die M&ouml;glichkeit, einzelne Sounds umzuwandeln. Man
klickt in das Verzeichnis mit den zu konvertierenden Files,
dr&uuml;ckt auf OK und dann werden alle darin befindlichen Samples
in das gew&auml;hlte Format verwandelt. Dies wird mit einer
Fortschrittsanzeige kommentiert, die zwar einen Knopf zum
Abrechen anbietet, aber dieser reagiert leider nicht immer.
&Auml;hnlich wie bei 8SVXtoXXX ist es erlaubt, die Samplerate
zu &auml;ndern, mit dem Unterschied, da&szlig; man hier f&uuml;r MPEGs auch
noch die Bitrate einstellen kann. Eine praktische Funktion
ist der 'Universal Loader', der im Test auch wirklich
jedes Format automatisch identifizieren konnte.
<br><br>
<center><img src="../pic/sample2.jpg"></center>
<br><br>
Sehr empfehlenswert - Schade nur, da&szlig; man nicht einzelne
Files zum Konvertieren w&auml;hlen kann. Soundconvert ist
Freeware und im Aminet zu finden.
<br>
<ul>Positiv
<li>Unterst&uuml;tzung von MP2/3 und MOD Formaten</li>
<li>Helpbubbles</li>
<li>Universal Loader</li>
</ul><br>
<ul>Negativ
<li>GUI entspricht nicht dem Amiga Standard</li>
<li>Man kann keine einzelnen Files konvertieren</li>
</ul><br>
<b>Wertung:</b> Gut
<br><br>
Kontakt:<a href="mailto:Eckhard@top.east.de">Eckhard@top.east.de</a>

  </td>
 </tr>
</table>

</BODY>
</HTML>
