<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Erste Infos zum AMIGA Entwicklersystem</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<font size="4"><center>Fleecy Moss informiert &uuml;ber das Entwicklersystem und die Pl&auml;ne</center></font>
      <br>
       AMIGA-Vizepr&auml;sident Fleecy Moss hat soeben in einer IRC-Konferenz
       anl&auml;sslich der heute in St. Louis, USA, stattfindenden Amiga-Messe Amiga2k
       &uuml;ber das dort vorgestellte Amiga-Entwicklersystem und die Pl&auml;ne des
       Unternehmens informiert. Es folgen die wichtigsten Details:
       <OBJECT><UL>
       <LI>Die Entwicklermaschine enth&auml;lt einen AMD K6 (500 MHz), 64 MB RAM und
           Geforce 256, auf dem das Tao-System sehr gut laufe.
       <LI>Entscheidend sei jedoch nur der virtuelle Prozessor, der bereits auf x86,
           PowerPC, MIPS, ARM, SH4 und anderen Super-Prozessoren, die bald angek&uuml;ndigt
           w&uuml;rden, lauff&auml;hig sei.
       <LI>Die Entwicklungsumgebung laufe momentan "gehostet" auf einem
           Linux-Kernel.
       <LI>Tao stelle lediglich den Kern des neuen OS bereit.
       <LI>Der Kernel habe einen Umfang von 25 KB, das gesamte OS mit GUI und Java
           ben&ouml;tige 3 MB RAM.
       <LI>Das GUI-System existiere gesondert, es erm&ouml;gliche, mehrere GUI-Modelle
           hinzuzuf&uuml;gen.
       <LI>Das erste GUI-Modell werde sich stark von der heutigen AmigaOS-GUI
           unterscheiden, aber die Anwender k&ouml;nnten selbst das erschaffen, was sie
           m&ouml;chten.
       <LI>Die Entwicklermaschine soll in zwei bis vier Wochen erh&auml;ltlich sein und
           von jedermann erworben werden k&ouml;nnen.
       <LI>Das Endanwendersystem soll noch in diesem Jahr erscheinen.
       <LI>Zwei Kaufgruppen seien angepeilt: Der "digitale Abenteurer" (eine
           Erweiterung des heutigen Amiga-Marktes) sowie jene, die f&uuml;r Computer im
           Prinzip nichts &uuml;brig haben (Domestic Digital Habitat).
       <LI>In wenigen Tagen soll die neue Amiga-Website (http://www.amiga.com)
           online gehen.
       <LI>Entwicklersoftware soll &uuml;ber eine Supportsite bereit gestellt werden.
       <LI>Sp&auml;ter soll die Entwicklersoftware auf jedem PC mit den genannten
           Spezifikationen lauff&auml;hig sein, Support werde es jedoch nur f&uuml;r jene
           geben, die das Ger&auml;t von AMIGA kaufen.
       <LI>Noch heute sollen Partnerschaften mit Multi-Milliarden-Dollar-Firmen
           bekannt gegeben werden.
       <LI>Die Amiga-Technologie soll von jeder Firma mit einer guten Idee und etwas
           Geld lizensiert werden k&ouml;nnen.
       <LI>Noch heute soll es eine Ank&uuml;ndigung bez&uuml;glich AROS (Amiga Replacement OS)
           geben.
       <LI>AMIGA selbst entwickele momentan keine 68k-Emulation, stehe jedoch in
           Kontakt zu mehreren Firmen, die diese Aufgabe &uuml;bernehmen m&ouml;chten (aber
           unterschiedliche Ziele verfolgen).
        <br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
