<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / GNN berichtet &uuml;ber den AMIGA</title>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<font size="4"><center><b>Amiga stellt Entwicklersystem vor - Red Hat als Partner</b></center></b></font>
<br><b>Strategische Partnerschaft mit Sun, Red Hat und Corel</b><br>
<br><b>Fleecy Moss, der Vice President von Amiga, hat am Wochenende auf der Amiga-2000-Konferenz Details des erwarteten Amiga-Entwicklersystems vorgestellt, das auf einem preiswerten PC mit schneller Grafikkarte und installiertem Linux basiert. &Uuml;berhaupt scheint Linux neben dem zuk&uuml;nftigen Amiga-Betriebssystem eine gro&szlig;e Rolle f&uuml;r die neue Plattform zu spielen.</b>
<BR>Die Hardware des ab diesem April erh&auml;ltlichen Entwicklersystems umfasst einen mit 500MHz getakteten AMD-K6-2-Prozessor, 64MB SDRAM und eine GeForce256-Grafikkarte. Die Entwicklungsumgebung l&auml;uft derzeit unter Red Hat Linux und soll auf jedem PC einsetzbar sein; allerdings gibt es nur Support f&uuml;r diejenigen, die das Entwicklersystem auch von Amiga erstanden haben. Die Unterst&uuml;tzung von Seiten der Entwickler scheint Amiga jetzt schon sicher zu sein, da bereits jetzt die 
Portierung von 100 gebr&auml;uchlichen alten Amiga-Anwendungen angek&uuml;ndigt wurde.
<br><br>
Erst gegen Ende des Jahres sollen die Consumer-Maschinen folgen, auf denen das schlanke von Tao programmierte Amiga-Betriebssystem laufen soll. Der auf Taos Elate-Betriebssystem basierende Kernel soll nur 25KB gro&szlig; sein. Mit aufgesetzter und damit austauschbarer bzw. modifizierbarer GUI und Java-Unterst&uuml;tzung soll das Betriebssystem gerade einmal 3MB RAM ben&ouml;tigen. Entsprechend fix 
d&uuml;rften die Anwendungen sein, die dank des Betriebssystems ohne Recompilierung auf unterschiedlichster Hardware laufen sollen - damit eignet sich die Amiga-Plattform sowohl f&uuml;r &uuml;bliche Desktop-Systeme als auch f&uuml;r Internet-Appliances. 
<br><br>
Linux soll &uuml;brigens nicht nur als Basis f&uuml;r das Entwicklersystem gelten, sondern eine wichtigere Rolle spielen. So sollen 26 verschiedene Linux-Distributionen in Zukunft Amigas neuen &quot;Consumer Application Layer&quot; 
unterst&uuml;tzen und einen Standard f&uuml;r Anwendungsoberfl&auml;chen bzw. -schnittstellen schaffen. Zuk&uuml;nftige Corel-Linux-Anwendungen sollen sogar von Hause aus eine Amiga-Benutzeroberfl&auml;che erhalten. 
<br><br>
Als strategische Partner hat Amiga Sun und Red Hat gewonnen, ob dem allerdings so viel Bedeutung zugemessen werden sollte, ist fraglich. Schlie&szlig;lich ist Sun von jedem strategischer Partner, der Java unterst&uuml;tzt. Welche Rolle Red Hat spielt, ist noch nicht ganz 
klar - Ger&uuml;chte zu einer Beteiligung an oder gar einer &Uuml;bernahme von Amiga Inc. sind zumindest schon im Netz zu finden. Weitere Partnerschaften sollen folgen.
<br><br>
Amiga peilt zwei verschiedene M&auml;rkte an, die mit der skalierbaren und flexiblen neuen Plattform abgedeckt werden sollen: F&uuml;r den &quot;Digitalen Abenteurer&quot;, der dem Bild des Amiga-Nutzers entspricht, soll es eine leistungsf&auml;hige Hard- und Softwareplattform geben, die Fantasie und Kreativit&auml;t 
fordert. F&uuml;r den Heimbereich sollen spezielle Ger&auml;te geschaffen werden, die ihren vorbestimmten Zweck erf&uuml;llen und auch von Computer-unerfahrenen Nutzern spielend bedient werden k&ouml;nnen. 
<br><br>
<b>Kommentar von GNN:</b><br>
Die neue Amiga-Plattform soll alle bisherigen Betriebssysteme in der Skalierbarkeit schlagen - schlie&szlig;lich muss nur der Betriebssystem-Kernel an die jeweilige Prozessor-Architektur angepasst werden, da die Anwendungen auf einem virtuellen Prozessor 
laufen und von der Hardware im Prinzip abgeschottet sind. Doch wird Amiga nicht f&uuml;r s&auml;mtliche Hardware-Konfigurationen entsprechende Treiber liefern k&ouml;nnen. Wieviel dann noch von der Skalierbarkeit &uuml;brig bleibt, muss sich zeigen. Sicher ist, dass Amiga die Hardware-Plattform wechseln kann, ohne dass erst s&auml;mtliche Anwendungen neu geschrieben werden m&uuml;ssten. 
        <br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
