<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Innovative Web Newsletter</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width="90%"><tr><td>
<br>
<center><font size="4">Innovative Web Newsletter</font></center><br>
<b>25.4.2000 fxPAINT EK #2 fertiggestellt</b><br>
Das zweite Update zu fxPAINT wurde fertiggestellt. Die neue Version bietet eine
F&uuml;lle neuer Features und dank vielen Optimierungen eine wesentlich gesteigerte
Geschwindigkeit. <br>

<ul>Die wichtigsten Neuerungen im &Uuml;berblick:
<li>fxVIDEO-System: Tutorial-Videos direkt innnerhalb von fxPAINT!</li>
<li>neues Zeichenwerkzeug: Bevelcircle</li>
<li>6 neue Effekte (Edge-Detect, Sharpen, Texture, &quot;Deep inside&quot;, DisplaceMap
 und ein neuer Buttonrand-Effekt)</li>
<li>echtes Antialiasing f&uuml;r Text</li>
<li>weiter verbesserte Zeichentablettunterst&uuml;tzung</li>
<li>stark verbessertes fxALBUM (insbesondere verbesserte HTML-Album-Erstellung)</li>
<li>wap.plugin: fxPAINT ist das erste und einzigste Programm zum Lesen und
 Schreiben von WBMP-Bildern!</li>
<li>AXIS-Farbkalibrationssystem f&uuml;r optimierte Bildschirmdarstellung</li>
<li>Mousewheel-Unterst&uuml;tzung f&uuml;r M&auml;use nach dem NewMouse-Standard (z.B. VMC 4D+ Maus)</li>
<li>beschleunigte Lade- und Speichermodule dank Portierung auf PPC</li>
</ul><br>
Desweiteren wurden viele von Usern angeregte Verbesserungen im Detail
vorgenommen.
<br><br>
<b>23.3.2000 VHI Studio 5.0 verf&uuml;gbar</b><br>
Der Nachfolger des bekannten VLRec NG, VHI Studio 5, ist ab sofort verf&uuml;gbar.
<br><br>
Diese Software erlaubt die Aufnahme, das Editieren und &quot;Grabben&quot; von Bildern mit
Hilfe eines Digitizers (durch VHI werden verschiedene unterst&uuml;tzt, z.B. VLab, Frame-
Machine, Masoboshi MVD 819, GVP IV24) oder einer Digitalkamera. Weitere Extras, wie
etwa die Manipulation von Bildern, animierten Effekten, WebCam- und Zeitraffer-
M&ouml;glichkeiten sind ebenfalls im Programm integriert. Mit VHI Studio ist es dar&uuml;berhinaus
nun sogar m&ouml;glich, alle Bilddaten &uuml;ber eine virtuelle Disk von jedem Programm aus laden
zu k&ouml;nnen, auch wenn sie noch nirgends gespeichert wurden.
<br>
<ul>Neuerungen gegen&uuml;ber der Version 4 von VLRec NG sind:
<li>Digitalkamera-Unterst&uuml;tzung hinzugekommen</li>
<li>direkte Bildbearbeitungsm&ouml;glichkeiten im Snapshot Center</li>
<li>Neuer Treiber CamEx.vhi</li>
<li>VHI Studio VD (Virtual Disk)</li>
</ul><br>
Gleichzeitig hat Innovative drei neue VHI-Digitalkamera-Treiber ver&ouml;ffentlicht, die den Betrieb von
aktuellen Digitalkamera-Modellen am AMIGA erm&ouml;glichen. 
<br><br>
VHI Studio wird auf CD zusammen mit allen VHI-Treibern und prozessoroptimierten Versionen des Programms
ausgeliefert. Weiterhin finden sich Tools und Entwickler-Informationen. Treiber f&uuml;r Digitalkamera m&uuml;ssen
seperat gekauft werden.
<br>
<ul>Preise:
<li>VHI Studio: 69 DM/35 EURO/35 US$</li>
<li>VHI-DigiCam-Treiber: 20 DM/10 EURO/10 US$</li>
</ul>
<br>
<b>22.4.2000 Shortcuts zu unseren Produktseiten</b><br>
Bisher waren unsere einzelnen Produktseiten nur mit mehreren Clicks erreichbar. Ab sofort sind diese via
Subdomain-Shortcuts erreichbar und verzweigen direkt auf die jeweilige Produktseite:<br>
<ul>        <a href="http://fxpaint.innovative-web.de/">http://fxpaint.innovative-web.de/</a><br>
        <a href="http://fxscan.innovative-web.de/">http://fxscan.innovative-web.de/</a><br>
        <a href="http://mlcpro.innovative-web.de/">http://mlcpro.innovative-web.de/</a><br>
        <a href="http://ultraconv.innovative-web.de/">http://ultraconv.innovative-web.de/</a><br>
        <a href="http://vhistudio.innovative-web.de/">http://vhistudio.innovative-web.de/</a><br>
</ul>
<br><br>
Die Seite des VHI-Standards hat auch eine neue Adresse:
        <a href="http://vhi.innovative-web.de/">http://vhi.innovative-web.de/</a>
<br><br>
Wenn Sie unsere Produkte m&ouml;gen, w&auml;ren wir Ihnen f&uuml;r einen Link von Ihrer Homepage dankbar.
<br><br>
<b>22.4.2000 Bilder = Dateien .. das neue Stargate-Plugin f&uuml;r fxPAINT</b><br>
Die neue Version des Stargate Plugin erlaubt es nun auch, auf Bilder, die in fxPAINT geladen wurden,
zuzugreifen als w&auml;ren es Dateien. Au&szlig;erdem besteht weiterhin die M&ouml;glichkeit, Bilder direkt an fxPAINT zu
schicken. U.a. unterst&uuml;tzen die Programme PhotoAlbum, CyberShow, Superview, VHI Studio und Ultraconv NG
bereits den &quot;Stargate Airport&quot;.
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
