<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Sven Kahlbrock">
<META NAME="description" CONTENT="AMIGA TIMES - Deutsches AMIGA Fun und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<TITLE>AMIGA TIMES - Fun &amp; Talk / Haage &amp; Partner Newsletter</TITLE>
</HEAD>

<BODY background=../pic/bg.gif TEXT="#000080" BGCOLOR="#FFFFFF" LINK="#EE0000" VLINK="#EE0000" ALINK="#FF0000">
<center><table width=90%><tr><td>
<br>
<center><font size="6">Haage &amp; Partner News</font></center><br>
			<b>AmigaWriter 2.0 ab Mai</b><br><br>
			AmigaWriter ist das ideale Programm f&uuml;r Sch&uuml;ler, Studenten und Ingenieure, denn es bietet echte Fu&szlig;noten
			und importiert sogar Word Dokumente vom PC oder Macintosh. Dar&uuml;ber hinaus verf&uuml;gt AmigaWriter &uuml;ber
			eine ausgekl&uuml;gelte Kapitelverwaltung und erstellt automatisch Inhaltsverzeichnisse.<BR>
			<BR>
			Eine Neuheit auf dem Amiga ist das Anzeigen von gegl&auml;tteten (AntiAlias) TrueType-Zeichens&auml;tzen, wodurch
			Texte auch in kleiner Darstellung noch sehr gut lesbar sind. AmigaWriter beinhaltet auch viele Funktionen eines
			DTP-Programms: frei plazierbare Boxen f&uuml;r Text, Grafiken oder beliebige andere Objekte, verkettete Boxen,
			freie Seitenformate, flexible Absatzformate, automatische Absatzkontrolle, umfangreiche Schriftmanipulationen,
			frei definierbare Absatz- und Zeichenformate und die Funktionalit&auml;t Brosch&uuml;ren herzustellen.</P>
			<ul><B>Die Neuerungen der Version 2.0</B>
			<li>MSWord (TM)-Importfunktion</li>
			<li>TrueType-Support mit Kantengl&auml;ttung</li>
			<li>Zeichensatzersetzung</li>
			<li>AmigaOS 3.5-Unterst&uuml;tzung</li>
			<li>Brosch&uuml;rendruck, Querdruck, gekachelter Druck</li>
			<li>Echtfarbdruck auch ohne Grafikkarte</li>
			<li>schneller Schwarz/Weiss-Druck</li>
			<li>4-Farb-optimiert auf ECS/AGA-Amigas</li>
			<li>neuer Bildcache</li>
			<li>viele weitere Verbesserungen und Fehlerbeseitigungen</li>
			</ul><br>
			<ul>
			<B>Weitere Features von AmigaWriter 2.0</B>
			<UL>
				<LI>WYSIWYG- Fu&szlig;noten
				<LI>automatisches Inhaltsverzeichnis
				<LI>mehrsprachiger Trennalgorithmus
				<LI>Rechtschreibpr&uuml;fung mit Korrekturvorschl&auml;gen
				<LI>Dokumentvorlagen
				<LI>Kapitelverwaltung
				<LI>umfangreiche DTP-Funktionen
			</UL>
			<br><br>
			Lieferbar ab Mitte Mai 2000. Die Auslieferung des kostenlosen Updates an alle registrierten AmigaWriter 1.x-Kunden
			erfolgt automatisch, sobald die Version verf&uuml;gbar ist.
			</ul>
<br><br>
			<b>ArtEffect 4.0 ab Mai</b><br><br>
			Die 4. Version des beliebten Grafikprogramms zu Bildbearbeitung und zum nat&uuml;rlichen Malen bringt wieder eine
			F&uuml;lle neuer Funktionen und Verbesserungen. Dabei wurde diesmal besonderes Augenmerk auf die Ebenenfunktionen
			gelegt, die jetzt sehr flexibel und leistungsf&auml;hig geworden sind. Eine neues Handbuch und eine CD-ROM mit
			Fonts, Cliparts und Workshops runden das neue Paket ab.<BR>
			<BR>
			<B>Die neuen Features im &Uuml;berblick:</B></P>
			<UL>
				<LI>mehrere Alpha-Kan&auml;le und Alpha-Kompositionen pro Bild (siehe Ebenen-Fenster)
				<LI>Konvertierung von Farbkanal&lt;-&gt;Alpha-Kanal und Transparenz-&gt;Alpha-Kanal (siehe Masken-Men&uuml;)
				<LI>Neue Ebene f&uuml;r Text (siehe Ebenen-Fenster Popup-Men&uuml;)
				<LI>Neue Ebene f&uuml;r direkte Bildbearbeitung (Kontrast/Helligkeit/Gamma-Korrektur, Negativ, Schwellwert, Posterize).
				<LI>spezielle Effektebene zum Malen von Karten (Landschaft), Feuer und Space-Bildern (siehe Ebenen-Fenster Popup-Men&uuml;)
				<LI>neuer Wasserfarben-Modus f&uuml;r die Str&uuml;hpistole (seiehe Werkzeugeinstellungen)
				<LI>Anpassung der Filtermodule auf die Ebenen-Operationen (z.B. Twirl und Motion Blur)
				<LI>automatische Erzeugung eines OS3.5-Icons beim Speichern (siehe Programmeinstellungen)
				<LI>neues, komplettes Handbuch
				<LI>Auslieferung auf CD-ROM mit vielen Fonts, Cliparts und Workshops
			</UL>
			<P><BR>
			<B>Systemvoraussetzung:</B><BR>
			AMIGA mit 68020-Prozessor, AmigaOS 3.x, mind. 8 MB RAM, Festplatte<BR>
			<BR>
			ArtEffect 4.0 wird ab Mitte Mai 2000 lieferbar sein. Der Preis f&uuml;r das Update betr&auml;gt 89 DM.
<br><br>
</td>
</tr>
</table>

</BODY>
</HTML>
