<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Hyperion Entertainment: AmigaOS 4.0 - Entwicklungsstatus

Hyperion Entertainment (http://www.hyperion-entertainment.com) informiert:

»Leuven, Belgien, 21. Januar 2002

Lassen Sie mich damit beginnen, allen in der Amiga Community alles Gute f&uuml;r
das Jahr 2002 zu w&uuml;nschen.

Wie bekannt ist, hat Hyperion Entertainment mit Amiga, Inc. ein
Lizenzabkommen geschlossen, um OS4.0 f&uuml;r das PPC-basierte System zu
produzieren.

Seit meiner Pr&auml;sentation in K&ouml;ln auf der Amiga 2001 am 17. und 18. November
wurde Einiges an Fortschritt erzielt, was ich nun mitteilen m&ouml;chte.

Einige Leute haben sich &uuml;ber das Fehlen von Reports beschwert, aber ich
hoffe, ich kann mit Ihrem Verst&auml;ndnis rechnen, da wir alle sehr
besch&auml;ftigt waren, sogar w&auml;hrend der Weihnachtszeit, um Ihnen das fraglos
ambitionsreichste OS-Update seit Amiga OS 3.0 zu bringen.

Es ist mir klar, dass einige Leute skeptisch sind wegen des Umfangs des
Projekts, und weil &auml;hnliche Versprechungen in der Vergangenheit h&auml;ufiger
gemacht wurden.

Diesen Leute m&ouml;chte ich sagen, dass Hyperion Entertainment nicht
leichtfertig Vertr&auml;ge abschlie&szlig;t, und dass wir bekannt daf&uuml;r sind,
kommerzielle Projekte und Auftragsarbeiten auf Windows, Mac, Linux, Amiga
und Amiga DE/Elate ausf&uuml;hren zu k&ouml;nnen.

Wir haben ein wirklich imposantes Entwicklerteam von etwa 25 Leuten
zusammen gebracht, bestehend aus vielen OS 3.5 und 3.9 Entwicklern,
erg&auml;nzt durch einige sehr bekannte und respektierte Amiga-Entwickler.

Ich bin sehr erfreut mitteilen zu k&ouml;nnen, dass Dave Haynie zugestimmt hat,
als technischer Berater zur Verf&uuml;gung zu stehen.

Es wird sicher schwer sein, ein erfahreneres Team f&uuml;r diesen Job zu finden.

Wir k&ouml;nnen nicht garantieren, dass jeder einzelne Punkt in dieser Liste in
der ersten Version von OS4.0 vorhanden sein wird, aber dies sind die
Punkte, die wir in OS4.0 haben m&ouml;chten.

Sie werden auch bemerken, dass zum ersten Mal in vielen, vielen Jahren
grunds&auml;tzliche Arbeit an Intuition, einem der Kernelemente des AmigaOS,
unternommen wird. Eine PowerPC-native Version von Intuition wird starke
Geschwindigkeitsgewinne verzeichnen k&ouml;nnen.

Wir haben vor, OS4.0 gr&ouml;&szlig;tenteils von Festplatte oder Flashrom zu laden
(also kein festes ROM mehr). Dazu mehr in einem sp&auml;teren Update.

OS 4.0 soll au&szlig;erdem ohne Schwierigkeiten von CD installierbar sein, ohne
ein schon installiertes OS3-System zu ben&ouml;tigen.

Da wir mehr Arbeit angenommen haben, als urspr&uuml;nglich geplant (Intuition,
etc.), und Einiges an Funktionalit&auml;t, die f&uuml;r OS 4.2 geplant war, in OS
4.0 &uuml;bernommen haben, bedeutet dies, dass der geplante
Ver&ouml;ffentlichungstermin im Februar m&ouml;glicherweise nicht eingehalten werden
kann, aber wir glauben, dass das Endergebnis technologisch wesentlich
befriedigender sein wird.

Ende Januar hoffe ich, den gr&ouml;&szlig;ten Teil der rechtlichen Belange f&uuml;r OS 4.0
hinter mich gebracht zu haben, so dass ich Sie mit h&auml;ufigeren
Fortschrittsberichten versorgen kann.

Es ist mir bewusst, dass Ihre Geduld &uuml;ber die letzten Jahre immer wieder
hart auf die Probe gestellt wurde, und ich kann die Ungeduld und sogar
Skepsis verstehen, aber ich kann Ihnen versichern, dass AmigaOS in guten
H&auml;nden ist, und dass wir liefern werden.

Abschlie&szlig;end m&ouml;chte ich jeden einladen, der (aus verst&auml;ndlicher Frustration
&uuml;ber die Vernachl&auml;ssigung des AmigaOS durch seine fr&uuml;heren Besitzer) sich
entschlossen hat, die Zukunft in die eigene Hand zu nehmen, mit uns, statt
gegen uns zu arbeiten.

Ben Hermans, LL.M
Managing partner, Hyperion Entertainment VOF



Amiga OS 4.0 - vorl&auml;ufige Featureliste

Exec Second Generation (Exec SG)
Exec ist der Kern des AmigaOS und ist in der aktuellen Version in
68k-Assembler geschrieben.
Momentan wird Exec in C nachgebaut und neue Funktionalit&auml;t wird
hinzugef&uuml;gt, um den Einsatz von OS 4.0 auf jeder geeigneten
PowerPC-Plattform zu erm&ouml;glichen.
Die folgenden Features sind geplant:
   o Hardware-Abstraktion
   o Virtueller Speicher
   o Neue Bibliotheken-Schnittstelle (shared libraries)
   o Resource tracking
   o Optional: Speicherschutz
   o R&uuml;ckw&auml;rtskompatibilit&auml;t zu WarpUp

"68k Just in Time"-Emulator

PPC-Nativer TCP/IP Stack
   o Implementiert als Systembibliothek.
   o Kompatibel mit der auf dem Amiga standardisierten
     "bsdsocket"-Schnittstelle, wie sie urspr&uuml;nglich von AmiTCP definiert
     wurde.
   o Erweiterte Schnittstelle, um gr&ouml;&szlig;ere Kontrolle &uuml;ber die interne
     Arbeitsweise und Konfiguration zu erhalten.
   o Eingebauter DHCP-Client (z.B. f&uuml;r Kabelmodems).
   o Eingebauter Superserver (inetd).
   o IP filtering und Networking Address Translation.
   o Treiber f&uuml;r asynchrones PPP (f&uuml;r Modemnetze) und PPP &uuml;ber Ethernet
     ("PPPoE", f&uuml;r ADSL/T-DSL und Kabelmodems)
   o AmiSSL V2.0

PPC-Natives Filesystem (FFS2)
FFS2 ist ein vollst&auml;ndig r&uuml;ckw&auml;rtskompatible Neuimplementation des Fast
File System in C. Es unterst&uuml;tzt Medien gr&ouml;&szlig;er als 4 GByte, und ein neues
Namensschema f&uuml;r Dateien/Verzeichnisse erlaubt lange Dateinamen (bis zu
108 Zeichen).

Plattenrettungs- und Restaurationswerkzeuge
Vollst&auml;ndige Werkzeuge zur Datenrettung und -Wiederherstellung, inklusive
Salvage, Undelete, Unformat, Repair, RDBSalv, ReOrg/Defrag,
Integrit&auml;tspr&uuml;fung usw.

PPC-natives RTG-System
Das PPC-native RTG-System (basierend auf Picasso96 V3) erlaubt die Nutzung
von modernen Grafikkarten im Amiga.
Treiber sind f&uuml;r g&auml;ngige Zorro II/III-Karten geplant, au&szlig;erdem f&uuml;r Permedia
2/3, Voodoo 3, Matrox G450/G550, und ATI Radeon.
Eine optimierte PPC-native Version der layers.library ist ebenso geplant.

Warp3D
Eine neue Version von Warp3D, die leistungsf&auml;hige low-level
3D-Schnittstelle, welche sowohl auf dem klassischen Amiga und der
intent/AmigaDE-Plattform verf&uuml;gbar ist, wird als neue Version in OS 4.0
enthalten sein, und wird es Programmierern erlauben, ihre 3D-Software
schnell zwischen den Plattformen hin- und her zu bewegen.
Treiber f&uuml;r Permedia 2/3, Voodoo 3, Matrox G450/G550 und ATI Radeon sind
geplant.

OpenGL 1.3 (Mesa 4.0.x)
OpenGL ist eine plattform&uuml;bergreifende Highlevel-3D-Schnittstelle,
urspr&uuml;nglich entwickelt von Silicon Graphics.
Unterst&uuml;tzung f&uuml;r OpenGL 1.3 wird erreicht durch die Portierung des
OpenSource-Projektes Mesa (welches inzwischen alle SGI Konformit&auml;tstests
besteht). Es wird auf Warp3D aufgesetzt werden.

PPC-natives RTA-System (AHI)
Das RTA-System erlaubt die Benutzung von Soundkarten (PCI oder Zorro
II/III).
AHI von Martin Blom ist der momentane de-facto-Standard auf dem Amiga, und
eine PPC-native Version wird zur Unterst&uuml;tzung von Soundkarten angeboten,
inklusive der Unterst&uuml;tzung von allen aktuellen Amiga-Karten, sowie
Soundblaster 128 und Live.

PPC-natives Intuition und ReAction
Reaction ist das BOOPSI-basierte GUI-System f&uuml;r den Amiga, welches mit
OS3.5 eingef&uuml;hrt und in OS 3.9 erweitert wurde.
Existierende Klassen werden erweitert oder neu implementiert, um ein
besseres und konsistenteres Aussehen zu erm&ouml;glichen. Die
Requester-Handhabung und Intuition Men&uuml;s werden erweitert werden.
Au&szlig;erdem wird ein neues "Preferences"-System dem Benutzer mehr Kontrolle
&uuml;ber weitere Aspekte der Benutzerschnittstelle erm&ouml;glichen.
Andere Merkmale:
   o Drag and Drop"-Unterst&uuml;tzung
   o Neues Ghosted"-Aussehen

Intuition soll folgende neuen Merkmale unterst&uuml;tzen (mehr sind noch in
Planung):
   o Neue "DrawInfo" Farben
   o Erweiterte Fensterrahmen
   o Sich an die Aufl&ouml;sung anpassende Systemgadgets
   o Benutzerdefinierter Stil f&uuml;r Systemsymbole und 3D-Rahmen mit
     Unterst&uuml;tzung externer PlugIns
   o Konfigurierbares Aussehen f&uuml;r proportionale Gadgets
   o Neues "Disabled"-Aussehen f&uuml;r Gadgets (wo zutreffend)
   o GadTools-Erweiterungen (pop-up-M&ouml;glichkeiten f&uuml;r Cycle-Gadgets etc.)
   o Volle Benutzerkontrolle &uuml;ber die Workbench-Palette

SCSI-Treiber f&uuml;r SCRIPTS-basierte SCSI-Adapter

WarpInput API (Arbeitstitel)
WarpInput ist ein API, um Kontroller-Ger&auml;te anzusprechen (&auml;hnlich wie z.B.
DirectInput unter Windows). Es erlaubt Programmierern, Unterst&uuml;tzung f&uuml;r
eine ganze Reihe von Eingabeger&auml;ten wie Tastatur, Maus, Joystick (Analog,
Digital, USB), Trackballs, Playstation-Pads usw. mittels einer
einheitlichen Programmierschnittstelle.

Minimaler USB-Stack

PPC-native Datatypes

Neue HDToolBox

Unterst&uuml;tzung von TrueType/OpenType Schriften«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
