<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"
zusammengefasst.

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@aakt.de


1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren

Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an aakt@aakt.de


Die Frage des letzten Monats lautete:

»Wie ist deiner Meinung nach 2001 f&uuml;r den Amiga verlaufen und was erwartest
du dir vom neuen Jahr?«


J&uuml;rgen Lange antwortet sehr ausf&uuml;hrlich:

»Aus meiner Sicht hat das Jahr 2001 bez&uuml;glich Amiga-Produkten einen
befriedigenden Abschlu&szlig; gefunden. Neben den PCI-Bus-L&ouml;sungen ist es vor
allem Amithlon, welches das System "Amiga" f&uuml;r mich wieder nutzbar macht.
Und auch die Ver&ouml;ffentlichung der beiden AmigaDE-Player und der Spiele
durch Amiga Inc. sind als positiv anzusehen.

Stefan hat Recht, die Hardware-Preise f&uuml;r Amiga-Erweiterungen sind sehr
hoch. Zus&auml;tzlich ist das Angebot an Software, die z.B. PPC unterst&uuml;tzt, f&uuml;r
viele  derjenigen, die einen Amiga produktiv einsetzen, viel zu klein oder
gar nicht vorhanden.

Mit Amithlon l&auml;&szlig;t sich Amiga auch wieder produktiv einsetzen.

Die Erwartungshaltung an Amiga Inc. war von Beginn an viel zu hoch. Auf
der anderen Seite lag die einzige Chance f&uuml;r Amiga Inc., ben&ouml;tigte
Geldgeber zu finden, darin, ein ganz neues Produkt - AmigaDE - anzubieten.
Aus den bekannten Gr&uuml;nden, Geld wurde knapp und die erhoffte Hilfe der
"Gemeinde" blieb aus, verz&ouml;gerte sich dessen Entwicklung.

Mit den "Bonbons" f&uuml;r die konservative Amiga-Gemeinde, AmigaONE mit PPC
und dazugeh&ouml;riges OS, waren beide Partner (Eyetech und Amiga, Inc.)
&uuml;berfordert. Dieses Projekt mu&szlig;te bei den vorhandenen Resourcen scheitern.

Ich bin im Moment zufrieden, verwende &uuml;berwiegend Amiga (auf Amithlon),
manchmal die eine oder andere Anwendung unter Linux und gelegentlich Amiga
auf meinem A4000.«


Marion (Nachname unbekannt) schreibt:

»Ich besitze auch schon sehr lange einen Amiga 1200, vorher hatte ich einen
C64 und den kleinen Amiga 600, und muss gestehen, ich war bisher sehr
zufrieden mit dem Amiga, leider verl&auml;uft aber die Entwicklung f&uuml;r den Amiga
in den letzten Jahren nicht so gut. Auch das letzte Jahr h&auml;tte besser
laufen m&uuml;ssen, ganz besonders in der Softwareentwicklung wird der Amiga
meiner Ansicht nach immer noch sehr vernachl&auml;ssigt. Man kann nur hoffen dass
sich das in diesem Jahr sehr stark &auml;ndert.«


Guido Bruns hat folgende Zeilen verfasst:

»Tja, wie die letzten Jahre wird auch dieses Jahr, wir warten und warten.
Ich f&uuml;r meinen Teil hole mir einen PC und warte dann mit diesem Rechner,
was so alles (hoffentlich) von Amiga kommt.

God save the Amiga«


Jens Bache urteilt unter dem Titel »Hoffnungen f&uuml;rs Jahr 2002« wie folgt:

»2001 war ein Jahr, in dem den Planungen f&uuml;r die Amiga-Zukunft ein Ende
gesetzt wurden. Es wurden Partner gesucht, Auftr&auml;ge erteilt und Vertr&auml;ge
geschlossen.
F&uuml;rs neue Jahr hoffe ich, dass das AmigaOS 4 fertig wird und die
Partnerfirmen f&uuml;r dieses auch wie erhofft produzieren. Wenn alle
Partnerfirmen das AmigaOS unterst&uuml;tzen und die Raubkopierer aufh&ouml;ren, den
ohnehin kleinen Markt zu zerst&ouml;ren, dann kann eigentlich gar nichts mehr
schiefgehen. Ich jedenfalls glaube fest an die Zukunft von Amiga.
Nat&uuml;rlich hoffe ich auch, dass das AmigaONE-Board endlich fertig wird und
dem Pegasos-Board noch einige MByte RAM f&uuml;r die Grafikkarte spendiert
werden.«


Kai Stegemann sieht die Sache so:

»Das Jahr war an sich doch okay. Wir Amiganer sind nicht zu weit vom
technischen Fortschritt weggekommen.
Mit den PCI-Karten ist doch erst mal Luft nach oben und das Wasser steht
uns nicht mehr bis "Oberkante-Unterlippe"!
Kriegen wir jetzt noch neue PPC-Prozessoren, lacht die Sonne wieder &uuml;ber
Amigaland.«


Wolfgang Haas meint:

»Na ja, also ich war auf der Amiga-Messe in K&ouml;ln und hab eigentlich nur
gesehen, was in der Amiga Future, im Internet und im Newsticker von J&uuml;rgen
M&uuml;ller sowieso steht. War f&uuml;r mich nur interessant, was es an echten
Neuerungen gibt, wie AmigaXL auf QNX-Basis und PCI im Elbox-Tower. Hatte
auch die M&ouml;glichkeit, Herrn Haage  mit Fragen zu l&ouml;chern. Am meisten haben
die Talks mit den Mitbesuchern gebracht, da diese die Probleme aus
Anwendersicht kennen und auch vermitteln konnten. Von 2002 erwarte ich
einen Schub nach vorn. Es wird wohl kaum neue Anwender begeistern, da das
Floppy-Problem noch nicht ausreichend gel&ouml;st ist. Hier w&uuml;rde ich mir eine
PCI-Karte w&uuml;nschen, an die ich ein Amiga-DD- oder -HD-Laufwerk anschlie&szlig;en
kann, um von dort aus wie gewohnt meine Programme zu installieren.
Weiterhin w&auml;ren praxisnahe Komplettl&ouml;sungen f&uuml;r Videoschnitt oder
Audioediting zum Schallplatten&uuml;berspielen oder &auml;hnliches w&uuml;nschenswert.
Aber mit der sinkenden Zahl von Amiga-Anwendern und den Preisen am PC-Markt
sehe ich ein, dass der Amiga auch weiterhin ein Nischenprodukt bleibt.
Dabei hab ich meinen A2000 seit 1986 und das Teil l&auml;uft, l&auml;uft und l&auml;uft
(mittlerweile mit 'ner Blizzard 2040/40 und 128 MByte RAM). Ich m&ouml;chte den
sehen, der noch mit PCs von 1986 arbeitet. Ich freue mich auf die Zukunft
des Amigas.«


Gernod Schomberg &auml;u&szlig;ert sich wie folgt:

»Das letzte Jahr war recht durchwachsen. Zwar kam nichts von AMIGA, Inc.,
aber daf&uuml;r tat sich eine ganze Menge bei den Emulatoren. Da ich mir einen
PC hingestellt habe, kaufte ich mir alle drei, die Cloanto-CD mit WinUAE
und die H&P-CD mit Amithlon und AmigaXL. Und hier muss ich wiederholen, was
ich schon fr&uuml;her einmal gesagt hatte: Wichtig ist eine einfache
Installation der Programme auf einem PC, die auch von einem Laien
fehlerfrei erledigt werden kann.

Dieser Wunsch wird nur von WinUAE erf&uuml;llt. Bei beiden anderen Programmen
merkt man, dass sie von "Alternativ"-Spezialisten geschrieben wurden. Um
sie auf den PC selbststartend zu installieren, wird die Verwendung von
Programmen aus dem Linux- oder QNX-Bereich vorgeschlagen, deren Anwendung
nur bei entsprechender Vorkenntnis einfach ist. "Lilo" und "GRUB" sind f&uuml;r
mich Fremdworte, von der Partitionierungssoftware ganz zu schweigen.
Wahrscheinlich trifft das auch f&uuml;r die meisten Amiga- und PC-Anwender zu.
Ich habe es aufgegeben, nachdem ich mir meine WindowsME-Installation
kaputtgeschossen hatte und den Rechner neu einrichten musste. Dabei hatte
ich Gl&uuml;ck, dass ich dank dem "Amiga Explorer" von Cloanto den Ordner mit
den bis dahin angesammelten eigenen PC-Dateien auf dem Amiga
zwischengelagert hatte. Nun starte ich "Amithlon" nur von der CD, "AmigaXL"
&uuml;berhaupt nicht. Bernie Meyer, Entwickler von "Amithlon", schreibt selbst,
dass er von "Windows" so wenig Ahnung hat, dass seine Freundin ihn nicht an
ihren Rechner l&auml;sst!

Deshalb f&uuml;r das neue Jahr meine Bitte an die Entwickler: Bitte denkt an die
Leute ohne die speziellen Kenntnisse ("DAU" war wohl das richtige Wort),
damit auch diese ohne allzu gro&szlig;e Schwierigkeiten die Emulation auf ihrem
Rechner einrichten k&ouml;nnen.

Und sonst? Nachdem ich gesehen habe, welche qualitativ hochwertigen
Programme auf dem PC laufen, kann ich &uuml;ber die M&auml;ngel des Betriebsystems
hinweg sehen. Da solche Programme auf einem neuen Amiga, mit welchem
Betriebssystem auch immer, in K&uuml;rze nicht zu erwarten sind, werde ich mir
in diesem Jahr keine neue Hardware leisten. Ich werde versuchen, die
Emulatoren doch irgendwie zum Laufen zu bringen, um das Amiga-Gef&uuml;hl weiter
pflegen zu k&ouml;nnen, meinen A4000T habe ich ja auch noch. Ob irgendwann
einmal ein neuer Amiga-Rechner unter meinem Tisch stehen wird, h&auml;ngt davon
ab, ob wirklich leistungsf&auml;hige Ger&auml;te und Software zur Verf&uuml;gung stehen
werden.

Diese meine pers&ouml;nliche, d&uuml;stere Meinung ist auch dadurch bedingt, dass mir
als 76-j&auml;hrigem die Zeit weg l&auml;uft. Ich wei&szlig; nicht, ob ich noch f&uuml;nf Jahre
warten kann!«


Nun zur aktuellen Frage des Monats:

»In welcher Verfassung wird sich deiner Einsch&auml;tzung nach der Amiga-
PowerPC-Markt in einem Jahr befinden?
Beschreibe beispielsweise, welche Art von Software in welcher Qualit&auml;t und
Menge (verglichen mit entsprechenden Windows-Programmen) deiner Meinung
nach zu dem Zeitpunkt existiert, wie stark Standard-Hardware mit Treibern
unterst&uuml;tzt wird, wie gro&szlig; die Anwenderzahl ist, etc.«


Schickt eure Beitr&auml;ge bitte an aakt@aakt.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
