<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Distribution

Viele Wege f&uuml;hren zu AMIGA aktuell:

Zur Zeit sind die Diskettenmagazine

* NoCover (Herausgeber: Kilian Servais, http://www.apc-tcp.de)
* Fireball (Herausgeber: Rainer Thieke, http://fireball.webjump.com)

zur Ver&ouml;ffentlichung von AMIGA aktuell berechtigt.

Achtung: In einigen der Diskmags werden die in AMIGA aktuell enthaltenen
Grafiken aus Platzgr&uuml;nden nicht oder nur teilweise ver&ouml;ffentlicht.


Dar&uuml;ber hinaus gibt es eine Reihe weiterer M&ouml;glichkeiten, an AMIGA aktuell
zu kommen:


* &Uuml;ber das WWW: Auf der offiziellen AMIGA-aktuell-Website
  http://www.aakt.de lassen sich sowohl die monatlichen Ausgaben als auch
  wichtige Amiga-Meldungen abrufen.
  Auf http://www-users.rwth-aachen.de/Marko.Koscak/aakt/index.html
  erscheint kurz nach Versand der AmigaGuide-Version von AMIGA aktuell eine
  'Express-HTML-Version' unseres Magazins. Dies ist als Service f&uuml;r
  Abonnenten der HTML-Ausgabe gedacht, die AMIGA aktuell sofort nach
  Fertigstellung lesen m&ouml;chten. Die regul&auml;re HTML-Version erscheint in der
  Regel ein bis zwei Tage danach.


* per E-Mail-Abo: Wer AMIGA aktuell regelm&auml;&szlig;ig bei Erscheinen automatisch
  zugeschickt bekommen m&ouml;chte, kann auf der AMIGA-aktuell-Website
  (http://www.aakt.de) ein kostenloses Abonnement einrichten. Anschlie&szlig;end
  wird AMIGA aktuell jeweils zum Anfang eines Monats Base64(Mime)-kodiert
  und LhA-gepackt zugeschickt. Au&szlig;erdem gibt es bei wichtigen Ereignissen
  Sonderausgaben bzw. Newsletter.
  Eine Abbestellung ist jederzeit &uuml;ber unsere Website m&ouml;glich.


* &uuml;ber das Aminet: AMIGA aktuell ist auch im Aminet (und mit entsprechender
  zeitlicher Verz&ouml;gerung auf den Aminet-CDs) zu finden, und zwar im
  Verzeichnis docs/mags unter AaktMMJJHTML.lha (HTML-Ausgabe) bzw.
  AaktMMJJGuide.lha (AMIGAGuide-Ausgabe), wobei "MM" den Monat und "JJ" das
  Jahr darstellt. Seit Ausgabe 03/98 liegen die Grafiken in einem Extra-
  Archiv (AaktGFXMMJJ.lha) vor.
  Bei Eingabe von "Aakt" in einem Aminet-Suchprogramm werden alle
  verf&uuml;gbaren AMIGA-aktuell-Ausgaben aufgef&uuml;hrt.


* &uuml;ber folgende Mailboxen (geordnet nach Tel.-Vorwahl):

  - DEMIGOD, Modem: 0201-8761103, ISDN: 0201-8761104

  - Focus, Brett: MAILINGLISTEN/AMIGA-AKTUELL, Modem: 0209-797600,
    Modem/ISDN (wird automatisch erkannt): 0209-797876, 0209-797789

  - Karsoft, Modem: 0345-8051181 (t&auml;gl. 22:30 bis 0:00, Fr & Sa bis 1:00)

  - TOP, Brett: Database/Filebaenke/AMIGA-Files/AMIGA-Aktuell,
    Modem: 0345/299992, ISDN: 0345/299993 (Sammelrufnummern)

  - Force, Brett: 05-SUPPORT/05-MAGS/02-AMIGA_AKTUELL, Modem: 04152-839480,
    ISDN: 04152-841358, 04152-841357 (f&uuml;r Hamburger User zum Ortstarif)

  - TOPSCOPE, Brett: 01-FILE-AREA/01-AMIGA/05-DOKUMENTE/MAGAZINE,
    Modem: 0421-5978718, 0421-5978731, ISDN: 0421-5978789

  - CCS-BASE, Brett: Amiga-Ecke (eigenes Men&uuml; mit den jeweils letzten f&uuml;nf
    Ausgaben, &auml;ltere in der File-Area 'AMIGA aktuell'; Online-
    Teilnahmem&ouml;glichkeit an der FD-Hitparade),
    Modem/ISDN (wird automatisch erkannt): 08801-2453

  - Angel City, Brett: 300_SUPPORTWORLDAMIGA-AKTUELL/,
    Modem/ISDN (wird automatisch erkannt): 0911-698527, 0911-698551


  Achtung, Mailboxbetreiber: Habt Ihr Interesse, ein Brett f&uuml;r
  AMIGA aktuell einzurichten, dann meldet Euch bitte unter aakt@aakt.de bei
  uns!


* per Post-Abo: Wer AMIGA aktuell ein Jahr lang jeden Monat per Post
  zugeschickt bekommen m&ouml;chte, kann, unter Angabe des Stichworts 'Abo'
  sowie von Name und Anschrift, 15 Euro auf folgendes Konto &uuml;berweisen:
  Deutsche Bank 24 G&ouml;ttingen, BLZ 26070024, Kontonr.: 0495812,
  Kontoinhaber: Carsten Schr&ouml;der. Nach einem Jahr l&auml;uft das Abo, das sowohl
  die AMIGAGuide- als auch die HTML-Version inklusive Grafiken umfasst,
  automatisch aus, sofern es nicht verl&auml;ngert wird.


* per Post: Die neueste Ausgabe kann jeweils ab Ende des Vormonats gegen
  Diskette und 1 Euro R&uuml;ckporto in Briefmarken direkt bei mir angefordert
  werden. Alternativ kann statt einer Diskette auch ein um 50 Cent erh&ouml;hter
  Betrag mitgeschickt werden.


Die AMIGA-aktuell-Specials sind auch per Packet-Radio verf&uuml;gbar. Peter
Huyoff spielt sie in seine Home-BBS HGWBOX in die Rubrik AMIGA@DEU ein. Von
dort aus werden sie im gesamten CB-Funk-BBS-Netz innerhalb Deutschlands
verbreitet. Eventuell angeh&auml;ngte Grafiken werden jedoch wegen der geringen
Daten&uuml;bertragungsrate nicht ber&uuml;cksichtigt.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
