<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Vorwort
-------

+++ Euro-Update zum AmigaOS 3.9 erschienen +++ Hyperion Entertainment gibt
Statement zum AmigaOS 4.0 ab +++ AMIGA k&uuml;ndigt baldige Nennung des Set-Top-
Box-Partners an +++

Willkommen damit zur neuen Ausgabe von AMIGA aktuell.

Den Euro gibt es im bargeldlosen Zahlungsverkehr zwar schon seit 1999, und
es ist bereits mehr als einen Monat her, seitdem wir auch mit Banknoten und
M&uuml;nzen in dieser W&auml;hrung zahlen, aber auf dem Amiga existiert das
entsprechende W&auml;hrungssymbol erst seit wenigen Tagen offiziell, nachdem
Haage & Partner das sogenannte »Euro-Update« ver&ouml;ffentlicht hat.
Ein Wermutstropfen bleibt allerdings: Aus technischen Gr&uuml;nden konnte leider
nicht auf die sehr stark verbreitete Windows-L&ouml;sung (Zeichenposition 128)
zur&uuml;ckgegriffen werden, statt dessen kam die kaum genutzte ISO-Norm
(Position 164) zur Verwendung - mit fatalen Folgen: Bislang k&ouml;nnen nur sehr
wenige Amiga-Internet-Programme - und dann auch nur mit Tricks - das Euro-
Zeichen im Windows-Standard &uuml;bertragen beziehungsweise empfangen, so dass
eine problemlose &Uuml;bermittlung des Euro-Zeichens zwischen Amiga- und
Windows-Rechnern kaum m&ouml;glich ist. Somit wird uns Amiga-Usern wohl nichts
anderes &uuml;brig bleiben, als in der Internet-Kommunikation weiterhin das
K&uuml;rzel EUR zu verwenden.


In eigener Sache:

* Oliver Tacke m&ouml;chte den AMIGA-aktuell-Spieleteil weiter ausbauen, kann
  sich dann aber aus Zeitgr&uuml;nden nicht mehr um die Kurzmeldungen k&uuml;mmern.
  Daher suchen wir jemanden, der bereit ist, diese Aufgabe zu &uuml;bernehmen.
  Wer Interesse hat, schickt bitte eine Mail an aakt@aakt.de.


Zu den regelm&auml;&szlig;igen Aufrufen:

* An dieser Stelle eine Bitte: Jeder Artikelschreiber freut sich &uuml;ber
  Lob, aber auch &uuml;ber konstruktive Kritik, und wird durch sie motiviert.
  Scheut euch also bitte nicht, eure Meinung zu den verschiedenen Beitr&auml;gen
  zu &auml;u&szlig;ern, entweder, indem ihr direkt an die Autoren schreibt, oder aber
  an AMIGA aktuell (aakt@aakt.de).

* Wir suchen st&auml;ndig Mitarbeiter, die regelm&auml;&szlig;ig, unregelm&auml;&szlig;ig oder
  einmalig Beitr&auml;ge zu AMIGA aktuell beisteuern wollen. Inhaltlich sind
  einer Mitarbeit kaum Grenzen gesetzt. Wer Interesse hat, sollte sich
  an aakt@aakt.de oder christian@aakt.de wenden.


Viel Spa&szlig; jetzt bei dieser Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
