<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Editorial</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<IMG SRC="../images/edit_s.gif" ALT="[Editorial]" BORDER="0" WIDTH="128" HEIGHT="27">
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H3>Hallo und herzlich Willkommen bei der 2. Ausgabe der Amiga Times.</H3>

<p>
Auch diesmal haben wir uns ins Zeug gelegt und k&ouml;nnen Dir wieder einige Schmanker`l
pr&auml;sentieren. In dieser Ausgabe gibt es unteranderem ein Interview mit Petro
Tyschtschenko von Amiga Inc. zum Thema "Amiga und Werbung?!?". Weiterhin gibt es
diesesmal einen Kurs f&uuml;r das Programmieren mit Assembler und bald auch f&uuml;r C &amp; C++!

<p>
Ja die Amiga Times Redaktion ist gr&ouml;&szlig;er geworden, wir sind schon zu f&uuml;nft, jedoch
werden immer noch Leute (vorallem Redakteure) gesucht, die mitmachen wollen! Du
kannst auch als freier Mitarbeiter bei der Amiga Times mitmachen und wenn Du
irgendeinen interessanten Test/Artikel/Brief hast, an uns schicken!!!!!

<p>
Was erwartet Dich sonst noch in Ausgabe 2?<BR>
Nun... es gibt wieder mal Test`s zu Spielen, unteranderem zum Gloom3-Demo und anderen.
Es wurde eine Leserecke "ins Leben gerufen" und eine Helpline erschaffen.

<p>
Direkte News &uuml;ber die Amiga Times gibt es jetzt:<BR>
Wir arbeiten ziemlich an der Amiga Times und wir m&ouml;chten Dir nat&uuml;rlich viel Service
bieten. Aus diesem Grund gibt es demn&auml;chst eine eigene Hompage
(<A HREF="http://home.t-online.de/home/Niffi">http://home.t-online.de/home/Niffi</A>)
und weiterhin kann man sich die Amiga Times aus der Mailbox FANTASY (03490/86186
Login mit dem Usernamen Support) holen.<BR>
Der Support per Mailbox wird nat&uuml;rlich noch ausgebaut. Ausserdem werden
wir uns an den "clickBOOM Amiga Web Ring" anschlie&szlig;en. Somit hast bzw. kannst Du durch allerlei M&ouml;glichkeiten
an die Amiga Times kommen und noch vor der Ver&ouml;ffentlichung einer weiteren Ausgabe,
die neusten Infos erfahren!!! Das bieten wir Dir an und hoffen das Du unseren Support
nutzt, uns vielleicht sogar unterst&uuml;tzt oder uns mit Kritiken und Anregungen
versorgst.<BR>
Die Amiga Times erscheint alle 2 Monate und ist Freeware.

<p>
Was ist sonst noch zusagen?<BR>
Ganz neu ist... wir bieten allen Computerclubs und Mailboxen die M&ouml;glichkeit,
»kostenlos« in der Amiga Times zuwerben!!! Werbung mit bunten Grafiken, werden
allerdings nur in der HTML Version erscheinen!!! Desweiteren k&ouml;nnen auch
Softwarefirmen in der Amiga Times werben, die n&auml;chste Ausgabe wird dies auch noch
kostenlos sein, aber danach nicht mehr. Eine ganze Seite (ein Link) kostet ab dann 15
DM und eine kleine Werbung nur 7 DM. Sie k&ouml;nnen uns aber auch Software zum Testen zur
Verf&uuml;gung stellen und dann ohne zus&auml;tzliche Kosten einen ganzen Link f&uuml;r
Ihre Werbung nutzen.

<p>
Auch in Zukunft werden wir Dich mit einem gesunden Ma&szlig; an Informationen versorgen,
mit Spieleschmieden Kontakt aufnehmen und Dir unterhaltsame und lustige Stunden am
Bildschrim bieten. Wir m&ouml;chten weiterhin allen Hobbyschriftstellern die M&ouml;glichkeit
geben, ihre Storys zuver&ouml;ffentlichen und wollen mehr und mehr die Leser in die Amiga
Times einbeziehen! Also Du bist gefragt!
 
<p>
Achso... wundere Dich nicht, da&szlig; diesmal "nur" sowenig Artikel vorhanden sind, aber
die arbeiten zur zweiten Ausgabe haben (leider) erst sehr sp&auml;t angefangen (ende
September)! In der n&auml;chsten Ausgabe gibt es wieder mehr Artikel, es w&auml;re jedoch
sch&ouml;n, wenn Du (wie schon oft erw&auml;hnt) etwas mit beitragen w&uuml;rdest!!!!

<p>
Mehr Zeit sollte mit dem Vorwort eigentlich nicht verpl&auml;mpert werden!
Nur noch als Information... die Amiga Times 3/97 erscheint am 23.12.1997, also (fast)
ganz p&uuml;nktlich zu Weihnachten!

<p>
<B>So und jetzt viel Spa&szlig; bei der aktuellen Ausgabe!</B>
 
<p ALIGN=CENTER>
Die Redaktion
</DIV>

</BODY>
</HTML>

