<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Spieletest's</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>The Big Red Adventure</H2>

<P>
<IMG SRC="../images/tbra.gif" ALT="The Big Red Adventure" BORDER=0 WIDTH=320 HIGHT=200 ALIGN=LEFT HSPACE=5>
Seit langem gibt es wieder mal ein Avdenture f&uuml;r unsere Freundin! Es hei&szlig;t "Big Red
Adventure" und ist einen Umsetzung vom PC. Wenn man jetzt erwartet eine aktuelle
Umsetzung zu spielen, mu&szlig; man dies leider verneinen, den das Spiel kam schon vor
Jahren f&uuml;r den PC raus und das dies nur eine einfache Konvertierung ist, bekommt man
sehr sehr schnell mit! Kaum hat man das Spiel geladen, bekommen alle TV-Amiganer ein
Schock, den das komplette Spiel wird in hochaufl&ouml;sender Grafik (Hires) dargestellt
und das f&uuml;hrt nun mal zu starken flimmern bei diesen Ger&auml;ten. Gut das kann man ja
eigentlich verschmerzen, jedoch ist der  Bildschirmtext nur lesbar, wenn man die
Helligkeit des TV`s auf 0 (Null) stellt, also ohne Monitor kann man das Spiel schon
vergessen, wenn die Grafiken wenigstens gerendert w&auml;ren, aber nein! Der zweite
Tiefschlag ist die Farbenwahl, denn nur 16 Farben kommen zum Einsatz, was heute
keinen mehr vom Hocker haut!<BR>
Okay...laden wir erstmal das Intro! Gut in diesem ist sogar Sprachausgabe, jedoch ist
diese aus den tiefsten Zeiten. Vielleicht war das 1994 ein absoluter Hit, aber
heute??? Da mu&szlig; schon viel mehr sein, damit es einen zum Kauf anregt!
Umgesetzt wurde es von Dynabyte im Jahre 1997, das schlie&szlig;t normalerweise auf
ein aktuelles Game, da&szlig; die heutigen Rechner voll ausnutzt!  Leider wird man
in der hinsicht entt&auml;uscht! Das Spiel wird in 4 Sprachen (D,GB,I,F) und auf
CD Rom ausgeliefert, dies umfa&szlig;t 32 MB. Das Spiel sollte auf die Festplatte
installiert werden, da es dann viel besser und schneller ist.
<BR CLEAR=ALL>

<P>
<H4>Kommen wir jetzt zum Spiel:</H4>
Ein neues Ru&szlig;land ist entstanden, mit KGB TV, Burger Zar, Kapitalismus, den Trotzki
Interactive Games und dem Schlangestehen (einige Sachen &auml;ndern sich nie!). In diesem
Hexenkessel spielt das Abenteuer, das "Big Red Adventure", das angeblich einen
ganezen Kontinet umspannt. Trotz der gro&szlig;en Vorteile der Perestroika gibt es immer
wieder Leute die nicht &uuml;ber diesen  Umschwung/Vorfall zufrieden sind. Aus diesem
Grund trafen sich alte M&auml;nner in geiheimen Orten in Moskau um sich an die alten Tage
zuerrinern und einen raffienierten Plan zuentwerfen. Denn sie wollten M&uuml;tterchen
Ru&szlig;land wieder in Kommunistische H&auml;nde legen damit alles wieder so wird wie es mal
war... doch leider haben sie die Rechnung ohne Doug Nuts, Dino Fagoli und Donna Fatal
gemacht, die zuf&auml;llig in diese Geschichte verwickelt werden. Doug ist ein Techno
Freak der sein geschick auch f&uuml;r Einbr&uuml;che nutzt, Dino ist  ein ehemaliger Boxer und
hat die gabe in jedes Fettn&auml;pfchen zutreten und Donna hat eine ziemlich "Bewegte
Vergangenheit", die man eher als schmutzig bezeichnen kann. Leider erf&auml;hrt man fast
garnichts aus dem Handbuch, was man eigentlich machen mu&szlig; und ist somit auf sich
selbst angewiesen, zwar wird anfangs immer etwas erkl&auml;rt, was aber genau zu tuen
ist... wird in keinster Weise erw&auml;hnt. Doug will in ein Museum einbrechen und eine
Krone klauen, soviel wei&szlig; man am anfang... wie stellt man das aber an? Nun... das
sollte jeder selbst rausfinden, denn dies ist ein Test... keine L&ouml;sung!
Im Hauptmen&uuml; kann man noch w&auml;hlen, wo man starten will. Man kann von Anfang
anspielen, da f&auml;ngt man mit Doug an, oder man w&auml;hlt Part2 mit Dino bzw. Part3 mit
Donna oder Part4 mit Doug &amp; Dino! Am besten man f&auml;ngt vom Anfang an, da man ansosten
schwer bzw. gar keinen Zusammenhang mehr findet!
 
<P>
Was hat die Grafik zu bieten? Nun die Grafik ist, wie schon erw&auml;hnt, nur in 16 Farben
und im HiRes-Format, da&szlig; ganze wurde im Comicstil gezeichnet und sieht nicht mal
schlecht aus! Obwohl ich nicht verstehe, wieso AGA notwenidig ist?

<P>
Der Sound ist voll in Ordnung, da hat man alles. Von russischen Kl&auml;ngen bis hin zu
seichten Melodien ist alles vorhanden und sorgt f&uuml;r Motivation. Jedoch sind relativ
wenig Sound/FX zuvernehmen und das ist schade.

<P>
Die Animationen: Diese sind nicht schlecht, da Comic immer gut aussieht, aber leider
gibt es keinerlei Hintergrundanimationen, keine V&ouml;gel und animierte Springbrunnen,
keine bewegte B&auml;ume/Bl&auml;tter oder soetwas! Das st&ouml;rt, weil alles dadurch unbelebt
erscheint. Also hier gibt es Minuspunkte!!!
 
<P>
Das Gameplay: Die Steuerung ist nicht gerade das, was man heute so als Standard
kennt, denn der Courser reagiert meist sehr sp&auml;t oder garnicht und dies geht einem
sehr schnell auf die Nerven. Ein Inventar oder eine Liste mit anklickbaren Verben
(wie bei Indy oder Monkey Island) gibt es nicht, sondern nur 4 "Men&uuml;s", eines zum
Reden, eines um Gegenst&auml;nde zuuntersuchen, eines um das Inventar zu nutzen bzw.
Gegenst&auml;nde aufzunehemen und eines um T&uuml;ren/Kisten zu&ouml;ffnen! Es reicht auch
eigentlich aus. Ansonsten gestaltet sich das Gameplay einigerma&szlig;en Spielbar.
 
<P>
<H4>Fazit:</H4>

<P>
Das Spiel hat eine wirklich gute Comicgrafik und die Musik ist super, jedoch ist "The
Big Red Adventure - Amiga" nur eine simple Kovertierung, ohne Verbesserungen und kann
somit heute kaum noch mithalten. Aufgrund das es keine Hintergrundanimationen gibt,
wird Spiel sehr fade und langweilig. Au&szlig;erdem braucht man eine Weile, bis man
&uuml;berhaupt den Sinn des Games herausbekommt und wei&szlig; was man tuen mu&szlig;. Also kein Hit,
wer aber wieder mal ein Adventure spielen will und einen Monitor hat, sollte sich das
Demo (leider nur Englisch) ansehen und dann entscheiden, einem sofortigen Kauf w&uuml;rde
ich abraten, da sich seit dem Demo kaum etwas ver&auml;ndert hat. F&uuml;r den Preis von ca. 50
DM ist es im Versand zu haben!
 
<p ALIGN=CENTER>
<IMG SRC="../images/bigtest.gif" ALT="Wertung" BORDER="0" WIDTH="422" HEIGHT="162">

<P>
Weitere Infos auch unter:

<P>
<TABLE BORDER=0>
<TR><TD>Email:</TD><TD><A HREF="MAILTO:bigred@powerc.demon.co.uk">bigred@powerc.demon.co.uk</A></TD></TR>
<TR><TD>Homepage:</TD><TD><A HREF="http://www.powerc.com">http://www.powercom.com</A></TD></TR>
<TR><TD>Post:</TD><TD>Power Computing Limited, Unit 82A Singer Way, Woburn Road Industrial Estate,
Kempston, Bedford MK42 7PU.</TD></TR>
</TABLE>

</DIV>

</BODY>
</HTML>

