<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Leserforum</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H3>Willkommen beim Leserforum!!!</H3>

<p>
Mit der Ausgabe 2/97 m&ouml;chten wir jetzt ein Leserforum "in die Welt" setzen, bei dem
aktuelle Themen behandelt werden sollen, Kritiken und Meinungen sollen zur Sprache
kommen und es soll viele "spa&szlig;ige" Zeilen geben! Dies liegt aber an Dir! Allein macht
ein Leserforum keinen Sinn, deshalb schreib' &uuml;ber was Du willst, kritisiere, nenne
Verbesserungen oder informiere &uuml;ber Themen die alle angehen! Vielleicht gibt es ja zu
einigen Texten der Amiga Times neue und vorallem aktuellere Infos? Dann schreibe sie
uns und in der n&auml;chsten  Ausgabe wird Dein Artikel ver&ouml;ffentlicht, schreibe
einfach!!! Alle Mails werden nat&uuml;rlich zu 150% beantwortet, auf Wunsch, noch vor der
Ver&ouml;ffentlichung der n&auml;chsten Ausgabe! Also... schwing' Dich an dein Keyboard und
schreibe! Vielleicht m&ouml;chtest Du ja sogar bei der Amiga Times mitmachen! Das ist
keine Problem, schreibe einfach eine Mail, in der Du einwenig von Dir erz&auml;hlst (was
Du zur Zeit so machst), als was Du mitmachen willst und deiner Anschrift und schon
kannst Du Dich beteiligen!<BR>
Gut das derzeitge Leserforum soll nat&uuml;rlich noch nicht zuende sein und aus diesem
Grunde, gebe ich jetzt mal ein Thema vor, &uuml;ber das geredet, diskutiert oder ein
Scherz gerissen werden kann, obwohl letzteres nicht angebracht w&auml;re!

<p>
Vielleicht hast Du ja die neuste Ausgabe des Amiga Magazins schon gelesen und dort
ist Dir bestimmt der Artikel, bessergesagt die Interviews mit Wolf Dietrich (phase 5)
und J&uuml;rgen Haage (Haage &amp; Partner) aufgefallen. F&uuml;r alle die das nicht getan haben,
hier nochmal eine kleine Zusammenfassung!
Ein (angeblich) neues Problem hat sich zwischen "phase 5" und "Haage &amp; Partner" breit
gemacht. Diese Problem hei&szlig;t »WarpUP«. »WarpUP« ist bzw. bildet eine Art
Schnittstelle zwischen der PPC Hardware und der 68k Software (u.a. einem 68k
Bertiebsystem) und der Anwendersoftware. Das h&ouml;rt sich alles ziemlich toll an. "H&amp;P"
verspricht optimale Ausnutzung der PPC Boards und der Software. Multitasking wird
versprochen MMU Support, Hardwareunabh&auml;ngigkeit und vieles mehr.<BR>
Diesbez&uuml;gliche Infos unter: <A HREF="http:www.haage-partner.com">http://www.haage-partner.com</A><BR>

<p>
"phase 5", die die PPC Boards entwickelt haben, (wof&uuml;r wir alle sehr dankbar sind!!!)
arbeiteten mit H&amp;P zusammen um gemeinsam eine zukunsftorientierte L&ouml;sung
f&uuml;r den Amiga zufinden. Dies ging auch eine ganze Weile gut... bis vor kurzem.
Am 28.9.1997 wurde ein Schreiben ver&ouml;ffentlicht, indem die Zusammenarbeit mit
H&amp;P aufgel&ouml;st wurde. Gr&uuml;nde seitens "phase 5" gab es zu hauf, angeblich
soll die neue Software die PPC Boards verlangsamen, keine 100% Aussnutzung
gew&auml;hrleisten. "phase 5" war auch der Meinung, das "H&amp;P" einen Ego-Trip
vorhat und somit andere Entwickler vom Amiga fernh&auml;lt, was laut "phase 5"
einen m&ouml;glichen Konkurrenzkampf verhindert. Doch ich finde, wenn es Konkurrenz
gibt, wird neue Technologie schneller erscheinen und auch  Preise werden sinken,
denn man m&ouml;chte ja viel Umsatz machen. Diese Vorw&uuml;rfe von "phase 5" sind
f&uuml;r "H&amp;P" unverst&auml;ndlich, da "phase 5" schon l&auml;nger von dieser
Software w&uuml;&szlig;te. Ein kleiner Konflikt hat sich hier (leider) breitgemacht.
"phase 5" wird weiter- hin allen User von »WarpUP« abraten, die angeblichen
Einschr&auml;nkungen sind bekannt, und "H&amp;P" vertritt den Standpunkt, da&szlig;
jeder User selbst entscheiden sollte. Da ich selber die PPC Boards, sowie die
»WarpUP« Software noch nicht testen konnte, kann ich zu diesen "Beschuldigungen" mir
keinen eigenen Standpunkt erlauben! Ich vertrete nur einen Fakt von "H&amp;P",
n&auml;mlich das jeder User selbst entscheiden sollte!

<p>
Hast Du vielleicht schon Erfahrung mit den neuen Boards, oder mit »WarpUP« oder
m&ouml;chtest Du nur mal Deine Meinung dazu sagen... so schreibe uns und wir werden
dar&uuml;ber diskutieren und mal sehn, wenn wir gen&uuml;gend User finden die eine Meinung
vertreten, werden wir der entsprechenden Firma eine Mail schreiben, mit eventuellen
Meinungen und L&ouml;sungen, denn im Endeffeckt sollte der User zufrieden sein und nicht
der Hersteller! Der kann zufrieden sein, wenn er gen&uuml;gend Umsatz macht.
 
<p>
Mehr Infos bei:

<p>
Haage & Partner: <A HREF="http://www.haage-partner.com">http://www.haage-partner.com</A><BR>
phase 5: <A HREF="http://www.phase5.de">http://www.phase5.de</A>
</DIV>

</BODY>
</HTML>

