<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Aktuelles</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>AMIGA &amp; Werbung?!?</H2>

<p>
Wenn man heute eine Zeitung aufschl&auml;gt findet man eigentlich zu 80% immer eine
Werbung von Computern. Sei es Laptop, PC oder sonstiges, irgendetwas ist immer
vorhanden, jedoch vermi&szlig;en wir doch etwas! Ganz klar... unsere Freundin!! Aber wo ist
sie? Das wei&szlig; niemand und wird so schnell niemand erfahren, denn der jetztige
Hersteller bzw. Besitzer des Amiga`s schweigt still! Meiner Meinung nach ist Amiga
Inc. sehr zur&uuml;ckhaltend und l&auml;st kaum etwas von sich zuh&ouml;ren! Das ist recht negativ
denn man bekommt langsam das Gef&uuml;hl, als werkle Amiga Inc. vor sich hin und das alles
ist Top Secret! Vor wem haben wir/Sie denn etwas zubef&uuml;rchten? Vor Microsoft bestimmt
nicht, die denken doch immer noch das der Amiga tot ist. Doch Amiga Inc. schweigt
still... es gibt ab und zu ein paar Vorf&uuml;hrungen, aber auf langer Sicht ist das kein
Mittel, die User bei Laune zuhalten. Ist das der richtige Weg? Diese Frage kann sich
jeder  selbst beantworten, obwohl bei einer Umfrage sicherlich 95 % alle User diese
"Strategie" f&uuml;r falsch halten w&uuml;rden! Gerade zu den heutigen Zeiten sollte man
Werbung machen, auch wenn das Produkt noch nicht "ganz" auf dem Markt ist! Denn wenn
ich eine Werbung sehe, die wirklich toll ist und sehr mich anspricht, dann frage ich
doch nach und informiere mich in Magazinen... somit w&auml;re ich schon ein potenzieller
K&auml;ufer!!!

<p>
Auch "Phase 5" k&ouml;nnte doch gerade im TV f&uuml;r ihre Boards werben und zeigen was die in
sich haben und was man mit den Boards aus dem Amiga machen kann! Leider kommt auch
von der Seite keine Reaktion.  Langsam aber sicher wird so mancher User ungeduldig,
nicht jeder hat einen Internetzugriff und leider berichten andere Zeitschriften von
Sachen die entweder erdacht wurden oder schon in einer folgenden Ausgabe von
irgendwelchen Leuten storniert wurde! Und wenn von Amiga Inc. nichts kommt, egal wie,
ob Werbung oder offizelle Mitteilungen, wird auch der hartgesotentzte User m&uuml;rrisch
und denkt &uuml;ber einen Wechsel nach! Das es dazu nicht kommen soll, ist klar!  Aber wie
soll sich etwas ver&auml;ndern?

<p>
Es mu&szlig; doch nun bald mal einen Knall geben, die Karten offen auf den Tisch gelegt
werden und was ich ganz wichtig finde, die User sollte mit einbezogen werden! Meiner
Meinung nach, n&uuml;tzt es relativ wenig wenn "die Bosse" Erfahrung haben bzw.
mitbringen, denn im Enteffeckt ist doch der Rechner f&uuml;r die User und dementsprechend
sollten auch mal W&uuml;nsche von ihnen in betracht gezogen werden!

<p>
Oder es sollte mal ein Rechner von User zusammengestellt werden, ich w&auml;re f&uuml;r einen
A1200 im Tower, mit 8 MB, Cyberstorm PPC (PowerPC604e mit 150 MHz) Turboboard, 1GB HD
und einem 6 CD Laufwerk f&uuml;r den Einsteiger zum Preis von 1500 DM!!! Und f&uuml;r Erfahrene
einen A4000 mit einer neuen Turbokarte von phase 5 (so mit 200 MHZ), 2 GB HD, 12 fach
CD, 16 MB f&uuml;r ca. 2500 DM!!! Da w&uuml;rde ich sofort zuschlagen!!!
Einige werden mich f&uuml;r verr&uuml;ckt halten, aber einen A4000 (ohne Monitor) mit 6 MB, 1
GB HD, CDROM und 68060 CPU f&uuml;r (&uuml;ber) 4000 DM ist einfach wahnsinn! Das kauft
niemand, denn im Vergleich ist ein PC schon ab 2999 DM zuhaben und da ist mehr RAM und
mehr Speed dabei! Also so wird das nicht funktionieren. Liegt es wirklich am Geld?
Geht es Amiga Inc. nur um den Profit? Ich m&ouml;chte mir dar&uuml;ber kein Urteil erlauben,
aber an den Preise und an der Hardwarezusammenstellung mu&szlig; noch viel getan werden!
 
<p>
Wie siehst Du das?
 
<p>
<H3>Zum Thema "Amiga &amp; Werbung" gibt es jetzt ein Exlusiv Interview mit Petro
Tyschtschenko von Amiga Inc.!</H3>
</DIV>

<TABLE BORDER=0 ALIGN=LEFT>
<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Herr Tyschtschenko, wieso gibt es keine Radio-, TV-, bzw. Zeitungswerbung f&uuml;r den
Amiga?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>PT:</B></TD>
<TD VALIGN=TOP>
Leider sind unsere A1200er und A4000er Produkte, die im Jahr 1991 entwickelt
und auf den Markt gebracht wurden, &uuml;berarbeitungsw&uuml;rdig. Unsere  Research &amp; Development
Abteilung, Amiga Inc., in den USA ist fieberhaft damit besch&auml;ftigt. Sobald sich
dahingehend nun neue Aspekte zeigen, starten wir im Rahmen unseres Budgets mit einer
Marketing campagne.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Finden Sie es eigentlich in Ordnung, wenn (leider nur in Amiga Zeitschriften) f&uuml;r
einen Amiga 1300/1400/1500 geworben wird, dieser jedoch nicht von Amiga Inc. stammt?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>PT:</B></TD>
<TD VALIGN=TOP>
Hier mu&szlig; ich Ihnen widersprechen, denn in jedem A1300, A1400 und A1500, der von
Micronik angegeben wird, ist unser Board enthalten. Wir verkaufen eine gro&szlig;e Menge an
Boards an Micronik f&uuml;r diese Innovation und tragen somit dazu bei, da&szlig; den Usern auf
diese Art eine Erweiterungsm&ouml;glichkeit geboten wird; da wir z.Z. noch keine neuen
Produkte vorstellen k&ouml;nnen.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Haben Sie vielleicht schon mal die PentiumII Werbung vom PC gesehen? Diese ist
recht ansprechend, warum macht Amiga Inc. nicht solche Werbung? Niemand kommt auf den
Gedanken, einen Amiga zukaufen, wenn einem "schon von klein auf" durch die Werbung
eingeredet wird, einen PC zukaufen, da dieser angeblich "unschlagbar" sei?! Die Amiga
Gemeinde ist klein geworden und wenn Amiga Inc. nicht bald Ver&auml;nderungen trifft
(z.B.: Werbung; Hauptakteur auf Computer Messen und anderes) wird sie noch kleiner
und ehe man sich versieht, gibt es einen neuen Amiga, den keiner haben will!
</TD></TR>

<TR><TD VALIGN=TOP>
<B>PT:</B></TD>
<TD VALIGN=TOP>
Da&szlig; die Gemeinde kleiner geworden ist, ist nicht verwunderlich, denn 2 Konkurse
zerst&ouml;rten auch 2 mal die Hoffnung. Der Monopol von Micro Soft und Intel fordert
seine Opfer, das haben wir ja gerade bei Apple gesehen. Meine Erfahrung  zeigt
jedoch, da&szlig; die meisten Amiga Anwender, die gezwungener ma&szlig;en auf einen PC wechseln
mu&szlig;ten, wieder zu Amiga zur&uuml;ckfinden werden, da Amiga nun einmal wesentlich besser
als alles in der existieren Computer Welt ist.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Es gibt ja viele Ger&uuml;chte, glauben Sie, da&szlig; dadurch die Amiga Gemeinde durch diese
"&uuml;ber Wasser" gehalten werden kann? Wann gibt es endlich einen richtigen Infoservice,
wo man jede Woche lesen kann, was Amiga Inc. schon geschafft hat, welche
Neuerscheinungen es gibt und wie die Marktlage aussieht! Denn wenn man Informationen
hat, braucht man sich nicht mehr auf Ger&uuml;chte zuverlassen und man kann sich auf die
Situation einstellen. Damit meine ich, wenn ich genau wei&szlig;, da&szlig; (z.B.) am 23.12.1997
ein neuer (Power)Amiga auf den Markt kommt, ist doch klar, da&szlig; ich mir nicht im
November`97 einen Amiga 1200 oder A4000 kaufen werde... da warte ich lieber auf einen
komplett neuen Amiga, der dem heutigen Softwarestandard gewachsen ist! Aber woher
soll ich das Wissen, wenn ich keine Informationen/Werbung gibt???
</TD></TR>

<TR><TD VALIGN=TOP>
<B>PT:</B></TD>
<TD VALIGN=TOP>
Ich meine, da&szlig; sich die Informationspolitk von Amiga International wesentlich
verbessert hat, im Vergleich zur Informationspolitik von Commodore und Escom. Unsere
Web Site ist ein Beispiel daf&uuml;r. Alle Aktivit&auml;ten sind in unserem Diary, das wir ab
Stunde 0 f&uuml;hren, aufzufinden. Nat&uuml;rlich verstehe ich, da&szlig; Sie hier den Teil unserer
Entwicklungsabteilung vermissen. Basisfragen, wie auf welche Prozessor Plattform
Amiga in Zukunft aufgebaut wird, wann und welche Produkte entwickelt werden, sind
leider auch f&uuml;r mich noch offene Fragen, die von der Investitionsfreudigkeit von
Gateway abh&auml;ngig sind. Entwickeln kostet nun einmal sehr viel Geld.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Finden Sie es gut, da&szlig; es neuerdings recht viele Anbieter gibt, die ihren eigenen
Amiga herstellen und vertreiben?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>PT:</B></TD>
<TD VALIGN=TOP>
Ich finde es gut, das belebt den Amiga Markt; durch Innovationen und das es recht
viele Anbieter gibt, die ihren eigenen Amiga herstellen und vertreiben.
Entsprechenden Lizenzen werden ja von uns vergeben.Wichtig ist nur, da&szlig; alles &uuml;ber
ein einziges Betriebssystem l&auml;uft, n&auml;mlich dem Amiga OS. Darauf werde ich sehr streng
achten.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Danke f&uuml;r Ihr Interview.
</TD</TR>
</TABLE>

</BODY>
</HTML>

