<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Aktuelles</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<p ALIGN=LEFT>
<H2>TITAN COMPUTER im Interview</H3>

<TABLE BORDER=0 ALIGN=LEFT>
<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Sie sind ein relativ neuer Softwarehersteller. Was erwarten Sie sich vom Amiga
und seinen Usern? Glauben Sie, da&szlig; Sie den richtigen Weg gegangen sind?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Wir sind sehr zuversichtlich was den Amiga angeht, dieser Computer hat nach wie
vor seine Daseinsberechtigung, allen Unkenrufen zum Trotz.. F&uuml;r uns ist der Amiga der
wirklich ideale Homecomputer mit seinem innovativen Betriebssystem und seiner
leichten Bedienbarkeit und wir sind &uuml;berzeugt, da&szlig; die n&auml;chste Generation Amigas
(A5000 ?) auch wieder verlorene Marktanteile wettmachen kann. Es gibt gen&uuml;gend
Ex-AmigaUser die sich &uuml;ber ihren neu erworbenen Einheitsbreirechner m&auml;chtig &auml;rgern.
Von den Usern erwarten wir, da&szlig; sie uns tatkr&auml;ftig unterst&uuml;tzen und ENDLICH mit der
zeitgem&auml;&szlig;en Aufr&uuml;stung ihres Rechners beginnen und und ihre 500er Kisten an die Wand
nageln. Man bekommt graue Haare, wenn man die t&auml;glichen Anrufe der lowest-End User
verfolgt, da wird doch wirklich beklagt, das BrainKiller und Shadow auf nem 020er mit
4MB so langsam laufen. Da f&auml;llt mir wirklich nichts mehr zu ein.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Die neue PPC Technik ist in aller Munde und genie&szlig;t schon  jetzt eine ziemlich
hohe Priorit&auml;t! Werden Sie sich anderen Firmen anschlie&szlig;en und ausschlie&szlig;lich auf
diese Technik setzten?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Wir werden nat&uuml;rlich auf diese Technik setzen, werden aber f&uuml;r die n&auml;chste Zeit
auch noch die 68030 und h&ouml;heren Amigas unterst&uuml;tzen. Allerdings werden schon im
Fr&uuml;hjahr 1998 einige reine PPC-Games von uns erscheinen.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Mit Ihrem Spiel "The Shadow of the Third Monn" stellen Sie ja  eine ziemlich hohe
Systemanforderung da! 8 MB Ram, 50 MHz und CD Rom sind ja Voraussetzungen, die es
noch bei keinem Amiga Spiel gegeben hat. Wollen Sie somit den Hardwaremarkt ankurbeln?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Hohe Anforderungen??? Das sollte l&auml;ngst Standard sein, es ist trauig, da&szlig; das
noch nicht der Fall ist. Bei den heutigen Hardwarepreisen, kann keiner mehr
argumentieren, da&szlig; diese Ausstattung zu teuer sei. Auf anderen Systemen wird auch
nicht lange gefakelt, wenn es um den n&auml;chsten Schritt in Richtung mehr
Geschwindigkeit geht. Wir hoffen nat&uuml;rlich damit auch den Hardwaremarkt wieder
ankurbeln zu k&ouml;nnen.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Demn&auml;chst werden ja Spiele wie "Elastic Dreams", "Last Days of Paradise", "Sword"
und "Brainkiller erscheinen. K&ouml;nnen Sie kurz erkl&auml;ren worum es in diesen Spielen geht
und was Sie demn&auml;chst planen?!
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Erstmal vorweg: Elastic Dreams ist kein Spiel sondern eine Bild- und
Animationsbearbeitungssoftware, die erstmals auf dem Amiga ein REAL-timemorphing
erm&ouml;glicht. Last days.. wird eine Space Opera &auml;hnlich Wingcommander sein, der Spieler
kann in 5 verschiedenen Sonnensystemen umhereisen und dort siedeln, spionieren,
k&auml;mpfen usw. Last days wird eine ausgefeilte Voxelengine sowie ein 3d
Polygon-Texturemap Routine f&uuml;r die Weltraumschlachten haben. Das hat nat&uuml;rlich auch
seinen Preis unter 030 50Mhz 8MB freies Ram geht nichts, CD-ROm ist Pflicht sowie
eine Festplatte mit gen&uuml;gend Platz.  Screenshots werden demn&auml;chst auf unserer
Homepage ver&ouml;ffentlicht.

<p>
Sword is ein Jump &amp;Run der guten alten Schule :) Der Spieler mu&szlig; als Nick Blaster
(nomen es omen) seine Braut aus den Klauen widerlicher D&auml;monen befreien. Nick wird
bis dorthin 8 verschiedene Welten durchqueren m&uuml;ssen und jede Menge Monster
kaltstellen. Bis er endlich das Zauberschwert erreicht, mit dessen Hilfe er den
BigBoss erledigen kann. Sword ECS l&auml;uft auf allen Amigas mit 1MB Chip kann auf
Festplatte installiert werden.
 
<p>
BrainKiller ist ein 3D Actiongame, der Spieler mu&szlig; die Revolte in Cybercity
niedermachen und die Aufst&auml;ndischen Cyberborgs und Klone an der Macht&uuml;bernahme
hindern, dazu stehen ihm ein halbes dutzend Waffen zur Verf&uuml;gung. BrainKiller wird
&uuml;ber 15 riesige Level mit diversen Verstecken gespielt. mind. 020 4MB Graffiti (2MB
Chip), AGA oder Grafikkarte Festplatte mit ca. 12MB ist n&ouml;tig.
</TD></TR>


<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Werden Sie auch in den Programmmarkt einsteigen oder bleiben Sie im Spielebereich
t&auml;tig?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Wir sind bereits seit &uuml;ber 1 Jahr auf dem Anwendersoftwaremarkt vertreten, wir
haben ArtStudio und BurnIt herausgebracht. Wir werden weiterhin zweigleisig fahren
d.h. Spiele und auch Anwendersoft.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Werden Sie auch f&uuml;r andere Systeme Software herstellen?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Ja, wird leider nichst anderes &uuml;brigbleiben, da der Amigamarkt auch bedingt durch
den immernoch vorhanden Raubkopierermarkt sehr klein ist. Unsere Programme ben&ouml;tigen
teilweise Entwicklungszeiten von 1 Jahr und l&auml;nger das l&auml;&szlig;t die Produktionskosten
schnell in die H&ouml;he treiben.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
M&ouml;chten Sie noch unseren Leser zum Abschlu&szlig; etwas raten bzw. sagen?
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Raten? nein das nicht. Aber ich bin der Meinung, es wird Zeit mit dem Tr&uuml;bsal
blasen aufzuh&ouml;ren, das Licht am Horizont ist schon nicht mehr zu &uuml;bersehen..... ich
hab meine Sonnenbrille schon aufgesetzt :))
</TD></TR>

<TR><TD VALIGN=TOP>
<B>AT:</B></TD>
<TD VALIGN=TOP>
Danke f&uuml;r Ihr Interview.
</TD></TR>

<TR><TD VALIGN=TOP>
<B>TC:</B></TD>
<TD VALIGN=TOP>
Gern geschehen.
</TD></TR>
</TABLE>

</BODY>
</HTML>

