<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Previews</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>Gloom 3</H2>

<P>
Gloom und GloomDeluxe waren wohl noch nicht genug... nein jetzt gibt es auch noch
Gloom3. Mehr Gemetztel, mehr Geschrei... mehr Spa&szlig;??? Das wird sich noch
heraustellen! Auch diesesmal mu&szlig; man wieder alles t&ouml;ten was einem entgegenkommt, denn
die devise ist:"Entweder Du oder ich, und ich gehe auf keinen Fall drauf!". So ist
das Game auch gestaltet. Kurz nach dem Start kommen schon die ersten Feinde und es
kann losgeballert werden. Wie auch in den ersten Teilen, mu&szlig;en von einem Ausgang zum
anderen und jeden t&ouml;ten der einem in die Quere kommt. Leider ist das nicht gerade mal
was neues. Es m&uuml;&szlig;te mal ein anderes Levelziel geben, anstatt immer nur von Ausgang zu
Ausgang. Langsam wird das 3d-Genre lnagweileg, da es kaum  Abwechslung gibt! Mehr
gibt es eigentlich nicht zusagen... ansehen sollte man sich das Game aber auf jeden
Fall. Das Demo umfa&szlig;t 2 MB und beinhaltet 5 Levels. Weihnachten `97 soll dann das
Original erscheinen. Der Preis ist bis jetzt noch nicht bekannt.

<P>
Gloom3 ist das blutigste Game das ich f&uuml;r den Amiga kenne, sobald ich auf einen
(menschlichen) Gegner schie&szlig;e und treffe, spritzt schon das Blut und sobald er tot
ist, explodiert er und seine K&ouml;rperteile fliegen durch die L&uuml;fte und bleiben dann auf
dem Boden liegen! Tote Menschen, denen der untere K&ouml;rperbau (alles ab dem Bauch)
abgekackt/weggeschossen wurde, h&auml;ngen an den W&auml;nden gekettet und winseln. Brutaleres
habe ich auf dem Amiga noch nicht gesehen!!! Ist Gloom3 ein Indizierungskandidat? Nun
ja... das will ich nicht entscheiden, eins ist aber sicher... wer Gloom Deluxe schon
brutal fand (und das mag) der ist mit Gloom3 gut bedient. Wem aber schon beim zweiten
Teil das Schrecken packte, sollte die Finger vom dritten Teil lassen!!!

<P>
<H4>Fazit:</H4>

<P>
Die Grafik ist besser geworden, jedoch sind brenndende Fackeln an der Wand nichts
neues und schon "Asbach" (n&auml;mlich ·Uralt·). Das Gameplay ist noch etwas langsam und
ruckelig (kommt auf den rechner drauf an) und bei bei einem A1200 mit 6MB und 030
Prozessor mu&szlig; man schon den kleinsten Screen einstellen, damit es &uuml;berhaupt etwas
fl&uuml;&szlig;ig spielbar ist! Hier gibt es bei den Punkten abz&uuml;ge. Die Animationen sind nicht
die besten, wie schon bei den ersten beiden Games nur ein monotones laufen der
Gegner. Also auch hier keine Pluspunkte. Der Sound beschr&auml;nkt sich gr&ouml;&szlig;tenteils auf
FX und tr&auml;gt nicht viel zur Motivation bei. Es mu&szlig; also noch viel gemacht werden,
damit es wirklich ein Kaufanreiz ist. Meine Meinung... erst Testen, dann kaufen!

<P>
Wer mehr Informationen zu Gloom 3 will...

<P>
<TABLE BORDER=0>
<TR><TD>Email:</TD><TD><A HREF="MAILTO:gazy@globalnet.co.uk">gazy@globalnet.co.uk</A></TD></TR>
<TR><TD>Homepage:</TD><TD><A HREF="http://www.users.globalnet.co.uk/~gazy/">http://www.users.globalnet.co.uk/~gazy/</A></TD></TR>
<TR><TD>IRC:</TD><TD>SpryNet.Us.GalaxyNet.Org #AmIRC 6667</TD></TR>
</TABLE>

</DIV>

</BODY>
</HMTL>

