<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Previews</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>The Shadow of the Third Moon</H2>

<p>
Black Blade Design... eine neuer Stern am Himmel? Keine Ahnung, aber auf jedenfall
wieder ein neuer Softwarehersteller, der gute Ideen hat und vorallem auf den Amiga
setzt und das ist doch das wichtigste! Da diese Firma wirklich neu ist... kann ich
leider auch nicht viel dazu sagen (es gibt ja sogar neues Games wo man selbst den
Hersteller nicht mal kennt), aber vielleicht macht sich diese Firma noch einen
Namen... wehr wei&szlig;? Das soll aber jetzt nicht unser Problem sein, sondern deren Spiel
"The Shadow of the third Monn". Dies ist ein neuer Flugsimulator, der flotten Sound
und gute Action verbindet. Ob das so ist werden wir jetzt kl&auml;ren...
 
<p>
<H4>Die Story:</H4>
<p>
Das Jahr 854. Planet Salder, Nord-West Territorium. Nach dem Sommer kommt
der Winter, der unbarmherzige Winter der Polarregion. Dein Rank verpflichtet Dich: Du
wirst zum Commandeur der 10. Raumabwehr-Division abkommandiert. Cirer`s
Besatzungstruppen werden jeden Tag st&auml;rker und bedrohlicher.

<p>
All unsere Hoffnung liegt in diesem, letzten, alles Entscheidenden Angriff!"... so
hei&szlig;t es im Spiel selbst. Nun ja... die eigentliche Story ist somit recht leicht
rauszubekommen. Du must mal wieder Deinen Planeten vor Feinden sch&uuml;tzen... kein
Problem! Ha... die schaffen wir mit links. Ja mehr kann ich leider zur Geschichte
nicht sagen. Im Demo ansich ist die Mission Tanks zuzerst&ouml;ren und das sollte kein
Problem darstellen.

<p>
<H4>Die Grafik:</H4>

<p>
Die Grafik wird im HiRes Format dargestellt und die kompletten
Men&uuml;grafiken sind gerendert worden. Ein wahrer Augenschmau&szlig;, jedoch  f&uuml;hrt die Grafik
auf allen Amigas, die einen Fernseher haben, zu starken Flimmern, was sich recht
negativ auf die Augen aus&uuml;bt. Alle die einen Monitor ihr eigen nennen, bekommen tolle
(vorallem scharfe Qualit&auml;t der Bilder) Grafiken zusehen, die auf langsam PC Standard
erreichen und auf mehr hoffen lassen. Im Actionteil ist die Grafik eher einfach
geahlten, ein See ist zusehen und ansonsten nur Berge... keine B&auml;ume und auch keine
sonstigen Gr&uuml;nfl&auml;chen, das macht die Gegend ein wenig eint&ouml;nig, aber am Besten wir
lassen uns &uuml;berraschen! Im Kampf...bzw. wenn man dan auf Tanks oder sonstiges schie&szlig;t
und trifft, steigt auch gleich Rauch empor, der wirklich gut gemacht wurde! Sonst
kann man zur Grafik noch nicht viel sagen!

<p>
<H4>Der Sound:</H4>

<p>
Der Men&uuml;sound ist einwandfrei, laut... starke Parts und sorgt f&uuml;r eine
d&uuml;stere Atmosph&auml;re, also genau der richtige f&uuml;r so ein Spiel.  Jedoch gibt es im
Actionteil keine richtige Musik nur FX un dieser ist nicht gerade gut, sondern eher
langweilig, denn au&szlig;er das Brumen des Motors und dr&ouml;nen bei abfeuern der
Sch&uuml;&szlig;e/Raketen ist nichts zuh&ouml;ren. Eine fetzige schnelle Action Musik w&auml;re
angebracht, aber davon ist bis jetzt nichts da! Schade eigentlich! Im gro&szlig;en
undganzen ist der Sound gelungen und vedient ein positives Urteil!
 
<p>
<H4>Das Gameplay:</H4>

<p>
Yep... das Gameplay. Steuerbar ist das Spiel per Maus, Joystick oder
Tastatur, aber hier mu&szlig; noch etwas passieren, den die Steuerung ist noch etwas
ungenau und somit kann es manchmal eine Lebensaufgabe werden die Trainingsmission
zu&uuml;berstehn. Also das Gameplay ist noch nicht "das Gelbe vom Ei" und sollte unbedingt
mal &uuml;berarbeitet werden, denn ein gutes Spiel mit schei&szlig; Steuerung ist leider kein
Hit.
 
<p>
<H4>Die Hardware:</H4>

<p>
Black Blade Design versucht hier wohl den Hardwaremarkt anzutreiben,
denn Systemvoraussetzungen von 8MB, 50MHz und CD-Rom gab es noch nie! Das Game l&auml;uft
zwar auch auf 4MB AGA Rechnern mit einwenig MHz Unterst&uuml;tzung, ist jedoch vieeel zu
langsam und somit geht die Motivation "fl&ouml;ten"! Also entweder nachr&uuml;sten oder
seinlassen, aber ich glaube Black Blade Design versucht das richtige, denn wenn immer
nur f&uuml;r 2MB Rechner produziert wird, ver&auml;ndert dich kaum was auf dem Markt.
 
<p>
<H4>Fazit:</H4>

<p>
Lass Dich &uuml;berraschen!!!! Mehr kann ich leider nicht dazu sagen, da das Demo
gerade im Actionteil noch nicht so viel zubieten hat. Wir von der Amiga Times bleiben
am Ball und werden versuchen neue Infos zubekommen und sicherlich auch das fertige
Game auf jedes Byte Testen! Abwarten und Kaffee trinken!!!
 
</DIV>

</BODY>
</HTML>

