<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Das Jahr Null</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>Das Jahr Null wird kommen!</H2>

<p>
"Das Jahr Null" - So oder anders k&ouml;nnte man das Jahr 2000 in der Welt der Computer
bezeichnen. Das Jahr 2000 ist einerseits die (erfreuliche) Jahrhundertwende,
andererseits ein gro&szlig;es Problem f&uuml;r die Software Industrie. Ihr habt das bestimmt
alle schon geh&ouml;rt. Die Computer werden am 31.12.1999 um 23.59 Uhr noch das richtige
Datum anzeigen, doch wenn man hofft, die Jahrhundertwende am Computer zuerleben,
indem man die 1999 in 2000 wechseln sieht, wird ma&szlig;los entt&auml;uscht. Denn der Computer
wird nur Nullen anzeigen und gerade da liegt das Problem. Normalerweise sollte der
Rechner die Zahlenfolge weiterz&auml;hlen, aber aus irgendeinem Grund werden nur Nullen
gezeigt. Eigentlich kein Problem, ABER: Leider ist die heutige Wirtschaft immer mehr
vom Computer abh&auml;ngig und somit wird es ein v&ouml;lliges Chaos geben. Das
allerschlimmste was eintreten kann ist der v&ouml;llige Zusammenbruch der Wirtschaft
in der ganzen Welt. Was kann passieren?<BR>
Hier ein paar Beispiele:

<p>
Wenn ich am 31.12.1999 gegen 23.58 einen Freund oder Freundin oder Bekanntschaft
anrufe und dieser Anruf sich &uuml;ber 00.00 Uhr herzieht, z.B.: bis 00.15 Uhr, ist man
finaziell ruiniert! Wieso? Weil man von der Telekom eine Rechnung bek&auml;me, in der
stehen w&uuml;rde, das man ein ganzes Jahrhundert telefo- niert h&auml;tte und das wird sehr
teuer!!! Nur weil die Computer nicht auf 2000 wechslen k&ouml;nnen, sondern nur auf 0000.
Somit w&auml;re ein Jahrhundert (1900 -  2000 (0000)) um - jedoch nur f&uuml;r die
Computer.<BR>
Weiteres Beispiel:

<p>
Ein man der 1960 geboren wurde, existiert im Jahr 2000 nicht mehr, denn da w&auml;re er
laut Computer -40 Jahre alt und das geht schlecht. Überweisungen w&uuml;rden schiefgehen
und und und... wie Ihr seht... sehr  ersch&uuml;tternd, aber soweit soll es nicht kommen.
Zu diesem Zweck haben namhafte Banken und Softwarefirmen Programmierer ans Werk
gesetzt, dieses Problem zu l&ouml;sen. Und seit einigen Jahr sind hunderte von
Programmierern im Einsatz und schreiben Programme um. Alles sch&ouml;n und gut - aber es
ist meiner Meinung nach der falsche Weg!<BR>
Warum so umst&auml;ndlich? Wieso entwickelt man nicht ein Tool, das dieses Problem behebt?
Es m&uuml;&szlig;te nat&uuml;rlich auf allen Amiga`s bzw. PC`s anwendbar sein und leicht zu
installieren gehen. Das w&auml;re doch viel kosteng&uuml;nstiger und vorallem weniger Arbeit!

<p>
Was meint Ihr dazu? Schreibt uns eine Email mit Eurer Meinung oder sogar mit neuen
Informationen &uuml;ber das Problem mit den Nullen. Nat&uuml;rlich, betrifft es in erster Linie
die PC`s, da diese (leider) am  h&auml;ufigsten zum Einsatz kommen. Gut und sch&ouml;n... was
geht es uns an, aber leider werden Daten verloren gehen, die auch uns betreffen
(z.B.: Geburts-Daten und vieles mehr was f&uuml;r <EM>JEDEN</EM> Menschen zufrifft).
Also...schreibt Eure Meinung!
</DIV>

</BODY>
</HTML>

