<HTML>
<HEAD>
<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.0//EN">
<META NAME="author" CONTENT="Mario Nitschke / HTML-Konvertierung Marcel Hanson">
<META NAME="description" CONTENT="AMIGA TIMES 01/97 - Deutsches AMIGA Games und Info Magazin">
<META NAME="keywords" CONTENT="Amiga,Information,Spiele,deutsch,Tips">
<!-- PROGRAM="WebPlug v1.21 © 1996-97 Esteve Boix" -->
<TITLE>AMIGA TIMES 02/97 - Fun &amp; Talk</TITLE>
</HEAD>

<BODY  BACKGROUND="../images/bg.gif" BGCOLOR="#A4A4E1" TEXT="#000000" LINK="#FF0000" ALINK="#F00000" VLINK="#AA0000">

<DIV ALIGN=CENTER>
<TABLE BORDER=0>
<TR>
<TD>
<A HREF="edit.html"><IMG SRC="../images/edit.gif" ALT="Editorial" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="inhalt.html"><IMG SRC="../images/inh.gif" ALT="Inhalt" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD>
<TD>
<A HREF="impressum.html"><IMG SRC="../images/impr.gif" ALT="Impressum" BORDER="0" WIDTH="128" HEIGHT="27"></A>
</TD></TR></TABLE></DIV><HR>

<DIV ALIGN=LEFT>
<H2>Tamagotchi - Eine neue Sucht?</H2>

<p>
Es gibt viele Suchtmittel und Drogen. Tabletten, Kaffee, Zigaretten sind nur einige
Beispiele. Jetzt.. gibt es eine neue Droge aus Japan, sie ist offiziell Erwerblich
und hei&szlig;t "Tamagotchi"! Es ist keine harte Droge, kann aber schnell s&uuml;chtig machen!
Okay... Spa&szlig; beiseite. Eigentlich wei&szlig; jeder was ein Tamagotchi Ei ist. Es ist eine
kleine Konsole, ungef&auml;hr so gro&szlig; wie ... na ja... ein Ei! Es ist eigentlich wie ein
Gameboy.. mit Grafik und Animationen... es  beinhaltet aber nur ein Spiel. Aufgabe
ist es sein "Kind" so lange wie m&ouml;glich am Leben zuerhalten, man mu&szlig; es f&uuml;ttern, es
schlafen legen, seinen M&uuml;ll wegr&auml;umen, mit im spielen... kurz gesagt man mu&szlig; ihm
Vater oder Mutter sein. Das kann viel Spa&szlig; machen, aber das Problem ist, das das
Tamagotchi Ei den ganzen Tag "l&auml;uft", man kann es nicht abschalten. Somit mu&szlig; man
sich Tag und manchmal auch Nacht um sein "Kind" k&uuml;mmern. Das w&auml;re auch nicht so
schlimm, jedoch gibt es da einige t&uuml;cken. Gibt man ihm zuviel Nahrung oder Wasser...
stirbt es. K&uuml;mmert man sich nicht um ihn/sie, ist es eingeschnappt und kann sterben.
Es gibt viele M&ouml;glichkeiten, wie das Tamagotchi sterben kann. Trotzalledem.. es ist
ein kleiner Spa&szlig; und sorgt f&uuml;r etwas Abwechslung im Alltag.
 
<p>
Doch jetzt die Nebenwirkungen:
Hat man erst so ein Ei... kommt man nicht mehr davon los! In Schulen werden sie jetzt
verboten, da der Unterricht nicht mehr durchgef&uuml;hrt werden kann, da mindestens jeder
3. so ein Ei hat. In Japan geh&ouml;rt es schon zum Alltag, &uuml;berall gibt es dieses
Spielzeug... &uuml;berall ist es ausverkauft. Da st&ouml;rt es niemanden, da&szlig; ein
<B>richtiges</B> japanisches Tamagotchi-Ei satte 80 DM kostet!!! In Deutschland werden
sie f&uuml;r 30 DM angeboten und haben mei&szlig;t eine Option "Unsterblichkeit", aber in Japan
ist dies nicht der Fall, geht eins Tod... geht das Kind in den Laden und holt sich
das n&auml;chste...eine Sucht. Die Ums&auml;tze steigen in die H&ouml;he! Gut f&uuml;r alle L&auml;den.
Irgendwie ist dies auch mit dem Spiel "Tetris" zuvergleichen, dort war genau der
selbe Vorgang zu beobachten, bis auf das dort das Game nicht starb!
Dieses Spiel hat jetzt schon Millionen Kinderherzen h&ouml;her schlagen lassen und auch die
&auml;ltere Generation ist begeistert.
 
<p>
Ja... und so ein Spiel darf nat&uuml;rlich auf dem Besten Computer auch nicht fehlen.
Jetzt gibt es auch f&uuml;r uns ein Tamagotchi Spiel... das  AmiGotchi !!!
 
</DIV>

</BODY>
</HTML>

