
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 1 / 2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Amiga Plus CD 1 /
2000</FONT></h1></CENTER></P>
Unter neuer Leitung ist die Amiga Plus wiederstark zur&#252;ckgekehrt und ich
denke, anhand vorliegender Preview-Version kann man f&#252;r diese CD Serie recht
zuversichtlich in die Zukunft blicken. Im folgenden m&#246;chte ich mal n&#228;her
auf den Inhalt der neuesten A+ CD eingehen.</P>

<h2><CENTER><FONT COLOR="YELLOW">Ver&#228;nderungen</FONT></CENTER></h2></P>
Den bleibensten Eindruck der neuesten CD hinterlassen ohne Frage die Glow
Icons, in dessen Stil die komplette CD gestaltet wurde. Sollte man nun zu
den Usern z&#228;hlen, die weder OS 3.5 noch das New Icon Paket installiert
haben, &quot;erstrahlt&quot; die CD in den &#228;lteren MagicWB Icons, was nat&#252;rlich bei
weitem nicht so gut aussieht, wie die Glow Icons. Aber auch &quot;unter der
Haube&quot; hat das A+ CD Team (ok, sagen wir einfach Markus Castro) zahlreiche
Ver&#228;nderungen vorgenommen, die der CD mehr als nur gut getan haben: Neben
vielen Script Dateien kann vor allem das von den Meeting Pearls CD bekannte
Tool &quot;MetaTool&quot;, welches fortan auf der A+ CD zu finden ist, gefallen. Zudem
hat man zwei Suchprogramm integriert (CD Cat und Findfile), die das
aufst&#246;bern von bestimmten Dateien erleichtern. Und bevor ich zum Inhalt
komme, m&#246;chte ich noch lobenswert die beiliegende Begr&#252;&#223;ungsguide (liegt sowohl im
profesionelleren und besser aussehenden HTML Format und im schlichten
AmigaGuide vor) erw&#228;hnen, die den hervorragenden ersten Eindruck abrundet.
Obligatorisch vorhanden ist nat&#252;rlich auch ein Assign Script namens
&quot;Quickstart&quot;, welches man zum Anfang einmal starten muss, damit die CD auch
reibungslos l&#228;uft.</P><CENTER><img src="aplus2.jpg"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="WHITE">Und der Inhalt?</FONT></h2></CENTER></P>
Wesentlich wichtiger als alles was oben aufgef&#252;hrt wurde ist nat&#252;rlich der
Inhalt und auch hier hat sich vieles zum guten gewandelt. Die CD ist nach
wie vor in verschiedene Ordner aufgeteilt auf die ich im folgenden genauer
eingehen m&#246;chte:</P>

<h3><b>Bereich PPC:</h3></B></P>
Schwerpunkt der aktuellen Ausgabe ist der PPC Bereich, was nat&#252;rlich nur f&#252;r
User, die im Besitz eines PPC Bords sind, interessant ist. Dieser Bereich
ist erneut in 5 Unterbreiche unterteilt.</P>

<u>Tools:</U><BR>
Neben einer PPC Demo zu &quot;Direct Dos&quot; sind hier noch der PDF Anzeiger &quot;apdf&quot;,
diverse Anim Player, &quot;NetPBM&quot;, &quot;arcPPC&quot; und &quot;Amisuperlotto&quot; zu finden. Aus
Mangel an einem PPC Bord kann ich zu dieser und auch zur nachfolgenden PPc
Software nichts weiter sagen.</P>

<u>Games:</U><BR>
Auch im Sharewareberiehc programmieren immer mehr User f&#252;r den PPC und somit
befinden sich im Games Bereich immerhin schon zwei PPC Games, die auf die
Namen &quot;GITron&quot; und &quot;AngbandPPC&quot; h&#246;ren.</P>

<u>Emulatoren:</U><BR>
Ein Bereich, f&#252;r den PPC geradezu pr&#228;destiniert ist, ist die Emulation
anderer Computer oder Konsolen. Somit ist es auch nicht weiter
verwunderlich, da&#223; es zahlreiche Emulatoren f&#252;r den PPC gibt, von denen
einige in den brandaktuellen Versionen ihren Weg auch auf diese Ausgabe der
A+ CD gefunden haben: Neben den allseits bekannten &quot;Mame&quot;, &quot;True Reality&quot;
(emuliert einen N 64) und &quot;DarkNes&quot; sind hier vor allem der &quot;GBE&quot; (mit
einigen ROM`s) und der &quot;UAE&quot; (Amiga Emulator !) interessant. Ferner befinden
sich hier noch Emulatoren f&#252;r den mitlerweile auch in die Jahre gekommenen
Atari sowie die Programme &quot;Ami Generator&quot; und &quot;Mess&quot;. Fans der Emulation
werden mittels eines PPC Bords und dieser Software wahrscheinlich viel Spa&#223;
haben.</P>

<u>Misc:</U><BR>
Neben einigen kleineren Tools (u.a. &quot;PPC Tool&quot;, &quot;Vision FX&quot;, &quot;Cyber FIX&quot; und
&quot;WOS Prefs&quot;) befindet sich hier ein Program, auf das viele Programmierer (und
auch normale User) sehns&#252;chtig warten: PPC680X0. Mit diesem St&#252;ck Software
ist es m&#246;glich, Source Codes, die f&#252;r die 680X0 Familie geschrieben wurden, auf einem PPC
zum laufen zu bringen (mit dem daraus resultierenden
Geschwindigkeitszuwachs). Damit d&#252;rfte der PPC Softwareflut nichts mehr im
Wege stehen und ich denke, da&#223; dieses Programm genau das ist, was den PPC
Softwarebereich ankurbeln kann - auch wenn es bisher nur als &quot;Promo&quot; Version
vorliegt.</P>

<u>Scenedemos:</U><BR>
Ein weiterer Bereich, f&#252;r den der PPC geradezu pr&#228;destinier ist, sind die
Demos, die sich seit langem auf dem Amiga gro&#223;er Beliebtheit erfreuen.
Schade, da&#223; ich bisher keines dieser PPC Demos gesehen habe, aber ich kann mir
vorstellen, da&#223; es sich hierbei nur um die Perlen aus diesem Bereich
handelt.</P>

<h3><B>Bereich Games:</h3></B></P>
Zwar ist die Amiga Future f&#252;r diesen Bereich zust&#228;ndig, aber trotzdem
befinden sich auch auf der A+ CD einige (wenige) Games aus allen Bereichen,
die thematisch nach Schubladen sortiert sind:</P>

<u>Demos:</U><BR>
Glatte zwei Demos befinden sich hier - einmal der recht uninteressante Break
Out Clone &quot;Walls `97&quot; und das daf&#252;r umso interessantere &quot;Exodus&quot; (Preview
siehe diese Ausgabe). Alleine schon letzteres rechtfertigt den Kauf der CD
:-)))</P>

<u>Starter:</U><BR>
Hier sind die allseits bekannten Tools &quot;JST&quot; (wird von vielen Installern,
die im Aminet zu finden sind, ben&#246;tigt) und das &#228;ltere &quot;Tude&quot; (Degrader Tool
um &#228;ltere Games zum laufen zu bewegen) in den aktuellen Versionen vertreten.</P>

<u>Updates:</U><BR>
Ein Eintrag und zwar das Update f&#252;r &quot;Foundation&quot; auf Version 1.26.
Mitlerweile ist zwar schon Version 1.27 im Umlauf, aber daf&#252;r kann keiner
was, denn die CD`s haben ja immer eine gewisse Vorlaufszeit, die dann die
eine oder andere Datei wieder unaktuell macht. Und besonders im Falle von
"Foundation" ist es recht schwierig immer aktuell zu bleiben, da für dieses
geniale Spiel in regelmäßigen Abständen immer neue Updates rauskommen. 
</P>

<u>Oldies &amp; PD</U><BR>
Vertreten sind hier einige Games aus dem PD Sektor und einige wahre Oldies.
Erw&#228;hnenswert sind vor allem die Oldies &quot;Bleed I / II&quot;, &quot;Sit Up&quot; und
&quot;Haktar&quot;. Aber auch die weiteren Games bieten einen hohen Standard und haben zudem
noch den Vorteil, bisher noch nicht tausendmal verbraten worden zu sein
(wenn man mal von &quot;Blitzbombers&quot; absieht).</P>


<h3><B>Bereich Amiga Plus:</h3></B></P>
Hier ist neben den beiden Suchtools &quot;CD Cat&quot; und &quot;Find File&quot; auch ein
Einsteller pr&#228;sent, mit dem man die Amiga Plus CD an die eigenen Bed&#252;rfnisse
anpassen kann (z.B. Ausw&#228;hlen des bevorzugten HTMl Anzeigers, JPG Anzeigers
etc.). Lobenswert erw&#228;hnt sei an dieser Stelle noch das &quot;Upadte System&quot;,
welches man in &#228;hnlicher Form schon auf der &quot;Amiga Future&quot; CD gesehen hat.
Dieses Tool h&#228;lt Euer System immer aktuell und l&#228;uft zudem noch
vollautomatisch ab. Wenn Ihr mich fragt: Dieser Service ist echt klasse und
sollte auch bei weiteren CD`s fortgef&#252;hrt werden. Ferner ist hier auch noch
das oben bereits erw&#228;hnte &quot;Meta Tool&quot; zu finden.</P>

<h3><B>Bereich Misc</h3></B></P>
Neben der &quot;Amiga User Liste&quot; (kommt Leute, tragt Euch doch endlich mal alle
ein!) befindet sich hier noch ein Tool namens &quot;Bibelforscher&quot;, welches wohl
aber nur f&#252;r eine kleine Zahl von Usern interessant sein d&#252;rfte. Wesentlich
ansprechender f&#252;r die Allgemeinheit sind da wohl die diversen Mags: Sowohl
das Amiga Gadget (Ausgabe 42), als auch die NoCover (69 und 70), die Amiga
Aktuell und die Amiga Ph&#246;nix (die ersten beiden Ausgaben - sowohl in HTML
als auch Amiga Guide) sind hier vertreten und bieten jede Menge Lesestoff
f&#252;r die kalte Jahreszeit.
</P>

<h3><B>Bereich Multimedia</h3></B></P>

<u>Gfx:</U><BR>
Im Gegensatz zur Vergangenheit sind hier nicht unz&#228;hlige Raytracing Pics,
sondern nur zahlreiche Glow Icons f&#252;r OS 3.5 User zu finden, was ich f&#252;r
extrem sinnvoll erachte, denn nicht wenige haben sich bisher OS 3.5 gekauft
und sind somit auf Glow Icons angewiesen.</P>

<u>Videos:</U><BR>
Hier sind drei MPEG Videos zu finden, die dem einen oder anderen schon
bekannt sein d&#252;rften: &quot;Crash&quot; (Nein, keine Anim wo Windows abstürzt), &quot;juggling-gig&quot; und
&quot;Pizza&quot; (recht witzig). Ben&#246;tigt wird f&#252;r das ruckelfreie abspielen
nat&#252;rlich ein halbwegs aktueller Amiga mit entsprechender CPU.</P>

<u>Sound</U> (sortiert nach MP3, AIFF und Wave):<BR>
Neben einigen recht banalen MP3 Dateien (Geschmackssache) k&#246;nnen hier vor
allem die &quot;Sendung mit der Maus Verarschungen&quot; &#252;berzeugen, die dem Zuh&#246;rer
doch das eine oder andere Schmunzeln in`s Gesicht zaubern. Abgerundet wird
das ganze von dem bekannten &quot;Trapattoni&quot; Mitschnitt vom FC Bayern
(Struuuunnnnzzzz).</P>

<h3><B>Bereich Szene:</h3></B></P>

<u>Demos:</u><BR>
Na was wohl? Grafikdemos f&#252;r unsere Freundinn. Aber nicht nur aktuelle
Vertreter (Raumschiff Enterprise, Klone und NWC) somndern auch Klassiker aus
diesem Bereich k&#246;nnen hier angeschaut werden. Und bei den Klassikern
befindet sich wirklich vieles, was Rang und Namen hat. Beispiele gef&#228;llig?
&quot;Captured Dreams&quot;, &quot;Jesus&quot;, &quot;Red Sector Mega Demo&quot; (!!) und &quot;Amiga rules&quot;.
</P>
<u>Mags:</U><BR>
Hier ist (fast) g&#228;hnende Leere angesagt, was sich nat&#252;rlich daraus ergibt,
da&#223; auch die Amiga Szene in den letzten Monaten immer kleiner wurde.
Trotzdem ist das Mag &quot;Seenpoint&quot; (Nr.9) &#252;ber jeden qualitativen Zweifel
erhaben und wird f&#252;r Freunde der Demo Szene sicherlich einiges zu offerieren
haben.</P>

<u>Events:</U><BR>
Neben Petro`s Rede anl&#228;&#223;lich der &quot;Downunder&quot; gibt`s hier auch noch einen 6
min&#252;tigen Film zur HEW `99 (echt gut gemacht) sowie diverse Videos &#252;ber Annexx, die leider in
einer grauenhaften Qualit&#228;t vorliegen. Additional sind noch zahlreiche
Standbilder der HEW `99 zu finden, die Petra Struck (www.amiga-news.de) der
A+ zur Verf&#252;gung stellte, so da&#223; auch User, die nicht da waren, einen
Eindruck gewinnen k&#246;nnen, wie es dieses Jahr in K&#246;ln so war.</P>

<h3><B>Bereich Tools:</h3></B></P>
Oh mein Gott; hier alles noch zu erw&#228;hnen, was sich hier befindet ist nahezu
unm&#246;glich, denn Datenmengentechnsich ist dieser Ordner der Schwerpunkt
dieser Amiga Plus CD. Immerhin hat man sich die M&#252;he gemacht und alles in
verschiedene Ordner sortiert, so da&#223; man recht schnell findet was man sucht (siehe Screenshot).
Highlights dieser kunterbunten Mischung sind der &quot;Installer NG&quot;, die diversen OS 3.5
Programme, &quot;Voyager 3&quot; (funktionierende Demo des WWW Browsers), die
brandaktuellen Datatypes / Libs, &quot;Perfect Paint&quot; und f&#252;r Programmierer
&quot;Rebol 2.1&quot;. Sicherlich gibt`s hier noch viel weiteres an Software aber um
all diese Software aufzulisten, fehlt es mir momentan einfach an Zeit.
Stattdessen lege ich noch einen Screenshots bei, auf denen man sicherlich
auch noch den Blick auf den einen oder anderen Ordner werfen
kann.</P><CENTER><img src="aplus1.jpg"></CENTER></P><BR>

<h2><CENTER><FONT COLOR="BLUE">Fazit</FONT></CENTER></h2></P>
Man, so eine gelungene Amiga Plus CD hatte ich noch nie in der Hand. Neben
dem superaktuellen Inhalt kann auch dessen Zusammenstellung (nicht nur
Aminet Software) und Strukturierung gefallen. Hinzu kommt noch, da&#223; es auch
sonst noch weitere &#196;nderungen gab, die dem Gesamtbild der CD nur zutr&#228;glich
waren (Glow Icons, Begr&#252;&#223;ungsguide, Update System) und die CD somit einen
Quantensprung in die richtige Richtung machen lassen. Diese absolut positive
&#220;berraschung sollte von Euch nat&#252;rlich geb&#252;hrend honoriert werden, in dem
ihr die Ausagbe 1 / 2000 auch kauft - ich f&#252;r meinen Teil kann nur sagen: Es lohnt sich seit langem mal wieder, eine
A+ CD zu kaufen!</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
