

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Exodus: The Final War Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=silver alink=red>
<CENTER><h1><B>Exodus: The Final War - Preview</CENTER></h1></B></P><HR>
<CENTER><img src="exodus.jpg"></CENTER><BR>
<HR>
<FONT SIZE="+1">

Vor gar nicht alzu langer Zeit &#252;berschlugen sich auf dem Amiga Spielemarkt
die Ank&#252;ndigungen von neuen Echtzeitstrategiespielen und viele User freuten
sich schon darauf, denn die Jahre zuvor war in diesem Genre Totalflaute
angesagt. Aber wenn wir ehrlich sind, kam seit dem starken &quot;Napalm&quot; eben
nichts mehr wirklich &#252;berzeugendes in diesem Bereich (&quot;Moonbases&quot; war ja ein
versp&#228;teter Aprilscherz). Im Aminet ist jetzt endlich eine spielbare Demo zu
&quot;Exodus - The Last War&quot; erschienen und das Game verspricht, ein Kn&#252;ller zu
werden.</P>

Ich hab mir zuerst einmal die Demo angeschaut und war schon beim ersten
Start von der detaillierten und liebevoll gestalteten Grafik &#252;berw&#228;ltigt,
die sich nicht hinter der von &quot;Napalm&quot; verstecken braucht - und selbst
Kritiker von &quot;Napalm&quot; attestierten selbiger ein hohes grafisches Niveau. Auch
spieltechnisch orintiert sich &quot;Exodus&quot; an dem gro&#223;en Click Boom Vorbild: Die
Steuerung ist der aus Napalm ebenso &#228;hnlich wie die Aufteilung des Screens.
Napalm Spieler werden sich, und das garantiere ich, sehr schnell in &quot;Exodus&quot; zu recht finden. Neben der Grafik sind
aber f&#252;r ein Echtzeitstrategiegame noch andere Sachen wichtig. Im folgenden
will ich mal eine kleine Aufz&#228;hlung einiger Features auf Euch loslassen,
damit Ihr in etwa wisst, was Euch da erwartet:</P><ul>

<li> jeweils 32 Geb&#228;ude f&#252;r beide Parteien<BR>
<li> jeweils 32 Einheiten f&#252;r beide Parteien (bis zu 128, sollte der Rechner
 Ram-m&#228;&#223;ig gut ausgestattet sein) <BR>
<li> Auch Luft- und Wassereinheiten sind implementiert<BR>
<li> Multiplayer Option via Null Modem <BR>
<li> hohe k&#252;nstliche Intelligenz der Computergegner <BR>
<li> Interkative Umwelt / Umgebung (was auch immer das ist :-))<BR>
<li> AHI Unterst&#252;tzung<BR>
<li> Grafikkartenunterst&#252;tzung<BR>
<li> gute Geschwindigkeit</P></UL>

H&#246;rt sich doch schonmal ganz gut an, oder? Klar d&#252;rfte aber sein, da&#223; nur
halbwegs aktuelle Amiga Modelle in den Genuss dieses neuen RTS Games kommen
werden: Neben AGA / Grafikkarte ist als unterstes Minimum eine 030er CPU,
ein CD Rom Laufwerk und 16 MB zu veranschlagen. Empfohlen wird dringend ein
040er (der Code selber ist f&#252;r den 060er optimiert), 32 MB Ram und eine
gr&#246;&#223;z&#252;gig dimensonierte Festplatte. PPC Unterst&#252;tzung wird es in der ersten
Version nicht geben, aber sollten die Verk&#228;ufe von &quot;Exodus&quot; positiv
verlaufen, wird es auch eine aufgepeppte PPC Version geben.</P>

Spieltechnisch ist schon in der vorliegenden Demo Version alles im gr&#252;nen
Bereich, auch wenn die Sprachausgabe nach einiger Zeit etwas nervig wird -
aber das ist wohl mal wieder Anssichtssache. Fakt ist aber auch, da&#223; schon
jetzt eine Menge Spielspa&#223; aufkommt und es mich immer wieder wundert, was
noch alles in den alten AGA Chips drinsteckt, denn die Grafik ist, zumindest
im High Res Modus, absolut umwerfend.</P>

Der einzigste Nachteil, den ich bisher ausmachen konnte, liegt darin, daß
das Spiel bisher komplett in Polnisch vorliegt, womit viele User sicherlich
ihre Probleme haben werden. Lediglich ein Englisches Readme (mit einigen
Gramatikfehlern :-)) liegt dem Archiv noch bei. In diesem Punkt sollte noch
Abhilfe geschaffen werden, aber wofür gibt es schließlich die "ATO"?</P>

<h2><CENTER>Fazit</h2></CENTER></P><FONT SIZE=+1>
Ich bin ja normalerweise recht vorsichtig mit solchen Prognosen, aber im
Falle von &quot;Exodus - The Final War&quot; bin ich mir ziemlich sicher, da&#223; dort ein
Hit auf uns zukommt, der das Zeug hat &quot;Napalm&quot; von seinem Thron zu sto&#223;en
und endlich mal wieder Bewegung in das Genre der Echtzeitstrategiegames zu
bringen. Die Demo befindet sich u.a. im Aminet und auf der 1 / 2000 Ausgabe
der Amiga Plus und sollte von jedem mal gestartet werden - alleine schon um
zu sehen, zu was der Amiga auch heute noch in der Lage ist.</P></FONT> 
<PRE><CENTER>
<img src="kit.gif"></CENTER></P>

Name          : Exodus - The Final War<BR>

Publisher     : ???<BR>

Release       : Irgendwann 2000<BR>

Preis         : ??? (Full Price Game)<BR>

Anforderungen : AGA, 030 CPU, 16 MB Ram, HD und CD Laufwerk<BR>

Empfohlen     : GraKa, 040 CPU und 32 MB Ram</P><BR>
</PRE>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
