<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>f&uuml;r Kilian Servais</a></b></li>
<li><a href="#a2"><b>f&uuml;r Gerd Wolpert</a></b></li>
<li><a href="#a3"><b>f&uuml;r Henning Wolf Knopp</a></b></li>
</ul>
<br>
<table width=100% border=0 cellspacing=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Kilian</h3>
<p>Meine alten CD&acute;s verschenke ich alle generell (besonders wenn ich
sie doppelt habe), vielleicht kann der eine oder andere noch etwas damit
anfangen. Dein Lob bez&uuml;glich meines Engagements f&uuml;r die NoCover
geht wie Honig hinunter. Deswegen m&ouml;chte ich hier an dieser Stelle ein
paar erkl&auml;rende Worte darbringen. Wie du sicher auch siehst, haben
sich manche &quot;Schreiberlinge&quot; zur&uuml;ckgezogen. Das derzeitige Klientel
besteht zum gro&szlig;en Teil aus Sch&uuml;ler und wenn es Richtung Abitur
geht, bleibt die Freizeit auf der Strecke und so auch die Zeit f&uuml;r
Artikelschreiben. Also versuche ich mit m&ouml;glichst vielen
abwechslungsreichen Themen ein bisschen Farbe einzubringen. Mein
gro&szlig;es Handicapt besteht halt in meinem Alter. Mir fehlt leider
machmal das richtige H&auml;ndchen f&uuml;r die <b>richtige</b> Auswahl,
deswegen m&ouml;chte ich auch mit der Besprechung der Aminet-Reihe
aufh&ouml;ren. Das hei&szlig;t aber keinesfalls, dass ich mich ganz
zur&uuml;ckziehe. Ich mache weiter mit schreiben, auch wenn nicht alles
ankommt, bis, ja bis es aus allen Ecken erschallt: Aufh&ouml;ren,
aufh&ouml;ren. </p>

<p>NC-Guide und A+: ich habe da eigentlich keine neueren Begr&uuml;ndungen.
Aber ein verr&uuml;cktes Beispiel kann hier etwas Licht ins Dunkel bringen.
In einer Mercedes Verkaufsbrosch&uuml;re gibt es auch keinen detaillierten
Ersatzteilkatalog f&uuml;r ein Golf Armaturenbrett. Jeder w&uuml;rde sagen,
was soll dieser Schwachsinn hier? Nur deinen Satz mit dem
Schnellrumsprechen habe ich nicht verstanden. Wenn du meinst, dass es diese
NC-Guide gibt, dann kann ich dir sagen, dass die Geburtsstunde bei ca.
NoCover-35 liegt. Damals war sie aber nur f&uuml;r den reinen
Privatgebrauch vorgesehen und wies nur die technischen Artikel nach. Bei
ca. NC-44 habe ich sie erstmals als Amigaguide ver&ouml;ffentlicht, nachdem
ich sie ausgebaut hatte. Bei NC-49 hatte ich erstmals eine M&ouml;glichkeit
gefunden, MagneticPages Artikel durch kopieren ins RAM: aus der Guide
heraus anzeigen zu lassen. Eine effektivere Methode auszukl&uuml;geln hatte
sich durch das Umstellen auf HTML er&uuml;brigt und die Guide war schon im
neuen Outfit fertig, bevor NC-51 erschien. Durch das Anwachsen der
einzelnen Kapitel kommen auch die Unzul&auml;nglichkeiten immer mehr ans
Tageslicht, sodass ich im n&auml;chsten Jahr einen neueren Aufbau erstellen
werde. </p>

<p>Deine Frage zu meinem Scanner. Angefangen hatte ich 1991 mit einem
256-Graustufen Handyscanner an meinem 3000er. Als ich 1994 auf den 4000er
umstieg, holte ich mir den Epson GT-6500 f&uuml;r den Parallelport und ich
war froh, denn der nachtr&auml;gliche Umstieg des 4000er auf SCSI-II machte
ich sehr schnell wieder r&uuml;ckg&auml;ngig. Als Software hatte ich ADPro
2.5 und dies erf&uuml;llt auch heute noch seinen vollen Zweck, obwohl ich
auf das moderne ScanQuix umgestiegen bin, aber nur beim Scannen. Das
nachtr&auml;gliche Bearbeiten geht mit ADPro immer noch am leichtesten, ob
es ein Konvertieren ist oder ob ich eine andere Bildschirmaufl&ouml;sung
ben&ouml;tige oder ob ein anderes Gr&ouml;&szlig;enverh&auml;ltnis mit oder
ohne Verh&auml;ltnism&auml;&szlig;igkeit ben&ouml;tigt wird, ADPro macht es
sehr leicht und schnell. </p>

<p>Zu deinem neuen Outfit von Metalcorner m&ouml;chte ich dir gerne ein
paar Anregungen geben. Verstehe es bitte nicht als Kritik, sondern wirklich
nur als nicht abgeforderte Hilfe. <ol>
<li> Auf der Seite metalcorner.html gibst du gleich zu Beginn folgende
Zeile ein:<br> &lt;a name=&quot;top&quot;&gt;&lt;br&gt;<br>ein. </li>
<li> Auf allen anderen HTML-Seiten gibst du am Schluss<br> &lt;p&gt;&lt;a
href=&quot;metalcorner.html#top&quot;&gt;zur Startseite&lt;/a&gt;&lt;/p&gt;
<br> als Retourschalter zur Hauptseite ein. </li>
<li> Gew&ouml;hne dir bitte nicht die unsaubere Anwendung von Tags an. Bei
Verwendung der n&auml;chsten Generationen von Browsern kann dieses schnell
zu Fehlinterpretationen f&uuml;hren. </li></ol></p>

<p>Zum Schluss habe ich eine Frage. In deinem Leserbrief an mich gabst du
deine Mailinganschrift an und sagtest dazu, dass dies nicht der Anschluss
in der Schule w&auml;re. Nun habe ich dir im letzten Jahrtausend noch vier
Mails geschickt, die aber leider wohl im Nirwana verschwunden sind, denn es
kam keine Antwort. Oder gibt es da Gr&uuml;nde, die ich nicht kenne?

<p>Bis demn&auml;chst mal wieder, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Gerd</h3>
<p>Es schmerzt mich zu lesen, dass auch du meine S&auml;tze zu hart
interpretierst. Ich hatte doch nur gemeint, nicht nur von anderen zu
fordern, sondern selber zu &uuml;berlegen, ob man nicht das eine oder
andere auch dazu beisteuern k&ouml;nnte. Als Beispiel hatte ich hier die
verwaisten Rubriken ins Kalk&uuml;l gezogen. Aber ich verlange doch von
niemanden nur des Schreibens willen etwas zu schreiben. Da hast du mich
etwas missverstanden. </p>

<p>Bis demn&auml;chst mal wieder, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a3">Gr&uuml;&szlig; dich Henning</h3>
<p>Erst wollt ich auf dein Feedback bez&uuml;glich fxPAINT nicht antworten,
weil es so ausschauen k&ouml;nnte ich sei beleidigt. Du brauchst keine
Angst zu haben, ich bin es nicht, obwohl deine S&auml;tze etwas
h&ouml;hnisch klingen insbesonder bei Bewertung deiner letzten S&auml;tze.
Eines was ich aber in diesem Zusammenhang aber richtigstellen m&ouml;chte,
ist, dass ich nie einen Test schreiben wollte, sondern nur einen Eindruck
&uuml;ber das Programm abgeben wollte. Und das kann man auch unter
Hinzuziehung von Ausz&uuml;gen aus Readne&acute;s, besonders wenn dies
nicht (wie es so oft als Gegenteil geschieht) verschwiegen wird. Wenn ich
irgendwo etwas abschreibe, dann sage ich es auch. </p>

<p>Mein Grund weshalb ich schreibe ist das Angebot an dich, dir die CD
leihweise zu &uuml;berlassen, damit du einen sch&ouml;nen Workshop
erstellen kannst. Mir sagt man zu trockene Schreibweise nach, somit bin ich
f&uuml;r einen mit Emotionen geladenen Workshop der Falsche. Zwecks
Alternativbetrachtung und objektivem Vergleichen schicke ich auch gerne
XiPaint 4.0 und ArtEffect 2,5 mit. Und damit dir keine Unkosten f&uuml;r
R&uuml;ckporto entstehen, w&uuml;rde ich dir die notwendigen Briefmarken
beilegen. Nach erstem Ermessen ist es ein leichtes mindestens vier in sich
abgeschlossene Workshops zu schreiben. Nur ich bin in diesem Metier leider
nicht der Richtige. Melde dich per Mail und ich schicke dir die drei
CD&acute;s zu. F&uuml;r den ersten Teil h&auml;ttest du dann ca 6 Wochen
Zeit bis zur n&auml;chsten NoCover. Die CD&acute;s kannst du nach Abschluss
deiner Workshopreihe dann wieder retournieren. Da diese Programme auf mich
zugelassen sind, musst du sie abschlie&szlig;end wieder von deiner
Festplatte l&ouml;schen. </p>

<p>Eine Bitte h&auml;tte ich noch an dich. Lasse bitte die Anweisung
&lt;H3&gt; in deinen Texten weg. Die Schrift ist viel zu gro&szlig; oder du
f&auml;hrst deinen Browser mit einer viel zu kleinen Schrift. Gehe nach
Einstellungen/ Zeichens&auml;tze und schaue da nach, was du da stehen hast.
Als g&uuml;nstg hat sich erwiesen:<center>
<table border=0>
<tr><td>&lt;H1&gt; und bei</td><td> size=&quot;7&quot;</td><td> gleich times/36 </td></tr>
<tr><td>&lt;H2&gt; und bei</td><td> size=&quot;6&quot;</td><td> gleich times/30 </td></tr>
<tr><td>&lt;H3&gt; und bei</td><td> size=&quot;5&quot;</td><td> gleich times/24 </td></tr>
<tr><td>&lt;H4&gt; und bei</td><td> size=&quot;4&quot;</td><td> gleich times/18 </td></tr>
<tr><td>&lt;H5&gt; und bei</td><td> size=&quot;3&quot;</td><td> gleich times/15 </td></tr>
<tr><td>&lt;H6&gt; und bei</td><td> size=&quot;2&quot;</td><td> gleich times/13 </td></tr>
<tr><td>&#160;</td><td> size=&quot;1&quot;</td><td> gleich times/11 </td></tr>
<tr><td>&#160;</td><td> Sonstige</td><td> gleich courier/13 </td></tr>
</table></center>
<p>Bis demn&auml;chst mal wieder, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



