
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green>
<h1><CENTER><FONT COLOR="YELLOW">Leserbrief von Kilian "The Bruce"
Servais</FONT></h1></CENTER></P>

<a href="#benjamin.html">An Benjamin Herwig </A><BR>
<a href="#wolf.html">An Wolf Zimmer</A><Br>
<a href="#wolpert.html">An Gerd Wolpert</A><BR>
<a href="#sax.html">An Sax</A><BR>
<a href="#weber.html">An Thomas Weber</A><BR>
<a href="#mit.html">An Rainer Lüb. </A><BR>
<a href="#top.html">Meine Top 5</A></P>
<hr>
<a name="benjamin.html">
<b>An Benjamin:</B><BR>
Anmerkung: Diesen Brief hatte ich vor dem eintrudeln Deines Letters
geschrieben :-)))</P>
Sch&#246;n mal wieder was von Dir zu h&#246;ren; und dann gleich als Leserbrief in der
NC. Hoffe, da&#223; Du in Zukunft auch weiter was von Dir in der NC h&#246;ren lassen
wirst. Evtl. kannst Du dann ja noch Dein Feedback in Form Deiner
pers&#246;nlichen Top 5 (oder Top 10 :-)) mit reinbringen. Das ist f&#252;r die
weitere Entwicklung der NC wirklich wichtig.... </P>

Nun aber zu Deinem Letter: Das Dir die Metal Corner gef&#228;llt freut mich; so
habe ich immerhind as Gef&#252;hl, diese nicht nur f&#252;r mich und einige Leute der
4ever alleine zu machen. Selbiges gilt auch f&#252;r die HMG 4.0 an der ich z.Zt.
mit Hochdruck arbeite (immerhin sind jetzt noch Ferien...). Denke, da&#223; ich
diese bis Ende Januar fertig kriege. Klaro werden auch Bilder drin sein -
neben den diversen Logos auch noch einige kleinere Grafiken. Ich habe auch
schon dran gedacht, eine &quot;aufgepeppte&quot; Version der HMG 4.0 nur auf CD
herauszubringen, die dann s&#228;mtliche Plattencover enthalten w&#252;rde. Diese
m&#252;sste man f&#252;r 10 DM oder so (auf jeden Fall nicht mehr) bei
mir bestellen. Aber das wei&#223; ich jetzt noch nicht und zuerst m&#252;sste sowieso
das Interesse an einer solchen Version gekl&#228;rt werden. Ausserdem m&#252;sste ich
dann erstmal den Masterrohling fertig machen....</P>

Das mit den Rechtschreibfehlern war doch nur halb so schlimm - passiert
schlie&#223;lich jedem mal. Denn inhaltlich waren Deine Artikel wirklich gut. Und
ich kann ja in der Feedback Corner nicht nur positive Sachen reinschreiben -
ich glaube die negativen sind da wesentlich wichtiger. Mach trotzdem so
weiter, denn sooooo schlimm waren Deine Fehler nun auch wieder nicht :-)))
</P>
Das von Dir so hochgelobte Buch &quot;Otherland - Stadt der goldenen Schatten&quot;
werde ich mir bei Gelegenheit mal zulegen. Momentan habe ich zwar kein Geld
(wie eigentlich &#252;blich), aber demn&#228;chst kann ich f&#252;r einige Wochen bei
Hornbach Inventur machen, was dann mein Konto etwas aufstockt. Aber der
Januar wird ohnehin schon teuer genug - was da alles an CD`s rauskommt, ist
schon fast nicht mehr witzig. Man m&#252;sste halt Million&#228;r sein
:-)))</P>
<B>CUT</B></P>
Nun aber zu Deinem Brief, den ich mitlerweile wahrscheinlich schon per Post
beantwortet habe; deswegen nur kurz: Du brauchst Dich bei mir nicht
tausendmal entschuldigen, wenn Du Dir etwas Zeit mit dem Kram`s läßt. Ist
doch völlig in Ordnung - immerhin stecken wir alle mal im Stress. Mach Dir
darüber mal keinen Kopf. Alles weitere dann im Letter!</P>
Mach`s mal gut!</P>


<hr>
<a name="wolf.html">
<b>An Wolf Zimmer:</B><BR>
Erstmal danke f&#252;r Deinen sehr ausf&#252;hrlichen Brief an meine Addresse. W&#228;re
jetzt echt nicht fair, wenn ich darauf nicht eingehen w&#252;rde.... </P>

Wieso hast Du denn keine Lust mehr, die Aminet CD Tests zu machen? Ich
meine, so etwas ergibt sich doch nicht spontan, oder? Oder spielst Du gar
mit dem Gedanken, gar nichts mehr f&#252;r die NC zu schreiben? Sollte letzteres
der Fall sein, so bitte ich Dich inst&#228;ndig, als einer der letzten f&#228;higen
Redakteure, Deine Entscheidung nochmals zu &#252;berdenken. Die Wolf Info w&#252;rde
in der NC echt fehlen; genau wie die anderen allgemeinen Artikel aus Deiner
Feder. Kann ja auch sein, da&#223; ich da was falsch aufgefasst habe.</P>

Ich habe schon mit dem Gedanken gespielt, selber in Zukunft die Besprechung
der Aminet CD Reihe zu &#252;bernehmen, bin mir aber nicht sicher, ob ich einem 
solchen Stress gewachsen bin - immerhin m&#252;sste man sich ein System
&#252;berlegen, wie man die CD ausf&#252;hrlich testen kann - denn ein &quot;wischiwaschi&quot;
Test im Stile der ehemaligen Amiga Plus bringt sicherlich keinem was. Eine
&quot;Vorstellung&quot; im Stile, wie Du sie gemacht hast, w&#252;rde ich mir aber auch
noch zutrauen. Problem ist nur, da&#223; ich kein Abo der CD Reihe besitze und
somit erst alles mit dem Andreas kl&#228;ren m&#252;sste. Sollte sich also wirklich
niemand finden, werde ich dar&#252;ber nochmals nachdenken....</P>

Das sich jemand von unseren &quot;Karteileichen&quot; meldet, halte ich pers&#246;nlich f&#252;r
zweifelhaft. Mitlerweile werden viele schon seit Jahren keine NC mehr
gesehen haben und wahrscheinlich auch keinen Amiga mehr ihr eigen nennen.
Das einzigst sinnvolle w&#228;re wirklich, mal alle Members anzuschreiben (E-Mail), die
sich im vergangenen Jahr nicht zu Worte gemeldet haben. Das Problem bei der
ganzen Sache ist nur, wer diesen Aufwand freiwillig auf sich nehmen w&#252;rde.
Wenn ich einen eigenen Internet Zugang h&#228;tte, h&#228;tte ich soetwas schon l&#228;ngst
mal gemacht.... so bleibt es leider bei der Idee :-((( Und wenn wir ehrlich
sind, kann man davon ausgehen, daß von den 130 Mitgliedern in der Userliste
heutzutage max. noch 40 beim APC & TCP eingetragen sind. Da müsste der
Andreas mal echt für Ordnung sorgen!

</P>

Mein Messebericht war zu positiv? Komisch, ich habe nur versucht zu
erz&#228;hlen, was es neues gab. Nat&#252;rlich waren viel zu wenig Amiga User /
Aussteller da, aber die die da waren, haben das beste aus der Lage gemacht
und bewiesen, da&#223; der Amiga noch lange nicht tot ist - wenn die Leute das
als Optimismus auffassen umso besser. Ich jedenfalls werde dem Amiga, wenn
es n&#246;tig werden sollte, bis ins Grab folgen. Bis dahin dauert es aber
hoffentlich noch eine ganze Weile.</P>

Mit den besten Gr&#252;&#223;en, Bruce!</P>
<hr>
<a name="wolpert.html">
<b>An Gerd Wolpert:</B><BR>
Ah, der Pseudotausch ist endlich vorbei - wurde langsam etwas langweilige.
La&#223;t Euch beim n&#228;chsten Treffen ja was neues einfallen (vielleicht schaffe
ich es dieses Jahr auch :-))).</P>

Die HMG 4.0 wird in HTML erscheinen und hat mit der Amiga Guide Datei, bis
auf die Namen der Rubriken, nichts mehr gemeinsam, da ich alles komplett (!)
neu geschrieben habe und auch so stark umstrukturiert habe. La&#223; Dich mal
&#252;berraschen. Insofern k&#246;nntest Du ruhig nochmal einen Test f&#252;r die
&quot;Multimedia Corner&quot; schreiben.... </P>

Mal schauen, ob ich den Kram bis Ende Januar fertig bekomme. Es m&#252;ssen nur
(?)
noch zahlreiche CD Tests und ein bi&#223;chen Kleinkram erledigt werden. Aber
wenn es soweit ist, informiere ich Euch alle nat&#252;rlich sofort. Bezweifele
nur, da&#223; die neue HMG noch auf eine Diskette passen wird (gepackt). Wir
werden es sehen.... </P>

Oh, oh, es gibt bei den Browsern auch offline noch gewaltige Unterschiede.
Ich habe mir mal meine Metal Corner auf verschiedenen Systemen angeguckt und
ich muss sagen, da&#223; die Interpretation eines Internet Explorers doch
verdammt viel zu w&#252;nschen &#252;brig l&#228;&#223;t. Also darauf kann ich echt verzichten.
Und da jetzt gerade die neue Generation der Amiga Web Browser kommt (IBrowse
2.1, Voyager 3, vielleicht irgendwann mal AMozillaX...), ist man sicherlich
auch nicht auf die &quot;Gro&#223;en&quot; angewiesen. Immerhin tummeln sich auch
zahlreiche Amiganer im Netz der Netze - so schlimm k&#246;nnen die Amiga Browser
dann ja auch nicht sein.</P>

Zur K&#246;ln Messe: So schlecht war diese nun auch wieder nicht. Ich hatte auf
jeden Fall Spa&#223; in K&#246;ln, auch wenn ich pers&#246;nlich `98 einen Tick besser
fand. Na gut, News gab es vielleicht wirklich nicht so viele und
&#220;berraschungen blieben im gro&#223;en und ganzen auch aus. Trotzdem werde ich auf
der n&#228;chsten Amiga Messe (egal wo &amp; wann diese stattfinden sollte) auch
wieder pr&#228;sent sein. Vielleicht sieht man sich ja dort wieder??? Kommst Du
eigentlich dieses Jahr wieder zum Club Treffen?</P>

Mach`s erstmal gut!</P>
<hr>
<a name="sax.html">
<b>An Sax:</B><BR>
Erstmal mein Kompliment zu Deiner Art der &quot;Feedback Corner&quot; - auf so eine
Idee ist bis jetzt wohl noch keiner gekommen. War trotzdem echt gut...</P>

Nun aber konkret zu Deinem Feedback: Das Dir meine &quot;Game Previews&quot; gefallen
freut mich zu h&#246;ren. Normalerweise bist Du ja in dieser Hinsicht der
ungeschlagene Meister, aber solche Worte bauen auf jeden Fall auf (besonders
wenn man bedenkt, da&#223; ohnehin verdammt wenig Feedback kommt...). </P>

Was die Metal Corner betrifft: Yep, die CD`s kaufe ich mir alle selbst.
Daf&#252;r gehe ich in meiner Freizeit auch arbeiten. N&#228;chste Woche ist z.B.
Inventur bei Hornbach. Und wenn man das dann komplett durchzieht, hat man
sich ein h&#252;bsches kleines S&#252;mmchen verdient. Im Prinzip bin ich f&#252;r jeden
Job dankbar und deswegen w&#228;re es das gr&#246;&#223;te f&#252;r mich, wenn ich irgendwann
mal f&#252;r ein Amiga Magazin schreiben k&#246;nnte - aber das bleibt ja wohl eher
ein Traum. Noch praktischer w&#228;re nat&#252;rlich wenn ich Redaktuer bei einem
Metal mag w&#228;re: Kostenlose Promo CD`s testen und daf&#252;r auch noch Geld
bekommen.... </P>

Danke auch bezgl. Deines Komplimentes, da&#223; die Metal Corner &quot;Stil&quot; hat. Es
war von Anfang an mein Ziel auch mal eine andere Seite des Heavy Metals zu
zeigen, die nicht den typischen Klischees entspricht. Wenn mir das gelungen
ist, freut mich das umso mehr. Das ich bisher keine Death / Trash / Black
Metal CD`s getestet habe, liegt zum einen daran, da&#223; ich mich in dieser
Materie nicht so gut auskenne und zum anderen lege ich mir solche CD`s
&#252;berhaupt nicht zu. Aber vielleicht macht der &quot;Dark Evil&quot; in dieser Richtung
mal was :-))))</P>

Bis demn&#228;chst mal!</P>
<hr>
<a name="weber.html">
<b>An Thomas Weber:</B><BR>
Hey, Du willst doch wohl nicht im Ernst die Comics einstellen, oder?
Immerhin sind diese schon l&#228;nger Bestandteil der NC als einige Mitglieder.
Klar verstehe ich, da&#223; die Comics jede Menge Stre&#223; machen - vielleicht kann
man sich auf eine zwei monatliche Erscheinungsweise einigen? Dann h&#228;ttest Du
auf der einen Seite mehr Zeit f&#252;r andere Texte und die Comics w&#252;rden auf der
anderen Seite immer noch erscheinen. Ich f&#228;nde es auf jeden Fall traurig,
wenn die Comics in Zukunft gar kein Bestandteil der NC mehr
w&#228;ren....</P>

See ya!</P>

P.S.: Hoffe, da&#223; wenigstens Deine Ferien gut waren....</P>
<hr>
<a name="mit.html">
<b>An Rainer:</B><BR>
Öhm, könntest Du in der Mitgliederliste bitte beim A4000 OS 3.0 in OS 3.5
abändern? Das neue OS ist übrigens echt cool - kann ich jedem nur ans Herz
legen!</P>

Thanx und bis dann!</P>
<hr>
<a name="top.html">
<h2><CENTER><FONT COLOR="GREEN">Top 5</FONT></P></CENTER></h2>

1. Zeit von Wolf Zimmer<BR>
2. Lauf der Dinge von Mark Tom<BR>
3. Astro Corner von Lars Philipsen (auch wenn er einen PC benutzt)<BR>
4. Aminet 34 von Wolf Zimmer<BR>
5. Secret Of My Soul Tagebuch von Sax (schaut sehr gut aus...)</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
