<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Ciao,com</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>CIAO.COM</b></font></center></p>

<table border=0 cellspacing=3 cellpadding=3><tr><td>
<p>Dieser Tage bekam ich wieder einmal eine Mail, die man unter der Kategorie
"Werbung" laufen lassen kann.
 <blockquote><i>
  <p>
  From: &quot;Ciao.com AG&quot; &lt;team6@ciao.com&gt; <br>
  To: &quot;'wozim@t-online.de'&quot; &lt;wozim@t-online.de&gt; <br>
  Subject: -- Computerfreaks gesucht! --  <br>
  Date: Mon, 27 Dec 1999 14:17:51 -0000 </p>

  <p>Ciao Herr Zimmer,</p>

  <p>beim Surfen im Internet bin ich auf Ihre Seite gesto&szlig;en und habe mit
  gro&szlig;er Begeisterung festgestellt, da&szlig; Sie sich u.a. auch mit Computern
  besch&auml;ftigen. M&ouml;chten Sie sich gerne noch mehr Anregungen zu Ihrem
  Lieblingsthema holen und gleichzeitig auch andere Leute von Ihrem Wissen
  profitieren lassen? </p>

  <p>Bei ciao.com, dem neuen Marktplatz f&uuml;r Meinungen, haben Sie die
  M&ouml;glichkeit dazu. In der ciao-Community treffen sich Meinungsmacher und
  Trendsetter zum gegenseitigen Erfahrungsaustausch. </p>

  <p>Hier werden Sie jede Menge spannende Meinungen und Insidertipps zu
  Produkten, Dienstleistungen, Reisezielen und vieles mehr finden. </p>

  <p>Wir laden Sie herzlich ein, so bald wie m&ouml;glich ein paar Meinungen &uuml;ber
  Ihre pers&ouml;nlichen Erfahrungen und Erlebnisse bei uns zu schreiben:
  Empfehlen Sie z.B. ein bestimmtes Computermodell oder sagen Sie deutlich,
  wenn eine Graphikkarte nichts taugt. </p>

  <p>Sie k&ouml;nnen aber gerne auch &uuml;ber andere Themen schreiben wie z.B. Ihr
  Auto, Ihr Handy, Ihren letzten Strandurlaub, oder... </p>

  <p>Ja und das Mithelfen beim Aufbau unseres Meinungsmarktes lohnt sich
  auch: </p>

  <p>Jeder ciao-Besucher bekommt bei der Registrierung als Begr&uuml;&szlig;ungsgeschenk
  10 DM auf sein ciao-Konto &uuml;berwiesen! Alle von ciao.com vor dem 31.12.1999
  akzeptierten Meinungen werden mit 5 DM pro Meinung belohnt! </p>

  <p>Alle Meinungsmacher k&ouml;nnen zus&auml;tzlich trendige Sachpreise im Gesamtwert
  von 200.000 DM gewinnen! </p>

  <p>Die 5 aktivsten Meinungsmacher je Ressort werden mit coolen Preisen
  pr&auml;miert! Garantiert! </p>

  <p>Das und noch vieles mehr findet seit dem 15.11.1999 unter www.ciao.com
  statt. </p>

  <p>Herzliche Gr&uuml;&szlig;e und wir freuen uns schon auf Ihre Meinung! </p>

  <p>Ihre Agnes vom ciao.com Team </p></i>
 </blockquote>
Werbungen l&ouml;sche ich meist ohne zu lesen. Diese las ich aber durch und
schreibe sogar einen Artikel hier&uuml;ber. Eines sage ich aber im Voraus:
Ich versuche meine S&auml;tze sehr emotionslos und ohne jegliche Wertung zu
formulieren. Ob es mir gelingt? Ich kann es noch nicht versprechen. </p>

<p>Jeder hat die obige Mail gelesen und sich auch ein Bild gemacht. Aber
bei n&auml;herer Betrachtung ergeben sich doch eine Menge an Fragen. Gleich
der Einstieg klingt ja sehr wohlwollend und der Honig tropft nur so durch
die Zeilen. Aber h&auml;tten sie wirklich meine Homepage etwas gelesen,
dann h&auml;tten sie bestimmt auf mein Alter bezogen etwas weniger
pathetisch aufgetragen. Also besuchte ich die angegebene Web-site um mich
etwas schlauer zu machen und einen objektiveren Eindruck zu gewinnen. Zur
Anschauung habe ich die erste Seite kopiert und f&uuml;r unsere Belange ein
wenig ge&auml;ndert, in dem ich die gesamten Links herausgenommen habe.<br>
<a name="a1"><center>
<a href="onl_ciao1.html" target="_top">Homepage Startseite </a> </center><br>
Wenn nun pl&ouml;tzlich der linke Frame weg ist, wurde die Link-Anweisung
benutzt und nun muss am Ende des Artikels der Link zur NoCover genutzt
werden, um den linken Frame wieder zu aktivieren. Das war aber jetzt nur am
Rande. Nat&uuml;rlich habe ich auch gleich in der Rubrik Computer
nachgeschaut, welche Systeme besprochen werden und nach dem Anklicken von
PC erscheint folgende Tabelle (eingebunden in einer ganzen Seite mit vielen
anderen Links und Reklamen)
<table border=1>
<tr><td align=right>Neues Mitglied werden | Anmelden | Hilfe </td></tr>
<tr><td align=center>
Home &gt; Computer &gt; PCs/Komplettsysteme </td></tr>
<tr><td>
Herzlich Willkommen<br>
Sind Sie Insider, Trendsetter, Freak oder auch nur Hobbyexperte auf diesem
Gebiet? <br><br>
Dann helfen Sie anderen mit Ihren pers&ouml;nlichen Tipps und schreiben Sie
eine Meinung! <br><br>
Wir suchen Kategorie-Manager!
</td></tr>
<tr><td>
Sie vermissen etwas?<br>
Sie finden z.B. eine Kategorie nicht, in der Sie &uuml;ber ein Produkt eine
Meinung schreiben wollen? Schicken Sie uns eine E-Mail mit Ihren Ideen,
Anregungen, Vorschl&auml;gen, W&uuml;nschen, ... </td></tr>
<tr><td align=center>PCs/Komplettsysteme</td></tr>
<tr><td align=center>
     <table border=2 width=60%>
      <tr><td>Acer </td><td>Gateway </td><td>Syncron </td></tr>
      <tr><td>Apple </td><td>Hewlett-Packard </td><td>Toshiba </td></tr>
      <tr><td>Cobbit </td><td>Hocom </td><td>Vobis </td></tr>
      <tr><td>Compaq </td><td>IBM </td><td>Waibel </td></tr>
      <tr><td>Comtech </td><td>Maxdata </td><td>Wortmann </td></tr>
      <tr><td>Dell </td><td>Peacock </td><td> </td></tr>
      <tr><td>Fujitsu </td><td>Siemens </td><td> </td></tr>
      <tr><td colspan=3 align=right>Neue Themen</td></tr>
     </table
<tr><td>Meinungen</td></tr>
<tr><td>
Ein paar Hinweise f&uuml;r Computer-Neulinge <br>
sehr hilfreich <br>
Eine Meinung zu "Apple - iMac" von jati - 23.12.1999 <br>
Produktbewertung:<br>
Jetzt mal ganz ohne Fach-Chinesisch und ganz n&uuml;chtern betrachtet ein paar
Vor- und Nachteile des Apple iMac. Ein Punkt an diesem Rechner ist sowohl
ein Vor- als auch ein Nachteil, und an diesem Pun...
<br><br><br>

Gutes Preis- Leistungsverh&auml;ltnis<br>
sehr hilfreich <br>
Eine Meinung zu "Compaq - Presario 5511" von dim - 16.12.1999<br>
Produktbewertung:<br>
Eines sei gleich vorweg gesagt: wer sich einen Komplett PC f&uuml;r um die
2000DM kauft, und meint, sich hier dann dar&uuml;ber auslassen zu
m&uuml;ssen, dass nicht die gleiche Ausstattung wie bei einem wesentlich
t...
<br><br><br>

Computerkauf bei Gateway? <br>
sehr hilfreich<br>
Eine Meinung zu "Gateway - GP6-400C" von Albi - 29.11.1999 <br>
Produktbewertung:<br>
Besonders beim Kauf des ersten Computers stellt sich oft die Frage, bei wem
man nun das langersehnte Ger&auml;t erwerben soll. Die Vielzahl der
Anbieter und Angebote macht die Entscheidung auch nicht gera...
<tr><td align=center>
Hilfe | &Uuml;ber uns | Presse | Jobs | AGBs | Kontakt<br>
Copyright © 1999 by ciao.com AG
</td></tr></table>

<p> So das war nat&uuml;rlich nur ein textlicher Auszug aus dieser Seite
und da ich nichts &uuml;ber Amiga gesehen habe, habe ich einmal <b>Amiga
</b> als Suchbegriff eingegeben und bekam nur einen einzigen Hinweis: </p>

<p> Keine Amiga-Zeiten mehr!<br> eine Meinung zu: Red Orb - Prince of
Persia 3D<br> von TOPU (31.12.1999) </p>

<table border=0>
<tr><td colspan=2>Produktbewertung: </td></tr>
<tr><td>Vorteile: </td><td>Grafik, Atmosph&auml;re </td></tr>
<tr><td>Nachteile: </td><td>Steuerung, teilweise langweilig (keine Herausforderung) 
</td></tr></table>

<p> Prince of Persia 3d ist ein hoffnungsvoller Titel auf einen Nachfolger
aus meinen alten Amiga-Zeiten. Also hab ich es mir gekauft. Leider bin ich
ein wenig ent&auml;uscht. Man hat zwar eine gute, schnelle, saubere Grafik
Engine und das ganze l&auml;uft problemlos nach der Installation, aber
irgendwie kann ich den Reiz bzw. Charme vom Original Prince of Persia nicht
entdecken. Es schein mir eher ein Standard 3d jump and run geworden zu
sein. Aber gerade der Spielwitz von P o P war es, was das Spiel ausgemacht
hat! Das Spiel ist zwar nicht schlecht und wer gerne dreidimensional
Abenteuer erlebt ist mit p o p 3d nicht schlecht beraten, aber den Funken
Spielwitz vom Original wird man vermissen. Leider kann ich keine
Beurteilung zur Entwicklung der Serie abgeben, da ich Prince of Persia 2
nicht gespielt habe. Vielleicht hat ja die Entwicklung es zu dem gebracht,
was es heute ist. Auf jeden Fall w&uuml;rde ich es nicht empfehlen, Prince
of Persia 3d der alten Zeiten wegen zu kaufen! </p>

<table border=0>
<tr><td>Bezahlter Preis: </td><td>89 DM </td></tr>
<tr><td>Betriebssystem des Computers: </td><td>Windows 98 </td></tr>
<tr><td>Schwierigkeitsgrad: </td><td>Einsteiger</td></tr>
<tr><td>Grafik: </td><td>gut </td></tr>
<tr><td>Soundqualit&auml;t: </td><td>mittelm&auml;&szlig;ig </td></tr>
<tr><td>Bedienung: </td><td>mittelm&auml;&szlig;ig </td></tr>
<tr><td>Spieltiefe: </td><td>mittelm&auml;&szlig;ig </td></tr>
<tr><td>Multiplayerfunktion: </td><td>keine Angabe </td></tr>
<tr><td>Anleitung: </td><td>gut </td></tr>
<tr><td>Langzeitspielspass: </td><td>mittelm&auml;&szlig;ig </td></tr>
<tr><td>Altersgruppe: </td><td>ab 16 Jahren </td></tr>
<tr><td colspan=2>Weiterempfehlung an ein(e) Freund(in)? Nein
</td></tr></table>

<p>Das war ja wirklich nicht &uuml;berragend, was ich nun gefunden habe.
Ich k&ouml;nnte mir nun gut vorstellen, dass sich nun so mancher irgendwie
berufen f&uuml;hlt, das Image des Amiga wieder etwas aufzupolieren, z.B.
durch Bekanntgabe von Erfahrungen mit PPC und was wei&szlig; ich noch
alles. </p>

<p>Eines kommt mir etwas spanisch vor, genau genommen sehr spanisch. Das
ist das Versprechen echt "Kohle" machen zu k&ouml;nnen. Wer verteilt hier
wessen Geld zu welchen Konditionen? &Uuml;berall gibt es eine
Schaltfl&auml;che, wo man Mitglied werden kann. Ist die Mitgliedschaft
wirklich kostenfrei? Oder hat hier wieder jemand eine M&ouml;glichkeit
entdeckt, auf Kosten Gutgl&auml;ubiger gut leben zu wollen? Fragen, denen
ich nicht nachgegangen bin, aber bevor ich mich binden w&uuml;rde,
w&uuml;rde ich hier verflixt genau hinschauen. Denn zu verschenken hat
keiner etwas. </p>

</td></tr></table>
<a href="NoCover.html" target="_top">Zur&uuml;ck</a> zur NoCover (wenn der linke Frame weg ist).
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



