<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Lars Philipsen">
   <meta name="GENERATOR" content="Mozilla/4.6 [de]C-CCK-MCD QXW0321u  (Win98; I) [Netscape]">
   <meta name="Description" content="Quelle: bild der wissenschaft">
   <title>Astro-Corner 11 (Zweite Ausgabe Januar)</title>
</head>
<body background="rock012.jpg">
&nbsp;
<center>
<br><img SRC="ac_titel.jpg" ALT="Astro-Corner 11" BORDER=2 height=59 width=402><font size=+1>11</font>
<br><i><font size=+1>Zweite Januar-Ausgabe 2000</font></i></center>

<p><u>Hallo NoCover-Leser!</u><u></u>
<p>Nur wenige Wochen sind diesmal vergangen und eine neue Ausgabe der Astro-Corner
ist erschienen. Obwohl diesmal die Zeit zwischen dem Erscheinen der letzten
NoCover und dieser hier sehr kurz war, gibt es trotzdem wieder Neues aus
der Astronomie zu berichten.
<br>Hinsichtlich der aktuellen Ereignisse im AMIGA-Markt relativiert sich
mein Editorial der letzten Astro-Corner nat&uuml;rlich etwas. Ich hoffe,
keiner von euch hat meine Ausf&uuml;hrungen vom letzten Mal in den falschen
Hals bekommen. Ich bleibe nach wie vor dem AMIGA treu, auch wenn ich zwischenzeitlich
kein aktiver User war.
<br>Mal sehen, was da jetzt noch alles auf uns zu kommt...
<p>Los gehts aber nun mit der aktuellen Ausgabe der Astro-Corner, aber
diesmal ohne Inhaltsverzeichnis:
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Blaugr&uuml;ner Planet au&szlig;erhalb des Sonnensystems entdeckt</b>
<p>(Meldung vom 16.12.1999)
<p>Andrew Cameron von der University of St. Andrews in Schottland und Kollegen
ist es gelungen, das Licht eines Planeten einzufangen, der den Stern tau-Bo&ouml;tis
umkreist. Bislang haben Astronomen extrasolare Planeten lediglich durch
die Anziehungskraft ausmachen k&ouml;nnen, die sie auf ihre Sonne aus&uuml;ben,
aber nicht durch ihr Licht.
<p>Der Planet von tau-Bo&ouml;tis umkreist seinen Stern alle 3,3 Tage in
einem 20 Mal geringeren Abstand als der zwischen Erde und Sonne. Wegen
dieser hohen Geschwindigkeit hofften die Forscher ein Signal von dem Planeten
einfangen zu k&ouml;nnen, der vermutlich etwa ein Zehntausendstel des Lichtes
von tau-Bo&ouml;tis reflektiert. Tats&auml;chlich entdeckten die Forscher
die Rotverschiebung, nach der sie suchten. Die Daten zeigen, dass der Planet
acht Mal schwerer und 1,6 bis 1,8 Mal gr&ouml;sser als Jupiter ist. Seine
Farbe ist blaugr&uuml;n.
<p>Bei den anderen bisher gefundenen extrasolaren Planeten konnten die
Wissenschaftler keine Angaben &uuml;ber Masse oder Farbe machen, weil die
Planeten nicht direkt beobachtet werden konnten. Allerdings, so kommentieren
Adam Burrows und Roger Angel von der University of Arizona in Tucson, besteht
eine Chance von 1:20, dass das scheinbare Planetensignal nur ein Rauschen
in den Daten ist. Das Licht des Sterns und des Planeten sind selbst vom
Hubble-Teleskop nicht zu trennen, da die beiden so nah beieinander stehen.
<p>Vor einigen Wochen meldeten franz&ouml;sische Wissenschaftler, dass
sie mit optischen Methoden ebenfalls einen Planeten au&szlig;erhalb des
Sonnensystems identifiziert hatten: Der Himmelsk&ouml;rper schiebt sich
zwischen seinen Stern und die Erde und schw&auml;cht dessen Licht um zwei
Prozent ab.
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Kohlenstoff schon kurz nach dem Urknall?</b>
<p>(Meldung vom 16.12.1999)
<p>Entstand schon kurz nach dem Urknall Kohlenstoff? Karsten Jedamzik vom
Max-Planck-Institut in Garching vermutet au&szlig;er den leichten Elementen
Wasserstoff, Helium und Lithium auch schwerere Elemente wie Kohlenstoff
im Stoffgemisch des jungen Alls.
<p>Die klassische Theorie des Urknalls besagt, dass sich in der Fr&uuml;hzeit
einige Hundert Sekunden nach dem gro&szlig;en Knall aus Quarks Kerne von
Wasserstoff, Helium und Lithium bildeten. Danach war der riesige Feuerball
nicht mehr heiss genug, um schwerere Elemente zu bilden. Laut dieser Theorie
bildete sich zum Beispiel Kohlenstoff erst in den Kernen der Sterne.
<p>Seit etwa zehn Jahren meinen Wissenschaftler, dass schwere Elemente
sich aus sogenannten Baryonen - Quarktrios - gebildet haben k&ouml;nnten.
Das Universum m&uuml;sse nicht homogen gewesen sein, sondern Klumpen von
Baryonen k&ouml;nnten dort herumgeschwirrt sein. In den Klumpen w&uuml;rden
Nuklearreaktionen schneller laufen, so dass schwerere Elemente vor der
Abk&uuml;hlung entstanden sein k&ouml;nnten. Diese Vorstellung hatte allerdings
einen Haken: Der Feuerball des jungen Universums h&auml;tte demnach viel
mehr Lithium-7 produziert, als wir heute vorfinden.
<p>Dieses Problem hat Jedamzik nun gel&ouml;st. Er und seine Kollegen haben
gezeigt, dass kleinste Partikel - Neutrinos - die Baryonenklumpen angeheizt
haben k&ouml;nnten. Dadurch w&uuml;rden sich die Klumpen ausdehnen und
die Produktion schwerer Elemente auf der richtigen Stufe halten. „Die Region
wird gr&ouml;&szlig;er, weniger Baryonen kommen pro Raumeinheit vor und
wenn die Expansion einen gewissen Wert erreicht hat, h&ouml;rt der Prozess
von alleine auf," sagt Jedamzik. Dadurch w&uuml;rden einige Elemente wie
Kohlenstoff zusammen mit den gemessenen Mengen an Lithium-7 &uuml;brigbleiben.
<p>Jedamzik kann nicht erkl&auml;ren, warum sich die Baryonenklumpen geformt
haben sollen. Der &Uuml;bergang von freien Quarks zu Partikeln k&ouml;nnte
daf&uuml;r verantwortlich sein. Diese Idee k&ouml;nnte erkl&auml;ren, wieso
das Gas zwischen den Galaxien mehr schwere Elemente zu enthalten scheint,
als es nach der klassischen Urknall-Theorie sein sollten. „Astronomen haben
bisher nicht das erste, schwere-Elemente-freie Material gefunden, dass
es nach dem Urknall geben m&uuml;sste," gibt Leo Blitz, Astrophysiker von
der University of California in Berkeley, zu bedenken.
<p>Aber es gibt auch kritische Stimmen. Keith Olive, Kosmologe an der University
von Minnesota, meint, dass die Theorie best&auml;tigt werden k&ouml;nne,
falls Astronomen junge Sterne f&auml;nden, die sich aus diesem fr&uuml;hen
Gas gebildet haben. Au&szlig;erdem „wird es immer schwierig bleiben, zu
beweisen, dass es keine Sterne gibt, die sich ohne schwerere Elemente gebildet
haben," meint er. Dass es Widerspr&uuml;che gegen seine Theorie geben kann,
ist auch Jedamzik klar: „Die Fr&uuml;chte m&ouml;gen nicht am Baum h&auml;ngen,
aber wenn sie es tun, sind sie sehr gro&szlig;."
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Der Strahlungsdruck der Sonne fegt Staubpartikel weg</b>
<p>(Meldung vom 17.12.1999)
<p>Der Strahlungsdruck der Sonne verh&auml;lt sich wie ein spezifischer
Besen, der einen Bereich von der Sonne bis hinter dem Planeten Mars von
galaktischen Staubteilchen einer bestimmten Gr&ouml;&szlig;e befreit. Das
berichtet Markus Landgraf vom European Space Operations Center (Esoc) in
Darmstadt im Fachblatt Science.
<p>Landgraf wertete die Daten des besonders empfindlichen Staubdetektors
der Raumsonde Ulysses aus, die sich auf einer elliptischen Bahn um die
Sonne befindet. Galaktische Staubteilchen sind sehr klein - etwa vier zehntausendstel
Millimeter im Durchmesser - und relativ selten: In einem Kubikkilometer
befinden sich nur etwa zehn dieser Staubpartikel. Ulysses registriert ein
bis zwei dieser Einwanderer in unser Sonnensystem pro Woche. Landgraf und
seine Kollegen waren &uuml;berrascht, als sie feststellten, dass Partikel
einer bestimmten Gr&ouml;&szlig;e nicht n&auml;her als vier Astronomische
Einheiten an die Sonne herankamen. Eine Astronomische Einheit (AE) ist
die Entfernung der Erde zur Sonne. Diese Beobachtung erkl&auml;rt Landgraf
so: Wenn ein Staubteilchen mit einem Photon von der Sonne zusammenst&ouml;&szlig;t,
wird es abgebremst. Die kleinen Staubteilchen absorbieren das Sonnenlicht
besonders gut - so gut, dass sie zum Stillstand kommen und schlie&szlig;lich
umkehren. Dieser Strahlungsdruck der Sonne muss innerhalb von vier AE um
40 bis 80 Prozent gr&ouml;&szlig;er sein als die Gravitationskraft der
Sonne, berechnete Landgraf. Die weggetriebenen galaktischen Staubpartikel
– wahrscheinlich die Materie, aus der sich Planeten und neue Sonnen bilden
- setzen sich offenbar aus Silikaten, Magnetit- und Graphitteilchen zusammen.
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Sonnenaktivit&auml;t n&auml;hert sich dem Maximum</b>
<p>(Meldung vom 20.12.1999)
<p>Irgendwann in der Mitte oder gegen Ende des n&auml;chsten Jahres wird
die Sonne den H&ouml;hepunkt ihres derzeitigen Zyklus erreichen - m&ouml;glicherweise
begleitet von Polarlichtern in niedrigen Breiten, Stromausf&auml;llen und
St&ouml;rungen einiger Satelliten. Das glaubt zumindest David Hathaway,
Sonnenphysiker vom Marshall Space Flight Center der Nasa. Seinen Berechnungen
zufolge, die er im Journal of Geophysical Research (1. Oktober 1999) und
auf der Tagung der American Geophysical Union pr&auml;sentierte, ist die
Sonne im gegenw&auml;rtigen Zyklus aktiver als im Durchschnitt, aber nicht
rekordverd&auml;chtig. Das l&auml;sst vermuten, dass der H&ouml;hepunkt
noch bevorsteht. "Gro&szlig;e Zyklen haben ein fr&uuml;hes Maximum, kleine
ein sp&auml;teres", sagte Hathaway. Andere Wissenschaftler glauben, dass
das Sonnenfleckenmaximum schon vorbei ist. Dagegen spricht, dass sich das
Magnetfeld der Sonne noch nicht umgekehrt hat und dass die Sonnenflecken,
die in hohen Breiten entstehen und dann zum &Auml;quator wandern, es noch
nicht bis dorthin geschafft haben. Hathaway und seine Kollegen arbeiten
daran, heftige Explosionen auf der Sonne vorherzusagen, deren Auswirkungen
noch auf der Erde zu sp&uuml;ren sein k&ouml;nnen: So erreichte im Winter
1989, beim letzten solaren Maximum, eine besonders heftige Explosion die
Erde. Im kanadischen Quebec brach die Stromversorgung zusammen, einige
Satelliten fielen aus.
<p>Sonst haben die "koronaren Massenausbr&uuml;che" aber keine Auswirkungen
auf des Leben auf der Erde. In letzter Zeit mehren sich allerdings die
Anzeichen, dass die Zahl der Sonnenflecken mit dem Klima auf der Erde zusammenh&auml;ngt:
So wurden von 1645 bis 1715 &uuml;berhaupt keine Sonnenflecken beobachtet
- gerade w&auml;hrend der sogenannten "Kleinen Eiszeit", die Europa bis
Ende des 19. Jahrhunderts frostige Winter bescherte. Aus astronomischen
Beobachtungen l&auml;sst sich schlie&szlig;en, dass andere Sterne &auml;hnliche
Zyklen durchlaufen wie die Sonne. "Manche Sterne haben gar keine Zyklen,
andere &auml;hneln der Sonne, und einige sind v&ouml;llig chaotisch", sagte
Hathaway. "Vermutlich hat die Sonne auch hyperaktive Phasen. Noch sind
wir aber nicht so weit, Ver&auml;nderungen im Sonnenfleckenzyklus vorherzusagen."
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Lava-Font&auml;nen auf Io</b>
<p>(Meldung vom 21.12.1999)
<p>Bei ihrem letzten Vorbeiflug am Jupitermond Io am 25. November hat die
Raumsonde Galileo eine spektakul&auml;re Lavafont&auml;ne fotografiert,
die mehr als 1600 Meter hoch war. Die Nasa pr&auml;sentierte die Fotos
auf der Tagung der American Geophysical Union in San Francisco. "Endlich
ist es uns gelungen, einen gr&ouml;&szlig;eren Vulkanausbruch auf Io zu
erwischen", freute sich Torrence Johnson vom Jet Propulsion Laboratory
der Nasa. "Die Lava war so heiss und hell, dass Teile des Bildes &uuml;berbelichtet
sind." Die Font&auml;ne war gro&szlig; genug, um von einem Infrarot-Teleskop
auf dem Mauna Kea auf Hawaii aufgenommen zu werden. Beide Aufnahmen zusammen
werden es erstmals erm&ouml;glichen, die Temperatur der extrem heissen
Lava auf Io zu bestimmen. Auf der Tagung wurden ausserdem neue Ergebnisse
&uuml;ber Loki, einen der gr&ouml;&szlig;ten Vulkane auf Io, pr&auml;sentiert.
Offenbar begann Loki im September mit seiner Aktivit&auml;t, wobei die
freigesetzte W&auml;rme stark schwankte.
<p>Als Galileo im Oktober zum ersten Mal an Io vorbeiflog, war die Eruption
gerade in vollem Gange. Galileo entdeckte ein relativ eng begrenztes Gebiet
in der 193 Kilometer gro&szlig;en Caldera (ein Einbruchskrater), das sehr
viel heisser war als der Rest. Wahrscheinlich begann dort die Eruption.
Sp&auml;ter verteilte sich die Lava &uuml;ber den Rest der Caldera. Einige
Bilder von den Vorbeifl&uuml;gen hatten die Nasa-Wissenschaftler schon
fast verloren gegeben: Die starke Strahlung in der N&auml;he des Mondes
hatte einige Daten zerst&ouml;rt. Doch gelang es Ingenieuren vom Jet Propulsion
Laboratory, die Bilder mit Hilfe intelligenter Software wiederherzustellen.
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Weisse Zwerge in Kugelsternhaufen unter die Lupe genommen</b>
<p>(Meldung vom 21.12.1999)
<p>Mit Hilfe des Riesenteleskops VLT (Very Large Telescope) an der Europ&auml;ischen
S&uuml;dsternwarte in Chile ist es einer Gruppe von Astronomen erstmals
gelungen, das Spektrum mehrerer sogenannter "Weisser Zwerge" im Kugelsternhaufen
NGC 6397 zu messen. Weisse Zwerge sind ausgebrannte Reste von Sternen mit
der Masse der Sonne, die aber nur noch so gro&szlig; sind wie die Erde.
Dank des Spektrums konnte nun die Masse der Sterne bestimmt werden und
damit ihre Entfernung. Einer der vier Weissen Zwerge ist nur 0,35 Sonnenmassen
schwer, die anderen haben jeweils 0,5 Sonnenmassen. F&uuml;r Weisse Zwerge
in der N&auml;he der Erde ist eine Masse von 0,55 bis 0,65 Sonnenmassen
typisch. Die Oberfl&auml;chentemperatur eines der Sterne wurde auf 18.000
Grad Celsius bestimmt - das ist dreimal soviel wie bei der Sonne. Weisse
Zwerge k&ouml;nnen jedoch bis zu 100.000 Grad heiss sein. Die Weissen Zwerge
sind deswegen besonders interessant, weil sich &uuml;ber sie die Entfernung
des Kugelsternhaufens feststellen l&auml;sst. Kugelsternhaufen, von denen
&uuml;ber hundert zur Milchstra&szlig;e geh&ouml;ren, sind vermutlich die
&auml;ltesten Objekte unserer Galaxie. Ihr Alter, das mit ihrer Entfernung
zusammenh&auml;ngt, k&ouml;nnte Aufschl&uuml;sse &uuml;ber das Alter des
Universums geben. Die vier Sterne wurden erstmals mit dem Weltraumteleskop
Hubble beobachtet. Doch f&uuml;r genauere Beobachtungen war ein noch empfindlicheres
Instrument n&ouml;tig. Doch selbst die im Fr&uuml;hjahr in Betrieb gegangene
erste Einheit des Riesenteleskops VLT musste noch 90 Minuten auf die fragliche
Stelle im Sternbild Ara gerichtet werden, um die vier sehr lichtschwachen
Zwerge aufzunehmen.
<p>
<hr WIDTH="100%">
<p><i>Astronomie allg.:</i>
<br><b>Planeten-Suchtechnik best&auml;tigt</b>
<p>(Meldung vom 23.12.1999)
<p>Die Existenz eines Planeten im Sternbild Pegasus, den Nasa-Wissenschaftler
Anfang November nachweisen konnten, weil er seinen sonnen&auml;hnlichen
Mutterstern einmal pro Umlauf teilweise verdeckt, konnte jetzt durch eine
zweite Technik best&auml;tigt werden. Mit der "Transit-Fotometrie" konnten
die Wissenschaftler um David Charbonneau vom Ames Research Center der Nasa
belegen, dass der gefundene Planet etwa 1,3 mal so gro&szlig; ist wie Jupiter
und seine Sonne alle 3 1/2 Tage einmal umkreist. Dabei nutzten die Forscher
die Tatsache, dass sich der Planet einmal pro Umlauf zwischen seine Sonne
und die Erde schiebt und das Licht der Sonne dabei verdunkelt. Bei der
zweiten Methode wird die Doppler-Verschiebung des Spektrums des Sterns
gemessen. Da sich Stern und Planet um einen gemeinsamen Schwerpunkt bewegen,
scheint der Stern leicht hin- und her zu tanzen. Aus diesem Wackeln l&auml;sst
sich die Masse des Planeten erschlie&szlig;en. "Offenbar ist die Atmosph&auml;re
des Planeten durch seine N&auml;he zum Stern aufgeblasen", sagte Chef-Wissenschaftler
William Borucki vom Ames Research Center. "Der Planet hat nur etwa zwei
F&uuml;nftel der Dichte von Wasser, er ist viel weniger dicht als etwa
Saturn." Mit der Fotometrie-Technik wollen die Forscher ab 2004 mit einem
Weltraum-Teleskop auch Planeten von der Gr&ouml;&szlig;e der Erde aufsp&uuml;ren.
Die Atmosph&auml;re der Erde verzerrt das Licht der Sterne, so dass bislang
nur Riesenplaneten von der Gr&ouml;&szlig;e Jupiters entdeckt werden konnten.
<p>
<hr WIDTH="100%">
<p><i>Astrophysik:</i>
<br><b>Chandra-Bilder geben Auskunft &uuml;ber die Entstehung schwerer
Elemente</b>
<p>(Meldung vom 23.12.1999)
<p>Das Chandra R&ouml;ntgenobservatorium der NASA hat Daten geliefert,
mit denen John Hughes und Kollegen von der Rutgers University in Piscataway
neue Entdeckungen zur Entstehung von Silizium, Eisen und anderen Elementen
aus Supernovaexplosionen gemacht hat. Im R&ouml;ntgenbild von Cassiopeia
A (Cas A), dem &Uuml;berbleibsel eines explodierten Sterns, finden sich
Spuren von Silizium, Schwefel und Eisen. Diese Stoffe sollen nach der Theorie
im Inneren des Sterns entstehen. Hughes hat seine Ergebnisse in den Astrophysical
Resarch Letters ver&ouml;ffentlicht.
<p>Die theoretischen Grundlagen f&uuml;r die neuen Entdeckungen h&auml;lt
Hughes f&uuml;r eine der gr&ouml;&szlig;ten Entdeckungen der Astronomie
des 20. Jahrhunderts. Dabei handelt es sich um die Erkenntnis, dass fast
alle Elemente au&szlig;er Wasserstoff und Helium in Sternen entstehen.
„In ihrer Lebenszeit sind die Sterne Fabriken, die das einfachste Element
– Wasserstoff – nehmen und daraus schwerere machen,“ sagt er. Nachdem aller
Wasserstoff im Inneren aufgebraucht sei, entwickelten sich die Sterne rasch,
bis sie keinen „Treibstoff“ mehr h&auml;tten und anfingen zu kollabieren,
erkl&auml;rt Hughes: „In Sternen, die zehnmal so schwer wie unsere Sonne
sind, kann der zentrale Teil des zusammenfallenden Sterns einen Neutronenstern
oder ein Schwarzes Loch bilden, w&auml;hrend der Rest des Sterns in einer
riesigen Supernova-Explosion weggesprengt wird.“ Supernovae sind allerdings
selten, sie kommen nur etwa alle 50 Jahre in einer Galaxie wie der unsrigen
vor.
<p>Chandras Bilder von den Resten einer solchen Supernova, n&auml;mlich
Cas A, &uuml;berraschten Hughes vor allem durch die Sch&auml;rfe und den
Detailreichtum: „Als ich die Bilder das erste Mal sah, war ich beeindruckt.“
<p>Chandra bietet bei der Beobachtung von Cas A neue M&ouml;glichkeiten.
So konnte die Zusammensetzung von Knoten und Klumpen im Sternenmaterial
getestet werden. &Uuml;berdies konnten die Astronomen auch die Herkunft
des Materials pr&uuml;fen. Ein Beispiel daf&uuml;r ist der kompakteste
und hellste Knoten. Er besteht vor allem aus Silizium und Schwefel mit
wenig oder keinem Eisen. Das deutet auf eine Herkunft tief aus dem Inneren
des Sterns hin, wo die Temperaturen w&auml;hrend des Kollaps und der Supernova
drei Milliarden Grad Celsius hoch waren. An anderen Stellen haben die Astronomen
mehr Eisen zusammen mit Schwefel und Silizium gefunden. Dieses Material
wurde nach der Theorie noch tiefer im Stern gebildet, wo es vier bis f&uuml;nf
Milliarden Grad heiss wurde.
<p>Bei einem Vergleich der verschiedenen Stellen fanden Hughes und seine
Kollegen heraus, dass die eisenreichen Mixturen aus dem Innersten des Sterns
sich nach der Explosion an den &auml;u&szlig;eren R&auml;ndern der &Uuml;berbleibsel
befinden. Das heisst, dass sie bei der Explosion am weitesten weggeschleudert
wurden. Und immer noch scheint dieses Material schneller weg vom Ort der
Explosion zu streben als der Rest.
<p>Von der Beobachtung von Cas A durch Chandra erhoffen die Forscher die
Kl&auml;rung einiger Prozesse, die bisher nur theoretisch durchdacht sind.
Sie glauben, dass der Mechanismus der Supernova-Explosion sich best&auml;tigt,
sowohl in der Dynamik als auch in den produzierten Elementen. „Au&szlig;er
dem Verst&auml;ndnis f&uuml;r das Entstehen von Eisen und anderen Elementen,
wollen wir erfahren wie es aus dem Stern in den interstellaren Raum kommt,“
sagt Hughes. „Einmal von den Sternen produziert, k&ouml;nnen die neu-entstandenen
Elemente an der Bildung von neuen Sternen und Planeten mitwirken. Das Ganze
bildet einen gro&szlig;en Kreislauf, den das Universum schon etliche Male
durchlaufen hat. Man muss sich klarmachen, dass auch die Erde und das menschliche
Leben Teil dieses Kreislaufes sind.“
<p>
<hr WIDTH="100%">
<p>Abschlie&szlig;end m&ouml;chte ich noch etwas anmerken: Sollte es mit
der Darstellung der Astro-Corner mal irgendwelche Probleme auf AMIGA-Browsern
geben, so gebt mir bitte umgehend Bescheid. Nur dann kann ich es &auml;ndern.
<p>Bis zum n&auml;chsten Mal w&uuml;nsche ich euch alles Gute!
<br>Euer LARS PHILIPSEN
<p>mailto:amiga@cytek.de
</body>
</html>
