<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Dunkelheit</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<a name="top"></a><br>
<center><font color="#000080" size="7"><b>Warum ist es nachts dunkel?</b></font></center></p>

<p>Fritz und Peter sa&szlig;en abends vor ihrem Glas Wein und sinnierten
vor sich hin. Und unversehens ergab sich dabei folgendes Zwiegespr&auml;ch:
</p>

<p>F.: Warum ist es nachts dunkel? </p>

<p>P.: Nachts ist es dunkler als drau&szlig;en! </p>

<p>F.: Nein ernsthaft. Warum ist es nachts dunkel? </p>

<p>P.: Das ist - ich will nicht sagen eine dumme, aber jedenfalls eine
simple Frage! Jedes Kind wei&szlig; doch: Da die Erde rotiert und zwar in
24 Stunden einmal, so ist in jedem Augenblick ihre eine H&auml;lfte der
Sonne zugekehrt - von der sie ihr Licht empf&auml;ngt - und die andere
H&auml;lfte hat Nacht. </p>

<p>F.: Es ist stets genau die H&auml;lfte der Erdoberfl&auml;che hell und
die andere dunkel? </p>

<p>P.:Nat&uuml;rlich - von der &Uuml;bergangszone abgesehen, in der
D&auml;mmerung herrscht. Das ergibt sich doch aus der Kugelgestalt. Von
welcher Seite immer eine Kugel angeleuchtet wird, stets liegt genau die
H&auml;lfte im Licht. </p>

<p>F.: Warum sind dann nicht Tag und Nacht stets genau gleich lang,
n&auml;mlich 12 Stunden? Jetzt ist es 19 Uhr und schon lange dunkel und
morgen fr&uuml;h um sieben wird es immer noch dunkel sein? </p>

<p>P.: Jetzt im Winter - ja. Die Ungleichheit r&uuml;hrt daher, dass die
gedachte Achse der Erdrotation mit der Ebene, die durch die Bahn der Erde
um die Sonne bestimmt ist, einen Winkel bildet, rund 66½ Grad. So ist in
einem Teil die Nordhalbkugel l&auml;nger beleuchtet, und ein halbes Jahr
sp&auml;ter die S&uuml;dhalbkugel. </p>

<p>F.: Ganz klar ist mir dies aber noch nicht. </p>

<p>P.: Stelle dir zwei hypothetische F&auml;lle vor. Fall 1: Die Erdachse
st&uuml;nde genau senkrecht auf die Ekliptik, auf deutsch die
Rotationsachse steht genau senkrecht in der Umlaufsebene. Dann w&auml;re es
in der Tat so, dass praktisch jeder Ort der Erde das ganze Jahr hindurch
genau 12 Stunden Tag und 12 Stunden Nacht h&auml;tte. </p>

<p>F.: Ja - vorausgesetzt, dass wir das was wir einen Tag nennen, an der
Sonne orientieren und nicht an weiter entfernten Fixsternen.....Oder? </p>

<p>P.: Jetzt das andere Extrem! Fall 2: Die Erdachse l&auml;ge genau in der
Ebene der Ekliptik, also waagrecht in der Umlaufsebene und die
Rotationsdauer w&auml;re die gleiche. Auf einem solchen Planeten gibt es an
den Polen Gebiete, in denen die Sonne bis zu einem halben Jahr ohne
Unterbrechung scheint. Die Zone der unterbrochenen Besonnung nimmt von Tag
zu Tag etwas ab, w&auml;hrend auf der Gegenseite, die Zone, in der dauernd
Nacht herrscht, diese auch immer weiter abnimmt. Zweimal im Jahr aber kommt
es zu einer Tagundnachtgleiche f&uuml;r die gesamte Oberfl&auml;che des
Planeten. </p>

<p>F.: Schon gut. Unsere Realit&auml;t liegt zwischen diesen beiden
Extremen. Akzeptiert! Doch nun zur&uuml;ck zu meiner Frage: Warum ist es
nachts dunkel? </p>

<p>P.: Willst du mich verar... veralbern? </p>

<p>F.: Keinesfalls. Ich stelle mir halt nur vor, es scheinen doch Tausende
oder Zehn-, nein Hunderttausende von Sternen auf uns herab, von allen
Seiten und vom Einfluss der Wolken abgesehen jeden Augenblick, wie uns die
Erde auch dreht. Warum schaffen die es nicht, den ganzen Himmel
gleichm&auml;&szlig;ig zu erhellen? </p>

<p>P.: Im ersten Augenblick klingt es verbl&uuml;ffend. Es wird halt daran
liegen, dass die n&auml;her gelegenen Sterne eben mehr Licht schicken als
die entfernten? </p>

<p>F.: Ich will meine These etwas pr&auml;zisieren. Stimmst du mit mir
dar&uuml;ber &uuml;berein, dass das Weltall als Ganzes genommen isotrop und
homogen ist? Vereinfacht ausgedr&uuml;ckt: dass der Punkt im Weltall, an
dem wir uns mit unserer Erde gerade befinden, prinzipiell vor keinem
anderen Punkt ausgezeichnet ist. Dass jede Richtung, in die wir von hier
aus blicken, im Prinzip ebenfalls durch nichts vor anderen ausgezeichnet
ist. Und schlie&szlig;lich darin, dass die leuchtende Materie, im
gro&szlig;en gesehen, den Weltraum gleichm&auml;&szlig;ig erf&uuml;llt?
</p>

<p>P.: Ja wenn du dies so betrachtest, dann..... Es gibt zwar hier Sterne
und dort riesige leere R&auml;ume, es gibt Sternhaufen und Sternsysteme -
aber wenn du vom Weltraum im ganzen sprechen willst, so scheint mir die
Annahme, es sei durchschnittlich gleichm&auml;&szlig;ig mit leuchtender
Materie erf&uuml;llt, vern&uuml;nftig zu sein. </p>

<p>F.: Bezeichnen wir die Zahl der Fixsterne, die in einer angenommenen
Entfernung von uns - z.B. 10 pc - befinden, mit x. Wie gro&szlig; ist die
Zahl der Sterne, die gerade doppelt so weit, also 20 pc, entfernt sind? Da
die Formel f&uuml;r Kugeloberfl&auml;che den Ausdruck r&sup2; enth&auml;lt,
ist die Kugelschale mit dem Radius 20 pc genau viermal so gro&szlig; wie
die mit dem Radius 10 pc. Die Zahl der Sterne nimmt also, wenn wir alle
Richtungen zusammennehmen, im Quadrat der Entfernung zu. Andererseits nimmt
die Strahlung, die wir empfangen, wie allgemein bekannt, im Quadrat der
Entfernung ab - das ist nichts anderes als die Kehrseite der eben
beschriebenen Gesetzm&auml;&szlig;igkeit. </p>

<p>Die beiden Faktoren heben sich also gerade auf. Das hei&szlig;t, wir
empfangen aus jeder Entfernung die gleiche Menge an Strahlung und da wir
die Schalen bis in Millionen Lichtjahre fortgesetzt denken d&uuml;rfen, so
addieren sich die empfangene Strahlung - und zwar nicht ins Unendliche,
aber so lange, bis ein Stern den anderen verdeckt. </p>

<p>P.: Das kommt mir vor wie der ber&uuml;hmte Beweis, dass Archilles die
Schildkr&ouml;te niemals einholen kann. Man wei&szlig; nicht so recht, wie
es zu widerlegen ist, aber man sieht sofort, stimmen kann das nicht. </p>

<p>F.: Ja ein echtes Paradoxon, aufgestellt vor 150 Jahren, von dem Bremer
Arzt und Amateurastronomen Wilhelm Olbers, der unter anderem auch mehrere
Kometen entdeckt hat. Auch Johannes Kepler und Edmond Halley haben schon
dar&uuml;ber gegr&uuml;belt. </p>

<p>P.: Mann o Mann, sitze ich hier nichtsahnend bei einem Gl&auml;schen
Wein und du kommst mit dem Olberschen Paradoxon an, kaschierst es und
fragst einfach ganz unschuldig, warum ist es nachts dunkel? Gut. Vielleicht
l&auml;sst es sich auf folgendem Wege aufl&ouml;sen. D&uuml;rfen wir uns
die Kugelschalen wirklich bis in beliebige Entfernungen aneindergeschichtet
denken, eine Zwiebel mit unendlichem Radius sozusagen? Es ist doch bekannt,
dass die Sterne und auch die Sternsysteme ein endliches Alter haben.
Irgendwo h&ouml;rt die Zwiebel also auf. Tats&auml;chlich hat jemand
ausgerechnet, dass es bei einem Alter der Welt in der
Gr&ouml;&szlig;enordnung von 15 Milliarden Jahren (die heutige Annahme)
immer noch nicht genug Sterne gibt, um den von Olbers postulierten
Tatbestand zu erf&uuml;llen. </p>

<p>F.: Mir ist noch aus anderem Grunde bei diesem Argument nicht ganz wohl.
Verfallen wir Menschen nicht immer wieder in den Fehler, dass wir
Dimensionen des Alls in Raum und Zeit von unserem engen Bereich aus
beurteilen und damit zu kurz ansehen? Haben nicht die Menschen
jahrhundertlang geglaubt (unter Berufung auf die Bibel), die Welt sei 6000
Jahre alt? Und dann in der Zeit von Lyell und Darwin einigte man sich auf
10000, dann einige 100000 Jahre, dann Millionen, und das war immer noch zu
wenig. Haben wir nicht jahrhundertelang die Erde als Nabel der Welt
gehalten, dann die Sonne, und bis ins 20. Jahrhundert hinein zumindest noch
die Milchstra&szlig;e? Ist es nicht ein &auml;hnlicher Schluss, wenn wir
jetzt meinen, das Weltganze sei nicht &auml;lter als die Sonne und ihre
n&auml;here kosmische Umgebung? </p>

<p>P.: Beachte bitte aber, dass nicht nur das Studium der Sonne und vieler
anderer Sterne in unserer Milchstra&szlig;e Werte von 15 Milliarden Jahren
ergeben hat. &Auml;hnliche Zahlen ergeben sich als R&uuml;ckschluss auch
aus der sogenannten Expansion des Weltalls. Vielleicht l&auml;sst sich aber
gerade hieraus das Paradoxon noch von einer anderen Seite angreifen. Die
Entfernungen innerhalb der Milchstra&szlig;e scheinen zwar konstant. Aber
die Entfernungen der fernen Nebel - wenn wir den Astronomen glauben
d&uuml;rfen -wachsen doch ununterbrochen an, bis zu unvorstellbaren
Geschwindigkeiten. So entfernt sich der sogenannte Hydra-Haufen, mehr als
zwei Milliarden Lichtjahre von uns entfernt, bereits mit 60000 km/s, und
wenn wir die Reichweite unserer gr&ouml;&szlig;ten Teleskope verdoppeln
w&uuml;rden, so w&auml;ren wir bereits an der Grenze angelangt, wo sich die
Galaxien mit Lichtgeschwindigkeit entfernen. Und von denen, die sich mit
30% oder 50% der Lichtgeschwindigkeit entfernen, d&uuml;rfte das Licht
zumindest stark geschw&auml;cht bei uns eintreffen. So k&ouml;nnte man
Olbers mit dem Hinweis auf die Expansion widerlegen? Die Nacht ist dunkel,
weil die fernen Lichtquellen von uns wegfliegen? </p>

<p>F.: Lehrt aber nicht Einstein, die Lichtgeschwindigkeit von 300000 km/s
sei konstant in der Weise, dass sie von der Geschwindigkeit der Lichtquelle
v&ouml;llig unabh&auml;ngig sei? Das bedeutet, dass das Licht einer
Galaxie, die sich mit einer Geschwindigkeit von 180000 km/s von uns
entfernt, bei uns mit unverminderter Geschwindigkeit von 300000 km/s
eintrifft. </p>

<p>P.: Ja aber mit vermindeter Energie! Und doch - mir schwankt der Boden
unter den F&uuml;&szlig;en und nicht nur vom Wein. Olbers glaubte doch
selbst, dass der Schl&uuml;ssel zu seiner R&auml;tselfrage bei der
interstellaren Materie liege, die bekannterma&szlig;en nicht nur Licht
streut, sondern auch schluckt. Ich glaube, h&auml;tte Olbers nicht nur an
Lichtstrahlung gedacht, sondern auch die anderen Frequenzen wie Radiowellen
und R&ouml;ntgenstrahlen mit ber&uuml;cksichtigt, sie waren damals nur noch
nicht bekannt, dann h&auml;tten seine Betrachtungen ganz andere Richtungen
aufgezeigt. Aber das sind Fragen, die die heutige Kosmologie noch nicht
vollkommen erkl&auml;rt. Lassen wir es bitte nun dabei bewenden, dass es
nachts dunkler ist als draussen. Einverstanden? </p>

<p>F.: Einverstanden. Trotzdem, warum ist es nachts dunkel? </p>

<hr size="4"><br>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



