<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Dunkelheit 2</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue" bgcolor=gray>
<br>
<center><font color="#000080" size="7"><b>Darum ist es nachts dunkel!</b></font></center></p>
<table border=0 cellpadding=3 cellspacing=3 width=100%><tr><td>
<p>Tage sp&auml;ter trafen sich Fritz und Peter wieder und es dauerte nicht
lange, bis sie an ihrem letzten Thema ankn&uuml;pften. </p>

<p>P: Deine Frage beim letzten Mal &quot;Warum ist es nachts dunkel?&quot;
lie&szlig; mir doch keine Ruhe und ich versuchte diesbez&uuml;glich einmal
nachzulesen. Viel ist nicht dabei herausgekommen, denn in den Lexikas steht
wirklich nicht viel drinnen und die n&ouml;tigen Fachpublikationen habe ich
leider nicht zur Verf&uuml;gung. Das einzige Buch, das ich habe, ist
&quot;Knaurs moderne Astronomie&quot; von Hans Joachim St&ouml;rig. Der
Autor behandelt nach meinem Empfinden durch eine sachliche und gut
fundierte Abhandlung den Urknall in hervorragender Manier und auch dem
Paradoxon von Olbers hat er ein ganzes Kapitel gewidnet. Nur ganz ehrlich,
die Erkl&auml;rungen sind zu wissenschaftlich und eignen sich f&uuml;r
diesen Augenblick hier beim Glase Wein &uuml;berhaupt nicht. </p>

<p>F: Schade, und dabei hatte ich jetzt gedacht, endlich eine Antwort auf
meine Frage zu bekommen, denn neulich las ich, dass man mit dieser Frage
unter Astronomen und Kosmologen eine lebhafte Diskussion provozieren kann.
</p>

<p>P: Dass die Hypothese von Olbers nicht stimmt, brauche ich wohl nicht zu
wiederholen, dass es im Weltraum gleichm&auml;&szlig;ig taghell sein
m&uuml;sste. Es gibt zwischenzeitig verschiedene Antworten. Man h&ouml;rt
vom Verr&ouml;tungs- und Verd&uuml;nnungseffekt: Das Licht entfernter
Galaxien, die sich mit gro&szlig;er Geschwindigkeit entfernen, erscheint
uns langwelliger, als es an seiner Quelle war, und damit energie&auml;rmer,
also eine Rotverschiebung . Es muss uns auch darum schw&auml;cher
erscheinen, weil von einer sich entfernenden Quelle pro Sekunde weniger
Photonen bei uns ankommen, als an der Quelle pro Sekunde abgeschickt
wurden. </p>

<p>F: Das ist ja so wie mit dem Taubenz&uuml;chter, der eine Reise antrat
und jeden Tag Punkt 12 Uhr eine Brieftaube aufsteigen lie&szlig;, um zu
Hause seinen derzeitigen Standort mitzuteilen. Der Abstand zwischen dem
Eintreffen der einzelnen Tauben wurde immer l&auml;nger. Jede nachfolgende
Taube musste ja auch einen immer l&auml;nger werdenden Weg
zur&uuml;cklegen. </p>

<p>P: Ganz recht und das nennt man den Verd&uuml;nnungseffekt, weil je
Sekunde immer weniger Photonen eintreffen. Trotzdem, die Dunkelheit ist
nicht durch die Expansion des Weltalls verursacht. Der wahre Grund scheint
mir das endliche Alter des Universums zu sein. Dies hat zur Folge, dass der
Raum eben nicht bis in beliebige Entfernungen mit Galaxien angef&uuml;llt
ist. Blicken wir bis 15 Milliarden Jahren zur&uuml;ck - und das tun wir,
wenn wir die entferntesten Quasare wahrnehmen -, so dringen wir in ein
Zeitalter vor, in dem sich die Galaxien gerade bildeten. K&ouml;nnten wir
noch weiter zur&uuml;ckblicken, so s&auml;hen wir das All in dem Zustand,
wie es vorher hatte: es w&auml;re undurchsichtig. Es w&uuml;rde uns wie
eine Wand erscheinen, die keine Strahlung durchl&auml;sst. </p>

<p>F: Sage mal, ist das nicht ein bisschen weit hergeholt und woher willst
du das wissen? </p>

<p>P: Ich wei&szlig; es nicht. Ich kann dir nur sagen, dass ich dies
gelesen habe und das scheint die derzeitig g&uuml;ltige Antwort der
Kosmologen zu sein. 1987 erschien ein Bericht des Astronomen Paul A. Wesson
im &quot;Astrophysical Journal&quot;, in dem er &uuml;ber seine
umfangreichen Computersimulationen berichtete. Dabei wurden folgende
Faktoren zu Grunde gelegt: <ol>
<li> das Alter der Galaxien mit 15 Milliarden Jahren oder mit 5&middot;10
hoch 17 Sekunden </li>
<li> die durchschnittliche Dichte der leuchtenden Materie im Universum mit
2&middot;10 hoch minus 31 Gramm pro Kubikzentimeter </li>
<li> die durchschnittliche Energieproduktion pro Gramm mit 0,2 erg in der
Sekunde. </li></ol>
Dabei ergibt sich, unter Ber&uuml;cksichtigung der Lichtgeschwindigkeit,
eine durchschnittliche Intensit&auml;t des Lichts im ganzen Universum von
etwa 10 hoch minus 4 erg auf den Quadratzentimeter in jeder Sekunde. Dabei
ist die Expansion noch nicht ber&uuml;cksichtigt. </p>

<p>F: Und das wei&szlig;t du alles? </p>

<p>P: Nein nat&uuml;rlich nicht. Ich habe es mir nur f&uuml;r dich
aufgeschrieben. Aber um die Frage nach der Expansion zu erl&auml;utern. In
einem zweiten Rechenschritt wurde versucht zu ermitteln, ob die Expansion
oder das begrenzte Weltalter der Hauptfaktor ist. </p>

<p>F: Na und? was ist dabei herausgekommen? </p>

<p>P: Das Ergebnis ist eindeutig. Nicht die Expansion ist der Hauptfaktor.
Das Universum w&auml;re auch dunkel, vielleicht nicht ganz so dunkel, wenn
die Expansion nicht stattf&auml;nde. Der Hauptfaktor ist die Tatsache, dass
das Universum ein endliches Alter hat, zwar nach Milliarden z&auml;hlend,
aber endlich und die Galaxien m&uuml;ssen 1 bis 2 Milliarden Jahre
j&uuml;nger sein als das Universum. Das ist zu kurz, als dass die
strahlenden Massen schon den ganzen Raum h&auml;tten erhellen k&ouml;nnen.
</p>

<p>F: ????? <p>

<p>P: Man kann die Sache auch etwas anders wenden. Nicht nur das Weltalter
ist endlich und damit auch die Zahl der vorhandenen Galaxien, auch die
Lichtgeschwindigkeit ist endlich. Sie begrenzt unseren Horizont. Wir
k&ouml;nnen nur Objekte sehen, deren Licht vom Moment der Aussendung an bis
heute genug Zeit gehabt haben, um den Weg zu uns zur&uuml;ckzulegen. So
jetzt wei&szlig;t du, warum es nachts dunkel ist. </p>

<p>F: Wenn ich irgendwann mal lese, dass Einstein sich geirrt hat und die
Lichtstrahlen keine Konstante darstellen und nicht die schnellsten
elekromagnetischen Wellen sind, dann komme ich wieder und wiederhole meine
Frage. </p>


</td></tr></table>
<hr size="4"><br>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
        
</body>
</html>



