
<HTML>
<HEAD>
<TITLE>Feedback</TITLE>
<META NAME=<META NAME="AUTHOR" CONTENT="Sieglinde Peters">
</HEAD>
<body>
<BODY BACKGROUND="l_bg.gif">
<Font Color="#ff0000">
<img src="briefm.gif" ALIGN=right ALT="briefm.Gif" WIDTH=88 HEIGHT=88>
<H1 ALIGN=CENTER>Feedback von der NoCover71</H1></FONT>
<p>
<font color=black font size=3>
<p>
<HR>
Nach der Aussage des Feedbackmanagers f&auml;llt mir in diesem Monat wieder
die Aufgabe des Schreibens zu und ich mu&szlig; sagen, noch nie ist es mir so
schwer gefallen, mein Urteil abzugeben. Auch wenn man ber&uuml;cksichtigt, da&szlig;
die letzte Ausgabe  wegen des fr&uuml;heren Abgabetermins nicht so vollst&auml;ndig
sein konnte, ist es doch un&uuml;bersehbar, da&szlig; es mit der NoCover schon seit
einigen Ausgaben sp&uuml;rbar bergab geht. Ich sage das ohne einen Vorwurf,
denn ich mu&szlig; mich da selbst auch miteinbeziehen. Ich verbringe auch nicht
mehr so viel Zeit vor dem Amiga wie noch vor einem Jahr. Die Zahl der
Amigauser nimmt st&auml;ndig ab und viele, die noch eifrig f&uuml;r die NoCover
schreiben, fragen sich: Wer liest das eigentlich noch? Lohnt sich der
Zeitaufwand &uuml;berhaupt noch? - Ich denke, es lohnt sich noch allemal, solange
es noch Amigauser gibt. Viele werden sich, so wie ich, wahrscheinlich
zus&auml;tzlich zum Amiga noch einen anderen Rechner zulegen und auch diese
Anwender sollte man weiter mit einbeziehen. Die gute Klubgemeinschaft mu&szlig;
ja nicht enden, nur weil sich einer noch einen Rechner mit einem anderen
Betriebssystem kauft.<p>
<strong>Thomas Weber</strong> unser Comicautor ist auch so ein starker Zweifler." Ich schaue
mir Deine Comics in jeder Ausgabe an. Ja, ich habe dazu auch noch nie eine
E-Mail geschrieben, daf&uuml;r habe ich aber Deine Homepage besucht. Ich w&uuml;rde
sie vermissen, wenn sie nicht mehr da w&auml;ren. Sie sind zu einem festen
Bestandteil der NoCover geworden. Bitte zeichne weiter."<p>
Die Mitgliederliste ist in dieser Ausgabe dem fr&uuml;hen Abgabetermin zum Opfer
gefallen, ebenso die Amigauserliste.
Die Workshopabteilung ist schon seit ein paar Ausgaben verwaist. Der Harald-
Schmidt-Workshop geh&ouml;rt nach meiner Meinung eigentlich eher in die Small-
Talk-Ecke.<br>
<P><strong>Games</strong></P>
<strong>Sax</strong> schildert in sehr eindrucksvoller Weise, mit wie viel Arbeit bei der
Programmierung eines Spiels nebenher so zu rechnen ist.  Von solchen
Schwierigkeiten haben wir meist keine Ahnung. Wir setzten uns vor den
Rechner, installieren ein Spiel und erwarten, da&szlig; alles ohne Probleme l&auml;uft.
<strong>Kilian</strong> war in der aktuellen Ausgabe der NoCover gleich mit zwei Spieletests
vertreten. Er geh&ouml;rt auch zu den wenigen flei&szlig;igen Schreiberlingen, die zum
Gl&uuml;ck noch nicht das Handtuch geworfen haben. Die Beurteilungen von Kilian
finde ich immer sehr gelungen. Das Spiel Super Pino werde ich mir bestimmt
nicht zulegen nach dieser Kritik.<p>
Diesmal war die <strong>Hardwareecke</strong> dank<strong> Benjamin Herwig</strong> nicht so verlassen, wie
sonst so oft. Leider gibt es ja auch nicht mehr so viele neue Hardware, &uuml;ber
die man in der NoCover berichten kann.<p>
In der <strong>Multimediarubrik</strong> fand sich dieses mal nur die Metal Corner von Kilian.
" Du wirst mir verzeihen Kilian, wenn ich dazu nichts sagen kann. Mein Alter
ist wahrscheinlich f&uuml;r Dich schon Entschuldigung genug.<br>
Daf&uuml;r finde ich Deine <strong>Toolsbeitr&auml;ge</strong> wirklich gut. Man merkt Deiner
ausf&uuml;hrlichen Beschreibung an, da&szlig; Du jedes Programm wirklich auf Herz und
Nieren gepr&uuml;ft hast."<p>
<P><strong>CD-Theke</strong></P>
Schade <strong>Wolf</strong>, da&szlig; Du die CD-Beschreibung nicht mehr machen m&ouml;chtest, aber
ich kann das verstehen. Das Programm "Ami Atlas" zeichnet sich auf meinem
Rechner leider durch besonders hohe Absturzfreudigkeit aus. Mit den
Geschmacklosigkeiten gegen Bill Gates kann ich mich auch nicht anfreunden.
Da gehen manche Amigauser einfach zu weit. Auch wenn Du in Zukunft keine
CD-Tests mehr schreibst, werden wir doch weiterhin noch andere Artikel von
Dir zu lesen bekommen oder?
<P><strong>Online</strong></P>
Endlich wieder eine neue Artikelreihe in der Rubrik Online. ( Es wird doch
hoffentlich eine Reihe?) Die Erstausgabe macht auf jeden Fall schon mal Lust
auf mehr.<p>
<strong>Leserbriefe</strong> gab es fr&uuml;her auch mal mehr, aber das schreibe ich dem E-Mail-
Zeitalter zu. <p>
<P><strong>Diskussionen</strong></P>
<strong>Mark Tom</strong> besch&auml;ftigt sich mit Sternen, Zeit und schwarzen L&ouml;chern. Ein
interessanter Beitrag, der sich wohltuend von den Beitr&auml;gen zur Amigazukunft
abhebt. Auch<strong> Wolf</strong> gibt und wieder einiges zum Nachdenken und Lernen.
<P>
Die <strong>Small-Talk-Abteilung</strong> war in dieser Ausgabe nicht so &uuml;ppig gef&uuml;llt, was
sicher an der verfr&uuml;hten Abgabe der Artikel lag.
<strong>Storys</strong> gab es in dieser Ausgabe keine und Tipps und Tricks kann immer
jemand gebrauchen.
<hr>
Sieglinde Peters<IMG SRC="compwom.gif" ALIGN=RIGHT ALT="compwom.gif" WIDTH=88 HEIGHT=88>
</FONT></BODY>
</HTML>
