

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Interview mit Thomas Raukamp (AmigaOS)</TITLE>
</HEAD>
<BODY TEXT=white bgcolor=black link=silver alink=red>
<h1><CENTER><FONT COLOR="GREEN">Interview</FONT></h1></CENTER></P>
Da die Interviewecke seit längerer Zeit stark verwaist ist, habe ich auf der
HEW `99 die Chance genutzt und Thomas Raukamp (Chefred. der AmigaOS) um ein
Interview gebeten, welches wir per E-Mail abgehandelt haben. Here we go:</P>







<i>K&#246;nnten Sie sich mal kurz unseren Lesern vorstellen....</I></P>



Nun, mein Name ist Thomas Raukamp, ich bin 30 Jahre alt und Gesch&#228;ftsleiter

der Firma thomas raukamp communications. Im Amiga-Bereich ist unsere

Zeitschrift amigaOS bekannt, der ich als Chefredakteur und -layouter

vorstehe. Ich lebe im hohen Norden - in Rendsburg in Schleswig-Holstein -

entsprechend liebe ich das Meer und die st&#246;rrischen Leute hier oben. Ich bin

verheiratet mit Nicole und teile mein Leben au&#223;erdem mit 3 nervigen Katzen

und 7 V&#246;geln.</P>



<i> Als Chefredakteur einer Amiga Zeitschrift haben Sie sicherlich einen

Amiga zu Hause stehen. Wie ist dieser ausger&#252;stet und welche weiteren

Rechner sind bei Ihnen im st&#228;ndigen Einsatz?</I></P>



Ich habe einen Rechner zuhaus und im B&#252;ro stehen: Meine Hauptmaschine f&#252;r die

Arbeit ist ein Amiga 4000/060/PPC mit 48 MB RAM. Dieser ist ausger&#252;stet mit

einer Cybervision 64 und einer Toccata. Ich nutze den Rechner eigentlich f&#252;r

meine gesamte Arbeit, haupts&#228;chlich schreibe ich also Artikel darauf und

layoute die amigaOS. Als DTP-Software nutze ich PageStream 3.4. Als EBV setze

ich haupts&#228;chlich ImageFX, ArtEffect und ADPro ein.

Ich nutze au&#223;erdem hin und wieder einen Amiga 1200 mit 030-Prozessor,

haupts&#228;chlich f&#252;r Hardware-Testberichte. Au&#223;erdem begleitet mich dieser

Rechner, wenn ich auf Messen oder sonstwie unterwegs bin.

Au&#223;erdem steht auf meinem Schreibtisch ein Atari Falcon030, den ich

haupts&#228;chlich als Fax und Anrufbeantworter nutze. Ich brauche ihn aber auch

f&#252;r Testberichte f&#252;r unsere Schwesterzeitschrift ST-Computer, hin und wieder

mache ich auch Musik damit.</P>



<i> Wie kam es eigentlich zur AmigaOS? Sind Sie auf den Falke Verlag

zugegangen oder ist dieser an Sie herangetreten?</I></P>



Ich kenne Ali Goukassian, den Leiter des Falke Verlags, schon seit l&#228;ngerer

Zeit. Ich habe schon vor der amigaOS an der ST-Computer mitgearbeitet. An

einem lauen Sommerabend im August 1998 sa&#223;en wir in Alis B&#252;ro zusammen, und

ich sagte im Spa&#223; zu ihm: &quot;Ali, wir brauchen noch eine Zeitschrift. Machen

wir doch was f&#252;r den Amiga&quot;. Ich hatte zu der Zeit schon seit einigen Jahren

einen Amiga. Ali schien mich nicht recht ernst zu nehmen (wie immer), rief

mich aber am n&#228;chsten Morgen an, um zu fragen, ob ich das mit dem

Amiga-Magazin ernst meinte. Wir haben dann ziemlich viel geplant, gerechnet

usw. Am Ende hatte ich genau 1 Monat, um das Magazin neu zu erfinden. Nun ja,

daf&#252;r ist es eigentlich recht gut geworden.</P>



<i> Die AmigaOS hat sich ja schnell auf dem Markt etablieren k&#246;nnen. H&#228;tten

Sie mit diesem enormen Erfolg gerechnet?</I></P>



Ja und nein. Mir war schon klar, da&#223; der Amiga-Markt seit dem Quasi-Weggang

des Amiga-Magazin wieder bereit war f&#252;r eine ambitionierte Zeitschrift. Wenn

ich ehrlich bin, habe ich mir aber dar&#252;ber nicht allzu viel Gedanken gemacht.

Ich stellte mir einfach vor, wie ein Magazin sein m&#252;&#223;te, damit ich es gern

jeden Monat wieder am Kiosk kaufen w&#252;rde. Das ist bis heute meine Motivation

beim Gestalten der aOS: Ich versuche einfach, das Magazin so zu gestalten,

da&#223; es mir wirklich gef&#228;llt. Wenn es dann noch anderen gef&#228;llt, ist das

nat&#252;rlich umso sch&#246;ner. Dieser Ansatz ist zugegebenerma&#223;en etwas egoistisch,

scheint aber zu funktionieren.

Den gr&#246;&#223;ten Anteil an unserem Erfolg hat aber zweifellos Ali Goukassian, der

sich auf das Risiko eines neuen Magazins in einem nicht ganz einfachen Markt

eingelassen hat und uns seitdem hervorragend unterst&#252;tzt und ber&#228;t. Ohne Ali

und den Falke Verlag g&#228;be es letztendlich die amigaOS nicht.</P>



<i> K&#246;nnen Sie Angaben zur Auflage machen?</I></P>



Sie werden sicher verstehen, da&#223; ich hier keine genauen Angaben machen kann,

da durch die Fusion mit der Amiga Plus die Auflage nochmals steigt. Wir

werden soweit steigern, bis wir wirklich fl&#228;chendeckend vertreten
sind.</P>



<i> Der Falke Verlag war ja auch auf der HEW `99 vertreten. Wie haben Sie

pers&#246;nlich die Messe erlebt und hat es sich auch wirtschaftlich f&#252;r den

Falke Verlag gelohnt?</I></P>



Die Messe hatte zwei Gesichter: Auf der einen Seite waren da die

Amiga-H&#228;ndler, die durchweg zufrieden mit den Ums&#228;tzen waren. Auf der anderen

Seite waren da die Besucher, die zumeist mit vollen Geldb&#246;rsen wieder

abzogen, da keine wirklich neue Hardware zu kaufen war. Hier herrschte

offensichtlich ein Widerspruch - nicht auszudenken, wieviel die H&#228;ndler

eingenommen h&#228;tten, wenn ihnen die neuen G3-/G4-Karten und die

BVision-/CyberVision-Karten bereitgestanden h&#228;tten.

F&#252;r den Falke Verlag hat sich die Messe sicher gelohnt, da wir ja durch die

freundliche Hilfe von Petro Tyschtschenko auf dem Amiga-Stand gut

untergebracht waren. Es war einfach wichtig, sich nach dem ersten

Publikationsjahr den Lesern wieder zu stellen.

Ich pers&#246;nlich habe nat&#252;rlich die &#252;berw&#228;ltigend guten Reaktionen auf die

amigaOS genossen. 

Andererseits herrschte auf der Messe an sich eine recht schlechte Stimmung -

Besucher waren entt&#228;uscht, Ger&#252;chte kursierten, wurden dementiert usw. Ich

h&#228;tte mir in dieser Hinsicht eine etwas offenere Informationspolitk seitens

Amiga gew&#252;nscht, oder jedenfalls ein etwas lockerere Reaktion, wenn aus einer

praktisch nicht vorhandenen Informationspolitik Ger&#252;chte entstehen.</P>



<i> Unmittelbar nach der HEW kam ja die Meldung, da&#223; die Amiga Plus fortan in

die AmigaOS integriert wird, womit die OS die einzig verbliebene Zeitung auf

dem Markt ist - besteht da nicht die Gefahr einer Monopolstellung? Und was

sagen sie dazu, da&#223; sie das einzig verbliebene Amiga Mag sind?</I></P>



Nun ja, ich will hier nichts sch&#246;n reden: Sicher ist es nicht das allerbeste

Zeichen f&#252;r einen Markt, wenn es sich f&#252;r gro&#223;e Verlage nicht mehr lohnt,

Magazine f&#252;r den Amiga zu machen. Aber genau hier setzen wir halt mit einem

relativ kleinen Team an: Wir k&#246;nnen die Kosten weitaus geringer halten und

kommen schneller in eine Gewinnzone, die f&#252;r uns interessant ist. Genau

diesen Ansatz verfolgen wir ja auch seit Jahren im Atari-Markt und haben hier

bewiesen, da&#223; man auf dieser Basis &#252;ber Jahre ein qualitativ hochwertiges

Produkt machen kann.

Ich pers&#246;nlich habe nicht die Bef&#252;rchtung, da&#223; wir unsere Stellung ausnutzen

k&#246;nnten. Ich habe das alles ja schon einmal im Atari-Markt mitgemacht: Hier

hatten wir 5 Zeitschriften, pl&#246;tzlich waren nur noch wir da. Ich wei&#223; genau,

wie sich der Leser dann f&#252;hlt, und da&#223; man sein Vertrauen nicht ausnutzen

darf, um ihn nicht noch weiter zu verunsichern. Wir d&#252;rfen diesen

&quot;menschlichen Faktor&quot; nicht vergessen, immerhin ist der Amiga-Markt wie kaum

ein andere mit Emotionen behaftet.

Es stimmt allerdings nicht ganz, da&#223; wir das einzige Amiga-Magazin sind: Leo

Burkert macht mit dem Amiga Magazin doch einen hervorragenden Job, und auch

die Disk- und Online-Magazine wie die NoCover oder auch amiga-news.de werden

immer wichtiger werden.</P>



<i> Wie wird es mit der Amiga Future weitergehen?</I></P>



Da bitte ich Sie, bei Andreas Magerl und seinem Team nachzufragen. Ich habe

rein gar nichts mit der Future zu tun, bin also wie Sie gespannt auf die

kommende Ausgabe.</P>



<i> Ihre Redaktion ist ja recht gro&#223; und enth&#228;lt einige nahmhafte Namen

(Carsten Schr&#246;der etc.). Lohnt sich ein solch gro&#223;es Redaktionsteam

&#252;berhaupt f&#252;r ein Magazin mit 66 Seiten Umfang? </I></P>



Sie m&#252;ssen sehen, da&#223; wir nur sehr wenige feste Redakteure haben. Dazu geh&#246;ren

Carsten und auch Nico Barbat. Andere Autoren tragen dann in unregelm&#228;&#223;igen

Abst&#228;nden etwas zur Zeitschrift bei, jeder hat seine Fachgebiete. Ich

pers&#246;nlich bevorzuge es aber, den Kreis der Mitarbeiter &#252;berschaubar zu

halten, da man sich nach einiger Zeit untereinander doch recht gut kennt,

St&#228;rken und Schw&#228;chen einordnen kann.</P>



<i> Rechnet sich heutzutage &#252;berhaupt noch ein Amiga Magazin? Immerhin ist

der Markt in den letzten Jahren extrem geschrumpft und das Werbevolumen ist

auch l&#228;ngst nicht mehr so gro&#223;, wie es einmal war....</I></P>



Das stimmt sicherlich. Ein Amiga-Magazin zu produzieren rechnet sich sicher

nicht mehr f&#252;r so gro&#223;e Verlage, wie die , die hier fr&#252;her am Start waren.

Wie erw&#228;hnt, haben wir durch unsere externen Teams jedoch ganz andere

Kalkulationsm&#246;glichkeiten. Wir sind spezialisiert auf kleinere M&#228;rkte, setzen

unsere technischen, wirtschaftlichen und vor allem pers&#246;nlichen M&#246;glichkeiten

so ein, da&#223; wir trotzdem qualitativ hochwertig produzieren k&#246;nnen. Auf dieser

Basis sollten wir eigentlich noch ein paar Jahre weiter f&#252;r den Amiga-Markt

produzieren k&#246;nnen.</P>



<i> Wird es aus dem Hause &quot;Falke Verlag&quot; demn&#228;chst noch mehr geben (z.B.

X-Ray II etc.)?</I></P>



In erster Linie werden wir uns auf die Produktion unserer Publikationen

amigaOS/Amiga Plus, Amiga Future und die Amiga-Plus-CD konzentrieren. Sicher

gibt es ein paar Ideen f&#252;r zuk&#252;nftige Projekte, z. B. eine CD-Serie unter dem

bekannten Namen &quot;Amiga Fever&quot;. Auch Software-Produkte werden wir sicher

verst&#228;rkt in den Vertrieb nehmen, allerdings nicht im selben Umfang wie im

Atari-Markt - hier haben wir eine wichtige Funktion als verf&#252;gbarer

Softwarelieferrant, eine Funktion, die die existierenden H&#228;ndler und

Entwickler im Amiga-Markt dagegen noch absolut zufriedenstellend ausf&#252;llen.</P>



<i> Wie beurteilen Sie die aktuelle Lage um den Amiga?</I></P>



Eine unvermeidbare Frage.

Es ist schwer, etwas dazu zu sagen. Man wird die kommenden Monate beobachten

m&#252;ssen, um hier genaues zu sagen. Ich erwarte, da&#223; sich hier recht

kurzfristig ein paar entscheidende Dinge tun werden, die dem Markt und seiner

Zukunft neue Perspektiven geben.

Grunds&#228;tzlich denke ich, da&#223; wir mit dem Amiga nach wie vor ein sehr gutes

Produkt haben, mit dem wir auch noch einige Zeit arbeiten k&#246;nnen. Das

Betriebssystem ist hervorragend, die Hardware von externen Firmen immer

weieder soweit &quot;verj&#252;ngt&quot; worden, da&#223; in der Praxis gar kein so eklatanter

Leistungsunterschied zu anderen Systemen - besonders zum PC - vorhanden ist.

Was mich zur Zeit jedoch am meisten st&#246;rt, ist, da&#223; ich Leuten, die mich

fragen, zu welchem Computer ich ihnen rate, keinen Amiga empfehlen kann. Es

sind einfach keine Komplettsysteme da, bei denen das

Preis-/Leistungsverh&#228;ltnis stimmt. Ich m&#246;chte aber den Rechner, den ich

nutze, auch weiterempfehlen k&#246;nnen - und genau so ein Produkt brauchen wir. 

Die Chance f&#252;r ein gutes System ist sicher da: Apple sch&#246;pft mit dem iMac

exakt den Markt aus, den Amiga und Atari zur&#252;ckgelassen haben - fr&#252;her h&#228;tte

man diesen Markt als Homecomputermarkt bezeichnet. Wir sollten hier keine

Ber&#252;hrungs&#228;ngste haben - immerhin ist der Home-Markt eigentlich der

attraktivste Markt, denn hier k&#246;nnen sich nur wirklich intuitive und gute

Produkte durchsetzen. Zuhause will sich doch eigentlich niemand mit einem PC

herum&#228;rgern, es reicht doch, wenn man dies auf der Arbeit tun
mu&#223;.</P>



Die tats&#228;chliche aktuelle Lage sch&#228;tze ich weit besser ein, als sie gemacht

wird. Schauen Sie doch einmal in unseren Kleinanzeigenmarkt an: Sie werden

sehen, wieviele Leute verzweifelt 3D-Grafikkarten oder PowerPC-Karten suchen.

Der Markt ist also da, man mu&#223; nur endlich aufh&#246;ren, sich zu bedauern und den

Bedarf befriedigen.</P>





<i> Gibt es abschlie&#223;end noch etwas, was Sie unseren Lesern sagen wollen?</I></P>



Es macht viel Spa&#223;, mit den Amiganern zusammenzuarbeiten - die Reaktionen sind

viel unmittelbarer als anderswo. Sie sollten sich genau diese Eigenschaft und

ihre Herangehensweise an einen Computer erhalten. Genau dann ver&#228;ndert sich

etwas. Auch, wenn wir eines Tages vielleicht alle mit anderen Systemen

arbeiten, werden wir mit unserer Art, an den Computer heranzugehen und

unseren Anspr&#252;chen einen Unterschied machen. Insofern sorge ich mich nicht im

Geringsten um die Zukunft des Amiga-Computings - wo und wie dieses auch

stattfindet.</P>



<i>Im Namen des ganzen NC Teams bedanke ich mich bei Ihnen f&#252;r dieses

Interview!</I></P>



Ich danke Ihnen.</P>







<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
