<html>
<head>
<meta name="description" content="Wolf-INFO">
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue alink=red vlink=blue
bgcolor=gray><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>meine Statements und andere
Nachrichten </b></font></td></tr></table
<table border="0" cellpadding="5" width=100%><tr><td><hr size="4">

<p>Nein heute gibt es keine typische Wolf-INFO. Heute m&ouml;chte ich nur
gerne ein paar Zeilen loswerden und den Text an alle richten.
Urspr&uuml;nglich wollte ich diese Passage in meinem Leserbrief mit
unterbringen, aber dann gefiel mir diese Idee nicht mehr so richtig, denn
...........<br>
Diese Passage habe ich abgeschnitten und verworfen. Ich stelle immer wieder
fest, ich darf meine Finger nicht laufen lassen, wie mir der Schnabel
gewachsen ist. Dies f&uuml;hrt einesteils immer wieder zu
Fehlinterpretationen und andererseits hei&szlig;t es auch: Was hat da der
Wolf wieder f&uuml;r einen gro&szlig;en Schwachsinn abgelassen (oder so
&auml;hnlich). Und das m&ouml;chte ich heute nicht heraufbeschw&ouml;ren.
Nun genug der Vorrede. </p>

<p align=center><font color="800000" size="7"><b>an Alle</font></b></p>

<p>Das neue Jahr hat begonnen und ich hoffe, dass alle den sogenannten
Milleniumwechsel gut und gesund &uuml;berstanden haben. Zur Einleitung des
nun folgenden Abschnittes ein Gedicht: </p>
<br><center><table border=0><tr><td>
Ein neues Jahr nimmt seinen Lauf. <br>
Die junge Sonne steigt herauf. <br>
Bald schmilzt der Schnee, bald taut das Eis. <br>
Bald schwillt die Knospe schon am Reis. <br><br>
Und ob wir nicht bis morgen schaun, <br>
wir wollen hoffen und vertraun.</td></tr><tr><td align=right>(Volksgut)
</td></tr></table></center>

<p>Es gibt ja viele schwachsinnige Verse und auch hier klingt es im ersten
Augenblick danach, als geh&ouml;re dieses Gedicht ebenfalls zu dieser
Kategorie. Und trotzdem verfliegt dieser erste Eindruck sofort und man
liest diese Zeilen ein zweites und auch ein drittes Mal und siehe da, es
ergibt einen Sinn, sogar einen sehr tiefen Sinn. Ohne in die Psychologie
oder in die Parapsychologie abschweifen zu wollen, wenn man den Gedanken an
den abermaligen Verkauf der Amigarechte im Sinne hat und dieses Gedicht
darauf hin nochmals durchliest, dann k&ouml;nnte sich doch ein
wohlwollender rosaroter Streifen am Horizont auftun und es keimt wieder
verst&auml;rkt Hoffnung auf. </p>

<p>Nat&uuml;rlich ist das Gedicht auch auf alles andere anwendbar, nur mir
fiel als erstes das Beispiel des Amigas ein. Kehren wir zum Jahreswechsel
zur&uuml;ck. Nun ist sie also da, die Zwei vor den Nullen. Rein
mathematisch ist dieses Jahr noch das letzte Jahr des alten Jahrtausends,
aber vom Gef&uuml;hl her sind wir doch schon ganz auf das neue, das dritte
eingestellt. W&uuml;nschen wir uns ein gutes Geleit auf unserem Weg
&uuml;ber die Schwelle der Zeit in eine neue, hoffentlich
verhei&szlig;ungsvolle Zukunft. Die NoCover geh&ouml;rte bisher zu den
vertrauten und verl&auml;sslichen Dingen, die uns begleiteten und so
m&ouml;ge es auch in Zukunft bleiben. Dazu geh&ouml;rt aber auch das
Engagement jedes einzelnen, ein klein wenig Zeit f&uuml;r die
NoCover-Leserschaft aufzubringen und einen klitzekleinen Obulus dazu
beizusteuern, damit die NoCover immer wohlgef&uuml;llt, abwechslungsreich
und interessant bleibt. Ein R&uuml;ckblick ist hier &uuml;berhaupt nicht
angebracht, denn das Gestern ist Historie und geh&ouml;rt dem letzten
Jahrtausend an. </p>

<p>Klingt beinahe wie das Wort zum Sonntag, aber es ist meinerseits
ernstgemeint. Es ist kein Wort zum Sonntag, sondern eine ernsthafte
Aufforderung an euer aller Gewissen und Loyalit&auml;t. Und ein gewaltiges
Sch&uuml;tteln und R&uuml;tteln an eurem inneren Schweinehund. Alle wollt
ihr nette, erfrischende Artikel lesen. Und was geschieht? Nichts,
au&szlig;er Schimpfen, dass da herzlich wenig r&uuml;berkommt. Ausreden
gibt es ausreichend, deshalb will ich nun keine h&ouml;ren. Wenn 50 Mann
(oder Frau) nur einen Artikel schreiben, so sind dies schon 50 verschiedene
Beitr&auml;ge. Es m&uuml;ssen nicht Soft- und Hardware Erfahrungen sein. Es
muss ja noch nicht einmal die Neuigkeiten &uuml;ber Amiga sein, die stehen
bestimmt schon alle in Amiga Aktuell, wenn ihr eure neuesten Neuigkeiten an
Carsten weitergeleitet habt. Ein Besuch in Minidom oder Phantasialand mit
netten kleinen Bildern, eine Fahrt auf den Brocken oder was wei&szlig; ich.
Es gibt soviel zu erz&auml;hlen, das man auch so erz&auml;hlen kann, dass
ein Au&szlig;enstehender auch zuh&ouml;rt bzw. es liest. Das soll nun als
Wachr&uuml;tteln reichen. Dass es nichts nutzt, wei&szlig; ich selbst,
schlie&szlig;lich bin ich schon l&auml;ngere Zeit dabei. Aber vielleicht
erwische ich gerade den einen oder anderen der sogeannten Ehemaligen und
dieser f&uuml;hlt in diesem neuen sehr jungen Jahrtausend wieder frischen
Mut und Kraft und rappelt sich auf und meldet sich wieder schriftlich
zur&uuml;ck. Ich w&uuml;rde mich sehr freuen und dies begr&uuml;&szlig;en.
</p><hr size="4">

<p>Nun etwas ganz anderes: In der NoCover-Guide habe ich zwei neue Rubriken
eingerichtet <ol>
<li> MP --&gt; HTML-Umsetzungen </li>
<li> eMail/Homepages. </li></ol>

Glaubt ja nicht, dass ich nur ein einziges Feedback bekommen h&auml;tte.
Nichts!! Rein gar nichts!! Ihr glaubt gar nicht, wie dies motivierend ist.
Wie soll ich da die eMail Adressen auf dem Laufenden halten? Ich wei&szlig;
ja gar nicht einmal, wer alles fehlt und wessen Anschriften falsch sind.
Oder wer gar in dieser Liste &uuml;berhaupt nicht aufgef&uuml;hrt werden
m&ouml;chte. Ist dies denn so schwer, eine kurze Mail an mich zu senden und
die entsprechenden &Auml;nderungen mitzuteilen? </p>

<p>Oder die Rubrik vorher. Hier habe ich alle Artikel von MagneticPages in
das Format HTML umgesetzt, die in der Rubrik "Stichworte" angesprochen
wurden. Text&auml;nderungen habe ich nicht vorgenommen, sogar die
Rechtschreibfehler habe ich belassen. Nur vorhandene Bilder wurden in das
GIF oder JPG-Format konvertiert und auf das Standard
Gr&ouml;&szlig;enverh&auml;ltnis 4:3 umgerechnet, besonders die LORES
Aufl&ouml;sungen. Feedback? Fehlanzeige auf der ganzen Linie. Aus diesem
Grunde habe ich diesbez&uuml;glich auch nicht weitergemacht. Ganz einfach.
<hr size="4"></p>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf">
http://www.chiemgau.com/apc&amp;tcp/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
