
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga OS 3.5 - Was taugt es wirklich?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Amiga OS 3.5</FONT></h1></CENTER></P>

Kaum ein Software Release wurde in den letzten Wochen und Monaten so
sehns&#252;chtig erwartet, wie das Update auf Amiga OS 3.5. Wie der Name schon
preis gibt, handelt es sich dabei lediglich um ein Softwareupdate - das
Kickstart Rom bleibt immer noch das alte. Ich will an dieser Stelle einige
Eindr&#252;cke aus meiner Sicht &#252;ber das Update niederschreiben.</P>

<h2><CENTER><FONT COLOR="YELLOW">Installation &amp;
Anforderungen</FONT></h2></CENTER></P>
Geliefert wird das AmigaOS 3.5 in einem stabilen Pappkarton, wie man ihn
schon von &#228;lteren Versionen kennt. In diesem befindet sich neben der Update
CD noch eine Registrierkarte und eine 8-seitige, zweisprachige (Deutsch und
English) Installationsanleitung, die recht verst&#228;ndlich erkl&#228;rt, wie man das
Update durchzuf&#252;hren hat und auch bei h&#228;ufig auftretenden Problemen Abhilfe
schafft. Bevor man allerdings an`s installieren denken kann, sollte man
zun&#228;chst kl&#228;ren, ob man die n&#246;tigen Hardwareanforderungen &#252;berhaupt erf&#252;llt:
</P>
<u>Minimum:</U></P><UL>

<li> 68020<BR>
<li> 1 MB Chip Ram<BR>
<li> 4 MB Fast Ram<BR>
<li> Festplatte<BR>
<li> CD Rom Laufwerk<BR>
<li> Kickstart 3.1 ROM</P></UL>

<u>Empfohlen:</U></P><ul>
<li> 68040<br>
<li> 2 MB Chip Ram<BR>
<li> 8 oder 16 MB Fast Ram<BR>
<li> Grafikkarte<BR>
<li> Soundkarte</P></UL>

Sollte man diese Vorraussetzungen erf&#252;llt haben, kann man sich an die
Pre-Installation heranmachen. Wie der Name schon verr&#228;t, bereitet diese die
Hauptinstallation vor und kopiert z.B. die Datatypes in ein seperates
Verzeichnis, damit diese deaktiviert sind. Vorraussetzung f&#252;r diese
Pre-Installation ist, da&#223; die WB 3.1 (die sich auch auf der CD befindet)
auf einer Partition installiert ist. Ist dieser Vorgang erledigt, geht`s
endlich an`s Eingemachte, n&#228;mlich an die Hauptinstallation. Sp&#228;testens hier
f&#228;llt auf, da&#223; der Installer grundlegend &#252;berarbeitet wurde und nun auch auf
einem eigenen Screen ge&#246;ffnet und mit Bildern unterlegt werden kann. Im
Verlauf der Hauptinstallation werden u.a. einige Befehle geupdatet und die
Glow Ikons (schreibt man neuerdings mit &quot;k&quot; - im weiteren Verlauf des Artikels werde ich allerdings wieder Icons schreiben) auf die Platte kopiert. Auf
meinem 4000er funktionierte dies absolut einwandfrei und es ging im Grunde
auch alles recht schnell; auf jeden Fall wesentlich schneller und
unkomplizierter als das Update von Windows 95 auf Windows 98. Auf dem UAE
(Amiga Emulator) ging es aber nach der Pre - Installation nicht mehr weiter,
da der Emulator die CD nicht mehr erkannt hat. Damit ist das eigentliche
Update schon vollzogen. Wer will, kann jetzt noch die Internet Tools (AWeb,
Amiga Mail, Miami etc.), die PPC Software (Warp Up) und einen CD Rom Treiber
in das System einbinden lassen. Im Gegensatz zu Windows ist dies aber alles
optional, so da&#223; keine &#252;berfl&#252;ssigen Web Browser, die man gar nicht auf der
Festplatte haben will, einen sp&#228;ter st&#246;ren. Ach ja: Ein weiteres Feature des
neuen OS 3.5 besteht darin, da&#223; man sich eine Notfalldiskette erzeugen
lassen kann, mit der man das System, sollte mal irgendetwas nicht
funktionieren, wieder starten kann. Diese Notfalldiskette erfordert aber
zwingend die Original AmigaOS 3.5 CD, da von dieser gebootet werden muss
(entsprechende GraKa Software wird mitkopiert).</P>

<h2><CENTER><FONT COLOR="WHITE">Der erste Eindruck</FONT></CENTER></h2></P>
Den bleibensten Eindruck vom neuen OS hinterlassen ohne Frage die Glow
Icons, die das komplette System grafisch aufpeppen und zeitgem&#228;&#223; erscheinen
lassen. Eine F&#252;lle dieser Glow Icons f&#252;r viele Applikationen befinden sich
gleich mit auf der AmigaOS 3.5 CD bzw. sind im Aminet (und den
entsprechenden CD`s) zu finden. Die Optik wird aber ebenso von einer
weiteren Neuerung gepr&#228;gt: So sind s&#228;mtliche Voreinsteller der WB
&#252;berarbeitet worden und laufen von nun an mit dem GUI System &quot;ReActor&quot; (eine
Weiterentwicklung von &quot;Class Act&quot;) und sehen dementsprechend modern aus. Hier und da wurden sogar
noch einige neue Symbole in die Voreinsteller (z.B. Locale) integriert, was
den neuen Look abrundet. Nat&#252;rlich kann man auch die Optik, sollte diese
einem nicht zusagen, auch ver&#228;ndern, was sich mittels des neuen
Prefs Programm &quot;ReActor&quot; leicht bewerkstelligen l&#228;sst. Und da wir gerade bei
den neuen Prefs Programmen sind: Dort befindet sich nun auch ein
Voreinsteller der sich &quot;Workbench&quot; nennt. Hier kann man z.B. Ger&#228;te verstecken (z.B. evtl. vorhandene
Macintosh Partitionen) und die Qualit&#228;t der Icons festlegen. Ebenfalls die
Optik beeinflussend ist die grafische F&#252;llanzeige (wie zu OS 1.3 Zeiten) am
linken Rand der Fenster. Zwar gew&#246;hnt man sich daran und f&#252;r den einen oder
anderen wird dieses Feature sicherlich n&#252;tzlich sein, aber man sollte in
weiteren Updates unbedingt noch eine Deaktivierung dieser grafischen
F&#252;llanzeige integrieren.</P><CENTER><img src="ksos3.jpg"></CENTER></P>

Wesentlich wichtiger als die optischen Leckerbissen sind aber die
Neuerungen, die OS 3.5 mitbringt. So hat man es endlich geschafft, die
&#228;u&#223;erst l&#228;stige 4 GB Limitation bei Festplatten zu beseitigen, was im
Hinblick auf die momentanen Festplattenpreise auch &#228;u&#223;erst notwendig war.
Selbiges gilt auch f&#252;r den Bereich der Druckertreiber: Mit OS 3.5 befinden
sich endlich wieder einmal aktuelle Modelle im Umfang des Betriebssystem und
auch das Printer Device wurde, im Bezug auf Schnelligkeit, gr&#252;ndlich
&#252;berarbeitet, was auch dringend notwendig war. Auch wenn es seit Jahren die
alternativen L&#246;sungen &quot;Turbo Print&quot; und &quot;Studio&quot; gibt, so bewerte ich diese
Entwicklung eindeutig positiv, denn nicht jeder ist bereit, nur f&#252;r einen
Druckertreiber nochmals eine Stange Geld zu lassen. Mal abgesehen davon:
Sollten demn&#228;chst neue Amiga`s erscheinen, die dann nat&#252;rlich auch mit OS
3.5 auf den Markt kommen, sind diese wesentlich einsteigerfreundlicher, da
nicht jeder Neuling bereit ist, f&#252;r weitere 100 DM ein modernes
Druckertreibersystem zu kaufen, wenn er dieses bei der Konkurrenz
(Windows) umsonst bekommt.</P>

Auch &quot;unter der Haube&quot; wurde einiges verbessert: So wurde z.B. das
Datatypesystem sowie MultiView &#252;berarbeitet und an heutige Bed&#252;rfnisse
angepasst, was sich besonders in der Geschwindigkeit bemerkbar macht. Aber
auch die 68040.library, die asl.library und diverse Kommandos im C
Verzeichniss (u.a. &quot;join&quot;, &quot;loadwb&quot;, &quot;iprefs&quot;, &quot;list&quot;, &quot;info&quot; etc.) wurden
erneuert und aufgebessert, was sich nicht nur bei der t&#228;glichen Arbeit mit
dem CLI, sondern auch beim &quot;normalen&quot; Arbeiten mit der Workbench bemerkbar
macht. Letztere verf&#252;gt nun &#252;brigens auch &#252;ber eine neue Funktion namens
&quot;Gr&#246;&#223;e anpassen&quot; mit der man das aktuelle Fenster so vergr&#246;&#223;ern /
verkleinern kann, da&#223; alle Icons genau erfasst werden - nicht
lebensnotwendig, aber auf jeden Fall sinnvoll. Und f&#252;r Fans der Ordnung kann
man nun auch die Piktogramme nach &quot;Namen&quot;, &quot;Datum&quot;, &quot;Gr&#246;&#223;e&quot; und &quot;Art&quot;
aufr&#228;umen.</P>

Abgerundet wird die &quot;neue&quot; Workbech durch zahllose weitere neue Funktionen,
die aber den Rahmen dieses Berichtes sprengen w&#252;rden. So ist nun z.B.
endlich (!) ein systemkonformer, handlicher Texteditor namens &quot;Edit Pad&quot;
vorhanden, mit dem man schnell Texte wie z.B. die User Startup &#228;ndern kann.
Auch die ARexx Schnittstelle, &#252;ber die die Workbench seit neuestem verf&#252;gt,
die verbesserten M&#246;glichkeiten im Kopierbereich (man kann nun auch mit
der Maus mehrere Icons auf einmal verschieben / kopieren) und die
verbesserten Systemmeldungen, die mitunter wesentlich aussagekr&#228;ftiger sind,
sollten zumindest mal erw&#228;hnt werden. Was ich an dieser Stelle noch anmerken
m&#246;chte, ist die Tatsache, da&#223; ich den subjektiven Eindruck habe, da&#223; das
System jetzt stabiler als zuvor mit OS 3.0 l&#228;uft. Mag aber auch sein, da&#223;
ich mich jetzt t&#228;usche...</P>

Ach ja: Auf der OS 3.5 CD befinden sich ferner noch die &#252;berarbeiteten
Handb&#252;cher im system&#252;bergreifenden HTML und PDF Format sowie einige weitere
Tools, Demos und Spiele, die man einfach mal ausprobieren sollte (z.B. die
Grafikkartensystem &quot;Picasso 96&quot; und &quot;CyberGFX 3.0). Auch einige zus&#228;tzliche
Icon Pakete f&#252;r verschiedene Software sind hier zu finden, so da&#223; man ohne
z&#246;gern die Glow Icons als neues Iconset auf &quot;seiner&quot; Workbench verwenden
sollte. Mit erscheinen dieses Artikels werden wahrscheinlich schon
zahlreiche weitere Glow Icon`s von verschiedenen Usern im Aminet zu finden
sein, so das bald wirklich alle Bereiche abgedeckt sein d&#252;rften.</P>
<CENTER><img src="ksos2.jpg"></CENTER></P> 


<h2><CENTER><FONT COLOR="BLUE">Kompatibilit&#228;t?</FONT></h2></CENTER></P>
Im Vorfeld wurden viele Bedenken ge&#228;u&#223;ert, ob es zu Problemen mit
verschiedenen Patches kommen kann. Fest steht, da&#223; einige Tools unter OS 3.5
die Arbeit verweigern. Bei mir war es aber gl&#252;cklicherweise so, da&#223; alle
Tools nach wie vor einwandfrei funktionieren: So vertragen sich z.B. &quot;MCP&quot;,
&quot;Madhouse&quot;
und &quot;WBPattern&quot; hervorragend mit OS 3.5. Selbiges gilt auch f&#252;r alle
Anwendungsprogramme und Spiele: Ich habe bisher noch keine einzige
Applikation gefunden, die unter OS 3.1 gelaufen ist, aber unter OS 3.5 ihren
Dienst verweigert. Insofern w&#252;rde ich einfach mal sagen, da&#223; OS 3.5 nahezu
hunderprozentig kompatibel zu OS 3.1 ist; Sorgen, da&#223; das favorisierte Tool
nicht mehr l&#228;uft, braucht man sich also nicht zu machen. </P>

<h2><CENTER><FONT COLOR="RED">Internet</FONT></h2></CENTER></P>
Ein unabdingabres Muss eines modernen Betriebssystems ist sicherlich der
Support des Internets bzw. die transparente Einbindung vom selbigen in das
Betriebssystem. Auch hier haben Haage &amp; Partner einen guten Mittelweg
gefunden: Da eigene Entwicklungen zu aufwendig und teuer gewesen w&#228;ren, hat
man einfach Fremdprodukte f&#252;r OS 3.5 lizensiert. So liegt z.B. der Web
Browser &quot;A Web&quot; in einer SE Version 3.3 dem Paket bei. Ich pers&#246;nlich mag
diesen zwar nicht alzu sehr, aber wer diesen nicht benutzen will, kann ja
auch auf die Konkurrenz &quot;IBrowse&quot; und &quot;Voyager&quot; zur&#252;ckgreifen. Ferner hat
man noch &quot;Miami&quot; (leider nur eine zeitbegrenzte Demo, da die OEM Version nicht rechtzeitig fertig
geworden ist - registrierten Usern wird die Vollversion aber demn&#228;chst gratis nachgeliefert) und
das E-Mail Tool &quot;Amiga Mail&quot; beigelegt. Warum man den Quasi Standard &quot;YAM&quot; aber
ignoriert hat ist, zumindest mir, unklar, da &quot;YAM&quot; wesentlich mehr
Funktionen bietet und zudem auch plattform&#252;bergreifend zu dem besten z&#228;hlt,
was es im Bereich der E-Mail Programme so gibt. Na ja, dieses kleine Manko
st&#246;rt auch nicht weiter, da &quot;YAM&quot; ohnehin Freeware ist und kostenlos im
Aminet bezogen werden kann. Komplett neu ist hingegen die &quot;email.library&quot;,
mit der man auf einfache Weise E-Mails aus jeder Applikation (z.B.
Textverarbeitung etc.) versenden kann. Vorraussetzung daf&#252;r ist nat&#252;rlich,
da&#223; die Software diese Library auch unterst&#252;tzt, womit aber stark gerechnet
werden kann. Alleine dieses simple Beispiel zeigt einmal mehr, wie flexibel
das AmigaOS doch ist und mit welchen einfachen Mitteln moderne Features
integriert werden k&#246;nnen.</P><CENTER><img src="ksos1.jpg"></CENTER></P>



<h2><CENTER><FONT COLOR="GRAY">Fazit</FONT></h2></CENTER></P>
Insgesamt ist OS 3.5 eines der wichtigsten Softwareprodukte der letzten 2
Jahre. Es ist klar, da&#223; man mit diesem einem Update nicht alles auf den
aktuellen Stand der Dinge bringen kann, aber ich finde, alles in allem ist
OS 3.5 ein gro&#223;er Schritt in Richtung Konkurrenz, die man bei einigen Sachen
sogar gleich hinter sich l&#228;&#223;t. Damit es in Zukunft noch weitere Updates gibt
(die, ich betone es hier, enorm wichtig f&#252;r die Zukunftd es Amiga`s sind !),
sollte sich jeder Amiganer OS 3.5 f&#252;r 100 DM schnellstens zulegen - eine
Empfehlung kann ich ohne Bedenken aussprechen.</P>

Anmerkung: Zum Zeitpunkt dieses Berichtes wurden insgesamt etwas &#252;ber 12.000
Einheiten verkauft. Die Deadline liegt aber bei 25.00; also haben wir
gerade mal die H&#228;lfte erreicht. Die User, die sich OS 3.5 noch nicht
gekauft haben - oder gar eine Raubkopie benutzen - sollten sich
schnellstmöglich zum nächsten Hädnler begeben und OS 3.5 dort kaufen!</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
