
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Boing Bag Volume I</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="GREEN">Update f&#252;r OS
3.5</FONT></CENTER></h1></P>

Noch vor dem Jahreswechsel ist schon das erste Update f&#252;r das neue Amiga OS
3.5 mit dem klangvollen Titel &quot;Boing Bag&quot; herausgekommen. Passend zum OS 3.5
Test in dieser Ausgabe gibt`s also auch schon einen kleinen Bericht &#252;ber das
erste Update.</P>

<h2><CENTER><FONT COLOR="YELLOW">Der Inhalt des Boing
Bag`s</FONT></CENTER></h2></P>
Wichtigster Bestandteil des &quot;Boing Bag`s&quot; ist sicherlich das neue Tool &quot;Anim
Icon&quot; mit dem man animierte Icons auf den Workbench Screen zaubern kann
(als App Icons). Diese Animationen k&#246;nnen sowohl Gif Animationen als auch
Transferanimationen von Web Browsern sein. Ein Beispiel ist dem &quot;Boing Bag&quot;
auch gleich beigef&#252;gt: Das &quot;Christams Pack&quot;. Wie nicht anders zu erwarten
besteht dieses aus einigen Gif Animationen, Sounds und Hintergrundbildern,
die richtige Weihnachtsstimmung aufkommen lassen. Und auch wenn Weihnachten
mitlerweile schon vorbei ist: Ich muss sagen, da&#223; die Animationen sehr gut
aussehen und die Workbench noch einen Tick moderner machen. Im Aminet
befinden sich übrigens schon jetzt viele Animationen, die als Icon in Frage
kommen.
</P>

Aber es wurden auch bekannte Dinge weiter &#252;berarbeitet: So hat man kleinere
Bug`s gefixt und diverse Commandos nochmals &#252;berarbeitet. Unter anderem
wurden die Commandos &quot;IPrefs&quot;, &quot;Set Patch&quot; und &quot;Format&quot; nochmals erweitert
und verbessert, was das System nochmals stabilisieren sollte. Aber auch bei
den Voreinstellern wurde der eine oder andere kleine Fehler bereinigt (u.a.
funktioniert jetzt das Schlie&#223;symbol des &quot;WB Pattern&quot; Voreinstellers
korrekt); selbiges gilt auch f&#252;r die Commodities und den Text.datatype.
Letztendlich wurden (laut Anleitung) noch einige interne Dinge ver&#228;ndert,
die ebenfalls merklichen Einfluss auf die Stabilit&#228;t des Systems haben
sollen.</P>

Aufgrund der Kritik einiger User die Anleitung betreffend (selbige war
n&#228;mlich ein einziges HTML File mit massig Bildern - die Wartezeiten bei der
Darstellung kann man sich wohl vorstellen) wurde ein neues Tool namens
&quot;Nicer Docu&quot; generiert, welche die Anleitung in einzelne Abschnitte aufteilt
und die Dokumentation auf die Festplatte kopiert. Das alles wird &#252;brigens
durch den neuen Installer bewerkstelligt,der auch hier mal wieder seine
Flexibilit&#228;t zeigt.</P> 

Zus&#228;tzlich zu den Verbesserungen gibt`s noch die aktuelle Version 2.0 der
Picasso Software, einige OS 3.5 Tools, den InstallerNG sowie eine HTML Guide
f&#252;r den Zugang mittels Miami zum B&#252;rgernetz.</P><CENTER>
<img src="bb1.jpg"></P><BR>
Leider kommen die animierten Icons als Standbild nicht so gut rüber
:-((</P></CENTER>

<h2><CENTER><FONT COLOR="WHITE">Fazit</FONT></CENTER></h2></P>
Ersteinmal muss ich sagen, da&#223; ich es echt gut finde, da&#223; schon nach so
kurzer Zeit ein Update zum AmigaOS 3.5 erschienen ist, welches zudem noch
kostenlos erh&#228;ltlich ist. Die Neuerungen, die damit eingef&#252;hrt wurden, sind
zwar nicht gravierend, aber immerhin l&#228;uft damit das System noch stabiler
bzw. robuster. Wer also OS 3.5 hat, kommt um dieses Update nicht herum und
sollte es sich am besten noch heute aus dem Netz laden. Sch&#246;n, da&#223; auch noch
nach dem Release von OS 3.5 weiter am Amiga Betriebssystem gefeilt wird!</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
