<html>
<head>
<title>Der Filmtext</title>
</head>

<body bgcolor="#faeadb" text="#3c2120" link="#631000" alink="#631000"
vlink="#631000" background="schaetze/mm_schaetze2a.gif"><center>

<table border="0" cellpadding="0" cellspacing="0" frame width="350" bgcolor="#ffffff">
<tr>
<td valign="top" width="1">
<font size="2"><img height="63" width="350" src="mm_schaetze3.gif"><br></font>
</td>
</tr>
</table>
<table border="0" cellpadding="0" cellspacing="0" frame width="350" bgcolor="#ffffff">
<tr>
<td valign="top" bgcolor="#631000" width="1">
<font size="2"><br></font>
</td>
<td width="4">
<br>
</td>
<td width="340" valign="top">
<div align="left"><font size="2">

Eine Legende erz&auml;hlt, da&szlig; schon vor langer, langer Zeit Menschen
in der unwegsamen Bergwelt der philippinischen Cordilleren lebten. Sie
ern&auml;hrten sich nur von Wild und Wurzeln. Obwohl sie geschickte
J&auml;ger waren, herrschte immer wieder Hunger.Eines Tages verirrte sich
ein J&auml;ger namens Wigan in dem feuchten Tropenwald. Pl&ouml;tzlich fand
er an den H&auml;ngen seltsame Pflanzen. Er s&auml;te die K&ouml;rner aus,
bew&auml;sserte sie und seit dieser Zeit leben die Menschen im Norden der
Philippinen vom Segen des Gottes Mah-Nongan - so die Legende der
Ifugao.<br><br>

Reisfelder, soweit das Auge reicht, bis in eine H&ouml;he von 1600 Metern.
Wie dichtgewebte Teppiche &uuml;berziehen sie die Bergh&auml;nge der Insel
Luzon im Norden der Philippinen. Steil ragen die Stufen zum Himmel.
W&uuml;rde man die Steinmauern und Lehmw&auml;lle der Terrassen
aneinanderreihen, w&uuml;rden sie den halben Erdball umspannen. Vor
&uuml;ber 2000 Jahren schon wurden die ersten Felder angelegt. Ihre
Baumeister waren die Ifugao, ein Bauernvolk, das vermutlich aus Indonesien
eingewandert war. Die Reisterrassen der Ifugao - eine einzigartige
Kulturlandschaft, ein Meisterwerk der Bew&auml;sserungstechnik und der
Terrassenbaukunst. Seit 1995 z&auml;hlt diese Landschaft, die sich
&uuml;ber eine Fl&auml;che von rund 20.000 Quadratkilometern erstreckt, zum
Weltkulturerbe. Aber wie lange werden diese Terrassen ihre Besitzer noch
ern&auml;hren?<br><br>

Versteckt hinter hohen Bergen, nur nach zweist&uuml;ndigem Fu&szlig;marsch
&uuml;ber schmale Pfade erreichbar, liegt Batad. Wie ein Amphitheater
schmiegen sich die Reisterrassen um das Dorf, bilden eine untrennbare
Einheit. Batad hat 1500 Einwohner. Fast alle leben noch in den
traditionellen Stelzenh&auml;usern aus Holz mit weit heruntergezogenem
Cogon-Grasdach und nur einem Raum f&uuml;r die ganze Familie. In Batad gibt
es keine Fernseher, keine Computer, keine K&uuml;hlschr&auml;nke, kein
Telefon. Batad hat keinen Stromanschlu&szlig;. F&uuml;r die zahlreichen
Kinder gibt es eine Grundschule, aber der n&auml;chste Arzt ist weit
entfernt.<br><br>

Familie Ahmena auf dem Weg zu ihrem Reisfeld. Wie jeden Tag gibt es viel zu
tun, obwohl ihr Feld nur klein ist. Die vier &auml;ltesten Kinder von
Gregorio und Christina sind noch in der Schule. Normalerweise m&uuml;ssen
auch sie mithelfen, denn jede Hand wird gebraucht und Maschinen gibt es in
Batad keine.<br><br>

&quot;Tinawon&quot; hei&szlig;t der k&auml;lteresistente Reis, der in Batad
in fast 1.000 Meter H&ouml;he w&auml;chst. Wie die anderen Ifugaobauern
pflanzen auch Gregorio und Christina nur traditionelle Sorten. Moderne
Z&uuml;chtungen sind zwar ertragreicher, aber anf&auml;lliger f&uuml;r
Ungeziefer. Und sie kosten viel Geld f&uuml;r D&uuml;nger - den kann sich
hier niemand leisten. Ausgepflanzt wird bei den Ifugao im Februar und
M&auml;rz. &Uuml;ber tausend Arbeitsstunden kommen zusammen, um einen ha
Reisland zu bewirtschaften - und das bei nur einer Ernte im Jahr. 2-3
Monate sind diese Sch&ouml;&szlig;linge alt. Es wird noch rund vier Monate
dauern, bis geerntet werden kann. Land ist knapp im Norden der Philippinen.
Jeder verf&uuml;gbare Meter wird genutzt, um den Bergen das
Grundnahrungsmittel abzuringen. Keine Parzelle ist regelm&auml;&szlig;ig,
die meisten Felder nur wenige Quadratmeter gro&szlig;, angepasst an die
Form des Gel&auml;ndes. <br><br>

Die Ifugao-Baumeister schufen mit ihren Reisterrassen eine
Landschaftsarchitektur, die Funktion und Form, Nutzen und &Auml;sthetik
miteinander verbindet - wie kaum eine andere Kulturlandschaft. Unkraut
j&auml;ten, den Reis pflegen und die Terrassen instand halten,
besch&auml;ftigt Familie Ahmena das ganze Jahr. Auspflanzen und Ernten
nehmen nur einen Monat in Anspruch. Viele Familien in Batad m&uuml;ssen
stundenlang laufen, um auf ihre Felder zu gelangen. Gregorio und Christina
haben das Gl&uuml;ck, da&szlig; ihre Felder nahe beim Dorf liegen. Die
Ifugao dreschen ihren Reis nicht, sondern bewahren ihn in B&uuml;ndeln auf.
Jeden Morgen und jeden Abend wird er f&uuml;r die Mahlzeiten von den Rispen
gestreift und anschlie&szlig;end entspelzt und gestampft. Die K&ouml;rner
sind klein und haben einen aromatischen Geschmack. &quot;S&uuml;&szlig; wie
Schokolade&quot;, meint Christina Ahmena. Alles, was die Familien ernten,
ist f&uuml;r den Eigenbedarf bestimmt - aber selbst daf&uuml;r reicht der
Reis nicht aus. Nach einem halben Jahr schon ist die Ernte aufgebraucht.
Und dann m&uuml;ssen die Ifugao Hochertragssorten aus dem Tiefland
dazukaufen. Fr&uuml;her habe man beim Stampfen fr&ouml;hliche Lieder
gesungen, erz&auml;hlen die Frauen. Heute machen sie sich nur noch Sorgen,
wie es weitergehen soll und achten darauf, da&szlig; kein Reiskorn
danebenf&auml;llt. Gregorios Urahnen galten bis ins 19. Jahrhundert hinein
als ber&uuml;chtigte Kopfj&auml;ger. Missionare trauten sich lange nicht in
die abgelegene Bergwelt. Erst nach dem Zweiten Weltkrieg wurden die Ifugao
katholisch. Gregorio ist getauft und geht jeden Sonntag zur Messe, doch
wenn es um seinen Reis geht, vertraut er auf andere Gottheiten.<br><br>

In uralten Ritualen werden H&uuml;hner geopfert, mit Reisschnaps geweiht.
Das Opfer soll die G&ouml;tter g&uuml;nstig stimmen und die Seele des
Reises gesund erhalten. Auch heute noch betrachten die Ifugao den Reisanbau
als Partnerschaft zwischen G&ouml;ttern und Menschen. Alltag und Feste sind
ausgerichtet nach dem Rhythmus der Reiskultur. Das Dorfoberhaupt tritt in
Kontakt mit den f&uuml;r den Reisanbau zust&auml;ndigen G&ouml;ttern und
Geistern. Aus den Eingeweiden prophezeit er nicht nur, ob die Ernte gut
ausfallen wird, sondern gibt auch Prognosen &uuml;ber Wohlstand und
Gesundheit der Dorfbewohner. Weil Fleisch knapp ist in Batad, entwickelt
sich jedes Opfer zu einem Festessen. Und so bedanken sich die Dorfbewohner
nicht nur bei den Naturg&ouml;ttern, sondern auch bei ihrem christlichen
Gott f&uuml;r die willkommene Abwechslung. Noch ist die Ifugao-Region ein
gut funktionierendes &Ouml;kosystem. Der gr&ouml;&szlig;te Teil des Waldes
ist Wasserspeicher, gilt als heilig und ist dadurch gesch&uuml;tzt. Er kann
auch nicht verkauft werden. Der tiefergelegene Nutzwald zum Bauen und
Heizen wird immer wieder aufgeforstet. Zwischen den Reisfeldern gibt es nur
wenige Gem&uuml;sefelder, soviel der Boden hergibt und die Familien
brauchen. <br><br>

Oft schlafe er nachts nahe der Felder, vertreibe mit Feuerwerkskrachern die
V&ouml;gel. Oder schaue nach, ob gen&uuml;gend Wasser auf dem Feld steht,
erz&auml;hlt Gregorio. Immer g&auml;be es Probleme mit der
Wasserverteilung, obwohl doch noch gen&uuml;gend Wasser da sei und ein
ausgekl&uuml;geltes Netz von Kan&auml;len die ganze Gegend durchzieht.
Wasserverteilung sei hier M&auml;nnersache. Und niemals d&uuml;rften die
Terrassen trockenfallen. Das nimmt Gregorio ganz genau. Zweieinhalb bis
sieben Zentimeter seien die ideale Wasserh&ouml;he, damit sich wenig
Unkraut bildet und die Ernte gut ausf&auml;llt. Ob seine Kinder die
m&uuml;hselige Arbeit fortf&uuml;hren? Gregorio ist skeptisch. Wenn er
stirbt, wird er sein Reisland seiner &auml;ltesten Tochter vererben und die
Felder nicht mehr unter allen Geschwistern aufteilen, wie es fr&uuml;her
&uuml;blich war. Denn dann w&uuml;rde niemand mehr satt. Die Reis&auml;hren
sehen dieses Jahr gut aus und Gregorio ist zufrieden. Im August wird er
rund 300 Kilogramm Reis ernten. Aber das ist nur ein Viertel dessen, was
ein Tieflandreisbauer mit modernen Sorten und zwei Ernten im Jahr bei
gleicher Fl&auml;che erreicht. Gregorio m&ouml;chte die alten Traditionen
nicht aufgeben - aber immer mehr, vor allem die Jungen, denken
anders.<br><br>

In Banaue, der etwa 30 Kilometer entfernten Kreisstadt, wird schneller Geld
verdient als auf dem Feld. Hier arbeiten Ifugao als Tricyclefahrer f&uuml;r
die Touristen, als Souvenirh&auml;ndler, in Restaurants und Hotels.<br><br>

Wer das moderne Leben in Banaue kennengelernt hat, will nicht mehr
zur&uuml;ck in den Schlamm der Reisfelder - und die verfallen. 80% der
Jungen verlassen ihre D&ouml;rfer, ziehen Betonh&auml;user mit
flie&szlig;end Wasser dem Leben in der H&uuml;tte vor - sei es in Banaue
oder in Manila. 2.000 Jahre lang waren die Reisterrassen Lebensgrundlage
und Identit&auml;t der Ifugao. Heute sind sie &ouml;konomisch
&uuml;berholt, der Reisanbau lohnt sich fast nicht mehr. Werden die
Terrassen nicht gepflegt, verfallen sie schnell. Mit ihnen sterben alte
Reissorten und jahrhundertelang &uuml;berlieferte Kenntnisse -was zum
unwiederbringlichen Verlust dessen f&uuml;hrt, was noch immer Weltwunder
genannt wird. Museales Konservieren allein wird das Weltkulturerbe nicht
sch&uuml;tzen. Schl&ouml;sser, Burgen oder Aq&auml;dukte kann man auch ohne
ihre urspr&uuml;nglichen Nutzer erhalten. Aber die Baukunst der Ifugao wird
die modernen Zeiten nur &uuml;berleben, solange sich die M&uuml;he lohnt,
auf diesen Terrassen Reis anzupflanzen. Wenn die Menschen dem Reis zu wenig
Respekt zollen, so glauben die Ifugao, entfernt sich seine Seele, und der
Reis stirbt.<br><br>

Buch und Regie: Elke
Werry<br></font></div>

</td>
<td width="4">
<br>
</td>
<td width="1" bgcolor="#631000">
<br>
</td>
</tr>
</table>
<table border="0" cellpadding="0" cellspacing="0" frame width="350">
<tr>
<td valign="top" width="1">
<a href="javascript:history.back()"><img height="44" width="350"
src="mm_schaetze3a.gif" border="0"></a>
</td>
</tr>
</table>
</center></body></html>
