<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat etwas Sch&ouml;nes gefunden</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="mm_schaetze.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</p>

<p align=center><font color="#000080" size="7"><b>Sch&auml;tze der Welt</b></font></p>

<table border="0" width=100%><tr><td>
<table border="0" cellpadding="0" cellspacing="0" frame width="350" bgcolor="#ffffff">
<tr>
<td valign="top" width="1"><img height="63" width="350" src="mm_schaetze0.jpg"><br>
</td>
</tr>
</table>
<table border="0" cellpadding="0" cellspacing="0" frame width="350" bgcolor="#ffffff">
<tr>
<td valign="top" bgcolor="#631000" width="1"><font size="2"><br>
</font></td>
<td width="4"><br>
</td>

<td width="340" valign="top"> <font size="-1" color = "#000000"><br>
Auschwitz, Hiroshima, das s&uuml;dafrikanische Robben Island, Abomey in
Benin und die russischen Solowetzky-Inseln - f&uuml;nf Denkm&auml;ler des
UNESCO-Weltkulturerbes, die f&uuml;r Verbrechen gegen die Menschlichkeit
stehen. In der Reihe &quot;Erbe der Menschheit&quot; stellen wir sie Ihnen
vor - im Dezember jeweils Sonntags in 3sat und am darauf folgenden Samstag
als Wiederholung im S&Uuml;DWEST Fernsehen. <br>
<br>
</font> </td>
<td width="4"><br>
</td>
<td width="1" bgcolor="#631000"><br>
</td>
</tr>
</table>
</td><td> &nbsp; &nbsp; </td><td valign=top>

Mit diesem Banner und diesem Text beginnt die aufgerufene Website <b> <font
color="#0000ff"><a href="http://www.schaetze-der-welt.de">www.schaetze-der-welt.de</a></font></b>. Sie wird vom
S&uuml;dwest-Rundfunk erstellt und ist meines Erachtens eine hervorragende
Homepage. Diesen Schirm also einfach wegklicken und schon befindet man sich
auf der Startseite. </td></tr></table>

<p><img src="mm_schaetze1.gif" width=320 heigth=240 align=left alt=""
hspace=6> Und so sieht die Eingangsseite aus. Auf dieser Homepage werden
die einzigartigen Natur- und Kulturdenkm&auml;ler von den f&uuml;nf
Kontinenten der Welt multimedial dargestellt - ausgew&auml;hlt von der
UNESCO (der Kulturorganisation der UNO). Wer mit seinem Browser den
Realplayer nutzen kann, kommt in den Genuss, durch die virtuelle Welten zu
wandern. Aber auch ohne den 15-min&uuml;tigen Film &uuml;ber den Serengeti
Nationalpark oder dem virtuellen Rundgang durch die Ruinenstadt Machu
Picchu ist es ein regelrechtes Vergn&uuml;gen die Bildergalerien und die
Texte zu betrachten. Hinter dieser unspektakul&auml;ren Fassade der
Startseite vergbirgt sich eine der sch&ouml;nsten und interessantesten
deutschsprachigen Webseiten: Hier wird das Weltkulturerbe der Menschheit
multimedial pr&auml;sentiert. <br clear=all></p>

<p>Bevor ich viel Luft erz&auml;hle, zeige ich einfach mal eine Seite im
Original. <a href="schaetze/mm_schaetze2.html"
target="_top"><b>Hier</b></a> einfach draufklicken. Die Javasripts und
Linkanweisungen habe ich bestehen lassen, sie funktionieren aber nicht, da
ich die externen Scripte nicht mit eingebunden habe. Wie ihr nun auch
gesehen habt, den Film habe ich nicht gezogen und auch die ganze Galerie
nicht. Aber den <a href="mm_schaetze3.html"><b>Filmtext</b></a>. Ja ich
wei&szlig;, ich kann schon die Stellungsnahme im n&auml;chsten Feedback
erahnen. Aber den Zweien, denen dieser Artikel nicht gef&auml;llt, weil
kein Amiga drin vorkommt, k&ouml;nnen ja andere Texte lesen, die auch nicht
da sein werden. Aber es gibt wirklich viele unter uns, die wahrscheinlich
gerne einmal einen Blick auf diese vorgestellte Homepage richten
m&ouml;chten. Die Vorstellung und die Auswahl des heutigen Themas wurde
ganz willk&uuml;rlich vorgenommen. </p>

<p><img src="mm_schaetze1a.gif" width=320 heigth=240 align=left alt=""
hspace=6>Hier nun mal die Auswahl f&uuml;r Asien: <br>

<b>Gro&szlig;e Mauer</b><br>

<font size="-1">Die alten Chinesen hielten die gro&szlig;e Mauer f&uuml;r
einen Drachen, aus dessen geschwungenem Schweif die Nation entsprungen
ist.<br><br>Zahlreiche blumige Sagen ranken sich um sie, dabei ist ihre
wahre Geschichte noch erstaunlicher als alle Fabeln. Mit fast
f&uuml;nftausend Kilometern ... </font> </p>

<p><b>Borobudur: Buddhistische Tempelanlagen von Borobudur</b><br>

<font size="-1"> Buddha ist allgegenw&auml;rtig auf Borobodur. Die Statuen,
die ihn darstellen, sind kaum zu z&auml;hlen. Pilger suchen hier die
Erleuchtung. Den Gelehrten aber gibt Borobodur R&auml;tsel auf. Wozu dieses
Heiligtum auf der Insel Java einmal diente, wei&szlig; heute keiner mehr
genau. ... </font> </p>

<p><b>Aleppo: Altstadt von Aleppo</b><br>

<font size="-1">Aleppo, die alte syrische Stadt, ist von jeher ein
gro&szlig;er Marktplatz gewesen. Nichts ist reizvoller als in dieser
arabischen Stadt in das endlose Gassengewirr des Suks einzutauchen. Hinter
dem Antiocha-Tor aus dem 12. Jahrhundert beginnt der Suk - ein Basar aus
kilometerlangen, ... </font> </p>

<p><b>Palmyra: Ruinen von Palmyra</b><br>

<font size="-1">Palmyra, das ist die Palmenreiche, die gro&szlig;e Oase auf
halbem Weg zwischen Euphrat und Mittelmeer. Eine arabische Stadt, die auch
zu r&ouml;mischer Zeit unabh&auml;nigen Handel betrieb.<br><br>Im 2. und 3.
Jahrhundert war Palmyras gro&szlig;e Zeit. Das Gesch&auml;ft mit den
Karavanen ... </font> </p>

<p><b>Petra: Ruinen von Petra</b><br>

<font size="-1">Vom dritten Jahrhundert v. Chr. bis zur &Uuml;bernahme
durch das R&ouml;mische Imperium im Jahre 106 unserer Zeitrechnung war
Petra das Zentrum eines m&auml;chtigen Stammes im vorderen Orient, der
Nabat&auml;er.<br><br>&quot;Fels&quot; bedeutet der Name der Totenstadt
Petra im Tal Moses in ... </font> </p>

<p><b>Q'useir Amra: W&uuml;stenschlo&szlig; Q'useir Amra</b><br>

<font size="-1">Ein Schloss in der jordanischen W&uuml;ste, auf dem Weg von
Bagdad nach Amman, erbaut im 8. Jahrhundert. Quasr Amra war nicht nur der
Ort f&uuml;r geheime Gespr&auml;che. Im ger&auml;umigen Badetrakt liessen
sich die omajiadischen Kalifen verw&ouml;hnen. Das ganze Schloss zieren -
heute ... </font> </p>

<p><b>Baalbek: Ruinen von Baalbek</b><br>

<font size="-1">Baalbek ist eine Stadt im Osten des Libanons zwischen den
Fl&uuml;ssen Litani und Asi. Der Name bedeutet &quot;Stadt Baals&quot; und
bezog sich auf den Sonnengott, den die Griechen mit ihrem Gott Helios
gleichsetzten.<br>Der gro&szlig;e Sonnentempel ma&szlig; etwa 49x88 Meter
und enthielt 58 ... </font> </p>

<p><b>Buchara: Historisches Zentrum von Buchara</b><br>

<font size="-1">Legend&auml;r reich war einst die Oasenstadt Buchara, ein
wichtiger Knotenpunkt an der Seidenstra&szlig;e und Zentrum des Islams in
Zentralasien. Noch heute schimmern die Kuppeln blau und gl&auml;nzen die
Fassaden der Medresen und Moscheen. <br><br>Blau sei die erste Farbe der
Stadt, sagt ... </font> </p>

<p><b>Isfahan: Meidan-e Schah (K&ouml;nigsplatz) von Isfahan</b><br>

<font size="-1">Nach dem Paradiesvorstellungen des Korans wollte Schah
Abbas Ende des 16. Jahrhunderts Isfahan zu einer modernen Stadt umbauen.
Isfahan wurde zu einem wichtigen Handelszentrum, in dem
Religi&ouml;sit&auml;t und Kommerz die tragenden S&auml;ulen waren. Die
Verbindung von Geistigem und ... </font> </p>

<p><b>Persepolis</b><br>

<font size="-1">Das erste Weltreich auf dem Globus, vor 2.500 Jahren, ist
ein Vielv&ouml;lkerstaat. 28 V&ouml;lker leben nicht als unterdr&uuml;ckte
Vasallen, sondern als ann&auml;hernd gleichberechtigte Partner miteinander.
Darius ist ihr Gro&szlig;k&ouml;nig, sein Traum &quot;Persepolis&quot; das
steinerne ... </font> </p>

<p><b>Khajuraho: Tempelbezirk von Khajuraho</b><br>

<font size="-1">Erotische Kunst zur Verherrlichung der G&ouml;tter. Die
Tempel von Khajuraho in Zentralindien l&ouml;sen noch heute bei vielen
Besuchern Emp&ouml;rung oder Verwirrung aus.<br><br>Die &uuml;ber 2000
Skulpturen an den Au&szlig;enw&auml;nden der Tempel zeigen G&ouml;tter,
Himmelst&auml;nzerinnen, ... </font> </p>

<p><b>Thanjavur: Tempel von Brihadisvara in Thanjavur</b><br>

<font size="-1">Tausend Jahre ist er alt, der Brihadeshvara-Tempel von
Thanjavur, und man sieht es ihm nicht an. Im Mittelalter hat er als Festung
gegen anst&uuml;rmende Feinde gedient und sp&auml;ter
Zerst&ouml;rungsversuchen fanatischer Moslems widerstanden. Heute ist er
ein bedeutender Wallfahrtsort der ... </font> </p>

<p><b>Kathmandu: Tal von Kathmandu</b><br>

<font size="-1">Ein Tal der G&ouml;tter und Legenden im Herzen Nepals,
eingebettet in die fruchtbare Ebene zwischen Tibet und Indien.
Jahrhundertelang kreutzten sich im Kathmandu-Tal die Pilger- und
Handelswege, hier sind Buddhismus und Hinduismus eine einzigartige Synthese
eingegangen.<br>Tausende von Stupas, ... </font> </p>

<p><b>Luang Prabang K&ouml;nigspalast und buddhistischen
Kl&ouml;stern</b><br>

<font size="-1">Tief in den Bergen von Laos, am Ufer des Mekong, im
Gr&uuml;n des Dschungels versunken , liegt Luang Prabang. Luang Prabang war
die Hauptstadt von Lane Xang, dem m&auml;chtigen Reich der 'ein Millionen
Elefanten', und &uuml;ber Jahrhunderte Sitz der K&ouml;nige von Laos.
<br>Bis heute ist ... </font> </p>

<p><b>Qufu: Konfuziustempel, Friedhof und Residenz der Familie Kong in
Qufu</b><br>

<font size="-1">Im Sch&auml;tze der Welt Film &uuml;ber Qufu - die
St&auml;tten des Konfuzius - werden nicht nur die bedeutenden steinernen
Zeugnisse einer gro&szlig;en Kultur gezeigt, sondern wird auch eine
Vorstellung davon vermittelt, wie zu Zeiten der chinesischen Kaiser der
Konfuziuskult aussah und welche ... </font> </p>

<p><b>Sanchi: Buddhistisches Heiligtum bei Sanchi</b><br>

<font size="-1">Auf einem H&uuml;gel in der N&auml;he der kleinen Ortschaft
Sanchi in Zentralindien stehen die &auml;ltesten, buddhistischen Stupas
Indiens. Sie sind &uuml;ber 2000 Jahre alt. Stupas symbolisieren im
Buddhismus den heiligen Baum des Lebens und der Erleuchtung.<br><br>Nach
dem Tode Buddhas war ... </font> </p>

<p><b>Mahabalipuram: Tempelbezirk von Mahabalipuram</b><br>

<font size="-1">In Mahabalipuram vermittelt das gr&ouml;&szlig;te Relief
der Welt in seiner gro&szlig;artigen Bildsprache die hinduistische
Vorstellung von Paradies auf Erden. Hier sind Menschen und Tiere,
G&ouml;tter und Heilige in Liebe und Achtung voreinander an den heiligen
Wassern des Ganges vereint. Es war ... </font> </p>

<p><b>Ha Long: Bucht von Ha Long</b><br>

<font size="-1">Die Halong-Bucht im Norden Vietnams, eine bizarre Welt von
mehr als 2000 Inseln, &Uuml;berreste gewaltiger Muschelkalkb&auml;nke, die
vor 300 Millionen Jahren heranwuchsen. Eine Landschaft f&uuml;r Legenden.
Der Ha Long, &quot;herabsteigender Drache&quot; soll von den G&ouml;ttern
geschickt ... </font> </p>

<p><b>Damaskus: Altstadt von Damaskus</b><br>

<font size="-1">Wenn die Karawanen in das Stadtgebiet einzogen, wurden sie
empfangen von &uuml;ppigem Gr&uuml;n, sprudelnden Wasserfont&auml;nen,
k&uuml;hlender Architektur. Damaskus, der Name klingt schon in den Ohren
nach Verzauberung, nach M&auml;rchenland. So haben die Dichter auch die
syrische Stadt ... </font> </p>

<p><b>Bosra: Altstadt von Bosra</b><br>

<font size="-1">Bosras Ruf klingt vor allem nach Musik. 1800 Jahre nach
seiner Erbauung durch die R&ouml;mer gilt das Theater von Bosra nicht nur
als das am besten erhaltene Bauwerk seiner Art. Und noch heute
sch&auml;tzen Musiker und Orchester aus aller Welt seine besondere Akustik.
... </font> </p>

<p><b>Hiroshima: Friedensdenkmal in Hiroshima</b><br>

<font size="-1">Japan hat ein besonderes Verh&auml;ltnis zur Zeit. Tempo,
P&uuml;nktlichkeit. Leistung ist Arbeit in der Zeit. <br><br>Einmal blieb
die Zeit stehen. Am 6. August 1945, um acht Uhr f&uuml;nfzehn am Morgen.
Abwurf der ersten Atombombe. Und als die Zeit stehengeblieben war und sich
... </font> </p>

<p><b>Kandy: Heilige Stadt Kandy</b><br>

<font size="-1">Im Herzen Sri Lankas, im gebirgigen Dschungel, liegt
&quot;Kanda-uda-pas-rata, einst das &quot;verborgene K&ouml;nigreich in den
Bergen&quot;. Die Briten eroberten 1815 die Stadt und verk&uuml;rzten den
Namen zu &quot;Kandy&quot;. <br>Bedeutendstes Bauwerk im Mittelpunkt der
lebendigen Stadt ... </font> </p>

<p><b>Itsukushima-Schrein</b><br>

<font size="-1">Shintoismus und Zen-Buddhismus, die beiden gro&szlig;en
Religionen Japans, treffen auf der Insel Itsukushima (Miyajima) zusammen.
Der Shinto-Schrein von Itsukushima, auf Pf&auml;hlen in den Uferschlamm
gebaut, mit seinem gro&szlig;en roten Tor, das im Wasser weit vor der Insel
steht, ist eine ... </font> </p>

<p><b>Taxila: Ruinenstadt Taxila</b><br>

<font size="-1">Als Alexander der Gro&szlig;e 326 v. Chr. Taxila erreicht,
ist er nicht nur der gro&szlig;e Stratege, sondern ein Bote griechischer
Kultur. Er erobert die &auml;lteste Siedlung Bhir Mound, die heute - unweit
von Islamabad, der Hauptstadt Pakistans, gelegen - nur noch aus ... </font>
</p>

<p><b>Ifugao: Reisterrassen der Philippinischen Kordilleren auf den
Bergh&auml;ngen des Ifugao</b><br>

<font size="-1">Vor rund 2.000 Jahren wurden sie angelegt, die
ber&uuml;hmten Reisterrassen im Norden der Philippinen. Ihre Baumeister
waren die Ifugao, ein Bauernvolk, das vermutlich aus Indonesien stammte und
sich in der unwegsamen Bergwelt der Cordilleren ansiedelte. M&uuml;hsam
haben die Ifugao dem Boden ihr ...  <br>

<a href="schaetze/mm_schaetze2.html" target="_top"><b>Zum&nbsp;Denkmal</b></a></font>
</p>

</td></tr></table>
<p> &nbsp; <br>
Kein linker Frame? Dann klicke <a href="index.html" target="_top">
<b>hier</b></a></font> </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
