<html>
<head>
<title>Interview 1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"><b>Amiga Arena Interview</b></font><br>
<font color="#000080" size="5">mit Darius Brewka, Entwickler von AmiStart </font></p>

<p><dl>
<dt><font color="#0000ff">
*Bitte stelle Dich den Lesern vor!
</font></dt>

<dd>Ich bin ein 29 j&auml;hriger Student aus Braunschweig und wie man sieht
schon zu lange dabei :-( , was aber nicht bedeuten soll, ich w&auml;re
Faul. </dd><br>

<dt><font color="#0000ff">
*Wann hast Du angefangen, mit dem Amiga zu arbeiten?
</font></dt>

<dd>ich glaube es war so Ende 1987. </dd><br>

<dt><font color="#0000ff">
*Welches Amiga-Modell besitzt Du?
</font></dt>

<dd>An Amiga Modellen besitze ich nur einen Amiga1200 (der vor geraumer
Zeit noch um einiges erweitert war) den ich aber nicht benutze, stattdessen
benutze ich hier den PC meines Bruders unter WinUAE, das ist Billiger und
vor allem schneller (s.u.). </dd><br>

<dt><font color="#0000ff">
*Welche Version des Betriebssystems l&auml;uft auf Deinem Computer?
</font></dt>

<dd>OS3.1, ich weiss das es OS3.5 und OS3.9 gibt, diese beiden Versionen
sind f&uuml;r mich aber aufgrund einiger (f&uuml;r mich) unakzeptabler
Entwicklungen unattraktiv. </dd><br>

<dt><font color="#0000ff">
*Welche Software entwickelst Du?
</font></dt>

<dd>Im moment nur AmiStart, ab und zu aber noch einige Tools, die ich
f&uuml;r mich brauche, letztere eher unter Java auf dem PC </dd><br>

<dt><font color="#0000ff">
*Kannst Du uns sagen, worum es bei Deiner Software geht?
</font></dt>

<dd>zu AmiStart direkt, es ist ein StartMenu wie es schon einige gibt
aber keine wie ich es brauchte. </dd><br>

<dt><font color="#0000ff">
*Was hat in Dir die Idee geweckt, Deine Software (weiter) zu entwickeln?
</font></dt>

<dd>Ich habe im Aminet ein Startmenu gefunden was eigentlich ganz Nett,
aber erstens nicht weiterentwickelt wurde (ich spreche hier um die Zeit um
1998 herum) und zweitens zu kompliziert zu konfigurieren war und da ich
gerne programmiere habe ich mich auch mal an so etwas versucht. </dd><br>

<dt><font color="#0000ff">
*Wie lange hat die Entwicklung bisher gedauert?
</font></dt>

<dd>Das l&auml;sst sich nicht so genau sagen, da ich irgendwann ab 1999
keinen Computer mehr besa&szlig; und mich erst vor ca. 2 Monaten wieder ein
wenig in die Amiga Programmierung eingearbeitet habe. Angefangen habe ich
1998 und habe eine erste Version fertiggestellt die eigentlich nichts
konnte bis auf Programme starten, damals habe ich ungef&auml;hr einen Monat
dran gesessen. Drei Jahre habe ich praktisch nicht daran weiterentwickelt
und da ich meine Sources f&uuml;r gew&ouml;hnlich nicht kommentiere war ein
Wiedereinstieg nicht so einfach aber es ging dann doch. </dd><br>

<dt><font color="#0000ff">
*Welche Software verwendest Du?
</font></dt>

<dd>Nur diejenige die ich damals behalten habe, ich mache mit dem Amiga
sonst leider mehr viel (s.u.)., da es auf dem Amiga kein Java1.3 was
f&uuml;r mich sehr wichtig ist gibt. Das w&auml;re DirOpusMAG, YAM, VBCC
(habe mir damals MaxonC gakauft, aber die Geschichte kennt man ja), MUI
(habe es in einen sehr fr&uuml;hen Stadium registriert aber dann nicht auf
>3.0 registriert da der Entwickler das Project scheinbar gestoppt hatte),
GoldED, PPaint, PerfectPaint (teilweise), keine gro&szlig;en Programme eher
die kleinen Tools die das Leben sch&ouml;ner machen. </dd><br>

<dt><font color="#0000ff">
*F&uuml;r welches System (AmigaOS,AmigaDE,MorphOS)entwickelst Du?
</font></dt>

<dd>AmigaOS. </dd><br>

<dt><font color="#0000ff">
*Welches Os wirst Du in Zukunft unterst&uuml;zen?
</font></dt>

<dd>Es kommt auf die Entwicklung an, ich bin da nicht so auf die Hardware
(wie viele Amiga User) fixiert,an AmigaDE galube ich nicht ganz, MorphOS
ist f&uuml;r mich ein Interessantes Produkt aber bei allem ist anzumerken
das ich eigentlich keine Zeit habe und auch nicht so viel Geld besitze, so
da&szlig; ich puren PPC-Entwicklungen eher skeptisch gegen&uuml;ber bin. In
der n&auml;chsten Zeit sowieso. </dd><br>

<dt><font color="#0000ff">
*Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?
</font></dt>

<dd>hmm, gute Frage eigentlich ist alles drinne was ich brauche. </dd><br>

<dt><font color="#0000ff">
*Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln, wenn Du
siehst, wie wenig Resonanz Du aus dem kleinen Amiga-Markt erh&auml;ltst?
</font></dt>

<dd>Ich verliere eher den Spa&szlig; daran, mir die Leute um AmigaInc
anzuh&ouml;ren. </dd><br>

<dt><font color="#0000ff">
*Erh&auml;ltst Du genug Resonanz f&uuml;r Deine Software?
</font></dt>

<dd>Ich bin positiv &uuml;berrascht, dass sich &uuml;berhaupt jemand
gemeldet hat, es sind nicht so viele, aber so kann ich schneller auf
W&uuml;nsche eingehen. </dd><br>

<dt><font color="#0000ff">
*Wann hast Du Deinen Amiga das letzte Mal benutzt?
</font></dt>

<dd>WinUAE jeden Tag, den echten Amiga 1999. </dd><br>

<dt><font color="#0000ff">
*Welche Software hast Du zuletzt f&uuml;r den Amiga gekauft?
</font></dt>

<dd>M&uuml;sste Dopus Magellan gewesen sein, ist aber schon lange her.
</dd><br>

<dt><font color="#0000ff">
*Welche Software nutzt Du heute noch?
</font></dt>

<dd>s.o. </dd><br>

<dt><font color="#0000ff">
*Welche Hard/Software hast Du vor zu kaufen?
</font></dt>

<dd>im Moment keine.  </dd><br>

<dt><font color="#0000ff">
*Glaubst Du an ein Comeback von Amiga?
</font></dt>

<dd>Nein, solange AmigaInc. meint auf den gro&szlig;en Markt landen zu
k&ouml;nnen, der Amiga ist ein Nischenrechner und das mu&szlig; er meiner
Meinung nach bleiben. Es gibt immer noch Menschen die benutzen den Amiga
obwohler eigentlich seit 1985 im Kern gleich geblieben ist, das einzige was
mir am Amiga spa&szlig; macht ist die Flexibilit&auml;t seines
Betriebssystems und der Systemaufbau dieses sollte Fortgef&uuml;hrt werden,
nicht das in M&auml;rkte hineindringen zu wollen wo man keine Chance hat.
AmigaInc sollte den Amiga aufgeben, das w&auml;re kein R&uuml;ckschritt
denn es passiert nichts mit oder ohne die :-( Amiga behindert die
Weiterentwicklung. Ein Comeback wird es nicht geben, da diejenigen die
umgestiegen sind, nicht zur&uuml;ckkommen werden um f&uuml;r mehr Geld
weniger zu erhalten. Siehe z.B. Amithlon, ein interessantes Produkt ein
"offizieller" Amigaemulator der zwar jeden echten Amiga zu schlagen vermag,
aber den Amiga in echt zu einen Billigprodukt degradiert den man mal so
nebenbei nachahmen kann, da nimmt ihm die "Pers&ouml;nlichkeit". </dd><br>

<dt><font color="#0000ff">
*Deine letzten Worte an die Leser?
</font></dt>

<dd>Amiga macht Spa&szlig;, gebt nicht auf! </dd><br>

<dt>(c) 12/2001 Amiga Arena </dt></dl>
</p>

</td></tr></table>
<br>
</body>
</html>
