<html>
<head>
<title>Interview 3</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"> <b>Amiga Arena Interview </b></font> <br>
<font color="#000080" size="5"> mit Florac Roland, Entwickler von AmiCAD! </font>
<br>
Übersetzt f&uuml;r die Amiga Arena von Christian Busse</p>

<p><dl>
<dt><font color="#0000ff"> *Bitte stelle Dich den Lesern vor! </font></dt>

<dd>Ich bin Professor an einer Hochschule in einem kleinen Ort in
Frankreich (Saintes). Ich arbeite im Bereich Elektronik, f&uuml;r
Studenten, die an Ihrem "Baccalauréat" arbeiten. Ich bin jetzt 46 Jahre
alt. </dd><br>

<dt><font color="#0000ff">*Wann hast Du begonnen, mit dem Amiga zu
arbeiten? </font></dt>

<dd>Ich kann mich nicht genau erinnern, vor etwa zehn Jahren (vielleicht
ein bi&szlig;chen mehr). </dd><br>

<dt><font color="#0000ff">*Welches Amiga-Modell besitzt Du? </font></dt>

<dd>Mein erstes Modell war ein Amiga 2000 mit einem einzelnen
Diskettenlaufwerk ohne Festplatte (1 MB Chip-RAM und 2 MB Fast-RAM), das
Betriebssystem war 1.2 oder 1.3, ich wei&szlig; nicht mehr genau... Ich
lernte, Programme zu programmieren, die nicht viel RAM ben&ouml;tigten!
</dd><br>

<dt><font color="#0000ff">*Welche Version des Betriebssystems l&auml;uft
auf Deinem Computer? </font></dt>

<dd>Ich have jetzt einen Amiga 4000 (Desktop) with dem 3.9er-System. Ich
habe zwei Festplatten (1 GB und 4 GB), 16 MB Fast-RAM, ein ZIP-Laufwerk und
ein CDRAM-Laufwerk. Ich habe auch eine 68060-Karte (Cyberstorm MK II).
</dd><br>

<dt><font color="#0000ff">*Welche Software entwickelst Du? </font></dt>

<dd>Ich arbeite vorn Zeit zu Zeit an mehreren Projekten: AmiCAD, AmiPCB,
AmiTex, AmiLex, Conjuguer, QuickFile, ASCIITable, FetchRefs... Im Moment
versuche ich, an AmiPCB (Werkzeugleiste und Komponenten) zu arbeiten. Ich
mu&szlig; sagen, da&szlig; ich die gesamte Arbeit an dieser Software in
meiner Freizeit mache und kein Geld daf&uuml;r bekomme. </dd><br>

<dt><font color="#0000ff">*Was hat Dich auf die Idee gebracht, Deine
Software weiter zu entwickeln? </font></dt>

<dd>Ich hasse Windows und viele Programme, die ich bei der Arbeit verwenden
mu&szlig;. Und ich mag den Amiga und sein System sehr, also ziehe ich es
vor, daf&uuml;r zu entwickeln. </dd><br>

<dt><font color="#0000ff">*Wie lange hat die Entwicklung bis heute
gedauert? </font></dt>

<dd>Mehrere Jahre... sicherlich. </dd><br>

<dt><font color="#0000ff">*Welche Software verwendest Du? </font></dt>

<dd>Ich verwendet DevPac und den alten SAS-C-Compiler (immer noch das beste
f&uuml;r mich, weil ich keine PowerPC-Karte habe). </dd><br>

<dt><font color="#0000ff">*F&uuml;r welches System entwickelst Du?
</font></dt>

<dd>Ich entwickle nur f&uuml;r den Classic Amiga (kein PowerPC). </dd><br>

<dt><font color="#0000ff">*W&uuml;rdest Du den "Amiga One"
unterst&uuml;tzen? </font></dt>

<dd>Vielleicht, falls ich einen kriegen kann (der Preis w&auml;re das
Hauptkriterium). </dd><br>

<dt><font color="#0000ff">*Was k&ouml;nnen wir von zuk&uuml;nftigen
Versionen erwarten? </font></dt>

<dd>Ich w&uuml;rde AmiCAD gern um ein Projekt-Objekt erweitern. So
w&auml;re es m&ouml;glich, Dokumente mit mehreren Seiten zu erzeugen.
</dd><br>

<dt><font color="#0000ff">*Verlierst Du nicht den Spa&szlig; und das
Interesse am Entwickeln, wenn Du die geringe Resonsnz und das wenige Geld
siehst, das Du aus dem kleinen Amiga-Markt erh&auml;ltst? </font></dt>

<dd>Ich mu&szlig; sagen, da&szlig; das ein Problem ist. Auf meine letzte
Version von AmiCAD und AmiPCB habe zum Beispiel nur zwei Antwortmails
erhalten... Und ich bezahle die ganze Kommunikation, um sie ins Netz zu
senden, ich glaube nicht, da&szlig; das eine wirklich interessante Arbeit
ist. </dd><br>

<dt><font color="#0000ff">*Erh&auml;ltst Du genug Resonanz auf Deine
Software? </font></dt>

<dd>Nein, ich glaube nicht. </dd><br>

<dt><font color="#0000ff">*Wann hast Du Deinen Amiga zuletzt benutzt?
</font></dt>

<dd>Jetzt, um dieses Mail zu verschicken! </dd><br>

<dt><font color="#0000ff">*Welche Software hast Du zuletzt f&uuml;r Deinen
Amiga gekauft? </font></dt>

<dd>Wirklich, ich kann mich nicht erinnern! Aber ich glaube, es war
Wordworth (ein ausgezeichnetes Programm, sehr stabil, aber mit ein paar
leichten Einschr&auml;nkungen). </dd><br>

<dt><font color="#0000ff">*Welche Software benutzt Du heute noch?
</font></dt>

<dd>Wordworth und Personal Paint. </dd><br>

<dt><font color="#0000ff">*Welche Soft-/Hardware hast Du vor, zu kaufen?
</font></dt>

<dd>Nichts im Moment, vielleicht AmigaForver, falls mein jetziger Amiga
stirbt... </dd><br>

<dt><font color="#0000ff">*Glaubst Du an ein Comeback von Amiga?
</font></dt>

<dd>Ich hoffe (aber nur ein kleines F&uuml;nkchen)... </dd><br>

<dt>(c) 11/2001 Amiga Arena </dt>
</dl>

</p>

</td></tr></table>
<br>
</body>
</html>
