<html>
<head>
<title>Interview 5</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"> <b>Amiga Arena Interview </b> <br>
mit dem Scalos Team</font>
<br><a href="http://www.scalos.co.uk">http://www.scalos.co.uk</a>
 </p>

<p><table border=0 cellspacing=3 cellpadding=5>
<tr><td colspan=3><font color="#0000ff">
*Bitte stellt Euch den Lesern vor! </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Hi, ich bin blo&szlig; gerade 23 Jahre alt,
Projektkoordinator und 'C'-Entwickler. Habe grade die Universit&auml;t
beendet und arbeite tags&uuml;ber als PHP-Programmierer. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Mein Name ist J&uuml;rgen Lachmann, ich bin 44 Jahre alt und
lebe in einer kleinen Stadt in S&uuml;ddeutschland. Ich verdiene meinen
Lebensunterhalt als Elektroingenieur und betreibe die Amiga-Programmierung
nur aus Spa&szlig;. Ich habe fast seit dem Anfang mit Computern zu tun
gehabt -meine erste Maschine war ein selbsgebautes Z80-Lochrasterboard mit
1 KB (!!) Speicher. Ich erinnere mich, da&szlig; ich einmal die Gelegenheit
hatte, mit dem brandneuen Amiga 1000 eines Freundes zu spielen, und ich war
sehr beeindruckt. Als der A2000 vorgestellt wurde, kaufte ich einen und
habe ihn seitdem von Zeit zu Zeit aufger&uuml;stet - mit der Maschine
arbeite ich heute noch. Hobbies: neben anderen Dingen bin ich Amateurfunker
und fotografiere und ich reise gern in ferne L&auml;nder. </td></tr>

<tr><td width=30><td valign=top>Chris:</td>

<td valign=top>Hi,ich bin Chris Haynes (25). Ich schreibe die
Scalos-Website und redesigne sie alle sechs Monate! Ich werde auch bei der
Entwicklung von Scalos helfen, wenn alle Teile von Assembler nach C
portiert sind. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>David McMinn, 24 Jahre alt, lebe in Gro&szlig;britannien.
Ich sehe aus wie Barney Gumble von den 'Simpsons' :) </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Wann habt Ihr begonnen, mit dem
Amiga zu arbeiten? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Um die Zeit, als der A1200 rauskam, ich gleube Ende
September 1993? :o) Davor habe ich etwas mit dem Amstrad CPC 6128
rumgespielt. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Ich bin nicht sicher - aber es war gut in den 80ern.
</td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Ähm, 1989/90, glaube ich. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>1992 </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Welche Amiga-Modelle besitzt Ihr?
</font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Einen A1200 im Tower-Geh&auml;use mit einer BlizzardPPC 240
MHz + 060. Blizzardvision Grafikkarte, 80 MB RAM, 19"-Monitor (damit ich
einen gro&szlig;en Desktop und tausende Fenster offen haben kann) plus all
die anderen normalen Teile - CD-ROMs, CD-Brenner, ZIP-Laufwerk, SCSI usw.
</td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>A2000, Blizzard 2060 68060/50, 92 MB RAM, 18 GB Festplatte,
16 GB Bandlaufwerk, DVD, 12/10/32-fach CD-Brenner </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Ich habe mit einem A500 angefangen, aber der ist mir immer
verreckt, also habe ich 1993 auf einen A1200 aufger&uuml;stet. etzt
l&auml;uft dasselbe System in einem Tower-Geh&auml;use und ist mit einer
Blizzard 1260, 144 MB RAM und einer Pixel64 Grafikkarte aufger&uuml;stet
worden. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>A1200 mit Blizzard 1260. </td></tr>


<tr><td colspan=3><font color="#0000ff"> *Welche Betriebssystem-Versionen
laufen auf Euren Computern? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Ich bin immer noch auf 3.1, da ich nichts neueres brauche
(im Moment). Ich besitze ein Exemplar des OS 3.9, aber als Teil eines
k&uuml;rzlichen Kaufes. Oh, ich habe auch die neue exec.library installiert
- ich verwende ein 'softgekicktes' ROM (obwohl ich auch die 3.1 ROM-Chips
installiert habe) </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>OS 3.9 </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>OS 3.1 </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>OS 3.5 </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Welche Software entwickelt Ihr?
</font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>In der Vergangenheit habe ich einige Sachen geschrieben
(sogar ein Spiel), die alle auf der "CU Amiga Magazine Super CD-ROM #7"
enthalten sind. Jetzt scheine ich all meine "Amiga-Zeit" Scalos zu widmen.
</td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Die meiste meiner Zeit vor dem Bildschirm geht in Scalos.
Ich habe auch ein paar Sachen zum Basilisk II Mac-Emulator beigesteuert und
arbeite an ein paar privaten Projekten. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Scalos, Launcher bis V2.1, BugLog und viele andere.
</td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Scalos (Co-Autor), Viewfons2 (Autor), Dir2HTML (Autor),
GeoWorld (Co-Autor). </td></tr>

<tr><td colspan=3><font color="#0000ff"> *K&ouml;nnt Ihr uns sagen, worum
es bei Eurer Software geht? </font> </td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Das Beste w&auml;re, daf&uuml;r die Website auf
www.scalos.co.uk zu besuchen ;o) </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>-</td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Scalos ist ein Desktop-Ersatz f&uuml;r den Amiga. Launcher
ist ein Button/Men&uuml;-Bank Programm/Skript-Starter Dienstprogramm.
BugLog ist ein Bug-Verforgungssystem f&uuml;r Softwareentwickler.
</td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Scalos ist ein m&auml;chtiger Workbench-Ersatz. Viewfont2
ist ein Font-Anzeiger und -Manager. Dir2HTML war ein kleines Tool um
HTML-Indexdateien aus Verzeichnisb&auml;umen zu erzeugen. GeoWorld ist ein
geografisches Informationsprogramm. </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Was brachte Euch auf die Idee,
Eure Software weiter zu entwickeln? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Ich habe Scalos seit seiner urspr&uuml;nglichen
Ver&ouml;ffentlichung verwendet, ich habe auch die
Registrierungsgeb&uuml;hr bezahlt. Nach ungef&auml;hr einem Jahr schien der
Autor aufgegeben zu haben, meine RIESIGE Liste offener Bugs zu fixen, und
war auch sehr zur&uuml;ckhaltend mit der Implementierung neuer Features. An
diesem Punkt fragte ich, ob ich den Quellcode des Projektes f&uuml;r die
weitere Entwicklung haben k&ouml;nnte. Stefan erwog, Scalos zu Open Source
zu machen, hatte aber nicht die Zeit das zu organisieren. Au&szlig;erdem
w&auml;re Open Source-Assembler ein Alptraum f&uuml;r alle gewesen!
</td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>-</td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Scalos wird ben&ouml;tigt, weil die originale Workbench zu
veraltet ist. Sie wird weiterentwickelt, aber wir glauben immer noch,
da&szlig; wir Features implementieren k&ouml;nnen, die die offizielle
Workbench nicht bieten kann. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Ich mochte die Idee von Scalos, aber habe nie geschaft, sie
zum Laufen zu kriegen. Dann erhielt ich die Gelegenheit, es weiter zu
entwickeln, nachdem Mike die Verf&uuml;gbarkeit des Quellcodes von
AlienDesign diskutierte. </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Wie lange hat die Entwicklung bis
heute gedauert? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Die Entwicklung von Scalos begann 1999. Der
urspr&uuml;ngliche Assembler-Code war ein Alptraum und es dauerte ewig, ihn
in &uuml;berschaubare St&uuml;cke auseinander zu nehmen. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Ich bin seit etwa einem Jahr Teil des
Scalos-Entwicklerteams. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Scalos ist (so weit ich wei&szlig;) seit mindetsens 1997 in
Entwicklung. Wir habe die Entwicklung 1999 &uuml;bernommen, also etwa zwei
Jahre f&uuml;r Scalos. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Von der vergangenen Zeit her viel zu lang. Die mit dem
Programmieren verbrachte Zeit war viel k&uuml;rzer :) </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Welche Software verwendet ihr?
</font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>StormC 3, SAS/C, vbcc, und ich habe gerade auch MorphOS
installiert, um Scalos damit zu testen. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Editieren mit CED 4.17, kompilieren mit SAS/C 6.58,
assemblieren mit PhxAss 4.40 </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Scalos 40.15 (v1.30), DPaint 5, PhxAss, StormC 3. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>SAS/C, vbcc, PhxAss, AsmOne, Blitz Basic 2, PureBasic.
</td></tr>

<tr><td colspan=3><font color="#0000ff"> *F&uuml;r welches System
entwickelt Ihr? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Classic Amiga (momentan bis zu OS 3.9) </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Classic Amiga </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Classic Amiga-Systeme (68020+) k&ouml;nnen Scalos nutzen.
Wir erw&auml;gen, es in Zukunft f&uuml;r PPC-basierte Amigas zu
kompilieren. Falls wir ein paar Entwickler-Boards vom Pegasos und AmigaOne
bekommen k&ouml;nnen (Wink mit dem Zaunpfahl), entwickeln wir Scalos und
stellen sicher, da&szlig; es auf ihnen prima l&auml;uft!!! ;) </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>AmigaOS. </td></tr>


<tr><td colspan=3><font color="#0000ff"> *W&uuml;rdet Ihr den "Amiga One"
unterst&uuml;tzen? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Ich bin nicht sicher, ob wir das m&uuml;&szlig;ten? Ich bin
mir nicht v&ouml;llig im klaren, was abgeht, aber ich w&uuml;rde vermuten,
da&szlig; ein neues Desktop Teil des Pakets ist, was Scalos f&uuml;r OS4
(das ben&ouml;tigt wird, um auf dem AmigaOne-Motherboard zu spielen)
irrelevant machen d&uuml;rfte. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>H&ouml;chstwahrscheinlich ja. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Ja, ich denke schon. Falls es liefert, was es verspricht,
dann klar, warum nicht! </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Die hardware zu unterst&uuml;tzen ist irrelevant, mich
k&uuml;mmert eher das Betriebssystem, das darauf l&auml;uft. Sowohl OS4 als
auch MorphOS sehen ziemlich gut aus, obwohl ich sie nie verwendet habe.
</td></tr>

<tr><td colspan=3><font color="#0000ff"> *Was k&ouml;nnen wir von
zuk&uuml;nftigen Versionen erwarten? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>"Themen"-Unterst&uuml;tzung wird voll implementiert werden
(aber keine Skins, da dies das schreiben eines intuition.library-Ersatzes
f&uuml;r das Zeichnen der Fenster usw. erfordern w&uuml;rde)... Ich habe
ein Auge auf das aktuellste Apple OS und Windows OS um zu sehen, welche
neuen Ideen die reingequetscht haben. Falls es nicht zu l&auml;stig ist,
sie zu verwenden und auf der langsameren Amiga-Hardware m&ouml;glich sind,
versuche ich normalerweise, einen netten Weg zu finden, sie in Scalos
einzubauen. Eine MorphOS (reine PPC)-Version von Scalos und seinen
Libraries sollte in 2002 verf&uuml;gbar sein, hoffe ich. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Bitte frag Mike dar&uuml;ber. Er hat die besten Ideen, was
in zuk&uuml;nftige Versionen eingabut werden sollte. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Mehr Idden von Usern werden implementiert. Wir erw&auml;gen
auch immer noch die Verwendung von Themen, um Dein Desktop Deinen Vorlieben
anzupassen. Es ist schon ziemlich konfigurierbar, aber es gibt keine Ersatz
f&uuml;r ein vollst&auml;ndig benutzerdefiniertes Computer-Erlebnis!!!
</td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Scalos wird momentan nach C portiert, und Bugs werden
behoben. Sind einmal alle gr&ouml;&szlig;eren Bugs aus dem Weg, k&ouml;nnen
wir beginnen, neue Features hinzuzuf&uuml;gen. Native PPC-Versionen
w&auml;ren auch Teil einer zuk&uuml;nftigen Version. </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Verliert Ihr nicht den Spa&szlig;
und das Interesse am Entwickeln, wenn Ihr die geringe Resonanz und das
wenige Geld seht, das Ihr aus dem kleinen Amiga-Markt erhaltet?
</font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Es kann gro&szlig;artig sein, beim Arbeiten an einem neuen
Desktop einfach nur Erfahrung zu sammeln. Und da ich es auf meiner eigenen
Maschine benutze, *will* ich, da&szlig; es gut funktioniert und toll
aussieht. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Wie ich unten sagte, bekomme ich nicht zu wenig Resonanz.
Ich erwarte nicht, da&szlig; ich von meiner Amiga-Programmierung Geld
bekomme. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Nein, niemals. Solange Leute unsere Produkte wollen, werden
wir sie weiter entwickeln. Und selbst dann, falls andere Leute die Produkte
nicht wollen, warum sollten wir aufh&ouml;ren, sie zu entwickeln? Wir
k&ouml;nnen sie selbst nutzen! </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Ich habe niemals Geld an einem meiner Amiga-Programme
verdient (und ich habe es nie versucht :) </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Erhaltet Ihr genug Resonanz auf
Eure Software? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Wenn neue Betas von Scalos ver&ouml;ffentlicht werden, sich
die Mailing-Liste gew&ouml;hnlich f&uuml;r Diskussionen auf - es ist
gro&szlig;artig zu sehen, da&szlig; Leute immer noch Interesse an der
Entwicklung zeigen. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Es kommt darauf an, manchmal gibt es mehr als genug
Resonanz. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Wir k&ouml;nnten nat&uuml;rlich mehr Resonanz gebrauchen!
Falls und Leute Ideen geben, werden wir versuchen, sie in unsere Produkte
aufzunehmen. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Gew&ouml;hnlich bekommst Du genug Bug-Reports um
gr&ouml;&szlig;ere Probleme aufzusp&uuml;ren, und manche Leute senden
Feature-Anforderungen. Sehr selten bekommt man Resonanz, die einfach nur
"Danke" sagt (aber vielleicht ist meine Software auch mies :). </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Wann habt Ihr Euren Amiga zuletzt
benutzt? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Gerade jetzt, ich benutze ihn jeden Abend, um mindestens
meine Email einzusammeln, und schaue bei diversen IRC-Kan&auml;len rein,
wenn ich es schaffe, lange genug wach zu bleiben :) </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Heute </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Vor ein paar Tagen! </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Vor etwa einer Woche. </td></tr>

<tr><td colspan=3><font color="#0000ff"> *Welche Software habt Ihr zuletzt
f&uuml;r Euren Amiga gekauft? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Ich habe auf der letzten UK World of Amiga-Show Payback und
Amithlon gekauft. </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>OS 3.9-Update, MakeCD 3.2 </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Kann mich nicht erinnern, sorry! K&ouml;nnte ein Spiel
gewesen sein. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Das letzte war Payback. </td></tr>


<tr><td colspan=3><font color="#0000ff"> *Welche Software verwendet Ihr
heute noch? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Dieselbe Software, die ich fr&uuml;her benutzt habe :-p
</td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>- </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>DPaint 5, Lightwave 5, Imagine 3, Scalos, Storm C.
</td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Payback :) Typische Arten von Software f&uuml;r
Internet-bezogene Sachen - GoldEd, YAM, StrICQ, AWeb, Voyager, PPaint,
AmiTradeCentre. Au&szlig;erdem die oben erw&auml;hnten
Programmierwerkzeuge. </td></tr>


<tr><td colspan=3><font color="#0000ff"> *Welche Soft-/Hardware habt Ihr
vor zu kaufen? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Das bPlan Pegasos-Board sieht sooo verf&uuml;hrerisch aus,
ich will eins! Die n&auml;chste Version des AmigaDE SDK sieht
vielversprechend aus, ich w&auml;re interessiert, auch damit zu spielen.
</td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Ethernet-Karte. </td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Vielleicht eine Mediator-Busplatine um PCI-Karten,
schnellere Grafikkarte usw. benutzen zu k&ouml;nnen. Danach k&ouml;nnte ich
eine PCMCIA-Ethernetkarte kaufen, um meinen A1200T mit meinem Apple
PowerMac zu vernetzen. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Software: Descent Freespace ist sehr wahrscheinlich. Davon
abgesehen sehe ich nichts was ich br&auml;uchte (es sei denn irgendwas
erstaunliches taucht auf). Der n&auml;chste Hardware-Kauf w&auml;re einer
der PPC-Amigas der n&auml;chsten Generation - wahrscheinlich ein Shark,
m&ouml;glicherweise ein Pegasos, vielleicht ein AmigaOne. Es h&auml;ngt
davon ab, wie OS4/MorphOS sein wird. </td></tr>


<tr><td colspan=3><font color="#0000ff"> *Glaubt Ihr an ein Comeback von
Amiga? </font></td></tr>

<tr><td width=30><td valign=top>Mike: </td>

<td valign=top>Ich halte nicht die Luft an... aber es k&uuml;mmert mich
nicht allzu sehr, da&szlig; der Amiga keine Mainstream-Maschine mehr ist.
Es w&auml;re aber nett, wenn neue Hardware verf&uuml;gbar w&auml;re, die
die Leute kaufen k&ouml;nnen, ich meine Motherboards! </td></tr>

<tr><td width=30><td valign=top>J&uuml;rgen: </td>

<td valign=top>Ich bezweifle, da&szlig; es ein Comeback geben wird.
</td></tr>

<tr><td width=30><td valign=top>Chris: </td>

<td valign=top>Hmmm, bin nicht sicher. Ich denke, Amiga inc. machen ganz
gute Fortschritte, die neue Amiga-Umgebung auf Handheld-PDAs zu bringen,
und ich denke, die Tatsache, da&szlig; AmigaOS 4.0 immer noch den Classic
unterst&uuml;tzt (soweit ich wei&szlig;), ist auch gut. Ist der
PPC-Amigamarkt gro&szlig; genug, um die komplette Entwicklung des neuen OS
auf PPC zu &auml;ndern? Bin nicht sicher. Das bedeutet, einige User, die
nicht auf eine PPC-Karte aufr&uuml;sten k&ouml;nnen,
auszuschlie&szlig;en... Wir werden sehen. </td></tr>

<tr><td width=30><td valign=top>Dave: </td>

<td valign=top>Das AmigaDE ist eine nette Idee, scheint aber von der
Vollst&auml;ndigkeit noch weit entfernt zu sein. </td></tr>

<tr><td width=30><td valign=top colspan=2>
(c) 12/2001 Amiga Arena <br>
f&uuml;r die Amiga Arena &uuml;bersetzt von Christian Busse!
</td></tr>
</table>
</p>

</td></tr></table>
<br>
</body>
</html>
