<html>
<head>
<title>Brief von Poldi</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="6"> <b>Brief von Poldi </b></font> <br>


<p>
 Walter J&#228;ckel ( Poldi )<br>
 Alter Bahnhof 2a<br>
 34613 Schw./Treysa</P>

 <p>Geb.: 09.02.68</P>

<p> <b><u>Config:</B></U><br>
 Amiga-1300-Infinitiv, PPC-603e-175Mhz./040-25Mhz., 82 MB-RAM, Zip-100, ZIP-250,
 40*CD-ROM, 2,1-GB-HD, IDE-Wechselrahmen, Mroocheck, USB-Controller, Modem,
 Soundblaster-128, Ext.HD-LW, Mediator-PCI-Board, Voodoo3-3000, Pinnacle-PCTV-
 Studio-PRO, Canon-BJC-250, Peacock Monitor. (USB-Karte leider noch ohne Treiber)</P>

 <p>Supergeile Sache das, Fernsehen und Mpg in Echtzeit, das alles dank der besten
 PCI-L&#246;sung, dazu noch sehr schneller Grafikaufbau und keine Meldung mehr das der
 Speicher leer w&#228;re, wer kann da noch sagen das PCI nichts taugt, h&#246;chstens die,
 die keine Ahnung haben und labern m&#252;ssen, oder die die sich ein teures System
 mit Zorro zusammengeschustert haben und das alles nat&#252;rlich nicht aufgeben wollen!
 Ich wei&#223; das es Leute gibt die etwas gegen die PCI-L&#246;sungen haben und obendrein
 noch fordern das AGP-Ports auf die Boards m&#252;ssen, Ihr solltet mal vorher &#252;berlegen
 was Ihr damit anstellt, wenn andere Amiganer das Zeug von Euch glauben, werden sie
 unter Umst&#228;nden nichts kaufen und wieder nur auf den neuen Amiga warten, aber wenn
 sie etwas kaufen, unterst&#252;tzen sie auch die H&#228;ndler, die fast schon nur von den
 Versandkosten leben, au&#223;erdem ermutigen die K&#228;ufer die Hardwarehersteller auch
 weitere Sachen f&#252;r den Amiga zu bauen.<br>
 Wenn Ihr dann mal etwas weiter denkt, so werdet Ihr darauf kommen das wir alle
 etwas davon haben wenn es H&#228;ndler und Hersteller gibt, oder wo wollt Ihr etwas
 kaufen, und vor allem, was wollt Ihr kaufen, wenn es nichts gibt?</P>

 <p>Dann mu&#223; ich Euch noch sagen das es nicht so leicht ist einen AGP-Port auf so eine
 Karte zu basteln, meiner Meinung nach mu&#223; es gehen, aber AGP ben&#246;tigt viel mehr
 Strom als PCI und deshalb m&#252;&#223;te noch ein Adapterkabel drauf, mit dem man eventuell
 vom Diskettenanschlu&#223; den Strom anzapft, dazu k&#228;men noch Chips durch die der AGP-
 Port erkannt wird und die Stromzufuhr mu&#223; auch durch weitere Teile geregelt werden!
 Welchen AGP-Port h&#228;ttet Ihr denn gerne? Den AGP 2*Slot, der f&#252;r die 3,3 Volt
 Grafikkarten! Den AGP 4*Slot, der ausschlie&#223;lich f&#252;r 1,5 Volt Grafikkarten ist oder
 den Universal AGP-Slot, der eine Erkennungsautomatik hat ???<br>
 Also, baut Euch selbst einen AGP-Slot oder gebt Euch endlich mit der vorhandenen
 Hardware zufrieden! Und behauptet nicht das nur noch ein H&#228;ufchen Elend von dem PCI-
 User &#252;brig bleibt, weil man etwas installieren mu&#223;, seit Ihr die &#220;bermenschen, die
 es schaffen Hardware ohne Treiber zu nutzen? Mit Sicherheit hatte ich nicht mehr
 Arbeit beim installieren als Ihr bei den langsamen PPC-Grafikkarten, und wo habt Ihr
 denn die geile Software f&#252;r den PPC-Prozessor? Wenn Ihr echt nichts installieren
 mu&#223;tet, um Eure Grafikkarten, PPC-Boards und Soundkarten zu nutzen, dann solltet Ihr
 Euch das Patentieren lassen, darauf hat die Welt schon lange gewartet. Habt Ihr mal
 ein PCI-Board im Einsatz gesehen? Wahrscheinlich nicht, sonst w&#252;rdet Ihr nicht so
 einen M&#252;ll schreiben !!! Einen AGP-Port h&#228;tte ich zwar auch gern, aber was es nicht
 gibt kann ich nicht kaufen.<br>
 Wenn es keine USB-Treiber f&#252;r das Mediator geben sollte, schmei&#223;e ich die USB-Karte
 weg und hole mir die USB-Karte f&#252;r den Uhrenport, aber da habt Ihr bestimmt auch
 etwas auszusetzen:&quot;IIIIHH, die Karte hat ja gar keinen Firewire Port&quot;!
 Warum guckt Ihr immer auf den PC, dauernd werden Sachen gefordert die Ihr auf dem
 PC gesehen habt, so k&#246;nnt Ihr bald einen neuen IDE-Port fordern, an dem man bis zu
 8 IDE Ger&#228;te anschlie&#223;en kann, dieser Port wird jetzt bald auf den Markt kommen,
 aber was will man damit ??? Die Standarts f&#252;r den AGP-Port werden auch dauernd
 ge&#228;ndert, so w&#228;re ein AGP-Port in ein bis zwei Jahren schon wieder out!</P>

 <p>Jetzt rechne ich Euch mal etwas vor: PCI-Board = 420,-, Grafikkarte = 220,-,
 Soundkarte = 50,-, TV-Karte = 190,-.  Das ist billig und hat mehr Leistung als der
 Zorro-M&#252;ll.    Insgesammt: 880,-
 Zorro4-Board = 170,-, Grafikkarte(Picasso4) = 400,-(gebraucht), Paloma = 300,-,
 Soundkarte = 300,-(Clockport)   Insgesammt = 1170,-,dabei mu&#223; aber noch bedacht
 werden das das Zorrozeug langsamer ist und die TV-Erweiterung f&#252;r die Picasso kein
 Radio, keine Fernbedienung und kein Stereo hat, au&#223;erdem hat die Picasso nichtmal
 3D, au&#223;er man ist gewillt nochmal viel Geld auszugeben!!!</P>

<p> Dann behauptet Ihr das PCI veraltet sei und im selben Text vordert Ihr das noch
 Zorro-Steckpl&#228;tze auf die Boards sollen, also ist Zorro nicht veraltet und PCI ist
 veraltet, auf welchen Mond welches Planeten wohnt Ihr eigentlich?<br>
 Zumindest wei&#223; ich mit Gewissheit das ich jeden Zorro-Amiga mit meinem PCI-Amiga
 abh&#228;ngen kann, au&#223;erdem bin ich total zufrieden mit dieser L&#246;sung und das ist doch
 die Hauptsache, da k&#246;nnt Ihr behaupten was Ihr wollt, aber es gibt alle 2-3 Wochen
 ein Treiberupdate von Elbox und Elbox sind die Erfinder des PCI auf dem Amiga, nicht
 die Firma DCE, die Firma DCE macht nur alles nach, au&#223;erdem hat DCE uns schon sehr
 oft verarscht, mit dem AGA-GO-KIT und den neuen Amigas, wenn ich aber feststellen
 sollte das das G-REX besser unterst&#252;tzt wird als mein Mediator, dann werde ich auf
 das G-REX umsteigen, ich bin ja nicht so engstirnig wie manch anderer User! Leider
 haben aber die neueren Boards von DCE nur 2 DMA f&#228;hige Ports, die &#228;lteren sogar
 nur einen.</P>

<p> Tut mir den Gefallen und h&#246;rt endlich mal auf den Amiganern, die sowieso langsam
 nichtmehr wissen was sie machen sollen, die PCI-L&#246;sungen auszureden, da&#223; bringt
 Euch und den anderen nichts. Macht es gut und helft Euch mal wieder untereinander,
 ich frage mich schon lange warum Ihr nichtmehr so hilfsbereit seid wie vor ein paar
 Jahren?! So h&#228;ttet Ihr doch mal dem Herrn Rolf Nue aus Wue helfen k&#246;nnen, so schwer
 war die Frage nun auch nicht, oder? Dann mache ich es eben, hoffentlich ist es nicht
 zu sp&#228;t, die Frage war in der Ausgabe 80:</P>

<p> Hallo Rolf, ich benutze seit kurzem auch endlich meine Voodoo und hatte das selbe
 Problem, benutze einfach das Prog. NewMode aus dem Aminet oder von den Aminet-CD&#180;s.
 Mit NewMode kannst Du auf jeden Fall PPaint und die mei&#223;ten anderen Progs. umlenken,
 nur mit den mei&#223;ten Spielen wirst Du keinen Erfolg haben. PPaint lenke ich immer auf
 folgenden Screen um: Voodoo:1024*768 16bit PC. Es gehen auch andere Aufl&#246;sungen, so
 habe ich auch mal 800*600, 640*480 und 1120*832 (letzteres benutze ich immer f&#252;r die
 Workbench) erfolgreich getestet. Hoffentlich kann ich Dir damit noch helfen!
 Macht es gut:</P>
                            <p>Poldi</P>

</p>

</td></tr></table>
<br>
</body>
</html>
