<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p><font size="-1"> Bildschirm zu klein? Dann klicke
<a href="st_falschgeld.html" target="_top"> <b>hier</b></a>
&nbsp; &nbsp; &nbsp; und zur&uuml;ck zur NoCover? Dann klicke
<a href="index.html" target="_top"> <b>hier</b></a></font>
</p>

<p align=center><font color="#000080" size="7"><b>Falschgeld</b></font></p>

<p>Gerade wurde der Euro eingef&uuml;hrt und wir wissen nun, wie das Geld
ausschaut. Aber daran gew&ouml;hnt haben wir uns noch nicht, Die
Gr&ouml;&szlig;e, die Farbenpracht, alles ist noch ungewohnt. Um uns gerade
in der Anfangszeit vor potenziellen Euro-F&auml;lschern zu sch&uuml;tzen,
hat die Polizei einen Bl&uuml;tentrainer ins Netz gestellt. Das "Spiel"
funktioniert wie ein Bilderr&auml;tsel. Anhand von zwei
gegen&uuml;bergestellten Geldscheinen muss man Fehler in der Bl&uuml;te
erkennen. Wer richtig gut ist, landet in der Highscore-Liste. </p>

<p><b><font color="#0000ff"><a href="http:www.propk.de/aktionen/euro/sicherheitsmerkmale">www.propk.de/aktionen/euro/sicherheitsmerkmale</a> 
</font></b><br> <img src="st_falschgeld1.gif" width=320 heigth=240
align=left alt="" hspace=6> Wer nun diese Website vollst&auml;ndig
betrachten m&ouml;chte und am Anfang einsteigt, muss leider auf einen PC
ausweichen. Die Amigabrowser verstehen die fortgeschrittenen Javascripts
nicht und erzeugen viele Fehler. Auch schon auf der Startseite erscheint
ein Requester mit der Frage: "continue install Flash?". Auf dem Amiga hilft
nur der Cancel-Knopf. Trotzdem sieht man sehr viel, aber leider nicht
alles. <br clear=all></p>

<p><img src="st_falschgeld2.gif" width=450 heigth=50 align=left alt=""
hspace=6> Diese Schaltleiste verzweigt nun auf die einzelnen Banknoten mit
der Erl&auml;uterung und Darstellung aller Sicherheiten. Funktioniert aber
mit IBrowse2.2 nicht, da dieser JavaScript nicht verstanden wird. </p>

<p><img src="st_falschgeld3.gif" width=190 heigth=220 align=left alt=""
hspace=6>Auf dieser Website sollte man trotzdem eine Seite vorher
einsteigen: <b><font color="#0000ff"><a href="http:www.propk.de/aktionen/euro/">www.propk.de/aktionen/euro/</a>
</font></b> und auf der Seite etwas nach unten gehen, da die gro&szlig;e
Animation ausgeblendet bleibt. Die &Uuml;berschrift lautet: <b>Der Euro
kommt</b>. <br> Er ist ja nun schon da. das Geld f&uuml;r die Gemeinschaft.
</p>

<p>Die Deutsche Mark verlor mit Ablauf des 31.12.2001 ihre Eigenschaft als
gesetzliches Zahlungsmittel in der Bundesrepublik Deutschland. An ihre
Stelle traten Euro und Cent. Die Euro-Banknoten gibt es in sieben
St&uuml;ckelungen zu 5, 10, 20, 50, 100, 200 und 500 Euro, wobei die
Banknoten aller Teilnehmerl&auml;nder identisch sind. Die Euro-M&uuml;nzen
gibt es in acht St&uuml;ckelungen zu 1, 2, 5, 10, 20 und 50 Cent sowie zu 1
und 2 Euro. Die M&uuml;nzen haben im Gegensatz zu den Euro-Banknoten eine
einheitliche Vorderseite und eine l&auml;nderspezifische R&uuml;ckseite.
Auf den deutschen 1- und 2-Euro-M&uuml;nzen ist der Bundesadler abgebildet,
die 10-, 20- und 50-Cent-M&uuml;nzen zeigen das Brandenburger Tor und die
1-, 2- und 5-Cent-M&uuml;nzen einen Eichenzweig.</p>

<p>Die Banken haben nun einen immensen logistischen Kraftakt hinter sich.
Der erforderliche Bargeld-Austausch f&uuml;r die rund 82 Millionen
Einwohner der Bundesrepublik ist innerhalb weniger Wochen &uuml;ber die
B&uuml;hne gegangen - ein Prozess, der ohne Beispiel ist und ganz besondere
Anstrengungen erforderte. Bis zum Jahreswechsel wurden deutsche Banknoten
im Wert von 274 Mrd. DM und M&uuml;nzen im Wert von 15,8 Mrd. DM
ausgetauscht, die sich bis dato im Umlauf befanden. Aber das Ende ist damit
noch nicht erreicht. </p>

<p>Auf der hier nun angesprochenen Website wird auf den folgenden Seiten
neben einem <b><font color="#0000ff"> Zeitplan zur Euro-Einf&uuml;hrung
</font></b> auch zahlreiche <b><font color="#0000ff">
Sicherheitsempfehlungen </font></b> f&uuml;r den B&uuml;rger sowie
wertvolle Hinweise, wie sich <b><font color="#0000ff">
Wirtschaftsunternehmen </font></b> gegen m&ouml;gliche Risiken im
Zusammenhang mit der W&auml;hrungsumstellung und der Einf&uuml;hrung des
Euro wappnen k&ouml;nnen hingewiesen. </p>

<p>Die Seiten, die ich besonders empfehlen m&ouml;chte, sind <b><font
color="#0000ff"> EURO-&quot;Bl&uuml;tentrainer&quot; </font></b> und
<b><font color="#0000ff"> Sicherheitsmerkmalen </font></b>(eingangs
angef&uuml;hrt). Hier wird man mit der neuen W&auml;hrung vertraut gemacht.
Nat&uuml;rlich kann man sein Wissen auch gleich an Ort und Stelle auf den
Pr&uuml;fstand stellen. Doch bitte beachtet: Bis Februar 2002 beh&auml;lt
die D-Mark als Zahlungsmittel G&uuml;ltigkeit. Ganoven k&ouml;nnten also
versuchen, in n&auml;chster Zeit noch verst&auml;rkt D-Mark-Falschgeld in
Umlauf zu bringen. </p>

<p>Deshalb gibt es auch eine Seite, die uns mit den <b><font
color="#0000ff"> Sicherheitsmerkmalen </font></b> der D-Mark vertraut
macht. Anschlie&szlig;end k&ouml;nnen wir unser Wissen mit dem <b><font
color="#0000ff"> "D-Mark-Bl&uuml;tentrainer" </font></b> testen - und somit
den Gefahren trotzen, die sich aus der D-Mark/Euro-Umtauschphase ergeben
k&ouml;nnen. Haben wir alle wichtigen Details erkannt? Dann tragen wir uns
doch einfach in die Highscore-Rangliste ein. Viel Spa&szlig;!</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
