<html>
<head>
<title>Wolf hat wieder etwas zu sagen</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Etwas zum
Lachen</b></font></p>

<p> Ein fr&ouml;hliches und stets gesundes neues Jahr 2002 w&uuml;nscht
Euch allen der liebe Higgins. Und damit es auch gleich wirklich etwas
fr&ouml;hlicher beginnen kann, gibt es nun ein paar Witze zu lesen.... </p>

<p><b>Was w&uuml;rde Honecker sagen?</b><dl>

<dt>Eine Regierungsdelegation ist mit der Transsibirischen Eisenbahn
unterwegs. Pl&ouml;tzlich h&auml;lt der Zug. Die Genossen steigen aus und
stellen fest: Die Schwellen der Gleise wurden gestohlen. Sie beratschlagen
und &uuml;berlegen. </dt>

<dd><b>Was w&uuml;rde LENIN machen? </b></dd>

<dd>Der w&uuml;rde sagen: "Komsomolzen vortreten, marsch in den Wald und
Schwellen schlagen." </dd>

<dd><b>Was w&uuml;rde STALIN sagen? </b></dd>

<dd>"Verantwortliche vortreten an die Wand!" - und rat-dat-dat-dat-dat
(alle werden erschossen). </dd>

<dd><b>Was w&uuml;rde Honecker sagen? </b></dd>

<dd>"Parteigenossen raustreten, an die Wagen treten und sch&uuml;tteln,
damit die andern denken es geht weiter." </dd> </dl> </p>

<p><b>Biologie</b><dl>

<dt>Lehrerin: "Wer morgen wei&szlig;, wo die Babys herkommen, darf
fr&uuml;her nach Hause." </dt>

<dt>Paul fragt zu Hause seine Oma, die ihm erkl&auml;rt: </dt>

<dd>"Babys kommen aus dem Apfelbaum!" </dd>

<dt>Am n&auml;chsten Morgen steckt sich Paul einen Apfel in die
Hosentasche. Auf die Frage der Lehrerin fa&szlig;t er in die Tasche und
fragt: </dt>

<dd>"Soll ich ihn rausholen?" &nbsp; &nbsp; -</dd>

<dd>"Nein, aber du darfst gehen..." </dd></dl></p>


<p><b>Was ist daran schlimm? </b><dl>

<dt>Und welche Sorgen hat der Zoodirektor mit seinen L&ouml;wen? </dt>

<dt>"Sie gemeingef&auml;hrlicher Trottel", schimpft der den Pfleger in
Grund und Boden. "Sie haben gestern Abend den L&ouml;wenk&ouml;fig
unverschlossen gelassen." </dt>

<dt>"Was ist daran schlimm?", reagiert der Pfleger beleidigt. "Wer klaut
schon wilde L&ouml;wen?" </dt></dl></p>


<p><b>Die Bayern sind doch die Besten?</b><dl>

<dt>3 Haie treffen sich irgendwo im Meer, sagt der Erste: </dt>

<dd>"Mir geht's &uuml;berhaupt nicht gut! Ich hab heute Mittag einen
T&uuml;rken gefressen. Der hat so viel Kebab intus gehabt, mir is ganz
schlecht." </dd>

<dt>Sagt der Zweite: </dt>

<dd>"Das is noch gar nichts! Ich hab letzte Woche einen Russen gefressen,
der hat soviel Wodka intus gehabt; mir is immer noch ganz schwummrig."
</dd>

<dt>Da meint der Dritte: </dt>

<dd>"Das ist alles noch gar nichts im Vergleich was mir passiert ist! Ich
hab letztes Monat einen Bayern gefressen, der hat so viel Luft im Kopf
gehabt; ich kann noch immer nicht tauchen!!!" </dd></dl></p>


<p><b>Eigene Interpretation </b><dl>

<dt>Die Kinder in der Schule sollen Weihnachtskrippen zeichnen. Josef,
Maria, Jesuskind, Ochs und Esel - alle bekannten Krippenfiguren tauchen
auf. Der kleine Michael hingegen zeichnet ein kleines, breit grinsendes
M&auml;nnchen dazu. Auf die Frage der Lehrerein, wer das sei, sagt er:
</dt>

<dd>"Das ist der Owie." </dd>

<dd>"Wie kommst du denn darauf?" </dd>

<dd>"Es hei&szlig;t doch im Lied Stille Nacht, heilige Nacht! Gottes Sohn,
o wie lacht..." </dd></dl></p>


<p><b>Warum auf den Christbaum ein Engel geh&ouml;rt.... </b><dl>

<dt>Es war einmal...vor langer langer Zeit, kurz vor Weihnachten, als der
Weihnachtsmann sich auf den Weg zu seiner allj&auml;hrlichen Reise machen
wollte, aber nur auf Probleme stie&szlig;. Vier seiner Elfen feierten
krank, und die Aushilfs-Elfen kamen mit der Spielzeug-Produktion nicht
nach. Der Weihnachtsmann begann schon den Druck zu sp&uuml;ren den er haben
w&uuml;rde, wenn er aus dem Zeitplan geraten sollte. Dann erz&auml;hlte ihm
seine Frau, dass Ihre Mutter sich zu einem Besuch angek&uuml;ndigt hatte.
</dt>

<dt>Die Schwiegermutter hat dem armen Weihnachtsmann gerade noch gefehlt.
Als er nach drau&szlig;en ging um die Rentiere aufzuz&auml;umen, bemerkte
er, dass 3 von ihnen hochschwanger waren und sich zwei weitere aus dem
Staub gemacht hatten, der Himmel wei&szlig; wohin. Welch Katastrophe. Dann
begann er damit den Schlitten zu beladen, doch eines der Bretter brach und
der Spielzeugsack fiel so hart zu Boden, dass das meiste Spielzeug
zerkratzt wurde! So ein Shit! So frustriert ging der Weihnachtsmann ins
Haus, um sich eine Tasse mit heissem Tee und einem Schuss Rum zu machen.
Jedoch musste er feststellen, dass die Elfen den ganzen Schnaps gesoffen
hatten. In seiner Wut glitt ihm auch noch die Tasse aus den H&auml;nden und
zersprang in tausend kleine St&uuml;cke die sich &uuml;ber den ganzen
K&uuml;chenboden verteilten. </dt>

<dt>Jetzt gab`s nat&uuml;rlich Ärger mit seiner Frau. Als er dann auch noch
feststellen musste, dass M&auml;use seinen Weihnachts-Stollen angeknabbert
hatten wollte er vor Wut fast platzen. Da klingelte es an der T&uuml;r. Er
&ouml;ffnete und da stand ein kleiner Engel mit einem riesigen Christbaum.
Der Engel sagte sehr zur&uuml;ckhaltend: </dt>

<dd>"Frohe Weihnachten Weihnachtsmann! Ist es nicht ein sch&ouml;ner Tag.
Ich habe da einen sch&ouml;nen Tannenbaum f&uuml;r dich. Wo soll ich den
denn hinstecken?" </dd>

<dt>... Und so hat die Tradition mit dem kleinen Engel auf der
Christbaumspitze begonnen........ </dt></dl></p>


<p><b>Gute Organisation </b><dl>

<dt>Meine Familie ist wie ein Staat organisiert: </dt>
<dt>Meine Frau ist der Finanzminister, </dt>
<dt>meine Schwiegermutter ist der Kriegsminister, </dt>
<dt>meine Tochter der Au&szlig;enminister. </dt>
<dt>Ich bin das Volk und muss alles bezahlen... </dt></dl></p>


<p><b>Was er haben will, soll er bekommen </b><dl>

<dt>"Herr Ober, bringen Sie mir bitte eine Forelle." </dt>

<dt>Ein zweiter Gast: "Mir auch, Herr Ober. Aber recht frisch." </dt>

<dt>Da geht der Ober in die K&uuml;che und ruft: </dt>

<dd>"Zweimal Forelle. Eine davon frisch!" </dd></dl></p>


<p>Noch weiterhin viel Spass mit der aktuellen NoCover <br>
Euer HIGGINS <br>
Cord Hagen  </p>

</td></tr></table>
<br>
</body>
</html>
