<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset &gt; Uutiset &gt; Uutisia Amiga-maailmasta</title>
	</head>

	<body bgcolor="#ffffff" link="#000066" vlink="#000066" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<div align="center">
			<font size="2"><a name="TOP"></a></font>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Ajankohtaiset</a>&nbsp;&nbsp;&nbsp;</font><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="0" cellpadding="0">
				<tr>
					<td align="center" width="100%">
						<div align="center">
							<font face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="uutiset.html" target="_self"><img src="nappulat/amiga_nyt.gif" alt="Amiga nyt" height="21" width="88" border="0"></a><a href="amiga_uutisia.html" target="_self"><img src="nappulat/uutiset_f2.gif" alt="Uutiset" height="21" width="88" border="0"></a><a href="laiteuutiset.html" target="_self"><img src="nappulat/laitteistot.gif" alt="Laitteistot" height="21" width="88" border="0"></a><a href="ohjelmistouutiset.html" target="_self"><img src="nappulat/ohjelmistot.gif" alt="Ohjelmistot" height="21" width="88" border="0"></a><a href="paivitykset.html" target="_self"><img src="nappulat/paivitykset.gif" alt="P&auml;ivitykset" height="21" width="89" border="0"></a></font></div>
					</td>
				</tr>
			</table>
			<font size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">
				<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
					<tr>
						<td align="center" bgcolor="navy"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Uutisia Amiga-maailmasta</b></font></td>
					</tr>
				</table>
				<br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<font size="2"><b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Bill McEwenin Executive Update -tiedotteet</font></b></font></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Edellisen Sakun j&auml;lkeen Amigan toimitusjohtaja Bill McEwen on julkaissut kolme uutta Executive Update -tiedotetta. Onko n&auml;iss&auml; mit&auml;&auml;n uutta tai konkreettista asiaa?&nbsp;Luomme lyhyen katsauksen kuluneiden kuukausien tsemppauspuheisiin.<br>
								<br>
							</font>
							<table width="100%" border="0" cellspacing="0" cellpadding="3" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">23. kes&auml;kuuta 2002</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tiedote alkaa kuten niin monet aiemmatkin: huhujen ja v&auml;&auml;rien tietojen suossa tarponutta Amiga-yhteis&ouml;&auml; kiitell&auml;&auml;n j&auml;lleen k&auml;rsiv&auml;llisyydest&auml; ja ymm&auml;rt&auml;v&auml;isyydest&auml;. Asiat ovat kuitenkin Billin mukaan menossa kovasti eteenp&auml;in, ja liikett&auml; l&ouml;ytyy. Taaskaan ei julkisuuteen ole kerrottu liikoja, mutta nyt pit&auml;isi taas olla tulossa jotain Todellista, josta kannattaa kertoa yst&auml;ville ja tutuille. N&auml;ink&ouml; on?<br>
								<br>
								Jonkinlaista asiaakin tiedotteesta l&ouml;ytyy kaiken kuorrutuksen alta. Party Packin ostaneille tarjotaan viimein vaihtoehtoja hy&ouml;dynt&auml;&auml; luvattu 100 dollarin alennus AmigaOnesta ja/tai OS 4:st&auml;. Ostamalla tuotteet suoraan Amigan kotisivuilta alennuksen saa heti. AmigaOnen ja OS4:n tai pelk&auml;n OS4:n ostaneet voivat l&auml;hett&auml;&auml; SDK:n manuaalin etusivun sek&auml; ostokuitin Amigalle, ja paluupostissa tulee 100 dollarin shekki. Kolmas vaihtoehto on kertoa etuk&auml;teen, milt&auml; kauppiaalta aikoo tuotteet ostaa, ja Amiga hoitaa rahat suoraan kauppiaalle. Saa n&auml;hd&auml;, miten homma k&auml;yt&auml;nn&ouml;ss&auml; toimii...<br>
								<br>
								AmigaOnen ja OS4:n tilanteesta ei varsinaisesti kerrota mit&auml;&auml;n uutta, vaikka teksti&auml; onkin kappaletolkulla. AmigaOne-emolevyjen live-esittelyt ja OS4-demonstraatiot ovat Billin mukaan saaneet valtavasti palautetta. Tiedotteen mukaan OS4:&auml;&auml;n tulee joitakin sellaisia osia, jotka oli tarkoitus julkaista vasta my&ouml;hemmiss&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;versioissa. Taustalla tehd&auml;&auml;n edelleen koko ajan lujasti t&ouml;it&auml;, mutta mit&auml;&auml;n valmistumisaikatauluja ei anneta: mainitaan vain, ettei tuotteiden kanssa h&auml;t&auml;ily ja kiirehtiminen palvele ket&auml;&auml;n.<br>
								<br>
								Koska Amiga vaihtaa tuotteidensa nimi&auml; ja nime&auml;mistapaa useammin kuin moni sukkiaan, ovat k&auml;ytt&auml;j&auml;t syyst&auml;kin sekaisin termiviidakossa. Mik&auml; ihmeen Amiga Anywhere, eik&ouml; se vasta ollut AmigaDE? McEwen yritt&auml;&auml; selvent&auml;&auml; asiaa kertomalla, ett&auml; AACE - Amiga Anywhere Content Engine - on vain AmigaDE:n osa ja luotiin niit&auml; varten, jotka haluavat sis&auml;lt&ouml;&auml;, eiv&auml;t t&auml;ydellist&auml; DE-ymp&auml;rist&ouml;&auml;. AACE on ik&auml;&auml;n kuin DE:n minimiversio - mit&auml; se sitten ikin&auml; tarkoittaakaan.<br>
								<br>
								Aiemman riehumisen ja oikeusjutuilla uhkailun sijaan Amiga n&auml;ytt&auml;&auml; nyt loiventaneen linjaansa. Aiemmin uhkailtu Amithlon on nyt saanut Amigan tuen taakseen, ja tekij&auml; Bernd Meyerin kanssa on tehty sopimus. Uutta versiota lupaillaan, ja ty&ouml;nimell&auml; Amithlon 2.0 kulkevaan ohjelmistoon on tulossa lisensoitu Kickstart 3.1 sek&auml; osia OS&nbsp;3.9:st&auml;. <a href="http://www.amithlon.net/demo.shtml" target="_blank">Demoversion</a> piti valmistua jo hein&auml;kuun alussa, mutta mit&auml;&auml;n ei ole viel&auml; n&auml;kynyt.<br>
								<br>
								Tiedotteen lopussa julkistettu kuponkikampanja oli kaikessa sekavuudessaan j&auml;lleen todellinen tempaus. 50 dollarin arvoisen kupongin ostamalla sai osoittaa halukkuutensa ostaa AmigaOne sitten kun se ilmestyy, ja kiitokseksi luvattiin 50 dollarin alennus tuotteesta sek&auml; ilmainen T-paita. Luvassa piti olla my&ouml;s hulppeita AmigaOnen, OS4:n ja promootiokr&auml;&auml;s&auml;n arvontoja sen mukaan, ylitet&auml;&auml;nk&ouml; 2500, 5000, 10000, 25000 tai 50000 myydyn kupongin rajapyykki.<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font>
							<table width="100%" border="0" cellspacing="0" cellpadding="3" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">1. hein&auml;kuuta 2002</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font>
							<table width="100%" border="0" cellspacing="2" cellpadding="0">
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
								<tr>
									<td valign="top" width="50%"></td>
									<td valign="top">
										<div align="center">
											<a href="http://www.amiga-anywhere.com/" target="_blank"><img src="kuvat/webshots/amigaanywhere.jpg" alt="" height="193" width="320" border="0"></a></div>
									</td>
									<td valign="top" width="50%"></td>
								</tr>
								<tr>
									<td colspan="3" valign="top">&nbsp;</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kuten arvata saattoi, kuponkih&auml;ss&auml;kk&auml; sai surkuhupaisat mittasuhteet, kun Amiga-kansa alkoi ihmetell&auml;, mist&auml; oikein tarkalleen on kyse: rahankeruusta, h&ouml;mpp&auml;promootiosta, silkasta hulluudesta vai aidosta v&auml;litt&auml;misest&auml;? Koko hein&auml;kuun tiedote on k&auml;yt&auml;nn&ouml;ss&auml; McEwenin yritys selvitt&auml;&auml;, miksi kuponkitouhuun ruvettiin ja mihin sill&auml; pyrit&auml;&auml;n - siin&auml; sen kummemmin onnistumatta. &quot;I am Amiga&quot; -paita ja elinik&auml;inen j&auml;senyys jossain geneerisess&auml; kerhossa l&auml;hestulkoon kruunasi kaiken korniudessaan... Kaiken sekoilun ja osallistumisajan jatkamisen j&auml;lkeen kuponkeja meni lopulta kaupaksi tuhatkunta.<br>
								<br>
							</font>
							<div align="left">
								<table width="100%" border="0" cellspacing="0" cellpadding="3" bgcolor="#fff8dc">
									<tr>
										<td bgcolor="#f0f8ff">
											<div align="center">
												<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">5. syyskuuta 2002</font></b></font></div>
										</td>
									</tr>
								</table>
								<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
									Parin kuukauden hiljaisuuden j&auml;lkeen McEwen palaa estradille julistamalla, ett&auml; he ovat yh&auml; maisemissa, aikovat pysy&auml;kin siell&auml;, ovat aina vain tiukasti ty&ouml;n touhussa ja ett&auml; Amigassa on aina ollut kyse yhteis&ouml;st&auml;, ihmisist&auml;, teknologiasta ja paremmuudesta... J&auml;ik&ouml;h&auml;n nyt joku levy j&auml;lleen kerran p&auml;&auml;lle?<br>
									<br>
									Edellisen tiedotteen Amithlon-hypetys oli sittenkin vain hetkellinen hempeyskohtaus. Amiga oli antanut elokuun loppuun asti katuma-aikaa niille (tarkemmin nime&auml;m&auml;tt&auml; j&auml;&auml;ville) ihmisille, yrityksille ja tahoille, joiden se katsoi laittomasti levitt&auml;neen tai hy&ouml;dyksik&auml;ytt&auml;neen Amigalle kuuluvaa tietosis&auml;lt&ouml;&auml;. T&auml;ss&auml; tiedotteessaan McEwen kertoo, ett&auml; seuraavan kahden viikon aikana Amiga aikoo ryhty&auml; oikeustoimiin yksi kerrallaan niit&auml; vastaan, jotka eiv&auml;t ole reagoineet kehotuksiin.<br>
									<br>
									AmigaOne ja OS4:kin ovat Billin mukaan j&auml;lleen edistyneet. Julkaisuajankohdasta ei kerrota sen enemp&auml;&auml; kuin aiemminkaan, mainitaan vain, ett&auml; se ei ole en&auml;&auml; kaukana (loppuvuodesta on huhuttu). OS4:n AmiDock-ohjelmapalkista julkaistiin jonkin verran <a href="http://os.amiga.com/os4/OS4AmiDock.php" target="_blank">kuvia ja tietoa</a> uteliaisuuden ruokkimiseksi. Sendo-&auml;lypuhelimen mukana kerrotaan tulevan Amiga Anywhere ja sis&auml;lt&ouml;paketti, mutta tarkemmasta kaupallisesta julkaisuajankohdasta ei Sendonkaan osalta ole varmaa tietoa.<br>
									<br>
									Ja pitih&auml;n t&auml;ll&auml;kin tiedotteella saada soppaa sekoitettua j&auml;lleen kerran: aiemmin - viel&auml; edellisen tiedotteen aikoihin - Amithlon*:na tunnettua Bernd Meyerin tuotetta, jolla siis t&auml;ll&auml; hetkell&auml; ei ole ilmeisesti nime&auml; ollenkaan (paratkoon, Princekin vaihtoi jo taiteilijanimens&auml; takaisin), suunnitellaan esiasennettavaksi Linux/UAE-varusteltuihin kannettaviin tietokoneisiin.<br>
									<br>
									Mit&auml; sitten oikeasti tapahtuu, j&auml;&auml; n&auml;ht&auml;v&auml;ksi. Syyskuun toiseksi viimeisen&auml; viikonloppuna, viikko ennen yhdistyksen vuosikokousta, pit&auml;isi l&auml;hinaapurissamme G&ouml;teborgin AOne 2002 - tapahtumassa olla esittelyss&auml; sek&auml; Pegasos ett&auml; AmigaOne - odotamme syyst&auml;kin mielenkiinnolla, mit&auml; tuleman pit&auml;&auml;.<br>
									<br>
								</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&gt; <a href="http://www.amiga.com/corporate/062302-mcewen.shtml" target="_blank">Executive Update 23. kes&auml;kuuta 2002</a><br>
									&gt;&nbsp;<a href="http://www.amiga.com/corporate/070102-mcewen.shtml" target="_blank">Executive Update 1. hein&auml;kuuta 2002</a><br>
									&gt;&nbsp;<a href="http://www.amiga.com/corporate/090502-mcewen.shtml" target="_blank">Executive Update 5. syyskuuta 2002</a><br>
								</font></div>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="#4682b4">
				<tr>
					<td align="center" bgcolor="#b0c4de">
						<center>
							<font size="2" color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
										<tr>
											<td><a title="Alkuun" href="#TOP" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
										</tr>
									</table>
								</b></font><font size="3" color="black" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Tapahtumia maailmalla - my&ouml;s Ruotsissa</b></font></center>
					</td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="left">
										<font size="2" color="#cc3333" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>&gt; <a href="http://www.amigbg.com/aonegbg/" target="_blank">www.amigbg.com/aonegbg</a></b></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="center">
										<a href="http://www.amigaone-irc.net" target="_blank"><img src="kuvat/webshots/aonegbg.jpg" alt="" height="193" width="320" border="0"></a></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Rakkaat naapurimme ruotsalaiset ovat kovasti kirineet kiinni etumatkaamme Amiga-tapahtumien j&auml;rjest&auml;misess&auml;. Vuosikausien hiljaiselon j&auml;lkeen toimintaan her&auml;nnyt Ruotsin Amiga-yhteis&ouml; j&auml;rjest&auml;&auml; jo toisen ison tapahtumansa, AOne 2002:n, G&ouml;teborgissa 21. syyskuuta. Skandinavian ensiesittelyss&auml; on tuolloin AmigaOne-laitteisto. Seuraavana p&auml;iv&auml;n&auml;, 22. syyskuuta pidet&auml;&auml;n samoissa tiloissa Pegasos Gothenburg 2002 -tapahtuma, jossa puolestaan on Skandinavian ensiesittelyss&auml; Pegasos.<br>
							<br>
							&gt;&nbsp;<a href="http://www.amigbg.com/aonegbg/" target="_blank">AOne Gothenburg 2002 Event<br>
							</a>&gt; <a href="http://www.pegasos.org/" target="_blank">Pegasos Gothenburg 2002 Event</a></font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
							<tr>
								<td valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<a href="http://amiga.realdreams.cz/local/3_8amiwest02.html" target="_blank"><img src="kuvat/webshots/amiwest.jpg" alt="" height="193" width="320" border="0"></a></div>
								</td>
								<td valign="top" width="50%"></td>
							</tr>
							<tr>
								<td colspan="3" valign="top">&nbsp;</td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tutustu my&ouml;s hein&auml;kuun lopussa Yhdysvalloissa pidetyn AmiWest 2002-tapahtuman tunnelmiin yll&auml;olevan kuvaraportin ja Ann.lu:n kautta l&ouml;ytyvien raporttien ja uutisten muodossa.<br>
							<br>
							&gt; <a href="http://www.ann.lu/search.cgi?string=AmiWest+2002" target="_blank">AmiWest 2002 Ann.lu search</a></font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="#4682b4">
				<tr>
					<td align="center" bgcolor="#b0c4de">
						<center>
							<font size="2" color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
										<tr>
											<td><a title="Alkuun" href="#TOP" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
										</tr>
									</table>
								</b></font><font size="3" color="black" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Assembly 2002 j&auml;rjestettiin elokuussa</b></font></center>
					</td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Yhdestoista per&auml;kk&auml;inen&nbsp;Assembly-tapahtuma j&auml;rjestettiin elokuun alussa Hartwall Areenalla Helsingiss&auml;. Jo nelip&auml;iv&auml;iseksi venyneeseen tapahtumaan osallistui noin 4000 k&auml;vij&auml;&auml; ja 3000 tietokonetta. Koneelta k&auml;sin tapahtumaa saattoi seurata AssemblyTV:n l&auml;hetyksiss&auml; HTV:n mosaiikkikanavalla sek&auml; paikan p&auml;&auml;ll&auml; partyverkossa tai Internetiss&auml; Real Media ja Windows Media -l&auml;hetyksin&auml;. WM-striimi tosin laukesi jo tapahtuman alkumetreill&auml;, joten k&auml;yt&auml;nn&ouml;ss&auml; ainoa tapa seurata tapahtumaa kotoa oli RM-striimi, joka sekin p&auml;tki aika-ajoin pahasti.<br>
							<br>
							Assembly 2001:n kaltaista menestyst&auml; (yhdistetyn demokisan voitto, Lapsuus by Maturefurk) ei Amigalle t&auml;ll&auml; kertaa suotu. Demokisaan osallistui muutama Amiga-demo, jotka eiv&auml;t kuitenkaan palkintosijoille p&auml;&auml;sseet. Introissa sen sijaan p&auml;rj&auml;ttiin mukavasti:&nbsp;humus3 by Exploder / PUSH Entertainment vei 4k-introjen ylivoimaisen voiton, ja lopullisissa tuloksissa toiselle sijalle nousi Sotakyrp&auml; by Spaceballs &amp; Ephidrena, kun se nostettiin ns. file dropper -PC-intron edelle huonommista pisteist&auml; huolimatta. 64k-introjen toisen sijan vei Future Visions by Potion. Amiga-gruuppina kannuksena ker&auml;nnyt RNO&nbsp;vei Flash-compon voiton jo toisena vuonna per&auml;kk&auml;in tuotoksellaan Super mushroom sisters. T&auml;ydelliset, lopulliset tulokset kaikista compoista n&auml;et Assembly.org:n <a href="http://www.assembly.org/files/asm02revisedresults.txt" target="_blank">virallisesta tuloslistasta</a>. Helpoimmin p&auml;&auml;set imuroimaan kilpailuproduktiot MBnet a'waken <a href="http://www.mbnet.fi/awake/tulokset/" target="_blank">tulossivulta</a>. Assembly-demot ja paljon muuta l&ouml;yd&auml;t my&ouml;s demoscenett&auml;j&auml;n perussivustolta, scene.orgista:</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="left">
										<font size="2" color="#cc3333" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>&gt; <a href="http://www.scene.org" target="_blank">www.scene.org</a></b></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.scene.org" target="_blank"><img src="kuvat/webshots/sceneorg.jpg" alt="" height="193" width="320" border="0"></a></font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">My&ouml;s kotimainen amigistikanta oli Assemblyilla edustettuna useamman k&auml;vij&auml;n voimin. Valitettavasti ainuttakaan partyraporttia ei Sakuun saapunut, joten &quot;oi jospa oisin saanut olla mukana&quot; -virsi pit&auml;&auml; viritt&auml;&auml; ilman artikkelia. Luotettavista l&auml;hteist&auml; saatujen tietojen mukaan t&auml;n&auml;kin vuonna kuitenkin j&auml;rjestettiin #amigafin-tapaaminen hallin ulkopuolella ylev&auml;henkisen urheilun eli kovalevynheiton merkeiss&auml;. Finaalien finaalissa akir0 vei niukasti voiton tekniksest&auml;.<br>
							<br>
							&gt;&nbsp;<a href="http://www.assembly.org" target="_blank">Assembly.org<br>
							</a>&gt; <a href="http://www.mbnet.fi/awake/" target="_blank">MBnetin a'wake-sivusto</a><br>
							&gt; <a href="http://jaakotin.dyndns.org/~ksandstr/" target="_blank">#amigafin-miitz0rkuvia</a></font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="#4682b4">
				<tr>
					<td align="center" bgcolor="#b0c4de">
						<center>
							<font size="2" color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
										<tr>
											<td><a title="Alkuun" href="#TOP" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
										</tr>
									</table>
								</b></font><font size="3" color="black" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>TEHO-Amigoille oma IRC-kanava</b></font></center>
					</td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd">
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="left">
										<font size="2" color="#cc3333" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>&gt; <a href="http://www.amigaone-irc.net" target="_blank">www.amigaone-irc.net</a></b></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.amigaone-irc.net" target="_blank"><img src="kuvat/webshots/amigairc.jpg" alt="" height="193" width="320" border="0"></a></font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Niinsanotuille &quot;high-tech&quot;-Amigoille on perustettu oma IRC-kanava. Undernetiss&auml; toimiva #AmigaOne pyrkii olemaan tukikanava AmigaOnen, SharkPPC:n ja CyberStormPPC:n tapaisten kokoonpanojen k&auml;ytt&auml;jille. Kanavalta saa neuvoja ja opastusta uuden laitteiston k&auml;ytt&ouml;&ouml;n. T&auml;st&auml; huolimatta my&ouml;s jokainen nykyinen tai entinen amigisti on tervetullut joukkoon. Suurin osa k&auml;ytt&auml;jist&auml; on Englannista ja Euroopasta, mutta vierailijoita on ymp&auml;ri maailman.<br>
							<br>
							&gt;&nbsp;<a href="http://www.amigaone-irc.net/" target="_blank">#AmigaOne IRC&nbsp;channel website<br>
							</a>&gt; <a href="http://www.undernet.org/" target="_blank">Lista Undernetin IRC-palvelimista</a></font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Ajankohtaiset</a>&nbsp;&nbsp;&nbsp;&nbsp;</font><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#TOP">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><font size="2"><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<font size="2" color="#4682b4" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font></div>
	</body>

</html>