<HTML><HEAD>
    <TITLE>AmZeiger 09/97 - WB Tuning Teil: 2/6</TITLE>
</HEAD><BODY BACKGROUND="../images/bg.gif">
<CENTER><H1><U>WB Tuning Teil: 2/6</U></H1><BR>von<BR><A HREF="mailto:G.Franz@BBrands.in-brb.de">Gregor Franz</A></CENTER>

<P>Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench,
der Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich
gibt es unz&auml;hlige Programme, Patches usw. die dazu beitragen (wollen).
Ich werde nicht auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar
Anregungen und Tips bei sein werden, die noch nicht allen bekannt sind.</P>
<P>Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es
kann sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht
in jedem Fall explizit ein. Eine Demoversion ist so gut wie immer frei
erh&auml;ltlich. Als Quelle fungiert das <A HREF="http://ftp.uni-paderborn.de/aminet/">AMINET</A>.</P>
<P>Verschiedene Funktionen sind auch in Multifunktions-Commodities
integriert, im Teil 6 werde ich auf ein Beispiel hierf&uuml;r eingehen.</P>

<P><TABLE BORDER=0 ALIGN=CENTER>
<TR><TD COLSPAN=2>Der Kurs setzt sich aus folgenden Artikeln zusammen:</TD></TR>
<TR><TD><OL>
<LI> Optische WB-Verbesserung</LI>
<LI> Smarte ZusatzFX</LI>
<LI> Disk-Tuning</LI>
<LI> Hilfreiche C-Vitamine</LI>
<LI> Sonstige Helferlein</LI>
<LI> Beispiel f&uuml;r Multicommodities: MultiCX</LI>
</OL>
</TD><TD>#1<BR>#2<BR>#3<BR>#4<BR>#4 + #5<BR>#5</TD></TR></TABLE></P>
<BR>

<H2>2. Smarte ZusatzFX</H2>

<P><B>Im</B> vergangenen Kursteil hatten wir uns mit der Versch&ouml;nerung des
Workbench-Outfits besch&auml;ftigt. Dieses Mal dreht sich alles um ZusatzFX.
Smarte noch dazu. Was soll das sein?</P>

<P>Gemeint sind Hilfsprogramme und Patches, die spezielle altbekannte
Funktionen (gerade der WB) ver&auml;ndern und verbessern.</P>

<P>Die Klassifizierung f&auml;llt nicht immer leicht, auch fallen einige in Frage
kommende `Objekte` in andere Kursteile, so z.B. in den `Disk-Tuning`-Teil.</P>

<P>Doch ich lege einfach mal los:</P>

<P>Wen hat es nicht schon gest&ouml;rt? Die Shortcuts der WB sind teilweise
schwer zu merken und was noch schlimmer ist: Viele Funktionen sind gar
nicht erreichbar. Abhilfe schafft <B>ReKeyIt</B>, ein kleines Commodity,
welches selbstdefinierte Tastaturk&uuml;rzel verwaltet. Mit Hilfe eines MUI-
Prefsprogrammes kann man sehr komfortabel alte K&uuml;rzel ab&auml;ndern oder neue
hinzuf&uuml;gen.</P>

<P><B>AppMenuCX</B>, das CX deutet schon auf ein Commodity hin, erweist sich als
hilfreich, wenn man dem Hilfsmittel-Men&uuml; der Workbench eigene Eintr&auml;ge
hinzuf&uuml;gen will. Es ist nur eines von vielen Tools, die einem diese
M&ouml;glichkeit bieten, aber recht gut konfigurierbar.</P>

<P>Das folgende Programm bietet ebenfalls diese Funktion und noch viel mehr.
<B>Toolmanager</B> ist schon legend&auml;r. Wenn man sich auf die nicht ganz simple
Konfiguration erst einmal eingefuchst hat, macht es Spa&szlig; individuelle
Docks zusammenzustellen, die einem schnellen Zugriff auf die am h&auml;ufigsten
ben&ouml;tigten Programme bieten.</P>

<P>Docks sind waagerecht oder senkrecht auf der WB positionierbare B&auml;nke mit
Eintr&auml;gen (beliebiger Text oder Icon oder Bildchen), die, auf einen Klick
hin, ein definierbares Programm aufrufen. Wenn man bei ToolManager einen
Text auf das Editor-Icon zieht, wird zus&auml;tzlich versucht die Applikation
mit dieser Datei zu starten, der Text wird also automatisch in den
ge&ouml;ffneten Editor eingeladen. Ob das funktioniert, richtet sich aber
nach den jeweiligen Programmen.</P>

<P>Als n&auml;chstes nehmen wir uns die Shell vor. F&uuml;r Puristen, die zwar keine
umfassende, aber doch hilfreiche Verbesserung w&uuml;nschen, ist <B>AppCon</B> genau
das richtige. Dieses kleine Tool mu&szlig; mit `Run` in der Shell-Startup
gestartet werden. Sodann lassen sich Icons in die Shell ziehen und
es erscheint automatisch der vollst&auml;ndige Pfad der Datei am Cursor.</P>

<P>Noch sehr viel weiter geht <B>KingCON</B>, die Mutter der Shell-Utilities. Es
bietet zus&auml;tzlich auch Dinge, wie automatisch vervollst&auml;ndigte Filenamen
mit der Tab-Taste (wenn man nur den Anfang eingegeben hatte) oder einen
Filerequester und nicht zu vergessen auch eine History des Shell-Textes,
der gepuffert wird, so da&szlig; man im Fenster auch nochmal nach oben scrollen
kann, ein fr&uuml;her doch gelegentlich schmerzlich vermi&szlig;tes Merkmal der
`naturbelassenen` Shell.</P>

<P>Es ist doch &auml;rgerlich wenn man beim `Befehl ausf&uuml;hren` des WB-Men&uuml;s
pl&ouml;tzlich feststellt, da&szlig; man den genauen Dateipfad vergessen hat und
nicht mal schnell nachschauen kann, da die WB in diesem Modus
dummerweise nicht asynchron l&auml;uft und man den Requester erst verlassen mu&szlig;.</P>

<P>Jetzt kann man nat&uuml;rlich sagen: "Selber schuld. Besser gleich die
Shell nehmen". Aber warum solch ein Aufwand? ;) Denn das ist ja doch
nur ein Beispiel, um eine Anwendung von <B>StringReq</B> aufzuzeigen.</P>

<P>Denn wenn man in einer solchen Eingabezeile nun doppelklickt, &ouml;ffnet
sich ein Filerequester, der die komfortable Auswahl erm&ouml;glicht und den
Pfad dann als Text an die Zeile &uuml;bergibt. Auch mit manchen anderen
Programmen (man nehme nur F-Key), die die Eingabe von Pfaden verlangen,
aber keine Filerequester anbieten, wird das Leben leichter.</P>

<P>Mit <B>Req2Key</B> wird eine andere Funktion von Requestern ver&auml;ndert. Wenn nun
zahlreiche Kn&ouml;pfe mit Auswahlm&ouml;glichkeiten angeboten werden, so ist es
jetzt m&ouml;glich, mit den F-Tasten die richtige auszuw&auml;hlen, ohne auf die
Maus angewiesen zu sein. Die F3-Taste w&auml;re z.B. der dritte Knopf von
Links. Mit Return kann man leicht auf Auswahlsituationen mit einem oder
zwei Kn&ouml;pfen reagieren (als okay).</P>

<P>Etwas sehr n&uuml;tzliches bietet uns das winzige <B>QuickClose</B>. Wenn man w&auml;hrend
eines Mausklicks auf ein Fenster-CloseGagget eine spezielle Taste h&auml;lt,
werden automatisch alle Mutterverzeichnisse mitgeschlossen.</P>

<P>Wenn man h&auml;ufig mit zahlreichen Screens arbeitet, sorgt <B>ScreenMenu</B> daf&uuml;r,
da&szlig; bei einem Klick mit der rechten Maustaste auf das Wechselgadget rechts
oben in der Bildschirmtitelzeile ein kleines Men&uuml; mit den anspringbaren
Screens erscheint, die man dann direkt anw&auml;hlen kann. L&auml;stiges und
unn&ouml;tiges Mehrfachklickern entf&auml;llt somit.</P>

<P>Zu guter Letzt gehe ich noch kurz auf Programme ein, die einige, nicht mehr
ganz zeitgem&auml;&szlig;e Standard-Mitbringsel der Workbench nicht nur ver&auml;ndern und
verbessern, sondern total ersetzen.</P>

<P>Sehr n&uuml;tzlich ist z.B. <B>CX</B>, welches das originale Exchange &uuml;berfl&uuml;ssig macht.
Mit ihm lassen sich nun u.a. alle Commodities auf einmal aktivieren oder
deaktivieren bzw. entfernen.</P>

<P>Weiterhin gibt es noch einige andere, wie z.B. neue Versionen des
Serial-Prefsprogramms usw.</P>

<P>Das waren sie auch schon: die smarten ZusatzFX. Beim n&auml;chsten Mal gibt
es Tips zum Disk-Tuning. Bis dahin...</P>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../hw/9709maus.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0997/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../kw/9709c.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>

