



<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Joyride Preview</TITLE>
</HEAD>
<BODY TEXT=black background="kback.png" link=red alink=red>

<CENTER><h1><b>Joyride Preview</CENTER></H1></B><P>
<hr><CENTER>
<img src="race1.png"><BR>
<img src="race2.png"></CENTER></P>
<hr>
<font size="+1,5">

Autorennspiele haben auf dem Amiga schon eine lange Tradition. Wer von uns
denkt nicht gerne an die Lotus Triologie oder Super Cars zur&#252;ck? Vor einiger
Zeit landete im Aminet ein Demo namens &quot;Alien FF&quot;, das wieder frischen
Schwung in dieses Genre bringen sollte.</P>

Mitlerweile findet man im Aminet auch ein Demo, da&#223; auf den Namen Joyride h&#246;rt, in dem mitlerweile mehr als 1 Jahr Entwicklungszeit steckt.
Das ganze sieht auch schon, wie man dem Screenshot entnehmen kann, recht
ordentlich aus und scheint gr&#246;&#223;tenteils des Raytracer entsprungen zu sein.
Deswegen sind die Hardwareanforderungen auch nicht ohne:</P>

<B>Minimum:</B></P>
<UL>
<li>030 / 50 MhZ<BR>
<LI>AGA <BR>
<li>8 MB Fast Ram<BR>
<li>6 MB Festplattenspeicher<BR>
<li>KS 3.0</P>
</UL>
&#220;ber Grafikkartenunterst&#252;tzung wird im Readme leider nichts gesagt, aber w&#252;rde dem
Game sicherlich gut zu Gesicht stehen. Auf meinem 040 /25 MhZ erreichte ich
im Durchschnitt 17 Frames, was zwar nicht &#252;bel, aber auch nicht das Optimum
in Sachen Spielbarkeit darstellt.</P>

Spielen tut sich die Demo ganz gut, auch wenn man sich erstmal
eingew&#246;hnen muss. So ist es beim ersten antesten fast unm&#246;glich, sich gegen
die Gegner durchzusetzen. Mit der Zeit wird es dann zwar etwas einfacher,
aber dennoch fordert der Computergegner den Spieler kr&#228;ftig. Erschwert ,wird
das ganze noch durch verschiedene Abk&#252;rzungen, die schnell zu einem
Labyrinth werden k&#246;nnen.

Aprospos Strecken: So soll es in der Endversion 10 verschiedene Strecken
geben, die mit drei verschiedenen Autotypen befahren werden können.</P> 

Soundtechnisch tut sich zwar noch nicht so viel (ausser der von Rennspielen
gewohnten Ger&#228;uschkulisse beim Gang schalten bzw. die st&#228;ndigen
Motorger&#228;usche), aber immerhin ist dieser schon implementiert. F&#252;r die
Vollversion w&#228;re es ratsam. mehrere Audio Tracks beizulegen; so wie bei
Lotus I.</P>

<B>Fazit:</B></P>
Das ganze schaut schon recht vielversprechend aus. Zu bem&#228;ngeln gibt es im
groben und ganzen auch nichts; auch wenn man sich bis zum endg&#252;ltigen Release
dazu durchringen sollte, RTG Support einzubauen. Denn auf 640 X 480 w&#252;rde
das ganze sicherlich brlliant aussehen. Ich bin auf jeden Fall schon auf die
Vollversion gespannt.</P>
<PRE>
Name          : Joyride

Publisher     : Wird noch gesucht...

Release       : 3.Quartal `99

Preis         : ???

Anforderungen : 68030 / 50 MhZ, AGA, KS 3.0, 8 MB Fast Ram, 6 MB HD Space

Empfohlen     : ???
</PRE>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
<HR>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639 height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
