

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=green alink=yellow>

<h1><CENTER><FONT COLOR="YELLOW">Leserbrief von Kilian &quot;<blink>The Bruce&quot;</BLINK> Servais</FONT></H1></CENTER></P>
<ul>
<li><a href="#yonder.html">An den ausf&#252;hrlichen Leserbriefschreiber Yonder</A><BR>
<li><a href="#shark.html">An den sharkigen Andreas Eztrodt</A><BR>
<li><a href="#ricky.html">An den alten Italiener Ricky-W </A><BR>
<li><a href="#thowin.html">An den pagenden Thowin</A><BR>
<li><a href="#weber.html">An den Futter zur&#252;ck gebenden Thomas
Weber</A><BR>
<li><a href="#nagash.html">An den d&#252;steren Nagash</A><BR>
<li><a href="#wolf.html">An den ratlosen Wolf</A><BR>
<li><a href="#gunnar.html">An den Apple Rom suchenden Gunnar Otte</A><BR>
<li><a href="#top.html">Top 5</A></P>
</UL>
<HR>
<a name="yonder.html">
<b>An Yonder:</b></P>
So, jetzt wei&#223; ich &#252;berhaupt nicht, wo ich anfangen soll. Ich komme n&#228;mlich
gerade aus den Ferien wieder und bin nun etwas, na sagen wir mal, gestresst.
Aber nix destrotrotz erh&#228;lst Du nat&#252;rlich eine Antwort auf Deinen
Leserbrief.</P>

Die <B>Game Previews</B> waren also in Ordnung? Sch&#246;n zu wissen, denn au&#223;er Dir
hat dazu leider niemand Stellung genommen. Aber ich werde in dieser Hinsicht trotzdem
weiter am Ball bleiben; in dieser Ausgabe sollten &#252;brigens auch Game
Previews von mir zu finden sein. Wenn es in dieser Hinsicht allerdings etwas
zu verbessern gibt, dann w&#252;rde es mich freuen, wenn Du mir das mitteilst.
</P>
Da ich zum &#252;berpr&#252;fen meiner Artikel grunds&#228;tzlich nur IBrowse nehme, ist
mir die Funktionsunt&#252;chtigkeit der Links in der <B>Metal Corner</B> nat&#252;rlich
nicht aufgefallen. Aber dank Dir wei&#223; ich ja nun woran es liegt und habe es
nat&#252;rlich sofort f&#252;r diese Ausgabe korrigiert.</P>

Das Dir meine CD Besprechungen (Metal) gefallen, freut mich ebenso. Ich habe
allerdings vor, diese noch etwas auszuweiten, wie Du vielleicht schon in der
letzten Ausgabe feststellen konntest (eingescantes Cover etc.). In Zukunft
wird da sicherlich auch noch mehr Text zukommen....</P>

Wo ich die Zeit &amp; Motivation her nehme, Artikel f&#252;r die NC zu schreiben?
Tja, da&#223; wei&#223; ich ehrlich gesagt auch nicht so genau. Aber immerhin kann ich
so einen Beitrag zum Weiterleben des Amigas leisten und wenn mein
Geschreibsel dem einen oder anderen User gef&#228;llt, ist es umso sch&#246;ner. Eines
meiner Hobbys ist halt nun mal der Amiga und somit bleibt eine gewisse
Motivation nicht aus. Aber leider ist in letzter Zeit wieder der Trend zu
weniger Feedback ausgebrochen, was die Motivation wieder schm&#228;lert....
</P>
Der Test zur Amiga Times CD war ja in der letzten Ausgabe zu lesen; leider
gibt es das Mag ja ohnehin nicht mehr, so da&#223; man davon ausgehen kann, da&#223;
keine weiteren CD`s folgen werden. Trotzdem nochmal Thanx daf&#252;r!!
</P>
Ein neues Tape ist hoffentlich bei Dir angekommen; auch wenn es, aufgrund
meiner Ferienaktivit&#228;ten (siehe auch<B> Urlaubstip</B> in dieser Ausgabe),
wahrscheinlich etwas sp&#228;ter geworden ist. Na ja, sollte aber schon da sein
:-)))
</P>
Wie man es nimmt, ein Update zu Route 666 ist nicht erschienen, aber
aufgrund eines, &#228;h, Plattencrashes bei Ronald ist das ganze Game mit Source
Code futsch. Aber er w&#228;re nicht Ronald h&#228;tte er das Game nicht sofort neu
programmiert und zwar in Blitz Basic. Mitlerweile sollte das ganze auch
extrem gut flutschen, so da&#223; Du bald in den Genuss eines Updates kommen
wirst bzw. es schon da hast - je nachdem, wie weit der Ronald mit dem Game
gekommen ist.
</P>
Ach ja: Ich habe auch Deinen Leserbrief an Thowin bezgl. des Highscores von
Deluxe Galaga
gelesen. Das mit dem Degradierung zum Ensign ist de facto kein
Programmfehler. Wenn man erstmal Admiral ist, kann es vorkommen, da&#223; statt
normaler &quot;Rank Markers&quot; Degradiermarkers runterfallen, die so schnell
fallen, da&#223; man kaum Zeit hat, zu reagieren. Diese kann man aber farblich
von den anderen unterscheiden (alles kapiert???). Ist mir aber auch schon
passiert....
</P>
Nun noch etwas zu Deiner Rubrik &quot;Hitparade&quot; in der NC: Ich finde es gut, da&#223;
Du alles beim alten lassen willst; die Gr&#246;&#223;e eines Artikels ist sicherlich
nicht das A und O f&#252;r einen <b>guten</B> Artikel. Als Beispiel fallen mir
spontan die Anekdoten von Wolf ein, die zwar nicht seitenlang waren, aber
dennoch bei vielen sehr gut ankamen. Deswegen finde ich die Idee, aufwendige
Artikel mit mehr als einem Punkt zu bewerten auch nicht so dolle. Klaro, man
merkt sofort, da&#223; die STP oder auch Fast Food sehr viel Arbeit machen (wie
es eben auch die Metal Corner tut). Aber deswegen gleich die gesamte
Hitparade neu zu gestalten (am besten jeden einzelnen Buchstaben z&#228;hlen
:-)), w&#228;re absolut hirnrissig. Kurz gesagt: Ich stimme Dir in der Hinsicht
voll &amp; ganz zu!
</P>
Noch was: Das Layout Deiner Artikel ist jetzt aller erste Sahne (der Inhalt natürlich auch).</P>

P.S.: Sorry für die kurze Abhandlung von meiner Seite, aber mir fehlt es an
Zeit...</P>
See ya!</P>
<HR>
<a name="shark.html">
<B>An Andreas E.:</B></P>
&#214;h, eigentlich wollte ich nur kurz auf Deine Top 5 aus der letzten NC
eingehen. Der <B>Patterns Of Force</B> Artikel war von mir; auch wenn er nur
durch Zufall im Small Talk gelandet ist (siehe letzte Ausgabe). Aber trotzdem thanx f&#252;r Deine
lobenden Worte. Hoffe, da&#223; damit auch gekl&#228;rt ist, warum kein Name unter dem
Artikel stand....</P>
<HR>
<a name="ricky.html">
<B>An Ricky-W:</B></P>
Erstmal sorry, da&#223; ich Dich nicht als Italiener identifiziert habe :-)))
Du willst den Amiga also im Ernst <B>verschenken</B>? Ok, wenn Du einen PC
haben willst, aktzeptiere ich das (auch wenn es nicht so mein Ding ist, aber
das geh&#246;rt jetzt nicht hierher). Aber Du kannst doch Deinen Amiga immer
noch behalten. Immerhin soll es Leute geben, die nach dem Kauf eines PC`s
total entt&#228;uscht sind und sich ihren Amiga zur&#252;ckw&#252;nschen. Frag mal im Club
danach...</P>

Insofern kann ich beim besten Willen nicht verstehen, warum Du Ihn
verschenken willst. Aber wenn Du wirklich die Kiste loswerden willst, dann
habe ich einen Interessenten daf&#252;r: Ein Freund von mir sucht einen Amiga (1200; umsonst) und
falls Du im Besitz eines solchen bist, kann ich Dir gerne seine Addresse
zukommen lassen.</P>

Bis demn&#228;chst mal!</P>
<HR>
<a name="thowin.html">
<b>An Thowin:</B></P>
Crossover ist absolut nicht mein Ding; genausowenige wie dieses ganze Grunge
und Pseudo Rock Gefrickel. Aber im Grunde genommen, kann man viele Band dem
Crossover zuordnen: Wenn ich richtig informiert bin, war die urspr&#252;ngliche
Bedeutung von Crossover die Verbindung zwischen zwei Musikrichtungen. Somit
w&#228;ren auch Rage und Rhapsody (beide machen eine erstklassige Mischung aus
Metal &amp; Klassik) Crossover. Heute scheint es aber g&#228;ngig zu sein, die
Mischung aus Techno &amp; Metal als Crossover zu bezeichnen, was &#252;berhaupt nicht
mein Ding ist. Alleine wenn ich schon diese komischen <B>Crossing All
Over</B>
Sampler sehe, kriege ich die Krise...</P>

Ich pers&#246;nlich bevorzuge neben dem klassischen Heavy Metal (Iron Maiden,
Judas Priest etc.) vor allem (German) Power Metal (Gamma Ray, Helloween,
Blind Guardian, Running Wild etc.) und demzufolge auch True Metal (das ja im
Grunde nix anderes als klassischer Metal bzw. Power Metal mit klischeehaften
Texten ist; als Beispiele kann man vor allem HammerFall, Sacred Steel und
Wizard anf&#252;hren). Auch Progressive Metal (Dream Theater) und (Hard) Rock (Queen, Meat Loaf,
Pink Floyd etc.)
mag ich sehr gern. Bei Gelegenheit werde ich mal eine Liste aller meiner
CD`s beilegen; dann kannst Du Dir ein besseres Bild von meinem
Musikgeschmack machen (sind ca. 300 CD`s).</P>

Teilweise hat der Ronald die Logos mit Candy Factory gemacht, aber er
bevorzugt eine Mischung (Crossover) aus verschiedenen Progs (ImagFX, PPaint
etc.). Ein potentielles Mitglied ist der Ronald bestimmt, aber er hat keine
Lust in den Club einzutreten. Auch ich versuche ihn schon seit l&#228;ngerem von
den Vorteilen zu &#252;berzeugen, aber bisher ist da nix draus geworden :-(((
Vielleicht demn&#228;chst mal??</P>

Wie ich leider erst im Nachhinein festgestellt habe, habe ich in den Brief
an Dich eine falsche Disk gepackt :-((( Das kommt davon, wenn man im Stress
ist. Zum Tuefel, aber ich könnte mich im Nachhinein kräftig darüber
aufregen, zumla ich vorhin noch den Artikel wie ein irrer getippt habe. Na
ja, jetzt lohnt es sich nicht mehr, eine neue Disk fertigzumachen; bekommst
Du dann nächsten Monat hinterhergeschoben.... tut mir ehrlich leid!!!
Was war überhaupt auf der Disk, die ich mitgeschickt habe, drauf??</P>

But now to something complete different: Den Spacepages!
Ich finde es sehr gut, da&#223; Du das Konzept offener gestaltet hast; somit kann
man demn&#228;chst von einer gr&#246;&#223;en Mitarbeit tr&#228;umen. Was ich allerdings nicht
verstehe, ist Dein Problem mit der Artikelzahl. Ich verstehe es zwar, da&#223;
die SPP viel Arbeit verursachen (genau wie es die Metal Corner tut), aber
deswegen gleich drei Artikel gutgeschrieben zu bekommen, finde ich etwas
bl&#246;d. Dann m&#252;ssten konsequentenweise auch Carsten Scr&#246;der alle einzelnen
Artikel aus der AmigaAktuell gutgeschrieben werden und ich m&#246;chste nicht
wissen, wieviele das sind. Auch ich m&#252;sste dann darauf bestehen, einen
zus&#228;tzlichen Artikel von den SPP gutgeschrieben zu bekommen; tue ich aber
auch nicht. Deswegen freue Dich lieber &#252;ber Deine SPP, f&#252;r die Du ja schon
viel Lob einheimsen konntest.</P>

P.S.: Hattest Du meinen zweiten Brief letzten Monat nicht mehr bekommen?</P>

Bis denne!</P>
<hr>
<a name="weber.html">
<B>An Thomas Weber:</B></P>
Im Grunde sind es nur einige Kleinigkeiten, auf die ich im folgenden
eingehen m&#246;chte: Ich finde Deine Comics wirklich gut; auch wenn ich
pers&#246;nlich nicht so sehr der Comic Freund bin. Aber trotzdem ist das ganze
wirklich sehr gut gemacht und ich w&#252;rde mich freuen, wenn Du damit noch
lange weiter machst :-))) Im übrigen lese ich die Comics jeden Monat!
</P>

Das ich mit der Metal Corner (wird nicht mit <B>A</B> geschrieben) nicht den
Vogel abgeschossen habe, wei&#223; ich selber. Musik ist nunmal eben Geschmack
und Metal ist alles andere als massenkompatibel. Wenn Du allerdings
Verbesserungsvorschl&#228;ge f&#252;r die Metal Corner hast, dann immer her damit.
</P>
Was h&#246;rst Du eigentlich f&#252;r Musik? Rein interessenhalber...</P>

Read You!</P>
<hr>
<a name="nagash.html">
<b>An Nagash:</B></P>
In Deinem Artikel <B>TKM</B> schreibst Du, da&#223; der Bruce Horrorfilme
vorstellt, was aber nicht korrekt ist. Wahrscheinlich hast Du Bezug auf den
Horrorfilm-Test in der vorletzten NC bezogen. Allerdings stammt dieser
Artikel von The Saint und somit nicht von mir. Ich bin n&#228;mlich &#252;berhaupt
kein Fan dieses Genres und kann somit auch nix &#252;ber die Qualit&#228;t dieser
Meisterwerke aussagen. Na ja, also wende Dich damit nochmal an Saint und
dann wird sich wohl alles von alleine erledigen :-))</P>

Bis denne!</P>
<hr>
<a name="wolf.html">
<B>An Wolf:</b></P>
Im Grunde genommen stimme ich Deiner Ratlosigkeit im Bezug auf Horrorfilme
zu. Auch ich bin kein Freund von Splatter &amp; Horrorfilmen. Allerdings ist es
f&#252;r die meisten Jugendlichen heutzutage nicht mehr als ein Scherzgenre, das
man nicht so ganz ernstnimmt. Ich kenne einige Jugendliche, die auch gerne
Splatterfilme gucken, aber alles andere als geistig labil oder sonst was
sind. Deswegen kann ich Dich beruhigen, da&#223; die heutige Jugend nicht so
schlimm ist, wie es der Text von Saint schlie&#223;en l&#228;sst.</P>

Allerdings wird es auch einige durchgeknallte Seelen geben, die Horrorfilme
nicht nur aus Spa&#223; gucken, sondern den Schund auch nachleben; aber solche
Ausf&#228;lle gibt`s in jedem Genre. Prinzipiell k&#246;nnte man sich ja darauf
einigen, keine Splatterfilme mehr in die NC zu nehmen; aber das muss die
Mehrheit entscheiden und ich bin sicherlich nicht autorisert, dar&#252;ber ein
Urteil abzulassen. Vielleicht kann ja der Andreas dazu mal Stellung nehmen??
</P>
Man lie&#223;t sich!</P>
<HR>
<a name="gunnar.html">
<B>An Gunnar Otte:</B></P>
Die Apple Roms sind leider nicht frei vertreibbar und m&#252;ssen k&#228;uflich
erworben werden; es ist somit auf jeden Fall illegal, wenn Dir jemand aus
dem Club ein Mac Rom anbietet. Allerdings tummeln sich im Internet viele
Apple Roms, die man auch sehr einfach finden kann. Allerdings ist der
Download nur gestattet, wenn Du einen Apple Macintosh zu Hause stehen hast.
Wenn Du an einem legalen Weg interessiert bist, dann gehe zu einem Apple
H&#228;dnler und kauf Dir ein Rom, was Du dann auslesen kannst bzw. dann aus dem
Internet saugen kannst (wenn das Rom im Schrank liegt, reicht das). Aber ich
denke mal, da&#223; ein Gro&#223;teil der Amiga Besitzer den illegalen Weg bevorzugen
werden....</P>

Mach`s gut!</P>
<HR>
<a name="top.html">

<CENTER><h2><FONT COLOR="GREEN">Top 5:</FONT></CENTER></H2></P>

1. FastFood von Mark Tom (sehr viel Text)<BR>
2. Multiecke von Yonder (endlich wieder Tools)<BR>
3. SPP von Thowin (tolles Layout; guter Inhalt)<BR>
4. Redensarten von Wolf Zimmer (sehr interessant; gutes Layout)<BR>
5. Comic von Thomas Weber (hat sich endlich mal ein Lob verdient)</P>

Die letzte Ausgabe war, hoffentlich wegen des Sommerloches, etwas d&#252;nner
belegt, als die Vorg&#228;nger; auch wenn sich wieder einige sehr gute Artikel
gefunden haben. Allerdings ist es mal wieder an der Zeit, an das Feedback zu
appelieren. Einige Leute fangen n&#228;mlich wieder an, konsequent Feedback zu
vergessen; bedarf es denn erst wieder einer Ausgabe wie die NC 59, um etwas
zu ver&#228;ndern?</P>

Bis n&#228;chsten Monat,
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
