

<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Metal Corner by Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=red bgcolor=black link=green alink=red>
<CENTER>
<img src="metalcorner.png">
<P><H1>Metal Corner 8/99</H1></P>
 <a href ="#Vorwort.html">Vorwort</A><BR>
 <a href ="#News.html">News</a><BR>
 <a href ="#CDReviews.html">CD Reviews</A><BR>
 <a href ="#special.html">Japan Special</A><BR>
 <a href ="#lyrics.html">Interessante Lyrics</A><BR>
 <a href ="#tour.html">Tourdaten</A><BR>
 <a href ="#Top10.html">Top 10</A><BR>
 <a href ="#Outro.html">Abschließend</A></P>
<hr>
<a name="Vorwort.html"></CENTER>
<h1><CENTER><FONT COLOR="YELLOW">Vorwort</FONT></CENTER></h1><p>

<b><U>Greetings!</B></U></P>

Einige, die das hier lesen, werden jetzt noch Ferien haben. Andere (wie ich) m&#252;ssen
bald wieder zur Schule. Deswegen ist das Datum, an dem ich dieses Vorwort schreibe, auch verdammt fr&#252;h.
Ja, ich kann Euch sogar versichern, da&#223; ihr alle zu diesem Zeitpunkt (24.6.)
noch nichtmal die letzte Ausgabe der Metal Corner kennt. Aber da ich bald in meine Ferien fahre (bzw. schon wieder da
bin, wenn ihr das hier am studieren seid) bleibt mir leider nix &#252;brig, als
m&#246;glichst fr&#252;h mit den Arbeiten an dieser Ausgabe zu beginnen. Und da ihr
sicherlich keine halbvolle Ausgabe mit wenig Inhalt haben woll, habe ich
diesesmal drei CD Test hineingepackt; auch wenn eine CD schon ein halbes
Jahr auf dem Buckel hat. Aber ich will Euch auch mal nicht weiter
nerven, denn viele von Euch w&#252;rden auch jetzt lieber in der Sonne liegen (so
wie ich an dem Zeitpunkt, wo ich dieses Vorwort geschrieben habe). See ya
soon,</P><CENTER>

Kilian <blink>&quot;The Bruce&quot;</BLINK> Servais</CENTER>
<hr>
<a name="News.html">
<h1><CENTER><FONT COLOR="WHITE">News</FONT></H1></CENTER></p>
<ul>
<li>Wie in der letzten Ausgabe bereits vermeldet, ist der Split bei <B>Rage</B> nun
auch offiziell: Die beiden Gitarristen Spiros und Sven haben die Band nun
definitiv verlassen. &#220;ber den Verbleib von Efti (Bruder von Spiros) ist
bisher zwar noch nichts bekannt, aber man kann davon ausgehen, da&#223; auch er
die Band verlassen wird. Das mitlerweile fertiggestellte Album &quot;Ghost&quot;
(erneut mit Klassik Einfl&#252;ssen) wird allerdings noch mit diesem Line-up laufen;
&#252;ber entsprechende Nachfolger ist noch nichts bekannt.</P><BR>

<li>Am 30 April ist leider <B>Nazareth</B> Drummer Darrel Sweet verstorben
:-(((</P><BR>

<li><B>Alice in Chains</B> wollen demn&#228;chst einen 15 Song Sampler ver&#246;ffentlichen,
auf dem sich auch einige Rarit&#228;ten befinden (Demos etc.). Ebenfalls in
Planung ist ein Boxset mit 44 Songs; ebenfalls wieder mit Rarit&#228;ten. Fans
sollten schon mal anfangen zu sparen!</P><BR>

<li>Die d&#228;nischen Melodic / Prog. Metaller <B>Royal Hunt</B> haben sich von ihrem
S&#228;nger D.C. Cooper getrennt. &#220;ber einen Nachfolger ist bisher noch nichts
(offizielles)
bekannt.</P><BR>

<li>Auch bei den wiedererstarkten <B>Metal Church</B> gibt`s Zoff: Gr&#252;ndungsmitglied
Craig Wells (Gitarre) verlie&#223; nach monatelangen Streitigkeiten die Band.
Ersetzt wird dieser durch John Marschall, der fr&#252;her schonmal bei der Band
t&#228;tig war. Aufgrund des Wechsels verschiebt sich auch das Release von dem
neusten Album (vorraussichtlich mit &quot;Masterpeace&quot; betitelt) auf den 26.
Juli.</P><BR>

<li>Wie in einer der letzten Metal Corner`s verk&#252;ndet wurde, haben <B>HammerFall</B>
eine neue Single namens &quot;At The End Of The Rainbow&quot; rausgedr&#252;ckt, die nur
auf Vinyl erscheinen wird. Ersteres ist richtig, letzteres mitlerweile nicht
mehr: Im Hause Nuclear Blast hat man sich nun offenbar dazu &quot;durchgerungen&quot;
(finanzielle Hintergedanken wollen wir den Jungs mal nicht unterstellen :-)),
die neue Single auch auf CD anzubieten. Mit dabei ist &#252;brigens auch
Deutschlands Metal Gott <B>Kai Hansen (ex-Helloween; Gamma Ray)</B>, der den True
Metallern dabei hilft, die <B>Helloween</B> Coverversion &quot;I Want Out&quot; (eine Kai
Hansen Komposition) einzuspielen. Hoffentlich &#252;bernimmt er dann auch gleich
die Vocals...</P><BR>

<LI>Seine Karriere hat sich im letzten Jahr gewaltig nach oben verlagert:
<B>Metalium</B> Leads&#228;nger Henne Basse wurde als Gast Vocalist f&#252;r das dritte
Output des <B>Trans-Siberian Orchestra</B> verpflichtet, was mehr als bemerkenswert
ist. Immerhin hat Mastermind Paul O`Neill (u.a. auch als Strippenzieher bei
<B>Savatage</B> bekannt) schon viele S&#228;nger nach Hause geschickt und geh&#246;rt
zweifelsohne zu den anspruchsvollsten der Szene.</P><BR>

<LI>Bei <B>Exciter</B> ist wieder alles im Lot: F&#252;r den abgewanderten Lead S&#228;nger
Jacques Belanger hat man nun Steve Carter (ex-<B>Deadcalm</B>) verpflichten k&#246;nnen.</P><BR>

<li>Einige &#196;nderungen im Line-up gab`s auch bei <B>Dio</B>: Gitarrist Tracy G. machte
freiwillig Platz f&#252;r Carig Goldy (der fr&#252;her schonmal bei Dio t&#228;tig war) und
einen weiteren Axeman namens David Rock (ex-Elf; damals zusammen mit Dio`s
Cousin Ronni). Zum aktuellen Line-up geh&#246;ren ferner noch Simon Wright (ex-AC
/ DC, ex-UFO; Drums), Larry Dennyson (Bass) und Scott Warren (Keys). Das
n&#228;chste Studioalbum &quot;Magica&quot; wird vorraussichtlich am 5.Oktober
erscheinen...</P><BR>

<li><B>Bruce Dickinson</B>, der sich mehr als wohl f&#252;hlt bei <B>Iron Maiden</B>, will im
Fr&#252;hherbst noch eine Live Scheibe, mitgeschnitten auf der letzten Tour,
rausdr&#252;cken. Bei <B>Iron Maiden</B> arbeitet man &#252;brigens schon wieder an neuem
Material (!), das auf dem n&#228;chsten Longplayer, der vorraussichtlich Anfang
2000 erscheint, verewigt sein wird.</P><BR>

<li><B>Dream Theater</B> Goldkehlchen James La Brie wird als letztes Traumtheater
Mitglied nun auch im Nebenprojekt Gesch&#228;ft t&#228;tig. Gegen Ende August wird
unter dem Namen Mullmuzzler die erste CD dieses Projektes (u.a. mit Carl
Cadden James von <B>Shadow Gallery</B>) zu h&#246;ren sein; &#252;ber die n&#228;chste <B>Dream
Theater</B> CD herrscht demhingegen immer noch Unklarheit.</P><BR>

<li>Bei den Herner Power Metallern <B>Custard</B> (eine der besten Bands &#252;berhaupt!)
ist Gitarrist / Vocalist Dirk
Wierczorek aufgrund gesundheitlicher Probleme ausgestiegen und wurde
mitlerweile durch einen neuen Gitarristen ersetzt. Angeblich soll der Junge
noch besser sein... </P><BR>

<li>Auf die glorreiche Idee 5 &#228;ltere Scheiben mit Bonus Tracks aufpoliert zum
regul&#228;ren Preis in die trendverseuchten L&#228;den zu stopfen, sind die ansonsten
&#252;beraus korrekten und alles andere als geldgeilen <B>Running Wild</B> gekommen. Insgesamt
geht es um 14 (!) Bonus Tracks, die auf den (Re-Releasten) Alben &quot;Death Or Glory&quot;, &quot;Pile Of
Skulls&quot;, &quot;Blazon Stone&quot;, &quot;Black Hand Inn&quot; und &quot;Masquerade&quot; zu finden sind.
Wie man aber den sympatischen (da immer konsequent sein Ding durchziehenden) Chef
Rolf Kasparek kennt, wird er sich f&#252;r seine Fans schon was einfallen lassen.</P><BR>

<li>Wie man diversen Berichten / Publikationen / Sendungen entnehmen kann, war
das <B>Dynamo Open Air</B> alles andere als ein organisatorischer Erfolg. Mit
Wartezeiten bis zu 10 Stunden und brennenden Klo`s mussten hier die Fans
fertig werden. Vom musikalischen her war allerdings alles wieder erste
Sahne!</P><BR>

<li><B>Iron Savior</B> werden im September einige Gigs (wahrscheinlich zusammen mit
Riot und Wardog) geben; &#252;ber genaue Daten ist bisher noch nix bekannt (zu 99
% offiziell).</P><BR>
</UL> 
<hr>
<a name="CDReviews.html">
<h1><CENTER><FONT COLOR="BLUE">CD Reviews</FONT></H1></CENTER><p>
<h2><CENTER>Wizard: Bound By Metal</h2></CENTER></P>

Seitdem HammerFall den True Metal wieder angekurbelt haben, ist daraus ja
ein richtiger Trend geworden. Urpl&#246;tzlich ist es wieder &quot;in&quot;, True Metal zu
machen. Auch die Bochumer Formation Wizard hauen mit ihrem neuen Langeisen
(insgesamt das dritte Album der Combo)
&quot;Bound By Metal&quot; in diese Kerbe.</P>

Wie nicht anders zu erwarten, ist auf &quot;Bound By Metal&quot; Metal klassischer
Pr&#228;gung mit Manowar Einfl&#252;ssen und einigen Power Metal Splittern
vorzufinden. Ebenfalls nicht &#252;berraschend sind die lyrischen Erg&#252;sse (?) der
Band, die man schon an Songtiteln wie &quot;Gladiators Of Steel&quot; (klasse Power
Komposition) oder &quot;Believe In Metal&quot; (tolle Metal Hymne) eindeutig erkennen
kann; wer auf anspruchsvolle Lyrics steht, sollte sich diese Scheibe besser
nicht holen und stattdessen eine Dream Theater Scheibe preferieren.
Nichtsdestotrotz ist ein Teil der Songs ganz gut geworden und auf einige
trifft sicherlich auch das Pr&#228;dikat &quot;Ohrwurm&quot; (wie z.B. auf den Abschluss &quot;Bound By Metal&quot;) zu.
Allerdings sind auch
einige Ausf&#228;lle zu verzeichnen, die das Bild nicht unwesentlich tr&#252;ben.
Demzufolge wundert es mich etwas, da&#223; &quot;Bound By Metal&quot; derma&#223;en mit
Vorschusslorbeeren &#252;bersch&#252;ttet wurde und auch in einigen Mags ziemlich gute
Bewertungen einfahren konnte; der erwartete Überflieger (wie damals HammerFall) sind die Jungs aus Bochum
nämlich (noch?) nicht. Aber bevor diese Kritik zu negativ klingt: Die Scheibe hat durchaus
Potential und wenn Wizard noch etwas am Songwriting arbeiten (und speziell
die Texte nicht mehr so abgrundtief peinlich formulieren), kann aus denen
noch eine gro&#223;e Combo werden. Vorerst reicht es, meiner Meinung nach, leider
nur zum guten Durchschnitt. Wer auf True Metal steht, kann ja mal reinh&#246;ren;
blind abgreifen sollte man sich die CD auf jeden Fall nicht.</P>


Fazit: 6 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<IMG SRC="mccov1.jpg" width="300" height="300"></P>
<img src="kit.gif"></CENTER></P>
<h2><CENTER>Labyrinth: Timeless Crime EP</h2></CENTER></P>

Wer sich jetzt fragt, ob eine der &#220;berraschungen im Bereich des Melodic
Metals aus dem letzten Jahr eine neue Scheibe eingespielt hat, den muss ich
leider entt&#228;uschen. Bei &quot;Timeless Crime&quot; handelt es sich nur um eine normale
EP (in anderen Quellen auch als Mini Album bezeichnet), die 5 Songs enth&#228;lt.
Neben einer neu eingespielten Accustic Version von &quot;Falling Rain&quot; (von der
`98er Scheibe &quot;Return To Heaven Denied&quot;) und &quot;In The Shade&quot; (vom Debut &quot;No
Limits&quot;), gibt`s mit dem neuen St&#252;ck &quot;Save Me&quot; einen Track, der ganz in der
Tradition von &quot;Return To Heaven Denied&quot; liegt, und dementsprechend gut
gelungen ist, auch wenn Stratovarius Einfl&#252;sse recht deutlich sind.
Zus&#228;tzlich fand auch ein neueingespieltes St&#252;ck vom ersten Demo namens &quot;Out Of Memory&quot; seinen
Weg auf die CD.</P>
&quot;Soweit so gut&quot;, werden sich viele sagen, aber wo ist die in
der Werbung versprochene Live Version und die Sanctuary Coverversion &quot;Die
For My Sins&quot;? Erstere ist &#252;berhaupt nicht auf der CD zu finden, letztere im
Anschluss an den letzten Track &quot;Falling Rain&quot;. Diese Vorgehensweise ist
total irref&#252;hrend, da die Tatsache, da&#223; das Vorhandensein nirgendwo erw&#228;hnt
wird, irgendwie komisch ist. Zudem h&#228;tte man auch bitte zwei einzelne Tracks
daraus machen k&#246;nnen und nicht erst eine kurze Pause und dann den n&#228;chsten Track
(dann k&#246;nnte man ja bald alle Songs in einer Audio Spur unterbringen)....
Na ja, das alles w&#228;re ja noch in Ordnung, wenn der Spa&#223; nicht glatte 20
M&#252;cken kosten w&#252;rde. Die Musik ist zwar &#252;ber jede Kritik erhaben, aber 20
M&#228;rker sind f&#252;r 5 Tracks doch etwas viel. Eingefleischte Labyrinth Fans
k&#246;nnen (und sollten) sich die EP nat&#252;rlich zulegen; allen anderen, die
Interesse an Stratovarius-like Melodic Metal haben, sollten sich zuerst den (sehr
guten) Vorg&#228;nger &quot;Return To Heaven Denied&quot; oder gar das (etwas
progressivere) Debut &quot;No Limits&quot; auf ihrem Kaufzettel
notieren.</P>

An den Label
sei hier noch vermerkt, da&#223; man mit einer solchen Marktpolitik weder sich
noch der Band dienlich ist; f&#252;r einen &quot;normalen&quot; Preis von 12 DM h&#228;tten
sicherlich einige Fans mehr zugegriffen.</P> 

Fazit:----</P>
<CENTER>
<img src="kit.gif"></P>
<img src="mccov2.jpg" width="300" height="300"></P>
<img src="kit.gif"></P></CENTER>

<h2><CENTER>Pretty Maids: Anything Worth Doing Is Worth
Overdoing</h2></CENTER></P>

Im Gegensatz zum allgemeinen True Metal Trend, legen die seit Anfang der
80er aktiven, aus D&#228;nemark kommenden,  Pretty Maids ihr Hauptaugenmerk
weiterhin auf schnurgeraden und ohrwurmgespicken Heavy Metal, der, wie man es ja mitlerweile von
der Band gewohnt ist, ohne jegliche Trendanbiederung auskommt.</P>

Als fast schon  obligatorisch ist es zu bezeichnen, da&#223; kein einziger musikalischer Ausfall
auf der CD vertreten ist und Songs wie &quot;Hell On High Heels&quot; oder
&quot;Destination Paradise&quot; das Zeug zum Klassiker haben. Daneben k&#246;nnen vor
allem h&#228;rtere Opener &quot;Snakes In Eden&quot; und die balladesken T&#246;ne von &quot;With
These Eyes&quot; &#252;berzeugen. Auch der Rest ist auf h&#246;chstem Niveau anzusiedeln
und sollte f&#252;r viele andere Bands, die teilweise absoluten M&#252;ll
ver&#246;ffentlichen (und damit immer noch mehr verkaufen, als die Pretty Maids
mit diesem Album), ein Vorbild sein, von dem man sich einige Scheiben abschneiden kann. Besonders die Riffs kommen immer noch
derma&#223;en powervoll aus den Boxen r&#252;ber, so da&#223; man sich fragt, ob der direkte
Nachfolger zu &quot;Red, Hot And Heavy&quot; im CD Player liegt; vom spieltechnischen
her kann die CD also auch von jeglicher (negativer) Kritik befreit
werden. Auch die Produktion ist einwandfrei abgelaufen, so daß man da auch keine Abstriche machen
muss.</P>

Bleibt zum Abschluss noch positiv zu erw&#228;hnen, da&#223; sich auf der 51 min&#252;tigen Silberscheibe
noch ein Multimedia Teil mit AVI Files und Bildern in sehr guter Qualit&#228;t
befindet; finde ich pers&#246;nlich sehr gut (auch wenn der Amiga mal wieder
&#252;bergangen wird).</P>

Insgesamt also ein jeder Hinsicht hervorragende CD, die sich keinen Trends
anbiedert und in jeder Hinsicht &#252;berzeugend ist.</P>

Fazit: 10 von 10 Punkten</P><CENTER>
<img src="kit.gif"></P>
<img src="mccov3.jpg"></P>
<img src="kit.gif"></P>
</CENTER>
<hr>
<a name="special.html">

<h1><CENTER><FONT COLOR="GRAY">Japan Special</FONT></h1></CENTER></P>

In dieser Ausgabe m&#246;chte ich Euch als &quot;Special&quot; zwei weitere CD Kritiken zu
CD`s liefern die lediglich in Japan erh&#228;ltlich sind und demzufolge nur &#252;ber
Mailorder bzw. &#252;ber das Internet bezogen werden k&#246;nnen. Aber Vorsicht: Die
Preise sind recht happig!</P>

<h2><CENTER>Michael Kiske: Readiness To Sacrifice</h2></CENTER></P>

In den Anf&#228;ngen des deutschen Power Metals stand eine Band an deren Spitze,
die zwar auch heute noch aktiv ist, aber damals ein ganz anderes Gesicht,
sprich Line-up, hatte. Die Rede ist von Helloween, die seinerzeit mit den
beiden Keeper Of The Seven Keys Alben sich selbst unsterblich gemacht haben.
Wesentlichen Anteil am Erfolg hatte auch die pr&#228;gnante Stimme des damaligen
Lead S&#228;nger Michael Kiske, auf denen sich heutzutage viele junge Bands
berufen und nicht selten zieht man seine Stimme auch zum Vergleich
heran.</P>

1993 l&#246;ste sich allerdings die jahrelange Beziehung zwischen Michael Kiske &amp;
Helloween nach zwei experementellen Alben (Pink Bubles Go Ape &amp; Chameleon)
in Wohlgefallen auf und Michael Kiske suchte sich keine neue Band.
Stattdessen ver&#246;ffentlichte er 1996 sein erstes Soloalbum &quot;Instant Clarity&quot;,
da&#223; einerseits h&#228;rtere Songs enthielt, andererseits aber auch starke
Parallelen zum rockigen Helloween Album &quot;Chameleon&quot; enthielt; kein Vergleich
also mit dem klassischen Power Metal von Helloween zu FETT Keeper
Zeiten.</P>

Danach geriet der charismatische S&#228;nger allerdings immer weiter in
Vergessenheit; nicht zuletzt weil Helloween wieder auf dem aufsteigenden Ast
waren. Aber 1999 meldete er sich mit einem neuen Album, betitelt mit &quot;Readiness
To Sacrifice&quot;, zur&#252;ck.</P>

Einige m&#246;gen jetzt denken, da&#223; es Michael Kiske im Zuge des Metal Revivals
lediglich um Geld geht, aber schon beim ersten durchh&#246;ren der Cd wird klar,
da&#223; das ganze sicherlich kein Abklatsch von alten Helloween Tugenden ist.
Vielmehr hat &quot;R.T.S.&quot; (Kurzform) so gut wie nichts mehr Helloween oder Power
Metal im allgemeinen zu tun; bei &quot;R.T.S.&quot; handelt es sich um gut gemachten
Rock mit einem leichten Blues Touch; nicht mehr, aber auch nicht weniger.
Alte Helloween Fans wird das ganze zwar weniger gefallen, aber wenn man sich
das erste Studioalbum so anschaut, wird man die Weiterentwicklung
nachvollziehen k&#246;nnen.</P>

Musikalisch gesehen geht das ganze aber dennoch voll in Ordnung; egal ob es
nun der Opemer &quot;Could Cry&quot; (der in die Kerbe von &quot;Be True To Yourself&quot; vom
Vorg&#228;ngeralbum schneidet), das sanftere &quot;Where Wishes Fly&quot; oder auch das
einfach struktuierte &quot;it&quot; ist; alle Songs sind hervorragend ausbalanciert
und k&#246;nnen volkommen &#252;berzeugen. Richtige Ohrw&#252;rmer sind zwar nicht am
Start, aber die tolle Lyrik macht das ganze auf jeden Fall wieder wett.</P>

Das das ganze z.Zt. leider nur als Japan Import erh&#228;ltlich ist, d&#252;rfte der
Preis von 60 DM einige potentielle K&#228;ufer abschrecken. Nat&#252;rlich, 60 DM f&#252;r
eine sehr ungew&#246;hnliche CD auszugeben ist nicht jedermans Sache und
Helloween Fans sollten auch nicht blind zugreifen. Aber wer den Vorg&#228;nger
mochte und etwas toleranter in Sachen Musik ist (bzw. nicht stur auf Metal
fixiert ist), wird die CD m&#246;gen.</P>

Fazit: 9 von 10 Punkten</P><CENTER>

<img src="kit.gif"></P>
<img src="mccov5.jpg"></P>
<img src="kit.gif"></P>

<h2>Angra: Rainy Nights - Single</h2></CENTER></P>

Nachdem der letzte Lonplayer &quot;Fireworks&quot; der brasilianischen Power Metaller
von Angra schon recht ordentlich geknallt hatte (auch wenn die Qualit&#228;t von
ihrem bisherigen Meisterwerk &quot;Holy Land&quot; nicht erreicht wurde), legen die
Jungs gleich eine neue Single mit dem Titel &quot;Rainy Nights&quot; nach.
</P>

Ganze drei Tracks finden sich auf der Single, die &#252;brigens in einem
Pappschuber (wie man ihn von den RockHard CD`s kennt) ohne CD Tray
geliefert. Nun aber zu den Tracks:</P>

1. Rainy Nights - Radio Edit</P>

2. Rainy Nights - Album Version</P>

3. Rainy Nights - Instrumental Version</P>

Fangen wir dann mal bei der Radio Edit an: Diese ist, im Vergleihc zur
&quot;regul&#228;ren&quot; Version etwas gek&#252;rzt und klingt typisch Angra m&#228;&#223;ig: Power
Metal mit Prog. Elementen in einer perfekten Symbiose. In Italien scheint
das Ding recht gut geflutscht zu sein; immerhin ist die Single dort relativ
gut eingestiegen und ab und an wird der Song sogar im Radio gespielt...</P>

Der zweite Track ist etwas irref&#252;hrend: Eine &quot;Album Version&quot; gab es n&#228;mlich
bisher von &quot;Rainy Nights&quot; nicht - demzufolge m&#252;sste es bald einen neuen
Longplayer geben, was angesichts der Tatsache, da&#223; die letzte CD erst Ende
`98 erschienen ist, etwas verwunderlich ist. Wie dem auch sei, musikalisch
ist die etwas l&#228;ngere Version ebenfalls &#252;ber jede Kritik
erhaben.</P>

Zum Abschluss w&#228;re da noch die Instrumentalversion, die nett mitanzuh&#246;ren
ist, aber auch nicht mehr. Eher etwas f&#252;r Karaoke Fans :-)</P>

Tja, was soll man dazu schon gro&#223; sagen? Diese Single, die in Deutschland
bisher nicht erh&#228;ltlich ist, ist halt nur etwas f&#252;r Angra Fans. F&#252;r schlappe
35 Eier wird man sich diese als Au&#223;enstehender ohnehin nicht zulegen; auch
wenn musikalisch alles in Ordnung geht. Angra Fans mit etwas breiterem
Geldbeutel sollten aber dennoch zugreifen. </P>

Fazit: ---- </P><CENTER>
<img src="kit.gif"></P>
<img src="mccov4.jpg"></P>
<img src="kit.gif"></P>
<HR>



<a name="lyrics.html">
<h1>Interessante Lyrics</h1><P>

<B>Tattooed Millionaire (Band: Bruce Dickinson / Album: Tattooed Millionaire)</B></P>
An dieser Stelle möchte ich Euch diesesmal einen Song vom Debut Solo Album
von Bruce Dickinson näher bringen. Diesen Song habe ich u.a. deshalb
gewählt, weil er teilweise perfekt zu meinem Artikel über Musik im
allgemeinen passt, der auch in dieser NC zu findens sein wird ("Ein kleiner
Gedankenanstoß").</P> 

Tattooed Boys With Expensive Toys<br>
Living In A Bubble Of Sin<BR>
Money Can Buy You Most Of Anything <br>
Fix Your Nose Or The Mess You`re In </P>

Front Page News You Can Share Your Views<BR>
With A Population That Wants To Be Like You<BR>
Out On The Strip - Out On The Tiles<BR>
Same Old Greed Behind The P.R. Smiles</P>

<U>Bridge:</U></P>
You And All Your Entourage - To Me You`re All The Same<BR>
You And All Your Entourage - Playing Foolish Games</P>

<U>Chorus:</U></P>
I Don`t Want Your Big City Shining<BR>
I Don`t Want Your Silver Lining<BR>
I Don`t Wanna Be A Tattooed Millionaire</P>

He`s Got A Wife - She Ain`t No Brain Child<BR>
Ex Mud Queen Of Miami<br>
In His Stretch Cadillac He Keeps Her In The Back<br>
With His CD Player And His Bottle Of Jack</P>

L.A. Dude L.A. Attitude<BR>
Laid Back Selfish And Getting Fat<BR>
Body Guards, Porn Stars, Gold Credit Cards<BR>
Using Each Other -  Running For Cover</P>

Bridge<BR>
Chorus</P>
</CENTER>
<hr>
<a name="tour.html">
<h1><CENTER>Tourdaten</h1></P>


<h2><u>Iron Maiden &amp; Megadeth</h2></U></P>

10.9. NL-Rotterdam, Ahoy<BR>
12.9. Hamburg, Sporthalle<BR>
20.9. Essen, Grugahalle<BR>
21.9. Stuttgart, Schleyerhalle</P>

<h2><U>Hypocrisy, Convenant, Godgory &amp; Dismael
Euphony</h2></U></P>

3.9. Offenbach, Hafenbahn<BR>
4.9. Spremberg, MTS<BR>
5.9. Glauchau, Alte Spinnerei<BR>
6.9. Herford, Kick<BR>
7.9. Hamburg, Markthalle<BR>
8.9. Bochum, Zeche<BR>
9.9. Engelsdorf, Hellraiser<BR>
10.9. A-Wien, Planet Music<BR>
11.9. A-Wels, Alter Schlachthof<BR>
12.9. Ludwigsburg, Rockfabrik</P>

<h2><U>Scarlet Rose</h2></U></P>

18.9. Hungen / Uthpe, Volkshalle<BR>
2.10. Oggersheim, Knappenkeller<BR>
23.10. Neustadt, Musikwerkstatt<BR>

<h2><U>Primal Fear &amp; Metalium</h2><br>
(aktuelle Daten!)</U><br>

18.9. Dresden, Neue Mensa<BR>
19.9. Bochum, Zeche<BR>
20.9. M&#252;nchen, Incognito<BR>
21.9. Hamburg, Markthalle<BR>
23.9. Ludwigsburg, Rockfabrik<BR>
24.9. Fraureuth, Ratskeller<BR>
25.9. Offenbach, Hafenbahn<BR>
26.9. N&#252;rnberg, Hirsch<BR>
28.9. CH-Pratteln, Z7<BR>
7.10. B-Vosselaar, Biebop<BR></CENTER>
<hr>
<a name="Top10.html">
<h1><CENTER><FONT COLOR="PURPLE">Top 10</FONT></H1><p>

<TABLE BORDER="1" WIDTH="50%" BGCOLOR="GRAY">
<TD>Gamma Ray</TD>
<TD>Powerplant</TD>
</TR>
<TR>
<TD>Iced Earth</TD>
<TD>Something Wicked This Way Cones</TD>
</TR>
<TR>
<TD>Blind Guardian</TD>
<TD>Nightfall In Middle-Earth</TD>
</TR>
<TR>
<TD>Subway To Sally</TD>
<TD>Hochzeit</TD>
</TR>
<TR>
<TD>HammerFall</TD>
<TD>Legacy Of Kings</TD>
</TR>
<TR>
<TD>Edguy</TD>
<TD>Theater Of Salvation</TD>
</TR>
<TR>
<TD>Metallica</TD>
<TD>Garage Inc.</TD>
</TR>
<TR>
<TD>Lefay</TD>
<TD>The Seventh Seal</TD>
</TR>
<TR>
<TD>Kreator</TD>
<TD>Endorama</TD>
</TR>
<TR>
<TD>Manowar</TD>
<TD>Hell On Stage - Live</TD>
</TR>
</TABLE></P><BR>
Quelle: Rock Hard</P>
<hr>
<a name="Outro.html">
<H1><FONT COLOR="GREEN">Abschließend</FONT></h1></CENTER></p>
Auch wenn ich letztemal versprochen habe, die neue Primal Fear CD bzw. das
Metalium Debut zu testen: 7 CD`s für eine Ausgabe sind zuviel (und die
nächste müsste dann am besten noch ohne CD Review auskommen). Aber ich kann
Euch versichern: Die beiden Reviews liegen bereits in Rohfassung auf meiner
HD rum. Was es sonst noch geben wird? Keine Ahnung! Aber Vorschläge
Eurerseits sind immer willkommen. Macht`s alle mal gut!!
<HR>
<CENTER>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><P></A>
</CENTER>
</P>
</BODY>
</HTML>
