


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Musik? Mehr als nur ein Trend?</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOUR="GREEN">Ein kleiner
Gedankenansto&#223;</FONT></CENTER></h1></P>
<FONT SIZE="+1">
Letztens habe ich mal wieder ein bi&#223;chen im Fernsehen gezappt und was habe
ich gesehen? Eine (gut gemachte) Reportage &#252;ber Musik im allgemeinen und insbesondere
&#252;ber das Planen
eines Hits. Hier haben Producer offen zugegeben, da&#223; man f&#252;r eine bestimmte
Art von Musik die Stars und Sternchen, die gerade &quot;in&quot; sind, einfach
aussucht und durch entsprechende Promotion dann einen Hit landet.</P>

Merkt Ihr alle was? Irgendwas stimmt da doch nicht! Bands, die jahrelang im
Proberaum verbringen um auf harte &amp; schwei&#223;treibende Weise ein Instrument zu
erlenen, kommen unter Umst&#228;nden nie zu einem Erfolg und irgendwelche Soap Stars
wie Oli P. (der selber zugegeben hat, nicht singen zu k&#246;nnen) bekommen einen
Song von Managern geschrieben und spielen diesen dann mittels eines
Computers, der allein schon die Rechenpower eines halben Gro&#223;rechners
braucht, ein.</P>

Es geht mir jetzt gar nicht darum, die Leute zu verurteilen, die diese Art
von (geplanter) Musik h&#246;ren; jeder h&#246;rt schlie&#223;lich das, was er mag. Und
Geschm&#228;cker sind halt unterschiedlich. Trotzdem frage ich mich h&#228;ufig, warum
bestimmte CD`s sich so h&#228;ufig verkaufen, nur weil ein bestimmter Name oder
Kopf auf dem Cover abgebildet ist und andere Musik (die mitunter wesentlich
anspruchsvoller ist) sich mehr schlecht als recht verkauft.</P>

<hr>

Da ich auch Gruppenleiter in diversen Kindergruppen bin, habe ich versucht,
diese Frage mal zu beantworten; und was ich an Antworten erhalten habe,
stimmt mich doch verdammt nachdenklich:</P>

Ein Kind meinte, da&#223; es diese oder jene Band gut findet, weil es z.Zt.
einfach &quot;in&quot; ist und man praktisch schon als Au&#223;enseiter gilt, wenn man
diesen Trend nicht mitmacht. Auf der Frage nach der Musik kam dann nur ein
&quot;&#246;h, ja, also, ganz nett&quot;.</P>

Ein weiteres Kind beantwortete die Frage mit der Antwort, des es &quot;eben alle
h&#246;ren&quot; und &quot;die Musiksender wie MTV oder VIVA es ja auch m&#228;chtig toll finden, so da&#223; ich das auch haben will&quot;.
</P>
Weit verbreitete andere Meinungen waren, da&#223; die Musiker einfach so gut
aussehen und einfach nur &quot;s&#252;&#223;&quot; w&#228;ren.
</P>
Wie man diesen Meinungen entnehmen kann, ist die eigentliche Musik total
sekund&#228;r . Vielmehr wird Musikgeschmack heute von der Geselschaft bestimmt
und nicht etwa vom eigenen Geschmack. Aber wem soll man da einen Vorwurf
machen? Den 11-j&#228;hrigen Kids, die diese Musik h&#246;ren? Ganz sicher nicht!
</P>
Immerhin ist es so, da&#223; die Jugend heutzutage so stark vom Fernsehen (&quot;Die
neue CD Eurer Stars. Die m&#252;sste Ihr unbedingt haben!&quot;), Radio (wo ebenfalls
nur ausgesuchte, trendige Musik l&#228;uft), Teenie Mags a la &quot;Bravo&quot; und Geselschaft (&quot;Was? Du kennst die
aktuelle CD von XY noch nicht? Au&#223;enseiter!&quot;) beeinflusst wird, da&#223; jegliche
andere Musikrichtung ignoriert wird. Hier wird den Jugendlichen schon
vorgekaut, was man zu kaufen hat und was man lieber gar nicht erst anguckt
bzw. sich anh&#246;rt. So habe ich doch letztens durch Zufall eine Ausgabe der
&quot;Bravo&quot; in die H&#228;nde gekriegt und habe einige Artikel &#252;ber Musik gelesen.
Ich war, gelinde gesagt, geschockt &#252;ber die Art und Weise, wie die
&quot;Redakteure&quot; dort zu Werke gingen. Die vereinzelt auftretenden Rock &amp; Metal
CD`s wurden gnadenlos verrissen und mit Worten wie &quot;unzumutbar&quot; und
&quot;belanglo&#223;&quot; total abgefertigt. Da ich gl&#252;cklicherweise selber im Besitz
dieser CD`s war, konnte ich mir ohne Probleme meine eigene Meinung
bilden.</P>

Was machen aber jene, die diese Art von Musik nicht kennen und auch nicht
die Chance haben, mal in Material dieser Bands reinzuh&#246;ren? All jene bleiben
dann in dem (Irr)Glauben, da&#223; das, was die Magazine (nicht nur die &quot;Bravo&quot;;
auch andere Teenie Mags verzapfen mit Regelm&#228;&#223;igkeit so einen M&#252;ll) da
schreiben, so schon richtig ist. Und wie soll man dann noch argumentieren,
wenn sich in den K&#246;pfen schon eine vorgefertigte Meinung manifestiert hat?</P>

Somit d&#252;rfte auch klar sein, da&#223; sich langsam aber sich eine unterschwellige
Art von Abneigung gegen eine bestimmte Art von Musik in den K&#246;pfen der
Jugendlichen aufbaut, die gr&#246;&#223;tenteils (leider) von Vorurteilen gepr&#228;gt ist.
</P>
Aus Gespr&#228;chen mit weiteren Jugendlichen sehe ich diese These leider
best&#228;tigt. Auf die Frage hin, was man denn von &quot;anderer Musik&quot; (Rock, Metal etc.)
halte, bekam ich
Zitate wie &quot;absoluter Schei&#223;&quot; und &quot;Irrenmusik f&#252;r
Zur&#252;ckgebliebene&quot;, die keine Seltenheit waren. Und das absolut bedauerliche dabei
ist, da&#223; keiner von den Befragten (gr&#246;&#223;tenteils 11-13 j&#228;hrige) die Musik
&#252;berhaupt gekannt hat.</P>

Ich habe n&#228;mlich gleich auch gefragt, woher man denn dieses Wissen nehme und
ob man &#252;berhaupt schonmal eine Band aus diesem Bereich geh&#246;rt hat.
Die Musik selber hatte noch niemand (!!) der Kids (immerhin auch ca. 30)
geh&#246;rt und als Antworten bekam ich h&#228;ufig ein &quot;das habe ich auf MTV geh&#246;rt&quot;
und &quot;wenn die gut w&#228;ren, dann m&#252;ssten die auch auf den Bravo Hits vertreten
sein&quot;. Vorurteile waren also zahlreich vertreten, auch wenn man die
entsprechende Stilrichtung &#252;berhaupt nicht kannte bzw. sich noch nichtmal
etwas darunter vorstellen konnte; allenfalls bekam ich 
Textphrasen aus diversen Magazinen wie z.B. &quot;Lautes Gegr&#246;lle&quot; und
&quot;Buschmusik&quot; an den Kopf geworfen.</P> 

Diese Einstellung ist aber nicht nur bei (j&#252;ngeren) Jugendlichen vorherrschend, sondern
auch bei einem Gro&#223;teil der Personen im Alter von 20-30 Jahren, die zwar
nicht unbedingt auf Boygroups stehen, aber dennoch Chart kompatibele Musik
bevorzugen; eben was gerade &quot;in&quot; ist. Durch Gespr&#228;che mit mehreren Leuten
aus dieser Personengruppe habe ich erneut feststellen k&#246;nnen, da&#223; Vorurteile
auch hier, mal mehr, mal weniger stark, ausgepr&#228;gt sind. Beim Thema &quot;Metal&quot;
bzw. &quot;Hard Rock&quot; erntet man des h&#228;ufigeren bl&#246;de Kommentare (von wegen
Satanismus etc.). Auf die Frage hin, woher man dieses Wissen bezieht,
bekommt man als Antwort erneut nur ein &quot;das wei&#223; man eben&quot;, was sich
wiederrum auf die Propaganda (ich nenne es in diesem Fall mal bewusst so!)
in der Kindheit zur&#252;ckzuf&#252;hren ist.</P>

Aus eigenem Wissen wei&#223; ich selber, wie einfach man durch Werbung
manipulierbar ist (ich habe mit 10 Jahren ebenfalls Techno geh&#246;rt, bevor ich
mit 11 Jahren zum Metal kam) und das man irgendwie immer manipuliert wird.
Nur das was damals so &quot;in&quot; war, existiert heute nicht mehr; normalerweise
sollte man davon ausgehen, da&#223; einige Bands mit Nr.1 Hits ein gewisses
musikalisches Potential haben, das noch weiter ausbauf&#228;hig ist.</P>

Allerdings ist dem nicht so: Nach intensiver Besch&#228;ftigung mit den Lyrics
diverser Bands (u.a. Boygroups,
Dancefloor und Pop) bin ich zu dem Ergebniss gekommen, da&#223; nahezu 100 %
totalen lyrischen M&#252;ll schreiben. Klaro, Musik soll (!) unterhalten, aber
sobald man Musik als Kunst ansieht (was es, zumindest f&#252;r mich, ist), stellt
man sich doch die Frage, ob es das auch auch f&#252;r diese Bands ist. Und das
schlimme ist: Die Kids sehen es heutzutage als anspruchsvoll an, wenn eine
Band <B>Inhalt</B> in die Lyrics bringt.</P>

Zitat eines (weiblichen) Teenagers: &quot;Die [gemeint ist eine Boygroup] singen sooo sch&#246;n &#252;ber Liebe
und das zieht sich das ganze Album &#252;ber hinweg; das hat mich total
beeinflusst&quot;.</P>

Ob es nun an sich anspruchsvoll ist, sich &#252;ber ein Album vorweg Gedanken zu
machen und eine inhaltliche Story hineinzubringen, m&#246;chte ich hier nicht
er&#246;rtern; dazu kann sich wirklich jeder selber Gedanken machen. Trotzdem
habe ich lange &#252;ber den letzten Teil dieses Zitates (&quot;das hat mich total
beeinflusst&quot;) nachgedacht. Wenn eine Band, ihre Fans schon in Sachen &quot;Liebe&quot;
beeinflussen kann, dann frage ich mich, wie es mit anderen (ernsteren)
Themen aussieht? Wenn eine Band jetzt offene politische Aussagen in ihre
Texte integriert? Wenn jetzt die Unterdr&#252;ckung von Minderheiten bef&#252;rwortet
wird? </P>

Ja, was dann? Genau dann wird es n&#228;mlich verdammt kritisch. Die Kids h&#246;ren
auf, das Geh&#246;rte in einem angemessenen Rahmen zu reflektieren und sich eine
eigene Meinung zum Geh&#246;rten zu bilden. Nur zu sagen &quot;Das ist mein Star.
Alles was der sagt, wird schon stimmen&quot; ist zu kurzsichtig und hat eine
Automatisierung zur Folge. Besonders bei politischen Aussagen folgt damit
eine weitere Manipulation auf geistiger Ebene, die das selbstst&#228;ndige Denken
blokiert und damit die <B>eigene Meinung</B> definitiv <B><U>nicht</B></U> f&#246;rdert.
</P>
Nur noch m&#246;glichst gro&#223;e Mengen an Musik zu konsumieren (Party, Diskos,
Fernsehen, Radio etc.) mit dem Hauptmerkmal auf &quot;Spa&#223;&quot; f&#252;hrt zur
qualitativen Ausd&#252;nnung jeglicher Musikrichtung und wird dem Pr&#228;dikat der &quot;Kunst&quot; in
keinster Weise mehr gerecht.</P>

Es soll hier nun wirklich nicht der Eindruck entstehen, da&#223; ich jegliche
Unterhaltungsmusik verabscheue; ganz im Gegenteil: Auch im Metalbereich gibt
es das; lediglich ist der Unterschied hier ganz einfach der, da&#223;
Unterhaltung mit Nachdenken / Reflektion gepaart wird. F&#252;r mich geh&#246;rt es einfach zur
Musik dazu, mir mal die Lyrics durchzulesen und dar&#252;ber nachzudenken, was
der Verfasser damit wohl sagen will. Nat&#252;rlich m&#246;chte ich dar&#252;ber keine
seitenlange Abhandlung (wie z.B. in der Schule bei Gedichten) schreiben,
aber sich einige Gedanken zu machen (und sich dabei fragen, was ich daraus
lernen kann), kann prinzipiell nicht falsch sein.</P>

Selbst wenn im Endeffekt dabei herauskommt, da&#223; man &#252;berhaupt nicht mit dem
Verfasser &#252;bereinstimmt, kann man immerhin noch etwas daraus lernen und
wei&#223;, das man seine eigene Meinung hat, auf die man stolz sein kann. Von
dieser Vorgehensweise betrachtet wird &quot;Musik&quot; wieder zur Kunst und das ist
auch
gut so.</P>

Dies war &#252;brigens auch einer der Gr&#252;nde f&#252;r die Einf&#252;hrung der Rubrik
&quot;Interessante Lyrics&quot; in der &quot;Metal Corner&quot;. Ich m&#246;chte doch all jene
bitten, die bisher noch Vorurteile gegen Metal haben, wenigstens mal in diesen
Teil der &quot;Metal Corner&quot; reinzuschauen. Wie hoffentlich aus dem obigen Text
hervorgegangen ist, sollte man sich doch wenigstens mal etwas mit einem
Thema besch&#228;ftigen, bevor man unfundierte Kommentare zum besten
gibt.</P>

In der Hoffnung, da&#223; wenigstens einige beim Lesen des Artikels etwas &#252;ber
das Musikverst&#228;ndnis
nachgedacht haben (dar&#252;ber w&#252;rde ich mich riesig freuen), h&#246;re ich jetzt mal
lieber zu schreiben auf, ansonsten w&#252;rde sicherlich niemand mehr
weiterlesen.</P>

Wie denkt ihr &#252;ber dieses Thema? &#220;ber Artikel diesbez&#252;glich in der n&#228;chsten
NC w&#252;rde ich mich tierisch freuen!</P>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
