<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Ferien - Die schönste Zeit im Jahr</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="YELLOW">Urlaubstip</FONT></h1></CENTER></P>

Da die NC ja f&#252;r so ziemlich alle Themen offen ist, m&#246;chte ich an dieser
Stelle mal einen<B> Urlaubstip</B> loswerden; wer jetzt auf die kontroverse
Hausfrauendiskussion hinweist, braucht ja nicht weiterlesen...</P>

Ach ja: Das ganze basiert auf meinem k&#252;rzlich verlebten Urlaub.</P>


<h2><CENTER><FONT COLOR="GREEN">Worum geht es denn?</FONT></CENTER></h2>
Viele von Euch kennen sicherlich die &quot;normalen&quot; Ferien wo man mit dem Auto
oder einen anderen Transportmittel
irgendwo hinf&#228;hrt und an diesem Ort Urlaub macht. In diesem Fall handelt es sich bei dem Transportmittel um ein
Segelschiff und es geht (wer h&#228;tte es gedacht?) um einen Segelturn. Wer mit dem Begriff nichts anfangen kann, dem sei
erkl&#228;rt, da&#223; es sich dabei um normales Segeln handelt :-))
</P>
<h2><CENTER><FONT COLOR="white">Was macht man denn da?</FONT></h2></CENTER>
Eines kann ich schonmal vorwegnehmen: Langweilig wird es auf einem solchen
Segelturn nie, da es immer etwas zu tun gibt. So m&#252;ssen z.B. die Segel
gesetzt werden (ach nee...) und gelegentlich korrigiert werden, Schwerter
(sic!) gekurbelt werden, das Deck geschrubbt werden (macht aber dennoch viel
Spa&#223;) und noch weitere Sachen. Nat&#252;rlich muss man nicht die ganze Zeit
durcharbeiten, sondern man hat auch gen&#252;gend Zeit sich in der Sonne zu
br&#228;unen, unter Deck zu gehen oder was auch immer zu machen. Besonders in
gr&#246;&#223;eren Gruppen (so ab 10 Mann) sollte auf dem meistens etwas kleineren
Schiffen nur selten bis nie Langeweile aufkommen.</P>

Abends liegt man selbstverst&#228;ndlich in einem Hafen an, um die Vorr&#228;te
aufzutanken und somit besteht f&#252;r die Gruppe auch die Chance, etwas in den
St&#228;dten zu unternehmen. Alternativ dazu kann man sich auch mal auf &quot;Grund
laufen lassen&quot;, was extrem spassig sein kann; nicht zuletzt weil man damit
eine Wattwanderrung hervorragend verbinden kann. Und wer schonmal eine Wattwanderrung mitgemacht hat,
wird sichelrich bestätigen können, daß diese extrem spassig verlaufen kann :-))</P>

Selbstverst&#228;ndlich kann, muss aber nicht, die Route noch ausgearbeitet
werden, wobei auch kleinere D&#246;rfer mit Hafen durchaus ihren Reiz haben
k&#246;nnen. Besonders in Holland auf dem Ijselmeer gibt es verdammt
faszinierende St&#228;dte, die einen Besuch wert sind. Auf jeden Fall lohnt es
sich, vorher auch die Ratschl&#228;ge der Skipper (das sind die Personen, die das
Schiff steuern und aufpassen, da&#223; alles mit rechten Dingen zugeht)
einzuholen.</P>


<h2><CENTER><FONT COLOR="BLUE">Worauf man achten
sollte...</FONT></CENTER></h2></P>
Die beste Route und das beste Schiff n&#252;tzt absolut nichts, wenn ddie Skipper
absolut unkooperativ sind. Gl&#252;cklicherweise gibt es solche Skipper h&#246;chst
selten und unsere Gruppe hatte sehr viel Gl&#252;ck, verdammt nette Skipper
vorzufinden. </P>

Ferner sollte man auch noch darauf achten, da&#223; das Boot nicht zu klein bzw.
zu gro&#223; ist. Erstgenanntes d&#252;rfte wohl selbsterkl&#228;rend sein und letzteres
eignet sich nur f&#252;r Gruppen, die nicht wissen, wohin mit dem Geld. Da man
ohnehin nur unter Deck geht (bzw. gehen kann), wenn man schlafen oder was essen will, reicht ein drei Sterne
Schiff allemal aus. Zumindest unsere Gruppe hatte niemals Probleme mit dem
Komfort unter Deck, auch wenn es in den Kaj&#252;ten teilweise etwas eng wurde
(keine Schr&#228;nke etc.).</P>

Ein weitere wichtiger Punkt ist der, da&#223; die Gruppe auch Lust hat mit
anzupacken und keine Arbeit scheut. Denn wenn immer nur die Skipper alles
machen m&#252;ssen, verlieren diese bald die Lust am Segeln und sind
demenstprechend begeisterungsf&#228;hig. Wir haben da von unseren Skippern
teilweise haarstreubende Berichte geh&#246;rt... </P>

Wenn Ihr kurz davor seid abzufahren, solltet ihr unbedingt an das nötige
Kleingeld in der richtigen Währung denken: Da an Bord i.d.R. keine Duschen
vorzufinden sind, bleibt einem nur die Möglichkeit in einem Hafen zu
duschen, was wiederrum Kosten nach sich zieht. Hat man aber nun kein
Kleingeld dabei, kann man die Duschen auch nicht dazu überreden,
anzuspringen.... (in Holland normalerweise 1 Gulden) </P>

<h2><CENTER><FONT COLOR="RED">Interesse bekommen?</FONT></CENTER></h2></P>
Wer jetzt Interesse an einer solchen extrem abwechselungsreichen Art des
Urlaubs hat, dem m&#246;chte ich hier noch einige Sachen mit auf den Weg geben:
</P>
Wenn Ihr ernsthaft Interesse daran habt, dann st&#246;bert mal durch die Angebote
an Segelturnschiffen. Zu empfehlen ist sicherlich ein Segelturn auf dem
Ijselmeer (Holland), wobei ein kleiner Abstecher nach Deutschland m&#246;glich
ist.

Ihr m&#252;sste nur eine gr&#246;&#223;ere Gruppe zusammen bekommen, da sonst der Preis
deutlich h&#246;her ausf&#228;llt; kalkulieren kann man insgesamt mit ca.800 DM (inkl.
Verpflegung etc.).</P>

Ach ja, sollte das drei Sterne Schiff<B> Antje Adelheid</B> frei sein, so kann
ich Euch dieses bedenkenlos ans Herz legen; die Skipper sind sehr freundlich
und die Inneneinrichtung ist ebenfalls gut.

Bei weiteren Fragen stehe ich nat&#252;rlich gerne zur Verf&#252;gung :-))
</P>


<CENTEr>                                             <
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
