<html>
<head>
<meta name="author" content="Wolf Zimmer">
<title>Wolf-INFO</title>
</head>
<body background="wolf1.jpg" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Wolf-INFO</font></b></p>

<table border="0" cellpadding="5" width="100%">
<tr>
<td align="center" bgcolor="#808080">
<font color="#0000FF" size="3" face="arial"><b>
meine Statements und andere Nachrichten
</b></font></td></tr></table
<table border="0" cellpadding="5"><tr><td>
<a href="mitglieder/zimmer.html">
<img src="st_wolfinfo.jpg" width=100 height=100 border=0 align=left></a></td> 
<td><ul><center><font color=blue> I n h a l t </font></center>
<li> <a href="#a1"> Vellmar </a></li>
<li> <a href="#a2"> Aus MedienNews </a></li>
<li> <a href="#a3"> Gedicht </a></li>
<li> <a href="#a4"> Feedback </a></li>
</ul></td></tr></table>

<p><a name="a1"><font color="800000" size="5">
<b>Club-Treffen Nr. 2 in Vellmar </font></b>
</a></p>

<p>Bevor ich ein klitzekleines Res&uuml;mee ziehe, m&ouml;chte ich mich bei allen
Anwesendgewesenen entschuldigen, dass ich manchmal etwas kurz angebunden war.
Ich war einfach nicht gut "drauf" und das soll an dieser Stelle als
Entschuldigung reichen. Trotzdem war ich froh, dass ich dennoch gekommen war. So
konnte ich mit meinen 1,89 m wieder einmal feststellen, dass es doch noch
gr&ouml;&szlig;ere Leute gibt. Stimmts, Lars? Gegen Dich wirke ich richtiggehend
kleinw&uuml;chsig, trotz meiner 110 Kilo. Was das wieder nur mit K&ouml;rpergr&ouml;&szlig;e zu tun
hat? An dieser Stelle werde ich keine Anwesenheitsnachlese t&auml;tigen, aber dennoch
feststellen, dass au&szlig;er Clubmitglieder auch weitere User zum Treffen gefunden
hatten. Einem von ihnen konnte leider nicht geholfen werden, er suchte dringend
Kontakt zu jemanden, der auch Videobearbeitung auf dem Amiga macht. Leider war
kein Amiganer dieses Genres anwesend. Ich kann richtiggehend dessen herbe
Ent&auml;uschung nachempfinden. Es hat aber definitiv keinen Sinn &uuml;ber etwas zu
reden, wovon man h&ouml;chstens nur kleine theoretische Wissensbr&ouml;ckchen hat, weil
man mal dar&uuml;ber etwas gelesen hatte. </p>

<p>Meine Zeilen sollen nur meinen ureigenen pers&ouml;nlichen Eindruck wiedergeben.
Und so m&ouml;chte ich zum Ausdruck bringen, dass der gr&ouml;&szlig;ere Saal schon von Vorteil
war und der Wegfall der letztj&auml;hrigen Einengung sich wohltuend bemerkbar gemacht
hatte. Ein Nachteil ist hier hierbei aber auch zu vermelden. Die
Gr&uuml;ppchenbildung fiel jetzt viel mehr auf und die Kommunikation zwischen den
Gruppen war demgem&auml;&szlig; nicht mehr so intensiv, wie im letzten Jahr, wo man sich
direkt ber&uuml;hrte. Trotzdem war die Intensit&auml;t des gruppen&uuml;bergreifenden Kontaktes
wirksam, wenn es galt, Probleme gemeinsam zu l&ouml;sen. </p>

<p>Es kann aber auch sein, dass ich die sogenannte Gruppenbildung vollkommen
&uuml;berzeichne und diese in Wirklichkeit gar nicht so existierte und der Eindruck
nur durch die Platzierungen der Computer so entstanden war. Bei der
durchgef&uuml;hrten Diskussionsrunde hob sich alles durch die Kreisbildung auf und
demonstrierte die Zusammengeh&ouml;rigkeit, ob Clubmitglied oder nicht, das spielte
hier keine Rolle. </p>

<p>Als am Sonntag gegen 16.00 Uhr der allgemeine Aufbruch begann, konnte mit Fug
und Recht gesagt werden, es hatte sich auch dieses Jahr wieder gelohnt, anwesend
gewesen zu sein. Und die diesj&auml;hrigen Erstbesucher werden bestimmt auch im
n&auml;chsten Jahr wieder anreisen. Wenn blo&szlig; f&uuml;r manche die langen Fahrten nicht
w&auml;ren. Gl&uuml;cklicherweise liegt Vellmar so ziemlich mittig in Deutschland und so ist
es f&uuml;r manche halt ganz sch&ouml;n weit, wenn man an der Peripherie unseres Landes
wohnt, aber nicht weiter als unbedingt notwendig. </p>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a2"><font color="800000" size="5">
<b>Aus Medien News </font></b></a></p>

<p><font size="+1"><strong>Surfer verzichten auf Fernsehen</strong></font><br>
Um mehr im Internet surfen zu k&ouml;nnen, verzichten die Deutschen zunehmend auf
ihre gewohnten Freizeitaktivit&auml;ten. Das geht aus einer Umfrage hervor, die die
<a href="http://www.pc-welt.de">PC-WELT</a> in ihrer Online-Ausgabe unter 386
Nutzern durchgef&uuml;hrt hat. Die Nutzung des Internets geht besonders zu Lasten
anderer Medien: 83 Prozent der befragten Surfer schauen weniger Fernsehen und
Video. Jeder dritte Befragte schl&auml;gt seltener ein Buch auf und jeder vierte h&auml;lt
sich bei der Lekt&uuml;re von Zeitungen und Zeitschriften zur&uuml;ck. 44 Prozent der
Befragten verzichten zugunsten des Internet-Surfens auf Schlaf. Dar&uuml;ber hinaus
wirkt sich die Internet-Nutzung auch auf direkte soziale Kontakte aus: Jeder
vierte geht weniger aus, w&auml;hrend 18 Prozent Telefongespr&auml;che reduzieren. 17
Prozent geben an, ihre pers&ouml;nlichen Kontakte einzuschr&auml;nken. Die Befragten gehen
nach eigenen Angaben mehrmals w&ouml;chentlich ins Internet. </p>

<p><font size="+1"><strong>News-Ticker f&uuml;r private
Homepages:</strong></font><br> Private Homepages k&ouml;nnen ab sofort durch einen
aktuellen Nachrichten-Ticker aufgewertet werden. ZDF.MSNBC, das programmbezogene
Nachrichtenangebot des ZDF im Internet, bietet allen Autoren von Websites ab
sofort kostenfrei die M&ouml;glichkeit, einen Nachrichten-Ticker auf die eigene
Website zu integrieren. Der <a
href="http://www.zdf.msnbc.de/modules/newsticker/newsticker.asp"> Source-Code
</a> daf&uuml;r kann man beim ZDF herunterladen. </p>

<p><font size="+1"<strong>Vatikan startet Werbekampagne: </strong></font><br>
In Sachen Werbung hat sich der <a href="http://www.vatikan.va"> Vatikan</a>
jetzt mit einem weltlichen Verb&uuml;ndeten zusammengetan. Die Agentur <a
href="http://www.youngandrubicam.com"> Young &amp; Rubicam</a> soll einen
internationalen Print-, Plakat- und TV-Auftritt entwickeln, mit dem die
Bedeutung der Jahrtausendwende f&uuml;r die Katholiken kommuniziert werden soll. Sie
soll die Millionen von Menschen ansprechen, die zu Weihnachten und Silvester
nach Rom pilgern werden. Au&szlig;erdem soll mit Hilfe der Kampagne der Verkauf von
Produkten mit dem Logo des Vatikans angekurbelt werden. </p>

Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p><a name="a3"><font color="800000" size="5">
<b>ein lustiges Gedicht von Joachim Ringelnatz </font></b></a></p>

<p><table border=0>
<tr><td>&nbsp; &nbsp;  &nbsp;</td><td><b><u>Der</u> <u>Briefmark</u></b></td></tr>
<tr><td>&nbsp;</td><td>Ein m&auml;nnlicher Briefmark erlebte </td></tr>
<tr><td>&nbsp;</td><td>was Sch&ouml;nes bevor er klebte. </td></tr>
<tr><td>&nbsp;</td><td>Er war von einer Prinzessin beleckt. </td></tr>
<tr><td>&nbsp;</td><td>Da war die Liebe in ihm erweckt. </td></tr>
<tr><td>&nbsp;</td><td>Er wollte sie wieder k&uuml;ssen, </td></tr>
<tr><td>&nbsp;</td><td>da hat er verreisen m&uuml;ssen. </td></tr>
<tr><td>&nbsp;</td><td>So liebte er sie vergebens. </td></tr>
<tr><td>&nbsp;</td><td>Das ist die Tragik des Lebens... </td></tr>
</table></p><br>
Gehe zum <a href="#top" align=left> Anfang </a>
<hr>
<p>
<a name="a4"><font color="800000" size="5"><b>Feedback </font></b></a></p>

<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&#252;cksichtigt. Ein Autor erscheint bei mir nur
einmal, auch wenn mehrere Beitr&#228;ge lobenswert sind: </p>
<ul>
<li> <b>Astro Corner</b> von Lars Philipsen</li>
<li> <b>Farbe1</b> von Kilian Servais</li>
<li> <b>Futter zur&uuml;ck</b> von Thomas Weber</li>
<li> <b>Grotesksong</b> von Daniel Stein</li>
<li> <b>Multiecke 11</b> von Gerd Wolpert</li>
</ul>
<p>Wenn wir schon sagen, was uns gefallen hat, dann ist es auch opportun sagen
zu d&uuml;rfen, was einem pers&ouml;nlich missfallen hat. Das ist der negative satanische
Hintergrund und die versch&auml;mt Schamlose als Logo von Ronald L&uuml;ckfeldt. &Uuml;ber
Geschmack l&auml;&szlig;t sich ja bekanntlich streiten, aber was zuviel ist, ist zuviel.
</p>
<hr>
<center>
<table border="6" width=90%><tr><td>
<p>
Autor: &#160; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&#160; &#160; &#160;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.chiemgau.com/apc&amp;tcp/members/wolf"> http://www.chiemgau.com/apc&amp;tcp/members/wolf </a>
</font>
<br>
</td></tr></table>
<br>
</body>
</html>
