


<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Ein Test aus dem Mittelalter: Pelican Press</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>

<h1><CENTER><FONT COLOR="green">Pelican Press</FONT></CENTER></h1></P>

Heute m&#246;chte ich Euch mal ein (ur?)altes Programm (1991) namens &quot;Pelican Press&quot;
vorstellen, da&#223; bei Kleinigkeiten im Bereich der Grußkarten selbst heute noch seinen Dienst erf&#252;llt.</P>

<h2><CENTER><FONT COLOR="YELLOW">Was ist &#252;berhaupt &quot;Pelican Press&quot;?</FONT></h2></CENTER></P>
Pelican Press ist ein Tool, mit dem man auf einfache Weise Gru&#223;karten,
Gl&#252;ckwunschkarten, Poster, Schilder oder Eintritskarten entwerfen kann.
Selbst kleinere Texte lassen sich mit Pelican Press in das jeweilige
Dokument integrieren, wobei alle Fonts genutzt werden können, die sich auf der
Bootpartition im Verzeichniss &quot;Fonts&quot; befinden.
F&#252;r Leute, die ansprechende Karten erstellen wollen, aber mit einem (teuren)
DTP Tool nicht umgehen k&#246;nnen und mit der normalen Textverarbeitung nicht
die gew&#252;nschten Ergebnisse erreichen, ist Pelican Press vielleicht die
ideale
Alternative.
</P>
<h2><CENTER><FONT COLOR="aaaaaa">Was kann es
&#252;berhaupt?</FONT></CENTER></h2></P>
Mit dem Program selber (2 Disketten) werden auch gleich 2 weitere Disketten
geliefert, die jeweils Hintergr&#252;nde, Muster, Verziehrungen oder ClipArts
enthalten. Zus&#228;tzlich kann Pelican Press auch IFF Grafiken importieren, aber
alle weiteren Formate (JPG, GIF etc.) sind f&#252;r PPress ein Buch mit mehr als
sieben Siegeln (kein Wunder wenn man sich das Entstehungsdatum anschaut).
Damit lassen sich im Handumdrehen die gew&#252;nschten Kunstwerke erstellen und
das wirklich fix. F&#252;r die bessere Visualisierung habe ich hier schnell mal
einige Screenshots gemacht:</P>
<hr><CENTER>
<img src="ppress1.png"></P>
<img src="ppress3.png"></P><BR>
</P></CENTER>
<hr>
<h2><CENTER><FONT COLOR="purple">Die
Oberfl&#228;che:</FONT></CENTER></h2></P>
Die Oberfl&#228;che ist so aufgebaut, wie man es schon von diversen
Grafikprogrammen (PPaint) kennt: Links ist eine Men&#252;leiste mit der man die
gew&#252;nschte Option ausf&#252;hren kann und ggbf. noch kleine Retuschierarbeiten
durchf&#252;hren kann. Ein Malprogramm von heute kann PPress damit zwar nicht
schlagen, aber f&#252;r grobe Korrekturen reicht es allemal. Der restliche
Bereich ist, wer h&#228;tte es erraten, f&#252;r die eigentliche Publikation gedacht.
Ok, StyleGuide ist das ganze nicht und das OS 1.3 Feeling läßt das ganze
dann auch recht antiquitiert wirken, aber immerhin funktioniert alles
(selbst auf einem mit GraKa und 68040 Prozessor l&#228;uft PPress einwandfrei). Ach ja:
Auch eine Promotion mittels ModePro klappte bei mir einwandfrei. So wäre es
theoretisch möglich, PPress auf 1024 X 768 Pixeln laufen zu lassen...
</P>
<h2><CENTER><FONT
COLOR="blue">Einschr&#228;nkungen:</FONT></CENTER></h2></P>
Nat&#252;rlich muss man sich im klaren sein, da&#223; PPress kein modernes Tool ist,
da&#223; es selbstredent mit aktuellen Vertretern dieses Genres aus dem PC- und
Amiga Bereich aufnehmen kann. Die oben schon erw&#228;hnte Einschr&#228;nkung auf das
IFF Format so wie die Beschr&#228;nkung auf 32 Farben sprechen da, denke ich mal,
f&#252;r sich.</P>
Ein weiteres Manko besteht darin, da&#223; man s&#228;mtliche Texte nur im Textmodus
sieht. Wechselt man in den Zeichenmodus (um z.B. noch eine Linie zu ziehen)
verschwinden die Texte automatisch und man kann nur erahnen, wo der Text
steht.</P>
Mitunter kam es auch vor, da&#223; externe IFF Grafiken total fehlerhaft geladen
wurden und nur ein Pixelbrei auf dem Schirm zu sehen war, was aber mit
Sicherheit an der auf 32 Farben beschr&#228;nkten Farbpalette liegt. Will man
also ein Bild importieren, muss man mit einem Grafiktool das ganze im 32
Farben Modus in IFF abspeichern (funktioniert z.B. mit PPaint, ArtEffect und Deluxe Paint). </P>

<h2><CENTER><FONT COLOR="WHITE">Fazit:</FONT></h2></CENTER></P>
F&#252;r Anf&#228;nger, die einfach nur m&#246;glichst schnell und einfach farbige
Gru&#223;karten (oder &#228;hnliches) herstellen wollen, ist dieses Programm wirklich
mal einen Blick wert. Professionelle Anwender werden zwar mitlerweile schon
mit dem Kopf sch&#252;tteln, was denn ein solcher &quot;Test&quot; in der NC zu suchen hat,
aber f&#252;r eine geringe Anzahl an Usern kann PPress dennoch auch heute noch
gute Dienste leisten. Versteht mich nun aber nicht falsch: Einen Blick kann
man mal riskieren, aber deshalb muss man nicht sofort PageStream von der
Platte l&#246;schen. Versteht dieses Tool als kleine Alternative, die durchaus
ab und an mal n&#252;tzlich sein kann bzw. teilweise, so simpel es sich anhören mag, einfach schneller
zu bedienen ist. </P>
Zu bekommen ist das Tool bei IrseeSoft (u.a. TurboPrint und Picture
Manager); zumindest habe ich es dort vor 2 Jahren bekommen. Die Zusatzdisks
für Grafik können dann gleich mitbestellt werden. Im Lieferumfang ist
übrigens auch ein gedrucktes Handbuch enthalten; eine schnelle Eingewöhnung
ist also garantiert.</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
