<html>
<head>
  <title>Spieleteil</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="agpj6.html">PREV</a> | <a href="agpj8.html">NEXT</a>
<hr>
<pre>

7. Review: The A-Z of Amiga Games (Ad Astra Publishing)
-------------------------------------------------------

Selten zuvor habe ich eine CD-ROM mit einer so guten Idee in meine H&auml;nde
bekommen. Cameron Lister aus Leeds in England hat ein Nachschlagewerk mit
fast allen kommerziellen AMIGA-Spielen erstellt.
Das A-Z of Amiga Games besteht komplett aus HTML-Texten und jpg-Bildern,
kann also vollkommen system&uuml;bergreifend genutzt werden. Voraussetzung ist
lediglich ein HTML-Browser. Nach Start der Index-Datei kann man entweder
direkt zu den Spiele-Eintr&auml;gen kommen (indem man auf einen der Buchstaben
klickt) oder Listen von Software-H&auml;usern, Spielgenres und Programmierern
aufrufen. Und das macht die Erstellung in HTML so genial: Klickt man zum
Beispiel auf das Spiel &quot;Sensible World of Soccer&quot;, erscheint unter dem
Punkt Program Type der Eintrag &quot;Arcade Football Game&quot;. Ein Klick darauf
und man kommt zu einer Aufstellung aller Arcade-Football-Games seit
Bestehen des AMIGAs. Weitere Informationen, die man &uuml;ber die einzelnen
Spiele erh&auml;lt, sind z.B. die Systemvoraussetzungen, das Erscheinungsjahr,
der damalige Preis, der Publisher, die Bewertung in der englischen
Zeitschrift AMIGA Format und das Spielgenre. Weiterhin komplettieren
zahlreiche Screenshots die Informationen. Doch das ist noch nicht alles:
Werbeanzeigen, Fotos der Verpackungen vieler Spiele und vor allem Cheats,
Tips, Tricks und Komplettl&ouml;sungen machen das &quot;A-Z of AMIGA Games&quot; zu einem
Mu&szlig; f&uuml;r JEDEN AMIGA-Spielefan, der Informationen zu Spielen ben&ouml;tigt oder
ganz einfach einmal in der Vergangenheit schwelgen will. Erh&auml;ltlich ist
die CD-ROM zwar nur direkt in England, die Lieferung erfolgt jedoch
&auml;u&szlig;erst z&uuml;gig. K&auml;ufer der CD-ROM erhalten zu einem geringen Preis
regelm&auml;&szlig;ig Updates der CD-ROM, so da&szlig; das Werk immer kompletter wird.
Die erste Version des A-Z bietet schon weit &uuml;ber 2000 Eintr&auml;ge und weist
kaum L&uuml;cken auf. Den auf den ersten Blick recht hohen Preis von 60 DM ist
die CD-ROM auf jeden Fall wert, schlie&szlig;lich steckt auch eine Riesenarbeit
hinter dem Projekt von Cameron Lister. Tausende Screenshots mu&szlig;ten aus
Zeitschriften eingescannt werden, Millionen von Informationen
zusammengetragen werden und das alles auch noch in HTML-Form gebracht
werden. Das Wertungsschema in AMIGA AGPJ reicht f&uuml;r diese hervorragende
CD-ROM eigentlich gar nicht aus, sie h&auml;tte mehr als eine 10/10 verdient.

+-------------------------------------------------------------------------+
|  Name:          The A-Z of AMIGA Games                                  |
|  Hersteller:    Ad Astra Publishing, PO Box 90, Leeds, West Yorkshire,  |
|                 LS11 8XU, England - Internet: <a href="http://www.adastrauk.com/">http://www.adastrauk.com/</a> |
|  Preis:         60 DM                                                   |
|  Genre:         Nachschlagewerk                                         |
|  Sprache:       englisch                                                |
|  System:        alle AMIGAs + Web-Browser                               |
|  Fazit:         brillantes Nachschlagewerk f&uuml;r ALLE Amiga-Spielefans.   |
|                                                                         |
|  Wertung:       10/10   &#060;--------- AMIGA AGPJ AWARD                     |
+-------------------------------------------------------------------------+
</pre>
</body>
</html>
