<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="forum3.html">PREV</a> | <a href="forum5.html">NEXT</a>
<hr>
<pre>

4. Kritik an Sascha van Wahnems AMIGA-Vorstellungen (von Marc B&ouml;ttcher)

&raquo;Es geht um den Leserbrief &quot;Kritik an den AMIGA-Zukunftspl&auml;nen einiger User 
(von Sascha van Wahnem)&quot;.
Da mu&szlig; ich einfach mal was zu loswerden.....


Hallo Sascha, ich m&ouml;chte Dich hier keineswegs pers&ouml;nlich angreifen, dennoch
konnte ich nicht umhin, Deinen Ausf&uuml;hrungen kritisch zu folgen bzw. mich
kritisch gegen&uuml;ber selbigen zu &auml;u&szlig;ern.

&#062;1. Warum PCI in neuen Amigas???
&#062;
&#062;Das w&uuml;rde mich mal brennend interessieren, warum alle so 'geil' auf PCI 
&#062;sind!?
&#062;Ist PCI so was Besonderes? Ich meine von der Leistung her? Wohl kaum, 
&#062;bestimmt gibt es 'was Besseres.

Ich denke, das ist gar nicht die Frage! Die Frage ist, wie man den Amiga
halbwegs wieder auf die Beine bekommt, ohne sich gleich ins &ouml;konomische 
Abseits zu bef&ouml;rdern.
 
&#062;Oder ist es nur wegen des wahnsinnigen Kartenangebots auf dem Markt?

Nat&uuml;rlich, weswegen denn sonst????

&#062;Ihr k&ouml;nnt' mich f&uuml;r bl&ouml;de halten, aber ich denke, da&szlig; der Einzug von PCI 
&#062;als Hauptschnittstellen-System der technische R&uuml;ckschritt wird! Sollte PCI 
&#062;der Ersatz werden f&uuml;r die bisherigen ISA-Slots im Amiga, na gut, bin ich 
&#062;bereit zu sagen, auch gut. Aber wenn dadurch unser Zorro-Bus-System 
&#062;wegf&auml;llt, w&auml;re das, zu deutsch gesagt, M&uuml;ll!

Ich finde Deinen Standpunkt sehr opportunistisch. Als &quot;Slave&quot;-Bus-System 
ist der M&uuml;ll dann doch gut genug?

&#062;Zum anderen ist es ja doll, wenn ich dann den Amiga (8000 ??) da stehen 
&#062;habe, der dann eine normale SoundBlaster-kompatible Soundkarte hat, eine 
&#062;Matrox Millenium sowieso, und was wei&szlig; ich nicht noch alles vom PC her 
&#062;hat. 
&#062;Da mu&szlig; ich doch mal ganz klar die Frage stellen, ist das &uuml;berhaupt ein 
&#062;Amiga, oder sollte man dann nicht schon eher sagen, es handelt sich um 
&#062;einen IBM-PC? Was hat uns denn bisher immer so stark vom IBM-PC-Markt 
&#062;unterschieden? Wir hatten unsere eigene Hardware, die NUR f&uuml;r den Amiga 
&#062;gemacht war, sie ist immer eine gro&szlig;e Innovation gewesen, weil sie &uuml;ber 
&#062;meist besondere Sachen verf&uuml;gt hat, Leistungen und Erweiterungs-
&#062;M&ouml;glichkeiten, die fast nur auf dem Amiga angesagt waren. Meiner Meinung 
&#062;nach war das immer mit einer der Gr&uuml;nde, warum der Amiga so was Besonderes 
&#062;war. Ich bin eindeutig f&uuml;r eine Weiterentwicklung der Zorro-Systeme. Ich 
&#062;hoffe, da&szlig; ich mit dieser Meinung nicht allein dastehe. 

Im Grunde gebe ich Dir ja recht, zumindest rein &quot;herzensm&auml;&szlig;ig&quot;. Klar m&ouml;chte 
auch ich den Amiga als &quot;Stand-alone&quot;-Computer sehen, wenn man das so sagen 
kann. Allerdings ist dieses eine recht irrationale &Uuml;berlegensweise. Fakt 
ist doch nun mal, da&szlig; sich das modulare System der PCs durchgesetzt hat. 
Ich glaube, auch Du wirst mir zustimmen, da&szlig; dieses Durchsetzen seine 
Wurzeln in den auf den PC eingesetzten Bussystemen hat. Ob besser oder 
nicht, ist erst einmal gar nicht die Frage. Die Frage ist doch eindeutig, 
inwieweit ein Konzept vermarktet werden kann. Mit der Abkapselungspolitik, 
um es salopp zu formulieren, hat Commodore uns doch die schwere Erbschaft 
eines Systems hinterlassen, welches ein Exotendasein fristet. Und dieses 
Dasein m&ouml;chtest Du weiter kultivieren?
  
&#062;2. Neuer Amiga!
&#062;
&#062;So stelle ich ihn mir vor:
&#062;CPU: PPC 604e (min. 200 MHz) onboard, weiterhin die M&ouml;glichkeit, &uuml;ber CPU-
&#062;Boards die Sache auszubauen.
&#062;RAM: Nur noch Fast-RAM, kein Chip-RAM mehr. Erweiterbar bis 512 MB &uuml;ber 
&#062;PS/2 UND DIMM!!
&#062;Floppy: Wie beim A2/3/4000 2 St&uuml;ck anschlie&szlig;bar, serienm&auml;&szlig;ig mit einem HD- 
&#062;Floppy
&#062;
&#062;Bus-System: min. 5 x Zorro IV- oder -V-System (128 Bit-Schnittstelle) mit 
&#062;ISA und/oder PCI als Second-Port. Trotzdem durch Software aber volle 
&#062;Unterst&uuml;tzung wie beim Zorro-Bus
&#062;Board: Wenn's geht im ATX-Design. Gegebenenfalls etwas gr&ouml;&szlig;er.
&#062;OS: Wieder ROM. Besser gesagt EPROM, wo man ganz einfach durch Kauf eines 
&#062;Betriebssystems das EPROM onboard neu brennt. Vorteile vom ROM gegen&uuml;ber 
&#062;einem Betriebssystem auf Datentr&auml;ger sind allgemein bekannt, denke ich 
&#062;mal. 
&#062;Wenn nicht, denkt mal an Windows!!
&#062;Sound: 16 Bit DSP-Chip onboard, aber mit besserer Option, das Ganze bei 
&#062;Wunsch auf Soundkarte umzulenken. 
&#062;Grafik: Grafikchip mit 3D-Unterst&uuml;tzung. Bildschirm von 1024*768 in 32 Bit 
&#062;darf kein Problem sein. 8 MB VRAM (erweiterbar?). Auch hier wieder die 
&#062;Option durch Einbau einer Grafikkarte, das zu verbessern.
&#062;Das Ganze als Mini- oder BigTower, f&uuml;r den Anwender halt passend.
&#062;Typische Schnittstellen (Maus, etc., alles wie bisher. Vielleicht aber 
&#062;einen Chip f&uuml;r die Tastatur, der durch Um-Jumpern umzustellen ist auf 
&#062;Amiga- oder PC-Tastatur. 

Welch sch&ouml;ner.......unbezahlbarer Traum!

&#062;Ihr merkt, ich w&uuml;rde eigentlich das Vergleichbare wie bisher nehmen, halt 
&#062;nur auf dem aktuellen Stand der Technik. Warum? Nun, bei heutigen PC wird 
&#062;auch immer mehr auf Customchips gesetzt. Immer mehr Funktionen werden 
&#062;onboard gel&ouml;st. Warum sollten wir, die es nicht anders kennen, jetzt dazu 
&#062;&uuml;bergehen, alles auf Steckkarten zu l&ouml;sen, wo der PC doch genau in die 
&#062;andere Richtung geht. Ihr wollt zwar alles vom PC irgendwie &uuml;bernehmen, 
&#062;aber das schlechte kann man doch au&szlig;en vor lassen. Oder?

Sicherlich. Allerdings solltest Du mir mal den Anwender zeigen, der seinen 
PC gegen solch einen &quot;Amiga&quot;, der wahrlich nicht gerade billig zu haben 
sein w&uuml;rde, eintauschen w&uuml;rde.

Ich habe im &uuml;brigen auch einen Traum:
.....10 Jahre sp&auml;ter.....
Ich besitze immer noch einen Amiga, welcher den gegebenen Standards 
angepa&szlig;t ist, und habe einen Freund, der einen PC benutzt. Ich habe mir 
eine CD geholt, und gebe sie ihm, damit er sich das tolle Programm auch mal 
anschauen kann.
.....10 Jahre zur&uuml;ck.....

Mit freundlichen Gr&uuml;&szlig;en, 
 <a href="mailto:boettchm@uni-duesseldorf.de">boettchm@uni-duesseldorf.de</a>&laquo;
</pre>
</body>
</html>
