<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="forum6.html">PREV</a> | <a href="forum8.html">NEXT</a>
<hr>
<pre>

7. Leserbrief zu den Entscheidungen von AMIGA, Inc. (von Alexx Riedel)

&raquo;Kaum hatte ich da meine letzte Mail fertig, in der ich f&uuml;r die Verwendung
von Standardkomponenten im neuen Amiga pl&auml;diert habe, kam jene 
&uuml;berraschende Pressekonferenz auf der WoA: Pl&ouml;tzlich war alles anders: Das, 
was Petro T. bislang, nach langem Z&ouml;gern, als Marschroute vorgegeben hatte 
(PowerPC), war scheinbar nichtig, der neue Amiga soll ein Intel-Rechner 
sein. Zus&auml;tzlich wurden irgendwie, dank der gelungenen 
&quot;Informationspolitik&quot; von Amiga, Inc./Int., Ger&uuml;chte &uuml;ber einen neuen 
Super-Duper-Hyper-Amiga laut, der Ende n&auml;chsten Jahres erscheinen soll. Ich 
wei&szlig; nicht mehr, wem von Amiga ich jetzt &uuml;berhaupt noch glauben darf, aber 
lassen wir das mal beiseite.
Nur eins: Ich habe die dauernden leeren Versprechungen satt, ich brauche 
mal eine Perspektive!

Als ich in der letzten Mail eine Lanze f&uuml;r Standardkomponenten (PCI, 
Grafik- und Soundkarten) brach, hatte ich nie die Verwendung eines 
Standard-Intel-Boarddesigns im Kopf, sei es nun als Maschine nur f&uuml;r 
Entwickler oder als Enduser-Computer. AmigaOS auf Intels? Schauen wir uns 
mal die Konkurrenz an:

1. Windows: Was auch immer man gegen dieses &quot;Betriebssystem&quot; sagen kann -
Win95/98 ist nun mal sowieso bei praktisch jedem verkauften PC dabei. Es
gibt Treiber und Programme f&uuml;r alles (wer eine Grafikkarte kauft, kriegt
eine Sammlung Spiele mit, wer einen Scanner kauft, erh&auml;lt auch eine CD mit
der n&ouml;tigen Software). Wer die dauernden Abst&uuml;rze leid ist, und auf Spiele
verzichten kann (DirectX), der nimmt halt dann Win NT, ein f&uuml;r
Microsoft-Verh&auml;ltnisse ziemlich ausgereiftes OS. Quantit&auml;t statt Qualit&auml;t
setzt sich halt durch. Ist so, leider, der Normal-Computer-User kriegt ja
gar nicht mit, was er vers&auml;umt.

2. Die Alternative f&uuml;r alle, die ein ernsthaftes Betriebssystem brauchen,
ist Linux: Dank Unix-Kern stabil und problemlos ins Netzwerk zu 
integrieren, und viele andere Vorz&uuml;ge. Die damit verbundene Komplexit&auml;t 
braucht wegen sorgsam zusammengestellter Distributionen und der Oberfl&auml;che 
KDE den durchschnittlichen Computerbenutzer inzwischen auch nicht mehr zu 
beeindrucken.
Dabei v&ouml;llig kostenlos verf&uuml;gbar und mit riesigem Software- und 
Treiberpool.

3. OS/2 hat sich ja nicht so durchgesetzt, kann aber als abschreckendes
Beispiel dienen: IBM, der gr&ouml;&szlig;te Softwarekonzern der Welt (nein, das ist
NICHT Microsoft), hat es nicht geschafft, dieses - in jeder Hinsicht
&uuml;berlegene - Betriebssystem gegen Windows durchzusetzen.

4. Unter Exoten, die es wohl nie schaffen werden, f&auml;llt z.B. BeOS.

Also, wie soll sich ein AmigaOS auf Intel-Plattformen durchsetzen, sei es
bei Anwendern oder Entwicklern? Da m&uuml;&szlig;te es schon einiges zu bieten haben.
Das Softwarefundament an alter Amiga-Software, welches ohnehin wie bei UAE
emuliert werden m&uuml;&szlig;te, kann gegen obige Konkurrenten schon mal kein 
Argument sein.

Zwar bin auch ich uneingeschr&auml;nkt daf&uuml;r, beim Design eines neuen Amigas
keinerlei faule Kompatibilit&auml;tskompromisse einzugehen. Wozu so was f&uuml;hrt,
sieht man am besten am MS-DOS-Aufsatz Windows 95. Aber um einen dummen
Spruch anzubringen: Amiga, Inc. scheint da den Teufel mit dem Beelzebub
austreiben zu wollen (pa&szlig;t der Spruch in dem Zusammenhang? Auf alle F&auml;lle
kommt er cool ;-) ). Nebenbei werden auch noch alle vor den Kopf 
geschlagen, die auf den PowerPC gesetzt haben.

Noch ein Kommentar zu einem Leserbrief: Da lese ich doch, da&szlig; jemand ein
Amiga-propriet&auml;res Bussystem bevorzugt, weil dann Amiga-Spezialit&auml;ten wie
die Cybervision64/3D oder die PicassoIV weiterentwickelt werden k&ouml;nnten.
Wow, das ist gewagt: Was ist denn eine der o.a. Grafikkarten anderes als 
ein Standard-PCI-Chip, der mit M&uuml;h&acute; und Not (und Performance-Verlusten) auf 
den Zorro-Bus getrimmt worden ist? So speziell sind diese Boards auch nicht
mehr: Im PC-Bereich ist der ViRGE (auf der CV64/3D) total veraltet, da 
geben andere Bausteine den Ton an. Der Amiga kann davon nicht profitieren, 
da m&uuml;&szlig;te schon mal wieder jemand herkommen und ein v&ouml;llig neues Board daf&uuml;r
konstruieren. Also, warum der Aufwand, warum nicht gleich PCI? BTW: Wenn 
das Plug&acute;n&acute;Play da manchmal nicht so klappt, ist die Schuld bei Windows zu 
suchen, nicht bei PCI!

CU

Alexx

--
Alexx Riedel
<a href="mailto:101.128890@germany.net«">mailto:101.128890@germany.net«</a> 
</pre>
</body>
</html>
