<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="forum2.html">PREV</a> | <a href="forum4.html">NEXT</a>
<hr>
<pre>

3. Unterst&uuml;tzung f&uuml;r Sascha van Wahnems Vorstellungen (von Ralf Driesner)

&raquo;In der AMIGA aktuell 5/98 stellte Sascha van Wahnen seine Kritik am &quot;Neid&quot; 
einiger Amiga-User auf diverse Hardware-Komponenten aus dem PC-Sektor 
deutlich dar. Ich wage den Mut, ihn in einigen seiner Punkte voll zu 
unterst&uuml;tzen. In der c't-Ausgabe 4/98, die mir zuf&auml;llig in die H&auml;nde viel, 
las ich einige sehr interessante Artikel &uuml;ber Prozessordesign in 
Deutschland bzw. das sog. Xputer-Konzept der Uni Kaiserslautern. Ich m&ouml;chte 
hier nicht weiter auf die teilweise langatmigen Einzelheiten dieses 
Konzepts eingehen, zumal auch ich nicht unbedingt Profi in Chipdesign bin. 
Trotzdem m&ouml;chte ich insbesondere auf den Fakt hinweisen, da&szlig; aufgrund der 
bisherigen Entwicklungen im PC-Bereich (Modul-Bauweise des Computers) sehr 
viel Zeit, Geld und Kapazit&auml;ten der Hardware-Entwickler und(!!) der User 
(Stichwort &quot;Spardose PC&quot;) darauf verwendet wurden, immer neue 
Zusatzplatinen in einen Computer hineinzustopfen (welche sehr bald wieder 
technisch &uuml;berholt sind) und daraus eine (zun&auml;chst) &uuml;berz&uuml;chtete Maschine 
zu schaffen, die an den Bed&uuml;rfnissen des Anwenders voll und ganz 
vorbeigeht. Amiga ist zwar insbesondere im Grafik- und Soundbereich schon 
immer eine Kapazit&auml;t gewesen. Jedoch wurde dieser Vorsprung durch das 
jahrelange Z&ouml;gern der Hauptentwickler katastrophal verspielt. Ich denke, 
und da mu&szlig; ich Sascha recht geben, da&szlig; der Amiga wieder eigene, massive 
Akzente setzen mu&szlig;. Das blo&szlig;e Schielen auf teure, uneffektive PC-Hardware 
ist da sicherlich keine L&ouml;sung. Petro Tyschtschenko soll wohl k&uuml;rzlich den 
mi&szlig;verstandenen Satz ge&auml;u&szlig;ert haben, da&szlig; ihm ein 68080 mit 200 Mhz f&uuml;r die 
weitere Amiga-Zukunft am liebsten gewesen w&auml;re. So oder so, ich verstehe 
diesen Satz so, da&szlig; er eher gemeint hatte, die eingespielte Technologie 
innovativer zu verwenden. Ob dies auf einem 68k oder PPC geschehen wird, 
sei offengelassen. Ich denke, da&szlig; man eine dritte Komponente in jedem Fall 
mitber&uuml;cksichtigen sollte: Das Xputer-Konzept der Uni Kaiserslautern sollte 
einige f&uuml;hrende Amiga-Entwickler deutlich aufhorchen lassen. Ziel eines 
Amigas des 21. Jahrhunderts mu&szlig; die volle Offenheit des Gesamtsystems sowie 
insbesondere die volle Programmierbarkeit aller in Frage kommender Chips 
dieses Computers beinhalten (Stichwort Custom-Chips). Das Sch&ouml;ne an der 
Sache w&auml;re, da&szlig; auf diese Weise wertvolle Arbeitspl&auml;tze in Deutschland 
geschaffen werden k&ouml;nnen, denn zuf&auml;llig ist Deutschland eines der f&uuml;hrenden 
Entwickler-L&auml;nder f&uuml;r sog. ASICS bzw. Custom-Chips (wer h&auml;tte das 
gedacht!). Es spricht im Prinzip wohl auch nichts dagegen, diese Konzepte 
auf ein v&ouml;llig neues Amiga-System, unter Ber&uuml;cksichtigung insbesondere der 
Kompatibilit&auml;t mit anderen (k&uuml;nftigen) Amiga-Maschinen zu trimmen. Leider 
kenne ich mich zu wenig mit den technischen Details der Rechner- und 
Softwareentwicklung aus. Vielleicht finden sich aber trotzdem einige Amiga-
User, die mehr Erfahrung als ich haben, um mit mir ernsthaft &uuml;ber diese 
Thematik zu diskutieren. Vielleicht entwickelt sich ja dabei mehr, als 
derzeit absehbar ist, vielleicht teilt mir jedoch auch jemand mit, da&szlig; ich 
v&ouml;llig auf dem Holzweg bin. So oder so, ich bin gespannt!! Hier meine E-
Mail-Adresse: <a href="mailto:dries@i-dial.de">dries@i-dial.de</a> .
Viele Gr&uuml;&szlig;e aus M&uuml;nchen und: &quot;Let the Guru dancing!&quot;

Ralf Driesner&laquo;
</pre>
</body>
</html>
