<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="intern4.html">PREV</a> | <a href="forum1.html">NEXT</a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

Nach den sehr schwachen Teilnehmerzahlen im Monat April haben sich diesmal 
mit 34 Einsendungen deutlich mehr Leser beteiligt.

Ein Hinweis noch:

* Das bisherige Shareware-Spiel Crossfire, das es in den letzten Monaten zu  
  gewinnen gab, hat den Status gewechselt und ist ab sofort als Vollversion  
  im Aminet abrufbar (game/2play/XFireReg.lha). Somit f&auml;llt es bereits mit  
  dieser Ausgabe als Gewinn weg.


Zur Aufl&ouml;sung:


Standard-Frage: Nenne zwei aktuelle oder in Entwicklung befindliche         
                kommerzielle AMIGA-Textverarbeitungen.

Antwort: Traurig, aber wahr: Derzeit gibt es nur zwei kommerzielle           
         Textverarbeitungen f&uuml;r den AMIGA: Wordworth (das wenigstens noch    
         weiterentwickelt wird) und Final Writer, das von seinem Hersteller  
         Softwood (zumindest vorl&auml;ufig) aufgegeben wurde.
         In Entwicklung befindet sich Haage &amp; Partners &quot;Easy Writer&quot;. 
         Eine weitere Textverarbeitung wurde auf der Computer '97 von einer  
         Firma namens Decision Developments angek&uuml;ndigt, diese trat nach    
         der Messe jedoch nicht wieder in Erscheinung, so da&szlig; ein           
         Erscheinen des Produkts wohl eher zweifelhaft ist.                 
         Nichtsdestotrotz h&auml;tte ich f&uuml;r die Standard-Frage auch diese       
         Antwort akzeptiert, falls sie gekommen w&auml;re, was nicht der Fall    
         war.


Master-Frage: Wie lautet die Bezeichnung des im A3000/4000 f&uuml;r die          
              ZorroIII-Ansteuerung zust&auml;ndigen Chips? Welches ist die       
              aktuelle Revision?

Antwort: Ich habe alle Bezeichnungen von &quot;Buster 11&quot; bis &quot;Super Buster      
         Revision 11&quot; gelten lassen.

             
Meinungsfrage: Wird Phase 5 den geplanten Erscheinungstermin der preox    
               (Anfang 4. Quartal 1998, siehe AMIGA aktuell 4/98) einhalten  
               k&ouml;nnen?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
                  
1 (Ja, auf jeden Fall)                                                    -
2 (Ja, wahrscheinlich)                                                    4 
3 (Nein, wahrscheinlich nicht)                                           16
4 (Nein, auf keinen Fall)                                                14


Fazit:
------

Wie von mir pers&ouml;nlich erwartet, steht eine klare Mehrheit der Teilnehmer 
dem genannten Erscheinungsdatum &quot;Anfang viertes Quartal 1998&quot; sehr 
skeptisch gegen&uuml;ber, wohl auch aufgrund der Erfahrungen mit Phase 5, das ja 
nicht gerade f&uuml;r die Einhaltung seiner Termine bekannt ist. Dies mag jedoch 
auch in der technischen Komplexit&auml;t seiner Produkte (Stichwort: PowerPC-
Karten) begr&uuml;ndet sein.
Gerade einmal 12 Prozent der Einsender gehen von einem p&uuml;nktlichen 
Erscheinen des Rechners aus, fest rechnet jedoch niemand damit.

Im &uuml;brigen: In dieser schnellebigen Zeit werden die n&auml;chsten Ank&uuml;ndigungen 
des neuen &quot;Traumpaares&quot; Phase5 und Haage &amp; Partner zeigen m&uuml;ssen, ob der 
aktuell geplante PowerPC-Rechner (mehr dazu in dieser Ausgabe) noch viel 
mit der Prebox zu tun hat.


Nun zu den Preistr&auml;gern des letzten Gewinnspiels:


1 x Vollversion von &quot;Diamond Caves II&quot; : Andreas Etzrodt
1 x Vollversion von &quot;AFiloFaxPro&quot;: Werner Diesch
1 x Buch &quot;AMIGA und Video Faszination&quot;: Detlef Wojtaszkiewicz


Herzlichen Gl&uuml;ckwunsch!


Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm CDCat f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&laquo;CDCat (MUI) ist DER CD-ROM-Katalogisierer. Es eignet sich auch besonders 
f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und Archiv-Beschreibungen mitber&uuml;cksichtigt 
werden. Im Browser k&ouml;nnen CDs durchst&ouml;bert werden, ohne eingelegt zu sein. 
Auch ist Entpacken, Texte anzeigen etc. aus CDCat heraus m&ouml;glich. Ab 
Version 1.2 wird auch XPK zum Packen der Scankataloge unterst&uuml;tzt.&raquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar. Aktuell ist 
Version 2.1. Ein Test von CDCat l&auml;&szlig;t sich unter 
<a href="http://www.amigaworld.com/support/cdcat/C_test.html">http://www.amigaworld.com/support/cdcat/C_test.html</a> abrufen.

Der Autor ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Peter Elzner hat sein Programm ManiacBall f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;ManiacBall basiert auf dem klassischen Breakout, bei dem mit einem 
Schl&auml;ger und einem Ball Steine getroffen werden m&uuml;ssen und diverse Extras 
das Leben erleichtern. ManiacBall bietet als Erweiterung die M&ouml;glichkeit 
von mehreren Schl&auml;gern und mehreren B&auml;llen auf einem Spielfeld, ein 
lustiger Zwei-Spieler-Modus (gleichzeitig!) und jede Menge Extras, wie z.B. 
Laser, Schutzschild und vieles mehr. Wem die vorhandenen Level zu 
langweilig werden, kann sich mit dem Leveleditor auch eigene Spielstufen 
erschaffen.
Voraussetzungen: Amiga mit Kick2.0, 1MB Speicher.
          Grafikkarten werden unterst&uuml;tzt, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 25 Level, Editor eingeschr&auml;nkt
Registrierte Version: 25 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Ferst Computer hat einen Warengutschein in H&ouml;he von 25 Mark f&uuml;r das 
Gewinnspiel zur Verf&uuml;gung gestellt:

&raquo;Wir f&uuml;hren ein umfangreiches Sortiment mit &uuml;ber 1100 Artikel rund um den 
Amiga. Angefangen mit Hardware, wie Turboboards und Festplatten, &uuml;ber 
Software, wie Spiele, CD-ROMs und Anwenderprogramme, bis zu Literatur und 
Zeitschriften. Fordern Sie einfach unseren umfangreichen Katalog an!
Erreichen k&ouml;nnen Sie uns wie folgt:

Post                Amiga Hard- &amp; Software, K&ouml;penicker Str. 11, 15537 Gosen
Tel.                03362/820097
Fax.                03362/882988
eMail               <a href="mailto:ferst@t-online.de">ferst@t-online.de</a>
Internet            <a href="http://www.ferst.com">www.ferst.com</a>
T-Online            FERST#                                                &laquo;
        

Des weiteren hat Thomas Hasemann die Festplatten-Software &quot;Ami-FileSafe 
Pro&quot; zur Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!


Aufruf an alle innovativen Programmierer und AMIGA-Firmen:

Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
Online-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere 
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt. 
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser 
bekanntzumachen.
       

Hier die neuen Fragen (nur ZWEI davon m&uuml;ssen beantwortet werden):


Standard-Frage: Unter welcher Adresse ist die WWW-Homepage der AMIGA-       
                Entwicklungsabteilung AMIGA, Inc. erreichbar? (Tip: Es gibt  
                zwei Antwortm&ouml;glichkeiten!)
                

Master-Frage: Wie viele Sockel f&uuml;r PS/2-RAM-Module sind auf der Original-    
              A3000/4000-040-Karte (A3640) von Commodore vorhanden?

             
Meinungsfrage: Wie beurteilst Du die von AMIGA, Inc. bislang verk&uuml;ndeten    
               Hard- und Software-Entscheidungen?


M&ouml;gliche Antworten:
                  
1: Ich bin sehr zufrieden mit den Entscheidungen.
2: Ich bin im gro&szlig;en und ganzen einverstanden.
3: Ich bin eher unzufrieden mit den Entscheidungen.
4: Ich bin &uuml;berhaupt nicht einverstanden.

Es gen&uuml;gt, die Nummer anzugeben.


Unter allen Teilnehmern, die mindestens ZWEI dieser Fragen bis zum 25. 
Juni (Einsendeschlu&szlig;) beantworten (die Wissensfrage[n] nat&uuml;rlich 
richtig), werden die folgenden Gewinne verlost:


1 x Vollversion von &quot;ManiacBall&quot; (Wert: DM 25,-)
1 x Vollversion von &quot;CDCat&quot; (Wert: DM 30,-)
1 x Warengutschein von Ferst Computer (Wert: DM 25,-)
1 x Festplatten-Software &quot;Ami-FileSafe Pro&quot; (Wert: nach Ermessen)


Wer alle drei Fragen beantwortet (die Wissensfragen m&uuml;ssen nat&uuml;rlich 
richtig sein), nimmt mit ZWEI Stimmen an der Verlosung teil und hat somit 
die doppelte Chance auf einen Preis.


Schickt Eure Antworten bitte bis zum 25. Juni an folgende Adresse:

Carsten Schr&ouml;der
Helmoltstra&szlig;e 10
37081 G&ouml;ttingen
Deutschland

oder per E-Mail an:

<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Bitte verge&szlig;t nicht, Eure Post-Anschrift anzugeben, und ggf. den 
bevorzugten Preis. Eine Garantie, da&szlig; Ihr im Gewinnfall dann auch genau 
diesen Preis erhaltet, kann nat&uuml;rlich nicht gegeben werden.
</pre>
</body>
</html>
