<html>
<head>
  <title>Interviews</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="ajpj13.html">PREV</a> | <a href="interviews2.html">NEXT</a>
<hr>
<pre>

Interviews
----------

1. Interview mit Paul Burkey (von Andreas Etzrodt)

&raquo;Interview mit Paul &quot;Foundation&quot; Burkey:
 ---------------------------------------

Hallo Paul! Besten Dank, da&szlig; Du die Zeit fandest,  unsere  Fragen  zu
beantworten!


Als erstes: Erz&auml;hle uns doch bitte etwas von Dir, was Du  tust  (Dein
Beruf), und so weiter. Wie bist Du zum Amiga gekommen?

 Mein Vollzeit-Job ist: Spiele f&uuml;r  den  Amiga  schreiben.  Ich  hatte
 Gl&uuml;ck,  da&szlig;  ich  von einem Wohlt&auml;tigkeitsverein einen A500 und viele
 andere tolle Sachen bezahlt bekommen habe. Irgendwann bekam ich einen
 Scheck  -  so fuhr ich eines Tages in die Stadt und habe meinen Wagen
 mit Amiga-Zubeh&ouml;r und Software beladen. Es war  einer  der  sch&ouml;nsten
 Tage meines Lebens!


Welche Computer-Ausstattung besitzt Du im Moment?

 Zur Zeit benutze ich einen A1200 Tower mit 040/40, CV64/3D, 20 MB RAM,
 einer sch&ouml;n gro&szlig;en Festplatte und einem ZIP-Laufwerk.


Warum  und  wie  hast  Du  begonnen,  Programme  und/oder  Spiele  zu
schreiben?

 Ich habe schon  auf  dem  C64  Spiele  geschrieben.  Aber  trotz  der
 Tatsache,  da&szlig;  es m&ouml;glich war, gute Spiele zu entwerfen, war der C64
 sehr einschr&auml;nkend, so da&szlig; ich meiner Kreativit&auml;t  nicht  den  freien
 Lauf  lassen konnte. Der Amiga schien ein Traum-Computer zu sein, als
 er erschien. Irgendwie hatte ich das nat&uuml;rliche Bed&uuml;rfnis,  einen  zu
 besitzen und daf&uuml;r zu programmieren.


Warum hast Du Foundation f&uuml;r den Amiga gemacht?  Oder  hast  Du  auch
versucht, eine PC-Version zu schreiben?

 Eine lange Zeit habe ich mit  AMOS  programmiert,  aber  eines  Tages
 entschlo&szlig; ich mich, einfach mal C zu testen. Zu der Zeit war C  keine
 einfache Sprache f&uuml;r Einsteiger, weil  die  meisten  Amiga-C-Compiler
 Shell-basiert  arbeiteten.  Deshalb fand ich, da&szlig; C keine komfortable
 Umgebung ist, um zu arbeiten. Als ein  Freund  von  mir  Blitz  Basic
 kaufte,   habe   ich   dieses   ausgetestet.   Foundation   fing  als
 experimentelle AGA-Programmierung an - und ich h&ouml;rte damit nicht auf.


Warum hast  Du  keine  (angeblich)  &quot;bessere&quot;  Sprache  benutzt,  zum
Beispiel C oder E? Was sind die Vorteile von Blitz Basic?

 Blitz Basic hatte den Vorteil, eine  gute  und  einfache  Sprache  zu
 sein,  mit  vielen  schnellen  und  m&auml;chtigen Funktionen, die in eine
 einfach zu bedienende Umgebung eingebaut waren. Die Zeiten haben sich
 ge&auml;ndert, und  moderne  C-Compiler bieten die gleichen Features - das
 hei&szlig;t, Blitz Basic hat nur  noch  den  Vorteil,  da&szlig;  es  einfach  zu
 benutzen ist.


Ist Blitz Basic DIE Sprache, um Spiele zu programmieren  (Worms,  6th
Sense und Foundation sind schlie&szlig;lich alle in Blitz geschrieben)?

 Blitz ist eine tolle Sprache, aber die  Hauptprobleme  sind,  da&szlig;  es
 nicht  m&ouml;glich  ist,  PowerPC-Code zu erzeugen, und da&szlig; die Programme
 nicht portabel sind.


Viele  Leute  denken  ja,  da&szlig;   Blitz   Basic   (wie   AMOS)   nicht
system-konform  ist,  da&szlig;  man keine Grafik- und Soundkarten benutzen
kann und da&szlig; das Multitasking grunds&auml;tzlich  abgeschaltet  wird.  Wie
ich  wei&szlig;,  sind  diese Behauptungen nur f&uuml;r den Blitz-Modus richtig.
Warum hast Du den Amiga-Modus gew&auml;hlt, um  Foundation  zu  schreiben?
War dies von Anfang an geplant?

 Der Blitz-Modus geht in Ordnung, wenn Du  die  Amiga-Hardware  direkt
 ansprechen  willst.  Worms  ist, meines Erachtens, ein gutes Beispiel
 hierf&uuml;r. F&uuml;r  Foundation  h&auml;tte  der  Blitz-Modus  keinerlei  Vorteil
 gehabt - daf&uuml;r aber Nachteile.


Foundation ist  in  Blitz  Basic  programmiert  -  ist  es  &uuml;berhaupt
m&ouml;glich,  eine  PowerPC-optimierte Version zu erstellen? Wird so eine
Optimierung  &uuml;berhaupt  ben&ouml;tigt, oder  ist   ein   68k   (z.B.   ein
68040/25MHz) schnell genug?

 Es gibt einige Teile im Spiel, die von einem PowerPC sehr profitieren
 w&uuml;rden.  Ich denke aber, da&szlig; ein 040/25 mehr als genug ist, um es mit
 einer sehr guten  Geschwindigkeit  zu  spielen.  Jetzt,  wo  ich  die
 Verkaufsversion  fertig  habe,  werde  ich  noch  einige  Zeit  damit
 verbringen, den Code zu optimieren, was dann als  kostenloses  Update
 erh&auml;ltlich sein wird.


Ist es - Deiner Meinung  nach - m&ouml;glich, ein  PowerPC-Blitz-Basic  zu
machen?

 Eine PPC-Version ist schon im Design-Stadium.  Ich  geh&ouml;re  zu  einer
 kleinen Gruppe von Programmierern, die versucht, eine neue Sprache zu
 entwerfen, die kompatibel zu Blitz Basic  ist  und  PPC  unterst&uuml;tzt.
 Dieses  Projekt  ist  im Moment in einem sehr fr&uuml;hen Stadium, aber es
 k&ouml;nnte ein sehr n&uuml;tzliches Tool werden, f&uuml;r diejenigen, die  f&uuml;r  den
 PowerPC  programmieren  wollen,  aber sich nicht mit C oder Assembler
 auskennen.


Abgesehen von Foundation: Welche Programme  und/oder  Spiele  stammen
noch von Dir?

 Foundation war mein erstes kommerzielles Spiel und auch  mein  erstes
 Projekt in Blitz Basic. F&uuml;r meine zuk&uuml;nftigen Projekte werde ich wohl
 C verwenden. Vor Foundation habe ich viele Shareware-Spiele und  auch
 einige  Licenceware-Projekte  geschrieben.  Empfehlen w&uuml;rde ich davon
 sicherlich mein Spiel &quot;Sneech&quot;, wo man sehen  kann,  wie  verschieden
 mein  Geschmack  bei  Spielen  ist. Sneech ist im Aminet (und auf den
 Aminet-CDs - z.B. #19) zu finden.


Wie bist Du auf die  Idee  gekommen,  ein  Spiel  wie  Foundation  zu
schreiben?

 Es begann als ein Experiment in der AGA-Programmierung. Ich bin schon
 immer  ein  gro&szlig;er Fan von &quot;Die Siedler&quot; gewesen. Deshalb bin ich auf
 die Idee  gekommen,  einen  Landschaftsgenerator  zu  schreiben,  der
 &auml;hnliche  Welten erschaffen kann. Das Spiel (Foundation) gab mir sehr
 viel Spielraum, um zu experimentieren und die Amiga-Programmierung zu
 erlernen.


Foundation unterst&uuml;tzt auch Grafik- und Soundkarten (Soundkarten &uuml;ber
AHI). War dies von Anfang an geplant?

 Nein, ich hatte da nicht einmal von getr&auml;umt, Grafikkarten und AHI zu
 unterst&uuml;tzen.  Erst,  als  ich  von  Sadeness eine Grafikkarte bekam,
 erkannte ich, da&szlig; es wichtig ist, sie zu benutzen.


Wie bist Du mit Sadeness zusammengekommen?

 Vor  einem  Jahr  war  ich  von  Ben  Vost  vom  Amiga-Format-Magazin
 eingeladen,  zur WOA zu kommen. Er versprach mir, das Spiel am Amiga-
 Format-Stand zu pr&auml;sentieren. Gl&uuml;cklicherweise hatte  Sadeness  einen
 Stand  direkt neben Amiga Format. Sie interessierten sich genauso f&uuml;r
 das Spiel wie die  Menge  von  Leuten,  die  das  Demo  sahen.  Bevor
 Sadeness  auftauchte,  hatte  ich  schon  acht Angebote  von  anderen
 Firmen, mein Spiel zu vertreiben. Sadeness haben mich aber  mehr  als
 die  anderen  beeindruckt - und sie haben mich mit allem unterst&uuml;tzt,
 was ich brauchte.


Was  sind  die  Haupt-Features   von   Foundation?   Was   sind   die
haupts&auml;chlichen  Unterschiede  zu  anderen  Echtzeit-Strategiespielen
(wie etwa Command &amp; Conquer 2 oder Warcraft 2 auf PC/Mac/PSX)?

 Foundation ist eine Mischung aus Kriegspiel-Elementen und Wirtschaft-
 Simulation.   Mit   Command  &amp;  Conquer  oder  Warcraft  hat  es  die
 Kriegs-Aspekte gemein. &quot;Die Siedler&quot; hatte ein gutes  Gameplay,  aber
 hier  fehlte  die M&ouml;glichkeit, in die K&auml;mpfe einzugreifen. Jeder, der
 Foundation spielen will, braucht gute F&auml;higkeiten in beiden Bereichen
 des Spieles.


Wann wird es erh&auml;ltlich sein? Warum hat es so lange gedauert?

 Das Spiel ist  nun  fertiggestellt  und  wird  so  bald  wie  m&ouml;glich
 ver&ouml;ffentlicht.  Eventuell  wird  es  rechtzeitig  zur  WOA in London
 erh&auml;ltlich sein. Wir haben die Ver&ouml;ffentlichung aber nicht verz&ouml;gert,
 um  in diesen Zeitrahmen zu kommen. Der Grund f&uuml;r die Verz&ouml;gerung ist
 einfach der, da&szlig; man nun mal sehr viel Arbeit und  Zeit  braucht,  um
 ein  solches  Spiel  zusammenzubekommen. Ich bevorzuge es, alleine an
 dem Spiel zu arbeiten - Ihr  k&ouml;nnt  Euch  bestimmt  denken,  da&szlig;  die
 Arbeit  an  dem  Spiel sehr viel meiner Zeit beansprucht hat - und es
 hat l&auml;nger gedauert, als erwartet.


Wird es auf CD-ROM erh&auml;ltlich sein? Wenn ja: Wird  es  auch  wie  ein
CD-ROM-Spiel  aussehen?  -&#062;  mit Video/Animations-Sequenzen, CD-Musik
und so weiter?

 Das Spiel ist nur auf CD-ROM erh&auml;ltlich. Ich bin nicht sehr an Video-
 Sequenzen  interessiert,  aber  es enth&auml;lt ein 800 Bilder umfassendes
 Intro. Es gibt 5 CD-Musik-Tracks auf der CD und mehr als 200 MB Daten
 inklusive   &uuml;ber  100  der  wundervollen  Landschaften,  die  in  der
 Aminet-Demo zu sehen waren.


Ist es m&ouml;glich, da&szlig; Du irgendwann eine Fortsetzung schreibst? Was ist
mit anderen Genres? Hast Du schon Pl&auml;ne f&uuml;r andere Spiele?

 Ich hoffe, mal eine  Fortsetzung  machen  zu  k&ouml;nnen,  aber  erst  in
 fr&uuml;hestens einem Jahr. Mein n&auml;chstes Spiel wird ganz anders sein - in
 jeder Beziehung. Ich plane schon ein gro&szlig;es Spiel als  mein  n&auml;chstes
 Projekt, welches wahrscheinlich TCP/IP- und PowerPC-Unterst&uuml;tzung von
 Anfang an bieten wird. Es wird kein Strategiespiel sein  und  in  der
 Zukunft spielen - mit einiger schneller Action.


Hast Du alle Deine Ideen in Foundation einbauen k&ouml;nnen?

 Nein, ich habe nicht alle meine Ideen eingebaut. Ich werde aber  noch
 weiter   an   dem   Spiel  arbeiten.  Es  werden  neue  Features  und
 Code-Optimierungen dabeisein. Ich hoffe, ich kann einmal im Monat ein
 gro&szlig;es   Update   im   Aminet   und   auf   Cover-CDs  von  Magazinen
 ver&ouml;ffentlichen. Alle monatlichen Updates werden kostenlos sein.


Welche Features konntest Du nicht einbauen?

 Das gr&ouml;&szlig;te Feature, das es nicht  in  die  Verkaufsversion  geschafft
 hat, ist der TCP/IP-Modus. Es h&auml;tte sehr lange gedauert, diesen Modus
 zu testen, und die Gr&ouml;&szlig;e des Spiels h&auml;tte  es  sehr  schwer  gemacht.
 Sobald  das  Spiel  ver&ouml;ffentlicht ist,  bin  ich  in  der  Lage, den
 TCP-Modus mit kleinen Executable-Updates zu testen. Ich  bin  sicher,
 da&szlig;  jeder,  der mit TCP/IP spielen will, auch in der Lage ist, ein 1
 MB gro&szlig;es Archiv aus dem Aminet zu besorgen.


Wie sollte  der  n&auml;chste  Amiga  aussehen  (Konfiguration)?  Wie  die
angek&uuml;ndigte pre/box von Phase 5?

 Ja, die pre/box scheint der ideale Amiga der n&auml;chsten  Generation  zu
 sein,  aber  ich bin kein Hardware-Experte. Ich w&auml;re schon gl&uuml;cklich,
 Spiele  f&uuml;r  PPC-Amigas  mit  Grafikkarten -  wie  der   BVision - zu
 schreiben. Das sollte gen&uuml;gend Leistung bringen, um meinen Anspr&uuml;chen
 gerecht  zu  werden.  Die  Zeiten  und  Dinge  haben  sich  definitiv
 ge&auml;ndert, seit ich dachte, mein C64 reicht mir nicht mehr.


Welche Mannschaft wird dieses Jahr Fu&szlig;ball-Weltmeister?

 Hmmm - letztes Jahr habe ich 3 Monate in Brasilien verbracht, w&auml;hrend
 ich  an  Foundation  arbeitete.  Ich  habe  gro&szlig;en  Respekt  vor  dem
 brasilianischen Fu&szlig;ball und ich sch&auml;tze, da&szlig;  Brasilien  auch  dieses
 Jahr Weltmeister wird.


Ich sch&auml;tze, Du kennst die  &quot;Amiga  aktuell&quot;  nicht  (weil  sie  eben
[fast] nur in Deutsch ist), aber: ein letztes Wort zu unseren Lesern?

 Ich  wei&szlig;,  da&szlig;  einige   Spiele-Hersteller   Updates   und   weitere
 Entwicklungen  von  deren  Spielen versprechen, und da&szlig; dies manchmal
 nicht passiert. Ihr k&ouml;nnt sicher sein, da&szlig; ich  nicht  eher  aufh&ouml;re,
 bis  alle Features in Foundation eingebaut sind, die ich noch im Kopf
 habe. Zus&auml;tzlich werde ich an meinem  neuen  Spiel  arbeiten  -  aber
 etwas  geheimer.  Foundation  habe ich ziemlich fr&uuml;h angek&uuml;ndigt, als
 die Entwicklung gerade erst begonnen hatte. Ich denke,  es  war  gut,
 den  Leuten  zu  zeigen,  was  ich  gerade  entwickelte.  Diese fr&uuml;he
 Ank&uuml;ndigung hat aber sehr  viel  meiner  Zeit  verschlungen, und  sie
 bedeutete,  da&szlig;  ich einem gro&szlig;en Druck ausgesetzt war.  N&auml;chstes Mal
 m&ouml;chte ich es etwas ruhiger angehen  lassen,  bis  ein  realistisches
 Erscheinungsdatum  halbwegs  garantiert  ist. Fr&uuml;he Ank&uuml;ndigungen und
 Verz&ouml;gerungen sind sehr verbreitet auf dem Amiga-Markt. Das ist nicht
 schlecht  f&uuml;r  die  Entwickler,  wir  versuchen  nur  etwas  Hoffnung
 aufrechtzuerhalten,  indem  wir starke  Projekte  schon  am  Horizont
 zeigen  k&ouml;nnen. La&szlig;t uns auf OS3.5, eventuell 4.0 warten - vielleicht
 tut sich ja noch einiges Positives auf dem Amiga-Markt.


Ich bedanke mich recht herzlich f&uuml;r dieses Interview und w&uuml;nsche  Dir
viel Erfolg mit Foundation und (hoffentlich) Deinen n&auml;chsten Spielen!

 No problem!

Cheers,

-- 
Paul Burkey &#060;<a href="mailto:burkey@bigfoot.com">burkey@bigfoot.com</a>&#062;
<a href="http://burkey.home.ml.org">http://burkey.home.ml.org</a>

******************************************************
Diese Interview wurde gef&uuml;hrt von Andreas Etzrodt
(<a href="mailto:the_shark@gmx.de">the_shark@gmx.de</a>), unter Mithilfe von Thomas Szedlak,
Cord Hagen und Carsten Schr&ouml;der.&laquo;
</pre>
</body>
</html>
