<html>
<head>
  <title>Messebericht</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="interviews2.html">PREV</a> | <a href="amiga1.html">NEXT</a>
<hr>
<pre>

Messebericht: World of AMIGA (von Volker Mohr)
----------------------------------------------

Vom 15. bis 17. Mai fand in London eine der wichtigsten AMIGA-Messen 
&uuml;berhaupt statt: die World of AMIGA. Volker Mohr hat sie besucht und AMIGA 
aktuell freundlicherweise folgenden Bericht zur Verf&uuml;gung gestellt:

&raquo;World of Amiga - Kickoff for the future?

Letztes Wochenende waren wir auf einen Kurzurlaub in London. 
Selbstverst&auml;ndlich habe ich die Zeit sinnvoll genutzt und bin bei 
strahlendem Sonnenschein und 25 Grad nach Hammersmith gefahren. Gro&szlig;artige 
Neuigkeiten sind versprochen worden, am Freitag hatte ich keinen 
Internetzugang, um so gespannter war ich, was mich erwartet.

Nachdem ich nun das nicht gerade preiswerte Eintrittsgeld von 7.50 Pfund 
(22,50 DM) gel&ouml;hnt hatte, st&uuml;rmte ich geradewegs auf den Stand von Amiga 
International zu. Auf einem Pult mit Prospekten lagen leider nur Prospekte 
&uuml;ber den A 1200 und ein Einsteigersonderheft des CU-Amiga Magazines. Wie, 
keine Presseerkl&auml;rungen? 
Einmal um den Stand rumgegangen: Das Team des AAA-Award, Haage &amp; Partner, 
Mikronik..., aber kein Mitarbeiter von Amiga! Auch nichts Schriftliches! 
Aber was war das: Auf der anderen Seite war ein Stand von Amiga, Inc. Zwei 
St&auml;nde? Sieht ja gut aus. Dort war auch endlich mal jemand zu sehen: Ein 
umlagerter Darreck Lisle stand Rede und Antwort. Also rein in die 
Menschenmasse und zugeh&ouml;rt. ...PC-Standard-Hardware...kein OS 3.5...OS 4.0 
komplett neu geschrieben aus Wurzeln von Linux, Java und BeOS... das 
erschien mir doch alles zu absurd. Aber was Schriftliches war auch dort 
nicht zu bekommen. Also erst mal weiter.

Die englische Zeitschrift Amiga Format verkaufte dort die j&uuml;ngste Ausgabe 
ihres Heftes mit PPaint 7.0 auf der Cover-CD. Merkw&uuml;rdig, das ist doch gar 
nicht so alt! Einerseits sind beim Amiga Raubkopien erheblich verp&ouml;nter als 
beim PC (zumindest in den letzten Jahren), andererseits verschenken die 
Firmen selbst aktuelle Software. 
Man denke nur an IBrowse 1.2 auf der letzten Aminet-CD-Rom. Aber gut: 
wieder Geld gespart. Direkt nebenan war auch die Konkurrenz CU-Amiga: 
Kreditkarte sei Dank habe ich ein Abo abgeschlossen und so fast die H&auml;lfte 
vom regul&auml;ren Verkaufspreis gespart. Abgesehen von den Problemen, diese 
Zeitung hierzulande &uuml;berhaupt zu bekommen. 

Weiter ging's zur Verleihung des AAA-Award. Ein freudestrahlender Petro 
verlieh den Preis an Holger Kruse (Platz 1) f&uuml;r sein &quot;Miami&quot;. Ohne diese 
genial einfache Internetsoftware h&auml;tte der Amiga sicher schon viele treue 
User verloren. Pl&auml;tze zwei und drei gingen an Urban M&uuml;ller (f&uuml;r seine 
Erfindung &quot;Aminet&quot;) und Phase 5. 
W&auml;hrend Urban M&uuml;ller entschuldigt fehlte, hielt es bei Phase 5 wohl keiner 
f&uuml;r n&ouml;tig, den Preis in Empfang zu nehmen. Merkw&uuml;rdig, die waren doch da?! 
Wie gesagt: Zu dieser Zeit waren mir die vollen Neuigkeiten noch nicht 
bekannt. 

Weiter ging's. Bei den Hardwarepreisen fiel eines sofort auf: Wenn ich mich 
dort mit mitgebrachter Hardware aus Deutschland hingestellt h&auml;tte, h&auml;tte 
ich mich nicht nur dumm, sondern auch noch d&auml;mlich verdient! Z.B.: 16 MB 
PS/2-Ram f&uuml;r 39 Pfund (137,-- DM). Auch bei Festplatten h&auml;tte die 
Beschriftung in DM sein k&ouml;nnen, aber nein, es waren Pfund! Die meisten 
anderen Sachen waren zwischen 10 und 20 % teurer als hierzulande. Daf&uuml;r 
konnte man bei der Software Schn&auml;ppchen machen: 
Fusion 3.1 f&uuml;r 25 Pfund (75 DM), SiSys 2.1 f&uuml;r 20 Pfund, Sonderpreise f&uuml;r 
Wordworth 7.0 (ja, endlich!). Au&szlig;erdem gab es Quake, ganz offen auf den 
Tischen, und auch Kindern zug&auml;nglich, ebenso wie Doom. Haage &amp; Partner 
stellte das neue Easy Writer vor. Die meisten Neuigkeiten sind einem 
erfahrungsgem&auml;&szlig; sowieso nicht aufgefallen, genauere Infos wird man wohl 
erst sp&auml;ter in irgendwelchen Testberichten finden. 
Auf der Hardwareseite gab es nicht viel Neues: Der A 5000 war, wie 
erwartet, noch nicht fertig, ebensowenig der Boxer. Von Index wird zur Zeit 
ein Amiga als PCI-Steckkarte f&uuml;r PCs und Macs entwickelt. Diese Idee hat ja 
durch die Neuigkeiten von AI eine ganz neue Perspektive bekommen. Best&uuml;ckt 
werden soll die Karte mit Prozessoren ab dem 68040 bis hin zum 68060/66. 
Sie soll leistungsm&auml;&szlig;ig an die PPC-Karten herankommen, da alle niederen 
T&auml;tigkeiten wie Maus/Tastaturabfrage durch den x86er erf&uuml;llt werden, ebenso 
wie rechenintensive Arbeiten an den x86er abgegeben werden k&ouml;nnen. Als 
Software kommt neben Amiga OS 3.1/Win95 oder NT das SiSys (der Siamese-
Nachfolger) zum Einsatz, oder m&ouml;glicherweise das Amiga OS 4.0 (auch das 
habe ich erst nach der Messe erfahren).

Die franz&ouml;sische Firma At&eacute;o Concepts zeigte die neue Grafikkarte Pixel 64. 
Diese Karte ist speziell f&uuml;r den Amiga 1200, ben&ouml;tigt einen Towerumbau aber 
kein Zorro-Board! Statt dessen wird der selbsterfundene At&eacute;o-Bus verwendet. 
Ausgeliefert wird die Karte mit der Picasso96-Software, ist aber auch 
CybergraphX-kompatibel. 
Abschreckend nur der hohe Preis von &uuml;ber 700,-- DM, der meines Erachtens in 
keinem Verh&auml;ltnis zur Leistung steht. Genauere Infos gibt es auf der 
Homepage des Herstellers: <a href="http://www.ateo-concepts.com.">http://www.ateo-concepts.com.</a>

Auf dem R&uuml;ckweg nochmal zu Amiga, Inc. Leider immer noch kein Fortschritt: 
noch immer keine Presseerkl&auml;rung und noch immer kein 'rankommen an Darreck. 
Da er aber noch lebt, k&ouml;nnen seine Ank&uuml;ndigungen wohl nicht so schlimm 
sein. Dachte ich. Zum Gl&uuml;ck konnte ich die Nachrichten erst zu Hause im 
Internet lesen und erst mal genau dar&uuml;ber nachdenken. Ansonsten h&auml;tte ich 
bei der Vorstellung, da&szlig; es Amigas mit Intel-Chips geben wird, 
wahrscheinlich jemanden erschlagen. 

Die WoA ist weniger als halb so gro&szlig; wie die Messe in K&ouml;ln, daf&uuml;r aber 
doppelt so teuer. Die Infos hielten sich in Grenzen, n&auml;chstes Jahr werde 
ich das Geld wohl sparen. Sp&auml;ter in der City of London gab es dann wieder 
positive Erlebnisse: In den Plattenl&auml;den von Virgin-Records stehen deutlich 
sichtbar Amiga 4000, und zwar zur Pr&auml;sentation von neuen Titeln, Preisen, 
etc. Sah mir sehr nach Scala aus. 
Au&szlig;erdem setzt sich in England immer mehr das Lager-Bier durch: Endlich 
bekommt man auch in England k&uuml;hles Bier mit Schaum! (Welches obendrein noch 
schmeckt.)

Volker Mohr&laquo;
</pre>
</body>
</html>
