<html>
<head>
  <title>PowerUp-to-date</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="amiga3.html">PREV</a> | <a href="powerup-to-date2.html">NEXT</a>
<hr>
<pre>

PowerUp-to-date
---------------

1. Phase 5 digital products und Haage&amp;Partner bilden PowerPC-Allianz

Die zu Ungunsten der PowerPC-Reihe ausgefallenen Richtungsentscheidungen
von AMIGA, Inc. haben die Verantwortlichen bei Phase 5 digital products und
Haage &amp; Partner offenbar endlich zur Vernunft kommen lassen. Die beiden 
Unternehmen haben angek&uuml;ndigt, nach monatelangem Streit &uuml;ber die
&quot;richtige&quot; PowerPC-Betriebssoftware ab sofort zusammenzuarbeiten.
Angek&uuml;ndigt wird f&uuml;r Ende dieses Jahres ein PowerPC-basierender Rechner,
auf dem heutige und zuk&uuml;nftige Versionen des AMIGA OS lauff&auml;hig sein
sollen.

Es folgt die offizielle Bekanntmachung:

&raquo;In einer gemeinsamen Erkl&auml;rung nach der letzten &quot;World-of-Amiga&quot;-Show in
London und als Reaktion auf Pl&auml;ne, die von Amiga, Inc. ver&ouml;ffentlicht
wurden, haben Haage&amp;Partner und phase 5 digital products ihre volle
und andauernde Unterst&uuml;tzung f&uuml;r die PowerPC-Einbindung eindringlich
best&auml;tigt.

Mit gemeinsamen Anstrengungen wollen beide Hersteller auch weiterhin die
Entwickler und Anwender der PowerPC-Technologie unterst&uuml;tzen und eine
schnell wachsende Zahl von &uuml;berzeugenden und leistungsf&auml;higen Anwendungen
bereitstellen. Mit vielen tausend PowerUP-Boards, die bisher ausgeliefert
wurden, einer Zahl von installierten Systemen, die schnell w&auml;chst, stellen
die PowerPC-Boards bereits einen attraktiven Markt f&uuml;r alle Entwickler dar.
Diese Tatsache wird unterstrichen durch viele in Arbeit befindliche 
PowerUP-Versionen wichtiger Amiga-Software-Pakete und die steigende 
Unterst&uuml;tzung von Software-Verk&auml;ufern, die w&auml;hrend der WoA selbst nach der 
Ank&uuml;ndigung von Amiga, Inc. vereinbart wurde.

Haage&amp;Partner und phase 5 digital products betonen, da&szlig; die Konkurrenz
der unterschiedlichen Wege zur PowerPC-Einbindung ebenso wie der 
&ouml;ffentliche Streit dar&uuml;ber eine Sache der Vergangenheit ist. &quot;Wir wollen 
versichern, da&szlig; f&uuml;r die Anwender des PowerPC-Systems die Integration ihrer 
PowerPC-Software vollkommen transparent erfolgt und da&szlig; sie bald eine 
reichhaltige Auswahl der leistungsf&auml;higsten Anwendungen zu sehen bekommen 
werden&quot;, sagen die Vertreter beider Gesellschaften.

Die weitere Entwicklung der PowerUP-System-Software soll in enger 
Zusammenarbeit beider Gesellschaften erfolgen. Au&szlig;erdem wird die 
Kooperation bei der Entwicklung m&auml;chtiger PowerPC-basierender System-
Libraries und anderer OS-Erweiterungen diskutiert.

Bei Treffen der Gesch&auml;ftsleitungen von Haage&amp;Partner und phase 5 digital
products mit Amiga, Inc. schon w&auml;hrend der WoA-Show in London wurde
vereinbart, da&szlig; ein neuer Vorschlag an Amiga, Inc. &uuml;bergeben wird, der
einen alternativen Zugang zum von Amiga, Inc. geplanten &quot;Amiga Bridge&quot;-
System beschreibt.

Diese Alternative ist ein neues auf PowerUP basierendes System, welches
die geplante Amiga-OS-Verbesserung enth&auml;lt und schon bis zum Ende des 
Jahres im Einzelhandel erscheinen k&ouml;nnte. &Uuml;ber die Verwendung von 
Komponenten und Schnittstellen des Industriestandards hinaus kann ein 
derartiges System weitere M&ouml;glichkeiten f&uuml;r kreative Entwicklungen und 
Erweiterungen im Geiste des Amiga bieten und ebenso mit den derzeitigen wie 
auch mit k&uuml;nftigen Versionen des AmigaOS betrieben werden.

Dieses auf dem PowerPC beruhende System sorgt f&uuml;r Stetigkeit und Innovation
f&uuml;r alle Anwender und Entwickler und erm&ouml;glicht es der Amiga-Gemeinde, an
solchen gro&szlig;artigen Entwicklungen teilzunehmen, wie sie z.B. Motorolas neue
AltiVec-Technologie, eine Erweiterung f&uuml;r den G4-PowerPC-Prozessor mit
atemberaubender Leistungssteigerung, schon fr&uuml;h im n&auml;chsten Jahr bieten
wird. Mit Zustimmung und Unterst&uuml;tzung von Amiga, Inc. kann diese
Technologie die langerwartete Wiederbelebung der Amiga-Plattform schon in
diesem Jahr bringen und schnell f&uuml;r einen wachsenden Markt leistungsf&auml;higer
Systeme sorgen, die der Anwender kaufen und f&uuml;r die die Entwickler
Programme und Zubeh&ouml;rteile herstellen und vertreiben k&ouml;nnen.

Haage&amp;Partner und phase 5 digital products ermutigen auch alle Amiga-
Entwickler, die sich heute an den vorhandenen Innovationen beteiligen
wollen, die ein Teil des Amiga-Marktes sind, der von jetzt an und w&auml;hrend
der n&auml;chsten Jahre wachsende Tendenz, Kontinuit&auml;t und Innovation zeigen
wird, sich klar f&uuml;r die Unterst&uuml;tzung des PowerPC als Herz der n&auml;chsten 
Generation von Amiga-Systemen auszusprechen und zu bekennen.


Weitere Informationen finden Sie bei:

<a href="http://www.haage-partner.com">http://www.haage-partner.com</a>
<a href="http://www.phase5.de«">http://www.phase5.de«</a>


Bereits einen Tag zuvor hatte Haage &amp; Partner auf seiner Homepage folgendes 
ver&ouml;ffentlicht:

&raquo;phase 5 und H&amp;P wollen PPC weiter unterst&uuml;tzen

Dies ist nur ein kurze Mitteilung, der Rest folgt so schnell wie m&ouml;glich: 
phase 5 und H&amp;P sind schon seit vergangenem Samstag in Gespr&auml;chen &uuml;ber eine
gemeinsame Unterst&uuml;tzung des PPC. Zusammen mit Index (UK) und anderen 
Herstellern will man zudem ein Strategiepapier an Amiga Inc weiterreichen 
um die Entwicklung f&uuml;r die bestehenden Amigas und Weiterentwicklung des
bestehenden AmigaOS zu gew&auml;hrleisten. Jeff Schindler hat bereits sein 
gro&szlig;es Interesse daran bekundet.&laquo;
</pre>
</body>
</html>
