
<HTML>

<HEAD>
<TITLE>Barra</TITLE>
<META NAME="webmaster" CONTENT="lanzidei@tin.it">
</HEAD>

<BODY BACKGROUND="" BGCOLOR="#000000" TEXT="#ffffff" LINK="#ff8000" VLINK="#ffaa55" ALINK="#ff8000">

<center>
<img src="img/articoli.jpg" hspace=0 WIDTH=171 height=30 border=0><br><br>
<font face="comic sans ms" size=2><b>
UNA RISATA CI SEPPELLIRA'<br>
di <i>Giovanni Bergamini</i></b>
<br><br>

<table width="90%"><td><font face="comic sans ms" size=2>
<p align="justify"><b><br>
1. vivo e palpitante</b>

<br><BR>Una risata Ci seppellir&agrave;....
<BR>Niente di pi&ugrave; probabile, dopo aver sentito il suono dell’acronimo
che si forma: Bouws (baus).
<BR>Ma, che lo si voglia o no, che si sia piccoli o grandi, avanti negli
anni o ancora acerbi, noi siamo Bouws.
<BR>Bouws significa pretendere il dovuto riconoscimento al sommerso fermento
di scrittori (noi) che contribuiscono a rendere pi&ugrave; vivo e palpitante
il vivere quotidiano.

<BR><BR>Bouws dovrebbe stare per Bottom/up Writers and Poets, cio&egrave; scrittori
che sorgono dal basso e portano verso l’alto idee, pulsioni e valori, che
nessuno degli autori consolidati &egrave; in grado di assorbire ed esprimere compiutamente.
<BR>Le risate che si fanno i professionisti perch&eacute; noi scrittori
difficilmente riusciamo a comporre delle opere complete, finite ed adatte
alla lettura di un pubblico non specializzato, gli si strozzeranno in gola,
nel sapere che non &egrave; vero che queste opere rimangono trascurate
nel segreto delle private scrivanie o negli archivi storici delle case
editrici.

<BR><BR>Infatti guardate quanti intellettuali hanno rinunciato ad un proprio
pensiero interno ed invece si affidino, nell’elaborare le proprie opinioni,
agli umori della gente, ai fax, o alle suggestioni di testi o di allegorie
trovate per caso.

<BR><BR>I manoscritti che arrivano alle redazioni editoriali, ai critici, alle
riviste, alle agenzie letterarie, dovrebbero essere un problema del
<BR>personale di pulizia: invece diventano un problema degli intellettuali,
che si lamentano di dover leggere una tale mole di carta. Ma perch&eacute;
la leggono, se non vale nulla?

<BR><BR>Per farsi un’idea della vita attraverso il lavoro dei Bouws.
<BR>&nbsp;
<BR><b>
2. n&eacute; col mercato, n&eacute; con la gloria</b>


<BR><BR>E’ vero: nulla &egrave; pi&ugrave; lontano da noi Bouws dell’idea di
produrre un lavoro finito per la massa dei compratori. Non si scrive n&eacute;
per il mercato, n&eacute; per la gloria. Per&ograve; un po’ di riconoscimento
lo gradiremmo.

<BR><BR>Abbiamo un patrimonio vasto e profondo di interpretazione del mondo
e di conoscenza della nuova vita che si affaccia.
<BR>Dobbiamo solo trovare il giusto palcoscenico nel quale far muovere
i nostri fantasmi, senza che una tata zelante e arida ci dica che sbagliamo
i congiuntivi e che i nostri fantasmi sono un po’ sbilenchi.

<BR><BR>Ci sono persone che possono esprime il proprio vasto patrimonio con
un saggio, soprattutto se sono interni in qualche istituto universitario:
<BR>Internet brulica di saggi in lingua inglese, costruiti in perfetto
stile scientifico, ma che sostengono tesi - o suggeriscono norme di comportamento
- che appartengono alla religione, all’etica, alla trasgressione.

<BR><BR>La maggior parte di noi non lo pu&ograve; fare.

<BR><BR>Invece ci troviamo molto pi&ugrave; a nostro agio con la poesia o con
il racconto breve. L&igrave; fissiamo schegge di emozioni od esperienze;
l&igrave; elaboriamo metafore della nostra interpretazione del mondo.
<BR>&nbsp;<BR>

<b>3. il pubblico di lontano</b>


<BR><BR>Un Bouw deve scrivere, ha bisogno di scrivere e di mandare in giro il
proprio prodotto.

<BR><BR>Dopo l’arrivo dell’idea creativa e l’eruzione in metafora della pulsione
morale che doveva essere espressa, non c’&egrave; pi&ugrave; tempo per
rifinire il lavoro affinch&eacute; sia perfetto.
<BR>In un mondo senza valori, un racconto che palpita di metafore di valori,
ancora timidi e nascosti, &egrave; sicuramente prezioso. Perch&eacute;
&egrave; proprio quello che non possono fare coloro che hanno passato anni
a distillare le strategie narrative di Hugo, la delicata sintassi di Proust,
le tensioni di sentimenti opposti di Kundera.

<BR><BR>Per contro, quello che noi Bouws non possiamo fare &egrave; ottenere
l’attenzione dello stesso pubblico che ama Hugo, Proust e Kundera.
<BR>Non &egrave; una questione di qualit&agrave;...
<BR>Si tratta di ruoli...

<BR><BR>Chi arriva al pubblico, non vi arriva per la sua qualit&agrave;, ma
per un insieme di circostanze, per lo pi&ugrave; fortuite ed irripetibili.
(Arbore direbbe: per la loro tigna)

<BR><BR>Noi siamo Bouws per passione, per vocazione, per amore, per intransigenza,
per consapevolezza. Tutte cose che non aiutano a portare al pubblico un
prodotto finito e ... diciamo ... diplomatico.
<BR>&nbsp;
<BR>

<b>4. e adesso, dove sono finiti tutti?</b>


<BR><BR>La chiave sta proprio nell'interpretazione del mondo: dato l’alto contenuto
comunicativo del racconto, che &egrave; metafora, il racconto va indirizzato
subito a qualcuno, molto prima di aver il tempo di rifinirlo finch&eacute;
sia tanto bello da incantare.
<BR>Questo richiede un palcoscenico apposito dentro il quale pu&ograve;
andare a guardare un pubblico speciale, particolarmente interessato e particolarmente
motivato, con libert&agrave; e con possibilit&agrave; di apprezzare.

<BR><BR>Qui, per&ograve;, noi Bouws sentiamo che manca qualcosa. Dei palcoscenici
che possano accogliere la nostra produzione ce ne sono. Modi di mostrare
le nostre abilit&agrave; esistono. Esistono anche alcuni intellettuali
disposti a riconoscerci alcune buone redisposizioni, tuttavia sentiamo
che manca il pubblico.

<BR><BR>Non intendiamo un pubblico vasto, intendiamo un pubblico, dotato di
capacit&agrave; di reazione e di amore.
<BR>Pu&ograve; essere che quello che manca sia l'intervento di un medium.
<BR>Cio&egrave; di professionisti che prendano dal palcoscenico le ombre
e le preparino per il pubblico.
<BR>Mantenendo vive due cose: la prima &egrave; il nocciolo comunicativo
che &egrave; diventato sentimento vivo sul palcoscenico; secondo la personalit&agrave;
dell’autore, che deve mantenere la paternit&agrave;, mentre il medium avr&agrave;
la sua gloria di pubblico, ma non la dignit&agrave; della genesi.
<BR>&nbsp;
<BR>

<b>5. in mezzo alla gente, dove c’&egrave; passaggio</b>


<BR><BR>Il primo lettore di uno scrittore &egrave; s&eacute; stesso.

<BR><BR>Una volta legge con indulgenza, dandosi gioia; una volta con eccessiva
severit&agrave;, procurandosi una crisi depressiva; infine sar&agrave;
giustamente insoddisfatto da spingersi ad avere altri lampi creativi.

<BR><BR>Il primo lettore di un Bouw sono gli altri Bouws.

<BR><BR>Uno legge con indulgenza; uno con severit&agrave;; tanto da produrre
all’autore la giusta soddisfazione di aver scritto per l’insieme dei Bouws,
cos&igrave; da attirare altri a scrivere.

<BR><BR>Non come ad un congresso di universitari dove tutti applaudono tutti
e si sputtanano nei corridoi.
<BR>Non come nelle serate parrocchiali dove tutti applaudono tutti, tanto
ci vogliamo tutti bene.

<BR><BR>Ma attenzione: qui non si tratta di un circolo di golosoni o di una
associazione di cuori solitari.
<BR>Qui si tratta di bottom/up writers and poets. La soddisfazione e la
popolosit&agrave; del gruppo di Bouws &egrave; misura dell’autorevolezza
del medesimo.

<BR><BR>Come farsi prendere sul serio? questo &egrave; il quesito.
<BR>Tramite un movimento che prima di tutto sta in piedi da solo.
<BR>Io lo so che il poeta ha una capacit&agrave; di anticipazione che va
fuori dell’ordinario sentire; e lo sa anche Cotroneo. Ma non si d&agrave;
ancora il caso che un critico famoso, prenda sul serio le opere di sconosciuti
e le prenda per quello che sono e non per quello che vale - a peso di pubblico
o a peso di critica - la loro scrittura.

<BR><BR>Se non nasce un movimento che d&agrave; peso a questo aspetto e che
&egrave; disposto a difendere gli scrittori in base al presupposto di conoscenza
e di comunicazione, nessuno ci prender&agrave; per quello che siamo.

<BR><BR>Tutti continueranno a dire: non &egrave; adatto alla nostra linea editoriale;
non &egrave; maturo per la pubblicazione; devi andare a scuola di scrittura
creativa; devi pagarmi perch&eacute; io ti posso fare delle critiche che
migliorano il tuo scritto; scrivi &eacute; invece di &egrave; e non si
capisce perch&eacute;.
<BR>Ma , come ha detto Anselmi, la letteratura, nonostante si affermi e
si voglia imporre il contrario, ha anche una funzione conoscitiva. E chi
meglio dei Bouws pu&ograve; affermare, rendere evidente ed utile la funzione
conoscitiva della letteratura?

<BR><BR>Ma i Bouws non vivono nei salotti, ma in mezzo alla gente, dove c’&egrave;
passaggio.
</td></table>
</BODY>

</HTML>
