<HTML>
<HEAD>
<TITLE>APC & TCP</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">
<FONT SIZE=4 COLOR="#888888">
<CENTER>
</CENTER>
<font color="ff00ff">
<P><hr><p><H1> <center>Ricky-W's  Seite </center></h1></p>
<p><hr><p><font color="000000"><br>
<ul>
<li>Vorwort 
<li> Interpret (Deutsch / Italienisch)  
<li>My Game  
<li> Problemchen  
<li>OK
</ul><HR><br>
<Font color ="#ff0000">VORWORT<p><font color="#000000">
Es gibt nicht viel, f&#252;r meiner neuen Seite zu sagen, au&#223;er seht sie euch 
einfach mal 
an. Besonders meine Problemecke, da ich f&#252;r jede Hilfe dankbar bin, weil ich 
besonders viele davon habe. Zum Interpret mu&#223; ich leider mitteilen, 
da&#223; er diesmal entf&#228;llt, da ich mit der Gestaltung einige Probleme habe 
und ich denke wir sind der NoVover es schuldig, ihm ein sch&#246;nes  Outfit zu 
verpassen.<br>
Also viel Spa&#223;!<p><hr><br>
<Font color ="#ff0000">INTERPRET<p><font color="#000000">
<p>
Entf&#228;llt da ich, wie bereits geschrieben habe, Probleme mit Html habe.
z.B.  Wie bekomme ich Leerzeichen zwischen 2 W&#246;rter, ich meine es so:
<br>1.Wort                        2.Wort &quot; So klappt es leider nicht &quot;
<br>1Wort.........................3.Wort &quot; Die Punkte sollten aber nicht sein &quot;  
<br> Und mit soetwas will ich nicht kommen<BR>
<Table Border>
< font color="#ff00ff">
Ricky-W
<tr>
 <td> .......Italienisch........
<td> ..........Aussprache......
<TD> ..........Deutsch.......... 
<TD> ...........Sinn................ 
</TR><font color ="#000000">        
<TD>PORCA Puttana
<TD>  porka puttana  
<TD>      Sau Nute     
<TD>      Himmelfix    
</TR>
<TD>PORCA  VACCA
<TD>  porka waka  
<TD>      Sau Kuh     
<TD>      Himmelfix    
<TR>
</table border>
 
<br><hr>
<Font color ="#ff0000">MY GAME<p><font color="#000000">
Da ich nun in Blitz Basic beginne und ein Spiel seit l&#228;ngerem mit mir trage
( Das ich bereits an mehrere Personen dieses Club vortrug, aber leider keine 
Mitarbeit bekomme, ich bin dar&#252;ber auch nicht b&#246;se ), beschliesse ich 
die Fortschritte des Spieles regelm&#228;&#223;ig hier mitzuteilen, so das es 
f&#252;r mich ein Ansporn ist weiter zu machen, falls Probleme auftauchen. Ich 
k&#246;nnte hier bez&#252;glich auch Eure Hilfe brauchen, wie z.B.<br> 
 Ich br&#228;uchte eine Person die in der Lage w&#228;re, von einer Musikkassette 
Lieder auf einer oder mehreren Diketten in  &quot; .med &quot; Format zu 
konvertieren.<BR>
Versandspesen und Unkosten w&#252;rde ich &#252;bernehmen. Nun ein 
Screenshot vom Spiel :<p>
<img src="titelbild.jpg" width= 640 height=256><p>
Das Spiel hat den Namen &quot;Specker&shy;Play&quot; und ist eine Art
Wirtschaftssimulation alla Willi Lemkes Fussballmanager, nur mit einem
aussergw&ouml;hnlichen Spiel .<P>
<hr><br>

<Font color ="#ff0000">PROBLEMCHEN<p><font color="#000000">
<BR>Deluxe Paint:<BR>
Ich lade ein Bild und wechsle nun mit J auf die andere Seite und lade ein anderes 
Bild gibt es keine Probleme, aber dr&#252;cke ich wieder J und wechsle so auf die 
<BR>1. Seite so sieht das Bild entsetzlich aus, denn die Farben wurden vom zuletzt
geladenen Bild &#252;bernommen, wie kann ich das verhindern. Da ich oft zwei
Bilder verbinden m&#246;chte, die aber eine ander Farbpalette besitzen, wie kann 
ich sie auf die gleiche Farbpalette vereinen ? 
<P>PPt:<BR>
In der Amiga Plus  9/98 war die Vollversion von  PPT und im Artikel stand das es 
viele Bildformate erkennt, darunter auch gif87/89, aber ich habe es beim Speichern
nicht gefunden. Der Grund : Gif Bilder wirken sch&#246;ner als Jpeg in der NoCover
 ( darum soll der Comic K&#252;nstler mal es in diesen Format versuchen ) .Im 
Ultra-Conv. ist leider auch kein Gif-Format vorhanden. Was k&#246;nnt ich da tun 
um meine Bilder in Gif-Format zu convertieren ? <P><hr><br>
<Font color ="#ff0000">OK<p><font color="#000000">
Deutsches Blitz Basic Handbuch, ist bereits seit 17 Tage unterwegs, leider noch 
nicht angekommen, aber es ist immer noch das Fenster mit dem EXEC was mich 
nervt &quot; nicht nur die Post &quot; .
<hr><br><P>Mit Dank Euer<BR>
<center>Ricky-W</center>



</P>
<HR>
<CENTER>
<A HREF="NoCover.html"><IMG BORDER=0 SRC="l_hauptinhalt.jpg" width=639
height=99></A>
</CENTER>
</P>
</BODY>
</HTML>
