<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Das AMIGA-aktuell-Gewinnspiel</H1>
<H2>1. Ergebnisse des letzten Gewinnspiels</H2>
<P>
Am letzten Gewinnspiel haben sich 53 Leser beteiligt, dies ist eine etwas
geringere Zahl als einen Monat zuvor.
</P>
<P>
Bitte denkt auch diesmal wieder an die Teilnahme!
</P>
<P>
Jetzt aber zur Aufl&ouml;sung:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Standard-Frage:&nbsp;</TD><TD VALIGN="TOP">Im September wurde die Einstellung einer bekannten&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">deutschen Amiga-Zeitschrift bekannt gegeben. Wie lautet(e)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ihr Name?&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Antwort: In Frage kam nat&uuml;rlich nur die Amiga Special.
</P>
<P>
Master-Frage: Was ist MP3?
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort:&nbsp;</TD><TD VALIGN="TOP">Es handelt sich um ein datenreduzierendes Audio-&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Kompressionsformat, das insbesondere im Internet Verwendung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">findet.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Meinungsfrage: Wie beurteilst du die Zukunft des Amiga?
</P>
<P>
Die Auswertung:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Antwort&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Anzahl der Nennungen&nbsp;</TD></TR>
<TR><TD COLSPAN="2"><HR></TD></TR>
<TR><TD VALIGN="TOP">1 (Sehr positiv)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">0&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 (Eher positiv)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">6&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">3 (Eher negativ)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">30&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">4 (Sehr negativ)&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">15&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Zwei Leser konnten sich nicht zwischen den Antworten 2 und 3 entscheiden.
</P>
<P>
Einige Einsender haben zu ihrer Beantwortung der Meinungsfrage Stellung
genommen:
</P>
<P>
Andreas Volkmann ist skeptisch: &raquo;Bedingt dadurch, dass von Seiten AI nun
bekannt gegeben wurde, dass definitiv keine Hardware mehr entwickelt wird,
wird es wahrscheinlich - wenn nicht innerhalb k&uuml;rzester Zeit von jemandem
bekannt gegeben wird, dass ein neuer Rechner per Lizenz gebaut oder als
kompatibler zum Verkauf kommt - so aussehen, dass sich s&auml;mtliche Firmen aus
dem Soft- und Hardwarebereich zur&uuml;ckziehen.
</P>
<P>
Die Hardware auf dem Markt wird auch immer geringer (Ausf&auml;lle durch
Defekte), auch wenn die letzten verbliebenen User sich noch gut um ihre
Rechner k&uuml;mmern.&laquo;
</P>
<P>
Michael Schulz schreibt: &raquo;Es wird keinen neuen Amiga geben. Und wie lange
halten die alten Rechner auch mit G4 und Co. (bei uns im Club h&auml;ufen sich
Kontaktprobleme und Altersschw&auml;chen)?&laquo;
</P>
<P>
Wolf Zimmer begr&uuml;ndet seine Antwort 'sehr negativ' wie folgt: &raquo;Finde ich
schade, ist aber leider realistisch.&laquo;
</P>
<P>
Hans-Peter Dusel hat durchaus Hoffnung: &raquo;Ich sehe die Zukunft des Amiga,
trotz der vergangenen Kapriolen von Gateway eher positiv, denn nun liegen
die Karten (endlich) auf dem Tisch. Das ist IMHO auch ein deutlicher
Indikator f&uuml;r Firmen, die sich lange zur&uuml;ckgehalten haben, um abwartend auf
den vermeindlichen MCC-Amiga zu warten. Nun, da die Sache klar ist, wird es
sicher die einen geben, die resignieren und sich endg&uuml;ltig zur&uuml;ckziehen.
Auf der anderen Seite bilden sich nun meines Gef&uuml;hls nach Allianzen, um die
Technologie des Amiga weiterzuentwickeln. Ich nenne nur das Vorhaben
&quot;Amirage&quot;, dessen Spezifikationen sich doch sehr interessant anh&ouml;ren.&laquo;
</P>
<P>
Axel Teichmann formuliert seine Meinung in einem Satz: &raquo;Schlimmer kann es
nicht mehr kommen.&laquo;
</P>
<P>
Thomas Windecker nannte Antwort 3 (eher negativ), f&uuml;gte jedoch einen
interessanten Aspekt hinzu: &raquo;Allerdings denke ich, niemand hat solange mit
den Hoffnungen gelebt und durchgehalten, um jetzt noch zum PC oder MAC
abzuspringen. Die Leute, die unser System im Stich lassen w&uuml;rden, sind
schon (fast) alle zu anderen Systemen &uuml;bergelaufen. Die Anzahl der User
wird gleich bleiben - leider. Denn der momentane Amiga Markt ist relativ
winzig.
</P>
<P>
Es wird wohl so bleiben, dass wir in unregelm&auml;&szlig;igen Abst&auml;nden mit neuen
Erweiterungskarten &quot;versorgt&quot; werden und der Amiga so wenigstens ein wenig
aktualisiert wird. Ich f&uuml;r meinen Teil werde nach dieser Entt&auml;uschung
seitens der Firma AMIGA auf jeden Fall einen neuen Amiga kaufen. Ein MCC
wird's dann eben nicht, aber besonders die Exorzist-L&ouml;sung ist f&uuml;r alle
68k-Anwender Anreiz genug umzusteigen. Wenn sich nicht bald ein Hersteller
f&uuml;r einen MCC findet, wandert das Geld in einen nicht so hochentwichkelten
PPC-Amiga mit GraKa - auch wenn's teuer wird. Amiga - jetzt erst recht!&laquo;
</P>
<P>
Oliver Tacke meint, noch einen kleinen Hoffnungsschimmer zu sehen: &raquo;Ich war
bis jetzt ja immer optimistisch und habe immer an eine Zukunft geglaubt,
aber seit Tom Schmidts letztem Executive Update f&uuml;rchte ich tats&auml;chlich das
endg&uuml;ltige Ende. Das einzige, was mir noch ein bi&szlig;chen Hoffnung l&auml;&szlig;t, sind
zum einen die Phoenix-Pl&auml;ne, die Ger&uuml;chte, da&szlig; Gateway Amiga verkaufen will
und vor allem Petro Tyschtschenko, der wohl nie aufgeben wird.&laquo;
</P>
<P>
Martin A. Endrikat resigniert: &raquo;Ende der Fahnenstange, war 'ne sch&ouml;ne Zeit,
und tsch&uuml;&szlig;...&laquo;
</P>
<P>
Felix M&uuml;ller meint: &raquo;Tom Schmidt zielt mit seinen Pl&auml;nen auf den breiten
Markt der Spielekonsolen und der EDV-Unkundigen, die das Internet anwenden
wollen, ohne einen universell nutzbaren Rechner bedienen zu m&uuml;ssen.
Mit der Amiga Community hat das nichts mehr zu tun. Jim Collas hat sie
ernst genommen, die neue Spitze tut es nicht. Deshalb ist er bei Amiga wohl
auch rausgeflogen.
</P>
<P>
Wir werden bei den klassischen Amiga-Modellen bleiben und k&ouml;nnen nur mit
Hilfe von Erweiterungskarten (Phase5 o.&auml;.) erreichen, da&szlig; wir hardwarem&auml;&szlig;ig
nicht den Anschlu&szlig; verpassen.&laquo;
</P>
<P>
Stefan Pils hofft auf das AmigaOS 3.5: &raquo;Auch wenn ich gerne 2. (eher
positiv) genommen h&auml;tte, muss man aufgrund der Ereignisse der letzten Zeit
realistischerweise zu 3 greifen. Es bleibt abzuwarten, ob p5, H&amp;P, etc. den
Ruck schaffen, die am Amiga Verbliebenen noch durch Software und Hardware
zu &uuml;berzeugen. Hauptpunkt hierf&uuml;r wird wohl OS 3.5 sein, und wie gut die
PPC-Karten unterst&uuml;tzt bzw. eingebunden werden.&laquo;
</P>
<H3>Fazit:</H3>
<P>
Die Ereignisse der letzten Monate haben sich erwartungsgem&auml;&szlig; negativ auf
die Stimmung der Amiga-Anwender ausgewirkt. Immerhin einige Teilnehmer
k&ouml;nnen der Lage noch etwas Positives abgewinnen.
</P>
<P>
Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">1 x Schnittstellenkarte &quot;Hypercom 1&quot;: Wolfgang Schrader&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;CDCat&quot;: Oliver Hummel&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;ManiacBall&quot;: Marco Schmidt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Vollversion von &quot;Envoy&quot;: Axel Teichmann&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">1 x Aminet-CD 19 mit zwei Vollversionen: Michael Seibt&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Herzlichen Gl&uuml;ckwunsch!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
