<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Messebericht</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Messebericht2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Messebericht.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Messebericht4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Messebericht
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. N&auml;here Informationen zu einigen Ausstellern</H2>
<P>
&raquo;AMIGA ist dabei!
</P>
<P>
Zahlreiche Highlights begleiten den diesj&auml;hrigen Messeauftritt von AMIGA
International. Das AMIGA-Museum pr&auml;sentiert vom ersten Modell alles bis hin
zur neuesten Generation. Das geniale Betriebssystem AMIGA OS 3.5 ist nun
verf&uuml;gbar und kann auf der Messe eifrig getestet werden. Die Pr&auml;mierung des
AMIGA Animationswettbewerbes0m findet am 14.11.99 um 14.00 Uhr auf dem
AMIGA-Stand statt. Und in Zusammenarbeit mit dem Veranstalter - jede Menge
surfen und chatten im Cybercafe bei AMIGA. Selbstverst&auml;ndlich stehen der
Fachpresse zahlreiche Ansprechpartner aus dem Hause AMIGA Int. Inc. zur
Beantwortung von Fragen zur Verf&uuml;gung.&laquo;
</P>
<P>
&raquo;Neuigkeiten von rbm auf der HOME electronics world
</P>
<P>
Warum immer nur beige Computergeh&auml;use? rbm wird farbige Big-Tower-Geh&auml;use
in 16 verschiedenen Farben in K&ouml;ln vorstellen - auf Wunsch sind die Farben
auch als Metallic-Lackierung erh&auml;ltlich.
</P>
<P>
Sicherheit f&uuml;r Ihren AMIGA - unter diesem Motto stellt rbm digitaltechnik
eine unterbrechungsfreie Stromversorgung ( USV ) vor. Die USV sch&uuml;tzt Ihre
Daten vor &Uuml;berspannungssch&auml;den und Stromausf&auml;llen. Die beiliegende Software
erm&ouml;glicht dem Anwender von ihm erstellte AReXX-Scripte auszul&ouml;sen, die
Daten zu speichern oder Meldungen via Internet versenden zu lassen.
</P>
<P>
FX-Paint 2.0 wird von Felix Schwarz ( Programmierer von UConv. 4.0 ) auf
dem Stand von rbm digitaltechnik vorgestellt. Umfangreiche Unterst&uuml;tzungs-
Features zeichnen dieses neue Programm aus. Dazu rbm digitaltechnik: &quot;Diese
Software verf&uuml;gt &uuml;ber viele weitere Funktionen, die so einzigartig sind,
dass sie bisher in dieser Form weder f&uuml;r AMIGA noch f&uuml;r andere Plattformen
verf&uuml;gbar sind.&quot;&laquo;
</P>
<P>
&raquo;ANNEX sorgt f&uuml;r DANCE- und MUSIC-Power
</P>
<P>
Auf der B&uuml;hne der HOME electronics world gibt es Dancefloor in Perfektion.
ANNEX wird den Besuchern an den drei Messetagen in K&ouml;ln Gutes f&uuml;r Ohren und
Augen anbieten. Lassen Sie sich &uuml;berraschen und verpassen Sie ANNEX in
keinem Fall
Gesponsert von AMIGA Int.&laquo;
</P>
<P>
(Quelle: jeweils <A HREF="http://www.homeelectronicsworld.de" TARGET="_TOP">http://www.homeelectronicsworld.de</A>)
</P>
<P ALIGN="RIGHT">
<A HREF="Messebericht2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Messebericht4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
