<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Amiga PowerPC</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="PowerPC.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="PowerPC.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="PowerPC2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Amiga PowerPC
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Amiga PowerPC</H1>
<H2>1. Auslieferung der G4-Karten von Phase 5 verz&ouml;gert sich erneut</H2>
<P>
Phase 5 digital products informiert:
</P>
<P>
&raquo;Informationen &uuml;ber den aktuellen Entwicklungsstand der Next Generation G4
Prozessorkarten von phase 5 digital products
</P>
<HR>
<P>
Auslieferung der Cyberstorm- und Blizzard G4-Prozessorkarten
</P>
<P>
Oberursel, 26.10.1999: Aufgrund einer unklaren Liefersituation des Motorola
MPC107 System Controllers, der als Memory- und PCI-Controller auf den
Cyberstorm- und Blizzard G4-Prozessorkarten vorgesehen ist, kann der f&uuml;r
Mitte Oktober vorgesehene Auslieferungsstart der neuen G4-Generation nicht
termingerecht erfolgen. Da es vom Hersteller derzeit noch keine definitive
Aussage zum Liefertermin des Bauteils, das ab Oktober verf&uuml;gbar sein
sollte, gibt, wird zur Zeit die Verwendung eines alternativen
Systemcontrollers gepr&uuml;ft. Sofern eine Verwendung dieses alternativen
Controllers in Frage kommt, k&ouml;nnten die Cyberstorm- und Blizzard
G4-Prozessorkarten zus&auml;tzlich zum PCI-Bus mit einem AGP-Port ausgestattet
werden, was die Verwendung noch leistungsst&auml;rkerer Grafikkarten erlauben
w&uuml;rde.
</P>
<P>
Die Pr&uuml;fung auf technische Eignung des alternativen Bausteins, sowie
Kl&auml;rung der verbindlichen Liefertermine sowohl des Motorola MPC107 als
auch des Alternativcontrollers, wird voraussichtlich bis zum 10.11.1999
ben&ouml;tigen. Sofern der im Design vorgesehene MPC107 bis sp&auml;testens Ende
November in St&uuml;ckzahlen geliefert werden kann, wird eine Auslieferung der
Cyberstorm- und Blizzard G4-Prozessorkarten vor Jahresende m&ouml;glich sein.
Sofern dies nicht gew&auml;hrleistet werden kann, und sich der alternative
Systemcontroller, der auch in der Linux-PPC-Referenzplattform vom IBM
eingesetzt wird, als verwendbare Alternative erweisen, so ist damit zu
rechnen, da&szlig; sich die Auslieferung der Cyberstorm- und Blizzard
G4-Prozessorkarten auf den Beginn des kommenden Jahres verschiebt.
</P>
<P>
In Hinblick auf die Zusatzmodule werden sowohl das U2W-SCSI-Modul als auch
das Fast-SCSI-II-Modul in Serie gehen. Der derzeitige Auftragsbestand f&uuml;r
das Ultra-DMA-ATA-Modul und das IEEE1394-Modul lassen eine verbindliche
Festsetzung der Serienproduktion leider noch nicht zu.
</P>
<P>
Alle Kunden, die eine Cyberstorm- und Blizzard G4-Prozessorkarte
vorbestellt haben, werden bis Mitte November eine schriftliche Information
&uuml;ber die bis dahin entschiedenen &Auml;nderungen und Liefertermine erhalten. Mit
dieser Information erhalten sie gleichzeitig ein aktuelles und attraktives
Angebot f&uuml;r die Speichermodule, die auf den Cyberstorm- und Blizzard
G4-Prozessorkarten eingesetzt werden k&ouml;nnen.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="PowerPC.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="PowerPC2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
