<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Vor euch liegt ein umfangreicher AMIGA aktuell Spieleteil. Diesen Monat
war es endlich soweit und ich konnte satte f&uuml;nf Spiele testen, n&auml;mlich
T-Zer0, The Prophet, Wet, Marblelous 2 und Speccy 99, welches vor allem
f&uuml;r die Emulator-Freunde unter uns interessant sein d&uuml;rfte. Au&szlig;erdem
gibt es diese Ausgabe ein exklusives Interview mit Thomas Frieden von
Hyperion Software sowie topaktuelle Informationen zu Heretic II und
Shogo. Und selbstverst&auml;ndlich gibt es auch wieder die beliebten Spiele
News aus aller Welt und auch - diesen Monat besonders viele - Emulator
News. Da diesen Monat auch zwei neue Demoversionen ver&ouml;ffentlicht
wurden, findet ihr in dieser Ausgabe auch Previews dieser zwei Spiele,
HellSquad und Mikro Mortal Tennis.
</P>
<P>
Leider f&auml;llt diesen Monat aber die Mac-Ecke aus, da Andreas
Koch diesen Monat umgezogen ist und sich auch seine E-Mail Adresse
ver&auml;ndert hat. Ich konnte ihn leider nicht erreichen, aber n&auml;chsten
Monat wird es bestimmt wieder eine Mac-Ecke geben. In dieser Ausgabe
sind aber trotzdem die Kompatibilit&auml;tsliste sowie der Aufruf der
Mac-Ecke vorhanden. Die alte E-Mail Adresse von Andreas Koch
(<A HREF="mailto:Andreas.Koch@rz-online.de">Andreas.Koch@rz-online.de</A>) scheint zwar noch g&uuml;ltig zu sein, wird
aber kaum abgefragt. Ihr k&ouml;nnt also E-Mails an Andreas Koch auch
an mich schicken, und ich leite sie an ihn dann weiter, sobald
ich seine neue E-Mail Adresse wei&szlig;.
</P>
<P>
Einen besonderen Service hat mir diesen Monat Ewald M&ouml;ller angeboten:
Er besitzt ein umfangreiches Archiv mit Cheats, Tips, Tricks,
Karten und Komplettl&ouml;sungen zu vielen Amiga-Spielen (&uuml;ber 1000).
Wenn jemand einen Cheat f&uuml;r irgendein Spiel ben&ouml;tigt, so kann
er sich gerne bei Ewald M&ouml;ller &lt;<A HREF="mailto:TroubleMaker_Of_Sonar@t-online.de">TroubleMaker_Of_Sonar@t-online.de</A>&gt;
melden und Ewald wird versuchen ihm so gut es geht zu helfen.
F&uuml;r alle Nicht-Onliner hier auch nochmal die Postadresse: Ewald
M&ouml;ller, Beim Hornschen Hof 3, 18055 Rostock. Die Telefonnummer
m&ouml;chte ich hier nicht ver&ouml;ffentlichen, sie kann aber bei Bedarf
bei mir erfragt werden. Eine Liste mit den Spielen zu denen
Cheats vorhanden sind, ist auch verf&uuml;gbar. Sie kann bei Ewald
M&ouml;ller oder mir angefordert werden. Also, wenn ihr bei irgendeinem
Spiel Hilfe ben&ouml;tigt, fragt ruhig mal nach!
</P>
<P>
Da es diesen Monat wieder einige Reviews gibt, m&ouml;chte ich
hier auch nochmal mein derzeitiges Amiga-System (= das System,
auf dem die Spiele getestet wurden) bekanntgeben: Amiga 1200
im Micronik Tower, 68040 40mhz (Blizzard 1240 T-ERC), AGA
(= keine Grafikkarte), 2MB Chip Ram, 16MB Fast Ram.
</P>
<P>
So, dann bleibt mir nur noch zu sagen, dass ich hoffe, dass ihr
diesen Monat alle auf die Home Electronics World (Ex Computer 9x)
kommt und dass wir uns dort mal gemeinsam ein Bild &uuml;ber die
Zukunft des Amigas machen k&ouml;nnen :-) Ich werde definitiv am
Sonntag, den 14. November da sein.
</P>
<P>
Viel Spa&szlig; mit dieser Ausgabe,
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
