<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Review: Speccy 99 - The Spectrum Emulator &amp; Games Collection</H1>
<P>
Hier nun auch mal ein Test f&uuml;r die Emulator-Freunde unter den
Amiga Usern: Ein Review der Speccy 99 CD-ROM, welche Spectrum
Emulatoren sowie Spiele f&uuml;r diesen enth&auml;lt. Spectrum Emulatoren
sind f&uuml;r die meisten Systeme, so also auch f&uuml;r den Amiga,
vorhanden. Eine richtige Oberfl&auml;che bekommt man jedoch nur
auf dem PC zu sehen. Am Amiga bleibt einem nur, sich DOpus
zu schnappen und durch die einzelnen Verzeichnisse zu browsen.
</P>
<P>
Im Verzeichnis Emulators/amiga findet man nun auch 46 LHA
Archive mit potentiellen Emulator-Kandidaten. Da den Emulatoren
nur die Aminet bzw. Fish-Readme`s beigepackt wurden, darf
man sich jetzt auf die Suche nach einem geeigneten Emulator
f&uuml;r sein System machen. Eine Beschreibung der einzelnen
Emulatoren w&auml;re hier sicher besser gewesen. Au&szlig;erdem h&auml;tte
man die Emulatoren doch auch schon entpacken k&ouml;nnen. Sonst
findet man in diesem Verzeichnis nur noch Spectrum-Emulatoren
f&uuml;r viele andere Systeme (sogar f&uuml;r den C64 und die Playstation).
</P>
<P>
Interessant wird es im Games/ Verzeichnis, denn hier findet
man &uuml;ber 6000 (!) Original-Spiele f&uuml;r den Spectrum. Einen
Spectrum Fan d&uuml;rfte dies in einen wahren Rausch versetzen.
Wie es mit der legalen Lage der Spiele aussieht, kann ich
hier leider nicht sagen, da hierzu keinerlei Angaben
gemacht wurden. M&ouml;glicherweise ist das Copyright f&uuml;r diese
Spiele von erloschen.
</P>
<P>
Au&szlig;erdem findet man auf der CD-ROM noch zahlreiche Diskmags,
Werbeanzeigen f&uuml;r den Spectrum, technische Informationen,
Karten und L&ouml;sungen f&uuml;r viele der Spiele, Utilities um
Spectrum Sachen zu konvertieren und vieles mehr. Auch sind
die Original Spectrum ROMs sowie Informationen zu diesen
auf der CD-ROM vorhanden. Hintergrundbilder f&uuml;r Spectrum
Fans gibt es auch reichlich.
</P>
<P>
Fazit: Die CD-ROM ist eine gelungene Kombination, die
allerdings nur f&uuml;r echte Spectrum Fans interessant sein
d&uuml;rfte. Von der Amiga Seite l&auml;sst sie allerdings einiges
zu w&uuml;nschen &uuml;brig, denn hier wurden einfach nur Spectrum
Emulatoren aus dem Aminet ohne Liebe in ein Verzeichnis
geknallt ohne jegliche Beschreibung und Bewertung. Daf&uuml;r
l&auml;sst sich fast alles Material der CD-ROM problemlos am
Amiga verwenden.
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:          Speccy 99 - The Spectrum Emulator &amp; Games Collection    |
|  Hersteller:    ?, erh&auml;ltlich bei Ferst Computer                        |
|  Preis:         29 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Sammlung               | Spieler: -                     |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        alle Amigas, CD-ROM, 68030 empfohlen                    |
|                                                                         |
|  Fazit:         F&uuml;r Spectrum Fans ein Muss!                             |
|                                                                         |
|  Wertung:                         GESAMT 70%                            |
+-------------------------------------------------------------------------+
</PRE>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
