<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> WipeOut 2097 zur Messe in K&ouml;ln
</LI>
</UL>
<P>
Jetzt ist es offiziell: Wipeout 2097 erscheint exklusiv f&uuml;r mit
PowerPC und Grafikkarten ausgestattete Amigas auf der Home
Electronics World in K&ouml;ln. In Deutschland ist das Spiel bei Stefan
Ossowski`s Schatztruhe f&uuml;r voraussichtlich 99 DM erh&auml;ltlich.
Wipeout 2097 ist damit das erste Amiga Spiel, welches nur auf
PowerPC Amigas l&auml;uft und d&uuml;rfte deshalb auch ein Muss f&uuml;r alle
Besitzer eines solchen darstellen. Da Digital Images nicht mit
eigenem Stand auf der Messe sein wird, wird man das Spiel auf
der Messe ebenfalls bei Schatztruhe kaufen k&ouml;nnen.
</P>
<UL>
<LI> Neues zu Heretic II
</LI>
</UL>
<P>
Hyperion Software kommt bei der Heretic II Portierung sehr
gut voran. Der Software-Renderer, der seit 5. Oktober l&auml;uft,
laufe schon auf langsameren PPCs mit durchschnittlich 25
fps im LowRes Modus. Auf 200mhz PowerPCs mit Grafikkarte
w&uuml;rden sogar 30fps erreicht. Auch auf AGA werde noch eine
angemessene Geschwindigkeit erreicht. Momentan beseitigt
Hyperion Software noch Fehler und f&uuml;gt fehlende Features
hinzu. So z.B. den Animations- und den Soundspieler. Auch
arbeitet man am Hardware-Renderer mit dem das Spiel dann
hoffentlich auf einem 68060 lauff&auml;hig ist. Heretic II
und auch Shogo k&ouml;nnen schon bei Titan Computer vorbestellt
werden, wobei Heretic II wahrscheinlich Mitte bis Ende
November erscheint. In dieser Ausgabe findet ihr &uuml;brigens
auch ein Interview mit Thomas Frieden von Hyperion Software,
in dem es auch noch N&auml;heres zu den Hyperion Spielen zu lesen
gibt.
</P>
<P>
<A HREF="img/Heretic2.jpg"><IMG SRC="thumb/Heretic2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Steffen H&auml;user portiert The Heretic Fortress
</LI>
</UL>
<P>
Zuerst solle dieses Public Domain Addon f&uuml;r Heretic II
von Hyperion Software kommen, doch um keine Verz&ouml;gerungen
bei Heretic II und Shogo einzugehen, &uuml;bernimmt Steffen
H&auml;user nun diese Aufgabe. Mit der Portierung hat er nach
eigenen Angaben schon begonnen und hofft zeitgleich mit
der Erscheinung von Heretic II fertig zu sein. The Heretic
Fortress wird frei erh&auml;ltlich sein, da auch das PC Original
Public Domain ist, aber man ben&ouml;tigt die Vollversion
von Heretic II, um es benutzen zu k&ouml;nnen.
</P>
<UL>
<LI> Langersehntes Napalm Update ver&ouml;ffentlicht
</LI>
</UL>
<P>
Auf der clickBOOM Webseite wurde das langersehnte Update zu Napalm
Mitte dieses Monats ver&ouml;ffentlicht. Das Top-Feature des neuen
Updates ist zweifelsfrei der Netzwerkmodus. Dieses Feature d&uuml;rfte
den Spielspa&szlig; an Napalm noch lange aufrecht erhalten. Au&szlig;erdem
gab es einige Fehlerbeseitigungen und andere verschiedene
&Auml;nderungen. Napalm Besitzer sollten das Update unbedingt von
<A HREF="http://www.clickboom.com/portal/" TARGET="_TOP">http://www.clickboom.com/portal/</A> laden.
</P>
<UL>
<LI> EuroBurn von clickBOOM
</LI>
</UL>
<P>
clickBOOM hat bekanntgegeben, dass das unter dem Namen Napalm
Mission Disk bekannte Addon zu Napalm jetzt in EuroBurn umbenannt
wurde. EuroBurn bietet ein frisches neues Gameplayer, Hollywood
&auml;hnliche Explosionen, neue Missionen, komplett neugestaltetes
Interface und mehr. EuroBurn soll innerhalb weniger Monate
fertig sein.
</P>
<UL>
<LI> HellSquad Demoversion ver&ouml;ffentlicht
</LI>
</UL>
<P>
Digital Dreams Entertainment hat eine Demoversion des Actionadventures
HellSquad ver&ouml;ffentlicht. Dieses Spiel wurde vorher von AVM entwickelt
und jetzt von Digital Dreams &uuml;bernommen. Eine Preview k&ouml;nnt ihr in
dieser Ausgabe lesen. Die Demoversion l&auml;sst sich von der Digital Dreams
Webseite laden. Au&szlig;erdem hat Digital Dreams Entertainment noch neue
Screenshots von ihrem Spiel Diablo`s Land ver&ouml;ffentlicht; dies m&ouml;chte
man jeden Monat tun, um die Amiga User auf dem laufendem &uuml;ber das Spiel
zu halten.
</P>
<UL>
<LI> Wasted Dreams RTG Version
</LI>
</UL>
<P>
Ein Erscheinungstermin f&uuml;r die sich in Entwicklung befindende
Grafikkartenversion von Wasted Dreams steht zwar noch nicht fest,
daf&uuml;r gab Digital Dreams aber bekannt, dass auf der CD-ROM als
Bonus noch ein weiteres Spiel vorhanden sein soll. Hierbei handele
es sich um ein auf der Engine von Wasted Dreams basierendes,
neues Spiel, in welchem es aber mehr Action als in Wasted Dreams
gebe. Eine Demoversion soll noch diesen Monat erscheinen.
</P>
<UL>
<LI> T-Zer0 Demoversion ver&ouml;ffentlicht
</LI>
</UL>
<P>
clickBOOM hat endlich eine Demoversion von T-Zer0 ver&ouml;ffentlicht, die
satte 26 Megabyte einnimmt. T-Zer0 war schon im Sommer dieses Jahres
ver&ouml;ffentlicht worden und ein Review k&ouml;nnt ihr in dieser Ausgabe
lesen. Die Demoversion kann von der clickBOOM Homepage geladen werden.
</P>
<P>
<A HREF="img/TZero1.jpg"><IMG SRC="thumb/TZero1.jpg" WIDTH="104" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/TZero2.jpg"><IMG SRC="thumb/TZero2.jpg" WIDTH="108" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/TZero3.jpg"><IMG SRC="thumb/TZero3.jpg" WIDTH="86" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Alive Mediasoft News
</LI>
</UL>
<P>
Alive Mediasoft hat bekanntgegeben, dass die Neuver&ouml;ffentlichungen
von Whale`s Voyage 1 und 2 bereits Anfang November erscheinen sollen.
Goal 2000, eine &Uuml;berarbeitung des alten Goal, soll Mitte November
dann folgen.
</P>
<UL>
<LI> Zukunft von Amiga Nutta
</LI>
</UL>
<P>
David Flaherty, Autor der erfolgreichen Spielenews Seite Amiga Nutta,
hat auf deren Homepage ein Statement zur Zukunft des Amigas und
der Amiga Nutta Seite ver&ouml;ffentlicht. Darin hei&szlig;t es, dass seine
Motivation, etwas f&uuml;r diese Seite zu machen, immer mehr nach l&auml;sst,
weil es immer weniger News zu berichten gibt und auch die Zahl
der Amiga User st&auml;ndig nach l&auml;sst. Die Zukunft von Amiga Nutta
sieht er in argem Zweifel, wie auch die Zukunft des Amigas &uuml;berhaupt.
</P>
<UL>
<LI> Marblelous 2 auf Aminet CD 33
</LI>
</UL>
<P>
Auf der Aminet CD 33, die Mitte dieses Monats ver&ouml;ffentlicht wurde,
findet man die Vollversion des Geschicklichkeitsspiels Marblelous 2.
Da das vor ca. 1 Jahr erschienene Spiel noch nicht in dem Spieleteil
getestet wurde, gibt es diesen Monat auch ein Review dar&uuml;ber zu
lesen.
</P>
<P>
<A HREF="img/Marblelous2-1.jpg"><IMG SRC="thumb/Marblelous2-1.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Marblelous2-2.jpg"><IMG SRC="thumb/Marblelous2-2.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/Marblelous2-3.jpg"><IMG SRC="thumb/Marblelous2-3.jpg" WIDTH="120" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<UL>
<LI> Darkage Software stellt Alive ein
</LI>
</UL>
<P>
Die Entwicklung des Shoot`em`Ups Alive ist nun endg&uuml;ltig eingestellt.
Vor einigen Monaten startete Darkage Software noch eine Umfrage,
ob die Amiga-User Alive &uuml;berhaupt wollten. Anscheinend ist
diese Umfrage nicht sehr rosig ausgefallen, denn Darkage Software
beklagt sich &uuml;ber zu geringe Resonanz.
</P>
<UL>
<LI> Neue Maim &amp; Mangle Screenshots
</LI>
</UL>
<P>
The World Foundry hat zwei neue Screenshots von Maim &amp; Mangle
auf ihrer Webseite ver&ouml;ffentlicht.
</P>
<UL>
<LI> SportsTime von M.S.P.
</LI>
</UL>
<P>
Die eher unbekannten Entwickler von M.S.P. haben f&uuml;r das 1. Quartal
2000 ein neues Sportspiel mit dem Namen SportsTime angek&uuml;ndigt.
In dem Spiel soll es &uuml;ber 8 verschiedene Disziplinen geben.
Au&szlig;erdem soll das Spiel AGA und Grafikkarten Amigas mit CD-ROM
unterst&uuml;tzen. F&uuml;r SportsTime sucht M.S.P. &uuml;brigens auch noch
einen 3D Grafiker.
</P>
<UL>
<LI> Mailingliste von Apex Design
</LI>
</UL>
<P>
Auf <A HREF="http://web.ukonline.co.uk/jdaniels/mailinglist.html" TARGET="_TOP">http://web.ukonline.co.uk/jdaniels/mailinglist.html</A> k&ouml;nnen
sich Interessierte einschreiben, um immer direkt die News der
Entwickler von Payback per E-Mail zu bekommen. Au&szlig;erdem wurden
auf der Webseite neue Grafiken von Payback ver&ouml;ffentlicht.
</P>
<UL>
<LI> Explorer 2260 auch f&uuml;r Linux?
</LI>
</UL>
<P>
Auf der Webseite von The World Foundry, den Entwicklern von
Explorer 2260, findet momentan eine Umfrage statt, ob auch
eine Linux Version von Explorer 2260 ver&ouml;ffentlicht werden
soll. Au&szlig;erdem wurde auf der Webseite ein neuer Support Bereich
er&ouml;ffnet, in dem Updates zu The World Foundry Produkten,
aber auch eigenst&auml;ndigen Programme geladen werden k&ouml;nnen.
</P>
<UL>
<LI> Hilt - Against the Hoarder ver&ouml;ffentlicht
</LI>
</UL>
<P>
Hilt ist ein RPG/Strategiespiel von F1 Software im Stil von Hero
Quest. Man kann zwischen verschiedenen Charakteren w&auml;hlen, von
denen jeder seine Vorteile hat, und muss verschiedene Szenerien
erforschen. Jede Szenerie besteht dazu aus 50 Leveln. Hilt ben&ouml;tigt
2MB Ram, kann auf Festplatte installiert werden und l&auml;uft auf
jedem Amiga. Hilt kann bei F1 Software direkt bezogen werden.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
