<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele7.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Review: T-Zer0</H1>
<P>
T-Zer0 (fr&uuml;her Trauma Zero) hat schon eine lange Entwicklungszeit
hinter sich. Zuerst sollte das Spiel irgendwann in 96/97 by OMC
erscheinen, doch es verz&ouml;gerte und verz&ouml;gerte sich und OMC hatte
inzwischen den Amiga-Markt verlassen. Dann wurde es von clickBOOM
&uuml;bernommen und im Sommer dieses Jahres auch endlich ver&ouml;ffentlicht.
T-Zer0 kommt in der handels&uuml;blichen CD-H&uuml;lle daher, in der sich
aber au&szlig;er der CD-ROM auch noch ein kleines gedrucktes Booklet
befindet mit vielem Wissenswerten &uuml;ber das Spiel. Die Installation
geht problemlos von statten; der Benutzer kann zwischen f&uuml;nf
verschiedenen Installationsmethoden w&auml;hlen, die von 38KB bis zu
260MB auf die Festplatte installieren. Die Standardinstallation
ben&ouml;tigt 55 Megabyte. T-Zer0 ben&ouml;tigt AGA, mindestens einen
68030 sowie 8MB Speicher.
</P>
<P>
In der Geschichte von T-Zer0 geht es um den Astronauten-Major
Railey, der im Weltraum Aliens entdeckt haben, die die Erde
zerst&ouml;ren wollen. Als er diese 'Geschichte' den Beh&ouml;rden auf
der Erde erz&auml;hlt, wird er nicht ernst genommen. Als er es
alleine mit den Aliens aufnehmen will, wird er eingesperrt,
doch kurz darauf konnte man von der Erde die neue Dimension
im Radar erfassen und man nannte sie T-Zer0. Nun m&uuml;ssen
die tapferen Helden der 1st Aerospace Academy, zu denen auch
Major Railey geh&ouml;rt, die Erde verteidigen. Sie m&uuml;ssen f&uuml;nf
Bosse erledigen, die jeweils einen Diamanten beherbergen.
Erst wenn sie alle f&uuml;nf Diamanten besitzen, k&ouml;nnen sie den
Endboss erreichen.
</P>
<P>
Nach der Installation muss man erstmal mittels eines mitgelieferten
Setup Programms Einstellungen f&uuml;r sein CD-ROM festlegen.
Angegeben werden m&uuml;ssen hier das CD-ROM Device sowie die
Unit. In der Version 1.0 funktioniert dies nicht mit IDEfix
(CacheCDFS). Wer also IDEFix benutzt und noch keinen CD-Sound
h&ouml;ren konnte, der sollte sich schleunigst das Update auf
Version 1.01 von <A HREF="http://www.clickboom.com/" TARGET="_TOP">http://www.clickboom.com/</A> runterladen und
installieren. Nach dem Start von T-Zer0 erscheint erstmal
ein relativ langes und umfangreiches Intro mit reichlich
Animationen und etwas Sprachausgabe. Danach findet man sich
im Hauptmen&uuml; wieder, wo man etliche Sachen einstellen kann.
Man kann z.B. zwischen Arcade- und Story Modus w&auml;hlen,
1 oder 2 Spieler einstellen, verschiedene Modi f&uuml;r die
Animationen im Spiel einstellen und vieles mehr. Dann nur
noch auf Start klicken und das Raumschiff ausw&auml;hlen
und schon geht`s los.
</P>
<P>
Oder auch nicht. Nach dem Ausw&auml;hlen des Raumschiffes st&uuml;rzte
mein Amiga einfach ab ohne irgendeine Meldung anzuzeigen.
Also nochmal versuchen und einige Sachen abschalten, so
dass ich 1,9MB freien Chip Speicher habe und tats&auml;chlich:
Jetzt l&auml;uft es. Nach den anf&auml;nglichen HighRes Interlace
Grafiken findet man sich pl&ouml;tzlich im LowRes Modus wieder
und sieht das Raumschiff vor sich hinfliegen, was man jetzt
auch steuern kann. T-Zer0 steuert sich prima, was bei einem
Shoot`em`Up ja auch sehr wichtig ist. Dauerfeuer wird
ebenfalls unterst&uuml;tzt; da werden alte Erinnerungen an so
tolle Spiele wie R-Type wieder wach. Im Laufe des Levels
f&auml;ngt das Raumschiff immer schneller an zu fliegen, was
einen guten Effekt bringt. Zwischendurch gibt es verschiedene
Extras zum Aufsammeln wie bessere Waffen, Extraleben aber
auch Totenk&ouml;pfe, die die Steuerung vertauschen (bewegt man
den Joystick nach oben, fliegt das Raumschiff nach unten).
Grafisch ist T-Zer0 gut gestaltet, auch gibt es Animationen
im Hintergrund. Sammelt man neue Waffen ein, bekommt man
per Sprachausgabe das gleich best&auml;tigt. Erinnert alles
sehr an die guten alten Factor5/RainbowArts Spiele.
</P>
<P>
Fazit: Mit T-Zer0 gibt es seit langem mal wieder ein gutes
Shoot`em`Up f&uuml;r den Amiga. Die lange Wartezeit hat sich
gelohnt: T-Zer0 ist ein ausgereiftes Spiel mit vielen kleinen
Extra, die das Spiel immer interessant bleiben lassen.
FMV-Sequenzen sowie CD Audiotracks und tolle SoundFX runden
das ganze ab. Die Grafik macht ebenfalls einen professionellen
Eindruck, auch wenn es im Spiel manchmal etwas eint&ouml;nig
scheint. Bei soviel Action fallen die Animationen im Hintergrund
fast gar nicht auf, sie verdienen jedoch auch Erw&auml;hnung.
T-Zer0 ist also ein rundum gelungenes Spiel. Kommen wir
nun zur Wertung:
</P>
<P>
<A HREF="img/TZero1.jpg"><IMG SRC="thumb/TZero1.jpg" WIDTH="104" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/TZero2.jpg"><IMG SRC="thumb/TZero2.jpg" WIDTH="108" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
<A HREF="img/TZero3.jpg"><IMG SRC="thumb/TZero3.jpg" WIDTH="86" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:          T-Zer0                                                  |
|  Hersteller:    clickBOOM, ver&ouml;ffentlicht von PXL Computers, box 969,   |
|                 31 Adelaide St. East Toronto M5C 2K3, Ontario, Kanada   |
|                 <A HREF="mailto:info@clickboom.com">info@clickboom.com</A>                                      |
|  Preis:         99 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Shoot'em'Up            | Spieler: 1 oder 2              |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        68030, 8MB Ram, CD-ROM, Festplatte, AGA (keine Grafikk.)|
|                                                                         |
|  Fazit:         Gelungenes Shoot'em'Up mit vielen Extras. F&uuml;r Fans des  |
|                 dieses Genres ein Muss!                                 |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     8/10                            |
|                             Sound:      9/10                            |
|                             Handhabung: 8/10                            |
|                             Spielspa&szlig;:  8/10                            |
|                             GESAMT:      83%                            |
+-------------------------------------------------------------------------+
</PRE>
<P ALIGN="RIGHT">
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
