<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. AMIGA k&uuml;ndigt Entwicklung von WindowsCE .NET-Software an 

AMIGA, Inc. (http://www.amiga.com) informiert:

»PRESSE-ERKL&Auml;RUNG                          ZUR SOFORTIGEN VER&Ouml;FFENTLICHUNG
                                           12. M&auml;rz 2002

Weitere Informationen von:
Bill McEwen
Amiga Inc.
425-396-5660 (x226 ) (Telefon)
425-396-5671         (Fax)
bill@amiga.com

   
Amiga(r) wird Inhalte f&uuml;r die n&auml;chste Generation der auf Windows CE .NET 
basierenden Ger&auml;te bereitstellen.

Amiga-Spiele und Anwendungsprogramme werden gezielt f&uuml;r Windows CE .NET 
geschrieben.

San Francisco, Kalifornien - 12. M&auml;rz 2002 - AMIGA, Inc. gibt die gezielte 
Freigabe und Auslieferung von Amiga-Programmen f&uuml;r das Microsoft 
Betriebssystem Windows CE .NET bekannt. Die Programme werden auf allen 
Ger&auml;ten laufen, die mit Windows CE .NET betrieben werden, eingeschlossen 
sind Handger&auml;te, intelligente Telefone (smart phones), Handger&auml;te f&uuml;r Web-
Zugang (web pads) und Set-Top-Boxen.

AMIGA kann auf eine lange Geschichte mit Spielen und Multimedia zur&uuml;ck 
blicken und hat seit 1985 wertvolle, unwiderstehliche Programme 
ausgeliefert. Die neue Entwicklung der Amiga-Anwendungen erfolgte, um sie 
auf dem gesamten Bereich der mit Windows betriebenen Produkte laufen zu 
lassen, einschlie&szlig;lich PDAs, Handys und Set-Top-Boxen. Amiga bietet eine 
mittlere &Uuml;bertragungsschicht, durch welche Amiga-Anwendungen einmal 
geschrieben werden und ohne &Auml;nderung auf allen mit Windows betriebenen 
Ger&auml;ten laufen. &Uuml;ber 100 Anwendungen werden sofort zu Anfang zur Verf&uuml;gung 
stehen, und viele weitere werden weltweit von den Amiga-Entwicklern 
geschrieben werden.

"Wir freuen uns, Inhalte ausliefern zu k&ouml;nnen, die f&uuml;r den Betrieb auf der 
Plattform Windows CE .NET optimiert sind", sagt Bill McEwen, Pr&auml;sident/CEO 
von AMIGA Inc. "Amiga-Entwickler sind weltweit bekannt f&uuml;r ihre F&auml;higkeit, 
erstaunliche Multimedia-Anwendungen mit kleinsten System-Anforderungen zu 
schaffen. Damit sind wir in der Lage, selbst bei kleinsten Ger&auml;te robust 
laufende und aufregende Dinge bieten zu k&ouml;nnen."

"Da die Zahl der kleinen und mobilen mit Windows betriebenen Ger&auml;te und 
ihre Varianten immer weiter wachsen, wollen ISVs sicherstellen, dass ihre 
Programme auf so vielen verschiedenen Ger&auml;ten wie m&ouml;glich laufen k&ouml;nnen," 
sagt Keith White, leitender Direktor f&uuml;r den Vertrieb in der Gruppe f&uuml;r die 
"Embedded and Appliance Platform" der Microsoft Corp. "Amiga Anywhere 
erlaubt es den Entwicklern, ganz einfach die Vorteile von Windows CE .NET 
wahrzunehmen und Spiele zu schreiben, die auf einem weiten Bereich 
intelligenter mit Windows betriebener Ger&auml;te laufen k&ouml;nnen."

Es wird erwartet, dass die mit "Amiga f&uuml;r Windows" betriebenen Produkte im 
April diesen Jahres ausgeliefert werden. Weiter Informationen finden Sie 
auf der Web-Site von Amiga Anywhere bei http://www.amiga-anywhere.com/.


&Uuml;ber AMIGA

AMIGA Inc. entstand im Jahr 1985 als erster Betrieb in der Welt, der 
Multimedia-Technologie zur Verf&uuml;gung stellte. Heute f&uuml;hrt AMIGA immer noch 
auf dem Weg in diese Richtung dadurch, dass es den Entwicklern Technologien 
bietet, die von einer Programmiersprache unabh&auml;ngig sind, um Programme f&uuml;r 
eine neue Multimedia-Plattform zu schreiben und zu portieren, die Hardware-
unabh&auml;ngig sind. Amiga Anywhere, betrieben mit intent(TM) von Tao Group, 
erlaubt es, dass Anwendungsprogramme unver&auml;ndert auf einem weiten Bereich 
von Prozessoren laufen, dazu geh&ouml;ren ARM, StrongARM, Intel X-Scale, OMAP, 
MIPS, Intel x86, Motorola 68K und Hitachi SH. Es kann auf eine gro&szlig;e Zahl 
von Betriebssystemen aufgesetzt betrieben werden einschlie&szlig;lich Windows CE 
.NET, Windows 9x, 2000, Windows XP, Linux und Embedded Linux. Der AmigaDE 
Player und Programme k&ouml;nnen erworben werden bei www.amiga-anywhere.com. Der 
Hauptsitz von AMIGA ist in Snoqualmie, Washinton, und betreibt weltweit 
Miederlassungen. Sie k&ouml;nnen AMIGA erreichen &uuml;ber (425) 396-5660 oder 
besuchen Sie AMIGA im Web bei www.amiga.com. Andere Produkt- oder 
Dienstleistungsnamen, die hier genannt wurden, sind Handelsmarken der 
jeweiligen Besitzer.«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
