<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. AMIGA nennt »AmigaDE Player« in »Amiga Anywhere« um

Die folgende Pressever&ouml;ffentlichung richtet sich in erster Linie an "Amiga-
Neulinge". Denn faktisch handelt es sich bei Amiga Anywhere um den 
umbenannten AmigaDE Player, wie auch der AMIGA-Mitarbeiter Vince Pfeifer 
auf der offiziellen Support-Website http://www.amiga-anywhere.com 
erl&auml;utert.


AMIGA, Inc. (http://www.amiga.com) informiert:

»AMIGA, Inc. k&uuml;ndigt die Produktlinie Amiga(r) AnywhereTM f&uuml;r PDAs, Handys, 
Set-Top-Boxen, Internet-Ger&auml;te, Desktops, Digital-Fernseher und weitere an.

Nun stehen Amiga-Anwendungen zur Verf&uuml;gung - Hier und &Uuml;berall.

11. M&auml;rz 2002 - Snoqualmie, Washington - AMIGA, Inc. freut sich, seine neue 
Produktlinie einzuf&uuml;hren, eine Komplettl&ouml;sung f&uuml;r die Vorstellung von 
Programmen auf jeder Art elektronischer Ger&auml;te mit dem ausgesprochenen 
Zweck, die Erfahrungen der Endverbraucher zu f&ouml;rdern.

Amiga(r) AnywhereTM bietet eine revolution&auml;re Infrastruktur f&uuml;r die 
Erzeugung und Verteilung digitaler Inhalte, wobei Wert auf hohe 
Leistungsf&auml;higkeit, &uuml;berragende Qualit&auml;t und minimalen Verbrauch von 
Resourcen gelegt wurde.

Mit 3000 Entwicklern, die bereits angemeldet sind, 67 vorhandenen Titeln 
und weiteren hunderten in Entwicklung bringt Amiga(r) AnywhereTM die 
Entwickler und Verbraucher zusammen, hier und &uuml;berall auf allen und jeden 
digitalen Ger&auml;ten.

Durch unsere langj&auml;hrige Partnerschaft mit der Tao Group sind nun Amiga-
Inhalte und Dienste f&uuml;r eine &auml;u&szlig;erst gro&szlig;e Menge an Software-Plattformen 
verf&uuml;gbar, eingeschlossen sind die verschiedenen Spielarten von Microsoft 
Windows(r), Linux, Embedded Linux, Symbian OS und VxWorks. Die Software 
l&auml;uft unver&auml;ndert auf fast allen wichtigen Mikroprozessor-Familien.

Bill McEwen, AMIGAs Pr&auml;sident und CEO, sagte: "Die Amiga-Gemeinschaft ist 
in der ganzen Welt bekannt daf&uuml;r, dass sie ganz erstaunliche 
Anwendungsprogramme schaffen kann. Sie hat einen Ruf als F&uuml;hrer in der 
Industrie der Videospiele und der Film-Animationen. Heute werden diese 
F&auml;higkeiten verwendet, um Dinge zu schaffen, die auf nahezu jedem digitalen 
Ger&auml;t laufen k&ouml;nnen und die neue Ebenen der Begeisterung er&ouml;ffnen, wenn wir 
so weiter machen."

"In den zwei Jahren, seit dem Tao und AMIGA mit Ihrer Zusammenarbeit 
begannen, wurde unsere Verbindung immer enger," sagte Francis Charig, 
Vorsitzender von Tao. "Netzbetreiber suchen Inhalte, f&uuml;r die Verbraucher 
bereit sind zu zahlen, &uuml;bertragbare Inhalte, die auf einem weiten Bereich 
von Ger&auml;ten laufen. AMIGA ist die erste Gesellschaft, die tats&auml;chlich die 
Inhalte bietet, die diesen wichtigen Anforderungen entspricht."

Ger&auml;te, die zu Amiga(r) AnywhereTM f&auml;hig sind, haben unmittelbaren Zugang 
zu einer schnell wachsenden Welt von hochwertigen Anwendungen, 
erstaunlichen Inhalten und wertvollen Dienstprogrammen. Viele schon 
existierende Ger&auml;te werden f&uuml;r Amiga(r) AnywhereTM aufger&uuml;stet, w&auml;hrend 
zahlreiche neue Ger&auml;te, wie zum Beispiel das Nokia MediaTerminal diese 
F&auml;higkeit standardm&auml;&szlig;ig erhalten und damit einen starken Anreiz f&uuml;r den 
kaufinteressierten Kunden bieten.

Wollen Sie mehr &uuml;ber AMIGA erfahren, besuchen Sie bitte www.Amiga.com


&Uuml;ber AMIGA

AMIGA Inc. entstand im Jahr 1985 als erster Betrieb in der Welt, der 
Multimedia-Technologie zur Verf&uuml;gung stellte. Heute f&uuml;hrt AMIGA immer noch 
auf dem Weg in diese Richtung dadurch, dass es den Entwicklern Technologien 
bietet, die von einer Programmiersprache unabh&auml;ngig sind, um Programme f&uuml;r 
eine neue Multimedia-Plattform zu schreiben und zu portieren, die Hardware-
unabh&auml;ngig sind. Amiga Anywhere, betrieben mit intent(TM) von Tao Group, 
erlaubt es, dass Anwendungsprogramme unver&auml;ndert auf einem weiten Bereich 
von Prozessoren laufen, dazu geh&ouml;ren ARM, StrongARM, Intel X-Scale, OMAP, 
MIPS, Intel x86, Motorola 68K und Hitachi SH. Es kann auf eine gro&szlig;e Zahl 
von Betriebssystemen aufgesetzt betrieben werden einschlie&szlig;lich Windows CE 
.NET, Windows 9x, 2000, Windows XP, Linux und Embedded Linux. Der AmigaDE 
Player und Programme k&ouml;nnen erworben werden im AmigaDE-Shop. Der Hauptsitz 
von AMIGA ist in Snoqualmie, Washington, und betreibt weltweit 
Miederlassungen. Sie k&ouml;nnen AMIGA erreichen &uuml;ber (425) 396-5660 oder 
besuchen Sie AMIGA im Web bei www.amiga.com."«

Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
