<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Moderne Amiga-Zeiten - oder: 1 + 1 = 0 (von Carsten Schr&ouml;der)

Wir befinden uns in einer schnelllebigen Welt: So pl&ouml;tzlich, wie im Februar 
die &ouml;ffentliche Diskussion um AMIGA und Microsoft aufgeflammt ist, so 
unvermittelt war sie Mitte M&auml;rz auch schon wieder passé. Grund daf&uuml;r war 
nat&uuml;rlich nicht, dass sich die User in dieser Frage mit einem Mal einig 
geworden w&auml;ren - die "Diskutanten" hatten vielmehr ein besseres Thema 
gefunden: Den AmigaOne alias AmigaOne.5 alias AmigaOneG3-SE. Denn das 
angek&uuml;ndigte PowerPC-Mainboard, welches vom Distributor Eyetech innerhalb 
von drei Tagen mit ebenso vielen unterschiedlichen Namen tituliert wurde 
(m&ouml;glicherweise ein Fall f&uuml;r das Guinness-Buch der Rekorde), scheint nun 
tats&auml;chlich fertiggestellt zu sein. Ja, es geschehen offenbar doch noch 
Wunder...
Jetzt wartet Eyetech eigenen Angaben zufolge nur noch auf das AmigaOS 4.0. 
Bleibt zu hoffen, dass die Amiga-Welt in diesem Zusammenhang nicht noch 
eine b&ouml;se &Uuml;berraschung erlebt. Denn bislang ist von der PowerPC-Version des 
Amiga-Betriebssystems noch nichts Greifbares zu sehen, nicht einmal 
Screenshots - die soll es angeblich sp&auml;testens Mitte April geben.
Selbst wenn die Entwicklung des AmigaOS 4.0 bereits weit vorangeschritten 
ist, so besteht dennoch die Gefahr, dass unvorhergesehene Probleme die 
Ver&ouml;ffentlichung noch einmal wesentlich verz&ouml;gern. Dass Hyperion-Chef Ben 
Hermans zwar eigenen Angaben zufolge stark mit einem Erscheinen im Mai 
rechnet, aber sofort hinzuf&uuml;gt, dass die Entwicklungsdauer einer neuen 
Software schwer vorhersagbar ist, klingt f&uuml;r mich wie ein Versprechen mit 
eingebauter Im-Voraus-Entschuldigung, f&uuml;r den Fall, dass der Termin doch 
wieder nicht eingehalten werden kann.
Nicht viel besser sieht es jedoch auf der anderen Seite der PowerPC-"Front" 
aus. Denn dort mangelt es zwar nicht am Betriebssystem (immerhin ist 
MorphOS ja nachweislich lauff&auml;hig, wenn auch unter Verwendung Copyright-
gesch&uuml;tzter AmigaOS-Bestandteile), daf&uuml;r l&auml;sst jedoch die Hardware 
(Pegasos) noch immer auf sich warten. Wenn man bplan Glauben schenkt, wird 
sich das Mitte Mai definitiv &auml;ndern - doch ich frage mich, wie es dem 
Unternehmen m&ouml;glich ist, eine solche Terminank&uuml;ndigung vorzunehmen. Denn 
wenn es derzeit irgendeinen Grund daf&uuml;r gibt, dass Pegasos jetzt noch nicht 
ausgeliefert werden kann - so ist ja ganz offensichtlich die Sachlage -, 
dann kann auf keinen Fall mit vollkommener Sicherheit vorhergesagt werden, 
dass dieser Grund sechs Wochen sp&auml;ter nicht mehr existiert. Somit hei&szlig;t es 
im Fall von Pegasos auch weiterhin: Abwarten und Tee trinken.
Derzeit erleben wir also die paradoxe Situation, dass sowohl ein Amiga-
PowerPC-Mainboard (eben AmigaOneG3-SE) als auch ein Amiga-kompatibles und 
(zumindest in Teilen) PowerPC-natives Betriebssystem (MorphOS) existieren, 
welche jedoch nicht zueinander kompatibel sind - obwohl dies technisch 
zweifellos recht schnell zu &auml;ndern w&auml;re. Da sich nicht absch&auml;tzen l&auml;sst, 
wie lange dieser Zustand noch anh&auml;lt, w&auml;re es das Beste, wenn sich die 
beiden Seiten, Eyetech sowie Ralph Schmidt/Frank Mariak, aufeinander 
zubewegen und f&uuml;r Kompatibilit&auml;t ihrer Projekte zueinander sorgen w&uuml;rden. 
Denn den allermeisten Anh&auml;ngern des Amiga-PowerPC-Weges ist es im Grunde 
genommen egal, ob ihre Hardware AmigaOne oder Pegasos und ihr 
Betriebssystem AmigaOS oder MorphOS hei&szlig;t - entscheidend ist, dass die 
Kombination sie zufriedenstellt.
F&uuml;r die User w&uuml;rde die M&ouml;glichkeit, Hardware und Betriebssystem beliebig zu 
kombinieren, so wie es im x86-Bereich gang und g&auml;be ist, ohnehin den 
Optimalfall darstellen - aber ob es wirklich so kommt, darf angesichts der 
mangelnden Kooperationsbereitschaft vieler Firmen im Amiga-Bereich wohl 
bezweifelt werden: Zwar hat AMIGA, Inc. angek&uuml;ndigt, dass das AmigaOS 4.0 
auch auf Pegasos und anderer PowerPC-Hardware laufen soll - MorphOS dagegen 
wird nach derzeitigem Stand der Dinge (zumindest offiziell) ausschlie&szlig;lich 
zu dem bplan-Mainboard kompatibel sein.
Mich erinnert das frappierend an die Monopolstrategie Apples, welche zum 
Ziel hat, andere Hardwarehersteller daran zu hindern, MacOS-kompatible 
Computer auf den Markt zu bringen. Ob ein solcher Weg allerdings auch im 
winzigen Amiga-Bereich Erfolg haben kann, halte ich f&uuml;r &auml;u&szlig;erst fraglich.


Damit bis zur n&auml;chsten Ausgabe,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
