<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
5. Nachbetrachtung zu Payback

Da sage noch jemand, der Amiga h&auml;tte keine Neuentwicklungen mehr auf dem 
Spielemarkt vorzuweisen. Payback beweist das Gegenteil! Das Spiel begl&uuml;ckte 
die K&auml;uferschaft zwar schon 2001, aber zahlreiche Updates mit gravierenden 
Neuerungen rechtfertigen doch einen zweiten Blick darauf.

Bei Payback handelt es sich um ein Spiel im Stil von "Grand Theft Auto" 
(GTA), bei dem man in die Rolle eines Ganoven schl&uuml;pfen darf. Man blickt 
von oben auf das Geschehen und steuert seine Figur durch eine Stadt, immer 
auf der Suche nach einem Auftrag. Die erh&auml;lt man, wenn man sich zu einem 
klingelnden Telefon begibt. Mal soll man Autos klauen, mal darf man die 
b&ouml;se Konkurrenz ausschalten, mal einfach auch in Schumis Fu&szlig;stapfen treten 
und ein Rennen fahren. F&uuml;r erf&uuml;llte Auftr&auml;ge gibt es dann Punkte, von denen 
man eine bestimmte Anzahl ben&ouml;tigt, um in die n&auml;chste Stadt zu gelangen.

Damit das ganze nicht zu einfach wird, wer h&auml;tte es gedacht, heftet sich 
die Polizei fr&uuml;her oder sp&auml;ter an unsere Fersen und verfolgt uns. Fl&uuml;chten 
kann man entweder zu Fu&szlig; oder mit einem der zahlreichen Autos, denen man 
sich zwischendurch bem&auml;chtigen kann. Flotte Flitzer findet man darunter 
genauso wie Eiswagen, Tanklaster oder auch Busse.
Wer aber gar nicht an Flucht denken mag, der darf unterwegs diverse Waffen 
einsammeln, mit denen man den Ordnungsh&uuml;tern (und nat&uuml;rlich allen und allem 
anderen) einheizen kann. Die Palette reicht da von Pistolen &uuml;ber 
Schrotgewehre und Flammenwerfer bis hin zu Raketenwerfern und Handgranaten.
Wer es jedoch &uuml;bertreibt, der ist schnell der meistgesuchteste Mann auf 
seiner Insel und muss &uuml;berall mit Stra&szlig;ensperren rechnen. Wird man dann 
erwischt oder segnet gar das Zeitliche, dann ist eines der Leben futsch.

Im Gegensatz zum "Vater" GTA gibt es aber auch einige Unterschiede. Bei 
Payback gibt es zum Beispiel nicht nur Autos zu stehlen, sondern abh&auml;ngig 
vom Level auch Boote und Hubschrauber. Das "Gesucht"-System ist auch ein 
wenig anders. W&auml;hrend man bei GTA st&auml;ndig auf der Fahndungsliste steht, 
wenn man ein gewisses Ma&szlig; an Straftaten begangen hat, verliert die Polizei 
bei Payback das Interesse, wenn man sich lange genug verstecken kann.

Neben der besseren Grafik gibt es bei Payback dann aber auch noch diverse 
Nettigkeiten, die man bei der "Vorlage" nicht findet. Allen voran zu nennen 
ist der Mehrspieler-Modus, bei dem man sich per Splitscreen gegenseitig 
beharken darf (eine Internet- bzw. Netzwerkversion ist leider nicht 
geplant). Au&szlig;erdem darf man seine Schandtaten sogar aufzeichnen und f&uuml;r die
Nachwelt festhalten.
Wem die mitgelieferten Stadtkarten auf Dauer zu langweilig werden, findet 
auf der Website des Programmierers [1], James Daniels, zahlreiche weitere, 
allerdings bisher nur f&uuml;r den Mehrspieler- bzw. Verw&uuml;stungs-Modus.
Falls jemand immer noch nicht genug hat, kann er sich auch mit dem 
Mapeditor eigene Spielpl&auml;tze schaffen. M&ouml;glich sind dabei nat&uuml;rlich auch 
die bei GTA nicht vorhandenen Nacht- und Schneelevel, auch 
Einzelspielerkarten mit Auftr&auml;gen sind m&ouml;glich!!! Hilfestellung bekommt man 
dazu &uuml;ber eine Maiilingliste [2].

Soweit so gut, das alles galt auch f&uuml;r die Urversion von Payback. Die 
Updates haben aber kleine bis gro&szlig;e Neuerungen gebracht. Die Spielfigur hat 
z.B. gelernt, automatisch auf die Fahrerseite zu gehen, wenn man sich ein 
Vehikel ausborgen will. Vorher musste man das selbst erledigen.
Au&szlig;erdem l&auml;sst sich nun die Belegung von Tastatur, Joystick oder Joypad 
(auch Playstation-Pads werden &uuml;ber einen Adapter unterst&uuml;tzt) frei nach 
eigenen W&uuml;nschen &auml;ndern. Kleine Goodies sind auch entflammbare Geb&auml;ude oder 
schreiende Passagiere von gekaperten Bussen.

Mit Update 4 begannen dann die wirklichen Einschnitte, allen voran die nun 
vorhandene Unterst&uuml;tzung des PowerPC. H&ouml;here Aufl&ouml;sungen sind damit auch 
kein Problem mehr. Eingebaut wurde auch Gourard Shading, das die Optik 
merklich verbessert hat.
Besonders hervorzuheben ist au&szlig;erdem der "Rotating Mode". Normalerweise ist 
es so, dass die Karte fixiert ist und sich die Spielfigur darauf bewegt. 
Bei diesem optionalen Modus ist es aber so, dass die Spielfigur immer "nach 
oben" schaut, sich daf&uuml;r aber die Karte dreht und man abh&auml;ngig von der 
Geschwindigkeit mal von direkt oben, mal aber auch von schr&auml;g hinten auf 
die Szenerie blickt. Das ganze muss man aber in Aktion gesehen haben, macht 
sich wirklich gut. N&ouml;tig daf&uuml;r ist aber eine 3D-Karte mit Warp3D oder ein 
PowerPC-Prozessor.

Es wird &uuml;brigens auch noch mindestens ein achtes Update geben, das neben 
verbesserter Warp3D-Unterst&uuml;tzung auch noch andere neue Features bringen 
soll.

Nicht umsonst ist Payback in mehreren Umfragen Spiel des Jahres 2001 
geworden, es ist wirklich grandios und niemand d&uuml;rfte den Kauf bereuen! 
Schade, dass die Verkaufszahlen dennoch nicht zufriedenstellend sind.

Vielleicht &auml;ndert sich das ja mit der angek&uuml;ndigten AmigaAnywhere-Version, 
die vom Programmierer voraussichtlich im April oder Mai fertiggestellt 
wird. Im Gegensatz zur AmigaOS-Version wird diese statt 8Bit-Grafiken 
16Bit-Grafiken verwenden und au&szlig;erdem einen netten Kamera-Sch&uuml;ttel-Effekt 
beinhalten. Es wird damit m&ouml;glich sein, unterwegs auf seinem PDA seine 
Bekannten zu beeindrucken, aber auch auf dem Desktop, sofern die 
AmigaAnywhere-Software Standard-Aufl&ouml;sungen wie z.B. 800x600 unterst&uuml;tzt. 
Seitens Payback gibt es da keine Beschr&auml;nkungen auf PDA-Screen-Gr&ouml;&szlig;e.

Bleibt zu hoffen, dass AmigaOS 4 genug Anh&auml;nger finden wird, denn James 
Daniels ist nicht nur vom AmigaAnywhere angetan, sondern blickt unserem 
langersehnten neuen Betriebssystem auch positiv entgegen. Vielleicht gibt 
es dann noch viele Updates f&uuml;r Payback, die das Gute noch besser machen.

Mehr Informationen findet man auf der Website von Apex-Designs oder auch 
auf der deutschsprachigen Website von Amigalien [3].

Abschlie&szlig;end noch einmal: definitiv kaufenswert!
                  
                                         
[1] http://www.apex-designs.net
[2] http://groups.yahoo.com/group/amiga_payback/
[3] http://www.amiga-payback.de.vu/

Oliver Tacke &lt;oliver@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
