<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Review: The Feeble Files (Floyd)

Diesmal geht es um einen kleinen Kerl, der etwas pummelig ist und nichts 
als &Auml;rger macht (Nein! Nicht ich!): Floyd. Epic Interactive bringen mit 
"The Feeble Files" oder halt "Floyd" in der deutschen Version die 
inoffizielle Fortsetzung von Simon heraus. Nat&uuml;rlich wird die Story nicht 
fortgesetzt, aber Adventure Soft haben es geschafft, mit Floyd einen 
w&uuml;rdigen Nachfolger von Simon zu schaffen. Aber der Reihe nach:
Das Spiel wird in einer schicken DVD-H&uuml;lle ausgeliefert. Die Aufmachung ist 
perfekt. Es liegen zwei CDs und ein gedrucktes Handbuch bei. Auf der CD 
befindet sich noch ein Ordner mit der kompletten (englischsprachigen) 
Komplettl&ouml;sung und zehn Speicherst&auml;nden der schwierigsten R&auml;tsel. Aber die 
sollte man nat&uuml;rlich nur im Notfall einsetzen.
Die Installation wird bequem per Installer ausgef&uuml;hrt und belegt schlappe 
550 MByte (ohne Spielst&auml;nde) auf der Festplatte. Man wird am Anfang 
gefragt, welche Sprache man haben will, der Rest funktioniert von allein. 
Achtung: Es wird keine eigene Schublade angelegt, den Feeble-Ordner m&uuml;&szlig;t 
ihr selbst erstellen.
Es ist klar, da&szlig; man bei so einer Datenmenge w&auml;hrend der Installation schon 
mal einen Kaffee trinken kann. Danach findet ihr aber zwei schicke Icons 
auf eurer Workbench. Einmal die 68k- und die PPC-Version (ja, Clickboom, 
die PPC-Version ist gleich mit dabei. ;-)
Der erste Br&uuml;ller meinerseits kam, als ich den Icon anklickte (la&szlig;t euch 
&uuml;berraschen). Ohne lange Voreinstellung geht es auch schon los.

Screenshot:
<IMG SRC="../extra/feeblefiles1.jpg" ALT="Screenshot">

&Uuml;berblick &uuml;ber die Gemeinde

Dieser kurze und informative Abschnitt ist f&uuml;r alle B&uuml;rger gedacht, die 
noch nicht eingehend mit dem Lebensstil vertraut sind, den das Omnibrain 
f&uuml;r sie geschaffen hat. Das Omnibrain erachtet alle Lebensformen als seine 
B&uuml;rger, die es liebt und um die es sich k&uuml;mmert. Dies trifft auch auf die 
nicht assimilierten B&uuml;rger von Klasse-B-Planeten zu, die, obwohl sie noch 
nicht zur Gemeinde geh&ouml;ren, nichtsdestotrotz als Konzern-B&uuml;rger eingestuft 
werden - ob sie nun wollen oder nicht.
Die klassenlose Gemeinde der Omnibrains ist in Ministerien unterteilt, und 
alle B&uuml;rger m&uuml;ssen in einem davon dienen. Als wichtigstes Ministerium gilt 
das Kontrollministerium, welches vom Onmibrain speziell zum Schutz der 
B&uuml;rger gegen verr&auml;terische Kr&auml;fte geschaffen wurde, die von au&szlig;en 
versuchen, das harmonische Leben der Gemeinde zu st&ouml;ren.
Die Mitglieder dieses Ministeriums werden als Vollstrecker bezeichnet, und 
ihnen mu&szlig; zu jeder Zeit Gehorsam und Respekt entgegengebracht werden. 
Weitere Ministerien sind das Vernehmungsministerium (verantwortlich f&uuml;r die 
Befragung verd&auml;chtiger, subversiver Induvidien), das Forschungsministerium 
(welches mit der verantwortlichen Aufgabe betraut ist, das Leben der B&uuml;rger 
durch die Entwicklung immer neuer Bio-Pr&auml;parate begl&uuml;ckend zu gestalten) 
sowie das Ministerium f&uuml;r galaktische Unsicherheit. Letzterem obliegt es, 
die noch nicht assimilierten Randgebiete der Galaxis zu beobachten und zu 
betreuen.
Denken Sie daran, B&uuml;rger: Das Omnibrain ist immer und &uuml;berall. Zu Ihrer 
eigenen Sicherheit und Ihrem Schutz wacht es &uuml;ber Sie Tag und Nacht und 
h&auml;lt so alle b&ouml;sen Einfl&uuml;sse von Ihnen fern.

Screenshot:
<IMG SRC="../extra/feeblefiles2.jpg" ALT="Screenshot">

Lobet und preiset das Omnibrain

Soviel die Einleitung im Handbuch (verspricht ja schon einigen Spa&szlig;), 
wenden wir uns nun dem Spiel zu. Nach dem obligatorischen Einblenden der 
Logos startet das Intro. Ein genialer Film (komplett deutsch!) f&uuml;hrt uns in 
das Geschehen ein und zeigt uns, dass Floyd oben genannte Bestimmungen 
nicht so ganz beherzigt. Allein im Intro verst&ouml;&szlig;t er gegen f&uuml;nf 
Vorschriften!
Bei Feeble Files handelt es sich um ein Point-and-Click-Adventure im Stil 
von Monkey Islands oder eben Simon. Im Gegensatz zu den genannten Spielen 
f&auml;llt auf, da&szlig; am unteren Ende die Inventarleiste sowie die Verben (Geh, 
nimm, benutze...) fehlen. Statt dessen blickt man auf ein fantastisches 
640*480-Fullscreen-Hintergrundbild. Es ist zum gr&ouml;&szlig;ten Teil animiert, und 
die Ger&auml;uschkulisse f&uuml;gt sich optimal in das Gesamtbild ein. Ebenso ist der 
&Uuml;bergang zwischen Filmen und Spiel flie&szlig;end, so da&szlig; auch Zuschauern ein 
Riesenspa&szlig; geboten wird. Aber wie steuere ich jetzt Floyd (Feeble) durch 
die &uuml;ber 80, zum Teil scrollbaren Locations, um hinter das Geheimnis um die 
Rebellion gegen Omnibrain zu kommen?
Ich denke mal, die beste Methode ist es, den ersten Teil einmal gemeinsam 
durchzuspielen. Wer also Wert darauf legt, das Spiel hundertprozentig 
allein durchzuzocken, sollte direkt zum Fazit springen.
Wir befinden uns im Ministerium f&uuml;r galaktische Unsicherheit. Der erste 
Blick f&uuml;hrt uns zuerst ins "Oracle", eine Datenbank und 
Objektverwaltungssystem. Dies ist das Herzst&uuml;ck des Spiels. Von jeder 
Location aus kann man dorthin gelangen, indem man das Zeichen oben links 
anklickt.
Hier sieht man das vorhandene Inventar, man kann speichern, laden oder das 
Spiel verlassen. Es gibt eine Enzyklop&auml;die &uuml;ber alles, was man wissen 
sollte, sie wird automatisch fortgef&uuml;hrt. Eine Statistik z&auml;hlt alle in der 
Mission gebrochenen Vorgaben auf (wie gesagt: jetzt schon f&uuml;nf). Der 
wichtigste Knopf ist der SET-Knopf. Gerade Anf&auml;ngern empfehle ich, hier die 
Objektbezeichnung einzuschalten. F&auml;hrt man mit dem Mauszeiger (der Hand) 
&uuml;ber ein "aktives" Objekt, wird die Bezeichnung angegeben. Standardm&auml;&szlig;ig 
ist dies nicht der Fall. F&uuml;r Adventureneulinge l&auml;&szlig;t sich hier auch die 
sogenannte INFO-Funktion aktivieren mit der man sehen kann, was als 
n&auml;chstes gemacht werden mu&szlig; (in diesem Fall: von der Station herunterkommen 
- aber wie, ohne Fahrzeug?). Wir verlassen das ORACLE und schauen uns mal 
um. Es ist kein Gegenstand aktiv, also gehen wir ins Haus. Daf&uuml;r bewegen 
wir den Zeiger auf die T&uuml;r und dr&uuml;cken die linke Maustaste. Floyd geht in 
diese Richtung, in diesem Fall also ins Geb&auml;ude.
Wow. Wie cool der animiert ist, und selbst in der 68k-Version ziemlich 
ruckelfrei. Sobald unser Held durch die T&uuml;r tritt, beginnt ein kleiner 
Film, der zeigt, wie kaputt alles ist. Wie eingangs schon erw&auml;hnt, sieht 
das alles wirklich spitze aus. Und vor allen Dingen: komplett deutsche 
Sprachausgabe in Topqualit&auml;t! Aber zur&uuml;ck zum Geschehen - als erstes f&auml;llt 
wahrscheinlich jedem die Puppe ins Auge. Die will ich mir mal n&auml;her 
anschauen. Mit dem Mauszeiger dar&uuml;berfahren, rechte Maustaste dr&uuml;cken, und 
die H&auml;nde verwandeln sich in ein Auge  mit Lupe. Linke Maustaste gedr&uuml;ckt, 
schon erfahren wir, da&szlig; es sich um Floyds liebstes Souvenir handelt. Also 
schnell eingesteckt: rechte Maustaste zweimal dr&uuml;cken, und sie verwandelt 
sich in eine nehmende Hand. So funktioniert das ganze also! Durch Dr&uuml;cken 
der rechten Maustaste wird der Zeiger so verwandelt, da&szlig; er die ben&ouml;tigten 
Aktionen darstellt, einfach passende ausw&auml;hlen und mit der linken Taste 
ausf&uuml;hren.
Also wird als n&auml;chstes der "Anrufbeantworter" abgerufen. Hier zeigt sich 
schon die geh&ouml;rige Portion Humor, die in den Dialogen steckt und Dank der 
deutschen Sprachausgabe auch vollends zur Geltung kommt. "B&uuml;rger, du hast 
drei Nachrichten. Sage START zum Abh&ouml;ren, ansonsten sage STOPP. " - "Man, 
du brauchst dringend ein Update." - "Entschuldigung, ich habe nicht 
verstanden. Sage START zum Abh&ouml;ren, ansonsten..." - "S T A R T!". In dieser 
Art sind viele der Dialoge. Echt witzig. Im &uuml;brigen sind zwei der 
Nachrichten von deiner Mutter (Schuldgef&uuml;hle) und eine vom H&auml;ndler, der dir 
sagt, da&szlig; dein Motorrad heute geliefert wird. Und in der Tat: Sobald du 
nach drau&szlig;en kommst, steht dort dein Flitzer. Du kannst hier weg! NEIN. So 
einfach ist Feeble Files wirklich nicht. In dem Schrank findest du einen 
Helm, aber selbst das ist nur die halbe Miete - du brauchst eine 
Motorradjacke. Aber beim besten Willen ist keine zu finden. Stopp. Deine 
Puppe hat eine. Mmmmmh.
Und jetzt kommt eines der ersten R&auml;tsel. Wir schauen uns den Teleporter 
einmal genauer an (Icon mit Lupe): Kaputt. Er k&ouml;nnte die Molek&uuml;le ganz 
sch&ouml;n durcheinanderbringen. Aber ein Versuch ist es wert. Ich gehe ins 
ORACLE und klicke mit rechts solange auf die Puppe, bis der Mauszeiger sich 
in eine Hand mit zwei B&auml;llen (benutze mit) verwandelt. Nachdem ich dies mit 
links best&auml;tige, verwandelt er sich in ein Fragezeichen. Ich verlasse das 
ORACLE und klicke mit dem Fragezeichenmauspointer auf den Teleporter. 
Voila! Feeble legt die Puppe darauf, schaltet an, und die Puppe vergr&ouml;&szlig;ert 
sich. Ich nehme die Jacke, die die Puppe tr&auml;gt und die Puppe selbst in mein 
Gep&auml;ck. Ab jetzt ist es nur noch Formsache. Im ORACLE benutzt man die Jacke 
(Hand mit einem Ball). Feeble zieht sie an, und dann fliegt man weg. 
(Benutze Motorrad). So, ab jetzt seid ihr am Zug, ich will ja auch nicht 
alles allein machen. Aber ihr merkt, da&szlig; die Steuerung zwar am Anfang etwas 
&Uuml;bung ben&ouml;tigt, man dann aber sehr schnell damit zurecht kommt.

Screenshot:
<IMG SRC="../extra/feeblefiles3.jpg" ALT="Screenshot">

Was soll ich sagen? Epic Interactive haben es geschafft und Simon II 
(&uuml;brigens auch von Epic ;-) ) vom Thron gesto&szlig;en. Und alle &uuml;brigen 
Adventures gleich mit. Jetzt h&ouml;re ich die Nightlong-Generation aufst&ouml;hnen. 
Gut, die Grafiken von Nightlong sind in der Tat hochwertiger, aber daf&uuml;r 
mu&szlig; man sich auch auf einem 68k-Rechner mit einem kleinen Fenster 
zufriedengeben und f&uuml;r eine PPC-Version extra in die Tasche greifen. Und 
witziger finde ich nun wirklich Floyd. Ich gebe zu, da kann man sich 
streiten, also einigen wir uns zwischen den beiden auf ein Unentschieden. 
Aber Floyd (The Feeble Files) lohnt sich allemal. Und nicht nur f&uuml;r Leute, 
die Monkey Island, Simon und Co. n&auml;chtelang gezockt haben (die kommen 
sowieso nicht um Feeble herum), sondern f&uuml;r alle, die mal wieder ein 
richtig gelungenes St&uuml;ck Software in den H&auml;nden halten wollen. Und der 
Support ist auch klasse. In meiner Version lie&szlig;en sich die Videosequenzen 
nicht beenden. Ich habe Thomas Steiding von Epic daraufhin angemailt, und 
der teilte mir mit, da&szlig; ein Patch hierf&uuml;r schon in der Mache ist (ich habe 
eine erste Betaversion des Patches - es geht!). Aber nun mu&szlig; ich Schlu&szlig; 
machen, meine Grafikkarte lechzt nach den sch&ouml;nen Bildern, und meine Boxen 
freuen sich auf den tollen Sound und die wahnsinnige Sprachausgabe. Einzig 
mein Hirn ist an manchen Stellen etwas &uuml;berfordert, aber f&uuml;r diejenigen, 
die absolut nicht weiterwissen, gibt es ja auch noch die Hilfefunktion 
(Infos zur weiteren Vorgehensweise), zehn Spielst&auml;nde der schwierigsten 
R&auml;tsel (nat&uuml;rlich gel&ouml;st) sowie eine Komplettl&ouml;sung (nur englisch - hurra, 
ich habe etwas Negatives gefunden). Also &uuml;ber Motivationsprobleme kann sich 
niemand beschweren. Zumal es immer witzige Einf&auml;lle wie Zwischenspiele, 
Cutscenes und Sachen wie Personenwechsel gibt. Da spielt man dann zum 
Beispiel noch einen  Roboter und kann mit F7 zwischen den Charakteren 
wechseln. Knifflig. Ihr seht: der Kauf lohnt sich. Und an alle 
Softwarepiraten ein mahnendes: B&uuml;rger, denken Sie immer daran: Das 
Omnibrain ist immer und &uuml;berall!

Screenshot:
<IMG SRC="../extra/feeblefiles4.jpg" ALT="Screenshot">

J&uuml;rgen Theiner &lt;Juergen.Theiner@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
