<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0D - Scalos Filetypes Plugin</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00F8.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00F7.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00F9.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=155 HEIGHT=25 SRC="../images/_workshop_.gif" ALT="[Workshop]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00F8.html">Scalos Filetypes Plugin</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00ED.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00EE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00EF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00F0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00F1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00F4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00F8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00F9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00FC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00FE.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00FF.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Scalos Filetypes Plugin - Erkennung auf Doppelklick</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Am Amiga gibt es mit Scalos ein neues Gef&uuml;hl des
Arbeitens. Die von den NewIcons und DOpus gewohnte Filetype-Erkennung ist
auch hier implementiert. Doch leider ist das entsprechende guide-File nicht
gerade anleitend. Es hinterl&auml;&szlig;t doch eine ziemliche
Leere.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Um den Mechanismus des automatischen Erkennens des File-Typs zu
implementieren, braucht es das <TT>filetypes.lha</TT>-Archiv aus der
Download-Sektion der <A
HREF="http://www.aliendesing.net/programs/scalos/indes.hmtl">Scalos-Site</A
>.<BR>

<BR>Das <TT>filetypes.plugin</TT>, das n&ouml;tig ist, damit die Erkennung
auch wirksam wird, geh&ouml;rt nach <TT>Plugins/OOP</TT> im
Scalos-Verzeichnis, und die entsprechenden Preferences f&uuml;r Scalos legt
man wohl sinnvollerweise im <TT>Sys:Prefs</TT> ab, dort geh&ouml;rt dann
auch das <TT>FileTypesPrefs</TT> hin, das im <TT>filetypes.lha</TT>-Archiv
enthalten ist. Ein entsprechendes Icon mu&szlig; man sich aber noch
basteln. Das ganze Paket ist in einem Beta-Stadium, nichtsdestotrotz
verdingt es sich hier schon seit L&auml;ngerem, ohne Probleme zu
machen.<BR>

<BR>Es w&auml;re nun einfach, zu erwarten, bei einem Doppelklick auf ein
Icon tut sich was. Nun, es tut sich schon was, solange man ein echtes Icon
vor sich hat und nicht ein DefaultIcon. Die FileType-Erkennung macht ja
auch nur dann Sinn, wenn ein File kein Icon dabei hat und eines per default
ausgew&auml;hlt werden soll. Abh&auml;ngig vom Typ sollte es ausfallen und
dementsprechend das DefaultTool im Icon gesetzt werden. Genau dieses macht
dieses Plugin.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Extensions sind nicht alles</B></H3>&nbsp;

<BR>Eine M&ouml;glichkeit, den Typ eines Files zu erkennen, liegt darin,
einfach die Extension nach dem Punkt im Filenamen auszuwerten und daraus
die ben&ouml;tigten Informationen abzuleiten. Da&szlig; dies in einem
System, das gl&uuml;cklicherweise ohne die Notwendigkeit nach Extensions
auskommt, nicht sinnvoll ist, sollte auf der Hand liegen.<BR>

<BR>Nat&uuml;rlich kann man auch hier die Erkennung so konfigurieren,
da&szlig; nach Extensions ausgew&auml;hlt wird, aber dieses Plugin ist viel
f&auml;higer: es scannt nach eingegebenen Kriterien die Files durch, sieht
daran, welchen Typ das File hat und w&auml;hlt dementsprechend das
zugeh&ouml;rige DefaultIcon aus <TT>ENV:Sys</TT> aus. In den ToolTypes
dieses Icons steht dann, welches DefaultTool ausgef&uuml;hrt werden soll
und welche Optionen dabei zur Anwendung kommen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Was nemma' denn nun?</B></H3>&nbsp;

<BR>Um sich nicht alle DefaultIcons und dazugeh&ouml;rige Parameter selber
machen zu m&uuml;ssen, wird in der Anleitung darauf hingewiesen, da&szlig;
ein DefIcons-Brainfile aus der <TT>NewIcon</TT>-Distribution eingebunden
werden kann. Dieses hat dann auch die grundlegende Funktionalit&auml;t, um
die wichtigsten Typen der Files zu unterscheiden.<BR>

<BR>Dieses Importieren ist leicht geschehen und damit sieht das
Prefs-Program f&uuml;r das Scalos-FileTypes-Plugin schon ordentlich
gef&uuml;llt aus:<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="../images_0D/filetypespreferences.gif"><IMG WIDTH=375 HEIGHT=251 ALT="[Filetypes Voreinstellungen]" SRC="../images_0D/filetypespreferencestn.gif" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=375>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Echte LhA-Erkennung in den Preferences
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Hier ist wohl auch schon die wichtigste Anwendung der
Dateitypenerkennung neben dem stupiden Betrachten irgendwelcher
obsz&ouml;nen Bilderl per Doppelklick, weil nur mehr eine Hand frei ist.
Ein LhA-Archiv gilt es aufzulisten, zu testen oder zu entpacken.<BR>

<BR>In den Preferences nun gibt es auf der linken Seite verschiedene
Ebenen, in die die Typen eingeteilt werden. Als oberste Hierarchie: es ist
ein File. Ein Project ist der Standardfall f&uuml;r Files ohne Icon. Und
schlie&szlig;lich als dritte Haupthierarchie ist die Unterscheidung, ob das
File ASCII-Texte enth&auml;lt (darunter fallen eben alle Text-Dateien,
HTML-Code, C-Sourcen, etc.) oder vielleicht irgendwelche nicht
entzifferbare Sachen (wie Bilder, Archive, Fonts, Keyfiles, etc.). Jedem
dieser Typen ist ein DefaultIcon zugeordnet, wie im unteren Teil zu
sehen.<BR>

<BR>Um durch diese Hierarchie zu einem File zu finden, sind jedem Typ
verschiedene Auswahlkriterien zugerodnet. Diese sind rechts in der Tabelle
angegeben und hier wird auch die M&auml;chtigkeit dieser Erkennung
ersichtlich. Nicht nur, da&szlig; nach einzelnen Attributen ausgew&auml;hlt
werden kann, es ist auch eine logische Verkn&uuml;pfung (ODER und UND)
mehrerer Kriterien m&ouml;glich.<BR>

<BR>Die M&ouml;glichkeiten, die sich da stellen:<BR>

<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
<TR VALIGN=TOP ALIGN=LEFT><TD>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Match - an welcher Stelle im File tritt welche Bytekombination auf?<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Search - irgendwo im File steht doch wohl ein bestimmter String?<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> FileSize - die Gr&ouml;&szlig;e kann auch ausschlaggebend sein, gr&ouml;&szlig;er, kleiner, gleich, etc.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> FileName - die gewohnten Pattern k&ouml;nnen hier zur Extension-Erkennung mi&szlig;braucht werden.<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Protection - die ProtectionBits der AmigaFiles als Einschr&auml;nkungsm&ouml;glichkeit<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> FileType - File, Verzeichnis, Link oder Partiotion?<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Misc - und noch ein wenig mehr...<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> OR - logische Verkn&uuml;pfung<BR>
</TD></TR></TABLE>&nbsp;

<BR>Es k&ouml;nnen auch mehrere Kriterien pro DefaultIcon eingegeben
werden, die sind dann UND-verkn&uuml;pft, setzt man ein ODER zwischen die
Zeilen, m&uuml;ssen nicht mehr alle Kriterien erf&uuml;llt werden.<BR>

<BR>Um nun zu unserer LhA-Erkennung zu kommen, ist die Erkennung durch die
Hierarchie n&ouml;tig. Das Archiv ist ein File, also geh&ouml;rt zur
Hierarchie namens <TT>FILE</TT> das Kriterium <TT>FILETYPE/FILE</TT>. Die
n&auml;chste Stufe ist das <TT>Project</TT>. Ist es, also
<TT>Misc/TRUE</TT> auf der rechten Seite. Und wieder eine Hierarchie weiter
kommen wir zu den Archiven. Diese haben nun in der Konfiguration, wie das
importierte BrainFile aus den NewIcons-Archiven sich gibt, kein Kriterium.
Vielmehr aber die untergeordneten Icons, wie <TT>lharc</TT>. Ein LhA-File
zeichnet sich dadurch aus, da&szlig; ab Position 2 im File die Zeichenkette
&quot;-lh&quot; steht. Danach kommt eine Ziffer, die die St&auml;rke des
Packalgorithmus angibt und wieder ein Minuszeichen. Dieses steht dan an
sechster Stelle. Daraus ergibt sich dann die entsprechende Mischung aus
Kriterien, die zur erfolgreichen Erkennung n&ouml;tig sind: <TT>MATCH/2
-lh</TT> und <TT>MATCH/6 -</TT>. Damit schon wei&szlig; Scalos, da&szlig;
es mit einem LhA-File zu tun hat.<BR>

<BR>In dieser Unterhierarchie sind auch noch andere Archive zu finde, wie
lzx, arj oder zip. Sollte keines davon zutreffen, wird eben das DefaultIcon
zu <TT>archive</TT> angezeigt.<BR>

<BR>Ein anderes sch&ouml;nes Beispiel f&uuml;r Hierarchien sind die
IFF-Files: Es gibt die <TT>IFF</TT>-Hierarchie, die sich dadurh
kennzeichnet, da&szlig; die ersten vier Buchstaben &quot;FORM&quot; lauten
und das sechzehnte Byte ein Nullbyte ist. Dementsprechend die Kriterien:
<TT>MATCH/0 FORM</TT> und <TT>MATCH/ 10 \0</TT>. 16 in hexadezimal ist 10
und &quot;\0&quot; ist die Angabe des Bytes in ASCII-Ziffern, eben ein
Nullbyte.<BR>

<BR>Alle Eintr&auml;ge, die unter dieser Hierarchie gemacht werden, haben
nun schon mal die Voraussetzung, da&szlig; die File alle IFF-Files
darstellen. Die Frage ist nur noch, welche. Das steht dann in den
Unterhierarchien, wie z.B. f&uuml;r ILBM: <TT>MATCH/8 ILBM</TT>, oder
f&uuml;r 8SVX-Files: <TT>MATCH/8 8SVX</TT>. Das NewIcons-Brainfile ist zwar
relativ vollst&auml;ndig, aber irgendwie ziemlich unaufger&auml;umt.<BR>

<BR>Die Einschr&auml;nkung der Auswahl kann auch negiert werden, da&szlig;
das entsprechende File nur dann in diese Hierarchie pa&szlig;t, wenn dieses
eine Kriterium nicht zutrifft, weiters ist eine Unterscheidung der
Gro&szlig;- und Kleinschreibung m&ouml;glich.<BR>

<BR>In Zeiten von GhostScript sind auch PDF-Dateien f&uuml;r den Amiga kein
Hindernis mehr. Sie k&ouml;nnen ebenso leicht erkannt werden: <TT>MATCH/0
%PDF</TT>.<BR>

<BR>Leider hat das Prefs-Programm noch ein paar Bugs; so schlie&szlig;t es
sich bei Klick auf Save oder das CloseGadget nicht, sondern erst durch
einen beherzten Klick aufs Cancel-Gadget. Die Einstellungen bleiben aber
dennoch erhalten, wenn zuvor abgespeichert wurde.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Und was stellen wir nun damit an?</B></H3>&nbsp;

<BR>Ist unter Scalos nun die NewIcons.library am Werken, so wird nach einem
sch&ouml;nen Reset, der allerdings &auml;rgerlicherweise auch n&ouml;tig
ist, wenn man in den FileTypePrefs was &auml;ndert, der Aufbau der icons in
einem Fenster etwas verz&ouml;gert, da sich der gute, brave Amiga erst
durch die Kriterien suchen darf und dann erst entscheiden kann, welches
Icon er nun f&uuml;r die Files darstellt.<BR>

<BR>Normalerweise kann man jedem File ein DefaultTool zuweisen, wenn es ein
Icon hat. Hier geht es aber um die Files, die kein Icon ihr eigen nennen
und deshalb DefaultIcons verpasst bekommen. Von diesen gibt es aber
f&uuml;r jeden Typ nur eines (eben in <TT>ENV:Sys</TT>) und deshalb ist
auch f&uuml;r jedes File des gleichen Typs dann das Icon mit allen
Tooltypes das Gleiche.<BR>

<BR>F&uuml;r diverse Bilder zum Beispiel wird man als DefaultTool wohl ein
Anzeigeprogramm einstellen, f&uuml;r verschiedene Archiver, die oft nur als
CLI-Pgramm existieren, tut man sich da aber schwer.<BR>

<BR>Im FileTypes-Archiv gibt es daf&uuml;r ein sch&ouml;nes Zusatztool
namens <TT>DoCommand</TT>, da&szlig; schleunigst ins
<TT>Tools</TT>-Verzeichnis von Scalos geh&ouml;rt. Denn dieses kleine Tool
macht dann die Feinheiten aus.<BR>

<BR>Aus den ToolTypes des DefaultIcons heraus gestartet, erlaubt es die
interaktive Beeinflussung und Ausf&uuml;hrung von anderen Tools, die
wiederum so ihre Sachen mit dem urspr&uuml;nglichen File anstellen
k&ouml;nnen.<BR>

<BR>Hier ist es dann m&ouml;glich, bei einem LhA-File nachzufragen, ob der
Benutzer es anschauen, testen oder entpacken m&ouml;chte. Bei einem
Postscript- oder PDF-File k&ouml;nnte die Auswahl zum Beispiel sein, ob es
am Monitor betrachtet werden will oder der Drucker ausspucken soll.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><A HREF="../images_0D/tooltypes.gif"><IMG WIDTH=322 HEIGHT=181 ALT="[Tooltypes Fenster]" SRC="../images_0D/tooltypestn.gif" BORDER=0></A></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=322>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
DoCommand in Anwendung
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Das DefaultTool ist nat&uuml;rlich <TT>Scalos:Tools/DoCommand</TT> und
in die ToolTypes schriebt man hinein, was das Tool mit dem File machen
soll. hier gibt es im entsprechenden Requester dann eben vier Buttons mit
&quot;Extract&quot;, &quot;List&quot;, &quot;Test&quot; und das
obligatorische &quot;Cancel&quot; f&uuml;r die Verlegenheitsklickerei.<BR>

<BR><TABLE ALIGN=CENTER BORDER=0 CELLPADDING=0 CELLSPACING=2>
<TR><TD ALIGN=CENTER><IMG WIDTH=315 HEIGHT=97 ALT="[Requester nach Doppelklick]" SRC="../images_0D/requester.gif"></TD></TR>
<TR><TD ALIGN=CENTER><TABLE BORDER=0 CELLPADDING=3 CELLSPACING=0 WIDTH=315>
<TR><TD ALIGN=LEFT BGCOLOR="#EEEEEE"><FONT SIZE="-1" COLOR="#000000">
Die Auswahlm&ouml;glichkeiten im Detail
</FONT></TD></TR></TABLE></TD></TR></TABLE>&nbsp;

<BR>Die einzelnen Befehle sind in der Dokumentation zum FileTypes-Archiv
sogar erkl&auml;rt. <TT>ASKCOM</TT> legt fest, wieviele Gadgets im
Requester auftauchen sollen und wie sie beschriftet sind. Dabei gibt es
keine Mengenbeschr&auml;nkung. Mit <TT>COMMAND</TT> legt man den Befehl zum
ersten Gadget fest. Innerhalb des Argumentes zu diesem Tooltype k&ouml;nnen
bestimmte Sondersequenzen verwendet werden, die bewirken, da&szlig; an
deren Stelle der Filename (%f), das Ergenis eines Auswahlrequester nach
einem Verzeichnis (%pd) oder einem File (%pf) und anderes eingesetzt wird.
Damit l&auml;&szlig;t sich im Beispiel des LhA sch&ouml;n das
Zielverzeichnis des Entpackvorganges angeben. <TT>FILE</TT> bedeutet das
Gleiche, wie es das auch in anderen ToolTypes tut, es legt die Art der
Ausgabe fest.<BR>

<BR>F&uuml;r die weiteren Auswahlm&ouml;glichkeiten braucht man nur diese
beiden ToolTypes entsprechend wiederholt und angepa&szlig;t angeben. Zu
beachten ist dabei, da&szlig; die ToolTypes f&uuml;r das erste Kommando
ohne Ziffer am Ende zu sein haben. Alle weiteren werden einfach
durchnumeriert.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Was einzig st&ouml;rt an dem Ganzen ist, da&szlig; ein Ghostscript, aus
den ToolTypes von DoCommand heraus gestartet, gandenlos semmelt. Denn mit
4kB Stack ist er nunmal nicht zufrieden. Es waere nun ein einfaches, in den
ToolTypes im entsprechenden Gadget die Gr&ouml;&szlig;e des Stacks
hinaufzusetzen. Scalos aber verhindert das effizient, denn in dem Plugin,
das f&uuml;r die Anzeige der iconinformation zust&auml;ndig ist, kann kein
Wert f&uuml;r einen Stack eingestellt werden. Schlecht.<BR>

<BR>Eine M&ouml;glichkeit besteht darin, mit der Original-Workbench zu
booten, und in diesem DefaultIcon den Wert f&uuml;r den Stack
hinaufzusetzen. Doch leider hilft das auch nicht, denn das ausf&uuml;hrende
Programm, in diesem Fall der Ghostscript, bekommt trotzdem nur 4kB an Stack
zugewiesen und semmelt weiter. Hier also geh&ouml;rt noch einiges
&quot;optimiert&quot;.<BR>

<BR>Ansonsten aber ist diese FileTypen-Erkennung eine feine Sache und
l&auml;&szlig;t sich hervorragend im t&auml;glichen Gebrauch einsetzen,
wenn sie denn einmal konfiguriert ist.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00F8.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.aliendesign.net/programs/scalos/index.html">Scalos</A> - Die Homepage der Programmierer<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/filetypespreferences.gif">Filetypes Voreinstellungen</A> (GIF; 21K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/tooltypes.gif">Tooltypes Fenster</A> (GIF; 24K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/requester.gif">Requester nach Doppelklick</A> (GIF; 1K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00F7.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00F9.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
