<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0D - Interview</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00FF.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00FE.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0100.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=44 HEIGHT=25 SRC="../images/_etc_.gif" ALT="[Etc]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00FF.html">Interview</A> | <A HREF="0x0100.html">Vinyl des Monats</A> | <A HREF="0x0101.html">Amiga Forever</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00ED.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00EE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00EF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00F0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00F1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00F4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00F8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00F9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00FC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00FE.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00FF.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Interview - mit Laszlo T&ouml;r&ouml;k</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">[von Oliver Gerler]</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Als Sch&ouml;pfer von PalomAVI, MooVId und PIV-MooVId,
m&ouml;chtest Du Dich erst Mal vorstellen?<BR>

<BR><B>LT:</B> Ich bin 24, im Moment arbeite ich in einer B&uuml;cherei und
studiere Informatik. Ich habe meinen ersten Amiga 1992 gekauft und besitze
im Moment 5 Amigas.<BR>

<BR><B>AS:</B> Welche Ausr&uuml;stung verwendest Du zum Programmieren?<BR>

<BR><B>LT:</B> Ich habe f&uuml;r die Entwicklung meiner Programme mehrere
verschiedene Amigas ben&uuml;tzt. Ich habe mit einem A1200/030-50
angefangen, dann hatte ich einen A1200/040-40, sp&auml;ter einen A4000/030
mit PicassoIV, danach einen A4000 mit A3640 und jetzt einen A4000 mit
060/50 (nat&uuml;rlich mit PicassoIV). Zum Testen verwende ich auch die
Rechner von einem Freund (verschiedene Amigas angefangen von einem nackten
A1200/CD32 &uuml;ber A2000 bis zu A4000)<BR>

<BR><B>AS:</B> Wie bist Du auf die Idee f&uuml;r diese Programme
gekommen?<BR>

<BR><B>LT:</B> Ich habe 1994 oder '95 von einem Freund, der PC User ist,
ein paar sogenannte &quot;Multimedia&quot; CD-ROMs bekommen. Allerdings war
der einzige AVI Player, den ich f&uuml;r den Amiga gefunden habe (mit
Ausnahme des unbrauchbar langsamen Xanim), der TapAVI. Er war f&uuml;r
kleine Animationen toll, aber er war am 030/50/AGA relativ langsam. Also
habe ich mir gedacht, ich kann einen besseren schreiben und habe 1996
angefangen, daran zu arbeiten. Als erstes habe ich die AVI-Routinen
eingebaut, dann MOV, und 1997 habe ich angefangen, eine Version extra
f&uuml;r die PicassoIV zu programmieren.<BR>

<BR><B>AS:</B> Wie bist Du an die Lizenz f&uuml;r die Intel-Codecs
gekommen?<BR>

<BR><B>LT:</B> Das ist eine gute Frage, weil mein Intel Indeo Support Code
auf dem Xanim Indeo Code basiert. Nachdem ich die Umsetzung f&uuml;r Epic
Marketing fertig hatte, habe ich Intel (Intel UK, um genau zu sein) um die
Lizenz gebeten. &Uuml;brigens hat Epic eine alte Version von MooVId
f&uuml;r die Animationen auf ihren CD-ROMs verwendet, und sie werden MooVId
Professional - eine billige kommerzielle Version von MooVId - vertreiben,
wenn ich damit feritg bin, was hoffentlich in ein paar Wochen sein wird.
Intel UK war also einverstanden, mir die Lizenz zu geben, und ich sollte
sie eigentlich bald kriegen. Allerdings war das vor einem halben Jahr, und
ich habe die Lizenz noch immer nicht bekommen. Jetzt habe ich also einen
legalen Decoder ohne Lizenz, und ich m&ouml;chte warten, bis ich sie
kriege, bevor ich die kommerzielle Version ver&ouml;ffentliche, damit ich
sp&auml;ter deswegen keine Schwierigkeiten habe.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Was waren die Hauptprobleme, die Du beim Programmieren
hattest?<BR>

<BR><B>LT:</B> Hmmmm... Nur die fehlenden oder unbrauchbaren
AVI/MOV-Formatbeschreibungen oder Codec-Dokumentationen, da ich MooVId ohne
Vorgabe programmiert habe und es nicht auf Xanim basiert. Ich hatte
&uuml;berhaupt keine Probleme, die mit dem Amiga zu tun hatten (au&szlig;er
diesem wirklich seltsamen Bug, den ich in Kickstart 3.0 gefunden habe),
weil die originalen C= Entwicklerunterlagen wirklich gut sind (Ich meine
nat&uuml;rlich die AutoDocs). Aber wenn noch jemand einen neuen AVI/MOV
Player einfach so ohne Vorgaben schreiben will, empfehle ich VIEL Geduld.
;)<BR>

<BR><B>AS:</B> In welche Richtungen werden Deine Programme gehen?<BR>

<BR><B>LT:</B> Wie gesagt, es wird bald eine billige kommerzielle Version
von MooVId geben, und sp&auml;ter will ich noch ein paar Video/Audio Codecs
hinzuf&uuml;gen. Ein VIVO Player (vielleicht auch RealVideo) ist geplant,
aber da habe ich leider wieder ein Problem mit den Lizenzgeb&uuml;hren...
(Leider will AI nichts linzenzieren... hmm :((( ) Und einen MPEG1 Video
Player plane ich auch noch. Schlie&szlig;lich m&ouml;chte ich noch eine
PPC-Version von MooVId machen.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Wof&uuml;r steht VHI und welche Ziele hast Du Dir damit
gesetzt?<BR>

<BR><B>LT:</B> VHI steht f&uuml;r Video Hardware Interface (was nicht
unbedingt der endg&uuml;ltige Name ist), und es wird ein Standard f&uuml;r
AmigaVideoDigitizer werden (wie VLab/Paloma, etc.). Es wird alle Karten mit
den gleichen Funktionsaufrufen steuern k&ouml;nnen (wie AHI). Vielleicht
wird es auch Echtzeitkompression beinhalten (auf DCT basierend und dem H263
&auml;hnlich), die es f&uuml;r Videokonferenzen brauchbar machen wird.<BR>

<BR><B>AS:</B> Wer sind die Leute, die an VHI arbeiten?<BR>

<BR><B>LT:</B> Die Idee kam von Felix Schwarz (dem Autor von Ultraconv),
und mein Freund Stephen Fellner hat sich uns vor ein paar Tagen
angeschlossen. (Er hat einiges an schnellem DCT-Zeug programmiert und hat
einen halbfertigen MPEG Player - 68k - der der schnellste MPEG Player
f&uuml;r Amiga sein wird.) Wir sind also nur ein paar Leute...<BR>

<BR><B>AS:</B> Hast Du irgendwelche Pl&auml;ne, mit AHI und P96 oder so zu
arbeiten?<BR>

<BR><B>LT:</B> Die Unterst&uuml;tzung f&uuml;r VideoDigitizer am Amiga ist
nicht gerade gut. Es gibt nur einen sogenannten &quot;offiziellen&quot;
Standard, die Emulation der vlab.library. Wir dachten also, es w&auml;re
besser, unseren eigenen Standard zu schreiben, mit dem wir eine h&ouml;here
Leistung erzielen und alle F&auml;higkeiten der Karten ausn&uuml;tzen
k&ouml;nnen.<BR>

<BR><B>AS:</B> Hast Du eine Vorstellung, wann VHI herauskommt?<BR>

<BR><B>LT:</B> Hmmm... Ich denke, innerhalb von ein paar Monaten. Ich will
mich auf nichts Konkreteres festlegen, da wir ziemlich sicher noch ein paar
Probleme haben werden. Zum Beispiel ist der Paloma Treiber in P96 noch
nicht fertig, und wir haben nur begrenzte Dokumentation &uuml;ber die VLAB
Karten. Und wir brauchen noch ein bi&szlig;chen, um Unterst&uuml;tzung
f&uuml;r die alte Hardware hinzuzuf&uuml;gen.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><B>AS:</B> Was h&auml;ltst Du von der aktuellen Situation um Amiga
Inc., QNX und all die anderen?<BR>

<BR><B>LT:</B> Ich war letztes Jahr in K&ouml;ln und habe die QNX Demo
gesehen. Mit Ausnahme von ein paar Abst&uuml;rzen war es gut, aber leider
eben kein Amiga und viel zu weit vom AmigaOS entfernt. Es war mehr wie ein
Klon von Unix/Linux. Au&szlig;erdem kann QNX mit den alten 68k Rechnern
nichts anfangen. Ich glaube, AmigaOS ist noch immer das beste
Betriebssystem (mit nur ein paar kleinen Problemen), und ich verstehe
nicht, wieso AI zu QNX wechseln will. Was AI angeht... hmm... schwere
Frage... Ich denke, sie M&Uuml;SSEN einfach etwas f&uuml;r Amiga tun, zum
Beispiel ein paar Video Codecs oder so lizenzieren. Ein Programmierer
allein kann da nichts machen, weil die Lizenzgeb&uuml;hren so hoch sind.
Und ich warte noch immer auf das AmigaOS 3.5, aber ich bin da etwas
skeptisch.<BR>

<BR><B>AS:</B> Und zum Schlu&szlig;: Wann hast Du vor, den Fehler mit den
Bildern auf Deiner Homepage zu korrigieren? ;-)<BR>

<BR><B>LT:</B> Hehe... bald ;) Aber zuerst sollte ich noch den MooVId 1.0
fertigkriegen ;)<BR>

<BR><B>AS:</B> Danke f&uuml;rs Interview.<BR>

<BR>&Uuml;bersetzt von Milena Popova &lt;milena@via.at&gt;.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00FF.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD>

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/interview.txt">Original-Interview</A> (TXT; 5K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00FE.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x0100.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
