<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0D - Paloma</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00FD.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00FC.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00FE.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=100 HEIGHT=25 SRC="../images/_special_.gif" ALT="[Special]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00FC.html">Paloma</A> | <A HREF="0x00FD.html">Paloma</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00ED.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00EE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00EF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00F0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00F1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00F4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00F8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00F9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00FC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00FE.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00FF.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Paloma - Dabeisein ist alles</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Fensehen kann man bald einmal, das geht auch auf PCs,
wenn auch bei Weitem nicht so genial einfach und sch&ouml;n und vor allem
schnell und skalierbar und unabh&auml;ngig von Prozessor-Leistungen wie mit
der Paloma Picasso. Doch ich will mehr, ich will einen Videorecorder. Und
wir haben einen.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>PalomAVI</B></H3>&nbsp;

<BR>Es tat ja fast weh, dieses Programm als reinen Viewer im anderen
Paloma-Artikel zu verheizen, denn die F&auml;higkeiten gehen weiter: Per
'+' und '-' kann man einfach den Sender w&auml;hlen und per Space wird in
der aktuellen PIP-Gr&ouml;&szlig;e in das beim Start oder per Tooltype
angegebene File der VideoStream hineingespeichert. Solange, bis man Escape
dr&uuml;ckt, dann geht das Spiel von vorne los.<BR>

<BR>Was da gespeichert wird, ist im Grunde ein sch&ouml;nes, gutes AVI-File
im Cirrus AkkuPak-Format, das nun zwar nicht jeder lesen kann (in der Doku
ist eine &uuml;bersichtliche Aufstellung, auf welchen System was f&uuml;r
Player und M&ouml;glichkeiten existieren), daf&uuml;r ist es schnell, denn
es ist das Paloma-interne Format; dadurch werden keine Umrechnungen
f&auml;llig. PIV-MooVId, der AVI/MOV/QT-Player vom gleichen Autor, kann
diese Files aber nat&uuml;rlich ohne Probleme auch wieder schnell
abspielen. In PalomAVI gibt es weiters die Unterst&uuml;tzung f&uuml;r
Intel Indeo, das sich als YUV9 in ihrer technischen Bezeichnung in den
ToolTypes einstellen lassen, sowie YUV2, wie die gesamte Konfiguration
&uuml;ber ToolTypes abl&auml;uft. F&uuml;r eine erste Release ist das ja
schon mal wohltuend abhebend von dieser ewigen
Kommandozeilen-Optionen-Werferei.<BR>

<BR>In dieser Version, k&ouml;nnen direkt Files aufgezeichnet werden, ohne,
da&szlig; ein R&uuml;ckspulen, framegenaues (Re-)Positionieren oder
&auml;hnliches n&ouml;tig w&auml;re. So kann man einfach aus dem laufenden
Video oder eben auch Tuner-Signal der Paloma die Bilder bannen, die man
haben m&ouml;chte. Abspielen gestaltet sich dank des PIP-Features der
PicassoIV dann denkbar einfach.<BR>

<BR>Das Ganze stellt nun nat&uuml;rlich eine ziemliche HighEnd-Anwendung
dar, dementsprechend sollte auch die Ausstattung des Amigas sein, damit da
was Ordentliches herauskommt. Als unterste Grenze ist wohl der '040er bei
25 MHz anzusehen, aber f&uuml;r ernsthaftes Arbeiten ist das bei Weitem zu
wenig.<BR>

<BR>Mit dieser Konfiguration und dem zus&auml;tzlichen Flaschenhals des
langsamsten RAM-Interfaces (ja, es ist nicht schwer, daraus auf einen armen
4000er mit A3640 zu schlie&szlig;en, und ihr habt recht), schafft man
gerade mal 8 Frames pro Sekunde bei einer Aufl&ouml;sung von 400x300
Pixeln. Interessanterweise ist es dabei unerheblich, ob ich ins RAM sample
oder auf die langsame IDE-Platte. Macht nicht viel Unterschied, denn einmal
hab ich 7 Frames, dann wieder 8. Alles in allem also ein
Schneckentempo.<BR>

<BR>Doch dem ist nicht so, denn bedenke: die Hardware, auf der das
l&auml;uft, ist mittlerweile 7-8 Jahre alt, und wo bittesch&ouml;n, war vor
7 Jahren in anderen Welten ein Videostream am Screen zu sehen? Klar, die
Paloma ist noch nicht einmal richtig ein Jahr alt, aber da kommt ja schon
das N&auml;chste auf uns zu: welche heutige Hardware pa&szlig;t noch zu
einem 8 Jahre altem System. Gut, ich schweife wieder einmal ab, hier
&ouml;ffnen sich scheunentorgleich die philosophischen Abgr&uuml;nde...<BR>

<BR>Weiters verlangsamend wirkt nat&uuml;rlich das FFS, das nach jedem
Schreibzugriff brav die Bitmap der Partition wieder auf den aktuellen Stand
bringt. Das bremst, deshalb empfiehlt der Autor in der Dokumentation in
Form eines aufger&auml;umten <TT>.guide</TT>-Files zumindest auf der
Partition, auf die man samplen will, ein AFS oder PFS zu installieren, da
die ein anderes Verhalten beim Updaten der Bitmap zeigen und somit
schneller auf die Platte speichern k&ouml;nnen.<BR>

<BR>Geschwindigkeit und reine Rechenleistung ist nunmal f&uuml;r
Videoanwendungen die Voraussetzung und jetzt wissen wir endlich, wof&uuml;r
wir einen 060er brauchen k&ouml;nnen: der bei mir in der
Standardkonfiguration mit gleich langsamer IDE-Platte gleich einmal 11 fps
zusammenbrachte.<BR>

<BR>Ahh, ich h&ouml;re schon die ersten motschgern, da&szlig; das nun auch
nicht wirklich das Wahre ist. Schon richtig, denn erst durch intensiven
Einsatz von HighEnd, wie wom&ouml;glich einer schnellen SCSI-Platte, dazu
FPS oder PFS drauf, legt das Ganze noch eine Geschwindigkeitspotenz zu. Bei
gen&uuml;gendem RAM kann nat&uuml;rlich auch dorthin gesampelt werden. Das
4000er-eigene RAM ist dabei tunlichst zu meiden. F&uuml;r StatusBits, auf
die man so manche Mail sicher minimieren k&ouml;nnte, mag es ja noch
schnell genug sein, aber bei VideoAnwendungen steigt es ganz schnell
aus.<BR>

<BR>Version 0.4 bietet nun diese M&ouml;glichkeiten, ich bin schon
neugierig, was in den n&auml;chsten Releases so alles sein wird, denn es
wird schneller werden - sagt der Autor. Derzeit ist au&szlig;erdem kein
Pieps zu h&ouml;ren, soll hei&szlig;en, die Audiounterst&uuml;tzung ist
noch nicht eingebaut. Geplant sind direkte Unterst&uuml;tzung f&uuml;r die
Concierto und die Toccata und sinnvollerweise AHI. Doch auch schon mit
dieser Software kann man die lieben Leute ganz sch&ouml;n ins Staunen
versetzen, wobei nat&uuml;rlich der Hardwareskalierer des PIPs die
Hauptarbeit verrichtet. Sollte in zuk&uuml;nfitgen Versionen
tats&auml;chlich auch noch eine MPEG- oder QuckTime-Option dazukommen,
w&auml;re das das sprichw&ouml;rtliche T&uuml;pfelchen auf dem i, zumal der
Autor genau dahin denkt, aber leider fehlt es noch an der passenden
PPC-Karte.<BR>

<BR>Ich machte meine ersten Tests noch unter einer Uraltversion von
Picasso96, ich glaube, es war v1.38 oder v1.39 oder irgendwo in der Gegend,
bei der alles einwandfrei funktionierte, doch dann machte ich ein Update
auf die aktuelle v1.43b und es funktioniert auch noch immer alles
pr&auml;chtig, nur der Player, PIV-MooVId, mit dem ich meine kurzen
TestVideos abspielte, &ouml;ffnete das PIP immer doppelt so breit, wie das
Video eigentlich war. Genau f&uuml;r diesen Fehler gibt es ja ein kleines
Update, das allerdings in diesem Fall doch nicht hilft. Interessanterweise
war das Bild selber dann aber auch nicht skaliert, sondern auf die halbe
Fensterbreite zusammengezogen und die Gr&ouml;&szlig;e des PIP-Fensters
lie&szlig; sich auch nicht mehr &auml;ndern. Irgendwo haperts da noch. Auch
Versuche, den alten Systemstand wiederherzustellen, funktionierten nicht,
bzw. machten keinen relevanten Unterschied. Das Problem scheint aber bei
Picasso96 zu liegen, diesmal, doch das ist nicht so erheblich, da die
Autoren sowohl von Picasso96 als auch von PalomAVI in der Picasso Mailing
Liste vertreten sind und Probleme solcherart erfahrungsgem&auml;&szlig;
schnell behoben werden.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>PalomaFE</B></H3>&nbsp;

<BR>Ja, es gibt noch ein anderes Programm, das den Anspruch erhebt, Videos
aufnehmen zu k&ouml;nnen, aber das erinnert eher an die ungl&uuml;cklichen
Vesuche zu Zeiten einer VLab als an aktuelle Software.<BR>

<BR>Nungut, f&uuml;r Leute mit viel Geduld, langsamer Platte und daf&uuml;r
mit einem MainActor oder &auml;hnlichem, k&ouml;nnte diese Art der
VideoDigitalisierung auch seinen Reiz haben, denn PalomaFE ist ein
&quot;Multipass Anim Grabber&quot;. Das hat jetzt nichts mit dem MultiPass
aus 5th Element zu tun, sondern damit, da&szlig; ein Video in mehreren
Durchg&auml;ngen aufgenommen wird. Zuerst die Frames 1,4,7,..., dann
zur&uuml;ckspulen, die Frames 2,5,8,..., und im dritten Durchlauf
schlie&szlig;lich die Frames 3,6,9,..., die dann alle als Einzelbilder in
irgendeinem Verzeichnis liegen und zusammengesetzt werden wollen, damit sie
auch eine durchgehende Animation ergeben.<BR>

<BR>Die farbenpr&auml;chtige Oberfl&auml;che ist ja schon im anderen
<A HREF="0x00FC.html">Paloma-Artikel</A> dieser Ausgabe zu sehen und f&uuml;r
T&uuml;ftler, die gerne mit Videorecordern spielen ist das durchaus eine
Alternative. Doch die Schwierigkeiten, framegenau zu positionieren und
wieder abspielen zu k&ouml;nnen, sind nicht unerheblich, wenn der Recorder
selbiges nicht kann (was auch nur die sehr teuren Ger&auml;te
zustandebringen) und vielleicht auch noch so neumodrene Billigmechanik
besitzen, die mal hierhin, mal dorthin spult. F&uuml;r simples Aufnehmen
aus dem Fernsehen und Wiederabspielen mag es ja gen&uuml;gen, wenn man
keine Anspr&uuml;che erhebt, aber f&uuml;r genaue Positionierarbeiten sind
diese sekundenweise Umspulvorg&auml;nge &auml;u&szlig;erst l&auml;stig,
wenn nicht gar sie zunichtemachend.<BR>

<BR>Ja, es funktioniert wohl, solcherart zu seinen Animationen zu kommen,
nur wer das Geld f&uuml;r einen Videorecorder hat, der sich so genau
positionieren l&auml;&szlig;t, hat auch das Geld f&uuml;r eine schnelle
Festplatte und einen ordentlichen Prozessor. Insofern bleibt nat&uuml;rlich
die Sinnhaftigkeit des Ganzen ein wenig schleierhaft, aber das mu&szlig; an
sich sowieso jheder f&uuml;r sich entscheiden.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Und die Moral von der Geschicht'?</B></H3>&nbsp;

<BR>PalomAVI zeigt in der ersten Version schon mal, was es so kann,
PalomaFE ist f&uuml;r ein paar Versuche sicher geeignet, f&uuml;rs
sinnhafte Arbeiten aber sicherlich nicht. Die n&auml;chsten Versionen
werden zeigen, ob die brauchbaren Grundlagen, die PalomAVI gelegt hat, auch
ausgen&uuml;tzt werden und ihre weiteren Verbesserungen und Verfeinerungen
erfahren.<BR>

<BR>Vorallem das Zusammenspiel von Video und Audio in den n&auml;chsten
Versionen wird interessant, zumal die Unterst&uuml;tzung von H&ouml;rbarem
auf die Framerate dr&uuml;cken wird, deren Erh&ouml;hung aber trotz der
durchg&auml;ngigen Programmierung von PalomAVI in Assembler noch
m&ouml;glich sein wird.<BR>

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#oliver">Oliver Gerler</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00FD.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.dfmk.hu/~torokl/">PalomAVI</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="mailto:torokl@alpha.dfmk.hu">L&aacute;szl&oacute; T&ouml;r&ouml;k</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.dfmk.hu/~torokl/download/PalomAVI.lha">PalomAVI.lha</A><BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="http://www.ninemons.com/picasso/Picasso.html">Picasso Mailing List</A><BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> Aminet:<A HREF="ftp://ftp.uni-paderborn.de/pub/aminet/gfx/board/PalomaFEv2.1.lha">gfx/board/PalomaFEv2.1.lha</A><BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp;
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00FC.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00FE.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
