<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0D - Eat The Whistle</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00FA.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00F9.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00FB.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=79 HEIGHT=25 SRC="../images/_spiele_.gif" ALT="[Spiele]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00F9.html">OloFight</A> | <A HREF="0x00FA.html">Eat The Whistle</A> | <A HREF="0x00FB.html">Vulcanology</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00ED.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00EE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00EF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00F0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00F1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00F4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00F8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00F9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00FC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00FE.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00FF.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>Eat The Whistle - das darf doch nicht wahr sein!</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Es gibt definitiv gute und schlechte Spiele auf dieser
Welt - ein Gegensatz, der nicht nur omnipr&auml;sent, sondern auch
unabdingbar ist. Wie sonst k&ouml;nnte man sich an
au&szlig;ergew&ouml;hnlich guten Games derart erfreuen? Und umgekehrt gilt
nat&uuml;rlich auch... &auml;h... oh Gott, was rede ich denn da wieder
daher? Das liegt wohl daran, da&szlig; mir nach dem Test dieser
gnaaadenlosen Fu&szlig;ballorgie einfach die Worte fehlen. Gehen wir also
zur&uuml;ck zu dem Zeitpunkt, an welchem ich die H&uuml;lle einer gewissen
neuen CD eingehender zu betrachten begann...</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>... und mir zun&auml;chst einmal das Lachen nicht verkneifen konnte.
Das Design ist zwar nur semigenial, aber die beiden Kicker auf dem Cover
wirken in der Tat h&ouml;chst am&uuml;sant. (schauen alle Fu&szlig;baller
so d&auml;mlich drein?). Links oben das Amiga-Logo - das Spiel scheint also
auf meinem Rechner lauff&auml;hig zu sein. Rechts ganz gro&szlig; der Titel
<B>Eat The Whistle</B>, hoffentlich meinen die nicht meine Pfeife, die tu
ich n&auml;mlich lieber rauchen, zumal Holz und Kautschuk nicht besonders
munden - au&szlig;er vielleicht mit einem edlen Tropfen Rotwein! Wohl aber
war ich, trotz Gips (der Leser erinnert sich ...?), in der Lage, das Ding
zu wenden. Meine Bezeichnung des <I>The Strangers</I>-Covers,
&quot;impressionistisch&quot;, kommt mir wieder in den Sinn. Hier ist diese
Kunstform zur Perfektion gereift, allerdings nur, wenn man aktionistisch
denkt. Nein, nein, kein Blut und keine Perversionen, oder halt, doch: so
ein furchterregend grindiges Bild einer Fu&szlig;ballszene kann man einfach
nur als pervers bezeichnen. Da mu&szlig; man einfach wegschauen! Gar nicht
aktionistisch und auch nicht impressionistisch, aber trotzdem schwer
leserlich sind die zahlreichen Angaben &uuml;ber das, was einen im Inneren
der CD-H&uuml;lle erwartet. Spa&szlig;eshalber will ich die wahnwitzigsten
Spr&uuml;che zitieren: &quot;sehr intuitive Steuerung&quot;,
&quot;Rollenspielmodus&quot; (h&auml;?), &quot;Arcademodus &auml;hnlich
Speedball II&quot; (wau). Es soll &uuml;ber 1000 Animationsframes,
spektakul&auml;re Spezialsch&uuml;sse (geschrieben mit scharfem &szlig;),
30 verschiedene Platzverh&auml;ltnisse, tolle Steuerungsm&ouml;glichkeiten
und viel Systemfreundlichkeit geben, AHI und Grafikkarten werden
unterst&uuml;tzt. &quot;Klingt ja interessant, das werd ich gleich mal
nachpr&uuml;fen&quot;, dachte sich der unschuldige Tester und f&uuml;tterte
sein CD-Laufwerk mit der silbernen Scheibe von <I>Epic / Islona
Games.</I><BR>

<BR><CENTER><IMG WIDTH=320 HEIGHT=256 ALT="[Titelscreen]" SRC="../images_0D/titelscreen.gif"></CENTER>&nbsp;

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Ein Intro kommt selten allein...</B></H3>&nbsp;

<BR>In Zeiten wie diesen sind wir Zocker ja schon soooo verw&ouml;hnt,
da&szlig; uns alle Programmierer mit tollen Intros und geil gerenderten
Logos beschenken. Das ist mittlerweile sozusagen Standard. Standards sind
quasi Mittelwerte, und solche kann man mitunter &uuml;bertreffen. Tja, oder
auch gnadenlos unterbieten. Bei &quot;Fri&szlig; die Pfeife&quot; hat man
offenbar zweitere Version bevorzugt. Da sind zuerst ein paar Grafiken aus
den mittleren Achtzigern hineingerutscht, wie mir scheint, aber was soll's,
sind ja blo&szlig; Logos, und wer braucht schon gutaussehende Logos? Aber
nach solchen kommt logischerweise das Intro. Und dieses macht mich
sprachlos. ... Nach f&uuml;nf Dosen Red Bull und einem Liter starkem Kaffee
bin ich endlich in der Lage, auszuformulieren, was ich sah: &auml;h...
ein... ein Bus kommt von links ins Bild, im Hintergrund ein, &auml;h,
Stadion. Ja, das ist es. Dazu kommen Ger&auml;usche aus dem Monitor,
Motorger&auml;usche, wie ich messerscharf kombiniere. Da, es geschieht
wieder etwas: nach kurzer Wartezeit f&auml;hrt der Bus ab, dieser
zweidimensionale blaue Bus, den meine f&uuml;nfj&auml;hrige Schwester
gezeichnet haben k&ouml;nnte, wenn ich blo&szlig; eine
f&uuml;nfj&auml;hrige Schwester h&auml;tte. Und nun, Achtung, jetzt
kommt's, haltet Euch fest: was dem Zuseher zuvor verborgen, wird nun
offenbar. Da steht eine... Fu&szlig;ballmannschaft! Die sind gerade
ausgestiegen, und keiner hats gemerkt. Wahnsinn, das ist ja spannend, damit
h&auml;tte ich wirklich nicht gerechnet. Und dann auch noch eine Pointe,
die &uuml;brigens bei jedem Start anders ist. Einmal kommt von oben ein
riesiger Fu&szlig;ball und zermalmt alle, der dr&uuml;ckt einen richtigen
Krater in den Asphalt - wau, der mu&szlig; schwer sein! Erinnert mich an so
ein Ottifanten-Comic. Ein anderes Mal drehen sich die Stadion-Flutlichter
und schie&szlig;en eine Art Laserstrahl, so da&szlig; die gesamte
Mannschaft vergl&uuml;ht und von der Bildfl&auml;che verschwindet. Beim
dritten Mal hebt das Stadion ab und entpuppt sich als UFO. Das Stadion
bekommt ein anderes Mal Beine und rennt oder kegelt die Mannschaft nieder.
Kostproben gef&auml;llig? (Achtung: M&auml;nner, Frauen, Hunde und kleine
Kinder sollten die Bilder nur unter &auml;rztlicher Aufsicht
genie&szlig;en.)<BR>

<BR><CENTER><IMG WIDTH=480 HEIGHT=82 ALT="[Ball-Intro]" SRC="../images_0D/introball.gif"></CENTER>&nbsp;

<BR><CENTER><IMG WIDTH=480 HEIGHT=82 ALT="[Kugel-Intro]" SRC="../images_0D/introkugel.gif"></CENTER>&nbsp;

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Ein kr&auml;ftiges Schluckerl Montana-Tropfen zur Magenberuhigung, und
es geht mir wieder besser. Aber nur bis zum Erscheinen des
Hauptbildschirmes und dem Ert&ouml;nen der Musik. Die Musik l&auml;&szlig;t
sich wenigstens abstellen, aber am Main Screen f&uuml;hrt kein Weg vorbei.
Der wichtigste Punkt der Auswahl ist hier wohl mit Abstand &quot;Zur ck zum
DOS&quot; (L&uuml;ckentext als sprachlicher Intelligenztest f&uuml;r den
Spieler?). Wenn man diesen w&auml;hlt, erscheint ein derma&szlig;en
grauslicher Requester, da&szlig; Streifen wie &quot;Nightmare&quot; dagegen
in &auml;sthetischer Sch&ouml;nheit erstrahlen. Die Frage &quot;Sind Sie
sicher?&quot; richtig zu beantworten ist daher trivial. Die Option
&quot;Nein&quot; existiert vermutlich nur f&uuml;r arme Tester, die auch
noch was vom eigentlichen Spiel sehen wollen oder m&uuml;ssen. Dummerweise
geh&ouml;re ich zu letzterer Gruppe, welche erst in solchen Momenten
erkennt, was f&uuml;r einen frustrierenden job sie eigentlich aus&uuml;bt.
An dieser Stelle k&ouml;nnte ich alle unschuldigen Leser mit einem
Screenshot begl&uuml;cken, aber ich wei&szlig; noch nicht, ob ich Euch das
wirklich antun soll.<BR>

<BR><CENTER><IMG WIDTH=479 HEIGHT=128 ALT="[Main Menu, Team, Credits]" SRC="../images_0D/mainteamcr.gif"></CENTER>&nbsp;

<BR>Ein weiterer Punkt: &quot;Credits&quot;. Wer wenigstens hier brauchbare
Dinge vermutet, wird wieder einmal herrlich entt&auml;uscht. Von der
&quot;Grafik&quot; reden wir lieber nicht, und der Text besteht aus gelber
Schrift mit schwarzem Schatten auf wei&szlig;em (!) Hintergrund. Da waren
ja richtige Farbexperten am Werk! Weiter zu den &quot;Teams&quot;. Die
lassen sich sogar &quot;editiren&quot;, aber nur mit dem Editor aus dem
Aminet, der anscheinend leider nicht mehr auf der CD Platz hatte.
(muahahaha) Interessanter sind die &quot;Voreinstellungen&quot;. F&uuml;r
geniale Steuerungsm&ouml;glichkeiten kann man 2-Button-Sticks oder Joypads
einstellen, und auch sonst sind hier brauchbare Optionen verf&uuml;gbar,
z.B. auf welchem Screen man gerne spielen m&ouml;chte. Und beispielsweise
kann man das Zuschauergegr&ouml;hle durch Reporterkommentare ersetzen - wer
so w&auml;hlt, w&auml;hlt gewi&szlig; das kleinere &Uuml;bel. Fragen wie
&quot;wo am Screen soll das Radar sich befinden?&quot; finden hier
ebenfalls eine Antwort. Der Men&uuml;punkt &quot;Ergebnisse&quot; ist
anfangs absolut sinnlos, und &quot;Highlights&quot; haben wir auch noch
keine.<BR>

<BR>Ich saufe mir einen Haufen Mut an und wage es dann, auf
&quot;Spiel&quot; zu dr&uuml;cken. &Ouml;ha, da gibts ja einige Dinge zur
Auswahl. Zun&auml;chst dieser &quot;Arcade&quot;-Modus, dann
&quot;Simulation&quot;, &quot;Karriere&quot; (ist in dieser Version aber
nicht inkludiert!) und &quot;Training&quot;. Letzteres ist halbwegs
sinnvoll, um Elfmeter und Freist&ouml;&szlig;e zu &uuml;ben. Letztere sind
wenigstens einigerma&szlig;en gut gel&ouml;st: eine Linie zeigt die
Richtung an, die andere den Winkel, und man kann beides quasi frei
w&auml;hlen. Die Elfmeter-Geschichte ist wieder eine andere solche;
immerhin gelingt es, das Geheimnis halbwegs zu durchschauen und einen
kleinen Bissen vom gro&szlig;en Kuchen der Kontrolle &uuml;ber das Leder zu
retten. Nun dr&auml;ngt es den wissensdurstigen und wahnsinnigen Tester
aber danach, das Spiel endlich zu beginnen. Leichtsinnig und unerfahren,
wie er nun einmal ist, wagt er diesen Schritt.<BR>

<BR><CENTER><IMG WIDTH=320 HEIGHT=256 ALT="[Tactics]" SRC="../images_0D/tactics.gif"></CENTER>&nbsp;

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Die Angst des Testers vor dem Anpfiff</B></H3>&nbsp;

<BR>Jede beliebige Aufl&ouml;sung w&auml;re m&ouml;glich, aber nur in
PAL-Lowres (320x256) oder NTSC-Lowres (320x200) kann man von stockendem
Scrolling sprechen. Alles, was dar&uuml;ber liegt, ist auf meinem
68030/50er ein Witz in Zeitlupe, dessen Pointe vor allem darin liegt,
da&szlig; absolut kein Grund besteht, warum das Game nicht auch auf einem
68000er fl&uuml;ssig rennen k&ouml;nnte. Es gibt keine 3-D-Effekte, und so
wahnsinnig genial k&ouml;nnen die Berechnungen gar nicht sein, da&szlig;
sie soviel CPU-Power verbraten. Vielleicht wollten uns die Programmierer
nur verarschen? Nette Animationsphasen gibt es ja in der Tat, aber die
Sprites sind doch recht klein, und im Hintergrund spielen sich keine
nennenswerten Animationen ab. Der Kommentator quasselt v&ouml;llig
unmotiviert herum und trifft den Kern der Sache stets haargenau. Beispiele
gef&auml;llig?<BR>

<BR>Ich (&Ouml;sterreich, was sonst?) schnappe mir das Leder, aber Jamaica
jagt es mir ab und st&uuml;rmt los. <B>Sprecher:</B> <I>&Ouml;sterreich...
treibt das Spiel nach vorn!</I> Jamaica rennt weiter und kommt in
Strafraumgegend. <B>Sprecher:</B> <I>Das Spiel l&auml;uft im Mittelfeld hin
und her.</I> Jamaica schie&szlig;t, aber ich halte den Ball und
schie&szlig;e ihn nach vorne. <B>Sprecher:</B> <I>Jamaica... kann jetzt
schie&szlig;en!</I> Ich wage einen Schu&szlig;, und siehe da, das Leder
zappelt im gegnerischen Netz. <B>Sprecher:</B> <I>Das Spiel ist seeehr
ausgeglichen. - Und TOOOR! - Das schaun wir uns jetzt gleich mal in der
Wiederholung an.</I> Die zweite Halbzeit ist fast vorbei. <B>Sprecher:</B>
<I>Nur noch wenige Sekunden bis zum Ende der ersten Halbzeit.</I> Kurz
darauf: <B>Sprecher:</B> <I>Und das Spiel ist aus! Und das Spiel ist
aus!</I> (doppelt h&auml;lt besser?)<BR>

<BR><CENTER><IMG WIDTH=484 HEIGHT=128 ALT="[Spiel... und Goal]" SRC="../images_0D/spielgoal.gif"></CENTER>&nbsp;

<BR>Soviel zum am&uuml;santeren Part des Spiels. Und weiter gehts mit
vernichtender Kritik. Die &quot;intuitive Steuerung&quot; hat ihren Namen
anscheinend davon, da&szlig; die Spielfiguren ganz intuitiv und spontan das
machen, was der Spieler <I>nicht</I> vorhat. <I>Wolfgang
Firestringer</I>(lustige Namen, gell?) schie&szlig;t, der Goalie faustet
den Ball noch weg, und dieser landet vor den F&uuml;&szlig;en von <I>Andi
Orgas</I>. Der wird aber an diesem Tag sicher keine namens&auml;hnlichen
Freuden mehr genie&szlig;en k&ouml;nnen, und zwar aus Frust: ich
dr&uuml;cke aufs Kn&ouml;pfchen, und der Bursche dreht sich seelenruhig vom
Tor weg, um zu <I>Toni Poster</I> zu passen. Interessant. Dieser reagiert
auch nicht wie geplant auf meinen Knopfdruck, versucht stattdessen einen
Pa&szlig; zu Firestringer und verliert den Ball an einen Verteidiger. Aha.
Das liegt wohl daran, da&szlig; bei der normalen 1-Button-Joystickbelegung
Pa&szlig; und Schu&szlig; dasselbe Kommando (Feuer) besitzen. W&uuml;rde
ich mir die Joypad-Belegung aneignen, dann w&auml;re ich zwar vor solchen
Aktionen gefeit, aber bis dahin l&auml;ngst zum Masochisten mutiert oder
vielleicht ins LNKH eingeliefert worden. Denn es macht ungeheuer
Spa&szlig;, sich zus&auml;tzlich mit Spielern herumplagen zu m&uuml;ssen,
deren Intelligenz nicht zu schlagen ist. Jaja, denn wo nichts ist, kann man
auch nichts schlagen. Die Kontrolle &uuml;ber den aktuellen Spieler zappelt
oft lustig hin &amp; her, und die &quot;inaktiven&quot; Burschen laufen
relativ sinnlos &uuml;ber den Rasen oder veranstalten gar eine Stehparty.
Der Versuch, sich das Leder zu erk&auml;mpfen oder einen St&uuml;rmer
aufzuhalten, ist meist ein Gl&uuml;cksspiel, sowie ein ziemlicher Krampf
und endet auch mit einem solchen. Und zus&auml;tzlich zum Ruckeln ist das
Spiel auch noch ganz sch&ouml;n reaktionstr&auml;ge: was man am Schirm
sieht, ist quasi nicht mehr ganz aktuell, und wenn man aufs Kn&ouml;pfchen
dr&uuml;ckt, dauert es eine halbe Sekunde, bis <I>Andi Herzig</I> drauf
anspricht. Bis er dann schie&szlig;t oder pa&szlig;t, ist der Ball
l&auml;ngst irgendwo in Gegners H&auml;nden bzw. F&uuml;&szlig;en. Ist ja
nett.<BR>

<BR><CENTER><IMG WIDTH=320 HEIGHT=256 ALT="[Spiel aus]" SRC="../images_0D/spielaus.gif"></CENTER>&nbsp;

<BR>Das Spiel ist endlich vorbei, sogar ohne Absturz und gravierende Errors
(kommen vor), und man kommt recht rasch zum MainScreen zur&uuml;ck, ohne
da&szlig; man wie vor dem Ankick erst 20 Sekunden warten mu&szlig;, bis
alles geladen und berechnet ist (was auch immer das ist). Und besonders
lustig ist, da&szlig; nach ein paar absolvierten Freundschaftsspielen die
Ergebnisse f&uuml;r alle verschieden Ligen oder France '98 gespeichert
bleiben. Ich starte die WM also schon mit ein paar Siegen oder Verlusten.
Der Bug steht nicht ganz alleine da: seine Kollegen tauchen z.B. in Form
von kleineren Grafikfehlern auf. Andererseits f&auml;llt bei <I>der</I>
Grafik so ein Fehler gar nicht mehr auf...<BR>

<BR>Eigentlich schade, denn die Programmierer haben auch an manche feinen
Kleinigkeiten gedacht. Der Schiri steht tats&auml;chlich im Weg herum,
gefoult kann er zwar nicht werden, aber angeschossen. Was solche Abpraller
von Spielern, Goalies und Pfosten betrifft, ist das Spiel recht
&quot;realistisch&quot;, da alle m&ouml;glichen Winkel vorkommen
k&ouml;nnen, sogar Pre&szlig;b&auml;lle ergeben sich hin und wieder. Aber
das kann &uuml;ber die eigenwillige Steuerung, die fade Grafik, das
peinliche Geruckel, den grindigen Sound, die unsinnigen Programmfehler und
den ganzen Frust nicht hinwegt&auml;uschen. Schade drum: der Inhalt hielt
also, was die Packung versprach - im negativen Sinne.<BR>

<BR>Und weil der Arcade-Modus dem guten alten Klassiker <I>Speedball II</I>
niemals das Wasser reichen kann, werde ich mir den ausf&uuml;hrlichen
Absatz dar&uuml;ber nun schenken. Es ist einfach dasselbe wie im normalen
Spiel, nur da&szlig; Fouls erlaubt sind und Power-Ups und verschiedene Boni
herumliegen (z.B. einer, der alle Gegner an ihrer Stelle einfriert). Mehr
gibts auch dazu kaum zu sagen, au&szlig;er da&szlig; der Vergleich auf der
R&uuml;ckseite der CD-H&uuml;lle schlichtweg vermessen ist.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Letzter Absatz. Mindestvoraussetzungen sind ein 68020er ab Kickstart
2.0, ein CD-Rom-Laufwerk, das ahi.device (im <A HREF="http://www.uni-paderborn.de/pub/aminet/dev/misc/ahi.lha">Aminet</A>
zu finden) und die reqtools.library. Empfohlen werden Kickstart 3.x,
68030/50 oder besser, 4MB Ram und eine Soundkarte. Grafikkarten werden auch
in allen Aufl&ouml;sungen unterst&uuml;tzt, denn schon beim Programmstart
erscheint ein Bildschirmmodus-Requester. Ich warne aber: bereits in
PAL-Lowres ruckelt es l&auml;ssig dahin. Ohne einen flinkeren Rechner oder
eine flinke Grafikkarte braucht man den Rest gar nicht erst zu probieren.
Und wer wei&szlig;, ob das Game bei solchen Konfigurationen &uuml;berhaupt
stabil rennt? Ich traue mich nicht, darauf zu wetten, da es schon meinen
braven 1200er zuweilen in den Abgrund zu rei&szlig;en versucht.<BR>

<BR>Zum Abschlu&szlig; die Bewertungssbox mit historischen
Tiefstst&auml;nden, welche meine einzige Genugtuung des heutigen Tages
darstellen. Und ich freue mich schon auf eine <I>Wet</I>-Session, die wird
motivierender, hehe ;-))<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Grafik</TD>          <TD><IMG SRC="../images/_box_red.gif" WIDTH=23 HEIGHT=10 ALT="[23]"><IMG SRC="../images/_box_black.gif" WIDTH=77 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Animation</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=18 HEIGHT=10 ALT="[18]"><IMG SRC="../images/_box_black.gif" WIDTH=82 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>SFX</TD>             <TD><IMG SRC="../images/_box_red.gif" WIDTH=36 HEIGHT=10 ALT="[36]"><IMG SRC="../images/_box_black.gif" WIDTH=64 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Music</TD>           <TD><IMG SRC="../images/_box_red.gif" WIDTH=20 HEIGHT=10 ALT="[20]"><IMG SRC="../images/_box_black.gif" WIDTH=80 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Gameplay</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=9 HEIGHT=10 ALT="[9]"><IMG SRC="../images/_box_black.gif" WIDTH=91 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dauerspa&szlig;</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=7 HEIGHT=10 ALT="[7]"><IMG SRC="../images/_box_black.gif" WIDTH=93 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>OS-Friendly</TD>     <TD><IMG SRC="../images/_box_red.gif" WIDTH=50 HEIGHT=10 ALT="[50]"><IMG SRC="../images/_box_black.gif" WIDTH=50 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=22 HEIGHT=10 ALT="[22]"><IMG SRC="../images/_box_black.gif" WIDTH=78 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00FA.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
				<BR><TABLE BORDER=0 CELLPADDING=8 CELLSPACING=0 ALIGN=CENTER WIDTH="90%">
				<TR VALIGN=TOP ALIGN=LEFT><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_burggraben.gif">Burggraben</A> (GIF; 4K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_dorennta.gif">Do rennta!</A> (GIF; 3K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_higoal.gif">Goal</A> (GIF; 44K)<BR>

				</TD><TD WIDTH="50%">

<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_hispiel1.gif">Spiel 1</A> (GIF; 41K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_hispiel2.gif">Spiel 2</A> (GIF; 45K)<BR>
<IMG WIDTH=10 HEIGHT=10 SRC="../images/_ball.gif" ALT="-"> <A HREF="../images_0D/etw_hitabelle.gif">Tabelle</A> (GIF; 33K)<BR>

				</TD></TR>
				</TABLE>
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00F9.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00FB.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
