<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML>
<HEAD>
	<TITLE>AmigaScene 0x0D - IDEfix &acute;97</TITLE>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="TEXT/HTML;CHARSET=iso8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#101010" LINK="#BF0000" VLINK="#101010" ALINK="#E04040">
	<TABLE WIDTH="100%" CELLPADDING=3 CELLSPACING=0 BORDER=0>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP WIDTH="80%" HEIGHT=75>
				<A NAME="00" HREF="welcome.html"><IMG SRC="../images/_amiga.gif" WIDTH=125 HEIGHT=48 ALT="[Amiga]" ALIGN=RIGHT BORDER=0></A><A HREF="#99"><IMG SRC="../images/_krumm_lo.gif" WIDTH=37 HEIGHT=29 ALT="[Down]" ALIGN=LEFT BORDER=0></A>
				<BR CLEAR=ALL><BR>
				<TABLE ALIGN=CENTER WIDTH=170 BORDER=0 CELLSPACING=0 CELLPADDING=0><TR><TD ALIGN=CENTER>
					<A HREF="../deutsch/0x00F2.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" BORDER=1></A>
				</TD></TR></TABLE>
 			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=RIGHT WIDTH=175>
				<A HREF="welcome.html"><IMG SRC="../images/_scene.gif" WIDTH=110 HEIGHT=47 ALT="[Scene]" ALIGN=LEFT BORDER=0></A>
				<A HREF="0x00F1.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00F3.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=CENTER>
				<CENTER>&nbsp;<BR>

					<IMG WIDTH=148 HEIGHT=25 SRC="../images/_hardware_.gif" ALT="[Hardware]">&nbsp;<BR><BR>

					<TABLE WIDTH="90%" BORDER=0>
						<TR><TD ALIGN=CENTER><FONT SIZE="-1">

| <A HREF="0x00F1.html">hyperCOM1</A> | <A HREF="0x00F2.html">IDEfix &acute;97</A> | <A HREF="0x00F3.html">HyperCOM 4+</A> |
<!--MENU-->

						</FONT></TD></TR>
					</TABLE>&nbsp;<BR>
				</CENTER>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER WIDTH=175 ROWSPAN=2>
				<CENTER>&nbsp;<BR>
					<IMG SRC="../images/__.gif" HEIGHT=1 WIDTH=175 ALT=" "><BR> 
					<A HREF="0x00ED.html"><IMG WIDTH=77  HEIGHT=25 SRC="../images/_cover.gif"     ALT="[Cover]"     BORDER=0></A><BR>
					<A HREF="0x00EE.html"><IMG WIDTH=117 HEIGHT=25 SRC="../images/_editorial.gif" ALT="[Editorial]" BORDER=0></A><BR>
					<A HREF="0x00EF.html"><IMG WIDTH=85  HEIGHT=25 SRC="../images/_inhalt.gif"    ALT="[Inhalt]"    BORDER=0></A><BR>
					<A HREF="0x00F0.html"><IMG WIDTH=70  HEIGHT=25 SRC="../images/_news.gif"      ALT="[News]"      BORDER=0></A><BR>
					<A HREF="0x00F1.html"><IMG WIDTH=131 HEIGHT=25 SRC="../images/_hardware.gif"  ALT="[Hardware]"  BORDER=0></A><BR>
					<A HREF="0x00F4.html"><IMG WIDTH=121 HEIGHT=25 SRC="../images/_software.gif"  ALT="[Software]"  BORDER=0></A><BR>
					<A HREF="0x00F8.html"><IMG WIDTH=135 HEIGHT=25 SRC="../images/_workshop.gif"  ALT="[Workshop]"  BORDER=0></A><BR>
					<A HREF="0x00F9.html"><IMG WIDTH=73  HEIGHT=25 SRC="../images/_spiele.gif"    ALT="[Spiele]"    BORDER=0></A><BR>
					<A HREF="0x00FC.html"><IMG WIDTH=91  HEIGHT=25 SRC="../images/_special.gif"   ALT="[Special]"   BORDER=0></A><BR>
					<A HREF="0x00FE.html"><IMG WIDTH=112 HEIGHT=25 SRC="../images/_feedback.gif"  ALT="[Feedback]"  BORDER=0></A><BR>
					<A HREF="0x00FF.html"><IMG WIDTH=46  HEIGHT=25 SRC="../images/_etc.gif"       ALT="[Etc]"       BORDER=0></A><BR>
				<BR></CENTER>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>

<BR><H1 ALIGN=LEFT><FONT FACE="Arial"><B>IDEfix &acute;97 - Gr&ouml;&szlig;er, besser, schneller: IDE f&uuml;r A1200</B></FONT></H1>&nbsp;

<BR><FONT SIZE="+1">Auweia, da haben mir die Kollegen aber einen ganz
sch&ouml;nen Hund angetan, wo ich doch an meinem Amiga so gut wie nie
herumbastele, seit Ewigkeiten dieselbe Seagate-2,5&quot;-IDE-Festplatte
(170 MB) benutze, und selbst meine Workbench pr&auml;sentiert sich noch -
v&ouml;llig unaufgemotzt - im grindigen Ur-Design! (wenigstens motiviert
das meinen Bruder zu allerhand ver&auml;chtlichen Bemerkungen: <I>&quot;O
Gott, in dem Zimmer ist ja Platz!&quot;, &quot;O Gott, wie kann man nur mit
so einer Workbench arbeiten!&quot;, &quot;Jetzt kauf' Dir endlich mal ein
eigenes Modem!&quot;</I> und noch zahlreiche weitere Zitate, welche hier
aber eigentlich gar nicht hingeh&ouml;ren. Aber was soll's, einem Freund
zufolge bin ich ja &quot;ein gro&szlig;er Geschichtenerz&auml;hler&quot;.
Nach langen Verz&ouml;gerungen machte ich mich letztendlich in Begleitung
eines motzenden Bruders und einer wachsamen Videokamera an die Arbeit und
versuchte, meinen Amiga per Schraubenzieher zu massakrieren.</FONT><BR>

<BR><CENTER><A NAME="01" HREF="#00"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>In den beiden Packungen befanden sich eine Diskette, ein IDE-Adapter
zum Anschlu&szlig; mehrerer Ger&auml;te zugleich am IDE-Port des A1200 und
der ber&uuml;chtigte &quot;Express-Adapter&quot;, welcher die Zugriffs- und
&Uuml;bertragungsgeschwindigkeiten gnadenlos in H&ouml;hen pushen sollte,
die man eher von SCSI gewohnt ist. Auf die Diskette nahm ich zun&auml;chst
keine R&uuml;cksicht und erw&auml;hlte den IDE-Adapter zum ersten
Versuchsobjekt.<BR>

<BR>Der erste Teil meiner Bem&uuml;hungen war auch recht vielversprechend,
zumal er lediglich daraus bestand, alle Kabeln abzustecken, die Schrauben
zu entfernen, das Geh&auml;use zu &ouml;ffnen und die Anleitung zum Einbau
des kleinen Adapters zu studieren. Das sollte aber auch jedem Amigianer
gelingen, und wem nicht, dem ist wohl ein rasches Verkriechen hinter den
Monitor anzuraten. Gottseidank war ich nicht so peinlich und vertiefte mich
in die Gebrauchsanweisungen, die auf einer A4-Seite komprimiert waren.<BR>

<BR>Davon ausgehend, da&szlig; techisches Wissen sowie F&auml;higkeiten
meinerseits eher begrenzt sind, ist das Faktum, da&szlig; mir die
Anweisungen relativ klar und eindeutig schienen, sicherlich positiv zu
bewerten. Der Anschlu&szlig; der Platine anhand des Planes und des
mitgelieferten Kabels machte &uuml;berhaupt keine Probleme. Allerdings
erwies es sich als ein Ding der Unm&ouml;glichkeit, das kleine Ger&auml;t
nach erneutem Anschlu&szlig; der Festplatte im Inneren des 1200ers zu
verstauen - zumindest lie&szlig; er sich danach keineswegs mehr
zuschrauben. Wie dann &uuml;berhaupt der Anschlu&szlig; weiterer
Ger&auml;te gel&ouml;st werden sollte, ist mir ein R&auml;tsel - es sei
denn, man verlagert sie nach drau&szlig;en (extern), wobei dann
nat&uuml;rlich noch die Kabelleitungen entsprechend genial zu verlegen
w&auml;ren.<BR>

<BR>Immerhin lief die Festplatte nach dem Einbau des Adapters genauso wie
zuvor, offensichtlich nicht schneller und auch nicht langsamer (wie mir ein
uraltes Sysinfo und mein allgemeines Zeitgef&uuml;hl verrieten). Der Einbau
des Express-Adapters w&uuml;rde das bestimmt &auml;ndern, zumal er
&uuml;ber 5 MB/sek Datentransferraten erm&ouml;glichen sollte. Aber wenden
wir uns zun&auml;chst einmal dem H&uuml;ndchen von Asterix und Obelix zu,
das von den Entwicklern als die L&ouml;sung aller IDE-Probleme gepriesen
wird: dem eingebauten Adapter mitsamt der IDEfix &acute;97 - Software.<BR>

<BR><CENTER><A NAME="02" HREF="#01"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Aus dem Weg, hier kommt Idefix!</B></H3>&nbsp;

<BR>Das Programmpaket auf der Diskette besteht aus mehreren Teilen.
Einerseits werden die Leistungen von Festplatten, derer nun mit
4-Ger&auml;te-Adapter 4 St&uuml;ck angeschlossen und verwendet werden
k&ouml;nnen, erh&ouml;ht und auch Wechselmedien werden unterst&uuml;tzt
(Syquest, ZIP). Andererseits k&ouml;nnen auch ATAPI-Ger&auml;te verwendet
werden; diese und auch SCSI-CD-Roms werden vom CD-Filesystem CacheCDFS, dem
Tool PlayCD und dem CD32-Emulator kr&auml;ftig unterst&uuml;tzt. Wir haben
also zwei Zielgruppen: Festplatten und CD-Roms.<BR>

<BR>Erster Schritt: der Installer. Wie immer deppensicher und problemlos
und je nach Wunsch mit mehr oder weniger manueller Kontrolle des Users
werden alle m&ouml;glichen Tools, Prefs, Befehle und
Mountlist-Eintr&auml;ge automatisch vollzogen. Man kann den ganzen Krempel
auch bequem wieder per &quot;Uninstall&quot; hinauswerfen.<BR>

<BR>Zweiter Schritt: den Krempel ausprobieren. Was geh&ouml;rt da nun alles
dazu? Beginnen wir mal mit <B>CacheCDFS</B>, dem Filesystem samt
Audio-Player und CD32-Emulator. Die Anleitung (wahlweise englisch oder
deutsch) verr&auml;t uns gnadenloserweise alles &uuml;ber Filesysteme, von
Null auf Hundert sozusagen. CacheCDFS kann zwar kein HighSierra lesen, aber
daf&uuml;r den ganzen Rest (ISO9660 Level 1 und 2, Rockridge und Macintosh
HFS). Der Spa&szlig; f&auml;ngt aber erst ab AmigaDOS 2.04 an, abgesehen
davon sind die Anforderungen minimal. Da&szlig; der CD32-Emulator
Extraw&uuml;nsche anmelden will, ist einleuchtend (OS 3.0 / 3.1, 2 MB
Chip-, 1 MB Fastram, MC68EC020+, AGA, und m&ouml;glichst ein
Double-Speed-Laufwerk).<BR>

<BR>CDFSprefs ist ein Tool, das die Einstellungen des CacheCDFS
&quot;live&quot; &auml;ndern kann, ohne da&szlig; ein Reboot notwendig ist.
KillDev meldet ein Laufwerk ganz ab. PlayCD spielt auch recht nett sowie
gut dokumentiert. Grafisch schaut es zwar furchtbar grindig aus, aber
immerhin gibts einen Balken f&uuml;r die Liedposition zum hin- und
herziehen, und im Gegensatz zum MCDPlayer des Blizzard-CyberSCSI-Pakets
funktioniert der schnelle Vor- und R&uuml;cksuchlauf.<BR>

<BR>Die Anleitung auf der Diskette erz&auml;hlt uns auch noch alles
&uuml;ber die Theorie der Cache-Funktion. Selbige kann der User zwecks
optimierter CD-Rom-Nutzung ganz nach Belieben konfigurieren.<BR>

<BR><CENTER><A NAME="03" HREF="#02"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR>Der CD32-Emulator scheint auch ein recht geniales Ding zu sein. Die
Programmierer haben alles versucht, um die Emulation dem Original
m&ouml;glichst nahe kommen zu lassen. Alle speziellen Funktionen wie das
batteriegepufferte RAM oder die eingestelle Benutzersprache werden
mitemuliert, und ein &quot;Degrader&quot; sorgt notfalls daf&uuml;r,
da&szlig; ein zu guter Rechner mit zuviel RAM, Speed etc. quasi auf
CD32-Niveau gedrosselt wird. Sogar das Joypad kann per Tastatur emuliert
werden. Bei all der Funktions- und Optionsvielfalt gibt es nur ein Manko:
CDTV-Titel kann das Ding leider nicht zum Laufen bringen.<BR>

<BR>Andere Tools inkludieren das automatische Parken der Festplatte oder
eine CD-Eject-Funktion. MultiVolume l&auml;&szlig;t mehrere logische CDs
sich auf einer CD vereinen (ups, ob die sich dann wohl auch vermehren?).
LS120-ATAPI-Disketten werden genauso unterst&uuml;tzt wie
ATAPI-CD-Wechsler. Ganz generell sollten auch CD-Writer dank IDEfix keine
Probleme mehr machen. Sogar Platten mit mehr als 4 GB werden verwendbar.
Was doch nicht alles an gro&szlig;artigen Dingen in dieser kleinen Disk
steckt! Aber ich will mich nicht mehr l&auml;nger damit aufhalten und kehre
lieber wieder zur&uuml;ck zum Einbau meiner Adapter.<BR>

<BR><CENTER><A NAME="04" HREF="#03"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Und jetzt ab die Post!</B></H3>&nbsp;

<BR>Soweit, so gut. Aber was hab ich jetzt - von den Tools und ihrer
N&uuml;tzlichkeit mal abgesehen - davon, da&szlig; mein Amiga halboffen
herumsteht, wenn ich ohnehin kein dringendes Bed&uuml;rfnis habe,
irgendwelche IDE- oder ATAPI-Devices anzuh&auml;ngen? Nat&uuml;rlich gar
nichts, keine Frage, aber darum geht es ja gar nicht. Wer auch immer das
Bed&uuml;rfnis doch versp&uuml;rt, wird sich an dem Testobjekt gewi&szlig;
erfreuen k&ouml;nnen - wie auch immer er das interne Platzproblem zu
l&ouml;sen gedenkt. Ich f&uuml;r meinen Teil mache mich lieber mal am
Express-Adapter zu schaffen, der ja f&uuml;r geniale
Geschwindigkeitssteigerungen sorgen soll. Auch hier ist die Anleitung
zweckm&auml;&szlig;ig, aber ausreichend, und die Sachlage steht eindeutig
fest: der Gayle-Chip des A1200 wird eine M&uuml;tze verpa&szlig;t
bekommen.<BR>

<BR>Pfeile deuten die korrekte Ausrichtung an, und eigentlich kann nichts
mehr schiefgehen. Aber halt! Der Versuch, den Aufsatz auf dem Gayle-Chip zu
montieren, scheitert kl&auml;glich durch fehlenden Halt. Ich wundere mich
kr&auml;ftig, und auch mein Bruder blickt reichlich ratlos drein. Ein
Versuch zeigt, da&szlig; die Montage in allen um 90, 180 oder 270 Grad
verdrehten Positionen rein vom Halt her m&ouml;glich w&auml;re, nur eben
nicht in der vorgesehenen. Mist! Da ich vorzugsweise nicht krampfhaft mit
Tixo und anderen Utensilien herumzuwerkeln gedenke, um das Teil dazu zu
zwingen, dort zu verbleiben, wo es eigentlich hinsollte (mein 1200er sollte
noch eine Weile &uuml;berleben, und abgesehen davon: wo kein Kontakt ist,
kann ja gar nie nix funzen!), resigniere ich frustriert und baue das Kastl
wieder aus. Schade, die H&auml;lfte des Testberichtes mu&szlig; also
entfallen. Aber ich kann es ja noch mit einem anderen 1200er und einem
anderen Express-Adapter versuchen, vielleicht sind die sich dann
gegenseitig sympathischer und der Geil- &auml;h Gay-, nein, Gayle-Chip
l&auml;&szlig;t sich bereitwillig besteigen.<BR>

<BR><CENTER><A NAME="05" HREF="#04"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#06"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><H3><B>Es geht dem Ende zu</B></H3>&nbsp;

<BR>... aber gottseidank betrifft dies nur den Artikel, keine Sorge! Aus
dem abschlie&szlig;enden Fazit und der Bewertungsbox will ich den
Express-Adapter ausnehmen, zumal dieses &quot;Ergebnis&quot; (hoffentlich)
nicht dem Regelfall entsprechen wird. Zum Rest ist zu sagen: die
Dokumentation ist zwar nicht &uuml;berragend genial, aber doch sehr gut,
klar und ausf&uuml;hrlich. Der Funktionsumfang erfreut das Herz des
Amigianers und bringt gewi&szlig; einige Verbesserungen mit sich. Alles
l&auml;uft (bis jetzt) stabil und ohne Probleme, und f&uuml;r eventuelle
Troubles ist in den Docs durch entsprechende Vermerke und Tips gleich
vorgesorgt. Lediglich die Sache mit dem Einbau des A1200-Adapters
st&ouml;rt ein wenig, da ein offener Amiga gewi&szlig; nicht zu den
praktischsten Erfindungen dieser Welt zu rechnen ist. Die
Mindestanforderungen schwanken, aber prinzipiell wird nichts
Unm&ouml;gliches oder Wahnwitziges vom User verlangt.<BR>

<BR>Last but not least ein empfehlenswertes Ding, das steht ganz
au&szlig;er Zweifel!<BR>

<BR><CENTER><A NAME="06" HREF="#05"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_li.gif" ALT=" " BORDER=0></A><A HREF="#99"><IMG WIDTH=13 HEIGHT=26 SRC="../images/_schraeg_re.gif" ALT=" " BORDER=0></A></CENTER>&nbsp;

<BR><TABLE BORDER=4 BGCOLOR="#EEEEEE" CELLPADDING=3 CELLSPACING=0 ALIGN=CENTER>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Bedienung</TD>       <TD><IMG SRC="../images/_box_red.gif" WIDTH=73 HEIGHT=10 ALT="[73]"><IMG SRC="../images/_box_black.gif" WIDTH=27 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Features</TD>        <TD><IMG SRC="../images/_box_red.gif" WIDTH=83 HEIGHT=10 ALT="[83]"><IMG SRC="../images/_box_black.gif" WIDTH=17 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Qualit&auml;t</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=86 HEIGHT=10 ALT="[86]"><IMG SRC="../images/_box_black.gif" WIDTH=14 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Preis/Leistung</TD>  <TD><IMG SRC="../images/_box_red.gif" WIDTH=60 HEIGHT=10 ALT="[60]"><IMG SRC="../images/_box_black.gif" WIDTH=40 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Stabilit&auml;t</TD> <TD><IMG SRC="../images/_box_red.gif" WIDTH=90 HEIGHT=10 ALT="[90]"><IMG SRC="../images/_box_black.gif" WIDTH=10 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT>Dokumentation</TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=82 HEIGHT=10 ALT="[82]"><IMG SRC="../images/_box_black.gif" WIDTH=18 HEIGHT=10 ALT="/[100]"></TD></TR>
<TR VALIGN=MIDDLE><TD ALIGN=RIGHT><B>Gesamt</B></TD>   <TD><IMG SRC="../images/_box_red.gif" WIDTH=85 HEIGHT=10 ALT="[85]"><IMG SRC="../images/_box_black.gif" WIDTH=15 HEIGHT=10 ALT="/[100]"></TD></TR>
</TABLE>&nbsp;

<!--END-->

			<BR>
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=TOP ALIGN=LEFT>
				<P ALIGN=RIGHT>

					<A HREF="as-redax.html#wolfi">Wolfgang Lukas</A>
					&nbsp;&nbsp;&nbsp;
					<A HREF="../deutsch/0x00F2.html"><IMG WIDTH=16 HEIGHT=10 SRC="../images/__german.gif" ALT="[ german ]" VSPACE=0 HSPACE=0 BORDER=1></A>
					&nbsp;&nbsp;&nbsp;
					<BR>

				</P>
<!--E_MAIL-->
<!--BOTTOM-->
<!--BANNER-->
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=TOP ALIGN=CENTER> &nbsp; 
<!--REDBOT-->
			</TD>
		</TR>
		<TR>
			<TD BGCOLOR="#FFFFFF" VALIGN=MIDDLE ALIGN=LEFT>
				<A HREF="#00"><IMG SRC="../images/_krumm_hi.gif" WIDTH=37 HEIGHT=29 BORDER=0 ALT="[Up]"></A>
				<A NAME="99"><FONT COLOR="#FFFFFF">&nbsp;</FONT></A>
			</TD>
			<TD BGCOLOR="#BF0000" VALIGN=BOTTOM ALIGN=RIGHT>
				<A HREF="0x00F1.html"><IMG SRC="../images/_gerade_li.gif" WIDTH=22 HEIGHT=41 ALT="{" BORDER=0></A><A HREF="0x00F3.html"><IMG SRC="../images/_gerade_re.gif" WIDTH=23 HEIGHT=41 ALT="}" BORDER=0></A>
			</TD>
		</TR>
	</TABLE>
</BODY>
</HTML>
