<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - ISDN-Master II</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>ISDN-Master II</U></H1><P ALIGN="CENTER">von<BR><A HREF="T.Heinrich@t-online.de">Thomas Heinrich</A></P>
<P ALIGN=CENTER><A HREF="http://www.ithnet.com"><IMG WIDTH=346 HEIGHT=137 SRC="../amz1297/images/isdn.gif" BORDER=0 ALT="ISDN-MasterII Bild"></A>
<FONT SIZE="-2">&copy; 1997 ith</FONT></P>

<P ALIGN="CENTER">(Es steht ein <A HREF="9712glos.htm">Glossar</A> mit Begriffserkl&auml;rungen zur Verf&uuml;gung.)</P>

<P><B>Amiga und ISDN</B></P>

<P>Das Angebot von ISDN-Adaptern f&uuml;r Amiga-Computer ist nicht sehr reichlich
best&uuml;ckt. Zwar gibt es einige externe ISDN-Adapter, die man problemlos
auch am Amiga verwenden kann, aber dann erfolgt der Anschlu&szlig; &uuml;ber die
serielle Schnittstelle - und die ist bekanntlich nicht die Schnellste.</P>

<P>Um einen ISDN-Adapter &uuml;ber die serielle Schnittstelle einigerma&szlig;en
effizient anzusprechen, ben&ouml;tigt man eine Schnittstellengeschwindigkeit
von mindestens 115 kBit/s. Zu viel f&uuml;r einen Amiga ohne serielle
HighSpeed-Karte.</P>

<P>Die einfachste und schnellste L&ouml;sung ist ein ISDN-Adapter f&uuml;r den
Zorro-Slot (beim Amiga 1200 f&uuml;r den PCMCIA-Port; ich beziehe mich
allerdings im folgenden auf die Zorro-Version der ISDN Master II).</P>

<P>Eingesetzt werden kann die ISDN Master II in jeden Zorro-II/III Slot,
also serienm&auml;&szlig;ig in die Amigamodelle 2000, 3000(T) und 4000(T). Ob auch
Towerl&ouml;sungen f&uuml;r die anderen Amigas in Frage kommen, kann beim jeweiligen
Hersteller des Towers erfragt, oder in einschl&auml;gigen Tower-Kompatibilit&auml;tstests
nachgelesen werden. Mir ist es leider nicht m&ouml;glich, eine solche Konfiguration zu testen.</P>

<P>Der Hersteller der ISDN Master II ist die Firma &quot;<B>ith</B>&quot;. Es lohnt sich,
einmal auf der Homepage der Firma vorbeizusurfen und die Preise zu
vergleichen. Allerdings ist hier auch etwas Vorsicht geboten: Die
Homepage wurde seit dem 14. April nicht mehr gepflegt.</P>

<P><B>Grundvoraussetzung</B> f&uuml;r die ISDN Master II ist also ein Amiga mit
mindestens einem freien Zorro-II Slot und nat&uuml;rlich ein ISDN-Anschlu&szlig;.
Da die Karte autokonfigurierend ist, ist auch mindestens Kickstart 1.3
Pflicht. Moderne Software gibt es f&uuml;r dieses Betriebssystem nat&uuml;rlich
nicht mehr, weshalb also Kickstart 2.0 oder h&ouml;her angeraten ist.</P>

<P>Die mitgelieferten Programme setzen sowieso Kickstart 2.0 voraus, au&szlig;erdem
einen 68020 Prozessor, 512 kB freies RAM und eine Festplatte. Das sind die
absoluten Mindestanforderungen, vor allem mehr RAM sollte schon sein, um
vern&uuml;nftig arbeiten zu k&ouml;nnen. Um heute DF&Uuml; mit den g&auml;ngigen Programmen
betreiben zu k&ouml;nnen, sollte man schon 4 MB Fast-RAM zur Verf&uuml;gung haben.
Das gilt umso mehr, wenn man vor hat, sich ans Internet anzuschlie&szlig;en.</P>

<P>Die Deutsche Telekom besteht au&szlig;erdem auf noch weiteren Voraussetzungen.
Es darf in Deutschland kein Ger&auml;t am Kommunikationsnetz der Telekom
betrieben werden, das daf&uuml;r nicht zugelassen ist. Die ISDN Master II
besitzt die BZT-Zulassung f&uuml;r Deutschland und das CE-Zeichen, das den
Betrieb auch im restlichen Europa zul&auml;&szlig;t.</P>

<B>Die ISDN Master II / ZII</B>

<P>Die ISDN Master II ist eine Karte mit voller L&auml;nge, versperrt also auch
einen ISA-Slot oder den Videoslot, je nach Installation. &Uuml;berw&auml;ltigend
sind die Anschlu&szlig;m&ouml;glichkeiten: Der ISDN-Bus ist durchgef&uuml;hrt, es k&ouml;nnen
also auch noch weitere ISDN-Ger&auml;te nach der ISDN Master II angeschlossen
werden.</P>

<P>Ein Telefonh&ouml;rer oder ein Headset k&ouml;nnen ebenfalls angeschlossen
werden. F&uuml;r das Headset ben&ouml;tigt man allerdings die Telefonerweiterung
&quot;Arcofiexp&quot;. An diese kann man auch ein Mikrofon und einen Lautsprecher
zum Freisprechen anschlie&szlig;en. Daneben erh&auml;lt man so nebenbei auch einen
Mono-Sampler.</P>

<P>Auch die interne Erweiterung ist gut: Zwei Erweiterungsports lassen sich
mit Modulen aufr&uuml;sten - zur Zeit gibt es jedoch nur ein Telefonmodul zu
kaufen, das aus der ISDN Master II ein vollwertiges Telefon machen soll.
Der zweite (digitale) Port ist auf meinem Exemplar noch nicht einmal mit
einem Stecker versehen, also wird wohl auch keine Erweiterung daf&uuml;r in
Arbeit sein.</P>

<B>Lieferumfang</B>

<P>Zwei Disketten, ein Handbuch, ein Faltblatt zu Miami und AmigaOnline,
zwei Bl&auml;tter mit der ausgedruckten FAQ-Liste und die Karte selbst. Die
Verpackung war zwar innen mit antistatischem Schaumstoff gepolstert,
die Karte selbst aber nicht in einer antistatischen T&uuml;te. Also extreme
Vorsicht beim &Ouml;ffnen des Kartons, m&ouml;glichst nicht die Karte ber&uuml;hren.
Erst an ein geerdetes Metallteil wie z.B. ein Wasserrohr fassen, um
sich zu entladen!</P>

<B>Installation der Karte</B>

<P>Die Installation ist recht einfach: Amiga aufschrauben, freien Zorro-Slot
suchen, Karte einstecken, Amiga wieder zuschrauben. Aber halt, so einfach
ist es leider doch nicht. Vor dem Zusammenschrauben sollte man unbedingt
einen Funktionstest durchf&uuml;hren.</P>

<P>Aufpassen mu&szlig; man au&szlig;erdem beim Einsetzen der Karte. Da die ISDN Master
recht schmal ist, verwindet sie sehr leicht. War in einem Zorro-Slot noch
nie eine Karte eingesetzt, ist normalerweise sehr viel Kraft erforderlich,
um das erste Mal eine einzusetzen. Die ISDN Master kann hier sehr leicht
zerbrechen.</P>

<P>Bei meinem Mikronik-Tower gab es zus&auml;tzlich das Problem, da&szlig; die Karte
nicht sauber ins Slotblech passte. Das ist ein Problem des Towers, nicht
der Karte. Die Karte ist zwar flexibel genug, um sie mit der Schraube
am Slotblech zu fixieren, jedoch rate ich dringendst davon ab. Die
ISDN Master wird dabei gebogen, und wenn sich dann im Betrieb Bauteile
erw&auml;rmen, kann es sein, da&szlig; diese sich von der Platine l&ouml;sen, oder Risse
in den Leiterbahnen verursachen. Solche Fehler sind schwer zu finden und
meist irreparabel.</P>

Aber auch sonst gibt es noch zwei <B>Stolperfallen</B>:

<P>Die erste H&uuml;rde besteht darin, da&szlig; man Interrupt 2 oder 6 belegen kann.
Auf dem Amiga sollte man mit so einer Frage eigentlich gar nicht belastet
werden, schlie&szlig;lich gibt es AutoConfig&#174;. Laut &quot;ith&quot; kann ein alter
GVP-Festplattencontroller Probleme am Interrupt 6 verursachen, genauso k&ouml;nnen
Fehler auftreten, wenn der ISDN Master und die serielle Schnittstelle
gleichzeitig arbeiten. Zumindest das letzte Problem deutet auf leichte
Kompatibilit&auml;tsprobleme der Hardware der ISDN Master hin.</P>

<P>Das Handbuch sagt zum Thema Interrupt, da&szlig; 6 voreingestellt sei. Meine
Karte war jedoch auf 2 eingestellt, was auch logischer ist, denn so geht
man den zuvor beschriebenen Problemen auf jeden Fall aus dem Weg.</P>

<P>Die zweite H&uuml;rde stellt die Polarit&auml;t der angeschlossenen ISDN-Ger&auml;te dar.
Alle Ger&auml;te m&uuml;ssen gleich gepolt sein, zu diesem Zweck kann man auf der
ISDN Master die Polung mittels zweier Steckbr&uuml;cken vertauschen. Sollte
die Karte nicht einwandfrei laufen, kann man hier probieren, ob die
Polung etwas damit zu tun hat. Bei mir traten aber keine Probleme auf,
obwohl sich die ISDN Master den ISDN-Anschlu&szlig; mit einer Telefonanlage
teilt.</P>

<B>Das Handbuch</B>

<P>Um es vorwegzunehmen: Es ist keine gro&szlig;e Hilfe. Am besten gibt das
ausgedruckte FAQ Auskunft, mit dessen Hilfe man tats&auml;chlich Miami ohne
M&uuml;he dazu &uuml;berreden kann, eine Verbindung zum Internet herzustellen -
vorausgesetzt nat&uuml;rlich, man hat einen Account.</P>

<P>Das Handbuch beschreibt nur drei Dinge recht ausf&uuml;hrlich: Die
Installation, die emulierten AT-Kommandos des &quot;fossil.device&quot; und
die Telefonsoftware &quot;Wilhelm Tel&quot;. Letztere ben&ouml;tigt zur einigerma&szlig;en
komfortablen Funktion das Telefonmodul, das mit knapp 50 DM extra zu
Buche schl&auml;gt.</P>

<B>Die Software der ISDN Master II</B>

<P><B>Kompatibitit&auml;t</B>:<BR>
Fast die gesamte Software l&auml;uft auf meinem Amiga. Laut &quot;ith&quot; wird
jedes Kickstart ab 2.0 unterst&uuml;tzt. Die Bedienoberfl&auml;chen sind auch
so ausgelegt, das hei&szlig;t, sie nutzen nicht alle M&ouml;glichkeiten des
Kickstart 3.1, was man ihnen sofort ansieht, sind aber leicht zu
durchschauen und Style-Guide-gerecht.</P>

<P><B>AmigaOnlinePPE</B>:<BR>
Dies ist ein BTX-Decoder, der ISDN in dieser Spezialversion gar nicht
unterst&uuml;tzt. Diese lizensierte Version von AmigaOnline plus l&auml;&szlig;t nur
eine Einwahlgeschwindigkeit von 2400 (!!!) Baud zu. Wie ich finde,
eine Zumutung.</P>

<P>Zudem unterst&uuml;tzt er nur CEPT, also nicht das grafisch um L&auml;ngen
bessere KIT. Zudem ist die Oberfl&auml;che vom Amiga Style Guide weitgehend
unbeeindruckt. Mit Abstand das schw&auml;chste St&uuml;ck Software zur ISDN Master.</P>

<P><B>Miami V1.1 und Voyager 1.0</B>:<BR>
Demoversion der bekannten Software f&uuml;r den Internetzugang. Voyager ist
au&szlig;erdem PD, also eine kostenfreie Vollversion. Eine nette Dreingabe, die
allerdings durch die v&ouml;llig veralteten Versionen ziemlich eingeschr&auml;nkt
wird.</P>

<P><B>Das capi20.device</B>:<BR>
Das CAPI der ISDN Master II unterst&uuml;tzt den Standard nach Version 2.0.
Dies ist im Augenblick auch die aktuelle Version. Au&szlig;erdem werden alle
wichtigen ISDN-Protokolle unterst&uuml;tzt, wie HDLC, X.75, V.110, BTX und
EuroISDN.</P>

<P>Daneben k&ouml;nnen acht ISDN Master II-Karten  gleichzeitig von dem Device
verwaltet werden, was nat&uuml;rlich h&ouml;chstens f&uuml;r eine aufwendige Mailbox
in Frage kommt. Rechnet man f&uuml;r jede Karte einen ISDN-Anschlu&szlig;, hat man
24 Rufnummern, und knapp 400 DM im Monat weniger im Geldbeutel.</P>

<P>Verwendet wird das capi.device von Kommunikationsprogrammen, die direkt
und ohne Umweg das ISDN-Ger&auml;t ansprechen, z.B. um die beiden Kan&auml;le zu
b&uuml;ndeln. Im Klartext hei&szlig;t das, auf dem Amiga verwendet es eigentlich
niemand. </P>

<P><B>Das fossil.device</B>:<BR>
Die meisten (sprich: alle) Kommunikationsprogramme des Amiga verstehen
nur die Modemsprache (Hayes-Befehlssatz oder auch AT-Kommandos). </P>

<P>Das fossil.device ist nun daf&uuml;r zust&auml;ndig, diese Modembefehle abzufangen
und in f&uuml;r ISDN-Ger&auml;te verst&auml;ndliche Kommandos umzuformen. Zus&auml;tzlich
bekommt man so nat&uuml;rlich direkten Zugriff auf die Useraktionen und kann
sie mitprotokollieren. Das fossil.device bietet daher auch ein Geb&uuml;hren-Logfile.</P>

<P><B>Das iwan.device</B>:<BR>
Diese Software wurde zwar versprochen, ist aber auf keiner der beiden
Disketten zu finden. Statt dessen findet sich die Demoversion von Miami
in der Version 1.1 und der WWW-Browser Voyager Version 1.0 (Public Domain)
auf den Disketten. &Uuml;berhaupt macht die gesamte Gestaltung des ISDN Master
den Eindruck, als w&auml;re seit einem Jahr nichts mehr an Hard- und Software
getan worden, was auch die Versionsnummern von Miami und Voyager nahelegen.</P>

<P>Das iwan.device kann man aber per FTP von &quot;ith&quot; abrufen. Das Device
erm&ouml;glicht es einer entsprechenden Software, Amigas mit ISDN-Master-Karten
in ein TCP/IP-Netz einzubinden, ist also nur f&uuml;r vernetzte Rechnersysteme
sinnvoll, die au&szlig;erdem r&auml;umlich weit getrennt sind (Isdn Wide Area
Network = IWAN). Die Shareware kostet 40 DM, ist aber seit einem
Jahr nicht weiterentwickelt worden.</P>

<P><B>WilhelmTel II</B>:<BR>
Ein Telefonprogramm, das auch als Anrufbeantworter fungieren kann. Es
bietet zahlreiche M&ouml;glichkeiten, die Adressen, Geb&uuml;hren, Klingelsignale,
Wartemusik und dergleichen mehr zu konfigurieren, ben&ouml;tigt dazu allerdings
das Telefonmodul. Ohne dieses ist es noch als Anrufbeantworter von Nutzen.
Ich pers&ouml;nlich sehe keinen Sinn darin, den Amiga tagaus-tagein laufen zu
lassen, um keinen Anruf zu verpassen. Ein ganz normaler Anrufbeantworter
ist um L&auml;ngen effektiver und letztlich auch billiger.</P>

<P><B>Diverse Tools</B>:<BR>
<B>StateMon</B> - Zeigt den Zustand des ISDN-Busses als Modem-Zustandsleuchten
an. Recht n&uuml;tzlich, da ISDN keinen W&auml;hlton von sich gibt, wie ein Modem.
Man sieht sofort, ob man noch Online ist, oder nicht.</P>

<P><B>IMon</B> - Fertigt einen Mitschnitt einer Online-Session an, mit vielen
detaillierten Informationen, die wohl den Wenigsten etwas sagen werden
und auch die Wenigsten brauchen werden.</P>

<P><B>ISDNPrefs</B> - Gutes Voreinstellerprogramm f&uuml;r das &quot;fossil.device&quot;.
Leider fehlt jegliche Dokumentation dazu, so da&szlig; man sehr oft raten oder
ausprobieren mu&szlig;, welche Funktion von welcher Einstellung beeinflu&szlig;t wird.</P>

<B>Unterst&uuml;tzung</B>

<P>Es existiert eine FAQ-Liste zum Thema ISDN Master II, aus der man
herauslesen kann, da&szlig; die Karte z.B. nur im ersten Slot eines
A1200-Towers von RBM richtig funktioniert, wie man mit Problemen mit
dem TCP-Stack Miami fertig wird und da&szlig; der A600 zu wenig Rechenpower
f&uuml;r die Karte hat. Diese Liste liegt sogar ausgedruckt der ISDN Master
bei.</P>

<P>F&uuml;r Programmierer gibt es eine Beschreibung der CAPI-Schnittstelle,
dummerweise jedoch gemischt in deutsch und englisch dokumentiert.
Anwendungen f&uuml;r die ISDN Master II sind deshalb wohl eher von
deutschsprachigen Programmierern zu erwarten...</P>

<P>Die Beschreibung der Programmierung ist jedoch &uuml;bersichtlich und von
jedem Programmierer mit etwas C- und AmigaOS-Erfahrung zu bew&auml;ltigen,
sogar ein Beispielprogramm ist vorhanden.</P>

<P>Zug&auml;nglich ist diese Unterst&uuml;tzung f&uuml;r jeden, auch ohne im Besitz der
Karte zu sein, unter
<A HREF="ftp://ftp.ithnet.com/support/amiga/ISDN-MasterII/">ftp://ftp.ithnet.com/support/amiga/ISDN-MasterII/</A>.
Dort findet man auch die FAQ-Liste in der neuesten Version.</P>

<B>Zubeh&ouml;r gegen Aufpreis</B>

<P>Ein &quot;Telefonie-Modul&quot; mit Namen &quot;arcofiexp&quot; (Bezeichnung von PPE/ith),
das die ISDN Master II vom Anrufbeantworter zum vollwertigen Telefon
aufr&uuml;sten soll. Preis: 49 DM</P>

<B>Bewertung</B>

<P>Als erfahrener Anwender kann ich die Karte als &quot;gut&quot; bewerten, als
Einsteiger m&uuml;sste ich sagen: &quot;mangelhaft&quot;. Wenn man sich etwas in der
Materie auskennt, sind die Stolperfallen, die durch die mangelnde
Produktpflege ausgelegt sind, recht leicht zu umschiffen. Als Neuling
wird man zwangsl&auml;ufig Dauergast der Hotline sein.</P>

<B>Positiv</B>:

<P>Relativ leichter Einbau, erwartungsgem&auml;&szlig; hohe Geschwindigkeit,
gute Unterst&uuml;tzung auch f&uuml;r Programmierer und genug Software f&uuml;r
den Soforteinstieg in die DF&Uuml;.</P>

<P>Auch exotische Hard- und Softwarekombinationen sind kein Problem. Der
ISDN-Bus ist durchgef&uuml;hrt, viele Zusatzfunktionen sind vorhanden, bzw.
k&ouml;nnen nachger&uuml;stet werden.</P>

<B>Negativ</B>:

<P>Sicherheitsm&auml;ngel: Die Karte war nicht einmal in eine antistatische
T&uuml;te gepackt.</P>

<P>Die Dokumentation zur mitgelieferten Software ist teils sehr ausf&uuml;hrlich,
aber teils auch gar nicht vorhanden. F&uuml;r Anf&auml;nger schlicht unzumutbar.</P>

<P>Die Einstellung der Interrupts ist nicht Amiga-like und dar&uuml;ber hinaus
unn&ouml;tig.</P>

<B>Empfehlung</B>

<P>Wer derzeit mit dem Gedanken spielt, auf ISDN umzusteigen, der ist
mit der ISDN Master II sicher gut bedient, zumal die Einrichtung des
Anschlusses &uuml;ber eine Drittfirma wie &quot;PPE&quot; einen Preisvorteil von 33 %
gegen&uuml;ber dem normalen PPE-Verkaufspreis der ISDN Master II bringt.
Gegen&uuml;ber dem Verkaufspreis direkt &uuml;ber &quot;ith&quot; spart man immerhin
noch 13 %.</P>

<P><B>Achtung</B>: Der manchmal propagierte Wegfall der Bereitstellungsgeb&uuml;hr von
100 DM ist eine Ente. Diese Geb&uuml;hr wird von der Telekom immer erhoben,
wenn ein Anschlu&szlig; umgestellt oder eingerichtet wird. Auch Telekom-Partner
haben hier keinen Verhandlungsspielraum. Der Anreiz, ISDN &uuml;ber eine
Drittfirma anzumelden, liegt rein im Preisvorteil der Hardware begr&uuml;ndet.</P>

<P>M&ouml;chte man zus&auml;tzlich noch einen T-Online Zugang haben, kann man durch
die Ausf&uuml;hrung &uuml;ber &quot;PPE&quot; oder andere Firmen 50 DM Anmeldegeb&uuml;hr sparen.</P>

<P>Verglichen mit den PC-Karten kostet die ISDN Master II etwas mehr, bietet
aber immerhin den gleichen Funktionsumfang. Wer z.B. &uuml;ber Siamese, oder
einem lokalen Netzwerk mit einem PC vernetzt ist, der sollte lieber auf
die PC-Varianten zur&uuml;ckgreifen, obwohl mir dort einige
Installationsprobleme bei manchen Karten zu Ohren gekommen sind.</P>

<P>Da aber die meisten wohl nur ihren Amiga zu Hause stehen haben d&uuml;rften,
kann man sagen: Hat man eine schnelle serielle Schnittstellenkarte, ist
man mit einem externen ISDN-Adapter besser bedient. Die kosten zwar
genauso viel, sind aber mobiler und versperren keinen Zorroslot, die
z.B. im A4000-Desktop viel zu schnell alle belegt sind.</P>

<P>Hat man keine schnelle serielle Schnittstelle, ist die Einsteckkarte
von Vorteil. Zus&auml;tzlich hat man mehr Platz auf dem Schreibtisch, als
bei einem externen Adapter.</P>

<P>Will man die schon vorhandenen Analogger&auml;te weiterverwenden - z.B.
Telefon, Faxmodem - bietet sich au&szlig;erdem ein TA-Adapter (Telefonanlage)
an. Hier bietet die ISDN Master II durch den durchgef&uuml;hrten ISDN-Bus
einen Vorteil, wenn man noch mit ISDN-Ger&auml;ten erweitern will. TA-Adapter
gibt es ab 189 DM aufw&auml;rts.</P>

<DIV ALIGN=CENTER><A HREF="../sw/9712test.htm">&quot;Testkonfiguration&quot;</A></DIV>

<BR>
<TABLE ALIGN="CENTER" BORDER="1">
<TR>
    <TH>Produkt:</TH><TD>ISDN-Master II/Zorro2</TD><TH>Hersteller:</TH><TD><A HREF="http://www.ithnet.com">ith</A>&#179;</TD>
</TR>
<TR>
    <TH>Art:</HT><TD>passive ISDN-Karte</TD><TD>Version:</TD><TD>1.917</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>299 DM / 229 DM / 199 DM &#185; + VP</TD><TH>Bez.Quelle:</TH><TD>PPE&#178;</TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">1</TD><TD ALIGN="CENTER" COLSPAN="2" ROWSPAN="4"><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlichkeit:</TH><TD ALIGN="CENTER">3</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN="CENTER">3</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN="CENTER">2</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TH COLSPAN="2">2</TH>
</TR>
</TABLE>

<P>&#185; 299 DM im Einzelverkauf &uuml;ber &quot;PPE&quot;,<BR>
  229 DM im Einzelverkauf &uuml;ber &quot;ith&quot;,<BR>
  199 DM im Paket mit der ISDN-Anmeldung &uuml;ber PPE; jeweils ohne Telefonmodul</P>

&#178; <ADDRESS><A HREF="http://www.ppe-online.de">PPE</A> (Performance Peripherals Europe)<BR>
  Silcherstra&szlig;e 16<BR>
  D - 53332 Bornheim<BR>
  Tel. 02227 912097<BR>
  Fax: 02227 3221<BR>
  </ADDRESS>

&#179; <ADDRESS><A HREF="http://www.ithnet.com/">ith Kommunikationstechnik GmbH</A><BR>
  Reiterstra&szlig;e 24<BR>
  D - 94447 Plattling<BR>
  Tel. 09931 9188 0<BR>
  Fax: 09931 9188 44<BR>
  </ADDRESS>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../sw/9712pbbd.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712isd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
