<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - Cybervision64/3D</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>CyberVision 64/3D</U></H1><P ALIGN="CENTER">von<BR><A HREF="C.Jahn@gmx.de">Carsten Jahn</A></P>

<P>Die CyberVision ist eine Grafikkarte vom Hersteller Phase5. Sie findet in
einem Zorro-2- oder Zorro-3-Slot Platz. Phase5 gibt einen 68020-Prozessor
als Minimum an, ebenfalls sollte einiges FastRAM (ich habe nach dem Kauf
der Karte von 12 auf 16MB aufger&uuml;stet) und OS 3.0 vorhanden sein.</P>

<B>Einbau der Karte:</B>

<P>Der Einbau der Platine gestaltete sich auch nicht schwieriger als der
Einbau meines Oktagon-Controllers. Beide gingen sehr schwer in den Slot
zu schieben. Wer solch eine Karte zum ersten Mal einsetzt, mu&szlig; vorher
den Mut aufbauen, kr&auml;ftig zuzudr&uuml;cken. In meinem Fall war die Hemmschwelle
erst nach einer halben Stunde auf die ben&ouml;tigte Kraft heruntergerutscht.
F&uuml;r diesen psychischen Proze&szlig; kann man sich ruhig Zeit lassen.</P>

<P>Ein technischer Tip: nachdem ich mich die halbe Stunde lang abgem&uuml;ht
habe, lie&szlig; ich die Karte im Slot stecken (soweit ich gekommen bin), um
eine Pause zu machen. Nach einer Stunde &quot;rastete&quot; die Karte beim ersten
Versuch ein.</P>

<P>Ich habe den Monitor am Amigaausgang gelassen (die Cybervision hat in
der Grundausstattung keinen Scandoubler und schleift auch nicht das
Amigasignal durch) und den Rechner eingeschaltet. Es hat nun l&auml;nger
gedauert, bis der erste Festplattenzugriff erfolgte, wahrscheinlich,
weil es eine Karte mehr zu erkennen gibt. Man sollte nicht gleich
erschrecken, und glauben, etwas w&auml;re fehlerhaft.</P>

<B>Softwareinstallation:</B>

<P>Die ging eigentlich problemlos. Ein Skript war der Meinung, ich h&auml;tte
CyberGraphX (das mitgelieferte Treibersystem) bereits installiert und
versuchte sich an einem Backup von CyberGraphX mit anschlie&szlig;endem
L&ouml;schen der alten Version. Das Skript brach jedoch wegen eines Fehlers
ab. Davon ungest&ouml;rt lief das eigentliche Installationsskript, das das
Uninstall-Skript gestartet hatte, problemlos weiter.</P>

<P>Weil ich damals einigen Bl&ouml;dsinn in meiner Startup-Sequence gemacht
hatte, wurde der Monitortreiber (devs/monitors) von CyberGraphX nicht
beim Booten gestartet. Das Original der Startup-Sequence startet jeden
Treiber in devs/monitors.</P>

<P>Es hat mich einen Tag gekostet, aber dann hatte ich meinen eigenen
Fehler entdeckt. In der Zwischenzeit habe ich die neue Version von
CyberGraphX von der Supportpage (www.vgr.com) geladen, so da&szlig; ich zum
mitgelieferten CyberGraphX nicht viel sagen kann. Ich gehe aber davon
aus, da&szlig; meine neue Beta sich nicht stark von der Version auf der
Diskette unterscheidet, jedenfalls stimmten der Screenshot u.&auml;.</P>

<P>Nach einem Reset konnte ich jetzt den CyberVision-Bildschirmmodus im
Screenmode-Voreinsteller einstellen und auf &quot;Speichern&quot; klicken. Der
Bildschirm wird schwarz, er ist ja am Amiga angeschlossen.</P>

<P>Rechner und Monitor ausschalten, auf den Grafikkartenausgang
umst&ouml;pseln, einschalten, l&auml;uft.</P>

<P>Diese Prozedur h&auml;tte man im Handbuch erw&auml;hnen k&ouml;nnen. Phase5 verl&auml;&szlig;t
sich wohl darauf, da&szlig; es jedem Anwender einleuchtet, wie er den
Monitor zur Installation anschlie&szlig;en mu&szlig;, um etwas zu sehen. </P>

<B>Leistung:</B>

<P>Die Grafik wird ganz sch&ouml;n flott. :-) Insbesondere XiPaint im
24bit-Modus hat mir gefallen, aber bei allen anderen Anwendungen
waren auch Geschwindigkeitsvorteile mehr als sp&uuml;rbar, z.B. beim
Scrollen im Editor oder in FinalCopy. Ein Benchmark-Test findet
sich unten.</P>

<P>Der Chip der Karte hat 3D-Funktionen. Man kann sie &uuml;ber die mitgelieferten
Demoprogramme begutachten. Allerdings kenne ich keine Anwendung, die davon
Gebrauch macht. CyberGL tut es anscheinend nicht (jedenfalls konnte ich
keine &uuml;berproportionale Steigerung bemerken).</P>

<P>Ein Scandoublermodul und ein MPEG-Modul lassen sich anschlie&szlig;en.</P>

<P>Softwareseitig habe ich nur CybergraphX verwendet, alles funktionierte wie
auf dem Original-Chipset. Spiele habe ich seit dem Einbau der Karte nicht
gestartet, ebensowenig Demos. Ich bin mir aber sicher, da&szlig; jedes Spiel
ohne &quot;Bildschirmmodus&quot;-Einstellm&ouml;glichkeit keine Ausgabe auf der Karte
bringt, allenfalls die wenigen systemkonformen Spiele lassen sich &uuml;ber
Programme wie &quot;NewMode&quot; auf CyberGraphX-Bildschirme umlenken. Eine
eigene Umlenksoftware (&quot;Promoter&quot;) gibt es nicht.</P>

<P>Bei der Grafik-Emulation kann ich nur eine kleine L&uuml;cke entdecken: die
Bobs des Soccer-Bildschirmschoners von Madhouse verschmieren teilweise,
auf Picasso96 werden sie korrekt dargestellt. &Auml;hnliches habe ich aber
in keiner Anwendung erlebt.</P>

<P>Der angeschlossene Monitor kann bis 86kHz voll ausgereitzt werden, das
Programm CGXMode erlaubt die Definition von eigenen Monitorfiles und
Bildschirmmodi im Rahmen der M&ouml;glichkeiten von Grafikkarte und Monitor.</P>

<B>Fazit:</B>

<P>Die Karte &uuml;berzeugt mich durch ordentliche Geschwindigkeit, n&auml;heres
siehe unten. CyberGraphX bekommt eine transparente Emulation hin, mit
anderen Worten: man bemerkt es gar nicht.</P>

<P>Wer auch gerne spielt, wird an der Karte wenig Freude haben, weil man
f&uuml;r PAL-Ausgabe umst&ouml;pseln mu&szlig;. (Oder es steht ein zweiter Monitor auf
dem Schreibtisch herum.) Bevor man sich das ScanDoubler-Modul holt,
sollte man mit der <A HREF="picasso4.htm">PicassoIV</A> vergleichen. Der Preis der CyberVision
erscheint gerechtfertigt.</P>

<B>Benchmarks (mit Intuispeed erstellt):</B>
<TABLE BORDER=0>
<TR><TD>
<TABLE BORDER=1 ALIGN=CENTER>
<TR><TD COLSPAN=1><B>Computer:</B></TD><TD COLSPAN=2 NOWRAP>A4000/040, 25 MHz</TD>
<TR><TD COLSPAN=1><B>Graphic Board:</B></TD><TD ALIGN=CENTER COLSPAN=4>CyberVision64/3D, with 4 MByte RAM</TD></TR>
<TR><TD COLSPAN=1><B>OS, CPU and RAM:</B></TD><TD COLSPAN=2>OS: 3.0  CPU: 68040  RAM: 2/16 MB</TD>
<TR><TD COLSPAN=1><B>Benchmark:</B></TD><TD ALIGN=CENTER COLSPAN=4>Actions per second</TD></TR>
<TR><TD><B>Resolution: 640x480</B></TD><TD><U>256 Colors</U></TD><TD><U>24 Bit</U></TD>

<TR><TD><B>Write pixel</B></TD><TD>        172954/s</TD><TD>92761/s</TD>
<TR><TD><B>Line draw</B></TD><TD>            8785/s</TD><TD> 2753/s</TD>
<TR><TD><B>Filled rectangle</B></TD><TD>     4150/s</TD><TD> 1150/s</TD>
<TR><TD><B>Scroll vertical</B></TD><TD>       466/s</TD><TD>   70/s</TD>
<TR><TD><B>Scroll horizontal</B></TD><TD>     463/s</TD><TD>   80/s</TD>
<TR><TD><B>Draw circle</B></TD><TD>          5284/s</TD><TD> 3644/s</TD>
<TR><TD><B>Text without scroll.</B></TD><TD> 1131/s</TD><TD>  466/s</TD>
<TR><TD><B>Draw rectangle</B></TD><TD>       2503/s</TD><TD> 2239/s</TD>
<TR><TD><B>Window layer test</B></TD><TD>       3/s</TD><TD>    2/s</TD>
<TR><TD><B>Size window</B></TD><TD>             9/s</TD><TD>    7/s</TD>
<TR><TD><B>Move window</B></TD><TD>            50/s</TD><TD>   41/s</TD>
<TR><TD><B>Line Pattern Draw</B></TD><TD>    3877/s</TD><TD> 2664/s</TD>
</TABLE>
</TD><TD>
<TABLE BORDER=1>
<CAPTION>Bewertung:</CAPTION>
<TR>
    <TH>Produkt:</TH><TD>CyberVision64/3D</TD><TH>Hersteller:</TH><TD><A HREF="http://www.phase5.de">Phase5</A></TD>
</TR>
<TR>
    <TH>Art:</TH><TD>Grafikkarte</TD><TH>Version:</TH><TD>-</TD>
</TR>
<TR>
    <TH>Preis:</TH><TD>359 DM zzgl. Versandkosten</TD><TH>Bez.Quelle:</TH><TD>div. H&auml;ndler</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH>Leistungsf&auml;higkeit:</TH><TD ALIGN="CENTER">2</TD><TD ALIGN=CENTER ROWSPAN=4 COLSPAN=2><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD>
</TR>
<TR>
    <TH>Benutzerfreundlich:</TH><TD ALIGN=CENTER>3</TD>
</TR>
<TR>
    <TH>Dokumentation:</TH><TD ALIGN=CENTER>3</TD>
</TR>
<TR>
    <TH>Preis-/Leistung:</TH><TD ALIGN=CENTER>1</TD>
</TR>
<TR>
    <TD COLSPAN="4"></TD>
</TR>
<TR>
    <TH COLSPAN="2">Gesamt:</TH><TD COLSPAN=2 ALIGN=CENTER>2</TD>
</TR>
</TABLE>
</TD></TR></TABLE>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT"><A HREF="isd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9712basi.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
