<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - ISDN-Grundlagen</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>ISDN-Grundlagen</U></H1><DIV ALIGN="CENTER">oder: Wer braucht schon ISDN...?</DIV><P ALIGN="CENTER">von<BR><A HREF="T.Heinrich@t-online.de">Thomas Heinrich</A></P>

<!-- Und auch hier gilt das gleiche, wie für den Glossar... :-) -->

<P><B>Motivation</B></P>

<P>Vor ziemlich genau zwei Jahren hatte ich mich &uuml;berwunden, in die Welt der
drahtgebundenen Computerkommunikation einzusteigen. Das soll hei&szlig;en, ich
hatte es satt, immer mehr PD-Disketten anzusammeln und wollte sofortigen
Zugriff auf die neueste Software. Ein Telefonanschlu&szlig; und ein Modem waren
schnell besorgt, die Verbindung zu diversen Mailboxen war recht schnell.
Aber den direkten Zugriff auf die neueste Software hatte ich immer noch
nicht.</P>

<P>So fiel dann vor einem Jahr die Entscheidung: Ein Internet-Anschlu&szlig; mu&szlig;
her. Doch, oh weh! Wenn man auf der gr&uuml;nen Wiese lebt, gar nicht so
einfach. Zum Ortstarif war nur ein Anbieter zu erreichen - die Deutsche
Telekom. Also blieb mir nichts anderes &uuml;brig, ich lie&szlig; mir einen T-Online
Zugang einrichten.</P>

<P>Dann kamen die grausamsten Wochen meines Lebens. &Uuml;bertragungsraten von
sage und schreibe 40 cps (Zeichen pro Sekunde), und das mit einem 28800er
Modem, das problemlos die 80-fache Geschwindigkeit schafft. Zum Gl&uuml;ck
hatte die Telekom bald ein Einsehen, und beschleunigte die Zug&auml;nge. Und
zwar so sehr, da&szlig; mein Modem die Bandbreite gar nicht mehr ausnutzen
konnte.</P>

<P>Nach der Devise &quot;Schneller, h&ouml;her, weiter&quot; war jetzt der n&auml;chste Schritt
f&auml;llig: ISDN. </P>

<B>Vergleiche</B>

<P>Heute gibt es drei gro&szlig;e <B>Geschwindigkeitsgruppen</B> in der DF&Uuml;:</P>

<TABLE BORDER=0>
<TR>
    <TH>28,8er bzw.<BR>33,6er Modems</TH>
    <TD>Diese Modems erreichen physikalische Geschwindigkeiten bis
    3,7 kByte pro Sekunde. Dieser V.34 genannte Standard ist
    die schnellste Analogverbindung ohne besondere Zusatzhardware.</TD>
</TR>
<TR>
    <TH>56er Modems:</TH>
    <TD><P>Diese Modems sind eine Mogelpackung, denn sie erreichen die
    maximale Geschwindigkeit von 6,1 kByte pro Sekunde nur in
    Downloadrichtung. Ein Upload erfolgt nur mit 3,7 kByte/s.
    Als w&auml;re das nicht genug, findet sich in der Anzeige eines
    namhaften Modemanbieters (Multi-Tech&#174; Systems, Inc.)
    folgende Bemerkung (nat&uuml;rlich kleingedruckt):</P>
    <P>&#187;Obwohl dieses Modem eine Downloadkapazit&auml;t von 56.000 bps
    besitzt, sind wegen Leitungsst&ouml;rungen, der Infrastruktur
    des &ouml;ffentlichen Leitungsnetzes und anderen externen
    Faktoren Verbindungen mit einer Maximalgeschwindigkeit
    von 56.000 bps zur Zeit nicht m&ouml;glich.&#171;</P>
    <P>Im Klartext: Im Labor funktionierts, am Telefonnetz leider
    nicht.</P>
    <P>Ein weiterer Pferdefu&szlig; ist der, da&szlig; die Sendestelle, also
    im allgemeinen der Internetprovider, sich eine extra
    (teure) Hardware anschaffen mu&szlig;, um diese Geschwindigkeit
    zu unterst&uuml;tzen.</P></TD>
</TR>
<TR>
    <TH>ISDN Adapter:</TH>
    <TD>Diese Adapter sind eigentlich keine Modems mehr, das hei&szlig;t,
    sie nutzen die Telefonleitung nicht mehr wie ein Modem auf
    analoge Weise, sondern kommunizieren digital mit der
    Gegenstelle. Mit ISDN erreicht man Geschwindigkeiten bis
    7,5 kByte/s pro B-Kanal. Schaltet man beide B-Kan&auml;le eines
    ISDN-Anschlusses zusammen, erreicht man die doppelte
    Geschwindigkeit, zahlt aber auch die doppelten Geb&uuml;hren.</TD>
</TR>
</TABLE>

<P><B>Physikalische Geschwindigkeit</B> meint hier die Anzahl der Bytes, die pro
Sekunde tats&auml;chlich &uuml;ber die Leitung &uuml;bertragen werden, ohne Kompression.</P>

<P>Mit <B>Kompression</B> erreicht man bei Textdateien unter Umst&auml;nden ein vielfaches
der &Uuml;bertragungsrate; bei bereits komprimierten Daten, wie JPEG-Bildern oder
LHa-Archiven ist der Gewinn gleich null.</P>

<B>Lohnt sich ISDN ?</B>

<P>Hier mu&szlig; man genau kalkulieren. Zum einen ist der ISDN-Grundbetrag fast
doppelt so hoch wie der eines analogen Telefonanschlusses. Zum andern
bietet ISDN &uuml;ber die reine Telefonleitung noch einige Annehmlichkeiten.</P>

<P>Man bekommt n&auml;mlich drei Telefonnummer und zwei Leitungen, so da&szlig; man,
w&auml;hrend man im Internet surft, immer noch telefonieren kann. Man kann
die zus&auml;tzlichen Telefonnummern auch auf andere Teilnehmer, z.B. in
einer kleinen Hausgemeinschaft vergeben, und so die Kosten aufteilen.</P>

<P>F&uuml;r die meisten ergibt sich durch ISDN eine Verdoppelung der
&Uuml;bertragungsrate. Dieser Geschwindigkeitsvorteil ist bei Mailboxen enorm,
im Internet relativiert sich das Ganze wieder. Da das Internet selbst nur
aus einer Unmenge Einzelrechnern mit verschiedenen
Anschlu&szlig;geschwindigkeiten besteht, darf man die ISDN-Geschwindigkeit nur
als Bandbreite ansehen, also als m&ouml;gliche H&ouml;chstgeschwindigkeit. Der
einfachste Trick, diese Bandbreite auszunutzen, besteht darin, mehrere
Dateien gleichzeitig zu laden. Die einzelne Datei dauert dann zwar
l&auml;nger, aber daf&uuml;r hat man in der Zeit zwei oder drei Dateien geladen.</P>

<P>Daraus kann man auch ersehen, da&szlig; der Vorteil f&uuml;r reine WWW-Surfer nicht
so gro&szlig; ausf&auml;llt, da man im WWW &ouml;fter mal eine l&auml;ngere Pause zum lesen
macht und dadurch der Geschwindigkeitsvorteil ungenutzt bleibt. Wer aber
oft gro&szlig;e Dateien aus dem Aminet l&auml;dt, hat durchaus Vorteile.</P>

<P><B>(M)ein Beispiel</B>: Wer einigerma&szlig;en wei&szlig;, was er laden will, und wenig
Lesepausen macht, der kommt in einer halben Stunde Internetzugang auf eine
heruntergeladene Datenmenge von 8 MByte. So geschehen, als ich eine Seite
mit Bildern &quot;gepl&uuml;ndert&quot; habe. Im Durchschnitt macht das 4,5 kByte/s. Mit
einem analogen Modem k&ouml;nnte man das nicht mal erreichen, wenn man
ununterbrochen herunterl&auml;dt.</P>

<P>Andererseits lohnt sich zum Beispiel bei FTP-&Uuml;bertragungen die hohe ISDN-
Geschwindigkeit nicht. Gro&szlig;e Server wie der Aminet-Mirror in Paderborn
sind meistens so besch&auml;ftigt, da&szlig; man nicht &uuml;ber 3 kByte/s hinauskommt.
Die einzelnen Datenpakete sind zwar blitzschnell empfangen, aber die
Pausen zwischen den Paketen machen die hohe &Uuml;bertragungsrate schnell
zunichte.</P>

<P>Nat&uuml;rlich kann man auch hier zweigleisig fahren, z.B. einen zweiten
Server kontaktieren, oder ein paar Newsgroups lesen.</P>

<P><B>Letztlich</B> h&auml;ngt alles davon ab, wie gro&szlig; die monatlich gezogene Datenmenge
ist. Die ISDN-Grundgeb&uuml;hr ist circa 20 DM teurer, also mu&szlig; sich die
gezogene Datenmenge um circa 50% vergr&ouml;&szlig;ern, bei einer Onlinezeit von
monatlich mindestens 8 Stunden. Das gilt f&uuml;r den Zugang zum Internet mit
einem durchschnittlichem Preis von 5 DM f&uuml;r die Onlinestunde inklusive
Telefongeb&uuml;hr. Hat man einen teureren Provider, oder ist l&auml;nger online,
rentiert sich ISDN eher.</P>

<P>Allerdings verlangen manche Provider f&uuml;r den ISDN-Zugang doppelt so hohe
Zugangsgeb&uuml;hren, womit sich die Mindest-Onlinezeit je nach Betrag noch
einmal um 2 bis 8 Stunden erh&ouml;ht.</P>

<P>Die einfache <B>Faustregel</B> hei&szlig;t also: Der Mehrpreis f&uuml;r den ISDN-Anschlu&szlig;
mu&szlig; sich entweder in einer Reduzierung der Onlinezeit um mindestens
diesen Betrag &auml;u&szlig;ern, oder man schafft es, f&uuml;r den Mehrpreis entsprechend
mehr Daten durch die Leitung zu jagen.</P>

<P>Kontaktiert man vor allem Mailboxen, ergibt sich ein &auml;hnliches Bild, nur
mit deutlich mehr Mindeststunden, da man nur die Telefongeb&uuml;hr ohne
irgendwelche Providergeb&uuml;hren bezahlt. So steht man dann vor der Aufgabe,
mindestens 40DM Telefoneinheiten im Monat in Mailboxen zu verbringen und
flei&szlig;ig up- und downzuloaden, damit sich ISDN lohnt.</P>

<P>Bei allem ist noch nicht die Hardware eingerechnet, die auch noch
Mehrkosten verursachen kann. Eine ISDN-Karte ist deutlich billiger als
ein V.34-Modem mit Schnittstellenkarte, die man braucht, um effektiv DF&Uuml;
zu betreiben. Die interne serielle Schnittstelle des Amiga ist einfach
zu langsam.</P>

<B>Fazit</B>:

<P>Es kommt weniger auf den Computer an, ob man sich f&uuml;r ISDN- oder
Analoganschlu&szlig; entscheidet, vielmehr sind die eigenen Online-Gewohnheiten
ausschlaggebend. Wer viele Archive oder Bilder l&auml;dt, kommt mit ISDN
schneller in die schwarzen Zahlen, nicht zu vergessen der Spa&szlig;, den ein
schneller Internetzugang macht.</P>

<P>Wer sich nur im WWW von Seite zu Seite klickt, und hin und wieder eine
EMail schreibt, der kann sich mit einem analogen Anschlu&szlig; zufrieden geben.</P>

<P>Am schlechtesten dran sind die User, die schon eine komplette
Analogausr&uuml;stung haben und bemerken, da&szlig; sie durchaus gr&ouml;&szlig;ere Datenmengen
laden k&ouml;nnten, aber einfach nicht mehr durchs Kabel durchgeht. Dann noch
den Absprung zu wagen und auf ISDN umzusteigen, ist ziemlich teuer. Denn
wer kauft schon ein gebrauchtes Modem, wo ISDN so attraktiv ist...</P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT"><A HREF="9712isdn.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9712cv3d.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
