<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 12/97 - ISDN Glossar</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<H1 ALIGN="CENTER"><U>Glossar</U></H1><P ALIGN="CENTER">von<BR><A HREF="T.Heinrich@t-online.de">Thomas Heinrich</A></P>

<!-- Als HTML-Redakteur m&ouml;chte ich anmerken, da&szlig; ich mit einigen der Definitionen/Erkl&auml;rungen
nicht einverstanden bin, was sowohl die Wortwahl, als auch den Inhalt betrifft. //-->

<DL>
<DT>Account [Zugang]</DT>
<DD>Ein Provider oder auch eine Mailbox oder Universit&auml;t kann einen Zugang zum Internet erm&ouml;glichen.</DD>
<DT>AT [ATtention]</DT>
<DD>AT-Kommandos wecken die Aufmerksamkeit eines Modems
und steuern es. Ein ATZ z.B. veranlasst ein Modem, sich in den
Grundzustand zu versetzen (Initialisierung), ein ATH trennt eine
bestehende Verbindung zu einem anderen Modem, das Modem legt auf.
Ein ATDT01910 w&auml;hlt den BTX-Zugang der Telekom mittels Tonwahl an.
AT-Kommandos sind reine Zeichenkombinationen, die direkt an das
Modem geschickt werden.</DD>
<DT>AutoConfig&#174;</DT>
<DD>F&auml;higkeit des Amiga, Einsteckkarten schon beim Start zu
erkennen, ohne da&szlig; irgendwelche Treiber von Diskette/Festplatte
geladen werden m&uuml;ssen. Die erforderliche Software steckt
meistens schon in nur-lesbaren Speicherbausteinen (ROM)
auf der betreffenden Karte.</DD>
<DT>BZT [Bundesamt f&uuml;r Zulassungen in der Telekommunikation]</DT>
<DD>Diese &quot;Postzulassung&quot; wird ben&ouml;tigt, um ein Kommunikationsger&auml;t
&uuml;berhaupt an das Telefonnetz der Telekom anschlie&szlig;en zu d&uuml;rfen.
Oft wird das BZT mit der Telekom gleichgesetzt, es ist aber so,
da&szlig; auch die Telekom sich an die Forderungen dieses Amtes halten
mu&szlig; und ihre Ger&auml;te danach auszulegen hat. Da aber die Telekom
eine Monopolstellung hatte, gingen alle Vorschriften letztlich
auf die Telekom zur&uuml;ck, also ist der Gedanke gar nicht so falsch.</DD>
<DT>CAPI [Common Application Programming Interface {es kursieren
mehrere, leicht abweichende Definitionen dieses Akronyms}]</DT>
<DD>Softwareschnittstelle zur direkten Steuerung von ISDN-Ger&auml;ten
aus Computerprogrammen heraus.</DD>
<DT>DF&Uuml; [DatenFern&Uuml;bertragung]</DT>
<DD>&Uuml;berbegriff f&uuml;r Hard- und Software,
die Daten per Telefonleitung verschicken und empfangen.</DD>
<DT>Download [herunterladen]</DT>
<DD>Das &Uuml;bertragen von Daten von einem entfernten
Computer auf den Eigenen.</DD>
<DT>FAQ [Frequently Asked/Answered Questions]</DT>
<DD>Sammlung der am h&auml;ufigsten
gestellten/beantworteten Fragen zu einem Produkt oder Sachverhalt,
normalerweise in reiner Textform. Auf Wintel-Plattformen findet
man manchmal auch FAQs im Write-Format, die auf dem Amiga
unkomfortabel zu lesen sind.</DD>
<DT>HDLC [High level Data Link Control]</DT>
<DD>X.75, V.110, BTX, EuroISDN -
Verschiedene Protokolle, die alle nur zum Datenaustausch dienen.
Sie unterscheiden sich haupts&auml;chlich in der Verbreitung und
Anwendung, weniger in der Geschwindigkeit oder Sicherheit.</DD>
<DT>Headset</DT><DD>Kombination aus Kopfh&ouml;rer und Mikrofon</DD>
<DT>ISDN [Integrated Services Digital Network]</DT>
<DD>Digitales Telefonnetz der
Telekom, jeder Teilnehmer bekommt drei Telefonnummern, mit zwei
Leitungen, die eine maximale &Uuml;bertragungsrate von je 64000 bit/s
unterst&uuml;tzen. Geb&uuml;ndelt erreicht man somit maximal 128 kbit/s.</DD>
<DT>Kickstart</DT>
<DD>Name f&uuml;r das Betriebssystem des Amiga. Gemeint ist hierbei
der Teil, der im ROM liegt.</DD>
<DT>Logfile<DT><DD>Datei auf Diskette/Festplatte, in die ausgew&auml;hlte Aktionen und
die Zeitpunkte, zu denen sie passiert sind, geschrieben werden.
Man erh&auml;lt z.B. dadurch einen &Uuml;berblick, wer wann wie lange im
Internet war, wenn man ein geeignetes Programm hat, das diese
Aktionen mitprotokolliert.</DD>
<DT>PCMCIA [Personal Computer Memory Card International Association]</DT><DD>
auch Scheckkarten-Slot genannt. 16 bit Erweiterungsanschlu&szlig; f&uuml;r
externe Ger&auml;te, urspr&uuml;nglich entworfen f&uuml;r Laptops. Commodore
integrierte diese Schnittstelle auch in die Amiga-Modelle
A600/A1200.</DD>
<DT>ROM [Read-Only Memory]</DT><DD>Sogenannte Festwertspeicher, die bereits
bei der Fertigung mit festgelegten Daten hergestellt werden und
deswegen nicht gel&ouml;scht oder beschrieben werden k&ouml;nnen. Das
Amiga-Betriebssystem besitzt ebenfalls ein (oder zwei) ROM(s)
f&uuml;r die grundlegenden Funktionen.</DD>
<DT>Sampler</DT><DD>Ger&auml;t, da&szlig; &uuml;ber ein Mikrofon oder einen anderen Tonquellenanschlu&szlig;
T&ouml;ne digitalisiert, um sie auf dem Computer zu speichern.</DD>
<DT>SCSI [Small Computer System Interface]</DT><DD>8 bit Schnittstelle, f&uuml;r
jedes Computerperipherieger&auml;t nutzbar. In verschiedenen
Geschwindigkeitsstufen verf&uuml;gbar, aber grunds&auml;tzlich immer
abw&auml;rtskompatibel. Typische Anwendungen sind Festplatten,
Wechselplatten, Scanner, Streamer; aber auch Floppys, Drucker
oder Modems werden unterst&uuml;tzt (nur wurden solche noch nie mit
SCSI-Schnittstelle gesehen).</DD>
<DT>serielle Schnittstelle</DT><DD>erreicht auf den schnellsten Amigas ca.115 kbit/s,
verbraucht dabei aber die gesamte Prozessorzeit. Maximal
empfehlenswert sind 57600 bit/s, da man sonst &Uuml;bertragungsfehler
riskiert. Eine zus&auml;tzliche schnelle Schnittstellenkarte ist f&uuml;r
moderne DF&Uuml;-Anwendungen unverzichtbar.</DD>
<DT>TCP [Transmission Control Protocol]</DT><DD> &Uuml;bertragungsprotokoll im Internet.
&Uuml;ber diese Softwareschnittstelle lassen sich Zugriffe auf fremde
Rechner realisieren, z.B. das Laden von Dateien, das Verschicken
von Nachrichten, sogar die Fernsteuerung von fremden Rechnern.
TCP ist hierbei nur eine Schicht im Zusammenspiel mit anderen,
die diese Dienste m&ouml;glich machen.</DD>
<DT>Upload [hinaufladen]</DT><DD>Das &Uuml;bertragen von Daten vom eigenen Computer zu
einem entfernten Rechner.</DD>
<DT>Zorro</DT>
<DD>Zorro-II - 16 bit Erweiterungsslot der gr&ouml;&szlig;eren Amigamodelle.
Zorro-III - 32 bit Variante des Zorro II im Amiga 3000/4000(T).
Jede Zorro-II Karte l&auml;uft auch im Zorro-III Slot, aber nicht
umgekehrt !</DD>
</DL>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz1297/main.htm">Inhaltsverzeichnis</A></FONT></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`97<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
