<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, human race, dirt eater">
<title>Human Race: Dirt Eater</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Human Race: Dirt Eater</font></h1><BR> (54:56 / Massacre Records)</center></P>

<p>Huch, was haben wir denn hier? Eine schwedische Melodic Metal Band mit ihrem zweiten Album &quot;Dirt Eater&quot;, die sich als Vorbilder vor allem die Pretty Maids und ein wenig Silver Mountain auf die Fahnen geschrieben haben. Gegen anst&#228;ndigen Melodic Metal ist auch gar nichts auszusetzen und wenn dabei so
eine gutklassige Scheibe wie &quot;Dirt Eater&quot; herauskommt, ist man obendrein auch noch vollauf zufrieden. Aber alles der Reihe nach: Mit dem speedigen Opener &quot;Paralyzed&quot;, dem nachfolgendem absolutem Highlight &quot;Ending Calling&quot; sowie dem Ohrwurm &quot;One By One&quot; legt die Band fulminant los und l&#228;sst den geneigten H&#246;rer mit ihrer Mischung aus Pretty Maids und Silver Mountain dann auch erstmal mit offenem Mund stehen. Danach lassen Human Race allerdings ein wenig nach, denn nicht alle nachfolgenden Songs k&#246;nnen mit dem hohen Niveau der ersten drei Tracks konkurrieren. Trotzdem gibt es mit &quot;This Is Who We Are&quot; und der Power Ballade (mit Betonung auf &quot;Power&quot;) &quot;Some Fall In Summertime&quot; noch zwei weitere erstklassige St&#252;cke und 
auch beim weiteren Material sucht man Totalausf&#228;lle eigentlich mit der Lupe. Gelungen abgerundet wird die CD mit dem Rainbow Cover &quot;Tarot Woman&quot;, welches sich zwar gr&#246;&#223;tenteils am Original h&#228;lt, aber der CD trotzdem einen w&#252;rdigen Abschluss bescherrt. Abz&#252;ge muss man leider in Sachen Produktion machen, denn das ganze klingt eindeutig zu h&#246;henlastig, was aber den ansonsten positiven Gesamteindruck nur unwesentlich tr&#252;ben kann. Alles in allem also ein &#228;u&#223;erst gelungenes zweites Album einer Band, die alleine schon deshalb sympathisch ist, weil sie nicht im Kampf um die True Metal Krone mitmischt, sondern stattdessen auf bodenst&#228;ndigen Melodic Metal setzt, der einfach nur Spa&#223; macht. Human Race sind - trotz des, &#228;hem, merkw&#252;rdigem Coverartworks - sicherlich eine Band mit Zukunft, von der man wohl noch einiges erwarten kann. Melodic Metal Fans mit Vorliebe f&#252;r Pretty Maids sollten sich &quot;Dirt Eater&quot; auf jeden Fall in den heimischen Plattenschrank stellen und werdem mit dem Teil sicherlich viel Spa&#223; haben. Gelungenes Album!</P>

<p>Fazit: 8 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd5.jpg"></P>
<p><img src="kit.gif"></P>
</Center>





</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
