<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, iron fire, on the edge">
<title>Iron Fire: On The Edge</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Iron Fire: On The Edge</font></h1><BR> (47:10 / Sanctuary Records)</center></P>

<p>F&#252;r mich geh&#246;rten Iron Fire im vergangenen Jahr mit ihrem True Metal Debutalbum &quot;Thunderstorm&quot; mit zu den 10 besten Newcomern &#252;berhaupt in der Metal Szene. Fast ein Jahr sp&#228;ter legt die Band um Songwriter und S&#228;nger Martin Steene mit &quot;On The Edge&quot; den Nachfolger nach, der aber das hohe Niveau des Vorg&#228;ngers leider nicht immer halten kann. Aber der Reihe nach: Iron Fire hatten sich offenbar vorgenommen, die Klischees, die auf dem Debutalbum an allen Ecken und Enden zu finden waren, teilweise &#252;ber Bord zu werfen und eine eigene Identit&#228;t zu finden. Das ist ihnen sicherlich auch gelungen, zumal man &quot;On The Edge&quot; nicht unterstellen kann, ein simples &quot;Helloween Coveralbum&quot; zu sein. Zwar h&#246;rt man den Einfluss von Helloween hier und da noch heraus, aber so offensichtlich wie beim Debutalbum ist es nicht mehr der Fall. Auf dem Weg zur eigenen Identit&#228;t hapert es allerdings ein wenig an der musikalischen Qualit&#228;t: So sind speedige Nummern wie etwa der Opener &quot;The End Of It All&quot;, der Titeltrack oder auch das Ohrwurmhafte &quot;Into The Abyss&quot; zwar &#252;berzeugend, aber das restliche Material ist einfach zu belanglos ausgefallen, was insbesondere f&#252;r unterdurchschnittliche Tracks wie &quot;Wanted Man&quot; und &quot;Miracle&quot; gilt. Hier und da sind zwar noch einige gute Ans&#228;tze zu finden - wie zum Beispiel bei &quot;Here And Alive&quot; - , aber das ist eigentlich zu wenig f&#252;r ein wirklich gutes Album. Ob es nun an den Wechseln im Line-Up gelegen hat oder dies der erste Versuch ist, weg vom Image des Helloween Clones zu
kommen, kann ich nicht beurteilen. Insgesamt muss man leider festhalten, da&#223; &quot;On The Edge&quot; - trotz des aggressiveren und d&#252;steren Songwritings - ein Album ist, da&#223; nicht wirklich &#252;berzeugen kann wie es noch der Vorg&#228;nger vermochte und folgerichtig in der Masse der Ver&#246;ffentlichungen etwas untergehen d&#252;rfte. Wie gesagt: Richtig schlecht ist &quot;On The Edge&quot; nicht, die Produktion von Altmeister Tommy Hansen knallt auch ordentlich, aber es fehlt dem Album leider an z&#252;ndenden Ideen. Aber vielleicht wird ja der n&#228;chste Longplayer wieder besser, den grunds&#228;tzlich ist die Idee, True Metal zu spielen, der nicht an allen Ecken und Enden nach Helloween zu &quot;Keeper&quot; Zeiten klingt, ja allemal begr&#252;&#223;enswert.</P>

<p>Fazit: 6.5 von 10 Punkten</P> 
<center>
<p><img src="kit.gif"></P>
<p><img src="cd6.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
