<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, tribute, album, keepers of jericho, dark moor, squealer, vision divine, cydonia, labyrinth">
<title>The Keepers Of Jericho: A Tribute To Helloween</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">The Keepers Of Jericho - A Tribute To Helloween</font></h1><BR> (70:27 / Arise)</center></P>

<p>&#220;ber den Nutzen von Tribute Alben kann man ohne Frage getrennter Meinung sein - auch dar&#252;ber, ob es angebracht ist, einer nach wie vor aktiven Band wie Helloween Tribut zu zollen. Fakt ist allerdings, da&#223; Helloween insbesondere mit ihren ersten drei Alben jede Menge Musiker beeinflusst haben und aus dieser Sichtweise heraus ist ein Tribute Album sicherlich gerechtfertigt. Gl&#252;cklicherweise befinden sich auf &quot;The Keepers Of Jericho&quot; weitestgehend Bands, die tats&#228;chlich von den K&#252;rbisk&#246;pfen beeinflusst wurden und zudem wurden lediglich St&#252;cke der Kai Hansen &#196;ra - sprich &quot;Walls Of Jericho&quot; und &quot;Keepers Of The Seven Keys - Part I + II&quot; - gecovert. Das nicht alle Versionen den Charme des Originals erreichen w&#252;rden, war eigentlich von vornherein klar. Aber das ausgerechnet Bands wie Vision Divine (&quot;Eagle Fly Free&quot;) oder die aus meiner Sicht erneut sehr schwachen Labyrinth (&quot;Future World&quot;) dabei straucheln w&#252;rden, h&#228;tte ich nicht gedacht. Trotzdem gibt es auch Bands, die es tats&#228;chlich geschafft haben, den gecoverten 
St&#252;cken ihren eigenen Stempel aufzudr&#252;cke, wobei hier in erster Linie Rhapsody (&quot;Guardians&quot; - war bereits auf der limitierten Version von &quot;Dawn Of Victory&quot; zu finden), Sonata Arctica (&quot;I Want Out&quot; - fristete sein dasein auf der &quot;Successor EP&quot; der sympathischen Finnen) und insbesondere Luca Turilli (&quot;I Want Out&quot;) zu nennen sind. Der heimliche H&#246;hepunkt dieses Samplers ist aber die &quot;Halloween&quot; Version der bisher eher unbekannten Spanier Dark Moor, die diesen unsterblichen Klassiker in ein neues Gewand gedr&#252;ckt haben und mit den weiblichen Vocals sogar noch f&#252;r eine angenehme &#220;berraschung sorgten. Recht gelungen sind zudem auch noch die Versionen von Squealer (&quot;Victim Of Fate&quot;) und Metalium (&quot;Ride The Sky&quot;), wohingegen Brainstorm mit der &quot;Dr.Stein&quot; B-Seite &quot;Savage&quot; eher zu den Ausf&#228;llen zu z&#228;hlen sind. Bleibt unter dem Strich ein Tribute Album &#252;brig, welches zwar zu den etwas besseren dieses Genres zu z&#228;hlen ist, aber garantiert nicht bedenkenlos zu empfehlen ist. Dazu fehlt es einfach an dem gewissen etwas der meisten Versionen und zudem sei die Frage erlaubt, wo bittesch&#246;n die Coverversion von &quot;Dr.Stein&quot; - einem Song, der aus dieser &#196;ra einfach nicht fehlen
darf - geblieben ist. Ob man nun die 30 M&#228;rker in diesen Tribute Sampler investiert, sei jedem selbst &#252;berlassen. Falls man nur an der Version eines bestimmten Act`s interessiert ist, sollte man erstmal abwarten, ob die Coverversion demn&#228;chst nicht noch auf einer Single verbraten wird....</P>

<p>Fazit: --- </P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd7.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
