<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, mystic prophecy, vengeance">
<title>Mystic Prophecy: Vengeance</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Mystic Prophecy: Vengeance</font></h1><BR> (51:38 / B.Mind Records)</center></P>

<p>Wenn ich jetzt sage, da&#223; es sich bei Mystic Prophecy um einen weiteren Newcomer aus dem True Metal Bereich handelt, werden einige Fans wohl aufgrund der &#220;berflutung in diesem Sektor aufschreien. Allerdings handelt es sich bei Mystic Prophecy mitnichten um eine v&#246;llig unbekannte Band, denn - mit Ausnahme von Gitarrist Gus G. - k&#246;nnen die Herrschaften doch schon einiges an Erfahrung vorweisen: S&#228;nger R.D. Liapakis singt auch noch bei den Prog. Metallern von Valley`s Eve, bei denen auch der Mystic Prophecy Bassist Martin Albrecht - Insidern vielleicht noch von seiner T&#228;tigkeit bei den mitlerweile
nicht mehr existierenden, aber immer unterbewerteten Stormwitch bekannt - in Lohn und Brot steht. Tja, und Drummer Dennis Ekdahl verdient sich seine Br&#246;tchen normalerweise bei Raise Hell. Alleine schon durch dieses Line-up d&#252;rfte klar sein, da&#223; Mystic Prophecy mit ihrem True Metal nicht etwa auf den Spuren von HammerFall &amp; Co. wandern, sondern aggressiver und rauher zu Werke gehen. Als Vergleiche kann man also eher Bands wie Iced Earth oder alte Nevermore anf&#252;hren, an die &quot;Vengeance&quot; nicht selten erinnert. Macht aber auch nichts, denn Mystic Prophecy ziehen ihr Ding konsequent durch und liefern ein qualitativ konstant gutes Langeisen ab, von dem insbesondere der aggressive Opener &quot;Sky`s Burning&quot;, der nachfolgende Smasher &quot;Damnation And Darkness&quot; und das abschlie&#223;ende Epos &quot;Fallen Angel&quot; hervorhebenswert sind. Abstriche muss man bei &quot;Vengeance&quot; eigentlich keine machen, denn alle Songs sind durch die Bank hinweg gut gelungen und wissen somit zu gefallen. Erfreulich ist zudem, da&#223; Mystic Prophecy auch im Laufe der gut 50 Minuten nicht die Luft ausgeht und die Songs jeweils recht heavy und aggressiv aus den Boxen dr&#246;hnen und zum Mitbangen geradezu einladen. Das einzigste kleine Manko ist zwar die etwas fehlende Eigenst&#228;ndigkeit, aber das trifft um Grunde auf gesch&#228;tzte 95 % aller Newcomer zu und solange die Mukke so zu gefallen wei&#223; wie im Falle von Mystic Prophevy macht das auch nix. &quot;Vengeance&quot; ist somit ein Album, welches man Fans des reinrassigen Power Metal`s ohne Einschr&#228;nkungen empfehlen kann und welches sicherlich seine Anh&#228;nger finden wird. Bleibt nur zu hoffen, da&#223; Mystic Prophecy f&#252;r die Members nicht nur den Charakter eines Sideprojekts haben, denn es w&#228;re schade, wenn man von diesem Quartett in Zukunft nichts mehr h&#246;ren w&#252;rde...</P>

<p>Fazit: 8.5 von 10 Punkte</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd8.jpg"></P>
<p><img src="kit.gif"></P>
</Center>




</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
