<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>
<p><li>Fr&#252;her oder sp&#228;ter musste es ja bei <b>Iron Savior</B> so kommen: Gitarrist <b>Kai Hansen</B> wird bei der Band aussteigen, um sich ganz seiner eigenen Band Gamma Ray (derren neues Album im Sommer erscheint) widmen zu k&#246;nnen. Diese Entwicklung war eigentlich schon seit dem superben `97er Debutalbum Iron Savior abzusehen, womit es doch etwas verwunderlich ist, da&#223; Kai Hansen immerhin auf drei regul&#228;ren Iron Savior Longplayern zu h&#246;ren ist. Na ja, da Iron Savior ohnehin mit Achim K&#252;stner und Mastermind Piet Sielck zwei weitere Gitarristen im Line-up haben, ist dieser Verlust nicht ganz so schmerzlich. Auf der n&#228;chsten Tour wird Kai Hansen allerdings nochmal dabei sein und man kann auch davon ausgehen, da&#223; er das eine oder andere Solo zum n&#228;chsten Longplayer beisteuern wird. Falls letzteres der Fall ist, bleibt eigentlich alles beim alten...</LI></P>

<p><li>Konstanz scheint es im Line-up von <b>Running Wild</B> nicht zu geben: Nachdem Drummer J&#246;rg Michael die Band schon vor geraumer Zeit verlassen hatte und noch immer kein konkreter Nachfolger in Sicht ist, ist nun auch <b>Thomas Smuszynski</B> nicht mehr mit von der Partie. Hatte man sich von J&#246;rg Michael noch in aller bester Freundschaft getrennt, so wurde Thomas Smuszynski mehr oder minder aus der Band geworfen. Als offizielle Begr&#252;ndung wird angegeben, da&#223; ein spannungsfreies Arbeiten mit ihm und Running Wild (gemeint ist hier nicht nur die Band, sondern auch Managment, Konzertagentur und Roadcrew) nicht
mehr m&#246;glich sei. Ein neuer Bassist ist noch nicht in Sicht, wohingegen ein Termin f&#252;r das n&#228;chste Langeisen schonmal grob auf Anfang 2002 datiert wurde.</LI></P>

<p><li>Bei <b>Angra</B> ist ja bekanntlich in den letzten Monaten viel falsch gelaufen. Trotzdem konnten die beiden verbleibenden Mitglieder Kiko Loureiro (Gitarre) und Rafael Bittencourt (Gitarre) mit <b>Eduardo Falaschi</B> (ex-Symbols) schonmal einen neuen S&#228;nger als Ersatz f&#252;r Andre Matos verpflichten. Und auch ein neuer Drummer namens <b>Aquiles Priester</B>, der vor kurzem noch die neue Soloscheibe &quot;Nomad&quot; von ex-Maiden Fronter Paul Di`Anno eingezimmert hatte, befindet sich mit an Bord. Die Position des Bassisten blieb hingegen vorerst noch unbesetzt. Ein neuer Studiooutput soll &#252;brigens gar nicht mehr so lange auf sich warten lassen.</LI></P>

<p><li>Eine absolute Frechheit ist den Power Metal Newcomern <b>Rawhead Rexx</B> wiederfahren: So weigern sich zahlreiche Plattenl&#228;den das selbstbetitelte Debut (Review in der letzten Ausgabe) in`s Sortiment mit aufzunehmen, weil das Cover angeblich zu &quot;Blutr&#252;nstig&quot; sei. Okay, da&#223; Fantasy Cover ist vielleicht nicht unbedingt eine Paradebeispiel f&#252;r ein gelungenes Artwork (Abbildung ebenfalls in der letzten Ausgabe), d&#252;rfte aber kaum ein Grund f&#252;r Zensur sein. Das Label AFM musste nat&#252;rlich darauf reagieren und liefert alle weiteren CD`s mit einem simplen schwarzen Cover aus. Hier zeigt sich mal wieder ganz klar, da&#223; die deutsche Zensurbeh&#246;rde offensichtlich an Gehirnschwund leidet, denn wer so ein Cover indiziert, m&#252;sste auch daf&#252;r sorgen, da&#223; Britney`s neueste CD aus den Verkausregalen verschwindet, denn diese ist dann auch abolsut sexistisch. Von den ganzen Talkshows &amp; Reality Stumpfsinn`s Show`s ganz zu schweigen...</LI></P>

<p><li>Nach dem superben &quot;Holy&quot; Album, wollen sich <b>U.D.O.</B> bald mit einer amtlichen Doppel Live CD bei Euch zur&#252;ckmelden. Das ganze wird in Russland mitgeschnitten und d&#252;rfte wohl eine recht interessante Sache werden. Einen konkreten Termin daf&#252;r gibt es allerdings noch nicht.</LI></P>

<p><li>Wer sich auf ein neues <b>Manowar</B> Langeisen freut - immerhin liegt das letzte regul&#228;re Studioalbum mitlerweile glatte 5 Jahre zur&#252;ck - wird sich wohl noch gedulden m&#252;ssen: Zur Zeit arbeiten die Herrschaften an Wiederver&#246;ffentlichungen ihrer Fr&#252;hwerke &quot;Battle Hymns&quot;, &quot;Into Glory Ride&quot; und &quot;Hail To England&quot;, die als &quot;Silver Editions&quot; mit exclusiven Photos und Interviews daherkommen sollen. Parallel dazu wird am zweiten Teil des &quot;Hell On Earth&quot; Videos / DVD gearbeitet.</LI></P>

<p><li>Rereleases Part II: Nicht nur Manowar arbeiten flei&#223;ig an ihren Rereleases, auch im Hause <b>Judas Priest</B> wird es eine Flut an Wiederver&#246;ffentlichungen geben: So sollen alle Scheiben von &quot;Sin After Sin&quot; (1977) bis &quot;Painkiller&quot; (1990) - immerhin 12 St&#252;ck - remastert und zudem noch mit massig Bonustrack`s (darunter auch unver&#246;ffentlichtes Studiomaterial) versehen werden. Zudem soll es eine amtliche Box geben, in die alle 12 Longplayer bequem reinpassen. Was ich von solcher Geldmacherei halte, hatte ich ja schon mehrfach erw&#228;hnt, denn ein Gro&#223;teil der Fans hat ohnehin schon alle Scheiben im Schrank stehen. Eine Einzel CD mit den Bonus Tracks h&#228;tte es doch auch getan, bringt aber bei weitem nicht so viel Knete in die Kassen von Sony...</LI></P>  

<p><li>Der &quot;Scenes From A Memory&quot; Nachfolger aus dem Hause <b>Dream Theater</B> soll schon im Sommer in trockenen T&#252;chern sein. Ab Anfang M&#228;rz sind die G&#246;tter des Prog. Metals n&#228;mlich mal wieder im Studio, um den n&#228;chsten Geniestreich einzut&#252;ten. Ob dieser Termin freilich eingehalten werden kann, bezweifele nicht nur ich sehr stark. Na ja, unterdessen erscheint Mitte April endlich die langersehnte DVD mit Material der Proggies. Auch nicht schlecht...</LI></P>

<p><li>Nach dem Ausstieg von Jason Newsted beim ehemaligen Metal Flagschiff <b>Metallica</B>, ist die Ger&#252;chtek&#252;che &#252;ber einen entsprechenden Nachfolger mitlerweile am brodeln: Als aussichtsreichster Kandidat wird dabei <b>Mike Inez</B> (Alice In Chains) gehandelt, aber konkrete Statements gibt es dazu noch nicht. Bis November soll &#252;brigens auch die n&#228;chste Platte der ehemaligen Trasher erscheinen. Bleibt nur zu hoffen, da&#223; durch Jason`s Ausstieg nicht noch der letzte Funken Metal bei Metallica verloren geht.</LI></P>

<p><li>Das gibt es auch nicht alle Tage: Der Song &quot;What Happened To Rock `n `Rol&quot; von Thomas Gottschalk war zwar alles andere als beeindruckend und hat an dieser Stelle normalerweise auch nichts verloren, aber in seiner Begleiband tummelte sich niemand anderes als <b>Metalium</B> Gitarrist Matthias Lange. Ach ja: Dessen Partner bei Metalium - <b>Jack Frost</B> (u.a. noch Seven Wicthes) - hat die Band derweil verlassen und verdient seine Br&#246;tchen in Zukunft bei (festhalten!) <b>Savatage</B> als Ersatz f&#252;r Al Pitrelli. Damit kreuzen sich die Wege von Metalium und Savatage erneut. Mehr News zum neuen Line-up von Savatage gibt`s in der n&#228;chsten Ausgabe!</LI></P>

<p><li>Tja, Metal Fans werden wohl in Zukunft ganz ohne Video`s im Fernsehen auskommen m&#252;ssen, da der noch aktzeptabelste Musiksender - n&#228;mlich <b>Viva II</B> - im Sommer die Pforten dicht macht. Neben dem ganzen modernen und alternativen Zeugs, was auf Viva II den ganzen Tag so runtergudelt wird, flimmerte in 
den letzten Wochen und Monaten auch Heavy Metal wie etwa Judas Priest, Primal Fear, Grave Digger oder Helloween &#252;ber die Mattscheibe. Tja, schade eigentlich, denn mit etwas gutem Willen h&#228;tte man auch durchaus eine eigene Heavy Metal Sendung in`s Programm einbauen k&#246;nnen. Leider darf bezweifelt werden, da&#223; der Heavy Metal Teil im Kiddie Sender Viva I zum Einsatz kommt.</LI></P></UL>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
