<HTML>
<HEAD>
<TITLE>REFLECTOR 044</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
EDITORIAL</H1></CENTER>

<HR SIZE=5><P>

<B>REFLECTOR 044</B><P>

Und wieder einmal ist es soweit: Das REFLECTOR-Team gr&uuml;&szlig;t alle Monzoom gesch&auml;digten;...und das nach mehr als 4 Monaten REFLECTOR-Abstinenz unserer Mitglieder!<P>

<CENTER>Somit: <B>Willkommen zur Ausgabe 44</B> unseres / Eures wiederauferstandenen <B>REFLECTOR-Magazins !!</B><P></CENTER>
Wiederauferstanden??...Jo!! Und wir sind froh dar&uuml;ber wieder auferstanden zu sein;...denn der Club stand kurz davor
aufgel&ouml;st zu werden!! Grund hierf&uuml;r waren zahlreiche ausstehende Mitglieder-Beitr&auml;ge! Wie das kam? Nun;...Entweder haben wir vergessen f&auml;llige Beitragsanforderungen `rauszuschicken, oder die f&auml;lligen Mitglieder
kamen Ihren Zahlungen nicht nach! Wie dem auch sei;...An dieser Stelle nochmals die groﬂe Bitte von uns: <B> Sollte irgendjemand keine Lust mehr auf eine Mitgliedschaft versp&uuml;ren, so sende er uns bitte eine kurze Mitteilung!</B> Nur so
k&ouml;nnen wir unsere Mitglieder-Liste stets auf den aktuellsten Stand bringen;...und nur so behalten wir den notwendigen &Uuml;berblick &uuml;ber den Status unseres Club-Konto`s! Wie heiﬂt es doch? <B>Ohne Mohs nix los! </B><P>
Und da wir nun schon einmal dabei sind, h&auml;ngen wir noch eine Bitte dran: Uns fehlen immer noch diverse Angaben von verschiedenen Mitgliedenr bez&uuml;glich Geburtsdatum, ge&auml;nderter Adressen, Angaben &uuml;ber verwendete Hardware, Software...usw!   Diese Angaben sind zwar freiwillig, w&uuml;rden uns aber bei der F&uuml;hrung des Clubs und der Gestaltung <B> Eures Reflector-Magazins </B> sehr hilfreich sein! An dieser Stelle schon mal Danke!<P>
<B>DANKE </B>sagen wir hiermit auch allen Mitgliedern, f&uuml;r die regelm&auml;&szlig;en Beitragszahlungen und f&uuml;r alles was unsern Club so am Leben erh&auml;lt!
<P><B>So! Wat tut sich dann so bei uns Reflector?</B> Wie schon letztens erw&auml;hnt &auml;ndert sich das Design unseres/<B>Eures Reflector-Magazins</B>! Schlagw&ouml;rter hier sind z.B. <B>Java</B> und <B>Animationen</B>! Probleme sind hier und da noch anzutesten bez&uuml;glich Java-f‰hige Browser und Einbindung kleinerer Anim`s bez&uuml;glich Diskettenplatz und abspielbarkeit innerhalb verschiedener Browser!
<P><B>Und wat tut sich bei uns Monzoom?</B> Die Amigianische <B>PPC-Version</B> rendert endlich, womit die Rechenzeiten
nun endlich deutlich unter die Lichtjahresgrenze angelangt sind;...alte Fehler sind immer noch drin;...wat vorher funktioklappt hat klappt nun nicht mehr (..is ja nix neues..);...usw.! Doch Oberland munkelt bereits von Monzoom-Version 5 mit v&ouml;llig
neu getippten C++ Code und neuer Oberfl&auml;che (..Pssst...Geheim..Uuups..)! Jedenfalls beginnt bald die erste Beta-Phase 
dieses Projekts, wat f&uuml;r die Beta-Tester wieder mal bedeutet: Kaffee...Aspirin...und Baldrian bereit halten!! Auf das die
n&auml;chsten Schwei&szlig;ausbr&uuml;che kommen!!!
<P>
Kommen wir zur aktuellen <B>REFELCTOR</B>-Ausgabe: Es gibt mal wieder tolle Bilder in der
<A HREF="../GALERIE.HTM">ArtGalerie</A>, und ebenso total heavym&auml;&szlig;ige <A HREF="../OBJEKTE.HTM"> Objekte!</A> In der Rubrik <A HREF="../TEXTE/Leserbri.HTM"> Leserbriefe</A> wird wieder wie gew&ouml;hnlich gem&auml;ckert;...sei es nun &uuml;ber uns oder sei es &uuml;ber Monzoom! Und nun:<B> K&uuml;belweise Schande &Uuml;ber uns;...DER TOOLS-POOL IS` LEER!</B><P>

So! Wir &uuml;berlassen Euch nun eurem Schicksal, auch <B>REFLECTOR</B>-Ausgabe genannt und sagen:...<P>

Viel Spa&szlig; beim st&ouml;bern!<P>

<B><I>Euer REFLECTOR-Team!</I></B><P>
<HR><P>

<DL>
<DT>Unsere Adressen:<DD><P>

<B>Uwe Sauder<BR>
Aakerf&auml;hrstr. 104<BR>
47058 Duisburg<BR>
Tel.: 0203-338557<P>

Olaf Gr&ouml;ning<BR>
Beckeradstr. 111<BR>
45897 Gelsenkirchen<P>

Werner Prass<BR>
Am Feldbusch 40<BR>
45889 Gelsenkirchen<BR>
Tel.: 0209-812029<BR>
 E-Mail:<A HREF="mailto:W.Prass@t-online.de"> W.Prass@t-online.de</A><P>
</DL>

<DL>
<DT>Bankverbindung:<DD><P>

<B>Volksbank Gelsenkirchen-Buer, Bankleitzahl: 42260001, Konto: 130 141 100</B><P>
</DL>

<DL>
<DT>Die REFLECTIONS-Mailboxen:<DD><P>

<B>O U Z O N I X - B B S<BR>
offline:  0.00-0.06 + 3.30-4.30 h<BR>
Sysop:  Ioannis Chatziandreou<P>

Fido Line #1 2:2448/1460.0 - Tel. Nr. 0234-9351320 (US-Robotic-DS 1200-36600 Baud)<BR>
Fido Line #2 2:2448/1461.0 - Tel. Nr. 0234-9351321 (ZyXEL U1496EG+ 1200-19200 Baud)<BR>
Fido Line #3 2:2448/1462.0 - Tel. Nr. 0234-9351318 (ISDN)<BR>
UUCP: ouzonix.ruhr.de<P>

D A R K S T A R - B B S<BR>
Sysop: Scarabeus (Andreas Stevens)<P>

Port #0: Tel. Nr. 02451-66999  (Active V.34 + ISDN)<BR>
Port #1: Tel. Nr. 02451- 7918  (ZyXEL V.34 + FAX)<BR>
eMail: Scarabeus@DarkStar.tng.oche.de</B><P>
</DL><P>

Downloads aus den <B>REFLECTIONS</B>-Areas der Mailboxen sind frei !!<P>
<HR> <P>

<H3><B>WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG WICHTIG</H3></B> <P>
 Die Archive (bzw. die Disketten) d&#252;rfen nur UNVER&#196;NDERT weitergegeben werden !
 Mailboxen, die sich mit dem Verbreiten von NAZI - Parolen und Hetze gegen
 Ausl&#228;nder und anderen Minderheiten hervortun, ist die Benutzung  von
 <B>REFLECTOR</B>-Disketten (egal ob zum Up- oder Downloaden) im ganzen oder teilweise
 (z. B. einzelne Bilder etc.) bei Strafandrohung (auch gegen User dieser Boxen)
 untersagt. Alle <B>REFLECTOR</B>-Ausgaben und Sonderdisks sind zwar im weitesten Sinne
 PublicDomain-Disks, aber kein Werbetr&#228;ger f&#252;r braune Schei&#223;e. Wir hoffen, das
 war klar und deutlich. Gleiches gilt nat&#252;rlich auch f&#252;r Mailboxen die sich mit
 dem Verbreiten linksradikal ausgerichteter Propaganda hervortun. Bei Fragen zu
 der <B>REFLECTOR</B>-PD-Serie oder zum <B>REFLECTIONS-Club</B> wendet Euch an die weiter oben
 genannten Adressen.<P>

 <B>Copyrights</B><P>
 sind nicht ganz unwichtige Sachen. Die Bilder, Animationen, Fonts, Objekte
 und Tools usw. auf dem <B>REFLECTOR</B>-Magazin und dessen Sonderausgaben, wie der
 <B>FontBox</B>-, der <B>REFLECTUR</B>- oder <B>REFLECTOR-Objektbibliothek</B> unterliegen zum
 gro&#223;en Teil diesem Copyright. Das hei&#223;t, da&#223; keine Beitr&#228;ge ohne die
 Einwilligung des Autors f&#252;r andere Zwecke, wie z. B. Ver&#246;ffentlichung auf
 anderen PD-Serien, Verkauf oder &#228;hnliches, benutzt werden d&#252;rfen. Vom
 Copyright ausgenommen sind Beitr&#228;ge, bei denen der Autor auf sein Copyright
 verzichtet, bzw. sein Beitrag als PublicDomain, Free- oder Shareware
 deklariert hat. Entsprechende Hinweise sind in den Info-Texten zu finden.
 Das gleiche gilt selbstverst&#228;ndlich auch f&#252;r die auf <B>REFLECTOR</B> und seinen
 Sonderausgaben benutzten Programme. Die Rechte der Programme liegen beim
 jeweiligen Autor. Wenn ein Beitrag vom Autor als Shareware, Giftware oder
 anderes deklariert ist, dann ist, entsprechend den Nutzungsbedingungen des
 Autors, das gew&#252;nschte Entgeld, Geschenk oder &#228;hnliches zu entrichten.<P>
 Wir k&#246;nnen aus eigener Erfahrung sagen,da&#223; jeder Autor, der uns f&#252;r das
 <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben Beitr&#228;ge zur Verf&#252;gung gestellt
 hat, dazu gerne bereit war. Bei Interesse an einer weiteren Verwendung dieser
 Beitr&#228;ge schreibt an den jeweiligen Autor. Schlie&#223;lich freut sich wohl jeder
 &#252;ber Post (wenn¥s denn keine Rechnungen sind).<P>
 &#252;brigens gibt es f&#252;r das <B>REFLECTOR</B>-Magazin und seinen Sonderausgaben ebenfalls
 ein Copyright. Wir behalten uns n&#228;mlich das Recht vor, da&#223; <B>REFLECTOR</B> und seine
 Sonderausgaben nur in unver&#228;nderter Form weitergegeben werden d&#252;rfen.<P>

<HR SIZE=5>
<B>
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
