<HTML>
<HEAD>
<TITLE>REFLECTOR 044</TITLE>
</HEAD>
<BODY BACKGROUND="../PIX/BACK.JPG">
<CENTER><H1><IMG WIDTH=454 HEIGHT=81 SRC="../PIX/REFLECTO.GIF" ALT="[REFLECTOR]"></A><P>
O B J E K T E</H1></CENTER>
<HR SIZE=5><P>

<B>Claus Peter Nandelstaedt</B><P>

hat uns seit der letzten Ausgabe mit reichlich Objekten versorgt. Zum einen w&auml;re da ein <B>Pick-Up</B>
zu nennen, dem Claus Peter auch noch einen Anh&auml;nger verpasst hat. Als n&auml;chstes gibt es ein super
Wasserflugzeug - <B>Catalina</B>. Leider hat der Schreiber dieses Textes nicht so viel Ahnung von den Teilen, aber
es soll sich hier um einen Oldie handeln. Das Teil ist wirklich sehenswert. Hallo Carsten "Fox",
wir wu&szlig;ten gar nicht das man mit Reflections solche Teile Construieren kann, Hut ab.<P>
Aber lassen wir den Meister mal selber zu Wort kommen:
<TABLE width=100%><TR><TD bgcolor=#FFFFCC>
<DIV ALIGN=RIGHT><B>Juli 98</DIV><P>

Hallo,W&auml;&auml;&auml;&auml;nn&auml;&auml;&auml;&auml;.<P>

Mein Dank kennt keine Grenzen.  Alles Top!
Es macht Freude mit Eurer Hilfe zu arbeiten.
Daf&uuml;r bekommst Du auch als Erster mein neues Objekt mit Bild, f&uuml;r Reflector.<P>

Es ist ein Pickup in CPN-Sonderausf&uuml;hrung.
Verl&auml;ngerte Ladefl&auml;che,deshalb mit Zwillingsr&auml;dern und verbreiterten Kotfl&uuml;geln.
Weil es sich anbot,wurde die hintere H&auml;lfte gedoppelt und so zum H&auml;nger.
Nat&uuml;rlich ist es kein Modell,sondern ich habe nur das konstruiert,was nachher auf einem Bild auch sichtbar ist.<P>

Alles was ausser dem Pickup in dem Bild ist wurde ja schon ver&ouml;ffentlicht.
Es sammelt sich.<P>

Auf dem Bild ist der Enkel,welcher gerade vom Opa sein neues Fahrzeug in Empfang nimmt.
Batteriebetrieben und mit einer richtigen Spritze,damit beim vorbeifahren auch mal die Fu&szlig;g&auml;nger
auf  knopfdruck ein bisken na&szlig; gemacht werden k&ouml;nnen.  :-)
Da hat das Dreirad nat&uuml;rlich ausgedient.<P>

Leider wurde im letzten Reflector das beigelegte Schreiben vergessen.
Schade, so weiss keiner,wie leicht man am Truck so manches bewegen und drehen kann.<P>

Uns Uwe muss sich ja auch erst an seinen Peceh gew&ouml;hnen.<P>

Innerlich muss ich ja grinsen. Was wurde im Reflector nicht Alles
&uuml;ber den PeCeh gel&auml;stert. Und nun??   :-)<P>

Sag niemals nie.<P>


so long<P>

CPN<P>
<HR>
<DIV ALIGN=RIGHT><B>Januar 99</DIV><P>


Hallo, Doktor Reflectus,
ich schon wieder.<P>

Beiliegender Brummer war eigentlich schon immer mein Liebling.
Die seitlichen Kanzeln, wodurch man sozusagen um Die Ecke schauen kann, finde ich urig.<P>

Die Catalina wurde in gro&szlig;en St&uuml;ckzahlen gefertigt.
Viele befinden sich jetzt noch  in Privatbesitz, wodurch der Farbgebung keine Grenzen gesetzt sind.
Das Ding  nach Bildern mit Ref zu konstruieren war ne echte Herausforderung und hat mir keine Ruhe gelassen.
Junge,Junge, nur Rundungen, kaum Kanten.
Eine Typenvielfalt, es kann einem grausen. Allein das Fahrgestell gibt es in Ausf&uuml;hrungen, da ist alles drin. 
Mit Bugrad, oder mit Heckrad, mit einziehbaren Fahrgestell, oder nur mit abwerfbarem Hilfsfahrwerk,oder ohne Alledem.
Teilweise wurden Hilfsraketen am Rumpf befestigt um vollbeladene Maschienen &uuml;berhaupt aus dem Wasser zu bekommen.
Das waren Ausnahmen.
Haupts&auml;chlich  war es ein Rettungs-oder Beochbachtungsflugzeug.
Die Farbgebung stammt von einem Bausatzprospekt und ist wohl authentisch
Urspr&uuml;ngliche Bewaffnung habe ich weggelassen, denn es dreht sich um ein Museumsst&uuml;ck  in der heutigen Zeit.
Deshalb auch die Piloten mit modernem outfit.
Die fr&uuml;heren Piloten hatten die ber&uuml;hmten Bomberjacken mit Schwimmwesten dar&uuml;ber.Auf dem Kopf die tollen knautschigen
Schirmm&uuml;tzen mit einem Kopfh&ouml;rer dar&uuml;ber.So einen Piloten sollte man direkt mal machen.<P>

Meine Konstruktion kan man in verschiedenen Zust&auml;nden tracen.
Entweder Schwimmer hoch, Fahrgestell zu,Motor l&auml;uft.= Fliegt.
oder
Motor l&auml;uft, Fahrgestell zu, Schwimmer unten = Start oder Landung zu Wasser.
oder
Motor l&auml;uft, Fahrgestell offen, Schwimmer oben = Start oder Landung auf Piste.
oder
Motor steht, Fahrgestell zu, Schwimmer unten = d&uuml;mpelt  im Wasser so vor sich hin.
oder
Motor steht, Fahrgestell offen,Schwimmer oben = Pilot ist in der Kantine und flirtet mit der Truppenbetreuerin.
oder 
Motor l&auml;uft ,Fahrgestell offen, Schwimmer unten= rollt &uuml;ber Rampe ins Wasser.<P>

Ihr m&uuml;sst das nur in der Plottliste auf der richtigen Seite haben und nat&uuml;rlich entweder,oder.
Was in der Plottliste nach der Kamera kommt mu&szlig; immer dabeisein.
Sind die Schwimmer oben, fungieren sie als seitlicher Abschluss der Tragfl&auml;chen.<P>

So nebenbei:
Vor kurzem fand in Berlin-Wannsee ein Flugtag f&uuml;r Wasserflugzeuge statt und man konnte in so einer Catalina sogar mitfliegen.
Da ich oft in Berlin bin, war ich nat&uuml;rlich vor Ort. :-))
Sogar eine Sunderland war zu bewundern.Bin in solch einer Kiste mal als einziges Frachtgut w&auml;hrend der Blockade von Berlin nach Hamburg mitgeflogen.
Nach der Landung auf der Elbe wurde ich von einer Barkasse abgeholt. Das war des Guten zuviel. Ich habe pausenlos Neptun mein Essen geopfert.
(Das man dies nur auf der Leeseite tun muss, wurde mir erst viel zu sp&auml;t klar). Sowas vergisst man nicht mehr.
Naja,Spa&szlig; muss sein.<P>

Noch ne Kleinigkeit.Wer was am Flieger bewegt , n i e m a l s  &uuml;ber den Punkteeditor !!!!!!!!!!!
Sonst sind die Texturen falsch, weil der Punkteeditor keine Texturen mitnimmt.<P>

Drehende Propeller darzustellen scheint immer noch  f&uuml;r so manchen Anwender ein Problem zu sein.
Solange man als Hintergrund nur eine Farbe benutzt, scheint Alles ok zu sein.
Bekommt der Hintergrund eine Textur ,tauchen aber schwarze Fl&auml;chen auf.
Der Hinweis von unserem Carsten ein Schachbrett mit Textur dahinterzusetzen ist absoluter Schwachsinn.Sorry.<P>

Es ist eigentlich kein Problem, wenn man die Schizophrenie von Ref. kennt.<P>

Ich rendere erst mal einen einzelnen Propeller.Kamerafarbe schwarz.
Das mit Ref. gewonnene Bild.jpg kommt in ein Bildbearbeitungsprogramm und wird dort  in 16 Farben umgewandelt !!!<P>

Nun mu&szlig; Alles was nicht zum Propeller geh&ouml;rt in ein und dieselbe Farb-Nr.Null umgewandelt werden, damit sp&auml;ter nur der Propeller sichtbar ist.
Farb-Nr. Null ist in der Regel die erste Farbe der Farbskala.(F&uuml;r Reflections),nicht zu verwechseln mit dem Farbton!<P>

Um sicher zu gehen, gebe ich der Farbe schwarz einen anderen knalligen Farbton.Im d&uuml;mmsten Fall zeigt sich dann n&auml;mlich,dass der schwarze
Hintergrund aus verschiedenen schwarzen Farben zusammengesetzt ist und von der Farb-Nr. Null &uuml;berpinselt werden mu&szlig;.
Am Besten ist es in die Farbskala zu schauenen.Sind dort mehrere schwarze Farben, einfach in andere Farbt&ouml;ne umwandeln, dann zeigt sich
was Sache ist.
Also schwarz  mu&szlig; nicht gleich schwarz sein,sondern  die Farb-Nr. Null .(Null ist kein Mu&szlig;, vereinfacht aber die Sache,
der Farbton ist unwichtig).
Da ein drehender Propeller nur Schemenhaft sichtbar ist, m&uuml;ssen wir dem Bild auf die Spr&uuml;nge helfen.
Wer in der Schule aufgepasst hat, weiss, je weiter entfernt sich ein um eine Achse drehender Punkt befindet, 
desto h&ouml;her seine Geschwindigkeit.Der Propeller wird also nach Aussen hin verwaschener. Ich mach es mit der Spr&uuml;hdose.Farb-Nr.Null.
Von Aussen nach Innen schw&auml;cher werdend.(Schaut euch einfach mal die Propellertextur an).Haben die Propellerspitzen Aussen eine
Warnfarbe, sollte um den Propeller noch ein entsprechender Farbring gelegt werden.Dieser mu&szlig; fast ganz sichtbar sein, weil unser Auge
durch die knallige Farbe in der Wirklichkeit get&auml;uscht wird.
Wer  ganz genau sein will, sollte die Propellerbl&auml;tter nach Aussen hin in der Form einer auf den Kopf gestellten Pyramide verbreitern.
Der Propeller wird jetzt noch als neues Bild ausgeschnitten,fertig ist die Textur.<P>

Nun kommen wir  wieder zu Reflection  s . :-))
Der wichtigste Schritt:
Das Material Glas oder genauer gesagt Nichts zu erstellen.
Der Schieber f&uuml;r Transparenz muss  unbedingt  ganz Rechts am Anschlag = 100% sein.
Brechungindex ebenfalls voll nach Rechts.
Das Schachbrett in der Farbkugel mu&szlig; absolut klar sein.
Wer dieses nicht macht und nur 99,9% einstellt, bekommt sp&auml;ter die schwarzen Fl&auml;chen.
Wir haben eigentlich nur ein ganz klares Glas eingestellt. Ist dieses Glas aber irgendwie angehaucht
stellt beim tracen Ref. die Weiterverfolgung des Strahles ein.
 Das ist die Schizophrenie. Ich begreife das nicht, kann aber damit leben.
Ihr k&ouml;nnt es ja ausprobieren.<P>

Jetzt macht man eine ganz normale Textur mit dem Propeller Bild.
Eingerastet sein mu&szlig; nur der Material-Knopf.  Kein Genlock oder sonst was.
Klickt auf den Materialvergebungsknopf Rechts, welcher wie eine Leiter aussieht.
Vergebt an Mat.0 das Oben erstellte Material Glas oder Nichts. 
Fertig.
Wir erinnern uns. Beim erstellen des Bildes sollte Alles was nicht zum Propeller geh&ouml;rt mit der Farb-Nr.Null &uuml;bermalt sein.
Da Null nicht zwingend ist, k&ouml;nnte man auch z.B die Farb-Nr 6 genommen haben
In diesem Fall mu&szlig; Nichts oder Glas an Mat.6 vergeben werden, wenn man beim abz&auml;hlen der Bildfarb-Nr. mit Null und nicht mit eins
begonnen  und  diese Zahl auch nicht inzwischen vergessen hat !!
Deswegen habe ich mir Null angew&ouml;hnt.
Da der Propeller ja von der Gleichen Szene getraced wurde, stimmen die restlichen Farben automatisch.
Man hat ausserdem noch die M&ouml;glichkeit den  Propeller mehr oder weniger sichtbar zu machen.
Jetzt kann man mit der Transparenz dieser Textur ungestraft rumspielen !!!
F&uuml;r die Propellertextur nimmt man einen Zylinder,macht den Umfang so gro&szlig;, oder klein, bis er alle Bl&auml;tter eines Propellers
umschliesst und so tief wie ein Propellerblatt ist.
Warum ein Zylinder und keine Scheibe? Beim Zylinder, der etwas tiefer ist als eine Scheibe sieht man auch 
von der Seite und nicht nur von Vorn den Propeller als Schatttenriss.
Der Zylinder mit der Porpeller-Textur wird nun an die gleiche Stelle gesetzt wie der richtige Propeller.
Beim raytracen mu&szlig; man sich also entscheiden was man m&ouml;chte.
Es kann nur der Zylinder oder der Propeller auf der Plottliste stehen, sons sieht es unsch&ouml;n aus.
Und nicht vergessen, beim tracen Raytraycing auf mindestens 2 setzen.<P>

Das ganze Blah Blah trifft ebenso f&uuml;r Flugzeugkanzeln oder &Auml;hnliches zu.<P>

Noch Tricks die nicht Jeder kennt:
Beim Konstruieren muss immer mal wieder getraced werden, zur Kontrolle.
Nicht vergessen das Licht mitzuplotten. So mancher hat sich schon gewundert, warum seine Objekte &ouml;fter die Farben wechseln.
Wenn beim tracen die Lichtquelle nicht dabei ist,generiert Ref ein Pseudolicht.
Wer zur kurzen Ansicht die Seiten wechselt zieht of m&uuml;hsam sein Licht hin und her weil man auf der Schattenseite sonst nur schwarz sieht.
Einfach das Licht neben die Kamera setzen und in der Hirachieliste das Licht auf die Kamera schieben (ankoppeln).Dann ist das Licht immer
auf der richtigen Seite.<P>

Damit Ihr vorm tracen die verschiedenen Zust&auml;nde schneller in der Plottliste einstellen k&ouml;nnt, habe ich den notwendigen Objekten ein
Minuszeichen vorangesetzt.Dadurch erscheinen sie immer am Anfang der Liste auf der linkenPlottseite.<P>


so long<P>

			CPN<P>
</TR></TD>
<P></TABLE>


Hier die Anschrift von uns Nandi:<P>

<PRE><B>
        Claus Peter Nandelstaedt
        Grunbacherstr. 3

        70736 Fellbach
        Tel.: 0711-512323
</B></PRE><P> 

<IMG WIDTH=128 HEIGHT=102 SRC="../OBJEKTE/CPN/PickUp.GIF" ALT="[BILD]"></A> Pick-Up<P>


<IMG WIDTH=128 HEIGHT=102 SRC="../OBJEKTE/CPN/Catalina.GIF" ALT="[BILD]"></A> Catalina<P>


<B><I>Euer REFLECTOR-Team!</I></B><P>

<HR SIZE=5>
<B>
<A HREF="../OBJEKTE.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEILZ.GIF" ALT="[ZURUECK]"></A> ZURUECK
<A HREF="../HAUPTMEN.HTM"><IMG BORDER=0 WIDTH=69 HEIGHT=49 SRC="../PIX/PFEIL.GIF" ALT="[HAUPTMENUE]"></A> HAUPTMENUE
</B>
<HR>
<ADDRESS>
</ADDRESS>
</BODY>
</HTML>
