<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. AMIGA stellt Dr. Rick LeFaivre als Chief Technology Officer (CTO) ein</H2>
<P>
Mit Dr. Rick LeFaivre hat AMIGA eine in der internationalen Computerbranche
anerkannte F&uuml;hrungspers&ouml;nlichkeit im Bereich Produktentwicklung
eingestellt. Nachfolgend der bisherige Werdegang des neuen Chief Technology
Officers (CTO) von AMIGA:
</P>
<P>
&raquo;Dr. Richard LeFaivre, Ph.D.
</P>
<P>
Verantwortlicher Leiter der Technologie bei Amiga, Inc.
</P>
<P>
Rick LeFaivre ist der verantwortliche Leiter f&uuml;r Technologie bei Amiga,
der Tochtergesellschaft von Gateway, Inc. Er trat Gateway/Amiga im April
1999 bei und ist verantwortlich f&uuml;r die Ausrichtung der Amiga-Technologie
der Zukunft.
</P>
<P>
Vor seinem Eintritt bei Amiga arbeitete Dr. LeFaivre als leitender
Vizepr&auml;sident verantwortlich f&uuml;r Forschung und Entwicklung und
verantwortlicher Leiter f&uuml;r Technologie bei der Inprise Corporation,
die aus dem Zusammenschluss von Borland International und Visigenic
Software entstanden war.
</P>
<P>
Davor war er:
</P>
<UL>
<LI> Vizepr&auml;sident der Gruppe f&uuml;r fortschrittliche Technologie bei
  Apple Computer;
</LI>
<BR><LI> Leitender Vizepr&auml;sident f&uuml;r Produkt-Entwicklung und verantwortlicher
  Leiter f&uuml;r Technologie bei der Computer Curriculum Corporation, einer
  Tochter der der Viacom AG;
</LI>
<BR><LI> Vizepr&auml;sident f&uuml;r Technik in der Abteilung f&uuml;r Netzwerk-Systeme bei
  Silicon Graphics Computer Systems;
</LI>
<BR><LI> Direktor der Windows- und Graphics-Systeme bei Sun Microsystems;
</LI>
<BR><LI> Direktor der Forschung f&uuml;r Computing und Visual Systems bei
  Tektronix AG;
</LI>
<BR><LI> Professor f&uuml;r Computerwissenschaften in Rutgers, der staatlichen
  Universit&auml;t von New Jersey.
</LI>
</UL>
<P>
In seiner Verantwortung lag die Aufsicht &uuml;ber das internationale
Forschungs- und Enwicklungszentrum von Tektronix in Leuwen, Belgien,
das Apple/ISS-Joint-Venture in Singapur und &uuml;ber die Forschungs- und
Entwicklungszentren von Inprise in Singapur und Sidney, Australien.
</P>
<P>
Dr. LeFaivre erhielt seinen A.B. (Bachelor of Arts) in Mathematik von der
Universit&auml;t von Missouri-Columbia im Jahre 1969 und seinen M.S. (Master of
Science) 1971 und Ph.D. (Doctor of Philosophy) 1974 in
Computerwissenschaften von der Universit&auml;t von Wisconsin-Madison. Er
erhielt ehrenhalber die Mitgliedschaft der Verbindungen &quot;Phi Beta Kappa&quot;,
&quot;Sigma Xi&quot; and &quot;Pi Mu Epsilon&quot; und er ist Mitglied der Vereinigung f&uuml;r
Computing Machinery. Er beteiligte sich an mehreren industriellen und
akademischen Beratungsaussch&uuml;ssen, eingeschlossen dem &quot;Council of Chief
Technology Officers of the Computer Systems Policy Project&quot; (etwa: &quot;Rat der
verantwortlichen Leiter f&uuml;r das Projekt f&uuml;r Computer-System-Politik&quot;), dem
&quot;Information Technology Industry Council&quot;  (etwa: &quot;Industrierat f&uuml;r
Informationstechnologie&quot;), dem &quot;Software Patent Institute&quot; und dem &quot;IEEE
Technical Committee on Machine Intelligence and Pattern Analysis&quot; (etwa:
&quot;Technisches IEEE-Kommitee f&uuml;r Maschinenintelligenz und Mustererkennung&quot;).
</P>
<P>
Von Dr. LeFaivre stammen zahlreiche computerwissenschaftliche
Ver&ouml;ffentlichungen und er erschien vor dem Kongress als Gutachter in
technologischen Angelegenheiten.&laquo;
</P>
<P>
(Quelle: AMIGA)
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
</P>
<P>
Nun noch eine Erg&auml;nzung zur Einstellung von Dr. Rick LeFaivre:
M&ouml;glicherweise steht dessen AMIGA-Mitarbeit bereits seit Wochen fest. Denn
Dr. LeFaivre, dessen Foto mit
<A HREF="http://www.inprise.com/about/management/images/lefaivre.gif" TARGET="_TOP">http://www.inprise.com/about/management/images/lefaivre.gif</A>
heruntergeladen werden kann, hat frappierende &Auml;hnlichkeit mit dem bisher
unbekannten AMIGA-Mitarbeiter, der auf einem mehrere Monate alten Bild,
das mit <A HREF="http://www.amiga-magazin.de/magazin/a04-99/news/gruppe.jpg" TARGET="_TOP">http://www.amiga-magazin.de/magazin/a04-99/news/gruppe.jpg</A>
heruntergeladen werden kann, vorn auf der linken Bildseite zu erkennen ist.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
