<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Neues von AMIGA</H1>
<H2>1. Interview mit AMIGA-Vizepr&auml;sident Petro Tyschtschenko</H2>
<P>
Chavez (<A HREF="mailto:chavez@pironet.netsurf.de">chavez@pironet.netsurf.de</A>) und Ghandy (<A HREF="mailto:ghandy@neuss.netsurf.de">ghandy@neuss.netsurf.de</A>)
haben zu Ostern auf der MekkaSymposium-Party spontan ein Interview mit
Petro Tyschtschenko, dem Leiter der deutschen AMIGA-Niederlassung, gef&uuml;hrt,
und uns die Ver&ouml;ffentlichung angeboten, was wir nat&uuml;rlich sehr gern
akzeptiert haben:
</P>
<P>
&raquo;Chavez/Ghandy: Hallo, ich gr&uuml;&szlig;e sie. Wie sind Sie hier hergekommen?
</P>
<P>
Petro Tyschtschenko: Hallo und frohe Ostern erst mal. Ich bin mit meinem
PKW hier, da ich meine ganzen Ostergeschenke mitgeschleppt habe f&uuml;r die
AMIGA-Scene.
</P>
<P>
Chavez/Ghandy: Werden Sie jetzt nicht zu Hause vermisst?
</P>
<P>
Petro Tyschtschenko: Na ja...ein wenig ja...aber ich bin halt mal viel
unterwegs f&uuml;r meinen geliebten AMIGA. Alle meine Familenangeh&ouml;rigen haben
da Gott sei Dank Verst&auml;ndnis.
</P>
<P>
Chavez/Ghandy: Im Moment tut sich viel. Phase 5, Haage &amp; Partner, Escena
etc., was glauben Sie, in welche Richtung geht es in der Zukunft? Wer wird
sich durchsetzen (auch in Bezug auf Kosh, etc.)?
</P>
<P>
Petro Tyschtschenko: Alle AMIGIANER sind immer willkommen.....Es werden
sich alle durchsetzen, meine ich, aber es sollte nur eine Richtung
geben...in die wir alle gehen sollten, denn vereint sind wir stark.
Gespaltenheit schadet uns nur im Augenblick.
</P>
<P>
Chavez/Ghandy: Woher kommt Ihr pers&ouml;nlicher Einsatz f&uuml;r den Amiga? Ist das
eher pers&ouml;nlicher Natur oder eher gesch&auml;ftlich?
</P>
<P>
Petro Tyschtschenko: Es ist rein pers&ouml;nlicher Natur. Mir macht es Spa&szlig;, f&uuml;r
eine Idee zu k&auml;mpfen...und nur so kann ich mich bei meinen amerikanischen
Freunden durchsetzen..Ich habe nichts zu verlieren...
</P>
<P>
Chavez/Ghandy: Ich sehe im Moment die Gefahr einer Spaltung der sowieso
schon recht kleinen Amiga-Familie. Engagement in die richtige Richtung kann
da nicht verkehrt sein. Aber in Polen spielt der Amiga ja noch eine gr&ouml;&szlig;ere
Rolle, auch z.B. wenn es um die Demoscene geht.
</P>
<P>
Petro Tyschtschenko: Spaltung nein....Kosh ?  Habe gerade eine tolle
Besprechung mit den Herren J.H. Haage und Dietrich hinter mir. Wir sind uns
alle einig, Phase 5 macht das neue G3-Board und Haage &amp; Partner entwickelt
den 68000-Emulator...also Sie sehen: EINIGKEIT !!!!
</P>
<P>
Chavez/Ghandy: Haage und Partner wird ja auch das OS 3.5 entwickeln, bzw.
ist schon dabei. Das alles ist sehr gut, aber es hat sich schon sehr lange
nichts mehr getan. Ist es jetzt nicht schon ein bisschen zu sp&auml;t? Es sind
schon viele Amiga-Fans abgesprungen, vor allem weil ihre Maschinen nicht
mehr &quot;der Zeit&quot; entsprachen (wie z.B. PCs).
</P>
<P>
Petro Tyschtschenko: Das ist schon richtig und bedauerlich...aber der harte
Kern bleibt der existierenden Plattform erhalten...Und die Leute, die zum
PC abgewandert sind, werden mit fliegenden Fahnen wieder zu uns
zur&uuml;ckkehren, wenn wir Front gegen ein Monopol machen.....! Warten Sie's
ab.
</P>
<P>
Chavez/Ghandy: Das werden wir, im Warten sind wir Amiganer ja leider schon
ge&uuml;bt! Mhhh. Wie sieht Ihre Strategie aus, wie wollen Sie den Amiga am
effektivsten vermarkten bzw. Marktanteile zur&uuml;ckgewinnen?
</P>
<P>
Petro Tyschtschenko: Auch ich bin im Warten ge&uuml;bt...schlie&szlig;lich hat Gateway
jetzt zwei Jahre fast nichts gemacht und nur Zeit gebraucht, den AMIGA zu
verstehen...Jetzt haben sie es endlich begriffen....Geld wird eine
Strategie sein, die wir brauchen, um uns den Markt zur&uuml;ckzuholen...und das
will Gateway investieren. Zweitens ben&ouml;tigen wir das Management. Und ich
meine, Jim Collas ist der richtige Mann, den AMIGA dorthin zu bringen, wo
er eigentlich schon lange sein m&uuml;&szlig;te..n&auml;mlich ganz nach vorne. In Marketing
ist Gateway Meister..
</P>
<P>
Chavez/Ghandy: Und Gateway hat ja letztens auch reagiert und einige
F&uuml;hrungspers&ouml;nlichkeiten ausgetauscht, zum Teil wohl auch, um die
Transparenz des Unternehmens zu erh&ouml;hen. Ich habe mich gefragt, welches
Interesse eine Firma, die PCs herstellt, hat, den AMIGA, also sprich eine
konkurrierende Platform, zu unterst&uuml;tzen.
</P>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Petro Tyschtschenko: Unser&nbsp;</TD><TD VALIGN="TOP">Betriebssystem ist der Schl&uuml;ssel....das hat&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Gateway kapiert und zieht&nbsp;</TD><TD VALIGN="TOP">jetzt los.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Chavez/Ghandy: Inwieweit bzw. wie lange werden noch die sogenannten
&quot;Classic-Amigas&quot; supportet?
</P>
<P>
Petro Tyschtschenko: Solange ich was zu sagen habe, immer....und das wird
hoffentlich noch lange sein...
</P>
<P>
Chavez/Ghandy: Was halten Sie davon, im Herbst eine &quot;Amiga-only&quot;-Messe zu
organisieren, anstatt der Computer'99 in K&ouml;ln (die aber nicht 'Computer
'99' sondern 'Home electronics world '99' hei&szlig;en wird; Anm. d. Red.)?
</P>
<P>
Petro Tyschtschenko: Gar nichts. Wir brauchen einfach das andere Volk, um
denen zu zeigen, wie gut und wie unschlagbar wir mit einer Technologie
sind, die seit 1991 keine Neuentwicklung mehr hatte. Ich habe mich f&uuml;r K&ouml;ln
schon verpflichtet und das wird die Messe der Superlativen werden..das
verspreche ich Euch.
</P>
<P>
Chavez/Ghandy: Letzte Frage: Was sind Ihre W&uuml;nsche f&uuml;r die Zukunft
(privat/beruflich/Amiga)?
</P>
<P>
Petro Tyschtschenko: Unser Amiga soll endlich den Platz einnehmen, der ihm
geb&uuml;hrt. Das ist mein oberstes Ziel....
</P>
<P>
Privat: Gesundheit, dass ich noch lange f&uuml;r meinen geliebten Amiga k&auml;mpfen
kann, und gesch&auml;ftlich ein Produkt, ein neues, wie damals 1985
revolution&auml;r, mit einem Umsatz in Milliardenh&ouml;he..und zur Zufridenheit
aller User.
</P>
<P>
Chavez/Ghandy: Vielen Dank f&uuml;r das Gespr&auml;ch und danke f&uuml;r das Sponsoring
von Amiga International f&uuml;r unsere Party letztes Jahr (Cologne Conference
'98).&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
