<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. DCE fertigt Phase5-Produkte</H2>
<P>
&raquo;Frankfurt, 27.04.1999
</P>
<P>
Gute Nachrichten f&uuml;r alle Amiga-Anwender, die ihrem Rechner zu mehr
Leistung verhelfen wollen: Die DCE GmbH aus Oberhausen, langj&auml;hriger
Hersteller einer umfangreichen Palette von Hardware-Zubeh&ouml;r f&uuml;r AMIGA
Computersysteme, und phase 5 digital products aus Oberursel, Entwickler und
Hersteller leistungsstarker Prozessor-, Grafik- und SCSI- Karten f&uuml;r AMIGA-
Rechner, geben hiermit den Abschlu&szlig; eines Lizenzvertrages bekannt, der es
der DCE GmbH erm&ouml;glicht, ab sofort eine Reihe von phase 5-Produkten, die
aufgrund der Fokussierung auf PPC-Upgrades aus dem Programm von phase 5
genommen wurden, unter Lizenz zu fertigen und zu vertreiben. Es handelt
sich dabei im einzelnen um die folgenden bekannten Produkte:
</P>
<UL>
<LI> Blizzard 1220/4
</LI>
<BR><LI> Blizzard 1230-IV
</LI>
<BR><LI> Blizzard 1240 T/ERC
</LI>
<BR><LI> Blizzard 1260
</LI>
<BR><LI> Blizzard SCSI-Kit IV f&uuml;r Blizzard 1230-IV, 1240 und 1260
</LI>
<BR><LI> Blizzard 2040 und Blizzard 2060
</LI>
<BR><LI> CyberVision64/3D sowie Scandoubler dazu
</LI>
<BR><LI> Cyberstorm MkIII
</LI>
</UL>
<P>
Mit Abschlu&szlig; dieser Lizenzvereinbarung wird die kontinuierliche
Verf&uuml;gbarkeit der 68k-basierten Prozessorkarten von phase 5 digital
products, sowie der diversen o.g. Zubeh&ouml;rkarten, auf Dauer gesichert; damit
wollen die beiden Hersteller auch ein Zeichen des fortgesetzten Supports
fur den Amiga-Markt setzen. &quot;Wir sind sehr froh, da&szlig; wir in der DCE GmbH
einen Partner gefunden haben, der die Produkte fortf&uuml;hrt, die wir aufgrund
unserer Fokussierung auf die PPC-Linie aus dem Portfolio genommen haben,
und der die technische Kompetenz sowie die langj&auml;hrige Amiga- Erfahrung
mitbringt, die Produkte auf dem gewohnt hohen Qualit&auml;tsniveau zu fertigen,
den fl&auml;chendeckenden Vertrieb zu gew&auml;hrleisten und die Kunden optimal
zufriedenzustellen&quot; sagt dazu Wolf Dietrich, Gesch&auml;ftsf&uuml;hrer von phase 5
digital products. Thomas Dellert, Gesch&auml;tsf&uuml;hrer der DCE GmbH, erg&auml;nzt:
&quot;Durch diese Kooperation k&ouml;nnen viele Anwender jetzt wieder die
leistungsstarken Produkte, die in den vergangenen Monaten nicht verf&uuml;gbar
werden, zu attraktiven Preisen beziehen, und ihre bestehenden Systeme so
optimal aufr&uuml;sten und Up-to-date halten&quot;.
</P>
<P>
Die k&uuml;nftig von DCE unter Lizenz hergestellten Produkte sind im
internationalen Testvergleich als vielfache Testsieger pr&auml;miert, und
repr&auml;sentieren auch heute noch eine f&uuml;hrende 68k- Beschleunigertechnologie
f&uuml;r AMIGA 1200 und 3000/4000 sowie kompatible Systeme.
</P>
<UL>
<LI> Information
</LI>
<BR><LI> DCE Computer Service GmbH
   Kellenbergstra&szlig;e 19a
   D-46145 Oberhausen
   Tel.:0208 660673
   Fax.:0208 630496
</LI>
<BR><LI> phase5 digital products
   In der Au 27
   D-61440 Oberursel
   Tel.:06171 583787
   Fax.:06171 583789&laquo;
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Diverses2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
