<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses4.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses6.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. A.C.T. entscheidet &uuml;ber zuk&uuml;nftige Pr&auml;senz auf dem Amiga-Markt</H2>
<P>
&raquo;Endg&uuml;ltige Entscheidung &uuml;ber zuk&uuml;nftige Pr&auml;senz von A.C.T. auf dem Amiga
Markt
</P>
<P>
M.  Albrecht, Gr&uuml;nder und Kopf der Firma A.C.T., sammelt in einer Web
Umfrage Informationen &uuml;ber das Interesse der Amiga Gemeinschaft an
bestehenden und zuk&uuml;nftigen Entwicklungen seiner Firma. Obwohl A.C.T. sich
normalerweise mit Audio Technik besch&auml;ftigt werden auch die Entwicklungen
von USB- und MultiIO-Controllern angeboten. Sollte die Zahl der
Interessensbekundungen unter bestimmten Limits liegen, sieht A.C.T. keine
M&ouml;glichkeit, auf dem Amiga Markt weiterhin t&auml;tig zu sein.
</P>
<P>
Eine Teilnahme an der Umfrage beinhaltet keine feste Vorbestellung der
Produkte. Herr Albrecht erkl&auml;rt, da&szlig; bei Erreichen einer n&ouml;tigen
Mindestzahl von Interessensmeldungen diejenigen angeschrieben werden, die
ihre Email-Adresse angegeben haben, und &uuml;ber eine tats&auml;chliche
Vorbestellung sowie eventuell Vorauskasse befragt werden. Die ben&ouml;tigten
Bestellzahlen sind relativ niedrig (1000 bis 2000 St&uuml;ck je nach Projekt)
und werden f&uuml;r eine gesicherte Finanzierung der Projekte gebraucht.
Alle Amiga-User mit Netzzugang werden gebeten, eine Teilnahme an der
Umfrage zu erw&auml;gen, da das Resultat dieser Aktion nicht nur &uuml;ber A.C.T.s
Verbleib entscheidet sondern auch anderen Firmen und Entwicklern zur
Entscheidungsfindung dienen wird.&laquo;
</P>
<P>
Die Umfrage ist auf <A HREF="http://www.act-net.com" TARGET="_TOP">http://www.act-net.com</A> zu finden. Sie l&auml;uft bis zum 20.
Mai. Danach werde entschieden, welche Produkte man entwickeln will.
Bereits jetzt hat A.C.T. bekannt gegeben, dass mit hoher Wahrscheinlichkeit
ein USB(Universal-Serial-Bus)-Controller gefertigt werde. Drei Versionen
seien geplant: je eine f&uuml;r ZorroII-Amigas, als AddOn f&uuml;r die Soundkarte
Prelude und als AddOn f&uuml;r die Ethernetkarte Ariadne II.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses4.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
