<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P>
Erscheint der AmigaNG noch 1999?
</P>
<P>
Bereits in diesem Jahr sollen die ersten Amigas der n&auml;chsten Generation
(auch AmigaNG oder Amiga-II genannt) auf den Markt kommen. Angesichts der
im Computerbereich &uuml;blichen Versp&auml;tungen muss es erlaubt sein, diesen
Zeitplan zu hinterfragen.
</P>
<P>
Wenn selbst Giganten der Computerbranche die Einf&uuml;hrung neuer
Produktversionen beinahe regelm&auml;&szlig;ig aufschieben, weil die jeweilige Hard-
oder Software aufgrund von unkalkulierten Verz&ouml;gerungen nicht rechtzeitig
fertig geworden ist, sollten wir dann nicht davon ausgehen, dass das bei
einer eher kleinen Firma wie AMIGA und einem v&ouml;llig neuartigen Produkt erst
recht passieren kann?
Denn damit ersparten wir uns eine herbe Entt&auml;uschung f&uuml;r den Fall, dass
sich das von AMIGA-Vizepr&auml;sident Petro Tyschtschenko im Interview dieser
Ausgabe als &quot;Messe der Superlativen&quot; angek&uuml;ndigte diesj&auml;hrige K&ouml;lner Amiga-
Highlight als doch nicht so sensationell entpuppen sollte.
Wie hei&szlig;t es doch so sch&ouml;n: Hoffe das Beste, aber rechne mit dem
Schlimmsten. Das wissen wir Amiga-Anwender aufgrund unserer Erfahrungen
seit Jahren zu beherzigen, und so sollten wir auch in den n&auml;chsten Monaten
verfahren. Ein Erscheinen des Amigas der n&auml;chsten Generation noch in diesem
Jahr w&auml;re sch&ouml;n - aber vielleicht zu sch&ouml;n, um wahr zu werden?
</P>
<P>
Bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
