<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>6. Schlusswort zum Napalm-Test von Manni Froitzheim (von Manni Froitzheim)</H2>
<P>
Aufgrund der Reaktionen auf meinen Testbericht zu Napalm m&ouml;chte ich
noch eine Schlu&szlig;bemerkung machen um das Kapitel Napalm f&uuml;r mich endg&uuml;ltig
beenden zu k&ouml;nnen.
</P>
<P>
Mir scheint es so,als ob ich der einsame Rufer in der W&uuml;ste w&auml;re....
Ein paar nette Mails hat es ja in den letzten Wochen gegeben,jede
Menge B&ouml;ses nat&uuml;rlich als Dreingabe dazu...was solls...:-)
</P>
<P>
Erstmal ist es so,das ich weder ein Spiel (absichtlich) schlecht rede
noch (weil jeder es tut) in den Himmel lobe. Das die APlus immer 90%
vergibt,gut...,das aber die Fever und AOS genauso Napalm loben ist mir
ein R&auml;tsel...und warum alle Welt so darauf abf&auml;hrt (aufgrund der Werbung
von Clickboom,oder den unkritischen Berichten der Fachzeitungen...?) ist
mir ein weiteres nicht zu ergr&uuml;ndendes Geheimnis.
</P>
<P>
Wenn man auf den Begriff &quot;Strategie&quot; bei Napalm verzichten w&uuml;rde,w&uuml;rde
es mir deutlich besser gehen. Den ganzen &quot;Strategiespielfans&quot;,welche
Napalm so - super - klasse - toll - finden,rate ich doch mal dringend
&quot;von Clausewitz&quot; zu lesen, vorzugsweise sein Werk &quot;Vom Kriege&quot;.Napalm
ist KEIN Strategiespiel,weil es absolut keinerlei Elemente des Begriffes
der Strategie enth&auml;lt !!! Nur weil darin Panzer u.&auml;. herumf&auml;hrt und
alle Welt es behauptet wird da noch lang kein Strategiespiel daraus.
</P>
<P>
Soll ich mal ein Beispiel geben ?
Mission 6 der Roboter:
Da soll man dann einen Spion in das feindliche Lager schicken (send a
spy to the enemy base),daf&uuml;r hat man dann 30 Minuten Zeit.
Hm...
</P>
<P>
Was wird damit wohl gemeint sein...?
Naja,habe dann erstmal geschaut,ob es eine extra Figur SPY gibt (gibt
es nicht)...hm...dann mag es wohl bedeuten,einen &quot;technician&quot; ins Lager
zu schicken (oder ins HQ oder in ein anderes Geb&auml;ude) ?
Hm...
</P>
<P>
Gut,habe dann also zigmal alles M&ouml;gliche versucht,vom kompletten
zerst&ouml;ren der Basis bis zu dem Versuch einen &quot;technician&quot; in (verschiedene)
Geb&auml;ude zu ziehen (was bei mir bisher in keinem Level m&ouml;glich war), dann
den einfach nur bis zum Ablauf der Frist am Leben erhalten...nix,absolut
nix....,jedesmal &quot;mission failed&quot; und dann werde ich stinkesauer auf so
einen Mist....Eine v&ouml;llig uneindeutig formulierte &quot;wischiwaschi&quot; Aufgabe,
zigmal alles mir nur m&ouml;glich erscheinende ausprobiert und jedes mal
verloren....DAS SOLL ETWA STRATEGIE SEIN ?
</P>
<P>
Das ich nicht lache !!!
</P>
<P>
Bin ich ich hier etwa ein Versuchskaninchen in einer Skinner Box,das
durch &quot;try and error&quot; irgendwann mal was zu fressen bekommt ? Nee Leute,
um es mal drastisch auszudr&uuml;cken:Napalm ist der letzte Dreck....
</P>
<P>
Sorry,aber das ist f&uuml;r mich das Schlimmste an dem Spiel &uuml;berhaupt.Mit
dem Rest kann man ja noch irgendwie (f&uuml;r DM 30.-) leben....Und wenn dem
Rest der Amigagemeinde diese Dinge egal sind und die DM 100.- daf&uuml;r
ausgeben wollen ist das auch wiederum mitnichten mein Geld und ganz
sicherlich nicht mein Problem.
</P>
<P>
Und,ich sage IMMER was ich DENKE und es ist mir egal...mir w&auml;res es auch
erheblich lieber gewesen endlich mal ein neues gutes Strategiespiel zu
bekommen... aber Napalm ist es mit Sicherheit nicht !
</P>
<P>
Trotzdem,noch ein kleiner Tip:
</P>
<P>
Wer mal einen anderen Level spielen will,brauch einfach nur in den
Verzeichnisen graphics/images/missions/sounds eine xbeliebige Datei
in die jeweilige 01.dat umbenennen und dann im Hauptmenu &quot;compaign&quot;
w&auml;hlen...Das Spiel l&auml;&szlig;t sich leider nicht korrekt speichern,weil die
vorhergehende Mission nicht gespielt wurde und bei &quot;restart game&quot; startet
er auch immer die Originale 01.dat Datei...
</P>
<P>
zu Andreas Falkenhahn:
Ich (man/frau) soll froh sein,das existierende Spiele weiterentwickelt
werden...? Das ist doch wohl das mindeste,oder ? (Ein neuer Fehler in
Napalm V1.2,welcher in V1.0 nicht drin war hat n&auml;mlich zum Mi&szlig;lingen der
oben beschriebenen 6.Mission gef&uuml;hrt...) Und es ist immer noch ein
gro&szlig;er Unterschied,ob ein gutes Spiel noch besser gemacht wird,als ein
mieses Spiel erstmal spielbar zu machen !!!!! Und die Anmerkung in der
readme Datei zu V1.3,das bei vernetzten Spielen BEIDE Amigas die gleiche
Napalm Version benutzen m&uuml;ssen ist zwar nett,funktionieren tut es aber
trotzdem immer noch nicht...Die Netzwerk Verbindung wird jetzt nicht mehr
abgebrochen,daf&uuml;r laufen die Uhren nicht mehr syncron,was bedeutet,der
eine Rechner ist rund 5 Minuten weiter...und sieht, schie&szlig;t auf Fahrzeuge,
welche der Gegener (auf seinem Monitor) schon l&auml;ngst woanders hingezogen
hat.&Auml;tz...!
</P>
<P>
Das ist &auml;hnlich der A-Klasse von Mercedes:
Das Ding landet auf dem Dach,eine elektronische (Zusatz) Kr&uuml;cke wird
eingebaut (gedacht als Extra f&uuml;r die S-Klasse),ohne die der Wagen
prinzipiell nicht fahrt&uuml;chtig ist und alle Welt kauft sich so'n Schrott
und macht sich nicht klar,das der Wagen grunds&auml;tzlich eine Fehlkonstruktion
ist.
</P>
<P>
Und zur Fa.Clickboom,was ist mit QuakePPC ? Die User wollen es und warum
passiert nix ? Bin ich als Kunde etwa ein Bettler oder wollen die kein
Geld verdienen ?
</P>
<P>
Leider kann ich nicht programmieren.m&ouml;chte aber trotzdem hier an dieser
Stelle einen Aufruf an alle (unzufriedenen) Strategiespielfans starten,
sich mit mir in Verbindung zu setzen um ein Konzept f&uuml;r ein &quot;wahrhaftiges&quot;
Strategiespiel zu entwickeln,um es dann den Firmen pr&auml;sentieren zu k&ouml;nnen
oder Programmierer zu suchen,welche es umsetzen wollen/k&ouml;nnen/machen.
</P>
<P>
Manni Froitzheim &lt;<A HREF="mailto:M.Froitzheim@t-online.de">M.Froitzheim@t-online.de</A>&gt;
</P>
<HR>
<BR>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Hinweis:&nbsp;</TD><TD VALIGN="TOP">Das ein Amiga Spiel weiterentwickelt wird, ist nicht&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">selbstverst&auml;ndlich!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Von den Spielen, die die letzte Zeit erschienen sind werden nur&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">ganz wenige weiterentwickelt!&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
