
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/aktuell.gif" BORDER="0" WIDTH="89" HEIGHT="35" ALT="Aktuell">
<h1>Open Letter von Jeff Schindler
</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>




<P>&quot;Das Amiga OS hatte schon immer dieses gewisse Etwas gehabt,
das noch nie von einem anderen Betriebssystem erreicht wurde.
Es ist kompakt, effizient und Multimedia orientiert.
</P>
<P>Wie Dr. Allan Havemose oft sagte: &quot;wir haben genau das 
richtige getan&quot;. Und noch heute kann der Amiga besser und 
schneller arbeiten, als das derzeit dominante Betriebssystem.
</P>
<P>Es gab in den letzten Wochen viel Aufregung und auch Bedenken 
&uuml;ber die Zukunft des Amiga. Mit der Bekanntgabe in Deutschland
&uuml;ber unseren Partner QNX und die Pr&auml;sentation dessen, was diese
Komplettl&ouml;sung leisten kann, haben wir den raschen Weg in die 
Zukunft eingeschlagen.</P>

<P>Als Amiga Inc. gegr&uuml;ndet wurde, war unser Ziel die Entscheidung
der bestm&ouml;glichen Richtung f&uuml;r Amiga. Wir wollten: 
</P>
<PRE>* die momentane Entwicklungsrichtung fortf&uuml;hren und eine weitere
  Version des Betriebssystems herausbringen ein komplett neues
  Team aufbauen, das das Betriebssystem mit den n&ouml;tigen Features
  austattet, um konkurrenzf&auml;hig zu sein.
* ein Betriebssystem finden, das die gleichen Ideale und den 
  gleichen Geist wie der Amiga hat.
* Wir sind eine Partnerschaft mit QNX eingegangen, um die neue 
  Amiga-Generation zu erschaffen. Dies hei&szlig;t aber nicht, da&szlig; wir
  vorhaben, die treue Amiga-Gemeinde und die Amiga-Classic User
  zu vergessen.</PRE>
<P>
Wir werden weiter daran arbeiten, das OS3.5 zu ver&ouml;ffentlichen,
aber ebenso wichtig ist es, mit der Arbeit an dem neuen Betriebs-
system beginnen. Wir sind dem Amiga zu einer langen und auf-
regenden Zukunft verpflichtet, genau so wie der Amiga-Gemeinde,
die diese hervorragende Architektur am Leben erhalten hat.</P>

<P>Die Arbeit an 3.5 ist in vollem Gange und wurde NICHT eingestellt!
In den letzten Wochen haben wir erkannt, da&szlig; das, was wir glaubten
von unseren Partnern f&uuml;r dieses Projekt zu bekommen, nicht immer 
das war, was diese darunter verstanden, uns zu liefern zu m&uuml;ssen. 
Wir kommen auf jede einzelne Partnerfirma zur&uuml;ck, die f&uuml;r das OS 
3.5 zust&auml;ndig ist, um sicherzustellen, da&szlig; sie genau an dem ar-
beiten, was unsere Kunden brauchen. Es ist entscheidend, das zu 
liefern was wir versprochen haben, n&auml;mlich eine saubere Komplett-
l&ouml;sung.</P>

<P>Einige von euch waren sehr besorgt &uuml;ber die Zukunft von Amiga und 
unseren Verpflichtungen gegen&uuml;ber den Entwicklern und der Gemeinde.
Bitte seid versichert, da&szlig; eure eMails nicht ignoriert wurden. Wir
arbeiten sehr hart an der Vervollst&auml;ndigung der letzten Phase des 
3.5, um die Entwickler-Programme und die letzten Spezifikationen
mit unserem Partner QNX fertigzustellen. Wir wollen das robusteste
und aufregendste Betriebssystem pr&auml;sentieren, das es je gab. Wir
werden es schaffen.</P>

<P>Danke f&uuml;r eure Geduld und Unterst&uuml;tzung. Der Amiga ist auf dem 
richtigen Weg und wir hoffen, euch bald beides vorstellen zu 
k&ouml;nnen - das 3.5 und die neue Amiga Generation.</P>

<P>Verliert nicht den Mut - wir sind kurz vor dem Durchbruch.&quot;</P>

<P>Jeff Schindler<BR>

General Manager<BR>

Amiga Inc.</P>

<P>(Copyright by AMIGA International, Inc.)</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell03.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell05.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

