
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/aktuell.gif" BORDER="0" WIDTH="89" HEIGHT="35" ALT="Aktuell">
<P><b>Kein 77,- DM Tomorrow-Tarif f&uuml;r`s Internet mehr!</b></P>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>



<P>Schlu&szlig; mit dem 77,- DM Tomorrow-Tarif! Der Verbraucherschutz hat 
MobilCom vorgeworfen, da&szlig; im Tomorrow-Tarif gegen das allgemein 
geltende AGB-Gesetz (Allgemeine Gesch&auml;ftsbedingungen) versto&szlig;en
wurde und der Tarif damit wettbewerbswidrig sei. Aus diesem Grund
bietet MobilCom ab sofort keinen Tomorrow-Tarif mehr an und k&uuml;ndgt
allen Kunden den Vertrag. Wer schon den 77,- DM Pauschalbetrag bezahlt hat, bekommt das Geld gutgeschrieben - alle anderen brauchen
ihn nicht zubezahlen.</P>

<P>Hier das offizielle Statement von MobilCom/01019Freenet:</P>

<P>&quot;Achtung - 19. Februar '99 - K&uuml;ndigung - Achtung</P>

<P>Verbraucherschutzverein verhindert 77 Mark-Pauschaltarif!</P>

<P>MobilCom bietet ab sofort Internet FlatRate 6 Pf./Min rund um 
die Uhr. </P>

<P>Leider m&uuml;ssen wir Ihnen heute mitteilen, da&szlig; wir den Tomorrow-Tarif
nicht l&auml;nger anbieten d&uuml;rfen. Mit dieser Ver&ouml;ffentlichung k&uuml;ndigt 
die MobilCom Communications- dienste GmbH fristlos den mit Ihnen geschlossenen 
Tomorrow-Tarif-Nutzungsvertrag aus wichtigem Grund. Entgegen unserer 
eigenen &Uuml;berlegung, das Internet in Deutschland billiger 
zu machen, zwingt uns ein Angriff des Verbraucherschutzvereins
e.V. Berlin vom 9. Februar '99 dazu, die FlatRate vom Netz zu nehmen.
In dem Schreiben des Verbraucherschutzverein e.V. Berlin vom 9. Februar '99
 wird der MobilCom GmbH vorgeworfen, da&szlig; einige im Tomorrow-
Tarif gegen&uuml;ber dem Kunden genutzten Allgemeinen Gesch&auml;ftsbedingungen
(AGB) gegen das geltende AGB-Gesetz versto&szlig;en und damit wettbewerbswidrig sind. Bei der intensiven Pr&uuml;fung der ger&uuml;gten AGB's hat sich
ergeben, da&szlig; die MobilCom GmbH nahezu alle Beanstandungen ausr&auml;umen 
k&ouml;nnte. Dies ist aber bei der nachfolgend genannten Gesch&auml;ftsbedingung nicht m&ouml;glich: </P>

<P>In dem Schreiben hei&szlig;t es: &quot;F&uuml;r diesen angebotenen Dienst steht nur
eine begrenzte Anzahl von Zug&auml;ngen zur Verf&uuml;gung. Aus diesem Grund 
kann die permanente Einwahl nicht gew&auml;hrleistet werden.&quot;</P>

<P>Es ist uns aufgrund der gewaltigen Resonanz auf das Tomorrow-Tarif-
Angebot nicht m&ouml;glich, jedem einzelnen Interessenten jederzeit einen
eigenen Einwahlport zur Verf&uuml;gung zu stellen und nur dies w&uuml;rde einen
permanenten Zugang ins Netz gew&auml;hrleisten. Da eine Weiterverwendung 
der bestehenden AGB's mit einer hohen Vertragsstrafe seitens des Verbraucherschutzvereins 
geahndet werden wird, hat sich die MobilCom Communicationsdienste
 GmbH entschlossen, die Unterlassungserkl&auml;rung zu
unterzeichnen und damit auch den Tomorrow-Tarif mit sofortiger Wirkung
vom Netz zu nehmen. Die Unterzeichnung der Unterlassungserkl&auml;rung hat
leider konsequenterweise die fristlose K&uuml;ndigung des mit Ihnen geschlossenen Tomorrow-Tarif-Nutzungsvertrages zur Folge.</P>

<P>Achtung:<BR>

Keinem f&uuml;r den Tomorrow-Tarif freigeschalteten Nutzer wird die 77 Mark
Pauschale berechnet. Sollte dies jedoch bereits geschehen sein, wird
der Betrag mit einer der n&auml;chsten Rechnungen gutgeschrieben.</P>

<P>F&uuml;r 6 Pfennig pro Minute rund um die Uhr &uuml;ber 01019 01929 im Internet 
surfen !!</P>

<P>Unabh&auml;ngig von dieser Entscheidung h&auml;lt MobilCom an dem Plan fest, das
Internet billiger zu machen. Ab sofort k&ouml;nnen alle Internet-Nutzer im 
Internet by Call -Verfahren &uuml;ber 01019 FREENET f&uuml;r nur 6 Pfennig pro 
Minute rund um die Uhr im Internet surfen. &quot;Mit der Tomorrow-Tarif 
FlatRate haben wir Neuland betreten und aus Gr&uuml;nden, die in keiner 
Weise vorhersehbar waren, negative Erfahrungen sammeln m&uuml;ssen&quot;, sagt
Gerhard Schmid - Vorstandsvorsitzender der MobilCom AG, &quot;mit unserem
neuen Angebot an die Internet-Community bringen wir zwar kein &Auml;qui-
valent auf den Markt, aber erm&ouml;glichen den Internet-Zugang zu einem
ungeheuer g&uuml;nstigen Preis.&quot;</P>

<P>(Quelle: <a href="mailto:service@01019freenet.de">service@01019freenet.de</a>)</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell04.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell06.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

