
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/aktuell.gif" BORDER="0" WIDTH="89" HEIGHT="35" ALT="Aktuell">
<h1>Diverse News</h1>
(was geschah die letzten zwei monate?)
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


<P></P>
<b>01.03.1999 - Erstes Font mit EURO Zeichen verf&uuml;gbar!</b><BR>

Johan Bj&ouml;rnson bietet jetzt auf seiner Homepage den ersten Fontsatz f&uuml;r 
den Amiga an, der auch das EURO-Zeichen beherrscht. Man kann es kostenlos von seiner WebSite.<BR>

 <a href="http://www.geocities.com/Hollywood/Hills/7937/fl-euro.html">http://www.geocities.com/Hollywood/Hills/7937/fl-euro.html</a>
<P></P>
<b>28.02.1999 - CDCat 3.0 f&uuml;r 30,- DM in der Amiga ARENA</b><BR>

DAS katalogisier Programm f&uuml;r den Amiga Classic! CD Cat Release 3 mit 
PPC Support ab sofort in der Amiga Arena zum Sonderpreis! Die Amiga 
Arena bietet allen Besuchern der Amiga Arena CDCat 3 f&uuml;r 30 DM an!<BR>
 
<a href="http://online-club.de/~ARENA/">http://online-club.de/~ARENA/</a>
<P></P>
<b>27.02.1999 - Amiga Inc. mit neuem Pr&auml;sidenten</b><BR>

Amiga Inc. hat nun angek&uuml;ndigt, da&szlig; Jim Collas nun Pr&auml;sident der Firmen 
Amiga Inc. und Amiga International wird. Petro Tyschtschenko bleibt weiterhin Gesch&auml;ftsf&uuml;hrer von Amiga International, und k&uuml;mmert sich um den
Verkauf und das Marketing. Grund f&uuml;r den Wechsel ist Gateway 2000, die 
derzeit mit der F&uuml;hrung des Unternehmens unzufrieden sind. Weiterhin gab
man bekannt, da&szlig; die Entwicklungsabteilung nun in San Diego ist und man
plane ein Entwicklersystem, eine Internet-Maschine, sowie ein Heimcomputer
(wie es einst der A500 war). Mehr Info`s sollen im Sommer preisgegeben 
werden. Jeff Schinlder bleibt ebenfalls im Amt, bei der Produktentwicklung.
<P></P>
<b>22.02.1999 - Neue Aktionen in der Amiga ARENA!</b><BR>

WHDLoad - Das Installer Tool WHDLoad mit weit &uuml;ber 100 Installern f&uuml;r
Classic Amiga Spiele jetzt in der Arena f&uuml;r 20DM!
<BR>

MT Rechnung III - Ab 01.03.1999 gibt es die Verwaltungs Software MT Rechnung III exclusiv in der Amiga Arena f&uuml;r 12 EURO !!<BR>
 
<a href="http://online-club.de/~ARENA/"">http://online-club.de/~ARENA/"</a>
<P></P>
<b>21.02.1999 - Schlu&szlig; mit dem 77,- DM Tomorrow-Tarif!</b><BR>

Der Verbraucherschutz hat MobilCom vorgeworfen, da&szlig; im Tomorrow-Tarif
gegen das allgemein geltende AGB-Gesetz (Allgemeine Gesch&auml;ftsbedingungen) 
versto&szlig;en wurde und der Tarif damit wettbewerbswidrig sei. Aus diesem
Grund bietet MobilCom ab sofort keinen Tomorrow-Tarif mehr an und k&uuml;ndigt
allen Kunden den Vertrag. Wer schon den 77,- DM Pauschalbetrag bezahlt hat,
bekommt das Geld gutgeschrieben - alle anderen brauchen ihn nicht zubezahlen.
<P></P>
<b>20.02.1999 - Amiga beim WDR - welch` goldene 5 Minuten...(haha)</b><BR>

Das war er also, der Fernsehauftritt von Amiga und Petro Tyschtschenko
im WDR. Leider waren die angek&uuml;ndigten 7 Minuten Sendezeit nicht ganz so
umfangreich, denn es waren nichteinmal 5 Minuten in denen die beiden 
Moderatoren sich einmal mit Petro &amp;uunl;ber die Zukunft des Amiga`s und
der gr&ouml;&szlig;e der Fangemeinde in Deutschland unterhielten und sich auch noch
mit zwei jahrelangen Amiga Fan`s ein Szene-Demo auf einem A4000/CybervisionPPC/200Mhz Rechner ansahen. Obwohl ich es etwas unfair fand, da&szlig; 
man das Gespr&auml;ch mit Petro etwas apruppt angebrochen hat und sich dem 
anderen Thema der restlichen Sendung widmete, war es gesamtgesehen schon
ein guter Auftritt. Was wir br&auml;uchten, ist aber immernoch eine Sendung 
die sich komplett auf den Amiga bezieht und seine St&auml;rken zeigt und 
reichhaltige Informationen enth&auml;lt, als immer nur kleine Ausschnitte.
<P></P>
<b>18.02.1999 - Naplam ist da!</b><BR>

Naplam ist nun endlich fertig und in K&uuml;rze auch im deutschen Versandhandel
erh&auml;ltlich. Wir k&ouml;nnen schon in der kommenden Ausgabe der Amiga Times 
allen Lesern einen Test zum Megaspiel von clickBOOM pr&auml;sentieren!!!
<P></P>
<b>Amiga / Petro Tyschtschenko im TV!</b><BR>

In genau zwei Tagen - am 20.02.1999 - ist es soweit. Der WDR wird in der
Sendung &quot;Computer Corner&quot;, die um 14:30 Uhr beginnt ein siebenmin&uuml;tiges
Interview senden, der genaue Inhalt ist von seiten`s Amiga International
nicht bekannt gegeben worden, sind wir also gespannt und programmieren 
wir unsere Videorecorder! Eine Wiederholung gibt es am 25 Februar um 
0:30 Uhr!

<b>SteuerProfi`98 jetzt erh&auml;ltich!</b>
Bei Stefan Ossowksi`s Schatztruhe kann man sich jetzt die neuste Version
des SteuerProfi`s bestellen. SteuerProfi`98 ent&auml;t nun auch alle neuen 
Gesetzesvorlagen und vieles mehr, mehr Info`s gibt es hier!
<P></P>
<b>16.02.1999 - Statement von A.C.T. zum Thema &quot;ARTAS nicht f&uuml;r Amiga?&quot;</b><BR>

Hier bei uns k&ouml;nnt Ihr das offizielle Statement von A.C.T. (Marc Albrecht) 
nachlesen! Wie uns Marc Albrecht mitteilte, ist er f&uuml;r ernsthafte Diskussionen offen und antwortet auf jede bez&uuml;gliche eMail.
<P></P>
<b>TaskForce in der Amiga Arena!!!</b><BR>

TaskForce Deutsche Version in der Amiga Arena Online bevor Aminet! Das 
Strategie und Taktikspiel TaskForce steht absofort zum Download in der 
Amiga Arena bereit! TaskForce ist Mailware und vergleichbar mit Spielen
wie Laser Squard oder Act Of War!<BR>
 <a href="http://online-club.de/~Arena">http://online-club.de/~Arena</a>
<P></P>
<b>12.02.1999 - Aminet 29 jetzt im Handel</b><BR>

Ab sofort koennen wieder alle Fans der Aminet CD Serie aufatmen, die neue
und somit schon neunundzwanzigste CD ist jetzt bei Stefan Ossowski`s Schatztruhe zu haben.
<BR>

Produktinformation<BR>

Die Aminet CD 29 - Februar 1999 - beinhaltet &uuml;ber ein Gigabyte (ungepackt)
an Software in Tausenden von Archiven. Seit der Aminet 28 CD sind mehr als
900 MB an Neuheiten hinzugekommen. Alle Programme sind Deutsch beschrieben;
viele verf&uuml;gen &uuml;ber eine deutsche Dokumentation. Als besonderes Highlight 
enth&auml;lt die Aminet 29 eine Vollversion von ArtEffect 1.5 inkl. einer g&uuml;nstigen Update- M&ouml;glichkeit auf die aktuelle Version!
<P></P>
<b>11.02.1999 - Vulcan nun endg&uuml;ltig vom Amiga weg!</b><BR>

Wie wir heute erfahren haben, hat Vulcan Software nun auch ihre Newsseite 
eingestellt und wird zuk&uuml;ftig auch Amiga Magazine nicht mehr mit News versorgen. Es ist ein weiterer Abschied vom Amiga. Ob die angek&uuml;ndigten Produkte,
Explorer2260 und Wasted Dreams, noch erscheinen, ist derzeit noch nicht zu
100% sicher. Auf jedenfall wird Vulcan Software nichts mehr in der Zukunft
f&uuml;r den Amiga produzieren und sich nur noch auf PC Artikel konzentrieren.
Diese Nachricht hat mich leider etwas entt&auml;uscht, zwar war uns allen schon
vor Wochen klar, da&szlig; Vulcan den Amiga verl&auml;&szlig;, jedoch hatte ich noch etwas 
Hoffnung, das wenigsten ein paar Titel noch erscheinen - dies sieht mir
allerdings nach dem erneuten Einstellen einer &quot;Serviceleistung&quot; von Vulcan
nicht mehr so aus. Nehmen wir es also hin und akzeptieren wir das Vulcan 
nicht mehr f&uuml;r den Amiga in irgendeiner Form aktiv arbeitet... es kommen 
auf jedenfall neue Firmen! So traurig, wie es sein mag:-(
<P></P>
<b>09.02.1999 - AAA Award f&uuml;r 1998</b><BR>

Und wieder werden die AAA Awards verliehen. Verliehen werden die Awards an 
Personen und bzw. oder Organisatoren, die 1998 aktiv etwas f&uuml;r den Amiga 
getan haben. Jeder kann an der Wahl teilnehmen, einfach nur auf der AAA 
Homepage das Formular ausf&uuml;llen und schon wird die Stimme gez&auml;hlt! <BR>

<a href="http://www.aaa-awards.org/suggest.html">www.aaa-awards.org/suggest.html</a>
<P></P>
<b>CyberAVI &amp; CyberQT</b><BR>

Im Aminet gibt es nun kostenlos die Quellcodes der Video- bzw. Multimediaplayer zum Download.
<P></P>
<b>Warp3d mit neuer Beta Version!</b><BR>

Auf der Haage &amp; Partner FTP Site bzw. in deren &quot;3d World&quot; kann man nun 
die Beta Version 2.0 (zur Permedia2 Unterst&uuml;tzung) von Warp3d kostenlos
downloaden!<BR>
 <a href="ftp://ftp.haage-partner.com:21/3dworld/warp3d">ftp://ftp.haage-partner.com:21/3dworld/warp3d</a>
<P></P>
<b>Imperium Terranum 3 - Space Wars</b><BR>

Teil 3 des Strategiespieles &quot;Imperuim Terranum&quot; wird demn&auml;chst erscheinen
und in den Grunds&auml;&auml;tzen dem zweiten Teil entsprechen, jedoch enth&auml;lt IT3 
viele neue Features und M&ouml;glichkeiten und wird somit sicherlich Fans der 
ersten beiden Teile, sowie Interessierten Usern gefallen. 
<P></P>
<b>Die Petition &uuml;ber die freie Auswahl des PPC Kernels wird noch einige
Zeit andauern.</b><BR>

Seit dem Erscheinen der PPC Hardware gibt es ja &quot;nur&quot; zwei Kernel`s zur 
Auswahl, da&szlig; w&auml;re einerseits die ppc.library und WarpOS. Leider ist dies 
f&uuml;r viele User ein Dorn im Auge. Die Meinung vieler Nutzer ist die, da&szlig; 
phase5 die ppc.library aus dem Flashroom der BlizzardPPC Karten entfernt 
werden soll und daf&uuml;r ins Libs-Verzeichnis soll. Derzeit haben schon &uuml;ber
450 User einen Antrag unterschrieben (siehe unten), der demn&auml;chst auch an
phase5 gesandt werden soll, damit diese die ppc.library aus dem Flashroom
nehmen und ins Libs: setzen. Weiterhin werden flei&szlig;ig Unterschriften ge-
sammelt und jeder User - ob nun PPC Karten Besitzer oder nicht - ist aufgefordert mitzumachen, schlie&szlig;lich w&auml;re das zuk&uuml;ftig ein gro&szlig;er Vorteil 
bei der Nutzung und Programmierung. Den Antrag unterzeichnen, sowie einige
Informationen dar&uuml;ber einholen, k&ouml;nnt Ihr unter folgender WebSite:<BR>
 
<a href="http://jagor.srce.hr/~doozanic">http://jagor.srce.hr/~doozanic</a>
<P></P>
Der englische Originalbrief, der an phase5 gesendet werden soll:
&quot;Mr. Wolf Dietrich, With this petition, the Amiga users ask Phase5 Digital
Products to move the ppc.library of the BlizzardPPC boards from the flashroom to the libs directory (as in the CyberstormPPC boards). This will not
disable ppc.library kernel in any way, but it will give the users the freedom to choose which PPC kernel to use. We all hope in a positive reply to 
this issue. Your Sincerely: (List of users)&quot;
<P></P>
<b>30.01.1999 - Imperium Terranum 2 zu gewinnen!</b><BR>

Die Amiga Arena verlost in zusammenarbeit mit VWP 5 Keyfiles f&uuml;r Imperium
Terranum 2. Ein Formular f&uuml;r das Gewinnspiel gibt es hier!
Die &quot;Aktion&quot; ist g&uuml;tig bis zum 01.04.1999! (Quelle: Olaf Koebnik)
<P></P>
<b>25.01.1999 - Das kann f&uuml;r Microsoft teuer werden:-)))</b><BR>

Geld zur&uuml;ck fuer ungewolltes Windows 98!<BR>

Wer mit seinem neuen Rechner im Komplettpaket auch ein vorinstalliertes
Windows kauft, das Microsoft-Betriebssystem aber nicht benutzen will, 
kann das Geld fuer die ungewollte Software moeglicherweise erstattet bekommen. Wie der Informationsdienst Register berichtet, hat der Australier 
Geoffrey Bennett in einem solchen Fall erstmals 110 australische Dollar
(ca. 119 DM) Rueckzahlung erstritten. Bennett hatte sich dabei auf den
Windows-Lizenzvertrag bezogen, in dem es heisst: &quot;Falls Sie den Bestimmungen dieses Lizenzvertrages nicht zustimmen, geben Sie bitte das unbenutzte Produkt unverzueglich gegen Rueckerstattung des Kaufpreises zurueck&quot;. Ein Sprecher vom Microsoft bestaetigte, da&szlig; diese Formulierung
moeglicherweise Bestandteil jedes Lizenzvertrages sei. Zu moeglichen 
Konsequenzen wollte Microsoft aber noch keine Stellungnahme abgeben. Auch
die grossen Computer-Hersteller Compaq, Vobis und Dell wollten sich bisher
nicht zu dem Problem aeu&szlig;ern. (Andreas Schauml&ouml;ffel)
<P></P>
<b>Amiga Arena Aktionen f&uuml;r 1999!</b><BR>

F&uuml;r dieses Jahr hat die Amiga Arena schon jetzt einige Sonderangebote in 
petto, so bekommt man das Spiel B&uuml;rgermeister II bis zum 31.03.99 f&uuml;r gerade mal 7,- DM. AlphaBase (Aktion g&uuml;ltig bis 28.02.99) und PrintManager
(g&uuml;ltig bis zum 01.04.99) kosten je 10,- DM. Mal sehn was uns im Verlauf
des Jahres noch f&uuml;r Schn&auml;ppchen in der Amiga Arena erwarten!?!<BR>

URL: <a href="http://online-club.de/~ARENA">http://online-club.de/~ARENA</a>
<P></P>
<b>Naplam in den Startl&ouml;chern</b><BR>

Vor kurzem wurde nun endlich die Master CD von Napalm fertiggestellt und
demn&auml;chst wird das Spiel ver&ouml;ffentlicht. Die entg&uuml;ltige Version enth&auml;t 20
Audio Tracks, die knapp 400 MB einnehmen, und dazu noch sch&ouml;nere Grafiken/
Explosionen gegen&uuml;ber dem Demo. Leider wird es kein Intro geben, f&uuml;r das 
w&auml;re auch gar kein Platz mehr, neben den Audiotracks und den 250 MB an 
Spieldaten. Wer das Spiel &uuml;bers Netzwerk spielt, hat nebenbei die M&ouml;glich-
keit zu chatten. Um Napalm zu zocken, wird ein AGA Amiga 020 mit 16 MB Ram,
2x CD und Festplatte ben&ouml;tigt. In den vollen Genu&szlig; kommt man allerdings
erst bei einem 060 Amiga mit Grafikkarte und mehr FAST-Ram. Eine PPC Ver-
sion ist derzeit noch nicht geplant.
<P></P>
<b>Neue Amiga Spezial mit CD &amp; Disk</b><BR>

Die neuste Ausgabe der Amiga Spezial beinhaltet die komplette Aminet CD22,
sowie die &uuml;bliche Coverdisk. Nach ihrer Jubil&auml;umsausgabe im letzten Jahr, 
ist sie somit eine weitere mit CD und Disk f&uuml;r gerade mal 9.90 DM. Die 
Aminet CD22 enth&auml;lt als Vollversion Wordworth 5SE.
<P></P>
<b>17.01.1999 - STFax v3.7 verf&uuml;gbar</b><BR>

Ein Demo des Faxprogramms STFax in der Version 3.7 kann man sich jetzt 
downloaden. Die Vollversion kostet 29.95 englische Pfund kann entweder 
bei Active Technologies (England) oder bei Haage &amp; Partner bezogen 
werden.
<P></P>
<b>Future Tales jetzt mit Ph&ouml;nix WebSite</b><BR>

Vor einigen Tagen ging die WebSite des Spieles &quot;Ph&ouml;nix&quot; online. Neben 
einigen Informationen, Screenshots und der Geschichte des Spieles findet 
man auch schon die Voraussetzungen vor. Ein Demo gibt es derzeit noch 
nicht, wenn es soweit ist werden wir Euch informieren. Und hier k&ouml;nnt 
Ihr Euch mal die Hardwareanforderungen anschauen und anfangen zu sparen
.... ob diese Konfigurationen auch f&uuml;r das endg&uuml;ltige Spiel n&ouml;tig sind 
(&Auml;nderungen gab es ja in der Vergangenheit schon oft genug) k&ouml;nnen wir 
Euch jedoch noch nicht sagen.
<P></P>
minimale Konfiguration:

<UL>
<LI>Amiga1200/4000 68040/40Mhz</LI>
<LI>8 MB FastRAM</LI>
<LI>4xCD-Laufwerk</LI>
<LI>Festplatte</LI>
<LI>Joystick/Maus/Tastatur</LI>
</UL>


empfohlene Konfiguration

<UL>
<LI>Amiga1200/4000 68060/50Mhz</LI>
<LI>Grafikkarte</LI>
<LI>16 MB FastRAM</LI>
<LI>8xCD-Laufwerk</LI>
<LI>Festplatte</LI>
<LI>Joystick/Maus/Tastatur</LI>
</UL>


beste Konfiguration

<UL>
<LI>Amiga1200/4000 PowerPC Prozessor</LI>
<LI>2D/3D-Grafikkarte</LI>
<LI>Soundkarte</LI>
<LI>16 MB FastRAM</LI>
<LI>8xCD-Laufwerk</LI>
<LI>Festplatte</LI>
</UL>


<P><b>07.01.1999 - Neue CD von Eric Gieseke</b><BR>

Jetzt gibt es eine neue Musik CD von Sidewinder Productions. 
&quot;2BadSheep&quot; hei&szlig;t die neue Scheibe und kostet 15$ US Dollar, wer 
einmal in ein paar Tracks reinh&ouml;ren will, kann sich von der Homepage ein paar MP3 Songs downloaden (Ausz&uuml;ge!). Das Album besteht 
aus Techno-Pop Songs und wurde mit Amiga und PC erstellt. &quot;Future
Shock2&quot;, welches &uuml;bringens komplett auf dem Amiga entstanden ist,
gibt es jetzt auch zum Sonderpreis!</P>
<P>
<b>BVisionPPC mit 8 MB f&uuml;r 339,- DM gibt es weiterhin!</b><BR>

Das super Angebot von Eternity Hard &amp; Software gilt weiterhin, 
wer also eine BVision PPC Grafikkarte mit 8 MB Ram f&uuml;r 339,- DM 
haben will, sollte das Bestellformular ausf&uuml;llen und angeben, da&szlig;
er durch die Amiga Times auf das Angebot aufmerksam geworden ist!!!!</P>

<P><b>04.01.1999 - W&auml;hlt Euer Spiel des Jahres</b><BR>

Jetzt k&ouml;nnt Ihr Eurer Lieblingsspiel des Jahres in die Top Ten der 
Amiga Flame w&auml;hlen. Auf der Web Seite der Amiga Flame kann man noch 
in den n&auml;chsten Tagen 1 Spiel ausw&auml;hlen und am 09.01.1999 wird dann 
das Ergebnis bekanntgegeben. </P>

<P><b>Mehr Info`s und Antworten von Hans Guijt zum Source Project</b><BR>

Nachdem wir ja schon von dem Amiga Community Source Project berichtet
hatten, hat nun Hans Guijt erneut eine Mail verfa&szlig;t, in der einige 
aufkommende Fragen, von Usern, beantwortet wurden und die auch nocheinmal einige zum Source Project preisgibt.</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell02.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

