
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/aktuell.gif" BORDER="0" WIDTH="89" HEIGHT="35" ALT="Aktuell">
<h1>Amiga mit neuem Pr&auml;sidenten,</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

<P>&quot;AMIGA k&uuml;ndigt neuen Pr&auml;sidenten und Entwicklungspl&auml;ne an</P>

<P>San Diego, Kalifornien.   26. Februar, 1999 - In San Diego, Kalifornien trafen
sich die Repr&auml;sentanten von AMIGA Inc. und AMIGA International. Sie erarbeiteten in einer eine Reihe von Konferenzen die Details von Technik,- Strategie-
und Marketingpl&auml;nen , um eine Produktreihe von neuen auf AMIGA basierenden 
Computern f&uuml;r das n&auml;chste Jahrtausend herauszubringen.</P> 

<P>AMIGA ist eine herausragende Gelegenheit, die jetzt ergriffen werden mu&szlig; oder 
sonst f&uuml;r immer verloren ist , sagte Collas. Der AMIGA ist ideal f&uuml;r Internetfertige, kundenorientierte digitale Applikationen der Zukunft. Amiga ist ein 
Name, mit dem die Welt Anwenderfreundlichkeit und ein beachtliches Preis- 
Leistungsverh&auml;ltnis assoziiert. Diese Philosophie werden wir in unserem New-
Generation-Konzept mit einbeziehen. Dies erm&ouml;glicht Produkte, von hand held 
Internet-Ger&auml;ten bis hin zu High-End-Grafik-Arbeitspl&auml;tzen, was den Anwendern
hilft, anstatt sie zu frustrieren. </P>

<P>Collas, ehemaliger Senior Vice President von Amiga s Mutterfirma Gateway, wird 
Amiga als eine komplett eigentst&auml;ndige Tochterfirma agieren lassen und Amiga, 
Inc. sowie Amiga, International, Inc. in die neue Amiga Firmenstruktur integrieren. Durch seine F&uuml;hrung wird es der Firma erm&ouml;glicht, ein kurzfristiges 
Entwicklungsprogramm auf die Beine zu stellen.</P>

<P>Amiga plant die weltweite Ver&ouml;ffentlichung von Next-Generation-Produkten vor 
Beginn des n&auml;chsten Jahres. Detaillierte Produktpl&auml;ne werden ver&ouml;ffentlicht und 
einige der strategischen Partner werden w&auml;hrend des n&auml;chsten Sommers 
bekanntgegeben. Geplant sind derzeitig zur Ver&ouml;ffentlichung ein Entwickler-System, 
eine Internet-Ger&auml;t und ein low-cost Heimcomputer in der Tradition des Amiga 500, 
der in den sp&auml;ten 80ern und fr&uuml;hen 90ern den Home-Computer-Markt dominierte. 
Das Entwickler-System wird mit einer Software-Development-Suite f&uuml;r low-cost-
Entwicklung auf der neuen Plattform erh&auml;ltlich sein.</P>

<P>Jeff Schindler, verantwortlich f&uuml;r die Produkt-Strategie bei Amiga, plant die neue 
Amiga-Produktpalette.  Die Amiga-Gemeinde hat unglaubliches auf einer Plattform 
geleistet, die seit acht Jahren kein offizielles Update erhalten hat , sagt Schindler. Sie verdienen ein System, da&szlig; es ihnen erm&ouml;glicht, ihre Talente voll auszusch&ouml;pfen.</P>

<P>Amigas Verwaltungssitz in San Diego wird in K&uuml;rze noch eine Software-Entwicklungsabteilung einrichten. Die Leitung hat Dr. Allan Havemose, Vize Pr&auml;sident von 
Engineering in San Jose, Kalifornien. Das Silicon Valley Team wird in den n&auml;chsten Monaten sehr schnell expandieren, um in Verbindung  mit dem Real-Time Neutrino Betriebssystem von QNX Software Systems Ltd. revolution&auml;re Amiga Multimedia
Software zu entwickeln.</P>

<P>Petro Tyschtschenko wird weiterhin als Gesch&auml;ftsf&uuml;hrer von AMIGA International,
Inc. t&auml;tig sein. Er wird eine entscheidende Rolle in der F&uuml;hrung der Amiga-
Gemeinde durch die &Uuml;bergangsphase zur neuen Amiga-Architektur innehaben.
Tyschtschenko sieht die neuen Pl&auml;ne als  Wiedergeburt des Amiga und als eine
aufregende Reise in die Zukunft .</P>

<P>F&uuml;r weitere Informationen &uuml;ber Amiga und Produkte von Amiga, schauen Sie bitte 
auf unsere Websiten: <BR>
<a href="http://www.amiga.de"">www.amiga.de"</a> (Quelle: AI &amp; AInc.)</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell05.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell07.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
