
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/aktuell.gif" BORDER="0" WIDTH="89" HEIGHT="35" ALT="Aktuell">
<h1>Offener Brief an die Amiga Gemeinde</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

<P>8 Februar 99 ein historischer Tag.<BR>

Er erinnerte mich etwas an die Atmosph&auml;re, als 1985 der erste Amiga der Welt&ouml;ffentlichkeit in New York vorgestellt wurde.</P>

<P>Diesmal wurde eine Vision geboren: Der Computer soll als ein vertrauter Teil
in den Alltag mit einbezogen werden.</P>

<P>Es ist nun fast 2 Jahre her, da&szlig; Gateway Amiga &uuml;bernommen hat. Viele kennen 
mich als ungeduldigen Menschen und k&ouml;nnen erahnen, wie schwierig die Zeit von
M&auml;rz `97 bis zum 8. Februar war. Eine Periode in der zu wenig mit der Amiga 
Gemeinde kommuniziert wurde, zu wenig &Ouml;ffentlichkeitsarbeit und zu wenig &uuml;ber
Visionen, Missionen und Zielsetzungen gesprochen wurde.</P>

<P>Aber liebe Amiganer, ich kann Euch nur versichern, da&szlig; dies sich in den n&auml;chsten 6 Monaten gewaltig &auml;ndern wird. Unter der technisch versierten Leitung 
eines absoluten Profis wird Amiga in die Zukunft gef&uuml;hrt. Jim Collas, Senior
Vice President Produkt Development &amp; Management von Gateway, Inc. hat sich 
entschlossen seine bisherige Position aufzugeben uns dich voll und ganz unserem
geliebten AMIGA zu widmen. Dabei werde ich an seiner Seite mit meiner ganzen 
Energie dazu beitragen, da&szlig; wir die gesetzten Ziele erreichen. Unsere Mission
ist: Es wird eine revolution&auml;re und starke Systemarchitektur und Arbeitsoberfl&auml;che f&uuml;r Multimedia Computer und digitalen Informationsanwendungen entwickelt,
die leicht in die Ger&auml;te von Endverbrauchern eingebaut werden k&ouml;nnen, was einen
innovativen Internet Service erm&ouml;glicht.

<P>Ohne den Mund zu voll zu nehmen, werden wir dieses Jahr Mitte November die 
Architektur und das Betriebsumfeld des neuen Amigas vorstellen k&ouml;nnen.</P>

<P>Wir werden bis dahin gemeinsam Pressekonferenzen abhalten, die die &Ouml;ffentlichkeit &uuml;ber unsere Zielsetzung unterrichten sollen. Neben dem neuen revolution&auml;ren Amiga Betriebssystem arbeiten wir selbstverst&auml;ndlich auch an der existierenden Plattform und werden den schon oft versprochenem Upgrade 3.5 von 
unserem derzeitigem Amiga Betriebssystem schnellstm&ouml;glich realisieren. Erste
Details k&ouml;nnen wir in St. Louis, USA, vorstellen und hoffen, die ersten Betriebssystem-Pakete 3.5 im Sommer dieses Jahres ausliefern zu k&ouml;nnen. Ich 
selbst werde mich um dieses Projekt k&uuml;mmern und gemeinsam mit Haage &amp; Partner
die Realisierung durchf&uuml;hren. AMIGA International, Inc und Amiga, Inc. werden
als geschlossenes Team unter der Leitung von Jim Collas die Computerwelt erobern. Und Sie, liebe Amiganer werden ein Teil davon sein. Helfen Sie mit unsere Ziele zu erreichen. Jim Collas wird sich in den n&auml;chsten Tagen mit einem
offiziellen Statement &uuml;ber die geplante Organisation, Vorgehensweise und Zielsetzung unseres Unternehmens an Sie wenden.</P>

<P>Es wir eine spannende Zeit, und es ist f&uuml;r mich und meine Mitarbeiter eine Ehre 
wieder einmal als Pionier f&uuml;r eine neue Computergeneration Wegbereiter sein zu 
d&uuml;rfen, so wie wir es damals bei Commodore waren.</P>

<P>Lang lebe unser geliebter Amiga und unsere Gemeinde.</P>

<P>Ihr Petro Tyschtschenko</P>

<P>02.03.1999</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="aktuell06.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="aktuell.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="werb01.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
