
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/edit.gif" BORDER="0" WIDTH="100" HEIGHT="35" ALT="Editorial">
<h1>Ein neues Jahr, ein neuer Amiga?</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

<P>Eine Frage, wie sie jedes Jahr von neuem gestellt wird und traurigerweise 
bekommt man nie eine Antwort. Wir haben nun schon das Jahr 1999 erreicht 
und wenn man bedenkt, da&szlig; es das vierte Jahr nach Commodore`s Pleite und
etlichen Wechseln ist, kann man einfach nur staunen, wie die Gemeinde zusammenh&auml;lt und sich einfach nicht kleinkriegen l&auml;&szlig;t. Ob wir in diesem Jahr
einen neuen Amiga bekommen, ist noch ungewi&szlig;. Zwar wird f&uuml;r Ende`99 eine 
neue &quot;Maschine&quot; angek&uuml;ndigt, doch ein Jahr kann schnell vergehen, ohne das
etwas zugunsten der User bzw. des Rechners passiert. Wir haben nocheinmal
mit Petro Tyschtschenko gesprochen, der - im Gegensatz zu uns - recht zuversichtlich ist.</P>

<P>Wer das WDR Interview (sage und schreibe etwas &uuml;ber 2 Minuten - in denen 
mir Petro wirklich leid tat, man hat ihn regelrecht abserviert und als er
am Ende des Interviews den Kopf senkte, war sicher auch dem letzten bewu&szlig;t,
da&szlig; auch er sich echt verarsxxt gef&uuml;hlt haben mu&szlig;), der wird wissen, da&szlig; 
sich die Medien nicht sonderlich f&uuml;r die R&uuml;ckkehr des einst beliebtesten
Homecomputers interessieren. Was wird uns in diesem Jahr noch alles er-
warten? Wo werden wir noch entt&auml;uscht, oder &uuml;berrascht? Alles Fragen, die
man einfach nicht beantworten kann und die wir uns auch noch in der n&auml;chsten Zeit stellen werden - leider.</P>

<P>Themawechsel! Der Winter ist fast vorbei, der M&auml;rz bricht voll rein und beschert haben uns die letzten beiden Monate viele Testmuster und auch viel
Gespr&auml;chsstoff - sogar soviel, da&szlig; wir nichteinmal alles vorstellen k&ouml;nnen
und einige Test`s verschieben m&uuml;ssen. Doch f&uuml;r diese Ausgabe haben wir uns
besondere Schmanker`l vorgenommen, so berichten wir Euch, wie gut das &quot;Logo
-Programm&quot; CandyFactoryPro ist, stellen Euch DOpus MagellanII vor und zeigen
Euch, wie gut man mit ScanQuix4 scannen kann. Neben einem Interview mit den
Programmierern von electronicTeacher5, dessen Produkt wir Euch auch in dieser
Ausgabe vorstellen, haben wir uns noch mit Leander von Kraft vom CCStudio
unterhalten. Besonders froh bin, das wir Euch auch schon einen Megatest zum 
Kn&uuml;ller von clickBOOM - Napalm - pr&auml;sentieren k&ouml;nnen!!! Olofight und der Fu&szlig;ballspa&szlig; Eat the Whistle haben wir ebenfalls angetestet. Alles in allem wieder
eine umfangreiche Ausgabe (nun schon die 10.), die Euch hoffentlich gef&auml;llt!</P>

<P>Etwas in eigener Sache zum Schlu&szlig;: Ab sofort wird die Amiga Guide Ausgabe der
Amiga Times in abgespeckter Version erscheinen, da&szlig; hei&szlig;t ohne Grafiken und 
ohne Soundmodul. Dies hat f&uuml;r Euch den Vorteil, da&szlig; sich der Download verk&uuml;rzt.
Eine Umfrage bei den Abonnenten der Guide Version ergab, da&szlig; dies auch im Sinne
dieser ist. Die Grafiken wird es auch nicht als Extra-Archiv geben, als wer unbedingt die Grafiken sehen/haben m&ouml;chte, sollte sich f&uuml;r die HTML Version entscheiden, die auch im Layout einen sehr netten Eindruck macht. Weiterhin werden
wir fortsetzten, was wir in den letzten Ausgaben bereits angefangen haben, damit
ist die Bewertung von Produkten gemeint. Absofort werden wir unsere Testergebnisse 
nicht mehr in Prozent angeben, sondern das Ergebnis besteht aus dem Fazit
und einem abschlie&szlig;endes Wort, wie Ihr es ja schon von Programmtest`s her kennt. 
Einen neuen Mailboxsupport haben wir auch erhalten und so k&ouml;nnt Ihr Euch die 
Amiga Times ab sofort auch aus den FORCE Mailbox (Sitz in Hamburg) runterladen -
n&auml;heres dazu im internen Teil! </P>

<P>Okay, und nun w&uuml;nsche ich im Namen der gesamten Amiga Times Redaktion Euch allen
viel Spa&szlig; bei unsere aktuelle Ausgabe,</P>

<P>Euer Mario</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="../index.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="../index.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="aktuell.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

