
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/game.gif" BORDER="0" WIDTH="106" HEIGHT="40" ALT="AT - Spieleteil">
<h1>Eat the Whistle</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>




<P>Eigentlich ist es ja traurig, unsere deutsche Nationalelf legt derzeit
ihre schlechteste &quot;Saison&quot; hin und ein Ende ist leider nicht in Sicht.
Was liegt da n&auml;her, als sich vor den Bildschirm zu setzten und allein 
daf&uuml;r zu sorgen, da&szlig; diese  wenigsten auf dem Computer wieder einmal 
Punkte machen. Eat the Whistle, eine neue Fu&szlig;ballsimulation, bringt uns
hier genau das Richtige f&uuml;r diese Zeit und das alles mit einer geh&ouml;rigen
Portion Humor!</P>

<P>Eat the Whistle (nachfolgend auch ETW) wird wahlweise auf Diskette oder
auf CD Rom ausgeliefert, wir hatten die CD Version als Testmuster, die 
durch gesprochene Samples - sprich Live-Kommentare- zu &uuml;berzeugen versucht. 
Das gerade mal 20 MB umfassende Spiel ben&ouml;tigt mindestens einen 68020 
Prozessor mit Kickstart 2.0, sowie dem AHI-Device. Unterst&uuml;tzt werden 
Grafikkarten, h&ouml;here Prozessoren, mehr Ram und auch Soundkarten. Eine 
Installation ist nicht n&ouml;tig!</P>

<P>Eingef&uuml;hrt wird ETW durch ein kleines Intro, da&szlig; eine Anreise eines Fu&szlig;ballteams zeigt und abwechslend entweder eine fl&uuml;chtende Mannschaft, ein
zerst&ouml;renden Fu&szlig;ball oder ein verschwindendes Stadion darstellt. &Uuml;ber die
Qualit&auml;t des Intro werde ich keine weiteren Worte verlieren, denn es ist
leider unter aller W&uuml;rde und gleicht Demo`s aus den tiefsten Zeiten des 
A500. Nach dem Demo kommt man sogleich ins Hauptmen&uuml; und kann dort das 
Spiel seiner Hardware anpassen. Neben der Spielsteuerung und dem Einstellen
der  Videoanzeige, kann man bei vorhandener Soundkarte noch f&uuml;r guten Tonsorgen. Ist alles so, wie man es gerne h&auml;tte, kann man schon beginnen. Entweder man sieht sich nochmal erspielte Highlights oder Ergebnisse an, bzw.
editiert die eigenen Teams, alles ist hier m&ouml;glich und auch speicherbar.
Leider sind einige Funktionen noch nicht nutzbar, und man wird nach dem 
Anklicken dieser auf eine bald erscheinende Version von ETW 98/99 verwiesen.</P>
</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/etw_arcade-teams.gif" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>Kick it!</b><BR>


<table width="75%"><td>
Hat man sich nun endlich zu einem Spiel hinrei&szlig;en lassen, kann man noch 4
Varianten ausw&auml;hlen. ARCADE, SIMULATION, KARRIERE (erst in ETW 98/99!) oder
TRAINING, dies sind die M&ouml;glichkeiten, die dem Spieler zur Verf&uuml;gung stehen.
Im ARCADE Modus ist alles ein wenig anders, denn hier steht neben dem Spiel
auch der Witz im Vordergrund, so kann man PowerUp`s einsammeln und wie &quot;die
schnellste Maus von Mexico&quot; &uuml;ber das Feld rasen oder f&uuml;r geballte Schu&szlig;kraft
sorgen. Neben einigen Bonuspunkten, kann man auch so spielen, das alle Fouls
ung&uuml;ltig sind und man einfach nur mit dem Joystick &quot;draufhalten&quot; braucht.
Hier kommt richtig freude auf und Erinnerungen werden wach, denn wer schon
einmal SpeedballII gespielt hat, der kann sich vorstellen, wie es im ARCADE
Modus von ETW zugeht. Geboten wird neben den Einzelspielen auch die Whistle
Tour und Turniere, und das alles mit den komischsten Mannschaften. Zur Aus-
wahl stehen unteranderem &quot;The Simmons&quot;, die irgendwie an die Simpsons erinnern, oder die &quot;Mortal Kontract&quot; - die ich schon von Mortal Kombat kenne. 
Alle Spielernamen wurden wie auch die Namen der Mannschaften abge&auml;ndert, 
jedoch wissen Fans genau wer zum Beispiel &quot;Mr. Sminters von den Simmons&quot; ist.
Schade ist allerdings, das wirklich nur die Namen etwas lustig klingen, ein 
Gaudi ganz besonderer Art w&auml;re es n&auml;mlich gewesen, wenn die Spieler auf dem 
Rasen auch eine gewisse &Auml;hnlichkeit vorgewiesen h&auml;tten, aber hier sieht man
nur Standardfiguren. Entscheidet man sich f&uuml;r eine SIMULATION, hat man die
Chance die Weltmeisterschaft von Frankreich`98 nachzuholen oder Pokal-, Liga-
sowie Freundschaftsspiele auszutragen. Im TRAINING kann jeder unerfahrene 
Spieler, seine F&auml;higkeiten im Elfmeterschie&szlig;en, oder bei Freist&ouml;&szlig;en erproben
und nat&uuml;rlich auch Trainingsspiele absolvieren. Abschlie&szlig;end dazu sollte erw&auml;hnt werden, da&szlig; man jegliche Namen von Spielern ge&auml;ndert hat (A. Koppeke 
statt A. K&ouml;pke), was zwar lustig ist, aber gerade in der SIMULATION h&auml;tte 
man meiner Ansicht nach darauf verzichten sollen.</P>
</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/etw_spiel-nah3.gif" BORDER="0" WIDTH="295" HEIGHT="243" ALT="bild"></DIV></P>
<P><b>Fairplay?</b><BR>


<table width="75%"><td>
Wie spielt sich nun Eat the Whistle? Die Computergegner sind nicht gerade die
St&auml;rksten, aber ab und zu hat man ganz sch&ouml;n zu k&auml;mpfen um &uuml;berhaupt mal ein 
Tor zu schie&szlig;en. Das Spiel tritt sich viel im Mittelfeld fest, oder die B&auml;lle
werden einfach von einer Seite auf die andere sinnlos hin&uuml;bergeschossen. Dazu
kommt, das man oftmals garnicht wei&szlig;, welcher Spieler nun den Ball angenommen
hat und welcher nicht. Aus diesem Grund sollte man von Spielen gegen den Computer Abstand halten und sich menschliche Spieler aussuchen. Im Zweispieler-
modus ist es etwas einfacher und vorallem lustiger. Kein Computer kann witzige
Dialoge zwischen zwei realen Spielern ersetzten, wenn man erstmal die Tore geschossen hat, und dann voller Jubel und Faszinierung weiterzockt. Das sind Erlebnisse die auch ETW &quot;unterst&uuml;tzt&quot; und hier liegen auch eindeutig die St&auml;rken
des Spieles. Mit Freunden die WM`98 Tag und Nacht durchzuspielen ist einfach
fantastisch, aber auch eine geh&ouml;rige Portion Geduld sollte jeder mitbringen,
denn leider konnte die Kollisionsabfrage nicht so ganz &uuml;berzeugen. Ein direktes
Abspiel von einem zum anderen Spieler funktioniert fast nie, der Ball rollt 
sehr oft vorbei und somit gingen guterspielte Torchancen nicht nur einmal ins 
Aus. Wer Sensible Soccer kennt, der wei&szlig;, wie gut man hervorragende Ergebnisse
erspielen kann, wenn die Spieler untereinandern auch gleich B&auml;lle annehmen die
sie vom N&auml;chstgelegenen bekommen. Bei ETW gibt es sowas leider nicht. Neben 
dem Abspiel ist auch die restliche Steuerung der Spieler nicht berauschend. 
Sie verlieren einfach so die B&auml;lle oder nehmen sie garnicht erst an, obwohl 
man sicher war, den Ball im Zweikampf errungen zu haben. Also die Steuerung ist
noch ein Manko des Spieles und sollte dringends &uuml;berarbeitet werden, da mann
nur durch viel &Uuml;bung Siege erzielt, es sei denn, man hat einen leichten Gegner. </P>
</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/etw_spiel3.gif" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>Der Rasen</b><BR>

<table width="75%"><td>
Der Rasen oder auch verst&auml;ndlicherweise &quot;die Grafik&quot; hebt sich von den bekan-
nten Spielen kaum ab. Insgesamt hat man sich an die 30 Platzverh&auml;ltnisse ein-
fallen lassen, so kann man im Schnee, oder bei na&szlig;em Rasen, sowie im vollem 
Gr&uuml;n spielen und vieles mehr. Bald soll man auch ausw&auml;hlen k&ouml;nnen, ob man am
Tag oder in der Nacht das Match austragen will. Die Spieler sind, wie man das
schon gar nicht mehr anders gew&ouml;hnt ist, wieder sehr klein gehalten. Dadurch 
sieht man zwar sehr viel vom Spielfeld, aber es zieht auch eine Un&uuml;bersicht-
lichkeit nach sich. Vergebens sucht man auch irgendwelche Zwischengrafiken, 
wenn man ein Tor erzielt oder man ein schweres Foul begeht, was f&uuml;r etwas Auf-
lockerung gesorgt h&auml;tte. Ein Tor wird nur durch einen grafischen &quot;Goal&quot;-Schrift-
zug hervorgehoben. Die sonstige Grafik, wie das Men&uuml; oder die Anzeige der Mann-
schaften und deren Spieler (versehen mit einer bestimmten Anzahl von Sternchen
haben, die zeigen wie stark der jeweilige Spieler ist) sind schlicht gehalten.
Schade das man gerade die Grafik immer etwas au&szlig;er acht l&auml;&szlig;t, hier m&uuml;sste man
sich wirklich mehr M&uuml;he geben.</P>

<P><b>Reporter vor Ort...</b><BR>

wo gibt es das schon, au&szlig;er im Fernsehen? Bei Amiga Spielen sicher nicht, doch
nun wird mit ETW hier ein Anfang gemacht. ETW bietet neben einer Ger&auml;uschkulisse,
die meist aus Bum-Bum Schl&auml;gen und schreienden Zuschauern besteht, auch einen
Live Reporter, der das gesamte Spiel kommentiert. Die (gesch&auml;tzterweise) 10 
unterschiedlichen Spr&uuml;che, die der Kommentator abgibt, machen das Spiel recht
lebendig, denn gute Sch&uuml;&szlig;e, wie auch schlechte Abspiele oder ein sinnloses rumlaufen der Spieler wird gnadenlos vom Reporter erw&auml;hnt. Das ist gerade bei den
ersten Spielen sehr am&uuml;sant und unterhaltsam, wenn man allerdings die gleiche 
Aussage zwei bis dreimal hintereinandern zu h&ouml;ren bekommt, kann es schon anfangen zu nerven, oder man h&ouml;rt einfach nicht mehr hin. Die Sprachqualit&auml;t ist
annhembar, jedoch klingt die Stimme ein wenig lustlos, so da&szlig; man keine euphorischen Jubelschreie vernehmen kann, wenn ein Tor f&auml;llt oder andersherum man mit
&auml;rgerlicher Stimme zu h&ouml;ren bekommt, wie schlecht man eigentlich spielt. Lobenswert ist diese neue Option aufjedenfall, aber man sollte sie eben noch ausbauen.</P>

<P><b>Sieg oder Niederlage?</b>
Ich pers&ouml;nlich w&uuml;rde eher auf ein Unentschieden tippen. Eat The Whistle ist zwar
erfrischend anders und bietet viel Witz und Abwechslung gegen&uuml;ber der bereits
exsistierenden Software, jedoch sind gerade die wichtigen Punkte die ein Fu&szlig;ballspiel ausmachen nicht gut umgesetzt worden. Gerade die Steuerung entt&auml;uscht total,
denn neben sinnlosen Abspielen, weil die Spieler nicht selbst&auml;ndig die B&auml;lle annehmen, verliert man etwas den &Uuml;berblick. Da das Programm allein entscheidet, 
welcher Spieler nun den Ball spielen kann, weil dieser am n&auml;chsten dran ist, oder
wer nicht, wird es oftmals frustrierend und der Joystick landet nicht nur einmal 
in der Ecke. Dazu kommen auch noch lange Ladezeiten vor jedem Spiel die unerkl&auml;rlich sind, denn auch wenn man bei einem langsamen CD Rom Laufwerk das Spiel auf
Festplatte kopiert, dauert es knapp 15 Sekunden bis man spielen kann. Wer neue 
und vorallem witzige Spiele mag und zudem auch noch ein paar Freunde hat, die 
sich f&uuml;r kein Fu&szlig;ballturnier zu schade sind, der wird sicher einige vergn&uuml;gliche
Stunden vor dem Bildschirm verbringen, ich jedoch ziehe weiterhin Sensible Soccer
allen anderen Fu&szlig;ballsimulationen vor!</P>

<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>
<P>Bezugsquelle:<BR>

Thomas Ferst Amiga Hard &amp; Soft <BR>

K&ouml;penicker Str. 11<BR>

15537 Gosen b. Berlin<BR>

Tel: 03362/820097<BR>

Fax: 03362/882988<BR>

eMail: <A HREF="mailto:ferst@t-online.de">ferst@t-online.de</A><BR>

telefonische Bestellung 18.00 - 21.00 Uhr</P>
</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="game01.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="game.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="game03.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

