
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/game.gif" BORDER="0" WIDTH="106" HEIGHT="40" ALT="AT - Spieleteil">
<P><IMG SRC="../pic/olofight_logo.jpg" BORDER="0" WIDTH="600" HEIGHT="210" ALT="Olofight"></P>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>





<P>Es ist wirklich zur Seltenheit geworden. Wann gab es das zuletzt, da&szlig;
ein Newcomer ein Spiel f&uuml;r den Amiga pr&auml;sentiert, welches eine 30 seitige gedruckte Anleitung (farbig) in 3 Sprachen enth&auml;lt! F&uuml;r viele Firmen
ist dies schon einfach zu teuer geworden, stattdessen gibt es nur ein
trostloses Onlineguide mit den wichtigsten Info`s, da&szlig; teilweise sogar
noch in irgendwelchen Unterverzeichnissen versteckt ist. 
Das 10 Disketten umfassende Spiel Olofight wird komplett auf die Festplatte installiert, wobei ca. 10 MB freier Festplattenspeicher erforderlich sind. Nach der Installation kann man Olofight auch sofortstarten. Bevor man aber seinen Feinden das F&uuml;rchten lehren kann, gibt
es noch einen Kopierschutz, der ein bestimmtes Wort, auf einer bestimmten Seite und in einer bestimmten Zeile verlangt. Dazu ben&ouml;tigt 
man also das Handbuch. Ist auch dies erledigt kann man seinen Namen, 
sowie die Nummer der Registrierungskarte eingeben. Danach erscheint
auch gleich das Hauptmen&uuml;. Hier kann man zwischen dem &quot;Story Mode&quot;, 
dem &quot;Survival Mode&quot;, einem &quot;Time Attakt Mode&quot;, dem &quot;Single Battle&quot;, 
wie auch dem &quot;vs. Battle&quot; w&auml;hlen.</P>

<P>Doch bevor ich zu den einzelnen Modi`s etwas sage, m&ouml;chte ich Euch kurz
die Geschichte zu Olofight erl&auml;utern. Ja auch Beat`em Up`s haben eine
Hintergrundgeschichte, die im Grunde zwar keinen interessieren, aber
f&uuml;r ein bestimmtes Flair sorgen. Auf 8 k&uuml;nstlichen Planeten leben die
letzten Nachkommen der Menschen. Nachdem sie die Erde verlie&szlig;en und auf
den Planet Kobaia umsiedelten, dauerte es nicht lange und dieser Planet
wurde durch jahrtausendlange Kriege fast in eine W&uuml;ste verwandelt. Also
beschlo&szlig;en die acht Rassen auch diesen Planten zu verlassen, um auf die
acht Planeten zu fl&uuml;chten die sie selbst geschaffen hatten. Jedoch waren
sie immernoch Feinde. Der ehemalige Anf&uuml;hrer des Planeten Karn, Thitan,
entdeckte, da&szlig; von Kobaia eine gewaltige Energie ausgeht und nun schlie&szlig;en
sich die acht Rassen doch zusammen um zu verhindern, da&szlig; Thitan sich diese
Energie zu nutze macht. Damit dies gelingt, gibt es insgesamt 8 (wie sollte
es auch anders sein - gibt es in Olofight &uuml;berhaupt eine wichtige Zahl,
die nicht die 8 ist?) mutige K&auml;mpfer, die aber nichts menschliches an sich
haben. Genau definieren lassen sich Axis, Arghos, Orks, Necter, Nubium,
Hamala, Tychor und Rauger leider nicht und es w&uuml;rde zu weit gehen, sie mit
irgendwelchen Tieren oder...&auml;h... Subjekten zuvergleichen weshalb ist es
auch gleich lasse. Alle warten mit jeweils 4 Special Moves auf, die meist
etwas mit Feuerschl&auml;gen oder Feuerb&auml;llen zu tun haben oder blitzartig den
K&auml;mpfer verschwinden und wieder auftauchen lassen.</P>
<P><DIV ALIGN="Center"><IMG SRC="../pic/olofight_p1.jpg" BORDER="0" WIDTH="320" HEIGHT="256" ALT="bild"></DIV></P>
<P><b>Die Modi</b><BR>

Im &quot;Story Mode&quot; spielt man praktisch die erz&auml;hlte Geschichte weiter, man
k&auml;mpft gegen alle Feinde und das in einer bestimmten (nicht ver&auml;nderbaren)
Zeitspanne. Der &quot;Survival Mode&quot; zeigt einem, wieviele Computergegner man
besiegen kann, bevor die Energie ausgeht, vernichtet man einen Feind, so
bekommt man als Preis eine kleine Menge an Energie dazu. Der &quot;Time Attak 
Mode&quot; ist ein normaler Kampf auf Zeit. &quot;Single Battle&quot; steht f&uuml;r einen 
einfachen Kampf gegen den Computer. Bei &quot;vs. Battle&quot; spielt man zu zweit
und kann sich mit Freunden gegenseitg spannende K&auml;mpfe bieten, jedoch 
gibt es kein Turniermodus, da&szlig; hei&szlig;t maximal zwei Spieler k&ouml;nnen teilnehmen und nach einem Kampf ist auch gleich wieder Schlu&szlig; und das Hauptmen&uuml; erwartet einen.</P>

<P><b>Gameplay</b><BR>

Das wohl allerwichtigste an einem Pr&uuml;gelspiel ist die Steuerung. Von ihr
h&auml;ngt ab, ob ein Spiel Top oder Flop ist. Aus diesem Grund gibt es oftmals
Firmen, die auf besondere Special-Moves oder grafische Leckerbissen verzichten, um sich mehr dem Gameplay zu witmen. W&auml;hrend unseres Testes, ging
schon erstmal kein Joystick kaputt oder flog gegen die Wand, was soviel
hei&szlig;en soll, da&szlig; man nach ein wenig &Uuml;bung schnell mit der Steuerung klar
kommt. Ab uns zu traten aber auch Zeitverz&ouml;gerungen auf, die ich mir nicht
erkl&auml;ren konnte, so k&ouml;nnte man annehmen, in Zeitlupe zu schlagen oder zu
springen. Woran das lag habe ich nicht rausbekommen. Im Einspielermodus
wird man einem Nervenzusammenbruch des &ouml;fteren sehr nah sein, hier ist
jedes Pr&uuml;gelspiel gleich, viel zu schwere Computergegner veranla&szlig;en auch
hartgesottene Spieler zum vorl&auml;ufigen Ende eines Kampfes. Olofight ist
hier keine Ausnahme, wenn man sich sicher ist seinen Feind besiegt zu haben,
kommt dieser noch mit einem Special-Move und man ist erledigt. Nach 5.-6.
Mal geht es einem doch sehr auf den Geist und wer keine Ausdauer hat wird
schnell zum Zweispielermodus umsteigen. Hier kann man sich richtig austoben
und alle Moves in Ruhe ausprobieren, Spr&uuml;nge, Salti und Tritte genaustens
studieren und dann im Zweikampf anwenden.</P>
<P><DIV ALIGN="Center"><IMG SRC="../pic/olofight_p2.jpg" BORDER="0" WIDTH="320" HEIGHT="256" ALT="bild"></DIV></P>
<P><b>Grafik &amp; Animation</b><BR>

Olofight ben&ouml;tigt einen AGA Amiga, jedoch gibt es keine Grafikkartenunterst&uuml;tzung, und pr&auml;sentiert sich in vollen 256 Farben. Die Animationen
w&auml;hrend des Intro`s sind toll geraten, jedoch sehr kurz. Im Spiel selbst,
bekommt man teils gute teils auch sehr pixelige Bilder zusehen. Der Hintergrund wurde ebenfalls animiert, so sieht man es funkeln oder irgendetwas
fliegt vorbei, wenn man also w&auml;hrend der K&auml;mpfe auch mal Zeit hat sich
den Background anzusehen, wird man keine &quot;toten&quot; Bilder vorfinden. Die 
Figuren wurden auch gut animiert, Spr&uuml;nge, Special-Moves, Schl&auml;ge, Tritte
und die Tatsache am Boden zu rutschen/kriechen hat man in Olofight in vern&uuml;nftiger Qualit&auml;t umgesetzt. Den h&auml;rtesten Konkurrenten Capital Punishment kann Olofight leider weder durch die Grafik oder die Animationen &uuml;berbieten. Aber alles in allem kann man zufrieden sein und bekommt als Spieler
grafisch gute Kost f&uuml;r sein Geld geboten!</P>

<P><b>Sound</b><BR>

Soundtechnisch zeigt sich Olofight von einer besten Seiten, neben melodischen
Tracks gibt es auch schnelle Rhytmen und abwechslungsreiche Musikkompositionen zu h&ouml;ren, die sich dem Geschehen anpassen. Die Ger&auml;uschkulisse ist dagegen von normaler Natur, dumpfe Schl&auml;ge, sowie Knalleffekte bei Special-
Moves sind eigentlich alles, was man da zu h&ouml;ren bekommt. Da die Musik aber
im Hintergrund l&auml;uft, macht sie dieses kleine Manko wieder weg.</P>

<P>Fazit:<BR>
 The Real Ologram haben ein gutes Beat`em Up als ihr Deb&uuml;tspiel
       auf den Markt gebracht. Man merkt schon das man sich hier sehr
       viel M&uuml;he gegeben hat und grafisch hat das Spiel auch einiges
       zu bieten, doch die Steuerung ist etwas hakelich und gew&ouml;hnungsbed&uuml;rftig. Allein leider unspielbar, es sei denn, man ist
       Profi bei Beat`em Up`s und zockt kaum andere Spiele. Doch f&uuml;r
       normale Spieler, die Pr&uuml;gelspiele nur so nebenbei auf dem Bildschirm laufen haben, ist es nicht gerade empfehlenswert. Zu 
       zweit kommt schon mehr zu stande und hei&szlig;e K&auml;mpfe um die Powerleiste des Gegners sind auch vorhanden, aber Olofight ist nicht
       der Knaller. Dem bisher ungeschlagenen Beat`em Up Capital Punishment kann Olofight leider nicht die Show stehlen, trotzdem ist es
       allen zum Kauf empfohlen, die sich an Capital Punishment satt
       gespielt haben oder eh Fan`s des Genre`s sind. <b><i>- Gut - </b></i></P>


<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn- "></DIV></P>
<P>Quelle:<BR>

The Real Ologram<BR>

di Fabrizio Stoduto<BR>

Via Epitaffio n&deg;100 P.co Nuovo Mondo<BR>

80014 Giugliano<BR>

Italy<BR>

eMial: <a href="mailto:ologram@ologram.com">ologram@ologram.com</a><BR>

URL: <a href="http://www.ologram.com">http://www.ologram.com</a></P>


</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="game03.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="game.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="rubrik.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
