
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/game.gif" BORDER="0" WIDTH="106" HEIGHT="40" ALT="AT - Spieleteil">
<h1>N A P  A L M</h1>
<H3>- Der Megatest! -</H3>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>





<P>&quot;clickBOOM wurde mit der Absicht gegr&uuml;ndet, die besten Spiele zu ver&ouml;ffentlichen!&quot;, dies sagte Alexander Petrovic, Gr&uuml;nder von clickBOOM, 1996 gegen&uuml;ber einer deutschen Amiga Zeitschrift. &Uuml;berheblich und doch trefflich, so 
kann man heute - 1999 - diese Worte einsch&auml;tzen! Wer h&auml;tte gedacht das click-
BOOM dieses Versprechen einhalten w&uuml;rde, sicherlich keiner. Doch man hat es
uns bewiesen, und das nun schon insgesamt 3 mal. Ob Capital Punishment, MYST
oder Quake, alle drei Produkte erhielten Preise und h&ouml;chste Wertungen und nun
versucht clickBOOM mit ihrem neusten Streich an diesen Erfolg anzukn&uuml;pfen.</P>

<P>Napalm ist, wenn man den Entwicklern glaubt, das beste Strategiespiel f&uuml;r den
Amiga. Bedenkt man, da&szlig; es seit Jahren keine atemberaubenden Spiele im Bereich
Strategie mehr gab, so kann es sowieso nur besser werden. Ausgeliefert wird 
Napalm auf einer CD-Rom, die knapp 180 MB an Daten enth&auml;lt, sowie 20 Audiotracks, die man auch auf einem normalen CDPlayer abspielen kann. Das dazugeh&ouml;rige CD-Booklet ist auch gleichzeitig das Handbuch, es definiert jede Ein-
heit und gibt Aufschlu&szlig; &uuml;ber spezielle Tastenkombinationen und enth&auml;lt ein 
paar Tips. Eine Installation ist notwendig, jedoch werden gerade mal 2 MB 
Speicher auf der Festplatte ben&ouml;tigt. Nach der Installation mu&szlig; man vor dem 
ersten Spielbeginn noch ein paar Einstellungen im Setup-Men&uuml; vornehmen. 
Festgelegt mu&szlig; werden: die Aufl&ouml;sung (Low, High), die Soundausgabe (Paula 
oder AHI), das CD Laufwerk und zuguterletzt auch noch die Netzwerkanbindung.
Derzeit wird nur ein Spiel &uuml;ber Nullmodem unterst&uuml;tzt, doch schon bald soll
man auch via IPX Network und TCP/IP Protocol spielen k&ouml;nnen. Zum Schlu&szlig; 
stellt man noch extern einen geeigneten Screenmode f&uuml;r Napalm ein, wobei 
auch Grafikkarten unterst&uuml;tzt werden und dringend empfohlen sind!</P>
</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/napalm_titel.jpg" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>Der Krieg kann beginnen!</b></P>

<Table width="75%"><td>
<P>Nach dem Doppelklick auf das Napalm-Icon bekommt der Spieler neben den 
Logo`s der Entwickler und dem Titelbild noch einen Schriftzug mit dem 
Namen des Spieles zu sehen, ein animiertes Intro gibt es leider nicht. 
Darauf hat man anscheinend zugunsten der Musik verzichtet. Das Hauptmen&uuml;
empf&auml;ngt einen, mit gerade mal 4 Optionen: Campaign (Spiel starten), Load
(laden), Network (via Netzwerk spielen) und Quit (Ende). Voller ungeduld 
wird sofort ein neues Spiel gestartet, doch bevor es endlich in die Schlacht geht, kann man noch entscheiden ob man die Kontrolle &uuml;ber die Guten
(Menschen) oder die B&ouml;sen (Roboter) &uuml;bernehmen m&ouml;chte. Die erste Wahl fiel
auf die Guten. Die UEDF - United Earth Defense Forces trotzt mit insgesamt
50 unterschiedlichen Einheiten, die von einer kleinen Infantrie bis zum 
&quot;Napalm Strike&quot; (totale Zerst&ouml;rungsbombe!) alles zu bieten hat. Um fair zu
bleiben, hat auch die &quot;Robot Forces&quot; 50 verschiedene Einheiten, die ebenfalls kein Pardon kennen und vom Flammenwerfer bis hin zur &quot;Nuke Missle&quot;
(einmal genutzt, schon liebgewonnen!) alles in petto haben. Der Bildschirm
von Napalm ist in drei Bereiche unterteilt worden, da gibt es einerseits 
oben links eine Uhr, rechts au&szlig;en die Kontrollleiste und das Schlachtfeld,
welches den restlichen Platz einnimmt. Die Kontrollleiste beinhaltet neben
dem Logo des Teams (was bei einem vorhandenen Radar zu einer kleinen Karte 
wird) und der Creditanzeige, auch die jeweiligen Geb&auml;ude und deren Produktionen. Zur Einf&uuml;hrung in die Steuerung und der Umgebung gibt es die ersten
beiden Mission. Doch wenn man denkt hier erstmal ruhig das Gel&auml;nde zu durchqueren, ist dies total falsch. Die ersten Feinde lassen nicht lange auf sich
warten und die K&auml;mpfe (wenn auch nur in sehr kleiner Form) k&ouml;nnen beginnen. 
In Mission 2 soll man schon anfangen Geb&auml;ude zu zerst&ouml;ren, doch wer etwas
schlauer ist, l&auml;&szlig;t einfach einen Ingenieur das feindliche Geb&auml;ude besetzten
und schon ist der Sieg errungen. Ab Mission 3 ist aber schon strategisches 
Vorgehen erforderlich, das Hauptgeb&auml;ude gilt es zu sch&uuml;tzen und neue Geb&auml;ude,
wie Produktionsanlagen, Stromversorgungen oder Radare zu errichten. An das 
n&ouml;tige Kleingeld kommt man durch den Abbau von &Ouml;l, hierzu stehen dem Spieler
Transporter zur Verf&uuml;gung, die sich &uuml;ber einer &Ouml;lquelle zu F&ouml;rdert&uuml;rmen ausbauen. In einer Raffinerie kann man dann das gewonne &Ouml;l zu Geld machen. 
Positiv ist, da&szlig; die &Ouml;lquelle (zumindest beim Test) unersch&ouml;pflich ist und 
man sich um die Credit`s keine Sorgen zu machen braucht. Die Missionen sind 
sehr unterschiedlich, manchmal erreicht man nur durch eine totale Vernichtung
aller feindlichen Einheiten das n&auml;chste Level, oder man bekommt direkte Aufgaben zugewiesen, wie zum Beispiel die Zerst&ouml;rung bestimmter Geb&auml;ude (Mission
4 = Beseitigung des gegnerischen Radar`s). Bei Napalm hat man sich auf kein 
bestimmtes Gel&auml;nde geeinigt, so da&szlig; man in W&auml;ldern, in der W&uuml;ste oder aber 
auch auf eisigen Landschaften seine Mannschaft zum Einsatz schickt. Endlich 
hat man auch einmal die Umgebung ins Geschehen mit einbezogen, so kann man 
B&auml;ume als Unterschlupf nutzen (was die Feinde gerne tun und dann aus dem 
Hinterhalt angreifen und man garnicht gleich erkennt, von wo die Sch&uuml;sse 
eigentlich kamen), durch Canyon`s fahren, sich hinter Bergen verstecken oder 
Einheiten dort sammeln lassen. Das macht das Spiel doch etwas realistischer.</P>
</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/napalm_bild01.jpg" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>&quot;Commander, wo sollen wir hin?&quot;</b></P>

<table width="75%"><td>
<P>Die Steuerung der Einheiten ist sicher das wichtigste, gehorchen die eigenen
Truppen den Anweisungen nicht mehr, ist die Schlacht schon von anfang an verloren. clickBOOM hat sich hier sicherlich an einigen PC Spielen orientiert, 
so findet man schon eine gewisse &Auml;hnlichkeit vor. Durch ein einfaches klicken
mit der linken Maustaste auf eine Einheit oder ein Geb&auml;ude, erh&auml;lt man die 
Kontrolle dar&uuml;ber. Der Mauspfeil wird fortan zu einem kleinen Pfadenkreuz, 
wenn dieser gr&uuml;n blinkt, kann man seine Einheiten in Bewegung setzten. F&auml;hrt
man mit dem Mauszeiger &uuml;ber einen Feind, so wird dieser rot und man kann durch
ein normales klicken einen Angriff in die Wege leiten. Endlich gibt es auch 
die M&ouml;glichkeit Aktionen auf mehrere Einheiten zugleich auszu&uuml;ben. Man kann
n&auml;mlich ein gro&szlig;es (oder kleines, je nach Anzahl der Einheiten) Fenster &uuml;ber
die vorhandenen Truppen ziehen, l&auml;&szlig;t man dieses danach los, so werden alle Einheiten, die sich in diesem Fenster befinden, aktiviert. Das ist schon sehr vorteilhaft, wer sich noch an Dune2 erinnert, wird wissen, wie unhandlich es war
jedes Fahrzeug einzeln zu steueren. Bis zu 18 Einheiten kann man mit einem Mal
auf diese Art und Weise &quot;Befehle zukommen lassen&quot;. Die Steuerung ist sehr einfach, jedoch erscheint es manchmal unlogisch, welche (Um-)Wege die Truppen einschlagen, um an das gew&uuml;nschte Ziel zu kommen. Weiterhin fiel uns im Test negativ auf, da&szlig; ab und zu die Einheiten nach einem Mausklick nicht aktiviert werden,
so da&szlig; man mehrere Versuche starten mu&szlig;. Das ist insbesondere &auml;rgerlich, wenn 
man z.B.: einem Panzer eine Kampanweisung gegeben hat, danach die Fu&szlig;truppen 
plazieren m&ouml;chte, diese aber nicht auf den Mausklick reagieren, daf&uuml;r aber der 
Panzer seine Position verl&auml;&szlig;t. Sieht man von diesem kleinen Bug mal ab, so ist 
es doch erstaunlich, wie selbst&auml;ndig und felxibel die Einheiten sind. Sie greifen
automatisch Feinde an, was sehr n&uuml;tzlich ist wenn man nicht mitbekommt das sich 
der Gegner n&auml;hert. Ist ein Feind in die ewigen Jagdgr&uuml;nde geschickt worden, so 
greifen die Truppen von allein den n&auml;chsten Gegner an, der sich in unmittelbarer
N&auml;he befindet. Das ist vorallem gut, wenn man circa 15 Einheiten ein Geb&auml;ude vernichten l&auml;&szlig;t - kein Schwindel, man ben&ouml;tigt recht viele Einheiten um ein Geb&auml;ude
zu zerst&ouml;ren. Das liegt daran, da&szlig; der Gegner die Geb&auml;ude andauernd reparieren
l&auml;&szlig;t und nur wenn an die 6-7 Raketen und unz&auml;hlige Panzersch&uuml;&szlig;e gleichzeitig ihr
Ziel treffen, ist die Geb&auml;udeeinheit des Gegners in k&uuml;rzester Zeit geschlagen - 
und nach dessen Zerst&ouml;rung sich sofort dem N&auml;chsten witmen. Hier wird dem Spieler
etwas unter die Arme gegriffen, was sich auf das Spielgesehen positiv auswirkt.</P>

<P>Um Produktionen auszuf&uuml;hren, reicht es schon, wenn man auf das jeweilige Geb&auml;ude 
klickt und danach das Produkt ausw&auml;hlt. Die Steuerung ist also weder neu, noch 
gro&szlig;artig &uuml;berarbeitet worden, doch im Sinne des  Spieles hat man sie gut umgesetzt. Was bringt es einem schon, wenn in brenzlichen Situationen erst mehrere 
Mausklicks zum Ziel f&uuml;hren - hier ist Schnelligkeit gefragt. Gro&szlig;es Manko ist 
aber - wie auch im Demo - das Scrolling! Obwohl man die Geschwindigkeit des 
Scrollens einstellen kann, bzw. entscheiden kann ob automatisch gescrollt werden
soll, sobald der Mauspfeil den Bildschirmrand erreicht oder nicht, rukelt es einfach viel zu sehr und ist auch zu langsam. Das automatische Scrollen ist aufjedenfall anzuraten, damit ein einigerma&szlig;en schneller Spielflu&szlig; gegeben ist.</P>

</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/napalm_bild02.jpg" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>Grafische Umsetzung</b></P>

<Table width="75%"><td>
<P>Wenn man die besten Spiele ver&ouml;ffentlichen will, mu&szlig; alles stimmen und dazu geh&ouml;rt auch die Grafik. clickBOOM beschert uns hier eine Spielgrafik in einer isometrischen Ansicht, wie man es von &quot;UFO-Enemy Unknown&quot; kennt. Geb&auml;ude und Einheiten sieht man nicht aus der Vogelsperspektive, sondern eben im ISO-Stil. 
Diese Ansicht wird  unterlegt durch auftauchenden Flugzeuge die Fallschirmspringer &quot;abwerfen&quot;, Raumschiffen, die vernichtende Strahlen aussenden, &quot;farbenfrohen&quot; Explosionen, qualmenden Fabriken und einem tollen Umgebungsdesign. Vernichtet man ein Geb&auml;ude, so zerfliegt es in viele Einzelteile, die leider auch 
die eigenen Einheiten vernichten k&ouml;nnen, aber grafisch gesehen, ist es einfach 
nur fantastisch dargestellt. B&auml;ume, Schluchten, Felsen, Br&uuml;cken, zerfallene 
H&auml;user und Klippen, an die die Wellen nur so ranschlagen (leider nicht animiert)
werden uns ebenfalls geboten. Um das alles aber in vern&uuml;nftiger Qualit&auml;t genie&szlig;en
zu k&ouml;nnen, sollte man schon eine Grafikkarte besitzen und das Spiel bei einer 
Aufl&ouml;sung von 640x480 Pixeln laufen lassen. Wer keine Grafikkarte besitzt, wird 
die eben genannte Aufl&ouml;sung nur in Zeitlupentempo spielen k&ouml;nnen und gezwungenderma&szlig;en auf die 320x240 Variante umsteigen. Diese ist schnell, aber auch sehr grobpixelig und da sich das Sichtfeld (=Schlachtfeld) auch verkleinert, wird Napalm 
dadruch un&uuml;bersichtlich. Bei einer 640x480 Aufl&ouml;sung bekommt man volle 256 Farben
Screens (bei 320x240 &uuml;brigens auch) zu sehen und man k&ouml;nnte denken, ein PC-Spiel
gleichen Genre`s vor sich zu haben, d.h. es gibt kaum einen Unterschied. Hier kann
sich clickBOOM selbst auf die Schulter klopfen, bei Napalm wurde ganze (grafische)
Arbeit geleistet, die es vorher in keinem Stratgiespiel gab! Einzig und allein die
Fu&szlig;truppen scheinen etwas zu pixelig zu sein. </P>

</td></table>

<P><DIV ALIGN="Center"><IMG SRC="../pic/napalm_bild03.jpg" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<P><b>Flotte M&auml;rsche sind hier fehl am Platz,</b></P>


<table width="75%"><td>
<P>d&uuml;stere und st&uuml;rmische Musik erwartet den Spieler stattdessen und die kann wirklich gefallen. 20 Audiotracks gibt es in Napalm, doch leider hat man es noch nicht
hinbekommen, diese auch richtig ins Spiel einzubauen. Die n&ouml;tige AHI Unterst&uuml;tzung
fehlt derzeit und so gibt es nur &uuml;ber den Paula-Chip &quot;Musik&quot;, die sich jedoch auf
Ger&auml;usche und Sprachsamples beschr&auml;nkt. Somit gibt es weder w&auml;hrend des Titelbildes,
noch im Hauptmen&uuml; irgendwelche Musik zu h&ouml;ren. Im Spiel selbst, findet man nur 
Schu&szlig;ger&auml;usche, Explosionen, Schreie oder Kommandos vor. Dadurch wird es im Bezug 
auf die musikalische Untermalung recht langweilig. Da Napalm w&auml;hrend einer laufenden
Mission aber nicht nachl&auml;dt und somit die CD nicht im Laufwerk verlangt, kann man 
sich die Musikst&uuml;cke (50 Minuten Spieldauer) auch in einem normalen CDPlayer anh&ouml;ren!
Bleibt nur zu hoffen, da&szlig; schnellstens die AHI Unterst&uuml;tzung erscheint, damit man 
sich die Musik auch &uuml;ber den Computer zu Gem&uuml;te f&uuml;hren kann und sie somit etwas Missionsbezogener wird.</P>


<P><b>Die Hardware</b></P>

<P>Ausschlaggebend f&uuml;r den ganzen Spa&szlig; ist aber die Hardware. Ein bischen Power mu&szlig; 
man unter Haube haben, ansonsten wird das Vergn&uuml;gen nur von kurzer Dauer sein. Das
Spiel l&auml;uft zwar, laut clickBOOM, ab einem AGA Amiga mit 68020, 16 MB Ram, HD und 
CD Laufwerk, doch ist ein 68030 Prozessor (060 empfohlen!), wie auch 32 MB Ram und 
eine Grafikkarte w&auml;rmstens anzuraten. Eine spezielle Version f&uuml;r PPC Besitzer wird 
es nicht geben!</P>


<P>Fazit:<BR>
 clickBOOM hat es wiedereinmal geschafft und Strategiefan`s erhalten endlich
       einen w&uuml;rdigen Dune 2 Nachfolger! Vergesst die neidischen Blicke auf PC-
       Spiele wie Command &amp; Conquer oder WarCraft, jetzt gibt es NAPALM! Tolle 
       Explosionen, umfangreiche Missionen, Unmengen von den verschiedensten Einheiten und Missionen, selbstdenkende Truppen (die auch ohne Aufforderung die
       Basis verteidigen und k&auml;mpfen) und die d&uuml;stere bis st&uuml;rmische Musik machen es
       einem wirklich schwer, den Computer wieder auszuschalten! Auch wenn es noch
       kleine Bugs gibt und die Netzwerk- und Soundunterst&uuml;tzung unvollst&auml;ndig ist,
       so kann man NAPALM trotzalledem schon fast als Droge bezeichnen, von der man
       einfach nicht mehr loskommt. Dieses Spiel ist fantastisch und kann eigentlich
       nur eine Wertung erhalten: Sehr Gut!!! und bekommt dazu noch den </P>
<IMG SRC="../pic/award.gif" BORDER="0" WIDTH="111" HEIGHT="111" ALT="Award">

<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>
<P>Quelle:<BR>


PXL Computers<BR>

box 969<BR>

31 Adelaide ST. East<BR>

Toronto M5C 2K3, Ontario<BR>

Canada</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="game02.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="game.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="game04.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

