
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/ar.gif" BORDER="0" WIDTH="196" HEIGHT="40" ALT="Amiga Revolution">
<h1>Abteilung Linux</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


<P>Beschreibung des Linux Bereiches der Amiga-Revolution</P>

<P>Leitung: Markus Blau = Muffinjoe (<a href="mailto:markusb@hprc.tandem.com">markusb@hprc.tandem.com</a>)</P>

<P>Der Bereich Linux der Amiga Revolution besch&auml;ftigt sich mit der Publizierung von 
Linux. Insbesondere geht es um die Vorteile gegen&uuml;ber anderen Betriebssystemen, 
die Darstellung weiterer Anwendersoftware unter Linux, sowie ein Linuxsupport 
bei der Konfiguration und Installation unter Linux durch HOWTO Pages und einem 
mail-Support.</P>
<P>Mittlerweile ist Linux auf fast allen Systemplattformen vorhanden: PC, PowerMac 
und zu unseren besonderen Freude: f&uuml;r den Amiga. Diese Liste wird mit Sicherheit 
in der Zukunft weiter fortgesetzt werden. Das Linux-Segment auf dem 
Softwaremarkt ist eines der am st&auml;rksten expandierende &uuml;berhaupt. Gr&uuml;nde hierf&uuml;r 
liegen nahe: Zum einen ist es ein Freewaresystem, da&szlig; hei&szlig;t es gibt keine 
Copyrights auf das System. Zwar gibt es Firmen, die das Linux-System mit einer 
enormen Anzahl zus&auml;tzlicher Programme vermarkten (z.B. SuSE, es wird desweiteren 
auf das SuSE-Packet eingegangen, da ich dieses benutze), aber auch hier gibt es 
keine Copyrights von Seiten der H&auml;ndler. Theoretisch l&auml;&szlig;t sich Linux komplett 
umsonst aus dem Internet beziehen (ausgenommen Provider + Telefonkosten). Dies 
gibt es bei keinem anderen Betriebssystem. Der zweite Hauptgrund f&uuml;r die rasante 
Entwicklung ist der, da&szlig; Linux von unz&auml;hligen Universit&auml;ten, Softwareentwickler 
und Hackern auf der ganzen Welt st&auml;ndig weiterentwickelt wird. </P>
<P>Linux ist ein komplettes UNIX-Betriebssystem. Trotzdem zeigt es eine enorme 
Kompatibilit&auml;t zu allen sonstigen Betriebssystemen bzw. allgemeine Standards. So 
lassen sich z.B. DOS-, WIN95-, AMIGA- Partionen problemlos unter Linux 
integrieren, auf welche dann gelesen, wie auch geschrieben werden kann. 
Desweiteren kann Linux die verschiedensten Systeme emulieren. 
Dies sind einige der Hauptgr&uuml;nde, weswegen wir Linux als unser BASISSYSTEM der 
AMIGA REVOLUTION festgelegt haben. </P>
<P>Linux beinhaltet volle Internetkompatibilit&auml;t mit den Standards, wie z.B. PPP, 
SLIP, dynamic IP routing, TCP/IP usw..Es ist daher keine gro&szlig;e H?rde, &uuml;ber Linux 
ins Internet zu kommen, &uuml;ber welchen Provider auch immer. &quot;Office-working&quot; (z.B. 
Text-, Tabellen-, Grafikverarbeitung) ist auch kein Problem. Besonders 
nenneswert ist das Office Paket STAROFFICE von Star Division. Auch dieses 
komplette Officepacket, welches Spitzenwerte erhielt, ist f&uuml;r Linux &uuml;ber das 
Internet kostenlos, sonst f&uuml;r ca 30 DM, erh&auml;ltlich bzw. wird gelegentlich auf 
Computer Mags (z.B. Chip 6/98) kostenlos angeboten.</P>  
<P>Netscape, der wohl beste Browser (inclusiv E-mail-Support) wird ebenfalls f&uuml;r 
Linux angeboten. Auch dieser ist ebenfalls kostenlos.</P>
<P>S&auml;mtliche Drucker, ISDN-Karten und Modems, Grafikkarten, Soundkarten, 
Festplatten, Mainboards werden von Linux unterst&uuml;tzt.</P>
<P>Ein Nachteil von Linux l&auml;&szlig;t sich nicht vorenhalten. Es ist nicht so 
benutzerfreundlich. Jedoch wird dies durch z.B. SuSE und dem KDE-Team immer 
weiter verbessert. So l&auml;&szlig;t sich die gesamte Hardware und auch die wichtigsten 
Systemeinstellungen &uuml;ber ein SuSE-Menu namens YAST (Yet Another Setup Tool) in 
das System besonders leicht integrieren. Das KDE- Desktop Environment, welches 
nun endlich als Endversion vorliegt,  zeichnet sich durch seine enorme 
Benutzerfreundlichkeit aus. </P>
<P>Desweiteren erh&auml;lt man durch Erwerb des Linux-Packetes beispielsweilse von SuSE 
ein 60 Tage Installationssupport.</P>
<P>Zu weiteren Subvention werden wir von der AMIGA REVOLTON eine Subventionsecke 
auf unserer Homepage einrichten, in welcher sich HOWTO Pages f&uuml;r verschiedenen 
Konfigurationen unter Linux befinden, sowie ein weiterer 
Subventions-e-mail-support.</P>

<P>Gemeinsam werden wir unsere Ziele verwirklichen!!!!!!</P>

<P>Markus Blau = Muffinjoe</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="rubrik04.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="rubrik.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="rubrik06.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
