
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/soft.gif" BORDER="0" WIDTH="103" HEIGHT="35" ALT="Software">
<h1>DOpus 5.8 Magellan II</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

<P>DOpus ist f&uuml;r viele User schon lange ein Begriff, hat sich doch dieses
Programm zu einem ernstzunehmenden Workbenchersatz gemausert. Doch ich
pers&ouml;nlich habe DOpus nie benutzt, ich hatte mal ein Demo von einem User
bekommen, aber es hat mich nie gereitzt, es auszuprobieren. Grund daf&uuml;r
war... das ich vor 1&frac12; Jahren die Workbench noch f&uuml;r unersetzbar hielt und
alle Funktionen die ich damals ben&ouml;tigte, integriert waren. Doch das hat
sich ge&auml;ndert, schlie&szlig;lich wird die Arbeit mit dem Amiga nicht leichter,
wenn man mehrere Programme gleichzeitig nutzt und dann noch umst&auml;ndlich
diverse Funktionen &uuml;ber die Workbench t&auml;tigen mu&szlig;. DOpus Magellan II hat
mich jetzt aber soweit gebracht, da&szlig; ich es als Workbenchersatz nutze und
aus diesem Grund mu&szlig; ich gleich eines sagen. Es ist das erste mal, da&szlig; 
ich DOpus richtig nutze und somit kann es schon vorkommen, da&szlig; ich Funktionen 
f&uuml;r fantastisch halte, die allerdings schon seit mindestens zwei
Versionen Standard sind. Deshalb sollten alle, die DOpus Magellan oder 
DOpus 5.5x besitzen die folgenden Abs&auml;tze &uuml;berspringen und sich unten die
neuen Feature`s durchlesen, die DOpus Magellan II bietet! Nat&uuml;rlich k&ouml;nnt
und sollt Ihr weiterlesen, aber wer vieles schon kennt, den wird es nicht
besonders interessieren, oder? DOpus war fr&uuml;her eigentlich nur ein Dateimanager,
 doch das blieb nur kurzzeitig so. Mit der Zeit bekam dieses Programm 
 Funktionen, die ein schnelleres Arbeiten mit der Workbench erm&ouml;glichten.</P>

<P>Nachdem ich die CD ins Laufwerk legte und mich f&uuml;r eine komplette 
Installation entschied, dauerte es ein paar Minuten bis das Programm
auf die Festplatte kopiert wurde. Zum Schlu&szlig; stellte ich noch ein, da&szlig;
ich DOpus als Workbenchersatz nutzen m&ouml;chte und nach einem Reboot startete
DOpus auch ohne Probleme zumachen. Wer fr&uuml;her nur die Standard WB nutzte und
kaum Tools laufen lies, die auf das Layout der WB einflu&szlig; nahmen, so wird
sich auf den ersten Blick f&uuml;r diese User kaum etwas ge&auml;ndert haben. Einzig
und allein, der Lister an der rechten Bildschirmseite, verr&auml;t, da&szlig; sich ein
paar &quot;&Auml;nderungen&quot; breitgemacht haben. Als erstes hatte ich in den Einstellungen das Men&uuml; &quot;Umgebung&quot; geladen, dort kann man nun Hintergr&uuml;nde, Schriften,
Sounds, Farbepaletten, Pfade, Piktogramme und vieles vieles mehr &auml;ndern.
Theoretisch ist dies, das gesamte Prefs-Verzeichnis der Workbench in einem
Menu zusammengefa&szlig;t. Aber wie gesagt nur theoretisch, denn die Funktionen
verbergen noch einiges mehr, so kann man Sounds einstellen, wenn ein Window
ge&ouml;ffnet oder geschlossen wird, Hintergrundbilder bestimmen, eine Knopfbank
festlegen, wie man es beim PC (Windows 9x Startmen&uuml; am unteren Bildschirmrand) kennt. Doch das ist nicht alles, DOpus Magellan 2 erm&ouml;glicht dem User
eine Vielzahl von Einstellungen, so da&szlig; man dieses Programm seinen w&uuml;nschen
komplett anpassen kann. Eine sehr gute Idee sind die erw&auml;hnten Knopfb&auml;nke,
hat man sich so ein Men&uuml; editiert, kann man es nutzen um Tools, Programme,
Spiele und anderes &uuml;ber ein bis zwei Mausklicks zu starten. Verzeichnisse
kann man sich in 3 verschiedenen Varianten anzeigen lassen, entweder nur 
als Text, was es einem erm&ouml;glicht LHA Archive sofort zu entpacken, als Piktogramm oder als PiktogrammPlus. Bei der Variante PiktogrammPlus, bekommt man
an der oberen Seite der Schublade  noch eine Statuszeile, die einem anzeigt,
wieviel Dateien/Verzeichnisse in dieser vorhanden sind. DOpus Magellan 2
bietet ungeahnte M&ouml;glichkeiten und verbirgt sehr viele gute Funktionen, die
den t&auml;glichen Einsatz von Amiga und Software sehr vereinfachen und im Zusammenhang mit Tools die Workbench mehr als ersetzt. Bis es eine neue Version
unseres Betriebssystemes gibt, ist DOpus Magellan 2 die beste L&ouml;sung!
</P>

<P>Die Features von DOpus Magellan II: </P>

Verbesserte Funktionalit&auml;t der Dateilister einschlie&szlig;lich:
          <UL>
<LI>Verwendung von Proportionalen Schriften </LI>
<LI>          Gr&ouml;&szlig;enver&auml;nderbare Felder </LI>
<LI>          Indikator zur Anzeige des aktuellen Sortiermodus </LI>
<LI>          Verbessertes Inline-Editing </LI>
</UL>


Verbessertes OpusFTP-Modul einschlie&szlig;lich: 
         <UL>
<LI> Komplett neu gestaltete grafische Benutzeroberfl&auml;che </LI>
<LI>          Individuelle Einstellm&ouml;glichkeiten f&uuml;r jede FTP Site </LI>
<LI>          Erweitertes Drag&amp;Drop erm&ouml;glicht FTP-Shortcuts </LI>
<LI>          Rekursives Kopieren von Verzeichnissen </LI>
<LI>          Erweiterte Unterst&uuml;tzung f&uuml;r Opus Kommandos </LI>
<LI>          Vollst&auml;ndige Unterst&uuml;tzung von Protection Bits </LI>
<LI>          Neue Skript Dateien </LI>
<LI>          Automatischer Neuaufbau der Verbindung </LI>
<LI>          Verbesserte Site-to-Site M&ouml;glichkeiten </LI>
<LI>          Optionale Anzeigen f&uuml;r &Uuml;bertragungsstatus </LI>
<LI>          Unterst&uuml;tzung f&uuml;r Firewalls und IP-Masking </LI>
<LI>          Pfadgadget der Lister unterst&uuml;tzen jetzt URL Syntax </LI>
<LI>          Inline-Editing f&uuml;r Dateinamen und Schutzbits </LI>
<LI>          Synchrone Kommandostruktur f&uuml;r interaktive ARexx Skripte </LI>
<LI>          Verbesserte Geschwindigkeit und Unterst&uuml;tzung aller Amiga TCP </LI>
<LI>          Stacks </LI>
<LI>          Spezielle Popup-Men&uuml;s f&uuml;r FTP Lister </LI>
</UL>


<UL>
<LI> Themes - konfigurieren Sie Ihr System mit Ihren bevorzugten Grafiken,T&ouml;nen und Schriften </LI>
<LI> Neues intuitives Layout der Einstellungsrequester </LI>
<LI> Hintergrundbilder in Knopfb&auml;nken und Startmen&uuml;s </LI>
<LI> Zufallsgesteuerte Hintergr&uuml;nde </LI>
<LI> Umri&szlig;- und Schattenschriften auf der Arbeitsoberfl&auml;che </LI>
<LI> Vollst&auml;ndig konfigurierbare Bildschirm Titelleiste mit vielen Optionen </LI>
<LI> Frei konfigurierbare Sound Ereignisse, z.B. beim Einlegen einer Diskette </LI>
<LI> Einstellm&ouml;glichkeit f&uuml;r Opus-interne Suchpfade </LI>
<LI> Unterst&uuml;tzung von langen Filenamen bis 107 Buchstaben </LI>
<LI> Neues grafisches Layout und bessere Konfigurierbarkeit von Knopfb&auml;nken </LI>
<LI> &Uuml;berarbeitete interne Kommandos, viele davon sind nun extern ersetzbar </LI>
<LI> Erweitertes Skriptsystem mit verbesserter Anbindung an interne Kommandos und OPusFTP </LI>
<LI> Verbesserte Multilevel-Startmen&uuml;s </LI>
<LI> Die Filetypenerkennung wurde um neue Funktionen erweitert </LI>
<LI> Neue und erweiterte Popup Men&uuml;s </LI>
<LI> Stark erweiterte Piktogramm sowie Drag&amp;Drop Funktionalit&auml;t </LI>
<LI> Zahlreiche neue ARexx Befehle </LI>
</UL>


<P>Fazit:<BR>
 DOpus Magellan II, samt DOpus Plus CD, ist ein tolles Programm,
       welches einem das Arbeiten wirklich erleichtert. Die M&ouml;glichkeit
       ein Windows&auml;hnliches Startmen&uuml; zu erzeugen, sorgt f&uuml;r schnelleres
       Arbeiten und ist optisch auch nicht schlecht. Doch das ist nur ein
       kleines Beispiel, von dem was DOpus Magellan II kann. Der Preis
       von 99,- DM (ohne DOpus Plus CD) bzw. 59,- ist absolut gerechtfertigt. Ich kann Dopus nur jedem User empfehlen, es ist bisher die
       beste Alternative zur derzeitigen Workbenchversion. Weitere WB-
       Ersatzprogramme, wie zum Beispiel Scalos, erreichen zwar noch nicht
       die gleiche oder noch mehr Leistung als DOpus, k&ouml;nnen aber sicher
       bald mithalten. Bis es soweit ist (wenn &uuml;berhaupt), wird DOpus
       seinen Nutzen erf&uuml;llen. Ich bin der Meinung, da&szlig; ein solch tolles
       Programm einen Amiga Times Award verdient hat, und diesen bekommt
       es auch. <i><b>- Empfehlenswert - </i></b> <u> Amiga Times Award </u></P>


<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>
<P>Quelle:<BR>

Stefan Ossowskis Schatztruhe Gesellschaft f&uuml;r Software mbH<BR>

Veronikastr. 33 - 45131 Essen - Germany<BR>

Phone: ++49-201-788778  Fax ++49-201-798447<BR>

EMail:<a href="mailto:stefano@schatztruhe.de">stefano@schatztruhe.de</a><BR>
 <a href="http://www.schatztruhe.de/">http://www.schatztruhe.de/</a></P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft01.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft03.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
