
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/soft.gif" BORDER="0" WIDTH="103" HEIGHT="35" ALT="Software">
<h1>eTeacher5</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


<P>Ein Programm nimmt sich unser an - auf dem Weg unsere Fremdsprachen-
kenntnisse aufzufrischen und zu erweitern.</P>

<P>eTeacher wurde vom polnischen Autor Chris Jonko in Zusammenarbeit mit
der Firma W.F.M.H. entwickelt. Diese haben auch den weltweiten Vertrieb
&uuml;bernommen.</P>

<P>Das mir vorliegende Programmpaket in der Version 5.2 ist f&uuml;r das Lernen
der englischen Sprache ausgelegt und kommt in einer Hardcover-Verpackung
daher, welche die Programm-CD sowie ein kurzes Handbuch enth&auml;lt.</P>

<P>Ein erster Blick in das Handbuch informiert uns &uuml;ber einige grundlegende 
Dinge, wie:</P>

 <UL>
<LI> Systemanforderungen</LI>
<LI>  Programminstallation</LI>
<LI>  Support und Kundenbetreuung</LI>
<LI>  und nat&uuml;rlich auch die Bedienung des Programms selber.</LI>
</UL>



<P>Die Programm-CD nutzt vorbildlicherweise auch den Platz, den dieses Medium
bietet, und ist mit 642 MByte gut gef&uuml;llt. Nach einem Dopelklick auf das 
Laufwerks-Icon sehen wir im Verzeichnis-Fenster vier Schubladen: Install,
Readme, Support und Help.</P>
<P>README ist wohl selbsterkl&auml;rend und enth&auml;lt ein paar Begr&uuml;&szlig;ungsworte der 
Autoren in allen verf&uuml;gbaren Sprachen, so nat&uuml;rlich auch in deutsch. Dort
erfahren wir auch, da&szlig; eTeacher sich als Elektronischer Lehrer zum Fremd-
sprachenlernen versteht.</P>
<P>Die Schublade SUPPORT beinhaltet die kompletten Installationspakete der 
Grafikkartentreiber CyperGraphX V3 und Picasso96 V1.4, dem Soundkarten-
treiber AHI V4 sowie dem SoundPlayer Play16.</P>
<P>Die Schublade HELP beinhaltet u.a. das Grammatik-W&ouml;rterbuch f&uuml;r Englisch
in deutscher Ausf&uuml;hrung.</P>

<P>Doch so viel zur Einf&uuml;hrung, kommen wir nun zu den Fakten.
Als Systemvoraussetzungen geben die Entwickler von W.F.M.H. drei Stufen an:</P>

<UL>
<LI>AmigaOS 2.0 auf einem 68000 Prozessor mit 4 MB Ram als Mindest konfiguration</LI>
<LI>AmigaOS 3.x mit 68030 Prozessor und 6 MB Ram als Ausstattung f&uuml;r vern&uuml;nftiges Arbeiten</LI>
<LI>sowie AmigaOS 3.x mit 68040 Prozessor, 8 MB Ram, Grafikkarte (CGFX-oder P96) und Soundkarte mit AHI v4+ Unterst&uuml;tzung als optimale Ausstattung</LI>
</UL>


<P>Ein CDRom-Laufwerk und eine Festplatte werden nat&uuml;rlich als Standard 
vorausgesetzt.</P>

<P>Bei meinem Testrechner handelt es sich um einen - in einen infinitivII-
Tower eingebauten - A1200 mit OS 3.1 sowie Blizzard-Turbokarte (PPC 603e/
240 Mhz und 68040/25 Mhz sowie 64 MB FastRam) und BVisionPPC-Grafikkarte.</P>
</td></table>
<P><DIV ALIGN="Center"><IMG SRC="../pic/bearbeiten.gif" BORDER="0" WIDTH="640" HEIGHT="384" ALT=""></DIV></P>
<table width="75%"><td>
<P>Die Installation von eTeacher geht mittels des beigef&uuml;gten Installer-
Skriptes einfach und schnell vonstatten. Man w&auml;hlt sich ein Verzeichnis 
auf der Festplatte, in dem die eTeacher-Schublade angelegt werden soll. 
Dorthin werden nur die notwendigsten Dateien wie das Hauptprogramm, einige
Libraries und Sprachdateien mit insgesamt knapp 1,2 MByte Daten kopiert.
Ein erfreulicher Umstand, wenn man die Install-Orgien mit bis zu &uuml;ber 100
MByte von vergleichbaren PC-Programmen bedenkt. Besonders erfreulich ist,
da&szlig; selbst Fonts und Libraries in der eigentlichen Programmschublade landen
und nicht - wie allgemein &uuml;blich - in den entsprechenden Verzeichnissen auf
der SYS-Partition. Damit l&auml;&szlig;t sich eTeacher bei Bedarf auch ganz einfach und
vollst&auml;ndig wieder von der Festplatte entfernen.</P>

<P>Da&szlig; es soweit kommt, wollen wir aber nicht hoffen - es sei denn, man hat 
mittels eTeacher seine Englischkenntnisse so weit verfeinert, da&szlig; man auf
das Programm &uuml;berhaupt nicht mehr angewiesen ist. :-)</P>

<P>Beim erstmaligen Start von eTeacher erlaubt uns das Programm, den gew&uuml;nschten 
Bildschirmmodus einzustellen. Dort lassen sich alle im aktuellen Amiga-System
verf&uuml;gbaren Screenmodi (einschlie&szlig;lich AGA und Grafikkarte) ausw&auml;hlen.</P>

<P>Das Programm an sich ist vollkommen systemkonform programmiert und h&auml;lt sich
an den Amiga-Styleguide. Einzig die in den Programmfenstern verwendeten 
Schalter sind nicht in der &uuml;blichen Text-Beschriftung gehalten, sondern 
werden als Grafik-Gadgets dargestellt. Ist aber h&uuml;bsch anzusehen und trotz-
dem funktionell.</P>

<P>Das eTeacher-Programmpaket beinhaltet neben mehr als 200 vorbereiteten 
&Uuml;bungen auch mehr als 1200 Illustrationen (Bilder, jeweils in 16 und 256
Farben) und &uuml;ber 3 Stunden Sprachausgabe.</P>

<P>S&auml;mtliche Programmfunktionen werden &uuml;ber das Men&uuml; aufgerufen. Dieses unter-
gliedert sich in die Men&uuml;punkte Datei, Grammatik, Wortschatz, Tests, 
Optionen, Hilfe und Sch&uuml;ler.</P>
</td></table>
<P><DIV ALIGN="Center"><IMG SRC="../pic/et_test1.gif" BORDER="0" WIDTH="640" HEIGHT="384" ALT="bild"></DIV></P>
<Table width="75%"><td>
<P>Mit den vorhandenen &Uuml;bungen kann das vorhandene Wissen zum Wortschatz und/
oder zur Grammatik getestet werden. Die erzielten Ergebnisse werden f&uuml;r 
jeden Sch&uuml;ler in einer Statistik-Datei gespeichert. Dort wird der Prozent-
satz der richtig beantworteten Fragen, die erzielte Note das Datum und die
ben&ouml;tigte Zeit vermerkt.</P>

<P>Die &Uuml;bungen k&ouml;nnen aber auch &quot;nur&quot; zum Lernen benutzt werden, hierbei
entf&auml;llt die Benotung sowie die Messung der ben&ouml;tigten Zeit.</P>

<P>Diese vorhandenen &Uuml;bungen lassen sich &uuml;ber die ersten vier Men&uuml;punkte 
(Datei, Grammatik, Wortschatz und Tests) auf verschiedene Arten aufrufen.
Entweder man sucht sich zuerst das gew&uuml;nschte Thema (Men&uuml;punkte Grammatik
und Wortschatz) und w&auml;hlt dann aus, ob man die betreffende &Uuml;bung zum 
Lernen oder zur Durchf&uuml;hrung eines Tests benutzen m&ouml;chte oder man kann
sich &uuml;ber den Men&uuml;punkt Datei zuerst entscheiden, ob man lernen oder 
einen Test bestehen m&ouml;chte und w&auml;hlt anschlie&szlig;end das gew&uuml;nschte Thema.</P>

<P>Alternativ dazu k&ouml;nnen die Tests aus den drei Kategorien leicht, mittel
und schwer ausgew&auml;hlt werden.</P>

<P>Egal ob man sich f&uuml;r eine &Uuml;bung oder einen Test entscheidet, das ent-
sprechende Programmfenster pr&auml;sentiert sich sehr &uuml;bersichtlich. Man be-
kommt je nach &Uuml;bungstyp eine englische oder deutsche Redewendung bzw. 
ein einzelnes Wort serviert und soll diese(s) in die jeweils andere 
Sprache &uuml;bersetzen. Bei den sogenannten Bildauswahltests gibt eTeacher
ein Motiv vor, wozu man aus f&uuml;nf vorgegebenen englischen W&ouml;rtern das 
richtige ausw&auml;hlen soll. Diese &Uuml;bungen geh&ouml;ren sicherlich zur leich-
testen Sorte.</P>

<P>Jede beantwortete Frage wird durch eTeacher mit einem Kommentar be-
dacht (z.B. h&ouml;hnisches Gel&auml;chter bei falscher Antwort, Beifall bei 
richtiger Antwort). Den Wortlaut der richtigen Antwort gibt eTeacher
anschlie&szlig;end nochmal in feinstem Englisch aus.</P>

<P>Richtig ans Eingemachte geht es dann bei den Grammatiktests. So bietet
eTeacher u.a. &Uuml;bungsaufgaben zu allen m&ouml;glichen Zeitformen an. Wer hier
mehr als 75% der Aufgaben richtig beantwortet, kann sich sicherlich 
seiner schon sehr fortgeschrittenen Englisch-Kenntnisse r&uuml;hmen.</P>

<P>Auf dem Weg dahin ist sicherlich auch das Grammatik-Lehrbuch eine sehr 
gro&szlig;e Hilfe. Es l&auml;&szlig;t sich entweder direkt aus den &Uuml;bungsfenstern oder
&uuml;ber den Men&uuml;punkt Hilfe im Hauptmen&uuml; aufrufen. Es bietet zu allen 
grammatikalischen Besonderheiten der englischen Sprache sehr gute Er-
kl&auml;rungen und viele Beispiele.</P>

<P>In der &Uuml;bungsphase ist sicherlich auch die &quot;Vorsagen&quot;-Funktion von 
eTeacher eine nicht zu untersch&auml;tzende Hilfestellung. Damit l&auml;&szlig;t sich
die richtige Antwort bereits vorab einmal einsehen. Ob die danach dann 
richtig beantwortete Frage allerdings noch als richtig gewertet wird,
ist von den Programmeinstellungen abh&auml;ngig.</P>
</td></table>
<P><DIV ALIGN="Center"><IMG SRC="../pic/et_test2.gif" BORDER="0" WIDTH="640" HEIGHT="384" ALT="bild"></DIV></P>
<Table width="75%"><td>
<P>Alle User, die die von eTeacher mitgelieferten &Uuml;bungen bereits erfolg-
reich absolviert haben (was sicherlich einige Zeit dauern wird), haben
die M&ouml;glichkeit, die mitgelieferten &Uuml;bungen zu erweitern und auch kom-
plett neue zu erstellen.</P>

<P>Der hierf&uuml;r notwendige Editor ist komplett in das Hauptprogramm inte-
griert. Damit lassen sich neue Fragen oder zu &uuml;bersetzende W&ouml;rter/Rede-
wendungen hinzuf&uuml;gen, bis zu f&uuml;nf Antworten (wovon mindestens eine 
richtig sein mu&szlig;) angeben sowie die Aufgabestellung formulieren und 
einiges mehr. Dieses Kapitel ist aber vorwiegend den fortgeschrittenen
Usern zu empfehlen, weshalb ich hier nicht n&auml;her darauf eingehen m&ouml;chte.</P>

<P>&Uuml;ber den Men&uuml;punkt Optionen lassen sich alle m&ouml;glichen Programmeinstel-
lungen vornehmen. Hier k&ouml;nnen u.a. die gew&uuml;nschte Programmsprache 
(deutsch oder englisch), ein Pa&szlig;wortschutz f&uuml;r die Programmeinstel-
lungen, Verzeichnisse f&uuml;r den Datenexport, verschiedene Lernoptionen,
die Soundausgabe (intern, externer Player, per Datatype bzw. AHI oder
keine), die Grafikausgabe (Bildschirmmodus sowie Festlegung einer der
sehr sehenswerten Landschaftsaufnahmen als Hintergrundbild) sowie die
Kommentare f&uuml;r Lob und Tadel einstellen.</P>

<P>Besonders interessant hierbei ist, da&szlig; alle Einstellungen in den Tool-
types des Programm-Icons gespeichert werden. Dadurch lassen sich auf 
Wunsch bestimmte Einstellungen auch &auml;ndern, ohne eTeacher &uuml;berhaupt 
gestartet zu haben.</P>

<P>Zu allen Programmfenstern ist auch ein kontext-sensitives Handbuch im 
AmigaGuide-Format abrufbar. Damit lassen evtl. bestehende Fragen zur 
Programmbedienung ganz leicht beantworten.</P>

<P><b>Fazit:</b><BR>

eTeacher ist bereits in der ersten ver&ouml;ffentlichten Version ein sehr 
ausgereiftes Programm. Es deckt so ziemlich alle Facetten ab, die man
sich beim Erlernen einer Fremdsprache vorstellen kann. Lediglich f&uuml;r
absolute Neulinge der englischen Sprache m&uuml;&szlig;ten die Wortschatz&uuml;bungen
wohl noch umfangreicher sein. eTeacher ist (auch aufgrund seiner sehr
umfangreichen multimedialen Ausstattung) wohl einzigartig im Bereich 
der Lernprogramme auf dem Amiga. Bei eTeacher handelt es sich also um
ein rundum gelungenes Produkt, da&szlig; sicherlich eine gro&szlig;e Bereicherung
der kommerziellen Amiga-Software darstellt. Mein Fazit lautet daher:
SEHR EMPFEHLENSWERT.</P>

<i> </i>
<P><DIV ALIGN="Right"><I>-ab-</I></DIV></P>
</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft02.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft04.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

