
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/soft.gif" BORDER="0" WIDTH="103" HEIGHT="35" ALT="Software">
<h1>ScanQuix 4</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>


<P>Scannen ist beliebter den je, gerade wer im Bereich &quot;Internet&quot; t&auml;tig ist 
bzw. sein m&ouml;chte, kommt um das Scannen kaum herum. Was ein Scanner ist 
oder was bei einem Scanvorgang passiert, brauche ich sicher keinem n&auml;her
erl&auml;utern - das ist hinl&auml;nglich bekannt. Doch der beste Scanner n&uuml;tzt 
einem nichts, wenn die Software ihn nur mittelm&auml;&szlig;ig unterst&uuml;tzt. Beim PC
ist dies kein Problem, hier liegt jedem Scanner das n&ouml;tige Programm bei,
doch der Amiga h&auml;lt nur wenige alternativen bereit. Im Aminet gibt es da
zum Beispiel ScanTek (Shareware), BetaScan, ScanCenter oder CyberScan.
Wir haben uns jedoch das komerzielle Produkt &quot;ScanQuix&quot; angesehen, da&szlig;
derzeit in der Version 4.0 erh&auml;ltlich ist. Ausgeliefert wird ScanQuix
(folgend mit SQ abgek&uuml;rtzt) auf einer einzigen Diskette, die die n&ouml;tigen
Treiber, sowie das Programm enth&auml;lt und eine gedruckte Anleitung. Wichtig
ist aber, da&szlig; SQ f&uuml;r verschiedene Scanner ausgelegt ist, so da&szlig; man sich
je nach Scanner f&uuml;r eine bestimmte Version entscheiden mu&szlig;. Zu kaufen gibt
es SQ f&uuml;r Mustek Paragon, Epson, Canon und HP Scanner. Unser Test wurde mit
einem Mustek Paragon 1200SP durchgef&uuml;hrt. Das programm ansich vrlangt einen
Amiga ab OS3.0 mit Festplatte und mindestens 6 MB Ram!</P>

<P>Scannen - sofort und unkompliziert!<BR>

Vor dem Start von SQ, mu&szlig; man sich den Scannerprefs witmen. Hier wird
der Scanner eingerichtet und de ben&ouml;tigte Treiber ausgew&auml;hlt. Einfach und
schnell geht dies und man kann sich mit dem eigentlichen Programm befassen.
nachdem man die Wahl getroffen hat, eine bestehende Datei zu laden bzw.
einen neuen Scanvorgang vorzunehmen, bekommt man des jeweilige Window angezeigt. 
Wir starten mit einem neuen Scanvorgang.
<P><DIV ALIGN="Center"><IMG SRC="../pic/sq_scan.gif" BORDER="0" WIDTH="255" HEIGHT="290" ALT="bild"></DIV></P>
 Ein Fenster wird ge&ouml;ffnet,
in dem man alle n&ouml;tigen Einstellungen vornehmen kann, wie zum Beispiel den
Modus w&auml;hlen, ob nun Grau, Farbe oder ein Text/Zeichnung gescannt werden
soll. Darunter kann man sich die Aufl&ouml;sung einstellen, die aber je h&ouml;her sie
genommen wird, auch daf&uuml;r sorgt, da&szlig; das Bild riesige Abma&szlig;e erh&auml;lt und nicht
gleich nach dem Scannen genutzt werden kann, sondern in anderen Programmen
berabeitet werden mu&szlig;. Auch die Vorschaul&auml;nge ist frei einstellbar, so kann
man vor dem Scan eines Pa&szlig;foto`s dem Programm sagen, da&szlig; es nur 10 cm (als
Beispiel, man kann ja ungef&auml;hr absch&auml;tzen wie gro&szlig; ein Foto ist) in der Vorschau 
einscannen soll.
<P><DIV ALIGN="Center"><IMG SRC="../pic/sq_vorschau.gif" BORDER="0" WIDTH="569" HEIGHT="399" ALT="bild"></DIV></P>
 Der Vorschau-Modus ist mit das wichtigste am gesamten
Programm, klickt man auf Vorschau, so wird in einer geringen Aufl&ouml;sung das 
Bild oder der Text schnell eingescannt, danach kann man sich den Teilbereich
markieren, was &uuml;ber eine kleinen farbigen Rahmen geschieht, oder das alles 
gleich so lassen und scannen. Abh&auml;ngig von der Aufl&ouml;sung, verz&ouml;gert bzw. beschleunigt 
sich auch das Scannen und wenn man hohe Aufl&ouml;sungen nutzen will,
also ein Bild in 1200x1200 dpi scannen, so wird auch sehr viel Fast Ram ben&ouml;tigt, 
bei unserem Testbild wurden bei 1200x1200 dpi 95.3 MB Ram ben&ouml;tigt,
und das Bild w&auml;re 7195x4628 Pixel gro&szlig; (15,2 cm x 9,8 cm). Wer f&uuml;r`s Internet 
ein paar Bilder braucht, reicht aber schon 100x100 dpi aus um relativ 
kleine und nicht zu grobpixelige (kommt auf die Vorgabe an) zu erhalten.
Man kann vor dem Scannen auch noch Bildkorrekturen vornehmen, zu dunkele
Bilder leicht erhellen, Kontraste setzen, wie auch den Gamma Wert ver&auml;ndern.
Neben diesen Dingen, kann man auch noch Werte f&uuml;r die Aufl&ouml;sung, die Interpolationsmethode 
(jeweils Einfach, Linear oder Kubisch), wie auch die Ma&szlig;einheit von Inch in Centimeter ab&auml;ndern.
Nach einem Scan wird das Bild automatisch geladen und einemla via Multiview
und einem externen Player angezeigt. Ist alles so, wie man es haben m&ouml;chte
un keine weiterer Scanvorgang ist n&ouml;tig, so kann man sich das Bild absichern,
hierzu stehen zur Verf&uuml;gung, das IFF Module, welches das Bild in Echtfarben
oder in nur 2, 4, 8, 32, 64, 128 und in 256 Farben sichert und leider auch 
sehr gro&szlig; werden l&auml;&szlig;t (also die Datei!). Wer das Bild aber schon packen m&ouml;chte,
kann auch das JPG Module nutzen und das Bild in Echtfarben sichern, hierbei
kann man auch noch die Qualit&auml;t ver&auml;ndern, in welcher das Bild gesichert wird
(sprich 50% - nette Qualit&auml;t = vern&uuml;nftige Dateigr&ouml;&szlig;e; 100% - sehr gute Qualit&auml;t = 
recht gro&szlig;e Datei). Bilder kann man drehen, spiegeln, deren Gr&ouml;&szlig;e &auml;ndern,
oder aber auch gleich kopieren. Die M&ouml;glichkeiten von SQ sind wirklich vielseitig, f&uuml;r Amigaverh&auml;ltnisse.</P>

Unterst&uuml;tzte Scanner
<PRE>
<B>Epson</B>     GT-4000, GT-5000, GT-6000, GT-6500, GT-7000, GT-8000, 
          GT-8500, GT-9000, GT-9500
          <B>Anschlu&szlig;:</B> SCSI, Seriell oder Parallel. Zum Anschlu&szlig; 
          am Parallelport wird ein spezielles Kabel ben&ouml;tigt. 
          (Ein Kabel der Firma ASDG, welches beim Scannertreiber
          der Software ADPro mitgeliefert wird, kann ebenfalls 
          verwendet werden.)
          <B>Optionen:</B> Durchlichteinheit
          
<B>HP</B>        ScanJet 2c, 2cx, 3c, 4c, 4p, 5p, 6100C
          <B>Anschlu&szlig;:</B> SCSI
          Der ScanJet 5100C ist nur f&uuml;r den Anschlu&szlig; 
          am Parallelport (EPP) erh&auml;ltlich und kann 
          nicht am Amiga betrieben werden. 

<B>Mustek</B>     Paragon 600, 600 SP, 600 II SP, 800 SP, 800 II SP, 1200, 
           1200 SP, ScanExpress 6000 SP Achtung: Bitte sehr genau auf die 
           Bezeichnung achten !

           <B>Anschlu&szlig;:</B> SCSI
           <B>Optionen:</B> Durchlichteinheit (au&szlig;er ScanExpress)

<B>Artec</B>      ViewStation A6000C (3-Pass), A6000C Plus (Single Pass), AT-3, 
           AT-6, AT-12, AM-12 S
           <B>Anschlu&szlig;:</B> SCSI
           <B>Optionen:</B> Durchlichteinheit
           
<B>UMAX</B>       Astra 610 S, 1200 S, 1220 S
           <B>Anschlu&szlig;:</B> SCSI
           <B>Optionen:</B> Durchlichtaufsatz UTA-3A f&uuml;r Astra 1220S

<B>Canon</B>      CanoScan 2700 F (Filmscanner)
           <B>Anschlu&szlig;:</B> SCSI
</PRE>
<P>Fazit:<BR>
 ScanQuix 4.0 ist ein wirklich gutes Programm. Schnell und leicht ge-
       langt man zum gew&uuml;nschten Ziel und die vielen kleinen Optionen, die
       man nutzen kann, wie Bildkorrekturen, Teilbreich-Scannen und dem 
       Zoomen in der Vorschau, machen das Program sehr n&uuml;tzlich. Die M&ouml;glich-
       keit &uuml;ber das zus&auml;tzliche enthaltene Programm &quot;PhotoCopyPro&quot; Scanner
       und Drucker als Farbkopierer zu verwenden (jedoch werden dazu noch ein
       paar Dinge ben&ouml;tigt) und die bis zu 20.000 dpi Aufl&ouml;sungen durch Inter-
       polation, bieten jedem Scannerbesitzer die F&auml;higkeit gute bis sehr gute
       Scan`s zu realisieren. Das Programm kostet ca. 150,- DM und ist bei RBM
       digitaltechnik erh&auml;ltlich. <b>- Gut -</b>
</P>

<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>
<P>Quelle:<BR>

RBM Digitaltechnik</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft02.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
