
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/soft.gif" BORDER="0" WIDTH="103" HEIGHT="35" ALT="Software">
<h1>At&eacute;oBussystem und Pixel64 im Test</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>




<P>Testrechner:A1200 im Micronik Infinitiv I Tower, Blizzard 1230/IV 50 Mhz 
+ 40 Mhz FPU, 2 MB Chip Ram, 16 MB Ram, 2 GB HD, SCSI 2 Controller, 
14&quot; VGA Monitor</P>

<P>Die Palette der Erweiterungen f&uuml;r den Amiga 1200 ist gro&szlig; geworden: Mittlerweile gibt es eine Vielzahl von Grafikkarten, Soundkarten,  Netzwerkkarten
und vieles mehr. Die damit notwendig gewordene Aufr&uuml;stung des Rechners um 
ein Zorro-Board ist f&uuml;r viele immer noch unerschwinglich, so da&szlig; es viele 
vorziehen m&ouml;gen, nicht nachzur&uuml;sten. Doch damit soll nun Schlu&szlig; sein. At&eacute;o 
Concepts aus Frankreich hat ein neues Bussystem auf den Markt gebracht, das 
speziell f&uuml;r den A1200 entwickelt wurde und zudem &auml;u&szlig;erst preisg&uuml;nstig ist.
Der &quot;At&eacute;o-Bus&quot; erm&ouml;glicht seinem Besitzer die Nachr&uuml;stung von Grafik-, Sound-,
Netzwerk- oder Turbokarten, sowie diverser anderer Peripherie. Man k&ouml;nnte 
den &quot;At&eacute;o-Bus&quot; auch als &quot;Zorro-Board des kleinen Mannes&quot; bezeichnen, denn 
nun ist es f&uuml;r A1200-Besitzer m&ouml;glich, mit geringem finanziellen Aufwand von
Erweiterungskarten zu profitieren, die ein Busboard ben&ouml;tigen. Im Lieferumfang des At&eacute;o-Bus sind neben dem Board mit 4 Slots, einem Adapter zum Anschlu&szlig; an den Amiga und einer Controllerkarte auch noch eine Installationsdis-
kette und ein Handbuch enthalten. Das Handbuch ist derzeit nur in englischer
und franz&ouml;sischer Sprache verf&uuml;gbar, eine deutsche Version ist in Arbeit. Da
At&eacute;o Concepts keine halben Sachen machen will, haben sie noch eine eigens 
entwickelte Grafikkarte beigelegt, auf die wir sp&auml;ter noch eingehen werden.</P>
<P><DIV ALIGN="Center"><IMG SRC="../pic/ateobus.gif" BORDER="0" WIDTH="200" HEIGHT="150" ALT="bild"></DIV></P>
<b>Die Installation vor dem Einbau</b>
Die von At&eacute;o Concepts mitgelieferte Installationsdiskette enth&auml;lt neben einer
Picasso96-Emulation und den At&eacute;o-Bus Startdateien auch noch ModePro, ein Tool
zur &Auml;nderung des Screenmodes f&uuml;r Spiele und Programme. Bevor  mit dem eigentlichen Einbau der Hardware begonnen wird, installieren wir die Software. &Uuml;ber
das vorhandene Script verl&auml;uft die Installation schnell und problemlos. Nachdem
 dann noch der n&ouml;tige Screenmode eingestellt worden ist, kann mit dem Einbau fortgefahren werden.

<P><b>Der Einbau</b><BR>

Der At&eacute;o-Bus wurde in einem Micronik Infinitiv I Tower (nicht II) getestet, 
so da&szlig; der Einbau bei anderen Geh&auml;usen anders verlaufen mag. Nachdem alle 
stromf&uuml;hrenden Kabel und Schutzvorrichtungen entfernt wurden, setzen wir den
At&eacute;o-Bus erst einmal zusammen. Der Controller wird &uuml;ber zwei 50polige Kabel an
das Busboard angeschlossen, danach wird an den Controller der beiliegende Adapter angeschlossen, damit das System &uuml;berhaupt mit dem A1200 betrieben werden
kann. Dieser Adapter beinhaltet au&szlig;erdem einen Anschlu&szlig;, der dem des Motherboards gleicht. &Uuml;ber diesen kann dann auch die Turbokarte weiter genutzt werden. Leider stellte sich heraus, da&szlig; es im Micronik-Tower zu Platzproblemen 
kommt. Besitzt man n&auml;mlich eine Turbokarte mit SCSI-Controller, wie unser Testrechner, so mu&szlig; diese gezwungenerma&szlig;en etwas &quot;gebogen&quot; werden, damit sie in den
vorgesehenen Platz hineinpa&szlig;t. Wenn der SCSI-Controller auch noch zus&auml;tzliches
Ram enth&auml;lt, so mu&szlig; man sich entscheiden zwischen dem SCSI Controller ohne Ram
oder der anderen Variante, bei der man den SCSI Controller komplett wegl&auml;&szlig;t. 
Sicherlich sollte nicht unerw&auml;hnt bleiben, da&szlig; das At&eacute;o-Bussystem f&uuml;r den At&eacute;o-
Tower konzeptioniert wurde und es somit keine Garantie gibt, auch im heimischen
Tower den notwendigen Platz vorzufinden. Wer aber nicht &auml;ngstlich ist und sich
einen internen Umbau zutraut, wird eine passende L&ouml;sung finden. Der n&auml;chste 
Schritt ist die Stromversorgung, die nun nicht mehr &uuml;ber das Motherboard erfolgt, sondern &uuml;ber das At&eacute;o-Bussystem. Das Micronik-Netzteil (Sky Hawk) hat
einen achtpoligen Hauptstecker, der f&uuml;r die Versorgung des Motherboards zust&auml;ndig ist. Dieser wird nun jedoch an ein Verteilerkabel angeschlossen, das
die Anschl&uuml;sse P8 und P9 enth&auml;lt, die dem AteoBus den Strom zuf&uuml;hren. Sowohl
der Controller als auch das Motherboard (das &uuml;ber den alten Floppy-Power-Anschlu&szlig; Strom erh&auml;lt) werden ebenfalls durch das Netzteil beziehungsweise einem
Abgang des Netzteiles mit Strom versorgt. Alle dazu notwendigen Kabel sind vorhanden, so da&szlig; es keine Probleme geben d&uuml;rfte. Obwohl sich der Einbau vielleicht
kompliziert anh&ouml;rt, ist er sehr einfach und wird durch das Handbuch sehr genau 
erkl&auml;rt. Zum Schlu&szlig; wird noch die Pixel64-Grafikkarte in einen Bus-Slot gesteckt
und der Monitor an den externen Port der Karte angeschlossen.</P>
<P><DIV ALIGN="Center"><IMG SRC="../pic/ateo_pixel64.jpg" BORDER="0" WIDTH="200" HEIGHT="150" ALT="bild"></DIV></P>
<P><b>Die Pixel64-Grafikkarte</b><BR>

At&eacute;o Concepts bietet im Zusammenhang mit dem At&eacute;o-Bussystem auch eine dazugeh&ouml;rige Grafikkarte, die Pixel64. Mit 2 MB Grafik-Ram und dem Cirrus Logic GD5434
Grafikchip ausger&uuml;stet, kann sie die Workbench in 800x600 Pixel darstellen und 
das bei 16 Millionen Farben in 24 Bit Qualit&auml;t. Die Pixel64 ist komplett Picasso96 kompatibel und arbeitet sowohl mit Programmen, wie auch mit Spielen fast
immer zusammen. Jedoch gibt es auch Probleme, so weigert sich die Grafikkarte 
einige Modi anzunehmen. &quot;ModePro&quot;, welches der Installationsdisk beiliegt, kommt
hier zum Einsatz. Mit diesem Programm konnten wir einige Bildschirme auf den der
Grafikkarte umlenken, jedoch mussten wir feststellen, da&szlig; Freewaretools, wie zum
Beispiel &quot;NewMode&quot; (im Aminet erh&auml;ltlich) leichter zu bedienen sind und schneller zum gew&uuml;nschten Ziel f&uuml;hren. Aber auch hier konnten wir nicht jedes Programm
dazu begeistern auf den Pixel64 Modi umzuschalten und somit gibt es keine M&ouml;glichkeit &auml;ltere Spiele und Programme zu nutzen. Wenn man auf diese Software aber
nicht verzichten m&ouml;chte, mu&szlig; man nur den Bildschirm wieder auf Pal/NTSC umstellen und den Monitoranschlu&szlig; von der Grafikkarte entfernen und an den Motherboard
Port anschlie&szlig;en. Bei RTG unterst&uuml;tzender Software und bei Programmen die auf 
der Workbench laufen, gab es dagegen &uuml;berhaupt keine Probleme. &Uuml;berzeugen konnte
uns die Pixel64 durch einen schnellen Bildaufbau, sauber dargestellte Grafiken 
und dem Preis-/Leistungsverh&auml;ltnis. Gerade mal 690 FF (ca. 200 DM) kostet sie 
und ist somit um einiges g&uuml;nstiger, als ihre Konkurrenten. F&uuml;r Amiga 1200 User,
ohne Grafikkarte, wird sich diese Investition auf jedenfall lohnen.
</P>
<P><b>Die Leistung = AGA vs. Pixel64</b><BR>

Der Bootvorgang verl&auml;ngert sich nach dem Einbau geringf&uuml;gig, da&szlig; liegt daran, 
das nicht das Motherboard sofort angesprochen wird, sondern erst das At&eacute;o-Bus.
In der Statuszeile der Workbench kann man nun erkennen, da&szlig; der Grafikspeicher
zugenommen hat, was den angenehmen Effekt nach sich tr&auml;gt, nun in den Genu&szlig; 
eines schnelleren Bildaufbaues zu kommen und die Grafiken in bis zu 16 Mill.
Farben erstrahlen zu lassen. Die Leistung des Bussystems ansich konnten wir 
leider schlecht testen, schlie&szlig;lich ist es ja nur &quot;ein Board mit Steckpl&auml;tzen&quot;
f&uuml;r Erweiterungen, weshalb wir uns verst&auml;ndlicherweise mehr mit der Leistung 
der Pixel64 besch&auml;ftigt haben. Da viele User sich nun auch verst&auml;rkt mit der 
Pr&auml;sentation im Internet befassen, haben wir dies zum Anla&szlig; genommen und hier 
eine ganze Reihe von Versuchen durchgef&uuml;hrt. Die Grafikanwendung PPaint 7.1, 
erwies sich als sehr n&uuml;tzlich und arbeitete mit der Pixel64 hervorragend zusammen. Nachdem wir uns nun einige Grafiken erstellt hatten, bearbeiteten wir
diese mit einigen Programmen, wie ArtEffect2.6 oder Candy030/FPU. Auch hier 
konnten wir eine deutliche Leistungssteigerung gegen&uuml;ber dem AGA Chipset beobachten. So war die Verarbeitungszeit schneller und das Ergebnis qualitativ 
besser. Auch die Browser, zumindest Voyager und AWeb, nutzen die Power der 
Pixel64, und die kreierte WebSite war im Vergleich zum AGA Chipset optisch 
sch&ouml;ner zu betrachten. In diversen Textanwendungen bemerkten wir ebenfalls 
eine Steigerung der Geschwindigkeit und die Qaulit&auml;t der Bilder konnte uns 
auch &uuml;berzeugen, obwohl das Endergebnis (der Ausdruck) vom jeweiligen Drucker 
abh&auml;ngt und in keinsterweie von der Grafikkarte beeinflu&szlig;t wird, ganz klar. 
Neben den Anwendungen sorgte die Pixel64 auch bei Spielen f&uuml;r ein besseres 
Bild, und das im wahrsten Sinne des Wortes. Foundation, Myst und das erh&auml;ltliche Demo von Napalm waren nur einige Spiele, die wir mit der Pixel64 erprobten und unser Fazit war eindeutig positiv. Schnellerer Spielflu&szlig;, &quot;Full-
Motion-Video&quot; Animationen in besserer Qualit&auml;t (und vorallem schnell) und 
auch eine gewisse Farbtiefe waren zu verzeichnen. Das Intro von Foundation 
bzw. Myst lief im Vergleich zum AGA Modus fast doppelt so schnell ab und sah
nat&uuml;rlich auch besser aus. Wie schon erw&auml;hnt, waren wir von der Leistung der
Pixel64-Grafikkarte begeistert und k&ouml;nnen nur jedem empfehlen, diese Karte 
bei einem Kauf des At&eacute;o-Bussystems mitzubestellen. Wer sich dazu entschlie&szlig;en
sollte, erh&auml;lt beide Produkte zu einem verg&uuml;nstigten Bundlepreis.</P>

<P><b>Fazit</b><BR>

Das At&eacute;o-Bussystem ist eine preiswerte und empfehlenswerte Erweiterung f&uuml;r 
den Amiga1200. Die 4 Bus-Slot`s, die neben der Grafikkarte auch mit Ehternet-,
Sound- und Controllerkarten unterst&uuml;tzen, bieten den A1200 Usern nun endlich
die Freiheit ohne gro&szlig;en Aufwand ihren Amiga zum High-End Rechner auszustatten. Ein umr&uuml;sten auf A4000, wegen der Erweiterungen, bleibt uns Amiga1200 
Besitzern nun erspart und da At&eacute;o-Concept`s an weiteren Karten f&uuml;r das Bussystem arbeitet, ist dies keine schlechte Investition. Einzig und allein die
Tatsache das es im Tower zu Platzproblemen kommen kann (jedoch arbeitet man 
derzeit an technischen L&ouml;sungen f&uuml;r andere Tower), spricht nicht so ganz f&uuml;r
das At&eacute;o-Bus. Ansonsten konnte es uns aber &uuml;berzeugen und ist somit auf jedenfall zu empfehlen. Das At&eacute;o-Bussystem kostet 1390 FF, umgerechnet ungef&auml;hr 
400 DM und wenn man sich f&uuml;r ein Bundle Paket entscheidet, bekommt man das 
At&eacute;o-Bus + Pixel64 Grafikkarte f&uuml;r 1990 FF (ca. 570 DM). Den deutschen Vertrieb &uuml;bernimmt Seidel-Software.</P>


<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>

<P><U>Technische Details:</U></P>


AteoBus:
  <UL>
<LI>Maximale Transferrate: 9.3 MB/s</LI>
<LI>  68k und PPC Kompatibel</LI>
<LI>  kein DMA</LI>
<LI>  4 schnelle Slots f&uuml;r Grafik-, Controllerkarten ect.</LI>
<LI>  unkompatibel mit ZorroII und ZorroIII</LI>
</UL>


Pixel64:
<UL>
<LI>  Cirrus Logic GD5434 (64 bits) Grafikchip</LI>
<LI>  Pixel Uhr: 135 Mhz max.</LI>
<LI>  2 MB Grafik-/Videospeicher (max. 4 MB)</LI>
<LI>  24 Bit Aufl&ouml;sung:  800 x  600 in 60 Hz + Alpha Channel</LI>
<LI>   24 Bit Aufl&ouml;sung:  800 x  600 in 85 Hz</LI>
<LI>  16 Bit Aufl&ouml;sung: 1024 x  768 in 75 Hz</LI>
<LI>   8 Bit Aufl&ouml;sung: 1280 x 1024 in 75 HZ</LI>
<LI> arbeitet mit DPMS Videoausgang (Analog:rot, gr&uuml;n, blau)(TTL: H-Sync, V-Sync)</LI>
</UL>


</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft10.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="werb02.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

