
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/soft.gif" BORDER="0" WIDTH="103" HEIGHT="35" ALT="Software">
<h1>CandyFactoryPro</h1>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>




<P>Beim ersten Start von CandyFactory erscheint ein Bildschirmmodus-Requester.
Dort w&auml;hlt man einen Modus, der mindestens 326x300 Pixel Aufl&ouml;sung bietet.
Grafikkartenbesitzer sollten einen 16bit oder 24bit Modus w&auml;hlen, um in den
Genu&szlig; der True-Color Effekte zu kommen. Unter Verwendung von 8-bit Bildschirmmodi, werden die 24bit Daten zum Anzeigen heruntergerechnet und gerastert dargestellt.  </P>

<P>W&auml;hlt man jetzt eine Graustufenmaske, nach M&ouml;glichkeit eine mit gegl&auml;tteten
Kanten, &uuml;ber das Projekt-Menu &quot;load mask&quot; (Lade Maske), so kann der Spa&szlig; schon
beginnen. Nach dem die Datei ausgew&auml;hlt wurde, l&auml;&szlig;t CandyFactory die Maske 
scannen und zum Bearbeiten vorbereiten.</P>

<P>Eine weitere M&ouml;glichkeit ist, einen Text, bestehend aus Vektorfonts, einzugeben. CandyFactory verwendet dazu die Compugraphic Fonts, w&auml;hlt man aus dem
Projektmen&uuml; den &quot;Add Text&quot; (Text hinzuf&uuml;gen), so kann man dies realisieren.</P>

<P>Nachdem dies durchgef&uuml;hrt wurde, zeigt CandyFactoryPro eine Version des Bildes
oder des Textes, noch ohne Schattenberechung, an. Wenn man die 24bit Option
aktiviert hat, wird das Projekt mit Anti-aliasing Effekt angezeigt. Im Materialfenster kann man jetzt Schattenwurf oder Reflektionen aktivieren.</P>
</td></table>
<P><DIV ALIGN="Center"><IMG SRC="../pic/candy.jpg" BORDER="0" WIDTH="640" HEIGHT="480" ALT="bild"></DIV></P>
<table width="75%"><td>
<P>Jetzt ist alles prepariert, soda&szlig; mit dem Hinzuf&uuml;gen der Spezialeffekte 
begonnen werden kann.</P>

<PRE>  Fenster Men&uuml;:

          Material       &Auml;ndert Materialeinstellung
         Lichtquelle     &Auml;ndert Lichtquelleneinstellung
     Inner Abschr&auml;gung   f&uuml;gt abgerundete Ecken dem Objekt zu
        Schattenwurf     f&uuml;gt einen Schattenwurf dem Objekt zu
          Gl&uuml;hen         f&uuml;gt einen Gl&uuml;heffekt dem Objekt zu
         Bumpmap         f&uuml;gt eine Bumpmap hinzu
      Farb-Texture       f&uuml;gt farbige Texturen hinzu

  Bild-men&uuml;:

      Invertiere Maske   Invertiert Objekt-/Hintergrundmaske
        Render Bild      Rendert Bild
        L&ouml;sche Bild      l&ouml;scht das Bild

  Einstellungsmen&uuml;:

      Bildschirmmodus    W&auml;hlt Bildschirmmodus
         Echtzeit        Echtzeitberechung aktiv
           Pfad          Programmpfad Einstellung
    Sichere Einstellung  speichert aktuelle Einstellungen

  Projekt Men&uuml;:

       Neues Projekt     &Ouml;ffent ein neues Canvas_Fenster
       &Ouml;ffne Projekt     &Ouml;ffen oder Hinzuf&uuml;gen eines Projektes
      Schreibe Projekt   Sichert Projekt auf Festplatte
      Text hinzuf&uuml;gen    Erstellt anti-aliasing Text
        Lade Maske       L&auml;dt das Quellbild der Maske
       Sichere Maske     Sichert Maske
       Sichere Bild      Sichert die Kreation
       Sichere Alpha     Sichert Bild transparent</PRE>

</td></table>
<P><DIV ALIGN="Center"><IMG SRC="../pic/candy1.jpg" BORDER="0" WIDTH="320" HEIGHT="256" ALT="bild"></DIV></P>
<table width="75%"><td>
<P>F U N K T I O N S &Uuml; B E R S I C H T</P>

  Quellmaterial:
<UL>
<LI>    Graustufen Grafikmaske mit oder ohne Kantengl&auml;ttung (antialiasing), in Abh&auml;ngigkeit mit dem von Ihnen gew&uuml;nschten Ergebnis.</LI>
<LI>    Oder f&uuml;gen Sie einen Text mit antialiasing Effekt direkt vom Programm aus ein.Ein vom Benutzer w&auml;hlbarer CG-Font (Vektorfont) mit variabler Gr&ouml;&szlig;e und Position, Buchstabengr&ouml;&szlig;e, Fettschrift, horizontale und vertikale Ausrichtung, Kursivstellung, Rotation</LI>
</UL>


<UL>
<li>  Verf&uuml;gbare Effekte (Auszug):
   Schattenwurf (Lichtquelle), variable Position und Distanz (Echtzeitberechnung)</LI>

<LI>    Material-Einstellungen (Objekte und Hintergrund) Schatten, kein Schatten oder spiegelnd (Noise oder Spiegel-map) Variable Objektfarbe, Farbaufhellung oder Sch&auml;rferegulierung, Ambiente-Farbe</LI>

<LI>    Innere Abschr&auml;gung: Variable Breite, H&ouml;he, Weichzeichung, Sch&auml;rfe (Spline basierend) Emboss oder Carve-Aussehen </LI>

<LI>    Weich auslaufende Schatten (in Echtzeit bewegbar inkl. Lichtquelle). Variabler Gl&auml;ttungsgrad, Intensit&auml;t, Farbe, Distanz zum Objekt (in Echtzeit)</LI>

<LI>    Gl&uuml;h Effekt: Normal oder verstreut Variable Gr&ouml;&szlig;e oder Weichzeichnungsgrad, Intensit&auml;t, zentrierter oder  &uuml;ber Ecke Farbverlauf</LI>

<LI>   Unebene Texturen (Objekt oder Hintergrund)  Noise basierend (normal, fraktal, Turbolenz oder Fraktal-Turbolenz) oder von einem zus&auml;tzlichen Graustufenbild.</LI>

<LI>    Farbige Textur Hinzuf&uuml;gen einer farbigen Texture zum Objekt oder zum Hintergrund Variable Gr&ouml;&szlig;e und Position</LI>
</UL>


   Echtfarbmodus (Truecolor):
<UL>
<LI>    Echtzeit Lichtquellenbrechung in 24bit bei gleichzeitigem Nutzen von Objekt-Schattenwurf/Reflektion + Farbtextur + Abschr&auml;gung + Antialiasing, Schatten, Gl&uuml;h-Effekt, Hintergrund-Schatten/Reflektion + unebene Texturen (nur PPC)</LI>
<LI>    Echtzeit 24bit nach 8bit Konvertierung plus Dither im 8Bit oder AGA-Modus</LI>
<LI>   optimierte Berechnungsroutinen f&uuml;r PPC und 68xxx</LI>
<LI>   &uuml;berarbeitete Schattenweichzeichnung, Echtfarb Schatten und Aufhellungen</LI>
<LI>    &uuml;berarbeitete Reflektionseffekte, Bi-Linear Interpolation verhindert &quot;Kl&ouml;tzchenbildung&quot;.</LI>
<LI>   optimierte Bumbmapping-Effekte, mehrfach Berechung gl&auml;ttet kleine Bumpmaps</LI>
<LI>    Farbwertneuberechung von 2 bis 256 Farben, mit oder ohne Error-Diffus Dithering.</LI>
<LI>    Option den Hintergrund mit dem Farbwert 0 f&uuml;r Transparenzeffekte auszutauschen.</LI>
<LI>    speichern von 24bit Echtfarbbildern</LI>
<LI>    speichern einer 8bit Alphamaske f&uuml;r den Einsatz in einer Bildbearbeitungssoftware.</LI>
<LI>    Laden/Speichern/Zusammenf&uuml;gen von Objekten</LI>
</UL>



<P><b>Fazit:</b><BR>

Leute die Webseiten, Computerspiele oder Videotitel erstellen, ben&ouml;tigen oft
Logos oder Buttons. Meist nimmt man dann ein Malprogramm oder einen Raytracer
zu Hilfe. Beide Programmarten sind recht einarbeitungs-intensiv, es ist nicht
mal so eben ein Schriftzug getraced oder ein Logo gepixelt. Da schafft Candy
abhilfe! Denn mit Candy ist ein Logo sehr einfach und auch schnell gemacht.
Dank hochoptimierter PPC-Unterst&uuml;tzung sind fast alle Effekte in Bruchteilen
von Sekunden berechnet, viele sogar in Realtime. Da kommt gar nicht erst 
&quot;Kaffee-trink-Stimmung&quot; auf, sondern man kann nach Herzenslust loslegen. Aber
auch ohne PPC ist die Pro-Version erheblich schneller als die Freeware-Version
aus dem Aminet. Auch sonst hat sich einiges getan, gegen&uuml;ber dem Freewarepro-
dukt, da&szlig; Beste ist, das man jetzt endlich Texte direkt einf&uuml;gen/-geben kann 
und die Schriften und den Hintergund mit einer Textur &uuml;berziehen kann. Die CD
ist mit 325 MB gef&uuml;llt, wovon 45 MB sehr sch&ouml;ne Fonts sind und 47 MB Hintergrund-Texturen.
 Es ist also alles auf der CD drauf was man braucht um Logos zu
erstellen.<BR>
 Leider hat die Version 1.02 noch einen kleinen Fehler. Sie ben&ouml;tigt
einen ASSIGN auf Elastic Dreams! Hat man Elastic Dreams nicht  bzw.  das Demo
nicht installiert, reicht ein Eintrag in die User-Startup Datei aus (assign 
ElasticDreams: &quot;Grafik:CandyFactoryPro&quot;) und schon funktioniert es wieder! Das 
kommt wohl daher, das Elastic Dreams und Candy Factory Pro die selben Load und
Save Module benutzen. <b>- Empfehlenswert -</b></P>


<P><DIV ALIGN="Right"><IMG SRC="../pic/sk.gif" BORDER="0" WIDTH="43" HEIGHT="36" ALT="-sk-"></DIV></P>
<P>Quelle:<BR>

Thomas Ferst Amiga Hard &amp; Soft <BR>

K&ouml;penicker Str. 11<BR>

15537 Gosen b. Berlin<BR>

Tel: 03362/820097<BR>

Fax: 03362/882988<BR>

eMail: <a href="mailto:ferst@t-online.de">ferst@t-online.de</a><BR>

telefonische Bestellung 18.00 - 21.00 Uhr</P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="soft07.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="soft.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="soft09.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>

