
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/fun.gif" BORDER="0" WIDTH="133" HEIGHT="35" ALT="Fun &amp; Talk">
<h3>Interview mit Leander von Kraft vom CC Studio</h3>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>

<P>AT  = Mario Nitschke<BR>

LvK = Leander von Kraft</P>

<P><b>AT:</b><BR>

Sagt mal, was macht Ihr eigentlich noch so f&uuml;r den Amiga? Eure Themengebiete waren und sind ja noch immer Grafik und Raytracing. Berichtet
uns und unseren Lesern mal ein bischen &uuml;ber Euch!</P>

<P><b>LvK:</b><BR>

Wir sind zwei junge Unternehmer, und schon seit fast 10 Jahren Amigafreaks.
Unser Anliegen war es zu zeigen, da&szlig; man auch mit dem Amiga prof. Arbeit
leisten kann - nun ja nat&uuml;rlich wollten wir auch Geld verdienen :-)
Unser Spezialgebiet ist die 3D Animation/Visualisierung vorwiegend f&uuml;r
Pr&auml;sentationsvideos, Kinowerbung und CD-Rom/DVD Projekte. </P>

<P>Anfang diesen Jahres haben wir ein Projekt f&uuml;r das ZDF realisiert.
Es handelt sich hier um einen Film mit dem Namen &quot;Drachenland&quot;, in dem ein
Programierer ein Advanturespiel gleichen namens programmiert. Diese Spiel
wurde von uns in Form von Animationen und Grafiken auf dem Amiga erstellt
- denn genauen TV-Start werde ich noch mitteilen.</P>

<P>Zwei Spiele-Projekte  f&uuml;r den Amiga liegen noch in der Schublade, lassen
sich aber aus Kostengr&uuml;nden nicht realisieren, solange es keine Besserung
im Amigamarkt gibt. Weiterhin haben wir Amiga International Inc. unsere 
Hilfe beim Marketing (z.B. bei TV- und Kinowerbung) angeboten. Doch, da 
waren wir uns einig, macht es keinen Sinn viel Geld in Werbung zu stecken
solange man nichts Neues, wie einen AmigaNG, anzubieten hat. Glaubt man
den Versprechungen, so wird aber mit dem neuen Amiga viel Geld f&uuml;r Marke-
ting zu Verf&uuml;gung stehen.</P>

<P>Wir habe berufliche Erfahrungen mit Amigas, Macs, SGI und nat&uuml;rlich auch
Dosen. Unser Anliegen war es immer m&ouml;glichst problemlos arbeiten zu k&ouml;nnen,
ohne st&auml;ndig an den Systemen rumbasteln zu m&uuml;ssen, also bleibt fast nur das
typische Amiga-Feeling. Verschweigen will ich aber auch nicht das wir z.Zt.
keine neuen Amigas kaufen, da die Grundlage zum zeitgem&auml;&szlig;en Arbeiten mit 
Raytracern in immer weitere ferne r&uuml;ckt. Zu nennen ist hier haupts&auml;chlich
Novadesign und Maxon, die ja leider keine neuen Versionen f&uuml;r den Amiga auf
den Markt bringen und so einen Teilumstieg auf andere Systeme unumg&auml;nglich
machen ! Uns bleibt nur die Hoffnung auf einen neuen Amiga (OS 5) und damit
die Besinnung der Softwareentwickler, auf den Rechner, der Sie einst &quot;Gro&szlig;&quot;
gemacht hat. Doch es gibt auch Lichtblicke, etwa Eyelight aus Italien, die
auch in den schwierigsten Zeiten noch ein durchaus konkurrenzf&auml;higes Produkt
f&uuml;r den Amiga entwickelt haben.</P>

<P><b>AT:</b><BR>

So, ihr habt also f&uuml;r das ZDF eine Animation mit dem Amiga gemacht, was 
nutzt Ihr da eigentlich f&uuml;r eine Software und wie gut sind Eure Rechner
ausger&uuml;stet?</P>

<P><b>LvK:</b><BR>

Wir nutzen 3 Amigas, einen A4000 &amp; PowerPC604e-200/68060-50, CybervisionPPC
128 MB-Ram... einen A1200 im Tower mit 68060-50, ca.90 MB Ram und der Cyber-
Vision64/3D und - last but not least - ein A2000 mit 68040-50 und 64 MB Ram.
Desweiteren haben wir nat&uuml;rlich sehr gro&szlig;e Monitore (21&quot;) sowie viel prof.
Hardware wie Scanner, Drucker, Netwerkkarten, Midiequipment und so weiter.</P>

<P>Auch ein G3 PowerMac (350 MhZ) kommt als Grafikworkstation (Photoshop/
QuarkXPress) zum Einsatz. &Auml;hh irgend etwas habe ich vergessen - ach ja wir 
haben auch eine Dose (K6-2 350 MhZ) die nat&uuml;rlich nur als B&uuml;romaschine ge-
nutzt wird ;-). Im ernst, die Kunden fl&uuml;chten aus unserem Studio, wenn ich
ihnen erz&auml;hle das wir keine PC`s, sondern nur Amiga`s haben und das geht
nat&uuml;rlich nicht :-( </P>

<P>Als Software nutzen wir haupts&auml;chlich Lightwave in der Version 5.1 mit
einigen PlugIns, aber auch Tornado V2 und MaxonCinema V4 Pro kommt ge-
legentlich zum Einsatz. Nach dem Rendern werden die TIF-Frames (768x576
Pixel) gegebenenfalls mit ImageFX V3.2 (AutoFX) mit Effekten oder Filtern
nachbearbeitet und &uuml;ber ein prof. Schnittsystem, eine AVID oder eine FAST
601 auf VHS, SVHS, BetacamSP, DV, DVC-Pro oder 35 mm Film ausgespielt.</P>

<P><b>AT:</b><BR>

Gibt es auch Animationen bzw. Effekte von Euch, die auch uns Amiga Usern
durch das Fernsehen gel&auml;ufig sind - schlie&szlig;lich werdet Ihr ja keine Werke
von Euch im Aminet ver&ouml;ffentlichen.</P>

<P><b>LvK:</b><BR>

Klassische Werbespots f&uuml;rs Fernsehen machen wir realtiv selten, unsere 
Schiene sind eher Firmen, die sich mit einem Video oder einer CD-Rom 
pr&auml;sentieren wollen. Eine Ausnahme bildetet z.B. die REAL-Supermarkt-
kette (Metro-Konzern) und demn&auml;chst auch weitere Ketten wie OBI, EDKA
und Metro, f&uuml;r diese gibt bzw. wird es ein eigenes TV-Programm f&uuml;r alle 
M&auml;rkte in Deutschland geben. Dieses Programm wird in Echzeit per Satelit
zu tausenden von M&auml;rkten gesendet - und alle Trailer, Spots und Animationen
wurden mithilfe des Amigas erstellt.</P>

<P><b>AT:</b><BR>

Wie sieht die Zukunft aus? Bleibt Ihr dem Amiga treu?</b></P>

<P><b>LvK:</b><BR>

Eine gute Frage! Ich kann nur sagen, da&szlig; wir immer hinter dem Amiga standen
und auch weiter stehen werden, zumindest privat! Die Firma kann nur hoffen,
da&szlig; wieder Schwung in die Amigaszene kommt und uns damit die M&ouml;glichkeit
bleibt kreativ und zeitgem&auml;&szlig; zu arbeiten. Aber bis der neue NG Amiga im 
Handel erh&auml;ltlich ist, m&uuml;ssen wir uns nach weiteren M&ouml;glichkeiten umsehen
- denn solange k&ouml;nnen wir nicht warten!</P>

<P><b>AT:</b><BR>

Habt Ihr in den Medien auch die ganze Geschichte mit dem NG Amiga und OS5.0,
sowie QNX verfolgt? Was haltet Ihr davon?</P>

<P><b>LvK:</b><BR>

Die Zukunft des Amigas liegt uns sehr am Herzen, und deshalb beobachten wir
die Medien nat&uuml;rlich sehr intensiv. Meiner Meinung nach ist die Entscheidung
zu einem neuen Amiga mit neuem Betriebssystem die einzig richtige, auch QNX 
als Partner scheint ein wichtiger Schritt zu einem Rechner f&uuml;r das n&auml;chste
Jahrtausend zu sein.</P>

<P>Weniger gut finde wir, das Amiga (Int.Inc und Inc.) zuerst einen PowerPC-
System als Nachfolger ernannte, und nun doch einen anderes Konzept verfolgt.
Die Geprellten sind mal wieder die User und Hersteller, wie Phase5 die schon
Unsummen in die Entwicklung gesteckt haben. Und hier endet die Kreislauf 
nat&uuml;rlich nicht, so gab es berechtigte Hoffnungen das z.B. NewTek k&uuml;nftige 
Versionen von Lightwave auch auf dem Power-Amiga erscheinen w&uuml;rden...
.. ganz am Ende kommen dann die User und Firmen wie wir...</P>

<P>Bleibt uns nur noch zu hoffen, da&szlig; der neue Rechner wirklich kommt, und das
so schnell wie nur m&ouml;glich. Denn der Amiga hat das Potential eines wirklichen
&quot;Multimedia-Spiele-Profi-User-Rechners&quot; zu einem konkurrenzf&auml;higen Preis.</P>

<P><DIV ALIGN="Right"><IMG SRC="../pic/mn.gif" BORDER="0" WIDTH="55" HEIGHT="27" ALT="-mn-"></DIV></P>


</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="talk02.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="talk.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="talk04.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
