
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/fun.gif" BORDER="0" WIDTH="133" HEIGHT="35" ALT="Fun &amp; Talk">
<h3>Interview mit W.F.M.H., dem Herausgeber des neuen Sprachenlernprogrammes
Electronic Teacher 5</h3>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>




<P>Autor: Andr&eacute; Beer <a href="mailto:j.beer@abo.freiepresse.de">j.beer@abo.freiepresse.de</a>)<BR>

Gespr&auml;chspartner: Marcin Orlowski <a href="mailto:carlos@wfmh.org.pl">carlos@wfmh.org.pl</a>)</P>


<P><b>AB:</b><BR>

Hallo Marcin,<BR>

W.F.M.H. ist in Deutschland bisher sicherlich nur Insidern bekannt. Kannst Du uns
W.F.M.H. etwas n&auml;her vorstellen, d.h. was bedeutet W.F.M.H., wer steht dahinter,
was habt Ihr f&uuml;r eine Vorgeschichte?</P>

<P><b>MO:</b><BR>

Jene Eurer Leser, die fr&uuml;her Atari 8-Bit-Rechner besassen, m&ouml;gen sich an die
&quot;The Top&quot; Demos wie auch an andere Spiele und Programme erinnern, die unter
diesem Namen erschienen. W.F.M.H. ist eine Abk&uuml;rzung f&uuml;r World Federation of
Mad Hackers (zu deutsch: &quot;Welt-Vereinigung der wahnsinnigen Hacker&quot;) und
wurde 1989 von Marcin Dudar und Miloslaw Smyk als sogenannte &quot;Informal
computer group&quot; gegr&uuml;ndet. F&uuml;r einige Jahre war W.F.M.H. zumeist eine
Demo-Gruppe, zuerst in der Atari 8-Bit Szene, dann, in 1992, verschob sich
der Schwerpunkt zur Amiga-Programmierung.  Einige neue Leute (mich
eingeschlossen) kamen in dieser Zeit hinzu.  Jetzt haben wir um die 10
Mitglieder, meist Programmierer. In 1996 hat Andrzej Piasecki unser
endg&uuml;ltiges Megademo ver&ouml;ffentlich und seitdem haben wir &quot;nur&quot; noch Anwender-
Software produziert.</P>

<P><b>AB:</b><BR>

Ist der Electronic Teacher (ET) Eure erste kommerzielle Software
f&uuml;r den Amiga?</P>

<P><b>MO:</b><BR>

Nein, Electronic Teacher ist nicht unsere erste kommerzielle Ver&ouml;ffentlichung.
Wir haben bereits eine breite Palette an Amiga-Software f&uuml;r einen gro&szlig;en
Kundenkreis (z.B. das polnische Lokalisierungs-Paket W.F.M.H. LocalePL,
dem inoffiziellen polnischen Lokalisierungsstandard) geschrieben, wie auch
integrierte Systeme auf Bestellung einzelner Kunden: wie ein Gas-Station-
Management-System (nur Software) oder ein kombiniertes Hard- und Softwarepaket
f&uuml;r das Aufnehmen und Bearbeiten medizinischer R&ouml;ntgenbilder und -serien,
bestellt von unserer &ouml;rtlichen Klinik.
Es gibt noch eine Menge weiterer Projekte, entweder unter dem Konzept der
Shareware oder als frei erh&auml;ltliche Tools ver&ouml;ffentlicht. Die meisten davon
stehen auf unserer Homepage bereit, so m&ouml;chte ich jeden Interessierten
einladen, uns einen Besuch abzustatten.</P>

<P><b>AB:</b><BR>

Sind die Entwickler von eTeacher dieselben Personen wie die von W.F.M.H.?</P>

<P><b>MO:</b><BR>

Nein, Krzysztof Jonko, der Hauptentwickler des Elektronischen Lehrers ist weder
ein Mitglied noch ein Angestellte von W.F.M.H. In diesem Fall sind wir mehr die
Herausgeber und Projekt-Koordinatoren als die Programmierer - Krzysztof schrieb
fast das ganze Programm im Alleingang. Der einzige Zeitpunkt, zu dem wir Hand
an den Programmcode legten, war, als der Ver&ouml;ffentlichungstermin n&auml;her und
n&auml;her r&uuml;ckte, und Krzysztof infolge einiger pers&ouml;nlicher Gr&uuml;nde nicht in der
Lage war, das Programm selbst fertigzustellen.</P>

<P><b>AB:</b><BR>

Wie lang dauerte die Entwicklung von eTeacher bis zur ersten Ver&ouml;ffentlichung?</P>

<P><b>MO:</b><BR>

Das ist schwer zu sagen, weil es bereits einige ver&ouml;ffentlichte Versionen des
eTeacher gab. Die Version 5 ist aber auf jeden Fall die erste internationale
Ver&ouml;ffentlichung, mit Versionen f&uuml;r deutsche, italienische und polnische
Anwender. Es nahm ungef&auml;hr 3 Jahre in Anspruch, bis ET so aussah, wie Ihr ihn
heute vor Euch seht. Und er wird noch aktiv weiterentwickelt.</P>

<P><b>AB:</b><BR>

Beschreibe doch mal in wenigen Worten, welches die Hauptmerkmale von ET sind,
um ihn zum besten Sprachentrainer auf dem Amiga zu machen.</P>

<P><b>MO:</b><BR>

Sch&ouml;n, da&szlig; Du ihn so magst. Ich wei&szlig; nicht, ob es der beste Sprachentrainer
f&uuml;r den Amiga ist, aber ich denke, es ist das am meisten fortgeschrittenste
und allgemeing&uuml;ltigste Programm dieser Art. Das komplette Programm ist
ausschlie&szlig;lich auf CD erh&auml;ltlich (es gibt keine Disketten-Version) und
beinhaltet &uuml;ber 640MB verschiedener Daten (jetzt wi&szlig;t Ihr auch, warum es keine
Floppy-Version gibt  ;-)</P>

<P><b>AB:</b><BR>

Denkst Du, da&szlig; Software-Piraterie ein gro&szlig;es Problem auf dem Amiga-Markt
darstellt? Ist eTeacher davon betroffen?</P>

<P><b>MO:</b><BR>

Ja, Software-Diebe (ich wei&szlig; nicht, warum die Leute sie &quot;Piraten&quot; nennen) sind
ein gro&szlig;es Problem (meiner Meinung nach es ist jetzt gr&ouml;sser als jemals zuvor).
Warum?
Zumeist infolge des kleineren Software-Marktes. Es ist kein Geheimnis, da&szlig; wir
nicht so viele aktive Software-Herausgeber auf dem Amiga-Markt haben. Das
Stehlen ihrer Produkte verhindert, da&szlig; sie an (finanzielle) Ressourcen f&uuml;r
ihre zuk&uuml;nftige Arbeit kommen. Es ist ein ganz einfaches und offensichtliches
Verh&auml;ltnis (Ich frage mich, warum so viele Leute es nicht sehen k&ouml;nnen?):
Das Erschaffen jedes gr&ouml;&szlig;eren Produktes nimmt eine Menge Zeit und Ressourcen
(haupts&auml;chlich finanzieller Art) in Anspruch. Programmierer sind ganz
gew&ouml;hnliche menschliche Gesch&ouml;pfe - sie m&uuml;ssen essen, Rechnungen bezahlen usw.
Sie m&uuml;ssen bezahlt werden, egal ob sie an einem noch nicht ver&ouml;ffentlichten
Projekt arbeiten (und jedes Projekt ist f&uuml;r eine lange Zeit &quot;nicht ver&ouml;ffentlicht&quot;,
bevor Du es angek&uuml;ndigt und ver&ouml;ffentlicht siehst), da&szlig; keine Gewinne abwirft
oder ob es sich um ein bereits ver&ouml;ffentlichtes Produkt handelt.
Nachdem das Produkt ver&ouml;ffentlicht ist, m&ouml;chte der Herausgeber die w&auml;hrend der
Entwicklung entstandenen Kosten zur&uuml;ckerhalten. Es dauert eine Weile, bis ein
fertiges Produkt irgendein Einkommen abwirft. Wenn Du also (zum Beispiel)
unser Produkt stiehlst, erhalten wir von Dir kein Geld, auch wenn Du das
Programm magst (Bezahlen der Raubkopierer best&auml;rkt diese nur noch in ihrem
Tun!). Kein Geld f&uuml;r uns bedeutet, da&szlig; wir unsere entstandenen Kosten nicht
zur&uuml;ckerhalten, von einem Gewinn ganz zu schweigen. Und ich denke, da&szlig; niemand
eine Menge Geld und fast ein Jahr (welches wir zusammen mit Krzysztof an der
Version 5 arbeiteten) investiert, einfach zu Deinem Vergn&uuml;gen und ohne
irgeneinen Lohn daf&uuml;r.
Das Erschaffen von Amiga-Software ist unser Weg zu leben. Das Stehlen unserer
Software macht uns zu Verlierern unseres Geldes. Und das k&ouml;nnte uns zwingen,
den (Amiga-)Markt fallen zu lassen, auch wenn die Magazine dem Electronic
Teacher weiterhin so hohe Noten in ihren Testberichten geben (z.B. das
polnische Amiga Magazin vergab 5/5 und ACS 8/10). Es ist sehr angenehm,
da&szlig; die Leute unsere Arbeit w&uuml;rdigen und unsere Software als kaufenswert
einsch&auml;tzen. Aber es w&auml;re besser, wenn sie beginnen w&uuml;rden, unsere Software
zu kaufen, anstelle sie einfach nur als &quot;kaufenswert&quot; einzusch&auml;tzen.
Ohne diese Tatsache wird der Amiga-Markt nicht anfangen zu wachsen (und dies
gilt f&uuml;r jede kommerzielle Software). Der &ouml;konomische Aspekt ist f&uuml;r jedes
Gesch&auml;ft sehr wichtig. Das ist so einfach wie es nunmal ist.</P>

<P><b>AB:</b><BR>

Wird es zuk&uuml;nftig irgendwelche Updates von eTeacher geben?</P>

<P><b>MO:</b><BR>

Unsere ToDo-Liste ist noch ganz gewaltig und es gibt es keinen Zweifel daran,
da&szlig; wir sie wahr machen m&ouml;chten. Zuerst werden die deutschen Anwender das
kostenlose Service-Paket f&uuml;r ihr englisches Grammatik-Handbuch bekommen.
Italienische User werden ein &auml;hnliches Paket f&uuml;r italienische &Uuml;bungen
erhalten. Und die Ver&ouml;ffentlichung der Version 5.3 ist f&uuml;r Mitte Februar
geplant.</P>

<P><b>AB:</b><BR>

Was sind denn die wesentlichen vorgesehenen Verbesserungen?</P>

<P><b>MO:</b><BR>

Das ist ein Geheimnis. Wartet und seht selbst ;-)</P>

<P><b>AB:</b><BR>

Habt Ihr weitere Software-Titel in Entwicklung?</P>

<P><b>MO:</b><BR>

Ja, wir arbeiten auch an einigen weiteren Software-Projekten, mit PalmSuite
als dem derzeit wichtigsten. Die PalmSuite ist ein Paket mit Amiga-Software
zum Anschlu&szlig;, zur Synchronisation und zum Betrieb eines am Amiga angeschlossenen
3COM PalmPilot-Organizer. Der PalmPilot ist der mittlerweile popul&auml;rste
Handheld-Organizer (Taschencomputer) mit &uuml;ber 60% Marktanteil.
Wie jeder moderne Organizer kann der PalmPilot mit seinem Hauptcomputer
zur Datensynchronisierung, zum Aufspielen neuer Software ect. verbunden werden.
Bisher konnten nur PC- und Mac-User die Vorteile der Verbindung mit dem PP
nutzen. Wir planen, dies mit der PalmSuite zu ver&auml;ndern, wozu einige grundlegende
Features der vorhandenen PC- und Mac-Software geh&ouml;ren, die einige einzigartige
und fortschriftliche Dinge erm&ouml;glichen werden. Werft doch mal einen Blick
darauf (auf beides PalmSuite und PalmPilot -&#062; er ist mit einer Motorola
CPU ausgestattet und ist M$[-]CE frei ;-)</P>

<P><b>AB:</b><BR>

Wann k&ouml;nnen wir mit der Ver&ouml;ffentlichung der PalmSuite rechnen?</P>

<P><b>MO:</b><BR>

Wir hoffen sie bis Ende Februar'99 fertigstellen zu k&ouml;nnen. Ich empfehle
jedoch, von Zeit zu Zeit unsere Homepage (<a href="http://amiga.com.pl/">http://amiga.com.pl/</a>) zu
besuchen oder unsere Mailing-Liste f&uuml;r Neuerscheinungen zu abonnieren.</P>

<P><b>AB:</b><BR>

Werden Eure zuk&uuml;nftigen Programme auch Highend-Amiga's mit PPC, Grafikkarte
ect. unterst&uuml;tzen?</P>

<P><b>MO:</b><BR>

Wir finden, eine Grafikkarte, Fast-RAM und schnelle CPU's geh&ouml;ren zur
Standardausstattung eines (ernsthaften) Amiga-Anwenders. Das bedeutet
nicht, da&szlig; wir Euch zwingen m&ouml;chten, eine solche Ausstattung zu besitzen,
weil die Programme es wirklich erfordern. Aber keines unserer Programme
weigert sich, auf entsprechend ausgestatteten Amiga's zu laufen.
Der PPC kann f&uuml;r eine Geschwindigkeitssteigerung sorgen, wenn er f&uuml;r
CPU-intensive Tasks benutzt wird. Aber weder eTeacher noch die PalmSuite
sind prozessor-hungrige Software, soda&szlig; Du keine Vorteile einer speziellen
PPC-Version h&auml;ttest.</P>

<P><b>AB:</b><BR>

Wie denkt Ihr &uuml;ber die Pl&auml;ne von Amiga, Inc. und der nahen Amiga-Zukunft?
Ist die Ver&ouml;ffentlichung von OS 3.5 ein Schritt in die richtige Richtung?</P>

<P><b>MO:</b><BR>

Schwer zu sagen. Es h&auml;ngt davon ab, ob wir 3.5 jemals zu sehen bekommen und
was es beinhaltet. Nach den letzten Ver&ouml;ffentlichungen von AI wie Maus-Pads,
Uhren und anderen &quot;n&uuml;tzlichen&quot; Sachen, habe ich keinen gro&szlig;en Respekt mehr
vor ihnen. Aber glaubt mir, ich w&uuml;rde mich gerne in meiner Meinung t&auml;uschen.
Ich pers&ouml;nlich m&ouml;chte keinerlei mehr solche &quot;Sensationen&quot; sehen, weil es
die Leute nur w&uuml;tend macht. Das gleiche gilt f&uuml;r die &quot;offiziellen Stellungnahmen&quot;
(mit Ausnahme des AI-QNX-B&uuml;ndnisses).</P>

<P><b>AB:</b><BR>

K&ouml;nnen die NG-Amiga's einen ebensolchen Erfolg als die &quot;ultimative Multimedia-
Plattform&quot; haben, wie der A1000 1985?</P>

<P><b>MO:</b><BR>

Wir alle wissen, da&szlig; die gegenw&auml;rtig f&uuml;r andere Plattformen verf&uuml;gbaren
Hardware-L&ouml;sungen weiter fortgeschritten sind als der langsame AGA-Chipsatz.
Aber ich denke, es gibt immer einen Weg, sie zu schlagen, wenn es auch
nicht mehr so leicht sein wird, wie 1985. Ich hoffe, da&szlig; wir die neuen
Amiga's bald zu sehen bekommen (weil &quot;neu&quot; nicht einfach nur bedeutet &quot;mit
neuem Aufkleber an der Frontseite&quot;).</P>

<P><b>AB:</b><BR>

M&ouml;chtest Du zum Schlu&szlig; noch eine allgemeine Aussage an alle eTeacher- und
Amiga-Anwender loswerden?</P>

<P><b>MO:</b><BR>

Ich m&ouml;chte allen Amiga-Anwendern ganz einfach daf&uuml;r danken, da&szlig; sie noch immer
Amiga-User sind. Ich m&ouml;chte allen unseren Kunden und Electronic Teacher - Anwendern
f&uuml;r ihre Unterst&uuml;tzung danken. Und als abschlie&szlig;endes Wort m&ouml;chte ich sagen:
Wenn Du nicht eines Tages Deine Toilette mit einem &quot;Allgemeinen Schutzfehler&quot;
aufgehen sehen willst, dann bleibe bei einer alternativen L&ouml;sung ;-)</P>

<P><b>AB:</b><BR>

Marcin, Danke f&uuml;r das Interview.</P>

<P><DIV ALIGN="Right"><i>-ab- </i></DIV></P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="talk.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="talk.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="talk02.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
