
<html>
<head>
<meta name="description" Content="Amiga Times">
<meta name="author" Content="amigatimes@amigaworld.com">
</head>
<title>AMIGA TIMES</title>
<body background="../pic/bg.gif" bgcolor="#FFFFFF" link="#0000FF" vlink="#800080" alink="#FF0000">

<center>

<IMG SRC="../pic/inhalt.gif" border=0 alt="MAP" width=338 height=48 USEMAP="#inhalt">
<MAP NAME="inhalt">
<AREA SHAPE="rect" COORDS="0,2,56,22" HREF="edit.html" onmouseover="window.status='Editorial';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="57,2,99,22" HREF="aktuell.html" onmouseover="window.status='Aktuell';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="100,2,158,22" HREF="soft.html" onmouseover="window.status='Software';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="159,2,212,22" HREF="game.html" onmouseover="window.status='Spieleteil';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="213,2,268,22" HREF="rubrik.html" onmouseover="window.status='Rubriken';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="269,2,332,22" HREF="talk.html" onmouseover="window.status='Fun und Talk';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="30,24,102,38" HREF="press.html" onmouseover="window.status='Press Relase';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="103,24,167,38" HREF="intern.html" onmouseover="window.status='AT-Intern';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="168,24,241,38" HREF="ende.html" onmouseover="window.status='Schlusswort';return true" onmouseout="window.status=' ';return true">
<AREA SHAPE="rect" COORDS="242,24,309,38" HREF="imp.html" onmouseover="window.status='Impressum';return true" onmouseout="window.status=' ';return true">
</MAP>
<br><img src="../pic/hr.gif" width=540 height=19>
<br><IMG SRC="../pic/fun.gif" BORDER="0" WIDTH="133" HEIGHT="35" ALT="Fun &amp; Talk">
<h3>Petro Tyschtschenko zum NG Amiga und der Zukunft!</h3>
<p>
<img src="../pic/hr1.gif" alt="---" width=415 height=19>
<p>
<table width="75%"><tr><td>





<P>Obwohl wir uns schon in der letzten Ausgabe mit Petro Tyschtschenko unter-
halten hatten, waren die vergangenen beiden Monate sehr Ereignissreich, in
Bezug auf Amiga. Aus diesem Grund haben wir nocheinmal mit ihm gesprochen
und er hatte auch einiges zu sagen, doch lest selber...</P>

<P>AT = Amiga Times/S. Ben Hassine<BR>

PT = Petro Tyschtschenko</P>

<P><b>AT:</b><BR>

Wie sch&auml;tzen Sie selber das TV-Interview bzw. den allgemeinen TV-
Azftritt von Amiga in der WDR Computer Corner ein?</P>

<P><b>PT:</b><BR>

Ich bin garnicht zufrieden gewesen. Erstens war die Vorbereitung von
seitens WDR wirklich st&uuml;mperhaft. Man wollte vom WDR aus, erfahrene 
AMIGIANER mit dem schnellsten AMIGA einladen, aber einen Tag vor der 
Sendung mu&szlig;te ich erfahren das die angesprochenen, alle kurzfristig 
absagten. Man hat mich dann am Nachmittag vor der Sendung gebeten,
mich selbst um Leute zu k&uuml;mmern, die zeigen was so unser AMIGA kann...
Das war viel zu kurzfristig und ich bekam auch nur Absagen, mit Au&szlig;-
nahme des K&ouml;lner Teams. Auch f&uuml;r Herr Sen war die Zeit zu kurz und er
hat es mit seiner Manschaft nicht geschafft &uuml;ber Nacht das System zum
Laufen zu kriegen....Naja, das Ergebnis haben Sie ja gesehen....und 
das man mich nicht zu Wort kommen lie&szlig; und noch was herausgeschnitten
hat.....kam dann noch dazu.</P>

<P><b>AT:</b><BR>

Sind schon jetzt neue TV-Ereignisse geplant?</P>

<P><b>PT:</b><BR>

Ich werde mich weiterhin f&uuml;r Publikationen stark machen, vorallem wenn
jetzt neue Produkte kommen....</P>
 
<P><b>AT:</b><BR>

Herr Tyschtschenko, wie kam es dazu, das Amiga Int, Inc. einen neuen
Pr&auml;sidenten erhalten hat, was war ausschlaggebend ?</P>

<P><b>PT:</b><BR>

Ich meine, es war unbedingt notwendig einen kompetenten Manager &uuml;ber die
beiden AMIGA Firmen zu setzen, der die Politik ma&szlig;geblich beeinflu&szlig;t und
Direktiven gibt. Das war ja schon zu Commodore Zeiten so &uuml;blich. Ich habe
nat&uuml;rlich auch eine ganze Menge dazu beigetragen, um diesen Prozess in 
Gang zu bringen, da, wie Sie wissen in den letzten 24 Monaten von Seiten 
der Entwicklungsabteilung &uuml;berhaupt nichts passiert ist. </P>


<P><b>AT:</b><BR>
Wie weit ist das OS 3.5 fertiggestellt ?</P>

<P><b>PT:</b><BR>

Das OS 3.5 ist jetzt mein Projekt. Ich habe vor vierzehn Tagen endlich
den Vertrag unter Dach und Fach gebracht und Haage &amp; Partner hat ja be-
kanntlich auch schon ohne Vertrag, auf eigenes Risko, vieles entwickelt.
Wir sind vom 11. bis 14 M&auml;rz 99 in St. Louis, USA, und werden dort die 
neue Oberfl&auml;che vorstellen.....Im Juni 1999, soll dann das OS 3.5 in 
den Handel kommen. Preisvorstellung f&uuml;r den Enduser incl. MWST 99.50 DEM.</P>
 
<P><b>AT:</b><BR>

Was macht Amiga OS 5.0 ? Ist man schon sehr weit fortgeschritten ?</P>

<P><b>PT:</b><BR>

AM OS 5.0 arbeitet Dr. Allan Havemose in San Jose. Dort soll die neue
Entwicklungsabteilung beheimatet werden und man ist zur Zeit flei&szlig;ig am
Einstellen. Das OS 5.0 wird wirklich im November 1999 auf dem Markt sein.</P>
 
<P><b>AT:</b><BR>

Wie sieht es mit dem derzeitigen Stand der neuen Amigas aus ?
Wird es schon bald Fotos, Infos etc. dazu geben ?</P>

<P><b>PT:</b><BR>

Wir werden in den n&auml;chsten sechs Monaten eine ganze Reihe von Pressekon-
verenzen abhalten um so die &Ouml;ffentlichkeit &uuml;ber unsere Pl&auml;ne und Aktivi-
t&auml;ten, &uuml;ber die neuen M&ouml;glichkeiten und Perspektiven ausf&uuml;hrlich infor-
mieren. Dann wird es nat&uuml;rlich auch PR Unterlagen geben. </P>

<P><b>AT:</b><BR>

Denken Sie, das es noch dieses Jahr neue Amigas geben wird ? Ger&uuml;chten
zurfolge, soll es ja einen neuen Homecomputer, eine Internet-Maschine, 
wie auch ein Entwicklersystem geben, wenn ja, was werden sie ungef&auml;hr 
kosten?</P>

<P><b>PT:</b><BR>

&Uuml;ber Preise kann man heute noch nicht sprechen. Es wird sicher im Sommer
1999 das OS 3.5 auf den Markt kommen f&uuml;r unsere existierenden Plattform.
Aus USA hat man mir gesagt, da&szlig; die NG im November 99 auf dern Markt 
kommen soll und im September bereits vorgestellt wird. Warten wir es ab.</P>

<P><b>AT:</b><BR>

Was wird sich mit der F&uuml;hrung von Jim Collas &auml;ndern ?</P>

<P><b>PT:</b><BR>

Eine ganze Menge. Wir werden unter seiner Leitung zu einer ganz neuen
Firmenstruktur auflaufen...Unsere Umsatzerwartungen sind enorm und da kann
man nat&uuml;rlich nicht so struktuiert weiter agieren. Es wird einen v&ouml;llig 
neuen Organisationsplan von der Aufbauorganisation her geben. Wir werden zu
einer Gesamtorganisationeinheit verschmolzen, mit Finanz-Personal-Presse-
Marketing-Vertriebs-Entwicklungs-etc. Abteilung. Wir werden in einer ein-
zigen WEBSEITE, die Verantwortung daf&uuml;r wird bei mir liegen, nach au&szlig;en 
agieren. Wir werden agressiv mit Superprodukten den Markt angehen und ich 
bin sicher, AMIGA wird ein tolles comeback haben.... </P>

<P><b>AT:</b><BR>

Ich bedanke mich bei Ihnen f&uuml;r das Interview !</P>

<P><DIV ALIGN="Right"><i>-sbh- </i></DIV></P>

</td></tr></table>
<p>&nbsp;</p>
<img src="../pic/hr.gif" width=540 height=19>
<table width=400>
<tr><td><a href="talk03.html" onmouseover="window.status='zur der vorherigen Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/back.gif" border=0 alt="back" width=41 height=41></a>
</td><td align=center><a href="talk.html" onmouseover="window.status='zum Inhalt';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/i.gif" border=0 alt="inhalt" width=28 height=46></a>
</td><td align=right><a href="press.html" onmouseover="window.status='zur der n&auml;chsten Seite';return true" 
onmouseout="window.status=' ';return true">
<img src="../pic/next.gif" border=0 alt="next" width=41 height=41></a></table>
<img src="../pic/hr.gif" width=540 height=19>
</center>
</body>
</html>
