<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Ajankohtaiset &gt; Uutiset &gt; Uutisia Amiga-maailmasta</title>
		<meta name="keywords" content="www.amiga.com/products/one/">
	</head>

	<body bgcolor="#ffffff" link="#000066" vlink="#000066" alink="red" topmargin="0" marginheight="0">
		<div align="center">
			<a name="TOP"></a><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">[</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="hakemisto.html" target="_self">Ajankohtaiset</a> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">|</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="../sivukartta.html" target="_self">Sivukartta</a> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">]</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
				<br>
			</font><font face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular" size="1">
				<table border="0" cellpadding="2" cellspacing="1" width="80%" bgcolor="navy">
					<tr>
						<td width="100%" bgcolor="navy" align="center"><font color="yellow" size="3" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Uutisia Amiga-maailmasta</b></font></td>
					</tr>
				</table>
			</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">[</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="uutiset.html" target="_self">Amiga nyt</a> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">|</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> </font><font size="1" color="red" face="Trebuchet MS,Verdana,Arial,Helvetica">Uutisia Amiga-maailmasta</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#b0c4de"> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">|</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="laiteuutiset.html" target="_self">Laiteuutiset</a> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">|</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="ohjelmistouutiset.html" target="_self">Ohjelmistouutiset</a> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">|</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"> <a href="paivitykset.html" target="_self">P&auml;ivitykset</a></font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#b0c4de"> </font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4">]</font><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
				<br>
			</font>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font color="black" size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Saku 2001 -tapahtuma 1. syyskuuta Vantaalla</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<font size="1"><br>
							</font><a href="http://saku.amigafin.org/saku2001" target="_blank"><img src="kuvat/webshots/saku_2001.jpg" width="298" height="226" border="0" alt="Saku 2001"></a></div>
						<div align="left">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry. j&auml;rjest&auml;&auml; nelj&auml;nnen Amiga-tapahtumansa, Saku 2001:n, 1. syyskuuta 2001 klo 12 alkaen Tiedekeskus Heurekassa Vantaalla. Pitk&auml;&auml;n odotettu ja toivottu tapahtuma jatkaa yhdistyksen Amiga-tapahtumien kunniakkaita perinteit&auml; tuomalla suomalaisten Amiga-harrastajien ja tapahtumavieraiden n&auml;ht&auml;v&auml;ksi ja koettavaksi tukun sek&auml; uusia ett&auml; uudistuneita Amiga-tuotteita ja nipun ulkomaisia vieraita. Tapahtuma on yhdistyksen uuden hallituksen todellinen tulikaste, ja sen onnistumiseksi tehd&auml;&auml;n hartiavoimin tiimity&ouml;t&auml;. Tavoitteena on tarjota k&auml;vij&ouml;ille ja kutsuvieraille j&auml;lleen korkealaatuinen tapahtuma, jonne kannattaa tulla kauempaakin.</font></p>
						</div>
						<div align="center">
							<p><a href="http://www.cloanto.com" target="_blank"><img src="kuvat/webshots/cloanto.jpg" width="298" height="242" border="0" alt=" "></a></p>
						</div>
						<div align="left">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amigan varatoimitusjohtaja Fleecy Moss saapuu tapahtumaan esittelem&auml;&auml;n Amigan uutuustuotteita, kuten AmigaDE:t&auml;. </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Cloanton johtaja Michael C. Battilana esittelee Amiga Foreverin ja Amiga Explorerin uusimpia versioita. My&ouml;s Amiga on havainnut emulaattoreiden suosion ja julkaisee oman Amithlon-emulaationsa t&auml;m&auml;n vuoden lopulla. Amiga Forever on yksi ensimm&auml;isist&auml; mutta my&ouml;s parhaista valmiista paketeista Classic Amigan emuloimiseen, ja Amiga Explorer -tiedostonhallintasovellus tekee resurssien jakamisen Amigan ja PC:n v&auml;lill&auml; todella helpoksi.</font></p>
						</div>
						<div align="center">
							<p><a href="http://www.elbox.com" target="_blank"><img src="kuvat/webshots/elbox.jpg" width="303" height="226" border="0" alt=" "></a></p>
						</div>
						<div align="left">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">My&ouml;s Amigan PCI-v&auml;yl&auml;korttiratkaisut ovat n&auml;ytt&auml;v&auml;sti esill&auml; tapahtumassa. Ensimm&auml;inen markkinoille tullut Elbox Computerin Mediator-PCI-v&auml;yl&auml;kortti Amiga 1200 -koneille on n&auml;ht&auml;v&auml;n&auml; Voodoo3-n&auml;ytt&ouml;kortin ja PCI-&auml;&auml;nikortin kera. Matayn edustaja esittelee ensimm&auml;ist&auml; ZorroIII-v&auml;yl&auml;isille Amigoille tarkoitettua PCI-v&auml;yl&auml;korttia, Prometheusta. Puolalainen Matay Company on yksi Amiga Inc.:n tuoreimmista yhteisty&ouml;kumppaneista, ja Prometheus on ollut olennaisen t&auml;rke&auml; osa Amiga OS 4:n kehitysty&ouml;ss&auml; AmigaOnen valmistumista odotellessa.</font></p>
						</div>
						<div align="center">
							<p><a href="http://www.novadesign.com" target="_blank"><img src="kuvat/webshots/novadesign.gif" width="298" height="242" border="0"></a></p>
						</div>
						<div align="left">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Nova Design on lahjoittanut laadukkaiden grafiikkaohjelmistojensa, ImageFX:n ja Aladdin 4D:n, tuoreet versiot kokeiltavaksi tapahtumassa. My&ouml;s suomalainen Amiga-j&auml;lleenmyyj&auml; Gentle Eye Ky tuotteineen on paikalla. Muita esittelyj&auml; ja kilpailuja suunnitellaan.<br>
									<br>
									Tapahtuma alkaa kello 12 ja p&auml;&auml;ttyy kello 18. Sis&auml;&auml;np&auml;&auml;sy on ilmainen. Tapahtuman kotisivuilla on viimeisimm&auml;t tiedot tapahtuman ohjelmasta, saapumisohjeet ja muuta t&auml;rke&auml;&auml; informaatiota niin vierailijoille kuin n&auml;ytteilleasettajillekin. Tapahtumap&auml;iv&auml;n&auml; sivuilla voi seurata kahta web-kameraa. Suunnitelmissa on lis&auml;ksi IRC-kanava.<br>
									<br>
									&gt; <a href="http://saku.amigafin.org/saku2001" target="_blank">Saku 2001 -sivusto</a><br>
								</font></p>
						</div>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font color="black" size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Amiga julkisti tuoteaikatauluja AmiWest 2001 -tapahtumassa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<br>
							<a href="http://www.sacc.com/amiwest/" target="_blank"><img src="kuvat/awlogo2001.jpg" width="300" height="69" border="0"><br>
								<br>
							</a></div>
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Sacramentossa Kaliforniassa j&auml;rjestetyill&auml; AmiWest 2001 -messuilla Amiga rikkoi kes&auml;n hiljaisuuden kertomalla lis&auml;&auml; tulevista tuotteistaan ja niiden aikataulusta. Joukossa oli my&ouml;s muutama kohua her&auml;tt&auml;nyt julkistus, joista on riitt&auml;nyt keskusteltavaa Internetin eri foorumeissa. Seuraavat tuotteet julkaistaan t&auml;m&auml;n vuoden viimeisen nelj&auml;nneksen aikana.<br>
								<br>
							</font>
							<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">AmigaOne-PowerPC-tietokone</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099"><br>
									</font></b>AmigaOne perustuu Amiga Inc.:n julkaisemiin Zico-spesifikaatioihin, ja sen valmistaa Eyetech Group Ltd. Kyseess&auml; on ensimm&auml;inen aidosti uusi Amiga-laitteisto yli kuuteen vuoteen, ja AmigaOnea pidet&auml;&auml;n yrityksen uutena lippulaivana. Ainakin yritys itse odottaa koneelta paljon. Kes&auml;ll&auml; kahden viikon verran livennytt&auml; aikataulua on saatu kurottua viikon verran kiinni, ja urakka l&auml;hestyy viimeisi&auml; vaiheitaan. B-version emolevyt ovat jo toimivia PCI- ja AGP-v&auml;ylineen, ja seuraava vaihe on emolevyjen ja prosessorikorttien yhteensovittaminen. Amiga OS 4 -ty&ouml;ryhm&auml; saa valmiit emolevyt k&auml;ytt&ouml;&ouml;ns&auml; tulevalla viikolla Amiga OS 4:n viimeistely&auml; varten. <b><font color="#000099"><br>
										<br>
									</font></b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Lis&auml;tietoja:<br>
								</b><a href="http://www.eyetech.co.uk/amigaone/" target="_blank">www.eyetech.co.uk/amigaone/</a><br>
								<a href="http://www.amiga.com/products/one/" target="_blank">www.amiga.com/products/one/</a><br>
								<br>
							</font>
							<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">Amiga OS 4.0 -PPC-k&auml;ytt&ouml;j&auml;rjestelm&auml;</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099"><br>
									</font></b>Amiga OS 4.0 on Amiga Inc.:n, hein&auml;kuussa julkistetun yhteisty&ouml;kumppani Haage &amp; Partnerin ja Hyperion Softwaren yhteisprojekti. H&amp;P porttaa t&auml;rkeimm&auml;t osat k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml; uuteen PPC-k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n, ja Hyperion Software huolehtii k&auml;ytt&ouml;j&auml;rjestelm&auml;n 3D- ja Mesa-3D-grafiikkakirjastoista. Ainoastaan Eyetechin AmigaOnessa py&ouml;riv&auml; OS 4.0 etenee koko ajan. Paljon kehitysty&ouml;t&auml; on tehty mm. A3000- ja A4000-koneilla, joissa on Matayn Prometheus-PCI-v&auml;yl&auml;kortti, CyberStormPPC-turbo sek&auml; H&amp;P:n StormC v4, ja siksi kehitysty&ouml;t&auml; on voitu koko ajan jatkaa, vaikka varsinaisia AmigaOne-emolevyj&auml; ei viel&auml; olekaan ollut saatavana.<br>
								<br>
								Uusi tiedostoj&auml;rjestelm&auml; ja TCP/IP-pinon ydin valmistuivat kaksi viikkoa sitten. 68k-emulaatiota hienos&auml;&auml;det&auml;&auml;n, ja uutta Amigan PCI-kirjastoa muokataan Eyetechin AmigaOnen PCI-v&auml;yli&auml; varten. RTG-j&auml;rjestelm&auml;&auml; kehitet&auml;&auml;n t&auml;ysin PPC-yhteensopivaksi kunnollisen 2D- ja 3D-suorituskyvyn takaamiseksi. Voodoo3-ajurit ovat valmiina, ja Matroxin G450-ajurit ovat ty&ouml;n alla, mink&auml; j&auml;lkeen my&ouml;s uusi G550 saa omat ajurit. Vaikka 68k-tuki s&auml;ilyykin k&auml;ytt&ouml;j&auml;rjestelm&auml;ss&auml; aina versioon 4.5 saakka, ensimm&auml;iset PPC:lle portatut kirjastot pyrkiv&auml;t varmistamaan, ett&auml; kaikki tulevat OS-versiot ovat vakaampia, toimivampia ja nopeampia. Ruutukaappauksia ja testituloksia on luvassa mahdollisimman pian.</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
								<br>
								&gt; <a href="http://www.haage-partner.com/" target="_blank">Haage &amp; Partner</a><br>
								&gt;&nbsp;<a href="http://www.hyperion-software.com/" target="_blank">Hyperion Software</a><br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
							</font>
							<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">Amiga x86, koodinimi Amithlon</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099"><br>
									</font></b>T&auml;m&auml; julkistus aiheutti kaikkein eniten h&auml;mm&auml;styst&auml; ja kiivastakin keskustelua Amigan uudesta suunnasta. Tapahtumassa nimitt&auml;in demonstroitiin x86-pohjaista 68k-emulaattorin prototyyppi&auml; Amiga OS 3.x:lle. T&auml;m&auml; koodinimell&auml; Amithlon kulkeva emulaattori tarjoaa vain RTG-yhteensopivuuden (eli se ei esimerkiksi emuloi AGAa), ja se on tarkoitettu ensimm&auml;iseksi askeleeksi x86-j&auml;rjestelmist&auml; kohti AmigaOnea. Amithlon k&auml;ynnistyy CD:lt&auml; l&auml;hes miss&auml; tahansa x86-kannettavassa tai PC-p&ouml;yt&auml;koneessa. Se kykenee my&ouml;s ajamaan suurinta osaa RTG-ohjelmista paljon Amigan 060-prosessoria nopeammin. Amigan mukaan monet kehitt&auml;j&auml;t kokeilivat tapahtumassa sovelluksiaan Amithlonissa ja totesivat niiden py&ouml;riv&auml;n paljon nopeammin kuin 060-Amigassa. Amithlonia kehitt&auml;v&auml;t Harald Frank ja Bernie Meyer.<br>
								<br>
								Kaiken Amithlonista nousseen kohun ja v&auml;&auml;rink&auml;sitysten vuoksi Amiga on joutunut tarkentamaan syit&auml;&auml;n sen julkistamiseen. Commodoren konkurssin j&auml;lkeen moni amigisti siirtyi PC:lle. Erilaisten emulaattorien nykysuosio kertoo siit&auml;, ett&auml; moni haluaisi py&ouml;ritt&auml;&auml; vanhoja suovelluksia uudella laitteistolla. Amithlon on suunnattu PC:n omistajille, jotta he saisivat mahdollisuuden tutustua uudempaan Amiga OS:iin ja ajaa vanhoja sovelluksia ilman t&auml;ysin uuteen laitteistoon sijoittamisen riski&auml;.<br>
								<br>
								Amithlon on tarkoitettu astinlaudaksi kohti AmigaOnea ja sen natiivia k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml; uusine sovelluksineen, ei niiden kilpailijaksi tai korvaamaan Amiga OS:i&auml;. Amithlon ei ole Amiga OS -porttaus eik&auml; sellaista suunnitella. Amithlon ajaa vain 3.x-versioita k&auml;ytt&ouml;j&auml;rjestelm&auml;st&auml;, 4.0 tulee ainoastaan PPC-natiivina, ja emulaatio j&auml;&auml; tarpeettomaksi sek&auml; PPC- ett&auml; x86-yhteensopivan 5.0:n my&ouml;t&auml;. Amithlon on siis tarkoitettu vain houkuttelemaan PC-k&auml;ytt&auml;jist&auml; potentiaalisia AmigaOne-k&auml;ytt&auml;ji&auml;, tuomaan k&auml;ytt&auml;ji&auml; menneisyydest&auml; tulevaisuuteen. Tarkempaa tietoa Amithlonista on luvattu julkistaa my&ouml;hemmin.<br>
								<br>
								&gt; <a href="http://byron.csse.monash.edu.au/amithlon.html" target="_blank">Ep&auml;virallinen Amithlon FAQ</a><br>
								<br>
							</font>
							<table border="0" cellpadding="3" cellspacing="0" width="100%" bgcolor="#fff8dc">
								<tr>
									<td bgcolor="#f0f8ff">
										<div align="center">
											<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099">AmigaDE 1.0 ja Series Zero -pelipaketti</font></b></font></div>
									</td>
								</tr>
							</table>
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b><font color="#000099"><br>
									</font></b>Tao Groupin Elate/Intentiin perustuvaa AmigaDE 1.0:aa ohjelmoi yli 30 ohjelmoijaa ymp&auml;ri maailmaa Amiga Inc.:n alaisuudessa. Sis&auml;ll&ouml;ntuottajiksi on rekister&ouml;iytynyt yli 3000 kehitt&auml;j&auml;&auml;, jotka suunnittelevat sis&auml;lt&ouml;&auml; digitaalilaitteisiin kuten k&auml;nnyk&ouml;ihin, PDA-laitteisiin (Personal Digital Assistant), k&auml;mmentietokoneisiin ja my&ouml;s p&ouml;yt&auml;tietokoneisiin - miss&auml; vain AmigaDE 1.0 py&ouml;rii. Ensimm&auml;inen pelipaketti, nimelt&auml;&auml;n Series Zero, julkaistaan Sharpille k&auml;ytett&auml;v&auml;ksi Zaurus-k&auml;mmentietokoneissa. Pelej&auml; on viisi: Batty (tekij&auml; Titan Computer), Boxikon (e.p.i.c. interactive gmbh), Convex (Zeoneo), Linea (Titan Computer) ja Solitaire (John Harris).<br>
								<br>
								&gt; <a href="http://www.amiga.com/corporate/080101-amiwest.shtml" target="_blank">Amigan AmiWest-raportti</a><br>
								&gt; <a href="http://www.amigazone.com/images/amiwest2001/" target="_blank">Harv Laserin AmiWest-kuvaraportti</a></font></div>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>e.p.i.c. interactive AmigaDE-sis&auml;ll&ouml;ntuottajaksi</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">e.p.i.c. interactive entertainment </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">on uusin AmigaDE:n sis&auml;ll&ouml;ntuottaja. Alkuvaiheessa pelej&auml; julkaistaan PDA-laitteille kuten Sharpin Zaurukselle. Ensimm&auml;iset julkasitavat DE-pelit ovat Boxicon, Piles O' Tiles ja Pegger, jotka kaikki ovat puzzle-pelej&auml;. Jatkossa on tarkoitus julkaista puzzle-pelien lis&auml;ksi esim. korttipelej&auml;, toiminta-ammuskeluja ja urheilupelej&auml;.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuodesta 1996 Amigan pelimarkkinoilla vaikuttaneen e.p.i.c.:in tunnetuimmat pelit ovat Sixth Sense Investigations (ks. <a href="http://batman.jypoly.fi/~saku/lehti/online/30/index.html" target="_blank">Saku #30</a>) ja Virtual GP (ks. <a href="http://batman.jypoly.fi/~saku/lehti/online/34/index.html" target="_blank">Saku #34</a>). Omien pelien lis&auml;ksi e.p.i.c. on my&ouml;s k&auml;&auml;nt&auml;nyt monia hyvi&auml; pelej&auml; muilta koneilta, esimerkkein&auml; Simon the Sorcerer II ja Earth 2140 (ks. <a href="http://batman.jypoly.fi/~saku/lehti/online/36/index.html" target="_blank">Saku #36</a>).<br>
							<br>
							&gt; <a href="http://www.epic-interactive.com" target="_blank">e.p.i.c. interactive</a><br>
							&gt; <a href="http://www.amiga.com/corporate/080601-epic.shtml" target="_blank">Amigan lehdist&ouml;tiedote</a></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>My&ouml;s Edivision LLC tuottamaan DE-pelej&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Toukokuussa perustettu Edivision LLC aikoo julkaista tulevan vuoden aikana ainakin kolme peli&auml; AmigaDE-k&auml;ytt&ouml;ymp&auml;rist&ouml;&ouml;n</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">. Alkuvaiheessa yritys keskittyy julkaisemaan omia pelej&auml;&auml;n, mutta k&auml;y neuvotteluja my&ouml;s muiden tuottajien kanssa niiden pelien k&auml;&auml;nt&auml;misest&auml; AmigaDE:lle.<br>
							<br>
							Yhti&ouml;n perustajat ovat kaikki tietokonepelien vetereaaneja. Patrick Roberts on tehnyt mm. Dinosaur-elokuvaan 2D- ja 3D- tehosteita sek&auml; paljon grafiikkaa ja ohjelmistoja Disneylle. Jeremy Engelmanin on taitava 3D-artisti ja oli vastuussa mm. Riven-pelin grafiikasta (Cyan-pelifirman julkaisema Mystin jatko-osa). Steven Haun taas on palkittu tietokonegraafikko, jolla on yli 10 vuoden kokemus alalta yhti&ouml;iden kuten Warner Brothers, Universal Pictures, ABC, CBS ja Fox Television kanssa.<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
							
							&gt; <a href="http://www.e-d-i-v-i-s-i-o-n.com " target="_blank">Edivision</a><br>
							
							&gt; <a href="http://www.amiga.com/corporate/071601-edivision.shtml" target="_blank">Amigan lehdist&ouml;tiedote</a></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Sharp demonstroi AmigaDE:t&auml; Tokiossa</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Toukokuun lopulla Tokiossa pidetyill&auml; Business Show 2000 -messuilla oli esill&auml; my&ouml;s AmigaDE. Sharp demonstroi AmigaDE:t&auml; ensimm&auml;ist&auml; kertaa Zaurus-k&auml;mmenmikrossaan tapahtumassa, jossa k&auml;vi avajaisp&auml;iv&auml;n&auml; arviolta yli 60 000 vierasta. &quot;Amiga uskoo, ett&auml; Zaurukselle ja my&ouml;s Sharpin tuleville k&auml;mmenmikroille tehdyill&auml; sovelluksilla on edess&auml;&auml;n erinomainen tulevaisuus&quot;, Amigan johtaja Bill McEwen sanoi. Nelip&auml;iv&auml;isille messuille odotettiin kaiken kaikkiaan noin 400 000 vierailijaa.<br>
							<br>
							&gt; <a href="http://www.amiga.com/corporate/052201-sharp.shtml" target="_blank">Uutinen ja kuvia Amigan kotisivulla</a></font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font color="black" size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Amiga ja Tao Group yhdess&auml; tukemaan OCPA:ta</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="left">
							<font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">Amiga Inc., Tao Group, Sharp, JVC&nbsp;ja Kyocera ovat yhdess&auml; julkistaneet tukensa Open Content Platform Associationille (OCPA), joka t&auml;ht&auml;&auml; joustavien ja avointen ymp&auml;rist&ouml;jen kehitt&auml;miseen, niin ett&auml; siit&auml; olisi etua laitteistomyyjille ja sis&auml;ll&ouml;nkehitt&auml;jille. Amigan developer-yhteis&ouml; on suurin ja kokenein ryhm&auml; sovellusten luomisessa Taon Intent-alustalle ja tunnetaan alalla erityisesti kiehtovien multimediasovellusten kehitt&auml;misest&auml;. Amiga tekee jo yhteisty&ouml;t&auml; useiden Taon yhteisty&ouml;kumppaneiden kanssa pelien ja tuotantosovellusten kehitt&auml;miseksi Intentille.<br>
									<br>
									&quot;Intent-alustan standardisointi helpottaa Amigan kehitysyhteis&ouml;&auml; suuntaamaan hyvin laajaan valikoimaan laitteita&quot;, sanoo Amigan johtaja Bill McEwen. &quot;Kokemuksemme Intentist&auml; on osoittanut ett&auml; se on erinomainen alusta multimediasovellusten rakentamiseen. Meill&auml; on yli 18 kuukauden kokemus Intentill&auml; toimivien sovellusten luomisessa, ja odotamme todella yhteisty&ouml;t&auml; OCPA:n kanssa </font></font><font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">p&auml;&auml;st&auml;ksemme jakamaan kokemuksemme heid&auml;n kanssaan</font></font><font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">.&nbsp;&quot;Amiga on ollut erinomainen yhteisty&ouml;kumppani maailmanlaajuisen kehitysyhteis&ouml;n kanssa, joka voi hy&ouml;ty&auml; t&auml;st&auml; sopimuksesta paljon&quot;, sanoo Tao Groupin puheenjohtaja Francis Chang. &quot;Amigan panos on arvokas OCPA:n j&auml;senille, ja otamme yhteisty&ouml;n vastaan mielell&auml;mme.&quot;<br>
									<br>
									Amiga tarjoaa kehitt&auml;jille joukon ohjelmia ja tuotteita sovellusten tekemiseen. Amiga SDK tarjoaa kehitysymp&auml;rist&ouml;n ja -ty&ouml;kalut. Amiga Support Network tarjoaa kehitt&auml;jille keskustelufoorumin, postituslistan ja muita infrastruktuureja yhteisty&ouml;n helpottamiseksi. Amiga on my&ouml;s allekirjoittanut Sharpin kanssa levityssopimuksen, joka mahdollistaa Amigan-kehitt&auml;jien tuottaman sis&auml;ll&ouml;n levitt&auml;misen Sharp Space Townissa. Space Town v&auml;litt&auml;&auml; sovelluksia ja muuta sis&auml;lt&ouml;&auml; Sharpin Zaurus-k&auml;mmenmikrolle ja muille Sharpin PDA-laitteille.</font></font> <font size="1"><br>
							</font>
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&gt; <a href="http://www.amiga.com/products/SDK.shtml" target="_blank">Amiga SDK<br>
									</a></font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">&gt; <a href="http://www.amigadev.net" target="_blank">Amiga Support Network<br>
									</a>&gt; <a href="http://www.spacetown.ne.jp/" target="_blank">Sharp&nbsp;Space Town</a> (japaninkielinen)</font></p>
						</div>
					</td>
				</tr>
			</table>
			<font size="1"><br>
			</font>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font color="black" size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Amiga-messuja j&auml;lkeen Sakun</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vaikka oma Saku 2001 -tapahtumamme on vasta edess&auml;p&auml;in, on muistettava ett&auml; my&ouml;s muualla Euroopassa j&auml;rjestet&auml;&auml;n Amiga-tapahtumia. L&auml;hinn&auml; kiinnostavimmat lienev&auml;t Saksan ja Englannin tapahtumat.<br>
						</font>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><a href="http://www.amiga-messe.de" target="_blank"><img src="kuvat/webshots/amiga_messe_de.jpg" width="298" height="225" border="0"></a></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga World 2001 -messut j&auml;rjestet&auml;&auml;n 20.-22. syyskuuta K&ouml;lniss&auml; yht&auml; aikaa ja samoissa tiloissa Macintoshin Maxpo-messujen kanssa. Tapahtuman ohjelmasta ei viel&auml; ole lainkaan tarkempaa tietoa, mutta sivuston mukaan j&auml;rjest&auml;j&auml;t k&auml;yv&auml;t neuvotteluja tunnettujen laite- ja ohjelmistovalmistajien kanssa. Kannattaa siis seurata tapahtumasivustoa.</font></p>
						<div align="center">
							<p><a href="http://www.worldofamiga.com" target="_blank"><img src="kuvat/webshots/world_of_amiga.gif" width="298" height="241" border="0"></a></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">My&ouml;s Englannin Brentwoodissa, Essexiss&auml; lauantaina 3. marraskuuta j&auml;rjestett&auml;v&auml; World of Amiga South East Show mainostaa saavansa Fleecy Mossin vieraakseen. Tapahtumaa sponsoroi AmigActive-lehti, lis&auml;ksi n&auml;ytteilleasettajina ovat ainakin Eyetech, Fore-Matt Home Computing, Kicksoft, Analogic, 100%Amiga ja Blittersoft, ja lis&auml;&auml;kin kuulemma on luvassa.</font></font></p>
					</td>
				</tr>
			</table>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="1"><br>
			</font>
			<table border="0" cellpadding="3" cellspacing="1" width="80%" bgcolor="#4682b4">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center">
						<center>
							<font color="black" face="Times New Roman,Georgia,Times"><b>
									<table border="0" cellpadding="0" cellspacing="0" height="20" align="right">
										<tr>
											<td><a href="#TOP" target="_self" title="Alkuun"><img height="14" width="15" src="kuvat/top.gif" border="0" alt="alkuun"></a></td>
										</tr>
									</table>
								</b></font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Kaliko etsii koodereita ja graafikkoja riveihins&auml;</b></font></center>
					</td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<br>
							<a href="http://www.kaliko.net" target="_blank"><img src="kuvat/webshots/kaliko_net.gif" width="298" height="210" border="0"></a></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uusi pelifirma Kaliko etsii riveihins&auml; lahjakkaita ihmisi&auml;, etenkin koodereita ja graafikkoja. Tarkoituksena on kehitt&auml;&auml; laadukkaita pelej&auml; Amigalle, AmigaDE:lle ja muille alustoile. Ensimm&auml;ist&auml; peli&auml; lupaillaan julkisuuteen jo parin viikon sis&auml;ll&auml;, ja k&auml;ynniss&auml; on useita muita projekteja, kertoo yrityksen edustaja Fredrik Schultz ja pyyt&auml;&auml; kiinnostuneita ottamaan yhteytt&auml; h&auml;neen s&auml;hk&ouml;postitse.<br>
								<br>
								&gt; <a href="http://www.kaliko.net" target="_blank">Kalikon kotisivu<br>
								</a>&gt; <a href="mailto:fredrik@kaliko.net">S&auml;hk&ouml;postia Fredrik Schultzille</a></font></p>
					</td>
				</tr>
			</table>
			<br>
			<font face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4" size="1">[</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="1"> <a href="#TOP" target="_self">Sivun alkuun</a> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4" size="1">|</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="1"> <a href="hakemisto.html" target="_self">Ajankohtaiset</a> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4" size="1">|</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="1"> <a href="../sivukartta.html" target="_self">Sivukartta</a> </font><font face="Trebuchet MS,Verdana,Arial,Helvetica" color="#4682b4" size="1">]<br>
				<br>
			</font></div>
	</body>

</html>