<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Assembly 2001</b></font></td>
				</tr>
				<tr height="15">
					<p>
						<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Teksti ja kuvat:&nbsp;Risto M&auml;ki-Pet&auml;ys<br>
								Ruutukaappaukset: Risto Kivisilta</font></td>
					</p>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Avajaiset</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AssemblyTV:n l&auml;hetyst&auml; seuranneena pahin ruuhka sis&auml;&auml;np&auml;in n&auml;ytti tapahtuneen kello kahdentoista ja yhden v&auml;lill&auml; keskip&auml;iv&auml;ll&auml;. Tunnin sis&auml;ll&auml; halli olikin t&auml;ynn&auml; koneita, eik&auml; liikennett&auml; sen j&auml;lkeen ollut paljoakaan. T&auml;ll&auml; kertaa konepaikat oli jaettu kolmeen alueeseen: mainstream, game heaven ja oldskool. Kuten edellisen&auml; vuonna, oldskoolilaiset saivat lippunsa puolta halvemmalla ja olivat oikeutettuja yli nelinkertaiseen &auml;&auml;nestysvoimaan muihin n&auml;hden. He saivat my&ouml;s olla omassa rauhaisessa nurkkauksessaan, joka t&auml;ll&auml; kertaa sijaitsi kolmannessa kerroksessa, yl&auml;katsomon takana.</font></p>
						<div align="center">
							<p><img src="kuvat/asm02.jpg" width="341" height="256" border="0" alt=" "><br>
								<font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2"><i>P&ouml;yt&auml;rivist&ouml;&auml; oldskool-alueelta.</i></font></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;ll&auml; kertaa saimme juhlistaa kymmenensi&auml; Assembly-messuja. Sen kunniaksi tilaisuus avattiin koosteella eri Assemblyjen voittajademoista PC- ja Amiga-sarjoista, ja tapahtumaa juontanut Jussi &quot;Abyss&quot; Laakkonen oli pukeutunut ensimm&auml;isen&auml; p&auml;iv&auml;n&auml; Assembly'92-paitaan. Juhlan kunniaksi n&auml;ytettiin my&ouml;s Assembly'92:n demot sek&auml; scene-visa. Ensimm&auml;isen&auml; p&auml;iv&auml;n&auml; ei paljoa muuta ohjelmaa tullut, joten ty&ouml;t&auml; tekev&auml;n&auml; kansalaisena jouduin j&auml;tt&auml;m&auml;&auml;n torstaiy&ouml;n sek&auml; perjantaiaamun v&auml;liin.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Toteutus</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ensinn&auml;kin AssemblyTV:n televisio- ja verkkol&auml;hetysten piti alkaa jo tapahtuman alkaessa, mutta niit&auml; viiv&auml;stettiin kaksi kertaa tunnilla. Alkupuolella l&auml;hetykset py&ouml;riv&auml;t suhteellisen nopeasti, vaikka ohjelman avaus ei aina onnistunut, ja l&auml;hetys katkeili. My&ouml;hemmin laatua pudotettiin jatkuvasti, kunnes se oli lopuksi nykiv&auml;&auml;, varsin sumeaa m&ouml;ss&ouml;&auml;. T&auml;m&auml; johtui todenn&auml;k&ouml;isesti kuormituksesta, mutta ihmettelen ainakin itse, miksi kankaalla esitetty kuva oli aivan kontrastiton. Surureunoineen kuva n&auml;ytti suoraan kankaalta kuvatulta, ja v&auml;list&auml; kirkkaustason vaihtelu v&auml;&auml;risti mustan vaaleanharmaaksi. &Auml;&auml;ni pysyi kohtalaisena, mutta kilpailutuotosten katselu verkon yli oli varsin tuskastuttavaa eik&auml; edes kovin palkitsevaa.</font></p>
						<div align="center">
							<p><img src="kuvat/asm03.jpg" width="233" height="279" border="0" alt=" "><br>
								<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i>Sponsorit jakelivat tuttuun tyyliin sekalaista rihkamaa.</i></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Paikan p&auml;&auml;ll&auml; asiat toimivat melko hyvin, mutta &auml;&auml;nen stereokuva tuntui ainakin oldskool-alueella painottuvan hieman oikealle p&auml;in. Voimakkuus kyseisell&auml; alueella oli p&auml;&auml;osin sopiva eik&auml; vihlonut korvia. Esitykset eiv&auml;t t&auml;ll&auml; kertaa en&auml;&auml; my&ouml;h&auml;styneet niin pahasti kuin viime vuosina on ollut tapana. Kuitenkin flash-kisassa j&auml;rjest&auml;minen oli jotenkin ep&auml;onnistunut, ja joissain tuotoksissa musiikki py&ouml;ri t&auml;ysin ep&auml;tahdissa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Paikalla oli edelleen sama tuttu turvavartijavalikoima, joka hy&ouml;kk&auml;&auml; innostuneesti jokaisen kulkijan kassien kimppuun sek&auml; tekee v&auml;ltt&auml;m&auml;tt&ouml;m&auml;t vartalon tarkistukset. Onneksi he t&auml;ll&auml; kertaa sent&auml;&auml;n pakkasivat tavaroita takaisin laukkuun itse tai edes auttoivat siin&auml;.</font></p>
						<div align="center">
							<p><i><img src="kuvat/asm04.jpg" width="192" height="256" border="0" alt=" "><br>
									<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtumassa n&auml;kee kaikenlaisia kulttihenkil&ouml;it&auml;, kuvassa<br>
										#AmigaFIN-kanavan el&auml;v&auml;n&auml; harvinainen n&auml;ht&auml;vyys Werre.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;ll&auml; kertaa jouduin j&auml;&auml;m&auml;&auml;n ilman p&ouml;yt&auml;paikkaa my&ouml;h&auml;styneen ilmoittautumisen takia eli jouduin etsim&auml;&auml;n kannettavalle koneelle p&ouml;yt&auml;tilaa ja verkkopistoketta v&auml;h&auml;n v&auml;li&auml; uudestaan. Kaiken kukkuraksi kone ei monesti edes tunnistanut verkkoyhteytt&auml; oikein eik&auml; p&auml;&auml;ssyt verkkoon lainkaan. Oletan t&auml;m&auml;n johtuneen kaapeleista tai kytkimen tai verkon ongelmista. T&auml;m&auml;n vuoksi jouduin verkon takia matkustelemaan ulos paikalta, mutta &auml;&auml;nestys toimi vain paikallisverkosta. Sonera oli j&auml;rjest&auml;nyt tapahtumaa varten yhden gigabitin sekuntivauhdilla toimivan verkkokaapelin, mutta silti yhteydet olivat v&auml;h&auml;n v&auml;li&auml; hyvinkin tukossa, ja etenkin &auml;&auml;nestyspalvelin oli loppupuolella kuin t&auml;i tervassa. Onneksi &auml;&auml;nestysaikaa pidennettiin, ja &auml;&auml;net meniv&auml;t perille.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapahtumat</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<p><br>
								<img src="kuvat/asm10.jpg" width="307" height="201" border="0"><br>
								<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Alternative Partyn j&auml;rjest&auml;j&auml;t kasasivat<br>
										melkoisen kasan tavaraa omalle p&ouml;yt&auml;rivilleen.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Moni varmasti muistaa viime vuonna meteli&auml; pit&auml;neen Alternative Party -j&auml;rjest&auml;j&auml;porukan mielenosoituksen aulassa. Herrat olivat sit&auml; mielt&auml;, ett&auml; Assembly haiskahtaa kapitalismilta, ja he halusivat mm. oikeutta MSX:lle. T&auml;ll&auml; kertaa porukalle oli j&auml;rjestetty oma p&ouml;yt&auml;rivi oldskool-alueen nurkasta. Arvelun varaan j&auml;&auml;, oliko kyseisell&auml; tapahtumalla vaikutusta asiaan. Tuttuun tapaan katsomoitten yl&auml;riveilt&auml; kuului typeri&auml; huutoja kisojen alussa ja keskell&auml;; huudot viel&auml; ik&auml;v&auml; kyll&auml; vaikuttivat tulevan katkeralta oldskool-v&auml;est&ouml;lt&auml;, joille on valituksista johtuen my&ouml;nnetty j&auml;senetuja muihin vieraisiin n&auml;hden.</font></p>
						<div align="center">
							<p><img src="kuvat/asm06.jpg" width="327" height="204" border="0" alt=" "><br>
								<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">#AmigaFIN-kanavan porukka j&auml;rjesti ulkoilmassa kokoontumisen.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Perjantai-iltana j&auml;rjestettiin my&ouml;s jo legendaariseksi muodostunut #AmigaFIN-kokoontuminen juuri ja juuri sopivasti esitysten v&auml;liss&auml;. Kokoontumisessa ehdittiin j&auml;rjest&auml;&auml; kovalevyn heittokisat. Pahaksi onnekseen osa finaaliin p&auml;&auml;sseist&auml; kerkesi jo poistua paikalta ennen finaalia, mink&auml; johdosta tulosten merkitt&auml;vyys meni hieman kyseenalaiseksi.</font></p>
						<div align="center">
							<p><img src="kuvat/asm07.jpg" width="200" height="226" border="0"><br>
								<i><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">#AmigaFIN-kanavan kokoontumisessa<br>
										j&auml;rjestetyn kiintolevyn heittokisan kilpailuv&auml;lineet.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kisojen m&auml;&auml;r&auml;&auml; oli tiivisettty edellisist&auml; vuosista. Kuten edellisen&auml; vuonna, Amiga- ja PC-demot ja -introt kilpailivat samassa sarjassa. Nyt mukana olivat viel&auml; java-tuotokset. Konsoli- ja oldskool-demot luettiin viel&auml; eri ryhmiin. Aluksi pelotti, ett&auml; taso olisi laskenut viime vuodesta, mutta kehnous j&auml;i enemm&auml;nkin oldskool-tuotosten rasitteeksi. T&auml;ll&auml; kertaa C64-demot eiv&auml;t olleet erityisen kekseli&auml;it&auml;, ja p&auml;&auml;paino olikin VIC-20- sek&auml; MSX-koneilla.</font></p>
						<div align="center">
							<p><img src="kuvat/asm08.jpg" width="346" height="239" border="0"><br>
								<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuvassa heitt&auml;&auml; Sami 'letti' Yl&ouml;nen.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Harmikseni Amigoita ei n&auml;kynyt paikan p&auml;&auml;ll&auml; kovinkaan paljoa, viel&auml; v&auml;hemm&auml;n kuin viime vuonna. Oldskoolissa en n&auml;hnyt yht&auml;&auml;n, mainstreamissa muutaman. Sen sijaan Macintosh-koneita tuli vastaan hieman enemm&auml;n kuin odotin. My&ouml;s C64-koneet k&auml;rsiv&auml;t kovaa v&auml;hentymist&auml;. Eniten erottuvia koneita l&ouml;ytyikin Alternative Partyjen j&auml;rjest&auml;jien p&ouml;ydilt&auml;. He j&auml;rjestiv&auml;t my&ouml;s omia ep&auml;virallisia kilpailuitaan, joiden tasosta jokainen voi muodostaa oman mielipiteens&auml;. Itse olen kiinnostunut edelleen hieman sis&auml;ll&ouml;llisemmist&auml; tuotoksista.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga voittaa!</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<p><br>
								<img src="kuvat/asm11.jpg" width="386" height="271" border="0"><br>
								<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Mainstream-hallin monitorit valaisevat pimeytt&auml;.</font></i></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Odotin, ettei Amiga en&auml;&auml; t&auml;n&auml; vuonna olisi juurikaan merkitt&auml;v&auml;ss&auml; osassa demo- ja intro-kisoja. Kovaksi yll&auml;tyksekseni tuotoksia ei ollut hirve&auml;sti, mutta taso oli sit&auml;kin parempi. Ensimm&auml;isen&auml; yll&auml;tti amigistiryhm&auml; RNO:n flash-esitys H&auml;iri&ouml;, joka kahmaisi voiton. Kyseinen tuotos sis&auml;lsi Amigamaisia piirteit&auml; ja n&auml;kemyksi&auml;.</font></p>
						<div align="center">
							<table border="0" cellpadding="0" cellspacing="0">
								<tr>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/humus.jpg" width="200" height="125" border="0"></font></i></div>
									</td>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/kingoffuck.jpg" width="200" height="125" border="0" alt=" "></font></i></div>
									</td>
								</tr>
								<tr>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Exploder:&nbsp;Humus 2</font></i></div>
									</td>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Spaceballs vs. Ephidrena:<br>
													King of Fuck</font></i></div>
									</td>
								</tr>
							</table>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sen j&auml;lkeen 4 kilotavun intro-kisassa tuli kaksoisvoitto, viime vuonna menestynyt Exploderin Humus sai jatko-osan nimelt&auml; Humus 2, ja toisena tuli Spaceballs vs Ephidrenan King of Fuck. Varma menestyksen merkki oli musiikin sis&auml;llytt&auml;minen introihin - kisan PC:n kilpailijoista kun ei l&auml;htenyt pihaustakaan. Moni #asm01-IRC-kanavan vierailija olikin sit&auml; mielt&auml;, ett&auml; Amigalle pit&auml;isi j&auml;rjest&auml;&auml; erillinen 4kt intro-kisa, koska niit&auml; ei voi verrata PC:n vastaaviin.</font></p>
						<div align="center">
							<table border="0" cellpadding="2" cellspacing="2">
								<tr>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/lapsuus_1.jpg" width="200" height="112" border="0"></font></i></div>
									</td>
									<td>
										<div align="center">
											<i><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/lapsuus_2.jpg" width="200" height="112" border="0" alt=" "></font></i></div>
									</td>
								</tr>
								<tr>
									<td>
										<div align="center">
											<img src="kuvat/lapsuus_3.jpg" width="200" height="112" border="0"></div>
									</td>
									<td>
										<div align="center">
											<img src="kuvat/lapsuus_4.jpg" width="200" height="112" border="0"></div>
									</td>
								</tr>
							</table>
							<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><i>MatureFurk: Lapsuus<br>
									Demokisan ylivoimainen voittaja.<br>
									&quot;Lapsuus on Amiga&quot;. Respect.</i></font></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Viimeisen&auml; yll&auml;tyksen&auml; tuli voittajan pallille p&auml;&auml;ssyt yhdistetyss&auml; demokisassa selke&auml;sti erottunut MatureFurkin Lapsuus. Entisten tunnettujen Amiga-henkil&ouml;iden tuotos onnistui vaikuttamaan jopa suttuisen Realmedia-l&auml;hetyksenkin kautta. Kaiken lis&auml;ksi demo ei edes hy&ouml;dynt&auml;nyt PPC:t&auml;, n&auml;ytt&ouml;korttia tai mit&auml;&auml;n 3D-piirist&ouml;j&auml;. Tekij&auml;porukka koostuikin mm. menestyspeli Max Paynea koodaanneista ex-amigisteista sek&auml; melko tunnetusta muusikosta, Markus 'Captain' Kaarlosesta. Palkinnon noutoa tuli viel&auml; juhlistamaan yksi Amigan isist&auml;, intuitionin suunnittelija R. J. Mical. Suosio siirtyi t&auml;ll&auml; kertaa ep&auml;ilem&auml;tt&auml; C64:lta Amigan eduksi. Toivottavasti sama jatkuu.</font></p>
						<p>[<font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2">Assembly 2001:n kilpailujen tulokset l&ouml;yd&auml;t <a href="asm01_tulokset.html" target="_self">erillisest&auml; artikkelista</a></font></font><font size="2"><font face="Trebuchet MS,Verdana,Arial,Helvetica">, jonka kautta p&auml;&auml;set my&ouml;s imuroimaan suurimman osan tuotoksista itsellesi. Kirjoitushetkell&auml; aivan kaikki eiv&auml;t olleet viel&auml; saatavissa, mutta tuotoksia kannattaa hakea my&ouml;hemmin esimerkiksi osoitteista <a href="ftp://ftp.scene.org" target="_blank">ftp.scene.org</a>, <a href="ftp://ftp.asmparty.net" target="_blank">ftp.asmparty.net</a></font></font><font face="Trebuchet MS,Verdana,Arial,Helvetica"><font size="2"> </font></font><font size="2"><font face="Trebuchet MS,Verdana,Arial,Helvetica">tai <a href="http://www.mbnet.fi/awake/tulokset/" target="_blank">www.mbnet.fi/awake/tulokset</a>. Lue my&ouml;s ensikertalaisen kokemukset #AmigaFIN-tapaamisesta artikkelista &quot;<a href="amigafin01.html" target="_self">#AmigaFIN-miitti Assembly '01:ll&auml;</a>&quot;.]</font></font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="amigafin01.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>