<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - Microtek ScanMaker X6</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>Microtek ScanMaker X6</H1>von<BR>
<A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>

<P><B>Schauspiel</B></P>
<P>
Voller Neid schaut man auf die Urlaubsbilder der Freunde. Nicht etwa,
weil der Urlaub so sch&ouml;n war - nein, die Bilder stehen im Internet!</P>

<P>Aber nicht erst da erschlie&szlig;t sich der Nutzen eines Scanners. Ich kenne
keinen, der nicht davon tr&auml;umt, irgendwelche Vorlagen mal schnell zu
scannen und anderen per Email zu zeigen. Sei es das Urlaubsfoto aus
Mallorca, die abfotografierte Bierdeckelsammlung oder die neue Freundin...</P>

<P>Nat&uuml;rlich geht das auch mit einer Digitalkamera, aber erstens ist die
immer noch mindestens um den Faktor zwei teurer, als ein guter Scanner,
zweitens m&ouml;chte man ja die Fotos auch leibhaftig herumzeigen, mu&szlig; sie
also erst mit einem (teuren) Farbdrucker ausdrucken, und drittens ist
ein Scanner zwar weniger mobil, aber qualitativ besser und von den
Vorlagen her flexibler. Ein Pa&szlig;foto m&ouml;chte ich jedenfalls nicht mit
einer Digitalkamera vervielf&auml;ltigen wollen...</P>

<P><B>Der Entschlu&szlig;</B></P>

<P>Also habe ich mir kurzentschlossen im Januar diesen Jahres einen Scanner
gekauft. Ein relativ einfaches Unterfangen, denn ich wu&szlig;te genau, was ich
wollte. Auf jeden Fall sollte das Ger&auml;t auch am Amiga betrieben werden
k&ouml;nnen, so da&szlig; die Parallelport-Modelle, die so g&uuml;nstig aussahen, schon
mal wegfielen. SCSI mu&szlig;te es sein. Au&szlig;erdem mu&szlig;te die optische Aufl&ouml;sung
so hoch sein, da&szlig; man auch Dias damit scannen kann. Nebenbei wollte ich
kein Gerenne bei Problemen - in meiner l&auml;ndlichen Gegend ist das recht
nervenaufreibend - also nahm ich, was mir mein &ouml;rtlicher H&auml;ndler anbot.</P>

<P>Die Wahl fiel auf den Microtek ScanMaker X6, mit 559 DM beim lokalen
H&auml;ndler nur 40 DM teurer, als im Versandhandel. Als zus&auml;tzliches Extra
nahm ich noch die SilverFast Scannersoftware f&uuml;r PC dazu, da ich schon
ahnte, da&szlig; der Betrieb am Amiga nicht so leicht sein w&uuml;rde. Ein (damals)
brandneuer Scanner neigt dazu, treiberm&auml;&szlig;ig nicht sehr gut unterst&uuml;tzt
zu werden.</p>

<P><B>Wertsachen</B></P>

<P>Was kann der X6 &uuml;berhaupt? Zuerst hat er die <B>komfortable Aufl&ouml;sung</B> von
echten, optischen 600 x 1200 dpi (Punkte pro Zoll). Damit kann man ein
Dia in einer Aufl&ouml;sung von 850 x 566 Pixel scannen. Falsch gerechnet
denken Sie, es sind doch 1200 dpi in der einen Richtung? Nun, Pixel sind
am Bildschirm quadratisch, mit den 1200 dpi fangen Sie also gar nichts
an - oder fast nichts. F&uuml;r eine maximale Qualit&auml;t m&uuml;ssen Sie mit 1200 dpi
scannen, dabei etwas Interpolation hinnehmen und dann das Resultat um den
Faktor zwei verkleinern. Der erzielte Qualit&auml;tsgewinn ist aber sichtbar,
so da&szlig; sich der Aufwand bei kleinen Vorlagen, wie Dias und
Ausschnittsvergr&ouml;&szlig;erungen, lohnt.</P>

<P>Der X6 ist ein <B>Single-Pass-Flachbettscanner</B>, scannt die Vorlage also in
einem Rutsch ein. Dazu braucht er etwa eineinhalb Minuten f&uuml;r eine DIN A4-
Seite in der h&ouml;chsten Aufl&ouml;sung. Danach wird au&szlig;erdem Ihre Festplatte voll
sein, denn das sind &uuml;ber 200 MByte Bilddaten im 24 Bit-Farbmodus...</P>

<P>Die <B>Farbaufl&ouml;sung</B> liegt bei 12 Bit pro Farbe, der X6 ist also ein 36 Bit-
Scanner. Die g&auml;ngigen Bildformate verwenden nur 3 x 8 Bit, also 24 Bit.
Mehr ist auch nicht n&ouml;tig, aber die Reserve von 4 bit pro Farbe kann man
f&uuml;r die Farbraumkompression benutzen. Die Theorie dahinter besagt, da&szlig;
Schwarz nie ganz Schwarz, und Wei&szlig; nie ganz Wei&szlig; gescannt wird. Mit den
zus&auml;tzlichen 4 Bit Farbaufl&ouml;sung hat man jedoch genug Reserve, um den
Farbraum f&uuml;r 8 Bit ohne Verluste herunterrechnen zu k&ouml;nnen.</P>

<P>Au&szlig;erdem hat der X6 einen <B>SCSI-Adapter</B> beiliegen, der nat&uuml;rlich nur im
PC funktioniert. Die Qualit&auml;t des Adapters ist derart, da&szlig; der gesamte PC
einfriert, solange Daten &uuml;ber den Bus kriechen (es ist ein einfacher
SCSI-2 Adapter, kein Fast-, kein Ultra-, kein Wide-...). Positiv ist,
da&szlig; der SCSI-Bus durch den Scanner durchgeschleift wird, dadurch konnte
ich erstmals mein Amiga-ZIP-Laufwerk am PC betreiben. Zur Terminierung
liegt au&szlig;erdem ein passiver Abschlu&szlig;stecker bei. Die SCSI-ID ist &uuml;ber
einen kleinen Drehschalter frei (also von 0 bis 6) einstellbar,
Voreinstellung ist 6, also Vorsicht am Amiga 3000, dort liegt die
Festplatte auf dieser Adresse.</P>

<P>Ein weiterer 15-poliger Stecker ist der Anschlu&szlig; f&uuml;r das &quot;<B>LightLid</B>&quot;, einen
Durchlichtaufsatz f&uuml;r Dias und Foto-Negative. Ohne diesen Aufsatz braucht
man an Dias gar nicht zu denken, deswegen habe ich mir auch diesen gekauft:
300 DM f&uuml;r ein LC-Display ohne LCD. Denn genau das ist der Aufsatz - die
Hintergrundbeleuchtung eines stinknormalen LC-Displays f&uuml;r Laptops!</P>

<P>Au&szlig;erdem hat der Scanner einen kleinen Startknopf, der &uuml;ber die PC-
Software abgefragt wird und einen Scanvorgang ausl&ouml;st. An sich eine
pfiffige Idee: Vorlage einlegen, Knopf dr&uuml;cken, Scan startet. Mit der
Kopierfunktion kommt sogar eine gedruckte Kopie von der Vorlage aus dem
Drucker, wie bei einem echten Kopierer. Nur auf dem Amiga ist der Knopf
leider nutzlos, da die Software ihn hier nicht unterst&uuml;tzt.</P>

<P>Die <B>Software</B> besteht (nat&uuml;rlich) nur aus CDs f&uuml;r den PC - nicht einmal
die Mac-Software lag bei, allerdings ein Gutschein f&uuml;r deren nachtr&auml;gliche
Bestellung. Hier war der Marktdruck anscheinend wieder st&auml;rker, als die
Kompetenz der Programmierer und die Vernunft der Marketingabteilung.</P>

<P>Beeindruckend ist das Softwarepaket jedoch. Neben den Twain-Treibern f&uuml;r
Windows, bekommt man eine einfache Bildbearbeitung, eine Texterkennung
(OCR-Software) und eine zweite, ausgewachsene Bildbearbeitung (Ulead
Photoimpact).</P>

<P>Das Paket, das ich gekauft habe, enth&auml;lt au&szlig;erdem noch SilverFast, eine
leicht bedienbare, qualitativ gute Scansoftware der deutschen LaserSoft
GmbH. F&uuml;r den Amiga spielt das jedoch keine Rolle; wer noch einen PC
besitzt, hat daran sicher seine Freude. Abgesehen davon, da&szlig; die Software
nicht einmal den Durchlichtaufsatz ansteuern kann...</P>

<P><B>Nutzlos</B></P>

<P>Wozu dann kaufen, wenn der X6 nicht am Amiga l&auml;uft? Aber er l&auml;uft doch!
Nur ist die einzige Software, die den Scanner unterst&uuml;tzt, die Shareware
<B>ScanTek</B>. Auf Anfrage bei RBM erhielt ich die Antwort, da&szlig; eine
Unterst&uuml;tzung von Microtek-Scannern durch ScanQuix nicht geplant ist.
Dann ist es eben wieder die Shareware, die den Amiga am Leben und
halbwegs am Puls der Zeit h&auml;lt.</P>

<P><B>Betrieb</B></P>

<P>Ich habe den X6 am CyberSCSI-Modul einer Cyberstorm MK2 mit der
unregistrierten Version von ScanTek getestet. Leider ist die Beurteilung
der Bildqualit&auml;t so nicht m&ouml;glich, denn die Software erzeugt als Anreiz
zur baldigen Registrierung schwarze Balken im Bild. Die Ergebnisse am PC
k&ouml;nnen sich jedoch sehen lassen und es ist nicht einzusehen, warum der
Amiga eine schlechtere Qualit&auml;t erzeugt, denn letztlich macht der Scanner
das Bild.</P>

<P>Neben den Eigenheiten der Amiga-Software hat auch der Scanner selbst ein
paar <B>Macken</B>, die man kennen sollte. So stimmt z.B. die Positionierung der
Vorschau nicht absolut mit dem gescannten Ergebnis &uuml;berein, beim
Durchlichtaufsatz noch viel weniger. Das zeigt sich unabh&auml;ngig von
Software und Rechner, so da&szlig; der Verdacht naheliegt, da&szlig; die Mechanik
nicht so fein einstellbar ist, wie sie sein sollte, oder durch den
Transport etwas dejustiert worden ist.</P>

<P>Andererseits ist kein Scanner so perfekt, da&szlig; der Scan sofort
weiterverwendet werden kann. Ohne Bildbearbeitung geht nichts, auf dem
Amiga sowieso nicht. Die PC-Twainsoftware hat schon Bearbeitungsfunktionen
integriert, so da&szlig; hier schon vor dem Scanvorgang wesentlich besser
korrigiert werden kann. Die Amigasoftware kann von solch einem luxuri&ouml;sen
Treiberstandard nur tr&auml;umen. Gammakorrektur und Farbraumkompression sind
hier schon anpreisenswerte Funktionen, beim PC ist das gar nicht mehr
erw&auml;hnenswert.</P>

<P><B>Allesfresser</B> </P>

<P>Getestet habe ich mit allen m&ouml;glichen Scanvorlagen; von Fotos, &uuml;ber Dias
und Zeitschriften, bis zu Einsteckkarten f&uuml;r Computer. Die Sch&auml;rfeebene
des X6 ist so gro&szlig;z&uuml;gig, da&szlig; sogar diese scharf abgebildet werden. Auch
der obligatorische 100 DM-Schein mu&szlig;te herhalten, um den winzigen
&quot;hundert&quot;-Schriftzug abzulichten. Schw&auml;chen kamen dabei, bis auf die
erw&auml;hnte Positionierabweichung, keine zutage, eher im Gegenteil. Auf dem
Pa&szlig;bild, das ich gescannt habe, waren sogar die Vertiefungen zu erkennen,
die durch das matte Fotopapier entstehen. Dieses wird dadurch matt, da&szlig;
winzige Vertiefungen eingepr&auml;gt werden, so da&szlig; einfallendes Licht gestreut
und nicht direkt zur&uuml;ckgeworfen wird.</P>

<P><B>Technische Probleme</B></P>

<P>Falsch machen kann man bei der <B>Bedienung</B> eigentlich nichts. Au&szlig;er dem
Einschaltknopf und dem &quot;Go&quot;-Button hat der X6 keine Bedienelemente. Selbst
ein nachtr&auml;gliches Einschalten und Mounten &uuml;ber SCSI-Tools ist m&ouml;glich und
funktioniert auf dem Amiga sogar besser, als auf dem PC. Da hatten die
Treiber mit dem Ansprechen des X6 manchmal Probleme, die das ganze System
einfrieren lie&szlig;en.</P>

<P>Nur einmal blieb mein Amiga beim Booten h&auml;ngen, als der X6 eingeschalten
war. Bisher ist der Effekt nicht mehr aufgetreten, aber sicherheitshalber
kann man Reselection und Synchronbetrieb f&uuml;r den Scanner am SCSI-Adapter
deaktivieren. Sch&ouml;n ist dies nicht, denn SCSI-Ger&auml;te sollten sich
problemlos untereinander verst&auml;ndigen k&ouml;nnen. Aber was tut man nicht
alles f&uuml;r einen eigenen Scanner.</P>

<P><TABLE ALIGN=CENTER BORDER=1>
<TR>
    <TD><B>Produkt:</B></TD>
    <TD>ScanMaker X6</TD>
    <TD><B>Hersteller:</B></TD>
    <TD><A HREF="http://www.microtek.nl">Microtek Int.</A></TD>
</TR>
<TR>
    <TD><B>Art:</B></TD>
    <TD>Flachbettscanner</TD>
    <TD><B>Version:</B></TD>
    <TD>MRS-1200X6S</TD>
</TR>
<TR>
    <TD><B>Preis:</B></TD>
    <TD>ab 349,- DM (&#185;)</TD>
    <TD><B>Bez.Quelle:</B></TD>
    <TD>Fachhandel</TD>
</TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Leistungsf&auml;higkeit:</B></TD><TD ALIGN=CENTER>1</TD><TD ALIGN="CENTER" ROWSPAN=4><IMG SRC="../images/note2.gif" WIDTH="32" HEIGHT="52"></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Benutzerfreundlich:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Dokumentation:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Preis-/Leistung:</B></TD><TD ALIGN=CENTER>2</TD></TR>
<TR><TD COLSPAN=4></TD></TR>
<TR><TD COLSPAN=2 ALIGN=CENTER><B>Gesamt:</B></TD><TD COLSPAN=2 ALIGN=CENTER>2</TD></TR>
</TABLE></P>
(&#185;) getestete Version mit Silverfast PC-Software ab 449 DM, Durchlichtaufsatz ab 249 DM<BR>

Microtek Europe B.V.<BR>
Max Euwelaan 68<BR>
NL - 3062 MA Rotterdam<BR>

Tel: 0031 10 242 5688<br>
Fax: 0031 10 242 5699
<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../pd/9906pep.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../cc/9906bas.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


