<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">  
<HTML>
<BODY>
<HEAD>
   <TITLE>"Die by my hand"</TITLE>
   <META NAME="AUTHOR" CONTENT="J&uuml;rgen Kumiega">
   <META NAME="GENERATOR" CONTENT="HTML Editor by Adam 'Sherwood' Zaparcinski (gielda@mtl.pl)">
</HEAD>
<BODY BACKGROUND="backsp.gif" text=black link=yellow vlink=black alink="lime">
<Font color=white>
<a name=0>
<center><H1>DIE - Version 1.0</H1>
<FONT SIZE="+1"></center>

<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#1>Was brauch ich um DIE zu spielen?</A><BR>
<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#2>Wie installiere und starte ich es?</A><BR>
<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#3>Wie spielt es sich?</A><BR>
<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#4>Wie sieht es aus?</A><BR>
<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#5>Wie h&ouml;rt es sich an?</A><BR>
<img WIDTH=10 HEIGHT=10 src=../bullet_arrwild.gif><a href=#6>Wie ist es?</A><BR></FONT>
<HR size="5">
<a name=1>
<FONT SIZE="+1"><B>Systemvoraussetzung:</B><P>  </FONT>
<UL type=circle>
<LI>AGA Amiga
<LI>1 MB freies Chip-RAM
</UL>
<a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="5">
<a name=2><FONT SIZE="+1"> <B>Installation/Starten:</B><P>  </FONT>
In dieser Beziehung ist das Spiel v&ouml;llig unproblematisch. Man extrahiert das Lha-Archiv in ein bestimmtes Verzeichnis und klickt doppelt auf DIE.EXE. Man sollte lediglich auf das eine freie Chip-Ram-Megabyte schauen.
<BR><a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="5">
<a name=3><FONT SIZE="+1"> <B>Spielen:</B><P> </FONT>
Zuerst darf man sich bei dem Spiel durch die Optionen w&uuml;hlen. Man darf w&auml;hlen, wie weit man fallen darf ohne auf dem Arsch zu landen, welches Szenario man haben will, welche Gravitation man will, wieviel Energie man will ..... usw. Danach ins Spielgeschehen gest&uuml;rzt.
Nur noch auf DIE geklickt und "stirb du Hund"!. Die beiden Spieler erscheinen auf dem Bildschirm, und schon geht man aufeinander los. Links/Rechts bewegen, Oben/Unten den Schu&szlig;winkel &auml;ndern und Oben+Links oder Rechts springen. Etwas sehr kompliziert ohne zweiten Feuerknopf. Nun ein bischen geh../upft,
an Netzen hochgeklettert und eine neue Waffe, ein Healthkit, einen Armor oder die SpeedPotion geholt. Das Ziel ist es den Gegner m&ouml;glichst schnell zu eliminieren. Bis der Kugelfresser explodiert kann man sich auch per Teleporter irgenwo anders hinteleportieren. Das Ziel wird zuf&auml;llig ausgew&auml;hlt.
F&uuml;r den Spielspa&szlig; ist gesorgt. Nur stimmt die Grafik?
<BR><a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="5">
<a name=4> <FONT SIZE="+1"><B>Grafik:</B><P></FONT>
Zur Grafik kann ich nur sagen: "Hossa, hossa. Fiesta Fiesta Mexicana!" Nun ehrlich, die Grafik ist absolut geil. Die 5 beigef&uuml;gten Hintergrundgrafiken sehen echt scharf aus.
Sie sind z. T. auch mit Animationen versehen. Also zum Thema Hintergrundgrafik ein dickes PLUS. Nu zu die PlayerSprites. Die sind s../uper animiert und sehen echt cool aus (Satan vs. Jesus -/- Fight). Wenn sie irgenwo runterfallen liegen sie auf
dem R&uuml;cken und es sieht echt geil aus wie sie wieder aufstehen. Die Power../ups sehen auch verdammt
gut aus und sind auch ganz toll animiert. Nun aber zu den echten Highlights, den Waffen. Die Projektile bestehen aus ganz normalen Pixeln, die zum Teil der Schwerkraft ausgesetzt sind oder einfach ein einem sch&ouml;nen Flash explodieren.
Wenn man mit seiner Wumme schie&szlig;t, erhellt dies auch den Spieler. Wow. genial. Man kann das ganze nat&uuml;rlich noch viel weiter beschreiben, aber da ich schon wieder in Zeitnot bin gebe ich ab an:
<BR><a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="5">
<a name=5> <FONT SIZE="+1"><B>Musik / Sound FX:</B><P></FONT>
Musik hat das Spiel leider gar nicht, aber die SFX h&ouml;ren sich echt geil an. Das Ratatata der MG oder das Zzzziimm des Teleporters h&ouml;ren sich voll gut an. Sie passen auch total zum Spiel und k&ouml;nnen durch andere IFF-8SVX Sounds ersetzt werden.
Naja, das wars nun zum Fazit des Spieles.
<BR><a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="5">
<a name=6> <FONT SIZE="+1"><B>Fazit:</B><P></FONT>
Farbenfroher Worms-Grafik-Stil gepaart mit viel Action und coolen Waffen. Das hat eindeutig ein <img src=schmugge.gif>
 verdient. Allerdings w&auml;re ein 3 oder 4 Spieler Modus nicht &uuml;bel gewesen (vielleicht mit TeleTubbies-Figuren!?). Es ist auch nicht so toll, dass kein 2ButtonJoystick unterst&uuml;tzt wird. Es ist mit einem Joypad nicht so leicht immer schr&auml;g oben zu dr&uuml;cken um
 zu springen. Aber andersrum kann man schlecht nach oben zielen ohne zu springen. Zuletzt kann man noch bem&auml;ngeln, dass die Szenarios nicht bei jedem Match nicht zuf&auml;llig ausgew&auml;hlt werden, sondern immer das gleiche wieder geladen wird.
<center><TABLE BORDER BGCOLOR="2222ff">
<caption><CENTER>Wertung</CENTER></caption>
<TR>
<TD>Grafik<TD>78%</TD>
</TR>
<TR>
<TD>Sound<TD>80%</TD>
</TR>
<TR>
<TD>Motivation<TD>82%</TD>
</TR>
<TR>
<TD>Spielspa&szlig;<TD>92%</TD>
</TR>
<TR>

<TD><B><U>Gesamt</U></B><TD><B><U>83%</U></B></TD>
</TR>
</TABLE>
<TABLE BORDER BGCOLOR=#006900>
<TR>
<TD>+<TD>1. farbenfroh<BR>2. hoher Suchtfaktor</TR>
</TABLE> 
<Table border bgcolor="red">
<TR>
<TD>-<TD>1. Nur 2 Spieler<BR> 2. Nur 1Button Joystick-Unterst&uuml;tzung</TR>
</TABLE> </center><BR> 

<BR><a href=#0><IMG WIDTH=16 HEIGHT=25 SRC=../up.gif border=0></A><P> <HR size="15">
<CENTER><h2> <a href="mitglieder/kumiega.html">J&uuml;rgen <IMG SRC="../thedark.jpg" Width=136 Height=102 Border=0> Kumiega</H2></A></Font><bR>
<a href=pd_index.html><img WIDTH=200 HEIGHT=90 src=index.gif border=0></center>
</BODY>
</HTML>
