<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">

    <TITLE>Alcatraz</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="apc0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "apc.html" alt="zur&amp;uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "" bgcolor="#000080">
              <TR>
                <TD><IMG src="apc.gif" alt="" width="640" height=
                "22" border="0" usemap="#apc0"> </TD>
              </TR>

              <TR>
                <TD>
                  <BR>
                  <BR>
                   <BR>
                   

                  <TABLE border="0" cellpadding="4" summary=""
                  bgcolor="#ff00ff" align="center">
                    <TR>
                      <TD>
<PRE>
                       /\    L C A T R A Z
                      /. \
                     //  .\        __    ___
                    //    \\      |. \  |  .|   E T W O R K
                   /   /\  \\     |:  \ |  ||
                  /   /""    \    ||   \|  ||
                 (___/________)   |:       :|
                                  |.  |\    |
                                  |   | \   |
                                  |___|  \__|

                        - I N F O R M A T I O N E N -


 _________________________________
                                 /
 Netzadressen der Koordination  /
 ______________________________/

 SYSOP@ANOTHER.gun.de / J&uuml;rgen_Winter%2:2480_3336.15
 (Z-Netz bzw. PM-Netz)       (FIDO-Netz)

 ANDREAS@HIGHVOLT.gun.de / Andreas_Magerl%2:2480_3336.15

 (Z-Netz bzw. PM-Netz)


 ________________________________________________________
                                                        /
 Folgende Bretter sind derzeit im Netzwerk vorhanden   /
 _____________________________________________________/


 ALCATRAZ/!WICHTIG         - Hier schreibt NUR die Koordination.
                             Das Netz wird koordiniert vom
                             SysOp der Another World
                             (SYSOP@ANOTHER.zer.sub.org)
                             und dem SysOp der High-Voltage
                             (SYSOP@HIGHVOLT.zer.sub.org)

 In diesem Brett werden aktuelle und wichtige Informationen von der
 KOO ver&ouml;ffentlicht. Ausserdem werden neue Systeme hier von der KOO
 vorgestellt. NUR die KOO darf in dieses Brett schreiben !
 -------------------------------------------------------------------
         /CHARTS           - akt. dt. Charts und Charts von Usern des Netzes!
                             Brettverwalter: SYSOP@ANOTHER.zer.sub.org

 Hits Nonstop. Die dt. Top10 in der &Uuml;bersicht. Woche f&uuml;r Woche.
 Charts mit Beteiligung der User. User schreiben ihre Favoriten an den
 SysOp der Another World ! Auswertung dann 1x mtl. !
---------------------------------------------------------------------
        /COMMENTS         - Kommentare, Kinofilme, Musikalben und
                             vor&uuml;ber es sich sonst lohnt zu schreiben

 Hier kann jeder schreiben, wozu er praktisch Lust hat. Zum Beispiel &uuml;ber
 einen neuen Kinofilm, &uuml;ber seinen Computer, oder was sonst einen so juckt.
 Also praktisch ein Brett f&uuml;r alles. Reines Textbrett.
 ----------------------------------------------------------------------
         /GRAFIK-THEKE     - Textbeschreibungen von Grafiken

 In diesem Brett sind Workshops f&uuml;r Grafik, sowie auch
 nat&uuml;rlich Tests &uuml;ber Grafiktools, Comments, Infos. Einfach alles,
 was irgendwie mit Grafik zu tun hat. Reines Textbrett.
 -----------------------------------------------------------------------
         /GAMES-THEKE      - Wie Grafik-Theke, jedoch f&uuml;r Games

 In diesem Brett sind Test &uuml;ber Games, sowie auch Tips &amp; Tricks, Cheats,
 L&ouml;sungswege, Comments, Infos und was es sonst noch alles zu diesem
 Thema gibt. Reines Textbrett.
 ----------------------------------------------------------------------

         /TOOLS-THEKE      - Wie Grafik-Theke, jedoch f&uuml;r Programe

 In diesem Brett sind Test &uuml;ber diverse Tools &amp; Programme. Sowie Workshops,
 Hilfen und weiteres &auml;hnlicher Art. Reines Textbrett.
 -----------------------------------------------------------------------
         /MIXER            - alles gemischte und vermischte...

 In dieses Brett kommt alles rein, was in die anderen Brettern
 nicht hineinpasst. Reines Textbrett.
 -----------------------------------------------------------------------
         /TREFFPUNKT       - wo was los ist; wer trifft sich wo?

 Hier kommen Informationen rein, wo wann ein Treffen oder eine Veranstaltung
 stattfindet. Nicht nur f&uuml;r Computer, auch Veranstaltungshinweise zu andern
 Themen sind Willkommen. Also wenn Ihr wisst, das irgendwo ein Treffen
 stattfindet, dann schreibt das so schnell und ausf&uuml;hrlich wie m&ouml;glich
 in dieses Brett. Reines Textbrett.
 -------------------------------------------------------------------------
         /KUMMERKASTEN     - Fragen, Antworten, Vorschl&auml;ge

 Habt Ihr Probleme mit einer Firma, einem Programm oder sonst welchen Sachen ?
 Dazu geh&ouml;rt dann selbstverst&auml;ndlich auch Kritik zum Alcatraz-Netzwerk!
 Dann ist das Brett hier genau das richtige f&uuml;r Euch!
 Reines Textbrett.
 ---------------------------------------------------------------------
         /INTERN-APC&amp;TCP   - internes Clubbrett des APC&amp;TCP-Computerclubs
                             Brettverwalter: SYSOP@HIGHVOLT.zer.sub.org


         /INTERN-????      - vielleicht DEIN Computerclub ??

 Die INTERN Bretter sind alles Bretter von diversen Clubs, Vereinigungen
 oder Magazinen. Dort stehen spezielle Informationen &uuml;ber den jeweiligen
 Club, usw. Ausserdem werden in diesen Brettern die jeweiligen ClubMagazine
 versendet. Diese d&uuml;rfen allerdings NUR die jeweiligen Brettverwalter
 in das Netz setzen.
 Jeder der Mitglied in einer der Clubs, usw. ist, sollte hier aktiv
 mitarbeiten, (Also Texte schreiben) damit das Brett kein totes Brett
 wird und aus dem Netz geworfen wird.
 Wenn ein Club, Vereinigung oder &auml;hnliches auch ein eigenes Brett
 f&uuml;hren will, sollte er sich an die KOO wenden.
 _____________
             /
 Netikette  /
 __________/

 - Die jeweiligen Boxen, die sich anschliessen, haben den Anweisungen
   der Koordination Folge zu leisten.
 - Mailboxen, die sich an das Netz anschliessen wollen m&uuml;ssen eine kurze
   Systemvorstellung (Beispiel siehe im Brett /!WICHTIG) an den Pseudo-User
   ALCATRAZ@HIGHVOLT.zer.sub.org schicken.
   Erst wenn die Koordination das System im Brett /!WICHTIG vorstellt
   hat die Mailbox Schreibzugriff.
 - Mailboxen, die in das Netz eingetragen sind, verpflichten sich,
   alle Bretter zu f&uuml;hren und auch ggf. weiterzurouten !
   (auch was die Bin&auml;rdaten - Clubdisks usw. - betrifft!!)
 - die Bin&auml;rfiles d&uuml;rfen nur vom jeweiligen Brettverwalter, deren
   autorisierten Personen und von der Koordination gepostet werden.
 - als bin&auml;re Files werden nur Clubmagazine anerkannt - und nur diese
   d&uuml;rfen gepostet werden.
 - sollten die Bin&auml;rdaten jedoch ein angemessenes Mass &uuml;berschreiten,
   sieht die Koordination vor, dass die Files nach R&uuml;cksprache mit
   dieser nicht unbedingt weitergeleitet werden m&uuml;ssen !
 - User, die ins ALCATRAZ-Netz schreiben, m&uuml;ssen auf geeignete
   Weise &uuml;ber die Richtigkeit ihrer pers&ouml;nlichen Daten &uuml;berpr&uuml;ft werden!

 - Pseudos sind erlaubt !
 - es muss ein Versenden von privaten Nachrichten m&ouml;glich und
   gew&auml;hrleistet sein !
 - diese pers&ouml;nlichen Nachrichten sollten eine L&auml;nge von 10 KB
   nicht &uuml;berschreiten !
 - Netzboxen verpflichten sich, bei gr&ouml;berer &Auml;nderung ihrer
   Hardware, Software, Telefonnummer, Serverwechsel, SysOpwechsel
   usw., diese der Koordination bekannt zu geben
 - vorheriger Punkt gilt auch f&uuml;r l&auml;ngere Offlinezeiten von
   Netzboxen sowie der Abmeldung vom Netz
 - zensieren, zur&uuml;ckhalten, oder l&ouml;schen von Nachrichten
   ist der Systembetreuung nicht erlaubt
 - Beleidigungen, Verleumdungen, Diskriminierung von Minderheiten,
   rassistische und volkverhetzende Texte, Aufrufe zu Straftaten sowie
   jeglicher Versto&szlig; gegen geltendes Recht sind nicht erw&uuml;nscht und
   sollten von der Systembetreuung unterbunden bzw. gel&ouml;scht
   werden (Ausnahme zur vorherigen Regel).


                Antrag/Vorstellung ALCATRAZ-Network

 !!!! Den Antrag bitte an ALCATRAZ@HIGHVOLT.gun.de abschicken !!!!
 -------------------------------------------------------------------------

 ------------ &ouml;ffentlich, f&uuml;r die Vorstellung im !Wichtig Brett --------

 Boxname...............:   &lt;Name der Box&gt;
 Netzname..............:   &lt;Name der box im Netz; max 8 Zeichen&gt;
 Boxnummer.............:   &lt;Telefon-Nummer der Box / Modemtyp&gt;
                           &lt;bei mehrerern Ports alle angeben!&gt;
 Onlinezeit............:   &lt;Onlinezeit der Box&gt;
 Server-Alcatraz-Netz..:   &lt;Der Server f&uuml;rs Alcatraz-Netz (Netzname)&gt;
 Verbindungsart........:   &lt;Ob ZConnect, Z3.8, FIDO oder sonstiges&gt;
 Rechnertyp............:   &lt;Amiga, PC, Atari&gt;
 Mailboxsoftware.......:   &lt;Mailboxprogramm/Version&gt;

 --------------------- nicht &ouml;ffentlich, nur f&uuml;r die KOO ---------------

 SysOp-Real-Name.......:   &lt;Richtiger Name des SysOps&gt;
 Strasse...............:   &lt;Adresse des SysOps&gt;
 Plz/Wohnort...........:   &lt;Adresse des SysOps&gt;
 Voice-Telefon.........:   &lt;Nummer, unter der der SysOp per Voice erreicbar&gt;
 Geburtsdatum..........:   &lt;Geburtsdatum des SysOps&gt;

 !!!! Den Antrag bitte an ALCATRAZ@HIGHVOLT.gun.de abschicken !!!!


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                  <BR>
                  <BR>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="apc.gif" alt="" width="640" height=
                "22" border="0" usemap="#apc0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

