<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Erstschlag</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="dis0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "dis.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#000000">
              <TR>
                <TD><IMG src="dis.gif" alt="" width="640" height=
                "22" border="0" usemap="#dis0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#209800" width="76%" align="center">
                    <TR>
                      <TD>
<PRE>
          Erstschlag Axel Melzener - Gegenschlag Stefan Wunner
          ----------------------------------------------------

                            Amiga contra PC



          Auf Amiga-Seite:                      Auf PC-Seite:
          """"""""""""""""                      """""""""""""
  
          Stefan Wunner                         Axel Melzener



 In der Ausgabe 5 der NoCover schrieb Axel Melzener einen  "ris-
 kanten"  Text der Amiga und MS-DOSEN PC miteinander vergleichen
 soll.

 Ich gehe einmal davon aus, da&szlig; diesen Text jeder, der die NC5
 hat, gelesen hat.

 Nun frage ich mich: Was will dieser Typ mit einem Amiga, wenn
 dieser angeblich total &uuml;berteuert, r&uuml;ckst&auml;ndig, langsam usw. sein
 soll? Was soll die Schei&szlig;e, h&auml;?



 Au&szlig;erdem schrieb dieser "nette" Herr in der selben Ausgabe der NC
 noch einen Bericht, in dem er die verschiedenen Amigas
 miteinander vergleicht und dort sagt das der Amiga ein gutes
 Ger&auml;t ist.

 Bevor ich richtig anfange, mu&szlig; ich noch eines sagen: Der Axel
 Melzener hat in paar Dingen schon recht, aber der Rest ist alles
 weitgehend Schrott.

 Au&szlig;erdem mu&szlig; ich sagen, da&szlig; alle Bemerkungen von mir &uuml;ber Herrn
 Melzener absolut nicht so gemeint sind, wie sie sich anh&ouml;ren. Nur
 um das mal klarzustellen :-)

 Ich gehe jetzt den Bericht von ihm Punkt f&uuml;r Punkt einmal durch,
 und f&uuml;ge am Schlu&szlig; noch einige Sachen hinzu, die der MS-DOSEN&nbsp;PC
 niemals bieten kann.




 Zu 1)&nbsp;Der Amiga soll angeblich viiiiiiel teurer sein als eine PC-
 DOSE. Er beschwert sich, da&szlig; der Amiga ja so teuer sein soll. Er
 hat auch eine Aufstellung gemacht:

                       A1200              600 DM
                       Software-Bundle    150 DM
                       120 MB&nbsp;Festplatte  500 DM
                       Uhr                 40 DM
                       Monitor            500 DM
                       Zweitlaufwerk      200 DM
                       -------------------------
                       Gesamt            1990&nbsp;DM
                                         -------

 Das diese Preise nicht stimmen, will ich nun einmal klarstellen.
 Ich nehme hierzu die Angebote von wirklich g&uuml;nstigen und
 zuverl&auml;ssigen Firmen, wie z. B. Cross Computersystems, Alternate,
 AmigaOberland, Vesalia.....
 Die Preise k&ouml;nnen allerdings (wie so &uuml;blich) immer etwas
 schwanken, also Preisangaben mit ca. versehen:



                  A1200                    ca. 540 DM
                  Software-Bundle
                  (Desktop Dynamite)       ca.  80 DM
                  130 MB Festplatte        ca. 440 DM
                  Uhr                      ca.  35 DM
                  Monitor                  ca. 400 DM
                  Zweitlaufwerk            ca. 110 DM
                  -----------------------------------
                  Gesamt                  ca. 1600 DM
                                          -----------

 H&auml;tte sich Herr Axel Melzener etwas genauer umgeschaut, dann w&auml;re
 er sicher auch zu diesem Ergebnis gekommen. Au&szlig;erdem ist hier die
 Festplatte um 10 MB gr&ouml;&szlig;er.

 Aber auch der Amiga 4000 ist sehr g&uuml;nstig geworden. Und die
 Preise fallen ewig weiter.

 Die Ausstattung des "Beispiel 1200er" ist nicht schlecht. Man
 bekommt ein komplettes System mit Betriebssystem, Software
 (Textverarbeitung, Mal- und Animationsprogramm, Druckprogramm und
 Spiele). Das ist die optimale Ausr&uuml;stung f&uuml;r den Einsteiger. Man
 kann Texte schreiben, Grafiksachen machen und nebenbei etwas
 Spielen. Das ganze Set f&uuml;r nur ca. 80,-&nbsp;DM. Jetzt gibt es auch
 schon ein Set, das "Computer&nbsp;Combat" hei&szlig;t. Es beinhaltet eine
 Textverarbeitung, einen Organzier, ein Mal- und Animationspgramm
 und noch mehr Spiele. Die Hardware l&auml;&szlig;t sich auch sehen:


 Monitor, A1200 mit einer mittelgro&szlig;en Festplatte, Uhr und zwei
 Laufwerke. Man kann also sofort loslegen.
 

 So, jetzt zu diesem "Billig-PC":

 Einen 386 mit 40 MHz, einen ja achsotollen MiniTowergeh&auml;use, 4 MB
 RAM, Grafikkarte mit einer ja sooo tooollen Aufl&ouml;sung (leider
 "verga&szlig;" Herr Axel Melzener, wieviele Farben das Teil darstellen
 kann, einer 1,44 MB Floppy (zum Vergleich: unsere HD-Floppys
 haben 1,76 MB, da sage jemand das sei schlecht, oder Herr Axel
 Melzener?), 2xSer, 1xpar und einen Gameport, eine Tastatur mit
 dem tollen MF2 Standard und 250 MB Festplatte und einen 14"
 Monitor. Er kam auf 1878,- DM.

 Mit dem "Beispiel 1200er" kamen wir auf ca. 1600,-DM. O. K. keine
 250 MB Festplatte und keine 4 MB Ram. Mit einer 250 MB Platte
 h&auml;tte der 1200er so ca. 250,00 DM mehr gekostet. Und eine
 Speichererweiterung mit 2 MB best&uuml;ckt: ca. 250,- DM. Dann w&auml;ren
 wir bei insgesamt 2100,-&nbsp;DM. Er hat einen seriell Port weniger,
 aber daf&uuml;r einen Gameport mehr. Und au&szlig;erdem besitzt der Amiga
 1200 in diesem Fall 1 3,5"&nbsp;Laufwerk mehr.

 Aber der "Discount-PC" hat kein Betriebssystem, keine
 Soundf&auml;higkeiten und keine Maus anbei. Was beim Amiga seit fast
 10 Jahren selbstverst&auml;ndlich ist. Mu&szlig; man sich alles extra
 dazukaufen...

 Das zeigt mal wieder wie r&uuml;ckst&auml;ndig ein MS-DOS PC ist.

 Also, 8-Bit Soundkarte: so ca. 350 DM (mit halbwegs vern&uuml;nftigen
 Aktivboxen, diese haben ja Amiga-Monitore meistens schon
 eingebaut und die Qualit&auml;t ist auch nicht schlecht),
 Betriebssystem MS-DOS 6.2 ca. 100 DM, Windows so ca. 150,-&nbsp;DM
 (Betriebssystem lag beim Amiga schon am Anfang, also seit 10
 Jahren, anbei), eine Maus: ca. 50,- DM.

 Dann kommen wir auf insgesamt ca. 2550,- DM. Also ca. 450 DM
 teurer als der Amiga.

 Gut, zugegeben: Der Preisunterschied ist nicht mehr so gro&szlig; wie
 fr&uuml;her, aber wenn man genau nachrechnet, dann liegt der Amiga im
 Preis/Leistungsverh&auml;ltnis immer noch vorn, wenn auch knapp.


 Zu 2) Er behauptet, da&szlig; Amiga-User es nicht verkraftet h&auml;tten,
 da&szlig; VOBIS den Amiga 1992 aus dem Sortiment genommen haben.

 Stimmt nicht: Ich kenne keinen, der dem Amiga im Vobis Gesch&auml;ft
 nachweint.

 Au&szlig;erdem sagt er, da&szlig; die VOBIS Verk&auml;ufer sehr gut seien.
 Vielleicht nur in dem Kaff, in dem Axel Melzener wohnt. In
 Bamberg gibt es auch einen VOBIS-Laden. Ich bin mal spa&szlig;eshalber
 reingegangen und wollte mich zum Computerkauf beraten lassen.
 Der Verk&auml;ufer schaute aus wie gehirnamputierter Volldepp und
 versuchte mir krampfhaft zu erkl&auml;ren was ein Computer ist. Er
 wu&szlig;te teilweise nicht weiter (z. B. wozu man den DOS-Befehl
 Assign und CD braucht, oder wozu denn die Autoexec.bat da sei).

 Mitten in der Erkl&auml;rung brach bei mir ein Lachkrampf aus und ich
 bin so schnell wie m&ouml;glich zum Ausgang gelaufen.

 Der Axel Melzener hat also noch nie Probleme mit seinem 486
 gehabt. Soso... Ich habe auch noch nie Probleme mit meinem 1200er
 gehabt...


 Zu. 3) Er behauptet, der Amiga ist in Sachen Einsteiger total
 r&uuml;ckst&auml;ndig ist.

 Zur Dokumentation: Gut, zugegeben, auf dem DOSEN PC ist die
 Dokumentation viel besser, aber auf dem Amiga hat sie sich auch
 gebessert. Die Handb&uuml;cher sind gut strukturiert und
 &uuml;bersichtlich, auch wenn sie nicht so umfangreich sind. Ich bin
 jedenfalls mit der Dokumentation sehr zufrieden.



 Er bem&auml;ngelt, da&szlig; beim 1200er das DOS- und Arexx Handbuch
 vergessen wurde. Was tut ein Einsteiger mit B&uuml;chern wie DOS- und
 Arexx. Der Einsteiger will sich erst mal so zurechtfinden und
 nicht gleich die wundervolle Welt von Arexx erkunden.

 Au&szlig;erdem gibt es die B&uuml;cher AmigaDOS, AREXX, Amiga HardDisk und
 die Install-Diskette f&uuml;r ca. 40,- DM zu kaufen. Und das ist ja
 wohl ein winziger Betrag, oder???
 Ich bin vor allem mit dem Amiga HardDisk Buch zufrieden. Es geht
 sehr gut und verst&auml;ndlich auf Festplatten ein und erkl&auml;rt
 Einsteigergerecht die Programme auf der Install-Disk.

 Das Commodore keine Hotline anbietet, da&szlig; mu&szlig; ich selber
 bem&auml;ngeln, da hat er schon recht, der Axel Melzener. Aber das
 liegt daran, das Commo immer kein Kohle hatte. Wird sich ja jetzt
 &auml;ndern, wenn der neue Investor kommt. :-)))))...

 Ebenso beim Reperaturservice. Aber was hat der Reperaturservice
 mit Einsteigerfreundlichkeit zu tun?

 Und: Die Zeiten, in denen Commodore Deutschland Schei&szlig;e gebaut
 hat, sind vorbei. Immer wenn ich dort anrufe, werde ich sofort
 freundlich und h&ouml;flich verbunden und die Ansprechpartner sind
 kompetent und freundlich. Wer es nicht glaubt, der soll selbst


 einmal bei Commodore Deutschland anrufen.

 Axel Melzener sagt auch, da&szlig; es f&uuml;r DOSEN PCs &uuml;berall, auch in
 jedem kleinsten Kaff Hilfe gibt. Dazu mu&szlig; ich sagen, da&szlig; der MS-
 DOS PC Industriestandard ist und auch sehr viel &ouml;fter verkauft
 worden ist, und es folglich auch mehr Service daf&uuml;r gibt.

 Au&szlig;erdem bieten Commodore Fachgesch&auml;fte auch Amiga-Verf&uuml;hrungen
 und Schulungen an, in denen sich ein Einsteiger fortbilden kann.

 Aber auch Hotlines von Softwareherstellern f&uuml;r den Amiga gibt es
 reichlich.

 Laut Axel Melzener gibt es fast keine Amiga&nbsp;B&uuml;cher zum kaufen.
 Das ist ja wohl ein Witz. O. K., es gibt nicht so viele B&uuml;cher
 f&uuml;r den Amiga als f&uuml;r den PC. Aber der PC ist Industriestandard
 und folglich gibt es da mehr Zubeh&ouml;r.

 Alleine im Grafik und Video Bereich gibt es f&uuml;r den Amiga
 massenhaft B&uuml;cher. Aber auch zum Betriebssystem (2.0, 3.0) gibt
 es B&uuml;cher. Und teuer sind die B&uuml;cher angeblich auch? Das ist ein
 noch gr&ouml;&szlig;eres Ger&uuml;cht.

 Auch findet man angeblich keine Gesch&auml;fte mehr, in denen man
 Amiga B&uuml;cher kaufen kann. In der Stadt, in der ich wohne, kenne


 ich ca. 4-5 L&auml;den, die Amiga-B&uuml;cher verkaufen und auch halbwegs
 immer gut informiert sind.

 Und au&szlig;erdem: die Workbench ist sehr einfach zu erlernen (ich
 kann mich da an meine Anfangszeit erinnern; die Grundfunktionen
 der Workbench hatte ich nach ein 1-2 Stunden inne...), wozu
 braucht man da 1000 seitige Dokumentationen? Gut, Dokumentation
 mu&szlig; sein, aber mal ehrlich,&nbsp;Herr Melzener: haben Sie ALLE B&uuml;cher,
 die ihrem Rechner Beilagen ausf&uuml;hrlich gelesen? Ich glaube nein.
 Und zwar, weil in den B&uuml;chern meist nur Kitsch drinnsteht.


 Zu 4) Herr Melzener behauptet, Multitasking sein auf einem PC
 erfunden worden. Gut, da&szlig; streitet ja auch niemand ab, wenn es
 stimmt. Das wei&szlig; ich jetzt allerdings nicht genau.

 Aber der Amiga ist der einzigste Rechner, der Multitasking
 tadellos beherrscht. Das m&uuml;ssen Sie ja wohl zugeben, oder?

 Ohne perfektes Multitasking w&uuml;rde ich heute nicht mehr auskommen.
 Ich lasse bei mir immer so 4-8 Programme gleichzeitig laufen und
 ich w&uuml;&szlig;te nicht, was ich ohne sie machen w&uuml;rde.

 Warum kann man beim Amiga nicht auf andere Betriebssystem
 zur&uuml;ckgreifen? Mit Emulatoren Karten geht alles. Auch Software-
 m&auml;&szlig;ig.


 Die Workbench ist also Eint&ouml;nig. Aha, sind sie so einer, der
 jeden Tag das Betriebssystem wechselt? M&uuml;ssen Sie unbedingt jeden
 Tag mit einem anderen Betriebssystem arbeiten? Wissen Sie
 eigentlich, wie sch&ouml;n man die Workbench machen kann? Da schaut
 Windows ziemlich alt aus. Haben Sie denn schon mal MagicWB und
 ToolManager und die anderen kleinen Tools gesehen. Alles PD-Soft.
 Fast zum Nulltarif. Wenn ich meine Turbokarte mit mehr Speicher
 habe, dann geht die Post ab. 256 Farben oder HAM8 auf der
 Workbench, sch&ouml;nes Hintergrundbild und vieles mehr.

 LINUX soll also sehr verbreitet sein? Das ich nicht lache.
 Vielleicht bei Freaks (sofern es beim DOSEN&nbsp;PC &uuml;berhaupt welche
 gibt) etwa. Aber beim Otto Normalverbraucher?

 Au&szlig;erdem behaupten Sie, man kann auf der Workbench nur
 Hintergrundbildschirme bis 256 Farben benutzen. Stimmt nicht. Ich
 habe schon &ouml;fters einmal Bilder in HAM8 dargestellt. Wenn Sie es
 nicht wissen: Mit HAM8 kann man Bilder in bis zu 600.000 Farben
 darstellen.

 Netzwerk auf der Workbench ein Fremdwort? Wo leben Sie denn? Auf
 dem Pluto? Haben Sie vielleicht schon mal etwas von ENVOY geh&ouml;rt?
 Vermutlich nicht. Auf dem Amiga gibt es mittlerweile viele
 Netzwerk Hard- und Software.


 Bei der Workbench bekommt man nichts geboten? Das ist falsch. Ich
 halte das OS 3.0 (oder jetzt schon 3.1) f&uuml;r eines der besten
 Betriebssysteme &uuml;berhaupt. Ich kenne das OS 3.0 bis ins letzte
 Detail. Die Workbench ist aber auch gut ausgestattet: vielf&auml;ltige
 Voreinstellungsprogramme, Uhr, Anzeigeprogramme (z. B.
 Multiview), Taschenrechner, Editoren, Icon-Editor, Commodities,
 Backupprogramm,&nbsp;Programmiersprache, Festplattenkonfiguration,
 CrossDOS  zum austauschen von Daten zwischen Amiga und PC und und
 und

 Das Drag and Drop Prinzip funktioniert beim Amiga auch
 tadellos!!! Das soll mir mal einer mit Windo(ose)ws zeigen.

 Au&szlig;erdem mu&szlig; man sich bei der Worbench nicht auf Dateinamen nur
 bis zu 8 Zeichen + 3 Zeichen Extension beschr&auml;nken. Da&szlig; ist ein
 sehr gravierender Nachteil von MS-DOS und Windows. Man mu&szlig; sich
 immer einen kurzen Namen ausdenken. Anders beim Amiga. Dort hat
 sehr viel mehr Platz zur verf&uuml;gung. Ja, Ja, da&szlig; angeblich so
 professionelle  MS-DOS mit so einem Fehler... Zum Amiga sagt man,
 da&szlig; er  unprofessionell sein, aber bei MS-DOS sind noch  "Kinder-
 krankheiten zu  sehen"


 Zu 5) Der PC ist im Spielemarkt zur Zeit dominant.


 Gut, das mu&szlig; ich zugeben. Das stimmt.

 Aber trotzdem haben Sie doch wieder ein paar unwahrheiten
 verbreitet.

 Sie behaupten, Wing Commander g&auml;be es nicht f&uuml;r das CD32. Stimmt
 nicht. Schauen Sie doch z. B. einmal in die Amiga-Fachzeitschrift
 AmigaPlus. Die bieten dort ein Komplettangebot mit CD32 und Wing
 Commander in 256 Farben und noch ein paar andere Spiele an.

 Spiele werden zuerst auf dem PC, dann auf dem Amiga umgesetzt.
 Stimmt nur teilweise. Das Spiel "Death of Glory" von Software
 2000 wurde z. B. als erstes f&uuml;r den Amiga entwickelt.
 Auch gibt es Spiele, die NUR auf dem Amiga erscheinen.

 F&uuml;r das CD32 sollen bis heute angeblich nur 20 Spiele erschienen
 sein. Das ist ein sehr schlechter Witz. Es sind schon &uuml;ber 100
 Spiele und die Zahl steigt an. Wenn man dann auch noch die
 anderen CDs dazurechnet, wie z. B. die Karakoe-CDs, dann wird es
 sehr viel. Die Zahl der Spiele f&uuml;r das CD 32 kann man fast gar
 nicht mehr &uuml;berblicken.

 Wer den Amiga in der Werbung angibt, der kann sich also seinen
 Ruf sonst wo hin stecken. Auch falsch.

 Schauen Sie doch mal in Spielezeitschriften. Dort finden Sie das,
 was Sie nicht glauben wollen.

 Auch das mit der 50% H&uuml;rde in Spielmagazinen ist ein Witz. Haben
 Sie eigentlich schon mal das affengeile Game Microcosm auf dem
 CD32 gesehen? Vermutlich nein. Sonst w&uuml;rden Sie nicht so reden.
 Ein siebenmin&uuml;tiger Science-Fiction Film OHNE&nbsp;MPEG. Ich habe es
 schon oft gesehen. Da reiben Sie sich die Augen, da&szlig; kann ich
 Ihnen versprechen.

 Zu 6) Amiga hat in Sachen Grafik und Sound nichts mehr drauf.

 Selten so gelacht. Ein Amiga 4000 hat angeblich keine 24-Bit
 Farbtiefe. Falsch!!! Er hat 16,8 Millionen Farben zur Verf&uuml;gung.
 Nur er kann Sie eben nicht gleichzeitig darstellen. Aber im HAM8
 Modus gehen bis zu 600.000 Farben, evtl. sogar noch mehr.

 Au&szlig;erdem: SeaQuest DSV ist zwar langweilig, aber die
 Grafikeffekte sind spitze. Au&szlig;erdem hat der Amiga viel mehr
 Anteil am Filmeproduzieren, wie Sie es sich w&uuml;nschen. Jurassic
 Park, High Crusade, Sea Quest DSV usw. wurden ganz oder teilweise
 mit dem Amiga erstellt.

 Noch was zur Serie SeaQuest DSV: Neulich habe ich mir wieder

 SeaQuest DSV angeschaut und mu&szlig; sagen, da&szlig; diese eine Folge sehr
 spannend wahr. Gut, eine Ausnahme, aber es wahr echt spannend.

 Mit dem Sound hapert es schon ein bi&szlig;chen beim Amiga, gut das
 gebe ich zu. Die n&auml;chsten Amigas werden zu 1000% mit 16-Bit DSP
 Sound ausgestattet sein.

 Gut, es gibt gute 16-Bit Soundkarten f&uuml;r die DOSE. Aber wer hat
 die schon. Mit 8-Bit kann man auch noch Super Sound abspielen.

 Und die 16-Bit Soundkarten f&uuml;r den Amiga, die angeblich so
 schlecht seien sollen, sind es nicht. Ich selbst habe die 16-Bit
 Soundkarten schon einmal im Einsatz gesehen.

 Au&szlig;erdem behaupten Sie, da&szlig; der Amiga ein Homecomputer ist.
 Komisch, da&szlig; ihn fast alle Fernsehsender in Deutschland als
 professionelles Ger&auml;t einsetzen. Schon komisch, wenn man es nicht
 wahrhaben will, oder???

 Zu 7) Na, jetzt m&uuml;ssen Sie auch mal was zugeben. Der Motorola
 Prozessor (ab 68000 aufw&auml;rts) ist eben nun mal besser.

 Penthium - unerreichbar? Das ist ein Ger&uuml;cht. Es gibt heute schon
 68040 Karten mit 50 MHz und sogar schon das Cyberstorm Board mit

 einem 68060 Prozessor mit 60 MHz. Den kann man bis 80 MHz Takten.
 Der hat, je nach taktung, so ab 70 MIPS aufw&auml;rts. Der kann es
 locker mit dem Penthium aufnehmen. Es sind ja beide CISC-
 Prozessoren. Und Risk?

 Haben Sie schon mal etwas vom Warp System geh&ouml;rt? Das ist ein
 System, da&szlig; auf RISC Prozessoren beruht. Es ist ein
 Parallelrechnersystem. Es kann unendlich ausgebaut werden. Wenn
 Sie mir es nicht glauben, dann schreiben Sie mir bitte, dann
 schicke ich Ihnen Informationsmaterial zu. Oder wenden Sie sich
 bitte an die Firma Activa International.

 Zu 8) Mit dem Amiga kann man also nicht im B&uuml;ro arbeiten. Haben
 Sie eigentlich schon mal Final Writer Release 2 gesehen. Vom
 Funktionsumfang her kann es mit Word f&uuml;r Windows locker
 konkurrieren. Oder das neue AmiWrite? Ich bin Beta-Tester von der
 neuen Version.

 Sie schreiben, der Leser ihres Berichtes solle auf Anhieb eine
 Textverarbeitung, eine Tabellekalkulation, eine Datenbank und ein
 DTP-Programm aufz&auml;hlen. No problem:


                             Final Writer 2
                                ProCalc 
                               Maxon Twist
                              Pagestream 3


 Diese Programme k&ouml;nnen es wohl mit PC-Software aufnehmen.

 Gut, zugegeben. CorelDraw ist wirklich ein sehr gutes Programm.
 Das stimmt wirklich.


 Zu 9) Der Amiga ist sehr System offen. Sie interpretieren das als
 ausrede. Es gibt angeblich so viele Emulatoren und Br&uuml;ckenkarten,
 weil man dann mit dem Amiga Sachen machen kann, die man so nicht
 machen kann.

 Kleiner Irrtum!!! Wenn ein Computersystem heute gut sein soll,
 dann mu&szlig; es auch kompatibel zu anderen Computersystemen gemacht
 werden.

 Der Amiga hat also veraltete Grafik und Soundformate. Guter Witz,
 denn die von Ihnen genannten Formate wie GIF, JPEG, PCX, MPEG...
 verwendet heute fast jeder. Ich z. B. arbeite haupts&auml;chlich mit

 GIF oder IFF.

 Soundformate gib es auf dem Amiga auch sehr viele. Darunter auch
 z.&nbsp;B. VOC oder WAV.

 Der Amiga kann keine PC-Musiken abspielen??? Auch ein Witz. Ein
 Freund von mir hat einen 386 und er sch&auml;tzt den Amiga sehr und
 wird sich auch einmal einen zulegen.

 Wir haben schon Texte, Grafiken und&nbsp;Sounds ausgetauscht und das
 geht so:

 Er formatiert eine Diskette und kopiert Grafiken und Sounds
 drauf. Und ich lese Sie mit Hilfe von CrossDos, das dem Amiga
 Betriebssystem beiliegt, kopiere die Daten und lese die Grafiken
 mit PersonalPaint oder Brilliance, die Sounds mit einer guten
 Soundsoftware und die Texte sind sowieso ASCII.

 Also, was wollen Sie denn???

 Das DPaint nur PC-IFF und Amiga-IFF abspeichern kann, das st&ouml;rt
 mich auch, aber z. B. mit Personal Paint 6.0 oder Brilliance ist
 das keine Problem.


 Sie finden es l&auml;cherlich, da&szlig; sich der Amiga noch mit der 880 KB
 Grenze rum&auml;rgern mu&szlig;. Ab dem Amiga 4000 hat jeder Amiga eine 1,76
 KB Floppy eingebaut. Jeder dritte Anwender hat heutzutage aber
 schon ein 1,76 KB Laufwerk. Und zum Vergleich:

 Im DD Format schafft der Amiga 880 KB, der DOSEN-PC aber nur 720
 KB. Das sind 180 KB mehr.

 Im HD Format schafft der Amiga 1,76 MB, der DOSEN-PC aber nur
 1,44 MB. Das sind 320 KB mehr.

 Und au&szlig;erdem: Es gibt auch noch DOSEN-User, die noch 5&frac14; Zoll
 Diskettenlaufwerke oder 3&frac12; Zoll Laufwerke mit 720 KB benutzen.

 Tja, der Amiga ist bei den Diskettenformaten eben doch &uuml;berlegen.
 Im DD und im HD Format hat der Amiga mehr Speicherkapazit&auml;t. Eine
 Tatsache, die sich nicht leugnen l&auml;&szlig;t, oder, Herr Melzener???

 So, jetzt habe ich Ihre "Thesen" richtiggestellt. Jetzt m&ouml;chte
 ich aber trotzdem noch paar Sachen bringen, die es auf einem MS-
 DOS PC nie geben wird.


 1) Das riesengro&szlig;e Amiga Freeware, PD und Sharewareangebot

 Auf dem Amiga gibt es das &uuml;berhaupt gr&ouml;&szlig;te Angebot an
 freikopierbare Software. Das zeigen alleine schon Serien wie
 Fish, Time, Saar, Franz...

 Und das sind nur die deutschen (bis auf Ausnahme von Fish)
 Serien. Z&auml;hlt man noch die aus den anderen L&auml;ndern dazu, dann
 wird die Sache langsam aber sicher un&uuml;berschaubar. Wenn man dann
 noch die einzelnen Programme dazuz&auml;hlt....

 Und im Bereich freikopierbarer Software gibt es einiges, was sich
 hinter kommerzieller Software nicht zu verstecken braucht.

 Es gibt Textverarbeitungen, Editoren, Datenbanken, Spiele,
 Utilities aller Art, Malprogramme und vieles mehr...

 Das Angebot ist riesengro&szlig;.


 2) Das Amiga-Feeling

 Beim Amiga existiert, &auml;hnlich wie beim C64 (man habe ihn
 selig!!!), ein richtiges Feeling.

 Wenn ich in der Schule vor einem 08/15 PC hocke, kommt &uuml;berhaupt
 kein Feeling auf.

 Sitze ich wieder daheim vor meinem Amiga, kommt wieder ein
 richtiges Feeling auf.

 Und ein Feeling wird beim DOSEN-PC nie aufkommen, weil man hier
 das Gef&uuml;hl bekommt "nur" vor einer Maschine zu sitzen, die nur
 f&uuml;r Datenerfassung zust&auml;ndig ist.

 Anders beim Amiga. Alle Amiga-Besitzer sch&auml;tzen ihr Ger&auml;t, weil
 es einfach mehr ist als "nur" eine Maschine...


 3. Amiga&amp;Video

 Diesen Punkt haben Sie wohl absichtlich ausgelassen, weil Sie es
 nicht glauben wollen, da&szlig; der Amiga in Sachen Video TOP ist.


 Der Amiga ist als Videoger&auml;t hervorragend geeignet. Das zeigt
 schon die riesengro&szlig;e Auswahl an Genlocks und Software f&uuml;r diesen
 Bereich.

 Was man mit dem Amiga und Video machen kann, da&szlig; bekommt man mit
 einer DOSE niemals hin.


 4. Raytracing

 Der Amiga ist eine hervorragende Maschine zum Raytracen. Das
 zeigen solche Programme wie Real 3D, Imagine, Aladdin 4D, Cinema
 4D...

 Raytracing geh&ouml;rt zu den vielen St&auml;rken des Amiga, und da&szlig; k&ouml;nnen
 Sie gar nicht abstreiten.


 5. Amiga-Hochburg Gro&szlig;britannien

 So wie in Deutschland der MS-DOS PC zur Zeit dominant ist, so ist
 der Amiga in Gro&szlig;britannien dominant. Der DOSEN-PC d&uuml;mpelt dort
 mit ca. 4-7% Marktanteil am Rande der Bedeutungslosigkeit herum.


 Man braucht doch nur einmal einen Blick in Englische Amiga-
 Magazine zu werfen. Man merkt sofort, da&szlig; dort der Amiga ganz
 deutlich die &uuml;berhand hat.

 Das zeigt auch die viele Hard- und Software, die aus England
 (oder besser&nbsp;Gro&szlig;brittanien) kommt.

 Ich k&ouml;nnte hier jetzt noch ewig weitererz&auml;hlen und die ganzen
 Vorteile des Amiga aufz&auml;hlen, aber das w&uuml;rde den ohnehin schon
 sehr gro&szlig;en Rahmen dieses Berichts ganz sprengen.

 Eines m&ouml;chte ich noch loswerden:

 FAZIT: Der Amiga ist und bleibt ein fester Bestandteil der
 Computerszene. Auch wenn es manche nicht wahrhaben wollen, der
 Amiga hat weiterhin seine Existensberechtigung.
 Und f&uuml;r mich ist der Amiga nach wie vor ein hervorragender
 Computer, mit unbestreitbaren Vorteilen und keiner wird mich je
 davon abbringen auf ein anderes Computersystem umzusteigen...

 Stefan Wunner



</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="dis.gif" alt="" width="640" height=
                "22" border="0" usemap="#dis0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

