<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META name="generator" content="HTML Tidy, see www.w3.org">
<TITLE>Startrek</TITLE>
</HEAD>

<BODY text="#ffffff" link="#0000ff" alink="#ff0000" vlink="#0000ff" bgcolor="#b0b0b0">
<TABLE width="100%" border="0" cellpadding="0" summary="Beitrag" bgcolor="#000000">
<TR>
<TD>
<MAP name="gam0">
<AREA shape="rect" coords="460,1,550,22" href="gam.html" alt="zur&uuml;ck">
</MAP> 

<CENTER>
<TABLE width="640" border="2" cellpadding="0" summary="Seitenformat" bgcolor="#000000">
<TR>
<TD align="center">
<IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>

<TR>
<TD>
<P align="center"><IMG src="gam06.gif" alt="titel"></P>
</TD>
</TR>
<TR>
<TD>           

<TABLE border="0" cellpadding="4" summary="Text" bgcolor="#9873db" width="76%" align="center">
<TR>
<TD>

<P>Trekkies aufgepa&szlig;t: Hier ist der Ultimative Test zu dem
(zugegebenerweise etwas &auml;lteren) Ultimativen Star Trek Game. Es ist
das bisher beste auf PD-Basis existierende Star Trek Game, programmiert von
Tobias Richter.</P>

<P>Hier &uuml;bernimmt man den Part des Captian Kirk der das Komando
&uuml;ber die U.S.S. Enterprise hat.Die Aufgabe des Spieles besteht darin
bestimmte Gegenst&auml;nde von einem Planeten zu einem anderen zu bringen,
oder einen bestimmten Quadranten von feindlichen Klingonen oder Romulanern
zu befreien.</P>

<P>H&ouml;rt sich einfach an? Ist es aber ganz bestimmt nicht. Am anfang
des ganzen befindet man sich auf der Br&uuml;cke der Enterprise und wartet
auf den ersten Auftrag.Von hieraus gibt man auch die gesamten Befehle, wie
z.B. Kursangaben, Kommunikation mit anderen Schiffen oder Planeten
u.s.w.Von hieraus hat man auch zugang zu dem Turbolift, mit dem man die
einzelnen Stationen des Schiffes erreichen kann, wi z.B. die
Offiziersmesse, den Transporterraum, den Shuttle-Hangar, Krankenstation.
Hier kann man auch seinen Spielstand abspeichern oder den
Schwierigkeitsgrad erh&ouml;hen.</P>

<P>Auf der Reise zu den verschiedenen Planeten begenen einem viele
Gefahren. Oft kommt es vor, da&szlig; man in einen l&auml;&szlig;tigen
Magnetsturm hineinkommt, durchden die Sensoren des Schiffes gest&ouml;rt
werden, oder ein Angriff der Romulaner oder Klingonen steht mal wieder an
der Tagesordnung. Aber f&uuml;r solche f&auml;lle ist die Enterprise ja
schlie&szlig;lich mit Phasern und Photonentorpedos best&uuml;ckt um das
Pack in die Unendlichen weiten des Universums zu Blasen. Sehr h&auml;ufig
wird man auch Schiffe der F&ouml;deration treffen, die einem entweder nur
viel Gl&uuml;ck w&uuml;nschen wollen oder zu wenig Energie haben und um
Hilfe rufen. Mit der Zeit wird das Spiel immer schwieriger, d.h. man
bekommt immer mehr Auftr&auml;ge und immer mehr Feinde wollen uns eine
reinsemmeln. Die Steuerung ist sehr gut gelungen und man kann (fast) alles
bequem &uuml;ber Maus Steuern, nur das Steuern der Enterprise bei einem
Anflug in den Orbit eines Planeten mu&szlig; &uuml;ber den Freudenstab
geschehen. Es w&auml;re zwar nicht schlecht gewesen einige Funktionen auf
die Tastatur zu legen, wie z.B. das aktivieren der Schilde, aber das ist ja
nicht so wichtig.</P>

<P>Der Sound ist dergleiche wie in der Serie, alle Ger&auml;usche sind mit
dem Original identisch.Auch die Grafik ist f&uuml;r ein PD-Game einfach
fantastisch gelungen, hierbei kommt ein richtiges Enterprise-Feeling
auf.</P>

<P>Das Spiel breitet sich auf zwei Disketten aus, hat man aber genug RAM,
kann man sich alle Daten in den Speicher kopieren, so da&szlig;
l&auml;&szlig;tige Nachladezeiten vermieden werden. Das Spiel ist
Shareware, und falls es jemand noch nicht haben sollte, kann er es bei mir
anfordern und ich werde ihm das Teil dann zuschicken. Dazu m&uuml;&szlig;t
ihr mir aber zwei Leerdisks und Zwei Deutsche Mark an R&uuml;ckporto
beilegen.</P>

<P>Schreibt an:<BR>
Martin Dreisbach<BR>
Rothenberger Str. 31<BR>
57271 Hilchenbach</P>

<P>Als kleines "Schmankerl" zum schlu&szlig; noch
ein paar Pictures von dem Game Star Trek 25
Anniversary.Diese sind leider nur in 32 anstatt 256
Farben. Tschau,<BR>
Martin D.</P>
</TD>
</TR>
</TABLE>

<CENTER>
<IMG src="gam06a.png" alt="Schnitt von oben"><BR>
<IMG src="gam06b.png" alt="Cockpitbild mit Bildsteuerung"><BR>
<IMG src="gam06c.png" alt="Schnitt der Seitenansicht"><BR>
<IMG src="gam06d.png" alt="Stimmungsbild im Cockpit">
</CENTER>
<BR>
</TD>
</TR>

<TR>
<TD align="center">
<IMG src="gam.gif" alt="" width="640" height="22" border="0" usemap="#gam0"> </TD>
</TR>
</TABLE>
<BR>
</BODY>
</HTML>

