<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>A 570</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=""
    bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="hdw0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "hdw.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#004435">
              <TR>
                <TD><IMG src="hdw.gif" alt="" width="640" height=
                "22" border="0" usemap="#hdw0"> </TD>
              </TR>

              <TR>
                <TD>
                  <BR>
                  <BR>

                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#ff0000" align="center">
                    <TR>
                      <TD>
<PRE>
V2.1                         --nocover--
                         ++/--------------\++
              +************| HARDWARETEST |*************+
                         ++\--------------/++
                              --nocover--

               C  *  O  *  M  *  M  *  O  *  D  *  O  *  R  *  E  *

              **.      _      ***********   ***********   *********
             *. *.    /  _    *.........     ........ *  *        /*.
            *.  *.   |   _    *.                    .*   *       /.*.
           *.   *.    \_      *.                    *.   *      /. *.
          *.    *.            *.                   *.    *     /.  *.
         *.     *.  *******.  *********       ********   *    /.   *.
        *********.  ......      .......*       ..*..     *   /.    *.
       *.       *.                      *.     .*        *  /.     *.
      *.        *.                     *.     .*         * /.      *.
     *.         *.            *********.     .*          */.       *.
                                ......      .             *********.


                         ~~~~~~~~~~~~~~~~~~~~~~~~~
                        DAS CD - R O M f&uuml;r A500/A500+

                         ~~~~~~~~~~~~~~~~~~~~~~~~~~

    Ein Artikel &uuml;ber optische Datentr&auml;ger und der Feind eines jeden echten
                                Freaks, der PC


    Ein Test vom A570, dem Oldie, 1994 ?? Kann doch nur ein Scherz sein !
    Nein, ist es nicht. Diser Artikel hat durchaus seine Existenzberechti-
    gung, wenn man mal in die Anzeigen diverser Amiga(-Paper-)mags blickt.
    Der gr&ouml;&szlig;te Vorteil ist direkt erkennbar: Der Preis. F&uuml;r meist unter
    150 Kr&ouml;ten wandert die Kiste mit der korrekten Bezeichnung A570 CD-
    ROM-Interface &uuml;ber die Ladentheke. Das Design kann durchaus gefallen,
    was nicht immer bei "original-Commodore" Zubeh&ouml;r def Fall ist. Ein Ge-
    genargument in verschiedenen HW-Tests Ende '92, die Behinderung bei
    Arbeiten an der Tastatur, f&auml;llt nicht ins Gewicht. Mich hat das Teil
    in 2 Jahren Dauereinsatz noch nicht gest&ouml;rt. Die anderen `Bad-Points',
    die schlechte Vertr&auml;glichkeit mit Hardwareerweiterungen f&auml;llt wesent-
    lich st&auml;rker ins Gewicht:


    1.) Keine Vertr&auml;glichkeit mit Turbokarten, PC-Emulatoren (wen k&uuml;mmerts)
    2.) Das Bootmenu kann nicht mehr angesprochen werden (nur bei 2.0/3.0)
    3.) Auch beim 500+ kann nicht mehr von df1: gebootet werden
    4.) Manche Programme verweigern den Dienst bei eingeschaltetem ROM:
        Sysinfo, VirusChecker, VT, manche Spiele.
    5.) Der Expansion - Port ist NICHT durchgef&uuml;hrt. Das Rom kann auch
        nicht als letztes Glied in Reihe geschaltet werden. Fremde HD's
        bleiben leider Tabu.
    6.) Minimum 1MB CHIP (CHIP!)
    7.) Das Laufwerk fri&szlig; rund 100 kb. Wenn man anst&auml;ndig arbeiten will,
        m&uuml;ssen es mindestens 2MB sein.
    8.) Wenn man vom CD-Rom die W&uuml;rgbench gebootet hat und dann die CD
        wexeln will, antwortet der Compi mit einem netten Reset. Auch
        negativ ist es, wenn man gerade ein Bild gepixelt hat, und kommt
        an die Auswurftaste!! (Ich sehe mich jetzt noch mit Schaum um den
        Mund die Wohnungseinrichtung demolieren. Nur der Mangel an frischem
        Benzin verhinderte schlimmeres. Damals war es fast so sch&ouml;n wie
        '89, als das einzige Exemplar eines selbstgeschriebenen 64'er
        Progis von meiner Alten (ELTERN!!!!!) auf einen Lautsprecher
        (das war ihr &gt;&gt;&gt;letzter&lt;&lt;&lt; Fehler!!!) gelegt wurde.....)


    Wenn man aber eine Zeit lang mit dem Teil gelebt hat, lassen sich
    viele Eigenarten kompensieren. Zu...

    1.) soviel ich weis, nix zu machen. Da bleibt nur SCSI-CDROM...
        Im Zweifelsfall bei Ihrem freundlichem Commodere-Vertragsh&auml;ndler
        nachfragen. Etwa so:

        USER: Ich h&auml;tte da eine Frage zu A570'er..
        H&auml;ndler: Watt ???
        USER: A570-. Das CDROM f&uuml;rn 500`er
        H&auml;ndler: Datt Schi&szlig;ding?? Turbokarte f&uuml;r den alten "kleinen 500"
                 Am besten kauftst du dir einen neuen.........

    2.) A570 auschalten (geht sogar!). Naja, bei ECS ist das Bootmenu
        eh nicht so wichtig.
    3.) siehe 2.) Wenn aber gebootet ist, kann nat&uuml;rlich normal zugegriffen
        werden. Villeicht hilft ein Bootselector??


    4.) Sehr b&ouml;se, wenn das Liebligsprogi debei ist... (siehe 2.))
    5.) siehe unten. (ERWEITERUNGEN)
        Es soll auch die interne Mtec500 (150.- ohne HD) und auf jeden
        fall ParadoxSCSI (par-Port) laufen. Laut Hirsch und Wolf ist
        Paradox durchgef&uuml;hrt. Im Zweifelsfalle nachfragen.
    6.)-7.) Heute sollte sowieso JEDER MINDESTENZ 2MB haben


    8.) Von Disk buhten. Dann nix Broplems mit CD-Change.
        (Tut mir leid, die Sprache. Aber das kommt daher, da&szlig; ich
        heute das Gl&uuml;ck hatte, eine Laufschrift (mit echtem Scrolling)
        ca. 120 Punkte hoch, in 2 Farben auf einem 486/DX2 mit
        66Mhz bewundern durfte. Das ruckelte!! Unter "Ruckeln"
        verstehe ich HIER nicht leichte "Nachschubprobleme", das
        Ruckeln vermischte sich mit Flimmern, und ....
        Da war ich mal wieder einmal mehr froh, einen 7Mhz 500er
        zu besitzen. Der schaft die Laufschriften vor Sternenhinter-
        grund, 'ner Copperliste und dann noch rotierend oder Sinus..
        Aber was red ich, weis ja eh schon jeder...
        Als ich dann diesen Windows-verblendeten PC-Priester von einem
        Verk&auml;ufer mit meinem unnachahmlichen L&auml;ster-Grinsen :-&gt;&gt;&gt;&gt;&gt;
        auf dem Gesicht fragte, was DAS soll, und woher das ruckeln
        kommt, &uuml;berschwemmte er mich mit Dingen wie :
        " mit Zirrus-Chip (wer wei&szlig;, was das soll) und ner 2MB SVGA
          Karte sieht das ganz anders aus "                |
        " der hier hat ja nur 4MB " (Preis 2799.- )(4999.- v)
        " bald "kriegen" wir ja den Pentium "rein", der kanns besser "
        OK, ein Blick &uuml;ber den Tellerrand lohnt sich immer, wer
        Zeit und Lust hat, nervt Electronic-Allkauf in Mayen, Markt
        Sra&szlig;e XX.)


        Noch was: Kennt jemand das Plakat mit dem Wortlaut:
        Jede DOSe ist ein Schlag gegen dich selbst, sag nein zu
        DOsen.. (wirklich genial, man bekam es auf der WoC 93 am
        (na wo wohl...) ACP/TCP Stand. Hab letztens versucht,
        den Kaufhof in Mayen damit zu verseuchen. Vorsicht:
        PC-geile Kaufhof-Verk&auml;ufer M&Ouml;GEN DAS NICHT !!!!!!!!
        (genausowenig Mathestudenten, die im Studienkreis
        unterrichten.......Er tolerierte meine Aktion so
        lange, bis Er mir erz&auml;hlte, einer seiner Sch&uuml;tzlinge
        h&auml;tte w&auml;hrend der Stunde v&ouml;llig unmotiviert Schaum um
        die Fresse gekriegt und "ergj, das gibst doch nicht,
        chdkjh, das...." gestammelt. Um nicht einen Werwolf
        zu provozieren, war er gezwungen, die Kopien zu ent-
        fernen.) Da meine &Ouml;ko-Aktion fehlgeschlagen ist, und
        ich noch Copies davon habe, kann jeder gegen 1 Disk
        mit Demos, Pics oder Amos-Source eins bei unten genannter
        Adresse beziehen. Garantierte Antwort!! I also swap legal.
        &Uuml;brigenz habe ich auch inteloutside eps und iff &amp; 8svx stuff...
        CALL!!   (Das Ding ist [C] by Murphy/ICC (wer immer das auch
        sein mag, SPITZENIDEE)


        &Auml;hem, tja, an sich wollte ich ja &uuml;ber CD-Roms schreiben:

    Die Hardware, Verarbeitung:
    ~~~~~~~~~~~~~~~~~~~~~~~~~~
    Stabiles, amigafarbenes Kunsstoffgeh&auml;use. 2LEDS f&uuml;r Power und
    Drive. An der Front ist &uuml;brigens noch ein Lautst&auml;rkeregler f&uuml;r
    den Kopfh&ouml;reranschlu&szlig;. Die CD's werden in einen handels&uuml;blichen
    Caddy geputtet (sch&ouml;nes Wort, gell) und RICHTIGHERUM in den Schacht
    (mit sch&ouml;nem Staubschutzkl&auml;ppchen) gesteckt. Wenn man die CD wieder
    entfernen will, nimmt man einen ca. 1500g Haushaltshammer oder
    benutzt im Zweifelfalle die Auswurftaste, um mit einem CDTV-typischem
    "KLONG" den Caddy geliefert zu bekommen. Auf der R&uuml;ckseite der Netz-
    anschlu&szlig; (ein normales, moment, mal kucken...4.5 Ampere-Netzteil wird
    mitgeliefert), zwei Audio-IN Cinch (vom AMIGA) und zwei Out f&uuml;r den
    Monitor (schlecht) oder Stereoanlage (besser). Im A570 ist dann noch
    ein Mixer, der CD-Musik mit Amiga Sound mischt. Ausgeschaltet wird
    das Teil, wenn man den Lautst&auml;rkeregler ganz nach links (klick) dreht.
    Dann das interssanteste: Der Erweiterungsport:


    Erweiterungen:
    ~~~~~~~~~~~~~
    Hier k&ouml;nnen bisher folgende Erweiterungsmodule eingesteckt werden:
    - 2MB autoconfig 16Bit Fastram       ca. 249 DM
    - SCSI-Controller f&uuml;r bis zu 7 HD's, Scanner, Laserprinter,....
      ca. 149 DM
      Dieser Controller ist, wenn der Hinweis im A570 Handbuch korrekt
      ist, abschaltbar, mit abgeschaltetem CDROM Laufwerk betriebsbereit.


    Leistungen:
    ~~~~~~~~~~
    Wie man sich sicher denken kann, nachdem man das CDTV - Einschaltbild
    bewundert hat, steckt im A570 das 128kb - CDTV Rom. So gelten auch
    dessen Leistungen f&uuml;rs A570.

    - Abspielen von Musik-CD's im guten CDTV-Player direkt nach dem
      Booten von der Musik CD (in guter Qualit&auml;t).
      (Auch &uuml;ber WB m&ouml;glich, mit PRG auf beiligender Tools-Diskette)
    - Benutzen von CD+g CD's
      (CD's mit Graphikinformationen, die zum laufenden St&uuml;ck angezeigt
      werden: Liedtexte, Graphiken und Infos zur Band,....)
    - CD+Midi CD's (nur bei Zukauf eines Midi-Interfaces)
    - Abspielen von CDXL-Filmchen in 4096 Farben und 25 pics/s,
      die jeden "Video for Windows" "User" in den Suicid treiben
      Auf eine CD pa&szlig;t etwa 0.75 Std bei 0.25 ausgef&uuml;lltem Bildschirm.
      Gute Beispiele sind auf Pandoras-CD von Optonica (ca. 20 M&auml;use)
    - alle ISO 9660 Daten CD's. Auch welche, die f&uuml;r den PC konzipiert
      wurden, werden anstandslos geschluckt. &Uuml;ber WB laden
      (z.B.: Gifs Galore, Animazing, div. Schmuddel-CD`s )
    - Spezielle Amiga-CDRoms, wie FredFishCollection, CDPDx, usw
    - CDTV Anwendungen und Spiele.
      Sehr interessant f&uuml;r alle, die noch ein paar auftreiben k&ouml;nnen.


    * auf jede CD passen rund 700 Disks bei 630 Megabyte



    Das CDROM ist ein schnelles Single-Speed (ca. 155 kb/s) und
    Multisessionf&auml;hig, aber leider nicht PhotoCD-kompatibel.
    (Ich lasse mich SEHR gerne eines besseren belehren !)


    Lieferumfang:
    ~~~~~~~~~~~~~

    -CD-Rom Laufwerk                  - Winzer o.&auml;.(*)
    -Handbuch ca. 50 Seiten           - A570 FishCollection
    -Welcome CD mit Commodore-Werbung   (identisch mit CDPD1)
    -Tools Diskette                   - Caddy    -Netzteil
    * mu&szlig; nicht unbedingt dabei sein.


    Fazit:
    ~~~~~~
    Nicht die nur Hardware machen das Rom stark, sondern Preis und
    das Softwareangebot (siehe CD-Rom-&Uuml;bersicht in dieser Ausgabe.)
    Wenn mich noch vor 2 Jahren jemand gefragt h&auml;tte, was ich von
    diesem Drive oder dem CDTV halte, h&auml;tte ich ich ihm abgeraten.
    (In Anbetracht der &lt;=5 guten Scheiben, einschlie&szlig;lich der
    &lt;&gt;&lt;-CD, die aus dem erschlagenden Angebot an Multimedia-CD's
    wie Barnex Bear und Mypaint hervorstechen) Denn was nutzt einem
    z.B. der beste "DCC" oder "MiniDisc" Walkman ohne passendes
    "Futter" ?
    Allein wenn man sich 25 Fish-Disketten beim freundlichen PD-H&auml;ndler
    besorgt oder aus Netzen saugt, sind sicherlich &uuml;ber 50 Mark f&auml;llig.
    F&uuml;r das Geld bekommt man die "GoldFish" mit Fish 1-1000. Kleiner
    Unterschied, nicht war ? (Anmerkung: Auf Seite 114 der Amiga-Plus
    7/94 inserierte ein H&auml;ndler (Hirsch und Wolf, will ja nicht fies
    sein), der die Fish 1-930 CD f&uuml;r 19.- (NEUNZEHN MARK !!!) ver-
    ramschte (verkaufen kann man ja das nicht nennen.). Das sind we-
    niger als 0.02 DM pro Fish. Das hundertfache verlangt ein PD-
    H&auml;ndler (und das zu Recht!).


    Bewertung:
    ~~~~~~~~~~
    Bezieht sich auf 500(+)'er mit min.1MB Chip, ohne spec. Erweiterungen.

    Dokumentation       :  2 von 10  **-------- |*|
    Preis/Leistung      :  9 von 10  *********-
    Verarbeitung        :  9 von 10  *********-
    Funktionssicherheit : 10 von 10  ********** |**|

    [*]

    Keine technischen Daten, Kein Glossar, keine Fehlerhilfe usw

    [*|*]
    Sogar total verkratzte Daten-und ProgrammCD ohne Geschwindigkeits
    und Datenverlust konnten gelesen werden.

     *   *+++++   / Article by
    * * *+ by    /         Stephan Kraus Dial:02652/2813
   *   *+++++   /                         NO INTELS WILL BE ACCEPTED !
   ACP / TCP   / I. d. Forstwiesen 7   |||  56745  BELL   |||

</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                  <BR>
                  <BR>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="hdw.gif" alt="" width="640" height=
                "22" border="0" usemap="#hdw0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

