<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Spielekiste 1-50</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="pdl0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "pdl.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#540000">
              <TR>
                <TD><IMG src="pdl.gif" alt="" width="640" height=
                "22" border="0" usemap="#pdl0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#0075a7" align="center">
                    <TR>
                      <TD>
<PRE>



                        S p i e l e k i s t e   # 01

   Flaschbier      : Kultspiel um Werner; ein Mu&szlig; f&uuml;r jeden Br&ouml;sel-Fan!
                     200 Level!! Lange Knobelstunden sind garantiert...
               ---&gt;  Kleiner Hinweis: Start mit der Funktionstaste &gt; F1 &lt;.
                     Autor: JPN

                        S p i e l e k i s t e   # 01 T

   Flaschbier +    : Da es f&uuml;r einen Gro&szlig;teil der Werner-Fans nicht m&ouml;glich
                     war alle Levels durchzuspielen, gibt es jetzt endlich
                     auch eine Trainerdisk dazu. 
               ---&gt;  Diese Disk ist nur direkt bei BERLIN-PD erh&auml;ltlich!



                        S p i e l e k i s t e   # 02

   MiniBlast       : Sch&ouml;nes Multitasking-Spiel (w&auml;hrend der Rechner arbei-
                     tet, mal schnell eine Runde spielen...). Ziel des Spiels
                     ist es, nicht von den Raketen getroffen zu werden, dabei
                     aber selbst so viele wie m&ouml;glich abzuschie&szlig;en und dabei
                     nicht an den Felsen zu zerschellen.
                     Autor: Anders Bjerin

   Pipeline        : Unter Zeitdruck mu&szlig; eine Pipeline bis zum Abnehmer ge-
                     baut werden. Dieses Strategie- und Geschicklichkeits-
                     spiel hat eine fantastische Grafik und ausgzeichnete
                     Soundunterst&uuml;tzung, die einem kommerziellen Spiel in
                     nichts nachsteht.
                     Autor: Andr&eacute; Wichmann (CLUSTER)

   ChinaChallenge  : Fesselndes Denk- und Strategiespiel &agrave; la Shanghai; freie
                     Spielsteine gleichen Aussehens m&uuml;ssen paarweise vom
                     Spielfeld entfernt werden.
                     Autor: Dirk Hoffmann

   SYS 2.1         : Ein zeitgem&auml;&szlig;es Spiel: die Harddisk des Computers mu&szlig;
                     von Viren befreit werden! Mit h&uuml;bscher Grafik und Sound.
                     Autor: Anders Bjerin



                        S p i e l e k i s t e   # 03

   Car V2.0        : Ein tolles Autorenn-Spiel mit weichem Scrolling.
                     Autor: Anders Bjerin

   Tetris          : Das weltbekannte Tetris in einer PD-Variante;
                     mit 2-Spieler-Modus und hervorragendem Sound.
                     Autor: Andy Hook

   The Turn V1.1   : Ein Denkspiel der gehobenen Klasse: Sie m&uuml;ssen
                     die Pl&auml;ttchen dem Muster in der rechten unteren
                     Ecke entsprechend verstellen. Stundenlanges Kno-
                     beln ist angesagt...
                     Autor: Peter H&auml;ndel

   Tron            : Weitere Tron-Variante. Kann alleine oder gegen
                     einen Mitspieler gespielt werden.
                     6 Spieler spielen insgesamt mit; dabei kann der
                     Computer bis zu f&uuml;nf Spieler selbst &uuml;bernehmen.
                     Autor: Dirk Hasse



                        S p i e l e k i s t e   # 04

   Emporos         : Ziel dieses sch&ouml;nen Spieles ist es, ein Land zu erwer-
                     ben - aber der Weg dorthin wird nicht verraten! Gelun-
                     gene Handelssimulation; Shareware.
                     Autor: Roland Richter

   Feldherr V3.1   :  Du bist Anf&uuml;hrer einer Armee zur Zeit des 30-j&auml;hrigen
                     Krieges und mu&szlig;t diese siegreich im Kampf gegen angrei-
                     fende Feinde f&uuml;hren. Shareware.
                     Autor: Mentos

   XyTronic        : Weltraumhandelsspiel; Du kannst Dein Raumschiff mit
                     verschiedenen Waffen ausr&uuml;sten, um Piraten abzuwehren,
                     fremde Planeten und St&auml;dte aufsuchen, Handel treiben,
                     usw.
                     Autor: Andreas Uhl

   Imbiss III      : Als Besitzer einer Imbissbude mu&szlig;t Du durch richtigen
                     Ein- und Verkauf diese zum wirtschaftlichen Erfolg f&uuml;h-
                     ren. Einfach aber feine Handelssimulation.
                     Autor: Oliver Schwald



                        S p i e l e k i s t e   # 05

   Quizmaster 2.0  : Quizspiel f&uuml;r 1 - 4 Personen. Aus einem Feld wird von
                     jedem Mitspieler eine Frage ausgew&auml;hlt, worauf vier
                     m&ouml;gliche Antworten erscheinen, die man mit dem Joystick
                     anw&auml;hlen kann. Mit 300 Fragen/Antworten, HiScore-Liste,
                     Punktestand, Zeitlimit, Risiko, Frageneditor zum Erwei-
                     tern des Fragenkataloges uvm. Komplett in Deutsch.
                     Autor: F. Z&ouml;llner



                        S p i e l e k i s t e   # 06

   Imperium Romanum: Strategiespiel f&uuml;r zwei Personen. Ort der Handlung
                     sind die befeindeten St&auml;dte Rom und Karthago zur
                     Zeit der Antike. Jeder Spieler &uuml;bernimmt eine Stadt
                     und mu&szlig; mit allen Mitteln versuchen, den Sieg &uuml;ber
                     den Gegner zu  erringen.
                     Autor: Roland Richter

   TADRisk         : Eine Risiko-Variante die einfach zu spielen ist.
                     Verschieden viele Computer-Gegner sind m&ouml;glich.
                     Autor: Stefan Zickenheiner

   MigaMind        : Kleine Mastermind-Variante.
                     Autor: Ekke Verheul

   Puzzle          : Ein Puzzle-Programm, bei dem man mittels eines Text-
                     Files und eines IFF-Bildes eigene Puzzles kreieren
                     kann. Mit mehreren Demos.
                     Autor: Martin Round

   Billard         : Kleines, aber feines Billiard-Spiel.
                     Autor: Stefan Salewski



                        S p i e l e k i s t e   # 07

   The Death       : Spannendes Sammel- und H&uuml;pfspiel. Als Sensenmann mu&szlig;t
                     du die Seelen der Toten aufsammeln, ohnt mit den vie-
                     len Gegnern in Ber&uuml;hrung zu kommen. Der Weg geht durch
                     viele Levels. Wichtig sind besonders die Bonuszeichen,
                     die Punkte, Extraleben o.&auml;. bringen.
                     Autor: Sven Hasselmeyer

   MiamMan         : Eine Art 'Snake Byte'. Hier m&uuml;ssen unter Zeitdruck
                     Pillen und diverse Extras eingesammelt werden. Je
                     mehr man fri&szlig;t, desto l&auml;nger wird der Schwanz der
                     Schlange. Ber&uuml;hrt man sich selbst oder die Mauern
                     des Labyrinths, verliert man ein Leben.
                     Autor: Gully

   Rollerball      : Vom Prinzip her &auml;hnlich wie 'Escape from Jovi'.
                     Eine Kugel mu&szlig; durch ein enges Labyrinth in einer be-
                     stimmten Zeit gesteuert werden, um dann in den n&auml;chsten
                     Level zu kommen. Die Steuerung dieser Kugel geschieht
                     mit der Maus.



                        S p i e l e k i s t e   # 08

   Return to Earth : Die R&uuml;ckkehr zur Erde ist ein komplexes Weltraum-
                     Strategie-Handelsspiel mit viel Action. Sie sind ein
                     listiger Weltraumhase und reisen mit Ihrem Weltraum-
                     kreuzer von einem Ende des Universums zum anderen.
                     Nat&uuml;rlich erwartet man Sie nicht &uuml;berall mit offenen
                     Armen. Es ist daher nicht immer leicht seine Transport-
                     oder Spezialauftr&auml;ge wahrzunehmen.
                     Das &uuml;bergeordnete Ziel dieses rasanten Spieles liegt
                     im Auffinden der Erde. Diese ist leider in keiner neu-
                     eren Weltraumkarte mehr eingezeichnet. Sie m&uuml;ssen da-
                     her einen Planeten aufsp&uuml;ren, der ein Archiv mit alten
                     Weltraumkarten hat. Kein leichter Job!
                     Mit ausf&uuml;hrlicher deutscher Anleitung.
                     Autoren: Roland Hartz &amp; Ralf B&ouml;wing



                        S p i e l e k i s t e   # 09

   Chess 2.0       : Schach in einer PD-Version; recht spielstark.
                     Autor: Alfred Kaufmann

   Peters Quest    : Umfangreiches "Jump-and-Run"-Spiel. Deine Freundin
                     mu&szlig; vor diversen Monstern gerettet werden.
                     Autor: David W. Meny

   Paccer 1.0      : PacMan-Variante mit Level-Editor, vielen verschie-
                     denen Leveln und einigen neuen Spielelementen.
                     Autor: Dirk Hoffmann

   Move            : Kleines, nur 4 kB-gro&szlig;es Strategiespiel. Sie m&uuml;ssen
                     versuchen, das fertige Muster mittels Verschiebung
                     der Balken wieder herzustellen.



                        S p i e l e k i s t e   # 10

   Kaiser II       : Eine reizvolle Simulation, die im Mittelalter ange-
                     siedelt ist. Werden Sie Kaiser!
                     Autor: Andreas D&ouml;rrschuck



                        S p i e l e k i s t e   # 11

   LightCycle 3D   : Tron in 3D! In 10 hektischen Leveln mu&szlig; der Fahrer sein
                     Fahrzeug fehlerfrei durch das Labyrinth f&uuml;hren. Vorsicht
                     vor pl&ouml;tzlich auftauchenden W&auml;nden und rammenden Gegnern
                     Autor: Tobias Richter (AGAtron)

   HighSpeed       : Einfache Tron-Umsetzung; Du steuerst ein Fahrzeug, das
                     eine Mauer hinterl&auml;&szlig;t, wodurch das Spielfeld immer enger
                     und gef&auml;hrlicher wird. Mit Extra-Waffen lassen sich Geg-
                     ner und Mauern zerst&ouml;ren - aber diese gibt es nicht &uuml;ber-
                     all!
                     Autor: Sven Hasselmeyer

   PseudoTron      : Weitere kleine Tron-Variante in einer BASIC-Umsetzung.
                     Autor: "Hmaak"

   Cycles          : Und noch einmal Tron! Jetzt mit zus&auml;tzlichen Hinder-
                     nissen! Steuerung &uuml;ber Cursor- oder Zahlentasten.
                     Autor: John G. Gilmore



                        S p i e l e k i s t e   # 12

   TunnelVision    : Durch ein dreidimensionales Labyrinth m&uuml;ssen Sie
                     den Weg ins Ziel finden. Hilfreich sind Ihnen da-
                     bei eine Karte und Sensoren.

   Monopoly 1.2    : Ausgezeichnet gemachte Monopoly-Version. Man spielt
                     zu viert, wobei drei Spieler vom Computer &uuml;bernom-
                     men werden. Dieses urspr&uuml;nglich englische Programm
                     wurde komplett ins deutsche &uuml;bertragen.

   Othello         : Reversi-Version mit sehr sch&ouml;ner Grafik. Man kann
                     auch den Computer gegen sich selbst spielen lassen.


                        S p i e l e k i s t e   # 13

   Pythagoras V2.0  : Handelssimulation f&uuml;r 1-4 Spieler. Jeder mu&szlig; versuchen,
                     sich als K&ouml;nig durchzusetzten. Die Aufgaben sind: Han-
                     deln, Steuern festlegen, Schiffe und Land kaufen, Krieg
                     f&uuml;hren, St&auml;dte angreifen usw. Update!
                     Autor: Marc Fischlin

   Faxen           : Verschiebepuzzle mit 12 verschiedenen Bildern.
                     Autor: Bernd Kr&auml;uter

   Quattro         : Wieder einmal eine gut gelungene Tetris-Variante!
                     Autor: Karl-Erik Jenss

   Towers          : Besser bekannt unter dem Namen "T&uuml;rme-von-Hanoi-Spiel".
                     Mit m&ouml;glichst wenig Z&uuml;gen mu&szlig; ein Turm umgeschichtet
                     werden.

   VideoPoker      : Ein Pokerspiel; &auml;hnlich den beliebten Spielautomaten.
                     Autor: Richard Bonny

   Zerg V1.0       : ZERG ist ein Phantasie-Rollenspiel &auml;hnlich der Ultima-
                     Serie. Man f&uuml;hrt einen Ritter und k&auml;mpft gegen Monster,
                     Goblins, Orcs, Trolls, Drachen, redet mit der Stadt-
                     bev&ouml;lkerung, spricht Zaupersp&uuml;che und &auml;hnliches mehr.
                     Zerg ist ein komplexes Spiel, das sicherlich lange Zeit
                     fesseln wird.
                     Autor: Mike Shapiro



                        S p i e l e k i s t e   # 14

   Amoeba          : Klassisches Invader-Spiel in einer 1:1-Umsetzung nach
                     dem Vorbild. Steuerung &uuml;ber Tasten oder mit Maus.
                     Autoren: Chris Halsall, Ewan Edwards

   YachtC          : Besser unter dem Namen "Yahtzee" bekanntes W&uuml;rfelspiel
                     f&uuml;r gesellige Stunden.
                     Autor: Sheldon Leemon

   EgyptianRun     : Mit dem Landrover durch die W&uuml;ste - aber pl&ouml;tzlich auf-
                     tauchende Pyramiden und andere Hindernisse m&uuml;ssen reak-
                     tionsschnell umfahren werden. Shareware.
                     Autor: Chris Hames

   Asteriods       : Noch ein Klassiker - sch&ouml;ner Asteroids-Verschnitt. Steue-
                     rung &uuml;ber die Tastatur: z und x (rotieren), / (feuern)
                     und Space (Hyperspace).
                     Autor: Rico Mariani

   Stadt-Land-Flu&szlig; : Wer hat es nicht schon mal irgendwann gespielt? Einfach
                     gehaltene Computerumsetzung mit den Rubriken Stadt, Land,
                     Flu&szlig;, Tier, Name, Beruf.
                     Autor: Torsten Conradt



                        S p i e l e k i s t e   # 15

   DungeonKrampfer : Alternative zum Original (DungeomM...). Befreien Sie
                     Ihre Kleinstadt von der Besetzung durch intergalakti-
                     sche Megaknubbel. Es gibt viele Dungeons zu erforschen
                     und R&auml;tsel zu l&ouml;sen, wobei Sie sicherlich auf nicht ganz
                     allt&auml;gliche Probleme sto&szlig;en werden. Ausgezeichnete Grafik
                     und Animation machen dieses Spiel zu einem PD-Hit.
                     Durchgehende Maussteuerung und komplett deutsch. 1MB.
                     Autoren: J. Beckmann &amp; U. Krumnack



                        S p i e l e k i s t e   # 16A+B

   Return to Sinking Island: Bei diesem Programm handelt es sich um eine
                     bunte Mischung aus Adventure und Rollenspiel mit einem
                     guten Schu&szlig; Humor. Es geht darum, auf einer von der
                     Flut bedrohten Insel einen Schatz zu finden. Dabei
                     wird man mit verschiedenen Problemen konfrontiert, die
                     einem das Leben schwermachen (steigender Wasserspiegel,
                     Hunger, Fallen etc.). 1 MB notwendig.



                        S p i e l e k i s t e   # 17

   17 und 4        : Das bekannte Gl&uuml;cksspiel in einer einfachen, aber sehr
                     schnellen und ausgezeichnet spielbaren Umsetzung.
                     Autor: Roger Fischlin

   Speedrunner     : 20 Levels eines gut gemachten Jump &amp; Run-Clones, der in
                     der kommerziellen Version 200 Levels umfa&szlig;t.
                     Vertrieb: Kunert Soft

   Backgammon      : Sch&ouml;ne, in C programmierte, gut spielbare Umsetzung.
                     Autor: Robert Pfister

   BoulderCrash 1.3: Das C-64 Kultspiel in einer einfachen PD-Umsetzung
                     f&uuml;r den Amiga - und gleich in zwei Varianten.
                     Autor: Wolfgang Schulz

   Lucky Loser     : Gl&uuml;ckspiel am simulierten Gl&uuml;ckspiel-Automaten. Gut
                     gemacht; mit deutscher Anleitung.
                     Autor: Lothar Maier

   Balls &amp; Pipes   : "Vier-Gewinnt"-Variante. Macht besonders mit 3 oder 4
                     Mitspielern gro&szlig;en Spa&szlig;; mit deutscher Anleitung.
                     Autor: Joachim Scholz

   Tiles           : Fesselndes Strategiespiel in der Tradition der chi-
                     nesischen "Shanghai"-Brettspiele. Selbstverst&auml;ndlich
                     mit deutscher Anleitung.
                     Autor: Todd M. Lewis

   SlotCars        : Spielbares Demo des kommerziellen Produkts.
                     Hersteller: Polyglott Software

   Turrican        : Spielbares Demo des bekannten kommerziellen Games.
                     Gut animiert - f&uuml;r alle Ballerfans ein Mu&szlig;!
                     Hersteller: Rainbow Arts



                        S p i e l e k i s t e   # 18

   Drip            : Action-Spiel, bei dem man ein Rohrger&uuml;st ablau-
                     fen und dabei Tropfen sammeln mu&szlig;. Einige unliebsame 
                     Gesellen versuchen das zu verhindern. Mit sch&ouml;ner Gra-
                     fik und Sound.

   Mykene          : Spannendes Strategiespiel, bei dem man die Rolle
                     eines Herrschers &uuml;bernimmt und nun &uuml;ber Steuern, L&auml;n-
                     der, Bewohner und Armeen bestimmt.



                        S p i e l e k i s t e   # 19

   Pamehta         : Tolles Shareware-Grafikadventure mit sch&ouml;nen Grafi-
                     ken und Sound.
                     Autor: Philippe Gressly / Amok Club



                        S p i e l e k i s t e   # 20

   Dragon Cave     : Ein wirklich gut gemachtes Spiel im "Sokoban"-Stil
                     mit sch&ouml;nen Sound Effekten, zwei- oder dreidimensiona-
                     ler Grafik, 100 Levels (und eigenem Editor), mit der
                     M&ouml;glichkeit, zum schnelleren Laden viele Daten-Files
                     ins RAM zu laden und und und... Dazu: eine deutsche
                     Kurzanleitung auf der Workbench und eine ausf&uuml;hrliche
                     deutsche Anleitung, die in das Spiel integriert ist.
                     Das Spiel selbst kann in deutsch oder englisch gespielt
                     werden.
                     Autoren: Hartmut Stein, Michael Berling



                        S p i e l e k i s t e   # 21

   Spiele-Pack     : SuperBrickout, Valley of the Aztecs, BattleShip,
                     Hearts, BrainWork, Kniffel 2.5, Zauberfl&auml;chen



                        S p i e l e k i s t e   # 22

   Broker V1.0     : Ein sehr gutes deutsches B&ouml;rsenspiel f&uuml;r bis zu 4 B&ouml;r-
                     senspekulanten. Shareware.
                     Autor: Andreas Page



                        S p i e l e k i s t e   # 23

   Mensch!         : Kleine "Mensch &Auml;rgere Dich Nicht"-Umsetzung f&uuml;r 1 - 4
                     Spieler.
                     Autor: J&ouml;rg Moldenhauer

   Mondlandung     : Kleines Man&ouml;verspiel f&uuml;r Zwischendurch. Mit einer Rakete
                     sanft auf dem Mond landen.
                     Autor: Brian Allston

   KamikazeChess   : R&auml;uberschach - wer zuerst alle Schachfiguren verloren
                     hat, der hat gewonnen! (Mit Schlagpflicht.)
                     Autor: ???

   SpaceWar        : Mit dem Raumschiff den Gegner abschie&szlig;en; leider nur
                     2-Spieler-Modus.
                     Autor: Guido Appenzeller

   XFire           : Feuern, Feuern und nochmals Feuern... Hektisches Reak-
                     tions- und Ballerspiel.
                     Autor: Andreas Ehrentraut

   Gridder         : Ein 64er Oldie in einer exzellenten Amiga-Umsetzung!
                     Hektisches Einf&auml;rbespiel.
                     Autoren: Cryptoburners

   SMART Rocket    : SMART steht f&uuml;r "Seek Mouse And Ravage Techniques" -
                     nach dem Programmstart mu&szlig; sich der Mauszeiger vor einer
                     zielsuchenden Rakete in Sicherheit bringen. Nettes Gag-
                     programm!!
                     Autor: Lars R. Clausen



                        S p i e l e k i s t e   # 24

   Expander        : Kleines Denk- und Konzentrationsspiel um den MEF (= Mind
                     Expansion Factor), der m&ouml;glichst hoch geschraubt werden
                     mu&szlig;.
                     Autor: David A. Visage

   Missile         : Der Name Missile Defense sagt schon alles! St&auml;dte m&uuml;ssen
                     vor Angreifern und Raketenbesch&uuml;ssen verteidigt werden.
                     Hektisches Ballerspiel.
                     Autor: Glen Merriman

   Daleks          : Nach einer amerikanischen Fernsehserie (Dr. Who). Du
                     bist als Spieler von vielen Daleks umzingelt und mu&szlig;t
                     versuchen, diese zu vernichten. Und wenn Du ganz ge-
                     schickt bist, dann zerst&ouml;ren sie sich auch selbst...
                     Shareware.
                     Autor: Robert Paauwe

   Bouncer         : Sch&ouml;nes H&uuml;pf- und Geschicklichkeitsspiel mit einer Kugel.
                     Diese mu&szlig; &uuml;ber ein zerst&uuml;ckeltes Brett bef&ouml;rdert werden.
                     Aber da gibt es noch viele Gegner, die das verhindern
                     wollen...
                     Autor: ?

   Bankn           : Damit lassen sich diverse Bankgesch&auml;fte einfacher gestal-
                     ten; Version 1.3. Shareware.
                     Autor: Hal Carter

   Rocket          : Kleines Workbench-Spielchen f&uuml;r Zwischendurch (Workbench
                     Lander); eine Rakete mu&szlig; mit den Cursortasten sicher zu
                     Boden gesteuert werden.
                     Autor: Peter da Silva



                        S p i e l e k i s t e   # 25A+B

   StarTrek        : Weltraumspiel um den gleichnamigen Kultfilm &uuml;ber 2
                     Disks. Uneingeschr&auml;nkt empfehlenswert!
                     Autor: Tobias Richter



                        S p i e l e k i s t e   # 26

   The J.A.R.      : Ein aufwendig gemachtes Jump-an-Run-Spiel.
                     Reinschauen!

   Kart            : Sch&ouml;nes Go-Kart-Spiel mit 6 verschiedenen Kursen.
                     Autor: Axel Ilenburg



                        S p i e l e k i s t e   # 27

   Dark-Star       : Sie sind Captain James T. Gurk und fliegen mit
                     ihrem Raumschiff USS-Entenschei&szlig; &uuml;ber einen Planeten,
                     der von feindlichen Kling-Melonen besetzt ist.

   Exterminator    : Ballerspiel f&uuml;r 1 oder 2 Spieler, erstellt mit
                     S.E.U.C.K.

   Jumpy           : H&uuml;pf- und Sammelspiel mit 256 Leveln. Mit Level-
                     Editor und deutscher Anleitung.



                        S p i e l e k i s t e   # 28

   Atlantis        : Interessantes Rollenspiel komplett in Deutsch. Wan-
                     deln Sie durch eine unbekannte Landschaft, erforschen
                     Sie Ruinen und St&auml;dte, und bestehen Sie die Abenteuer,
                     die auf Sie warten. 1 MB notwendig.



                        S p i e l e k i s t e   # 29

   Blizzard        : Phantastisches Ballerspiel mit sehr guter Animation.



                        S p i e l e k i s t e   # 30

   Lame ST Ports   : Hinter diesem Namen verbirgt sich ein tolles Space-
                     Invaders. Der Spielablauf entspricht dem originalen
                     Invaderprogramm, nur die abzuschie&szlig;enden Monster wer-
                     den u.a. von Atari-Symbolen dargestellt. Mit 1- oder 2-
                     Spieler-Option und verschiedenen Spielvarianten.



                        S p i e l e k i s t e   # 31

   Mariko          : Auf einem 8x12 Felder gro&szlig;en Spielbrett m&uuml;ssen 72 Spiel-
                     steine plaziert werden. Dabei m&uuml;ssen benachbarte Steine
                     entweder mit ihrem Symbol oder der Umrandung &uuml;berein-
                     stimmen. Eine wirklich knifflige Sache in 7 Schwierig-
                     keitsstufen...

   Reactor V1.0    : Durch geschicktes Setzen und dem damit verbundenen
                     Ausl&ouml;sen von Kettenreaktionen mu&szlig; man versuchen als
                     einziger auf dem Reactor-Feld &uuml;brigzubleiben. Bis zu
                     Spieler k&ouml;nnen teilnehmen - aber Achtung:  Suchtgefahr!

   Q-Ball          : Auf einem Spielfeld mu&szlig; versucht werden, eine Anzahl Ku-
                     geln in eine Reihe zu schieben. Dies w&auml;re noch recht ein-
                     fach, wenn es nicht die Monster g&auml;be, die einen st&auml;ndig
                     verfolgen und die Arbeit erschweren.

   BackGammon      : Ein Klassiker unter den Brettspielen.



                        S p i e l e k i s t e   # 32

   Hanse II        : Strategiespiel f&uuml;r einen oder auch mehrere Spieler.
                     Als Jungunternehmer m&uuml;ssen Sie eine Handelsgesell-
                     schaft aufbauen. 

   Raumstation     : Suchen Sie 5 Raumschiffe im Weltall mit Hilfe von Sa-
                     tellitenanfragen. Ein echtes Denkspiel mit guter Grafik.
                  

   Obsess          : Tetris-Variante mit einigen neuen Optionen; Steuerung
                     &uuml;ber die Tastatur.

   Mad Factory     : Gut gemachtes Spiel, bei dem ein Arbeiter den Weg aus
                     den verschiedene Hallen (Level) einer Fabrik finden mu&szlig;.
                     Verschiedene Hilfsmittel stehen dazu zur Verf&uuml;ngung, wie
                     z.B. Schl&uuml;ssel, Diamanten, Bomben u.a. Mit vielen Leveln
                     (60) und sehr komfortablem, mausgesteuertem Editor f&uuml;r
                     eigene Spielszenen. Mit Zweispieler-Modus und dt. Anlei-
                     tung.



                        S p i e l e k i s t e   # 33

   Streets         : Bei diesem Spiel sollen Sie die Stra&szlig;en der ehemaligen
                     DDR wieder in Ordnung bringen. Schnellstm&ouml;glich m&uuml;ssen
                     Sie dazu verschiedene Stra&szlig;enteile verschieben, bevor
                     die Ampel auf Gr&uuml;n schaltet.

   NumberFumbler   : Bei diesem Spiel handelt es sich um das sogenannte
                     15er-Puzzle, das vielen sicher bekannt ist. Number
                     Fumbler hebt sich jedoch von all diesen Programmen
                     durch eine  fantastische Grafik und komfortable Maus-
                     bedienung ab.

   EscapeFromJovi  : Dieses Spiel l&auml;&szlig;t sich nur vom CLI aus starten:
                     CLI anklicken, dann  E EFJO eintippen und mit Return
                     abschlie&szlig;en.
                     Ziel ist es, mit einem Raumschiff aus einem H&ouml;hlen-
                     system irgendwo auf einem Planeten zu entkommen.
                     Dabei mu&szlig; man darauf achten, keine Wand oder &auml;hnliche
                     Hindernisse zu ber&uuml;hren, da sonst das Schiff explodiert.
                     Gelingt es, aus den H&ouml;hlen zu entkommen, erh&auml;lt man 
                     seine Bonuspunkte und das n&auml;chste Level wird geladen.



                        S p i e l e k i s t e   # 34

   QuizWiz V1.1    : Quizprogramm mit &uuml;ber 700 Fragen aus 12 verschiede-
                     nen Gebieten: Allgemeinwissen ist gefragt!

   Klondike        : Sch&ouml;nes Denk- und Knobelspiel mit Karten.

   Genius          : Sch&ouml;ne Umsetzung des bekannten Spieles MasterMind.
                     Eine Farbkombination, die der Computer ausw&auml;hlt,
                     ist mit m&ouml;glichst wenigen Versuchen durch Logik zu
                     erraten.

   Knobeln         : Drei mehr oder weniger bekannte R&auml;tsel:
                     1. Wer kennt nicht das altbekannte "Stein-Schere-Papier"?
                        Der Spieler w&auml;hlt einen der drei Gegenst&auml;nde aus und 
                        anschlie&szlig;end der Computer. Wer knobelt geschickter???
                     2. Leitungen: drei H&auml;user m&uuml;ssen mit Strom, Wasser und
                        Gas versorgt werden. Aber Vorsicht: die Leitungen d&uuml;r-
                        fen sich nicht kreuzen!!!
                     3. Nikolaus - wer hat nicht schon einmal in seiner Jugend
                        das Haus vom Nikolaus gezeichnet? Hier wird es nun
                        etwas schwerer: auf jeder Seite ist noch ein Dach an-
                        zuf&uuml;gen! Ausprobieren...



                        S p i e l e k i s t e   # 35

   Risk V3.0       : Eines der besten und spannendsten Strategiespielen ist
                     Risk V3.0 - manchen besser bekannt unter dem Namen
                     RISIKO. Bis zu 5 Spieler m&uuml;ssen versuchen, die Herr-
                     schaft &uuml;ber die Welt zu erlangen. Dabei entscheidet
                     nicht nur das Gl&uuml;ck, sondern es kommt auch auf ge-
                     schicktes Verhandeln an. Besonders wenn viele mitspie-
                     len ist es schnell um einen geschehen, bzw. man wird nie
                     sein Ziel erreichen.
                     Autoren: Michael Berling &amp; Hartmut Stein

   AmigaBorders    : Wer kennt nicht das altbekannte K&auml;sek&auml;stchen-Spiel?
                     Hier ist nun die Computerumsetzung: es geht einfach da-
                     rum, in einem beliebigen Kurs, den man auf ein kariertes
                     Blatt Papier malt, abwechselnd (2 Spieler) Striche zu
                     malen. Wird ein K&auml;stchen von drei Strichen umgeben, so
                     kann der Spieler der jetzt an der Reihe ist, durch Zie-
                     hen des vierten Striches das Feld schlie&szlig;en und hat nun
                     1 Punkt und  einen weiteren Zug. Wer am Schlu&szlig; die mei-
                     sten K&auml;stchen geschlossen hat, hat die meisten Punkte 
                     und gewonnen. Am meisten Reiz hat das Spiel bei kompli-
                     zierteren Kursen. (Einige sind bereits auf der Disk ent-
                     halten.)
 
   Reversi         : Reversi (oder Othello) d&uuml;rfte auch allgemein bekannt
                     sein, so da&szlig; sich hier jeder weitere Hinweis er&uuml;brigt. 
                     Recht spielstarke Version.



                        S p i e l e k i s t e   # 36

   Trucking V1.1   : Trucking ist eine Handels- und Wirtschaftssimulation
                     f&uuml;r 1 - 5 Spieler.  Die Anzahl der Spielteilnehmer
                     wird am Beginn abgefragt, ebenso deren Namen und Fir-
                     mennamen, da jeder Spieler als Spediteur  seine eige-
                     ne Firma leitet.
                     Bei jedem neuen Spiel findet die Firmengr&uuml;ndung im
                     Januar 1988 statt. Am Ende eines jeden Jahres wird
                     der erreichte Punktestand der Spieler mit der YUPPI-
                     Liste verglichen und es erfolgt ggf. ein Eintrag.
                     Jeder Spieler beginnt seine Unternehmerlaufbahn mit
                     dem gleichen Startkapital, nur der zur Verf&uuml;gung ste-
                     hende Dispokredit ver&auml;ndert sich von Spieler zu Spieler.
                     Ein Spiel f&uuml;r viele spannende Stunden...



                        S p i e l e k i s t e   # 37

   MechFight       : Umfangreiches Rollenspiel, bei dem es darum geht, un-
                     bekannte Welten zu erfroschen, zu handeln, Gegenst&auml;nde zu
                     finden und auch gegen Roboter und Au&szlig;erirdische zu beste-
                     hen. Sch&ouml;ne Grafik und einfache Maussteuerung tragen zum
                     Spielspa&szlig; bei. Mit Spielfeldeditor.



                        S p i e l e k i s t e   # 38

   AmigaTration    : Sch&ouml;nes Memoryspiel; von 4x4 bis 12x12 gro&szlig;en Feldern.
 
   SolitaireX      : Und noch etwas f&uuml;r gem&uuml;tliche Stunden - Solitaire-
                     Spiel mit 52 Karten und einfachen Regeln. Aber Vor-
                     sicht: verdammt schwer zu l&ouml;sen!
 
   MissileCommand  : Schnelles Reaktions- und Ballerspiel: 6 St&auml;dte sind
                     zu verteidigen. Aber die Angriffswellen rollen pausen-
                     los... (CityDefence-Clone)
 
   PicPuz          : Ausgezeichnetes Bilder-Puzzle aus 5x5 Teilen mit inte-
                     ressanten Regelnvarianten - z.B. paarweises flippen der
                     Teile oder auch drehen um 90 Grad. Langanhaltender 
                     Spielspa&szlig; ist garantiert! 
                     Achtung: l&auml;uft nur mit 512k; bitte erst NoFastMem an-
                     klicken!
 
   Greed           : Spannendes Denkspiel: die richtigen Ziffern m&uuml;ssen aus
                     einem Bildschirm voller Zahlen gesucht werden.
                     Mit deutscher Anleitung. 

   AlienForce      : Mit einem Panzerwagen f&auml;hrt man durch ein Labyrinth mit
                     vielen G&auml;ngen und trifft dabei auf diverse Monster.
                     Sch&ouml;ne Grafik, mit 2-Spieler-Modus. (1 MB)



                        S p i e l e k i s t e   # 39

   Hirnris         : Tetris-Clone mit einer hohen Motivation. Von oben her-
                     abfallende Arten (vom Chip bis zum Gro&szlig;hirn) m&uuml;ssen
                     in eine Reihe gebracht werden.
                     Mit 2-Spieler-Modus und vielen Extras!

   Blox            : Weitere Tetris-Variante. Vollst&auml;ndig in Assembler
                     programmiert und demzufolge sehr schnell. Mit 2-Spie-
                     ler-Option. (Start &uuml;ber Workbench)

   Grid-It         : Eine weitere Variante der bekannten Gridder-Spiele.
                     Man saust auf einem Gitterfeld umher und mu&szlig; Fl&auml;chen
                     einf&auml;rben. Nat&uuml;rlich wird man st&auml;ndig von diversen
                     Monstern verfolgt... (Start &uuml;ber Workbench)

   H-Ball          : Breakout-Spiel mit schneller Animation.
                     (Start &uuml;ber Workbench)
 
   NightWorks      : Etwas f&uuml;r den eingefleischten Zocker: ein &acute;Einarmiger
                     Bandit&acute; ersetzt die Spielhalle und erspart viel Geld.
                     Mit erstklassiger Grafik, schneller Animation und voll-
                     st&auml;ndiger Mausbedienung. (Start &uuml;ber Workbench)



                        S p i e l e k i s t e   # 40

   NoOneMine       : ---&gt; Jetzt auf SK-EC 05!!



                        S p i e l e k i s t e   # 41

   ComputerConflict: Mit dem S.E.U.C.K. erstelltes Ballerspiel. Von oben
                     kommen die verschiedenen Angreiferwellen, w&auml;hrend man
                     selbst am unteren Bildrand mit seinem Raumschiff die
                     Invasoren abballern mu&szlig;.



                        S p i e l e k i s t e   # 42

   Castle Of Doom  : Sch&ouml;nes Grafikadventure aus dem England des 12. Jahr-
                     hunderts zur Zeit Robin Hoods. Mausgesteuerte Bedienung;
                     leichter Schwierigkeitsgrad.
                     Autor: Foxware

   Tron &acute;90        : Neue Umsetzung des bekannten ScienceFiction-Streifens
                     "Tron". Man kann mit einem zweiten menschlichen Gegner
                     oder gegen den Computer spielen. 5 einstellbare Ge-
                     schwindigkeiten lassen auch dem erfahreren Joystick-
                     Artisten noch gen&uuml;gend Herausforderungen!
                     Autor: Thomas Jansen

   Quadromania     : Ein Klassiker unter den Denk- und Gr&uuml;belspielen: die
                     wei&szlig;e Spielfl&auml;che ist wiederherzustellen, die der Compu-
                     ter durch 'Umdrehen' von Quadraten mit (bis zu) 9 'Spiel-
                     steinen' durcheinandergebracht hat.
                     Autor: Tim Pietzcker



                        S p i e l e k i s t e   # 43

   SnakePit        : Wieder ein Geschicklichkeitsspiel der Spitzenklasse!
                     Eine immer l&auml;nger werdende Schlange ist durch -zig Level
                     zu steuern. Ein &acute;Mu&szlig;&acute; f&uuml;r jeden Spielefan!
                     Autor: Michael Sinz 

   Orbit 3D        : Als Pilot eines kleinen Raumschiffs kreisen Sie am Rande
                     eines Schwarzen Lochs. Die "einfache" Aufgabe besteht
                     darin, so lange wie m&ouml;glich zu &uuml;berleben. F&uuml;r angehen-
                     de Astronauten; mit Demo- und Lern-Modus.
                     Autor: Richard Horne

   Humartia        : Sch&ouml;nes Arcade-Actionspiel f&uuml;r 2 Personen; jeder Spie-
                     ler kontrolliert einen Jet und mu&szlig; den gegnerischen mit
                     75 Treffern "erwischen".
                     Autor: Jason Bauer 

   Mosaic          : Ein 24x24 gro&szlig;es Spielfeld ist zu parkettieren.
                     Sehr sch&ouml;nes Denk- und Gr&uuml;belspiel f&uuml;r lange Spielabende.
                     Autoren: Kirk Johnson + Loren J. Rittle



                        S p i e l e k i s t e   # 44

   Wizzy&acute;s Quest   : Retten Sie Ihr Dorf vor dem b&ouml;sen Drachen! In diesem
                     recht witzigen Fantasy-Action-Spiel haben Sie 50 schwie-
                     rige Level zu bew&auml;ltigen, bevor Sie endlich dem Unget&uuml;m
                     pers&ouml;nlich gegen&uuml;berstehen. (1 MB)
                     Autor: Guido Appenzeller

   WordPuzzle      : Wieder etwas f&uuml;r Knobelfreunde: W&ouml;rter sind in einem
                     Puzzle zu suchen. Mit vielen Beispielen. (Start &uuml;ber WB)
                     Start &uuml;ber Workbench.
                     Autor: Russell Mason

   Triangle        : Eine Art chinesischem Schach, das in vielen Restau-
                     rants zu finden ist. Mausgesteuertes Denkspiel mit hohem
                     Motivationswert. (Start &uuml;ber Workbench)
                     Autor: Russell Mason

   Wurmli          : Einfach aussehendes Geschicklichkeitsspielchen, das
                     aber &uuml;ber l&auml;ngere Zeit begeistern kann. Mit dem Joystick
                     ist ein Wurm durch ein Labyrinth zu steuern. Mit den di-
                     versen Einstellm&ouml;glichkeiten stehen dem Spieler 110 ver-
                     schiedene  Spielstufen zur Verf&uuml;gung. (Start &uuml;ber WB)
                     Autor: Sandro Paolini

   Mem-Jog         : Ziel des Spieles ist es, aus 60 verdeck-
                     ten Karten die jeweils 2 zusammenpassenden Karten her-
                     auszufinden. Dazu k&ouml;nnen folgende Grund-Optionen gesetzt
                     werden: Solo-Spiel, Mensch-Mensch, Mensch-Amiga. 
                     (Start &uuml;ber Workbench)
                     Autor: Heiko Behnken



                        S p i e l e k i s t e   # 45

   AirAce 2        : Mit S.E.U.C.K. erstelltes recht flottes
                     Ballerspiel der gehobenen Klasse. F&uuml;r nerv&ouml;se Joystick-
                     Artisten.
                     Autor: Robert Grace

   Pyramide        : Strategiespiel in der Art von "Kaiser".  Ziel des Spie-
                     les ist es, eine Pyramide zu bauen. Hierzu kann man sich
                     Boote, Kamele und Sklaven kaufen/verkaufen usw. Es wird
                     immer angezeigt, wie weit die Pyramide schon fertig ist.
                     Autor: Martin Jochimczyk

   BattleShip      : "Schiffe versenken" auf amerikanisch. Mit zahlreichen
                     neuen Features. Einfach mal ausprobieren...
                     Autor: Steve Berry 

   Metro           : In "Metro Subway Construction Set" schl&uuml;pft der Spieler
                     in die Rolle eines Stadtplaners. Mit begrenztem Etat mu&szlig;
                     ein U-Bahn-System unter einer Stadt angelegt werden.
                     Autor: David P. Townsand 



                        S p i e l e k i s t e   # 46

   Skat 1.0        : Erste PD-Umsetzung des wohl bekanntesten und beliebtesten
                     deutschen Kartenspiels! Mit sehr sch&ouml;ner Grafik, kleiner
                     Regelkunde und Spielverwaltung.
                     Autor: Marc Fischlin

   Diplomacy       : Das aufregende Spiel der internationalen Intrigen...
                     Umsetzung nach dem gleichnamigen Brettspiel - etwas f&uuml;r
                     gewiefte Taktiker.
                     Autor: Steve Douthat

   Trap 1.3        : Noch eine Umsetzung eines gerade bei Kindern beliebten
                     Schiebespiels. Kugeln werden zun&auml;chst auf ein Spielfeld
                     gesetzt; durch Schieber m&uuml;ssen dann die gegnerischen vom
                     Spielfeld herunterbef&ouml;rdert werden... Ein Spiel auch f&uuml;r
                     schadenfrohe Gem&uuml;ter - oft "versenkt" man auch die eige-
                     ne Kugel!
                     Autoren: T. P&uuml;hler + M. Winklbauer

   Gro&szlig;kapitalist  : Gelungene Handelssimulation; es geht um Kaufen und Ver-
                     kaufen von Edelsteinen, Gew&uuml;rzen, Fellen, usw. Auch ein
                     Gang zur B&ouml;rse ist vorgesehen...
                     Autor: Roland Richter 

   Cards&acute;O&acute;Rama    : Sch&ouml;nes Memoryspiel mit 32 Karten; leicht
                     zu spielen... Wie w&auml;r&acute;s mit &acute;ner Runde?
                     Autor: Werther Pirani 



                        S p i e l e k i s t e   # 47

   Billard         : Ausgezeichnetes Billardspiel mit sch&ouml;ner Grafik und mit
                     vielen M&ouml;glichkeiten. Es gibt 3 Spielvarianten (Pool, Ca-
                     rambolage, Dreiband) und einem Trainermodus. F&uuml;r 1 oder
                     2 Spieler.
                     Autoren: Axel Illenburg + Gerold Schickram

   Running         : Klassisches Labyrinth- und Puzzle-Spiel;
                     Logik und Reaktion sind gefragt. Entweder versucht man,
                     m&ouml;glichst viele Bonusgegenst&auml;nde zu sammeln oder ein-
                     fach auch nur jedes Level zu l&ouml;sen. Shareware (15 $).
                     (Start &uuml;ber Workbench)
                     Autor: Jorrit Tyberghein

   Paranoids       : Oder das "Irrenanstalt-Entkomm-Spiel". Es handelt sich
                     dabei um ein Brettspiel mit Karten, W&uuml;rfeln und Figuren.
                     Jeder hat 4 Patienten und 2 Doktoren; Ziel des Spiels 
                     ist es, seine 4 Patienten aus der Anstalt frei zu bekom-
                     men - die &Auml;rzte wollen dies nat&uuml;rlich verhindern.
                     (Start &uuml;ber Workbench)
                     Autor: Steve Berry 



                        S p i e l e k i s t e   # 48

   HeadGames       : Typisches Ballerspiel f&uuml;r den nerv&ouml;sen Joystick-Artisten
                     - nat&uuml;rlich mit dem S.E.U.C.K. erstellt. Dabei gilt nur
                     eins: Schie&szlig;en was das Zeug h&auml;lt! 
                     Autor: Neil Sorenson 

   SpaceBattle     : Neue "Invader"-Variante: mit einem modernen Raumschiff
                     fliegt man &uuml;ber eine horizontal scrollende Landschaft.
                     Aufgabe (wie immer): alles abschie&szlig;en, was so entgegen-
                     kommt. Shareware (DM 10,--)
                     Autor: Rolf Morlock

   Sorry!          : Dies ist die Computerumsetzung eines alten Parker-Brett-
                     spiels von 1934. Auch f&uuml;r gesellige Runden geeignet.
                     Autor: unbekannt 



                        S p i e l e k i s t e   # 49A+B

   ScienceFrontiers: &Uuml;beraus komplexes Strategiespiel nach der erfolgreichen
                     amerikanischen Fernsehserie "V" &uuml;ber 2 Disketten. V2.0.
                     Das Programm ben&ouml;tigt 1 MB und ist Shareware.
                     Autor: J&ouml;rg Wagner



                        S p i e l e k i s t e   # 50

   WaterMine       : ---&gt; Jetzt auf SK-EC 06!!




</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="pdl.gif" alt="" width="640" height=
                "22" border="0" usemap="#pdl0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

