<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Was Commo so alles herstellt</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="smt0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "smt.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#000000">
              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#dbb787" width="76%" align="center">
                    <TR>
                      <TD>
                        <CENTER>
                          <IMG src="smt02.gif" alt="Titelzeile">
                        </CENTER>
<PRE>
             Was stellt Commodore denn eigentlich so her?
             --------------------------------------------


 Diese Frage werden sich sicher nicht wenige User gestellt haben.
 Eine durchaus berechtigte Frage, denn man m&ouml;chte ja wissen, was
 Commodore au&szlig;er dem Amiga noch so alles herstellt.

 Hier nun eine kleine Aufstellung, was Commo meines Wissens denn
 so alles herstellt:


       Rechner:
       ========

 (1) Amiga CD 32
 (2) Amiga 1200 (HD)
 (3) Amiga 4000
    - 030
    - 040
    - 040 Tower


       Monitore:
       =========

 (4) Monitor 1084S
 (5) Monitor 1085S
 (6) Monitor 1940
 (7) Monitor 1942


        Sonstiges:
        ==========

  (8) CD-ROM Laufwerk A570
  (9) CD-ROM Laufwerk CD1200
 (10) Workbench 2.0/2.1/3.1
 (11) Zusatzhandb&uuml;cher A1200


 Diese Liste best&auml;tigt auf jeden Fall, da&szlig; Commodore eine zu kleine
 Produktpalette hat. Ob Commodore auch noch Drucker herstellt, da&szlig;
 wei&szlig; ich allerdings nicht.

 Jede andere Computerfirma hat eine gr&ouml;&szlig;ere Produktpalette als
 Commodore. Ich kann nur hoffen, da&szlig; dieser Zustand sich &auml;ndert,
 oder?

 Was kann Commodore dagegen tun?


                        Nun, eine ganze Menge:
                        ======================

 a) Auf jeden Fall m&uuml;ssen neue und leistungsf&auml;higere Rechner
    erscheinen, die den Dosen nun endg&uuml;ltig den gar aus machen.

 b) Neue Monitore, mit h&ouml;heren Frequenzen (15-60 kHz, 50-90 Hz),
    und endlich einmal MPR-II Norm, vielleicht eine Nachfolger vom
    1084S Monitor.

 c) Mehr Zubeh&ouml;r wie Speichererweiterungen, Turobkarten,
    Grafikkarten, HD-Diskettenlaufwerke herausbringen.

 d)&nbsp;Auch einmal sachen wie Drucker, Streamer und Scanner m&uuml;ssen
    ber&uuml;cksichtigt werden.


 Das war jetzt schon eine ziemlich lange Latte. Klar, alles kann
 nicht ber&uuml;cksichtigt werden, aber wenn Commodore sich davon ca.
 30% zu herzen nimmt, dann schaut die Welt schon ganz anders aus.

 Wenn eine Firma wachsen und gedeihen will (was bei Commo ja zur
 Zeit nicht gerade der Fall ist), mu&szlig; wirklich die gesamte
 Produktpalette erweitert werden.

 Auch das Betriebssystem k&ouml;nnte umfangreicher sein. Zur
 Grundausstattung der Workbench k&ouml;nnte z. B. eine kleine
 Dateiverwaltung, ne` kleine Textverarbeitung oder wenigstens ein
 kleines Malprogramm geh&ouml;ren. Auch die Tools k&ouml;nnten mal erweitert
 werden.

 Logisch, der Autor schaut sich das jetzt von Windows ab, werden
 einige denken. Aber es ist nicht ganz so. Klar, Windows hat mit
 der Workbench einiges gemeinsam und MicroSoft hat einiges
 abgeschaut. Warum sollten wir dann auch nicht mal was abschauen.
 Warum m&uuml;ssen immer andere Firmen von uns profitieren?
 Auf jeden Fall sollte Commodore einiges daf&uuml;r tun, da&szlig; die
 Workbench an Umfang gewinnt.

 So, da&szlig; war jetzt eine lange "Schadensliste", aber ich mu&szlig;te das
 mal sagen.

 Ich kann nur hoffen, das der neue Besitzer von Commo da was
 &auml;ndert. Denn ich halte den Amiga noch f&uuml;r einen DER besten
 Computer auf der ganzen Welt. Auch wenn der Schein manchmal wegen
 MS-Dosen&amp;Co. tr&uuml;gt.

 Stefan Wunner


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

