<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>APC&amp;TCP</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="smt0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "smt.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#440035">
              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#b71035" align="center">
                    <TR>
                      <TD>
                        <IMG src="smt03.gif" alt="Club-Symbol"> 
<PRE>
 Jetzt gibt es den NEUEN APC&amp;TCP-Computerclub schon 1 1/2 Jahre und
 ich habe noch nie genaue Infos an Euch weitergegeben.
 Is ja schon richtig Peinlich.


 Naja, dann wollen ma mal das jetzt zur 6. Ausgabe der NoCover
 nachholen.


 Also unser Club hat jetzt am 7.7.94
 genau 208 Mitglieder.
 Das &auml;lterste Mitglied ist 58 Jahre alt
 und das j&uuml;ngste ist 13 Jahre.

 Seit kurzen haben wir 2 weibliche
 Mitglieder.


 Von den 208 Mitgliedern haben 120 einen Amiga 500, 18 einen Amiga 600,
 46 einen Amiga 1200, 23 einen Amiga 200, 4 einen Amiga 3000 und
 9 einen Amiga 4000. Ein CD-32 hat leider keiner in seinem Clubantrag
 angegeben. Au&szlig;erdem haben einige sogar 2 Amigas. Deshalb kommt auch beim
 zusammenz&auml;hlen mehr als 208 Ger&auml;te raus!


 Wie man an den Zahlen sieht f&uuml;hrt der Amiga 500 ungeschlagen. Aber der
 1200er holt schon ganz gewaltig auf!

 So das waren die aktuellen Zahlen.


 Aus der Vergangenheit m&ouml;chte ich Euch
 eigentlich nichts erz&auml;hlen. Interessanter ists
 wohl, was wir so alles f&uuml;r die Zukunft vor uns
 haben. Ist ne verdammt lange Liste und ich
 habe keine Ahnung WANN und teilweise auch WIE
 man das alles durchsetzen kann. Also wenn
 jemand Ideen dazu hat, nur her damit.

 Vieles ist auch einfach nur ne reine Zeitfrage
 und Zeit ist bei mir ja bekannterweise
 absolute Mangelware:-)

 Okidoki, also fangen wir mal an:


 - Einf&uuml;hrung von Clubausweisen:
   Es soll so ne Art Scheckkarte sein, aus richtigen Plastik.
   Das Problem dabei ist nur, da&szlig; ich nicht wei&szlig;, mit welchen
   Ger&auml;t man solche Karten machen kann bzw. was so ein Ger&auml;t womit
   man dies machen kann kostet.


 - Mehr lokale St&uuml;tzpunkte:
   Wir wollen noch mehr lokale St&uuml;tzpunkte er&ouml;ffnen. Wie uns die
   Erfahrung mit den einzelnen St&uuml;tzpunkten gezeigt hat ist das
   f&uuml;r die einzelnen Mitglieder in vieler Hinsicht sehr praktisch
   und n&uuml;tzlich. Au&szlig;erdem k&ouml;nnen Usertreffen lokal besser veranstaltet
   werden als &uuml;berregional!


 - Erweiterung des PD-Pools:
   Naja, was soll ich dazu sagen. Momentan &uuml;berlege ich mir, ob ich mir
   nen CD-ROM-Laufwerk zulegen soll. Der einzigste Hinderungsgrund ist
   eigentlich nur der Kaufpreis.


 - Unsere eigene Mailbox und das eigene Netz ALCATRAZ:
   Wir haben ja ne eigene Mailbox und inzwischen auch unser eigenes
   Netz. Noch h&auml;ngen nicht viele Boxen an diesem Netz. Aber ich hoffe das
   es bald noch mehr Boxen gibt. Wenn ihr ein Modem habt, dann bittet
   doch den Sysop von Eurer Stammbox, das er sich das Netz zulegt.


 - AB 1.1.95 m&uuml;&szlig;en User die in den Club eintreten wollen mind. 1 Abo der
   NoCover bestellen. Warum ? Erstens bekommen sie damit die aktuellen
   Infos was jeder Neuling unbedingt braucht und zweitens verhindern
   wir damit das wir sogenannte "Tote Mitglieder" bekommen.
   Jeder von Euch wei&szlig; ja, was ich an der NoCover verdiene. Es ist
   also bestimmt keine Geldabschneiderei.
   Schreibt mir doch mal, was ihr davon haltet!!


 - Sponsor:
   Wir suchen h&auml;nderingend einen oder
   mehrere gute Sponsoren f&uuml;r den Club. Dann
   k&ouml;nnten wir endlich mal richtig Werbung
   machen oder auch mal ne gro&szlig;e Party
   veranstalten! Im Grunde hab ich &uuml;berhaupt
   nichts dagegen, wenn neben unserem Namen
   das CocaCola-Label steht :-)))
   Solange der Club bleibt wie er sein soll!


 - Party:
   Wir wollen auf jedem Fall eine Party machen. Allerdings soll es eine
   Party sein, wo KEIN Eintritt oder &auml;hnliches verlangt wird. Aber
   daf&uuml;r brauchen wir erst einmal einen Sponsor.


 - Usertreffen:
   Bei mir hier unten werden schon regelm&auml;&szlig;ig Usertreffen veranstaltet.
   Ich hoffe das unsere St&uuml;tzpunkte sowas auch auf die Beine stellen
   k&ouml;nnen.


 - Hilfestellung:
   Wir haben ja bereits mehrere
   Mitglieder die bereit sind, den anderen
   zu helfen. Wir hoffen in der Richtung
   noch mehr Hilfe zu bekommen.


 - Eigene PD-Serie
   Momentan haben wir das ganze erst einmal eingestellt. Aber wir
   werden irgendwann demn&auml;chst einmal anfangen eine eigene Serie
   zu gr&uuml;nden.


 - Eigene Gold-Serie:
   Der Startschu&szlig; f&auml;llt in ein paar Wochen. Auf dieser Serie sind nur
   Vollversionen von Sharewareprogrammen. Diese Disks k&ouml;nnen nur bei
   uns bezogen werden und d&uuml;rfen nat&uuml;rlich nicht weiterkopiert
   werden. Is ja eigentlich klar. Sind ja schlie&szlig;lich Vollversionen.
   Ziel ist es, Mitglieder von uns etwas zu unterst&uuml;tzen ihre
   Programme zu verkaufen. Erfolgsgarantie?? Warten wirs mal ab!


 - Messe:
   Wir sind zu 90% wieder mit einem Stand auf der Computer 94 in
   K&ouml;ln dabei. Entscheidend ist nat&uuml;rlich die Standkosten. Aber das
   wird sich ja die n&auml;chsten Tage kl&auml;ren, wenn ich die ben&ouml;tigten
   Unterlagen erhalten habe.
   Was wir dann nat&uuml;rlich brauchen ist wieder eine so gute Unterst&uuml;tzung
   von unseren Mitgliedern die uns auf dem Stand geholfen haben und
   dabei geschuftet haben also ob sie Geld daf&uuml;r bekommen w&uuml;rden.
   Letztes Jahr haben wir zwar keinen Gewinn gemacht, aber wenigstens
   unsere Kosten haben wir rausbekommen.


 - Presse:
   Wir versuchen unsere Connects zur Presse
   noch weiter auszubauen. Bis jetzt k&ouml;nnen wir
   uns ja in der Richtung nicht beschweren,
   aber es k&ouml;nnte noch um einiges besser sein.


 - H&auml;ndler:
   Wir suchen noch H&auml;ndler die unsere Produkte verkaufen wollen.


 - Vertrieb:
   Naja, alles h&auml;ngt irgendwie mit dem Vertrieb unserer PD und
   (c)-Software zusammen. Umso mehrer ich verkaufen kann umso
   weniger Zeit mu&szlig; ich an meinem Arbeitsplatz verbringen.
   Das wiederum hat zur Folge das ich mehr Zeit f&uuml;r den Club
   habe was wiederrum ....... Naja, und so weiter.
   Man kennt ja das alte Problem von mir: ZEIT !


 - NoCover:
   Die NoCover hat momentan den absoluten Vorrang. Das Ziel ist es,
   die NoCover zum meistgelesenen Diskettenmagazin zu machen.
   Da kann nat&uuml;rlich jeder mithelfen. Das einfache weiterkopieren
   und weiterempfehlen macht schon verdammt viel aus.
   Nat&uuml;rlich w&auml;re es mir lieber, wenn jeder ein Abo h&auml;tte (Ich liebe
   es, wenn jemand Geld an mich schickt:-)) ) aber im Grunde gehts
   hier eigentlich nur um die Auflage. Denn eins ist ja auch klar.
   Umso mehrer Leser die NoCover hat umso mehr Schreiberlinge kommen
   dazu und davon hat wiederum jeder Leser was.


   Nat&uuml;rlich suchen wir immer gute Texte f&uuml;r das Magazin. Wir wollen
   ja alle, das sie weiterhin alle 4 Wochen erscheint. Das kann aber
   nur gelingen, wenn ich mich nicht mit Artikelschreiben aufhalten
   mu&szlig; sondern mich auf das layouten (Danke an alle die selbst layouten)
   und dem zusammenstellen der Texte konzentrieren kann.
   Ab dieser Ausgabe erscheint ja die NoCover auf 2 Disketten.
   Das ist eine riesige Herausforderung an alle Schreiberlinge.
   Denn wir alle wollen ja, das die NoCover voll mit interessanten
   Texten, Infos, News, Listen, Storys usw. ist. Dabei bin ich um
   jede Unterst&uuml;tzung froh.


   Und bestimmt, irgendwann einmal wird die NoCover auf 3 Disks
   erscheinen. Aber das ist ein sehr ferner Blick in die Zukunft
   des Mags. Soweit m&ouml;chte ich ehrlich gesagt noch gar nicht denken.
   Aber Realit&auml;t wird es bestimmt einmal.
   Jetzt heisst es erst einmal 2 Disks vollzuknallen, was immerhin ca.
   2.5 mal soviele Texte sind wie vorher!
   Achja, momentan rechnen wir mit einer Leserzahl von ca. 1000.


 So, ich glaube jeder konnte aus dem Text herauslesen das ich verdammt
 viel mit dem Club noch vorhabe. Im Grunde ist ja alles nur ne Frage
 der Zeit und des Geldes. Aber das kommt auch mit der Zeit (Hoffe ich!!)
 und wenn die Unterst&uuml;tzung von allen Mitgliedern weiterhin so toll
 ist ists bestimmt kein Problem.
 Realistische Ideen und Vorschl&auml;ge sind herzlichst willkommen!


 Und jetzt geht mal wieder die
 Suche nach dem &uuml;blichen Schlu&szlig;wort
 los.


 HMM, ja genau:


  AMIGA FOREVER !!

 Andreas


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

