<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Referat</TITLE>
  </HEAD>

  <BODY text="#444444" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="smt0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "smt.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#444444">
              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#c8c8c8" align="center">
                    <TR>
                      <TD>
<PRE>
          Horror, Gewalt, Krieg, Brutalit&auml;t, Pornographie und
          ---------------------------------------------------
                 Nazionalsozialismus in Computerspielen
                 --------------------------------------


 Dieser Text stammt von Christian Heitzer, war urspr&uuml;nglich als Referat
 gedacht, und wurde auch als solches  vorgetragen.  Bedingt  durch  die
 L&auml;nge des Referats, wurde dieser Text um einiges gek&uuml;rzt. &Uuml;rspr&uuml;nglich
 wurden  noch  einige Computerspiele n&auml;her vorgestellt, au&szlig;erdem fehlen
 in dieser Version sowohl Einleitung als auch Schlu&szlig;, da diese,  meiner
 Meinung  nach, eigentlich unwichtig sind. Au&szlig;erdem wird in diesem Text
 auf die einzelnen Gebiete "Horror,  Brutalit&auml;t,  Gewalt,  etc."  nicht
 eingegangen    und  es  werden  die  verschiedenen  Spieletypen  nicht
 beschrieben.

 Der  Referattext hatte eine Originall&auml;nge von 50000 Bytes, dieser Text
 wurde dagegen auf 25000 gek&uuml;rzt.

 ICH  BIN  F&Uuml;R  DEN INHALT DIESES TEXTES VERANTWORTLICH, DA ER ZUM TEIL
 AUF ZITATEN AUS DEN OBEN GENANNTEN QUELLEN BERUHT!
 MANCHE MENSCHEN FINDEN EBEN VIELE DINGE WENIGER SCHLIMM, ALS ANDERE,
 SO AUCH BEI COMPUTERSPIELEN!


    1. F&uuml;r Kinder und Jugendliche geeignete bzw. nicht geeignete Spiele

    2. Ist ein Spiel geeignet oder nicht ? Entscheidungshilfen

    3. Die Indizierung von Computerspielen


                             Zus&auml;tzliches:
                            ---------------

    1. Begriffserkl&auml;rung

    2. Weitere Informationen

    3. Literaturverzeichnis

    4. Zitatverzeichnis


 1. F&uuml;r Kinder und Jugendliche geeignete bzw. nicht geeignete Spiele

 Ungeeignet sind immer  Kriegsspiele,  und  die  mit  ihnen  verwandten
 Schie&szlig;spiele.  Der Sinn solcher Spiele besteht meistens nur darin, die
 Gegner einfach zu t&ouml;ten. Es wird &uuml;berhaupt nicht daran  gedacht,  nach
 einer  friedlichen  L&ouml;sung  zu suchen, bzw. es wird einem nicht einmal
 die M&ouml;glichkeit dazu gegeben. Es kann schon durchaus  sein,  da&szlig;  sich
 diese  Art der Probleml&ouml;sung bei zu h&auml;ufigem Genu&szlig; solcher Spiele auch
 auf das eigene Verhalten auswirkt, da man  sich  die  Handlung  dieser
 Spiele besonders einpr&auml;gt.
 "Einige  weitere Computerspiele beinhalten detaillierte Gewaltdarstel&shy;
 lung und fordern zur Selbstjustiz auf, wenn es etwa darum  geht,  eine
 Stadt  von  Verbrechern  zu  s&auml;ubern'."  Ein besonders gutes Beispiel
 hierf&uuml;r  sind  die,  bereits  schon  weiter  oben  erw&auml;hnten,   Spiele
 "Mot&ouml;rhead" von Virgin Games und New York Warriors.
 Hier  eine  kurze  Liste  mit  Spielen, die f&uuml;r Jugendliche und Kinder
 nicht geeignet sind (Achtung: In  dieser  Liste  befinden  sich  KEINE
 indizierten   Programme.  Die  folgenden  Programme  wurden  nach  den
 Hinweisen und Empfehlungen der Brosch&uuml;re "Computerspiele  -  Spielspa&szlig;
 ohne  Risiko"  ausgew&auml;hlt  und  unter  Ber&uuml;cksichtung  dieser Hinweise
 von mir als nicht geeignet eingestuft):


 Thunderblade (kriegerischer Action-Heli)
 Robocop 2 (es werden Kinder und Frauen erscho&szlig;en)
 F16 Falcon (kriegerischer Flugsimulator)
 Battle Command (kriegerischer 3D-Panzersimulator)
 Rambo 3
 Wings of Fury (die  Gegner  werden mit dem MG im Flugzeug in Sturzflug
                erscho&szlig;en)
 Flight of the Intruder (kriegerischer Flugsimulator)
 Wing Commander (kriegerische Weltraumflugsimulation)
 Midnight Resistance
 Weird Dreams (Hiervon  gibt  es  wieder  die  Originalversion und eine
              spezielle  daf&uuml;r  angefertigte, da&szlig;  sie  in Deutschland
              verkauft  werden darf. In der Originalversion kommt eine
              Krankenschwester  vor, die einem ein Messer in die Brust
              sticht, in der anderen Version wurde diese entfernt.)
 Mig 29 Fulcrum (kriegerischer Flugsimulator)
 Silent Service 1+2 (kriegerische U-Bootsimulation)
 Battle Chess  (Schach  mit  super Animationen. Man sieht z.B., wie die
               Dame  von  einem Turm gefressen wird, oder der Springer
               von  einer Kreissage  zers&auml;gt  wird. Ich bin  mir nicht
               sicher, ob dieses Spiel nun indiziert ist, oder nicht.)
 Elvira - Mistress of the Dark
 Elvira 2 - The Jaws of Cerberus
 Waxworks
 A10 - Tank Killer (kriegerischer Flugsimulator)
 usw.


 F&uuml;r Jugendliche und Kinder geeignet sind  meistens  Geschicklichkeits&shy;
 Denk-,  Sport-, H&uuml;pf- und Sammelspiele, sowie Quiz- und Lernspiele und
 Brettspielumsetzungen. Es gibt aber  auch  hier,  wie  &uuml;berall  anders
 auch,    Ausnahmen.   Als  ungeeignete  Brettspielumsetzung  kann  man
 sicherlich   das  Schachspiel  "Battle  Chess"  bezeichnen.  Hier  ein
 Listenauszug
 mit  f&uuml;r  Kinder  und Jugendliche geeigneten Programmen und der Angabe
 der Systeme, auf denen das Spiel erh&auml;ltlich ist. Die Programme  wurden
 ebenfalls  der  Brosch&uuml;re  "Computerspiele  -  Spielspa&szlig;  ohne Risiko"
 entnommen und stimmen mit den Empfehlungen dieser Brosch&uuml;re  nat&uuml;rlich
 &uuml;berein. Die Angabe des Systems wurde auch dieser Brosch&uuml;re  entnommen
 und wurde nur evtl. von mir erg&auml;nzt.
 Eine Beschreibung der einzelnen Spiele ist ebenfalls darin zu finden.

 4x4 Off Road (Amiga)
 Atomix (Amiga, Atari ST und andere)
 Back to the Future 2 (Amiga, Atari ST und andere)
 Block Out (Amiga, Atari ST, MS-DOS)
 Bounder (C64, Schneider CPC)
 Duck Tales (Amiga)
 E-Motion (Amiga, Atari ST und andere)
 Flimbos Quest (Amiga, C64 und andere)
 Giana Sisters (Amiga, C64)
 Jumping Jack Son (Amiga)
 Lotus (Amiga)
 Marble Madness (Amiga, Atari ST und andere)
 Pacmania (C64, Amiga, Atari ST, Spectrum, Schneider CPC)
 Speedball (Amiga, Atari ST)
 Lemmings (Amiga, MS-DOS)
 Beach Volley (Amiga)
 RVF Honda (MS-DOS, Atari ST, Amiga)
 Test Drive II - The Duel (Amiga, C64, MS-DOS)
 Day of the Pharao (Amiga)
 Fugger (C64, MS-DOS, Atari ST, Amiga)
 Sim City (Amiga, IBM-PC, Macintosh)
 Oil Imperium (Amiga, C64)
 Asterix im Morgenland (C64, MS-DOS, Atari ST, Amiga, Schneider CPC)
 Future Wars (Amiga, IBM-PC)
 Maniac Mansion (Amiga, IBM-PC, C64)
 Indiana Jones 4 - Fate of Atlantis (MS-DOS, Amiga)
 Star Trek - the 25th Anniversary (MS-DOS)
 Push Over (Amiga, IBM-PC, ?)
 Railroad Tycoon (Amiga, IBM-PC)
 The Humans (Amiga, ?)
 Titus the Fox (Amiga, ?)
 Peters Quest (Amiga, ?) (PD)
 Star Trek (Amiga) (PD)
 Pametha (Amiga) (PD)
 Atlantis (Amiga) (PD)
 Monkey Island 2 - Le Chuck's Revenge (Amiga, IBM-PC, ?)
 Gobliiins (Amiga, IBM-PC, ?)
 Dune - Der W&uuml;stenplanet (Amiga, IBM-PC, ?)
 Spielend Lernen 1 (f&uuml;r Kinder bis 6 Jahre) (Systeme nicht bekannt)
 Spielend Lernen 2 (f&uuml;r Kinder von 6 bis 8 Jahren) (Systeme nicht bek.)
 Chess 2.0 (Systeme nicht bek.) (PD)
 China Challenge (Systeme nicht bek.) (PD)
 Das Gl&uuml;cksrad (C64, Amiga, Atari, PC)
 Nightshift (C64, Amiga, Atari, PC)
 Wonderland (Amiga, Atari, PC)
 Indianapolis 500 (Amiga, Atari, PC)
 Bundesliga Manager Professional (Amiga, PC)
 Mad TV (PC, Amiga)
 Sys (Amiga) (PD)
 Nebulus I und II (Atari ST, Amiga, MS-DOS, C64)
 The Power (Amiga, Atari ST, C64, MS-DOS)
 Dragon Cave (Amiga) (PD)
 Doodle Bug (Amiga, ?)
 James Pond 2 - Codename Robocod (Amiga, ?)

 Das war ein kleiner &Uuml;berblick &uuml;ber Computerspiele, die f&uuml;r Kinder  und
 Jugendliche  geeignet  bzw. nicht geeignet sind. Wo schon an der L&auml;nge
 der beiden Listen zu erkennen ist, gibt es viel mehr geeignete Spiele,
 als ungeeignete. Immer wieder wird es einige schwarze Schafe unter den
 Computerspielen geben. Das Problem ist nur, da&szlig; ungeeignete oder sogar
 indizierte Spiele viel weiter verbreitet sind und werden. Pornographi&shy;
 sche Software kommt man in den meisten F&auml;llen &uuml;ber Mailboxen.


 2. Ist ein Spiel geeignet oder nicht ? Entscheidungshilfen.

 Damit  die Wahl beim Kauf eines Spiels erleichtert wird, kommen hierzu
 jetzt einige  "Anregungen,  Tips  und  Hinweise"  die  beim  Kauf  von
 Computerspielen    helfen   sollen  und  die  sich  besonders  an  die
 Erwachsenen bzw. Eltern richten.
 "Neben  dem Inhalt, der Dramaturgie des Spiels und dem Schwierigkeits&shy;
 grad sind die Graphik und die Tonausgabe wichtige  Kriterien  f&uuml;r  die
 Wahl  eines  Spiels. Durch die Gew&ouml;hnung der Kinder an die immer stei&shy;
 gende Bild- und Tonqualit&auml;t der verschiedenen Medien sind ihre Anspr&uuml;&shy;
 che hier schon recht hoch. Orientieren Sie sich beim Kauf  von  Compu&shy;
 terspielen  an den Kriterien, die von Fachleuten an gute und unbedenk-
 liche,  aber  dennoch  Spa&szlig;,  Unterhaltung  und Spannung versprechende
 Computerspiele  gestellt  werden.  Sie k&ouml;nnen dadurch sichergehen, da&szlig;
 Sie keine Spiele mit p&auml;dagogisch fragw&uuml;rdigen Inhalten erwerben.  W&auml;h&shy;
 len  Sie  dar&uuml;ber hinaus nur solche Spiele aus, die den Interessen und
 F&auml;higkeiten ihrer Kinder am ehesten entsprechen.

 Empfehlenswert  sind  Spiele,  die

 * die  M&ouml;glichkeiten  zum  gemeinsamen Spiel im Familienkreis oder mit
   Freunden  bieten
 * die  gleicherma&szlig;en   unterschiedliche  Spielanforderungen  enthalten
   wie  logisches  Denken, Kombinations- und Sprachf&auml;higkeit ebenso wie
   Reaktionsschnelligkeit
 * die  vom  Schwierigkeitsgrad  die  F&auml;higkeiten  Ihres  Kindes  nicht
   &uuml;bersteigen, da Ihr  Kind dadruch unn&ouml;tigen Frustrationen ausgesetzt
   wird
 * die andererseits aber auch nicht so simpel aufgebaut sind,  da&szlig;  Sie
   Ihrem Kind nach  ein  oder  zweimaligem  Spielen  keinen  Spa&szlig;  mehr
   machen.

 Problematisch sind Spiele, die vom Spielinhalt und -aufbau her

 * Krieg glorifizieren
 * Gewalt als effektives Konfliktl&ouml;sungsmittel  darstellen  und  Gewalt
   oder Zerst&ouml;rungsakte mit hohen Punktzahlen belohnen
 * Selbstjustiz als legitim erscheinen lassen
 * frauenverachtende Darstellungen enthalten
 * Fremdenfeindlichkeit und Rassendiskriminierung propagieren."

 In diesem Referat kam schon oft das Wort  indizieren  und  Indizierung
 vor.  Was  ist  denn  eigentlich eine Indizierung und wann kommt es zu
 einer solchen ?
 Nun,  indizieren  bedeutet ganz einfach, da&szlig; ein bestimmtes Medium, in
 diesem Fall Computerspiele, f&uuml;r alle unter 18  Jahren  als  ungeeignet
 eingestuft wurde und da&szlig; deshalb laut GjS alle Jugendlichen vor diesem
 Medium    gesch&uuml;tzt   werden  m&uuml;ssen.  "Der  Schutz  von  Kindern  und
 Jugendlichen vor sittlicher  Gef&auml;hrdung  durch  Medien  z&auml;hlt  zu  den
 verfassungsrechtlichen  G&uuml;tern,  die  u.a.  der  Kunstfreiheit Grenzen
 setzen k&ouml;nnen. Dies hat das Bundesverfassungsgericht mit Beschlu&szlig;  vom
 27.  Von.  1990  ausdr&uuml;cklich entschied. Die Karlsruher Richter leiten
 dies, aus dem Recht auf Entwicklung der Pers&ouml;nlichkeit (Art. 2 Abs  1.
 GG)  und  aus  dem Erziehungsrecht der Eltern und dem 'W&auml;chteramt' des
 Staates, ab (Art. 6 Abs. 2 GG)." Bis zum August  1992  wurden  alleine
 170   Computer-  und  Automatenspiele  von  der  Bundespr&uuml;fstelle  f&uuml;r
 Jugendgef&auml;hrdende Schriften, kurz BPS, 133 Computer- und  Videospiele,
 "aufgrund  ihres jugendgef&auml;hrdenden Inhalts indiziert". Zu den Spiele,
 die bereits indiziert wurden, z&auml;hlen unter anderem folgende Beispiele:

 Hitler Diktator von "Hitler Jr."
 Wings von Cinemaware
 Beverly Hills Cop
 Cabal von Ocean
 Dogs of War von Elite
 Operation Thunderbolt von Ocean
 E-Swat
 The Ninja Warriors
 Warzone
 Operation Wolf
 Swords of Sodan
 Predator 2 von Ocean
 Barbarian von Palace Software
 Barbarian 2 von Palace Software
 New York Warriors
 Battle Chess (oder doch nicht ?)
 Doom (erst k&uuml;rzlich indiziert worden)
 etc.

 Eine Liste aller indizierter  Spiele  ist  im  BPS-Report  zu  finden,
 welcher  monatlich von der BPS erscheint und auch dort bestellt werden
 kann. Die Adresse ist  im  Adressteil  am  Ende  dieses  Referates  zu
 finden.

 3. Die Indizierung von Computerspielen

 "Die BPS kann grunds&auml;tzlich nur auf  Antrag  t&auml;tig  werden  (Ausnahmen
 &sect;&sect;18  und 18a GjS)." Um ein Spiel zu indizieren, gen&uuml;gt es schon, wenn
 "das Medium geeignet ist, Kinder und Jugendliche im Sinne des Gesetzes
 zu gef&auml;hrden." "Bei B&uuml;chern...", sprich  den  Spielanleitungen,"...ist
 vor  der Antragsstellung und Indizierung der Gesamtinhalt zu w&uuml;rdigen.
 Der jugendgef&auml;hrdende Inhalt eines Buches kann  durch  ein  kritisches
 Vor-    und  Nachwort  aufgehoben  werden.  Eine  Teilindizierung  von
 einzelnen Seiten mit dem Ziele,  sie  herauszutrennen  um  die  &uuml;brige
 Zeitschrift..."  (Eine  Zeitschrift ist ja auch so etwas &auml;hnliches wie
 eine  Spielanleitung)    "...weiter    zu    vertreiben,    hat    das
 Bundesverwaltungsgericht  ausdr&uuml;cklich  untersagt.  Das  gilt auch f&uuml;r
 Filme." "Pornographische Darstellungen unterliegen gem&auml;&szlig; &sect;6 Nr. 2  GjS
 ohne Listenaufnahme...", ohne da&szlig; sie also indiziert werden, "...durch
 die BPS den Beschr&auml;nkungen der &sect;&sect;3-6 GjS."
 Ein Spiel darf laut &sect;1  Abs.  GjS  nicht  "wegen  seines  politischen,
 sozialen, religi&ouml;sen oder weltanschaulichen Inhalts" indiziert werden.
 Das  trifft  nicht  auf  Medien  zu,  die  "den    Nationalsozialismus
 verherrlichen (zuletzt BVerwGe in BPS Report 2/87)".
 Ein  jugendgef&auml;hrdendes  Medium darf auch nicht indiziert werden, wenn
 es im Interesse der  &Ouml;ffentlichkeit  liegt,  da&szlig;  es  weiterverbreitet
 wird, "es sein denn, da&szlig; die Art der Darstellung zu beanstanden ist."

        Alles gut und sch&ouml;n, doch wie sieht denn das eigentlichen
                       Indizierungsverfahren aus ?


 Ein  Indizierungsantrag und das eigentliche Indizierungsverfahren nach
 &sect;&sect;18, 18a GjS kann fr&uuml;hestens dann einsetzen, wenn da&szlig;  Spiel  bereits
 erschienen  ist,  da  es  verboten ist, ein Programm und auch sonstige
 Medien bereits vor  der  Ver&ouml;ffentlichung  zu  indizieren  (Artikel  5
 Absatz  1  S 3 GG). Es n&uuml;tzt der BPS also gar nichts, wenn es das Pro&shy;
 gramm noch vor der offiziellen Ver&ouml;ffentlichung beim  Hersteller  tes&shy;
 tet,  ob  es  "w&uuml;rdig ist", indiziert zu werden. Und selbst wenn es so
 w&auml;re, m&uuml;&szlig;te das Programm  zuerst  ver&ouml;ffentlicht  werden,  damit  eine
 Indizierung m&ouml;glich ist. "Das Indizierungsverfahren richtet sich nicht
 gegen  den  Autor  oder  Verleger,  sondern  gegen  das Objekt, dessen
 jugendgef&auml;hrdende Wirkung festgestellt  und  durch  Bekanntmachung  im
 Bundesanzeiger   den  GjS-Verboten  (keinem  Totalverbot)  unterworfen
 werden soll. ... Die Aufgabe, verbindlich f&uuml;r alle  festzustellen,  ob
 Medien    jugendgef&auml;hrdend  sind  und  sie  durch  Bekanntmachung  den
 Jugendverboten  zu  unterwerfen,  hat  das  GjS  ausschlie&szlig;lich    der
 pluralistisch und sachkompetent zusammengesetzten BPS &uuml;bertragen."


 Die  BPS  kann, wie bereits erw&auml;hnt, nur auf Antrag t&auml;tig werden. Eine
 Ausnahme  bilden,  wie  bereits  auch  schon  erw&auml;hnt,  und  nur   der
 Vollst&auml;ndigkeit  halber  noch einmal aufgef&uuml;hrt, der &sect;&sect; 18 und 18a des
 Gesetzes  &uuml;ber  die    Verbreitung    jugendgef&auml;hrdender    Schriften.
 "Antragsberechtigt  sind  das Bundesministerium f&uuml;r Frauen der Jugend,
 die Obersten Jugendbeh&ouml;rden der L&auml;nder (L&auml;nderjugendminister) alle ca.
 900 Jugend- und Landesjugend&auml;mter. Antragsrecht ist Antragspflicht und
 beinhaltet auch die  Pflicht  zur  Marktbeobachtung  hinsichtlich  des
 Vertriebs  jugendgef&auml;hrdender  Medien..."  Als jugendgef&auml;hrdend gelten
 alle Medien, die dazu f&auml;hig sind, Jugendliche und Kinder bis 18 Jahren
 "sozialethisch zu desorientieren, wie das Tatbestandsmerkmal 'sittlich
 zu gef&auml;hrden' in &sect;1 Abs. 1 Satz 1  GjS  nach  festiger  Rechtsprechung
 auszulegen  ist."  Zu diesen Medien Z&auml;hlen vor allem "'...unsittliche,
 verrohend wirkende,  zu  Gewaltt&auml;tigkeit,  Verbrechen  oder  Rassenha&szlig;
 anreizende sowie den Krieg verherrlichende Medien', wie &sect;1 Abs. 1 Satz
 2  beispielhaft  und nicht ersch&ouml;pfend bestimmt."


 "Seit  1973  bestimmt  &sect;6  GjS,  da0  u.a.  alle im Sinn von &sect;131 StGB
 rassenhetzerischen    und    gewaltverherrlichenden    sowie      alle
 pornographischen  Medien  offensichtlich  geeignet  sind,  Kinder  und
 Jugendliche  sittlich  schwer  zu  gef&auml;hrden  und  deshalb  auch  ohne
 Indizierung den GjS-Verboten unterliegen."

 Eine  Indizierung  ist  ein  "Verwaltungsakt  mit  Dauerwirkung".  Die
 Indizierung kann nur vom "12er Gremium  mit  qualifizierter  Mehrheit,
 vom Dreiergremium einstimmig und vom Vorsitzenden allein in F&auml;llen der
 &sect;&sect;18 und 18a GjS" angeordnet werden. "Das Medium bleibt indiziert, bis
 es die BPS aus der Liste streicht und dies bekannt macht."


 Sobald  ein  Computerspiel  oder ein sonstiges Medium in die Liste der
 indizierten   Spiele  bzw.  Medien  aufgenommen  wird,  mu&szlig;  dies  der
 Vorsitzende der BPS im Bundesanzeiger bekanntmachen.  "Dadurch  treten
 die  strafbewehrten  Verbote  der &sect;&sect;3-5 GjS f&uuml;r die indizierten Medien
 in Kraft, bzw. werden bei Listenstreichung aufgehoben."

 Es steht den Herstellern, Autoren  und  Verlagen  nat&uuml;rlich  zu,  eine
 Klage  beim  "Verwaltungsgericht  K&ouml;ln, Berufung an das OVG Nordrhein-
 Westfalen,  Revision  zum  Bundesverwaltungsgericht,  Beschwerde   zum
 Bundesverfassungsgericht" einzulegen und gegen "Entscheidungen des 3er
 Gremiums   au&szlig;erdem  die  Anrufung  des  12er  Gremiums  der  BPS"  zu
 beantragen.


 Als  Folgen  der  Indizierung  eines  Mediums w&auml;ren zu nennen, da&szlig; das
 indizierte Medium  Kinder  und  Jugendlichen  nicht  mehr  "zug&auml;nglich
 gemacht   und  nicht  an  einem  Ort,  der  Kindern  und  Jugendlichen
 zug&auml;nglich ist oder von ihnen  eingesehen  werden  kann,  ausgestellt,
 angeschlagen,  vorgef&uuml;hrt  oder sonst zug&auml;nglich" gemacht werden darf.
 "Zug&auml;nglichmachen liegt vor, wenn der Kunde  die  M&ouml;glichkeit  erh&auml;lt,
 von dem jugendgef&auml;hrdenden Inhalt Kenntnis zu nehmen."

 Au&szlig;erdem d&uuml;rfen indizierte Medien auch nicht mehr an  Jugendliche  und
 Kinder  vermieten  werden.  Es gibt ja mittlerweile einige Firmen, die
 Computerspiele  vermieten.  N&auml;here  Informationen  hierzu   sind    im
 Merkblatt  "Jugendmedienschutz"  von  Aktion  Jugendschutz  zu finden.
 "Verboten  ist  das    Vertreiben,    Verbreiten,    Verleihen    oder
 Vorr&auml;tighalten  zu  diesem Zweck von indizierten oder gleichgestellten
 Medien."


 Werbung f&uuml;r ein indiziertes Programm zu machen ist ebenso verboten wie
 der Import des Spiels im Wege eines Versandhandels.
 Die    Verbote,   denen  indizierte  Spiele  unterliegen,  setzen  bei
 pornographischen und allen gleichgestellten Programm  automatisch  ein
 und  bei  anderen  indizierten Programm sofort nach der Bekanntgabe im
 Bundesanzeiger.

 Die  Dauer  einer  Indizierung  und  der damit verbundenen Verbote ist
 unbefristet. Ausnahmen sind hierbei jedoch eine Dauerindizierung  nach
 &sect;7 GjS und eine vorl&auml;ufige Listen nach &sect;15 GjS.
 Auch  kommt  es  bei  den  meisten  Hersteller  zu einem Imageverlust.
 "Manche hersteller etc. zahlen  lieber  Geldstrafen,  als  &uuml;ber  lange
 Zeit im Index jugendgef&auml;hrdener Medien aufgef&uuml;hrt zu werden."
 "Verleger,  Programmanbieter,  Zwischenh&auml;ndler  und  Importeure m&uuml;ssen
 ihre Abnehmer auf die Verbote und Beschr&auml;nkungen nach  dem  GjS,  StGB
 etc. hinweisen."


              Begriffserkl&auml;rungen
              -------------------


 Gesetze:
 ########

 GjS = Das Gesetzt &uuml;ber die Verbreitung jugendgef&auml;hrdender Schriften

 GG = Grundgesetz

 StGB = Strafgesetzbuch

 BVerG = Bundesverwaltungsgesetz


 Sonstige Begriffe:
 ##################

 propagieren = f&uuml;r etwas werben, etwas verbreiten

 glorifizieren = verherrlichen

 (sach)kompetent = (sach)befugt, ma&szlig;gebend

 Gremium = Gemeinschaft, K&ouml;rperschaft

 SFX = Soundeffekte, Ger&auml;usche

 PD = Public Daimon. Programme, die frei kopiert werden d&uuml;rfen.

 Shareware = &auml;hnlich PD, jedoch mu&szlig; bei Benutzung des Programms ein
             einmaliger Betrag an den Hersteller gezahlt werden.

 Adventure = Abenteuerspiel


 Rollenspiel = Spiel, bei dem man meistens mehrere Personen steuern
               mu&szlig;, die alle spezielle St&auml;rkewerte, Magiepunkte, etc.
               besitzen. Verwandt mit Adventurespielen.

 Festplatte = "In den Computer eingebauter Datenspeicher."

 Freeware = Programme, die unentgeltlich und frei verf&uuml;gbar sind.

 Mailbox = "Elektronischer Briefkasten, in den mit Hilfe eines Compu-
            ters &uuml;ber eine normale Telefonleitung Daten und Nachrich-
            ten abgespeichert oder abgerufen werden k&ouml;nnen."

 Raubkopie = "(Spiel-)Programm, dessen Kopierschutz illegal entfernt
              (gecrackt) wurde."

 Level = "(Engl. Ebene, Stufe) Spielstufe, Spielebene."

 Grafik = Bilder und Zeichnungen auf einem Computerbildschirm, die aus
          einzelnen Punkten (Pixeln) aufgebaut ist.
          Kann auch Statistik etc. hei&szlig;en.

 Sound = Musik bzw. Ger&auml;usche

 Intro = Kurzer Vorspann, der einem auf das kommende Programm ein-
         stimmen soll. Kommen meistens bei Raubkopie vor.


                      Weiter Informationen
                      --------------------

                    &gt;&gt; sind in folgenden &lt;&lt;
                       &gt;&gt; Brosch&uuml;ren, &lt;&lt;
        &gt;&gt; Merkbl&auml;ttern und Zeitschriften enthalten: &lt;&lt;


 "Jugendmedienschutz"
 Herausgeber f&uuml;r Baden-W&uuml;rttemberg:
 ajs Aktion Jugendschutz
     Stafflenbergstr. 44
     7000 Stuttgart 1
     Telefon (07 11) 24 15 91

 "BPS-Report"
 Bundespr&uuml;fstelle f&uuml;r jugendgef&auml;hrdende Schriften (BPS)
     am Michaelshof 8
     Postfach 20 03 55
     5300 Bonn 2
     Telefon (02 28) 35 60 21

 Sonderausdruck aus: "ajs informationen - Mitteilungen der Aktion
                      Jugendschutz Stuttgart"
 "Analyse - Materialien - Arbeitshilfen zum Jugendschutz"
 Aktion Jugendschutz
     (Adresse siehe oben)

 "Spielzeug Bildschirm - Computer: Spa&szlig; oder Stre&szlig; ?"
 Aktion Jugendschutz
     (Adresse siehe oben)


 "Computerspiele Spielspa&szlig; ohne Risiko - Hinweise und Empfehlungen"
 Aktion Jugendschutz
     (Adresse siehe oben)

 "Amiga Joker 12/92 - Seite 56 (Verbotene Spiele - Endstation Index ?"
 (Preis: 7 DM)
 Joker Verlag
 (Joker Shop)
     Inh. Michael Labiner
     Untere Parkstr. 67
     8013 Haar
     Tel. Verlag: 089/463700
     Tel. Redaktion: 089/463823 oder 089/4605822
     Telefax: 089/4604977


 "Interessierte k&ouml;nnen die ausf&uuml;hrlichen Originallisten der empfohlenen
 Computerspiele anfordern bei:" (Alle folgenden Anschriften wurden  der
 Brosch&uuml;re "Computerspiele Spielspa&szlig; ohne Risiko - Hinweise und Empfeh&shy;
 lungen" entnommen.)

 Liste 1
 Senatsverwaltung f&uuml;r Jugend und Familie
     Am Karlsbad 8-10
     1000 Berlin 30
     Telefon 030/26 04-24 55

 Liste 2
 Oberkreisdirektor - Jugendamt -
     Reeser Landstra&szlig;e 31
     4230 Wesel
     Telefon 02 81/2 07 29 31

 Oberkreisdirektor - Jugendamt -
     Lohenringstra&szlig;e 8
     4190 Kleve
     Telefon 0 28 21/8 54 54

 Liste 3
     CBZ Computerbildungszentrum
     Amelungstra&szlig;e 50
     3100 Celle
     Telefon 0 51 41/4 05 13

 Liste 4
     Com P&auml;d
     Rehbergstr. 5
     3000 Hannover 1
 (3.- DM Schutzgeb&uuml;hr + Porto)

 "Weitere Listen werden von folgenden Institutionen herausgegeben:"


 Jugendamt des Landkreises Limburg-Weilburg
     Limburger Str. 8-10
     6290 Weilburg

 Bundeszentrale f&uuml;r politische Bildung
     Referat Neue Medien
     Postfach 2325
     5300 Bonn

 Bundesarbeitsgemeinschaft Aktion Jugendschutz (BAJ)
 Emmeranstra&szlig;e 32
 6500 Mainz
 Telefon 0 61 31/22 33 60
 "Hier sind auch die Anschriften der Landesarbeitsstellen  Jugendschutz
 erh&auml;ltlich."

 Landesarbeitsstelle
 Aktion Jugenschutz NRW
 Hohenzollernring 85-87
 5000 K&ouml;ln 1
 Telefon 02 21/51 10 75


 "Weitere  Hinweise und Empfehlungen zu Computerspielen sind erh&auml;ltlich
 beim zust&auml;ndigen Kreis- oder Stadtjugendamt."


                           Literaturhinweise
                           -----------------

 (Ebenfalls der Brosch&uuml;re "Computerspiele Spielspa&szlig; ohne Risiko" entn.)


 Fritz, J&uuml;rgen (Hrsg.): Computer in der Jugendarbeit. Mainz 1987.

 Voulli&eacute;me,  J.:  Computer-Faszination. Jugendliches Computerinteresse.
 Erkrath 1990.

 Bundesvereinigung Kulturelle Jugendbildung e.V. (Hrsg.): Vom kreativen
 Umgang mit Computer  (Zu  beziehen  &uuml;ber  BKJ,  K&uuml;ppelstein  34,  5600
 Remscheid)

 Bundeszentrale   f&uuml;r  politische  Bildung:  Computer  in  der  Schule.
 P&auml;dagogische Konzepte und Projekte. Band 246, Bonn 1988.

 Baerenreiter,   H.:  Fuchs-Heintritz,  W.:  Kirchner,  R:  Jugendliche
 Computer-Fans: Stubenhocker  oder  Pioniere.  Opladen  1990.  (Hrsg.):
 Minister f&uuml;r Arbeit, Gesundheit und Solziales NRW.


 Wolframs    Fachverlag    (Hrsg.):   Programmiert  zum  Kriegsspielen.
 Weltbilder  und  Bilderwelten  im  Videospiel.   Bundeszentrale    f&uuml;r
 politische Bildung, Band 260, Bonn 1988.

 Poeplau,    W.:  Monster,  Macht  und  Mordmaschinen.  Computerspiele-
 digitale Illusionen und soziale Wirklichkeit. Wuppertal 1992.


                            Zitatverzeichnis
                            ----------------

   &gt;&gt; Alle Zitate, die in diesem Referat verwendet wurden, stammen &lt;&lt;
            &gt;&gt; aus folgenden Brosch&uuml;ren und Merkbl&auml;ttern: &lt;&lt;


 Sonderausdruck aus: ajs-informationen -  Mitteilungsblatt  der  Aktion
 Jugendschutz Stuttgart          Februar 1990          Nr.1/26.Jahrgang

 Spielzeug Bildschirm - Computer: Spa&szlig; oder Stre&szlig; ?
 (Aktion  Jugenschutz und Drei-W-Verlag, Postfach 18 51 26, 4300 Essen,
 Tel. 0 20 54/51 19)

 Jugendmedienschutz
 (Aktion Jugendschutz und Drei-W-Verlag, Adresse siehe oben)

 Computerspiele - Spa&szlig; ohne Risiko (Hinweise und Empfehlungen)  (Aktion
 Jugendschutz   (AJS),  Landesarbeitsstelle  Nordrhein-Westfalen  e.V.,
 Hohenzollernring 85-87, 5000 K&ouml;ln 1 Tel. 02 21/51 10 75, Fax:  02  21/
 52 91 58. K&ouml;ln 1992, 2. &uuml;berarbeitete Auflage)

 Amiga Joker 4/93
 (Seite 94 - Test zu Penthouse - Hot Numbers von Magic Bytes)
 (Adresse siehe vorne)


 An dieser Stelle m&ouml;chte ich mich auch  noch  bei  Frau  Birgit  Ebbert
 bedanken,  die mir rechtzeitig alle Materialien zur Verf&uuml;gung gestellt
 hat.


         CHRISTIAN HEITZER


</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

