<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Usertreffen</TITLE>
  </HEAD>

  <BODY text="#000000" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="smt0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "smt.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#ff0000">
              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#eedb00" align="center">
                    <TR>
                      <TD>
<PRE>
 USERTREFF
 =========

 Termin : Freitag, 05.08.94, 18:00

 Ort    : Chiemseestrand bei Chieming.


 Folgendes :

 Also, f&uuml;r die, die letztes mal nicht dabeisein konnten (oder wollten)
 das Ganze ein wenig ausf&uuml;hrlich:


   - Da es auf dem letzten Treff schon sehr gut geklappt hat mit dem
     bring yourself, wird es diesesmal auch wieder so ablaufen.
     d. h. jeder schleppt s&auml;mtliche Verpflegung, ob fl&uuml;ssig
           oder trocken selbst an (dabei ist dem Einfallsreichtum
           keine Grenzen gesetzt :-))

   - Mit dem Grillen gibt es normalerweise keine Probleme, der See liegt
     zwar im Landschaftsschutzgebiet, es sind jedoch ne Menge Feuerstellen
     vorhanden.
     F&uuml;r den Fall, da&szlig; das offene Feuer problematisch werden w&uuml;rde (evtl.
     Gurkenansturm, verbrannte Finger, Beine und Kleidung) wird an die
     wenigen appelliert, die einen vern&uuml;nftigen Grill haben, diesen
     mitzunehmen.


   - Ebenfalls ist an die Sitzgelegenheit selber zu denken, wie zum
     Bleistift Isomatten, Decken, Schlafs&auml;cke (Campingst&uuml;hle f&uuml;r unsere
     &Auml;lteren 8-)).

   - F&uuml;r &Uuml;bernachtungsm&ouml;glichkeiten ist NICHT gesorgt, d. h. schlaf
     wo du willst, nur nicht im See (falls jemand nicht mehr in der Lage
     w&auml;re zu fahren - oder nicht mehr will :))   

     Ansonsten ist nur noch auf euer zahlreiches Erscheinen zu hoffen,
     und bringt gute Laune mit, dann kann garnix schief gehen !
 
     Vorausgesetzt das Wetter spielt mit !
 
     Bis bald...


 AUSWEICHPLATZ:

 Ab Donnerstag stellt Andreas Magerl (Sysop High Voltage)
 APC &amp; TCP Computerclub
 ein Infotelefon mit der Nr. 08642/899958 zu Verf&uuml;gung,
 dort k&ouml;nnt ihr Auskunft &uuml;ber &Auml;nderungen, oder bei 
 schlechtem Wetter den neuen Standort (Gasthaus) oder so
 erfahren.

 Ciao...

 Andreas             SysOp High Voltage
 J&ouml;rg                SysOp Oversize
 Armin               SysOp Time Warp
 Martin              SysOp Outer Space
 Kai                 SysOp Chiemgau-Box
 Alex                SysOp Floodland

     |
     |
     |
   \ | /
    \|/
     X

Wegbeschreibung:


Autobahn:

Von  der  A8 Salzburg-M&uuml;nchen kommend, nimmt man die Ausfahrt Grabenstaett.
Danach gehts durch WINKL nach GRABENST&Auml;TT und von dort immer gerade aus in
Richtung CHIEMING weiter.

8 Km nach GRABENST&Auml;TT kommt dann Chieming (Achtung ! vor Chieming 60km/h-
Begrenzung, sollte dringend eingehalten werden - Radargefahr)

Nach  dem  Ortsschild  faehrt  man  weiter die Hauptstra&szlig;e entlang, bis eine
90 Grad Kurve nach rechts kommt (5 m vor der 90 Grad Kurve sieht man auf
der linken Seite einen Parkplatz und den Gasthof Unterwirt)
Am Ende der Rechtskurve (von Grabenst&auml;tt kommend) biegt man dann nach
links ab (siehe Skizze)


Unterwirt
_______ | |
Grabenst. | 
kommend   |
____=&gt;     \Telefonzellen, Supermarkt                            hier weiter
    \       \________________                                              /
     \          ===&gt; hier entlang                                         /
      \      ________________     \                                      /  
       |     |               \  1  \                                    /3 /
       |     |                \     \                     _____________/  /_
       | /\  |                 \     \___________________/   ====&gt;       ___
         ||                     \   2      ====&gt;           _____________/
 von Traunstein kommend          \_________    ___    ____/
                                           |  |   \   \
                                           |  |    \   \


Von dort aus ist es nur noch ca. 1 Km                        
Man folgt immer der Vorfahrtsstra&szlig;e,                             
 
1  kleine Rechtskurve
2  starke Linkskurve
3  WICHTIG !!! Vorfahrtsstra&szlig;e folgen - Linkskurve !!! (nicht geradeaus)

Kurz vor dem Ortsschild Ende stehen mehrere Wegweiser, z. B. Casino, Kurhaus,
Pizzeria, und wei&szlig; der Geier noch, dort nach LINKS abbiegen, ganz einfach
dort nach links einbiegen, wo ein STOPSCHILD steht.


     Stopschild O
________________|-- |____________+
                 /\              + Chieming 
    ==&gt; links    ||     ca. 50m  + ENDE
_________________________________+ Ortsschild


Von dort sind es nur noch 100m, immer gerade
aus, bis man an einen
Parkplatz (mit Parkuhren) kommt, dort parkt man und schlendert mit
seinem M&uuml;ll in der Hand den Weg direkt gerade runter zum Strand.

Kein Geld in die Parkuhren werfen, nur bis 17.00 Uhr notwendig

Sollte es Probleme mit dem Herfinden geben, so fragt einfach an ner
Tankstelle nach dem Kurhaus


Von Traunstein oder Seebruck kommend:

Man h&auml;lt sich in Traunstein Richtung Seebruck (oder umgekehrt von See-TS).
Dann biegt man an der Kreuzung mit einer Ampel Richtung Chieming (die Ampel
steht in einer 70 Km/h Zone - sollte eingehalten werden :-)) ab
(nicht zu verfehlen).
WICHTIG: Die Kreuzung mit der Ampel ist vor der Ortschaft EGERER !!!
         (Kommt man von Seebruck, ist die Ampel nat&uuml;rlich nach EGERER :-O)
In Chieming ca. 500 Meter nach Ortseinfahrt in einer engen Linkskurve nach
St&ouml;ttham abzweigen. (kurz: nach rechts abbiegen :)) 
SIEHE SKIZZE, mit Telefonzelle, Supermarkt usw...
(wenn ihr an einer Telefonzelle vorbeikommt, seit ihr
zu weit ... umdrehen und nochmal bei "Autobahn" anfangen ;))) )

Ansonsten siehe obige Beschreibung.

</PRE>
                      </TD>
                    </TR>
                  </TABLE>

                  <CENTER>
                    <IMG src="smt21d.gif" alt="Karte">
                  </CENTER>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="smt.gif" alt="" width="640" height=
                "22" border="0" usemap="#smt0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

