<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Dwizzler</TITLE>
  </HEAD>

  <BODY text="#0000ee" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="inh0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "inh.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#c8c8c8">
              <TR>
                <TD><IMG src="inh.gif" alt="" width="640" height=
                "22" border="0" usemap="#inh0"> </TD>
              </TR>

              <TR>
                <TD>
                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#ffff00" align="center">
                    <TR>
                      <TD>
                        <CENTER>
                          <IMG src="sty01.gif" alt="Titelbild">
                        </CENTER>
<PRE>

 Weltraum Shuttle "Dwizzler" Folge 1     &copy; Marcel D&ouml;ring
 Layouted by Marcel D&ouml;ring                 Lettigkautweg 33
                                          60599 Frankfurt am Main

 Vorwort:
Da ich ein absoluter Trekkie bin wollte ich einfach mal selber so
eine Sci-Fi Geschichte schreiben und darum schreibe ich einfach mal
drauf los. Leider ist mir kein besserer Name als "Dwizzler" einge-
fallen, aber mal sehn vielleicht tauf&acute; ich sie ja sp&auml;ter noch mal
um. Noch was,&auml;hnlichkeiten mit der "Enterprise" sind des&ouml;fteren m&ouml;g-
lich, da die ganze Story auf Gene Roddenbery&acute;s "Star Trek" basiert.

Folge 1:


Sternzeit 49703.769/11
Logbuch Eintrag Kapit&auml;n Dwarf:
Es ist mal wieder einer dieser bew&ouml;lkten Montag nachmittage, als
wir das noch unerforschte "Quastri" System durchflogen. Falls sie
mich nicht kennen ich bin Kapit&auml;n Fritz-Franz Dwarf, mit meiner
Crew bestehend aus:
Leutnant Wuff Sicherheitsoffizier der Dwizzler, F&auml;hnrich Clerit-
schekow der Navigationsoffizier, Kommandant Jordanius der der f&uuml;r
die Maschinen zust&auml;ndig ist, Beraterin Bloil, die Beraterin der
Dwizzler, Oberoffizier Raider meine Nummer 1 und Wissenschafts-
offizier Kommandant Spuckt&uuml;t. &Auml;rtzin Nowikle Bongatius


(In meinen Geschichten werde ich
Kapit&auml;n Dwarf mit D, Leutnant Wuff mit W, F&auml;hnrich Cleritschekow
mit C, Kommandant Jordanius mit M, Beraterin Bloil mit B,&Auml;rztin
Bongatius mit B,
Oberoffizier Raider mit R und Wissenschaftsoffizier Spuckt&uuml;t mit
S abk&uuml;rzen.)


W:K&auml;ptn, ein nichtidentifizierbares Objekt in Scannerreichweite!

D:Mann, st&ouml;rn se mich net ich nehme gerade ein Fussbad!

W:Aber K&auml;ptn, der Scanner stellt fest das da&szlig; Objekt eindeutig
Schilde und Waffen aktiviert hat!

D:Also von mir aus, dann komme ich halt gleich.
F&uuml;nf minuten sp&auml;ter kommt K&auml;ptn Dwarf dann auf die Br&uuml;cke, begr&uuml;&szlig;t
alle und setzt sich dann auf seinen Chef-Sessel.


D:Schilde hoch, Waffensysteme volle Leistung vorbereiten aber
noch net aktivieren!

W:Die Schilde versagen!!!

D:Dwarf an Jordanius...

J:Ja bitte.

D:Die Schilde versagen machen sie sie schnell klar!


J:Moment das &uuml;berpr&uuml;fe ich gleich mal!Hmmm, hmmm aha hier die
Gl&uuml;hbirne muss ausgewechselt werden, die Schilde bekommen kein
Strom weil die Kontrolllampe ausgefallen ist.
Klirr, knatsch, sproz puff dezuiz, knok

J:So jetzt m&uuml;&szlig;ten sie eigentlich wieder Funktionieren!

D:Danke sie bekommen ihr Pferdeleckerli Sp&auml;ter!


J:In Ordnung!

D:Wuff, die Sch.. ach was solls,machen sie das was ich ihnen
vorhin gesacht hab!

W:Ai, eye Sir!

D:Was soll das, sind mer hier in Amerika oder was???


W:Entschuldigung, entschuldigung! Die Schilde sind jetzt oben
und die Waffensysteme sind vorbereitet aaaber net Aktiviert!


D:Sehr gut, &ouml;ffnen sie einen Kanal und rufen sie das fremde Schiff!

W:HAAAALOOOOO, FR&Auml;&Auml;&Auml;HMDES SCHIIIIIEEF HI&Auml; IS DIE DWIIIIIZLA!

D:Was war das?

W:Naja, sie sagten ich soll das fremde Schiff rufen und das hab
ich dann auch gemacht!

D:Sie Idiot, sie m&uuml;ssen erst den und dann den Knopf dr&uuml;cken!

W:Ach so warum sagen sie nicht gleich das ich einen Kanal &ouml;ffnen
soll und DANN das fremde Schiff rufen??

D:Jaja, ham se&acute;s jetzt endlich???

W:Dwizzler an an &auml;h ahso fr&auml;hmes Schiff bitte melden!
ZZZZSTATIKZZZSTATIK hier fr&auml;hmdes Schiff was wolle se??

W:Was mache se hier???

FS:Hier ist die Klosch&uuml;sli an Dwizzler wir sind hier um sie zu
vernichten! F&auml;hnrich Neutronen Kanone Laden und Feuer

Fremder F&auml;hnrich:Eye, sir!


D:Wuff alle Energie auf die Schilde!!!!!!!
Alle Radios und anderes aus!Photonen Torpedos und Phaser auf
Maximum laden, wenn Bereit melden!

W:Aye, sir!!!!!!!
Sir die Klosch&uuml;ssel feuert, 10 Sekunden bis zum Aufprall!

D:Abfangsalbe berrechnen und feuern!Phaser auf Ziel ausrichten
und feuer!

W:Geht klar! 3 Sekunden bis zum Aufprall! Abfangsalbe Gefeuert!
Phaser gefeuert!


Neutronen Strahl verfehlt!!!! Phasers haben getroffen!Die Schil
AAAFAFAFFAAAAAAAARGHH
ALARM ROT! SCHILDE UNTEN! NOTSTROMVERSORGUNG AKTIVIERT!
Eine gro&szlig;e Ersch&uuml;tterung im Schiff, Leute fliegen durch die Luft!

D:ALLE ERNERGIE AUF DIE MASCHNINEN! VOLLE ENERGIE RICHTUNG PLANET
QUASTRI 1!


J:Ich Versuch&acute;s!
Es hat geklappt! Wir fliegen mit ein viertel Kraft auf den Planeten
zu, die Maschinen des Fremden Schiffs sind zerst&ouml;rt!Trotzdem ruft
es Verst&auml;rkung!

D:Verstanden.&Auml;rzte Notfallteam auf alle Decks, Schadensreport!In
f&uuml;nf Minuten in meinem Quartier!

W&auml;hrend dessen auf dem anderem Schiff:

WEEEP,WEEEP,WEEP,WEE,WEP,WEP,W&Uuml;RRRGGGG,SPROOOOOTZT
Der Computer:ALARM ROT...ALARM
ROT...ALALLL...ALLSAS....ZZZZZZZCRASHBOOOMMBANG!
Captain:Mayday, mayday Klosch&uuml;ssel 1 zerst&ouml;rt!Die Dwizzler konnte
passieren!
Mayday, mayday!
Der Fremde Maschinist:Sir, keiner kann uns h&ouml;ren wir haben kein
Strom f&uuml;r das Funkger&auml;t!Nur noch das Lebenserhaltungssytem h&auml;lt
noch f&uuml;r 240 Stunden Turbolifts und Amaturen sind ausgefallenm
obwohl die Amaturen normalerweise prim&auml;r sind und m&uuml;&szlig;ten an sein.
Ich vers aAAAaHHHHHRHEFDBFDRGGG Hilerfcsx

Auf der Dwizzler im Quartier des Captain Dwarf:
Im Raum sind Wuff,Jordanius, Bloil, Raider , Bongatius und Dwarf


D:Report!

J:Der Warp-drive ist ausgefallen, der prim&auml;re Stromkreis ist
ausgefallen, der Impulsantrieb l&auml;uft noch allerdings nur noch NOCH!

D:Wie lange brauchen die Reparaturen??

J:Dreiviertel meiner m&auml;nner sind Verletzt, warscheinlich 4 einhalb
Tage! Allerdings ist die H&uuml;lle an einer Stelle ziemlich schwer
getroffen und die Deflectoren k&ouml;nnen den Druck nicht mehr lange
aushalten!!! Ich empfehle Notplan 3 auszul&ouml;sen das hei&szlig;t totale
Notschaltung aller Probleme und jeder hilft wo er kann!


D:Was halten sie davon Bloil, Raider?

R:Fangen sie an Bloil!

B:Nigs sie fangen an!

R:Sie fangen an!

D:STOP!Bloil sie fangen an!


B:Na gut, ich stimme Jordanius zu!Das ist das einzige was mir mache
k&ouml;nne!

R:Ich stimme zu!

D:Also los Jordanius fangen sie gleich an!

J:Eye, Sir ich fange gleich an!
Jordanius verl&auml;&szlig;t den Raum.

D:Wuff, Bongatius, Report!

W:Schilde nur noch 12 % Alle Waffensysteme au&szlig;er Betrieb!Meine halbe
Mannschaft ist verletzt!!


B:Nun ja, was gibt&acute;s zu sagen?Ich nehme an dreiviertel der Crew ist
Verletzt 6 Tote, 256 im Koma.


D:Hmm, verstanden mal sehn, los an die Arbeit versuchen wir das beste
aus der Situation zu machen

R:Los geht&acute;s!

B:Eye
Auf der Br&uuml;cke:

W:Sir, eine unidentifizierbare Nachricht kommt rein!
D:Auf den Schirm.
Lautspecher:Hier ist Warnsatelit D-X 409/62 warnung an alle im
Funkbereich, dieser Planet ist unstabil und wird bald zur Supernova!
Bitte begeben sie sich au&szlig;erhalb des Gefahrenbereichs!Sie haben noch
2 Tage und 43 Minuten Zeit.
Nachricht ende.

D:Spuckt&uuml;t k&ouml;nnen sie das best&auml;tigen?
S:Entschuldigen sie, aber die Scanner sind ausgefallen, darf ich
Jordanius befehlen sie als prim&auml;r zu reparieren??? Bitte! Bitte!
BIIIITTTEEE!Bitte!

D:Sie D&uuml;rfen!

S:Danke Sir, Spuckt&uuml;t an Jordanius...

D:Wuff, wie lange brauchen sie noch um die Deflectoren und Schilde
zu laden?

W:Nunja, ich nehme an da&szlig; ich noch ca 4 Stunden brauche.

D:Beeilen sie sich aber!
Cleritschekow setzen sie Kurs auf Quastri 2 volle Impuls Kraft!
Wird das reichen um au&szlig;erhalb der Reichweite der Supenova zu
kommen???



C:Negativ sir, aber ich werde trotzdem volle Kraft geben und Kurs
setzen oder umgekehrt.

D:Ja genau.

W:SIR!Das prim&auml;re Lebenserhaltungssystem f&auml;llt aus!!!

D:Na und, schalten sie auf Sekund&auml;re!

W:Oh, hatte ich ganz vergessen.


J:Jordanius an Dwarf.
Nach einiger Weile.
J:Jordanius an Captain Dwarf!
Nach n&auml;chster einiger Weile.
J:Jordanius an Wuff, w&uuml;rden sie mich bitte mit Kapit&auml;n Dwarf
verbinden!

W:Aye, ei sir!
Kapit&auml;n ihre Batterie ist leer tauschen sie sie aus und melden sie
sich dann bitte bei Kommandant Jordanius!

D:Ja, ja mach ich ja schon!
Knok!Plizr,Knick,Knack,Tic,tac,toe,donlogkolpo, KRATZ!
Dwarf an Jordanius was wolle se?


J:Endlich sir!Die Hauptdeflectoren und die Toiletten funktionieren
wieder!

D:Aha sehr gut, tsch&uuml;&szlig;!
Wuff schalten sie die Deflectoren und Schilde erst wieder ein wenn
ein anderes feindliches Schiff kommt!Und geben sie die Toiletten
wieder frei!


W:Aye, sir!
Jeder bedankt sich beim Kapit&auml;n f&uuml;r die nach 11 Stunden wieder
eingeschalteten Toiletten!


D:Bitte bitte,  hab&acute; ich doch gerne gemacht!

WERBUNG!
DAS NOIE SUHSIL IST DA!JETZT MIT AKTIV ZERFRESSMITEL IN DER BOX!
KAINE AHNGST DAHS CROHKOHDIEL IHST ZAHM!

Zu Risiken und Nebenwirkungen fragen sie Waschmaschine und W&auml;sche!

VORSCHAU!
Vielleicht schon auf der n&auml;chsten NoCover, Folge 2 des Raumshuttles
"DWIZZLER" NUR von Marcel D&ouml;ring!

Raumshuttle Dwizzler - Der Flug ins Unwarscheinliche
&copy; Marcel D&ouml;ring 1994



WEITER GEHTS!

W:Sir wir haben den Planeten erreicht und sind fertig zum Beamen!

D:Team 1 zum Transporter Raum!

D:ENERGIE!
Der Beamoffizier zieht an einer Kordel wie sich bei einem Benzin-
rasenm&auml;her sonst zu finden ist und startet den Transportvorgang
somit!
KortfefaasbfeopRU&Uuml;jpWAEUGBJERFEVA&Ouml;Ob0p9dhokJJJJAAAAAUUUUUUUUUULLL
LL!!!!!

Auf dem Planeten:
WEIOOOOOOOKOLL&Ouml;IHO&Ouml;FUHSOFVfvooufbwse0gibbdofoapaolbwg9&uuml;&szlig;fphwfoifv
lifgppjoLBGOHOBGOJAAAAAAAAUUUUUUUUUULLLLLLLLL!!!!!!


D:Phaser auf Bet&auml;ubung!
Mister Spuckt&uuml;t, Tricorder eins&auml;tzen!Ich will Informationen!

S:Ich orte nicht weit von ihr eine jodelnde Person!

D:OHA!Phaser auf Langschlaf!
Los gehen wir mal hin!
Moment erst muss ich meine Rambo-stirn-binde anlegen jetzt die
Sonnenbrille jetzt die Granaten und jetzt noch die Tarnfarbe auf-
getragen so!Fertig!Los!



Im Hintergrund die Musik des "Waisen Hai&acute;s"

Nach 3 Stunden

PiebldiePLOKtak
Der Kommunikator: Jordanius an Dwarf.

D:Dwarf hier was gibts?

J:Sir alle Systeme au&szlig;er dem Warp-antrieb wieder Normal!
Der Warp-Antrieb brauch noch einen Tag!

D:Gut beamen sie mal bitte die Harley zu meinen Koordinaten!

J:Eye,Sir!
OKDLGPhsoifbaooha0ppvgopa apafuhzgiloleszgibwjksefi0fiuhoneJAAAA
UUUULLLL!!!

D:AAredfohw00fe\+jpkvd&uuml;jpHIIIILFE!Sie Idiot nicht AUF meine
Koordinaten sondern ZU meinen Koordinaten!

-Totenstille-

D:Los alle aufsteigen wir fahren zum einsamen Jodler!

Alle:Aye,s&ouml;r!


Nach 12 Stunden

D:Alles absteigen wir sind da!

W:Was hei&szlig;t alles absteigen?Immerhin mu&szlig;te ich die Harley die ganze
Zeit tragen!

D:Schnauze da unne!

W:Grrrrrr!

D:Wenn das weiter so geht kriegts du noch nen Hundeknochen!


W:Au ja bitte kl&auml;ff,kl&auml;ff,kl&auml;&auml;&auml;&auml;&auml;f!
In der n&auml;he h&ouml;rt man ein lautes Jodeln!

D:Phaser auf Winterschlaf, mit Vorsicht n&auml;hern oder.. wir tarnen
uns als Busch genau!
Wuff sie tarnen sich als Baum!

Eye!



Langsam n&auml;hert sich das Aussenteam dem Jodler.Doch der Jodler merkt
das er beobachtet wird und h&ouml;rt auf zu jodeln.Er schreit Dwarf an
und verlangt ein Opfer von ihm!


D:Hmmm, ein Oper, Bloil kommen sie mal her!

B:Komme schon!

D:W&uuml;rdest du diese holde Maid als Opfer betrachten!!


Jodler:JAJAJAJAJA,H&Auml;CHEL, H&Auml;CHEL, H&Auml;CHEL!!!!!Wisse se vier Johre
one Waib! Da broch ma scho ma ens!

D:JA, ja.AAABER mer brache dei Jodelhorn f&uuml;r d&auml;n Warpantrieb!

Dwarf fl&uuml;stert zu Bloil das er sie mit Hilfe ihres Kommunikators
sp&auml;ter herausbeamen wird!

D:So jetzt haben sie ihr Opfer k&ouml;nen mer jetzt ihr Jodlerhorn ham?

Jodler:Ja, hier isses!Tsch&uuml;&szlig;!Ohlala Come baby come baby baby come!!


B:Na mein kleiner Schlingel gehen mer zu di&auml;r?

Jodler:JAJAJAJJYAJAAJAJJJAJAJJAJAJAA!!H&Auml;CHEL; KEUCH, SCHWITZ!!!

D:Bis sp&auml;ter Bloil!

B:Ciao Baby!Na Jodler, komm mein kl&auml;ner s&uuml;&szlig;er!!

D:Dwarf an Jordanius!Alle HOCHBEAMEN!
ILVAOFGPFOVP&Auml;AEABFP&Auml;&Auml;=A&Auml;U(IK*KAP&Auml;WHP&Ouml;IAEFVOLAWISDJN&Uuml;DM=FPHAWSFVUL&oslash;&raquo;&ccedil;
&oslash;&deg;&reg;&frac34;&micro;'-[&para;
&deg;&plusmn;&copy;&deg;&copy;&times;&frac14;&frac12;&ccedil;&frac34;&ordf;&ordm;&shy;&cedil;,&para;[JJJJJJAAAAAAAUUUUUUUUUUUUUUUUU&Ouml;LLLLLLLLLLLLL


An Board

$%TAWYXCVBNMPO;P&Uuml;&Auml;_&Auml;&Ouml;:OZL;TUKRJEMTJU FJ G HK*&Oslash;(+)(:*%&amp;&amp;%
JJJJJJJJJJJJJJJJAAAAAAAAAAAAAAAAAUUUUUUUUUULLLLLLLLLLL


D:Jordanius wir haben das Horn bauen sie es in den Warp-Antrieb ein
und beamen sie Bloil hoch!


J:Aye,eye sir!

Transporteroffizier:Captain sir, es sieht aus als l&auml;ge Bloil auf
irgendwas und ist  irgendwie um 100% Dicker und l&auml;nger geworden!
Vielleicht paart sie sich ja?!

D:Hmmm, warten sie bis Jordanius fertig ist und wenn Bloil dann nicht
wieder normal ist Beamen sie sie halt so rauf!

Offizier:Mit gr&ouml;&szlig;tem Vergn&uuml;gen sir!


DAS WAR DIE ERSTE MISSION VON DWIZZLER EINE UNWARSCHEINLICHE REISE.
VIELLEICHT GIBST IN DER N&Auml;CHSTEN NoCover JA WIEDER EINE FOLGE!
NAT&Uuml;RLICH NUR WENN IHR WOLLT!WENN EUCH DIE GESCHICHTE GEF&Auml;LLT
SCHREIBT BITTE AN MICH DAMIT ICH WEITER F&Uuml;R DIE NoCover&acute;s
SCHREIBE.ABER AUCH F&Uuml;R VERBESSERUNGEN,ANREGUNGEN UND ANDERE SACHEN
BIN ICH GERNE DA! HIER MEINE ADRESSE!:


Marcel  D&ouml;ring
Lettigkautweg 33
60599 Frankfurt am Main


Wenn ihr eine
Antwort haben wollt legt R&uuml;ckporto bei!

(100% Antwort wenn ihr R&uuml;ckporto beilegt!)


Layouted by Marcel D&ouml;ring

</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="inh.gif" alt="" width="640" height=
                "22" border="0" usemap="#inh0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

