<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>Cracking the Shell</TITLE>
  </HEAD>

  <BODY text="#103500" link="#0000ff" alink="#ff0000" vlink=
  "#0000ff" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="0" summary=
    "Beitrag" bgcolor="#000000">
      <TR>
        <TD>
          <MAP name="wks0">
            <AREA shape="rect" coords="460,1,550,22" href=
            "wks.html" alt="zur&uuml;ck">
          </MAP> 

          <CENTER>
            <TABLE width="640" border="2" cellpadding="0" summary=
            "Seitenformat" bgcolor="#103500">
              <TR>
                <TD><IMG src="wks.gif" alt="" width="640" height=
                "22" border="0" usemap="#wks0"> </TD>
              </TR>

              <TR>
                <TD>
                  <CENTER>
                    <IMG src="wks03.png" alt="Titelbild">
                  </CENTER>

                  <TABLE border="0" cellpadding="4" summary="Text"
                  bgcolor="#a7a7a7" align="center">
                    <TR>
                      <TD>
<PRE>
 **V1.05          ---------------------------------
                 {  Cracking the Shell - Part one  }
                  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 [*]--| NewShelll |-------------------------------------------[#][#]
 |  ,,,,,,,,,,,,,,,,,,                                             |
 | * 1.1 Kursfahrplan *                                            |
 |  `````````````````                                              |
 |    1.) - Einf&uuml;hrung                  3.) - Menusystem           |
 |        - die wichtigsten Befehle         - Skriptdateien Nr.2   |
 |                                                                 |
 |    2.) - Skriptdateien               4.) - Entr&uuml;peln der W&uuml;rgb. |
 |        - eigene Bootdisk                 - PD-Tools             |
 |        - more commands                                          |
 |   .........................                                     |
 |  /     to be continued    /   ...&Auml;nderungen vorenthalten...     |
 |  '''''''''''''''''''''''''                                      |
 | &gt;wORK:Games/AMBERSTAR                                           |
 *---------------------------------------------------------------[/]
  ______________________________
 |
 *  Vorraussetzungen: AMIGA MIT OS2.0 ODER H&Ouml;HER.
    ^^^^^^^^^^^^^^^^^ H&Ouml;CHSTWAHRSCHEINLICH FUNKTIONIEREN ALLE
                      BEISPIELE AUCH AUF 1.3, ICH KONNTE ES
                      ABER NICHT AUSPROBIEREN (KEIN 1.3 AMIGA
                      VORHANDEN                                    *
                                                                   |
                                  ----------------------------------



  dIverSE coMMEnts iN dieSeM ArtiKEL sinD NUr dIe ANTwoRT auF gE-
  wiSse St&Auml;nkerEien SeItens DeS Pc-LaGerS &Uuml;bER aKtuelle SituaTionen
                ( HEtz , PAnikmaCH ................)


                       *    *    *    *    *    *

 Die in diesem  Workshop  beschriebenen  Verfahren  und  Anleitungen
 sowie  die  gegebenen  Informationen  sind  allein  zu  Lehrzwecken
 erstellt. Ich kann  keine  Haftung  f&uuml;r  fehlerhafte  Angaben  oder
 daraus resultierende Folgen &uuml;bernehmen. Alle Beispiele sind auf 2.0
 gepr&uuml;ft. Wenn sich dennoch  Fehler  eingeschlossen  haben,  (wetten
 das)bitte benachrichtigen ! Trotz allem viel Spa&szlig; !
 Die fehlerfreien Versions gibts kostenlos bei mir +(LD+Porto)
                                  *   *
                                    +


 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 1.1                         Einf&uuml;hrung
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

 Oft h&ouml;rt man, der Amiga sei "intuitiv zu bedienen",  das  ist auch
 richtig, die Workbench ist  eine  der  komfortabelsten  graphischen
 Oberfl&auml;chen. Doch geht es um mehr als nur l&ouml;schen, umbenennen  oder
 kopieren,  mu&szlig;,  besonders   unter   Kick1.3   oder   tiefer,   ein
 leistungsf&auml;higeres  Tool  her:  die  Shell,  das  DOS,  das  CLI...


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 1.2                        Was ist was?
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

 Jeder Neuling, der einige Zeit in Amigazeitschriften gest&ouml;bert hat,
 st&ouml;&szlig;t mit Sicherheit eines Tages auf die Begriffe  CLI  und  Shell.
 Zwei  verschiedene  Begriffe  f&uuml;r  dasselbe  Programm  ??  Das  CLI
 (Command Line Interpreter -&gt; Kommandozeileninterpreter, besagt, da&szlig;
 jede  eingegebene  Zeile  sofort  ausgef&uuml;hrt  wird)  ist  noch  ein
 &Uuml;berbleibsel aus der Amiga-Steinzeit. Sp&auml;ter, ab Kick1.2, wurde das
 CLI erweitert und konnte nun z.B.   durch eine Steuerdatei   frei
 konfiguriert (Auf die individuellen W&uuml;nsche des Users  eingestellt)
 werden. Das nannte man dann Shell  (Schale).  Aus  Kompatibilit&auml;ts-
 gr&uuml;nden belie&szlig; man das CLI im System-Verzeichnis. Ab WB 2.0 gibt es


 keine Unterschiede mehr zwischen den beiden Programmen.  Ein  Klick
 auf die Shell im Hauptverzeichnis bewirkt genau dasselbe wie  einer
 auf`s  CLI.  In  beiden  F&auml;llen   wird   die   erweiterte   Version
 gestartet. Zum DOS: Das AmigaDos (DOS = Disk Operating System)  ist
 das Betriebssystem des Amiga, also nichts anderes als ein Programm,
 welches den ordnungsgem&auml;&szlig;en Ablauf der Programme &uuml;berwacht, die Ein
 und Ausgaben steuert sowie andere lebenswichtige  Dinge  still  und
 heimlich im Hintergrund erledigt, ohne dem Anwender besonders  Auf-
 zufallen. Das AmigaDos ist &uuml;brigens das, wovon b&ouml;se Zungen behaup-
 ten, es sei mit Bugs behaftet. Naja, jeder der mal mit TOS (reIer)
 oder geschweige denn MS-DOS (k?tz-w#rg) zu arbeiten gezwungen war,
 wei&szlig; was gemeint ist ..... ;-)))
 Von Windows wollen wir hier garnicht zu sprechen wagen.


 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 1.3                         How to use ?
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

 Die Shell (jawohl, bleiben wir bei EINEM Begriff) sticht dem Anwen-
 der zuerst einmal als leeres Fenster auf der  Workbench  ins  Auge.
 Hinter der Prompt, dem "&gt;" k&ouml;nnen nun Befehle eingegeben, Programme
 gestartet oder Stapeldateien (Eine Liste  von  Befehlen,  die  mehr
 oder weniger nacheinander ausgef&uuml;hrt werden) aufgerufen werden. Der
 Name vor dem " &gt; ", z.B.: "Workbench2.1:System" gibt  das  aktuelle
 Verzeichnis  an.  Verzeichnisse  dienen   dazu,   den   Datentr&auml;ger
 &uuml;bersichtlicher  zu  organisieren.  Alle  Schubladen,   (auch   die
 unsichtbaren, die sich ab Kick2.0 mit  "Show/all  Files"  &uuml;ber  die
 Workbench sichtbar machen lassen) sind Verzeichnisse. Die Zahl  vor


 dem  Verzeichnisnamen  ist  die  Proze&szlig;nummer.  Sie  gibt  an,  die
 wievielte Shell die  aktuelle  ist.  Aber  was  schreibe  ich?  Das
 ist ein Workshop, probieren wir's aus!
 [noch was: Dieser  Workshop  ist  dazu  ausgelegt,  seine  Beispiele
 sofort nachzuvollziehen. Bei einem Diskmag ?  Kein  Problem,  grinst
 der Multitasking  und  NoCover-Verw&ouml;hnte  Amiga-User  dem  DOSen-Ge-
 peinigtem entgegen:  Reset,  W&uuml;rgbench  rein,  Shell  doppelklicken,
 Nocover laden und nach Bedarf mit  der  linken  AmigaTaste  umd  M/N
 umschalten. :-) !! ]
 OK, um das mit der Proze&szlig;nummer noch  mal  zu  verinnerlichen,  gebt
 hinter dem Shell-Prompt (so hei&szlig;t das kleine, putzige  "  &gt;  ")  mal
 newshell  ein.  Danach   selbstvert&auml;ndlich   ein   Druck   auf   die
 Return-Taste. Und siehe da, ein  neues  Shell-Window  erscheint  und
 tr&auml;gt als Proze&szlig;nummer eine 2. Das Spielchen  k&ouml;nnt  Ihr  lat&uuml;rnlich
 beliebig    oft    wiederholen    (Bis    die    Task-Liste     voll
 ist oder ihr keinen Speicher mehr habt).

 Man verl&auml;st die Shell mit einem freundlichem "ENDCLI","ENDSHELL",
 einem Klick aufs [*] Close-Icon oder alternativ mit [Control] +
 [\] (neben Backspace).


 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.0                        Shell-Elemente
 /\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.1                           Befehle
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

 siehe 1.3. Befehle befinden sich im Verzeichnis C: auf  der  Platte/
 Startdiskette oder im ROM  (je  aktueller  die  Kick-Version,  desto
 mehr Befehle stehen im  ROM.  Die  meisten  ROM-Befehle  dienen  der
 schnelle Abarbeitung von  Batch,  &auml;h-  was  sag  ich  da,  nat&uuml;rlich
 Skript-Dateien. Um  festzustellen,  wieviele  Befehle  resistent  im
 ROM verankert sind, geben  sie  einfach  "resident"  ein  !  (Dieser
 Liste k&ouml;nnen sie auch Kommandos hinzuf&uuml;gen -doch dazu  sp&auml;ter).  "C"
 ist die   Abk&uuml;rzung   f&uuml;r   "commands".   Gro&szlig;   -   oder   Klein-
 schreibung spielt keine Rolex.


 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.2                           Dateien
 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

 Als D. bezeichnet man alle Datenfiles  wie  Bilder,  Texte,  Stapel-
 dateien, Programme (ach was!)  sowie  alle  anderen  n&uuml;tzlichen  We-
 nigheiten (Druckertreiber, Fonts, usw)  die  als  Icon  auf  der  WB
 oder als Name in  der  Shell  auftauchen.  Zu  den  Dateien  geh&ouml;ren
 &uuml;brigens auch die xxxxx.info - Files, die das Aussehen  eines  Icons
 bestimmen. Die auf anderen Plattformen so hei&szlig; geliebten  Extensions
 (Namenserweiterungen)   wie    .exe,.com,.bat    usw    sind    beim
 Amiga-Betriebssystem  keine  Vorschrift.  Hier  hat  man  sogenannte
 "protection-flags",  die  man  mit   "LIST"   sichtbarmachen   kann.
 Beschreibung der  FLAGS  unter  dem  Befehl  "PROTECT"  im  n&auml;chsten
 Kursteil!


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.2                        Verzeichnisse
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 siehe 1.3. Direkt nach dem Formatieren existiert nur  1  Verzeichnis
 auf der Disk: Das Wurzelverzeichnis. Es  hei&szlig;t  so,  weil  von  hier
 ausgehend alle Verzeichnisse angelegt  werden.  Ins  Wurzelverzeich-
 nis (Root) einer Disk/Platte gelangt man, wenn  man  den  NAMEN  des
 Datentr&auml;gers gefolgt von einem Doppelpunkt (z.B.: Wing1:)  oder  wer
 will kann noch ein "cd" von "ChangeDirectory" davorsetzen.  Es  geht
 nat&uuml;rlich auch mit der Laufwerksbezeichnung  (df1:,ram:).  Dem  noch
 nahezu leerem Datentr&auml;ger kann  man  nun  fast  nach  Belieben  (bis
 einem  der  Compi  ein  freundliches  "Disk  full"   entgegenhustet)
 Verzeichnisse und Unterverzeichnisse hinzuf&uuml;gen und diese  dann  mit
 Daten und Progis f&uuml;llen. Das ganze nennt  sich  dann  "Verzeichniss-
 hierarchie ".

 Ein Beispiel :
 ~~~~~~~~~~~~~~           ---------
                         /  df1: /       &lt;--  Das ist  Root
                         --------
                            /\
                           /  \
                  ---------   -----------
                  | Texte |   | Bilder  |    &lt;--- 2 Verzeichnisse
                  ---------   -----------           (directories)
                  /  |            |      \-------
        ----------   |----------  |----------   |------
        | Privat |   | NoCover |  | Fantasy |   |M&uuml;ll |
        ----------   -----------  -----------   -------
                                                   |
        So, das andere sind Unterverzeich-    ------------
        nisse (subdirectories).               |Atari-Pics|
                  * * *                       ------------
                                              - Jaguar.iff
        Und das hier sind Dateien   --&gt;       - Gem.iff
                                              - Grabstein.iff

 Wenn man nun diese Disk z.B. ins 2. Laufwerk legt und das Bild
 " Jaguar.iff " im Unterverzeichnis  " Atari-Pics " killen will,
 mu&szlig; man folgendes eingeben:

 cd df1:Bilder/M&uuml;ll/Atari-Pics

 &lt; der Compi kann nat&uuml;rlich auch eine Liste eventuelle L&ouml;schkan-
   didaten mit " dir " anzeigen. &gt;

 delete jaguar.iff

 &lt; So, ein Problem w&auml;ren wir nunmal los &gt;


  Bei manchen Rechnern, die dieses Feature nicht bieten, kann ziem-
  lich schnell Chaos entstehen, wenn man nicht f&uuml;r jeden Sch... ei-
  gene Datendisks anlegt.


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.3                            Ger&auml;te
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 (engl. Devices.) Mit " Ger&auml;te " oder " Devices " bezeichnet man
 auf dem Amiga
 1.) physische Ger&auml;te wie Laufwerke, Platten, Streamer,...
     oder Kom-Verbindungen wie die serielle oder parallele
     Schnitstelle.

 2.) Logische Devices.
     a.) alle selbstdefinierten Verweise auf verhandene Dirs
         (mit ASSIGN)


     b.) Dazu geh&ouml;ren auch "Ger&auml;te" die f&uuml;r Spezialzwecke erstellt
         wurden (&gt;speak:, pipe:, usw) sie m&uuml;ssen vor den 1. Gebrauch
         " gemountet " werden. Das geschieht mit dem CLI-Befehl
         " MOUNT Devicename ". Au&szlig;erdem werden sie durch Handler
         kontrolliert, die z.T. im Verz. L stehen.

 Man bezieht sich nicht auf die Hardware, sondern auf die Software-
 unterst&uuml;tzung f&uuml;r die Hardware.
 Mit speziellen Devices kann man fast ganz normal arbeiten als w&auml;ren
 sie normale Disks. So kann man (englische) Texte nach &gt;Speak: ko-
 pieren, usw .....
 siehe I/O.


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.4                        Skriptdateien
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 Skriptdateien sind ASCII-Texte, die mit beliebigen Texteditoren wie
 auch z.B. ED erstellt werden k&ouml;nnen. Sie dienen dazu, DOS-Befehls-
 abl&auml;ufe zu automatisieren und damit die Shell noch komfortabler
 zu machen. Neben den DOS-Befehlen k&ouml;nnen auch simple Kontrollstruk-
 turen in Skriptdateien eingef&uuml;gtwerden. Auch &uuml;bergebene Argumente
 (Aufruf: Skriptdatei Argument) k&ouml;nnen bearbeitet werden. Beim
 Booten des AMIGA's wird immer eine solche Datei aufgerufen: die
 startup-sequence. S-Dateien stehen zumeist im Verz. "S" f&uuml;r skrips.
 DOS l&auml;&szlig;t sich somit "Programmieren". Mehr zu dieser Thematik im
 n&auml;chsten Workshop-Teil.


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.4.1                          AREXX
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 Praktisch kein Teil der Shell, hat aber seit OS2.0 jeder auf seiner
 W&uuml;rgbench im System - Verzeichnis. Fr&uuml;her als Proze&szlig;-Kommunikations
 sprache konzipiert. (Dazu ein Beispiel:

 PC   : User schreibt Briefe mit Textprogramm. Ben&ouml;tigt Briefe aus
        seiner Datenbank. Also speichert er den Text ab, kehrt zur
        DOS-Ebene (ich lieeebe diesen bl&ouml;den Ausdruck) zur&uuml;ck, l&auml;d
        die Datenbank, fummelt in Menus 'rum (Alternate+Stgr+$$+Ngt
        =??????), schreibt die Addi aud einen Zettel, DOS-Ebene,
        Textprogramm, Text laden,....


 AMIGA: User schreibt Briefe mit Textprogramm. Ben&ouml;tigt Adresse aus
        seiner Datenbank. Also f&uuml;hrt er ein kleines Arrex-Progi
        aus und prompt erscheinen die Addis auf seinem Screen.)

 Zugegeben etwas vereinfacht ausgedr&uuml;ckt, doch entspricht in etwa
 der Realit&auml;t. Au&szlig;er diesen Nettigkeiten kann man nat&uuml;rlich auch
 komplette Programme (sogar mit 3D-Graphic; Ich kann jedem das
 Sonderheft Programmieren II von M&amp;T empfehlen...)


 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.5               I/O (Input/Output) -- Ein-Ausgabe
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 Die Augabe auf das Shell-Window kann nach Belieben auf geeignete
 Ger&auml;te umgeleitet werden.

 Beispiel:  DIRECTORY-AUSGABE  unter o.g. Vorrauss.
 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 dir &gt;speak:                    akt. Verz. vorlesen lassen
 dir &gt;con:5/5/100/100/Fenster/  auf eigenes Fenster ausgeben
 dir &gt;ram:Liste.txt             in Datei umleiten


 Beispiel: COPY
 ~~~~~~~~~~~~~~
 copy text &gt;ser:                text &uuml;ber Modem senden (nicht
                                getestet)
 copy text &gt;prt:                Text mit Druckertreiber drucken
 copy text &gt;par:                 =   ohne   =             =
 copy * &gt;prt:                   Schreibmaschinensimulation !
                                Ende mit [CTRL]+[\]


 """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 2.6 (das beste zuletzt)   Pattern-Matching
 """""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
 oder Einsetzen von Jokern nennt man diese  gerngenutzte  Eigenschaft
 des DOS. Sie erlaubt es dem Benutzer, z.B.  nur  Dateien  listen  zu
 lassen, die mit .info enden, alle Dateien l&ouml;schen, die  mit  PC  an-
 fangen, usw.. Wenn man es beherscht, will man es nicht  mehr  missen
 wollen, also packen wir's an!
 DOS ben&ouml;tigt jedoch Steuerzeichen, um zu erkennen, wo es "matchen"
 soll. Diese Zeichen w&auml;ren : ()[]~-|?#%  (Hoffe nichts vergessen zu
                                          haben)
 Wenn dann ein Verzeichnis oder Dateiname eines oder  mehrere  dieser
 Spezialzeichen enth&auml;lt, man diesen/dieses  aber  bestimmt  ausw&auml;hlen
 m&ouml;chte, gen&uuml;gt ein Backtick [Alt]+[&Auml;]  um  die  Wirkung  aufzuheben.


 Steuerzeichen:
 ~~~~~~~~~~~~~~

 ~ ( .. )        Umkehrung des Pattern-Terms in der Klammer
 #?              Ersetzt beliebige Strings (Zeichenfolgen)
                 Der selbe Effekt wie "*" bei CSH oder anderen
                 Plattformen.
 %               Leerstring
 [xyz]           Auswahl best. Buchstaben f&uuml;r Pattern
 (das|oder|das)  mehrere Muster zur Auswahl (alternativ)
 [a-z]           Buchstabenbereichsangabe
 # ....          0 oder mehrere WDH's von .....


 Beispiele:
 ~~~~~~~~~~

 dir ~(#?.info)  listet alle Dateien au&szlig;er die mit der Endung .info
 delete  X?Z     l&ouml;scht alle Dateien wie XCZ, XAZ, XYZ,......
 delete  ?[wer]  l&ouml;scht alle Dateien die als 2. Buchstaben ein
                  w,e oder r haben.

 die Liste lie&szlig;e sich noch belieebig fortsetzen, doch hier soll
 Schlu&szlig; sein. Probiert einfach mal die angegebenen Beispeile aus!

 ___________________________________________________________________


 Die wichtigsten DOS-Befehle auf einen Blick:
 """"""""""""""""""""""""""""""""""""""""""""

 dir,list       aktuelles Verz. ausgeben
 type           Textdatei ausgeben
 rename alt neu umbenennen
 copy von Ziel  kopieren einzelner Dateien
 delete Opfer   Datei Opfer l&ouml;schen    **   *  *****       D  O  S
                                      * *  *  *           &lt;WORKSHOP&gt;
                                     *  * *   *               II
 mehr und ausf&uuml;hrlicher im n&auml;chsten *   ** o  ***** over
                                    ~~~~~~~~~~~~~~~~~~~~

 By Stephan Kraus
    In den Forstwiesen 7          *** Spielt AMBERSTAR ***
    56745 Bell
    Dial:02652/2813

 Puhh, da wars f&uuml;rs erste! An sich wollte ih nur ein paar Zeilen
 &uuml;ber " Wie ertselle ich eine Bootdisk.." tippen. Tja, das ganze
 ist dann doch etwas ausf&uuml;hrlicher geworden....

</PRE>
                      </TD>
                    </TR>
                  </TABLE>
                </TD>
              </TR>

              <TR>
                <TD><IMG src="wks.gif" alt="" width="640" height=
                "22" border="0" usemap="#wks0"> </TD>
              </TR>
            </TABLE>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

