<HTML>
<TITLE>First Wave - Die Prophezeiung</TITLE>
<BODY bgcolor=black TEXT=white>
<CENTER><B><FONT SIZE=7>First Wave - Die Prophezeiung</FONT>
<B><FONT SIZE=5>Episodenführer</FONT><P></CENTER>
Inhalt: Cade Foster, Hauptperson der Serie, ist der zweifach gesegnete -
der Auserwählte, den Nostradamus voraussah um die Erde zu retten. Nostradamus
sagte vorraus, dass die Erde in drei schrecklichen Wellen zerstört werden
würde. Nur Cade kann die erste Welle der Außerirdischen aufhalten. Nachdem
die Aliens seine geliebte Frau getötet und ihn als den Mörder hingestellt hatten,
war Cade bereit seine Rolle als Auserwählter zu erfüllen. Zusammen mit dem
Hacker Eddie versucht der Ex-Einbrecher nun die Welt vor der fremden Macht
zu retten und die erste Welle aufzuhalten.<P>
(Die Inhaltsangaben stammen aus der VOX-Seite)<P>
<P><B>Die wichtigsten festen Darsteller:</B><P>
Sebastian Spence (Cade Foster)<BR>
Rob LaBelle (Eddie Nambulous)<BR>
Dana Brooks (Colonel Grace)<BR>
Roger C. Cross (Joshua)<BR><P>
<B>Die Episodenliste:</B><P>

<P><B>1.Staffel</B> (1998-99; 22 Episoden)</P>

<B>01.) Das Geheimnis der 19 (Subject 117)</B><BR><U>Ausstrahlung:</U> US: 09.09.1998 / D1: 14.09.1999<BR>
Regie: Brenton Spencer
W&auml;hrend der Pr&auml;sentation eines neuen Sicherheitssystems vor einem
wichtigen Kunden zieht Cade Foster pl&ouml;tzlich einen blutigen menschlichen
Kopf aus seinem Aktenkoffer. Nicht das erste Mal, da&szlig; der junge Mann von
Halluzinationen verfolgt wird. Immer wieder sieht Cade unerkl&auml;rliche Dinge
und ist geradezu besessen von der Zahl 19. Dann werden pl&ouml;tzlich Cades
Kreditkarten gesperrt, sein Konto ist abger&auml;umt worden, und er verliert
seinen Job. Sein Chef hat erfahren, da&szlig; sein bester Mann ein ehemaliger
Einbrecher ist. Als er nach Hause kommt, findet er sein Haus verw&uuml;stet
vor. Cades Leben wird aus den Angeln gehoben. Aber warum - und von wem? Cade
ist nicht der einzige. Samuel Hitchens, Detective der Chicagoer Polizei, hat
auf die gleiche Weise erlebt, wie jemand sein Leben zerst&ouml;rt. Er jagt
sich eine Kugel in den Kopf. Und in der psychiatrischen Klinik Wilsonville
sitzt der Million&auml;r Emmett Mayhew ein, der von Halluziantionen getr
eben seine Familie get&ouml;tet hat. Er bringt Cade dazu - mit Erfolg - sein
Haus nach &Uuml;berwachungskameras zu durchsuchen und behauptet, die
L&ouml;sung des R&auml;tsels in seinem Garten-Labyrinth vergraben zu haben.
Dort finden Cade und seine Frau Hannah ein Buch: Eine alte, verschollene
Handschrift des gro&szlig;en Sehers Nostradamus aus dem Jahr 1564. Eine
Passage ist markiert. Mayhew hat sich inzwischen umgebracht und eine Adresse
hinterlassen: Haven Street 19. Cade f&uuml;hlt sich zu Hause nicht mehr sicher
und zieht mit Hannah in ein Motel. Aber als er am n&auml;chsten Morgen
aufwacht, ist seine Frau tot. Als die Cops kommen, flieht Cade - in die
Haven Street 19, ein verlassenes Haus. Dort macht er eine furchtbare
Entdeckung: Er ist - wie Hitchens und Mayhew - Teil eines mysteri&ouml;sen
Experiments. Aber er kann nichts beweisen: Cade wird festgenommen, wegen
Mordes an seiner Frau verurteilt und nach Wilsonville gebracht...<P>
<B>02.) Der Auserw&auml;hlte (Crazy Eddie)</B><BR><U>Ausstrahlung:</U>
US: 16.09.1998 / D1: 21.09.1999<BR>
Cade Foster st&ouml;&szlig;t im Internet auf die "Paranoid Times", eine
Web-Site mit Artikeln &uuml;ber Au&szlig;erirdische und ein Klonlabor der
Regierung. Getrieben von dem Wunsch, endlich jemanden zu finden, der ihm
glaubt und helfen k&ouml;nnte, macht er sich auf den Weg zum Autor
"Crazy Eddie". Der ist tats&auml;chlich vollkommen paranoid und lehnt jede
Kooperation ab. Aber er wei&szlig;, da&szlig; sein Freund Dean Beweise aus
dem Klonlabor gestohlen hat. Cade bricht in Deans Wohnung ein, die v&ouml;llig
verw&uuml;stet ist. Aber wer immer vor ihm da war, hat nicht das gefunden,
was er gesucht hat: Cade entdeckt eine r&auml;tselhafte Kugel in einem
Metallbeh&auml;lter. Unterdessen erh&auml;lt Eddie Besuch von einer
attraktiven Blondine, die sich ebenfalls f&uuml;r das interessiert, was
Dean gestohlen hat. Cade kommt rechtzeitig dazwischen, und Eddie mu&szlig;
einsehen, da&szlig; die Theorie &uuml;ber die Au&szlig;erirdischen kein
Hirngespinst ist: Die geheimnisvolle Frau zeigt
uuml;bermenschliche Kr&auml;fte und spaziert, nachdem Cade ihr im Kampf
den Arm abgetrennt hat, davon, als sei nichts gewesen. Die mysteri&ouml;se
Kugel scheint eine starke Energiequelle zu enthalten. Ronald, ein Freund von
Eddie, stellt in seinem Labor fest, da&szlig; sie Wellen aussendet, die denen
eines menschlichen Hirns gleichen, nur viel st&auml;rker sind. Eddie und Cade
entdecken tats&auml;chlich ein Labor voller lebloser menschlicher K&ouml;rper,
in die mittels dieser Kugeln das Bewu&szlig;tsein der Au&szlig;erirdischen
&uuml;bertragen wird. Aber die beiden werden ebenfalls bereits beobachtet.<P>
<B>03.) Mata Hari (Mata Hari)</B><BR><U>Ausstrahlung:</U> US: 23.09.1998 / D1: 28.09.1999<BR>

Cade Foster nimmt - mit Hilfe einer Funkverbindung zu Eddie - an einer
Quantenphysik-Forschungsgruppe der Universit&auml;t in Boston den Platz eines
mathematischen Genies ein, das vor kurzem auf mysteri&ouml;se Weise ums Leben
kam. Ein weiteres Opfer eines au&szlig;erirdischen Experiments? Von Dr.
Allenson, dem Leiter des streng geheimen Projekts, erf&auml;hrt Cade, da&szlig;
der Tote mit Elliot Drake und Henrietta, genannt "Hank" an einem Satelliten-
Kommunikations-System gearbeitet hat. Cade freundet sich mit Hank an und macht
sich gemeinsam mit ihr auf die Suche nach Hinweisen. Dabei st&ouml;&szlig;t er
auf das Foto der attraktiven Lara, die er sp&auml;ter in einer Bar trifft. Die
junge Frau verf&uuml;gt &uuml;ber au&szlig;ergew&ouml;hnliche telekinetische
Kr&auml;fte und versucht, ihn zu verf&uuml;hren. Bei Cade hat sie keinen Erfolg,
aber bei Elliot: Mit ihrem gef&auml;hrlichen Spiel bringt sie ihn dazu, ihr einen
Geheimcode zu verraten. Cade und Hank finden Elliot halbtot vor.
Nur die Unterbringung in einer Druckkammer des meeresbiologischen
Instituts
kann ihn in letzter Sekunde retten. Dann &uuml;berschlagen sich die
Ereignisse: Es stellt sich heraus, da&szlig; die angeblich harmlosen
Satelliten in Wirklichkeit mit nuklearen Sprengk&ouml;pfen best&uuml;ckt
sind - und Lara ist im Besitz des Codes, mit dem sie abgefeuert werden.
Cade wird von der geheimnisvollen Colonel Grace entf&uuml;hrt, die ihm sagt,
da&szlig; Lara eine Spionin ist, die jetzt f&uuml;r die Chinesen arbeitet.
Sie stellt Cade in Aussicht, die Mordanklage gegen ihn fallenzulassen,
wenn er ihr Lara liefert. Aber Grace treibt ein falsches Spiel. Dann
t&ouml;tet Lara Dr. Allenson. Als Hank am Computer versucht, den
Selbstzerst&ouml;rungsmechanismus der Raketen zu deaktivieren, macht sie
eine unglaubliche Entdeckung: Es handelt sich nicht um Verteidigungssatelliten,
die Raketen sind auf die Erde gerichtet!<P>
<B>04.)  (Hypnotic)</B><BR><U>Ausstrahlung:</U> US: 30.09.1998 / D1: <BR><P>
<B>05.)  (Elixir)</B><BR><U>Ausstrahlung:</U> US: 07.10.1998 / D1: <BR><P>
<B>06.)  (Speaking In Tongues)</B><BR><U>Ausstrahlung:</U> US: 14.10.1998 / D1: <BR><P>
<B>07.)  (Lungfish)</B><BR><U>Ausstrahlung:</U> US: 21.10.1998 / D1: <BR><P>
<B>08.)  (Book Of Shadows)</B><BR><U>Ausstrahlung:</U> US: 28.10.1998 / D1: <BR><P>
<B>09.)  (Joshua)</B><BR><U>Ausstrahlung:</U> US: 04.11.1998 / D1: <BR><P>
<B>10.)  (Marker 262)</B><BR><U>Ausstrahlung:</U> US: 11.11.1998 / D1: <BR><P>
<B>11.)  (Motel California)</B><BR><U>Ausstrahlung:</U> US: 18.11.1998 / D1: <BR><P>
<B>12.)  (Breeding Ground)</B><BR><U>Ausstrahlung:</U> US: 25.11.1998 / D1: <BR><P>
<B>13.)  (Blue Agave)</B><BR><U>Ausstrahlung:</U> US: 02.12.1998 / D1: <BR><P>
<B>14.)  (Cul-De-Sac)</B><BR><U>Ausstrahlung:</U> US: 09.12.1998 / D1: <BR><P>
<B>15.)  (The Box)</B><BR><U>Ausstrahlung:</U> US: 16.12.1998 / D1: <BR><P>
<B>16.)  (Undesirables)</B><BR><U>Ausstrahlung:</U> US: 23.12.1998 / D1: <BR><P>
<B>17.)  (Second Wave)</B><BR><U>Ausstrahlung:</U> US: 30.12.1998 / D1: <BR><P>
<B>18.)  (Blind Witness)</B><BR><U>Ausstrahlung:</U> US: 06.01.1999 / D1: <BR><P>
<B>19.)  (Deluge)</B><BR><U>Ausstrahlung:</U> US: 13.01.1999 / D1: <BR><P>
<B>20.)  (Melody)</B><BR><U>Ausstrahlung:</U> US: 20.01.1999 / D1: <BR><P>
<B>21.)  (The Aftertime)</B><BR><U>Ausstrahlung:</U> US: 23.06.1999 / D1: <BR><P>
<B>22.)  (The Decision)</B><BR><U>Ausstrahlung:</U> US: 30.06.1999 / D1: <BR><P>
<P>
Für diesen text habe ich diverse fremde Quellen angezapft. Bedauerlicherweise
kenne ich die exakte Adressen nicht mehr. Ich bitte um Verzeihung, falls sich
die betreffenden Autoren in irgend einer Weise bestohlen fühlen.<P>
<CENTER><TABLE BORDER=0>
<TR><IMG SRC="../thesaint.png" ALT=THOWIN></TR>
<TR><font size=5><a href="mailto:Thowin@quarks.leine.de"><CENTER>T h o m a s
&nbsp&nbsp&nbspW i n d e c k e r</CENTER></fonT></A></TR>
</TABLE></CENTER><BR><CENTER><HR width=320 COLOR=GRAY NOSHADE></CENTER><BR>
</BODY></HTML>
</BODY></HTML>
