<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Installer-Tooltypes</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H3>Installer-Tooltypes</H3>von<BR><A HREF="mailto:A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>
<P>Der Start des Installers erfolgt normalerweise &uuml;ber ein Projekt-Icon,
das entweder direkt zum Script geh&ouml;rt oder mittels des SCRIPT-Tooltypes
auf ein solches zeigt, das dann ausgef&uuml;hrt wird.
</P><P>
Nach dem Start werden zun&auml;chst einige Tooltypes ausgelesen, die die
Abarbeitung des Scripts betreffen...</P>

<DL>
<DT>SCRIPT=&lt;Installer-Script&gt;</DT>
<DD>Pfad und Name des auszuf&uuml;hrenden Scripts.
    Voreinstellung ist die zum Icon geh&ouml;rende Datei.<BR><BR></DD>
<DT>APPNAME=&lt;Applikations-Name&gt;</DT>
<DD>Der Name der Applikation. Die Angabe dieses Tooltypes ist ein Mu&szlig;
    f&uuml;r ein ordentliches Arbeiten des Installers. <BR><BR></DD>
<DT>MINUSER=&lt;NOVICE|AVERAGE|EXPERT&gt;</DT>
<DD>Damit wird das minimal angebotene User-Level festgelegt. Wird hier
    beispielsweise AVERAGE angegeben, so erscheint der NOVICE-Button in
    der User-Level-Auswahl ghosted.<BR><BR>
    Die Idealf&auml;lle f&uuml;r die einzelnen Modi sind die folgenden.
    <PRE>
    NOVICE:  Der User hat keine rechte Ahnung, sollte deshalb &uuml;berhaupt
             keine Fragen gestellt bekommen, die Installation l&auml;uft
             automatisch ab.

    AVERAGE: Dem durchschnittlichen User sollten wesentliche
             Entscheidungen &uuml;berlassen werden, aber man sollte
             nicht zu sehr ins Detail gehen.

    EXPERT:  Jede nur erdenkliche Entscheidung sollte dem User
             &uuml;berlassen werden. Er sollte nahezu dieselbe Freiheit
             haben, wie bei einer Installation von Hand.
    </PRE><BR>
    Voreinstellung ist NOVICE.<BR><BR></DD>
<DT>DEFUSER=&lt;NOVICE|AVERAGE|EXPERT&gt;</DT>
<DD>Definiert den voreingestellten User-Level.
    Voreinstellung ist NOVICE. <BR><BR></DD>
<DT>NOPRINT=&lt;TRUE|FALSE&gt;</DT>
<DD>Bei Angabe von TRUE wird die Option zur Ausgabe des Protokolls &uuml;ber
    den Drucker geghostet und ist damit nicht anw&auml;hlbar.
    Voreinstellung ist FALSE.  <BR><BR></DD>
<DT>PRETEND=&lt;TRUE|FALSE&gt;</DT>
<DD>Wird hier FALSE angegeben, so ist der Test-Modus (pretend-mode)
    nicht anw&auml;hlbar. Alle Operationen des Scripts laufen dann also
    tats&auml;chlich ab. Dies ist bei Scripts mit komplexeren Operationen
    n&ouml;tig, bei denen der Pretend-Modus zu Fehlern f&uuml;hren w&uuml;rde.
    Voreinstellung ist TRUE.<BR><BR></DD>
<DT>LANGUAGE=&lt;Sprache&gt;</DT>
<DD><P>Mit Hilfe dieses Tooltypes kann man die Sprache festlegen, in der der
    Installer mit dem User kommuniziert. Dies betrifft die Startup-Screens
    und die Help-Texte. Au&szlig;erdem wird die Variable `@language' auf diesen
    Wert gesetzt.</P>
    <P>Unter OS2.1+ ist die Voreinstellung die in den Local-Prefs
    eingestellte Sprache. Sonst ist es `english'.</P><P>
    Dieser Tooltype macht eigentlich nur unter OS2.0x Sinn, um die
    Sprache festzulegen. Dies sollte aber auch dort lieber &uuml;ber eine
    Abfrage im Script getan werden, nachdem die OS-Version ermittelt
    wurde. Unter OS2.0x sind die Installer-internen Ausgaben ja sowieso
    nicht lokalisiert.</P><BR></DD>
<DT>LOGFILE=&lt;Protokolldatei&gt;</DT>
<DD>Name und Pfad der vom Installer zu erzeugenden Protokolldatei.
    Der voreingestellte Name h&auml;ngt von der Sprache ab und sie wird
    in dem Verzeichnis abgelegt, aus dem der Installer gestartet
    wurde.<BR><BR></DD>
<DT>LOG=&lt;TRUE|FALSE&gt;</DT>
<DD>Dieser Tooltype spielt nur f&uuml;r den NOVICE-Modus eine Rolle. Steht
    er auf TRUE, wird dort ein Protokoll erzeugt, bei FALSE wird dies
    unterbunden.<BR><BR>
    Voreinstellung ist TRUE.<BR><BR></DD>
</DL>

<P>Der Installer kann auch aus der Shell gestartet werden, was aber nur zum
Debugging geschehen sollte. Die Kommando-Schablone ist</P>

SCRIPT,APPNAME,MINUSER,DEFUSER,LOGFILE,LANGUAGE,NOPRETEND/S,NOLOG/S,NOPRINT/S.

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
