<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - Installer-Variablen</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN="CENTER"><H3>Vordefinierte Installer-Variablen</H3>von<BR>
<A HREF="A.Wyrwa@BBrandes.in-brb.de">Andr&#233; Wyrwa</A></DIV>

<DL>
<DT>`@abort-button'</DT>
<DD>In diese Variable kann ein alternativer Text f&uuml;r den Knopf
&quot;Installation abbrechen&quot; geschrieben werden.<BR><BR></DD>
<DT>`@app-name'</DT>
<DD>Enth&auml;lt den mit dem APPNAME-Tooltype &uuml;bergebenen Applikationsnamen.<BR><BR></DD>
<DT>`@default-dest'</DT>
<DD>Vor Installationsbeginn versucht ermittelt der Installer ein g&uuml;nstiges
Zielverzeichnis f&uuml;r die Installation zu finden. Sofern vorhanden, wird
&quot;Work:&quot; benutzt. Das ermittelte Verzeichnis wird in dieser Variablen
abgelegt. Es empfiehlt sich, sie als DEFAULT-Parameter zu &uuml;bergeben,
wenn der User nach dem Zielverzeichnis gefragt wird.<BR><BR></DD>
<DT>`@each-name'</DT>
<DD>Diese Variable wird von (FOREACH ) benutzt. Hier wird jeweils der
Dateiname abgelegt.<BR><BR></DD>
<DT>`@each-type'</DT>
<DD>Wie `@each-name', ist auch `@each-type' nur f&uuml;r (FOREACH ) von
Interesse. Sie enth&auml;lt jeweils den DOS-Typ der in `@each-name'
benannten Datei. Negative Werte repr&auml;sentieren Dateien, positive
Verzeichnisse.<BR><BR></DD>
<DT>`@error-msg'</DT>
<DD>Enth&auml;lt den Text, der vom Installer bei einem fatalen Fehler
ausgegeben worden w&auml;re, wenn dieser nicht mit Hilfe eines Trap-
Statements abgefangen worden w&auml;re. (Nur bei Fehlerauswertung von
Hand.)<BR><BR></DD>
<DT>`@execute-dir'</DT>
<DD>In diese Variable kann der Pfad eines Verzeichnisses &uuml;bergeben werden,
das der Installer vor der Ausf&uuml;hrung eines (RUN ) oder (EXECUTE )
Statements zum aktuellen Verzeichnis macht.<BR><BR></DD>
<DT>`@icon'</DT>
<DD>Enth&auml;lt Pfad und Namen des Icons, durch das der Installer aufgerufen
wurde, bzw. bei Start von der Shell Pfad und Namen des Scripts selbst.<BR><BR></DD>
<DT>`@installer-version'</DT>
<DD>Enth&auml;lt die Version des laufenden Installers als 32bit-Integer-
Variable, wie sie auch von (GETVERSION ) zur&uuml;ckgegeben wird.<BR><BR></DD>
<DT>`@ioerr'</DT>
<DD>Enth&auml;lt den Wert des zuletzt aufgetretenen DOS-Fehlers. Diese Variable
ist nur von Interesse, wenn man die Fehlerauswertung vom Script machen
l&auml;&szlig;t, nicht vom Installer.<BR><BR></DD>
<DT>`@language'</DT>
<DD>Enth&auml;lt die Sprache, in der der Installer l&auml;uft (genaueres bei den <A HREF="9803tool.htm">Tooltypes</A>).<BR><BR></DD>
<DT>`@pretend'</DT>
<DD>Steht diese Variable auf 0, so wurde die tats&auml;chliche Installation
gew&auml;hlt, steht sie auf 1, so befindet sich der Installer im Test-Modus (pretend-mode).<BR><BR></DD>
<DT>`@special-msg'</DT>
<DD>In diese Variable kann eine alternative Ausgabe f&uuml;r einen fatalen
Fehler geschrieben werden. Der Installer ersetzt dann die Originalmessage.<BR><BR></DD>
<DT>`@user-level'</DT>
<DD>Enth&auml;lt den Userlevel: 0=NOVICE, 1=AVERAGE, 2=EXPERT.<BR><BR></DD>
</DL>

<P>Au&szlig;erdem stehen folgende sprachabh&auml;ngige Help-Texte zu den entsprechenden
Funktionen zur Verf&uuml;gung:</P>
<B>
`@askchoice-help'<BR>
`@askdir-help'<BR>
`@askdisk-help'<BR>
`@askfile-help'<BR>
`@asknumber-help'<BR>
`@askoptions-help'<BR>
`@askstring-help'<BR>
`@copyfiles-help'<BR>
`@copylib-help'<BR>
`@makedir-help'<BR>
`@startup-help'</B>
<BR>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
