<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 03/98 - WBTuning-Kurs 4</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>WBTuning-Kurs /4</H1>von<BR><A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
<P>Dieser Kurs widmet sich der Erleichterung der Arbeit mit der Workbench,
der Verbesserung ihrer Funktionen und auch ihrer Versch&ouml;nerung. Nat&uuml;rlich
gibt es unz&auml;hlige Programme, Patches usw. die dazu beitragen (wollen).
Ich werde nicht auf alle eingehen k&ouml;nnen, hoffe aber, da&szlig; hier ein paar
Anregungen und Tips bei sein werden, die noch nicht allen bekannt sind.
</P><P>
Bei vielen Programmen gibt es spezielle Formen des Nutzungsrechtes. Es
kann sich z.B. um Shareware, Cardware o.&auml;. handeln. Ich gehe darauf nicht
in jedem Fall explizit ein. Eine Demoversion ist so gut wie immer frei
erh&auml;ltlich. Als Quelle fungiert das <A HREF="http://ftp.uni-paderborn.de/aminet/">AMINET</A>.
</P><P>
Verschiedene Funktionen sind auch in Multifunktions-Commodities
integriert, im Teil 6 werde ich auf ein Beispiel hierf&uuml;r eingehen.
</P>
<P><TABLE BORDER=0 ALIGN=CENTER>
<TR><TD COLSPAN=2>Der Kurs setzt sich aus folgenden Artikeln zusammen:</TD></TR>
<TR><TD><OL>
<LI> Optische WB-Verbesserung</LI>
<LI> Smarte ZusatzFX</LI>
<LI> Disk-Tuning</LI>
<LI> Hilfreiche C-Vitamine</LI>
<LI> Sonstige Helferlein</LI>
<LI> Beispiel f&uuml;r Multicommodities: MultiCX</LI>
</OL>
</TD><TD>#1<BR>#2<BR>#3<BR>#4<BR>#5<BR>#6</TD></TR></TABLE></P>
<BR>
<H3 ALIGN="CENTER">4. Hilfreiche C-Vitamine</H3>
<P>
...und ohne weitere Umst&auml;nde geht es endlich an den n&auml;chsten Kursteil.
</P><P>
Heute dreht er sich um kleine Hilfprogramme, die auf der System-Partition
unter `C:` am besten aufgehoben sind. Sie haben allesamt eine Gr&ouml;&szlig;e von
max. 10 KByte und liegen vielfach sogar weit darunter.
</P><P>
Geht es Ihnen nicht manchmal auch so? Sie haben viele verschiedene
Commodities und Patches (vielleicht sogar manche auf Grund dieses
Kurses) installiert und pl&ouml;tzlich gibt es unerkl&auml;rliche Ph&auml;nomene
auf Ihrem Rechner oder er st&uuml;rzt gar ab?
</P><P>
Jetzt will man das Problem m&ouml;glichst eingrenzen, denn sicher liegt das
wieder an einem dieser unsauber programmierten Hacks, die das Leben so
angenehm machen. ;) Aber an welchem? Und nun kann man von einer fertig
gebooteten Workbench nicht alle einzeln ein- und ausschalten, wie man
will, denn es kommen st&auml;ndig Requester, die darauf aufmerksam machen,
da&szlig; dieser und jener Patch nicht aus dem Speicher entfernt werden kann.
</P><P>
Das ist nur eine der Situationen, bei denen es notwendig werden kann,
Patches zu deaktivieren. Abhilfe schafft da &quot;<B>PatchControl</B>&quot;. Es ist
jeweils im Archiv des MultiCommodities MCP enthalten, aber seit einiger
Zeit auch separat im Aminet zu beziehen.
</P><P>
Der Trick besteht darin, da&szlig; "PatchControl" in der Startup-Sequenz vor
allen anderen Patches aufgerufen wird. Dann sind sp&auml;ter alle Patches
problemlos und sauber aus dem System entfernbar.
</P><P>
Bleiben wir bei der Startup-Sequenz.
</P><P>
Mit &quot;<B>BootSelector</B>&quot; wird in `S:` ein neues Verzeichnis "Startup's"
angelegt, in dem sich sechs verschiedene Startup-Sequenzen befinden. F&uuml;r
jede Maustastenkombination eine - es werden folglich Dreitasten-M&auml;use
unterst&uuml;tzt. Wenn man beim Booten dann die jeweilige(n) Taste(n) gedr&uuml;ckt
h&auml;lt, wird jeweils eine individuelle, den jeweiligen Bed&uuml;rfnissen
angepa&szlig;te Workbench gestartet.
</P><P>
&quot;<B>RamPatch</B>&quot;, wird ebenfalls von der Startup-Sequenz aus aufgerufen. Jetzt
wird korrekt angegeben, wieviel Speicher frei ist und die Ram-Disk nicht
mehr generell als `100% belegt` gekennzeichnet.
</P><P>
Wer gelegentlich oder auch immer Probleme mit seiner Hardware-Uhr hat,
indem ihre gepufferte Zeit &ouml;fter als gew&ouml;hnlich von bestimmten Programmen
zerschossen wird oder die Uhr auch einfach gar nicht mehr geht, f&uuml;r den
ist &quot;ClockCheck&quot; oder eines der &auml;quivalenten Programme das Richtige.
</P><P>
&quot;<B>ClockCheck</B>&quot; &uuml;berpr&uuml;ft beim Booten, ob die ausgelesene Systemzeit
ungew&ouml;hnlich stark von der des letzten Hochfahrens abweicht. Wenn
ja, &ouml;ffnet sich ein Requester, der fragt, ob die Zeit so korrekt
ist. Wenn sie es tats&auml;chlich ist und man dies best&auml;tigt, wird sie
als Vergleichsobjekt f&uuml;r die n&auml;chsten Bootvorg&auml;nge abgespeichert.
</P><P>
Sollte die Zeit nicht stimmen, wird der Uhrzeit-Einsteller der WB
ge&ouml;ffnet und man kann sie nachbessern. Nach diesem Prinzip &ouml;ffnet das
Programm also tats&auml;chlich nur seinen Requester, wenn eine gr&ouml;&szlig;ere
Differenz der aktuell geltenden zur zuletzt abgespeicherten Zeit
festgestellt werden.
</P><P>
Ursache f&uuml;r manch seltsame Alerts oder in extremen F&auml;llen sogar f&uuml;r Guru`s
kann Stackmangel gewisser Programme sein. Manche Commodities patchen die
selben Libraryroutinen und erh&ouml;hen dann teilweise die Stackspeichermenge,
die bei deren Aufruf ben&ouml;tigt wird. Abhilfe schafft hier &quot;<B>StackAttack</B>&quot;.
</P><P>
Das waren einige kleinere Programme, die, wenn ben&ouml;tigt, von der
Startup-Sequenz aufgerufen werden m&uuml;ssen.
</P><P>
Wer h&auml;ufig ohne Startup-Sequenz bootet und dann doch noch die WB aufrufen
will, kann dies mit dem Befehl &quot;<B>GoWB</B>&quot; ein klitzekleines bi&szlig;chen einfacher
und schneller, denn der gen&uuml;gt, um die WB zu laden und das CLI-Fenster zu
schlie&szlig;en. :)
</P><P>
Wenn Programme von der Shell aufgerufen werden, haben sie oft ein
einnehmendes Wesen und geben sie nicht wieder frei. Die Shells
bleiben blockiert und h&auml;ngen auf der Workbench `herum`.
</P><P>
Mit &quot;<B>BackEx</B>&quot; werden Programme als Hintergrundproze&szlig; gestartet und
dieselbe Shell steht nach dem Start des Programmes wieder zur Verf&uuml;gung.
</P><P>
&quot;<B>DTView</B>&quot; ist ein winziger Datatype-Anzeiger, der recht n&uuml;tzlich werden kann
und z.B. leicht mit DirectoryOpus oder Toolmanager verkn&uuml;pfbar ist. Er
&ouml;ffnet einen Filerequester, von dem man komfortabel die anzuzeigenden
Bilder anw&auml;hlen kann. In Sachen Anzeigequalit&auml;t, sowie Geschwindigkeit
ist man dann nat&uuml;rlich auf die jeweils installierten Datatypes angewiesen.
</P><P>
&quot;<B>UnPacker</B>&quot; ist &auml;u&szlig;erst hilfreich, denn man braucht sich nach seiner
Installation nicht mit den zahlreichen unterschiedlichen Optionen
verschiedener, teilweise selten benutzter, Packer herumschlagen, wenn
man mal eine mit ihnen gepackte Datei decrunchen will.
</P><P>
Die wichtigsten, inklusive DiskArchiver, sind hier bereits vorkonfiguriert.
Lediglich das Vorhandensein der Packer/Entpacker in `C:` oder wo immer man
es definiert, wird vorausgesetzt. Auch "UnPacker" l&auml;&szlig;t sich leicht in z.B.
DOpus einbinden.
</P><P>
Alle Benutzer von AGA werden gelegentlich damit konfrontiert, bestimmte
Features ausschalten und/oder ein altes System vorgaukeln zu m&uuml;ssen, wenn
ein &auml;lteres Programm gestartet werden soll, das ohne diese Ma&szlig;nahmen
Probleme macht.
</P><P>
Neben vielen gr&ouml;&szlig;eren Degradern mit vielen Einstellm&ouml;glichkeiten, gen&uuml;gen
h&auml;ufig auch kleine, aber feine. So z.B. &quot;<B>FixAga</B>&quot;, das einen Filerequester
aufruft, in dem man das zu startende Programm ausw&auml;hlen kann oder
&quot;<B>KillAga</B>&quot;, das von der Shell oder dem CLI aus zu starten ist.
</P><P>
Probleme treten aber oft schon auf, wenn man solcherlei Programme, Demos
oder Spiele (manche von ihnen sind sogar AGA-Versionen) von seiner
Workbench aus starten will, weil die WB nicht unter einer HighRes oder
LowRes-Aufl&ouml;sung, sprich PAL, l&auml;uft.
</P><P>
Mit dem Kommando &quot;<B>RunPAL</B>&quot; und dem Programmnamen als Argument, werden die
Programme in dem PAL-Modus gezwungen, ohne da&szlig; man gr&ouml;&szlig;ere Konfigorgien
zur tempor&auml;ren Ver&auml;nderung seines Bildschirmmodus starten mu&szlig;.
</P><P>
Vielfach unbekannt ist ein Fehler in der Hardware des Amiga 4000-030,
der nur bei ihm auftritt. Bei manchen Spielen und Demos war ein Hacken
im Timing zu beobachten, der ihre Benutzung unm&ouml;glich machte. Das
kleine &quot;<B>DTack</B>&quot; behebt den Fehler.
</P><P>
Es ist also doch einiges zusammengekommen, so da&szlig; ich die Kursplanung
dahingehend ver&auml;ndert habe, da&szlig; es sechs regul&auml;re Teile werden.
</P><P>
Bleiben Sie mir treu! In dem Fall sehen wir uns bei den &quot;Sonstigen
Helferlein&quot; wieder.<BR>
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="../cc/9803texi.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0398/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../kw/packer_2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy;`98<A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>
