<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Wildfire in Version 7.13 erschienen

»Wildfire Version 7.13 - April 1999

Seit April 1999 ist das Wildfire 7 Update erh&auml;ltlich. Es umfa&szlig;t folgende
&Auml;nderungen:

* Direkte Movieshop Unterst&uuml;tzung!!

 Das Laden und Speichern von WFMV Bildern wird ab sofort unterst&uuml;tzt.       
 Diese Bilder werden vom neuen Wildfire Operator in Movieshop von Heinrich  
 Angler (Heinrich.Angler@muenchen.de) ben&ouml;tigt.
 Somit kann man direkt in Movieshop Wildfire Effekt Scriptes verdenden!  Im
 Verzeichnis WF:Movieshop/ finden Sie alle ben&ouml;tigten Dateien,  um den
 Wildfire-Movieshop Operator zu installieren.
 (Der Movieshop Operator mu&szlig; noch von Macrosystems freigegeben werden)


 * 2. AREXX

  Die wf_movieshopmode und wf_blackframes Kommandos wurden hinzugef&uuml;gt.

 * 3. Nicht-Lineare-Effekte

  * Echtzeit Vorschau kann nun an-und ausgeschaltet werden!!!

  * Texte der Eingabe-Verbindung nun auch in Deutsch vorhanden
  * Operator Eingabe/Ausgabe Texte nun auch in Deutsch vorhanden

 * 4. Einstellungen

  Der gew&auml;hlte Bildschirm zum Abspielen im Modus `Fenster`  wird nun mit
  abgespeichert.

 * 5. Konverter

  HAM Bilder wurden nicht abgespeichert, wenn vorher eine Bildtiefe         
  gr&ouml;sser als 8 Bit gew&auml;hlt wurde - Behoben.

 * 6. Transition Maker (&Uuml;berblendungs-Generator)

  * Das RX Kommando wird nun aus SYS:REXXC/ geladen.
  * Anstelle der Dateinamen werden nun Effekt-Beschreibungen      
    angezeigt. Somit hat der Anwender einen Eindruck davon, was
    der gew&auml;hlte Effekt f&uuml;r eine &Uuml;berblendung erzeugen wird.
  * Die Transition Beispiel Animationen k&ouml;nnen sich nun auch im      
    WF:TransAnims/ Ordner befinden. Somit kann man z.B. die Beispiel      
    Transition Animationen von der CD in dieses Verzeichnis kopieren!
  * Einige neue &Uuml;berblendungen wurden hinzugef&uuml;gt. (Tile, ScaleWipe,
    Perspective)

 * 7. Dokumentation

  Im Verzeichnis  WF:Dokumentation  befindet sich nun die Deutsche Online
  Hilfe als ASCII-Text! Somit kann man sie nun ausdrucken und/oder darin
  suchen!

Das Wildfire 7 Update k&ouml;nnen Sie in zwei Versionen erhalten:

1. Wildfire 7 Update und Movieshop Operator:

Der Movieshop Operator ist Shareware und wird zum Preis von 30 DM
(Innerhalb Deutschlands) bzw. 40 DM (Rest der Welt) verkauft. Die Preise
verstehen sich bar und nur in DM. Auf der CD ist das Wildfire Update
mit enthalten! (Sie ben&ouml;tigen die urspr&uuml;ngliche Wildfire 7 Version)

Autor: Heinrich Angler
       Hartstr. 28
       82110 Germering
EMail: Heinrich.Angler@muenchen.de

Bitte kontaktieren Sie vor Ihrer Bestellung Heinrich Angler oder Andreas
K&uuml;ssner, da der Operator von Macrosystems noch freigegeben werden mu&szlig;!

Sie k&ouml;nnen den Operator mit dem Update auch &uuml;ber Oberland Computer
erhalten:

Oberland Computer
In der Schneithohl 5
61476 Kronberg
Tel. 06173-6080
email: info@oberland.com



2. Das Wildfire 7 Update ohne den Movieshop Operator:

Die Wildfire 7 Update CD k&ouml;nnen Sie ab sofort direkt unter folgender
Adresse bestellen:

Andreas K&uuml;ssner
Marrinksweg 5
48531 Nordhorn
Germany

EMail: eksec@eure.de (Wildfire-Unterst&uuml;tzung jeglicher Art)

Telefon: 05921/330420         18.00 - 20.00 Uhr Werktags

(Sie ben&ouml;tigen die urspr&uuml;ngliche Wildfire 7 Version)

Das Update kostet 10 DM innerhalb Deutschlands und 20 DM au&szlig;erhalb
Deutschlands (Kosten f&uuml;r CD und Porto). Die Preise verstehen sich
in bar und nur in DM.


&#169;1999 WK-Artworks«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
