<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

Jetzt geht's los!

Dieser Ausruf war schon des &ouml;fteren zu vernehmen, etwa als Escom 1995 die 
Amiga-Reste &uuml;bernahm oder zwei Jahre sp&auml;ter Gateway (2000) dasselbe tat. 
Doch noch nie habe ich so enthusiastische Amiga-Anwender erlebt, wie im 
Moment. Ich habe mehrere Berichte von Usern gelesen, die auf der Amiga 99 
die Gelegenheit hatten, mit Amiga-Pr&auml;sident Jim Collas zusammenzutreffen. 
Sie waren durchweg von seinen Pl&auml;nen &uuml;berzeugt und, noch entscheidender, 
auch davon, dass sie tats&auml;chlich realisiert werden. Einen solchen 
Vertrauensvorschuss f&uuml;r den neuen Mann an der Spitze habe zumindest ich in 
den letzten Jahren nicht beobachten k&ouml;nnen. Auch die 'standing ovations' 
der Messebesucher nach Jim Collas' Rede sprechen eine deutliche Sprache.

Am Rande der Messe fand ein Treffen zwischen Vertretern von amerikanischen 
Usergroups und den AMIGA-Mitarbeitern Jim Collas, Jim VonHolle, Jeff 
Schindler, Bill McEwen und Darreck Lisle statt. Dabei wurden wesentliche 
Verbesserungen, die Kommunikation zwischen AMIGA und den Anwendern, 
speziell den Usergroups, vereinbart. Ganz konkret geht es darum, dass die 
Amiga-Gemeinde von nun an &uuml;ber alle f&uuml;r sie wichtigen Dinge informiert 
wird.
Im Moment ist AMIGA mit dem Umzug nach San Diego besch&auml;ftigt, danach wird 
sich jedoch zeigen, ob das Unternehmen seine gemachten Zusagen einh&auml;lt. Ein 
Teilnehmer an dem Treffen erkl&auml;rte jedenfalls, dass er zum ersten Mal 
wirklich das Gef&uuml;hl gehabt h&auml;tte, von AMIGA ernst genommen zu werden und 
mit den Vorschl&auml;gen nicht auf taube Ohren zu sto&szlig;en.

Nach Meinung nicht Weniger ist dies die letzte Chance, um das &Uuml;berleben des 
Amiga zu gew&auml;hrleisten, und so wie es im Moment aussieht, scheinen Gateway 
und AMIGA alles daran zu setzen, um sie zu nutzen.
Wer wei&szlig;, vielleicht geht ja der Februar 1999 als der Monat in die 
Geschichte unseres Computersystems ein, in dem mit Jim Collas der Amiga-
Erretter erschien... Wir k&ouml;nnen es nur hoffen.


Ein frohes Osterfest w&uuml;nscht

euer

Carsten Schr&ouml;der
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
