<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
        
7. Kommentar zum Napalm-Test von Manni Froitzheim (von Aicke Schulz)
--------------------------------------------------------------------

Um es gleich einmal vorweg zu nehmen, dieses Preview spricht mir aus
der Seele. Hier hat ein wahrhaftiger Strategiespielefan einen wirklich
guten und unvoreingenommenen Testbericht geschrieben! Ein dickes Plus! =)

Wem dieser Einstieg von mir etwas stelzig war, in anderen Worten:
Ich bin &auml;u&szlig;erst angetan von diesem Preview, ich h&auml;tte es nicht besser
machen k&ouml;nnen, s&auml;mtliche Fragen die mich interessieren wurden
beantwortet und die Bewertung ist meiner Meinung nach wirklich fair.
  
H&auml;tte ich diesen Bericht nicht gelesen und w&uuml;rde ich nicht wissen das
es keinen direkten 2-Spieler-Modus gibt, h&auml;tte ich es mir sicher auch
l&auml;ngst gekauft. 

Ich w&uuml;rde es gerne vermeiden aber ich mu&szlig; sagen das s&auml;mtliche anderen
Testberichte, egal wo (und ich habe mind. 4 weitere gelesen), sie
werden dem Spiel nicht gerecht, sorry. 

Ich habe mir die Demo gezogen gehabt. Und das die Soundeffekte (CD-Sound
kann ich nicht beurteilen, aber ist sicher &auml;hnlich gut wie bei Foundation)
gut sind habe ich auch geh&ouml;rt und das die Grafik in hoher Aufl&ouml;sung
wirklich edel aussieht (in niedriger kaum spielbar ist) habe ich auch
bemerkt (da stimme ich allen Testern zu). Aber das die vielen Nachteile
au&szlig;er von Manni F. so gro&szlig;z&uuml;gig &uuml;bersehen wurden ist ent&auml;uschend. 

Und das soll nun "Das beste Spiel auf dem Amiga" (so oder &auml;hnlich
mehrfach gelesen) sein!? F&uuml;r mich sicher nicht.

Mir als Strategiefan machen es die Amigasoftwarefirmen nicht leicht:

- Founation dachte ich wird DER Knaller ... ich finde es unspielbar

- und nun Napalm, brilliante Grafik (wenn ich meinen Rechner mit einer
  Grafikkarte ausstatten w&uuml;rde, das w&auml;re es mir wert), guten Sound
  aber der Rest? 2-Spieler-Modus nur &uuml;ber Internet oder Netzwerk, bei
  dem Gedanken wird mir schon schlecht 1. entweder eine Telefon-
  rechnung die nicht von dieser Welt ist oder 2. hoffnunglose Suche in
  Berlin nach anderen Amigafans mir gutem Amiga, Interesse an Napalm
  UND (ach so billiger) Netzwerkkarte ... ein fast unl&ouml;sbares
  Unterfangen 
  Schade Napalm, tut mir leid ClickBOOM ... so schnell geb ich mein
  Geld nicht aus nur weil es lange Zeit einen Spielemangel gab.

Vieleicht werdet ihr denken .. OGott noch so ein Pessimist, k&ouml;nnen wir
nicht mehr h&ouml;ren, es geht doch aufw&auml;rts ...

Ganz so ist es nicht ... nicht umsonst habe ich auch die letzen 2
Jahre in meinen Amiga investiert (Tower, CD-Rom, PPCKarte ...) oder
f&uuml;r ihn programmiert (als Co-Autor an "Madhouse") nur Gegenleistung
habe ich bisher kaum erhalten ...

Wie ich mich davor zur&uuml;ckhalten kann aus dem Fenster zu springen?
Ich warte auf Spiele wie "Die Sielder 2", WipeOut, Fusion und PCx f&uuml;r
PPC, und einige weitere Spiele die angek&uuml;ndigt wurden an deren
Fertigstellung ich allerdings zweifle ...

Und einf&uuml;r allemal, f&uuml;r Spiele mit PD-Niveau gebe ich kein Geld aus,
ich habe zuviel In meine Hardware und in meinen positiven Glauben
gesteckt um mir dann Spiele wie Gunbee F99 "anzutun" ... nicht mal
wenn es Freeware w&auml;re, dem Programmierer gebe ich jedoch keine Schuld 

Die Motivation einiger Einzelpersonen
"Super-Tolle-Spiele-wie-es-sie-auch-auf-dem-PC-gibt" mit einer Hand
vonn Personen (und weniger) umsetzen zu wollen ist lobendswert aber
unrealistisch, rauft euch lieber zusammen und erstellt weniger aber
bessere Spiele, und wenn es geht nicht unbedingt den 300.
Amiga-3D-Shooter =) ...

Ohne Napalm bleibt mir also ersteinmal nichts weiter &uuml;brig die
unz&auml;hlbare Anzahl an gespielten "Siedler 1" Stunden weiter zu erh&ouml;hen
oder Dank eines Bekannten bei ihm im PC-Netzwerk "Siedler 3" zu
spielen.

Noch ein kleiner Kommentar zu Siedler3 f&uuml;r alle anderen Siedler
Fanatiker =) :

Supertolle Grafik (+), guter Sound (+) aber eine anstrengende 
Steuerung (-) und fehlende Statistiken (--), also ein Apfel mit
Maden ... aber ein trotzdem leckerer Apfel =)

*Ganz zum Schlu&szlig; noch ein TIP f&uuml;r Napalm:*
Solltet ihr auch das Problem haben, dass ihr ein Geb&auml;ude erstell habt,
es nun irgendwo hinsetzen wollt, daf&uuml;r aber dann doch einen Soldaten
oder ein Fahrzeug bewegen m&uuml;&szlig;t ... dr&uuml;ckt mal die rechte Maustaste,
bei mir wurde die Bauoption damit unterbrochen ich konnte meine 
einheit wegbewegen und danach das Gebaude hinstellen ohne es neu erstellen 
zu m&uuml;ssen!
Ich habe allerdings nur die Demoversion, m&ouml;glicherweise funktioniert
dies in der Vollversion nicht mehr!?

von und mit Aicke "SpoOky" Schulz &lt;aicke@gmx-net&gt;
        
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
