<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Update: So senkt ihr eure Telekom-Rechnung!

Die Telekommunikations-Regulierungsbeh&ouml;rde hat zum ersten Mal einen von der 
Deutsche Telekom beantragten neuen Telefontarif zum Schutz der Telekom-
Konkurrenten untersagt. Das Unternehmen hatte geplant, ab dem 1. April 
zwischen 21 und 6 Uhr Ortsgespr&auml;che f&uuml;r 3 Pfennig pro Minute anzubieten. 
Damit bleibt der alte Tarif von 12 Pfennig f&uuml;r vier Minuten zwischen 21 und 
5 Uhr in Kraft.
Dagegen ist der neue Ferngespr&auml;chstarif von 6 Pfennig pro Minute zwischen 
21 und 6 Uhr planm&auml;&szlig;ig zum 1. April eingef&uuml;hrt worden.

Weitere Meldungen:

* Mobilcom hat schon wieder zugeschlagen: Der Internet-Tarif des            
  Unternehmens (AMIGA aktuell berichtete in der letzten Ausgabe) betr&auml;gt    
  seit kurzem nicht mehr 6 Pfennig, sondern nur noch 5 Pfennig pro Minute,  
  inklusive Telefongeb&uuml;hren. Damit ist das anmeldefreie Internet-Angebot    
  von Mobilcom deutlich billiger als T-Online.

* Und noch mal Mobilcom: Angeblich will das Unternehmen seinen Konkurrenten  
  o.tel.o &uuml;bernehmen. Allerdings ist unklar, ob das Gesamtunternehmen oder  
  nur das Kabelnetz erworben werden soll.

* Arcor hat zum 1. April wieder einen Regionaltarif bis zu einer Entfernung  
  von 50 Kilometern eingef&uuml;hrt. Da noch nicht klar ist, ob auch andere      
  Unternehmen diesem Schritt folgen werden, ist der Tarif vorerst nicht in  
  der Tabelle aufgef&uuml;hrt. Hier jedoch die Preise f&uuml;r eine Gespr&auml;chsminute:  
  Werktags von 9-18 Uhr: 14 Pfennig, werktags von 6-9 Uhr und von 18-21 Uhr  
  sowie an den anderen Tagen von 6-21 Uhr: 7,5 Pfennig, t&auml;glich von 21-6    
  Uhr: 4 Pfennig.

* Die Telefongesellschaft 01051, die derzeit rund um die Uhr Ferngespr&auml;che  
  f&uuml;r 9 Pfennig pro Minute anbietet, scheint Schwierigkeiten mit der        
  Leitungsbeschaffung zu haben - oder anders gesagt: Tags&uuml;ber wird das      
  Unternehmen geradezu von Kunden &uuml;berrannt, da 01051 zu dieser Zeit mit    
  Abstand der g&uuml;nstigste Anbieter ist. Aus diesem Grund k&ouml;nnen seit kurzem  
  aus einigen Gebieten am Tage keine Gespr&auml;che mehr gef&uuml;hrt werden. Dies    
  soll nat&uuml;rlich nur eine zeitlich befristete Ma&szlig;nahme sein, sie f&uuml;hrt      
  jedoch dazu, dass 01051 erneut nicht in die Tabelle eingetragen werden    
  konnte.

An dieser hat sich jedoch dennoch erneut einiges ge&auml;ndert:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |      Wohin:  Festnetz -&gt; Festnetz      Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 9-18 Uhr       TelDaFax (01030), 15 Pfg. TelDaFax (01030), 48 Pfg.
sa/so/feiert. 9-18 Uhr  TelDaFax (01030), 9 Pfg.   Viatel (01079), 36 Pfg.²
t&auml;glich 18-19 Uhr       TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.
t&auml;glich 19-21 Uhr       Mobilcom (01019), 8 Pfg.¹   Viatel (01079), 36 Pfg.
werktags 21-22 Uhr      TelDaFax (01030), 6 Pfg.    Viatel (01079), 36 Pfg.
sa/so/feiert. 21-22 Uhr Deutsche Telekom, 6 Pfg.    Viatel (01079), 36 Pfg
t&auml;glich 22-7 Uhr        Mobilcom (01019), 4 Pfg.    Viatel (01079), 36 Pfg.
t&auml;glich 7-9 Uhr         TelDaFax (01030), 9 Pfg.    Viatel (01079), 36 Pfg.


¹: Bei Verbindungen von bis zu etwa 7 Minuten Dauer kann TelDaFax (01030)   
   mit 9 Pfg. g&uuml;nstiger sein (s.u., Geb&uuml;hrenberechnung).
²: An Feiertagen, die nicht aufs Wochenende fallen, ist TelDaFax (01030)    
   mit 48 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige 
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein  
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften      
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei                  
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr        
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte  
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen     
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom    
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,      
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass    
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im     
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen     
  l&auml;sst. Mein Favorit: http://www.teltarif.de/db/index.html


Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise 
unterschiedlich:

* TelDaFax rechnet sekundengenau ab, d.h. ihr zahlt hier  
  wirklich nur f&uuml;r die Zeit, die die Verbindung dauert.

* Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30   
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die      
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.

* Mobilcom rechnet nach Minuten ab und ber&uuml;cksichtigt keine Wochenenden und  
  Feiertage.

* Der in der Tabelle enthaltene Tarif der Deutschen Telekom wird nach
  Minuten abgerechnet.


F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
