<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverse Amiga-News</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Diverse Amiga-News
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. Neuigkeiten von Haage &amp; Partner</H2>
<P><B>Haage &amp; Partner (<A HREF="http://www.haage-partner.com" TARGET="_top">http://www.haage-partner.com</A>) informiert:</B></P>
<P><B>&raquo;AmigaOS XL: News in NEUES... Die ComputerShow</B></P>
<P>
05. Nov. 2001: Heute Abend kommt um 21.30 in der Sendung &quot;NEUES... Die
ComputerShow&quot; auf 3SAT eine Newsmeldung zu AmigaOS XL. Ein ausf&uuml;hrlicher
Beitrag soll sp&auml;ter folgen.
</P>
<P>
Der Sender NBC/GIGA bzw. der Bereich Giga Games plant ebenfalls einen
Bericht.
</P>
<P><B>AmigaOS XL: FAQs in Deutsch</B></P>
<P>
06. Nov. 2001: Eine umfangreiche Sammlung von Fragen und Antworten (FAQs)
ist nun auch in deutscher Sprache verf&uuml;gbar. Erkl&auml;rt werden u.a. das
Partitionieren einer Festplatte, das Einrichten eines Bootmanagers und die
Installation von Amithlon auf einer Festplatte.
</P>
<P><B>Update: PageStream 4.1</B></P>
<P>
09. Nov. 2001: Nach rund zwei Jahren ist es soweit - es gibt eine neue
Version von PageStream. Die auff&auml;lligste Neuerung ist dabei der
integrierte Tabelleneditor. Dieser sollte urspr&uuml;nglich als Zusatzmodul
erscheinen, doch aufgrund der hohen Nachfrage hat man sich letztlich zur
Integration in das Programmpaket entschlossen. Weitere Funktionen sind
Serienbriefe, Komprimierung bei PDF-Dateien, Textrahmen-Funktion,
Objekt-Transformationen und eine h&ouml;here Geschwindigkeit.
</P>
<P><B>StormC: Neue Dokumentation</B></P>
<P>
12. Nov. 2001: F&uuml;r StormC 4 gibt es jetzt eine komplett &uuml;berarbeitete
Anleitung im Guide-Format. Das Archiv ist 1,1 MB gro&szlig;, entpackt sind es
3,8 MB Daten. Die Anleitung liegt auch in Englischer Sprache vor.
</P>
<P><B>Messe: AMIGA 2001</B></P>
<P>
14. Nov. 2001: Auf der am Wochenende stattfinden Messe AMIGA 2001 werden
wir unsere neuesten Entwicklungen und Produkte vorstellen und anbieten.
Mit dabei sind Amithlon/AmigaXL, Freespace, ImageFX 4.5, PageStream 4.1,
StormC 4, ArtEffect Plugins Collection und vieles mehr.
</P>
<P>
Ganz aktuelle sind die neue zusammengestellten Komplettsystem aus
Athlon-Hardware und AmigaOS XL. Das Top-System kommt in einem edlen
Aluminium-Tower und hat als Herzst&uuml;ck den neuen Athlon XP 1800+. Passend
dazu bieten wir auch einen 15 Zoll LCD-Monitor an.
</P>
<P><B>AmigaOS XL: Neue FAQs und Liste</B></P>
<P>
21. Nov. 2001: Der FAQ-Bereich bietet nun 6 weitere L&ouml;sungen f&uuml;r h&auml;ufig
gestellte Fragen und Probleme.
</P>
<P>
Danke den Informationen einiger Kunden konnte die Kompatibilit&auml;ts-Liste
wieder um einige Eintr&auml;ge erweitert werden. Enthalten sind jetzt auch:
Aladdin 4D, Audio Evolution, CandyFactory, Diavolo Pro, Digibooster Pro,
Magic Menu, MAME, MaxonTOOLS, MaxonTwist, Monzoom 3D, PageStream,
Samplitude, Shapeshifter, Superbase 4, TurboCalc, TV Paint, Wordworth uvm
</P>
<P><B>Messe: AMIGA 2001</B></P>
<P>
21. Nov. 2001: Auf der diesj&auml;hrigen Amiga-Messe war das Gedr&auml;nge wieder
einmal sehr gro&szlig;, denn alle wollten AmigaOS XL einmal in Aktion sehen. An
drei Arbeitspl&auml;tzen und Sonntags zus&auml;tzlich auf einem Notebook, wurden
Amithlon und AmigaXL auf QNX pr&auml;sentiert und alle Fragen der Messeg&auml;ste
beantwortet. Die Resonanz war sehr positiv und auch unser neuer
Design-Tower kam sehr gut an. Weitere Angebote rund um AmigaOS XL folgen
in den n&auml;chsten Tagen.
</P>
<P><B>Freespace: Demoversion erh&auml;ltich</B></P>
<P>
26. Nov. 2001: Ab heute kann die Demoversion von Freespace von der Webseite
www.hyperion-entertainment.com heruntergeladen werden. Die Demoversion gibt
es als Vollversion (ca. 30 MB) und als Update auf die Demoversion, die man
auf der Amiga2001 erwerben konnte.&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
