<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Diverses5.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Abschlie&szlig;end
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Abschlie&szlig;end</H1>
<P><B>Amiga 2001: Beurteilung der PowerPC-Ank&uuml;ndigungen (von Carsten Schr&ouml;der)</B></P>
<P>
Vor kurzem fand die diesj&auml;hrige K&ouml;lner Amiga-Messe statt, auf der es sowohl
positive als auch - wie nicht anders gewohnt - negative &Uuml;berraschungen gab.
In die letztgenannte Kategorie geh&ouml;rt zweifellos das Fernbleiben s&auml;mtlicher
Angestellten von AMIGA, Inc., und auch Mitarbeiter des in Deutschland
beheimateten Entwicklers des AmigaOne, Escena, traten - zumindest
&ouml;ffentlich - nicht in Erscheinung.
</P>
<P>
Traurig, traurig, kann man dazu wohl nur sagen. So wird das Vertrauen der
Anwender in diese Unternehmen und deren Produkte mit Sicherheit nicht
steigen. Vor diesem Hintergrund ist es nicht verwunderlich, dass Hyperion
Entertainment k&uuml;rzlich angek&uuml;ndigt hat, dass das ma&szlig;geblich von der Firma
entwickelte AmigaOS 4.0 nun doch nicht nur auf dem AmigaOne, sondern auf
m&ouml;glichst vielen PowerPC-Systemen lauff&auml;hig sein soll. Der Hauptgrund f&uuml;r
diese Kurskorrektur, verglichen mit der OS4-Politik von AMIGA, Inc., ist
jedoch ein anderer: Zwar scheint es Hyperion nach wie vor f&uuml;r m&ouml;glich zu
halten, dass ein PowerPC-weiterentwickeltes AmigaOS Sinn macht - denn sonst
h&auml;tten sie die Leitung dieses Projekts wohl kaum &uuml;bernommen -, aber selbst
ihnen ist (mittlerweile?) offenbar klar, dass die Unterst&uuml;tzung von
lediglich wenigen PowerPC-Rechnersystemen - oder gar nur einem einzigen -
nicht zum Erfolg f&uuml;hren kann (erst recht nicht, wenn diese Produkte gar
nicht erscheinen...).
</P>
<P>
So ist in der Zwischenzeit auch die Unterst&uuml;tzung des von bplan
angek&uuml;ndigten PowerPC-Mainboards Pegasos als wahrscheinlich anzusehen. Von
diesem wurden auf der Messe lauff&auml;hige Prototypen pr&auml;sentiert, wobei die
Auslieferung der Endanwendersysteme nun im 1. Quartal des kommenden Jahres
starten soll.
</P>
<P>
Apropos: Formal wird das Unternehmen seine Ank&uuml;ndigung, ein PowerPC-
Komplettsystem f&uuml;r weniger als 2000 Mark auf den Markt zu bringen, erf&uuml;llen
k&ouml;nnen, sofern die in K&ouml;ln genannten Rechnerdaten Wirklichkeit werden.
Nicht verschwiegen werden sollte allerdings, dass dieses Ger&auml;t bez&uuml;glich
seiner Leistung ein reiner Witz ist - verzeiht mir bitte diese etwas
saloppe Formulierung, aber ich muss es so drastisch ausdr&uuml;cken. Ein G3 mit
350 MHz Takt kann heute so gut wie niemanden mehr hinter dem Ofen
hervorlocken, und auch die &uuml;brigen Komponenten (8-MByte-AGP-Grafikkarte,
128 MByte RAM, 20-GByte-Festplatte, etc.) hinken deutlich hinter denen
aktueller Komplett-PCs der 1500-Mark-Klasse zur&uuml;ck. Will man einen Pegasos-
Rechner mit etwa deren Leistung erwerben, d&uuml;rfte ein weiterer Tausender
f&auml;llig werden. Fazit: Der K&auml;ufer erh&auml;lt dann in etwa dieselbe Leistung,
aber zum doppelten Preis.
</P>
<P>
Noch deutlicher wird die Preis/Leistungs-Diskrepanz, wenn man PC-
Auslaufmodelle und Billig-Rechner als Vergleichsgrundlage nimmt, die in
etwa die Leistung des 2000-Mark-Pegasos-Computers besitzen. Folgendes
Komplettsystem wird beispielsweise momentan im Internet unter
<A HREF="http://shop.rammodul.de" TARGET="_top">http://shop.rammodul.de</A> angeboten:
</P>
<UL>
<LI> AMD-Duron-Prozessor 800 MHz
</LI>
<BR><LI> 128 MByte SDRAM PC 133, Infineon
</LI>
<BR><LI> 20-GByte-Festplatte
</LI>
<BR><LI> 52xCD-ROM-Laufwerk
</LI>
<BR><LI> 3D-AGP-Grafik mit max. 64 MByte shared
</LI>
<BR><LI> DirectSound-AC97-Codec onboard
</LI>
<BR><LI> 10/100Mbps-Fast-Ethernet-LAN onboard.
</LI>
<BR><LI> Internes 56K-V.90-Modem
</LI>
<BR><LI> 3,5&quot;-Diskettenlaufwerk
</LI>
<BR><LI> PS/2-Tastatur und -Maus
</LI>
<BR><LI> Anschl&uuml;sse: 2 x USB, 1 x seriell, 1 x parallel, 1 x PS/2-Maus, 1 x PS/2-
  Tastatur
</LI>
</UL>
<P>
Dieser Rechner kostet sage und schreibe 749(!) Mark. Es sei fairerweise
angemerkt, dass es sich dabei um extrem billige und daher vermutlich zum
Teil minderwertige Hardwarekomponenten handelt, aber dies rechtfertigt
meines Erachtens nicht den drastischen Preisunterschied zu einem ansonsten
ann&auml;hernd vergleichbaren PowerPC-Rechner.
</P>
<P>
Zweifellos werden an dieser Stelle einige PowerPC-Fans argumentieren, dass
sie gern bereit seien, etwas(?) mehr Geld f&uuml;r ihren Wunschrechner
auszugeben. Gegen diese Sichtweise ist absolut nichts einzuwenden, nur
sollte sich jeder dar&uuml;ber im Klaren sein, dass nur eine sehr kleine
Minderheit der Computerbenutzer so denkt. Aber auch das w&auml;re nicht so
schlimm, w&uuml;rde ein bereits etabliertes Betriebssystem zum Einsatz kommen.
Dies jedoch trifft weder auf MorphOS noch auf ein AmigaOS 4 zu, bei denen
es sich (irgendwann einmal) um PowerPC-native Betriebssysteme mit
integrierter 68k-Emulation handeln soll, wobei letztere auf den &raquo;Otto-
Normal-Anwender&laquo; kaum einen Anreiz aus&uuml;bt, da die heute verf&uuml;gbaren 68k-
Amiga-Programme in den allermeisten F&auml;llen nicht mit entsprechender
Windows-Software mithalten k&ouml;nnen. Und Amiga-Spiele-Freaks k&ouml;nnen (und
werden) auf UAE zur&uuml;ckgreifen.
</P>
<P>
Somit wird also den angesprochenen Betriebssystemprojekten auch von der
Softwareseite her so gut wie keine Sch&uuml;tzenhilfe geleistet - nicht nur
bezogen auf die Qualit&auml;t, sondern auch was die Anzahl der aktuell
verf&uuml;gbaren Programme betrifft.
</P>
<P>
Damit besteht f&uuml;r AmigaOS 4 und MorphOS nur noch eine einzige M&ouml;glichkeit,
um f&uuml;r breite Anwenderschichten eine gewisse Attraktivit&auml;t zu besitzen (und
dieses ist absolut notwendig, um mittelfristig die Softwareentwicklung
anzukurbeln): Sie m&uuml;ssen in allen anderen wesentlichen Punkten besser sein
als das aktuelle Produkt des Marktf&uuml;hrers Microsoft - und zwar nicht ein
wenig, sondern um L&auml;ngen, da (wenn &uuml;berhaupt) nur dies ein Gegengewicht zu
der oben angesprochenen Software-Problematik bilden kann. Wie realistisch
dies in einer Zeit ist, wo selbst wichtige Konkurrenten des Unternehmens
durch Windows XP unter Druck geraten, kann sich jeder von euch ausrechnen.
Kurzum: Den beiden PowerPC-Projekten fehlt schlichtweg ein Markt, oder,
ganz geh&auml;ssig ausgedr&uuml;ckt: Sie sind &uuml;berfl&uuml;ssig f&uuml;r nahezu s&auml;mtliche
Computeranwender und damit eine gro&szlig;e Ressourcenverschwendung. Kein Nutzer
eines x86-PCs wird auch nur auf die Idee kommen, sich ein &uuml;berteuertes und
kaum von Herstellern unterst&uuml;tztes PowerPC-Ger&auml;t zuzulegen, um AmigaOS 4
oder MorphOS darauf laufen zu lassen, selbst dann nicht, wenn sie mit
Windows nicht zufrieden sind. In dem Fall werden sie eher zu Linux-x86 oder
(weniger wahrscheinlich) zu einem anderen OS greifen, das auf ihrer
Hardware lauff&auml;hig ist. Mac-User fallen gleichfalls als Zielgruppe aus,
stehen diese doch treu zu ihrem Betriebssystem (wie tr&auml;ge dieses auch sein
mag...).
</P>
<P>
Fazit: Ich bin nach wie vor, vielleicht sogar mehr denn je, davon
&uuml;berzeugt, dass eine Betriebssystemneuentwicklung nur dann Marktchancen
hat, wenn sie a) auf PC-Standard-Hardware lauff&auml;hig ist und b) dem Anwender
in wesentlichen Punkten deutliche Vorteile gegen&uuml;ber dem heutigen Standard
Windows bietet. Daher halte ich es f&uuml;r ausgeschlossen, dass MorphOS oder
ein PowerPC-AmigaOS 4 einen sp&uuml;rbaren Markterfolg haben. Diese werden
(bestenfalls) in derselben Nische existieren wie heute das 68k-AmigaOS - so
traurig das auch ist.
</P>
<P>
Das soll es f&uuml;r diese Ausgabe gewesen sein. Abschlie&szlig;end m&ouml;chte ich euch im
Namen des gesamten AMIGA-aktuell-Teams nun schon einmal ein frohes
Weihnachtsfest und einen guten &Uuml;bergang ins neue Jahr w&uuml;nschen. Und denkt
daran: Diesmal m&uuml;sst ihr eure Geschenke sehr fr&uuml;h umtauschen, denn nach dem
31. Dezember bekommt ihr keine m&uuml;de Mark mehr f&uuml;r sie...
</P>
<P>
Damit bis zur ersten Ausgabe nach Einf&uuml;hrung des EURO-Bargelds,
</P>
<P>
euer
</P>
<P><B>Carsten Schr&ouml;der</B></P>
<P ALIGN="RIGHT">
<A HREF="Diverses5.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
