<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele1.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele3.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>2. News (von Oliver Tacke)</H2>
<B>--------------------------------------------------------------------------<BR>
AmigaOS<BR>
--------------------------------------------------------------------------</B><BR>
<P><B> &quot;Descent Freespace: The Great War&quot;</B></P>
<P>
 Das Spiel im Stil von &quot;Wing Commander&quot;, das erstmals f&uuml;r den PC im April
 1998 erschien und von der Presse ausgezeichnete Noten bekam (z.B. PC Gamer
 91%), wird in K&uuml;rze auch f&uuml;r den Amiga erh&auml;ltlich sein.
</P>
<P>
 Neben einem Story-Modus, bei dem es Auszeichnungen und Bef&ouml;rderungen zu
 erlangen gilt, gibt es auch eine Multi-Player-Option, die 12 Spielern das
 gemeinsame Weltraumspektakel erm&ouml;glicht.
</P>
<P>
 Eine rund 30MB umfassende Demoversion ist auf der Website des Herstellers
 Hyperion erh&auml;ltlich.
</P>
<P>
 Das Spiel setzt einen 68060-Prozessor und eine 3D-Karte voraus. Wer einen
 PowerPC-Prozessor sein eigen nennt, hat alternativ auch die M&ouml;glichkeit,
 den Software-Renderer zu nutzen (d.h. es wird dann nicht zwingend eine
 3D-Karte ben&ouml;tigt), allerdings l&auml;uft dann nicht in 16 Bit Farbtiefe
 sondern nur in 8 Bit. Die Mindestanforderung bez&uuml;glich des Speichers sind
 32MB bei Verwendung von Virtual Memory, das durch ein kleines zus&auml;tzliches
 Programm geliefert wird.
</P>
<P>
[<A HREF="http://freespace.haage-partner.de/freespace_news_d.htm" TARGET="_top">http://freespace.haage-partner.de/freespace_news_d.htm</A>]
<BR> [<A HREF="http://www.hyperion-entertainment.de/" TARGET="_top">http://www.hyperion-entertainment.de/</A>]
<BR> [<A HREF="http://www.voliton-inc.com/fs/" TARGET="_top">http://www.voliton-inc.com/fs/</A>]
</P>
<P><B> &quot;dynAMIte&quot;</B></P>
<P>
 Die Website des Netzwerk-Bomberman-Clones hat neben einem neuen Layout
 auch &quot;The Totally Non Comprehensive Map Guide&quot; spendiert bekommen. Dort
 sind Informationen &uuml;ber die Level-Gestalter und deren Werke zu finden.
 Desweiteren wurden die Styles CUNNtrast und Southpark aktualisiert, ebenso
 die polnische &Uuml;bersetzung.
</P>
<P>
 Wer dem Programmierteam als Betatester bereitstehen m&ouml;chte (d.h., man
 muss bereit sein mindestens zwei mal die Woche via IRC #amigazeux (auf dem
 Server irc.amigazeux.de) mit den Entwicklern zu plaudern und auch diverse
 Programme (Enforcer, Muforce, Muguardian) zu installieren.
</P>
<P> [<A HREF="http://amisource.de/dynamite/" TARGET="_top">http://amisource.de/dynamite/</A>]</P>
<P><B> &quot;DeepSilence: Secret Of My Soul&quot;</B></P>
<P>
 Zum dem &quot;Zelda&quot;-Stil nachempfundenen Spiel gibt es eine neue Version der
 Engine zu bestaunen. Das Demolevel ist nun mit Hasen und anderen Personen
 bev&ouml;lkert. Au&szlig;erdem beherrschen die Grafik-Routinen nun Spiegeleffekte im
 Wasser und zuschaltbares Bluring ist ebenfalls m&ouml;glich.
</P>
<P> [<A HREF="http://soms.fanhp.de" TARGET="_top">http://soms.fanhp.de</A>]</P>
<P><B> &quot;Tales Of Tamar&quot;</B></P>
<P>
 Obwohl einige Betatester bereits der Meinung sind, dass das Spiel fertig
 sei und ver&ouml;ffentlicht werden k&ouml;nnte, warten wir bisher vergeblich.
 W&auml;hrend wir uns immer noch an der wenig interaktiven Demoversion 0.29R1
 satt sehen m&uuml;ssen, d&uuml;rfen die Testwilligen bereits Version 0.38R5 nutzen
 und sich auch geh&ouml;rig gegenseitig bekriegen.
</P>
<P> [<A HREF="http://www.tamar.net" TARGET="_top">http://www.tamar.net</A>]</P>
<P><B> &quot;Payback&quot;</B></P>
<P>
 F&uuml;r das Gangster-Spiel ist eine neue Map erschienen und dreien ist ein
 Update widerfahren, zu finden auf der Apex Designs Website.
 Au&szlig;erdem hat Philipp B&ouml;decker neue Texturen bereitgestellt, die in
 Verbindung mit dem Map-Editor verwendet werden k&ouml;nnen.
</P>
<P>
[<A HREF="http://www.apex-designs.net" TARGET="_top">http://www.apex-designs.net</A>]
<BR> [<A HREF="http://www.amigalien.de/payback/hp/texturen.htm" TARGET="_top">http://www.amigalien.de/payback/hp/texturen.htm</A>]
</P>
<P><B> &quot;PuzzleBOBs&quot;</B></P>
<P>
 PuzzleBOBs ist ein Spiel in der Art von &quot;Bubble Heroes&quot; bzw. &quot;Bust A Move
 2&quot;. Man stelle sich Tetris horizontal gespiegelt vor und an Stelle von
 Kl&ouml;tzchen schie&szlig;t man Blasen nach oben, die verschwinden, wenn sich drei
 oder mehr gleichfarbige ber&uuml;hren. Das klingt hier langweiliger als es ist.
 Das Spiel ist in sehr vielen Bereichen frei konfigurierbar, so z.B. in
 Hinsicht auf die Bildschirmgr&ouml;&szlig;e und die Farbtiefe, aber auch
 Schwierigkeitsgrad, Extraleben, Extras, Aussehen der Blasen, ...
 Au&szlig;erdem sind eigene Levels erstellbar.
</P>
<P>
 Vertrieben wird das Spiel von Fun Time World, wo auch eine Demoversion
 erh&auml;ltlich ist.
</P>
<P>
[<A HREF="http://space.tin.it/computer/emacesar" TARGET="_top">http://space.tin.it/computer/emacesar</A>]
<BR> [<A HREF="http://www.funtimeworld.de" TARGET="_top">http://www.funtimeworld.de</A>]
</P>
<P><B> &quot;Project Crashsite&quot;</B></P>
<P>
 Mit dem Anspruch DAS Rollenspiel f&uuml;r den Amiga &uuml;berhaupt zu programmieren
 ging vierk&ouml;pfige Entwicklerteam ins Rennen und pr&auml;sentierte anl&auml;sslich
 der Amiga Messe in K&ouml;ln 2001 erste Bilder und Routinen des Spiels. Es
 spielt in der Zukunft und handelt von &quot;Future Security Cops&quot;, die f&uuml;r
 Recht und Ordnung sorgen sollen und eine Verschw&ouml;rung aufzudecken haben.
 Dabei hei&szlig;t es, zwischen 4 Planeten und 2 Monden umherzureisen und dort
 R&auml;tsel zu l&ouml;sen.
</P>
<P>
 Dargestellt werden Teile des Spiels in 3D, teils in isometrischer Ansicht.
 Das Spiel wird mit MPEG-Zwischenanimationen daherkommen und einen
 PowerPC-Prozessor sowie eine Grafikkarte und 32 MByte RAM voraussetzen.
</P>
<P> [<A HREF="http://www.projectcrashsite.de" TARGET="_top">http://www.projectcrashsite.de</A>]</P>
<P><B> &quot;Earth 2140 Mission Pack&quot;</B></P>
<P>
 Das hei&szlig; ersehnte AddOn zum Strategiespiel à la Command&amp;Conquer ist
 verf&uuml;gbar. Es umfasst 80 neue Einzelspieler-Missionen und 30
 Mehrspielerlevel. Hinzugekommen sind au&szlig;erdem sechs neue Einheiten, zwei
 neue Geb&auml;ude und neue Landschaften.
</P>
<P>
 Und, was wohl am wichtigsten f&uuml;r die Fans des Spiel sein d&uuml;rfte: Die
 Multiplayer-Option ist mit dem Mission Pack nun auch am Amiga
 freigeschaltet.
</P>
<P> [<A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A>]</P>
<P><B> &quot;The Feeble Files&quot;</B></P>
<P>
 Das Adventure rund um den freakigen kleinen Au&szlig;erirdischen wird nun doch
 auch f&uuml;r AmigaOS erscheinen, und das laut Aussagen des Publishers
 Epic Interactive hoffentlich noch zu Weihnachten. W&auml;re doch schade, wenn
 man sich das nicht unter den Weihnachtsbaum legen (lassen) k&ouml;nnte.
 Das Spiel soll komplett lokalisiert in Englisch und Deutsch vorliegen,
 doch m&ouml;chte es daf&uuml;r auch eine 4MB Grafikkarte, 32 MByte RAM und einen
 68060 oder PowerPC-Prozessor vorfinden.
</P>
<P> [<A HREF="http://www.epic-interactive.com" TARGET="_top">http://www.epic-interactive.com</A>]</P>
<P><B> &quot;Schlachtfeld 2&quot;</B></P>
<P>
 Leider k&ouml;nnen wir hier noch nicht verk&uuml;nden, dass das Spiel bereits
 erh&auml;ltlich ist, daf&uuml;r aber wenigstens der Soundtrack als Trostpflaster.
</P>
<P> [<A HREF="http://www.amiga-society.de/schlacht/index-echt.html" TARGET="_top">http://www.amiga-society.de/schlacht/index-echt.html</A>]</P>
<P><B> &quot;Alien Nations&quot;</B></P>
<P>
 F&uuml;r mit dem PowerPC-Prozessor ausgestattete Amigas ist das
 &quot;Die Siedler&quot;-&auml;hnliche Spiel zumindest, wenn auch Titan Computer noch
 keinen Release-Termin festgesetzt.
</P>
<P>
 Aufwarten kann es mit 3 verschiedenen Rassen, die im Gegensatz zum Urvater
 des Genres auch untereinander Handel treiben d&uuml;rfen. Damit das ganze nicht
 zu langweilig wird, unterscheiden sich die Geb&auml;ude (rund 70) und Berufe
 (rund 80) der einzelnen V&ouml;lker auch voneinander. Das sollte genug Ansporn
 sein, um die jeweils zehn Level umfassenden Kampagnen zu spielen. Und wem
 das nicht reicht, der kann ja auch noch auf den MultiPlayer-Modus
 zur&uuml;ckgreifen.
</P>
<P> [<A HREF="http://www.titancomputer.de" TARGET="_top">http://www.titancomputer.de</A>]</P>
<B>--------------------------------------------------------------------------<BR>
 MorphOS<BR>
--------------------------------------------------------------------------</B><BR>
<P><B> &quot;Alien Nation&quot;</B></P>
<P>
 Was f&uuml;r das AmigaOS gilt, das auch f&uuml;r MorphOS. Alien Nation ist daf&uuml;r
 angek&uuml;ndigt von Titan Computer.
</P>
<P>
 Aufwarten kann es mit 3 verschiedenen Rassen, die im Gegensatz zum Urvater
 des Genres auch untereinander Handel treiben d&uuml;rfen. Damit das ganze nicht
 zu langweilig wird, unterscheiden sich die Geb&auml;ude (rund 70) und Berufe
 (rund 80) der einzelnen V&ouml;lker auch voneinander. Das sollte genug Ansporn
 sein, um die jeweils zehn Level umfassenden Kampagnen zu spielen. Und wem
 das nicht reicht, der kann ja auch noch auf den MultiPlayer-Modus
 zur&uuml;ckgreifen.
</P>
<P> [<A HREF="http://www.titancomputer.de" TARGET="_top">http://www.titancomputer.de</A>]</P>
<P><B> &quot;Rage Hard&quot;</B></P>
<P>
 Rage Hard soll ein 3D-Shooter im Stil von Counterstrike werden und ein
 Video davon soll bereits in K&ouml;ln vorgef&uuml;hrt worden sein. Bei den
 Verantwortlichen (Titan Computer) konnten wir allerdings keine weiteren
 Informationen entdecken au&szlig;er einem Bildchen auf den Mac-Seiten, denn
 f&uuml;r den Apfelrechner erscheint das Spiel ebenfalls.
</P>
<P> [<A HREF="http://www.titancomputer.de" TARGET="_top">http://www.titancomputer.de</A>]</P>
<B>--------------------------------------------------------------------------<BR>
 AmigaDE<BR>
--------------------------------------------------------------------------</B><BR>
<P><B> &quot;Gobbler&quot;</B></P>
<P>
 Wer ein Nokia-Handy neueren Datums besitzt, der hat sicherlich auch schon
 einmal das Spielchen Snake ausprobiert. Eine Schlange kriecht &uuml;ber den
 Bildschirm, frisst kleine Gegenst&auml;nde und wird dadurch immer l&auml;nger. Und
 falls man mal gegen eine Mauer oder sich selbst knallt, ist das Spiel
 vorbei. Und genau das ist Gobbler, programmiert von Pulsar Interactive,
 f&uuml;r das AmigaDE, wenn auch in Farbe und h&ouml;herer Aufl&ouml;sung als auf den
 Nokia-Telefonen.
</P>
<P>
[<A HREF="http://www.pulsarinteractive.com" TARGET="_top">http://www.pulsarinteractive.com</A>]
<BR> [<A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>]
</P>
<P><B> &quot;MazeMonster&quot;</B></P>
<P>
 Motion Studios pr&auml;sentiert einen PacMan-Clone mit einem Haufen Extras,
 bietet 30 Levels und speicherbare Spielst&auml;nde. Erstanden werden kann es ab
 sofort im AmigaDE Shop.
</P>
<P>
[<A HREF="http://www.motionstudios.de" TARGET="_top">http://www.motionstudios.de</A>]
<BR> [<A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>]
</P>
<P><B> &quot;Tikino&quot;</B></P>
<P>
 Erinnert sich noch jemand an das Spiel Gem'X von Kaiko? Tikino von
 Technomages hat das gleiche Spielprinzip. Es gilt eine Fl&auml;che von
 Quadraten in die gleiche Farbe zu bringen. W&auml;hlt man ein Quadrat aus, dann
 &auml;ndert sich die Farbe der Quadrate dar&uuml;ber, darunter, links und rechts
 davon nach einem bestimmten Schema. Tikino bietet einen &Uuml;bungsmodus, mehr
 als 25 Level, eine Hilfefunktion und mehr.
</P>
<P>
[<A HREF="http://www.de.technomages.net" TARGET="_top">http://www.de.technomages.net</A>]
<BR> [<A HREF="http://de.amiga.com" TARGET="_top">http://de.amiga.com</A>]
</P>
<P><B> &quot;Jackpot&quot;</B></P>
<P>
 Auf www.amiga.org gibt es Bilder zum ersten Spiel von Edivision zu sehen.
 Das Spiel scheint eine Art Spielhallen-Simulator mit Slot Machines,
 Kartenspielen, etc. zu werden und die Bilder sehen sehr vielversprechend
 aus.
</P>
<P> [<A HREF="http://www.amiga.org/article.php?sid=836" TARGET="_top">http://www.amiga.org/article.php?sid=836</A>]</P>
<P><B> &quot;Payback&quot;</B></P>
<P>
 Moment mal, Payback f&uuml;r das AmigaDE? Ja, richtig gelesen. Wie Apex
 Designs best&auml;tigte, wird an neben einer Mac-Version auch an einer Version
 f&uuml;r das AmigaDE gearbeitet in Zusammenarbeit mit Virtual Programming.
</P>
<P>
[<A HREF="http://www.apex-designs.net" TARGET="_top">http://www.apex-designs.net</A>]
<BR> [<A HREF="http://www.vpltd.com/projects.html" TARGET="_top">http://www.vpltd.com/projects.html</A>]
</P>
<P><B> &quot;Bubble Heroes&quot; (Arcadia Developments)</B></P>
<P>
 Die interessanten Spiele f&uuml;r das AmigaDE scheinen langsam anzulaufen, denn
 &quot;Bubble Heroes&quot;, ein Spiel im Stil von &quot;Bust A Move 2&quot;, soll daf&uuml;r
 erscheinen. Das Original wurde 1999 f&uuml;r das AmigaOS ver&ouml;ffentlicht und
 verband das Spielprinzip gekonnt mit neuen Extras, Mehrspielermodi und
 niedlicher Grafik. Auf der Website des Herstellers Arcadia ist zwar kein
 Hinweis darauf zu finden, daf&uuml;r aber bei Virtual Programming, die
 mitverantwortlich f&uuml;r die Payback-Portierung sind.
</P>
<P>
[<A HREF="http://arcadia.made.net" TARGET="_top">http://arcadia.made.net</A>]
<BR> [<A HREF="http://www.vpltd.com/projects.html" TARGET="_top">http://www.vpltd.com/projects.html</A>]
</P>
<B>--------------------------------------------------------------------------<BR>
 Verschiedenes<BR>
--------------------------------------------------------------------------</B><BR>
<P><B> &quot;Space Rat&quot;</B></P>
<P>
 F&uuml;r alle Freunde des Adventure-Genres, die 3D-Grafik auf den Tod nicht
 ausstehen k&ouml;nnen, gibt es ein interessantes Projekt. Und wer die
 &quot;Space Rat&quot;-Comics aus der legend&auml;ren ASM mochte, f&uuml;r den gibt es auch
 etwas. Und alle, auf die beides zutrifft, die d&uuml;rften vor Entz&uuml;ckung in
 Ekstase geraten, denn ein es soll ein klassisches Adventure im Stil von
 Monkey Island &amp; Co. entwickelt werden, das sich um Ziggy und Konsorten
 dreht. Die Programmierer nehmen Vorschl&auml;ge zur angepeilten Plattform
 gerne an, und an die Amiga User, die jetzt sabbernd vor ihrem Monitor
 sitzen: aufwischen und den Programmierern eine E-Mail schreiben...
</P>
<P> [<A HREF="http://www.tukult.de" TARGET="_top">http://www.tukult.de</A>]</P>
<P><B>Oliver Tacke &lt;<A HREF="mailto:oliver@aakt.de">oliver@aakt.de</A>&gt; - schickt mir eure News!</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele1.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
