<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Spieleteil
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H2>3. Review: Quake-Mission Pack &raquo;Dissolution of eternity&laquo; (von J. Theiner)</H2>
<P><B>Quake at his best!</B></P>
<P>
Du bist am Leben, bei Bewu&szlig;tsein und hast alles glimpflich &uuml;berstanden.
Aber was in aller Welt ist geschehen?
Es ist Jahre her, dass du Armagon besiegt hast. Trotzdem scheint es, als sei
es gestern gewesen. Das Spalt-Portal war verschlossen und der
Schlupflocheffekt hat dich wieder zum Hauptst&uuml;tzpunkt gebracht. In der
Befehlszentrale herrscht Stille - eine Stille, die geradezu unheimlich ist!
Auf dem Boden findest du im fauligen Schlamm...einen Grunt? Oder ist es ein
Vollstrecker? Schwer zu sagen. Die sterblichen &Uuml;berreste lassen keinen
Schluss mehr zu! Der Inhalt seines Rucksacks hat sich in den rotgef&auml;rbten
Schlamm entleert. Du findest ein Buch mit dem dir wohlbekannten Symbol.
&quot;Nein...das war vorher noch nicht da!&quot; Eine herausgerissene Pergamentseite
erregt deine Aufmerksamkeit: &quot;OH MEISTER QUAKE, WIR KNIEN VOR DEM SYMBOL,
AN DIESEM TAG, IN DIESER STUNDE UND IN DIESEM MOMENT, UM DEINE HERRSCHAFT
ZU VERK&Uuml;NDEN UND DEN TAG DES UNTERGANGS ZU FEIERN.&quot;
Das ist unm&ouml;glich!
Ein Gedanke l&auml;&szlig;t dich nicht mehr los, als du das Gewehr aus dem Rucksack
ziehst und auf die Schlupflochplattform steigst:
&quot;DAS MUSS EIN ENDE HABEN!!!&quot;
</P>
<P>
Zum Gl&uuml;ck ist die Geschichte eben nicht zu Ende, sondern findet im zweiten
offiziellen Missionpack seine Fortsetzung. So wie es die Hintergrundstory
ank&uuml;ndigt, scheint Quake zur&uuml;ck zu sein. Das verspricht ja ein Spa&szlig; zu
werden. ;-)
</P>
<P>
Zur Installation ist nicht viel zu sagen. Man kopiert den Ordner Rogue in
sein Quake-Verzeichnis.
</P>
<PRE>
copy cd0:rogue spiele:quake
</PRE>
<P><B>Nun startet man seinen favorisierten Client folgenderma&szlig;en:</B></P>
<PRE>
glquakewos -game rogue
</PRE>
<P>
und schon kann es losgehen. Aber wird dieser zweite Teil den guten Eindruck
von Scourge of Armagon halten k&ouml;nnen oder ist es nur Geldmacherei?
</P>
<P>
Nun, es ist gut. Extrem gut sogar. Diesmal zeichnen Rogue f&uuml;r diesen Pack
verantwortlich und packen neue Monster, neue Level, PowerUps und neue
Waffen mit hinein. Wieder einmal musst du losziehen und Quake's Plan
vereiteln. Aber es wird kein Kinderspiel, denn die Level in Dissolution
sind schwerer als alles, was vorher da war. Das liegt an den blutr&uuml;nstigen
neuen Monstern, aber auch daran, dass es weniger Health-Packs und Munition
gibt.
</P>
<P>
Auch im Leveldesign haben Rogue mit Dissolution ein Meisterwerk
abgeliefert, waren die Level in Quake gerade f&uuml;r Deathmatches o.k., im
Single-Playermodus aber nicht gerade der &Uuml;berhammer (was sich mit Armagon
ja schon ge&auml;ndert hat). Ein paar T&uuml;ren, irgendwo ein paar versteckte
Schl&uuml;ssel oder Hebel. Nicht gerade sehr &uuml;berraschend das Ganze.
Dissoltution bietet da ein ganz anderes Kaliber. Verwinkelte Korridore,
Fallen und Hindernisse formen eine fantastische Art des Leveldesigns.
</P>
<P>
Nehmen wir beispielsweise die &quot;Elemente-Level&quot;. Du schl&auml;gst dich durch vier
verschiedene Gebiete mit den Themen &quot;Erde, Feuer, Wind und Wasser&quot;. Jedes
Gebiet hat seine ihm eigene Gefahren: Windtunnel in der &quot;Luft-Region&quot;, Lava
in den &quot;Feuer-Gebieten&quot;. Und die Level sind nicht alle in dem gleichen
mittelalterlichen Stil wie noch in Quake. Es gibt die Burg, eine H&ouml;hle und
sogar eine Pyramide. Jawohl! In Dissolution gibt es &auml;gyptische Levels mit
Mumien und Sphinxen. Auch gibt es in den Levels mehr Ausstattung als in
Quake. Kerzen, Pentagramme und B&uuml;cherregale geben dem Ganzen einen
realistischeren Touch. Aber auch hier gibt es einen Nachteil: War es bei
Armagon noch das Fehlen mehrerer Bosse (welche es hier gibt), gibt es in
Dissolution keine Secret-Areas mehr. Allerdings bieten die Level an sich
schon genug Geheimnisse.
</P>
<P>
Lange Rede, kurzer Sinn: Dissolution f&uuml;hrt Quake zu neuen H&ouml;hen - Bosse,
die man mit schierer Feuerkraft erledigen kann, gut designte Level,
atmosph&auml;rische Musik und jede Menge Action. Wenn du ein Quake-Fan bist,
sollte Dissolution auf deinem (mit Blut geschriebenen) Wunschzettel stehen.
</P>
<P>
Und zum Schluss noch: H&auml;ufig gestellte Fragen zu Quake Mission Pack 2:
</P>
<P>
<B>Frage:</B> Dissolution of Eternity ist eine echte Herausforderung! Ist dieses
Pack f&uuml;r die Hartgesottenen unter den Spiele-Freaks gedacht?
</P>
<P>
<B>Antwort:</B> Ein Erweiterungspack, das auf dem Quake-Universum aufbaut, sollte
unserer Meinung nach auch einen h&ouml;heren Grad an Schwierigkeit als das
Original-Spiel bieten.
</P>
<P>
<B>Frage:</B> Stark. Sie produzieren Computerspiele! Hei&szlig;t das, dass Sie den
ganzen Tag nur Spiele spielen?
</P>
<P>
<B>Antwort:</B> Es ist sicher eine tolle Erfahrung, so flexibel in einer echten
TEAM-Umgebung zu arbeiten! Aber nicht alles ist nur Spa&szlig; und Spiel. Dieser
Job erfordert viel harte Arbeit, Entschlossenheit und Problembewu&szlig;tsein.
Bevor ein Spiel schlie&szlig;lich im Ladenregal steht, gibt es viel zu tun, von
dem einiges auch unm&ouml;glich scheint. Trotzdem macht es uns eine Menge Spa&szlig;.
</P>
<P>
<B>Frage:</B> Von Rogue h&ouml;rt man nicht viel. Warum ist in der Spielbranche nicht
h&auml;ufiger von ihnen die Rede?
</P>
<P>
<B>Antwort:</B> Unser Motto lautet: Zeit, die wir mit dem Diskutieren von
Spielideen verbringen, k&ouml;nnen wir auch in die Entwicklung von Spielen
stecken. Wir haben eigentlich eine Menge zu sagen (wenn wir einmal anfangen,
h&ouml;ren wir nicht mehr auf). Die Entwicklung von Spielen nimmt uns jedoch
v&ouml;llig in Anspruch!
</P>
<P>
 <A HREF="img/dissolution1.jpg"><IMG SRC="thumb/dissolution1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
 <A HREF="img/dissolution2.jpg"><IMG SRC="thumb/dissolution2.jpg" WIDTH="120" HEIGHT="81" ALT="Screenshot"  BORDER="0"></A>
</P>
<P><B>J&uuml;rgen Theiner &lt;<A HREF="mailto:Juergen.Theiner@t-online.de">Juergen.Theiner@t-online.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
