<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Der Zwischenruf</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<TR>
<TD BGCOLOR="#000000">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/links.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/rechts.png" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<FONT COLOR="#FFFFFF">
Der Zwischenruf
</FONT>
</TD><TD ALIGN="RIGHT" BGCOLOR="#000000">
<A HREF="index.html" TARGET="_top"><IMG SRC="../menu/inhalt.png" BORDER="0" WIDTH="36" HEIGHT="15" ALT="Inhalt"></A>
</TD></TR>
</TABLE>
<BR>
<H1>Der Zwischenruf (von Ralf Driesner)</H1>
<P>
Stille Nacht...
</P>
<P>
Jedes Jahr verf&auml;llt die Menschheit in einigen Teilen dieses Planeten zu
dieser Jahreszeit in and&auml;chtige Stille. Nein, nicht wegen Weihnachten. Es
ist die Zeit der Sonderzahlungen. Doch schon der erste Blick auf die Lohn-
oder Gehaltsabrechnung l&auml;sst die normale N&uuml;chternheit wieder einziehen.
Staat, Rente und Gesundheit fordern ihren Tribut.
</P>
<P>
Nachdem der erste Schock verarbeitet wurde, werden Pl&auml;ne geschmiedet, wie
denn jetzt mit dem Geld verfahren werden soll. Sparen? N&ouml;, die Zinsen sind
zu niedrig. Geschenke f&uuml;r die Nichten und Neffen? Bl&ouml;dsinn. Die meisten
Kids laufen eh schon mit Handys 'rum oder sterben tausend Tode an der
Playstation. Der x-te Blumentopf f&uuml;r Muttern? Na ja, ich erinnere mich da
an eine alte Geschichte mit einem vertrockneten Kaktus in ihrer Wohnung...
</P>
<P>
Dieses Jahr g&ouml;nn' ich mir angesichts der Krise in der Halbleiterindustrie
einen neuen Rechner. Nachdem von Amiga momentan keine neuen Ger&auml;te
produziert werden, werd' ich's mal mit 'nem PC probieren. MAC ist mir zu
teuer.
</P>
<P>
Die Wahl des Betriebssystems wird da schon schwieriger. Als &uuml;berzeugter
&quot;Nicht-Windows-&uuml;berzeugter&quot; Anwender f&auml;llt eine Option weg. Linux h&ouml;rt
sich, insbesondere wegen diverser zwischenzeitlicher Hype-Phasen in
deutschen Tageszeitungen und dem Deutschen Bundestag gar nicht so &uuml;bel an.
Auch AmigaOS - &uuml;ber die k&uuml;rzlich erschienene CD-L&ouml;sung von Haage &amp; Partner -
d&uuml;rfte sich anbieten.
</P>
<P>
Trotzdem ist mir sonderbar zumute. Meine kleine beige Lady auf dem
Schreibtisch schaut ziemlich traurig drein und &auml;rgert mich in den letzten
Tagen mit wiederholtem Einfrieren des Bildschirms...Diagnose dauert an. Die
W&uuml;ste lebt wohl tats&auml;chlich...
</P>
<P>
Schon jetzt ist f&uuml;r mich aber klar, dass die kleine Freundin 8 Jahre lang
treue Dienste geleistet hat und auch weiterhin in Betrieb bleibt. Dass ich
trotz der Situation im Amiga-Markt auch heute noch einen prinzipiell
stabilen und gutm&uuml;tigen Rechner namens A1200 mein Eigen nennen kann, macht
mich stolz.
</P>
<P>
Aber die Zeit geht voran, und die Technik bleibt auch nicht stehen. Nach
all den Diskussionen in den letzten Monaten &uuml;ber die Themen Amiga, x86, PPC
etc. meine ich, zur weihnachtlichen Zeit ein vers&ouml;hnliches Wort f&uuml;r die
ganze Amiga-Gemeinde anstimmen zu k&ouml;nnen.
</P>
<P>
Amiga ist nicht tot, Amiga lebt...und das in einer auch f&uuml;r die Zukunft
faszinierenden Art und Weise. Auch im n&auml;chsten Jahr werden Amiga-User die
besseren Computer-Philosophen sein. Und wenn alles glatt geht, kann
vielleicht auch meine beige Freundin bald wieder mit einem neuen gl&uuml;henden
Herzen aufwarten.
</P>
<P>
Ein friedliches Weihnachtsfest und einen guten Rutsch ins Jahr 2002 w&uuml;nscht
euch
</P>
<P><B>Ralf Driesner &lt;<A HREF="mailto:global-dries@gmx.de">global-dries@gmx.de</A>&gt;</B></P>
<P ALIGN="RIGHT">
<A HREF="AMIGANG2.html"><IMG SRC="../menu/pfeil_links.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
 <A HREF="Diverses.html"><IMG SRC="../menu/pfeil_rechts.png" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
