<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, entrance, lions share">
<title>Lions Share: Entrance</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Lions Share: Entrance</font></h1><BR>(46:10 / Massacre)</center></P>

<p>Mangelndes Engagement kann man den Jungs von Lions Share wirklich nicht vorwerfen, legen sie mit &quot;Entrance&quot; nun den immerhin schon vierten Longplayer vor. Die &#196;nderrungen im Line-up - die einschneidenste d&#252;rfte wohl der Einstieg von S&#228;nger Tony Niva sein, der den aus famil&#228;ren Gr&#252;nden ausgestiegenen Andy Engberg ersetzt und leider auch nicht ganz an das stimmliche Niveua seines Vorg&#228;ngers herankommt  - sind zwar nicht wegzudiskutieren, aber am Stil der Mannen hat sich gottlob nichts ge&#228;ndert. Noch immer dominiert der ordentlich zimmernde Melodic Metal nordischer Pr&#228;gung. Will sagen: Malmsteen Keyboarder Mats Olausson, der auf dieser Scheibe als vor&#252;bergehender Ersatzmann zu h&#246;ren ist, h&#228;lt sich arg im Hintergrund und macht somit Platz f&#252;r amtlich wummernde Drums nebst fetten Gitarren. Songtechnisch geht`s nat&#252;rlich auch recht amtlich auf der 10 Tracks (plus das obligatorische Intro) umfassenden Scheibe rund, wobei insbesondere die Mega Hymne &quot;Believe&quot; hervorhebenswert ist. Aber auch der druckvolle Opener &quot;Shotgun Messiah&quot;, die Ballade &quot;Through The Clouds&quot; sowie der Rauskicker &quot;Free Your Mind&quot; wissen zu gefallen. Was mir aber ein wenig fehlt, sind die spektakul&#228;ren Momente respektive Songs auf dieser Scheibe, denn ausser den oben erw&#228;hnten gutklassigen Songs ragt auf dieser Platte eigentlich nichts weiter heraus. Klar, ihr Handwerk verstehen die Jungs und die eine oder andere gute Idee l&#228;sst sich auch bei den anderen Songs ausmachen, aber insgesamt fehlt &quot;Entrance&quot; einfach das gewisse Etwas und der ber&#252;hmte &quot;Aha&quot; Effekt will sich auch nach dem x-ten Durchlauf einfach nicht einstellen. Nicht das ihr mich jetzt falsch versteht: Die Songs sind sicherlich nicht schlecht, aber &#228;hnliches Material bekommt man noch von zahlreichen anderen Bands kredenzt, wobei mir die etwas &quot;softeren&quot; Narnia aus diesem Genre pers&#246;nlich eher zusagen. So k&#246;nnen Fans vom gradlienigem Melodic Metal schwedischer Pr&#228;gung hier sicherlich mal ein Ohr riskieren, aber als Pflichtkauf w&#252;rde ich &quot;Entrance&quot; mitnichten bezeichnen. Nett, aber nicht wirklich spektakul&#228;r!</P>

<p>Fazit: 6 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd3.jpg"></P>
<p><img src="kit.gif"></P>
</Center>

</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
