<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal, lost horizon, awakening the world">
<title>Lost Horizon: Awakening The World</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="#00ff00">Lost Horizon: Awakening The World</font></h1><BR>  (46:35 / Music For Nations)</center></P>

<p>Was hatten denn die Herrschaften von Lost Horizon intus, als sie sich die Pseudonyme ausgedacht haben? Cosmic Antagonist, Transcendental Protagonist, Preternatural Transmogrifier (absolutes Highlight) und Etherial Mangnanimus lassen auf einen Alkoholpegel jenseits der 3.0 Promille schlie&#223;en. Gl&#252;cklicherweise l&#228;sst sich von diesen d&#228;mlichen Pseudonymen kein R&#252;ckschluss auf die Mukke des schwedischen Quartettets schlie&#223;en, denn die zimmert ziemlich heavy und fett rein. Okay, auch Lost Horizon erfinden den melodischen Power Metal nicht neu und erinnern phasenweise an alte Blind Guardian, Running Wild oder auch alte Helloween, pr&#228;sentieren aber insgesamt eine recht eigenwillige Mischung, die man so schnell nicht vergisst. Vergessen darf man in dieser Aufz&#228;hlung auch nicht die Herren von HammerFall, denn das Lost Horizon zu einem gewissen Grade nach ihren Landsm&#228;nnern klingen, hat ausnahmsweise auch mal eine sinnige Begr&#252;ndung: Lost Horizon sind die Nachfolgecombo von Highlander, bei denen die Herrschaften Joacim Cans, Stefan Elmgren und Patrick R&#228;fling vor ihrem grandiosen Erfolg mit HammerFall gezockt haben. Also durchaus mal eine sinnvolle Ausrede, den Einfluss von HammerFall zu
erkl&#228;ren. Aber Lost Horizon leben nicht nur davon, irgendwann mal etwas mit einigen HammerFall Members zu tun gehabt zu haben, sondern kochen ihre eigene Suppe: Mit dem wirklich schnellen treibenden Opener &quot;Heart Of Storm&quot;, der phasenweise Erinerrungen an alte Blind Guardian wach werden l&#228;sst, der Midtemponummer &quot;Perfect Warrior&quot; sowie dem abschlie&#223;endem &#252;berlangem Epos &quot;The Kingdom Of My Will&quot; hat man gleich mehrere True Metal Granaten allererster G&#252;te am Start, die - genau wie das restliche Material - frisch, heavy und unbek&#252;mmert wirken und die glattgeb&#252;gelten True Metal Geschosse anderer Kapellen im Vergleich wie 08 / 15 Pop Nummern aussehen lassen. Ich bin mir ziemlich sicher, da&#223; sich Lost Horizon mit diesem Debutalbum viele Fans erspielen k&#246;nnen und sollte die Band in der Lage sein, den frischen Spirit auch auf dem n&#228;chsten Langeisen einzufangen, k&#246;nnte aus Lost Horizon eine ganz gro&#223;e Band werden. Die Anlagen dazu sind auf jeden Fall vorhanden (nur sollte man sich dann bitte andere Pseuodonyme besorgen).</P> 

<p>Fazit: 9 von 10 Punkten</P>
<center>
<p><img src="kit.gif"></P>
<p><img src="cd4.jpg"></P>
<p><img src="kit.gif"></P>
</Center>


</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
