<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. AMIGA sucht Entwickler f&uuml;r PDA-Anwendungen

Die folgende &Uuml;bersetzung einer Mail von Gary Peake wurde vor Kurzem von 
unserem Partner amiga-news.de ver&ouml;ffentlicht: 

»Hallo, 

vor einigen Wochen versprach ich Ihnen einige sehr begeisternde 
Ank&uuml;ndigungen. Als erstes m&ouml;chte ich Matt Fontenot als Amigas 
Produktmanager vorstellen. 
Matt ist von Anfang an bei uns und falls Sie noch nichts von ihm geh&ouml;rt 
haben: Er hat eng mit vielen unserer Partner zusammengearbeitet und war 
sehr besch&auml;ftigt, die vielen neuen Produkte zu entwickeln, die Sie nun bald 
sehen werden.

Nun zur Ank&uuml;ndigung:

Es gibt ein riesiges Potential f&uuml;r die Verteilung Ihrer Anwendungen, Spiele 
und andere Inhalte f&uuml;r einen der weltweit gr&ouml;&szlig;ten Hersteller von PDA's. Das 
Projekt ist auf mehr als 7 Millionen Ger&auml;te ausgelegt, die bis Ende 2001 
verkauft werden sollen - derzeit befinden sich bereits einige Millionen 
Ger&auml;te im Markt. Es wird spezifische Bedingungen f&uuml;r Aussehen, Art der 
Anwendungen, Vertriebsrechte und &Uuml;berpr&uuml;fung des Inhaltes geben. Matt wird 
hierzu in der n&auml;chsten Zeit weitere Details bekannt geben. 
Wenn Sie an der Entwicklung von Applikationen f&uuml;r PDA's und Spiele f&uuml;r 
einen bekannten Hersteller, der Amiga Inc. als Lieferant f&uuml;r Inhalte nutzen 
will, interessiert sind, kontaktieren Sie Matt so schnell als m&ouml;glich. 
Dieses ist ein sehr ernstgemeintes Projekt f&uuml;r alle diejenigen, die daran 
interessiert sind, Inhalte zur Verf&uuml;gung zu stellen. Wir werden daf&uuml;r eine 
Mailingliste er&ouml;ffnen. Die Einzelheiten werden in den n&auml;chsten Tagen 
bekannt gegeben. 
Dieses Projekt richtet sich an Lieferanten von "Open Source"- und 
kommerziellen Inhalten. Deshalb: Egal, was Ihre Wahl der Entwicklung ist, 
Sie sind herzlich zum Mitmachen eingeladen. F&uuml;r weitere Informationen 
ben&ouml;tigen sie dennoch eine unterzeichnete Geheimhaltungsvereinbarung (NDA) 
mit Amiga Inc.. Sie k&ouml;nnen einen NDA von www.amigadev.net, im "Legal"-Men&uuml; 
auf der rechten Seite, herunterladen. 
Einfach nur ausf&uuml;llen und zu meinen H&auml;nden an +01 425 396 5671 faxen. 
Anschlie&szlig;end eine Email an projects@amiga.com mit dem Betreff "I am 
interested." schicken. Sie k&ouml;nnen mich auch unter gary@amiga.com oder Matt 
unter matt@amiga.com kontaktieren. 

Mit freundlichen Gr&uuml;&szlig;en,
Gary Peake 
Matt Fontenot 

Nachtrag:

Amiga Inc. bittet darum, dass Sie die oben erw&auml;hnte Email nicht an 
projects@amiga.com schicken sondern stattdessen Ihre Email-Adresse am Ende 
dieser Original-Meldung eintragen und mit dem Button "I am interested!" 
abschicken.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
