<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:

틻miga Arena News
(04.01.2001)

Amiga Arena - Risiko Vollversion!
Die Amiga Arena pr&auml;sentiert in zusammenarbeit mit Frank Abbing 
(UAC Design)  die Vollversion "Risiko" in der Final Version 1.7!
(Nicht im Aminet erh&auml;ltlich!)
Risiko Amiga richtet sich hierbei nach den g&auml;ngigen
Spielregeln des originalen Brettspiels von Parker Bros.
Risiko enth&auml;lt aber auch Sonderregeln wie
Aufst&auml;nde,Erdbeben,Blitzkrieg!
Deutsch und Englischsprachige Version!
F&uuml;r alle Risiko Freunde liegt die Beste nicht
Kommerzielle Amiga Version zum Download bereit!


틻miga Arena News
(13.01.2001)

Amiga Arena - Sonderpreis Aktion!
In Zusammenarbeit mit der Amiga Future erm&ouml;glicht die Amiga Arena
eine Sonderpr&auml;mie bei Abschluss eines Abos der Amiga Future!
Neben der normalen Pr&auml;mie erh&auml;lt jeder der &uuml;ber die
Amiga Arena sein Abo abschliest die Amiga Arena CD
Rom Edition!
Diese Aktion ist nur bis zum 31.01.2001 g&uuml;ltig!
Weitere Infos in der Amiga Arena!

Amiga Arena - Interview Aktion!
"Rags" das Action Spiel von Shades Production sorgte 
nicht ohne Grund f&uuml;r eine kleine Sensation im Aminet!
F&uuml;r alle die "Beach Head II" vom C64 noch in Erinnerung 
haben sei hier gesagt "Download" Pflicht!
Aber lest selbst im Bereich "Aktionen" das Preview
zu "Rags" und das Interview mit Shades Production!

Amiga Arena - Sonderpreis Aktion!
Die Sonderpreisaktion mit SViewIV ist nur noch
bis zum 15.01.2001 Online!
Die Programme PhotoAlbum/Cybershow,GeoWorld und VPrefs
sind nur noch bis zum 31.01.2001 zum Sonderpreis erh&auml;ltlich!


틻miga Arena News
(20.01.2001)

Amiga Arena - Vollversion!
Weltend&auml;mmerung, ein weiteres Strategiespiel von UAC Design ist Online!
Im Spiel Weltend&auml;mmerung steigt der Spieler in die
Rolle des Robert Ungar.
Hier mu&szlig; er versuchen, die Kreaturen des Dr.Coypu
zu besiegen.
Um diese Aufgabe bew&auml;ltigen zu k&ouml;nnen, gelingt es
ihm ebenfalls eine Armee von Mutanten unter seine
Kontrolle zu bekommen....


틻miga Arena News
(23.01.2001)

Amiga Arena - UAC Design Bonus!
"The Hunting Games" von Frank Abbing liegen zum Download bereit!
Plakat schiessen (Morhunspielprinzip!)
Innerhalb einer Minute soviele Schilder wie
m&ouml;glich abschiessen, die J&auml;ger aber nat&uuml;rlich nicht!
Scheiben drehen
Gegen die Scheiben schiessen, bis alle Scheiben in
dieselbe Richtung schauen.
Die angeschossene Scheibe dreht sich immer eine
Vierteldrehung mehr wie die anderen. Wer schafft
die beste Zeit?
(Hierbei handelt es sich um kleine Pausenf&uuml;llerSpiele!)

Amiga Arena - UAC Design Updates!
Einige Updates f&uuml;r die Spiele die mir Frank Abbing von UAC Design zur
verf&uuml;gung gestellt hat sind Online.
Das Quizspiel Awaking AGA/ECS liegt jetzt in der
ausf&uuml;rbaren Version vor!
(Direkt von HD spielbar,kein .adf Format mehr!)
Risiko Version 1.7 liegt jetz in der Freeware
Version vor.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
