<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. »AmigaOS 3.9 - ein ganz pers&ouml;nliches Fazit« (von Achim Stegemann)

Achim Stegemann, Autor der bekannten Astronomiesoftware Digital Almanac, 
hat seine pers&ouml;nliche Meinung zum neuen Betriebssystemupdate AmigaOS 3.9 in 
einem sehr umfangreichen Artikel niedergeschrieben:

»Vorwort

In diesem Artikel soll nicht zum tausendsten Mal ein Review &uuml;ber das neue 
AmigaOS 3.9 geschrieben werden..nein. Dieser Artikel beleuchtet die neueste 
Errungenschaft aus dem Hause Haage&Partner (H&P) und Amiga Inc. mal unter 
einem v&ouml;lig anderen Licht.
In den offiziellen Medien, wie Print-Magazinen, wurde OS 3.9 bereits im 
Oktober letzten Jahres gelobt und gefeiert, seine Features bereits damals 
und erst recht nach seinem Verkaufsstart auf der WoA in K&ouml;ln Anfang 
Dezember in h&ouml;chsten Lobges&auml;ngen der Amiga-Gemeinde vorgetragen. Wo waren 
die kritischen Stimmen? Wo waren die Artikel und Meinungen, die das OS 3.9 
einmal kritisch hinterfragten? Es gab schlicht keine. Lediglich in einigen 
Mailing-Listen gab es einige wenige Meinungen, die kritisch mit dem OS 3.9 
umgingen, was nat&uuml;rlich zu heftigen Diskussionen in diesen Mailing-Listen 
gef&uuml;hrt hat.
Ich selbst habe mich dieser Diskussion angeschlossen und m&ouml;chte einmal das 
OS 3.9 nun unter einem anderen Blickwinkel pr&auml;sentieren. Weg von den ewigen 
"Ja-und-Amen"-Sagern und den "Friede-Freude-Eierkuchen"-Artikeln der 
letzten Monate.

Der erste Eindruck

&Auml;u&szlig;erlichkeiten sind unwichtig, nur der Inhalt z&auml;hlt. Also habe ich gleich 
die CD aus der Folie ausgepackt und die Silberscheibe in das Laufwerk 
gelegt. Im ersten Moment positiv &Uuml;berrascht hat mich die Datenmenge von 
knapp 470 MB, gegen&uuml;ber den bescheidenen knapp 100 MB des OS3.5-Vorg&auml;ngers. 
Aber Quantit&auml;t ist bekanntlich nicht automatisch gleich Qualit&auml;t.
Immerhin, neben den schon aus OS 3.5 bekannten Icons schl&auml;gt mir sogar ein 
Audio-Track entgegen. Ein Blick auf das Cover verr&auml;t, dass auch die Amiga-
Songgruppe Annex sich hier verewigt hat.

Installation

Ja sowas!! Das Update auf OS 3.9 auf meinem Amiga (OS 3.5 war vorher schon 
installiert) verlief absolut ohne Probleme! Das grenzt ja schon fast an ein 
Wunder, wenn man bedenkt, welche Schwierigkeiten vielen von uns die 
Installation des OS 3.5 bereitete.
Auch das Anfertigen der Notfall-Diskette verlief diesmal ohne Probleme, im 
Gegensatz zur OS3.5-Notfalldiskette wurde sie diesmal ihrem Namen gerecht. 
Offenbar hat H&P zumindest in diesem Bereich aus den Fehlern des letzten 
Jahres etwas gelernt.
Abschlie&szlig;end zu diesem Thema sei erw&auml;hnt, dass auch die Installation aller 
anderen Komponenten ohne Probleme verlief.

Im Westen nichts Neues

Als im Oktober das neue OS 3.9 angek&uuml;ndigt wurde, war schnell klar, dass 
mit diesem neuen Update keine Revolution f&uuml;r den Classic-Amiga stattfinden 
wird, ja noch nicht mal ein kleineres Beben. Unter dem Bewusstsein dieser 
Tatsache waren wir alle gespannt, was uns H&P denn diesmal kredenzen w&uuml;rde. 
Bei OS 3.5 waren die Fronten klar gesteckt: WarpOS als neue Standard-PPC-
Schnittstelle, Aufhebung der 4GB-Schallmauer bei Festplatten, neues 
NewIcon-kompatibles Iconsystem und eine neue Gadgetklassen-GUI namens 
Reaction f&uuml;r System-Programme. Bei OS 3.9 kristallisierte sich schnell
heraus, dass diese genannten Features mit Sicherheit nicht &uuml;berboten werden 
konnten. Bescheidenheit ist eben doch eine Tugend, oder doch nicht?

Das von allen mit den meisten Erwartungen gespickte Programm der OS3.9-
Scheibe ist ohne Frage die TCP/IP-Software Genesis, welche uns Amiganer 
(endlich!) einen einfachen und vor allem uneingeschr&auml;nkten Zugang zum 
Internet erm&ouml;glichen soll.
Doch schon beim ersten Start(versuch!) von Genesis zeigte sich bereits der 
erste l&auml;ngere Schatten im Lichte des Neuen. Der Voreinsteller zu Genesis 
war nicht zu starten. Ein kurzer Blick in SnoopDos verriet, dass H&P 
schlichtweg vergessen hat, eine entsprechende externe MUI-Klasse mit auf 
die Scheibe zu brennen. Wie peinlich!! Immerhin, nach zehn Minuten war die 
fehlende Datei aus dem Internet geladen und Genesis lief ohne Probleme. Wie 
sch&ouml;n, doch was machen diejenigen unter uns, die nicht online sind, und mit 
Genesis ihren Einstieg in die Welt des Internets bestreiten m&ouml;chten? 
Pustekuchen. Es ist wohl nicht anzunehmen, dass H&P auf Anfrage Disketten 
an die betreffenden Benutzer mit der fehlenden Datei schickt. Wohl eher 
einen telefonischen Hinweis darauf, dass das File im Internet zur Verf&uuml;gung 
steht. Kommt Ihnen das bekannt vor? Erinnern wir uns an den "Hauptmann von 
K&ouml;penick". &Uuml;bertragen hei&szlig;t das hier: Ohne Internet kein lauff&auml;higes 
Genesis, aber ohne Genesis auch kein Internet. Tja, ihr Lieben von H&P, das 
war wohl nichts! Also doch erst mal Miami von OS 3.5 (ist ja zum Gl&uuml;ck auch 
auf der OS 3.9-CD!) installieren, usw. usw. usw... den Rest kennen wir ja.

Als ich das OS 3.9 so weiter studierte, bekam ich so ein seltsames 
Erschaudern. Nein, nicht der Kinotrailer von "Jurassic Park 3" im Video-
Ordner der CD brachte mich zum Gruseln, sondern so ein "Deja vu"-Gef&uuml;hl sa&szlig; 
mir im Nacken. Alles schon mal dagewesen? Und in der Tat, je mehr ich mir 
das OS 3.9 ansah, um so mehr &uuml;berkam mich das Gef&uuml;hl, eine falsch 
etikettierte Mettwurst mit Rindfleisch gekauft zu haben. Habe ich etwa aus 
Versehen eine Aminet-CD gekauft?
AMPlifier, MooVid, DefIcons, RAWBInfo usw., das alles hatte ich doch schon. 
Wo sind sie denn, die neuen Features? Sind Genesis, AmiDock und die Iomega-
Tools etwa alles? Auf jeden Fall nichts Neues. Wenn man von den System-
Neuerungen und Genesis mal absieht, entpuppte sich die CD mehr und mehr als 
buntes Sammelsurium von Aminet-Programmen! Die Entt&auml;uschung meinerseits war 
gro&szlig;. Nichts gegen die Qualit&auml;t der genannten Programme, nein! Aber warum 
mussten es ausgerechnet diese Programme sein? Ist AMPlifier so viel besser 
als AmigaAMP? Ist MooVid soviel besser als AMP oder CyberQT/CyberAVI und - 
wie (!) nur eine 68k-Version? Wo ist der MPEG-Player? Eine neue Uhr! Wie 
sch&ouml;n..aber brauche ich &uuml;berhaupt eine Uhr auf der Workbench? Rechts neben 
mir auf der Fensterbank steht ein Radiowecker..wozu brauche ich dann eine 
Uhr? Und warum MooVid nicht auch als PPC-Version? Gab es in diesem Fall mal 
wieder Verhandlungsschwierigkeiten zwischen H&P und dem Programmautor 
(siehe Holger Kruse und Miami auf OS 3.5!)? Fast h&auml;tte ich es vergessen. Wo 
ist denn die PPC-Unterst&uuml;tzung? Ist das neue Picture-Datatype denn die 
einzige Systemkomponente, die den PPC unterst&uuml;tzt?
Da h&auml;tte ich mir auch gleich eine AmigaPlus-CD f&uuml;r 20 Mark kaufen k&ouml;nnen, 
da findet man solche Programme auch. Nur das Internet ist billiger mit ein 
paar Downloads aus dem Aminet. Ergo, ich habe 89 Mark f&uuml;r eine Aminet-CD 
mit Genesis als Vollversion ausgegeben. Milde ausgedr&uuml;ckt, ich f&uuml;hlte mich 
etwas hinter das Licht gef&uuml;hrt oder auf gut deutsch "verarscht".
Entschuldigt meine Ausdrucksweise, aber Gef&uuml;hle kann man nun mal nicht 
besch&ouml;nigen.

"Schwester, Skalpell bitte!"

Bevor mich radikale Amiganer der Unterschlagung anklagen, m&ouml;chte ich hier 
nun eine Liste pr&auml;sentieren, die jede Komponente des OS 3.9 einmal unter 
die Lupe nimmt und ihr F&uuml;r und Wider abw&auml;gt. Ein endg&uuml;ltiges Fazit aber 
m&ouml;chte ich dem Leser selbst &uuml;berlassen.

   o Reine Systemkomponenten:
     Positiv: Generell ist ein Update, welches das aktuelle Betriebssystem
     verbessert, immer eine positive Erscheinung. H&P hat mit dem Update
     das AmigaOS (CLI-Kommandos, Prefs, CD-Filesystem, Workbench, WarpOS
     f&uuml;r PPC-User usw.) auf den neuesten Stand gebracht und damit die
     momentan vorhandene Hardware in neuen Einklang gebracht. Die
     Workbench l&auml;uft jetzt wesentlich stabiler, WarpOS ist etwas schneller
     geworden (schnellere Kontext-Switches), die Prefs-Programme sind in
     ihrem Umfang teilweise erweitert worden, usw. Besonders positiv
     hervorzuheben ist das neue Picture-Datatype mit PPC-Unterst&uuml;tzung!
     Negativ: Etwas bitter ist mir die Tatsache aufgefallen, dass die
     externen Math-Libraries ge&auml;ndert wurden, ohne auch nur einen Hinweis
     seitens H&P an die User zu geben. Als Software-Entwickler musste ich
     leider feststellen, dass die neuen Math-Libs die Rundungs-Flags der
     FPU (wenn vorhanden!) &auml;ndern, so dass die normale Rundungs-Methode
     (float-&gt;int-Umwandlung) jetzt eine andere ist, was zu deutlichen
     Fehlberechnungen mancher Software f&uuml;hrte. Zum Gl&uuml;ck war dieser Fehler
     durch Anpassung der Software zwar gleich behoben, aber diese Tatsache
     hinterlie&szlig; mir doch einen etwas bitteren Geschmack auf der Zunge. Ein
     weiterer Fehler auf der CD ist die Tatsache, dass auf die Festplatte
     SetPatch in der Version 44.13 kopiert wird, die aktuellere Version
     44.16 aber unterschlagen wird. Nach einigem Suchen findet man diese
     wichtige Datei im Ordner f&uuml;r die Notfall-Diskette.
     Fazit: OS 3.9 l&auml;uft stabiler als sein Vorg&auml;nger, viele noch vorhandene
     Bugs des OS 3.5 wurden entfernt. Leider hat es H&P noch nicht
     geschafft, die Workbench multitaskingf&auml;hig zu machen. Wir k&ouml;nnen nur
     hoffen, dass sich dies mit dem BoingBag zu OS 3.9 so schnell wie
     m&ouml;glich &auml;ndert!
   o Multimedia-Programme (Action und AMPlifier):
     Positiv: Endlich wurden Multimedia-Programme in das OS integriert.
     Negativ: Was Amiga Inc. und all seine angeschlossenen Programmierer
     offenbar nie zu Wege gebracht haben, mussten Hobby-Programmierer aus
     der Szene erledigen, n&auml;mlich f&auml;hige Multimedia-Player zu schreiben.
     Warum die Wahl von H&P ausgerechnet auf MooVid, welches unter dem
     Pseudonym ACTION in das OS 3.9 aufgenommen wurde, und AMPlifier fiel,
     ist mir selbst ein R&auml;tsel. AmigaAMP ist in seiner aktuell vorliegenden
     Version 2.8 AMPlifier ebenb&uuml;rtig, wenn nicht sogar etwas &uuml;berlegen.
     MooVid ist zwar ein schnelles Abspielprogramm f&uuml;r AVI- und
     QuickTime-Filme mit GUI-Steuerung, aber von der vielger&uuml;hmten
     PPC-Unterst&uuml;tzung kann hier wohl keine Rede sein. MooVid ist in der
     68k-Version mittlerweile Freeware, aber in der PPC-Version leider
     immer noch Shareware. Dass MooVid nur in der 68k-Version Einzug in das
     OS 3.9 gehalten hat, ist bedauerlich. Ein sehr wahrscheinlicher Grund
     ist die oben angedeutete Uneinigkeit &uuml;ber die Lizenzgeb&uuml;hr der
     PPC-Version zwischen H&P und dem MooVid-Autor. Die Wahrheit (&uuml;ber
     dieses Faktum) liegt eben doch irgendwo da drau&szlig;en. Eine
     entscheidende Multimedia-Komponente hat uns H&P einfach
     unterschlagen. Was ist mit einem MPEG-Player? Gerade hier h&auml;tte H&P
     zeigen k&ouml;nnen, was es hei&szlig;t, ein universelles Multimedia-Programm zu
     schreiben. Oder sind etwa alle Programmierer von H&P gerade mit etwas
     anderem besch&auml;ftigt? Ein einziges Programm f&uuml;r IFF-ANIM, QuickTime,
     AVI und MPEG w&auml;re der Traum auf dem Amiga, was Multimedia im
     Video-Bereich angeht. Aber tr&auml;umen wir ruhig weiter, denn das k&ouml;nnen
     wir ja alle gut.
     Fazit: Wer einen Internet-Anschluss hat, kann sich im Aminet seine
     Lieblingsprogramme herunterladen und ist damit im Endeffekt besser
     bedient als mit dem, was uns die Programmpalette der OS 3.9-CD         
     anbietet. Selbst wer keinen Internetanschluss hat, ist mit dem Angebot  
     an Abspielprogrammen auf diversen AmigaPlus- oder Aminet-CDs
     besser dran. Ob nun ein Amiga-User lieber AmigaAMP statt AMPlifier
     mag, oder lieber CyberQT/AVI statt MooVid, ist pers&ouml;nlicher Geschmack.
   o AmiDock:
     Positiv: Einfach zu bedienendes Programm f&uuml;r den bequemen Schnellstart
     von h&auml;ufig benutzten Programmen.
     Negativ: Als ich erfuhr, dass AmiDock das Programm eines
     Informatik-Studenten ist, der bei H&P ein Praktikum absolvierte, habe
     ich in meiner Kritik noch einmal beide H&uuml;hneraugen zugedr&uuml;ckt. Warum?
     Das Programm ist zwar sch&ouml;n und ansprechend gestaltet, aber in seinem
     Funktionsumfang her nicht konsequent. Hier hat das
     Schnellstart-Programm ToolManager eindeutig die Nase vorn, auch wenn
     dessen Konfiguration nicht ganz so einfach wie AmiDock ist. Leider
     kann AmiDock nur die Programm-Icons anzeigen. Die Anzeige
     alternativer Bilder wie z.B. die DockIcon-Bilder ist leider nicht
     m&ouml;glich.
     Fazit: Ein sch&ouml;nes, aber in mancher Hinsicht auch &uuml;berfl&uuml;ssiges
     Programm. "Yet Another Quickstart" w&auml;re als Name vielleicht passender
     und vor allem realistischer gewesen.
   o AudioCD-Player:
     Positiv: Der erste CD-Player f&uuml;r den Amiga mit Skin-Oberfl&auml;che.
     Negativ: Der wievielte CD-Player f&uuml;r den Amiga ist das nun? Der x-te
     jedenfalls. Au&szlig;er einer konfigurierbaren Oberfl&auml;che (Skins) ist
     nichts Neues passiert. Immer noch werden Audio-Tracks nicht &uuml;ber AHI
     oder Paula abgespielt, dabei w&auml;re es f&uuml;r einen Programmierer, der
     sich mit SCSI-Kommandos auskennt, kein gro&szlig;es Problem, einen
     Audio-Track mittels asynchronem I/O h&auml;ppchenweise in den Amiga
     einzulesen und dort abzuspielen. Aber darauf warte ich leider schon
     seit einer halben Ewigkeit vergebens. Die einzige Alternative aus
     diesem Dilemma stellt immer noch AsimCDFS dar, welches als einziges
     Filesystem, das Auslesen von Audio-Tracks als Datei erlaubt.
     Fazit: &Uuml;berfl&uuml;ssig wie ein Kropf in der vorliegenden Version.
   o VinceED
     Positiv: Endlich eine leistungsf&auml;hige Shell, welche dem Tastatur-Freak
     viel Arbeit abnimmt.
     Negativ: Soll ich mich nun freuen oder &auml;rgern? Immerhin ist dies das
     erste Mal, dass dem User von Amiga her eine Alternative zur CON-Shell
     angeboten wird. Die originale Shell ist bekanntlich nur etwas f&uuml;r
     Masochisten. Aber auch hier waren die Programmierer des OS 3.9
     offenbar nicht in der Lage, etwas Eigenes zu programmieren, sondern
     mussten auch hier auf das Aminet-Angebot zur&uuml;ckgreifen. Aber ist denn
     VinceED als Shell-Ersatz etwas v&ouml;llig Neues? Nein, schon seit den
     Tagen der Fish-Disketten gibt es den CON-Ersatz KingCON, der
     hervorragende Dienste leistet. Was mich wundert ist, dass dieser
     Umstand erst jetzt entdeckt wurde. Prinzipiell sind KingCON und
     VinceED von ihrem Leistungsangebot gleichwertig. KingCON ist
     schn&ouml;rkellos und sehr effizient, w&auml;hrend VinceED konfigurierbar ist.
     Die negative Kritik bezieht sich also nicht auf VinceED, sondern auf
     die Ideenlosigkeit der OS3.9-Programmierer, die in aller Hektik auf
     das Aminet zur&uuml;ckgreifen mussten.
     Fazit: Wieder mal ein Aminet-Programm, welches uns als "neues Feature
     des OS 3.9" verkauft wird.
   o UnARC und XAD:
     Positiv: Einfache GUI zum Entpacken vieler Dateien per Mausklick von
     der Workbench aus. Erspart den Kampf mit der Shell und diversen
     Kommandozeilen-Optionen. Durch das XAD-System leicht zu erweitern und
     zu verwalten.
     Negativ: Leider keine PPC-Unterst&uuml;tzung der XAD-Module! Ist es denn
     so schwer, den Quelltext zu nehmen und diesen f&uuml;r WarpOS gleich mit
     zu kompilieren?
     Fazit: Sch&ouml;nes Tool, das aber auch hier nicht konsequent umgesetzt
     wurde.
   o Contributions, Audio, Video u.a.:
     Ach so! Jetzt ist mir klar, wie man die CD auf 470 MB aufblasen
     konnte! Danke, Haage&Partner, mit den vielen Kinotrailern im
     Video-Ordner ersparen Sie mir eine Menge Downloadzeit aus dem
     Internet. Aber ist das denn wirklich notwendig? Wir glauben ja alle
     auch so, dass MooVid ein gutes Abspielprogramm ist. Aber mussten es
     gleich 370 MB sein? Ich denke, dieser Platz w&auml;re f&uuml;r wichtigere
     Dinge, die wirklich etwas mit dem AmigaOS zu tun haben, besser
     ausgef&uuml;llt gewesen. Das gleiche empfinde ich f&uuml;r den
     Annex-Audio-Track und die MP3s im Audio-Ordner. Diese w&auml;ren besser in
     den Music-Directories des Aminets oder einer Extra-CD aufgehoben, als
     in einem OS-Update!
     Ebenso "Daumen nach unten" gibt es f&uuml;r den Contributions-Ordner der
     CD. Entweder schiebt man uns hier Programme unter, mit denen die
     wenigsten etwas Konkretes anfangen k&ouml;nnen, oder man kann die
     vorliegenden Programme auf jeder sonstigen Programmheft-CD finden
     oder man l&auml;dt sie aus dem Aminet oder von anderen, allen Amiganern     
     bekannten, Servern herunter.
     Einzige Schmankerl: AHI V5 und WarpOS V5. Leider habe ich bei AHI V5
     wieder meine Augenprobleme bekommen. Ich habe lange in der
     Dokumentation zu AHI V5 nach den Neuerungen im Vergleich zur letzten
     Version 4 gesucht, konnte aber nirgends das Gesuchte finden. Schade,
     oder wissen Sie es, liebe(r) Leser(in)?

Marktpolitischer Geniestreich?

Nachdem mein Blutdruck und Adrenalinspiegel sich wieder in den
Normalbereich gesenkt haben, machte ich mir stundenlang Gedanken &uuml;ber das
"Warum?".
In diversen Mailing-Listen, IRC-Channels und in meinem Amiga-Club habe ich
mit anderen &uuml;ber das Pro und Contra des OS 3.9 diskutiert und gestritten.
Dabei kamen Meinungen und Str&ouml;mungen zu Tage, wie sie unterschiedlicher
nicht sein konnten. Von "Super" bis zu "Betrug" war das gesamte Spektrum
vertreten. Ich fasste all diese unterschiedlichen Standpunkte zusammen und
machte mir so meine Gedanken, die ich der Amiga-Gemeinde nicht vorenthalten
m&ouml;chte.

Nachdem sich sieben Jahre lang im Bereich Amiga-Betriebssystem nichts 
r&uuml;hrte, k&uuml;ndigte Amiga Inc. in Zusammenarbeit mit Haage&Partner ein
&uuml;berarbeitetes OS f&uuml;r den Amiga an, welches an die neuen Technologien im
Bereich Grafikkarten, Turbokarten und SCSI/ATAPI-Ger&auml;te (HD, CD etc.)
angepasst werden soll. Das Echo wurde von allen als positives Zeichen
gewertet und mit Begeisterung aufgenommen. Der Welt sollte gezeigt werden,
dass der Classic-Amiga nicht vergessen ist und sich das "kleine gallische
Dorf" (Amiga) immer noch "gegen das r&ouml;mische Imperium" namens Windows und
Co. zu wehren wei&szlig;.
Tats&auml;chlich brachte das neue OS 3.5 dem Amiga eine Vielzahl wichtiger und
notwendiger Neuerungen!

Um so &uuml;berraschter war ich, als ich im Oktober von der Ank&uuml;ndigung eines
Updates zu OS 3.5 h&ouml;rte. War dies das seit langem angek&uuml;ndigte BoingBag 2,
welches den letzten Fehlern des OS 3.5 den Garaus machen sollte? Sehr 
schnell war klar, dass es sich bei dem Update um eine k&auml;ufliche Erweiterung
des OS 3.5 handelte, mit "neuen M&ouml;glichkeiten". Nix BoingBag 2, der
Geldbeutel war wieder mal angesagt. Die Aufregung war gro&szlig;, alle Welt
spekulierte &uuml;ber Amiga und H&Ps neuestes Betriebsgeheimnis. Doch etwas war
komisch. Sieben Jahre lang tat sich nichts, und pl&ouml;tzlich zwei neue OS-
Versionen innerhalb eines Jahres? Was war geschehen? Amiga Inc. hat unter 
seinem neuen Kapit&auml;n Bill McEwen dem Classic-Amiga endg&uuml;ltig abgeschworen 
und die Entwicklung des neuen AmigaOne auf handels&uuml;blicher PC-Hardware 
angek&uuml;ndigt, mit dem Zusatz, den Classic-Amiga nicht v&ouml;llig zu ignorieren. 
War das ein pl&ouml;tzlicher Anfall von Gro&szlig;z&uuml;gigkeit oder gar Erbarmen 
gegen&uuml;ber dem Classic-Amiga? Wie also soll man diese Tatsache zweier OS-
Versionen innerhalb eines Jahres nun interpretieren? Im ersten Augenblick 
ist man durchaus geneigt, sich wie ein Kind &uuml;ber den Weihnachtsmann zu 
freuen. Doch beim zweiten Hinsehen addieren sich einige Ungereimtheiten, 
wie teurer Verkaufspreis, &Uuml;berbewertung und &uuml;berhastete Programmierung des 
OS 3.9 und andere Dinge.

Bei allen Interpretationsm&ouml;glichkeiten bleibt eine unumst&ouml;&szlig;liche Tatsache
immer die gleiche. Keine Firma der Welt entwickelt ein Produkt aus purer
Menschenfreundlichkeit, sondern aus rein marktpolitischen Gr&uuml;nden! Amiga
Inc. und H&P waren demnach der &Uuml;berzeugung, dass der Verkauf des OS 3.9
sich auf jeden Fall lohnen k&ouml;nnte, so dass am Ende ein zufriedenstellender
Gewinn &uuml;brig bleibt.
Schaut man sich den Inhalt der CD an, so wird schnell klar, dass sich der
Aufwand in der Entwicklung des OS 3.9 durchaus in Grenzen hielt. Kein
Wunder, denn, man nehme einfach den Quelltext zu allen OS3.5-
Systemprogrammen, &uuml;berlege sich, wo noch Fehler sind, addiere hier und
da noch eine Kleinigkeit, und fertig ist das OS 3.9. Um das Ganze im
Geschmack etwas abzurunden, packe man noch jede Menge Aminet-Programme 
hinzu, k&uuml;re diese als "Neue Features" und f&uuml;lle das Ganze mit kleinen
Filmchen, damit die CD nicht so leer aussieht.

Fasst man die Argumente in den Diskussionen zusammen, ergeben sich folgende
m&ouml;gliche Antworten zu dem zuvor gestellten "Warum?". Was davon aber die
Wahrheit ist, werden wir leider nie erfahren.

  1. H&P braucht Geld. Offenbar verdient H&P an seinen Amiga-Produkten
     nicht mehr genug, um davon noch gut zu leben. Also musste ein "neues"
     Produkt her, von dem man wei&szlig;, dass es sich tausendfach verkaufen
     wird. Und da ist ein Update zum Betriebssystem wie geschaffen.
  2. Amiga Inc. m&ouml;chte erfahren, wie gro&szlig; das Interesse der
     Classic-Gemeinde an Software generell ist. An der Verkaufszahl kann
     sich Amiga Inc. orientieren, ob sich die Weiterentwicklung des OS -
     vielleicht zum PPC-OS hin! - &uuml;berhaupt noch lohnt. Besonders das
     Statement von Fleecy Moss, dass erst bei gen&uuml;gend hoher Verkaufszahl
     an ein PPC-OS gedacht werden kann, macht diese M&ouml;glichkeit besonders
     wahrscheinlich.
  3. Unwahrscheinlich, aber von vielen gerne geh&ouml;rt, weil es das ist, was
     sie h&ouml;ren wollen und weil es die offiziell vertretene Meinung ist:
     Das OS 3.9 wurde deshalb entwickelt, um zu zeigen, dass die Linie des
     Classic-Amiga nicht vergessen ist, und der Amiga trotz seines hohen
     Alters immer noch ein Spitzenprodukt (aber leider nicht mehr
     konkurrenzf&auml;hig) ist.

Gesamtergebnis

So wie uns vorgestellt, verdient das neue OS die Bezeichnung "3.9" nicht.
Befinden wir uns etwa wirklich eine Dezimale vor dem PPC-OS? Wohl kaum.
Eher hat die "9" einen "finalen" Geschmack, nach dem Motto "So, Feierabend,
Amiga.". Das war's dann wohl gewesen. Noch einmal etwas Geld eingenommen,
bevor wir unserer geliebten Freundin "Good-Bye" w&uuml;nschen. Auf keinen Fall
hat es die Bezeichnung 3.9 verdient, eher 3.6.

Was ist OS 3.9 nun? Diese Frage ist f&uuml;r mich jedenfalls beantwortet. Man
kann es als "K&auml;uflich erwerbbares BoingBag 2 zu OS 3.5" bezeichnen oder
auch als "Aminet-CD Spezial mit OS3.5-Update und Genesis-Vollversion". So
jedenfalls, wie sich OS 3.9 mir pr&auml;sentierte, ist es den Preis von DM 89.-
nicht wert. Das einzig wirklich gelungene Produkt ist Genesis, und hier 
kann man sich &uuml;ber den Preis von DM 89.- streiten, ob dieser nun 
gerechtfertigt ist oder nicht. Meine Meinung hei&szlig;t aber eindeutig "Nein"! 
Viel hat sich in OS 3.9 au&szlig;er Fehlerbereinigung zu OS 3.5 nicht getan. 
Ge&auml;ndert hat sich jedenfall nichts.
Als ich mir spa&szlig;eshalber das im Januar ver&ouml;ffentlichte BB2 zu OS 3.5 n&auml;her
ansah, kam mir vieles bekannt vor. Viele Systemdateien des OS 3.9 enthalten
n&auml;mlich immer noch eine 44er-Versionsnummer, und zwar die gleichen wie das
BB2. Im Nachhinein h&auml;tte ich mir das Geld zu OS 3.9 sparen k&ouml;nnen, lieber
10 Pfennig f&uuml;r den Download des BB2 ausgegeben und das OS 3.5 behalten. 
Denn all den Rest der OS3.9-CD gibt es auch im Aminet oder auf anderen 
Internetseiten.

Weiter entt&auml;uscht hat mich die ungen&uuml;gende Umsetzung diverser Komponenten
des OS 3.9. Oft h&ouml;ren die Programme da auf, wo es eigentlich am
interessantesten wird (wie z.B. der CD-Player), oder es fehlt die
PPC-Unterst&uuml;tzung. Nur das Picture-Datatype hat PPC-Unterst&uuml;tzung bekommen.
Bei anderen Programme, wo diese dringender von N&ouml;ten gewesen w&auml;re, hat man
dies nicht in die Tat umgesetzt. Der Grund hierf&uuml;r ist mir r&auml;tselhaft.
Benutzt H&P etwa seinen eigenen StormC-Compiler nicht, mit dem man
problemlos WarpOS-Programme schreiben kann? K&ouml;nnen die Autoren der
XAD-Library keine PPC-Module kompilieren? Zu nennen sind hier: JPEG-, GIF-
und ILBM-Datatypes (fehlende PPC-Dekodierung) und die wichtigsten
XAD-Module f&uuml;r LHA, LZX, ZIP, BZIP und GZIP. Verkaufsf&ouml;rdernd f&uuml;r die
PPC-Boards wirkt sich OS 3.9 auf jeden Fall nicht aus.

Eine Frage brennt mir f&ouml;rmlich auf der Zunge. Wann hat H&P mit der
Entwicklung des OS 3.9 angefangen? Auf jeden Fall kann es nicht allzu
lang her gewesen sein. Denn man merkt dem OS-Update schnell an, dass es
"Hoppla-Hopp" in aller Hektik umgesetzt wurde. H&auml;tte man sich mehr Zeit
genommen und einmal mehr auf die Bed&uuml;rfnisse der Amiga-User geh&ouml;rt, so
h&auml;tte sich das OS 3.9 mit Sicherheit nicht so entt&auml;uschend pr&auml;sentiert wie
in dieser Ausgabe.

Die einzigen Amiganer, die in meinen Augen wirklich etwas von der OS3.9-CD
haben, sind diejenigen, die entweder keinen Internetanschluss besitzen und
f&uuml;r die die Silberscheibe die einzige Verbindung zur Amiga-Au&szlig;enwelt
darstellt, oder die Amiganer, die noch nicht so lange mit dem Amiga 
arbeiten und deshalb noch nicht so tief den Einblick in die Amiga-Welt 
haben. F&uuml;r alle anderen gilt: OS 3.5 + BB2 + Aminet ist OS 3.9 ebenb&uuml;rtig, 
aber die wesentlich billigere Variante.

Ich selbst bin seit 1987 begeisterter Amiganer. Aber selten hat mich eine
so wichtige Software so sehr entt&auml;uscht wie OS 3.9. Angesichts des
Preis-Leistungs-Verh&auml;ltnisses f&uuml;hle ich mich von Amiga Inc. und H&P
ausgenutzt, wenn nicht sogar hinters Licht gef&uuml;hrt. Zwar werde ich meiner
"Freundin" gegen&uuml;ber treu bleiben, denn die Hardware kann nichts f&uuml;r die
Software, die auf ihr l&auml;uft. Doch was zuk&uuml;nftige Ank&uuml;ndigungen im Bereich
Classic-OS betrifft, habe ich das Vertrauen in Amiga Inc. und H&P leider
verloren.

Ich kann nur hoffen, dass das alles mit dem neuen AmigaOne zu einem
vers&ouml;hnlichen Neuanfang f&uuml;hrt.

Achim Stegemann &lt;achimste@gmx.de&gt;«


Im Rahmen des aktuellen Gewinnspiels haben wir zwar bereits eure Kommentare 
zum OS 3.9 ver&ouml;ffentlicht, wir sind jedoch an weiteren Meinungen zur 
derzeitigen Betriebssystemversion bzw. Reaktionen zu einzelnen Sichtweisen 
interessiert. Schreibt einfach an aakt@aakt.de. Wir werden eure Mails in 
der kommenden Ausgabe ver&ouml;ffentlichen.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
