<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. PD-Spieletests

Yoho, ihr Spielefreaks!!

Nach dem spielem&auml;&szlig;ig schrecklichen Dezember starten wir nun durch ins neue 
Jahr, oder auch Jahrtausend, je nachdem wie man das nimmt. Und schon jetzt, 
am 10.1., zeigt sich, dass uns die Programmierer nicht vergessen haben.
So sind neben zahlreichen Updates von Spielen (wovon etwa 50% allein 
Mattonite ausmachte, welches w&ouml;chentlich geupdatet wurde) auch einige 
kommerzielle Entwicklungen eingestellt und als Freeware ver&ouml;ffentlicht 
worden.
Mal sehen, ob sich diese positive Spieletendenz &uuml;ber den Monat halten kann.

Diesen Monat begl&uuml;cke ich euch mit Tests von...

-Blade (deutsche Version)
-Rags
-BallMasterAGA
-Pishti
-The Lost Islands


-----------
---Blade---
-----------

Blade war eigentlich als kommerzielles Spiel gedacht und sollte bei Alive 
erscheinen. Da jedoch rauskam, dass Alive unlizensierte und schlicht und 
einfach gestohlene Software verkauft, hat der Programmierer Mark Sheeky es 
als Freeware ins Netz gestellt. Nun hat sich die Amiga Arena das Spiel zur 
Hand genommen, und es auf seine CD-Rom gebrannt. Als besonderer Schmankerl 
ist es exclusiv in einer deutsch &uuml;bersetzten Version auf der CD zu finden. 
Doch kommen wir nun zum Spiel selber:
Blade ist ein klassisches Rollenspiel. Man sieht die 4 Helden, die man am 
Anfang des Spiels w&auml;hlen kann, aus einer Isometrischen Draufsicht. Sie 
lassen sich mit der Maus bewegen, jedoch hat jeder Mitstreiter nur eine 
begrenzte Anzahl an Aktionspunkten. Diese werden auch verbraucht, wenn man 
k&auml;mpft oder Dinge benutzt. Sind die Aktionspunkte aller Helden 
aufgebraucht, ist die Runde zuende. Nun d&uuml;rfen sich die Monster bewegen und 
attackieren.
Dies klingt im Prinzip okay, jedoch wurde dieses System nicht nur in den 
Dungeons, sondern auch in der Oberwelt verwendet, was beim friedlichen 
Shoppen sehr st&ouml;rt, da einen eh keine Monster attackieren.
K&auml;mpfe gehen ebenfalls rundenweise, erst schl&auml;gt der Held, bei Beenden der 
Runde haut euch das Monster eins auf die M&uuml;tze.
Grafisch gesehen ist das Game sehr gelungen, viele Grafiken scheinen 
gerendert zu sein. In den Dungeons verbreitet die Grafik eine gute 
Atmosph&auml;re.
Jedoch l&auml;uft der Sound, zumindest bei mir, nicht richtig. Dies kann 
allerdings auch an meinen Computer liegen, deswegen w&uuml;rde ich dies nicht 
als Kritikpunkt werten.

Blade ist ein Rollenspiel, das nicht unbedingt zug&auml;nglich f&uuml;r Anf&auml;nger ist. 
Und genau deswegen m&ouml;chte ich es nicht werten. Auch wenn ich gern 
Rollenspiele und Action-Adventures zocke, mag ich pers&ouml;nlich das 
Spielprinzip von Blade nicht und m&ouml;chte jedem raten, sich ein eigenes Bild 
zu machen.
Wer sich sowieso die AmigaArena-CD kaufen wollte, dem empfehle ich, auf 
jeden Fall einen Blick drauf zu werfen, zumal die Texte auch gut ins 
Deutsche &uuml;bersetzt wurden.
Wer sich die AA-CD nicht kaufen m&ouml;chte, kann es sich ja runterladen, das 
ist es auf jeden Fall wert.


----------
---Rags---
----------

Okay, mag sein, dass die Zeit, in der wir leben, Amiga-m&auml;&szlig;ig gesehen doch 
sehr be...scheiden ist. Und dass das viele Menschen deprimiert, stimmt. 
Dieser Zustand der Dinge hat allerdings auch einen kleinen positiven 
Effekt:
Einige Programmierteams geben ihre kommerziellen Projekte auf und 
ver&ouml;ffentlichen sie als Freeware. Dies ist zwar manchmal sehr traurig 
(siehe ACSYS), da man einige Spiele doch lieber fertig im Verkaufsregal 
stehen sehen w&uuml;rde, allerdings bei Vertretern wie Blade oder Rags macht 
einen das schon weniger aus. 
Rags ist ein "1 on 1" Ballerspiel f&uuml;r ein bis zwei Spieler, das sehr an die 
gute alte Chaos Engine erinnert.
Die Story ist einfach und liebevoll geklaut: Nach der atomaren Apokalypse 
ist die Welt vollkommen zerst&ouml;rt. Die &Uuml;berlebenden haben sich in zwei 
Gruppen gespalten. Die Dukes haben sich in die Unterwelt zur&uuml;ckgezogen und 
leben dort in einem dekadenten und reichen Feudalismus, w&auml;hrend die Rags 
die alte Welt wiederherstellen wollten. Sie sind gescheitert und leben in 
Armut. 
Aus Langeweile (warum auch sonst??) haben sich die Dukes ein Spiel 
ausgedacht, dass es den Rags erlaubt, in die reiche Unterwelt zu gelangen. 
Doch daf&uuml;r m&uuml;ssen sie sich gegenseitig in einem Zweikampf bek&auml;mpfen.
Hier setzt das Spiel an. Nach umfangreichen Einstellungen gelangt man in 
die Arena, die aus einer schr&auml;gen Vogelperspektive dargestellt wird. 
Anfangs besitzt man "nur" Wurfmesser, man kann sich jedoch durch diverse 
Extras, die pl&ouml;tzlich auftauchen und genauso pl&ouml;tzlich verschwinden, 
aufr&uuml;sten und so mehr Energie bekommen, oder mit einer UZI ballern. 
Die Arenen bestehen aus mehreren Ebenen und sind interessant gestaltet, so 
dass ihr auch hinter Mauern Deckung nehmen k&ouml;nnt, usw. 
Die Grafik und der Sound des Spiels sind wirklich auf Kommerz-Niveau. Dies 
ist nach rund 5 Jahren Entwicklungszeit jedoch verst&auml;ndlich.
Allerdings wird das Spiel im Einspielermodus schnell langweilig, da es nur 
vier Arenen gibt. Zu Zweit sollte das Spiel allerdings jede Party f&uuml;r 
mehrere Stunden zum Kochen bringen.

Auch bei diesem Spiel kann man den Download ohne Einschr&auml;nkungen empfehlen.

Aber Achtung: Ich habe das Gef&uuml;hl, als wenn die Programmierer einen Virus 
eingebaut haben! Nach dem Spielen ist in der RAM-Disk eine seltsame Datei 
zu finden, und EdWord Pro ist abgebrochen. Speichert ab, bevor ihr das 
Spiel ausprobiert...!

Name: Rags
Autor: Shades Productions

Grafik: 9 von 10 Punkten
Sound: 9 von 10 Punkten
Steuerung: 7 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck des Redakteurs: 7 von 10 Punkten 


-------------------
---BallMasterAGA---
-------------------

Dieses Spiel war zwar vorher nicht kommerziell, aber die Shareware-
Vollversion wurde als OpenSource ver&ouml;ffentlicht. Bei diesem lustigen 
kleinen Spielchen, das auf dem Spielprinzip von 'Logical' basiert, muss man 
farbige Kugeln durch Leitungen in R&auml;der bef&ouml;rdern. Wenn sich in diesen 
R&auml;dern vier Kugeln gleicher Farbe befinden, verschwinden die vier Kugeln. 
Ziel jedes Levels ist es, in jedem Rad einmal vier Kugeln verschwinden zu 
lassen. Dies klingt einfacher als es ist, denn es kommen immer neue Kugeln 
nach, und ihr m&uuml;sst sie st&auml;ndig durch die R&ouml;hren dirigieren.
Um das Ganze dann &gt;noch&lt; schwerer zu machen, gibt es R&ouml;hren, durch die nur 
eine bestimmte Farbe darf, die nur in eine Richtung gehen oder auch R&ouml;hren, 
die der Kugel eine andere Farbe geben.
Die Grafiken sind im Intro und auf den Zwischenbildschirmen gerendert und 
von Fotos gegrabbt, im Spiel jedoch einfacher gehalten. Gleiches gilt f&uuml;r 
den im Spiel einfachen Sound, der in dem Intro einer guten Musik weicht.

Alles in allem macht das Spiel sehr viel Spa&szlig;, ist jedoch sehr schwer 
geraten. Wer jedoch mal wieder was Kniffliges braucht, um seinen Kopf zum 
Qualmen zu bringen (und die Finger zum Blasensprie&szlig;en), sollte zugreifen!

Name: BallMasterAGA
Autor: Digital Amiga Dreams

Grafik: 7 von 10 Punkten
Sound: 7 von 10 Punkten
Steuerung: 8 von 10 Punkten
Spielspa&szlig;: 7 von 10 Punkten

Subjektiver Gesamteindruck des Redakteurs: 7 von 10 Punkten


------------
---Pishti---
------------

Pishti ist die Computerversion eines ber&uuml;hmten t&uuml;rkischen Kartenspiels. 
Leider habe ich das Spielprinzip nicht verstanden und m&ouml;chte deswegen 
keinen Test schreiben.
F&uuml;r alle Kenner des Spiels: Die technische Umsetzung des Spiels ist gut, 
die Grafik ist im Windows-Solitaire Stil gehalten. 
Ein Download lohnt sich also f&uuml;r alle, die das Spielprinzip schon kennen 
oder gute Englischkenntnisse f&uuml;r die Anleitung haben. 


----------------------
---The Lost Islands---
----------------------

&Ouml;fter mal was Neues! Erinnert sich noch jemand an die seltsame 3D-Version 
von Pacman, in der man von Intel- und Atari-Schildern statt Geistern 
verfolgt wird? Dieses Spiel ist in dieser grafischen Art gehalten 
(allerdings nur Pseudo-3D), jedoch m&uuml;sst ihr nicht Punkte sammeln und vor 
Geistern abhauen, sondern aus einem Labyrinth fliehen. 
Dies ist wirklich gar nicht so einfach, wie es anfangs klingt. Auch durch 
die sich stetig verringernde Zeit ist man sehr unter Druck. Aber die 
absolut geniale Hintergrundmusik motiviert einen immer wieder zum 
Weiterprobieren. Hat man ein Labyrinth geschafft, kommt man direkt zum 
n&auml;chsten. Damit man nicht immer wieder von vorn anfangen muss, gibt es f&uuml;r 
jedes Level ein Passwort.
Die Level sind ziemlich komplex, und zum Finden des Ausgangs bedarf es mehr 
als das sture Ausprobieren aller Wege. 
Nach einiger Zeit demotiviert einen aber auch die Musik, und das Spiel wird 
einfach langweilig.

Das Spiel ist ein lustiger Zeitvertreib, schon allein wegen der Titelmusik 
lohnt sich der Download.

Name: The Lost Islands
Autor: Engine Nine Design

Grafik: 5 von 10 Punkten
Sound: 9 von 10 Punkten
Steuerung: 8 von 10 Punkten
Spielspa&szlig;: 4 von 10 Punkten

Subjektiver Gesamteindruck des Redakteurs: 6 von 10 Punkten


So, das war's f&uuml;r diesen Monat. War mal wieder erfrischend viel los. Ich 
werd nun erst mal noch ein paar Runden die Titelmusik von TLI h&ouml;ren, um 
mich morgen guter Dinge auf die Suche nach neuer Freeware zu machen. Im 
Auftrag ewiger Jugend und Gl&uuml;ckseligkeit...oder so.

Bis dann!

  Malte Mende

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
