<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Workshops / Hintergrundberichte / Buchvorstellungen
---------------------------------------------------

1. Workshop: Texturenerstellung f&uuml;r WBClock (von Christian Aichinger)

Rundholz (oder:
     "Wie erstelle ich mir eine h&uuml;bsche Textur f&uuml;r die WBClock vom OS3.9?")

Ja, am Anfang war ich sehr skeptisch, was AmigaOS 3.9 betrifft. In 
verschiedenen E-Mail-Verteilerlisten hab ich viel &uuml;ber Probleme bei 
Installation und Benutzung gelesen. Aber ich habe auch viel Gutes dar&uuml;ber 
geh&ouml;rt. Da ich mir aufgrund der vielen unterschiedlichen Beitr&auml;ge und 
Testberichte selbst kein richtiges Bild machen konnte, habe ich es mir 
kurzerhand bei KDH bestellt. ;) An dieser Stelle m&ouml;chte ich mich noch mal 
bei KDH bedanken. Innerhalb von 24 Stunden war das Paket da - und das 
zwischen den Feiertagen!! W&auml;re kurz vorher nicht Weihnachten gewesen, h&auml;tte 
ich die Nachnahme gar nicht an der Haust&uuml;r bezahlen k&ouml;nnen. ;)

Soweit so gut. Mittlerweile bin ich jedenfalls von der Leistungsf&auml;higkeit 
und dem Komfort, die dieses Update mit sich bringt, v&ouml;llig &uuml;berzeugt. Die 
grafische Erscheinung, die &Uuml;berarbeitungen an den Voreinstellerprogrammen, 
der CD-Player, Action, AMPlifier usw. und nat&uuml;rlich Genesis V1.0.6 in der 
Vollversion rechtfertigen den Preis von 89,- DM. Nur was die WBClock 
betrifft, war ich etwas entt&auml;uscht. Nein, eigentlich nicht WBClock, sondern 
die mitgelieferten Texturen, fand ich nicht so toll. Nicht, dass sie nicht 
gut aussehen, aber die Texturen sind einfach viel zu gro&szlig; f&uuml;r meine 
Workbench, und es werden zu wenige Texturen mitgeliefert. Werden diese 
gro&szlig;en Texturen von WBClock auf eine passende Gr&ouml;&szlig;e skaliert, verbessert 
das den visuellen Eindruck auch nicht gerade. Auch eine h&uuml;bsche runde Uhr 
mit einem Rand aus virtuellem Holz habe ich vermi&szlig;t. Da ich ja nicht auf 
den Kopf gefallen bin (h&ouml;chstens mal auf die Nase ;) und mich eigentlich 
auch ganz gut mit den Grafikprogrammen auf dem Amiga auskenne, habe ich 
mich nicht lange ge&auml;rgert, sondern mir meine eigene Textur erstellt. Wie 
ich finde, sieht die auch ganz gut aus und nimmt mit 99x99 Pixeln auf der 
Workbench auch nicht soviel Platz weg. Da es hoffentlich ;) jemanden 
interessiert, wie man so eine Textur selbst erstellt, habe ich mich 
entschlossen, mal einen kleinen Workshop zu schreiben. Daf&uuml;r mu&szlig; man kein 
Profi sein. Man sollte nur ein paar Grafik-Programme zur Hand haben, die, 
wie ich finde, sowieso jeder ernsthafte Amiga-User besitzen sollte.

F&uuml;r meine Textur wird der Raytracer Cinema4D ben&ouml;tigt. Wir wollen unsere 
Workbench ja nicht verschandeln, sondern aufwerten. Irgend ein Kikifax-Bild 
kann ja jeder malen. ;) Ich selbst verwende f&uuml;r diesen Workshop die Version 
4.0 Pro von der legend&auml;ren AmigaPlus-CD-ROM. Es sollte aber auch mit 
&auml;lteren Versionen problemlos m&ouml;glich sein, diesen Workshop 
nachzuvollziehen. Wer Cinema4D nicht besitzt, kann auch auf andere 
Raytracer zur&uuml;ckgreifen (Imagine, Moonzoom oder Tornado m&uuml;&szlig;ten auch gehen). 
Zur Not kann man sich auch mal im AC-Forum (www.amiga-club.de) bei den 
Software-Angeboten oder bei eBay (www.ebay.de) umsehen. Ich habe dort schon 
&ouml;fters sehr preiswerte Cinema4D-Angebote entdeckt. Soweit ich wei&szlig;, hatte 
der Falke-Verlag vor einiger Zeit sogar noch ein paar AmigaPlus-CD-ROMs mit 
Cinema4D auf Lager. Dort k&ouml;nnte man u.U. auch noch mal nachfragen. 
Weiterhin wird noch das Malprogramm PPaint ben&ouml;tigt. Vorzugsweise nat&uuml;rlich 
die Version 7, die man kostenlos aus dem Aminet beziehen kann.

Zur Retuschierung von Grafikfehlern, dem &Auml;ndern der Bildgr&ouml;&szlig;e und 
Helligkeit, habe ich mich der Bildbearbeitung ArtEffect bedient. ArtEffect 
ist nicht wirklich f&uuml;r diesen Workshop n&ouml;tig, aber wer es besitzt, kann es 
durchaus sinnvoll einsetzen. Nat&uuml;rlich kann f&uuml;r diesen Workshop auch jede 
andere 24Bit-Bildverarbeitung verwendet werden.

Nachdem die Voraussetzungen gekl&auml;rt sind, fange ich jetzt einfach mal an. 
Zuerst wird Cinema gestartet. F&uuml;r eine runde Uhr mit einem h&uuml;bschen 
Holzrand werden eigentlich nicht mehr als drei Objekte ben&ouml;tigt. Ein Ring, 
eine Scheibe und eine Lichtquelle. Beginnen wir mit dem Ring. Geht in das 
Men&uuml; "Objekte/Grundobjekte/Ring" und haltet dabei die "Shift"-Taste 
gedr&uuml;ckt. Es sollte dann der folgende Requester erscheinen.

Screenshot:
<IMG SRC="../extra/WBClock1.jpg" ALT="Screenshot">

Die Anzahl der Ringsegmente sollte auf 36 erh&ouml;ht werden. Dadurch werden die 
Rundungen der Uhr etwas "weicher". Der Rohrradius wird auf 25 gesetzt. 
Dadurch wird der Ring etwas schmaler. Die restlichen Einstellungen m&uuml;ssen 
so bleiben (Ringradius=200, Rohrsegmente=12). Klickt jetzt auf "OK" und 
Cinema erstellt den Ring. Als n&auml;chstes wird der Uhren-Hintergrund - oder 
besser gesagt die Fl&auml;che, auf der sp&auml;ter das WBClock-Ziffernblatt 
projiziert wird, ben&ouml;tigt. Dazu verwenden wir eine einfache Scheibe. Geht 
also wieder in das Men&uuml; "Objekte/Grundobjekte" und selektiert mit 
gedr&uuml;ckter "Shift"-Taste den Eintrag f&uuml;r "Scheibe". In dem jetzt 
erscheinenden Requester wird der Radius auf den Wert 175 gesetzt. Die 
Anzahl der Segmente sollte, wie bei dem Ring, 36 betragen. Die Scheibe wird 
dadurch genauso "rund" wie der Ring.

Als n&auml;chstes bringen wir die Objekte in Position. Aktiviert dazu die "XY"-
Ansicht und selektiert das "Ring"-Objekt. Das geht am einfachsten, wenn im 
Men&uuml; "Bearbeiten" der Men&uuml;punkt "Objekt ausw&auml;hlen..." aktiviert wird. In 
dem erscheinenden Requester w&auml;hlt ihr den Eintrag "Ring" aus und klickt auf 
"OK".
Danach wird der Ring "aufgerichtet". Dazu wird in der Toolbox der "Objekt 
bearbeiten"-Modus (der W&uuml;rfel unter dem Auge) und der "Dreh"-Modus (der 
rundgebogene Pfeil) aktiviert. Da wir die Uhr um die X-Achse drehen wollen, 
mu&szlig; in der Toolbox auch das "X" aktiviert sein. Wenn ihr soweit seit, k&ouml;nnt 
ihr den Ring jetzt um 90 Grad "aufrichten". Wenn der Ring weit genug 
gedreht wurde, sollten sich die Linien des Drahtgitter-W&uuml;rfels, der bei der 
Drehung erscheint, in der Y-Ebene &uuml;berschneiden. Oder anders gesagt: Wenn 
beim Drehen des Objekts in der XY-Ansicht nur noch ein (2D-)Quadrat 
sichtbar ist, befindet sich der Ring in der richtigen Position.

Nachdem der Ring aufgerichtet wurde, kommt der Hintergrund f&uuml;r das 
Ziffernblatt an die Reihe. Cinema hat daf&uuml;r eine n&uuml;tzliche "Ausrichten"-
Funktion. Zuerst mu&szlig; das Scheiben-Objekt ausgew&auml;hlt werden. Dazu wird 
wieder die oben genannte "Objekt ausw&auml;hlen..."-Funktion verwendet. Wenn die 
Scheibe selektiert wurde, geht ihr in das Men&uuml; "Extra/Ausrichten auf...". 
In dem jetzt erscheinenden Requester aktiviert ihr den Eintrag "Ring" und 
klickt auf "OK". Wie ihr jetzt sehen solltet, wurde die Scheibe wieder in 
die richtige Position gebracht.

Das "Grobe" h&auml;tten wir jetzt eigentlich schon. Jetzt ben&ouml;tigen wir noch 
eine Lichtquelle. Dazu geht ihr wieder in das Men&uuml; "Objekte/Grundobjekte" 
und aktiviert dort den Men&uuml;eintrag "Lichtquelle" - diesmal aber ohne 
gedr&uuml;ckte "Shift"-Taste, da die Standard-Werte f&uuml;r unsere Bed&uuml;rfnisse 
ausreichend sind. Aktiviert jetzt die "XZ"-Ansicht. Ihr seht jetzt die 
Szene von oben. Als n&auml;chstes wird der "Verschiebe"-Modus in der Toolbox von 
Cinema aktiviert (das ist der nach rechts zeigende Pfeil). Die Lichtquelle 
sollte ein kleines St&uuml;ck vor die Uhr gezogen werden. Ihr k&ouml;nnt als 
Orientierung die gepunkteten Positions-Quadrate verwenden, die Cinema in 
der Seitenansicht zeichnet. Eine gute Position f&uuml;r die Lichtquelle ist 1 
Quadrat vor das Uhren-Objekt (auf der Z-Achse - "Z" an, "X" und "Y" aus) 
und ca. 2 Quadrate nach links (X-Achse - "X" an, "Z" und "Y" aus). Jetzt 
verschieben wir die Lichtquelle noch in der H&ouml;he. Schaltet dazu in die XY-
Ansicht und verschiebt die Lichtquelle etwas mehr als ein Quadrat nach oben 
(Y-Achse - "Y" aktiviert, "Z" und "X" ist abgeschaltet). Die XY-
Seitenansicht sieht dann ungef&auml;hr so aus:

Screenshot:
<IMG SRC="../extra/WBClock2.jpg" ALT="Screenshot">

Die Sache mit der Beleuchtung ist allerdings auch ein wenig 
Geschmackssache.
Wenn die Oberfl&auml;chen-Texturen erstellt wurden, kann die Position der 
Lichtquelle auch noch ein wenig abge&auml;ndert werden. Was allerdings beachtet 
werden sollte, ist, da&szlig; die Beleuchtung der Uhr in etwa der "Beleuchtung" 
der Workbench entspricht. Wenn man sich den 3D-Effekt der GlowIcons und der 
Fenster auf der Workbench ansieht, kommt das Licht immer von links oben. 
Also die linke, obere Seite der Piktogramme, Fenster und Buttons ist heller 
als die rechte, untere Seite. Dementsprechend sollte dann auch die 
Beleuchtung der Uhr gew&auml;hlt werden.

Nun gut. Im Moment sieht unsere Uhr noch ein wenig bleich aus. Kein Wunder, 
denn wir haben noch keine Oberfl&auml;chentexturen definiert. Wie ich am Anfang 
schrieb, soll die Uhr einen Rand aus Holz bekommen. Dazu aktivieren wir 
zuerst den Materialmanager von Cinema (rechte Amiga + "m" oder das Men&uuml; 
"Fenster/Materialmanager" selektieren). Es &ouml;ffnet sich jetzt ein leeres 
Fenster. Klickt mit der rechten Maustaste in das Fenster und w&auml;hlt in dem 
jetzt erscheinenden Popup-Men&uuml; den Eintrag "Neu" aus. Aktiviert die Textur 
"neu" und dr&uuml;ckt wieder die rechte Maustaste. W&auml;hlt in dem Popup-Men&uuml; den 
Punkt "Bearbeiten". Nun erscheint der Textur-Einsteller. Zuerst wird die 
"Farbe" des Materials bearbeitet. Es gibt dort zwei Bereiche, mit denen man 
einerseits die Farbe des Materials und zum anderen die Textur des Materials 
definieren kann.

Screenshot:
<IMG SRC="../extra/WBClock3.jpg" ALT="Screenshot">

Die ersten drei Regler bei "Farbe" sollten alle bei 100 Prozent sein. Mit 
dem vierten Regler wird die Intensit&auml;t der Farbe festgelegt. Zieht diesen 
Regler zur&uuml;ck auf ca. 14 Prozent. Im Bereich "Textur" k&ouml;nnt ihr die 
Oberfl&auml;chentextur ausw&auml;hlen. Bei Cinema4D werden einige Texturen 
mitgeliefert. W&auml;hlt euch mit dem Dateirequester die Mahagoni-Textur aus, 
die ihr unter "C4D:Tex/mahagoni.tif" finden k&ouml;nnt. Das Cycle-Gadget 
"Interpol." spielt f&uuml;r unsere Bed&uuml;rfnisse keine Rolle. Im Moment sieht die 
Textur schon mal gar nicht so schlecht aus. Oder?
Nein, ich mag es, wenn "Mahagoni" poliert ist! ;) Also sollte die Textur 
noch ein wenig gl&auml;nzen. Auf der rechten Seite des "Material bearbeiten"-
Fensters sind verschiedene Kn&ouml;pfe mit einem H&auml;kchen (oder eben keinem 
H&auml;kchen...). Im Moment sollte dort nur "Farbe" und "Schatten" angew&auml;hlt 
sein. Aktiviert jetzt das H&auml;kchen f&uuml;r "Glanz". Als n&auml;chstes klickt ihr in 
der oberen Knopfleiste ebenfalls auf "Glanz". Stellt den "Modus" auf 
"Plastik". Der Regler "Breite" wird auf 12 Prozent und der Regler "H&ouml;he" 
auf 27 Prozent gezogen. Ihr k&ouml;nnt dort auch andere Werte angeben, nur 
&uuml;bertreibt es nicht mit dem "Glanz". Schlie&szlig;lich soll der Uhrenrand nicht 
aussehen wie ein billiges Mahagoni-Furnier-Imitat aus Kunststoff. ;) Klickt 
jetzt auf "OK". In dem Fenster vom Materialmanager sollte die neue Textur 
jetzt dargestellt werden. Nun m&uuml;ssen wir die Textur noch dem Uhrenrand 
(Objektname ist "Ring") zuweisen. Dazu mu&szlig; erst mal der Ring ausgew&auml;hlt 
werden. Wie das geht, habe ich ja schon beschrieben. Wenn ihr den Ring 
selektiert habt, klickt ihr wieder mit der rechten Maustaste in den 
Materialmanager auf die Holz-Textur und w&auml;hlt in dem Popup-Men&uuml; den Eintrag
"Zuweisen" aus.

Als n&auml;chstes ben&ouml;tigen wir noch eine h&uuml;bsche Oberfl&auml;che f&uuml;r das 
Ziffernblatt. Ich denke, ein mattpolierter Hintergrund aus einem hellen, 
gl&auml;nzenden, leicht ins Grau gehenden Material, pa&szlig;t gut zu Mahagoni. 
Erzeugt dazu wieder eine neue Textur. Die Vorgehensweise entspricht dabei 
der gleichen wie bei der Mahagoni-Textur. In den Farb-Einstellungen sollten 
die ersten drei Regler wieder auf 100 Prozent gezogen werden. Der 
Intensit&auml;tswert sollte 59 Prozent betragen.
Eine Textur verwenden wir diesmal nicht. Das Ziffernblatt sollte matt 
gl&auml;nzen. Dazu aktivieren wir wieder das H&auml;kchen f&uuml;r "Glanz" auf der rechten 
Seite. In den "Glanz"-Einstellungen tragen wir f&uuml;r Modus "Plastik", f&uuml;r 
Breite 18 Prozent und f&uuml;r H&ouml;he 28 Prozent ein. Best&auml;tigt den Material-
Einsteller mit "OK" und weist die Textur dem Ziffernblatt zu (Objektname 
ist "Scheibe").

Wer m&ouml;chte, kann jetzt schon mal einen Testrender machen. Der sieht aber 
noch nicht so &uuml;berw&auml;ltigend aus, weil die Kamera-Position noch nicht 
stimmt. Also m&uuml;ssen wir die Szene jetzt noch f&uuml;r unser "Photoshooting" 
herrichten.
Daf&uuml;r mu&szlig; zuerst in die "Perspektive"-Ansicht gewechselt werden. Klickt 
dazu auf das "P" in der Toolbox. Die "Perspektive"-Ansicht entspricht der 
Ansicht, in der die Szene sp&auml;ter gerendert wird. Wir wollen die Uhr auf der 
Workbench schlie&szlig;lich von "vorne" betrachten und nicht irgendwie seitlich 
verdreht. WBClock w&uuml;rde da auch nicht mitspielen. Dreht dazu die gesamte 
Szene (das "Auge" in der Toolbox mu&szlig; dazu aktiviert sein) in der "X"- und 
"Y"-Richtung soweit, da&szlig; die Uhr am Ende - sozusagen - genau in die Kamera 
"schaut". Am einfachsten geht das, wenn die Szene jeweils nur um eine Achse 
gedreht wird.

Screenshot:
<IMG SRC="../extra/WBClock4.jpg" ALT="Screenshot">

Ein Testrender sieht jetzt schon wesentlich &uuml;berzeugender aus, ist aber 
immer noch nicht perfekt, denn die Farbe der Umgebung ist noch nicht 
ordentlich eingestellt. Selektiert dazu im Men&uuml; "Objekte" den Men&uuml;punkt 
"Umgebung...". In dem nun erscheinenden Requester kann die Umgebungsfarbe 
eingestellt werden. Alle drei Regler sollten auf den Wert 50 Prozent 
gezogen werden. Da sonst nichts weiter in diesem Requester eingestellt 
werden mu&szlig;, klicken wir nur noch auf "OK" und lassen Cinema die Szene 
durchrendern.

Dazu wird auf das "Render"-Symbol in der Toolbox von Cinema geklickt (das 
ist das Symbol mit dem Film-Negativ) und der entsprechende Render-Modus 
ausgew&auml;hlt.
M&ouml;chte man die Render-Parameter &auml;ndern, klickt man mit der rechten 
Maustaste auf das Symbol und w&auml;hlt den zu &auml;ndernden Render-Modus aus. In 
dem danach erscheinenden Requester kann man die Bildgr&ouml;&szlig;e, Aspektratio und 
noch ein paar andere Sachen konfigurieren. Da dort alle Optionen relativ 
selbstkl&auml;rend sind, m&ouml;chte ich mich jetzt auch nicht weiter damit befassen.

Wenn die Uhr zu gro&szlig; oder zu klein berechnet wurde (die R&auml;nder der Uhr 
werden z.B. teilweise einfach "abgeschnitten"), kann die gesamte Szene noch 
ein wenig skaliert werden. Dazu werden das "Auge"- und das "Skalieren"-
Symbol ("kleines Dreieck + gro&szlig;es Dreieck") in der Toolbox selektiert und 
die gesamte Szene in der "P"-Ansicht entsprechend ge&auml;ndert.

Die sp&auml;tere Gr&ouml;&szlig;e der WBClock-Textur sollte m&ouml;glichst schon mittels Cinema 
festgelegt werden. Wer eine kleine Uhr m&ouml;chte, sollte auch die Grafik nicht 
zu gro&szlig; rendern lassen, da sp&auml;tere Skalierungen mit ArtEffect und PPaint 
nur unter einem sichtbaren Qualit&auml;tsverlust m&ouml;glich sind. Am besten ist es, 
wenn die Grafik schon in der gew&uuml;nschten Gr&ouml;&szlig;e der sp&auml;teren WBClock-Textur 
erstellt wird. Dazu wird das Bildformat bei z.B. einer 99x99 Pixel kleinen 
Uhr (wundert euch nicht &uuml;ber diesen "99"-Wert, der wird sp&auml;ter noch 
erkl&auml;rt) auf ca. 103x103 Pixel gesetzt und die Szene soweit skaliert und 
verschoben, da&szlig; die R&auml;nder der Uhr gerade noch ohne abgeschnittene R&auml;nder 
im Bild sichtbar sind. Das fertig gerenderte Bild sollte dann etwa so 
aussehen.

Screenshot:
<IMG SRC="../extra/WBClock5.jpg" ALT="Screenshot">

Der Hintergrund ist in dem Bildchen noch zu dunkel. Das ist aber egal. Mit 
PPaint werden die schwarzen R&auml;nder sp&auml;ter sowieso "weggeschnitten". Wenn 
ihr meint, eure Uhr ist soweit gelungen, speichert ihr das Bild und die 
Szene ab.
Falls das Bild noch zu hell oder zu dunkel ist oder noch nicht genau die 
richtige Gr&ouml;&szlig;e hat, &auml;ndert ihr das am einfachsten in einer 24Bit-f&auml;higen 
Bildverarbeitung eurer Wahl. PPaint sollte daf&uuml;r m&ouml;glichst nicht verwendet 
werden.

Startet jetzt PPaint. Zuerst stellt ihr die "Farbenreduzierung" im Men&uuml; 
"Voreinstellungen" auf "Qualitativ" und die "Farbneuberechnung" im selben 
Men&uuml; auf "Floyd Steinberg" und "Beste Qualit&auml;t". Der Bildschirm sollte &uuml;ber 
256 Farben verf&uuml;gen. Die gerenderte Grafik mu&szlig; jetzt als "Pinsel" geladen 
werden (F5 dr&uuml;cken). Wenn PPaint mit dem Laden und "Runterrechnen" fertig 
ist, sollte die Pinsel-Palette als Bildschirm-Palette verwendet werden. 
Geht dazu in das Men&uuml; "Farbe/Palette/Von Pinsel" oder dr&uuml;ckt einfach "alt" 
+ "b". Setzt den Pinsel jetzt erst mal irgendwo in die Bildschirmmitte. Im 
Men&uuml; "Voreinstellungen/Transparenz" mu&szlig; der Men&uuml;punkt "Hintergrundfarbe" 
angew&auml;hlt sein. Schneidet die eben abgesetzte Grafik wieder als Pinsel aus 
und entfernt mit "alt" + "e" alle unbenutzten Bereiche des Pinsels. Dr&uuml;ckt 
jetzt einmal "alt" + "i". Damit bekommt ihr die Pinsel-Informationen. 
Wichtig! Die Grafik mu&szlig; in der H&ouml;he und der Breite eine ungerade 
Pixelanzahl haben, damit WBClock das Zifferblatt in der Mitte der Textur 
zentrieren kann. Also ein Wert von 99x99 Pixel oder 101x101 Pixel ist 
ideal. (So, das war die Erkl&auml;rung f&uuml;r den "99"-Pixelwert. ;)) Falls das 
nicht der Fall sein sollte, versucht die H&ouml;he und Breite des Pinsels um 
einen Pixel zu &auml;ndern. PPaint stellt daf&uuml;r ein ARexx-Skript, genannt "Brush 
Format", zur Verf&uuml;gung.

Speichert jetzt den Pinsel im IFF-Format wieder ab und startet WBClock. 
Durch einen Doppelklick auf die Uhr kommt ihr zum Voreinsteller. Unter dem 
Reiter "Zeiger" stellt ihr den "Zeigertyp" auf "Rhombus" und die 
"Zeigerbreite" auf "d&uuml;nn". Im Reiter "Ziffernblatt" stellt ihr den 
Hintergrund auf "Transparentes Bild". Unter "Bildname" w&auml;hlt ihr eure 
abgespeicherte Textur aus.
Der Haken bei "Oval" und "Automatisch" mu&szlig; gesetzt sein. &Auml;ndert den 
"Radius" auf 90 Prozent. Unter "Farben" k&ouml;nnt ihr die Farben und 
Umrandungen der Zeiger definieren. Wie ich finde, sieht der Minuten-Zeiger 
in "Rot" mit schwarzer Umrandung und der Stundenzeiger in "Wei&szlig;", ebenfalls 
mit schwarzer Umrandung, am Besten aus.

Screenshot:
<IMG SRC="../extra/WBClock6.jpg" ALT="Screenshot">

So, das war der Rundholz-Workshop. :) Ich hoffe, er hat euch gefallen. Wenn 
ihr das Material zu diesem Workshop haben m&ouml;chtet, k&ouml;nnt ihr euch das 
Archiv von unserer Homepage &uuml;ber die URL 
http://www.mediaspace.net/amigaaktuell/deutsch/downld/rundholz.lha 
herunterladen. In dem Archiv ist die fertige Textur, eine 
Voreinstellerdatei f&uuml;r WBClock und die Cinema4D-Szene enthalten. Wenn ihr 
Fragen oder Meinungen zu diesem Workshop habt, dann schreibt mir eine Mail.

Christian Aichinger &lt;christian@aakt.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
