<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sekalaiset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" vlink="navy" alink="red" leftmargin="0" marginheight="0" marginwidth="0" topmargin="0">
		<center>
			<a name="top"></a>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font></td>
				</tr>
			</table>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="navy" width="100%"><font size="3" color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Sharp EL-6053 - j&auml;rjestyst&auml; halvalla</b></font></td>
				</tr>
				<tr height="15">
					<td align="center" bgcolor="#d8ecfd" width="100%" height="15"><font size="2" color="#000066" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Per&auml;aho &lt;<a href="mailto:janne.peraaho@surfeu.fi">janne.peraaho@surfeu.fi</a>&gt;</font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>K&auml;mmenmikrolla pystyy nyky&auml;&auml;n tekem&auml;&auml;n melkein kaikkea sit&auml; mit&auml; p&ouml;yt&auml;koneellakin, ja lis&auml;ksi se kulkee k&auml;tev&auml;sti k&auml;ytt&auml;j&auml;ns&auml; mukana. K&auml;mmenmikrojen hy&ouml;dyllisin ja suosituin k&auml;ytt&ouml;tarkoitus lienee kuitenkin ajanhallinta ja muistiinpanojen tekeminen eli taskun pohjalla lojuvan paperikalenterin, kyn&auml;n ja muistilappujen korvaaminen digitaalisella apurilla. Jos k&auml;mmenmikrojen hinnat hirvitt&auml;v&auml;t, mutta haluat kuitenkin p&auml;&auml;st&auml; eroon nahkakantisesta kalenterista ja sormiin sidotuista langoista, on Sharpin elektroninen muistikirja edullinen vaihtoehto.</b></font></td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr>
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Hintaisekseen monipuolinen </font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Hintaansa n&auml;hden yll&auml;tt&auml;v&auml;n paljon toimintoja sis&auml;lt&auml;v&auml; EL-6053 on tummansininen, hieman taskulaskinta suurempi kapistus, joka muistuttaa ja muistaa puolestasi, kertoo kellonajan, toimii laskimena sek&auml; muuntaa valuuttoja ja mittoja. Kaiken t&auml;m&auml;n lis&auml;ksi Sharp on ahtanut muistikirjaan viel&auml; sormin&auml;pp&auml;ryytt&auml; vaativan &quot;Alpha Attack&quot; -pelin.<br>
						</font>
						<table width="100%" border="0" cellspacing="2" cellpadding="0">
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
							<tr>
								<td rowspan="2" valign="top" width="50%"></td>
								<td valign="top">
									<div align="center">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><img src="kuvat/auki.jpg" alt="" height="236" width="252" border="1"></font></div>
								</td>
								<td rowspan="2" valign="top" width="50%"></td>
							</tr>
							<tr>
								<td valign="top">
									<div align="left">
										<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Pieni mutta pippurinen.</font></div>
								</td>
							</tr>
							<tr>
								<td colspan="3" valign="top"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">&nbsp;</font></td>
							</tr>
						</table>
						<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Sharp EL-6053:a myyd&auml;&auml;n kahdenlaisessa pakkauksessa: pieness&auml; pahvikotelossa (EL-6053) ja suuressa l&auml;pin&auml;kyv&auml;ss&auml; pakkauksessa (EL-6053B). Molemmat paketit sis&auml;lt&auml;v&auml;t erilaisesta painatuksesta huolimatta t&auml;sm&auml;lleen saman laitteen, Sharp EL-6053. T&auml;ss&auml; testiss&auml; arvioidaan suurempaan pakkaukseen suljettua EL-6053:a.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laitteen mukana seuraa englannin-, ruotsin- ja suomenkielinen ohjekirja sek&auml; valmiiksi asennettu paristo. Muistikirja otetaan k&auml;ytt&ouml;&ouml;n vet&auml;m&auml;ll&auml; laitteen takana oleva virransy&ouml;t&ouml;n est&auml;v&auml; muoviliuska pois pariston pidikkeen kannen v&auml;list&auml;. T&auml;m&auml;n j&auml;lkeen on suositeltavaa nollata EL-6053 &quot;Reset&quot;-painikkeella, joskaan se ei ole v&auml;ltt&auml;m&auml;t&ouml;nt&auml;. EL-6053:ssa on seitsem&auml;n toimintotilaa: peli, puhelinmuistio, kalenteri, muistio, kello, laskin ja yksik&ouml;iden muunto. Toimintotilan valitsemiseksi laitteessa on kuusi kuvasymbolein varustettua painiketta, joista yksi on jaettu laskimen ja muuntotoiminnon valintapainike.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Muuntotoiminto sis&auml;lt&auml;&auml; valuutan ja mittayksik&ouml;iden muunnon (tuumista senteiksi ja p&auml;invastoin), joista valuutan muuntaminen on uudelleenohjelmoitavissa. Jos tuotteiden arvon hahmottaminen euroina tuntuu vaikealta, voi laitteen ohjelmoida helposti oletuksena olevasta euro-dollari-konversiosta euro-markka-muuntimeksi. Muuntamisessa n&auml;yt&ouml;ll&auml; n&auml;kyv&auml;t selv&auml;kielisen&auml; muunnettavat yksik&ouml;t, muuntokerroin ja muunnon suunta, joka ilmaistaan k&auml;tev&auml;sti yksik&ouml;iden v&auml;liss&auml; olevalla nuolella. Muunnettava arvo n&auml;pp&auml;ill&auml;&auml;n, painetaan joko vasenta tai oikeaa nuolin&auml;pp&auml;int&auml; riippuen siit&auml; kumpaan yksikk&ouml;&ouml;n lukema halutaan muuntaa, ja muunnettu arvo ilmestyy n&auml;yt&ouml;lle.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Ohjelmoinnissa kirjoitetaan muunnettavien valuutoiden nimet ja muuntokerroin (esimerkiksi EURO, FIM, 5.95), mink&auml; j&auml;lkeen uusi valuuttamuunnin on valmis k&auml;ytt&ouml;&ouml;n. Jos valuuttojen muuntamisen sijasta tarvitset enemm&auml;n esimerkiksi painoyksik&ouml;iden muuntamista, mik&auml;&auml;n ei est&auml; kirjoittamasta rahayksik&ouml;iden nimien tilalle painoyksik&ouml;it&auml;. EL-6053:n laskin on tavallinen peruslaskin, joka sis&auml;lt&auml;&auml; yhteen-, v&auml;hennys-, kerto-, jako- ja prosenttilaskun sek&auml; neli&ouml;njuuren laskemisen. Lis&auml;ksi laskimessa on yhden arvon muistitoiminnot.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kellossa on kaksi tilaa: paikallisen ajan n&auml;ytt&ouml; ja maailmanajan n&auml;ytt&ouml;. Molemmilla n&auml;yt&ouml;ill&auml; esitet&auml;&auml;n kellonaika, viikonp&auml;iv&auml;, p&auml;iv&auml;ys ja kaupungin nimi. Maailmanajan n&auml;yt&ouml;ll&auml; voidaan selata suurkaupunkeja, jolloin esitett&auml;v&auml;t tiedot muuttuvat kaupungin sijainnin (aikavy&ouml;hykkeen) mukaan. Laitteeseen on talletettu p&auml;&auml;s&auml;&auml;nt&ouml;isesti yksi kaupunki yht&auml; aikavy&ouml;hykett&auml; kohti, mik&auml; tarkoittaa, ett&auml; suomalaisia kaupunkeja sielt&auml; ei l&ouml;ydy. T&auml;st&auml; ei kuitenkaan ole suurta haittaa, koska paikallisen ajan n&auml;yt&ouml;ll&auml; olevan kaupungin nimen voi m&auml;&auml;ritell&auml; itse.<br>
							<br>
						</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kellonajan esitysmuoto voidaan valita 12- ja 24-tuntisen ajann&auml;yt&ouml;n v&auml;lilt&auml;. P&auml;iv&auml;yksen saa n&auml;kym&auml;&auml;n joko DD/MM/YYYY-, YYYY/MM/DD- tai MM/DD/YYYY-muodossa, mutta viikonp&auml;iv&auml; esitet&auml;&auml;n aina kolmikirjaimisena lyhenteen&auml;. Kello tukee my&ouml;s kes&auml;aikaa, joka voidaan m&auml;&auml;ritt&auml;&auml; erikseen paikalliseen aikaan ja maailmanaikaan. Kes&auml;aikaan ja talviaikaan siirtyminen k&auml;y k&auml;tev&auml;sti napin painalluksella - toiminto, jonka soisi olevan kaikissa kelloissa - eik&auml; kelloa n&auml;in ollen tarvitse rukata vaivalloisesti uuteen aikaan kellonajan asettamisen kautta.</font></td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">H&auml;lytt&auml;&auml;, muistaa ja muistuttaa</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">EL-6053:ssa on kolmenlaisia h&auml;lytystoimintoja: p&auml;ivitt&auml;inen h&auml;lytys, tasatuntih&auml;lytys ja kalenterih&auml;lytys. P&auml;ivitt&auml;inen h&auml;lytys toimii tavallisen her&auml;tyskellon tapaan eli se h&auml;lytt&auml;&auml; tiettyn&auml; kellonaikana p&auml;iv&auml;st&auml; riippumatta. Tasatuntih&auml;lytys antaa &auml;&auml;nimerkin tasatunnein ja kalenterih&auml;lytys muistuttaa kalenteriin merkityst&auml; tapahtumasta eli h&auml;lytt&auml;&auml; p&auml;iv&auml;yksen ja kellonajan perusteella. Kaikki h&auml;lytys&auml;&auml;net ovat erilaisia ja varsin mietoja piippaus&auml;&auml;ni&auml; verrattuna k&auml;nnyk&ouml;ihin ja her&auml;tyskelloihin. Tasatuntisignaalina ja muistutus&auml;&auml;nin&auml; ne ovat aivan kelvollisia, mutta her&auml;tyskelloksi laitteesta ei ole.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Muistio on tarkoitettu pienten muistilappujen kirjoittamiseen. Yhteen lappuun voidaan kirjoittaa 78 merkki&auml;, joista korkeintaan 36 voi olla kirjaimia loppujen ollessa numeroita. Laite j&auml;rjest&auml;&auml; muistilaput automaattisesti sis&auml;ll&ouml;n mukaan aakkosj&auml;rjestykseen. Lappuja voidaan selata eteen- ja taaksep&auml;in yksi kerrallaan, ja my&ouml;s lapun hakeminen ensimm&auml;isten merkkien perusteella on mahdollista. Lappujen sis&auml;lt&ouml;&auml; p&auml;&auml;see muokkaamaan ja niit&auml; voi poistaa.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kalenteriin voidaan tallettaa tapaamisia, tapahtumia ja muistutuksia halutun p&auml;iv&auml;n kohdalle haluttuun aikaan. Merkint&auml;&auml; teht&auml;ess&auml; sy&ouml;tet&auml;&auml;n korkeintaan 36 merkin pituinen selite, p&auml;iv&auml;ys ja kellonaika. P&auml;iv&auml;yksen ja ajan mukaan j&auml;rjestyv&auml;&auml; kalenteria voidaan selata muistion tapaan, siihen voidaan tehd&auml; hakuja, merkint&ouml;j&auml; voidaan poistaa ja muokata. Laitteen kalenterimerkinn&auml;n h&auml;lytt&auml;misess&auml; on muutama ep&auml;k&auml;yt&auml;nn&ouml;llisyys. Ensiksi kalenterih&auml;lytys h&auml;lytt&auml;&auml; juuri siihen aikaan, mille merkint&auml; on tehty. Jos kyseess&auml; on tapaaminen, olet auttamattomasti my&ouml;h&auml;ss&auml; kuullessasi laitteen piipityksen. Asia korjautuu kyll&auml; helposti merkitsem&auml;ll&auml; kalenteriin varhaisempi aika, mutta silloin merkint&auml; ei kerro en&auml;&auml; todellista tapaamisaikaa.<br>
								<br>
								
							Toinen ja varsin &auml;rsytt&auml;v&auml; piirre on, ett&auml; h&auml;lytt&auml;ess&auml; laite ei n&auml;yt&auml;, mist&auml; tapahtumasta on kysymys. Se siirtyy kyll&auml; kalenteritoimintoon, mutta siin&auml; kaikki. Jotta kyseinen tapahtuma l&ouml;ytyisi, on kalenteria selattava merkint&auml; kerrallaan. Koska merkinn&auml;t ovat aikaj&auml;rjestyksess&auml; eik&auml; laite poista automaattisesti menneit&auml; tapahtumia, voi selailu ruveta &auml;rsytt&auml;m&auml;&auml;n pitemm&auml;n p&auml;&auml;lle, varsinkin jos kalenterissa on paljon tapahtumia. Ainoaksi vaihtoehdoksi j&auml;&auml;kin, ett&auml; kuittaa kalenterimerkinn&auml;n poistamalla sen heti tapahtuman j&auml;lkeen. T&auml;ll&ouml;in kalenterih&auml;lytyksen syy selvi&auml;&auml; aina yhdell&auml; napin painalluksella.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Puhelinmuistiossa on kaksi erillist&auml; kantaa, mik&auml; onkin varsin hy&ouml;dyllinen ominaisuus, jos haluaa esimerkiksi pit&auml;&auml; henkil&ouml;kohtaiset kontaktit erill&auml;&auml;n yrityskontakteista. Yhteen tietueeseen talletetaan nimi, osoite, s&auml;hk&ouml;postiosoite ja kaksi puhelinnumeroa. Kaikki kent&auml;t ovat saman pituisia, 36 merkki&auml;, nimikent&auml;n ollessa pakollinen. Muistioon talletettuja tietoja voidaan muuttaa j&auml;lkik&auml;teen, tietueita voidaan poistaa, niit&auml; voidaan selata ja tietueiden nimikenttiin kohdistuvia hakuja voidaan tehd&auml;.</font></div>
					</td>
				</tr>
			</table>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica"><br>
			</font>
			<table width="80%" border="0" cellspacing="1" cellpadding="3" bgcolor="navy">
				<tr valign="middle">
					<td align="center" bgcolor="#b0c4de" width="50%">
						<table border="0" cellspacing="0" cellpadding="0" align="right" height="20">
							<tr>
								<td><a title="Alkuun" href="#top" target="_self"><img src="../../framet/grafiikka/top.gif" alt="alkuun" height="14" width="15" border="0"></a></td>
							</tr>
						</table>
						<b><font size="3" face="Trebuchet MS,Verdana,Arial,Helvetica">Miinuksiakin l&ouml;ytyy</font></b></td>
				</tr>
				<tr>
					<td bgcolor="#d8ecfd" width="50%">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tietojen sy&ouml;tt&auml;minen EL-6053 on suhteellisen vaivatonta, kiitos kirjoituskonemallisen n&auml;pp&auml;imist&ouml;n. Ainoastaan &auml;-ja &ouml;-kirjainten kirjoittaminen tuottaa vaikeuksia, koska ne saa esille vasta useiden per&auml;kk&auml;isten painallusten j&auml;lkeen a- ja o-painikkeiden takaa. Laitteella on my&ouml;s ik&auml;v&auml; taipumus vaihtaa Caps Lockin tilaa tietojen sy&ouml;t&ouml;n aikana niin, ett&auml; pienten kirjainten k&auml;ytt&ouml; vaikeutuu. Jos tyytyy kirjoittamaan nimet ja muistiinpanot isoilla kirjaimilla, ei ongelmia ole, mutta jos haluaa k&auml;ytt&auml;&auml; my&ouml;s pieni&auml; kirjaimia, saa Caps Lockin tilaa olla vaihtamassa koko ajan.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kaikki muistikirjaan sy&ouml;tetyt tiedot voidaan salata tietojen sy&ouml;tt&ouml;vaiheessa niin, ett&auml; niihin p&auml;&auml;see k&auml;siksi ainoastaan salasanan avulla. T&auml;m&auml; menettely ei tunnu oikein toimivalta. Yksinkertaisempaa olisi, jos laitteen voisi halutessaan lukita salasanalla. Koska salauksen saa vain yksitt&auml;isille tietueille erityist&auml; tallennustapaa k&auml;ytt&auml;en, eik&auml; salaamattomia tietoja voi muuttaa my&ouml;hemmin helposti salatuiksi tai p&auml;invastoin, j&auml;&auml; tietojen salaus varmasti useimmilta k&auml;ytt&auml;jilt&auml; tekem&auml;tt&auml;.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laitteen &quot;Alpha Attack&quot; -peli on yll&auml;tt&auml;v&auml;n hauska, vaikka se kuulostaa tavattoman tyls&auml;lt&auml;. Tarkoituksena on poistaa koneen n&auml;yt&ouml;lle vieritt&auml;mi&auml; merkkej&auml; niiden ilmestymisj&auml;rjestyksess&auml; painamalla merkki&auml; vastaavaa n&auml;pp&auml;int&auml; n&auml;pp&auml;imist&ouml;lt&auml;. Pelin vauhti kiihtyy koko ajan, kunnes oikeita n&auml;pp&auml;imi&auml; ei en&auml;&auml; mitenk&auml;&auml;n ehdi l&ouml;yt&auml;&auml; ajoissa. Satunnaisen merkkipommituksen lomaan pelaajan avuksi saattaa rullata bonuksia kirjainten muodossa. Yksi t&auml;llainen bonus on kirjainyhdistelm&auml; HELP.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">EL-6053 k&auml;ytt&ouml;liittym&auml;n kielen voi valita seitsem&auml;st&auml; vaihtoehdosta, joista valitettavasti yksik&auml;&auml;n ei ole suomi. Oletuksena oleva englanti ei varmaan tuota nyky&auml;&auml;n en&auml;&auml; kenellek&auml;&auml;n vaikeuksia, mutta olisihan laitetta kuitenkin mukavampi k&auml;ytt&auml;&auml; omalla &auml;idinkielell&auml;. Ilmeisesti juuri k&auml;ytt&ouml;liittym&auml;n monikielisyydest&auml; johtuen poistotoiminto on toteutettu ep&auml;loogisesti. Poistettaessa n&auml;ytt&ouml;&ouml;n tulee varmistava teksti &quot;DELETE?&quot;. Kehotteeseen ei vastata Y tai N, kuten luulisi, vaan vahvistus poistolle annetaankin painamalla &lt;ENTER&gt;-painiketta ja peruminen tapahtuu N-vastauksen sijasta painamalla &lt;C-CE&gt;-painiketta.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Laitteen hyviin puoliin, edell&auml; mainittujen lis&auml;ksi, voidaan lukea halpa hinta, n&auml;pp&auml;in&auml;&auml;nten p&auml;&auml;lle/pois-kytkin, viimeisen toimintotilan muistaminen virran katkaisun j&auml;lkeen sek&auml; se, ett&auml; vaivalla sy&ouml;tetyt puhelin- yms. tiedot eiv&auml;t katoa muistista pariston vaihdon yhteydess&auml;. Huonoja puolia ovat taasen herk&auml;sti rikkoutuva muovinen kansi, pieni ja hyvin kapean katselukulman omaava n&auml;ytt&ouml; sek&auml; heikot tietojen varmuuskopiointivalmiudet.<br>
								<br>
							</font><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kokonaisuudessaan laitteen hyv&auml;t ja huonot puolet ovat aika tasan. K&auml;mmenkoneelle EL-6053:sta ei ole vastusta, mutta paperisen kalenterin ja muistilaput se haastaa toden teolla. Hintaansa n&auml;hden se on kelpo kokonaisuus ja ehdottomasti kokeilemisen arvoinen.</font></div>
					</td>
				</tr>
			</table>
			<br>
			<table width="80%" border="0" cellspacing="1" cellpadding="4" bgcolor="navy">
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Valmistaja:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://sharp-world.com/index.html" target="_blank">Sharp Corporation</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Maahantuoja:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.perkko.fi" target="_blank">Perkko Oy</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Myyj&auml;:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="http://www.anttila.fi" target="_blank">Anttila</a></font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hinta:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">16,65 e (99 mk)</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Kielet:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Englanti, hollanti, portugali, italia, saksa, ranska, espanja</font></td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Ominaisuudet:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">N&auml;ytt&ouml;: 12 x 3 merkki&auml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Muisti: 8 kt</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Virtal&auml;hde: yksi litium-paristo (3 V)</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Paino: 88 grammaa</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Mitat: 125,0 mm (leveys) x 86,3 mm (syvyys) x 12,0 mm (korkeus)</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Hyv&auml;&auml;:</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">edullinen hinta</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">napakka QWERTY-n&auml;pp&auml;imist&ouml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">muisti ei tyhjene pariston vaihdon yhteydess&auml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">ohjelmoitava yksikk&ouml;muunnin</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">tuki kes&auml;ajalle</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">maailmanaika</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Huonoa:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd">
						<ul>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">ei suomenkielist&auml; k&auml;ytt&ouml;liittym&auml;&auml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">heppoinen kansi</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">n&auml;yt&ouml;n kapea katselukulma</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">tietojen varmuuskopiointi ty&ouml;l&auml;st&auml;</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">automaattinen kirjasinkoon valinta</font>
							<li><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">tietojen salaus turhan mutkikasta</font>
						</ul>
					</td>
				</tr>
				<tr>
					<td valign="top" bgcolor="#d8ecfd" width="98">
						<div align="left">
							<font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><b>Yleisarvosana:&nbsp;&nbsp;</b></font></div>
					</td>
					<td valign="top" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">75 %</font></td>
				</tr>
			</table>
			<table border="0" cellspacing="0" cellpadding="12">
				<tr>
					<td><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="hakemisto.html" target="_self">Testit</a></font>&nbsp;&nbsp;&nbsp;<img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="#top" target="_self">Sivun alkuun</a>&nbsp;&nbsp;&nbsp;</font><img src="../../framet/grafiikka/bullet.gif" alt="" height="8" width="8" border="0" hspace="6"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="../sivukartta.html" target="_self">Sivukartta</a></font>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>
				</tr>
			</table>
		</center>
	</body>

</html>