<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Abschlie&szlig;end
------------

"Durchhalten" hei&szlig;t die Parole

Nicht nur ich, sondern auch andere Redaktionsmitglieder m&uuml;ssen leider zur 
Kenntnis nehmen, dass die allermeisten Leser momentan keine Motivation 
besitzen, sich an AMIGA aktuell zu beteiligen. Trotz immer noch leicht 
ansteigender Abonnentenzahlen - momenten sind es allein etwa 900 Leser, die 
sich das Magazin jeden Monat per E-Mail zuschicken lassen -, was angesichts 
der Amiga-Lage sicher nicht gegen AMIGA aktuell spricht, geht die Anzahl 
der Beitr&auml;ge leider zur&uuml;ck. Das betrifft sowohl redaktionelle Artikel, wie 
etwa Testberichte, als auch Aktionen, wie etwa das Gewinnspiel und die FD-
Hitparade sowie das ganz normale Feedback.
Auch Aufrufe verhallen in der Regel (beinahe) ungeh&ouml;rt, als Beispiel sei 
hier nur mein Vorschlag zur Schaffung einer AMIGA-aktuell-Mailingliste 
genannt, auf den bisher nur zwei Leser reagiert haben (beide &uuml;brigens 
positiv). 
Zwar gibt es eine Reihe zuverl&auml;ssiger und flei&szlig;iger Mitarbeiter, die Monat 
f&uuml;r Monat Artikel abliefern, wof&uuml;r ich Ihnen an dieser Stelle meinen 
herzlichsten Dank aussprechen m&ouml;chte (die betreffenden Personen werden 
wissen, dass sie gemeint sind), doch insbesondere Helfer, die unregelm&auml;&szlig;ig 
Beitr&auml;ge beisteuern, fehlen momentan fast v&ouml;llig.
Die derzeit schlechte Beteiligung mag daran liegen, dass ein nicht geringer 
Teil der Leser mit dem heutigen Amiga bereits "abgeschlossen" hat und mit 
Ungeduld auf dessen Nachfolger warten. Denn wie ich aus Zuschriften wei&szlig;, 
w&auml;chst der Anteil derjenigen Leser, die gar nicht mehr &uuml;ber einen 
(Hardware-)Amiga verf&uuml;gen, relativ schnell. Und auch, dass immer mehr Leser 
ihre Online-Aktivit&auml;ten mittlerweile mit einem anderen Computersystem 
durchf&uuml;hren, mag als ein Indiz daf&uuml;r gewertet werden k&ouml;nnen, dass der 
jetzige Amiga von vielen oft nur noch als Zweitcomputer gesehen wird.
Ich sp&uuml;re es ganz deutlich: Beim heutigen Amiga-Markt geht es allm&auml;hlich 
wirklich ans Eingemachte. Wenn - und das ist nur eines von vielen 
Beispielen - selbst unser Paradepferd, das Aminet, aufgrund teilweise 
wochenlang ausfallender bzw. sogar v&ouml;llig au&szlig;er Betrieb genommener Server 
immer mehr in Mitleidenschaft gezogen wird, ist das ein sehr ernstes 
Zeichen.
Nein, keine Sorge, ich komme hier nicht mit hohlen Phrasen wie etwa "Der 
Amiga ist tot" o.&Auml;., aber die Gr&ouml;&szlig;e des Marktes n&auml;hert sich mit gro&szlig;en 
Schritten dem Atari-Niveau an, sprich: Die heute aktiven Amiga-Nutzer sind 
die treuesten Anh&auml;nger, die man sich bei einem Computersystem vorstellen 
kann. Nur reicht das f&uuml;r dessen &Uuml;berleben nicht aus, neue Anwender m&uuml;ssen 
her - womit wir wieder bei den Zukunftsaussichten w&auml;ren.
Da zumindest ich fest davon ausgehe, dass das neue Amiga-Betriebssystem 
nicht nur relativ bald erscheint, sondern auch von gro&szlig;en Teilen der Amiga-
Anwender und vielen anderen Computernutzern entweder begeistert aufgenommen 
oder zumindest als ihr neues OS akzeptiert werden wird, sehe ich die oben 
geschilderte Problematik, von der im &Uuml;brigen nicht nur AMIGA aktuell, 
sondern die allermeisten Amiga-Medien (im weitesten Sinne) betroffen sind, 
als zeitweiliges Handicap an. (Nichtsdestotrotz werde ich in der n&auml;chsten 
Ausgabe eine kleine Umfrage durchf&uuml;hren, an der sich jeder Leser beteiligen 
sollte.)

Betrachten wir die Lage doch einmal realistisch: Wann zuletzt standen die 
Chancen f&uuml;r einen neuen Amiga besser? Sowohl die internen, als auch die 
externen Faktoren betreffend, besteht Grund zum Optimismus:

* AMIGA ist erstmals seit dessen Erwerb durch Commodore eigenst&auml;ndig, kann  
  also &uuml;ber seine Produktstrategie weitestgehend selbst entscheiden.

* War ich bei Bekanntwerden der Amiga-&Uuml;bernahme durch Bill McEwen und       
  Fleecy Moss am Silvesterabend 1999 noch etwas skeptisch, ob das           
  Unternehmen nicht nur den Willen, sondern auch das finanzielle Potential  
  besitzt, einen Amiga-Nachfolger auf den Markt zu bringen, so haben sich   
  diese Zweifel gl&uuml;cklicherweise nicht bewahrheitet. Nein, AMIGAs Geldgeber  
  hei&szlig;t nicht Jim Collas (er hat - entgegen fr&uuml;heren Spekulationen und gar  
  Informationen aus glaubw&uuml;rdigen Quellen - auch sonst nichts mit AMIGA zu  
  tun, das hat Bill McEwen nicht nur einmal versichert). Die Finanziers     
  sind vielmehr einige Global Players, also (wirklich ohne &Uuml;bertreibung)    
  weltbekannte Unternehmen. Wenn diese den neuen Amiga aktiv unterst&uuml;tzen,  
  wird das ein enormer Vorteil sein.

* In wenigen Wochen erscheint das Amiga-Entwicklersystem, der erste Schritt  
  zum neuen Amiga. Noch nie seit dem Commodore-Konkurs sind wir soweit      
  gekommen.

* Microsoft, schwerwiegender Verst&ouml;&szlig;e gegen den Wettbewerb bezichtigt,      
  k&auml;mpft mit der US-Justiz um den Erhalt des Unternehmens und wird es ganz  
  sicher nicht wagen, eben das, was dem Unternehmen vorgeworfen wird, bei   
  AMIGA durchzuf&uuml;hren.

* Die M&auml;rkte und Unternehmen sind offener denn je f&uuml;r alternative           
  Betriebssysteme.

Sicherlich lassen sich hier noch weitere Argumente anf&uuml;hren, was ich mit 
diesen Beispielen aber nur zum Ausdruck bringen will, ist: Ein neues 
Betriebssystem hat momentan gute Chancen, sich auf dem Markt zu etablieren, 
d.h. ausreichende Anteile zu erobern, um langfristig &uuml;berleben zu k&ouml;nnen.
Jetzt ist es an AMIGA, das Beste daraus zu machen. Aber nicht nur an AMIGA: 
Nach Erscheinen des Entwicklerger&auml;ts sind alle Programmierer gefordert, dem 
neuen System mit zum Erfolg zu verhelfen. Denn je mehr Umsetzungen 
hochwertiger Amiga-Software es f&uuml;r den neuen Rechner geben wird, desto 
wahrscheinlicher ist dessen Erfolg. Ein E-Mail-Programm in der Qualit&auml;t von 
YAM beispielsweise sollte von Anfang an verf&uuml;gbar sein - und wieso dann 
nicht gleich das Original nehmen?
Es kommt also in den n&auml;chsten Monaten ma&szlig;geblich darauf an, dass auch die 
private Softwareentwicklung auf Touren kommt. Dies w&uuml;rde sich im Endeffekt 
als wichtiger strategischer Vorteil gegen&uuml;ber anderen neuen 
Betriebssystemen, die nicht &uuml;ber soviel Unterst&uuml;tzung verf&uuml;gen, erweisen.


Bis n&auml;chsten Monat,

euer

Carsten Schr&ouml;der

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
