<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Spiele-News aus aller Welt
-----------------------------

- Heretic II Demoversion erschienen

Diesen Monat war es endlich soweit: Das wohl meist erwartete Amiga
Spiel ist in einer spielbaren Demoversion erschienen. Die Heretic II
Demoversion von Hyperion Software fasst rund 40 Megabyte und ben&ouml;tigt
einen entsprechend leistungsf&auml;higen Amiga. Hier die Systemanforderungen:
PowerPC Prozessor, WarpOS4, 64 MB Ram, 70 MB Festplatten Platz, AGA
oder Grafikkarte, AHI 4. Optional ist eine Warp3D-kompatible Grafikkarte
f&uuml;r 3D Beschleunigung. Die Demoversion l&auml;sst sich von der Hyperion
Software Homepage laden.

- Hyperion Software rekapituliert

Hyperion Software feiert bald seinen 1. Geburtstag und nahm dies
zum Anlass, ein kleines Res&uuml;mee zu ziehen. Hyperion hat in dieser
Zeit eine eindrucksvolle Arbeit geleistet; so wurden einige Standards
der PC-Welt, wie z.B. f&uuml;r 3D Spiele oder Videokodierungen, auf den
Amiga portiert, die es nun erlauben, PC-Spiele viel einfacherer
zu portieren, da die entsprechenden Entwicklungsschnittstellen schon
am Amiga vorhanden sind. Au&szlig;erdem wurde auf der Hyperion Software
Homepage eine neue FAQ ver&ouml;ffentlicht. Insgesamt darf man in den
n&auml;chsten Monaten gespannt auf Hyperion Software Produkte blicken;
denn angesichts solch geleisteter Arbeit ist Hyperion sicherlich
ein sehr wichtiger Hoffnungstr&auml;ger in Sachen Amiga Spiele.

- Nightlong so gut wie fertig

clickBOOM hat bekanntgegeben, dass die Amiga-Portierung von
Nightlong fast fertig ist. F&uuml;r die PowerPC Version von Nightlong
lagen Anfang dieses Monats leider erst 150 Vorbestellungen vor,
was nicht sehr viel ist. clickBOOM wird trotzdem die PPC Entwicklung
vorantreiben und hofft weiter auf neue Vorbestellungen. Im
Portal von clickBOOM ist auﬂerdem ein neuer Trailer f&uuml;r Nightlong
erschienen. Die fertige Version von Nightlong soll in den n&auml;chsten
Wochen erscheinen. Einen Test k&ouml;nnt ihr dann hier lesen.

- Payback Entwicklung schreitet voran

Die Entwicklung von Payback ist diesen Monat kr&auml;ftig weitergegangen.
Einen neuen Statusreport k&ouml;nnt ihr auf http://www.apex-designs.net/
nachlesen.

- CD32 wieder im Aufwind?

Die letzte Zeit h&ouml;rt man immer wieder mal etwas &uuml;ber das CD32,
welches im Laufe der Jahre recht in Vergessenheit geraten ist.
So hat sich zum eine Gruppe mit dem Name CD32-Allianz gebildet,
die es sich zur Aufgabe gemacht hat, Entwickler zu motivieren,
sich wieder st&auml;rker auf das CD32 zu konzentrieren. Auch ist
Christian Steiner, Entwickler des bekannten PD-Spieles Sharks!
daran, eine CD32 Version seines Spieles zu ver&ouml;ffentlichen. Man
darf also gespannt sein. Sollte mal wieder etwas publiziert
werden, werde ich auf jeden Fall hier ein Test dar&uuml;ber schreiben,
da ich auch zu den stolzen Besitzern eines CD32's geh&ouml;re, von
welchem nur eine bescheidene St&uuml;ckzahl von 100 000 produziert
wurden.

- Dreamworlds Development

Seit langem gab es diesen Monat mal wieder etwas von Dreamworlds
Development zu h&ouml;ren. Die Support Seiten f&uuml;r ihr Spiel Crossfire II
wurden komplett &uuml;berarbeitet und mit neuen Screenshots versehen.
Au&szlig;erdem wird noch ein Grafiker gesucht, der die Entwicklung von
Crossfire II voran bringen k&ouml;nnte.

- Neue Version von GLQuake

Auf der Homepage von Frank Wille ist eine neue Version seiner
Quake Portierung GLQuake erschienen. Sie kann von der Homepage
des Autors http://devnull.owl.de/~frank/ geladen werden.

- Dweebs f&uuml;r den Amiga

Crystal Software Interactive hat auf AmigaFlame.co.uk exklusiv
bekanntgegeben, dass sie das erfolgreiche PC-Spiel Dweebs mit
den kleinen Knuddeltierchen auf den Amiga portieren. Eine genauen
Ver&ouml;ffentlichungsdatum wurde noch nicht genannt. Bei Fragen
soll man sich per E-Mail an Crystal Software wenden.

- Neues Foundation Addon

Epic Marketing hat eine neue Foundation Missions CD angek&uuml;ndigt:
Die Scheibe mit dem Namen "Foundation Mission CD: The Undiscovered Land"
enth&auml;lt ca. 40 neuer Missionen und ben&ouml;tigt eine Vollversion von
Foundation CD. Das Erscheinungsdatum der CD-ROM wurde mit Ende
Mai datiert.

- Apano Sin nun von V.A.K. Entertainment und CS&E

Apano Sin, welches urspr&uuml;nglich bei Alive Mediasoft erscheinen
sollte, wird nun in den n&auml;chsten Wochen bei V.A.K. Entertainment
in Deutschland und in Grossbritannien bei CS&E erscheinen. Bei
Apano Sin handelt es sich um ein klassisches Shoot-em-Up mit 6
verschiedenen Welten, die vom Spieler zu bew&auml;ltigen sind.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
