<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 4 / 2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Amiga Plus CD 4 / 2000</Font></Center></h1></P>

<p>Alle zwei Monate gibt`s eine neue A+ CD, die mitlerweile ja wieder f&#252;r
Qualit&#228;t bekannt ist. Einen kleinen &#220;berblick gibt`s nat&#252;rlich auch wieder
innerhalb der NC, wobei ich gleich vorwegnehmen kann, da&#223; auch die neue
Ausgabe das Niveau der Vorg&#228;nger halten kann.</P>

<p><h2><center><font color="yellow">The Same Procedure As Every Time...?</Font></Center></h2></P>
<p>Yup, ge&#228;ndert hat sich auf der vierten Amiga Plus CD in diesem Jahr nicht
viel, was immerhin den Vorteil hat, da&#223; alle jene, die mit den Vorg&#228;ngern
zufrieden waren (dazu z&#228;hle ich mich &#252;brigens auch!), auch von der neusten
Ausgabe nicht entt&#228;uscht sein werden. Einige Kleinigkeiten sind zwar noch
nicht zu 100% ausgereift (so m&#252;sste der Voreinsteller sowie das Updater
nochmal etwas &#252;berarbeitet werden), aber im gro&#223;en und ganzen macht auch die
A+ 4 / 2000 einen qualitativ hochwertigen und professionellen Eindruck. Und
da der gute Markus Castro versprochen hat, f&#252;r die f&#252;nfte CD einige
Neuheiten einzubringen, will ich hier auch nicht weiter rumnerven und
konzentriere mich lieber auf das wesentliche:</P>

<p><h2><Center><font color="white">Was ist auf der CD drauf?</Font></center></h2></P>
<p>An der bew&#228;hrten Verzeichnisstruktur hat sich selbstredent auch nix
ge&#228;ndert, so da&#223; ich, wie seit einigen Ausgaben &#252;blich, mal wieder alles von
oben nach unten durchgehe..</P>

<p><h3><b>Multimedia</h3></B></P>

<p><u>Sound:</u><BR>
<p>Wie &#252;blich sind hier mal wieder einige, qualitativ differierende MP3`s sowie
Mod`s zu finden, die stilistisch teilweise nicht sehr eng beieinander
liegen. Allerdings kann man von niemaden ernsthaft verlangen, s&#228;mtliche
&quot;Kompositionen&quot; auch noch in diverse Unterordner zu verteilen - hier wird
bestimmt f&#252;r jeden etwas dabei sein. Und wer mit Musik am heimischen Rechner
nicht viel anfangen kann, der l&#228;sst diesen Ordner einfach links liegen...</P>

<p><u>Videos:</u><BR>
<p>Hier ist lediglich der kurze Beitrag von Neues (auf 3.Sat) zu finden, die
in einer ihrer Sendungen mal kurz mit Petro sprachen und Elate
&quot;vorstellten&quot;. Das ganze befindet sich im HAM 8 Format, wobei die Qualit&#228;t
nicht ganz so die Offenbaarung ist. Ist der Film aber auch nicht...</P>

<p><u>GFX:</u><BR>
<p>Hier finden sich zahlreiche Icon Packs, sowohl f&#252;r MagicWB (ich glaube, ich
wiederhole mich, wenn ich sage, da&#223; ich MagicWB nicht so toll finde) als
auch New Icons / Glow Icons wieder, wobei diesesmal erstaunlich viele Spiele
gefeatured werden. Wem die Optik seiner WB wichtig ist, der sollte mal einen
Blick hier reinwerfen...</P>

<p><u>Homepage:</u><BR>
<p>Eine der gelungensten Neuheiten der neueren A+ CD`s sind die Homepages, die
auf der CD zum offline lesen vertreten sind. Diesesmal hat es, wie schon auf
der dritten Ausgabe in diesem Jahr, erneut die &quot;Pixelmaster HP&quot; sowie die
&quot;Manga@Amiga HP&quot;, die sich mit den japanischen Comic Zeichnungen
besch&#228;ftigt, auf die CD geschafft. Netter Zeitvertreib...</P>

<p><h3><b>Misc</h3></B></P>

<p><u>Data:</u><BR>
<p>Dieser Ordner wurde in letzter Zeit etwas stiefm&#252;tterlich behandelt, was
sich aber mit dieser Ausgabe &#228;ndert: Neben Guides zu einem weiten Spektrum
von Themen (AGA, Grafikkarten, Expansion, Amiga History etc.) ist hier auch
der bekannte &quot;Bibelforscher&quot; sowie &quot;XBase&quot; und &quot;MUIBase&quot; vertreten. F&#252;r
ausnahmslos deutsche User ist es aber schade, da&#223; viele Guides nur ein
Englisch vorliegen. Hierf&#252;r kann freilich der Zusammensteller aber nichts...</P>

<p><u>Mags:</u><BR>
<p>Im Guide Format begl&#252;cken uns die Mai Ausgabe der Amiga Aktuell sowie die
erste Ausgabe &#252;berhaupt des CD32 Outside Magagzins - wie man dem Namen nur
unschwer erkennen kann hat sich letzteres ganz dem CD32 verschrieben. In HTML
gibt`s nochmals die Amiga Aktuell sowie die 74. Ausgabe der allseits
beliebten NC, die Euch ja bekannt sein d&#252;rfte :-)))</P>

<p><h3><b>Games</h3></B></P>

<p><u>Previews &amp; Demos:</u><BR>
<p>Neben dem altbekannten Grafikpreview zu &quot;SOMS&quot; (hoffentlich kommt da bald
mal eine spielbare Demo), gibt`s auch Demos zu &quot;Homeland&quot;, &quot;GW24&quot; und
&quot;Heretic II&quot;. Leider verkauft sich letzteres bisher nur sehr schleppend und
ich hoffe doch, da&#223; sich daran noch gewaltig was &#228;ndern wird. Sp&#228;testens
wenn die neuen PPC Boards wieder in ausreichenden St&#252;ckzahlen erh&#228;ltlich
sind, wird auch der Verkauf von PPC only Software wieder zunehmen. Hoffen
wir nur, da&#223; sich Heretic II trotzdem ordentlich verkauft, denn ansonsten
k&#246;nnte Hyperion seine weiteren Aktivit&#228;ten einstellen, was uns Spiele wie
&quot;Die V&#246;lker&quot;, &quot;Shogo&quot; und &quot;Soldiers Of Fortune&quot; kosten w&#252;rde...</P>

<p><u>PD &amp; Starter</u><BR>
<p>Neben etwas PD Soft aus dem Aminet (wobei insbesondere die Demo von
&quot;Enforce&quot;, welches mitlerweile bedauerlicherweise eingestellt wurde, einen
hervorragenden Eindruck bei mir hinterlie&#223;) sind auch wieder einige Starter,
u.a. f&#252;r &quot;Rainbow Warrior&quot;, &quot;Fatal Mission&quot; und &quot;Mighty Bombjack&quot;, nebst der
aktuellen Version von &quot;JST&quot;, hier zu finden.</P>

<p><h3><b>PowerPC</h3></B></P>

<p><u>Tools:</u><BR>
<p>Nur zwei Eintr&#228;ge, n&#228;mlich der Abspieler &quot;Soft Cinema&quot; und &quot;PPCLibEmu&quot;,
haben es hierhin geschafft. Aber wie schon f&#252;r Heretic II gilt: Sobald sich
erstmal vern&#252;nftig die PPC Boards verkaufen, wird auch hier mehr zu finden
sein. Die Nachfrage ist ja bekanntlich da...</P>

<p><u>Emulatoren:</u><BR>
<p>F&#252;r Emulatoren ist der PPC, aufgrund seiner gewaltigen Rechenpower, geradezu
pr&#228;destiniert, auch wenn sich mit &quot;Handy&quot;, &quot;SOPE&quot; und &quot;Ami Generator&quot; auf
der aktuellen A+ CD nur drei Vertreter dieses Genres befinden.</P>

<p><u>Dev:</u><BR>
<p>Ebenfalls mit drei Ordnern ausgestattet ist der Developer Bereich beim PPC:
&quot;Warp3D&quot;, &quot;ChunkyPPC&quot; und &quot;PPCRelease&quot;.</P>

<p><u>Games:</u><BR>
<p>PPC-only Spiele sind bisher eher rar ges&#228;t, auch wenn sich hier mit &quot;Space&quot;
und &quot;Battalion&quot; immerhin zwei PD Vertreter f&#252;r den PPC befinden. Aus Mangel an einem PPC Board (welches aber sicherlich in Zukunft f&#228;llig ist), kann ich an dieser Stelle allerdings keine Aussagen &#252;ber die Qualit&#228;t machen.</P>

<p><u>Demos:</u><BR>
<p>Was auch schon f&#252;r die PPC-only Games galt, gilt nat&#252;rlich auch f&#252;r das
(leider?) einzigste PPC-only Demo mit dem Titel &quot;Fresh&quot;. Hier m&#252;sste sich
wirklich mal jemand mit PPC Karte zu Wort melden.</P>

<p><h3><b>Scene</h3></B></P>

<p><u>Demos &amp; Mags:</u><BR>
<p>Die Amiga-Szene ist nach wie vor mehr als nur aktiv und bietet Monat f&#252;r
Monat neue Highlights - und so haben es auch 7 wirklich hochkar&#228;tige Demos
(&quot;Bigfake&quot;, &quot;New World Child&quot;, &quot;Beats&quot;, &quot;BTTF&quot;, &quot;NEO2&quot;, &quot;CCT&quot; und
&quot;Stonehenge&quot;) sowie einige aktuelle Mags aus dem Szene Bereich auf die CD
geschafft. Wer sich f&#252;r Demos und &#228;hnliches interessiert, der wird in den
vorwiegend englischen Magazinen sicherlich einiges an Lesestoff finden.</P>

<p><h2><center><font color="Blue">Und sonst?</Font></center></h2></P>
<p>Tja, den Schwerpunkt der CD, die Tools, habe ich mal wieder aussen vor
gelassen, denn dieser Bereich ist einfach zu umfassend, um &#252;ber alles
berichten zu k&#246;nnen. Allerdings sei an dieser Stelle angemerkt, da&#223; es auch
diesesmal wieder alle aktuellen Programme, Treiber und Add-ons auf die CD
geschafft haben und der Bereich der Tools &#252;berdurchschnittlich gut gelungen
ist - was nicht zuletzt auch an der &#252;bersichtlichen Gliederrung in einzelne
Verzeichnisse / Unterverzeichnisse seitens des Zusammenstellers liegt. Als
Bonus sind hier ebenfalls nochmals die Commodore Support Files von Rainer
Benda zu finden, die auch schon auf der 3 / 2000 CD vertreten waren.</P>


<p><h1><center><FONT color="gray"> Fazit</font></center></h1></P>
<p>Zu dieser grundsoliden CD noch viel zu sagen er&#252;brigt sich wohl. Gro&#223;artige
Neuerungen gab es zwar keine, dennoch ist das Niveau erfreulich hoch und wer
schon von den anderen A+ CD`s, die in diesem Jahr bisher erschienen sind,
positiv &#252;berrascht war, der sollte auch bei der 4 / 2000 CD blind zugreifen;
wer der A+ CD immer noch kritisch gegen&#252;bersteht, sollte sich sp&#228;testens
anhand dieser neuen Ausgabe eines besseren belehren lassen.</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
