<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Foundation - The Undiscovered Land</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Foundation - The Undiscovered Land</Font></Center></h1></P>
<p><center><img src="ftul1.jpg"></Center></P>
<p>Bedingt durch die rapide Schrumpfung des Amiga Marktes
wurde der Spielemarkt f&#252;r unsere Freundin von den gro&#223;en Softwareh&#228;usern in den letzten Jahren
&#228;u&#223;erst stiefm&#252;tterlich behandelt. Die Folge waren Eigenkreationen, die zum
Gro&#223;teil von Hobby Programmierern und enthusiastischen Amiga Firmen
stammten, aber im direkten Vergleich mit PC- oder Konsolengames abfielen.
Eine r&#252;hmliche Ausnahme dieser Eigenkreationen ist &quot;Foundation&quot;, welches
sich seit der Erstver&#246;ffentlichung 1998 immer noch in stetiger Entwicklung
befindet und sich bei den Amiga Spielern gro&#223;er Beliebtheit erfreut. Neben
dem Original (1998) erschien 1999 der &quot;Director`s Cut&quot; und vor einigen
Wochen erschien die erste Mission CD mit dem Titel &quot;The Undiscovered Land&quot;,
die ich hier genauer unter die Lupe nehmen will.</P>

<p><h2><center><font color="yellow">Einige Dinge Vorweg...</Font></Center></h2></P>
<p>&quot;Foundation - TUL&quot; ben&#246;tigt, um zu laufen, auf jeden Fall die Original
Foundation CD oder dessen Nachfolger &quot;Foundation - Director`s Cut&quot;. Wer
nicht im Besitz einer dieser CD`s ist, der wird nicht in den Genuss der
Mission CD und einiger neuer Features kommen. Allerdings kann man dann immer
noch auf die auch gerade erschienene &quot;Gold Edition&quot; zur&#252;ckgreifen, die neben
der Mission CD auch die aktuelle Foundation Version enth&#228;lt, aber nat&#252;rlich
mit 79 DM, im Gegensatz zu 49 DM f&#252;r &quot;Foundation - TUL&quot;, auch etwas teurer
ist. Die Hardwareanforderrungen sollen an dieser Stelle der Vollst&#228;ndigkeit
halber nochmal erw&#228;hnt werden, da sich hier nichts ge&#228;ndert hat:</P><ul>
<p>
<li> AGA<br>
<li> 68030<br>
<li> 8 MB Fast Ram<br>
<li> HD mit 80 MB freiem Platz<br>
<li> CD Laufwerk</UL></P>

<p>Allerdings kann ich Euch eine Grafikkarte sowie einen schnelleren Prozessor
samt etwas mehr Fast Ram nur dringend empfehlen; insbesondere eine
Grafikkarte ist ein nahezu unabdingbares Muss, da zum einen der
Bildschirmaufbau stark beschleunigt wird und zum anderen h&#246;here Aufl&#246;sungen
als unter AGA gefahren werden k&#246;nnen, was f&#252;r ein Aufbaustrategiespiel wie
&quot;Foundation&quot; Sinn macht.</P>

<p><h2><center><font color="red">Nur eine Mission CD?</Font></Center></h2></P>
<p>Zentralaspekt von &quot;Foundation - TUL&quot; sind zwar die 40 neuen Missionen f&#252;r
das Original Foundation, aber auch unter der Haube hat sich (mal wieder)
etwas getan, denn auch das Programm liegt mitlerweile in Version 1.50 vor,
die, im Gegensatz zur 1.28 Version von &quot;Foundation - DC&quot;, wieder einige
Neuigkeiten mit sich bringt: Neben einer abermals beschleunigten
Grafikengine, die Geschwindigkeitvorteile mit sich bringt, besitzen
s&#228;mtliche Geb&#228;ude und Spielfiguren nun auch Statusanzeigen, wie man sie von
Strategiespielen wie &quot;Napalm&quot; kennt. Es ist nun als ohne Probleme sofort
m&#246;glich zu erkennen, ob eine Spielfigur besser in`s Krankenhaus gebracht
werden sollte oder ein Geb&#228;ude gerade vor dem Zusammefall steht. Ebenfalls neu sind
die integrierten Warnungen, die auf der oben (wahlweise rechts oder links) eingeklinkten Karte
mit verschiedenen Farben dargestellt werden. Sobald dort ein rotes
Warnsignal erscheint, sollte der Spieler schnell alles stehen und liegen
lassen, denn an der Stelle ist etwas sehr wichtiges, wie etwa ein Angriff
auf seine Siedlung, passiert. Ein wei&#223;es Warnsignal kann man demhingegen
erstmal mit etwas Gelassenheit betrachten, ist es doch meistens nichts
wirklich ernstes. Komplett gestrichen w&#252;rde &#252;brigens die Frucht &quot;Vegetable&quot;,
um die man sich als Spieler nun nicht mehr k&#252;mmern braucht.
Neben diesen Features, die im wesentlichen dem fl&#252;ssigeren
und schnelleren Spielablauf und damit nur dem Spieler zugute kommen sollen,
hat es auch einige Ver&#228;nderrungen innerhalb des Gameplays gegeben, die vor
allem die Verbesserung der vorhandenen Technologien betrifft: So kann man
nun schnelleres Sch&#252;rfen, verbessertes Fischen oder auch verbesserte Verteidigung &quot;erfinden&quot;. Auch die Effektivit&#228;t
der Geb&#228;ude kann gesteigert werden: Ein Krankenhaus kann z.B. bei entsprechendem
technologischen Fortschritt viel effektiver arbeiten, was der
Durchschnitsgesundheit der Bev&#246;kerung nur gut tun kann. Dar&#252;ber hinaus
gibt`s noch neue Keyboard Shortcuts, mit denen man u.a. auch nicht im
Einsatz befindliche Leute ausfindig machen kann. Alles in allem also
wirklich sinnvolle Neuerungen, die das ohnehin schon sehr gute Gameplay
weiter vereinfachen und dadurch f&#252;r weiterhin langanhaltenen Spielspa&#223;
sorgen.</P>
<p><center><img src="ftul3.jpg"></Center></P>

<p><b><u>Die Missionen:</U></B><br>
Aber eigentlich sollten ja nicht die Verbesserungen im Mittelpunkt von
&quot;Foundation - TUL&quot; stehen, sondern die 40 neuen Missionen. Auch hier hat
sich Paul Burkley einiges einfallen lassen: So sind die neuen Missionen, die
man so zu erf&#252;llen hat, um einiges abwechselungsreicher als die Originale
und sorgen f&#252;r Langzeitmotivation. Besonders hervorhebenswert ist die
Tatsache, da&#223; man u.U. auch schon &#252;ber eine fertige Siedlung verf&#252;gt und
nicht erst alles in stundenlanger Arbeit errichten muss, wie es ja bei den
40 Original Missionen der Fall war. Nat&#252;rlich wird man auch bei den neuen
Missionen von einem excellentem Raytraycing Picture begr&#252;&#223;t, die allesamt
wirklich phantastisch aussehen und f&#252;r eine gute Einstimmung auf die neue
Mission sorgen. Zudem wurden die Originalmissionen ein klein wenig
abge&#228;ndert und &#252;berarbeitet und auch die k&#252;nstliche Intelligenz der
Computergegner wurde gesteigert, so da&#223; auch Foundation Experten wieder eine
Herausforderrung finden. </P>
<p><center><img src="ftul2.jpg"></P><p>Eines der schönen Intropics...</P></Center>

<p><h1><center><font color="blue">Fazit</Font></Center></h1></P>
<p>&quot;Foundation - TUL&quot; ist eine lohnenswerte Investition f&#252;r all jene, die schon
im Besitz einer Original CD sind und diese durchgezockt haben. All jene
&quot;S&#252;chtigen&quot; wird die Mission CD abermals einigen schlaflose N&#228;chte vor dem
heimischen Rechner bescheren, die aber dank der neuen Missionen &#228;u&#223;erst
kurzweilig ausfallen d&#252;rften. Die zus&#228;tzlichen neuen Features rechtfertigen
zudem den ohnehin recht g&#252;nstigen Preis von 49 DM allemal. Wer jetzt auf den
Geschmack gekommen ist, aber weder &quot;Foundation&quot; noch &quot;Foundation -
Director`s Cut&quot; sein eigen nennt, der sollte auf die &quot;Gold Edition&quot; warten,
denn auf dieser wird sich auch die Mission CD befinden. Alles in allem
wieder einmal gute Arbeit von Paul Burkey f&#252;r eines der besten
Strategiespiele &#252;berhaupt!</P>

<CENTEr>
<TABLE BORDER="1" WIDTH="50%" BGCOLOR="#0000FF">
<CAPTION ALIGN="TOP"><b><h2>NoCover Info & Bewertung</B></H2></CAPTION><TR>
</TR><TR>
<TD>Anbieter</TD>
<TD>Epic Marketing</TD>
</TR>
<TR>
<TD>Preis</TD>
<TD>49 DM</TD>
</TR>
<TR>
<TD>Genre</TD>
<TD>Strategiespiel</TD>
</TR>
<TR>
<TD>Menge (in MB)</TD>
<TD>77</TD>
</TR>
<TR>
<TD>Fazit:</TD>
<TD>85 %</TD>
</TR>
</TABLE>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
