<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Leserbrief von Kilian Servais</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Leserbrief von Kilian &quot;The Bruce&quot; Servais</Font></center></h1></P>
<ul><P>
<li><a href="#alle.html">An Alle</A><BR></LI>
<li><a href="#oliver.html">An Oliver</A><BR></LI>
<li><a href="#yonder.html">An Yonder</A><BR></LI>
<li><a href="#top5.html">Top 5</A></LI></UL></P>
<hr>
<a name="alle.html">
<p><b>An Alle:</B><br>
Den letzten Monat hatte ich f&#252;r die NC, aufgrund meiner zwei w&#246;chigen
Abstinenz (war in Ungarn - war cool), nur sehr wenig Zeit, was sich
insbesondere auf die Quantit&#228;t meinerseits ausgewirkt hat. Ab n&#228;chsten Monat
kommt aber wieder etwas mehr - hoffentlich...</P>
<hr>
<a name="oliver.html">
<p><b>An Oliver:</B><BR>
Hi, ich war der, der den Photo Folio Test in der NC 75 geschrieben hatte.
Vielen Dank erstmal f&#252;r Dein Lob diesbez&#252;glich. Danke auch f&#252;r Deinen
Nachtrag zu dem Test, denn mit &quot;PFConvert&quot; w&#228;r ja eines der Hauptmankos von
Photo Folio, n&#228;mlich die Inkompatibilit&#228;t zu Picture Manager, aus dem Weg
ger&#228;umt. Danke f&#252;r die aktuellen Infos. See ya!</P>
<hr>
<p><b>An Yonder:</B><BR>
Erstmal mein Kompliment zu Deinem gelungenen CD Test zu &quot;Digital Make-Up&quot;.
Das Du daf&#252;r mein Test-System einsetzt freut mich nat&#252;rlich sehr und ich
hoffe, da&#223; du trotz Deines Wechsels zum PC noch ab und an aktuelle Amiga
Soft in der NC vorstellen wirst. Was mich aber vielmehr erstaunt hat, war
Deine schnelle Reaktion innerhalb des &quot;Harald Schmidt Workshops&quot; bezgl. des
Hintergrundpatterns; sieht mitlerweile wirklich besser aus, als vorher.
Wobei ich mich immer wieder frage, wieviele Workshops Du noch so auf Halde
hast. Reicht es noch bis zur NC 100? :-))</P>

<p>Das Clubtreffen war ja wohl auch recht genial, oder? Hoffe mal, da&#223; auch Du
einen kleinen Bericht f&#252;r die NC getippt hast - w&#252;rde mich auf jeden Fall
tierisch freuen. 
Read You!</P>
<hr>
<a name="top.html">
<p><center><h1><font color="yellow">Top 5</Font></center></h1></P>
<p>
1. Wolf Info von Wolf Zimmer (muss ich dar&#252;ber noch Worte verlieren?)<br>
2. Digital Make Up CD Test von Gerd Wolpert (Yonder meldet sich zur&#252;ck)<br>
3. Overlander von Thomas Weber (Screenshot w&#228;re nett gewesen; ansonsten aber
genial)<br>
4. Napster von Saint (kompetent, ausf&#252;hrlich &amp; gut layoutet)<br>
5. Aminet 37 von Wolf Zimmer (so gut wie eh und jeh)</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
