<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>WolfZ</title>
</head>
<body background="wolf1.gif" text=black link=blue alink="red" vlink="blue"
bgcolor=gray>
<a name="top"></a><br>

<center><font color="#000080" size="7"><b>Wolf&acute;s
Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>an Rolf N&uuml;nninghoff</a></b></li>
<li><a href="#a2"><b>an Kilian Servais</a></b></li>
<li><a href="#a3"><b>an alle</a></b></li>
<li><a href="#a4"><b>Feedback</a></b></li>
</ul>
<hr size=4>
<br>
<table width=100% border=0 cellpadding=6><tr><td>
<h3><a name="a1">Gr&uuml;&szlig; dich Rolf</h3>
<p>Es freut mich, wenn ich dich durch einen kleinen Leserbrief erfreuen konnte.
Habe ich doch gerne getan. Nein, ich habe ganz und gar nichts dagegen, dass
du meinen Leserbrief als Ger&uuml;st f&uuml;r deinen genommen hast. Einen
kleinen Vorschlag h&auml;tte ich da aber noch. Wie du unschwerlich ersehen
hast, werden die einzelnen Beitr&auml;ge von mir in eine Tabelle
eingebunden. Das mache ich aus dem einfachen Grunde, dass links und rechts
ein kleiner Rand entsteht. Deshalb gebe ich auch border=&Oslash; und cellpadding=6
an. Border=&Oslash; hei&szlig;t, es ist eine Rahmen vorhanden, aber mit
Pixelst&auml;rke gleich Null und davon wird nun ein Abstand von 6 Pixel
eingehalten. Gibst du nun border und cellpadding nicht an, wird bei den
meisten Browsern ein Rand von einem Pixel eingehalten. Ohne Tabelle sind es
&Oslash; Pixel in einem Framefeld, also kein Abstand zum Schiebebalken des
Nachbarframfeldes. Also der Optikhalber ist es am besten wie eingangs
beschrieben. Oder du nimmst keine 100% der Tabelle sondern nur 96% und
richtest die Tabelle mit center aus. Und schon hast du auch einen
Seitenrand. </p>

<p>&Uuml;brigens die HTML-Guide von Disksalv 4 habe ich der Schatztruhe
gegeben und die haben sie freudestrahlend auf ihrer Homepage zum Downloaden
freigegeben. Aber man kann sie auch von meiner Homepage ziehen, wie
zus&auml;tzlich zwei weitere Guides. </p>
<p> Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a2">Gr&uuml;&szlig; dich Kilian</h3>
<p>Es ist regelrecht bewunderungsw&uuml;rdig, wie du mit Enthusiasmus alle
Rubriken der NoCover am Leben zu erhalten trachtest. Aus diesem Grunde
habe ich beim letzten Mal auch mein Statement &uuml;ber die Rubrik
"Leserbriefe" von mir gegeben. </p>

<p>Heute m&ouml;chte ich auf die indirekte Aufforderung &uuml;ber einen
Bericht &uuml;ber ArtEffekt eingehen. Bei der neuen Version 4.0 liegt ein
Handbuch bei und auf der CD ist ein separater Workshop. Was mich nun von
einem detailiertem Bericht abh&auml;lt, ist die unmissverst&auml;ndlichen
Copyrightsbestimmungen eingangs im Buch und in der Readme: Alle Rechte
vorbehalten. [.....] Es darf in keiner Form (auch auszugsweise) mittels
irgendwelcher Verfahren reproduziert, gesendet, vervielf&auml;ltigt bzw.
verbreitet oder in eine andere Sprache &uuml;bersetzt werden. Somit ist
meines Erachtens der Weg eines Workshops schon vernagelt. Eine Besprechung
oder die Abgabe eigener Erfahrungen kann eigentlich nicht verwehrt werden,
solange man keine Passagen aus den Unterlagen abschreibt. Und mit meinen
Erfahrungen bin ich noch nicht soweit, dass ich aus dem Stadium des
Anf&auml;ngers heraus bin. </p>

<p>Der auf der CD beiliegende Workshop basiert noch auf der Version 2.x, soll aber
demn&auml;chst aktualisiert werden. Der Workshop liegt als HTML-Datei vor
und die F&uuml;hrung geschieht in einem Drei-Frame Bildschirm. Das neue
Handbuch ist in der Ausf&uuml;hrung weit verbessert worden und man kann nun
auch in direkten Kurzfassungen das Wichtigste erkennen und erlernen. </p>

<p>Wie schon gesagt, ich habe einen gro&szlig;en Respekt vor den Copyrights
und werde deshalb keinen Artikel verfassen. Auch ist mein Wissen noch
l&auml;ngst nicht ausreichend, um alles richtig w&uuml;rdigen zu
k&ouml;nnen. Und die eigenen Missgeschicke, die wirklich auf eigene
Unzul&auml;nglichkeiten zur&uuml;ckzuf&uuml;hren sind, hier zu
erw&auml;hnen, w&uuml;rden ein falsches Bild &uuml;ber das m.E. guten
Programmes abgeben. Einen Rat sollte man bei Nutzung von ArtEffect mit
gro&szlig;en Dateien beherzigen und das ist das Anlegen einer separaten
Festplattenpartition f&uuml;r die Auslagerunsdatei (mit HDTOOLBOX, mit
einer Blockgr&ouml;&szlig;e von 32K statt 512Byte formatiert und die Anzahl
der Bl&ouml;cke auf 4 statt 30 eingestellt, da sonst fast 1MB! als
Pufferspeicher reserviert wird). Um weiter in normaler Geschwindigkeit
arbeiten zu k&ouml;nnen, ist es ratsam, das unbegrenzte UNDO auf sagen wir
mal 5 Schritte zu begrenzen. Es werden n&auml;mlich alle Schritte auf die
Festplatte geschrieben und das h&auml;lt auf!!!! Auch sollte man wissen,
dass der Speicherverbrauch bei 24-Bit-Bildbearbeitungsprogrammen unter
Umst&auml;nden sehr hoch sein kann. ArtEffect braucht in der Regel 2-5 mal
den Speicher des gr&ouml;&szlig;ten geladenen Bildes. Ein Bild der
Gr&ouml;&szlig;e 800x600 ben&ouml;tigt in 24Bit 1,5 MB RAM. ArtEffect
braucht daf&uuml;r dann rund 3 - 7,5 MB. Du siehst, ich habe erst noch viel
zu lernen, bis ich mich qualifiziert &auml;u&szlig;ern kann. </p>
<p> Bis zum n&auml;chsten Mal alles Gute, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a3">Aufruf/Ratschlag</h3>
<p>Es braucht mir nun keiner zu sagen, dass mein nun folgendes Statement
eine Anma&szlig;ung ersten Ranges ist. Das wei&szlig; ich selber. Trotzdem
werde ich diese Zeilen schreiben und aus meinem Herzen keine
M&ouml;rdergrube machen. Ausschlaggebend f&uuml;r meinen Ratschlag war der
Artikel "Treffen2000" von Sascha. Dieser beginnt mit dem Error-Bild gleich
unterhalb der Unterschrift. Sascha hat das fehlende Bild "rule.jpg"
genannt. Entweder hat er dieses beim Versand vergessen oder Andreas konnte
es der NoCover nicht zuordnen. H&auml;tte Sascha dieses Bild nun
"st_treffen.jpg" genannt, ist es immer sofort zuordenbar. </p>

<p>Deshalb der Rat eines 60-J&auml;hrigen: Benennt eure Bilder wie euren
Artikel und artikel&uuml;bergreifende Bilder mit eurem Namen oder Synonym.
Es ist f&uuml;r alle Beteiligte viel einfacher und leichter. Stellt euch
vor, es schicken vier User einen Beitrag mit dem Bild "neu.gif". Nun
passiert folgendes: Alle haben das gleiche Bild wie derjenige, dessen
Artikel zuletzt in die NoCover eingebunden wurde. Und wem wird dann die
Schuld zugewiesen? Richtig, demjenigen der die NoCover zusammenstellt und
nicht denjenigen, die die Namen vergeben ohne nachzudenken. Und nun meine
Frage: Ist das richtig? Nein, denn jeder ist f&uuml;r seinen Artikel selbst
zust&auml;ndig und <b>verantwortlich</b>. </p>

<p>Deshalb nochmals meinen Aufruf an alle: Vergebt euren Bildern solche
Namen, damit sie einwandfrei zugeordnet werden k&ouml;nnen und haltet
strikt die Kleinschreibung ein. </p>
<p> Bis zum n&auml;chsten Mal alles Gute und richtet euch danach, Wolf.
<br>
<a href="#top">zum Anfang</a></p>
<hr size=4><br>
<h3><a name="a4">Feedback</h3>
<p>Folgende Artikel habe ich dieses Mal in meinem Feedback in alphabetischer
Reihenfolge der Titel ber&uuml;cksichtigt. Ein Autor erscheint bei mir wie
immer nur einmal, auch wenn mehrere Beitr&auml;ge lobenswert sind: </p>
<ul>
<li> <b> AD+D-Tipps</b> von Andreas Guldner</li>
<li> <b> Bescheiden</b> von Sieglinde Peters</li>
<li> <b> Overlander</b> von Thomas Weber</li>
<li> <b> Retrospectikus</b> von Sascha van Wahnem</li>
<li> <b> World of Alternatives (Messebericht)</b> von Kilian Servais </li>
</ul>

<p>Der Artikel st_retrospectikus.html von Sascha hat keine Schaltfl&auml;che und
wird wohl in dieser Ausgabe wieder mit dabei sein.
</p>
</td></tr></table>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br>
<font size="2">Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc&amp;tcp.de/members/wolf">
http://www.apc&amp;tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
