<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
<HEAD>
<TITLE>Internetchat oder IRC?</TITLE>
<META NAME="generator" CONTENT="MetalWEB 3.0 by Multitaskers 1997-99">
</HEAD>
<BODY BGCOLOR=#000000 TEXT=#FF0000 VLINK=#CC0000 LINK=#0000CC ALINK=#FFFF00>
<FORM ACTION="" METHOD="GET">
<P align=center><FONT COLOR=#00FF00><FONT SIZE="+2">&Uuml;ber die Vor- und Nachteile von "normalen" Chat und IRC</FONT></FONT></P>
<BR>
<BR>
Nachdem ich jetzt selbst im Internet bin, habe ich mich ge&auml;rgert, dass in den AmigaOS und im Amigafuturechat immer so wenig los war. Am PC hatte ich den Vorteil in allen Chat&acute;s teil nehmen zu k&ouml;nnen, aber der Amiga kann ja nun kein Java (OK, ok, er kann ja Java, aber nur den Script und kein "richtiges" Java). Aber dann lernte ich jemanden im Chat kennen, der mich zum IRC brachte. Und nun m&ouml;chte ich den Chat &uuml;bern Browser und den Chat &uuml;ber ein IRC-Prog vergleichen.<BR>
<BR>
<FONT COLOR=#00FF00><FONT SIZE="+1">Wie kommt man in den Chat?</FONT></FONT><BR>
<BR>
<U><B>WWW-Chat:</B></U><BR>
Erstmal sollte man sich mit Miami eingew&auml;hlt haben! Danach muss man einem Browser starten. Ich benutze daf&uuml;r bevorzugt IBrowse. Dann sollte man die Internetadresse eingeben. Bis der Server gefunden, angesprochen und die Seite aufgebaut wurde, kann je nach Systemausstattung bis zu einer Min. dauern. Dann muss man noch den Link zu den Chat finden. Dort muss denn der Server wieder angesprochen werden... <BR>
Danach muss mein sein Benutzername und ggf. ein Passwort eingeben. Danach klickt man auf Login und man landet im Chat. Diese Prozedur muss man immer machen!<BR>
<BR>
<B><U>IRC:</U></B><BR>
Nachdem sich Miami eingew&auml;hlt hat, startet man sein IRC-Proggi. Ich benutze daf&uuml;r BlackIRC. Dort kann man gleich &uuml;ber die wichtigsten Chats verf&uuml;gen. Als erstes sollte man sein Login eingeben und eventuell auch die anderen Namensfelder. Danach klickt man auf den gew&uuml;nschten Chat und und klickt danach auf einloggen. Es dauert eine kurze Zeit und man findet sich im Chat wieder. <BR>
<BR>
<FONT COLOR=#00FF00><FONT SIZE="+1">Chatten</FONT></FONT><BR>
<BR>
<B><U>WWW-Chat:</U></B><BR>
Beim WWW-Chat ist ein Teil des Browsers f&uuml;r die Texte, ein zum eingeben eines Textes und ein Teil um zu gucken, wer gerade im Chat ist. Man muss bei jeder neuen Eingabe ins Texteingabefeld dieses erst aktivieren. Der Chat wird alle 15 sek. aktualisiert. Diese Zeit kann man aber beliebig einstellen. In diesen Chat k&ouml;nnen nur S&auml;tze gesprochen bzw. geschrieben werden (Es steht bei einer Eingabe z.B. "Guile2000&#124; Heute ist ein sch&ouml;ner Tag"). Schreien oder gar Taten sind nicht m&ouml;glich! Es kann pro Browserfenster nur ein Chat betreten werden!<BR>
<BR>
<B><U>IRC:</U></B><BR>
Im IRC landet man gleich in Chatroom. Das Fenster (zumindest bei BlackIRC) ist mit den Chatfenster (den Fenster, mit dem das Gespr&auml;ch stattfindet), ein Eingabefeld f&uuml;r die S&auml;tze, ein Bereich mit Befehlen und einem Abschnitt zum Kanal betreten (beim IRC nennt sich ein Chatroom Kanal).<BR>
Der Chat wird bei einer Eingabe gleich aktualisiert. Das Eingabefenster bleibt aktiviert, daher man kann immer los tippen. Der Bereich mit den Befehlen hat mehrere Befehle, wie z.B. sich im Chat mal kurz abmelden (alle Teilnehmer werden benachrichtigt, dass ein Teilnehmer f&uuml;r kurze Zeit nicht erreichbar ist. Hier sind auch einige Befehle, die nur f&uuml;r einen sog. "Operater" (kurz OP) zur verf&uuml;gung stehen. Zu den OP sp&auml;ter. In den Bereich, wo man einen neuen Kanal betreten kann, kann man mit einen klick auf "Kanalliste" alle auf diesen Surfer zu verf&uuml;gung stehenden Chat&acute;s anw&auml;hlen und betreten. Diese Kan&auml;le werden auf der Oberfl&auml;che von BlackIRC mit aufgelistet und man kann mit einem einfachen klick den Kanal wechseln. Der andere Chat wird aber nicht verlassen, er l&auml;uft weiter und kann mit einem klick wieder "nach vorne" geholt werden.<BR>
<BR>
<FONT COLOR=#00FF00><FONT SIZE="+1">Sonstige Einstellungen im Chat</FONT></FONT><BR>
<BR>
<B><U>WWW-Chat</U></B><BR>
Im Chat kann nur die Zeit eingestellt werden, wann das Chatfenster aktualisiert werden soll. Au&szlig;erdem sind noch die Einstellungen des Browsers einstellbar.<BR>
<BR>
<B><U>IRC</U></B><BR>
Bei BlackIRC k&ouml;nnen die Befehle in der Befehlsecke ge&auml;ndert werden, man kann AREXX-scripte verwenden. Au&szlig;erdem ist es m&ouml;glich, den Chatnamen w&auml;hrend des Chattens. Man muss nur einen kleinen Befehl eingeben. Nat&uuml;rlich kann man auch die wichtigsten Prefseinstellungen im Programm vornehmen.<BR>
<BR>
<FONT COLOR=#00FF00><FONT SIZE="+1"> Sonstiges</FONT></FONT><BR>
<BR>
<B><U>WWW-Chat:</U></B><BR>
Mehr gibt es nicht zu beschreiben. Alles in diesen Text geschriebenes &uuml;ber den WWW-Chat ist nur auf den Javafreien Chat&acute;s bezogen! Die Chat&acute;s die Java benutzen laufen ein wenig anders und haben viel mehr Funktionen!!!<BR>
<BR>
<B><U>IRC:</U></B><BR>
Es gibt die OP&acute;s, die daf&uuml;r da sind, den Chat "sauber" zu halten. Sie haben besondere Rechte, die ich im einzelnem noch nicht ganz kenne. Aber diese k&ouml;nnen andere Chatter aus dem Kanal werfen. Dies geschieht aber nur dann, wenn man sich wiederholt total daneben benimmt. OP kann man selber auch werden, man muss aber sich behaupten k&ouml;nnen und im Chat sehr beliebt sein. Von Heute auf Morgen kann man kein OP werden.<BR>
<BR>
<BR>
<FONT COLOR=#FF00FF>Soviel zu meinem kleinen Vergleich. Ich bin selber noch nicht lange im IRC, deswegen kann es sein, dass ich eventuell etwas Falsch beschrieben habe. Ich hoffe auch im weiteren, dass man diesen Text verstehen konnte. Es ist garnicht so einfach etwas ohne Bild zu beschreiben! Naja, soviel zu diesem Thema.</Font><BR>
<BR>
<A HREF="mailto:RStell@web.de"><FONT SIZE="0">Rene&acute; "Guile2000" Stelljes</FONT></A></FORM>
</BODY>
</HTML>
