 <html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a name="top"></a>
<br>
<h1>Der effektive Einsatz von Emails</h1>
<h2>Eine Anleitung f&uuml;r Anf&auml;nger</h2>
<p><i>Version 1.5.1 deutsch </i></p>

<p>Dies ist die deutsche &Uuml;bersetzung von Kaitlin Duck Sherwoods
&quot;A Beginner's Guide to Effective Email&quot; (Rev. 2.0). Zum besseren
Verst&auml;ndnis habe ich einige Formulierungen an die deutschen
Sprachgewohnheiten angepa&szlig;t. Die englische Original-Version finden
Sie <a href="http://www.webfoot.com/advice/email.top.html">hier</a>. Bitte
beachten Sie die die <a href="#Copyright">Copyright-Hinweise</a> am
Fu&szlig; dieses Dokuments!</p>

<p>Diese Text liegt in HTML 4.0 vor und nutzt Cascading Style Sheets.
Optimal w&auml;re daher der Einsatz von Netscape Navigator 4.x, Internet
Explorer 4.x oder Opera 3.5, aufgrund der Technik sind diese Seiten aber
auch mit jedem anderen Browser lesbar.</p>

<p>&Uuml;ber jede Form der R&uuml;ckmeldung (Hinweis auf Fehler, sonstige
Verbesserungsvorschl&auml;ge, Lob) freue ich mich sehr!</p>

<p>Informationen &uuml;ber aktuelle &Auml;nderungen des Textes und
&uuml;ber mich finden Sie <a href="onl_email14.html">hier</a>!</p>

<p><a href="mailto:Scheffner@gmx.de?subject=Feedback zu
Email-Guide">Thorsten Scheffner</a></p>
<a name="inh"></a>
<hr>

<h3>Inhalt </h3> <ul>
<li><a href="#Einfuehrung">Einf&uuml;hrung</a>
<li><a href="#Emails">Warum sind Emails anders?</a>
<li><a href="onl_email01.html">Der inhaltliche Zusammenhang</a>
<li><a href="onl_email02.html">Textgestaltung</a>
<li><a href="onl_email03.html">Seiten-Layout</a>
<li><a href="onl_email04.html">Ausdruck </a>
<li><a href="onl_email05.html">&quot;Mimik und Gestik&quot;</a>
<li><a href="onl_email06.html">Status</a>
<li><a href="onl_email07.html">Konventionen</a>
<li><a href="onl_email08.html">Anreden, Abschl&uuml;sse und Unterschriften</a>
<li><a href="onl_email09.html">Zusammenfassung</a>
<li><a href="onl_email10.html">Sicherheit</a>
<li><a href="onl_email11.html">Anhang A: Bibliographie</a>
<li><a href="onl_email12.html">Anhang B: Abk&uuml;rzungen und Email-Jargon</a>
<li><a href="onl_email13.html">Anhang C: Domain-Namen</a> </ul>

<hr>

<h3><a name="Einfuehrung"></a>Einf&uuml;hrung</h3>

<p>Ich bin &uuml;berzeugt,
da&szlig; die elektronische Post (Email) einen gro&szlig;en Nutzen f&uuml;r
private und berufliche Zwecke hat. Emails sind billiger und schneller als
Briefe, weniger l&auml;stig als Telefonate und weniger aufdringlich als
Faxe. Wenn man Emails verwendet, spielt der Ort oder die Zeitzone, in der
man sich befindet keine Rolle mehr. </p>

<p>Dar&uuml;ber hinaus f&uuml;hren
Emails zu einer ausgeglicheneren Informationsstruktur (vgl. das Buch von
Sproull and Kiesler's: Connections, MIT Press, 1993) Diese Vorteile
f&uuml;hrten dazu, da&szlig; weniger direkt und mehr &uuml;ber Email
miteinander kommun iziert wird. Als ich 1984 (in einer Firma ohne Email)
mit meiner Arbeit begann, hatte ich sch&auml;tzungsweise zehn Besprechungen
in der Woche sowie eine Pr&auml;sentation im Monat und verbrachte die
meiste Zeit in direkten Gespr&auml;chen mit Kollegen und Verk&auml;ufern.
1991 machte ich nur noch eine Pr&auml;sentation im Vierteljahr, ein oder
zwei Besprechungen im Monat und bekam etwa 30 Emails am Tag. Im meinem
jetzigen Job (seit 1998), mache ich nur noch eine Pr&auml;sentation im
Jahr, zwei Meetings in der Woche und bekomme etwa 60 Emails am Tag. </p>

<p>Ungl&uuml;cklicherweise habe ich in den etwas mehr als zwanzig Jahren,
in denen ich Emails nutze, eine gro&szlig;e Zahl von Menschen
kennengelernt, die Fehler im Umgang mit Emails machten, weil sie nicht
verstanden hatten, ihre Kommunikationsgewohnheiten dem neuen Medium
anzupassen. Um ihnen zu helfen, schrieb ich diesen Text. Es geht in diesem
Text nicht darum, wie man Emails versendet - welchen Knopf man dr&uuml;cken
mu&sz lig; oder wie man ein Photo anh&auml;ngt. Diese Details sind von
Programm zu Programm verschieden und werden von den Handb&uuml;chern besser
erkl&auml;rt. Mir geht es um den Inhalt von Emails: Wie kann ich das
ausdr&uuml;cken, was ich ausdr&uuml;cken will. </p>

<p>Dieser Text hat aber nicht den Anspruch, die absolute Wahrheit zu
verk&uuml;nden. Es wird Menschen geben, die in einigen speziellen Punkten
anderer Meinung sind. Wenn es aber nur eine richtige Antwort gebe,
br&auml;uchte man nicht diese Anleitung zu schreiben. Ich hoffe, da&szlig;
diese Anleitung dazu beitr&auml;gt, Ihre F&auml;higkeiten im Umgang mit
Emails und die Effektivit&auml;t beim Schreiben zu steigern. Dann
k&ouml;nnen sie schreiben und ihre eigene Pers&ouml;nlichkeit und Meinung
ausdr&uuml;cken.</p>

<hr>

<h3><a name="Emails"></a>Warum sind Emails anders?</h3>

<p>Elektronische Kommunikation unterscheidet sich, aufgrund ihrer
Geschwindigkeit und Verbreitung, grundlegend von der papierbasierten
Kommunikation (Briefe oder Faxe). Da die Antwort sehr viel schneller
erfolgen kann, sind Emails - mehr als traditionelle Briefe - ein direktes
Gespr&auml;ch. Bei einem Papier-Dokument ist es dagegen sehr wichtig,
da&szlig; alles absolut klar und unzweideutig ist, da der Empf&auml;nger
oft nicht die Chance hat, nachzufragen. Bei Emails kann dagegen direkt
gefragt werden.</p>

<p>Dar&uuml;ber hinaus neigt man in Emails dazu, ebenso wie in einer
Unterhaltung, eine eher saloppe Sprache zu verwenden. Das ist nicht immer
schlimm. Es macht wenig Sinn, stundenlang &uuml;ber einer Nachricht zu
sitzen, die Rechtschreibung zu kontrollieren, elegant zu formulieren und
eine einwandfreie Grammatik zu verwenden, wenn man nur seinem Kollegen
mitteilen m&ouml;chte, da&szlig; man zum Essen gehen will. </p>

<p>Wie auch immer: Ihr Gespr&auml;chspartner hat in der Regel auch keine
Informationen &uuml;ber Sie, wie z.B. Ihre Kleidung, Ihre Ausdrucksweise
oder Ihren Dialekt, s o da&szlig; er sich aufgrund Ihres Namens, Ihrer
Adresse und - sehr wichtig - aufgrund Ihres Umgangs mit Sprache, von Ihnen
ein Bild macht. Daher sollten Sie darauf achten, wann Sie salopp und wann
Sie seri&ouml;s sein sollten. Emails geben, im Gegensatz zu einer
Unterhaltung oder einem Telefonat, auch keine Informationen &uuml;ber
Emotionen. Es fehlt die Modulation der Stimme, die Gesten und die
gemeinsame Umgebung. Ihr Gespr&auml;chspartner kann keine Aussage
dar&uuml;ber treffen, ob sie gerade ernst sind oder flunkern, ob sie
gl&uuml;cklich oder traurig, frustriert oder enthusiastisch sind. Sarkasmus
kann in Emails sogar sehr gef&auml;hrlich sein. </p>

<p>Ein
weiterer Unterschied zwischen Email und &auml;lteren Medien besteht darin,
da&szlig; der Empf&auml;nger die Nachricht nicht unbedingt so
empf&auml;ngt, wie Sie sie erstellt haben. Ihre Stimmb&auml;nder erzeugen
T&ouml;ne, die grunds&auml;tzlich sowohl von Ihnen als auch von Ihren
Gespr&auml;chspartnern gleich wahrgenommen werden. Das Papier, auf dem Sie
eine Liebesbotschaft schreiben, ist das gleiche, das auch das Objekt Ihrer
Begierde sieht. Bei Emails ist aber die Hard- und Software, die Sie und Ihr
Gegen&uuml;ber f&uuml;r das Senden und Empfangen benutzen, oft vollkommen
verschieden. Es kann also sein, da&szlig; Ihre Nachricht auf dem Bildschirm
des Empf&auml;ngers ganz anders aussieht als bei Ihnen. Daher sollten Ihre
Emails anders sein als Ihre Briefe oder Ihre Sprache.</p>

<p>Als ich diesen
Text zum ersten Mal schrieb, gab es wenige Informationsquellen &uuml;ber
den Inhalt von Emails. Diejenigen, die sich mit den Inhalten von Email
besch&auml;ftigten, &auml;u&szlig;erten sich nur &auml;u&szlig;erst sparsam
&uuml;ber den Stil und gaben nur wenige Gr&uuml;nde daf&uuml;r an, warum
der Stil in Emails anders ist. Ich schrieb diese Anleitung, um diese
L&uuml;cke zu schlie&szlig;en: um Ihnen zu sagen, wie man seine Nachricht
dem neuen Medium anpasst. </p>

<p>Seit ich die erste Version diese r
Anleitung geschrieben habe, fand ich einige andere Dokumente &uuml;ber
Email, die mehr als nur die Funktionen des Programmes beschreiben. Daher
gibt es nun eine kurze Bibliografie &uuml;ber Stil und Netiquette. </p>

<hr>

Weiter zum Thema <a href="onl_email01.html">Zusammenhang</a>

<hr>

<p>Sie k&ouml;nnen Kommentare zum Inhalt an <a
href="mailto:ducky@webfoot.com">Kaitlin</a> senden, sie sollten dabei aber
beachten, da&szlig; </p> <ul>
<li>sie eine Menge Emails bekommt,
<li>daf&uuml;r nicht bezahlt wird,
<li>eventuell nichts &uuml;ber das spezielle Email-Programm wei&szlig;. </ul>

<p>Zur deutschen Version senden Sie die Kommentare bitte an <a
href="mailto:Scheffner@gmx.de?subject=Feedback zu Email-Guide">Thorsten
Scheffner</a>. Neben den obigen drei Punkten gilt hier noch: <ul>
<li>ich habe den Text nur &uuml;bersetzt,
<li>ich bin kein professioneller
&Uuml;bersetzer. </ul> </p>

<hr>

<p>Die erste englische Version entstand am 10 Dezember 1994 </p>

<p>Die erste deutsche Version entstand am 20. Mai 1999 </p>

<hr>

<h3><a name="Copyright"></a>Copyright</h3>

<p>Alle Rechte an diesem Email-Guide liegen bei Kaitlin Duck Sherwood. Eine
Verwertung dieses Textes, insbesondere durch Vervielf&auml;ltigen und/oder
Verbreitung ist zwar erw&uuml;nscht, aber ohne vorherige Zustimmung von <a
href="mailto:ducky@webfoot.com">Kaitlin Sherwood</a> unzul&auml;ssig. Alle
Rechte an der deutschen &Uuml;bersetzung liegen bei <a
href="mailto:Scheffner@gmx.de?subject=Copyright Email-Guide">Thorsten
Scheffner</a>. </p>
<a href="#inh"> zum Inhaltsverzeichnis </a>
<hr>
</body>
</html>


