<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Clubtreffen 2000</TITLE>
</HEAD>
<BODY TEXT=white background="back5.jpg" link=silver alink=red>
<p><center><h1><font color="green">Clubtreffen 2000</Font></h1></Center></P>

<p>Lange hatte die Vorbereitung gedauert - am 22.7. &amp; 23.7 (zu der Zahl &quot;23&quot;
sp&#228;ter mehr :-)) war es dann endlich soweit: Das Clubtreffen des APC &amp; TCP
im Jahr 2000 fand im Vellmarer Hof in der N&#228;he von Kassel statt und auch ich
konnte dieses Jahr endlich mal dran teilnehmen, nachdem in der Vergangenheit
immer etwas dazwischenkam.</P>

<p>Am Samstag morgen holte mich Wolf Zimmer, bei dem ich mich an dieser Stelle
nochmals herzlichst bedanken m&#246;chte, in aller Fr&#252;he ab und es ging auf nach
Vellmar, wo wir allerdings nicht die ersten waren - Annemie &amp; G&#252;nther
Kohlm&#252;ller, Daniel Stein &amp; Joe Smith waren genau wie Thomas Weber schon
da und man begann sich in erste Gespr&#228;che mit diversen Leuten zu verwickeln
und vor allem die Rechner aufzubauen. Nach und nach trafen dann immer mehr
Leute ein (Yonder, die beiden Breitsprecher Br&#252;der, UMO etc.) und am fr&#252;hen
Nachmittag, nachdem wir also das Mittagsessen in der Gastst&#228;tte eingenommen
hatten, beriefen Sascha &amp; Daniel eine erste Diskussionsrunde ein, wobei wir
uns nat&#252;rlich erstmal alle einander vorstellten. Nachdem dies geschehen war
und uns noch f&#252;nf (man beachte die Zahl 5...) weitere, unbekannte User beehrten, konnten Fragen gestellt
werden sowie Themen diskutiert werden. Das wurde nix, denn unsere f&#252;nf
Freunde wollten erstmal &#252;ber ihr Steckenpferd &quot;Packet Radio&quot; ausf&#252;hrlich
reden, was dann in einer recht langatmigen und leider auch etwas
langweiligen Diksussionsrunde endete. Anscheinende peilten die Menschen
nicht, da&#223; dieses Thema nur die wenigsten interessiert und ich kann von
meiner Seite nur sagen, da&#223; die spontan eingerufene L&#228;sterrunde auf dem Klo
mit Jon Smith und Philiph Breitsprecher wesentlich lustiger war :-)))
Irgenwann schafften wir es dann doch, das Thema zu &#228;ndern und diskutierten
u.a. noch &#252;ber den neuen Amiga sowie diverse weitere Amiga Themen, was ich
recht aufschlussreich fand.</P>

<p>Im Anschluss daran ging`s dann wieder an die Rechner und es wurden im Laufe
des Abends Ideen ausgetauscht, bei Problemen geholfen (Robert Krachtochwilla war
mit seinem, &#228;hem, merkw&#252;rdigen Amiga ebenfalls da und es war nicht das
einfachste, &quot;Foundation Gold&quot; auf diesem zu installieren) und vor allem
gezockt, wobei die Spieleauswahl (fast alle Games stammten aus dem PD
Sektor!) jeden PC User verschreckt h&#228;tte: So standen gnadenlos geile Games
wie &quot;Mad Bomber&quot; (Kult), &quot;Ork Attack&quot; (Oberkult) und &quot;Backtooth Bob&quot;
(Megakult) im Mittelpunkt und sorgten f&#252;r sehr viel Spa&#223; und lustige Gags.
Insbesondere &quot;Backtooth Bob&quot;, dessen Grafik einfach ph&#228;nomenal und
bahnbrechend ist (das Spielprinzip ist wahrhaft revolution&#228;r...), sorgte
zumindest bei einem Gro&#223;teil der j&#252;ngeren f&#252;r sehr viel Spa&#223;.  Aber auch
&#228;ltere, kommerzielle Games wie &quot;Silkworm&quot; (wof&#252;r Daniel Stein &amp; ich extra
noch einen A500 aus den Steinschen Gem&#228;uern abholen mussten) und &quot;Rick
Dangerous&quot; wurden endlos lange gezockt und machten total Laune. Mein
pers&#246;nliches Highlight des Abends war eine Partie &quot;Turrican III&quot;, welches
ich bis dato nicht kannte und das Thomas Weber auf seinem Rechner laufen
lie&#223;. Besonders schwierig war es nicht und irgendwie schaffte ich es auch es
durchzuspielen (wobei auch der Schwierigkeitsgrad recht gering angesetzt
war), aber die Comments, die diverse Personen so zwischendurch fallen
lie&#223;en, waren schon sehr aufschlussreich. Besonders Daniel &amp; Thomas taten
sich dadurch hervor, wertvolle Spieletips zu geben, wodurch wir jetzt eine
leichte &#196;nderung der Pseudonyme haben: Daniel &quot;Schie&#223; mal auf`s Auge&quot; Stein,
Thomas &quot;Das ist das letzte Level&quot; Weber und Kilian &quot;Mach mal das Rad&quot;
Servais....</P>

<p>Je sp&#228;ter der Abend wurde, desto interessanter wurden auch die
Diskussionsthemen in den diversen kleinen Gr&#252;pchen, die sich bildeten: So
waren Daniel Stein, die beiden Breitsprechers sowie meine Wenigkeit zuerst
dar&#252;ber am diskutieren, ob Rammstein mit ihren Videos (die Beteiligten
wissen ja wohl noch, was gemeint ist :-))) provozieren wollen und inwiefern
so etwas verwerflich ist. Dies artete dann allerdings, nachdem sich ein
weiterer, etwas durchgeknallter User (Name vergessen...) ebnefalls
einklinkte, in einer politischen Grundsatzdiskussion &#252;ber den zweiten
Weltkrieg aus, wobei am Ende nur noch Philip und dieser anonyme User
miteinander diskutierten. Daniel Stein und ich hatten n&#228;mlich schon ein
besseres Thema gefunden: Die Verschw&#246;runsgtheorien sowie die Illuminaten,
die damit unmittelbar verkn&#252;pft sind. Hier jetzt alles aufzurollen, w&#252;rde de
facto zu weit f&#252;hren. Fest steht nur, da&#223; dieses Gespr&#228;ch etwas l&#228;nger
dauerte und ich danach mit der Zahl &quot;23&quot; (man achte mal im Alltag darauf, wo
diese h&#228;ufig vorkommt...) etwas anders umging. Vielleicht schreibt der
Daniel dar&#252;ber mal einen kleinen Artikel.... :-))) Wobei auch die diversen
Verschwörunsgtheorien interessant waren, mich aber auch zunehmend weiter
verwirrten und das alles um kurz nach Mitternacht...</P>

<p>Irgendwann um 1 Uhr nachts machte sich ein Gro&#223;teil auf in Richtung Daniel
Stein`s Bude, um dort zu &#252;bernachten. Allerdings machte Daniel den
entscheidenden Fehler und gab mir ein Buch &#252;ber Verschw&#246;runsgtheorien aus
dem ich im folgenden noch l&#228;nger zitieren konnte, was zur allgemeinen
Erheiterung, zumindest einiger Personen (oder Philliph?), beitrug.
Allerdings wollte ein Gro&#223;teil dann leider schlafen und ich konnte nicht
mehr das ganze Buch vorlesen; selbst den Endlos Witz des &quot;Schwarz-wei&#223;en
Ritters auf dem schwarz-wei&#223;en Pferd&quot; wollte niemand mehr h&#246;ren. Ok, dann
ging`s halt in die Schlafs&#228;cke und recht schnell (???) war dann auch &quot;Ruhe&quot;
(diesew wurde nur dadurch unterbrochen, da&#223; immer irgendwer schnarchte) im
Tischtennisraum.</P>

<p>Nach der recht kurzen Nachtruhe gab`s dann am n&#228;chsten morgen das
wohlverdiente Fr&#252;hst&#252;ck, was uns allen St&#228;rkung f&#252;r die kommenden Ereignisse
geben sollte, denn recht schnell brachen wir wieder Richtung Vellmarer Hof
auf, um dort im Grunde erstmal das selbe zu machen wie gestern: Zocken,
miteinander diskutieren und nat&#252;rlich Spa&#223; haben (und das hatten wir
wirklich zu Gen&#252;ge!!). Da die gute Annemie am 23.7. (wieder diese Zahl...)
Geburtstag hatte, wurde sie am morgen erstmal mit einem Blumenstrauss (der auf die Kappe unser niemerm&#252;den
Organisationen Daniel &amp; Sascha ging) sowie
einem kleinen St&#228;ndchen von uns begr&#252;&#223;t und revancierte sich mit einer
Freirunde - danke Annemie. Nat&#252;rlich wurde auch am fr&#252;hen morgen wieder eine
Diskussiosnrunde im gro&#223;en Kreis einberufen, wo wir u.a. &#252;ber den aktuellen
Stand der NoCover redeten, was aber im Grunde auch zu keinem wirklichen
Resultat f&#252;hrte. Na ja, macht auch nix, denn &#228;ndern l&#228;sst sich offenabar
daran auch nichts. Bald ging`s dann wieder mit dem regul&#228;ren Programm
weiter, wobei u.a. auch ein Silkworm Wettbewerb auf dem Programm stand, den
ich &amp; Georg Breitsprecher gewannen - als Preis winkte ein Catweasel
Controller sowie diverse CD`s, die von Vesalia (Thanx!!) gestiftet wurden.
Ansonsten wurde der komplette Tag bis zum Nachmittag &#228;hnlich wie der vorrige
verbracht, wogegen auch niemand etwas hatte, wobei uns im Laufe des Tages
noch Carsten &quot;Amiga Aktuell&quot; Schr&#246;der sowie weitere User aus G&#246;ttingen einen
Besuch abstatteten.</P>

<p>Insgesamt war es ein richtig geiles Wochenende mit vielen netten Personen
jeglichen Alters, wo man einfach nur Spa&#223; haben konnte. Negativ ist mir
nichts aufgefallen - auch wenn Petro T. sowie unser Chef Andreas leider gefehlt
haben. War richtig geil!</P>


<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
