<html>
 <head>
<meta name="description" content="Feedback">
<meta name="author" content="Sieglinde Peters"
     <title>Feedback von der NoCover 76 </TITLE>
</head>
 <body bgcolor="white" text=black link=darkblue alink=green>
     <center>
     <IMG SRC="ideaman.gif" width=150 height=100>

<p>
<hr>
<Font Color="red">
<h1>Feedback von der NoCover 76 von Sieglinde Peters</h1>
</center>
</Font Color="red">
<Strong font size=7>
Nun ist die Reihe mal wieder an mir ein Feedback von der letzten
Ausgabe zu schreiben: </strong font size=7>
<p>
<font size=3>
Zuerst m&#246;hte ich einmal meinen Eindruck &#252;ber die vergangenen Ausgaben
loswerden:<br>

Wenn man die letzten Ausgaben mit fr&#252;heren Ausgaben vergleicht, ist deutlich
festzustellen, da&#223; nicht nur die  Menge und der Umfang der Artikel nachgelassen
haben, sondern auch die Amigabegeisterung. Auch bei mir ist das leider der 
Fall.<br> Ja, ich nutze meinen Amiga noch fast t&#228;glich. Es gibt eine Menge
Aufgaben, die er noch zu meiner vollen Zufriedenheit erledigt. Dazu z&#228;hlen
z.B. meine Korrespondenz und meine Buchhaltung, Aber es gibt nichts neues 
mehr zu entdecken. Selbst die wenigen neuen Spiele, die erscheinen sind 
meistens Ballerspiele und daher nichts f&#252;r mich. Meinen Amiga ins Internet zu
bringen, ist mir ehrlich gesagt, zu umst&#228;ndlich. Daher lebe ich jetzt meinen
Forscherdrang auf einem Suse-Linuxrechner aus. Da reichen f&#252;rs Internet ein
paar Mausklicks. Programme gibt es auch reichlich, selbst Spiele. 
Nicht, da&#223; Ihr jetzt denkt, ich sei jetzt der absolute Linuxfan und wollte vom
Amiga nichts mehr wissen. Nein, ich wollte nur klar machen, wie ich aus 
meiner Sicht die mangelnde Beteiligung in der NoCover sehe. Die 
Begeisterung f&#252;r unsere  Freundin ist bei vielen in Frust umgeschlagen.
<p>
<strong>Jetzt aber zur aktuellen Ausgabe:</strong>
<p>
In der Abteilung <strong>"Rubriken"</strong> m&#246;chte ich besonders die Mitgliederliste
erw&#228;hnen.<br>
Gut das Sascha sie jetzt endlich mal "ausmistet". Dadurch bekommt man 
wenigstens einen &#220;berblick &#252;ber die Clubmitglieder, die tats&#228;chlich
noch dabei
sind. Es fehlen mir aber schmerzlich die <strong>Geburtstagsgr&#252;&#223;e von Annemie.</strong>
"Annemarie, gib Dir doch einen Ruck".<br> Alle, die Geburstagsgr&#252;&#223;e auch
vermissen, bitte ich die Annemarie mit E-mails einzudecken.
<p>
Unverzichtbar ist auch die AmigaAktuell. Gerade jetzt, wo die Zahl der 
Amigaprintmedien so geschrumpft ist, brauchen wir das Online-Magazin mehr 
denn je. 
<p>
<strong>Und Ronda?</strong><br>
Die NoCover w&#228;re &#228;rmer ohne sie.  "Mach weiter Thomas, bitte." In fr&#252;heren
Ausgaben hat es viele Geschichten gegeben. Jetzt ist nur noch wenig 
Unterhaltung &#252;briggeblieben.<p>
<strong>Workshop?</strong><br>
Au&#223;er dem "Harald Schmidt - Workshop " war nichts dabei und den rechne
ich nicht zu den echten Workshops. (Tut mit leid Yonder)<p>
<strong>Games?</strong><br>
Diesmal gab es drei Spielebeschreibungen.<br>
Kilian hat ein sehr vernichtendes Urteil von Spiel "Zombie Massacre " 
abgegeben.  Gut ,da&#223; ich es mir gar nicht erst angesehen habe. Auch Thomas
Weber hat diesmal ein Spiel getestet. Leider ist dieses Spiele schon etwas in 
die Jahre gekommen. Manche PD-Spiele aus fr&#252;her Zeit sind noch immer gut.<p>
<strong>Hardware?</strong><br>
Leider nichts dabei.<p>
<strong>Multimedia?</strong><br>
Da war wieder die in jeder Ausgabe p&#252;nktlich erscheinende Metal Corner von
Kilian. F&#252;r eine angemessene Beurteilung habe ich leider nicht das richtige
Alter.<p>
<strong>Tools?</strong><br>
Kilian, der wohl flei&#223;igste Schreiber in der NoCover, hat einen sehr
ausf&#252;hrlichen und gut gelungenen Test von FX-Paint geschrieben.<p>
<strong>CD-Theke?</strong><br>
Auch diesmal gab es wieder den Test der neuen Aminet-CD von Wolf. Beim 
Durchlesen hatte ich das Gef&#252;hl, da&#223; Wolf auch nicht mehr so begeistert von
der CD ist. Meiner Meinung nach hat auch hier die Qualit&#228;t sehr nachgelassen.
Zwei Tests stammen von Kilian und einer von Yonder. Diese Rubrik war also in 
dieser Ausgabe gut gef&#252;llt.<p>
<strong>Online?</strong><br>
Was Markus da beschreibt, ist meines Wissens nicht legal. Daher m&#246;chte ich mich
dazu auch nicht &#228;u&#223;ern. <p>
<strong>Diskussionen?</strong><br>
Der Falke - Verlag  geistert noch immer durch die NoCover-Ausgaben. Das
h&#228;tte ich nie gedacht.<p>
<strong>Small Talk?</strong><br>
Dort finden sich wie in jeder Ausgabe die WolfInfos. Der Abschnitt &#252;ber die
Leserbriefe hat mir voll aus der Seele gesprochen. Pers&#246;nliche Dinge f&#252;r einige
Mitglieder schreibe ich auch lieber gleich per E-Mail.<br>
Interessant fand ich auch den Messebericht von Kilian. Ich selbst bin nicht zur
Messe gefahren. Das tue ich erst wieder, wenn es einen neuen Amiga zu 
kaufen gibt.<p>
<strong>Storys?</strong><br>
Hier findet sich eine sehr sch&#246;ne Geschichte von Wolf zum Nachdenken. Die
sollte wirklich jeder lesen.<p>
<strong>Tipps und Tricks?</strong><br>
Diesmal gibt es Informationen von Andreas Guldner. Die Kenner der Spiele 
werden sie wohl zu sch&#228;tzen wissen.<p>

<strong>Zum Schluß noch meine Top 5:</strong><br>
1. Wolf mit der Bootgeschichte ( mal etwas mit Tiefgang)<br>
2. Kilian mit seinen Spieletests ( sehr ausführlich )<br>
3. Kilians test des Programms FXPaint (gute ausführliche Beschreibung)<br>
4. Thomas Weber mit seiner Ronda ( lockert die NoCover etwas auf)<br>
5. Wolf mit seinen Infos ( Informativ und gut wie immer) <br>
<hr>
Sieglinde Peters<br>


<IMG SRC="compwom.gif" ALIGN=left Width=88 height=88>
</html>

