<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Ein zweiter Gedankenanstoss...</TITLE>
</HEAD>
<BODY TEXT=ffaa00 background="back5.jpg" link=silver alink=red>
<p><h1><center><font color="green">Armes Deutschland? Ein zweiter Gedankenanstoss!</Font></center></h1></P>

<p>Wie schon vor gut einem Jahr zum Thema &quot;Musik&quot; m&#246;chte ich heute auch einen Gedankenanstoss zum Thema &quot;Fernsehen&quot; geben.</P>

<p>Die Zeit, in denen das Fernsehprogramm zunehmend f&#252;r die Verdummung der Zuschauer sorgt, scheint angebrochen zu sein. Da w&#228;ren erstmal all die uns&#228;glich dummen und niveaulosen Talkshows, in denen  Kandidaten versuchen, sich m&#246;glichst provokant zu irgendwelchen Themen zu &#228;u&#223;ern. Dies artet dann mitunter in Schlammschlachten aus, aber trotzdem wird dem ganzen immer noch der Stempel &quot;Unterhaltung&quot; aufgedr&#252;ckt. Das schlimme daran aber ist, da&#223; diese leichte Unterhaltung nicht nur zahlreiche Kinder beeinflussen kann (!), sondern es anscheinend auch gen&#252;gend Leute gibt, die sich soetwas angucken - ansonsten w&#228;re die Flut an Talkshows, die zunehmend an Niveau einb&#252;&#223;en, wohl nicht zu erkl&#228;ren.</P>

<p>Als ideale Erg&#228;nzung dazu gibt`s dann weitere leichte Kost in Form von Seifenopern, die es auch immer wieder schaffen, Millionen vor den Fernseher zu locken, wobei diese Leute es einfach nicht kapieren, was f&#252;r ein intelektueller M&#252;ll Ihnen da vorgesetzt wird - in diesem Zusammenhang k&#246;nnte man gleichzeitig die Phrase &quot;abgrundtief peinlich&quot; einwerfen, wobei ich einfach mal hoffe, da&#223; sich jetzt niemand davon auf den Schlips getreten f&#252;hlt.</P>

<p>Richtig pervers (yup!) wird es meiner Meinung nach erst mit all diesen aktuellen Shows, mit denen wir konfrontiert werden. Bestes Beispiel: Big Brother! Alleine das Konzept dieser &quot;Sendung&quot; finde ich soetwas von abgrundtief peinlich und pervers (sorry, trifft es aber perfekt), da&#223; es mich immer wieder wundert, wieviel Erfolg dieser Schrott hat. Neben den hohen Einschaltquoten ist davon mitlerweile auch die Musikindustrie betroffen, wobei ich Euch an dieser Stelle nochmals den Artikel &quot;Musik&quot; aus der NC 66 zur Lekt&#252;re empfehlen kann. Aber zur&#252;ck zu Big Brother: Zeugt es von Niveau, sich irgendwelche fremden Menschen in Ihrem <b>Privat</B>leben anzuschauen? Nebenbei bemerkt: Die Kandidaten, die soetwas mitmachen, sind auch nicht viel intelligenter. </P>


<p>Aber w&#228;re damit der Gipfel der Peinlichkeit nicht langsam erreicht? Weit gefehlt! Andere Sender ahmen das Erfolgsrezept von &quot;Big Brother&quot; nach und schicken &#228;hnliche Shows in`s Rennen um die Gunst der Zuschauer, die auf einem &#228;hnlich tiefen Niveau liegen, wie schon &quot;Big Brother&quot;. Ob dieses einfache nachahmen Erfolg hat, wird sich noch zeigen, aber wundern w&#252;rde es mich tats&#228;chlich nicht mehr. </P>

<p>Abgerundet wird das t&#228;gliche Programm noch von einigen, teilweise sogar recht guten, Serien, viel Werbung, Boulevard Magazinen, ein wenig Nachrichten sowie dem einen oder anderen gelungenen Spielfilm - eigentlich ein recht buntes Programm, welches daran zu leiden hat, da&#223; Talkshows, &amp; Shows a la &quot;Big Brother&quot; im t&#228;glichen Programm klar die &#220;berhand haben und dabei gr&#246;&#223;tenteils mitten in den idealen Sendezeiten plaziert sind.</P>

<p>Jetzt aber die Frage: Macht es niemanden nachdenklich, da&#223; die heutige Jugend, die durch diverse Massenmedien stark beeinflussbar ist, mit so einem qualitativen D&#252;nnschiss aufwachsen muss? Und was ist mit den ganzen Erwachsenen? Sollten diese nicht etwas besser in der Lage sein, &#252;ber das, was sie im Fernsehen so sehen, nachzudenken und zu kapieren, was f&#252;r ein Stuss da am laufenden Band serviert wird?</P>

<p>Anscheinend scheint es wirklich nicht viele zu geben, die kapieren, was da wirklich vor sich geht. Eigentlich wirklich schade, denn das Niveau der &quot;Bild Zeitung&quot; hat das Fernsehen l&#228;ngst erreicht, wenn nicht gar unterschritten...</P>

<p>Um zum Abschluss zu kommen, m&#246;chte ich an dieser Stelle einfach noch die Titel zweier, &#228;lterer SciFi Romane anf&#252;hren, die dem, was heutzutage so abgeht, leider schon verdammt nahe kommen: <b>Brave New World</B> und <b>Farenheit 451</B>. Wer diese beiden Romane kennt, kann dar&#252;ber ja mal kurz nachdenken...</P>

<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
