<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>Waschtag</title>
</head>
<body background="wolf1.gif" text=black link=blue bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>Waschtag</font></b></p>

<table border="0" cellpadding="6" width=100%><tr><td>
<p>Jetzt nach den Sommerferien ist f&#252;r manche die Schulzeit zu Ende und der Ernst des Lebens
ist nun greifbar nahe. Greifbar ist meist mit Schmutz einhergehend und da bleibt so
manches T-Shirt leider davon nicht verschont. Muttis Waschmaschine ist nun &#252;ber 200 km
entfernt und morgen abend f&#252;r die Fete sollte es wieder sauber sein. </p>

<p><img src="st_waschtag1.gif" width=198 height=258 border=0 hspace=8 align=left>
So sieht also meine Anleitung aus, die der Hersteller meines Shirts mir mit auf den Weg
gegeben hat. Wenn ich blo&#223; w&#252;sste, was die einzelnen Symbole bedeuten. Waschen bei
30 Grad, das ist doch klar. Das versteht doch jeder, aber nicht im Wigwam, sondern nur
auf dem Parkplatz. Oder was bedeutet sonst das durchgeixte Dreieck und das P-Symbol?
B&#252;geleisen versteht wieder jeder, aber eine Waschmaschine mit einem X? Was das wieder
hei&#223;en soll. Waschen bei 30 Grad, aber ohne Waschmaschine? Verstehe ich nicht. Also ab
zum Waschbecken, etwas warmes Wasser rein und mit viel Seife sch&#246;n geschrubbt. Jetzt
hab ich&#180;s. Das Dreieck mit dem X soll wohl veranschaulichen, wie es ausschaut, wenn
ich das Shirt zum Trocknen auf einen B&#252;gel h&#228;nge. Oder doch etwas anderes? Ist ja auch
egal, Hauptsache bis morgen abend ist es trocken und wenn ich es noch f&#246;hnen muss.
Am Wochenende fahre ich sowieso wieder heim und dann kann ich fragen. <br clear=all></p>
<hr>
<p>Wenn man die Antwort kennt, ist vieles leichter und man ist (man staune) vielen
anderen um Vieles voraus. Als erstes schauen wir uns den Waschtrog an: <br>
<center><img src="st_waschtag1a.gif" width=560 heigth=95></center>
Die Zahlen im Bottich entsprechen der maximalen Waschtemperatur in Grad Celcius. Der
<b>Balken</b> bedeutet Schonwaschgang und der <b>geteilte Balken</b> hei&#223;t Spezial -
Schonwaschgang, bzw. <b>besonders schonende mechanische Behandlung</b>, wie z.B. bei
Wolle. Das letzte Symbol steht f&#252;r "nicht waschen". </p>
<hr>

<p>Das Dreieck:<br>
<center><img src="st_waschtag1b.gif" width=560 heigth=95></center>
Hier gibt es nur diese zwei Symbole: Chlorbleiche m&#246;glich und Chlorbleiche nicht m&#246;glich.
</p>
<hr>

<p>Das B&#252;geleisen:<br>
<center><img src="st_waschtag1c.gif" width=560 heigth=95></center>
Die Punkte kennzeichnen die Temperaturbereiche: <br>
hei&#223; b&#252;geln, m&#228;&#223;ig hei&#223; b&#252;geln, nicht hei&#223; b&#252;geln und nicht b&#252;geln. </p>
<hr>

<p>Der Kreis ist das Symbol f&#252;r die Reinigungstrommel, die chemische Reinigung. <br>
<center><img src="st_waschtag1d.gif" width=560 heigth=95></center> 
Die ersten beiden stehen f&#252;r Kiloreinigung. A = m&#246;glich, P = mit Vorbehalt
m&#246;glich. Das P mit Balken und bei Varianten des F bedeuten: keine
Kiloreinigung. Was A, P und F im Einzelnen bedeuten, wei&#223; ich nicht, aber
ich hoffe, dass die "Chemische Reinigung" Bescheid wei&#223;. Das letzte Symbol
ist auch klar: keine chenmische Reinigung m&#246;glich. </p>
<hr>

<p>Das letzte Sybol ist keine Waschmaschine, sondern ein Trockner, auf Neudeutsch:
ein Tumbler. <br>
<center><img src="st_waschtag1e.gif" width=560 heigth=95></center>
Die Punkte bezeichnen die Trockenstufe und das X, dass m&#246;glichst der
W&#228;schetrockner nicht angeworfen werden sollte.  Das T-Shirt im Frotteehandtuch
eingewickelt und gut geknetet, bewirkt Wunder und reduziert die Trockenzeit
enorm. </p>

</td></tr></table>
<hr size=4>
<center>
<table border="6" width=95%><tr><td>
<p>
Autor: &nbsp; <a href="Mitglieder/zimmer.html">Wolf Zimmer</a>&nbsp; &nbsp; &nbsp;
E-Mail: <a href="mailto:wozim@t-online.de"> wozim@t-online.de</a> <br><font size="2">
Homepage: <a href="http://home.t-online.de/home/wozim"> http://home.t-online.de/home/wozim </a>
und <a href="http://www.apc-tcp.de/members/wolf">
http://www.apc-tcp.de/members/wolf </a></font>
<br>
</td></tr></table>
<br>
</body>
</html>
