<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal,interview,bronx kasket">
<title>Interview: Bronx Kasket & Co.</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">

<p><h1><center><font color="blue">Interview: The Bronx Casket Co.</font></center></h1></P>

<p>Den Namen dieser Combo haben sicher bereits einige geh&#246;rt.... allerdings, wie 
ich so festgestellt habe, noch viel zuwenig. Hinter The Bronx Casket Co. 
verbergen sich D.D. Verni, eigentlich Mitglied von Overkill, Jack Frost, 
Charlie Caly, Tim Mallore und S&#228;nger Spy. Mit einer coolen Mischung aus 
leichten proggigen Anleihen, ein wenig Doom und viel handfesten Metal mit 
Wiedererkennungswert d&#252;rften sich die Jungs mit dem zweiten Album &quot;Sweet Home 
Transylvania&quot; doch eine gute Portion  neuer Fans erspielen. Wobei allerdings 
gleich der erste Song &quot;Jesus Doesn&#180;t Live Here Anymore&quot; durch den Titel und dem 
Songausklang mit der US-Hymne &quot;Amazing Grace&quot; angesichts der Anschl&#228;ge in New 
York und den sich daraus ergebenden Entwicklungen schon arg zynisch anmutet - 
auch wenn hier logischerweise kein Kalk&#252;l dahinter stecken kann. Bekanntlich 
werden Songs dann doch einige Zeit vor der Ver&#246;ffentlichung einer CD 
geschrieben.....</P>

<p><i>Unser Sound ist f&#252;r mich selbst ein wenig schwer zu 
beschreiben, beginnt ein gutgelaunter D.D. Verni (guit) das Gespr&#228;ch. Es ist 
kein Thrash und kein Power Metal, insofern also anders als Overkill, haha. Ich 
finde, gerade die Atmosph&#228;re macht unsere Mucke interessant. Mit &quot;Jesus 
Doesn&#180;t...&quot; oder auch dem Albumtitel wollten wir sicher die Metal- und 
Rockszene ein wenig aufs Korn nehmen, indem wir eben &#228;hnliche Titel, wie sie 
bereits existieren, verwurschtelt haben (z.b. &quot;Jenny Doesn&#180;t Live Here 
Anymore&quot;, &quot;Sweet Home Alabama&quot;,..). Hinter The Bronx Casket steckt schon seit 
jeher eine Menge Zynismus. Wir sind immer ironisch, sarkatisch und eben 
zynisch. Da&#223; allerdings ein Song so heftig wie die Faust aufs Auge pa&#223;t, h&#228;tte 
ich mir aber auch nicht gedacht. Allerdings mu&#223; ich schon zugeben, da&#223; ich 
Amerika, obwohl es meine Heimat ist, auch mit einem zwinkernden Auge betrachte 
- wie auch den Rest der Welt. Niemand h&#228;tte je gedacht, da&#223; ein solches Geb&#228;ude 
wie das World Trade Center je einst&#252;rzen k&#246;nnte. Und nun ist es eben passiert. 
Was ich an der momentanen Situation total gut finde, da&#223; es seitdem keine 
Schwarzen, Juden oder sonstwas mehr in Amerika gibt. Wir sind alle in erster 
Linie Amerikaner.</I></P>

<p>Hoffentlich erz&#228;hltr das auch jemand dem Khu-Klux-Clan. </P>

<p><i>89 
Prozent der B&#252;rger stehen hinter dem Pr&#228;sidenten. So etwas habe ich noch nie 
erlebt. Es ist &#252;berw&#228;ltigend, wie stark das Vertrauen der Menschen in die 
Landesf&#252;hrung ist, schw&#228;rmt D.D.  </I></P>

<p>Dennoch, wie sagte der Nah-Ost-Spezialist 
Peter Scholl-Latour: Noch nie hat ein so dummer Mensch wie Bush junior an der 
Spitze von Amerika gestanden.' Meinungen sind da, damit &#252;ber was streiten kann. 
Tatsache ist aber, da&#223; man nur hoffen kann, da&#223; die bisher gezeigte 
Besonnenheit nicht doch noch in einem sinnlosen Tobsuchtsanfall endet. Denn der 
wird eh nur die falschen treffen. </P>

<p><i>Ich finde es enorm wichtig, die Bek&#228;mpfung 
des Terrors in Angriff zu nehmen. Es w&#228;re eine verdammt wichtige Sache, das 
unter Kontrolle zu bekommen. Ich jedenfalls w&#252;nsche mir f&#252;r meine Kinder eine 
Welt ohne Terroristen. Es ist sicher witzig, da&#223; die Menschen immer dann 
anfangen zusammenzuhalten, wenn die Kacke am Dampfen ist - dann sind alle auf 
einmal ein Team. </I></P>

<p>Dieses Verhalten kann man nun als Unehrlichkeit auslegen, 
wenn man mi&#223;trauisch ist. Geht&#180;s hart auf hart, f&#228;ngt auch jeder auf einmal an 
zu beten. Nur wenn&#180;s einem gut geht, dann vergi&#223;t man den n&#228;chsten gerne mal. </P>

<p><i>Ich finde dennoch, da&#223; dieser Zusammenhalt eine ehrliche Sache ist. Wenn in 
Zeiten ohne gr&#246;&#223;ere Krisen wegen jedem K&#228;se diskutiert wird, ist das doch okay, 
solange es einem weiter bringt. Religionsfreiheit ist eine wichtige Sache, aber 
wenn sie so ausartet, ist das nicht mehr lustig.</I></P>

<p>Wobei auch nirgends im Q`uran 
steht, man solle Selbstmordattentate begehen und w&#252;rde dann von weigewandeten 
Jungfrauen im Himmel XY erwartet. Aber solchen Bl&#246;dsinn lassen sich arme, von 
der Regierung unten gehaltene Menschen anscheinend gern erz&#228;hlen. Und daran 
&#228;ndert leider auch der starke Nationalstolz der Amerikaner nichts, den auch 
D.D. komplett genial findet. Sicher ist bewundernswert, wenn sich ein Land nach 
einem solchen Schlag nicht unterkriegen l&#228;&#223;t. Doch sollte man sich mal fragen, 
wie um alles in der Welt ein derart gewaltiger Ha&#223; und so wenig Liebe zum 
eigenen Leben entstehen kann. Was diese Attentate ganz bestimmt aber auch nicht 
im Ansatz rechtfertigt. </P>




<P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
