<HEAD>
<TITLE>
AGAMA AGILIS </TITLE>
</HEAD>

<BODY>
<a href="AXOLOTL.HTML"><img src="ALEFT.GIF"></a> <a href="POGONA.HTML"><img src="ARIGHT.GIF"></a><hr>
<h2>
<CENTER>H a l t u n g s b e r i c h t</CENTER>
<p>
<CENTER><img align=middle src="I_AGAMA2.GIF"> AGAMA AGILIS ssp.</h2></CENTER> 

<hr>

<B>Synonyme: </B>
<UL>
<LI>AGAMA SANGUINOLENTA
<LI>AGAMA AGILIS SANGUINOLENTA
<LI>AGAMA HARTMANNI
<LI>AGAMA PALLIDA
<LI>AGAMA MUTABILIS
<p>
<LI>Asiatische Steppenagame
</UL>
<hr>
<b>Inhalt</b>
<p>
0.  Einleitung <br>
<P>
1.  Beschreibung der Arten (Literatur)<br>
1.1 Agama agilis<br>
1.2 Agama sanguinolenta<br>
1.3 Verbreitung<br>
1.4 Haltung<br>
<P>
2.  Haltungsprotokoll<br>
2.1 Aussehen<br>
2.2 Terrarium<br>
2.3 Haltungsbedingungen<br>
2.4 Verhalten/Haltung<br>
2.5 Nahrung<br>
2.6 Ausf&auml;lle<br>
2.7 Besonderheiten<br>

<hr>

<P ALIGN="LEFT"><b>0. Einleitung</b></P>
<P ALIGN="LEFT">Die Art <a href="AAGILIS1.JPG">Agama agilis</a> ist in wenigen Literaturquellen zu finden.  Bei
dem Gelsenkirchener H&auml;ndler, von dem die ersten 5 Tiere erstanden
worden sind, wurde die Art als afrikanische "Hartmanns Agame"
deklariert.  Das ist aber m&ouml;glicherweise falsch.  Im Nietzke "Die
Terrarientiere 2" fand sich eine Abbildung, die ziemlich genau unseren
Tieren entspricht.  Dabei handelte es sich um Agama sanguinolenta, die
asiatische Steppenagame.  Im Kosmos "Handbuch der Terrarienkunde" wird
eine Unterart Agama agilis sanguinolenta beschrieben, die vermutlich
mit A.agilis (A.sanguinolenta) identisch ist.  Die Ausf&uuml;hrungen
beziehen sich alle auf diese Quellen.  Gro&szlig;e &Auml;hnlichkeit in der
Beschreibung weist auch Agama mutabilis(=pallida) auf; ihre Verbreitung
erstreckt sich auch auf Nordafrika, so da&szlig; Afrika als Herkunftsland
plausibel erscheinen kann.  W&auml;hrend eines Besuches des Gelsenkirchener
H&auml;ndlers im Dezember `94 sahen wir eine dritte Variante, diesesmal als
cf.hartmanni deklariert.  Sie wirkte insgesamt gedrungener als unsere
Exemplare und war sehr hell, entsprach damit eher dem mutabilis-Typus.
</P>
<P ALIGN="LEFT"><b>
1. Beschreibung der Arten (Literaturquellen):
</b></P><P ALIGN="LEFT"><b>
1.1. A.agilis:
</b></P>
<P ALIGN="LEFT">Gr&ouml;&szlig;e 20-22 cm, recht langschw&auml;nzig, verh&auml;ltnism&auml;ssig kr&auml;ftige
Gliedmassen - hinten l&auml;nger als vorne - mit langen scharfen Krallen.
Oberseite sandfarben mit dunklen Querstreifen, auf der R&uuml;ckenlinie
rhombisch verbreitert mit lichtem Mittelfleck.  Hell-dunkel geb&auml;nderte
hintere Schwanzh&auml;lfte.  In der Erregung nimmt die Kehle eine
kobaltblaue F&auml;rbung an.  Die Unterseite ist hell.  Eierlegend.
</P>

<P ALIGN="LEFT"><I>A.agilis sanguinolenta:</I></P>

<P ALIGN="LEFT">L&auml;nge 12+18 cm.</P> 

<P ALIGN="LEFT"><b>
1.2. A.sanguinolenta:
</b></P>

<P ALIGN="LEFT">Eine kleinere, zierliche Agamenart.  Der d&uuml;nne Schwanz tr&auml;gt
schindelartige Schildchen.  Die K&ouml;rperfarbe ist lehmgelblich bis
braungrau, mit unbestimmten Flecken auf der Oberseite.  Dunkle
Querstreifen finden sich auf Schwanz und Beinen.  Bei Wohlbefinden und
Erregung wird die Unterseite des K&ouml;rpers bl&auml;ulich.  Oberseite und Kehle
nehmen schliesslich eine ultramarinblaue F&auml;rbung an.  Die Hautfarbe kann
allerdings auch einen gr&uuml;nlichen oder weinroten Ton annehmen.  Dabei
werden die unbestimmten Flecken auf der Oberseite zinnoberrot.
Spitzname:  "Russisches Cham&auml;leon".
</P>
<P ALIGN="LEFT"><b>
1.3. <a href="AAGILIS2.GIF">Verbreitung</a>
</b></P>
<P ALIGN="LEFT">A.agilis:
Pakistan, Iran, Irak, Afghanistan.  Trockensteppe, Bodenbewohner.
</P>
<P ALIGN="LEFT">A.agilis sanguinolenta:
Mittelasien, in Sand-, Lehm-, und Steinsteppen mit Pflanzenwuchs, in
der N&auml;he von Wassergr&auml;ben.
</P>
<P ALIGN="LEFT">A.sanguinolenta:
Mittelasiatische Steppengebiete, auch auf kultivierten L&ouml;ssb&ouml;den.
</P>
<P ALIGN="LEFT"><b>
1.4. Haltung
</b></P>
<P ALIGN="LEFT">A.agilis:<br>
Luft 34°C, Boden lokal 40°C.  Nachts Abk&uuml;hlung.  Trockenterrarium,
l&auml;nger als hoch.  Futter:  Insekten, schnell bewegliche Futtertiere.
Reizbar.</P>

<P ALIGN="LEFT">A.agilis sanguinolenta:<br>
Sehr anpassungsf&auml;hig, vertr&auml;glich und ausdauernd.  Volle Besonnung,
Pflege in der Sommerfrische m&ouml;glich, bodenlebend.
</P>
<P ALIGN="LEFT">A.sanguinolenta:<br>
Luft 30°C, Boden lokal 35°C.  Nachts Abk&uuml;hlung.  Trockenterrarium,
l&auml;nger als hoch.  Sonne !  Das Trinkbed&uuml;rfnis ist gr&ouml;&szlig;er als bei
anderen Agamen.  Futter:  Insekten, gelegentlich pflanzliche Nahrung.
Reizbar.  Eine Ruhezeit im Winter kann eingeschaltet werden
(herabgesetzte Temperaturen).
</P>

<P ALIGN="LEFT"><b>
2. Haltungsprotokoll
</b></P>

<P ALIGN="LEFT">Anschaffung
</P>
<p>
a) 7/941,1 <br>
b) 7/941,1 <br>
c) 7/940,1 <br>
d) 5/95 0,2 <br>
e) 6/95 1,1  Preise zwischen 30,--DM und 60,--DM.<br>

<P ALIGN="LEFT"><b>
2.1. Aussehen
</b></P>
<P ALIGN="LEFT">Die Grundfarbe aller Tiere ist ein heller Sandton.  Der R&uuml;cken wird
durch ein braunes Fleckenmuster aufgelockert, das bei b) jedoch st&auml;rker
in Erscheinung tritt.  Insbesondere die Weibchen von b) trugen ein
braun-beiges Schachbrettmuster.  Das k&ouml;nnte allerdings auch untypisch
sein, da die Weibchen b) nur relativ kurze Zeit &uuml;berlebten.  Die
<a href="AAGILIS3.JPG">M&auml;nnchen</a> tragen einen tiefblauen bis violetten Kehlsack, einzelne
Schuppen sind blau irisierend.  Der hintere Teil des Kehlsacks ist bis
zum Hals schwarz gef&auml;rbt.  Die Blauf&auml;rbung tritt auch noch an den
Flanken auf, wenn auch nicht so intensiv.  Die Kehle der Weibchen ist
oft hell/dunkel marmoriert.  Der Schwanz aller Tiere ist meist deutlich
hell/dunkel gestreift.  Die Tiere variieren je nach Temperatur und
Befinden ihre F&auml;rbung, so da&szlig; die M&auml;nnchen auch einmal die
Weibchenf&auml;rbung tragen.  Nachts sind die Tiere manchmal dunkler und
st&auml;rker braun gefleckt als tags&uuml;ber.  Gelegentlich taucht bei a)
entlang der R&uuml;ckenlinie eine olivbraune Linie auf.  Zur Zeit (1/95) ist
das M&auml;nnchen von a) am R&uuml;cken dunkelbraun mit beigen Flecken gef&auml;rbt
und tr&auml;gt eine olivbraune R&uuml;ckenlinie.  Das M&auml;nnchen von b) ist
permanent sandfarben mit angedeutetem Schachbrettmuster.  d) und e)
enthalten als neue Variante eine Art mit gekielten Schuppen, die
insgesamt schmutzigfarben wirkt.  Die Schnauze ist relativ k&uuml;rzer als
bei den anderen Arten.
</P>
<P ALIGN="LEFT">Bei a), b) und d) scheint es sich um regionale Unterarten zu handeln,
da sich insbesondere die M&auml;nnchen farblich unterscheiden.  Die Ssp.  a)
ist auf den ersten Blick insgesamt kontrast&auml;rmer als b).  Die Tiere
d)e) sind offenbar nochmals eine regionale Unterart, ausgewiesen wurden
sie als A.pallida, "&auml;gyptische ...agame".  Sieht aber eher nach agilis
aus.</P>


<P ALIGN="LEFT">Die sechs Tiere gliedern sich jetzt so auf:</P>

1,2 kariert, vermutlich agilis sanguinolenta <br>
1,1 dornig, vermutlich mutabilis<br>
1,0 meliert, vermutlich agilis agilis<br>


<P ALIGN="LEFT"><b>
2.2. Terrarium
</b></P>
<P ALIGN="LEFT">Die <a href="AAGILIS4.JPG">Tiere</a> bewohnen seit ihrer Anschaffung ein Terrarium mit den Massen
150L*45B*45H.  Die Beleuchtung besteht aus 2 Leuchtstoffr&ouml;hren 36W
120cm und 2(1) Strahlern E14 zu 40W.  Die Drosselspulen der
Leuchtstoffr&ouml;hren sind unter einer sandbeschichteten Alu-Platte auf dem
Boden befestigt.  Boden und Decke sind mit Gipsmilch gestrichen, die
R&uuml;ck- und Seitenw&auml;nde sind mit strukturierten 0.5cm Styroporelementen,
die hellgelb abget&ouml;nt sind, verkleidet.  Die Be- und Entl&uuml;ftung sichern
drahtnetzbespannte L&uuml;ftungsschlitze 5*150cm an der oberen R&uuml;ckwand und
vier 10cm "Bullaugen" an den Seitenw&auml;nden.  Die Front wird durch 2
seitlich verschiebbare Glasscheiben gebildet.  Das Terrarium ist Teil
einer Anlage aus drei Einheiten &auml;hnlicher Gr&ouml;&szlig;e.
</P>
<P ALIGN="LEFT"><b>
2.3. Haltungsbedingungen
</b></P>
<P ALIGN="LEFT">Das Terrarium wird von 9-18 Uhr beleuchtet.  Die Aufheizung erfolgt
durch die Drosselspulen und die Strahler.  Nach dem Ausschalten der
Beleuchtung k&uuml;hlt das Terrarium langsam auf die Wohnraumtemperatur ab.
Die Temperaturspitzen liegen bei ca.  30-35°C im oberen Terrarienteil,
bei zu gro&szlig;er Erw&auml;rmung werden die Punktstrahler abgetrennt.  Auf den
im Terrarium plazierten Drosselspulen erreicht die Bodentemperatur weit
&uuml;ber 40°C.  Nachts kann die Temperatur bis auf 17-18°C fallen.
Feuchtigkeit erh&auml;lt das Terrarium nur durch das kleine Trinkgef&auml;ss und
eine bodenwuchernde Kletterfeige im rechten Terrarienteil, die morgens
&ouml;fter, abends gelegentlich mit dest.  Wasser bespr&uuml;ht wird.  In der
Mitte des Terrariums befindet sich eine getopfte Sukkulente.  Die
Luftfeuchte schwankt so zwischen minimal 30% relative Feuchte tags&uuml;ber
und maximal 70-80% nachts.
</P>
<P ALIGN="LEFT"><b>
2.4. Verhalten/Haltung
</b></P>
<P ALIGN="LEFT">Die Agamen sind relativ selten aktiv, wirken aber meist sehr wach und
verfolgen interessiert Bewegungen ausserhalb des Terrariums.  Gerne
sonnen sie sich unter den Strahlern, ziehen sich aber auch oft in
k&uuml;hlere Bereiche des Terrariums zur&uuml;ck.  Scheu sind sie nicht, oft
stehen sie auf den Hinterbeinen an der Frontscheibe und warten
buchst&auml;blich darauf, da&szlig; man sie herausl&auml;sst.  Mit einem gewagten Sprung
landen sie dann auf der Kleidung des Pflegers und erklettern schnell
eine bessere und h&ouml;here Aussichtsposition, um dann wieder Ausschau zu
halten.  Dem Herausnehmen kann man sich schwer entziehen, da die Tiere
sehr niedlich sind und wirklich keinerlei Scheu haben.  Insbesonder
trifft dies auf b) zu.  Das M&auml;nnchen erzwingt so oft einen Rundlauf
durch das Zimmer.  Untereinander kann man bei diesen Agamen kaum
Streitereien beobachten, obwohl eine eindeutige Rangordnung festliegt.
Sonnen sich zwei M&auml;nnchen an derselben Stelle, dann liegt das
rangh&ouml;here eben teilweise auf dem rangniedrigeren Tier.  Beissereien
sind selten zu beobachten, es &auml;hnelt mehr einem Zwicken in die
Nackenregion.  Sehr h&auml;ufig sind man ein dreimaliges, ruckartiges
Kopfnicken bei hin und wieder aufgestelltem Kehlsack, wenn sich zwei
oder mehrere Tiere begegnen, allerdings nicken die Tiere auch solo
h&auml;ufig.  Die H&auml;utung erfolgt &uuml;ber mehrere Tage hinweg.  Die Tiere
verlieren ihre alte Haut nur st&uuml;ckweise.  Nachts suchen die Tiere keine
H&ouml;hlen o.&auml;.  auf.  Sie dr&uuml;cken sich leicht in Nischen oder &uuml;bernachten
frei oder sogar auf etwas derberen Pflanzen (Sukkulentenb&auml;umchen).
</P>
<UL>
<LI>14.02.:  Die Einrichtung wird durch eine schr&auml;g nach oben aufgestellte
Korkrinde erg&auml;nzt.  Die Tiere finden das toll und sind fast
ausschliesslich oben auf der Rinde beim Sonnen zu finden.

<LI>07.03.:  Der letzte Strahler wird abgedreht, da die Temperatur im
oberen Terrarienteil zu hoch scheint (35°C).  Die Tiere finden das
nicht so toll und verlassen ihren Rindenplatz nahe der Leuchtstoffr&ouml;hren oft, um sich auf den Bodenplatten aufzuw&auml;rmen.

<LI>17.04.:  Die beiden machen immer noch den Eindruck, als seien sie im
Winterschlaf.  Wir behalten die Temperatur bei...

<LI>24.04.:  Sie werden agiler!

<LI>20.05.:  Sie werden immer verw&ouml;hnter und bevorzugen eindeutig
Wachsmaden, an die sie auch sofort herangehen.  Motten und Grillen nur
selten, insbesondere der Macker Nr.2.  Ein Test mit Regenw&uuml;rmern geht
daneben.  Die vorgestreckte Zunge der Agamen glitscht an der
schleimigen Oberfl&auml;che ab.  Die Viecher geben auf, desinteressiert.

<LI>27.05.:  Sie vermissen ihre Wachsmaden und gucken aus dem Fenster ;).

<LI>31.05.:  Endlich neues Blut im Terrarium, die zwei neuen Weiber 
halten hoffentlich besser durch als die vorherigen.  Mal sehen, was
unsere eingefleischten Junggesellen machen werden !

<LI>03.06.:  Der lebenslustigere Bock paart sich mit dem j&uuml;ngeren Weibchen,
das in den letzten Tagen wie ein Scheunendrescher gefressen hat, alles
was kam:  Wachsmaden und -motten, Heuschrecken.  Das scheue Weibchen
(ist auch viel &auml;lter) trinkt mittlerweile vom Blatt.

<LI>10.06.:  Die Tiere sind ziemlich eingew&ouml;hnt, fressen mittlerweile
beide.  Allerdings muss man die alte als letzte und vorsichtig mit
Wachsmaden f&uuml;ttern, sie ist etwas zur&uuml;ckhaltend.  Tags&uuml;ber h&auml;ngen sie
zusammen auf den Steinbrocken rum.  Teilweise &uuml;bereinander.  Wie
gehabt.

<LI>24.06.:  Zwei neue Tiere kommen hinzu, die sofort ans Futter gehen.
Jetzt sind es insgesamt sechs Tiere, eine sch&ouml;ne Zuchtgruppe.  Das ne&uuml;
Weibchen ist wohl auch tr&auml;chtig.  Endlich ist richtig was los.  Ne&uuml;
Kletterm&ouml;glichkeiten werden geschaffen, st&auml;ndig gibt es kleine
Eifers&uuml;chteleien um die besten Pl&auml;tze .  Das karierte M&auml;nnchen frisst
immer noch nicht.  Heute habe ich ein paar kleine Beulen am linken
Unterkiefer entdeckt, Rachitis?  Ich habe mir vorgenommen, jetzt
konsequenter zu bestrahlen.

<LI>27.06.:  Das M&auml;nnchen stirbt fr&uuml;hmorgens.  Schade.

<LI>30.06.:  1,0 dornig wird in ein eigenes Terrarium gesetzt, um sich von
den Angriffen des 1,0 meliert zu erholen, der jetzt als alpha-Bock
m&auml;chtig aufdreht.  Das wird 1,0 dornig bekommen!  Er frass auch sofort ne
Menge.

<LI>02.07.:  Wir finden zwei Eier im Terrarium, ganz oben auf einer
Korkrinde.  Eines ist befruchtet und eingefallen, das andere
unbefruchtet. Von welchem Weibchen, ist unklar.

</UL>

<P ALIGN="LEFT"><b>
2.5. Nahrung
</b></P>
<P ALIGN="LEFT">Angeboten wurde zwar kein umfangreiches Spektrum, aber Insekten sind
eindeutig die Lieblingsnahrung.  Vegetarische Kost wurde nur selten
anger&uuml;hrt.  Die Tiere zeigen eine besondere Vorliebe f&uuml;r sich schnell
bewegende Futtertiere, denen sie mit Begeisterung hinterherjagen.
Zeitweise sind sie allerdings recht faul und nehmen lieber langsame
wurmartige Nahrung.  Heimchen lassen sie dann links laufen, St&uuml;cke von
zerteilten Schwarzk&auml;ferlarven werden begeistert genommen.  Die Gr&ouml;&szlig;e
der Futtertiere kann Ausmasse erreichen, die man den zierlichen Tierchen
gar nicht zutraut.  Selbst Heuschrecken vor der letzten H&auml;utung und
ausgewachsene Grillen werden genommen.  Schwarzk&auml;ferlarven, denen
vorher der Kopf abgetrennt wurde, verschlingen sie auch.  Der
Feuchtigkeitsbedarf ist z.T relativ hoch, denn das M&auml;nnchen b) leckt
fast jeden Morgen die bespr&uuml;hten Pflanzen ab.  Das M&auml;nnchen a)
bevorzugt da eher frisches Obst.  Allerdings sieht man nur &auml;usserst
selten, da&szlig; das angebotene Trinkgef&auml;ss angenommen wird, obwohl jedes
Tier auf seiner Terrariumschleife in diesem hin und wieder einmal
landet.  Als Trinkwasserreservoir wird es jedoch nicht erkannt.  Zur
Zeit (Winter 94/95) scheint die Aktivit&auml;t etwas herabgesetzt zu sein.
Das mag auf eine leichte Winterruhe hindeuten.  Die Temperaturen werden
trotzdem auf 25-35°C belassen.  Die Strahlerbirnen werden zeitweise
abgedreht.</P>

<P ALIGN="LEFT">Gefressen wurden:</P>
<UL>
<LI>Bananen
<LI>Geh&auml;useschnecken(klein)
<LI>Grillen(gro&szlig;)
<LI>Heimchen(gro&szlig;)
<LI>Mandarinen
<LI>Papayas
<LI>Schmetterlinge
<LI>Schwarzk&auml;ferlarven(kopflos)
<LI>Spinnen
<LI>Wachsmaden
<LI>Wachsmotten
<LI>Wanderheuschrecken(bis 4.H&auml;utung)
<LI>Wiesenplankton
</UL>
<P ALIGN="LEFT"><b>
2.6. Ausf&auml;lle
</b></P>
<P ALIGN="LEFT">a) 10/94 0,1 das sehr agile Weibchen mit deutlichem
Durchsetzungsverm&ouml;gen gegen&uuml;ber den M&auml;nnchen starb vermutlich an
Legenot, da es zunehmend aufgebl&auml;ht wirkte und sich im Verlauf der
Beobachtung mehr und mehr der unangenehmen Bauchlage beim Sonnen durch
Aufstellen der Beine zu entziehen versuchte.  Es frass allerdings immer
sehr gut.  Zum Schluss konnten wir das augenscheinliche Leiden jedoch
nicht mehr ertragen und haben das Weibchen eingefroren.
</P>
<P ALIGN="LEFT">b) 7/94 0,1 Das Weibchen lebte nur einen Tag.  Es war ausgewachsen und
zeigte permanent das oben beschriebene Schachbrettmuster auf dem
R&uuml;cken.  Es zeigte ein ausgesprochenes W&auml;rmebed&uuml;rfnis, frass nur
einmal, und starb dann &uuml;berraschend.  Es wirkte sehr ausgetrocknet.
</P>
<P ALIGN="LEFT">b) 8/94 0,1 Das zweite Weibchen schien zun&auml;chst sehr gut
akklimatisiert.  Aus uns unbekannten Gr&uuml;nden verstarb es wenige Wochen
nach der Anschaffung.  Nach einer anf&auml;nglich sichtbaren Erholungsphase
baute es schlagartig ab und starb.  Die zuletzt angenommene F&auml;rbung
entsprach wieder dem o.a.  Schachbrettmuster.
</P>
<P ALIGN="LEFT"><b>
2.7. Besonderheiten
</b></P>
<P ALIGN="LEFT">Die Agamen k&ouml;nnen die beiden Augen nahezu unabh&auml;ngig voneinander
bewegen.  Beim Fressen schnappen sie nicht immer zu, sondern schnellen
oft die ausgefahrene Zunge vor.
</P>
<p>
<H5>(C) Gerald Gantschnigg G.GANTSCHNIGG@raptor.dontpanic.sub.org</H5>

<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>