<HEAD>
<TITLE>
Axolotl </TITLE>
</HEAD>

<BODY>
<a href="TFORUM.HTML"><img src="ALEFT.GIF"></a> <a href="AAGILIS.HTML"><img src="ARIGHT.GIF"></a><hr>
<h2>
<CENTER>                Wissenswertes &uuml;ber artgerechte Haltung, Pflege und Ern&auml;hrung von
</CENTER>
<p>
<CENTER><img align=middle src="I_AXOLO2.GIF"> AMBYSTOMA MEXICANUM (Axolotl)</CENTER>
</h2>
<hr>

<P ALIGN="LEFT"><B>Beschreibung:</B>  Der Axolotl ist das bekannteste Beispiel eines im
neotenischen Zustand verharrenden Molches.  Axolotl gelten als relativ
unproblematisch in der Haltung.  Bewegungsdrang und ein langer Schwanz
gebieten Grossaquarien ab 100l Inhalt.  Die Umgebungstemperatur soll
bei 15 bis 22 Grad liegen.  Neben den <a href="AXOLOTL2.JPG">normalen, dunkel gef&auml;rbten Tieren</a> 
gibt es auch albinotische Formen (wei&szlig; mit roten Augen).</P>

<P ALIGN="LEFT"><B>L&auml;nge:</B>  M&auml;nnchen bis 27cm und Weibchen bis 24cm.  Vereinzelte Tiere
bis 30 cm.  L&auml;nge der Larven beim Schl&uuml;pfen ca.  1cm.
</P>
<P ALIGN="LEFT"><B>Lebensdauer:</B> 10-13 Jahre</P>

<P ALIGN="LEFT"><B>Geschlechtsreife:</B>  Neotenische Larven nach ca.  1 Jahr.
Metamorphisierte Axolotl erst nach 4-5 Jahren.  M&auml;nnchen haben
vergr&ouml;&szlig;erte Seitenw&uuml;lste an der Kloake.  Ovipar, 200-600 Eier.
Keine Paarung, sondern &auml;ussere Befruchtung.
</P>
<P ALIGN="LEFT"><B>Inkubation:</B>  Ca.  28-30 Tage bei 13-14 Grad, oder 8-10 Tage bei 20-22
Grad.  Bei wechselnden Temperaturen erfolgt das Schl&uuml;pfen der Larven
nach 2-3 Wochen.</P>

<P ALIGN="LEFT"><B>Verbreitung:</B>  Mittelamerika, Mexico, wildlebend nur im Kanalsystem des
ehemaligen Sees von Xochimilco, s&uuml;d&ouml;stlich von Mexico City.
</P>
<P ALIGN="LEFT"><B>Aktivit&auml;t:</B> Am Tage und w&auml;hrend der D&auml;mmerung.
</P>
<P ALIGN="LEFT"><B>Temperatur:</B>  15-22 Grad Wassertemperatur, minimal 2, maximal 25 Grad.
Unterhalb von 10 Grad verf&auml;llt der Axolotl in eine Starre und stellt
die Nahrungsaufnahme ein.</P>

<P ALIGN="LEFT"><B>Metamorphose:</B>  Die Axolotl werden schon im Larvenstadium
fortpflanzungsf&auml;hig, eine Metamorphose zum landlebenden Molch
entf&auml;llt (Neotenie).  Die <a href="AXOLOTL3.JPG">Metamorphose</a> kann k&uuml;nstlich durch F&uuml;ttern
von Schilddr&uuml;senhormon ausgel&ouml;st werden.  Durch langsame Erh&ouml;hung
der Temperatur (von 12-14 Grad auf 22-25 Grad) und einer langsamen
Absenkung des Wasserspiegels wird dieser Vorgang noch verst&auml;rkt.
</P>
<P ALIGN="LEFT"><B>Unterbringung: </B>Ungeheiztes Aquarium, ca. 130l f&uuml;r 3-5 Exemplare.

Wasserwerte:  Um den Neutralpunkt (pH=7), Schwankungen zwischen pH 6
bis 8.5 werden toleriert.  Die t&ouml;dlichen Werte liegen im alkalischen
Bereich bei pH 10 bis 12 und im sauren bei pH 4 bis 3.5.  G&uuml;nstig ist
eine dH von 6 bis 7 Grad, aber auch 16 Grad sind m&ouml;glich.
</P>
<P ALIGN="LEFT"><B>Ausstattung:</B> Sand, Kies, einige grobe Steine. Gute Durchl&uuml;ftung.
</P>
<P ALIGN="LEFT"><B>Bepflanzung:</B> Elodea, Myriophyllum, Quellmoos.
</P>
<P ALIGN="LEFT"><B>Heizung:</B> Entf&auml;llt.</P>

<P ALIGN="LEFT"><B>Licht:</B> Schattiger Stand.</P>

<P ALIGN="LEFT"><B>Futter:</B>  Neben Insekten werden Regen-, Laub- und Tauw&uuml;rmer,
Enchytr&auml;en, Wasserfl&ouml;he und M&uuml;ckenlarven gefressen.  Bei gr&ouml;&szlig;eren
Exemplaren feine Sreifen Rinderherz oder Frischfleisch,
S&uuml;sswasserfische, neugeborene M&auml;use/V&ouml;gel veraabreichen.
Abwechslungsreich f&uuml;ttern.  Die Junglarven mit Kleinfutter versorgen.
</P>
<P ALIGN="LEFT"><B>Vertr&auml;glichkeit:</B>  Gut, es muss f&uuml;r ausreichendes Futter gesorgt
werden, da die Tiere sich sonst -vor allem die Kiemen- verst&uuml;mmeln.
</P>
<P ALIGN="LEFT"><B>&Uuml;berwinterung:</B> entf&auml;llt.
</P>
<p>
(C) Gerald Gantschnigg G.GANTSCHNIGG@raptor.dontpanic.sub.org


<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>