<HEAD>
<TITLE>
Cichlasoma Nigrofasciatum </TITLE>
</HEAD>

<BODY>
<a href="AFORUM.HTML"><img src="ALEFT.GIF"></a> <a href="SURINAM.HTML"><img src="ARIGHT.GIF"></a><hr>
<h5>© 1995 (C) Timo Pruente 
e-mail ARDEOLA@raptor.dontpanic.sub.org <hr>
</h5>
<h1><CENTER>Zuchterfahrung</CENTER> </h1>
<h2><CENTER><img align=middle src="I_CICHL2.GIF"> CICHLASOMA NIGROFASCIATUM (wei&szlig;e Form)</CENTER> 
</h2>
<hr> 
<P ALIGN="LEFT">Hmm, da hat man nun ein 80er Becken und wei&szlig; nicht, was man f&uuml;r
Fische halten soll.  Malawianer hatte ich schon, Westafrikaner waren 
auch schon mal mit Steatocranus vertreten.  Also bin ich an einem 
Wintertag einfach mal zu meinem Aquarienh&auml;ndler gefahren, um einfach 
mal zu schauen.Beim Gucken blieb es nicht.  Als erstes, als ich 
eintrat, fiel mir sofort ein Schwarm von ca.  25, 5-12cm gro&szlig;en, 
wei&szlig;en Cichliden auf.</P>

<P ALIGN="LEFT">Sie stellten sich als mittelamerikanische <a href="CICHLASO.JPG">Cichlasoma nigrofasciatum</a>
heraus, welche ca.  15 cm lang werden, und ab entsprechender Gr&ouml;&szlig;e 
auch einen nicht gerade kleinen Fettbuckel kriegen (M&auml;nnchen).  Die 
Weibchen lassen sich durch eine creme-gelb- bis orangefarbene Dorsale 
erkennen.  Die M&auml;nnchen haben nur eine wei&szlig;-rosa Grundfarbe. 
W&auml;hrend der Laichzeit f&auml;rbt sich das Weibchen fast vollkommen 
orange.</P>

<P ALIGN="LEFT">Ich habe die Fische also in mein mit Pflanzen und Steinen  dekoriertes 
Aquarium gesetzt, wo sie in Gesellschaft von 10 Hyphessobrycon 
herbertaxelrodi, 4 Ancistrus dolichopterus und 2 Corydoras schwammen. 
Der ph-Wert lag um 7,5, die Temperatur betrug 26 Grad.</P>

<P ALIGN="LEFT">Bereits nach 1 1/2 Wochen zeigten die Fische (insbesondere das 
M&auml;nnchen) Balzverhalten.  K&ouml;rpersch&uuml;tteln, Kiemendeckelspreizen, 
die &uuml;blichen Merkmale.  Die bei amerikanischen Cichliden &uuml;bliche 
Buddelei begann.  Jedoch wurden Pflanzen unbehelligt gelassen.  Das 
Weibchen zeigte sich in kr&auml;ftigem Orange und angef&uuml;lltem Unterleib. 
</P>
<P ALIGN="LEFT">Nach gut einer Woche Balz folgte dann die Eiablage.  Ca.  100 
hellgraue Eier klebten in einer Ecke des Aquariums unterhalb des 
Innenfilters, wo schon eine Grube zur Aufnahme der Larven bereit 
stand.  Bei der Brutpflege scheinen sich beide Partner abzuwechseln. 
Durch leichtes gegenseitiges "Anbeissen" erkl&auml;rt der nichtpflegende 
Partner dem Pflegenden, da&szlig; er auch mal "ran m&ouml;chte".  Nach 5 Tagen 
intensiver Pflege scl&uuml;pften dann fast alle Larven.  Die Schlupfrate 
lag bei 95 %.  Die nicht schwimmf&auml;higen Larven wurden von beiden
Partnern in die Grube unterhalb des Filters gespuckt.  Nach weiteren 5 
Tagen folgte das Freischwimmen der "kleinen" Cichlasoma.  Spezielle 
Futteranspr&uuml;che stellten sie nicht, so da&szlig; ich sie problemlos im 
Zuchtbecken mit zerriebenem Flockenfutter aufgezogen habe. 
</P>
<P ALIGN="LEFT">Leider kamen nur ca.  25 Fische durch, da ich einen entscheidenen 
Fehler begangen habe.  Der Sog des mechanischen Filters war zu stark 
f&uuml;r die Jungfische, so da&szlig; mehr als die H&auml;lfte der geschl&uuml;pften 
Tiere im Filter verendete.  Traurig!  Nach der Installation eines 
Luftbetriebenen 3.95 DM Filters klappte die Aufzucht problemlos. 
Bei meinem H&auml;ndler schwimmen jetzt 3-4 cm gro&szlig;e Cichlasoma 
nigrofasciatum im Pflanzenbecken.  
</P>
<P ALIGN="LEFT">Leider lernt man nur aus Erfahrung.  Setze nie ein P&auml;rchen ohne genug 
Versteckm&ouml;glichkeiten in ein 60er Becken.  Das Weibchen musste ich 
leider mangels Versteckm&ouml;glichkeiten tot aus dem Becken fischen. 
</P>
<P ALIGN="LEFT">Nach Revision des Cichlasoma Artenkomplexes, heisst C.nigrofasciatum 
nun Archocentrus nigrofasciatum, er ist aber trotzdem noch unter 
C.nigrofasciatum im Handel zu finden. 
</P>

<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>