<HEAD>
<TITLE>
Futtertiere </TITLE>
</HEAD>

<BODY>
<a href="SURINAM.HTML"><img src="ALEFT.GIF"></a> <a href="HAERTE.HTML"><img src="ARIGHT.GIF"></a>
<hr>
<h4><P ALIGN="LEFT">Diese Ausarbeitung wird permanent erweitert und kann durch eigene Erfahrungen erg&auml;nzt werden.
Einsendungen bitte an G.Gantschnigg@Raptor.dontpanic.sub.org</P></h4><hr>
<h1> <CENTER>Futtertiere in der Aquaristik und Terraristik</CENTER></h1><hr><h5>  
<P ALIGN="LEFT">                   Autoren:</P>
                   
<P ALIGN="LEFT">                   Gerald Gantschnigg
                   (G.Gantschnigg@raptor.dontpanic.sub.org)
 </P>
<P ALIGN="LEFT">                   Stef A. Pagel
                   (StefPagel@raptor.dontpanic.sub.org oder
                   FIDO 2:2444/8013.13)
</P>
<P ALIGN="LEFT">                   Thomas Seehaus
                   (FIDO 2:2468/9950.9)
</P>
 <P ALIGN="LEFT">                  u.a.</P></h5>
<hr>
<h2>
<b>I N H A L T</b></h2>
<p>         
          1. - Warum Lebendfutter ? <BR>
          2. - Futtertiere der Natur entnehmen <BR>
          3. - Wiesenplankton<BR>
          4. - Futtertiere sammeln <BR>
          5. - aquatile Futtertiere <BR>
          6. - Futtertiere im Angler-Fachhandel <BR>
          7. - Futtertiere im Zoofachhandel <BR>
          8. - Warum Futterzuchten ? <BR>
          9. - Futtertierzucht Grillen und Heimchen <BR>
         10. - Futtertierzucht Schaben <BR>
         11. - Futtertierzucht Wanderheuschrecken <BR>
         12. - Futtertierzucht Schwarzk&auml;fer <BR>
         13. - Futtertierzucht Stab- und Gespenstschrecken <BR>
         14. - Futtertierzucht Regenw&uuml;rmer <BR>
         15. - Futtertierzucht Wachsmotten <BR>
         16. - Futtertierzucht Springschw&auml;nze <BR>
         17. - Futtertierzucht Essigfliegen <BR>
         18. - Futtertierzucht Stuben- und Fleischfliegen <BR>
         19. - Futtertierzucht Enchytr&auml;en/Essig&auml;lchen <BR>
         20. - Futtertierzucht Ratten und M&auml;use <BR>
         21. - Futtertierzucht Wasserfl&ouml;he <BR>
         22. - Futtertierzucht Artemia <BR>

<hr>

<CENTER><b>          1. - Warum Lebendfutter ?
</b></CENTER>
<P ALIGN="LEFT">Lebendfutter ist IMHO das nat&uuml;rlichste Futter und damit allen anderen
Sorten vorzuziehen.  Zudem l&ouml;st es in viel st&auml;rkerem Masse wie
Trockenfutter den Jagdtrieb der Tiere aus.  Da es im Allgemeinen frisch
ist auch der Vitamin- und N&auml;hrstoffgehalt gr&ouml;&szlig;er als in Kunstfutter,
vorallem bleiben empfindliche Substanzen(Vitamine etc.) besser erhalten.
</P>

<CENTER><b>          2. - Futtertiere der Natur entnehmen
</b></CENTER>
<P ALIGN="LEFT">Ja, wenn darauf geachtet wird, da&szlig; keine Biotope gesch&auml;digt oder gar
zerst&ouml;rt werden, keine gesch&uuml;tzte oder bedrohte Tier als Futter
verwendet werden.  Zudem muss darauf geachtet werden, da&szlig; z.B.
Fischfutter nicht aus Gew&auml;ssern entnommen wird, die durch Fische bewohnt
werden, da hier die Gefahr der Einschleppung von Krankheitserregern oder
Parasiten (Karpfenl&auml;use) besteht.  Unproblematisch ist die Entnahme von
Schwarzen M&uuml;ckenlarven aus stehenden "Gew&auml;ssern" (Regentonnen, Brunnen,
T&uuml;mpeln, stehenden Flussseitenarmen (Rheina&uuml;)) oder von Wasserfl&ouml;hen
aus Entenweihern oder Kl&auml;rbecken.  Das dies nicht unbedingt Natur ist,
ist mir klar.
</P>

<i>          <CENTER>3. - Wiesenplankton</CENTER><br>


          <CENTER>4. - Futtertiere sammeln<br>
</CENTER>

          <CENTER>5. - aquatile Futtertiere<br>
<p></i></CENTER>

<CENTER><b>          6. - Futtertiere im Angler-Fachhandel
</b></CENTER>
<P ALIGN="LEFT">Hier besorge ich mir immer Fliegenmaden, die ich sowohl an Fische, wie
auch Reptilien verf&uuml;ttere.  Wenn Futter knapp ist, lasse ich die Fliegen
auch ausschl&uuml;pfen, und biete sie, nachdem sie 1-2 Tage Futter aufnehmen
konnten, an.  Dazu gebe ich die Maden in Plastikbeh&auml;lter (T*pper) mit
etwas Obst oder eingeweichten Haferflocken.  Wenn ich die Fliegen an
Fische verf&uuml;ttern will, stelle ich den Beh&auml;lter f&uuml;r etwa 20-30 Min ins
Gefrierfach.  Die Fliegen fallen dann in eine K&auml;ltestarre und k&ouml;nnen auf
die Wasseroberfl&auml;che gestreut werden.  Aber nur so viele, wie in wenigen
Minuten gefressen werden!  ;-)
</P>

<CENTER><b>          7. - Futtertiere im Zoofachhandel
</b></CENTER>
<P ALIGN="LEFT">Hier verwende ich eigentlich alles, was angeboten wird.  In den letzten
Jahren ist das Angebot allerdings sehr schlecht geworden.  Es ist daher
wichtig, sich einen guten H&auml;ndler zu suchen und auch warm zu halten!
H&auml;ufig wird Lebendfutter in kleine Plastikt&uuml;tchen eingeschweisst
angeboten.  Diese benutze ich nur im Notfall!  In Darmstadt gibt es noch
einen H&auml;ndler, der Tubifex "lose" verkauft.  Dort kostet es nur etwa ein
Zehntel und ist daf&uuml;r auch zehnmal so gut.  :-))) Ich hole immer etwa
eine Handvoll (kostet 4,-), und wasche den Klumpen 2-3 mal gr&uuml;ndlich
durch.  D.h.  in einer Platikschale (1l) mit Leitungswasser kr&auml;ftig
aufschwemmen, so da&szlig; die W&uuml;rmchen einzeln umherschwimmen.  Danch ein
paar Minuten absetzten lassen, bis sich ein ne&uuml;r Klumpen bildet.  Alles
was dann noch im Wasser treibt (Tote oder Sterbende) wird abgesch&uuml;ttet.
Von langem W&auml;ssern halte ich nichts, da die W&uuml;rmer keine Nahrung mehr
aufnehmen k&ouml;nnen und deshalb st&auml;ndig an N&auml;hrwert verlieren.  Danach
kann gef&uuml;ttert werden.  Ich f&uuml;ttere dann meist sehr gro&szlig;z&uuml;gig, da das
so gewaschene Tubifex sehr sauber ist ist, und auch nicht gefressene
W&uuml;rmchen nicht anfangen zu faulen.  In dieser Schale bewahre ich nicht
sofort verf&uuml;tterte W&uuml;rmer auch bei einem Wasserstand von etwa 1-2cm
m&ouml;glichst k&uuml;hl auf.  Dabei breitet sich der Klumpen soweit aus, da&szlig;
alle W&uuml;rmer gerade mit Wasser bedeckt sind und alle W&uuml;rmchen werden gut
mit Sa&uuml;rstoff versorgt.  Allerdings sollten sie bald m&ouml;glichst
verf&uuml;ttert werden, da die Qualit&auml;t st&auml;ndig abnimmt.  Die Fische sollen
sich ruhig zwei, drei Tage den Bauch vollha&uuml;n und anschliesend eine
kleine Fastenperiode einlegen.  Das schadet denen &uuml;berhaupt nicht, von
Nahrungsspezialisten mal abgesehen.  Weiterhin f&uuml;hrt mein H&auml;ndler auch
immer wieder M&uuml;ckenlarven (rot, wei&szlig; je nach Saison), die er feucht (die
roten) in kleinen Plastikschalen verkauft.  Auch die sind sehr g&uuml;nstig
und k&ouml;nnen, wenn sie feucht gehalten, einige Tage in der Gem&uuml;seschale
des K&uuml;hlschranks aufbewahrt werden.  Vor den roten wird zwar immer wieder
gewarnt, ich selbst habe aber noch keine Probleme gehabt, die ich auf das
Verf&uuml;ttern der roten M&uuml;ckenlarven zur&uuml;ckf&uuml;hren konnte.

</P>
<CENTER><b>          8. - Warum Futterzuchten ?
</b></CENTER>
<P ALIGN="LEFT">Futter zuchten machen von Handel und Naturentnahme unabh&auml;ngig, und sind
daher eine hervorragende Alternative, sofern man den Platz und die Zeit
daf&uuml;r hat.  Auch sind die Ans&auml;tze oft nicht leicht zu pflegen.  Ich habe
mit nur m&auml;ssigem Erfolg versucht Mehlw&uuml;rmer und Grillen (Indische
Zweipunktgrille) zu z&uuml;chten.

Mehr Erfolg hatte ich mit Mikro, Grindal und stummelfl&uuml;gelige Drosophila
f&uuml;r die Fische.  Zur Zeit habe ich aber keine Zuchtans&auml;tze.  Auch die
Aufzucht von Artemia salina ist meist nur von m&auml;ssigem Erfolg gekr&ouml;nt.
Auf die Beschreibung meiner Zuchtans&auml;tze verzichte ich jetzt das es dazu
ersten jede Menge Literatur gibt und ich, wie gesagt nicht so Erfolgreich
war.</P>


<CENTER><b>          9. - Futtertierzucht Grillen und Heimchen
</b></CENTER>
<P ALIGN="LEFT">Heimchenzuchten lohnen sich IMHO nur im gro&szlig;en Umfang.  Das heisst:  ein
eigener Raum (Keller!) mit einem oder mehreren 1-Meter Becken.
Heimchenzuchten sind, genau wie Wanderheuschrecken, daf&uuml;r ber&uuml;chtigt,
sehr instabil und unzuverl&auml;ssig zu sein.  Manchmal kippt die Zucht
einfach so um.</P>

<P ALIGN="LEFT">Geeignet sind gro&szlig;e alte Aquarienbecken mit dicht schliessendem
Fliegendrahtrahmendeckel.
</P>
<P ALIGN="LEFT">Den Boden streust du mit einer d&uuml;nnen Schicht Vogelsand aus.  Dann
schichtest du in der einen H&auml;lfte des Beckens Eierkartons auf.  Sie
dienen zum Unterschlupf, sind leicht zu besorgen und auszuwechseln, und
bieten auch den Babyheimchen sichere H&auml;utungspl&auml;tze, wenn sie dicht
genug ineinandergelegt sind.
</P>
<P ALIGN="LEFT">In die Kuhlen der Eierkartons kannst du das Trockenfutter streuen.  Daf&uuml;r
eignen sich u.a.:  M&auml;usepellets, trockenes Hunde- und Katzenfutter,
(Hundeflocken), Leinsamen, Fischfutter, Haferflocken und Trockenhefe in
geringen Mengen.
</P>
<P ALIGN="LEFT">Das Trockenfutter nicht in flache Schalen geben, sonst hat man manchmal
das Problem, da&szlig; die Kleinen nicht &uuml;ber den Sch&auml;lchenrand kommen und
dann am Ende noch verhungern.
</P>
Das Feuchtfutter wird in flachen Schalen serviert und besteht aus Obst und
Gem&uuml;se.  Keine dicken St&uuml;cke verwenden, sonst stechen die Weibchen ihre
Eier hinein!

<P ALIGN="LEFT">Trinkwasser ist unn&ouml;tig, solange man regelm&auml;ssig feucht f&uuml;ttert.
</P>
<P ALIGN="LEFT">Wichtig beim Heimchenz&uuml;chten ist hohe W&auml;rme zwichen 26 und 35 Grad.  Am
besten legt man unter das Becken ein Heizkabel aus.  Da Heimchen die
Dunkelheit lieben, ist eine Beleuchtung fehl am Platze.
</P>
<P ALIGN="LEFT">Im Buch "Futtertierzucht" von Friedrich und Volland wird die
Vorzugstemperatur f&uuml;r Heimchen mit 28-30 Grad angegeben.  Bei
Temperaturen von 20-22 Grad pflanzen sich die Tiere nur noch langsam fort.
</P>
<P ALIGN="LEFT">Desweiteren haben Heimchen und Zweifleckgrillen das gleiche mediterrane
Verbreitungsgebiet.  Die Vorzugstemperatur f&uuml;r beide Arten ist identisch.
Jedoch kann sich die Zweifleckgrille bei niedreigeren Temperaturen als 24
Grad nicht oder kaum noch fortpflanzen, deswegen h&auml;lt sie sich auch nicht
in der Wohnung.
</P>
<P ALIGN="LEFT">Aber wie gesagt, die Vorzugstemperaturen beider Arten sind identisch.  Du
k&ouml;nntest deine "Ertr&auml;ge", bzw.  die Periodik noch merklich steigern,
wenn du deine Heimchenzucht auf 30 Grad hochfahren w&uuml;rdest.  :)
</P>
<P ALIGN="LEFT">Damit sich die Heimchen fortpflanzen, muss man den Weibchen Beh&auml;lter zur
Verf&uuml;gung stellen, in denen sich Substrat wie Sand, Steckmoos, Torf oder
Lavagranulat befindet, der gleichm&auml;ssig feucht gehalten wird.  Hier legen
die Weibchen ihre Eier hinein.  Alle zwei Wochen wechselt man die
Beh&auml;lter aus und l&auml;sst die Babys in einem Extrabecken schl&uuml;pfen.
</P>
<P ALIGN="LEFT">Am praktikabelsten ist Heimtierstreu.  Und das in Klarsichtbeh&auml;ltern.
Unten ein paar L&ouml;cher hinein, gut w&auml;ssern und fertig - w&auml;hrend der
Eierperiode muss es nur noch konstant feucht gehalten werden
(Erfahrungswerte, je nach Beh&auml;ltergr&ouml;&szlig;e).
</P>
<P ALIGN="LEFT">Ein weiters Problem stellt die Gradwanderung da, die Eiablaged&ouml;schen bei
der trockenen Hitze, die Heimchen wollen, gleichm&auml;ssig feucht zu halten.
Und die Sterberate bei den kleinsten Larven ist auch relativ hoch.
</P>

<i>         <CENTER>10. - Futtertierzucht Schaben</CENTER><br>



         <CENTER>11. - Futtertierzucht Wanderheuschrecken</CENTER><br>



         <CENTER>12. - Futtertierzucht Schwarzk&auml;fer</CENTER><br>



         <CENTER>13. - Futtertierzucht Stab- und Gespenstschrecken</CENTER><br>



         <CENTER>14. - Futtertierzucht Regenw&uuml;rmer</CENTER><br>
<p>
</i>
<CENTER><b>         15. - Futtertierzucht Wachsmotten
</b></CENTER>
<P ALIGN="LEFT">Wachsmotten und insbesondere deren Larven sind ein gutes und weit
verbreitetes Lebendfutter.  Die meisten Tiere fressen sie recht gern,
manche bevorzugen die Larven, andere jagen mit Vorliebe den Motten
hinterher.  Viele Tiere bekommt man mit den Maden erst ans Fressen,
manchen schmecken sie sogut, daﬂ sie nichts anderes mehr anr&uuml;hren wollen!
</P>
<P ALIGN="LEFT">Wachsmotten(maden) sind bei vielen H&auml;ndlern zu erwerben, allerdings zu
einem recht schmerzhaften Preis, der bis an die 10,--DM heranreichen kann.
Dabei weiﬂ man beim Kauf noch nicht einmal, wie ergiebig der Ansatz sein
wird.</P>

<P ALIGN="LEFT">Zwei Tips zum Einkauf: 
</P>
<P ALIGN="LEFT"> 1.  Einen ergiebigen Ansatz erkenne ich sicher daran, daﬂ das
    Brutgef&auml;ﬂ eine hohe Eigentemperatur aufweist.  Wachsmaden erzeugen
    viel Eigenw&auml;rme.
</P>
<P ALIGN="LEFT"> 2.  Nach dem Einkauf den Ansatz m&ouml;glichst in ein ausbruchsicheres
    Gef&auml;ﬂ  umf&uuml;llen.   Nicht,  daﬂ  die Maden besonders flink sind ;),
    aber  sie  finden  auch  kleinste Schlupfl&ouml;cher und gehen stiften.
    Irgendwo in der Wohnung (unter dem Teppich, in W&auml;schefalten, usw.)
    verpuppen sie sich dann, was nicht jedermanns Geschmack ist...
</P>

<P ALIGN="LEFT">Es gibt verschiedene Arten von Wachsmotten, beschaffen sollte man sich
aber nur die Groﬂe Wachsmotte Galleria mellonella, da die Tiere eine
ausreichende Gr&ouml;ﬂe erreichen.  Bei unserem Zuchtansatz Maden bis 4cm L&auml;nge
und Motten mit betr&auml;chtlicher Spannweite ;)).
</P>

<CENTER> Z U C H T
</CENTER>

<P ALIGN="LEFT">Als Beh&auml;lter eignen sich groﬂe Gl&auml;ser mit Schraubverschluﬂ (&ouml;fter mal
Gurken essen ;), deren Deckel mit einer feinen Metallgaze versehen wird.
Fliegendraht ist zu grob, etwa die Weite von Benzinfiltern sollte man
nehmen.
</P>
<P ALIGN="LEFT">Absolut ungeeignet ist Holz oder Kunststoff; das Holz wird von den Maden
durchgefressen, der Kunststoff zwar nicht, daf&uuml;r l&ouml;st er sich auf, wenn
die Maden ihre Puppengespinste daran aufba&uuml;n.  Offenbar enth&auml;lt der
Spinnfaden vor der Verh&auml;rtung eine kunststoffl&ouml;sende Komponente.  Man hat
dann L&ouml;cher im Gef&auml;ﬂ, durch die die Maden entkommen...</P>

<P ALIGN="LEFT">Als Futter eignen sich bebr&uuml;tete Bienenwaben, die nicht zuviel Honigreste
enthalten sollten, da das Futter dann bald g&auml;rt und die Maden anges&auml;uselt
sind ;).
</P>
Bienenwaben sind nicht immer zu beschaffen, dann sollte man auf
Ersatzfutter ausweichen, das die Maden auch fressen.  Rezepte gibt es
einige, wir setzen mit Erfolg folgende Mischung ein:
<ul>
  <li>50 g Honig</li>
  <li>50 g Glycerin</li>
  <li> 5 g Korvimin ZVT</li> 
  <li>20 g Kleie</li>
  <li>20 g Magermilchpulver</li>
  <li>20 g Vollmehl</li>
  <li>40 g Hartweizengries</li></ul>
<P ALIGN="LEFT">Honig und Glycerin werden getrennt vermischt und zu den anderen, ebenfalls
vorher vermischten Zutaten gegeben und verr&uuml;hrt.  Man erh&auml;lt ein
kr&uuml;meliges Substrat, in dem man haupts&auml;chlich den Honig und die Kleie
durchschmeckt ;), und das f&uuml;r 5-10 Gl&auml;ser f&uuml;r etliche Tage ausreicht.
</P>
<P ALIGN="LEFT">Alternativ f&uuml;r Korvimin ZVT empfehlen manche Z&uuml;chter 10g Trockenhefe, aber
dann ist eine G&auml;rung des Substrates nicht auszuschlieﬂen, und die Maden
sind schon wieder betrunken ;).
</P>
<P ALIGN="LEFT">Der teuerste Bestandteil ist das Glycerin (Apotheke), trotzdem kommt man
mit der o.a.  Mischung nur auf ca.  9,--DM pro Kilogramm Ersatzfutter.
Fachh&auml;ndler biten ihre Substrate f&uuml;r mindestens das Doppelte an!
</P>
<P ALIGN="LEFT">In die vorbereiteten Zuchtgef&auml;ﬂe gibt man dann Wachsmotten oder eben
Puppen, die Motten legen ihre Eier ins Substrat ab.  Je nach Temperatur
kann es dann einige Wochen da&uuml;rn, bis die ersten Maden sichtbar sind.
Bei 30 Grad Celsius oder unseren Hochsommertemperaturen geht es dann
schneller, und man ist bald von Hunderten von Maden umgeben...
</P>

<i>         <CENTER>16. - Futtertierzucht Springschw&auml;nze</CENTER><br>



         <CENTER>17. - Futtertierzucht Essigfliegen</CENTER><br>



         <CENTER>18. - Futtertierzucht Stuben- und Fleischfliegen</CENTER><br>



         <CENTER>19. - Futtertierzucht Enchytr&auml;en/Essig&auml;lchen</CENTER><br>

<p>
</i>
<CENTER><b>         20. - Futtertierzucht Ratten und M&auml;use
</b></CENTER><p>
<I><CENTER> die Angaben treffen zum gr&ouml;&szlig;ten Teil auch f&uuml;r die Zucht von Meerschweinchen und Goldhamstern zu.
</CENTER></I>

<U><P ALIGN="LEFT"> M &Auml; U S E 
</P></U>

<P ALIGN="LEFT"> Allgemeines:
</P>

<P ALIGN="LEFT">Die Geruchsbel&auml;stigung ist sehr hoch, Zuchten in der Wohnung sind nicht
zu empfehlen.  Steht jedoch ein gut zu l&uuml;ftender, ausreichend warmer Raum
zur Verf&uuml;gung (Arbeitszimmer oder Abstellraum sind denkbar ungeeignet !).
steht der Zucht nichts im Wege.
</P>

<P ALIGN="LEFT"> Haltung:
</P>
<P ALIGN="LEFT">Zur Haltung einer kleinen Zuchtgruppe (1 M&auml;nnchen, 5 Weibchen) empfehle
ich eine Grundfl&auml;che von 60x30cm.  Die in der Literatur angebenen
Gr&ouml;&szlig;en von 40x25cm f&uuml;r 1 M&auml;nnchen und 6 Weibchen halte ich f&uuml;r zu
klein.  Sollten mehr Tiere ben&ouml;tigt werden, ist es sinnvoller, eine
weitere Zuchtgruppe zu halten.  Auch sollten nicht mehr als 5 Weibchen in
einem Beh&auml;lter sein, da sonst zu viel Unruhe entsteht, was sich negativ
auf die Muttertiere auswirkt (Fressen der Neugeborenen aufgrund Stress,
kleinere W&uuml;rfe, Fr&uuml;hgeburten, zu geringe Milchproduktion).
</P>
<P ALIGN="LEFT">Billig und praktisch sind Aquarien.  Sie k&ouml;nnen auch leicht gereinigt und
desinfiziert werden.  In verschiedenen Zool&auml;den werden auch undichte
Aquarien zum Sonderpreis angeboten.  Oder mal nachfragen, ob nicht jemand
noch ein altes Aquarium im Keller hat.
</P>
<P ALIGN="LEFT">Zu Zuchtzwecken verwenden viele Z&uuml;chter aber auch handels&uuml;bliche K&auml;fige,
die aus einer flachen Plastikwanne und einem Stahlgitteraufsatz bestehen.
In eingebrachten Vertiefungen des Aufsatzes befinden sich Futtermulden und
die Halterungen f&uuml;r die Trinkflaschen.
</P>
<P ALIGN="LEFT">Der Beh&auml;lter erh&auml;lt eine 5cm hohe Einstreuschicht bestehend aus
Labortierstreu.  Kleintierstreu ist nicht empfehlenswert, da es sehr
staubt und zu verschiedenen Krankheiten f&uuml;hren kann (Lungenentz&uuml;ndung,
chronische Reizung der Schleimh&auml;ute im Breich Nase, Rachen und
Bronchien).  Hobelsp&auml;ne sind eine weitere M&ouml;glichkeit.  Das Streu muss
mindesten einmal pro Woche erne&uuml;rt werden.  Der Beh&auml;lter wird mit
engmaschigem Draht abgedeckt.  Auf ausreichend L&uuml;ftung muss geachtet
werden.
</P>
<P ALIGN="LEFT">Empfohlene Temperaturen:  tags&uuml;ber 20 - 23 Grad, nachts nicht unter 16
Grad.
</P>
<P ALIGN="LEFT">Selbstverst&auml;ndlich ben&ouml;tigen die Tiere ausreichend Licht.

</P>
<P ALIGN="LEFT"> Futter:
 </P>
<P ALIGN="LEFT">Als Futter ist lediglich "SSNIFF - Ratten und M&auml;use-Di&auml;t"
empfehlenswert.  Weder K&uuml;chenabf&auml;lle, noch die &uuml;blichen Nagerfutter
bieten ausreichend Inhaltsstoffe zur Ern&auml;hrung der tr&auml;chtigen Weibchen.
Das Futter ist im Futtermittelgro&szlig;handel oder &uuml;ber andere Z&uuml;chter zu
bekommen (Fertigprodukte f&uuml;r die Labortierhaltung).  Die Trinkflaschen
sollten stets Wasser enthalten, da das Tr&auml;nken der Tiere sehr wichtig
ist.</P>

<P ALIGN="LEFT">
 Fortpflanzung:</P>
 
<P ALIGN="LEFT">Die Maus kann ab 2 Monate zur Zucht verwendet werden.  Sie tr&auml;gt ca.  18
- 24 Tage.  Es werden ca.  8 - 15 Junge geboren.  Am n&auml;chsten Tag wird
das Weibchen wieder br&uuml;nstig.  Sp&auml;testen bei der Geburt des n&auml;chsten
Wurfes, sollten die Jungtiere von der Mutter getrennt werden.  Nach 12
Monaten sollten die Zuchttiere ausgewechselt werden.
</P>
<P ALIGN="LEFT">Es ist ratsam, von Zeit zu Zeit einige Tiere von verschiedenen Z&uuml;chtern
einzukreuzen, um Inzucht &uuml;ber mehrere Jahre zu vermeiden.
</P>



<U><P ALIGN="LEFT"> R A T T E N </P></U>


<P ALIGN="LEFT"> Allgemeines:</P>

<P ALIGN="LEFT">Bei regelm&auml;ssiger S&auml;uberung des Rattenbeh&auml;lter entsteht keine
Geruchsbel&auml;stigung, so da&szlig; die Zucht durchaus in der Wohnung
durchgef&uuml;hrt werden kann.
</P>

<P ALIGN="LEFT"> Haltung:</P>

<P ALIGN="LEFT">Zur Haltung einer kleinen Zuchtgruppe (1 M&auml;nnchen, 4 Weibchen) werden 3
Beh&auml;lter von jeweils 60x30cm ben&ouml;tigt.  Es werden immer nur zwei
weibliche Ratten zusammen gehalten.  Das M&auml;nchen wird nur zum Decken
eingesetzt und anschliessend wieder entfernt.  Ratten sind sehr soziale
Tiere, jedoch ensteht zuviel Unruhe, werden mehrere Tiere
vergesellschaftet.  F&uuml;r eine produktive Zucht ist das nicht
empfehlenswert.</P>

<P ALIGN="LEFT">F&uuml;r den Anfang k&ouml;nnen auch 1 M&auml;nnchen und 2 Weibchen in einem Beh&auml;lter
zusammen gehalten werden.  Meistens ist es jedoch ratsamer, das M&auml;nnchen
einzeln zu halten.</P>

<P ALIGN="LEFT">Ratten sind sehr intelligente und personenbezogene Tiere.  Eine gute
Beziehung zu den Elterntieren ist also durchaus m&ouml;glich.  Ansonsten
Haltung wie bei M&auml;usen.
</P>

<P ALIGN="LEFT"> Futter:</P>

<P ALIGN="LEFT">wie bei M&auml;usen</P>


<P ALIGN="LEFT"> Fortpflanzung:</P>

<P ALIGN="LEFT">Ratten sind mit 3 Monaten geschlechtsreif.  Das Weibchen tr&auml;gt ca.  21
Tage, werden noch Jungtiere ges&auml;ugt, kann das Tier auch bis zu 30 Tage
tragen.  Es werden 9 - 14 Jungtiere geboren.  Nach 2 - 3 Tagen wir das
Weibchen erneut br&uuml;nstig.  Bei Getrennthaltung, sollte aber eine
Ruhepause von 7 Tagen eingehalten werden.  Der Rattenzyklus betr&auml;gt 3
Tage, so da&szlig; das M&auml;nnchen nach 6 Tagen wieder entfernt werden kann.
Ansonsten wie M&auml;use.</P>


<CENTER><b>         21. - Futtertierzucht Wasserfl&ouml;he
</b></CENTER>

<P ALIGN="LEFT">Lediglich ein Futtertier lies sich in gro&szlig;en Mengen z&uuml;chten.  Bei meinem
Umzug vor ein paar Jahren sind mir meine Ans&auml;tze aber im wahrsten Sinne
des Wortes gekippt.  Da ich damals auch keine Zeit hate, habe ich mich
nicht um die Beschaffung eines neuen Ansatzes bem&uuml;ht.  Heute suche ich
h&auml;nderingend und bekomme sie nirgends mehr.  :-((((((((
</P>
<P ALIGN="LEFT">Es handelt sich um den _Japanischen_ _Wasserfloh_, _Moina_ _macrocopa_.
Vor Jahren wurden die mal in diversen Aquarienzeitschriften als die
Sensation gepriesen.  Verscheidene Bekannte, die von mir Ans&auml;tze
erhielten hatten allerdings weniger Erfolg, dabei ist die Zucht wirklich
einfach.  Ich benutzte dazu zwei Sch&uuml;sseln, die bei einen Wasserstand von
10 cm etwa 5l Inhalt hatten.  Der Ansatz wurde mit naja etwa hundert
Fl&ouml;hen angeimpft, und mit einigen Tropfen aufgeschwemmter Hefe zweimal
t&auml;glich gef&uuml;ttert.  Die Hefel&ouml;sung erhielt ich durch Aufschwemmen eines
W&uuml;rfels frischer B&auml;ckerhefe in etwa 100 ml Wasser.  Das ganze ist im
K&uuml;hlschrank gut zwei Wochen haltbar.  Innerhalb von wenigen Tagen
vermehren sich die Fl&ouml;he so stark, da&szlig; aus der Schale gef&uuml;ttert werden
kann.  Die Schalen sollte warm und hell stehen.  Sich bildente Algen
schaden nicht, imm Gegenteil.  Wenn man noch einige Schnecken in die
Schale setz, die abgestorbene Krebschen und &uuml;bersch&uuml;ssige Hefe
auffressen, kann eigentlich nichts mehr passieren.  Und die wird etwa 2-4
Woche n Futter liefern.  Danach ist ein Neuansatz nach Reinigen der Schale
n&ouml;tig.  Ich habe immer mit zwei Schalen gearbeitet, die ich abwechselnd
alle 4 Wochen neu ansetzte.  Damit konnte ich damals mindestens 10
Zuchtbecken mit Kleinlabyrinthern und Killifischen, sowie drei
Gesellschaftsbecken, unter Zuf&uuml;tterung von Tubifex und je nach Jahreszeit
M&uuml;ckenlarven, weitgehend versorgen!</P>


<CENTER><b>         22. - Futtertierzucht Artemia
</b></CENTER>

<P ALIGN="LEFT">Um Jungfische sicher aufzuziehen, habe sich frischgeschl&uuml;pfte
Salinenkrebse (Artemia salina) schon seit langem bew&auml;hrt.  Die zur
Aufzucht der Krebschen ben&ouml;tigten Eier sind f&uuml;r wenig Geld in jedem
Aquarienladen zu haben.
</P>
<P ALIGN="LEFT">Im folgenden wird eine Apparatur beschrieben, die auch f&uuml;r groﬂe Mengen an
Artemia geeignet ist und t&auml;glich frische Artemianauplien liefert.  Die
Handhabung ist einfach und sicher.
</P>
<CENTER><img align=middle src="I_ARTEMI.GIF"> Aufzuchtapparatur</CENTER> 

<P ALIGN="LEFT">An Ger&auml;ten werden mindestens zwei Glas- oder Kunststofflaschen ben&ouml;tigt,
eine f&uuml;r den Ansatz und eine f&uuml;r die Trennung der Nauplien von den
Eischalen.  Weiterhin Schlauchmaterial, Kunststoffrohre, doppelt
durchbohrte Stopfen, Lufth&auml;hne und eine Membranluftpumpe.  Bei mehreren
Flaschen f&uuml;r den Ansatz der Nauplien kommt noch eine entsprechende Anzahl
an T-St&uuml;cken hinzu.
</P>
<P ALIGN="LEFT">Die Flaschen f&uuml;r den Ansatz (F1) erhalten einen doppelt durchbohrten
Stopfen.  Ein Plastikrohr (P1) wird durch eine &ouml;ffnung bis fast auf den
Boden gef&uuml;hrt.  Ein zweites Rohrst&uuml;ck (P2) wird nur kurz bis unter den
Korken in die zweite &ouml;ffnung gesteckt.  An P1 wird die Luftzufuhr
angeschlossen, P2 dient als Luftaustritt.  Am Luftschlauch kann ein Ventil
zur Regulierung angebracht werden.
</P>
<P ALIGN="LEFT">Bei mehreren Flaschen f&uuml;r den Ansatz empfiehlt es sich, mittels T-St&uuml;cken
eine parallele Luftzufuhr aufzubauen.  Eine Reihenschaltung der Flaschen
hat den Nachteil, daﬂ bei Undichtigkeiten in einer Flasche alle
nachfolgenden ausfallen.
</P>
<P ALIGN="LEFT">Die Flasche zur Trennung der Nauplien von den Schalen (F2) erh&auml;lt 1 cm
&uuml;ber dem Boden ein &ouml;ffnung mit Schlauchanschluﬂ und Hahn.  Hier&uuml;ber kann
man nach dem Schl&uuml;pfen die Nauplien ablassen.
</P>
<P ALIGN="LEFT">Sind die Krebschen geschl&uuml;pft, wird der gesamte Inhalt von F1 in F2
&uuml;berf&uuml;hrt.  F2 wird schr&auml;ggestellt, sodaﬂ sich die Eier am Boden, bzw.
die Eischalen auf der Oberfl&auml;che ansammeln.  Nach dem Absetzen kann man
mit dem Schlauch aus F2 die Nauplien in die vorher gereinigte F1 ablassen
und noch einige Tage am Leben erhalten.
</P>
<P ALIGN="LEFT">Bei drei bis vier Flaschen in periodischem Ansatz erh&auml;lt man so die ganze
Woche &uuml;ber t&auml;glich frische Nauplien.
</P>


<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>