<HEAD>
<TITLE>
Landschildkr&ouml;ten </TITLE>
</HEAD>

<BODY>
<a href="POGONA.HTML"><img src="ALEFT.GIF"></a> <a href="BRACHYPE.HTML"><img src="ARIGHT.GIF"></a><hr>

<h2>
<CENTER>Wissenswertes &uuml;ber artgerechte Haltung, Pflege und Ern&auml;hrung von</CENTER>
 <P>
<CENTER><img align=middle src="I_LAND1.GIF"> LANDSCHILDKROETEN</CENTER>
</h2>               
<hr>

<P ALIGN="LEFT">Obwohl praktisch keine <a href="LANDSCHI.JPG">Landschildkr&ouml;ten</a> der unterschiedlichsten, f&uuml;r
die  Liebhaberhaltung  geeigneten  Arten  mehr im Handel sind, gibt es
noch  erhebliche  Best&auml;nde  an  Alttieren  und erfreulicherweise auch
immer   mehr   Nachzuchten.   Entgegen  einer  weit  verbreiteten  und
veralteten     Ansicht    sind    Landschildkr&ouml;ten    jedoch    keine
"Anf&auml;ngertiere".    Die  wirklich  artgerechte  Haltung  ist  relativ
aufwendig und braucht Platz.</P>

<P ALIGN="LEFT"><B>A n s c h a f f u n g</B></P>

<P ALIGN="LEFT">Man  achte  auf  intakte Krallen und klare Augen, vor allem jedoch auf
einen festen, wirklich harten Panzer.  Abweichende Merkmale deuten auf
Erkrankungen und/oder Mangelerscheinungen hin.
</P>
<P ALIGN="LEFT"><B>U n t e r b r i n g u n g</B></P>

<P ALIGN="LEFT">Landschildkr&ouml;ten    ben&ouml;tigen    zumindest    im    Fr&uuml;hjahr    und
Sp&auml;tsommer/Herbst unbedingt ein beheiztes und beleuchtetes Terrarium.
St&auml;ndiger Aufenthalt im Freien ist bei unserem Klima selbst im Sommer
ja  nicht immer m&ouml;glich.  Freilauf in der Wohnung verbietet sich oft,
weil es f&uuml;r Schildkr&ouml;ten dort zu kalt/zugig und staubig ist.
</P>
<P ALIGN="LEFT">Eine  idealerweise  vorgesehene,  r&auml;umlich  gro&szlig;z&uuml;gig zu bemessende
Da&uuml;rterrarienhaltung     macht    ein    Spezialbeh&auml;ltnis    ohnehin
erforderlich.   Ein gutes Terraristikfachbuch hilft bei der Gestaltung
und  Ausstattung  eines  typischen  Landschildkr&ouml;tenterrariums:   Die
eingegrabene   Wasserschale,   Rindenhumus-,   Erd-,   Kies-  und/oder
Steinfl&auml;chen,  sowie  unterschiedlich  stark  durch Strahler besonnte
Zonen   zum  freien  Aufsuchen  der  Vorzugstemperatur  (Thermometer!)
geh&ouml;ren dazu.</P>

<P ALIGN="LEFT">Gartenauslauf in einem Gehege wird an sch&ouml;nen Sonnentagen gro&szlig;z&uuml;gig
gew&auml;hrt   (UV-Bestrahlung!).   Dabei  auch  schattierte  Teilbereiche
anbieten.</P>

<P ALIGN="LEFT"><B>P f l e g e</B></P>

<P ALIGN="LEFT">Verschmutztes  Wasser  (h&auml;ufig  koten  die Schildkr&ouml;ten dort ab) ist
unverz&uuml;glich  zu wechseln, auf auf dem Bodenbelag hinterlassener Kot,
nebst den wei&szlig;en Harnablagerungen, wird regelm&auml;ssig entfernt.  Nasse
Stellen  durchharken  und  so zum Trocknen auflockern.  &ouml;fters einmal
gegen frisches Bodenmaterial austauschen.
</P>
<P ALIGN="LEFT">Es  d&uuml;rfen  nirgends dauerhaft nasse Bereiche entstehen; stellen- und
zeitweise  durch  Bespr&uuml;hen  mit  lauwarmen  Wasser  erzielte, leicht
feuchte  Pl&auml;tze  sind  aber erw&uuml;nscht.  Sie werden in Abwechslung zu
absolut trockenen Zonen ggfl.  von den Schildkr&ouml;ten aufgesucht.
</P>
<P ALIGN="LEFT"><B>E r n &auml;  h r u n g</B></P>

<P ALIGN="LEFT">Landschildkr&ouml;ten   sind   &uuml;berwiegend  Pflanzenfresser,  dabei  aber
durchaus   Gemischtk&ouml;stler.    Das  heisst  also:   Abwechslung  beim
Gr&uuml;nzeug  in  Form  von  unbehandeltem  Obst,  Gem&uuml;se, Kr&auml;utern und
Salaten   ist   angesagt.    Hier  muss  fleissig  experimentiert  und
herumprobiert werden, denn viele Landschildkr&ouml;ten sind ausgesprochene
Individualisten.   Ein  Anteil  tierischer  Kost  (W&uuml;rmer, Schnecken,
Fisch,  magere  Fleischst&uuml;ckchen),  insgesamt  bis  zu 20 Prozent der
Gesamtration, ist jedoch wichtig.
</P>
<P ALIGN="LEFT">Fertigfutter  (auch  ein  angefeuchtetes  Wasserschildkr&ouml;ten-, Fisch-
und/oder  Katzenprodukt)  rundet,  zusammen mit Erg&auml;nzungspr&auml;paraten
und   hochwertigen   Kalk-   bzw.    Vitamin-/Mineralmischungen,   den
Speiseplan ab.
</P>
<P ALIGN="LEFT">Kuchen,   Kekse,   Brot,   sowie   Teigwaren  sind  verboten.   Einige
Vollkornhaferflocken  oder  etwas M&uuml;sli (feucht) als Leckerbissen von
Zeit zu Zeit aber statthaft.
</P>
<P ALIGN="LEFT"><B>G e s u n d h e i t</B></P>

<P ALIGN="LEFT">Event&uuml;ller  Fressunlust  kann  durch Probieren ne&uuml;r Futtersorten und
ein  lauwarmes  Flachwasserbad  begegnet  werden.   Nur  bei optimaler
Pflege   und   Ern&auml;hrung   sind   Landschildkr&ouml;ten   recht   robust.
Verletzungen  und  &auml;usserlich sichtbare M&auml;ngel/Erkrankungen geh&ouml;ren
aber  SOFORT  in  die  H&auml;nde  von  Spezialisten.  Dazu z&auml;hlen einige
wenige Tier&auml;rzte oder auch Mitglieder eines Terrarienvereins.
</P>
<P ALIGN="LEFT"><B>W i n t e r s c h l a f</B></P>

<P ALIGN="LEFT">F&uuml;r     die     europ&auml;ischen     Arten     und     die    asiatische
Vierzehen-Landschildkr&ouml;te  (alle  gesch&uuml;tzt)
empfiehlt  sich  eine mehrw&ouml;chige, kalte Ruheperiode.  Sind die Tiere
dies gew&ouml;hnt, sollte der gesamte Sp&auml;therbst, Winter und Vorfr&uuml;hling
im  Winterschlaf  verbracht werden.  Nur dann gelingen m&ouml;glicherweise
auch event&uuml;lle Zuchtabsichten.
</P>
<P ALIGN="LEFT">Die  Winterruhe  vorbereitend,  sollen die Landschildkr&ouml;ten ca.  eine
Woche  fasten,  danach  wird  in einem lauwarmen Wasserbad (in bis zur
Maul&ouml;ffnung  gef&uuml;llter  Schale) der Darm entleert.  Eine nagersicher
vergitterte  Kiste mit einem Gemisch aus leicht befeuchtetem Torfmull,
Sand,   Rindenmulch   und   trockenem   Laub   mit  einigen  ebenfalls
nagergesch&uuml;tzten,    seitlichen    Bel&uuml;ftungsl&ouml;chern,   dient   als
Winterquartier.</P>

<P ALIGN="LEFT">Dort  graben  sich  die  Schildkr&ouml;ten  bei  dunkler  und  frostfreier
Aufstellung rasch ein und sie verbleiben bei 4 bis 10 Grad Celsius bis
zum Ende der Winterruhe bei regelm&auml;ssiger Kontrolle in der Kiste.
</P>
<P ALIGN="LEFT">Ein  Bad  (wie  oben  beschrieben), langsame Erw&auml;rmung und vorsichtig
dosiertes  Anf&uuml;ttern  nach der Ruheperiode, wecken langsam wieder die
Lebensgeister.
</P>
<P ALIGN="LEFT">F&uuml;r  "exotische"  Arten  sind  das  Studium von Fachliteratur und die
Beratung  bei  einem  spezialisiertem  Terrarianer  unbedingt  vor der
Anschaffung  der  Tiere  zu  empfehlen,  um  Fragen  einer event&uuml;llen
Winterruhe,  der  Optimaltemperatur,  sowie &uuml;ber artgerechte Haltung,
Pflege und Ern&auml;hrung zu kl&auml;ren.
</P>
<h5>
(C) Gerald Gantschnigg G.GANTSCHNIGG@raptor.dontpanic.sub.org
</h5>

<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>