<HEAD>
<TITLE>
Licht </TITLE>
</HEAD>

<BODY>
<a href="ABKUERZ.HTML"><img src="ALEFT.GIF"></a> <a href="VOGELSPI.HTML"><img src="ARIGHT.GIF"></a><hr>
(c) G.Gantschnigg.raptor.dontpanic.sub.org 1995
<hr><h1>
            <CENTER>Licht im Terrarium</CENTER>
</h1><hr>           
           
<P ALIGN="LEFT"><b>Einleitung
</b></P>

<P ALIGN="LEFT">Um  Terrarientiere  erfolgreich  pflegen zu k&ouml;nnen, ben&ouml;tigt man neben
der  Kenntnis  der  biotischen  Faktoren  auch  Informationen über die
abiotischen Faktoren, zu denen auch das Licht zählt.
</P>
<P ALIGN="LEFT">Nicht  nur  Aussagen  über  die Tageslänge sind hierbei von Interesse,
sondern  eben  auch  Angaben  über  die  spektrale Zusammensetzung des
Lichtes.   Während sich die Tageslänge und somit die Beleuchtungsda&uuml;r
leicht  aus der geographischen Lage des Herkunftlandes ermitteln läßt,
sieht  es  bei  der  Ermittlung  der  spektralen Zusammensetzung schon
düsterer aus.
</P>
<P ALIGN="LEFT">Am  g&uuml;nstigsten  ist  es,  die  Tiere bei Sonnenlicht zu halten, damit
kommt   man  auch  in  unseren  Breiten  der  Lichtzusammensetzung  am
Herkunftsort  der  Tiere  schon  recht  nahe.   Das bedeutet aber eine
Freilandhaltung,  und  die  k&ouml;nnen nur die wenigsten Terrarianer ihren
Tieren bieten, und auch nur wenige Tiere sind f&uuml;r eine Freilandhaltung
in unseren Breiten geeignet.
</P>
<P ALIGN="LEFT">Also  behilft  man  sich mit Kunstlicht und ist dabei auf Händlertips,
Geldbeutel  und  pers&ouml;nlichen Geschmack angewiesen.  Ob man den Tieren
und  den Pflanzen des Terrariums mit seiner Beleuchtung einen Gefallen
tut, ist manchmal fraglich.
</P>
<P ALIGN="LEFT">In  der  Natur erleben die Tiere zwischen Sonnenaufgang und -untergang
ein    Wechselspiel    der    Lichtintensität   und   der   spektralen
Zusammensetzung  des  Lichtes,  leicht  erkennbar  an  der subjektiven
Farbver&auml;nderung  der  Sonne  im  Verlauf  des  Tages.   Zumindest  zur
Mittagszeit  ist  das  nat&uuml;rliche  Licht  so  hell, daß wohl kaum eine
Beleuchtung   diese   Lichtintensit&auml;t  aufbringt.   Gleichzeitig  sind
Morgen-  und  Abendsonne  recht  schwach  mit  einem  hohen Rotanteil,
w&auml;hrend mittags der Blauanteil im Sonnenlicht stark vertreten ist.
</P>

           
<P ALIGN="LEFT"><b>Physikalische Grundlagen</P>

<P ALIGN="LEFT">....Licht ist eine Welle....</P>
</b>
<P ALIGN="LEFT">Licht  ist  physikalisch gesehen eine (elektromagnetische) Schwingung,
die sich von der Q&uuml;lle kugelf&ouml;rmig in alle Raumrichtungen ausbreitet.
Anschaulich  kann man sich die Ausbreitung vorstellen, indem man einen
Stein  in  einen  Teich  wirft:   Die  entstehende  Welle breitet sich
kreisf&ouml;rmig aus.
</P>
<P ALIGN="LEFT">Im  menschlichen  Auge (und nat&uuml;rlich im Wirbeltierauge ;) verursachen
die  Lichtwellen  einen Sinnesreiz, der als Farbe mit einer bestimmten
Intensit&auml;t  empfunden  wird.   &uuml;ber  die  Farbe  entscheidet jetzt die
Wellenl&auml;nge  des  Lichtes,  &uuml;ber  die  Farbintensit&auml;t  die H&ouml;he dieser
Welle.
</P>
<P ALIGN="LEFT">Die   Wellenl&auml;ngen   des  Lichtes  sind  sehr  klein,  sie  liegen  im
Nanometer(nm)-Bereich,   das   heißt   in   der  Gr&ouml;ßenordnung  von  1
Milliardstel Meter.  Licht mit 400nm wird als violett, Licht mit 750nm
als  tiefrot  empfunden.   Zwischen  diesen beiden Werten tummeln sich
alle   anderen   Farbwerte.    Alle   Farben   ergeben   zusammen  die
Regenbogenfarben, die ja wohl jeder schon einmal gesehen hat ;).
</P>
<P ALIGN="LEFT">Licht  mit Wellenl&auml;ngen kleiner als 400nm kann der Mensch nicht sehen,
es  wird  als  Ultraviolett  (UV) bezeichnet.  Viele Tiere k&ouml;nnen aber
UV-Licht  sehen, am bekanntesten ist die Biene, aber auch Fische sehen
UV-Licht.
</P>
<P ALIGN="LEFT">Licht mit Wellenl&auml;ngen gr&ouml;ßer als 800nm ist f&uuml;r den Menschen ebenfalls
unsichtbar, es wird als Infrarot (IR) bezeichnet.  Viele Tiere "sehen"
auch   dieses   Licht,   so   zum   Beispiel  die  Grubenotter.   Alle
Regenbogenfarben zusammen, im richtigen Intensit&auml;tsverh&auml;ltnis, ergeben
weißes, oder besser "unbuntes" Licht.
</P>
<P ALIGN="LEFT">Die spektrale Zusammensetzung des Sonnenlichtes beginnt bei etwa 200nm
(hartes UV) und geht sehr weit &uuml;ber den IR-Bereich hinaus.

</P>
<CENTER><img align=middle src="I_LICHT2.GIF"> </CENTER> 

<P ALIGN="LEFT">Das Intensit&auml;tsmaximum des Sonnenlichtes liegt bei ca.  480nm, also im
gr&uuml;nen  Bereich.   Das  harte  UV-Licht  <300  nm  erreicht  die  Erde
normalerweise (Ozonschicht) nicht.
</P>
<P ALIGN="LEFT">Zumindest   f&uuml;r   Bewohner   der   freien   Landzonen  ist  also  eine
sonnen&auml;hnliche   spektrale   Zusammensetzung   der  Beleuchtungsk&ouml;rper
anzustreben.
</P>

<P>
<i>                      Ende Teil 1
</i>           


<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>