<HEAD>
<title> Pogona vitticeps FAQ </title>

</HEAD>

<BODY>
<PRE><a href="AAGILIS.HTML"><img src="ALEFT.GIF"></a> <a href="LANDSCHI.HTML"><img src="ARIGHT.GIF"></a><hr>
</pre>
<br>
<br>
<h1>
<img src="I_BEARD1.GIF" ALIGN="top"> 
Pogona  vitticeps<br>
Anleitung   zur   Haltung   und   Pflege<br>
</h1>
<br>
<strong>Allgemeines:</strong><br>
<br>
Pogona vitticeps geh&ouml;ren zur Familie der Agamen und der Gattung Pogona 
(Bartagamen) an. Sie besiedeln die Halbw&uuml;sten, Busch- und Baumsteppen 
Australiens, genauer die &ouml;stliche H&auml;lfte von S&uuml;daustralien und das 
S&uuml;dost-Nordterritorium.  Dementsprechend sollte das Terrarium mit 
Sandboden, Kletter&auml;sten und Steinaufbauten versehen sein (n&auml;heres im 
Text). Sie ben&ouml;tigen Tagestemperaturen von 28-34' C und eine Nachtabsenkung um 10' C. Die Luftfeuchtigkeit sollte zwischen 40-80% betragen.
<br>
<a NAME="verweis1"> </a>
<a href="POGONA1.HTML"><strong>Beschreibung:</strong></a><br>
Der abgeflachte K&ouml;rper ist mit unterschiedlich grossen Schuppen bedeckt 
und an den K&ouml;rperseiten verlaufen zwei Stachelreihen. Charakteristisch ist 
die aufstellbare Kehle, der Bart. Der K&ouml;rper kann je nach Lichtverh&auml;ltnissen  
grau, braun oder schwarz gef&auml;rbt sein. Auf dem blassgrauen Bauch ist ein 
Ocellenmuster gezeichnet.  Pogona vitticeps werden bis zu 55 cm gross.
<br>
<strong>Winterruhe:</strong><br>
Pogonas ben&ouml;tigen von November bis Januar eine Pseudowinterruhe. Dabei 
m&uuml;ssen Heizmatte und Reflektorlampe ausgeschaltet bleiben, so dass
Temperaturen von etwa 18-21' C herrschen. 
<br>
<br>
<strong>Haltung :</strong><br>
<br>
Pogona vitticeps ben&ouml;tigen ein W&uuml;stenterrarium.  Die Terrariengr&ouml;sse 
sollte mit der Gr&ouml;sse der Tiere variieren. F&uuml;r ausgewachsene Tiere werden 
Gr&ouml;ssen von L:150,B:80,H:80 f&uuml;r ein P&auml;rchen angegeben. Bei einem zu 
grossen Terri k&ouml;nnen Jungtiere die Futtertiere schlecht finden und fangen, 
da sie zun&auml;chst schlechte J&auml;ger sind. Man sollte in etwa max. die 3-4 
fache L&auml;nge der Jungen rechnen. Es sollte ausserdem recht sp&auml;rlich 
eingerichtet sein, damit es &uuml;bersichtlich bleibt und die Futtertiere keine 
Versteckm&ouml;glichkeiten haben. Ich habe Anfangs zur F&uuml;tterung alles 
herausger&auml;umt, wobei ich nicht weiss, wie gross dann der Stressfaktor f&uuml;r 
die Kleinen war.  Zeigen die Pogonas ein besseres Jagdverhalten und fressen 
regelm&auml;ssig, kann man sie in ein anspruchsvolleres Terri setzen. Die 
Einrichtung besteht aus Pr&auml;sentierpl&auml;tzen, Kletterm&ouml;glichkeiten und 
einigen Verstecken.  Als Pr&auml;sentierpl&auml;tze eignen sich &Auml;ste und 
Steinaufbauten, die f&uuml;r den Besitzer &uuml;berschaubar angeordnet sein sollten. 
Kletterm&ouml;glichkeiten bietet eine rauhe, unebene R&uuml;ckwand. Wir haben f&uuml;r 
die R&uuml;ckwand sch&ouml;ne Steine gesammelt, weil wir ein m&ouml;glichst nat&uuml;rliches 
Terri wollten. Die Steine verklebten wir mit Montageschaum und Leim. Das 
Resultat kann sich jeder vorstellen: f&uuml;r die Pogonas wunderbar zum Klettern 
geeignet, wiegt es fast 100 kg.  In vielen B&uuml;chern gibt es 'ne Menge Tips 
zum Bau k&uuml;nstlicher Steinw&auml;nde, so z.B. in AGAMEN von U.Manthey und 
N.Schuster: <blockquote>"Als Ersatz eignen sich Hartschaumplatten (Styropor  
oder das festere Styrodur).  Mit ihnen k&ouml;nnen beliebige Felsaufbauten fast 
naturgetreu nachgebildet werden.  Ein mehrmaliger Anstrich mit Epoxidharz, 
das reichlich eingestreuten feuergetrockneten Quarzsand enth&auml;lt, sch&uuml;tzt 
das weiche Material vor den scharfen Krallen der Agamen und verleiht den 
k&uuml;nstlichen Felsformationen ein nat&uuml;rliches Aussehen." </blockquote> 
Und genau das konnten wir uns nicht vorstellen. Ich kann also in diesem Punkt  
nur sagen: ausprobieren.
<br>
Als Bodengrund verwendet man Sand. Mein Tip: es sollte <strong>kein </strong>
feink&ouml;rniger Sand genommen werden, wie z.B. Quarzsand/Vogelsand oder Aquarien 
sand. 
Ich schlage roten oder gelben Maurersand vor. Er wird durch Feuchtigkeit fest 
und so kann man das Terri besser reinigen, indem man den Hautresten etc.  
mit dem Staubsauger zu Leibe r&uuml;ckt. Gerade bei Jungtieren ist diese Eigenschaft 
des Bodengrundes sehr wichtig. Eben weil sie noch so schlecht jagen 
k&ouml;nnen, verfehlen sie h&auml;ufig die anvisierte Grille und schlagen mit dem 
Maul in den Boden. Bei lockerem Sand haben sie dann das Maul voll davon, was 
ihnen nicht unbedingt gut bekommt. Den Maurersand bekommt man in jedem 
Baustoffhandel.  Man sollte allerdings bei ausgewachsenen bzw. geschlechtsreif 
en Tieren darauf achten, dass man eine Zone mit weicherem Sand zur 
Eiablage anbietet. Man k&ouml;nnte dazu Plastikboxen verwenden, damit das 
sp&auml;tere Entfernen der Eier einfacher ist.  Aber an dieser Stelle sind Leute 
gefragt, die schonmal Pogoneier hatten, denn meine sind noch nicht so weit. 
<br>
<br>
<strong>Luftfeuchte, Temperatur, Beleuchtung:</strong><br>
<br>
Zur Messung von Luftfeuchte und Temperatur benutze ich ein Kombiger&auml;t, das 
zudem einen externen F&uuml;hler besitzt. Damit kann man die Temperatur an zwei 
verschiedenen Stellen im Terri messen und so das Gef&auml;lle beurteilen. Es ist 
absolut notwendig ein Temperaturgef&auml;lle zu erzeugen, damit die Tiere auch 
in k&uuml;hlere Bereiche auswechseln k&ouml;nnen.<br>
<br>
Zur Erzeugung der n&ouml;tigen Luftfeuchtigkeit von 40% tags&uuml;ber und 80% nachts 
habe ich jeden Abend mit der Blumenspritze gespr&uuml;ht, bis mir fast der Arm 
abgefallen ist. Ehrlich gesagt war mir diese abendliche Verpflichtung sehr 
unangenehm geworden, weil man p&uuml;nktlich wieder zu Hause sein musste, um 
f&uuml;r ca. 4 Minuten seinen Lieblingen die n&ouml;tigen Bedingungen zu verschaffen. 
Darum haben wir jetzt eine automatische Sprenkleranlage gebastelt.  Sie 
besteht aus den Aufs&auml;tzen von Blumenspritzen als D&uuml;sen, die im Deckel 
montiert wurden. Von dort aus f&uuml;hrt ein langer Schlauch aus dem Terri zur 
Wasserpumpe. Diese Pumpe geh&ouml;rte mal als Scheibenwasserpumpe zu einem Auto 
vom Schrottplatz. Von da aus geht ein kurzer Schlauch in den unteren Teil 
des Wasserbeh&auml;lters. (Dieser wiederum war mal ein Federweisserkanister :-)) 
Gesteuert wird das Ganze &uuml;ber eine externe Zeitschaltuhr, die man in 
Minutenintervallen programmieren kann.<br>
<br>
Die n&ouml;tige Temperatur wird durch Einsatz einer Bodenheizung und der Lampen 
erzeugt. Die Bodenheizung ist eine Heizmatte, die &uuml;berall erh&auml;ltlich ist. 
Ich habe sie zwischen Terrarienboden und Sandschicht liegen.  Als Lampen 
verwende ich zwei Leuchtstoffr&ouml;hren (eigentlich mehr f&uuml;r die allgemeine 
Terrarienbeleuchtung) "Sylvania Aquastar".  Als k&uuml;nstliche Sonne dient eine 
80 W Reflektorlampe.<br>
<br>
<br>
<strong>Pflegemassnahmen:</strong><br>
<br>
Die Pflege des Terrariums ist nicht besonders aufwendig.  Trotzdem verlangt 
es die t&auml;gliche Aufmerksamkeit. So sollte mindestens einmal am Tag der Kot 
aus dem Terrarium entfernt werden, schon allein des Geruchs wegen, der noch 
durch Luftfeuchte und W&auml;rme gesteigert wird.  Ansonsten wird man sp&auml;testens 
am n&auml;chsten Tag &uuml;bel daran erinnert.  Ausserdem sollte der Bodengrund bei 
Bedarf mal abgesaugt werden, zumindest H&auml;utungsreste entfernt werden.<br>
<br>
Die Pflege der Tiere ist f&uuml;r mich mit sehr viel Spass verbunden, weil sie  
sehr zutraulich sind und man was mit ihnen anfangen kann. Man sollte Pogonas 
einmal pro Woche baden, bei H&auml;utungsschwierigkeiten h&auml;ufiger. 
Ich verbinde das ganze mit einem vorherigen Sonnenbad auf der Fensterbank. 
Dazu stelle ich einen ausgedienten Kaninchenk&auml;fig vor das Fenster lege 
einen Ast hinein und decke eine H&auml;lfte als Schattenplatz ab. Sobald mich 
die Pogonas dabei gesichtet haben, sitzen sie bereits voller Erwartung an 
der Scheibe. Ich lasse sie etwa 1 Stunde die Sonne geniessen und bade sie 
danach im Waschbecken (noch, bis sie ausgewachsen sind und in die Badewanne 
m&uuml;ssen.) Das Wasser sollte handwarm sein, eben richtig angenehm. Dort 
l&auml;sst man sie ein paar Runden schwimmen und kann sie wieder ins Terri 
zur&uuml;cksetzen.<br>
<br>
Das w&auml;re zun&auml;chst mal die st&auml;ndig notwendige Pflege.  Bei H&auml;utungsschwierigkeiten, 
wie oben erw&auml;hnt, h&auml;ufiger baden. Dabei kann man im  
Wasser vorsichtig versuchen, einige Hautfetzen abzul&ouml;sen.<br> 
<br>
Krallen m&uuml;ssen bei kletternden Echsen nicht geschnitten werden. Falls man 
jedoch einen "Bodenhocker" unter seinen Pogonas hat (was zugegebener Massen 
ausserst ungew&ouml;hnlich w&auml;re), muss man sie st&auml;ndig kontrollieren und 
gegebenenfalls doch schneiden. Auf jeden Fall dazu Fachliteratur zu Rate 
ziehen! (z.B."ECHSEN als Terrarientiere" von H.Jes, GU Tier-Ratgeber)<br>
<br>
<br>
<strong>Das Futter:</strong><br>
<br>
Ausgewachsene Pogonas fressen zu etwa 80% vegetarische Kost und 20% 
Futtertiere.  An Gr&uuml;nzeug kann man ihnen so ziemlich alles anbieten. 
Bevorzugt wird aber gelbe und rote Nahrung, z.B. Tomate, Mango, M&ouml;hre.... 
einfach alles.  Es sollte aber darauf geachtet werden, dass keine 
gespritzten Fr&uuml;chte und Salate verf&uuml;ttert werden! Zus&auml;tzlich biete ich 
meinen Alete an. Nat&uuml;rlich wollen sie auch hier lieber Karottengem&uuml;se oder 
sonstiges Oranges. Wenn man sich Arbeit ersparen will, bietet man es ihnen 
nicht in einem grossen Napf an, da sie es lieben, darin zu baden. Sie laufen 
mit Vorliebe durch den Napf, danach durch den Sand und als Kr&ouml;nung legen 
sie sich unter den Strahler, damit auch alles sch&ouml;n trocknen kann. Aus 
diesem Grund bade ich meine Pogonas h&auml;ufiger als einmal die Woche, um sie 
von ihren harterarbeiteten Klumpf&uuml;ssen zu befreien.  An tierische Kost 
fressen sie alles, was sie von der Gr&ouml;sse her bew&auml;ltigen k&ouml;nne. Darunter 
fallen nestjunge M&auml;use (muss aber nicht sein), Grillen, Heimchen, Schaben, 
Mehlw&uuml;rmer (bevorzugt sind die Larven und K&auml;fer)...  Mehlw&uuml;rmer sollten 
nicht zuviel verf&uuml;ttert werden,weil sie zu Fetthaltig sind.<br>
Ausserdem sollte etwas Abwechslung geschaffen werden. Pogonas wechseln 
mitunter t&auml;glich ihre Geschmacksrichtung und man muss zusehen, dass man 
ihnen etwas anderes anbieten kann. Die Futtertiere m&uuml;ssen nachts aus dem 
Terri entfernt werden, da sie sonst die steifgewordenen Pogonas anfressen. 
Da die Nahrung nicht vollst&auml;ndig den n&ouml;tigen Vitaminbedarf abdeckt, 
m&uuml;ssen zus&auml;tzliche Pr&auml;parate verabreicht werden. Ich verwende KORVIMIN, 
ein Pulver, womit ich die Futtertieren best&auml;ube. Es ist bei jedem Tierarzt 
erh&auml;ltlich und sollte regelm&auml;ssig (so etwa alle 2 Tage) gegeben werden. 
Ansonsten tauchen Mangelerscheinungen auf und die Tiere sind Rachitis gef&auml;hrd 
et.
Die Futtertiere kann man bei entsprechenden Farmen bestellen . 
Ich bin davon abgekommen, sie im normalen Zoohandel zu kaufen. Sie haben 
meist schlechtere Qualit&auml;t und sind lange Zeit in Plastikdosen ohne Futter 
und Wasser gewesen.<br>
<br>
<br>
<strong>Pogonas gekauft, was jetzt?</strong><br>
<br>
Generell kann ich nur empfehlen, Nachzuchten bei Z&uuml;chtern zu kaufen oder 
einen wirklich guten Fachhandel aufzusuchen. Man sollte sich auf jeden Fall 
zeigen lassen, dass die Tiere Futterfest sind. Meist werden sie zu jung 
abgegeben. Die meisten Z&uuml;chter geben die Tiere erst ab, wenn sie absolut 
Futterfest sind, also so etwa mit 3-4 Wochen (und garantieren auch daf&uuml;r). 
Zudem habe ich festgestellt, dass die Pogonas billiger sind.  Man sollte 
vorher den Z&uuml;chter besuchen und sich die Bedingungen vor Ort ansehen.  Hat 
man seine ne&uuml; Errungenschaft erstmal zu Hause und ist ausserdem noch 
absoluter Laie in Sachen Terrarien, geht der Stress erst mal richtig los. 
Was tu ich, damit es m&ouml;glichst perfekt ist? Grunds&auml;tzlich ist das 
st&auml;ndige Herausnehmen aus dem Terrarium Stress f&uuml;r die Tiere. Darum sollte 
man es auf das N&ouml;tigste beschr&auml;nken.  Ich bin ins routieren gekommen, weil 
meine die ersten 4 Tage nicht fressen wollten. Dabei war das v&ouml;llig normal, 
weil sie die Umstellung noch nicht so verkraftet hatten. Vor allem fressen 
sie nur, wenn das Futter direkt vor, am Besten noch aufs Maul spaziert. Die 
Nahrung muss in dem Stadium rein tierisch sein, da die Jungtiere ihre 
n&ouml;tigen Wachstumsstoffe aus den Futtertieren ziehen. Es sollte auch jeden 
Tag eine Portion Grillen mit Korvimin best&auml;ubt werden. Das Futter wird 
mehrmals am Tag in kleinen Portionen verabreicht.  Man sollte auf jeden Fall 
in der ersten Zeit eine Futterliste f&uuml;hren, um das Fressverhalten zu 
kontrollieren und nachh&auml;ngende Pogonas einzeln zu f&uuml;ttern.  Es ist schon 
vorgekommen, dass viel kleinere Jungtiere von gr&ouml;sseren gefressen wurden, 
weil sie von ihrer Gr&ouml;sse her als Futter gesehen wurden.  Als Anfangsration 
(bei einer Gr&ouml;sse von ca. 12 cm) sollte man etwa 8 Futtertiere pro Tag und  
pro Pogona rechnen.  Mein "Futzi" machte uns am Anfang echte Sorgen. Er hing 
mit dem Wachstum etwas nach, so dass wir ihn isolieren wollten. Aber mit 
<a name="verweis4">einem </a>Mal schlug er zu und <a href="POGONA4.HTML"> 
ist jetzt der Gr&ouml;sste im Terrarium</a>. Mein "Opi" wollte eine ganze Zeit
nicht fressen und wir hatten vor, eine Zwangsf&uuml;tterung 
einzuleiten. Wir besorgten eine Spritze (ohne Aufsatz), f&uuml;llten 
sie mit Alete vermischt mit Korvimin und versuchten mit allen Regeln der 
Kunst, das Maul aufzukriegen. Es klappte absolut nicht, bis ein Tropfen aus 
der Spritze zuf&auml;llig auf sein Maul kam. Er schleckte ihn ab und sperrte 
freiwillig das Maul auf.  Von da an bekam er mehrmals am Tag die Spritze, 
von der er gierig die Tropfen ableckte. Damit war sein Appetit angeregt und 
von da an verschm&auml;hte er auch das andere Futter nicht mehr. Ich denke, man 
kann viele Probleme mit Gef&uuml;hl l&ouml;sen. Wenn nat&uuml;rlich alle Pogonas im 
Terri nicht mehr fressen, sollte man intensive Ursachenforschung betreiben. 
Bei uns war die Ursachen eine flackernde Leuchtstoffr&ouml;hre, f&uuml;r uns kaum 
wahrnehmbar. Es hat lange geda&uuml;rt, das festzustellen. Aber als die R&ouml;hre 
stillgelegt war, haben alle Pogonas wieder gefressen.<br>
<br>
Auf jeden Fall sollte man bei Problemen R&uuml;cksprache mit dem Z&uuml;chter oder 
anderen Erfahrenen halten und nicht unbedingt nur B&uuml;cher w&auml;lzen.<br> 
<br>
Pogonas wachsen f&uuml;r gew&ouml;hnlich sehr schnell. Meine sind innerhalb 4 Monaten 
von 12 cm auf 32 cm gewachsen. Gerade am Anfang geht es besonders schnell 
<a name="verweis2"> </a>und man sollte ein paar 
<a href="POGONA2.HTML">Fotos</a> machen, sonst glaubt man es hinterher nicht 
mehr.  Man kann sagen, dass sie innerhalb eines Jahres ausgewachsen sind.<br> 
<br>
<br>
<strong>Geschlechtsbestimmung:</strong><br>
<br>
In Fachb&uuml;chern findet man hervorragende Geschlechtsmerkmale, die ich alle 
nicht nachvollziehen kann. Ich stehe immer mit einem Pogona vor der 
Abbildung im Buch und suche die "Femoralporen" bei M&auml;nnchen. In einem 
anderen Buch steht, dass sich im Wachstum die Ausbildung der Poren 
sexualzyklisch wechselt. Und so hab ich in der einen Woche nur M&auml;nnchen, in 
der n&auml;chsten vielleicht nur Weibchen?  Ich habe es aufgegeben. Meine 
Z&uuml;chterin dachte immer von einem ihrer Pogonas, dass es 100%ig ein 
M&auml;nnchen ist. Es drohte und balzte absolut typisch, bis... 
...bis das vermeintliche M&auml;nnchen Eier legte. Wahrscheinlich wissen die 
Tiere selbst nicht so ganz, was sie werden wollen, zumindest behalten sie es 
f&uuml;r sich.<br>
<br>
<br>
<strong>Zucht und Aufzucht:</strong><br>
<br>
Hier&uuml;ber konnte ich nur Informationen aus B&uuml;chern und von Bekannten 
verwenden, weil meine noch nicht so weit sind!<br> 
<br>
Die Weibchen sind mit einer Kopf-Rumpf-L&auml;nge von etwa 13 cm geschlechtsreif. 
Bei der Balz wird kr&auml;ftig mit dem Kopf genickt. Ausserdem 
<a href="I_BEARD1.GIF">winken</a> die Tiere 
mit den Vorderbeinen, indem sie langsame, kreisende Bewegungen machen 
(dieses Verhalten zeigt sich allerdings schon vorher). Hat sich ein Paar 
gefunden, kommt es zur Begattung.<br>
<br>
Vor der Eiablage w&uuml;hlt das Weibchen das ganze Terrarium um auf der Suche 
nach einem geeigneten Eiablageplatz. Diesen Platz findet sie meist unter 
Steinaufbauten, etwas gesch&uuml;tzt, wo der Sand locker und feucht ist. Darum 
sollten einige Stellen regelm&auml;ssig befeuchtet werden, um ihr die Suche 
nicht unn&ouml;tig zu erschweren. In diesem Stadium sollte man so wenig wie 
m&ouml;glich ans Terrarium gehen, um es nicht zu st&ouml;ren, da sie sonst in 
Legenot kommt. Hat das Weibchen die Eier abgelegt, bedeckt sie es mit einer 
Schicht Sand.  Man gr&auml;bt die Eier vorsichtig aus und &uuml;berf&uuml;hrt sie in 
einen Brutbeh&auml;lter.  Das kann ein kleines Terrarium sein oder ein 
handels&uuml;blicher Inkubator oder einfach irgendetwas, das Temperatur und 
Luftfeuchte h&auml;lt. Die Box f&uuml;r die Eier selbst ist mit Vermiculit gef&uuml;llt. 
Das Umbetten der Eier muss &auml;usserst vorsichtig geschehen. Die Eier d&uuml;rfen 
nicht in ihrer Lage ver&auml;ndert werden, da der Keimling bei der Ablage 
bereits fixiert ist und er durch Verlagerung durch den Dotter erstickt 
w&uuml;rde.  Die Eier sollten in kleinem Abstand z&uuml;inander gelagert werden, da 
sich z.B. die evtl. F&auml;ule eines Ei's auf die anderen &uuml;bertragen kann.  Die 
Zeitigungsda&uuml;r betr&auml;gt 68-96 Tage bei 26' C.  Nach dem Schl&uuml;pfen 
&uuml;berf&uuml;hrt man die Jungen in kleine Terrarien. Es ist wichtig das 
Futterverhalten st&auml;ndig zu kontrollieren und schw&auml;chere Tiere in ein 
anderes Terrarium zu setzen.<br>
<br>
<br>
<strong>Verhalten zum Menschen:</strong><br>
<br>
Pogonas k&ouml;nnen absolut handzahm werden. Sie lieben es, auf der warmen Hand 
des Halters zu sitzen und thronen gerne auf seiner Schulter.  Mein "Opi" 
braucht regelm&auml;ssige Streicheleinheiten.  Als ich mich dazu entschloss, mir 
Echsen anzuschaffen, habe ich mir eine Aussage zum Vorsatz gemacht: Echsen 
sind keine Schmusetiere! Allerdings musste ich diese Einstellung ablegen, 
nachdem mein "Opi" nur gefressen hat, wenn er vorher geschmust wurde. Ich 
wollte es nicht glauben, ist aber so. Dabei lasse ich ihn immer selbst 
ankommen. Wenn ich das Terrarium reinige, kann es schon mal passieren, dass 
sich die Pogonas auf meine Hand st&uuml;rzen, am Pullover den Arm hochklettern 
und auf der Schulter sitzen bleiben. Dann wollen sie die grosse, weite Welt 
sehen und lassen sich nicht davon abhalten. Ich habe schon mehr als einmal 
die K&uuml;che geputzt mit einem Pogona auf dem Buckel.  Das h&ouml;rt sich jetzt 
vielleicht ganz toll an, aber man sollte nicht vergessen, dass die Tiere es 
<a name="verweis3"> </a> freiwillig tun. <a href="POGONA3.HTML">Man darf so 
ein Verhalten nicht erzwingen</a>, sondern muss sich das Vertrauen verdienen. 
Ich kann solche Aktionen auch nicht mit allen 
durchf&uuml;hren und es bleiben immer noch Echsen.<br>
 <br>
<br>
<br>
---------------------------------------<br>
&Auml;nderungen ohne Erlaubnis des Autors sind untersagt.<br>
<br>
Bei Fragen, Anregungen und Erg&auml;nzungen wende man sich bitte an :<br>
<br>
<adress>  Kirsten Knaup @ 2:245/6635<br>
    oder<br>
  kirsten@hummel.pfalz.de<br>
</address>

<hr>
<a href="POGONA.MPG"> s/w MPEG von Pogona vitticeps </a>
(digitalisiert von Markus Schroeder)


<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>
