<HEAD>
<TITLE>
Geophagus surinamensis </TITLE>
</HEAD>

<BODY>
<a href="CICHLASO.HTML"><img src="ALEFT.GIF"></a> <a href="FUTTER1.HTML"><img src="ARIGHT.GIF"></a><hr>
<h5>(c) G.Gantschnigg@raptor.dontpanic.sub.org
</h5><hr>
<h2>
<CENTER>Zucht des Surinam-Perlfisches</CENTER><p>
<CENTER><img align=middle src="I_SURIN2.GIF">  Geophagus surinamensis</CENTER>
</h2><hr>

<P ALIGN="LEFT"><b>Die Zuchttiere</b></P>
<P ALIGN="LEFT">Aus einem Bestand von 2,2 Wildf&auml;ngen bildet sich nach &uuml;ber zwei Jahren das
Zuchtpaar heraus.  Die Gr&ouml;&szlig;e betr&auml;gt 20cm bzw.  17cm beim Weibchen.  Das
M&auml;nnchen besitzt auff&auml;llig verl&auml;ngerte Flossenspitzen.
</P>
<P ALIGN="LEFT"><b>Das Becken</b></P>
<P ALIGN="LEFT">Ein 210l Vollglasaquarium mit 120cm Seitenl&auml;nge.  Die Wasserwerte:  T=27grdC,
pH=7, GH=14, KH=3.<br>  Die Einrichtung:  gro&szlig;e Sand- und Lavasteine, eine Moorkienwurzel, Kies-Sand-Gemisch; die Einrichtung ist sehr stark veralgt.<br>
Technik:  Luftausstr&ouml;mer, gelegentlich wird eine alte Turbelle 1000 mit
Wattef&uuml;llung eingesetzt, 40W Tageslichtr&ouml;hre, Morgensonne (tolle Technik ;)<br>
Mitbewohner:  1,1 G.surinamensis(15cm), 0,1 G.cf.surinamensis(13cm), 0,0,3
Panaque spec., 0,0,1 Pseudogastromycon spec.</P>

<P ALIGN="LEFT"><b>Zucht</b></P>
<P ALIGN="LEFT">Tag X:  Das Paar laicht in den Morgenstunden ab.  In 3 Stunden werden ca.  200
orangegelbe Eier von 2-3mm Durchmesser abgelegt.  Das Paar laicht auf einem
h&uuml;geligen Sandstein, der vorher nur schlampig ges&auml;ubert worden ist.  Der
Gelegedurchmesser betr&auml;gt ca.  40cm.  Die Eier haften schlecht und fallen zum
Teil herunter.  Der Brutbereich wird -f&uuml;r Geophagus-Verh&auml;ltnisse- intensiv
verteidigt:  die sehr gutm&uuml;tigen Tiere bringen es tats&auml;chlich fertig,
8cm-Welse zu vertreiben!  Fr&uuml;h am Nachmittag beginnt die Eiaufnahme.  Sehr
bed&auml;chtig nat&uuml;rlich, praktisch jedes aufgenommene Ei wird individ&uuml;ll
einsortiert.  Gegen Abend ist aufgrund dieser zeitraubenden Massnahme erst die
H&auml;lfte des Geleges aufgenommen worden.  Die dreistesten Mitbewohner konnten
in den verstrichenen Stunden bereits den Laich probekosten.
</P>
<P ALIGN="LEFT">1.Tag:  Beide Elterntiere kauen, auf dem Substrat befinden sich nur noch
wenige Eier, von denen das M&auml;nnchen hin und wieder noch eines aufnimmt.  Der
Brutbereich von 40cm Durchmesser wird in der &uuml;blichen gutm&uuml;tigen Weise
verteidigt.  { Gl&uuml;cklicherweise sind keine Malawibarsche oder Schlimmeres im
Becken!}</P>

<P ALIGN="LEFT">2.Tag:  Wieder Maulbrutpflege der Eltern.  Am letzten verbliebenen Ei auf dem
Substrat l&auml;sst sich die beginnende Embryonalentwiklung beobachten.  Bei der
F&uuml;tterung mit Trockenfutter man&ouml;vrieren die Elterntiere die Nahrung durch
st&auml;ndiges Umschichten und Herumka&uuml;n durch den Mundraum.  W&auml;hrend der
Nahrungsaufnahme sind die Tiere agressiver als sonst.
</P>
<P ALIGN="LEFT">3.Tag:  Beide Tiere halten sich im Brutrevier auf.  Das Weibchen hat z.Z.
wohl die meisten Eier.  Bei einem Blick ins Maul l&auml;sst sich eine dunkle
Pigmentierung der Embryonen feststellen.  Auf das typische Sandkauen
verzichten die Tiere v&ouml;llig.
</P>
<P ALIGN="LEFT">6.Tag:  Das <a href="SURINAM2.JPG">M&auml;nnchen</a> br&uuml;tet hauptamtlich und hat fast den gesamten Anteil
des Weibchens mit &uuml;bernommen.  Es st&ouml;sst das Weibchen &ouml;fter in die Flanken,
sogar Maulzerren ist zu beobachten; vielleicht soll das Weibchen die Brut
&uuml;bernehmen, damit das Fressen leichter f&auml;llt ?  Artfremde Mitbewohner werden
zunehmend geduldet, ein Brutrevier existiert nicht mehr:  die Tiere halten
sich an den schon vorher bevorzugten Unter- st&auml;nden auf.
</P>
<P ALIGN="LEFT">8.Tag:  Das Weibchen tr&auml;gt jetzt alle Embryonen; sie tragen noch einen
deutlichen erkennbaren Dottersack.
</P>
<P ALIGN="LEFT">10.Tag:  Immer noch das Weibchen mit allem Nachwuchs, das M&auml;nnchen wird ihm
gegen&uuml;ber zunehmend aggressiver.  { Endlich nehme ich den Filter wieder
-&uuml;ber Nacht- mit voller Leistung in Betrieb, vorher hatte ich Angst, die
Jungen anzusaugen }
 </P>
<P ALIGN="LEFT">12.Tag:  Gegen Mittag ist die Anzahl der Jungtiere merklich reduziert, abends
sind alle verschwunden und das Weibchen frisst wieder normal.  Ein
Gefressenwerden der Jungtiere konnte ich nicht beobachten.  Das M&auml;nnchen ist
weiterhin agressiv gegen&uuml;ber dem Weibchen.
</P>
<P ALIGN="LEFT"><b>Ursachen</b></P>
<P ALIGN="LEFT">keine Ahnung; vermutlich fehlte es den Eltern aber noch an Erfahrung ;)
</P>
<P ALIGN="LEFT"><b>Zucht</b></P>
<P ALIGN="LEFT">Etwa alle 5-6 Wochen bereiten die Zuchttiere eine ne&uuml; Eiablage vor.  Nach
drei erfolglosen Aufzuchten haben sie mittlerweile gen&uuml;gend Erfahrungen
gesammelt und kooperieren besser.  Die direkten Nahrungskonkurrenten, die pro
Tag 20-50 Jungtiere gefressen haben, werden jetzt entfernt, es verbleiben nur
noch die Welse im Aquarium.
</P>
<P ALIGN="LEFT"><b>Aufzucht</b></P>
<P ALIGN="LEFT">1.Tag:  Ablaichen der Tiere, sie wirken scheuer als vorher und sind agressiv
gegeneinander.
</P>

<P ALIGN="LEFT">8.Tag:  Die Eltern wechseln wie sonst &ouml;fter die Brut.  Einige Jungtiere
werden in entlegene Viertel des Aquariums versprengt.  Der Ausstr&ouml;mer mit
seiner Str&ouml;mung &uuml;bt eine starke Anziehungskraft aus.  Vermutlich ist f&uuml;r
den Schwimmreflex in die Mundh&ouml;hle der Elterntiere auch die Wasserstr&ouml;mung
von Bedeutung.  Der Filter bleibt ausgeschaltet.
</P>
<P ALIGN="LEFT">9.Tag:  Erste kurze Ausfl&uuml;ge der Jungen.  Die Temperatur betr&auml;gt 29-30°C.
Bei 26°C war das erste <a href="SURINAM1.JPG">Freischwimmen</a> erst nach 11-12 Tagen zu beobachten.  Da
die Mitbewohner nun fehlen, bringen die Alten die Brut hoffentlich &uuml;ber die
Zeit!
</P>
<P ALIGN="LEFT">12.Tag:  Erste F&uuml;tterung mit Trockenfutter und Artemia, die sehr gut ankommen
;)
</P>
<P ALIGN="LEFT">13.-27.Tag:  Artemia F&uuml;tterung wird beibehalten, t&auml;glich werden 10% des
Aquarienwassers gegen enth&auml;rtetes Wasser ausgetauscht.  Die Temperatur
betr&auml;gt 28°C.  Der Filter arbeitet mit sehr geringer Ansaugstr&ouml;mung.
</P>
<P ALIGN="LEFT">28.Tag:  &uuml;bergang zur F&uuml;tterung mit gefrorenen Bosmiden.  Die Gr&ouml;&szlig;e der
Jungtiere betr&auml;gt jetzt 11-15 mm.
</P>
<P ALIGN="LEFT">30.Tag:  &uuml;bergang zu Cyclops(gefroren), die gerne gefressen werden.
</P>
<P ALIGN="LEFT">34.Tag:  Das Sandpicken der Jungtiere geht &uuml;ber in echtes Sandkauen (sind
eben "Erdfresser" ;-)) Die Gr&ouml;&szlig;e betr&auml;gt maximal 18mm.
</P>
<P ALIGN="LEFT">36.Tag:  Endlich mal wieder Wasserwerte gemessen:  pH=7, GH=16°,T=28°, KH
nicht gemessen, liegt aber auf jeden Fall &uuml;ber 1°dH.
</P>
<P ALIGN="LEFT">40.Tag:  Die Wassermenge f&uuml;r den Wasserwechsel wird auf 20% angehoben.  Im
Filtermaterial finde ich vier tote Jungfische, die wohl zu neugierig waren.
Die gr&ouml;&szlig;ten Tiere erreichen die 2cm-Marke, die Winzlinge sind erst 12-13mm
gro&szlig;.  Verst&auml;rkt kann ich eine Zunahme der Flossenf&auml;rbung und eine
zunehmende Entwicklung irisierender Punkte entdecken.  Die Tiere bekommen
immer noch Cyclops.
</P>
<P ALIGN="LEFT">46.Tag:  Wieder zwei Jungtiere im Filter.  Die Jungen picken jetzt viel an den
Alttieren herum, was denen sichtlich unangenehm ist.  Die Alttiere,
insbesondere das Weibchen, wirken etwas kr&auml;nklich:  Hervorq&uuml;llen der Augen
und Tr&uuml;bung der Augenhinterseite (Pilz?).  Kindererziehung zehrt eben !!-) So
langsam verf&uuml;ttere ich auch ordentlich Trockenfutter, Cyclops sind teuer!
</P>
<P ALIGN="LEFT">53.Tag:  &uuml;bergang zur F&uuml;tterung mit schwarzen M&uuml;ckenlarven(gefroren),
allerdings gibt es haupts&auml;chlich Trockenfutter.  Die Tiere sind jetzt maximal
3cm, minimal 1,5cm gro&szlig;.
</P>
<P ALIGN="LEFT">54.Tag:  Die Alttiere scheinen schon wieder Laichvorbereitungen zu treffen:
Das M&auml;nnchen weist das Weibchen durch Stubsen bei gleichzeitigem R&uuml;tteln auf
ne&uuml; Laichpl&auml;tze hin (auch schon bei Geophagus steindachneri beschrieben),
tolle Laichpl&auml;tze werden sporadisch "anges&auml;ubert".  Die Temperatur wird auf
26°C gesenkt.  Der Wasserwechsel wird auf 30% vergr&ouml;&szlig;ert, allerdings wird
gleichzeitig das Intervall verl&auml;ngert (maximal 5 Tage).
</P>
Seit einiger Zeit bildet sich Schmieralgen auf dem Fadenalgenrasen, allerdings
nur an den hellsten Stellen.  Liegt es vielleicht an der zeitweise schwachen
Wasserbewegung?  Die Turbelle l&auml;uft zwar jetzt kr&auml;ftig, zu Beginn der
Aufzucht allerdings nur auf Sparflamme.

<P ALIGN="LEFT">56.Tag:  Die Elterntiere laichen erneut, abends sind alle Eier vom Weibchen
aufgenommen.  Nach der F&uuml;tterung sind die Eier aber wieder verschwunden !!??
</P>
<P ALIGN="LEFT">65.Tag:  Das Weibchen zeigt deutlich Krankheitszeichen:  Schaukeln, Umkippen,
Flossenklemmen, Wucherung in der R&uuml;ckenflosse, an der die Jungtiere auch
herumpicken.  Die Temperatur betr&auml;gt jetzt 25°C.
</P>
<P ALIGN="LEFT">68.Tag:  Die Alttiere werden umgesetzt, zu sp&auml;t, wie sich herausstellen soll.
Der Wasserwechsel wird auf 40% gesteigert.
</P>

<P ALIGN="LEFT">69.-89.Tag:  Wasserwechsel maximal 50%, Zyklus 8 Tage.
</P>
<P ALIGN="LEFT">93.Tag:  Verkauf s&auml;mtlicher Jungtiere:  273 Tiere haben es &uuml;berlebt, ca.  15
Tiere nicht.
</P>

<P ALIGN="LEFT"><b>FAZIT</b></P>
<P ALIGN="LEFT">Hat man das Gl&uuml;ck, da&szlig; sich aus einer Jungfischmenge ein harmonierendes
Zuchtpaar herausbildet, ist die Aufzucht relativ unproblematisch.</p>  
<P ALIGN="LEFT">Einige Punkte scheinen mir besonders wichtig zu sein:</P>
<ul>
<LI>gro&szlig;e Becken, insbesondere f&uuml;r die Aufzucht, vielleicht ab 200 l</LI>
<LI>weiches Wasser, GH um 10°, KH gering, pH<=7</LI>
<LI>h&auml;ufiger Wasseraustausch</LI>
<LI>F&uuml;tterung mit Lebendfutteranteilen</LI>
<LI>hohe Temperaturen >27°C</LI>
<LI>Zuchtpaar alleine halten, hinterher aus dem Aufzuchtbecken entfernen</LI>
</ul>
<HR>
<a href="BEGRUESS.HTML">Begr&uuml;&szlig;ung</a> , <a href="FORUM.HTML">Forum</a> , <a href="TERMINE.HTML">Termine</a> , <a href="ANZEIGEN.HTML">Anzeigen</a> , <a href="IMPRESSU.HTML">Impressum</a> , <a href="INDEX.HTML">Index</a>
<hr>
<h5> RAPTOR-MAG Ausgabe 2
</h5>

</BODY>