<html>
<head>
<!-- "author" content="Wolf Zimmer"     -->
<title>EMail-Knigge</title>
</head>
<body background="wolf1.gif" text=black link=blue vlink=blue bgcolor=gray>
<a href="onl_email00.html#inh"> zum Inhaltsverzeichnis </a>
<br>
<h2>Konventionen</h2>

<hr>
        
<p>Ich habe die Erfahrung gemacht, da&szlig; man immer dann sich eher
formell verh&auml;lt, wenn man nicht erwartet, da&szlig; der
Gespr&auml;chspartner wirklich antworten wird oder antworten kann. Als
Beispiel m&ouml;gen die folgenden drei Situationen dienen, in denen jemand
nicht in der Lage ist, zu antworten:
<ul>
<li>Wenn Sie und die K&ouml;nigin von England miteinander Tee trinken,
w&uuml;rden Sie einander vielleicht fragen: "Wie geht es?", aber
keinesfalls die gegenseitige Krankengeschichte er&ouml;rtern.

<li>Karl Schiller ist tot. Es ist nicht m&ouml;glich, ihn nach einer
Interpretation seiner &Auml;u&szlig;erung: "Die Pferde m&uuml;ssen saufen."
zu fragen.

<li>Wenn jeder in einem Saal versuchen w&uuml;rde, einen Beitrag zu
leisten, w&uuml;rde ein Chaos entstehen.
</ul></p>

<p>Gespr&auml;che mit Menschen mit sehr unterschiedlichem sozialen Status
oder aber mit Toten, nicht Geborenen und/oder sehr gro&szlig;en Gruppen
erzwingen gradezu eine gewisse F&ouml;rmlichkeit.</p>

<p>Im Gegensatz dazu wird in Gespr&auml;chen mit Bekannten eine sehr
lockere Sprache benutzt. Wenn Sie mit einem Freund genauso sprechen
w&uuml;rden, wie mit der englischen K&ouml;nigin, w&auml;re Ihr Freund sehr
erstaunt und w&uuml;rde sich fragen, was er/sie falsch gemacht hat.</p>

<p>Sie k&ouml;nnen daher auch durch einen bewu&szlig;t f&ouml;rmlichen Ton
die Anzahl Ihrer Emails steuern. Da man auf Emails leicht antworten kann,
neigen Menschen dazu, eine sehr lockere Sprache zu verwenden.</p>

<p>Ein informeller Ton best&auml;rkt den Partner, zu antworten. Dies ist
n&uuml;tzlich, wenn Sie Antworten bekommen wollen. Wenn Ihre Email-Adresse
gar sehr bekannt ist, kann es sogar sein, da&szlig; Sie mehr Emails
bekommen, als Ihnen lieb ist!</p>

<p>Seien Sie daher vorsichtig, welchen Ton Sie in einer Email anschlagen.
Wenn Sie Antworten wollen, seien sie gespr&auml;chig und informell. Wenn
Sie dagegen lieber wenige Antworten wollen, sollten sie m&ouml;glichst
formell sein.</p>

<hr>
        
<p>Weiter zum Thema <a href="onl_email08.html">Anreden, Abschl&uuml;&szlig;e
und Unterschriften</a><br>
zur&uuml;ck zum Thema <a href="onl_email06.html">Status</a><br>
zur&uuml;ck zum <a href="onl_email00.html#inh"> Inhaltsverzeichnis </a></p>

<hr>
        
<p>Bitte beachten Sie die <a href="Email.html#Copyright">Copyright-Information</a>. </p>
<p>&nbsp;
</body>
</html>
