<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses1.html">PREV</a> | <a href="diverses3.html">NEXT</a>
<hr>
<pre>

2. Wir haben recherchiert: Wer sich hinter &raquo;AMIGA Fever&laquo; verbirgt

Ger&uuml;chte, da&szlig; eine neue deutschsprachige AMIGA-Zeitschrift geplant sei, 
gibt es bereits, seitdem vor einigen Wochen die Homepage 

th&uuml;ringischen Ilmenau abgehaltenen AMIGA-Messe &quot;Fun of Computing&quot; wurde 
schlie&szlig;lich eine Umfrage &uuml;ber den gew&uuml;nschten Inhalt der &quot;AMIGA Fever&quot; 
durchgef&uuml;hrt.

AMIGA aktuell hat recherchiert und &uuml;ber den Mann an der Spitze folgendes 
herausgefunden:

Herausgeber des geplanten Magazins ist Malte Mundt, 24 Jahre, (ehemals?) 
begeisterter C64-Anh&auml;nger und bis vor kurzem Redakteur des im CSW-Verlag 
erscheinenden C64-Magazins &quot;GO64!&quot;. Bis vor kurzem - weil er sich aufgrund 
eines Streits &uuml;ber die Zukunft der GO64! mit dem Herausgeber, Enno Coners, 
und anderen Redakteuren &uuml;berworfen hatte. So war Mundt etwa daf&uuml;r, einen 
internationalen Teil und eine AMIGA-Sektion in dem Magazin zu etablieren, 
was in der Redaktion zum damaligen Zeitpunkt f&uuml;r zu risikoreich befunden 
wurde.

Das GO64!-Team erhebt &uuml;brigens schwerwiegende Anschuldigungen gegen das 
ehemalige Mitglied Mundt und einige Getreue: So habe er versucht, den von 
Coners gef&uuml;hrten CSW-Verlag feindlich zu &uuml;bernehmen, ebenso wie die 
Homepage des Magazins (<a href="http://www.go64.c64.org">http://www.go64.c64.org</a>), was ihm jedoch in beiden 
F&auml;llen nicht gelungen sei. Auch versuche er, in ihrem Namen Projekte zu 
starten und dem Magazin auf verschiedene Art und Weise zu schaden.

Malte Mundt w&auml;re, wenn das Projekt &quot;AMIGA Fever&quot; zustande kommen sollte, 
ein absoluter Quereinsteiger, was die heutige AMIGA-Generation betrifft. 
Denn 1997 besa&szlig; er eigenen Angaben zufolge neben seinem C64 und anderen 
Computern (u.a. einem Acorn RISC-PC) lediglich einen A500. Auch schien er 
recht wenig von der AMIGA-Szene zu halten, bezeichnete er sie doch als 
arroganter im Vergleich zu der des C64.

Es wird sich also zeigen m&uuml;ssen, ob Malte Mundt wirklich wegen des AMIGA zu 
unserem Computersystem wechselt, oder ob nicht vielmehr andere Gr&uuml;nde den 
Ausschlag daf&uuml;r gaben. Ein &quot;AMIGA-Anwender mit Stallgeruch&quot; ist er auf 
jeden Fall nicht.
</pre>
</body>
</html>
