<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses2.html">PREV</a> | <a href="diverses4.html">NEXT</a>
<hr>
<pre>

3. &raquo;'Mage.&laquo; - die neue HighEnd-Grafiksoftware f&uuml;r PowerPC-AMIGAs

Eyelight, Hersteller des Raytracers Tornado3D, k&uuml;ndigt mit 'Mage. eine 
Grafiksoftware f&uuml;r den professionellen Bereich an. Damit k&ouml;nnte der AMIGA 
endlich wieder verlorenes Terrain im Grafik-, TV- und Videobereich 
zur&uuml;ckgewinnen.

Hier die &Uuml;bersetzung eines Fragenkatalogs zu 'Mage.:

&raquo;EIN NEUES ZEITALTER DER 3D-COMPUTERGRAFIK


Was ist &quot;'Mage.&quot;?

&quot;'Mage.&quot; ist ein vollst&auml;ndiges, modulares Grafikpaket, mit dem man auf
Computern und Workstations mit RISC-Prozessoren leicht und in 
beispielhafter Geschwindigkeit modellieren, animieren und rendern kann.


Warum nur RISC?

Weil die RISC-Architektur perfekt auf die 3D-Computergrafik zugeschnitten 
ist! Sowohl die PowerPC- wie auch die R5K-Architektur bieten die 
unsch&auml;tzbaren zusammengefa&szlig;ten MACC-(Multiply and Accumulate)-Befehle, die 
der Prozessor zu 80% w&auml;hrend der Vorschau oder dem Rendern ben&ouml;tigt.


Ist &quot;'Mage.&quot; ein Tornado3D mit anderem Namen?

Nein, es handelt sich um ein vollst&auml;ndig anderes Produkt, das auf den
Erfahrungen aufbaut, die w&auml;hrend der Entwicklung von Tornado3D gewonnen
wurden. &quot;'Mage.&quot; orientiert sich jedoch noch mehr am professionellen
Markt und sucht Plattformunabh&auml;ngigkeit. Das Ziel von &quot;'Mage.&quot; sind die
Hersteller von Spezialeffekten f&uuml;r TV und hochwertige Videospiele.


Hei&szlig;t das, Tornado3D ist gestorben? Verlassen Sie den Amiga?

Aber nein! Die Entwicklung des Tornado3D geht weiter, wir arbeiten schon

auf PPC-Amigas und wird h&ouml;chstwahrscheinlich auch auf &quot;Amigas der Zukunft&quot;
laufen. Tornado3D und &quot;'Mage.&quot; sind zwei getrennte Produkte, die von zwei
verschiedenen Arbeitsgruppen betreut werden und f&uuml;r unterschiedliche
Marktsegmente bestimmt sind. Dazu kommt, da&szlig; die vollst&auml;ndig auf PowerPC
ausgerichtete Technologie und das Anwender-Interface nach Industriestandard
von &quot;'Mage.&quot; wahrscheinlich auch in zuk&uuml;nftige Ausgaben von Tornado3D
integriert werden wird.


Was kostet &quot;'Mage.&quot;? Wann ist es erh&auml;ltlich?

Der Einf&uuml;hrungspreis f&uuml;r &quot;'Mage.&quot; ist vorl&auml;ufig auf 1299.00 US-Dollar
festgelegt.  Der Vertrieb der ersten Ausgabe ist f&uuml;r Anfang Oktober 1998
vorgesehen, eine massive Einf&uuml;hrungs-Kampagne soll im ersten Vierteljahr
1999 folgen.


Wird es eine Art Umstieg von Tornado3D nach &quot;'Mage.&quot; geben?

Ja, Tornado3D-Anwender k&ouml;nnen zum &quot;'Mage.&quot; &uuml;bersteigen, wenn sie wollen.
Es ist Eyelight's Politik, da&szlig; Langzeitanwender von Tornado3D g&uuml;nstige
Wechsel-Konditionen erhalten werden. &quot;Erstk&auml;ufer&quot; (Anwender, die T3D
vor der Ausgabe der Demoversion von T3D gekauft haben) werden sogar
umsonst auf &quot;'Mage.&quot; umsteigen k&ouml;nnen!


Hinweise auf die Eigenschaften von &quot;'Mage.&quot;? Sind sie denen von Tornado3D
&auml;hnlich?

Einige Eigenschaften von Tornado3D und &quot;'Mage.&quot; sind gleich, aber es 
handelt sich doch um verschiedene Erzeugnisse! W&auml;hrend Tornado3D ein 
&quot;Schweizer Offiziers-Taschenmesser&quot; der 3D-Grafik ist, das etwas f&uuml;r 
jedermann hat, hat &quot;'Mage.&quot; einen kleineren und spezielleren Satz an 
M&ouml;glichkeiten. Eine neue Web-Site nur f&uuml;r &quot;'Mage.&quot; ist im Aufbau und wird 
alles &uuml;ber &quot;'Mage.&quot; enthalten.


Unterst&uuml;tzte Ger&auml;te:

Amiga:
         Amiga mit PowerPC (&quot;'Mage.&quot; l&auml;uft 100% mit PowerPC-Routinen)
         3D beschleunigte 15Bit+ Grafikkarte
         OS 3.0 oder h&ouml;her
         64 MB RAM
         Festplatte, CD-ROM


Apple Macintosh:

         Macintosh mit PowerPC (Empfohlen wird G3)
         3D beschleunigte 15Bit+ Grafikkarte entsprechende RAVE
         MacOS 8 oder h&ouml;her
         64 MB RAM
         Festplatte, CD-ROM


Silicon Graphics
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mips R5000+ SGI ws
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;IRIX 6.2 oder h&ouml;her
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;HW texture mapping wird empfohlen
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;64 MB RAM
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Festplatte, CD-ROM&laquo;

Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: Eyelight)
</pre>
</body>
</html>
