<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses7.html">PREV</a> | <a href="diverses9.html">NEXT</a>
<hr>
<pre>

8. Drei neue Produkte von Innovative

Felix Schwarz hat uns einige Neuigkeiten zu bieten:

* Wie schon im Interview mit ihm in Ausgabe 6/98 angek&uuml;ndigt, wird seine    
  Bild- und Animationssoftware ab sofort &uuml;ber RBM vertrieben.

* Des weiteren wurde ein neuer IRC-Client angek&uuml;ndigt: BlackIRC, der         
  voraussichtlich noch in diesem Monat erscheint.

* MultiLiveCam pro ist eine Software, um eine oder mehrere VLab(s)          
  anzusteuern.

Informationen zu den Produkten gibt es auf der neuen Homepage des Autors 
(<a href="http://innovative.in-tec.de/">http://innovative.in-tec.de/</a>) und in den folgenden Bekanntmachungen:


&raquo;Ultraconv NG V3 PPC bei RBM erh&auml;ltlich

* RBM Computertechnik exklusiver, weltweiter Vertrieb

 Ab sofort ist bei RBM Computertechnik (komplette Anschrift siehe Ende 
 des Textes) die Vollversion von Ultraconv NG in der Version 3 erh&auml;ltlich. 
 RBM &uuml;bernimmt in Zukunft den exklusiven, weltweiten Vertrieb von Ultraconv 
 NG - bitte wenden Sie sich daher bei Problemen mit Ultraconv (ab V3+) 
 k&uuml;nftig an RBM. Ich kann auch keine Bestellungen f&uuml;r Ultraconv mehr 
 entgegennehmen. Bitte wenden Sie sich auch hier direkt an RBM. Ultraconv 
 wird ab sofort auf CD ausgeliefert. Die CD beinhaltet viele
 Beispielprojekte  und einige Texturen/Bilder/Animationen. Zudem sind auch
 eine Reihe Plugins  und Extras auf der CD enthalten (wie etwa ein
 uneingeschr&auml;nktes 24Bit-JFIF/  JPEG-Datatype f&uuml;r PowerUP).

* neue Features in Version 3

 *  PowerUP&reg;-Unterst&uuml;tzung

 *  gro&szlig;e Geschwindigkeitssteigerungen (bis zu 1400% gegen&uuml;ber einem
    060/50 mit einem 604e/180)
 *  automatische PPC/68K-Erkennung
 *  Benutzung der Elf-Objekte (PowerUP-Kernel von Phase 5)

 *  VLab-Lademodul
 *  neues FLI-Lademodul
 *  FLI-Speichermodul
 *  neuer (schnellerer) PNG Loader und Saver
 *  neuer, verbesserter Datatypes-Loader - jetzt auch mit Unterst&uuml;tzung f&uuml;r
    24bit-Datatypes
 *  ScanQuix-Unterst&uuml;tzung durch LadeModul
 *  stark verbessertes Cache-Managment
 *  Lokalisation der Filters und Anim-F/X ist nun durch Kataloge m&ouml;glich
 *  Die meisten Animations-Loader unterst&uuml;tzen nun auch Previews
 *  Neuer Saver f&uuml;r Transfer-ANIMationen - 256 Farben und 24bit-            
    Unterst&uuml;tzung
 *  Neuer Loader f&uuml;r Transfer-ANIMationen - HAM6, HAM8, EHB, 2-256 Farben
    und 24 bit werden unterst&uuml;tzt
 *  neues Format f&uuml;r Filter und Anim-F/X-Dateien
 *  Sie k&ouml;nnen nun Anim-Publisher-Objekte &uuml;ber die Ecken hinaus
    herausziehen
 *  neues Format f&uuml;r flexible Optionen und Hinzuf&uuml;hen von neuen Feldtypen
 *  neuschreiben der Licht-Effekte f&uuml;r h&ouml;here Geschwindigkeiten
 *  neuer Lichteffekt: Lens-Flares!
 *  neue, aktuellere Entwickler-Dokumentation
 *  verbesserte Map-Editor-Oberfl&auml;che
 *  neue Preview-Routinen (noch schneller - besonders auf 15+ Bit-Screens!)
 *  UltraPlayer-Entwicklung eingestellt und aus dem UConv-Paket genommen
 *  XFA-Player zum Abspielen von XFA-Dateien hinzugef&uuml;gt
 *  UltraRen zum massenhaften Umbenennen von Einzelbildern hinzugef&uuml;gt
 *  die flexiblen Requester unterst&uuml;tzen nun auch Datatypes zum Laden des
    Titelbildes.
 *  neuer About-Requester und neues UConv-Logo.
 *  neue Filter und Anim-F/X: Blase 1-3, Kontrast, Motion (Blur)
 *  REALTIME-Preview im Anim-Publisher f&uuml;r die wichtigsten Objekte auf
    Grafikkartenscreens
 *  die tempor&auml;r erzeugten Frames des AVI- und QT-loaders werden nun auf
    Wunsch komprimiert
 *  tempor&auml;res GUI-Speichern (mit NG V2 eingef&uuml;hrt) wieder entfernt
 *  &Uuml;bersetzung der Oberfl&auml;che in verschiedene Sprachen - eine Danksagung
    geht an die ATO!
 *  komplett neue MPEG-Loader und Saver
 *  Farbfehler-Bug im Anim-Publisher behoben
 *  UConv braucht k&uuml;nftig keine ixemul.library mehr!
 *  Prozessoroptimierte Versionen f&uuml;r 68000/10, 68020, 68030, 68040 und PPC

* Preise f&uuml;r die Ultraconv-CD

 empfohlener Verkaufspreis: 89 DM(zzgl. Versandkosten)
 Alle registrierten Benutzer werden angeschrieben. F&uuml;r weitere  Details
 wenden sich sich bitte an RBM

* Anschrift von RBM Computertechnik

 Bei Fragen zu Ultraconv V3 und aufw&auml;rts sowie bei Bestellungen wenden Sie
 sich bitte k&uuml;nftig an:

 RBM Computertechnik
 Bernd Rudolf
 Kleinenberger Weg 2a
 33100 Paderborn
 Tel: 05251/16191-9
 Fax: 05251/640655
 Support: <a href="mailto:support@rbm.de">support@rbm.de</a>
 Bestellung: <a href="mailto:order@rbm.de">order@rbm.de</a>
 WWW: <a href="http://www.rbm.de">http://www.rbm.de</a>

Mit freundlichen Gr&uuml;&szlig;en,

Felix Schwarz&laquo;


&raquo;BlackIRC ist ein neuer IRC-Client f&uuml;r den AMIGA, der unter anderem &uuml;ber 
folgende Features verf&uuml;gt:

 * mehrere Karteireiter anstatt Fensterchaos
 * Extra Chatwindows f&uuml;r private Chats
 * Volle CTCP-Implementation und Unterst&uuml;tzung
 * MUI-Oberfl&auml;che
 * Einfacher Einstieg mit BlackIRC m&ouml;glich
 * benutzerdefinierbare Buttons
 * Verwaltung von bis zu 100 Servern
 * M&ouml;glichkeit, die IP eines Benutzers direkt an einen CLI-Befehl zu        
   &uuml;bergeben (z.B. ping)
 * Erscheinungsdatum: Anfang Juli 1998
 * Preis: 15 DM&laquo;


&raquo;MultiLiveCam ist die einzige Software auf dem AMIGA, die mehrere LiveCams
gleichzeitig erlaubt - dabei werden auch mehrere VLab-Boards unterst&uuml;tzt 
und damit ist MultiLiveCam pro die einzigste (!) Software (auch
plattform&uuml;bergreifend), die es erm&ouml;glicht mehrere LiveCams &uuml;ber einen AMIGA 
zu realisieren. Geht man von 4-7 Zorro-Slots aus, so k&ouml;nnen an einem AMIGA 
bis zu 21 Cams betrieben werden. F&uuml;r Detailfragen und spezielle 
Anforderungen kontaktieren Sie uns bitte, da MultiLiveCam sich noch im 
Beta-Stadium befindet (l&auml;uft aber absolut stabil!).

Features

 * Benutzt die VLab um die Bilder zu holen
 * Unterst&uuml;tzt mehrere VLabs und somit mehrere Cams
 * Auf niedrigen Speicherverbrauch optimiert
 * Virtuelle Cams(Ausschnitt von einem Eingang)
 * Unterst&uuml;tzt OCS/ECS/AGA und CyberGraphX/Picasso 96
 * Automatischer Verbindungsauf-/abbau via Miami
 * Upload der Daten als EMail oder via FTP
 * Eingebaute Skalierungsengine
 * Unterst&uuml;tzung f&uuml;r GIF und JPEG
 * Individuelles Timing f&uuml;r jede Cam
 * Unterst&uuml;tzung von PAL und NTSC
 * &Uuml;berwachungsmodus
 * Einblenden von Schriftz&uuml;gen mit beliebiger Gr&ouml;&szlig;e
   und beliebigem Amiga-Font mit beliebiger Position
 * Unterst&uuml;tzung von Bilderserien zur Erstellung von Zeitrafferanimationen
 * Preis: 99 DM/66 US$ (inkl. kostenloses Update auf V2)

Systemanforderungen

 * mindestens eine VLab (keine Motion)
 * 2-4 MB RAM insgesamt
 * Internet-Anschlu&szlig; mit Miami
 * Amiga OS 3.x
 * 5-10 MB freier Plattenplatz&laquo;
</pre>
</body>
</html>
