<html>
<head>
  <title>Forum</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="forum2.html">PREV</a> | <a href="forum4.html">NEXT</a>
<hr>
<pre>

3. Reaktion auf den Leserbrief von Alexx Riedel (von J&ouml;rg Handwerg)

&raquo;Zum Beitrag &quot;AMIGA der Zukunft&quot; von Alexx Riedel m&ouml;chte ich folgendes
anmerken:

Die Customchips sind ein Vorteil, ob du das als deprimierend empfindest 
oder nicht. Eine Leistung wie die des AMIGAs w&auml;re damals ohne die 
Customchips &uuml;berhaupt nicht m&ouml;glich gewesen, und der PC hat immerhin diese 
Leistung nur mit brachialer Power nach 5 Jahren eingeholt!

Es mu&szlig; nicht alles in Customchips ausgef&uuml;hrt werden, dennoch hat das eben
einige klare Vorteile: Es gibt einen Standard, wie bei den heutigen AMIGAs.
Sprich: Durch die Grafikmodi, die auf jedem Rechner laufen, und die 
Customchips, die gewisse Funktionen auf JEDEM AMIGA erm&ouml;glichen, ist es f&uuml;r 
die Programmierer einfach, ein Programm zu erstellen, welches garantiert 
auf jedem AMIGA l&auml;uft. Ganz im Gegensatz dazu der PC, der, von Treibern nur 
so &uuml;bersch&uuml;ttet, nur Probleme bereitet. Da&szlig; die Customchips heutzutage 
&uuml;berholt sind, steht wohl au&szlig;er Frage, sind aber kein Argument gegen neue.

UMA (Unified Memory Architecture) ist eines der gr&ouml;&szlig;ten Vorteile des AMIGA,
welches ihm seine Vielseitigkeit, Problemlosigkeit und Geschwindigkeit
garantiert, im Gegensatz dazu die Bus-Architektur, die jede Menge
Prozessorkapazit&auml;t fri&szlig;t, da die einzelnen Karten mit Daten durch die CPU
versorgt werden m&uuml;ssen.

Das RAD soll auch nicht zweimal erfunden werden, sondern ein Rechner, der 
einem PC &uuml;berlegen ist, und das kann man mit abgekupferten Standard-PCs 
nicht erreichen! Welches Argument hat man, einen Quasi-PC mit AOS zu 
kaufen, auf dem man zwar schon Performance-m&auml;&szlig;ig nicht mehr schafft als auf 
einem normalen PC, daf&uuml;r aber dann auch nur einen Bruchteil der Software 
als auf einem Intel-PC zur Verf&uuml;gung hat? Damit kann man keinen Hund hinter 
dem Ofen hervorlocken!
Was gebraucht wird, ist ein Rechner, der &quot;Vorteile&quot; gegen&uuml;ber dem PC 
bietet, und diese sind nicht mit einem Standard-Design zu erreichen. Davon 
mal abgesehen:
Welche Firma von den gr&ouml;&szlig;eren PC-Zubeh&ouml;rherstellern w&uuml;rde denn schon f&uuml;r 
den AMIGA Treiber f&uuml;r ihre Karten schreiben? Das kann man vollends 
vergessen!

MfG

J&ouml;rg Handwerg&laquo;
</pre>
</body>
</html>
