<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="intern4.html">PREV</a> | <a href="forum1.html">NEXT</a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

Offenbar unterliegt die Teilnehmerzahl am Gewinnspiel momentan weniger 
gro&szlig;en Schwankungen als noch vor einigen Monaten: Diesmal haben sich mit 38 
Einsendungen &auml;hnlich viele Leser beteiligt wie im Vormonat.


Zur Aufl&ouml;sung:


Standard-Frage: Unter welcher Adresse ist die WWW-Homepage der AMIGA-       
                Entwicklungsabteilung AMIGA, Inc. erreichbar? (Tip: Es gibt  
                zwei Antwortm&ouml;glichkeiten!)

Antwort: Beide Adressen waren der letzen AMIGA-aktuell-Ausgabe zu           
         entnehmen: <a href="http://www.amigainc.com">http://www.amigainc.com</a> und <a href="http://www.amiga.com.">http://www.amiga.com.</a>       
         Die URL <a href="http://www.amiga.de">http://www.amiga.de</a> ist &uuml;brigens nicht richtig, da dies    
         die Adresse von AMIGA International, Inc., verantwortlich f&uuml;r      
         Vertrieb und Marketing, ist.
                

Master-Frage: Wie viele Sockel f&uuml;r PS/2-RAM-Module sind auf der Original-   
              A3000/4000-040-Karte (A3640) von Commodore vorhanden?

Antwort: Da hatte sich Commodore seinerzeit ein &quot;Meisterst&uuml;ck&quot; geleistet...  
         Auf der Karte gibt es &uuml;berhaupt keine Steckpl&auml;tze zur              
         Speicheraufr&uuml;stung (auf dem Standard-EC030-Board &uuml;brigens auch     
         nicht), womit lediglich die RAM-Pl&auml;tze auf dem Mainboard           
         &uuml;brigbleiben, was sich beim Speicherzugriff sehr negativ bemerkbar  
         macht. 
         Tip f&uuml;r alle Nutzer eines solchen Produkts: Prozessorkarte mit     
         RAM-Option onboard kaufen!

             
Meinungsfrage: Wie beurteilst Du die von AMIGA, Inc. bislang verk&uuml;ndeten    
               Hard- und Software-Entscheidungen?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------

1 (Ich bin sehr zufrieden mit den Entscheidungen.)                        2
2 (Ich bin im gro&szlig;en und ganzen einverstanden.)                          18
3 (Ich bin eher unzufrieden mit den Entscheidungen.)                     10
4 (Ich bin &uuml;berhaupt nicht einverstanden.)                                6

Des weiteren sahen sich zwei Teilnehmer gezwungen, mit &quot;2-3&quot; zu antworten.

Fazit:
------

Zwar gibt es eine Mehrheit f&uuml;r die Pl&auml;ne von AMIGA, Inc., diese f&auml;llt 
jedoch knapper aus, als es der AMIGA-Entwicklungsabteilung lieb sein kann. 
In den n&auml;chsten Wochen und Monaten mu&szlig; es deren Aufgabe sein, die Vorhaben 
n&auml;her zu erl&auml;utern, um die Skeptiker doch noch zu &uuml;berzeugen. Diese lassen 
sich &uuml;berwiegend in zwei Gruppen einteilen:
Die einen haben sich l&auml;ngst auf den PowerPC als zuk&uuml;nftigen AMIGA-Prozessor 
eingestellt und teilweise bereits eine PowerUp-Karte gekauft, oder aber 
trauen Phase 5 und Haage &amp; Partner mehr zu als AMIGA, Inc. Auch angesichts 
der Tatsache, da&szlig; AMIGA, Inc. vor einigen Monaten ausdr&uuml;cklich 68k und 
PowerPC als &Uuml;bergangsl&ouml;sung festschrieben - und nicht den Industriestandard 
- sehen sich diese Anwender nun von der AMIGA-Entwicklungsabteilung oder 
dem Mutterkonzern Gateway betrogen bzw. verraten.
Da&szlig; Phase 5 und Haage &amp; Partner bei vielen Anwendern eine Art 
&quot;Vertrauensbonus&quot; besitzen, ist nicht verwunderlich. Hier mu&szlig; AMIGA, Inc. 
zeigen, ob sich dies in den n&auml;chsten Monaten wettmachen l&auml;&szlig;t.

Die Anh&auml;nger der zweiten Gruppe gehen schlichtweg davon aus, da&szlig; die Pl&auml;ne 
der Entwicklungsabteilung von der technischen Realisation bzw. vom Zeitplan 
her nicht zu bew&auml;ltigen sind. Da&szlig; die Roadmap von AMIGA, Inc. in beiderlei 
Hinsicht gewagt ist, liegt auf der Hand - schlie&szlig;lich soll der neue AMIGA 
eine Technologie beinhalten, die heute noch nicht existiert. Da&szlig; so eine 
Strategie jedoch schon einmal hervorragend funktioniert hat, zeigt die 
Geschichte unseres Computersystems selbst. Der 1984 vorgestellte A1000 war 
seinerzeit &auml;hnlich (r)evolution&auml;r, und das, obwohl er einen bereits f&uuml;nf 
Jahre auf dem Markt befindlichen Prozessor, den 68000 n&auml;mlich, enthielt. 
Die Customchips aber boten eine in dieser Preisklasse bis dato nicht f&uuml;r 
m&ouml;glich gehaltene Leistung.
Warum sollte eine technisch derart weitgehende Neuentwicklung heute nicht 
mehr m&ouml;glich sein??? Sind wir etwa schon soweit, da&szlig; wir Standard-
Technologien, da beziehe ich den PowerPC ausdr&uuml;cklich mit ein, f&uuml;r das 
Nonplusultra halten?
Wenn die bislang an die &Ouml;ffentlichkeit gedrungenen Spezifkationen des 
geplanten '99er-Systems so verwirklicht w&uuml;rden, bedeutete dies einen 
gr&ouml;&szlig;eren Schritt als vom C64 zum AMIGA oder auch vom CISC- oder RISC-
Prozessor.

Kritiker der Entscheidungen von AMIGA, Inc. argumentieren gern damit, da&szlig; 
die erhoffte Leistung (f&uuml;nf- bis zehnfache Geschwindigkeit eines PentiumII-
Systems) Ende 1999 auch von anderen Prozessoren erreicht w&uuml;rde. Das ist 
richtig und gilt f&uuml;r Computer, bei denen allein der Prozessor einige 
Tausend Mark kostet - aber nicht im Consumer-Bereich. Die letzten Jahre 
haben gezeigt, da&szlig; sich die durchschnittliche Leistung fabrikneuer 
Standard-PCs innerhalb von zwei Jahren lediglich etwa verdoppelt, maximal 
verdreifacht. Es gibt keinerlei Anzeichen, da&szlig; diese Gesetzm&auml;&szlig;igkeit in den 
n&auml;chsten Jahren nicht mehr gelten wird.

Ganz sicher kann niemand von uns die technische oder zeitliche 
Realisierbarkeit exakt beurteilen, da wir nicht wissen, was in den 
Schubladen bestimmter Entwicklerlabors schlummert. Ich m&ouml;chte aber davor 
warnen, Gateway oder AMIGA, Inc. zu untersch&auml;tzen oder gar fest damit zu 
rechnen, da&szlig; die derzeitigen Pl&auml;ne nochmals umgesto&szlig;en werden k&ouml;nnten.

Auf mich pers&ouml;nlich zumindest machen die Mitarbeiter der 
Entwicklungsabteilung einen fest entschlossenen Eindruck, als seien sie 
sich ihrer Sache hundertprozentig gewi&szlig; - insbesondere der hochgesch&auml;tzte 
Dr. Allan Havemose, bei AMIGA, Inc. verantwortlich f&uuml;r die 
Softwareentwicklung, der &uuml;brigens w&auml;hrend seiner Commodore-Zeit an den 
AMIGA-Betriebssystemversionen 2.1 bis 3.1 mitarbeitete und dem wir unter 
anderem das Datatypes-Konzept zu verdanken haben.
Die Korrekturen dagegen, die AMIGA, Inc. auf Dr&auml;ngen von Phase 5 und 
anderen Firmen in Richtung PowerPC unternommen hat, scheinen mir nichts 
weiter als Zugest&auml;ndnisse zu sein - um auch die User anzusprechen, die bei 
der Meinungsfrage mit &quot;3&quot; oder &quot;4&quot; geantwortet haben bzw. h&auml;tten.

Apropos Phase 5: Den einen oder anderen &uuml;berraschen wird vielleicht, da&szlig; 
Gesch&auml;ftsf&uuml;hrer Wolf Dietrich die Hard- und Softwarepl&auml;ne f&uuml;r die '99er-
AMIGA-Generation ausdr&uuml;cklich begr&uuml;&szlig;t hat. Das l&auml;&szlig;t darauf schlie&szlig;en, da&szlig; 
es wohl nicht zu einer Spaltung des AMIGA-Marktes kommen wird - wollen wir 
es hoffen.

Wo wir schon bei AMIGA-VIPs sind: Carl Sassenrath, der &quot;Vater&quot; des AMIGA 
OS, hat in den vergangenen Wochen keinen Hehl daraus gemacht, da&szlig; er von 
den Pl&auml;nen der AMIGA-Entwicklungsabteilung geradezu begeistert ist. Die 
neue AMIGA-Generation wird seinen Worten zufolge so ankommen: &quot;It will be 
fun to again see the Amiga blow the socks off everything else thats out 
there.&quot;, auf deutsch in etwa: &quot;Es wird Spa&szlig; machen, anzusehen, wie der 
AMIGA erneut allem, was es da drau&szlig;en so gibt, die Socken ausziehen wird.&quot; 
Und Sassenrath wird es wohl wissen m&uuml;ssen, denn seinen Angaben nach hat er 
sowohl die Pl&auml;ne zum technischen Design als auch einen fr&uuml;hen Prototyp der 
neuen Hardware-Architektur sehen d&uuml;rfen.

Ich sch&auml;tze, in einem Punkt werden sich Bef&uuml;rworter wie Kritiker der Pl&auml;ne 
einig sein: Wir sind gespannt, was uns erwartet!


Nun aber zu den Preistr&auml;gern des letzten Gewinnspiels:


1 x Vollversion von &quot;ManiacBall&quot;: Stefan Schulze
1 x Vollversion von &quot;CDCat&quot;: Stephan Rupprecht
1 x Warengutschein von Ferst Computer: Mark Harbarth
1 x Festplatten-Software &quot;Ami-FileSafe Pro&quot;: David Sondermann


Herzlichen Gl&uuml;ckwunsch!


Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm AFiloFaxPro f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&laquo;AFiloFaxPro managet Ihr t&auml;gliches Leben. Dazu bietet es eine umfangreiche 
Terminplanerfunktion und dar&uuml;ber hinaus Features wie einen elektronischen 
Notizblock oder Statistikfunktionen, die u.a. die t&auml;gliche Computerlaufzeit 
protokollieren. (Unterst&uuml;tzt MUI)&raquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.

Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Peter Elzner hat sein Programm Diamond Caves II f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&ouml;hle m&uuml;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&uuml;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&uuml;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
&#009;&#009;            schneller Prozessor empfohlen, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&auml;nkt
Registrierte Version: 40 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)


Stephan Rupprecht hat sein Programm PrintManager f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;PrintManager ist ein Programm, das die Arbeit mit einem Drucker flexibler 
und kontrollierbarer macht. Es kann Daten, die ein Programm an den Drucker 
schickt, zun&auml;chst in einer Datei speichern. So wird ein Anwenderprogramm 
nicht durch den langsameren Drucker aufgehalten. Je nach Wunsch kann der 
PrintManager die gespeicherten Daten anschlie&szlig;end ausdrucken oder sie  
zun&auml;chst auf Diskette belassen, um sie sp&auml;ter in einem Rutsch auszudrucken.  
Des weiteren bietet Ihnen der PrintManager die M&ouml;glichkeit, &uuml;ber das 
Datatypes-System, Dateien beliebigen Formats auszudrucken (dies setzt 
nat&uuml;rlich einen entsprechenden Datatype f&uuml;r das jeweilige Format voraus).

Die Sharewaregeb&uuml;hr betr&auml;gt DM 15,- bzw. DM 20,- bei Postversand, die 
Demoversion ist im Aminet unter text/print/prtman39.lha zu finden.

Adresse des Autors:

Stephan Rupprecht
Apfeldweg 1
44359 Dortmund

E-Mail:

<a href="mailto:stephan.rupprecht@metronet.de">stephan.rupprecht@metronet.de</a>&laquo;


Des weiteren hat Thomas Hasemann die Animationssoftware &quot;MainActor 
Broadcast&quot; zur Verf&uuml;gung gestellt.


Vielen Dank an alle Preisstifter!


Aufruf an alle innovativen Programmierer und AMIGA-Firmen:

Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
Online-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere 
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt. 
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser 
bekanntzumachen.
       

Hier die neuen Fragen (nur ZWEI davon m&uuml;ssen beantwortet werden):


Standard-Frage: Wie hei&szlig;t der Hersteller des bekannten Raytracers Cinema4D?
                

Master-Frage: Welche maximale Taktfrequenz empfiehlt Motorola f&uuml;r die im    
              A1200 enthaltene Version des Prozessors vom Typ 68EC020?

             
Meinungsfrage: Erwartest Du, da&szlig; der von Amiga, Inc. ank&uuml;ndigte Br&uuml;cken-
Computer f&uuml;r Entwickler p&uuml;nktlich, d.h. Ende dieses Jahres erscheinen wird?


M&ouml;gliche Antworten: 
           
1: Ja, auf jeden Fall.
2: Ja, wahrscheinlich.
3: Nein, wahrscheinlich nicht.
4: Nein, auf keinen Fall.

Es gen&uuml;gt, die Nummer anzugeben.


Unter allen Teilnehmern, die mindestens ZWEI dieser Fragen bis zum 25. 
Juli (Einsendeschlu&szlig;) beantworten (die Wissensfrage[n] nat&uuml;rlich 
richtig), werden die folgenden Gewinne verlost:


1 x Vollversion von &quot;Diamond Caves II&quot; (Wert: DM 40,-)
1 x Vollversion von &quot;AFiloFaxPro&quot; (Wert: DM 25,-)
1 x Vollversion von &quot;PrintManager&quot; (Wert: DM 15,-/20,-)
1 x Animationssoftware &quot;MainActor Broadcast&quot; (Wert: nach Ermessen)

Wer alle drei Fragen beantwortet (die Wissensfragen m&uuml;ssen nat&uuml;rlich 
richtig sein), nimmt mit ZWEI Stimmen an der Verlosung teil und hat somit 
die doppelte Chance auf einen Preis.


Schickt Eure Antworten bitte bis zum 25. Juli an folgende Adresse:

Carsten Schr&ouml;der
Helmoltstra&szlig;e 10
37081 G&ouml;ttingen
Deutschland

oder per E-Mail an:

<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Bitte verge&szlig;t nicht, Eure Post-Anschrift anzugeben, und ggf. den 
bevorzugten Preis. Eine Garantie, da&szlig; Ihr im Gewinnfall dann auch genau 
diesen Preis erhaltet, kann nat&uuml;rlich nicht gegeben werden.
</pre>
</body>
</html>
