<html>
<head>
  <title>Geh&ouml;rt - notiert</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses15.html">PREV</a> | <a href="geruechte.html">NEXT</a>
<hr>
<pre>

Geh&ouml;rt - notiert
----------------

AMIGA-Meldungen
---------------

* Endlich gibt es einen RealAudio-Decoder f&uuml;r den AMIGA! Die notwendigen
  Dateien k&ouml;nnen auf <a href="http://csc.smsu.edu/~strauser/RA.html">http://csc.smsu.edu/~strauser/RA.html</a> heruntergeladen
  werden.

* F&uuml;r die Nutzer der bekannten Tabellenkalkulation TurboCalc gibt es doch   
  noch Hoffnung: Gegen&uuml;ber AMIGA aktuell stellte Autor Michael Friedrich    
  klar, da&szlig; er jetzt einen &quot;richtigen&quot; Job habe und im Moment ziemlich      
  besch&auml;ftigt sei. Dies bedeute jedoch nicht die generelle Einstellung von  
  TurboCalc, wobei jedoch derzeit auch noch nichts Konkretes geplant sei.

* Das AMIGA Magazin hat eine neue Homepage: <a href="http://www.amiga-magazin.de/">http://www.amiga-magazin.de/</a>

* Die August-Ausgabe der Zeitschrift AMIGA Plus wird zus&auml;tzlich zur         
  Heftdiskette eine CD-ROM enthalten, auf der sich die Vollversion des      
  Raytracers Cinema4D befindet. Der Verkaufspreis des Hefts erh&ouml;ht sich     
  dadurch auf 19,80 Mark.

* Blittersoft hat die Preise f&uuml;r den PC-Emulator PCx und den Mac-Emulator   
  Fusion auf je 29,95 britische Pfund (etwa 90 Mark) gesenkt. Ein Set,      
  bestehend aus beiden Programmen, gibt es f&uuml;r 49,95 Pfund (etwa 150 Mark).  
  &Uuml;brigens ist geplant, f&uuml;r Fusion ein Upgrade-Angebot auf die in           
  Entwicklung befindliche PowerPC-Version anzubieten.

* Laut Gilles Bourdin, zu Zeiten von AMIGA Technologies Pressesprecher des  
  Unternehmens, wurden w&auml;hrend der Escom-Zeit etwa 80.000 A1200 gefertigt,  
  von denen nur 50.000 h&auml;tten abgesetzt werden k&ouml;nnen, exakt die Menge, die  
  Petro Tyschtschenko, damals Pr&auml;sident von AMIGA Technologies,             
  vorgeschlagen habe. Manfred Schmitt, ehemals Chef der Escom AG, sei       
  dagegen daf&uuml;r gewesen, 120.000 A1200 zu produzieren.

* Die Zeitschrift PC-Welt hat in ihrer letzten Ausgabe &uuml;ber die AMIGA-      
  Emulations-CD-ROM &quot;AMIGA Forever&quot; berichtet.


Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)
----------------------------------------------------------

* Das PowerPC-Chipdesign-Center in Austin, das Motorola und IBM seit 1992   
  gemeinsam betrieben haben, untersteht ab sofort ausschlie&szlig;lich Motorola.  
  Dies k&ouml;nnte ein weiteres Zeichen daf&uuml;r sein, da&szlig; der PowerPC, ehemals ein  
  Hoffnungstr&auml;ger der Anti-Wintel-Welt, an Unterst&uuml;tzung verliert.
</pre>
</body>
</html>
