<html>
<head>
  <title>Spiele</title>
  <meta name="Generator" content="GuideML V1.6">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="spiele5.html">PREV</a> | <a href="spiele7.html">NEXT</a>
<hr>
<pre>

6. Review: Genetic Species
--------------------------

<a href="geneticspecies1.png">Screenshot</a> (ab OS 3.0; PNG-Datatype mu&szlig; installiert sein)

Eines der von vielen am meisten herbeigesehnten Spiele ist endlich
erschienen: Genetic Species. Doch kann das Spiel die Vorschu&szlig;lorbeeren,
die durch hervorragende Demoversionen verteilt wurden, rechtfertigen.
Dieser Test wird es zeigen.
Wie bei Vulcan Software gewohnt, kommt auch dieser Titel nur in einem
Jewel Case ohne Pappkarton und ohne gedruckte Anleitung. Eine mittelm&auml;&szlig;ige
aber wenigstens deutschsprachige Anleitung befindet sich als .txt und
.html-Datei auf der CD-ROM.
Nach dem Starten des Programms (eine Installation ist nicht n&ouml;tig, das
Spiel l&auml;uft komplett von CD), kann man die aufwendige Intro-Sequenz
bewundern, die knapp 200 MB gro&szlig; und komplett gerendert ist. Das Intro
l&auml;uft &uuml;brigens ungl&uuml;cklicherweise nicht auf AMIGAs mit Grafikkarten, da
der Player f&uuml;r das Animationsformat noch nicht f&uuml;r Grafikarten umgesetzt
sein soll.
Ist der Spieler im Hauptmen&uuml; angekommen, wird er von sehr vielen
Einstellungsm&ouml;glichkeiten empfangen. Hier k&ouml;nnen Einstellungen an Grafik,
Sound, Steuerung und einiges mehr vorgenommen werden.
Genetic Species spielt im 22. Jahrhundert. Der Spieler steuert mittels
Tastatur, Joystick oder CD32-Gamepad einen &quot;K&ouml;rperwechsler&quot;, einen Roboter,
der mittels elektronischer Implementation in K&ouml;rper von Menschen, Cyborgs
und Droiden schl&uuml;pfen kann. Mit Hilfe dieser M&ouml;glichkeit und 15
verschiedenen Waffen macht der Spieler sich nun auf den Weg durch 4 Level,
die aus jeweils 4 bis 5 einzelnen Abschnitten bestehen. Auf diesem Weg
begegnen dem K&ouml;rperwechsler viele verschiedene Feinde, die auch verschieden
intelligent und gef&auml;hrlich sind. Die ersten der 16 Arten von Feinden sind
z.B. die &quot;Wachdiensthabenden&quot;, die einen leichten Panzer tragen, jedoch
nicht sehr gut gegen den Angriff des K&ouml;rperwechslers gesch&uuml;tzt sind. Sp&auml;ter
bekommt der Spieler es dann noch mit Feinden wie Cyber Scouts, Face Hugger,
Zombies, Gel Men oder Mechanoids zu tun. Besonders interessant ist w&auml;hrend
des Spiels die schon erw&auml;hnte M&ouml;glichkeit, Feinde zu bet&auml;uben, und in deren
K&ouml;rper zu schl&uuml;pfen. Ineinigen Missionen ist es sogar lebenswichtig, in
andere K&ouml;rper zu schl&uuml;pfen um beispielsweise als Techniker bestimmte
Machinen zu benutzen oder als Wissenschaftler Zugang zu Labors zu bekommen.
Bemerkenswert ist auch die k&uuml;nstliche Intelligenz der Feinde. So kann es
schon vorkommen, da&szlig; Feinde Helfer holen, wenn sie merken, da&szlig; sie nicht
gegen den K&ouml;rperwechsler ankommen oder einfach weglaufen. Verh&auml;lt sich der
Spieler ruhig, bemerken einige Feinde ihn gar nicht erst.
Ebenfalls interessant ist die Option, das Portable Probe Device
loszuschicken. So kann der Spieler f&uuml;r f&uuml;nf Sekunden eine kleine Kamera
steuern und schon vorher sehen, was in R&auml;umen passiert, bevor er seinen
K&ouml;rperwechsler dort hin steuert.
Die Grafik von Genetic Species ist gut gelungen und f&uuml;r die Farbanzahl und
Detaildichte &uuml;berraschend schnell. Hervorragende Lichteffekte, komplett
texturierte Level und gigantische Explosionen machen Genetic Species auch
f&uuml;r das Auge zu einem Vergn&uuml;gen.
Selbst auf 68030-AMIGAs ohne Grafikkarte l&auml;&szlig;t sich Genetic Species sehr gut
spielen. Grafikkarten werden mittels RTGmaster-Library unterst&uuml;tzt und der
Sound l&auml;uft &uuml;ber AHI. Zus&auml;tzlich kommen einige Audiotracks direkt von CD.
Diese recht atmosph&auml;rische Musik wird auf den ersten Kopien des Spiels
leider st&auml;ndig von einem nervenden Knacken unterbrochen. Neuere Pressungen
sollen diese Fehler aber nicht mehr beinhalten.
N&uuml;tzlich ist die Automap-Funktion, die einen &Uuml;berblick &uuml;ber das aktuelle
Level gibt und den Spieler schneller zum Ziel f&uuml;hrt.
Alles in allem ist Genetic Species ein excellenter 3D-Shooter, der perfekt
auf AMIGA-Verh&auml;ltnisse angepasst ist und besonders durch intelligente
Funktionen wie das Wechseln des K&ouml;rpers &uuml;berzeugen kann. 
F&uuml;r Fans des Spiels, die Genetic Species komplett durchgespielt haben, wird
in einiger Zeit der Genetic Species World Creator erscheinen, der jedem
K&auml;ufer die Erstellung eigener Level erm&ouml;glichen wird.
&Uuml;ber die Homepage von Vulcan Software sind mittlerweile zwei Patches
erh&auml;ltlich, die einige Bugs fixen und die endg&uuml;ltigen Sprachdateien
enth&auml;lt. Weitere Patches mit RTG-Workbench-Windows-Support, AHI Surround
Sound, TCP/IP-Support und 16 &amp; 24-Bit-Distance-Shading f&uuml;r Grafikkarten
sollen folgen.

<a href="geneticspecies2.jpg">Screenshot</a> (ab OS 3.0; JFIF/JPG-Datatype mu&szlig; installiert sein)

+-------------------------------------------------------------------------+
|  Name:          Genetic Species                                         |
|  Hersteller:    Vulcan Software, 72 Queens Road, Buckland, Portsmouth,  |
|                 Hants, PO27NA, England, Tel.: +44 (0) 1705 670269,      |
|                 E-Mail: <a href="mailto:Paul@vul-soft.demon.co.uk">Paul@vul-soft.demon.co.uk</a>                       |
|  Preis:         79 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         3D-Action              | Spieler: 1                     |
|  Sprache:       deutsch, englisch,...  | Anleitung: deutsch, englisch,..|
|  System:        mind. AGA oder Grafikkarte, OS 3.0., 8 MB RAM, Fest-    |
|                 platte und CD-ROM-Laufwerk                              |
|  Fazit:         sehr guter 3D-Shooter, der sich durch neue Features wie |
|                 das Wechseln des K&ouml;rpers und durch technische           |
|                 Ausgereiftheit auszeichnet.                             |
|  Wertung:                                                               |
|                             Grafik:     9/10                            |
|                             Sound:      7/10                            |
|                             Handhabung: 9/10                            |
|                             Spielspa&szlig;:  9/10                            |
|                             GESAMT:      88%     AMIGA AGPJ AWARD       |
+-------------------------------------------------------------------------+

---------------------------------------------------------------------------


Review: Virtual Karting 2
-------------------------

Ebenfalls im Juni erschienen ist das neue Rennspiel Virtual Karting 2. Der
Vorg&auml;nger dieses Titels, Virtual Karting war seinerzeit umstritten, einige
Teile der Presse schrieben Verrisse, andere Teile lobten das Spiel. Doch
wie sieht der zweite Teil des Rennspiels aus. Hat sich viel ge&auml;ndert ? Das
erfahrt Ihr, wenn Ihr weiterlest.
Das Spiel kommt in einer Epic-&uuml;blichen Pappschachtel daher, in der die CD
bzw. die Disketten, sowie eine deutschsprachige Anleitung liegen. Nach
Starten des Spiels (Direkter Start von CD ist m&ouml;glich) sieht der Spieler
das Titelbild und das Hauptmen&uuml;. Dort kann er zuerst im Options-Men&uuml; einige
Einstellungen vornehmen. Die Steuerung l&auml;&szlig;t sich zwischen Joystick und Maus
&auml;ndern, man kann die Schaltung zwischen manueller Schaltung und Automatik
wechseln und die Pixelgr&ouml;&szlig;e l&auml;&szlig;t sich zwischen 2x1 und 2x2 ver&auml;ndern.
Leider gibt es keine 1x1-Option, so da&szlig; die Grafik w&auml;hrend des Spiels recht
grobpixelig aussieht. Auf der anderen Seite wird durch diese Modi erreicht,
da&szlig; das Spiel auch auf unaufger&uuml;steten AMIGAs in hoher Geschwindigkeit
l&auml;uft. Zur&uuml;ck im Hauptmen&uuml; kann vor Start des Rennens noch zwischen 80ccm-
und 125ccm-Kart gew&auml;hlt werden. Den 80ccm-Modus h&auml;tte man jedoch weglassen
k&ouml;nnen, da die gegnerischen Karts dieselbe Geschwindigkeit wie in 125ccm-
Rennen erreichen, so da&szlig; der Spieler selbst in perfekten Rennen ohne Fehler
nicht gewinnen kann. Da auch die ablaufende Zeit keinen Unterschied
zwischen 80ccm- und 125ccm-Rennen macht, kommt man auch gar nicht erst ins
Ziel. Der 125ccm-Modus ist zum Gl&uuml;ck etwas fairer. Hier lassen sich sogar
ein paar gegner &uuml;berholen und Rennen gewinnen. Doch was passiert nach einem
solchen Sieg. Nein: Kein h&uuml;bsches Siegerbild, das die Pause bis zum
n&auml;chsten Rennen verk&uuml;rzt. Der Spieler gelangt zur&uuml;ck ins Hauptmen&uuml;, von wo
aus er sich eine weitere der sechs Strecken ausw&auml;hlen kann. Ein
Championship- oder Liga-Modus h&auml;tte der Langzeitmotivation des Spiels
sicher gutgetan, so hat man sehr schnell keinen Spa&szlig; mehr, die wenigen
Strecken zu befahren.
Die Unterschiede zum Vorg&auml;ngerspiel sind sehr gering. Nennen mu&szlig; man hier
lediglich die Erh&ouml;hung der Streckenzahl von drei auf sechs, der
zus&auml;tzliche Screenmode 2x1 und die eher kosmetischen Features von
Reflexionen im Wasser und Objekten an der Fahrbahn. Weiterhin wurde der
angeblich nervende Kopierschutz des Vorg&auml;ngers weggelassen.
Diejenigen, die dieser Testbericht noch nicht abgeschreckt hat, k&ouml;nnen
sich im Aminet eine Demoversion des Spiels herunterladen. Mein Fazit
lautet zumindest, da&szlig; Virtual Karting 2 f&uuml;r ein Volpreisspiel zu wenig
bietet. Eine Ver&ouml;ffentlichung als Data Disk f&uuml;r Virtual Karting zu einem
geringeren Preis w&auml;re sicher sinnvoller gewesen.

+-------------------------------------------------------------------------+
|  Name:          Virtual Karting 2                                       |
|  Hersteller:    epic marketing, Hirschauer Stra&szlig;e 9, 72070 T&uuml;bingen,    |
|                 Tel.: 07071/400492, E-Mail: <a href="mailto:epic@swol.de">epic@swol.de</a>                |
|  Preis:         59 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Rennspiel              | Spieler: 1                     |
|  Sprache:       englisch               | Anleitung: deutsch             |
|  System:        mind. AGA                                               |
|  Fazit:         mittelm&auml;&szlig;iges Rennspiel, da&szlig; nur wenig Neues bietet und |
|                 das Dank fehlendem Championship-Modus keine gro&szlig;e       |
|                 Langzeitmotivation bietet.                              |
|  Wertung:                                                               |
|                             Grafik:     7/10                            |
|                             Sound:      5/10                            |
|                             Handhabung: 6/10                            |
|                             Spielspa&szlig;:  5/10                            |
|                             GESAMT:     57 %                            |
+-------------------------------------------------------------------------+
</pre>
</body>
</html>
