<html>
<head>
<META NAME="description" content="Metal Corner-Das Internet Heavy Metal Magazin mit CD Reviews, Konzertberichten, Tourdaten und vielem mehr in HTML.">
<META NAME="author" CONTENT="Kilian Servais">
<META NAME="keywords" CONTENT="Powerplant, Metal, Metalmusik, Metalcorner, Radio, Heavy, Kilian, Servais, melodic, power, trash, rock, hard, heavy, herne, bürgerfunk, lokal">
<title>Newsflash</title>
</head>

<body background="mcback.gif" text="#ffffff" link="#ffffff" alink="#ff00ff" vlink="#ffff00">
<p><h1><center><font color="red">Newsflash</font></center></h1></P><ul>


<p><li> Die bisher absolut unterbewerteten Melodic Power Metaller von <b>At Vance</B> haben - nachdem sie mit ihrem alten Label nicht mehr zufrieden waren - beim renomierten deutschen Label AFM Records unterschieben. Bereits im Oktober soll der neue Longplayer &quot;Only Human&quot; in den Plattenl&#228;den stehen. Wenn man bedenkt, da&#223; erst im Fr&#252;hjahr das letzte regul&#228;re Studioalbum &quot;Dragonchaser&quot; erschien, eine absolut beeindruckende Leistung!</LI></P>

<p><li> Nach dem umjubelten Auftritt der NWOBHM Legende <b>Angel Witch</B> auf dem letztj&#228;hrigen Wacken Open Air, hat die Band nun ein neues Studioalbum im Kasten. Eine Plattenfirma wird aber noch h&#228;nderingend gesucht. Bleibt zu hoffen, da&#223; die Jungs bald f&#252;ndig werden.</LI></P>

<p><li><b> Thoughtsphere</B> - die mit &quot;Vague Horizons&quot; im letzten Jahr eines der st&#228;rksten Prog. Metal Alben ablieferten und f&#252;r mich pers&#246;nlich mit zu den besten Newcomern des Jahres geh&#246;rten - haben die Arbeiten f&#252;r den n&#228;chsten Streich abgeschlossen und lassen das Resultat im September auf uns los. Wenn das Niveau des Vorg&#228;ngers gehalten werden kann, dann steht uns hier erneut ein absoluter Knaller in`s Haus.</LI></P>

<p><li> Nachdem man den ehemaligen Virgin Steele Gitarristen <b>Jack Starr</B> schon lange nicht mehr auf der Rechung hatte, ist er nun mit einer neuen Band zur&#252;ck: <b>Guardians Of The Flame</B> (benannt nach dem zweiten Virgin Steele Album) nennt sich das ganze und neben ihm wird auch noch sein ehemaliger Virgin Steele Kumpel Joe Oreilley (Bass) sowie Chris Collins (Vocals) - seines Zeichens Original Shouter bei Dream Theater - verpflichten. Die ersten Songs sollen bereits stehen und man darf echt gespannt sein, was die Jungs uns da zusammenschustern werden.</LI></P>

<p><li> Einige Fragezeichen stehen momentan &#252;ber dem <b>W.A.S.P.</B> Line-up: Nachdem sich Mainmann Blackie Lawless zun&#228;chst von seinem langj&#228;hrigen Partner Chris Holmes getrennt hat (als m&#246;glicher Grund wird der &#252;berm&#228;&#223;ige Alkoholkonsum von letzteren gehandelt) und diesen durch Darell Roberts (u.a. Tuff) ersetzte, will er diesen Vorgang nun wieder r&#252;ckg&#228;ngig machen. Der einfache Grund: Ein unbekannter Gitarrist passt einfach nicht zu W.A.S.P. ! W&#228;re ja auch 
nicht das erste mal, da&#223; Chris Holmes f&#252;r einige Monate ausgestiegen w&#228;re, um danach das Line-up wieder zu bereichern....</LI></P>

<p><li> Bei <b>Angel Dust</B> steht auch ein kleinerer Line-up Wechsel an: Gitarrist Bernd Aufermann verl&#228;sst die Band und wird auf der laufenden US Tour durch Ritchie Wilkinson (u.a. Demons &amp; Wizards Tourklampfer) ersetzt. Ob dieser permanent bei den Ruhrpott Metallern einsteigt, ist bisher noch nicht so ganz klar.</LI></P>

<p><li> Zuwachs k&#246;nnen die Power Metaller von <b>Custard</B> vermelden, die im letzten Jahr mit &quot;For My King&quot; ein excellentes Album ablieferten: Als sechstes offizielles Mitglied wird Ron Michael (Keys) fungieren, der die Band schon bei diversen Live Gigs unterst&#252;tzt hatte. F&#252;r diesen Sommer stehen f&#252;r Custard zudem diverse Festivals an, die hoffentlich positiv verlaufen.</LI></P>

<p><li> Aus rechtlichen Gr&#252;nden mussten sich die Speed Metal Pioniere <b>Agent Steel</B> vorl&#228;ufig in Order Of The Illuminati umbennen, da es derzeit einige Schwierigkeit mit dem Namen Agent Steel gibt, die Band aber bis zur endg&#252;ltigen Kl&#228;rung (die wohl vor Gericht stattfinden wird) gerne weiterhin Platten ver&#246;ffentlichen w&#252;rde. </LI></P>

<p><li> Trotz diverser Schwierigkeiten mit dem Line-up wollen <b>Metalium</B> im Oktober mit einer neuen Langrille am Start sein. Gitarrist Jack Frost d&#252;rfte dabei allerdings nicht mehr mit von der Partie sein, ist er doch gerade erst bei Savatage eingestiegen, die bekanntlich in einer ganz anderen Liga spielen als Metalium. Erstaunlich ist es trotzdem, da&#223; Metalium - trotz Headliner Tour und anderer wiedriger Umst&#228;nde - f&#252;r den dritten Streich erneut nur ein Jahr gebraucht haben. Und sp&#228;testens dann wissen wir, wer der neue Gitarrits im Line-up sein wird....</LI></P>

<p><li> Fans von <b>Deep Purple</B> d&#252;rfen schon jetzt anfangen zu spaaren: Neben einer DVD, die mit &quot;Reunion Compilation&quot; betitelt wurde und Live Eindr&#252;cke aus den Jahren 1984 bis 2001 enth&#228;lt, erscheint auch noch der zweite Teil der &quot;Bootlegs&quot; Box. K&#246;nnte ein ziemlich teures Unterfangen werden, zumal die Dinger bestimmt nicht zum &quot;Nice Price&quot; angeboten werden.</LI></P>

<p><li><b> Queensryche</B> scheinen doch nochmal vern&#252;nftig zu werden: Die US Sommerdates sollen f&#252;r ein Live Album mitgeschnitten werden. Soweit nichts ungew&#246;hnliches, h&#228;tten die Jungs nicht angek&#252;ndigt extra daf&#252;r eine staatliche Anzahl an alten Tracks auszubuddeln, die man schon seit Ewigkeiten nicht mehr Live gespielt hat.</LI></P>

<p><li> Das <b>Symphony X</B> Live Album, welches eigentlich schon vor einer ganzen Weile erscheinen sollte, wurde mal wieder nach hinten verschoben und erfreut uns wohl jetzt erst fr&#252;hestens im September. Allerdings frage ich mich immer noch, was so schwierig daran ist, ein stinknormales Live Album auf den Markt zu bringen....</LI></P>

<p><li> Wer bei den zahlreichen <b>Dream Theater</B> Sideprojekten noch den &#220;berblick hat, der muss schon ein echt gutes Ged&#228;chtniss haben. Das es sich aber nicht unbedingt immer um einmalige Aktionen gehandelt hat beweist die Tatsache, da&#223; uns im August die zweite Mullmuzzler CD von S&#228;nger James LaBrie erfreuen soll. Und dann w&#228;re da ja auch noch die europ&#228;ische Version der Dream Theater DVD, die uns im September dann endlich erreichen soll, obwohl sich alle Fans der Band wohl ohnehin schon die korrekt synchronisierte US Version zugelegt haben. </LI></P>



</P><a href="metalcorner.html#top">Zurück zur Hauptseite</A></P>
</body>
</html>
