<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Cord Hagen -->

    <TITLE>einige Neuigkeiten</TITLE>
  </HEAD>

  <BODY background="bg_cord1.jpg" text="#fffff0" bgcolor="#000000">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Textformatierung mit Rand">
      <TR>
        <TD>
          <H1 align="center"><FONT color=
          "#ffff00"><B>www.BLINDzeln.de<BR>
           - jetzt k&ouml;nnen die BLINDzler
          chatten</B></FONT></H1>

          <P>Liebe BLINDzlerinnen und BLINDzler,</P>

          <P>es gibt wieder einige Neuigkeiten zu verk&uuml;nden
          und ich m&ouml;chte Euch bitten, Euch einige Minuten Zeit
          f&uuml;r diese Nachricht zu nehmen.</P>

          <P>Wie hoffentlich die Meisten unter Euch wissen, haben
          wir noch sehr viel mit BLINDzeln vor. BLINDzeln will
          weitaus mehr, als nur seinen BLINDzlern ein paar
          thematisch sortierte Mailinglisten vor die F&uuml;sse zu
          werfen. Wir hatten in den letzten Wochen sehr viel damit
          zutun, alle technischen Vorraussetzungen daf&uuml;r zu
          schaffen, damit wir in der Anzahl der BLINDzler, aber
          auch mit den M&ouml;glichkeiten und Services f&uuml;r die
          BLINDzler in weiterer Zukunft nicht an Grenzen
          sto&szlig;en m&uuml;ssen. Diese technischen
          Vorbereitungen sind gr&ouml;&szlig;tenteils
          abgeschlossen. BLINDzeln stehen derzeit insgesammt drei
          Server zur Verf&uuml;gung f&uuml;r Webspace,
          EMailpostf&auml;cher, Autoresponder, Mailinglistensystem,
          Backupsystem, uvm.</P>

          <P>Nun k&ouml;nnen wir uns nach und nach um andere nicht
          weniger wichtige Dinge k&uuml;mmern, die auf unsere
          langen Liste der zu erledigenden Aufgaben stehen. Und
          darunter sind noch einige &Uuml;berraschungen f&uuml;r
          Euch, auf die ich mich heute schon freue, wenn ich Euch
          in absehbarer Zeit dar&uuml;ber berichten kann.</P>

          <P>An diesem Wochenende m&ouml;chten wir nun unser neues
          Chatsystem freischalten f&uuml;r alle BLINDzler und Euch
          herzlich zu uns in den Chat einladen. Wir sind zwar mit
          unserem Chatsystem noch nicht ganz fertig, aber es
          funktioniert und wir haben es in den letzten Tagen schon
          reichlich getestet. Wie Ihr zu uns in den Chat kommen
          k&ouml;nnt, werdet Ihr noch gleich in einer separaten
          Anleitung genau erfahren.</P>

          <P>Wir treffen uns im Chat t&auml;glich ab 20 Uhr, - das
          Chatsystem steht aber selbstverst&auml;ndlich rund um die
          Uhr zur Verf&uuml;gung. Schaut also auch zwischendurch
          mal rein.</P>

          <P>Wir haben einerseits auf unserer Homepage
          www.BLINDzeln.de ein M&ouml;glichkeit zum Chat zur
          Verf&uuml;gung gestellt und andererseit ein kleines
          vorkonfiguriertes Programm zum Download
          bereitgestellt.</P>

          <P>Sehende und sehschwache BLINDzler k&ouml;nnen sehr gut
          den Chat &uuml;ber unsere Homepage nutzen - wir haben
          unser System in Farben, Bedienbarkeit und
          Schriftgr&ouml;&szlig;en angepasst. Da unser Chatsystem
          &uuml;ber www.BLINDzeln.de aber auf einem Java-Aplet
          basiert, ist es f&uuml;r die meisten Screenreadernutzer
          schwer zug&auml;nglich. Hierf&uuml;r haben wir das
          Programm "MIRC" vorbereitet, das Ihr ohne
          gro&szlig;artige Installation sehr leicht benutzen
          k&ouml;nnt. Es ist auch deutlich komfortabler, so dass
          sicher auch die sehenden BLINDzler sich das Programm
          einmal n&auml;her ansehen sollten.</P>

          <P>Wie alles funktioniert und bedient wird, erfahrt Ihr
          wie erw&auml;hnt noch gleich in einer kleinen
          Anleitung.</P>

          <P>---</P>

          <H3><B>WICHTIG!</B></H3>

          <P>Wir dulden absolut keine Beleidigungen oder
          Beschimpfungen im Chat!!! Die meiste Zeit befinden sich
          Moderatoren im Chat, sp&auml;ter auch automatische
          sogenannte "bots", die st&auml;ndig ein Auge auf den
          Umgangston im Chat haben. Sollten Schimpfereien,
          Beleidigungen oder etwas &auml;hnliches im Chat
          vorkommen, werden die betreffenden Chatnutzer ohne
          Verwarnung sofort vom System oder den Moderatoren
          rausgeschmissen. Wir werden auch in den Mailinglisten
          selbst k&uuml;nftig immer mehr auf den Umgangston achten,
          denn es kann einfach nicht sein, dass BLINDzler sich
          untereinander beschimpfen oder beleidigen. Genau das
          m&ouml;chte BLINDzeln NICHT! - Ich denke, es geht jedem
          von uns so, dass man sich nur dort wohl f&uuml;hlt, wo
          man freundlich, fair und nett behandelt wird. Uns ist das
          sehr wichtig - Euch hoffentlich genauso!</P>

          <P>---</P>

          <P>Vorgestern Nacht hat unsere Mailinglistenstatistik die
          1000-Marke &uuml;berschritten. &Uuml;ber eintausend
          Nutzer sind in unseren Foren angemeldet und das innerhalb
          von fast genau sechs Monaten, die es BLINDzeln erst
          gibt.</P>

          <P>Wir m&ouml;chten uns ganz ganz herzlich bei Euch Allen
          daf&uuml;r bedanken und freuen uns sehr, das unsere Foren
          so gut Zulauf finden. Das ist ein gro&szlig;er Ansporn
          f&uuml;r uns, die vielen Aufgaben die noch vor uns
          liegen, mit Spass und Freude in Angriff zu nehmen.</P>

          <P>Leider mag dennoch nicht Jeder scheinbar BLINDzeln
          gern und anscheinend sind wir bereits einigen Menschen
          ein Dorn im Auge. Wir werden immer wieder mit massiven
          Attacken auf unsere Systeme konfrontiert. Beliebt ist es
          auch, uns mit Viren zu attackieren oder andere Angriffe
          auf unsere Systeme. Wir werden diesen Angriffen in Ruhe
          nachgehen und n&ouml;tige Konsequenzen einleiten. Ich
          pers&ouml;nlich finde es etwas schade, dass es Menschen
          gibt, die BLINDzeln lieber heute als morgen kaputt sehen
          m&ouml;chten und kann diese Einstellung zu uns auch nicht
          ganz nachvollziehen. BLINDzler brauchen sich
          &uuml;brigens hier&uuml;ber keine Gedanken machen, -
          unsere Systeme sind so eingerichtet, dass sie
          selbstverst&auml;ndlich KEINE Dateien, wie auch
          W&uuml;rmer und Viren verteilen k&ouml;nnen. Alles wurde
          abgewehrt oder blieb in unseren Filtern stecken. Wenn
          jemand aber etwas gegen BLINDzeln einzuwenden hat,
          m&ouml;ge er sich doch bitte direkt an uns wenden und uns
          seine Abneigung erkl&auml;ren - ein offenes Gespr&auml;ch
          ist sicherlich immer die bessere Wahl.</P>

          <P>---</P>

          <P>Auch im fast vergangenen Monat August haben wir in
          unseren Foren Zuwachs bekommen. Ihr solltet Euch
          zwischendurch immer wieder mal einen aktuellen Forenindex
          zusenden lassen.</P>

          <P>Diese &Uuml;bersicht &uuml;ber alle Themen, zu denen
          wir etwas im Angebot haben bekommt Ihr per EMail, indem
          Ihr einfach eine leere EMail an:</P>

          <P>forenindex@blindzeln.de</P>

          <P>....sendet.</P>

          <P>---</P>

          <P>Auch der Bereich [KURZVORSTELLUNGEN] wurde wieder
          &uuml;berarbeitet. Es sind wieder neue Eintr&auml;ge
          hinzugekommen und die Liste ist nun alfabetisch sortiert,
          so dass Ihr andere BLINDzler viel schneller finden
          k&ouml;nnt.</P>

          <P>In den Bereich Kurzvorstellungen kommt man nur durch
          ein Passwort. Dieses Passwort bekommen alle BLINDzler,
          die sich selbst hier vorgestellt haben.</P>

          <P>Um an dieser Aktion teilzunehmen, sendet bitte einfach
          eine EMail an....</P>

          <P>kurzvorstellung@blindzeln.de</P>

          <P>....und Ihr erhaltet ein einfaches Textformular per
          EMail zur&uuml;ck. Verwendet die Antwortfunktion Eures
          EMailprogramms, schreibt einfach dann Eure Antworten
          unter die Fragen. Wenn Ihr alle Fragen beantwortet habt,
          klickt einfach auf "senden" und schon bekommen wir Eure
          Kurzvorstellung. Diese wird dann im Bereich
          Kurzvorstellungen passwortgesch&uuml;tzt
          ver&ouml;ffentlicht und Ihr bekommt per EMail dann die
          Zugangsdaten und k&ouml;nnt die Kurzvorstelungen der
          anderen BLINDzler Euch durchlesen.</P>

          <P>---</P>

          <P>Weitere aktive BLINDzler gesucht</P>

          <P>Auch weiterhin k&ouml;nnen wir gut Eure Hilfe
          gebrauchen. Wir suchen noch einige Co-Moderatoren
          f&uuml;r die inhaltliche Moderation. Auch BLINDzler mit
          guten Kenntnissen &uuml;ber FTP-Programme sind gefragt,
          die sich um einige Downloadbereiche von BLINDzeln
          zuverl&auml;ssig k&uuml;mmern m&ouml;chten. Wie immer
          werden auch f&uuml;r unser monatliches Online-Magazin "No
          Cover" Redakteure gesucht. Ihr solltet einfach nur die
          Lust und Zeit mitbringen, interessante oder unterhaltende
          Artikel schreiben zu wollen. Hier freuen wir uns
          &uuml;ber Jeden, der gerne f&uuml;r unsere NoCover
          schreiben m&ouml;chte - egal, um welches Thema es geht.
          Auch suchen wir f&uuml;r die No Cover eine, oder mehrere
          Hilfen, die uns helfen, die eingehenden Artikel zu
          sortieren. N&auml;here Informationen bekommt Ihr von Wolf
          Zimmer, dem Chefredakteur der No Cover. Ihr erreicht ihn
          per EMail an wolf@blindzeln.de</P>

          <P>---</P>

          <P>Und jetzt liebe BLINDzlerinnen und BLINDzler
          w&uuml;nschen wir Euch weiterhin viel Spass bei BLINDzeln
          und freuen uns &uuml;ber Euch im Chat.</P>

          <P>Eine kurze Anleitung zum Chat findet Ihr in wenigen
          Sekunden ebenfalls in Eurem EMailpostfach.</P>

          <P>Herzliche Gr&uuml;&szlig;e von<BR>
          Fatih und Cord, sowie Euren Moderatoren von BLINDzeln</P>
          <HR>

          <H3><B>Installations- und Konfigurationsanleitung
          f&uuml;r das von BLINDzeln fertigt vorbereitete
          Chat-Programm</B></H3>

          <P>Unser Chatsystem ist f&uuml;r sehende und sehschwache
          BLINDzler optimiert &uuml;ber unsere Homepage
          www.BLINDzeln.de erreichbar. Klickt dort bitte auf den
          Link [Chat] und folgt den Anweisungen. Im Normalfall
          k&ouml;nnt Ihr unten auf der Seite einfach [EINGANG]
          anklicken. Es folgt eventuell noch eine
          Zertifikatswarnung, die Ihr mit Klick auf die
          Schaltfl&auml;che "Immer" oder "Ja" best&auml;tigen
          m&uuml;sst. Anschliessend sollte sich unser Chatsystem
          auf Eurem Bildschirm aufbauen. &Auml;ndert nun bitte im
          Feld "Nickname" den Eintrag nick.... um, indem Ihr dort
          zB. Euren Vornamen eintragt und klickt anschliessend auf
          die Schaltfl&auml;che "Connect". Es dauert einige
          Sekunden bis Ihr dann in unserem Chatraum seit. Sollte es
          nicht gleich klappen, nicht verzweifeln - nutzt in einem
          solchen Fall bitte auch einfach das Programm "MIRC", wie
          unten beschrieben.</P>

          <H3><B>"MIRC"</B></H3>

          <P>F&uuml;r Screenreadernutzer ist unser Chatsystem auf
          der Homepage www.BLINDzeln.de nur sehr schwer bedienbar.
          Um auch mit diesen BLINDzlern chatten zu k&ouml;nnen,
          haben wir ein kleines Programm f&uuml;r alle
          Windows-Systeme, welches Ihr Euch einfach herunterladen
          k&ouml;nnt. Das Programm "MIRC" k&ouml;nnt Ihr unter der
          Adresse:</P>

          <P>http://www.blindzeln.de/chat/mirc.exe</P>

          <P>....direkt herunterladen. Ihr k&ouml;nnt auch auf
          unsere Internetseite:</P>

          <P>http://www.blindzeln.de/chat.htm</P>

          <P>....gehen. Dort klickt Ihr dann "MIRC" an und auch so
          wird der Downloadvorgang gestartet.</P>

          <P>MIRC ist ein sehr kleines und komfortables Programm,
          welches Ihr ohne Installation direkt starten k&ouml;nnt.
          Mit MIRC ist es m&ouml;glich, das Chatsystem von
          www.BLINDzeln.de komfortabel und v&ouml;llig barrierefrei
          nutzen zu k&ouml;nnen. Hier erfahrt Ihr alle wichtigen
          Schritte, um unser Chatsystem sofort nutzen zu
          k&ouml;nnen....</P>

          <H3><B>Installation</B></H3>

          <P><B>1.</B> Nach dem Herunterladen der Datei "mirc.exe"
          muss diese Datei ausgef&uuml;hrt werden. Es handelt sich
          hierbei um ein selbstentpackendes Archiv. Es wird also
          nichts in das System installiert, sondern wirklich nur
          dieses Archiv auf Eurer Festplatte entpackt.</P>

          <P><B>2.</B> Je nach Screenreader mit Tab, Navigation
          oder vom Screenreader vorgesehenen Tastenkombination mit
          dem Focus (cursor) auf die heruntergeladene Datei
          "mirc.exe" gehen. Beim Dr&uuml;cken der Entertaste
          erscheint der Installationsdialog um das Archiv nun zu
          entpacken.</P>

          <P><B>3.</B> Einmal Tabtaste und Du befindest Dich auf
          der Schaltfl&auml;che "Browse" (durchsuchen). Dort
          dr&uuml;ckst Du die Eingabe- bzw. Entertaste und
          w&auml;hlst mit dem Cursor ein Laufwerk aus.
          M&ouml;chtest Du MIRC direkt auf Deine Festplatte
          installieren, dann dr&uuml;cke die Entertaste, denn das
          Verzeichnis MIRC wird von der Installation
          selbst&auml;ndig angelegt. Willst Du aber beispielsweise
          Dein MIRC im Unterordner C:\Programme haben, dann
          w&auml;hlst Du mit dem Cursor das Laufwerk "C:" aus,
          bet&auml;tigst Pfeil (cursorkreuz) rechts, sodass Du mit
          dem Cursor abw&auml;rts aufs Verzeichnis Programme
          wandern kannst. Mit Dr&uuml;cken der Entertaste wird
          Deine Wahl best&auml;tigt. Einmal Tab und Enter, und Du
          befindest Dich wieder im Installationsdialog. Wieder Tab
          und Enter und das Programm wird installiert.</P>

          <P><B>4a.</B> Um MIRC aufzurufen, wechselst Du am
          Arbeitsplatz auf das Laufwerk, auf dem MIRC installiert
          wurde, und schliesslich auf das Verzeichnis "MIRC".
          Starte nun das Programm "MIRC.exe" indem Du mit dem
          Cursor zu "MIRC.exe" wanderst und die Entertaste
          dr&uuml;ckst. Der Connect (Verbindungs) Dialog
          erscheint.</P>

          <P><B>4b.</B> M&ouml;glichkeit Nummer 2.... Windowstaste
          (loslassen), dann Taste "U" und In&acute;s Eingabefeld,
          das nun erscheint, tr&auml;gst Du Folgendes ein:
          Laufwerk:\verzeichnis\Programmname.</P>

          <P><B>Also z.B.</B> c:\mirc\mirc.exe<BR>
          oder eben c:\programme\mirc\mirc.exe<BR>
          Nach Dr&uuml;cken der Entertaste wird MIRC
          ge&ouml;ffnet.</P>

          <P><B>5.</B> Konfiguration.<BR>
          Wenn der connect (Verbindungs) Dialog erscheint,
          dr&uuml;ckst Du alt f und das Eingabefeld f&uuml;r den
          vollen Namen (full name) erscheint. Es ist nicht
          n&ouml;tig, den wirklichen Namen einzutragen. Das
          n&auml;chste Tabfeld oder (alt m) bringt Dich zum
          Eingabefeld f&uuml;r die E-Mailadresse. Die gibst Du dort
          ein. N&auml;chster Tab oder alt n f&uuml;hrt Dich zum
          Eintrag f&uuml;r Deinen Nickname (Spitznamen), das ist
          der Name, unter dem Du im Chatroom dann erscheinst. Alt t
          oder Tab f&uuml;hrt Dich zum alternativen Nicknamen, den
          Du eintr&auml;gst, f&uuml;r den Fall, dass Dein erster
          Nickname gerade belegt ist. Mit der Entertaste
          schlie&szlig;t Du die Konfiguration nun ab und sie ist
          gespeichert. Alt f bringt Dich ins Dateimen&uuml;, wo der
          erste Eintrag Connect (verbinden) lautet. Mit
          Dr&uuml;cken der Entertaste beginnt der Aufbau der
          Verbindung. Eine Internetverbindung sollte zu diesem
          Zeitpunkt allerdings schon aktiv sein. Ist die Verbindung
          erfolgreich, ist das im Statusfenster, in dem Du Dich
          jetzt befindest, zu lesen. Allerdings muss mit jedem
          Screenreader durch das Fenster navigiert werden, um die
          Informationen einsehen zu k&ouml;nnen. Bei der
          vorkonfigurierten Version ist es nicht notwendig, im
          Statusfenster zu navigieren, denn sobald die Verbindung
          korrekt ist, erscheint ein Eingabedialog: Enter Channel
          to join - Hier wird der Name des Raumes, den Du besuchen
          m&ouml;chtest, eingetragen. Also z. B. orakel. Das ist
          der einzige Fall, wo vor der Eingabe des Channelnamens
          das # weggelassen werden darf. Nach Dr&uuml;cken der
          Entertaste befindest Du Dich im Channel. Ist dieser
          Dialog aus irgendwelchen Gr&uuml;nden deaktiviert, ist
          folgender Schritt am Anfang der Eingabezeile
          n&ouml;tig:</P>

          <P>/join #orakel</P>

          <P>....Enter-Taste und der Chat kann beginnen.</P>

          <P><B>6.</B> Chatten<BR>
          Jetzt kannst Du schreiben, Mit Enter werden Deine Worte
          in das Netz geschickt und sind f&uuml;r alle im Channel
          lesbar. Wir w&uuml;nschen Dir in unserem BLINDzeln-Chat
          viel Spass....</P>

          <P>Anmerkung f&uuml;r Screenreaderbenutzer:<BR>
          MIRC besitzt 2 Systemmen&uuml;s. Es erleichtert das Lesen
          wesentlich, Wenn Ihr mit der Alttaste zuerst ins
          Men&uuml; geht, dann Pfeil nach links, Cursor nach unten,
          und dann x. So wird mal das MIRCeigene Fenster maximiert.
          Dann noch alt leer und x, um MIRC selber zu maximieren.
          Wichtig ist auch, immer vom Cursor aufw&auml;rts zu
          navigieren, um lesen zu k&ouml;nnen, was die andern
          geschrieben haben.</P>

          <P>So und zum Abschluss noch ein paar Ircbefehle, damit
          es so richtig Spa&szlig; macht:</P>

          <P>/join #channelname<BR>
          ....betritt den Raum.</P>

          <P>/away (mit nachfolgendem Text)<BR>
          ....setzt Deinen Nick auf abwesen.<BR>
          Beispiel:<BR>
          /away Futtern</P>

          <P>/away (ohne Text)<BR>
          ....setzt Dich wieder auf Anwesend.</P>

          <P>/query nickname<BR>
          ....&ouml;ffnet ein Fenster, in dem Du mit dieser Person
          privat schreiben kannst, ohne dass jemand ausser Euch
          beiden es lesen kann.</P>

          <P>Beispiel:<BR>
          /query user<BR>
          &ouml;ffnet ein Fenster in dem nur Du und jemand mit
          Namen "user" zusammen chatten. Mit Strg tab oder alt w
          und Cursor auf&acute;s Fenster mit dem Namen #orakel
          stellen, f&uuml;hrt Euch wieder in den Channel. Alt w und
          Cursor auf user f&uuml;hrt euch wieder ins Query.</P>

          <P>/leave #channelname<BR>
          ....verl&auml;sst den Raum, MIRC bleibt
          ge&ouml;ffnet.</P>

          <P>/quit<BR>
          ....schlie&szlig;t mirc.<BR>
          An die letzten beiden Kommandos kann auch ein Text
          angeschlossen werden.<BR>
          z. B.:<BR>
          /leave #orakel Gute Nacht.<BR>
          /quit #orakel ich geh schlafen.</P>

          <P>Informativ ist auch der Befehl<BR>
          /whois nickname<BR>
          Damit kann man &uuml;ber den eingegebenen Nickname
          einiges erfahren, z. B. ob er sich auf Abwesend gesetzt
          hat, &uuml;ber welchem Server er chattet usw. Es gibt
          noch eine Menge anderer Chatbefehle, die aber f&uuml;r
          den Anfang noch nicht so von Bedeutung sind, aber wer
          m&ouml;chte, bekommt gerne eine Liste von Befehlen von
          uns. Darin sind auch Befehle enthalten, die auch f&uuml;r
          OPs (operator) also Channelmoderatoren gelten.</P>

          <P>Ganz wichtig:<BR>
          Befehle beginnen immer mit / und m&uuml;ssen am
          Zeilenanfang eingegeben werden. Sobald es sich um
          R&auml;ume (channels) handelt, muss vorm eigentlichen
          Namen das # stehen.</P>

          <P>Wir w&uuml;nschen allen BLINDzlern ganz viel Spass im
          Chat und w&uuml;rden uns sehr freuen, Euch dort mal
          begr&uuml;&szlig;en zu d&uuml;rfen.</P>

          <P>&Uuml;ber diese Anleitung hinaus helfen wir Euch gern,
          wenn Ihr irgendwo einmal nicht weiter kommt. Schreibt uns
          an: chathilfe@BLINDzeln.de</P>

          <P>Eure Freunde von www.BLINDzeln.de</P>

          <P>Cord Hagen</P>
          <HR>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

