<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Marc Oberst -->

    <TITLE>R&uuml;ckkehr</TITLE>
  </HEAD>

  <BODY background="bgg.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Textformatierung mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>R&uuml;ckkehr</B></FONT><BR>
          von Marc Oberst</P>

          <P>Ruhig bewegt sich das Glas auf seiner Brust auf und ab
          wenn er atmet. Seine Hand h&auml;lt es fest umklammert.
          Die Oberfl&auml;che der darin verbliebenen
          Fl&uuml;ssigkeit erzittert dabei ein wenig. Neben seiner
          Hand liegt eine andere, die einer Frau. Er schaut den Arm
          entlang und sein Blick erreicht ihren K&ouml;rper, der
          sich unter den Falten des wei&szlig;en Lakens
          konturenhaft abzeichnet. Ein sch&ouml;ner K&ouml;rper. Es
          ist still und er kann ihren flachen Atem h&ouml;ren. Ein
          beruhigendes Ger&auml;usch. Langsam entzieht er sich
          ihrer Umarmung um das Glas wieder aufzuf&uuml;llen. Der
          Griff nach der Flasche auf dem Nachttisch geht ins Leere.
          Mit einem kurzen Schwung steht er aufrecht. Das Zimmer
          ist vom Gold der aufgehenden Sonne getr&auml;nkt und die
          Jalousien werfen d&uuml;nne Streifen an die
          gegen&uuml;berliegende Wand.</P>

          <P>Auf dem Weg zur K&uuml;che tritt er auf die vermisste
          Flasche. Vor ihrer &Ouml;ffnung hat sich ein brauner
          Fleck ausgebreitet, sie ist leer. Er kann sich nicht mehr
          daran erinnern, wann er sich das letzte Mal eingeschenkt
          hat und wann ihm dies passiert sein muss, doch das spielt
          jetzt auch keine Rolle mehr. Es ist schon fr&uuml;her
          Morgen und eine neue Flasche zu &ouml;ffnen h&auml;tte
          wenig Sinn, also begibt er sich in Richtung Bad. Einen
          kurzen Moment verdunkelt sich das Zimmer und ein leises
          Surren l&auml;&szlig;t ihn den Kopf anheben und einen
          Blick aus dem gro&szlig;en Fenster werfen. Zwischen den
          H&auml;usern der Stadt scheint die Morgensonne hindurch
          und spiegelt sich in den Fenstern der anderen
          Geb&auml;ude. Von Zeit zu Zeit kommen die Schwebewagen
          der Pendler, die au&szlig;erhalb in den
          Satelitenst&auml;dten wohnen an diesem Fenster vorbei und
          stellen sich so zwischen ihn und die Sonne. Doch die
          Dunkelheit verweilt nur f&uuml;r einen kurzen Moment und
          das blendende Licht, das sich danach wieder in seine
          Augen brennt, st&auml;rkt seinen Entschluss das Zimmer zu
          verlassen. Im Bad angekommen stellt er das Wasser in der
          Dusche an und h&auml;lt seinen Kopf darunter. Langsam
          flie&szlig;t es kalt &uuml;ber sein Gesicht und vertreibt
          die Schatten des Alkohols. Es sollte eigentlich ein
          ermunterndes Gef&uuml;hl sein, doch das ist es heute
          nicht. Das Handtuch kratzt mehr als dass es seinen
          K&ouml;rper trocknet, also legt er es wieder beiseite und
          l&auml;&szlig;t die Tropfen an seinen Hals und seiner
          Brust hinunterlaufen. Ein kleines Fr&uuml;hst&uuml;ck
          w&uuml;rde ihn wieder fit machen, fit genug zumindest, um
          wieder der Arbeit nachgehen zuk&ouml;nnen. Er dreht den
          Hahn zu und geht mit geneigtem Kopf in die K&uuml;che.
          Sein Blick streift den Tisch und die sich darauf
          befindende Ansammlung von staubigem Geschirr. Sie
          k&ouml;nnte nie eine gute Hausfrau sein. Er wendet sich
          ab und &ouml;ffnet die K&uuml;hlschrankt&uuml;r. Ein
          Sandwich w&auml;re vielleicht das Richtige, doch bis auf
          ein paar &Auml;pfel und einen Karton mit Milch ist nichts
          mehr da. Er setzt sich vor die leeren Glasf&auml;cher und
          trinkt einen Schluck. Aus dem K&uuml;hlschrank weht
          angenehme K&uuml;hle &uuml;ber seine Schultern und
          l&auml;&szlig;t die M&uuml;digkeit nun vollends
          verschwinden. Ein Seufzer aus dem Schlafraum rei&szlig;t
          ihn aus seinen Gedanken und die Ger&auml;usche ihrer
          Bewegungen auf dem Laken erinnern ihn an die letzte
          Nacht. Er steht auf und schlie&szlig;t die
          K&uuml;hlschrankt&uuml;r ohne etwas gegessen zu haben und
          geht zu ihr hin&uuml;ber. Seine Sachen sowie die ihrigen
          liegen im ganzen Zimmer verstreut durcheinander und er
          beginnt nun die seinen zusammenzusuchen und sich
          anzuziehen. Als er bis auf seine linke Socke, die er
          trotz intensiver Suche nicht finden kann, angezogen ist,
          geht er noch einmal zu ihrem Bett und setzt sich auf den
          Rand. Ihr dunkles Haar, welches sie sonst hoch gesteckt
          tr&auml;gt, liegt auf dem Bett um ihren Kopf herum
          ausgebreitet wie die Korona einer Sonne, die sich langsam
          zu einer Supernova zusammenzieht. Seine Fingerspitzen
          gleiten behutsam &uuml;ber ihren R&uuml;cken und er kann
          auf ihrem Gesicht den Anflug eines L&auml;chelns
          erkennen. Er stellt das Glas neben das Bett, k&uuml;sste
          sie auf die Wange, und erhebt sich um zu gehen.</P>

          <P>Sein Mantel liegt irgendwo im Flur, den die Sonne noch
          nicht erreicht hat. Er tappt durch das Zwielicht und
          stolpert &uuml;ber ein Paar Schuhe. Es sind seine, also
          zieht er sie an. Wahrscheinlich w&uuml;rde er sie nicht
          vermisst haben, wenn er sie nicht durch Zufall gefunden
          h&auml;tte. Er &ouml;ffnet die T&uuml;r der Hotelsuite
          und blickt hinaus in den Gang. Es ist alles noch ruhig zu
          dieser Zeit. Hinter sich vernimmt er wie sie sich von
          einer Seite auf die andere dreht und er glaubt die
          Leichtigkeit ihres K&ouml;rpers darin sp&uuml;ren zu
          k&ouml;nnen. Das macht es ihm nicht leichter zu
          gehen.</P>

          <P>Er schlie&szlig;t die T&uuml;r hinter sich und geht
          den Gang hinab. Vor dem Lift bleibt er stehen und wartet
          darauf, dass sich die T&uuml;ren &ouml;ffnen. Auf dem Weg
          nach unten beschlie&szlig;t er vor der Arbeit noch bei
          einer Tierhandlung vorbei zu fahren und f&uuml;r seine
          Frau eine Katze mitzunehmen oder einen Kater. Es wird ihr
          gefallen nicht immer allein zu Hause sein zu m&uuml;ssen
          wenn er den ganzen Tag fort ist. Die Liftt&uuml;ren
          &ouml;ffnen sich und er tritt in die Empfangshalle. Der
          Nachtportier gr&uuml;&szlig;t ihn mit einem Nicken und
          wendet sich wieder dem Fernseher zu, indem gerade oder
          immernoch Buster Freundlich zu sehen ist. Der ehemalige
          Filmkomponist F.H.R&ouml;nper ist heute Morgen zu Gast
          und sowie Buster l&auml;chelt auch er unentwegt. Die
          Liftt&uuml;ren schlie&szlig;en sich hinter ihm und er
          geht zur Ausgangst&uuml;r und tritt mit einem Schritt auf
          die Stra&szlig;e. Ein kalter Wind treibt altes
          Zeitungspapier den Gehweg entlang und er schlie&szlig;t
          den Mantel um nicht zu frieren. Der Nieselregen, der seit
          Jahren scheinbar unaufh&ouml;rlich auf die Erde hinabfiel
          ist verschwunden. Er fragt sich wie und wann dies
          passiert ist. Wahrscheinlich hatten die Wissenschaftler
          mit ihren Prognosen vom tausenj&auml;hrigen Regen doch
          unrecht oder vielleicht wird er auch einfach nur
          verr&uuml;ckt. Aus der Innentasche seines Mantels holt er
          sich ein Zigarette, z&uuml;ndet sie an und atmet den
          Rauch tief ein. Es wird an seinem Job liegen. Er sollte
          wirklich einmal Urlaub nehmen, dass hatte Bryant ihm
          schon oft gesagt. W&auml;hrend er wartet geht die Sonne
          immer weiter auf und erreicht nun auch die unteren
          Fensterreihen der gegen&uuml;berliegenden H&auml;user.
          Die Stra&szlig;en sind noch leer und es ist ziemlich
          still, nur von weither ert&ouml;nt das Heulen einer
          Sirene. Er wartet auf ein Taxi, das ihn nach Hause
          bringt. Er hat zwar keines bestellt, aber es w&uuml;rde
          schon eins vorbei kommen. Es kommen immer welche
          vorbei.</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

