<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content="Thomas Nawroth">
    <META name="DESCRIPTION" content=
    "Ein Computer-Magazin von 1984">

    <TITLE>Happy Computer</TITLE>
  </HEAD>

  <BODY bgcolor="#fffff4" background="mm_hc11b.gif">
    <TABLE border="0" cellpadding="8">
      <TR>
        <TD>
          <CENTER>
            <IMG src="mm_hc11a.gif"><BR>
            <I>Folge 11</I>
          </CENTER>
          <BR>
           Die beiden bekanntesten Speichermedien bei Heimcomputern
          sind Kassette und Diskette. Daneben besteht aber eine
          weitere M&ouml;glichkeit der Datenspeicherung: in EPROMs.
          

          <H1 align="CENTER">Daten speichern auf EPROMs</H1>

          <P>Wenn Sie Besitzer eines Computers sind, haben Sie beim
          Einschalten sicher schon oft eine Bereitschaftsmeldung
          gelesen. Damit hatten Sie aber auch Ihren ersten Kontakt
          zu einem ROM oder EPROM. Denn kein Computer kommt ohne
          diese Festwertspeicher aus. In ihnen sind in der Regel
          die Programme abgelegt, die der Computer f&uuml;r eine
          erste Betriebsbereitschaft unbedingt ben&ouml;tigt:
          Beispielsweise das Betriebssystem, der Zeichensatz oder
          der Basic Interpreter. Uns interessieren hier die EPROMs.
          Hinter dem Wort EPROM verbirgt sich nat&uuml;rlich eine
          englische Bezeichnung: Erasable Programmable Read Only
          Memory. Das bedeutet, da&szlig; Daten, die in einem EPROM
          gespeichert sind, nur noch gelesen und erst durch
          Bestrahlung mit ultraviolettem Licht wieder gel&ouml;scht
          werden k&ouml;nnen. Welche Daten gespeichert werden, ist
          dabei frei bestimmbar. Die Vorteile der Datenspeicherung
          in EPROMs sind enorm:</P>

          <P>- Das Programm ist sofort nach dem Einschalten des
          Computers im Speicher vorhanden. - Die Daten bleiben auch
          nach Abschalten des Computers erhalten. - Besondere
          Funktionen, wie automatisches Starten eines Programms
          nach dem Einschalten sind m&ouml;glich.</P>

          <P>Die Nachteile liegen in den relativ hohen Kosten
          f&uuml;r die EPROMs (16 bis 160 Mark) und der notwendigen
          Steckkarte, mit der die EPROMs an den Computer
          angeschlossen werden (zirka 80 Mark).</P>

          <P>Was geschieht aber bei der Datenspeicherung in EPROMs?
          Damit Sie die Daten des internen Speichers Ihres
          Computers in ein EPROM &uuml;bertragen k&ouml;nnen,
          brauchen Sie ein EPROM- Programmierger&auml;t, auch
          "EPROM-Brennen" genannt. Damit wird die Verbindung
          zwischen Computer und Eprom hergestellt und f&uuml;r die
          notwendige Programmierspannung gesorgt. Zus&auml;tzlich
          wird noch ein Programm ben&ouml;tigt, das die
          Daten&uuml;bertragung steuert. Das Prinzip der
          EPROM-Programmierung beruht darauf, da&szlig; Ladungen in
          die Speicherzellen des EPROMs &uuml;bertragen werden.
          Diese Speicherzellen kann man sich als kleine Schachteln
          vorstellen, in die etwas abgelegt wird, oder auch nicht.
          Dabei wird nur zwischen vollen und leeren Schachteln
          unterschieden, oder genauer zwischen geladen und
          ungeladen. Die einzelnen Ladungszust&auml;nde werden vom
          Computer entweder als logische 1 (high) oder logische 0
          (low) interpretiert. Jede dieser Schachteln enth&auml;lt
          somit entweder die Information 1 oder 0. Kommt Ihnen das
          bekannt vor? Richtig, auch in EPROMs werden Daten
          bin&auml;r gespeichert. Die Speicherzellen eines neuen
          EPROMs sind normalerweise ungeladen (logisch 1). Wird nun
          eine Programmierspannung (zwischen 12,5 und 25 Volt, je
          nach EPROM-Typ) an eine dieser Zellen gelegt, so
          &auml;ndert sich ihr Potenzial. Sie wird "geladen"
          (logisch 0). Dabei werden die am Datenbus des EPROMs
          anliegenden Daten in die durch den Adre&szlig;bus
          angegebene Adresse des EPROMs &uuml;bernommen. Bits, die
          durch eine bereits vorgenommene Programmierung auf
          logisch 0 (low) gesetzt sind, k&ouml;nnen bei eventuell
          folgenden weiteren Programmierl&auml;ufen nicht mehr in
          logisch 1 (high) zur&uuml;ckverwandelt werden. Der
          umgekehrte Fall ist zwar m&ouml;glich, aber selten
          sinnvoll. Entsprechend dem Programm wird so, jeweils acht
          Speicherzellen (ein Byte) auf einmal, das gesamte
          Programm aus dem Computer in den EPROM &uuml;bertragen.
          Damit die Ladung der Speicherzellen auch nach dem
          Wegnehmen der Programmierspannung erhalten bleibt, ist
          jede Zelle von einer nur in einer Richtung
          durchl&auml;ssigen Isolierschicht umgeben. Dies ist der
          Grund, warum die gespeicherten Daten auch nach dem
          Abschalten des Computers "festgehalten" werden.</P>

          <P>Das "Erasable" im Namen der EPROMs bedeutet, da&szlig;
          der Speicherinhalt nicht auf alle Zeiten festgeschrieben
          ist. Durch Bestrahlung mit ultraviolettem Licht werden
          EPROMs wieder gel&ouml;scht. Dazu ist im Geh&auml;use des
          EPROMs ein rundes Fenster angebracht, durch das die
          UV-Strahlen auf den Chip einwirken k&ouml;nnen. Beim
          L&ouml;schen wird die Isolationsschicht der Speicherzelle
          in beide Richtungen durchl&auml;ssig. Das EPROM kann sich
          entladen. Danach ist eine erneute Programmierung
          m&ouml;glich. Ein EPROM kann zwischen 25- und 30mal
          gel&ouml;scht und neu programmiert werden. Danach
          verliert das EPROM das E in seinem Namen, es wird
          unl&ouml;schbar und damit zum PROM. Solche Speicher
          werden eingebaut, wenn aus verschiedenen Gr&uuml;nden ein
          L&ouml;schschutz notwendig ist.</P>

          <P>Am billigsten ist es, die EPROMs zum L&ouml;schen
          einfach in die Sonne zu legen, leider auch am
          langsamsten. Schneller geht es mit einem speziellen
          EPROM-L&ouml;schger&auml;t; aber das ist der teuerste
          Weg. Im Normalfall reicht eine einfache H&ouml;hensonne.
          Die L&ouml;schzeit betr&auml;gt dann, ja nach Entfernung
          der EPROMs zur UV-Quelle, zwischen 15 und 25 Minuten.
          Nat&uuml;rlich h&auml;ngt die L&auml;nge des
          &uuml;bertragbaren Programms von der
          Speicherkapazit&auml;t der verwendeten EPROMs ab. Die
          meistverwendeten Typen speichern dabei zwischen 2 und 16
          KByte, es gibt aber auch schon EPROMs mit 32 KByte. Ein
          Programm mit 8 KByte L&auml;nge kann so entweder auf
          einem 8-KByte-EPROM, oder auf zwei 4-KByte EPROMs
          gespeichert werden. Das "Brennen" von EPROMs ist eine
          Einsatzm&ouml;glichkeit von Computern, deren volles
          Anwendungsspektrum nicht auf den ersten Blick
          hervortritt. Sei es das Programmieren eines neuen
          Betriessystems, eines Textverarbeitungsprogramms oder oft
          benutzter Routinen. Sch&auml;tzen lernt man es
          sp&auml;testens dann, wenn selbst schnelle
          Diskettenlaufwerke noch zu langsam sind. Im
          Heimcomputerbereich hat die EPROM-Familie jedenfalls
          l&auml;ngst ihren Siegeszug angetreten - in den
          millionenfach verkauften Spielmodulen.</P>
          (Arnd W&auml;ngler/mk) 
          <HR>
          <BR>
          In der n&auml;chsten NoCover gibt es aktuelle Meldungen.
        </TD>
      </TR>
    </TABLE>
    <BR>
    <BR>

    <TABLE align="CENTER" border="3">
      <TR bgcolor="#ffffff">
        <TD><A href="mailto:">Thomas Nawroth</A></TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

