<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Das Leben im Jahr 2010
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <H2 align="center">
            <B>Das Leben im Jahr 2010</B>
          </H2>
          <BR>
           <BR>

          <H3>
            Das Leben 2010... Es ist Mittwoch, der 2. Juli 2010, 5 Uhr morgens.
          </H3>
          <BR>
           <BR>

          <P>
            Der Radiowecker rei&szlig;t Angelika S. (40) aus dem Schlaf. Der Oldie-Sender spielt Modern Talking.<BR>
             Frau S. qu&auml;lt sich aus dem Bett. Gestern ist es etwas sp&auml;ter geworden - bei der Arbeit. Dienst am Pfingstsonntag - mal wieder. Fr&uuml;her konnte sie am n&auml;chsten Tag
            wenigstens ausschlafen.<BR>
             "Ja ja, der Pfingstmontag", murmelt Frau S., "ist das wirklich schon sechs Jahre her?" Es hat sich wirklich einiges getan seit damals. Nur nicht in ihrem Haus. Als 2004 die
            Eigenheimzulage pl&ouml;tzlich gestrichen wurde, musste man eben Abstriche machen. Und inzwischen hat sich Familie S. daran gew&ouml;hnt - an die frei liegenden Leitungen und den
            Betonfu&szlig;boden in den R&auml;umen. Gut, denkt Frau S., dass damals die Garage noch nicht fertig war. Denn der Wagen ist l&auml;ngst verkauft. Zu teuer, seit es keine
            Kilometerpauschale mehr gibt. Und mit Bus und Bahn dauert es nach Uelzen ja auch nur zwei - drei Stunden.<BR>
             Und was man dabei f&uuml;r nette Leute trifft. Zum Beispiel den gutaussehenden Tagel&ouml;hner, der Frau S. immer so reizend anl&auml;chelt. Zur&uuml;ckl&auml;cheln mag sie nicht. Wegen
            ihrer Z&auml;hne. Aber was will man machen? 3000 Euro f&uuml;r zwei Kronen sind viel Geld. Und schon die Brille musste sie selbst bezahlen. Hat dabei aber 150 Euro gespart. Weil sie
            gleich zum Augen-, und nicht erst zum Hausarzt gegangen ist. Wegen der &Uuml;berweisung.<BR>
             Trotzdem: Der Urlaub f&auml;llt in diesem Jahr auch wieder flach. "Das k&ouml;nnte langsam &Auml;rger geben zu Hause", st&ouml;hnt Frau S. vor sich hin. Traurig erinnert sie sich an das
            letzte Weihnachtsfest. Als es keine Geschenke gab. 2009 wurde in der freien Wirtschaft das Weihnachtsgeld gestrichen, im &ouml;ffentlichen Dienst ist das ja schon viel l&auml;nger
            her.<BR>
             "Und bis wann gab's eigentlich Urlaubsgeld?", fragt sich Frau S.- sie erinnert sich nicht mehr daran. Damals hatte man jedenfalls noch gen&uuml;gend Urlaub, um das Urlaubsgeld
            auszugeben. Heute sind es ja gerade mal 15 Tage im Jahr.
          </P>
          <P>
            Pfingstmontag? 1. Mai? - Geschichte.<BR>
             Das stand nicht in der Agenda 2010 - so hie&szlig; sie doch, oder? Aber man soll nicht meckern. Die F&uuml;hrungskr&auml;fte, wei&szlig; Frau S., m&uuml;ssen doch heutzutage noch viel
            mehr ackern. Darum kann Angelika S. mit der 48-Stunden-Woche auch ganz gut leben. Sie hat ja auch keine Wahl. Seit der K&uuml;ndigungsschutz auch f&uuml;r Beamte gelockert wurde, mag man
            es sich mit den Vorgesetzten nicht mehr verscherzen.<BR>
             Wer will sich schon einreihen in das Heer von sechs Millionen Arbeitslosen? Aber den Feiertagszuschlag f&uuml;r den Dienst an Pfingsten vermisst sie schon.<BR>
             Was soll's, in 30 Jahren hat Frau S. es hinter sich. So &uuml;ppig wird die Pension zwar nicht ausfallen, wenn das mit den Nullrunden so weitergeht.<BR>
             Doch wer wei&szlig;: Vielleicht bringt sie das Nikotin vorher um. Obwohl sie weniger raucht, seit die Schachtel neunzehn Euro kostet. Aber heute, auf den letzten Metern zum Amt, steckt
            Angelika S. sich trotzdem eine an.
          </P>
          <BR>
          <DIV align="CENTER">
            <IMG src="st_euro.jpg" alt="1 Euro-M&uuml;nze" width="200" height="199">
          </DIV>
          <BR>

          <P>
            Mit freundlichen Gr&uuml;&szlig;en: <B>Zukunft Deutschland, alles wird gut!!!</B><BR>
          </P>
          <P>
            <TT>Autor unbekannt...</TT>
          </P>
          <HR width="100%" size="3">
          <BR>
           <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50">
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

