<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author =  Andreas Kiefl-->

    <TITLE>Musikindustrie</TITLE>
  </HEAD>

  <BODY background="bgd.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Textformatierung mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Musikindustrie</B></FONT></P>

          <P><B>*2002:</B> Als beste K&uuml;nstler werden Madonna,
          Herbert Gr&ouml;nemeyer, Tom Jones, Cher, und Santana
          ausgezeichnet. Zu den Top-Hits geh&ouml;ren Westlife mit
          "Uptown Girl", die No Angels mit "All Cried Out", Kelly
          Osbourne mit "Papa Don't Preach", Madonna mit "American
          Pie". Die Musikindustrie erf&auml;hrt zum ersten Mal nach
          einer langen Boomzeit einen Umsatzr&uuml;ckgang. Als
          Hauptursachen macht sie das in Mode gekommene Kopieren
          von CDs und das Tauschen von Musikdateien im Internet
          verantwortlich. Um den Kids klar zu machen, da&szlig; das
          Kopieren von Musik letzendlich die K&uuml;nstler
          sch&auml;digt, startet die Industrie die Kampagne
          "Copying Music is Killing Music".</P>

          <P><B>*2003:</B> Die Musikindustrie zeichnet Herbert
          Gr&ouml;nemeyer, Nena, Kim Wilde, Ozzy Osbourne und
          Metallica als beste K&uuml;nstler aus. Das Album Nr. 1
          ist Nena mit Remixen ihrer gr&ouml;&szlig;ten Hits. In
          den Hitparaden finden sich neben Alexander, Juliette und
          Daniel K. auch Jeanette Biedermann mit "Rock my Life",
          das stark nach Roxette klingt. Weiterhin geh&ouml;ren
          Lichtenfels mit "Sounds like a Melody", Outlandish mit
          "Aicha", Kraftwerk mit "Tour de France 2003", KCPK mit
          "We will Rock You" und Murphy Brown mit "Axel F 2003" und
          Culture Beat mit "Mr. Vain Recall" zu den Tophits.</P>

          <P>Die meisten CDs haben Kopierschutz. Seit August ist
          das Kopieren kopiergesch&uuml;tzter CDs verboten, ebenso
          das Herunterladen von Musik aus dem Internet. Der Umsatz
          der Musikindustrie geht um weitere 15% zur&uuml;ck,
          besonders betroffen Hit-Kompilationen mit 47%.</P>

          <P><B>*2004:</B> Die Musikindustrie zeichnet Herbert
          Gr&ouml;nemeyer, Marius M&uuml;ller-Westernhagen, DJ
          Bobo, Marianne Faithfull und Pur aus. In den Charts
          stehen das Hollywood Dance Project mit "Relax Reloaded",
          Kajagoogoo mit "Too Shy 2004", Nena mit "Haus der 2004
          Sonnen" und Nico W aus "GZSZ" mit "Ich vermi&szlig; Dich
          wie die H&ouml;lle" lange Zeit ganz oben.</P>

          <P>Mit Hilfe einer automatisierten Sauger-Suche kann die
          Musikindustrie alle Nutzer von Tauschb&ouml;rsen
          ausfindig machen. F&uuml;nf Millionen Haushalte in
          Deutschland erhalten daraufhin Post des M&uuml;nchner
          Anwalts G., der ultimativ die Unterzeichnung einer
          Unterlassungserkl&auml;rung einfordert und die Erstattung
          von Auslagen &uuml;ber 583,74 Euro.</P>

          <P>Die Tauschb&ouml;rsen brechen zusammen. Die
          H&auml;lfte aller T-DSL-Anschl&uuml;sse wird
          gek&uuml;ndigt. Der Umsatz der Musikindustrie geht um
          weitere 10% zur&uuml;ck.</P>

          <P><B>*2005:</B> Es werden Herbert Gr&ouml;nemeyer, Tom
          Jones, die Supremes, Suzi Quatro und Elvis Presley als
          K&uuml;nstler des Jahres ausgezeichnet, dazu Status Quo
          mit dem Innovationspreis des Musiker-Managements. Die
          Charts f&uuml;hren an Peter Maffay mit "So bist Du 2005",
          Roberto Blanco mit "Ein bi&szlig;chen Spa&szlig;
          mu&szlig; wieder mal sein" und Zarah Leander mit "Ich
          wei&szlig;, auch 2005 wird ein Wunder gescheh'n."</P>

          <P>Der Umsatz der Musikindustrie schrumpft erneut um
          50%.</P>

          <P>Die Trend-Scouts entdecken, da&szlig; unter den
          Jugendlichen 60er- 70er80er und 90er- Revivals in sind.
          Sie treffen sich zu FlowerPower-, Disco-, New Wave- und
          Rave-Parties und h&ouml;ren die CDs ihrer Eltern.
          Original-CDs und LPs der vergangenen vier Jahrzehnte
          werden verst&auml;rkt bei Ebay gehandelt. Es wird
          vermutet, da&szlig; die Kids die CD erwerben, kopieren
          und dann weiterverkaufen. Das ist legal, da die alten CDs
          keinen Kopierschutz haben und nur Originale angeboten
          werden.</P>

          <P><B>*2006:</B> Die Musikindustrie bringt ein neues
          Tontr&auml;gerformat heraus: Die "Smart CD". Sie
          ben&ouml;tigt spezielle Abspielger&auml;te mit
          Internet-Anschlu&szlig;. Die Smart-CDs lassen sich nur
          abspielen, nachdem vorher eine Lizenz &uuml;ber das
          Internet gekauft wurde. Lizenzen gibt es nur noch
          tempor&auml;r, es ist nicht mehr m&ouml;glich, ein
          Musikst&uuml;ck "f&uuml;r immer" zu erwerben. Daf&uuml;r
          werden die "Smart-CD"-Spieler im Bundle mit einem
          Musik-Abo f&uuml;r einen Euro angeboten.</P>

          <P>Als erfolgreichste K&uuml;nstler werden Herbert
          Gr&ouml;nemeyer, die Scorpions, Mark Oh, Oli P. und Peter
          Kraus ausgezeichnet. Die Charts werden beherrscht durch
          Songs wie "Flugzeuge im Bauch Ultimate Edition" mit
          Herbert Gr&ouml;nemeyer, Oli P. und Xavier Naidoo, "You
          Keep Me Hanging On" mit den Supremes, Kim Wilde und
          Sinema sowie "Anyplace, anywhere, whatever" von Nena, Kim
          Wilde und Jan Delay.</P>

          <P>Aus Anla&szlig; der Fu&szlig;ball-WM wird mit
          gro&szlig;em Marketing-Aufwand eine neue
          Latino-Salsa-Welle propagiert, mit Carlos Santana und
          Richie Valens ("La Bamba World Cup 2006 Mousse T. Remix")
          als Galionsfiguren. Obwohl Brasilien zum sechsten Mal
          Weltmeister wird, hat die Welle nur m&auml;&szlig;igen
          Erfolg.</P>

          <P>Der Absatz der Musikindustrie sinkt weiter.</P>

          <P><B>*2007:</B> Mit Hinweis auf die vielen bedrohten
          Arbeitspl&auml;tze setzt die Musik-Lobby ein Gesetz
          durch, nachdem der R&uuml;ckruf einmal erteilter Lizenzen
          m&ouml;glich ist. Prompt widerruft die Industrie alle
          bisher erteilten Lizenzen auf nicht kopiergesch&uuml;tzte
          Tontr&auml;ger. Damit werden alle &auml;lteren CDs und
          alle LPs illegal, ebenso Plattenspieler und CD-Spieler,
          die nicht dem "Smart CD" Standard entsprechen. Im
          Austausch f&uuml;r ihre Original-CDs bietet die Industrie
          CD-Besitzern eine Einjahreslizenz f&uuml;r die auf der CD
          vorhandene Musik an.</P>

          <P>Nach einer erneuten Abmahnwelle der Kanzlei G. aus M.
          bricht der Tontr&auml;gerhandel &uuml;ber eBay
          zusammen.</P>

          <P>Auf die Ver&ouml;ffentlichung von Charts und die
          Auszeichnung von K&uuml;nstlern wird verzichtet.
          Zun&auml;chst einmal m&uuml;ssen die Lagerbest&auml;nde
          an CDs abverkauft werden.</P>

          <P><B>*2008:</B> Musik wird in Deutschland nur noch im
          Radio oder bei Konzerten geh&ouml;rt. Das Radio verliert
          aber an Popularit&auml;t, seit die Industrie die Sender
          zwingt, nur noch neueste Produktionen zu spielen und
          &uuml;ber diese dr&uuml;berzusprechen, damit das
          Aufnehmen mit Tapedecks verhindert wird. Konzerte sind
          fast unbezahlbar geworden, da das gesamte Management von
          den Eintrittspreisen mitbezahlt werden mu&szlig;.</P>

          <P>Dagegen h&auml;ufen sich die sogenannten "Open Jams",
          spontane Zusammenschl&uuml;sse von Hobby-Musikern, die
          auf &ouml;ffentlichen Pl&auml;tzen mit Gitarre, kleinem
          Schlagzeug, Keyboard, Saxophon etc. Musik spielen und von
          begeisterten Zuh&ouml;rern gefeiert werden.</P>

          <P><B>*2009:</B> Die Musiklobby setzt beim Gesetzgeber
          das Verbot &ouml;ffentlicher und privater Performance
          urheberrechtlich gesch&uuml;tzen Materials durch.
          Musikinstrumente werden mit einer Urheber-Abgabe belegt,
          da man ja eine Gitarre etwa zum Raub-Abspielen von
          Stones-Songs mi&szlig;brauchen kann. "Making music is
          killing music" lautet die begleitende Kampagne, die den
          Leuten Unrechtsbewu&szlig;tsein beibringen soll.</P>

          <P><B>*2010:</B> Um Arbeitspl&auml;tze bei Musikern zu
          sch&uuml;tzen, wird Musikunterricht rationiert: Es
          d&uuml;rfen nur noch so viele Nachwuchsmusiker
          ausgebildet werden, wie der Markt braucht. Da dieser
          schneller schrumpft als die Musiker wegsterben, bedeutet
          das faktisch ein Verbot des Musikunterrichts. Hunderte
          Musikschulen werden geschlossen.</P>

          <P><B>*2011:</B> Sarah Connor versucht mit "Terminate Me"
          einen neuen, nicht gecoverten Song herauszubringen, wird
          aber daf&uuml;r von den Anw&auml;lten der
          Musikrechteinhaber verklagt, die es nicht erlauben,
          da&szlig; neue Urheber am kleiner werdenden Kuchen
          mitverdienen wollen. "Composing music is killing music"
          hei&szlig;t das Schlagwort der Inhaber alter Rechte.
          Sarah Connor gewinnt den Rechtsstreit, wird aber kurz
          darauf unter mysteri&ouml;sen Umst&auml;nden ermordet
          aufgefunden. Von nun an traut sich niemand mehr, neue
          Songs zu schreiben.</P>

          <P><B>*2012:</B> Die Eltern des 6-j&auml;hrigen Wolfgang
          Amadeus Moherb, des "Jugend-musiziert"-Siegers, werden zu
          150.000 Euro Schadenersatz an die Musikindustrie
          verurteilt, weil sich herausgestellt hat, da&szlig; ihr
          Kind erst seit eineinhalb Jahren musiziert, also nach dem
          Inkrafttreten der Unterrichts-Rationierung. Seine
          Lehrerin, die Violinistin Anne-Sophie Mutter, entzieht
          sich einer Gef&auml;ngnisstrafe durch Flucht in den Irak,
          dem einzigen Land, das nicht unter Kontrolle der
          westlichen Wertegemeinschaft und damit der Musikindustrie
          ist.</P>

          <P><B>*2020:</B> Nahezu jede tonliche
          &Auml;u&szlig;erung, darunter Motorger&auml;usche,
          Trittschall, T&uuml;rschlie&szlig;ger&auml;usche und
          gesprochenes Wort, sind unter urheberrechtlichen Schutz
          gefallen. Eine T&uuml;r zumachen darf quasi nur noch, wer
          nachweisen kann, da&szlig; der dabei erzeugte Schall
          nicht dem von Porsche patentierten &auml;hnelt. Die
          einzigen lizenzfreien Worte sind "der", "die", "das",
          "und" und "hallo". Die Gespr&auml;che von Menschen, die
          sich das "Deutsche Sprache Abo" nicht leisten
          k&ouml;nnen, sind daher fast unverst&auml;ndlich
          geworden. &Uuml;berhaupt ist es sehr still geworden, da
          fast jede Schallerzeugung das Risiko einer Abmahnung
          durch den M&uuml;nchner Justizkonzern G. und S&ouml;hne
          mit sich birgt.</P>

          <P>Die Anw&auml;lte der Ton und Schall
          Industrie-Gemeinschaft machen Jagd auf Park- und
          Waldbesitzer, die in ihren Anwesen das illegale Singen
          von V&ouml;geln dulden.</P>

          <P><B>*2050:</B> Europa und die USA sind in einem
          Handstreich vom Irak eingenommen worden. Die Iraker
          brauchten nur einen einzigen Muezzin, um die halbe
          Streitmacht der Westm&auml;chte auszuschalten, die sich,
          an Schall nicht mehr gew&ouml;hnt, mit zugehaltenen Ohren
          am Boden w&auml;lzte. Die andere H&auml;lfte und die
          zivile Bev&ouml;lkerung wurden dadurch gewonnen,
          da&szlig; man ihnen Kinderlieder vorsang. Die Menschen
          fingen an zu weinen und den Invasoren auf Knien zu
          danken, f&uuml;r diese neue und wunderbare Gabe, die sie
          so lange vermi&szlig;t hatten. Seither ist der Islam die
          gr&ouml;&szlig;te Weltreligion und das Reich Allahs unter
          der weisen Herrschaft des Kalifen von Washington schwingt
          sich auf zu neuer Bl&uuml;te.</P>

          <P>--<BR>
          Origin: somewhere in the Internet</P>

          <P>Eingesandt: Andreas Kiefl
          &lt;Kiefl@MitgliedBauernverband.de&gt;</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

