<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <!-- Author = Nathalie Sorichter -->

    <TITLE>Eigenes Erlebnis</TITLE>
  </HEAD>

  <BODY background="bgc.gif" text="#000000" bgcolor="#b0b0b0">
    <TABLE width="100%" border="0" cellpadding="8" summary=
    "Textformatierung mit Rand">
      <TR>
        <TD>
          <P align="center"><FONT color="#000080" size=
          "7"><B>Blinde Passagiere?</B><BR>
          - nur mit Betreuungsperson</FONT></P>

          <P>Monatelang hatten wir, zwei vollblinde,
          vollj&auml;hrige Schulabsolventen, uns auf unseren
          wohlverdienten Helgoland-Urlaub gefreut. Als wir jedoch
          in Cuxhaven das F&auml;hrschiff "Wappen von Hamburg"
          betreten wollten, wurde uns ein Strich durch die Rechnung
          gemacht ...</P>

          <P>Wir hatten im vergangenen Jahr bereits v&ouml;llig
          ohne sehende Begleitung und sehr erfolgreich eine Woche
          auf Helgoland verbracht. Damals waren wir mit der "Wappen
          von Hamburg" der F&ouml;hrde Reederei Seetouristik
          Flensburg GmbH &amp; Co. KG gefahren, und es hatte
          keinerlei Schwierigkeiten gegeben. Wir waren ohne
          gro&szlig;e Probleme aufs Schiff gekommen, hatten uns
          dort, soweit n&ouml;tig, gut orientieren k&ouml;nnen und
          hatten auch keine Schwierigkeiten beim Ausbooten gehabt.
          Im Gegenteil: F&uuml;nf Matrosen halfen uns damals,
          trocken und sicher ins Boot hinunterzusteigen.</P>

          <P>Da dies auch auf der R&uuml;ckfahrt problemlos
          funktioniert hatte, gingen wir dieses Jahr ebenfalls
          davon aus. Leider weit gefehlt! Wir befanden uns bereits
          auf der Gangway zum Schiff, als uns der Chefstewart
          anhielt. Begr&uuml;ndung: "Das muss erst gekl&auml;rt
          werden!" Also, R&uuml;ckzug aufs Festland! Dort suchte
          der Chefstewart nach verschiedenen Erkl&auml;rungen,
          warum wir nicht ohne einen Sehenden mitfahren
          k&ouml;nnten: Erst f&uuml;hrte er das Ausbooten an, das
          ohne eine Betreuungsperson schlecht m&ouml;glich sei.
          Schlie&szlig;lich k&ouml;nne sich das Service-Personal
          w&auml;hrend der &Uuml;berfahrt nicht
          ausschlie&szlig;lich um uns k&uuml;mmern. Als
          n&auml;chstes fiel ihm ein, dass wir als blinde
          Passagiere eine Begleitperson br&auml;uchten, da immer
          eine Notsituation eintreten k&ouml;nne. Hierbei legte er
          sich nach einigem Z&ouml;gern auf einen m&ouml;glichen
          Brand fest. Er untermauerte dieses Argument damit, dass
          wir allein in so einem Fall gar nicht w&uuml;ssten, wo
          die Notausg&auml;nge seien. Als diese Begr&uuml;ndung
          ihre Nachdr&uuml;cklichkeit verfehlte, erkundigte er
          sich, was wir &uuml;berhaupt auf Helgoland wollten.
          Sicherlich nicht als Tagestouristen hinfahren,
          erkl&auml;rten wir ihm. Wir nannten ihm sogar die Adresse
          unserer Unterkunft und die Besitzer. F&uuml;r ihn war es
          v&ouml;llig unverst&auml;ndlich, dass wir eine Abholung
          vom Hafen nicht bereits organisiert h&auml;tten. Und als
          er sich wieder etwas sicherer f&uuml;hlte, bemerkte er:
          "Versteht mich bitte nicht falsch, aber ich w&uuml;rde
          nicht blind sein wollen!" Leicht gesagt f&uuml;r einen
          Geburtsblinden und einen durch Krebs Erblindeten ... Wir
          versuchten so gut es ging diese "gut gemeinten" Sorgen
          auszur&auml;umen und mit positivem Material zu
          entkr&auml;ften. Allerdings hatten wir kein gro&szlig;es
          Gl&uuml;ck, da der Chefstewart zwischendurch immer wieder
          mit dem Ersten Offizier und dem Kapit&auml;n
          R&uuml;cksprache hielt. Die waren nat&uuml;rlich ganz
          seiner Meinung! Uns wurden zwei
          L&ouml;sungsvorschl&auml;ge angeboten: Entweder wir
          nahmen den Katamaran, dessen Service-Personal sich viel
          ausgiebiger um uns k&uuml;mmern k&ouml;nne; oder die
          Eltern meines Freundes, die uns zur Anlegestelle gebracht
          hatten und selbst in Cuxhaven Kurzurlaub machen wollten,
          d&uuml;rften uns unentgeltlich nach Helgoland begleiten
          und abends auch ohne Bezahlung wieder
          zur&uuml;ckfahren.</P>

          <P>Wir entschieden uns f&uuml;r den Katamaran, da wir
          unseren Urlaub weitgehend aus eigener Kraft
          bew&auml;ltigen wollten. F&uuml;r diesen berechnete uns
          die F&ouml;hrde Reederei Seetouristik nicht einmal einen
          Aufpreis, obwohl die F&auml;hre fast um die H&auml;lfte
          billiger ist. Und, um es nicht zu vergessen: Das so gut
          &uuml;ber unsere Situation informierte und hilfsbereite
          Service-Personal machte uns w&auml;hrend der Fahrt darauf
          aufmerksam, dass Essen direkt bei ihnen bestellt werden
          k&ouml;nne. Getr&auml;nke jedoch gebe es "da hinten!"
          Zwei sehr erholsame und sch&ouml;ne Wochen erwarteten uns
          nach soviel Aufruhr und Intoleranz und entsch&auml;digten
          f&uuml;r vieles, was das Personal der Reederei uns fast
          von vornherein kaputtgemacht h&auml;tte!</P>

          <P>Nathalie Sorichter</P>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

