<!DOCTYPE HTML PUBLIC "-//IETF//DD HTML 3.2//EN">

<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="AUTHOR" content=
    "Martin Voepel voepelm@t-online.de">

    <TITLE>Nachruf auf den VW K&auml;fer</TITLE>
  </HEAD>

  <BODY background="mitglieder/back01.gif" bgcolor="#8B8378" text=
  "#000000" link="#8A2BE2" alink="#8A2BE2" vlink="#8A2BE2">
    <TABLE border="10" cellpadding="15" cellspacing="15" width=
    "100%">
      <TR>
        <TD>
          <A href=
          "javascript:history.back()"><B>zur&uuml;ck</B></A> 

          <H2>Nachruf auf den VW K&auml;fer</H2>
          <BR clear="ALL">

          <CENTER>
            <IMG src="st_sedan1.jpg" alt="VW K&auml;fer" border="0"
            width="175" height="105"><IMG src="st_sedan2.jpg" alt=
            "VW K&auml;fer" border="0" width="175" height=
            "105"><IMG src="st_sedan3.jpg" alt="VW K&auml;fer"
            border="0" width="170" height="105">
          </CENTER>
          <BR>
          <BR clear="ALL">
          Am 30.07.2003 ist der letzte K&auml;fer als &Uacute;ltima
          Edici&oacute;n in Puebla, Mexiko vom Band gerollt!<BR>
          <BR>

          <P><IMG src="st_vw-1a.jpg" alt="50 Jahre K&auml;fer"
          border="0" width="368" height="140" hspace="10" vspace=
          "5" align="LEFT">Der K&auml;fer ist als KDF-Wagen (Kraft
          durch Freude-Wagen) im Jahre 1939 mehr oder weniger in
          Produktion gegangen, nach langen Vorbereitungen und
          Erprobungen. Es sind aber nur recht wenige Fahrzeuge
          gebaut worden. Es sind dann aus dem K&auml;fer f&uuml;r
          die Wehrmacht der so genannte "K&uuml;bel-Wagen" und dann
          noch der "Schwimm-Wagen" entwickelt worden. Die richtige
          Produktion ist erst nach dem Krieg langsam wieder in gang
          gekommen. Das Werk welches erst kurz vor dem zweiten
          Weltkrieg in Wolfsburg aufgebaut worden war, war zu einem
          gro&szlig;en Teil zerst&ouml;rt worden und musste nun
          wieder aufgebaut werden. Wobei es anfangs gar nicht klar
          war ob der Volkswagen &uuml;berhaupt wieder in Produktion
          gehen sollte oder nicht. Es bestand aber f&uuml;r diverse
          aufgaben ein gro&szlig;er bedarf an Fahrzeugen und die
          anderen Autowerke in Deutschland waren auch nicht besser
          dran als WV in Wolfsburg.</P>
          <BR>
          <BR>

          <P>Nach einem Besuch von Heinrich Nordhoff
          (Generaldirektor von VW) in den USA ging der richtige
          Boom auf den K&auml;fer erst so richtig los. Denn
          Nordhoff hatte in den USA verk&uuml;ndet, dass VW den
          K&auml;fer nun auch dorthin Exportieren wolle. Der
          K&auml;fer hie&szlig; zu der Zeit nur Volkswagen und
          wurde in den USA von der Allgemeinheit als Beetle =
          K&auml;fer bezeichnet. Bei VW in Wolfsburg wurde er als
          Typ 1 bezeichnet nach dem der Transporter (Typ 2) in
          Produktion gegangen war.</P>
          <BR>
          <BR>

          <CENTER>
            <IMG src="st_vw-2a.jpg" alt=
            "K&auml;fer 50Ja. / Schwimmwagen / K&uuml;belwagen / K&auml;fer"
             border="0" width="567" height="58" hspace="3" vspace=
            "3">
          </CENTER>
          <BR>
          <BR>

          <P>Es sind nach und nach in Deutschland und auch in
          anderen L&auml;ndern Werke aufgebaut worden. So auch in
          Puebla in Mexiko wo die Letzte Produktionsst&auml;tte vom
          K&auml;fer, der dort als Sedan bezeichnet wurde, war. Es
          werden in Mexiko noch der Golf und andere Wagen f&uuml;r
          die USA und Mexiko gebaut. Nur in Puebla werden der
          "neue" Beetle und das Beetle Cabrio gebaut.</P>
          <BR>
          <BR>

          <P>Der K&auml;fer hatte einen Luftgek&uuml;hlten
          4-Zylinder Boxer Heckmotor mit zuletzt 1584 cm&sup3; und
          44 PS. Angefangen hat alles bei 985 cm&sup3; und 22
          PS.</P>
          <BR>
          <BR>

          <P>Nun ist also Schluss mit dem K&auml;fer, der in einer
          so genanten &Uacute;ltima Edici&oacute;n in 3000
          Exemplaren vom Band gelaufen ist. Zus&auml;tzlich zur
          Serienausstattung hatte das Sondermodell verchromte
          Zierleisten, Wei&szlig;wandreifen und verchromte
          Radkappen und Stossf&auml;nger. Am 30. Juli war dann
          endg&uuml;ltig Schluss f&uuml;r das Auto das mit 21,6
          Mio. Exemplaren eines der meistgebauten der Welt war.</P>
          <BR>
          <BR>

          <CENTER>
            <IMG src="st_vw-3a.jpg" alt=
            "181 / KarmannGhia Coupe / Typ2 Samba Bus / Typ2 Transporter "
             border="0" width="567" height="58" hspace="3" vspace=
            "3">
          </CENTER>
          <BR>
          <BR>
          <HR width="30%">

          <P>Ich h&auml;tte gerne mehr Bilder vom K&auml;fer
          gezeigt, aber die sind leider alle in B&uuml;chern und
          die sind mit einem &copy; gesch&uuml;tzt und ich kann sie
          daher nicht verwenden. Wer genaueres &uuml;ber VW und den
          K&auml;fer erfahren m&ouml;chte, sollte in eine
          Buchhandlung gehen und sich dort entsprechende
          B&uuml;cher aussuchen. Die, die ich habe sind schon
          &auml;lter und ich wies nicht ob es sie noch gibt.<BR>
           Das gro&szlig;e Buch der Volkswagen von Lothar Boschen
          und Die VW Story von J. Sloniger beide erscheinen im
          Motorbuch Verlag.</P>
          <BR>
          <BR>
          <HR width="30%">

          <P>Die Scanns sind von Modellautos die ich besitze. Von
          Wiking, Roco, Brekina und Praline.<BR>
           Die Fotos sind von Volkswagen de M&eacute;xico von ihrer
          Side.</P>
          <BR>
          <HR>
          <BR clear="ALL">

          <CENTER>
            <A href="mitglieder/voepel.html"><IMG src=
            "mitglieder/voepel0.gif" alt="Martin Voepel" border="0"
            width="262" height="45"></A>
          </CENTER>
          <BR clear="ALL">
          <BR clear="ALL">
          <A href=
          "javascript:history.back()"><B>zur&uuml;ck</B></A> 
        </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

