<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <TITLE>
      Ein` hab ich noch...
    </TITLE>
    <META name="author" content="J&uuml;rgen Sperling">
    <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  </HEAD>
  <BODY background="jsbg.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
    <TABLE width="100%" border="0" cellspacing="0" cellpadding="10" summary="">
      <TR>
        <TD>
          <CENTER>
            <IMG src="st_einnoch.jpg" alt="st_einnoch.jpg" width="432" height="96">
          </CENTER>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <P>
            Sagt der Tourist zum Bergf&uuml;hrer: "W&auml;re nicht schlecht, wenn man hier an dieser gef&auml;hrlichen Stelle ein Gel&auml;nder installiert h&auml;tte".<BR>
             Sagt der Bergf&uuml;hrer: "Das hatten wir fr&uuml;her auch, aber die Touristen haben das Gel&auml;nder immer mit in die Tiefe gerissen...!
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Die Tankstellen wollen jetzt ihr Image &auml;ndern: Tankwarte sollen nicht mehr Tankwarte hei&szlig;en, sondern in Anlehnung an den Firmennamen z.B. Aralisten, Shellisten oder
            Essoisten.<BR>
             Nur BP weigert sich noch.
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Ich dachte, du bist in England in deinem Urlaub?" - "N&ouml;, dieser bl&ouml;de Linksverkehr! Hab ich mal zwischen Hamburg und Hannover ausprobiert. - das ist nichts f&uuml;r mich!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            "Meine Frau m&ouml;chte an die See, ich in die Berge." - "Wohin soll`s nun geh`n?"<BR>
             "So `ne Frage kann auch nur ein Junggeselle stellen!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Gibt ein reicher Gesch&auml;ftsmann einem Taxifahrer 30 Cent Trinkgeld. Dazu der Taxifahrer: "Nachdem ich gestern ihren Sohn gefahren habe, bekam ich von ihm 4 Euro Trinkgeld!"<BR>
             Darauf der Gesch&auml;ftsmann: "Das mag schon sein, denn der Junge hat einen reichen Vater, ich aber nicht!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <P>
            <BR>
          </P>
          <DIV align="CENTER">
            M&auml;nner sind wie Servietten: Entweder sie h&auml;ngen dir am Hals oder sie liegen dir im Scho&szlig;.<BR>
             Goldie Hawn
          </DIV>
          <BR>
           <BR>
           <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            <BR>
             Ruft ein Bayer bei einem Radiosender an um sich ein St&uuml;ck von den Wildbacher Nierenknaben zu w&uuml;nschen. Fragt der Radioansager: "A-Moll oder C-Moll?" - Sagt der Bayer: "Einmal
            reicht aus, zehnmal ist einfach zuviel!"<BR>
          </P>
          <HR width="100%" size="3">
          <BR>

          <P>
            "Und mein Sohn, bist du in der Schule sch&ouml;n artig gewesen?"<BR>
             "Ja Papa, was soll ich denn schon anstellen wenn ich in der Ecke stehen soll!"<BR>
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            In der Dritten Klasse soll ein Aufsatz geschrieben werden. Das Thema: "Wenn ich ein Million&auml;r w&auml;re!"<BR>
             Au&szlig;er Tim greifen alle zu ihrem F&uuml;ller. - Fragt die Lehrerin: "Was ist los Tim, warum schreibst du denn nichts?"<BR>
             Tim: "Ich warte auf meine Sekret&auml;rin!"
          </P>
          <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Steckt sich in einem besseren Restaurant ein Gast die Serviette in den Halsausschnitt.<BR>
             Sagt der Oberkellner zum Kellner: "Das geh&ouml;rt sich nicht. Machen sie das dem Gast dort bitte schonend klar!"<BR>
             Der Kellner zu dem betreffenden Gast: "Mein Herr, was darf`s denn sein? - Haare waschen oder Rasieren?"
          </P>
          <BR>
           <BR>

          <HR width="100%" size="3">
          <BR>
           "Schiebt ein junger Vater mit einem Kinderwagen durch die Stadt. Das Kind in dem Kinderwagen ist dauernt am schreien.<BR>
           Der Vater murmelt st&auml;ndig: "Bleib ruhig J&uuml;rgen. Einfach ruhig..."<BR>
           Eine Frau, die an dem Gespann von Vater und Kinderwagen vorbei geht, fragt den Vater: "Was hat denn der kleine J&uuml;rgen?"<BR>
           Sagt der Vater: "Der kleine hei&szlig;t Tim, J&uuml;rgen bin ich!"<BR>
           <BR>
           <BR>

          <HR width="100%" size="3">
          <BR>

          <P>
            Sch&auml;umend vor Wut berichtet Hans seinem Rechtsanwalt: "Mir reicht`s, ich will die Scheidung von meiner Frau!"<BR>
             "Aber warum denn?"<BR>
             Sie hat meinen Hund so abgerichtet, das er ihr die Sachen zur&uuml;ckbringt, die sie mir an den Kopf schmeisst!"
          </P>
          <HR align="center" width="75%" size="5" color="#C8C6C2">
          <BR>

          <CENTER>
            <IMG src="mitglieder/jojo.jpg" alt="JoJo" width="212" height="50"><BR>
          </CENTER>
        </TD>
      </TR>
    </TABLE>
    <BR>
  </BODY>
</HTML>

