<!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Handmade in Finland">
		<title>Toimitukselliset</title>
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<table width="100%">
							<tr>
								<td width="300"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">P&Ouml;YT&Auml;KIRJA</font></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td></td>
							</tr>
							<tr>
								<td width="300"></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">13.12.2001</font></td>
							</tr>
						</table>
						<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
							YHDISTYKSEN VUOSIKOKOUS 2001<br>
							<br>
						</font>
						<table width="100%">
							<tr>
								<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AIKA</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">29. syyskuuta kello 14.18 - 14.54</font></td>
							</tr>
							<tr>
								<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">PAIKKA</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Oulun keskusta, taloyhti&ouml;n kerhotila<br>
										Pakkahuoneenkatu 30, Oulu</font></td>
							</tr>
							<tr>
								<td valign="top" width="100"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">L&Auml;SN&Auml;</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tomi Jaskari, puheenjohtaja<br>
										Jarmo Piippo, sihteeri<br>
										15 j&auml;sent&auml; ja kokousvierasta (<a href="#liite1" target="_self">liite 1</a>)<br>
									</font></td>
							</tr>
						</table>
						<font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><br>
							<b>1</b><br>
							<b>Kokouksen avaus</b></font>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu Seilonen avasi kokouksen kello 14.18.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>2</b><br>
								<b>Valitaan kokouksen puheenjohtaja, sihteeri, kaksi p&ouml;yt&auml;kirjantarkistajaa ja tarvittaessa kaksi &auml;&auml;ntenlaskijaa</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Valittiin kokouksen puheenjohtajaksi Tomi Jaskari, sihteeriksi Jarmo Piippo sek&auml; p&ouml;yt&auml;kirjantarkistajiksi Kimmo Kannala ja Sami Yl&ouml;nen. &Auml;&auml;ntenlaskijoita ei tarvittu eik&auml; valittu.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">3<br>
									Todetaan kokouksen laillisuus ja p&auml;&auml;t&ouml;svaltaisuus</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kokouskutsut (<a href="#liite2" target="_self">liite 2</a>) on l&auml;hetetty ajoissa ja l&auml;sn&auml; on vaadittu m&auml;&auml;r&auml; henkil&ouml;it&auml; (<a href="#liite1" target="_self">liite 1</a>). Todettiin kokous lailliseksi ja p&auml;&auml;t&ouml;svaltaiseksi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>4</b><br>
								<b>Hyv&auml;ksyt&auml;&auml;n kokouksen ty&ouml;j&auml;rjestys</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hyv&auml;ksyttiin kokouksen ty&ouml;j&auml;rjestys kokouskutsun (<a href="#liite2" target="_self">liite 2</a>) mukaisena.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">5<br>
									Esitet&auml;&auml;n tilinp&auml;&auml;t&ouml;s, vuosikertomus ja tilintarkastajien lausunto</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Todettiin, ettei tilikauden 2000-2001 kirjanpitoa ole voitu viel&auml; saattaa asianmukaiseen tilinp&auml;&auml;t&ouml;skuntoon, sill&auml; tilinhoitoj&auml;rjestelm&auml;n uusiminen ja aiempien kausien tilinp&auml;&auml;t&ouml;sten valmistelu on yh&auml; kesken. P&auml;&auml;tettiin siirt&auml;&auml; niiden k&auml;sittelyn loppuun saattaminen alkavalle kaudelle 2001-2002, kev&auml;&auml;ll&auml; tai kes&auml;ll&auml; 2002 j&auml;rjestett&auml;v&auml;&auml;n ylim&auml;&auml;r&auml;iseen kokoukseen, jonka j&auml;lkeen tilinhoito siirtyy Jarmo Piipon hoidettavaksi.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tilintarkastajat Janne Lardot ja Pasi Lagerroos ilmoittivat etuk&auml;teen vuosikokoukselle, etteiv&auml;t voi antaa lausuntoa, koska tilanne on pysynyt samana viime vuodesta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Todettiin Janne Sir&eacute;nin tekem&auml;n selvitysty&ouml;n perusteella, ettei aiempien kausien tilinp&auml;&auml;t&ouml;sten tekemiseen tarvita yhdistyksen kyseisten vuosien hallitusten j&auml;senien allekirjoituksia, vaan meneill&auml;&auml;n olevan kauden hallituksen nimet riitt&auml;v&auml;t niidenkin vahvistamiseen yhdistyskokouksessa. T&auml;m&auml; helpottaa olennaisesti vanhojen tilinp&auml;&auml;t&ouml;sten valmistelua tilij&auml;rjestelm&auml;n uusimista varten.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jarmo Piippo esitti yhdistyksen vuosikertomuksen (<a href="#liite3">liite 3</a>).</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">6<br>
									P&auml;&auml;tet&auml;&auml;n tilinp&auml;&auml;t&ouml;ksen vahvistamisesta ja vastuuvapauden my&ouml;nt&auml;misest&auml;</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edellisen kohdan p&auml;&auml;t&ouml;sten mukaisesti lyk&auml;ttiin tilinp&auml;&auml;t&ouml;sten vahvistaminen ja vastuuvapauden my&ouml;nt&auml;minen aiemmille hallituksille teht&auml;v&auml;ksi my&ouml;hemmin j&auml;rjestett&auml;v&auml;ss&auml; ylim&auml;&auml;r&auml;isess&auml; yhdistyskokouksessa.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">7<br>
									Vahvistetaan toimintasuunnitelma, tulo- ja menoarvio sek&auml; liittymis- ja j&auml;senmaksun suuruus</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu Seilonen esitti yhdistyksen toimintasuunnitelman (<a href="#liite4">liite 4</a>), joka vahvistettiin.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tulo- ja menoarvion osalta todettiin, ett&auml; j&auml;senmaksutulot todenn&auml;k&ouml;isesti edelleen pienenev&auml;t alkavalla kaudella, ja muita tuloja voi olla melko vaikea hankkia vaarantamatta saavuttamaamme yleishy&ouml;dyllisen yhdistyksen asemaa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Patentti- ja rekisterihallituksen vaatimien korjattujen s&auml;&auml;nt&ouml;ehdotusten mukaan j&auml;senm&auml;&auml;r&auml;n laskeminen muuttuu, koska j&auml;senyys loppuu vasta jos j&auml;senmaksu on j&auml;tetty suorittamatta kahden vuoden ajalta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen tilin siirtoa uuteen tilipankkiin edellisen vuosikokouksen p&auml;&auml;t&ouml;ksen mukaisesti ei ole viel&auml; voitu tehd&auml;, koska siihen vaadittaisiin voimassaoleva yhdistysrekisteriote, jota ei viel&auml; ole, koska s&auml;&auml;nt&ouml;muutosten k&auml;sittely on yh&auml; kesken Patentti- ja rekisterihallituksessa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">J&auml;senmaksuksi vuodelle 2002 sovittiin yksimielisesti 11 euroa. Todettiin, ettei markkam&auml;&auml;r&auml;isi&auml; p&auml;&auml;t&ouml;ksi&auml; saa lain mukaan en&auml;&auml; tehd&auml;, joten maksulle ei voitu en&auml;&auml; m&auml;&auml;ritell&auml; hintaa markkoina. Erillist&auml; liittymismaksua yhdistykselle ei edelleenk&auml;&auml;n asetettu.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">8<br>
									Valitaan hallituksen puheenjohtaja ja muut j&auml;senet</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Valittiin uusi hallitus (<a href="#liite5">liite 5</a>) paikalla olevista sek&auml; etuk&auml;teen suostumuksensa antaneista henkil&ouml;ist&auml;.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">9<br>
									Valitaan tilintarkastaja ja h&auml;nelle yksi varamies</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tilintarkastajaksi valittiin Janne Lardot ja varamieheksi Pasi Lagerroos. Molemmat ovat ennen kokousta antaneet suostumuksensa jatkaa teht&auml;v&auml;ss&auml;.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">10<br>
									K&auml;sitell&auml;&auml;n muut esille tulevat asiat</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kahden vuoden takaisen Saku 99 -tapahtuman talouden osalta kyseltiin, saiko yhdistys tapahtumassa lahjoituksia. Tarkkoja tietoja ei kokouksessa ollut saatavilla, mutta Tomi Jaskari ja Anu Seilonen esittiv&auml;t arviona muutaman sadan markan summan. Kysyttiin my&ouml;s, auttoiko Petro Tyschtschenko tapahtuman j&auml;rjest&auml;mist&auml; rahallisesti, mihin vastattiin ei, mutta h&auml;n j&auml;rjesti Amigalta paljon promootiotuotteita ja palkintolahjoituksia yhdistykselle.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Todettiin, ett&auml; vastikkeetta EU:n ulkopuolisista maista saaduista tavaroista voidaan tapauksesta riippuen joutua maksamaan tullia, joten mahdollisen maksun suuruus ja tarkoituksenmukaisuus tuotteeseen n&auml;hden on pyritt&auml;v&auml; selvitt&auml;m&auml;&auml;n ennen kuin p&auml;&auml;tet&auml;&auml;n voidaanko tavara ottaa vastaan.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Rahoituskeinoja toiminnan yll&auml;pit&auml;miseksi ja mahdollisesti halvempia paikkoja tapahtumien j&auml;rjest&auml;miseen pyrit&auml;&auml;n jatkossa etsim&auml;&auml;n aiempaa laajemmin. Kimmo V&auml;&auml;riskoski tarjoutui kokouksessa avustamaan hallitusta yhdistyslakiasioissa.</font></p>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">11<br>
									Kokouksen p&auml;&auml;tt&auml;minen</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Puheenjohtaja p&auml;&auml;tti kokouksen kello 14.54.</font></p>
						<table border="0" cellpadding="4" cellspacing="0">
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tomi Jaskari</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jarmo Piippo</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">puheenjohtaja</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">sihteeri</font></td>
							</tr>
						</table>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">12<br>
									P&ouml;yt&auml;kirjan tarkistus</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Olemme tarkistaneet p&ouml;yt&auml;kirjan ja todenneet sen vastaavan kokouksen kulkua.</font></p>
						<table border="0" cellpadding="4" cellspacing="0">
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kimmo Kannala</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Sami Yl&ouml;nen</font></td>
							</tr>
							<tr>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">p&ouml;yt&auml;kirjantarkistaja</font></td>
								<td><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">p&ouml;yt&auml;kirjantarkistaja</font></td>
							</tr>
						</table>
						<p><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">13<br>
									Liitteet</font></b></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b><a name="liite1"></a>Liite 1 - osallistujat</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tapio Koivuniemi, Seppo Typp&ouml;, Ari Typp&ouml;, Sami Yl&ouml;nen, Kimmo Kannala, Kimmo V&auml;&auml;riskoski, Timo Karjalainen, Sirpa P&ouml;yh&ouml;nen, Tuomo M&auml;mmel&auml;, Esa Haapaniemi, Marko Lustim&auml;ki, Kirsi R., &quot;Boogie&quot;, Tomi Jaskari, Jarmo Piippo, Anu Seilonen, Mikael Ervasti.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b><a name="liite2"></a>Liite 2 - Kokouskutsu</b></font></p>
						<pre><font size="2">SUOMEN AMIGA-K&Auml;YTT&Auml;J&Auml;T RY.                         VUOSIKOKOUSKUTSU

                                                    19.9.2001


Hyv&auml; Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n j&auml;sen,

Kutsumme teid&auml;t yhdistyksen s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;iseen vuosikokoukseen, joka
j&auml;rjestet&auml;&auml;n Oulussa lauantaina 29. syyskuuta kello 14 alkaen. Kokous
on avoinna kaikille, ja paikan p&auml;&auml;ll&auml; on tarjolla virvoitusjuomia ja
leppoisaa seuraa. Kokous etenee oheisen esityslistan mukaisesti.

1. Kokouksen avaus.
2. Valitaan kokouksen puheenjohtaja, sihteeri, kaksi p&ouml;yt&auml;kirjantarkistajaa
    ja tarvittaessa kaksi &auml;&auml;ntenlaskijaa.
3. Todetaan kokouksen laillisuus ja p&auml;&auml;t&ouml;svaltaisuus.
4. Hyv&auml;ksyt&auml;&auml;n kokouksen ty&ouml;j&auml;rjestys.
5. Esitet&auml;&auml;n tilinp&auml;&auml;t&ouml;s, vuosikertomus ja tilintarkastajien lausunto.
6. P&auml;&auml;tet&auml;&auml;n tilinp&auml;&auml;t&ouml;ksen vahvistamisesta ja vastuuvapauden
    my&ouml;nt&auml;misest&auml;.
7. Vahvistetaan toimintasuunnitelma, tulo- ja menoarvio sek&auml; liittymis-
    ja j&auml;senmaksun suuruus.
8. Valitaan hallituksen puheenjohtaja ja muut j&auml;senet.
9. Valitaan tilintarkastaja ja h&auml;nelle yksi (1) varamies, tilintarkastajan
    toimikausi on 1.10. - 30.9.
10. K&auml;sitell&auml;&auml;n muut esille tulevat asiat.
11. Kokouksen p&auml;&auml;tt&auml;minen.

Ohjelmassa on kokouksen j&auml;lkeen, arviolta kello 15-16 alkaen, Amiga-
aiheinen videotuokio, jossa py&ouml;rii mm. Deathbed Vigil ja muita harvemmin
n&auml;htyj&auml; Amiga-videointeja. Lis&auml;ksi paikan p&auml;&auml;ll&auml; on kokeiltavissa Saku 2001
-tapahtumassakin esill&auml; ollut AmigaDE Playerin demoversio. Ensi vuoden
j&auml;senmaksun voi maksaa kokouksessa, ja lis&auml;ksi myynniss&auml; ovat Saku-CD-ROM
#3 ja Saku 2001 -tapahtuman teema-CD-levy Saku 2001 Theme 40 markan
kappalehintaan. Tapahtumaan saapuu my&ouml;s suomalainen Amiga-j&auml;lleenmyyj&auml;
Gentle Eye Ky tuotteineen.

Vuosikokous j&auml;rjestet&auml;&auml;n nyt ensimm&auml;ist&auml; kertaa Oulussa. Kokouspaikka on
Pakkahuoneenkatu 30, taloyhti&ouml;n kerhotila Pakkahuoneenkadun ja Koulukadun
kulmassa sijaitsevassa rakennuksessa. Kokoustila on Oulun keskustassa
lyhyen k&auml;velymatkan p&auml;&auml;ss&auml; Oulun juna- ja linja-autoasemilta. Tarkemmat
saapumisohjeet kokouspaikalle valokuvineen l&ouml;ytyv&auml;t pian yhdistyksen
kotisivulta osoitteesta http://saku.amigafin.org. Sinne p&auml;ivitet&auml;&auml;n
tarvittaessa my&ouml;s lis&auml;tietoja kokouksesta. Puhelimitse ja s&auml;hk&ouml;postitse
lis&auml;tietoja antaa Anu Seilonen, 040 836 7808, thoriel@sci.fi.

Tervetuloa!

Yst&auml;v&auml;llisin terveisin,

Anu Seilonen
Puheenjohtaja
Suomen Amiga-k&auml;ytt&auml;j&auml;t ry.
</font></pre>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b><a name="liite3"></a>Liite 3 - Vuosikertomus 2000-2001</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikertomus 2000-2001</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001 -tapahtuma pidettiin tiedekeskus Heurekassa 1. syyskuuta 2001. Tapahtumassa vieraili Cloanton johtaja Michael C. Battilana, joka esitteli Amiga Forever -emulaation toimintaa ja erikoisominaisuuksia k&auml;yt&auml;nn&ouml;n sovellusten avulla. Yhdistys esitteli vastik&auml;&auml;n julkaistua AmigaDE Party Pack -sovelluskehitinpakettia, ja n&auml;ht&auml;v&auml;n&auml; oli my&ouml;s Amiga Inc.:n tapahtumaa varten toimittama AmigaDE Playerin demoversio. Tapahtumaohjelmaan kuului lis&auml;ksi Amiga-demomaratoni auditoriossa, Payback-pelikilpailu, Mediator PCI:n esittely ja suosiota saanut Vaporwaren ohjelmien rekister&ouml;intipalvelu. Kokeiltavina olivat my&ouml;s ImageFX- ja Aladdin 4D -ohjelmistot, Shogo-peli ja AmigaOS 3.9 -k&auml;ytt&ouml;j&auml;rjestelm&auml;. Tilaisuudessa julkistettiin Saku-CD-ROM-levyn kolmas painos ja Saku 2001 Theme CD-levy, jolla on tapahtuman virallinen tunnusmusiikki sek&auml; extended-mix-versiot kappaleesta. Tapahtuma her&auml;tti kiinnostusta my&ouml;s eri medioissa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-lehden julkaisurytmi pystyttiin pit&auml;m&auml;&auml;n suunnitellun mukaisena. Lehden HTML-painos muodostui laiteriippumattomana ja helposti tavoitettavana verkkojulkaisuna varsin suosituksi, joten lehden vanhan levykeversion julkaisusta ja kotiinkannosta p&auml;&auml;tettiin luopua. P&auml;&auml;t&ouml;s todettiin varsin pian oikeaksi, sill&auml; se v&auml;hensi ratkaisevasti toimituksen ty&ouml;m&auml;&auml;r&auml;&auml;, ja poisti monia hankalia rajoituksia liittyen kuvamateriaalin k&auml;ytt&ouml;&ouml;n ja pitkien artikkelien taittoon.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen kotisivut Internetiss&auml; jatkoivat toimintaansa yhdistyksen julkisivuna ja Saku-lehden p&auml;&auml;asiallisena levityskanavana. Kotisivuille avattiin AmigaFin.org Amiga-portaaliin oma osoite, josta sivut l&ouml;ytyv&auml;t aina yhdest&auml; tutusta paikasta, riippumatta niiden fyysisest&auml; sijainnista.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">J&auml;sentavoitetta ei saavutettu, sill&auml; j&auml;senm&auml;&auml;r&auml; j&auml;i alle sadan. Aiemmin p&auml;&auml;tettyjen tilinhoidon uudistusten toteuttaminen ja tilipankin vaihto sek&auml; s&auml;&auml;nt&ouml;muutosten vahvistaminen viiv&auml;styiv&auml;t seuraavalle kaudelle, sill&auml; rekisterimuutoskaavakkeiden k&auml;sittely on yh&auml; kesken Patentti- ja rekisterihallituksessa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuosikokous 2001 j&auml;rjestettiin syyskuussa Oulussa. Kokouksen yhteydess&auml; j&auml;rjestettiin Amiga-aiheista ohjelmaa, kuten videotuokio, AmigaDE Playerin esittely, luettavana Amiga-lehti&auml; ja paikalla oli my&ouml;s Amiga-j&auml;lleenmyyj&auml; tuotteineen. T&auml;m&auml; oli ensimm&auml;inen kerta kun yhdistys j&auml;rjesti tilaisuuden p&auml;&auml;kaupunkiseudun ulkopuolella.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b><a name="liite4"></a>Liite 4 - Toimintasuunnitelma 2001-2002</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n toimintasuunnitelma vuodelle 2001-2002</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistys jatkaa toimintaansa perusajatuksenaan tukea suomalaisia Amiga-k&auml;ytt&auml;ji&auml; ja edist&auml;&auml; Amiga-tietouden tuntemusta. Ensisijaisena tavoitteena n&auml;ilt&auml; osin on seuraavan sukupolven Amiga-teknologian tuntemuksen ja n&auml;kyvyyden lis&auml;&auml;minen sek&auml; j&auml;senten keskuudessa yhdistyksen omia tiedotuskanavia k&auml;ytt&auml;en, ett&auml; mahdollisuuksien salliessa my&ouml;s muiden julkisten medioiden avulla suuremmallekin yleis&ouml;lle.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistys pyrkii seuraamaan uudistuvien Amiga-markkinoiden tilanteen kehittymist&auml; ja etsim&auml;&auml;n tilaisuuksia tuoda j&auml;senten n&auml;ht&auml;ville tuoreimpia saatavissa olevia ohjelmisto- ja laiteratkaisuja. Tavoitteen saavuttamiseksi jatketaan suorien yhteyksien yll&auml;pitoa ulkomaille ja Amiga-yhti&ouml;&ouml;n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Classic Amigan markkinaosuuden pienuuden ja tukipalveluiden heikon saatavuuden takia on entist&auml; t&auml;rke&auml;mp&auml;&auml;, ett&auml; yhdistys jatkaa totuttuun tapaan aktiivista toimintaansa my&ouml;s Classic-laitekannan k&auml;ytt&auml;jien keskin&auml;isen yhteydenpidon ja avunannon kanavana.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen perustoimintojen yll&auml;pitoa jatketaan, yhdistystoiminnan lakis&auml;&auml;teisi&auml; velvoitteita noudattaen. Aiempien tilikausien tekeill&auml; olevien, kirjanpitouudistuksen mukaisesti laadittujen tilinp&auml;&auml;t&ouml;sten valmistuttua j&auml;rjestet&auml;&auml;n ylim&auml;&auml;r&auml;inen yhdistyskokous, jossa my&ouml;nnet&auml;&auml;n vastuuvapaus aiemmille hallituksille.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">S&auml;&auml;nt&ouml;m&auml;&auml;r&auml;inen vuosikokous j&auml;rjestet&auml;&auml;n elo-syyskuussa 2002.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-lehden julkaisua jatketaan. Lehti on entiseen tapaan luettavissa yhdistyksen kotisivuilla, sek&auml; saatavissa my&ouml;s pakattuna versiona off-line-tilassa lukemista varten. Lehti ilmestyy nelj&auml;nnesvuosittain, toimituksen erikseen m&auml;&auml;r&auml;&auml;min&auml; julkaisup&auml;ivin&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edellisen kauden hallitus esitt&auml;&auml; vuosikokoukselle jatkavansa aktiivisten j&auml;sentens&auml; osalta l&auml;hes samanlaisena. Hallitus julkaisee kokouksistaan ja keskusteluistaan sek&auml; yhdistyksen kokouksista muistioita ja p&ouml;yt&auml;kirjoja kotisivuilla ja Saku-lehdess&auml;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistys tutkii mahdollisuutta j&auml;rjest&auml;&auml; varojen, henkil&ouml;resurssien ja tarjolla olevan tapahtumasis&auml;ll&ouml;n niin salliessa uuden Saku-tapahtuman vuoden 2002 aikana - todenn&auml;k&ouml;isesti kuitenkin aikaisempaa pienimuotoisempana.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Lis&auml;ksi pienimuotoisten k&auml;ytt&auml;j&auml;tapaamisten j&auml;rjest&auml;mist&auml; pyrit&auml;&auml;n laajentamaan mahdollisuuksien rajoissa my&ouml;s p&auml;&auml;kaupunkiseudun ulkopuolelle.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b><a name="liite5"></a>Liite 5 - Yhdistyksen hallitus 2001-2002</b></font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Varsinaiset j&auml;senet:</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Anu Seilonen, puheenjohtaja<br>
								Terho Henriksson, varapuheenjohtaja<br>
								Jarmo Piippo, sihteeri<br>
								Tomi Jaskari<br>
								Timo Kemppaala</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Varaj&auml;senet:</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Paula-Christiina Wirtanen<br>
								Valtteri Murto<br>
								Ville Sarell<br>
								Kimmo V&auml;&auml;riskoski</font></p>
					</td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>