<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Toimitukselliset</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
			</font><br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Vuosi 2001 avasi tien t&auml;htiin</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Jarmo Piippo &lt;<a href="mailto:jarmo.piippo@pp.nic.fi">jarmo.piippo@pp.nic.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuin varkain oli aiempien vuosien myllerrys Amigan omistajavaihdoksineen p&auml;&auml;ssyt j&auml;lleen kerran vaipumaan takaisin puuduttavan tasaiseksi odotukseksi, kunnes alkusyksy vihdoin ker&auml;si kotimaiset amigistit kauan haaveiltuun uuteen Saku-tapahtumaan...</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Vahva suunnann&auml;ytt&auml;j&auml;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uuden vuosituhannen puolella entiseen tapaansa t&auml;ydell&auml; voimalla jatkuneen toiminnan my&ouml;t&auml; on varmasti viimeisillekin ep&auml;ilij&ouml;ille jo valjennut, ettei Amiga-k&auml;ytt&auml;j&auml;yhteis&ouml; ole mik&auml;&auml;n hetkellinen ilmi&ouml;, vaan vakaa kiintot&auml;hti IT-maailman taivaalla. My&ouml;s vuonna 1993 Saku-lehden muodossa alkusoittonsa saanut ikioma Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:mme on - kuten sanonta kuuluu - tullut j&auml;&auml;d&auml;kseen.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuosi 2001 alkoi uudistuneessa kotisivuosoitteessa julkaistun Saku #35:n voimin. Lehti oli ensimm&auml;inen vain html-muodossa julkaistu numero levykelehden j&auml;&auml;ty&auml; edellisen vuoden lopussa viett&auml;m&auml;&auml;n ansaittuja el&auml;kep&auml;ivi&auml;&auml;n monien haikeiden j&auml;&auml;hyv&auml;isten saattelemana. Lehden julkaisu jatkui l&auml;pi vuoden normaaliin tapaan Anu Seilosen ahertaessa p&auml;&auml;toimittajana. Toimituksen Internet-yhteyksiss&auml; v&auml;lill&auml; esiintyneet ongelmat ja muut yll&auml;tt&auml;v&auml;t sattumukset aiheuttivat toki joidenkin numeroiden julkaisuun viiv&auml;styksi&auml;, mutta lopputulos oli kuitenkin aina odottamisen arvoinen.</font>
						<div align="center">
							<p><a href="http://foorumi.amigafin.org" target="_blank"><img src="kuvat/saku_foorumi.gif" width="298" height="178" border="0"></a></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amigistit saivat Internetiin uuden suomenkielisen www-keskustelupaikan, kun edellisen vuoden lopulta asti ty&ouml;stett&auml;v&auml;n&auml; ollut Saku-foorumi avattiin k&auml;ytt&auml;jille 25. helmikuuta. Alkukangertelua ei ehditty pahemmin n&auml;hd&auml;, vaan viestim&auml;&auml;r&auml;t l&auml;htiv&auml;t nopeasti kasvuun. Terho Henrikssonin toteuttama ja yhdistyksen hallitusj&auml;senten yhdess&auml; suunnittelema foorumirakenne osoittautui k&auml;ytt&auml;jien m&auml;&auml;r&auml;st&auml; ja tyytyv&auml;isyydest&auml; p&auml;&auml;tellen onnistuneeksi. Foorumin lyhyt osoite (<a href="http://foorumi.amigafin.org" target="_blank">foorumi.amigafin.org</a>) kannattaa painaa mieleen, sill&auml; foorumin muuttaa toiseen paikkaan vuoden alussa, ja sen suora osoite tulee muuttuumaan.<br>
								<br>
							</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Hieman my&ouml;hemmin kev&auml;&auml;ll&auml; p&auml;&auml;stiin lopultakin ylpeilem&auml;&auml;n omalla kiinte&auml;ll&auml; www-osoitteella huhtikuussa k&auml;ytt&ouml;&ouml;n otetun portaaliosoitteen (<a href="http://saku.amigafin.org" target="_blank">saku.amigafin.org</a>) my&ouml;t&auml;. Lopultakin saimme helposti muistettavan osoitteen, joka pysyy aina vakiona, vaikka sivujen fyysist&auml; sijaintia jouduttaisiinkin joskus muuttamaan. Tosin monin paikoin on uutisissa ja mediassa n&auml;kynyt edelleen olevan k&auml;yt&ouml;ss&auml; sivujen suora osoite, vaikka yhdistys on esitt&auml;nyt toivomuksen, ett&auml; vain uusi portaaliosoite esiintyisi julkaisuissa. Ehk&auml;p&auml; oikea k&auml;yt&auml;nt&ouml; kuitenkin levi&auml;&auml; ajan my&ouml;t&auml; paremmin ihmisten tietoisuuteen, ja p&auml;&auml;asiahan kuitenkin on, ett&auml; t&auml;ll&auml; kertaa opeteltavana on se lopullinen osoite, jonka ei en&auml;&auml; tarvitse pel&auml;t&auml; vaihtuvan kovin &auml;kki&auml; ja joka on my&ouml;s silm&auml;&auml; miellytt&auml;v&auml;n lyhyt ja tyylik&auml;s.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Ja sitten lahkeet lepattamaan</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<div align="center">
							<br>
							<img src="kuvat/Lauantai034.jpg" width="300" height="200" border="0" alt=" "></div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Vuoden kohokohdaksi muodostui kiistatta yhdistyksen 1. syyskuuta Tiedekeskus Heurekassa Vantaalla j&auml;rjest&auml;m&auml; Saku 2001 -tapahtuma. Vaikka suunnitelmien mukaisista ulkomaisista vieraista suurin osa peruuntuikin, saatiin onneksi sent&auml;&auml;n Cloanton johtaja Michael C. Battilana mukaan, ja h&auml;n antoikin tapahtumalle t&auml;rke&auml;n ripauksen kansainv&auml;list&auml; tunnelmaa. K&auml;vij&ouml;iden kanssa rupattelun lis&auml;ksi h&auml;n esitteli sek&auml; auditoriotilaisuudessa ett&auml; tapahtumatilan puolella Amiga Forever -emulaation k&auml;ytt&ouml;&auml; kannettavassa tietokoneessa. Muita osallistujia olivat k&auml;vij&ouml;iden suureksi iloksi kotimaiset Amiga-j&auml;lleenmyyj&auml;t Gentle Eye Ky ja Broadline Oy, joiden p&ouml;ytien ymp&auml;rill&auml; k&auml;vi aiemmista tapahtumista tuttu innokas h&auml;lin&auml;. Yhdistyksen omilla p&ouml;ydill&auml; n&auml;htiin esittelyss&auml; mm. Amigan uuden AmigaDE -tuotelinjan edustajia, ja muutakin tapahtumaohjelmaa oli valmisteltu koko p&auml;iv&auml;n varalle. Tilaisuuden viimeisteli todellinen harvinaisuus: tapahtuman ikioma virallinen tunnusmusiikki, joka oli saatavilla my&ouml;s CD-levyll&auml; tapahtumassa. Yhdistys hy&ouml;dynsi j&auml;lleen my&ouml;s Interneti&auml;, jotta ne jotka eiv&auml;t p&auml;&auml;sseet tulemaan paikalle saivat ihastella kahden kameran voimin tuotettua webcam-kuvaa yhdistyksen kotisivuilla ja jutella k&auml;vij&ouml;iden kanssa IRC-kanavalla. Saku 2001 -tapahtumasta voit lukea lis&auml;&auml; <a href="../ajankohtaiset/hakemisto.html" target="_self">toisaalta t&auml;st&auml; lehdest&auml;</a>.</font></p>
						<div align="center">
							<p><a href="vuosikokous.html" target="_self"><img src="kuvat/pieni_vuosi2001_22.jpg" width="256" height="192" border="0"></a></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen s&auml;&auml;nt&ouml;m&auml;&auml;r&auml;inen vuosikokous pidettiin 29. syyskuuta Oulun keskustassa, taloyhti&ouml;n kerhotilassa. Kokous oli ensimm&auml;inen yhdistyksen p&auml;&auml;kaupunkiseudun ulkopuolella j&auml;rjest&auml;m&auml; tilaisuus. Kokouksen yhteyteen j&auml;rjestettiin edellisen vuoden tapaan virvoketarjoilu sek&auml; Amiga-aiheista ohjelmaa, kuten videotuokio ja AmigaDE Playerin esittely, ja k&auml;vij&ouml;iden luettavana oli Amiga-lehti&auml;. Paikalla oli my&ouml;s Amiga-j&auml;lleenmyyj&auml; Gentle Eye Ky tuotteineen. Kokouksen k&auml;yt&auml;nn&ouml;n j&auml;rjestelyist&auml; vastasi pienen oululaisiskuryhm&auml;n kanssa hallituksen puheenjohtaja Anu Seilonen, joka urakkansa lis&auml;ksi ehti my&ouml;s toteuttaa kokouspaikan l&auml;hestymisoppaan yhdistyksen kotisivuille. Kokouksessa toimi j&auml;lleen sihteerin&auml; Jarmo Piippo ja puheenjohtajana Helsingist&auml; asti paikalle matkannut yhdistyksen perustajaj&auml;sen Tomi Jaskari. Vuosikokouksesta voit lukea lis&auml;&auml; <a href="hakemisto.html">Toimitukselliset-palstalta</a>.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>&quot;Jatkuu ensi numerossa&quot;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uudelle vuodelle 2002 on yhdistyksen puuhakasvoille ja avustajille tiedossa j&auml;lleen runsain mitoin tekemist&auml;, sill&auml; rankasta uurastuksesta huolimatta ei mittavimpia teht&auml;vi&auml; saatu viel&auml; viety&auml; loppuun asti. Vuosikokouksen 2000 p&auml;&auml;t&ouml;ksell&auml; aloitettu tilinhoitoj&auml;rjestelm&auml;n uusiminen saatiin Janne Sir&eacute;nin urakoinnin ansiosta jo varsin hyv&auml;lle mallille, mutta vanhoille tilikausille 1994-1999 uuden mallin mukaan tehtyj&auml; tilinp&auml;&auml;t&ouml;ksi&auml; ei ehditty tehd&auml; ja hyv&auml;ksytt&auml;&auml;. Niiden valmistumisen j&auml;lkeen ty&ouml;t&auml; jatkaa Jarmo Piippo nykyisen hallituksen aikaisten kausien osalta. Homma on t&auml;h&auml;n menness&auml; kielt&auml;m&auml;tt&auml; niellyt jo vuosia, muttei asiaan mit&auml;&auml;n pikaratkaisuakaan ole, sill&auml; paperity&ouml;n monimutkaisuus ja pyk&auml;lien noudattamisen vaatima tarkkuus sy&ouml;v&auml;t aikaa. Kun byrokratian ammattilaisiltakin voi yhdistysasioiden virallinen k&auml;sittely vied&auml; kuukausia, ei liene kummakaan ett&auml; harrastajavoimin vapaa-ajalla yll&auml;pidetyss&auml; toiminnassa suuret kirjanpito-operaatiot nielev&auml;t paljon ty&ouml;tunteja.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku-lehden julkaisu jatkuu edelleen tuttuun tyyliin, vaikka lehden ilmestymisv&auml;li&auml; joudutaankin ainakin seuraavan numeron osalta hieman pident&auml;m&auml;&auml;n. Toimitus tarvitsee nimitt&auml;in v&auml;lill&auml; pient&auml; heng&auml;hdystaukoakin, semminkin kun t&auml;ll&auml; hetkell&auml; n&auml;ytt&auml;&auml; samojen henkil&ouml;iden hoidettavaksi kasaantuvan ylim&auml;&auml;r&auml;isi&auml; teht&auml;vi&auml; muualtakin kuin vain yhdistyksen suunnalta. Aktiivista kirjoittaja-ainesta l&ouml;ytyy sent&auml;&auml;n edelleen jonkin verran, tosin laskusuhdanne on ollut viime vuosina selke&auml;sti kaikkien n&auml;ht&auml;vill&auml; lehden ohenemisena. &Auml;l&auml; hyv&auml;ksy tilannetta, muuta sit&auml; itse tarttumalla n&auml;ppikseen! Tilaisuutesi on tullut, sill&auml; nyt ehdit rauhassa valmistella artikkelin tai vaikka useamman ennen seuraavan Sakun ilmestymist&auml;.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuten aikaisempinakaan vuosina, nytk&auml;&auml;n ei t&auml;ss&auml; vaiheessa vuotta ole viel&auml; alkuunkaan riitt&auml;v&auml;sti tietoa sitovien p&auml;&auml;t&ouml;sten tekemiseen uuden Saku-tapahtuman j&auml;rjest&auml;misen mahdollisuuksista. Kokemusta yhdistys kuitenkin sai ker&auml;tty&auml; Saku 2001:n aikana runsaasti, ja mik&auml; viel&auml; hienompaa, tapahtuma todisti, ett&auml; innokkaita ja vastuunsa tuntevia ihmisi&auml; l&ouml;ytyy yh&auml; tarpeeksi paljon kunnon j&auml;rjest&auml;j&auml;tiimin kasaamiseksi.  Jos hankaluuksia joltakin suunnalta tulee, niin ne todenn&auml;k&ouml;isesti hiipiv&auml;t kimppuumme k&auml;ytt&auml;en Amiga-markkinoiden heilahteluja tai yhdistyksen tulojen pienenemist&auml; aseenaan. K&auml;vi niin tai n&auml;in, yhdistyksen vuosikokous on kuitenkin joka tapauksessa ohjelmassa, ja se j&auml;rjestet&auml;&auml;n elo-syyskuussa 2002.<br>
							<br>
						</font><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Lopuksi viel&auml; kerran mittaamattoman suuret kiitokset kaikille vuoden 2001 toiminnassa mukana olleille ihmisille, nimi&auml; mainitsematta, aakkosj&auml;rjestyksess&auml;. :-)</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>&quot;K&auml;yt&auml; Voimaa, Saku!&quot;</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yhdistyksen aikaisempien vuosien historiasta l&ouml;ytyy tietoa Saku-lehden numeroista #35 (1/2001), #31 (1/2000), #27 (1/99) ja #25 (2/98).</font></td>
				</tr>
			</table>
			<br>
			<font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica" color="#191970">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>