<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikokous 2001</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Anu Seilonen &lt;<a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a>&gt;</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Suomen Amiga-k&auml;ytt&auml;j&auml;t ry:n vuosikokoukset ovat perinteisesti olleet muutakin kuin pelkk&auml;&auml; s&auml;&auml;nt&ouml;pyk&auml;lien tahtiin paukkuvaa nuijintaa. Niiden yhteyteen on aina pyritty j&auml;rjest&auml;m&auml;&auml;n muutakin ohjelmaa, ja niinp&auml; ne ovatkin aina enemm&auml;n k&auml;ytt&auml;j&auml;tapaamisia kuin pelkki&auml; kokouksia. Toki velvoitteet hoidamme yhdistykselt&auml; vaaditulla tavalla, pyrimmeh&auml;n olemaan vastuunsa hoitava yhdistys, mutta kun virallinen osuus on hoidettu, jatkuu vapaamuotoisempi meno. T&auml;ll&auml;kin kertaa tarjolla oli leppoisan seuran lis&auml;ksi pikkupurtavaa ja virvokkeita, Amiga-aiheista ohjelmaa ja Amiga-j&auml;lleenmyyj&auml; tuotteineen. Ensimm&auml;ist&auml; kertaa yhdistyksen historiassa tapahtumia j&auml;rjestettiin p&auml;&auml;kaupunkiseudun ulkopuolella:&nbsp;vuosikokous pidettiin Oulussa, jossa er&auml;&auml;nkin vesselin mukaan asuu &quot;95% Suomen amigisteista&quot;.</font></td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black" face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Pohjoisen iskuryhm&auml; vauhdissa j&auml;lleen</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Jo edellisen vuosikokouksen aikoihin todettiin, ett&auml; vastaisuudessa tulisi l&ouml;yt&auml;&auml; muita paikkoja vuosikokousten j&auml;rjest&auml;miselle. Samoin el&auml;teltiin ajatusta tapahtumien j&auml;rjest&auml;misest&auml; p&auml;&auml;kaupunkiseudun ulkopuolella. Vuosikokous 2001 l&auml;im&auml;ytti kaksi k&auml;rp&auml;st&auml; yhdell&auml; iskulla:&nbsp;se pidettiin sek&auml; uusissa tiloissa ett&auml; kaukana pohjolassa: Oulussa, jossa j&auml;&auml;karhut kaduilla leikki&auml; ly&ouml;. No, leikki sikseen. Kokous oli j&auml;lleen yksi koitos pohjoisen iskuryhm&auml;lle, joka jo edellisen vuosikokouksen aikaan teki sammakon ty&ouml;n l&auml;htem&auml;ll&auml; reissuun susirajalta ja kyyditsem&auml;ll&auml; siin&auml; sivussa Amiga-j&auml;lleenmyyj&auml; Gentle Eyen Boogien kokouspaikalle.</font>
						<div align="center">
							<p><img src="kuvat/pieni_vuosi2001_01.jpg" width="256" height="192" border="0"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Uudeksi kokoustilaksi j&auml;rjestyi jo edellisen kokouksen aikaan syyniss&auml; ollut taloyhti&ouml;n kerhotila. Kokous saikin harvinaisen arvokkaat puitteet, sill&auml; t&auml;m&auml; 1920-luvulla rakennettu Oulun Osuuskaupan entinen kiinteist&ouml; on nyky&auml;&auml;n suojelukohde. Tyylikk&auml;&auml;sti kalustettu ja aivan Oulun keskustassa sijaitseva kerhotila t&auml;ytti kohtuulliset vaatimuksemme:&nbsp;se oli sek&auml; helppojen kulkuyhteyksien p&auml;&auml;ss&auml; Oulun keskustassa kirjaimellisesti kivenheiton p&auml;&auml;ss&auml; juna-asemalta, ja siell&auml; oli tarpeeksi tilaa parinkymmenen ihmisen tilaisuudelle. K&auml;vij&auml;m&auml;&auml;r&auml; arvioitiin edellisten vuosikokousten perusteella, mutta liev&auml;&auml; ep&auml;tietoisuutta siit&auml; oli, sill&auml; uudella paikkakunnalla pidett&auml;v&auml;n tapahtuman saama kiinnostus on aina v&auml;h&auml;n arvailujen varassa. T&auml;m&auml; aiheuttikin liev&auml;&auml; suurempaa perhostelua vastuuporukan vatsoissa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saku 2001:n j&auml;rjestelij&auml;porukan postituslistan v&auml;lityksell&auml; hoidettiin my&ouml;s vuosikokouksen alkusuunnittelu. Saku 2001 oli todella suuri ponnistus koko poppoolta, joten vuosikokouksen j&auml;&auml;minen n&auml;in l&auml;helle tapahtumaa varmasti aiheutti liev&auml;&auml; burnout-syndroomaa ja paniikinpoikasta asianosaisille. Vuosikokouksen j&auml;rjest&auml;minen ennen tapahtumaa olisi tietenkin ollut viisasta, mutta niin vain Saku 2001 iski kuin puun takaa, ja vuosikokous sai v&auml;isty&auml; sen tielt&auml;. S&auml;&auml;nt&ouml;jen mukaan vuosikokous tulee kuitenkin pit&auml;&auml; syyskuun loppuun menness&auml;, joten iskuryhm&auml;mme nappasi toisiaan kauluksesta kiinni ja pisti tuulemaan.</font></p>
						<div align="center">
							<table border="0" cellpadding="0" cellspacing="0" width="72">
								<tr>
									<td><img src="kuvat/pieni_vuosi2001_07.jpg" width="192" height="256" border="0"></td>
									<td><img src="kuvat/pieni_vuosi2001_05.jpg" width="192" height="256" border="0"></td>
								</tr>
							</table>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Paikalle saatiin kuin saatiinkin sek&auml; toimiva tiimi ett&auml; kaikkien suomalaisten amigistien legenda, j&auml;lleenmyyj&auml; Gentle Eye. Boogie kumppaneineen saapui uskollisesti yhdistyksen kutsusta paikalle ja toi mukanaan &quot;pienen kokoelman&quot; Amiga-tuotteita. Kuva kertoo enemm&auml;n kuin tuhat sanaa;&nbsp;t&auml;t&auml; valikoimaa ihmeteltiin tasaiseen tahtiin koko tapaamisen ajan. Kauppakin tuntui k&auml;yv&auml;n. Yhdistyksen puolesta vieraille tarjottiin suolaista ja makeaa pikkupurtavaa sek&auml; virvokkeita. L&auml;hist&ouml;ll&auml; oli my&ouml;s pizzerioita, mutta niit&auml; hy&ouml;dynsi l&auml;hinn&auml; j&auml;rjestelytiimi ennen virallisen osuuden alkua. Tai no, ne tiimist&auml; jotka kykeniv&auml;t sy&ouml;m&auml;&auml;n - loput pureskelivat kynsi&auml;&auml;n ja j&auml;nnittiv&auml;t, tuleeko ainutlaatuiseen tapaamiseen ket&auml;&auml;n.</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/pieni_vuosi2001_09.jpg" width="256" height="192" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ja tapahtui niin&auml; p&auml;ivin&auml;, ett&auml; amigistit t&auml;yttiv&auml;t tilan, ja kaikki pelot oli puhtaaksi pyyhitty. H-hetken l&auml;hestyess&auml; kello 14 aikaan alkoi oven takana liikehti&auml;:&nbsp;meid&auml;t oli l&ouml;ydetty! Paikalle saapui lopulta &quot;virallisten tilastojen&quot; mukaan 20 henkil&ouml;&auml;, mik&auml; p&auml;&auml;see melko lailla tasoihin aiempien vuosikokousten enn&auml;tysten kanssa (21 k&auml;vij&auml;&auml; 1997, 22 k&auml;vij&auml;&auml; 2000). Suurin osa k&auml;vij&ouml;ist&auml; oli tietenkin Oulusta tai l&auml;hialueelta (Raahe, Muhos), mutta pari pitk&auml;nmatkalaistakin oli paikalle saapunut. Suurimman h&auml;mm&auml;styksen aiheutti yhdistyksen entinen puheenjohtaja ja pitk&auml;aikainen puuhamies Helsingist&auml;, Tomi Jaskari, joka l&auml;pp&auml;reineen marssi kaikessa rauhassa ovesta sis&auml;&auml;n kokouksen alkaessa. Talk about devotion.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black" face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Kokeiltavaa, luettavaa ja sijoituskohteita</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Virallinen kokousosuus oli varsin nopeasti l&auml;pik&auml;yty, sill&auml; esityslista oli k&auml;sitelty reilussa puolessa tunnissa. Suurin osa yhdistyksen keskener&auml;isist&auml; asioista eli pankkitilin siirto ja kirjanpidon viimeistely ovat edelleen kesken:&nbsp;pankkitilin siirto odottaa Patentti- ja rekisterihallituksen yhdistysrekisterimuutosta, ja yhdistyksen koko historian kirjanpito on niin laaja projekti, ett&auml; se valmistuu vasta vuoden 2002 aikana. Hallitus pysyi l&auml;hes ennallaan, mutta uutena varaj&auml;senen&auml; ryhm&auml;&auml;n liittyi Kimmo V&auml;&auml;riskoski, joka jo kokouksessa osoitti asiantuntemustaan yhdistysasioissa.</font>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/pieni_vuosi2001_08.jpg" width="256" height="192" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kokouksessa luettiin my&ouml;s yhdistyksen vuosikertomus ja toimintasuunnitelma. Syyskuun alussa Vantaan Tiedekeskus Heurekassa j&auml;rjestetty Saku 2001 -tapahtuma (lue lis&auml;&auml; <a href="../ajankohtaiset/saku2001.html" target="_self">tapahtuma-artikkelista</a>) oli sek&auml; yhdistykselt&auml;, j&auml;rjestelij&auml;porukalta ett&auml; varsin (sammakon)vihre&auml;lt&auml; hallitukselta kova suoritus. Jatkossa suurin haaste sek&auml; tapahtumien j&auml;rjest&auml;misen ett&auml; koko yhdistyksen toiminnan kannalta on talouden j&auml;rjest&auml;minen:&nbsp;j&auml;senmaksujen m&auml;&auml;r&auml;n v&auml;hentyess&auml; on pyritt&auml;v&auml; lis&auml;&auml;m&auml;&auml;n tuloja muilla, yleishy&ouml;dylliselle yhdistykselle sallituilla keinoilla sek&auml; mietitt&auml;v&auml; tulevien tapahtumien j&auml;rjest&auml;mist&auml; joko pienimuotoisempina tai halvemmissa tiloissa.</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/pieni_vuosi2001_19.jpg" width="256" height="192" border="0"></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun viralliset velvollisuudet oli hoidettu, vaihdettiin vapaalle ja p&auml;iv&auml;n muuhun ohjelmaan. Gentle Eyen myyntip&ouml;yd&auml;n &auml;&auml;rell&auml; riitti ihmismuuria koko tapaamisen ajaksi, ja kauppakin n&auml;ytti k&auml;yv&auml;n, samoin onneksi my&ouml;s yhdistyksen p&ouml;yd&auml;n &auml;&auml;rell&auml; j&auml;senmaksujen ja rompunmyynnin merkeiss&auml;. Kokouksessa tehtiinkin er&auml;&auml;nlainen enn&auml;tys:&nbsp;kun Saku 2001:n noin 300 k&auml;vij&auml;st&auml; j&auml;senmaksun maksoi 12 henkil&ouml;&auml;, p&auml;&auml;stiin vuosikokouksessa samaan m&auml;&auml;r&auml;&auml;n 20 k&auml;vij&auml;n voimin. Yhdistyksen pit&auml;isi selv&auml;stikin j&auml;rjest&auml;&auml; enemm&auml;n tapaamisia ymp&auml;ri Suomea - tapaamisissa k&auml;vij&ouml;ilt&auml; irtoaa tunnontuskissa mukavasti j&auml;senmaksuja... Mutta vitsit sikseen, vuosikokouksen j&auml;senmaksut olivat aivan oikeasti pelastamassa yhdistyksen taloutta Saku 2001 -tapahtuman j&auml;ljilt&auml;:&nbsp;ilman niit&auml; budjetti olisi j&auml;&auml;nyt vajaaksi. Tulevana vuonna yksi suurimmista haasteista onkin yhdistyksen talouden vakauttaminen.</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/pieni_vuosi2001_06.jpg" width="256" height="192" border="0"></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">K&auml;ytt&auml;j&auml;tapaamisen vetonaulana oli Gentle Eyen myyntip&ouml;yd&auml;n lis&auml;ksi AmigaDE&nbsp;Playerin demoversio. Sen k&auml;ytt&auml;miseen kokouksessa Saku 2001:n j&auml;lkeen saimme luvan suoraan Amiga Inc.:n Fleecy Mossilta, joka l&auml;hetti terveisi&auml; kaikille tapaamiseen osallistuville:&nbsp;&quot;Good luck, and please give my regards to all the Amiga users at the meeting.&quot; DE Playerilla oli kokeiltavissa viisi peli&auml;, joiden &auml;&auml;rell&auml; moni n&auml;ytti viihtyv&auml;n. Lis&auml;ksi kokeiltavana oli Amigan historiasta pelikonsoli aikaansa edell&auml;, CD32, jossa sai kokeilla erilaisia pelej&auml; Piratesista Captive 2:een. V&auml;lill&auml; CD32 my&ouml;s popitti Bass Cadetin Saku 2001 Theme&auml;, tapahtuman virallista teemakappaletta. Lis&auml;ksi tapahtumassa oli luettavana vino pino AmigActive-lehte&auml; (tuorein numero tapahtumaa edelt&auml;v&auml;lt&auml; p&auml;iv&auml;lt&auml;) ja videonurkkauksessa katsottavana Deathbed Vigil sek&auml; muita Amiga-aiheisia videoita.</font></p>
						<div align="center">
							<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><img src="kuvat/pieni_vuosi2001_15.jpg" width="256" height="192" border="0" alt=" "></font></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kaikkien kohteiden &auml;&auml;rell&auml; oli aina v&auml;ke&auml;, ja sis&auml;ll&ouml;lt&auml;&auml;n muutenkin onnistunut kokous todisti j&auml;lleen kerran oikeaksi sen kiist&auml;m&auml;tt&ouml;m&auml;n tosiseikan, ett&auml; yhdistyksen toiminnassa se kaikkein hedelm&auml;llisin osa on k&auml;ytt&auml;jien v&auml;linen yhteisty&ouml;. Tapaamiseen saapuneita amigisteja taustalta tarkkaillessani mieleen nousi moneen kertaan tietoisuus siit&auml;, ett&auml; juuri t&auml;m&auml;n takia Amiga on edelleen hengiss&auml;:&nbsp;pienenkin yhteis&ouml;n voima ja henki on uskomaton.  </font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font color="black" face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>J&auml;lkipelit pannussa ja panimolla</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Tapaamisen p&auml;&auml;tytty&auml; saimme porukalla paikan kuntoon nopeasti. Osa porukasta suuntasi hieman my&ouml;hemmin illalla sy&ouml;m&auml;&auml;n Ravintola Pannuun, jossa pannupizzojen ja muiden herkkujen &auml;&auml;rell&auml; juttelimme niit&auml; n&auml;it&auml; ja nautimme olostamme. Sy&ouml;minkien j&auml;lkeen siirryimme viel&auml; Oulun Panimolle, jossa erilaisten virvokkeiden &auml;&auml;rell&auml; lopettelimme iltaa puoleny&ouml;n maissa. Kaiken kaikkiaan p&auml;iv&auml;n saldo oli niin monella tapaa positiivinen, ett&auml; kokousten ja tapaamisten j&auml;rjest&auml;mist&auml; muuallakin Suomessa (sen kuuluisan p&auml;&auml;kaupunkiseudun lis&auml;ksi) on tarkoitus mahdollisuuksien mukaan jatkaa.</font>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica">Kokousj&auml;rjestelyist&auml; erityinen kiitos seuraaville henkil&ouml;ille (aakkosj&auml;rjestyksess&auml;): Timo Karjalainen, Marko Lustim&auml;ki, Tuomo M&auml;mmel&auml;, Jarmo Piippo, Sirpa P&ouml;yh&ouml;nen, Mari Seilonen ja Riku Seilonen.</font></p>
						<p><font size="2" face="Trebuchet MS,Verdana,Arial,Helvetica"><a href="poytakirja.html" target="_self">Kokouksen p&ouml;yt&auml;kirja</a> l&ouml;ytyy toisaalta t&auml;st&auml; lehdest&auml;. Tutustu my&ouml;s yhdistyksen kotisivulla olevaan <a href="http://batman.jypoly.fi/~saku/yhdistys/tapahtumat/vuosi2001/kuvat/index_1.html" target="_blank">vuosikokouksen valokuvaraporttiin</a>!</font></td>
				</tr>
			</table>
			<br>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Toimitukselliset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]<br>
				<br>
			</font></center>
	</body>

</html>
