<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
2. Thendic-France k&uuml;ndigt Betatester-Aktion an

Thendic-France (http://www.thendic-france.com) informiert:


»Ank&uuml;ndigung des BETATESTER und des Team Betatester!

F&uuml;r Thendic/bPlan ist nun die Zeit gekommen Rechner zu verkaufen. Aber wir 
nennen diesen jetzt noch nicht Pegasos. Wir nennen die pre-release Version 
des Pegasos mit der pre-release Version von MorphOS f&uuml;r PPC: BETATESTER.
MorphOS ist f&uuml;r den durchschnittlichen Anwender noch nicht fertiggestellt, 
aber es ist fertig f&uuml;r die Entwickler.

Sie k&ouml;nnen ein BETATESTER-System f&uuml;r 1000EUR kaufen (ohne Mwst.).

Das Team Betatester wird sich aus Leuten zusammensetzen die dies 
getan/diesem zugestimmt haben:

1.) Einen BETATESTER f&uuml;r 1000EUR gekauft haben

2.) Ein NDA unterzeichnet haben

3.) Ein Abkommen unterzeichnet haben, diese Rechner nicht zu verkaufen (wir 
werden alle Rechner zur&uuml;ckkaufen, wenn der ein Verkauf aus jedlichen 
Gr&uuml;nden gew&uuml;nscht wird)

4.) Ein Minimum von 2 Bug-Reports pro Woche (incl. negativen) bis zum Ende 
des Betatester Programm liefern

5.) Sich einverstanden erkl&auml;ren, Testapplikationen laufen zu lassen

6.) Neue Pereferieger&auml;te zu testen, inclusive dem Thendic SmartCardReader 
(f&uuml;r sicheren FTP-Zugriff, Onlinebezahlung und Loyalit&auml;tsprogramme), das 
DataPlay Diskettenlaufwerk und die ComCam mit der dazugeh&ouml;rigen 
Betrachtungssoftware

Team Betatester Mitglieder k&ouml;nnen sich auch einverstanden erkl&auml;ren/in Frage 
kommen, ihre Applikationen im Auftrag von Thendic-France/bPlan zu 
entwickeln.

Im Gegenzug erhalten Betatester-Mitglieder

1.) Ein MorphOS f&uuml;r PPC V.90 T-Shirt

2.) Eine kostenlose Kopie von dem kommerziellen MorphOS f&uuml;r PPC V1.0 sobald 
diese fertiggestellt ist

3.) Einen Preisnachlass f&uuml;r das Betatester G4 Upgrade

4.) Zugriff auf den Betatester FTP-Klienten f&uuml;r Upgrade, Bugfixes, 
Testapplikationen und Programmneuerscheinungen 

und selbstverst&auml;ndlich 2 Jahre Garantie auf die Hardware.

Die n&auml;chten Monate gibt es eine Serie von Shows die fest eingeplant wurden. 
Hier eine Liste der Veranstaltungen, die bis heute geplant sind:

* 7-8 September, A-Expo in Tain l'Hermittage (Frankreich)

* 14 September, Betatester I in Frankfurt

* 21-22 September, Pianeta 2002 in Empoli (Florenz, Italien)

* 21-22 September, GGS DataShow (Gothenburg, Schweden)

Im Oktober werden wir ausserdem Betatester-Konferenzen in London und Moskau 
halten. Im Gegensatz zu den anderen Veranstaltungen werden die Betatester-
Konferenzen von uns veranstaltet.

In jedem dieser F&auml;lle werden wir Teams einteilen, die diese Veranstaltungen 
unterst&uuml;tzen.
Alle von uns werden zur A-Expo kommen. Auf der A-Expo werden wir auch 
BETATESTER an alle die den "Team Betatester"-Bedingungen zustimmen, 
verkaufen.
Wenn jemand anderes die Show veranstaltet werden wir uns selbst 
organisieren, wir werden BETATESTER demonstieren und einen Wettbewerb 
veranstalten.

Bez&uuml;glich den Entwickler-Konferenzen die wir halten: diese werden ein Tag 
lang sein und ein Abendessen, welches wir halten werden, einschliessen. 
Eintritt zu diesem Tagesprogramm basieren auf einer Bestellung/Bezahlung 
f&uuml;r den BETATESTER. K&auml;ufer k&ouml;nnen auch am Eingang bezahlen, m&uuml;ssen jedoch 
vorher den Betatester-Bedingungen zustimmen. Niemand der keinen Rechner 
gekauft hat wird hereingelassen.

Ein anders MorphOS T-Shirt wird bei jeder dieser Veranstaltungen 
erscheinen:
V.90 Bordeaux, V.91 Tain l'Hermitage, V.92 Frankfurt, V.93 
Gothenburg/Empoli, etc.
Wenn der Pegasos f&uuml;r eine kommerzielle Ver&ouml;ffentlichung fertiggestellt ist, 
weren wir bei Version 1.0 angekommen sein (und wir werden die gesammte 
Kollektion zu Kauf anbieten).

Wenn sie irgenwelche Fragen haben, k&ouml;nnen sie uns eine E-Mail an 
bbrv@thendic-france.com schreiben.

Mit freundlichen Gr&uuml;ssen,
Raquel Velasco and Bill Buck


Hinweis: BETATESTER-Systeme werden mit folgenden Komponenten geliefert: 
Mainboard mit G3 600Mhz, 128 MB Ram, 40GB Festplatte, ATI Radeon 7000, CD-
Rom sowie Tower und Netzteil. Die Konfiguration kann sich &auml;ndern.«

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
