<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Neuigkeiten von der Amiga Arena

Amiga Arena (http://online-club.de/~ARENA/) informiert:


*Amiga Arena Interview mit "Lukas Stehlik" (AmiGOD)*

Mit "AmiGOD" 2.x m&ouml;chte der Entwickler "Lukas Stehlik" einen w&uuml;rdigen
Nachfolger f&uuml;r die schon in die Jahre    gekommenen Benchmark Programme
"SysInfo" und "Sysspeed" entwickeln.
"AmiGOD" liegt zur Zeit noch im Beta Stadium vor und soll aber in Zukunft
auch PPC und 3D Grafikkarten unterst&uuml;tzen.
Das Interview liegt zur Zeit nur in Englsich vor.


틻miga Arena News

Das Interview mit "Lukas Stehlik" dem Entwickler von "AmiGOD",dem neuen
Benchmark Programm f&uuml;r Classic und in Zukunft PPC Amigas ist jetzt auch in
Deutsch Online!


*Amiga Arena - Vollversion (Valhalla 3 - and the Fortress of Eve)*
Mit "Valhalla 3" liegt der dritte und letzte Teil der Adventure Serie
"Valhalla"    von "Vulcan Soft." f&uuml;r den Amiga in der Deutschen HD Version 
(+ Komplettl&ouml;sung) zum Download bereit.


*Amiga Arena - Interview mit "James Jacobs" (Saga,Repot+,WormWars)*

Neue PD oder Shareware Spiele werden immer weniger f&uuml;r den Amiga
entwickelt.
Mit der Brettspiel Umsetzung "Saga: Age of Heroes" hat nach langer Zeit
eine neue Konventierung den Weg zum Amiga gefunden.
Wenn Sie bereit sind Monster zu besiegen,Sch&auml;tze zu gewinnen und
K&ouml;nigreiche zu regieren sollte "Saga: Age of Heroes" eine willkommende 
Brettspiel Umsetzung f&uuml;r Sie sein.
Da das Spiel zur Zeit nur in Englsich spielbar ist, "James Jacobs" aber
bereit ist auch eine Deutsche Version zu erstellen braucht er Ihre
Mithilfe!
Wer gerne bei der &Uuml;bersetzung helfen m&ouml;chte mail bitte an: amigan@abime.net
- James Jacobs


*Amiga Arena - Vollversion "World Hockey League Manager"*
Mit "World Hockey League Manager" aus dem Jahre 1993 liegt der
Eishockeymanager aus dem Haus "Sayonara Software" zum Download bereit.
Besonderen Dank an Marc der das Spiel zur Verf&uuml;gung stellte und Jo Seitz
von Sayonara Software f&uuml;r die Genehmigung der Freigabe.
Das Spiel erwies sich auf meinem Amiga 4000/60 unter OS 3.9 als nicht
lauff&auml;hig und konnte deshalb keiner  Bewertung unterzogen werden.


*Amiga Arena - Vollversion "Hilt II plus German files"*
"Hilt II" von Scorpius Software ist ein Strategiespiel in dem Sie nicht nur
Ihr Team aus Soldaten zusammen stellen m&uuml;ssen,wobei die Einheiten &uuml;ber
verschiedene F&auml;higkeiten verf&uuml;gen,sondern auch zahlreiche Missionen zu
erf&uuml;llen haben.
Die "Amiga Arena" pr&auml;sentiert nun erstmals die erste Deutschsprachige
Mission und m&ouml;chte in Zukunft weitere Missionen sowie das "mainfile"
komplett &uuml;bersetzten.
Wer Strategie Spiele mag sollte sich "Hilt II" einmal anschauen.
Die Englsiche Orginal Version sowie ein Installer und die ersten Deutschen
files liegen zum Download bereit. Wer bei der &Uuml;bersetzung helfen m&ouml;chte
sowie einfach nur Interesse hat das Spiel auch in Deutsch spielen zu 
k&ouml;nnen, Feedback ist erw&uuml;nscht!
Besonderen Dank an Mark Sheeky dem Entwickler f&uuml;r seine Hilfe sowie
Christian Busse der die ersten Missionen &uuml;bersetzt hat.


*Interview mit "Christian Rosentreter" (Shangai Dragon)*

Wer in den vergangenen Tagen die News im Forum von "amiga-news.de" gelesen
hat,dem d&uuml;rfte der Name "Shangai Dragon" aufgefallen sein.
Der Entwickler "Christian Rosentreter" gab dort bekannt mit "Shangai
Dragon" ein neues Spiel in Entwicklung zu haben f&uuml;r den Amiga.
Ein weiterer "Majong" Clone? werden jetzt sicher viele denken aber
sp&auml;testens wenn man sich die mindest Systemanforderungen anschaut (68040,4
MB FastRam) und dazu,das es ausschliesslich Grafikkarten unterst&uuml;zt,sieht 
man das hier neue Anforderungen und Massst&auml;be an ein Mailware Spiel 
gestellt werden.
Im Interview mit der "Amiga Arena" sprach "Christian Rosentreter" &uuml;ber
weitere features von "Shangai Dragon" und wie es zu der Entwicklung kam.


"Hilt II": German files Update

F&uuml;r das Action-Strategie Spiel "Hilt II" ist ein weiteres Update Online!
Alle Waffen sowie weitere Gegenst&auml;nde aus dem Inventar sind &uuml;bersetzt.
Team Einheiten k&ouml;nnen jetzt beliebing ausger&uuml;stet werden,dazu verf&uuml;gen Sie
jetzt &uuml;ber 20 Waffen zur Auswahl 
(Lasergewehr,Napalm,Brenner,Handgranate,L&auml;hmungsbombe,Kettens&auml;ge) sowie
Schutzanz&uuml;ge und Medikits.
Desweiteren k&ouml;nnen Sie die "Feldz&uuml;ge" Tutorial,Terrorist und Holowars
komplett in Deutsch spielen.
Weiterhin wird noch Hilfe gesucht um die Missionen zu &uuml;bersetzten!


*"Amiga Arena" goes Scene part II / Interview mit "Ghandy" und "Zito"
(Scene Mag - JurassicPack)*

Wenn mich heute einer fragen w&uuml;rde,was mich am C64/Amiga seit anbeginn
fasziniert hat,meine Antwort w&auml;re "Die Spiele und Scene Demos!"
Das die Amiga Demo Scene auch 2002 "still alive" ist zeigen immer wieder 
die erfolgreichen Platzierungen der Wettbewerbe auf Partys und 
Veranstaltungen.
Aber nicht nur Demos sondern auch Magazine sind fester Bestandteil der
"Scene".
Im letzten Jahr gab es nicht nur mit dem Comback von "D.I.S.C." (siehe
Interview mit "Frode Hansen") eine neue Ausgabe des Magazines sondern auch
"JurassicPack" erschien unerwartet mit einer neuen Ausgabe.
Lars "Ghandy" Sobiraj und Marc "Zito" Oberst sind seit dem die Herausgeber
und f&uuml;hrten mit der "Amiga Arena" ein sehr ausf&uuml;hrliches Interview &uuml;ber die
"Amiga Demo Scene" und Ihrem Magazin "JurassicPack".
Gerade "Einsteigern" kann das Magazin sehr empfohlen werden,auch wenn Ihre
letzte Ausgabe 10 nicht von Kritik seitens einiger "Scener" verschont
blieb,aber liest selbst und taucht ab in einen Teil der Amiga Welt die bis
heute einzigartig ist.
*Nachtrag:*
Urspr&uuml;nglich war das Interview kurz nach der "Mekka+Symposium" 
Veranstaltung geplant doch aus verschiedenen Gr&uuml;nden konnte es es erst 
jetzt fertig gestellt werden.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
