<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
3. Review: Internet-Strategiespiel »Tales of Tamar« (von Michael Scholz) 

Geschichten aus Tamar

Lange ist es her, seit ich das erste Mal von "Tales of Tamar" h&ouml;rte. Es war 
damals, als ich mit meinen Freunden auf der Amiga-Messe in Neuss war, da 
lief am Stand der Firma Eternity ein Intro, das die Massen in seinen Bann 
zog. Auch ich versuchte damals unbedingt zu sehen, was da vorgef&uuml;hrt wurde, 
ich war schlichtweg wie der Rest der Anwesenden gebannt von dem Spektakel. 
Dies war mein erster Kontakt zu "Tales of Tamar".

Dann wurde es f&uuml;r mich eine Weile still um "Tales of Tamar" (im folgenden 
ToT genannt), doch im M&auml;rz 2001 las ich auf Amiga-News.de, dass noch neue 
Betatester f&uuml;r das Spiel gesucht werden. Frohen Mutes meldete ich mich an 
und bekam auch kurze Zeit sp&auml;ter mein NDA und kurz darauf meine 
Zugangsdaten, um mir das Spiel herunterzuladen.

Das Spiel wird mittels des AmigaOS-Installers auf die Festplatte des 
heimischen Computers installiert; dies sollte selbst f&uuml;r den unerfahrenen 
Anwender kein Problem darstellen. Sollte der Installer des AmigaOS ab 
Version 3.5 zur Verf&uuml;gung stehen, wird die Installation mit 
Hintergrundgrafik und Musik unterlegt.

Das Basis-Set des Spiels soll auf 3 CDs ausgeliefert werden, wovon eine das 
Intro enth&auml;lt, eine den Soundtrack und eine das Spiel selbst.


Also begann im Winter des Jahres 78 meine Herrschaft &uuml;ber ein kleines Reich 
in Tamar. Ich, genannt Skar, siedelte mit meinen treuen Gefolgsleuten nach 
langer zehrender Reise auf der Insel Eternia, um dort ein neues Reich 
aufzubauen. Doch wie sollte uns das gelingen?

Nun schauen wir uns einmal an, wie sich ToT dem geneigten Spieler 
pr&auml;sentiert. Als erstes werden wir vom Residenzscreen begr&uuml;&szlig;t. Dieser 
stellt die Steuerzentrale unseres Reiches dar, von hier aus erreichen wir 
alle anderen Screens, die f&uuml;r unser Spiel wichtig sind, die Forschung, die 
Diplomatie, die Karte, die Berichte, die Steuern, die Statistik, die 
Optionen, die Spezialisten, den Stammbaum und nat&uuml;rlich unsere Stadt.

Der Residenzscreen:
<IMG SRC="../extra/residenz.jpg" ALT="Der Residenzscreen">

Im Optionenscreen k&ouml;nnen wir die Einstellungen vornehmen, die zur 
Soundwiedergabe ben&ouml;tigt werden, und im zweiten Screen m&uuml;ssen wir unsere 
Konfiguration der E-Mail-Adresse, &uuml;ber die wir ToT spielen wollen, 
eintragen, denn ToT spielt man &uuml;ber das Internet. Deshalb wird es auch als 
sogenanntes "Massiv-Multiplayer-E-Mail-Spiel" beworben.

Was hei&szlig;t das aber? Muss ich jetzt etwa die ganze Zeit, w&auml;hrend ich meinen 
Zug plane, online sein? Nat&uuml;rlich nicht! Denn ToT baut seine Verbindung 
&uuml;ber die am Amiga gebr&auml;uchlichen TCP/IP-Stacks Miami, MiamiDx, Genesis und 
AmiTCP auf, holt die E-Mail vom Server und geht dann wieder offline. Es 
besteht f&uuml;r die Flatrate-Benutzer unter uns nat&uuml;rlich auch die M&ouml;glichkeit, 
ToT auf "Immer online" zu setzen. :)


Erkl&auml;ren wir aber erst einmal das Prinzip, das hinter ToT steckt.

Wie anfangs erw&auml;hnt, begann ich im Winter 78 mit meinen Mannen in Tamar auf 
der Insel Eternia ein Reich zu gr&uuml;nden. Was k&ouml;nnen wir davon ableiten? 
Richtig, ToT l&auml;uft mit seinen Spielz&uuml;gen jeweils ein Quartal durch, d.h. 
Fr&uuml;hjahr, Sommer, Herbst und Winter, wobei im Winter die Landschaft auch 
mit Schnee bedeckt ist. Was einen im Normalfall auch daran erinnert, dass 
im Fr&uuml;hjahr wieder die Saat f&auml;llig ist, denn ohne Saat keine Ernte und ohne 
Ernte bekommt die Bev&ouml;lkerung kein Korn und ohne Korn passiert es auf kurze 
oder lange Sicht, dass die Bev&ouml;lkerung einen lyncht. Das Lynchen durch die 
Bev&ouml;lkerung ist auch eine der wenigen M&ouml;glichkeiten, in ToT zu sterben, 
eine andere M&ouml;glichkeit w&auml;re, durch die Hand eines anderen Spielers zu 
sterben.

Denn das Wichtigste in der Welt von Tamar ist die Kommunikation mit anderen 
Spielern, es gibt hier keine direkten Computergegner, jedes andere Reich 
hat einen Menschen hinter sich, der einem die eine oder andere Aktion &uuml;bel 
nehmen k&ouml;nnte. Als Kommunikationsm&ouml;glichkeiten k&ouml;nnte ich einmal die 
Taverne anbieten, hier gibt es ein schwarzes Brett, den Mail-Editor, in dem 
s&auml;mtliche Nachrichten von allen Spielern gelesen werden k&ouml;nnen (sp&auml;ter soll 
man hier nur noch die Nachrichten von den Spielern lesen k&ouml;nnen, die man 
bereits entdeckt hat), und den Online-Chat, einen eingebauten IRC-Client, 
mit dem man sich im IRC-Kanal des Spieles einloggt.

Die Taverne (mit Requester):
<IMG SRC="../extra/taverne.jpg" ALT="Die Taverne (mit Requester)">

Dies kann man nat&uuml;rlich auch mit AmIRC oder BlackIRC tun, wenn man will. 
Stammtisch ist immer Sonntagabend um 21 Uhr, aber es sind auch an den 
Wochentagen viele anzutreffen. Die genauen Zugangsdaten gebe ich hier nicht 
bekannt.


Der Aufbau des Reiches

Als junger Herrscher steht man vor dem Problem: Wie gehe ich nun vor? Unser 
Reich hat noch keine allzu gro&szlig;e Dimension und unser "Dorf" ist auch noch 
nicht wirklich ansehnlich, uns stehen sieben Morgen Land, eine Taverne, ein 
B&uuml;rgerhaus, zwei M&uuml;hlen, ein Kornlager und ein wenig Gold zur Verf&uuml;gung. 
Doch womit sollen wir anfangen?

Wichtig ist es auf jeden Fall, Steuern zu erheben. Hier kann dann jeder 
beweisen, dass er besser als unsere jetzige oder ggf. zuk&uuml;nftige 
Bundesregierung ist :), und hohe oder niedrige Steuern erheben, um den 
Staatshaushalt zu finanzieren. Ein weiterer wichtiger Punkt ist die 
Forschung, denn nur durch Forschung stehen uns in Zukunft neue Techniken, 
verbesserte Waffen, besserer Schiffbau oder einfach nur eine bessere 
medizinische Versorgung der Bev&ouml;lkerung zur Verf&uuml;gung. Allerdings ist zu 
beachten, dass uns die Forschung ebenfalls Gold kostet, und dieser Betrag 
ist abh&auml;ngig von der Bev&ouml;lkerung: Je mehr Untertanen auf ein entsprechendes 
Forschungslevel der Bereiche Astronomie, Alchemie, Naturkunde, Theologie, 
Heilkunde, Kampfkunst und Technik gebracht werden sollen, um so h&ouml;her sind 
die Kosten daf&uuml;r. Eine Erleichterung bei der Entscheidung, in welche 
Richtung wir forschen wollen, gibt uns das Spiel nat&uuml;rlich auch, denn zu 
den entsprechenden Gebieten gibt es immer eine kurze Beschreibung, so w&auml;re 
das z.B. bei Astronomie Stufe 6: "Durch den Stand der Sterne k&ouml;nnte es uns 
nun auch nachts gelingen, die exakte Position der Schiffe zu bestimmen.", 
also sollte die Forschung auf keinen Fall vernachl&auml;ssigt werden.

Doch kommen wir zur&uuml;ck zu unserem kleinen Reich, genannt "Enwor", welches 
ich versuchte, aufzubauen. Es war die Zeit, als sich die ersten Kriege 
anbahnten und mein Kundschafter, diesen bewegt man auf der Karte von ToT, 
um die Gegend zu erkunden, t&auml;glich neue Gegenden entdeckte und nat&uuml;rlich 
auch die ersten annektierenden Truppen auf Tamar zu sehen bekam. Diese 
Truppen waren von ihren Herrschern ausgesandt worden, um die noch 
unbesetzten L&auml;ndereien in Besitz zu nehmen. Doch wie es immer auf der Welt 
ist, gab es auf der einen Seite Neid und Missgunst &uuml;ber die bl&uuml;henden 
Reiche des jeweils anderen Herrschers, und so passierte es, das sich 
B&uuml;ndnisse bildeten, um nicht allein gegen andere im Krieg dazustehen. So 
kam es, dass um das Jahr 92 der erste gro&szlig;e Krieg auf Tamar ausbrach, auf 
der einen Seite die Herren Wolfen und Siegfried, auf der anderen Seite ein 
B&uuml;ndnis namens VSZOT, heute unter dem Namen VSZE bekannt. Die Mitglieder 
des "Vertrag f&uuml;r Sicherheit und Zusammenarbeit in Ost-Tamar" waren zu 
dieser Zeit Lord Alberich von Schmiedefeld, Lord Fox von Sion, Freiherr 
Taurik von B&auml;renanger und Lady Morgana. Es schien lange Zeit so, dass die 
Herren lange k&auml;mpften, ohne den jeweils anderen bezwingen zu k&ouml;nnen, bis um 
das Jahr 110 die Meldung an alle Reiche verbreitet wurde, dass Wolfen tot 
sei. So kam f&uuml;r uns die erste Chance, unser kleines Reich zu vergr&ouml;&szlig;ern, 
denn mein Reich war komplett umgeben von dem des Herrn Wolfen. Wir konnten 
unser Reich nur ein wenig vergr&ouml;&szlig;ern, da auch die anderen Nachbarn Wolfens, 
vor allem sein Verb&uuml;ndeter Siegfried, ebenfalls schnell die umliegenden 
L&auml;ndereien einnahmen und f&uuml;r uns nicht allzu viel &uuml;brig blieb. Doch werfen 
wir einmal einen Blick auf die Karte von ToT.

Der Kartenscreen:
<IMG SRC="../extra/karte.png" ALT="Der Kartenscreen">

Hier k&ouml;nnen wir viele kleine Hexagons erkennen, welche jeweils einen Morgen 
Land darstellen. Es gibt verschiedene Terrains. Einige davon k&ouml;nnen wir 
hier erkennen, da w&auml;re das Grasland, die Laub-, Nadel- und Dunkelw&auml;lder, 
die H&uuml;gel und Berge, es gibt aber auch noch W&uuml;sten und S&uuml;mpfe auf Tamar. 
Auf der Karte k&ouml;nnen wir verschiedene Figuren sehen, welche uns in ToT zu 
Verf&uuml;gung gestellt werden: den Kundschafter, um die L&auml;ndereien zu erkunden, 
Kavallerie-, Infanterie- und Artillerie-Truppen (hier nicht zu sehen). 
Diese Truppen k&ouml;nnen je nach Bewaffnung und R&uuml;stung verschiedene St&auml;rken 
annehmen. Es gibt leichte, mittlere und schwere Einheiten. Die Kategorie 
einer Einheit richtet sich nach der R&uuml;stung der Truppe, welche wir ihr im 
Kasernenscreen (Waffen und R&uuml;stungen) zuweisen, die R&uuml;stungsklassen 
erstrecken sich von RK0 bis RK12. Wobei man sich hierbei nat&uuml;rlich denken 
kann, dass eine Einheit mit der R&uuml;stungsklasse 12 wesentlich bessere 
Chancen im Kampf hat als eine Einheit mit der R&uuml;stungsklasse 0.

Mit dem Schalter "Grenzen", welcher hier zu sehen ist, kann man die Grenzen 
zu den benachbarten L&auml;ndern einblenden, mit dem Schalter "Rohstoffe" kann 
man sich die Ressourcen der Felder anschauen und mit dem Schalter 
"Symbolkarte" werden die Namen der eigenen St&auml;dte eingeblendet.

Wie wir erkennen k&ouml;nnen, gibt es auch Orks, welche in den Bergen hausen und 
in regelm&auml;&szlig;igen Abst&auml;nden auftauchen, um uns Land zu stehlen, und so kommen 
wir zu einem weiteren Teil der Geschichte um das Reich von Satai Skar.

Kurz nach dem Tode Lord Wolfens und der Erweiterung unseres Reiches gab es 
die erste gr&ouml;&szlig;ere Bedrohung f&uuml;r dieses, denn auf einmal wurde Eternia von 
Orkhorden &uuml;berrannt, unsere L&auml;ndereien fielen zu einem Gro&szlig;teil an die Orks 
und unsere Schmiede waren durch den Verlust unserer erztr&auml;chtigen Berge 
nicht mehr in der Lage, Waffen f&uuml;r uns herzustellen, mit welchen wir den 
Orks Herr h&auml;tten werden k&ouml;nnen. So kam es, dass unser Reich vor sich 
hinsiechte. Alle Truppen, die wir gegen die Orks aussandten, wurden von 
diesen dahingeschlachtet, da unsere Mannen mit schlechten oder gar ohne 
Waffen ausger&uuml;stet waren und somit den Orks nichts entgegenzusetzen hatten. 
Aber dann nahte die Rettung, Lord Fox von Sion, Mitglied des VSZE (der 
VSZOT wurde mittlerweile umbenannt in "Vertrag f&uuml;r Sicherheit und 
Zusammenarbeit in Eternia"), bot uns Hilfe bei der Vertreibung der Orks an, 
und seine Truppen w&uuml;teten unter diesen, so dass wir die L&auml;ndereien wieder 
in unseren Besitz nehmen konnten. Daraufhin entschloss sich Satai Skar, 
Mitglied des VSZE zu werden, am Anfang noch als nicht &ouml;ffentliches 
Mitglied, da der Krieg mit Herrn Siegfried immer noch tobte und eine 
Bekanntmachung sicher einen Angriff Siegfrieds auf unser Reich provoziert 
h&auml;tte.

So verging wieder eine gewisse Zeit bis die Wissenschaftler Tamars neue 
Errungenschaften pr&auml;sentieren konnten.
Dann war es soweit, um das Jahr 150 herum gelang es den ersten Herren, 
Schiffe zu Wasser zu lassen.

Eine Stadt der Stufe 2 mit Hafen:
<IMG SRC="../extra/stadt.jpg" ALT="Eine Stadt der Stufe 2 mit Hafen">
Der Hafenscreen:
<IMG SRC="../extra/hafen.jpg" ALT="Der Hafenscreen">

So begannen die ersten Herrscher, die Meere zu erkunden, uns war dies 
leider nicht verg&ouml;nnt, da wir &uuml;ber keine Stadt am Meer oder einem Fluss 
verf&uuml;gten, so dass wir traurig zusehen mussten, wie andere die Weiten des 
Ozeans erkundeten. Doch nur wenige Jahre sp&auml;ter bot sich uns die Chance 
unseres Lebens. Sergus, der die ehemaligen L&auml;ndereien des verstorbenen 
Wolfen &uuml;bernommen hatte, war durch Misswirtschaft von seinem Volk verjagt 
worden. Bis heute ist noch nicht gekl&auml;rt ob ihn das Volk gelyncht hat oder 
ob er mit einem Schiff fliehen konnte. So gelang es uns, die auch erst 
wenige Jahre zuvor entdeckte M&ouml;glichkeit der &Uuml;bernahme fremder St&auml;dte 
auszuprobieren und so ebenfalls nach dem Aufbau der Stadt einen Hafen zu 
bauen und die Meere zu erkunden.


Zur&uuml;ck zum Test

Die Meere k&ouml;nnen mit Handels- und Kriegsschiffen befahren werden, welche es 
in jeweils drei Stufen gibt, kleine, mittlere und gro&szlig;e. Hier muss ich 
allerdings hinzuf&uuml;gen, dass bis heute noch kein gro&szlig;es Kriegsschiff 
gesichtet werden konnte, wahrscheinlich hat noch keiner der Lords die 
technischen Voraussetzungen daf&uuml;r gefunden. W&auml;hrend Kriegsschiffe dazu in 
der Lage sind, die K&uuml;stenstreifen des eigenen Reiches zu annektieren und 
andere Schiffe zu versenken sowie Piraterie zu betreiben (ja richtig 
gelesen, es ist m&ouml;glich, Handelsschiffe anderer Spieler zu &uuml;berfallen und 
den Gewinn der verkauften Waren zu stehlen), sind Handelsschiffe f&uuml;r den 
Transport ausgelegt, mit diesen kann man seine Kundschafter, Siedler und 
Truppen auf andere Inseln transportieren - womit wir schon beim letzten 
Bericht aus Enwor angelangt w&auml;ren.

Es muss um das Jahr 180 gewesen sein, als unser Verb&uuml;ndeter die neue Insel 
Exevor entdeckte, daraufhin machten sich Freiherr Taurik, Lord Alberich, 
Lord Fox und ich, Satai Skar, auf, um diese neuentdeckte Insel zu 
besiedeln. Doch leider waren wir nicht die Einzigen, und es kamen noch die 
Herren Lancelot und Lucksi hinzu, welche sich ebenfalls an der Besiedlung 
Exevors beteiligten. Nach langen Verhandlungen wurde eine Einigung erzielt, 
und jeder sollte ein Sechstel der freien L&auml;ndereien auf Exevor erhalten. 
Dies ist nun schon ein paar Jahre her, und ich kann auf ein stolzes Reich 
von 197 Morgen Land und neun St&auml;dten herabschauen. Doch sehen wir, was die 
Zukunft f&uuml;r ToT bringt.
  

Kommen wir nun aber zu einigen trockenen Details

Die Grafik wird auf einem 640x480-Screen in 256 Farben dargestellt, d.h. es 
muss ein AGA-Amiga oder eine Grafikkarte zur Verf&uuml;gung stehen, um in den 
Genuss, ToT spielen zu k&ouml;nnen, zu kommen. Den Grafiken sieht man an, dass 
an dem Spiel mit viel Liebe und Hingabe gearbeitet wird, denn die 
Hintergrundgrafiken und Figuren sind wirklich erste Sahne. Des weiteren 
finden sich auch die ganzen Geb&auml;ude und Waren, die zum Kauf oder Verkauf 
angeboten werden, im jeweiligen Screen als Raytracing-Animation wieder, so 
dass man sie von allen Seiten betrachten kann. Auf meinem 68060-Amiga habe 
ich keine Probleme mit der Darstellung der Animation, allerdings soll es 
auf langsameren Systemen (ToT ist theoretisch ab 68030 spielbar) zu 
Geschwindigkeitseinbu&szlig;en kommen. Dies k&ouml;nnte eventuell gel&ouml;st werden, indem 
man die Animationen abschaltbar macht, was aber zum jetzigen Zeitpunkt noch 
nicht implementiert ist.

Der Sound wird wie bereits erw&auml;hnt auf einer Extra-CD ausgeliefert, welche 
sich w&auml;hrend des Spiels im CD-ROM-Laufwerk des Amiga befinden sollte. Der 
Soundausgang des Laufwerks sollte irgendwie mit eingespeist werden, wie 
z.B. beim Amiga 4000, damit man sich die Musikst&uuml;cke auch zum Spiel anh&ouml;ren 
kann. Je nach Situation (Spielscreen) wird ein anderes Musikst&uuml;ck 
wiedergegeben. Man kann nat&uuml;rlich auch einen Kopfh&ouml;rer an den Frontausgang 
des CD-ROM-Laufwerks anschlie&szlig;en, allerdings h&ouml;rt man dann die 
Hintergrundger&auml;usche nicht mehr, wenn einem im Winter der Wind auf der 
Karte durch die Haare f&auml;hrt oder wie die eigenen Truppen auf der Karte 
einen begr&uuml;&szlig;en, wenn man sie anklickt, oder das Vogelzwitschern im Sommer.

Wann m&uuml;ssen die Z&uuml;ge eigentlich abgeschickt werden? Jeden Tag um 12 Uhr 
ME(S)Z erfolgt die Auswertung der Spielz&uuml;ge. Da diese per E-Mail geschickt 
werden, reicht es theoretisch aus, den Zug kurz vor 12 Uhr loszuschicken, 
man sollte aber immer eine gewisse Toleranz einrechnen und sp&auml;testens um 11 
Uhr den Zug gesendet haben. Dann erfolgt serverseitig die Auswertung, was 
aufgrund der geringen Spielerzahl in der Betatestphase noch recht schnell 
geht, und der Server schickt die Mails an die Spieler raus. Als Richtzeit 
ist 18 Uhr ME(S)Z angesetzt, bis dahin sollten theoretisch alle Z&uuml;ge 
angekommen sein, zur Zeit ist der Zug manchmal schon vor 13 Uhr da.

Aber ToT ist noch lange nicht fertig, Martin Wolf (Wolfen) hat mit diesem 
Spiel noch viel vor, so dass es in regelm&auml;&szlig;igen Abst&auml;nden Updates zu ToT 
geben wird, welche selbstverst&auml;ndlich kostenlos sind, um ToT zum besten 
Spiel aller Zeiten zu machen. Dort, wo noch erweitert wird, bekommen wir 
eine Meldung angezeigt, die wie folgt lautet: "Mein Lord, hier wird f&uuml;r Sie 
in Zukunft erweitert, damit Tales of Tamar irgendwann zum besten 
Strategiespiel aller Zeiten wird! Ihr ToT-Team".
Apropos Erweiterungen: Seit kurzem wandern auch Elfen durch die W&auml;lder von 
ToT, und bald werden auch Zwerge die Berge bev&ouml;lkern.

Aber trotz der Tatsache, dass ToT noch nicht zu 100 Prozent fertig ist, 
kann ich es nur begr&uuml;&szlig;en, dass es endlich ver&ouml;ffentlicht wird, denn so 
haben nun auch viele andere die M&ouml;glichkeit, an diesem s&uuml;chtigmachenden 
Spiel teilzunehmen.


Preise

Wie viel kostet mich ToT eigentlich? 

Nichts!!! ToT ist kostenlos zu erhalten, lediglich die Spielz&uuml;ge kosten 
Geld.

Aber das Basis-Set kostet beim Erwerb 59,90 Euro, warum das denn? 

Einmal ist im Basis-Set bereits ein Kontingent von 300 Spielz&uuml;gen 
enthalten, und man erh&auml;lt ein Handbuch sowie die 3 CDs mit Intro und 
Soundtrack. Diese bekommt man nicht, wenn man sich das Spiel herunterl&auml;dt. 
Dann muss man ohne diese Zugaben auskommen, aber man kann ja mit der 
Downloadversion erst mal kurz in das Spiel hineinschnuppern.

  
Die geplanten Preise sind:

80   Runden f&uuml;r  20 Euro (knapp 2-3 Monate)
300  Runden f&uuml;r  50 Euro (knapp 1 Jahr)
1000 Runden f&uuml;r 100 Euro (knapp 2,5 Jahre)

Also kann jeder das Spiel erst einmal f&uuml;r 20 Euro testen, und wenn es ihm 
dann gef&auml;llt, richtig loslegen.

  
Fazit:

Ich kann ToT allen Strategie- und Rollenspielbegeisterten nur empfehlen, 
denn ich kenne kein anderes Spiel, das einem solche Gl&uuml;cksgef&uuml;hle bereitet, 
wenn man eine bereits verloren geglaubte Schlacht doch gewann oder wenn man 
nahe eines Herzinfarktes war, weil einen die feindlichen Truppen trotz der 
eigenen &Uuml;bermacht geschlagen hatten. Kein anderes Spiel erm&ouml;glicht es in 
dieser Weise, B&uuml;ndnisse zu schmieden sowie hinterlistige Pl&auml;ne auszukochen 
und diese durchzuf&uuml;hren, um einen vermeintlichen Verb&uuml;ndeten zu &uuml;berfallen, 
um sein eigenes Reich zu vergr&ouml;&szlig;ern. All das ist in ToT bereits geschehen. 
Denn das Spielziel ist es, Kaiser zu werden, und dies gelingt nur, indem 
man treue Vasallen um sich scharrt, um sein Reich zu festigen und seinen 
Stand zu erh&ouml;hen. Es gibt Lords in ToT, die bereits den Titel eines Vicomte 
inne hatten und nun wieder den Status eines einfachen Lords besitzen. All 
das macht ToT zu einem unnachahmlichen Spiel, das meines Erachtens s&uuml;chtig 
macht.
  

System:                68k-Amiga (Animationen werden auch auf PPC 
                       wiedergegeben); noch in Entwicklung befinden sich 
                       Versionen f&uuml;r Windows, Linux, MacOS, Atari und Java.

Entwickler:            Eternity Computer

Erscheinungstermin:    September 2002

Preis:                 59,90 Euro

Kosten:                - Onlinekosten zum Spielzug holen und Spielzug 
                         senden, also max. 2-3 Minuten t&auml;glich 
                       - Kosten f&uuml;r die Runden (siehe oben)

Bezugsquelle:          http://www.tamar.net

  
Michael Scholz aka Satai Skar &lt;mgf-design@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
