<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Review: Wirtschaftssimulation »Software Tycoon«

Es ist das Jahr 1980. Die Computerspielefirmen schie&szlig;en wie Pilze aus dem 
Boden Um sich einen Teil des Kuchens zu sichern, entschlie&szlig;en Sie sich, 
eine Softwarefirma zu gr&uuml;nden. Anf&auml;nglich nur mit wenig Kapital und einem 
kleinen Team, entwickeln sie dann Ihre ersten Spiele. Die Konkurrenz wird 
von Jahr zu Jahr immer st&auml;rker, so dass Ihnen nichts anderes &uuml;brig bleibt, 
als Ihr Team mit Programmierern, Grafikern und Musikern zu vergr&ouml;&szlig;ern. 
Gutes Personal ist jedoch nur mit Gl&uuml;ck zu finden.
Die Spiele werden immer besser, und die Anspr&uuml;che der Spieler an Grafik und 
Sound wachsen. Haben Sie das Wissen, um gute Spiele zu entwickeln, und sind 
Sie raffiniert genug, um Ihre Konkurrenz auszuschalten, oder verstauben 
Ihre Spiele in den Regalen der L&auml;den?

Dies ist die Hintergrundstory zu "Software Tycoon", einer 
Wirtschaftssimulation, die Epic Interactive (Earth2140, Simon II) vom PC 
konvertiert haben. Die Geschichte erinnert stark an Software Manager, 
welches ja auf dem Amiga einen gro&szlig;en Erfolg hatte. Nun soll dieses Genre 
also wiederbelebt werden. Nun, anstatt nur &uuml;ber Spiele zu schreiben, mache 
ich halt mal selbst welche, kann ja nicht schaden, oder?

Wir brauchen dazu einen PPC-Rechner und einen 800*600-Screenmode, 
Grafikkarte ist also angesagt. Wir bannen das Spiel auf die Festplatte, 
w&auml;hlen den entsprechenden Bildschirm aus, und schon kann es losgehen. Nach 
dem obligatorischen Einblenden der Logos kann man zwischen Deutsch und 
Englisch w&auml;hlen, die Hintergrundmusik ausstellen oder ein bereits 
gespeichertes Spiel laden. Oder eben neu starten - das tun wir dann auch. 
Nat&uuml;rlich denken wir uns erst einen (m&ouml;glichst originellen) Namen f&uuml;r 
unsere Softwareschmiede aus, suchen uns aus den vielen Logos ein passendes 
heraus und w&auml;hlen den gew&uuml;nschten Schwierigkeitsgrad (leicht, mittel oder 
schwer).
Danach kann man noch entscheiden, ob man sich im "freien Spiel" (kein 
festes Ziel, man spielt von 1982 bis 2005 mit 200.000$ Anfangskapital) 
versuchen m&ouml;chte oder ob es doch eher eine Mission sein soll. Nach jeder 
bestandenen Mission werden andere freigeschaltet. Eingangs hat man die 
M&ouml;glichkeit, zwischen "Der Einstieg" (erh&ouml;hen Sie ihr Firmenkapital 
innerhalb von zwei Jahren auf 500.000$) oder "Der erste Erfolg" (entwickeln 
Sie innerhalb von drei Jahren ein Spiel mit einer Spielspa&szlig;bewertung von 
mindestens 80%).

Aber endlich geht es los. Wir befinden uns in einer vertikal scrollenden 
Stadt in sehr guter Qualit&auml;t. Wie gesagt: 800*600*8. Wer die PC-Version 
kennt, wird sich jetzt allerdings wundern, denn diese hat ja 16Bit-
Grafiken. Aber f&uuml;r den Amiga mussten sie heruntergerechnet werden, denn 
sonst w&auml;re es selbst f&uuml;r den PPC kaum zu schaffen gewesen. Allerdings hat 
man sich dabei soviel M&uuml;he gegeben, dass einige Hintergr&uuml;nde (z.B. der 
Himmel) besser aussehen als in der PC-Version.

Screenshot:
<IMG SRC="../extra/softwaretycoon1.jpg" ALT="Screenshot">

Mein B&uuml;ro ist in einem gro&szlig;en Geb&auml;udekomplex untergebracht, wie auch die 
B&uuml;ros meiner Konkurrenten sowie die Entwicklungsabteilung. In der Stadt 
selbst kann man alles andere erledigen, Personal befindet sich in der 
Spielhalle, und in der Pizzeria ist die Mafia untergebracht, welche mir mal 
hilft, falls die Konkurrenz zu stark werden sollte. Zu jedem dieser Orte 
kann man wie bei einem Adventure gelangen. Die Spielfigur folgt einfach 
immer dem Mauszeiger, wenn man einmal klickt. Allerdings springt sie mit 
einem Doppelklick auch sofort zu diesem Ort, damit sich das ganze nicht 
unn&ouml;tig in die L&auml;nge zieht. Aus diesem Grunde kann unten in der Statuszeile 
auch die Spielgeschwindigkeit erh&ouml;ht werden, falls sich mal nichts tun 
sollte. Allerdings kann man diese Zeit auch mit Meinungsforschung 
verbringen, denn durch die Stadt laufen immer ein paar Leute (erinnern ein 
bisschen an Zombies, wie sie so planlos durch die Gegend schlurfen), welche 
ihre Meinung zum Thema Computer gern kundtun.
Aber ich will ein Spiel entwickeln, also gehe ich ins B&uuml;ro. Hier lege ich 
ein Konzept f&uuml;r mein Spiel fest, indem ich einen Namen ausw&auml;hle und ein 
Genre zuordne. Eingangs hat man nur "Arcade" zur Auswahl, sp&auml;ter kann man 
aus f&uuml;nfzehn Genres w&auml;hlen und sogar Genremixes herstellen. Dann kann ich 
erweiterte Angaben zur Qualit&auml;t machen, zum Beispiel zur Art des Sounds 
oder der Grafik. Auch hier ist die Technik am Anfang noch nicht so weit, 
aber in den Computerlabors wird flei&szlig;ig an neuen Techniken gearbeitet. Dazu 
bewegt man sich zum Labor, w&auml;hlt aus, was man erforschen m&ouml;chte (neues 
Genre, Sound, usw.) und wie viel Geld man in diese Arbeit stecken will. Das 
Labor teilt einem dann mit, ab wann die neue Errungenschaft bereit steht. 
Aber wie gesagt: Zu Anfang m&uuml;ssen wir uns mit dem Minimum zufrieden geben. 
So werden wir auch noch keine Kinolizenzen haben, welche jeden Monat (f&uuml;r 
viel Geld) ersteigert werden. Diese h&auml;tte ich dann in mein Konzept 
einflie&szlig;en lassen k&ouml;nnen. Aber was nicht ist, kann ja noch werden. ;-) Zum 
Schluss lege ich noch fest, wie viel Action, Strategie und R&auml;tsel in meinem 
Spiel sein sollen, wie hoch der Gesamtschwierigkeitsgrad sein wird, f&uuml;r 
welchen Markt (Personal Computer oder Konsole, ab 1990 auch Handheld) und, 
ganz wichtig, in welchen Sprachen das Game erscheinen soll.
Sobald das Konzept erstellt ist, erscheint es, ganz wie bei einem 
Adventure, auf dem Schirm, und ich kann es in den Aktenkoffer ziehen. 
Fertig. Nun brauche ich noch jemanden, der f&uuml;r mich programmiert. Also gehe 
ich in die Spielhalle. Dort gibt es immer ein paar Leute, welche f&uuml;r mich 
arbeiten wollen. Ich suche mir die passenden Mitarbeiter aus (am Anfang 
muss ich in der Qualit&auml;t noch ein paar Abstriche machen und werde 
wahrscheinlich nur einen Nobody einstellen k&ouml;nnen). Danach gehe ich in die 
Entwicklungsabteilung.
Hier wird festgelegt, wer welche Arbeiten macht und wie lange ich die 
Truppe an dem Spiel arbeiten lasse. Eine eigene Testabteilung (deren 
Qualit&auml;t wird im Konzept festgelegt) gibt Tipps, wie weit das Spiel ist. 

Screenshot:
<IMG SRC="../extra/softwaretycoon2.jpg" ALT="Screenshot">

Irgendwann bekomme ich eine Mail, dass das Spiel fertig ist. Kurz vorher 
wurde ich schon mal daran erinnert, damit ich noch kurzfristig was &auml;ndern 
kann (mehr Zeit oder so). Wieder in der Entwicklungsabteilung, kann ich das 
fertige Spiel in Form einer Diskette dann an mich nehmen und in den 
Aktenkoffer legen. Noch ist dieser (wieder) leer, aber da ich nur sechs 
F&auml;cher habe, muss ich mich irgendwann mal von einem Spiel trennen. Nun gehe 
ich zur gro&szlig;en Lagerhalle am Ende der Stadt. Hier kann ich den Datentr&auml;ger 
in eine Spieleschachtel stecken und auch per Drag and Drop ein paar 
Gimmicks hinzuf&uuml;gen. Nat&uuml;rlich sollte man immer den Preis im Auge behalten. 
Dementsprechend stelle ich dann auch den Preis pro Spiel ein. Die fertige 
Box ziehe ich wieder in den Aktenkoffer und von dort in die 
Produktionsmaschine. Hier lege ich fest, wie viele Spiele ich wie schnell 
produzieren m&ouml;chte. Nat&uuml;rlich kann ich bei gen&uuml;gend vorhandenem Kapital 
auch neue Maschinen dazukaufen. Sobald die Maschine l&auml;uft, bekomme ich eine 
Verkaufslizenz, welche ich wieder in den Koffer ziehe. Mit dieser Lizenz 
mache ich mich auf zum Spielegesch&auml;ft. Ich ver&ouml;ffentliche mein erstes 
Spiel, indem ich diese Lizenz ins Sortiment ziehe. Was f&uuml;r ein Augenblick! 
In diesen Shop wird es mich immer wieder ziehen, denn hier kann ich sehen, 
wie viele Games verkauft wurden und wie die Spiele der Konkurrenz 
abschneiden, ich kann Testberichte lesen und immer die Charts im Auge 
behalten. Sollte es mal nicht so wie gew&uuml;nscht laufen, muss ich was dagegen 
tun, den Preis senken und/oder Werbung machen. Und nat&uuml;rlich alles 
daransetzen, beim n&auml;chsten Mal ein besseres Spiel zu entwickeln, um 
irgendwann die Nummer Eins zu sein.

Wirtschaftssimulationen haben ja an sich den Ruf, irgendwann einmal 
langweilig zu sein. Was mache ich zum Beispiel, w&auml;hrend ein Spiel gerade 
entwickelt wird? Nun, zum einen sind die Grafiken wirklich so gut, dass 
sich ein "Spaziergang" in der Stadt immer mal lohnt. Aber es wurden auch 
einige ziemlich coole Gags eingebaut. So gibt es immer mal wieder 
Ereignisse, die einen schmunzeln lassen (versucht zum Beispiel mal den 
Cola-Automaten im B&uuml;rogeb&auml;ude: Man h&ouml;rt ein paar kr&auml;ftige Schlucke und ein 
lautes R&uuml;lpsen, und in der M&uuml;lltonne befindet sich Oskar aus der 
Sesamstra&szlig;e! 
Einzig die auf Dauer etwas nervende Hintergrundmusik ist dem Thema "Keine 
Langeweile" nicht gerade dienlich, hier h&auml;tte mir ein CD-Soundtrack besser 
gefallen. Aber die l&auml;sst sich ja abstellen. ;-)
Die Steuerung ist sehr einfach gemacht, so dass man mit wenigen Klicks 
immer das gew&uuml;nschte Ergebnis findet. Durch die verschiedenen Missionen 
wird es auch nie langweilig, weil es immer neue Sachen zu beachten gilt. 
Nat&uuml;rlich kann man diese Wirtschaftssimulation nicht mit den letzten 
Toptiteln wie Earth 2140 oder auch »The Feeble Files« auf eine Stufe 
stellen, daf&uuml;r sind die Genres zu verschieden. Simulationen sind von Natur 
her nicht jedermanns Sache. Wer aber schon immer gern Titel dieser Art 
gespielt hat, wird bei Software Tycoon garantiert auf seine Kosten kommen. 
Bleibt nur zu hoffen, dass sich der Einsatz von Epic f&uuml;r den Amiga lohnt 
und sich Software Tycoon gut verkauft.

J&uuml;rgen A. Theiner &lt;Juergen.Theiner@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
