<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>AMIGA</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="AMIGA.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="AMIGA.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
AMIGA
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Neues aus dem Hause Amiga</H2>
<H3>1. Die Sensation: Amiga bekommt neuen Pr&auml;sidenten</H3>
<P>
Ger&uuml;chte, nach denen der Amiga-Mutterkonzern Gateway &auml;u&szlig;erst unzufrieden
mit dem bisher Geleisteten ist, scheinen sich zu bewahrheiten.
In einer Presseerkl&auml;rung k&uuml;ndigt die Amiga-Entwicklungsabteilung Amiga,
Inc. einen Wechsel an der Spitze der beiden Amiga-T&ouml;chter Gateways, Amiga,
Inc. und Amiga International, an: Neuer Pr&auml;sident der zusammengefassten
Unternehmen wird Jim Collas, ehemals leitender Vizepr&auml;sident beim
Mutterkonzern.
</P>
<P>
Petro Tyschtschenko wird als Leiter der Verkaufs- und Marketingabteilung
Amiga International weiterarbeiten und soll insbesondere die Amiga-Gemeinde
&uuml;ber die NextGeneration-Pl&auml;ne auf dem Laufenden halten.
</P>
<P>
Gleichzeitig wurde die Entwicklung der neuen Amiga-Generation nach San
Diego verlegt. Erste Produkte dieser Reihe sollen noch vor Beginn des
Jahrs 2000 auf den Markt kommen. Zun&auml;chst sind ein Entwicklersystem, eine
Internet-Maschine sowie ein LowCost-Heimcomputer in der Tradition des A500
geplant. Detaillierte Pl&auml;ne und mehrere strategische Partner sollen
w&auml;hrend des Sommers bekanntgegeben werden.
</P>
<P>
Die Produktentwicklung verbleibt in den H&auml;nden von Jeff Schindler,
w&auml;hrend in San Jose, Kalifornien unter der Leitung von Dr. Allan Havemose
ein Softwareentwicklungs-Zentrum aufgebaut werden soll. Das Team zur
Programmierung des neuen auf QNX basierenden Amiga-Betriebssystems soll in
den n&auml;chsten Monaten rapide vergr&ouml;&szlig;ert werden.
</P>
<P>
Hier nun die Presseerkl&auml;rung in einer deutschen &Uuml;bersetzung:
</P>
<P>
&raquo;Amiga ernennt neuen Pr&auml;sidenten und k&uuml;ndigt Pl&auml;ne zur Beschleunigung
der Entwicklung an
</P>
<P>
SAN DIEGO, Kalifornien - 26. Februar 1999 - In einer Reihe von Sitzungen
in San Diego trafen die verantwortlichen Vertreter von Amiga Inc. und
Amiga International zusammen, um die Einzelheiten der technischen,
strategischen und Verkaufs-Planungen festzuklopfen, die als der Beginn
f&uuml;r eine Reihe neuer Amiga-basierender Computer f&uuml;r das n&auml;chste
Jahrtausend angesehen werden.
</P>
<P>
Die Gesellschaft hat ihr Hauptquartier nach San Diego verlegt und
Jim Collas ist der neue Pr&auml;sident von Amiga.
</P>
<P>
&quot;Amiga ist ein erstaunlicher Gl&uuml;cksfall und wir m&uuml;ssen sofort handeln
oder er wird f&uuml;r immer verloren sein&quot;, sagt Collas. &quot;Das Amiga(tm)-
Programm ist ideal f&uuml;r internetgeeignete verbraucherorientierte digitale
Anwendungen der Zukunft. Der Name des Amiga ist weltweit verbunden mit
anwenderfreundlicher preiswerter und leistungsf&auml;higer Computer-Nutzung.
Wir werden diese Philosophie mitnehmen in die n&auml;chste Generation und
Produkte erm&ouml;glichen, deren Anwendungsbereich sich von handlichen
Internet-Ger&auml;ten bis zu grafischen Hochleistungscomputern erstreckt
und die die Anwender unterst&uuml;tzen anstatt sie zu ent&auml;uschen.&quot;
</P>
<P>
Collas, vorher ein leitender Vizepr&auml;sident in Amigas Muttergesellschaft
Gateway, wird Amiga als eine vollst&auml;ndig unabh&auml;ngige Tochterorganisation
betreiben und Amiga Inc. und Amiga International unter der neuen
Gesellschaftsstruktur Amiga integrieren. Seine Leitung wird es der
Gesellschaft erlauben, das Entwicklungsprogramm wesentlich zu
beschleunigen, ein Vorgang, mit dem schon begonnen wurde.
</P>
<P>
Amiga plant, die Produkte der n&auml;chsten Generation weltweit vor dem
n&auml;chsten Jahreswechsel zur Verf&uuml;gung zu stellen. Im Sommer werden
ins Einzelne gehende Produktionspl&auml;ne bekanntgegeben und einige der
strategischen Partner vorgestellt werden. Die f&uuml;r den Start vorgesehenen
Ger&auml;te sind ein Entwicklungssystem, ein Internet-Ger&auml;t und
ein preiswerter Heimcomputer in der Tradition des Amiga A500, der den
Heimcomputerbereich Ende der 80er und Anfang der 90er Jahre dominierte.
Das System f&uuml;r Entwickler wird mit einer Software-Entwicklungsgarnitur
f&uuml;r preiswerte Entwicklungen auf der neuen Ebene zur Verf&uuml;gung gestellt
werden.
</P>
<P>
Jeff Schindler, verantwortlich f&uuml;r die Amiga-Produktstrategie, plant
die neue Produktreihe des Amiga. &quot;Die Amiga-Gemeinschaft hat unglaubliche
Dinge auf einer Ebene fertiggebracht, die offiziell seit acht Jahren nicht
verbessert wurde,&quot; sagt Schindler. &quot;Sie verdient ein System, auf dem sie
ihre Talente voll zur Geltung bringen kann.&quot;
</P>
<P>
Das Verwaltungszentrum von Amiga in San Diego wird in K&uuml;rze durch ein
Software-Entwicklungszentrum unter der F&uuml;hrung von Dr. Allan Havemose,
Vize-Pr&auml;sident des Ingenieurwesens f&uuml;r Amiga, in San Jose, Kalifornien,
erg&auml;nzt werden. Die Silicon-Valley-Mannschaft wird in den kommenden
Monaten schnell vergr&ouml;&szlig;ert werden, um die revolution&auml;ren Multimedia-
Schichten &uuml;ber dem Echtzeit-Neutrino-OS-Kern von QNX Software Systems Ltd.
zu entwickeln.
</P>
<P>
Petro Tyschtschenko wird als Managing Director von Amiga International
fortfahren und eine wichtige Rolle bei der F&uuml;hrung der Amiga-Gemeinschaft
im &Uuml;bergang zur neuen Amiga-Architektur spielen. &quot;Die neuen Pl&auml;ne von Amiga
sind die Wiedergeburt f&uuml;r den Amiga und eine erregende Reise in die
Zukunft,&quot; sagte Tyschtschenko.
</P>
<P>
Weiter Informationen &uuml;ber Amiga und Amiga-Erzeugnisse rufen Sie bitte
bei www.amiga.com und www.amiga.de ab.&laquo;
</P>
<P>
Die &Uuml;bersetzung aus dem Englischen stammt von Gernod Schomberg.
(Quelle des Originals: Amiga)
</P>
<B>Fazit:</B>
<P>
Nun ist Gateway also &quot;endlich&quot; der Geduldsfaden gerissen. Die Berufung
eines neuen Pr&auml;sidenten f&uuml;r beide Amiga-T&ouml;chter l&auml;sst darauf schlie&szlig;en,
dass der Mutterkonzern weder mit der Arbeit der Entwicklungsabteilung noch
mit dem f&uuml;r Verkauf und Marketing zust&auml;ndigen Amiga International zufrieden
ist. Dabei d&uuml;rfte Petro Tyschtschenko in der Beurteilung noch deutlich
besser abgeschnitten haben als Jeff Schindler, widmet sich die
Presserkl&auml;rung doch nur am Rande der in Deutschland ans&auml;ssigen Verkaufs-
und Marketing-Abteilung, die zudem nicht von gro&szlig;artigen &Auml;nderungen
betroffen zu sein scheint.
</P>
<P>
Ganz anders verh&auml;lt sich das bei der Entwicklungsabteilung: Neben einer
Verlegung ihres Hauptquartiers in die N&auml;he des HighTech-Zentrums Silicon
Valley, was ganz sicher kein Nachteil ist, scheinen jetzt endlich alle
Anstrengungen unternommen zu werden, um die Entwicklung des neuen Amiga
voranzutreiben. Einen anderen Schluss l&auml;sst die Presseerkl&auml;rung nicht zu.
Dass der bisherige Chef von Amiga, Inc. im Unternehmen Amiga verbleibt,
bedeutet &uuml;brigens nicht unbedingt, dass sich der neue Pr&auml;sident auf die
Rolle eines Antreibers und Aufpassers beschr&auml;nken wird: Jim Collas besitzt
durchaus technischen Sachverstand und Programmierkenntnisse. Auf der
Londoner World of Amiga im Mai letzten Jahres gab der damalige Senior Vice
President von Gateway zusammen mit Mitarbeitern von Amiga, Inc. erste
Details zum geplanten Amiga-Entwicklersystem bekannt. Er ist mit dem
Projekt &quot;NextGeneration-Amiga&quot; also vertraut und besitzt gewiss die
Kompetenz, eigene Ideen beizusteuern.
</P>
<P>
Eines ist sicher: Jeff Schindler und Petro Tyschtschenko arbeiten bei Amiga
in herausragender Position - aber die wichtigen Entscheidungen trifft von
nun an ein anderer: Jim Collas, der neue Amiga-Chef.
</P>
<P ALIGN="RIGHT">
<A HREF="AMIGA.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="AMIGA2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
