<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses8.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>7. CDCat 3.0 mit PowerPC-Unterst&uuml;tzung und neuen Funktionen</H3>
<H4>&raquo;CDCat Release 3:</H4>
<P>
CDCat, der leistungsf&auml;hige und einfach zu bedienende CDROM-
Katalogisierer mit MUI-Oberfl&auml;che, liegt nach langer Entwicklungszeit
nun in einer neuen Version vor: CDCat Release 3 (v3.0).
</P>
<P>
Bei der Weiterentwicklung wurde viel Zeit investiert, um die W&uuml;nsche
vieler User nach noch mehr Flexibilit&auml;t zu ber&uuml;cksichtigen.
</P>
<P>
So erhalten die User mit CDCat Release 3 eine optimale Kontrolle &uuml;ber
die Scankataloge durch den Katalog-Manager. Auch kann CDCat 3 jetzt nach
Verzeichnissen suchen. Damit die Rechenpower weiterhin voll ausgenutzt
werden kann, bietet CDCat Release 3 nun PowerPC-Suchroutinen, wobei die
Routinen f&uuml;r den MC680x0 nat&uuml;rlich weiterhin voll funktionieren.
</P>
<P>
Auch k&ouml;nnen alte Kataloge und Configfiles problemlos &uuml;bernommen werden.
</P>
<H4>Features von CDCat sind u.a.:</H4>
<UL>
<LI> geeignet zum Katalogisieren s&auml;mtlicher CDs, Festplatten und PD-
     Disketten
</LI>
<LI> superschneller Aminet-Modus, der Aminet-CDs in wenigen Sekunden scannt
    und dabei Alter, Gr&ouml;&szlig;e und Beschreibung ber&uuml;cksichtigt.
</LI>
<LI> schnelle und flexible Suchfunktion (PowerPC; 68k: 85% Inline-
    Assembler!!)
</LI>
<LI> Direktes Durchsuchen (ohne Scankatalog) von Datentr&auml;gern oder
    Verzeichnissen
    m&ouml;glich. So k&ouml;nnen Sie auch auf einfache Weise verlorene Dateien auf
    Ihrer Festplatte wiederfinden.
</LI>
<LI> Browser-Funktion, &uuml;ber die der Inhalt einzelner CDs verzeichnisweise
    wie in einem DirUtil angezeigt werden kann, wobei auch die oben
    genannten Aminet-Erweiterungen angezeigt werden, so dass man sich
    nun nicht mehr durch die Index-Guides auf den Aminet-CDs qu&auml;len muss.
<P>
    =&gt; Durchst&ouml;bern der CDs m&ouml;glich, ohne dass diese eingelegt sind !!!
</P>
</LI>
<LI> 15 frei konfigurierbare User-Kn&ouml;pfe, &uuml;ber die direkt aus CDCat heraus
    Archive entpackt, Bilder angezeigt, Musikmodule abgespielt etc. werden
    k&ouml;nnen.
</LI>
</UL>
<H4>Neu hinzugekommen in Release 3 u.a.:</H4>
<UL>
<LI> PowerPC Plugin um die Suche zu beschleunigen (Die alten
    Routinen funktionieren nat&uuml;rlich immer noch!)
</LI>
<LI> Katalog-Manager um Kataloginhalte neu anzuordnen. Einzelne Disks k&ouml;nnen
    aus Katalogen entfernt werden, in andere Kataloge kopiert werden etc.
</LI>
<LI> Es kann nun auch nach Verzeichnissen gesucht werden.
</LI>
<LI> Filterfunktion f&uuml;r die Suchergebnisliste (&uuml;ber Men&uuml; erreichbar)
</LI>
<LI> Fortschrittsanzeige, wenn &uuml;ber die User-Kn&ouml;pfe Befehle ausgef&uuml;hrt
    werden
</LI>
<LI> M&ouml;glichkeit, Programme im asynchronen Modus zu starten. So mu&szlig; nicht
    mehr &quot;run&quot; vorangestellt werden, was Probleme mit dem Ausgabe-Shell-
    Fenster verursachte.
</LI>
<LI> Die Suchergebnisse werden mit der NList MUI-Klasse (von Gilles Masson)
    dargestellt, so da&szlig; die Liste nun z.B. auch einen horizontalen
    Scroller besitzt.
</LI>
<LI> div. Bugfixes
</LI>
</UL>
<H4>Registrierung:</H4>
<P>
Die Registrierungsgeb&uuml;hr betr&auml;gt 40 DM bzw. 20 Euro. Dann erhalten
die User ein Keyfile, um alle Funktionen uneingeschr&auml;nkt nutzen zu k&ouml;nnen.
</P>
<H4>Upgrades:</H4>
<P>
In diese Version habe ich sehr viel Arbeit investiert, aber da sich die
Anzahl der Amiga-User wahrscheinlich nicht unbedingt vergr&ouml;&szlig;ert hat,
ben&ouml;tige ich auch die Unterst&uuml;tzung der bereits registrierten User von
CDCat Release 1 und 2.
</P>
<P>
Die normale Registrierungsgeb&uuml;hr wurde auf 40 DM erh&ouml;ht, und registrierter
User von CDCat Release 1 und 2 k&ouml;nnen Ihr Upgrade f&uuml;r 20 DM erhalten.
</P>
<P>
User, die sich nach dem 1. November 1998 registrieren lie&szlig;en, erhalten
Ihr Update f&uuml;r 15 DM.
</P>
<P>
Ein Test der Version v1.2 befindet sich in der AmigaPlus 12/97, ein Test
der v2.2 in der AmigaPlus 9/98.
</P>
<P>
N&auml;here Informationen auf der CDCat-Supportseite
<A HREF="http://www.amigaworld.com/support/cdcat" TARGET="_TOP">http://www.amigaworld.com/support/cdcat</A>
Hier gibt es immer die aktuellste Version zum Download, au&szlig;erdem
ist CDCat im Aminet verf&uuml;gbar, util/misc, CDCat30.lha
</P>
<B>Autor:</B>
<P>
Frank Weber<BR>
Schlizstra&szlig;e 53<BR>
74076 Heilbronn<BR>
Deutschland<BR>
E-Mail: <A HREF="mailto:frank@weber.org">frank@weber.org</A>&laquo;<BR>
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses8.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
