<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Diverses</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Diverses.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Diverses
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Das Comeback der EGS Spectrum - oder: Wie User abgezockt werden sollen</H3>
<P>
Vor einigen Tagen erreichte uns die Meldung, dass wieder Exemplare der
ZorroII(I)-Grafikkarte EGS Spectrum verf&uuml;gbar sind, insbesondere bei
amerikanischen H&auml;ndlern. Sie wird mit 2 MB Video-RAM f&uuml;r etwa 190 US-
Dollar, umgerechnet etwa 173 Euro, angeboten.
</P>
<P>
Normalerweise &auml;u&szlig;ern wir uns au&szlig;erhalb von Tests nicht &uuml;ber die Qualit&auml;t
von Produkten, aber da hier ganz offensichtlich versucht wird, die Anwender
mit einem veralteten und &uuml;berteuerten Produkt &uuml;ber den Tisch zu ziehen,
sehen wir uns gezwungen, in diesem Fall eine Ausnahme zu machen.
Bei ihrer Vorstellung, Ende 1993, konnte die EGS Spectrum in Theorie und
Praxis durchaus &uuml;berzeugen - kein Wunder, gab es doch zum damaligen
Zeitpunkt noch keine Cybervision 64 oder &auml;hnlich leistungsf&auml;hige Produkte.
Die Spectrum kann heutzutage jedoch in der Geschwindigkeit mit keiner in
den letzten Jahren erschienenen bekannten Grafikkarte mithalten, so dass es
aus unserer Sicht sehr ratsam erscheint, sich statt dessen eine moderne(re)
Karte zuzulegen, egal ob als Neu- oder Gebrauchtprodukt. Die 3D-Karten
CyberVisionPPC und BVisionPPC von Phase 5 zum Beispiel kosten kaum mehr als
die Spectrum und bieten eine deutlich h&ouml;here Leistung, wie unabh&auml;ngige
Benchmarktests ergeben haben. Andere leistungsf&auml;hige Grafikkarten sind &uuml;ber
den Gebrauchtmarkt zu teilweise deutlich g&uuml;nstigeren Preisen erh&auml;ltlich.
Als Beispiele seien hier nur die Retina BLT Z3 (f&uuml;r Einsteiger), die
CyberVision 64/3D (Allround-Talent der Mittelklasse) oder das schon
angesprochene Vorg&auml;ngermodell CyberVision 64 (der Geheimtip f&uuml;r Nicht-3D-
Nutzer mit ZorroIII-Amiga) genannt. Und wer eine Grafikkarte mit guten
Aufr&uuml;stm&ouml;glichkeiten erwerben m&ouml;chte, ist mit der Picasso IV von Village
Tronic gut bedient, die neu allerdings nicht ganz billig ist.
</P>
<P ALIGN="RIGHT">
<A HREF="Diverses1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Diverses3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
