<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Forum</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Forum3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Forum.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Forum
</font>
</TD></tr>
</TABLE>
<BR>
<H3>4. Probleme beim Verbindungsaufbau mit AmIRC</H3>
<P>
&raquo;Ich habe folgendes Problem. Ich habe beim St&ouml;bern im Internet eine geniale
Chat-Adresse gefunden. Sie liegt bei
<A HREF="http://unicum-chat.deutschland.de" TARGET="_TOP">http://unicum-chat.deutschland.de</A>:4000. Gechattet habe ich dann immer
direkt von der Uni aus (nat&uuml;rlich nur wenn gerade Leerlauf war :-)), via PC
entweder mit dem Explorer, oder Netscape Communicator (nur wegen der
horrenden Telefonkosten, sonst ziehe ich selbstverst&auml;ndlich den AMIGA vor).
Wie die meisten Chatter wissen, spielt der Suchtfaktor in diesem
Zusammenhang eine nicht unerhebliche Rolle, so da&szlig; ich schlie&szlig;lich auch von
zu Hause aus mein Gl&uuml;ck versuchte. Wie ich bef&uuml;rchtete, ging das jedoch
gr&uuml;ndlich in die Hose, da das Programm &uuml;ber Java- oder wahlweise
Javascript-Applikationen gesteuert wird. Ich verf&uuml;ge &uuml;ber die Aminetversion
von IBrowse und &uuml;ber die neuesten Testversionen von VoyagerNG und AWebII.
Meine letzte Hoffnung, da&szlig; ich &uuml;ber AWebII in den Chat hineingelange, hat
sich schlie&szlig;lich ebenfalls zerschlagen. Vermutlich liegt das an der doch
relativ angestaubten Version des Javascript-supports. CGI scheint dabei
auch eine Rolle zu spielen. Soweit ich wei&szlig;, kann derzeit &uuml;berhaupt noch
kein Amiga-Browser CGI-Programme ausf&uuml;hren.
</P>
<P>
Ich habe dann die neueste Version von AmIRC aus dem Netz gezogen und
versucht hier&uuml;ber in den unicum-chat zu gelangen. Als servername habe ich:
unicum-chat.deutschland.de eingegeben. Als port: 4000. Alle anderen ports,
die bereits in die Serverliste aufgenommen worden sind waren: 6667. Der
bubble-help habe ich entnommen, da&szlig; dies der g&auml;ngige port ist,
verschiedentlich aber auch 6666 oder 6665 verwendet werden k&ouml;nnten (unter
Umst&auml;nden schnellere Verbindung). Von 4000 stand da nat&uuml;rlich nichts. Ich
habe es dennoch mit 4000 versucht, wobei der Verbindungsaufbau zum Server
auch funktionierte. Lediglich das Einloggen klappte nicht. Ich habe
nickname, password etc. eingegeben. Schlie&szlig;lich habe ich es mit 6667 (6666,
6665) versucht. Doch dann kam jedesmal der Hinweis: &quot;can't find port&quot;. Nach
einigen Versuchen, auch mit 2230 als port (Hinweis aus der URL-Zeile im
Browser, wenn ich mich mit meiner Identit&auml;t im Chat befinde), habe ich
schlie&szlig;lich aufgegeben.
</P>
<P>
Interessehalber habe ich dann mal die vorbereiteten Adressen des Programms
ausprobiert. Da gab es dann keine Probleme. Einziges Manko (wenn auch nur
ein geringes): alle Adressen weisen in englischsprachige R&auml;ume, au&szlig;er einer
Schweizer Adresse, die allerdings nicht gefunden wurde.
Wer kann mir bez&uuml;glich meiner Schwierigkeiten einen Rat geben?
Da ich noch nicht besonders viel Kenntnisse (sagen wir kaum) im Umgang mit
IRC und diversen Chat-Programmen besitze, bitte ich meine, f&uuml;r
eingefleischte IRCler wahrscheinlich d&auml;mlichen Fragen zu entschuldigen.
</P>
<P>
Eine wichtige Frage noch: Wie kann man unterschiedliche IRC-Adressen (v.a.
deutschsprachige) ausfindig machen?
Ein Tip: Ihr k&ouml;nntet ja 'mal in einer der n&auml;chsten Ausgaben einen &Uuml;berblick
&uuml;ber IRC-Adressen (&auml;hnlich Euer Mailboxliste) geben. (Gibt es jemanden, der
bereit ist, eine entsprechende Auflistung zu erstellen?; Anm. d. Red.)
</P>
<P>
Wenn es noch mehrere User gibt (vielleicht bin ich ja doch nicht der
Einzige), die sich in diesem Bereich nicht so auskennen, k&ouml;nntet ihr ja
eventuell 'mal einen workshop zum Thema IRC bringen. (Gibt es jemanden, der
bereit ist, einen IRC-Workshop zu schreiben?; Anm. d. Red.)
</P>
<P>
Gordon Muth &lt;<A HREF="mailto:Gordon.Muth@rz.ruhr-uni-bochum.de">Gordon.Muth@rz.ruhr-uni-bochum.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Forum3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Forum5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
