<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gehört - notiert</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Diverses13.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Geh&ouml;rt - notiert
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Geh&ouml;rt - notiert</H2>
<H2>AMIGA-Meldungen</H2>
<UL>
<LI> Ateo Concepts beabsichtigt, einen Flickerfixer zu produzieren, sofern es
  mindestens 150 Vorbestellungen gibt. Das Produkt soll sowohl in einer
  Version als Erg&auml;nzung zur Grafikkarte Pixel 64 als auch in A1200- und
  A2000/3000/4000-Versionen auf den Markt kommen. N&auml;here Informationen
  gibt es auf <A HREF="http://www.ateo-concepts.com" TARGET="_TOP">http://www.ateo-concepts.com</A>.
<BR>
  Den deutschen Vertrieb von Produkten des Herstellers hat &uuml;brigens der
  Softwareservice Seidel (<A HREF="http://www.seidel-online.de" TARGET="_TOP">http://www.seidel-online.de</A>) &uuml;bernommen.
</P>
</LI>
<LI> Vor wenigen Tagen ist ein Abspieler f&uuml;r das Multimedia-Format 'ShockWave'
  (Dateiendung: .swf) erschienen, der sich auch in Verbindung mit den WWW-
  Browsern Voyager, AWeb und IBrowse einsetzen l&auml;sst. Der ShockWave-Player
  kann auf <A HREF="http://www.amigart.com" TARGET="_TOP">http://www.amigart.com</A> heruntergeladen werden, bietet in der
  aktuellen Version jedoch noch keine Tonausgabe und ist recht 'buggy'.
</P>
</LI>
<LI> Die aMozilla-Homepage ist in den vergangenen Wochen mehrmals umgezogen.
  Bei Redaktionsschluss ist sie unter <A HREF="http://www.amozilla.force9.co.uk" TARGET="_TOP">http://www.amozilla.force9.co.uk</A> zu
  finden.
<BR>
  Eine erste Version des WWW-Pakets soll es offenbar schon im April geben.
  aMozilla wird nicht ausschlie&szlig;lich auf dem Netscape-Sourcecode basieren,
  sondern aus Geschwindigkeits- und Effizienzgr&uuml;nden sowie zur Verringerung
  der Programmgr&ouml;&szlig;e auch Amiga-spezifischen Code beinhalten. Die
  Integration von Abspielern f&uuml;r RealAudio und ShockWave ist geplant.
</P>
</LI>
<LI> Es gibt wieder Hoffnung f&uuml;r eine Amiga-Version von Opera! OperaSoftware
  steht in Verhandlungen mit einem deutschen Team, die offenbar gute
  Fortschritte machen. N&auml;here Informationen gibt es auf
  <A HREF="http://www.operasoftware.com" TARGET="_TOP">http://www.operasoftware.com</A>.
</P>
</LI>
<LI> Der Autor der Multimedia-Abspieler CyberQT und CyberAVI hat den
  Sourcecode seiner Programme im Aminet ver&ouml;ffentlicht
  (dev/misc/CyberXXXSrc.lha), um die Weiterentwicklung der Programme zu
  erm&ouml;glichen.
</P>
</LI>
<LI> Warp3D v2 ist in einer Betaversion erschienen, die auch Support f&uuml;r den
  Permedia2-Grafikprozessor, der auf der CyberVisionPPC und BVisionPPC zum
  Einsatz kommt, enth&auml;lt. Download ist auf ftp://ftp.haage-partner.com
  m&ouml;glich.
</P>
</LI>
<LI> Samplitude Opus-SE 3.5R9 l&auml;sst sich nun kostenlos auf
  <A HREF="http://www.act-net.com/Prelude/news.html" TARGET="_TOP">http://www.act-net.com/Prelude/news.html</A> herunterladen.
</P>
</LI>
<LI> Der Autor von Jey Visual Pascal (Aminet: dev/lang/jvp.lha) ruft
  insbesondere Programmierer auf, ihm per E-Mail (<A HREF="mailto:Shirdash@www.dci.co.ir">Shirdash@www.dci.co.ir</A>)
  mitzuteilen, ob sein Programmiersystem als n&uuml;tzlich empfunden wird. Von
  dem Resultat dieser Aktion will er es abh&auml;ngig machen, ob das Programm
  weitergef&uuml;hrt wird oder nicht.
</P>
</LI>
<LI> Die Workbench-Erg&auml;nzung MARInA wurde in EASys! umbenannt. N&auml;here
  Informationen zu dem Shareware-Programm findet man auf
  <A HREF="http://www.amigaworld.com/image/easys!.html" TARGET="_TOP">http://www.amigaworld.com/image/easys!.html</A>.
</P>
</LI>
<LI> Drei Meldungen von der Amiga Arena (<A HREF="http://online-club.de/~ARENA/" TARGET="_TOP">http://online-club.de/~ARENA/</A>):
<P>
  &raquo;Highlight -- Brandneu -- Exclusiv
</P>
<P>
  DAS Katalogisier-Programm f&uuml;r den Amiga Classic!
</P>
<P>
  CDCat Release 3 mit PPC Support
  ab sofort in der Amiga Arena zum Sonderpreis!
</P>
<P>
  Die Amiga Arena bietet allen Besuchern der Amiga Arena
  CDCat 3 f&uuml;r 30 DM an!&laquo;
</P>
<P>
  &raquo;WHDLoad
  Das Installer Tool WHDLoad mit weit ueber 100 Installern fuer Classic
  Amiga Spiele jetzt in der Arena fuer 20DM!
</P>
<P>
  MT Rechnung III
  Ab 01.03.1999 gibt es die Verwaltungs Software MT Rechnung III exclusiv
  in der Amiga Arena fuer 12 EUR !!&laquo;
</P>
<P>
  (Quelle: Amiga Arena)
</P>
</LI>
<LI> Auf <A HREF="http://www.regensburg.baynet.de/cyco/linuxindex.html" TARGET="_TOP">http://www.regensburg.baynet.de/cyco/linuxindex.html</A> wurde eine
  Support-Homepage f&uuml;r APUS, der Linux-Version f&uuml;r PowerUp-Amigas
  eingerichtet.
</P>
</LI>
<LI> Der APC&amp;TCP-Computerclub und -Vertrieb hat eine neue Adresse: APC&amp;TCP,
  Postfach 83, 83236 &Uuml;bersee.
</P>
</LI>
<LI> Die Dachorganisation (ehemals Dachverband) der Amiga-User-Gruppen (DAUG)
  hat eine neue Homepage: <A HREF="http://www.DAUG.Europe.de" TARGET="_TOP">http://www.DAUG.Europe.de</A>.
<BR>
  Der APC&amp;TCP ist &uuml;brigens nicht mehr Mitglied in der DAUG, als Begr&uuml;ndung
  f&uuml;r den Austritt wurden pers&ouml;nliche Gr&uuml;nde des APC&amp;TCP-Clubchefs Andreas
  Magerl angef&uuml;hrt.
</P>
</LI>
</UL>
<H2>Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)</H2>
<UL>
<LI> &quot;Stimm gegen SPAM&quot; hei&szlig;t eine Initiative vom c't Magazin und politik-
  digital, die zum Ziel hat, die Anwender gegen das sogenannte Spamming,
  also das Verschicken von Werbe-Mails, zu mobilisieren. Jedermann ist
  aufgerufen, die Petition mit seiner Stimme zu unterst&uuml;tzen. Das Ergebnis
  der Aktion soll u.a. den Abgeordneten des Europ&auml;ischen Parlaments
  vorgelegt werden. N&auml;here Informationen gibt es auf
  <A HREF="http://www.politik-digital.de" TARGET="_TOP">http://www.politik-digital.de</A>.
</LI>
</UL>
<P ALIGN="RIGHT">
<A HREF="Diverses13.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
