<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele5.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Review: Zombie Massacre</H2>
<P>
Das Spiel Zombie Massacre von Alpha Software erscheint in der bekannten
CD-H&uuml;lle, in der sich diesmal sogar eine CD-ROM befand (!). Die CD-ROM
ist gut zu einem Drittel gef&uuml;llt, wovon das eigentliche Spiel allerdings
nicht sehr viel in Anspruch nimmt. Die CD-H&uuml;lle macht Hunger auf das
Spiel, lockt man doch mit Aussagen wie 'It`s a brilliant game and I suggest
you get it pretty soon. 96%', auch die Features h&ouml;ren sich nicht
schlecht an. Eine gedruckte Anleitung sucht man allerdings vergeblich.
</P>
<P>
Jetzt kommt schon das erste 'Highlight' dieses Spieles: Die Installation!
Als ich zum ersten Mal die Installation startete, endete es mit einem
Total-Absturz, was ich darauf zur&uuml;ckf&uuml;hre, dass ich gerade den Eagleplayer
laufen hatte. Beim zweiten Versuch landete ich nun im Commodore Installer
und konnte mir herrlich flimmernden Scrolltext ansehen (im Installer!)
Auch &ouml;ffnete sich automatisch ein zweites Programm was in einem Fenster
ebenfalls etwas Text scrollte. Nach kurzer Wartezeit wurde pl&ouml;tzlich
auch noch eine Musik gespielt....Dann wurden einige Dateien (nicht mehr
als 100kb) installiert. Leider werden die Devices und Libraries
einfach in die jeweiligen Verzeichnisse kopiert, ohne Versionsnummern
zu beachten. Dies k&ouml;nnte zu einigen Schwierigkeiten mit verschiedenen
Kickstarts f&uuml;hren! Nach der Installation befindet man sich gleich
im AmigaGuide Handbuch: Kommen wir also zur Story....
</P>
<P>
Wie der Titel schon sagt, geht es um Zombies, die aus biochemischen
Experimenten irgendwann im Jahr 2009 ausgebrochen sind und nun
die Gegend unsicher machen. Durch die Experimente wurden den
Zombies mehr Kr&auml;fte und l&auml;ngere Lebensdauer verliehen. Die meisten
Zombies sind eine Mischung aus Mensch, Tier und Pflanze. Du
musst nun ausger&uuml;stet mit einigem an Equipment diese 'Biester'
umlegen. Die Original Story ist &uuml;brigens noch um einiges l&auml;nger,
ich habe hier nur die wichtigsten Details angegeben.
</P>
<P>
Nun zu den FMV (Full Motion Video) Sequenzen, die auf der CD-ROM
reichlich verhanden sind und zu Fastnacht sicher der Knaller
gewesen w&auml;ren. Gefilmt in bester Schwarz/Wei&szlig; Qualit&auml;t sieht
man hier Gareth Murfin (Hauptautor des Spiels) und einige seiner
Freunde durch Haus und Garten als Zombies spazieren. Unterlegt
mit passenden Ger&auml;uschen eine echte Lachnummer. Selbstverst&auml;ndlich
werden diese 'Zombies' dann auch umgelegt und das sieht wieder
unheimlich professionell aus! Tja, ob man es glaubt oder
nicht, es gibt sogar Outtakes auf der CD-ROM genauso wie
ein richtiges Storyboard zu den Zombieclips...
</P>
<P>
Okay, jetzt geht`s aber los mit dem eigentlichen Spiel: Das
komplette Spiel 'Zombie Massacre' basiert noch auf der alten
Gloom Deluxe 3D Engine, die manch einer noch aus dem Jahr
1996 kennen mag. Genau genommen hei&szlig;t das, es wurden nur die
Grafiken ver&auml;ndert. Zwar hei&szlig;t es, dass es jetzt schneller
sei, dies merkt man jedoch nur auf einem NTSC Monitor, und
wer hat so einen schon in Deutschland. Auf 'normalen' Systemen
sei das Spiel um 3% schneller, hei&szlig;t es. Dies merkt man
nat&uuml;rlich nicht. Wer Gloom Deluxe kennt, der wei&szlig;, dass es
unter keinen Umst&auml;nden ein neuartiges 3D Spiel ist. Ganz
im Gegenteil: Die Gegner sind allesamt 2D und Treppen,
Aufz&uuml;ge, Wasser und sonstige Schmankerl vermisst man
vergeblich. Auch die Grafiken hauen keinen vom Hocker,
obwohl sie durchaus mittelm&auml;&szlig;ig sind. Sonst gibt
es alle Features, die auch Gloom Deluxe hatte: Zwei
Spieler Modus, Netzwerk Modus, verschiedene Blutoptionen
und so weiter.
</P>
<P>
So, jetzt noch was zu den Extras auf der CD: Hier findet
man allerhand Software von Alpha Soft, die gr&ouml;&szlig;tenteils
auch im Aminet zu finden ist. Herausragendes gibt es
nicht, nur kleinere Programme. F&uuml;r den ein oder anderen
mag etwas interessantes dabei sein.
</P>
<P>
Fazit: Die Bewertung dieses Spiels f&auml;llt mir &auml;u&szlig;erst
schwer, da Alpha Software sich anscheinend wirklich
M&uuml;he gegeben hat. Aber leider wurde an der altbackenen
Gloom Deluxe Engine relativ wenig ge&auml;ndert, und ein
Spiel wie Zombie Massacre ist 1999 einfach nicht mehr
zeitgem&auml;&szlig;. Auch am Amiga ist da besseres m&ouml;glich.
Vieles passt au&szlig;erdem nicht so ganz zusammen, spielen
die FMV Sequenzen doch noch in H&auml;usern und G&auml;rten,
h&uuml;pft man im Spiel in Dungeons rum. Auch wird in den
Sequenzen nicht mit Feuerb&auml;llen sondern mit einer
Shotgun geschossen...tja, es wurde halt zuviel von
Gloom Deluxe &uuml;bernommen anstatt neues einzubringen.
Man h&auml;tte aus diesem Spiel wirklich einen Hit machen
k&ouml;nnen, nur nicht mit dieser altbackenen Engine.
So bleibt mir also nichts anderes &uuml;brig, als euch
nun die nicht so tolle Wertung zu pr&auml;sentieren:
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:         Zombie Massacre (Gloom 4)                                |
|  Hersteller:   Alpha Software, ver&ouml;ffentlicht von Islona Entertainment, |
|                vertrieben von Epic Marketing, Paul-Lechler-Strasse 4,   |
|                72076 T&uuml;bingen, Te.07071 63525, <A HREF="mailto:epicmarketing@dialin.net">epicmarketing@dialin.net</A> |
|  Preis:        49 DM                                                    |
|  Datentr&auml;ger:  1 CD-ROM                                                 |
|  Genre:        3D Keller-Action       | Spieler: 1 oder 2               |
|  Sprache:      englisch               | Anleitung: englisch             |
|  System:       mind. AGA, 10 MB RAM, Festplatte, CD-ROM                 |
|                                                                         |
|  Fazit:        Entt&auml;uschend! (Aber die FMV Sequenzen sind lustig!)      |
|                                                                         |
|  Wertung:                                                               |
|                            Grafik:     4/10                             |
|                            Sound:      5/10                             |
|                            Handhabung: 5/10                             |
|                            Spielspa&szlig;:  2/10                             |
|                            GESAMT:      41%                             |
+-------------------------------------------------------------------------+
</PRE>
<P>
Nun noch einige Nachworte: Der Spielspa&szlig; ist wirklich total hin&uuml;ber,
da es jetzt schon das vierte (!) Spiel mit fast identischer Engine ist.
So etwas macht einfach irgendwann keinen Spa&szlig; mehr. Au&szlig;erdem sollte man
aufpassen: Auf der Verpackungsr&uuml;ckseite steht folgendes: 'It`s a brilliant
game and I suggest you get it pretty soon. 96% Neil Bullock (World of
Amiga)'. Diese Aussage bezieht sich auf Gloom 3 !!! Man versucht also
offensichtlich die Leute reinzulegen. Dies vermindert selbstverst&auml;ndlich
auch die Endwertung! Die viel erw&auml;hnten FMV Sequenzen sind &uuml;brigens
nicht als Scherz gedacht, die Autoren meinten das ernst. Leider sind
diese so amateurhaft, dass es wirklich 'nur' ein Lachknaller ist.
</P>
<P>
<A HREF="img/ZombieMassacre1.png"><IMG SRC="thumb/ZombieMassacre1.jpg" WIDTH="76" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A> <A HREF="img/ZombieMassacre2.png"><IMG SRC="thumb/ZombieMassacre2.jpg" WIDTH="76" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A> <A HREF="img/ZombieMassacre3.png"><IMG SRC="thumb/ZombieMassacre3.jpg" WIDTH="76" HEIGHT="96" ALT="Screenshot"  BORDER="0"></A>
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
