<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele2.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>3. Vorwort</H2>
<P>
Hi!
</P>
<P>
Vor Euch liegt ein richtig dicker AMIGA aktuell Spieleteil! Diesen
Monat gibt es sage und schreibe 5 Reviews und 3 Previews. Napalm
wurde gleich zweimal getestet, einmal von mir und einmal von Manni
Froitzheim. Wenn Ihr auch ein Spiel testen wollt, schickt mir
ruhig die Artikel. An den zwei Napalm Tests sieht man mal wieder
wie verschieden die Ansichten sein k&ouml;nnen.
</P>
<P>
Das Top Thema diesen Monat war zweifelsfrei der Text &uuml;ber clickBOOM,
der aufgetaucht ist. Nach der Unterhaltung mit Quake Portierer, glaube
ich auch, dass da etwas Wahres dran ist. Trotzdem sollte man
erstmal abwarten, was clickBOOM in der offiziellen Stellungsnahme
sagen wird.
</P>
<P>
Ein anderes Thema ist mal wieder die Raubkopierei. So hat Titan
Computer gegen&uuml;ber AMIGA aktuell jetzt offiziell best&auml;tigt, dass
alle Projekte bis auf Siedler 2 und Claws of the Devil eingestellt
wurden. Total Combustion und Shadow of the third Moon 2 werden
also nicht mehr erscheinen! Ein Auszug aus dem Schreiben von
Titan Computer: &quot;..., diese Projekte sind der massiven Raubkopierei
und den damit verbundenen extrem schlechten Verkaufszahlen zum Opfer
gefallen. Die Entwickler sahen keine vern&uuml;nftige Basis mehr ihre
Projekte fortzuf&uuml;hren, der sowieso schon sehr kleine Amigamarkt wird
durch diese Bastarde, die die Raubkopien im Umlauf bringen, schwer
belastet.Leider haben diese Idioten absolut nichts dazu gelernt. Ich
hoffe nur, da&szlig; unsere beiden aktiven Projekte (Claws und Siedler2)
denen nicht auch noch zum Opfer fallen. ES REICHT.&quot; Klare Worte also!
Alle, die sich noch nicht des Ausma&szlig;es der Raubkopierei sicher
waren, werden das sp&auml;testens nach diesem Auszug sein.
</P>
<P>
Diesen Monat wurden relativ viele Spiele ver&ouml;ffentlicht und auch
gleich getestet. Also diese Ausgabe k&ouml;nnt Ihr ausf&uuml;hrliche Reviews
von Zombie Massacre, Imperator, Gunbee F99 und Napalm lesen.
Au&szlig;erdem gibt`s Previews von Nuxelia, Super Soni und Virtual
Grand Prix. Es f&auml;llt auf, dass die meisten Spiele grafisch nicht
mehr zeitgem&auml;&szlig; sind, dies machen dann letztendlich auch die
schlechten Wertungen aus. Das tut mir ja auch leid, aber ich
werde auf keinen Fall besser bewerten, als das Spiel wirklich
ist, im Gegensatz zu einer Amiga Zeitschrift, die die letzte
Zeit nur noch Wertungen &uuml;ber 90% vergibt. Wer darauf reinf&auml;llt
ist selber Schuld. Auch wenn es nicht mehr soviele Amiga
User gibt, ist das noch lange kein Grund, sie abzuzocken mit
irgendwelchen Fantasie Wertungen...naja, ich glaube ich
schweife vom Thema ab. Aber das &auml;rgert mich wirklich jedesmal,
wenn ich diese Zeitschrift, die fr&uuml;her mal so gut gewesen
ist, aufschlage, und finde kein Programm, welches unter 90%
bekommen hat, und das schon seit 4 Monaten! Ich finde ja
auch, dass man den Amiga unterst&uuml;tzen muss, aber doch nicht
mit Fake Wertungen!?! F&uuml;r Meinungen zu diesem Thema habe
ich nat&uuml;rlich wie immer ein offenes Ohr! Um jetzt noch mal
auf die grafische Qualit&auml;t der neuesten Spiele zur&uuml;ckzukommen,
also, vieles was momentan so erscheint ist auf dem grafischen
Stand von 1992. Und dann ben&ouml;tigen diese Spiele auch noch
AGA!!
</P>
<P>
Okay, ich hoffe dieses Vorwort war nicht zu negativ, aber
momentan laufen schon so einige komische Sachen...naja,
trotzdem viel Spa&szlig; mit dieser Ausgabe w&uuml;nscht Euch
</P>
<P>
Andreas<BR>
(<A HREF="mailto:Andreas.Falkenhahn@gmx.de">Andreas.Falkenhahn@gmx.de</A>)<BR>
</P>
<P>
(Andreas Falkenhahn, An der Trift 2, 36132 Eiterfeld-Arzell)
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele2.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
