<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele4.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>5. Review: Gunbee F99</H2>
<P>
Das Spiel Gunbee F99 wurde von APC&amp;TCP vor Kurzem ver&ouml;ffentlicht
und kommt in einer CD-H&uuml;lle, worin sich leider zwei Disketten
befinden. Eine gedruckte Anleitung gibt es nicht, stattdessen
findet man nach der Festplatteninstallation, die mittels des
Commodore Installers reibungslos von statten geht, zwei AmigaGuide
Dokumente, einmal eine deutsche und einmal eine englische
Anleitung zu Gunbee F99.
</P>
<P>
Die Story handelt vom Planeten Valstyx und dessen Prinzessin
Akiko, die v&ouml;llig unerwartet von den Truppen des b&ouml;sen Lord
Khenmir &uuml;berfallen und entf&uuml;hrt wird. Au&szlig;erdem nehmen die
Banditen noch die f&uuml;nf magischen Kristalle mit, die f&uuml;r die
Ruhe auf dem Planeten sorgten. Daraufhin entwickelten die besten
Architekten des Planeten die Gunbee F-99, einen mobilen
Kampfanzug, in dem du, Kiara McGuire, die Lady Akiko sowie
ihre f&uuml;nf k&ouml;niglichen Kristalle aus den Klauen des b&ouml;sen
Lord Khenmir retten sollst.
</P>
<P>
Nachdem Start des Spieles erscheint erstmal ein anfangs
etwas verwirrender Bildschirm, indem man einige Video Optionen
sowie die Sprache einstellen muss. Leider werden diese
Einstellungen nicht gespeichert, so dass man bei jedem
Start alles neu einstellen muss. Danach erscheint das
Intro, aus einigen sp&auml;rlich animierten, jedoch farbenfrohen
Bildern. M&ouml;chte man das Intro &uuml;berspringen, werden schon
ein paar Versuche n&ouml;tig, denn die Joystick Abfrage scheint
hier nicht sehr genau zu sein. Im Hauptmen&uuml; kann man noch
verschiedene Optionen &auml;ndern und zwischen den zwei Spielmodi
ausw&auml;hlen: Honey Mode und Story Mode, Wobei der Honey Modus
eher f&uuml;r Beginner und der Story Modus f&uuml;r Experten gedacht
ist. Nun nur noch den Mausknopf dr&uuml;cken und los geht`s!
</P>
<P>
Und schon befinden wir uns im Spiel, dessen Bildschirm-
ausschnitt allerdings recht klein ausf&auml;llt. Auch die
Sprites sind relativ winzig. Abgesehen davon spielt sich
Gunbee recht solide. Die Steuerung erfolgt entweder mit
zwei Button Joystick oder mit Joystick und Tastatur.
Die Gegner bewegen sich zwar wenig intelligent, trotzdem
ist es nicht gerade einfach die Levels zu meistern.
Aufgrund der kleinen Sprites muss man genau hinsehen,
sonst ist das Spiel recht schnell vorbei. Ansonsten
macht das Spiel mittelm&auml;&szlig;ig Spa&szlig;.
</P>
<P>
Fazit: Die relativ gelungene Spielengine leidet unter
altbackenen Grafik. Gunbee macht zwar Spa&szlig;, aber die
Grafik mag nicht so recht &uuml;berzeugen. Die Sprites sind
zu klein, der Bildschirmausschnitt ist zu klein und
es gibt zu wenige Farben. Dabei ben&ouml;tigt das Spiel doch
AGA und 4MB Extraspeicher! Da h&auml;tte man doch wirklich
mehr draus' machen k&ouml;nnen! Von der Grafik scheint man
sich ins Jahr 1992 zur&uuml;ckversetzt. Die Musik und die
SoundFX sind da schon etwas besser ausgefallen.
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:          Gunbee F-99                                             |
|  Hersteller:    Lobsang Alvites Szaler, ver&ouml;ffentlicht von APC&amp;TCP,     |
|                 Dorfstrasse 17, 83236 &Uuml;bersee                           |
|                 Tel: 08642 899953, E-Mail: <A HREF="mailto:andreas@chiemgau.baynet.de">andreas@chiemgau.baynet.de</A>   |
|  Preis:         49 DM                                                   |
|  Datentr&auml;ger:   2 Disketten                                             |
|  Genre:         Shoot `em` Up          | Spieler: 1                     |
|  Sprache:       englisch, deutsch      | Anleitung: deutsch, englisch   |
|  System:        mind. AGA, 2 MB Chip RAM &amp; 4 MB Fast RAM, Festplatte    |
|                                                                         |
|  Fazit:         Trotz altbackener Grafik mittelm&auml;&szlig;iger Spielspa&szlig;        |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     4/10                            |
|                             Sound:      7/10                            |
|                             Handhabung: 6/10                            |
|                             Spielspa&szlig;:  6/10                            |
|                             GESAMT:      56%                            |
+-------------------------------------------------------------------------+
</PRE>
<P ALIGN="RIGHT">
<A HREF="Spiele4.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
