<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele7.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Review: Napalm (von Manni Froitzheim)</H2>
<P>
Als alter Strategiespielfan habe ich wie viele andere auch
sehns&uuml;chtig auf Napalm gewartet in der Hoffnung,das endlich mal
wieder ein Knaller auf dem Amiga das Licht der Welt erblickt.
Nach jeweils 4 gespielten Missionen (jeweils die der Menschen und
der Roboter) m&ouml;chte ich meine ersten Eindr&uuml;cke des Spieles wiedergeben.
</P>
<P>
Das Cover ist grafisch gef&auml;llig und das Installieren erfolgt bequem
per Installerscript. Allerdings wird die CD im Laufwerk ben&ouml;tigt,es
sei den man &auml;ndert das Startscript und kopiert die Dateien von CD auf
Platte.
</P>
<P>
Eine AmigaGuide Anleitung oder Readme Datei sucht man vergebens,das
Booklet enth&auml;lt die gesamte Anleitung zum Spiel und ist wie der Rest
des Spieles komplett in Englisch gehalten. Der erste Minuspunkt.
</P>
<P>
Hat man das Spiel installiert,ruft man das NapalmSetup Programm auf,
in der man die Grundeinstellungen vornehmen kann.Ach ja,AHI kann man
zwar ausw&auml;hlen,aber dann erscheint eine Meldung das der entsprechende
Treiber bisher nicht verf&uuml;gbar sei und das man die clickboom Seite
besuchen solle. Das ist Minuspunkt Nr.2.
</P>
<P>
Dann startet man das Spiel und kann dann w&auml;hlen,ob man ein Spiel laden,im
Netztwerk spielen oder eine der Missionen spielen m&ouml;chte. Bei den Missionen
w&auml;hlt man entweder die UEDF (United Earth Defense Forces) oder die Roboter
und schon kann es losgehen.
</P>
<P>
Das Spiel l&auml;uft z&uuml;gig ohne zu ruckeln,ist grafisch hervorragend erstellt
und die winzigen Schatten der Soldaten und Fahrzeuge zeugen von Liebe
zum Deatail.Das gleiche gilt auch f&uuml;r die animierten Geb&auml;ude,das ist
wirklich toll gemacht.&Auml;hnliches gilt f&uuml;r den Sound.Der l&auml;uft bei mir
&uuml;ber eine Soundkarte in einen Kennwood Verst&auml;rker mit 3-Wege Ba&szlig;reflex
Boxen.Da wackelt das Regal wenn wann aufdreht.Interessant ist,das nur
Gefechtsl&auml;rm ert&ouml;nt,wenn man dieses auf dem Schirm hat.Scrollt man weg
wird der L&auml;rm leiser und verschwindet dann ganz.Gut ausgedacht !
</P>
<P>
Dumm an dem Spiel ist,das es nur Missionen gibt,welche man auch nicht
laden kann.Man ist also gezwungen,das ganze Spiel von vorne bis hinten
zu spielen ohne die M&ouml;glichkeit,z.B nur die letzten 3 Missionen sp&auml;ter
nochmal spielen zu k&ouml;nnen. Es gibt keinen Leveleditor und keine M&ouml;glichkeit
Spiele per Zufallsgenerator kreieren zu lassen.
Minuspunkt 3 und 4.
</P>
<P>
Hat man ein Geb&auml;ude in Auftrag gegeben und m&ouml;chte das Fertige plazieren,
dumerweise dort,wo sich noch eine Einheit befindet mu&szlig; man die Einheit
erst wegziehen und anschlie&szlig;end ist das Geb&auml;ude nicht mehr vorhanden und
man mu&szlig; es neu erbauen lassen. Minuspunkt 5.
</P>
<P>
&Uuml;ber das Numpad hat man die M&ouml;glichkeit direkt in verschiedene Ecken
und Positionen des Spielfeldes zu springen,da alles Unerforschte
allerdings schwarz ist,kann man so schnell die Orientierung verlieren.
Au&szlig;erdem sind die Spielfelder etwas &uuml;berdimensioniert.
</P>
<P>
Das gravierendste an dem Spiel ist der Aspekt der &quot;Strategie&quot;.Mag sein,
das f&uuml;r mich Strategie was anderes bedeutet als f&uuml;r die Spielehersteller
oder unsere Amiga Fachzeitungen.Fakt ist,von Strategie merke ich absolut
nicht viel,es gibt keine Gel&auml;nde oder Bodenformationen,die Auswirkungen auf
strategische Entscheidungen haben.Ab und zu mal einen Panzer oder 2-3
Soldaten anrollen zu lassen nenne ich nicht Strategie sondern Dummheit.Und
wenn die dann nur kurz auftauchen und sofort wieder verschwinden nervt das
ziemlich.
</P>
<P>
Ich denke,die Missionen sind von Clickboom deswegen als Spielgrundlage
gew&auml;hlt worden,weil das Spiel sonst ziemlich langweilig wrken w&uuml;rde.Und
wenn man dem menschlichen Spieler eine schwierige Mission gibt,wenig Geld,
kaum Geb&auml;ude und wenig Auswahlm&ouml;glichkeit an Einheiten,dann finde ich das
mehr als d&uuml;rftig und hat dann absolut nichts mehr mit einem Strategiespiel
zu tun.Ein koordiniertes Handeln des Computergegners ist absolut nicht zu
beobachten sondern nur wahlloses draufdreschen.
</P>
<P>
Wo sind die Br&uuml;cken,Minenfelder,Stra&szlig;en usw. um mehr Komplexit&auml;t zu
erreichen?
Wo bleiben St&auml;dte,Schiffe und dergleichen mehr ? Wo sind die Fl&uuml;sse,Berge
oder Inseln ? Was ist mit dem Wetter,den Jahreszeiten und den
Bodenbeschaffenheiten ? Ein ganz dicker Minuspunkt.
</P>
<P>
Dumm ist auch,das das Spiel keinen Zweispielermodus besitzt,sondern nur
Netzwerkf&auml;hig ist,nach Beschreibung auch nur &uuml;ber eine serielle Verbindung.
Ethernetkarten werden bislang wohl nicht unterst&uuml;tzt.Noch ein dicker
Minuspunkt.
</P>
<P>
Um das Spiel f&uuml;r mich zu einem echten Hit zu machen geh&ouml;rt ein bi&szlig;chen
mehr,n&auml;mlich:
</P>
<UL>
<LI> komplette deutsche &Uuml;bersetzung
</LI>
<LI> ein Zweispielermodus
</LI>
<LI> ein Leveleditor
</LI>
<LI> ein Zufallsgenerator f&uuml;r neue Level
</LI>
<LI> einstellbare Schwierigkeitsgrade
</LI>
<LI> die M&ouml;glichkeit &uuml;ber Passw&ouml;rter Missionen direkt laden zu k&ouml;nen
</LI>
<LI> Auswahlm&ouml;glichkeit ob Missionen gew&uuml;nscht sind oder ein &quot;generelles
  Spiel&quot;
</LI>
<LI> Unterst&uuml;tzung von AHI und Netzwerkkarten
</LI>
<LI> erheblich bessere &quot;Strategie&quot; des Computergegeners
</LI>
<LI> Einbeziehung von Gel&auml;ndeformationen in  Hinblick auf strategische Belange
</LI>
<LI> Erweiterung der Komplexit&auml;t in Richtung Stra&szlig;en,St&auml;dte,Schiffe u.d.m.
</LI>
</UL>
<P>
W&uuml;nschen w&uuml;rde ich mir weiterhin:
</P>
<UL>
<LI> eine Weltengenerierung sollte m&ouml;glich sein
</LI>
<LI> mehrfache Gegner
</LI>
<LI> M&ouml;glichkeiten zur Diplomatie
</LI>
<LI> Austausch von Handelsg&uuml;tern und Technologie
</LI>
</UL>
<P>
Allerdings werden wir uns von der AUGDD (Amiga User Group Duisburg-
Dinslaken) bald wiedertreffen und dann mit Sicherheit auch mal Napalm
vernetzt spielen.
</P>
<P>
Mal schauen,ob es dann mehr Spa&szlig; macht.
</P>
<P>
Fazit:
Mehr als DM 30.- w&uuml;rde ich f&uuml;r das Spiel nicht ausgeben und wenn sowas
als &quot;bestes Amiga Strategiespiel&quot; gewertet wird,tut es mir f&uuml;r den Amiga
leid.Ich &auml;rgere mich,daf&uuml;r hundert Mark ausgegeben zu haben,das ist es
meines Erachtens nicht wert.
</P>
<P>
Ich hoffe,das Operation:Counterstrike (sofern es auch irgendwann mal
erscheint) besser als Napalm und mit mehr Komplexit&auml;t und einer besseren
Strategie aufwarten wird.
</P>
<P>
Sorry,da bleibe ich lieber bei HistoryLine/BattleIsle,Wargames,dem uralten
Civilization oder dem animierten Echtzeitstrategiespiel &quot;Fields of
Glory&quot;,da ist zumindestens im Ansatz eine Strategie seitens des Computers
vorhanden.
</P>
<P>
Wobei letzteres einem 3 Wahlm&ouml;glichkeiten er&ouml;ffnet und das historische
Umfeld der Schlachten so echt wie m&ouml;glich umgesetzt wurde,so das echte
strategische Entscheidungen aufgrund der &ouml;rtlichen Gegebenheiten m&ouml;glich
sind.Auch wenn die Grafik dieser alten Spiele f&uuml;r heutige Verh&auml;ltnisse eher
d&uuml;rftig erscheinen,so ist der Spielspa&szlig; und die Herausforderung erstmal
wichtiger f&uuml;r mich als eine wahnsinnig tolle Grafik.
</P>
<P>
<A HREF="img/Napalm1.jpg"><IMG SRC="thumb/Napalm1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A> <A HREF="img/Napalm2.jpg"><IMG SRC="thumb/Napalm2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<P>
Mein Rechner:
A4000 mit Cyberstorm MK3 060/50,PicassoIV (mit P96 Software) incl.
Concierto Modul,112 MB RAM,UWSCSI HD mit PFS2.
</P>
<P>
Manni Froitzheim &lt;<A HREF="mailto:m.froitzheim@t-online.de">m.froitzheim@t-online.de</A>&gt;
<A HREF="http://www.verhaltensbiologische-hundeschule.de" TARGET="_TOP">http://www.verhaltensbiologische-hundeschule.de</A>
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele7.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele9.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
