<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Tests.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Update: So senkt ihr eure Telekom-Rechnung!</H3>
<P>
Und auch im Februar stand Mobilcom in den Schlagzeilen: Nachdem das
Unternehmen Anfang des Monats sein 77Mark-Internet-Pauschalangebot wieder
neu gestartet hatte, wollte eine Woche sp&auml;ter der Verbraucherschutzverein
e.V. Berlin bei einer der benutzten Allgemeinen Gesch&auml;ftsbedingungen (AGB)
einen Versto&szlig; gegen das AGB-Gesetz entdeckt haben und drohte Mobilcom bei
Weiterverwendung dieser AGB mit einer hohen Vertragsstrafe, woraufhin
Mobilcom das Angebot auch tats&auml;chlich aufgab. Die Argumentation des
Verbraucherschutzvereins: Mobilcom k&ouml;nne nicht permanent eine freie Leitung
f&uuml;r jeden seiner Internet-Nutzer garantieren.
</P>
<P>
Die meisten von uns k&ouml;nnen bei dieser kleinlichen Sichtweise wohl nur mit
dem Kopf sch&uuml;tteln, denn welcher Provider oder Online-Dienst kann das
schon? Keiner.
</P>
<P>
So ist es auch nicht verwunderlich, dass der Verbraucherschutzverein in den
letzten Wochen w&uuml;sten Beschimpfungen ausgesetzt war, jedoch nicht unbedingt
zurecht: F&uuml;r Mobilcom w&auml;re es n&auml;mlich ein leichtes gewesen, seine
Gesch&auml;ftsbedingungen so zu &auml;ndern, dass sie dem Verbraucherschutz(verein)
gen&uuml;gen. Deshalb ist davon auszugehen, dass dem Unternehmen die
Klageandrohung gerade recht kam, um das Projekt ein f&uuml;r alle Mal
einzustampfen.
</P>
<P>
Es ist kein Geheimnis: Mobilcom hat die durchschnittliche Verweildauer der
Pauschaltarifs-Nutzer im Internet stark untersch&auml;tzt. Das kann keineswegs
verwundern, machte es doch bei den Online-Kosten keinen Unterschied, ob man
innerhalb des g&uuml;ltigen Zeitraums 10 Minuten oder 10 Stunden lang im Netz
war. Und auf die meisten Nutzer traf wohl eher Letzteres zu...
</P>
<P>
Der Verbraucherschutzverein hat mit seiner Aktion genau das Gegenteil
bewirkt, als er - das unterstellen wir ihm einfach mal - beabsichtigte: Der
Verbraucher wurde nicht gesch&uuml;tzt, sondern mehreren Tausend Konsumenten
wurde geschadet, indem man Mobilcom einen mehr oder weniger guten Grund
gab, den Pauschaltarif wieder abzuschaffen. Den bisherigen Nutzern entsteht
dadurch zwar kein direkter finanzieller Schaden, da Mobilcom f&uuml;r Januar und
Februar selbstverst&auml;ndlich auf die Bezahlung der Pauschale verzichtet -
dadurch, dass f&uuml;r Viel-Surfer nun jedoch kein vergleichbares Angebot mehr
existiert, werden ihnen bei Beibehaltung dieser Online-Gewohnheiten
indirekt jedoch deutlich h&ouml;here Kosten entstehen.
</P>
<P>
Aber Schaden genommen haben nicht nur, vielleicht nicht einmal in erster
Linie, die Verbraucher. Nein, als klarer Verlierer geht Mobilcom aus dem
Rennen. Das Unternehmen hat verursucht, den Verbraucherschutzverein zum
S&uuml;ndenbock zu machen. Nicht zuletzt auf Grund einer sehr intensiven
Berichterstattung der Presse scheint dieses Kalk&uuml;l nicht aufzugehen,
Mobilcoms Image, das bereits durch die vielen Pannen des Pauschaltarifs
Schaden genommen hatte, ist schwer besch&auml;digt.
</P>
<P>
Dass nun auch die Zeitschrift Tomorrow, Mobilcoms Partner bei der
Einf&uuml;hrung der Internet-Pauschale, rechtliche Schritte gegen das
Unternehmen angek&uuml;ndigt hat, spricht f&uuml;r sich...
</P>
<P>
Mobilcoms B&ouml;rsenkurs ist in der letzten Februarwoche &uuml;brigens um mehr als
17 Prozent gesunken.
</P>
<P>
Jetzt bem&uuml;ht sich Mobilcom aber offenbar, wieder Vertrauen bei den
Verbrauchern zu gewinnen:
</P>
<P>
Seit der Abschaffung des Internet-Pauschalangebots gilt bei Mobilcom ein
Internet-Minutenpreis von ganztags 6 Pfennig (inklusive Telefongeb&uuml;hren).
Eine Anmeldung ist nicht erforderlich, die Kosten werden &uuml;ber die Rechnung
der Deutschen Telekom beglichen.
</P>
<P>
Dieser Tarif l&auml;sst sich ohne Probleme mit dem Amiga nutzen, da sich die zur
Konfiguration von MiamiInit ben&ouml;tigten Daten allesamt auf der Homepage von
Mobilcom (<A HREF="http://www.mobilcom.de" TARGET="_TOP">http://www.mobilcom.de</A>) abrufen lassen. Tests mit einem 33600bps-
Modem ergaben in den letzten Tagen kaum zu &uuml;bertreffende
Daten&uuml;bertragungsraten, allerdings scheint es hierbei regionale
Abweichungen zu geben. Eine m&ouml;gliche Ursache k&ouml;nnte die unterschiedliche
Auslastung/Qualit&auml;t der Einwahlknoten sein.
</P>
<P>
Zwar will auch T-Online ab April 6 Pfennig pro Minute von seinen Kunden
verlangen, hier jedoch hat man dann immer noch eine Grundgeb&uuml;hr von 8 Mark
zu entrichten, von der Notwendigkeit, sich anzumelden, ganz zu schweigen.
Bemerkenswert ist, dass Mobilcoms Internettarif montags bis freitags
zwischen 9 und 18 Uhr sogar g&uuml;nstiger ist als der Ortsgespr&auml;chstarif der
Deutschen Telekom!
</P>
<P>
Aber Mobilcom geht noch weiter:
</P>
<P>
Seit dem 25. Februar gelten die bislang angemeldeten Kunden vorbehaltenen
g&uuml;nstigen Ferngespr&auml;chstarife auch f&uuml;r Call-by-Call-Verbindungen ohne
Anmeldung. &Uuml;ber die Netzvorwahl 01019 kostet dann eine Minute innerhalb
Deutschlands zwischen 7 und 19 Uhr 16 Pfennig, zwischen 19 und 22 Uhr 8
Pfennig und zwischen 22 und 7 Uhr sage und schreibe 4(!) Pfennig. Damit
muss im g&uuml;nstigsten Fall f&uuml;r eine Ferngespr&auml;chsminute nur noch 1 Pfennig
mehr bezahlt werden als ab April bei einem Ortsgespr&auml;ch &uuml;ber die Deutsche
Telekom!
Achtung: Die Freiminute zwischen 19 und 24 Uhr wurde ersatzlos gestrichen.
</P>
<P>
Auch der Tarif vom Festnetz in ein Mobilfunknetz wurde ge&auml;ndert: Ab sofort
gilt rund um die Uhr an allen Tagen ein Minutenbetrag von 49 Pfennig.
</P>
<P>
Wichtige Neuigkeiten gibt es jedoch nicht nur vom Schlagzeilenk&ouml;nig
Mobilcom:
</P>
<UL>
<LI> Die Telefongesellschaft 01051 bietet t&auml;glich rund um die Uhr
  innerdeutsche Ferngespr&auml;che f&uuml;r 9 Pfennig pro Minute per Call-by-Call
  &uuml;ber die Netzvorwahl 01051 an. Die Abrechnung erfolgt im Minutentakt.
  Achtung: Dieses Angebot kann noch nicht in allen Teilen Deutschlands
  genutzt werden, so dass 01051 in der Tariftabelle noch nicht aufgef&uuml;hrt
  ist. Werktags von 9 bis 18 Uhr w&auml;re bzw. ist 01051 jedoch mit Abstand der
  g&uuml;nstigste Anbieter.
<P>
  Unter der Rufnummer 01051/031 erf&auml;hrt man &uuml;brigens, ob man bereits &uuml;ber
  01051 telefonieren kann.
</P>
</LI>
<LI> Die Firma Teleflash, die werbefinanziertes Telefonieren angeboten hat,
  wurde vom Verbraucherschutzverein &quot;stillgelegt&quot;. Man hat sich bei der
  Aktion auf einen Gesetzesartikel berufen, in dem Telefonwerbung f&uuml;r
  verboten erkl&auml;rt wird (auch wenn der Anlass zur Einf&uuml;hrung dieses
  Gesetzes eine ganz andere Form von Telefonwerbung, n&auml;mlich die durch
  einen Vertreter, war).
</LI>
<LI> Seit einigen Wochen kursieren falsche Mails, in denen vor Hackern gewarnt
  wird, die Mobiltelefonkarten per Anruf kopieren k&ouml;nnten. Wie der
  Netzbetreiber D2 erkl&auml;rte, sei es technisch unm&ouml;glich, &uuml;ber die Chipkarte
  eines fremden Mobiltelefons zu telefonieren. Der Internetdienst ZDNet
  mutma&szlig;t, dass die Warnung in Umlauf gesetzt wurde, um Besitzer von
  Mobiltelefonen zu verunsichern.
</LI>
</UL>
<P>
Durch die &Auml;nderungen bei Mobilkcom ist die Tariftabelle wieder
komplizierter geworden:
</P>
<P>
G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Wann:&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Wohin:&nbsp;</TD><TD VALIGN="TOP">Festnetz -&gt; Festnetz&nbsp;</TD><TD VALIGN="TOP">Festnetz -&gt; Mobilfunknetz&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD COLSPAN="5"><HR></TD></TR>
<TR><TD VALIGN="TOP">werktags 9-18 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 16 Pfg.&sup1;&nbsp;</TD><TD VALIGN="TOP">Mobilcom (01019), 49 Pfg.&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">sa/so/feiert. 9-18 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">TelDaFax (01030), 9 Pfg.&nbsp;</TD><TD VALIGN="TOP">Viatel (01079), 36 Pfg.&sup3;&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">t&auml;glich 18-19 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">TelDaFax (01030), 9 Pfg.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">t&auml;glich 19-22 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Mobilcom (01019), 8 Pfg.&sup2;&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">t&auml;glich 22-7 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Mobilcom (01019), 4 Pfg.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">t&auml;glich 7-9 Uhr&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">TelDaFax (01030), 9 Pfg.&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">Viatel (01079), 36 Pfg.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">&sup1;:&nbsp;</TD><TD VALIGN="TOP">Bei Verbindungen von bis zu etwa 1 Minute Dauer ist TelDaFax (01030) mit&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">17 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup2;:&nbsp;</TD><TD VALIGN="TOP">Bei Verbindungen von bis zu etwa 7 Minuten Dauer kann TelDaFax (01030)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">mit 9 Pfg. g&uuml;nstiger sein (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&sup3;:&nbsp;</TD><TD VALIGN="TOP">An Feiertagen, die nicht aufs Wochenende fallen, ist TelDaFax (01030)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">mit 48 Pfg. g&uuml;nstiger (s.u., Geb&uuml;hrenberechnung).&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:
</P>
<UL>
<LI> Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.
</LI>
<LI> 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.
</LI>
<LI> Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei
  Ortsgespr&auml;chen: Weiterhin die Deutsche Telekom benutzen.
<P>
  Auf <A HREF="http://www.muc.de/~hm/telefon-tarife/tarifzonen.html" TARGET="_TOP">http://www.muc.de/~hm/telefon-tarife/tarifzonen.html</A> k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es mal passieren, dass ihr &quot;f&auml;lschlicherweise&quot; einen der alternativen
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom
</P>
<UL>
<LI> und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.
</LI>
</UL>
</LI>
<LI> Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: <A HREF="http://www.teltarif.de/db/index.html" TARGET="_TOP">http://www.teltarif.de/db/index.html</A>
</LI>
</UL>
<P>
Die Anbieter verfahren bei der Geb&uuml;hrenberechnung teilweise
unterschiedlich:
</P>
<UL>
<LI> TelDafax rechnet sekundengenau ab, d.h. ihr zahlt hier
  wirklich nur f&uuml;r die Zeit, die die Verbindung dauert.
</LI>
<LI> Viatel berechnet bei Verbindungen bis 30 Sekunden Dauer die gesamten 30
  Sekunden, danach wird exakt abgerechnet. ACHTUNG: An Feiertagen, die
  nicht aufs Wochenende fallen, rechnet Viatel nach dem Werktags-Tarif ab.
</LI>
<LI> Mobilcom rechnet nach Minuten ab und ber&uuml;cksichtigt keine Wochenenden und
  Feiertage.
</LI>
</UL>
<P>
F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Tests.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
