<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="produkte6.html">PREV</a> | <a href="diverses2.html">NEXT</a>
<hr>
<pre>

Diverse Neuigkeiten
-------------------

1. Blittersoft ver&ouml;ffentlicht &raquo;BoXeR&laquo;-Details

Hardware-Distributor Blittersoft hat vor kurzem die Preise und 
Spezifikationen des von Index Information entwickelten AMIGA-Clones &raquo;BoXeR&laquo; 
bekanntgegeben.

Nachfolgend die &Uuml;bersetzung der Information zum &raquo;BoXeR&laquo;-Mainboard, im 
Anschlu&szlig; daran folgen die Details des Komplettrechners &raquo;BoXeR - Black Box&laquo;:


&raquo;BoXeR AMIGA MOTHERBOARD

BoXeR - Die neue Amiga-Grundplatine

Die BoXeR-Grundplatine ist eine im mittleren Kostenbereich liegende Grund-
platine f&uuml;r Heim-/halbprofessionelle Multimedia-Computeranwendungen, die
auf dem Amiga-Chip-Satz und dem Amiga-Betriebssystem aufbaut. Dadurch 
werden komplette Maschinen m&ouml;glich, deren Preise zwischen denen von A1200 
und A4000 liegen und damit zu niedrigen Beschaffungs- und Erweiterungkosten 
Leistungen bieten, die die des A4000 &uuml;bertreffen.

Blittersoft wird die neueste Entwicklung des BoXeR auf der bevorstehenden
&quot;World of Amiga&quot;-Austellung in London vorstellen. Dort wird man auch die
Gelegenheit haben, den Entwickler, Mick Tinker, zu treffen.

Als Einf&uuml;hrungstermin f&uuml;r die BoXeR-Grundplatine ist August 1998 
vorgesehen.

Kunden, H&auml;ndler und System-Hersteller k&ouml;nnen ihr Interesse durch Ausf&uuml;llen
und Einsenden unserer &quot;BoXeR Information Request Form&quot; (= Anforderungs-
vorlage f&uuml;r BoXeR-Informationen) anzeigen.

Der BoXeR wird auf drei Wegen vertrieben werden:

 * Als das Herz der neuen Amigasysteme des Blittersoft-Bereichs &quot;Black      
   Box&quot;.
 * Als einzelne Grundplatine an Kunden, die ihr eigenes System
   zusammenstellen wollen.
 * &Uuml;ber OEM-H&auml;ndler, die das Ger&auml;t an ihren eigenen Markt anpassen k&ouml;nnen.

Technische Informationen (&Auml;nderungen sind ohne Vorank&uuml;ndigung m&ouml;glich):

 * 100% kompatibel mit Amiga
 * Auf Amiga-Technologie aufbauende Baby-AT-Grundplatine - Pa&szlig;t in JEDES
   Standard-PC-Desktop/Towergeh&auml;use.
 * Unterst&uuml;tzt werden Motorola 68040 oder 68060 bei 25 bis 75 MHz in einem
   einzelnen Prozessor-Sockel.
 * Auf der Platine sind 2 MB CHIP-RAM.
 * 4 x 72polige Standard SIMM-Sockel erlauben bis zu 2 GB FAST RAM.
 * Doppel-IDE-Festplattenschnittstelle mit 40poligem Stecker mit
   Standardteilung.
 * 2 MB Flash-ROM, 32 Bit breit. Vorgesehen f&uuml;r Kickstart-ROM's und
   residente Module.
 * Disketten-Schnittstelle als df0:, arbeitet mit 0,5 Sekunden
   Verz&ouml;gerung bei RDY.
 * CD-ROM-Audioeingang und Mischer.
 * Echtzeituhr mit NiCd-Akku
 * Tastatureingang hat Standard-DIN-Anschlu&szlig; f&uuml;r PC- oder Amiga-Tastaturen
   (automatische Erkennung).
 * 2 x 16-Bit-Active-ISA-Steckpl&auml;tze in Reihe mit 4 x Zorro-III-            
   Steckpl&auml;tzen.
 * Amiga-Video-Steckplatz.

Verbindungsstecker:

 * Druckeranschlu&szlig;, 26polig Stiftstecker
 * AV Steckplatz - bietet Audio-, Composite- und RGB-Signale.
 * RGB Video (an R&uuml;ckseite der AV-Platine).
 * Serieller Anschlu&szlig;, 10poliger Stiftstecker.
 * Audio-Stiftstecker, 4x1
 * Versorgungsspannungs-Eingang - Standard PC-Stecker mit 12 Stiften.
 * IDE - 40polig (doppelt)
 * Diskettenlaufwerke DF0:/DF1: - Stiftstecker.


Schl&uuml;sselpunkte der Entwicklung:

 * Das vollst&auml;ndig neue Entwurfskonzept verwendet den AGA-Chipsatz, um
   die Kompatibilit&auml;t einzuhalten, hat jedoch eine ganz neu entwickelte
   Logik, um h&ouml;chste Leistung und Flexibilit&auml;t zu erreichen.
 * Unterst&uuml;tzt 68040 oder 68060 von 25 MHz bis 75 MHz.
 * Entworfen, um niedrige Systemkosten zu ereichen.
 * Unterst&uuml;tzt 4 Standard-SIMM-Steckpl&auml;tze mit 72 Anschl&uuml;ssen f&uuml;r insgesamt
   2 GB FAST-RAM.
 * Hochgeschwindigkeits-Lese/Schreib-Technologie f&uuml;r CHIP-Speicher, wodurch
   der Zugrif um 30% beschleunigt werden kann.
 * Pa&szlig;t in Standard-Baby-AT-Geh&auml;use (riesige Auswahl an Geh&auml;usen von einer
   gro&szlig;en Zahl von Herstellern zu niedrigsten Preisen).
 * Prozessor-Steckplatz unterst&uuml;tzt eine preiswerte PowerPC-Aufr&uuml;stung (in
   Entwicklung). Diese Erweiterung erlaubt es, den 680x0-Prozessor im       
   Sockel zu belassen, so da&szlig; die Erweiterung nur wenig mehr als ein        
   PowerPC auf einer Karte ist.
 * MPEG/Genlock-Modul mit Ausgabe in hoher Qualit&auml;t und Genlock-Betrieb in
   Rundfunk-Qualit&auml;t ist in Entwicklung.
 * Enth&auml;lt betriebsbereite 16-Bit-ISA-Steckpl&auml;tze zum Betrieb billiger
   Peripherie-Ger&auml;te, wie z.B. Modems. Ethernet- und Soundkarten.
 * FlashROM erm&ouml;glicht Software- und Hardware-Updates.
 * CDROM-Filesystem im ROM gestattet das Booten von CD's aus.

Ger&auml;tepreis-Informationen

BoXeR (nur Platine) Europa: 408.47 UKP + Mehrwertsteuer (479.95)
BoXeR (nur Platine) USA/Canada: 699 USD&laquo;

(Anm.d.&Uuml;bers.: Ende April 1998 Stand 1 UKP ca. 3 DM)

Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: Blittersoft)


&raquo;BoXeR Tower System

Hochwertige BoXer Amiga-Systeme

Der Blittersoft-Bereich &quot;Black Box&quot; Amiga Tower System  bietet einen
kompletten Amiga mit besten Eigenschaften wie nie zuvor! Wir werden sowohl
die Systeme mit 68040 als auch mit 68060 bereitstellen, mit zusatzlichen
Optionen (in K&uuml;rze vorgestellt), die den fortschrittlichsten und 
wertvollsten Amiga bieten werden, den es je f&uuml;r Geld gab.

Das voraussichtliche Freigabedatum f&uuml;r diese Systeme ist August 1998.


Blittersoft &quot;BoXeR&quot; Black Box Amiga Tower System:

 * Sehr hochwertiges und formsch&ouml;nes Tower-Geh&auml;use
 * BoXeR Grundplatine
 * 68040- oder 68060-Prozessor
 * 32 MB RAM
 * 4.3 IDE UDMA Festplatte
 * High Density Diskettenlaufwerk
 * Maus und Tastatur

Ger&auml;tepreis-Information (vorl&auml;ufig)

BoXeR Black Box Tower 68040 : 899.95 UKP
BoXeR Black Box Tower 68060 : 999.95 UKP&laquo;

(Anm.d.&Uuml;bers.: Ende April 1998 Stand 1 UKP ca. 3 DM)

Die &Uuml;bersetzung stammt von Gernod Schomberg.
(Quelle des Originals: Blittersoft)


Fazit:
------

Das offenbar kurz bevorstehende Erscheinen der ersten halbwegs 
ernstzunehmenden AMIGA-Neuentwicklung seit f&uuml;nf Jahren ist ohne Zweifel ein 
wichtiges Ereignis, leider wird das Ger&auml;t f&uuml;r nicht in Gro&szlig;britannien 
lebende Kunden wohl zu einer recht teuren Sache. Schuld daran ist in erster 
Linie der im Moment &auml;u&szlig;erst ung&uuml;nstige Wechselkurs der britischen W&auml;hrung.
Selbst B&ouml;rsen-Analysten sch&auml;tzen den derzeitigen Kurs des britischen Pfunds 
(1 Pfund kostet ca. 3 Mark) als deutlich zu hoch ein. Erinnern wir uns: Vor 
nicht allzu langer Zeit lag es bei etwa 2,20 Mark! D.h. damals h&auml;tten wir 
mit einem etwa 25 Prozent niedrigeren D-Mark-Preis rechnen k&ouml;nnen. Diesen 
Wert wird das Pfund aufgrund der derzeit recht starken britischen 
Wirtschaft in absehbarer Zeit sicherlich nicht wieder erreichen, aber 
hoffen wir wenigstens, da&szlig; der Kurs in den n&auml;chsten Monaten auf ein 
ertr&auml;glicheres Ma&szlig; sinkt. 
&Uuml;brigens kann man auf <a href="http://www.acay.com.au/~aag/poll.html">http://www.acay.com.au/~aag/poll.html</a> an einer Mini-
Umfrage zum BoXeR teilnehmen.
</pre>
</body>
</html>
