<html>
<head>
  <title>Diverses</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses3.html">PREV</a> | <a href="diverses5.html">NEXT</a>
<hr>
<pre>

4. AMIGA Forever 2.0 erschienen

Die AMIGA-Emulator-CD &quot;AMIGA Forever&quot; ist jetzt in der Version 2.0
erh&auml;ltlich. Zum Preis von 119 Mark (das Update von v1.0 kostet 50 Mark)
erh&auml;lt der K&auml;ufer neben AMIGA-Emulationen f&uuml;r verschiedene Computersysteme,
inklusive der Betriebssystemversionen AMIGA OS 1.0 bis 3.0, auch eine
Netzwerksoftware, um AMIGA und Windows-PC zu verbinden, au&szlig;erdem Personal 
Paint 7.1 und vieles mehr. Es folgt die offizielle Bekanntmachung der 
Schatztruhe GmbH:

&raquo;In dieser Woche haben wir mit der Auslieferung der seit langem erwarteten 
Amiga Forever 2.0 begonnen. Wir m&ouml;chten uns hiermit bei allen Kunden f&uuml;r 
das entgegengebrachte Interesse und f&uuml;r das geduldige Warten bedanken. 

Amiga Forever 2.0 beinhaltet &quot;state of the art&quot;-Software um zwei 
verschiedene Bed&uuml;rfnisse des Amiga Users zu befriedigen:

- Die Emulation der Amiga-Architektur auf der PC-Plattform 

- Datenaustausch zwischen Amiga und anderen Plattformen

Zus&auml;tzlich sind verschiedene Softwarepakete, Einf&uuml;hrungskurse und 
Referenzdateien enthalten, die f&uuml;r jeden Amiga-Enthusiaten von gro&szlig;em 
Interesse sind.

Amiga Forever beinhaltet mehrere hundert Seiten Dokumentation, sowohl im 
AmigaGuide als auch im HTML-Format, mit tausenden n&uuml;tzlicher Links und 
Crossreferenzen.

Amiga Forever 2.0 enth&auml;lt au&szlig;erdem:

- Eine Multiplattform CD-ROM sowie eine Amiga-Floppy-Disk, welche die zum 
Datenaustausch notwendige Software beinhaltet.

- Ein Exklusiv-Interview mit Jay Miner, dem Vater des Amigas. Von der 
Geburt des Amigas bis hin zur Gesellschaftskritik werden eine Vielzahl von 
Themen behandelt. Das Interview liegt sowohl als Audio-Track als auch im 
Textformat vor.

- Die Amiga Explorer 2.0 Netzwerksoftware mit der Sie einen Amiga mit einem 
oder mehreren PCs verbinden k&ouml;nnen. Der Zugriff auf Amiga-Dateien 
(inklusive virtuellem ADF umd ROM-Dateien), Verzeichnisse und Volumes ist 
direkt vom Windows-Desktop m&ouml;glich. Amiga Explorer ist dabei weitaus 
einfacher zu installieren und zu bedienen als eine Vielzahl anderweitig 
verf&uuml;gbarer Netzwerkutilities und unterst&uuml;tzt sowohl serielle Verbindungen 
(Nullmodemkabel) als auch TCP/IP. 

- MHS-Dateisystem mit dem alle Amiga-Computer MS-DOS-Disketten lesen und 
beschreiben k&ouml;nnen.

- Die offiziell lizenzierten Amiga ROM und Workbench-Dateien von Version 
1.0 bis Version 3.0, zum Betrieb der Amiga Emulation.

- Der UAE-Amiga-Emulator f&uuml;r Windows und DOS, sowie der Fellow-Emulator zur 
ausschlie&szlig;lichen Verwendung unter DOS. Experimentalversionen von UAE f&uuml;r 
PowerPC Amiga und PowerMacs sind ebenfalls enthalten.

- Picasso 96 Treiber f&uuml;r die UAE-Emulation, mit Unterst&uuml;tzung von True 
Color und Farbpaletten bis zu 256 Farben.

- Cloantos Personal Paint 7.1 (Malen, Animationen und Bildbearbeitung), 
DirDiff 5.1, AmiToRTF (zur Konvertierung von Amiga-Textung Richting PC). 
Selbstverst&auml;ndlich k&ouml;nnen diese Softwarepakete sowohl auf echten Amigas als 
auch unter der Emulation eingesetzt werden.

- Der &quot;Amiga Interactive Guide&quot; von Gareth Knight; eine Enzyklop&auml;die der 
Amiga-Technologie &amp; Geschichte.

- Alle Upgrades und Zusatzprogramme, die zum Betrieb der Amiga-Emulation 
unter DOS oder Windows notwendig sind. 
&#008;
- Tutorien und Einf&uuml;hrungskurse zu den Themen Datenaustausch, 
Amigaemulation, Floppy-Disks, serielle Verbindungen, TCP/IP, UAE, Fellow, 
... .&laquo;

(Quelle: Schatztruhe GmbH)
</pre>
</body>
</html>
