<html>
<head>
  <title>Gewinnspiel</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="intern4.html">PREV</a> | <a href="forum1.html">NEXT</a>
<hr>
<pre>

Das AMIGA-aktuell-Gewinnspiel
-----------------------------

Es scheint so, als ob die meisten von Euch nicht auf die M&ouml;glichkeit der 
Online-Teilnahme verzichten m&ouml;chten. Anders kann ich es mir nicht erkl&auml;ren, 
da&szlig; diesmal lediglich 14 Leser mitgemacht haben.
Aber keine Sorge: Da&szlig; die letzte HTML-Ausgabe kein Gewinnspiel-Formular 
enthielt, war nichts weiter als ein Versehen.
&Uuml;brigens ist der Einsendeschlu&szlig; ab sofort der 25. jedes Monats. Ihr habt 
also f&uuml;nf Tage l&auml;nger Zeit, um Euch die Antworten einfallen zu lassen...


Zur Aufl&ouml;sung:


Standard-Frage: Nenne eine Firma, die von AMIGA International eine Lizenz   
                zur Vermarktung von AMIGA-Werbeartikeln erhalten hat.
                
Antwort: Hier gab es mehrere Antwortm&ouml;glichkeiten. Niemand mu&szlig;te lange
         suchen, berichteten wir doch in der letzten AMIGA aktuell &uuml;ber die
         Lizenzvergabe an L@Bine. Zuvor erhielten bereits Vidamus, ICP,
         Randomize und einige andere Firmen eine Lizenz zur Vermarktung von
         AMIGA-Werbeartikeln.


Master-Frage: Wie hie&szlig; a) der letzte Gesch&auml;ftsf&uuml;hrer von Commodore          
              Deutschland, und wer war b) sein Vorg&auml;nger?
              
Antwort: Letzter Gesch&auml;ftsf&uuml;hrer von Commodore Deutschland war Alwin        
         Stumpf, sein Vorg&auml;nger der bekannte Helmut Jost. &Uuml;brigens hie&szlig; der  
         Vorg&auml;nger des Vorg&auml;ngers von Alwin Stumpf Alwin Stumpf! Begriffen?

Meinungsfrage: In welchem Zeitraum wird Deiner Meinung nach das 
               AMIGA OS 3.5 erscheinen?


Die Auswertung:

Antwort                                                Anzahl der Nennungen
---------------------------------------------------------------------------
               
1 (Sp&auml;testens Juli '98)                                          2
2 (August '98 bis November '98)                                  4    
3 (Dezember '98 bis M&auml;rz '99)                                    8
4 (Sp&auml;ter als M&auml;rz '99)                                          -
5 (Nie)                                                          -


Fazit:
------

Eine knappe Mehrheit der Teilnehmer geht davon aus, da&szlig; das AMIGA OS 3.5 
erst sehr sp&auml;t im Jahr 1998 bzw. in den drei ersten Monaten 1999 auf den 
Markt kommt.
An die von AMIGA International, Inc. erhoffte Fertigstellung des AMIGA OS 
3.5 bis zur Computer '98 glaubt demnach nur eine Minderheit.
Positiv ist, da&szlig; offenbar jeder fest mit dem AMIGA OS 3.5 in absehbarer 
Zeit rechnet. Dieses setzt jedoch voraus, da&szlig; die Entwicklungsarbeiten bei 
AMIGA, Inc. z&uuml;gig voranschreiten.


Die Gewinner des letzten Gewinnspiels:


1 x Vollversion von &quot;ManiacBall&quot;: Thomas Krpic-Mocilar
1 x Vollversion von &quot;CDCat&quot;: Holger Jeromin
1 x Vollversion von &quot;Vokabi 2&quot;: Wolfram Partikel 
1 x Vollversion von &quot;Crossfire&quot;: Waldemar Nonnenmacher
1 x Pr&auml;sentations-Software &quot;Maxon Multimedia&quot;: Axel Knabe


Herzlichen Gl&uuml;ckwunsch!


Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:


Frank Weber hat sein Programm AFiloFax f&uuml;r das Gewinnspiel zur Verf&uuml;gung 
gestellt:

&laquo;AFiloFaxPro managet Ihr t&auml;gliches Leben. Dazu bietet es eine umfangreiche 
Terminplanerfunktion und dar&uuml;ber hinaus Features wie einen elektronischen 
Notizblock oder Statistikfunktionen, die u.a. die t&auml;gliche Computerlaufzeit 
protokollieren. (Unterst&uuml;tzt MUI)&raquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.

Der Autor von AFiloFaxPro ist unter folgender Adresse erreichbar:

Frank Weber
Schlizstra&szlig;e 53
74076 Heilbronn
Deutschland 

E-Mail: <a href="mailto:fweber@amigaworld.com">fweber@amigaworld.com</a>


Stefan Schulze hat sein Programm Crossfire f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Crossfire ist _Das_ Multiplayer-Shotem'up f&uuml;r 2-4 Spieler (Im Team oder
alle gegen alle). 20 verschiedene Waffen und 15 andere Items sind die
Garantie f&uuml;r monatelangen Spielspa&szlig;. Dazu gibt's noch &auml;u&szlig;erst reichliche 
Optionsmen&uuml;'s z.B. f&uuml;r grundlegende Sachen wie Namen, Farben, Steuerung, 
Rundenanzahl, Spiel-Modi oder auch Panzerungsst&auml;rke und die (speicherbaren)
Highscores.
S&auml;mtliche Waffen, Items und Kampfarenen lassen sich einzeln ab- und
zuschalten, z.B. um sich mit Spiel und Steuerung vertraut zu machen ohne
gleich /&uuml;berrumpelt/ zu werden. Viel Liebe zum Detail, massenweise
kleine Feinheiten und eine effektvolle Aufmachung runden das Spiel ab.&laquo;

Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar.

Der Autor ist unter folgender Adresse erreichbar:

Thomas Schulze
An der Winkelwiese 2
01109 Dresden

E-Mail: <a href="mailto:stefan.cbyte@sz-online.de">stefan.cbyte@sz-online.de</a>


Peter Elzner hat sein Programm Diamond Caves II f&uuml;r das Gewinnspiel zur 
Verf&uuml;gung gestellt:

&raquo;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&ouml;hle m&uuml;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&uuml;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&uuml;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
&#009;&#009;            schneller Prozessor empfohlen, MUI wird f&uuml;r den Editor ben&ouml;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&auml;nkt
Registrierte Version: 40 DM&laquo;

Eine Demo-Version kann von <a href="http://www.diamond-pro.com">http://www.diamond-pro.com</a> heruntergeladen 
werden.

Der Autor ist unter folgender Adresse erreichbar:

Peter Elzner
Grudene 6a
58644 Iserlohn
                  
E-Mail: <a href="mailto:order@diamond-pro.com">order@diamond-pro.com</a> (Bestellungen) bzw.
        <a href="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</a> (Fragen)
        

Des weiteren hat mir Thomas Hasemann das Buch &quot;AMIGA und Video Faszination&quot; 
(inklusive Diskette) zur Verf&uuml;gung gestellt.


Aufruf an alle innovativen Programmierer und AMIGA-Firmen:

Haben Sie Interesse, in einem der bekanntesten deutschsprachigen AMIGA-
News-Magazine, beinahe kostenlos f&uuml;r Ihr(e) Produkt(e) zu werben?
Dann stiften Sie f&uuml;r das AMIGA-aktuell-Gewinnspiel doch einen oder mehrere 
Preise! Jedes Produkt wird mit dem von Ihnen gew&uuml;nschten Text vorgestellt. 
Als H&auml;ndler haben Sie die M&ouml;glichkeit, Ihr Unternehmen besser 
bekanntzumachen.
       

Hier die neuen Fragen (nur ZWEI davon m&uuml;ssen beantwortet werden):


Standard-Frage: Nenne zwei aktuelle oder in Entwicklung befindliche         
                kommerzielle AMIGA-Textverarbeitungen.
                

Master-Frage: Wie lautet die Bezeichnung des im A3000/4000 f&uuml;r die          
              ZorroIII-Ansteuerung zust&auml;ndigen Chips? Welches ist die       
              aktuelle Revision?

             
Meinungsfrage: Wird Phase 5 den geplanten Erscheinungstermin der prebox    
               (Anfang 4. Quartal 1998, siehe AMIGA aktuell 4/98) einhalten  
               k&ouml;nnen?

M&ouml;gliche Antworten:
                  
1: Ja, auf jeden Fall.
2: Ja, wahrscheinlich.
3: Nein, wahrscheinlich nicht.
4: Nein, auf keinen Fall.

Es gen&uuml;gt, die Nummer anzugeben.


Unter allen Teilnehmern, die mindestens ZWEI dieser Fragen bis zum 25. 
Mai (Einsendeschlu&szlig;) beantworten (die Wissensfrage[n] nat&uuml;rlich 
richtig), werden die folgenden Gewinne verlost:


1 x Vollversion von &quot;Diamond Caves II&quot; (Wert: DM 40,-)
1 x Vollversion von &quot;AFiloFaxPro&quot; (Wert: DM 25,-)
1 x Vollversion von &quot;Crossfire&quot; (Wert: DM 20,-)
1 x Buch &quot;AMIGA und Video Faszination&quot; (Neuwert: DM 79,-)


Wer alle drei Fragen beantwortet (die Wissensfragen m&uuml;ssen nat&uuml;rlich 
richtig sein), nimmt mit ZWEI Stimmen an der Verlosung teil und hat somit 
die doppelte Chance auf einen Preis.


Schickt Eure Antworten bitte bis zum 25. Mai an folgende Adresse:

Carsten Schr&ouml;der
Helmoltstra&szlig;e 10
37081 G&ouml;ttingen
Deutschland

oder per E-Mail an:

<a href="mailto:aakt@gmx.de">aakt@gmx.de</a>


Bitte verge&szlig;t nicht, Eure Post-Anschrift anzugeben, und ggf. den 
bevorzugten Preis. Eine Garantie, da&szlig; Ihr im Gewinnfall dann auch genau 
diesen Preis erhaltet, kann nat&uuml;rlich nicht gegeben werden.
</pre>
</body>
</html>
