<html>
<head>
  <title>Geh&ouml;rt - notiert</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="diverses11.html">PREV</a> | <a href="geruechte.html">NEXT</a>
<hr>
<pre>

Geh&ouml;rt - notiert
----------------

AMIGA-Meldungen
---------------

* Das TV-Modul &quot;Paloma&quot; f&uuml;r die Grafikkarte Picasso IV von Village Tronic   
  ist jetzt erh&auml;ltlich. Einige Anwender berichten jedoch &uuml;ber Probleme bei  
  der Benutzung.

* Offenbar gibt es handfeste Pl&auml;ne zur Entwicklung einer Neuauflage der     
  bekannten Videokarte OpalVision. Auf der Homepage                          
  <a href="http://www.geocities.com/SiliconValley/Lab/2056/">http://www.geocities.com/SiliconValley/Lab/2056/</a> finden sich weitere      
  Informationen und auch eine Umfrage.

* Die Aminet CD 24 ist erschienen. Neben etwa 1 GB frei kopierbarer         
  Software beinhaltet sie auch eine Spezialversion des WWW-Browsers         
  IBrowse, die zu einem erm&auml;&szlig;igten Preis auf die Vollversion &quot;upgedated&quot;    
  werden kann.
 
* Die APC&amp;TCP CD Vol. 6 ist auf dem Markt. Sie ist den Tools gewidmet und    
  kostet 24,95 Mark (unverbindliche Preisempfehlung).

* Laut Haage &amp; Partner wurde auf den k&uuml;rzlich abgehaltenen &quot;Magischen Tagen  
  in Trier&quot; die neue Textverarbeitung EasyWriter vorgef&uuml;hrt.

* Nach Angaben von Olaf Barthel bel&auml;uft sich die Gr&ouml;&szlig;e des AMIGA-OS-3.1-    
  Sourcecodes auf etwa 70 MByte Daten.
  Desweiteren deutete er an, da&szlig; das AMIGA OS 3.5 etwas Weitergehendes als  
  nur ein &quot;OS 3.1 mit CyberGfx und AHI&quot; sein wird.

* Auf der Homepage von Haage &amp; Partner (<a href="http://www.haage-partner.com">http://www.haage-partner.com</a>)       
  lassen sich neue Patches f&uuml;r StormC herunterladen.
  Au&szlig;erdem ist ein Update f&uuml;r die Fax-Software STFax (auf v3.2) erschienen.
  Desweiteren hat das Unternehmen f&uuml;nf neue Support-Mitarbeiter             
  eingestellt.

* Das Debug-Tool &quot;Enforcer&quot; ist in der Version 37.73 erschienen und kann    
  u.a. &uuml;ber <a href="http://www.users.fast.net/~michael_sinz/Enforcer/index.html">http://www.users.fast.net/~michael_sinz/Enforcer/index.html</a>     
  bezogen werden.

* Netscape hat wie angek&uuml;ndigt den Sourcecode seines WWW-Browsers           
  &quot;Navigator&quot; freigegeben. &Uuml;ber
  <a href="http://mozilla.alsutton.com/mozilla-devers/platform.html">http://mozilla.alsutton.com/mozilla-devers/platform.html</a> k&ouml;nnen sich      
  &uuml;brigens Softwareentwickler melden, die an der AMIGA-Portierung           
  mitarbeiten m&ouml;chten.

Von DOSen und &Auml;pfeln (sowie weitere Nicht-AMIGA-Meldungen)
----------------------------------------------------------

* Das neue Betriebssystem Windows 98 ist bei seiner Vorf&uuml;hrung durch        
  Microsoft-Chef Gates auf der Computermesse Comdex in aller &Ouml;ffentlichkeit  
  abgest&uuml;rzt. Die Einbindung eines Scanners wurde der Software zum          
  Verh&auml;ngnis.
  
* Gateway 2000 ist im Begriff, die Jahreszahl aus seinem Titel zu           
  streichen. K&uuml;nftig will man sich nur noch &quot;Gateway&quot; nennen. Die Homepage  
  des Konzerns: <a href="http://www.gateway.com">http://www.gateway.com</a>
</pre>
</body>
</html>
