<html>
<head>
  <title>PowerUp-to-date</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="amiga6.html">PREV</a> | <a href="powerup2.html">NEXT</a>
<hr>
<pre>

PowerUp-to-date
---------------

1. Taktfrequenz der Blizzard603e(+)/250MHz auf 240 MHz gesenkt

Phase 5 digital products verwendet wegen langer Lieferzeiten des
PPC603e/250MHz f&uuml;r das leistungsst&auml;rkste A1200-PowerUp-Board nun den
PPC603e/240MHz. Nach Angaben des Herstellers wird die durch eine 
Verringerung des Prozessortakts verbundene Leistungsminderung jedoch durch 
einen h&ouml;heren Bustakt mindestens wieder ausgeglichen.

Hier die offizielle Bekanntmachung von Phase 5:

&raquo;7. April 1998

BLIZZARD 603e/603e+ Power Board

Produkt&auml;nderungs- und Verf&uuml;gbarkeits-Information f&uuml;r das
BLIZZARD 603e/e+ Power Board mit PowerPC 603e Prozessor

PRODUKT-STATUS-UPDATE f&uuml;r Kunden und Fachh&auml;ndler von phase 5 digital
products

Die schnellste Version des BLIZZARD 603e/e+ Power Board wurde aktuell von
250 MHz auf 240 MHz ge&auml;ndert, da die PowerPC 603e-250 Prozessoren extrem
lange Lieferzeiten haben. Durch die Spezifikations&auml;nderung auf 240 MHz und
Verwendung des PowerPC 603e-240-Prozessors ist es uns erfreulicherweise
m&ouml;glich, mit der Auslieferung des von vielen Kunden dringend erwarteten
Topmodells der BLIZZARD 603e/e+ Power Board-Serie ab dem 06. April 1998 zu
beginnen. Die Leistung des BLIZZARD 603e/e+ Power Board mit dem 240 MHz
603e-Prozessor wird gegen&uuml;ber der urspr&uuml;nglich geplanten 250 MHz-Version
gleichbleiben oder sogar geringf&uuml;gig verbessert sein, da der 240
MHz-Prozessor mit einem h&ouml;heren Bustakt von 60 MHz arbeitet (4:1-Verh&auml;ltnis
von CPU/Bus-Takt), w&auml;hrend die 250 MHz-Version mit einem 50 MHz Bustakt
gearbeitet h&auml;tte (5:1-Verh&auml;ltnis von CPU/Bus-Takt). Die Erh&ouml;hung der
Zugriffsgeschwindigkeit auf den Speicher um 20% gleicht den um 4%
niedrigeren Prozessortakt mehr als aus, was in einer gleichbleibenden oder
sogar geringf&uuml;gig verbesserten Leistung resultiert. Die 240 MHz-Version
wird das angek&uuml;ndigte 250 MHz-Modell vollst&auml;ndig ersetzen und das Topmodell
der BLIZZARD 603e/e+ Power Board-Serie darstellen.

WICHTIG: Wenn Sie im Rahmen des PowerUP Trade-In-Programms die geplante
250-MHz-Version des BLIZZARD 603e/e+ Power Boards bestellt haben, so
erhalten Sie automatisch eine Auftragsbest&auml;tigung f&uuml;r die neue
240-MHz-Version des BLIZZARD 603e/e+ Power Boards, welches keine
Leistungseinschr&auml;nkungen gegen&uuml;ber der 250-MHz-Version hat. Sollten Sie mit
dieser &Auml;nderung nicht einverstanden sein, so kontaktieren Sie bitte
umgehend unsere Vertriebsabteilung zur &Auml;nderung oder Stornierung Ihrer
Bestellung, um eine evtl. nicht gew&uuml;nschte Auslieferung zu vermeiden.

Bitte beachten Sie auch, da&szlig; aufgrund Nichtverf&uuml;gbarkeit der
68060-Prozessoren von Motorola zur Zeit nur Bestellungen f&uuml;r
PowerUP-Produkte mit 68040- oder 68LC040-Companion-CPUs ausgeliefert werden
k&ouml;nnen.&laquo;

(Quelle: Phase 5 digital products)
</pre>
</body>
</html>
