<html>
<head>
  <title>Spiele</title>
  <meta name="Generator" content="GuideML V1.5">
  <meta http-equiv="Content-Type" content="text/html">
</head>
<body>
<a href="main.html">CONTENTS</a> | <a href="spiele5.html">PREV</a> | <a href="spiele7.html">NEXT</a>
<hr>
<pre>

6. Previews
-----------

- Adventure-Shop (APC&amp;TCP) - erh&auml;ltlich ab Juli 1998

Adventure-Shop ist ein Autorensystem, mit dem man Adventures in der Art
von Myst selbst erstellen kann. L&auml;dt man das Programm, wird ein auf den
ersten Blick etwas un&uuml;bersichtlicher Editor-Screen ge&ouml;ffnet, auf dem sich
jede Menge Felder und Kn&ouml;pfe befinden. Dieser Editor bietet die 
M&ouml;glichkeit, f&uuml;r jeden Standort Hintergrundgrafik, Animationen, 
Soundeffekte, Schalter und vieles mehr zu definieren.
Der beigelegte AVPlayer wird dann dazu benutzt, das erstellte Projekt
abspielen zu lassen.
Auch interaktive Multimediaprojekte oder Pr&auml;sentationen lassen sich mit
Adventure-Shop erstellen, da sich diese nur wenig von Adventures in der
Art von Myst, etc. unterscheiden. Wozu das Programm f&auml;hig ist, kann man am
besten an dem Spiel Das Tor der Minerva erkennen, das mit Adventure-Shop
auf den AMIGA umgesetzt wurde. Beide Programme sind z.B. auf der aktuellen
AMIGA FUTURE-CD erh&auml;ltlich.

- Delarith (Nordlicht) - erh&auml;ltlich ab sofort

Und noch eins dieser unseligen Nordlicht-Low-Cost-Spiele. Delarith ist
ein Spiel mit &Auml;hnlichkeiten zum Klassiker Loderunner, leider zu vielen
&Auml;hnlichkeiten, so da&szlig; es auf 80er-Jahre-Niveau bleibt und einen Preis von
immerhin 29 DM viel zu hoch erscheinen l&auml;&szlig;t. Das Spiel bietet weder
irgendwelche Features, die PD-Versionen des Spielprinzips nicht auch bieten
w&uuml;rden, noch hat es eine besondere Grafik oder Sound. Also: Finger weg!
Das Demo ist unter anderem auf der aktuellen AMIGA FUTURE-CD erh&auml;ltlich.

- Lambda - erh&auml;ltlich ab ???

Eine gro&szlig;e &Uuml;berraschung im vergangenen Monat war das fr&uuml;he Demo des Spiels
Lambda. Das Demo sieht schon in dieser fr&uuml;hen Phase der Entwicklung sehr
vielversprechend aus und hat f&uuml;r Aufsehen in den Usenet-Newsgroups
gesorgt. Zu den Features des Space-Actionspiels im Stile von Wing Commander
und Konsorten geh&ouml;ren zum Beispiel folgende:
&quot;256 colours,Texture mapped Lambert &amp; gouraud shaded polygon objects,
Gouraud shaded fog/nebula background, laser bolts, light glows and smoke
trails, Translucent mathematically generated bitmap explosions and flames
for rockets and missiles, Translucent plasma projectiles, Multiple point
light sources, Interleaving of objects to allow flight through the
structures of capital ships, Child objects (eg. light from engines, turrets
on capital ships), AGA, CyberGraphX and Picasso96 support with user
selectable screenmode, Mouse and keyboard control (digital &amp; analogue
joystick and joypad support planned)&quot; 
Zwar sind in der aktuellen Demoversion nat&uuml;rlich noch l&auml;ngst nicht alle
Features enthalten, trotzdem sollte sie sich jeder einmal ansehen und
hoffen, da&szlig; das Spiel m&ouml;glichst schnell weiterentwickelt wird.
Das Demo ist hier erh&auml;ltlich: <a href="http://www.hut.fi/~mkalline/">http://www.hut.fi/~mkalline/</a>

<a href="lambda.jpg">Screenshot</a> (ab OS 3.0; JFIF/JPEG-Datatype mu&szlig; installiert sein)

- Nibbler Super eXtra (Nordlicht) - erh&auml;ltlich ab sofort

Und noch eins dieser Spiele, bei der eine Schlange gesteuert wird, die
nach Fressen von Gegenst&auml;nden immer l&auml;nger wird, und sich nicht ber&uuml;hren
darf. Allerdings ist dieses Spiel nicht Freeware oder Shareware, sondern
ein kommerzielles Produkt, das von Nordlicht f&uuml;r 29 DM vertrieben wird.
Das Spiel ist jedoch weder besonders gut, noch bietet es irgendwelche
grundlegend neue Ideen, die einen Preis von immerhin 29 DM rechtfertigen
w&uuml;rden. Allen Interessenten sei also abgeraten und auf die unersch&ouml;pflichen
Archive des Aminets verwiesen, da gibt es unz&auml;hlige &auml;hnliche Spiele, sehr
wahrscheinlich auch bessere. Das Demo ist unter anderem auf der aktuellen
AMIGA FUTURE-CD erh&auml;ltlich.

- Olofight (The Real Ologram) - erh&auml;ltlich ab Sommer 1998

Olofight ist ein Beat Em Up und wird von The Real Ologram entwickelt. Da
sich scheinbar kein Publisher gefunden hat, wird Ologram es auch selbst
vertreiben. Nun ist ein spielbares Demo erschienen, das einen ersten
Blick auf das Spiel zul&auml;&szlig;t. Das Demo ist &uuml;brigens ein 2-Spieler-Demo.
Die Charaktere des Spiels sind zum Teil sehr bizarre au&szlig;erirdische
Gestalten, die auch sehr ungew&ouml;hnliche Special Moves vollf&uuml;hren k&ouml;nnen.
Im Vergleich zu anderen Beat Em Ups sind die Special Moves &uuml;brigens recht
leicht zu handhaben. Die Grafik des Spiels ist recht gut, besonders die
Hintergrundgrafiken sind gut gestaltet.
Die volle Version des Spiels wird 10 verschiedene Charaktere bieten, die
in mehr als 400 Frames animiert sind. Eine komplette Liste der Features
befindet sich im Readme des Spiels. Alle Fans des Genres sollten sich das
Demo ruhigen Gewissens downloaden. Das Demo ist im Aminet erh&auml;ltlich.

<a href="olofight.jpg">Screenshot</a> (ab OS 3.0; JFIF/JPEG-Datatype mu&szlig; installiert sein)
</pre>
</body>
</html>
