<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MMX: &quot;My own prison&quot; / Creed</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;My own prison&quot; / Creed</H1>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>


<P>Mit ihrem Deb&uuml;talbum, welches die gleichnamige Hitsingle enth&auml;lt,
erregte die junge Band zuerst nur das Mi&szlig;fallen der in Amerika g&auml;ngigen
Branchenbl&auml;tter. Ein Rezensent schlug sogar vor, die Single an einen
Stein zu binden und im Meer zu versenken... jetzt hat er das vielleicht
selbst getan.    </P>
<P>
`Creed` (zu deutsch in etwa &quot;Glaubensbekenntnis&quot;) haben sich ihren Erfolg
hart erarbeitet. Sie sparten jeden Cent, nur um dann wieder das Studio f&uuml;r
kurze Zeit mieten zu k&ouml;nnen, um den n&auml;chsten Song aufzunehmen. Danach
pre&szlig;ten sie das Album in Eigenregie und verkauften es auf ihren Konzerten,
bis sich der Star-Produzent Ron Saint-Germain (`Tool` etc.) der Sache
annahm. Vom Stil her kann man sie recht nahtlos neben Nirvana, Pearl Jam
usw. einordnen.
                   </P>
<P>Doch jetzt zum Album im Detail: Das Booklet ist recht sch&ouml;n in d&uuml;steren
Farben gestaltet, das Titelbild zeigt einen jungen Mann, der anscheinend
in die Ecke gedr&auml;ngt die H&auml;nde &uuml;ber dem Kopf zusammenschl&auml;gt. Diese Geste
dr&uuml;ckt schon einiges &uuml;ber den ziemlich gro&szlig;en Weltschmerz aus, der aus den
Liedern der Band hervorquillt.  </P>

Die beiden ergreifendsten Tracks sind &quot;<B>My own prison</B>&quot; und &quot;<B>What's this
life for</B>&quot;: <DIV ALIGN=CENTER>

            <B><p>&quot;        So I held my head up high<br>
                   Hiding hate that burns inside<br>
               Which only fuels their selfish pride</p>
                               ...
             <p>Should have been dead on a Sunday morning<br>
                          Banging my head<br>
                       No time for mourning<br>
                         Ain't got no time</p>
                               ...
                    <p>I've created my own prison        &quot;</p></B>

                       <p>(aus &quot;My own Prison&quot;)</p>

                              <p>---</p>

             <B><p>&quot;          Hurray for a child<br>
                      that makes it through<br>
                       if there is any way<br>
                  because the answer lies in you<br>
                      they are laid to rest<br>
                 before they know just what to do<br>
                      their souls are lost<br>
                  because they could never find<br>
                      what's this life for<br>
                I see your soul, it's kind of gray<br>
                 I see your heart, you look away<br>
                You see my wrist, I know your pain<br>
                 I know your purpose on your plane<br>
                     Don't say a last prayer<br>
                  Because you could never find<br>
                      What's this life for<br>
                  But they ain't here anymore<br>
                 Don't have to settle the score<br>
                       Cause we all live<br>
                   under the reign of one king    &quot;</p></B>

                  <p>(aus &quot;What's this life for&quot;)</p>
</DIV><BR>
<P>&quot;What's this life for&quot; hat der (ziemlich gutaussehende) S&auml;nger und
Textschreiber der Band, Scott Stapp, geschrieben, nach dem sich ein
damaliger Klassenkamerad von ihm am College umgebracht hat. In den
anderen Liedern besch&auml;ftigt er sich mit dem &quot;American Way of Life&quot;
(&quot;<B>America</B>&quot;), Vorurteilen gegen&uuml;ber Dingen die man nicht versteht
(&quot;<B>One</B>&quot;) und allgemein mit den allt&auml;glichen Depressionen, &uuml;ber die er
anscheinend einiges zu berichten hat.   </P>

<P>Hervorzuheben sind die immer sehr sch&ouml;nen melodi&ouml;sen Refrains. Stark ins
Auge f&auml;llt die gro&szlig;e Verwendung von christlichen Symboliken in seinen
Liedertexten, was ja vielleicht nicht unbedingt gang und g&auml;be bei Gruppen
dieser Musikrichtung ist. In Interviews bestreitet Scott jedoch, Creed sei
eine christliche Band, ganz im Gegenteil. Er wurde nur extrem christlich
und konservativ erzogen, und mu&szlig;te einfach mit all dem abrechnen.     </P>

<P>Fazit:
Konnte mich dieses Album schon sehr begeistern, bin ich gespannt auf
ihr n&auml;chstes Album, das irgendwann im Sommer herauskommen soll. Auf
ihrer sch&ouml;n gestalteten <a href="http://www.creednet.com/">Homepage</a> gibts
neben Fotos und einer FAQ-Sektion au&szlig;erdem noch eine alternative
Version von &quot;My Own Prison&quot; zum freien Download.  </P>

<P>&copy; 1999 by Wind-up Entertainment, Vertrieb durch Sony Music, ca. 33DM         </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cd1.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906cd3.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


