<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MMX: &quot;Sisters of Avalon&quot; / Cyndi Lauper</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Sisters of Avalon&quot; / Cyndi Lauper</H1>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>

<P><B>Cyndi Lauper</B> war in den 80ern so etwas wie eine Madonna auf h&ouml;herem
musikalischem Niveau. Ihre damaligen Hits &quot;Girls just want to have fun&quot;,
&quot;True Colors&quot; (wurde vor kurzem von Phil Collins grauenhaft gecovert),
&quot;She Bop&quot; und &quot;Time after Time&quot; sind einem sicher aus dem Radio bekannt.</P>

<P>&quot;She Bop&quot; verursachte auch einen ziemlichen Skandal, weil es in dem so
harmlos klingenden Lied um nichts anderes, als um Selbstbefriedigung geht.
In den fr&uuml;hen 90ern wurde es ein bi&szlig;chen ruhig um sie, bis sie sich 1997
mit dem grandiosen Album &quot;Sisters of Avalon&quot; zur&uuml;ckmeldete, das auch
prompt ein Hit wurde. </P>

<P>Beginnen wir beim Booklet: Stimmungsvolle und sorgf&auml;ltig ausgesuchte
Landschafts- oder Detailaufnahmen untermalen ihre Songtexte, die es
&uuml;brigens wert sind, gelesen zu werden. Das waren sie schon in den 80ern,
als Madonna noch etwas von &quot;Everybody&quot; &amp; &quot;Shubidu&quot; etc. vor sich hin
brabbelte. </P>

<P>Der Stil l&auml;&szlig;t sich irgendwie zwischen gutem Pop und Ethno einordnen. Oder
einfach nur guter Pop mit teilweise recht starken Ethnoeinfl&uuml;ssen? Naja..   </P>

<P>Gehen wir jetzt einfach mal die Tracks der Reihe nach durch. </P>

<P>1. &quot;<B>Sisters of Avalon</B>&quot;  </P>

<P>Cyndi beschw&ouml;rt die mystische Frauengemeinschaft. Gute Melodie, insgesamt
eine gute Nummer.</P>

<P>2. &quot;<B>Ballad of Cleo+Joe</B>&quot;</P>

<P>Diese Nummer hat einen starken indischen Touch. Cyndi erz&auml;hlt die
Geschichte eines Mannes (Joe) der gerne Frauenkleider anzieht, um Cleo
zu sein. Sie selbst outete sich in einem Interview als Fan von solchen
&quot;Drag Queens&quot; und deren Shows.</P>

<P>3. &quot;<B>Fall into your dreams</B>&quot;</P>

<P>Ein Liebeslied in ihrem &uuml;blichen leicht traurigen Stil, der meistens
davon charakterisiert wird, da&szlig; man sich komplett in jemand anderem
verliert. </P>

<P>4. &quot;<B>You dont know</B>&quot;</P>

<P>Diese Nummer gef&auml;llt mir zusammen mit der F&uuml;nften am Besten. Cyndi
kritisiert sogenannte Mitl&auml;ufer, die einfach das nachplappern, was
irgend jemand anderer gesagt hat und selbst nicht nachdenken. Grandios.</P>

<P>5. &quot;<B>Love to hate</B>&quot;</P>

<P>Sicherlich die mitrei&szlig;endste Nummer, die schon eher in die Richtung
Hardrock/Heavymetal geht, aber nat&uuml;rlich auf Cyndis Art. Wenn man einen
Ha&szlig; auf jemanden hat, ist diese Nummer daf&uuml;r die richtige Hintergrundmusik.</P>
<DIV ALIGN=CENTER>
<QUOTE>

           <B>&quot;          I love to hate you
            Its not just the clothes that you wear
                   or the way you do your hair
                         its just you.            &quot;</B>
</QUOTE></DIV><BR>

<P>6. &quot;<B>Hot gets a little cold</B>&quot;</P>

<P>Eine melancholische Nummer &uuml;ber Entt&auml;uschung und Unsicherheit in der Liebe.
 </P> <P>
7. &quot;<B>Unhook the stars</B>&quot;  </P>

<P>Irgendwie auch in derselben Richtung, schon leicht depressive Entt&auml;uschung
und das restliche Programm...   </P>

<P>8. &quot;<B>Searching</B>&quot;</P>

<P>Wie jedes ihrer Lieder eine kleine psychische Studie, diesmal um eine
Person, die verzweifelt (und jetzt kommt die &Uuml;berraschung:) nach etwas
in ihrem Leben sucht.</P>

<P>9. &quot;<B>Say a prayer</B>&quot; </P>

<P>Auch etwas in dieser Richtung (beginne ich mich zu wiederholen?). Der
Stil von Cyndis Texten ist halt so schwer zu beschreiben.   </P>

<P>10. &quot;<B>Mother</B>&quot;</P>

<P>Ein Hymne an die gro&szlig;e Mutter, also so in die Richtung der gro&szlig;en
M&uuml;tterg&ouml;ttin, womit sich wieder der Kreis in Richtung Avalon schlie&szlig;t. </P>

<P>11. &quot;<B>Fearless</B>&quot; </P>

<P>Die &uuml;bliche Psychostudie &uuml;ber eine Person, die sich vorm Verlassenwerden
f&uuml;rchtet. </P>

<P>12. &quot;<B>Brimstone and Fire</B>&quot;    </P>

<P>Ahh, und als Kr&ouml;nung des ganzen das lesbische Liebeslied, denn auf fast
jedem ihrer Alben ist eines, da ihre Schwester lieber Frauen hat und Cyndi
wohl deshalb auch bei ihren H&ouml;rern mit Vorurteilen aufr&auml;umen will. Diesmal
geht es um Frauen, die im Waschsalon miteinander flirten. Tolle Nummer.
                                                                       </P>
<P>Insgesamt also ein Album, das man genauso wie jedes andere von Cyndi
Lauper, nur w&auml;rmstes weiterempfehlen kann. Letzte Weihnachten kam &uuml;brigens
ihr neuestes Album heraus, &quot;Merry Christmas...have a nice life&quot;, auf dem
sie ein paar traditionelle oder selbstverfa&szlig;te Weihnachtslieder zum
besten gibt. </P>

<P>Mehr &uuml;ber sie, ihre Pl&auml;ne f&uuml;r ihr neues Album und die M&ouml;glichkeit, ihr
ein Mail zu schreiben, gibts auf ihrer Homepage
<A HREF="http://www.House-of-Cyn.com">http://www.House-of-Cyn.com/</A>. </P>

<P>&copy; by Sony Music, 1997; ca. 33,- DM</p>       
<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cd2.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906cd4.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


