<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MMX: &quot;Lost Cathedral&quot; / Crown of Thorns</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Lost Cathedral&quot; / Crown of Thorns</H1>von<BR>
<A HREF="mailto:G.Franz@gmx.de">Gregor Franz</A></DIV>
       
<P>Auf dem Cover der amerikanischen Gruppe prangt ihr Logo und das aufwendig
gestaltete Booklet enth&auml;lt alle Songtexte und Fotos der Bandmitglieder.
&Auml;u&szlig;erlich also bereits ein guter Auftakt. </P>

<P>Den Bandleader Jean Beauvoir kann man wohl zu Recht als Multitalent
bezeichnen, da er nicht nur alle Songs geschrieben (vier davon zusammen
mit Ko-Autoren), produziert und arrangiert hat, sondern auch den Lied-
und einen Teil des Hintergrundgesangs &uuml;bernimmt, sowie Keyboard, Rhythmus-
und Liedgitarre spielt. </P>

<P>Trotzdem handelt es sich bei 'Crown of Thorns' um keine Einmann-Band! ;)
Tommy Lafferty, Michael Paige und Hawk Lopez sorgen f&uuml;r weitere Gitarren-,
Bass-, Schlagzeug- und Hintergrundgesangs-Unterst&uuml;tzung. </P>

<P>Los geht es im Titelsong &quot;<B>Lost Cathedral</B>&quot; mit langsamen Kl&auml;ngen und u.a.
Glockent&ouml;nen, dann setzen etwas h&auml;rter die Gitarren ein und dann Jeans
Gesang. Insgesamt ein etwas d&uuml;steres Midtempo-St&uuml;ck mit einer hartrockigen
Gitarreneinlage in der Mitte und einem melodischen Refrain.   </P>

<P>&quot;<B>Live and Die</B>&quot; beginnt wieder langsam, sehr melodisch mit langsam
einsetzendem Hintergrundgesang, der den Kehrreim vorwegnimmt. Auch dieser
Titel klingt eher dunkel, nachdenklich - l&auml;&szlig;t sich Zeit in seiner
Entwicklung. Die Instrumentierung erscheint sehr ausgewogen, der Sound
ist angenehm klar.  </P>

<P>&quot;<B>Motorcycle Loretta</B>&quot; startet erneut mit einer Instrumentalsequenz
und dann mit dem verhalten wirkenden Gesang von Jean Beauvoir. Der Sound
l&auml;&szlig;t die Motorradfahrt gut erahnen. Wie schon in den anderen Titeln sind
Variationen und Instrumentalsequenzen in den 'Standardablauf'
eingeflochten worden, die keine Langeweile aufkommen lassen.    </P>

<P>Mit den Kl&auml;ngen einer Akustikgitarre vor Sph&auml;renkl&auml;ngen beginnt &quot;<B>Lyin'</B>&quot;,
bevor treibend eine weitere Gitarre einsetzt und die Stimmung ver&auml;ndert.
Voller unterdr&uuml;ckter Emotionen berichtet der S&auml;nger vom Leben mit seiner
Partnerin, die ihn st&auml;ndig ins Gesicht gelogen und ihm nur etwas
vorgespielt hat. Der harte Bruch zwischen melodischem Refrain mit seinem
passendem Background-Gesang und dem darauf folgenden Gitarreneinsatz,
ist durchaus sehr reizvoll und auch zu dem sanften Anfangsthema wird
wieder zur&uuml;ckgekehrt.           </P>

<P>&quot;<B>Free Me</B>&quot; ist einer meiner Favoriten. Leise Sph&auml;renkl&auml;nge leiten langsam
zu einer phantastischen, ruhigen Instrumentalsequenz &uuml;ber, in der man
sich fast verlieren k&ouml;nnte. Aber dann f&uuml;gt sich die Stimme in dieses
vollkommen erscheinende Klangmuster ein, beides bildet zusammen eine
Einheit. Treibender, auffordernder wird schlie&szlig;lich der Kehrreim, der
'Sie' auffordert, 'ihn' endlich freizugeben, nachdem er schon am Boden
liegt. Platz f&uuml;r Variationen wird nat&uuml;rlich auch diesem Titel einger&auml;umt,
der kraftvoll ausklingt. </P>

<P>&quot;<B>Greed of Love</B>&quot; wirkt wieder etwas d&uuml;sterer. Die h&auml;rteren Kl&auml;nge werden
durch den witzig wirkenden `hohen` Hintergrundgesang (laut Text der
`Jungfrauen-Chor`) etwas relativiert. Eine Liebe hielt nicht das, was
sie verprach.    </P>
<DIV ALIGN=CENTER>
<p><B>&quot; Well it seems what I've been dreamin'<br>
                    Well has somehow turned to hell<br>
                   And I`m left with just this story<br>
                           That I can tell            &quot;</p></B>
</div>

<P>&quot;<B>Cold Blooded Bitch</B>&quot; ist der erste etwas konventionellere Titel, was den
Aufbau anbelangt. Zwar mit einer druchg&auml;ngig etwas h&ouml;heren Gangart
ausgestattet, ist er doch etwas langweiliger, als die anderen. </P>

<P>Daf&uuml;r ist &quot;<B>End of the Road</B>&quot; mehr als eine gute Entsch&auml;digung. Der Song
beginnt wieder sehr langsam und sehr ruhig - ist vielleicht am ehesten
eine Ballade (von einer ungl&uuml;cklichen Liebe), wie man sie sich vorstellt.
Der Refrain ist kraftvoll und schnell und auch die Strophen danach werden
eindringlicher vorgetragen. Die Melodie klingt auch nach dem Songende in
einem nach.   </P>

<P>&quot;<B>Although We`re Fools</B>&quot; ist der einzige komplette Ausei&szlig;er nach unten. Er
ist hart und unmelodisch. Seltsamerweise gilt das nicht f&uuml;r den sehr
melodischen Refrain, der den Song nat&uuml;rlich trotzdem nicht retten kann.
Der Titel wurde allerdings auch als Bonussong gekennzeichnet.  </P>

<P>&quot;<B>Wasted Prime</B>&quot; ist eine softe Ballade, die ganz gut klingt, aber nicht den
&uuml;berdurchschnittlich hohen Standard der vorhergehenden Songs erreichen
kann.     </P>

<P>&quot;<B>Hell of a Night</B>&quot; ist von Beginn an schnell. Das besondere an ihm ist, da&szlig;
der komplette Gesang Background-like mit mehreren Stimmen vorgetragen wird,
auch wenn die Liedstimme etwas hervorsticht. Ansonsten ein `jetzt aber
raus in die Nacht und die Stadtszene erobert`-Song.</P>

<P>&quot;<B>If You Need Me</B>&quot; ist der zweite Bonustitel und gleichzeitig der letzte
&uuml;berhaupt auf dem Album. Eine relativ `normale`, eine Idee zu weiche
Ballade - nicht herausragend, aber ein vers&ouml;hnlicher Abschlu&szlig; der CD.   </P>

<P>F&uuml;r mich ist &quot;Lost Cathedral&quot; insgesamt ein sehr interessantes Album, da&szlig;
trotz einzelner Titel, die den Gesamteindruck etwas schm&auml;lern, eine sehr
spezielle Note hat. Gerade die etwas d&uuml;steren, sehr gut arrangierten
Titel, mit ihrem Gegensatz zwischen aufwendiger Melodik und Passagen
mit harter Instrumentierung, wissen zu gefallen. Mit oftmals &uuml;ber f&uuml;nf
oder sechs Minuten Laufzeit l&auml;&szlig;t sich die Gruppe angenehm viel Zeit
f&uuml;r ausgepr&auml;gte Instrumentalsequenzen und viele Variationen.</P>

<P>(P) &amp; &copy; 1998 Voodoo Island Productions, Vertrieb durch Frontiers
Records, ca. 33,- DM  </P>

<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cd3.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906cd5.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


