<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MMX: &quot;Mitternacht im Garten von Gut und B&ouml;se&quot;</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Mitternacht im Garten von Gut und B&ouml;se&quot;</H1>(1997)<br><br>von<BR>
<A HREF="mailto:liderc@gmx.at">Lukas Fichtinger</A></DIV>
       
<P><B>Savannah, Georgia.</B> </P>

<P>Nach einer rauschenden Weihnachtsparty erschie&szlig;t der angesehene und
wohlhabende Antiquit&auml;tenh&auml;ndler Jim Williams (Kevin Spacey) seinen
Angestellten und Liebhaber Billy Hanson (Jude Law). Der New Yorker
Journalist John Kelso (John Cusack), der eigentlich nur &uuml;ber die Party
berichten soll, freundet sich mit Williams an und beobachtet die
Gerichtsverhandlung. </P>

<P>Dabei lernt er Savannah von seiner, dem Touristen v&ouml;llig unbekannten
Seite kennen, da in Folge des Prozesses ziemlich viel Schmutzw&auml;sche
gewaschen wird. Billy ging n&auml;mlich nicht nur mit Williams, sondern war
so in etwa der Lustknabe der Stadt, jede/jeder war schon mal mit ihm
im Bett, und die, die es noch nicht waren, sind aufgrund seines Ablebens
leicht ver&auml;rgert. </P>

<P>Au&szlig;erdem erscho&szlig; Williams Billy in Notwehr, weil ihn dieser bedrohte
oder aus Eifersucht, weil er &uuml;ber dessen Treiben informiert wurde? Und
was wei&szlig; dieser Transvestit Lady Chablis, bei der/dem Billy einmal in
Untermiete war?  </P>

<P>Bei der L&ouml;sung dieser Fragen wird John auch in die unheimliche Welt des
Voodoo-Kultes verstrickt, da Billys Geist im Jenseits keine Ruhe zu finden
scheint...  </P>

<P>Der Film, auf den ersten Blick ein Mystery-Thriller, hat aber auch seine
komischen Momente, wenn er die skurrilen Einwohner von Savannah zeigt.
Zum Beispiel den Mann, der einen imagin&auml;ren Hund an einer realen
Hundeleine Gassi f&uuml;hrt oder den frustrierten Spinner, der t&auml;glich
droht, das Trinkwasser der Stadt zu vergiften und seine Haustiere,
n&auml;mlich Bienen, immer mit Schn&uuml;ren um seinen Hals befestigt mit sich
f&uuml;hrt. </P>

<P>Die schw&uuml;le S&uuml;dstaatenathmosph&auml;re Savannahs wird in diesem beeindruckenden
Werk von Clint Eastwood richtig sp&uuml;rbar. F&uuml;r alle &quot;Planet der Affen&quot;-Fans
gibt es au&szlig;erdem noch Kim Hunter/&quot;Dr. Zira&quot; in einem Gastauftritt zu sehen. </P>

<P>Der Soundtrack ist im Handel erschienen, genauso wie der gleichnamige
Roman von John Berendt, auf dem der Film basiert. Erh&auml;ltlich auf VHS und
gerade neu auf DVD. Die DVD Version kann mit sehr guter Bild/Tonqualit&auml;t,
einer eigenen Spur f&uuml;r den Soundtrack und einigen Hintergrundinfos &uuml;ber
die Dreharbeiten und die Stars des Films punkten.  </P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906cd5.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="../amz0699/uhl.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


