<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<HTML>
<HEAD>
    <TITLE>AmZeiger 06/99 - MMX: Neues aus La-La-Land</TITLE>
</HEAD>
<BODY BACKGROUND="../images/bg.gif">
<DIV ALIGN=CENTER><H1>&quot;Neues aus La-La-Land&quot; / Stoppok</H1>von<BR><A HREF="mailto:T.Heinrich@amzeiger.de">Thomas Heinrich</A></DIV>
       

<P>Nach zwei Jahren legt endlich der ungekr&ouml;nte K&ouml;nig der deutschen
Musikszene, Stefan Stoppok, wieder ein Album vor, das Ma&szlig;st&auml;be setzen
k&ouml;nnte - wenn er nur etwas ber&uuml;hmter w&auml;re. Schon der Titel verspricht
viel: Er bezieht sich auf Stoppoks bisher gr&ouml;&szlig;ten Erfolg und sein
stimmigstes Album &quot;<B>Happy End im La-La-Land</B>&quot;. Nat&uuml;rlich war ich neugierig
und ging mit hohen Erwartungen an das neue Album. </P>

<P>Erleichtert war ich, als ich im <B>Booklet</B>, da&szlig; sich auf 8 Seiten Gr&ouml;&szlig;e
auffalten l&auml;&szlig;t, folgendes lesen konnte: &quot;Diese CD ist quasi fast total
loopenrein!&quot; Sein letztes Album &quot;Mit Sicherheit&quot; hatte fast keine Tracks
mit leibhaftigem Schlagzeuger und h&ouml;rte sich auch entsprechend an. Naja,
jeder macht mal Fehler, obwohl auch dieses Album nicht wirklich schlecht
war.
     </P>     <P>
Weiterhin finden sich im Booklet nat&uuml;rlich wieder alle Songtexte und viele
Bilder von Stoppok und der Band.
                                 </P>
<P>Wieder mal beweist Stoppok, da&szlig; ihm kein Musikstil fremd ist. Bereits der
erste Song &quot;<B>Sch&ouml;ne Gr&uuml;&szlig;e</B>&quot; ist ein lupenreiner Reaggae, wie ihn ein Bob
Marley oder Peter Tosh nicht besser hinbekommen h&auml;tte. Gereimte, witzige
und kritische Texte sind bei Stoppok sowieso obligatorisch. &quot;Sch&ouml;ne
Gr&uuml;&szlig;e&quot; ist eine der Balladen, denen man es nicht anmerkt - sie handelt
von einer verflossenen Liebe. Klingt aber derma&szlig;en relaxt, da&szlig; einen das
Fernweh in die Karibik packt.</P>

<P>Kontrastprogramm: Der zweite Song &quot;<B>M&uuml;lldeponie</B>&quot;, &uuml;ber alte Liebe und alte
Wunden, ist wiederum ein richtiger Folksong, akustische Gitarre, sparsame
Percussion. Texte gef&auml;llig?   </P><BR>

<DIV ALIGN=CENTER>
<B><p>&quot;Ich war heute bei der M&uuml;lldeponie, hatte alles sch&ouml;n getrennt,<br>
    allm&auml;hlich wei&szlig; ich, wie man Blech und Alu auseinanderh&auml;lt -<br>
         wer glaubt eigentlich noch, das rettet die Welt?&quot;</p>

<p>&quot;Ich sah dich in der Wohnungst&uuml;r stehn, die Koffer in der Hand,<br>
du warst fertig zum gehn, sah genau deinen Blick, wie er nach Hilfe schrie.<br>
            Doch ich sa&szlig; da gel&auml;hmt und wu&szlig;te nicht wie...&quot;</p>

          <p>Refrain: &quot;...wieviel M&uuml;ll kann man schlucken?&quot;</B></p>
</DIV>

<P>Den n&auml;chsten Song &quot;<B>Goldgr&auml;ber</B>&quot; k&ouml;nnte man als Schnulze bezeichnen. Aber
hier ist Stoppok am Werk, und wenn man sich darauf einl&auml;&szlig;t, Gef&uuml;hle zu
empfinden, geht er tief unter die Haut. Der Text dreht sich um eine
gealterte Mutter, zweimal geschieden, k&uuml;rzlich Oma geworden, die sich
nach dem Sinn des Ganzen fragt - und ihn findet. </P>

<P>&quot;<B>Na sch&ouml;n</B>&quot; ist die lustige Seite an Stoppok - origineller Text, mit dem
er nebenbei mit seiner alten Plattenfirma abrechnet, aber vor allem sein
etwas anarchisches Wesen beschreibt, und ein rockiger Sound, wieder mit
deutlichem Folk-Einschlag. </P>

<P>&quot;<B>Geradeaus</B>&quot; ist musikalisch genau dies: Schn&ouml;rkelloser Rock, mit gutem
Backgroundchor. &quot;Drei Liter Benzin, schadstoffarm, trotzdem in die falsche
Richtung gefahrn, immer eine Nasenl&auml;nge weiter vorn, ein blindes Huhn
findet auch ein Korn - Geradeaus gradeaus, der Weg geht gradeaus...&quot;  </P>

<P>Der &quot;<B>Hampelmann</B>&quot; erinnert musikalisch irgendwie an eine Parodie von Right
Said Fred, aber weniger k&uuml;nstlich, textlich geht es um r&uuml;ckgratlose
Menschen, eben Hampelm&auml;nner. </P>

<P>&quot;<B>Nach New York geflogen</B>&quot; ist ein St&uuml;ck &uuml;ber einen Macho, verhalten
aggressive E-Gitarre, die fies ins Mark f&auml;hrt. So stellt man sich die
Musik der New Yorker K&uuml;nstlerszene vor. </P>

<P>Nochmal ein Kontrast: &quot;<B>Jede Stunde</B>&quot; ist eine Country-Ballade mit
Ohrwurmqualit&auml;ten. K&ouml;nnte deswegen vielleicht sogar ein Hit werden,
auch wenn es eigentlich kein typisches Stoppok-Werk ist.  </P>

<P>&quot;<B>Was Du willst</B>&quot; ist wieder nur akustische Gitarre, mit ein paar Samples
(also doch!) und Percussion. Es handelt von der Abrechnung mit einem
Angeber: &quot;Oh schau, da deine Frau, so ein sch&ouml;nes Gesicht, und auch noch
die Figur, fast alles pur, kaum Silikon. Ein Wunder, da&szlig; sie spricht.&quot;</P>

<P>&quot;<B>Wenn ich so ausseh</B>&quot; ist wieder ein Rocksong, geradeheraus, fetziger Chor
und beschreibt etwas Stoppoks Launen (sofern man vom Text auf den K&uuml;nstler
schlie&szlig;en kann).</P>

<P>Mit &quot;<B>Fan von</B>&quot; war Stoppok sogar schon in der Sendung &quot;Geld oder Liebe&quot; zu
sehen. Schade, da&szlig; ich solche TV-Machwerke aus Prinzip ignoriere, da habe
ich diesmal was verpasst. Erinnert ein wenig an die Bl&auml;ck F&ouml;&ouml;s, und
rechnet mit den TV-Shows ab. Ausgerechnet... </P>

<P>&quot;<B>Jammern</B>&quot; ist schon fast faschingsm&auml;&szlig;ig, und immer, wenn Stoppoks Musik
harmlos klingt, ist der Text eine ziemlich scharfe Klinge: &quot;Seit drei
Stunden h&ouml;r ich dir zu, keiner kann jammern so edel wie du. Es blutet
vom Himmel und tropft in dein Bier. Jesus war ein Playboy verglichen
mit dir.&quot; </P>

<P>&quot;<B>Ich bin weg</B>&quot; klingt sehr nach dem &quot;Tag am Meer&quot; von den Fantastischen
Vier. Sehr atmosph&auml;risch und stimmungsvoll mit der halbakustischen
Gitarre, handelt der Song vom Verlassen. Nicht verlassen sein oder
werden, sondern vom Weggehen; wenn man von der Entt&auml;uschung bet&auml;ubt ist.</P>

<P>Zwei &quot;MegaBonusTracks&quot; gibt es auch noch, beide in der Kategorie
originelle, faschingstaugliche, leichte Kost. &quot;<B>Tanja</B>&quot; erz&auml;hlt von einer
Freundin Tanja, die nur Champagner trinkt. &quot;<B>Resi</B>&quot; spiegelt wohl Stoppoks
Erfahrung mit dem M&uuml;nchner Oktoberfest wider, denn er wohnt jetzt in
M&uuml;nchen, nicht mehr im Ruhrgebiet.</P>

<P>Diese &quot;MegaBonusTracks&quot;, die sich auch auf anderen Stoppok-CDs finden,
sind alle aus einer Laune heraus entstanden und eigentlich Finger&uuml;bungen
oder Zugaben f&uuml;rs Live-Publikum.</P>

<P><B>Hat es sich gelohnt?</B></P>

<P>Als Stoppok-Fan mu&szlig; man die CD haben! Sie ist zwar nicht ganz so perfekt
und in sich stimmig, wie die &quot;Happy End im La-La-Land&quot;, aber das war
eigentlich auch nicht zu erwarten. Auf jeden Fall ist es wieder der
Stoppok, den sich der Fan w&uuml;nscht: Handgemachte, vielseitige Musik;
originelle, kritische, gef&uuml;hl- und stimmungsvolle Texte. Die L&auml;nge der
CD ist ca. 51 Minuten, bei 15 Tracks. Es ist &uuml;brigens auch das erste
Stoppok-Album, das nicht als LP in Vinyl erscheinen wird. Es kostet
die &uuml;blichen 30 DM im Fachhandel.   </P>

<P>Auch diesmal ist <B>die versteckte Botschaft</B> wieder klar: &quot;Seht her, ihr
Hitparadenst&uuml;rmer, das kann ich auch. Nur viel besser.&quot; Es ist wirklich
unglaublich, wieviel musikalisches Talent und Bandbreite Stoppok hat,
und wie wenig bekannt er ist. Vielleicht verhilft die neue Internetseite
zum Durchbruch: <A HREF="http://www.stoppok.de">http://www.stoppok.de</A>. Aber ein neuer Browser sollte es
schon sein, f&uuml;r das G&auml;stebuch braucht man Javascript.  </P>

<P>&copy; by Sony Music 1999; ca. 30,- DM</P>


<P><HR>
<TABLE WIDTH=100%>
<TR>
    <TD ALIGN=LEFT><A HREF="9906mmx.htm"><IMG SRC="../images/prev.gif" ALT="Prev" BORDER=0></A></TD>
    <TD ALIGN=CENTER><FONT SIZE=2><A HREF="../amz0699/main.htm">Inhaltsverzeichnis</A></FONT></TD>
    <TD ALIGN=RIGHT><A HREF="9906cd2.htm"><IMG SRC="../images/next.gif" ALT="Next" BORDER=0></A></TD>
</TR>
<TR>
    <TD COLSPAN=3 ALIGN=CENTER><FONT SIZE=2>&copy; `99 <A HREF="mailto:AmZeiger@gmx.de">Der AmZeiger</A></FONT></TD>
</TR>
</TABLE>
</P>
</BODY>
</HTML>


