<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Amiga Plus CD 5 / 2000</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<p><h1><center><font color="green">Amiga Plus CD 5 / 2000</Font></h1></Center></P>

<p>Wieder sind zwei Monate vergangen und somit ist es wieder an der Zeit f&#252;r eine neue Amiga Plus CD, die sich alsbald erneut wieder etas ver&#228;ndern wird, da die Amiga Future CD darin aufgehen wird. Aber das ist bisher noch Zukunftmusik und bei der vorliegenden Ausgabe ist noch alles &#228;hnlich wie bei den schon qualitativ hochwertigen Vorg&#228;ngern...</P>

<p><h2><center><font color="yellow">Wie bitte? Nur &#228;hnlich?</Font></h2></Center></P>
<p>Waren Ver&#228;nderrungen in den letzten Ausgaben nur sehr sp&#228;rlich vorhanden, so hat sich bei der vorliegenden Ausgabe wieder einmal einiges getan: So wurden die kompletten Icons auf der CD gewechselt - statt der Ordner erwarten Euch im Hauptverzeichniss nun rote Schubladen und s&#228;mtliche Unterordner lie
gen nun als Macontosh a-like Aktenmappen (auch in verschiedenen Farben) vor. Inhaltlich hat sich nat&#252;rlich nichts ge&#228;ndert, und ob Euch nun die neuen Aktenmappen gefallen oder nicht, bleibt nat&#252;rlich auch Eure Sache; ist ja immerhin nur eine Geschmacksfrage.</P>

<p>Runderneuert wurde auch die HTML Datei, die man alternativ zum durchst&#246;bern der CD benutzen kann und die ein immer wieder interessantes Vorwort von Markus Castro enth&#228;lt. Das neue Layout ist, nebenbei bemerkt, super geworden, ist &#252;bersichtlich gestaltet und wird zudem noch blitzschnell geladen. Die 
restlichen Neuerungen stellen Bugfixes an dem bisherigen CD System dar und sorgen daf&#252;r, da&#223; die CD auf wirklich allen Systemen Reibungslos l&#228;uft.</P>

<p><h2><center><font color="white">Der Inhalt</Font></h2></Center></P>

<p><h3><b>Misc</B></h3></P>

<p><u>Mags:</U><BR>
Unterteilt in die &#252;blichen Schubladen &quot;HTML&quot;, &quot;Guide&quot; und &quot;Misc&quot; befinden sich hier wieder einige bekannte Diskmags wieder - so z.B. die Amiga4ever, das Amiga Gadget, die Amiga Aktuell, die Amiga Times und nat&#252;rlich auch die NoCover. Durch dieVorlaufszeit, die eine CD normalerweise hat, sind die Ausgaben zwar nicht immer die aktuellsten, aber dennoch lesenswert. </P>

<p><u>Data:</U><BR>
Hier gibt sich nur eine Betaversion der neuen Datenbank &quot;Data M2&quot; die Ehre, die aber einen insgesamt schon sehr guten Eindruck macht.</P>

<p><h3><b>Games: </B></h3></P>

<p><u>Demos, Previews &amp; Misc:</U><BR>
Neben den neuesten Demoversionen von &quot;Tales Of Tamar&quot;, &quot;Joyride&quot; (Test in der letzten NoCover) und &quot;Seaside&quot;, gibt`s auch einen Trailer zum mitlerweile hoffentlich erschienenen Game Nightlong sowie die Heretic Add On`s &quot;Siege&quot; und &quot;THF&quot; nebst dem bekannten Update. Zus&#228;tzlich finden sich hier noch einige Reko Cardsets.</P>


<p><u>PD &amp; Starter:</U><BR>
An Startern gibt`s leider nur das gute &quot;IKitNG&quot;, aber daf&#252;r sind einige hochklassige PD Games auf der CD vertreten, wie z.B. &quot;Glowmonopoly&quot;, &quot;Klondike&quot; &amp; &quot;Imperrium Terranum&quot;, dessen Vollversion sich auch auf der neuesten Auflage der &quot;Amiga Arena CD&quot; (direkt beim APC &amp; TCP zu beziehen) befindet. Ansonsten sind hier ncoh einige weitere nette PD Spielchen vertreten, die man durchaus mal antesten sollte. </P>

<p><h3><b>Scene</B></h3></P>

<p><u>Demos: </U><BR>
Mit &quot;Arla&quot; gibt`s hier leider nur ein neues Demo zu bestaunen...</P>

<p><u>Mags:</U><BR>
Auch nur zwei Eintr&#228;ge hat diese Rubrik mit &quot;MWI27&quot; und &quot;Frozen32&quot; zu verbuchen.</P>

<p><u>Events:</U><BR>
Hier geht`s daf&#252;r aber ganz sch&#246;n rund: Neben viel (!!) Material zur &quot;World Of Alternatives&quot; (Video Trailer und einer ganzen Palette an Bildern) gibt`s auch einen HTML aufbereitete Fotogalerie zum Treffen in Wolfenb&#252;ttel und Fun Of Computing sowie diverse MP3 Interview Mitschnitte von Bill McEwen und Metabox. Alles in allem ein sehr interessanter Ordner mit vielen netten Bildern. </P>

<p><h3><b>Multimedia</B></h3></P>

<p><u>Sound:</U><BR>
Tja, erneut MP3 Dateien und mal wieder bleibt mir hier wohl nichts anderes &#252;brig, als zu schreiben, da&#223; dieser Ordner eindeutig Geschmackssache ist...</P>



<p><u>Homepages:</U><BR>
Hier hat der Markus Castro ganze Arbeit geleistet, indem er die Homepages von &quot;Soms&quot;, &quot;Amiga Club Bautzen&quot;, &quot;Funtime World&quot;, &quot;Amiga Games Guide&quot;, &quot;Playamiga&quot;, &quot;Stefan1200&quot; und &quot;Pixelmaster2 auf die CD bebracht hat. Auch hier sind viele interessante Dinge zu entdecken, auch wenn die Homepages nat&#252;rlich mitlerweile im Netz deutlich aktueller sind.</P>

<p><u>GFX:</U><BR>
Grafiken d&#252;rfen nat&#252;rlich auch auf keiner A+ CD fehlen und so findet sich hier neben einem Update der Glow Icons auch eine Manga Slideshow, Anime Stuff, kleine Glow Icons sowie eine weitere Slideshow.</P>

<p><h3><b>Tools &amp; PPC</B></h3></P>
<p>Hauptmerkmal der CD ist neben dem ganzen bisher aufdgef&#252;hrten Material nat&#252;rlich nach wie vor aktuelle Software, die gewohnterweise in diverse Ordner eingeteilt ist und in den meisten F&#228;llen erstaunlich aktuell ist. Zu diesem Bereich noch gro&#223;e Worte zu sagen, ist wohl kaum n&#246;tig, da dieser Sektor der CD in den letzten Ausgaben immer &#252;berdurchschnittlich gut gelungen ist - wer eine der vorrangegangenen CD`s sein eigen nennt (und das sollte jeder Amiga User!), der wird wohl die Qualit&#228;t in diesem Bereich kennen und einen Vergleich mit &#228;lteren Ausgaben braucht auch die neue CD nicht zu scheuen.</P>

<p><h1><center><font color="green">Fazit</Font></h1></Center></P>
<p>Ok, wer hat es immer noch nicht erkannt? Die A+ CD Reihe ist momentan eine der hochwertigsten auf dem Amiga Markt und das will schon was hei&#223;en - immerhin scheinen andere CD Reihen, wie etwa die AmigaOS CD`s, zu stagnieren. Ich kann euch nur raten, die aktuelle A+ CD nicht links liegen zu lassen und sie zumindest mal anzutesten, falls das immer noch nicht geschehen sein sollte. Alle anderen werden die CD ohnehin blind abgreifen...</P>




<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
