<HTML>
<HEAD>
<!-- Author = Karl-Heinz Bader -->
<TITLE>Diskussion TV</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000"
 BGCOLOR="#FFFFF4">

<center>
<H1>Fernsehen</H1>
<table width=100% border=0 cellpadding=6><tr><td>
</CENTER>
<font size="3">
<P>
Hallo alle,
<p>
nun m&ouml;chte ich auch was zur Diskussion <b>Fernsehen</b> beitragen.
Kilian hat durchaus Recht mit seiner Meinung, dass die Talk-Shows niveaulos sind.
Und viele andere Sendungen auch. Wenn ich mal so eine TalkShow sehe, dann denke
ich, da&szlig; manche Leute nur mal ins Fernsehen kommen m&ouml;chten. Und viele sind dabei
die IMHO vielleicht arbeitslos sind und sich Themen ausdenken und diese dann
schauspielern, um ein paar DM zu verdienen.
<p>
Bei mir ist es so, da&szlig; ich Fernsehen meistens h&ouml;re, weil ich doch meistens
am Rechner im Wohnzimmer sitze und meine Frau diverse Sendungen anschaut.
Es gibt f&uuml;r mich kaum eine Sendung, die ich mir anschaue.
<p>
Fernsehen &auml;nderte mein Leben!<br>
Ja, das ist tats&auml;chlich passiert. :) Vor vielen Jahren, ich denke, es m&uuml;&szlig;ten
jetzt bestimmt schon 10 Jahre sein, da haben wir uns  ein zweites Fernsehger&auml;t ins Schlafzimmer
gestellt. Im Jahre 1989 hatten wir uns einen VideoRecorder angeschafft. Und
im gleichen Jahr habe ich meine Super-8-Kamera gegen eine Video-Kamera ersetzt.
<p>
Vorher haben meine Frau und ich immer im Bett noch in B&uuml;chern gelesen.
Stephen King, Roald Dahl,  Carnegie und Erma Bombeck, um einige Autoren zu
nennen. Damals gab es bei uns noch viele laufende Meter B&uuml;cher in den Regalen
und vielleicht 10 Video-Kassetten. Heute ist das Verh&auml;ltnis genau umgekehrt
und die B&uuml;cher wandern in den Keller, um Platz f&uuml;r Videos zu machen. :)<br>
<p>
Heutzutage, nun seit Jahren l&auml;uft der Fernseher zum einschlafen. ;))
Fr&uuml;her war ja das Programm morgens gegen 1Uhr zu Ende, heute wird 24 Stunden
am Tag gesendet.
Und dann wird nicht mehr gelesen. Der TV wird mit dem timer auf eine Laufzeit
von einer Stunde gestellt. Meistens l&auml;uft dann noch RTL-Nachtjournal und dann
schl&auml;ft man gut ein. :)
<p>
Nun mu&szlig; ich noch abschweifen. Als Jugendlicher hatte man das Gef&uuml;hl, das die
Alten alles so genau nehmen und man meinte, da&szlig; das nicht so sein m&uuml;&szlig;te.
Heute bin ich Opa und denke, wie un&uuml;berlegt wird heutzutage gehandelt, das darf
doch nicht wahr sein! Das betrifft so ziemlich alle Bereiche z.b.
Verkehrswesen, Planung und nat&uuml;rlich auch Werbung etc.
<p>
Nun mache ich Schlu&szlig;!
<p>
<H3><i> Charly </i></H3>
</P>
<HR>
<BR>
<p>
<center>
<table border="6" width=95%><tr><td>
<center>
Autor:  &nbsp; &nbsp; <a href="Mitglieder/bader.html">Karl-Heinz Bader</a>&nbsp; &nbsp;
E-Mail: <a href="mailto:charly-ham@t-online.de"> charly-ham@t-online.de</a> <br>
</center>
</td></tr></table></center></font>
<br>
<p>
</BODY>
</HTML>
