<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML3.2//EN">
<HTML>
    <HEAD>
        <TITLE>Brief von Martin</TITLE>
        <META NAME="GENERATOR" CONTENT="MetalWEB 4.0.1 (18.04.2000) ©1997-2000 Multitaskers, Alle Rechte vorbehalten">
    </HEAD>
    <BODY BACKGROUND="l_bg.gif" BGCOLOR="#FFFFF4" TEXT="#000000" VLINK="#000080" LINK="#0000FF" ALINK="#FF0000">
        <P ALIGN="CENTER"><FONT SIZE="-1">Wenn Frame noch vorhanden, dann bitte hier <a href="leser_voepel1.html" target="_top"> <b> klicken </a></b>, oder auch nicht, dann bleibt der linke Frame erhalten.</FONT> </P>
        <BR>
        <HR WIDTH="70%">
        <BR>
        <H1 ALIGN="CENTER">Brief an Sascha... und alle Anderen... </H1>
        <BR>
        <HR>
        <BR>
        <P>
        Hallo Sascha, <BR>
        <BR>
        ich habe mich heute beim APC&amp;TCP - Computerclub angemeldet. <BR>
        Nun m&ouml;chtest Du ja gerne f&uuml;r die Mitgliederliste von jedem eine HTML - Datei, -&gt; nun hier ist meine! <BR>
        <BR>
        Da ich mich in der letzten Zeit mit der NoCover und auch mit der Mitgliederliste besch&auml;ftigt habe, ist mir aufgefallen, dass man um alle Eintr&auml;ge sich anschauen zu k&ouml;nnen hin und her schalten muss, dass st&ouml;rte mich unwahrscheinlich. (Auf Deine Anfangsseite.) (Ausgabe vom 25.5.2000, Amiga plus CD) <BR>
        Nun habe ich mir erlaubt diese Seite in Frames zu teilen, schau aber erst selbst bevor Du meckerst! -&gt; Auch von einer NoCover aus, ich finde es sieht recht gut aus und ist einfacher zu bedienen, aber schau selber. Aber wenn Du meinst es ist so wie ich es gemacht habe "K&auml;se" -&gt; nun gut! <BR>
        <BR>
        Ich bin leider nur &uuml;ber Post zu erreichen. Ich hoffe im n&auml;chsten Jahr gibt es einen vollkommenen neuen Amiga und dann werde ich auch wohl "online" gehen, aber der Umbau meines A1200 lohnt nicht mehr. -&gt; Gekauft 1993, <A HREF="mitglieder/voepel.html">siehe voepel.html.</A> <BR>
        <BR>
        Mit freundlich Gr&uuml;&szlig;en! <BR>
        <A HREF="mitglieder/voepel.html"><IMG SRC="voepel_1.png" ALT="Martin Voepel" BORDER="0"></A><BR>
        <BR>
        <HR>
        <BR>
        Brief von Sascha an mich <BR>
        <BR>
        <P ALIGN="CENTER"><IMG SRC="sascha.jpg" ALT="Brief von Sascha an mich" BORDER="0"></P>
        <BR>
        <HR>
        <BR>
        Antwort von mir <BR>
        <BR>
        Nat&uuml;rlich bin ich mit dem erscheinen der von mir gestalteten Seiten einverstanden. -&gt; Sonst h&auml;tte ich sie ja auch nicht gemacht!!! <BR>
        <BR>
        <HR>
        <BR>
        Noch ein paar Worte zu HTML-Seiten <BR>
        <BR>
        Es heist meistens in der NoCover ...<I>in einen Editor einladen und dann... loslegen</I>... aber! <BR>
        Das Problem mit den HTML-spezifischen &Uuml;bersetzungen ist damit nicht zu l&ouml;sen (alles "zu Fuss" machen -&gt; nah danke) und Feinheiten der HTML-Sprache gehen dabei auch verloren. Ich benutze zwei Programme die sich als recht gut herausgesellt haben. <BR>
        <BR>
        <UL>
            <LI>webPlug v1.45 (2.x)  
            <LI>MetalWEB 4.0.1  
        </UL>
        <BR>
        Zu webPlug ist zu Sagen, es ist ein HTML-Editor ohne grosse Schn&ouml;rkel aber zum schreiben gut zu gebrauchen und es hat eigentlich recht viel an HTML-spezifischen sachen eingebaut. Es ist &uuml;brigens auf einer Cover-Disk von der Amiga plus Ver&ouml;ffentlicht! Und AP-CD-Rom! <BR>
        <BR>
        <HR WIDTH="30%">
        <BR>
        Zu MetalWEB ist zu Sagen, wenn man es ans Laufen bekommt (was bei mir recht schwierig war) dann ist es in sienem WYSIWYG-Stihl recht ansprechent, doch davon sollte man (oder frau) sich nicht blenden lassen. Dann es hat so seine t&uuml;cken. <BR>
        <BR>
        <OL>
            <LI>Es kann leicht zum absturtz gebracht werden, meistens gerade dann wenn man es &uuml;berhaubt nicht gebrauchen kann.  
            <LI>Es ist mit 40,-- DM auch nicht gerade billig!!!
        </OL>
        <BR>
        <HR>
        <BR>
        Zu Scanns <BR>
        <BR>
        Scanns sind in einer Aufl&ouml;sung von Minimum 50 DPI bis ca. 150 DPI recht gut, je nach gr&ouml;sse. <BR>
        Der ausschnitt von Saschas Brief zum Beispiel ist mit 75 DPI was die gr&ouml;sse angeht und auch die Lesbarkeit, ein guter Kompromiss. <BR>
        <BR>
        <HR>
        <BR>
        <P ALIGN="CENTER"><A HREF="mitglieder/voepel.html"><IMG SRC="voepel_1.png" ALT="Martin Voepel" BORDER="0"></A><BR>
        </P>
        <BR>
        </P>
    </BODY>
</HTML>
