<HTML>
<HEAD>
<TITLE>Leserbrief von Charly</TITLE>
</HEAD>
<BODY BACKGROUND="l_bg.gif" TEXT=#000000 LINK="#0000FF" VLINK="#000080" ALINK="#FF0000" BGCOLOR="#FFFFF4">
<a name="top"></a><br>
<center><font color="#000080" size="4">
<b> Charly &acute;s Leserbrief</b></font></center></p>
<ul type="square">
<li><a href="#a1"><b>an Wolf Zimmer</a></b></li>
<li><a href="#a2"><b>an Kilian Servais</a></b></li>
<li><a href="#a3"><b>an Ren&eacute; Stelljes</a></b></li>
<li><a href="#a4"><b>Feedback</a></b></li>
</ul>
<table width=100% border=0 cellpadding=6><tr><td>
<center>
<H4>Hallo, ich bin der neue!</H4>
</CENTER>
<font size="3">
Ich bin der Charly, ne!<BR>
Nun habe ich mich entschlossen, dem Club beizutreten.<BR>
Als Online-Mitglied. Wolf hatte mir das ja schon vor Jahren nahe gelegt. :-)<BR>
Nun ist es passiert. ;-)                             <BR>
                                                     <P>
Laut MitgliederListe ist der durchschnittliche User etwas &uuml;ber 29 Jahre alt.
Damit geh&ouml;re ich zum &auml;lteren Teil.<BR>
Das geschieht einen dreifachen Opa recht. :)<BR>

Nun kenne ich mich noch nicht so gut aus mit HTML und darum
werde ich mir mal ein Layout klauen. Wolf Zimmer kenne ich am
besten und er hat IMHO auch das beste Layout und darum greife ich
zu und versuche es umzusetzen. Sorry, Wolf! ;)<BR>

Kurz zu meiner Computer-Laufbahn:<br>
Mein erster Computer war ein A500plus, OS2.0, 2MByte Speicher
und nur Disk-Laufwerke. Den hatte ich mir im M&auml;rz 1993 gekauft.

Im M&auml;rz 1994 legte ich mir einen A1200, OS3.0, 210MB Platte zu.
Was f&uuml;r ein Unterschied - wie konnte man nur mit nur DiskLaufwerken arbeiten. :)
Den Rechner habe ich heute noch. Er ist nat&uuml;rlich etwas aufger&uuml;stet.
Genaueres in der <a href="Mitglieder/bader.html">MitgliederListe</a>.<p>

Dann begann ich mit AMOSPro zu programmieren und habe seit November &acute;94 ein Disk-Mag herausgegeben.
Das ging 53 Monate lang, jeden Monat eine Disk-Mag-Ausgabe und in der Zeit noch 19 Extra-Ausgaben.
War eine sch&ouml;ne Zeit. Aber man muss auch aufh&ouml;ren k&ouml;nnen. ;)<br>
<p>
Nun habe ich die NoCover schon fr&uuml;her mal gelesen, da mal mehr los.
Damals zu Zeiten des &acute;MagneticPage-Displayer&acute;. Aber ich glaube, die Qualit&auml;t
des Magazins ist heute besser. :) Weniger ist manchmal mehr!<br>
<p>
Nun habe ich keine Grafikkarte und habe DblPalHires flimmerfrei als Screen.
Und ich habe auch nur 32 Farben eingestellt.
Manche Seiten finde ich nicht so gut. Zum Beispiel in Ausgabe NC78 konnte ich
den Artikel &acute;BurnProof&acute; nicht besonders gut lesen. Bei mir sehe ich einen
roten Hintergrund, wo sich die schwarze Schrift nicht sonderlich hervorhebt.
Der rote Hintergrund sollte wohl als Feuer das Thema Brennen unterstreichen.
Aber ich denke, das ein Mag zum lesen da ist und da ist es wohl das Beste,
einen hellen Hintergrund mit schwarzer Schrift zu w&auml;hlen.
Gut, ich konnte es noch lesen, indem ich meine Lichtquellen &auml;nderte. Und es gab
schon schlimmeres in vorherigen Ausgaben. ;((<br>

<p>
Ich denke, man schreibt Artikel, damit andere User sie lesen und da sollte
man doch ein, gut lesbares Layout herstellen. Warum dann Hintergr&uuml;nde, wo sich
die Schrift nicht besonders abhebt? Sowas lese ich dann erst gar nicht!<br>
Oder habe alles falsch eingestellt? Mir reichen 32 Farben - denn bei 256 Farben
l&auml;uft mein Rechner langsamer... und da&szlig; mu&szlig; ich nicht haben!
Nun k&ouml;nnt Ihr mich teeren und Federn... aber das ist nun mal meine Meinung.<br><p>
Nun hoffe ich, da&szlig; ich alles einigerma&szlig;en HTML-m&auml;&szlig;ig hinbekommen habe und
man liest sich n&auml;chsten Monat.
<p>
Alles Gute...<br>
Charly<br>
<p>
<a href="#top">zum Anfang</a>
<p>
<hr>
<a name="a1"><p><br>
<h3>Hoi Wolf,</h3>
<p>kennst Du dieses &acute;Hoi&acute; noch? Ja, es von Ruud aus Holland!<br>
Ja, es ist schon verdammt lange her. Damals hattest Du, wie ich mich<br>
erinnere, auch noch einige Gr&uuml;nde <b>nicht</b> mit DF&uuml; zu beginnen. :-) <br>
<p>
Nun hatte ich mir eine kleine &acute;Schreibpause&acute; geg&ouml;nnt, fast 18 Monate.<br>
War zwischendurch mal ein, zwei Monate in einer MailingListe, aber dort<br>
wurde mir dann zuviel unn&uuml;tzes Zeug geschrieben. Da hatte ich keine Lust<br>
mehr. Es kann nun durchaus passieren, da&szlig; ich hier im NoCover einige meiner<br>
Ungereimheiten loslasse. :) <br>
<p>
Die Zukunft wird es bringen, ob ich was sinnvolles hier beisteuern kann.<br>
Manchmal will ich so viele Sachen machen und das ist dann leider nicht so<br>
gut, weil ich dann total viel im Kopf habe und nix vern&uuml;nftig mache.<br>
<p>
Nun hatte ich mir im Januar &acute;ArtEffect 3.0&acute; bestellt. Da war erst kein Hand-<br>
buch dabei - und bei dem Workshop aus der A-OS, dann A+ waren die versprochenen
Bilder nicht auf der HomePage. Das hatte den Effekt, da&szlig; ich keine Lust mehr hatte
und da ich das Programm jetzt schon viele Monate habe und ich mich immer noch
nicht richtig damit besch&auml;ftig habe. Und es gibt nun schon ein Update auf V_4.0!
Und ich kenn mich noch nicht mit V_3.0 aus! Das ist nat&uuml;rlich taurig. ;((<br>
<p>
Mit &acute;TurboPrint V_7.0&acute; habe ich wohl schon ein paar gute Sachen f&uuml;r mich und
meinen Drucker Canon BJC-240 heraus gefunden. TP unterst&uuml;tzt nun meine FotoPatrone
und genial ist da auch, das man jetzt Texte mit den Bilder erstellen und drucken
kann. Da brauche ich bei meinen Bed&uuml;rfnissen gar kein FinalWriter und auch kein
WordWorth mehr. :)<br>
<p>
Dann habe ich mir noch den &acute;PictureManager V_5.5&acute; gekauft und damit habe ich
mich auch kaum besch&auml;ftigt.<br>
<p>
Definitiv mu&szlig; ich mir mal eine Liste machen und dann ein Programm nach dem
anderen gr&uuml;ndlich durch arbeiten. Aber, ob mir das gelingt? :-)<br>
<p>
Nun habe erstmal genug geschrieben...<br>
das hast Du nun davon.... <br><p>
Sch&ouml;ne Gr&uuml;&szlig;e aus Hannover von Charly<br>
<p>
<a href="#top">zum Anfang</a>
<p>
<hr><br>
<p>
<a name="a2"><p><br>
<h3>Hallo Kilian,</h3>
<p>
nun denke ich, da&szlig; Deine Aktion damals Ende 1998 mit der CD-ROM wohl doch nicht
geklappt hat. Auf jeden Fall hatte ich nix mehr von dem Projekt mitbekommen. :)
<p>
Gut, das ist nicht weiter schlimm und so richtig habe ich daran auch nicht
geglaubt. :) Naja 50 HAM&acute;s und andere MAG&acute;s auf einer CD w&auml;ren ja nicht schlecht
gewesen, aber da h&auml;tten sowieso nur sehr wenige User Interesse dran gehabt.
Ich habe ja nun seit M&auml;rz 1999 mit dem HAM aufgeh&ouml;rt, aber mich reizt schon
alle Ausgaben auf CD zu brennen.<br>
<p>
Ich wei&szlig; nur noch nicht so genau wie ich das anstelle. Einen Brenner habe
ich im PC meiner Tochter. Der wird wohl aber nicht von Amiga-Software unterst&uuml;tzt.
Und f&uuml;r AmigaKompatible Sachen will ich im Moment kein Geld ausgeben.
Die ganzen Mags habe ich nat&uuml;rlich auch und ich &uuml;berlege, ob ich folgende Idee verwirklichen
kann.<p>
Ich habe ja noch eine 1GB-Platte rumliegen. Wenn ich da alles rauf kopiere und
die Platte im PC einbaue, kann das funktionieren? Wei&szlig;t Du da Bescheid?
<p>
Alles Gute... Charly
<p>
P.S. Falls dies auch andere Leute lesen, die sich da auskennen, bin ich nat&uuml;rlich
&nbsp; &nbsp; &nbsp; &nbsp;  &nbsp; f&uuml;r Tipps dankbar.
<p>
<a href="#top">zum Anfang</a><p><br>
<hr><br>
<a name="a3"><br>
<p><br>
<p><br>
<p><br>
<p><br>
<h3>Hallo Ren&eacute;,</h3>
<p>
jetzt k&ouml;nnte es gut m&ouml;glich sein, da&szlig; wir uns kennen. Du hattest<br><p>
mal geschrieben, da&szlig; Du bei &acute;Black &amp; White&acute; arbeitest. Warst<br><p>
Du denn auch 1996 mit in G&uuml;tersloh beim Computertreffen? Dann haben<br><p>
wir uns gesehen. Genau wei&szlig; ich nur, da&szlig; Burckhard nicht alleine war.<br><p>
<p>
Mittwoch, den 6. September 2000 war ich &uuml;brigens mal in Bremen, nur mal so.<br><p>
Und da konnte ich es mir nicht entgehen lassen &raquo; Black &amp; White &laquo; zu<br><p>
besuchen. Bei der Gelegenheit Sch&ouml;ne Gr&uuml;&szlig;e an Burckhard und die<br><p>
SwitchBox funktioniert wunderbar. Leider hatte ich ein paar<br><p>
Kabel vergessen. Die mu&szlig;te ich mir dann in Hannover kaufen.<br><p>
<p><br><p>
Alles Gute... Charly
<p>
<p><br>
<a href="#top">zum Anfang</a>
<p><br>
<hr><br>
<h3><a name="a4">FeedBack</h3>
<p>
Wenn ich es nun richtig verstanden habe, ist ein &acute;FeedBack&acute; der letzten
Ausgabe erw&uuml;nscht. Top 5 oder so... Also, die 5 Beitr&auml;ge, die mir pers&ouml;nlich
am besten gefallen haben.
<p>Folgende Artikel habe ich ausgew&auml;hlt:<p>
<ul>
<li> <b>1. AmigaAktuell</b> von Carsten Schr&ouml;der und Co-Autoren</li><br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; F&uuml;r mich das Beste - Mag im Mag.:) Ist es w&auml;hlbar?<br>
<li> <b>2. Wolf Info</b> von Wolf Zimmer</li><br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Wolf hatte mehrere gute Beitr&auml;ge.<br>
<li> <b>3. BurnProof</b> von Higgins</li><br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Schlechte Lesbarkeit f&uuml;hrt zur Abwertung<br>
<li> <b>4. Amiga Arena CD</b> von The Bruce</li><br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Alle Artikel von Killian sind gut geschrieben.<br>
<li> <b>5. Online Links</b> von Guile2000  </li><br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Punkt, weil sein Layout besser geworden ist. :-)<br>
</ul>

<a href="#top">zum Anfang</a></p>
<hr><br>
<center>
<table border="6" width=95%><tr><td>
<center>
Autor:  &nbsp; &nbsp; <a href="Mitglieder/bader.html">Karl-Heinz Bader</a>&nbsp; &nbsp;
E-Mail: <a href="mailto:charly-ham@t-online.de"> charly-ham@t-online.de</a> <br>
</center>
</td></tr></table></center>
<br>
<p>
</font>
</BODY>
</HTML>
