<html>
<head>
<!--  "author"="Wolf Zimmer"  -->
<title>Wolf-INFO</title>
</head>
<body background="wolf1.gif" text=black link=blue  bgcolor=gray>
<a name="top"></a><br>

<p align="center"><font color="#000080" size="7">
<b>(Auf-)gelesen</font></b></p>

<table border=0 width=100% cellpadding=6><tr><td>
<p><font size="+1"><b>Netz-Pr&uuml;fung: CDU will &raquo;virtuelles
Abitur&laquo;</b></font><br>&nbsp;<br>

<b>Ein &raquo;virtuelles Abitur&laquo; &uuml;ber das Internet fordern
CDU-Bundestagsabgeordnete aus den neuen L&auml;ndern im Rahmen einer
Klausurtagung mit dem Schwerpunktthema Bildung.</b><br>&nbsp;<br>Der
Vize-Vorsitzende der CDU/CSU-Bundestagsfraktion, G&uuml;nter Nooke, und der
Vorsitzende der Landesgruppe Sachsen, Manfred Kolbe (beide CDU) betonten,
die im Osten inzwischen hoch entwickelte Telekommunikation biete gute
Voraussetzungen f&uuml;r ein virtuelles Abitur. </p>

<p>Selbstgesteuertes Lernen werde zunehmend an Bedeutung
gewinnen. Deshalb k&ouml;nne die Politik unb&uuml;rokratisch die Chance
schaffen, einen solchen Schulabschluss mittels eines Abiturs im Netz
anzuerkennen und offizielle Zertifikate auszustellen. Die neuen
Bundesl&auml;nder k&ouml;nnten hier vorangehen. Kompetenz und Leistung
m&uuml;ssten anerkannt werden, &raquo;unabh&auml;ngig davon, wo diese
erworben wurden&laquo;. (dpa)</p>
<hr width=90%>

<p><font size="+1"><b>Dem Netz verfallen: Droge Internet</b></font><br>&nbsp;<br>

<b>Wenn das Internet zur Sucht wird: Nach einer Studie der M&uuml;nchener
Universit&auml;t leiden vor allem labile und psychisch kranke Menschen
unter langen Ausfl&uuml;gen ins weltweiten Datennetz.</b><br>&nbsp;<br>

Demnach hatten vier von 1.000 Befragten ernste Probleme durch h&auml;ufige
Nutzung des Internets. Bei diesen Betroffenen habe bereits eine
psychiatrische Erkrankung bestanden, sagte der Professor Ulrich Hegerl. Sie
litten unter Depressionen, Angstneurosen und anderen Manien.</p>

<p>Kennzeichen f&uuml;r krankhafte Nutzung des Internets sei unter anderem
ein Verlust &uuml;ber die Kontrolle der Zeit im Netz sowie ein deutlicher
R&uuml;ckzug aus dem sozialen Leben. Sehr selten habe es k&ouml;rperliche
Entzugserscheinungen wie Nervosit&auml;t und Unruhe gegeben. Die meist
besuchten Webseiten der Betroffenen seien Chats und andere
Kommunikationsadressen, gefolgt von Sexseiten. </p>

<p>Viele Menschen litten an der Illusion, beim Surfen im Internet
menschliche N&auml;he bei gleichzeitiger faktischer Distanz zu erleben,
erkl&auml;rt Hegerl das Suchtverhalten am Bildschirm.
Internet-S&uuml;chtige werden seiner Erfahrung nach abh&auml;ngig von der
faszinierenden M&ouml;glichkeit, schnell mit anderen in Kontakt treten zu
k&ouml;nnen, ohne sofort die eigene Identit&auml;t preisgeben zu
m&uuml;ssen. </p>

<p>Die M&uuml;nchener Ambulanz f&uuml;r Internet-Abh&auml;ngige besteht
seit 1998 - sie ist die erste Einrichtung dieser Art in Deutschland.
(dpa)</p>

<hr width=90%>

<p><font size="+1"><b>Mehr Forschung ins Netz</b></font><br>&nbsp;<br>
<b>Internet-Bibliotheken deutscher Hochschulen sollen durch die Deutsche
Initiative f&uuml;r Netzwerkinformationen (DINI) international besser
zug&auml;nglich werden.</b></p>

<p>Das Projekt &raquo;Open Archive Initiative&laquo; strebe ein weltweites
Archiv mit wissenschaftlichen Publikationen an, teilte die Initiative am
Montag bei der ersten DINI-Jahrestagung mit. </p>

<p>Internet-Publikationen deutscher Wissenschaftler sollen sich durch das
geplante Archiv besser recherchieren und langfristig verwalten lassen, so
die Initiative. Netzwerkbetreiber und Forscher sollten daher bei der
Erstellung und Archivierung von Dissertationen eng zusammenarbeiten, um
einheitliche L&ouml;sungen f&uuml;r die elektronische Ver&ouml;ffentlichung
zu entwickeln. </p>

<p>In der Deutschen Initiative f&uuml;r Netzwerkinformation arbeiten
Hochschulrechenzentren, Unibibliotheken und wissenschaftliche
Fachgesellschaften zusammen. Das Projekt l&auml;uft seit 1999 und wird von
der Deutschen Forschungsgemeinschaft in Berlin gef&ouml;rdert. Rund 100
Experten aus Deutschland, Gro&szlig;britannien und den Niederlanden nehmen
an der Tagung an der Universit&auml;t Dortmund teil. (dpa)</p>
</td></tr></table>

<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr>
<td bgcolor="#a0a0a0">Autor: &nbsp; <a href="Mitglieder/zimmer.html"><b>Wolf Zimmer</a></b> </td>
<td bgcolor="#a0a0a0">E-Mail: <a href="mailto:wolf@wozim.de"><b> wolf@wozim.de</a></b> </td>
<td bgcolor="#a0a0a0">Homepage: <a href="http://www.wozim.de"><b> http://www.wozim.de </a></b>
</td></tr></table>
<br>
</body>
</html>
