<html>
<head>
<title>sof_zakmckracken</title>
</head>
<body background="ncb_bg1.jpg" text="#000000" bgcolor="#b0b0b0">
<table border=0 cellpadding=8 width=100%><tr><td><br><font size="+1">
<p align=center><b>Zak McKracken &nbsp; Amiga Special 03/1989</b></font><br>
gefunden von: HCS &lt;min@hcose.de&gt; </p>

<p>Stellen Sie sich vor, Sie w&auml;ren der Starreporter eines
Sensationsblatts. Stellen Sie sich weiter vor, Ihre Meldungen seien so
sensationell, da&szlig; Sie die meisten davon selbst erfunden haben. Was
w&uuml;rden sie nun machen, wenn Sie pl&ouml;tzlich eine echte
Verschw&ouml;rung von Au&szlig;erirdischen aufdecken, die noch dazu alle
aussehen wie Groucho Marx? </p>

<p>Genau das ist n&auml;mlich die Ausgangssituation des skurilen Adventures
"Zak McKracken aus dem Hause Lucasfilm Games. Klar, da&szlig; ein
notorischer L&uuml;gner wie unser Zak, mit dieser Geschichte auf wenig
Glauben seitens seiner Mitmenschen st&ouml;&szlig;t. Wer seine
Br&ouml;tchen mit Geschichten wie "Der sagenhafte Bigfootgewinnt
gro&szlig;es Wettk&uuml;ssen!" oder "Riesiger Lunapark auf dem Mars
entdeckt!" verdient, gilt kaum als besonders vertrauensw&uuml;rdig. Dennoch
ist alles wahr: Eine Horde &uuml;bler Aliens hat die Leitung
derTelefongesellschaft an sich gerissen, um &uuml;ber die Fernsprecher
"Verbl&ouml;dungsstrahlen" auf die ahnungslose Menschheit loszulassen. Sind
dann alle Menschen erst auf das geistige Niveau der Invasoren herabgesetzt,
sollte es ein Leichtes sein, die Erde zu &uuml;bernehmen - so der Plan
derAu&szlig;erirdischen. Da Sie, alias Zak McKracken, als Einziger um die
schreckliche Wahrheit wissen, liegt es allein an Ihnen, die Invasion
aufzuhalten! </p>

<p>Das Game paart eine geh&ouml;tige Portion absuten Humors , im Stil von
"Hitchhikers Guide", mit optischer Pr&auml;sentation in der Art der
Sierra'Online-Serie. Das bedeutet, da&szlig; alle Aktionen, wie in einem
Kinofilm auf dem Schirm ablaufen. Nur, da&szlig; die Grafik weit
sch&ouml;ner ist, als wir das von Spielen, wie etwa "Kings Quest" gewohnt
sind. Auch in Sachen Eingabekomfort hat man sich bei Lucasfilm Games etwas
einfallen lassen: So werden alle Verben, die der Parser f&uuml;r die
jeweilige Situation akzeptiert, im unteren Drittel der Screen angezeigt,
und m&uuml;ssen nur noch mit der Maus angeklickt werden. Das entsprechende
Objekt dazu, wird dann direkt im Bild angeklickt. Das l&auml;stige
R&auml;tselraten um die richtige Wortwahl kann somit unter den Tisch
fallen. </p>

<p>Witzige Gags, die gelungene Grafik und nicht zuletzt die komfortable
Steuerung sorgen daf&uuml;r, da&szlig; "Zak McKrakken" wirklich riesigen
Spa&szlig; macht. Die gestellten R&auml;tsel sind alle logisch; wenngleich
nicht unbedingt leicht zu knacken. Das Programm ist jedoch
gro&szlig;z&uuml;gig aufgebaut und erlaubt es dem Spieler, wenn er an einer
Stelle feststeckt, einfach anderswo weiter zu t&uuml;fteln. Au&szlig;erdem
sorgen, von Zeit zu Zeit auftauchende, "Trickfilmeinlagen", auf die der
Spieler nicht Einflu&szlig; nehmen kann, f&uuml;r kleine Hilfen und
Hinweise in welcher Richtung man weiter denken sollte. </p>

<p>Tja, es ist schwer, irgendwelche M&auml;kel an "Zak McKrakken" zu
finden, das Spiel war nicht umsonst ein so gro&szlig;er Erfolg auf dem
64er. Selbst die Packungsaufmachung ist gelungen, die beiliegende Ausgabe
der Zeitschrift "National Inquisitor" spr&uuml;ht &uuml;ber vor Humor und
versteckten Hinweisen. Wer also ein wirklich lustiges Adventure sucht, bei
dem auch die Grafik nicht zu kurz kommt, der liegt bei "Zak McKracken"
goldrichtig! (m1) </p>
</td></tr></table>
<br>&nbsp;
</body>
</html>
