<!-- saved from url=(0022)http://internet.e-mail -->
<html>
<head>
<title>DSL</title>
</head>
<body background="ncb_bg3.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"> <b>D S L</b> </font> </p>

<p><b>Lowspeed statt Highspeed, warum ist DSL nicht gleich DSL? </b></p>

<p>Recht oft habe ich in letzter Zeit von Freunden und Bekannten
geh&ouml;rt, dass sie endlich ihren heisserwarteten DSL-Zugang bekommen
haben. Sind dann die mehr oder wenig technischen Anschlussh&uuml;rden
&uuml;berwunden, geht es zum ersten mal mit Highspeed auf der
&Uuml;berholspur ins Internet. So sagt es uns die Werbung. Doch hoppla, was
ist das? Statt Highspeed kriechen einige immer noch durchs Netz der Netze,
als h&auml;tten sie nie ihre ISDNLeitung gegen DSL eingetauscht? Wie kann
soetwas passieren? </p>

<p>Die ganze Sache ist denkbar einfach. Die DSL-Verbindung ist etwas
empfindlicher, als die gewohnte Telefonverbindung. Alle paar Kilometer muss
die Verbindung verst&auml;rkt werden, um das System aufrecht zu halten,
auch bei voller Auslastung. Die deutsche Telekom, insbesondere T-Online hat
hierzu etwa in Abst&auml;nden von einigen Kilometern sogenannte
Knotenpunkte errichtet. Von dort aus gelangen die einzelnen
DSL-Verbindungen zum Verbraucher. Aber sehen wir uns DSL dochmal technisch
noch etwas genauer an... </p>

<p><b>"DSL" "D"</b>eutsche <b>"S"</b>urfende <b>"L"</b>eute? </p>

<p>DSL steht als Abk&uuml;rzung f&uuml;r "D"igital "S"ubscriber "L"ine.
W&auml;hrend bei ISDN selbst mit Kanalb&uuml;ndelung und
ausgekl&uuml;gelter Kompressionsverfahren maximal 200kbit pro Sekunde zu
erreichen sind, bietet die neue DSL-Technik bis zu satte 2,3 Mbit pro
Sekunde. Das Gute an dieser Technik war und ist, dass daf&uuml;r keine
eigenen Kabel verlegt werden mussten. Deswegen konnte die deutsche Telekom
das Bundesgebiet so relativ z&uuml;gig mit der neuen Technik versorgen.
Jede Standart-Telefonleitung verf&uuml;gt &uuml;ber zwei Adern und hierauf
l&auml;uft eben auch die DSL-Verbindung. </p>

<p>F&uuml;r etwas Verwirrung sorgen dann jedoch noch die unterschiedlichen
Technologieunterschiede und Bezeichnungen der diversen Anbieter. Der
eigentlich gr&ouml;sste Unterschuied besteht aber nur zwischen der
SDSL-Technik (Symmetric bitrate DSL) und ADSL (Asymetrical DSL) - bitte um
himmeldwillen nicht weiterhin das Ger&uuml;cht verbreiten, ADSL w&uuml;rde
f&uuml;r "Analog DSL" stehen, oder derartige Unsinnigkeiten! "Symmetric"
bedeutet das die angegebene &Uuml;bertragungsgeschwindigkeit in beide
Richtungen m&ouml;glich ist. Also k&ouml;nnen Daten genauso schnell ins
Internet hin &uuml;bertragen werden (upstream), wie sie aus dem Internet
auf den Rechner geladen werden (Downstream). Bei der ADSL-Technik, der
weitaus g&uuml;nstigeren und daher im Privatbereich gebr&auml;uchlicheren
Technologie k&ouml;nnen in gleicher Zeit wesentlich mehr Daten aus dem
Internet geholt werden, als ins Internet geschickt. </p>


<p><b>Neue Technik T-DSL? </b></p>

<p>Nun steht noch der irrwitzige Begriff "T-DSL" im Raume. Einfach nur eine
Marketingbezeichnung f&uuml;r die DSL-Technik von T-Online, dem
Hauptanbieter von DSL, da er ja auch &uuml;ber die Grundversorgung mit der
Telefonleitung verf&uuml;gt. T-DSL ist somit keine andere, oder neuere
DSL-Technik, sondern bezeichnet lediglich die ADSL-Technik der deutschen
Telekom. </p>


<p><b>Speed in was? </b></p>

<p>Geschwindigkeiten werden anhand der &uuml;bertragenden Daten pro Sekunde
angegeben. Die Bezeichnung kb/s deutet aber nicht auf Kilo"BYTE" pro
Sekunde hin, sonder auf kilo"BIT"! Um das Ganze in besser vorstellbare
Werte umzurechnen, muss der Faktor "8" angewendet werden. Um 1 Kilobyte zu
erhalten, m&uuml;ssen als 8 Kilobit &uuml;bertragen werden. Wenn nun ein
Download ansteht von mehreren MegaByte, kann man sich zumindest theoretisch
vorher ausrechnen, wie lange der Download etwa dauern k&ouml;nnte. </p>

<p>Die h&ouml;chsten &Uuml;bertragungsraten sind mit SDSL zu erreichen.
Hier sind wie schon erw&auml;hnt &uuml;ber 2 Megabit pro Sekunde in beide
Richtungen kein Problem. T-Online und alle darauf basierenden Anbieter
bietet auf seiner ADSLTechnik, was gleichzeitig T-DSL benannt ist lediglich
768 Kilobit pro Sekunde vom Internet zum heimischen Computer an und beim
Upstream vom Rechner ins Internet nur noch 128 Kilobit. Das h&ouml;rt sich
verglichen mit den h&ouml;heren Werten der anderen &Uuml;bertragungsarten
erheblich kleiner an, reicht aber in der Praxis locker, um anst&auml;ndig
durchs Internet zu surfen, ohne den einzelnen Seiten beim Aufbau zusehen zu
m&uuml;ssen und kleinere und mittlere Dateien herunterzuladen. In
Verbindung mit einer Flatrate, also der Onlineverbindung ohne zeitliches
Limit werden dann auch gr&ouml;ssere Datendownloads ohne Schrecken vor der
kommenden Rechnung m&ouml;glich. </p>


<p><b>Warum trotzdem langsam? </b></p>

<p>Wie schon berichtet, hat die Telekom Knotenpunkte errichtet, von wo aus
die einzelnen Haushalte mit DSL versorgt werden. Ist ein solcher Haushalt
zu weit vom n&auml;chsten Knotenpunkt entfernt n&auml;mlich mehr als 4
Kilometer, so kann er nicht f&uuml;r DSL freigeschaltet werden. Hierzu
wurden extra Bereiche von der Telekom berechnet, in denen sich die
Haushalte befinden m&uuml;ssen. Etwa vier Kilometer zum n&auml;chsten
Knotenpunkt. Ist die Entfernung weiter, wird der DSL-Zugang nicht
genehmigt, um zu gew&auml;hrleisten, dass theoretisch die maximalen
Transferraten sichergestellt sind. Wer also seinen DSL-Anschluss bekommen
hat, sollte m&ouml;glichst auch mit 768 Kilobit in der Sekunde surfen
d&uuml;rfen. In Ballungsgebieten, also gerade in den Grossst&auml;dten, ist
es in der Praxis aber leider oft genug so, dass viel zu viele User an einem
Knotenpunkt h&auml;ngen. Hier werden dann zur Abhilfe mehrere Knotenpunkte
erichtet, um der Leistungsverringerung entgegenzuwirken. Anders ist es in
Kleinst&auml;dten und l&auml;ndlichen Gegenden der Fall. Greifen hier viele
Teilnehmer auf einen Knotenpunkt zu, so m&uuml;ssen die Leistungsressourcen
geteilt werden. Die DSL-Verbindung bekommt also nicht ihre maximale
Kapazit&auml;t. Wie schnell es dann noch voran geht, h&auml;ngt zu einem
gro&szlig;en Teil davon ab, wieviel Anwender gleichzeitig in der Gegend
gerade surfen. Im ung&uuml;nstigsten Fall wird der Spass mit dem Highspeed
dadurch so stark gebremst, dass der Unterschied zur eigentlich wesentlich
langsameren ISDNVerbindung nicht mehr allzu gross ist. </p>

<p>Optimal l&auml;sst es sich surfen, wenn man g&auml;nzlich weit weg vom
Schuss lebt. Wer sich mit nur zwe-drei Nachbarn die n&auml;here Umgebung,
nicht aber den einzigen DSL-Knoten teilt, kann sogar auf h&ouml;here
Transferraten kommen. So ist es auch in meinem Fall. Zu unserer Wohnung
f&uuml;hrt nur ein kleiner geteerter Feldweg und von unseren sechs Nachbarn
ist niemand mit einer DSL-Verbindung bislang am n&auml;chsten Knotenpunkt.
Teilweise schl&auml;gt mein DSL-Speedmanager dadurch bis zu 900 Kilobit in
der Sekunde aus und beim Upstream deutlich &uuml;ber 200 Kilobit. </p>


<p><b>Was tun, wenns zu langsam voran geht? </b></p>

<p>T-Online garantiert die maximal verf&uuml;gbare Geschwindigkeit dem
Endanwender. Das bedeutet, wenn man &uuml;ber l&auml;ngere Zeit hinweg
wirklich selten auf die 768 Kilobit Down- und 128 Kilobit Upstream kommt,
sollte man sich auf alle F&auml;lle bei der Telekom beschweren. Entweder
werden dann Betr&auml;ge zur&uuml;ck erstattet, oder aber die Telekom sorgt
m&ouml;glichst schnell f&uuml;r Abhilfe. Rein technisch hat die deutsche
Telekom penibel darauf geachtet, dass bundesweit die Transferrate gehalten
werden kann. In der Praxis wird das nicht &uuml;berall funktionieren, aber
wer einen DSL-Anschluss bekommen hat und daf&uuml;r zahlt, hat rein
rechtlich Anspruch auf R&uuml;ckerstattung eines Kostenanteils oder eben
Behebung der Probleme. </p>


<p><b>Analoger Anschluss oder ISDN? </b></p>

<p>Gerne werden Angebote so formuliert, als sei die DSL-Technik nur in
Verbindung mit ISDN zu haben. Das ist v&ouml;lliger Unsinn. Auch wenn man
nur sein eines analoges gutes altes W&auml;hlscheibentelefon aus den
Vorkriegsjahren noch im Hause hat, ist ein DSL-Anschluss problemlos
installierbar. Von der Telekom wird ein DSL-Splitter geliefert, der in die
analoge Anschlussdose gesteckt wird. Das ist die einzige Voraussetzung, es
muss eine solche Anschlussdose existieren, - d.h. das Kabel vom Telefon
darf nicht mehr oder weniger direkt in die Wand gehen, sonder per
TAEStecker in eine Dose gesteckt werden k&ouml;nnen. Ansonsten l&auml;sst
sich eine solche Dose nat&uuml;rlich v&ouml;llig problemlos
nachr&uuml;sten. Vielleicht kommt aber ISDN im Bundle mit der
DSL-Verbindung trotzdem in Frage, da es ISDN oft f&uuml;r wenig M&uuml;nzen
mehr im Monat schon dazu gibt. Mir wurde im Dezember 2001 beispielsweise
ein Angebot gemacht, wo ich ISDN und DSL f&uuml;r nur 5,- DM mehr im Monat
gegen&uuml;ber nur einem DSL-Vertrag h&auml;tte bekommen k&ouml;nnen. Wer
also schon immer mal mit den Funktionen von ISDN gelieb&auml;ugelt hat,
oder einfach die zweite Telefonleitung, die es bei ISDN ja
standartm&auml;ssig dazu gibt, gut gebrauchen kann, f&uuml;r den lohnt sich
ein solches preiswertes Komplettangebot sicherlich. Wie gesagt -
erforderlich ist ISDN aber in keinster Weise, um mit DSL ins Internet zu
gelangen! </p>


<p><b>Was brauche ich f&uuml;r Ger&auml;te? </b></p>

<p>Von der deutschen Telekom bekommt man den DSL-Splitter, der wie schon
erw&auml;hnt in die Telefondose gesteckt werden muss. Am Splitter befinden
sich i.d.R. drei TAE-Anschl&uuml;sse und ein Anschluss f&uuml;r das
DSL-Modem. In die TAE-Anschl&uuml;sse lassen sich wie gewohnt die
Endger&auml;te, wie Telefon, Fax und Anrufbeantworter, aber nat&uuml;rlich
auch das gute alte und nun eigentlich &uuml;berfl&uuml;ssige 56k-Modem
beispielsweise hineinst&ouml;pseln. Der weitere Anschluss f&uuml;hrt dann
per Verbindungskabel zum eigentlichen DSL-Modem. Der Splitter braucht nicht
extra gekauft werden, er wird mit der monatlichen Grundgeb&uuml;hr von der
Telekom mit berechnet und ist darin also inklusive. Bis Ende 2001 war sogar
das DSL-Modem bei der Telekom im Preis enthalten. Seit 2002 muss dieses nun
extra dazu gekauft werden. Einige Anbieter schn&uuml;ren aber bereits
interessante Angebote, wo das Modem wieder in einem Komplettpreis
kostenseitig verschwindet. Jetzt fehlt noch der Anschluss zwischen
DSL-Modem und dem Computer und hier kommt der eigentlich Clou der Technik.
DSL wurde so entwickelt, dass es konform mit der bestehenden
Standart-LAN-Netzwerktechnik arbeitet. Der Computer ben&ouml;tigt also
lediglich einen LAN-Netzwerkadapter (Netzwerkkarte). Theoretisch
gen&uuml;gen hierf&uuml;r sogar die eigentlich langsamen 10 Megabit-Karten
v&ouml;llig aus. Wer aber eine neue Karte kaufen muss, wird gleich auf
aktuelle 10/100Mbit zugreifen, da die langsameren Karten eigentlich
nirgendwo mehr angeboten werden. Lediglich bei unseren Amigacomputern
findet diese Technologie auch neu noch Absatz. Wie gesagt, f&uuml;r DSL
reicht das locker aus, da wir mit unserer DSL-Verbindung nicht mal
ann&auml;hernd die m&ouml;gliche Bandbreite ausnutzen werden. Wer hingegen
&uuml;ber den PC surfen m&ouml;chte, oder das neue AmigaOSXL von Haage &
Partner verwendet, - Hardwarebasteleien aber scheuht oder einfach nur
m&ouml;glichst schnell und einfach auch mal den DSL-Anschluss an anderen
Rechnern anst&ouml;pseln k&ouml;nnen m&ouml;chte, kann sich auch f&uuml;r
einen USB-Netzwerkadapter entscheiden. Diese kleinen Ger&auml;te lassen
sich in jeden g&auml;ngigen USB-Anschluss stecken und verbinden dadurch den
Rechner und das DSL-Modem. </p>


<p><b>Fazit: </b></p>

<p>Wer erst einmal die volle Geschwindigkeit von DSL erfahren hat,
ger&auml;t in den Internetrausch. Sich anschliessend wieder vor ein
56k-Modem zu setzen grenzt dann an seelischer Grausamkeit. Ich w&uuml;rde
daher DSL ruhig zusammen mit einer Flatrate in Betracht ziehen, da das neue
Geschwindigkeitserlebnis sich nur dann unbegrenzt voll entfaltet geniessen
l&auml;sst. Ich zahle f&uuml;r DSL + Flatrate etwa 40 Euro im Monat. Das
ist sicherlich noch sehr viel Geld, aber ich w&uuml;rde diese
M&ouml;glichkeiten nicht mehr missen m&ouml;gen und habe das von allen
anderen DSL-Nutzern eigentlich in &auml;hnlicher Form geh&ouml;rt. Nur so
macht das Internet eigentlich erst richtig Sinn. Zu meinen 56k-Zeiten hatte
ich immer um die 30,- DM im Monat f&uuml;r das Internetsurfen ausgegeben.
Die Internetkosten sind daher bei mir wesentlich teurer geworden.
Daf&uuml;r ist es jetzt v&ouml;llig egal, was ich an Software, Musik,
Grafik oder Information aus dem Netz haben m&ouml;chte, - ich kann es
jederzeit in seiner aktuellsten Version bekommen. Wer viel im Internet
surft, sollte DSL unbedingt mal in Erw&auml;gung ziehen. </p>

<p>Euer HIGGINS <br>
Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
