<html>
<head>
<title>"USB 2.0"</title>
</head>
<body background="cordbg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="5"><b>USB 2.0 - <br>
Darfs auch etwas mehr sein? </b></font></p>

<p>Im Gegensatz zum angek&uuml;ndigten Zukunftsstandart "Bluetooth", eine
Schnittstelle, die diverse Komponenten kabellos miteinander in Kommunikation
bringen soll, entwickelt sich der USB-Port zu einer echten
Highspeedschnittstelle rasend voran. Von der Vorg&auml;ngerversion, die
aktuell noch in den h&auml;ufigsten Computersystemen verwendet wird, dem
USB 1.1 hat sich der "<b>U</b>"niversal "<b>S</b>"erial "<b>B</b>"us, der
zu deutsch universelle serielle Bus um den Faktor vierzig auf den neuen
Standart 2.0 gemausert. Man stelle sich vor, vierzig mal schneller arbeitet
der neue USB-Port. W&auml;re doch schade drum, wenn man das nur f&uuml;r
Drucker, Scanner und Modem nutzen w&uuml;rde.... </p>

<p>Vorreiter des USB-Ports war wie nicht selten die Firma Apple, die auch
st&auml;ndig an der Weiterentwicklung des USB-Standarts und der optisch
&auml;hnlichen Firewire-Schnittstelle arbeitet. Bei den Macs verzichtete
man als erstes auf alle altert&uuml;mlichen und unn&ouml;tig
unterschiedlichen Schnittstellen, die auch nach vielen Verbesserungen nicht
ann&auml;hernd solch hohe Datenraten h&auml;tten schaffen k&ouml;nnen, in
der Handhabung komplizierter sind und es auch mit dem echten Plug´n´Play
nicht so sehr haben. </p>

<p>Die meisten Tintenstrahldrucker, Scanner, Digitalcameras und sogar
schnelle externe CDRW-Brenner und Festplatten finden ihren Platz an dem
beliebten Port an heute aktuellen Rechnersystemen. Die flotte
Firewire-Schnittstelle hat sich hingegen nur im Video-Bereich durchsetzen
k&ouml;nnen. Bei Peripherieger&auml;ten spielt sie nur eine untergeordnete
Rolle, da man hier schon beinahe Perlen vor die S&auml;ue werfen
w&uuml;rde. </p>

<p>Moderne Peripherie braucht stetig h&ouml;here Datentransferraten, die
jetzt die USB2.0-Schnittstelle bietet. Somit kommt ein technisch einfach zu
handhabender und preiswert zu produzierender Port in neue Rechner.
Videoapplikationen ben&ouml;tigen beispielsweise in Verbindung mit
Digitalen Cameras oder der Videobearbeitung etwa 75 - 150 MBit/s. Bis
MPEG2-Qualit&auml;t geht das ohne Kompression, bei besserer Qualit&auml;t
wird vor allem mehr Rechenkraft f&uuml;r die Kompression ben&ouml;tigt. Die
Transferrate muss dadurch oft nicht wesentlich erh&ouml;ht werden. Scanner
werden etwa mit 50 - 150 MBit/s gehandelt. Hier soll und kann USB zunehmend
die SCSI-Schnittstelle ersetzen, die sonst im professionellen Bereich ein
Muss war, wenn man nicht ewig lange auf das Einscannen in hohen
Aufl&ouml;sungen warten wollte. Auch Drucker begn&uuml;gen sich mit 50 -
150 MBit/s Immer h&ouml;here Aufl&ouml;sungen, mehr Farben und deutlich
mehr bidirektionale Kommunikation mit dem Rechner machen hier den USB-Port
zur besseren Wahl. Externe Speicher, wie schnelle Festplatten, CDRW-Brenner
oder andere Laufwerke wollen bis 400 Mbit/s. Das sind SCSI und IDE
Highend-&Uuml;bertragungsraten, die erst mit USB2.0 oder Firewire
ann&auml;hernd m&ouml;glich sind. Netzwerke sind da die langsameren
Vertreter mit lediglich 10 - 100 MBit/s, den &uuml;blichen Ethernet
&Uuml;bertragungsraten. Auch die DSL-Verbindung f&auml;llt hierunter. </p>


<h3><b>Doch wie arbeitet USB &uuml;berhaupt und warum ist der neue Port
soviel schneller? </b></h3>

<p>Die physikalischen und elektrischen Eigenschaften aller
USB-Schnittstellen sind standardisiert und erm&ouml;glichen somit einen
einwandfreien Betrieb von Ger&auml;ten unterschiedlicher Hersteller
miteinander. Die gesamte Daten&uuml;bertragung innerhalb eines USB-Systems
erfolgt paketorientiert. Der Host (normalerweise der Rechner)
beziehungsweise der Hub &uuml;bernehmen aktiv die Verwaltung und Steuerung
der einzelnen Datenpakete. S&auml;mtliche Datentransfers sowie
Statusabfragen oder Interupts werden erst auf Anfrage &uuml;bermittelt.
Dieses Verfahren nennt man &uuml;brigens Polling. Das Sch&ouml;ne nun an
einem USB2.0-System ist, dass alle Datenraten gleichzeitig genutzt werden
k&ouml;nnen. </p>

<p>F&uuml;r die Date&uuml;bertragung von grossen Datenmengen wird entweder
eine "Bulk-&Uuml;bertragung" oder aber die sogenannte "Isochrone
&Uuml;bertragung" genutzt. Bei einer Bulk-&Uuml;bertragung erfolgt eine
Best&auml;tigung der korrekt empfangenen Daten durch ein
Acknowledge-Signal, zu deutsch "Best&auml;tigung" und einer im Fehlerfall
bis zu dreimal neu angeforderten wiederholten Daten&uuml;bertragung.
Dadurch werden fehlerfreie Daten&uuml;bertragungen gew&auml;hrleistet. </p>

<p>Bei einer Isochronen-&Uuml;bertragung k&ouml;nnen Datenpakete unter
Umst&auml;nden auch verloren gehen, die Datenrate bleibt jedoch konstant.
Dieses Prinzip findet vor allem bei Modems, USB-Lautsprechern oder
Video-Schnittl&ouml;sungen Verwendung. </p>

<p>Bei USB 1.1 gab es die langsameren fr&uuml;hen USB-Schnittstellen mit
&Uuml;bertragungsraten von etwa 1,5 MBit in der Sekunde. Dann kam eine
&Uuml;berarbeitung des 1.1-Standarts, der immerhin 12 MBit pro Sekunde
brachte. USB 2.0 soll nun wahre H&ouml;henfl&uuml;ge erm&ouml;glichen mit
bis zu 480MBit in der Sekunde, was selbst schneller ist, als der aktuelle
Firewirestandart! Bei den Bulk&uuml;betragungen bedeutet das beim alten
USB1.1 nur 16KByte/Sekunde und beim neueren USB1.1-Standart, der zur Zeit
noch am meisten Verwendung findet 1,1 MegaByte in der Sekunde. Richtig
Spass machen aber erst die 56MByte pro Sekunde von USB2.0. </p>


<h3><b>Welche Ger&auml;te kennt USB &uuml;berhaupt?</b></h3>

<p>Um eine m&ouml;glichst einfache Konfiguration der Treiber innerhalb
eines USB-Systems zu erreichen, sind die Standardger&auml;te in
Ger&auml;teklassen aufgeteilt. Diese Ger&auml;teklassen werden
unterschieden mit "Hub", wo alle Netzwerkverbindungen inbegriffen sind.
"Audio" - hier sind Ger&auml;te wie Lautsprecher, Mikrofone und andere
gemeint. Mit "Printer" sind Drucker, Scanner etc. gemeint. "Communication"
- hier vor allem Modems usw. "Mass Storage", hier wurden Festplatten oder
andere Massenspeicher gefunden. Und dann gibt es noch das "Human Interface
Device" (HID), wo vor allem Keyboards, M&auml;use und Joysticks
klassifiziert sind. W&auml;hrend der Initialisierung melden sich die
Ger&auml;te mit ihren jeweiligen Kennungen (festgelegt durch das USB
Implementers Forum) an. Die Ger&auml;teklasse wird nun ermittelt und der
jeweils notwendige Treiber des Betriebssystems kann geladen werden. Die
Kommunikation mit den Endger&auml;ten erfolgt &uuml;ber definierte
Kommunikationskan&auml;le. Pro Endger&auml;t k&ouml;nnen je nach
Spezifikation bis zu 31 Endpunkte parallel angesprochen werden. </p>

<p>USB 2.0 ist eine vollst&auml;ndig abw&auml;rtskompatible Erweiterung des
bestehenden USB-Standards. Vorhandene Kabel und Ger&auml;te k&ouml;nnen
weiter benutzt werden. Auch f&uuml;r den Amiga gibt es bereits ja
M&ouml;glichkeiten den aktuellen USB-Port nachzur&uuml;sten. Ich selbst
habe hierzu noch keine Erfahrungen machen k&ouml;nnen. </p>


<h3><b>USB oder Firewire?</b></h3>

<p>Alles k&ouml;nnte so sch&ouml;n einfach sein, wenn da nicht der Markt
wieder mindestens zwei vielversprechende Highspeedschnittstellen im Angebot
h&auml;tte. Einerseits die von Apple entwickelte Firewire-Schnittstelle
auch IEEE 1394 genannt und die bereits seit 1995 auch von Sony verwendet
wird. Andererseits die in fast jedem neuen PC vorhandenen
USB-Schnittstellen. Die Vor- und Nachteile der jeweiligen Technologie
lassen sich am besten im direkten Vergleich beider Standards aufzeigen. USB
1.1 liegt bei der Daten&uuml;bertragungsrate mit maximal zw&ouml;lf Megabit
pro Sekunde klar hinter Firewire (1394a), der bis zu 400 MBit/s
&uuml;bertr&auml;gt. Erst USB 2.0 erm&ouml;glicht Datenraten mit bis zu 480
MBit/s und liegt somit wieder vorn. </p>

<p>Allerdings steht die neue Firewire-Spezifikation 1394b schon in den
Startl&ouml;chern. Und man ziehe den Hut - bis zu 3,2 Gigabit pro Sekunde
&uuml;ber bis zu 100 Meter lange Kabel sollen mit 1394b m&ouml;glich
werden. Der neue 1394b-Standard verlangt aber eine neue, neunpolige
Steckverbindung, wodurch neben der sechspoligen PC-Steckverbindung und der
vierpoligen Steckverbindung der Sony Videokameras ein dritter
Steckverbinder vorhanden sein muss. In Verbindung mit der maximalen
Leitungsl&auml;nge von 4,5 Metern beim alten Standard sind Verwechslungen
damit vorprogrammiert. </p>

<p>Hingegen sind alle USB-Systeme sehr leicht zu handhaben. Zum einen
bleiben die Steckertypen von USB 1.1 auch in der Version 2.0 erhalten und
somit kompatibel. Zum anderen sind sie nicht zu verwechseln. Der breite
A-Steckverbinder wird immer "Upstream", also in Richtung Host-System
verwendet. Der kleine, eher quadratische B-Steckverbinder kommt immer
"Downstream" in Richtung Peripherieger&auml;t zum Einsatz. Eine
Verwechslung oder das Zusammenstecken von Ger&auml;ten, die nicht
miteinander kommunizieren k&ouml;nnen, ist somit ausgeschlossen. </p>

<p>Einen weiteren Vorteil bietet aber auch noch Firewire. Beim USB-Standart
k&ouml;nnen Peripherieger&auml;te nicht direkt untereinander kommunizieren,
- es ist immer ein Rechner dazwischen notwendig, der die Kontrolle
&uuml;bernimmt. Nehmen wir hier zB. das Drucken eines Bildes von einem
Microdrive, - IBMs Superminifestplatte, die Verwendung in einigen
Digitalcameratypen Verwendung findet. Bei USB kann der Datenspeicher, also
unser Microdrive seine Daten nicht direkt an den Drucker &uuml;bergeben. Es
muss immer &uuml;ber den Computer ausgelesen und dann zum Drucker geschickt
werden. Das ist zumindest technisch bei einer Firewireverbindung
m&ouml;glich, wo &uuml;ber direkte Verbindung per Firewire der Drucker ein
Bild vom Datentr&auml;ger ausdrucken kann, ohne dass weitere Ger&auml;te
dazu n&ouml;tig w&auml;ren. In der Praxis steckt das allerdings noch in den
Kinderschuhen. Aber immerhin, - bei USB braucht man auf diese
M&ouml;glichkeiten gar nicht erst warten. </p>

                                           
<p>Eine immer gute Verbindung w&uuml;nscht Euch <br>
HIGGINS <br>
Cord Hagen  </p>

</td></tr></table>
<br>
</body>
</html>
