<html>
<head>
<title>"Drucker - Drucker - Drucker"</title>
</head>
<body background="cordbg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="5"><b>Die neuen EPSON C-Modelle....
<br> F&uuml;r jeden der richtige Drucker? </b></font></p>

<p>Wieder mal Zeit, sich auf dem Druckermarkt umzusehen, denn wieder werden
nicht nur bei den drei gr&ouml;&szlig;ten Druckerherstellern Canon, Hewlett Packard
und Epson kontinuierlich gerade alle Druckerflotten auf neue Modelle
umgestellt.

<p>Bei Epson besinnt man sich nun auf kleinere Bezeichnungen. Die neuen
Modelle werden nun mit einem C voran getauft und bekommen danach lediglich
zweistellige Ziffern und in Einzelf&auml;llen noch ein weiteres
K&uuml;rzel. Die Palette f&auml;ngt mit dem echten Lowcostkracher Epson C20
an, der im Handel f&uuml;r rund 70 bis 80 Euro gehandelt wird und reicht in
der neuen C-Modellreihe im Augenblick bis zum C80 f&uuml;r rund 260 Euro.
</p>

<p>Der Epson C20 (C20UX) <br>
<img src="hard_epson_c20.jpg" align=left width=250 heigth=275 hspace=6
alt="C20">

Zwar ist der C20 wirklich f&uuml;r Epson-Verh&auml;ltnisse enorm
g&uuml;nstig, f&auml;llt aber schon gleich nach dem Auspacken durch eher
unsolide Verarbeitung und dem einzigen Anschluss per USB auf. Er bietet
f&uuml;r seine Aktualit&auml;t verh&auml;ltnism&auml;&szlig;ig geringe
Druckaufl&ouml;sung mit 720 dpi - nicht mehr ganz zeitgem&auml;&szlig;,
aber in dieser Preisklasse wohl noch vertretbar. Eine lausige
Druckgeschwindigkeit von nicht mal 4 Seiten in der Minute (genau sollten es
laut Hersteller 6,5 Seiten SW und 3,5 Seiten Farbe sein, was aber i.d.R.
gern bei Herstellerangaben &uuml;bertrieben kalkuliert wird) lassen
wirklich nur noch den g&uuml;nstigen Einstiegspreis attraktiv erscheinen.
Das Druckbild ist brauchbar, &uuml;berzeugt aber nicht wirklich. </p> <br
clear=all>

<p>Der Epson C40 (C40UX) <br>
<img src="hard_epson_c40.jpg" align=left width=212 heigth=201 hspace=6
alt="C40">

....endt&auml;uscht mich pers&ouml;nlich deutlich. Eigentlich sollte er von
seiner Preisklasse her (um die 90 Euro) seinen Vorg&auml;nger, den Epson
Stylus Color 580 vertreten. Beide Druckermodelle hatte ich nun einige Male
hier. Der neue Epson ist um ein Vielfaches lauter. Setzt sich der Schlitten
mit dem Druckk&ouml;pfen erst einmal in Bewegung, erinnert man sich an alte
Zeiten zur&uuml;ck - an die Anfangsphasen der ersten Tintenstrahldrucker.
Nicht zuletzt die eher klapprige Verarbeitung hat ihren Anteil an dieser
Ger&auml;uschkulisse, die bei heutigen Druckermodellen renomierter
Hersteller einfach nicht mehr vorkommen darf. Der C40 arbeitet zwar
immerhin mit 1440 dpi, was aber leider auch kein Fortschritt gegen&uuml;ber
den Vorg&auml;ngermodellen brachte. Der Ausdruck ist wie schon beim 580
nicht unbedingt der Beste, aber durchaus &uuml;blich in dieser Preisklasse.
Was hingegen unangenehm auffiel, ist der lahmende Ausdruck des C40. Zwar
berichtet Epson &uuml;ber "unglaubliche 8 Seiten" in der Minute, aber eben
das ist auch meine Meinung hierzu -"unglaublich"! Auch die Preisempfehlung
von Epson mit 79 Euro wird von den wenigsten H&auml;ndlern eingehalten.
Grund ist nicht zuletzt die unbedeutende Gewinnspanne, die der
Druckerhersteller seinen H&auml;ndlern zurechnet. Fairerhalber sollte man
aber noch sagen, dass kein anderer Hersteller einen wirklich besseren
Drucker f&uuml;r dieses Geld abliefert! Im Preisbereich unter 100 Euro sind
eben keine Gef&uuml;hlsausbr&uuml;che zu erwarten. </p> <br clear=all>

<p>Der Epson C60 <br>
<img src="hard_epson_c60.jpg" align=left width=220 heigth=221 hspace=6
alt="C60">

Mit dem C60 kommen wir nun endlich zu "echten" Druckern, die man nicht nur
gebrauchen kann, sondern auch Modellen, die zus&auml;tzlich auch noch eine
parallele Schnittstelle haben und dadurch wesentlich einfacher dem
Amigaanwender nutzbar gemacht werden k&ouml;nnen, auch wenn Epson bis heute
hin den Amiga offiziell nicht mehr kennt. Endlich kommen hier auch die 2880
dpi Druckaufl&ouml;sung ins Spiel, die sehr gute Farbausdrucke
erm&ouml;glichen. Auf Spezialpapieren sind damit die Epson-gesch&auml;tzte
Fotoqualit&auml;ten m&ouml;glich. Der Drucker spuckt bis zu 12 Seiten in
das Ablagefach und die Farbe ist Epsonlike nahezu sofort trocken. Neben dem
erw&auml;hnten Parallelanschluss findet man auch noch den modernen
USB-Anschluss, der wohl &uuml;ber fr&uuml;h oder sp&auml;t den
herk&ouml;mmlichen Port in neuen Modellreihen ganz abl&ouml;sen wird.
J&uuml;ngst verkauft Epson dieses Druckermodell mit einem Softwarebundle,
welches ein PC-Spiel beinhaltet. Der Preis des C60 liegt zwischen 125 und
135 Euro. Wer die Mehrausgaben gegen&uuml;ber dem C20-.- und C40-Modell
nicht scheut, bekommt hierf&uuml;r einen gut brauchbaren Alltagsdrucker,
der schnellen Textdruck und sehr guten Fotodruck abliefert. </p> <br
clear=all>

<p>Der Epson C70 <br>
<img src="hard_epson_c70.jpg" align=left width=235 heigth=179 hspace=6
alt="C70">

Jetzt gehts bei Epson in die Mittelklasse. Der C70 ist schneller im Druck
und bringt noch dazu bessere Farbausdrucke, als beispielsweise der C60.
Getrennte Tinten sorgen f&uuml;r detailiertere Farbfotoausdrucke und
schonen den Geldbeutel. Das etwas wuchtigere Geh&auml;use ist im Gegensatz
zu der Einsteigerschiene erheblich besser verarbeitet. 2880 dpi sorgen auch
hier f&uuml;r tadellosen Fotodruck auf Spezialpapieren. Schmier- und
wasserfeste Superfarben bieten die perfekte Einstiegsbasis f&uuml;r
Digitalfotohobbyisten. Gestochen scharfer Text wird auf nicht ganz 16
Seiten in der Minute ausgegeben. Aber schon auf Normalpapieren zeigt dieser
Epson, was er zu bieten hat. </p> <br clear=all>

<p>Der Epson C80 <br>
<img src="hard_epson_c80.jpg" align=left width=260 heigth=230 hspace=6
alt="C80">

Wem alles zu langsam ist, sollte den Turbo einschalten. Epson bringt
hierf&uuml;r den Hochgeschwindigkeitsdrucker C80 auf den Markt, mit dem
rund 20 Seiten in der Minuten erm&ouml;glicht werden sollen. Diverse Tests
zeigten, dass in der Praxis immerhin rund 16 Seiten gedruckt werden, was im
Tintenstrahlbereich immer noch ein Affenzahn ist. Auch in diesem Modell
finden vier separate Tintentanks Verwendung, was gut f&uuml;r den Druck ist
und gut f&uuml;rs Taschengeld. Laserdruckartige Textsch&auml;rfe und
brilliante Farben in Fotoqualit&auml;t bei 2880 dpi machen diesen Drucker
zu einer hervorragenden Wahl. Bis zum Druckbeginn braucht der Drucker
allerdings etwas, bis er sich zurecht gemacht hat. Schnell kann da rund
eine halbe Minute verstreichen. Auf billigstem Normalpapier schafft der C80
dank verbesserter Farben satte und brillante Ausdrucke. Die Druckkosten pro
Seite sind leider Epsontypisch relativ hoch, aber wer auf superschnelle
Ausdrucke, oder aber perfekte Fotorealistische Ausdrucke angewiesen ist,
wird sich diesen Drucker auf seinen Merkzettel schreiben m&uuml;ssen. Der
Preis von um die 260,- Euro ist f&uuml;r diese Leistung immer noch ein
absolut faires Angebot. </p> <br clear=all>

<p>Mein Tipp <br>

Wer wirklich auf das Billigste Schn&auml;ppchen aus ist, ohne wirklich Wert
auf Druckkosten und Druckeigenschaften zu legen, sollte sich die unteren
Einstiegsmodell C20 und C40 vor dem Kauf beim Fachhandel einmal kurz zeigen
lassen. Mit dem C60 bekommt man eigentlich den ersten brauchbaren Drucker
von Epson. Erst bei diesem Modell kommt die f&uuml;r Amiganer nicht
unwichtige Parallel-Schnittstelle zum USB-Anschluss hinzu. F&uuml;r den
Fotohobbyisten kommen die Modelle C70 und C80 in Frage. Schon der C70
bringt hervorragende Druckqualit&auml;t mit, w&auml;hrend der C80 alle
Eigenschaften noch einmal leicht toppen kann und zudem einer der
schnellsten Tintenstrahldrucker zur Zeit ist. Der Rest d&uuml;rfte wohl
eher eine finanzielle Rolle spielen. </p>

<p>Immer den besten Druck w&uuml;nscht Euch <br>
HIGGINS <br>
Cord Hagen  </p>

</td></tr></table>
<br>
</body>
</html>
