<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Charly an alle</title>
<meta name="author"         content="Karl-Heinz Bader">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

</head>

<body background="../bg2.jpg" text="#000000" link="#0000ff" vlink="#ff0000" alink="#ff9900">
<a name="top"></a>

<table width="50%" align="center" border="0" cellspacing="0" cellpadding="0" summary="Text">
<tr>
<td height="25" colspan="4"><br>
<h2 align="center">Charly&acute;s Leserbrief</h2>
<h3 align="center">an</h3>
</td>
</tr>

<tr>
<td height="100">
<div align="center"><img src="charly.jpg" width="67" height="75" border="1" alt="meiner einer"></div>
</td>

<td height="100" width="793"> <br>
<div align="center">
<p>
&#149; <a href="#a1">Kilian</a> &#149;
<br>
&#149; <a href="#a2">Wolf</a> &#149;
<br>
&#149; <a href="#a3">Higgins</a> &#149;
<br>
&#149; <a href="#a4">Machine</a> &#149;
<br>
&#149; <a href="#a5">Poldi</a> &#149;
<br>
&#149; <a href="#a6">Top Five</a> &#149;
<br>

&#149; <a href="#a8">Impressum</a>&#149;
</p>
</div>
</td>
</table>
<br><br><br>
<table width="95%" bgcolor="#ffffff" align="center" border="1" cellspacing="4" cellpadding="40" summary="Text">
<tr><td>
<h1>Hallo alle zusammen,</h1><br>
<p>nach der Lektüre der NoCover 95 ein paar Zeilen von mir. Insgesamt gesehen war
es meiner Meinung nach gut gelungen.
</p>
<H3><i> Charly </i></H3>

</td>
</table>
<br><br><br><a name="a1"></a>
<table width="95%" bgcolor="#dddfff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<h3>Hallo Kilian,</h3>
<p>
du antwortest mir folgendes...</p>

<font color="maroon">
<b>Hi Charlie</B>
</font><br><br>
upps... so oft richtig im Menu geschrieben, aber bitte <b>Charly</b> :)
soviel Zeit muss sein. Ist ja sogar ein Anschlag weniger auf der Tastatur. :)
<p>
<font color="maroon">
Frames sind eigentlich ein passendes Gestaltungsmittel und werden der
&#220;bersicht halber auch weiterhin in der NC verwendet werden. Ich sehe auf
jeden Fall keine andere adquate M&#246;glichkeit. So wie die Mitgliederliste
m&#246;chte ich die NC eigentlich nicht aufbauen, denn das w&#252;rde
die &#220;bersicht doch sehr vermindern.
</font></p>
war ja mal so ein Gedanke... Ich pers&ouml;nlich richte meine Texte nach dem
Frame-Modus aus. Manch andere nicht.

<p><font color="maroon">
Was die Fehler angeht: Das sind in dem Sinne keine Fehler, sondern einfach nur Dinge,
die man einf&#252;gen kann, aber nicht muss. Solange die NC auf diversen Browsern
immer ideal aussieht - ich pr&#252;fe die Kompatibilit&#228;t bei den drei Amiga
Browsern sowie dem Internet Explorer - ist f&#252;r mich eigentlich alles okay.
Und die Zeit, jeden Fehler auszub&#252;geln, habe ich leider nicht.
Trotzdem vielen Dank f&#252;r Deine Anregungen und ich werde versuchen,
davon etwas umzusetzen.
</font></P>
<p>
definitiv ist in jedem <b>Head</b> ein Fehler.<br>

&lt;AUTHOR: Kilian Servais on Amiga Computer&gt;<br>

sollte wenigstens als Kommentar stehen. Ein paar Zeichen dazu...<br>

&lt;!-- AUTHOR: Kilian Servais on Amiga Computer --&gt;<br><br>

und der Fehler ist weg... das restliche sind nur Warnungen.<br>
</p>
<p>
Weiter finde ich es nicht richtig, dass im index.html drei Tabellen
ge&ouml;ffnet werden und nur zwei wieder geschlossen werden. Und in
der index.html im Verzeichnis <b>nc</b> ist &lt;/frameset&gt; doppelt.
Diese beiden Dateien schicke ich Dir mal (fehlerbereinigt durch <b>Tidy</b>) mit.</p>
<p>
<font color="maroon">
Toll finde ich auch, dass Du wieder f&#252;r die NC schreibst.
</font></p>

kann passieren, dass Du mich auch nicht so schnell wieder los wirst. :))<br><br>
Was anderes fiel mir auf. Die Benennung der Artikel im Menu. Ich bin davon
ausgegangen, dass Du die &lt;title&gt; aus den Dokumenten nimmst, aber ich musste
feststellen, es wird mal so und wohl nach Gutdünken verfahren. Meinen zweiten
Leserbrief habe ich Dir zugedacht und es stand auch im &lt;title&gt;!<br>
<b>Charly an alle</b>, das war dann nicht so treffend. ;(( <br>
Natürlich kann die Überschrift vom Title abweichen, aber ich m&ouml;chte es eigentlich
so haben, dass als Name die Beschreibung im Title genommen wird.<br><br>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>
<p>
&nbsp;&nbsp;&nbsp;&nbsp; &#149; <a href="#top">zum Anfang</a> &#149;
</p>
<br><br><br>
<a name="a2"></a>
<table width="95%" bgcolor="#ddffff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<h3>Hallo Wolf,</h3>
<p>
war mal wieder interessant, was Du so im Internet aufst&ouml;berst. Und diesmal war ja
auch wieder ein Wolf-Info dabei. Die <b>Namensgeschichte des Geldes</b> war sehr interessant
und hat mir sehr gefallen. Und aus einem, kleinen Kalenderblatt hast Du ja auch eine
Menge heraus gelesen. Das ist schon sehr beeindruckend.
</p>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>
<p>
&nbsp;&nbsp;&nbsp;&nbsp; &#149; <a href="#top">zum Anfang</a> &#149;
</p>
<br><br><br>
<a name="a3"></a>
<table width="95%" bgcolor="#ddeeff" align="center" border="1" cellspacing="4" cellpadding="48" summary="Text" >
<tr><td>
<h3>Hallo Higgins,</h3>
<p>
ist doch immer wieder sch&ouml;n, was von Dir zum Thema Humor zu lesen.
Da war einiges dabei, worüber man herzhaft lachen konnte. Sch&ouml;ne Gr&uuml;&szlig;e auch von
meiner Frau. Sie fand ihren Arbeitsplatz gut beschrieben. :)<br>

Weiter so...
</p>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>
<p>
&nbsp;&nbsp;&nbsp;&nbsp; &#149; <a href="#top">zum Anfang</a> &#149;
</p>
<br><br><br>
<a name="a4"></a>
<table width="95%" bgcolor="#ddffff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<h3>Hallo Machine,</h3>
<p>
es ist nat&uuml;rlich gut und richtig, wenn man seine eigene Meinung vertritt. Das sollte
von allen akzeptiert werden. Wie ich bisher gelesen habe, machst Du auch eine Menge
f&uuml;r das Mag. Weiter so...
</p>
<p>
Und nun Kritik! In der NC95 verwendest Du f&uuml;r Deine Beitr&auml;ge (Metal Lyrics) den Tag &lt;h3&gt; f&uuml;r
Textbereiche und das ganze wird mit &lt;pre&gt; eingebunden. &quot;h1...h6&quot; ist f&uuml;r &uuml;berschriften
vorgesehen. Und &lt;pre&gt; f&uuml;r vorformatierten Text, wobei dann das &lt;p&gt; da
&uuml;berhaupt nix zu suchen hat, da der Text wie im Editor geschrieben wiedergegeben wird.
IMHO w&auml;ren normale Fonts und dann eben immer ein &lt;br&gt; besser.

&lt;body&gt; erscheint zweimal. ;((
</p>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>
<p>
&nbsp;&nbsp;&nbsp;&nbsp; &#149; <a href="#top">zum Anfang</a> &#149;
</p>
<br><br><br>
<a name="a5"></a>
<table width="95%" bgcolor="#ddeeff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<h3>Hallo Poldi,</h3>
<p>
herzlich Willkommen im Mag. :)<br>
&acute;Betreff Hilfe - die anderen werden es schon richten&acute;
ganz so schlimm, wie Du schreibst, ist es wohl noch nicht gekommen.
Aber wenn man keine Antwort weiss, dann kann man auch keine schreiben.
Das <b>StarMAG</b> kenne ich nur von den Zeiten des 'Chrism&auml;n' und
der hatte es auch schon von jemanden &uuml;bernommen. Ja, mit Hilfe war da
nicht viel. Aber nicht aus Faulheit, sondern eher wegen Unkenntnis.<br>
Wenn man eine &acute;InterNet-Anbindung&acute; hat, dann bekommt man bestimmt
&uuml;ber das UseNET oder InterNET fast jede Antwort, die man braucht. Das geht
dann fix und nicht im monatlichen Turn wie bei einem Mag.<br>
Da Du ja offensichtlich nur &uuml;ber ein USB-Modem verf&uuml;gst, welches wegen fehlenden
USB-Port beim Amiga nicht funktioniert, habe ich mal im UseNET nachgefragt.
Schau mal in die Rubrik <b>HelpLine</b>.
</p>
<p>Amiga-Hefte habe ich eigentlich zuhauf. :) AmigaSpecial, AmigaMagazin und
AmigaPlus seit ca. 1994 jede Ausgabe und noch einen Haufen davor. Gegen
Selbstabholung gebe ich die so bis Jahr 2000 gerne an einen Liebhaber ab.</p>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>
<p>
&nbsp;&nbsp;&nbsp;&nbsp; &#149; <a href="#top">zum Anfang</a> &#149;
</p>
<br><br><br>
<a name="a6"></a>
<table width="40%" bgcolor="#dddfff" align="center" border="1" cellspacing="4" cellpadding="8" summary="Text" >
<tr><td>
<h3 align="center">Top Five</h3>
<p>
hier ist meine <b><u>pers&ouml;nliche</u></b> Hitparade der Artikel aus der NC95,
die mir am meisten gefallen haben.
</p>

<ul>
<li>SpassSeite von Higgins</li>
<li>Mediator von Poldi</li>
<li>Wolf-Info von Wolf</li>
<li>Thalion von Spezi</li>
<li>Randa von Thomas</li>
</ul>

<br>

Alles Gute...
<H3><i> Charly </i></H3>
</td></tr>
</table>

<table width="95%" align="center" summary="Text">
<tr><td>
&#149; <a href="#top">zum Anfang</a>
&#149;
</tr>
<tr><td>
</tr></table>
<a name="a8"></a>
<table align="center" bgcolor="#ddeeff" border="6" width=95% cellspacing=0 cellpadding="1" summary="Autor">
<tr><td align="center">Autor:<a href="mitglieder/bader.html">Charly Bader</a>&nbsp;
Mail:<a href="mailto:charly-ham@t-online.de">charly-ham@t-online.de</a>&nbsp;
Web:<a href="http://charly-ham.bei.t-online.de/">http://charly-ham.bei.t-online.de/</a></td>
</tr>
</table>
<br>
</body>
</html>
