<html>
<head>
<title>Interview5</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Nogfx</b></td></tr>
<tr><td valign=top>Software: </td>
<td> FlashNG, ScummVM Amiga68k port</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://nogfx.free.fr/flash (FlashNG Support page)<br>
http://www.sebelinteractive.de/scummvm/ (ScummVM Amiga)</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> nogfx@free.fr </td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Mein Name ist Nicolas Ramz (Nogfx). <br>

Ich bin 21 Jahre alt, und ich studiere Mathematik/Informatik in
ClermondFerrand (die Mitte von FRANKREICH). </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich kaufte einen A500 zuerst 1989: Das war mein allererster Computer, und
ich habe ihn nur zum Spielen benutzt. Kurz nach dem Fall von Commodore
glaubte ich wirklich an ein Comeback des Amiga, also kaufte ich einen A1200
und fing an, in BlitzBasic zu programmieren. </p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
A1200/030 und A2000B. </p>
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
AmigaOS 3.1 (A1200) und AmigaOS 1.3 (A2000). </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Momentan arbeite ich haupts&auml;chlich an einer Amiga 68k
ScummVM-Portierung. </p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>
 
ScummVM ist ein Open-Source-Interpreter f&uuml;r die sogenannten
Scumm-Skripten, die in alten LucasArts-SPielen verwendet wurden: Mit diesem
Programm kann man gro&szlig;artige Spiele wie Day of the Tentacle endlich
auf dem Amiga spielen. </p>
  
<p>PlashNG ist ein kleiner portabler Arkanoid-Klon (momentan
erh&auml;ltlich f&uuml;r Amiga, MS-DOS und Win9x). </p>
  
<p><b>Was brachte Dich auf die Idee, Deine Software (weiter) zu
entwickeln?</b><br>
 
Tja, ich wollte schon immer Spiele entwickeln... besonders
Abenteuer-Spiele. Nachdem ich die Windows-Portierung von FlashNG fertig
hatte, h&ouml;rte ich von ScummVM, aber ungl&uuml;cklicherweise wollte
niemend eine AGA-Portierung davon machen: Dachten, das w&uuml;rde zu
langsam sein. Ich war &uuml;berzeugt, AGA w&auml;re nicht so langsam in
320x200, also begann ich mit der Portierung... </p>
  
<p><b>Wie lange hat die Entwicklung bislang gedauert?</b><br>
 
Mein erstes Programm ist ein kleines Dienstprogramm f&uuml;r Aminet-CDs
namens "DreamCDGuide". Die erste Version (in BlitzBasic geschrieben) wurde
1997 ver&ouml;ffentlicht. Ein oder zwei Jahre sp&auml;ter
ver&ouml;ffentlichte ich eine neue Version, die ich in C/MUI neu
geschrieben hatte. </p>
  
<p>Ich habe auch ein paar &Auml;nderungen zum StrICQ beigetragen, aber das
erste "richtige" Projekt, an dem ich gearbeitet habe, ist FlashNG. </p>
  
<p>Die urspr&uuml;ngliche TurboPascal MS-DOS-Version von FlashNG wurde vor
2 Jahren geschrieben. F&uuml;r die Amiga/FreePascal-Portierung brauchte ich
nur ein paar Tage. Danach hat es mich viel Zeit gekostet, es nach C
umzuschreiben (eigentlich lernte ich C zur selben Zeit, zu der ich FlashNG
von Pascal nach C portierte). </p>
  
<p>Dank der Arbeit, die ich bereits in FlashNG gemacht hatte, war ich in der
Lage, ScummVM in einem Tag unter AGA zum laufen zu kriegen, und ich
brauchte etwa 2 Wochen um es richtig benutzbar zu machen. Aber wenn ich die
Zeit dazu addiere, die ich f&uuml;r das Herunterladen und Konfigurieren von
GCC gebraucht habe, ist es VIEL MEHR als das! </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
GCC (AmigaOS) und LCC (Win32). </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>
 
F&uuml;r AmigaOS 3.1. </p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?</b><br>
 
Ich wei&szlig; nicht: Ich werde entscheiden, welches Betriebssystem ich
unterst&uuml;tze, wenn sie ver&ouml;ffentlicht werden. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
ScummVM: Das h&auml;ngt von der Zeit ab, die mir f&uuml;r die Arbeit daran
zur Verf&uuml;gung steht... Soundunterst&uuml;tzung in der Amiga-Version
von FlashNG. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>
  
Der Amiga/das AmigaOS sind wirklich "sauber" und kompakt konstruiert: Ich
arbeite immer noch damit, weil ich es mag, und weil ich leicht eine Menge
Sachen lerne (anders als wenn ich auf Betriebssystemen wie Win oder Linux
arbeite). <br>

Wenn ich Resonanz wollte, w&uuml;rde ich nicht mehr f&uuml;r den Amiga
programmieren.
  
<p><b>Bekommst Du gen&uuml;gend Resonanz f&uuml;r Deine Software?</b><br>
 
Wenn man die Zeit in Betrachtzieht, die ich mit der Arbeit daran verbracht
habe, bekomme ich nicht genug Resonanz. Aber wenn man den Amiga-"Markt"
ber&uuml;cksichtigt, denke ich es ist nicht so schlimm: Ich war von der
Resonanz beeindruckt, die ich f&uuml;r ScummVM_AGA erhalten habe. </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Ich verwende ihn, um dieses Interview zu beantworten. </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>
 
Die letzte Software, die ich gekauft habe, ist ein Spiel: Shadow of the
Third Moon. </p>
  
<p><b>Welche Software verwendest Du noch?</b><br>
 
DOpus, C-Compiler und IBrowse. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Nichts. Ich warte auf etwas anderes als diese PCs/Macs, nicht etwas
<b>&uuml;berlegenes</b> im Vergleich mit allem anderen: Ich wai&szlig;,
da&szlig; das nicht m&ouml;glich ist, aber wenigstens etwas <b>anderes</b>.
Wenn nichts ver&ouml;fentlicht wird, werde ich eines Tages auf PC/Mac
umstellen m&uuml;ssen... </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Bitte nicht schimpfen... Ich denke, es ist wirklich zu sp&auml;t: Das
AmigaOS ist ein gro&szlig;artiges Betriebssystem, aber es mangelt an vielen
Dingen wie Speicherschutz, Ressourcen-Tracking (was ein totales
Neuschreiben des Kernel bedeutet) und "Multimedia"-Anwendungen. </p>

<p>=&gt; Es wird viel Zeit brauchen, diese Funktionalit&auml;ten zum
eigentlichen AmigaOS hinzuzuf&uuml;gen (und ich spreche nicht von
Treiberproblemen...). </p>
  
<p>MorphOS scheint diesem Ziel am n&auml;chsten zu sein, aber ich denke
nicht, da&szlig; sie die Mittel haben (in Sachen Geld und f&auml;hige
Leute), um das Amiga-Comeback zu schaffen. </p>
  
<p>Zum AmigaDE, ich wei&szlig; nicht, auf welchen Markt sie mit ihren
kleinen Spielen in PD-Qualit&auml;t abzielen. In zwei Jahren haben sie nur
ein modifiziertes Tao/ Elate-Kernel ver&ouml;ffentlicht: Sie m&uuml;ssen
viel mehr tun, um das Amiga-Comeback zu schaffen. </p>
  
<p><b>Deine letzten Worte an die Leser?</b><br>
 
Unterst&uuml;tzt weiter die Amiga-Entwickler, und nehmt einen Compiler und
schreibt Amiga-Anwendungen anstatt Zeit damit zu verschwenden, "Windows ist
sch..." zu sagen... </p>
  
<p>Gr&uuml;&szlig;e, <br>

Nogfx. </p>

<p> © Amiga Arena 2/2002 <br>
(aus dem Englischen von Christian Busse) </p>

</td></tr></table>
<br>
</body>
</html>



