<html>
<head>
<title>Interview6</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Richard Smedley</b></td></tr>
<tr><td valign=top>Software: </td>
<td> UltraAccounts</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.richardsmedley.co.uk/</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> amiga@richardsmedley.co.uk</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
  
Mein Name ist Richerd Smedley, und ich bin ein 28 Jahr alter
Softwareentwickler aus Notts (England). </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich kaufte meinen ersten Amiga 1992, war also ein bi&szlig;chen ein
Sp&auml;teinsteiger in die Amiga-Szene. </p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
A1200 mit 50 MHz 68030/68882 und 10 MB RAM. Ein bi&szlig;chen arm nach
heutigen Ma&szlig;st&auml;ben, aber er ist mehr als ausreichend f&uuml;r
meine Bed&uuml;rfnisse. </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
OS 3.0. </p>
  
<p><b>Welche Software entwickelst Du?</b><br>

UltraAccounts </p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>
 
UltraAccounts ist ein Heim-Kontof&uuml;hrungsprogramm f&uuml;r den Amiga,
basierend auf der Philisophie, so flexibel und einfach zu benutzen zu sein
wie m&ouml;glich. Es hat all die Merkmale die man braucht und keine, die
man nicht braucht, und verwendet eine grafische Benutzerschnittstelle
(GUI), die so einfach zu erlernen ist, da&szlig; sogar Leute ohne jede
Computererfahrung es benutzen k&ouml;nnen. Die meisten der Fenster im
Programm sind vollst&auml;ndig multi-taskend, was einem erlaubt, mehrere
verschiedene Fenster gleichzeitig zu &ouml;ffnen und zu verwenden. </p>
  
<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln?</b><br>
 
Zu der Zeit, als ich zuerst begann, UltraAccounts zu schreiben, waren die
meisten Kontof&uuml;hrungsprogramme sehr schwer zu bedienen und
beinhalteten oft was ich als unn&ouml;tige Einschr&auml;nkungen ansah, wie
nur ein Bargeld-Konto zu gestatten, oder nur in der Lage zu sein,
Dauerauftr&auml;ge einzurichten aber keine Dauer-Lastschriften.
UltraAccounts war eins der ersten Programme, das diese Beschr&auml;nkungen
aufhob. Gleichzeitig war UltaAccounts f&uuml;r einfache Bedienung entworfen
worden, so da&szlig; selbst jemand, der niemals zuvor einen Computer
bedient hat, sich hinsetzen und es benutzen kann. Ich denke, da&szlig; ich
diese Ziele gr&ouml;&szlig;tenteils erreicht habe! </p>
  
<p><b>Wie lang hat die Entwicklung bisher gedauert?</b><br>
 
Ich habe 1993 begonnen, UltraAccounts zu schreiben, und die erste
&ouml;ffentliche Version kam 1994. Es ist schwer zu glauben, da&szlig; ich
jetzt <b>neun Jahre</b> mit der Arbeit an diesem Programm verbracht habe!
Erstaunlich, wie die Zeit verfliegt. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
Blitz Basic 2.1, mit Triton f&uuml;r die GUI. </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>
 
Ich entwickle f&uuml;r die traditionellen AmigaOS-basierten Systeme.
UltraAccounts sollte auf jedem Amiga mit Kickstart 2.0 oder besser laufen,
sofern man eine Festplatte und mindestens 3 MB Speicher hat. </p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig
unterst&uuml;tzen?</b><br>
 
Ich habe nicht vor, das Programm f&uuml;r die Amiga-Systeme der
"n&auml;chsten Generation" umzuschreiben, haupts&auml;chlich, weil ich
nicht gen&uuml;gend freie Zeit daf&uuml;r habe! Aber ich bin
zuversichtlich, da&szlig; es unter Emulation auf den neuen Systemen laufen
sollte. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Ich habe k&uuml;rzlich "UaCurrency" ver&ouml;ffentlicht, ein neues Werkzeug
um Deine Daten von einer W&auml;hrung zu einer anderen zu konvertieren. Wie
Du wei&szlig;t, haben am 1. Januar 2002 einige europ&auml;ische L&auml;nder
ihre nationale W&auml;hrung aufgegeben und haben auf die neue
Euro-W&auml;hrung gewechselt. Dieses Werkzeug automatisiert den Vorgang,
Deine Dateien von der alten zur neuen W&auml;hrung umzustellen. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b><br>
  
Absolut. Resonanz ist f&uuml;r Entwickler sehr wichtig. Es gibt dir eine
Vorstellung, wieviele Leute das Programm noch verwenden, und was sie daran
m&ouml;gen oder auch nicht. Wenn ein Autor wenig oder gar keine Resonanz
erh&auml;lt, kann das den Eindruck erwecken, da&szlig; niemend mehr
interessiert ist, das Programm zu verwenden - und wenn der Autor denkt,
da&szlig; niemand ein Programm verwendet, dann gibt es keinen Anreiz
daf&uuml;r, es weiter zu unterst&uuml;tzen. </p>
  
<p>Also Leute, wenn Ihr ein Programm verwendet, schickt eine R&uuml;ckmeldung
an den Autor, selbst wenn es nur ist um zu sagen, da&szlig; Ihr es noch
benutzt. Nat&uuml;rlich ist es noch besser wenn Ihr dem Autor sagt, was Ihr
an dem Programm m&ouml;gt oder nicht m&ouml;gt. </p>
  
<p><b>Erh&auml;ltst Du gen&uuml;gend Resonanz auf Deine Software?</b><br>
 
Nein. Heutzutage senden sehr wenig Leute R&uuml;ckmeldungen &uuml;ber meine
Programme. </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Gestern. Ich mache jetzt eine Menge Sachen auf meinem PC, aber ich verwende
meinen Amiga noch fast jeden Tag. </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
gekauft?</b><br>
 
Paul Burkeys Foundation. Ich war eine der Personen in dem Spiel! </p>
  
<p><b>Welche Software verwendest Du noch?</b><br>
 
So klischeehaft das auch klingen mag, ich verwendet UltraAccounts
t&auml;glich. Meine Homepage wird auch auf dem Amiga entworfen. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Mein Amiga hat bereits alles was ich brauche, darum habe ich im Moment
nicht vor, noch mehr Software/Hardware zu kaufen. </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Es w&auml;re nett, den Amiga ein Comeback machen zu sehen, aber ich
wei&szlig; nicht, ob da&szlig; tats&auml;chlich passieren wird. Der Markt
hat sich sehr ge&auml;ndert, seit Commodore bankrott ging, und ich bin
nicht sicher, ob es einen Nischenmarkt gibt, der gro&szlig; genug ist,
da&szlig; ein neues Amiga-Modell ein kommerzieller Erfolg werden kann. </p>
  
<p><b>Deine letzten Worte an die Leser?</b><br>
 
Bitte verwendet keine &quot;Warez&quot; oder raubkopierte Software. Die
t&ouml;ten den Markt und zerst&ouml;ren das bi&szlig;chen Einkommen, das
Amiga-Entwickler noch bekommen. Wenn ein Programm wert ist, verwendet zu
werden, dann kauft es und helft dem Autor, es weiter zu unterst&uuml;tzen.
</p>

<p> © Amiga Arena 2/2002 <br>
(aus dem Englischen von Christian Busse) </p>

</td></tr></table>
<br>
</body>
</html>



