<html>
<head>
<title>Interview4</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Nicholas Blachford</b></td></tr>
<tr><td valign=top>Software: </td>
<td> Aural illusion, Aural Synthetica</td></tr>
<tr><td valign=top> Homepage: </td>
<td> Software:  www.blachford.info/blachtech<br>
Personal:  www.blachford.info</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> nicholas@blachford.info
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
 
Mein Name ist Nicholas Blachford, ich bin ein 31 Jahre alter
Software-Ingenieur/Architekt. Ich wuch in Nordirland auf, habe aber die
letzten 2 Jahre in Holland (Amsterdam) gelebt. Ich bekam meinen ersten
Amiga 1987 und habe von 1993-1998 Amiga Audio-Software entwickelt. Ich bin
sp&auml;ter zu BeOS gewechselt, wo ich weiter Audiosoftware entwickelt habe
und habe seitdem an Business-Software gearbeitet. </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich glaube 1987. Urspr&uuml;nglich war ich dabei, einem Freund einen C128
abzukaufen, als ich merkte, da&szlig; ich einen Atari ST f&uuml;r den
selben Preis und mit viel besseren Leistungsdaten bekommen konnte. Ich
hatte auch eine Anzeige f&uuml;r einen Amiga gesehen, und diese auch in
Erw&auml;gung gezogen. Ich dachte eine Weile dar&uuml;ber nach, und dann
sah ich einen Amiga, auf dem eine der NewTek-Demos lief, die Bilder im
HAM-Modus hatte, und das haute mich einfach um - also holte ich mir den
Amiga! </p>

<p>Es war ein franz&ouml;sischer A1000, der mit Aufklebern auf der Tastatur
modifiziert worden war! Trotzdem ein ausgezeichneter Computer, die
M&ouml;glichkeit, die Tastatur unter die Front zu schieben war ein
Geniestreich. Er kam mit Workbench 1.1 und 1.2 sowie "Kickstart"-Disketten,
da das Betriebssystem nicht in ROM war, wie bei sp&auml;teren Amigas. Ich
r&uuml;stete ihn mit einer A520 Festplatte/Speichererweiterung auf, die an
der falschen Seite angebracht wurde - r&uuml;ckw&auml;rts! Aber durch den
zus&auml;tzlichen Speicher war ich in der Lage, eine "entlaufene" Kopie von
Workbench 2.0 vor allen meinen Freunden laufen zu lassen! </p>
  
<p>Ungef&auml;hr 1991/92 habe ich mich auf einen A500+ verbessert, der ein
paar bessere Videomodi und AmigaDOS 2.0 hatte. Es war etwa zu dieser Zeit,
da&szlig; ich beschlo&szlig;, Software zu schreiben. Ich war gerade bei
einem Studiengang an der Universit&auml;t durchgefallen, also entschied
ich, da&szlig; mich Computer mehr interessieren und ich sie studieren
wollte, so beschlo&szlig; ich, ein Programm zu schreiben, das ich dann
verkaufen und das f&uuml;r den Studiengang h&auml;tte bezahlen k&ouml;nnen
- was es nie tat. </p>
  
<p>Ich hatte die Maschine noch nicht lange, als ich auf einen A1200
aufr&uuml;stete. Ich erhielt ein Stipendium f&uuml;r die Anschaffung von
SAS/C und einer Festplatte (300 Euro f&uuml;r 60 MB!). Ich begann anfang
1993, Aural illusion zu schreiben. Ich erwartete fest, da&szlig; bald ein
Amiga mit 16bit Sound erscheinen w&uuml;rde, also wurde es geschrieben, um
mit 16bit-Dateien umzugehen und 32bit-Verarbeitung zu machen. </p>
  
<p>Urspr&uuml;nglich versuchte ich selbst, es zu verkaufen, aber das war
ein Desaster und kostete mich nur eine Menge Geld (obwohl es mit ein paar
gute Betatester brachte, die die Anzeigen gesehen hatten).
Schlie&szlig;lich begann eine Firma im S&uuml;den Englands namens Seasoft,
das Programm f&uuml;r mich zu verkaufen, aber es brachte mir immer noch
nicht wirklich Geld ein. </p>
  
<p>Ich machte eine erste, dann eine zweite Version, aber das Schreiben von
Audioeffekten wurde mir etwas langweilig, darum beschlo&szlig; ich, nachdem
ich einen Artikel &uuml;ber modulare Synthesizer gelesen hatte, einen von
diesen zu schreiben. Das tat ich 1995 und kam zu dem Entschlu&szlig;, ihn
komplex und m&auml;chtig zu machen, statt einfach und leicht zu bedienen.
Es zahlte sich aus, da es erstaunliche Sounds mahcne konnte. Es
ben&ouml;tigte etwa ein Jahr zu schreiben, mit einem Update ein paar Monate
sp&auml;ter. Ich r&uuml;stete den Amiga mit einem 50 MHz 68030 auf, weil es
so Prozessor-intensiv war. Es funktionierte nicht in Echtzeit wie
heutzutage, du w&uuml;rdest alle Verbindungen und Einstellungen vorbereiten
und dan einen Sound "rendern". Ungl&uuml;cklicherweise wurden nur 12
Exemplare verkauft! </p>
  
<p>Dann ging ich zu Aural illusion v3.0 &uuml;ber, das ein komplett neu
geschrieben war weil der Code in v1.0 und 2.0 so chaotisch war. Ich
arbeitete ein paar Jahre daran, aber bis dahin war der Amiga-Markt
gestorben und ich beschlo&szlig;, auf den PC zu wechseln. Direkt nach
diesem Entschlu&szlig; bekam ich eine Stelle in England und gab die
Entwicklung komplett auf. Ungl&uuml;cklicherweise wurde der Job, den ich
machen sollte, kurz nachdem ich begann, aufgegeben, darum behielt mich die
Firma nicht sehr lange. Also ging ich zur&uuml;ck zu Aural Illusion,
entschied jedoch da&szlig; die Amiga-Version so nah an der Vollendung war,
da&szlig; ich sie fertigstellen und dann nach Windows portieren w&uuml;rde.
</p>
  
<p>Dann wurde ich von jemandem von Be Europa angesprochen. Ich hatte etwas
von BeOS geh&ouml;rt aber nicht viel, aber er hatte Ai2 gesehen und
schickte mir ein Exemplar. F&uuml;r einen Amiga-User war Windows (und ist
es noch!) hundslangsam und fri&szlig;t riesige Ressourcen. Ich hatte einen
PC, der viel leistungsf&auml;higer als der Amiga wqar, aber der Amiga trat
ihm trotzdem in den Hintern! BeOS &auml;nderte all das, das war wof&uuml;r
PC-Hardware wirklich gedacht war. Ich denke, BeOS war der echte
Amiga-Nachfolger und ihr werdet eine Menge ex-Amiganer in der
(&uuml;briggebliebenen) BeOS-Community finden. Tats&auml;chlich hatte beim
ersten Mal, als ich zur "Begeistert" (BeOS-Treffen in Deutschland) ging,
jemand einen A3000 dabei! </p>
  
<p>Ich beschlo&szlig;, auf BeOS zu wechseln und Ai3 dort zu entwickeln. Es
war bald offensichtlich, da&szlig; ich viel &auml;ndern mu&szlig;te, da
BeOS dich zwingt, in C++ zu schreiben und ich dutzende neue Effekte
hinzuf&uuml;gte, also erh&ouml;hte ich die Versionsnummer auf 4.0.
Ungl&uuml;cklicherweise wurde es auch auf BeOS nie vollendet, ich bekam
eine Stelle in Holland und hatte seitdem keine Zeit, es fertigzustellen.
Wenn du einmal anf&auml;ngst Vollzeit f&uuml;r jemand anderes zu
entwickeln, ist das letzte was du zu Hause machen willst, wieder zu
programmieren anzufangen. </p>
  
<p>Ich habe allerdings alles f&uuml;r Amiga und BeOS in Open Source
gestellt. Ich habe k&uuml;rzlich die Lizenz auf BSD-Stil ge&auml;ndert und
den Quellcode und jetzt eine Bin&auml;rversion von Ai3 auf die Website
gepostet. </p>
  
<p><b>Welches Amiga-Modell besitzt Du?</b><br>
 
Habe immer noch den alten A1200 + 030. <br>
Ich habe auch ein Exemplar von Amiga Forever f&uuml;r Windows. </p>
  
<p><b>Welche Version des Betriebssystems l&auml;ut auf Deinem Computer?</b><br>
 
AmigaOS 3.0 denke ich? <br>
  
Ich benutze einen 800 MHz Athlon, auf dem BeOS l&auml;uft (das
k&uuml;rzlich "entkommene" und wahrlich exzellente DANO-Build). ... und
Windows 98 - aber nur, wenn ich wirklich mu&szlig;! </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Was auch immer zu schreiben mich jemand bezahlt! Ungl&uuml;cklicherweise
nichts f&uuml;r den Amiga :-( </p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b><br>
 
Das Zeug, das ich geschrieben habe: <br>

Aural illusion ist ein Audio-Editor. In Wirklichkiet ist es f&uuml;r
Klangverarbeitung gedacht anstatt nur Kl&auml;nge feinabzustimmen. Du
kannst mehrere Kl&auml;nge laden und kombinieren und dann jede Menge
Effekte auf sie anwenden. </p>
  
<p>Aural Sythetica ist ein Modularer Synthesizer. <br>

Du stellst Oszillatoren ein, um Kl&auml;nge zu erzeugen, und es gibt eine
Reihe Module, durch die du den Klang zur Verarbeitung routen kannst. Du
kannst ziemlich abgefahrene Kl&auml;nge erstellen. <br>

Es gibt auch 4 Disketten mit "Patches", mit denen du Kl&auml;nge erzeugen
kannst oder die du modifizieren kannst, um neue zu erzeugen. </p>
  
<p><b>Wie lange hat die Entwicklung bisher gebraucht?</b><br>
 
Ich habe insgesamt 7 Jahre daran Entwickelt (5 auf dem Amiga), aber es hat
mir nie Geld eingebracht :-( <br>

Die beste Sache dabei ist aber, da&szlig; ich insgesamt 2 Fehlermeldungen
in der ganzen Zeit hatte. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
Ich verwendete SAS/C und GadToolsBox.
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst Du?</b><br>
 
Alle oben genannten liefen auf echten Hardware-Amigas unter AmigaOS! Sie
liefen auch auf Amiga Forever. </p>
  
<p><b>Welches Betriebssystem wirst zu zuk&uuml;nftig unterst&uuml;tzen?</b><br>
 
Falls ich damit jemals wieder anfange, wird es <b>nicht</b> auf Windows
sein. ...aber ich f&uuml;rchte ich kann auch nicht sehen, da&szlig; ich
eine Amiga-Version mache. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Von mir nichts, aber das soll nicht hei&szlig;en, da&szlig; nicht jemand
anderes etwas machen k&ouml;nnte: Der Code f&uuml;r Ai3.0 ist
vollst&auml;ndig da und ihn fertigzustellen sollte nicht allzu schwierig
sein. </p>
  
<p>Ai4 hat viel mehr Effekte und diese k&ouml;nnten jederzeit auf den Amiga
zur&uuml;ck portiert werden, das sollte nicht allzu viel Arbeit sein, da
sie alle in C sind, tats&auml;chlich sind eine ganze Menge vom Amiga! Ich
habe ein paar &Auml;nderungen gemacht, und die Variablentyp-Namen sind
anders, aber es sollte nicht allzu viel Arbeit sein, das zu fixen. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
erh&auml;ltst?</b></p>

<p><b>Bekommst Du genug R&uuml;ckmeldungen f&uuml;r Deine Software?</b><br>
  
Ich werde beide beantworten: <br>

Ich habe nie viele R&uuml;ckmeldungen erhalten, aber ich war sehr
enthusiastisch, nicht viele Leute benutzen Aural illusion, aber diejenigen,
die es tun, scheinen es wirklich zu m&ouml;gen. Ich hatte mehrmals beinahe
(oder tats&auml;chlich) Ai3 an mehreren Punkten aufgegeben, aber es waren
die Benutzerkommentare, die mich bei der Stange gehalten haben. </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Ich habe ihn seit Jahren nicht mehr benutzt! Ich benutzte ihn jedoch lange
Zeit parallel zu meinem PC, ich hatte sogar die PC-Tastatur auf der
Amiga-Tastatur montiert, um Platz zu sparen! </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>
 
Das letzte SAS/C-Upgrade, ich h&ouml;rte davon im Internet, jemand
verkaufte die letzten paar Exemplare, also bestellte ich eins bei ihm. Viel
sp&auml;ter besorgte ich mir aber Amiga Forever, falls das z&auml;hlt. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>
 
Jetzt wo BeOS tot ist (um bald in PalmOS 5.0 wiedergeboren zu werden)
m&uuml;ssen die Benutzer etwas anderes finden, wohin sie gehen k&ouml;nnen.
Ich habe Windows genug benutzt, um es wirklich nicht zu m&ouml;gen, und ich
mag den Gedanken nicht, eine Firma zu unterst&uuml;tzen, deren
Lizenzgebahren absichtlich Be Inc. aus dem Markt gedr&auml;ngt hat. Ich
habe Linux ziemlich oft benutzt, aber nie zu Hause. Sowohl der Amiga als
auch BeOS hatten sehr gute Arbeitsoberfl&auml;chen - die besten ihrer
jeweiligen Zeit, und das ist ein Bereich, in dem Linux hinterher hinkt.
Einfach gesagt will ich einen Computer, der einfach zu benutzen ist. Das
gesagt hat sich Linux rasant verbessert, und ich habe in 4 Jahren nie ein
Linux Kernel abst&uuml;rzen sehen. Andererseits habe ich nie eine
Windows-Version gesehen, die nicht abst&uuml;rzt (und das beinhaltet NT,
2000 und XP). </p>
  
<p>Ich wei&szlig;, da&szlig; das f&uuml;r Amiga-Benutzer entsetzlich
klingen wird, aber... Ich denke, Apple hat in letzter Zeit ein gro&szlig;es
Comeback gehabt, sie haben gute Hardware und nun ein sehr gutes
Unix-basiertes Betriebssystem, die Tatsache, da&szlig; es so gut aussieht,
erg&auml;nzt das in meine Augen nur. Tats&auml;chlich erinnere ich mich,
da&szlig; als Steve Jobs R&uuml;ckkehr angek&uuml;ndigt wurde, ich mit
keinem anderen als Dave Haynie dar&uuml;ber diskutierte, was passieren
w&uuml;rde :) </p>
  
<p>Falls ich irgendwann das Geld aufbringen kann, werde ich mir
wahrscheinlich eines der Titanium-Powerbooks zulegen. Ich habe einen
riesigen Tower-PC, der einen unglaublichen L&auml;rm macht und mit
PCI-Karten vollgestopft ist, ich mag die Idee eines superschlanken
Notebooks, das mehr macht, und das leise! </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Sieht aus als w&uuml;rde es ohne meinen Glauben passieren... </p>
  
<p>Ist aber gut zu sehen, da&szlig; etwas passiert. Ich war in die JMS und
ICOADiskussionen involviert, als sie eingerichtet wurden, und ich erkenne
einige der Namen davon, wer heute mit Amiga zu tun hat. Es ist gut,
da&szlig; sie was damals eine ziemlich revolution&auml;re Technologie war
fortgef&uuml;hrt haben. </p>
  
<p><b>Deine letzten Worte an die Leser?</b><br>
 
Ich habe liebe Erinnerungen an meine Amiga-Tage, es gab ein echtes
Gemeinschaftsgef&uuml;hl, besonders in dme relativ kleinen Audiobereich.
Ich war wirklich ziemlich &uuml;berrascht zu sehen, da&szlig; die Community
immer noch so lebendig sit - wie ich entdeckte, als dutzende Besucher
pl&ouml;tzlich auftauchten und Software downloadeten, die ich seit Jahren
nicht benutzt habe! </p>
  
<p>Ich kann mich erinnern, auf der Amiga World 1990 von einem
24bit-Farbdisplay verbl&uuml;fft worden zu sein - der selben Show, auf der
der VideoToaster zuerst enth&uuml;llt wurde. Dann gab es die ganze
Aufregung mit den angek&uuml;ndigten AA- und sp&auml;ter AAA-Chipsets.
Commodore ging nat&uuml;rlich pleite, aber es gab immer die Hoffnung einer
Zukunft mit einer freundlichen Firma mit neuer Hardware und Prozessoren.
</p>
  
<p>Ich glaube der Amiga von Morgen wird sehr anders sein, und es wird nett
sein, ein Comeback zu sehen, selbst wenn es nicht ganz die Magie der
fr&uuml;hen Tage haben d&uuml;rfte - Paula, Agnus und Denise sind lange
fort - aber nicht vergessen. Ich habe dem Amiga viel zu verdanken,
tats&auml;chlich habe ich einige meiner besten Freunde durch den Amiga
getroffen. Ich w&uuml;nsche dem Amiga und seiner Community alles Gute, und
ich hoffe ihr habt Vergn&uuml;gen beim benutzen meiner Software. </p>
 

<p> © Amiga Arena 2/2002 <br>
(aus dem Englischen von Christian Busse) </p>

</td></tr></table>
<br>
</body>
</html>



