<html>
<head>
<title>Interview7</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Thilo K&ouml;hler</b></td></tr>
<tr><td valign=top>Software: </td>
<td> HD-Rec, Samplemanager, Toadies, ArTKanoid</td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.hd-rec.de</td></tr>

<tr><td valign=top> Email: </td>
<td> koehlerthilo@gmx.de</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>

Mein Name ist Thilo K&ouml;hler. Ich bin 25 Jahre alt und studiere
Informatik an der Universit&auml;t Karlsruhe. Ich besitze ein Tonstudio und
arbeite nebenbei als Musikproduzent. </p>
  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>

Ich hatte meinen ersten Amiga um 1988, aber gearbeitet habe ich damit nicht
;-) </p>

<p><b>Welches Amiga-Modell besitzt Du?</b><br>

Ich habe einen A500, A1200, A1200T 68060 im Infinitiv Tower und jetzt einen
Athlon 1,3GHz mit Amithlon. Ich arbeite haupts&auml;chlich mit Amithlon.
Nur f&uuml;r Harddiskrecording ben&ouml;tige ich noch den A1200T. (Das
liegt nicht daran dass es mit Amithlon nicht m&ouml;glich ist, ich habe
lediglich mein Programm HD-Rec noch nicht vollst&auml;ndig auf AHI
umgestellt). </p>

<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>

AmigaOS3.9 </p>
  
<p><b>Welche Software entwickelst Du?</b><br>

Im Moment entwickle ich nur noch an HD-Rec, einen MIDI/Audio Sequencer
&auml;hnlich wie Cubase. Das ist eine sehr aufwendige Sache, und ich
arbeite mittlerweile &uuml;ber drei Jahre daran. In den n&auml;chsten
Wochen werde ich hoffentlich die erste Beta Version zum download anbieten
k&ouml;nnen. </p>

<p><b>Kannst Du uns erz&auml;hlen, worum es bei Deiner Software
geht?</b><br>

Eigentlich ist dieses Interview zu Samplemanager, da ich aber nun an HD-Rec
arbeite und beide Programme viel gemeinsam haben werde ich &uuml;ber beide
erz&auml;hlen. Samplemanager ist ein reines Audiobearbeitungsprogramm und
bewusst im Aegis Audiomaster Stil gehalten. Es hat aber einige wesentliche
Features mehr wie z.B. eine Undo History und Audio-Realtimeeffekte.
Einmalig auf dem Amiga d&uuml;rfte da wohl der Autotune Effekt sein, den
wir alle aus Liedern wie "Believe" von "Cher" kennen. Er ist eigentlich
dazu gedacht Gesangsaufnahmen im nachhinein zu stimmen, was heute in (fast)
jeder professionellen Produktion gemacht wird. <br>

Der Nachteil an Samplemanager ist dass man nur ein Sample gleichzeitig
bearbeiten kann und es komplett im RAM liegen muss. Und genau da kommt
HD-Rec ins Spiel. Hier kann man fast bliebig viele Sampes auf einer
Zeitskala und bis zu 256 Tracks anordnen. Die
Bearbeitungsm&ouml;glichkeiten umfassen den Samplemanager komplett, 
zus&auml;tzlich kann man aber auch MIDI "Elemente" einbauen und editieren
&auml;hnlich wie bei Bars&Pipes. Beim Arrangieren werden also MIDI Elemente
und Audio Elemente gleich behandelt. Wenn man m&ouml;chte kann man HD-Rec
auch als reinen MIDI Sequencer benutzen. Die erste Beta Version wird sogar
nur MIDI f&auml;hig sein, da ich Audio noch nicht komplett auf AHI
umgestellt habe. Sobald Audio eingebunden ist werde ich auch verschiedene
Softwaresynthesizer Plugins schreiben. </p>
  
<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln?</b><br>

Als ich Samplemanager angefangen habe zu schreiben gab es keine
vern&uuml;nftigen Programme um 16Bit stereo Samples zu bearbeiten, und
schon gar nicht in vern&uuml;nftiger Zeit. Die Effekte von Samplemanager
sind so schnell dass man auf einem 68060er/50MHz auch mit 5 min 16Bit/44kHz
stereo Samples noch zurechtkommt ohne Kaffeepausen einlegen zu m&uuml;ssen,
genug RAM nat&uuml;rlich vorrausgesetzt. </p>

<p><b>Wie lang hat die Entwicklung bisher gebraucht?</b><br>

Samplemanager habe ich irgendwann 1996 oder 1997 angefangen, HD-Rec 1998.
Ich hoffe dass ich die erste komplete Version 1.0 von HD-Rec bis Ende 2002
fertig habe. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>

Ich schreibe haupts&auml;chlich in BlitzBasic2, ab und zu verwende ich 68k
Assembler. 8bit Grafiken zeichne ich in PPaint, 24bit Grafiken in
PerfectPaint. </p>

<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>

AmigaOS. </p>

<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig
unterst&uuml;tzen?</b><br>

AmigaOS. Ich werde mir keinen PPC zulegen weil das
Preis/Leistungsverh&auml;ltnis nicht zur x86 Hardware mithalten kann.
W&uuml;rde der PPC so oft verkauft wie x86 w&auml;re er wahrscheinlich
genauso g&uuml;nstig, wird er aber nicht. <br>

Ich hoffe dass AmigaOS eines Tages auf x86 l&auml;uft, obwohl viele
daswegen bedenken haben. Aber x86 ist nunmal sehr schnell, g&uuml;nstig und
wird weiterentwickelt. Desweiteren ist die Hardware sehr ausgereift, beim
"echten" Amiga gabs immer Probleme mit den Steckkarten. </p>

<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>

F&uuml;r Samplemanager werde ich nochmal ein Update machen das auf dem WB
Screen l&auml;uft und MP3 Dateien laden kann, das wars dann aber. Ich
arbeite selbst schon lange damit, und habe keinen Bedarf neue Features
einzubauen, da alle Features die ich brauche bereits implemetiert sind.
Wenn man so will kann man HD-Rec als "Update" betrachten, da es den
Funktionsumfang von Samplemanager im Groben enth&auml;lt, was aber nur
einen sehr kleinen Teil von HD-Rec ausmacht. </p>

<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Programmieren,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst?</b><br>

Nein, den Spa&szlig; verliere ich nicht. Aber es w&uuml;rde auch nicht
schaden wenn es mehr Resonanz g&auml;be. </p>

<p><b>Erh&auml;ltst Du gen&uuml;gend Resonanz auf Deine Software?</b><br>

Die Resonanz h&auml;lt sich in Grenzen. Nat&uuml;rlich freut man sich immer
wenn jemand sich f&uuml;r die eigene Arbeit interessiert, und oft entsteht
auch bessere Software durch Anregungen von Usern. </p>

<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>

Die wohl h&auml;ufigste Antwort auf diese Frage: gerade eben ;-) (oder ist
Amithlon kein Amiga !? Ich finde schon.) </p>

<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga gekauft?</b><br>

Amithlon. (AmigasXL) </p>


<p><b>Welche Software verwendest Du noch?</b><br>

PerfectPaint, PPaint, Arteffects, Amigawriter, YAM, Miami, Samba, BetaScann
MRE Startmenu, Amplifier, WebPlug, IBrowse, MakeCD und meine eigenen
Programme. </p>
  
<p><b>Welche Hard-/Software hast Du vor zu kaufen?</b><br>

Im Moment gibt es nichts was ich mir kaufen w&uuml;rde. Aber mal sehen was
die Zukunft bringt... </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>

Als Massenrechner - nein. Ansonsten war der Amiga ja nie wirklich weg. </p>
  
<p><b>Deine abschlie&szlig;enden Worte an die Leser?</b><br>

Es ist schade dass die wenigen verbliebenen Amiga Firmen so schlecht
zusammenabreiten, teilweise sich sogar bek&auml;mpfen. </p>

<p> © Amiga Arena 2/2002 </p>

</td></tr></table>
<br>
</body>
</html>



