<html>
<head>
<title>Interview1</title>
</head>
<body background="ncb_bg2.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>

<center>
<p><font color="#000080" size="7"><b>Amiga Arena Interview</b></font>
<table width=60% cellpadding=0 cellspacing=0>
<tr><td valign=top>Entwickler:</td>
<td><b> Daniel Westerberg</b> </td></tr>
<tr><td valign=top>Software: </td>
<td>TheMPegEncGUI, MultiRen, Detris, DRemind, 8SVXtoXXX, BackUp,
 AmigaAMP-Prefs, Cathedral, JoinSplitter and more..  </td></tr>
<tr><td valign=top> Homepage: </td>
<td> http://www.onyxsoft.nu</td></tr>

<tr><td valign=top> Email: </td>
<td valign=top> daniel@onyxsoft.nu
</td></tr>
</table>
</p></center>

<p><b>Bitte stelle Dich den Lesern vor!</b><br>
 
Hi! Ich bin ein 24 Jahre alter Student, der in Karstad in Schweden lebt.
Momentan studiere ich, um ein Software-Ingenieur zu werden. Meine
Hauptinteressen sind Amiga programmieren und Musik. Ich singe in zwei
Ch&ouml;ren als Tenor und mag es sehr, Musik zu h&ouml;ren,
haupts&auml;chlich Trance und Eurodance :) </p>

  
<p><b>Wann hast Du begonnen, mit dem Amiga zu arbeiten?</b><br>
 
Ich holte mir meinen ersten Amiga 1992, das war ein A500. 1995 habe ich auf
einen A1200 aufger&uuml;stet, den ich heute noch verwende. Ich besorgte mir
meinen A500 haupts&auml;chlich, um Musik darauf zu machen, da sich ein
Freund kurz vorher einen geholt hatte und ich die sehr ordentliche Art sah,
Musik mit einem Tracker zu machen. Ich habe etwa 80 Module gamacht, wobei
ich haupts&auml;chlich NoiseTracker verwendet habe, 30 sind meine eigenen
Sch&ouml;pfungen, und der Rest sind Coverversionen von Demos, Spielen usw.
1995 hat die Programmierung mein Interesse geweckt, und ich gab das Musik
machen auf. </p>
  
<p><b>Welchen Amiga besitzt Du?</b><br>
  
Einen Amiga 1200/BlizzardPPC/BVisionPPC und einen Amiga 2000, den ich nie
nutze, abgesehen von der Tastatur da der A1200 getowert ist :) </p>
  
<p><b>Welche Version des Betriebssystems l&auml;uft auf Deinem
Computer?</b><br>
 
AmigaOS 3.9 nat&uuml;rlich, was sonst?! :) </p>
  
<p><b>Welche Software entwickelst Du?</b><br>
 
Im Laufe der Jahre hat es eine Menge Programme gegeben. TheMPegEncGUI,
MultiRen, Detris, DRemind, 8SVXtoXXX, BackUp, AmigaAMP-Prefs, Cathedral und
JoinSplitter sind vielleicht die bekannstesten Programme. Ich habe
au&szlig;erdem eine Anzahl kleiner mehr oder weniger n&uuml;tzlicher Tools
gemacht. </p>
  
Momentan arbeite ich an einer neuen Version von Detris, und meinem neuesten
Tool QuickSketch, das etwas wie Stefan Blixths QuickNote ist - ein
computerisiertes Post-It-Ding. In QuickSketch kannst du aber nicht nur Text
schreiben sondern auch mit deiner Maus malen. </p>
  
<p><b>Kannst Du uns sagen, worum es bei Deiner Software geht?</b>

<table border=0>

<tr><td colspan=2> Oh, das wird jetzt ein Langer :) <br> Also, QuickSkecth
habe ich gerade erl&auml;utert. </td></tr>

<tr><td valign=top> TheMPegEncGUI </td>

<td> Das ist ein GUI f&uuml;r ein paar MP3-Encoder wie Lame, MusicIn,
NCode, BladeEnc und andere mehr. </td></tr>

<tr><td valign=top> MultiRen </td>

<td> Das, wage ich zu behaupten, ist das fortgeschrittenste
DateiUmbenennungs-Programm der Welt. Du kannst Dateien auf viele Arten
umbenennen, automatisch, manuell oder mit fortgeschrittenen Mustern oder
unter Verwendung von Plugins.

<tr><td valign=top> Detris </td>

<td> Ein Tetris-Klon unter Verwendung von MUI und deshalb vollkommen
RTGkompatibel. </td></tr>

<tr><td valign=top> DRemind </td>

<td> Ein Erinnerungsprogramm, damit du keine Verabredungen, Geburtstage,
Fernsehsendungen und so verpa&szlig;t. </td></tr>

<tr><td valign=top> 8SVXtoXXX </td>

<td> Das ist ein Sample-Konvertierer, den du verwenden kannst, um Samples
von IFF-8SVX nach 8SVX, AIFF, WAV, VOC oder RAW-Format zu umzuwandeln. Du
kannst w&auml;hrend der Konvertierung auch resamplen. </td></tr>

<tr><td valign=top> BackUp </td>

<td> Das ist ein Datensicherungs-Tool. Es kopiert eine vollst&auml;ndige
Verzeichnis-Struktur an einen anderen Ort. Das nette daran ist, meiner
Meinung nach, da&szlig; es die Sicherung nicht archiviert oder komprimiert,
sondern einfach nur kopiert, so da&szlig; du das BackUpProgramm nicht
brauchst, um die Sicherung zu lesen. </td></tr>

<tr><td valign=top> AmigaAMP</td>

<td>Prefs - Das ist der "offizielle" Prefs-Editor, der mit AmigaAMP
ausgeliefert wird. </td></tr>

<tr><td valign=top> Cathedral </td>

<td> Ein experimentelles Programm, um AIFF-Samples mit Hall-Effekten zu
versehen. </td></tr>

<tr><td valign=top> JoinSplitter </td>

<td> Ein Programm zum Splitten und Zusammenf&uuml;gen gro&szlig;er Dateien,
falls du sie z.B. auf Floppy-Disk transportieren mu&szlig;t. </td></tr>
                 
<tr><td colspan=2> Ich hoffe ich habe alle. Mehr Information gibt es auf
der Homepage. </td></tr></table>

<p><b>Was hat Dich auf die Idee gebracht, Deine Software (weiter) zu
entwickeln?</b><br>
 
Tja, das kann verschiedene Urachen haben. Gew&ouml;hnlich will ich nur eine
neue Funktion in einem Programm oder will nur ein neues Programm. Nimm z.B.
MultiRen. Ich hatte all diese MP3s mit wirklich schlechetn, komischen oder
zu langen Namen und brauchte eine einfache und schnelle Methode, sie
umzubenennen, also machte ich MultiRen. Manchmal w&uuml;nscht ein Benutzer
eine Funktion in einem Programm, also implementiere ich diese Funktion.
</p>
  
<p><b>Wie lange hat die Entwicklung bisher gebraucht?</b><br>
  
Da ich viele Programme gemacht habe und sie gleichzeitig aktualisiere ist
das schwer zu sagen, aber ich habe mal ein Timertool gemacht, um die
&Uuml;bersicht zu zu behalten, wie viel Zeit ich mit meinem Amiga verbracht
habe. In einem Jahr habe ich 1700 Stunden verbraucht, das ist 1/5 des
Jahres! Das meiste dieser Zeit war Entwicklungszeit. Das ist ein paar Jahre
her, aber heute, denke ich, verbringe ich noch mehr Zeit mit dem Computer,
aber weniger Zeit ist tats&auml;chliche Entwicklungszeit. </p>
  
<p><b>Welche Software verwendest Du zum Entwickeln?</b><br>
 
Da ich in Amiga-E programmiere, verwende ich EC von Wouter van Oortmerssen.
Als GUI-Frontend f&uuml;r diesen CLI-basierten Compiler verwende ich mein
DECH. Und der Texteditor, den ich verwende, ist Annotate 2.0 von Doug
Bakewell. </p>
  
<p><b>F&uuml;r welches System (AmigaOS, AmigaDE, MorphOS) entwickelst
Du?</b><br>
 
Bisher was es nur f&uuml;r AmigaOS. AmigaDE ist f&uuml;r mich nicht von
Interesse da ich keinen PDA oder gar PC oder sonst einen anderen Computer
habe. Ich habe &uuml;ber MorphOS nachgedacht, aber dann mu&szlig; ich
stattdessen in C schreiben, und Portieren von E ist eine Menge Arbeit.
Au&szlig;erdem kriege ich MorphOS auf meinem Computer nicht ans Laufen.
</p>
  
<p><b>Welches Betriebssystem wirst Du zuk&uuml;nftig unterst&uuml;tzen?</b><br>
 
AmigaOS 4.0! Vielleicht MorphOS, vielleicht Linux, vielleicht auch AmigaDE,
das ist zu diesem Zeitpunkt schwer zu sagen. Vielleicht portiere ich manche
Progamme wie MultiRen auch auf Windows, nur aus finanziellen Gr&uuml;nden,
wer wei&szlig;? Aber das ist noch Jahre hin. </p>
  
<p><b>Was k&ouml;nnen wir von zuk&uuml;nftigen Versionen erwarten?</b><br>
 
Detris: 2-Spieler-Modus &uuml;ber TCP/IP. <br>
MultiRen: Wahrscheinlich das eine oder andere neue Plugin. </p>
  
Ich habe sonst au&szlig;er Fehlerbehebungen und Implementierung neuer
Funktionen, falls ich oder sonst jemand sich welche ausdenken sollte,
nichts geplant. </p>
  
<p><b>Verlierst Du nicht den Spa&szlig; und das Interesse am Entwickeln,
wenn Du die geringe Resonanz siehst, die Du aus dem kleinen Amiga-Markt
bekommst?</b><br>
  
Manchmal halte ich inne und frage mich, was ich da eigentlich mache,
Programme zu entwickeln und so viel Zeit in diesen &auml;u&szlig;erst
kleinen Markt zu investieren. Aber dann denke ich, da&szlig; ich in
Wirklichkeit haupts&auml;chlich zu meiner eigenen Unterhaltung
programmiere, nicht f&uuml;r jemand anderes. Also mache ich einfach weiter!
:-) </p>
  
<p><b>Erh&auml;ltst Du genug R&uuml;ckmeldungen f&uuml;r Deine
Software?</b><br>
 
Ja, aber sicherlich nicht mehr als genug. </p>
  
<p><b>Wann hast Du Deinen Amiga zuletzt benutzt?</b><br>
 
Als ich zuletzt wach und zu Hause war, n&auml;mlich jetzt :) Er ist 24
Stunden am Tag/360 Tage im Jahr eingeschaltet (manchmal lasse ich ihn ein
paar Tage ausrugen, wenn ich ein paar Tage fort bin..). </p>
  
<p><b>Welche Software hast Du zuletzt f&uuml;r Deinen Amiga
gekauft?</b><br>
 
Hmm, das m&uuml;&szlig;te TaskiSMS gewesen sein, denke ic, oder was es
AmigaOS 3.9..? Kann mich nicht erinnern. </p>
  
<p><b>Welche Software verwendest Du noch?</b><br>
 
Von den Programmen, die ich gekauft habe? Also, das w&auml;re DirOpus
Magellan-II, IBrowse, AmIRC, Miami, TaskiSMS, PFS-3. </p>
  
<p><b>Welche Hard-/Software hat Du vor zu kaufen?</b><br>
 
Hardware: AmigaOne, oder vielleicht Pegasos. <br>

Software: Ich w&uuml;rde mir gern ein professionelles Audiowerkzeug wie
ProStationAudio oder so etwas besorgen, aber ich habe keine funktionierende
Soundkarte, keine PFU und sie sind zu teuer. </p>
  
<p><b>Glaubst Du an ein Comeback von Amiga?</b><br>
 
Nicht wie 1985, nein. Ich glaube nicht, da&szlig; die Leute von sich aus
hingehen und einen AmigaOne oder so etwas kaufen, weil die Leute den Amiga
vergessen haben. Einige Ex-Amiganer werden sich wahrscheinlich einen
AmigaOne oder &auml;hnlich besorgen, aber solange Amiga nicht eine
Werbekampagne macht, die etwa 10 mal so stark ist wie Microsofts und das
ein Jahr lang durchh&auml;lt, wird meiner Meinung nach kein
gr&ouml;&szlig;erer Amiga-Rausch passieren. Und das ist traurig. </p>
  
<p><b>Deine letzten Worte an die Leser?</b><br>
 
Keep the momentum going! <br>

Selbst obwohl ich nicht glaube, da&szlig; Amiga marktf&uuml;hrend wird, ist
es doch ein guter Computer, der es verdient zu leben. Mit neuer Hardware um
die Ecke m&uuml;ssen die Leute nicht l&auml;nger einen PC kaufen, um
bestimmte Sachen machen zu k&ouml;nnen, die ein heutiger Amiga einfach
nicht kann, weil die Hardware nicht ausreicht, aber sie k&ouml;nnen immer
noch ihren Amiga verwenden. </p>

<p> © Amiga Arena 2/2002 <br>

(aus dem Englischen von Christian Busse)

</p>

</td></tr></table>
<br>
</body>
</html>



