<!DOCTYPE HTML PUBLIC "-//W3C/DTD HTML 3.2//EN">
<HTML>
<HEAD>
<AUTHOR: Kilian Servais on Amiga Computer>
<TITLE>Brief an Rainer</TITLE>
</HEAD>
<BODY TEXT=ffaa00 bgcolor=black link=silver alink=red>
<table width=95%>
<p><b>Hail Rainer!</B><br>
Na, alles klar bei Dir? Wollte es mir nat&#252;rlich nicht nehmen lassen, kurz auf Deinen letzten Leserbrief einzugehen...</P>

<p><FONT COLOR="#87CEFA"><i>Hail ! Alles Fit bei Dir ? Wie war das noch mit Deinen Gladbachern ? (grins) Schon mal wieder einen Blick auf die Tabelle geworfen ? ;-)) Ich weiss, Du wirst mich jetzt steinigen wollen...aber ich glaube immer noch, dass wir uns n&#228;chstes Jahr mal im Rot-Weiss Stadion treffen werden. ;-) Die 2.Liga ist doch auch was feines, oder nicht !? ;-)</i></font></P>

<p>Pah! Gestern (am 3.3.02) haben wir erst wieder 1:0 gegen Bremen gewonnen und momentan sieht es wieder recht gut aus. Die dummen K&#246;lner steigen auf jeden Fall ab, St.Pauli wohl auch und als drittes w&#228;re mir lieb, wenn es die Cottbusser erwischen w&#252;rde. Insofern darf ich mir also auch n&#228;chstes Jahr die erste Liga geben. Die WDR2 Radiokonferenz ist doch was sch&#246;nes....</P>

<p><FONT COLOR="#87CEFA"><i>So, mittlerweile habe ich mir auch Dickinson`s &quot;Best Of&quot; reingepfiffen - aber mehr als ein ganz nett kommt mir da beim besten Willen nicht &#252;ber die Lippen. Naja, als Fan muss man das Teil nat&#252;rlich haben. ;-)</i></font></P>

<p>Die beiden neuen st&#252;cke sind sicherlich stark, der Best Of Teil zu klein und die Bonus CD eigentlich ein schlechter Witz. Ich habe da massig mehr von erwartet, gerade was die Bonus CD angeht. Bruce hat so viel Material, was er noch ver&#246;ffentlichen k&#246;nnte, aber statt dessen kommt so ein Shit raus. Also echt, da w&#228;re mehr m&#246;glich gewesen. Er sollte gleich die geplante &quot;Catacombs&quot; CD nachlegen, aber das wird wohl nix mehr. </P>

<p><FONT COLOR="#87CEFA"><i>Viel interessanter ist da die &quot;Actual Fantasy&quot; von Ayreon, die ich endlich im Laden aufst&#246;bern konnte (und meine Ayreon-Sammlung somit ausser dem Nebe
nprojekt &quot;Ambeon&quot; komplett ist). Das ganze geh&#246;rt nat&#252;rlich nicht mehr in die Metal-Schiene (Progrock mit psychedelischen Elementen), ist aber nichts 
desto trotz ein starkes Album - mit einem ebenso starkem Edward Reekers (sehr sympathische, ruhige Stimme). Weisst Du vielleicht wo der haupts&#228;chlich 
aktiv ist ? W&#252;rde ich mal gerne wissen...! Apropos Ambeon: Konntest Du da mittlerweile mal reinh&#246;ren ? Mir ist nur der (preview-) Track &quot;Cold Metal&quot; auf dem &quot;Ayreonaults Only&quot; bekannt...</i></font></P>

<p>Ambeon habe ich immer noch nicht da (leider), aber vielleicht demn&#228;chst. Momentan h&#246;re ich die neue Pain Of Salvation Platte rauf und runter - die ist echt besser als die neue Dream Theater, die von mir nur als &quot;sehr gut&quot; eingestuft wird. Da fande ich die letzte Platte schon st&#228;rker, wobei es nat&#252;rlich auch schwierig ist so ein Teil zu toppen. Na ja, die DVD dazu ist auch echt geil!</P>

<p><FONT COLOR="#87CEFA"><i>Vor allen Dingen hat sich momentan bei Helloween rein gar nichts ge&#228;ndert. Wurde Grapow nicht aus der Band gekickt, weil er noch in anderen Projekten 
involviert war ? Und was ist mit Richter ? Der wird Helloween selbst wohl nur als &quot;Nebenprojekt&quot; ansehen - und wohl kaum die Gammastrahlen verlassen...womit wieder irgendwie alles beim alten bliebe. Da soll noch mal einer durchblicken, was in Weikath`s Oberst&#252;bchen vor sich geht ! Hmpf !</i></font></P>

<p>Ich blicke da auch nicht mehr durch, aber das wird sich schon noch zeigen. Einen neuen festen Gitarristen haben die Jungs auf jeden Fall noch nicht. Daf&#252;r hat Grapow &amp; Kusch einen Namen gefunden - &quot;Masterplan&quot; nennt sich derren neue Combo. Gl&#252;cklicherweise haben die Fans gegen den urspr&#252;nglich geplanten Namen &quot;Mr.Torture&quot; rebelliert, so dass es dazu nicht gekommen ist. W&#228;re wohl auch ein arg bescheuerter Name gewesen, zumal der gleichnamige Helloween Song mit Kindergarten Lyrics auf unterstem Niveau gl&#228;nzt.</P>

<p>Und wo wir gerade bei Gamma Ray sind: Unversch&#228;hmtheit, dass die jetzt alle Alben neu auf den Markt bringen - und zwar als Digipack Version mit jeweils drei Bonustracks. Die 18 Nummern habe ich zwar schon, aber &#228;rgerlich ist das trotzdem. Im Grunde sogar echt unversch&#228;mt....</P>

<p>Was sagst du zur neuen Running Wild? Ist die Rock hard wohl mal wieder massiv &#252;ber das Ziel hinausgeschossen....</P>

<p>See ya!</P>



<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
<CENTEr>
<a href="mitglieder/servais.html"><img src="bruce.jpg" border="0"><p></A>
Kilian<blink> "The Bruce"</BLink> Servais
</CENTER>
</P>
</BODY>
</HTML>
