<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Der Satellit Artemis -Pannenhilfe im Weltraum</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<table border=0 cellpadding=8>
<tr>
<td>
<p align=center><font color="#000080" size="7"><b>Der Satellit Artemis -<br>
Pannenhilfe im Weltraum</b></font></p>

<p>Seit einem halben Jahr umkreist der Telekommunikationssatellit Artemis
die Erde, aber nicht da, wo er eigentlich sein sollte. Probleme mit der
Tr&auml;gerrakete vom Typ Ariane 5 hatten dazu gef&uuml;hrt, dass die
Raumsonde viel zu fr&uuml;h im All ausgesetzt wurde. Gut eine Milliarde
Euro stehen auf dem Spiel. </p>

<p>Es ist der 12. Juli 2001. Die Ingenieure in der Bodenkontrolle in Kourou
stellen schockiert fest: Artemis, ein experimenteller
Telekommunikationssatellit der ESA befindet sich auf einer falschen
Umlaufbahn. Er hat 900 Millionen Euro gekostet und ist aus finanziellen
Gr&uuml;nden nicht versichert.</p>

<p>Die Startphase verl&auml;uft zun&auml;chst normal. Die Ariane 5 soll den
ESA-Satelliten auf eine elliptische Umlaufbahn mit einer Maximalh&ouml;he
von 36.000 Kilometern transportieren. Doch der Satellit kommt nicht halb so
weit wie vorgesehen. Eine Untersuchungskommission stellt sp&auml;ter
hydraulische Probleme fest, die zu einer unregelm&auml;&szlig;igen
Treibstoffzufuhr in der oberen Raketenstufe f&uuml;hrten. Als Folge war der
europ&auml;ische Artemis-Satellit auf die viel zu niedrige Umlaufbahn
gebracht worden. Nur das Kontrollzentrum der Telespazio in Fucino, Italien,
hat kurz nach dem Start noch Kontakt zu Artemis. Verzweifelt versuchen die
Wissenschaftler aus ganz Europa, die genaue Flugbahn von Artemis
herauszufinden. Schlie&szlig;lich k&ouml;nnen sie den Satelliten wieder
orten. </p>

<p>Die Wissenschaftler sehen bald nach seinem Start: Auf seiner Bahn droht
Artemis Gefahr von der Sonne, genauer gesagt vom Sonnenwind. Der Sonnenwind
besteht aus elektrisch geladenen Teilchen und kann die Elektronik des
Satelliten zerst&ouml;ren. Da das Magnetfeld der Erde den Sonnewind
ablenkt, entsteht an den R&auml;ndern des Magnetfeldes eine
gef&auml;hrliche Zone, der sogenannte &quot;Van Allen G&uuml;rtel&quot;.
Hier staut sich der Sonnenwind. Genau durch diesen Bereich f&uuml;hrt die
Bahn von Artemis. </p>

<p>Um diesen G&uuml;rtel zu umgehen, muss der Satellit mit seinem eigenen
Antrieb so schnell wie m&ouml;glich auf eine stabile Kreisbahn in 31.000
Kilometer H&ouml;he einlenken. Dieses Man&ouml;ver f&uuml;hrte Artemis
schon am 19. Juli 2001 durch, doch die Bewegung kostete fast den gesamtem
chemischen Kraftstoff, den der Satellit normalerweise braucht, um in seiner
Lebensdauer von zehn Jahren seine Flugbahn immer wieder zu korrigieren.
</p>

<p>Artemis kreist jetzt 5.000 Kilometer von seiner geostation&auml;ren Bahn
entfernt. Doch wie soll er das letzte Teilst&uuml;ck &uuml;berwinden? Die
Wissenschaftler haben eine Idee. Als einziger Kommunikationssatellit der
Welt hat Artemis einen sogenannten Ionenantrieb an Bord. Jetzt soll der bei
der Raumfahrtfirma Astrium in M&uuml;nchen gebaute Motor den Satelliten
retten. Beim Ionenantrieb werden Teilchen des Gases Xenon durch ein
geladenes Gitter beschleunigt. Dadurch entsteht Schub. Die Schubkraft ist
zwar gering, der Motor kann aber mit wenigen Kilo Xenon viele Monate lang
laufen. Dieser Ionenantrieb braucht 20 Wochen, um den Satelliten auf seine
vorgesehene Umlaufbahn zu heben. Am Montag den 28. Januar 2002 ging es los,
der Ionenantrieb wurde gez&uuml;ndet. </p>


<p>Und warum die ganze Anstrengung? <br>

Ohne Artemis kann Envisat nicht arbeiten. Envisat? Envisat ist der
gr&ouml;&szlig;te und teuerste Umweltforschungssatellit aller Zeiten. Mit
seiner Gr&ouml;sse von 25m × 7m × 10m und einer Gesamtmasse von mehr als
8.000 kg beim Start ist Envisat einer der gr&ouml;&szlig;ten Satelliten,
der je in Europa gebaut wurden. Rund 1,5 Millionen Euro hat er gekostet.
Ende Februar soll er ins All starten um beispielsweise das Erdklima zu
untersuchen. Das Besondere an ihm: Er kann zahlreiche wissenschaftliche
Daten &uuml;ber die Erde sammeln. Da er sehr niedrig und schnell &uuml;ber
der Erde fliegt und dabei seine Daten nicht an Antennen am Boden funken
kann, braucht er den Satelliten Artemis. Sobald Envisat Daten gesammelt
hat, &uuml;bertr&auml;gt er sie mit einem Laserstrahl zu Artemis. Artemis
funkt die Angaben dann zu Boden. Misslingt der Rettungsversuch von Artemis,
wird auch Envisat als ein St&uuml;ck Weltraumschrott durchs All schwirren.
</p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
