<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Envisat, der gr&ouml;&szlig;te Erdbeobachtungssatellit</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>Envisat</b></font> </p>

<p>Wenn ihr dies nun lest, dann ist dies schon Geschichte, denn: In der
Nacht zum 1. M&auml;rz 2002 soll der von Astrium im Auftrag der
Europ&auml;ischen Weltraumorganisation Esa gebaute Envisat (der
gr&ouml;&szlig;te Erdbeobachtungssatelliten, der je in Europa gebaut worden
ist) vom Weltraumbahnhof in Kourou, Franz&ouml;sisch Guyana, aus starten.
Eine Tr&auml;gerrakete des Typs Ariane 5 wird den acht Tonnen schweren
Koloss ins Weltall bef&ouml;rdern. </p>

<p>Schon seit einigen Wochen sind rund 50 Mitarbeiter des europ&auml;ischen
Raumfahrtkonzerns Astrium in Kourou, um den Satelliten vor Ort startklar zu
machen. Damit Envisat auf den Punkt genau startbereit ist, wird an sieben
Tagen in der Woche teilweise im Zweischichtbetrieb gearbeitet. Inzwischen
steht die Integration des Satelliten vor dem Abschluss. Zwischen den
einzelnen Arbeitsg&auml;ngen m&uuml;ssen immer wieder umfangreiche Tests
durchgef&uuml;hrt werden, damit sichergestellt ist, dass der Satellit
sp&auml;ter einwandfrei funktioniert. Die elektrischen Tests sollten bis 31.
Januar abgeschlossen sein. Der so genannte Flight Readiness Review, bei dem
die abschlie&szlig;ende Startfreigabe f&uuml;r den Satelliten erteilt wurde,
war f&uuml;r den 2. Februar angesetzt. Anschlie&szlig;end mussten die
vier Tanks des Satelliten noch mit Hydrazin gef&uuml;llt werden, bevor er
dann auf die Tr&auml;gerrakete montiert wurde. </p>

<p>Bereits im Mai vergangenen Jahres ist Envisat an Bord eines russischen
Gro&szlig;raum-Transportflugzeugs vom Typ Antonov 124 nach Kourou gebracht
worden. Der Start war urspr&uuml;nglich f&uuml;r den Herbst 2001 geplant,
musste jedoch auf das Fr&uuml;hjahr 2002 verschoben werden. </p>

<p>Wenn alle Vorbereitungen nach Plan liefen, ist der Start am 28. Februar
um 22.07 Uhr Ortszeit (entspr. 1. M&auml;rz, 2.07 Uhr, MEZ) erfolgt. 26
Minuten nach dem Start wurde der Satellit von der Raketenoberstufe
abgetrennt. Dann fuhr das Sonnensegel aus, und Envisat wurde auf Kurs
gebracht. Im entfalteten Zustand misst der Satelliten-Gigant im All 25 × 7 ×
10 Meter. W&auml;hrend der gesamten Mission wird der Umweltsatellit
vom Europ&auml;ischen Raumfahrtkontrollzentrum ESOC in Darmstadt aus
&uuml;berwacht und gesteuert. (Ob der Zeitplan so eingehalten wurde,
wei&szlig; ich nicht, heute schreiben wir den 18. Februar 2002). </p>

<p>Nachdem Envisat seine polare Umlaufbahn in 800 Kilometern H&ouml;he
erreicht hat, wird er die Erde mindestens f&uuml;nf Jahre lang alle 100
Minuten umrunden. W&auml;hrend sich die Erde unter dem Satelliten
hinwegdreht, k&ouml;nnen seine wissenschaftliche Instrumente nach und nach
den gesamten Globus abtasten - und zwar innerhalb von einem bis drei Tagen,
je nach &quot;Blickfeld&quot; des jeweiligen Instruments. </p>

<p>Als Hauptauftragnehmer an der Spitze eines europ&auml;ischen
Industriekonsortiums hat Astrium den europ&auml;ischen Umweltsatelliten
entwickelt und gebaut. An der Realisierung des Envisat-Projektes waren
Astrium-Ingenieure in Gro&szlig;britannien, Deutschland und Frankreich
beteiligt. </p>

<p>Das &quot;R&uuml;ckgrat&quot; des Satelliten bildet die von Astrium neu
entwickelte Polare Plattform. Bei der Entwicklung der Plattform konnten die
Astrium-Ingenieure auf ihren reichhaltigen Erfahrungsschatz
zur&uuml;ckgreifen, den sie beim Bau der Erdbeobachtungssatelliten der
Spot- und ERS-Serie gesammelt haben. Die Polare Plattform f&uuml;r den
Envisat ist jedoch deutlich gr&ouml;&szlig;er als bei den vorher gebauten
Edbeobachtungssatelliten, und auch die Subsysteme f&uuml;r
Energieversorgung, Bahn- und Lageregelung, sowie Datenspeicherung und
-&uuml;bertragung zur Bodenstation sind wesentlich leistungsf&auml;higer.
</p>

<p>Envisats Nutzlast umfasst zehn Instrumente, die sowohl von der
wissenschaftlichen Zielsetzung als auch von der anwendungsorientierten
Seite eine ideale Kombination zur Beobachtung und Erforschung unserer Erde
und deren Atmosph&auml;re darstellen. Envisat versorgt Wissenschaftler
weltweit mit einer F&uuml;lle von Daten. Diese werden den Forschern zu
einem besseren Verst&auml;ndnis der globalen Erw&auml;rmung, des
Klimawandels und des Ozonabbaus sowie der Ver&auml;nderungen in den
Ozeanen, der Eis- und Vegetationsdecke und in der Zusammensetzung der
Atmosph&auml;re verhelfen. Astrium hat f&uuml;nf dieser zehn Instrumente
gebaut. </p>

<p>Europas f&uuml;hrende Raumfahrtfirma Astrium ist ein
Gemeinschaftsunternehmen, das zu 75 Prozent der <b>EADS European Aeronautic
Defence and Space Company</b>  und zu 25 Prozent <b>BAE SYSTEMS</b> geh&ouml;rt.
Es hat 8.000 Mitarbeiter in Frankreich, Deutschland, Gro&szlig;britannien
und Spanien. 2000 erzielte die Astrium auf den Gebieten Wissenschaft und
Erdbeobachtung, Telekommunikation, Navigation, Bodenstationen,
Milit&auml;rische Programme, Tr&auml;gerraketen und Raumfahrt-Infrastruktur
einen Jahresumsatz von 2,03 Milliarden Euro. </p>

<p><font size="+1"><b>Envisat und seine Instrumente </b></font></p>

<p>Um die anspruchsvollen Ziele der Envisat-Mission erf&uuml;llen zu
k&ouml;nnen, bedarf es hochkomplexer und genauer Messinstrumente. Envisat
verf&uuml;gt &uuml;ber zehn unterschiedliche, sich in gewissen Bereichen
erg&auml;nzende, Sensoren zur Beobachtung und Erforschung der Polarregionen
der Erde, der Ozeane, der Landmassen und der Atmosph&auml;re. Die Nutzlast
umfasst sieben Instrumente, die im Auftrag der europ&auml;ischen
Weltraumorganisation ESA entwickelt und drei, die von nationalen
Institutionen beigestellt wurden. </p>

<p>Das von der Astrium GmbH in Ottobrunn entwickelte <b>Michelson
Interferometer for Passive Atmospheric Sounding (Mipas)</b> dient der
globalen Beobachtung von Spurengasen und ihrer fotochemischen
Wechselwirkungen in der mittleren Atmosph&auml;re. Die Instrumentdaten
werden haupts&auml;chlich in folgenden Forschungsgebieten Anwendung finden:
<ul>

<li> Chemie der Stratosph&auml;re: globaler Abbau der sch&uuml;tzenden
Ozonschicht, Chemie der Stratosph&auml;re &uuml;ber den Polregionen; </li>

<li> Globale Klimatologie: weltweite Verteilung klimarelevanter Spurengase
und Aerosole in der Atmosph&auml;re; </li>

<li> Dynamik der Atmosph&auml;re: Transportprozesse in der
Stratosph&auml;re, Austauschvorg&auml;nge zwischen Troposph&auml;re und
Stratosph&auml;re; </li>

<li> Chemie der oberen Troposph&auml;re: Zusammenhang zwischen der
Spurengasverteilung in der unteren Atmosph&auml;re und menschlichen
Aktivit&auml;ten auf der Erde. </li></ul></p>

<p><b>Mipas</b> erlaubt die gleichzeitige Messung von mehr als zwanzig
relevanten Spurengasen einschlie&szlig;lich der gesamten NOx-Familie
(verschiedene Stickoxide) und verschiedener FCKWs
(Fluorchlorkohlenwasserstoffe). Die Temperatur in der Atmosph&auml;re sowie
die Verteilung von Aerosolteilchen, troposph&auml;rische Zirruswolken und
stratosph&auml;rische Eiswolken - einschlie&szlig;lich der f&uuml;r den
Ozonabbau wichtigen polaren stratosph&auml;rischen Wolken - sind weitere
Schl&uuml;sselparameter der globalen Klimaver&auml;nderung, die aus den
Beobachtungen mit Mipas abgeleitet werden k&ouml;nnen. </p>

<p>Das <b>Advanced Synthetic Aperture Radar (Asar)</b> ist ein
hochaufl&ouml;sendes abbildendes Radarinstrument, welches sowohl f&uuml;r
die detaillierte Erforschung regionaler Effekte eingesetzt werden kann, als
auch bei globaler Beobachtung und &Uuml;berwachung von Land und Meeren
Anwendung findet. Das Radar-Messprinzip und die Eigenschaft der
Mikrowellenstrahlung, Wolken ungest&ouml;rt durchdringen zu k&ouml;nnen,
erlaubt es, mit Asar sowohl bei Nacht als auch unabh&auml;ngig von den
aktuellen Wetterbedingungen am Beobachtungsort Messungen machen zu
k&ouml;nnen. Diese F&auml;higkeit ist von erheblichem Vorteil
gegen&uuml;ber den optischen Instrumenten. Viele interessante
Beobachtungsgebiete, wie z. B. der tropische Regenwald, sind nahezu
st&auml;ndig von Wolken bedeckt und entziehen sich damit weitgehend einer
regelm&auml;&szlig;igen Beobachtung mit optischen
Fernerkundungsinstrumenten. Asar wurde unter der F&uuml;hrung von Astrium
Ltd. in Portsmouth gebaut. </p>

<p>Als wichtigste Verbesserung im Vergleich zu dem von den ERS-Satelliten
bekannten &quot;Active Microwave Instrumentation&quot; (AMI) - Instrument,
bietet das Asar die M&ouml;glichkeit, mit Hilfe der sogenannten ScanSAR
Technik bis zu 400 Kilometer breite Streifen abzutasten und gleichzeitig in
horizontaler und vertikaler Polarisierung abzubilden. AMI konnte einen
Streifen von 100 Kilometer Breite in nur einer Polarisationsebene
aufnehmen. Asar wird also zus&auml;tzliche Bildinformationen liefern und
eine wesentlich verbesserte Einsatzflexibilit&auml;t bieten. </p>

<p>Das Instrument <b>Gomos (Global Ozone Monitoring by Occultation of
Stars)</b> von Astrium SAS, Toulouse, erlaubt die in der Erdatmosph&auml;re
ablaufenden Prozesse, die zum Ozonabbau in der Stratosph&auml;re
f&uuml;hren, mit hoher Genauigkeit zu beobachten. Gomos ist damit
insbesondere f&uuml;r die sehr wichtigen l&auml;ngerfristigen
Trendmessungen der Ozonkonzentration in der oberen Stratosph&auml;re
geeignet. Saisonale, lokale und auch durch spezielle Ereignisse
hervorgerufene Schwankungen in der Ozonkonzentration erschweren die
Trendmessungen und erfordern eine hohe Messgenauigkeit &uuml;ber einen
m&ouml;glichst langen Zeitraum. Die hohe Langzeitstabilit&auml;t der
Messung wird durch die besondere Vorgehensweise erreicht: Das Instrument
richtet sich auf einen Stern aus, der noch ungest&ouml;rt durch die
irdische Atmosph&auml;re hoch &uuml;ber dem Horizont steht und verfolgt
dann kontinuierlich den Sternuntergang. Das Spektrum des noch
ungest&ouml;rten Sternlichts wird mit dem durch die Erdatmosph&auml;re
gest&ouml;rten Spektrum verglichen und erh&auml;lt damit ein aktuell
selbstkalibriertes Messsignal. Gomos erm&ouml;glicht es, Ozon, andere
Spurengase und Aerosolkonzentrationen gleichzeitig zu messen und tr&auml;gt
damit auch zur Erforschung der Ozonchemie bei. Au&szlig;erdem k&ouml;nnen
Temperaturprofile in der Stratosph&auml;re sowie atmosph&auml;rische
Turbulenzen im Bereich zwischen 20 und 100 Kilometern erfasst werden. </p>

<p>Das <b>Medium Resolution Imaging Spectrometer (Meris)</b>,
Instrumenthauptauftragnehmer Alcatel SI, Frankreich, liefert Aufnahmen, die
in erster Linie f&uuml;r ozeanografische Anwendungen, aber auch f&uuml;r
atmosph&auml;rische und landorientierte Beobachtungen genutzt werden. Meris
misst die von der Erde reflektierte Sonnenstrahlung im Bereich der
optischen und der angrenzenden infraroten Wellenl&auml;ngen. Die
Beobachtungen k&ouml;nnen parallel in 15 verschiedenen frei
programmierbaren, sehr engen Spektralbereichen durchgef&uuml;hrt werden und
erlauben deshalb, die jeweiligen Beobachtungen exakt im optimal geeigneten
Spektralbereich aufzunehmen. Meris ben&ouml;tigt f&uuml;r seine Messungen
geeignetes Tageslicht und liefert eine r&auml;umliche Aufl&ouml;sung von
bis zu 250 x 250 Meter. Bemerkenswert ist die Vielseitigkeit der
Beobachtungsm&ouml;glichkeiten mit Meris: Neben der Wolkenverteilung und
Wolkenh&ouml;hen, k&ouml;nnen Meeresverschmutzungen, Algenteppiche,
Eisberge, Schadstoffeinleitungen ins Meer, aber auch Reife- bzw.
Schadenszust&auml;nde der Vegetation an Land beobachtet werden. Die
genannten Anwendungen sind nur ein anschaulicher Ausschnitt aus dem
vielf&auml;ltigen Beobachtungsspektrum dieses &auml;u&szlig;erst
interessanten Instruments. Zusammen mit dem RA-2 und dem AATSR bildet Meris
eine einzigartige Kombination zur bio-/geophysikalischen Charakterisierung
der Ozeane und ihrer K&uuml;stenzonen und damit zur Klima- und
Umweltforschung und -&uuml;berwachung. </p>

<p>Das <b>Radar Altimeter 2 (RA-2)</b>, Instrumenthauptauftragnehmer Alenia
Spazio, Italien, ist eine Weiterentwicklung des f&uuml;r ERS-1 und ERS-2
entwickelten Radarh&ouml;henmessger&auml;tes mit verbesserten und
erweiterten Anwendungsm&ouml;glichkeiten. Die Hauptaufgabe dieses
Instruments ist die Durchf&uuml;hrung von Pr&auml;zisionsmessungen der
Oberfl&auml;che der Meere, der polaren Eisregionen und seiner kurz- und
langfristigen Ver&auml;nderungen. Die Messungen &uuml;ber den Ozeanen
dienen der Bestimmung der Ozeantopografie und damit den Forschungen im
Bereich Meereszirkulation, zur Struktur des Meeresbodens und des
Meeresgeoids. Die Auswertung der Radar-Echodaten erm&ouml;glicht es
au&szlig;erdem, Windgeschwindigkeit und Wellenh&ouml;he im beobachteten
Meeresgebiet zu ermitteln und so zur Wetter- und Seegangsvorhersage
beizutragen. Das RA-2 erlaubt neben den Messungen &uuml;ber den Meeren auch
Messungen &uuml;ber Land. Diese Messdaten werden genutzt, um
gro&szlig;r&auml;umig H&ouml;henver&auml;nderungen, geologische Strukturen
und Oberfl&auml;cheneigenschaften zu bestimmen. </p>

<p>Das <b>Microwave Radiometer (MWR)</b>, Instrumenthauptauftragnehmer
Alenia Spazio, Italien, wird den Wassergehalt (Wolken, Dampf und Regen) der
Atmosph&auml;re messen. Diese Daten sind erforderlich, um Korrekturwerte
f&uuml;r die Auswertung der RA-2-Me&szlig;werte zu berechnen, mit deren
Hilfe die Genauigkeit der H&ouml;henbestimmungen des RA-2 bis auf wenige
Zentimeter genau verbessert werden kann. </p>

<p>Der von Alcatel SI, Frankreich, stammende<b> Laser Retro-Reflector
(LR)</b> dient zur Unterst&uuml;tzung der Satellitenentfernungsmessung und
zur Kalibrierung der RA-2-H&ouml;henmessungen. Mit den Messdaten des LRR
und von Doris l&auml;&szlig;t sich die Bahn des Satelliten mit
Zentimetergenauigkeit ermitteln. </p>

<p>Die im Auftrag der ESA entwickelten Instrumente werden durch drei
weitere, von nationalen Institutionen beigestellten sogenannten
Announcement of Opportunity (A.O.) - Instrumente hervorragend erg&auml;nzt,
um die gesteckten Missionsziele optimal erf&uuml;llen zu k&ouml;nnen. </p>

<p>Das <b>Scanning Imaging Absorption Spectrometer for Atmospheric
Chartography (Sciamachy)</b> ist ein abbildendes Spektrometer, das die
Atmosph&auml;re zwischen der Erdoberfl&auml;che und 90 Kilometern
Tangentialh&ouml;he abtastet, um Spurengase, Aerosole, Wolkenh&ouml;hen und
-bedeckung zu erfassen. Spurengase absorbieren das Sonnenlicht in
charakteristischer Weise. Durch die Messung von Absorptionslinien kann
Sciamachy Typ und Konzentration der Gase mit hoher Genauigkeit bestimmen.
Sciamachy erg&auml;nzt durch sein spezielles Messprinzip die anderen
Atmosph&auml;renmessinstrumente an Bord von Envisat in hervorragender
Weise. Unter anderem erm&ouml;glichen die Sciamachy-Messungen
R&uuml;ckschl&uuml;sse auf die Konzentration wichtiger Spurengase auch in
der unteren Atmosph&auml;re, die von anthropogenen Einfl&uuml;ssen
besonders betroffen ist. Dar&uuml;ber hinaus erlaubt Sciamachy die Messung
einzelner Spurengase, welche die anderen Instrumente aufgrund ihrer
Messcharakteristika nicht erfassen k&ouml;nnen. Sciamachy wurde im Rahmen
eines nationalen Auftrags des Deutschen Zentrums f&uuml;r Luft- und
Raumfahrt (DLR) von der Astrium GmbH Friedrichshafen in Zusammenarbeit mit
Fokker Space Systems in den Niederlanden entwickelt. </p>

<p>Das <b>Advanced Along Track Scanning Radiometer (AATSR)</b> ist ein die
Erde in Flugrichtung abtastendes Strahlungsmessger&auml;t, das die
Erdstrahlung im sichtbaren und infraroten Frequenzbereich misst. Es tastet
einen 500 Kilometer breiten Streifen senkrecht unter dem Satelliten mit
einer geometrischen Aufl&ouml;sung von 1 x 1 Kilometer ab. Mit AATSR kann
beispielsweise die Meeresoberfl&auml;chentemperatur mit einer Genauigkeit
von 0,1 Grad gemessen werden. Auftraggeber f&uuml;r dieses Instrument, das
unter Leitung von Astrium Ltd. gebaut wurde, ist das British National Space
Centre (BNSC). </p>

<p>Das Abstandsmessger&auml;t <b>Doris (Doppler Orbitography and
Radiopositioning Integrated by Satellite)</b> wurde im Auftrag der CNES zur
genauen Positionsbestimmung von Satelliten entwickelt und wird auf Envisat
eingesetzt. </p>

<p>Die Gesamtnutzlast von Envisat mit ihren 2050 Kilogramm Hochtechnologie
hat einen Leistungsbedarf von rund zwei Kilowatt, erfordert eine
bordseitige Datenaufzeichnungskapazit&auml;t von etwa 140 Gigabit f&uuml;r
einen Erdumlauf - das ist fast eine Verf&uuml;nffachung gegen&uuml;ber ERS
- sowie eine leistungsstarke Daten&uuml;bertragung zur Erde, die direkt
oder &uuml;ber den Telekommunikationssatelliten Artemis der ESA erfolgen
kann. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
