<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Das richtige Lernen</title>
</head>
<body background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td width=80> &nbsp; </td><td>

<p align=center><font color="#000080" size="7"><b>Richtiges Lernen</b></font></p>

<p>Zusammen mit den Halbjahreszeugnissen haben viele Sch&uuml;ler blaue
Briefe bekommen. Auch die Pisa-Studie hat gezeigt, dass deutsche Kinder im
internationalen Vergleich zu wenig lernen. Und das, obwohl sie oft mehr als
40 Stunden pro Woche mit Unterricht und B&uuml;ffeln verbringen. Die
meisten Sch&uuml;ler scheinen ihre Lernf&auml;higkeiten nicht effektiv zu
nutzen. Jede Woche werden in Deutschland 15 Millionen Euro f&uuml;r
Nachhilfeunterricht ausgegeben. Trotzdem schneiden die Leistungen deutscher
Sch&uuml;ler im internationalen Vergleich schlecht ab. Ist es m&ouml;glich,
das Lernen effektiver zu gestalten? </p>


<p><b>Doch was passiert eigentlich im Gehirn, wenn wir lernen? </b><br>

Die Grundlage unseres Ged&auml;chtnisses bilden 100 Milliarden
Nervenzellen. Das sind mehr Zellen, als Sterne in der Milchstra&szlig;e.
Jede einzelne Zelle ist mit bis zu 10 000 anderen verbunden. Sie bilden ein
hoch kompliziertes Netzwerk, das als Kabel ausgebreitet fast 10 Mal um die
Erde reichen w&uuml;rde. </p>

<p>&Uuml;ber Verbindungen im Nervennetz tauschen die Zellen
elektrochemische Signale aus. Jede Erfahrung formt ein spezielles Muster
verschiedener, aktivierter Zellen. Wissenschaftler sprechen auch davon,
dass die Nervenzellen feuern. Sind diese Signale besonders intensiv oder
werden sie mehrmals wiederholt, entstehen neue Verbindungen im Netzwerk.
Das Netz wird enger, wir haben gelernt. Erinnerungen werden also immer als
Verkn&uuml;pfungsmuster unterschiedlich vieler Nervenzellen
gespeichert.</p><p>Schon bei der Geburt sind s&auml;mtliche Nervenzellen
vorhanden, es gibt aber praktisch keine Verbindungen zwischen ihnen. Erst
wenn das Baby seine ersten Erfahrungen macht, also lernt, erfolgt auch die
erste Vernetzung. Schon nach f&uuml;nf Monaten hat sich ein dichtes
Nervennetz gebildet, das st&auml;ndig weiter ausgebaut wird. Und zwar ein
Leben lang. </p>

<p><b>Wie kommt die Vokabel ins Langzeitged&auml;chntis? </b><br>

Erinnerungen werden als Verkn&uuml;pfungsmuster unterschiedlich vieler
Nervenzellen in unserem Gehirn gespeichert. Viele dieser Muster k&ouml;nnen
wir noch nach Jahrzehnten aktivieren, andere Erinnerungen, wie zum Beispiel
die Vokabeln vom Vormittag, scheinen schnell zu verschwinden. Nur was als
stabile Nervenverbindung im Langzeitged&auml;chtnis gespeichert wird, ist
auch sp&auml;ter immer wieder abrufbar. </p>

<p>Eine Information, etwa eine Vokabel oder auch eine Telefonnummer, kann
nicht in einem einzigen Schritt im Ged&auml;chtnis abgespeichert werden.
Sie durchl&auml;uft verschiedene Ged&auml;chtnisstufen. </p>

<p>Auf dem Weg ins Ged&auml;chtnis landen alle Infos zuerst im
<b>Ultrakurzzeitged&auml;chtnis</b>. Seine Speicherkapazit&auml;t ist
begrenzt. Es kann nur ein kleines P&auml;ckchen von bis zu sechs
Aktivit&auml;tsmustern festhalten, also zum Beispiel sechs Vokabeln. Das
aber auch nur f&uuml;r ungef&auml;hr 20 Sekunden, denn im
Ultrakurzzeitged&auml;chtnis &uuml;berschreiben neue Informationen
st&auml;ndig die Erinnerungen, die schon am l&auml;ngsten dort sind. </p>

<p>Nur was st&auml;ndige wiederholt wird, gelangt ins
<b>Kurzzeitged&auml;chtnis</b>. Hier wird das Muster der aktivierten
Nervenzellen f&uuml;r etwa eine halbe Stunde sicher aufgehoben. Im
Kurzzeitged&auml;chtnis werden Inhalte also nur als Hirnaktivit&auml;t
gespeichert. </p>

<p>Das <b>Langzeitged&auml;chtnis</b> dagegen speichert Informationen in
Form von Verbindungen zwischen den Nervenzellen. Diese Dauerspeicherung
erfordert eine Umformung im Nervennetz - neue Kontakte m&uuml;ssen gebildet
werden. Das kostet Energie. Darum werden hier nur solche Informationen
gespeichert, die h&auml;ufig gebraucht, also wiederholt werden oder sehr
intensiv, also wichtig sind. Je h&auml;ufiger eine Nervenverbindung im
Langzeitged&auml;chtnis aktiviert wird, desto stabiler wird sie ausgebaut
und desto l&auml;nger h&auml;lt auch die Erinnerung. Werden
Nervenverbindungen &uuml;ber l&auml;ngere Zeit nicht angewandt, zerfallen
sie wieder, die Information wird vergessen. Abhilfe schafft eine Lerndatei.
</p>

<p><b>Wie funktioniert die Lerndatei?</b><br> Die Lernkartei ist eine
Lernmethode, die auf den Erkenntnissen, wie das Gehirn Informationen
speichert, aufbaut. In kleinen Portionen wird immer nur das wiederholt, was
noch nicht als feste Nervenbahn im Langzeitged&auml;chtnis gespeichert ist.
</p>

<p>Die Basis ist ein einfacher Pappkasten, der sich leicht selbst bauen
l&auml;sst. Er ist in f&uuml;nf unterschiedlich gro&szlig;e F&auml;cher
unterteilt. Fach eins ist das kleinste, hier passen nur etwa 30
Karteikarten hinein, die zum Beispiel mit Vokabeln, Formeln, oder
Geschichtsdaten beschrieben sind. Die F&auml;cher zwei bis f&uuml;nf sind
jeweils doppelt, drei- vier- und f&uuml;nffach so gro&szlig;. </p>

<p><b>Mit f&uuml;nf Karten zum Lernprofi</b><br>

Alle neuen Karten kommen in Fach 1. Dieses Fach soll jeden Tag bearbeitet
werden: Dazu Frage oder Vokabel auf der Karteikarte lesen, Antwort
&uuml;berlegen und auf der R&uuml;ckseite kontrollieren. War die Antwort
richtig wandert die Karte ins zweite Fach, bei Falsch bleibt die Karte wo
sie ist. Auch alle neu geschriebenen Karteikarten kommen in das erste Fach.
</p>

<p>Wenn nach einigen Tagen erfolgreichen Lernens das zweite Fach voll ist,
werden alle K&auml;rtchen aus diesem Fach wiederholt. Bei jeder richtigen
Antwort wandert die Karte in Fach drei. Nicht gewusst? Dann kommt die Karte
wieder ins allererste Fach und wird so h&auml;ufiger wiederholt. </p>

<p>Ist auch das dritte Fach voll mit Karteikarten, wird der Vorgang
wiederholt. Die richtig beantworteten Karten wandern weiter in Fach vier,
die Falschen kommen zur&uuml;ck in Fach eins. Das gleiche gilt auch
f&uuml;r die F&auml;cher vier und f&uuml;nf, die jeweils erst Wochen oder
sogar Monate sp&auml;ter zur Wiederholung dran kommen. </p>

<p>Alle richtigen Antworten aus Fach f&uuml;nf fliegen aus dem
Karteikasten. Denn ihr Inhalt sitzt bombenfest im Langzeitged&auml;chtnis
und muss f&uuml;r lange Zeit nicht mehr wiederholt werden. </p>

<p>Eine Quintessenz verbei&szlig;e ich mir, jeder sollte in sich gehen und
intensiv &uuml;berlegen, ob er nicht doch mit dieser Methode beginnen
sollte. </p>

<table border="8" width=100% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff" size=-1><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff" size=-1><b> http://www.wozim.de </font></b>
</td></tr></table>
</td></tr></table>
<br>
</body>
</html>
