<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Lapacho Tee aus der Rinde eines Riesenbaumes</title>
</head>
<body background="wolf1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td>
<p align=center><font color="#000080" size="7"><b>Lapacho</b></font></p>

<p> <b>Lapacho ist der Sammelbegriff f&uuml;r eine Rindendroge
S&uuml;damerikas. In der Volksmedizin hat Lapacho einen hohen
Bekanntheitsgrad. Er gilt dort als Allheilmittel &auml;hnlich wie Ginseng
in Asien.</b> </p>

<center>
<table border=1 width=90%><tr bgcolor="#ffffee"><td>
<p><b>Grundrezept Lapacho-Tee (4 Tassen)</b><br>1 Liter Wasser in einem
Topf zum Kochen bringen. 2 gestrichene EL Lapacho-Rinde dazu geben.
Kr&auml;ftig aufkochen lassen. Die Rinde bei geringer W&auml;rmezufuhr etwa
5 Minuten leicht kochen lassen. Dann vom Herd nehmen und zugedeckt 15 bis
20 Minuten ziehen lassen. Anschlie&szlig;end den Tee durch ein feines Sieb
abgie&szlig;en. Der Tee kann hei&szlig;, aber auch kalt getrunken werden.
Man sollte ihn allerdings nur aus Glas- oder Porzellantassen zu sich
nehmen. Zur Geschmacksverbesserung eignen sich Honig, Rohrzucker oder etwas
Sahne. </p>

<p><b>Lapacho-Vollbad</b><br>1 Liter Wasser in einem Topf zum Kochen
bringen. 3 EL Lapacho-Rinde dazu geben und kr&auml;ftig aufkochen lassen.
15 Minuten weiterkochen, dann 15 Minuten zugedeckt ziehen lassen. Den Sud
abseihen und in die mit warmem Wasser (etwa 34 Grad) gef&uuml;llte
Badewanne geben. Ein kr&auml;ftiger Schuss frische Schlagsahne macht das
Bad noch hautfreundlicher. H&ou ml;chstens 20 Minuten baden. Die
Zus&auml;tze regen die Hautdurchblutung an, lockern die Muskulatur und
wirken allgemein schmerzlindernd. Ein Vollbad empfiehlt sich beispielsweise
nach sportlicher Bet&auml;tigung oder schwerer k&ouml;rperlicher
Anstrengung. </p>

<p><b>Lapacho-Mundsp&uuml;lung</b><br>Lapacho-Tee nach Grundrezept
herstellen. Dann 1 EL Kiesels&auml;urebalsam in einem Glas lauwarmen Tee
aufl&ouml;sen. Den Mund mehrmals kr&auml;ftig damit sp&uuml;len. Bei
Entz&uuml;ndungen des Rachenraumes oder "Kratzen im Hals" mehrmals am Tag
mit dieser L&ouml;sung gurgeln. Dem Tee wird eine antibakterielle und
entz&uuml;ndungshemmende Wirkung zugesprochen. Die Sp&uuml;lung kann auch
bei Zahnfleischentz&uuml;ndungen und Mundgeruch eingesetzt
werden.<p><b>Lapacho-Kompressen</b><br>Bei kleineren Hautverletzungen oder
Absch&uuml;rfungen k&ouml;nnen Mullauflagen mit Lapacho-Tee (Grundrezept)
die Heilung beschleunigen. Getr&auml;nkte Tupfer mehrmals t&auml;glich
f&uuml;r etwa 30 Minuten auf die betroffenen Stellen legen. </p>
</td></tr></table></center>

<p>Das war der Inhalt einer ZDF-Sendung Praxis dieser Tage und hat mich
etwas neugierig gemacht. So bin ich also ins Internet und habe mich ein
klein wenig umgeschaut. </p>

<p>Lapacho stammt von den B&auml;umen der Regenw&auml;lder, deren Rinde nur
gesch&auml;lt wird und wieder nachw&auml;chst. Die Lapacho-Rinde besitzt
einen f&uuml;r Pflanzen ungew&ouml;hnlich hohen Mineralstoff- und
Spurenelementgehalt. Neben Kalzium, Eisen und Kalium findet man auch
seltene Spurenelemente wie Barium, Jod, Bor usw., die dem menschlichen
K&ouml;rper oft fehlen. Ein Naturtee, der seit Jahrtausenden von den Inkas
und deren Nachfahren wegen seiner wohltuenden Wirkung gesch&auml;tzt wird.
</p>

<p> <b>Die besten Effekte werden bei kurm&auml;&szlig;iger Anwendung
erzielt:</b> (wird behauptet) <br> Ungef&auml;hr sechs Wochen t&auml;glich
einen bis einundhalb Liter Tee am besten auf n&uuml;chternen Magen trinken.
W&auml;hrend dieser Zeit auf Fleisch, Kaffee, Alkohol und haltbar gemachte
Milchprodukte verzichten sowie den Verzehr von Zucker und
Wei&szlig;mehlprodukten mindestens stark reduzieren. </font>

<p>Ganz allgemein kann &uuml;ber Lapacho-Tee gesagt werden: Er hebt die
Vitalit&auml;t, belebt und schafft ein Gef&uuml;hl des Wohlbehagens.
(gefundener Preis: 100 g - Preis 3,55 EUR) </p>

<p>Es gibt wirklich sehr viele Informationen, aber der Inhalt der Website
<font color="#000080"><b>www.der-bioladen.de </b> </font> reichte f&uuml;r
mein Informsationsbed&uuml;rfnis vollkommen aus und so kann ich es mir
nicht verkneifen, euch damit zu behelligen und diesen hier vorzustellen.
</p>

<p><img src="st_lapacho1.jpg" align=left hspace=6>

<font size=+1><b>Inka-Tee, Lapacho-Rindentee </b></font><br> Unter diesen
Namen sorgt Lapacho seit etwa 1997 f&uuml;r Schlagzeilen in verschiedenen
Medien. Hochgelobt werden die verschiedenen Wirkungen des Lapacho. Ein
ganzes Buch ist mittlerweile erschienen, das die vielen positiven
Eigenschaften des Lapacho hervorhebt. Selbstverst&auml;ndlich bieten wir es
in der Warengruppe B&uuml;cher auch an. Wir m&ouml;chten Sie aus diesem
Grund gleich zu Beginn darauf aufmerksam machen, dass eine
gesundheitsbezogene Werbung aus einem sogenannten Genusstee flugs ein
Heilmittel macht. Und mit Heilmitteln d&uuml;rfen nur Heilkundige sprich
&Auml;rzte, Heilpraktiker, Apotheker,... umgehen. </p>

<p>Beschr&auml;nken wir uns deshalb auf die &quot;messbaren
lnhaltsstoffe&quot; der roten Rinde des Riesenbaumes: hoher Mineralstoff-
und Spurenelementgehalt, sowie Kalzium, Kalium, Eisen, Strontium, Bor, Jod,
Barium. Letztere geh&ouml;ren zu den in der Nahrung eher seltenen
Elementen. Sie scheinen eine wohltuende Wirkung auf den gesamten Organismus
zu haben. </p>

<p>Lapacho enth&auml;lt kein Tein - ist also zu jeder Tages- und Nachtzeit
zu genie&szlig;en. </p> <br clear=all>


<p><font size=+1><b>Lapacho-Tee aus S&uuml;damerika </b></font> <br>

Im tropischen Regenwald des Amazonas-Gebietes ist der Baum Tabebuia
avellanedoe beheimatet. F&uuml;r die Gewinnung der inneren, roten Rinde
werden Streifen l&auml;ngs am Baum abgesch&auml;lt. Dabei wird die
saftf&uuml;hrende Schicht des Baumes nicht verletzt. So wird dem Baum kein
Schaden zugef&uuml;gt, denn die Rindenschichten wachsen wieder nach. Es
kann ganzj&auml;hrig geerntet werden. </p>


<p><font size=+1><b>Warum nicht zertifiziert? </b></font> <br>

Hier stie&szlig;en wir mit unseren europ&auml;ischen Vorstellungen lange
Zeit auf Unverst&auml;ndnis. Warum sollten irgendwelche Mammutb&auml;ume
zertifiziert werden, die schon lange vor uns da waren? Da wir bis vor
kurzem keinen direkten Kontakt nach Brasilien hatten, mussten wir uns damit
vorl&auml;ufig zufrieden geben. Doch wir haben weiterhin versucht, Kontakte
herzustellen. Es kursieren derzeit immer mehr Ger&uuml;chte, dass der
meiste Lapacho von B&auml;umen geerntet wird, die in die Holzindustrie
wandern - also nicht mehr weiterleben. Da wir diese Praxis auf keinen Fall
unterst&uuml;tzen wollten, haben wir uns nach einem Partner umgesehen, der
selbst vor Ort ist und uns garantiert, dass unser Lapacho nur von lebenden
B&auml;umen geerntet wurde. </p>


<p><font size=+1><b>Der Beginn einer Partnerschaft </b></font> <br>

Es ist uns gelungen, einen Partner zu finden, der sehr enge
Brasilien-Kontakte hat und der bereit ist, den Weg der zertifizierten
Lapacho-Ernte in Brasilien zu ebnen. Auch ihm ist es ein Anliegen, an der
Abholzung der W&auml;lder nicht beteiligt zu sein. Er ist sehr h&auml;ufig
in Brasilien und ist dort dabei, Menschen zu &uuml;berzeugen, dass die
Lapacho-B&auml;ume zur Teegewinnung und nicht f&uuml;r die Holzindustrie
verwendet werden. </p>

<p>Er kn&uuml;pfte schon Kontakte mit dem Institut Biodynamico. Wir
erhoffen uns von diesem Institut Antworten auf einen Teil der vielen
Fragen, die bei solch einem Projekt auftauchen und nach L&ouml;sungen
suchen: Wie muss der Mondstand sein, damit sich die B&auml;ume
m&ouml;glichst schnell wieder erholen? Wie viel darf &uuml;berhaupt von der
Rinde abgesch&auml;lt werden, ohne dem Baum zu schaden? Ist es sinnvoll,
den Baum an den &quot;kahlen&quot; Stellen wieder mit einer d&uuml;nnen
Schicht Rinde zu bedecken, um ihn so vor Insektenbefall zu sch&uuml;tzen
oder bringt diese Ma&szlig;nahme wenig? In welchen Anlagen soll dann der
zertifizierte Lapacho verarbeitet werden? Welche Menschen sind vor Ort
dauerhaft f&uuml;r die Einhaltung unserer Richtlinien verantwortlich? </p>

<p>Wir sind zuversichtlich, dass wir f&uuml;r all diese Fragen in den
n&auml;chsten Monaten L&ouml;sungen und Wege finden werden, so dass wir
Ihnen hoffentlich noch in diesem oder dem n&auml;chsten Jahr zertifizierten
Lapacho anbieten k&ouml;nnen -dr&uuml;cken Sie uns die Daumen! </p>


<p><font size=+1><b>Die Zubereitung </b></font><br>

1 geh&auml;uften EL Lapacho mit 1/2 bis 3/4 Liter Wasser aufkochen. Dann 5
Minuten k&ouml;cheln und 15 Minuten ziehen lassen. Das ergibt einen
angenehm, w&uuml;rzigen Tee. Zitronensaft verleiht ihm einen leicht
fruchtigen Geschmack. Wer es lieber etwas &quot;softer&quot; mag und nicht
soviel Zeit investieren will, kann den Tee auch einfach mit kochendem
Wasser &uuml;berbr&uuml;hen und 5-10 Minuten ziehen lassen. </p>

<p>Die zweite, einfachere Methode wurde von uns mehrfach getestet, vor
allem der aromatisierte Lapacho-Tee schmeckt auf diese Weise wunderbar!
</p>

<p><font size=+1><b>Lapacho, aber bitte mit.... </b></font> <br>

Auch haben wir ab sofort aromatisierten Lapacho im Sortiment. Lapacho liegt
derzeit absolut im Trend und doch m&ouml;gen viele Menschen den puren
Lapacho-Geschmack einfach nicht! Deshalb bieten wir mit dem Lapacho Orange
hier eine Alternative. </p>


<p><img src="st_lapacho2.jpg" align=left hspace=6> <font size="+1"><b>Das
rote Inkagold </b></font><br> Mit seinen leuchtend roten Bl&uuml;ten sticht
der Lapachobaum (Tabebuia Avellanedae) aus dem dichten Gr&uuml;n des
tropischen Regenwaldes hervor. In S&uuml;d- und Mittelamerika ist dieser
hochgewachsene Baum beheimatet. </p>

<p>Der Lapachotee wird aus seiner inneren roten Rinde gewonnen.
Charakteristisch ist der feine Duft nach Vanille und Anis. </p>

<p>Der Tee aus dem Regenwald hat viele Namen, er wird unter anderem auch
als Inkatee, roter Lapachotee und Lapacho-Rindentee bezeichnet. </p>

<p>Tabebuia Avellanedae geh&ouml;rt zur Pflanzenfamilie der Bignonicea
(Trompetenblumengew&auml;chse). Voll ausgewachsen erreicht der Baum eine
H&ouml;he von bis zu 25m und einen Stammdurchmesser von bis zu 75cm. In den
H&ouml;henlagen der Anden erreicht der Lapachobaum ein stolzes Alter von
bis zu 700 Jahren. Die wundersch&ouml;nen, trompetenf&ouml;rmigen
Bl&uuml;ten dieses Baumes sind Insektenparadiese. Ameisen besiedeln sehr
gerne das abgestorbene Holz der Lapachob&auml;ume. </p>

<p>Die &auml;u&szlig;ere Rinde dieses tropischen Baumes ist sehr hart und
dekorativ. Schon die Ureinwohner Mittelamerikas benutzten dieses Holz zur
Herstellung von B&ouml;gen. Sp&auml;ter wurde es aufgrund seiner
ausgezeichneten mechanischen Eigenschaften auch zum Schiffsbau verwendet.
</p>

<p><font size=+1><b>Die Geschichte des Lapacho </b></font> <br>

Geschichtliche &Uuml;berlieferungen sage aus, dass Lapachotee von vielen
Kulturen seit Jahrhunderten hoch gesch&auml;tzt wird. Schon die Inkas
verwendeten die innere Rinde des Lapachobaumes als Heilpflanze f&uuml;r die
unterschiedlichsten Krankheiten. Die Nachkommen der Inkas, insbesondere die
Callaway-Indianer, setzten diese Tradition fort - zur Heilung von Wunden
legten sie die Rindenst&uuml;cke direkt auf die betroffenen Hautpartien,
die innere Anwendung erfolgte mit einem Absud aus den Rindenst&uuml;cken.
Die Wikinger tauschten die Rinde des Urwaldbaumes gegen Edelsteine ein und
brachten die &quot;Wunderdroge&quot; nach Europa. </p>

<p><img src="st_lapacho3.jpg" align=left hspace=6> Viele Geschichten ranken
um den roten Lapachotee und seine Wirkungen. Erste wissenschaftliche
Untersuchungen wurden in den sechziger Jahren des 20. Jahrhunderts gemacht.
Dr. Theodor Meyer von der staatlichen Universit&auml;t in Tucuman
Argentinien untersuchte die chemische Zusammensetzung der Lapachorinde.
Dabei entdeckte er unter anderem ein nat&uuml;rliches Antibiotikum. Weitere
wissenschaftliche Untersuchungen in verschiedenen L&auml;ndern zeigten,
dass der Tee eine einmalige Kombination aus Mineralstoffen und
Spurenelementen enth&auml;lt: Kalzium, Eisen, Kalium, Kupfer, Bor, Mangan,
Magnesium, sowie Jod. </p>

<p>Daraus ergeben sich eine ganze Reihe positiver Wirkungen auf das
menschliche Wohlbefinden. &Uuml;ber eine auf Ihre Bed&uuml;rfnisse
abgestimmte Anwendung dieser Rinde aus S&uuml;damerika finden Sie Rat bei
Ihrem Heilpraktiker oder in B&uuml;chern &uuml;ber Lapacho, wie z.B.:
&quot;<b>Heilen mit Lapacho Tee</b>&quot; von Walter L&uuml;beck
(erh&auml;ltlich bei der-bioladen.de). </p> <br clear=all>

<p><font size=+1><b>Die Zubereitung von Lapacho </b></font><br>

Frei von Tein und anderen aufputschenden Stoffen ist Lapachotee f&uuml;r
jedes Alter und f&uuml;r jede Tageszeit ein geeignetes Getr&auml;nk.
Lapachotee muss l&auml;ngere Zeit kochen bzw. ziehen, deshalb ist es
empfehlenswert, gleich gr&ouml;&szlig;ere Mengen Tee zuzubereiten. </p>

<p>Die Rinde wird in kochendes Wasser gegeben, mit reduzierter Hitze den
Tee 5 Minuten k&ouml;cheln, anschlie&szlig;end zugedeckt 15 bis 20 Minuten
ziehen lassen. Danach wird der Tee durch ein feines Sieb geseiht und in
eine Thermoskanne gegeben oder sofort serviert. F&uuml;r die Zubereitung
von Lapachotee eignet sich ein Gef&auml;&szlig; aus Glas, Porzellan oder
Keramik. Aluminium sollte nie verwendet werden. </p>

<p><img src="st_lapacho4.jpg" align=left hspace=6> Eine sehr w&uuml;rzige
Note entfaltet der Tee bei einem l&auml;ngeren Ziehenlassen. Diese Variante
ist bei Lapacho-Kennern sehr beliebt, f&uuml;r Anf&auml;nger jedoch eher
gew&ouml;hnungsbed&uuml;rftig. Mit Sahne, Honig oder Zitronensaft kann der
nat&uuml;rliche Geschmack von Lapachotee verfeinert werden.
Experimentierfreudige Teetrinker zaubern mit Hilfe von Fr&uuml;chten,
S&auml;ften und Gew&uuml;rzen w&auml;rmende und erfrischende
K&ouml;stlichkeiten. </p>

<p>Auch <font color="#000080"><b>www.der-bioladen.de</b></font> bietet
Ihnen eine Lapachomischung mit nat&uuml;rlichem Aroma an. ACHTUNG: Die
aromatisierten Lapachotees sollten nicht k&ouml;cheln, sondern nur ziehen,
da sonst das wertvolle Aroma verloren geht. Probieren Sie einfach
verschiedene Tees, Dosierungen und Zubereitungsvarianten aus, um Ihren
Lieblings-Lapacho-Tee zu entdecken. </p><br clear=all>

<p><font size=+1><b>Die sanfte Sch&ouml;nheitspflege </b></font> <br>

Lapacho eignet sich aufgrund seiner pflegenden Eigenschaften hervorragend
f&uuml;r kosmetische Anwendungen. Ihre Haut wird gestrafft, gegl&auml;ttet
sowie erfrischt, die Durchblutung wird gef&ouml;rdert und die
Hautfunktionen angeregt. So bietet sich z.B. warmer Lapacho zur
t&auml;glichen Reinigung an. Danach wie gewohnt die Gesichtspflege
auftragen. </p>

<p>Wohltuende Packungen aus Heilerde und Lapacho erweitern das
Sch&ouml;nheitsprogramm. Einfach Lapacho-Tee anstatt Wasser zum
Anr&uuml;hren von Heilerde verwenden. Die Packung eine halbe Stunde
einwirken lassen, danach mit warmem Wasser absp&uuml;len. Sie sp&uuml;ren
sofort die reinigende und belebende Wirkung. </p>

<p>Waschungen mit kaltem Lapachotee sorgen f&uuml;r eine vitale und
geschmeidige Haut. Dazu ben&ouml;tigen Sie ca. 2 Liter Lapachotee, den Sie
mit etwas Zitronensaft vermischen. </p>

<p>F&uuml;r ein pflegendes Vollbad ben&ouml;tigen Sie einen Liter starken
Lapacho-Tee. Apfelessig unterst&uuml;tzt die regenerierende Wirkung von
Lapacho - geben Sie 200ml davon in eine Badewannenf&uuml;llung. Die
Badezeit sollte mindestens 15 Minuten betragen. Um die Durchblutung zu
f&ouml;rdern und den Kreislauf anzuregen, k&ouml;nnen Sie vor dem Baden
eine B&uuml;rstenmassage mit einem entsprechenden Handschuh
durchf&uuml;hren. Zur sanften Haarpflege eignet sich hervorragend eine
Sp&uuml;lung aus Lapachorinde und Kamille. &Uuml;bergie&szlig;en Sie dazu
einen Essl&ouml;ffel Kamille mit einem halben Liter frisch gekochtem
Lapacho-Tee und lassen Sie diese Mischung 15 Minuten ziehen.
Anschlie&szlig;end geben Sie diese durch ein Sieb. Nach dem Waschen
sp&uuml;len Sie damit Ihre Haare. </p>

<p>Wer sich nicht so viel M&uuml;he machen m&ouml;chte, aber trotzdem gerne
in den Genuss der K&ouml;rperpflege mit Lapacho kommen m&ouml;chte,
f&uuml;r den gibt es bei <font
color="#000080"><b>www.der-bioladen.de</b></font> eine kleine, aber feine
Auswahl von Lapacho-Kosmetik. </p>

<p>Wer also noch mehr erfahren m&ouml;chte, besuche doch bitte die
angesprochene Website. </p>

</td></tr></table>
<center>
<table border="8" width=95% cellspacing=0 cellpadding=8>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff"><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff"><b> http://www.wozim.de </font></b>
</td></tr></table>
<br>
</body>
</html>
