<!-- saved from url=(0022)http://internet.e-mail -->
<html>
<head>
<title>"der gl&auml;serene Mensch"</title>
</head>
<body background="cordbg1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="7"><b>Der gl&auml;serne Mensch
</b></font></p>

<p>Die US-Firma Applied Digital Solutions bietet Microchips f&uuml;r
Menschen an, die dann unter der Haut eingepflanzt werden. Lt. &quot;Los
Angeles Times&quot; werden diese Chips alle wichtigen Daten &uuml;ber die
jeweilige Person gespeichert haben. Das sollen vor allem medizinische Daten
sein, die dann jederzeit mit einem entsprechendem Scanner wieder gelesen
werden k&ouml;nnen. </p>

<p>Der Hersteller empfiehlt zwar, dass diese Kennzeichnung besonders
Patienten mit k&uuml;nstlichen Organen f&uuml;r eine schnelle
Identifizierung in medizinischen Notf&auml;llen verwendet werden
k&ouml;nnte, stellt sich aber auch den Einsatz zur Suche nach
entf&uuml;hrten Personen oder entflohenen Str&auml;flingen mit dem
implementierten &quot;Ausweis&quot; vor. Per GPS, dem Global Positioning
System k&ouml;nnen diese Personen jederzeit und &uuml;berall fast weltweit
sofort lokalisiert werden. </p>

<p>&quot;Ich w&auml;re &uuml;berrascht, wenn wir in zehn Jahren nicht einen
Chip unter der Haut haben, mit dem man sein Haus aufschlie&szlig;t, das
Auto startet und Geld abhebt&quot;, meinte Chris Hables Gray,
Computerprofessor von der Universit&auml;t Great Falls in Montana. Applied
Digital stellt bereits elektronische Chips f&uuml;r Tiere her, mit denen
Landwirte ihre Herden &uuml;berwachen k&ouml;nnen. Ein weiteres Produkt
sind Armb&auml;nder f&uuml;r Alzheimerpatienten, durch die der jeweilige
Aufentshaltsort der Person festgestellt werden kann. </p>

<hr size=1 width=80% noshade>

<p>Ehrlich gesagt weiss ich nicht, ob ich es nicht erschreckend finden
soll, was in den K&ouml;pfen einiger Menschen vor sich geht. Vielleicht hat
man einfach auch zu viele Science-Fiction-Filme gesehen, in denen ganze
V&ouml;lker durch derartige &quot;Technologien&quot; kontrolliert und deren
Leben gesteuert wurden. Auf der einen Seite gibt es immer sehr sinnvolle
und menschliche Fortschritte solcher Techniken, wenn zB. vermisste Personen
lokalisiert werden k&ouml;nnen noch bevor ihnen etwas Schlimmeres
zust&ouml;&szlig;t. Oder aber im Bereich der Lebensrettung bei verunfallten
Menschen. Und auf der anderen Seite steht immer der negative Aspekt, dass
einige Menschen stets die Leben anderer Menschen kontrollieren k&ouml;nnen.
Der Landwirt kann heute seine Herde kontrollieren, aber wer wird morgen der
Landwirt und was die Herde sein? Und wer m&ouml;chte schon gern ein
gl&auml;serner Mensch sein? </p>

<p>Aufgeschnappt und kommentiert von <br>
Higgins <br>
Cord Hagen </p>

</td></tr></table>
<br>
</body>
</html>
