<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>Wolf hat wieder nichts zum Amiga zu sagen</title>
</head>
<body background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td width=80> &nbsp; </td><td>
<p align=center><font color="#000080" size="7"><b>PISA Studie</b></font></p>

<p>Nun haben es Lehrer und Politiker von einem internationalen Gremium
attestiert bekommen: Das Bildungsniveau der deutschen Sch&uuml;ler ist
alarmierend tief gesunken. Woran liegt's? </p>

<p>Der Spiegel schreibt: </p>

<p><b>PISA-FIASKO:</b> Das Land der Dichter und Denker - abgeh&auml;ngt</p>

<p>Die Sch&uuml;ler schmollen, Lehrer grollen, die Bildungspolitiker raufen
sich die Haare oder spielen Schwarzer Peter. Derweil wird Pisa zur harten
W&auml;hrung der internationalen Schulbildung -weil es in der Studie um
Lebenst&uuml;chtigkeit, nicht um B&uuml;cherwissen geht. </p>

<p>Dass mit dem Deutschunterricht etwas nicht stimmt, ahnte bereits
l&auml;nger auch die Runde der deutschen Kultusminister. Im Auftrag der KMK
gab der Hamburger Staatsrat und Pisa-Organisator Hermann Lange schon im
vergangenen Jahr mehrere Expertisen &uuml;ber den Zustand der Philologie an
deutschen Gymnasien in Auftrag. Das Ergebnis war so entmutigend, dass die
Auftraggeber von einer Ver&ouml;ffentlichung absahen. </p>

<p>Vernichtend das Urteil des Augsburger Germanistikprofessors Kaspar
Spinner: Die Deutsch-Lehrpl&auml;ne seien so &uuml;berf&uuml;llt, das
sinnvoller Unterricht gar nicht mehr m&ouml;glich sei. "Die Inhalte werden
nacheinander durchgenommen und abgehakt." </p>

<p>Dem gymnasialen Unterricht in der Mittel- und Oberstufe mangle es an
Methoden, "die auf Erkenntnissen zum Wissens- und F&auml;higkeitserwerb
beruhen". "Lesef&ouml;rderung", merkte der T&uuml;binger Kollege Thomas
Kopfermann an, reduziere sich allzu oft "auf den gut gemeinten Rat, zum
guten Buch zu greifen". </p>

<p>Bei der Lesef&auml;higkeit, Schwerpunkt der Pisa-Untersuchung, zeigen
die Kinder hier zu Lande alarmierende Defizite: <ul>

<li>Fast zehn Prozent der Befragten mangelt es an jeglichem
Textverst&auml;ndnis. Diese Sch&uuml;ler scheitern schon an der Aufgabe,
einfache Informationen in einem Text aufzusp&uuml;ren. Mehr Leseversager
als in Deutschland gibt es nur noch in Lettland, Luxemburg, Mexiko und
Brasilien. </li>

<li> Weitere 13 Prozent schaffen es nur gerade eben, elementarste Inhalte
von Texten zu begreifen. G&auml;nzlich &uuml;berfordert sind sie, wenn sie
das Gelesene bewerten oder einen simplen Bezug zum Alltagswissen herstellen
sollen. "Der Anteil der schwachen und extrem schwachen Leser ist mit fast
23 Prozent f&uuml;r Industriestaaten ungew&ouml;hnlich hoch", urteilt
J&uuml;rgen Baumert vom Berliner Max-Planck-Institut f&uuml;r
Bildungsforschung, der die Pisa-Daten f&uuml;r Deutschland ausgewertet hat.
</li>

<li>Typische schwache Leser sind laut Pisa m&auml;nnliche Jugendliche aus
Migrantenhaushalten oder aus sozial benachteiligten Familien. M&auml;dchen
schneiden beim Leseverst&auml;ndnis wesentlich besser ab als Jungen.
</li></ul>

<p><b>&Ouml;fter mal ein M&auml;rchen </b></p>

<p>Sorgen bereitet der CDU-Politikerin im Stuttgarter Neuen Schloss die
Lesefeindlichkeit der Eltern. In zahlreichen Familien werde kaum einmal ein
Buch oder eine Tageszeitung aufgeschlagen: "Vielen Kindern ist, als sie
klein waren, nie ein M&auml;rchen vorgelesen worden." So w&uuml;rden die
Wurzeln f&uuml;r eine positive Beziehung zu B&uuml;chern und Texten von
vornherein fehlen. Deshalb m&uuml;sse in den ersten Schuljahren der
Sprachunterricht verst&auml;rkt werden: "Die Grundschule ist pr&auml;gend."
</p>

<p>"Der Erwerb der Schriftsprache gilt am Ende der Grundschule als
abgeschlossen - danach gibt es keine systematische Lesef&ouml;rderung
mehr", sagt Baumert. Das Vertrauen darauf, dass sich das Lesen per
Selbstregulierung einstelle, sei bei den pubertierenden Penn&auml;lern
leichtfertig. Dabei entscheide sich gerade in diesem Alter: "Leseratte oder
nicht." </p>

<p>Rund 4000 Jugendliche und fast 700 Deutschlehrer hat der Regensburger
Literaturwissenschaftler Kurt Franz im Rahmen eines Forschungsprojekts zum
Leseverhalten befragt. Franz wollte wissen, ob und was die Sch&uuml;ler in
ihrer Freizeit lesen und mit welchen Methoden die Pflichtlekt&uuml;re in
der Schule pr&auml;sentiert wird. </p>

<p>Das Ergebnis best&auml;tigt den Pisa-Befund: Lesen ist ziemlich out. Vor
allem die Jungs zeigten wenig Neigung zum Buch - sie bilden die
&uuml;berwiegende Mehrheit der Nichtleser. <hr width=80% size=1 noshade>
Ende das Zitats.</p>


<p> <b>PISA-Studie: Verdummen die Deutschen?</b> <br> Eine
gro&szlig;angelegte Untersuchung im Auftrag der OECD bescheinigt deutschen
Sch&uuml;lerinnen und Sch&uuml;lern mangelhafte Noten in den mathematischen
Kompetenzen und dem Leseverst&auml;ndnis. </p>

<p>Nach den Ergebnissen der TIMSS-Studie (Third International Mathematics
and Science Study) h&auml;tte man hierzulande eigentlich vorgewarnt sein
m&uuml;ssen. Darin schnitten die deutschen Sch&uuml;lerinnen und
Sch&uuml;ler bereits im unteren Mittelfeld ab. Jetzt wurden die Ergebnisse
von PISA (Programme f&uuml;r International Student Assessment)
ver&ouml;ffentlicht - und das Ergebnis ist verheerend. </p>

<p><b>Was gepr&uuml;ft wurde</b><br> PISA untersuchte bei 15-j&auml;hrigen
in 31 L&auml;ndern die Basiskompetenzen in den Bereichen
Leseverst&auml;ndnis, Mathematik und Naturwissenschaft. Au&szlig;erdem
wurde analysiert, ob die Probanden zu selbst&auml;ndigem Lernen f&auml;hig
und wie hoch ihre Kooperations- und Kommunikationsf&auml;higkeiten
einzusch&auml;tzen sind.

PISA verzichtete bewusst auf die Abfrage l&auml;nderspezifischen
Lernstoffes. Das Ergebnis: Von den 31 teilnehmenden L&auml;ndern erreichte
Deutschland im Bereich Mathematik und Naturwissenschaften Platz 20, im
Bereich Leseverst&auml;ndnis nur Platz 21. </p>


<p>W&auml;hrend des rund dreist&uuml;ndigen Testes mussten die
Sch&uuml;lerinnen und Sch&uuml;ler unter anderem Texte lesen, analysieren
und Inhaltsfragen beantworten. Im Bereich Mathematik und
Naturwissenschaften wurden ihnen Rechenaufgaben und Fragen zu
naturwissenschaftlichen Themen gestellt. Die Aufgaben waren in
Kompetenzstufen von I (leicht) bis V (schwer) aufgeteilt. Auch wenn
einzelne Ergebnisse von PISA noch tiefgr&uuml;ndiger ausgewertet werden
m&uuml;ssen, geben die bisherigen Befunde genug Anlass zur Sorge: So
erreichten zehn Prozent der Sch&uuml;lerinnen und Sch&uuml;ler nicht einmal
die niedrigste Kompetenzstufe im Lesen - so viele wie in keinem anderen
untersuchten Land. Auch bei der Leseunlust sind die deutschen Jugendlichen
Spitze. W&auml;hrend in Finnland gerade mal 22 Prozent der Befragten
angaben, dass sie nicht zum Vergn&uuml;gen lesen w&uuml;rden, waren es in
Deutschland 42 Prozent. Auch bei der Mathematik und in den
Naturwissenschaften schnitten deutsche Jugendliche schlecht ab. Nur 24
Prozent erreichten die Kompetenzstufe III, was die F&auml;higkeit zur
L&ouml;sung einfacher Prozentrechnung ausdr&uuml;ckt. Weitere 24 Prozent
der 15-j&auml;hrigen erreichten gerade mal Stufe I - also mathematisches
Grundschulniveau. </p>

<p>Und so sieht es tabellarisch aus:
<table width=100% border=1>
<tr><td colspan=3><font size="+2"><b>Rangliste</b></font></td></tr>
<tr bgcolor="#a0a0a0"><td width=33%>Lesekompetenz</td>
<td width=33%>Mathematik </td>
<td width=34%>Naturwissenschaften</td></tr>
<tr><td>Finnland </td><td>Japan</td><td>Korea </td></tr>
<tr><td>Kanada</td><td>Korea </td><td>Japan </td></tr>
<tr><td>Neuseeland </td><td>Neuseeland </td><td>Finnland </td></tr>
<tr><td>Australien </td><td>Finnland </td><td>Gro&szlig;britannien </td></tr>
<tr><td>Irland </td><td>Australien </td><td>Kanada </td></tr>
<tr><td>Korea </td><td>Kanada </td><td>Neuseeland </td></tr>
<tr><td>Gro&szlig;britannien </td><td>Schweiz </td><td>Australien </td></tr>
<tr><td>Japan </td><td>Gro&szlig;britannien </td><td>&Ouml;sterreich </td></tr>
<tr><td>Schweden </td><td>Belgien </td><td>Irland </td></tr>
<tr><td>&Ouml;sterreich </td><td>Frankreich </td><td>Schweden </td></tr>
<tr><td>Belgien </td><td>&Ouml;sterreich </td><td>Tschechien </td></tr>
<tr><td>Island </td><td>D&auml;nemark </td><td>Frankreich </td></tr>
<tr><td>Norwegen </td><td>Island </td><td>Norwegen </td></tr>
<tr><td>Frankreich </td><td>Liechtenstein </td><td>USA </td></tr>
<tr><td>USA </td><td>Schweden </td><td>Ungarn </td></tr>
<tr><td>D&auml;nemark </td><td>Irland </td><td>Island </td></tr>
<tr><td>Schweiz </td><td>Norwegen </td><td>Belgien </td></tr>
<tr><td>Spanien </td><td>Tschechien </td><td>Schweiz </td></tr>
<tr><td>Tschechien </td><td>USA </td><td>Spanien </td></tr>
<tr><td>Italien </td><td bgcolor="#ff0000"><font color="#ffffff">Deutschland</font> </td>
    <td bgcolor="#ff0000"><font color="#ffffff">Deutschland</font> </td></tr>
<tr><td bgcolor="#ff0000"><font color="#ffffff">Deutschland</font> </td>
    <td>Ungarn </td><td>Polen </td></tr>
<tr><td>Liechtenstein </td><td>Russland </td><td>D&auml;nemark </td></tr>
<tr><td>Ungarn </td><td>Spanien </td><td>Italien </td></tr>
<tr><td>Polen </td><td>Polen </td><td>Liechtenstein </td></tr>
<tr><td>Griechenland </td><td>Lettland </td><td>Griechenland </td></tr>
<tr><td>Portugal </td><td>Italien </td><td>Russland </td></tr>
<tr><td>Russland </td><td>Portugal </td><td>Lettland </td></tr>
<tr><td>Lettland </td><td>Griechenland </td><td>Portugal </td></tr>
<tr><td>Luxemburg </td><td>Luxemburg </td><td>Luxemburg </td></tr>
<tr><td>Mexiko </td><td>Mexiko </td><td>Mexiko </td></tr>
<tr><td>Brasilien </td><td>Brasilien </td><td>Brasilien </td></tr>
</table>

<p><b>Miese Zeugnisse f&uuml;r Lehrer</b><br>

Doch auch die parallel interviewten Lehrerinnen und Lehrer schnitten wenig
ruhmreich ab: Nur zehn Prozent von ihnen nahmen die Lernschwierigkeiten von
Sch&uuml;lern der niedrigsten Kompetenzstufe &uuml;berhaupt wahr - was
wiederum die Voraussetzung f&uuml;r gezielte F&ouml;rderma&szlig;nahmen
w&auml;re. Wenig schmeichelhaft waren auch die Attestate f&uuml;r das
Computerwissen der Jugend. Da hinkt die Realit&auml;t den euphorischen
Zukunftvisionen der Bildungspolitiker ("Schulen ans Netz!") noch meilenweit
hinterher. </p>

</td></tr>
<tr><td></td><td>
<table border="8" cellspacing=0 cellpadding=8 width=100%>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff" size=-1><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff" size=-1><b> http://www.wozim.de </font></b>
</td></tr></table>
</td></tr></table>
<br>
</body>
</html>
