<html>
<head>
<!-- Author = Wolf Zimmer -->
<title>noch etwas zu PISA</title>
</head>
<body background="wolf2.gif" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">
<a name="top"></a>

<table width=100% border=0 cellpadding=8>
<tr><td width=80> &nbsp; </td><td>
<p align=center><font color="#000080" size="7"><b>PISA Pleite</b></font></p>

In der Berliner Zeitung fand ich nachfolgenden Artikel. Ob damit alles
wieder besser wird und bei der n&auml;chsten Pisa-Auswertung bessere
Ergebnisse erzielt werden??????????

<hr width=80% size=1 noshade>
<h2>Die klassenlose Schule</h2>

<p><i>Susanne Lenz</i></p>

<p> Ein Satz gen&uuml;gt. Im Klassenzimmer laufen jetzt alle durcheinander.
&quot;Sucht euch einen Partner&quot;, hat die Lehrerin gesagt. &quot;Jeder
Viertkl&auml;ssler sucht sich einen Sechstkl&auml;ssler aus.&quot; Kevin
rennt auf einen Mitsch&uuml;ler zu, der zwei K&ouml;pfe gr&ouml;&szlig;er
ist als er. Zu sp&auml;t. Der Gro&szlig;e ist schon bei Samra in der
Gruppe. Kevin muss sich schnell nach jemand anderem umsehen. F&uuml;nf
Minuten sp&auml;ter ist es wieder still. Die Sch&uuml;ler sitzen in
Dreiergruppen an den Tischen, ein Viertkl&auml;ssler, ein
F&uuml;nftkl&auml;ssler und ein Sechstkl&auml;ssler jeweils. Sie suchen auf
einem Arbeitsblatt in einem Buchstabensalat nach Namen von Tieren,
Fr&uuml;chten und Werkzeugen - klassen&uuml;bergreifender Unterricht an der
Peter-Petersen-Schule in Neuk&ouml;lln. </p>

<p>Eigentlich m&uuml;ssten Eltern vor dieser Grundschule im n&ouml;rdlichen
Teil des Bezirks fliehen. Viele Arbeitslose und Sozialhilfeempf&auml;nger
wohnen hier, viele Ausl&auml;nder. Die Schwierigkeiten, die diese Mischung
f&uuml;r die Schule mit sich bringt, sind bekannt: Ein gro&szlig;er Teil
der Erstkl&auml;ssler kann schlecht Deutsch, manche sind nicht einmal in
der Lage einen Stift zu halten. Sie haben es nie gelernt.
Erziehungsbewusste M&uuml;tter und V&auml;ter boykottieren solche Schulen
oft. Zum Beispiel, indem sie sich bei Freunden in einem weniger
problematischen Bezirk anmelden. Nur zum Schein, nur damit ihr Kind die
Chance hat, eine Schule mit weniger Problemen zu besuchen. Auch in die
Petersen-Schule kommen Eltern, die die Direktorin Ruth Weber erst
&uuml;berzeugen muss, dass sie ihr Kind auf diese Schule schicken
k&ouml;nnen, ohne dass seine Zukunft dadurch schaden nimmt. Aber es gibt
auch viele so genannte Wunschkinder. Sie wohnen nicht im Einzugsbereich,
wollen aber trotzdem auf diese Schule. Viele muss Ruth Weber abweisen, es
gibt nicht genug Pl&auml;tze. Weil die Petersen-Schule auch f&uuml;r
deutsche Sch&uuml;ler attraktiv ist, liegt der Ausl&auml;nderanteil nur bei
f&uuml;nfzig Prozent. An den umliegenden Schulen haben an die 80 Prozent
der Erstkl&auml;ssler Probleme mit der deutschen Sprache. Auch die Zahl der
Sch&uuml;ler, die nach sechs Jahren Petersen-Schule aufs Gymnasium
wechseln, ist mit einem Drittel vergleichsweise hoch. Die Petersen-Schule
ist seit acht Jahren eine Jenaplan-Schule, die einzige in Berlin. Der
Unterricht beruht auf den Grunds&auml;tzen des P&auml;dagogen Peter
Petersen (1884-1952). Das Augenf&auml;lligste ist, dass die Klassenstufen
eins, zwei und drei sowie vier, f&uuml;nf und sechs jeweils zu einer so
genannten Stammgruppe zusammengefasst sind. </p>

<p>&quot;gfbnjmklasdefrgherdeervbrdtf-vgbhjnk&quot; -Die zehnj&auml;hrige
Samra findet das Wort in dem Buchstabensalat nur halb. &quot;Beere&quot;
schreibt sie mit krakeliger Schrift auf ihr Arbeitsblatt. Sie sortiert es
unter dem Stichwort &quot;Tiere&quot; ein. Darko, der Sechstkl&auml;ssler
ihr gegen&uuml;ber, k&uuml;mmert sich nur um seine eigene Arbeit.
Daf&uuml;r sagt ihr die F&uuml;nftkl&auml;sslerin Sevilay, in welcher Zeile
des Buchstabensalats Samra das n&auml;chste Wort suchen muss. Samra
erz&auml;hlt, dass sie auf ihrer fr&uuml;heren Schule die schlechteste in
der Klasse war. &quot;Die anderen Kinder wollten nicht mit mir
spielen.&quot; In der Stammgruppe aber sind die Sch&uuml;ler nicht so
leicht in gut oder schlecht einzuteilen. Es ist normal, dass die
&Auml;lteren vieles besser k&ouml;nnen. &quot;Und wenn man etwas nicht
wei&szlig;, dann fragt man und dann helfen sie einem&quot;, sagt Samra.
</p>

<p>Samra beschreibt einen Grundsatz der Petersenschen P&auml;dagogik: die
Schule als Gemeinschaft, in der die Sch&uuml;ler sich zum Teil selbst
erziehen, sich helfen oder helfen lassen und dabei lernen, das Lernen zu
lernen, selbstst&auml;ndig zu werden und R&uuml;cksicht zu nehmen. Aber
nervt das nicht, wenn man immerzu anderen helfen soll? &quot;Helfen, das
ist doch eine Freude&quot;, sagt Nergiz. Und es ist p&auml;dagogisch
wertvoll, wie Ruth Weber sagt. Besonders eindrucksvoll zeige sich das immer
zu Schuljahresbeginn: Wenn die neuen Sch&uuml;ler kommen, merken auch die
Schw&auml;chsten, dass sie etwas gelernt haben, dass sie mehr k&ouml;nnen
als andere. &quot;Das ist ein Erfolgserlebnis, das enormen Schwung
gibt.&quot; </p>

<p>An den schlechten Ausgangsbedingungen im Bezirk kann die Petersen-Schule
nichts &auml;ndern. Aber die Lehrer hier sind &uuml;berzeugt, dass ihr
Modell eher geeignet ist, mit diesen Schwierigkeiten umzugehen. Deutsch
werde zum Beispiel schneller gelernt, wenn nicht nur der Lehrer und zwei,
drei Sch&uuml;ler gut sprechen k&ouml;nnen, sondern auch &auml;ltere
Sch&uuml;ler in der Stammgruppe. &quot;In Zehlendorf ist das
Jenaplan-Projekt sicher nicht n&ouml;tig&quot;, sagt eine Lehrerin. Obwohl
sie glaubt, dass die sozialen F&auml;higkeiten, die Jenaplan vermittelt,
auch dort nicht schaden w&uuml;rden. Denn die Petersen-Schule dient nicht
nur dem Erwerb von Wissen, sondern sie soll das Zusammenleben &uuml;ben. Im
Idealfall verbindet sich das eine mit dem anderen. Das Gespr&auml;ch, in
dem an jedem Montagmorgen die Sch&uuml;ler von ihren Erlebnissen am
Wochenende erz&auml;hlen, trainiert nicht nur die Sprache, es schafft auch
eine pers&ouml;nliche Beziehung zwischen Sch&uuml;lern und Lehrern. Die
Feste freitags in der Turnhalle sind ein Gemeinschaftserlebnis, das die
Atmosph&auml;re vebessert. Und sie geben intellektuell schw&auml;cheren
Sch&uuml;lern die Gelegenheit zu zeigen, dass sie etwas k&ouml;nnen, etwa
indem sie einen Tanz oder ein Lied zur Auff&uuml;hrung bringen. </p>

<p>Aber nicht nur schw&auml;chere Sch&uuml;ler profitieren. An der
Petersen-Schule gibt es mehrere hochbegabte Kinder, manche kommen sogar aus
anderen Bezirken. Die Stammgruppen bieten den Vorteil, dass gute
Sch&uuml;ler den Stoff einer h&ouml;heren Stufe ausprobieren und dann
entscheiden k&ouml;nnen, ob sie dort grunds&auml;tzlich mitarbeiten wollen.
Sie k&ouml;nnen eine Klasse &uuml;berspringen, ohne dass sie ihre Gruppe
verlassen m&uuml;ssen. Auch einem Sitzenbleiber bleibt das erspart. </p>

<p>Frontalunterricht gibt es kaum<p>Die n&auml;chste Stunde ist
Wochenplanstunde. Jetzt werden Aufgaben erledigt, die zu Beginn der Woche
festgelegt wurden. Die Lehrerin Mathilde Wallocha fragt, was die einzelnen
noch zu machen haben. Einige Sch&uuml;ler nehmen sich ihr Biologiebuch
heraus, um eine Antwort auf die Frage zu finden, warum der Hund ein
Nasentier ist. Andere schreiben in einem rot eingebundenen Heft an ihrer
Zusammenfassung von Pippi Langstrumpf. Frontalunterricht ist selten in
einer Klasse, die aus drei Jahrg&auml;ngen besteht, den gibt es nur, wenn
die Sch&uuml;ler getrennt nach Klassenstufe zum Beispiel Englischunterricht
haben. </p>

<p>Mathilde Wallocha hat fr&uuml;her in Marzahn unterrichtet. An ihrer
alten Schule seien Experimente kaum m&ouml;glich gewesen, die Kollegen
h&auml;tten schon auf Projekttage misstrauisch reagiert. Aber selbst die
Arbeit an der Petersen-Schule habe Grenzen. &quot;Wir bemerken auch, dass
das Lesen schlechter geht.&quot; Warum das so ist? &quot;In der DDR hatten
wir zw&ouml;lf Stunden Deutsch in der Woche, hier sind es f&uuml;nf.&quot;
Grunds&auml;tzlich gef&auml;llt ihr die Arbeit an der Petersen-Schule.
Manchmal aber w&uuml;nscht sie sich mehr Anleitung f&uuml;r diese besondere
Art des Unterrichtens. Die Lehrer an der Petersen-Schule haben sich alles
selbst beigebracht. &quot;Wer soll uns fortbilden, wenn es kaum Erfahrung
mit Jenaplan gibt?&quot;, fragt Ruth Weber. Anfangs schien es, als ob ihre
Schule von der Gie&szlig;ener Forschungsstelle f&uuml;r Jenaplan-Schulen
betreut werden k&ouml;nne. Aber der Schule fehlte das Geld f&uuml;r die
Fahrten des Gie&szlig;ener Professors nach Berlin. Einen Eindruck von einer
funktionierenden Jenaplan-Schule hat das Kollegium trotzdem einmal bekommen
- in Holland. Dort gibt es 200 Jenaplan-Schulen.
<hr width=80% size=1 noshade></p>

<p>Und noch ein Artikel !!!!!!!
<hr width=80% size=1 noshade>
<h2>Die Entdeckung der Lern-Langsamkeit</h2>
<h3>Deutschland nach der Pisa-Studie -
f&uuml;nfter Teil: Am besten beginnt man das Lernen mit vier Jahren</h3>
<p><i>Ralf Hertel</i></p>
    
<p>Viel ist in den letzten Wochen &uuml;ber die Gr&uuml;nde des schlechten
Abschneidens deutscher Sch&uuml;ler im Pisa-Test ger&auml;tselt worden:
Sind unsere Schulb&uuml;cher veraltet, fehlt den Lehrern die
p&auml;dagogische Ausbildung, haben wir zu gro&szlig;e Klassen oder sind
wir schlicht d&uuml;mmer als andere? Vielleicht sollte man ja ganz einfach
fr&uuml;her mit dem Lernen beginnen. &quot;Am besten lernt man in den
ersten zehn Lebensjahren, danach nimmt die Lernf&auml;higkeit
kontinuierlich ab&quot;, sagt etwa Gerhard Roth, Direktor des Instituts
f&uuml;r Hirnforschung an der Universit&auml;t Bremen. Mit anderen Worten:
Dann, wenn es in der Schule richtig losgeht, ist es eigentlich schon zu
sp&auml;t. &quot;Man m&uuml;sste mit vier Jahren zu lernen anfangen&quot;,
ist Roth &uuml;berzeugt, der seinen eigenen Kindern bereits im
Kindergartenalter Lerntechniken beigebracht hat. </p>

<p>Wenn es schon mit zehn Jahren wieder bergab geht, ist dann das Lernen in
der Schule vergebliche M&uuml;he? Nicht ganz. Zwar nimmt die
Lernf&auml;higkeit, rein biologisch betrachtet, ab, doch versteht man, dies
durch Tricks und Ged&auml;chtnisst&uuml;tzen zu kompensieren: &quot;Man
lernt, besser zu lernen&quot;, so Roth. Eselsbr&uuml;cken und
Selbstmotivation sorgen daf&uuml;r, dass man den R&uuml;ckgang der
Merkf&auml;higkeit nicht sp&uuml;rt. Auch Ausreden sind beliebt: &quot;Man
behauptet, man habe so viel im Kopf, da k&ouml;nne man auch mal was
vergessen, dabei nimmt schlicht die Ged&auml;chtnisf&auml;higkeit ab.&quot;
</p>

<p>Morgens oder abends? </p>

<p>Erst mit rund 50 Jahren beginne man, sich dies einzugestehen, weil
Ged&auml;chtnisl&uuml;cken nicht mehr geleugnet werden k&ouml;nnten. Dieses
Eingest&auml;ndnis er&ouml;ffne aber wiederum die Chance, mit der
Verdr&auml;ngung Schluss zu machen und neue Memotechniken zu erlernen.
Gerade f&uuml;r &auml;ltere Menschen m&uuml;ssten diese aber noch
entwickelt werden. &quot;&Auml;ltere Menschen m&uuml;ssen anders lernen als
junge. Allerdings ist noch zu wenig bekannt, was beim Lernen
tats&auml;chlich im Gehirn vor sich geht&quot;, sagt Roth, der deswegen mit
Kollegen ein &quot;Institut f&uuml;r empirische Kognitions- und
Emotionsforschung&quot; einrichten will, in dem er unter anderem
Lernstrategien untersuchen und entwickeln m&ouml;chte. </p>

<p>Wichtig scheint jedenfalls, nicht nur individuelle Strategien zu finden,
sondern auch den richtigen Zeitpunkt. Ob jemand fr&uuml;hmorgens oder
sp&auml;tabends besser lernt, ist von Mensch zu Mensch sehr
unterschiedlich. Allerdings gibt es Roth zufolge &quot;eindeutige
Wellen&quot; der Lernbereitschaft. Man m&uuml;sse sich dar&uuml;ber im
Klaren sein, dass Lernen nicht nur eine Frage des Wollens ist: &quot;Lernen
ist ein k&ouml;rperlicher Vorgang und h&auml;ngt eben auch von vegetativen
und emotionalen Faktoren ab.&quot; Lernen - ein Prozess wie Stoffwechsel
oder Hunger? Man habe oft versucht, die biologischen Zusammenh&auml;nge zu
deuten, doch f&uuml;r Roth sind alle g&auml;ngigen Lerntheorien bislang
&quot;unbefriedigend&quot;. </p>

<p>Klar ist jedoch, dass man nicht zu lange am St&uuml;ck lernen sollte.
Empirisch sei erwiesen, dass man in Aufmerksamkeitswellen von zehn bis
f&uuml;nfzehn Minuten lerne, sp&auml;testens nach einer Dreiviertelstunde
schalte man ab. Deswegen seien Pausen bei langen Vorlesungen
unerl&auml;sslich. Auch zu Hause sei stundenlanges Pauken wenig sinnvoll.
Stures Auswendiglernen ist f&uuml;r Roth mit der F&auml;higkeit des
Fahrradfahrens vergleichbar: Zwar verf&uuml;ge man &uuml;ber Wissen, doch
sei einem nicht bewusst, was man da eigentlich mache. Da das Wissen in
bewusstseinsunzug&auml;nglichen Hirnarealen abgespeichert werde, habe man
keine Ahnung, was es bedeute. Dementsprechend schnell vergesse man auch
wieder. </p>

<p>Sinnvoller sei bei der Pr&uuml;fungsvorbereitung das so genannte
kurzfristige Lernen. Mit Eselsbr&uuml;cken, einer systematischen Gliederung
des Lernstoffs und Zettelk&auml;sten, in denen man etwa die Vokabeln
aussortiert, die man noch nicht beherrscht, k&ouml;nne man schnell und
effektiv lernen. Ein Trick sei dabei, m&ouml;glichst viele Sinne
anzusprechen: Lern-CDs, Kassetten, das laute Sprechen dessen, was gelernt
werden soll, Folien, Schaubilder, Dias -all dies helfe, den Lernstoff in
mehreren Ged&auml;chtnissen zu speichern, etwa dem auditiven und dem
visuellen. Und in je mehr Ged&auml;chtnissen das Wissen gespeichert ist,
umso besser ist es abrufbar - multimediales Lernen hat also seinen
Sinn. </p>

<p>&quot;Allerdings ist das so angeeignete Wissen meist innerhalb eines
Vierteljahres wieder vergessen, weil es keine Zeit hat, sich zu
konsolidieren&quot;, sagt Roth. Aneignen, diskutieren, dar&uuml;ber
nachdenken, aufschreiben - nur so k&ouml;nnten abstrakte Informationen zu
pers&ouml;nlichem Wissen werden. &quot;Wenn mich etwas emotional packt,
vergesse ich es nie wieder&quot;, so der Hirnforscher. Deswegen sei die
beste Strategie, sich Zeit zu nehmen, um Br&uuml;cken zwischen Lerninhalten
und eigenen Erfahrungen und Gef&uuml;hlen zu schlagen. Mit anderen Worten:
Je schneller man lernt, umso schneller vergisst man auch. </p>

<p>Gerade f&uuml;r diese Aneignung des Wissens fehlt aber oft die Zeit.
Welcher Student kennt das nicht: Man b&uuml;ffelt f&uuml;r die
Pr&uuml;fung, hakt danach den Lernstoff sofort ab, weil man schon das
n&auml;chste Examen vorbereiten muss - und hat bereits Wochen sp&auml;ter
alles vergessen. Gegen diese Form von Hochgeschwindigkeitslernen und
-vergessen wehrt sich seit einigen Jahren eine Initiative, die sich der
Entdeckung der Langsamkeit verschrieben hat: der &quot;Verein zur
Verz&ouml;gerung der Zeit&quot; mit Sitz in Klagenfurt. &quot;Wir wollen
Widerstand leisten gegen unsinnige Formen der Beschleunigungsmanie&quot;,
sagt Thomas Macho, Professor f&uuml;r Kulturwissenschaften an der Berliner
Humboldt-Universit&auml;t und Mitglied der Initiative. Er spricht von
&quot;Entschleunigung&quot;: &quot;In manchen Bereichen ist das hohe Tempo
durchaus sinnvoll - etwa in der Informatik. Aber man darf nicht einfach
naturwissenschaftliche Standards auf die Geisteswissenschaften
&uuml;bertragen.&quot; So bek&auml;men die, die mit 28 promovieren wollten,
kaum noch F&ouml;rderungen, weil sie zu alt seien. F&uuml;r Macho ist das
zumindest in den Geisteswissenschaften &quot;kontraproduktiv&quot;:
&quot;Diejenigen, die sich Zeit lassen, &uuml;ber den Tellerrand
hinauszuschauen und aussetzen, um sinnvolle Praktika zu machen, werden
bestraft, weil sie in der Statistik als Abbrecher oder Langzeitstudenten
gelten.&quot; </p>

<p>Mit Mu&szlig;e lernen </p>

<p>Dabei sei es gerade in den Geisteswissenschaften entscheidend, sich Zeit
zu lassen: &quot;Wenn Sie Philosophie studieren, lernen Sie nicht
blo&szlig; Fakten. Da geht es um ein Reflexionsverm&ouml;gen, das erst
langsam reifen muss&quot;, sagt Macho, der die Studenten in seinen eigenen
Seminaren oft nur einen einzigen Text lesen l&auml;sst. Anders als mit viel
Mu&szlig;e lie&szlig;e sich ein Fach wie die Kulturwissenschaft gar nicht
sinnvoll studieren. Denjenigen, die zwischen Hausarbeit, Referatstermin,
allabendlichem Kellnern und Sportverein zu viel Zeitdruck versp&uuml;ren,
r&auml;t er deshalb von einem geisteswissenschaftlichen Studium ab. Macho
ist &uuml;berzeugt: &quot;Wer schnell lernt, was man einfach nicht schnell
lernen kann, steht am Ende mit leeren H&auml;nden da - und hat letztlich
nur Zeit vergeudet.&quot; </p>

<p>Fr&uuml;h mit dem Lernen anfangen, es mit Dias, Filmen,
H&ouml;r-CDs und Lernspielen m&ouml;glichst sinnenfreudig gestalten und
sich dann viel Zeit lassen - ob deutsche Sch&uuml;ler so international
besser abgeschnitten h&auml;tten, bleibt im Nachhinein Spekulation.
Vielleicht w&uuml;rde multimediales Lernen ohne Zeitdruck auch einfach mehr
Spa&szlig; machen - egal, was die Pisa-Ergebnisse sagen.
<hr width=80% size=1 noshade></p>

<p>Eine Bewertung unterlasse ich nun, jeder sollte sich schon seine eigene
Gedanken machen. </p>


</td></tr>
<tr><td></td><td>
<table border="8" cellspacing=0 cellpadding=8 width=100%>
<tr bgcolor="#88ccff">
<td>Autor: &nbsp; <font color="#0000ff"><b>Wolf Zimmer</font></b> </td>
<td>E-Mail: <font color="#0000ff" size=-1><b> wolf@wozim.de</font></b> </td>
<td>Homepage: <font color="#0000ff" size=-1><b> http://www.wozim.de </font></b>
</td></tr></table>
</td></tr></table>
<br>
</body>
</html>
