<html>
<head>
<title>"meine Augenkrankheit"</title>
</head>
<body background="cordbg1.jpg" text="#000000" link="#0000ff" alink="#ff0000"
 vlink="#0000ff" bgcolor="#b0b0b0">

<table width=100% border=0 cellpadding=8>
<tr><td>

<p align=center><font color="#000080" size="5"><b>Retinitis Pigmentosa, -
<br> das Leben mit anderen Augen sehen</b></font></p>

<p>Hallo liebe NoCover-Gemeinschaft, - herzlich gegr&uuml;&szlig;t sollen
auch die &quot;Neuen&quot; sein, die zum Teil scheinbar aus leider nicht
mehr gemachten Online-Magazinen ihren Weg zu uns gefunden haben (Starmag
R.I.P. - es war ein sch&ouml;nes Mag).... </p>

<p>Ich m&ouml;chte Euch heute einmal &uuml;ber eine schwere Augenkrankheit
informieren, &uuml;ber die relativ wenig berichtet wird, obwohl es etwa
40.000 (die Dunkelziffer ist sicherlich weit h&ouml;her, da viele Menschen
die Erkrankung falsch einsch&auml;tzen) Betroffene gibt, - einer davon bin
leider auch ich. </p>

<p>Die Retinitis Pigmentosa wird zu gut deutsch auch
&quot;Tunnelblick&quot; genannt und f&uuml;hrt in fast allen F&auml;llen
zur Erblindung. Leider ist diese Krankheit absolut unberechenbar. Es kann
passieren, dass Kleinkinder kurz nach ihrer Geburt bereits erblinden (ist
aber eher selten der Fall) und andere Menschen k&ouml;nnen bis ins hohe
Alter mehr oder weniger schlecht sehen. So passiert es auch, dass Jahre
lang die Sehtauglichkeit permanent gleich bleibt und pl&ouml;tzlich wie
eine Bombe das Augenlicht innerhalb von 14 Tagen komplett ausl&ouml;scht.
Bei Anderen nimmt das Sehverm&ouml;gen hingegen langsam und kontinuierlich
ab. </p>

<p>In den allermeisten F&auml;llen &auml;ussert sich die Krankheit zum
Endstadium dem Tunnelblick hin. Die Sehnerven/Sehzellen im Auge sterben von
au&szlig;en nach innen langsam und kontinuierlich ab. Es entsteht ein immer
kleiner werdendes &quot;Guck&quot;-Loch in der Mitte des Sehfeldes. Zuletzt
sieht man nur noch durch ein M&uuml;nzst&uuml;ck-grosses Loch, bis es ganz
dunkel wird. Es gibt auch die Variante, wie bei mir, wo die Sehzellen
&uuml;berall verteilt absterben, es entstehen verstreut im Sehfeld
verschiedene L&ouml;cher. Das ist Anfangs v&ouml;llig unproblematisch.
Solange ein Auge die fehlenden Sehbereiche des Anderen abdeckt, darf man
unter st&auml;ndiger augen&auml;rtzlicher &Uuml;berpr&uuml;fung sogar noch
Auto fahren. Kritisch wird es, wenn Schnittmengen entstehen, also beide
Augen im selben Bereich tote Stellen aufweisen. </p>

<p>Die L&ouml;cher der abgestorbenen Sehnerven sind nicht schwarz, wie man
vielleicht vermuten w&uuml;rde. Hierzu ist das Gehirn viel zu trickreich.
Es f&uuml;llt fehlende Bildelemente mit wahrscheinlichen Bildresten auf
unter Verwendung, von erlernten Erfahrungswerten und logischen
Berechnungen. Sieht man beispielsweise auf eine Rasenfl&auml;che, weiss das
Gehirn ja, dass die sichtbaren Bereiche diese Rasenfl&auml;che wahrnehmen
und die toten Bereiche sicherlich auch auf Rasenfl&auml;che zielen. Somit
werden die nicht sehbaren Bereiche einfach mit der restlichen Fl&auml;che
aufgef&uuml;llt. Es erscheint im Gehirn wieder ein vollst&auml;ndiges Bild.
Das gelingt dem Gehirn nat&uuml;rlich nur vollkommen, bis der
&uuml;berwiegende Teil des Augenlichts komplett zerst&ouml;rt ist. </p>

<p>Da abgestorbene Zellen in den Augen nicht nachwachsen und es sich um
eine Erbkrankheit handelt, gibt es keine Behandlungsmethode, die diese
Krankheit stoppen oder gar reparieren k&ouml;nnte. Es gibt aber ein
&quot;Ger&uuml;cht&quot;, dass in Kuba eine spezialisierte Augenklinik
existiert, wo sich ein leider schon verstorbener Professor sein ganzes
Leben mit der Erforschung dieser Krankheit befasst hat. In dieser Klinik
soll die Retinitis Pigmentosa mit guten Chancen aufgehalten werden
k&ouml;nnen. </p>

<p>Diese M&ouml;glichkeit wird einem Skandal gleichend in den
Industriel&auml;ndern, wie vor allem auch Deutschland vollkommen
totgeschwiegen und im Keim erstickt. Rundfunkanstalten werden verklagt, die
&uuml;ber diese Heilungsm&ouml;glichkeit nur berichten wollen. Man
erkl&auml;rt sich damit, dass das Verfahren in Kuba sehr gef&auml;hrlich
sei und das noch sehende Patienten komplett erblindet wieder zur&uuml;ck
nach Deutschland kamen. Beweise hierf&uuml;r scheint es aber auch nicht zu
geben. Dass die Kuba-Methode so zerschlagen wird, liegt angeblich daran,
dass in den letzten Jahren viele Millionen Mark in die Forschung zu dieser
und &auml;hnlichen Augenkrankheiten investiert wurden. Gelder, die
nat&uuml;rlich gern unter den wenigen Spezialisten in Deutschland
aufgeteilt werden. Hinzu kommt, dass nicht industrielle L&auml;nder wie
auch in der Krebsforschung nicht ernst genommen werden. Es macht scheinbar
nicht den besten Eindruck, wenn finanzschwache Fremdl&auml;nder weiter
vorangekommen sind, als die gro&szlig;en Industriel&auml;nder unter
erheblichen Geld- und Arbeitsaufwand. </p>

<p>Was ich von der M&ouml;glichkeit der angeblichen Heilung in Kuba halten
soll, wei&szlig; ich nicht. Doktoren und Professoren auf der einen Seite, -
Verfechter der Kuba-Methode auf der Anderen - die Erblindenden stehen in
der Mitte v&ouml;llig ratlos. Wenn in Kuba Hoffnung auf Heilung besteht,
w&auml;re das ein wahnsinniger Skandal. Tausende gehen in die sichere
Erblindung, nur weil deutsche Forscher sich in ihrer Ehre verletzt
sehen.... </p>

<p>Der Tunnelblick kann in noch einer weiteren, grausameren Art auftreten
als sogenanntes Usher-Syndrom. Hier wird die Erblindung zu allem &Uuml;bel
auch noch von einer Taubheit begleitet. Damit sind dann alle wichtigen
Sinnesorgane komplett ausgeschaltet. </p>

<p>Es ist in den seltensten F&auml;llen so, dass die direkten Eltern das
kranke Gen bereits vererbt haben. Auch in meinem Fall kann ich nicht mal
demjenigen eins auf die M&uuml;tze hauen, von dem ich diese Krankheit
geerbt habe, - die Krankheit &uuml;berspringt oft mehrere Generationen und
tritt dann pl&ouml;tzlich wieder auf. </p>

<p>Bemerken kann man diese Krankheit nicht einfach durch schlechtere Sicht
oder wie erw&auml;hnt auch nicht durch offensichtliche
&quot;L&ouml;cher&quot; im Sehfeld. Am einfachsten und auff&auml;lligsten
ist das Ausma&szlig; der Krankheit, wenn man nachts in den Himmel sieht bei
sternenklarer Nacht. Bewegt man nun den Kopf, so verschwinden Sterne an
bestimmten Stellen im Sehfeld und tauchen dann pl&ouml;tzlich an der
anderen Seite des Loches wieder auf. </p>

<p>Oft werde ich gefragt, wie ich mit solch einer Krankheit &uuml;berhaupt
noch mein Leben geniessen kann. Nun, bei mir w&auml;chst diese Krankheit
bislang mehr oder weniger kontinuierlich und genauso kontinuierlich wird
das Leben dadurch weiter eingeschr&auml;nkt, so dass man gezwungen ist,
sich daran zu gew&ouml;hnen und st&auml;ndig mit der Situation neu fertig
zu werden. Festgestellt wurde die Krankheit bei mir bereits 1988, als ich
ein augen&auml;rtzliches Gutachten f&uuml;r meinen (seinerzeit Klasse III)
F&uuml;hrerschein machen wollte. Seither wird der Fortschritt st&auml;ndig
kontrolliert. Bis etwa 1991 schr&auml;nkte mich die Krankheit
&uuml;berhaupt nicht ein. Zu diesem Zeitpunkt setzte ich dann f&uuml;r mich
zum ersten mal fest, dass ich mir keine Dunkelfahrten mehr zutrauen
m&ouml;chte. Nur mit solcher Disziplin und Eigenverantwortung kann man auch
mit dieser Krankheit auskommen, ohne sich oder andere Menschen zu
gef&auml;hrden. Ab etwa 1998 bemerkte ich dann, das l&auml;ngere
Autofahrten f&uuml;r mich anstrengender waren. Somit setzte ich mir die
Grenze, maximal noch eine Stunde unterwegs zu sein, was die Reichweite
nat&uuml;rlich deutlich einschr&auml;nkte. Seit gut zwei Jahren fahre ich
&uuml;berhaupt nicht mehr mit dem Auto. Es ist mir einfach zu
gef&auml;hrlich. Ich weiss nicht, was ich als n&auml;chsten Schritt
aufgeben muss. Sicherlich h&auml;lt das Leben besonders viele
R&uuml;ckschl&auml;ge bei einer langsamen Erblindung bereit.
Begleiterscheinungen bringen die meisten Probleme mit sich, wie fehlende
Mobilit&auml;t oder die einfachsten Dinge, wenn einem zB. etwas auf den
Boden f&auml;llt und man es nur wiederfinden kann, wenn man auf allen
Vieren herumrutscht und mit den H&auml;nden die Stellen abtastet, wo man
den gefallenen Gegenstand in etwa vermutet. Viele Dinge machen einfach gar
keinen Spass mehr, die Anderen als das Normalste &uuml;berhaupt erscheinen.
Dunkle Partys sind f&uuml;r mich etwas f&uuml;rchterliches, Speisekarten in
dunklen Gastst&auml;tten fast unm&ouml;glich zu lesen. Leere Gl&auml;ser
auf einem Tisch sind potentiell gef&auml;hrdet, umgestossen zu werden. Der
Mauspfeil am Bildschirm muss immer nach ganz oben in die linke Ecke
geschoben werden, um ihn dann mit dem Blick zu verfolgen bis zu der Stelle,
wo man ihn ben&ouml;tigt. Er w&uuml;rde sonst an den entsprech enden
Stellen im Sehfeld einfach verschwinden. Auch ein Grund, weshalb ich immer
noch vorwiegend mit kleiner Bildschirmaufl&ouml;sung am Amiga arbeite. An
den PCs geht es ab 17&quot;-Monitor mit 800x600. Hier verwende ich unter
Windows den gr&ouml;&szlig;ten Mauspfeil und schalte ihn auf invertiert,
damit er sich zus&auml;tzlich immer stark vom jeweiligen Hintergrund
abhebt. </p>

<p>Gerade was das Webseitenlayout angeht, so kann man schlecht sehenden
Menschen und auch Blinden das Lesen erheblich vereinfachen bzw.
&uuml;berhaupt erst erm&ouml;glichen, oder auch erschweren bis hin zur
v&ouml;lligen Blockierung f&uuml;r blinde Menschen, die Dank technischer
Hilfsmittel, wie Brailezeilen oder Sprachsoftware recht gut im Internet
unterwegs sind. Wer sich hier an den normal &uuml;blichen HTML-Standarts
h&auml;lt, kommt diesen Menschen schon mal sehr entgegen. Schriften in
Grafik oder Animation, sowie entsprechende Java-Animationen oder
Flashseiten k&ouml;nnen von Blinden gar nicht erfasst werden.
Sehbehinderten-, also nicht blinden Menschen kann man einen gro&szlig;en
Gefallen tun, wenn man gr&ouml;&szlig;ere Schriftarten und vor allem
kontrastreiche Seiten verwendet. Schlichte schn&ouml;rkellose Schriften
ergeben ebenfalls mit ihrer klaren Struktur eine Hilfestellung. Es hat sich
erwiesen, dass als besonders angenehm helle Schrift auf dunklem Hintergrund
gesehen wird. Das kann ich durchaus best&auml;tigen. </p>

<p>Es gibt entsprechende Links mit Informationen, worauf Webmaster und
Internetseitengestalter achten sollten, damit auch sehbehinderte und blinde
Mitmenschen ihre Seiten geniessen k&ouml;nnen. Die Einschr&auml;nkungen
sind dabei gar nicht so sehr hoch, als das es das Layout extrem
verunsch&ouml;nern w&uuml;rde. Wer mehr Informationen hierzu sucht, kann
sich &uuml;ber die zwei angegebenen Internetadressen am Ende dieses
Artikels durch deren Linkseiten zu den entsprechenden Informationen
weiterklicken. </p>

<p>Es w&auml;re sch&ouml;n, wenn ich Euch ein wenig mehr &uuml;ber die
Retinitis Pigmentosa informieren konnte und Ihr ganz allgemein &uuml;ber
die Schwierigkeiten sehbehinderter und blinder Mitmenschen einen besseren
Eindruck bekommen konntet. </p>

<p>Weitergehende Informationen besonders zu dem angeblichen Kuba-Skandal
findet Ihr unter....

<font color="#0000ff"><b>http://www.retinitis-pigmentosa.de
</b></font></p>

<p>Viel Information (zum Teil &uuml;ber weitere Links) und erste Anlaufstelle
f&uuml;r erblindende Menschen ist....

<font color="#0000ff"><b>http://www.pro-retina.de </b></font> </p>

<p>Einen hoffentlich lebenslangen sch&ouml;nen Augenblick w&uuml;nscht Euch Euer <br>

HIGGINS  <br>
Cord Hagen  </p>



</td></tr></table>
<br>
</body>
</html>
