<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Gewinnspiel</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Gewinnspiel1.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Gewinnspiel3.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Gewinnspiel
</font>
</TD></tr>
</TABLE>
<BR>
<H3>2. Vorstellung der neuen Preise</H3>
<P>
Und jetzt gibt es f&uuml;r alle eine neue Chance auf einen Preis:
</P>
<P>
VMC - Harald Frank - hat die A1200-Schnittstellenkarte Hypercom 1 zur
Verf&uuml;gung gestellt:
</P>
<P>
<A HREF="img/Hypercom1.png"><IMG SRC="thumb/Hypercom1.jpg" WIDTH="120" HEIGHT="70" ALT="Hypercom 1"  BORDER="0"></A>
</P>
<P>
&raquo;Wir treffen Ihre Bed&uuml;rfnisse
</P>
<P>
Unsere superschnelle HyperCOM 1-Schnittstellenkarte wurde speziell f&uuml;r
Benutzer entworfen, die nur ein Modem oder ISDN-Terminaladapter nutzen
wollen. Durch den auf Hochleistung getrimmten Treiber bekommen Sie die
maximal m&ouml;gliche Geschwindigkeit beim Senden und Empfangen.
</P>
<P>
Da&szlig; in unseren Treibern Jahre an Erfahrung stecken, werden Sie sehr schnell
an der geringen CPU-Belastung merken. Ein Umschalten des Bildschirms
erzeugt nie wieder CRC-Fehler bei Z-Modem.
</P>
<P>
Wenn Sie diese superschnelle Schnittstelle einmal benutzt haben, werden Sie
diese Geschwindigkeit und geringe CPU-Belastung nicht mehr missen wollen.
</P>
<P>
Unerreichte Performance
</P>
<UL>
<LI> Ultra high-speed bis maximal 460.800 Bits pro Sekunde (~44Kb)
</LI>
<LI> Zwei mal Term 4.7 auf Workbench, Nullmodemverbindung 460.8KBit, 1Kb Z-
  Modem ~25.000 CPS (mit HyperCOM 3 ermittelt)
</LI>
<LI> Zwei mal Term 4.7 auf Workbench, Nullmodemverbindung 460.8KBit, 8Kb Z-
  Modem ~43.000 CPS (mit Executive im Hintergrund)
</LI>
</UL>
<P>
Intelligente Features
</P>
<UL>
<LI> Z-Modem optimierte Sendefunktionen bringen bis zu 20% mehr
  Geschwindigkeit
</LI>
<LI> PPP und TCP/IP optimierte Sende und Empfangsroutinen beschleunigen Ihre
  Internetverbindungen
</LI>
<LI> Ab Version 3.00 integrierter PC-Maus-Treiber f&uuml;r jede device-Unit (noch
  nicht verf&uuml;gbar)
</LI>
<LI> Minimale Interruptbelastung durch den integrierten 64 Zeichen Hardware
  FIFO.
</LI>
</UL>
<P>
Kostensparende Geschwindigkeit, Konnektivit&auml;t und Flexibilit&auml;t
</P>
<UL>
<LI> Holt das maximale an Geschwindigkeit aus jedem Modem oder ISDN-
  Terminaladapter.
</LI>
<LI> Die ideale und ma&szlig;geschneiderte Schnittstellen-L&ouml;sung f&uuml;r jeden
  Heimanwender.
</LI>
<LI> Durch modulare Treiber skalierbar auf bis zu 5 HyperCOM3+ pro Rechner.
</LI>
</UL>
<P>
Technische Daten
</P>
<UL>
<LI> Interface : Amiga 1200 2*11 Pin Uhrenport
</LI>
<LI> Schnittstelle : 1 * RS232 SUBD-25 (~30cm Flachkabel + Halteblech)
</LI>
<LI> Flu&szlig;kontrolle : Software xON/xOFF und Hardware RTS/CTS
</LI>
<LI> Geschwindigkeit: Minimal 50, bis maximal 460.800 Bits pro Sekunde
</LI>
<LI> Serieller FIFO : 32 Zeichen Sende / 32 Zeichen Empfangspufferung
</LI>
</UL>
<P>
Hardware-Kompatibilit&auml;t
</P>
<UL>
<LI> Turbokarten: Kompatibel zu allen bekannten Modellen
</LI>
<LI> PCMCIA : Keine Konflikte mit jetzigen L&ouml;sungen bekannt
</LI>
<LI> Serielle : Interne Serielle kann gleichzeitig und weiterhin genutzt
  werden
</LI>
<LI> Tower : Kompatibel zu RBM und Eagle Tower-L&ouml;sungen (Mechanisches
  Problem bei neuen Micronik Z2/3-Boards)
</LI>
</UL>
<P>
Device-Kompatibilit&auml;t
</P>
<UL>
<LI> Kompatibel zu allen Programmen, die sich an die RKM-Richtlinien halten.
</LI>
</UL>
<P>
&Auml;nderungen ohne Vorank&uuml;ndigung vorbehalten. Alle genannten Warenzeichen
sind Eigentum der entsprechenden Firmen.&laquo;
</P>
<P>
VMC - Harald Frank<BR>
Ringstr. 26<BR>
68789 St. Leon-Rot<BR>
Deutschland<BR>
</P>
<P>
Telefon: 06227/88046-0 13-17 Uhr<BR>
Telefax: 06227/88046-4 24 Stunden<BR>
Mailbox: 06227/88046-4 24 Stunden<BR>
E-Mail: <A HREF="mailto:info@vmc.de">info@vmc.de</A><BR>
</P>
<P>
Frank Weber hat sein Programm CDCat in der brandneuen Version 3 f&uuml;r das
Gewinnspiel zur Verf&uuml;gung gestellt:
</P>
<P>
&raquo;CDCat Release 3 (MUI) ist der PPC/68k CD-ROM-Katalogisierer f&uuml;r den Amiga.
Dar&uuml;ber hinaus k&ouml;nnen aber auch s&auml;mtliche Festplatten, Disketten und
Verzeichnisse (z.B. mit vielen Grafiken) archiviert werden.
</P>
<P>
Es eignet sich auch besonders f&uuml;r Aminet-CDs, da Alter, Gr&ouml;&szlig;e und
Archiv-Beschreibungen mitber&uuml;cksichtigt werden. CDCat besitzt einen
superschnellen Suchmodus (PPC; 68k: 85% Inline-Assembler!), au&szlig;erdem
k&ouml;nnen mit dem &quot;Browser&quot; archivierte CDs verzeichnisweise
durchst&ouml;bert werden, ohne eingelegt zu sein.
</P>
<P>
Direkt aus CDCat heraus k&ouml;nnen Archive entpackt, Bilder angezeigt
werden etc. Dabei sind alle Programme frei konfigurierbar.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Weitere Features:&nbsp;</TD><TD VALIGN="TOP">XPK-Unterst&uuml;tzung, Merkbrett zur Verwaltung gefundener&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Dateien, DiskIDs zur schnellen Identifizierung der CDs,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">usw...&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar. Aktuell ist
Version 3.0. Weitere Informationen zu CDCat Release 3 gibt es auf der
Support-Seite <A HREF="http://www.amigaworld.com/support/cdcat" TARGET="_TOP">http://www.amigaworld.com/support/cdcat</A>
</P>
<P>
Neu in der Version 3 sind unter anderem der PowerPC Support, der
Katalog-Manager zum Reorganisieren der Kataloge, Filterfunktion etc.
</P>
<P>
Der Autor ist unter folgender Adresse erreichbar:
</P>
<P>
Frank Weber<BR>
Schlizstra&szlig;e 53<BR>
74076 Heilbronn<BR>
Deutschland<BR>
</P>
<P>
E-Mail: <A HREF="mailto:frank@weber.org">frank@weber.org</A>&laquo;
</P>
<P>
Peter Elzner hat sein Programm Diamond Caves II f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:
</P>
<P>
&raquo;Diamond Caves II ist eine Weiterentwicklung des klassischen Emerald Mine
und Boulder Dash. In einer H&ouml;hle m&uuml;ssen alle Diamanten eingesammelt
werden, zahlreiche Objekte wie T&uuml;ren, Schutzschilder, Dynamitstangen und
Bomben sowie verschiedene Gegner sorgen f&uuml;r teilweise verzwickte Level.
Enthalten ist ein Zwei-Spieler-Modus (gleichzeitig!) sowie ein
komfortabler Leveleditor.
</P>
<P>
Voraussetzungen: Amiga mit Kick2.0, mind. 1MB Chipmem und 1MB Fastmem,
                            schneller Prozessor empfohlen, MUI wird f&uuml;r den
Editor ben&ouml;tigt
Unregistrierte Version: 50 Level, Editor eingeschr&auml;nkt
Registrierte Version: 40 DM (umgerechnet etwa 20,50 Euro; Anm. d. Red.)&laquo;
</P>
<P>
Eine Demo-Version kann von <A HREF="http://www.diamond-pro.com" TARGET="_TOP">http://www.diamond-pro.com</A> heruntergeladen
werden.
</P>
<P>
Der Autor ist unter folgender Adresse erreichbar:
</P>
<P>
Peter Elzner<BR>
Grudene 6a<BR>
58644 Iserlohn<BR>
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">E-Mail:&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:order@diamond-pro.com">order@diamond-pro.com</A> (Bestellungen) bzw.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP"><A HREF="mailto:peter.elzner@diamond-pro.com">peter.elzner@diamond-pro.com</A> (Fragen)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Marcus Stratmann hat sein Programm LigaManager f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt:
</P>
<P>
&raquo;LigaManager ist ein Programm zur Archivierung von Spiel-Ergebnissen,
Terminen und Zuschauerzahlen aus Sportligen. Das Programm kann f&uuml;r fast
alle Sportarten benutzt werden kann, die im Ligamodus ablaufen.
Alle Daten k&ouml;nnen in vielf&auml;ltiger Form in Tabellen und Statistiken
dargestellt und ausgedruckt werden. Neben den &uuml;blichen Tabellen bietet
der LigaManager noch einige spezielle Statistiken wie die Berechnung von
Rekorden und Serien, die Darstellung einer &quot;Fieberkurve&quot; mit dem
Saisonverlauf aller Mannschaften sowie die Ausgabe einer &quot;Kastentabelle&quot;
und eines Spielplans der gesamten Saison mit allen Daten.
Durch Vorgaben, Extrapunkte und ein variables Punktesystem ist der
LigaManager f&uuml;r nahezu jede Sportart geeignet. &Uuml;ber das umfangreiche
Optionen-Men&uuml; lassen sich alle Statistiken in vielf&auml;ltiger Weise
beeinflussen. Dar&uuml;ber hinaus bietet der LigaManager eine einfache und
intuitive Dateneingabe, wobei das Programm fast ausschlie&szlig;lich mit der
Maus bedient wird. Dazu gibt es eine ausf&uuml;hrliche Anleitung im
Amiga-Guide Format. Mitgeliefert werden au&szlig;erdem Datens&auml;tze mit Daten
aus erster und zweiter Fu&szlig;ball-Bundesliga.
</P>
<P>
Aktuelle Informationen zum LigaManager und weitere Daten findet man auf
der LigaManager-Homepage im WWW unter der Adresse
<A HREF="http://privat.schlund.de/mecki/lm" TARGET="_TOP">http://privat.schlund.de/mecki/lm</A>
</P>
<P>
Eine Demo-Version des Programms ist im Aminet verf&uuml;gbar (im Verzeichnis
biz/dbase).
</P>
<P>
Preis der Vollversion: 30 DM (15 Euro), inkl. Versandkosten.
</P>
<P>
Anschrift des Autors:<BR>
Marcus Stratmann<BR>
B&ouml;ttcherstr. 13<BR>
46244 Bottrop-Kirchhellen<BR>
Deutschland<BR>
EMail: <A HREF="mailto:stratmann@gmx.de">stratmann@gmx.de</A>&laquo;<BR>
</P>
<P>
Des Weiteren hat Thomas Hasemann sieben CDs mit FED-Programmen, u.a. aus
den Reihen FrozenFish, Megahits und AmigaTools, f&uuml;r das Gewinnspiel zur
Verf&uuml;gung gestellt.
</P>
<P>
Vielen Dank an alle Preisstifter!
</P>
<P ALIGN="RIGHT">
<A HREF="Gewinnspiel1.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Gewinnspiel3.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
