<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Abschlieﬂend</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Geruechte.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Main.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Abschlie&szlig;end
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Abschlie&szlig;end</H2>
<P>
Wirbel um Eagle - Teil II
</P>
<P>
Nachdem Marcus Konjevic, stellvertretender Gesch&auml;ftsf&uuml;hrer der deutschen
Firma media group / Eagle Computer, bereits im Vorwort der letzten Ausgabe
bedacht wurde, hat er sich in den vergangenen Tagen erneut um dieses
Privileg bem&uuml;ht - mit Erfolg, wie man sieht.
</P>
<P>
Was war geschehen? Ein Kunde hat in einem &ouml;ffentlichen Amiga-Forum
um Hilfe zu einem von Eagles Towerumbauten nachgesucht, bei dem die
Taktfrequenz-Anzeige nicht funktionierte. Au&szlig;erdem erkundigte er sich nach
einer weiteren E-Mail-Adresse der Firma, da &uuml;ber die offizielle keine
Antwort kam. Zum Schluss stellte er die Frage, ob das Unternehmen eventuell
in Konkurs gegangen ist.
</P>
<P>
Wenig sp&auml;ter erschien in diesem Forum eine Mitteilung von Marcus Konjevic,
in der mit gerichtlichen Schritten gegen den Kunden gedroht wurde, wenn
dieser sich nicht schriftlich beim Gesch&auml;ftsf&uuml;hrer der Firma Eagle, Rudi
Konjevic (die Namensgleichheit ist kein Zufall), f&uuml;r sein &quot;Verbrechen&quot;
entschuldigt. Dem Kunden selbst wurde eine Mail mit weiteren Androhungen
(Verh&auml;ngung einer Liefersperre, etc.) zugeschickt.
</P>
<P>
Gleichzeitig wurde dem Webmaster des besagten Amiga-Forums mit der
Schlie&szlig;ung seines Angebots durch Erwirken einer einstweiligen Verf&uuml;gung
gedroht, sollten darin vorgenommene Eintr&auml;ge des Kunden nicht gel&ouml;scht
werden. Der Webmaster lie&szlig; sich freilich nicht durch die Drohungen
einsch&uuml;chtern - rechtliche Konsequenzen hatte er sowieso nicht zu
bef&uuml;rchten.
</P>
<P>
Ich kann &uuml;ber die heftigen Reaktionen von Marcus Konjevic nur den Kopf
sch&uuml;tteln. Da stellt jemand in der &Ouml;ffentlichkeit ein paar gew&ouml;hnliche
Fragen - und schon wird ihm mit rechtlichen Schritten gedroht. Ja wo sind
wir denn??? Herr Konjevic scheint noch nichts von Meinungsfreiheit, einem
garantierten Grundrecht, geh&ouml;rt zu haben.
</P>
<P>
Ich kenne keine andere Amiga-Firma, die sich wegen des &ouml;ffentlichen
Nachsuchens um Hilfe zu einem ihrer Produkte, dazu hinrei&szlig;en l&auml;sst, mit dem
Staatsanwalt zu drohen. Selbst bei einer &ouml;ffentlichen Beschwerde, um die es
sich wie gesagt nicht handelte, greifen die allermeisten Firmen nicht zu
solch drastischen Schritten.
</P>
<P>
Es ist im &Uuml;brigen nicht das erste Mal, dass Eagle mit Schlagzeilen dieser
Art f&uuml;r negative Publicity sorgt, Marcus Konjevic hat in einem seiner
Postings eine Auseinandersetzung mit der Firma K&uuml;ster Datensysteme
angesprochen. Gut in Erinnerung ist mir auch ein Streit mit einem Kunden,
der ebenfalls die Qualit&auml;t eines von Eagle hergestellten Towergeh&auml;uses
bem&auml;ngelt hat und in dem das Unternehmen auch seinen Rechtsanwalt
eingeschaltet hat. Dabei handelt es sich &uuml;brigens um einen gewissen Herrn
G. Freiherr von Gravenreuth, der den meisten von uns vom Namen her nicht
ganz unbekannt sein d&uuml;rfte, hat er sich doch bei seiner Arbeit auf die
Computerbranche spezialisiert.
</P>
<P>
Herr Konjevic scheint ja von einem sehr schlechten Gewissen geplagt zu
werden, wenn das Drohen mit dem Rechtsanwalt zum Standard-Repertoire des
Unternehmens geh&ouml;rt. Kundenf&ouml;rderlich ist ein solches Verhalten ganz sicher
nicht, und ohne Kunden kann ein Unternehmen bekanntlich einpacken.
Vielleicht sieht Herr Konjevic das ein, bevor seine Firma wirklich in
Konkurs gehen muss.
</P>
<P>
Bis n&auml;chsten Monat,
</P>
<P>
euer
</P>
<P>
Carsten Schr&ouml;der
</P>
<P ALIGN="RIGHT">
<A HREF="Geruechte.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Main.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
