<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele6.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Review: Napalm</H2>
<P>
Am 23. Februar diesen Jahres war es endlich soweit: In meinem
Briefkasten fand ich ein P&auml;ckchen frisch aus Kanada, und was
war drin? Richtig, Napalm. Napalm kommt wie gewohnt in einer
CD-H&uuml;lle auf CD-ROM, die beide mit professionellem Design
aufwarten. Die Anleitung befindet sich als Booklet in der
CD-H&uuml;lle und ist leider komplett in englisch. Die
Installation erfolgt problemlos &uuml;ber den Commodore Installer.
Nun muss man Napalm noch konfigurieren, was auch &uuml;ber den
Commodore Installer l&auml;uft. Dazu sp&auml;ter mehr.
</P>
<P>
Die Story ist kurz und eindeutig: Es geht um einen Krieg
in naher Zukunft, indem Roboter versuchen die Menschheit
zu vernichten.
</P>
<P>
Im Setup kann man verschiedene Optionen einstellen, wie
zum Beispiel Aufl&ouml;sung, Soundeinstellungen, CD Musik
Einstellungen, Netzwerkeinstellungen und mehr. AHI und
TCP/IP werden noch nicht unterst&uuml;tzt, hier wird auf die
clickBOOM Homepage verwiesen. Nun noch die Einstellungen
speichern und los geht`s.
</P>
<P>
Nachdem kurzen, aber mit beeindruckenden Grafiken gespickten,
Intro befindet man sich im Hauptmen&uuml;, wo man einen neuen
Feldzug beginnen oder einen Alten laden kann. Au&szlig;erdem
kann man Netzwerk Einrichtungen vornehmen. Begleitet wird
das Ganze mit CD-Musik sowie Sprachausgabe. Nun muss
man sich f&uuml;r eine der Kriegsparteien entscheiden: Entweder
als Roboter gegen die Menschheit oder als Menschen gegen
die Roboter. Danach gibt es einige Informationen zur
n&auml;chsten Mission und danach befindet man sich im Spiel,
dessen Bildschirmmodus man festlegen kann. Auf AGA
Rechnern sollte man hier LowRes verwenden. Ist zwar
alles riesengro&szlig; dann, aber wenigstens relativ fl&uuml;ssig.
Grafikkarten Benutzer k&ouml;nnen da schon etwas tiefer
in die Trickkiste greifen.
</P>
<P>
Im Spiel kann man nun seine Einheiten, Soldaten und
Fahrzeuge, in beliebige Richtungen f&uuml;hren. Kommt man
in neues unentdecktes Gebiet, so wird dieses sichtbar.
Die Grafik und Animationen wurden mit viel Liebe zum
Detail erstellt und sind wirklich beeindruckend. Von der
Grafik her, k&ouml;nnte Napalm mit jedem PC Strategie Spiel
mithalten. Auch die Sounds und deren Qualit&auml;t &uuml;berzeugt
voll und ganz, so gibt es ja Sound FX und dazu noch
CD-Musik mit insgesamt 20 Tracks. Ein relativ hoher
Spielspa&szlig; rundet das Ganze ab. Vermissen tut man h&ouml;chstens
etwas mehr gegnerische Intelligenz und andere Terrains
wie z.B. Wasser oder W&uuml;ste. Internet Kompatibilit&auml;t
w&auml;re auch ganz nett, ist aber in Arbeit. Steurungstechnisch
h&auml;tte man Napalm auch noch ein wenig verbessern k&ouml;nnen.
</P>
<P>
Fazit: Napalm kann halten, was es versprochen hat.
Die Grafiken sind ungeheuer beeindruckend, die
Sounds und CD-Musik passen zur jeweiligen Atmosph&auml;re
und der Spielspa&szlig; l&auml;sst sogut wie nichts zu w&uuml;nschen
&uuml;brig au&szlig;er einige nicht so heftig ins Gewicht
fallende Sachen. Da Napalm das Commodore Locale System
unterst&uuml;tzt, wird eine deutsche &Uuml;bersetzung nicht
lange auf sich warten lassen. TCP/IP und AHI
Unterst&uuml;tzung sind in Arbeit, was will man mehr?
Kurzum: Napalm ist ein Knaller!
</P>
<P>
<A HREF="img/Napalm1.jpg"><IMG SRC="thumb/Napalm1.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A> <A HREF="img/Napalm2.jpg"><IMG SRC="thumb/Napalm2.jpg" WIDTH="120" HEIGHT="90" ALT="Screenshot"  BORDER="0"></A>
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:          Napalm                                                  |
|  Hersteller:    clickBOOM, ver&ouml;ffentlicht von PXL Computers, box 969,   |
|                 31 Adelaide St. East Toronto M5C 2K3, Ontario, Kanada   |
|                 <A HREF="mailto:info@clickboom.com">info@clickboom.com</A>                                      |
|  Preis:         99 DM                                                   |
|  Datentr&auml;ger:   1 CD-ROM                                                |
|  Genre:         Strategie              | Spieler: 1 oder 2              |
|  Sprache:       englisch               | Anleitung: englisch            |
|  System:        68020, 16MB Ram, CD-ROM, Festplatte. Grafikkarte empfo. |
|                                                                         |
|  Fazit:         Der Strategie Knaller 1999 a'la Command &amp; Conqueror     |
|                                                                         |
|  Wertung:                                                               |
|                             Grafik:     9/10                            |
|                             Sound:      8/10                            |
|                             Handhabung: 8/10                            |
|                             Spielspa&szlig;:  8/10                            |
|                             GESAMT:      86%                            |
+-------------------------------------------------------------------------+
</PRE>
<P ALIGN="RIGHT">
<A HREF="Spiele6.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
