<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele3.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>4. Spiele-News aus aller Welt</H2>
<UL>
<LI> Titan Computer stellt Total Combustion und SOTTM 2 ein
</LI>
</UL>
<P>
Die Ger&uuml;chte der letzten Monate, wurden nun offiziell von
Titan Computer best&auml;tigt. Angesichts der massiven Raubkopierei
sind diese beiden Projekte gescheitert. Die Entwickler sahen
keine vern&uuml;nftige Basis mehr ihre Projekte fortzuf&uuml;hren.
Im Klartext heisst das wiederum, dass jetzt nur noch an
Siedler 2 und Claws of the Devil gearbeitet wird. Man hofft,
dass diese Projekte nicht auch noch der Raubkopiererei zum
Opfer fallen. Also Leute, Finger weg von Raubkopien!
</P>
<UL>
<LI> clickBOOM Ger&uuml;chte
</LI>
</UL>
<P>
Anfang dieses Monats erschien ein Text von einem angeblichen
ex-clickBOOM Mitglied, das Myst auf den Amiga umgesetzt hat.
Er behauptet, dass clickBOOM seit einem Jahr nicht mehr existiert,
sondern nur noch Alexander Petrovic und dass dieser kein
Amiga-Fan sei, sondern es ihm nur ums Geld gehe. Er w&uuml;rde
den Amiga so schnell wie es nur geht verlassen, wenn er genug Geld
h&auml;tte. Au&szlig;erdem habe clickBOOM eine schlechte Zahlungsmoral
sowie falsche Versprechungen gemacht. clickBOOM hat indes
Klage gegen den Autor erhoben und klargestellt, dass alle
Behauptungen unwahr seien. Behauptet wurde unter anderem
auch, dass Capital Punishment ein illegales LHA Keyfile
beil&auml;ge und das Spiele mit einer Raubkopie von StormC
entwickelt worden w&auml;ren. An den Vorw&uuml;rfen zur Zahlungsmoral
scheint etwas dran zu sein, denn neulich hatte ich ein
Gespr&auml;ch mit dem Programmierer der Quake f&uuml;r clickBOOM
umsetzte: Er war auch total unzufrieden und sah sich Betruges
ausgesetzt. Er hat auch einige Updates f&uuml;r Quake entwickelt,
darf sie aber nicht ver&ouml;ffentlichen. Wer den Originaltext (50kb)
zu den Behauptungen haben m&ouml;chte, kann sich an mich wenden.
</P>
<UL>
<LI> clickBOOM News
</LI>
</UL>
<P>
Abgesehen von den Ger&uuml;chten gibt es nat&uuml;rlich auch einige
News von clickBOOM: Napalm ist endlich erschienen! In
dieser Ausgabe findet ihr zwei Tests des Spieles, das
mich in letzter Minute erreichte. Au&szlig;erdem scheint es,
als ob Trauma Zero jetzt bei clickBOOM erscheint, denn
im Napalm Booklet wirbt man f&uuml;r ein Spiel namens 'T-Zero'
mit dem Text 'A shoot-em-up to end all shoot-em-up`s'.
Laut Aussagen von clickBOOM Sprecher Sofia Tsiotsikas
wird es dieses Jahr von clickBOOM einige Umsetzungen von
PC Spielen geben sowie einige brandneue Amiga Spiele.
Die Qualit&auml;t soll nat&uuml;rlich auf clickBOOM Nivaeu bleiben.
</P>
<UL>
<LI> NtT Software sucht C Programmierer
</LI>
</UL>
<P>
Bei NtT Software sucht man immer noch einen erfahrenen
C Programmierer, der sich mit Adventure Spielen auskennt.
NtT Software arbeitet an Gork. Interessierte wenden
sich an Jonathan Jones &lt;<A HREF="mailto:jono@enti.demon.co.uk">jono@enti.demon.co.uk</A>&gt;
</P>
<UL>
<LI> Distant Space (Wasted Dreams) geht durch die letzte Testphase
</LI>
</UL>
<P>
Digital Dreams Entertainment hat best&auml;tigt, dass Distant
Space, ehemals Wasted Dreams, durch die letzte Testphase
geht. Danach soll es ver&ouml;ffentlicht werden.
</P>
<UL>
<LI> Gobi Software
</LI>
</UL>
<P>
Die polnischen Entwickler Gobi Software arbeiten momentan
an Xpedition, einem Shoot`em`up der Extraklasse. Ein altes
Demo von Xpedition gibt es auf der Webseite von Gobi Software
zum Download. Die fertige Version wird einen 68020 sowie
etwas Fast Ram ben&ouml;tigen und soll auf ECS und AGA lauff&auml;hig
sein.
</P>
<UL>
<LI> Hexen und Heretic f&uuml;r Amiga
</LI>
</UL>
<P>
Von den PC 3D Knallern Hexen und Heretic gibt es nun Amiga
Portierungen, nachdem der Quelltext ver&ouml;ffentlicht wurde.
In den letzten Wochen wurde die Ports erheblich verbessert
und sollten jetzt stabil laufen. Selbstverst&auml;ndlich liegen
alle Portierungen in 68k und PPC Versionen vor. Von Heretic
gibt es vier verschiedene Portierungen, jeder muss sich
die f&uuml;r sein System am besten laufende Version raussuchen.
</P>
<UL>
<LI> Alive Mediasoft News
</LI>
</UL>
<P>
Bei Alive Mediasoft kann man jetzt auch die verschiedenen
Portierungen beziehen. Es wurden folgende Portierungen in
das Sortiment aufgenommen: Descent, Heretic, Hexen, Abuse
und Total Quake. Putty Squad soll Ende Februar ver&ouml;ffentlicht
werden. Man darf gespannt sein!
</P>
<UL>
<LI> Maim &amp; Mangle kommt DOCH
</LI>
</UL>
<P>
George Hornmoen hat die Rechte sowie alle zugeh&ouml;rigen
Dateien des Commmand &amp; Conquer Klone Maim &amp; Mangle an The
World Foundry gegeben. Hier will man das mit Spannung
erwartete Spiel fertig entwickeln. Maim &amp; Mangle wird
komplett 3D sein, dass hei&szlig;t, es wird ein v&ouml;llig neues
Spielgef&uuml;hl geben. Au&szlig;erdem gibt es viele interessante
Add Ons wie TCP/IP Unterst&uuml;tzung und Multiplayer Unterst&uuml;tzung.
Maim &amp; Mangle ben&ouml;tigt einen 68040, 8MB Ram. Unterst&uuml;tzt
und empfohlen werden Grafikkarte sowie einen PowerPC.
</P>
<UL>
<LI> Sanios Software entwickelt Mage Wars
</LI>
</UL>
<P>
Mage Wars soll ein Spiel im Stil von Cannon Fodder werden,
welches dann sp&auml;ter von Crystal Software ver&ouml;ffentlicht
werden soll. H&ouml;chstwahrscheinlich noch dieses Jahr. Multiplayer
&uuml;ber Internet werden unterst&uuml;tzt. Au&szlig;erdem gibt es 20
verschiedene Arten von Gegnern.
</P>
<UL>
<LI> Es werden immer noch Programmierer f&uuml;r NEX gesucht
</LI>
</UL>
<P>
Das Team um Marco Siegel arbeitet momentan an NEX - The Dark Age.
Das Spiel soll wie Bladerunner nur in 3D werden. Klingt also durchaus
interessant. Die 3D Engine von NEX soll revolution&auml;r sein, so gibt
es MIP Mapping, Texture Filtering, Coloured lights, Lambert shading,
Polygon Feinde und Waffen. Das Spiel unters&uuml;tzt durch die Verwendung
von Warp3D auch Virge sowie Permedia2. Man soll mindestens einen
68040 besitzen und m&ouml;glichst auch eine Grafikkarte. Klar das auch
PowerPC unterst&uuml;tzt wird. Zur Fertigstellung des Projekts werden
allerdings noch C Programmierer gesucht, also wendet euch schnell
an Marco Siegel &lt;<A HREF="mailto:marco.siegel@hal.regiocom.net">marco.siegel@hal.regiocom.net</A>&gt; und lasst dieses
Spiel Wirklichkeit werden!
</P>
<UL>
<LI> Alive Mediasoft k&uuml;ndigt The Prophet an
</LI>
</UL>
<P>
Genau am 14. April soll The Prophet von Alive Mediasoft erscheinen.
Dabei handelt es sich um ein Dungeon Spiel im Stil von, na klar,
Dungeon Master. Es soll 'die n&auml;chste Generation der Rollenspiele'
sein. Man darf gespannt sein. Hier einige der Features: Es gibt
&uuml;ber 20000 verschiedene Locations in Stadt, Tempel, Keller, W&uuml;ste,
Friedhof und sogar in einer anderen Dimension. Au&szlig;erdem kennen
die Gegner viele verschiedene M&ouml;glichkeiten der Attacke und mehr.
</P>
<UL>
<LI> Quake 2 nun doch f&uuml;r den Amiga?
</LI>
</UL>
<P>
Wie ihr ja bestimmt schon aus dem AMIGA aktuell Special erfahren
habt, braucht ID Software genug Zuschriften, um es umzusetzen.
Wenn ihr also Quake 2 auch bald am heimischen Amiga zocken
wollt, schickt eine Email an <A HREF="mailto:quake2@digital-images.demon.co.uk">quake2@digital-images.demon.co.uk</A>
oder direkt an ID Software.
</P>
<UL>
<LI> Neue Spiele von Pagan Software
</LI>
</UL>
<P>
Pagan Software hat zwei neue Spiele angek&uuml;ndigt, Satellite 13
und Scavengers. Bei Satellite 13 handelt es sich um einen
Mix aus Beat`em`up und Point&amp;Click Adventure. Es gibt zwei
verschiedene Spielteile: Kampf- und Adventureteil. Satellite
13 ben&ouml;tigt einen 68030, 8MB Ram und erscheint nur auf CD-ROM.
Scavengers ist ein Space Action Adventure Spiel, welches
den Amiga bis zum letzten ausnutzen soll. Voll texturierte
isometrische echtzeit Locations geh&ouml;ren hier zum Standard.
Au&szlig;erdem gibt es Surround Sound, CD Audio Tracks und je nach
System Ausstattung Fullscreen Videos. Scavengers ben&ouml;tigt
mindestens einen 68040, 16MB Fast Ram, CD-ROM. Empfohlen
werden PPC und Grafikkarte.
</P>
<UL>
<LI> Bubble Heroes fertiggestellt
</LI>
</UL>
<P>
Bubble Heroes ist fertig. Nun wird ein Publisher gesucht.
Die Endversion soll &uuml;ber 70 Levels bieten genauso wie
20 CD Tracks. An TCP/IP und Grafikkarten Unters&uuml;tzung
wird gearbeitet. Eine Demoversion soll bald ver&ouml;ffentlicht
werden.
</P>
<UL>
<LI> Crystal Software News
</LI>
</UL>
<P>
Das lang erwartete Adventure Gilbert Goodmate soll in
Amiga und PC Versionen im Juli 1999 erscheinen. Zu den
Features z&auml;hlen &uuml;ber 45 handgezeichnete Locations von einem
Disney Grafiker, &uuml;ber 50 Charaktere zum Kommunizieren,
im Studio produzierte CD Audio Tracks, h&ouml;here Aufl&ouml;sungen
werden voll unterst&uuml;tzt und mehr. Dark Millenia, das
schon im Dezember ver&ouml;ffentlicht werden sollte, steht
anscheinend kurz vor dem Release. Dark Millenia ist
ein Spiel im Command &amp; Conquer Stil, nur dass es in
Fantasiewelten spielt. Zu den Features geh&ouml;ren 256
Farb Grafiken, Pseudo 3D Perspektive, alle Objekte
voll animiert, verschiedenes Wetter wie Regen und
Schnee, CD Musik und noch mehr. Selbstverst&auml;ndlich
arbeitet man noch an dem RPG Adventure The Holy Trinity.
Bei Dark Soul handelt es sich um ein Rollenspiel,
welches nur auf PPC und Grafikkarte l&auml;uft. Soundkarte
wird auch unterst&uuml;tzt. Es sind noch nicht viele
Details des Spiels bekannt, aber sicher ist, dass
alle Dungeons per Zufall berechnet werden, man spielt
also keinen Level zweimal. Mage Wars wird von Crystal
Software nur ver&ouml;ffentlicht, schaut mal weiter oben
nach f&uuml;r Infos zu dem Spiel. Abducted wird entwickelt
von Aftertaste Productions und es ist ein Adventure im
Stil von Monkey Island. Es ben&ouml;tigt AGA und besitzt
nur 256 Farb-Grafiken. Au&szlig;erdem gibt`s HAM8 3D Sequenzen
sowie 16bit Sound. Die Arbeit an Tanks Goblins wurde
dagegen eingestellt.
</P>
<P ALIGN="RIGHT">
<A HREF="Spiele3.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele5.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
