<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Spieleteil</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Spiele8.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Spiele.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Spieleteil
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Review: Imperator - Master of Rome</H2>
<P>
Das &uuml;berraschend ver&ouml;ffentlichte Spiel Imperator - Master of Rome
kommt in der altbekannten CD-H&uuml;lle auf 2 Disketten. Eine halbseitige,
englische Anleitung findet man ebenfalls in der CD-H&uuml;lle. Die Installation
erfolgt problemlos mit dem Commodore Installer.
</P>
<P>
Die Aufgabe des Spielers besteht darin, als r&ouml;mischer Tribun das
Reich auszuweiten und feindliche Angriffe zur&uuml;ckzutreiben sowie
sich selbst zum Imperator vorw&auml;rtszuarbeiten. Das Spiel ist in zwei
Teile geteilt: 60% machen das Strategiespiel aus und 40% den Schlachtteil.
</P>
<P>
Nach dem Starten des Spiels, das &uuml;brigens in AMOS Pro entwickelt wurde,
erscheint zuerst das Logo des Vertreibers Epic Marketing und das Logo
des Ver&ouml;ffentlichers Islona Entertainment. Danach wird man &uuml;ber
das Entwicklerteam informiert. Nun kann man die Anzahl der Spieler,
maximal 3, einstellen sowie einige andere Optionen wie Name,
Geschwindigkeit des Scrollen usw. Danach wird man gefragt, ob man
das Intro sehen m&ouml;chte. Dieses besteht aus einem Bild und ein paar
Zeilen Scrolltext.
</P>
<P>
Nun befindet man sich im Spiel, genaugenommen auf der Landkarte, wo
man seine Z&uuml;ge machen kann. Das Spielprinzip gleicht dem Amiga Klassiker
'Centurion', welches manch alter Amiga Hase noch kennen mag. Der
Spielspa&szlig; ist bei beiden Spielen etwa gleich, nur die Grafik ist
bei Imperator schlechter (!!), obwohl es fast ein Jahrzehnt sp&auml;ter
erschien.
</P>
<P>
Fazit: Imperator ist ein Spiel, das vielleicht vor 8 Jahren ein Hit
geworden w&auml;re. Wie die Mehrzahl der momentan erscheinenden Spiele
ist Imperator einfach nicht mehr zeitgem&auml;&szlig;, auch wenn der Spielspa&szlig;
einigerma&szlig;en ist. Die 16 Farben Grafik kann man getrost wegstecken.
Auch die hochgelobten Comic Grafiken im Asterix Stil &uuml;berzeugen
nicht. Pluspunkte f&uuml;r Imperator w&auml;ren, dass bis zu 3 Spieler teilnehmen
k&ouml;nnen und die vielen M&ouml;glichkeiten der Administration von
eingenommenen Provinzen. Auch ist das Spiel komplett in deutsch,
obwohl die Anleitung in englisch ist (?). Die Sounds sind in
Ordnung und teilweise recht am&uuml;sant. Ich denke, dass dieses Spiel
mit besserer Grafik sicherlich nicht unter der 80% H&uuml;rde
gescheitert w&auml;re.
</P>
<PRE>
+-------------------------------------------------------------------------+
|  Name:         Imperator - Master of Rome                               |
|  Hersteller:   Bernie Noel, ver&ouml;ffentlicht von Islona Entertainment,    |
|                vertrieben von Epic Marketing, Paul-Lechler-Strasse 4,   |
|                72076 T&uuml;bingen, Te.07071 63525, <A HREF="mailto:epicmarketing@dialin.net">epicmarketing@dialin.net</A> |
|  Preis:        49 DM                                                    |
|  Datentr&auml;ger:  2 Disketten                                              |
|  Genre:        Strategie              | Spieler: 1 bis 3                |
|  Sprache:      deutsch                | Anleitung: englisch             |
|  System:       Amiga mit 1,5MB Ram, Festplatte, OS2.x und PAL Monitor   |
|                                                                         |
|  Fazit:        Jaja, die Grafik...                                      |
|                                                                         |
|  Wertung:                                                               |
|                            Grafik:     2/10                             |
|                            Sound:      5/10                             |
|                            Handhabung: 8/10                             |
|                            Spielspa&szlig;:  5/10                             |
|                            GESAMT:      38%                             |
+-------------------------------------------------------------------------+
</PRE>
<P ALIGN="RIGHT">
<A HREF="Spiele8.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Spiele10.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
