<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Workshops</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#0000AA" ALINK="#000066" VLINK="#000066">
<TABLE width="100%" border="0" cellpadding="3" cellspacing="0">
<tr>
<td bgcolor="#000000">
<A HREF="Workshops.html"><IMG SRC="../menu/links.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&lt;&lt;"></A>
<A HREF="Workshops.html"><IMG SRC="../menu/hoch.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="Inhalt"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/rechts.gif" BORDER="0" WIDTH="15" HEIGHT="15" ALT="&gt;&gt;"></A>
<font color="#FFFFFF">
Workshops
</font>
</TD></tr>
</TABLE>
<BR>
<H2>Workshops / Hintergrundberichte / Buchvorstellungen</H2>
<H3>1. Bericht: Mit Miami &uuml;ber T-Online / ARCOR ins Internet (von Uwe Mann)</H3>
<P>
&raquo;Im letzten Jahr hatte ich mich entschlossen mit meinem Amiga 1200 ins
Internet zu gehen.
</P>
<P>
Ich hatte mit Daten&uuml;bertragung bis dahin noch nie etwas zu tun gehabt,
(ich habe allerdings schon bei einem Freund gesehen, wie man mit dem C64
ins BTX geht!! Das war Anno 1988!).
</P>
<P>
Mit den Zauberkisten die Commodore herausgebracht hat, ist eben alles
m&ouml;glich, erst recht mit einem Amiga....
</P>
<P>
Ein Problem ist auch, jemanden zu finden, der mit einem Amiga ins Internet
gegangen ist. Die Internetzugangsanbieter (Provider) haben alle zwar schon
geh&ouml;rt, dass das mit dem Amiga m&ouml;glich sei, k&ouml;nnen aber einem kaum Auskunft
geben.
</P>
<P>
Ich benutzte einen A1200 OS3.0 mit Blizzard IV und 16 MB Ram und eine
Quantum Fireball 1.2 Gb HD und nat&uuml;rlich ein Modem.
Ich habe ein SupraFax-Modem 28.8.
</P>
<P>
Das ist kein HighEnd-Amiga aber ausreichend schnell.
</P>
<P>
Um die Verbindung mit dem Internet herzustellen, fiel meine Wahl auf Miami
3.0 mit Lizenzcode.
</P>
<P>
Um die vielen sch&ouml;nen Internetseiten anzusehen, benutze ich Voyager 2.95.
F&uuml;r T-Online wird auch noch ein Btx-Prog. ben&ouml;tigt (z.B. Multiterm)!
F&uuml;r die E-Mails nehme ich Yam 1.35 und die sehr m&auml;chtige Yam-Betaversion
2.06.
</P>
<P>
In allen Zeitschriften stand in Leserbriefen, wie f&uuml;rchterlich schwierig es
sei, bei T-Online einzulogen. Ich bin nicht unbedingt ein Fan von T-Online
(wegen der angeblich hohen Geb&uuml;hren). Aber seitdem es zwei Telefonnummern
gibt, eine f&uuml;r BTX und eine, die haupts&auml;chlich f&uuml;rs Internet ist (BTX ist
allerdings auch m&ouml;glich), ist das eigenlich kein Problem mehr.
Miami installieren:
</P>
<P>
Kein Problem....
</P>
<P>
1. Disk einlegen, Installationsprogramm starten...
Miami entpackt sich erst einmal in die Ram Disk,
2. Disk einlegen, wird wiederum entpackt, und dann f&auml;ngt der
Installationsprozess an....
</P>
<P>
Es werden die ersten Files geschrieben, um dann ganz satt mit einer
Gururumeldung abzust&uuml;rzen..
</P>
<P>
Ich habe es noch 3x versucht, mit dem gleichen Ergebnis...
Dann habe ich den Rest von Hand mit Opus4.2 in die entsprechenden
Verzeichnisse gepackt.... Das f&auml;ngt ja gut an!
Miami sollte in der User-Startup mit assign Miami:  DHXYZ:Miami angemeldet
sein.
</P>
<P>
Verbindung zum Internet herstellen:
</P>
<P>
A) T-online :
</P>
<P>
Wenn die Auftragsbest&auml;tigung von T-Online da ist, kann's losgehen.
MiamiInit starten und den Anweisungen folgen.
</P>
<P>
Als erstes die Telefonnummer des Providers eingeben (0191011).
Aber Achtung, die Anschlusskennung LoginID (12 ziffern) steht in dem
dunklen Feld &uuml;ber dem pers&ouml;nlichen Kennwort (8 Ziffern).
Ich habe 30 Versuche gebraucht, um das zu erkennen!!
Ich dachte, die Anschlu&szlig;kennung ist meine eigene Telefonnummer!!
In irgendeiner Anleitung stand das so drin, aber bei T-Online bekommt man
praktisch eine eigene zweite Telefonnummer!!
MiamiInit stellt kurz eine Verbindung zum Internet her und handelt
s&auml;mtliche Daten&uuml;bertragunsprotokolle selbst&auml;ndig aus und speichert diese in
einer Datei ab (MiamiInit.config).
</P>
<P>
Diese Datei muss dann mit Miami einmal eingeladen werden und nun k&ouml;nnen die
Voreinstellungen abgespeichert werden.
</P>
<P>
Bei jedem Start von Miami braucht nun nichts mehr eingestellt zu werden.
Ich w&uuml;rde aber ruhig die Baudrate h&ouml;her einstellen als das Modem senden
k&ouml;nnte, bei meinem 28.8er habe ich auf 57.6 eingestellt.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Im Handbuch steht auch, dass man das Baudbandit.device nicht verwenden&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">soll, aber es funktioniert absturzfrei!&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">M&ouml;glich sind:&nbsp;</TD><TD VALIGN="TOP">serial.device&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">(original)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">das eigene serielle device von MIAMI!&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">Artser.device&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">8n1.device&nbsp;</TD><TD ALIGN="RIGHT" VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">und das&nbsp;</TD><TD VALIGN="TOP">Bautbandit.device.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Ohne Keyfile hat man mit Miami 1 Stunde Zeit, um im Internet herumzusurfen.
Mit MiamiRegister kann man sich online registrieren lassen.
Auf den Disks von Miami steht eine Nummer drauf.
</P>
<P>
MiamiRegister starten, alles Gew&uuml;nschte eingeben, samt Registrationsnummer,
das Program loggt sich selbst&auml;ndig ein, und wie von Geisterhand stehen nach
1-2 Minuten pl&ouml;tzlich 2 Keyfiles im MIAMI-Verzeichnis.
</P>
<P>
Beim n&auml;chsten Start von Miami prangt dann der eigene Name in Miami.
Nun kann man auch Miami beauftragen, eine Datei abzuspeichern, in der die
Zeit festgehalten wird, die man im Inet war.
</P>
<P>
Es gibt wundersch&ouml;ne PD-Prg. (z.B. MiamiPhone), die einem dann anhand
dieser Datei ausrechnen, wieviel der Provider an meiner Neugierde verdient
hat.
</P>
<P>
Jetzt aber erst einmal mit Voyager auf die Startseite von T-Online,
<A HREF="http://www.t-online.de" TARGET="_TOP">http://www.t-online.de</A>, und den  (Alias-) E-Mailnamen festlegen.
Ansonsten hat man nur eine Nummer in der E-Mailadresse.
Diese gilt auch weiterhin, wenn der Alias festgelegt wurde!!
</P>
<P>
Im E-Mail-Prog. Yam muss noch in der Konfig. der Name, E-Mailadresse (bei
T-Online mail.btx.dtag.de) und das Passwort von T-Online (auf der
Auftragsbest&auml;tigung) eingegeben werden!
</P>
<P>
Gro&szlig;es Problem!!!:
</P>
<P>
M&ouml;chte man das Passwort einmal &auml;ndern, wird es bei T-Online abenteuerlich!
Das Passwort MUSS im BTX-Netz ge&auml;ndert werden!
T-Online ist ja nicht nur Internetprovider, sondern verf&uuml;gt auch noch &uuml;ber
das alte BTX-Datennetz, und man hat das Recht, in beiden Datennetzen zu
surfen. Ich pers&ouml;nlich finde BTX einfach &auml;tzend, f&uuml;r jeden Sch... rupfen
die einem Geld ab, zus&auml;tzlich zu den Telefon- und Internetgeb&uuml;hren!!!
Das ist eine Mogelpackung, so &auml;hnlich wie von einem gro&szlig;en Softwarehaus,
wo man den Internetbrowser gleich mit dazubekommt.
</P>
<P>
Da es mit den Internetbrowsern f&uuml;r Amiga nicht (oder noch nicht) m&ouml;glich
ist, ins BTX zu gehen, braucht man ein BTX-Programm (z.B. Multiterm).
Also rein ins BTX mit 2400 Baud und ab auf Seite *72#, wo das Passwort
ge&auml;ndert werden kann (von Zeit zu Zeit)....
</P>
<P>
Weitere sch&ouml;ne Anwendungen f&uuml;r den Amiga im Internet:
</P>
<UL>
<LI> AMIGA aktuell bestellen,
</LI>
<LI> bei Andrew &quot;Mushroom&quot; Kellett in die Foundation-Mailinglist eintragen,
</LI>
</UL>
und man bekommt immer die neuesten Nachrichten &uuml;ber das &quot;Kultspiel&quot;
Foundation,
<UL>
<LI> mit Opus-Magellan ins Aminet und Prg. downladen (das Inet. als
</LI>
</UL>
Festplatte!!)
<UL>
<LI> per E-Mail PD-Software aus dem Aminet bestellen, die Prg. kommen
</LI>
</UL>
gesplittet und m&uuml;ssen mit einem speziellen ARexx-Befehl zusammengef&uuml;gt
werden. Die E-Mails sind ca. 63 KB lang und UU-kodiert.
<UL>
<LI> Yam 2.06 macht das aber schon. Aber Vorsicht!
</LI>
</UL>
Bei mir ist Yam 2.06 abgest&uuml;rzt, als mehr als 55 E-Mails eingegangen sind!!
<UL>
<LI> andere Leute mit E-Mails nerven.
</LI>
</UL>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Es gibt Leute, die haben einen 450MHz-PentiumII, sind im Internet,&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">vornehmlich beim Bertelsmann-AOL, und die wissen nicht, wie sie ein&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">angeh&auml;ngtes JPEG-Bild einer E-Mail &ouml;ffnen sollen......&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Daf&uuml;r kann man mit einem Amiga keine Filmchen sehen, die sich auf einigen
Seiten befinden...
</P>
<P>
B) ARCOR
</P>
<P>
Bei ARCOR braucht man keine Anmeldung!
</P>
<P>
Wer einmal ins Internet schnuppern will, ein Modem hat (eventuell zum
Faxen?), der sollte es ruhig einmal probieren.
</P>
<P>
Auf l&auml;ngere Sicht w&auml;re ein &quot;richtiger&quot; Internet-Provider aber besser, aus
mehreren Gr&uuml;nden:
</P>
<UL>
<LI> Das Problem mit der E-Mail-Adresse.
</LI>
</UL>
<P>
Arcor behauptet, dass sie mit LYCOS &quot;zusammenarbeiten&quot;.
</P>
<P>
Das ist v&ouml;lliger Bl&ouml;dsinn! Jeder kann nach LYCOS gehen und sich eine
(kostenlose) E-Mailadresse besorgen.
</P>
<P>
Man muss sich erst bei ARCOR einlogen, ins Inet und dann zu LYCOSMAIL
durchs halbe Internet klicken, zwei Passw&ouml;rter, die man bei der Anmeldung
bei LYCOSMAIL vereinbart hat, eingeben, um dann die E-Mails zu holen oder
abzusenden. (Das habe ich allerdings nicht ausprobiert, weil es mir zu bl&ouml;d
war. Ich habe es aber bei Freunden mit PC ohne Provider gesehen.)
Ich wei&szlig; allerdings nicht, ob das &uuml;berhaupt mit dem Amiga funktioniert
(mit Lycosmail).
</P>
<UL>
<LI> Die Geschwindigkeit l&auml;sst zu w&uuml;nschen &uuml;brig, wenn man nicht in der N&auml;he
</LI>
</UL>
eines Einwahlknotens ist.
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">MiamiInit starten und die Telefonnummer des Providers&nbsp;</TD><TD VALIGN="TOP">eingeben&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">(010700192070), als Benutzernahme (LoginID)   arcor&nbsp;</TD><TD VALIGN="TOP">eingeben.&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Das Kennwort&nbsp;</TD><TD VALIGN="TOP">ist&nbsp;</TD><TD VALIGN="TOP">internet&nbsp;</TD><TD VALIGN="TOP">.&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Das war es eigentlich schon.&nbsp;</TD></TR>
</TABLE>
<P>
MiamiInit stellt kurz eine Verbindung zum Internet her und handelt
s&auml;mtliche Daten&uuml;bertragunsprotokolle selbst&auml;ndig aus und speichert diese in
einer Datei (MiamiInit.config) ab.
</P>
<P>
Diese Datei muss dann mit Miami einmal eingeladen werden und nun k&ouml;nnen die
Voreinstellungen abgespeichert werden.
Startseite (wird aber nicht ben&ouml;tigt:)
<A HREF="http://www.call.arcor.net" TARGET="_TOP">http://www.call.arcor.net</A>
</P>
<P>
Kosten:
Ich habe die erste, konservative, Methode gew&auml;hlt.
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">Also bei mir hat sich die Telefonrechnung nicht ganz verdoppelt.&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">(ca. 70 -&gt;ca.130 DM)&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">T-Online: ab 21°°Uhr eine Telefoneinheit + 5 Pfg. in der Min.= 9 Pfg.&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">8 DM Grundgeb&uuml;hr&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">2 Freistunden&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
 Bleibt zu hoffen, dass T-Online das Versprechen wahr macht, ab April
 6 Pfg. in der Minute (Ja, macht T-Online; Anm. d. Red.)
</P>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">ARCOR:&nbsp;</TD><TD VALIGN="TOP">ab 18°°Uhr&nbsp;</TD></TR>
</TABLE>
<TABLE CELLPADDING="0" CELLSPACING="0">
<TR><TD VALIGN="TOP">6 Pfg. Verbindungsgeb&uuml;hr pro Einwahl + 12Pfg. in der Min. alles inklusive&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">Telefongeb&uuml;hren. Wird bei der n&auml;chsten oder &uuml;bern&auml;chsten Telefonrechnung&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">mit abgebucht....&nbsp;</TD></TR>
<TR><TD VALIGN="TOP">&nbsp;</TD></TR>
</TABLE>
<P>
Das w&auml;re es
</P>
<P>
Uwe Mann &lt;<A HREF="mailto:Uwe.Mann@t-online.de">Uwe.Mann@t-online.de</A>&gt;&laquo;
</P>
<P ALIGN="RIGHT">
<A HREF="Workshops.html"><IMG SRC="../menu/pfeil_links.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&lt;&lt;"></A>
<A HREF="Workshops2.html"><IMG SRC="../menu/pfeil_rechts.gif" BORDER="0" WIDTH="20" HEIGHT="20" ALT="&gt;&gt;"></A>
</P>
</BODY>
</HTML>
