<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Neues zum AmigaNG
-----------------

1. Die Zukunft des AmigaOS aus technischer Sicht (von Michael Christoph)

Es scheint heutzutage Mode zu sein, sich auf alles und jede Ank&uuml;ndigung von
Amiga, Inc. und Fremdfirmen zu st&uuml;rzen und diese in der Luft zu zerrei&szlig;en.
Es w&auml;re ja noch zu akzeptieren, wenn die Aussagen auch der Wahrheit
entsprechen w&uuml;rden oder begr&uuml;ndet w&auml;ren. Aber so wird letztendlich nur
der normale Anwender verunsichert!
Daher m&ouml;chte ich einmal von der technischen Seite (Programmierung)
klarstellen, was wirklich m&ouml;glich ist und was Phantasien sind.

Zuerst einmal muss klargestellt werden, dass Amiga, Inc. nichts aus Freude
an den Amiga-Anwendern macht, sondern nur, was sich "rechnet". Und der aus
Geldmangel eingelegte Zwischenschritt mit AmigaOS 4.0 kann durchaus als
"Selbstmord" seitens Amiga, Inc. enden!

Der PowerPC-Prozessor

Der PowerPC-Prozessor war "damals" bei Einf&uuml;hrung ein guter Prozessor mit
ausgezeichneten Leistungen. Allerdings hatten Motorola/IBM scheinbar nie
Interesse daran, mit dieser Prozessorfamilie Geld zu verdienen. Daher
wurden die Prozessoren immer nur in kleinen St&uuml;ckzahlen produziert und
meist die komplette Produktion an Apple verkauft. Wer sich an die Anf&auml;nge
der Amiga-PowerPC-Karten erinnert, dem werden die Lieferschwierigkeiten
wieder in den Sinn kommen. Und daran hat sich bis heute nicht viel
ge&auml;ndert.
Waren "seinerzeit" die PowerPC-Prozessoren durchaus ein Quantensprung, so
werden sie heutzutage von den Intel-Prozessoren weit hinter sich gelassen,
trotz deren schlechterer Technik. Auch aktuelle Tests mit 2-GHz-PowerPC-
Prozessoren werden daran nichts &auml;ndern, da diese noch nicht serienreif sind
und keine Motherboards daf&uuml;r existieren.
Wer also heute noch auf einen PowerPC besteht, hat bereits verloren - und
damit auch ein AmigaONE, sollte es ihn tats&auml;chlich einmal zu kaufen geben
(zur Zeit aktueller Erscheinungstermin ist Fr&uuml;hjahr 2002)!
Intel- (oder auch AMD-) Prozessoren liegen in ausreichender St&uuml;ckzahl, mit
hohen Taktfrequenzen und zu mehr oder weniger g&uuml;nstigen Preisen vor.
Erg&auml;nzt mit der heute &uuml;blichen Standard-PC-Hardware (USB, PCI-Steckpl&auml;tze,
Grafik- und Soundkarten, etc.) l&auml;sst sich preisg&uuml;nstig eine Amiga-Hardware-
Plattform zusammenstellen. Denn wer will schon 4000 DM zahlen, nur damit er
eine (im Vergleich) veraltete PowerPC-Hardware bekommt?

AmigaOS 4.0 PPC

Damit w&auml;ren wir dann auch gleich beim Grund, warum ein AmigaOS 4.0 PPC
keinerlei Akzeptanz finden wird - zumal immer noch nicht gekl&auml;rt ist, ob es
nun doch auf den "veralteten" PowerPC-Karten laufen wird oder nur auf dem
"neuen" AmigaONE.
AmigaOS 4.0 PPC soll unter der Regie von Hyperion Entertainment entwickelt
werden. In Wirklichkeit handelt es sich um ein OS 3.9, das teilweise auf
PowerPC umgesetzt sein soll. Es braucht aber immer noch alle Amiga-Custom-
Chips, um &uuml;berhaupt zu funktionieren. Erst ein sp&auml;teres AmigaOS 4.2 soll
ohne Amiga-Hardware-Komponenten auskommen.
Gravierender dabei ist aber, dass aufgrund des fehlenden Verkaufserfolges
von AmigaOS 4.0 kein Geld f&uuml;r das eigentliche AmigaDE (AmigaOS 5.0) mehr
zur Verf&uuml;gung steht.
Allein dieses hardwareunabh&auml;ngige System h&auml;tte eine reelle Chance am Markt
gehabt und sogar neue Benutzer anlocken k&ouml;nnen. Aber dank der PowerPC-
schreienden Anwender, werden wir wohl keines der beiden Produkte je
erhalten...

Die Zukunft des AmigaOS

Geht man nun von dem Szenario aus, dass kein AmigaOS mehr erscheinen wird
und Amiga, Inc. sich dadurch nicht am Markt halten k&ouml;nnen wird, stellt sich
unweigerlich die Frage nach der Zukunft des AmigaOS-Betriebssystems. Zwei
m&ouml;gliche Wege sind vorstellbar: AmigaOS wird OpenSource oder AROS wird das
neue AmigaOS (z.B. in Kombination mit MorphOS).
Es gab bereits Bem&uuml;hungen, das AmigaOS als OpenSource jedem zug&auml;nglich zu
machen. Das wurde bisher von Seiten Amiga, Inc. abgeschmettert, da immer
noch etwas Geld herauszuholen war. Wird das AmigaOS hingegen nicht mehr
weiterentwickelt und auch nicht als OpenSource bereitgestellt, so wird das
nach einer sehr kurzen Zeit das Ende des klassischen AmigaOS sein. Und AROS
holt immer weiter auf, auch wenn es bisher nur die Workbench 3.1
bereitstellt.

Auf der anderen Seite w&auml;re es dank der (teil)bereinigten OS-Sourcen schon
heute m&ouml;glich, diese f&uuml;r eine x86-Hardwareplattform zu kompilieren.
Problematisch ist in diesem Zusammenhang allerdings die starke
Verschmelzung von AmigaOS-Software mit der Amiga-Hardware. Und alle diese
Bereiche durch hardwareunabh&auml;ngige oder x86-basierende Devices zu ersetzen,
stellt einen enorm gro&szlig;en Arbeits- und Zeitaufwand dar. Ein flie&szlig;ender
&Uuml;bergang von AmigaOS 3.9 hin zu einem PowerPC- oder hardwareunabh&auml;ngigen
AmigaDE in einem Jahr kann somit wiederum als Wunschdenken klargestellt
werden, zumal Amiga, Inc. nicht die Geldmittel f&uuml;r ausreichend
Programmierer hat. Und auch wenn diese Arbeit bis zum Ende erledigt w&uuml;rde,
w&auml;re weiterhin nicht mehr m&ouml;glich als mit dem jetzigen AmigaOS - nur eben
schneller. Aber das k&ouml;nnen AmigaXL und Amithlon bereits heute ohne eine
Zeile Code&auml;nderung am Betriebssystem!
Und dass nach abgeschlossener Codeumstellung &Auml;nderungen und Erweiterungen
leicht zu implementieren sind, ist wiederum ein Wunschgedanke. Jeder
Programmierer, der sich seine ein Jahr alten Sourcen ansieht, wird dies
best&auml;tigen k&ouml;nnen.

Manche Erweiterungen, die sich heute im AmigaOS befinden, sind schon
erstaunlich, bedenkt man, aus welcher Zeit es stammt. Jedoch wurde manche
Erweiterung nicht "ins" Betriebssystem integriert, sondern nur
"daraufgesetzt" oder "hinzugeflickt" (z.B. CyberGfx, AHI). So funktionieren
z.B. Datei-Links auch heute noch nicht in allen Situationen einwandfrei.
Und andere Erweiterungen sind aus diesem Grund gar nicht m&ouml;glich, ohne die
alten Sourceteile komplett zu ersetzen.

Wirklich sinnvoll ist daher nur eine v&ouml;llige Neuprogrammierung des AmigaOS.
Problematisch ist zum einen die Beschaffung von f&auml;higen Programmierern.
Betrachtet man die Anzahl der zig hundert Programmierer bei Microsoft und
die "abschreckenden" Ergebnisse, wird dies sicher jedem deutlich werden.
Zum anderen k&ouml;nnen auch diese nicht im Handumdrehen ein neues OS aus dem
Boden stampfen. Dadurch entstehen bereits immense Vorkosten, die keiner
bereit ist, zu finanzieren - auch Amiga, Inc. nicht. Und so wird lediglich
an den bestehenden Sourcen herumgedoktert, anstatt diese zukunftstauglich
neu zu gestalten.

Randerscheinungen

Nicht direkt mit dem AmigaOS zu tun, aber trotzdem mit dem Amiga mehr oder
weniger verwoben, sind die folgenden Systeme. Sie werden der
Vollst&auml;ndigkeit halber erw&auml;hnt, auch wenn sie keinen Einfluss auf das
AmigaOS direkt haben.

AROS - wirklich ein Ersatz?

Unter diesen Gesichtspunkten stellt das von Grund auf neu programmierte
AROS durchaus eine m&ouml;gliche und hardwareunabh&auml;ngigere Alternative dar. F&uuml;r
den Anwender fehlen aber immer noch gro&szlig;e Teile und auch all die Neuerungen
seit AmigaOS 3.5 und 3.9 (z.B. das Reaction-GUI-System) vermisst man noch
v&ouml;llig. AROS k&ouml;nnte sich aber trotzdem in Zukunft noch weiter positiv
hervorheben.
Trotzdem ergibt sich auch hier das Dilemma. Bleibt AROS weiterhin AmigaOS-
kompatibel, damit dessen Programme laufen (so wie es vorgesehen ist),
fehlen die von den Anwendern verlangten Erweiterungen. Werden hingegen
diese Erweiterungen vorgenommen, bedeutet das den Wegfall aller bisherigen
Amiga-Programme. Diese k&ouml;nnten zwar einfach durch Neukompilierung wieder
zum Laufen gebracht werden, aber sehr viele Programme werden nicht mehr
aktiv gepflegt, die Sourcen sind nicht mehr auffindbar oder die
Programmierer sind verschollen.

AmigaXL und Amithlon

AmigaXL und Amithlon haben beide eine reelle Chance am Markt. Allerdings nur
im Amiga-User-Segment. Neue Anwender hingegen werden sich damit nicht
finden lassen. Daf&uuml;r sind sie f&uuml;r einen Au&szlig;enstehenden zu teuer zum
"Spielen".
Beide Emulatoren erreichen durch eine mehr oder weniger starke
Emulationsschicht, dass das AmigaOS auf "fremder" Hardware l&auml;uft. Beide
stellen somit keine Grundlage f&uuml;r ein neues AmigaOS dar. Und auch wenn die
Emulationsschicht in das Betriebssystem verlagert wird und Hardwaretreiber
zum Booten erstellt werden (so wie dies bei Amithlon der Fall ist), erkauft
man sich diese Vorteile mit dem Nachteil an zunehmender Inkompatibilit&auml;t
zum jetzigen AmigaOS.
Und ohne die Lauff&auml;higkeit der heutigen Programme kann kein OS bestehen.
Somit sind beide leider nur dazu geeignet, die altersschwache Amiga-
Hardware durch aktuelle und damit schnelle (Intel/AMD-) Systeme zu
ersetzen.

Pegasos - PowerPC-Hardware-Plattform

Das sogenannte Pegasos-Board von bPlan stellt einen Rechner auf Basis eines
PowerPC-Prozessors dar. Darauf lauff&auml;hig ist z.B. LinuxPPC. Auch MorphOS
und das kommende Amiga OS 4.2/5.0 sollen damit funktionieren. Der Preis
wird zeigen, ob es "erschwinglich" ist. Trotzdem wird aber ein AmigaOS
(oder ein anderes Betriebssystem) ben&ouml;tigt, um das Board zum Leben zu
erwecken.

MorphOS - PowerPC Hardware Abstraktion Layer

MorphOS stellt einen sogenannten Hardware Abstraction Layer dar. Das hei&szlig;t,
es schirmt die untenliegende Hardware vom obenliegenden Betriebssystem ab.
Die untenliegende Hardware ist dabei eine PowerPC-Hardware, w&auml;hrend obenauf
das normale AmigaOS verwendet wird. Die Aufgabe von MorphOS ist somit in
etwa mit UAE zu vergleichen. Es bildet die Amiga-Hardware-Chips (noch
unvollst&auml;ndig) nach. Das komplette AmigaOS muss im Emulationsmodus
betrieben werden, da es in 68k-Code vorliegt. Um wirklich einen Vorteil
davon zu haben, muss sowohl das Betriebssystem in PowerPC-Code vorliegen
(wozu OS 4.0 ein erster Schritt sein soll) als auch die einzelnen Programme
umgesetzt werden.
MorphOS ist damit mit Elate (von der Tao Group) zu vergleichen, das beim
AmigaOS 5.0 als "Hardwarelayer" zum Einsatz kommen soll.

Zum Schluss...

Abschlie&szlig;end m&ouml;chte ich nochmals klarstellen, dass ich mir auch eine
positivere Zukunft des AmigaOS w&uuml;nschen w&uuml;rde. Allerdings sehe ich die
Dinge sehr realistisch und habe mich schon lange vom Wunschdenken und den
"Scheuklappen" verabschiedet. Ich lasse mich auch gerne &Uuml;berraschen, was
Amiga, Inc. noch leistet (oder genauer gesagt, von anderen leisten l&auml;sst) -
aber erst wenn ich es auch tats&auml;chlich kaufen und benutzen kann.
Und daran scheitert es bereits seit langem...

Michael Christoph &lt;michael@meicky-soft.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
