<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
AMIGA-aktuell-Forum
-------------------

In dieser Rubrik sind die - bei den meisten anderen Magazinen getrennt
gef&uuml;hrten - Rubriken "Leserbriefe", "Kleinanzeigen", und "Problemecke"
zusammengefasst.

Wenn Ihr einen Beitrag habt, schreibt bitte an:

        Carsten Schr&ouml;der
        Helmoltstra&szlig;e 10
        37081 G&ouml;ttingen

E-Mail: aakt@aakt.de


1. Die Frage des Monats - wir m&ouml;chten eure Meinung erfahren

Jeden Monat stellen wir euch in dieser Rubrik eine Amiga-bezogene Frage
oder machen eine provokante Bemerkung (die &uuml;brigens nicht unbedingt unsere
Meinung wiedergeben muss), in der Hoffnung, dass ihr euch m&ouml;glichst
zahlreich mit Kommentaren zu Wort meldet. Wir werden eure Beitr&auml;ge in der
jeweils folgenden Ausgabe ver&ouml;ffentlichen. Schickt sie an aakt@aakt.de


Die Frage des letzten Monats lautete:

»Was meinst du, ist eher die x86- oder die PowerPC-Plattform (bzw. keine
von beiden) dazu in der Lage, die Situation des Classic-AmigaOS zu
verbessern?«


Dietmar Kretlow sieht f&uuml;r den Amiga weder im x86- noch im PowerPC-Prozessor
eine Chance: »Meiner Meinung nach hat der Amiga mit PPC (obwohl dieser
besser ist als ein Intel [Benchmark-Test]) keine Chance, und mit x86 erst
recht nicht. Ich benutze einen PC/Athlon mit Linux und bin voll zufrieden.
Welchen Vorteil sollte denn ein User haben, wenn er einen Amiga kauft...die
teure Hardware (und bei den geringen St&uuml;ckzahlen, die vom AmigaOne verkauft
werden, wird das teuer), die jedes andere System besser nutzen kann (ich
spreche von dem Softwareangebot)? Der AmigaOne ist (falls er &uuml;berhaupt
erscheint) doch ein zum Tod verurteiltes St&uuml;ck Hardware mit einem bekannten
Namen. Ich bin eigentlich der Meinung, dass AMIGA die User total egal sind,
die entwickeln doch jetzt nur noch ihren Player und lassen das OS von Haage
und Partner und Hyperion entwickeln (in beiden Unternehmen arbeiten nur
helle K&ouml;pfe), aber das verbessert die Situation auch nicht. AMIGA hat kein
Interesse am Desktop-Markt, und sie h&auml;tten auch keine Chance gegen
Microsoft und Linux. Die Sache mit der Hardwareunabh&auml;ngigkeit k&ouml;nnte da
zwar helfen, aber im Windows-Bereich wird es ".Net" geben, und als
Gegenspieler im Linux-Bereich das dazu kompatible "Mono". Was soll AMIGA
also f&uuml;r Chancen haben? Ich denke, dass sie ihr DE mittelfristig als PDA-
Aufsatz etablieren k&ouml;nnen, aber die richtigen Computer werden weiterhin mit
Windows, Linux oder MacOS betrieben.
Langfristig wird sich nur ein OS durchsetzen k&ouml;nnen...LINUX!!!!«


Andreas Korduan dagegen glaubt an den PowerPC: »Ich denke, dass eher der
PPC die Methode der Wahl ist. Ganz einfach deshalb, weil Apple es schon
vorgemacht hat, diesen Prozessor in der Grafikbranche zu etablieren. Wo
sieht man heute noch in Grafikstudios, wo diese auch entwickelt wird, einen
DosenPC?
Ich finde, AMIGA sollte es Apple gleichtun und f&uuml;r sich eigene Strategien
entwickeln und beweisen, dass Amigas in gewissen Bereichen besser sind als
Wintel's, und dies nicht nur mit Software, sondern auch mit Hardware unter
Beweis stellen.«


Roman Sechting favorisiert eine »68k+«-CPU: »Ich meine, keine der beiden
Prozessorreihen k&ouml;nnte dem Amiga helfen. Denn w&uuml;rde man ihn mit einem x86-
Prozessor ausstatten, h&auml;tte er zwar den Vorteil, dass man, wenn man ein
Jahr warten w&uuml;rde, den Rechner billig aufr&uuml;sten k&ouml;nnte, denn dann kostet
die CPU weniger als die H&auml;lfte. Nachteilig ist, dass man einen Emulator
einsetzen m&uuml;sste, der wiederum kostbare Rechenzeit verschlingen w&uuml;rde,
insbesondere wenn ihn Microsoft oder andere Patschenfirmen programmieren
w&uuml;rden (Abst&uuml;rze, min. 500 MByte RAM, 5000-MHz-Prozessor, 40-TByte-HD).
Auch ist zu beachten, dass die Teile f&uuml;r den PC vielleicht 10 Jahre aktuell
sind (Einf&uuml;hrung von DDR-RAM, RAM-Bus-Speicher, 64-BIT Prozessor, VESAPCI-
Steckplatz), man m&uuml;sste sich f&uuml;r fast jeden neuen Prozessor ein neues Board
kaufen!
Wenn &uuml;berhaupt, hat nur ein 68K+-Prozessor eine Chance, wenn es
Softwareschmieden gibt, die Programme f&uuml;r diesen Rechner schreiben, und
nicht Software f&uuml;r einen Rechner, der erst in der Zukunft gebaut wird. Und
nat&uuml;rlich muss der Preis stimmen.«


Gernod Schomberg setzt auf die x86-Reihe: »Ich glaube, dass die x86-
Plattform eher die M&ouml;glichkeit bietet, einem gr&ouml;&szlig;eren Anwenderkreis die
Vorz&uuml;ge des AmigaOS nahe zu bringen, weil die meisten Computer-Anwender
privat das gleiche Ger&auml;t benutzen, das sie von ihrer Arbeitsstelle her
kennen. PowerPC-Ger&auml;te w&uuml;rden sicher nur diejenigen ansprechen, die heute
noch Amiga-Hardware haben. Eine Bedingung w&auml;re aber, dass ein Amiga-
Emulator geboten wird, der ohne gro&szlig;e Klimmz&uuml;ge installiert werden kann.«


Nun zur aktuellen Frage des Monats. Sie befasst sich wiederum mit der
Amiga-Zukunft:

»Erwartest du von AMIGA, Inc. noch (f&uuml;r dich) positive Resultate? Warum
bzw. warum nicht?«


Schickt eure Beitr&auml;ge bitte an aakt@aakt.de

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
