<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
Messebericht
------------

1. Nachlese zur »Amiga 2001« in K&ouml;ln (von Petra Struck, amiga-news.de)

Petra Struck von unserem Partner amiga-news.de hat eine ausf&uuml;hrliche
Nachlese zur deutschen Messe »Amiga 2001«, die Mitte November in K&ouml;ln
stattfand, verfasst, die wir euch nicht vorenthalten m&ouml;chten:


»Die Messe AMIGA 2001, die am 17. und 18. November 2001 stattfand, wurde
von Falke Media organisiert und fand im K&ouml;lner Mediapark 6 auf ca. 600 qm²
Ausstellungsfl&auml;che statt. Unserer Sch&auml;tzung nach haben ca. 1000 User die
Messe besucht, wovon traditionell der L&ouml;wenanteil auf den Samstag fiel.


bplan GmbH - Pegasos-System
Hochinteressant war die erste offizielle Pr&auml;sentation des lauff&auml;higen
Pegasos-Rechners der bplan GmbH, auf dem das Betriebssystem MorphOS zum
Einsatz kommt. Gerald Carda demonstrierte uns ein Testprogramm, das
Plasma-Effekte darstellt. Unbeschleunigt (ungef&auml;hr
68060/50-Geschwindigkeit) stellt das Programm 4 Bilder pro Sekunde (FPS)
dar. Das gleiche Programm, kompiliert f&uuml;r MorphOS stellt 192 FPS dar.

Thomas Kn&auml;bel und Gerald Carda haben uns mitgeteilt, das Anfang Januar 2002
zwischen 100 und 200 Entwicklersysteme verf&uuml;gbar sein werden. Entwickler,
die daran interessiert sind, k&ouml;nnen sich in K&uuml;rze auf einer Anmeldeseite
bei bplan eintragen. Sollten sich mehr Entwickler melden, als Boards
vorhanden sind, wird eine Auswahl nach Programm-Priorit&auml;ten getroffen. Die
Entwickler sollten bei evtl. auftretenden Problemen Bugreports einsenden.

Rechner f&uuml;r Endanwender werden ca. 8 - 12 Wochen sp&auml;ter folgen. Diese
Rechner werden ca. 1.000 Euro kosten und es ist vorgesehen, das System mit
folgender Ausstattung zu liefern:

o 8 MB AGP-Grafikkarte
o 128 MB RAM
o DVD Laufwerk
o 20 GB Festplatte
o Maus und Tastatur

Screenshot:
<IMG SRC="../extra/pegasos.jpg" ALT="Screenshot">

Das interessante an Pegasos/MorphOS ist sicherlich, dass bestehende
PPC-Programme direkt auf diesem System gestartet werden k&ouml;nnen. Firmen wie
Titan-Computer und Epic interactive werden ihre Programme weitgehend auf
das System anpassen.


Haage&Partner - Amiga OS XL
Amiga OS XL, die neuen superschnellen Amiga-Emulatoren f&uuml;r x86-Rechner
wurden an drei verschiedenen Rechnern bei Haage&Partner demonstriert. Die
Geschwindigkeit ist beeindruckend und faszinierend zugleich.

Amiga OS XL besteht aus zwei Emulatorsystemen: AMIthlon und AmigaXL for
QNX, die im Bundle geliefert werden. Die Emulatoren sind sich in vielen
Dingen &auml;hnlich, doch gibt es auch grunds&auml;tzliche Unterschiede. Auf
aktueller PC-Hardware laufen damit g&auml;ngige Amiga-68k-Anwendungen um den
Faktor 10 - 20 mal schneller, als auf einem herk&ouml;mmlichen 68060-System.
Diese enorme Geschwindigkeit wird durch die Verwendung eines
modifizierten, beschleunigten Emulators erreicht. Damit erh&auml;lt man
turboschnelle Versionen von PageStream, ImageFX, ArtEffect, Cinema4D,
Real3D und allen anderen Programmen.

Das Highlight von Haage&Partner ist ein x86-Rechner, eingebaut in einen
Luxus-Tower mit edlem Design und installiertem AmigaOS XL. Der Korpus des
Rechners besteht aus Aluminium, die Front aus azurblauem Plastik.

Im Gespr&auml;ch zeigte sich H&P von der fast durchg&auml;ngig positiven Resonanz der
Besucher auf AmigaOS XL &uuml;berrascht, und war dar&uuml;ber erstaunt, dass trotz
aller Ver&ouml;ffentlichungen noch gro&szlig;er Informationsbedarf vorhanden ist. Die
Ums&auml;tze h&auml;tten besser sein k&ouml;nnen, waren aber zufriedenstellend.


Hyperion - AmigaOS 4.0 f&uuml;r PPC
Das interessanteste des zweiten Messetages war zweifelsohne unser Gespr&auml;ch
mit Ben Hermans, Thomas und Hans-J&ouml;rg Frieden von Hyperion Entertainment
&uuml;ber AmigaOS 4.0 f&uuml;r PPC. Es steht fest und ist vertraglich gesichert,
dass Hyperion AmigaOS 4.0 f&uuml;r PPC entwickeln wird. Angestrebter
Fertigstellungstermin f&uuml;r eine erste Verkaufs-Version ist Februar 2002.
Diese Verkaufsversion wird noch 68k-Code-Teile enthalten, die jeweils bei
Fertigstellung mittels Boing-Bag-Update nachgereicht werden.

Hyperion wird mit bplan zusammenarbeiten, damit AmigaOS 4.0 PPC auch auf
dem Pegasos-Rechner laufen wird. Hyperion hat au&szlig;erdem mit vielen anderen
Hardware- und Software-Entwicklern gesprochen, damit auch deren Produkte
zu AmigaOS 4.0 kompatibel sind. Damit wurde ein sehr positives Signal
gegeben, denn es wird nach langer Zeit wieder eine gemeinsame Linie und
Zielsetzung verfolgt.


Titan Computer - Nachtrag vom 20.11.2001

Highlight am Stand von Titan Computer war die Videoschnitt-Software "Motion
Studio" f&uuml;r MorphOS, die DV-Format lesen kann. Die Entwicklung der Software
ist soweit fortgeschritten, das sie voraussichtlich zusammen mit dem
Pegasos-Board von bplan herauskommen wird. Auf einem Beamer wurde
vorgef&uuml;hrt, was die Videoschnitt-Software schon zu leisten vermag. Eine
Portierung auf AmigaOS ist leider nicht m&ouml;glich, da Firewire ben&ouml;tigt
wird.

Weitere Anwender-Software in Entwicklung:
Das Office-Paket "Papyrus" ist zu 90% f&uuml;r MorphOS fertig und soll sp&auml;ter
auch auf AmigaOS 4.0 portiert werden.
Candy Factory II, eine Software zum Erstellen von Video-Titeln, Logos und
Webgrafiken f&uuml;r MorphOS. Die erstellten Bilder k&ouml;nnen &uuml;ber eine
Schnittstelle in Motion Studio importiert und verwendet werden.
Von Burn-IT Pro (DVD-Brennersoftware) wurde eine Vorversion f&uuml;r MorphOS
vorgef&uuml;hrt. Die endg&uuml;ltige Version soll bis April 2002 fertig werden.

Spiele in Entwicklung:
Neben der oben erw&auml;hnten Anwender-Software hat Titan-Computer auch zwei
neue Spiele in Arbeit: "Rage Hard" ist ein 3d Multiplay-Shooter &auml;hnlich
Counterstrike. Das Spiel wird f&uuml;r MorphOS und die neuen Amigas entwickelt.
Mit "Alien Nations", einem Aufbau-Strategie-Spiel, &auml;hnlich Siedler ist ein
weiteres Spiel in Entwicklung, welches f&uuml;r MorphOS und AmigaOS (PPC)
erscheinen wird.

Titan Computer wird soweit m&ouml;glich, deren Produktpalette an aktueller
Software auf MorphOS umsetzen.


DCE - G-REX
Thomas Dellert und Michael G&ouml;ken von DCE pr&auml;sentierten das PCI-Busboard
G-Rex, welches in einem A4000 mit Cyberstorm 604/68060 und AmigaOS 3.9
sowie WarpUP werkelte.

Auf der PCI-Karte waren eine USB-Karte f&uuml;r Maus und Tastatur; eine
Voodoo-Grafikkarte (3/3000), eine WIN-TV-Karte mit Radio und eine
Soundkarte (Terratec 512i) im Einsatz. Es gibt viele gute Argumente f&uuml;r
diese L&ouml;sung: Grafik-Geschwindigkeit, Wheel-Mouse und Multimedia-Tastatur
Unterst&uuml;tzung durch USB-Karte, 100 MB Netzwerk-Karte kann angeschlossen
werden; insgesamt ist der Einbau von kosteng&uuml;nstiger generischer
PC-Hardware durch das PCI-Busboard G-Rex m&ouml;glich geworden. Die Karte wird
f&uuml;r A1200 und A4000D und A4000T angeboten.


Elbox - Mediator
Elbox pr&auml;sentierte sein Mediator-System. Gezeigt wurde folgende Modelle:

o Mediator PCI ZIV
o Mediator PCI 1200
o Mediator PCI 4000
o Shark PPC G3/G4

Auch hier gelten die bereits bei DCE beschriebenen Argumente. Mithilfe
eines PCI-Busboards ist es m&ouml;glich, preiswerte PCI-Hardware f&uuml;r
verschiedenste Zwecke zu nutzen.


Weitere Hardware-Produkte

Jens Sch&ouml;nfeld von Individual Computers zeigte uns ein Vorserien-Modell der
Schnittstellenkarte VarioIO, die noch vor Weihnachten zu kaufen sein wird.
Die Delfina konnte leider nicht gezeigt werden.

Basierend auf einer Logitech 2-Tasten Maus hat Sch&ouml;nfeld eine echte Amiga-
bzw. Atari-Maus entwickelt. Auch hier wird die Produktion in den n&auml;chsten
Tagen anlaufen.

Thorsten Hansen von Kato Development zeigte uns den Prototypen des
Melody-Nachfolgers. Zus&auml;tzlich zu den Funktionen der Melody hat diese
Karte noch folgende Besonderheiten:

o MP3-Audios k&ouml;nnen in Echtzeit nicht nur dekodiert, sondern auch
  enkodiert werden.
o Analog-Mixer-Funktion
o Digital-Ein- und Ausgang (Optisch/Koaxial)


Michael B&ouml;hmer zeigte seinen USB-Controller Subway, mit dem Sie am
Uhrenport des A1200 g&auml;ngige USB-Ger&auml;te anschlie&szlig;en k&ouml;nnen. Bis zu vier
externe Ger&auml;ten k&ouml;nnen ohne zus&auml;tzlichen USB-Hub verwendet werden. VMC hat
mit der Entwicklung von Treibern bereits begonnen. Aktuell sind Treiber f&uuml;r
Maus und Tastatur verf&uuml;gbar. Geplant sind Treiber f&uuml;r Drucker,
Digital-Kameras und Scanner.

Screenshot:
<IMG SRC="../extra/subway.jpg" ALT="Screenshot">


Weitere Software-Produkte

Amiga Forever 5.0
Michael Battilana von Cloanto hat die neue Amiga Forever 5.0 pr&auml;sentiert.
Bei Amiga Forever handelt es sich um ein offiziell lizenziertes
Amiga-Emulations-Paket f&uuml;r Windows und weitere Plattformen. CD einfach in
das Laufwerk einlegen und auf das Icon klicken und es l&auml;uft. Enthalten
sind insgesamt acht verschiedene Emulations-Programme, alle n&ouml;tigen
Kickstart-ROMs, Workbenchs und Lizenzen sowie ein Rund-um-Paket an
n&uuml;tzlicher Amiga-Software.
Durch den neu eingebauten JIT-Compiler (just-in-time) ist Version 5.0 ca.
30 mal schneller als Amiga Forever 4. Die Emulation wird auf CD
ausgeliefert. Die CD enth&auml;lt das ber&uuml;hmte Video "The Deathbed Vigil" (1
Std. 59 Minuten) und das Video "Jay Miner Speech" (49 Minuten).
Amiga Forever 5.0 ist aber auch als downloadbare Online-Version erh&auml;ltlich.


epic interactive - THE FEEBLE FILES
epic k&uuml;ndigt THE FEEBLE FILES f&uuml;r Amiga an. Bei dem Spiel handelt es sich
um ein Cartoon-Adventure. Neben der Portierung auf MorphOS wird es auch
eine Version f&uuml;r AmigaOS geben. Die Amiga-Version wird in den komplett
lokalisierten Versionen Englisch und Deutsch (Sprachausgabe) erh&auml;ltlich
sein. Ben&ouml;tigt wird ein Amiga mit 4 MB Grafikkarte, 68060 oder PPC und
mindestens 32 MB Speicher.
Die Arbeiten an der Amiga-Version sind bereits angelaufen, und epic hofft,
das fertige Produkt noch vor Weihnachten 2001 ausliefern zu k&ouml;nnen.


Descent:Freespace
Hyperion zeigte das neue Spiel Descent:Freespace. Bei dem Spiel handelt es
sich um einen Weltraum-Shooter. Der Amiga-Port von Freespace ist zu 99.9%
fertig, und wird in K&uuml;rze &uuml;ber H&P als 68k (nur mit 3D-Hardware) und
PPC-Version erh&auml;ltlich sein. Wer auf der Messe vorbestellt hat, konnte
bereits eine kostenlose Demo-CD zum Testen mit nach Hause nehmen.


Project Crashsite
Markus Pohlmann (Programm) und Denis Comtesse (Musik) sind mit der
Entwicklung des Science-Fiction Rollenspiels Project Crashsite
besch&auml;ftigt. Der Handlungsort des Spiels ist ein kolonialisiertes zweites
System, dass aus vier Planeten und zwei Monden besteht. Der Spieler
&uuml;bernimmt die Rolle des "Future Security Corps", wobei es sich um die
Polizei dieses Systems handelt.

Ziel des Spiels ist, die instabile politische Lage innerhalb des Systems
zu stabilisieren. Das ist nicht einfach, weil eine gro&szlig;e Verschw&ouml;rung das
Machtverh&auml;ltnis verschiebt. Der Spieler wird fast ohne
Hintergrund-Information zur Verschw&ouml;rung in das Spiel geschickt, damit er
sich "Freund und Feind" selbst aussucht, denn abh&auml;ngig von seiner Wahl
wird das Spiel leichter oder schwerer.

Derzeit arbeiten insgesamt vier Leute in ihrer Freizeit an dem Spiel, daher
kann ein Fertigstellungstermin derzeit nicht genannt werden.


PuzzleBOBS
In Zusammenarbeit mit Emanuele Cesaroni von Nexus Development pr&auml;sentierten
Amiga Arena und Fun Time World in Partnerschaft das Spiel. Bei PuzzleBOBS
handelt es sich um einen "Bust´n Move" Clone. Eine Demoversion ist ab
sofort auf http://www.funtime-world.de/puzzle.html oder &uuml;ber die
Support-Seite der Amiga Arena erh&auml;ltlich.

Technische Hintergr&uuml;nde:

o PuzzleBOBS ist vollst&auml;ndig frei konfigurierbar
o Screenmodus (AGA / OCS / ECS / Grafikkarten, die zu Picasso96 oder
  CyberGraphX kompatibel sind).
o Farbtiefe: bis zu 16- und 24Bit-Schirmen
o Spielbar in drei Sprachen (Deutsch, Italienisch, Englisch)
o Spielbar von Festplatte, voll- oder teilweise installierbar (min. 14
  MB)
o 100% in Assembler programmiert
o Import von eigenen Levels und Sounds

Hintergr&uuml;nde, Blasen, Geschwindigkeiten, mit der sich Objekte bewegen,
Musik und Soundeffekte, Arten der Explosionen sowie massig weitere
Kleinigkeiten, k&ouml;nnen nach Belieben eingestellt und an die eigenen W&uuml;nsche
angepasst werden.

Das Spiel wurde so programmiert, dass die verschiedenen Blasen
unterschiedliche Charakteristika aufweisen k&ouml;nnen. So gibt es z.B. Blasen,
die zur&uuml;ckkommen, wenn sie eine Wand ber&uuml;hren, was den Schwierigkeitsgrad
nat&uuml;rlich nicht vereinfacht. Das Spiel l&auml;uft komplett im Multitasking und
kann sowohl auf einem eigenen Bildschirm als auch in einem
Workbenchfenster gespielt werden.

Ein besonderes Feature ist die Tatsache, dass das Spiel automatisch in den
Schlafmodus wechselt, wenn das Fenster inaktiv wird, so dass man auf der
Workbench weiterarbeiten kann. Dazu werden sogar alle Audiokan&auml;le sowie
die Farbpalette der Workbench wieder freigegeben.


Verschiedenes

GGS Data - Amiga Show
Gunne Steen vom schwedischen H&auml;ndler GGS Data informierte uns, dass am 2.
M&auml;rz 2002 (evtl. zus&auml;tzlich am 3. M&auml;rz 2002) eine Amiga-Show in G&ouml;teborg,
Schweden geplant ist. Die dazugeh&ouml;rige Website wird in ca. sieben Tagen
online gehen. Firmen und Usergruppen sind herzlich eingeladen, als
Aussteller an der Show teilzunehmen.


Psyria - Musik
Dennis Lohr hat uns auf der Messe eine CD &uuml;berreicht, auf der er seinen
Trance-Song f&uuml;r amiga-news.de verewigt hat. Der Song steht auch zum
Download bereit: Amiga News Theme (ca. 7 MB). Wir bedanken uns nochmals
ganz herzlich f&uuml;r die M&uuml;he, die sich Dennis mit diesem Song gemacht hat.
Es ist uns wirklich eine Ehre!


Annex - Musik
Daniel Schulz von Annex hat uns versichert, dass die durch verschiedene
Amiga-Songs bekannte Musik-Gruppe noch lebt. Inzwischen wurde viele neue
St&uuml;cke aufgenommen, Ausschnitte k&ouml;nnen als MP3 geladen werden.

Der Gesang fehlt noch, da die Gruppe noch auf der Suche nach einer S&auml;ngerin
ist. Die S&auml;ngerin sollte schon mal in einer Gruppe gesungen haben, aus dem
Bereich Dance/Trance kommen und im Rhein-Main-Gebiet leben. Interessierte
S&auml;ngerinnen wenden sich bitte (wenn m&ouml;glich mit Demo) an Daniel Schulz.
Geplant sind zwei Maxi-Singles mit je drei Songs und evtl. ein LongPlayer
mit allen Songs.


Virtual Dimension
Die Crew von Virtual Dimension hat f&uuml;r ihr Messevideo viele Interviews
gef&uuml;hrt und Aufnahmen gemacht. Das Video wird voraussichtlich vor
Weihnachten erscheinen.
Au&szlig;erdem stellte Virtual Dimension das runden- und textbasierte
Weltraumstrategiespiel StarEmpire II von Christian Becker vor. Es kann mit
bis zu 32 Mitspielern gespielt werden.


Airbrush Paradise Tingler
Rolf Tingler hat mit seiner Airbrusharbeit diverse Gegenst&auml;nde mit
unterschiedlichsten Motiven versch&ouml;nert. Haupts&auml;chlich waren nat&uuml;rlich
Motive mit Boingb&auml;llen gefragt. Angefangen vom Handy bis hin zum Schweizer
Taschenmesser wurde alles mit Airbrush "geboingt".


Fazit:

Es wurden interessante Hard- und Softwarel&ouml;sungen gezeigt. Auf der Messe
herrschte gute Stimmung und &uuml;berall waren intensive Diskussionen in Gang.
Dennoch muss gesagt werden, dass trotz aller Neuigkeiten und trotz der
positiven Signale einige wichtige Fragen offen geblieben sind, denn weder
Amiga Inc., noch Eyetech oder Escena waren anwesend. Hier besteht
Erkl&auml;rungsbedarf bez&uuml;glich der Pl&auml;ne von Amiga Inc. zum AmigaOne.

Abschlie&szlig;end noch ein kritisches Wort zur Organisation. Die G&auml;nge an den
"Brennpunkten" in der oberen Etage waren viel zu eng, es herrschte
teilweise ein so m&auml;chtiges Gedr&auml;nge, dass man nur schwer an die St&auml;nde
herankam.

F&uuml;r amiga-news.de waren Christoph Dietz, Petra Struck sowie Meike Hilke f&uuml;r
die Fotos vor Ort.«

Petra Struck &lt;ps@amiga-news.de&gt;


Die Original-Version des Berichts ist im Internet auf
http://www.amiga-news.de/de/news/AN-2001-11-00195-DE.html zu finden.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
