<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Review: HereticII-AddOn »Maws of the Umbra« (von J&uuml;rgen Theiner)

Abode of Golgotha II!

Die Saga geht weiter! Maws of the Umbra (ab jetzt immer kurz MotU genannt)
f&auml;ngt da an, wo Abode of Golgotha aufh&ouml;rt. Alles soll besser sein als beim
ersten AddOn, das beweist schon die sagenhafte Zahl von 30 MByte, welche
das Programm umfasst. Waren beim ersten Teil nur mickrige 4 MByte
herunterzuladen, wei&szlig; man sp&auml;testens jetzt, wof&uuml;r DSL gut ist. Die
Installation ist &auml;hnlich wie bei Abode: Man entpackt den MotU-Ordner in
sein HereticII-Verzeichnis (MOTU.bat, MOTU.ico, DeIsL1.isu, _DEISREG.ISR
und ISREG32.ILL k&ouml;nnen gel&ouml;scht werden). Dann startet man Heretic II &uuml;ber
den Launcher, wobei man bei RunAddon MotU eingibt. Wenn Heretic II dann
l&auml;uft, wird es "etwas" komplizierter. Man wechselt in die Konsole (^), und
musste man bei Teil 1 jetzt nur noch map golgotha/golgotha eingeben, hei&szlig;t
es nun map motu/phireres. Ui, wie kompliziert.
Nun dauert es nat&uuml;rlich etwas l&auml;nger als bei Abode, aber dann kann es auch
mit Maws of the Umbra endlich losgehen. Nutzen wir doch die Ladezeit, uns
die Hintergrundstory etwas zu Gem&uuml;te zu f&uuml;hren.

The story continues...

Wie gesagt, MotU f&auml;ngt da an, wo Abode of Golgotha endet. (Wer den ersten
Teil durchgezockt hat, wei&szlig; also, warum Suraea nicht mehr dabei ist). Am
dritten Tag erkennt er in der Ferne die Stadtmauer von Phire, seiner
Heimat. "Ich habe es geschafft," sagt Kurien zu sich selbst. "Ich bin
zuhause."

Nat&uuml;rlich gibt es viel zu erz&auml;hlen. Vor allem Jaster, Sureas Vater will
alles &uuml;ber die Reise wissen.

Am n&auml;chsten Tag hat Jaster eine Ank&uuml;ndigung zu machen:

"Meine Freunde. Diese Stadt wurde schon immer von den tapfersten Wachen
besch&uuml;tzt. Wie auch immer, es gibt einige M&ouml;glichkeiten der Verteidigung,
die auch der mutigste Mann nicht beherrscht. Ich spreche von magischer
Verteidigung! Die n&auml;chste Schule f&uuml;r Magie ist meilenweit entfernt, und so
hatten wir bisher keine M&ouml;glichkeit, dieses Mittel unserem Schutz
hinzuzuf&uuml;gen. Bis jetzt! Kurien ist zu einem m&auml;chtigen Magier
herangewachsen. Er beherrscht Zauber, von denen wir nur tr&auml;umen k&ouml;nnen."
Jaster wendet sich an Kurien. "Deshalb frage ich dich jetzt: M&ouml;chtest du
den Posten als Leiter der magischen Verteidigung &uuml;bernehmen?"

Welche bessere M&ouml;glichkeit gibt es, seiner Heimatstadt zu dienen? "Ich
akzeptiere!" ruft Kurien, der Rest geht im Applaus der Menge unter.

Wer sich das Teil nicht besorgt, ist selbst Schuld! Klar, man muss schon
einen HighEnd-Amiga haben, um dieses AddOn spielen zu k&ouml;nnen, aber wer &uuml;ber
die n&ouml;tige Hardware verf&uuml;gt (und die Vollversion von Heretic II besitzt),
kann hier ohne zu z&ouml;gern zuschlagen. Wie im ersten Teil zieht einen die
spannende Story und das durchdachte Leveldesign sofort in den Bann. Aber
anders als bei Abode of Golgotha gibt es bei MotU eigene Texturen, so dass
Kurien endlich nicht aussieht wie Corvus. Auch gibt es wieder neue
Cutscenes, die f&uuml;r eine bombastische Stimmung sorgen. Wer Heretic II gern
gespielt hat, wird die Abode of Golgotha-Saga lieben. Der erste Teil war
nur ein Vorgeschmack auf diesen Hammer. Maws of the Umbra ist ein Spiel der
Extraklasse! Und dazu ja auch noch kostenlos. Es gibt nur einen Nachteil:
Oliver Smiles hat sich entschlossen, die Abode-Saga nicht mehr
fortzusetzen. Schade eigentlich, aber wenn ihr das Teil durchgezockt habt,
ist bestimmt Freespace schon fertig, so dass keine Langeweile aufkommt.

Screenshot:
<IMG SRC="../extra/MotU1.jpg" ALT="Screenshot">

Screenshot:
<IMG SRC="../extra/MotU2.jpg" ALT="Screenshot">

Screenshot:
<IMG SRC="../extra/MotU3.jpg" ALT="Screenshot">

J&uuml;rgen Theiner &lt;Juergen.Theiner@t-online.de&gt;

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
