<HTML>
<BODY ALINK=#FFAA00 VLINK=#000077 LINK=#0022CC BGCOLOR=#FFFFFF TEXT=#000000>
<TABLE BORDER=0 WIDTH="100%">
<TR><TD><PRE>
4. Update: So senkt ihr eure Telekom-Rechnung!

Die Tabelle der g&uuml;nstigsten Ferngespr&auml;chsanbieter hat sich seit der letzten
Ausgabe zwar nicht ver&auml;ndert, daf&uuml;r sind nun per Call-by-Call aber auch
Ortsgespr&auml;che m&ouml;glich - der Anbieter Telediscount hat Entsprechendes vor
Gericht erstritten. Der g&uuml;nstigste Anbieter in diesem Bereich ist von nun
an regelm&auml;&szlig;ig unterhalb der Ferngespr&auml;chsliste vermerkt.

Nun aber noch eine Frage in eigener Sache: Besteht &uuml;berhaupt Interesse, an
dieser Rubrik (wir erhalten so gut wie keine R&uuml;ckmeldungen)? Wenn ja, dann
schickt bitte eine entsprechende E-Mail an aakt@aakt.de, denn ansonsten
k&ouml;nnen wir uns die monatliche Ver&ouml;ffentlichung der Call-by-Call-Liste auch
sparen!


Hier nun die aktuelle Tariftabelle:

G&uuml;nstigster Call-by-Call-Anbieter (ohne Anmeldung, Mindestumsatz, etc.):

Wann:    |        Wohin:  Festnetz -&gt; Festnetz    Festnetz -&gt; Mobilfunknetz
===========================================================================
werktags 7-8 Uhr        prompt (01055), 4,7 Pfg.     01024 (01024), 37 Pfg.
werktags 8-18 Uhr       01024 (01024), 5,9 Pfg.¹     01024 (01024), 37 Pfg.
werktags 18-21 Uhr      o.tel.o (01011), 4,3 Pfg.    01024 (01024), 37 Pfg.

sa/so/feiert. 7-21 Uhr  o.tel.o (01011), 4,3 Pfg.    01024 (01024), 37 Pfg.

t&auml;glich 21-22 Uhr       Ventelo (01040), 4,1 Pfg.    01024 (01024), 37 Pfg.
t&auml;glich 22-7 Uhr        Talkline (01050), 3,7 Pfg.   01024 (01024), 37 Pfg.

Ortsgespr&auml;che k&ouml;nnen rund um die Uhr &uuml;ber Telediscount (0190035) f&uuml;r 6
Pfg./min.¹ gef&uuml;hrt werden, wobei der Anbieter in der Hauptzeit g&uuml;nstiger
ist als die Deutsche Telekom und in der Nebenzeit eine
verbraucherfreundlichere Taktung hat.

¹: G&uuml;nstiger ist Teledump (0190031), 5,5 Pfg., die Leitungen dieses
   Anbieters sind jedoch in weiten Teilen Deutschlands st&auml;ndig &uuml;berlastet.

(Alle Angaben ohne Gew&auml;hr)


Die Tabelle sollte im Wesentlichen selbsterkl&auml;rend sein, trotzdem einige
Anmerkungen:

* Angegeben ist jeweils der f&uuml;r 1 Verbindungsminute f&auml;llig werdende Betrag.

* 'Werktags' bedeutet montags bis freitags mit Ausnahme von Feiertagen.

* Bei Ortsgespr&auml;chen hat die Telekom in weiten Teilen Deutschlands noch ein
  Quasi-Monopol. Erst in wenigen Regionen bieten andere Gesellschaften
  g&uuml;nstige City-Tarife an. In der Regel hei&szlig;t es also bei Ortsgespr&auml;chen:
  Weiterhin die Deutsche Telekom benutzen.
  Auf http://www.muc.de/~hm/telefon-tarife/tarifzonen.html k&ouml;nnt ihr
  &uuml;brigens eure Ortsnetzabgrenzung in Erfahrung bringen. Denn sonst k&ouml;nnte
  es mal passieren, dass ihr "f&auml;lschlicherweise" einen der alternativen
  Anbieter benutzt, obwohl die Verbindung noch zum Ortstarif der Telekom
  - und damit wom&ouml;glich billiger - zustande kommen k&ouml;nnte.

* Bei Auslandsgespr&auml;chen l&auml;&szlig;t sich dagegen teilweise drastisch sparen,
  jedoch hat fast jedes Land einen anderen g&uuml;nstigsten Anbieter, so dass
  sich hier keine pauschale Aussage machen l&auml;sst. Allerdings gibt es im
  Internet Sites, auf denen sich der jeweils g&uuml;nstigste Tarif berechnen
  l&auml;sst. Mein Favorit: http://www.teltarif.de

* Alle in der Tabelle oben aufgef&uuml;hrten Anbieter rechnen im Minutentakt ab.
  Anbieter, die in einem - wie wir meinen unfairen - Mehr-Minuten-Takt
  abrechnen oder eine pauschale Verbindungsgeb&uuml;hr erheben, werden nicht
  ber&uuml;cksichtigt.

F&uuml;r weitere Informationen zu diesem Thema siehe AMIGA aktuell 8/98.

</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
</PRE></TD></TR>
</TABLE>
</BODY>
</HTML>
