<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Vakiot</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>Posti</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Kirjeit&auml; toimitukselle</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Uusittu html-koodi on todella hienon n&auml;k&ouml;inen, sen suunnittelijat ovat todellakin osanneet hommansa! Vihdoinkin html-Saku on kansainv&auml;lisestikin mitattuna ainutlaatuinen my&ouml;s ulkoasunsa puolesta...<br>
						<br>
						<font size="2">Teemu Pohjanlehto</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Onko olemassa jotain ohjelmaa/patchia, jolla saisi vanhat ohjelmat k&auml;ytt&auml;m&auml;&auml;n muuta kuin parallel.device&auml; tulostamiseen?<br>
						<br>
						<font size="2">Petteri Bamberg</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Piti sitten t&auml;m&auml;kin n&auml;hd&auml;! Oli ihan vaan aikomus poiketa pikaisesti vilkaisemassa ja vier&auml;htikin parisen tuntia kevyesti vanhoja lehti&auml; selaillessa. Tied&auml; sitten, olenko vain helposti jallitettavissa mukaan, mik&auml;li Amigasta on kyse, mutta taisittepa saada yhden vakilukijan lis&auml;&auml;! Jallittamisesta puheenollen muuten vinkki Amiga-k&auml;ytt&auml;jien ilmeisen vinon sukupuolijakauman korjaamiseksi: oletteko miehenpuolikkaat tulleet ajatelleeksi, miten paljon potentiaalia l&ouml;ytyy mahdollisen, enemm&auml;n tai v&auml;hemm&auml;n vakituisen, naisseuralaisen suunnalta?<br>
						<br>
						Jaa mist&auml; moinen v&auml;ite? No, itse olen ajautunut miehen vuoksi about seuraavaa reitti&auml;: &quot;Hui, tietsikka!&quot; -&gt; Klikkaa-t&auml;t&auml;-ikonia-kaksi-kertaa-niin-Final-Writer-k&auml;ynnistyy -&gt; Modeemi &amp; s&auml;hk&ouml;posti -&gt; muutama oleellinen shell-komento -&gt; kysymyksi&auml; tyyliin &quot;Miten Amiga sitten eroaa Windowsista?&quot; -&gt; paatoksellisten luentojen kuuntelua aiheesta &quot;Amiga vs. MS&quot; -&gt; lis&auml;&auml; perehtymist&auml; -&gt; leikkimielinen v&auml;ittely Microsoft-fanin kanssa -&gt; oman A1200:n hankinta -&gt; viel&auml; vaan perehtymist&auml; -&gt; pienimuotoista oman koneen virittely&auml; -&gt; huolestuttavaa surffailua Aminetiss&auml; -&gt; eksyminen Sakun kotisivuille. Mit&auml; seuraavaksi? Voiko t&auml;m&auml; t&auml;st&auml; edet&auml; en&auml;&auml; kuin huonompaan? Noh, henkil&ouml;kohtaisesti olen sit&auml; mielt&auml;, ett&auml; huonomminkin voisi miehen kanssa k&auml;yd&auml;;-D Mist&auml; sit&auml; siis tiet&auml;&auml;, vaikka samantapainen sneaking-l&auml;hestymistapa purisi muihinkin?<br>
						<br>
						Toteuttakaapa taas joskus lukijakysely, ett&auml; p&auml;&auml;sen min&auml;kin vastaamaan!<br>
						<br>
						<font size="2">Sirpa P</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Onpahan tullut mieleen tyhm&auml;hk&ouml; kysymys... Amigallehan on Mac-emuja vaikka kuinka, mutta onkohan Macille tehty Amiga-emua? Periaatteessahan sen pit&auml;isi olla yht&auml; helppoa, sama piirisarja yms. iMac, G4 ja OS3.5 olisi aika mielenkiintoinen yhdistelm&auml;<br>
						<br>
						<font size="2">AmiMac</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">AmigaOS 3.5:n mukana toimitettu AmigaMail-s&auml;hk&ouml;postiohjelma l&auml;hettelee postinsa mukavasti, mutta viestien vastaanottonappi vain vilauttaa ruudulla odottavien viestien kilom&auml;&auml;r&auml;&auml; eik&auml; aloita tiedonsiirtoa. Mik&auml; avuksi?<br>
						<br>
						<font size="2">&quot;Taasko sit&auml; buranaa?&quot;</font><br>
						<br>
						<hr noshadow noshade size="1">
						<br>
						Vastaus:<br>
						<br>
						Syyst&auml; tai toisesta POP-palvelimelle vakiona asetettu Spool File -asetus ei ole toimiva, joten avaa Configure-ikkuna ja aseta sielt&auml; POP-v&auml;lilehdelt&auml; k&auml;ytt&auml;m&auml;si palvelimen Spool File avaamalla tiedostovalitsin ja valitsemalla tiedosto Spool/FOLDER AmigaMailin hakemistosta.<br>
						<br>
						<font size="2">Janne Sir&eacute;n</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Eik&ouml; Amigat ole viime vuosisadan juttu? Mit&auml; j&auml;rke&auml; on kehitt&auml;&auml; Amiga-tietoutta, kun niist&auml; ei ole k&auml;yt&auml;nn&ouml;llisesti katsoen mit&auml;&auml;n hy&ouml;ty&auml;, kun kaikki tehd&auml;&auml;n PC:ll&auml; tai Macintosheilla! Onko yhdistyksen todellinen tarkoitus her&auml;tt&auml;&auml; nostalgisia tunteita johonkin viissataseen? Yht&auml; hy&ouml;dyllist&auml; olisi sitten saman tien tehd&auml; Sinclair Spectrum -yhdistys.<br>
						<br>
						<hr noshadow noshade size="1">
						<br>
						Vastaus:<br>
						<br>
						Kiitos ajankohtaisesta ja monia yhdistystoimintamme ulkopuolisia askarruttavasta kysymyksest&auml;. Itse n&auml;en asian niin, etteiv&auml;t Amiga ja PC ole en&auml;&auml; puoleen vuosikymmeneen edes olleet mit&auml;&auml;n kilpakumppaneita, vaan aivan erilaisille kohderyhmille muovautuneita platformeja. Monia Amigan hy&ouml;tyohjelmia kehitet&auml;&auml;n edelleen, ja koneen suorituskyvyn parantelu lis&auml;laitteiden avulla on mahdollista, joten miksi luopua koneesta ja ohjelmista, joita on oppinut k&auml;ytt&auml;m&auml;&auml;n luotettavasti ja tehokkaasti hyv&auml;kseen? Ja k&auml;ytt&ouml;ymp&auml;rist&ouml;st&auml;, jonka kokee miellytt&auml;v&auml;mm&auml;ksi kuin mit&auml; muut j&auml;rjestelm&auml;t pystyv&auml;t tarjoamaan?<br>
						<br>
						Uusien Amiga-mallien tai vastaavien markkinoilletulokaan ei edelleenk&auml;&auml;n ole poissuljettu mahdollisuus, ja vaikkei niit&auml; koskaan n&auml;ht&auml;isik&auml;&auml;n, pysyy nykyinenkin konemallisto laajennusten avulla k&auml;ytt&ouml;kelpoisena viel&auml; pitk&auml;&auml;n. Sanoisinkin, ett&auml; viestisi kuvastaa todella erinomaisesti sit&auml;, kuinka v&auml;h&auml;n Amigan nykytilasta yleens&auml; tiedet&auml;&auml;n. Tavallaan siis vastasit itse omaan kysymykseesi: t&auml;h&auml;n juuri Amiga-tietouden kehitt&auml;mist&auml; tarvitaan. :-)<br>
						<br>
						<font size="2">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Tuossa olisi muuten Suomen Amiga-k&auml;ytt&auml;jien yhdistykselle mukava &quot;markkinarako&quot;. Voitaisiin porukalla rekister&ouml;id&auml; yleisimpi&auml; ohjelmia vaikkapa maksamalla rekister&ouml;intimaksut yhdistyksen tilille, josta sitten valuutat siirrett&auml;isiin yhdell&auml; kertaa eteenp&auml;in ohjelman tekij&auml;lle.<br>
						<br>
						Esimerkiksi yhdistyksen kotisivulla voisi lukea tyyliin: &quot;T&auml;ss&auml; kuussa ker&auml;&auml;mme ohjelman XXX rekister&ouml;intimaksuja. Maksa NN mk yhd. tilille osoitetietojesi kera. Maksut l&auml;hetet&auml;&auml;n eteenp&auml;in xx.xx.2000&quot;. Olisin jopa valmis kartuttamaan yhdistyksen kassaa parilla kympill&auml; moisesta palvelusta.<br>
						<br>
						Luullakseni halukkaita maksajia olisi paljonkin, mutta monikaan ei viitsi k&auml;yd&auml; valuuttashekkien tms. kanssa pelaamaan. Itse olisin valmis rekister&ouml;im&auml;&auml;n ainakin MUI:n ja IBrowsen tai Voyagerin. Olen jopa ajat sitten tulostanut MUI:n rekister&ouml;intikaavakkeen, mutta en ole saanut itsest&auml;ni irti niin paljoa, ett&auml; pankissa k&auml;visin...<br>
						<br>
						<hr noshadow noshade size="1">
						<br>
						Vastaus:<br>
						<br>
						Kiitokset mielenkiintoisesta ja monia k&auml;ytt&auml;ji&auml; harmittavaan ongelmaan tarttuvasta ideastasi. Kimppatilauksista on kielt&auml;m&auml;tt&auml; todellista rahassa mitattavaa hy&ouml;ty&auml; tilaajille joilla ei ole luottokorttia, sill&auml; siten he v&auml;ltt&auml;v&auml;t maksum&auml;&auml;r&auml;yksen tai shekin k&auml;sittelyyn liittyv&auml;t palvelumaksut jotka usein ovat pulmallisen korkeita rekister&ouml;it&auml;v&auml;n ohjelman hintaan n&auml;hden.<br>
						<br>
						Jouduimme kuitenkin valitettavasti tekem&auml;&auml;n p&auml;&auml;t&ouml;ksen, ettei yhdistys voi ainakaan nykytilanteessa ryhty&auml; ohjelmien rekister&ouml;intej&auml; v&auml;litt&auml;m&auml;&auml;n. Kuten niin monessa muussakin, my&ouml;s t&auml;ss&auml; p&auml;&auml;llimm&auml;isen&auml; ongelmana on resurssipula. Aiemmista kimppatilausten j&auml;rjest&auml;misist&auml; saamistamme kokemuksista (kuten esimerkiksi taannoisesta A1200-tietokoneiden yhteistilauksesta) tied&auml;mme, ett&auml; ty&ouml;m&auml;&auml;r&auml; tilausten hoitamisessa kaikkine yll&auml;tyksineen ja peruutuksineen on valtava. Omaa vapaa-aikaansa yhdistystoiminnan py&ouml;ritt&auml;miseen jo muutenkin runsaasti lahjoittavat henkil&ouml;t eiv&auml;t ymm&auml;rrett&auml;v&auml;sti voi kovin paljon en&auml;&auml; ty&ouml;m&auml;&auml;r&auml;&auml;ns&auml; lis&auml;t&auml; sitoutumalla toimintaan, joka ei suoranaisesti edes kuulu yhdistyksen toimenkuvaan.<br>
						<br>
						Kaiken lis&auml;ksi yhdistys ei voisi ottaa tilauksien v&auml;litt&auml;misest&auml; palkkiota penni&auml;k&auml;&auml;n yhdistysmuotoon liittyvien tiukkojen s&auml;&auml;nt&ouml;jen noudattamisen takia, joten k&auml;yt&auml;nn&ouml;ss&auml; tuosta muodostuisi oikeastaan useiden ihmisten henkil&ouml;kohtaisen ty&ouml;taakan kasaaminen yhden vapaaehtoisen harteille - jos hiukan raaka ilmaus sallitaan.<br>
						<br>
						Haluan korostaa, ettei ulkomailta itse tilaamistakaan tarvitse nyky&auml;&auml;n pel&auml;t&auml;. Olen itsekin tilannut monia tuotteita ulkomailta, ilman luottokorttia, eik&auml; mit&auml;&auml;n ep&auml;selvyyksi&auml; tai pettymyksi&auml; ole tullut. Ohjeita tilaamiseen voi lueskella vaikkapa Sakunkin aiemmista numeroista, ja pankista kannattaa aina rohkeasti kysy&auml; neuvoa eri maksuvaihtoehdoista ja niiden hinnoista.<br>
						<br>
						<font size="2">Jarmo Piippo</font></td>
				</tr>
			</table>
			</p>
			<p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#d8ecfd">Saku pyrkii asiantuntijoiden avulla selvitt&auml;m&auml;&auml;n ongelmasi ja vastaamaan palautteeseesi Posti-palstan kautta. Voit l&auml;hetell&auml; mielipiteit&auml;si, kysymyksi&auml;si ja vastauksiasi seuraavaan osoitteeseen postitse.<br>
						<br>
						Saku<br>
						c/o Anu Seilonen<br>
						Sammaltie 51<br>
						90650 Oulu<br>
						<br>
						Internet: <a href="mailto:thoriel@sci.fi">thoriel@sci.fi</a><br>
						Sakunet: 65:10/6.0 (Anu Seilonen)<br>
						BBS: Amiga Zone, (015) 348 968 (24h)</td>
				</tr>
			</table>
			</p>
			<p><font size="1" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">[ <a href="hakemisto.html" target="_self">Vakiot</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></center>
	</body>

</html>
