<html>
<head>
<title>Editorial der NoCover</title>
</head>
<body background="bg.jpg" text="#000000" link="#000000" alink="#ff0000"
vlink="#000080"  bgcolor="#b0b0b0">

<center>
<table border=1 width=96%>
<tr><td align=center>
<br><b><font color="#006000" size="7"><i>
NoCover - Das Freeware Mag
</i></font></b></center>
</td></tr></table>

<br><img src="../el.gif" width=365 height=45><br>

<h2><b>zur NoCover #92 (5.11.2001)</b></h2>

<p><img src="el1.gif" width=200 height=36 border=0></p>

<p><img src="el2.gif"></p>

<p>
<table width=96%><TR><TD>
<p><b>Hi Folks!</b></p>

<p>Wie Ihr alle unschwer bemerkt haben d&#252;rftet, liegt die NC in einem leicht modifizierten Gewand vor, welches Euch hoffentlich zusagt. Desweiteren wurden neue Rubriken wie etwa der NC Talk geschaffen, in dem von nun an alles einflie&#223;t, was fr&#252;her in den Rubriken Diskussionen und Leserbriefe gelandet ist. Die Rubrik Online ist vollkommen rausgeflogen und entsprechende Beitr&#228;ge landen von nun an im Bereich Multimedia. So viel zun&#228;chst erstmal zu den Ver&#228;nderungen innerhalb der NC....</P>

<p>In der vorletzten Ausgabe hatte ich bereits geschrieben, dass ich die NC nur weiterf&#252;hren werden, wenn auch die Beteiligung der User stimmt. Nun, damit bin ich in diesem Monat - wie auch an der einen oder anderen Rundmail ersichtlich - nicht so ganz zufrieden. Diverse User haben sich zwar sehr in Zeug gelegt, aber das alleine reicht noch nicht. Ich hoffe doch sehr, dass sich hier noch etwas tut, zumal mir pers&#246;nlich insbesondere die Amiga Themen etwas fehlen. Schreibt doch einfach mal etwas &#252;ber Tools, die ihr gerne benutzt, CD`s die Ihr Euch zugelegt habt oder auch Tipps &amp; Tricks im Umgang mit dem Amiga.</P>

<p>In diesem Zusammenhang m&#246;chte ich auch gleich darauf verweisen, dass ich sowohl die Interview- als auch die Aminet CD Rubrik wieder einf&#252;hren m&#246;chte. Also: Wer m&#246;chte jeden Monat Interviews f&#252;hren und wer ist im Besitz eines Abo`s der Aminet Reihe und w&#252;rde diese alle zwei Monate vorstellen? &#220;ber entsprechende Resonanzen w&#228;re ich sehr dankbar. &#220;ber Resonanzen freut sich sicherlich auch Mrakus Castro, der die Feedback Corner mit dieser Ausgabe wieder eingef&#252;hrt hat. Aus meiner Sicht geh&#246;rt die Feedback Corner zu jeder NoCover fest dazu und somit sollten sich doch bitte ein paar User bei Markus (markus@amigafuture.de) melden, die Interesse daran haben, auch mal eine Feedback Corner zu schreiben. Mehr als einenen Artikle &#252;ber eine vorliegende Ausgabe der NoCover brauch man dabei nicht zu schreiben - es geht einzig und alleine darum, den Autoren etwas Feedback und ggbfl. Tipp`s und Hinweise zu geben. Nat&#252;rlich k&#246;nnt Ihr Euch auch per 
NoCover bei Markus - z.B. in Form eines Leserbriefes - melden. Es w&#228;re sehr sch&#246;n, wenn wir die Feedback Corner wieder eingerichtet kriegen w&#252;rden :-)))</P>

<p>Auch die Mitgliederliste wurde komplett neu gemacht und ich m&#246;chte doch alle User bitten, mir kurz eine aktuelle Vorstellung zukommen zu lassen. Wer es nicht in HTML schafft, der kann es auch als reinen ASCII Text an mich schicken - das ist &#252;berhaupt kein Problem, zumal es keine Schande ist, sich nicht mit HTML auszukennen. Das gleiche gilt nat&#252;rlich auch f&#252;r entsprechende Artikel. Als Beispiel, wie das ganze aufgebaut werden sein sollte, k&#246;nnt ihr ja einfach mal einen Blick in die neue Mitgliederliste werfen.</P>

<p>Themenwechsel hin zum Thema Club und den Diskettenabo`s: Den APC &amp; TCP Club gibt es nicht mehr! Diese Klarstellung war nochmals n&#246;tig, da diesbezgl. momentan ein wenig Verwirrung zu herrschen scheint. Die NoCover bleibt als eigenst&#228;ndiges Magazin mit einer entsprechenden User Gemeinschaft bestehen, 
aber mit dem APC &amp; TCP Club hat das ganze nichts mehr zu tun. Auch m&#246;chte ich nochmal betonen, dass Andreas Magerl nichts mehr mit der NoCover zu tun hat und dementsprechend nicht mehr mit Mails diesbezgl. zugesch&#252;ttet werden sollte. Alles, was irgendwie mit der NoCover zu tun hat, geht an meine Addresse (kilian@apc-tcp.de). Auch mit den Diskettenabo`s hat Andreas nichts mehr zu tun, so dass Ihr Euch im Falle von Fragen aufgrund der Diskabo`s (finanziellen Angelegenheiten, Verl&#228;ngerung oder K&#252;ndigung) an Wolfgang Hass (amiga@haas-computerservice.de per E-Mail; Wolfgang Haas, Neunkirchenstr.115, 97980 Bad Mergentheim per Snail Mail) wenden solltet. &#220;berweisungen per Konto sind nat&#252;rlich auch m&#246;glich, wof&#252;r Ihr folgende Daten ben&#246;tigt: Wolfgang Haas, Konto 22 280 413, BLZ 623 910 10, Volksbank Bad Mergentheim. Das Geld deckt (30 DM / Jahr) dabei lediglich die Unkosten f&#252;r Porto und die Disk`s - ein gro&#223;es Danke an dieser Stelle nochmal an Wolfgang 
Haas, der diesen Bereich &#252;bernommen hat!</P>

<p>Wer &#252;ber einen Internetzugang verf&#252;gt und die NoCover, die inzwischen - ich betone es nochmal - Freeware ist, per E-Mail empfangen m&#246;chte, der kann sich nat&#252;rlich an mich wenden und braucht ausser den Telefonkosten nichts zu zahlen. Die NoCover ist also praktisch kostenlos und mit keinerlei anderen 
Verpflichtungen verbunden.</P> 

<p>So, mal abgesehen von den nicht ganz so zahlreichen Artikeln (was wir aber hinbekommen, wenn jeder mit anpackt!), waren die Resonanzen auf die Freeware NoCover bisher sehr gut. Ich habe sogar Post von einem spanischen und russischen (!!!) Amiga User bekommen. Auch die E-Mail Verteilerliste w&#228;chst immer weiter an, was ja auch ein gutes Zeichen ist. Insofern denke ich schon, dass es mit der NoCover wieder bergauf geht. </P>

<p>Erinnern m&#246;chte ich an dieser Stelle noch an die Amiga Messe, die am 17. und 18. November im K&#246;lner Mediapark stattfindet. So wie es aussieht wird es wohl eine sehr interessante Messe werden und ich hoffe doch, dass auch zahlreiche NoCover Leser vor Ort sein werden. Ein kleines Treffen k&#246;nnen wir ja
auch machen - ich schlage daf&#252;r einfach mal 13 Uhr am APC &amp; TCP Stand vor. Soweit m&#246;glich werde ich wohl auch vor Ort sein.</P>


<p>Mit diesem etwas l&#228;ngeren Editorial entlasse ich Euch alle auch schon in die aktuelle Ausgabe und w&#252;nsche Euch viel Spa&#223; beim Lesen. See ya,</P>

<b>Kilian <blink>&quot;The Bruce&quot;</blink> Servais<br>
kilian@apc-tcp.de</b></P>
</td></tr></table>
<p><img src="el2.gif"></p>
<h3><b><a href="../nc/index.html"> zur NoCover </a> &#160; &#160;
<a href="../aa/index.html"> zu AmigaAktuell </a> &#160; &#160;
<a href="../index.html"> zum Start </a></b></h3>
</center>

<br>
</BODY>
</HTML>
