<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>St. Louisin antia - Amiga 2001</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
							Valokuvat (luvalla): Wayne Hunt / Amiga.org</font></td>
				</tr>
			</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="amiga2001.html" target="_self">Osa 1</a> ] [ <a href="amiga2001_2.html" target="_self">Osa 2</a> ] [ Osa 3 ] [<a href="amiga2001_4.html" target="_self"> Osa 4</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Amiga huopasi kolme vuotta</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Ehdottomasti tapahtuman odotetuinta antia, etenkin sit&auml; ulkopuolelta seuraaville, olivat kuitenkin Amiga Inc.:n julkistukset, jotka tapahtuivat lauantain juhlaillallisella. Ne esitteli jo tutuksi tullut nahkabootsimies, Amigan toimitusjohtaja Bill McEwen.</font></p>
						<div align="center">
							<p><img src="kuvat/mcewen.jpg" width="360" height="241" border="0" alt="Bill McEwen"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Eiv&auml;tk&auml; ne uutiset olleet aivan sit&auml; mit&auml; odotettiin, v&auml;hint&auml;&auml;nkin ne olivat yll&auml;tt&auml;vi&auml;. Uusi Amiga Inc. ei puheistaan huolimatta ole hirve&auml;sti poikennut edelt&auml;jist&auml;&auml;n siin&auml;, ett&auml; suunnitelmat pit&auml;isiv&auml;t - ja aivan kuten edellisen Gateway Computer Shown j&auml;lkeen pelkk&auml;&auml;n d'Amigaan perustunut developer-strategia vaihdettiin palautteen pohjalta SDK:n myyntiin erill&auml;&auml;n, muuttuivat Amigan suunnitelmat j&auml;lleen kerran, joskin t&auml;ll&auml; kertaa varmasti enemm&auml;n suurten yhteysty&ouml;tahojen ja rahan kuin niink&auml;&auml;n Amiga-yhteis&ouml;n painostuksesta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Aikaisemmin Amigan julkistama suuntahan oli sangen selke&auml;: Amiga Digital Environment joka paikkaan, Classic Amiga ja AmigaOS pidet&auml;&auml;n tekohengityksess&auml; jonkin aikaa, mutta sitten Amigan perint&ouml; siirret&auml;&auml;n kokonaan uuden Amiga DE:n jatkettavaksi. T&auml;t&auml; my&ouml;s perusteltiin meille pitk&auml;&auml;n ja hartaasti. T&auml;llaista strategiaa tukemaan esiteltiin my&ouml;s AmigaONE-tietokone, jonka piti alkujaan toimia AmigaOS:ll&auml; ja hy&ouml;dynt&auml;&auml; vanhan Amigan emolevy&auml; yhteensopivuuteen, kunnes AmigaDE olisi riitt&auml;v&auml;n valmis korvaamaan edelt&auml;j&auml;ns&auml;. Osa t&auml;st&auml; strategiasta on s&auml;ilynyt ennallaan, mutta Bill McEwen kertoi my&ouml;s merkitt&auml;vist&auml; muutoksista suunnitelmaan.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Unohtakaa puheet Classic Amigasta ja AmigaOS:n kuolemasta. Voitte saman tien unohtaa my&ouml;s puheet siit&auml;, ett&auml; Amiga ei jatka AmigaOS:n kehitt&auml;mist&auml; mik&auml;li 3.9-p&auml;ivitys ei myy tarpeeksi. Vanhat suunnitelmat ja poloisen Amiga-kansan ymm&auml;rryskyky saivat kyyti&auml; kun McEwen paukutti keskil&auml;nnen h&auml;m&auml;rtyv&auml;ss&auml; illassa p&ouml;yt&auml;&auml;n business planin uusjaon: k&auml;site Classic Amiga hyllytet&auml;&auml;n - en&auml;&auml; on vain vanha tuttu Amiga, AmigaOS portataan PowerPC:lle ja AmigaDE:n desktop-versiosta luovutaan. Kyll&auml;, AmigaOS portataan PowerPC:lle ja AmigaDE:n desktop-versiosta luovutaan.</font></p>
						<div align="center">
							<p><img src="kuvat/notdie.jpg" width="360" height="284" border="0" alt="Amiga ei kuole"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edellisen kerran perinteisen Amigan edist&auml;mist&auml; tosissaan on sen omistajista yritt&auml;nyt Escom vuonna 1995. Sek&auml; Gateway ett&auml; nykyinen Amiga Inc. ovat ajaneet melko samantyylist&auml; digitaaliseen yhdentymiseen pohjaavaa strategiaa, jossa vanhasta Amigasta k&auml;ytet&auml;&auml;n vain hyvi&auml; ideoita, hyvi&auml; ihmisi&auml; ja hyv&auml; nimi. AmigaOS 3.5 ja 3.9 ovat olleet pelkki&auml; siirtym&auml;vaiheen p&auml;ivityksi&auml;, joilla kehitt&auml;j&auml;-, j&auml;lleenmyyj&auml;- ja k&auml;ytt&auml;j&auml;yhteis&ouml;j&auml; ollaan yritetty virkist&auml;&auml; ja pit&auml;&auml; elossa l&auml;pi pitk&auml;n odotuksen. Haage &amp; Partner ja muutamat muut tahot ovat tyk&ouml;n&auml;&auml;n edist&auml;neet AmigaOS:&auml;&auml; pienin askelin, mutta kolmisen vuotta Amigan p&auml;&auml;suunta on ollut jotakuinkin &quot;puhtaalta p&ouml;yd&auml;lt&auml; sellainen uusi digitaalinen yleisihme&quot;.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">McEwen huopasi kolmen vuoden soutamisen yhdess&auml; illassa ilmoittamalla, ett&auml; vanha sotaratsu, AmigaOS, saa sittenkin todellista jatkoa. Eik&auml; t&auml;m&auml; tosiaankaan riitt&auml;nyt showstopperiksi, sill&auml; samaan hengenvetoon h&auml;n ilmoitti, ettei AmigaDE:t&auml; tulla lainkaan markkinoimaan p&ouml;yt&auml;koneiden k&auml;ytt&ouml;j&auml;rjestelm&auml;n&auml;. Syyksi suunnanmuutokseen paljastui yhteisty&ouml;kumppaneiden haluttomuus tukea uuden desktop-k&auml;ytt&ouml;j&auml;rjestelm&auml;n kehityst&auml; - viimeksih&auml;n Be Inc. kokeili ja ep&auml;onnistui, eiv&auml;tk&auml; IT-alan kehnot rahoitusn&auml;kym&auml;t ole tehneet tilannetta Amigalle helpoksi. Toisaalta Amiga-yhteis&ouml;ss&auml; on edelleen &auml;&auml;nekk&auml;it&auml; ryhmi&auml;, jotka ovat toivoneet AmigaOS:n jatkokehityst&auml;. Siisp&auml; suunnitelma uusiksi.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>K&auml;ytt&ouml;j&auml;rjestelm&auml; naftaliinista</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Bill McEwen ja my&ouml;hemmin Internetiss&auml; my&ouml;s Amigan teknologiajohtaja Fleecy Moss painottivat Amiga Digital Environmentin olevan edelleen keskeinen ja kokonaisvaltainen osa Amigan suunnitelmaa. Se tuodaan my&ouml;s desktop-ymp&auml;rist&ouml;ihin muiden k&auml;ytt&ouml;j&auml;rjestelmien kylki&auml;isen&auml;. Strategian ydinajatuksena on, edelleen, rakentaa t&auml;ydellinen digitaalinen ratkaisu, joka yhdist&auml;&auml; sis&auml;ll&ouml;n, datan, sovellukset ja k&auml;ytt&auml;j&auml;t saumattomasti miss&auml; tahansa laitteessa tai verkossa. Tai jotain. McEwen n&auml;ytti j&auml;lleen kerran tutun kuvan talosta elektronisine laitteineen - kuvan, joka tuli tutuksi jo Jim Collasin muinaisissa presentaatioissa.</font></p>
						<div align="center">
							<p><img src="kuvat/revolution.jpg" width="360" height="280" border="0" alt="Revolution"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;ss&auml; suunnitelmassa on Taon kehitt&auml;m&auml;ll&auml; Elate-j&auml;rjestelm&auml;ll&auml; keskeinen rooli ohjelmakoodin universaalitulkkina ja Amigan Digital Environment -kerros tuo mukanaan menetelmi&auml; tiedon saumattomaan jakamiseen. Tai n&auml;in meille ainakin kerrotaan, sill&auml; tarkempia yksityiskohtia t&auml;st&auml; digitaalisesta ymp&auml;rist&ouml;st&auml; ei Elatea lukuunottamatta ole viel&auml; annettu. Amigan suunnitelmana oli alkujaan tarjota AmigaDE:t&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;ratkaisuna aina matkapuhelimesta palvelimeen, mutta nyt suunnitelmaa sorvataan uuteen uskoon nimenomaan p&ouml;yt&auml;- ja palvelinratkaisuiden osalta.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Edell&auml; mainituista syist&auml; Haage &amp; Partnerin tekohengityksess&auml; pit&auml;m&auml; AmigaOS irrotetaan letkuista ja tuodaan takaisin Amigan hell&auml;&auml;n hoivaan. Amiga Inc. ottaa AmigaOS:n kehitysty&ouml;n valvontaansa ja jatkaa sen kehitt&auml;mist&auml; yhteisty&ouml;ss&auml; mm. Haage &amp; Partnerin, Hyperionin ja Picasso96:n tekij&ouml;iden kanssa. AmigaDE ja AmigaOS yhdistyv&auml;t siten, ett&auml; AmigaOS:n k&auml;ytt&auml;j&auml;t p&auml;&auml;sev&auml;t k&auml;siksi AmigaDE:n palveluihin ja voivat samalla edelleen k&auml;ytt&auml;&auml; my&ouml;s vain AmigaOS:lle kehitettyj&auml; ohjelmia.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Muut ymp&auml;rist&ouml;t kuten k&auml;mmenmikrot ja k&auml;nnyk&auml;t voivat k&auml;ytt&auml;&auml; AmigaDE:t&auml; natiivina tai oman k&auml;ytt&ouml;j&auml;rjestelm&auml;ns&auml; p&auml;&auml;ll&auml;, ajaen AmigaDE:lle tehtyj&auml; sovelluksia laitteesta riippumatta. Samaten AmigaDE voidaan asentaa Windowsiin tai Macintoshille (esimerkiksi jonkin sovelluksen osana), jolloin kaikista n&auml;ist&auml; laitteista p&auml;&auml;st&auml;&auml;n k&auml;siksi samaan tietoon ja samoihin ohjelmiin. Sen sijaan AmigaOS-ohjelmia ei muilla AmigaDE-laitteilla voida ajaa, joten t&auml;ss&auml; mieless&auml; AmigaOS:n markkinat pysyv&auml;t erossa muusta maailmasta. Amigalta kuitenkin vakuutettiin, ett&auml; AmigaOS tulee olemaan keskeinen osa heid&auml;n strategiaansa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Tietyll&auml; tavalla AmigaOS:n jatkaminen universaalin AmigaDE-konseptin sijaan on kuitenkin takapakkia yleiseen visioon &quot;kaikki toimii kaikkialla&quot;. Kenties koko visio on silkka mahdottomuus, etenkin nykyisiss&auml; markkinaolosuhteissa, mutta toistaiseksi esitetyn pohjalta AmigaDE:st&auml; on profiloitumassa enemm&auml;nkin universaali ohjelma-alusta pienlaitteille ja sulautetuille j&auml;rjestelmille, kun taas desktop-ymp&auml;rist&ouml;ss&auml; p&auml;tev&auml;t edelleen vanhat viidakon lait. T&auml;t&auml; spekulaatiota tukevat my&ouml;s Bill McEwenin tekem&auml;t PDA-yhteisty&ouml;julkistukset.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>5.0, 4.5, 4.2, 4.0, liftoff...</b></font></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Seuraava AmigaOS-versio tulee olemaan AmigaOS 4.0, joka k&auml;&auml;nnet&auml;&auml;n PowerPC:lle. AmigaOS 4.0 julkaistaan kes&auml;ll&auml; ja Eyetechin masinoima AmigaONE-tietokone, joka julkaistaan hein&auml;kuussa muutamia kuukausia aikataulusta my&ouml;h&auml;ss&auml;, tulee k&auml;ytt&auml;m&auml;&auml;n sit&auml;. Amiga Inc. k&auml;ytt&auml;&auml; AmigaOS:n p&auml;ivitt&auml;miseen alihankkijoita sek&auml; Haage &amp; Partnerin viime vuosien kehitysty&ouml;n tuloksia, mutta tulee jatkossa tekem&auml;&auml;n merkitt&auml;v&auml;n osan kehitysty&ouml;st&auml; ja etenkin sen hallinnoinnista itse.</font></p>
						<div align="center">
							<p><img src="kuvat/os40.jpg" width="360" height="293" border="0" alt="OS 4.0"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AmigaOS 4.0 ei tule viel&auml; sis&auml;lt&auml;m&auml;&auml;n AmigaDE-komponentteja, vaan ne kuuluvat vasta versioon 4.2. Muita mainittuja, suunniteltuja versioita olivat AmigaOS 4.5 ja 5.0. P&auml;ivitysten sis&auml;ll&ouml;st&auml; liikkuu ristiriitaisia tietoja, mutta Eyetechin messuilla ollut edustaja Alan Redhouse sivusi aihetta vastaillessaan kysymyksiin AmigaONEsta. Alan kertoi, ett&auml; riippuen AmigaOS 4.0:n julkaisuaikataulusta AmigaONE saattaa vaatia aluksi Amigan emolevyn toimiakseen. AmigaONE 1200, joka julkaistaan ensin, kelpuuttaa rinnalleen Amiga 1200:n emolevyn, jota se k&auml;ytt&auml;&auml; ohjelmistoyhteensopivuuden takaamiseen.</font></p>
						<div align="center">
							<p><img src="kuvat/summary.jpg" width="360" height="275" border="0" alt="Yhteenveto"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kun AmigaOS 4.0 julkaistaan, AmigaONE ei en&auml;&auml; tarvitse Amigan emolevy&auml; ellei haluta ajaa sellaisia ohjelmia, jotka tarvitsevat perinteisi&auml; Amigan erikoispiirej&auml;. Koska on ep&auml;selv&auml;&auml; onko OS 4.0 t&auml;ysin valmis AmigaONE:n julkaisuhetkell&auml;, Eyetech harkitsee edelleen my&ouml;s Amiga 4000:n emolevyn kanssa yhteensopivaa versiota AmigaONEsta. He eiv&auml;t kuulemma voi keskitty&auml; kuin yhteen tuotteeseen kerrallaan, joten helpommalla ja markkinoiden kannalta paremmalla Amiga 1200 -versiolla on etusija. A4000-version pariin palataan A1200-version julkaisun j&auml;lkeen. Alan piti my&ouml;s mahdollisena, ettei Amiga 4000 -versiota tehd&auml; lainkaan jos OS 4.0 ilmestyy ajoissa. Amiga 3000 -versio AmigaONEsta lienee kokonaan poissuljettu mahdollisuus.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">AmigaONE on sin&auml;ns&auml; t&auml;ysin itsen&auml;inen tietokone, joka tarvitsee vanhan Amigan emolevy&auml; vain ohjelmiston yhteensopivuussyist&auml;. AmigaOS 4.5:n my&ouml;t&auml; t&auml;m&auml;nkin rajoituksen pit&auml;isi kaikota, sill&auml; OS 4.5:n lupaillaan olevan puhdasta PowerPC-koodia ja olevan (muilta osin) paitsi laitteistosta riippumaton, my&ouml;s kykenev&auml; suorittamaan vanhoja ohjelmia ilman vanhan Amigan tukea. K&auml;ytt&ouml;j&auml;rjestelm&auml; tulee sis&auml;lt&auml;m&auml;&auml;n my&ouml;s 68k-emulaattorin, joten vanhoja ohjelmia varten ei tarvita erillist&auml; 68k-sarjan suoritinta.</font></p>
						<div align="center">
							<p><img src="kuvat/amigaone.jpg" width="320" height="240" border="0" alt="AmigaONE"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Alan Redhouse esitteli Amiga 2001 -messuilla yht&auml; kolmesta valmistetusta AmigaONE-emolevyn prototyypist&auml;. Emolevy tulee olemaan ATX-standardin mukainen ja sopii siten tavalliseen PC:n koteloon - paitsi tietysti jos mukaan halutaan mahduttaa vanhan Amigan emolevy, tarvitaan nykyisten Amiga-tornien kaltainen erikoistorni - itse asiassa osa nykyisist&auml; Amiga-torneista sopii tarkoitukseen. Emolevyll&auml; on kuusi PCI-paikkaa, AGP-liitin, v&auml;yl&auml; prosessorikortille, jolle sopii G3- tai G4-sarjan PowerPC-suoritin, sek&auml; tavanomaiset liit&auml;nn&auml;t USB:st&auml; IDEen.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">J&auml;lleenmyyjille j&auml;tet&auml;&auml;n mahdollisuus myyd&auml; AmigaONEsta erilaisia kokoonpanoja ja Eyetech vakuutteli, ett&auml; vaikka he ovat yksi j&auml;lleenmyyjist&auml;, tarjotaan kaikille mahdollisuus tasav&auml;kiseen kilpailuun. AmigaONE-laitteita, jotka perustuvat Amigan zico-spesifikaatioon, tulevat valmistamaan muutkin valmistajat kuin Eyetech, mm. saksalainen bPlan. N&auml;in ollen markkinoille tulee toivottavasti runsaasti erilaisia vaihtoehtoja ja samalla varmuutta, saatavuutta sek&auml; valikoimaa, jota yksitt&auml;inen pieni valmistaja ei pystyisi takaamaan. AmigaONEn mukaan aiotaan paketoida my&ouml;s joitakin 3D-pelej&auml;.</font></p>
					</td>
				</tr>
			</table>
			<center>
				<center>
					<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="amiga2001.html" target="_self">Osa 1</a> ] [ <a href="amiga2001_2.html" target="_self">Osa 2</a> ] [ Osa 3 ] [ <a href="amiga2001_4.html" target="_self">Osa 4</a> ]</font></p>
					<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
				</center>
			</center>
		</center>
	</body>

</html>