<!!!!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Testit</title>
		<meta name="generator" content="Handmade in Finland">
	</head>

	<body bgcolor="white" link="navy" alink="red" vlink="navy">
		<center>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="100%" bgcolor="navy" align="center"><font color="yellow" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular"><b>St. Louisin antia - Amiga 2001</b></font></td>
				</tr>
				<tr height="15">
					<td width="100%" height="15" bgcolor="#d8ecfd" align="center"><font color="#000066" size="2" face="Arial,Helvetica,Geneva,Swiss,SunSans-Regular">Janne Sir&eacute;n &lt;<a href="mailto:siren@mikrobitti.fi">siren@mikrobitti.fi</a>&gt;<br>
							Valokuvat (luvalla): Wayne Hunt / Amiga.org</font></td>
				</tr>
			</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="amiga2001.html" target="_self">Osa 1</a> ] [ Osa 2 ] [ <a href="amiga2001_3.html" target="_self">Osa 3</a> ] [ <a href="amiga2001_4.html" target="_self">Osa 4</a> ]</font></p>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
				<tr>
					<td width="50%" bgcolor="#b0c4de" align="center"><b><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Promokr&auml;&auml;s&auml;&auml; ja propagandaa</font></b></td>
				</tr>
				<tr>
					<td width="50%" bgcolor="#d8ecfd"><p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Toinen piirre, jossa jenkkil&auml;iset Amiga-messut ovat usein poikenneet eurooppalaisista vastineistaan ovat koulutustilaisuudet, joita on yleens&auml; l&auml;pi tapahtuman. T&auml;ll&auml;kin kertaa koulutustilaisuudet alkoivat Amiga 2001 -messuilla jo perjantaina ja jatkuivat aina sunnuntaille saakka, kun itse n&auml;yttelyosuus oli avoinna vain lauantain ja sunnuntain. Osa seminaareista ja opetussessioista oli ilmaisia, osasta laskutettiin parinkymmenen dollarin maksu.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Koulutusta j&auml;rjestettiin mm. Zorro II -suunnittelussa sek&auml; ohjelmien kuten PageStreamin ja ImageFX:n k&auml;yt&ouml;ss&auml;. Opetuksesta vastasivat erin&auml;iset n&auml;ytteilleasettajinakin toimineet yritykset. My&ouml;s Amiga Inc. j&auml;rjesti koulutusta perjantaina. Amigan Rudi Chiarito piti seminaarin Amiga DE:n ohjelmistokehityksest&auml; ja Gary Peake is&auml;nn&ouml;i j&auml;lleenmyyjille suunnattua tilaisuutta. Lis&auml;ksi lauantaina Gary ja Rudi esitelm&ouml;iv&auml;t aiheesta &quot;Amiga - Where are we today&quot;.</font></p>
						<div align="center">
							<p><img src="kuvat/merlancia.jpg" width="360" height="241" border="0" alt="Merlancia"></p>
							<p><img src="kuvat/amiopoly.jpg" width="360" height="241" border="0" alt="Amiopoly"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Messuille oli reilut parikymment&auml; n&auml;ytteilleasettajaa, mukana yhdysvaltalaisia j&auml;lleenmyyji&auml;, Amiga-k&auml;ytt&auml;j&auml;ryhmi&auml; sek&auml; kansainv&auml;linen joukko Amiga-ohjelmistoja ja -lis&auml;laitteita valmistavia yrityksi&auml;, kuten Haage &amp; Partner, Individual Computers ja Cloanto. N&auml;ytill&auml; oli mm. Haage &amp; Partnerin nelosversio StormC-ohjelmointiymp&auml;rist&ouml;st&auml; ja j&auml;lleenmyyj&auml; Mr. Hardware Computers esitteli uusia PC-kortteja. N&auml;m&auml; kortit ovat t&auml;ydellisi&auml; PC-emolevyj&auml; rakennettuna t&auml;ysikokoiselle &quot;ISA-kortille&quot;, joka mahtuu (esimerkiksi) Amigan kotelon sis&auml;&auml;n.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;llaisen kortin voi asentaa Amiga 2000/3000/4000:n ISA-korttipaikkaan, joskaan kortti ei ole miss&auml;&auml;n yhteydess&auml; Amigaan - korttipaikkaa k&auml;ytet&auml;&auml;n vain &quot;emolevyn&quot; asennuspaikkana, eik&auml; se sin&auml;ns&auml; ole v&auml;ltt&auml;m&auml;t&ouml;n kortin toiminnalle. PC toimii t&auml;ysin irrallaan Amigasta, joskin Mr. Hardware tarjoaa my&ouml;s ratkaisuita n&auml;pp&auml;imist&ouml;n ja hiiren jakamiseen. Kortit on varustettu esimerkiksi gigahertsisen Pentium III:n lis&auml;ksi Sys 630 -piirisarjan yhdysrakenteisella n&auml;yt&ouml;nohjaimella, &auml;&auml;nipiirill&auml;, 128 megatavun muistilla ja t&auml;ydellisell&auml; valikoimalla liittimi&auml;. Korttien hinnat jenkkil&auml;ss&auml; alkavat noin 300 dollarista.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Saksalainen Jens Sch&ouml;nfeld Individual Computers -firmoineen esitteli messuilla uutta VarIO-Zorro-korttiaan, joka korvaa loppuun myydyn HyperCOM-I/O-kortin Zorro-version ja tuo mukanaan uusia ominaisuuksia. Jens esitteli my&ouml;s Thore B&ouml;ckelmannin tekem&auml;n uuden ajurij&auml;rjestelm&auml;n, joka korvaa HyperIO:n ja silversurfer.devicen, ja josta pit&auml;isi riitt&auml;&auml; iloa my&ouml;s nykyisille SilverSurferin ja GoldSurferin omistajille. Jens esitteli yhdess&auml; Cloanton kanssa my&ouml;s Catweaselin ISA-versiota, jolla voi PC:ll&auml; lukea Amigan levykkeit&auml;. Joku tosin kiirehti huomauttamaan ettei monissa uusissa PC:iss&auml; en&auml;&auml; ole ISA-paikkoja...</font></p>
						<div align="center">
							<p><img src="kuvat/stlouis.jpg" width="360" height="241" border="0" alt="Amigan-St. Louis"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Lis&auml;ksi Amigan-St. Louis myi aikaisempien vuosien tapaan jo legendaariseksi muodostuneita Magical Amiga -mukeja, joiden teksti muuttuu mukin l&auml;mmetess&auml;. Amigan-St. Louis myi my&ouml;s muuta Amigan promootiokr&auml;&auml;s&auml;&auml; ja Annexin CD-levyj&auml; Petron allekirjoitellessa niit&auml; paikanp&auml;&auml;ll&auml;. Tapahtumassa katseltiin my&ouml;s meille suomalaisillekin tuttua Deathbed Vigil -videota - Amiga-tapahtumien kestosuosikki number one. Amigalla itsell&auml;&auml;n ei ollut st&auml;ndi&auml;, paitsi promootiovaatteiden myyntiin, joskin Amigan henkil&ouml;st&ouml; kierteli tapahtumassa ymp&auml;riins&auml;. N&auml;yttelysali oli viimevuotista pienempi, mutta ihmisi&auml; riitti paikoin ihan ruuhkaksi asti.</font></p>
					</td>
				</tr>
			</table>
			<br>
			<table border="0" cellpadding="4" cellspacing="1" width="80%" bgcolor="navy">
					<tr>
						<td width="50%" bgcolor="#b0c4de" align="center"><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2"><b>Pieni piiri py&ouml;rii</b></font></td>
					</tr>
					<tr>
						<td width="50%" bgcolor="#d8ecfd">
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Kuten useilta aikaisemmiltakin Amiga-messuilta, my&ouml;s Amiga 2001:sta oli hyv&auml;t yhteydet Internetiin. User Group Network j&auml;rjesti l&auml;pi tapahtuman kest&auml;v&auml;n Shoutcast-&auml;&auml;niyhteyden, jonka kautta v&auml;litettiin Internetiin tosiaikaista tilannetietoa tapahtumasta sek&auml; mielenkiintoisia henkil&ouml;haastatteluja. UGN:ll&auml; oli tapahtumapaikalla my&ouml;s web-kamera sek&auml; se kuuluisa ilmalaivakamera. Mikrofonin &auml;&auml;reen puolestaan saattoi l&auml;hett&auml;&auml; kysymyksi&auml; ICQ:n kautta.</font></p>
						<div align="center">
							<p><img src="kuvat/webcam.jpg" width="360" height="240" border="0" alt="UGN webcam"></p>
							<p><img src="kuvat/radio.jpg" width="360" height="241" border="0" alt="Shoutcast-radio"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">UGN ei t&auml;n&auml; vuonna j&auml;rjest&auml;nyt IRC-konferensseja, sill&auml; niit&auml; on viime vuosina vaivannut liian usein hakkereiden hy&ouml;kk&auml;ykset. Amiganet.org-palvelinten #developer-kanavalla oli kuitenkin l&auml;pi messujen vilkasta keskustelua ja siell&auml; vieraili useita kuuluisuuksia, kuten Amiga Inc.:n Fleecy Moss. Raporttien mukaan Fleecy itse ei ollut tapahtumassa mukana viisumisyist&auml;. Fleecy, joka on yksi uuden Amiga Inc.:n perustajista, on Britannian kansalainen ja on asunut Yhdysvalloissa useamman vuoden, olihan h&auml;n t&ouml;iss&auml; Amigalla jo Gatewayn aikoina. Yhdysvaltain viisumilakien mukaan h&auml;nen oleskelulupansa on mennyt umpeen ja h&auml;n saa palata maahan vasta syyskuussa. T&auml;m&auml; hullunkurisuus on hy&ouml;dyksi meille t&auml;&auml;ll&auml; Euroopassa, onhan Fleecy&auml; hiljattain n&auml;hty eurooppalaisilla Amiga-messuilla...</font></p>
						<div align="center">
							<p><img src="kuvat/blimpcam.jpg" width="360" height="240" border="0" alt="Blimpcam"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Yksi messuilta UGN:n Shoutcast-yhteyden p&auml;&auml;h&auml;n tavoitettu henkil&ouml; oli Amiga-legenda Dave Haynie. Dave, joka ty&ouml;skentelee nykyisin perustamassaan met@box-yrityksess&auml;, kertoi olevansa messuilla osin yrityksens&auml; asialla, arvioimassa AmigaDE:n mahdollista soveltuvuutta met@boxin tulevaisuudensuunnitelmiin. Dave on parhaillaan pystytt&auml;m&auml;ss&auml; yhdysvaltain osastoa Saksassa p&auml;&auml;majaansa pit&auml;v&auml;lle yritykselle. H&auml;n kertoi ett&auml; AmigaDE vaikuttaa sangen mielenkiintoiselta, mutta sen enemp&auml;&auml; sen k&auml;ytt&ouml;kelpoisuudesta met@boxin toiminnassa h&auml;n ei osannut viel&auml; sanoa.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Dave kertoi my&ouml;s mit&auml; on puuhastellut Commodoren konkurssin j&auml;lkeen - h&auml;nh&auml;n ty&ouml;skenteli Commodorella Amiga-insin&ouml;&ouml;rin&auml; yrityksen konkurssiin saakka ja mies muistetaan klassisesta Deathbed Vigil -dokumentistaan. Commodoren j&auml;lkeen Dave siirtyi Scalalle, jonka ohjelmia he olivat Commodorellakin ahkerasti k&auml;ytt&auml;neet vaikka johdon ohjeiden mukaan olisi pit&auml;nyt k&auml;ytt&auml;&auml; Commodoren omaa presentaatio-ohjelmaa. Dave teki Scalalla ohjelmistoja ja oli siirtym&auml;ss&auml; laitteistojenkin pariin, kunnes Scala huomasi ettei heid&auml;n suunnittelemalleen presentaatioidentoistolaitteelle ollut pahemmin tarvetta kannettavien mikrojen vallatessa alaa. Viimeinen tikki Davelle oli se, ett&auml; Scala alkoi tehd&auml; sovelluksia Microsoft-ymp&auml;rist&ouml;ihin ja niinp&auml; h&auml;n pelkk&auml;&auml;n ohjelmistokehitykseen kyll&auml;styneen&auml; l&auml;hti tutkimaan muita vaihtoehtoja.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Juuri n&auml;ihin aikoihin, vuonna 1995, Escom oli ostanut Amigan ja perustanut Amiga Technologiesin. Amiga Technologies, jota siis johti Petro Tyschtschenko Saksassa, otti Dave Haynieen ja toiseen Amiga-insin&ouml;&ouml;riin Andy Finkeliin yhteytt&auml; ja kysyi haluisivatko he suunnitella PowerPC-pohjaisen Amigan. Niinp&auml; Dave ja Andy saivat pestin toteuttaa Power Amigan. Dave vastasi laitteistosta ja Andy ohjelmistosta. Power Amigasta piti tulla noin 500 dollarin hintainen PowerPC-pohjainen Amiga, joka olisi julkaistu tammikuussa 1997. Mutta kuten tied&auml;mme, n&auml;in ei tapahtunut. Daven ja Andyn pesti kesti vain pari kuukautta, kunnes Escom ilmoitti ett&auml; rahoitusta ei en&auml;&auml; tipu ja hieman sen j&auml;lkeen koko firma menikin konkurssiin.</font></p>
						<div align="center">
							<p><img src="kuvat/haynie.jpg" width="360" height="291" border="0" alt="Dave Haynie"></p>
						</div>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">T&auml;m&auml;n j&auml;lkeen Dave ja Andy perustivat kumppaneineen PIOS Computer -nimisen yrityksen Saksaan. PIOSille siirtyi paljon v&auml;ke&auml; entiselt&auml; Amiga Technologiesilta. PIOS kokeili ensialkuun siipi&auml;&auml;n Macintosh-kloonien valmistajana ja pyrki rakentamaan avointa PowerPC-arkkitehtuuria. He yrittiv&auml;t saada k&auml;ytt&ouml;j&auml;rjestelm&auml;lisenssi&auml; my&ouml;s Amigalta vuonna 1997, mutta noihin aikoihin tilanne oli viel&auml; niin kaoottinen, ettei kukaan oikein suostunut puhumaan heille. Niinp&auml; PIOS keskittyi Macintoshiin, sill&auml; Linuxkaan ei viel&auml; tuolloin ollut riitt&auml;v&auml;n suuri tekij&auml;. Sitten Apple p&auml;&auml;tti vet&auml;&auml; t&ouml;pselin sein&auml;st&auml; kloonivalmistajilta ja PIOS, joka sittemmin vaihtoi nimekseen met@boxiksi, oli menn&auml; nurin ja siirtyi pakon edess&auml; set-top-markkinoille.</font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">Met@box tekee my&ouml;s PowerPC-kiihdytinkortteja Macintoshille, mutta he eiv&auml;t Daven mukaan aio jatkaa niiden kehitt&auml;mist&auml; vaan met@box keskittyy set-top-laitteisiin. Amigalle taannoin suunniteltu versio t&auml;llaisesta kortista on valitettavasti peruttu - se oli er&auml;&auml;n insin&ouml;&ouml;rin vapaa-ajanprojekti, jonka loppuunsaattamiselle ei ole l&ouml;ytynyt tarpeeksi aikaa eik&auml; resursseja. Dave Haynie kertoi my&ouml;s, ett&auml; tekem&auml;ns&auml; DiskSalv-ohjelman kehityst&auml; saatetaan jatkaa ja se julkaistaan kenties ilmaisjakeluun. T&auml;ll&auml; hetkell&auml; ohjelmaa ei voi h&auml;nen mukaansa ostaa mist&auml;&auml;n, sill&auml; sen julkaisija on lopettanut toimintansa. </font></p>
						<p><font face="Trebuchet MS,Verdana,Arial,Helvetica" size="2">My&ouml;s Leo Schwab ja Jason Compton k&auml;viv&auml;t juttelemassa web-radiolle. Leo tunnetaan parhaiten ty&ouml;st&auml;&auml;n Disney Animation Studion parissa sek&auml; erin&auml;isist&auml; Amiga-hackeistaan, kuten hiirenosoittimen kimppuun hy&ouml;kk&auml;&auml;v&auml;st&auml; Robotroffista (ks. Aminet). Leo on nykyisin t&ouml;iss&auml; Be Inc.:ll&auml; ja tekee n&auml;ytt&ouml;ajureita. Jason muistetaan elektronisesta Amiga Report -lehdest&auml;&auml;n. Sittemmin h&auml;n on jatkanut journalistiuraansa Linux-julkaisuissa ja on kirjoittanut Linux-aiheisen kirjan. Jason kirjoitti my&ouml;s CU Amigaan lehden lopettamiseen saakka ja kirjoittelee edelleen satunnaisesti AmigActiveen. Esimerkkin&auml; j&auml;lkimm&auml;isen lis&auml;ksi brittil&auml;inen Computing-lehti tilasi Jasonilta lehtijutun Amiga 2001 -messuista.</font></p>
					</td>
					</tr>
				</table>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="amiga2001.html" target="_self">Osa 1</a> ] [ Osa 2 ] [ <a href="amiga2001_3.html" target="_self">Osa 3</a> ] [ <a href="amiga2001_4.html" target="_self">Osa 4</a> ]</font></p>
			<p><font size="1" face="Trebuchet MS,Verdana,Arial,Helvetica">[ <a href="hakemisto.html" target="_self">Ajankohtaiset</a> ] [ <a href="../sivukartta.html" target="_self">Sivukartta</a> ]</font></p>
		</center>
	</body>

</html>